#Область СлужебныйПрограммныйИнтерфейс

// См. КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьПароль
Функция ПолучитьПароль(СсылкаНаОбъект, Ключ) Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьПароль(СсылкаНаОбъект, Ключ);
	
КонецФункции

// См. КонтурЛогистика_ОбщегоНазначенияСервер.ЗаписатьПароль
Процедура ЗаписатьПароль(Владелец, Данные, Ключ = "Пароль") Экспорт
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ЗаписатьПароль(Владелец, Данные, Ключ);
	
КонецПроцедуры

#КонецОбласти