&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мсвКоличестваСимволов = Новый Массив;
	Для Число = 1 По МаксЧислоСимволов Цикл
		мсвКоличестваСимволов.Добавить(Число);	
	КонецЦикла;                                  
	Элементы.КоличествоСимволов.СписокВыбора.ЗагрузитьЗначения(мсвКоличестваСимволов);	
	КоличествоСимволов = 6;         
			
	#Если ТолстыйКлиентОбычноеПриложение Тогда                  
		Элементы.НадписьПароль.Видимость 		= ГенерацияПароля;
		Элементы.КоличествоСимволов.Видимость 	= ГенерацияПароля;		
		Элементы.НадписьГруппа.Видимость 		= Не ГенерацияПароля И Не ПодборСкладов;;
		Элементы.ГруппаПользователей.Видимость 	= Не ГенерацияПароля И Не ПодборСкладов;;		
		Элементы.НадписьСклад.Видимость 		= ПодборСкладов;
		Элементы.Склады.Видимость 				= ПодборСкладов;
	#Иначе
		Элементы.ГруппаПароль.Видимость 		= ГенерацияПароля;
		Элементы.ГруппаВыбор.Видимость 			= Не ГенерацияПароля И Не ПодборСкладов;
		Элементы.ГруппаПодборСкладов.Видимость 	= ПодборСкладов;
	#КонецЕсли
	
	Если Не ГенерацияПароля Тогда
		Если ПодборСкладов Тогда
			ЗагрузитьТаблицуСкладовНаСервере(ЭтаФорма.АдресХранилища);	
			Для Каждого КлючИЗначение Из ИдСкладовПользователя Цикл
				СкладПользователя = Склады.НайтиПоЗначению(КлючИЗначение.Значение);
				Если СкладПользователя <> Неопределено Тогда
					СкладПользователя.Пометка = Истина;
				КонецЕсли;
			КонецЦикла;                                                                                                      
		Иначе
			ЗагрузитьГруппыПользователейНаСервере(ЭтаФорма.АдресХранилища);    
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура Зафиксировать(Команда)
	
	Если ГенерацияПароля Тогда 
		Результат = КоличествоСимволов;
	ИначеЕсли ПодборСкладов Тогда
		СписокСкладов = Новый СписокЗначений;
		Для Каждого ЭлементСписка Из Склады Цикл
			Если ЭлементСписка.Пометка Тогда
				СписокСкладов.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЕсли;
		КонецЦикла;  
		Результат = СписокСкладов;
	Иначе
		ГруппаСтруктура = Новый Структура("Ид,Имя");
		НайденнаяСтрока = ТаблицаГруппMS.НайтиСтроки(Новый Структура("Ид", ГруппаПользователей));		
		Если НайденнаяСтрока.Количество() Тогда
			ЗаполнитьЗначенияСвойств(ГруппаСтруктура, НайденнаяСтрока[0]);
		КонецЕсли;
		Результат = ГруппаСтруктура;
	КонецЕсли;	
		
	#Если ТолстыйКлиентОбычноеПриложение Тогда		
		Если НЕ ОписаниеОповещенияОЗакрытии = Неопределено Тогда	
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, Результат);
		КонецЕсли;                              		
	#КонецЕсли	
	
	Закрыть(Результат);	
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Процедура ЗагрузитьГруппыПользователейНаСервере(Адрес)

	ГруппыПользователей = Элементы.ГруппаПользователей.СписокВыбора;
	ГруппыПользователей.Очистить();
	
	пТаблицаГруппMS = ПолучитьИзВременногоХранилища(Адрес);
	Если пТаблицаГруппMS <> Неопределено Тогда       
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ТаблицаГруппMS = пТаблицаГруппMS.Скопировать();
		#Иначе                                                 
			ТаблицаГруппMS.Загрузить(пТаблицаГруппMS);
		#КонецЕсли				
		Для Каждого СтрокаТаблицы Из ТаблицаГруппMS Цикл
			ГруппыПользователей.Добавить(СтрокаТаблицы.Ид, СтрокаТаблицы.Имя);		
		КонецЦикла;		
	КонецЕсли; 	   
			
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуСкладовНаСервере(Адрес)
	
	пТаблицаСкладовMS = ПолучитьИзВременногоХранилища(Адрес);
	Если пТаблицаСкладовMS <> Неопределено Тогда
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			СкладыВспомогательные = пТаблицаСкладовMS.Скопировать();
		#Иначе                                                 
			СкладыВспомогательные.Загрузить(пТаблицаСкладовMS);
		#КонецЕсли						
	КонецЕсли; 
	
	Для Каждого Склад Из СкладыВспомогательные Цикл
		Склады.Добавить(Склад.Ид, Склад.Имя);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти	

#Если ТолстыйКлиентОбычноеПриложение Тогда
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	Объект = ЭтотОбъект;
#КонецЕсли

