///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ОнлайнЗаказы".
// ОбщийМодуль.ОнлайнЗаказыПереопределяемый.
//
//
// Переопределяемые серверные процедуры работы с Системой быстрых платежей:
//  - определение параметров онлайн-заказа на основании первичного документа;
//  - обработка статусов выполнения онлайн-заказа;
//  - формирование шаблонов сообщений и подготовка параметров отправки URL онлайн-заказа.
//
///////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область НастройкиСтраницы

// Определяет параметры внешнего вида страницы онлайн-заказов при создании новой настройки подключения.
//
// Параметры:
//  Организация - ОпределяемыйТип.Организация - организация для которой создается настройка подключения.
//  НастройкиСтраницы - Структура - параметры внешнего вида страницы:
//    * ЦветФона - Строка - цвет фона страницы в формате HEX.
//    * ЦветПлашки - Строка - цвет плашки на странице в формате HEX.
//    * ЦветШрифта - Строка - цвет шрифтов на странице в формате HEX.
//    * ПоказыватьСостав - Булево - признак отображения товарного наполнения на странице заказа.
//    * КонтактнаяИнформация - Структура - содержит контактную информацию предприятия:
//      ** Адрес - Строка - адрес предприятия, отображаемый на странице заказа.
//      ** ВремяРаботы - Строка - время работы предприятия, отображаемое на странице заказа.
//      ** ЭлектроннаяПочта - Строка - перечень электронной почты предприятия, разделенный запятыми.
//         При добавлении элемента необходимо проверять значение при помощи метода БСП
//         ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям.
//         В случае передачи невалидного значения, будет вызвано исключение.
//         Максимальное количество адресов электронной почты отправляемых в сервис равно 3.
//         В случае если количество адресов будет больше трех, будут отправлены первые три номера.
//         Пример: Передана строка "mx@mail.ru, sm@mail.ru, af@mail.ru, fg@mail.ru",
//         в сервис отправятся адреса "mx@mail.ru", "sm@mail.ru", "af@mail.ru".
//      ** НомераТелефонов - Строка - перечень номеров телефонов предприятия, разделенный запятыми.
//         Максимальное количество телефонов отправляемых в сервис равно 3.
//         В случае если количество номеров будет больше трех, будут отправлены первые три номера.
//         Пример: Передана строка "123, 456, 789, 12", в сервис отправятся номера "123", "456", "789".
//      ** АдресВКонтакте - Строка - адрес ВКонтакте, отображаемый на странице заказа.
//      ** АдресВТелеграме - Строка - адрес в Телеграме, отображаемый на странице заказа.
//      ** АдресВMAX - Строка - адрес в MAX, отображаемый на странице заказа.
//    * Логотип - Структура - данные логотипа
//      ** ДанныеФайла - ДвоичныеДанные - содержит данные логотипа;
//      ** Расширение - Строка - расширение логотипа;
//
Процедура ПриНастройкеВнешнегоВида(Организация, НастройкиСтраницы) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеСсылки

// Определяет объекты, которые могут выступать в качестве оснований для онлайн-заказа.
//
// Параметры:
//  ИменаОснованийЗаказа - Массив Из Строка - имена объектов метаданных оснований для онлайн-заказов.
//  ПараметрыКоманды - Структура - содержит описание параметров команды онлайн-заказов:
//    * Вид - Строка - вид подключаемой команды.
//    * Назначение - Строка - определяет вид форм, для которых предназначена команда.
//      "ДляОбъекта" по умолчанию
//    * Представление - Строка - представление команды в форме.
//    * Картинка - Картинка - Картинка команды.
//
Процедура ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа, ПараметрыКоманды) Экспорт
	
	//++ Локализация
	ОнлайнЗаказыУТ.ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа);
	//-- Локализация
	
КонецПроцедуры

// Определяет доступность функциональности создания заказа на основании документа оплаты.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ, по данным которого
//    будет создан новый заказ.
//  Результат - Структура - результат проверки:
//    * СозданиеЗаказаДоступно - Булево - признак доступности создания заказа по данным документа оплаты.
//    * СообщениеОбОшибке - Строка - сообщение для пользователя. Отображается в случае, если в параметр
//    СозданиеЗаказаДоступно установлено значение Ложь.
//    * Организация - ОпределяемыйТип.Организация - организация, по которой будет выполнен поиск
//      настроек платежных страниц.
//
Процедура ПриОпределенииПараметровСозданияЗаказа(
		ДокументЗаказа,
		Результат) Экспорт
	
	//++ Локализация
	ОнлайнЗаказыУТ.ПриОпределенииПараметровСозданияЗаказа(ДокументЗаказа, Результат);
	//-- Локализация
	
КонецПроцедуры

// Определяет состав печатных форм доступных для использования в качестве вложений в онлайн-заказ.
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ, по данным которого
//    будет создан новый заказ.
//  ПечатныеФормы - ТаблицаЗначений - содержит описание печатных форм
//    * Идентификатор - Строка - Идентификатор печатной формы
//    * Представление - Строка - Представление печатной формы пользователю.
//    * ФорматСохранения - ТипФайлаТабличногоДокумента - значение типа ТипФайлаТабличногоДокумента,
//      В который будет выполнено сохранение печатной формы. По умолчанию сохранение выполняется в формате MXL.
//    * ИмяФайлаВТранслите - Булево - если Истина, то имя файла будет на латинице.
//    * ПодписьИПечать - Булево - если установить Истина
//      и сохраняемый табличный документ поддерживает размещение подписей и печатей,
//      то во вложении будут размещены подписи и печати.
//
Процедура ПриОпределенииПечатныхФормЗаказа(
		ДокументЗаказа,
		ПечатныеФормы) Экспорт
	
	//++ Локализация
	ОнлайнЗаказыУТ.ПриОпределенииПечатныхФормЗаказа(ДокументЗаказа, ПечатныеФормы);
	//-- Локализация
	
КонецПроцедуры

// Определяет состав табличной части товары и ее представление пользователю.
// Обязательные поля:
//   "ИдентификаторТовара" - Строка - содержит уникальный идентификатор товарной позиции онлайн-заказа;
//   "Наименование" - Строка - наименование товарной позиции онлайн-заказа;
//   "Количество" - Число - количество товарной позиции в онлайн-заказе;
//   "СуммаСоСкидкой" - Число - сумма товарной позиции с учетом НДС;
//   "Скидка" - Число - скидка на товарную позицию;
//   "СуммаНДС" - Число - сумма НДС по товарной позиции.
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ, по данным которого
//    будет создан новый заказ.
//  ОписаниеПредставленияТоваров - Массив Из Структура - содержит описание колонок табличной части Товары онлайн-заказа.
//  Для добавления нового свойства рекомендуется использовать метод ОнлайнЗаказы.НоваяКолонкаТовары:
//    * Идентификатор - Строка - уникальный идентификатор колонки.
//    * Представление - Строка - представление колонки пользователю (шапка табличной части).
//    * ПорядокОтображения - Число - Порядок отображения колонок пользователю, упорядочивание по возрастанию.
//    * Видимость - Булево - признак видимости колонки пользователю.
//
Процедура ПриНастройкеТаблицыТоваров(
		ДокументЗаказа,
		ОписаниеПредставленияТоваров) Экспорт
	
	
КонецПроцедуры

// Определяются данные для формирования запроса на создание/обновление онлайн-заказа.
// Все поля переменной ЗаказНаОплату (за исключением свойства ДополнительнаяИнформация) обязательны для заполнения.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ, по данным которого
//    будет создан новый заказ.
//  ЗаказНаОплату - Структура - содержит описание онлайн-заказа:
//    * ОбщиеПараметрыЗаказа - Структура - описывает общие параметры заказа:
//      ** ТипКонтрагента - Строка - содержит тип контрагента, по которому будут определяться возможные виды оплат.
//         Может принимать значения:
//         - "ФизическоеЛицо" - покупателю будут доступны виды оплат для физических лиц.
//         - "ЮридическоеЛицо" - покупателю будут доступны виды оплат для физических лиц.
//         - "ФизическоеЛицоДоступенВыбор" - покупатель сможет выбрать от кого типа контрагента выполнять оплату
//            (физическое или юридическое лицо). Физическое лицо по умолчанию.
//         - "ЮридическоеЛицоДоступенВыбор" - покупатель сможет выбрать от кого типа контрагента выполнять оплату,
//            (физическое или юридическое лицо). Юридическое лицо по умолчанию.
//      ** СрокЖизни - Дата - содержит значение срока жизни заказа,
//         по наступлению указанного времени заказ будет аннулирован.
//         В случае передачи значения меньше текущей даты возвращается ошибка "НеверныйФорматЗапроса".
///    * ВизуализацияЗаказа - Структура - содержит описание шапки заказа на платежной странице.
//       ** Представление - Строка - представление заказа на платежной странице.
//       ** ДополнительнаяИнформация - Строка - дополнительная информация о заказе платежной страницы.
//       ** ПоставщикПредставление - Строка - содержит данные поставщика отображаемые на странице заказа.
//       ** ПоставщикЗаголовок - Строка - представление поставщика (пример: Поставщик, Исполнитель, Продавец).
//       ** ПокупательПредставление - Строка - содержит данные покупателя отображаемые на странице заказа.
//       ** ПокупательЗаголовок - Строка - представление покупателя (пример: Покупатель, Клиент).
//    * Товары - ТаблицаЗначений - Содержит данные товарного наполнения заказа.
//      Состав колонок определяется в методе ОнлайнЗаказыПереопределяемый.ПриНастройкеТаблицыТоваров
//    * ПараметрыОплат - Структура - Содержит описание видов оплат с их параметрами:
//      ** ПоРеквизитам - Структура - Содержит описание реквизитов оплаты:
//        *** ДанныеQR - Строка - Содержит реквизиты оплаты в формате УФЭБС.
//        *** Представление - Строка - Представление реквизиты оплаты в текстовом виде.
//      ** СБП - Структура - Содержит описание параметров оплаты СБП по вариантам сценария,
//         Неопределено, если подсистема не внедрена:
//        *** c2b - Структура, Неопределено - Содержит описание параметров оплаты СБП сценарию c2b,
//            Неопределено, если подсистема не внедрена, сценарий не используется
//            или не выбрана настройка подключения:
//          **** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//               настройка подключения к СБП, выбранная для онлайн-заказов.
//          **** НазначениеПлатежа - Строка - информация о платеже, которая будет отображена пользователю
//               в момент сканирования QR-кода в мобильном приложении. Рекомендуется
//               делать строку не длинной и включать информацию об организации, которая
//               является получателем денежных средств, например: Оплата СБП 524,00 RUB ООО Ромашка
//               Если строка не заполнена, будет передано стандартное представление
//               назначения: Оплата СБП {ЗаказНаОплату.ВизуализацияЗаказа.Представление}.
//               Длина строки не должна превышать 140 символов, в противном случае будет
//               обрезана принудительно. Система быстрых платежей имеет дополнительные требования
//               к символам и их кодировке. Возможна передача следующих значений:
//                 - символы латинского алфавита (A-Z и a-z) с десятичными кодами из диапазонов
//                 [065-090] и [097-122] в кодировке UTF-8;
//                 - символы русского алфавита (А-Я и а-я) с десятичными кодами из диапазона
//                 [1040-1103] в кодировке UTF-8;
//                 - цифры 0-9 с десятичными кодами из диапазона [048-057] в кодировке UTF-8;
//                 - специальные символы с десятичными кодами из диапазонов [032-047], [058-064],
//                 [091-096], [123-126] в кодировке UTF-8;
//                 - символ "№" под номером 8470 в кодировке UTF-8.
//          **** ШаблоныНазначения - ТаблицаЗначений - настройки заполнения шаблонов платежей:
//            ***** ОбъектМетаданных - Строка - имя объекта метаданных операции.
//            ***** Идентификатор - Строка - идентификатор шаблона.
//            ***** Наименование - Строка - наименование шаблона для пользователя.
//            ***** Параметры -Массив Из Структура - параметры заполнения шаблона:
//              ****** Наименование - Строка - наименование параметра для пользователя.
//              ****** Идентификатор - Строка - идентификатор параметра для заполнения.
//        *** b2b - Структура, Неопределено - Содержит описание параметров оплаты СБП сценарию b2b,
//            Неопределено, если подсистема не внедрена, сценарий не используется
//            или не выбрана настройка подключения:
//          **** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//               настройка подключения к СБП, выбранная для онлайн-заказов.
//          **** НазначениеПлатежа - Строка - информация о платеже, которая будет отображена пользователю
//               в момент сканирования QR-кода в мобильном приложении. Рекомендуется
//               делать строку не длинной и включать информацию об организации, которая
//               является получателем денежных средств, например: Оплата СБП 524,00 RUB ООО Ромашка
//               Если строка не заполнена, будет передано стандартное представление
//               назначения: Оплата СБП {ЗаказНаОплату.ВизуализацияЗаказа.Представление}.
//               Длина строки не должна превышать 210 символов, в противном случае будет
//               обрезана принудительно. Система быстрых платежей имеет дополнительные требования
//               к символам и их кодировке. Возможна передача следующих значений:
//                 - символы латинского алфавита (A-Z и a-z) с десятичными кодами из диапазонов
//                 [065-090] и [097-122] в кодировке UTF-8;
//                 - символы русского алфавита (А-Я и а-я) с десятичными кодами из диапазона
//                 [1040-1103] в кодировке UTF-8;
//                 - цифры 0-9 с десятичными кодами из диапазона [048-057] в кодировке UTF-8;
//                 - специальные символы с десятичными кодами из диапазонов [032-047], [058-064],
//                 [091-096], [123-126] в кодировке UTF-8;
//                 - символ "№" под номером 8470 в кодировке UTF-8.
//          **** ОблагаетсяНДС - Булево - информация о взимании НДС. Если Истина - облагается НДС,
//               если Ложь не облагается НДС;
//          **** СуммаНДС - Число - сумма НДС. Если поле ОблагаетсяНДС равно Ложь, поле не заполняется;
//          **** РасчетныйСчет - Строка - расчетный счет получателя платежа. Длина строки не должна превышать
//               20 символов, в противном случае будет обрезана принудительно;
//          **** ИдентификаторПлатежа - Строка - уникальный Идентификатор Платежа, назначаемый Получателем.
//               Длина строки не должна превышать 35 символов, в противном случае будет обрезана принудительно;
//          **** ШаблоныНазначения - ТаблицаЗначений - настройки заполнения шаблонов платежей:
//            ***** ОбъектМетаданных - Строка - имя объекта метаданных операции.
//            ***** Идентификатор - Строка - идентификатор шаблона.
//            ***** Наименование - Строка - наименование шаблона для пользователя.
//            ***** Параметры -Массив Из Структура - параметры заполнения шаблона:
//              ****** Наименование - Строка - наименование параметра для пользователя.
//              ****** Идентификатор - Строка - идентификатор параметра для заполнения.
//       ** ИнтернетЭквайринг - Структура - Содержит описание параметров оплаты через Интернет-эквайринг,
//            Неопределено, если подсистема не внедрена, сценарий не используется
//            или не выбрана настройка подключения.
//         *** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКИнтернетЭквайрингу -
//               настройка подключения к интернет-эквайрингу, выбранная для онлайн-заказов.
//         *** НазначениеПлатежа - Строка - информация о платеже, которая будет отображена пользователю
//               в момент оплаты. Рекомендуется делать строку не длинной и включать информацию об
//               организации, которая является получателем денежных средств, например: 
//               Оплата 524,00 RUB по Заказу №1 от 01.01.2025 ООО Ромашка.
//               Если строка не заполнена, будет передано стандартное представление
//               назначения: Оплата {ЗаказНаОплату.ВизуализацияЗаказа.Представление}.
//               Длина строки не должна превышать 140 символов, в противном случае будет
//               обрезана принудительно. 
//               Дополнительные требования к символам и их кодировке. Возможна передача следующих значений:
//                 -- символы латинского алфавита (A-Z и a-z) с десятичными кодами из диапазонов
//                 [065-090] и [097-122] в кодировке UTF-8;
//                 -- символы русского алфавита (А-Я и а-я) с десятичными кодами из диапазона
//                 [1040-1103] в кодировке UTF-8;
//                 -- цифры 0-9 с десятичными кодами из диапазона [048-057] в кодировке UTF-8;
//                 -- специальные символы с десятичными кодами из диапазонов [032-047], [058-064],
//                 [091-096], [123-126] в кодировке UTF-8;
//                 -- символ "№" под номером 8470 в кодировке UTF-8.
//          *** ШаблоныНазначения - ТаблицаЗначений - настройки заполнения шаблонов платежей:
//            **** ОбъектМетаданных - Строка - имя объекта метаданных операции.
//            **** Идентификатор - Строка - идентификатор шаблона.
//            **** Наименование - Строка - наименование шаблона для пользователя.
//            **** Параметры -Массив Из Структура - параметры заполнения шаблона:
//              ***** Наименование - Строка - наименование параметра для пользователя.
//              ***** Идентификатор - Строка - идентификатор параметра для заполнения.
//       ** ОзонПэй - Структура - Содержит описание параметров оплаты через Ozon Pay,
//            Неопределено, если подсистема не внедрена, сценарий не используется
//            или не выбрана настройка подключения
//         *** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам -
//               настройка подключения к Озон Пэй, выбранная для онлайн-заказов.
//         *** НазначениеПлатежа - Строка - в текущей версии не используется.
//         *** ШаблоныНазначения - ТаблицаЗначений - в текущей версии не используется.
//    * ПараметрыФискализации - Структура, Неопределено - Содержит параметры фискализации онлайн-заказа,
//         Неопределено, если подсистема не внедрена или не выбрана настройка подключения к облачной кассе:
//      ** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОблачнымКассам -
//               настройка подключения к облачной кассе, выбранная для фискализации онлайн-заказов.
//      ** ДанныеЧека - Структура - Содержит данные для фискализации онлайн-чека.
//           Для заполнения рекомендуется воспользоваться методами БПО:
//           - ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека()
//           для получения пустой структуры данных чека для заполнения
//           - ОборудованиеЧекопечатающиеОблачныеККТ.ДанныеВФорматеОблачныхККТ()
//           для преобразования заполненных данных чека в формат 1С:Облачная касса
//
Процедура ПриФормированииЗаказаНаОплату(ДокументЗаказа, ЗаказНаОплату) Экспорт
	
	//++ Локализация
	ОнлайнЗаказыУТ.ПриФормированииЗаказаНаОплату(ДокументЗаказа, ЗаказНаОплату);
	//-- Локализация
	
КонецПроцедуры

// Определяет представление основания заказа для отображения пользователю на форме отправки ссылки
// и на странице онлайн-заказа
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ основание заказа,
//  для которого необходимо определить представление.
//  ПредставлениеОснования - Структура - Содержит описание представлений основания заказа:
//    * РезультатСклонения - Структура - Содержит данные склонения представления по падежам:
//      ** ИменительныйПадеж - Строка - Представления основания в именительном падеже;
//      ** РодительныйПадеж - Строка - Представление Основания в родительном падеже;
//      ** ДательныйПадеж - Строка - Представление Основания в дательном падеже;
//      ** ВинительныйПадеж - Строка - Представление Основания в винительном падеже;
//      ** ТворительныйПадеж - Строка - Представление Основания в творительном падеже;
//      ** ПредложныйПадеж - Строка - Представление Основания в винительном падеже.
//  ДанныеОснования - Структура - Содержит описание данных заказа:
//   * НомерЗаказа - Строка - номер заказа.
//
Процедура ПриОпределенииПредставленияОснованияЗаказа(
	ДокументЗаказа,
	ПредставлениеОснования,
	ДанныеОснования) Экспорт
	
	//++ Локализация
	ОнлайнЗаказыУТ.ПриОпределенииПредставленияОснованияЗаказа(ДокументЗаказа, ПредставлениеОснования, ДанныеОснования);
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеСтатусаСсылки

// Определяет параметры онлайн-заказа при его активации.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ основание онлайн-заказа.
//  ВложенияЗаказа - Массив Из Структура- описывает вложения онлайн-заказа, выбранные пользователем:
//    * ДвоичныеДанные - ДвоичныеДанные - содержит данные файла;
//    * ИмяФайла - Строка - содержит имя файла вложения (с расширением);
//    * Расширение - Строка - содержит расширение файла вложения;
//    * Представление - Строка - Содержит представление файла для его отображения на странице онлайн-заказа.
//  ПараметрыЗаказа - Структура - содержит описание параметров онлайн-заказа:
//    * СервисShare - Структура - Данные заказа в сервисе Share:
//      ** URLДокумента - Строка - Ссылка на документ онлайн-заказа в сервисе 1С:Share.
//      ** ОшибкаПолученияURL - Булево - Признак ошибки получения URL документа в сервисе Share
//         в случае Истина пользователю будет предложено выполнить обновление.
//    * ТипКонтрагента - Строка - содержит тип контрагента, по которому будут определяться возможные виды оплат.
//         Может принимать значения "ФизическоеЛицо", "ЮридическоеЛицо", "ФизическоеЛицоДоступенВыбор",
//         "ЮридическоеЛицоДоступенВыбор".
//    * СрокЖизни - Дата - содержит значение срока жизни заказа (дата и время),
//      по наступлению указанного времени заказ будет аннулирован
//
Процедура ПриАктивацииЗаказа(ДокументЗаказа, ВложенияЗаказа, ПараметрыЗаказа) Экспорт
	
	//++ Локализация
	ОнлайнЗаказыУТ.ПриАктивацииЗаказа(ДокументЗаказа, ВложенияЗаказа, ПараметрыЗаказа);
	//-- Локализация
	
КонецПроцедуры

// Определяет алгоритм обработки деактивации онлайн-заказа.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ основание онлайн-заказа.
//  ПараметрыЗаказа - Структура - содержит описание параметров онлайн-заказа:
//    * URLShare - Строка - Ссылка на документа онлайн-заказа в сервисе 1С:Share.
//
Процедура ПриДеактивацииЗаказа(ДокументЗаказа, ПараметрыЗаказа) Экспорт

	//++ Локализация
	ОнлайнЗаказыУТ.ПриДеактивацииЗаказа(ДокументЗаказа, ПараметрыЗаказа);
	//-- Локализация
	
КонецПроцедуры

// Определяет алгоритм обработки операций онлайн-заказов.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ основание заказа;
//  СтатусЗаказа - Строка - Статус заказа, может принимать следующие значения: "Оплачен", "ИстекСрокЖизни";
//  ПараметрыОплаты - Соответствие Из КлючИЗначение - содержит данные оплаты заказа:
//    * Ключ - Строка - Идентификатор типа оплаты может принимать следующие значения:
//        - "СБПc2b" - оплата через систему быстрых платежей (c2b).
//        - "СБПb2b" - оплата через систему быстрых платежей (b2b).
//        - "ИнтернетЭквайринг" - оплата картой.
//        - "ОзонПэй" - оплата через Озон Пэй.
//    * Значение - Структура - содержит данные оплаты, может принимать следующие значения:
//        - Для случая когда ключ имеет значение равное "СБПc2b":
//          ** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей - настройка
//             выполнения операции.
//          ** РезультатОбработки - Структура - результат загрузки статуса операции:
//            *** СообщениеОбОшибке - Строка - сообщение пользователю. Заполняется в случае ошибки.
//            *** СтатусОперации - Строка - текущее состояние операции. Возможные значения:
//                "Отменена" - по ранее сформированная операция отменена НСПК.
//                "Выполнена" - участник СБП подтвердил выполнение операции.
//            *** ПараметрыОперации - Структура - дополнительные данные по оплате:
//              **** ДатаОперации - Дата - фактическая дата оплаты в UTC;
//              **** СуммаОперации - Число - фактическая суммы операции по документу;
//              **** ИдентификаторОперации - Строка - идентификатор сформированной операции;
//              **** ДокументЧастичнойОплаты - Документ.ПлатежнаяСсылкаСБПc2b - документ частичной оплаты;
//              **** ИдентификаторОплаты- Строка - идентификатор оплаты.
//        - Для случая когда ключ имеет значение равное "СБПb2b":
//          ** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей - настройка
//             выполнения операции.
//          ** РезультатОбработки - Структура - результат загрузки статуса операции:
//            *** СообщениеОбОшибке - Строка - сообщение пользователю. Заполняется в случае ошибки.
//            *** СтатусОперации - Строка - текущее состояние операции. Возможные значения:
//                "Отменена" - по ранее сформированная операция отменена НСПК.
//                "Выполнена" - участник СБП подтвердил выполнение операции.
//            *** ПараметрыОперации - Структура - дополнительные данные по оплате:
//              **** ДатаОперации - Дата - фактическая дата оплаты в UTC;
//              **** СуммаОперации - Число - фактическая суммы операции по документу;
//              **** ИдентификаторОперации - Строка - идентификатор сформированной операции;
//              **** ДокументЧастичнойОплаты - Документ.ПлатежнаяСсылкаСБПc2b - документ частичной оплаты;
//              **** ИдентификаторОплаты- Строка - идентификатор оплаты;
//              **** РасчетныйСчет - Строка - расчетный счет получателя платежа;
//              **** ИдентификаторПлатежа - Строка - уникальный Идентификатор Платежа, назначаемый Получателем;
//              **** ОблагаетсяНДС - Булево - информация о взимании НДС. Если Истина - облагается НДС,
//                   если Ложь не облагается НДС;
//              **** СуммаНДС - Число - сумма НДС. Если поле ОблагаетсяНДС равно Ложь, поле не заполняется;
//        - Для случая когда ключ имеет значение равное "ИнтернетЭквайринг":
//          ** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКИнтернетЭквайрингу - настройка
//             выполнения операции.
//          ** РезультатОбработки - Структура - результат загрузки статуса операции:
//            *** СообщениеОбОшибке - Строка - сообщение пользователю. Заполняется в случае ошибки.
//            *** СтатусОперации - Строка - текущее состояние операции. Возможные значения:
//                "Выполнена" - выполнение операции подтверждено.
//                "Выполняется" - операция в процессе выполнения.
//                "Отменена" - ранее сформированная операция отменена.
//                "Отклонена" - выполнение операции отклонено.
//                "Ошибка" - не удалось определить статус операции.
//            *** ПараметрыОперации - Структура - дополнительные данные по оплате:
//              **** ДатаОперации - Дата - фактическая дата операции.
//              **** СуммаОперации - Число - сумма операции.
//              **** Идентификатор - Строка - идентификатор операции.
//              **** ИдентификаторОперации - Строка - идентификатор текущей операции.
//              **** ИдентификаторОплаты - Строка - идентификатор операции оплаты.
//              **** ИдентификаторМерчанта - Строка - идентификатор мерчанта.
//              **** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКИнтернетЭквайрингу - настройка
//                   подключения.
//              **** НазначениеПлатежа - Строка - назначение платежа.
//        - Для случая когда ключ имеет значение равное "ОзонПэй":
//          ** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКИнтернетЭквайрингу - настройка
//             выполнения операции.
//          ** РезультатОбработки - Структура - результат загрузки статуса операции:
//            *** СообщениеОбОшибке - Строка - сообщение пользователю. Заполняется в случае ошибки.
//            *** СтатусОперации - Строка - текущее состояние операции. Возможные значения:
//                "Выполнена" - выполнение операции подтверждено.
//                "Выполняется" - операция в процессе выполнения.
//                "Отменена" - ранее сформированная операция отменена.
//                "Отклонена" - выполнение операции отклонено.
//                "Ошибка" - не удалось определить статус операции.
//            *** ПараметрыОперации - Структура - дополнительные данные по оплате:
//              **** ДатаОперации - Дата - фактическая дата операции.
//              **** СуммаОперации - Число - сумма операции.
//              **** ИдентификаторОперации - Строка - идентификатор текущей операции.
//              **** ИдентификаторОплаты - Строка - идентификатор операции оплаты.
//              **** СпособОплаты - Строка - способ оплаты. Доступные значения определяются методами
//                     общего модуля ПлатежныеСистемыКлиентСервер.
//  ПараметрыФискализации - Структура, Неопределено - содержит описание параметров фискализации.
//  Неопределено в случае если подсистема облачные кассы не внедрена или операция фискализации не была инициализирована.
//   * ДокументОперации - ОпределяемыйТип.ДокументОперацииОблачнойКассы - ссылка на документ,
//     являющийся основанием чека.
//   * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОблачнымКассам - настройка
//      подключения к облачной кассе, используемая в онлайн-заказах.
//   * СтатусОперации - Строка - статус операции фискализации в сервисе онлайн-заказов. Может принимать значения:
//     - "Выполнена" - операция фискализации успешно выполнена.
//     - "Выполняется" - операция фискализации инициализирована, терминальный статус чека не получен.
//     - "Инициализация" - ожидается инициализация фискализации сервисом онлайн-заказы.
//     - "Ошибка" - при фискализации операции сервисом онлайн-заказы произошла ошибка,
//        необходимо инициализировать пробитие чека в прикладной логике.
//   * ОписаниеСтатусаОперации - Строка - Описание статуса операции из сервиса.
//  Обработан - Булево - признак обработки операции. Необходимо установить Истина,после завершения обработки.
//
Процедура ПриЗагрузкеСтатусаЗаказа(
		ДокументЗаказа,
		СтатусЗаказа,
		ПараметрыОплаты,
		ПараметрыФискализации,
		Обработан) Экспорт
	
	//++ Локализация
	ОнлайнЗаказыУТ.ПриЗагрузкеСтатусаЗаказа(ДокументЗаказа, СтатусЗаказа, ПараметрыОплаты, Обработан);
	//-- Локализация
	
КонецПроцедуры

// Определяет алгоритм обработки фискализации онлайн-заказов.
//
// Параметры:
//  ПараметрыФискализации - Структура - содержит описание параметров фискализации.
//   * ДокументОперации - ОпределяемыйТип.ДокументОперацииОблачнойКассы - ссылка на документ,
//     являющийся основанием чека.
//   * ДанныеЧека - Структура - Содержит данные фискализации онлайн-чека,
//     переданные в Свойстве ДанныеЧека метода ПриФормированииЗаказаНаОплату.
//   * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОблачнымКассам - настройка
//      подключения к облачной кассе, используемая в онлайн-заказах.
//   * СтатусОперации - Строка - статус операции фискализации в сервисе онлайн-заказов. Может принимать значения:
//     - "Выполнена" - операция фискализации успешно выполнена.
//     - "Выполняется" - операция фискализации инициализирована, терминальный статус чека не получен.
//     - "Инициализация" - ожидается инициализация фискализации сервисом онлайн-заказы.
//   * ОписаниеСтатусаОперации - Строка - Описание статуса операции из сервиса.
//
Процедура ПриЗаписиДанныхФискализацииЗаказа(ПараметрыФискализации) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ШаблоныСообщений

// Возвращает признак использования шаблонов сообщений для работы с онлайн-заказами.
//
// Параметры:
//  Используется - Булево - признак использования шаблонов сообщений.
//
//@skip-warning
Процедура ПриПроверкеИспользованияШаблоновСообщенийОнлайнЗаказов(Используется) Экспорт
	
	//++ Локализация
	ОнлайнЗаказыУТ.ПриПроверкеИспользованияШаблоновСообщенийОнлайнЗаказов(Используется);
	//-- Локализация
	
КонецПроцедуры

// Описывает предопределенные шаблоны писем по типу,
// с помощью которых можно будет выставлять онлайн-заказы для оплаты.
// Эти шаблоны будут доступны для создания из основной формы настроек и использоваться
// в форме формирования платежной ссылки онлайн-заказов.
//
// Параметры:
//  Шаблоны - Массив - Массив структур данных, описывающих предопределенные шаблоны сообщения.
//    * ПолноеИмяТипаНазначения - Строка - Полное имя объекта метаданных, на основании которого по данному шаблону
//        будут создаваться письма.
//    * Текст - Строка - Текст, который будет использоваться в качестве шаблона письма в формате HTML.
//    * Тема - Строка - Текст, который будет использоваться в качестве шаблона темы письма.
//    * Наименование - Строка - Текст, наименование шаблона письма.
//    * ТипШаблона - Строка - Тип шаблона. Возможные значения:"Почта" или "SMS".
//
//@skip-warning
Процедура ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам(Шаблоны) Экспорт
	
	//++ Локализация
	ОнлайнЗаказыУТ.ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам(Шаблоны);
	//-- Локализация
	
КонецПроцедуры

// Определяет параметры отправки сообщений с использованием шаблонов онлайн-заказов.
//
// Параметры:
//  ПараметрыОтправкиСообщений - Структура - описание параметров отправки сообщений:
//    * ПараметрыОтправкиПисем - Структура - описание параметров отправки электронных писем:
//       ** ОтправлятьПисьмаВФорматеHTML - Булево, Неопределено - признак отправки электронных писем в формате HTML.
//          Если свойство не задано, в дальнейшем при наличии подсистемы "Взаимодействия" будет получено значение
//          функциональной опции "ОтправлятьПисьмаВФорматеHTML", либо Ложь при ее отсутствии.
//
//@skip-warning
Процедура ПриОпределенииПараметровОтправкиСообщений(
		ПараметрыОтправкиСообщений) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ОтправкаСообщений

// Заполняет список получателей сообщения с URL онлайн-заказа.
//
// Параметры:
//  ДокументЗаказа - Произвольный - документ основание онлайн-заказа.
//  ВариантОтправки - Строка - способ отправки ссылки. "ЭлектроннаяПочта" - по электронной почте, "Телефон" - по SMS.
//  Получатели - СписокЗначений - адреса электронной почты или номера телефонов получателей (строка).
//
//@skip-warning
Процедура ПриФормированииСпискаПолучателейСообщенияОнлайнЗаказов(
		Знач ДокументЗаказа,
		Знач ВариантОтправки,
		Получатели) Экспорт
	
	//++ Локализация
	ОнлайнЗаказыУТ.ПриФормированииСпискаПолучателейСообщенияОнлайнЗаказов(ДокументЗаказа, ВариантОтправки, Получатели);
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

