
Функция ПолучитьСтрокуСобытия(ИмяСобытия, Параметры) Экспорт
	
	Если Параметры.Количество() = 0 Тогда
		Возврат ИмяСобытия+"()";	
	КонецЕсли;	
	Стр = ИмяСобытия+"(";
	
	ПарамсСтр = "";
	Для сч=0 по Параметры.ВГраница() Цикл
		ПарамсСтр = ПарамсСтр+"массив["+xmlСтрока(сч)+"],"
	КонецЦикла;	
	
	ПарамсСтр = Лев(ПарамсСтр,СтрДлина(ПарамсСтр)-1);
	
	Стр = Стр+парамсСтр+")";
	Возврат Стр;
	
КонецФункции

Функция REST_API_ВычислитьМетод(ИмяСобытия, Параметры, МодульОнлайн) Экспорт

	Если ТипЗнч(Параметры) = Тип("Массив") Тогда
		Массив = Параметры;
	Иначе
		// Для работы web-сервиса
		Массив = ГлЯдро_ЗагрузитьИзJSON(Параметры);
	КонецЕсли;
	
	СтрокаМетода = ПолучитьСтрокуСобытия(ИмяСобытия, Массив);
		
	Результат = Вычислить("МодульОнлайн."+СтрокаМетода);
	
	Возврат Результат;
	
КонецФункции

//Методы обработки
Процедура ГлЯдро_СохранитьДанныеВХранилище1С(КлючДляСохранения, ДанныеДляСохранения) Экспорт
	
	Если ПравоДоступа("АдминистрированиеДанных", Метаданные)  Тогда	
		ХранилищеОбщихНастроек.Сохранить(КлючДляСохранения, "", ДанныеДляСохранения, , "");
		НазваниеПараметраТекущегоПользователя = "ТекущийПользователь";
		Если Метаданные.ПараметрыСеанса.Найти("ТекущийПользователь") = Неопределено Тогда
			НазваниеПараметраТекущегоПользователя = "глТекущийПользователь"; // В Штрих-М 5.2 используется такой параметр
		КонецЕсли;
		ХранилищеОбщихНастроек.Сохранить(КлючДляСохранения, "", ДанныеДляСохранения, , ПараметрыСеанса[НазваниеПараметраТекущегоПользователя].Наименование);
	Иначе
		ХранилищеОбщихНастроек.Сохранить(КлючДляСохранения, "", ДанныеДляСохранения, );
	КонецЕсли;
	
КонецПроцедуры
	
Функция ГлЯдро_ПолучитьДанныеИзХранилища1С(КлючДляПолучения, ПолучитьПользовательскуюИОбщуюНастройку = Ложь) Экспорт
	
	Если ПравоДоступа("АдминистрированиеДанных", Метаданные)  Тогда
		
		НазваниеПараметраТекущегоПользователя = "ТекущийПользователь";
		Если Метаданные.ПараметрыСеанса.Найти("ТекущийПользователь") = Неопределено Тогда
			НазваниеПараметраТекущегоПользователя = "глТекущийПользователь"; // В Штрих-М 5.2 используется такой параметр
		КонецЕсли;
		ПользовательскаяНастройка = ХранилищеОбщихНастроек.Загрузить(КлючДляПолучения,,,ПараметрыСеанса[НазваниеПараметраТекущегоПользователя].Наименование);
		
		Если ПользовательскаяНастройка = Неопределено 
			ИЛИ ПолучитьПользовательскуюИОбщуюНастройку Тогда
			ОбщаяНастройка = ХранилищеОбщихНастроек.Загрузить(КлючДляПолучения,,, "");
		КонецЕсли;
		Если ПолучитьПользовательскуюИОбщуюНастройку Тогда
			ДанныеИзХранилища = Новый Структура("ПользовательскаяНастройка,ОбщаяНастройка",ПользовательскаяНастройка,ОбщаяНастройка);
		Иначе
			ДанныеИзХранилища = ?(ПользовательскаяНастройка = Неопределено,ОбщаяНастройка,ПользовательскаяНастройка);
		КонецЕсли;
	Иначе
		ДанныеИзХранилища = ХранилищеОбщихНастроек.Загрузить(КлючДляПолучения);
	КонецЕсли;
		
	Возврат ДанныеИзХранилища;
	
КонецФункции	

Функция ГлЯдро_ЗагрузитьИзJSON(СтрокаJSON) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON ;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("$type");
	
	Возврат ПрочитатьJSON(ЧтениеJSON, Истина, , , , , ,) ;
КонецФункции

Функция СформироватьПараметрыGZIPWeb(ДанныеРезультат,ТипОбмена = "",ВременныйТокен = "",МодульОбмена) Экспорт
	
	ИмяСобытия = "СформироватьПараметрыGZIPWeb";
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Заголовки",Новый Структура());
	
	МодульОбмена.REST_API_СформироватьЗаголовокGZIP(СтруктураОтвета);
	ТипОбмена = СтруктураОтвета.Заголовки.exchtype;
	
	ВременныйТокен = МодульОбмена.ГлЯдро_ПолучитьВременныйMSToken1C();
		
	// Раскроем когда протестируем платформу на получение ответа в сжатом виде
	//Попытка
	//	РезультатВДвоичныхДанных = МодульОнлайн.ГлЯдро_ЗашифроватьGZIP(ДанныеРезультат, Неопределено);
	//	СжатыйРезультат = ПолучитьHexСтрокуИзДвоичныхДанных(РезультатВДвоичныхДанных);
	//	ДанныеРезультат = СжатыйРезультат;
	//Исключение
	//	ТекстОшибки = "Не удалось сжать результат: " + ОписаниеОшибки();
	//	МодульОбмена.ГлЯдро_ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки,,Неопределено);
	//КонецПопытки;
	//
	СтруктураВозврата = Новый Структура("Заголовки,Результат",СтруктураОтвета.Заголовки, ДанныеРезультат);
	
	Возврат СтруктураВозврата;
КонецФункции

Процедура СформироватьПараметрыGZIPHTTP(HTTPОтвет, ДанныеРезультат, МодульОбмена) Экспорт
	
	ИмяСобытия = "СформироватьПараметрыGZIPHTTP";		
	
	СтруктураЗаголовков = Новый Структура;
	
	МодульОбмена.REST_API_СформироватьЗаголовокGZIP(Новый Структура("Заголовки",СтруктураЗаголовков));
	Для Каждого Заголовок Из СтруктураЗаголовков Цикл 
		HTTPОтвет.Заголовки.Вставить(Заголовок.Ключ,Заголовок.Значение);
	КонецЦикла;
	
	HTTPОтвет.Заголовки.Вставить("connectiontoken",МодульОбмена.ГлЯдро_ПолучитьВременныйMSToken1C());
		
	// Раскроем когда протестируем платформу на получение ответа в сжатом виде
	//Попытка
	//	РезультатВДвоичныхДанных = МодульОнлайн.ГлЯдро_ЗашифроватьGZIP(ДанныеРезультат, Неопределено);
	//	СжатыйРезультат = ПолучитьHexСтрокуИзДвоичныхДанных(РезультатВДвоичныхДанных);
	//	ДанныеРезультат = СжатыйРезультат;
	//Исключение
	//	ТекстОшибки = "Не удалось сжать результат: " + ОписаниеОшибки();
	//	МодульОбмена.ГлЯдро_ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки,,Неопределено);
	//КонецПопытки;
	//	
	
	HTTPОтвет.УстановитьТелоИзСтроки(ДанныеРезультат, КодировкаТекста.UTF8);		
	
КонецПроцедуры
