// "Работа с буфером обмена до 1С 8.3.24" https://infostart.ru/1c/tools/1924161/

#Область ПрограммныйИнтерфейс

// Копирует текст в буфер обмена (Через HTML)
//
// Параметры:
//	Текст - Строка - Текст
Процедура Копировать(Текст) Экспорт
	
	// Вариант проблемный в RDP https://forum.infostart.ru/forum9/topic10315/
	ОбъектHTML = Новый COMОбъект("htmlfile");
	ОбъектHTML.ParentWindow.ClipboardData.Setdata("Text", Текст);
	
	Если Текст = Текст() Тогда
		Возврат;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда
		
		// Этот вариант работает в RDP
		ИмяФайла = ПолучитьИмяВременногоФайла();
		
		ДополнительныеПараметры = Новый Структура("ИмяФайла", ИмяФайла);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗавершенияЗаписиТекстаВФайл", ЭтотОбъект, ДополнительныеПараметры);
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(Текст);
		ТекстовыйДокумент.НачатьЗапись(ОписаниеОповещения, ИмяФайла, КодировкаТекста.OEM, Символы.ПС);
		
	#КонецЕсли
	
КонецПроцедуры

// Получает текст из буфера обмена
//
// Возвращаемое значение:
//   Строка	- Содержимое буфера обмена
Функция Текст() Экспорт
	
	htmlfile = Новый COMОбъект("htmlfile");
	Возврат htmlfile.ParentWindow.ClipboardData.Getdata("Text");
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПослеЗавершенияЗаписиТекстаВФайл(Результат, ДополнительныеПараметры) Экспорт
	
	WScriptShell = Новый COMОбъект("WScript.Shell");
	
	Шаблон = "%%comspec%% /c type ""%1"" | clip & del ""%1""";
	WScriptShell.Run(СтрШаблон(Шаблон, ДополнительныеПараметры.ИмяФайла), 0, 1);
	
КонецПроцедуры

#КонецОбласти
