
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИмяФормы = СтрЗаменить(ПараметрыВыполненияКоманды.Источник.ИмяФормы, "Справочник.", "");
	ИндексТочки = Найти(ИмяФормы, ".");
	Если ИндексТочки = 0 Тогда
		Возврат;
	КонецЕсли;
	ТипСправочникаЛогистика = Лев(ИмяФормы, ИндексТочки - 1);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипСправочникаЛогистика", ТипСправочникаЛогистика);
	
	ОткрытьФорму("ОбщаяФорма.КонтурЛогистика_ЗаполнениеСправочниковЛогистикиИзУчетных", ПараметрыФормы);
	
КонецПроцедуры
