#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПоставляемыеДанныеКлассификаторовВидовПродукцииИС(Идентификатор, Версия, Адрес, ЗагруженЧастично) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить(Метаданные.РегистрыСведений.ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ПолноеИмя());

	НачатьТранзакцию();

	Попытка

		Блокировка.Заблокировать();
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
		
		НаборЗаписей = СоздатьНаборЗаписей();

		НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);

		НоваяЗапись = НаборЗаписей.Добавить();

		НоваяЗапись.Идентификатор              = Идентификатор;
		НоваяЗапись.Версия                     = Версия;
		НоваяЗапись.ПоставляемыеДанные         = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
		НоваяЗапись.ИмеютсяНезагруженныеДанные = ЗагруженЧастично;

		НаборЗаписей.Записать();

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	
	КонецПопытки;
	
КонецПроцедуры

Функция СохраненныеДанныеКлассификаторовВидовПродукцииИС(Идентификатор, СЧастичнойЗагрузкой=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Адрес             = Неопределено;
	СохраненнаяВерсия = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ПоставляемыеДанные,
			|	ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ИмеютсяНезагруженныеДанные
			|ИЗ
			|	РегистрСведений.ПоставляемыеДанныеКлассификаторовВидовПродукцииИС КАК
			|		ПоставляемыеДанныеКлассификаторовВидовПродукцииИС
			|ГДЕ
			|	ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.Идентификатор = &Идентификатор";
		
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СЧастичнойЗагрузкой И Не ВыборкаДетальныеЗаписи.ИмеютсяНезагруженныеДанные Тогда
			Продолжить;
		КонецЕсли;
		СохраненнаяВерсия = ВыборкаДетальныеЗаписи.ПоставляемыеДанные.Получить();
	КонецЦикла;
	
	Если СохраненнаяВерсия <> Неопределено Тогда
		Адрес = ПоместитьВоВременноеХранилище(СохраненнаяВерсия);
	КонецЕсли;
	
	Возврат Адрес;	
	
КонецФункции

Функция ИмеютсяСохраненныеДанныеКлассификатораВидовПродукцииИС(Идентификатор, СЧастичнойЗагрузкой=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмеютсяСохраненныеДанные = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ПоставляемыеДанные,
			|	ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ИмеютсяНезагруженныеДанные
			|ИЗ
			|	РегистрСведений.ПоставляемыеДанныеКлассификаторовВидовПродукцииИС КАК
			|		ПоставляемыеДанныеКлассификаторовВидовПродукцииИС
			|ГДЕ
			|	ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.Идентификатор = &Идентификатор";
		
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СЧастичнойЗагрузкой И Не ВыборкаДетальныеЗаписи.ИмеютсяНезагруженныеДанные Тогда
			Продолжить;
		КонецЕсли;
		ИмеютсяСохраненныеДанные = Истина;
	КонецЦикла;
	
	Возврат ИмеютсяСохраненныеДанные;	
	
КонецФункции

Процедура ОбновитьПризнакЧастичнойЗагрузкиКлассификаторовВидовПродукцииИС(Идентификатор, ЗагруженЧастично) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить(Метаданные.РегистрыСведений.ПоставляемыеДанныеКлассификаторовВидовПродукцииИС.ПолноеИмя());

	НачатьТранзакцию();

	Попытка

		Блокировка.Заблокировать();
		
		СуществующаяЗапись = СоздатьМенеджерЗаписи();
		СуществующаяЗапись.Идентификатор = Идентификатор;
		
		СуществующаяЗапись.Прочитать();
		
		Если СуществующаяЗапись.Выбран() Тогда
			СуществующаяЗапись.ИмеютсяНезагруженныеДанные = ЗагруженЧастично;
			СуществующаяЗапись.Записать();
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли