#Область ПрограммныйИнтерфейс

// Это расширенная версия гос ИС.
// 
// Параметры:
//  Подсистема - Неопределено, Строка - Подсистема
// 
// Возвращаемое значение:
//  Булево - Это расширенная версия гос ИС
Функция ЭтоРасширеннаяВерсияГосИС(Подсистема = Неопределено) Экспорт
	
	Если Подсистема = Неопределено Тогда
		Подсистема = "БазоваяФункциональность";
	КонецЕсли;
	
	Возврат ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС();
	
КонецФункции

#Область ИнтегрируемыеПодсистемы

Функция ПолноеИмяПодсистемы(ИмяПодсистемы) Экспорт
	
	Возврат СтрШаблон("ГосИС.%1", ИмяПодсистемы);
	
КонецФункции

Функция ПредставлениеПодсистемы(Представление = "") Экспорт
	
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Возврат НСтр("ru = '<Интеграция>'");
	Иначе
		Возврат Представление;
	КонецЕсли;
	
КонецФункции

Функция МодульКлиент(ИмяПодсистемы) Экспорт
	
	Возврат СтрШаблон("Интеграция%1Клиент", ИмяПодсистемы);
	
КонецФункции

Функция МодульСервер(ИмяПодсистемы) Экспорт
	
	Возврат СтрШаблон("Интеграция%1", ИмяПодсистемы);
	
КонецФункции

Функция МодульКлиентСервер(ИмяПодсистемы) Экспорт
	
	Возврат СтрШаблон("Интеграция%1КлиентСервер", ИмяПодсистемы);
	
КонецФункции

// Данные представления срока годности.
// 
// Параметры:
//  СрокГодности - Дата - срок годности
//  ПроверяемаяДата - Дата - проверяемая дата
//  УчитыватьВремя - Булево - учитывать время при истчении срока годности
//  
// Возвращаемое значение:
//  Структура - Данные представления срока годности:
// * ОсталосьДней - Число - Осталось дней
// * Представление - Строка, Неопределено - Представление срока годности
// * Истек - Булево
Функция ДанныеПредставленияСрокаГодности(СрокГодности, ПроверяемаяДата, УчитыватьВремя = Ложь) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ОсталосьДней");
	ВозвращаемоеЗначение.Вставить("Представление");
	ВозвращаемоеЗначение.Вставить("Истек", Ложь);
	
	ВозвращаемоеЗначение.ОсталосьДней = (НачалоДня(СрокГодности) - НачалоДня(ПроверяемаяДата)) / (60 * 60 * 24);
	ВозвращаемоеЗначение.Истек = (ВозвращаемоеЗначение.ОсталосьДней < 0);
	Если Не ВозвращаемоеЗначение.Истек И УчитыватьВремя И ВозвращаемоеЗначение.ОсталосьДней = 0 Тогда
		ВозвращаемоеЗначение.Истек = (СрокГодности < ПроверяемаяДата);
	КонецЕсли;
	
	Если ВозвращаемоеЗначение.Истек Тогда
		ВозвращаемоеЗначение.Представление = НСтр("ru = 'Просрочен'");
	ИначеЕсли ВозвращаемоеЗначение.ОсталосьДней = 0 Тогда
		ВозвращаемоеЗначение.Представление = НСтр("ru = 'Сегодня'");
	Иначе
		ПредставлениеДней                  = НСтр("ru = ';%1 день;;%1 дня;%1 дней;%1 дня'");
		ПредставлениеЛет                   = НСтр("ru = ';%1 год;;%1 года;%1 лет;%1 года'");
		ОсталосьЛет = Цел(ВозвращаемоеЗначение.ОсталосьДней / 365);
		Если ОсталосьЛет = 0 Тогда
			ВозвращаемоеЗначение.Представление = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				ПредставлениеДней, ВозвращаемоеЗначение.ОсталосьДней);
		Иначе
			ДанныеПредставления = Новый Массив();
			ДанныеПредставления.Добавить(
				СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
					ПредставлениеЛет, ОсталосьЛет));
			ОсталосьДней = ВозвращаемоеЗначение.ОсталосьДней - (ОсталосьЛет * 365);
			Если ОсталосьДней > 0 Тогда
				ДанныеПредставления.Добавить(
					СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
						ПредставлениеДней, ОсталосьДней));
			КонецЕсли;
			ВозвращаемоеЗначение.Представление = СтрСоединить(ДанныеПредставления, ", ");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область Ошибки

// Добавляет в свойство структуры сообщения текст ошибки
//
// Параметры:
//  Сообщение    - Структура - сообщение, в которое добавляется текст ошибки.
//  ТекстОшибки  - Строка - добавляемый текст ошибки.
//
Процедура ДобавитьТекстОшибки(Сообщение, ТекстОшибки) Экспорт
	
	Если Сообщение.Ошибки.Получить(ТекстОшибки) <> Неопределено Тогда
		Возврат;
	Иначе
		Сообщение.Ошибки.Вставить(ТекстОшибки, Истина);
	КонецЕсли;
	
	Если ПустаяСтрока(Сообщение.ТекстОшибки) Тогда
		Сообщение.ТекстОшибки = ТекстОшибки;
	Иначе
		Сообщение.ТекстОшибки = Сообщение.ТекстОшибки + Символы.ПС + ТекстОшибки;
	КонецЕсли;
	
	Если Сообщение.Свойство("ТребуетсяПодписание") Тогда
		Сообщение.ТребуетсяПодписание = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает текст для представления внутренней ошибки библиотек ГосИС.
//
// Параметры:
//  ПредставлениеПодсистемы  - Строка - представление интегрированной подсистемы
//  УточнениеОшибки - Строка - описание возникшей ошибки
//
// Возвращаемое значение:
//	Строка - дополненное описание ошибки
//
Функция ТекстОшибки(Знач ПредставлениеПодсистемы = "", Знач УточнениеОшибки) Экспорт
	
	ПредставлениеПодсистемы = ПредставлениеПодсистемы(ПредставлениеПодсистемы);
	
	ТекстОшибки = 
		СтрШаблон(НСтр("ru='Внутренняя ошибки библиотеки %1.'"),ПредставлениеПодсистемы)
		+ Символы.ПС
		+ УточнениеОшибки;
	
	Возврат ТекстОшибки;
	
КонецФункции

// Новый параметры ошибки.
// 
// Возвращаемое значение:
//  Структура - Новый параметры ошибки:
// * ВыбрасыватьИсключение - Булево - 
// * ЗаписыватьВЖурналРегистрации - Булево - 
// * ПрерватьОбработкуОчередиСообщений - Булево - 
// * СообщатьОбОшибке - Булево - 
Функция НовыйПараметрыОшибки() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ВыбрасыватьИсключение",             Ложь);
	ВозвращаемоеЗначение.Вставить("ЗаписыватьВЖурналРегистрации",      Ложь);
	ВозвращаемоеЗначение.Вставить("ПрерватьОбработкуОчередиСообщений", Ложь);
	ВозвращаемоеЗначение.Вставить("СообщатьОбОшибке",                  Ложь);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область ТекстыСтандартныхСообщений

Функция ТекстКомандаНеМожетБытьВыполнена() Экспорт
	Возврат НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'");
КонецФункции

#КонецОбласти

#Область ПроверкаВидовПродукции

// Определяет является ли тип упаковки логистической или групповой товарной упаковкой.
//
//Параметры:
//   ВидУпаковки                 - ПеречислениеСсылка.ТипыУпаковок - тип упаковки.
//   НеЗаполненКакУпаковка       - Булево - Истина если пустой вид рассматривать как "возможно упаковка".
//   ВключатьОбъемноСортовойУчет - Булево - Обработка объемно-сортовых кодов.
// 
//Возвращаемое значение:
//   Булево - Истина, если вид упаковки относится к логистической или групповой.
//
Функция ЭтоУпаковкаПоВиду(ВидУпаковки, НеЗаполненКакУпаковка = Ложь, ВключатьОбъемноСортовойУчет = Истина) Экспорт
	
	Возврат ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая")
		Или ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Групповая")
		Или ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор")
		Или (ВключатьОбъемноСортовойУчет 
			И ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.ОбъемноСортовойУчет"))
		Или (НеЗаполненКакУпаковка И ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.ПустаяСсылка"));
	
КонецФункции

#КонецОбласти

// Идентификатор классификатора видов продукции ИС.
// 
// Возвращаемое значение:
//  Строка - Идентификатор классификатора видов продукции ИС
Функция ИдентификаторКлассификатораВидовПродукцииИС() Экспорт
	
	Возврат "ClassifierOfProductTypeSettingsBGosIS";
	
КонецФункции

// Конвертирует двоичные данные в Base64
// 
// Параметры:
// 	ДвоичныеДанные - ДвоичныеДанные - Двоичные данные
// Возвращаемое значение:
// 	Строка - Строка в Base64
Функция ДвоичныеДанныеBase64(ДвоичныеДанные) Экспорт
	
	Base64 = Base64Строка(ДвоичныеДанные);
	Base64 = СтрЗаменить(Base64, Символы.ПС, "");
	Base64 = СтрЗаменить(Base64, Символы.ВК, "");
	
	Возврат Base64;
	
КонецФункции

// Формирует представление параметра в формате CamelCase в строковое представление с пробелами.
// 
// Параметры:
//  ИмяПараметра - Произвольный - Имя параметра.
// 
// Возвращаемое значение:
//  Строка - Представление параметра с пробелами.
Функция ПредставлениеВстроенногоИмени(ИмяПараметра) Экспорт
	
	ДлинаСтроки = СтрДлина(ИмяПараметра);
	
	Если ДлинаСтроки = 0 Тогда
		Возврат ИмяПараметра;
	КонецЕсли;
	
	ИтоговыеДанные      = Новый Массив();
	ПредыдущийЗаглавный = Ложь;
	
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		
		ТекущийСимвол      = Сред(ИмяПараметра, НомерСимвола, 1);
		ТекущийЗаглавный   = (ТекущийСимвол = ВРег(ТекущийСимвол));
		СледующийЗаглавный = Ложь;
		Если НомерСимвола < ДлинаСтроки Тогда
			СледующийСимвол    = Сред(ИмяПараметра, НомерСимвола + 1, 1);
			СледующийЗаглавный = (СледующийСимвол = ВРег(СледующийСимвол));
		КонецЕсли;
		
		Если НомерСимвола = 1 Тогда
			ИтоговыеДанные.Добавить(Врег(ТекущийСимвол));
		Иначе
			Если ПредыдущийЗаглавный Тогда
				ИтоговыеДанные.Добавить(ТекущийСимвол);
			Иначе
				Если ТекущийЗаглавный Тогда
					ИтоговыеДанные.Добавить(" ");
					Если СледующийЗаглавный Тогда
						ИтоговыеДанные.Добавить(ТекущийСимвол);
					Иначе
						ИтоговыеДанные.Добавить(НРег(ТекущийСимвол));
					КонецЕсли;
				Иначе
					ИтоговыеДанные.Добавить(ТекущийСимвол);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ПредыдущийЗаглавный = (ТекущийСимвол = ВРег(ТекущийСимвол));
		
	КонецЦикла;
	
	Возврат СтрСоединить(ИтоговыеДанные);
	
КонецФункции

#Область ЧастичноеВыбытие

// Возвращает признак возможности для вида продукции участвовать в частичном выбытии.
// 
// Параметры:
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования.
// Возвращаемое значение:
//  Булево - Вид продукци может выбывать частично.
Функция ПоддерживаетсяЧастичноеВыбытие(ПараметрыСканирования) Экспорт
	
	ВидыПродукции = ПараметрыСканирования.ДопустимыеВидыПродукции;
	
	Результат = Ложь;
	Для Каждого ВидПродукции Из ВидыПродукции Цикл
		ВидОперацииИС = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ОперацияИС(ПараметрыСканирования, ВидПродукции);
		Если ОбщегоНазначенияИСКлиентСерверПовтИсп.ПоддерживаетсяЧастичноеВыбытие(ВидПродукции, ВидОперацииИС) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Функция возвращает текущее рабочее место пользователя
// 
// Возвращаемое значение:
//  ОпределяемыйТип.РабочиеМестаИС - Рабочее место пользователя
Функция РабочееМестоПользователя() Экспорт
	
	#Если Сервер Тогда
		
		МодульМенеджерОборудованияВызовСервера = ОбщегоНазначения.ОбщийМодуль("МенеджерОборудованияВызовСервера");
		ТекущееРабочееМесто = МодульМенеджерОборудованияВызовСервера.РабочееМестоКлиента();
		
	#ИначеЕсли ВнешнееСоединение Тогда
		
		ТекущееРабочееМесто = Неопределено;
		
	#Иначе
		
		
		Если МенеджерОборудованияИСКлиентПовтИсп.ИспользуетсяПодсистемаБиблиотекиБПО3() Тогда
			МодульМенеджерОборудованияКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("МенеджерОборудованияКлиент");
			ТекущееРабочееМесто = МодульМенеджерОборудованияКлиент.РабочееМестоКлиента();
		Иначе
			МодульМенеджерОборудованияВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль("МенеджерОборудованияВызовСервера");
			ТекущееРабочееМесто = МодульМенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
		КонецЕсли;
		
	#КонецЕсли
	
	Возврат ТекущееРабочееМесто;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значение из двухуровневого кэша или Неопределено, если значение отсутствует.
//
// Параметры:
//   ГлобальныйКеш - Соответствие из Произвольный - хранилище локальных кэшей
//   Имя - Строка - ключ для получения локального кэша
//   Значение - Произвольный - ключ для поиска значения в локальном кэше
//   ЛокальныйКеш - Соответствие из Произвольный - выходной параметр, содержит локальный кэш для указанного имени
//
// Возвращаемое значение:
//   Произвольный - найденное значение из кэша
//   - Неопределено - если значение или глобальный кэш отсутствуют
Функция ПрочитатьКеш(ГлобальныйКеш, Имя, Значение, ЛокальныйКеш) Экспорт
	
	Если ГлобальныйКеш <> Неопределено Тогда
		
		Если ТипЗнч(Значение) = Тип("Массив")
			Или ТипЗнч(Значение) = Тип("ФиксированныйМассив") Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ЛокальныйКеш = ГлобальныйКеш[Имя];
		Если ЛокальныйКеш = Неопределено Тогда
			ЛокальныйКеш = Новый Соответствие;
			ГлобальныйКеш.Вставить(Имя, ЛокальныйКеш);
		КонецЕсли;
		
		Результат = ЛокальныйКеш[Значение];
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#Область РаботаСДатами

Функция ДатаИзСтрокиUNIX(Знач Значение, Делитель = 1000, ПриводитьКМестномуВремени = Истина) Экспорт
	
	Значение = '19700101' + Цел(Значение / Делитель);
	
	Если ПриводитьКМестномуВремени Тогда
		Возврат МестноеВремя(Значение);
	Иначе
		Возврат Значение;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РаботаСМассивами

#Область ДоступностьРеквизитовДокументов

// Устанавливает признак доступности для массива элементов формы.
//
// Параметры:
//  Форма            - ФормаКлиентскогоПриложения - форма, для элементов которой устанавливается признак доступности. 
//  МассивЭлементов  - Массив Из Строка - содержит имена элементов формы.
//  Доступно         - Булево           - признак доступности.
//
Процедура УстановитьДоступностьЭлементовФормы(Форма, МассивЭлементов, Доступно) Экспорт
	
	Для Каждого ИмяЭлемента Из МассивЭлементов Цикл
		ТекущийЭлемент = Форма.Элементы.Найти(ИмяЭлемента);
		
		Если ТекущийЭлемент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТипЭлемента = ТипЗнч(ТекущийЭлемент);
		
		Если ТипЭлемента = Тип("КнопкаФормы")
		 Или ТипЭлемента = Тип("ГруппаФормы")
			И (ТекущийЭлемент.Вид = ВидГруппыФормы.Подменю
			Или ТекущийЭлемент.Вид = ВидГруппыФормы.ГруппаКнопок) Тогда
			Форма.Элементы[ИмяЭлемента].Доступность = Доступно;
		Иначе
			Форма.Элементы[ИмяЭлемента].ТолькоПросмотр = Не Доступно;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Рекурсивно устанавливает для подчиненных элементов типа "ПолеФормы" - признак "ТолькоПросмотр",
// для подчиненных элементов типа "КнопкаФормы" - признак "Доступность", за исключением элементов,
// имена которых перечислены в исключениях.
//
// Параметры:
//  ГруппаЭлементовФормы - ГруппаФормы, ТаблицаФормы - Группа элементов управляемой формы.
//  Доступность          - Булево      - Признак доступности подчиненных элементов.
//  Исключения           - Строка, Массив Из Строка - Имена элементов формы.
//  ДоступностьКомандПоискКопированиеВБуфер - Булево - доступность стандартных команд "Копировать в буфер", "Поиск.." в таблчных частях
Процедура УстановитьДоступностьЭлементовГруппыФормыРекурсивно(ГруппаЭлементовФормы, Доступность, Исключения = "",
	ДоступностьКомандПоискКопированиеВБуфер = Истина) Экспорт
	
	ТипГруппыФормы = ТипЗнч(ГруппаЭлементовФормы);
	Если НЕ (ТипГруппыФормы = Тип("ГруппаФормы") или ТипГруппыФормы = Тип("ТаблицаФормы")) Тогда
		Возврат;
	КонецЕсли;
	
	МассивИсключений = Новый Массив;
	ТипИсключения = ТипЗнч(Исключения);
	Если ТипИсключения = Тип("Строка") и ЗначениеЗаполнено(Исключения) Тогда
		МассивИсключений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Исключения, ", ");
	ИначеЕсли ТипИсключения = Тип("Массив") Тогда
		МассивИсключений = Исключения;
	КонецЕсли;
	
	Для Каждого ЭлементФормы из ГруппаЭлементовФормы.ПодчиненныеЭлементы Цикл
		
		Если НЕ МассивИсключений.Найти(ЭлементФормы.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДоступностьКомандПоискКопированиеВБуфер Тогда
			Если СтрНайти(ЭлементФормы.Имя, "КопироватьВБуферОбмена") > 0
				Или СтрНайти(ЭлементФормы.Имя, "ПоискПоТекущемуЗначению") > 0
				Или СтрНайти(ЭлементФормы.Имя, "Найти") > 0
				Или СтрНайти(ЭлементФормы.Имя, "ОтменитьПоиск") > 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ТипЭлемента = ТипЗнч(ЭлементФормы);
		Если ТипЭлемента = Тип("ГруппаФормы") Тогда 
			УстановитьДоступностьЭлементовГруппыФормыРекурсивно(
				ЭлементФормы, Доступность, МассивИсключений, ДоступностьКомандПоискКопированиеВБуфер);
		ИначеЕсли ТипЭлемента = Тип("ТаблицаФормы") Тогда
			УстановитьДоступностьЭлементовГруппыФормыРекурсивно(
				ЭлементФормы, Доступность, МассивИсключений, ДоступностьКомандПоискКопированиеВБуфер);
			УстановитьДоступностьЭлементовГруппыФормыРекурсивно(
				ЭлементФормы.КоманднаяПанель, Доступность, МассивИсключений, ДоступностьКомандПоискКопированиеВБуфер);
			УстановитьДоступностьЭлементовГруппыФормыРекурсивно(
				ЭлементФормы.КонтекстноеМеню, Доступность, МассивИсключений, ДоступностьКомандПоискКопированиеВБуфер);
		ИначеЕсли ТипЭлемента = Тип("ПолеФормы") Тогда
			ЭлементФормы.ТолькоПросмотр = НЕ Доступность;
		ИначеЕсли ТипЭлемента = Тип("КнопкаФормы") Тогда
			ЭлементФормы.Доступность = Доступность;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура НастроитьОтборПоОрганизации(Форма, Результат, Префикс = Неопределено, Знач ЗначениеПрефиксы = Неопределено) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Форма.Организации.ЗагрузитьЗначения(Результат);
	ИначеЕсли ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
	ИначеЕсли Результат = Неопределено Или Не ЗначениеЗаполнено(Результат) Тогда
		Форма.Организации.Очистить();
	Иначе
		Форма.Организации.Очистить();
		ЭлементСписка = Форма.Организации.Добавить();
		ЭлементСписка.Значение = Результат;
		Если Не(ЭлементСписка.Значение = Результат) Тогда
			Форма.Организации.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	Если Форма.Организации.Количество() = 1 Тогда
		Форма.Организация = Форма.Организации.Получить(0).Значение;
		Форма.ОрганизацииПредставление = Строка(Форма.Организация);
	ИначеЕсли Форма.Организации.Количество() = 0 Тогда
		Форма.Организация = Неопределено;
		Форма.ОрганизацииПредставление = "";
	Иначе
		Форма.Организация = Неопределено;
		Форма.ОрганизацииПредставление = Строка(Форма.Организации);
	КонецЕсли;
	
	Если ЗначениеПрефиксы = Неопределено Тогда
		Префиксы = Новый Массив;
		Префиксы.Добавить("Оформлено");
		Префиксы.Добавить("КОформлению");
	Иначе
		Если ТипЗнч(ЗначениеПрефиксы) = Тип("Строка") Тогда
			Префиксы = Новый Массив();
			Префиксы.Добавить(ЗначениеПрефиксы);
		Иначе
			Префиксы = ЗначениеПрефиксы;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Значение Из Префиксы Цикл
		
		Если Форма.Организации.Количество() > 1 Тогда
			Окончание = "Организации";
		Иначе 
			Окончание = "Организация";
		КонецЕсли;
		
		Если Значение = "Отбор" Тогда
			Постфикс = Окончание;
		Иначе
			Постфикс = "Отбор" + Окончание;
		КонецЕсли;
		
		СтраницыОтбораОрганизация = Форма.Элементы.Найти("Страницы" + Значение + Постфикс);
		Если СтраницыОтбораОрганизация <> Неопределено Тогда
			СтраницыОтбораОрганизация.ТекущаяСтраница = Форма.Элементы["Страница" + Значение + Окончание];
		КонецЕсли;
	КонецЦикла;
	
	Если Префикс <> Неопределено Тогда
		ЭлементОтбораОрганизация = Форма.Элементы.Найти(Префикс + ?(Форма.Организации.Количество() > 1,
		                                                                "Организации",
		                                                                "Организация"));
		Если ЭлементОтбораОрганизация <> Неопределено Тогда
			Форма.ТекущийЭлемент = ЭлементОтбораОрганизация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыПредставленияНоменклатуры() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Номенклатура",               Неопределено);
	Параметры.Вставить("Характеристика",             Неопределено);
	Параметры.Вставить("ХарактеристикиИспользуются", Ложь);
	Параметры.Вставить("Серия",                      Неопределено);
	Параметры.Вставить("СерииИспользуются",          Ложь);
	Параметры.Вставить("ТолькоПросмотр",             Неопределено);
	Параметры.Вставить("ДляОтображения",             Ложь);
	
	Возврат Параметры;
	
КонецФункции

Функция ПредставлениеНоменклатурыФорматированнойСтрокой(Параметры) Экспорт
	
	Номенклатура               = Параметры.Номенклатура;
	Характеристика             = Параметры.Характеристика;
	ХарактеристикиИспользуются = Параметры.ХарактеристикиИспользуются;
	Серия                      = Параметры.Серия;
	СерииИспользуются          = Параметры.СерииИспользуются;
	ТолькоПросмотр             = Параметры.ТолькоПросмотр;
	ДляОтображения             = Параметры.ДляОтображения;
	
	МассивСтрок = Новый Массив;
	
	Если ТолькоПросмотр Тогда
		ЦветТекста = WebЦвета.Серый; // ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС;
	Иначе
		ЦветТекста = Неопределено;
	КонецЕсли;
	
	ПустоеЗначение = Истина;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ПустоеЗначение = Ложь;
		Если ТолькоПросмотр Тогда
			Ссылка = ПолучитьНавигационнуюСсылку(Номенклатура);
		Иначе 
			Ссылка = "ВыбратьНоменклатуру";
		КонецЕсли;
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
			СокрЛП(Номенклатура), , ЦветТекста, , Ссылка));
	Иначе
		Если ТолькоПросмотр Тогда
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = 'Номенклатура не указана'"),, ЦветТекста));
		Иначе
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = 'выбрать номенклатуру'"), , , , "ВыбратьНоменклатуру"));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустоеЗначение И (ХарактеристикиИспользуются Или ДляОтображения) Тогда
	
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" "));
		
		Если ТолькоПросмотр И ЗначениеЗаполнено(Характеристика) Тогда
			Ссылка = ПолучитьНавигационнуюСсылку(Характеристика);
		Иначе
			Ссылка = "ВыбратьХарактеристику";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Характеристика) Тогда
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
				СтрШаблон("(%1)", Характеристика), , ЦветТекста, , Ссылка));
		ИначеЕсли ТолькоПросмотр Тогда
			Если Не ДляОтображения Тогда
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
					НСтр("ru = '(характеристика не указана)'"),,ЦветТекста));
			КонецЕсли;
		Иначе
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = '(выбрать характеристику)'"), , , , Ссылка));
		КонецЕсли;
	
	КонецЕсли;
	
	Если Не ПустоеЗначение И (СерииИспользуются Или ДляОтображения) Тогда
	
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" "));
		
		Если ТолькоПросмотр И ЗначениеЗаполнено(Серия) Тогда
			Ссылка = ПолучитьНавигационнуюСсылку(Серия);
		Иначе 
			Ссылка = "ВыбратьСерию";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Серия) Тогда
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
				СтрШаблон("(%1)", Серия), , ЦветТекста, , Ссылка));
		ИначеЕсли ТолькоПросмотр Тогда
			Если Не ДляОтображения Тогда
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
					НСтр("ru = '(серия не указана)'"),,ЦветТекста));
			КонецЕсли;
		Иначе
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru = '(выбрать серию)'"), , , , Ссылка));
		КонецЕсли;
	
	КонецЕсли;

	Возврат Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецФункции

#КонецОбласти

#Область РаботаСJSON

// Сформировать текст ошибки по результату отправки запроса.
//
// Параметры:
//  URLЗапроса - Строка - Заголовок ошибки, например: Параметры авторизации не получены из ИС МОТП.
//  РезультатОтправкиЗапроса - Структура - Результат отправки HTTP-запроса:
//  * ЗапросОтправлен             - Булево - признак того, что сообщение отправлено.
//  * ОтветПолучен                - Булево - признак того, что сообщение получено.
//  * КодСостояния                - Число  - Код состояния HTTP-запроса.
//  * ТекстОшибки                 - Строка - текст ошибки, если таковая возникла.
//  * ТекстВходящегоСообщенияJSON - Строка - текст ответа, на отправленное сообщение.
// Возвращаемое значение:
//  Строка - Текст ошибки.
Функция ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса) Экспорт
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда

		ТекстОшибки = СтрШаблон(
			НСтр("ru='При выполнении запроса %1 возникла ошибка.
				     |Код состояния HTTP: %2.
				     |Текст ошибки: %3.'"),
			URLЗапроса,
			РезультатОтправкиЗапроса.КодСостояния,
			ПредставлениеОшибкиИзJSON(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON));
			
	Иначе
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru='При отправке запроса %1 возникла ошибка.
				     |Текст ошибки: %2.'"),
			URLЗапроса,
			РезультатОтправкиЗапроса.ТекстОшибки);

	КонецЕсли;
	
	ТекстОшибки = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(ТекстОшибки);
	
	Возврат ТекстОшибки;

КонецФункции

// Получить из текста JSON структуру.
// 
// Параметры:
// 	ТекстJSON                    - Строка - Текст JSON.
// 	ПреобразовыватьВСоответствие - Булево - Признак преобразования в соответствие.
// Возвращаемое значение:
// 	Структура, Неопределено, Произвольный - Результат преобразования JSON.
Функция ТекстJSONВОбъект(ТекстJSON, ПреобразовыватьВСоответствие = Ложь) Экспорт
	
	РезультатРазбора = Неопределено;
	
	#Если ВебКлиент Тогда
		
		РезультатРазбора = ОбщегоНазначенияИСВызовСервера.ТекстJSONВОбъект(ТекстJSON, ПреобразовыватьВСоответствие);	
		
	#Иначе
	
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(ТекстJSON);
		
		Попытка
			РезультатРазбора = ПрочитатьJSON(Чтение, ПреобразовыватьВСоответствие);
		Исключение
			РезультатРазбора = Неопределено;
		КонецПопытки;
		
	#КонецЕсли
	
	Возврат РезультатРазбора;
	
КонецФункции

// Формирует из структуры текст JSON
// 
// Параметры:
// 	Структура                    - Структура - Произвольная структура данных
//  УдалитьПробелыИПереносыСтрок - Булево    - признак использования отступов, по умолчанию Истина.
//  НастройкиСериализации - Неопределено, НастройкиСериализацииJSON -
// Возвращаемое значение:
// 	Строка - Текст JSON
Функция ОбъектВТекстJSON(Структура, УдалитьПробелыИПереносыСтрок = Ложь, НастройкиСериализации = Неопределено) Экспорт
	
	ТекстJSON = "";
	
	#Если ВебКлиент Тогда
		
		ТекстJSON = ОбщегоНазначенияИСВызовСервера.ОбъектВТекстJSON(Структура, УдалитьПробелыИПереносыСтрок);	
		
	#Иначе
	
		Если УдалитьПробелыИПереносыСтрок Тогда
			ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, "");
		Иначе
			ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "  ");
		КонецЕсли;
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		
		ЗаписатьJSON(ЗаписьJSON, Структура, НастройкиСериализации);
		
		ТекстJSON = ЗаписьJSON.Закрыть();
	
	#КонецЕсли
	
	Возврат ТекстJSON;
	
КонецФункции

#КонецОбласти

Функция ПересечениеМассивов(Массив1, Массив2) Экспорт
	
	Если Массив1.Количество() >= Массив2.Количество() Тогда
		Коллекция1 = Массив1;
		Коллекция2 = Массив2;
	Иначе
		Коллекция1 = Массив2;
		Коллекция2 = Массив1;
	КонецЕсли;
	
	ЭлементыКоллекции = Новый Соответствие;
	Для Каждого Элемент Из Коллекция1 Цикл
		ЭлементыКоллекции.Вставить(Элемент, Истина);
	КонецЦикла;
	
	ОбщиеЭлементы = Новый Массив;
	
	Для Каждого Элемент Из Коллекция2 Цикл
		Если ЭлементыКоллекции[Элемент] <> Неопределено Тогда
			ОбщиеЭлементы.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбщиеЭлементы;
	
КонецФункции

#КонецОбласти

#Область РаботаССоответствием

Функция ДанныеПоПутиВСоответствии(ИсточникДанных, Путь, ЗначениеПоУмполчанию = Неопределено) Экспорт
	
	ТекущийУзел = ИсточникДанных;
	Результат   = ЗначениеПоУмполчанию;
	
	Для Каждого ЭлементПути Из Путь Цикл
		
		ТекущийУзел = ТекущийУзел[ЭлементПути];
		
		Если ТекущийУзел = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекущийУзел;
	
КонецФункции

Процедура УстановитьДанныеПоПутиВСоответствии(ИсточникДанных, Путь, Значение) Экспорт
	
	ТекущийУзел = ИсточникДанных;
	Индекс      = 0;
	Для Каждого ЭлементПути Из Путь Цикл
		
		ЗначениеПоЭлементуПути = ТекущийУзел[ЭлементПути];
		
		Если ЗначениеПоЭлементуПути = Неопределено Тогда
			Если Путь.ВГраница() = Индекс Тогда
				ТекущийУзел[ЭлементПути] = Значение;
			Иначе
				ЗначениеПоЭлементуПути = Новый Соответствие();
				ТекущийУзел[ЭлементПути] = ЗначениеПоЭлементуПути;
			КонецЕсли;
		КонецЕсли;
		
		ТекущийУзел = ЗначениеПоЭлементуПути;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Функция ПредставлениеЕдиницыЧастичногоВыбытия(ВидПродукции) Экспорт
	
	Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоМаркируемаяПродукцияЕГАИС(ВидПродукции) Тогда
		Возврат НСтр("ru = 'мл.'");
	Иначе
		Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ПредставлениеЕдиницыЧастичногоВыбытия(ВидПродукции);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

Функция ИмяОбъектаИзИмениФормы(Форма, ПолноеИмя = Истина) Экспорт
	
	ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы, ".");
	
	Если ПолноеИмя Тогда
		ИмяОбъекта = ЧастиИмени[0] + "." + ЧастиИмени[1];
	Иначе
		ИмяОбъекта = ЧастиИмени[1];
	КонецЕсли;
	
	Возврат ИмяОбъекта;
	
КонецФункции

#Область РаботаСJSONТекстом

// Конвертирует входящий текст JSON содержащий globalErrors в представление ошибки.
// 
// Параметры:
// 	ТекстВходящегоСообщенияJSON - Строка - Текст сообщения JSON.
// Возвращаемое значение:
// 	Строка - Представление ошибки.
Функция ПредставлениеОшибкиИзJSON(ТекстВходящегоСообщенияJSON)
	
	ДанныеJSON = ТекстJSONВОбъект(ТекстВходящегоСообщенияJSON);
	
	Если ДанныеJSON <> Неопределено
		И ТипЗнч(ДанныеJSON) = Тип("Структура")
		И ДанныеJSON.Свойство("globalErrors")
		И ТипЗнч(ДанныеJSON.globalErrors) = Тип("Массив") Тогда
		
		ТекстыОшибок = Новый Массив;
		Для Каждого СтрокаОшибки Из ДанныеJSON.globalErrors Цикл
			
			Если Не (ТипЗнч(СтрокаОшибки) = Тип("Строка") Или ТипЗнч(СтрокаОшибки) = Тип("Структура")) Тогда
				Возврат ТекстВходящегоСообщенияJSON;
			КонецЕсли;
			
			Если ТипЗнч(СтрокаОшибки) = Тип("Строка") И ЗначениеЗаполнено(СтрокаОшибки) Тогда
				ТекстыОшибок.Добавить(ТекстПредставленияОшибки(СтрокаОшибки));
			ИначеЕсли ТипЗнч(СтрокаОшибки) = Тип("Структура") Тогда
				
				ТекстОшибки = Неопределено;
				КодОшибки   = Неопределено;
				СтрокаОшибки.Свойство("error",     ТекстОшибки);
				СтрокаОшибки.Свойство("errorCode", КодОшибки);
				ПредставлениеОшибки = СокрЛП(СтрШаблон("%1: %2", КодОшибки, ТекстОшибки));
				Если ЗначениеЗаполнено(КодОшибки) Или ЗначениеЗаполнено(ТекстОшибки) Тогда
					ТекстыОшибок.Добавить(ПредставлениеОшибки);
				Иначе
					Возврат ТекстВходящегоСообщенияJSON;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДанныеJSON.Свойство("fieldErrors") И ТипЗнч(ДанныеJSON.fieldErrors) = Тип("Массив") Тогда
			
			Для Каждого СтрокаОшибкиПоля Из ДанныеJSON.fieldErrors Цикл
				
				ИмяПоля     = Неопределено;
				ТекстОшибки = Неопределено;
				СтрокаОшибкиПоля.Свойство("fieldName",  ИмяПоля);
				СтрокаОшибкиПоля.Свойство("fieldError", ТекстОшибки);
				
				ПредставлениеОшибки = СокрЛП(СтрШаблон("%1: %2", ИмяПоля, ТекстОшибки));
				Если ЗначениеЗаполнено(ИмяПоля) Или ЗначениеЗаполнено(ТекстОшибки) Тогда
					ТекстыОшибок.Добавить(ПредставлениеОшибки);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат СтрСоединить(ТекстыОшибок, Символы.ПС);
		
	ИначеЕсли ДанныеJSON <> Неопределено
		И ТипЗнч(ДанныеJSON) = Тип("Массив") Тогда
		
		ТекстыОшибок = Новый Массив;
		Для Каждого СтрокаОшибки Из ДанныеJSON Цикл
			
			Если Не ТипЗнч(СтрокаОшибки) = Тип("Структура")
				Или Не СтрокаОшибки.Свойство("cisInfo")
				Или Не СтрокаОшибки.Свойство("errorMessage") Тогда
				Возврат ТекстВходящегоСообщенияJSON;
			КонецЕсли;
			
			ТекстыОшибок.Добавить(ТекстПредставленияОшибки(СтрокаОшибки.errorMessage));
			
		КонецЦикла;
		
		Возврат СтрСоединить(ТекстыОшибок, Символы.ПС);
		
	Иначе
		Возврат ТекстВходящегоСообщенияJSON;
	КонецЕсли;
	
КонецФункции

// Возвращает найденое значение во внутреннем соответствии текстов ошибок.
// Если значение в соответствии не найдено, то возвращается исходное значение.
// 
// Параметры:
// 	ИсходноеСообщение - Строка - Исходный текст.
// Возвращаемое значение:
// 	Строка - Найденое значение или сходнное.
Функция ТекстПредставленияОшибки(ИсходноеСообщение)
	
	ЗначениеПоиска = СокрЛП(НРег(ИсходноеСообщение));
	
	ТекстыОшибок = Новый Соответствие();
	
	ТекстыОшибок.Вставить(
		НРег("Not enough balance"),
		НСтр("ru = 'Недостаточно средств на балансе для получения кодов маркировки из СУЗ'"));
	
	ВозвращаемоеЗначение = ТекстыОшибок.Получить(ЗначениеПоиска);
	
	Если ВозвращаемоеЗначение = Неопределено Тогда
		ВозвращаемоеЗначение = ИсходноеСообщение;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти
