
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбработатьДанныеOuterDocflows(ПараметрКоманды);
	                                              
	Оповестить("ПослеОбработкиOuterDocflows");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьДанныеOuterDocflows(МассивФайлов)

	ФайлыКОбработке = Новый Массив;
	
	Для Каждого Файл Из МассивФайлов Цикл 
		
		Если Не ЗначениеЗаполнено(Файл.ГлавныйДокумент) Тогда 
			Сообщить("Не указана ЭТрН в файле: " + Файл);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Файл.СвязанныйДокумент) Тогда 
			Сообщить("Не указан Титул в файле: " + Файл);
			Продолжить;
		КонецЕсли;	
		
		ФайлыКОбработке.Добавить(Файл);
		
	КонецЦикла;
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработатьOuterDocflowsНеобработанныхФайлов(ФайлыКОбработке);	

КонецПроцедуры
