
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ЗаполнитьДеревоСобытий();
	
	ПериодФормирования = Элементы.ПериодФормирования.СписокВыбора[0];
	Элементы.АктуализироватьРасчеты.Видимость = НЕ ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки = Новый Структура;
	Настройки.Вставить("НастройкиОтбора",Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Отчет.КалендарьСобытий", "ФормаОтчета", Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	ДеревоВидыСобытийНастройки = Настройки.Получить("ВидыСобытий");
	Если ДеревоВидыСобытийНастройки <> Неопределено Тогда
		
		ДеревоВидыСобытийФорма = РеквизитФормыВЗначение("ВидыСобытий");
		Для каждого СтрокаДереваНастройки Из ДеревоВидыСобытийНастройки.Строки Цикл
			
			Если СтрокаДереваНастройки.Пометка > 0 Тогда
				
				НайденнаяСтрока = ДеревоВидыСобытийФорма.Строки.Найти(СтрокаДереваНастройки.ВидСобытия, "ВидСобытия",Ложь);
				Если НайденнаяСтрока <> Неопределено Тогда
					НайденнаяСтрока.Пометка = СтрокаДереваНастройки.Пометка;
				КонецЕсли;
				
			КонецЕсли;
			
			Для Каждого ПодчиненнаяСтрокаДереваНастройки Из СтрокаДереваНастройки.Строки Цикл
				
				Если ПодчиненнаяСтрокаДереваНастройки.Пометка > 0 Тогда
					
					НайденнаяСтрока = ДеревоВидыСобытийФорма.Строки.Найти(ПодчиненнаяСтрокаДереваНастройки.ВидСобытия, "ВидСобытия",Истина);
					Если НайденнаяСтрока <> Неопределено Тогда
						НайденнаяСтрока.Пометка = ПодчиненнаяСтрокаДереваНастройки.Пометка;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Настройки.Удалить("ВидыСобытий");
		ЗначениеВРеквизитФормы(ДеревоВидыСобытийФорма,"ВидыСобытий");
		
		Для каждого ГруппаВидовСобытий Из ВидыСобытий.ПолучитьЭлементы() Цикл
			
			ПомеченныхЭлементовВГруппе = 0;
			
			Для каждого ВидСобытия Из ГруппаВидовСобытий.ПолучитьЭлементы() Цикл
			
				Если ВидСобытия.Пометка = 1 Тогда
					ПомеченныхЭлементовВГруппе = ПомеченныхЭлементовВГруппе + 1;
				КонецЕсли;
			
			КонецЦикла;
			
			Если ПомеченныхЭлементовВГруппе = 0 Тогда
				ГруппаВидовСобытий.Пометка = 0 ;
			ИначеЕсли ПомеченныхЭлементовВГруппе <> ГруппаВидовСобытий.ПолучитьЭлементы().Количество() Тогда
				ГруппаВидовСобытий.Пометка = 2 ;
			Иначе
				ГруппаВидовСобытий.Пометка = 1 ;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьСостояниеОтчетНеСформирован();
	УправлениеДоступностью();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	СхемаДляОтбора = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("СхемаОтборы");
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаДляОтбора,УникальныйИдентификатор);
	Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	
	ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Отчет.КалендарьСобытий","ФормаОтчета");
	
	Если ЗначениеНастроек <> Неопределено И ЗначениеНастроек.НастройкиОтбора <> Неопределено Тогда
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ЗначениеНастроек.НастройкиОтбора);
		Отчет.КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодФормированияПриИзменении(Элемент)

	УстановитьСостояниеОтчетНеСформирован();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ОчиститьСообщения();

	Если НастройкиОтчетаЗаполненыНеПравильно() Тогда
		Возврат;
	КонецЕсли;
	СформироватьОтчетСервер();
	
	УправлениеДоступностью()
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	ПараметрыДляФормыНастроек = СтруктураФормыНастроек();
	ОткрытьФорму("Отчет.КалендарьСобытий.Форма.ФормаНастроек",ПараметрыДляФормыНастроек,ЭтаФорма,,,, 
		Новый ОписаниеОповещения("НастройкиЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат <> Неопределено Тогда
        
        ОбработатьРезультатНаСервере(Результат.ВидыСобытий);
        Отчет.КомпоновщикНастроек = Результат.КомпоновщикНастроек;
        ИзменилисьНастройки = Истина;
        УстановитьСостояниеОтчетНеСформирован();
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьРасчеты(Команда)
	
	Если НастройкиОтчетаЗаполненыНеПравильно() Тогда
		Возврат;
	КонецЕсли;
	
	КодОтвета = Неопределено;

	
	ПоказатьВопрос(Новый ОписаниеОповещения("АктуализироватьРасчетыЗавершение", ЭтотОбъект), НСтр("ru = 'Актуализировать расчеты с клиентами?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьРасчетыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    КодОтвета = РезультатВопроса;
    Если КодОтвета = КодВозвратаДиалога.Да Тогда
        
        АктуализироватьРасчетыОбновитьОтчет();
        ПоказатьОповещениеПользователя(
        НСтр("ru = 'Расчеты актуализированы'"),
        , // НавигационнаяСсылка
        НСтр("ru = 'Расчеты с клиентами актуализированы'"));
        
    КонецЕсли;
    
    УправлениеДоступностью();

КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция НастройкиОтчетаЗаполненыНеПравильно()

	Для каждого ГруппаВидовСобытий Из ВидыСобытий.ПолучитьЭлементы() Цикл
	
		Для каждого ВидСобытий Из ГруппаВидовСобытий.ПолучитьЭлементы() Цикл
		
			Если ВидСобытий.Пометка = 1 Тогда
				Возврат Ложь;
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать хотя бы один вид событий в настройках'"));
	Возврат Истина;

КонецФункции

&НаСервере
Функция СтруктураФормыНастроек()

	ПараметрыДляФормыНастроек = Новый Структура();
	ПараметрыДляФормыНастроек.Вставить("ВидыСобытий",ВременноеХранилищеНастроекНаСервере());
	ПараметрыДляФормыНастроек.Вставить("НастройкаКомпоновки",Отчет.КомпоновщикНастроек);
	ПараметрыДляФормыНастроек.Вставить("УИД_ВызывающейФормы",УникальныйИдентификатор);
	
	Возврат  ПараметрыДляФормыНастроек;

КонецФункции

&НаСервере
Функция ВременноеХранилищеНастроекНаСервере()
	
	Возврат ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("ВидыСобытий"),УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ОбработатьРезультатНаСервере(АдресДереваПоказатели)
	
	ЗначениеВДанныеФормы(ПолучитьИзВременногоХранилища(АдресДереваПоказатели),ВидыСобытий);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетСервер()

	ТаблицаОтчета.Очистить();
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	
	ОбъектОтчет.СформироватьОтчет(ТаблицаОтчета,СтруктураПараметрыФормированияОтчета());
	ЗначениеВРеквизитФормы(ОбъектОтчет,"Отчет");
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;

КонецПроцедуры 

&НаСервере
Функция СтруктураПараметрыФормированияОтчета()

	СтруктураПараметров = Новый Структура();
	
	СтруктураПараметров.Вставить("ВидыСобытий",РеквизитФормыВЗначение("ВидыСобытий"));
	СтруктураПараметров.Вставить("ПериодФормирования", ПериодФормирования);
	СтруктураПараметров.Вставить("ЕстьПравоЗадачиПроектов", ЕстьПравоЗадачиПроектов);
	СтруктураПараметров.Вставить("ИспользоватьБизнесПроцессыИЗадачи", ИспользоватьБизнесПроцессыИЗадачи);
	СтруктураПараметров.Вставить("ЕстьПравоЗадачаИсполнителя", ЕстьПравоЗадачаИсполнителя);
	СтруктураПараметров.Вставить("ЕстьПравоРолиИсполнителей", ЕстьПравоРолиИсполнителей);
	
	Возврат СтруктураПараметров;

КонецФункции

&НаКлиенте
Процедура УстановитьЗначениеФлажкаВключать(ЗначениеФлажка,Родитель)
	
	Для каждого Элемент Из Родитель.ПолучитьЭлементы() Цикл
	
		Элемент.Пометка = ЗначениеФлажка;
		УстановитьЗначениеФлажкаВключать(ЗначениеФлажка,Элемент);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоСобытий()
	
	ФиксироватьПретензииКлиентов                    = ПолучитьФункциональнуюОпцию("ФиксироватьПретензии");
	ИспользоватьПочтовыйКлиент                      = ПолучитьФункциональнуюОпцию("ИспользоватьПочтовыйКлиент");
	ИспользоватьПрочиеВзаимодействия                = ПолучитьФункциональнуюОпцию("ИспользоватьПрочиеВзаимодействия");
	ИспользоватьУправлениеСделками                  = ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеСделками");
	ИспользоватьСоглашенияСПоставщиками             = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками");
	ИспользоватьСоглашенияСКлиентами                = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользоватьЗаказыКлиентов                      = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыКлиентов");
	ИспользоватьЗаказыПоставщикам                   = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыПоставщикам");
	ИспользоватьЗаявкиНаВозвратТоваровОтКлиентов    = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаВозвратТоваровОтКлиентов");
	ИспользоватьЗаказыНаВнутреннееПотребление       = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыНаВнутреннееПотребление");
	ИспользоватьВнутреннееПотребление               = ПолучитьФункциональнуюОпцию("ИспользоватьВнутреннееПотребление");
	ИспользоватьЗаявкиНаРасходованиеДенежныхСредств = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств");
	ИспользоватьБизнесПроцессыИЗадачи               = ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыИЗадачи");
	ИспользоватьАктыРасхожденийПослеОтгрузки        = ПолучитьФункциональнуюОпцию("ИспользоватьАктыРасхожденийПослеОтгрузки");
	
	ЕстьПраваНаПартнеров                  = ПравоДоступа("Чтение",Метаданные.Справочники.Партнеры);
	ЕстьПраваНаФизЛиц                     = ПравоДоступа("Чтение",Метаданные.Справочники.ФизическиеЛица);
	ЕстьПраваНаДоговора                   = ПравоДоступа("Чтение",Метаданные.Справочники.ДоговорыКонтрагентов);
	ЕстьПраваНаМаркетинговыеМероприятия   = ПравоДоступа("Чтение",Метаданные.Справочники.МаркетинговыеМероприятия);
	ЕстьПраваНаПроекты                    = ПравоДоступа("Чтение",Метаданные.Справочники.Проекты);
	ЕстьПраваНаСделки                     = ПравоДоступа("Чтение",Метаданные.Справочники.СделкиСКлиентами);
	ЕстьПравоСоглашенияСКлиентами         = ПравоДоступа("Чтение",Метаданные.Справочники.СоглашенияСКлиентами);
	ЕстьПравоСоглашенияСПоставщиками      = ПравоДоступа("Чтение",Метаданные.Справочники.СоглашенияСПоставщиками);
	ЕстьПравоЗадачиПроектов               = ПравоДоступа("Чтение",Метаданные.Справочники.ЗадачиПроектов);
	ЕстьПравоУстановкаЦен                 = ПравоДоступа("Чтение",Метаданные.Документы.УстановкаЦенНоменклатуры);
	ЕстьПравоЗаказыКлиентов               = ПравоДоступа("Чтение",Метаданные.Документы.ЗаказКлиента);
	ЕстьПравоОРасхожденияхПослеОтгрузки   = ПравоДоступа("Чтение",Метаданные.Документы.АктОРасхожденияхПослеОтгрузки);
	ЕстьПравоЗаказыПоставщику             = ПравоДоступа("Чтение",Метаданные.Документы.ЗаказПоставщику);
	ЕстьПравоВозвратыПоставщику           = ПравоДоступа("Чтение",Метаданные.Документы.ВозвратТоваровПоставщику);
	ЕстьПравоЗаявкиНаВозврат              = ПравоДоступа("Чтение",Метаданные.Документы.ЗаявкаНаВозвратТоваровОтКлиента);
	ЕстьПравоРеализацияТоваровУслуг       = ПравоДоступа("Чтение",Метаданные.Документы.РеализацияТоваровУслуг);
	ЕстьПравоДоверенностьПолучениеТоваров = ПравоДоступа("Чтение",Метаданные.Документы.ДоверенностьВыданная);
	ЕстьПравоЗаказВнутреннееПотребление   = ПравоДоступа("Чтение",Метаданные.Документы.ЗаказНаВнутреннееПотребление);
	ЕстьПравоРегистрВнутреннееПотребление = ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.ЗаказыНаВнутреннееПотребление);
	ЕстьПравоВнутреннееПотребление        = ПравоДоступа("Чтение",Метаданные.Документы.ВнутреннееПотребление);
	ЕстьПравоЗаявкаНаРасходованиеДС       = ПравоДоступа("Чтение",Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств);
	ЕстьПравоСверкаВзаиморасчетов         = ПравоДоступа("Чтение",Метаданные.Документы.СверкаВзаиморасчетов2_4);
	ЕстьПравоСверкаВзаиморасчетов2_5_11   = ПравоДоступа("Чтение",Метаданные.Документы.СверкаВзаиморасчетов2_5_11);
	ЕстьПравоЗадачаИсполнителя            = ПравоДоступа("Чтение",Метаданные.Задачи.ЗадачаИсполнителя);
	ЕстьПравоРолиИсполнителей             = ПравоДоступа("Просмотр",Метаданные.РегистрыСведений.ИсполнителиЗадач);
	ЕстьПравоРегистрЗаявкиНаВозврат       = ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат);
	ЕстьПравоРегистрТоварыКОтгрузке       = ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.ТоварыКОтгрузке);
	ЕстьПравоРегистрРасчетыПоставщиками   = ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоДокументам);
	ЕстьПравоРегистрРасчетыКлиентами      = ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоДокументам);
	
	
	ЕстьПраваНаВзаимодействия = ПравоДоступа("Чтение",Метаданные.Документы.Встреча)
	                            И ПравоДоступа("Чтение",Метаданные.Документы.ТелефонныйЗвонок)
	                            И ПравоДоступа("Чтение",Метаданные.Документы.ЭлектронноеПисьмоВходящее)
	                            И ПравоДоступа("Чтение",Метаданные.Документы.ЭлектронноеПисьмоИсходящее);
	
	УзелДерева = ДобавленноеВДеревоВидСобытия(ВидыСобытий,"Маркетинг", НСтр("ru = 'Маркетинг'"));
	Если ЕстьПраваНаМаркетинговыеМероприятия Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "МаркетинговыеМероприятия",НСтр("ru = 'Маркетинговые мероприятия'"));
	КонецЕсли;
	Если ЕстьПравоУстановкаЦен Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "УстановкаЦен", НСтр("ru = 'Установки цен номенклатуры'"));
	КонецЕсли;
	CRMЛокализация.ДополнитьДеревоСобытийОтчетКалендарьСобытий(УзелДерева);
	УдалитьРодительскийУзелДереваЕслиПустой(УзелДерева);
	
	УзелДерева = ДобавленноеВДеревоВидСобытия(ВидыСобытий,"Продажи", НСтр("ru = 'Продажи'"));
	Если ЕстьПравоСоглашенияСКлиентами И ИспользоватьСоглашенияСКлиентами Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "СоглашенияСКлиентам", НСтр("ru = 'Соглашения с клиентами'"));
	КонецЕсли;
	Если ЕстьПравоЗаказыКлиентов И ИспользоватьЗаказыКлиентов И ЕстьПраваНаДоговора И ЕстьПравоРегистрРасчетыКлиентами  Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ЗаказыКлиентов", НСтр("ru = 'Заказы клиентов'"));
	КонецЕсли;
	Если ЕстьПравоЗаявкиНаВозврат И ИспользоватьЗаявкиНаВозвратТоваровОтКлиентов И ЕстьПравоРегистрЗаявкиНаВозврат И ЕстьПравоРегистрРасчетыКлиентами  Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ЗаявкиНаВозврат", НСтр("ru = 'Заявки на возврат'"));
	КонецЕсли;
	Если ИспользоватьУправлениеСделками И ЕстьПраваНаСделки Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "Сделки", НСтр("ru = 'Сделки'"));
	КонецЕсли;
	Если ЕстьПравоРеализацияТоваровУслуг И ЕстьПравоРегистрРасчетыКлиентами Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "РеализацииТоваровУслуг", НСтр("ru = 'Реализации товаров и услуг'"));
	КонецЕсли;
	Если ЕстьПравоОРасхожденияхПослеОтгрузки И ИспользоватьАктыРасхожденийПослеОтгрузки Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "АктыПриемкиКлиента", НСтр("ru = 'Акты о расхождениях после реализации'"));
	КонецЕсли;
	CRMЛокализация.ДополнитьДеревоСобытийОтчетКалендарьСобытий(УзелДерева);
	УдалитьРодительскийУзелДереваЕслиПустой(УзелДерева);

	Если ЕстьПраваНаВзаимодействия И ИспользоватьПочтовыйКлиент Тогда
		
		УзелДерева = ДобавленноеВДеревоВидСобытия(ВидыСобытий,"Взаимодействия", НСтр("ru = 'Взаимодействия'"));
		
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ВходящиеПисьма",НСтр("ru = 'Входящие письма'"));
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ИсходящиеПисьма", НСтр("ru = 'Исходящие письма'"));
		Если ИспользоватьПрочиеВзаимодействия Тогда
			ДобавленноеВДеревоВидСобытия(УзелДерева, "Встречи", НСтр("ru = 'Встречи'"));
			ДобавленноеВДеревоВидСобытия(УзелДерева, "ТелефонныеЗвонки", НСтр("ru = 'Телефонные звонки'"));
			ДобавленноеВДеревоВидСобытия(УзелДерева, "ЗапланированныеВзаимодействия",НСтр("ru = 'Запланированные взаимодействия'"));
		КонецЕсли;
		
		CRMЛокализация.ДополнитьДеревоСобытийОтчетКалендарьСобытий(УзелДерева);
		
	КонецЕсли;
	
	УзелДерева = ДобавленноеВДеревоВидСобытия(ВидыСобытий,"Закупки", НСтр("ru = 'Закупки'"));
	Если ЕстьПравоСоглашенияСПоставщиками И ИспользоватьСоглашенияСПоставщиками Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "СоглашенияСПоставщиками", НСтр("ru = 'Соглашения с поставщиками'"));
	КонецЕсли;
	Если ИспользоватьЗаказыПоставщикам И ЕстьПравоЗаказыПоставщику И ЕстьПраваНаДоговора И ЕстьПравоРегистрРасчетыПоставщиками Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ЗаказыПоставщикам", НСтр("ru = 'Заказы поставщикам'"));
	КонецЕсли;
	Если ЕстьПравоВозвратыПоставщику И ЕстьПравоРегистрТоварыКОтгрузке И ЕстьПравоРегистрРасчетыПоставщиками Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ВозвратыПоставщику", НСтр("ru = 'Возвраты товаров поставщику'"));
	КонецЕсли;
	Если ЕстьПравоДоверенностьПолучениеТоваров Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ДоверенностьПолучениеТоваров", НСтр("ru = 'Доверенности на получение товаров'"));
	КонецЕсли;
	CRMЛокализация.ДополнитьДеревоСобытийОтчетКалендарьСобытий(УзелДерева);
	УдалитьРодительскийУзелДереваЕслиПустой(УзелДерева);
	
	УзелДерева = ДобавленноеВДеревоВидСобытия(ВидыСобытий,"Финансы", НСтр("ru = 'Финансы'"));
	Если ЕстьПравоЗаявкаНаРасходованиеДС И ИспользоватьЗаявкиНаРасходованиеДенежныхСредств Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ЗаявкаНаРасходованиеДенежныхСредств", НСтр("ru = 'Заявки на расходование денежных средств'"));
	КонецЕсли;
	CRMЛокализация.ДополнитьДеревоСобытийОтчетКалендарьСобытий(УзелДерева);
	УдалитьРодительскийУзелДереваЕслиПустой(УзелДерева);
	
	УзелДерева = ДобавленноеВДеревоВидСобытия(ВидыСобытий,"ВнутреннееТовародвижение", НСтр("ru = 'Внутреннее товародвижение'"));
	Если ЕстьПравоЗаказВнутреннееПотребление И ИспользоватьЗаказыНаВнутреннееПотребление И ЕстьПравоРегистрВнутреннееПотребление Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ЗаказНаВнутреннееПотребление", НСтр("ru = 'Заказы на внутреннее потребление'"));
	КонецЕсли;
	Если ЕстьПравоВнутреннееПотребление И ИспользоватьВнутреннееПотребление Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ВнутреннееПотребление", НСтр("ru = 'Внутреннее потребление'"));
	КонецЕсли;
	CRMЛокализация.ДополнитьДеревоСобытийОтчетКалендарьСобытий(УзелДерева);
	УдалитьРодительскийУзелДереваЕслиПустой(УзелДерева);
	
	УзелДерева = ДобавленноеВДеревоВидСобытия(ВидыСобытий,"Прочее", НСтр("ru = 'Прочее'"));
	Если ЕстьПраваНаПартнеров И ЕстьПраваНаФизЛиц Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ДниРожденияКонтактныхЛиц", НСтр("ru = 'Дни рождения контактных лиц'"));
	КонецЕсли;
	Если ЕстьПравоСверкаВзаиморасчетов Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "СверкаВзаиморасчетов2_4", НСтр("ru = 'Сверки взаиморасчетов (2.4)'"));
	КонецЕсли;
	Если ЕстьПравоСверкаВзаиморасчетов2_5_11 Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "СверкаВзаиморасчетов2_5_11", НСтр("ru = 'Сверки взаиморасчетов'"));
	КонецЕсли;
	Если ЕстьПраваНаДоговора Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ДоговораКонтрагентов", НСтр("ru = 'Договоры контрагентов'"));
	КонецЕсли;
	Если ЕстьПраваНаПроекты Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "Проекты", НСтр("ru = 'Проекты'"));
	КонецЕсли;
	Если ИспользоватьБизнесПроцессыИЗадачи И ЕстьПравоЗадачаИсполнителя Тогда
		ДобавленноеВДеревоВидСобытия(УзелДерева, "ЗадачаИсполнителя", НСтр("ru = 'Прочие задачи исполнителя'"));
	КонецЕсли;
	CRMЛокализация.ДополнитьДеревоСобытийОтчетКалендарьСобытий(УзелДерева);
	УдалитьРодительскийУзелДереваЕслиПустой(УзелДерева);
	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьРодительскийУзелДереваЕслиПустой(УзелДерева)

	Если УзелДерева.ПолучитьЭлементы().Количество() = 0 Тогда
		ВидыСобытий.ПолучитьЭлементы().Удалить(УзелДерева);
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Функция ДобавленноеВДеревоВидСобытия(СтрокаРодитель, ВидСобытия, Представление)

	НоваяСтрока = СтрокаРодитель.ПолучитьЭлементы().Добавить();
	НоваяСтрока.ВидСобытия = ВидСобытия;
	НоваяСтрока.Представление = Представление;
	Возврат НоваяСтрока

КонецФункции

&НаКлиенте
Процедура УстановитьСостояниеОтчетНеСформирован()
	
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	Элементы.Результат.ОтображениеСостояния.Текст = НСтр("ru = 'Отчет не сформирован. Нажмите ""Сформировать"" для получения отчета.'");
	Элементы.Результат.ОтображениеСостояния.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьРасчетыОбновитьОтчет()
	
	Если Отчет.ЕстьНеактуальныеРасчетыСКлиентами ИЛИ Отчет.ЕстьНеактуальныеРасчетыСПоставщиками Тогда
		МассивАналитикДляАктуализации = АналитикаДляАктуализацииРасчетов();
	КонецЕсли;
	
	Если Отчет.ЕстьНеактуальныеРасчетыСКлиентами И МассивАналитикДляАктуализации.Количество() > 0 Тогда
		ОкончаниеРасчета = КонецМесяца(ТекущаяДатаСеанса()) + 1;
		АналитикиРасчета = РаспределениеВзаиморасчетовВызовСервера.АналитикиРасчета();
		АналитикиРасчета.АналитикиУчетаПоПартнерам = МассивАналитикДляАктуализации;
		РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСКлиентами(ОкончаниеРасчета, АналитикиРасчета);
		Отчет.ЕстьНеактуальныеРасчетыСКлиентами = Ложь;
	КонецЕсли;
	
	Если Отчет.ЕстьНеактуальныеРасчетыСПоставщиками И МассивАналитикДляАктуализации.Количество() > 0 Тогда
		ОкончаниеРасчета = КонецМесяца(ТекущаяДатаСеанса()) + 1;
		АналитикиРасчета = РаспределениеВзаиморасчетовВызовСервера.АналитикиРасчета();
		АналитикиРасчета.АналитикиУчетаПоПартнерам = МассивАналитикДляАктуализации;
		РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСПоставщиками(ОкончаниеРасчета, АналитикиРасчета);
		Отчет.ЕстьНеактуальныеРасчетыСПоставщиками = Ложь;
	КонецЕсли;
	
	СформироватьОтчетСервер();
	
КонецПроцедуры

&НаСервере
Функция АналитикаДляАктуализацииРасчетов()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	АналитикаУчетаПоПартнерам.КлючАналитики
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ГДЕ
	|	АналитикаУчетаПоПартнерам.Партнер В(&МассивПартнеров)";
	
	Запрос.УстановитьПараметр("МассивПартнеров", Отчет.ПартнерыНеактуальныеРасчеты.ВыгрузитьЗначения());
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КлючАналитики");
	
КонецФункции

&НаКлиенте
Процедура УправлениеДоступностью()

	Элементы.АктуализироватьРасчеты.Доступность = Отчет.ЕстьНеактуальныеРасчетыСКлиентами ИЛИ Отчет.ЕстьНеактуальныеРасчетыСПоставщиками;

КонецПроцедуры

#КонецОбласти
