#Область ПрограммныйИнтерфейс

//Выполняет дополнение и кэширование параметров механизма в реквизит формы, обновляет тексты гиперссылок
//и устанавливает видимость команды "Зачет оплаты" для новых документов.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения, РасширениеУправляемойФормыДляДокумента, РасширениеФормыЭлементаСправочника - Форма документа/справочника.
// 
Процедура ФормаПриСозданииНаСервере(Форма) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,"КэшДанныхМеханизмов")
		И Форма.КэшДанныхМеханизмов.Свойство("Взаиморасчеты") Тогда
		ПараметрыМеханизма = Форма.КэшДанныхМеханизмов.Взаиморасчеты.МассивПараметров;
	Иначе
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Форма.ИмяФормы);
		ПараметрыМеханизма = МенеджерОбъекта.ПараметрыВзаиморасчеты(Форма.Объект);
	
		ДополнитьИЗакэшироватьПараметры(Форма, ПараметрыМеханизма);
	КонецЕсли;
	
	УстановитьУсловноеОформление(Форма);
	
	Объект = Форма.Объект; //ДанныеФормыСтруктура
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Форма.ТолькоПросмотр Тогда
			Возврат;
		КонецЕсли;
		Если ТипЗнч(ПараметрыМеханизма) = Тип("Массив") Тогда
			МассивПараметров = ПараметрыМеханизма;
		Иначе
			МассивПараметров = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыМеханизма);
		КонецЕсли;
		Для Каждого СтруктураПараметров Из МассивПараметров Цикл
			Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты)
				И СтруктураПараметров.ЭтоЗаказ
				И НЕ ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ОтгружатьОднойДатой) Тогда
				ТабличнаяЧасть = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
				ТаблицаЭтаповОплаты = ТабличнаяЧасть.Выгрузить();
				ТаблицаЭтаповОплаты.Очистить();
				ЭтапыОплатыСервер.ПроверитьЗаполнитьЭтапыГрафикаОплаты(Форма, СтруктураПараметров, ТаблицаЭтаповОплаты);
				СтруктураПараметров.ЕстьРучныеИзмененияГрафикаОплат = Не ВзаиморасчетыСлужебный.ТаблицыРавны(ТаблицаЭтаповОплаты, ТабличнаяЧасть.Выгрузить());
			КонецЕсли;
		КонецЦикла;
		Возврат;
	Иначе
		ФормаПриЧтенииСозданииНаСервере(Форма, ПараметрыМеханизма)
	КонецЕсли;
	
	ЗаблокироватьОбъектыРасчетов(Форма);
	
КонецПроцедуры

//Выполняет кэширование параметров механизма в реквизит формы, обновляет тексты гиперссылок
//и устанавливает видимость команды "Зачет оплаты" для существующих документов.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения, РасширениеУправляемойФормыДляДокумента, РасширениеФормыЭлементаСправочника - Форма документа/справочника.
// 
Процедура ФормаПриЧтенииНаСервере(Форма) Экспорт
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Форма.ИмяФормы);
	ПараметрыМеханизма = МенеджерОбъекта.ПараметрыВзаиморасчеты(Форма.Объект);
	
	ДополнитьИЗакэшироватьПараметры(Форма, ПараметрыМеханизма);
	
	ФормаПриЧтенииСозданииНаСервере(Форма, ПараметрыМеханизма)
	
КонецПроцедуры

//Обновляет тексты гиперссылок после записи и устанавливает значения параметров механизма Взаиморасчеты по оповещению
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа/справочника.
// 	ДополнительныеСвойства - Структура - Дополнительные свойства записаннного объекта
// 
Процедура ФормаПослеЗаписиНаСервере(Форма, ДополнительныеСвойства = Неопределено) Экспорт
	
	ВзаиморасчетыВызовСервера.ОбновитьТекстГиперссылкиОграничениеЗадолженности(Форма);
	ОбновитьТекстГиперссылкиСостояниеРасчетов(Форма);
	ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(Форма);
	ОбновитьТекстГиперссылкиЭтапыОплаты(Форма);
	ОбновитьРаспределеннуюСуммаРасшифровки(Форма);
	Если ДополнительныеСвойства <> Неопределено Тогда
		ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
		Если ДополнительныеСвойства.Свойство("ОповеститьОЗаполненииЭтапов") Тогда
			ДополненныеПараметрыМеханизма.ОповеститьОЗаполненииЭтапов = ДополнительныеСвойства.ОповеститьОЗаполненииЭтапов;
		КонецЕсли;
		Если ДополнительныеСвойства.Свойство("ОповеститьОбИзмененииОбъектаРасчетов") Тогда 
			ДополненныеПараметрыМеханизма.ОповеститьОбИзмененииОбъектаРасчетов = ДополнительныеСвойства.ОповеститьОбИзмененииОбъектаРасчетов;
			ДополненныеПараметрыМеханизма.ИзмененныйОбъектРасчетов = ДополнительныеСвойства.ИзмененныйОбъектРасчетов;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Выполняет необходимые действия при изменении ключевых реквизитов документа/справочника.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа/справочника.
//	ИзмененныеРеквизиты - Массив из Строка - Перечень имен измененных реквизитов в терминах документа.
//						- Структура - Перечень имен измененных реквизитов в терминах документа, анализируются только ключи (имена реквизитов) структуры.
//						- Строка - Имя измененного реквизита.
// 	ЭтоИзмененияМеханизма - Булево - Флаг того, что вызов производит сам механизм.
// 
// Возвращаемое значение:
// 	Структура - Структура измененных реквизитов документа после обработки, где Ключ - Имя реквизита, Значение - значение реквизита до изменения.
//
Функция ФормаПриИзмененииРеквизитов(Форма, ИзмененныеРеквизиты, ЭтоИзмененияМеханизма = Ложь) Экспорт
	
	Если ТипЗнч(ИзмененныеРеквизиты) = Тип("Массив") Тогда
		МассивРеквизитов = ИзмененныеРеквизиты;
	ИначеЕсли ТипЗнч(ИзмененныеРеквизиты) = Тип("Структура") Тогда
		МассивРеквизитов = Новый Массив;
		Для Каждого Элемент Из ИзмененныеРеквизиты Цикл
			МассивРеквизитов.Добавить(Элемент.Ключ);
		КонецЦикла;
	Иначе //строка
		МассивРеквизитов = Новый Массив;
		Реквизиты = СтрРазделить(ИзмененныеРеквизиты, ",");
		Для Каждого Реквизит Из Реквизиты Цикл
			МассивРеквизитов.Добавить(СокрЛП(Реквизит));
		КонецЦикла;
	КонецЕсли;
	
	СтарыеЗначенияИзмененныхРеквизитов = Новый Структура;
	ЕстьИзмененияВалют = Ложь;
	ИзмененКурсВалюты = Ложь;
	
	ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	
	//Если изменился параметр, влияющий на параметры механизма конкретного объекта, то их нужно перекэшировать.
	НужноПерекэшироватьПараметры = Ложь;
	Для Каждого СтруктураПараметров Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
		МассивВлияющихРеквизитов = СтрРазделить(СтруктураПараметров.ВлияющиеРеквизиты,",");
		Для Каждого ВлияющийРеквизит Из МассивВлияющихРеквизитов Цикл
			Если МассивРеквизитов.Найти(СокрЛП(ВлияющийРеквизит)) <> Неопределено Тогда
				НужноПерекэшироватьПараметры = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если НужноПерекэшироватьПараметры Тогда
		ПриИзмененииПараметровМеханизма(Форма);
		ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	КонецЕсли;
	
	СистемныеНастройки = ДополненныеПараметрыМеханизма.СистемныеНастройки;
	
	//Возвращает какие из измененных реквизитов используются в структурах параметров.
	Результаты = МассивСтруктурПараметровПоРеквизитам(ДополненныеПараметрыМеханизма.МассивПараметров, МассивРеквизитов);
	
	Для Каждого Результат Из Результаты Цикл
		
		СтруктураПараметров = Результат.СтруктураПараметров;
		МассивИспользуемыхРеквизитов = Результат.ИспользуемыеРеквизиты;
		
		ОбновитьТекстГиперссылкиОграничениеЗадолженности = Ложь;
		ОбновитьТекстГиперссылкиСостояниеРасчетов = Ложь;
		ОбновитьТекстГиперссылкиЭтапыОплаты = Ложь;
		УстановитьВидимостьЗачетОплаты = Ложь;
		УстановитьВидимостьГФУ = Ложь;
		ИзменилсяГрафикИсполнения = Ложь;
		
		//График исполнения договора
		Если МассивИспользуемыхРеквизитов.Найти("Договор") <> Неопределено Тогда
			
			ОбновитьТекстГиперссылкиОграничениеЗадолженности = Истина;
			
			Договор = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма.Объект, СтруктураПараметров.Договор);
			Если ЗначениеЗаполнено(Договор) Тогда
				Если ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
					УстановитьПривилегированныйРежим(Истина);
					РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ЗаданГрафикИсполнения, ГрафикИсполненияДоговора, ВариантКурсаДоговора, Организация, Контрагент");
					УстановитьПривилегированныйРежим(Ложь);
					ЗаданГрафикИсполнения = РеквизитыДоговора.ЗаданГрафикИсполнения;
					СтруктураПараметров.ГрафикИсполненияДоговора = РеквизитыДоговора.ГрафикИсполненияДоговора;
					СтруктураПараметров.ОрганизацияДоговора      = РеквизитыДоговора.Организация;
					СтруктураПараметров.КонтрагентДоговора       = РеквизитыДоговора.Контрагент;
					СтруктураПараметров.ВариантКурсаДоговора     = РеквизитыДоговора.ВариантКурсаДоговора;
				Иначе
					ЗаданГрафикИсполнения = Ложь;
					СтруктураПараметров.ГрафикИсполненияДоговора = Неопределено;
					УстановитьПривилегированныйРежим(Истина);
					СтруктураПараметров.ВариантКурсаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВариантКурсаДоговора");
					УстановитьПривилегированныйРежим(Ложь);
					СтруктураПараметров.ОрганизацияДоговора  = Справочники.Организации.ПустаяСсылка();
					СтруктураПараметров.КонтрагентДоговора   = Справочники.Контрагенты.ПустаяСсылка();
				КонецЕсли;
			Иначе
				ЗаданГрафикИсполнения = Ложь;
				СтруктураПараметров.ГрафикИсполненияДоговора = Неопределено;
				СтруктураПараметров.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.Переменный;
				СтруктураПараметров.ОрганизацияДоговора  = Справочники.Организации.ПустаяСсылка();
				СтруктураПараметров.КонтрагентДоговора   = Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;
			
			Если СтруктураПараметров.ЗаданГрафикИсполнения <> ЗаданГрафикИсполнения Тогда
				ИзменилсяГрафикИсполнения = Истина;
			КонецЕсли;
			
			СтруктураПараметров.ЗаданГрафикИсполнения = ЗаданГрафикИсполнения;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ЗаданГрафикИсполнения") Тогда
				Форма.ЗаданГрафикИсполнения = ЗаданГрафикИсполнения;
			КонецЕсли; 
			
		КонецЕсли;
		
		Если МассивИспользуемыхРеквизитов.Найти("Соглашение") <> Неопределено Тогда
			Соглашение = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Соглашение);
			Если ЗначениеЗаполнено(Соглашение) Тогда
				РеквизитыСоглашения = ВзаиморасчетыСлужебный.РеквизитыСоглашения(Соглашение);
				СтруктураПараметров.Календарь                      = РеквизитыСоглашения.Календарь;
				СтруктураПараметров.СрокПереходаПраваСобственности = РеквизитыСоглашения.СрокПереходаПраваСобственности;
				Если СтруктураПараметров.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
					ГрафикОплаты = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.ГрафикОплаты);
					Если ГрафикОплаты <> Неопределено И ГрафикОплаты.Данные[ГрафикОплаты.Имя] <> РеквизитыСоглашения.ГрафикОплаты Тогда
						СтарыеЗначенияИзмененныхРеквизитов.Вставить(ГрафикОплаты.Имя, ГрафикОплаты.Данные[ГрафикОплаты.Имя]);
						ГрафикОплаты.Данные[ГрафикОплаты.Имя] = РеквизитыСоглашения.ГрафикОплаты;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		//Порядок расчетов
		Если (МассивИспользуемыхРеквизитов.Найти("Соглашение") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("Договор") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("ДоговорКомиссионера") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("НакладнаяПоЗаказам") <> Неопределено)
			И ЗначениеЗаполнено(СтруктураПараметров.ПорядокРасчетов)
			И ТипЗнч(СтруктураПараметров.ПорядокРасчетов) = Тип("Строка") 
			И СтрЧислоВхождений(СтруктураПараметров.ПорядокРасчетов, ".") = 1 Тогда
			
			ПорядокРасчетовПоУмолчанию = ВзаиморасчетыСлужебный.ПорядокРасчетовПоПараметрам(Форма, СтруктураПараметров);
			ПорядокРасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.ПорядокРасчетов);
			
			Если ПорядокРасчетов.Данные[ПорядокРасчетов.Имя]<> ПорядокРасчетовПоУмолчанию 
				ИЛИ ИзменилсяГрафикИсполнения Тогда
				СтарыеЗначенияИзмененныхРеквизитов.Вставить(ПорядокРасчетов.Имя, ПорядокРасчетов.Данные[ПорядокРасчетов.Имя]);
				ПорядокРасчетов.Данные[ПорядокРасчетов.Имя] = ПорядокРасчетовПоУмолчанию;
				
				Если МассивИспользуемыхРеквизитов.Найти("ПорядокРасчетов") = Неопределено Тогда
					МассивИспользуемыхРеквизитов.Добавить("ПорядокРасчетов");
				КонецЕсли;
				
				ОбновитьТекстГиперссылкиСостояниеРасчетов = Истина;
				ОбновитьТекстГиперссылкиЭтапыОплаты = Истина;
				УстановитьВидимостьЗачетОплаты = Истина;
			КонецЕсли;
			
			УстановитьВидимостьГФУ = Истина;
			
		КонецЕсли;
		
		// Курс валюты договора и дата курса валюты документа
		Если МассивИспользуемыхРеквизитов.Найти("Договор") <> Неопределено Тогда
			Если СтруктураПараметров.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.УстановленныйВДоговоре Тогда
				ИзмененКурсВалюты = Истина;
			КонецЕсли;
			Если СтруктураПараметров.ВариантКурсаДоговора <> Перечисления.ВариантыКурсаДоговора.Переменный 
				И ЗначениеЗаполнено(СтруктураПараметров.ДатаКурсаВалютыДокумента) Тогда
				ДатаКурсаВалютыДокумента = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.ДатаКурсаВалютыДокумента);
				Если ЗначениеЗаполнено(ДатаКурсаВалютыДокумента.Данные[ДатаКурсаВалютыДокумента.Имя]) Тогда
					ДатаКурсаВалютыДокумента.Данные[ДатаКурсаВалютыДокумента.Имя] = Дата(1, 1, 1);
					ИзмененКурсВалюты = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//ГФУ
		Если (МассивИспользуемыхРеквизитов.Найти("Договор") <> Неопределено
				ИЛИ МассивИспользуемыхРеквизитов.Найти("ДоговорКомиссионера") <> Неопределено
				ИЛИ МассивИспользуемыхРеквизитов.Найти("Соглашение") <> Неопределено)
			И ЗначениеЗаполнено(СтруктураПараметров.ГруппаФинансовогоУчета) Тогда
			
			ГФУПоУмолчанию = ВзаиморасчетыСлужебный.ГФУПоУмолчанию(Форма, СтруктураПараметров, СистемныеНастройки);
			
			ГФУРеквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма,СтруктураПараметров.ГруппаФинансовогоУчета);
			Если ГФУРеквизит <> Неопределено И НЕ ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ГФУРеквизит.Данные)) Тогда
				ГФУРеквизит.Данные[ГФУРеквизит.Имя] = ГФУПоУмолчанию;
			КонецЕсли;
			
		КонецЕсли;
		
		Если МассивИспользуемыхРеквизитов.Найти("НакладнаяПоЗаказам") <> Неопределено Тогда
			УстановитьВидимостьЗачетОплаты = Истина;
			УстановитьВидимостьГФУ = Истина;
			ОчиститьРасшифровкуПлатежа(Форма, СтруктураПараметров);
		КонецЕсли;
		
		//Оплата в валюте
		Если МассивИспользуемыхРеквизитов.Найти("Договор") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("ДоговорКомиссионера") <> Неопределено Тогда
			
			ОплатаВВалютеПоУмолчанию = ВзаиморасчетыСлужебный.ОплатаВВалютеПоУмолчанию(Форма, СтруктураПараметров);
			ОплатаВВалюте = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.ОплатаВВалюте);
			
			Если ОплатаВВалюте <> Неопределено И ОплатаВВалюте.Данные[ОплатаВВалюте.Имя]<> ОплатаВВалютеПоУмолчанию Тогда
				СтарыеЗначенияИзмененныхРеквизитов.Вставить(ОплатаВВалюте.Имя, ОплатаВВалюте.Данные);
				ОплатаВВалюте.Данные[ОплатаВВалюте.Имя] = ОплатаВВалютеПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
		
		//График оплаты
		Если МассивИспользуемыхРеквизитов.Найти("Соглашение") <> Неопределено Или ИзменилсяГрафикИсполнения Тогда
			//Очистка графика этапов оплаты
			Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) Тогда
				ВзаиморасчетыСлужебный.ОчиститьЭтапыГрафикаОплаты(Форма, СтруктураПараметров);
			ИначеЕсли ЗначениеЗаполнено(СтруктураПараметров.ДатаПлатежа) Тогда
				Реквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.ДатаПлатежа);
				Реквизит.Данные[Реквизит.Имя] = Дата(1,1,1);
			КонецЕсли;
			ОбновитьТекстГиперссылкиЭтапыОплаты = Истина;
		ИначеЕсли МассивИспользуемыхРеквизитов.Найти("Дата") <> Неопределено 
			И ЗначениеЗаполнено(СтруктураПараметров.ДатаПлатежа) 
			И ЗначениеЗаполнено(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ДатаПлатежа))Тогда
			ПараметрыРасчетаДатыПлатежа = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
			ПараметрыРасчетаДатыПлатежа.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки");
			ПараметрыРасчетаДатыПлатежа.ДатаОтгрузки   = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Дата);
			ПараметрыРасчетаДатыПлатежа.ДатаПлатежа    = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ДатаПлатежа);
			ПараметрыРасчетаДатыПлатежа.Календарь      = СтруктураПараметров.Календарь;
			Если ЗначениеЗаполнено(СтруктураПараметров.Календарь) Тогда
				ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(ПараметрыРасчетаДатыПлатежа);
			Иначе
				ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаБезКалендаря(ПараметрыРасчетаДатыПлатежа);
			КонецЕсли;
			Реквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.ДатаПлатежа);
			Реквизит.Данные[Реквизит.Имя] = ДатаПлатежа;
			ОбновитьТекстГиперссылкиЭтапыОплаты = Истина;
		ИначеЕсли ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты)
			И (МассивИспользуемыхРеквизитов.Найти("Дата") <> Неопределено
				ИЛИ МассивИспользуемыхРеквизитов.Найти("ДатаОтгрузки") <> Неопределено
				ИЛИ МассивИспользуемыхРеквизитов.Найти("ДатаПоступления") <> Неопределено
				ИЛИ МассивИспользуемыхРеквизитов.Найти("ДатаСогласования") <> Неопределено
				ИЛИ МассивИспользуемыхРеквизитов.Найти("ОтгружатьОднойДатой") <> Неопределено) Тогда
				
				ОбновитьТекстГиперссылкиЭтапыОплаты = ОбновитьТекстГиперссылкиЭтапыОплаты 
					ИЛИ ЭтапыОплатыСервер.ПересчитатьДатыПлатежаЭтаповОплаты(Форма, СтруктураПараметров, МассивИспользуемыхРеквизитов);
				
		КонецЕсли;
		
		Если МассивИспользуемыхРеквизитов.Найти("Организация") <> Неопределено
			И СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент Тогда
			
			МассивОбъектовРасчетов = ДоступныеПоОрганизацииОбъектыРасчетов(Форма, СтруктураПараметров);
			ОчиститьОбъектИСуммуРасшифровкиПлатежа(Форма, СтруктураПараметров, МассивОбъектовРасчетов);
			
		ИначеЕсли МассивИспользуемыхРеквизитов.Найти("Организация") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("Соглашение") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("Партнер") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("Контрагент") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("НаправлениеДеятельности") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("Договор") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("ВалютаВзаиморасчетов") <> Неопределено Тогда
			
			ОчиститьОбъектИСуммуРасшифровкиПлатежа(Форма, СтруктураПараметров);
			
		КонецЕсли;
		
		Если МассивИспользуемыхРеквизитов.Найти("Организация") <> Неопределено Тогда
			
			Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма.Объект, СтруктураПараметров.Организация);
			ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
			
			Если ЗначениеЗаполнено(СтруктураПараметров.ВалютаДокумента) 
				И Не ЗначениеЗаполнено(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма.Объект, СтруктураПараметров.ВалютаДокумента)) Тогда
				Реквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.ВалютаДокумента);
				Реквизит.Данные[Реквизит.Имя] = ВалютаРегламентированногоУчета;
				ЕстьИзмененияВалют = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтруктураПараметров.ВалютаВзаиморасчетов)
				И Не СтруктураПараметров.ВалютаВзаиморасчетовВСтроках
				И Не ЗначениеЗаполнено(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма.Объект, СтруктураПараметров.ВалютаВзаиморасчетов)) Тогда
				Реквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.ВалютаВзаиморасчетов);
				Реквизит.Данные[Реквизит.Имя] = ВалютаРегламентированногоУчета;
				ЕстьИзмененияВалют = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если (МассивИспользуемыхРеквизитов.Найти("Организация") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("Контрагент") <> Неопределено)
			И СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент
			И ЗначениеЗаполнено(СтруктураПараметров.Договор) 
			И (ТипЗнч(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма.Объект, СтруктураПараметров.Договор)) <> Тип("СправочникСсылка.ДоговорыКонтрагентов")
				ИЛИ СтруктураПараметров.ОрганизацияДоговора <> ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма.Объект, СтруктураПараметров.Организация)
				ИЛИ СтруктураПараметров.КонтрагентДоговора <> ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма.Объект, СтруктураПараметров.Контрагент)) Тогда
			
			Реквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.Договор);
			Реквизит.Данные[Реквизит.Имя] = Неопределено;
			
			Если МассивИспользуемыхРеквизитов.Найти("Договор") = Неопределено Тогда
				МассивИспользуемыхРеквизитов.Добавить("Договор");
			КонецЕсли;
			
		КонецЕсли;
		
		Если МассивИспользуемыхРеквизитов.Найти("ВалютаДокумента") <> Неопределено 
			ИЛИ МассивИспользуемыхРеквизитов.Найти("ВалютаВзаиморасчетов") <> Неопределено 
			ИЛИ МассивИспользуемыхРеквизитов.Найти("СуммаДокумента") <> Неопределено 
			ИЛИ МассивИспользуемыхРеквизитов.Найти("СуммаВзаиморасчетов") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("ДатаКурсаВалютыДокумента") <> Неопределено Тогда
			
			МассивОчищаемыхПолейЭтапов = Новый Массив;
			Если МассивИспользуемыхРеквизитов.Найти("ВалютаДокумента") <> Неопределено
				ИЛИ МассивИспользуемыхРеквизитов.Найти("СуммаДокумента") <> Неопределено Тогда
				МассивОчищаемыхПолейЭтапов.Добавить("СуммаПлатежа");
				МассивОчищаемыхПолейЭтапов.Добавить("СуммаЗалогаЗаТару");
				МассивОчищаемыхПолейЭтапов.Добавить("СуммаВзаиморасчетов");
				МассивОчищаемыхПолейЭтапов.Добавить("СуммаВзаиморасчетовПоТаре");
			ИначеЕсли МассивИспользуемыхРеквизитов.Найти("ВалютаВзаиморасчетов") <> Неопределено 
				ИЛИ МассивИспользуемыхРеквизитов.Найти("СуммаВзаиморасчетов") <> Неопределено Тогда
				МассивОчищаемыхПолейЭтапов.Добавить("СуммаВзаиморасчетов");
				МассивОчищаемыхПолейЭтапов.Добавить("СуммаВзаиморасчетовПоТаре");
			КонецЕсли;
			
			ОчиститьПоляЭтаповГрафикаОплаты(Форма, СтруктураПараметров, МассивОчищаемыхПолейЭтапов);
			ВзаиморасчетыСлужебный.ОчиститьСуммыВзаиморасчетовТЧ(Форма, СтруктураПараметров);
			
			Если НЕ ЭтоИзмененияМеханизма И ЗначениеЗаполнено(СтруктураПараметров.СуммаВзаиморасчетов) Тогда
				Реквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.СуммаВзаиморасчетов);
				Реквизит.Данные[Реквизит.Имя] = 0;
			КонецЕсли;
			
			ВзаиморасчетыСервер.ПроверитьЗаполнитьСуммыВзаиморасчетовВТабличнойЧасти(Форма, СтруктураПараметров);
			ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(Форма,СтруктураПараметров);
			
		КонецЕсли;
		
		Если МассивИспользуемыхРеквизитов.Найти("ДатаПлатежа") <> Неопределено Тогда
			ОбновитьТекстГиперссылкиЭтапыОплаты = Истина;
		КонецЕсли;
		
		Если МассивИспользуемыхРеквизитов.Найти("ВалютаДокумента") <> Неопределено
			ИЛИ МассивИспользуемыхРеквизитов.Найти("ВалютаВзаиморасчетов") <> Неопределено Тогда
			ЕстьИзмененияВалют = Истина;
		КонецЕсли;
		
		Если МассивИспользуемыхРеквизитов.Найти("ПорядокРасчетов") <> Неопределено Тогда
			// Необходимо очистить объекты расчетов для корректного определения состояния расчетов
			ВзаиморасчетыСлужебный.ОчиститьОбъектРасчетов(Форма, СтруктураПараметров);
			ВзаиморасчетыСлужебный.ОчиститьЭтапыГрафикаОплаты(Форма, СтруктураПараметров);
			ОбновитьТекстГиперссылкиЭтапыОплаты = Истина;
		КонецЕсли;
		
		Если МассивИспользуемыхРеквизитов.Найти("ПорядокРасчетов") <> Неопределено 
			ИЛИ МассивИспользуемыхРеквизитов.Найти("ВалютаВзаиморасчетов") <> Неопределено Тогда
			ОчиститьРасшифровкуПлатежа(Форма, СтруктураПараметров);
			УстановитьВидимостьЗачетОплаты = Истина;
			ОбновитьТекстГиперссылкиСостояниеРасчетов = Истина;
		КонецЕсли;
		
		Если МассивИспользуемыхРеквизитов.Найти("КурсЧислитель") <> Неопределено 
			ИЛИ МассивИспользуемыхРеквизитов.Найти("КурсЗнаменатель") <> Неопределено Тогда
			ИзмененКурсВалюты = Истина;
		КонецЕсли;
		
		Если ОбновитьТекстГиперссылкиОграничениеЗадолженности Тогда
			ВзаиморасчетыВызовСервера.ОбновитьТекстГиперссылкиОграничениеЗадолженности(Форма);
		КонецЕсли;
		
		Если ОбновитьТекстГиперссылкиСостояниеРасчетов Тогда
			ОбновитьТекстГиперссылкиСостояниеРасчетов(Форма);
		КонецЕсли;
		
		Если ОбновитьТекстГиперссылкиЭтапыОплаты Тогда
			ОбновитьТекстГиперссылкиЭтапыОплаты(Форма, СтруктураПараметров, СистемныеНастройки);
		КонецЕсли;
		
		Если УстановитьВидимостьЗачетОплаты Тогда
			УстановитьВидимостьЗачетОплаты(Форма, СтруктураПараметров);
		КонецЕсли;
		
		Если УстановитьВидимостьГФУ Тогда
			УстановитьВидимостьГФУ(Форма, СтруктураПараметров);
		КонецЕсли;
		
		Если МассивИспользуемыхРеквизитов.Найти("Организация") <> Неопределено
			Или МассивИспользуемыхРеквизитов.Найти("НакладнаяПоЗаказам") <> Неопределено
			Или МассивИспользуемыхРеквизитов.Найти("Партнер") <> Неопределено
			Или МассивИспользуемыхРеквизитов.Найти("Контрагент") <> Неопределено
			Или МассивИспользуемыхРеквизитов.Найти("Договор") <> Неопределено
			Или МассивИспользуемыхРеквизитов.Найти("Соглашение") <> Неопределено
			Или МассивИспользуемыхРеквизитов.Найти("ДоговорКомиссионера") <> Неопределено Тогда
			УстановитьВозможностьРедактированияНД(Форма, СтруктураПараметров);
		КонецЕсли;
		
		//При изменении порядка расчетов проверить видимость ЗачетОплаты
		//При изменении суммы документа на форме, переформировывать надпись валюты, все гиперссылки
		//При изменении даты, даты банка, проведено банком, очистить суммы взаиморасчетов расшифровки
	КонецЦикла;
	
	Если НЕ ЭтоИзмененияМеханизма И ЕстьИзмененияВалют И ЗначениеЗаполнено(СтруктураПараметров.КурсЧислитель) Тогда
		СтарыеЗначенияИзмененныхРеквизитов.Вставить("КурсЧислитель", ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.КурсЧислитель));
		СтарыеЗначенияИзмененныхРеквизитов.Вставить("КурсЗнаменатель", ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.КурсЗнаменатель));
		ВзаиморасчетыСлужебный.ЗаполнитьКурсКратностьПоУмолчанию(Форма, ДополненныеПараметрыМеханизма);
		ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(Форма,СтруктураПараметров);
	ИначеЕсли ИзмененКурсВалюты Тогда
		ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(Форма,СтруктураПараметров);
	КонецЕсли;
	
	ОбщегоНазначенияУТ.СохранитьДанныеМеханизмаВКэшФормы(Форма, "Взаиморасчеты", ДополненныеПараметрыМеханизма);
	
	Возврат СтарыеЗначенияИзмененныхРеквизитов;
	
КонецФункции

//Обновляет тексты гиперссылок, видимость команды "Зачет оплаты".
//Очищает все реквизиты взаиморасчетов, если документ более не изменяет взаиморасчеты.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа/справочника.
// 
Процедура ПриИзмененииПараметровМеханизма(Форма) Экспорт
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Форма.ИмяФормы);
	ПараметрыМеханизмаНовые = МенеджерОбъекта.ПараметрыВзаиморасчеты(Форма.Объект);
	ДанныеНастройки = ВзаиморасчетыСервер.ДополненныеПараметрыМеханизма(Форма, ПараметрыМеханизмаНовые);
	
	МассивПараметров = Форма.КэшДанныхМеханизмов["Взаиморасчеты"].МассивПараметров;
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		Если МассивПараметров.Количество() <> ДанныеНастройки.МассивПараметров.Количество()
			ИЛИ СтруктураПараметров.ТипРасчетов <> ДанныеНастройки.МассивПараметров[МассивПараметров.Найти(СтруктураПараметров)].ТипРасчетов Тогда
			ОчиститьРасшифровкуПлатежа(Форма, СтруктураПараметров);
			ВзаиморасчетыСлужебный.ОчиститьОбъектРасчетов(Форма,СтруктураПараметров);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтруктураПараметров Из ДанныеНастройки.МассивПараметров Цикл
		
		// Очищаем все сущности механизма, если нет расчетов с клиентами или поставщиками.
		Если НЕ СтруктураПараметров.ИзменяетРасчеты Тогда
			
			СуммаВзаиморасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.СуммаВзаиморасчетов);
			Если ЗначениеЗаполнено(СуммаВзаиморасчетов) Тогда
				СуммаВзаиморасчетов.Данные[СуммаВзаиморасчетов.Имя] = 0;
			КонецЕсли;
			
			СуммаВзаиморасчетовПоТаре = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.СуммаВзаиморасчетовПоТаре);
			Если ЗначениеЗаполнено(СуммаВзаиморасчетовПоТаре) Тогда
				СуммаВзаиморасчетовПоТаре.Данные[СуммаВзаиморасчетовПоТаре.Имя] = 0;
			КонецЕсли;
			
			ВзаиморасчетыСлужебный.ОчиститьСуммыВзаиморасчетовТЧ(Форма, СтруктураПараметров);
			
		КонецЕсли;
		
		Если НЕ СтруктураПараметров.ИзменяетПланОплаты
			// Возвраты товаров.
			ИЛИ ЗначениеЗаполнено(СтруктураПараметров.ЭлементыФормы.ГиперссылкаРасшифровкаПлатежа)
			ИЛИ СтруктураПараметров.УдержатьВознаграждение Тогда
			Если НЕ СтруктураПараметров.ЗаказКакСчет
				ИЛИ СтруктураПараметров.УдержатьВознаграждение Тогда
				ВзаиморасчетыСлужебный.ОчиститьЭтапыГрафикаОплаты(Форма, СтруктураПараметров);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияУТ.СохранитьДанныеМеханизмаВКэшФормы(Форма, "Взаиморасчеты", ДанныеНастройки);
	
	УстановитьВидимостьЗачетОплаты(Форма);
	УстановитьВидимостьГФУ(Форма);
	УстановитьВозможностьРедактированияНД(Форма);
	ВзаиморасчетыВызовСервера.ОбновитьТекстГиперссылкиОграничениеЗадолженности(Форма);
	ОбновитьТекстГиперссылкиЭтапыОплаты(Форма);
	ОбновитьТекстГиперссылкиСостояниеРасчетов(Форма);
	ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(Форма);
	
КонецПроцедуры

// Используется для обработке оповещений, связанных с механизмами взаиморасчетов.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения
// 	 * Объект - ДанныеФормы
// 	  ** Ссылка - ДокументСсылка, СправочникСсылка
// 	ИмяСобытия - Строка - Имя события.
// 	Параметр - Произвольный - Параметр события.
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр) Экспорт
	
	ОбъектФормы = Форма.Объект; //ДокументОбъект
	
	Если (ИмяСобытия = "ЗачтенаОплата" И Параметр = ОбъектФормы.Ссылка) 
		Или ИзменилисьДокументыОплатыКлиентам(ИмяСобытия)
		Или ИзменилисьДокументыОплатыПоставщиком(ИмяСобытия) Тогда
		ВзаиморасчетыВызовСервера.ОбновитьТекстГиперссылкиОграничениеЗадолженности(Форма);
		ВзаиморасчетыРаботаСФормами.ОбновитьТекстГиперссылкиСостояниеРасчетов(Форма);
		
		Параметры = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
		Для Каждого Структура Из Параметры.МассивПараметров Цикл
			Структура.АдресРасшифровкаПлатежа = "";
		КонецЦикла;
		Если НЕ Форма.Модифицированность Тогда
			Форма.Прочитать();
		КонецЕсли;
		
	КонецЕсли;
	
	//Обновить ограничение задолженности
	
КонецПроцедуры

//Помещает табличную часть Расшифровка платежа во временное хранилище и записывает ссылку на него в структуру параметров взаиморасчетов.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа/справочника.
// 	ИмяЭлемента - Строка - Имя элемента, по которому можно определить для какой структуры параметров взаиморасчетов помещается расшифровка.
//
Процедура ПоместитьРасшифровкуПлатежаВоВременноеХранилище(Форма, ИмяЭлемента = Неопределено) Экспорт
	
	ПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	Если ИмяЭлемента <> Неопределено Тогда
		СтруктураПараметров = ВзаиморасчетыКлиентСервер.СтруктураПараметровПоИмениЭлемента(ПараметрыМеханизма.МассивПараметров, ИмяЭлемента);
	Иначе
		СтруктураПараметров = ПараметрыМеханизма.МассивПараметров[0];
	КонецЕсли;
	
	РасшифровкаПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа);
	ТЗ = РасшифровкаПлатежа.Выгрузить();
	СтруктураПараметров.АдресРасшифровкаПлатежа = ПоместитьВоВременноеХранилище(ТЗ, Новый УникальныйИдентификатор());
	
	ОбщегоНазначенияУТ.СохранитьДанныеМеханизмаВКэшФормы(Форма, "Взаиморасчеты", ПараметрыМеханизма);
	
КонецПроцедуры

Процедура ЗагрузитьРасшифровкуПлатежаИзВременногоХранилища(Форма) Экспорт
	
	ПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	МассивПараметров = ПараметрыМеханизма.МассивПараметров;
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		Если ЗначениеЗаполнено(СтруктураПараметров.АдресРасшифровкаПлатежа) Тогда
			
			РасшифровкаПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа);
			НоваяРасшифровкаПлатежа = ПолучитьИзВременногоХранилища(СтруктураПараметров.АдресРасшифровкаПлатежа);
			Копия = РасшифровкаПлатежа.Выгрузить();
			
			РасшифровкаПлатежа.Очистить();
			Для Каждого ТекСтрока Из НоваяРасшифровкаПлатежа Цикл
				НоваяСтрока = РасшифровкаПлатежа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "Поставщик") 
					И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекСтрока, "Партнер") Тогда
					НоваяСтрока.Поставщик = ТекСтрока.Партнер;
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "СтатьяДвиженияДенежныхСредств") Тогда
					СтрокиКопии = Копия.НайтиСтроки(Новый Структура("ОбъектРасчетов", НоваяСтрока.ОбъектРасчетов));
					Если СтрокиКопии.Количество()> 0 Тогда
						НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтрокиКопии[0].СтатьяДвиженияДенежныхСредств;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			УдалитьИзВременногоХранилища(СтруктураПараметров.АдресРасшифровкаПлатежа);
			СтруктураПараметров.АдресРасшифровкаПлатежа = "";
			
		КонецЕсли;
	КонецЦикла;
	
	ЗаблокироватьОбъектыРасчетов(Форма);
	
КонецПроцедуры

Процедура ОбновитьРаспределеннуюСуммаРасшифровки(Форма) Экспорт
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,"РаспределеннаяСуммаРасшифровки") Тогда
		Возврат;
	КонецЕсли;
	
	ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	МассивПараметров = ДополненныеПараметрыМеханизма.МассивПараметров;
	
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		Организация            = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Организация);
		ТипРасчетов            = СтруктураПараметров.ТипРасчетов;
		
		Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
			ТЧ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	СуммаРаспределнная = 0;
	
	Если ТЧ <> Неопределено Тогда
		ОбъектРасчетов = Новый Массив;
		ОбъектРасчетов.Добавить(ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(
			ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Ссылка), Организация, ТипРасчетов));
		ОбъектРасчетов.Добавить(ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(
			ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Договор), Организация, ТипРасчетов));
		Если ЗначениеЗаполнено( СтруктураПараметров.ЗаказОснование) Тогда
			ОбъектРасчетов.Добавить(ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(
				ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ЗаказОснование), Организация, ТипРасчетов));
		КонецЕсли;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	Расшифровка.Сумма КАК Сумма,
		|	Расшифровка.ОбъектРасчетов КАК ОбъектРасчетов
		|ПОМЕСТИТЬ ВтРасшифровка 
		|ИЗ &ТЧ КАК Расшифровка
		|;
		|ВЫБРАТЬ
		|	СУММА(Расшифровка.Сумма) КАК Сумма
		|ИЗ
		|	ВтРасшифровка КАК Расшифровка
		|ГДЕ
		|	НЕ Расшифровка.ОбъектРасчетов В (&ОбъектРасчетов)
		|	И Расшифровка.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)");
		Запрос.УстановитьПараметр("ТЧ", ТЧ.Выгрузить());
		Запрос.УстановитьПараметр("ОбъектРасчетов", ОбъектРасчетов);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СуммаРаспределнная =  Выборка.Сумма;
		КонецЕсли;
	КонецЕсли;
	
	Форма.РаспределеннаяСуммаРасшифровки = СуммаРаспределнная;
	
КонецПроцедуры

Процедура ЗаблокироватьОбъектыРасчетов(Форма) Экспорт
	
	РазблокироватьДанныеДляРедактирования(,Форма.УникальныйИдентификатор);
	
	ПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	МассивПараметров = ПараметрыМеханизма.МассивПараметров;
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
			РасшифровкаПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа);
			Для Каждого Стр Из РасшифровкаПлатежа Цикл
				Если ЗначениеЗаполнено(Стр.ОбъектРасчетов) Тогда
					//@skip-warning
					Попытка
						ЗаблокироватьДанныеДляРедактирования(Стр.ОбъектРасчетов,,Форма.УникальныйИдентификатор);
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьИЗакэшироватьПараметры(Форма, ПараметрыЗаполнения) 
	
	ДанныеНастройки = ВзаиморасчетыСервер.ДополненныеПараметрыМеханизма(Форма, ПараметрыЗаполнения);
	ОбщегоНазначенияУТ.СохранитьДанныеМеханизмаВКэшФормы(Форма, "Взаиморасчеты", ДанныеНастройки);
	
КонецПроцедуры

// Служебная процедура, заполняет текст гиперссылки правил оплаты 
// 
// Параметры:
//	Форма       - ФормаКлиентскогоПриложения - Договор, указанный в документе:
//	 * Элементы - ЭлементыФормы - элементы вызывающей формы
//	СтруктураПараметров - см. ВзаиморасчетыСервер.ПараметрыМеханизма
//	СистемныеНастройки  - Структура - Системные настройки из дополненных параметров, если уже получены.
//
Процедура ОбновитьТекстГиперссылкиЭтапыОплаты(Форма, СтруктураПараметров = Неопределено, СистемныеНастройки = Неопределено) Экспорт
	
	Если СтруктураПараметров <> Неопределено И СистемныеНастройки <> Неопределено Тогда
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(СтруктураПараметров);
	Иначе
		ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
		МассивПараметров = ДополненныеПараметрыМеханизма.МассивПараметров;
		СистемныеНастройки = ДополненныеПараметрыМеханизма.СистемныеНастройки;
	КонецЕсли;
	
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		
		Если Не ЗначениеЗаполнено(СтруктураПараметров.НадписьЭтапыОплаты) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ СтруктураПараметров.ИзменяетПланОплаты И НЕ СтруктураПараметров.ЗаказКакСчет Тогда
			Форма.Элементы[СтруктураПараметров.ЭлементыФормы.НадписьЭтапы].Видимость = Ложь;
		Иначе
			Форма.Элементы[СтруктураПараметров.ЭлементыФормы.НадписьЭтапы].Видимость = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) Тогда
			ВзаиморасчетыКлиентСервер.ПроверитьОбязательныеПараметры(СтруктураПараметров, "ДатаПлатежа");
		КонецЕсли;
		
		Шаблон = ВзаиморасчетыКлиентСервер.ФорматируемаяСтрокаЭтаповОплаты(Форма, СтруктураПараметров, СистемныеНастройки);
		ФорматированнаяСтрока = СтроковыеФункции.ФорматированнаяСтрока(Шаблон);
		
		Реквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Форма, СтруктураПараметров.НадписьЭтапыОплаты);
		Реквизит.Данные[Реквизит.Имя] = ФорматированнаяСтрока;
		
		Если СтруктураПараметров.ДокументРасчетовСКлиентами Тогда
			Форма.Элементы[СтруктураПараметров.ЭлементыФормы.НадписьЭтапы].Доступность = 
				ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.ЭтапыОплатыКлиентом);
		Иначе
			Форма.Элементы[СтруктураПараметров.ЭлементыФормы.НадписьЭтапы].Доступность = 
				ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.ЭтапыОплатыПоставщику);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ФормаПриЧтенииСозданииНаСервере(Форма, ПараметрыМеханизма)
	
	ВзаиморасчетыВызовСервера.ОбновитьТекстГиперссылкиОграничениеЗадолженности(Форма);
	УстановитьВидимостьЗачетОплаты(Форма);
	УстановитьВидимостьГФУ(Форма);
	УстановитьВозможностьРедактированияНД(Форма);
	ОбновитьТекстГиперссылкиЭтапыОплаты(Форма);
	ОбновитьТекстГиперссылкиСостояниеРасчетов(Форма);
	ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(Форма);
	ОбновитьРаспределеннуюСуммаРасшифровки(Форма);
	
КонецПроцедуры

// Параметры:
//  Форма -  ФормаКлиентскогоПриложения 
Процедура УстановитьУсловноеОформление(Форма)
	ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	
	Для Каждого СтруктураПараметров Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
		
		Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ЭлементыФормы.СуммаВзаиморасчетовТЧ) ИЛИ Не ЗначениеЗаполнено(СтруктураПараметров.ВалютаВзаиморасчетов) Тогда
			Продолжить;
		КонецЕсли;
		
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(СтруктураПараметров.ЭлементыФормы.СуммаВзаиморасчетовТЧ);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтруктураПараметров.ВалютаДокумента);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных(СтруктураПараметров.ВалютаВзаиморасчетов);
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьВидимостьЗачетОплаты(Форма, СтруктураПараметров = Неопределено)
	
	Если СтруктураПараметров <> Неопределено Тогда
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(СтруктураПараметров);
	Иначе
		ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
		МассивПараметров = ДополненныеПараметрыМеханизма.МассивПараметров;
	КонецЕсли;
	
	РольДоступна = РольДоступна("ЗачетОплаты") ИЛИ РольДоступна("ПолныеПрава");
	
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		
		Если Не ЗначениеЗаполнено(СтруктураПараметров.ЭлементыФормы.ЗачетОплаты) Тогда
			Продолжить;
		КонецЕсли;
		
		ПорядокРасчетов    = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПорядокРасчетов);
		НакладнаяПоЗаказу  = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.НакладнаяПоЗаказам, ,Ложь);
		ЭтоЗаказ           = СтруктураПараметров.ЭтоЗаказ;
		ЭтоСправочник         = СтруктураПараметров.ЭтоСправочник;
		ИмяЭлемента        = СтруктураПараметров.ЭлементыФормы.ЗачетОплаты;
		ИзменяетПланОплаты = СтруктураПараметров.ИзменяетПланОплаты;
		УдержатьВознаграждение = СтруктураПараметров.УдержатьВознаграждение;
		
		Если ЭтоЗаказ Тогда
			ВидимостьЭлемента = ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным
								И РольДоступна
								И (ИзменяетПланОплаты ИЛИ ОбъектыРасчетовСервер.СсылкаЯвляетсяОбъектомРасчетов(Форма,СтруктураПараметров));
		ИначеЕсли НакладнаяПоЗаказу Тогда
			ВидимостьЭлемента = ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоЗаказам
								И НЕ СтруктураПараметров.ЗаказКакСчет И РольДоступна И ИзменяетПланОплаты;
		ИначеЕсли ЭтоСправочник Тогда
			ВидимостьЭлемента = (ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
									Или ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным) И РольДоступна;
		ИначеЕсли УдержатьВознаграждение Тогда
			ВидимостьЭлемента = Ложь;
		Иначе
			ВидимостьЭлемента = РольДоступна И ИзменяетПланОплаты;
		КонецЕсли;
		
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ИмяЭлемента, "Видимость", ВидимостьЭлемента);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьВидимостьГФУ(Форма, СтруктураПараметров = Неопределено)
	
	Если СтруктураПараметров <> Неопределено Тогда
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(СтруктураПараметров);
	Иначе
		ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
		МассивПараметров = ДополненныеПараметрыМеханизма.МассивПараметров;
	КонецЕсли;
	
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		
		Если Не ЗначениеЗаполнено(СтруктураПараметров.ЭлементыФормы.ГруппаФинансовогоУчета) Тогда
			Продолжить;
		КонецЕсли;
		
		ПорядокРасчетов		= ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПорядокРасчетов);
		НакладнаяПоЗаказу	= ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.НакладнаяПоЗаказам,, Ложь);
		ЭтоЗаказ			= СтруктураПараметров.ЭтоЗаказ;
		ЭтоСправочник		= СтруктураПараметров.ЭтоСправочник;
		ИмяЭлементаГФУ		= СтруктураПараметров.ЭлементыФормы.ГруппаФинансовогоУчета;
		ИзменяетПланОплаты	= СтруктураПараметров.ИзменяетПланОплаты;
		
		Если ЭтоЗаказ Тогда
			
			ВидимостьЭлемента = (ИзменяетПланОплаты 
					Или СтруктураПараметров.ЗаказКакСчет)
				И (ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказам")
					Или ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным"));
					
		ИначеЕсли НакладнаяПоЗаказу Тогда
			
			ВидимостьЭлемента = ИзменяетПланОплаты
				И (ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоНакладным")
					Или ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамНакладным")
					Или ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным"));
					
		ИначеЕсли ЭтоСправочник Тогда
			ВидимостьЭлемента = Истина;
		Иначе
			ВидимостьЭлемента = ПорядокРасчетов <> ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов")
				И ИзменяетПланОплаты;
		КонецЕсли;
		
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ИмяЭлементаГФУ, "Видимость", ВидимостьЭлемента);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьВозможностьРедактированияНД(Форма, СтруктураПараметров = Неопределено)
	
	Если СтруктураПараметров <> Неопределено Тогда
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(СтруктураПараметров);
	Иначе
		ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
		МассивПараметров = ДополненныеПараметрыМеханизма.МассивПараметров;
	КонецЕсли;
	
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		
		ПараметрыДоступности = НаправленияДеятельностиСервер.ПараметрыВозможностьРедактированияНД();
		
		ПараметрыДоступности.ЭтоСправочник      = СтруктураПараметров.ЭтоСправочник;
		ПараметрыДоступности.ЭтоЗаказ           = СтруктураПараметров.ЭтоЗаказ;
		ПараметрыДоступности.ЗаказКакСчет       = СтруктураПараметров.ЗаказКакСчет;
		ПараметрыДоступности.НакладнаяПоЗаказу  = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.НакладнаяПоЗаказам,, Ложь);
		
		ПараметрыДоступности.Договор            = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Договор,, Неопределено);
		ПараметрыДоступности.ПорядокРасчетов    = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПорядокРасчетов);
		
		ПараметрыДоступности.ИмяЭлементаНД      = СтруктураПараметров.ЭлементыФормы.НаправлениеДеятельности;
		
		НаправленияДеятельностиСервер.УстановитьВозможностьРедактированияНД(Форма, ПараметрыДоступности);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьТекстГиперссылкиСостояниеРасчетов(Форма) Экспорт
	
	ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	НоваяАрхитектураВзаиморасчетов = ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
	Для Каждого СтруктураПараметров Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
		
		Если Не ЗначениеЗаполнено(СтруктураПараметров.ЭлементыФормы.НадписьРасчеты) Тогда
			Продолжить;
		КонецЕсли;
		
		ПорядокРасчетов       = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПорядокРасчетов);
		ВалютаВзаиморасчетов  = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаВзаиморасчетов);
		НакладнаяПоЗаказам    = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.НакладнаяПоЗаказам, , Ложь);
		ЗаказОснование        = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ЗаказОснование);
		ИзменяетРасчеты       = СтруктураПараметров.ИзменяетПланОплаты;
		ЭлементНадписьРасчеты = СтруктураПараметров.ЭлементыФормы.НадписьРасчеты;
		ЭтоЗаказ              = СтруктураПараметров.ЭтоЗаказ;
		ЭтоСправочник         = СтруктураПараметров.ЭтоСправочник;
		
		СписокЗаказов = ВзаиморасчетыСлужебный.ПолучитьМассивЗаказовИзТЧ(Форма, СтруктураПараметров);
		
		Если ЗначениеЗаполнено(ЭлементНадписьРасчеты) Тогда
			
			Элемент = Форма.Элементы[ЭлементНадписьРасчеты]; // ПолеФормы
			
			Если ИзменяетРасчеты 
				//Не заказ с расчетами по накладным
				И НЕ (ЭтоЗаказ И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным)
				//Не договор без графика
				И НЕ (ЭтоСправочник И НЕ ЗначениеЗаполнено(СтруктураПараметров.ГрафикИсполненияДоговора)) Тогда
					
				Если ЭтоСправочник Тогда
					
					Если СтруктураПараметров.ДокументРасчетовСКлиентами Тогда
						СтрокаОтгружено = НСтр("ru = 'Отгружено'");
					Иначе
						СтрокаОтгружено = НСтр("ru = 'Поступило'");
					КонецЕсли;
					
					СостояниеВзаиморасчетов = ВзаиморасчетыСервер.СостояниеВзаиморасчетов(Форма, СтруктураПараметров);
					СуммаОплат   = СостояниеВзаиморасчетов.СуммаОплат;
					ПроцентОплат = ОкруглитьПроценты(СостояниеВзаиморасчетов.ПроцентОплат);
					СуммаОтгрузокПоставок = СостояниеВзаиморасчетов.СуммаОтгрузок + СостояниеВзаиморасчетов.СуммаПоставок;
					ПроцентОтгрузкиПоставки = ОкруглитьПроценты(СостояниеВзаиморасчетов.ПроцентОтгрузок + СостояниеВзаиморасчетов.ПроцентПоставок);
				
					Расчеты = НСтр("ru = 'Оплачено'") + ": " + Формат(СуммаОплат, "ЧДЦ=2; ЧН=") 
						+ " " + ВалютаВзаиморасчетов + "  " + ПроцентОплат + "%";
					Элемент.Заголовок = Расчеты + ", " + СтрокаОтгружено + ": " + Формат(СуммаОтгрузокПоставок, "ЧДЦ=2; ЧН=") 
						+ " " + ВалютаВзаиморасчетов + "  " + ПроцентОтгрузкиПоставки + "%";
					
				ИначеЕсли ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
					
					СостояниеВзаиморасчетов = ВзаиморасчетыСервер.СостояниеВзаиморасчетов(Форма, СтруктураПараметров);
					ТипРасчетов = СтруктураПараметров.ТипРасчетов;
					КонечноеСальдо = СостояниеВзаиморасчетов.СуммаЗадолженности;
					Если КонечноеСальдо < 0  Тогда
						ТекстСальдо = НСтр("ru = 'оплачено'");
						КонечноеСальдо = - КонечноеСальдо;
					ИначеЕсли ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда 
						ТекстСальдо = НСтр("ru = 'долг клиента'");
					Иначе
						ТекстСальдо = НСтр("ru = 'долг поставщику'");
					КонецЕсли;
					Элемент.Заголовок = НСтр("ru = 'Расчеты по договору'") + ": " + ТекстСальдо 
						+ " " + Формат(КонечноеСальдо, "ЧДЦ=2; ЧН=0,00;") + " " + ВалютаВзаиморасчетов;
				ИначеЕсли ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным И ЭтоЗаказ Тогда
					Элемент.Заголовок = НСтр("ru = 'Расчеты по договору и накладным'");
				Иначе
					
					СостояниеВзаиморасчетов = ВзаиморасчетыСервер.СостояниеВзаиморасчетов(Форма, СтруктураПараметров);
					СуммаОплат   = Макс(0, СостояниеВзаиморасчетов.СуммаОплат);
					ПроцентОплат = Макс(0, ОкруглитьПроценты(СостояниеВзаиморасчетов.ПроцентОплат));
					
					Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам И НакладнаяПоЗаказам И ЗначениеЗаполнено(ЗаказОснование)
						ИЛИ ЭтоЗаказ Тогда
						Элемент.Заголовок = НСтр("ru = 'Оплачено по заказу:'") + " " + Формат(СуммаОплат, "ЧДЦ=2; ЧН=") + " " + ВалютаВзаиморасчетов + " " + ПроцентОплат + "%";
					ИначеЕсли СписокЗаказов.Количество() > 1 И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам Тогда
						Элемент.Заголовок = НСтр("ru = 'Расчеты по заказам ('")+ Строка(СписокЗаказов.Количество()) + ")";
					Иначе
						Элемент.Заголовок = НСтр("ru = 'Оплачено'") + ": " + Формат(СуммаОплат, "ЧДЦ=2; ЧН=") + " " + ВалютаВзаиморасчетов + " " + ПроцентОплат + "%";
					КонецЕсли;
				
				КонецЕсли;
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ЭлементНадписьРасчеты, "Видимость", Истина);
			ИначеЕсли ЭтоСправочник И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным И НоваяАрхитектураВзаиморасчетов Тогда
				
				Если СтруктураПараметров.ДокументРасчетовСКлиентами Тогда
					СтрокаОтгружено = НСтр("ru = 'Отгружено'");
				Иначе
					СтрокаОтгружено = НСтр("ru = 'Поступило'");
				КонецЕсли;
				
				СостояниеВзаиморасчетов = ВзаиморасчетыСервер.СостояниеВзаиморасчетов(Форма, СтруктураПараметров);
				СуммаОплат   = СостояниеВзаиморасчетов.СуммаОплат;
				ПроцентОплат = ОкруглитьПроценты(СостояниеВзаиморасчетов.ПроцентОплат);
				СуммаОтгрузокПоставок = СостояниеВзаиморасчетов.СуммаОтгрузок + СостояниеВзаиморасчетов.СуммаПоставок;
				ПроцентОтгрузкиПоставки = ОкруглитьПроценты(СостояниеВзаиморасчетов.ПроцентОтгрузок + СостояниеВзаиморасчетов.ПроцентПоставок);
			
				Расчеты = НСтр("ru = 'Оплачено'") + ": " + Формат(СуммаОплат, "ЧДЦ=2; ЧН=") 
					+ " " + ВалютаВзаиморасчетов + ?(ИзменяетРасчеты, "  " + ПроцентОплат + "%", "");
				Элемент.Заголовок = Расчеты + ", " + СтрокаОтгружено + ": " + Формат(СуммаОтгрузокПоставок, "ЧДЦ=2; ЧН=") 
					+ " " + ВалютаВзаиморасчетов + ?(ИзменяетРасчеты, "  " + ПроцентОтгрузкиПоставки + "%", "");
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ЭлементНадписьРасчеты, "Видимость", Истина);
			Иначе
				ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ЭлементНадписьРасчеты, "Видимость", Ложь);
			КонецЕсли;
		
			Если СтруктураПараметров.ДокументРасчетовСКлиентами Тогда
				Элемент.Доступность = ПравоДоступа("Использование", Метаданные.Отчеты.КарточкаРасчетовСКлиентами24);
			ИначеЕсли СтруктураПараметров.ДокументРасчетовСПоставщиками Тогда
				Элемент.Доступность = ПравоДоступа("Использование", Метаданные.Отчеты.КарточкаРасчетовСПоставщиками24);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Округляет проценты оплаты, отгрузки
//
// Параметры:
//	ОкругляемоеЧисло - Число - округляемое число.
//
// Возвращаемое значение:
//  Число - целое число процентов
//
Функция ОкруглитьПроценты(ОкругляемоеЧисло)
	
	Если ОкругляемоеЧисло > 99
		И ОкругляемоеЧисло < 100 Тогда
		Результат = 99;
	ИначеЕсли ОкругляемоеЧисло > 0
		И ОкругляемоеЧисло < 1 Тогда
		Результат = 1;
	Иначе
		Результат = Окр(ОкругляемоеЧисло);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Очищает расшифровку платежа
Процедура ОчиститьРасшифровкуПлатежа(Объект, СтруктураПараметров)
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
		Возврат;
	КонецЕсли;
	
	РасшифровкаПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа);
	
	Если СтруктураПараметров.ЭтоПродажаЗакупка Тогда
		РасшифровкаПлатежа.Очистить();
	Иначе
		
		ЕстьОснованиеПлатежа = РасшифровкаПлатежа.Количество() > 0 
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РасшифровкаПлатежа[0],"ОснованиеПлатежа");
		
		Для Каждого Стр Из РасшифровкаПлатежа Цикл
			Стр.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
			Если ЕстьОснованиеПлатежа Тогда
				Стр.ОснованиеПлатежа = Неопределено;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьОбъектИСуммуРасшифровкиПлатежа(Объект, СтруктураПараметров, СохраняемыеОбъектыРасчетов = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
		Возврат;
	КонецЕсли;
	
	РасшифровкаПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа);
	Для Каждого Стр Из РасшифровкаПлатежа Цикл
		Если СохраняемыеОбъектыРасчетов <> Неопределено
			И СохраняемыеОбъектыРасчетов.Найти(Стр.ОбъектРасчетов) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Стр.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
		Стр.СуммаВзаиморасчетов = 0;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Стр, "ВалютаВзаиморасчетов") Тогда
			Стр.ВалютаВзаиморасчетов = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");
		КонецЕсли
	КонецЦикла;
	
	Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
		ОбновитьРаспределеннуюСуммаРасшифровки(Объект);
	КонецЕсли;
	
КонецПроцедуры

Функция МассивСтруктурПараметровПоРеквизитам(МассивПараметров, ЗНАЧ ИменаРеквизитов)
	Если ТипЗнч(ИменаРеквизитов) = Тип("Массив") Тогда
		МассивИменРеквизитов = ИменаРеквизитов;
	Иначе
		МассивИменРеквизитов = Новый Массив;
		МассивИменРеквизитов.Добавить(ИменаРеквизитов);
	КонецЕсли;
	Результат = Новый Массив;
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		МассивНайденныхРеквизитов = Новый Массив;
		Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
			РеквизитыМеханизма = СтруктураПараметров.ИспользуемыеРеквизиты["Объект."+ИмяРеквизита];
			Если РеквизитыМеханизма <> Неопределено Тогда
				Для Каждого Реквизит из РеквизитыМеханизма Цикл
					МассивНайденныхРеквизитов.Добавить(Реквизит);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если МассивНайденныхРеквизитов.Количество() > 0 Тогда
			СтруктураРезультата = Новый Структура;
			СтруктураРезультата.Вставить("СтруктураПараметров", СтруктураПараметров);
			СтруктураРезультата.Вставить("ИспользуемыеРеквизиты", МассивНайденныхРеквизитов);
			Результат.Добавить(СтруктураРезультата);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

//Очищает определенные поля этапов графика оплаты.
Процедура ОчиститьПоляЭтаповГрафикаОплаты(Форма, СтруктураПараметров, МассивПолейОчистки)
	
	ЭтапыГрафикаОплаты = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
	
	Если ЭтапыГрафикаОплаты = Неопределено 
		ИЛИ ЭтапыГрафикаОплаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивИмеющихсяПолей = Новый Массив;
	Для Каждого Поле Из МассивПолейОчистки Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыГрафикаОплаты[0], Поле) Тогда
			МассивИмеющихсяПолей.Добавить(Поле);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из ЭтапыГрафикаОплаты Цикл
		Для Каждого Поле Из МассивИмеющихсяПолей Цикл
			Стр[Поле] = 0;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ДоступныеПоОрганизацииОбъектыРасчетов(Объект, СтруктураПараметров)
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивОбъектовРасчетов = Новый Массив;
	РасшифровкаПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа);
	Для Каждого Стр Из РасшифровкаПлатежа Цикл
		МассивОбъектовРасчетов.Добавить(Стр.ОбъектРасчетов);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектыРасчетов", МассивОбъектовРасчетов);
	Запрос.УстановитьПараметр("Организация", ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыРасчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Филиалы КАК ДоговорыКонтрагентовФилиалы
		|		ПО ОбъектыРасчетов.Договор = ДоговорыКонтрагентовФилиалы.Ссылка
		|ГДЕ
		|	ОбъектыРасчетов.Ссылка В(&ОбъектыРасчетов)
		|	И ДоговорыКонтрагентовФилиалы.Ссылка.ЦентрализованныйДоговор
		|	И (ОбъектыРасчетов.Организация = &Организация
		|			ИЛИ ДоговорыКонтрагентовФилиалы.Ссылка.Организация = &Организация
		|			ИЛИ ДоговорыКонтрагентовФилиалы.Организация = &Организация
		|				И (ДоговорыКонтрагентовФилиалы.Ссылка.РазрешаетсяПередачаОплатМеждуФилиалами
		|					ИЛИ ОбъектыРасчетов.Организация = ДоговорыКонтрагентовФилиалы.Ссылка.Организация))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъектыРасчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|ГДЕ
		|	ОбъектыРасчетов.Ссылка В(&ОбъектыРасчетов)
		|	И ОбъектыРасчетов.Организация.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию
		|	И (ОбъектыРасчетов.Организация.ГоловнаяОрганизация = &Организация
		|		ИЛИ ОбъектыРасчетов.Организация = &Организация)";
	Выборка = Запрос.Выполнить().Выбрать();
	МассивОбъектовРасчетов.Очистить();
	Пока Выборка.Следующий() Цикл
		МассивОбъектовРасчетов.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат МассивОбъектовРасчетов;
	
КонецФункции

// Проверяет является ли оповещение в форме событием изменения документов оплаты.
//
// Параметры:
//   ИмяСобытия - Строка - имя события из процедуры формы "ОбработкаОповещения".
//
// Возвращаемое значение:
//   Булево - Истина, если оповещение является оплатой.
//
Функция ИзменилисьДокументыОплатыКлиентам(ИмяСобытия) Экспорт
	
	Возврат
		ИмяСобытия = "Запись_ОперацияПоПлатежнойКарте"
		Или ИмяСобытия = "Запись_ПоступлениеБезналичныхДенежныхСредств"
		Или ИмяСобытия = "Запись_ПриходныйКассовыйОрдер"
		Или ИмяСобытия = "Запись_ВзаимозачетЗадолженности"
		Или ИмяСобытия = "Запись_СписаниеЗадолженности";
	
КонецФункции

// Проверяет является ли оповещение в форме событием изменения документов оплаты.
//
// Параметры:
//   ИмяСобытия - Строка - имя события из процедуры формы "ОбработкаОповещения".
//
// Возвращаемое значение:
//   Булево - Истина, если оповещение является оплатой.
//
Функция ИзменилисьДокументыОплатыПоставщиком(ИмяСобытия) Экспорт
	
	Возврат
		ИмяСобытия = "Запись_АвансовыйОтчет"
		Или ИмяСобытия = "Запись_СписаниеБезналичныхДенежныхСредств"
		Или ИмяСобытия = "Запись_ПоступлениеБезналичныхДенежныхСредств"
		Или ИмяСобытия = "Запись_РасходныйКассовыйОрдер"
		Или ИмяСобытия = "Запись_ВзаимозачетЗадолженности"
		Или ИмяСобытия = "Запись_СписаниеЗадолженности";
	
КонецФункции

#КонецОбласти