///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй".
// ОбщийМодуль.ОзонПэйСервис.
//
// Серверные процедуры обмена данными с платежной системой Озон Пэй через сервис Интернет-поддержки:
//  - выполнение оплаты, возвратов и получение статус операций;
//  - получение информации о подсказках платежной системы.
//  - обработка полученных ответов от сервиса.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиПодключения

// Производит проверку данных аутентификации в сервисе Озон Пэй.
//
// Параметры:
//  ДанныеАутентификации - Структура - данные аутентификации.
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения см. НастройкиПлатежныхСистемСлужебный.ПереопределитьКодОшибкиСервиса.
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ПроверитьПараметрыПодключения(ДанныеАутентификации) Экспорт
	
	// На момент разработки подсистемы в документации к сервису отсутствовал метод проверки данных аутентификации,
	// поэтому проверка выполняться через попытку получить данные не существующего заказа
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	
	СписокСвойствОшибки  = "КодОшибки,СообщениеОбОшибке,ИнформацияОбОшибке";
	
	// Подготовка данных для отправки на портал
	
	ПараметрыОперации = ПараметрыЗапросаСтатусОперации(
		"_ТестПодключения_",
		ДанныеАутентификации);

	ТекстОшибки = НСтр("ru = 'Не удалось проверить данные аутентификации.'");
	ТекстЛога   = НСтр("ru = 'Получен ответ от сервиса'");
	
	РезультатЗапроса = ПлатежныеСистемыСервис.ВыполнитьОперациюСервиса(
		ИдентификаторПлатежнойСистемы(),
		КореньАдресаИнтеграции(),
		ПараметрыОперации,
		ТекстОшибки,
		ТекстЛога);
	
	// Поскольку отправляем запрос с точно несуществующим идентификатором операции, в ответ всегда приходит ошибка.
	// Если это ошибка сервиса, то будет заполнен код ошибки и ее описание.
	// Если это ошибка банка, то код ошибки заполнен не будет, но будет заполнен код состояния, по которому
	// проверяем: если ошибка в том, что указали несуществующий идентификатор, то значит данные аутентификации
	// заполнены корректно.
	Если Не ПустаяСтрока(РезультатЗапроса.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса, СписокСвойствОшибки);
		Возврат Результат;
	КонецЕсли;
	
	// Обработка ошибки проверки данных аутентификации
	НеизвестнаяОшибка = Ложь;
	Если РезультатЗапроса.КодСостояния = 403 Тогда
		
		Результат.КодОшибки          = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйЛогинИлиПароль();
		Результат.СообщениеОбОшибке  = НСтр("ru = 'Ошибка аутентификации в сервисе платежной системы.'");
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		
	ИначеЕсли РезультатЗапроса.КодСостояния = 404 Тогда
		
		ДанныеОтвета = Новый Структура;
		ДанныеОтвета.Вставить("Код", РезультатЗапроса.ДанныеОтвета.Получить("code"));
		ДанныеОтвета.Вставить("Сообщение", РезультатЗапроса.ДанныеОтвета.Получить("message"));
		
		Если ДанныеОтвета.Код = 5 Тогда
			Возврат Результат;
		Иначе
			НеизвестнаяОшибка = Истина;
		КонецЕсли;
		
	Иначе
		
		НеизвестнаяОшибка = Истина;
		
	КонецЕсли;
	
	Если НеизвестнаяОшибка Тогда
		
		Результат.КодОшибки          = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеизвестнаяОшибка();
		Результат.СообщениеОбОшибке  = НСтр("ru = 'Неизвестная ошибка при подключении к сервису.'");
		Результат.ИнформацияОбОшибке = НСтр(
			"ru = 'Сервис платежной системы Ozon Pay вернул не декларированный код состояния.'");
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(Результат.ИнформацияОбОшибке, Истина);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает идентификатор платежной системы Озон Пэй.
//
// Возвращаемое значение:
//  Строка
//
Функция ИдентификаторПлатежнойСистемы() Экспорт
	
	Возврат "ozon-pay";
	
КонецФункции

// Возвращает начало адресной строки для вызова методов платежной системы.
//
// Возвращаемое значение:
//  Строка
//
Функция КореньАдресаИнтеграции() Экспорт
	
	Возврат "isl";
	
КонецФункции

#КонецОбласти

#Область СтатусОперации

// Выполняет запрос получения информации о статусе операции в сервисе платежной системы Озон Пэй.
//
// Параметры:
//  ПараметрыСтатуса - см. ПлатежныеСистемы.ДанныеОперации.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения см. НастройкиПлатежныхСистемСлужебный.ПереопределитьКодОшибкиСервиса
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * СтатусОперации - Строка - текущее состояние операции в платежной системе.
//        Возможные значения:
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется - подтверждение операции не получено.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена - платежная система подтвердила операцию.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена - операция не может быть выполнена.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОшибка - не удалось получить статус операции из-за
//            ошибки.
//    * ПараметрыОперации - Структура - дополнительные данные по операции:
//        ** ИдентификаторОперации - Строка - идентификатор операции в платежной системе.
//        ** ИдентификаторОплаты -Строка - идентификатор оплаты в платежной системе.
//        ** ТипОперации - Строка - тип выполненной операции в платежной системе.
//             Возможные значения:
//               см. ПлатежныеСистемыКлиентСервер.ТипОперацииОплата - операция оплаты.
//               см. ПлатежныеСистемыКлиентСервер.ТипОперацииВозврат - операция возврата оплаты.
//        ** ДатаОперации - Дата - фактическая дата операции в UTC.
//        ** СуммаОперации - Число - фактическая суммы операции по документу.
//    * ОбновитьДатуЗапросаСтатуса - Булево - Истина, если необходимо обновить дату запроса статуса в базе данных.
//
Функция СтатусОперации(ПараметрыСтатуса, НастройкаПодключения) Экспорт
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатСтатусОперацииСлужебный();
	СписокСвойствОшибки = "КодОшибки,СообщениеОбОшибке,ИнформацияОбОшибке";
	
	ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("ru = 'Получение данных операции Ozon Pay'"));
	
	АутентификацияСервиса = ПараметрыАутентификацииПлатежнойСистемы(НастройкаПодключения);
	Если Не ПустаяСтрока(АутентификацияСервиса.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(Результат, АутентификацияСервиса, СписокСвойствОшибки);
		Возврат Результат;
	КонецЕсли;
	
	// Необходимо обновить дату запроса статуса в базе данных
	Результат.ОбновитьДатуЗапросаСтатуса = Истина;
	
	// Подготовка данных для отправки на портал
	ПараметрыОперации = ПараметрыЗапросаСтатусОперации(
		ПараметрыСтатуса.ИдентификаторОплаты,
		АутентификацияСервиса);
	
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось получить данные операции.
			|Настройка подключения: %1 (ID:%2)'"),
		Строка(НастройкаПодключения),
		Строка(НастройкаПодключения.УникальныйИдентификатор()));
	ТекстЛога = НСтр("ru = 'Получен ответ от сервиса'");
	
	РезультатЗапроса = ПлатежныеСистемыСервис.ВыполнитьОперациюСервиса(
		ИдентификаторПлатежнойСистемы(),
		КореньАдресаИнтеграции(),
		ПараметрыОперации,
		ТекстОшибки,
		ТекстЛога);
	Если Не ПустаяСтрока(РезультатЗапроса.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса, СписокСвойствОшибки);
		Возврат Результат;
	КонецЕсли;
	
	ЭтоОплата = (ПараметрыСтатуса.ТипОперации = ПлатежныеСистемыКлиентСервер.ТипОперацииОплата());
	
	// Обработка ответа сервиса платежной системы
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		
		ДанныеОтвета = ДанныеОтветаСервисаСтатусОперации(РезультатЗапроса.ДанныеОтвета);
		
		// Попытка найти информацию о текущей операции
		ПараметрыОтбора = Новый Структура();
		Если ЭтоОплата Тогда
			ПараметрыОтбора.Вставить("ТипОперации", ТипОперацииСервисаОплата());
			ПараметрыОтбора.Вставить("ВнешнийИдентификатор", "");
		Иначе
			ПараметрыОтбора.Вставить("ТипОперации", ТипОперацииСервисаВозврат());
			ПараметрыОтбора.Вставить("ВнешнийИдентификатор", ПараметрыСтатуса.Идентификатор);
		КонецЕсли;
		
		СтрокиОперации = ДанныеОтвета.Операции.НайтиСтроки(ПараметрыОтбора);
		Если СтрокиОперации.Количество() = 1 Тогда
			
			СтрокаОперации = СтрокиОперации[0];
			
			Результат.СтатусОперации = СтрокаОперации.СтатусОперации;
			
			Если ЭтоОплата Тогда
				Результат.ПараметрыОперации.ИдентификаторОперации = ПараметрыСтатуса.ИдентификаторОплаты;
			Иначе
				Результат.ПараметрыОперации.ИдентификаторОперации = СтрокаОперации.ИдентификаторТранзакции;
			КонецЕсли;
			
			Результат.ПараметрыОперации.ИдентификаторОплаты   = ПараметрыСтатуса.ИдентификаторОплаты;
			Результат.ПараметрыОперации.ТипОперации           = ПреобразоватьТипОперации(СтрокаОперации.ТипОперации);
			Результат.ПараметрыОперации.ДатаОперации          = СтрокаОперации.ВремяОперации;
			Результат.ПараметрыОперации.СуммаОперации         = СтрокаОперации.СуммаОперации;
			
		ИначеЕсли СтрокиОперации.Количество() = 0 Тогда
			СтатусСравнение = ВРег(ДанныеОтвета.Статус);
			Если СтатусСравнение = "STATUS_CANCELED"
				Или СтатусСравнение = "STATUS_PARTITION_CANCELED" Тогда
				Результат.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена();
			ИначеЕсли ЭтоОплата Тогда
				Результат.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется();
			Иначе
				Результат.КодОшибки          = НастройкиПлатежныхСистемСлужебный.КодОшибкиОбъектНеНайден();
				Если ЭтоОплата Тогда
					Результат.СообщениеОбОшибке  = НСтр("ru = 'Не найден заказ в платежной системе'");
				Иначе
					Результат.СообщениеОбОшибке  = НСтр("ru = 'Не найден возврат в платежной системе'");
				КонецЕсли;
				Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В платежной системе не найдена операция с идентификатором %1'"),
					ПараметрыСтатуса.Идентификатор);
			КонецЕсли;

		Иначе
			ВызватьИсключение НСтр("ru = 'Ошибка чтения статуса операции.
				|В списке операции обнаружены дубли одной операции.
				|Обратитесь к администратору'");
		КонецЕсли;
	
	Иначе
		
		ОбработатьОтветСОшибкой(Результат, РезультатЗапроса);
		Возврат Результат;
		
	КонецЕсли;
	
	ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("ru = 'Получение данных операции Ozon Pay завершено'"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщегоНазначения

// Преобразует статус операции сервиса.
//
// Параметры:
//  СтатусОперации - Строка - статус операции сервиса.
//
// Возвращаемое значение:
//  Строка
//
Функция ПреобразоватьСтатусОперации(СтатусОперации)
	
	СтатусСравнения = ВРег(СтатусОперации);
	Если СтатусСравнения = "OPERATION_STATUS_UNSPECIFIED" Тогда
		Возврат НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется();
	ИначеЕсли СтатусСравнения = "PAYMENT_AUTHORIZED"
		Или СтатусСравнения = "PAYMENT_PARTIAL_CANCELED"
		Или СтатусСравнения = "PAYMENT_CONFIRMED"
		Или СтатусСравнения = "REFUND_SUCCESS"
		Или СтатусСравнения = "CHARGEBACK_SUCCESS"
		Или СтатусСравнения = "SBP_DISPUTE_SUCCESS" Тогда
		Возврат НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена();
	ИначеЕсли СтатусСравнения = "PAYMENT_REJECTED"
		Или СтатусСравнения = "CANCEL_FAILED"
		Или СтатусСравнения = "REFUND_FAILED" Тогда
		Возврат НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОшибка();
	Иначе
		Возврат НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена();
	КонецЕсли;
	
КонецФункции

// Преобразует статус тип операции сервиса.
//
// Параметры:
//  ТипОперации - Строка - тип операции сервиса.
//
// Возвращаемое значение:
//  Строка
//
Функция ПреобразоватьТипОперации(ТипОперации)
	
	ТипСравнения = ВРег(ТипОперации);
	Если ТипСравнения = ТипОперацииСервисаОплата() Тогда
		Возврат ПлатежныеСистемыКлиентСервер.ТипОперацииОплата();
	ИначеЕсли ТипСравнения = ТипОперацииСервисаВозврат() Тогда
		Возврат ПлатежныеСистемыКлиентСервер.ТипОперацииВозврат();
	ИначеЕсли ТипСравнения = "CANCEL" Тогда
		Возврат "Отмена"; // АПК:1297 Идентификатор типа операции
	ИначеЕсли ТипСравнения = "CHARGEBACK" Тогда
		Возврат "Возвратный платеж"; // АПК:1297 Идентификатор типа операции
	ИначеЕсли ТипСравнения = "REVERT_CHARGEBACK" Тогда
		Возврат "Отмена возвратного платежа"; // АПК:1297 Идентификатор типа операции
	ИначеЕсли ТипСравнения = "SBP_DISPUTE" Тогда
		Возврат "Диспут в СБП"; // АПК:1297 Идентификатор типа операции
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неизвестный тип операции: %1'"),
			ТипСравнения);
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область Аутентификация

// Формирует данные аутентификации в платежной системе Озон Пэй.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройки подключения к сервису.
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения:
//          "" - данные аутентификации прочитаны успешно.
//          см. НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйЛогинИлиПароль - данные аутентификации не найдены.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * Токен - Строка - ID токена для шифрования.
//    * СекретныйКлюч - Строка - ключ шифрования.
//
Функция ПараметрыАутентификацииПлатежнойСистемы(НастройкаПодключения)
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	Результат.Вставить("Токен", "");
	Результат.Вставить("СекретныйКлюч", "");
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(НастройкаПодключения);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДанныеХранилища = Неопределено Тогда
		
		Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйЛогинИлиПароль();
		Результат.СообщениеОбОшибке = НСтр("ru = 'Для работы с сервисом необходимо ввести данные аутентификации.'");
		Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для настройки подключения ""%1"" (ID:%2) отсутствуют данные аутентификации'"),
			Строка(НастройкаПодключения),
			Строка(НастройкаПодключения.УникальныйИдентификатор()));
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
			Результат.ИнформацияОбОшибке,
			Истина);
		
	Иначе
		ЗаполнитьЗначенияСвойств(Результат, ДанныеХранилища);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует подпись запроса
//
// Параметры:
//  ДанныеПодписи - Массив Из Строка - поля запроса в том порядке, в котором они должны шифроваться
//  Ключ - Строка - ключ шифрования
// 
// ВозвращаемоеЗначение:
//  Строка - данные подписи
// 
Функция ПодписьЗапроса(ДанныеПодписи, Ключ)

	СтрокаПодписи = СтрСоединить(ДанныеПодписи);
	СтрокаПодписи = СтрокаПодписи + Ключ;
	
	Хеш = Строка(НастройкиПлатежныхСистемСлужебный.Хешировать(
		СтрокаПодписи,
		ХешФункция.SHA256));
	
	Хеш = СтрЗаменить(Хеш, " ", "");
	Хеш = НРег(Хеш);
	
	Возврат Хеш;
	
КонецФункции

#КонецОбласти

#Область ВозвратОплаты

// Создает новый запрос на возврат оплаты за ранее оплаченный заказ.
//
// Параметры:
//  ДанныеЗаказа - Структура - результат подготовки заказа на возврат:
//    * ЗаказНаВозврат - см. ОзонПэйПереопределяемый.ПриФормированииЗаказаНаВозврат.ЗаказНаВозврат
//    * Идентификатор - Строка - внутренний идентификатор операции.
//    * ИдентификаторОплаты - Строка - идентификатора оплаты в платежной системе.
//    * КоличествоПопыток - Число - количество выполненных попыток отправить запрос.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения см. НастройкиПлатежныхСистемСлужебный.ПереопределитьКодОшибкиСервиса
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * СтатусОперации - Строка - текущее состояние операции оплаты.
//        Возможные значения:
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется - подтверждение операции не получено.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена - платежная система подтвердила операцию.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена - операция не может быть выполнена.
//          см. НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОшибка - не удалось получить статус операции из-за
//            ошибки.
//    * ПараметрыОперации - Структура - дополнительные данные по операции:
//        ** ИдентификаторОперации - Строка - идентификатор операции в платежной системе.
//        ** ИдентификаторОплаты -Строка - идентификатор оплаты в платежной системе.
//        ** ТипОперации - Строка - тип выполненной операции в платежной системе.
//             Возможные значения:
//               см. ПлатежныеСистемыКлиентСервер.ТипОперацииОплата - операция оплаты.
//               см. ПлатежныеСистемыКлиентСервер.ТипОперацииВозврат - операция возврата оплаты.
//        ** ДатаОперации - Дата - фактическая дата операции в UTC.
//        ** СуммаОперации - Число - фактическая суммы операции по документу.
//
Функция ВозвратОплаты(ДанныеЗаказа, НастройкаПодключения) Экспорт
	
	ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("ru = 'Создание заказа на возврат Ozon Pay'"));
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатСтатусОперации();
	
	АутентификацияСервиса = ПараметрыАутентификацииПлатежнойСистемы(НастройкаПодключения);
	Если Не ПустаяСтрока(АутентификацияСервиса.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(Результат, АутентификацияСервиса, "КодОшибки,СообщениеОбОшибке,ИнформацияОбОшибке");
		Возврат Результат;
	КонецЕсли;
	
	// Преобразование данных заказа в формат сервиса
	ДанныеЗапроса = ДанныеЗапросаВозвратаОплаты(ДанныеЗаказа, АутентификацияСервиса);
	
	// Подготовка данных для отправки на портал
	ПараметрыОперацииСервиса = ПлатежныеСистемыСервис.НовыйПараметрыОперацииСервисаPOST(
		"/refundOrder",
		ДанныеЗапроса);
	
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось отправить запрос на возврат в сервиса Ozon Pay.
			|Настройка подключения: %1 (ID:%2)'"),
		Строка(НастройкаПодключения),
		Строка(НастройкаПодключения.УникальныйИдентификатор()));
	ТекстЛога = НСтр("ru = 'Получен ответ от сервиса'");
	
	РезультатЗапроса = ПлатежныеСистемыСервис.ВыполнитьОперациюСервиса(
		ИдентификаторПлатежнойСистемы(),
		КореньАдресаИнтеграции(),
		ПараметрыОперацииСервиса,
		ТекстОшибки,
		ТекстЛога,
		Истина);
		
	// Операция возврата синхронная. Если операция выполнена, то возвращается 200 без тела запроса
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		
		Результат.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена();
		
		Результат.ПараметрыОперации.ИдентификаторОперации = ДанныеЗаказа.Идентификатор;
		Результат.ПараметрыОперации.ИдентификаторОплаты = ДанныеЗаказа.ИдентификаторОплаты;
		Результат.ПараметрыОперации.ДатаОперации = Дата(1, 1, 1);
		Результат.ПараметрыОперации.СуммаОперации = ДанныеЗаказа.ЗаказНаВозврат.СуммаВозврата;
		Результат.ПараметрыОперации.ТипОперации = ПлатежныеСистемыКлиентСервер.ТипОперацииВозврат();

		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
			НСтр("ru = 'Заказ на возврат Ozon Pay создан успешно'"));
		
	Иначе
		
		ОбработатьОтветСОшибкой(Результат, РезультатЗапроса);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует данные заказа на оплату в формат сервиса Озон Пэй.
//
// Параметры:
//  ДанныеЗаказа - см. ОзонПэйПереопределяемый.ПриФормированииЗаказаНаВозврат.ЗаказНаВозврат
//  АутентификацияСервиса - см. ПараметрыАутентификацииПлатежнойСистемы
//  
// Возвращаемое значение:
//  Структура:
//    * accessKey - Строка - токен;
//    * id - Строка - идентификатор оплаты в Озон Пэй;
//    * extId - Строка - внутренний идентификатор документа возврата;
//    * amount - Структура - данные о сумме возврата:
//      ** currencyCode - Строка - код валюты;
//      ** value - Число - сумма возврата;
//    * positions - Массив из Структура - позиции чека;
//    * requestSign - Строка - подпись запроса;
//
Функция ДанныеЗапросаВозвратаОплаты(ДанныеЗаказа, АутентификацияСервиса)
	
	СуммаВКопейках = Цел(ДанныеЗаказа.ЗаказНаВозврат.СуммаВозврата * 100);
	
	СуммаВозврата = Новый Структура(
		"currencyCode, value",
		"643",
		СуммаВКопейках);
	
	Позиция = Новый Структура(
		"amount, id",
		СуммаВозврата,
		1);
	
	ДанныеПодписи = Новый Массив;
	ДанныеПодписи.Добавить(ДанныеЗаказа.ИдентификаторОплаты);
	ДанныеПодписи.Добавить(ДанныеЗаказа.Идентификатор);
	ДанныеПодписи.Добавить(АутентификацияСервиса.Токен);
	ДанныеПодписи.Добавить(СуммаВозврата.currencyCode);
	ДанныеПодписи.Добавить(Формат(СуммаВозврата.value, "ЧГ=;"));
	
	Подпись = ПодписьЗапроса(ДанныеПодписи, АутентификацияСервиса.СекретныйКлюч);
	
	Результат = Новый Структура();
	Результат.Вставить("accessKey", АутентификацияСервиса.Токен);
	Результат.Вставить("id", ДанныеЗаказа.ИдентификаторОплаты); // Идентификатор заказа на оплату в системе банка
	Результат.Вставить("extId", ДанныеЗаказа.Идентификатор); // Идентификатор заказа на возврат в 1С
	Результат.Вставить("amount", СуммаВозврата);
	Результат.Вставить("positions", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Позиция));
	Результат.Вставить("requestSign", Подпись);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СтатусОперации

// Преобразует данные ответа сервиса платежной системы Озон Пэй к ожидаемому формату операции СтатусОперации.
//
// Параметры:
//  ДанныеОтвета - Неопределено, Соответствие Из КлючИЗначение - данные ответа сервиса.
//
// Возвращаемое значение:
//  Структура - ожидаемый успешный формат ответа:
//  * Статус - Строка - статус заказа.
//  * СсылкаДляОплаты - Строка - Ссылка для оплаты заказа.
//  * ВнешнийИдентификатор - Строка - Идентификатор заказа из системы продавца.
//  * Операции - см. НовыйТаблицаОперация
//
Функция ДанныеОтветаСервисаСтатусОперации(ДанныеОтвета)
	
	// Описание ответа сервиса - https://payapi.ozon.ru/v1/v1/getOrderDetails
	//
	
	Результат = Новый Структура;
	Результат.Вставить("Статус", "");
	Результат.Вставить("СсылкаДляОплаты", "");
	Результат.Вставить("Операции", НовыйТаблицаОперация());
	Результат.Вставить("ВнешнийИдентификатор", "");
	
	Если ДанныеОтвета = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Ответ = Новый Структура(
		"item, operations",
		ДанныеОтвета.Получить("item"),
		ДанныеОтвета.Получить("operations"));
	
	Если Ответ.item <> Неопределено Тогда
		Результат.Статус = Ответ.item.Получить("status");
		Результат.СсылкаДляОплаты = Ответ.item.Получить("payLink");
	КонецЕсли;

	Если Ответ.operations <> Неопределено Тогда
		ТипЧисло = Новый ОписаниеТипов("Число");
		Для Каждого Операция Из Ответ.operations Цикл
			
			НоваяОперация = Результат.Операции.Добавить();
			
			НоваяОперация.ВнешнийИдентификатор = Операция.Получить("extId");
			НоваяОперация.ИдентификаторТранзакции = Операция.Получить("transactionUid");
			НоваяОперация.ТипОперации = Операция.Получить("operationType");
			
			СтатусОперации = Операция.Получить("status");
			ВремяОперации  = Операция.Получить("operationTime");
			
			Если ЗначениеЗаполнено(СтатусОперации) Тогда
				НоваяОперация.СтатусОперации = ПреобразоватьСтатусОперации(СтатусОперации);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВремяОперации) Тогда
				НоваяОперация.ВремяОперации = НастройкиПлатежныхСистемСлужебный.ВосстановитьДатуJSON(
					"operationDate",
					ВремяОперации,
					Неопределено);
			КонецЕсли;
			
			СуммаОперации = Операция.Получить("amount");
			Если СуммаОперации <> Неопределено Тогда
				СуммаКопейки = СуммаОперации.Получить("value");
				Если ТипЗнч(СуммаКопейки) <> Тип("Число") Тогда
					СуммаКопейки = ТипЧисло.ПривестиЗначение(СуммаКопейки);
				КонецЕсли;
				СуммаКопейки = Окр(СуммаКопейки / 100, 2);
				
				НоваяОперация.СуммаОперации = СуммаКопейки;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подготавливает параметры запроса статуса операции
// 
// Параметры:
//  ИдентификаторОперации - Строка - внутренний идентификатор операции;
//  ДанныеАутентификации - Структура - данные аутентификации.
// 
// Возвращаемое значение:
//  см. ПлатежныеСистемыСервис.НовыйПараметрыОперацииСервисаPOST
//  
Функция ПараметрыЗапросаСтатусОперации(ИдентификаторОперации, ДанныеАутентификации)
	
	ДанныеПодписи = Новый Массив;
	ДанныеПодписи.Добавить(ИдентификаторОперации);
	ДанныеПодписи.Добавить(ДанныеАутентификации.Токен);

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("accessKey", ДанныеАутентификации.Токен);
	ПараметрыЗапроса.Вставить("id", ИдентификаторОперации);
	ПараметрыЗапроса.Вставить(
		"requestSign",
		ПодписьЗапроса(
			ДанныеПодписи,
			ДанныеАутентификации.СекретныйКлюч));
	
	Возврат ПлатежныеСистемыСервис.НовыйПараметрыОперацииСервисаPOST(
		"/getOrderDetails",
		ПараметрыЗапроса);
	
КонецФункции

#КонецОбласти

#Область ТипыОперацийСервиса

// Возвращает тип операции сервиса "Оплата".
//
// Возвращаемое значение:
//  Строка
//
Функция ТипОперацииСервисаОплата()
	
	Возврат "PAYMENT";
	
КонецФункции

// Возвращает тип операции сервиса "Возврат".
//
// Возвращаемое значение:
//  Строка
//
Функция ТипОперацииСервисаВозврат()
	
	Возврат "REFUND";
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Обрабатывает ответ сервиса с ошибкой.
// Если в РезультатЗапроса.ДанныхОтвета есть Соответствие, значит запрос дошел до банка и можно обрабатывать
// структуру ответа. Если в РезультатЗапроса.ДанныхОтвета Неопределено, значит запрос до банка не дошел.
// Ответ от нашего сервиса должен быть обработан ранее, менять данные нет смысла.
// 
// Параметры:
//  Результат - см. ПлатежныеСистемыСлужебный.НовыйРезультатСтатусОперацииСлужебный.
//  РезультатЗапроса - см. ПлатежныеСистемыСервис.ВыполнитьОперациюСервиса.
//  
Процедура ОбработатьОтветСОшибкой(Результат, РезультатЗапроса)
	
	ДанныеОшибки = Новый Структура("code, message, details");
	Если РезультатЗапроса.ДанныеОтвета <> Неопределено Тогда
		ДанныеОшибки.code = РезультатЗапроса.ДанныеОтвета.Получить("code");
		ДанныеОшибки.details = РезультатЗапроса.ДанныеОтвета.Получить("details");
		ДанныеОшибки.message = ФорматироватьСообщение(
			РезультатЗапроса.ДанныеОтвета.Получить("message"));
	КонецЕсли;
	
	Если ДанныеОшибки.code = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса);
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(Результат.ИнформацияОбОшибке, Истина);
		Возврат;
	КонецЕсли;
	
	Если ДанныеОшибки.code = 7 Или ДанныеОшибки.code = 16 Тогда
		Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйЛогинИлиПароль();
		Результат.СообщениеОбОшибке = НСтр("ru = 'Параметры подключения к Ozon Pay указаны ошибочно либо недействительны.
			|Проверьте настройки подключения.'");
		
	ИначеЕсли ДанныеОшибки.code = 5 Тогда
		
		Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиОбъектНеНайден();
		Результат.СообщениеОбОшибке = НСтр("ru = 'Не найдена операция с указанным идентификатором'");
	
	Иначе

		Детали = ДеталиОшибки(ДанныеОшибки.details);
		ЗанестиВЖурнал = Истина;
		ТекстДляПользователя = "";
		
		Если ДанныеОшибки.code = 3 Тогда
			Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйФорматЗапроса();
			Если Детали.ПревышениеСуммы Тогда
				ТекстДляПользователя = НСтр("ru = 'Сумма возврата превышает допустимую.'");
				ЗанестиВЖурнал = Ложь;
			Иначе
				ТекстДляПользователя = НСтр("ru = 'Ошибка в параметрах запроса в банк.
					|Подробности см. в журнале регистрации'");
			КонецЕсли;
		
		ИначеЕсли ДанныеОшибки.code = 9 Тогда
			Результат.КодОшибки  = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйФорматЗапроса();
			ТекстДляПользователя = НСтр("ru = 'Ошибка в параметрах запроса в банк.
				|Подробную информацию см. в журнале регистрации'");
			
		ИначеЕсли ДанныеОшибки.code = 13 Тогда
			Результат.КодОшибки  = НастройкиПлатежныхСистемСлужебный.КодОшибкиСервисВременноНеДоступен();
			ТекстДляПользователя = НСтр("ru = 'Ошибка сервиса банка.
				|Попробуйте выполнить операцию позже.
				|Если ошибка сохраниться, обратитесь в банк для решения возникшей проблемы.
				|Техническую информацию об ошибке см. в журнале регистрации'");
			
		Иначе
			Результат.КодОшибки  = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеизвестнаяОшибка();
			ТекстДляПользователя = НСтр("ru = 'Неизвестная ошибка сервиса банка.
				|Обратитесь в банк для решения возникшей проблемы.
				|Техническую информацию об ошибке см. в журнале регистрации'");
			
		КонецЕсли;

		Если ЗанестиВЖурнал И ЗначениеЗаполнено(Детали.ОшибкиЖурнал) Тогда

			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Сервис Ozon Pay вернул ошибку: 
					|Code: %1
					|Message: %2
					|Details:
					|%3
					|
					|X-Correlation-ID: %4'"),
				ДанныеОшибки.code,
				ДанныеОшибки.message,
				Детали.ОшибкиЖурнал,
				РезультатЗапроса.ИдентификаторЗапроса);
				
			ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
				ТекстОшибки,
				Истина);
			
		КонецЕсли;
		
		Результат.СообщениеОбОшибке = ТекстДляПользователя;
		
	КонецЕсли;
	
	Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
	
КонецПроцедуры

// Формирует пустую таблицу с описанием операций по заказу.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица операций:
//    * ВнешнийИдентификатор - Строка - идентификатор операции в системе продавца.
//    * ИдентификаторТранзакции - Строка - идентификатор операции в системе банка.
//    * ТипОперации - Строка - тип операции.
//    * СтатусОперации - Строка - статус операции.
//    * ВремяОперации - Дата - время выполнения операции.
//    * СуммаОперации - Число - сумма операции.
//    
Функция НовыйТаблицаОперация()
	
	Результат = Новый ТаблицаЗначений();
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	
	Результат.Колонки.Добавить("ВнешнийИдентификатор", ТипСтрока);
	Результат.Колонки.Добавить("ИдентификаторТранзакции", ТипСтрока);
	Результат.Колонки.Добавить("ТипОперации", ТипСтрока);
	Результат.Колонки.Добавить("СтатусОперации", ТипСтрока);
	Результат.Колонки.Добавить("ВремяОперации", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("СуммаОперации", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	Возврат Результат;
	
КонецФункции

// В сообщениях от Ozon Pay все сообщения идут с маленькой буквы.
// Метод меняет первую букву на заглавную и добавляет в конце точку (если требуется).
// 
// Параметры:
//  Текст - Строка - текст, который нужно обработать.
//  
// Возвращаемое значение:
//  Строка - результат преобразования.
// 
Функция ФорматироватьСообщение(Текст)

	Если Не ЗначениеЗаполнено(Текст)
		Или ТипЗнч(Текст) <> Тип("Строка") Тогда
		Возврат "";
	КонецЕсли;
	
	Текст = СокрЛП(Текст);
	Текст = ВРег(Лев(Текст, 1)) + Сред(Текст, 2);
	
	Если Прав(Текст, 1) <> "." Тогда
		Текст = Текст + ".";
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

// Разбирает значение поля details из ответ сервиса с ошибкой.
//
// Параметры:
//  Детали - Произвольный - возвращенное значение параметра.
// 
// Возвращаемое значение:
//  Структура:
//   * ОшибкиЖурнал - Строка - подробная информация об ошибках для сохранения в журнал регистрации.
//       Строки вида "code: %1; field: %2; message: %3".
//   * ОшибкиПользователь - Строка - подробная информация для вывода пользователю. Состоит из строк, включающих
//       только данные поля message.
//   * ПревышениеСуммы - Булево - Истина, если в текстах ошибки есть текст "Сумма возврата больше остатка позиции".
//       Возникает, если сумма возврата больше доступной суммы.
// 
Функция ДеталиОшибки(Детали)
	
	Результат = Новый Структура;
	Результат.Вставить("ОшибкиЖурнал", "");
	Результат.Вставить("ОшибкиПользователь", "");
	Результат.Вставить("ПревышениеСуммы", Ложь);
	
	ОшибкиЖурнал = Новый Массив;
	ОшибкиПользователь = Новый Массив;
	Если ТипЗнч(Детали) <> Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого Ошибка Из Детали Цикл
		ОписанияОшибок = Ошибка.Получить("violations");
		Если ТипЗнч(ОписанияОшибок) <> Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Описание Из ОписанияОшибок Цикл
			Поле = Описание.Получить("field");
			Код = Описание.Получить("code");
			ТекстСообщения = ФорматироватьСообщение(
				Описание.Получить("message"));
			
			Если ЗначениеЗаполнено(ТекстСообщения) Тогда
				СтрокаОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'code: %1; field: %2; message: %3'"),
					Код,
					Поле,
					ТекстСообщения);
				ОшибкиЖурнал.Добавить(СтрокаОшибки);
				
				Если ОшибкиПользователь.Найти(ТекстСообщения) = Неопределено Тогда
					ОшибкиПользователь.Добавить(ТекстСообщения);
				КонецЕсли;
				
				Если СтрНайти(ВРег(ТекстСообщения), "СУММА ВОЗВРАТА БОЛЬШЕ ОСТАТКА ПОЗИЦИИ") > 0 Тогда // АПК:1297 фиксированный текст ответа сервиса.
					Результат.ПревышениеСуммы = Истина;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Результат.ОшибкиЖурнал = СтрСоединить(ОшибкиЖурнал, Символы.ПС);
	Результат.ОшибкиПользователь = СтрСоединить(ОшибкиПользователь, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти