#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура АУ_ПередЗаписью(Отказ, Замещение)
	
	ПодразделениеПоУмолчанию = Справочники.СтруктураПредприятия.НайтиПоКоду("У1-000001");
	Для каждого стр Из ЭтотОбъект Цикл
		
		стр.Подразделение = ПодразделениеПоУмолчанию;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
