
#Область ОписаниеПеременных

&НаКлиенте
Перем ХронологияПереключенияСтраниц;	// Массив из ГруппаФормы

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ТорговыеПредложения") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка прав доступа.
	МодульТорговыеПредложения = ОбщегоНазначения.ОбщийМодуль("ТорговыеПредложения");
	Если Не МодульТорговыеПредложения.ПравоСозданияЗаказовПоставщику() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗапросКоммерческихПредложений = Параметры.ЗапросКоммерческихПредложений;
	РеквизитыЗапросаКП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗапросКоммерческихПредложений, "Организация, Валюта,
	|	ПроведениеОпроса, УчетнаяЗапись, Налогообложение, ЦенаВключаетНДС");
	
	Организация = РеквизитыЗапросаКП.Организация;
	Валюта = РеквизитыЗапросаКП.Валюта;
	Налогообложение = РеквизитыЗапросаКП.Налогообложение;
	ЦенаВключаетНДС = РеквизитыЗапросаКП.ЦенаВключаетНДС;
	Опрос = РеквизитыЗапросаКП.ПроведениеОпроса;
	УчетнаяЗапись = РеквизитыЗапросаКП.УчетнаяЗапись;
	Элементы.ДокументыПоставщиковСуммаДокумента.Заголовок = НСтр("ru = 'Сумма'") + " " + СокрЛП(Валюта);
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ИнтеграцияСЭлектроннымиТорговымиПлощадками") Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
	КонецЕсли;
	
	ЕстьРаботаСНоменклатурой = ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.РаботаСНоменклатурой");
	
	Если ЕстьРаботаСНоменклатурой Тогда
		
		ИмяСправочника = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника("Номенклатура");
		
		Если Не ЗначениеЗаполнено(ИмяСправочника) Тогда
			ЕстьРаботаСНоменклатурой = Ложь;
		Иначе
			Тип = Тип("СправочникСсылка." + ИмяСправочника);
			ТипМетаданных = Метаданные.НайтиПоТипу(Тип);
			
			Если ПравоДоступа("Изменение", ТипМетаданных) Тогда
				МодульРаботаСНоменклатурой = ОбщегоНазначения.ОбщийМодуль("РаботаСНоменклатурой");
				Настройки = МодульРаботаСНоменклатурой.НастройкиПодсистемы();
				ИспользоватьВидыНоменклатуры = Настройки.ИспользоватьВидыНоменклатуры;
			Иначе
				ЕстьРаботаСНоменклатурой = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьРаботаСНоменклатурой Тогда
		МодульРаботаСНоменклатурой = ОбщегоНазначения.ОбщийМодуль("РаботаСНоменклатурой");
		Настройки = МодульРаботаСНоменклатурой.НастройкиПодсистемы();
		
		ДоступенПакетныйРежимСозданияНоменклатуры = Настройки.ИспользоватьПакетноеСозданиеНоменклатуры;
	КонецЕсли;
	
	ОтборСопоставленияНоменклатуры = "Все";
	
	УстановитьВидимостьДоступностьЭлементовФормы();
	
	// Установка типов для элементов форм.
	ИмяСправочника = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника("Номенклатура");
	ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка." + ИмяСправочника);
	Элементы.ТоварыНоменклатура.ОграничениеТипа = ОграничениеТипа;
	
	ИмяСправочника = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника("ХарактеристикиНоменклатуры");
	ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка." + ИмяСправочника);
	Элементы.ТоварыХарактеристика.ОграничениеТипа = ОграничениеТипа;
	
	ИмяСправочника = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника("ФизическиеЛица");
	Если ИмяСправочника = Неопределено Тогда
		ОграничениеТипа = Новый ОписаниеТипов("Строка");
	Иначе
		ОграничениеТипа = Новый ОписаниеТипов("Строка, СправочникСсылка." + ИмяСправочника);
	КонецЕсли;
	
	ИмяСправочника = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника("ЕдиницыИзмерения");
	ОграничениеТипа = Новый ОписаниеТипов("Строка, СправочникСсылка." + ИмяСправочника);
	Элементы.ТоварыЕдиницаИзмерения.ОграничениеТипа = ОграничениеТипа;
	
	НастройкиУчета = КоммерческиеПредложенияДокументы.НастройкиУчета();
	Элементы.ТоварыХарактеристика.Видимость = НастройкиУчета.ИспользуютсяХарактеристикиНоменклатуры;
	УстановитьХарактеристикиИспользуются();
	
	ИнтеграцияСЭлектроннымиТорговымиПлощадкамиПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ХронологияПереключенияСтраниц = Новый Массив;
	СменитьСтраницуШаги(Элементы.СтраницаКонтрагенты);
	ПерейтиНаСледующийШаг("ОткрытиеФормы");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы И Не ВыполняетсяЗакрытие
		И Не Элементы.Шаги.ТекущаяСтраница = Элементы.СтраницаСозданныеДокументы Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
						НСтр("ru = 'Формирование документов будет прервано. Продолжить?'"),
						РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСопоставленияНоменклатурыПриИзменении(Элемент)

	Если ОтборСопоставленияНоменклатуры = "Сопоставленные" Тогда
		ОтборСтрок = Новый Структура("ТоварнаяПозицияСопоставлена", Истина);
	ИначеЕсли ОтборСопоставленияНоменклатуры = "Несопоставленные" Тогда
		ОтборСтрок = Новый Структура("ТоварнаяПозицияСопоставлена", Ложь);
	Иначе
		ОтборСтрок = Новый Структура;
	КонецЕсли;
	
	Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменятьНоменклатуруКоммерческихПредложенийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДанныеНоменклатурыИБ.ТолькоПросмотр = Не ИзменятьНоменклатуруКоммерческихПредложений
		И ЗначениеЗаполнено(ТекущиеДанные.КоммерческоеПредложение);
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменятьКонтрагентаКоммерческихПредложенийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Контрагенты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КонтрагентыКонтрагент.ТолькоПросмотр = Не ИзменятьКонтрагентаКоммерческихПредложений
		И ЗначениеЗаполнено(ТекущиеДанные.КоммерческоеПредложение);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	
	Если ИмяЭлемента <> "ТоварыНоменклатура" И ИмяЭлемента <> "ТоварыХарактеристика" И ИмяЭлемента <> "ТоварыЕдиницаИзмерения" Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДанныеНоменклатурыИБ.ТолькоПросмотр = Не ИзменятьНоменклатуруКоммерческихПредложений
		И ЗначениеЗаполнено(ТекущиеДанные.КоммерческоеПредложение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ЗаполнитьДанныеСтрокиПоНоменклатуре(ТекущиеДанные);
	Иначе
		ОчиститьДанныеСтрокиПоНоменклатуре(ТекущиеДанные);
	КонецЕсли;
	
	ТекущиеДанные.Изменение = ЗначениеЗаполнено(ТекущиеДанные.КоммерческоеПредложение);
	
	ТекущиеДанные.ТоварнаяПозицияСопоставлена = ЗначениеЗаполнено(ТекущиеДанные.Номенклатура);
	УстановитьЕдиницаИзмеренияВнимание(ТекущиеДанные);
	
	Если ТекущиеДанные.ТоварнаяПозицияСопоставлена Тогда
			
		ПараметрыОтбора = Новый Структура("Номенклатура, Идентификатор",
			ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"), ТекущиеДанные.Идентификатор);
			
		НайденныеСтроки = Товары.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			СтрокаИсточник = Новый Структура;
			СтрокаИсточник.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
			СтрокаИсточник.Вставить("ХарактеристикиИспользуются", ТекущиеДанные.ХарактеристикиИспользуются);
			СтрокаИсточник.Вставить("Характеристика", ТекущиеДанные.Характеристика);
			СтрокаИсточник.Вставить("ЕдиницаИзмерения", ТекущиеДанные.ЕдиницаИзмерения);
			СтрокаИсточник.Вставить("ТоварнаяПозицияСопоставлена", ТекущиеДанные.ТоварнаяПозицияСопоставлена);
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("СтрокиТовары", НайденныеСтроки);
			ДополнительныеПараметры.Вставить("СтрокаИсточник", СтрокаИсточник);
			
			ТекстВопроса = НСтр("ru = 'Найдены строки с аналогичной номенклатурой торговой площадки. Заполнить в них номенклатуру аналогичным значением?'");
			ПоказатьВопрос(Новый ОписаниеОповещения("ТоварыНоменклатураПриИзмененииЗавершение", ЭтотОбъект, ДополнительныеПараметры),
				ТекстВопроса, РежимДиалогаВопрос.ДаНет);
				
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСопоставленныеПозиции(Элементы.ОтборСопоставленияНоменклатуры.СписокВыбора, Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Изменение = ЗначениеЗаполнено(ТекущиеДанные.КоммерческоеПредложение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ТоварнаяПозицияСопоставлена = ЗначениеЗаполнено(ТекущиеДанные.Номенклатура);
	УстановитьЕдиницаИзмеренияВнимание(ТекущиеДанные);
	
	ТекущиеДанные.Изменение = ЗначениеЗаполнено(ТекущиеДанные.КоммерческоеПредложение);
	
	ОбновитьСопоставленныеПозиции(Элементы.ОтборСопоставленияНоменклатуры.СписокВыбора, Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураСоздание(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или Не ЕстьРаботаСНоменклатурой Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Типы = Элементы.ТоварыНоменклатура.ОграничениеТипа.Типы();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("КодЕдиницыИзмерения"           , ТекущиеДанные.КодЕдиницыИзмерения);
	ДанныеЗаполнения.Вставить("ПредставлениеЕдиницыИзмерения" , ТекущиеДанные.ПредставлениеЕдиницыИзмеренияВСервисе);
	ДанныеЗаполнения.Вставить("СтавкаНДС"                     , ТекущиеДанные.СтавкаНДС);
	ДанныеЗаполнения.Вставить("Наименование"                  , ТекущиеДанные.ПредставлениеНоменклатурыВСервисе);
	ДанныеЗаполнения.Вставить("ВидНоменклатуры"               , ТекущиеДанные.ВидНоменклатуры);
	ДанныеЗаполнения.Вставить("Артикул"                       , ТекущиеДанные.Артикул);
	ДанныеЗаполнения.Вставить("ЧислительУпаковки"             , ТекущиеДанные.ЧислительУпаковки);
	ДанныеЗаполнения.Вставить("Идентификатор"                 , ТекущиеДанные.ИдентификаторНоменклатурыСервиса);
	
	Результат = ПолучитьПараметрыОткрытияФормыНоменклатуры(Типы, ДанныеЗаполнения);
	
	ОткрытьФорму(Результат.ИмяФормыСоздания, Результат.ПараметрыОткрытия, Элементы.ТоварыНоменклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Поле.Имя = "ТоварыНаименованиеКонтрагента" Тогда
		НавигационнаяСсылка = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиент.СтрокаПодключенияКСервису(УчетнаяЗапись,
			ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели()) + "/companies/view/"
			+ ТекущиеДанные.ИдентификаторКонтрагента;
		ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
		
	ИначеЕсли Поле.Имя = "ТоварыКоммерческоеПредложение" Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.КоммерческоеПредложение);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыПоставщиков

&НаКлиенте
Процедура ДокументыПоставщиковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.ДокументыПоставщиков.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Поле.Имя = "ДокументыПоставщиковЗаказ" И ТекущиеДанные.ЗаказСоздан Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.Заказ);
	ИначеЕсли Поле.Имя = "ДокументыПоставщиковКоммерческоеПредложение" И ТекущиеДанные.КоммерческоеПредложениеСоздано Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.КоммерческоеПредложение);
	ИначеЕсли Поле.Имя = "ДокументыПоставщиковКонтрагент" Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.Контрагент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоставщиковЗаказОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоставщиковКоммерческоеПредложениеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКонтрагенты

&НаКлиенте
Процедура КонтрагентыКонтрагентСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Контрагенты.ТекущиеДанные;

	ИмяФормыНовогоКонтрагента = ИмяФормыКонтрагента(ТипЗнч(ТекущиеДанные.Контрагент));

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Наименование", ТекущиеДанные.НаименованиеКонтрагента);
	ДанныеЗаполнения.Вставить("НаименованиеПолное", ТекущиеДанные.НаименованиеКонтрагента);
	ДанныеЗаполнения.Вставить("ИНН", ТекущиеДанные.ИНН);
	ДанныеЗаполнения.Вставить("КПП", ТекущиеДанные.КПП);
	
	ПараметрыФормы = Новый Структура;
	КлючДанныхЗаполнения = "СтруктураЗаполнения";
	КоммерческиеПредложенияДокументыКлиентПереопределяемый.УстановитьКлючДанныхЗаполненияПриСозданииКонтрагента(
		КлючДанныхЗаполнения);
	ПараметрыФормы.Вставить(КлючДанныхЗаполнения, ДанныеЗаполнения);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму(ИмяФормыНовогоКонтрагента, ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыНаименованиеКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыНаименованиеКонтрагентаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Контрагенты.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "КонтрагентыНаименованиеКонтрагента" Тогда
		НавигационнаяСсылка = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиент.СтрокаПодключенияКСервису(УчетнаяЗапись,
			ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели()) + "/companies/view/"
			+ ТекущиеДанные.ИдентификаторКонтрагента;
		ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
	ИначеЕсли Поле.Имя = "КонтрагентыКоммерческоеПредложение" Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.КоммерческоеПредложение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Контрагенты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Контрагент = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыКонтрагентПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	ТекущиеДанные = Элементы.Контрагенты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Изменение = ЗначениеЗаполнено(ТекущиеДанные.КоммерческоеПредложение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Контрагенты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КонтрагентыКонтрагент.ТолькоПросмотр = Не ИзменятьКонтрагентаКоммерческихПредложений
		И ЗначениеЗаполнено(ТекущиеДанные.КоммерческоеПредложение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКоммерческиеПредложения
&НаКлиенте
Процедура КоммерческиеПредложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.КоммерческиеПредложения.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Поле.Имя = "КоммерческиеПредложенияКонтрагент" Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.Контрагент);
	ИначеЕсли Поле.Имя = "КоммерческиеПредложенияКоммерческоеПредложение" И ЗначениеЗаполнено(ТекущиеДанные.КоммерческоеПредложение) Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.КоммерческоеПредложение);
	ИначеЕсли Поле.Имя = "КоммерческиеПредложенияАнкета" И ЗначениеЗаполнено(ТекущиеДанные.Анкета) Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.Анкета);
	ИначеЕсли Поле.Имя = "КоммерческиеПредложенияЕстьОшибка" И ЗначениеЗаполнено(ТекущиеДанные.ТекстОшибки) Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтраницаДлительнаяОперация

&НаКлиенте
Процедура ПовторитьТекущуюДлительнуюОперацию(Команда)
	
	Если Не ПустаяСтрока(ТекущийШаг) И Не ПустаяСтрока(СледующийШаг) Тогда
		ВыполнитьДлительнуюОперацию("", Элементы[ТекущийШаг], Элементы[СледующийШаг]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыНавигации

&НаКлиенте
Процедура Готово(Команда)
	
	ПриОтветеНаВопросОбИзмененииСостоянияДокумента = Новый ОписаниеОповещения("ГотовоЗавершение", ЭтотОбъект);
	
	Если КоличествоСозданныхЗаказов > 0 Или (Не Параметры.ИспользоватьЗаказыПоставщикам
		И ДокументыПоставщиков.Количество() > 0) Тогда
		ТекстВопроса = НСтр("ru = 'Документы созданы. Завершить запрос ?'");
		ПоказатьВопрос(ПриОтветеНаВопросОбИзмененииСостоянияДокумента, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(ПриОтветеНаВопросОбИзмененииСостоянияДокумента, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)

	ПерейтиНаСледующийШаг();

КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)

	ОтменитьАктивныеФоновыеОперации();

	ВернутьсяНаПредыдущуюСтраницу();

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ОтменитьАктивныеФоновыеОперации();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТабличнаяЧастьКонтрагенты

&НаСервере
Процедура ДополнитьТаблицуКонтрагентов(ДанныеДляЗаполнения)
	
	// Индексируем массив данных участников закупочной процедуры, полученный с торговой площадки
	ДанныеКонтрагентов = Новый Соответствие;
	Для Каждого ДанныеКонтрагента Из ДанныеДляЗаполнения Цикл
		ДанныеКонтрагентов.Вставить(ДанныеКонтрагента.ИдентификаторКонтрагента, ДанныеКонтрагента);
	КонецЦикла;
	
	// Получаем список ранее сопоставленных контрагентов и коммерческих предложений 1С и торговой площадки
	СопоставленныеДанныеИБ = Новый Соответствие;
	
	// Получаем информацию из ранее загруженных коммерческих предложений по данному ЗКП
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КоммерческоеПредложениеПоставщика.Контрагент КАК Контрагент,
	|	КоммерческоеПредложениеПоставщика.ИдентификаторВСервисе КАК ИдентификаторВСервисе,
	|	КоммерческоеПредложениеПоставщика.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КоммерческоеПредложениеПоставщика КАК КоммерческоеПредложениеПоставщика
	|ГДЕ
	|	КоммерческоеПредложениеПоставщика.ДокументОснование = &ДокументОснование
	|	И КоммерческоеПредложениеПоставщика.ИдентификаторВСервисе В (&ИдентификаторыВСервисе)
	|	И НЕ КоммерческоеПредложениеПоставщика.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ЗапросКоммерческихПредложений);
	Запрос.УстановитьПараметр("ИдентификаторыВСервисе", Контрагенты.Выгрузить(,"ИдентификаторПредложенияСервиса").ВыгрузитьКолонку("ИдентификаторПредложенияСервиса"));
	
	РезультатЗапроса = Запрос.Выполнить();
	// Индексируем список сопоставленных контрагентов
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДанных = Новый Структура("Ссылка, Контрагент", Выборка.Ссылка, Выборка.Контрагент);
		СопоставленныеДанныеИБ.Вставить(Выборка.ИдентификаторВСервисе, СтруктураДанных);
	КонецЦикла;
	
	// Дополняем таблицу контрагентов данными с торговой площадки и ранее созданными коммерческими предложениями
	Для Каждого СтрокаКонтрагенты Из Контрагенты Цикл
		ДанныеКонтрагента = ДанныеКонтрагентов.Получить(СтрокаКонтрагенты.ИдентификаторКонтрагента);
		Если ДанныеКонтрагента <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаКонтрагенты, ДанныеКонтрагента);
			СтрокаКонтрагенты.НаименованиеКонтрагента = ДанныеКонтрагента["Наименование"];
			СтрокаКонтрагенты.Email = ДанныеКонтрагента.КонтактEmail;
			СтрокаКонтрагенты.Телефон = ДанныеКонтрагента.КонтактТелефон;
		КонецЕсли;
		
		ДанныеИБ = СопоставленныеДанныеИБ.Получить(СтрокаКонтрагенты.ИдентификаторПредложенияСервиса);
		Если ДанныеИБ <> Неопределено Тогда
			СтрокаКонтрагенты.Контрагент = ДанныеИБ.Контрагент;
			СтрокаКонтрагенты.КоммерческоеПредложение = ДанныеИБ.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКонтрагентовПоДаннымПредложения(ДанныеДляЗаполнения)
	
	Контрагенты.Очистить();
	Для Каждого ДанныеПредложения Из ДанныеДляЗаполнения Цикл
		Если ДанныеПредложения.ЭтоПобедитель Тогда
			НоваяСтрока = Контрагенты.Добавить();
			НоваяСтрока.ИдентификаторПредложенияСервиса = ДанныеПредложения.ИдентификаторПредложения;
			НоваяСтрока.ИдентификаторКонтрагента = ДанныеПредложения.ИдентификаторКонтрагента;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьИзменнныеСтрокиТаблицыКонтрагентов(Знач Контрагенты)
	
	ПараметрыПоиска = Новый Структура("Изменение", Истина);
	НайденныеСтроки = Контрагенты.НайтиСтроки(ПараметрыПоиска);
	
	Возврат НайденныеСтроки.Количество() > 0;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиНаШагТоварыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СтраницаКомандНавигации = Неопределено;
		
		ХронологияПереключенияСтраниц.Добавить(Элементы.СтраницаКонтрагенты);
		СледующаяСтраница  = Элементы.СтраницаТовары;
		Элементы.Далее2.Заголовок = "Загрузить коммерческие предложения >";
		Элементы.Далее2.Доступность = Истина;
		
		ДополнитьТаблицуТоваровДаннымиКонтрагентов();
		
		СменитьСтраницуШаги(СледующаяСтраница);
		СменитьСтраницуКомандНавигации(СтраницаКомандНавигации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполненияСтраницаКонтрагенты(Отказ)

	Для ТекИндекс = 0 По Контрагенты.Количество() - 1 Цикл

		ТекущаяСтрока = Контрагенты[ТекИндекс];

		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Контрагент) Тогда

			ТекстШаблонаОшибки = НСтр("ru='Не заполнено поле %1 в строке %2.'");
			ТекстОшибки = СтрШаблон(ТекстШаблонаОшибки, Элементы.КонтрагентыКонтрагент.Заголовок, ТекИндекс + 1);

			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"Контрагенты", ТекИндекс + 1, "Контрагент"), , Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ТабличнаяЧастьТовары

&НаСервере
Процедура ДополнитьТаблицуТоваровДаннымиКонтрагентов()
	
	КонтрагентыПоИдентификаторам = Новый Соответствие;
	Для Каждого СтрокаКонтрагенты Из Контрагенты Цикл
		ДанныеКонтрагента = Новый Структура("Ссылка, Наименование", СтрокаКонтрагенты.Контрагент, СтрокаКонтрагенты.НаименованиеКонтрагента);
		КонтрагентыПоИдентификаторам.Вставить(СтрокаКонтрагенты.ИдентификаторКонтрагента, ДанныеКонтрагента);
	КонецЦикла;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		ДанныеКонтрагента = КонтрагентыПоИдентификаторам.Получить(СтрокаТовары.ИдентификаторКонтрагента);
		Если ДанныеКонтрагента <> Неопределено Тогда
			СтрокаТовары.Контрагент = ДанныеКонтрагента.Ссылка;
			СтрокаТовары.НаименованиеКонтрагента = ДанныеКонтрагента.Наименование;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТоваровИФайлов(ДанныеДляЗаполнения)

	Товары.Очистить();
	ФайлыПоставщиков.Очистить();
	
	РеквизитыЗКП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗапросКоммерческихПредложений, "Товары");
	ТоварыЗКП = РеквизитыЗКП.Товары.Выгрузить();
	
	ДанныеТоваровЗКП = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ТоварыЗКП.ВыгрузитьКолонку("Номенклатура"),
		"ВидНоменклатуры, ЕдиницаИзмерения");
		
	ТоварыПодготовка = Товары.Выгрузить();
	ТоварыПодготовка.Очистить();
	ТоварыПодготовка.Индексы.Добавить("НомерСтроки");
	
	Для Каждого ДанныеПредложения Из ДанныеДляЗаполнения Цикл
	
		Для Каждого ДанныеНоменклатуры Из ДанныеПредложения.ТоварыИУслуги Цикл
			
			Если ДанныеНоменклатуры.КоличествоПобедителя = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТоварыЗКП = ТоварыЗКП.Найти(ДанныеНоменклатуры.ИдентификаторПозиции, "ИдентификаторСтрокиЗапроса");
			
			НС = ТоварыПодготовка.Добавить();
			
			Если ЗначениеЗаполнено(СтрокаТоварыЗКП) Тогда
				ЗаполнитьЗначенияСвойств(НС, СтрокаТоварыЗКП);
				НС.ХарактеристикиИспользуются = ЗначениеЗаполнено(НС.Характеристика);
			КонецЕсли;
			
			НС.ИдентификаторНоменклатурыСервиса = СтрокаТоварыЗКП.НоменклатураВСервисеИдентификатор;
			НС.ИдентификаторКатегории = СтрокаТоварыЗКП.КатегорияВСервисеИдентификатор;
			
			ДанныеТовараЗКП = ДанныеТоваровЗКП[НС.Номенклатура];
			Если ЗначениеЗаполнено(ДанныеТовараЗКП) Тогда
				ИсключаяСвойства = ?(ЗначениеЗаполнено(НС.ЕдиницаИзмерения), "ЕдиницаИзмерения", "");
				ЗаполнитьЗначенияСвойств(НС, ДанныеТовараЗКП, , ИсключаяСвойства);
			КонецЕсли;
			
			НС.ИдентификаторПредложенияСервиса = ДанныеПредложения.ИдентификаторПредложения;
			НС.ИдентификаторКонтрагента = ДанныеПредложения.ИдентификаторКонтрагента;
			
			НС.Идентификатор = ДанныеНоменклатуры.ИдентификаторПозиции;
			НС.ПредставлениеНоменклатурыВСервисе = ДанныеНоменклатуры["Наименование"];
			НС.ПредставлениеЕдиницыИзмеренияВСервисе = ДанныеНоменклатуры.ПредставлениеЕдиницыИзмерения;
			НС.Количество = ДанныеНоменклатуры.КоличествоПобедителя;
			НС.Цена = ДанныеНоменклатуры.ЦенаУчастника;
			НС.Сумма = НС.Количество * НС.Цена;
			Если Налогообложение Тогда
				НС.СтавкаНДС = ФорматыЭДОПовтИсп.СтавкаНДСИзПредставления(ДанныеНоменклатуры.СтавкаНДС);
				Если ОбщегоНазначения.ПодсистемаСуществует("КлиентЭДО") Тогда
					МодульКлиентЭДОКлиентСервер = ОбщегоНазначения.ОбщийМодуль("КлиентЭДОКлиентСервер");
					ЗначениеСтавки = МодульКлиентЭДОКлиентСервер.ПолучитьСтавкуНДСЧислом(НС.СтавкаНДС);
					Если ЦенаВключаетНДС Тогда
						НС.СуммаНДС = НС.Сумма * ЗначениеСтавки / (1 + ЗначениеСтавки);
					Иначе
						НС.СуммаНДС = НС.Сумма * ЗначениеСтавки;
				КонецЕсли;
			КонецЕсли;
			НС.ЦенаВключаетНДС = ЦенаВключаетНДС;
			КоммерческиеПредложенияДокументыКлиентСерверПереопределяемый.УстановитьПараметрыСтрокиТоваровПриЗагрузкеИтоговБидзаар(
				НС, ДанныеНоменклатуры);
			Иначе
				НС.СтавкаНДС = ФорматыЭДОПовтИсп.СтавкаНДСИзПредставления(Неопределено);
			КонецЕсли;
			НС.СуммаСНДС = НС.Сумма + ?(ЦенаВключаетНДС, 0, НС.СуммаНДС);
			
			НС.ТоварнаяПозицияСопоставлена = ЗначениеЗаполнено(НС.Номенклатура);
			УстановитьЕдиницаИзмеренияВнимание(НС);
			
		КонецЦикла;
		
		Для Каждого ОписаниеФайла Из ДанныеПредложения.ОписанияФайлов Цикл
			СтрокаФайлы = ФайлыПоставщиков.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаФайлы, ОписаниеФайла);
			СтрокаФайлы.ИдентификаторСервиса = ОписаниеФайла["Идентификатор"];
			СтрокаФайлы.ИдентификаторПредложенияСервиса = ДанныеПредложения.ИдентификаторПредложения;
		КонецЦикла;
	
	КонецЦикла;

	// Сопоставить по данным существующих коммерческих предложений
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.ИдентификаторПредложенияСервиса КАК ИдентификаторПредложенияСервиса,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Идентификатор КАК Идентификатор,
	|	Товары.ИдентификаторНоменклатурыСервиса КАК ИдентификаторНоменклатурыСервиса,
	|	Товары.ИдентификаторХарактеристикиСервиса КАК ИдентификаторХарактеристикиСервиса
	|ПОМЕСТИТЬ врТовары
	|ИЗ
	|	&Товары КАК Товары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдентификаторПредложенияСервиса,
	|	Идентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументКП.ИдентификаторВСервисе КАК ИдентификаторВСервисе,
	|	ДокументКП.Ссылка КАК КоммерческоеПредложение,
	|	тчТовары.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
	|	тчТовары.Номенклатура КАК Номенклатура,
	|	тчТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	тчТовары.Характеристика КАК Характеристика,
	|	тчТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ врТоварыКП
	|ИЗ
	|	Документ.КоммерческоеПредложениеПоставщика КАК ДокументКП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КоммерческоеПредложениеПоставщика.Товары КАК тчТовары
	|		ПО (тчТовары.Ссылка = ДокументКП.Ссылка)
	|ГДЕ
	|	ДокументКП.ДокументОснование = &ДокументОснование
	|	И НЕ ДокументКП.ПометкаУдаления
	|	И тчТовары.Ссылка ЕСТЬ НЕ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдентификаторВСервисе,
	|	ИдентификаторСтрокиЗапроса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	врТовары.НомерСтроки КАК НомерСтроки,
	|	врТоварыКП.Номенклатура КАК Номенклатура,
	|	врТоварыКП.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	врТоварыКП.Характеристика КАК Характеристика,
	|	врТоварыКП.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	врТоварыКП.КоммерческоеПредложение КАК КоммерческоеПредложение,
	|	врТовары.ИдентификаторПредложенияСервиса КАК ИдентификаторПредложенияСервиса
	|ИЗ
	|	врТоварыКП КАК врТоварыКП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ врТовары КАК врТовары
	|		ПО (врТовары.ИдентификаторПредложенияСервиса = врТоварыКП.ИдентификаторВСервисе)
	|			И (врТовары.Идентификатор = врТоварыКП.ИдентификаторСтрокиЗапроса)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	врТовары.НомерСтроки КАК НомерСтроки,
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.Номенклатура КАК Номенклатура,
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.Характеристика КАК Характеристика
	|ИЗ
	|	врТовары КАК врТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыРаботаСНоменклатурой КАК СоответствиеНоменклатурыРаботаСНоменклатурой
	|		ПО врТовары.ИдентификаторНоменклатурыСервиса = СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторНоменклатурыСервиса
	|			И врТовары.ИдентификаторХарактеристикиСервиса = СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторХарактеристикиСервиса
	|ГДЕ
	|	НЕ (врТовары.ИдентификаторПредложенияСервиса, врТовары.Идентификатор) В
	|				(ВЫБРАТЬ
	|					врТоварыКП.ИдентификаторВСервисе,
	|					врТоварыКП.ИдентификаторСтрокиЗапроса
	|				ИЗ
	|					врТоварыКП)
	|	И СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторНоменклатурыСервиса ЕСТЬ НЕ NULL ";
	
	Запрос.УстановитьПараметр("Товары", ТоварыПодготовка.Скопировать(,"НомерСтроки, Идентификатор, ИдентификаторНоменклатурыСервиса, ИдентификаторХарактеристикиСервиса, ИдентификаторПредложенияСервиса"));
	Запрос.УстановитьПараметр("ДокументОснование", ЗапросКоммерческихПредложений);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		// Сопоставим номенклатуру из ранее заполненных коммерческих предложений.
		ПараметрыОтбора = Новый Структура("НомерСтроки", Выборка.НомерСтроки);
		НайденныеСтроки = ТоварыПодготовка.НайтиСтроки(ПараметрыОтбора);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока, Выборка,,"КоммерческоеПредложение, ИдентификаторПредложенияСервиса");
			НайденнаяСтрока.ТоварнаяПозицияСопоставлена = Истина;
			Если НайденнаяСтрока.ИдентификаторПредложенияСервиса = Выборка.ИдентификаторПредложенияСервиса Тогда
				НайденнаяСтрока.КоммерческоеПредложение = Выборка.КоммерческоеПредложение;
			КонецЕсли;
			
			УстановитьЕдиницаИзмеренияВнимание(НайденнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыОтбора = Новый Структура("НомерСтроки", Выборка.НомерСтроки);
		НайденныеСтроки = ТоварыПодготовка.НайтиСтроки(ПараметрыОтбора);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока, Выборка);
			НайденнаяСтрока.ТоварнаяПозицияСопоставлена = Истина;
		КонецЦикла;
	КонецЦикла;
	
	// Пересчет ставки НДС
	КэшированныеЗначенияСлужебные = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Дата", ТекущаяДатаСеанса());
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("НалогообложениеНДС",
		КоммерческиеПредложенияДокументыКлиентСерверУТ.НалогообложениеНДСПоНалогообложениюКоммерческихПредложений(Налогообложение));
	ПараметрыФормы.Вставить("ЦенаВключаетНДС", ЦенаВключаетНДС);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("СкорректироватьСтавкуНДС",
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ПараметрыФормы, Истина, Ложь));
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТоварыПодготовка, СтруктураДействий, КэшированныеЗначенияСлужебные);
	
	// Пересчет Суммы НДС и Суммы с НДС в строках с измененной ставкой НДС
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВТЧ(ПараметрыФормы);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		КэшированныеЗначенияСлужебные.ОбработанныеСтроки,
		СтруктураДействий,
		ТоварыПодготовка,
		КэшированныеЗначенияСлужебные);
	
	// Отображение подготовленных данных на форме
	Товары.Загрузить(ТоварыПодготовка);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу");
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ИмяФормы, "Товары"));
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		Товары,
		СтруктураДействий,
		Товары);
	
	ОбновитьСопоставленныеПозиции(Элементы.ОтборСопоставленияНоменклатуры.СписокВыбора, Товары);
	
	СуммаНДС = Товары.Итог("СуммаНДС");
	СуммаВсего = Товары.Итог("СуммаСНДС");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеБазовойЕдиницыИзмерения(Номенклатура)
	
	Возврат СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ЕдиницаИзмерения"));
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДанныеСтрокиПоНоменклатуре(ТекущиеДанные)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущиеДанные.Характеристика);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, Неопределено);
	
	Реквизиты = РеквизитыНоменклатуры(ТекущиеДанные.Номенклатура);
	ТекущиеДанные.ЕдиницаИзмерения           = Реквизиты.ЕдиницаИзмерения;
	
	Если ЕстьРаботаСНоменклатурой Тогда 
		
		ВидНоменклатуры  = ПолучитьВидНоменклатуры(ТекущиеДанные.Номенклатура);
		
		Отбор = Новый Структура("ИдентификаторКатегории, ВидНоменклатуры", ТекущиеДанные.ИдентификаторКатегории, Неопределено);
		НайденныеСтроки = Товары.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ВидНоменклатуры) Тогда
				СтрокаТЧ.ВидНоменклатуры = ВидНоменклатуры;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеСтрокиПоНоменклатуре(ТекущиеДанные)
	
	Если ЕстьРаботаСНоменклатурой Тогда
		
		// Очистка видов номенклатуры заполненных автоматически.
		Отбор = Новый Структура("ИдентификаторКатегории, ВидНоменклатуры", 
			ТекущиеДанные.ИдентификаторКатегории, ТекущиеДанные.ВидНоменклатуры);
		
		НайденныеСтроки = Товары.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
				СтрокаТЧ.ВидНоменклатуры = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

	ТекущиеДанные.ХарактеристикиИспользуются = Ложь;
	ТекущиеДанные.ЕдиницаИзмерения           = Неопределено;
	ТекущиеДанные.ВидНоменклатуры            = Неопределено;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьИзменнныеСтрокиТаблицыТоваров(Знач Товары)
	
	ПараметрыПоиска = Новый Структура("Изменение", Истина);
	НайденныеСтроки = Товары.НайтиСтроки(ПараметрыПоиска);
	
	Возврат НайденныеСтроки.Количество() > 0;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиНаШагКоммерческиеПредложенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ХронологияПереключенияСтраниц.Добавить(Элементы.СтраницаТовары);
		СледующаяСтраница  = Элементы.СтраницаКоммерческиеПредложения;
		Элементы.Далее2.Заголовок = "Создать заказы поставщикам >";
		
		ВыполнитьДлительнуюОперацию("", Элементы.Шаги.ТекущаяСтраница, СледующаяСтраница);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполненияСтраницаТовары(Отказ)

	ПроверкаСпискаТоваров(Отказ, ЕстьРаботаСНоменклатурой);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЕдиницаИзмеренияВнимание(СтрокаТовары)
	
	Если ЗначениеЗаполнено(СтрокаТовары.ЕдиницаИзмерения) Тогда
		СтрокаТовары.ЕдиницаИзмеренияВнимание = Строка(СтрокаТовары.ЕдиницаИзмерения) <> СтрокаТовары.ПредставлениеЕдиницыИзмеренияВСервисе;
	ИначеЕсли ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
		ПредставлениеБазовойЕИ = ПолучитьПредставлениеБазовойЕдиницыИзмерения(СтрокаТовары.Номенклатура);
		СтрокаТовары.ЕдиницаИзмеренияВнимание = ПредставлениеБазовойЕИ <> СтрокаТовары.ПредставлениеЕдиницыИзмеренияВСервисе И ПредставлениеБазовойЕИ <> "";
	Иначе
		СтрокаТовары.ЕдиницаИзмеренияВнимание = Ложь;
	КонецЕсли;
КонецПроцедуры
		
#КонецОбласти

&НаСервере
Процедура ЗаполнитьТаблицуОтветовНаВопросы(ДанныеДляЗаполнения)
	
	ОтветыНаВопросы.Очистить();
	
	Если Опрос.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеИзСервиса = Новый ТаблицаЗначений;
	ДанныеИзСервиса.Колонки.Добавить("ИдентификаторПредложенияСервиса", Новый ОписаниеТипов("Строка"));
	
	ОписанияОтветовПоЗапросам = Новый Соответствие;
	
	Для Каждого ДанныеПредложения Из ДанныеДляЗаполнения Цикл
	
		НоваяСтрока = ДанныеИзСервиса.Добавить();
		НоваяСтрока.ИдентификаторПредложенияСервиса = ДанныеПредложения.ИдентификаторПредложения;
		
		ОписанияОтветовПоЗапросам.Вставить(НоваяСтрока.ИдентификаторПредложенияСервиса, ДанныеПредложения.ОтветыНаВопросы);
		
	КонецЦикла;
	
	РеквизитыОпроса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Опрос, "ШаблонАнкеты");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеИзСервиса.ИдентификаторПредложенияСервиса КАК ИдентификаторПредложенияСервиса
	|ПОМЕСТИТЬ ВТ_ДанныеИзСервиса
	|ИЗ
	|	&ДанныеИзСервиса КАК ДанныеИзСервиса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВопросыШаблонаАнкеты.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВопросыШаблонаАнкеты.Ссылка) КАК УникальныйИдентификатор
	|ПОМЕСТИТЬ ВТ_ВопросыШаблонаАнкеты
	|ИЗ
	|	Справочник.ВопросыШаблонаАнкеты КАК ВопросыШаблонаАнкеты
	|ГДЕ
	|	ВопросыШаблонаАнкеты.Владелец = &ШаблонАнкеты
	|	И ВопросыШаблонаАнкеты.ТипВопроса В (ЗНАЧЕНИЕ(Перечисление.ТипыВопросовШаблонаАнкеты.Простой),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыВопросовШаблонаАнкеты.ВопросСУсловием))
	|	И НЕ ВопросыШаблонаАнкеты.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИзСервиса.ИдентификаторПредложенияСервиса КАК ИдентификаторПредложенияСервиса,
	|	ВТ_ВопросыШаблонаАнкеты.Ссылка КАК Вопрос,
	|	ВТ_ВопросыШаблонаАнкеты.УникальныйИдентификатор КАК УникальныйИдентификаторВопроса
	|ИЗ
	|	ВТ_ДанныеИзСервиса КАК ВТ_ДанныеИзСервиса,
	|	ВТ_ВопросыШаблонаАнкеты КАК ВТ_ВопросыШаблонаАнкеты";
	
	Запрос.УстановитьПараметр("ДанныеИзСервиса", ДанныеИзСервиса);
	Запрос.УстановитьПараметр("ШаблонАнкеты", РеквизитыОпроса.ШаблонАнкеты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ОтветыНаВопросы.Добавить();
		НоваяСтрока.ИдентификаторПредложенияСервиса = Выборка.ИдентификаторПредложенияСервиса;
		НоваяСтрока.Вопрос = Выборка.Вопрос;
		
		ДанныеОтветовПоЗапросу = ОписанияОтветовПоЗапросам.Получить(Выборка.ИдентификаторПредложенияСервиса);
		ДанныеОтветаПоВопросу = ДанныеОтветовПоЗапросу.Получить(Строка(Выборка.УникальныйИдентификаторВопроса));
		//От сервиса могут не приходить данные об ответах на необязательные вопросы
		Если ДанныеОтветаПоВопросу <> Неопределено Тогда
			НоваяСтрока.Ответы.ЗагрузитьЗначения(ДанныеОтветаПоВопросу);	
		КонецЕсли;
		
		// Удаляем пустые ответы из списка ответов. Обходим список ответов в обратную сторону
		Индекс = НоваяСтрока.Ответы.Количество() - 1;
		Пока Индекс >= 0 Цикл
			Если НоваяСтрока.Ответы[Индекс].Значение = Неопределено Тогда
				НоваяСтрока.Ответы.Удалить(Индекс);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
			
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКоммерческихПредложений(ДанныеДляЗаполнения)
	
	КоммерческиеПредложения.Очистить();
	
	Для Каждого ДанныеДокумента Из ДанныеДляЗаполнения Цикл
		НС = КоммерческиеПредложения.Добавить();
		ЗаполнитьЗначенияСвойств(НС, ДанныеДокумента);
		НС.ТекстОшибки = ДанныеДокумента.ТекстОшибки;
		НС.ЕстьОшибка = Не ПустаяСтрока(НС.ТекстОшибки);
	КонецЦикла;
	
	СуммаДокументыВсего = ДокументыПоставщиков.Итог("СуммаДокумента");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДокументовПоставщиков(ДанныеДляЗаполнения)
	
	ДокументыПоставщиков.Очистить();
	
	Для Каждого ДанныеДокумента Из ДанныеДляЗаполнения Цикл
		НС = ДокументыПоставщиков.Добавить();
		ЗаполнитьЗначенияСвойств(НС, ДанныеДокумента);
		НС.КоммерческоеПредложениеСоздано = ЗначениеЗаполнено(НС.КоммерческоеПредложение);
		НС.ЗаказСоздан = ЗначениеЗаполнено(НС.Заказ);
		НС.ТекстОшибки = ДанныеДокумента.ТекстОшибки;
	КонецЦикла;
	
	СуммаДокументыВсего = ДокументыПоставщиков.Итог("СуммаДокумента");
	
КонецПроцедуры

// См. ТорговыеПредложенияСлужебный.СведенияОНоменклатуре
&НаСервереБезКонтекста
Функция РеквизитыНоменклатуры(Знач Номенклатура)
	
	МодульТорговыеПредложенияСлужебный = ОбщегоНазначения.ОбщийМодуль("ТорговыеПредложенияСлужебный");
	Возврат МодульТорговыеПредложенияСлужебный.СведенияОНоменклатуре(Номенклатура);
	
КонецФункции

&НаСервереБезКонтекста
Функция ИмяФормыКонтрагента(ТипКонтрагента)
	МетаТип = Метаданные.НайтиПоТипу(ТипКонтрагента);

	ИмяФормы = СтрШаблон("Справочник.%1.Форма.%2",
		МетаТип.Имя,
		МетаТип.формы.ФормаЭлемента["Имя"]);
	
	Возврат ИмяФормы;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСопоставленныеПозиции(СписокВыбораОтбораСопоставления, Знач ТаблицаНоменклатуры)
	
	ОтборСопоставленияВсе = СписокВыбораОтбораСопоставления.НайтиПоЗначению("Все");
	ОтборСопоставленияВсе.Представление = СтрШаблон(НСтр("ru = 'Все (%1)'"), ТаблицаНоменклатуры.Количество());
	
	ОтборСопоставленияСопоставленные = СписокВыбораОтбораСопоставления.НайтиПоЗначению("Сопоставленные");
	ОтборСопоставленияСопоставленные.Представление = СтрШаблон(НСтр("ru = 'Сопоставленные (%1)'"), 
		ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("ТоварнаяПозицияСопоставлена", Истина)).Количество());
	
	ОтборСопоставленияНесопоставленные = СписокВыбораОтбораСопоставления.НайтиПоЗначению("Несопоставленные");
	ОтборСопоставленияНесопоставленные.Представление = СтрШаблон(НСтр("ru = 'Несопоставленные (%1)'"),
		ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("ТоварнаяПозицияСопоставлена", Ложь)).Количество());
	
КонецПроцедуры

#Область Навигация

&НаКлиенте
Процедура СменитьСтраницуШаги(Знач НоваяСтраница)
	
	Элементы.КомандыНавигации.Доступность = Истина;
	
	Если НоваяСтраница = Элементы.СтраницаКонтрагенты Тогда
		
		Элементы.НадписьШаг.Заголовок = НСтр("ru = 'Шаг 1 из 4. Сопоставление контрагентов'");

		СменитьСтраницуКомандНавигации(Элементы.ДалееОтмена);
		
	ИначеЕсли НоваяСтраница = Элементы.СтраницаТовары Тогда
		
		Элементы.НадписьШаг.Заголовок = НСтр("ru = 'Шаг 2 из 4. Сопоставление номенклатуры'");
		Элементы.Далее2.Заголовок = "Загрузить коммерческие предложения >";
		Элементы.Далее2.Доступность = Истина;
		СменитьСтраницуКомандНавигации(Элементы.НазадДалееОтмена);
		
	ИначеЕсли НоваяСтраница = Элементы.СтраницаКоммерческиеПредложения Тогда
		
		Элементы.НадписьШаг.Заголовок = НСтр("ru = 'Шаг 3 из 4. Изменение коммерческих предложений'");
		Элементы.Далее2.Заголовок = "Создать заказы поставщикам >";
		СменитьСтраницуКомандНавигации(Элементы.НазадДалееОтмена);

	ИначеЕсли НоваяСтраница = Элементы.СтраницаСозданныеДокументы Тогда
		Заголовок = НСтр("ru = 'Шаг 4 из 4. Изменение заказов поставщикам'");
		Элементы.НадписьШаг.Заголовок = "";
		Элементы.НадписьШаг.Видимость = Ложь;
		
	ИначеЕсли НоваяСтраница = Элементы.СтраницаДлительнаяОперация Тогда
		
		СменитьСтраницуКомандНавигации(Элементы.Отмена);
	КонецЕсли;
	
	Элементы.Шаги.ТекущаяСтраница = НоваяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтраницуКомандНавигации(НоваяСтраница)
	
	Если НоваяСтраница = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КомандыНавигации.ТекущаяСтраница = НоваяСтраница;
	
	Если НоваяСтраница = Элементы.ДалееОтмена Тогда
		
		Элементы.Далее1.КнопкаПоУмолчанию = Истина;
		Элементы.Далее1.АктивизироватьПоУмолчанию = Истина;
		ТекущийЭлемент = Элементы.Далее1;
		
	ИначеЕсли НоваяСтраница = Элементы.НазадДалееОтмена Тогда
		
		Элементы.Далее2.КнопкаПоУмолчанию = Истина;
		Элементы.Далее2.АктивизироватьПоУмолчанию = Истина;
		ТекущийЭлемент = Элементы.Далее2;
		
	ИначеЕсли НоваяСтраница = Элементы.НазадГотово Тогда
		
		Элементы.Готово1.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяНаПредыдущуюСтраницу()
	
	ПредыдущийШаг = ХронологияПереключенияСтраниц[ХронологияПереключенияСтраниц.ВГраница()];
	ХронологияПереключенияСтраниц.Удалить(ХронологияПереключенияСтраниц.ВГраница());
	СменитьСтраницуШаги(ПредыдущийШаг);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСледующийШаг(Ключ = "")
	
	ОчиститьСообщения();
	
	СледующаяСтраница       = Неопределено;
	СтраницаКомандНавигации = Неопределено;
	ДлительнаяОперация      = Ложь;
	
	Отказ = Ложь;
	
	ИмяМетода = "";
	
	Если Ключ = "ОткрытиеФормы" Тогда

		ДлительнаяОперация = Истина;
		ИмяМетода = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.МетодПолучениеДанныхКоммерческихПредложенийПоЗапросуБидзаар();
		СледующаяСтраница = Элементы.СтраницаКонтрагенты;

	ИначеЕсли Элементы.Шаги.ТекущаяСтраница = Элементы.СтраницаКонтрагенты Тогда
		
		ПроверкаЗаполненияСтраницаКонтрагенты(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если ЕстьИзменнныеСтрокиТаблицыКонтрагентов(Контрагенты) Тогда
			ТекстВопроса = НСтр("ru = 'Будут внесены изменения в существующие коммерческие предложения. Продолжить?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПерейтиНаШагТоварыЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
		ХронологияПереключенияСтраниц.Добавить(Элементы.СтраницаКонтрагенты);
		СледующаяСтраница  = Элементы.СтраницаТовары;
		Элементы.Далее2.Заголовок = "Загрузить коммерческие предложения >";
		ДлительнаяОперация = Ложь;
		
		ДополнитьТаблицуТоваровДаннымиКонтрагентов();
		
	ИначеЕсли Элементы.Шаги.ТекущаяСтраница = Элементы.СтраницаТовары Тогда
		
		ПроверкаЗаполненияСтраницаТовары(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если ЕстьИзменнныеСтрокиТаблицыТоваров(Товары) Тогда
			ТекстВопроса = НСтр("ru = 'Будут внесены изменения в существующие коммерческие предложения. Продолжить?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПерейтиНаШагКоммерческиеПредложенияЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
		ХронологияПереключенияСтраниц.Добавить(Элементы.СтраницаТовары);
		СледующаяСтраница  = Элементы.СтраницаКоммерческиеПредложения;
		Элементы.Далее2.Заголовок = "Создать заказы поставщикам >";
		ДлительнаяОперация = Истина;
		
	ИначеЕсли Элементы.Шаги.ТекущаяСтраница = Элементы.СтраницаКоммерческиеПредложения Тогда
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ХронологияПереключенияСтраниц.Добавить(Элементы.СтраницаКоммерческиеПредложения);
		СледующаяСтраница  = Элементы.СтраницаСозданныеДокументы;
		ДлительнаяОперация = Истина;
		
	КонецЕсли;
	
	Если СледующаяСтраница <> Неопределено Тогда
		Если ДлительнаяОперация Тогда
			ВыполнитьДлительнуюОперацию(ИмяМетода, Элементы.Шаги.ТекущаяСтраница, СледующаяСтраница);
		Иначе
			СменитьСтраницуШаги(СледующаяСтраница);
			СменитьСтраницуКомандНавигации(СтраницаКомандНавигации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГотовоЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		НовоеСостояниеЗапросаКП = ПредопределенноеЗначение("Перечисление.СостоянияЗапросаКоммерческихПредложений.Завершено");
		ИзменитьСостояниеЗапросаКоммерческихПредложений(ЗапросКоммерческихПредложений, НовоеСостояниеЗапросаКП);
		Оповестить("ИзмененоСостояниеДокумента", ,ЗапросКоммерческихПредложений);
	КонецЕсли;

	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область РаботаСФоновымиЗаданиями

&НаКлиенте
Процедура ВыполнитьДлительнуюОперацию(Знач ИмяМетода, Знач ТекущаяСтраница, Знач СледующаяСтраница)
	
	ОчиститьСообщения();
	
	СменитьСтраницуШаги(Элементы.СтраницаДлительнаяОперация);
	СменитьСтраницуКомандНавигации(Элементы.Отмена);
	Элементы.СтраницыДлительнойОперации.ТекущаяСтраница = Элементы.СтраницаВПроцессе;
	
	Задание = Новый Структура("ИмяПроцедуры, Наименование, ПараметрыПроцедуры");
	Задание.ПараметрыПроцедуры = Новый Структура;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтраница", ТекущаяСтраница);
	ДополнительныеПараметры.Вставить("СледующаяСтраница", СледующаяСтраница);
	ДополнительныеПараметры.Вставить("ИмяМетода", "");
	
	ОткрытиеФормы = (ТекущаяСтраница = Элементы.СтраницаКонтрагенты И ТекущаяСтраница = СледующаяСтраница);
	
	Если ИмяМетода = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.МетодПолучениеДанныхУчастниковПоЗапросуБидзаар() Тогда
		
		Элементы.НазваниеТекущейДлительнойОперации.Заголовок = НСтр("ru = 'Получение данных участников (победителей)'");
		Задание.Наименование = НСтр("ru = 'Получение данных участников (победителей)'");
		Задание.ИмяПроцедуры = ИмяМетода;
		Задание.ПараметрыПроцедуры.Вставить("ЗапросКоммерческихПредложений", ЗапросКоммерческихПредложений);
		Задание.ПараметрыПроцедуры.Вставить("ТолькоПобедители", Истина);
		ИмяПроцедурыПриЗавершенииДлительнойОперации = "ДлительнаяОперацияЗавершение";
		
		ДополнительныеПараметры.ИмяМетода = Задание.ИмяПроцедуры;
	
	ИначеЕсли ОткрытиеФормы Тогда
		
		Элементы.НазваниеТекущейДлительнойОперации.Заголовок = НСтр("ru = 'Получение данных коммерческих предложений'");
		Задание.Наименование = НСтр("ru = 'Получение данных коммерческих предложений по запросу.'");
		Задание.ИмяПроцедуры = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.МетодПолучениеДанныхКоммерческихПредложенийПоЗапросуБидзаар();
		Задание.ПараметрыПроцедуры.Вставить("ЗапросКоммерческихПредложений", ЗапросКоммерческихПредложений);
		ИмяПроцедурыПриЗавершенииДлительнойОперации = "ДлительнаяОперацияЗавершение";
		
		ДополнительныеПараметры.ИмяМетода = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.МетодПолучениеДанныхКоммерческихПредложенийПоЗапросуБидзаар();
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаТовары Тогда
		
		КоммерческиеПредложения.Очистить();
		
		Элементы.НазваниеТекущейДлительнойОперации.Заголовок = НСтр("ru = 'Создание коммерческих предложений'");
		Задание.Наименование = НСтр("ru = 'Создание коммерческих предложений по запросу.'");
		Задание.ИмяПроцедуры = "Документы.ЗапросКоммерческихПредложенийПоставщиков.СформироватьКоммерческиеПредложения";
		Задание.ПараметрыПроцедуры.Вставить("ДокументОснование", ЗапросКоммерческихПредложений);
		Задание.ПараметрыПроцедуры.Вставить("Организация", Организация);
		Задание.ПараметрыПроцедуры.Вставить("Валюта", Валюта);
		Задание.ПараметрыПроцедуры.Вставить("Товары", Товары);
		
		ДополнительныеПараметры.Вставить("ЗапросКоммерческихПредложений", ЗапросКоммерческихПредложений);
		ДополнительныеПараметры.Вставить("Организация", Организация);
		ДополнительныеПараметры.Вставить("Валюта", Валюта);
		
		ИмяПроцедурыПриЗавершенииДлительнойОперации = "ФормированиеКоммерческихПредложенийЗавершение";
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаКоммерческиеПредложения Тогда
		ДокументыПоставщиков.Очистить();
		
		Элементы.НазваниеТекущейДлительнойОперации.Заголовок = НСтр("ru = 'Создание заказов поставщикам'");
		Задание.Наименование = НСтр("ru = 'Создание заказов поставщикам.'");
		Задание.ИмяПроцедуры = "Обработки.ТорговыеПредложения.СформироватьЗаказы";
		Задание.ПараметрыПроцедуры.Вставить("ДокументИсточник", ЗапросКоммерческихПредложений);
		Задание.ПараметрыПроцедуры.Вставить("Товары", Товары);
		ДопПараметрыПроцедуры = Новый Структура("Доставка", Контрагенты);
		Задание.ПараметрыПроцедуры.Вставить("ДополнительныеПараметры", ДопПараметрыПроцедуры);
		
		ИмяПроцедурыПриЗавершенииДлительнойОперации = "ВыполнитьСозданиеЗаказовПоставщикамЗавершение";
		
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = Задание.Наименование;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения(
		ИмяПроцедурыПриЗавершенииДлительнойОперации, ЭтотОбъект, ДополнительныеПараметры);
		
	Если ТекущаяСтраница = Элементы.СтраницаКоммерческиеПредложения Тогда
		ДлительнаяОперация = ВыполнитьСозданиеЗаказовПоставщикуВФоне(Задание, УникальныйИдентификатор);
	Иначе
		ДлительнаяОперация = ВыполнитьЗаданиеВФоне(Задание, УникальныйИдентификатор);
	КонецЕсли;

	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
		ДлительнаяОперацияЗавершение,
		ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьЗаданиеВФоне(Знач Задание, УникальныйИдентификатор)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Задание.Наименование;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Если Задание.ПараметрыПроцедуры.Свойство("Товары")
		И ТипЗнч(Задание.ПараметрыПроцедуры.Товары) = Тип("ДанныеФормыКоллекция") Тогда
		// Преобразование типа данные формы коллекции в таблицу значений.
		Задание.ПараметрыПроцедуры.Товары = Задание.ПараметрыПроцедуры.Товары.Выгрузить();
	КонецЕсли;
	
	Если Задание.ПараметрыПроцедуры.Свойство("Контрагенты")
		И ТипЗнч(Задание.ПараметрыПроцедуры.Контрагенты) = Тип("ДанныеФормыКоллекция") Тогда
		// Преобразование типа данные формы коллекции в таблицу значений.
		Задание.ПараметрыПроцедуры.Контрагенты = Задание.ПараметрыПроцедуры.Контрагенты.Выгрузить();
	КонецЕсли;
	
	Если Задание.ПараметрыПроцедуры.Свойство("ВыбранныеИсточники")
		И ТипЗнч(Задание.ПараметрыПроцедуры.ВыбранныеИсточники) = Тип("ДанныеФормыКоллекция") Тогда
		// Преобразование типа данные формы коллекции в таблицу значений.
		Задание.ПараметрыПроцедуры.ВыбранныеИсточники = Задание.ПараметрыПроцедуры.ВыбранныеИсточники.Выгрузить();
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(Задание.ИмяПроцедуры,
		Задание.ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ДлительнаяОперацияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Отказ          = Ложь;
	ТекстСообщения = "";
	
	Если Результат = Неопределено Тогда // Отменено пользователем.
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Фоновое задание отменено пользователем'");
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Свойство("Сообщения") И ЗначениеЗаполнено(Результат.Сообщения) Тогда
			Для каждого Сообщение Из Результат.Сообщения Цикл
				Сообщение.Сообщить();
			КонецЦикла;
		ИначеЕсли Результат.Статус = "Ошибка" Тогда
			Отказ = Истина;
			Результат.Свойство("ПодробноеПредставлениеОшибки", ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

	ТекущаяСтраница   = ДополнительныеПараметры.ТекущаяСтраница;
	СледующаяСтраница = ДополнительныеПараметры.СледующаяСтраница;
	ИмяМетода = ДополнительныеПараметры.ИмяМетода;
	
	Если ИмяМетода = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.МетодПолучениеДанныхУчастниковПоЗапросуБидзаар() Тогда
			
		ДанныеУчастников = ПолучитьИзВременногоХранилища(Результат.АдресРезультата).ДанныеУчастников;
		Если ДанныеУчастников.Количество() = 0 Тогда
			Отказ = Истина;
			Элементы.ПовторитьТекущуюДлительнуюОперацию.Видимость = Ложь;
			Элементы.ОписаниеОшибкиТекущейДлительнойОперации.Заголовок = НСтр("ru = 'Победители не выбраны'");		
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		Если ТекущаяСтраница = Элементы.СтраницаКоммерческиеПредложения
			И СледующаяСтраница = Элементы.СтраницаКоммерческиеПредложения Тогда // Создание документов поставщиков
			
			Элементы.ОписаниеОшибкиТекущейДлительнойОперации.Заголовок =
			НСтр("ru = 'При подготовке документов произошла ошибка'");
		
		ИначеЕсли ТекущаяСтраница = Элементы.СтраницаТовары
			И СледующаяСтраница = Элементы.СтраницаКоммерческиеПредложения Тогда // Создание документов коммерческих предложений
			
			Элементы.ОписаниеОшибкиТекущейДлительнойОперации.Заголовок =
			НСтр("ru = 'При подготовке документов произошла ошибка'");
		
		КонецЕсли;
		
		ТекущийШаг   = ТекущаяСтраница["Имя"];
		СледующийШаг = СледующаяСтраница["Имя"];
		
		Элементы.СтраницыДлительнойОперации.ТекущаяСтраница = Элементы.СтраницаОшибка;
		СменитьСтраницуКомандНавигации(Элементы.Отмена);
		
	Иначе
		РезультатОбработки = Истина;
		
		СтраницаКомандНавигации = Неопределено;
	
		Если ИмяМетода = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.МетодПолучениеДанныхКоммерческихПредложенийПоЗапросуБидзаар() Тогда
			
			ОбработатьРезультатПолучениеДанныхКоммерческихПредложенийПоЗапросуБидзаар(Результат, РезультатОбработки);
			
			Если РезультатОбработки Тогда
				// Вызов еще одной длительной операции для заполнения списка контрагентов
				ВыполнитьДлительнуюОперацию(ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.МетодПолучениеДанныхУчастниковПоЗапросуБидзаар(),
					ТекущаяСтраница, СледующаяСтраница);
				// Выходим из процедуры, т.к. запустилась еще одна длительная операция и обработка не завершена
				Возврат;
			КонецЕсли;
			
		ИначеЕсли ИмяМетода = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.МетодПолучениеДанныхУчастниковПоЗапросуБидзаар() Тогда
			
			ДополнитьТаблицуКонтрагентов(ДанныеУчастников);
			
		ИначеЕсли ТекущаяСтраница = Элементы.СтраницаТовары
			И СледующаяСтраница = Элементы.СтраницаКоммерческиеПредложения Тогда // Создание коммерческих предложения
			
			РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			
			Если ТипЗнч(РезультатВыполнения) = Тип("Булево") Тогда
				
				ОповеститьОбИзменении(ЗапросКоммерческихПредложений);
				
			ИначеЕсли ТипЗнч(РезультатВыполнения) = Тип("Структура") И РезультатВыполнения.ТекстОшибки = "" Тогда
				ЗаполнитьТаблицуКоммерческихПредложений(РезультатВыполнения.СозданныеДокументы);
			КонецЕсли;
			
			СтраницаКомандНавигации = Элементы.НазадДалееОтмена;
			
		ИначеЕсли ТекущаяСтраница = Элементы.СтраницаКоммерческиеПредложения
			И СледующаяСтраница = Элементы.СтраницаСозданныеДокументы Тогда // Создание документов поставщиков
			
			РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			
			Если ТипЗнч(РезультатВыполнения) = Тип("Булево") Тогда
				
				ОповеститьОбИзменении(ЗапросКоммерческихПредложений);
				
			ИначеЕсли ТипЗнч(РезультатВыполнения) = Тип("Структура") И РезультатВыполнения.ТекстОшибки = "" Тогда
				ЗаполнитьТаблицуДокументовПоставщиков(РезультатВыполнения.СозданныеДокументы);
			КонецЕсли;
			
			СтраницаКомандНавигации = Элементы.НазадГотово;
		КонецЕсли;
		
		Если РезультатОбработки Тогда
			СменитьСтраницуШаги(СледующаяСтраница);
			СменитьСтраницуКомандНавигации(СтраницаКомандНавигации);
		Иначе
			ТекущийШаг   = ТекущаяСтраница["Имя"];
			СледующийШаг = СледующаяСтраница["Имя"];
		
			Элементы.СтраницыДлительнойОперации.ТекущаяСтраница = Элементы.СтраницаОшибка;
			СменитьСтраницуКомандНавигации(Элементы.Отмена);
		КонецЕсли;
		
	КонецЕсли;
	
	ИдентификаторЗадания = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеКоммерческихПредложенийЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Отказ = Ложь;
	Если Результат = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;

	Если Не Отказ Тогда
		РезультатСозданияКП = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);

		Если РезультатСозданияКП = Неопределено Тогда
			Отказ = Истина;
		ИначеЕсли ТипЗнч(РезультатСозданияКП.СозданныеДокументы) <> Тип("Массив") Тогда
			Отказ = Истина;
		ИначеЕсли РезультатСозданияКП.СозданныеДокументы.Количество() = 0 Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если Отказ Тогда
		ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения("ДлительнаяОперацияЗавершение", ЭтотОбъект,
			ДополнительныеПараметры);

		ВыполнитьОбработкуОповещения(ДлительнаяОперацияЗавершение, Неопределено);
		Возврат;
	КонецЕсли;
	
	// Заполним табличную часть Коммерческие предложения
	СоответствияКП = Новый Соответствие;
	КоммерческиеПредложения.Очистить();
	Для Каждого СтрокаДанных Из РезультатСозданияКП.СозданныеДокументы Цикл
		Если Не ЗначениеЗаполнено(СтрокаДанных.КоммерческоеПредложение) Тогда
			Если Не ПустаяСтрока(СтрокаДанных.ТекстОшибки) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаДанных.ТекстОшибки);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		НС = КоммерческиеПредложения.Добавить();
		ЗаполнитьЗначенияСвойств(НС, СтрокаДанных);
		НС.ИдентификаторПредложенияСервиса = СтрокаДанных.ИдентификаторПредложенияВСервисе;
		НС.ЕстьОшибка = Не ПустаяСтрока(НС.ТекстОшибки);
		
		СоответствияКП.Вставить(СтрокаДанных.ИдентификаторПредложенияВСервисе, СтрокаДанных.КоммерческоеПредложение);
		
	КонецЦикла;
	
	Если СоответствияКП.Количество() = 0 Тогда
		Элементы.Далее2.Доступность = Ложь;
		ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения("ДлительнаяОперацияЗавершение", ЭтотОбъект,
			ДополнительныеПараметры);

		ВыполнитьОбработкуОповещения(ДлительнаяОперацияЗавершение, Результат);
		Возврат;
	КонецЕсли;
	
	// Дополним табличную часть Контрагенты ссылками на созданные коммерческие предложения
	Для Каждого СтрокаКонтрагент Из Контрагенты Цикл
		// Сбрасываем флаг изменения контрагента
		СтрокаКонтрагент.Изменение = Ложь;
		Если Не ЗначениеЗаполнено(СтрокаКонтрагент.КоммерческоеПредложение) Тогда
			СтрокаКонтрагент.КоммерческоеПредложение = СоответствияКП.Получить(СтрокаКонтрагент.ИдентификаторПредложенияСервиса);
		КонецЕсли;
	КонецЦикла;
	
	// Дополним табличную часть Товары ссылками на созданные коммерческие предложения
	Для Каждого СтрокаТовары Из Товары Цикл
		// Сбрасываем флаг изменения товаров
		СтрокаТовары.Изменение = Ложь;
		Если Не ЗначениеЗаполнено(СтрокаТовары.КоммерческоеПредложение) Тогда
			СтрокаТовары.КоммерческоеПредложение = СоответствияКП.Получить(СтрокаТовары.ИдентификаторПредложенияСервиса);
		КонецЕсли;
	КонецЦикла;
	
	// Подготовим данные для создания заказов поставщикам
	КоммерческиеПредложенияДляТаблицыПоставщиков = Новый Массив;
	ЗаказыДляТаблицыПоставщиков = Новый Массив;

	Для Каждого РезультатСозданияДокумента Из РезультатСозданияКП.СозданныеДокументы Цикл
		Если ЗначениеЗаполнено(РезультатСозданияДокумента.КоммерческоеПредложение) Тогда
			КоммерческиеПредложенияДляТаблицыПоставщиков.Добавить(РезультатСозданияДокумента.КоммерческоеПредложение);
		КонецЕсли;
	КонецЦикла;

	ДанныеДляТаблицыПоставщиков = ДанныеДляТаблицыПоставщиков(КоммерческиеПредложенияДляТаблицыПоставщиков,
		ЗаказыДляТаблицыПоставщиков);

	ДокументыПоставщиков.Очистить();
	Для Каждого СтрокаДанных Из ДанныеДляТаблицыПоставщиков Цикл
		НС = ДокументыПоставщиков.Добавить();
		ЗаполнитьЗначенияСвойств(НС, СтрокаДанных);
	КонецЦикла;
	СуммаДокументыВсего = ДокументыПоставщиков.Итог("СуммаДокумента");
	
	// Распараллеливаем задачи:
	
	// 1. Присоединяем файлы к созданным коммерческим предложениям
	Элементы.НазваниеТекущейДлительнойОперации.Заголовок = НСтр(
		"ru = 'Получение файлов коммерческих предложений.'");

	Задание = Новый Структура("ИмяПроцедуры, Наименование, ПараметрыПроцедуры");

	Задание.ПараметрыПроцедуры = Новый Структура;

	ОписанияФайловДляПолучения = Новый Соответствие;
	Для Каждого СтрокаДокументы Из КоммерческиеПредложения Цикл

		Если Не ЗначениеЗаполнено(СтрокаДокументы.КоммерческоеПредложение) Тогда
			Продолжить;
		КонецЕсли;

		ОтборОписанийФайлов = Новый Структура("ИдентификаторПредложенияСервиса",
			СтрокаДокументы.ИдентификаторПредложенияСервиса);
		НайденныеОписанияФайлов = ФайлыПоставщиков.НайтиСтроки(ОтборОписанийФайлов);

		Если НайденныеОписанияФайлов.Количество() > 0 Тогда
			ИдентификаторыФайлов = Новый Массив;

			Для Каждого НайденноеОписаниеФайла Из НайденныеОписанияФайлов Цикл
				
				ОписаниеФайла = Новый Структура;
				ОписаниеФайла.Вставить("ИдентификаторФайла", НайденноеОписаниеФайла.ИдентификаторСервиса);
				ОписаниеФайла.Вставить("Имя", НайденноеОписаниеФайла.Имя);
				ОписаниеФайла.Вставить("Расширение", НайденноеОписаниеФайла.Расширение);
				
				ИдентификаторыФайлов.Добавить(ОписаниеФайла);
			КонецЦикла;

			ОписанияФайловДляПолучения.Вставить(СтрокаДокументы.КоммерческоеПредложение,
				ИдентификаторыФайлов);
		КонецЕсли;
	КонецЦикла;

	Задание.ПараметрыПроцедуры.Вставить("ОписанияФайлов", ОписанияФайловДляПолучения);

	Задание.Наименование = НСтр("ru = 'Получение файлов коммерческих предложений.'");
	Задание.ИмяПроцедуры = "ИнтеграцияСЭлектроннымиТорговымиПлощадками.ПолучениеФайловКоммерческихПредложенийБидзаар";
		
	// Вызов стандартного механизма длительной операции
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = Задание.Наименование;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;

	ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения("ПолучениеФайловКоммерческихПредложенийБидзаарЗавершение",
		ЭтотОбъект, ДополнительныеПараметры);

	ДлительнаяОперация = ВыполнитьПолучениеФайловКоммерческихПредложенийВФоне(Задание, УникальныйИдентификатор);

	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ДлительнаяОперацияЗавершение, ПараметрыОжидания);
	
	// 2. Перенесем информацию из созданных коммерческих предложений в документ "Запрос коммерческих предложений"
	Элементы.НазваниеТекущейДлительнойОперации.Заголовок = НСтр(
		"ru = 'Перенос данных коммерческих предложений в запрос'");

	Задание = Новый Структура("ИмяПроцедуры, Наименование, ПараметрыПроцедуры");

	Задание.ПараметрыПроцедуры = Новый Структура;

	Задание.ПараметрыПроцедуры.Вставить("ДокументИсточник", ЗапросКоммерческихПредложений);
	Задание.ПараметрыПроцедуры.Вставить("Валюта", ДополнительныеПараметры.Валюта);

	Задание.Наименование = НСтр("ru = 'Перенос данных коммерческих предложений в запрос.'");
	Задание.ИмяПроцедуры = "Документы.ЗапросКоммерческихПредложенийПоставщиков.ВыбратьПредложения";
		
	// Вызов стандартного механизма длительной операции
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = Задание.Наименование;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;

	ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения("ВыполнитьПереносДанныхКоммерческихПредложенийЗавершение",
		ЭтотОбъект, ДополнительныеПараметры);

	ДлительнаяОперация = ВыполнитьПереносДанныхКоммерческихПредложенийВФоне(Задание, УникальныйИдентификатор);

	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ДлительнаяОперацияЗавершение, ПараметрыОжидания);
	
	// 3. Создадим анкеты
	Элементы.НазваниеТекущейДлительнойОперации.Заголовок = НСтр(
		"ru = 'Загрузка ответов на вопросы'");

	// Эта операция будет отражена на форме длительных операций.
	СменитьСтраницуШаги(Элементы.СтраницаДлительнаяОперация);
	СменитьСтраницуКомандНавигации(Элементы.Отмена);
	Элементы.СтраницыДлительнойОперации.ТекущаяСтраница = Элементы.СтраницаВПроцессе;
	
	ИдКоммерческихПредложений = Новый Соответствие;
	
	Для Каждого СтрокаДокументы Из КоммерческиеПредложения Цикл
		Если Не ЗначениеЗаполнено(СтрокаДокументы.КоммерческоеПредложение) Тогда
			Продолжить;
		КонецЕсли;
		ИдКоммерческихПредложений.Вставить(СтрокаДокументы.ИдентификаторПредложенияСервиса, СтрокаДокументы.КоммерческоеПредложение);
	КонецЦикла;
	Для Каждого Ответ Из ОтветыНаВопросы Цикл
		Ответ.КоммерческоеПредложение = ИдКоммерческихПредложений.Получить(Ответ.ИдентификаторПредложенияСервиса);
	КонецЦикла;
	
	Задание = Новый Структура("ИмяПроцедуры, Наименование, ПараметрыПроцедуры");
	Задание.ПараметрыПроцедуры = Новый Структура;
	Задание.ПараметрыПроцедуры.Вставить("ДокументИсточник", ЗапросКоммерческихПредложений);
	Задание.Наименование = НСтр("ru = 'Загрузка ответов на вопросы'");
	Задание.ИмяПроцедуры = "Документы.ЗапросКоммерческихПредложенийПоставщиков.СформироватьАнкеты";
		
	// Вызов стандартного механизма длительной операции
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = Задание.Наименование;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения("СозданиеАнкетЗавершение",
		ЭтотОбъект, ДополнительныеПараметры);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыФормы.Вставить("Опрос", Опрос);
	ПараметрыФормы.Вставить("ОтветыНаВопросы", ОтветыНаВопросы);
	
	ДлительнаяОперация = СозданиеАнкетВФоне(Задание, ПараметрыФормы);

	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ДлительнаяОперацияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьПереносДанныхКоммерческихПредложенийВФоне(Знач Задание, УникальныйИдентификатор)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Задание.Наименование;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	РеквизитыДокумента = Задание.ПараметрыПроцедуры.ДокументИсточник.ПолучитьОбъект();

	Задание.ПараметрыПроцедуры.Вставить("ЦенаВключаетНДС", РеквизитыДокумента.ЦенаВключаетНДС);
	Задание.ПараметрыПроцедуры.Вставить("Предложение", Неопределено);
	Задание.ПараметрыПроцедуры.Вставить("ВыбранныеИсточники", РеквизитыДокумента.ВыбранныеИсточники.Выгрузить());
	Задание.ПараметрыПроцедуры.Вставить("ЗаполняемыеПозиции", РеквизитыДокумента.Товары.Выгрузить( ,
		"ИдентификаторСтрокиЗапроса").ВыгрузитьКолонку("ИдентификаторСтрокиЗапроса"));
	Задание.ПараметрыПроцедуры.Вставить("ДатаОкончанияРассмотрения", РеквизитыДокумента.ДатаОкончанияРассмотрения);
	Задание.ПараметрыПроцедуры.Вставить("ВыбратьПоЦене", Ложь);
	Задание.ПараметрыПроцедуры.Вставить("ВыбратьВсе", Истина);

	АнализируемыеИсточники = Новый Массив;
	АнализируемыеИсточники.Добавить(КоммерческиеПредложенияДокументы.ИмяИсточникаПодчиненныеКоммерческиеПредложения());
	Задание.ПараметрыПроцедуры.Вставить("АнализируемыеИсточники", АнализируемыеИсточники);

	Возврат ДлительныеОперации.ВыполнитьВФоне(Задание.ИмяПроцедуры, Задание.ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаСервереБезКонтекста
Функция СозданиеАнкетВФоне(Знач Задание, ПараметрыФормы)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ПараметрыФормы.УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Задание.Наименование;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	Задание.ПараметрыПроцедуры.Вставить("Опрос", ПараметрыФормы.Опрос);
	
	ПараметрОтветыНаВопросы = Новый Массив;
	Для Каждого Ответ из ПараметрыФормы.ОтветыНаВопросы Цикл
		Если Не ЗначениеЗаполнено(Ответ.КоммерческоеПредложение) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеОтвета = Новый Структура;
		ОписаниеОтвета.Вставить("КоммерческоеПредложение", Ответ.КоммерческоеПредложение);
		ОписаниеОтвета.Вставить("Вопрос", Ответ.Вопрос);
		ОписаниеОтвета.Вставить("Ответы", Ответ.Ответы);
		
		ПараметрОтветыНаВопросы.Добавить(ОписаниеОтвета);
	КонецЦикла;
	Задание.ПараметрыПроцедуры.Вставить("ОтветыНаВопросы", ПараметрОтветыНаВопросы);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(Задание.ИмяПроцедуры, Задание.ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьПолучениеФайловКоммерческихПредложенийВФоне(Знач Задание, УникальныйИдентификатор)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Задание.Наименование;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	Возврат ДлительныеОперации.ВыполнитьВФоне(Задание.ИмяПроцедуры, Задание.ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаКлиенте
Процедура ВыполнитьПереносДанныхКоммерческихПредложенийЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Отказ = Ложь;
	
	Если Результат = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения(
			"ДлительнаяОперацияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		РезультатОшибка = Новый Структура("ТекстОшибки", НСтр("ru = 'Коммерческие предложения не созданы'"));
		ПоместитьВоВременноеХранилище(РезультатОшибка, Результат.АдресРезультата);
		ВыполнитьОбработкуОповещения(ДлительнаяОперацияЗавершение, Результат);
		Возврат;
	Иначе
		// Сохраним выбранные данные в документ
		Оповестить("ПереносДанныхКоммерческихПредложенийБидзаар", Результат.АдресРезультата, ЗапросКоммерческихПредложений);
	КонецЕсли;
	
	ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения("ДлительнаяОперацияЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	ПоместитьВоВременноеХранилище(Истина, Результат.АдресРезультата);
	ВыполнитьОбработкуОповещения(ДлительнаяОперацияЗавершение, Результат);
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеФайловКоммерческихПредложенийБидзаарЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура СозданиеАнкетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	Если Результат = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ Тогда
		РезультатСозданияАнкет = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);

		Если РезультатСозданияАнкет = Неопределено Тогда
			Отказ = Истина;
		ИначеЕсли ТипЗнч(РезультатСозданияАнкет.СозданныеДокументы) <> Тип("Массив") Тогда
			Отказ = Истина;
		ИначеЕсли РезультатСозданияАнкет.СозданныеДокументы.Количество() = 0 Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если Отказ Тогда
		ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения("ДлительнаяОперацияЗавершение", ЭтотОбъект,
			ДополнительныеПараметры);

		ВыполнитьОбработкуОповещения(ДлительнаяОперацияЗавершение, Результат);
		Возврат;
	КонецЕсли;
	
	// Дополним анкетами табличную часть Коммерческие предложения
	Для Каждого СтрокаДанных Из РезультатСозданияАнкет.СозданныеДокументы Цикл
		ПараметрыПоиска = Новый Структура("КоммерческоеПредложение", СтрокаДанных.КоммерческоеПредложение);
		НайденныеСтроки = КоммерческиеПредложения.НайтиСтроки(ПараметрыПоиска);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Анкета = СтрокаДанных.Анкета;
			НайденнаяСтрока.ТекстОшибки = НайденнаяСтрока.ТекстОшибки + НайденнаяСтрока.ТекстОшибки;
			НайденнаяСтрока.ЕстьОшибка = Не ПустаяСтрока(НайденнаяСтрока.ТекстОшибки);
		КонецЦикла;
		
	КонецЦикла;
	
	ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения("ДлительнаяОперацияЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	ПоместитьВоВременноеХранилище(Истина, Результат.АдресРезультата);
	ВыполнитьОбработкуОповещения(ДлительнаяОперацияЗавершение, Результат);
	
КонецПроцедуры

// Выполнить создание заказов поставщику в фоне.
// 
// Параметры:
//  Задание - Структура - Задание:
// * ПараметрыПроцедуры - Структура - Параметры исполняемой длительной процедуры:
//  ** ДокументИсточник - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - документ-основание
//  ** Товары - ДанныеФормыКоллекция - Таблица товаров
//  ** ДополнительныеПараметры - Структура - дополнительные параметры, которые должны быть сначала трарнсформированы, а потом переданы в исполняемую процедуру
// * Наименование - Строка - Наименование длительной операции
// * ИмяПроцедуры - Строка - Полный путь к процедуре, которая должна быть выполнена в ходе длительной операции
//  УникальныйИдентификатор - УникальныйИдентификатор - Уникальный идентификатор фонового задания
// 
// Возвращаемое значение:
//  Структура - См. ВыполнитьВФоне
&НаСервереБезКонтекста
Функция ВыполнитьСозданиеЗаказовПоставщикуВФоне(Знач Задание, УникальныйИдентификатор)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Задание.Наименование;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	РеквизитыДокумента = Задание.ПараметрыПроцедуры.ДокументИсточник.ПолучитьОбъект();
	РеквизитыНеобходимыеДляСозданияЗаказовПоставщикам = "Организация, Склад, Валюта, ЗапрашиватьПредложенияПоставщиков,
		| Налогообложение, ЦенаВключаетНДС, ХозяйственнаяОперация";
	КонтекстИсточника = Новый Структура(РеквизитыНеобходимыеДляСозданияЗаказовПоставщикам);
	ЗаполнитьЗначенияСвойств(КонтекстИсточника, РеквизитыДокумента);
	КонтекстИсточника.Вставить("ХозяйственнаяОперация",
		КоммерческиеПредложенияДокументыКлиентСерверУТ.ХозяйственнаяОперацияДокументаКоммерческоеПредложениеПоставщика(
			РеквизитыДокумента.ХозяйственнаяОперация));
	КоммерческиеПредложенияДокументыКлиентСерверПереопределяемый.ДополнитьКонтекстДляСозданияЗаказовПоставщикам(
		КонтекстИсточника);

	// Дополняем таблицу товаров различными колонками
	ТипыУпаковки = Новый Массив;
	Для Каждого ТипУпаковки Из Метаданные.ОпределяемыеТипы.УпаковкаНоменклатурыБЭД.Тип.Типы() Цикл
		ТипыУпаковки.Добавить(ТипУпаковки);
	КонецЦикла;
	
	ТаблицаТовары = Задание.ПараметрыПроцедуры.Товары.Выгрузить();	// ТаблицаЗначений
	ТаблицаТовары.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	ТаблицаТовары.Колонки.Добавить("НаименованиеНоменклатуры", Новый ОписаниеТипов("Строка"));
	ТаблицаТовары.Колонки.Добавить("ПредставлениеЕдиницыИзмерения", Новый ОписаниеТипов("Строка"));
	ТаблицаТовары.Колонки.Добавить("Упаковка", Новый ОписаниеТипов(ТипыУпаковки));
	ТаблицаТовары.Колонки.Добавить("ИспользованиеХарактеристик", Новый ОписаниеТипов("Булево"));
	ТаблицаТовары.Колонки.Добавить("ШтрихКоды", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1)));
	ТаблицаТовары.Колонки.Добавить("ИННКонтрагента", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1)));
	ТаблицаТовары.Колонки.Добавить("КППКонтрагента", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1)));
	ТаблицаТовары.Колонки.Добавить("ВнутреннийИдентификатор",
		Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1)));	// Идентификатор прайс-листа
	
	Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
		СтрокаТовары.Пометка = Истина;
		СтрокаТовары.Упаковка = СтрокаТовары.ЕдиницаИзмерения;
		СтрокаТовары.НаименованиеНоменклатуры = СтрокаТовары.ПредставлениеНоменклатурыВСервисе;
		СтрокаТовары.ПредставлениеЕдиницыИзмерения = СтрокаТовары.ПредставлениеЕдиницыИзмеренияВСервисе;
		СтрокаТовары.ИспользованиеХарактеристик = СтрокаТовары.ХарактеристикиИспользуются;
	КонецЦикла;

	Задание.ПараметрыПроцедуры.Вставить("Товары", ТаблицаТовары);

	АнализируемыеИсточники = Новый Массив;
	АнализируемыеИсточники.Добавить(КоммерческиеПредложенияДокументы.ИмяИсточникаПодчиненныеКоммерческиеПредложения());
	Задание.ПараметрыПроцедуры.Вставить("АнализируемыеИсточники", АнализируемыеИсточники);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Организация", РеквизитыДокумента.Организация);
	ДополнительныеПараметры.Вставить("ЗарегистрироватьОрганизацию", Ложь);
	ДополнительныеПараметры.Вставить("Валюта", РеквизитыДокумента.Валюта);
	ДополнительныеПараметры.Вставить("КонтекстИсточника", КонтекстИсточника);
	ДополнительныеПараметры.Вставить("Доставка",
		Задание.ПараметрыПроцедуры.ДополнительныеПараметры.Доставка.Выгрузить( ,
		"ИдентификаторКонтрагента, Контрагент, СпособДоставки, АдресДоставки, АдресДоставкиЗначенияПолей"));
	ДополнительныеПараметры.Вставить("ПоляГруппировкиТоваровДляЗаказа", "ИдентификаторКонтрагента, ИдентификаторПредложенияСервиса");

	Задание.ПараметрыПроцедуры.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

	Возврат ДлительныеОперации.ВыполнитьВФоне(Задание.ИмяПроцедуры, Задание.ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаКлиенте
Процедура ВыполнитьСозданиеЗаказовПоставщикамЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Отказ = Ложь;

	Если Результат = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;

	Если Не Отказ Тогда

		КоммерческиеПредложенияДляТаблицыПоставщиков = Новый Массив;
		ЗаказыДляТаблицыПоставщиков = Новый Массив;
		
		// Сохраним выбранные данные в документ
		ПрикрепитьЗаказыКЗапросуКоммерческихПредложений(Результат.АдресРезультата, Отказ,
			ЗапросКоммерческихПредложений, ЗаказыДляТаблицыПоставщиков);
		Оповестить("Бидзаар_СформированыЗаказыПоставщикам", Истина, ЗапросКоммерческихПредложений);
		
		// Заполним табличную часть ДокументыПоставщиков
		Для Каждого СтрокаКоммерческиеПредложения Из КоммерческиеПредложения Цикл
			Если ЗначениеЗаполнено(СтрокаКоммерческиеПредложения.КоммерческоеПредложение) Тогда
				КоммерческиеПредложенияДляТаблицыПоставщиков.Добавить(
					СтрокаКоммерческиеПредложения.КоммерческоеПредложение);
			КонецЕсли;
		КонецЦикла;

		ДанныеДляТаблицыПоставщиков = ДанныеДляТаблицыПоставщиков(КоммерческиеПредложенияДляТаблицыПоставщиков,
			ЗаказыДляТаблицыПоставщиков);

		КоличествоСозданныхЗаказов = ЗаказыДляТаблицыПоставщиков.Количество();

		ДокументыПоставщиков.Очистить();
		Для Каждого СтрокаДанных Из ДанныеДляТаблицыПоставщиков Цикл
			НС = ДокументыПоставщиков.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрокаДанных);
		КонецЦикла;

	КонецЕсли;

	ДлительнаяОперацияЗавершение = Новый ОписаниеОповещения("ДлительнаяОперацияЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);

	ВыполнитьОбработкуОповещения(ДлительнаяОперацияЗавершение, Результат);

КонецПроцедуры

&НаСервере
Процедура ПрикрепитьЗаказыКЗапросуКоммерческихПредложений(АдресРезультата, Отказ, ЗапросКоммерческихПредложений, Заказы)
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если РезультатВыполнения <> Истина Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	
	УстановитьПривилегированныйРежим(Истина);
	МассивЗаказов = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Пользователь, "ФормированиеЗаказов");
	ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(Пользователь, "ФормированиеЗаказов");
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого ДанныеЗаказа Из МассивЗаказов Цикл
		
		Если ДанныеЗаказа.ЗаказСоздан Тогда
		
			МенеджерЗаписи = РегистрыСведений.ЗаказыПоставщикамПоЗапросамКоммерческихПредложений.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ЗаказПоставщику = ДанныеЗаказа["Ссылка"];
			МенеджерЗаписи.ЗапросКоммерческихПредложений = ЗапросКоммерческихПредложений;
			МенеджерЗаписи.ИдентификаторПредложенияВСервисе = ДанныеЗаказа.ИдентификаторПредложенияСервиса;

			Попытка 
				МенеджерЗаписи.Записать();
				Заказы.Добавить(ДанныеЗаказа["Ссылка"]);
			Исключение
				СобытиеЖурнала = ИнтеграцияСЭлектроннымиТорговымиПлощадками.СобытиеЖурналаРегистрации(Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели);
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(СобытиеЖурнала, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьАктивныеФоновыеОперации()
	
	Если ИдентификаторЗадания <> Неопределено Тогда
		ИнтеграцияБСПБЭДВызовСервера.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
		ИдентификаторЗадания = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РезультатыДлительныхОпераций

&НаСервере
Процедура ОбработатьРезультатПолучениеДанныхКоммерческихПредложенийПоЗапросуБидзаар(Результат, РезультатОбработки)
	
	РезультатОперации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Если РезультатОперации.КодСостояния <> 200 Тогда
		Если Не ПустаяСтрока(РезультатОперации.ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(РезультатОперации.ТекстОшибки);
		КонецЕсли;
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	ДанныеКоммерческихПредложений = РезультатОперации.ДанныеКоммерческихПредложений;
	
	ЗаполнитьТаблицуКонтрагентовПоДаннымПредложения(ДанныеКоммерческихПредложений);
	ЗаполнитьТаблицуТоваровИФайлов(ДанныеКоммерческихПредложений);
	ЗаполнитьТаблицуОтветовНаВопросы(ДанныеКоммерческихПредложений);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	
	Элементы.КомандыНавигации.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ИспользоватьЗаказыПоставщикам = Параметры.ИспользоватьЗаказыПоставщикам;
	Элементы.ДокументыПоставщиковЗаказ.Видимость = ИспользоватьЗаказыПоставщикам;
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Условное оформление для характеристик номенклатуры.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыХарактеристика.Имя);
	
	ОтборГруппа = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОтборГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Характеристика");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЭДЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используются>'"));
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыХарактеристика.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНоменклатура.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Номенклатура");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЭДЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ПодчеркнутыйШрифтДиалоговБЭД);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<выберите или создайте номенклатуру>'"));
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Оформление заказов с ошибкой.
	Если ИспользоватьЗаказыПоставщикам Тогда
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДокументыПоставщиков.Имя);

		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДокументыПоставщиков.ЗаказСоздан");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;

		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",
			ЦветаСтиля.ЦветФонаПоясненияОшибкиБИП);
	КонецЕсли;
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДокументыПоставщиковЗаказТекст.Имя);

	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДокументыПоставщиков.ЗаказСоздан");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЭДЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт"     , ШрифтыСтиля.ПодчеркнутыйШрифтДиалоговБЭД);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст"     , НСтр("ru = '<не создан>'"));
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДокументыПоставщиковКоммерческоеПредложениеТекст.Имя);

	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДокументыПоставщиков.КоммерческоеПредложениеСоздано");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЭДЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт"     , ШрифтыСтиля.ПодчеркнутыйШрифтДиалоговБЭД);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст"     , НСтр("ru = '<не создан>'"));
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Условное оформление для ненайденных контрагентов
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("КонтрагентыКонтрагент");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагенты.Контрагент");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Сопоставить");
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Условное оформление для ошибок создания документов "КоммерческоеПредложениеПоставщика"
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КоммерческиеПредложенияЕстьОшибка.Имя);

	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("КоммерческиеПредложения.ЕстьОшибка");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	// Оформление товаров
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	Для Каждого ЭлементЕдиницаИзмерения Из Элементы.ТоварыУпаковкаЕдиницаИзмерения.ПодчиненныеЭлементы Цикл
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементЕдиницаИзмерения.Имя);
	КонецЦикла;
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Товары.ЕдиницаИзмеренияВнимание");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОшибочныеДанные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыОткрытияФормыНоменклатуры(Знач Типы, Знач ДанныеЗаполнения)
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяФормыСоздания", ПолучитьФормуЭлемента(Типы));
	
	МодульРаботаСНоменклатуройСлужебный = ОбщегоНазначения.ОбщийМодуль("РаботаСНоменклатуройСлужебный");
	ТаблицаНоменклатуры = МодульРаботаСНоменклатуройСлужебный.ОписаниеТаблицыНоменклатуры();
	ТаблицаНоменклатуры.Колонки.Добавить("Производитель");
	ТаблицаНоменклатуры.Колонки.Добавить("Бренд");
	ТаблицаНоменклатуры.Колонки.Добавить("Категория");
	ТаблицаНоменклатуры.Колонки.Добавить("ВидНоменклатурыПоУмолчанию");
	
	НоваяСтрока = ТаблицаНоменклатуры.Добавить();
	
	// Заполнение единицы измерения
	НоваяСтрока.ЕдиницаИзмерения.Вставить("ОКЕИ"                , ДанныеЗаполнения.КодЕдиницыИзмерения);
	НоваяСтрока.ЕдиницаИзмерения.Вставить("Наименование"        , ДанныеЗаполнения.ПредставлениеЕдиницыИзмерения);
	НоваяСтрока.ЕдиницаИзмерения.Вставить("ЧислительКратности"  , ДанныеЗаполнения.ЧислительУпаковки);
	
	// Заполнение ставки НДС
	МодульОбменСКонтрагентамиПовтИсп = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиИнтеграция");
	НоваяСтрока.СтавкаНДС = МодульОбменСКонтрагентамиПовтИсп.СтавкаНДСИзСоответствия(, ДанныеЗаполнения.СтавкаНДС);
	
	// Заполнение остальных полей
	НоваяСтрока.Наименование               = ДанныеЗаполнения.Наименование;
	НоваяСтрока.Идентификатор              = ДанныеЗаполнения.Идентификатор;
	НоваяСтрока.Артикул                    = ДанныеЗаполнения.Артикул;
	НоваяСтрока.ВидНоменклатурыПоУмолчанию = Новый Структура("ВидНоменклатуры", ДанныеЗаполнения.ВидНоменклатуры);
	
	АдресРезультата = ПоместитьВоВременноеХранилище(ТаблицаНоменклатуры);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РаботаСНоменклатурой_АдресДанныхЗаполнения", АдресРезультата);
	ПараметрыОткрытия.Вставить("РежимВыбора"                               , Истина);
	
	Результат.Вставить("ПараметрыОткрытия", ПараметрыОткрытия);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьФормуЭлемента(Знач Типы)
	
	Если Типы.Количество() <> 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипМетаданных = Метаданные.НайтиПоТипу(Типы[0]);
	
	Если Метаданные.Справочники.Содержит(ТипМетаданных) Тогда
		Возврат "Справочник." + ТипМетаданных.Имя + ".ФормаОбъекта";
	ИначеЕсли Метаданные.Документы.Содержит(ТипМетаданных) Тогда
		Возврат "Документ." + ТипМетаданных.Имя + ".ФормаОбъекта";
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидНоменклатуры(Знач Номенклатура)
	
	ВидНоменклатуры = Неопределено;
	МодульРаботаСНоменклатуройПереопределяемый = ОбщегоНазначения.ОбщийМодуль("РаботаСНоменклатуройПереопределяемый");
	МодульРаботаСНоменклатуройПереопределяемый.ПолучитьВидНоменклатуры(Номенклатура, ВидНоменклатуры);
	
	Возврат ВидНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ПроверкаСпискаТоваров(Отказ, ПроверкаЕстьРаботаСНоменклатурой = Ложь)

	// Проверка
	Для ТекИндекс = 0 По Товары.Количество() - 1 Цикл

		ТекущаяСтрока = Товары[ТекИндекс];
		НомерСтроки = ТекИндекс + 1;

		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Или (Не ПроверкаЕстьРаботаСНоменклатурой
			Или (Не ЗначениеЗаполнено(ТекущаяСтрока.ВидНоменклатуры) И ИспользоватьВидыНоменклатуры)) Тогда
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				ТекстШаблонаОшибки = НСтр("ru='Не заполнено поле %1 в строке %2.'");
				ТекстОшибки = СтрШаблон(ТекстШаблонаОшибки, Элементы.ТоварыНоменклатура.Заголовок, НомерСтроки);
			Иначе
				ТекстШаблонаОшибки = НСтр(
					"ru = 'В строке %1 не удалось создать номенклатуру автоматически, создайте или выберите вручную.'");
				ТекстОшибки = СтрШаблон(ТекстШаблонаОшибки, НомерСтроки);
			КонецЕсли;
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"Товары", НомерСтроки, "Номенклатура"), , Отказ);
		КонецЕсли;

		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Характеристика) И ТекущаяСтрока.ХарактеристикиИспользуются = Истина Тогда
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.Характеристика) Тогда
				ТекстШаблонаОшибки = НСтр("ru='Не заполнено поле %1 в строке %2.'");
				ТекстОшибки = СтрШаблон(ТекстШаблонаОшибки, Элементы.ТоварыХарактеристика.Заголовок, НомерСтроки);
			Иначе
				ТекстШаблонаОшибки = НСтр(
					"ru = 'В строке %1 не удалось создать характеристику автоматически, создайте или выберите вручную.'");
				ТекстОшибки = СтрШаблон(ТекстШаблонаОшибки, НомерСтроки);
			КонецЕсли;
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"Товары", НомерСтроки, "Характеристика"), , Отказ);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьХарактеристикиИспользуются()
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
		Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Товары, СтруктураДействий);
	
КонецПроцедуры

// Формирует данные для таблицы поставщиков на основании переданного списка заказов и коммерческих предложений
// 
// Параметры:
//  КоммерческиеПредложения - массив из ДокументСсылка.КоммерческоеПредложениеПоставщика - список коммерческих предложений
//  Заказы - массив из ДокументСсылка.ЗаказПоставщику - список заказов
// 
// Возвращаемое значение:
//  Массив из структура - данные для заполнения табличной части ДокументыПоставщика. Содержит свойства:
//	 *КоммерческоеПредложение - ДокументСсылка.КоммерческоеПредложениеПоставщика - коммерческое предложение
&НаСервереБезКонтекста
Функция ДанныеДляТаблицыПоставщиков(КоммерческиеПредложения, Заказы)
	
	РезультатВыполнения = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КоммерческоеПредложениеПоставщика.Ссылка КАК КоммерческоеПредложение,
	|	КоммерческоеПредложениеПоставщика.Анкета КАК Анкета,
	|	КоммерческоеПредложениеПоставщика.ИдентификаторВСервисе КАК ИдентификаторВСервисе,
	|	ИСТИНА КАК КоммерческоеПредложениеСоздано,
	|	НЕОПРЕДЕЛЕНО КАК Заказ,
	|	ЛОЖЬ КАК ЗаказСоздан,
	|	КоммерческоеПредложениеПоставщика.Организация КАК Организация,
	|	КоммерческоеПредложениеПоставщика.Контрагент КАК Контрагент,
	|	КоммерческоеПредложениеПоставщика.СуммаДокумента КАК СуммаДокумента,
	|	КоммерческоеПредложениеПоставщика.Валюта КАК Валюта
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	Документ.КоммерческоеПредложениеПоставщика КАК КоммерческоеПредложениеПоставщика
	|ГДЕ
	|	КоммерческоеПредложениеПоставщика.Ссылка В (&КоммерческиеПредложения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК КоммерческоеПредложение,
	|	НЕОПРЕДЕЛЕНО КАК Анкета,
	|	СвязиЗаказов.ИдентификаторПредложенияВСервисе КАК ИдентификаторВСервисе,
	|	ЛОЖЬ КАК КоммерческоеПредложениеСоздано,
	|	ЗаказПоставщику.Ссылка КАК Заказ,
	|	ИСТИНА КАК ЗаказСоздан,
	|	ДокументЗаказПоставщику.Организация КАК Организация,
	|	ДокументЗаказПоставщику.Контрагент КАК Контрагент,
	|	ДокументЗаказПоставщику.СуммаДокумента КАК СуммаДокумента,
	|	ДокументЗаказПоставщику.Валюта КАК Валюта
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ДокументЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаказыПоставщикамПоЗапросамКоммерческихПредложений КАК СвязиЗаказов
	|		ПО СвязиЗаказов.ЗаказПоставщику = ДокументЗаказПоставщику.Ссылка
	|ГДЕ
	|	ДокументЗаказПоставщику.Ссылка В (&Заказы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(втДанные.КоммерческоеПредложение) КАК КоммерческоеПредложение,
	|	МАКСИМУМ(втДанные.Анкета) КАК Анкета,
	|	МАКСИМУМ(втДанные.ИдентификаторВСервисе) КАК ИдентификаторПредложенияСервиса,
	|	МАКСИМУМ(втДанные.КоммерческоеПредложениеСоздано) КАК КоммерческоеПредложениеСоздано,
	|	МАКСИМУМ(втДанные.Заказ) КАК Заказ,
	|	МАКСИМУМ(втДанные.ЗаказСоздан) КАК ЗаказСоздан,
	|	втДанные.Организация КАК Организация,
	|	втДанные.Контрагент КАК Контрагент,
	|	втДанные.СуммаДокумента КАК СуммаДокумента,
	|	втДанные.Валюта КАК Валюта
	|ИЗ
	|	втДанные КАК втДанные
	|СГРУППИРОВАТЬ ПО
	|	втДанные.Организация,
	|	втДанные.Контрагент,
	|	втДанные.ИдентификаторВСервисе,
	|	втДанные.СуммаДокумента,
	|	втДанные.Валюта";
	
	Запрос.УстановитьПараметр("КоммерческиеПредложения", КоммерческиеПредложения);
	Запрос.УстановитьПараметр("Заказы", Заказы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("КоммерческоеПредложение", Выборка.КоммерческоеПредложение);
		ДанныеСтроки.Вставить("Анкета", Выборка.Анкета);
		ДанныеСтроки.Вставить("ИдентификаторПредложенияСервиса", Выборка.ИдентификаторПредложенияСервиса);
		ДанныеСтроки.Вставить("КоммерческоеПредложениеСоздано", Выборка.КоммерческоеПредложениеСоздано);
		ДанныеСтроки.Вставить("Заказ", Выборка.Заказ);
		ДанныеСтроки.Вставить("ЗаказСоздан", Выборка.ЗаказСоздан);
		ДанныеСтроки.Вставить("Организация", Выборка.Организация);
		ДанныеСтроки.Вставить("Контрагент", Выборка.Контрагент);
		ДанныеСтроки.Вставить("СуммаДокумента", Выборка.СуммаДокумента);
		ДанныеСтроки.Вставить("Валюта", Выборка.Валюта);
		
		РезультатВыполнения.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИзменитьСостояниеЗапросаКоммерческихПредложений(Документ, НовоеСостояние)
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		 Возврат Истина;
	КонецЕсли;
	
	ПараметрыОбновления = РегистрыСведений.СостоянияЗапросовКоммерческихПредложений.ТекущееСостояние(Документ);
	ПараметрыОбновления.ТекущееСостояние = НовоеСостояние;
	ПараметрыОбновления.НовоеСостояние = НовоеСостояние;
	ПараметрыОбновления.Действие = "";
	
	Возврат РегистрыСведений.СостоянияЗапросовКоммерческихПредложений.ЗаписатьСтатус(Документ, ПараметрыОбновления,
		ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.ИмяСервисаБидзаар());
	
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТовары Из ДополнительныеПараметры.СтрокиТовары Цикл
		ЗаполнитьЗначенияСвойств(СтрокаТовары, ДополнительныеПараметры.СтрокаИсточник);
		СтрокаТовары.Изменение = ЗначениеЗаполнено(СтрокаТовары.КоммерческоеПредложение);
	КонецЦикла;
	
	ОбновитьСопоставленныеПозиции(Элементы.ОтборСопоставленияНоменклатуры.СписокВыбора, Товары);
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти
