
&После("ПередЗаписью")
Процедура АУ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НачалоДня(ТекущаяДата())<>НачалоДня(Дата) Тогда
		Дата=НачалоДня(Дата)+25200;
	КонецЕсли;
	
	Для каждого стрТовары Из ЭтотОбъект.Товары Цикл
		
		Если стрТовары.СтатусУказанияСерий <> 0 
			И стрТовары.СтатусУказанияСерий <> 1
			И стрТовары.СтатусУказанияСерий <> 2
			И стрТовары.СтатусУказанияСерий <> 21
			И НЕ ЗначениеЗаполнено(стрТовары.Серия) Тогда
			
			стрТовары.Серия = АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("СерияБезСерии");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьАналитикиУчетаНоменклатурыВТабличныхЧастяхТоваров")
Процедура АУ_ЗаполнитьАналитикиУчетаНоменклатурыВТабличныхЧастяхТоваров(ТаблицыДокумента = Неопределено)

	Если ТаблицыДокумента = Неопределено Тогда
		ТаблицыДокумента = Документы.ПриобретениеТоваровУслуг.КоллекцияТабличныхЧастейТоваров();
		
		ЗаполнитьЗначенияСвойств(ТаблицыДокумента, ЭтотОбъект);
	КонецЕсли;
	
	ТаблицаТовары = ТаблицыДокумента.Товары;
	
	МестаУчета = РегистрыСведений.АналитикаУчетаНоменклатуры.МестаУчета(ХозяйственнаяОперация,
																		Склад,
																		Подразделение,
																		Партнер,
																		Договор);
	
	ОперацииВПутиИФактуровка = Новый Массив;
	ОперацииВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути);
	ОперацииВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути);
	ОперацииВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути);
	ОперацииВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки);
	ОперацииВПутиИФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки);
	
	// Если Склад - группа, то для аналитики учета номенклатуры склад берем из ТЧ
	ИменаПолей = РегистрыСведений.АналитикаУчетаНоменклатуры.ИменаПолейКоллекцииПоУмолчанию();
	
	ОперацииФактуровка = Новый Массив;
	ОперацииФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки);
	ОперацииФактуровка.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки);
	
 	Если ОперацииФактуровка.Найти(ХозяйственнаяОперация) <> Неопределено
		И (Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВариантОформленияДокументовПоступленияПоУслугам") = 
			Перечисления.ВариантыОформленияДокументовПоУслугам.ПоступлениеУслугНеИспользуется) Тогда
		
		МестаУчета.Работа = Договор;
		МестаУчета.Вставить("Услуга", Договор);
		
	Иначе
		
		ИменаПолей.Вставить("Работа", "Подразделение");
		
	КонецЕсли;
	
	ТекстПоляСкладТовар = "
		|ВЫБОР
		|	КОГДА Коллекция.СписатьНаРасходы
		|		ТОГДА Коллекция.Подразделение
		|	ИНАЧЕ НЕОПРЕДЕЛЕНО
		|КОНЕЦ";
	
	Если ЗначениеЗаполнено(Склад) Тогда
		РеквизитыСклада = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Склад, "ЭтоГруппа, ВыборГруппы");
	Иначе
		РеквизитыСклада = Новый Структура;
		РеквизитыСклада.Вставить("ЭтоГруппа",	Ложь);
		РеквизитыСклада.Вставить("ВыборГруппы",	Неопределено);
	КонецЕсли;
	
	Если РеквизитыСклада.ЭтоГруппа
		И ОперацииВПутиИФактуровка.Найти(ХозяйственнаяОперация) = Неопределено
		И РеквизитыСклада.ВыборГруппы = Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказахИНакладных Тогда
		
		ИменаПолей.Вставить("Произвольный", "Склад");
		
		ТекстПоляСкладТовар = "
			|ВЫБОР
			|	КОГДА Коллекция.СписатьНаРасходы
			|		ТОГДА Коллекция.Подразделение
			|	ИНАЧЕ Коллекция.Склад
			|КОНЕЦ";
		
	КонецЕсли;
	
	ИменаПолей.Вставить("Товар", Новый Структура("ТекстПоля", ТекстПоляСкладТовар));
	
	#Удаление
	РегистрыСведений.АналитикаУчетаНоменклатуры.ЗаполнитьВКоллекции(ТаблицаТовары, МестаУчета, ИменаПолей);
	#КонецУдаления
	#Вставка
	Если СокрЛП(ТаблицаТовары) = "ДокументТабличнаяЧасть.ПриобретениеТоваровУслуг.Товары" Тогда
		Для каждого стрТовары Из ТаблицаТовары Цикл
			
			Если ЗначениеЗаполнено(стрТовары.Склад) Тогда
				МестаУчета.Произвольный = стрТовары.Склад;
			Иначе
				МестаУчета.Произвольный = ЭтотОбъект.Склад;
			КонецЕсли;
			
			ТЗ = ТаблицаТовары.Выгрузить(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(стрТовары));
			ТЗ[0].НомерСтроки = 1;
			РегистрыСведений.АналитикаУчетаНоменклатуры.ЗаполнитьВКоллекции(ТЗ, МестаУчета, ИменаПолей);
			
			стрТовары.АналитикаУчетаНоменклатуры = ТЗ[0].АналитикаУчетаНоменклатуры;
			
		КонецЦикла;
	КонецЕсли;
	#КонецВставки
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура АУ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ДокументОснование")	И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Комментарий=ДанныеЗаполнения.ДокументОснование.Комментарий;
		ИначеЕсли ДанныеЗаполнения.Свойство("ДокументОснование") И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("Массив") Тогда
			Для каждого стр Из ДанныеЗаполнения.ДокументОснование Цикл
				Комментарий=стр.Комментарий;
				Прервать;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Комментарий=ДанныеЗаполнения.Комментарий;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		ЭтотОбъект.Организация = АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("ОрганизацияАурум");
	КонецЕсли;
	
КонецПроцедуры

&После("ЗаполнитьДокументНаОснованииЗаказаПоставщику")
Процедура АУ_ЗаполнитьДокументНаОснованииЗаказаПоставщику(Знач ДокументОснование, Знач СкладПоступления, РеквизитыЗаказа)
	
	Если ТипЗнч(ДокументОснование)=Тип("Массив") Тогда
		
		Для каждого стрЗаказ Из ДокументОснование Цикл
			
			Для каждого стрТовары Из ЭтотОбъект.Товары Цикл
				НайденныеСтроки=стрЗаказ.Товары.НайтиСтроки(Новый Структура("КодСтроки,Номенклатура,Характеристика",стрТовары.КодСтроки,стрТовары.Номенклатура,стрТовары.Характеристика));
				Если НайденныеСтроки.Количество()>0 Тогда
					стрТовары.АУ_Шифр=НайденныеСтроки[0].АУ_Шифр;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		
		Для каждого стрТовары Из ДокументОснование Цикл
			НайденныеСтроки=стрЗаказ.Товары.НайтиСтроки(Новый Структура("КодСтроки,Номенклатура,Характеристика",стрТовары.КодСтроки,стрТовары.Номенклатура,стрТовары.Характеристика));
			Если НайденныеСтроки.Количество()>0 Тогда
				стрТовары.АУ_Шифр=НайденныеСтроки[0].АУ_Шифр;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура АУ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
	
КонецПроцедуры
