#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	АУ_СозданиеЭлементовФормы.СоздатьПоле(
		ЭтаФорма,
		"АУ_ЗаказКлиента",
		"ГруппаШапкаПраво",
		НСтр("ru = 'Заказ клиента'"),
		1,
		"Объект.АУ_ЗаказКлиента");

	АУ_СозданиеЭлементовФормы.СоздатьПоле(
		ЭтаФорма,
		"ПрочиеРасходыАУ_ЗаказКлиента",
		"ПрочиеРасходы",
		НСтр("ru = 'Заказ клиента'"),
		1,
		"Объект.ПрочиеРасходы.АУ_ЗаказКлиента");

	АУ_СозданиеЭлементовФормы.СоздатьПоле(
		ЭтаФорма,
		"ОплатаПоставщикамАУ_ЗаказКлиента",
		"ОплатаПоставщикам",
		НСтр("ru = 'Заказ клиента'"),
		1,
		"Объект.ОплатаПоставщикам.АУ_ЗаказКлиента");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
