#Область СлужебныйПрограммныйИнтерфейс

// Возвращает допустимые детализации структуры хранения по документу, доступные при открытии формы проверки и подбора.
// Параметры:
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС - доступные детализации.
Функция ДопустимыеДетализацииСтруктурыХранения(ПараметрыСканирования) Экспорт
	
	ВозможныеДетализации = Новый Массив;
	
	ВозможныеДетализации.Добавить(ПредопределенноеЗначение("Перечисление.ДетализацияСтруктурыХраненияИС.Полная"));
	
	Если (ПараметрыСканирования.ЕГАИС И Не ПараметрыСканирования.ИСМП)
		Или ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЭтоМаркировкаТоваровИСМП(ПараметрыСканирования) Тогда
		Возврат ВозможныеДетализации;
	КонецЕсли;
	
	ВозможныеДетализации.Добавить(ПредопределенноеЗначение("Перечисление.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки"));
	ВозможныеДетализации.Добавить(ПредопределенноеЗначение("Перечисление.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами"));
	ВозможныеДетализации.Добавить(ПредопределенноеЗначение("Перечисление.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками"));
	
	Возврат ВозможныеДетализации;
	
КонецФункции

// Подготовливает параметр сканирования ДополнительныеВариантыСопоставленияНоменклатуры
//
// Параметры:
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ПодобраннаяМаркируемаяПродукция - ДанныеФормыКоллекция Из ДанныеФормыСтруктура - Таблица ПодобраннаяМаркируемаяПродукция из формы проверки и подбора:
//    * GTIN - Строка - GTIN
//    * Номенклатура - ОпределяемыйТип.Номенклатура - Номенклатура
//    * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - Характеристика номенклатуры
//    * Серия - ОпределяемыйТип.СерияНоменклатуры - Серия номенклатуры
//
Процедура ПодготовитьДополнительныеВариантыСопоставленияНоменклатуры(ПараметрыСканирования, ПодобраннаяМаркируемаяПродукция) Экспорт
	
	ВариантыСопоставления = ПараметрыСканирования.ДополнительныеВариантыСопоставленияНоменклатуры;
	Если ВариантыСопоставления = Неопределено Тогда
		ВариантыСопоставления = Новый Соответствие();
		ПараметрыСканирования.ДополнительныеВариантыСопоставленияНоменклатуры = ВариантыСопоставления;
	КонецЕсли;
	
	Для Каждого СтрокаТовары Из ПодобраннаяМаркируемаяПродукция Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовары.GTIN) Тогда
			Продолжить;
		КонецЕсли;
		EAN = РазборКодаМаркировкиИССлужебныйКлиентСервер.ШтрихкодEANИзGTIN(СтрокаТовары.GTIN);
		ВариантСопоставления = Новый Структура("Номенклатура,Характеристика,Серия");
		ЗаполнитьЗначенияСвойств(ВариантСопоставления, СтрокаТовары);
		ДанныеВариантовСопоставления = ВариантыСопоставления[EAN];
		ДобавитьВариантСопоставления = Истина;
		Если ДанныеВариантовСопоставления = Неопределено Тогда
			ДанныеВариантовСопоставления = Новый Массив();
			ВариантыСопоставления.Вставить(EAN, ДанныеВариантовСопоставления);
		Иначе
			Для Каждого СуществующийВариантСопоставления Из ДанныеВариантовСопоставления Цикл
				ВариантСопоставленияДобавлен = Истина;
				Для Каждого КлючиЗначение Из СуществующийВариантСопоставления Цикл
					Если КлючиЗначение.Значение <> ВариантСопоставления[КлючиЗначение.Ключ] Тогда
						ВариантСопоставленияДобавлен = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если Не ВариантСопоставленияДобавлен Тогда
					ДобавитьВариантСопоставления = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ДобавитьВариантСопоставления Тогда
			ДанныеВариантовСопоставления.Добавить(ВариантСопоставления);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ПредставлениеПолейДереваМаркированнойПродукции

Функция ТипУпаковкиПотребительскиеУпаковкиБезУпаковки() Экспорт
	Возврат ПредопределенноеЗначение("Перечисление.ПрочиеЗоныПересчетаПродукцииИС.ПачкиБезБлока");
КонецФункции

Функция ТипУпаковкиГрупповыеУпаковкиБезКоробки() Экспорт
	Возврат ПредопределенноеЗначение("Перечисление.ПрочиеЗоныПересчетаПродукцииИС.БлокиБезКоробки");
КонецФункции

Функция ТипУпаковкиОбъемноСортовойУчет() Экспорт
	Возврат ПредопределенноеЗначение("Перечисление.ПрочиеЗоныПересчетаПродукцииИС.ОбъемноСортовойУчет");
КонецФункции

Функция ТипУпаковкиГруппировкаОбъемноСортовогоУчетаПоGTIN() Экспорт
	Возврат ПредопределенноеЗначение("Перечисление.ПрочиеЗоныПересчетаПродукцииИС.ГруппировкаОбъемноСортовогоУчетаПоGTIN");
КонецФункции

Процедура УстановитьИндексКартинкиСтатусаПроверки(ТекущаяСтрока) Экспорт
	
	Если ТекущаяСтрока.НедопустимыйКодМаркировки Тогда
		
		ТекущаяСтрока.ИндексКартинкиСтатусПроверки = 1;
		
	ИначеЕсли ТекущаяСтрока.ТипУпаковки = ТипУпаковкиГрупповыеУпаковкиБезКоробки()
		Или ТекущаяСтрока.ТипУпаковки = ТипУпаковкиПотребительскиеУпаковкиБезУпаковки() Тогда
		
		ТекущаяСтрока.ИндексКартинкиСтатусПроверки = 5;
		
	ИначеЕсли ТекущаяСтрока.ТипУпаковки = ТипУпаковкиОбъемноСортовойУчет()
		Или ТекущаяСтрока.ТипУпаковки = ТипУпаковкиГруппировкаОбъемноСортовогоУчетаПоGTIN() Тогда
		
		ТекущаяСтрока.ИндексКартинкиСтатусПроверки = 5;
		
	ИначеЕсли ТекущаяСтрока.СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиНаличияПродукцииИС.ВНаличии") Тогда
		
		ТекущаяСтрока.ИндексКартинкиСтатусПроверки = 0;
		
	ИначеЕсли ТекущаяСтрока.СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиНаличияПродукцииИС.Отсутствует") Тогда

		ТекущаяСтрока.ИндексКартинкиСтатусПроверки = 1;
		
	ИначеЕсли ТекущаяСтрока.СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиНаличияПродукцииИС.НеПроверялась") Тогда
		
		ТекущаяСтрока.ИндексКартинкиСтатусПроверки = 2;
		
	ИначеЕсли ТекущаяСтрока.СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиНаличияПродукцииИС.Отложена") Тогда
		
		ТекущаяСтрока.ИндексКартинкиСтатусПроверки = 3;
		
	ИначеЕсли ТекущаяСтрока.СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиНаличияПродукцииИС.НеЧислилась") Тогда
		
		ТекущаяСтрока.ИндексКартинкиСтатусПроверки = 4;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПредставлениеДляСтрокиДереваМаркированнойПродукции(ТекущаяСтрока, ЕГАИС = Ложь, ИСМП = Ложь, Прочее = Ложь) Экспорт
	
	Если ТекущаяСтрока.ТипУпаковки = ТипУпаковкиПотребительскиеУпаковкиБезУпаковки() Тогда
		ТекущаяСтрока.Представление = НСтр("ru = 'Потребительские упаковки'");
	ИначеЕсли ТекущаяСтрока.ТипУпаковки = ТипУпаковкиГрупповыеУпаковкиБезКоробки() Тогда
		ТекущаяСтрока.Представление = НСтр("ru = 'Групповые упаковки и наборы'");
	ИначеЕсли ТекущаяСтрока.ТипУпаковки = ТипУпаковкиОбъемноСортовойУчет() Тогда
		Если Не ИСМП Тогда
			ТекущаяСтрока.Представление = НСтр("ru = 'Немаркируемая продукция'");
		ИначеЕсли Не Прочее Тогда
			ТекущаяСтрока.Представление = НСтр("ru = 'Продукция объемно-сортового учета'");
		Иначе
			ТекущаяСтрока.Представление = НСтр("ru = 'Продукция объемно-сортового учета и немаркируемая продукция'");
		КонецЕсли;
	ИначеЕсли ТекущаяСтрока.ТипУпаковки = ТипУпаковкиГруппировкаОбъемноСортовогоУчетаПоGTIN() Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.GTIN) Тогда
			ТекущаяСтрока.Представление = ТекущаяСтрока.GTIN;
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.АлкогольнаяПродукция) Тогда
			ТекущаяСтрока.Представление = ТекущаяСтрока.АлкогольнаяПродукция;
		КонецЕсли;
	ИначеЕсли ПустаяСтрока(ТекущаяСтрока.Штрихкод) И ИнтеграцияИСКлиентСервер.ЭтоУпаковка(ТекущаяСтрока.ТипУпаковки) Тогда
		ТекущаяСтрока.Представление = НСтр("ru = '<не маркирована>'");
	Иначе
		ТекущаяСтрока.Представление = ТекущаяСтрока.Штрихкод;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПредставлениеСодержимогоУпаковки(ТекущаяСтрока) Экспорт
	
	// По умолчанию (алкогольная продукция или номенклатура)
	ПредставлениеСодержимоеУпаковки = "";
	Если ЗначениеЗаполнено(ТекущаяСтрока.АлкогольнаяПродукция) Тогда
		ПредставлениеСодержимоеУпаковки = ТекущаяСтрока.АлкогольнаяПродукция;
	ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Характеристика) И Не ЗначениеЗаполнено(ТекущаяСтрока.Серия) Тогда
			ПредставлениеСодержимоеУпаковки = ТекущаяСтрока.Номенклатура;
		Иначе
			ПредставлениеСодержимоеУпаковки = ИнтеграцияИСКлиентСервер.ПредставлениеНоменклатуры(
				ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Характеристика,, ТекущаяСтрока.Серия);
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура)
		И ЗначениеЗаполнено(ТекущаяСтрока.ПредставлениеСодержимоеУпаковки)
		И ТекущаяСтрока.ТипУпаковки = ПредопределенноеЗначение("Перечисление.ТипыУпаковок.МаркированныйТовар") Тогда
		ПредставлениеСодержимоеУпаковки = ТекущаяСтрока.ПредставлениеСодержимоеУпаковки;
	КонецЕсли;
	
	ТекущаяСтрока.ПредставлениеСодержимоеУпаковки = ПредставлениеСодержимоеУпаковки;
	
	Если ТекущаяСтрока.ТипУпаковки = ПредопределенноеЗначение("Перечисление.ТипыУпаковок.МаркированныйТовар") Тогда
		
		// Частичное выбытие
		Если ТекущаяСтрока.ЧастичноеВыбытие Тогда
			ТекущаяСтрока.ПредставлениеСодержимоеУпаковки = СтрШаблон(
				НСтр("ru = '%1 - %2%3'"),
				ТекущаяСтрока.Количество,
				ТекущаяСтрока.ПредставлениеСодержимоеУпаковки,
				?(ТекущаяСтрока.ВыбытиеБутылки, НСтр("ru = ' (выб.)'"), ""));
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.НеЯвляетсяУпаковкой") И ТекущаяСтрока.ТребуетВзвешивания Тогда
		//не сбрасывать представление
	ИначеЕсли ТекущаяСтрока.КоличествоПодчиненныхВсего = 0 И ТекущаяСтрока.Количество = 0 Тогда
		
		// Служебные
		Если ТекущаяСтрока.ТипУпаковки = ТипУпаковкиПотребительскиеУпаковкиБезУпаковки()
			Или ТекущаяСтрока.ТипУпаковки = ТипУпаковкиГрупповыеУпаковкиБезКоробки()
			Или ТекущаяСтрока.ТипУпаковки = ТипУпаковкиОбъемноСортовойУчет()
			Или ТекущаяСтрока.ТипУпаковки = ТипУпаковкиГруппировкаОбъемноСортовогоУчетаПоGTIN() Тогда
			ТекущаяСтрока.ПредставлениеСодержимоеУпаковки = НСтр("ru = '<нет>'");
		ИначеЕсли ТекущаяСтрока.СодержимоеНедоступно Тогда
			ТекущаяСтрока.ПредставлениеСодержимоеУпаковки = НСтр("ru = '<состав недоступен>'");
		// Новая групповая упаковка
		ИначеЕсли ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Групповая") Тогда
			
			ТекущаяСтрока.ПредставлениеСодержимоеУпаковки = СтрШаблон(НСтр("ru = '<пустая групповая упаковка %1>'"), ПредставлениеСодержимоеУпаковки);
			
		// Новый набор
		ИначеЕсли ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор") Тогда
			
			ТекущаяСтрока.ПредставлениеСодержимоеУпаковки = СтрШаблон(НСтр("ru = '<пустой набор %1>'"), ПредставлениеСодержимоеУпаковки);
			
		// Строка ОСУ
		ИначеЕсли ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.ОбъемноСортовойУчет") Тогда
			Если Не ЗначениеЗаполнено(ПредставлениеСодержимоеУпаковки) Тогда
				ТекущаяСтрока.ПредставлениеСодержимоеУпаковки = НСтр("ru = '<объемно-сортовой учет>'");
			КонецЕсли;
		Иначе
			ТекущаяСтрока.ПредставлениеСодержимоеУпаковки = НСтр("ru = '<пустая упаковка>'");
		КонецЕсли;
		
	Иначе
		
		//Содержимое известной упаковки
		ПредставлениеСодержимоеУпаковки = Новый Массив;
		
		Если ТекущаяСтрока.ТипУпаковки <> ТипУпаковкиОбъемноСортовойУчет()
			И ТекущаяСтрока.ТипУпаковки <> ТипУпаковкиГруппировкаОбъемноСортовогоУчетаПоGTIN() Тогда
			
			Если ТекущаяСтрока.КоличествоПодчиненныхУпаковок > 0 Тогда
				ПредставлениеСодержимоеУпаковки.Добавить(
					СтрШаблон(НСтр("ru = 'коробов - %1'"), ТекущаяСтрока.КоличествоПодчиненныхУпаковок));
			КонецЕсли;
			
			Если ТекущаяСтрока.КоличествоПодчиненныхГрупповыхУпаковок > 0 Тогда
				ПредставлениеСодержимоеУпаковки.Добавить(
					СтрШаблон(НСтр("ru = 'групповых упаковок - %1'"), ТекущаяСтрока.КоличествоПодчиненныхГрупповыхУпаковок));
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекущаяСтрока.ВидУпаковки <> ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор") Тогда
			Если ТекущаяСтрока.КоличествоПодчиненныхПотребительскихУпаковок > 0 Тогда
				ПредставлениеСодержимоеУпаковки.Добавить(
					СтрШаблон(НСтр("ru = 'товаров - %1'"), ТекущаяСтрока.КоличествоПодчиненныхПотребительскихУпаковок));
			ИначеЕсли ТекущаяСтрока.Количество > 0 Тогда
				ПредставлениеСодержимоеУпаковки.Добавить(
					СтрШаблон(НСтр("ru = 'товаров - %1'"), ТекущаяСтрока.Количество));
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ПредставлениеСодержимоеУпаковки) Тогда
			
			ПредставлениеСодержимоеУпаковки.Добавить(ТекущаяСтрока.ПредставлениеСодержимоеУпаковки);
			
		КонецЕсли;
		
		ТекущаяСтрока.ПредставлениеСодержимоеУпаковки = СтрСоединить(ПредставлениеСодержимоеУпаковки, ", ");
		
	КонецЕсли;
	
	Если ТекущаяСтрока.ТребуетсяПеремаркировка Тогда
		
		ТекущаяСтрока.ПредставлениеСодержимоеУпаковки = СтрШаблон(
			НСтр("ru = '(требуется разборка) %1'"),
			ТекущаяСтрока.ПредставлениеСодержимоеУпаковки);
		
	КонецЕсли;
	
	// Весовая продукция
	Если (ЗначениеЗаполнено(ТекущаяСтрока.ВидУпаковки)
			Или ТекущаяСтрока.ТипУпаковки = ПредопределенноеЗначение("Перечисление.ПрочиеЗоныПересчетаПродукцииИС.ГруппировкаОбъемноСортовогоУчетаПоGTIN"))
		И ТекущаяСтрока.ПроизвольнаяЕдиницаУчета Тогда
		
		ОтображатьКоличество = Истина;
		
		Если ИнтеграцияИСКлиентСервер.ЭтоУпаковка(ТекущаяСтрока.ТипУпаковки) Тогда
			ОтображатьКоличество = (ТекущаяСтрока.КоличествоПодчиненныхВсего > 0 И ТекущаяСтрока.Количество > 0)
				Или ТекущаяСтрока.КоличествоПодчиненныхПотребительскихУпаковок > 0
				Или (ТекущаяСтрока.ТребуетВзвешивания И Не ТекущаяСтрока.МаркируемаяПродукция);
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.ЧастичноеВыбытиеВариантУчета) Тогда
			ОтображатьКоличество = Ложь;
		КонецЕсли;
		
		Если ОтображатьКоличество Тогда
			ТекущаяСтрока.ПредставлениеСодержимоеУпаковки = СтрШаблон("%1 x %2",
				Формат(ТекущаяСтрока.Количество, "ЧДЦ=3; ЧН="), ТекущаяСтрока.ПредставлениеСодержимоеУпаковки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьВыводимоеПредставлениеПроверкиСодержимого(Форма, ТекущаяСтрока) Экспорт

	Элементы = Форма.Элементы;
	
	Если ТекущаяСтрока = Неопределено
		Или Не ИнтеграцияИСКлиентСервер.ЭтоУпаковка(ТекущаяСтрока.ТипУпаковки)
		Или (ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.ОбъемноСортовойУчет")
			И ТекущаяСтрока.КоличествоПодчиненныхВсего = 0) Тогда
		
		Форма.ВыводимоеПредставлениеПроверкиСодержимого = "";
		Элементы.СтраницыПредставлениеПроверкиПодчиненных.ТекущаяСтраница = Элементы.СтраницаПредставлениеПроверкиПодчиненныхАвто;
		
	Иначе
		
		Форма.ВыводимоеПредставлениеПроверкиСодержимого = ТекущаяСтрока.ПредставлениеПроверкиПодчиненных;
		
		Если ТекущаяСтрока.КоличествоПодчиненныхОтсутствует > 0 Тогда
			
			Элементы.СтраницыПредставлениеПроверкиПодчиненных.ТекущаяСтраница = Элементы.СтраницаПредставлениеПроверкиПодчиненныхКрасный;
			
		ИначеЕсли ТекущаяСтрока.КоличествоПодчиненныхОтложено > 0 Тогда
		
			Элементы.СтраницыПредставлениеПроверкиПодчиненных.ТекущаяСтраница = Элементы.СтраницаПредставлениеПроверкиПодчиненныхЖелтый;
			
		Иначе
			
			Элементы.СтраницыПредставлениеПроверкиПодчиненных.ТекущаяСтраница = Элементы.СтраницаПредставлениеПроверкиПодчиненныхАвто;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСтрокуГрупповыеУпаковкиБезКоробки(ТекущаяСтрока) Экспорт
	
	ТекущаяСтрока.ТипУпаковки = ТипУпаковкиГрупповыеУпаковкиБезКоробки();
	
	СформироватьПредставлениеДляСтрокиДереваМаркированнойПродукции(ТекущаяСтрока, Ложь, Истина);
	УстановитьИндексКартинкиТипаУпаковки(ТекущаяСтрока);
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуПродукцияБезУпаковки(ТекущаяСтрока, ЕГАИС = Истина, ИСМП = Истина) Экспорт
	
	ТекущаяСтрока.ТипУпаковки = ТипУпаковкиПотребительскиеУпаковкиБезУпаковки();
	
	СформироватьПредставлениеДляСтрокиДереваМаркированнойПродукции(ТекущаяСтрока, ЕГАИС, ИСМП);
	УстановитьИндексКартинкиТипаУпаковки(ТекущаяСтрока);
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуГруппировкаОбъемноСортовогоУчетаПоGTIN(ТекущаяСтрока) Экспорт
	
	ТекущаяСтрока.ТипУпаковки = ТипУпаковкиГруппировкаОбъемноСортовогоУчетаПоGTIN();
	
	СформироватьПредставлениеДляСтрокиДереваМаркированнойПродукции(ТекущаяСтрока, Ложь, Истина);
	УстановитьИндексКартинкиТипаУпаковки(ТекущаяСтрока);
	
КонецПроцедуры

Процедура УстановитьИндексКартинкиТипаУпаковки(ТекущаяСтрока) Экспорт
	
	Если ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Групповая")
		Или ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор") Тогда
		
		Если ТекущаяСтрока.Свойство("ИдетПроверкаДаннойУпаковки")
			И ТекущаяСтрока.ИдетПроверкаДаннойУпаковки Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 4;
		Иначе
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 3;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая") Тогда
		
		Если ТекущаяСтрока.Свойство("ИдетПроверкаДаннойУпаковки")
			И ТекущаяСтрока.ИдетПроверкаДаннойУпаковки Тогда
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 1;
		Иначе
			ТекущаяСтрока.ИндексКартинкиТипУпаковки = 0;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтрока.ТипУпаковки = ПредопределенноеЗначение("Перечисление.ТипыУпаковок.МаркированныйТовар") Тогда
		
		ТекущаяСтрока.ИндексКартинкиТипУпаковки = 2;
		
	ИначеЕсли ТекущаяСтрока.ТипУпаковки = ТипУпаковкиПотребительскиеУпаковкиБезУпаковки() Тогда
		
		ТекущаяСтрока.ИндексКартинкиТипУпаковки = 2;
		
	ИначеЕсли ТекущаяСтрока.ТипУпаковки = ТипУпаковкиГрупповыеУпаковкиБезКоробки() Тогда
		
		ТекущаяСтрока.ИндексКартинкиТипУпаковки = 3;
		
	ИначеЕсли ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.ОбъемноСортовойУчет")
		Или ТекущаяСтрока.ТипУпаковки = ТипУпаковкиОбъемноСортовойУчет()
		Или ТекущаяСтрока.ТипУпаковки = ТипУпаковкиГруппировкаОбъемноСортовогоУчетаПоGTIN() Тогда
		
		ТекущаяСтрока.ИндексКартинкиТипУпаковки = 5;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОпределениеТипаУпаковки

Процедура УстановитьЗначениеДляУпаковки(СтрокаДерева,
	ИмяКолонкиЗначения, ИмяКолонкиЕстьРазличные,
	МассивЗначений, ЕстьРазличныеБезусловно, УстанавливатьЗначение = Истина) Экспорт
	
	Если ЕстьРазличныеБезусловно Тогда
		
		Если УстанавливатьЗначение Тогда
			СтрокаДерева[ИмяКолонкиЗначения] = Неопределено;
		КонецЕсли;
		
		СтрокаДерева[ИмяКолонкиЕстьРазличные] = Истина;
		
	ИначеЕсли МассивЗначений.Количество() = 0 Тогда
		
		Если УстанавливатьЗначение Тогда
			СтрокаДерева[ИмяКолонкиЗначения] = Неопределено;
		КонецЕсли;
		
		СтрокаДерева[ИмяКолонкиЕстьРазличные] = Ложь;
		
	ИначеЕсли МассивЗначений.Количество() = 1 Тогда
		
		Если УстанавливатьЗначение Тогда
			
			Значение = Неопределено;
			Для Каждого КлючИЗначение Из МассивЗначений Цикл
				Значение = КлючИЗначение.Ключ;
			КонецЦикла;
			
			СтрокаДерева[ИмяКолонкиЗначения] = Значение;
			
		КонецЕсли;
		
		СтрокаДерева[ИмяКолонкиЕстьРазличные] = Ложь;
		
	Иначе
		
		Если УстанавливатьЗначение Тогда
			СтрокаДерева[ИмяКолонкиЗначения] = Неопределено;
		КонецЕсли;
		
		СтрокаДерева[ИмяКолонкиЕстьРазличные] = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Перемаркировка

Процедура ОтобразитьИнформациюОНеобходимостиПеремаркировки(Форма) Экспорт
	
	Если Форма.КоличествоУпаковокКоторыеНеобходимоПеремаркировать > 0 Тогда
		Форма.Элементы.ДекорацияИнформацияТребуетсяПеремаркировка.Заголовок = ЗаголовокТребуетсяПеремаркировка(Форма);
		Форма.Элементы.ГруппаТребуетсяПеремаркировка.Видимость = Истина;
	Иначе
		Форма.Элементы.ГруппаТребуетсяПеремаркировка.Видимость = Ложь;
	КонецЕсли;
	
	Форма.ТребуетсяОбновитьИнформациюОНеобходимостиПеремаркировки = Ложь;
	
КонецПроцедуры

Процедура ПроверитьНеобходимостьПеремаркировки(Форма, ТаблицаПеремаркировки, ЭтоВыборочнаяПроверка) Экспорт
	
	Если ТаблицаПеремаркировки.Количество() = 0 Тогда
		Форма.КоличествоУпаковокКоторыеНеобходимоПеремаркировать = 0;
		ОтобразитьИнформациюОНеобходимостиПеремаркировки(Форма);
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоВыборочнаяПроверка Тогда
		Форма.КоличествоУпаковокКоторыеНеобходимоПеремаркировать = 0;
	КонецЕсли;
	
	Для Каждого СтрокаПеремаркировки Из ТаблицаПеремаркировки Цикл
		СтрокаДерева = Форма.ДеревоМаркированнойПродукции.НайтиПоИдентификатору(СтрокаПеремаркировки.ИдентификаторВДереве);
		
		Если СтрокаДерева <> Неопределено Тогда
			ТребуетсяПеремаркировка = СтрокаПеремаркировки.ТребуетсяПеремаркировка 
				И Не СтрокаДерева.СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиНаличияПродукцииИС.Отсутствует");
				
			Если ЭтоВыборочнаяПроверка Тогда
				Если СтрокаДерева.ТребуетсяПеремаркировка И Не ТребуетсяПеремаркировка Тогда
					Форма.КоличествоУпаковокКоторыеНеобходимоПеремаркировать = Форма.КоличествоУпаковокКоторыеНеобходимоПеремаркировать - 1; 
				ИначеЕсли Не СтрокаДерева.ТребуетсяПеремаркировка И ТребуетсяПеремаркировка Тогда
					Форма.КоличествоУпаковокКоторыеНеобходимоПеремаркировать = Форма.КоличествоУпаковокКоторыеНеобходимоПеремаркировать + 1;
				КонецЕсли;
			ИначеЕсли ТребуетсяПеремаркировка Тогда
				Форма.КоличествоУпаковокКоторыеНеобходимоПеремаркировать = Форма.КоличествоУпаковокКоторыеНеобходимоПеремаркировать + 1;
			КонецЕсли;
			
			СтрокаДерева.ТребуетсяПеремаркировка = ТребуетсяПеремаркировка;
			СформироватьПредставлениеСодержимогоУпаковки(СтрокаДерева);
			
			Если ЭтоВыборочнаяПроверка И Форма.УстановленОтборТребуетсяПеремаркировать Тогда
				ПроверитьСоответствиеОтборуТребуетсяПеремаркировка(СтрокаДерева);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОтобразитьИнформациюОНеобходимостиПеремаркировки(Форма);
	
КонецПроцедуры

Процедура УстановитьОтборТребуетсяПеремаркировкаВСтрокеДерева(СтрокаДерева, СоответствуетОтбору) Экспорт
	
	ТекущаяСтрокаСоответствуетОтбору = Ложь;
	
	ПодчиненныеСтроки = СтрокаДерева.ПолучитьЭлементы();
	
	Для Каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
		СоответствуетОтбору = Ложь;
		
		УстановитьОтборТребуетсяПеремаркировкаВСтрокеДерева(ПодчиненнаяСтрока, СоответствуетОтбору);
		
		Если СоответствуетОтбору Тогда
			ТекущаяСтрокаСоответствуетОтбору = Истина;
		КонецЕсли;
	КонецЦикла;

	Если Не ТекущаяСтрокаСоответствуетОтбору Тогда
		ТекущаяСтрокаСоответствуетОтбору = СтрокаДерева.ТребуетсяПеремаркировка;
	КонецЕсли;
	
	СоответствуетОтбору = ТекущаяСтрокаСоответствуетОтбору;
	СтрокаДерева.НеСоответствуетОтбору = Не СоответствуетОтбору;
	
КонецПроцедуры

#КонецОбласти

#Область РежимДобавленияКодовМаркировки

Функция РекомендуемыйРежимДобавленияКодовМаркировки(Форма) Экспорт
	
	Возврат Форма.РежимДобавленияКодовМаркировки;
	
КонецФункции

#КонецОбласти

// Формирует и отображает на форме информационную надпись о наличии недопустимых кодов маркировки.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма проверки и подбора, для которой формируется надпись.
//
Процедура ОтобразитьИнформациюОНедопустимыхКодахМаркировки(Форма) Экспорт
	
	Если Форма.КоличествоНедопустимыхКодовМаркировки > 0 Тогда
		
		ТекстНедопустимыхКодов = СтрШаблон(НСтр("ru = 'Недопустимых кодов маркировки - %1.'"), Форма.КоличествоНедопустимыхКодовМаркировки);
		СтрокаНедопустимыхКодов = Новый ФорматированнаяСтрока(ТекстНедопустимыхКодов,, Форма.ЦветТекстаТребуетВнимания);
		
		Если Форма.УстановленОтборНедопустимыеКодыМаркировки Тогда
			ТекстОтбор = НСтр("ru = '(снять отбор)'");
		Иначе
			ТекстОтбор = НСтр("ru = '(отобрать)'");
		КонецЕсли;
		
		СтрокаОтбор = Новый ФорматированнаяСтрока(ТекстОтбор,, Форма.ЦветГиперссылки,, "ИзменитьОтборНедопустимыеКодыМаркировки");
		
		Форма.Элементы.ДекорацияНедопустимыеКодыМаркировки.Заголовок = 
			Новый ФорматированнаяСтрока(СтрокаНедопустимыхКодов, " ", СтрокаОтбор);
			
		Форма.Элементы.ГруппаНедопустимыеКодыМаркировки.Видимость = Истина;
		
	Иначе
		
		Форма.Элементы.ГруппаНедопустимыеКодыМаркировки.Видимость = Ложь;
		
	КонецЕсли;
	
	Форма.ТребуетсяОбновитьИнформациюНедопустимыеКодыМаркировки = Ложь;
	
КонецПроцедуры

Процедура УстановитьДоступностьУпаковкиДляПроверки(ТекущаяСтрока, ДоступныеДляПроверкиУпаковки) Экспорт

	Если НЕ ИнтеграцияИСКлиентСервер.ЭтоУпаковка(ТекущаяСтрока.ТипУпаковки) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементСписка = ДоступныеДляПроверкиУпаковки.НайтиПоЗначению(ТекущаяСтрока.Штрихкод);
	
	Если ТекущаяСтрока.СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиНаличияПродукцииИС.ВНаличии")
		Или ТекущаяСтрока.СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиНаличияПродукцииИС.Отложена")
		Или ТекущаяСтрока.СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиНаличияПродукцииИС.НеЧислилась") Тогда
		
		Если ЭлементСписка = Неопределено Тогда
			ДоступныеДляПроверкиУпаковки.Добавить(ТекущаяСтрока.Штрихкод);
		КонецЕсли;
		
	Иначе
		
		Если ЭлементСписка <> Неопределено Тогда
			ДоступныеДляПроверкиУпаковки.Удалить(ЭлементСписка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СоответствиеСтрокДереваУпаковок(ДеревоУпаковок, ИмяПоляИндекса) Экспорт
	
	СоответствиеСтрокДереваУпаковок = Новый Соответствие;
	
	ЗаполнитьСоответствиеСтрокДереваУпаковокРекурсивно(ДеревоУпаковок.Строки, СоответствиеСтрокДереваУпаковок, ИмяПоляИндекса);
	
	Возврат СоответствиеСтрокДереваУпаковок;
	
КонецФункции

Функция ПараметрыОткрытияФормыУточненияПодобраннойПродукции() Экспорт
	
	ПараметрыОткрытияФормы = Новый Структура;
	
	ПараметрыОткрытияФормы.Вставить("ПараметрыСканирования",   Неопределено);
	ПараметрыОткрытияФормы.Вставить("ДопустимыеВидыПродукции", Новый Массив);
	ПараметрыОткрытияФормы.Вставить("ВидПродукции",            Неопределено);
	ПараметрыОткрытияФормы.Вставить("Номенклатура",            Неопределено);
	ПараметрыОткрытияФормы.Вставить("Характеристика",          Неопределено);
	ПараметрыОткрытияФормы.Вставить("Серия",                   Неопределено);
	ПараметрыОткрытияФормы.Вставить("GTIN",                    Неопределено);
	ПараметрыОткрытияФормы.Вставить("КодыGTIN",                Неопределено);
	
	ПараметрыОткрытияФормы.Вставить("ГоденДо",                          '00010101');
	ПараметрыОткрытияФормы.Вставить("ИдентификаторыПроисхожденияВЕТИС", Неопределено);
	ПараметрыОткрытияФормы.Вставить("СкоропортящаясяПродукция",         Ложь);
	
	ПараметрыОткрытияФормы.Вставить("КоличествоПотребительскихУпаковок",                     0);
	ПараметрыОткрытияФормы.Вставить("КоличествоПотребительскихУпаковокТребующихВзвешивания", 0);
	ПараметрыОткрытияФормы.Вставить("КоличествоПодобрано",                                   0);
	ПараметрыОткрытияФормы.Вставить("КоличествоПодобраноВзвешено",                           0);
	ПараметрыОткрытияФормы.Вставить("КоличествоПодобраноВзвешеноОСУ",                        0);
	ПараметрыОткрытияФормы.Вставить("КоличествоПотребительскихУпаковокОСУ",                  0);
	
	ПараметрыОткрытияФормы.Вставить("УточнениеДанныхОТовареДопустимо",    Ложь);
	ПараметрыОткрытияФормы.Вставить("УточнениеКоличестваТовараДопустимо", Ложь);
	ПараметрыОткрытияФормы.Вставить("УточнениеКоличестваОСУДопустимо",    Ложь);
	ПараметрыОткрытияФормы.Вставить("МаркируемаяПродукция",               Истина);
	
	ПараметрыОткрытияФормы.Вставить("ДопустимаПроизвольнаяЕдиницаУчета", Ложь);
	ПараметрыОткрытияФормы.Вставить("ЭтоДобавлениеОСУ",                  Ложь);
	
	ПараметрыОткрытияФормы.Вставить("ПредставлениеНоменклатуры", Неопределено);
	
	Возврат ПараметрыОткрытияФормы;
	
КонецФункции

#Область ЗаполнениеДереваУпаковок

Функция ПараметрыИзмененияСтрокиПодобраннойПродукции() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("УточнитьКоличествоИС"                                , Ложь);
	Результат.Вставить("ЭтоЗагрузкаДанныхДокументаПриОткрытииФормы"          , Ложь);
	Результат.Вставить("ЭтоУпаковкаОбъемноСортовогоУчета"                    , Ложь);
	Результат.Вставить("ЭтоОбработчикУстановкиСтатуса"                       , Ложь);
	Результат.Вставить("УточнитьКоличествоПодобраноВзвешено"                 , Ложь);
	Результат.Вставить("КоличествоПотребительскихУпаковокВСтруктуреУпаковок" , 0);
	Результат.Вставить("ПроизвольныйВесВСтрокеАгрегатора"                    , Ложь);
	Результат.Вставить("ТребуетВзвешивания"                                  , Ложь);
	Результат.Вставить("ЭтоОбнулениеПодобранногоКоличества"                  , Ложь);
	Результат.Вставить("ЭтоВосстановлениеПодобранногоКоличества"             , Ложь);
	Возврат Результат;
	
КонецФункции

Функция ОбработчикиСтрокКВыполнению() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторыСтрок", Новый Массив);
	Результат.Вставить("Обработчики", Новый Массив);
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьОбработчикИзмененияКоличества(Результат, СтрокаТаблицы) Экспорт
	
	Если ТипЗнч(СтрокаТаблицы) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		Результат.ИдентификаторыСтрок.Добавить(СтрокаТаблицы.ПолучитьИдентификатор());
		Результат.Обработчики.Добавить("ОбработатьИзменениеКоличества");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОбработчикИзмененияНоменклатуры(Результат, СтрокаТаблицы) Экспорт
	
	Если ТипЗнч(СтрокаТаблицы) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		Результат.ИдентификаторыСтрок.Добавить(СтрокаТаблицы.ПолучитьИдентификатор());
		Результат.Обработчики.Добавить("ОбработатьИзменениеНоменклатуры");
	КонецЕсли;
	
КонецПроцедуры

Функция СвойствоСтрокСовпадает(ИсходнаяСтрока, СтрокаИзменений, ИмяСвойства, ПолноеСовпадение = Истина) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаИзменений, ИмяСвойства) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Свойство1 = ИсходнаяСтрока[ИмяСвойства];
	Свойство2 = СтрокаИзменений[ИмяСвойства];
	
	Если Свойство1 = Свойство2 Тогда
		Возврат Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Свойство1) И (Свойство2 = Ложь Или Не ЗначениеЗаполнено(Свойство2)) Тогда
		Возврат Истина;
	ИначеЕсли ПолноеСовпадение Тогда
		Возврат Ложь;
	Иначе
		Возврат Свойство2 = Ложь Или Не ЗначениеЗаполнено(Свойство2);
	КонецЕсли;
	
КонецФункции

Функция НоменклатурыСтрокСовпадают2(ИсходнаяСтрока, СтрокаИзменений, ПолноеСовпадение = Истина) Экспорт
	
	Возврат ИсходнаяСтрока.Номенклатура = СтрокаИзменений.Номенклатура
		И СвойствоСтрокСовпадает(ИсходнаяСтрока, СтрокаИзменений, "Характеристика")
		И СвойствоСтрокСовпадает(ИсходнаяСтрока, СтрокаИзменений, "Серия", ПолноеСовпадение);
	
КонецФункции

Функция НоменклатураХарактеристикаСтрокСовпадают(ИсходнаяСтрока, СтрокаИзменений) Экспорт
	
	Возврат ИсходнаяСтрока.Номенклатура = СтрокаИзменений.Номенклатура
		И ИсходнаяСтрока.Характеристика = СтрокаИзменений.Характеристика;
	
КонецФункции

Функция GTINРавны(GTIN1, GTIN2) Экспорт
	
	Если GTIN1 = GTIN2 Тогда
		Возврат Истина;
	ИначеЕсли СтрДлина(GTIN1) = СтрДлина(GTIN2) Тогда
		Возврат Ложь;
	КонецЕсли;
	EAN1 = РазборКодаМаркировкиИССлужебныйКлиентСервер.ШтрихкодEANИзGTIN(GTIN1);
	EAN2 = РазборКодаМаркировкиИССлужебныйКлиентСервер.ШтрихкодEANИзGTIN(GTIN2);
	Возврат EAN1 = EAN2;
	
КонецФункции

Функция СвойстваВидаПродукцииСовпадают(ИсходнаяСтрока, СтрокаИзменений, ПараметрыСканирования, ПолноеСовпадение) Экспорт
	
	Результат = СвойствоСтрокСовпадает(ИсходнаяСтрока, СтрокаИзменений, "МРЦ", ПолноеСовпадение);
	Если ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЗаполнятьСрокГодности(ПараметрыСканирования) Тогда
		Результат = Результат И СвойствоСтрокСовпадает(ИсходнаяСтрока, СтрокаИзменений, "ГоденДо", ПолноеСовпадение);
		Результат = Результат И СвойствоСтрокСовпадает(ИсходнаяСтрока, СтрокаИзменений, "СкоропортящаясяПродукция", ПолноеСовпадение);
	КонецЕсли;
	Если ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЗаполнятьДанныеВЕТИС(ПараметрыСканирования) Тогда
		Результат = Результат И СвойствоСтрокСовпадает(ИсходнаяСтрока, СтрокаИзменений, "ИдентификаторПроисхожденияВЕТИС", ПолноеСовпадение);
	КонецЕсли;
	Если ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЗапрашиватьАлкогольнуюПродукцию(ПараметрыСканирования) Тогда
		Результат = Результат И СвойствоСтрокСовпадает(ИсходнаяСтрока, СтрокаИзменений, "АлкогольнаяПродукция", ПолноеСовпадение);
	КонецЕсли;
	Если ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЗапрашиватьСправку2(ПараметрыСканирования) Тогда
		Результат = Результат И СвойствоСтрокСовпадает(ИсходнаяСтрока, СтрокаИзменений, "Справка2", ПолноеСовпадение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеМассиваGTIN(КодыGTIN) Экспорт
	
	Если КодыGTIN.Количество() = 1 Тогда
		Возврат КодыGTIN[0].Значение;
	ИначеЕсли КодыGTIN.Количество() > 1 Тогда
		Возврат СтрШаблон(НСтр("ru = '%1 ( + еще %2)'"),
			КодыGTIN[0].Значение, КодыGTIN.Количество() - 1);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура УстановитьИндексКартинкиСостояниеПодбораКодаМаркировки(ТекущаяСтрока) Экспорт
	
	Если ТекущаяСтрока.ТребуетВзвешивания
		И ТекущаяСтрока.КоличествоПотребительскихУпаковокТребующихВзвешивания <> 0 Тогда
		
		ТекущаяСтрока.ИндексКодаМаркировки = 3;
		
	ИначеЕсли ТекущаяСтрока.Количество = 0
		И ТекущаяСтрока.КоличествоИС = 0
		И ТекущаяСтрока.КоличествоПодобрано = 0 Тогда
		
		Если ТекущаяСтрока.КоличествоПотребительскихУпаковокВСтруктуреУпаковок > 0
				Или ТекущаяСтрока.КоличествоПотребительскихУпаковок > 0 Тогда
			
			ТекущаяСтрока.ИндексКодаМаркировки = 2;
			
		Иначе
			
			ТекущаяСтрока.ИндексКодаМаркировки = 0;
			
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтрока.КоличествоПодобрано >= ТекущаяСтрока.Количество
		И ТекущаяСтрока.КоличествоПодобрано >= ТекущаяСтрока.КоличествоИС Тогда
		
		ТекущаяСтрока.ИндексКодаМаркировки = 1;
		
	Иначе
		
		ТекущаяСтрока.ИндексКодаМаркировки = 2;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет реквизит "НомерСтроки" в коллекции
//
// Параметры:
//  КоллекцияДанных - ДанныеФормыКоллекция, ТаблицаЗначений - Таблица, в которой необходимо заполнить НомерСтроки
Процедура ПересчитатьНомераСтрок(КоллекцияДанных) Экспорт
	
	НомерСтроки = 1;
	
	Для Каждого ТекущаяСтрока Из КоллекцияДанных Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоСтрокаАгрегаторСКодамиGTIN(СтрокаМаркируемойПродукции, GTINМожетБытьЗаполненЕслиДляНоменклатурыПредусмотреноНесколькоGTIN = Истина) Экспорт
	
	GTIN     = СтрокаМаркируемойПродукции.GTIN;
	КодыGTIN = СтрокаМаркируемойПродукции.КодыGTIN;
	
	Если КодыGTIN.Количество() = 0 Тогда
		Возврат Не ЗначениеЗаполнено(GTIN);
	КонецЕсли;
	
	ПредставлениеGTIN = СтрокаМаркируемойПродукции.ПредставлениеGTIN;
	Если ПредставлениеGTIN <> ПредставлениеМассиваGTIN(КодыGTIN) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если КодыGTIN.Количество() > 1 Тогда
		
		Если Не ЗначениеЗаполнено(GTIN) Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если GTINМожетБытьЗаполненЕслиДляНоменклатурыПредусмотреноНесколькоGTIN Тогда
			
			Для Каждого Строка Из КодыGTIN Цикл
				Если GTINРавны(GTIN, Строка.Значение) Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЦикла;
		
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(GTIN) И GTINРавны(GTIN, КодыGTIN[0].Значение);
	
КонецФункции

Функция СтрокаАгрегаторМаркируемойПродукции(ПодобраннаяМаркируемаяПродукция, КлючПоиска, ПараметрыСканирования, ПолноеСовпадение) Экспорт
	
	Если ПодобраннаяМаркируемаяПродукция.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПолноеСовпадение Тогда
		Для Каждого СтрокаМаркируемойПродукции Из ПодобраннаяМаркируемаяПродукция Цикл
			Если НоменклатурыСтрокСовпадают2(КлючПоиска, СтрокаМаркируемойПродукции)
				И GTINРавны(КлючПоиска.GTIN, СтрокаМаркируемойПродукции.GTIN)
				И СвойстваВидаПродукцииСовпадают(КлючПоиска, СтрокаМаркируемойПродукции, ПараметрыСканирования, Истина) Тогда
				Возврат СтрокаМаркируемойПродукции;
			КонецЕсли;
		КонецЦикла;
		Возврат Неопределено;
	КонецЕсли;
	
	Если РазборКодаМаркировкиИССлужебныйКлиентСервер.ЭтоШтрихкодВводаОстатков(КлючПоиска.GTIN) Тогда
		
		Для Каждого СтрокаМаркируемойПродукции Из ПодобраннаяМаркируемаяПродукция Цикл
			
			Если ЗначениеЗаполнено(СтрокаМаркируемойПродукции.Номенклатура)
				И Не НоменклатурыСтрокСовпадают2(КлючПоиска, СтрокаМаркируемойПродукции) Тогда
				Продолжить;
			КонецЕсли;
				
			Если РазборКодаМаркировкиИССлужебныйКлиентСервер.ЭтоШтрихкодВводаОстатков(СтрокаМаркируемойПродукции.GTIN) Тогда
				
				Если Не GTINРавны(КлючПоиска.GTIN, СтрокаМаркируемойПродукции.GTIN) Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрокаМаркируемойПродукции.Количество = 0
					Или СтрокаМаркируемойПродукции.Количество = СтрокаМаркируемойПродукции.КоличествоПодобрано Тогда
					Продолжить;
				КонецЕсли;
				
				Возврат СтрокаМаркируемойПродукции;
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаМаркируемойПродукции.GTIN)
				И СтрокаМаркируемойПродукции.КодыGTIN.Количество() = 0 Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Возврат СтрокаМаркируемойПродукции;
			
		КонецЦикла;
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СтрокаАгрегаторПолноеСовпадение    = Неопределено;
	СтрокаАгрегаторЧастичноеСовпадение = Неопределено;
	СтрокиДляАнализаИРаспределения     = Новый Массив;
	
	ВесаСтрок = Новый Соответствие;
	
	Для Каждого СтрокаМаркируемойПродукции Из ПодобраннаяМаркируемаяПродукция Цикл
		
		НоменклатураСопоставлена   = ЗначениеЗаполнено(СтрокаМаркируемойПродукции.Номенклатура);
		НоменклатураСтрокСовпадает = НоменклатураХарактеристикаСтрокСовпадают(КлючПоиска, СтрокаМаркируемойПродукции);
		
		Если НоменклатураСопоставлена И Не НоменклатураСтрокСовпадает Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не СвойстваВидаПродукцииСовпадают(КлючПоиска, СтрокаМаркируемойПродукции, ПараметрыСканирования, Ложь) Тогда
			Продолжить;
		КонецЕсли;
		
		GTINСовпадают                  = GTINРавны(КлючПоиска.GTIN, СтрокаМаркируемойПродукции.GTIN);
		СвойстваВидаПродукцииСовпадают = СвойстваВидаПродукцииСовпадают(КлючПоиска, СтрокаМаркируемойПродукции, ПараметрыСканирования, Истина);
		СерияСтрокСовпадает            = СвойствоСтрокСовпадает(КлючПоиска, СтрокаМаркируемойПродукции, "Серия");
		
		Если Не НоменклатураСопоставлена Тогда
			
			Если GTINСовпадают И СвойстваВидаПродукцииСовпадают Тогда
				
				Если НоменклатураСтрокСовпадает Тогда
					СтрокаАгрегаторПолноеСовпадение = СтрокаМаркируемойПродукции;
				Иначе
					СтрокаАгрегаторЧастичноеСовпадение = СтрокаМаркируемойПродукции;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли НоменклатураСтрокСовпадает Тогда
			
			Если GTINСовпадают И СвойстваВидаПродукцииСовпадают И СерияСтрокСовпадает Тогда
				
				СтрокаАгрегаторПолноеСовпадение = СтрокаМаркируемойПродукции;
				
			Иначе
				
				СтрокиДляАнализаИРаспределения.Добавить(СтрокаМаркируемойПродукции);
				
				ВесаСтрок[СтрокаМаркируемойПродукции] =
					?(СвойствоСтрокСовпадает(КлючПоиска, СтрокаМаркируемойПродукции, "ИдентификаторПроисхожденияВЕТИС"), 1, 0)
					+ ?(СвойствоСтрокСовпадает(КлючПоиска, СтрокаМаркируемойПродукции, "ГоденДо"), 1, 0)
					+ ?(СвойствоСтрокСовпадает(КлючПоиска, СтрокаМаркируемойПродукции, "МРЦ"), 1, 0)
					+ ?(GTINСовпадают,       1, 0)
					+ ?(СерияСтрокСовпадает, 1, 0);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрокаАгрегаторПолноеСовпадение <> Неопределено Тогда
		Возврат СтрокаАгрегаторПолноеСовпадение;
	ИначеЕсли СтрокаАгрегаторЧастичноеСовпадение <> Неопределено Тогда
		Возврат СтрокаАгрегаторЧастичноеСовпадение;
	ИначеЕсли СтрокиДляАнализаИРаспределения.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаРезультата = Неопределено;
	
	Для Каждого СтрокаМаркируемойПродукции Из СтрокиДляАнализаИРаспределения Цикл
		Если ЭтоСтрокаАгрегаторСКодамиGTIN(СтрокаМаркируемойПродукции, Ложь)
			И (СтрокаРезультата = Неопределено
				Или ВесаСтрок[СтрокаМаркируемойПродукции] > ВесаСтрок[СтрокаРезультата]) Тогда
			СтрокаРезультата = СтрокаМаркируемойПродукции;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаРезультата = Неопределено Тогда
		Для Каждого СтрокаМаркируемойПродукции Из СтрокиДляАнализаИРаспределения Цикл
			Если СтрокаМаркируемойПродукции.КоличествоПодобрано = 0
				И (СтрокаРезультата = Неопределено
					Или ВесаСтрок[СтрокаМаркируемойПродукции] > ВесаСтрок[СтрокаРезультата]) Тогда
				СтрокаРезультата = СтрокаМаркируемойПродукции;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтрокаРезультата;
	
КонецФункции

Функция СтрокаАгрегаторВесовыхКодов(ПодобраннаяМаркируемаяПродукция, СтрокаПодобраннойПродукции, РежимПодбораСуществующихУпаковок, ПараметрыСканирования) Экспорт
	
	Если ПодобраннаяМаркируемаяПродукция.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаАгрегаторПолноеСовпадение    = Неопределено;
	СтрокаАгрегаторЧастичноеСовпадение = Неопределено;
	СтрокиДляАнализаИРаспределения     = Новый Массив;
	
	ВесаСтрок = Новый Соответствие;
	
	Для Каждого СтрокаМаркируемойПродукции Из ПодобраннаяМаркируемаяПродукция Цикл
		
		Если СтрокаМаркируемойПродукции.КоличествоПотребительскихУпаковок = СтрокаМаркируемойПродукции.КоличествоПотребительскихУпаковокВСтруктуреУпаковок Тогда
			Продолжить;
		КонецЕсли;
		
		НоменклатураСопоставлена   = ЗначениеЗаполнено(СтрокаМаркируемойПродукции.Номенклатура);
		НоменклатураСтрокСовпадает = НоменклатураХарактеристикаСтрокСовпадают(СтрокаПодобраннойПродукции, СтрокаМаркируемойПродукции);
		
		Если НоменклатураСопоставлена И Не НоменклатураСтрокСовпадает Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не СвойстваВидаПродукцииСовпадают(СтрокаПодобраннойПродукции, СтрокаМаркируемойПродукции, ПараметрыСканирования, Ложь) Тогда
			Продолжить;
		КонецЕсли;
		
		GTINСовпадают                  = GTINРавны(СтрокаПодобраннойПродукции.GTIN, СтрокаМаркируемойПродукции.GTIN);
		СвойстваВидаПродукцииСовпадают = СвойстваВидаПродукцииСовпадают(СтрокаПодобраннойПродукции, СтрокаМаркируемойПродукции, ПараметрыСканирования, Истина);
		СерияСтрокСовпадает            = СвойствоСтрокСовпадает(СтрокаПодобраннойПродукции, СтрокаМаркируемойПродукции, "Серия");
		
		Если Не НоменклатураСопоставлена Тогда
			
			Если GTINСовпадают И СвойстваВидаПродукцииСовпадают Тогда
				
				Если НоменклатураСтрокСовпадает Тогда
					СтрокаАгрегаторПолноеСовпадение = СтрокаМаркируемойПродукции;
				Иначе
					СтрокаАгрегаторЧастичноеСовпадение = СтрокаМаркируемойПродукции;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли НоменклатураСтрокСовпадает Тогда
			
			Если GTINСовпадают И СвойстваВидаПродукцииСовпадают И СерияСтрокСовпадает Тогда
				
				СтрокаАгрегаторПолноеСовпадение = СтрокаМаркируемойПродукции;
				
			Иначе
				
				Если Не GTINСовпадают И ЗначениеЗаполнено(СтрокаПодобраннойПродукции.GTIN) Тогда
					Если ЗначениеЗаполнено(СтрокаМаркируемойПродукции.GTIN)
						Или СтрокаМаркируемойПродукции.КодыGTIN.Количество() > 0
							И СтрокаМаркируемойПродукции.КодыGTIN.НайтиПоЗначению(СтрокаПодобраннойПродукции.GTIN) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;

				СтрокиДляАнализаИРаспределения.Добавить(СтрокаМаркируемойПродукции);
				
				ВесаСтрок[СтрокаМаркируемойПродукции] =
					?(СвойствоСтрокСовпадает(СтрокаПодобраннойПродукции, СтрокаМаркируемойПродукции, "ИдентификаторПроисхожденияВЕТИС"), 1, 0)
					+ ?(СвойствоСтрокСовпадает(СтрокаПодобраннойПродукции, СтрокаМаркируемойПродукции, "ГоденДо"), 1, 0)
					+ ?(СвойствоСтрокСовпадает(СтрокаПодобраннойПродукции, СтрокаМаркируемойПродукции, "МРЦ"), 1, 0)
					+ ?(GTINСовпадают,       1, 0)
					+ ?(СерияСтрокСовпадает, 1, 0);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрокаАгрегаторПолноеСовпадение <> Неопределено Тогда
		Возврат СтрокаАгрегаторПолноеСовпадение;
	ИначеЕсли СтрокаАгрегаторЧастичноеСовпадение <> Неопределено Тогда
		Возврат СтрокаАгрегаторЧастичноеСовпадение;
	ИначеЕсли СтрокиДляАнализаИРаспределения.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаРезультата = Неопределено;
	
	Для Каждого СтрокаМаркируемойПродукции Из СтрокиДляАнализаИРаспределения Цикл
		
		Если ЭтоСтрокаАгрегаторСКодамиGTIN(СтрокаМаркируемойПродукции, Ложь) Тогда
			
			Если СтрокаРезультата = Неопределено
				Или ВесаСтрок[СтрокаМаркируемойПродукции] > ВесаСтрок[СтрокаРезультата] Тогда
				СтрокаРезультата = СтрокаМаркируемойПродукции;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрокаРезультата = Неопределено И Не РежимПодбораСуществующихУпаковок Тогда
		
		Для Каждого СтрокаМаркируемойПродукции Из СтрокиДляАнализаИРаспределения Цикл
			
			Если ЭтоСтрокаАгрегаторСКодамиGTIN(СтрокаМаркируемойПродукции) И СтрокаМаркируемойПродукции.КоличествоПодобрано = 0 Тогда
				
				Если СтрокаРезультата = Неопределено
					Или ВесаСтрок[СтрокаМаркируемойПродукции] > ВесаСтрок[СтрокаРезультата] Тогда
					СтрокаРезультата = СтрокаМаркируемойПродукции;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтрокаРезультата;
	
КонецФункции

Функция ДанныеРаспределенияСтрокиАгрегатораПоДаннымДокумента(Форма, СтрокаАгрегатор) Экспорт
	
	ДанныеПоАгрегатору = СтрокиПоДокументуДляАгрегатора(Форма.ПродукцияПоДокументу, СтрокаАгрегатор, Форма.ПараметрыСканирования);
	
	Если ДанныеПоАгрегатору.СтрокиПоДокументу.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ДанныеПоАгрегаторам = Новый Соответствие;
	ДанныеПоАгрегаторам[СтрокаАгрегатор] = ДанныеПоАгрегатору;
	
	ПодобраннаяМаркируемаяПродукция = Форма.ПодобраннаяМаркируемаяПродукция;
	
	ПодобраннаяМаркируемаяПродукцияПоНоменклатуре = ПодобраннаяМаркируемаяПродукция.НайтиСтроки(
		Новый Структура("Номенклатура", СтрокаАгрегатор.Номенклатура));
	
	СопоставленныеСтроки           = Новый Соответствие;
	СопоставленныеСтрокиКоличество = Новый Соответствие;
	КоличествоОстатокПоСтроке      = Новый Соответствие;
	Для Каждого СтрокаМаркируемойПродукции Из ПодобраннаяМаркируемаяПродукцияПоНоменклатуре Цикл
		
		Если СтрокаМаркируемойПродукции.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеПоАгрегатору = ДанныеПоАгрегаторам[СтрокаМаркируемойПродукции];
		Если ДанныеПоАгрегатору = Неопределено Тогда
			ДанныеПоАгрегатору = СтрокиПоДокументуДляАгрегатора(Форма.ПродукцияПоДокументу, СтрокаМаркируемойПродукции, Форма.ПараметрыСканирования);
			ДанныеПоАгрегаторам[СтрокаМаркируемойПродукции] = ДанныеПоАгрегатору;
		КонецЕсли;
		
		Для Каждого СтрокаПоДокументу Из ДанныеПоАгрегатору.СтрокиПоДокументу Цикл
			
			Если СтрокаПоДокументу.Количество > 0
				И НоменклатурыСтрокСовпадают2(СтрокаМаркируемойПродукции, СтрокаПоДокументу)
				И СвойстваВидаПродукцииСовпадают(СтрокаМаркируемойПродукции, СтрокаПоДокументу, Форма.ПараметрыСканирования, Истина)
				И ЭтоСтрокаАгрегаторСКодамиGTIN(СтрокаМаркируемойПродукции, Ложь) Тогда
				
				Если КоличествоОстатокПоСтроке[СтрокаПоДокументу] = Неопределено Тогда
					КоличествоОстатокПоСтроке[СтрокаПоДокументу] = СтрокаПоДокументу.Количество;
				КонецЕсли;
				КоличествоОстаток = КоличествоОстатокПоСтроке[СтрокаПоДокументу];
				
				КоличествоКИзменению = Мин(СтрокаМаркируемойПродукции.Количество, КоличествоОстаток);
				
				КоличествоОстатокПоСтроке[СтрокаПоДокументу] = КоличествоОстаток - КоличествоКИзменению;
				
				СопоставленныеСтроки[СтрокаМаркируемойПродукции]  = СтрокаПоДокументу;
				СопоставленныеСтроки[СтрокаПоДокументу]           = СтрокаМаркируемойПродукции;
				СопоставленныеСтрокиКоличество[СтрокаПоДокументу] = КоличествоКИзменению;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	КоллекцияСтрокАгрегата          = Новый Массив;
	КоличествоПоСтрокеДляАгрегатора = Новый Соответствие;
	
	Для Каждого СтрокаМаркируемойПродукции Из ПодобраннаяМаркируемаяПродукцияПоНоменклатуре Цикл
		
		Если СтрокаМаркируемойПродукции.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоКРаспределению = СтрокаМаркируемойПродукции.Количество;
		
		ЭтоСтрокаАгрегатор = (СтрокаМаркируемойПродукции = СтрокаАгрегатор);
		
		ОсновнаяСтрокаПоДокументу = СопоставленныеСтроки[СтрокаМаркируемойПродукции];
		Если ОсновнаяСтрокаПоДокументу <> Неопределено Тогда
			КоличествоКИзменению = СопоставленныеСтрокиКоличество[ОсновнаяСтрокаПоДокументу];
			КоличествоКРаспределению = КоличествоКРаспределению - КоличествоКИзменению;
			Если ЭтоСтрокаАгрегатор Тогда
				КоллекцияСтрокАгрегата.Добавить(ОсновнаяСтрокаПоДокументу);
				КоличествоПоСтрокеДляАгрегатора[ОсновнаяСтрокаПоДокументу] = КоличествоКИзменению;
			КонецЕсли;
		КонецЕсли;
		
		Если КоличествоКРаспределению > 0 Тогда
			
			ДанныеПоАгрегатору = ДанныеПоАгрегаторам[СтрокаМаркируемойПродукции];
			
			ТекущийИндекс = ДанныеПоАгрегатору.СтрокиПоДокументу.ВГраница();
			Пока ТекущийИндекс >= 0 Цикл
				
				СтрокаПоДокументу = ДанныеПоАгрегатору.СтрокиПоДокументу[ТекущийИндекс];
				
				ТекущийИндекс = ТекущийИндекс - 1;
				
				Если КоличествоКРаспределению = 0 Тогда
					Прервать;
				ИначеЕсли ОсновнаяСтрокаПоДокументу = СтрокаПоДокументу Тогда
					Продолжить;
				КонецЕсли;
				
				Если КоличествоОстатокПоСтроке[СтрокаПоДокументу] = Неопределено Тогда
					КоличествоОстатокПоСтроке[СтрокаПоДокументу] = СтрокаПоДокументу.Количество;
				КонецЕсли;
				
				КоличествоОстаток = КоличествоОстатокПоСтроке[СтрокаПоДокументу];
				Если КоличествоОстаток = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				КоличествоКИзменению = Мин(КоличествоКРаспределению, КоличествоОстаток);
				
				КоличествоОстатокПоСтроке[СтрокаПоДокументу] = КоличествоОстаток        - КоличествоКИзменению;
				КоличествоКРаспределению                     = КоличествоКРаспределению - КоличествоКИзменению;
				
				Если ЭтоСтрокаАгрегатор Тогда
					КоллекцияСтрокАгрегата.Добавить(СтрокаПоДокументу);
					КоличествоПоСтрокеДляАгрегатора[СтрокаПоДокументу] = КоличествоКИзменению;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЭтоСтрокаАгрегатор Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИтоговоеКоличествоКРаспределению = СтрокаАгрегатор.Количество - СтрокаАгрегатор.КоличествоПодобрано;
	ОсновнаяСтрокаПоДокументу = СопоставленныеСтроки[СтрокаМаркируемойПродукции];
	Если ОсновнаяСтрокаПоДокументу <> Неопределено Тогда
		Если ОсновнаяСтрокаПоДокументу.Количество > СтрокаАгрегатор.КоличествоПодобрано Тогда
			ИтоговоеКоличествоКРаспределению = СтрокаАгрегатор.Количество - ОсновнаяСтрокаПоДокументу.Количество;
		КонецЕсли;
	КонецЕсли;
	
	ДоступныеСтрокиРаспределения = Новый Массив;
	ДоступноеКоличествоПоСтроке  = Новый Соответствие;
	
	КоличествоКРаспределению = ИтоговоеКоличествоКРаспределению;
	
	ТекущийИндекс = КоллекцияСтрокАгрегата.ВГраница();
	Пока ТекущийИндекс >= 0 И КоличествоКРаспределению > 0 Цикл
		
		СтрокаПоДокументу = КоллекцияСтрокАгрегата[ТекущийИндекс];
		
		КоличествоОстаток = КоличествоПоСтрокеДляАгрегатора[СтрокаПоДокументу];
		
		КоличествоКИзменению = Мин(КоличествоКРаспределению, КоличествоОстаток);
		
		КоличествоКРаспределению = КоличествоКРаспределению - КоличествоКИзменению;
		
		ДоступныеСтрокиРаспределения.Добавить(СтрокаПоДокументу);
		ДоступноеКоличествоПоСтроке[СтрокаПоДокументу] = КоличествоКИзменению;

		ТекущийИндекс = ТекущийИндекс - 1;
		
	КонецЦикла;
	
	КоличествоКРаспределению = ИтоговоеКоличествоКРаспределению - КоличествоКРаспределению;
	
	Результат = Новый Структура;
	Результат.Вставить("ДоступныеСтрокиРаспределения", ДоступныеСтрокиРаспределения);
	Результат.Вставить("ДоступноеКоличествоПоСтроке",  ДоступноеКоличествоПоСтроке);
	Результат.Вставить("КоличествоКРаспределению",     КоличествоКРаспределению);
	Результат.Вставить("СопоставленныеСтроки",         СопоставленныеСтроки);
	
	Возврат Результат;
	
КонецФункции

Функция СтрокиПоДокументуДляАгрегатора(ПродукцияПоДокументу, СтрокаАгрегатор, ПараметрыСканирования) Экспорт
	
	СтрокиПоДокументу = Новый Массив;
	Для Каждого СтрокаПоДокументу Из ПродукцияПоДокументу Цикл
		Если НоменклатураХарактеристикаСтрокСовпадают(СтрокаАгрегатор, СтрокаПоДокументу)
			И СвойстваВидаПродукцииСовпадают(СтрокаАгрегатор, СтрокаПоДокументу, ПараметрыСканирования, Ложь) Тогда
			Если ЗначениеЗаполнено(СтрокаАгрегатор.GTIN) Тогда
				ДопустимыйGTIN =
					ЗначениеЗаполнено(СтрокаПоДокументу.GTIN)
						И СтрокаАгрегатор.GTIN = СтрокаПоДокументу.GTIN
					Или СтрокаПоДокументу.КодыGTIN.Количество() > 0
						И СтрокаПоДокументу.КодыGTIN.НайтиПоЗначению(СтрокаАгрегатор.GTIN) <> Неопределено;
				Если Не ДопустимыйGTIN Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			СтрокиПоДокументу.Добавить(СтрокаПоДокументу);
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиПоДокументу.Количество() = 0 Тогда
		Возврат Новый Структура("СтрокиПоДокументу, ВесаСтрок",
			СтрокиПоДокументу, Новый Соответствие);
	КонецЕсли;
	
	ВесаСтрок               = Новый Соответствие;
	СтрокиПоВозрастаниюВеса = Новый Массив;
	
	Для Каждого СтрокаПоДокументу Из СтрокиПоДокументу Цикл
		
		СерияСтрокСовпадает            = СвойствоСтрокСовпадает(СтрокаАгрегатор, СтрокаПоДокументу, "Серия");
		
		ВесСвойств = 
			?(СвойствоСтрокСовпадает(СтрокаАгрегатор, СтрокаПоДокументу, "ИдентификаторПроисхожденияВЕТИС"), 1, 0)
			+ ?(СвойствоСтрокСовпадает(СтрокаАгрегатор, СтрокаПоДокументу, "ГоденДо"), 1, 0)
			+ ?(СвойствоСтрокСовпадает(СтрокаАгрегатор, СтрокаПоДокументу, "МРЦ"), 1, 0);
		ВесСерии = ?(СерияСтрокСовпадает, 1, 0);
		
		ОписаниеВесов = Новый Структура();
		ОписаниеВесов.Вставить("ВесСвойств", ВесСвойств);
		ОписаниеВесов.Вставить("ВесСерии",   ВесСерии);
		ОписаниеВесов.Вставить("ВесСтроки",  ВесСвойств + ВесСерии);
		
		СтрокиПоВозрастаниюВеса.Добавить(СтрокаПоДокументу);
		
		ВесаСтрок[СтрокаПоДокументу] = ОписаниеВесов;
		
	КонецЦикла;
	
	Строк = СтрокиПоВозрастаниюВеса.ВГраница();
	Пока Строк > 0 Цикл
		Для ТекущийИндекс = 0 По Строк - 1 Цикл
			ОписаниеВесов1 = ВесаСтрок[СтрокиПоВозрастаниюВеса[ТекущийИндекс]];
			ОписаниеВесов2 = ВесаСтрок[СтрокиПоВозрастаниюВеса[ТекущийИндекс + 1]];
			Если ОписаниеВесов1.ВесСтроки > ОписаниеВесов2.ВесСтроки
				Или ОписаниеВесов1.ВесСтроки = ОписаниеВесов2.ВесСтроки
				И ОписаниеВесов1.ВесСвойств > ОписаниеВесов2.ВесСвойств Тогда
				Строка = СтрокиПоВозрастаниюВеса[ТекущийИндекс + 1];
				СтрокиПоВозрастаниюВеса[ТекущийИндекс + 1] = СтрокиПоВозрастаниюВеса[ТекущийИндекс];
				СтрокиПоВозрастаниюВеса[ТекущийИндекс]     = Строка;
			КонецЕсли;
		КонецЦикла;
		Строк = Строк - 1;
	КонецЦикла;
	
	Возврат Новый Структура("СтрокиПоДокументу, ВесаСтрок",
		СтрокиПоВозрастаниюВеса, ВесаСтрок);
	
КонецФункции

// Возвращает все агрегаторы текущей строки по ключу поиска (включая полное соответствие)
// 
// Параметры:
//  ПодобраннаяМаркируемаяПродукция - ДанныеФормыКоллекция - Подобранная маркируемая продукция
//  КлючПоиска - Структура - Ключ поиска
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
// 
// Возвращаемое значение:
//  Массив Из ДанныеФормыЭлементКоллекции - Агрегаторы маркируемой продукции
Функция АгрегаторыМаркируемойПродукции(ПодобраннаяМаркируемаяПродукция, КлючПоиска, ПараметрыСканирования) Экспорт
	
	Результат = Новый Массив;
	
	// агрегаторы:
	// - строки с совпадающей номенклатурой/характеристикой (номенклатура заполнена в строке подобранной продукции и коде маркировки)
	// - строки с совпадающим GTIN (номенклатура не заполнена в строке подобранной продукции или коде маркировки)
	Для Каждого СтрокаМаркируемойПродукции Из ПодобраннаяМаркируемаяПродукция Цикл
		Если ЗначениеЗаполнено(СтрокаМаркируемойПродукции.Номенклатура) И ЗначениеЗаполнено(КлючПоиска.Номенклатура) Тогда
			Если НоменклатураХарактеристикаСтрокСовпадают(КлючПоиска, СтрокаМаркируемойПродукции) Тогда
				Результат.Добавить(СтрокаМаркируемойПродукции);
			КонецЕсли;
		Иначе 
			Если GTINРавны(КлючПоиска.GTIN, СтрокаМаркируемойПродукции.GTIN) Тогда
				Результат.Добавить(СтрокаМаркируемойПродукции);
			ИначеЕсли ЗначениеЗаполнено(КлючПоиска.GTIN)
				И СтрокаМаркируемойПродукции.КодыGTIN.НайтиПоЗначению(КлючПоиска.GTIN) <> Неопределено Тогда
				Результат.Добавить(СтрокаМаркируемойПродукции);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПустыеКоличестваРаспределения() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Количество", 0);                                            // Учетное. По документу
	Результат.Вставить("КоличествоПодобрано", 0);                                   // Учетное.         Подобрано/проверено
	Результат.Вставить("КоличествоПотребительскихУпаковок", 0);                     // Коды маркировки. Подобрано/проверено.
	Результат.Вставить("КоличествоИС", 0);                                          // Учетное.         По входящему дереву упаковок.
	Результат.Вставить("КоличествоПотребительскихУпаковокВСтруктуреУпаковок", 0);   // Коды маркировки. По входящему дереву упаковок.
	Результат.Вставить("КоличествоПодобраноВзвешено", 0);                           // Учетное.         По взвешиваемым КМ с указанным весом.
	Результат.Вставить("КоличествоПотребительскихУпаковокТребующихВзвешивания", 0); // Коды маркировки. По взвешиваемым КМ без веса.
	Результат.Вставить("КоличествоПодобраноВзвешеноОСУ", 0);                        // Учетное.         Добавленное ОСУ.
	Результат.Вставить("КоличествоПотребительскихУпаковокОСУ", 0);                  // Коды маркировки. Добавленное ОСУ.
	
	Возврат Результат;
	
КонецФункции

Функция ДобавлениеСтрокиПодобраннойПродукции(Форма, СтрокаИзменений, Знач КоличествоКодовМаркировки, Знач ПараметрыИзмененияСтроки = Неопределено) Экспорт
	
	Результат = ОбработчикиСтрокКВыполнению();
	// Описание:
	// 1. Выполняем поиск строки подобранной продукции (полное совпадение)
	// 2. Выполняем поиск всех строк подобранной продукции (частичное совпадение)
	// 3. Если строка подобранной продукции  не найдена, генерируем новую строку (без количественных показателей)
	// 4. Заполняем количество (*все поля количества) в строке подобранной продукции, (количественные показатели)
	// 5. Выполняем уменьшение количества (*количество) со строк п.4. При необходимости в процессе переноса удаляем строки частичного совпадения
	Если ПараметрыИзмененияСтроки = Неопределено Тогда
		ПараметрыИзмененияСтроки = ПараметрыИзмененияСтрокиПодобраннойПродукции();
	КонецЕсли;
	
	ЭтоЗагрузкаВходящегоДокумента = ПараметрыИзмененияСтроки.УточнитьКоличествоИС И ПараметрыИзмененияСтроки.ЭтоЗагрузкаДанныхДокументаПриОткрытииФормы;
	
	ПодобраннаяМаркируемаяПродукция = Форма.ПодобраннаяМаркируемаяПродукция;
	ПараметрыСканирования = Форма.ПараметрыСканирования;
	
	//1
	СтрокаПодобраннойПродукции = СтрокаАгрегаторМаркируемойПродукции(ПодобраннаяМаркируемаяПродукция, СтрокаИзменений, ПараметрыСканирования, Истина);
	КоличествоРаспределения = КоличествоРаспределения(СтрокаИзменений, ПараметрыИзмененияСтроки);
	
	//2
	СтрокиПерераспределенияКоличества = АгрегаторыМаркируемойПродукции(ПодобраннаяМаркируемаяПродукция, СтрокаИзменений, ПараметрыСканирования);
	
	//3
	Если СтрокаПодобраннойПродукции = Неопределено Тогда
		Если СтрокиПерераспределенияКоличества.Количество() = 0 Тогда
			СтрокаПодобраннойПродукции = ПодобраннаяМаркируемаяПродукция.Добавить();
		Иначе 
			СтрокаПодобраннойПродукции = ПодобраннаяМаркируемаяПродукция.Вставить(ПодобраннаяМаркируемаяПродукция.Индекс(СтрокиПерераспределенияКоличества[0]));
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаПодобраннойПродукции, СтрокаИзменений);
		ДобавитьОбработчикИзмененияНоменклатуры(Результат, СтрокаПодобраннойПродукции);
		ЗаполнитьЗначенияСвойств(СтрокаПодобраннойПродукции, ПустыеКоличестваРаспределения());
	КонецЕсли;
	
	Если ЭтоЗагрузкаВходящегоДокумента Тогда
		КоличествоРаспределенияНаДругиеСтроки = КоличествоРаспределенияВходящегоДереваНаДругиеСтроки(СтрокаПодобраннойПродукции, КоличествоРаспределения);
	Иначе 
		КоличествоРаспределенияНаДругиеСтроки = КоличествоРаспределенияНаДругиеСтроки(СтрокаПодобраннойПродукции, КоличествоРаспределения);
	КонецЕсли;
	
	//4
	Для Каждого КлючИЗначение Из КоличествоРаспределения Цикл
		СтрокаПодобраннойПродукции[КлючИЗначение.Ключ] = СтрокаПодобраннойПродукции[КлючИЗначение.Ключ] + КлючИЗначение.Значение;
	КонецЦикла;
	УстановитьИндексКартинкиСостояниеПодбораКодаМаркировки(СтрокаПодобраннойПродукции);
	
	// ПолеМРЦ
	Если ЗначениеЗаполнено(СтрокаПодобраннойПродукции.МРЦ) Тогда
		СтрокаПодобраннойПродукции.ВключаетМРЦ = Истина;
	КонецЕсли;
	
	// Распределение при открытии формы
	Если ЭтоЗагрузкаВходящегоДокумента Тогда
		Для Каждого СтрокаПерераспределения Из СтрокиПерераспределенияКоличества Цикл
			Если СтрокаПерераспределения <> СтрокаПодобраннойПродукции Тогда
				Если РаспределитьВходящуюПродукциюПриДобавленииСтроки(СтрокаПерераспределения, СтрокаПодобраннойПродукции, КоличествоРаспределенияНаДругиеСтроки) Тогда
					ПодобраннаяМаркируемаяПродукция.Удалить(СтрокаПерераспределения);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	// Распределение при сканировании
	Иначе
		Для Каждого СтрокаПерераспределения Из СтрокиПерераспределенияКоличества Цикл
			Если СтрокаПерераспределения <> СтрокаПодобраннойПродукции Тогда
				Если РаспределитьПровереннуюПодобраннуюПродукциюПриДобавленииСтроки(СтрокаПерераспределения, СтрокаПодобраннойПродукции, КоличествоРаспределенияНаДругиеСтроки) Тогда
					ПодобраннаяМаркируемаяПродукция.Удалить(СтрокаПерераспределения);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ПересчитатьНомераСтрок(ПодобраннаяМаркируемаяПродукция);
	Возврат Результат;
	
КонецФункции

Функция ПодобраннаяПродукцияПриУдаленииСтрокиПродолжение(Форма, СтрокаИзменений, СтрокаАгрегатор, ИзменениеКоличества, ДополнительныеПараметры) Экспорт
	
	Результат = ОбработчикиСтрокКВыполнению();
	
	ИзменениеКоличества = ?(ИзменениеКоличества < 0, -ИзменениеКоличества, ИзменениеКоличества);
	
	УточнитьКоличествоИС             = ДополнительныеПараметры.УточнитьКоличествоИС;
	ЭтоОбработчикУстановкиСтатуса    = ДополнительныеПараметры.ЭтоОбработчикУстановкиСтатуса;
	ПроизвольныйВесВСтрокеАгрегатора = ДополнительныеПараметры.ПроизвольныйВесВСтрокеАгрегатора;
	ТребуетВзвешивания               = ДополнительныеПараметры.ТребуетВзвешивания;
	ЭтоОбнулениеПодобранногоКоличества      = ДополнительныеПараметры.ЭтоОбнулениеПодобранногоКоличества;
	ЭтоВосстановлениеПодобранногоКоличества = ДополнительныеПараметры.ЭтоВосстановлениеПодобранногоКоличества;
	
	ВыполнитьРаспределениеКоличества = Истина;
	
	Если Не Форма.РежимПодбораСуществующихУпаковок И УточнитьКоличествоИС Тогда

		ВыполнитьИзменениеКоличестваИС = Истина;
		Если ЭтоОбработчикУстановкиСтатуса Тогда
			ВыполнитьИзменениеКоличестваИС = ПроизвольныйВесВСтрокеАгрегатора И ТребуетВзвешивания;
		КонецЕсли;

		Если ВыполнитьИзменениеКоличестваИС Тогда

			ИзменениеКоличестваИС = Мин(СтрокаАгрегатор.КоличествоИС, ИзменениеКоличества);

			Если СтрокаАгрегатор.КоличествоПотребительскихУпаковокТребующихВзвешивания > 0
				И СтрокаАгрегатор.КоличествоПодобрано > 0
				И СтрокаАгрегатор.КоличествоПодобраноВзвешено > 0 Тогда
				ИзменениеКоличестваИС = Мин(ИзменениеКоличестваИС, СтрокаАгрегатор.КоличествоПодобрано - СтрокаАгрегатор.КоличествоПодобраноВзвешено);
			КонецЕсли;

			СтрокаАгрегатор.КоличествоИС = СтрокаАгрегатор.КоличествоИС - ИзменениеКоличестваИС;

		КонецЕсли;

		Если ЭтоОбработчикУстановкиСтатуса Тогда

			Если ЭтоОбнулениеПодобранногоКоличества Тогда
				ВыполнитьРаспределениеКоличества = (СтрокаАгрегатор.Количество > СтрокаАгрегатор.КоличествоПодобраноВзвешено И СтрокаАгрегатор.Количество > СтрокаАгрегатор.КоличествоИС);
			ИначеЕсли ПроизвольныйВесВСтрокеАгрегатора И ТребуетВзвешивания Тогда
				ВыполнитьРаспределениеКоличества = (СтрокаАгрегатор.КоличествоПотребительскихУпаковокТребующихВзвешивания = 0);
			Иначе
				ВыполнитьРаспределениеКоличества = Ложь;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
	
	ИзменениеКоличествоПодобрано = Мин(СтрокаАгрегатор.КоличествоПодобрано, ИзменениеКоличества);

	СтрокаАгрегатор.КоличествоПодобрано = СтрокаАгрегатор.КоличествоПодобрано - ИзменениеКоличествоПодобрано;

	Если ВыполнитьРаспределениеКоличества Тогда

		ДанныеРаспределения = ДанныеРаспределенияСтрокиАгрегатораПоДаннымДокумента(Форма, СтрокаАгрегатор);

		Если ДанныеРаспределения <> Неопределено Тогда

			Если ДанныеРаспределения.КоличествоКРаспределению > 0 Тогда

				КоличествоКРаспределению = ДанныеРаспределения.КоличествоКРаспределению;

				УчитыватьСвойствоКоличествоИС = Ложь;

				Если ЭтоОбнулениеПодобранногоКоличества Тогда

					Если СтрокаАгрегатор.КоличествоПодобраноВзвешено > 0 И СтрокаАгрегатор.Количество > СтрокаАгрегатор.КоличествоПодобраноВзвешено Тогда

						КоличествоКРаспределению = Мин(КоличествоКРаспределению, СтрокаАгрегатор.Количество - СтрокаАгрегатор.КоличествоПодобраноВзвешено);

						УчитыватьСвойствоКоличествоИС = Истина;

					ИначеЕсли СтрокаАгрегатор.КоличествоПодобраноВзвешено = 0 Тогда

						УчитыватьСвойствоКоличествоИС = Истина;

					КонецЕсли;

				ИначеЕсли ЭтоВосстановлениеПодобранногоКоличества Тогда

					КоличествоКРаспределению = Мин(КоличествоКРаспределению, ИзменениеКоличества);

					УчитыватьСвойствоКоличествоИС = Истина;

				ИначеЕсли СтрокаАгрегатор.КоличествоИС > 0
					И СтрокаАгрегатор.Количество > СтрокаАгрегатор.КоличествоИС
					И СтрокаАгрегатор.КоличествоИС > СтрокаАгрегатор.Количество - КоличествоКРаспределению
					И СтрокаАгрегатор.КоличествоПотребительскихУпаковокВСтруктуреУпаковок > 0
					И СтрокаАгрегатор.КоличествоПодобрано = 0
					И СтрокаАгрегатор.КоличествоПодобраноВзвешено = 0 Тогда
					КоличествоКРаспределению = 0;
				КонецЕсли;

				Если УчитыватьСвойствоКоличествоИС
					И СтрокаАгрегатор.Количество > СтрокаАгрегатор.КоличествоИС
					И СтрокаАгрегатор.КоличествоИС > СтрокаАгрегатор.Количество - КоличествоКРаспределению Тогда

					КоличествоКРаспределению = Мин(КоличествоКРаспределению, СтрокаАгрегатор.Количество - СтрокаАгрегатор.КоличествоИС);

				ИначеЕсли Не Форма.РежимПодбораСуществующихУпаковок
					И ИзменениеКоличествоПодобрано > 0
					И СтрокаАгрегатор.КоличествоИС > СтрокаАгрегатор.КоличествоПодобрано + ИзменениеКоличествоПодобрано Тогда
					
					КоличествоКРаспределению = Мин(КоличествоКРаспределению, ИзменениеКоличествоПодобрано);
					
				ИначеЕсли Не Форма.РежимПодбораСуществующихУпаковок
					И ИзменениеКоличествоПодобрано > 0
					И СтрокаАгрегатор.Количество > СтрокаАгрегатор.КоличествоИС
					И СтрокаАгрегатор.КоличествоИС = СтрокаАгрегатор.КоличествоПодобрано + ИзменениеКоличествоПодобрано Тогда
					
					КоличествоКРаспределению = Мин(КоличествоКРаспределению, ИзменениеКоличествоПодобрано);
					
				КонецЕсли;

				ДанныеРаспределения.КоличествоКРаспределению = КоличествоКРаспределению;

			КонецЕсли;
			
			РаспределитьСвободныйОстатокПоСтрокамПодобраннойПродукции(Форма, СтрокаАгрегатор, ДанныеРаспределения, Результат);
			
			Если Форма.РежимПодбораСуществующихУпаковок Тогда
				СоздатьСтрокиПодобраннойПродукцииПоСвободномуОстатку(Форма, СтрокаАгрегатор, ДанныеРаспределения, Результат);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПодобраннаяМаркируемаяПродукция = Форма.ПодобраннаяМаркируемаяПродукция;
	
	Если СтрокаАгрегатор.Количество = 0 И СтрокаАгрегатор.КоличествоПодобрано = 0
		И СтрокаАгрегатор.КоличествоПотребительскихУпаковокТребующихВзвешивания = 0
		И (Форма.РежимПодбораСуществующихУпаковок
			Или СтрокаАгрегатор.КоличествоИС = 0 И СтрокаАгрегатор.КоличествоПотребительскихУпаковокВСтруктуреУпаковок = 0) Тогда
		ПодобраннаяМаркируемаяПродукция.Удалить(СтрокаАгрегатор);
	Иначе
		ДобавитьОбработчикИзмененияКоличества(Результат, СтрокаАгрегатор);
		УстановитьИндексКартинкиСостояниеПодбораКодаМаркировки(СтрокаАгрегатор);
	КонецЕсли;
	
	ПересчитатьНомераСтрок(ПодобраннаяМаркируемаяПродукция);
	
	Возврат Результат;
	
КонецФункции

Функция ПеренестиДопустимыйСвободныйОстатокНаСтрокуАгрегатор(Форма, СтрокаИзменений, СтрокаАгрегаторИсточник, СтрокаАгрегатор, Знач ИзменениеКоличества, ПараметрыИзмененияСтроки) Экспорт
	
	Результат = ОбработчикиСтрокКВыполнению();
	
	Если ПараметрыИзмененияСтроки = Неопределено Тогда
		ПараметрыИзмененияСтроки = ПараметрыИзмененияСтрокиПодобраннойПродукции();
	КонецЕсли;
	
	ПодобраннаяМаркируемаяПродукция = Форма.ПодобраннаяМаркируемаяПродукция;
	
	УточнитьКоличествоИС                              = ПараметрыИзмененияСтроки.УточнитьКоличествоИС;
	ЭтоЗагрузкаДанныхДокументаПриОткрытииФормы        = ПараметрыИзмененияСтроки.ЭтоЗагрузкаДанныхДокументаПриОткрытииФормы;
	УточнитьКоличествоПодобраноВзвешено               = ПараметрыИзмененияСтроки.УточнитьКоличествоПодобраноВзвешено;
	КоличествоПотребительскихУпаковокКРаспределениюИС = ПараметрыИзмененияСтроки.КоличествоПотребительскихУпаковокВСтруктуреУпаковок;
	
	ДобавляемоеКоличество   = 0;
	ДобавляемоеКоличествоИС = 0;
	
	Если УточнитьКоличествоИС Тогда
		Если ЭтоЗагрузкаДанныхДокументаПриОткрытииФормы Тогда
			ДобавляемоеКоличествоИС = ИзменениеКоличества;
		ИначеЕсли УточнитьКоличествоИС
			И СтрокаАгрегаторИсточник <> Неопределено
			И СтрокаАгрегаторИсточник.КоличествоИС = 0
			И СтрокаАгрегаторИсточник.КоличествоПотребительскихУпаковокВСтруктуреУпаковок = 0
			И СтрокаАгрегаторИсточник.КоличествоПодобрано = 0
			И СтрокаАгрегаторИсточник.КоличествоПотребительскихУпаковок = 0 Тогда
			ДобавляемоеКоличествоИС = ИзменениеКоличества;
		КонецЕсли;
	КонецЕсли;
	
	ДоступноеКоличество = 0;
	Если СтрокаАгрегатор.Количество > СтрокаАгрегатор.КоличествоПодобрано Тогда
		Если УточнитьКоличествоИС И СтрокаАгрегатор.Количество >= СтрокаАгрегатор.КоличествоИС Тогда // Требует рассмотрения
			ДоступноеКоличество = СтрокаАгрегатор.Количество - СтрокаАгрегатор.КоличествоПодобрано;
		Иначе
			ДоступноеКоличество = СтрокаАгрегатор.Количество - СтрокаАгрегатор.КоличествоПодобрано;
		КонецЕсли;
	КонецЕсли;
	ДоступноеКоличество = Мин(ДоступноеКоличество, ИзменениеКоличества);
	
	Если ЭтоЗагрузкаДанныхДокументаПриОткрытииФормы И УточнитьКоличествоИС Тогда
		ДобавляемоеКоличествоПодобрано = 0;
	Иначе
		ДобавляемоеКоличествоПодобрано = ИзменениеКоличества;
	КонецЕсли;
	
	Если УточнитьКоличествоПодобраноВзвешено
		И СтрокаАгрегатор.КоличествоПодобрано = 0
		И СтрокаАгрегатор.КоличествоПодобраноВзвешено > 0 Тогда
		ДобавляемоеКоличествоПодобрано = ДобавляемоеКоличествоПодобрано + СтрокаАгрегатор.КоличествоПодобраноВзвешено;
	КонецЕсли;
	
	КоличествоКРаспределениюИС = 0;
	
	ЭтоДозаполнениеКоличестваПоДокументу = (УточнитьКоличествоИС И ЭтоЗагрузкаДанныхДокументаПриОткрытииФормы И ДоступноеКоличество = ИзменениеКоличества);
	
	Если ДоступноеКоличество < ИзменениеКоличества Или ЭтоДозаполнениеКоличестваПоДокументу Тогда
		
		КоличествоКРаспределению = ?(Не ЭтоДозаполнениеКоличестваПоДокументу, ИзменениеКоличества - ДоступноеКоличество, ИзменениеКоличества);
		
		Если Форма.РежимПодбораСуществующихУпаковок Или УточнитьКоличествоИС Тогда
			
			Если УточнитьКоличествоИС И Не ЭтоЗагрузкаДанныхДокументаПриОткрытииФормы Тогда
				КоличествоКРаспределениюИС = ИзменениеКоличества;
			Иначе
				КоличествоКРаспределениюИС = 0;
			КонецЕсли;
			
		Иначе
			
			ДоступноеКоличествоИС = 0;
			Если СтрокаАгрегатор.КоличествоИС > СтрокаАгрегатор.КоличествоПодобрано Тогда
				ДоступноеКоличествоИС = СтрокаАгрегатор.КоличествоИС - СтрокаАгрегатор.КоличествоПодобрано;
			КонецЕсли;
			ДоступноеКоличествоИС = Мин(ДоступноеКоличествоИС, ИзменениеКоличества);
			
			КоличествоКРаспределениюИС = ИзменениеКоличества - ДоступноеКоличествоИС;
			
		КонецЕсли;
		
		Пока Не (СтрокаАгрегаторИсточник = Неопределено Или СтрокаАгрегаторИсточник = СтрокаАгрегатор Или КоличествоКРаспределению = 0) Цикл
			
			Если СтрокаАгрегаторИсточник.Количество = 0
				Или СтрокаАгрегаторИсточник.КоличествоПодобрано >= СтрокаАгрегаторИсточник.Количество Тогда
				ТекущееКоличество   = 0;
				ТекущееКоличествоИС = 0;
			ИначеЕсли СтрокаАгрегаторИсточник.КоличествоПодобрано > 0 Тогда
				ТекущееКоличество   = Мин(СтрокаАгрегаторИсточник.Количество - СтрокаАгрегаторИсточник.КоличествоПодобрано, КоличествоКРаспределению);
				ТекущееКоличествоИС = Мин(Мин(СтрокаАгрегаторИсточник.КоличествоИС, КоличествоКРаспределениюИС), ТекущееКоличество);
			Иначе
				ТекущееКоличество   = Мин(СтрокаАгрегаторИсточник.Количество,   КоличествоКРаспределению);
				ТекущееКоличествоИС = Мин(СтрокаАгрегаторИсточник.КоличествоИС, КоличествоКРаспределениюИС);
			КонецЕсли;
			
			Если ТекущееКоличество > 0 Или ТекущееКоличествоИС > 0 Тогда
				
				Если Форма.ДопустимаПроизвольнаяЕдиницаУчета Тогда
					
					КоличествоПотребительскихУпаковокВСтруктуреУпаковок = Мин(
						КоличествоПотребительскихУпаковокКРаспределениюИС,
						СтрокаАгрегаторИсточник.КоличествоПотребительскихУпаковокВСтруктуреУпаковок);
					
					КоличествоПотребительскихУпаковокКРаспределениюИС = КоличествоПотребительскихУпаковокКРаспределениюИС - КоличествоПотребительскихУпаковокВСтруктуреУпаковок;
					
					СтрокаАгрегаторИсточник.КоличествоПотребительскихУпаковокВСтруктуреУпаковок =
						СтрокаАгрегаторИсточник.КоличествоПотребительскихУпаковокВСтруктуреУпаковок - КоличествоПотребительскихУпаковокВСтруктуреУпаковок;
					
				КонецЕсли;
				
				СтрокаАгрегаторИсточник.Количество   = СтрокаАгрегаторИсточник.Количество   - ТекущееКоличество;
				СтрокаАгрегаторИсточник.КоличествоИС = СтрокаАгрегаторИсточник.КоличествоИС - ТекущееКоличествоИС;
				
				Если СтрокаАгрегаторИсточник.Количество = 0 И СтрокаАгрегаторИсточник.КоличествоПодобрано = 0 И СтрокаАгрегаторИсточник.КоличествоИС = 0 Тогда
					ПодобраннаяМаркируемаяПродукция.Удалить(СтрокаАгрегаторИсточник);
				Иначе
					ДобавитьОбработчикИзмененияКоличества(Результат, СтрокаАгрегатор);
					УстановитьИндексКартинкиСостояниеПодбораКодаМаркировки(СтрокаАгрегаторИсточник);
				КонецЕсли;
				
				КоличествоКРаспределению   = КоличествоКРаспределению   - ТекущееКоличество;
				КоличествоКРаспределениюИС = КоличествоКРаспределениюИС - ТекущееКоличествоИС;
				
				ДобавляемоеКоличество    = ДобавляемоеКоличество    + ТекущееКоличество;
				ДобавляемоеКоличествоИС  = ДобавляемоеКоличествоИС  + ТекущееКоличествоИС;
				
			КонецЕсли;
			
			ТекущийАгрегаторИсточник   = СтрокаАгрегаторИсточник;
			СледующийАгрегаторИсточник = Неопределено;
			СтрокаАгрегаторИсточник    = Неопределено;
			
			Если КоличествоКРаспределению > 0 Тогда
				СледующийАгрегаторИсточник = СтрокаАгрегаторМаркируемойПродукции(
					ПодобраннаяМаркируемаяПродукция, СтрокаИзменений, Форма.ПараметрыСканирования, Ложь);
			КонецЕсли;
			
			Если Не (ТекущийАгрегаторИсточник = СледующийАгрегаторИсточник Или СледующийАгрегаторИсточник = Неопределено) Тогда
				СтрокаАгрегаторИсточник = СледующийАгрегаторИсточник;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если УточнитьКоличествоИС И ДобавляемоеКоличествоИС = 0 Тогда
		Если КоличествоКРаспределениюИС > 0 Тогда
			ДобавляемоеКоличествоИС = КоличествоКРаспределениюИС;
		Иначе
			ДобавляемоеКоличествоИС = ИзменениеКоличества;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаАгрегатор.Количество          = СтрокаАгрегатор.Количество          + ДобавляемоеКоличество;
	СтрокаАгрегатор.КоличествоИС        = СтрокаАгрегатор.КоличествоИС        + ДобавляемоеКоличествоИС;
	СтрокаАгрегатор.КоличествоПодобрано = СтрокаАгрегатор.КоличествоПодобрано + ДобавляемоеКоличествоПодобрано;
	
	ДобавитьОбработчикИзмененияКоличества(Результат, СтрокаАгрегатор);
	УстановитьИндексКартинкиСостояниеПодбораКодаМаркировки(СтрокаАгрегатор);
	
	Возврат Результат
	
КонецФункции

Процедура РаспределитьСвободныйОстатокПоСтрокамПодобраннойПродукции(Форма, СтрокаАгрегатор, ДанныеРаспределения, Результат) Экспорт
	
	КоличествоКРаспределению = ДанныеРаспределения.КоличествоКРаспределению;
	
	Если КоличествоКРаспределению <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПодобраннаяМаркируемаяПродукция = Форма.ПодобраннаяМаркируемаяПродукция;
	ДоступныеСтрокиРаспределения    = ДанныеРаспределения.ДоступныеСтрокиРаспределения;
	ДоступноеКоличествоПоСтроке     = ДанныеРаспределения.ДоступноеКоличествоПоСтроке;
	
	Для Каждого СтрокаМаркируемойПродукции Из ПодобраннаяМаркируемаяПродукция Цикл
		
		Если КоличествоКРаспределению = 0 Тогда
			Прервать;
		ИначеЕсли СтрокаМаркируемойПродукции.Количество >= СтрокаМаркируемойПродукции.КоличествоПодобрано Тогда
			Если Форма.РежимПодбораСуществующихУпаковок
				Или СтрокаМаркируемойПродукции.Количество >= СтрокаМаркируемойПродукции.КоличествоИС Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ДанныеПоАгрегатору = СтрокиПоДокументуДляАгрегатора(ДоступныеСтрокиРаспределения, СтрокаМаркируемойПродукции, Форма.ПараметрыСканирования);
		
		ТекущийИндекс = ДанныеПоАгрегатору.СтрокиПоДокументу.ВГраница();
		Пока (ТекущийИндекс >= 0 И КоличествоКРаспределению > 0) Цикл
			
			СтрокаПоДокументу = ДанныеПоАгрегатору.СтрокиПоДокументу[ТекущийИндекс];
			
			ТекущийИндекс = ТекущийИндекс - 1;
			
			КоличествоКИзменению = Мин(КоличествоКРаспределению, ДоступноеКоличествоПоСтроке[СтрокаПоДокументу]);
			Если КоличествоКИзменению = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не Форма.РежимПодбораСуществующихУпаковок
				И СтрокаМаркируемойПродукции.КоличествоПодобрано = СтрокаМаркируемойПродукции.Количество
				И СтрокаМаркируемойПродукции.КоличествоИС > СтрокаМаркируемойПродукции.Количество Тогда
				КоличествоКИзменению = Мин(КоличествоКИзменению, СтрокаМаркируемойПродукции.КоличествоИС - СтрокаМаркируемойПродукции.Количество);
			ИначеЕсли Не Форма.РежимПодбораСуществующихУпаковок
				И СтрокаМаркируемойПродукции.Количество > СтрокаМаркируемойПродукции.КоличествоПодобрано
				И СтрокаМаркируемойПродукции.КоличествоИС > СтрокаМаркируемойПродукции.Количество Тогда
				КоличествоКИзменению = Мин(КоличествоКИзменению, СтрокаМаркируемойПродукции.КоличествоИС - СтрокаМаркируемойПродукции.Количество);
			Иначе
				КоличествоКИзменению = Мин(
					КоличествоКИзменению,
					?(СтрокаМаркируемойПродукции.КоличествоПодобрано > СтрокаМаркируемойПродукции.Количество,
						СтрокаМаркируемойПродукции.КоличествоПодобрано - СтрокаМаркируемойПродукции.Количество,
						0));
			КонецЕсли;
			
			Если КоличествоКИзменению = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ДоступноеКоличествоПоСтроке[СтрокаПоДокументу] = ДоступноеКоличествоПоСтроке[СтрокаПоДокументу] - КоличествоКИзменению;
			
			СтрокаМаркируемойПродукции.Количество = СтрокаМаркируемойПродукции.Количество + КоличествоКИзменению;
			
			КоличествоКРаспределению = КоличествоКРаспределению - КоличествоКИзменению;
			
			СтрокаАгрегатор.Количество = СтрокаАгрегатор.Количество - КоличествоКИзменению;
			
			ДобавитьОбработчикИзмененияКоличества(Результат, СтрокаМаркируемойПродукции);
			УстановитьИндексКартинкиСостояниеПодбораКодаМаркировки(СтрокаМаркируемойПродукции);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ДанныеРаспределения.КоличествоКРаспределению = КоличествоКРаспределению;
	
КонецПроцедуры

Процедура СоздатьСтрокиПодобраннойПродукцииПоСвободномуОстатку(Форма, СтрокаАгрегатор, ДанныеРаспределения, Результат) Экспорт
	
	КоличествоКРаспределению = ДанныеРаспределения.КоличествоКРаспределению;
	
	Если КоличествоКРаспределению <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПодобраннаяМаркируемаяПродукция = Форма.ПодобраннаяМаркируемаяПродукция;
	ДоступныеСтрокиРаспределения    = ДанныеРаспределения.ДоступныеСтрокиРаспределения;
	ДоступноеКоличествоПоСтроке     = ДанныеРаспределения.ДоступноеКоличествоПоСтроке;
	СопоставленныеСтроки            = ДанныеРаспределения.СопоставленныеСтроки;
	
	Для Каждого СтрокаПоДокументу Из ДоступныеСтрокиРаспределения Цикл
		
		Если КоличествоКРаспределению = 0 Тогда
			Прервать;
		КонецЕсли;
		
		КоличествоКИзменению = Мин(КоличествоКРаспределению, ДоступноеКоличествоПоСтроке[СтрокаПоДокументу]);
		
		Если КоличествоКИзменению = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДоступноеКоличествоПоСтроке[СтрокаПоДокументу] = ДоступноеКоличествоПоСтроке[СтрокаПоДокументу] - КоличествоКИзменению;
		
		СтрокаМаркируемойПродукции = СопоставленныеСтроки[СтрокаПоДокументу];
		
		ДобавитьНовуюСтроку = СтрокаМаркируемойПродукции = Неопределено
			Или СтрокаМаркируемойПродукции = СтрокаАгрегатор
				И (Не НоменклатурыСтрокСовпадают2(СтрокаАгрегатор, СтрокаПоДокументу)
					Или Не СвойстваВидаПродукцииСовпадают(СтрокаАгрегатор, СтрокаПоДокументу, Форма.ПараметрыСканирования, Истина));
		
		Если ДобавитьНовуюСтроку Тогда
			
			СтрокаМаркируемойПродукции = ПодобраннаяМаркируемаяПродукция.Вставить(0);
			ЗаполнитьЗначенияСвойств(СтрокаМаркируемойПродукции, СтрокаПоДокументу);
			СтрокаМаркируемойПродукции.НоменклатураСопоставлена = ЗначениеЗаполнено(СтрокаМаркируемойПродукции.Номенклатура);
			СтрокаМаркируемойПродукции.Количество               = 0;
			СтрокаМаркируемойПродукции.КоличествоИС             = 0;
			СтрокаМаркируемойПродукции.КоличествоПодобрано      = 0;
			
			ЗначениеGTIN = "";
			Если СтрокаМаркируемойПродукции.КодыGTIN.Количество() = 1 Тогда
				ЗначениеGTIN = СтрокаМаркируемойПродукции.КодыGTIN[0].Значение;
			КонецЕсли;
			
			СтрокаМаркируемойПродукции.GTIN              = ЗначениеGTIN;
			СтрокаМаркируемойПродукции.ПредставлениеGTIN = ПредставлениеМассиваGTIN(СтрокаМаркируемойПродукции.КодыGTIN);
			
			ДобавитьОбработчикИзмененияКоличества(Результат, СтрокаМаркируемойПродукции);
			ДобавитьОбработчикИзмененияНоменклатуры(Результат, СтрокаМаркируемойПродукции);
			
			Если Форма.РежимПодбораСуществующихУпаковок Тогда
				СтрокаМаркируемойПродукции.Количество = СтрокаМаркируемойПродукции.Количество + КоличествоКИзменению;
			КонецЕсли;
			СтрокаАгрегатор.Количество            = СтрокаАгрегатор.Количество            - КоличествоКИзменению;
			
			УстановитьИндексКартинкиСостояниеПодбораКодаМаркировки(СтрокаМаркируемойПродукции);
			
		КонецЕсли;
		
		КоличествоКРаспределению = КоличествоКРаспределению - КоличествоКИзменению;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСоответствиеСтрокДереваУпаковокРекурсивно(СтрокиДерева, СоответствиеСтрокДереваУпаковок, ИмяПоляИндекса)
	
	ВидыУпаковокИСЛогистическая = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая");
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Штрихкод = СтрокаДерева[ИмяПоляИндекса];
		Если СтрокаДерева.ВидУпаковки = ВидыУпаковокИСЛогистическая
			И СтрНачинаетсяС(Штрихкод, "(") Тогда
			
			ПараметрыШтрихкода = ШтрихкодыУпаковокКлиентСервер.ПараметрыШтрихкода(Штрихкод);
			Если ПараметрыШтрихкода.Результат <> Неопределено
				И ПараметрыШтрихкода.ТипШтрихкода <> ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.SSCC")
				И ПараметрыШтрихкода.ТипШтрихкода <> ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.SSCC18")
				И ПараметрыШтрихкода.ТипШтрихкода <> ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.SSCC20") Тогда
				
				ЗначениеШтрихкодаБезСкобок = ШтрихкодыУпаковокКлиентСервер.ШтрихкодGS1(ПараметрыШтрихкода.Результат, Ложь, "");
				Если ЗначениеЗаполнено(ЗначениеШтрихкодаБезСкобок)
					И ЗначениеШтрихкодаБезСкобок <> Штрихкод Тогда
					СоответствиеСтрокДереваУпаковок.Вставить(ЗначениеШтрихкодаБезСкобок, СтрокаДерева);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СоответствиеСтрокДереваУпаковок.Вставить(Штрихкод, СтрокаДерева);
		
		ЗаполнитьСоответствиеСтрокДереваУпаковокРекурсивно(СтрокаДерева.Строки, СоответствиеСтрокДереваУпаковок, ИмяПоляИндекса);
		
	КонецЦикла;
	
КонецПроцедуры

#Область ДобавлениеСтрокиПодобраннойПродукции

Функция КоличествоРаспределения(СтрокаИзменений, ПараметрыИзмененияСтроки)
	
	Результат = ПустыеКоличестваРаспределения();
	
	ЭтоЗагрузкаВходящегоДереваДляПроверки = ПараметрыИзмененияСтроки.УточнитьКоличествоИС И ПараметрыИзмененияСтроки.ЭтоЗагрузкаДанныхДокументаПриОткрытииФормы;
	
	КоличествоИзменение = СтрокаИзменений.Количество;
	Если ТипЗнч(СтрокаИзменений) = Тип("ДанныеФормыЭлементДерева") Тогда
		КоличествоПотребительскихУпаковокИзменение = ?(СтрокаИзменений.КоличествоПодчиненныхПотребительскихУпаковок = 0 И СтрокаИзменений.МаркируемаяПродукция,
			1, СтрокаИзменений.КоличествоПодчиненныхПотребительскихУпаковок);
	Иначе 
		КоличествоПотребительскихУпаковокИзменение = СтрокаИзменений.КоличествоПотребительскихУпаковок;
	КонецЕсли;
	
	Если ЭтоЗагрузкаВходящегоДереваДляПроверки Тогда
		Результат.КоличествоИС = СтрокаИзменений.Количество;
		Результат.КоличествоПотребительскихУпаковокВСтруктуреУпаковок = КоличествоПотребительскихУпаковокИзменение;
		Возврат Результат;
	КонецЕсли;
	
	Результат.КоличествоПодобрано = КоличествоИзменение;
	Результат.КоличествоПотребительскихУпаковок = КоличествоПотребительскихУпаковокИзменение;
	
	ЭтоУпаковкаОбъемноСортовогоУчета = ПараметрыИзмененияСтроки.ЭтоУпаковкаОбъемноСортовогоУчета Или(
		ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаИзменений, "ВидУпаковки")
			И (СтрокаИзменений.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.ОбъемноСортовойУчет")
				Или СтрокаИзменений.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.НеЯвляетсяУпаковкой")));
				
	Если ПараметрыИзмененияСтроки.УточнитьКоличествоИС Тогда
		Результат.КоличествоИС = Результат.КоличествоПодобрано;
		Результат.КоличествоПотребительскихУпаковокВСтруктуреУпаковок = Результат.КоличествоПотребительскихУпаковок;
	КонецЕсли;
	
	Если Результат.КоличествоПодобрано = 0 Тогда
		Результат.КоличествоПотребительскихУпаковокТребующихВзвешивания = Результат.КоличествоПотребительскихУпаковок;
	Иначе 
		Результат.КоличествоПодобраноВзвешено = Результат.КоличествоПодобрано;
	КонецЕсли;
	Если ЭтоУпаковкаОбъемноСортовогоУчета Тогда
		Результат.КоличествоПодобраноВзвешеноОСУ = Результат.КоличествоПодобрано;
		Результат.КоличествоПотребительскихУпаковокОСУ = Результат.КоличествоПотребительскихУпаковок;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КоличествоРаспределенияВходящегоДереваНаДругиеСтроки(СтрокаПодобраннойПродукции, КоличествоКИзменению)
	
	//Свертка по полям Количество (учетное в документе) и КоличествоИС (общее в дереве)
	
	Результат = ПустыеКоличестваРаспределения();
	КоличествоКПереносу = Макс(0, КоличествоКИзменению.КоличествоИС + СтрокаПодобраннойПродукции.КоличествоИС - СтрокаПодобраннойПродукции.Количество);
	Результат.КоличествоИС  = КоличествоКПереносу;
	
	Возврат Результат;
	
КонецФункции

Функция КоличествоРаспределенияНаДругиеСтроки(СтрокаПодобраннойПродукции, КоличествоКИзменению)
	
	//Свертка по полям Количество (учетное в документе) и КоличествоПодобрано (фактическое в дереве)
	
	Результат = ПустыеКоличестваРаспределения();
	КоличествоКПереносу = Макс(0, КоличествоКИзменению.КоличествоПодобрано + СтрокаПодобраннойПродукции.КоличествоПодобрано - СтрокаПодобраннойПродукции.Количество);
	Результат.КоличествоПодобрано  = КоличествоКПереносу;
	
	Возврат Результат;
	
КонецФункции

Функция РаспределитьПровереннуюПодобраннуюПродукциюПриДобавленииСтроки(СтрокаПерераспределения, СтрокаПодобраннойПродукции, КоличествоРаспределения)
	
	Количество = Макс(0, Мин(КоличествоРаспределения.КоличествоПодобрано - КоличествоРаспределения.Количество, СтрокаПерераспределения.Количество - СтрокаПерераспределения.КоличествоПодобрано));
	КоличествоРаспределения.КоличествоПодобрано = КоличествоРаспределения.КоличествоПодобрано - Количество;
	СтрокаПерераспределения.Количество          = СтрокаПерераспределения.Количество - Количество;
	СтрокаПодобраннойПродукции.Количество       = СтрокаПодобраннойПродукции.Количество + Количество;
	
	// Вернем необходимость удалить нулевую строку
	КоличестваПослеИзменения = ПустыеКоличестваРаспределения();
	ЗаполнитьЗначенияСвойств(КоличестваПослеИзменения, СтрокаПерераспределения);
	Для Каждого Показатель Из КоличестваПослеИзменения Цикл
		Если Показатель.Значение <> 0 Тогда
			УстановитьИндексКартинкиСостояниеПодбораКодаМаркировки(СтрокаПерераспределения);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

Функция РаспределитьВходящуюПродукциюПриДобавленииСтроки(СтрокаПерераспределения, СтрокаПодобраннойПродукции, КоличествоРаспределения)
	
	Количество = Макс(0, Мин(КоличествоРаспределения.КоличествоИС, СтрокаПерераспределения.Количество - СтрокаПерераспределения.КоличествоИС));
	КоличествоРаспределения.КоличествоИС  = КоличествоРаспределения.КоличествоИС - Количество;
	СтрокаПерераспределения.Количество    = СтрокаПерераспределения.Количество - Количество;
	СтрокаПодобраннойПродукции.Количество = СтрокаПодобраннойПродукции.Количество + Количество;
	
	// Вернем необходимость удалить нулевую строку
	КоличестваПослеИзменения = ПустыеКоличестваРаспределения();
	ЗаполнитьЗначенияСвойств(КоличестваПослеИзменения, СтрокаПерераспределения);
	Для Каждого Показатель Из КоличестваПослеИзменения Цикл
		Если Показатель.Значение <> 0 Тогда
			УстановитьИндексКартинкиСостояниеПодбораКодаМаркировки(СтрокаПерераспределения);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область Перемаркировка

Процедура ПроверитьСоответствиеОтборуТребуетсяПеремаркировка(СтрокаДерева)
	
	СоответствуетОтбору = Ложь;
	УстановитьОтборТребуетсяПеремаркировкаВСтрокеДерева(СтрокаДерева, СоответствуетОтбору);
	СтрокаДерева.НеСоответствуетОтбору = Не СоответствуетОтбору;
	
	РодительскаяСтрока = СтрокаДерева.ПолучитьРодителя();
	
	Пока РодительскаяСтрока <> Неопределено Цикл
		Для Каждого ПодчиненнаяСтрока Из РодительскаяСтрока.ПолучитьЭлементы() Цикл
			РодительскаяСтрока.НеСоответствуетОтбору = Истина;

			Если Не ПодчиненнаяСтрока.НеСоответствуетОтбору Тогда
				РодительскаяСтрока.НеСоответствуетОтбору = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		РодительскаяСтрока = РодительскаяСтрока.ПолучитьРодителя();
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаголовокТребуетсяПеремаркировка(Форма)
	
	ТекстТребуется = СтрШаблон(НСтр("ru = 'Требуется перемаркировка упаковок - %1.'"), Форма.КоличествоУпаковокКоторыеНеобходимоПеремаркировать);
	СтрокаТребуется = Новый ФорматированнаяСтрока(ТекстТребуется,, Форма.ЦветТекстаТребуетВнимания);
	
	Если Форма.УстановленОтборТребуетсяПеремаркировать Тогда
		ТекстОтбор = НСтр("ru = '(снять отбор)'");
	Иначе
		ТекстОтбор = НСтр("ru = '(отобрать)'");
	КонецЕсли;
	
	СтрокаОтбор = Новый ФорматированнаяСтрока(ТекстОтбор,, Форма.ЦветГиперссылки,, "ИзменитьОтборТребуетсяПеремаркировка");
	
	Возврат Новый ФорматированнаяСтрока(СтрокаТребуется, " ", СтрокаОтбор);
	
КонецФункции

#КонецОбласти

Функция ВСтрокеНаборКакПотребительская(Строка, ПроверятьТипУпаковки, ПараметрыСканирования) Экспорт
	Возврат Строка.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор")
		И (Не ПроверятьТипУпаковки
		   Или (ПроверятьТипУпаковки И Строка.ТипУпаковки = ПредопределенноеЗначение("Перечисление.ТипыУпаковок.МультитоварнаяУпаковка")))
		И Не ПараметрыСканирования.СозданиеНаборов;
КонецФункции

Функция ВСтрокеНаборКакГрупповая(Строка, ПроверятьТипУпаковки, ПараметрыСканирования) Экспорт
	Возврат Строка.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор")
		И (ПроверятьТипУпаковки И Строка.ТипУпаковки = ПредопределенноеЗначение("Перечисление.ТипыУпаковок.МонотоварнаяУпаковка")
			Или ПараметрыСканирования.СозданиеНаборов);
КонецФункции

Функция ЭтоГрупповаяУпаковка(Строка) Экспорт
	Возврат (Строка.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Групповая"));
КонецФункции

Функция ЭтоНабор(Строка) Экспорт
	Возврат (Строка.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор"));
КонецФункции

#КонецОбласти