
&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_УстановитьСтатьюБюджета", "Установить статью бюджета", "АУ_УстановитьСтатьюБюджета");
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_УстановитьДатуБюджета", "Установить дату бюджета", "АУ_УстановитьДатуБюджета");
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_РедактироватьСтатьиБюджета", "Редактировать статьи бюджета", "АУ_РедактироватьСтатьиБюджета");
	
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_УстановитьСтатьюБюджета", Элементы.СписокПлатежей.КонтекстноеМеню,, "АУ_УстановитьСтатьюБюджета", 1);
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_УстановитьДатуБюджета", Элементы.СписокПлатежей.КонтекстноеМеню,, "АУ_УстановитьДатуБюджета", 1);
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_РедактироватьСтатьиБюджета", Элементы.СписокПлатежей.КонтекстноеМеню,, "АУ_РедактироватьСтатьиБюджета", 1);
	
	СписокПлатежей.ТекстЗапроса = АУ_ТекстЗапросаСписокПлатежей();

	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(ЭтаФорма, "АУ_Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_Бюджет", "СписокПлатежей", "Бюджет", 1, "СписокПлатежей.Бюджет");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_КодыСтатейБюджета", "СписокПлатежей", "Коды статей", 1, "СписокПлатежей.АУ_КодыСтатейБюджета");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_Сумма", "ГруппаИтоги", "Сумма строк", 1, "АУ_Сумма", Новый Структура("ТолькоПросмотр", Истина));
	
КонецПроцедуры


&НаКлиенте
Процедура АУ_УстановитьСтатьюБюджета(Команда)
	
	ОткрытьФорму("Справочник.АУ_СтатьиБюджета.ФормаВыбора",,ЭтаФорма,Новый УникальныйИдентификатор,,,Новый ОписаниеОповещения("АУ_УстановитьСтатьюБюджетаЗавершение",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_УстановитьСтатьюБюджетаЗавершение(Значение,ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Для каждого Ключ Из Элементы.СписокПлатежей.ВыделенныеСтроки Цикл
			УстановитьСтатьюБюджетаДляЗаписиРеестра(Значение,Ключ);
		КонецЦикла;
	КонецЕсли;
	
	Элементы.СписокПлатежей.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_УстановитьДатуБюджета(Команда)
	
	ПоказатьВводДаты(Новый ОписаниеОповещения("АУ_УстановитьДатуБюджетаБюджетаЗавершение",ЭтаФорма),ТекущаяДата(),"Укажите дату бюджета",ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_УстановитьДатуБюджетаБюджетаЗавершение(Значение,ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Для каждого Ключ Из Элементы.СписокПлатежей.ВыделенныеСтроки Цикл
			УстановитьДатуБюджетаДляЗаписиРеестра(Значение,Ключ);
		КонецЦикла;
	КонецЕсли;
	
	Элементы.СписокПлатежей.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуБюджетаДляЗаписиРеестра(Значение,КлючЗаписи)
	
	Если ЗначениеЗаполнено(КлючЗаписи.Ссылка) Тогда
		
		Если ТипЗнч(КлючЗаписи.Ссылка)=Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") ИЛИ ТипЗнч(КлючЗаписи.Ссылка)=Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
			
			ТекОбъект=КлючЗаписи.Ссылка.ПолучитьОбъект();
			
			СтатьиБюджета=ТекОбъект.АУ_СтатьиБюджета.Выгрузить();
			ТекОбъект.АУ_ДатаБюджета=Значение;
			
			АУ_Привелигированный.ИзменитьСтатьиБюджетаВДокументе(КлючЗаписи.Ссылка,СтатьиБюджета,ТекОбъект.АУ_ДатаБюджета,ТекОбъект.АУ_ФактическийКурсВалюты);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатьюБюджетаДляЗаписиРеестра(Значение,КлючЗаписи)
	
	Если ЗначениеЗаполнено(КлючЗаписи.Ссылка) Тогда
		
		Если ТипЗнч(КлючЗаписи.Ссылка)=Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") ИЛИ ТипЗнч(КлючЗаписи.Ссылка)=Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
			
			ТекОбъект=КлючЗаписи.Ссылка.ПолучитьОбъект();
			
			СтатьиБюджета=ТекОбъект.АУ_СтатьиБюджета.Выгрузить();
			НоваяСтрока=СтатьиБюджета.Добавить();
			НоваяСтрока.СтатьяБюджета=Значение;
			НоваяСтрока.Сумма=ТекОбъект.СуммаДокумента;
			
			АУ_Привелигированный.ИзменитьСтатьиБюджетаВДокументе(КлючЗаписи.Ссылка,СтатьиБюджета,ТекОбъект.АУ_ДатаБюджета,ТекОбъект.АУ_ФактическийКурсВалюты);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_РедактироватьСтатьиБюджета(Команда)
	
	ОткрытьФорму("Обработка.АУ_РедактированиеСтатейБюджетаВОплате.Форма.Форма",Новый Структура("Документ",Элементы.СписокПлатежей.ТекущиеДанные.Ссылка),ЭтаФорма,Новый УникальныйИдентификатор,,,Новый ОписаниеОповещения("АУ_РедактироватьСтатьиБюджетаЗавершение",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_РедактироватьСтатьиБюджетаЗавершение(Значение,ДопПараметры) Экспорт
	
	Элементы.СписокПлатежей.Обновить();
	
КонецПроцедуры

&НаСервере
&Вместо("ТекстЗапросаСписокПлатежей")
Функция АУ_ТекстЗапросаСписокПлатежей()
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	РеестрДокументов.Ссылка КАК Ссылка,
	|	РеестрДокументов.ДатаДокументаИБ КАК Дата,
	|	РеестрДокументов.НомерДокументаИБ КАК Номер,
	|	РеестрДокументов.ПометкаУдаления КАК ПометкаУдаления,
	|	РеестрДокументов.Проведен КАК Проведен,
	|	РеестрДокументов.Организация КАК Организация,
	|	ВЫРАЗИТЬ(РеестрДокументов.МестоХранения.Ключ КАК Справочник.БанковскиеСчетаОрганизаций) КАК БанковскийСчет,
	|	
	|	ВЫБОР КОГДА РеестрДокументов.ТипСсылки = &ИдОбъектаПоступлениеБезналичныхДС ТОГДА
	|			ДанныеПоступленияБезналичныхДС.ТипПлатежногоДокумента
	|		КОГДА РеестрДокументов.ТипСсылки = &ИдОбъектаСписаниеБезналичныхДС ТОГДА
	|			ДанныеСписанияБезналичныхДС.ТипПлатежногоДокумента
	|	КОНЕЦ КАК ТипПлатежногоДокумента,
	|	
	|	РеестрДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА РеестрДокументов.Контрагент.Ключ ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.Организации)
	|		КОГДА РеестрДокументов.Контрагент.Ключ ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.Контрагенты)
	|		КОГДА РеестрДокументов.Контрагент.Ключ ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.ФизическиеЛица)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Контрагент,
	|	РеестрДокументов.Контрагент КАК КонтрагентКлюч,
	|	РеестрДокументов.Контрагент.Наименование КАК КонтрагентПредставление,
	|	РеестрДокументов.ДатаПервичногоДокумента КАК ДатаВходящегоДокумента,
	|	РеестрДокументов.НомерПервичногоДокумента КАК НомерВходящегоДокумента,
	|	
	|	ВЫБОР РеестрДокументов.ТипСсылки
	|		КОГДА &ИдОбъектаПоступлениеБезналичныхДС ТОГДА
	|			РеестрДокументов.Сумма
	|		КОГДА &ИдОбъектаРКО ТОГДА
	|			РеестрДокументов.Сумма
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаПоступления,
	|	ВЫБОР РеестрДокументов.ТипСсылки
	|		КОГДА &ИдОбъектаСписаниеБезналичныхДС ТОГДА
	|			РеестрДокументов.Сумма
	|		КОГДА &ИдОбъектаПКО ТОГДА
	|			РеестрДокументов.Сумма
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаСписания,
	|	
	|	РеестрДокументов.Валюта КАК Валюта,
	|	РеестрДокументов.ДатаОтраженияВУчете <> ДАТАВРЕМЯ(1, 1, 1) КАК ПроведеноБанком,
	|	РеестрДокументов.ДатаОтраженияВУчете КАК ДатаПроведенияБанком,
	|	РеестрДокументов.Дополнительно КАК НазначениеПлатежа,
	|	РеестрДокументов.Комментарий КАК Комментарий,
	|	РеестрДокументов.Ответственный КАК Ответственный,
	|	РеестрДокументов.Автор КАК Автор,
	|	РеестрДокументов.СторноИсправление КАК СторноИсправление,
	|	ВЫБОР
	|		КОГДА НЕ РеестрДокументов.СторноИсправление
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеестрДокументов.СторнируемыйДокумент
	|	КОНЕЦ КАК СторнируемыйИсправляемыйДокумент,
	|	ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) КАК Тип,
	|	ВЫБОР
	|		КОГДА ДокументыСОшибкамиПроверкиКонтрагентов.Документ ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОшибкиПроверкиКонтрагентов,
	|	СостоянияОбменСБанками.Состояние КАК СостояниеДиректБанк,
	|	СостоянияОбменСБанками.ПредставлениеСостояния КАК ПредставлениеСостоянияДиректБанк,
	|	ВЫБОР
	|		КОГДА СостоянияОбменСБанками.Состояние В (
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияОбменСБанками.Аннулирован),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияОбменСБанками.Отклонен),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияОбменСБанками.ОшибкаПередачи)
	|		) ТОГДА 3
	|		КОГДА СостоянияОбменСБанками.Состояние В (
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияОбменСБанками.НаПодписи),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияОбменСБанками.НеСформирован),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияОбменСБанками.ТребуетсяПодтверждение),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияОбменСБанками.ТребуетсяОтправка)
	|		) ТОГДА 1
	|		КОГДА СостоянияОбменСБанками.Состояние В (
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияОбменСБанками.ОжидаетсяВыписка),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияОбменСБанками.ОжидаетсяИзвещениеОПолучении),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияОбменСБанками.ОжидаетсяИсполнение)
	|		) ТОГДА 2
	|		КОГДА СостоянияОбменСБанками.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОбменСБанками.ПлатежИсполнен)
	|			ТОГДА 0
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК КартинкаДиректБанк,
	|	ВЫБОР
	|		КОГДА РеестрДокументов.Проведен
	|			ТОГДА 0
	|		КОГДА РеестрДокументов.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК НестандартнаяКартинка,
	|	ВЫБОР
   |		КОГДА ВТДанныеПоБюджету.Сумма ЕСТЬ NULL
   |			ТОГДА ""Не распределено""
   |		КОГДА ВТДанныеПоБюджету.Сумма = 0
   |			ТОГДА ""Не распределено""
   |		КОГДА ВТДанныеПоБюджету.Сумма = РеестрДокументов.Сумма
   |			ТОГДА ""Распределено""
   |		ИНАЧЕ ""Частично""
   |	КОНЕЦ КАК Бюджет,
   |	ВЫБОР КОГДА РеестрДокументов.ТипСсылки = &ИдОбъектаПоступлениеБезналичныхДС ТОГДА
	|			ДанныеПоступленияБезналичныхДС.АУ_КодыСтатейБюджета
	|		КОГДА РеестрДокументов.ТипСсылки = &ИдОбъектаСписаниеБезналичныхДС ТОГДА
	|			ДанныеСписанияБезналичныхДС.АУ_КодыСтатейБюджета
	|	КОНЕЦ КАК АУ_КодыСтатейБюджета
	|ИЗ
	|	РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеПоступленияБезналичныхДС
	|		ПО ДанныеПоступленияБезналичныхДС.Ссылка = РеестрДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств КАК ДанныеСписанияБезналичныхДС
	|		ПО ДанныеСписанияБезналичныхДС.Ссылка = РеестрДокументов.Ссылка
	|		
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыСОшибкамиПроверкиКонтрагентов КАК ДокументыСОшибкамиПроверкиКонтрагентов
	|		ПО РеестрДокументов.Ссылка = ДокументыСОшибкамиПроверкиКонтрагентов.Документ
	|			И (&ИспользованиеПроверкиВозможно)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОбменСБанками КАК СостоянияОбменСБанками
	|		ПО СостоянияОбменСБанками.СсылкаНаОбъект = РеестрДокументов.Ссылка}
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
   |			ПоступлениеБезналичныхДенежныхСредствАУ_СтатьиБюджета.Ссылка КАК Документ,
   |			СУММА(ПоступлениеБезналичныхДенежныхСредствАУ_СтатьиБюджета.Сумма) КАК Сумма
   |		ИЗ
   |			Документ.ПоступлениеБезналичныхДенежныхСредств.АУ_СтатьиБюджета КАК ПоступлениеБезналичныхДенежныхСредствАУ_СтатьиБюджета
   |		
   |		СГРУППИРОВАТЬ ПО
   |			ПоступлениеБезналичныхДенежныхСредствАУ_СтатьиБюджета.Ссылка
   |		
   |		ОБЪЕДИНИТЬ ВСЕ
   |		
   |		ВЫБРАТЬ
   |			СписаниеБезналичныхДенежныхСредствАУ_СтатьиБюджета.Ссылка,
   |			СУММА(СписаниеБезналичныхДенежныхСредствАУ_СтатьиБюджета.Сумма)
   |		ИЗ
   |			Документ.СписаниеБезналичныхДенежныхСредств.АУ_СтатьиБюджета КАК СписаниеБезналичныхДенежныхСредствАУ_СтатьиБюджета
   |		
   |		СГРУППИРОВАТЬ ПО
   |			СписаниеБезналичныхДенежныхСредствАУ_СтатьиБюджета.Ссылка) КАК ВТДанныеПоБюджету
   |		ПО РеестрДокументов.Ссылка = ВТДанныеПоБюджету.Документ
	|		
	|ГДЕ
	|	РеестрДокументов.ТипСсылки В (
	|		&ИдОбъектаПоступлениеБезналичныхДС,
	|		&ИдОбъектаСписаниеБезналичныхДС,
	|		&ИдОбъектаПКО,
	|		&ИдОбъектаРКО)
	|	И ТИПЗНАЧЕНИЯ(РеестрДокументов.МестоХранения.Ключ) = ТИП(Справочник.БанковскиеСчетаОрганизаций)
	|	И (РеестрДокументов.ДатаОтраженияВУчете МЕЖДУ &НачалоПериода И &КонецПериода
	|		ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			И РеестрДокументов.ДатаОтраженияВУчете >= &НачалоПериода
	|		ИЛИ РеестрДокументов.ДатаОтраженияВУчете = ДАТАВРЕМЯ(1, 1, 1))
	|	
	|{ГДЕ
	|	РеестрДокументов.Ссылка.* КАК Ссылка,
	|	ВЫРАЗИТЬ(РеестрДокументов.МестоХранения.Ключ КАК Справочник.БанковскиеСчетаОрганизаций).* КАК БанковскийСчет,
	|	РеестрДокументов.Организация.* КАК Организация,
	|	РеестрДокументов.ДатаДокументаИБ КАК Дата,
	|	РеестрДокументов.НомерДокументаИБ КАК Номер,
	|	РеестрДокументов.ТипСсылки КАК ТипСсылки,
	|	РеестрДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РеестрДокументов.Партнер.* КАК Партнер,
	|	(ВЫБОР
	|		КОГДА РеестрДокументов.Контрагент.Ключ ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.Организации)
	|		КОГДА РеестрДокументов.Контрагент.Ключ ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.Контрагенты)
	|		КОГДА РеестрДокументов.Контрагент.Ключ ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(РеестрДокументов.Контрагент.Ключ КАК Справочник.ФизическиеЛица)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ).* КАК Контрагент,
	|	РеестрДокументов.Подразделение.* КАК Подразделение,
	|	РеестрДокументов.Ответственный.* КАК Ответственный,
	|	РеестрДокументов.Автор.* КАК Автор,
	|	РеестрДокументов.Дополнительно КАК НазначениеПлатежа,
	|	РеестрДокументов.Комментарий КАК Комментарий,
	|	РеестрДокументов.Проведен КАК Проведен,
	|	РеестрДокументов.ПометкаУдаления КАК ПометкаУдаления
	|}";

	Возврат ТекстЗапроса;
	
КонецФункции

&НаКлиенте
Процедура АУ_СписокПлатежейПриАктивизацииСтрокиПосле(Элемент)
	
	ПосчитатьСуммуВыделенныхСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ПосчитатьСуммуВыделенныхСтрок()
	
	ЭтаФорма.АУ_Сумма = 0;
	
	Для каждого стр Из Элементы.СписокПлатежей.ВыделенныеСтроки Цикл
		ЭтаФорма.АУ_Сумма = ЭтаФорма.АУ_Сумма + стр.Ссылка.СуммаДокумента;
	КонецЦикла;
	
КонецПроцедуры