///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем".
// ОбщийМодуль.НастройкиПлатежныхСистемПовтИсп.
//
// Повторно используемые серверные процедуры настройки работы с платежными системами:
//  - инициация параметров подключения.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Создает структуру настроек подключения к сервису.
//
// Возвращаемое значение:
//  Структура - настройки подключения:
//   * НастройкиПроксиСервера - см. ПолучениеФайловИзИнтернета.НастройкиПроксиНаСервере
// 
Функция ИнициализироватьПараметрыПодключения() Экспорт
	
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("НастройкиПроксиСервера", ПолучениеФайловИзИнтернета.НастройкиПроксиНаСервере());
	
	//@skip-check constructor-function-return-section
	Возврат ПараметрыОбмена;
	
КонецФункции

// Формирует описание подчиненных подсистем для подсистемы ПлатежныеСистемы
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - описание подсистем:
//    * Ключ - Строка - платежная система
//    * Значение - см. НастройкиПлатежныхСистемСлужебный.НовыйОписаниеПлатежнойСистемы.
//
Функция ОписаниеПлатежныхСервисов() Экспорт
	
	Результат = Новый Соответствие;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.БазоваяФункциональностьПлатежныхСистем") Тогда
		МодульПлатежныеСистемыСобытия = ОбщегоНазначения.ОбщийМодуль("ПлатежныеСистемыСобытия");
		МодульПлатежныеСистемыСобытия.ПриОписанииПлатежныхСервисов(Результат);
	КонецЕсли;
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

#КонецОбласти
