// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив; // Массив Из Строка
	
	Если Статус = Перечисления.СтатусыРейсов.Подготовлен Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Транспорт");
		МассивНепроверяемыхРеквизитов.Добавить("Водитель");
		
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыРейсов.Отменен Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ДатаВыезда");
		
	КонецЕсли;
	
	Если СпособДоставки <> Перечисления.СпособыДоставки25.СиламиПеревозчика Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Перевозчик");
		
	КонецЕсли;
	
	ОформлениеЗакончено = (Статус = Перечисления.СтатусыРейсов.Отправлен)
		ИЛИ (Статус = Перечисления.СтатусыРейсов.Завершен)
		ИЛИ (Статус = Перечисления.СтатусыРейсов.Отменен);
	
	Если ОформлениеЗакончено
	   И ТипЗнч(ТранспортноеСредство) <> Тип("СправочникСсылка.ТранспортныеСредства") Тогда
		
		ШаблонОшибки = НСтр("ru = 'В статусе ""%1"" должно быть указано определенное транспортное средство'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, Строка(Статус));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Транспорт",, Отказ);
		
	КонецЕсли;
	
	Если ДатаВыезда > ТекущаяДатаСеанса() Тогда
		
		Если Статус = Перечисления.СтатусыРейсов.Отправлен Тогда
			
			ТекстСообщения = НСтр("ru = 'Дата выезда в отправленном рейсе не может быть больше текущей.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДатаВыезда",, Отказ);
			
		ИначеЕсли Статус = Перечисления.СтатусыРейсов.Завершен Тогда
			
			ТекстСообщения = НСтр("ru = 'Дата выезда в завершенном рейсе не может быть больше текущей.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДатаВыезда",, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверкаЗаполненияМаршрута(МассивНепроверяемыхРеквизитов, Отказ);
	ПроверкаЗаполненияСодержимого(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если СпособДоставки = Перечисления.СпособыДоставки25.НашимиСилами Тогда
		
		Перевозчик = Справочники.Партнеры.ПустаяСсылка();
		Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		
	КонецЕсли;
	
	УдалитьНеактуальныеСтрокиСодержимого();
	ДобавитьНачальнуюСтрокуМаршрута();
	ОкруглитьВремяВыездаИДоставки();
	
	Вес = 0;
	Объем = 0;
	Для Каждого СтрокаТаблицы Из Содержимое Цикл
		
		Если Не СтрокаТаблицы.ОсобыеУсловияПеревозки Тогда
			СтрокаТаблицы.ОсобыеУсловияПеревозкиОписание = "";
		КонецЕсли;
		
		Если СтрокаТаблицы.Отменено Тогда
			Продолжить;
		КонецЕсли;
		
		Вес = Вес + СтрокаТаблицы.Вес;
		Объем = Объем + СтрокаТаблицы.Объем;
		
	КонецЦикла;
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ЭтоНовый = ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента.ЭтоНовый; // Булево
	СтатусРейсаЗакрываетОрдера =
		(Статус = Перечисления.СтатусыРейсов.Отправлен
			Или Статус = Перечисления.СтатусыРейсов.Завершен);
	
	Если Не Отказ
		И СтатусРейсаЗакрываетОрдера
		И Не ЭтоНовый Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РасходныйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдер
		|ГДЕ
		|	РасходныйОрдер.ЗаданиеНаПеревозку = &Рейс
		|	И РасходныйОрдер.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтгрузке)
		|	И РасходныйОрдер.Проведен
		|	И РасходныйОрдер.ОтгрузкаПоЗаданиюНаПеревозку";
		Запрос.УстановитьПараметр("Рейс", Ссылка);
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			
			СкладыСервер.ЗапускВыполненияФоновогоПереводаСтатусаРасходногоОрдераВОтгружено(Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьНачальнуюСтрокуМаршрута() Экспорт
	
	Если НЕ ЗначениеЗаполнено(СкладОтправления) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Пункт", СкладОтправления);
	Отбор.Вставить("ТочкаДоставки", ТочкаОтправления);
	Отбор.Вставить("Операция", Перечисления.ОперацииРейсов.Погрузка);
	Строки = Маршрут.НайтиСтроки(Отбор);
	
	Если Строки.Количество() > 0 Тогда
		
		СтрокаНачалаМаршрута = Строки[0];
		ИндексСтроки = Маршрут.Индекс(СтрокаНачалаМаршрута);
		Если ИндексСтроки > 0 Тогда
			Маршрут.Сдвинуть(СтрокаНачалаМаршрута, -1 * ИндексСтроки);
		КонецЕсли;
		
	Иначе
		
		СтрокаНачалаМаршрута = Маршрут.Вставить(0);
		СтрокаНачалаМаршрута.Пункт = СкладОтправления;
		СтрокаНачалаМаршрута.ТочкаДоставки = ТочкаОтправления;
		СтрокаНачалаМаршрута.Операция = Перечисления.ОперацииРейсов.Погрузка;
		СтрокаНачалаМаршрута.КлючСвязи = Новый УникальныйИдентификатор();
		СтрокаНачалаМаршрута.ЗонаДоставки = ЗонаОтправления;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьНеактуальныеСтрокиСодержимого() Экспорт
	
	ИмяКолонки = "КлючСвязи";
	
	ВременнаяТаблица = Содержимое.Выгрузить(, ИмяКолонки);
	ВременнаяТаблица.Свернуть(ИмяКолонки);
	КлючиСвязиСодержимое = ВременнаяТаблица.ВыгрузитьКолонку(ИмяКолонки);
	
	ВременнаяТаблица = Маршрут.Выгрузить(, ИмяКолонки);
	ВременнаяТаблица.Свернуть(ИмяКолонки);
	КлючиСвязиМаршрут = ВременнаяТаблица.ВыгрузитьКолонку(ИмяКолонки);
	
	НеактуальныеКлючиСвязи = ОбщегоНазначенияКлиентСервер.РазностьМассивов(КлючиСвязиСодержимое, КлючиСвязиМаршрут); // Массив Из УникальныйИдентификатор
	ОтборСтрок = Новый Структура("КлючСвязи", Новый УникальныйИдентификатор());
	
	Для Каждого КлючСвязи Из НеактуальныеКлючиСвязи Цикл
		
		ОтборСтрок.КлючСвязи = КлючСвязи;
		СтрокиПоКлючу = Содержимое.НайтиСтроки(ОтборСтрок);
		Для Каждого СтрокаТаблицы Из СтрокиПоКлючу Цикл
			Содержимое.Удалить(СтрокаТаблицы);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент()
	
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Статус = Перечисления.СтатусыРейсов.Подготовлен;
	Приоритет = ЗначениеНастроекПовтИсп.ПолучитьПриоритетПоУмолчанию(Приоритет);
	ЗаполненыДанныеТочкиОтправителя = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ТочкаОтправления) Тогда
		
		ДанныеТочкиОтправителя = Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(СкладОтправления);
		ТочкаОтправления = ДанныеТочкиОтправителя.ТочкаДоставки;
		ЗонаОтправления = ДанныеТочкиОтправителя.ЗонаДоставки;
		ЗаполненыДанныеТочкиОтправителя = Истина;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗонаОтправления)
	   И ЗначениеЗаполнено(ТочкаОтправления)
	   И НЕ ЗаполненыДанныеТочкиОтправителя Тогда
		
		РеквизитыТочкиОтправления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТочкаОтправления, "ЗонаДоставки");
		ЗонаОтправления = РеквизитыТочкиОтправления.ЗонаДоставки;
		
	КонецЕсли;
	
	ДобавитьНачальнуюСтрокуМаршрута();
	
КонецПроцедуры

Процедура ПроверкаЗаполненияМаршрута(МассивНепроверяемыхРеквизитов, Отказ)
	
	ИмяТЧ = Метаданные().ТабличныеЧасти.Маршрут.Имя;
	СинонимТЧ = Метаданные().ТабличныеЧасти.Маршрут.Синоним;
	
	ПараметрыПроверки = ПараметрыПроверкиТаблицы();
	ПараметрыПроверки.НачальныйИндексСтроки = 1;
	ПараметрыПроверки.ИмяТабличнойЧасти = ИмяТЧ;
	ПараметрыПроверки.ШаблонОшибки = НСтр("ru = 'Не заполнена колонка ""[СинонимКолонки]"" в строке [НомерСтроки] списка ""[СинонимТабличнойЧасти]""'");
	ПроверитьЗаполнениеКолонокТабличнойЧасти(Маршрут, ПараметрыПроверки, МассивНепроверяемыхРеквизитов, Отказ);
	
	КлючевыеКолонки = Новый Массив; // Массив Из Строка
	КлючевыеКолонки.Добавить("Пункт");
	КлючевыеКолонки.Добавить("ТочкаДоставки");
	КлючевыеКолонки.Добавить("Операция");
	ОбщегоНазначенияУТ.ПроверитьНаличиеДублейСтрокТЧ(ЭтотОбъект, ИмяТЧ, КлючевыеКолонки, Отказ, СинонимТЧ);
	
	Если СпособДоставки = Перечисления.СпособыДоставки25.СиламиПеревозчика
		И НЕ Перевозчик.Пустая() Тогда
		
		ШаблонСообщения = НСтр("ru = 'Совпадают данные получателя и перевозчика (%1), оформление доставки невозможно.'");
		ПредставлениеПеревозчика = Строка(Перевозчик);
		
		Для Каждого СтрокаМаршрута Из Маршрут Цикл
			
			Если СтрокаМаршрута.Отменено Тогда
				Продолжить;
			КонецЕсли;
			
			Если Перевозчик = СтрокаМаршрута.Пункт Тогда
				
				НомерСтроки = Формат(СтрокаМаршрута.НомерСтроки, "ЧГ=");
				ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"Маршрут", СтрокаМаршрута.НомерСтроки, "Пункт");
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонСообщения,
					ПредставлениеПеревозчика,
					НомерСтроки);
				
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКПолю,, Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыПроверкиТаблицы()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИмяТабличнойЧасти", "");
	Результат.Вставить("ШаблонОшибки", "");
	Результат.Вставить("ИмяТабличнойЧастиПути", "");
	Результат.Вставить("ИмяКолонкиПути", "");
	Результат.Вставить("НомерСтрокиПути", 0);
	Результат.Вставить("НачальныйИндексСтроки", 0);
	Результат.Вставить("ПропускатьОтмененныеСтроки", Ложь);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьЗаполнениеКолонокТабличнойЧасти(Таблица, ПараметрыПроверки, МассивНепроверяемыхРеквизитов, Отказ)
	
	ИмяТабличнойЧасти = ПараметрыПроверки.ИмяТабличнойЧасти;
	СинонимТабличнойЧасти = Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Синоним;
	Если ЗначениеЗаполнено(ПараметрыПроверки.ИмяТабличнойЧастиПути) Тогда
		ИмяТабличнойЧастиПути = ПараметрыПроверки.ИмяТабличнойЧастиПути;
	Иначе
		ИмяТабличнойЧастиПути = ИмяТабличнойЧасти;
	КонецЕсли;
	
	ПроверяемыеКолонки = Новый Соответствие;
	Для Каждого Реквизит Из Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты Цикл
		
		Если Реквизит.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
			
			ПроверяемыеКолонки.Вставить(Реквизит.Имя, Реквизит.Синоним);
			МассивНепроверяемыхРеквизитов.Добавить(ИмяТабличнойЧасти + "." + Реквизит.Имя);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("СинонимКолонки", "");
	ПараметрыСообщения.Вставить("НомерСтроки", "");
	ПараметрыСообщения.Вставить("СинонимТабличнойЧасти", СинонимТабличнойЧасти);
	
	Для ИндексСтроки = ПараметрыПроверки.НачальныйИндексСтроки По Таблица.Количество() - 1 Цикл
		
		СтрокаТаблицы = Таблица.Получить(ИндексСтроки);
		Если ПараметрыПроверки.ПропускатьОтмененныеСтроки
			И СтрокаТаблицы.Отменено Тогда
			
			Продолжить;
			
		КонецЕсли;
		ПараметрыСообщения.НомерСтроки = Строка(СтрокаТаблицы.НомерСтроки);
		
		Если ЗначениеЗаполнено(ПараметрыПроверки.НомерСтрокиПути) Тогда
			НомерСтрокиПути = ПараметрыПроверки.НомерСтрокиПути;
		Иначе
			НомерСтрокиПути = СтрокаТаблицы.НомерСтроки;
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из ПроверяемыеКолонки Цикл
			
			ИмяКолонки = КлючИЗначение.Ключ; // Строка
			ПараметрыСообщения.СинонимКолонки = КлючИЗначение.Значение; // Строка
			
			Если ЗначениеЗаполнено(ПараметрыПроверки.ИмяКолонкиПути) Тогда
				ИмяКолонкиПути = ПараметрыПроверки.ИмяКолонкиПути;
			Иначе
				ИмяКолонкиПути = ИмяКолонки;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[ИмяКолонки]) Тогда
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
					ПараметрыПроверки.ШаблонОшибки, ПараметрыСообщения);
				Путь = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					ИмяТабличнойЧастиПути, НомерСтрокиПути, ИмяКолонкиПути);
				
				ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки, ЭтотОбъект, Путь,, Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаЗаполненияСодержимого(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов, Отказ)
	
	ИмяТЧМаршрут = Метаданные().ТабличныеЧасти.Маршрут.Имя;
	ИмяТЧСодержимое = Метаданные().ТабличныеЧасти.Содержимое.Имя;
	ИмяКолонкиСостав = "Состав";
	
	МассивНепроверяемыхРеквизитов.Добавить(ИмяТЧСодержимое);
	
	ШаблонОшибкаЗаполненияПричиныОтмены = НСтр("ru = 'Не заполнена причина отмены в строке %1 содержимого по строке маршрута %2'");
	ШаблонОшибкиНетСодержимого = НСтр("ru = 'Не заполнено содержимое в строке %1 маршрута'");
	ШаблонОшибкаКоличества = НСтр("ru = 'Не заполнена колонка ""%1"" в строке %2 содержимого по строке маршрута %3'");
	ШаблонОшибкаПересчета = НСтр("ru = 'Обнаружено нулевое количество при пересчете в единицу хранения в строке %1 содержимого по строке маршрута %2'");
	ПредставлениеРеквизитаКоличествоУпаковок = Метаданные().ТабличныеЧасти.Содержимое.Реквизиты.КоличествоУпаковок.Синоним;
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("КлючСвязи", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	ПараметрыПроверкиОкругления = НоменклатураСервер.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверкиОкругления.ИмяТЧ = Метаданные().ТабличныеЧасти.Содержимое.Имя;
	ПараметрыПроверкиОкругления.УсловиеОтбораСтрокДляОкругления = "Содержимое.КлючСвязи = &КлючСвязи";
	
	Для ИндексСтрокиМаршрута = 1 По Маршрут.Количество() - 1 Цикл
		
		СтрокаМаршрута = Маршрут.Получить(ИндексСтрокиМаршрута);
		НомерСтрокиМаршрутаТекстом = Формат(СтрокаМаршрута.НомерСтроки, "ЧГ=;");
		
		ОтборСтрок.КлючСвязи = СтрокаМаршрута.КлючСвязи;
		СодержимоеПоСтрокеМаршрута = Содержимое.Выгрузить(ОтборСтрок);
		Если СодержимоеПоСтрокеМаршрута.Количество() = 0 Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонОшибкиНетСодержимого, НомерСтрокиМаршрутаТекстом);
			Путь = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧМаршрут, СтрокаМаршрута.НомерСтроки, ИмяКолонкиСостав);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, Путь,, Отказ);
			
			Продолжить;
			
		КонецЕсли;
		
		КоличествоСтрок = СодержимоеПоСтрокеМаршрута.Количество() - 1;
		Для ИндексСтрокиСодержимого = 0 По КоличествоСтрок Цикл
			СодержимоеПоСтрокеМаршрута[ИндексСтрокиСодержимого].НомерСтроки = ИндексСтрокиСодержимого + 1;
		КонецЦикла;
		
		ПараметрыПроверки = ПараметрыПроверкиТаблицы();
		ПараметрыПроверки.ИмяТабличнойЧасти = ИмяТЧСодержимое;
		ПараметрыПроверки.ШаблонОшибки = НСтр("ru = 'Не заполнена колонка ""[СинонимКолонки]"" в строке [НомерСтроки] содержимого по строке маршрута %1'");
		ПараметрыПроверки.ШаблонОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ПараметрыПроверки.ШаблонОшибки,
			НомерСтрокиМаршрутаТекстом);
		ПараметрыПроверки.ИмяТабличнойЧастиПути = ИмяТЧМаршрут;
		ПараметрыПроверки.ИмяКолонкиПути = ИмяКолонкиСостав;
		ПараметрыПроверки.НомерСтрокиПути = СтрокаМаршрута.НомерСтроки;
		ПараметрыПроверки.ПропускатьОтмененныеСтроки = Истина;
		
		ПроверитьЗаполнениеКолонокТабличнойЧасти(
			СодержимоеПоСтрокеМаршрута,
			ПараметрыПроверки,
			МассивНепроверяемыхРеквизитов,
			Отказ);
		
		Для Каждого СтрокаСодержимого Из СодержимоеПоСтрокеМаршрута Цикл
			
			НомерСтрокиСодержимогоТекстом = Строка(СтрокаСодержимого.НомерСтроки);
			Путь = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧМаршрут, СтрокаМаршрута.НомерСтроки, ИмяКолонкиСостав);
			
			Если СтрокаСодержимого.Отменено Тогда
				
				Если СтрокаСодержимого.ПричинаОтмены.Пустая() Тогда
					
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ШаблонОшибкаЗаполненияПричиныОтмены,
						НомерСтрокиСодержимогоТекстом,
						НомерСтрокиМаршрутаТекстом);
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, Путь,, Отказ);
					
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			Если СтрокаСодержимого.КоличествоУпаковок = 0 Тогда
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонОшибкаКоличества,
					ПредставлениеРеквизитаКоличествоУпаковок,
					НомерСтрокиСодержимогоТекстом,
					НомерСтрокиМаршрутаТекстом);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, Путь,, Отказ);
				
			КонецЕсли;
			
			Если СтрокаСодержимого.Количество = 0
				И СтрокаСодержимого.КоличествоУпаковок <> 0 Тогда
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонОшибкаПересчета, НомерСтрокиСодержимогоТекстом, НомерСтрокиМаршрутаТекстом);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, Путь,, Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыПроверкиОкругления.ПредставлениеТЧ = НСтр("ru = 'строка %1 маршрута'");
		ПараметрыПроверкиОкругления.ПредставлениеТЧ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ПараметрыПроверкиОкругления.ПредставлениеТЧ,
			НомерСтрокиМаршрутаТекстом);
		
		ПараметрыПроверкиОкругления.ПараметрыЗапроса.Вставить("КлючСвязи", СтрокаМаршрута.КлючСвязи);
		ПараметрыПроверкиОкругления.ПутьКДанным = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			ИмяТЧМаршрут, СтрокаМаршрута.НомерСтроки, ИмяКолонкиСостав);
		
		НоменклатураСервер.ПроверитьОкруглениеКоличества(ЭтотОбъект, Отказ, ПараметрыПроверкиОкругления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОкруглитьВремяВыездаИДоставки()
	
	ВремяВыезда = НачалоМинуты(ВремяВыезда);
	
	НачалоСуток = '00010101000001';
	
	Для Каждого СтрокаМаршрута Из Маршрут Цикл
		
		Если СтрокаМаршрута.ВремяДоставкиС <> НачалоСуток Тогда
			
			СтрокаМаршрута.ВремяДоставкиС = НачалоМинуты(СтрокаМаршрута.ВремяДоставкиС);
			
		КонецЕсли;
		
		Если СтрокаМаршрута.ВремяДоставкиПо <> НачалоСуток Тогда
			
			СтрокаМаршрута.ВремяДоставкиПо = НачалоМинуты(СтрокаМаршрута.ВремяДоставкиПо);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли