////////////////////////////////////////////////////////////////////////////////
// ОПИСПНИЕ ПЕРЕМЕННЫХ

// Кэш

// BSLLS:UnusedLocalVariable-off
&НаКлиенте
Перем
_Платформа, // Интерфейс модуля Платформа
_ЯдроКлиент, // Интерфейс модуля Ядро
_Стд, // Интерфейс модуля Клиент Стд
_МодульСМВ, // Интерфейс модуля СВМ
_ОтпечатокКэш; // Используется для хранения переменной в контексте

// Кэш серверный

&НаСервере
Перем              
_Ядро, // Интерфейс модуля Ядро
_ОбработкаОбъект, // Интерфейс модуля обработки
_БиблиотекаКартинок, // Интерфейс модуля БиблиотекаКартинок
_МодульАвторизацияКэш; // Интерфейс Модуля Авториации
// BSLLS:UnusedLocalVariable-on

////////////////////////////////////////////////////////////////////////////////
// ОбработчикиСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	// BSLLS:UnusedLocalVariable-off
	Опции = Модуль_ЯдроНаСервере().ОбщийКонтекст_Прочитать("ФункциональныеОпции");
	ПутьКФормам = ОбработкаОбъект().Метаданные().ПолноеИмя() + ".Форма.";
	Заголовок = "Авторизация: Пользователи";
	// BSLLS:UnusedLocalVariable-off
	ОбновитьСписокПользователейНаСервере();
	ОбновитьОтборПользователь();
	
	УстановитьУсловноеОформление();	
	УстановитьСтатичныеИзображения();
	СкрытьПодчиненныеЭлементы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// BSLLS:UnusedLocalVariable-off
	ЕстьПолучитьСтрокиДляОбработки = Стд().Стр().ВерсияПлатформыБольшеИлиРавна("8.5.1");
	// BSLLS:UnusedLocalVariable-on
	ПодключитьОбработчикОжидания("ОтложенноеОткрытие", Интервал01(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если УбратьПроверкиПередЗакрытием Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "";
	
	Если ТаблицаПользователи.Количество() = 0 Тогда
		ИмяОповещения = "_ПослеВопросаДобавитьПользователя";
		ТекстВопроса = "Не выбран пользователь для работы в модуле. Хотите добавить пользователя?";
		ЗаписатьМетрикуПроверкаНастроек("СписокПользователейПуст");
	КонецЕсли;
	
	Если ТекстВопроса = "" И Не ПроверитьНастройкиОрганизацииВыбраны() Тогда
		ИмяОповещения = "_ПослеВопросаДобавитьОрганизацию";
		ТекстВопроса = "Не выбрано ни одной организации для работы в модуле? Хотите выбрать организацию?";
		ЗаписатьМетрикуПроверкаНастроек("СписокОрганизацийПуст");
	КонецЕсли;
	
	Если ТекстВопроса <> "" Тогда
		Отказ = Истина;
		Оповещение = Стд().ОбщегоНазначения().ОписаниеОповещения(ИмяОповещения, ЭтаФорма);
		Стд().Диалоги().ПоказатьВопросЛок(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
	Если Модифицированность И Отказ = Ложь Тогда
		Отказ = Истина;
		Текст = "Вы уверены, что хотите закрыть форму? Внесенные изменения не будут сохранены.";
		Оповещение = Стд().ОбщегоНазначения().ОписаниеОповещения("_ПослеВопросаМодифицированностьЗакрытие", ЭтаФорма);
		Стд().Диалоги().ПоказатьВопросЛок(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СлужебнынйПрограммныйИнтерфейс

&НаКлиенте
Процедура _ПослеПолученияСессии(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВызватьИсключение "Не удалось авторизоваться";
	КонецЕсли;
	
	ОбновитьСписокПользователейНаСервере();
	ОбновитьОтборПользователь();
	ПерейтиСписокПользователей();
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("СхемаАутентификации", Результат.СхемаАутентификации);
	Переменные.Вставить("UserId", Результат.Пользователь.Идентификатор);
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику(
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().СоздатьСессию, 
		"Авторизоваться", 
		Переменные, 
		ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура _ПослеПоказатьОшибкуНевалидныйКлючАПИ(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(
		"КлючАпиНеДействителен", 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().НекорректныйКлючАпи, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().СкачатьОбновлениеМодуля, 
		"Нажатие кнопки");
	
	ВладелецФормы.ОсновнаяФорма().ОткрытьФормуОбновления();
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику_СУчетомЗаполненияКонтекста(
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().НекорректныйКлючАпи, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().СкачатьОбновлениеМодуля);
	
КонецПроцедуры

&НаКлиенте
Процедура _ПослеВопросаЗавершитьСессии(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущееКоличество = ТаблицаПользователи.Количество();
	
	ЗавершитьРаботуВыделенныхПользователейНаСервере();
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("КоличествоПользователей", Строка(ТекущееКоличество - ТаблицаПользователи.Количество()));
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику(
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация,
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().УдалитьПользователя,
		"ЗавершитьРаботуПользователя ",
		Переменные,
		ИмяФормы,
		Модуль_ЯдроНаКлиенте().TraceId());
	
КонецПроцедуры

&НаКлиенте
Процедура _ПослеВопросаЗавершитьСессию(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	ЗавершитьРаботуПользователяНаСервере(ДопПараметры.ДанныеСтроки.ПолучитьИдентификатор());
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("КоличествоПользователей", "1");
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику(
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация,
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().УдалитьПользователя,
		"ЗавершитьРаботу ",
		Переменные,
		ИмяФормы,
		Модуль_ЯдроНаКлиенте().TraceId());
		
КонецПроцедуры

&НаКлиенте
Процедура _ПослеВопросаДобавитьПользователя(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:UnusedLocalVariable-off
	УбратьПроверкиПередЗакрытием = Истина;  
	// BSLLS:UnusedLocalVariable-on
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура _ПослеВопросаДобавитьОрганизацию(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:UnusedLocalVariable-off
	УбратьПроверкиПередЗакрытием = Истина;  
	// BSLLS:UnusedLocalVariable-on
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура _ПослеВыбораСертификатаПодписание(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:UnusedLocalVariable-off
	Модифицированность = Истина;
	// BSLLS:UnusedLocalVariable-on
	СтрокаТаблицы = ТаблицаОрганизацийТекущаяСтрока();
	
	СтрокаТаблицы.СертификатОтпечаток = Результат.Отпечаток;
	СтрокаТаблицы.СертификатПодписи = Результат.Представление;
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().ВыборСертификатаДляПодписи, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().Сохранить, 
		"НажатиеКнопки",
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().TraceId());
		
КонецПроцедуры

&НаКлиенте
Процедура _АвторизацияПослеВыбораСертификата(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:UnusedLocalVariable-off
	_ОтпечатокКэш = Результат.Отпечаток;
	// BSLLS:UnusedLocalVariable-on
	
	// Вызывать через обработчик ожидания, нужно чтобы отработало ПоказатьПредупреждение
	ПодключитьОбработчикОжидания("_ПродолжитьАутентификациюПоСертификату", Интервал01(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура _ПослеВопросаМодифицированностьЗакрытие(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:UnusedLocalVariable-off
	УбратьПроверкиПередЗакрытием = Истина;  
	// BSLLS:UnusedLocalVariable-on
	Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ДекорацияНужнаПомощьНажатие(Элемент)
	
	Платформа().ЦентрПоддержки_Открыть("", ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПользовательПредставлениеПриИзменении(Элемент)
	
	ОтборПользовательЗначение = ОтборПользовательПредставление;
	Если ЗначениеЗаполнено(ОтборПользовательПредставление) Тогда
		ОтборПользовательПредставление = Элемент.СписокВыбора.НайтиПоЗначению(ОтборПользовательЗначение).Представление;
	КонецЕсли;
	
	УстановитьОтборОрганизаций();
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация, 
		"ФильтрПользователь", 
		"НажатиеКнопки",
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().TraceId());

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборОрганизаций()

	Отбор = Новый Структура;
	
	Если ЗначениеЗаполнено(ОтборПользовательЗначение) Тогда
		Отбор.Вставить("ПользовательИд", ОтборПользовательЗначение);
	КонецЕсли;	
	
	Если Отбор.Количество() = 0 Тогда                                                
		Элементы.ТаблицаОрганизаций.ОтборСтрок = Неопределено;
	Иначе
		Элементы.ТаблицаОрганизаций.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОрганизацийПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Или Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаОрганизацийПользовательПредставление" Тогда
		ЗаполнитьСписокВыбораПользователями(
			Элементы.ТаблицаОрганизацийПользовательПредставление.СписокВыбора, 
			Элемент.ТекущиеДанные.Пользователи);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОрганизацийПользовательПредставлениеПриИзменении(Элемент)

	// BSLLS:UnusedLocalVariable-off
	Модифицированность = Истина;
	// BSLLS:UnusedLocalVariable-on

	СтрокаТаблицы = ТаблицаОрганизацийТекущаяСтрока();
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ПользовательПредставление) Тогда
		
		Отбор = Новый Структура("Ид");
		Отбор.Ид = СтрокаТаблицы.ПользовательПредставление;
		НайденныеСтроки = ТаблицаПользователи.НайтиСтроки(Отбор);
		
		Для Каждого Элемент Из НайденныеСтроки Цикл
			Представление = Модуль_ЯдроНаКлиенте()._СтдСтр().СтрШаблонЛок("%1 (%2)", Элемент.Пользователь, Элемент.Почта);
			СтрокаТаблицы.ПользовательИд = Элемент.Ид;
			СтрокаТаблицы.ПользовательПредставление = Представление;
		КонецЦикла;
		
		Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(
			ИмяФормы, 
			Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация, 
			Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().ВыборПользователя, 
			"НажатиеКнопки",
			ИмяФормы, 
			Модуль_ЯдроНаКлиенте().TraceId());
		
	Иначе
		
		СтрокаТаблицы.ПользовательИд = "";
		СтрокаТаблицы.ПользовательПредставление = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОрганизацийСертификатПодписиОчистка(Элемент, СтандартнаяОбработка)
	
	ОбработатьОчисткаСертификата();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОрганизацийСертификатПодписиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораСертификата();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;	
	ТребуетсяАвторизация = Поле.Имя = "ТаблицаПользователиСостояние" И ТекущиеДанные.Состояние = "Войти";
	
	Если ТребуетсяАвторизация И ТекущиеДанные.СпособВхода = "Логин" Тогда
		ТекстОшибки = "Авторизация по логину больше не поддерживается. 
		|Завершите текущую сессию, и авторизуйтесь через браузер%1.";
		Если ИспользоватьАутентификациюПоСертификату() Тогда
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", " или по сертификату");
		Иначе
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", "");
		КонецЕсли;
		Стд().Диалоги().ПоказатьПредупреждениеЛок(, ТекстОшибки);
	ИначеЕсли ТребуетсяАвторизация Тогда
		ОбновитьУстаревшуюАвторизацию(Элемент.ТекущиеДанные);                                                          
	ИначеЕсли Поле.Имя = "ТаблицаПользователиСостояние" И ТекущиеДанные.Состояние = "Завершить работу" Тогда
		ЗавершитьРаботуПользователяНаКлиенте(ТекущиеДанные);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьПользователяПароль(Команда)
	
	ВызватьИсключение "Не реализованно";
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователяПортал(Команда)
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().ДобавитьПользователя, 
		"Портал",
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().TraceId());
		
	АутентификацияНаПортале();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователяСертификат(Команда)

	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().ДобавитьПользователя, 
		"Сертификат",
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().TraceId());
		
	АутентификацияПоСертификату();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСессию(Команда)
	
	Оповещение = Стд().ОбщегоНазначения().ОписаниеОповещения("_ПослеВопросаЗавершитьСессии", ЭтаФорма);
	ТекстВопроса = "Вы точно хотите завершить сеанс? 
		|Список доступных организаций обновится с учетом оставшихся пользователей.";
	
	Стд().Диалоги().ПоказатьВопросЛок(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиОрганизации(Команда)
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация, 
		"КСпискуОрганизаций", 
		"НажатиеКнопки",
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().TraceId());
		
	ПоказатьСтраницуДлительнаяОперация("Получаем список организаций");
	
	// BSLLS:UnusedLocalVariable-off
	Заголовок = "Авторизация: Доступные организации";
	// BSLLS:UnusedLocalVariable-on
	ПодключитьОбработчикОжидания("ПерейтиСписокОрганизаций", Интервал01(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПользователи(Команда)
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация, 
		"КСпискуПользователей", 
		"НажатиеКнопки",
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().TraceId());
		
	ПерейтиСписокПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриступитьКРаботе(Команда)
	
	Если Не НастройкиЗаполнены() Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:UnusedLocalVariable-off
	УбратьПроверкиПередЗакрытием = Истина;
	// BSLLS:UnusedLocalVariable-on
	ОбновитьСписокСертификатов();
	СохранитьНеАктивныеНастройки();
	Настройки = НастройкиАвторизации(Истина);
	
	ЗаписатьМетрикуСтатистикиНастроек();
	Закрыть(Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеОрганизации(Команда)

	// BSLLS:UnusedLocalVariable-off
	Модифицированность = Истина;
	// BSLLS:UnusedLocalVariable-on
	ОтборЗаполнен = ЗначениеЗаполнено(ОтборПользовательЗначение);
	
	Для Каждого Элемент Из ТаблицаОрганизаций Цикл
		Если ОтборЗаполнен И Элемент.ПользовательИд <> ОтборПользовательЗначение Тогда
			Продолжить;
		КонецЕсли;
		Элемент.Использовать = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьОтметкуВсехОрганизаций(Команда)
	
	// BSLLS:UnusedLocalVariable-off
	Модифицированность = Истина;
	// BSLLS:UnusedLocalVariable-on
	ОтборЗаполнен = ЗначениеЗаполнено(ОтборПользовательЗначение); 
	
	Для Каждого Элемент Из ТаблицаОрганизаций Цикл
		Если ОтборЗаполнен И Элемент.ПользовательИд <> ОтборПользовательЗначение Тогда
			Продолжить;
		КонецЕсли;
		Элемент.Использовать = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЗАВИСИМОСТИ

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()

	Если _ЯдроКлиент = Неопределено Тогда
		_ЯдроКлиент = Платформа().Модуль_ЯдроНаКлиенте();
	КонецЕсли;
	
	Возврат _ЯдроКлиент;
	
КонецФункции

&НаКлиенте
Функция Платформа() Экспорт
	
	Если _Платформа = Неопределено Тогда
		_Платформа = ВладелецФормы.Модуль_Платформа();
	КонецЕсли;
	
	Возврат _Платформа;
	
КонецФункции

&НаКлиенте
Функция Стд()

	Если _Стд = Неопределено Тогда
		_Стд = Модуль_ЯдроНаКлиенте()._Стд();
	КонецЕсли;
	
	Возврат _Стд;
	
КонецФункции

&НаКлиенте
Функция СМВ()
	
	Если _МодульСМВ = Неопределено Тогда
		
		// BSLLS:GetFormMethod-off
		_МодульСМВ = ПолучитьФорму(ПутьКФормам + "Модуль_СинхронныеМодальныеВызовы", , ЭтаФорма);
		// BSLLS:GetFormMethod-on
		
	КонецЕсли;
	
	Возврат _МодульСМВ;
	
КонецФункции

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()

	Если _Ядро = Неопределено Тогда
		_Ядро = ОбработкаОбъект().Модуль_Ядро();
	КонецЕсли;
	
	Возврат _Ядро;
	
КонецФункции

&НаСервере
Функция БиблиотекаКартинок()
	
	Если _БиблиотекаКартинок = Неопределено Тогда
		_БиблиотекаКартинок = ОбработкаОбъект().БиблиотекаКартинок();
	КонецЕсли;
	
	Возврат _БиблиотекаКартинок;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕЧИСЛЕНИЯ

// Типы авторизации

&НаКлиентеНаСервереБезКонтекста
Функция ТипАвторизацииПортал()
	Возврат "Портал";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипАвторизацииПароль()
	Возврат "Пароль";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипАвторизацииСертификат()
	Возврат "Сертификат";
КонецФункции

// Виды ошибок

&НаКлиентеНаСервереБезКонтекста
Функция ОшибкаНеверныйКлючАПИ()
	Возврат "InvalidAPIKey";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОшибкаНеверныйЛогинПароль()
	Возврат "InvalidLoginOrPassword";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОшибкаСертификатНеАвторизован()
	Возврат "CertIsNotAuthorized";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОшибкаКриптоПользовательНеВвелПинкод()
	Возврат "CRYPTOAPI[0x8010006E]";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОшибкаНеизвестная()
	Возврат "НеизвестнаяОшибка";
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// АУТЕНТИФИКАЦИЯ

&НаКлиенте
Процедура АутентификацияНаПортале()

	Оповещение = Платформа().НовыйОписаниеОповещения("_ПослеПолученияСессии", ЭтаФорма);
	
	Попытка

		Платформа().Авторизация_НачатьПолучениеСессииЧерезБраузерV2(Оповещение);
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОбработатьОшибкуАвторизации(ИнформацияОбОшибке, ТипАвторизацииПортал());

	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура АутентификацияПоСертификату()
	
	Оповещение = Стд().ОбщегоНазначения().ОписаниеОповещения("_АвторизацияПослеВыбораСертификата", ЭтаФорма);
	
	ФормаСертификатов = Платформа().ПолучитьФормуОбработки("ВыборСертификатаУправляемая", ЭтаФорма);
	ФормаСертификатов.ОткрытьЭтуФорму(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботуПользователяНаКлиенте(ДанныеСтроки)

	ДопПараметры = Новый Структура("ДанныеСтроки");
	ДопПараметры.ДанныеСтроки = ДанныеСтроки;
	
	Оповещение = Стд().ОбщегоНазначения().ОписаниеОповещения("_ПослеВопросаЗавершитьСессию", ЭтаФорма, ДопПараметры);
	
	ТекстВопроса = "Вы точно хотите завершить этот сеанс? 
	|Список доступных организаций обновится с учетом оставшихся пользователей.";
	Стд().Диалоги().ПоказатьВопросЛок(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьРаботуВыделенныхПользователейНаСервере()
	
	ОбновитьСписокОрганизацийНаСервере();
	МассивПользователей = Новый Массив;
	ВыделенныеСтроки = ВыделенныеСтрокиЭлементаТаблицы(Элементы.ТаблицаПользователи);
	
	Для Каждого Ид Из ВыделенныеСтроки Цикл
		
		СтрокаПользователя = ТаблицаПользователи.НайтиПоИдентификатору(Ид);
		
		НастройкиОрганизаций = ТаблицаОрганизаций.НайтиСтроки(Новый Структура("ПользовательИд", СтрокаПользователя.Ид));
		Организации = Новый Массив;
		Для Каждого Настройка Из НастройкиОрганизаций Цикл
			Организации.Добавить(Настройка.БоксИд);		
		КонецЦикла;
		
		Элемент = Новый Структура("Ид, Сессия, Организации");
		Элемент.Ид = СтрокаПользователя.Ид;
		Элемент.Сессия = СтрокаПользователя.Сессия;
		Элемент.Организации = Организации;		
		
		МассивПользователей.Добавить(Элемент);		
		
	КонецЦикла;
	
	Модуль_ЯдроНаСервере().НастройкиАвторизации().ЗавершитьРаботуПользователейЛок(МассивПользователей);		
	ОбновитьСпискиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьРаботуПользователяНаСервере(Ид)
	
	ОбновитьСписокОрганизацийНаСервере();
	МассивПользователей = Новый Массив;
	
	СтрокаПользователя = ТаблицаПользователи.НайтиПоИдентификатору(Ид);
	
	НастройкиОрганизаций = ТаблицаОрганизаций.НайтиСтроки(Новый Структура("ПользовательИд", СтрокаПользователя.Ид));
	Организации = Новый Массив;
	Для Каждого Настройка Из НастройкиОрганизаций Цикл
		Организации.Добавить(Настройка.БоксИд);		
	КонецЦикла;
	
	Элемент = Новый Структура("Ид, Сессия, Организации");
	Элемент.Ид = СтрокаПользователя.Ид;
	Элемент.Сессия = СтрокаПользователя.Сессия;
	Элемент.Организации = Организации;		
	
	МассивПользователей.Добавить(Элемент);		
	
	Модуль_ЯдроНаСервере().НастройкиАвторизации().ЗавершитьРаботуПользователейЛок(МассивПользователей);
	ОбновитьСпискиНаСервере();	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ

&НаКлиенте
Процедура ЗаписатьМетрикуСтатистикиНастроек()
	
	БоксИд = Новый Массив;
	Портал = ТаблицаПользователи.НайтиСтроки(Новый Структура("СпособВхода", "Портал")).Количество();
	Сертификат = ТаблицаПользователи.НайтиСтроки(Новый Структура("СпособВхода", "Сертификат")).Количество();
	Неизвестный = ТаблицаПользователи.Количество() - (Сертификат + Портал);
	
	УникальныеСертификаты = Новый Массив;
	Для Каждого Элемент Из ТаблицаОрганизаций Цикл
		
		Если ЗначениеЗаполнено(Элемент.СертификатОтпечаток) 
			И УникальныеСертификаты.Найти(Элемент.СертификатОтпечаток) = Неопределено Тогда
			УникальныеСертификаты.Добавить(Элемент.СертификатОтпечаток);
		КонецЕсли;
		Если Элемент.Использовать Тогда
			БоксИд.Добавить(Модуль_ЯдроНаКлиенте().АдресЯщикаВИдентификатор(Элемент.БоксИд));
		КонецЕсли;
		
	КонецЦикла;
	
	Отбор = Новый Структура("Использовать");
	Отбор.Использовать = Истина;           
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("КоличествоОрганизаций", ТаблицаОрганизаций.НайтиСтроки(Отбор).Количество());
	Переменные.Вставить("КоличествоСертификатов", УникальныеСертификаты.Количество());
	Переменные.Вставить("КоличествоПользователей", ТаблицаПользователи.Количество());
	Переменные.Вставить("BoxId", БоксИд);
	
	Если Портал > 0 Тогда
		Переменные.Вставить("oidc/device_flow", Портал);
	КонецЕсли;
	Если Сертификат > 0 Тогда
		Переменные.Вставить("dd_auth/certificate", Сертификат);
	КонецЕсли;
	Если Неизвестный > 0 Тогда
		Переменные.Вставить("dd_auth/unknown", Неизвестный);
	КонецЕсли;
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику(
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация,
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().ПриступитьКРаботе,
		,
		Переменные,
		,
		Модуль_ЯдроНаКлиенте().TraceId());
		
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаписатьМетрикуПроверкаНастроек(Метка)

	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику(
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация,
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().ОткрытиеФормыОшибки,
		Метка,
		,
		,
		Модуль_ЯдроНаКлиенте().TraceId());
		
КонецПроцедуры

&НаКлиенте
Процедура _ПродолжитьАутентификациюПоСертификату()

	Если _ОтпечатокКэш = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		// BSLLS:UnusedLocalVariable-off
		Сессия = Платформа().Авторизация_СессияПоСертификату(_ОтпечатокКэш);
		// BSLLS:UnusedLocalVariable-on
		ОбновитьСпискиНаСервере();
		ПерейтиСписокПользователей();
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОбработатьОшибкуАвторизации(ИнформацияОбОшибке, ТипАвторизацииСертификат());
				
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуДлительнаяОперация(ТекстУведомления = "")

	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
	Элементы.ДекорацияТекстДлительнойОперации.Заголовок = ТекстУведомления;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиСписокОрганизаций()
	
	ОбновитьСписокОрганизацийНаСервере();
	
	Если ТаблицаОрганизаций.Количество() = 0 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНетОрганизаций;
		Если ТаблицаПользователи.Количество() > 0 Тогда
			Элементы.Декорация3.Заголовок = "У вас нет доступа ни в одну организацию";
			Элементы.Декорация4.Заголовок = "Попробуйте войти в веб-версию Диадока или выберите другого пользователя";
		КонецЕсли;
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОрганизации;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиСписокПользователей()
	
	// BSLLS:UnusedLocalVariable-off
	Заголовок = "Авторизация: Пользователи";
	// BSLLS:UnusedLocalVariable-on
	
	Если ТаблицаПользователи.Количество() > 0 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПользователи;
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНетПользователей;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложенноеОткрытие()
	
	ПерейтиСписокПользователей();
	
	Отбор = Новый Структура("СессияЖива");
	Отбор.СессияЖива = Ложь;
	
	КоличествоПротухшихТокенов = ТаблицаПользователи.НайтиСтроки(Отбор).Количество();
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("КоличествоПротухшихТокенов", КоличествоПротухшихТокенов);
	
	УстановитьПризнакОткрытияНовойФормыАвторизацииНаСервере();
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику(
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация,
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().ОткрытиеФормы,
		"FormAuthV2",
		Переменные,
		,
		Модуль_ЯдроНаКлиенте().TraceId());
		
	Справка_ПоказатьНоваяФормаАвторизации();
		
КонецПроцедуры

&НаКлиенте
Процедура Справка_ПоказатьНоваяФормаАвторизации()
	
	Если Не НастройкиПользователяПрочитать_НеПоказыватьОнбордингНоваяФормаАвторизациинаСервере() Тогда
		Платформа().ПоказатьСправкаНоваяФормаАвторизации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуНевалидныйКлючАПИ()
	
	ДопПараметры = Новый Структура;
	Оповещение = Платформа().НовыйОписаниеОповещения("_ПослеПоказатьОшибкуНевалидныйКлючАПИ", ЭтаФорма, ДопПараметры);
	
	ТекстОшибки = НСтр(
		"ru = 'Версия модуля устарела. Требуется обновление.
		|Для продолжения работы скачайте и установите новую
		|версию по кнопке ниже.'"
	);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.ОК, "Скачать обновление модуля");
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Закрыть");
	
	Стд().Диалоги().ПоказатьВопросЛок(Оповещение, ТекстОшибки, Кнопки, 0, КодВозвратаДиалога.ОК, "");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуСертификатНеАвторизован()

	ТекстОшибки = 
	"По этому сертификату нет доступа в Диадок:
	|Попробуйте авторизоваться в веб-версии, следуя подсказкам сервиса.
	|Если авторизация в веб-версии не помогла, обратитесь в поддержку.";
	
	Стд().Диалоги().ПоказатьПредупреждениеЛок(, ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуКриптоПользовательНеВвелПинкод()
	
	ТекстОшибки = 
	"Ошибка доступа к контейнеру сертификата:
	|Необходимо ввести PIN-код.";
	
	Стд().Диалоги().ПоказатьПредупреждениеЛок(, ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОчисткаСертификата()
	
	СтрокаТаблицы = ТаблицаОрганизацийТекущаяСтрока();
	СтрокаТаблицы.СертификатОтпечаток = "";
	СтрокаТаблицы.СертификатПодписи = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокСертификатов()
	
	ТаблицаСертификатов.Очистить();	
	
	Попытка
		
		Сертификаты = Модуль_ЯдроНаКлиенте().Сертификаты_СписокСертификатов();
		
	Исключение
		
		Сертификаты = Новый Массив;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ДопПеременные = Новый Соответствие;
		ДопПеременные.Вставить("Идентификатор ошибки", "НетДоступаКСертификатам");
		
		Модуль_ЯдроНаКлиенте().Метрика_ДобавитьОшибку_СУчетомЗаполненияКонтекста(
			Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация, 
			Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().ОткрытиеФормы, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке), 
			ДопПеременные);
			
	КонецПопытки;
	
	Для Каждого Сертификат Из Сертификаты Цикл
		
		НоваяСтрока = ТаблицаСертификатов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Сертификат);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОшибкуАвторизации(ИнформацияОбОшибке, ТипАвторизации)
	
	Контекст = Новый Соответствие;
	Контекст.Вставить("ТипАвторизации", ТипАвторизации);
	
	Если ЯвляетсяОшибкойКатегории(ИнформацияОбОшибке, ОшибкаНеверныйКлючАПИ()) Тогда
		
		Контекст.Вставить(ИдентификаторОшибки(), "НекорректныйКлючАпи");
		ОбработатьОшибкуПолученияСессииВызовСервера(ИнформацияОбОшибке, Контекст);
		
		ПоказатьОшибкуНевалидныйКлючАПИ();
		
	ИначеЕсли ЯвляетсяОшибкойКатегории(ИнформацияОбОшибке, ОшибкаСертификатНеАвторизован()) Тогда
		
		Контекст.Вставить(ИдентификаторОшибки(), "НетДоступа");
		ОбработатьОшибкуПолученияСессииВызовСервера(ИнформацияОбОшибке, Контекст);
		
		ПоказатьОшибкуСертификатНеАвторизован();
		
	ИначеЕсли ЯвляетсяОшибкойКатегории(ИнформацияОбОшибке, ОшибкаКриптоПользовательНеВвелПинкод()) Тогда
		
		// BSLLS:Typo-off
		Контекст.Вставить(ИдентификаторОшибки(), "ПользовательОтказалсяОтВводаПинкода");
		// BSLLS:Typo-on
		ОбработатьОшибкуПолученияСессииВызовСервера(ИнформацияОбОшибке, Контекст);
		
		ПоказатьОшибкуКриптоПользовательНеВвелПинкод();
		
	Иначе
		
		Контекст.Вставить(ИдентификаторОшибки(), "НеизвестнаяОшибка");
		ОбработатьОшибкуПолученияСессииВызовСервера(ИнформацияОбОшибке, Контекст);
		
		ВызватьИсключение ИнформацияОбОшибке.Описание;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСертификата()
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_ДействиеСФормой(
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().ВыборСертификатаДляПодписи,  
		Истина, 
		"НажатиеКнопки",
		, 
		Модуль_ЯдроНаКлиенте().TraceId());
		
	Если ЗначениеЗаполнено(Элементы.ТаблицаОрганизаций.ТекущиеДанные.ПользовательИд) = Ложь Тогда
		Стд().Диалоги().ПоказатьПредупреждениеЛок(, "Выберите пользователя.");
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаПользователи.НайтиСтроки(
		Новый Структура("Ид", Элементы.ТаблицаОрганизаций.ТекущиеДанные.ПользовательИд));
	Если НайденныеСтроки.Количество() = 0 Тогда
		ВызватьИсключение "Не удалось получить сессию пользователя";
	КонецЕсли;
			
	СервисныеСертификаты = СервисныеСертификатыНаСервере(
		Элементы.ТаблицаОрганизаций.ТекущиеДанные.БоксИд, НайденныеСтроки[0].Сессия);
		
	Отбор = Новый Массив;
	Для Каждого Элемент Из СервисныеСертификаты Цикл
		Отбор.Добавить(Элемент.Отпечаток);
	КонецЦикла;
	
	ФиксированныйОтбор = Новый ФиксированныйМассив(Отбор);
	ПараметрыФормы = Новый Структура("ОтборСертификатов", ФиксированныйОтбор);
	
	Оповещение = Стд().ОбщегоНазначения().ОписаниеОповещения("_ПослеВыбораСертификатаПодписание", ЭтаФорма);
			
	ФормаСертификатов = Платформа().ПолучитьФормуОбработки("ВыборСертификатаУправляемая", ЭтаФорма, ПараметрыФормы);
	ФормаСертификатов.ОткрытьЭтуФорму(Оповещение);
                
КонецПроцедуры

&НаКлиенте
Функция ТаблицаОрганизацийТекущаяСтрока()
	
	Возврат ТаблицаОрганизаций.НайтиПоИдентификатору(
		Элементы.ТаблицаОрганизаций.ТекущиеДанные.ПолучитьИдентификатор());
		
КонецФункции

// BSLLS:TooManyReturns-off
// BSLLS:TooManyReturns-off
// Производит проверку заполнения настроек
// Возвращаемое значение:
//	Булево - Истина, если все заполнено корректно
//
&НаКлиенте
Функция НастройкиЗаполнены()
	
	Если Не ПроверитьНастройкиОрганизацииВыбраны() Тогда
		Стд().Диалоги().ПоказатьПредупреждениеЛок(, "Не выбрано ни одной организации для работы.");
		ЗаписатьМетрикуПроверкаНастроек("НеВыбранаОрганизация");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПроверитьНастройкиЗаполнениеПользователей() Тогда
		Стд().Диалоги().ПоказатьПредупреждениеЛок(, 
			"Выберите пользователей для всех организаций, с которыми планируете работать.");
		ЗаписатьМетрикуПроверкаНастроек("НеВыбранПользователь");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПроверитьНастройкиСертификатов() Тогда
		Стд().Диалоги().ПоказатьПредупреждениеЛок(, 
			"Не выбран сертификат для всех организаций, с которыми планируете работать.");
		ЗаписатьМетрикуПроверкаНастроек("ОтсутствуетСертификат ");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПроверитьНастройкиТарифы() Тогда
		Стд().Диалоги().ПоказатьПредупреждениеЛок(, "Одновременное использование разных тарифных планов невозможно.
		|Выберите организации, которые используют один тарифный план.");
		ЗаписатьМетрикуПроверкаНастроек("ВыбраныОрганизацииСРазнымиТарифами");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
// BSLLS:TooManyReturns-on

&НаКлиенте
Функция ПроверитьНастройкиОрганизацииВыбраны()
	
	Отбор = Новый Структура("Использовать");
	Отбор.Использовать = Истина;
	
	Возврат ТаблицаОрганизаций.НайтиСтроки(Отбор).Количество() > 0;
	
КонецФункции

&НаКлиенте
Функция ПроверитьНастройкиСертификатов()
	
	НастройкаССертификатом = 0;
	НастройкаБезСертификата = 0;

	Для Каждого Элемент Из ТаблицаОрганизаций Цикл
		Если Элемент.Использовать = Истина И ЗначениеЗаполнено(Элемент.СертификатОтпечаток) Тогда
			НастройкаССертификатом = НастройкаССертификатом + 1;
		КонецЕсли;
		Если Элемент.Использовать = Истина И ЗначениеЗаполнено(Элемент.СертификатОтпечаток) = Ложь Тогда
			НастройкаБезСертификата = НастройкаБезСертификата + 1;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат НастройкаССертификатом > 0 И НастройкаБезСертификата = 0
		Или НастройкаССертификатом = 0 И НастройкаБезСертификата > 0;
	
КонецФункции

&НаКлиенте
Функция ПроверитьНастройкиЗаполнениеПользователей()
	
	Для Каждого Элемент Из ТаблицаОрганизаций Цикл
		Если Элемент.Использовать = Истина И Не ЗначениеЗаполнено(Элемент.ПользовательИд) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПроверитьНастройкиТарифы()
	
	Отбор = Новый Структура("Использовать, ТарифСтартовый");
	Отбор.Использовать = Истина;
	
	Отбор.ТарифСтартовый = Истина;
	ТарифСтартовый = ТаблицаОрганизаций.НайтиСтроки(Отбор).Количество() > 0;
	
	Отбор.ТарифСтартовый = Ложь;
	ТарифПолный = ТаблицаОрганизаций.НайтиСтроки(Отбор).Количество() > 0;
	
	Возврат Не ТарифСтартовый = ТарифПолный;
	
КонецФункции

&НаКлиенте
Процедура СохранитьНеАктивныеНастройки()

	Настройки = НастройкиАвторизации(Ложь);
	СохранитьНеАктивныеНастройкиНаСервере(Настройки);
	
КонецПроцедуры

&НаКлиенте
Функция НастройкиАвторизации(Активные)

	Данные = Новый Массив;
	
	Для Каждого НастройкаОрганизации Из ТаблицаОрганизаций Цикл
		
		Если Не НастройкаОрганизации.Использовать = Активные Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаПользователи.НайтиСтроки(Новый Структура("Ид", НастройкаОрганизации.ПользовательИд));
		Для Каждого Элемент Из НайденныеСтроки Цикл
			
			Настройки = Новый Структура;
			Настройки.Вставить("Ид");
			Настройки.Вставить("Сертификат");
			Настройки.Вставить("БоксИд");
			Настройки.Вставить("Сессия");
			
			Настройки.Ид = НастройкаОрганизации.БоксИд;
			Настройки.Сертификат = НайтиСертификат(НастройкаОрганизации.СертификатОтпечаток);
			Настройки.БоксИд = НастройкаОрганизации.БоксИд;
			Настройки.Сессия = Элемент.Сессия;
			
			Данные.Добавить(Настройки);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СформироватьНастройкиНаСервере(Данные);
	
КонецФункции

&НаКлиенте
Функция НайтиСертификат(Отпечаток)
	
	Если ЗначениеЗаполнено(Отпечаток) = Ложь Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаСертификатов.НайтиСтроки(Новый Структура("ОтпечатокСертификата", Отпечаток));
	
	Результат = Неопределено;
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Результат = Модуль_ЯдроНаКлиенте().Сертификаты_Контракт_ОписаниеСертификата();
		ЗаполнитьЗначенияСвойств(Результат, НайденныеСтроки[0]);
		
		Результат.Вставить("Base64", Модуль_ЯдроНаКлиенте().Сертификаты_СертификатВBase64(Отпечаток));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЯвляетсяОшибкойКатегории(Знач Ошибка, Знач Категория)
	
	Если Категория = ОшибкаСертификатНеАвторизован() Тогда
		Результат = ЭтоОшибкаСертификатНеАвторизован(Ошибка);
	ИначеЕсли Категория = ОшибкаНеверныйКлючАПИ() Тогда
		Результат = ЭтоОшибкаНеверныйКлючАПИ(Ошибка);
	ИначеЕсли Категория = ОшибкаНеверныйЛогинПароль() Тогда
		Результат = ЭтоОшибкаНеверныйЛогинПароль(Ошибка);
	ИначеЕсли Категория = ОшибкаКриптоПользовательНеВвелПинкод() Тогда
		Результат = ЭтоОшибкаКриптоПользовательНеВвелПинкод(Ошибка);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Функция ЭтоОшибкаСертификатНеАвторизован(Знач Ошибка)
	
	ТекстОшибки = НРег(ПодробноеПредставлениеОшибки(Ошибка));
	
	// HTTP-ответ с ошибкой вида "401 Certificate with thumbprint <ОТПЕЧАТОК> is not authorized"
	Результат = Стд().Стр().СтрНайтиЛок(ТекстОшибки, "401") 
		И Стд().Стр().СтрНайтиЛок(ТекстОшибки, "certificate with thumbprint") 
		И Стд().Стр().СтрНайтиЛок(ТекстОшибки, "is not authorized");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоОшибкаНеверныйКлючАПИ(Знач Ошибка)
	
	ТекстОшибки = НРег(ПодробноеПредставлениеОшибки(Ошибка));
	
	Результат = Стд().Стр().СтрНайтиЛок(ТекстОшибки, "invalid api client id") > 0;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоОшибкаНеверныйЛогинПароль(Знач Ошибка)
	
	ТекстОшибки = НРег(ПодробноеПредставлениеОшибки(Ошибка));
	
	// HTTP-ответ с ошибкой вида "401 Wrong password provided for login <user@mail>"
	Результат = Стд().Стр().СтрНайтиЛок(ТекстОшибки, "401") 
		И Стд().Стр().СтрНайтиЛок(ТекстОшибки, "wrong password provided for login");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЭтоОшибкаКриптоПользовательНеВвелПинкод(Знач Ошибка)
	
	ТекстОшибки = НРег(ПодробноеПредставлениеОшибки(Ошибка));
	
	// Источник ошибки - библиотека CRYPTOAPI
	// Десятичный код ошибки - 2148532334
	// Шестнадцатиричный код ошибки - 0x8010006E
	Результат = Стд().Стр().СтрНайтиЛок(ТекстОшибки, НРег("CRYPTOAPI[0x8010006E]")) > 0;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьУстаревшуюАвторизацию(ТекущиеДанные)
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().Авторизация, 
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().ВыполнитьАвторизацию, 
		ТекущиеДанные.СпособВхода,
		ИмяФормы, 
		Модуль_ЯдроНаКлиенте().TraceId());
	
	Если ТекущиеДанные.СпособВхода = "Портал" Тогда
		АутентификацияНаПортале();
	ИначеЕсли ТекущиеДанные.СпособВхода = "Сертификат" Тогда
		Если ТекущиеДанные.Сессия = Неопределено Тогда
			АутентификацияПоСертификату();
		Иначе
			// BSLLS:UnusedLocalVariable-off
			_ОтпечатокКэш = ТекущиеДанные.Сессия.Ключ;
			// BSLLS:UnusedLocalVariable-on
			_ПродолжитьАутентификациюПоСертификату();         
		КонецЕсли;
	Иначе
		ВызватьИсключение "Не ожидаемый способ входа";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораПользователями(СписокВыбора, Пользователи)
	
	СписокВыбора.Очистить();
	
	Для Каждого Ид Из Пользователи Цикл
		НайденныеСтроки = ТаблицаПользователи.НайтиСтроки(Новый Структура("Ид", Ид));
		Для Каждого Строка Из НайденныеСтроки Цикл
			Если Строка.СессияЖива = Ложь Тогда
				Продолжить;
			КонецЕсли;
			Представление = Модуль_ЯдроНаКлиенте()._СтдСтр().СтрШаблонЛок("%1 (%2)", Строка.Пользователь, Строка.Почта);
			СписокВыбора.Добавить(Строка.Ид, Представление, Ложь);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиНаСервере()
	
	ОбновитьСписокПользователейНаСервере();
	ОбновитьОтборПользователь();
	ОбновитьСписокОрганизацийНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПользователейНаСервере()
	
	ТаблицаПользователи.Загрузить(Модуль_ЯдроНаСервере().НастройкиАвторизации().АвторизованныеПользователи());
	ТаблицаПользователи.Сортировать("СессияЖива Возр, Пользователь Возр");
	
	Для Каждого Элемент Из ТаблицаПользователи Цикл
		Если Элемент.СессияЖива = Истина Тогда
			Элемент.Состояние = "Завершить работу";	
			Элемент.СостояниеКартинка = 1;	
		Иначе
			Элемент.Состояние = "Войти";
			Элемент.СостояниеКартинка = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборПользователь()

	Элементы.ОтборПользовательПредставление.СписокВыбора.Очистить();
	
	Для Каждого Строка Из ТаблицаПользователи Цикл
		Если Строка.СессияЖива = Ложь Тогда
			Продолжить;
		КонецЕсли;
		Представление = Модуль_ЯдроНаСервере().СтдСтр().СтрШаблонЛок("%1 (%2)", Строка.Пользователь, Строка.Почта);
		Элементы.ОтборПользовательПредставление.СписокВыбора.Добавить(Строка.Ид, Представление, Ложь);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокОрганизацийНаСервере()
		
	УчетныеЗаписи = Новый Массив;
	Для Каждого Строка Из ТаблицаПользователи Цикл
		УчетнаяЗапись = Новый Структура("Ид, Сессия");
		УчетнаяЗапись.Ид = Строка.Ид;
		УчетнаяЗапись.Сессия = Строка.Сессия;
		УчетныеЗаписи.Добавить(УчетнаяЗапись);
	КонецЦикла;
	
	ТаблицаОрганизаций.Загрузить(Модуль_ЯдроНаСервере().НастройкиАвторизации().НастройкиОрганизаций(УчетныеЗаписи));
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОшибкуПолученияСессииВызовСервера(Знач ИнформацияОбОшибке, Знач ДопПеременные)
	
	Модуль_ЯдроНаСервере().НастройкиАвторизации().ОбработатьОшибкуПолученияСессииВызовСервера(
		ИнформацияОбОшибке, ДопПеременные);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатичныеИзображения()

	Элементы.ДобавитьПользователя.Картинка = Элементы.КартинкаДобавить.Картинка;
	Элементы.ДобавитьПользователя1.Картинка = Элементы.КартинкаДобавить.Картинка;
	Элементы.ДобавитьПользователяСертификат.Картинка = Элементы.КартинкаДобавить.Картинка;
	Элементы.ДобавитьПользователяПароль.Картинка = Элементы.КартинкаДобавить.Картинка;
	Элементы.ДобавитьПользователяПортал.Картинка = Элементы.КартинкаДобавить.Картинка;	
	Элементы.ДобавитьПользователяСертификат1.Картинка = Элементы.КартинкаДобавить.Картинка;
	Элементы.ДобавитьПользователяПароль1.Картинка = Элементы.КартинкаДобавить.Картинка;
	Элементы.ДобавитьПользователяПортал1.Картинка = Элементы.КартинкаДобавить.Картинка;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// BSLLS:UnusedLocalVariable-off
	КартинкаПредупреждение = 
		ПоместитьВоВременноеХранилище(БиблиотекаКартинок().КартинкаБольшоеПредупреждениеБезФона, УникальныйИдентификатор);
	КартинкаДлительнаяОперация 
		= ПоместитьВоВременноеХранилище(БиблиотекаКартинок().КартинкаДлительнаяОперация, УникальныйИдентификатор);
	// BSLLS:UnusedLocalVariable-on		
		
	УстановитьВидимостьКомандВхода();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКомандВхода()
	
	ПоказатьВсеВариантыВхода = ИспользоватьАутентификациюПоСертификату();
	
	Элементы.ГруппаКомандаДобавитьПользователей.Видимость = ПоказатьВсеВариантыВхода;
	Элементы.ГруппаКомандаДобавитьПользователя.Видимость = Не ПоказатьВсеВариантыВхода;
	
	Элементы.ГруппаПользователиКомандыДобавитьПользователей.Видимость = ПоказатьВсеВариантыВхода;
	Элементы.ГруппаПользователиКомандыДобавитьПользователя.Видимость = Не ПоказатьВсеВариантыВхода;
	
	Если ПоказатьВсеВариантыВхода Тогда
		
		Элементы.ДобавитьПользователя1.Видимость = ИспользоватьАутентификациюЧерезПортал();
		Элементы.ДобавитьПользователяСертификат.Видимость = ИспользоватьАутентификациюПоСертификату();
		Элементы.ДобавитьПользователяПароль.Видимость = Ложь;
		
		Элементы.ДобавитьПользователяПортал1.Видимость = ИспользоватьАутентификациюЧерезПортал();
		Элементы.ДобавитьПользователяСертификат1.Видимость = ИспользоватьАутентификациюПоСертификату();
		Элементы.ДобавитьПользователяПароль1.Видимость = Ложь;
		
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Процедура СохранитьНеАктивныеНастройкиНаСервере(Настройки)

	Модуль_ЯдроНаСервере().НастройкиАвторизации().СохранитьНеАктивныеНастройкиОрганизаций(Настройки);
	
КонецПроцедуры

&НаСервере
Функция ИспользоватьАутентификациюЧерезПортал()

	Возврат Модуль_ЯдроНаСервере().НастройкиАвторизации().ИспользоватьАутентификациюЧерезПортал(Опции);
	
КонецФункции

&НаСервере
Функция ИспользоватьАутентификациюПоСертификату()

	Возврат Модуль_ЯдроНаСервере().НастройкиАвторизации().ИспользоватьАутентификациюПоСертификату(Опции);
	
КонецФункции

&НаСервере
Функция СервисныеСертификатыНаСервере(БоксИд, Сессия)
	
	Возврат Модуль_ЯдроНаСервере().Пользователи_МоиСертификаты(БоксИд, Сессия);
		
КонецФункции

&НаСервере
Процедура СкрытьПодчиненныеЭлементы()
	
	Для Каждого Элемент Из Элементы.ГруппаОрганизацииКПВерхПраво.ПодчиненныеЭлементы Цикл
		Если Элемент.Имя = "ТаблицаОрганизацийНайти" Тогда
			Продолжить;
		КонецЕсли;
		Элемент.Видимость = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакОткрытияНовойФормыАвторизацииНаСервере()
	
	ОбработкаОбъект = ОбработкаОбъект();
	ОбработкаОбъект.УстановитьПризнакОткрытаНовойФормыАвторизации();
	
КонецПроцедуры

&НаСервере
Функция ВыделенныеСтрокиЭлементаТаблицы(Таблица)

	Если ЕстьПолучитьСтрокиДляОбработки Тогда
		Результат = Таблица.ПолучитьСтрокиДляОбработки();
	Иначе           
		Результат = Таблица.ВыделенныеСтроки;
	КонецЕсли;      
	
	Возврат Результат;
		
КонецФункции

&НаСервере
Функция СформироватьНастройкиНаСервере(Данные)

	Результат = Новый Соответствие;
	
	Для Каждого Элемент Из Данные Цикл
		Настройка = Модуль_ЯдроНаСервере().СоздатьСтрокуКонтекстаСеанса(Элемент.БоксИд, Элемент.Сессия, Элемент.Сертификат);
		Результат.Вставить(Элемент.Ид, Настройка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НастройкиПользователяПрочитать_НеПоказыватьОнбордингНоваяФормаАвторизацииНаСервере()

	Возврат ОбработкаОбъект().НастройкиПользователяПрочитать_НеПоказыватьОнбордингНоваяФормаАвторизации();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторОшибки()
	
	Возврат "ИдентификаторОшибки";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Интервал01()
	
	Возврат 0.1;
	
КонецФункции