
&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ТекстЗапроса = СписокДокументыПродажи.ТекстЗапроса;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование КАК Реализация,
	               |	МАКСИМУМ(ТранспортнаяНакладнаяДокументыОснования.Ссылка) КАК ТТН
	               |ПОМЕСТИТЬ ВТТранспортныеНакладные
	               |ИЗ
	               |	Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	               |ГДЕ
	               |	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
				   |	И ТранспортнаяНакладнаяДокументыОснования.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование" + ОбщегоНазначения.РазделительПакетаЗапросов() + ТекстЗапроса;
	
	ТекстЗамены = "{ГДЕ";
	
	ТекстВставки = "	ЛЕВОЕ СОЕДИНЕНИЕ ВТТранспортныеНакладные КАК ВТТранспортныеНакладные
					|	ПО РеестрДокументов.Ссылка = ВТТранспортныеНакладные.Реализация
					|";
					
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстЗамены, ТекстВставки + ТекстЗамены);
				   
	ТекстЗамены = "ИЗ
					|	РегистрСведений.РеестрДокументов КАК РеестрДокументов";
	
	ТекстВставки = "	,ЕСТЬNULL(ВТТранспортныеНакладные.ТТН, """") КАК ТТН
					|";
					
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстЗамены, ТекстВставки + ТекстЗамены);
	
	СписокДокументыПродажи.ТекстЗапроса = ТекстЗапроса;
	
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "СписокДокументыПродажиТТН", "СписокДокументыПродажи", "ТТН", 1, "СписокДокументыПродажи.ТТН");
	
КонецПроцедуры
