#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		КартинкаСканирования = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "КартинкаСканированияКодаМаркировки");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриСозданииЧтенииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(КартинкаСканирования) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(КартинкаСканирования);
		
		ТекущийОбъект.КартинкаСканированияКодаМаркировки = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КартинкаСканированияНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыДобавленияКартинки = Новый Структура;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ДобавлениеКартинкиСканированияЗавершение", ЭтотОбъект, ПараметрыДобавленияКартинки);
	
	ФильтрВыборФайла = НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
			+ "|Все файлы(*.*)|*.*"
			+ "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
			+ "|Формат GIF(*.gif*)|*.gif"
			+ "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
			+ "|Формат PNG(*.png*)|*.png"
			+ "|Формат TIFF(*.tif)|*.tif"
			+ "|Формат icon(*.ico)|*.ico"
			+ "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'");
			
	ПараметрыВыбораФайла = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ПараметрыВыбораФайла.Заголовок          = НСтр("ru = 'Выбор файла'");
	ПараметрыВыбораФайла.Фильтр             = ФильтрВыборФайла;
	ПараметрыВыбораФайла.МножественныйВыбор = Ложь;
	
	НачатьПомещениеФайлаНаСервер(ОповещениеОЗавершении,,,,ПараметрыВыбораФайла, УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

//@skip-check module-empty-method
&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеКартинкиСканированияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Не Результат.ПомещениеФайлаОтменено Тогда
		КартинкаСканирования = Результат.Адрес;
		Модифицированность   = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти