#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ЭлементыКонструктораВидовПродукцииИС" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ДоступностьНастроек = ТекущиеДанные <> Неопределено И Не ТекущиеДанные.ЭтоГруппа;
	
	Элементы.СписокКонтекстноеМенюНастроитьЭлемент.Доступность           = ДоступностьНастроек;
	Элементы.СписокКонтекстноеМенюНастроитьДоступныеЗначения.Доступность = ДоступностьНастроек;
	Элементы.СписокКонтекстноеМенюНастроитьМестаПрименения.Доступность   = ДоступностьНастроек;
	Элементы.СписокКонтекстноеМенюНастроитьДоступныеЗначенияПоМестамПрименения.Доступность = ДоступностьНастроек;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьКонструкторВидовПродукции(Команда)
	
	ОткрытьФорму("РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.Форма.КонструкторВидовПродукцииИС");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМестаПрименения(Команда)
	
	ОткрытьФорму("Справочник.МестаПримененияЭлементовКонструктораВидовПродукцииИС.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДоступныхЗначений(Команда)
	
	ОткрытьФорму("РегистрСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.Форма.НастройкаДоступныхЗначений");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлемент(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭлементКонструктора", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму(
		"РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.Форма.КонструкторВидовПродукцииИС",
		ПараметрыОткрытия,
		ЭтотОбъект,
		ПараметрыОткрытия.ЭлементКонструктора);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступныеЗначения(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭлементКонструктора", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму(
		"РегистрСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.Форма.НастройкаДоступныхЗначений",
		ПараметрыОткрытия,
		ЭтотОбъект,
		ПараметрыОткрытия.ЭлементКонструктора);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьМестаПрименения(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭлементКонструктора", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму(
		"РегистрСведений.МестаПримененияЭлементовКонструктораВидовПродукцииИС.Форма.НастройкаМестПрименения",
		ПараметрыОткрытия,
		ЭтотОбъект,
		ПараметрыОткрытия.ЭлементКонструктора);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступныеЗначенияПоМестамПрименения(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭлементКонструктора", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму(
		"РегистрСведений.ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС.Форма.НастройкаДоступныхЗначенийПоМестамПрименения",
		ПараметрыОткрытия,
		ЭтотОбъект,
		ПараметрыОткрытия.ЭлементКонструктора);
	
КонецПроцедуры

#КонецОбласти
