#Область ПрограммныйИнтерфейс

Процедура ОповеститьОЗавершении() Экспорт
	
	НовыхЗаписей = ОбменМобильныеАвтономныйСервер.ПринятоОтправленоНовыхЗаписей();
	Если НовыхЗаписей.Принято <> 0 ИЛИ НовыхЗаписей.Отправлено <> 0 Тогда
		ОповеститьОбИзменении(Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		ОповеститьОбИзменении(Тип("СправочникСсылка.Номенклатура"));
		ОбновитьИнтерфейс();
		ПоказатьОповещениеПользователя(НСтр("ru = 'Выполнена синхронизация'"), ,
			СтрШаблон(НСтр("ru = 'Принято объектов: %1. Отправлено объектов: %2.'"), НовыхЗаписей.Принято, НовыхЗаписей.Отправлено));
	КонецЕсли

КонецПроцедуры

#Если МобильныйКлиент Тогда

// Процедура запускает обмен данными с автономной конфигурацией
// и подключает обработчик ожидания для регулярного выполнения синхронизации
Процедура ВключитьОбмен() Экспорт
	
	Если ОбменМобильныеВызовПК.ТребуетсяОбменДаннымиСАвтономнымПриложением(ОбменМобильныеАвтономныйКлиент.ТекущийУзел()) Тогда
		Если ОсновнойСерверДоступен() = Истина Тогда
			ОбменМобильныеАвтономныйКлиент.НачатьОбмен();
		КонецЕсли;
		ПодключитьОбработчикОжидания("ПроверкаНеобходимостиСинхронизации", 10);
	КонецЕсли;
	
КонецПроцедуры

// Процедура отключает обработчик ожидания, выполняющий синхронизацию данных между основной конфигурацией и автономной
Процедура ОтключитьОбмен() Экспорт
	
	ОтключитьОбработчикОжидания("ПроверкаНеобходимостиСинхронизации");
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти