#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
#Область ЗагрузкаИзФайла

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
// 
// Параметры:
//  АдресЗагружаемыхДанных - Строка - адрес временного хранилища с таблицей значений, в которой
// находятся загруженные данные из файла.
//  АдресТаблицыСопоставления - Строка - адрес временного хранилища с пустой таблицей значений,
// являющейся копией табличной части документа,
// которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//  СписокНеоднозначностей - ТаблицаЗначений - состоит из:
// * Идентификатор - Число - идентификатор
// * Колонка - Строка - имя колонки
//  ПолноеИмяТабличнойЧасти - Строка - полное имя табличной части
//  ДополнительныеПараметры - Структура - дополнительные параметры, переданные из формы-источнике.
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей,
	ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт

	ТЗОбъектовЗакупки = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления); // ТаблицаЗначений
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных); // ТаблицаЗначений

	Для Каждого СтрокаЗагружаемых Из ЗагружаемыеДанные Цикл
		СтрокаТЧ = ТЗОбъектовЗакупки.Добавить();
		СтрокаТЧ.НаименованиеОбъектаЗакупки = СтрокаЗагружаемых.НаименованиеОбъектаЗакупки; // Строка

		СтрокаТЧ.ОбъектЗакупки = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.НайтиСоздатьОбъектЗакупки(
			СтрокаТЧ); // СправочникСсылка.КонтурЗакупки_ОбъектыЗакупки

		СтрокаТЧ.Номенклатура = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьНоменклатуруПоОбъектуЗакупки(
			ДополнительныеПараметры.МассивОрганизаторов, СтрокаТЧ.ОбъектЗакупки);
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			СтруктураДанныеНоменклатуры = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьДанныеНоменклатуры(
					СтрокаТЧ.Номенклатура);
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураДанныеНоменклатуры);
		КонецЕсли;

		Если Не ПустаяСтрока(СтрокаЗагружаемых.ГородЗаказчикаСтрокой) Тогда
			СтруктураГород = Новый Структура("Наименование", СокрЛП(СтрокаЗагружаемых.ГородЗаказчикаСтрокой));

			СтрокаТЧ.ГородЗаказчика = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.НайтиСоздатьСправочникПоНаименованию(
					"КонтурЗакупки_Города", СтруктураГород);
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаЗагружаемых);
	КонецЦикла;

	ПоместитьВоВременноеХранилище(ТЗОбъектовЗакупки, АдресТаблицыСопоставления);
КонецПроцедуры

// Переопределяет параметры загрузки данных из файла.
// 
// Параметры:
//  Параметры - Структура - :
// * ИмяМакетаСШаблоном - Строка - наименование макета. Например, "ЗагрузкаИзФайла".
// * ИмяТабличнойЧасти - Строка - Полное имя табличной части. Например,
//                                "Документ._ДемоСчетНаОплатуПокупателю.ТабличнаяЧасть.Товары".
// * ОбязательныеКолонки - Массив из Строка - наименования обязательных для заполнения колонок.
// * ТипДанныхКолонки - Соответствие из КлючИЗначение - 
// * Ключ - Строка - имя колонки;
// * Значение - ОписаниеТипов - тип колонки загружаемых данных.
// * ДополнительныеПараметры - Структура - 
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт

	ТипДанныхКолонки = Параметры.ТипДанныхКолонки; // Соответствие
	ТипДанныхКолонки.Вставить("НаименованиеОбъектаЗакупки",
		КонтурЗакупки_СлужебныеКлиентСервер.Новый_ОписаниеТиповСтрока(1024));
	ТипДанныхКолонки.Вставить("Количество", КонтурЗакупки_СлужебныеКлиентСервер.Новый_ОписаниеТиповЧисло(15, 2));
	ТипДанныхКолонки.Вставить("СтоимостьЗаЕдиницу", КонтурЗакупки_СлужебныеКлиентСервер.Новый_ОписаниеТиповЧисло(
			15, 2));
	ТипДанныхКолонки.Вставить("ОбщаяСтоимость", КонтурЗакупки_СлужебныеКлиентСервер.Новый_ОписаниеТиповЧисло(15, 2));

	МассивОбязательныхКолонок = Новый Массив; // Массив из Строка
	МассивОбязательныхКолонок.Добавить("НаименованиеОбъектаЗакупки");

	Параметры.ОбязательныеКолонки = МассивОбязательныхКолонок;

КонецПроцедуры

#КонецОбласти
#КонецОбласти

#Область ОбработчикиСобытий
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьОрганизатораИзТабличнойЧасти() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЗакупки_ОбработкаЗакупки.Ссылка КАК ОбрЗакупкиСсылка,
	|	КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики.ОрганизаторЗаказчик КАК ОрганизаторЗаказчик
	|ИЗ
	|	Документ.КонтурЗакупки_ОбработкаЗакупки КАК КонтурЗакупки_ОбработкаЗакупки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Ссылка,
	|			МАКСИМУМ(ОрганизаторЗаказчик) КАК ОрганизаторЗаказчик
	|		ИЗ
	|			Документ.КонтурЗакупки_ОбработкаЗакупки.ОрганизаторыЗаказчики
	|		СГРУППИРОВАТЬ ПО
	|			Ссылка) КАК КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики
	|		ПО КонтурЗакупки_ОбработкаЗакупкиОрганизаторыЗаказчики.Ссылка = КонтурЗакупки_ОбработкаЗакупки.Ссылка
	|ГДЕ
	|	КонтурЗакупки_ОбработкаЗакупки.Организатор = ЗНАЧЕНИЕ(Справочник.КонтурЗакупки_ОрганизаторыЗаказчики.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.ОбрЗакупкиСсылка.ПолучитьОбъект(); // ДокументОбъект.КонтурЗакупки_ОбработкаЗакупки
		ДокОбъект.Организатор = Выборка.ОрганизаторЗаказчик;
		ДокОбъект.Записать();
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция ПолучитьСтруктуруНаценки() Экспорт
	СтруктураНаценки = Новый Структура;
	СтруктураНаценки.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	СтруктураНаценки.Вставить("ГородПоставщика", Справочники.КонтурЗакупки_Города.ПустаяСсылка());
	СтруктураНаценки.Вставить("ОбъектЗакупки", Справочники.КонтурЗакупки_ОбъектыЗакупки.ПустаяСсылка());
	СтруктураНаценки.Вставить("ГруппировкаНаценки", "");
	СтруктураНаценки.Вставить("КолонкиГруппировкиНаценки", "");
	СтруктураНаценки.Вставить("ПредставлениеГруппировкиНаценки", "");
	СтруктураНаценки.Вставить("ГородЗаказчика", Справочники.КонтурЗакупки_Города.ПустаяСсылка());
	СтруктураНаценки.Вставить("ПроцентНаценки", 0);
	Возврат СтруктураНаценки;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - Структура - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
//@skip-check module-empty-method
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КонтурЗакупки_ОбработкаЗакупки_ПечатнаяФормаЗакупка";
	КомандаПечати.Представление = НСтр("ru = 'Закупка'");

КонецПроцедуры
	
// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив из ДокументСсылка    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений из ДокументСсылка - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
//@skip-check module-empty-method
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КонтурЗакупки_ОбработкаЗакупки_ПечатнаяФормаЗакупка");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"КонтурЗакупки_ОбработкаЗакупки_ПечатнаяФормаЗакупка",
			НСтр("ru = 'Закупка'"),
			СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.КонтурЗакупки_ОбработкаЗакупки.ПФ_Закупка");
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КонтурЗакупки_ОбработкаЗакупки_ПечатнаяФормаЗакупка"; 
	
	Первый = Истина;
	
	Для Каждого ОбъектМассива Из МассивОбъектов Цикл
		
		Если Первый Тогда
			Первый = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокОбъектаПечати = СформироватьПечатнуюФормуЗакупка(ОбъектМассива);
		ТабличныйДокумент.Вывести(ТабДокОбъектаПечати);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ТолькоПросмотр = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуЗакупка(СсылкаНаОбъектПечати)
	
	Макет = ПолучитьМакет("ПФ_Закупка");
	
	ДанныеДляПечати = ДанныеДляПечати(СсылкаНаОбъектПечати);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КонтурЗакупки_Закупка_ПечатнаяФорма"; 
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	//заполняем Области
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ДанныеДляПечати);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если ДанныеДляПечати.ОбъектыЗакупки.Количество() > 0 Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбъектыЗакупкиШапка");
		ОбластьМакета.Параметры.Заполнить(ДанныеДляПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбъектыЗакупки = ДанныеДляПечати.ОбъектыЗакупки;
		Для Каждого ОбъектЗакупки Из ОбъектыЗакупки Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("ОбъектыЗакупкиСтрока");
			ОбластьМакета.Параметры.Заполнить(ОбъектЗакупки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
	КонецЕсли;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ТолькоПросмотр = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуДополнительногоОбъектаПечати()

Функция ДанныеДляПечати(ОбработкаЗакупки)
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбработкаЗакупки.Номер КАК НомерОбработкиЗакупки,
		|	ОбработкаЗакупки.ДокументОснования.Номер КАК Номер,
		|	ОбработкаЗакупки.ДокументОснования.Дата КАК Дата,
		|	ОбработкаЗакупки.ДокументОснования.Проведен КАК Проведен,
		|	ОбработкаЗакупки.ДокументОснования.Валюта КАК Валюта,
		|	ОбработкаЗакупки.ДокументОснования.ДатаОкончанияПодачиЗаявок КАК ДатаОкончанияПодачиЗаявок,
		|	ОбработкаЗакупки.ДокументОснования.ДатаПодведенияИтогов КАК ДатаПодведенияИтогов,
		|	ОбработкаЗакупки.ДокументОснования.ДатаПоследнегоИзмененияЗакупки КАК ДатаПоследнегоИзмененияЗакупки,
		|	ОбработкаЗакупки.ДокументОснования.ДатаПроведенияАукциона КАК ДатаПроведенияАукциона,
		|	ОбработкаЗакупки.ДокументОснования.ДатаСозданияЗакупки КАК ДатаСозданияЗакупки,
		|	ОбработкаЗакупки.ДокументОснования.ИдентификаторЗакупки КАК ИдентификаторЗакупки,
		|	ОбработкаЗакупки.ДокументОснования.ИмяОписаниеЗакупки КАК ИмяОписаниеЗакупки,
		|	ОбработкаЗакупки.ДокументОснования.КонтактныеДанныеИмя КАК КонтактныеДанныеИмя,
		|	ОбработкаЗакупки.ДокументОснования.КонтактныеДанныеТелефон КАК КонтактныеДанныеТелефон,
		|	ОбработкаЗакупки.ДокументОснования.КонтактныеДанныеЭлектроннаяПочта КАК КонтактныеДанныеЭлектроннаяПочта,
		|	ОбработкаЗакупки.ДокументОснования.НМЦЗакупки КАК НМЦЗакупки,
		|	ОбработкаЗакупки.ДокументОснования.НомерЗакупки КАК НомерЗакупки,
		|	ОбработкаЗакупки.ДокументОснования.ОрганизаторИНН КАК ОрганизаторИНН,
		|	ОбработкаЗакупки.ДокументОснования.ОрганизаторКПП КАК ОрганизаторКПП,
		|	ОбработкаЗакупки.ДокументОснования.ОрганизаторНаименование КАК ОрганизаторНаименование,
		|	ОбработкаЗакупки.ДокументОснования.ПризнакЗакупкаДляСМП КАК ПризнакЗакупкаДляСМП,
		|	ОбработкаЗакупки.ДокументОснования.СпособОтбора КАК СпособОтбора,
		|	ОбработкаЗакупки.ДокументОснования.СсылкаНаЗакупкуНаЕИС КАК СсылкаНаЗакупкуНаЕИС,
		|	ОбработкаЗакупки.ДокументОснования.СсылкаНаЗакупкуНаКЗ КАК СсылкаНаЗакупкуНаКЗ,
		|	ОбработкаЗакупки.ДокументОснования.СсылкаНаЗакупкуНаЭТП КАК СсылкаНаЗакупкуНаЭТП,
		|	ОбработкаЗакупки.ДокументОснования.СтатусЗакупки КАК СтатусЗакупки,
		|	ОбработкаЗакупки.ДокументОснования.ТипЗакупки КАК ТипЗакупки,
		|	ОбработкаЗакупки.ДокументОснования.Комментарий КАК Комментарий,
		|	ОбработкаЗакупки.ДокументОснования.РучнойВвод КАК РучнойВвод,
		|	ОбработкаЗакупки.ОбъектыЗакупки.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ВЫБОР
		|			КОГДА ОбработкаЗакупки.ОбъектыЗакупки.Номенклатура.НаименованиеПолное <> """"
		|				ТОГДА ОбработкаЗакупки.ОбъектыЗакупки.Номенклатура.НаименованиеПолное
		|			ИНАЧЕ ОбработкаЗакупки.ОбъектыЗакупки.Номенклатура.Наименование
		|		КОНЕЦ КАК Номенклатура,
		|		ОКВЭД2Код КАК ОКВЭД2Код,
		|		ОКВЭД2Расшифровка КАК ОКВЭД2Расшифровка,
		|		ОКПД2Код КАК ОКПД2Код,
		|		ОКПД2Расшифровка КАК ОКПД2Расшифровка,
		|		КТРУКод КАК КТРУКод,
		|		КТРУРасшифровка КАК КТРУРасшифровка,
		|		Количество КАК Количество,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		СтоимостьЗаЕдиницуОбъекта КАК СтоимостьЗаЕдиницуОбъекта,
		|		ОбщаяСтоимостьОбъекта КАК ОбщаяСтоимостьОбъекта,
		|		НаименованиеОбъектаЗакупки КАК НаименованиеОбъектаЗакупки,
		|		ОбъектЗакупки КАК ОбъектЗакупки,
		|		Вес КАК Вес,
		|		Объем КАК Объем,
		|		Контрагент КАК Контрагент,
		|		ЦенаПоставщикаБезНДС КАК ЦенаПоставщикаБезНДС,
		|		ЦенаПоставщика КАК ЦенаПоставщика,
		|		КоличествоПоставщика КАК КоличествоПоставщика,
		|		СуммаПоставщика КАК СуммаПоставщика,
		|		Производитель КАК Производитель,
		|		Упаковка КАК Упаковка,
		|		СтавкаНДСПоставщика КАК СтавкаНДСПоставщика,
		|		СуммаНДСПоставщика КАК СуммаНДСПоставщика,
		|		СуммаПоставщикаБезНДС КАК СуммаПоставщикаБезНДС,
		|		ВесЕдиницы КАК ВесЕдиницы,
		|		ОбъемЕдиницы КАК ОбъемЕдиницы,
		|		ПроцентНаценки КАК ПроцентНаценки,
		|		СуммаНаценки КАК СуммаНаценки,
		|		СуммаПродажи КАК СуммаПродажи,
		|		СуммаЗатрат КАК СуммаЗатрат,
		|		СуммаПрибыли КАК СуммаПрибыли,
		|		ПроцентМаржи КАК ПроцентМаржи,
		|		ПозицияВыиграна КАК ПозицияВыиграна,
		|		ГородПоставщика КАК ГородПоставщика,
		|		СрокПодготовкиПродукцииУПоставщика КАК СрокПодготовкиПродукцииУПоставщика,
		|		ПредставлениеЗатрат КАК ПредставлениеЗатрат,
		|		ГородЗаказчика КАК ГородЗаказчика,
		|		СрокДоставкиДоЗаказчика КАК СрокДоставкиДоЗаказчика,
		|		НормативныйДокумент КАК НормативныйДокумент,
		|		ПроцентКоммерческихРасходов КАК ПроцентКоммерческихРасходов,
		|		СуммаКоммерческихРасходов КАК СуммаКоммерческихРасходов,
		|		ЦенаПродажиБезНДС КАК ЦенаПродажиБезНДС,
		|		ЦенаПродажи КАК ЦенаПродажи,
		|		СтавкаНДСПродажи КАК СтавкаНДСПродажи,
		|		СуммаЗатратВЦене КАК СуммаЗатратВЦене,
		|		ПоставкаНевозможна КАК ПоставкаНевозможна,
		|		Комментарий КАК Комментарий
		|	) КАК ОбъектыЗакупки
		|ИЗ
		|	Документ.КонтурЗакупки_ОбработкаЗакупки КАК ОбработкаЗакупки
		|ГДЕ
		|	ОбработкаЗакупки.Ссылка = &ОбработкаЗакупки";
	
	
	Запрос.УстановитьПараметр("ОбработкаЗакупки", ОбработкаЗакупки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаШапка.НомерЗакупки) Тогда
			Результат.Вставить("НомерЗакупки", ВыборкаШапка.НомерЗакупки);
		Иначе
			Результат.Вставить("НомерЗакупки", ВыборкаШапка.Номер);
		КонецЕсли;
		Результат.Вставить("НомерОбработкиЗакупки", ВыборкаШапка.НомерОбработкиЗакупки);
		Результат.Вставить("ИмяОписаниеЗакупки", ВыборкаШапка.ИмяОписаниеЗакупки);
		Результат.Вставить("ОрганизаторНаименование", ВыборкаШапка.ОрганизаторНаименование);
		Результат.Вставить("ОрганизаторИНН", ВыборкаШапка.ОрганизаторИНН);
		Результат.Вставить("ОрганизаторКПП", ВыборкаШапка.ОрганизаторКПП);
		Результат.Вставить("НМЦЗакупки", ВыборкаШапка.НМЦЗакупки);
		Результат.Вставить("ТипЗакупки", ВыборкаШапка.ТипЗакупки);
		Результат.Вставить("СпособОтбора", ВыборкаШапка.СпособОтбора);
		Результат.Вставить("КонтактныеДанныеИмя", ВыборкаШапка.КонтактныеДанныеИмя);
		Результат.Вставить("КонтактныеДанныеТелефон", ВыборкаШапка.КонтактныеДанныеТелефон);
		Результат.Вставить("КонтактныеДанныеЭлектроннаяПочта", ВыборкаШапка.КонтактныеДанныеЭлектроннаяПочта);
		Результат.Вставить("ДатаСозданияЗакупки", ВыборкаШапка.ДатаСозданияЗакупки);
		Результат.Вставить("ДатаОкончанияПодачиЗаявок", ВыборкаШапка.ДатаОкончанияПодачиЗаявок);
		Результат.Вставить("ДатаПодведенияИтогов", ВыборкаШапка.ДатаПодведенияИтогов);

		МассивОбъектовЗакупки = Новый Массив;
		ОбъектЗакупки = ВыборкаШапка.ОбъектыЗакупки.Выбрать();
		
		НомерСтроки = 1;
		
		Пока ОбъектЗакупки.Следующий() Цикл
			
			//Если ОбъектЗакупки.ПоставкаНевозможна Тогда
			//	Продолжить;
			//КонецЕсли;
			
			СтрокаОбъектЗакупки = Новый Структура;
			СтрокаОбъектЗакупки.Вставить("НомерСтроки", НомерСтроки);
			
			//НаименованиеОбъектаЗакупки = ?(ЗначениеЗаполнено(ОбъектЗакупки.Номенклатура), ОбъектЗакупки.Номенклатура, ОбъектЗакупки.НаименованиеОбъектаЗакупки);
			//СтрокаОбъектЗакупки.Вставить("НаименованиеОбъектаЗакупки", СтрШаблон("%1%2", ?(ОбъектЗакупки.ПоставкаНевозможна, "Поставка невозможна. ", ""), НаименованиеОбъектаЗакупки));
			
			НаименованиеОбъектаЗакупки = ?(ЗначениеЗаполнено(ОбъектЗакупки.Номенклатура), ОбъектЗакупки.Номенклатура, ОбъектЗакупки.НаименованиеОбъектаЗакупки);
			СтрокаОбъектЗакупки.Вставить("НаименованиеОбъектаЗакупки", НаименованиеОбъектаЗакупки);
			
			Если ЗначениеЗаполнено(ОбъектЗакупки.ОКПД2Код) Тогда
				СтрокаОбъектЗакупки.Вставить("ОКПД2", СтрШаблон("%1 %2", ОбъектЗакупки.ОКПД2Код, ОбъектЗакупки.ОКПД2Расшифровка));
			Иначе
				СтрокаОбъектЗакупки.Вставить("ОКПД2", "не указан");
			КонецЕсли;
			Если ЗначениеЗаполнено(ОбъектЗакупки.КТРУКод) Тогда
				СтрокаОбъектЗакупки.Вставить("КТРУ", СтрШаблон("%1 %2", ОбъектЗакупки.КТРУКод, ОбъектЗакупки.КТРУРасшифровка));
			Иначе
				СтрокаОбъектЗакупки.Вставить("КТРУ", "не указан");
			КонецЕсли;
			СтрокаОбъектЗакупки.Вставить("СтоимостьЗаЕдиницуОбъекта", ОбъектЗакупки.СтоимостьЗаЕдиницуОбъекта);
			СтрокаОбъектЗакупки.Вставить("Количество", ОбъектЗакупки.Количество);
			СтрокаОбъектЗакупки.Вставить("ЕдиницаИзмерения", ОбъектЗакупки.ЕдиницаИзмерения);
			СтрокаОбъектЗакупки.Вставить("ОбщаяСтоимостьОбъекта", ОбъектЗакупки.ОбщаяСтоимостьОбъекта);
			
			МассивОбъектовЗакупки.Добавить(СтрокаОбъектЗакупки);
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		Результат.Вставить("ОбъектыЗакупки", МассивОбъектовЗакупки);
		
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт

	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);

КонецПроцедуры

#КонецОбласти
#КонецОбласти

#КонецЕсли