// @strict-types
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	
	//МассивНепроверяемыхРеквизитов = Новый Массив; // Массив из Строка
	//Если СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.ПустаяСсылка()
	//	Или СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.Новая Тогда
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Номенклатура");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Контрагент");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ГородПоставщика");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ГородЗаказчика");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.СрокПодготовкиПродукцииУПоставщика");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ЦенаПоставщика");

	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.НормативныйДокумент");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Производитель");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Вес");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Объем");

	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.СрокДоставкиДоЗаказчика");

	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ОбъектЗакупки");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Количество");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ЕдиницаИзмерения");
	//ИначеЕсли СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.ПринятВРаботу Тогда
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Номенклатура");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Контрагент");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ГородПоставщика");
	//	//МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ГородЗаказчика");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.СрокПодготовкиПродукцииУПоставщика");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ЦенаПоставщика");

	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.НормативныйДокумент");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Производитель");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Вес");
	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Объем");

	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.СрокДоставкиДоЗаказчика");
	//ИначеЕсли СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.НаСогласованииУЛогиста Тогда

	//	МассивНепроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.СрокДоставкиДоЗаказчика");
	//ИначеЕсли СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.СогласованСЛогистом Тогда
	//ИначеЕсли СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.ПоданаЗаявкаНаУчастие Тогда
	//ИначеЕсли СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.Переторжка Тогда
	//ИначеЕсли СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.Выигран Тогда
	//ИначеЕсли СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.Проигран Тогда
	//ИначеЕсли СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.ЗаключениеДоговора Тогда
	//КонецЕсли;

	//УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	МассивПроверяемыхРеквизитов = Новый Массив;
	
	// Обходим строки и проверяем заполнение реквизита
	
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Номенклатура");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Контрагент");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ГородПоставщика");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ГородЗаказчика");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.СрокПодготовкиПродукцииУПоставщика");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ЦенаПоставщика");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.НормативныйДокумент");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Производитель");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Вес");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Объем");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.СрокДоставкиДоЗаказчика");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ОбъектЗакупки");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.Количество");
	МассивПроверяемыхРеквизитов.Добавить("ОбъектыЗакупки.ЕдиницаИзмерения");
	
	
	Если СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.ПустаяСсылка()
		Или СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.Новая Тогда
		
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.Номенклатура");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.Контрагент");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.ГородПоставщика");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.ГородЗаказчика");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.СрокПодготовкиПродукцииУПоставщика");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.ЦенаПоставщика");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.НормативныйДокумент");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.Производитель");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.Вес");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.Объем");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.СрокДоставкиДоЗаказчика");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.ОбъектЗакупки");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.Количество");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.ЕдиницаИзмерения");
		
	ИначеЕсли СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.ПринятВРаботу
		Или СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.Переторжка Тогда
		
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.Номенклатура");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.Контрагент");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.ГородПоставщика");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.СрокПодготовкиПродукцииУПоставщика");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.ЦенаПоставщика");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.НормативныйДокумент");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.Производитель");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.Вес");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.Объем");
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.СрокДоставкиДоЗаказчика");
		
	ИначеЕсли СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.НаСогласованииУЛогиста Тогда
		
		УдалитьЭлементИзМассива(МассивПроверяемыхРеквизитов, "ОбъектыЗакупки.СрокДоставкиДоЗаказчика");
		
	КонецЕсли;
	
	
	Для Индекс = 0 по ОбъектыЗакупки.Количество()-1 Цикл
		СтрокаОбъектЗакупки = ОбъектыЗакупки.Получить(Индекс);
		
		Если СтрокаОбъектЗакупки.ПоставкаНевозможна Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого РеквизитПроверки Из МассивПроверяемыхРеквизитов Цикл
			
			ИмяРеквизита = СтрЗаменить(РеквизитПроверки, "ОбъектыЗакупки.", "");
			
			Если Не ЗначениеЗаполнено(СтрокаОбъектЗакупки[ИмяРеквизита]) Тогда
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "В строке " + СтрокаОбъектЗакупки.НомерСтроки + " не заполнено значение реквизита " + ИмяРеквизита;
				Сообщение.Поле = "ОбъектыЗакупки[" + Индекс + "]." + ИмяРеквизита;
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьИтогиПоДокументу();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КонтурЗакупки_Закупка") Тогда

		ДокументОбработки = НайтиДокументОбработкиЗакупки(ДанныеЗаполнения);

		Если Не ЗначениеЗаполнено(ДокументОбработки) Тогда
			ЗаполнениеНаОснованииЗакупки(ДанныеЗаполнения);
		Иначе
			СтандартнаяОбработка = Ложь;
			ТекстИсключения = СтрШаблон(
				НСтр("ru = 'Документ обработки для этой закупки уже существует: %1'"), Строка(ДокументОбработки));
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполнение итогов по документу
Процедура ЗаполнитьИтогиПоДокументу() Экспорт
	СуммаЗатрат = ОбъектыЗакупки.Итог("СуммаЗатрат");
	СуммаЗатратВЦене = ОбъектыЗакупки.Итог("СуммаЗатратВЦене");
	СуммаЗакупки = ОбъектыЗакупки.Итог("ОбщаяСтоимостьОбъекта");
	СуммаПоставщика = ОбъектыЗакупки.Итог("СуммаПоставщика");
	СуммаПродажи = ОбъектыЗакупки.Итог("СуммаПродажи");
	СуммаПрибыли = ОбъектыЗакупки.Итог("СуммаПрибыли");
	Вес = ОбъектыЗакупки.Итог("Вес");
	Объем = ОбъектыЗакупки.Итог("Объем");
	Если СуммаПоставщика > 0 Тогда
		ПроцентМаржи = СуммаПрибыли * 100 / СуммаПоставщика;
	Иначе
		ПроцентМаржи = 0;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьТаблицуПользователейПоРолям() Экспорт
	МассивРолей = Новый Массив; // Массив из ОбъектМетаданныхРоль
	МассивРолей.Добавить(Метаданные.Роли.КонтурЗакупки_ОтделПродаж);
	МассивРолей.Добавить(Метаданные.Роли.КонтурЗакупки_ОтделЛогистики);
	МассивРолей.Добавить(Метаданные.Роли.КонтурЗакупки_ОтделСнабжения);
//	МассивРолей.Добавить(Метаданные.Роли.КонтурЗакупки_ОтделФинансов);

	Для Каждого Роль Из МассивРолей Цикл
		СтрокаРоль = ПользователиПоРолям.Найти (Роль.Имя, "РольИмя");
		Если СтрокаРоль = Неопределено Тогда
			НовСтр = ПользователиПоРолям.Добавить();
			НовСтр.РольИмя = Роль.Имя;
			НовСтр.РольСиноним = Роль.Синоним;
			МассивПользователейСРолью = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.ПолучитьМассивПользователейСРолью(
				Роль);
			Если МассивПользователейСРолью.Количество() > 0 Тогда
				НовСтр.Пользователь = МассивПользователейСРолью[0];
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Удалить непроверяемые реквизиты из массива.
// 
// Параметры:
//  МассивРеквизитов - Массив из Строка - Массив реквизитов
//  МассивНепроверяемыхРеквизитов - Массив из Строка - Массив непроверяемых реквизитов
Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов)
	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
		ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
		Если Не ПорядковыйНомер = Неопределено Тогда
			МассивРеквизитов.Удалить(ПорядковыйНомер);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнениеНаОснованииЗакупки(ДокументЗакупки)
	ДокументОснования = ДокументЗакупки;
	ЗаполнитьТаблицуПользователейПоРолям();

	СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.Новая;
	СуммаЗакупки = ДокументЗакупки.НМЦЗакупки;
	ИмяОписаниеЗакупки = ДокументЗакупки.ИмяОписаниеЗакупки;
	НомерЗакупки = ДокументЗакупки.НомерЗакупки;
	СуммаЗатрат = 0;
	Пользователь = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.ПолучитьТекущегоПользователя();
	Автор = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.ПолучитьТекущегоПользователя();

	ОрганизаторыЗаказчики.Очистить();
	ОбъектыЗакупки.Очистить();
	ОбъектыЗатрат.Очистить();

	ЗапросОрганизаторыИЗаказчики = Новый Запрос;
	ЗапросОрганизаторыИЗаказчики.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЗакупки_Закупка.ОрганизаторНаименование,
	|	КонтурЗакупки_Закупка.ОрганизаторИНН,
	|	КонтурЗакупки_Закупка.ОрганизаторКПП,
	|	ИСТИНА КАК ЭтоОрганизатор
	|ИЗ
	|	Документ.КонтурЗакупки_Закупка КАК КонтурЗакупки_Закупка
	|ГДЕ
	|	КонтурЗакупки_Закупка.Ссылка = &Ссылка
	|	И Не КонтурЗакупки_Закупка.ОрганизаторНаименование = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЗакупки_ЗакупкаЗаказчики.ОрганизацияНаименование,
	|	КонтурЗакупки_ЗакупкаЗаказчики.ОрганизацияИНН,
	|	КонтурЗакупки_ЗакупкаЗаказчики.ОрганизацияКПП,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.КонтурЗакупки_Закупка.Заказчики КАК КонтурЗакупки_ЗакупкаЗаказчики
	|ГДЕ
	|	КонтурЗакупки_ЗакупкаЗаказчики.Ссылка = &Ссылка
	|	И Не КонтурЗакупки_ЗакупкаЗаказчики.ОрганизацияНаименование = """"
	|СГРУППИРОВАТЬ ПО
	|	КонтурЗакупки_ЗакупкаЗаказчики.ОрганизацияИНН,
	|	КонтурЗакупки_ЗакупкаЗаказчики.ОрганизацияКПП,
	|	КонтурЗакупки_ЗакупкаЗаказчики.ОрганизацияНаименование";

	ЗапросОрганизаторыИЗаказчики.УстановитьПараметр("Ссылка", ДокументЗакупки);

	Выборка = ЗапросОрганизаторыИЗаказчики.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураОрганизатор = Новый Структура;
		//@skip-check property-return-type
		СтруктураОрганизатор.Вставить("ИНН", Выборка.ОрганизаторИНН);
		//@skip-check property-return-type
		СтруктураОрганизатор.Вставить("КПП", Выборка.ОрганизаторКПП);
		//@skip-check property-return-type
		СтруктураОрганизатор.Вставить("ПолноеНаименование", Выборка.ОрганизаторНаименование);

		НовСтрОрганизатор = ОрганизаторыЗаказчики.Добавить();
		НовСтрОрганизатор.ОрганизаторЗаказчик = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.ПолучитьОрганизатора(
				СтруктураОрганизатор);
		//@skip-check property-return-type
		//@skip-check statement-type-change
		НовСтрОрганизатор.ЭтоОрганизатор = Выборка.ЭтоОрганизатор;
		Если НовСтрОрганизатор.ЭтоОрганизатор Тогда
			Организатор = НовСтрОрганизатор.ОрганизаторЗаказчик;
		КонецЕсли;
	КонецЦикла;

	МассивОрганизаторов = ОрганизаторыЗаказчики.Выгрузить().ВыгрузитьКолонку("ОрганизаторЗаказчик");

	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.Ключ КАК Ключ,
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУКод КАК КТРУКод,
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУРасшифровка КАК КТРУРасшифровка
	|ПОМЕСТИТЬ КодТРУ
	|ИЗ
	|	Документ.КонтурЗакупки_Закупка.КодыКТРУ КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.Ключ КАК Ключ,
	|			МАКСИМУМ(КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУКод) КАК КТРУКод
	|		ИЗ
	|			Документ.КонтурЗакупки_Закупка.КодыКТРУ КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ
	|		ГДЕ
	|			КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.Ссылка = &Ссылка
	|		СГРУППИРОВАТЬ ПО
	|			КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.Ключ) КАК МаксКодТРУ
	|		ПО КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.Ключ = МаксКодТРУ.Ключ
	|		И МаксКодТРУ.КТРУКод = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУКод
	|ГДЕ
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.Ключ,
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Код,
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Расшифровка
	|ПОМЕСТИТЬ КодОКВЭД2
	|ИЗ
	|	Документ.КонтурЗакупки_Закупка.КодыОКВЭД2 КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.Ключ,
	|			МАКСИМУМ(КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Код) КАК ОКВЭД2Код
	|		ИЗ
	|			Документ.КонтурЗакупки_Закупка.КодыОКВЭД2 КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2
	|		ГДЕ
	|			КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.Ссылка = &Ссылка
	|		СГРУППИРОВАТЬ ПО
	|			КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.Ключ) КАК МаксКодОКВЭД2
	|		ПО КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.Ключ = МаксКодОКВЭД2.Ключ
	|		И МаксКодОКВЭД2.ОКВЭД2Код = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Код
	|ГДЕ
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.Ключ,
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Код,
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Расшифровка
	|ПОМЕСТИТЬ КодОКПД2
	|ИЗ
	|	Документ.КонтурЗакупки_Закупка.КодыОКПД2 КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.Ключ,
	|			МАКСИМУМ(КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Код) КАК ОКПД2Код
	|		ИЗ
	|			Документ.КонтурЗакупки_Закупка.КодыОКПД2 КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2
	|		ГДЕ
	|			КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.Ссылка = &Ссылка
	|		СГРУППИРОВАТЬ ПО
	|			КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.Ключ) КАК МаксКодОКПД2
	|		ПО КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.Ключ = МаксКодОКПД2.Ключ
	|		И МаксКодОКПД2.ОКПД2Код = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Код
	|ГДЕ
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.НаименованиеОбъектаЗакупки КАК НаименованиеОбъектаЗакупки,
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Количество КАК Количество,
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.СтоимостьЗаЕдиницуОбъекта КАК СтоимостьЗаЕдиницуОбъекта,
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.ОбщаяСтоимостьОбъекта КАК ОбщаяСтоимостьОбъекта,
	|	КодТРУ.КТРУКод КАК КТРУКод,
	|	КодТРУ.КТРУРасшифровка КАК КТРУРасшифровка,
	|	КодОКВЭД2.ОКВЭД2Код КАК ОКВЭД2Код,
	|	КодОКВЭД2.ОКВЭД2Расшифровка КАК ОКВЭД2Расшифровка,
	|	КодОКПД2.ОКПД2Код КАК ОКПД2Код,
	|	КодОКПД2.ОКПД2Расшифровка КАК ОКПД2Расшифровка
	|ИЗ
	|	Документ.КонтурЗакупки_Закупка.ОбъектыЗакупки КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодТРУ КАК КодТРУ
	|		ПО КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ключ_ОбъектыЗакупки = КодТРУ.Ключ
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодОКВЭД2 КАК КодОКВЭД2
	|		ПО КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ключ_ОбъектыЗакупки = КодОКВЭД2.Ключ
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодОКПД2 КАК КодОКПД2
	|		ПО КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ключ_ОбъектыЗакупки = КодОКПД2.Ключ
	|ГДЕ
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.НаименованиеОбъектаЗакупки,
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.Количество,
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.ЕдиницаИзмерения,
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.СтоимостьЗаЕдиницуОбъекта,
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.ОбщаяСтоимостьОбъекта,
	|	КодТРУ.КТРУКод,
	|	КодТРУ.КТРУРасшифровка,
	|	КодОКВЭД2.ОКВЭД2Код,
	|	КодОКВЭД2.ОКВЭД2Расшифровка,
	|	КодОКПД2.ОКПД2Код,
	|	КодОКПД2.ОКПД2Расшифровка
	|ИЗ
	|	Документ.КонтурЗакупки_Закупка.СовместныеОбъектыЗакупки КАК КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодОКПД2 КАК КодОКПД2
	|		ПО КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.Ключ_ОбъектыЗакупки = КодОКПД2.Ключ
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодОКВЭД2 КАК КодОКВЭД2
	|		ПО КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.Ключ_ОбъектыЗакупки = КодОКВЭД2.Ключ
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодТРУ КАК КодТРУ
	|		ПО КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.Ключ_ОбъектыЗакупки = КодТРУ.Ключ
	|ГДЕ
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.Ссылка = &Ссылка";
	ЗапросТЧ.УстановитьПараметр("Ссылка", ДокументЗакупки);
	Выборка = ЗапросТЧ.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрОбъект = ОбъектыЗакупки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрОбъект, Выборка);
		НовСтрОбъект.ОбъектЗакупки = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.НайтиСоздатьОбъектЗакупки(
				Выборка);
		НовСтрОбъект.Номенклатура = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьНоменклатуруПоОбъектуЗакупки(
				МассивОрганизаторов, НовСтрОбъект.ОбъектЗакупки);
		Если ЗначениеЗаполнено(НовСтрОбъект.Номенклатура) Тогда
			СтруктураДанныеНоменклатуры = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьДанныеНоменклатуры(
						НовСтрОбъект.Номенклатура);
			ЗаполнитьЗначенияСвойств(НовСтрОбъект, СтруктураДанныеНоменклатуры);
		КонецЕсли;

	КонецЦикла;

	ДокументыЗакупки.Загрузить(ДокументЗакупки.ДокументыЗакупки.Выгрузить());
КонецПроцедуры

Процедура УдалитьЭлементИзМассива(Массив, ЗначениеЭлемента)
	Индекс = Массив.Найти(ЗначениеЭлемента);
	Массив.Удалить(Индекс);
КонецПроцедуры

// Существует документ обработки закупки.
// 
// Параметры:
//  ДокументЗакупки - ДокументСсылка.КонтурЗакупки_Закупка - Документ закупки
// 
// Возвращаемое значение:
//  ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Существующий документ или пустая ссылка
Функция НайтиДокументОбработкиЗакупки(ДокументЗакупки)
	ОбработкаЗакупки = Документы.КонтурЗакупки_ОбработкаЗакупки.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЗакупки_ОбработкаЗакупки.Ссылка
	|ИЗ
	|	Документ.КонтурЗакупки_ОбработкаЗакупки КАК КонтурЗакупки_ОбработкаЗакупки
	|ГДЕ
	|	КонтурЗакупки_ОбработкаЗакупки.ДокументОснования = &ДокументОснования
	|	И НЕ КонтурЗакупки_ОбработкаЗакупки.ПометкаУдаления
	|	и Не КонтурЗакупки_ОбработкаЗакупки.Ссылка = &ЭтотДокумент";

	Запрос.УстановитьПараметр("ДокументОснования", ДокументЗакупки);
	Запрос.УстановитьПараметр("ЭтотДокумент", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//@skip-check property-return-type
		ОбработкаЗакупки = Выборка.Ссылка; // ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки
	КонецЕсли;

	Возврат ОбработкаЗакупки;
КонецФункции
#КонецОбласти

#КонецЕсли