#Область ПрограммныйИнтерфейс

// Метрика отправить метрику.
// 
// Параметры:
//  СтруктураДанных - Структура - Структура данных
// 
// Возвращаемое значение:
//  Неопределено, Структура: См. КонтурЗакупки_СтруктурыКлиентСервер.ИнициализироватьРезультатФункции - Метрика отправить метрику
Функция ОтправитьМетрику(СтруктураДанных) Экспорт

	РезультатHTTPЗапроса = Неопределено;
	Если Не СтруктураДанных = Неопределено Тогда
		ПараметрыHTTPЗапроса = ПолучитьСтруктуруЗапросаМетрики(СтруктураДанных);
		РезультатHTTPЗапроса = КонтурЗакупки_httpКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыHTTPЗапроса);
	КонецЕсли;

	Возврат РезультатHTTPЗапроса;

КонецФункции

// Получить структуру события нажатие на кнопку.
// 
// Параметры:
//  ИмяКнопки - Строка - Имя кнопки
//  СтруктураКлиентаДляМетрики - Структура - Структура клиента для метрики:
// * ClientID - Строка - 
// * ClientName - Строка - 
// * ClientVersion - Строка - 
// * moduleName - Строка - 
// 
// Возвращаемое значение:
//  Неопределено, Структура - Получить структуру события нажатие на кнопку:
// * СтруктураКлиента - Структура - :
// ** ClientID - Строка - 
// ** ClientName - Строка - 
// ** ClientVersion - Строка - 
// ** moduleName - Строка - 
// * МассивСобытий - Массив из Структура - 
// * topic - Строка - 
Функция ПолучитьСтруктуруСобытия_НажатиеНаКнопку(ИмяКнопки, СтруктураКлиентаДляМетрики) Экспорт

	РезультатФункции = Неопределено;
	ОтключитьМетрику = КонтурЗакупки_ПодсистемаНастройкиВызовСервера.ПолучитьЗначениеНастройки("КонтурПодсистема",
		"ОтключитьМетрику", Ложь);
	ОтправлятьДанные = Не ОтключитьМетрику;

	Если ОтправлятьДанные Тогда
		
		//		СтруктураКлиента = ПолучитьСтруктуруКлиента();
		
		//		Категория = "formActions";
		//		ИмяСобытия = "buttonClick";
		//		Метка = ИмяКнопки;
		//		Представление = "нажали на кнопку";
//				ИмяСобытия = ?(ЭтоВызовСКлиента, "Client: ", "Server: ") + ОписаниеДействия["action"];
		Топик = "Log";

		РезультатФункции = Новый Структура;
		РезультатФункции.Вставить("СтруктураКлиента", СтруктураКлиентаДляМетрики);
		РезультатФункции.Вставить("МассивСобытий", Новый Массив);
		РезультатФункции.Вставить("topic", Топик);

	КонецЕсли;

	Возврат РезультатФункции;

КонецФункции

// Получить структуру события.
// 
// Параметры:
//  ОписаниеДействия - Структура - Описание действия:
// * action - Строка - идентификатор действия, например get_organizations
// * view - Строка - представление действия, например Получить список организаций
// * connect - Строка - Строка запроса
// * data - Строка, Структура - произвольные значения, задаются строкой или структурой
//  КоличествоСобытий - Число - Количество событий
//  СтруктураКлиентаДляМетрики - см. КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьСтруктуруКлиентаДляМетрики
//  ИдентификаторЗапроса - Строка - Trace-Id
//  ЭтоВызовСКлиента - Булево - Вызов идет с клиента
// 
// Возвращаемое значение:
//  Неопределено, Структура - Получить структуру события:
// * СтруктураКлиента  - см. КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьСтруктуруКлиентаДляМетрики
// * МассивСобытий - Массив из Структура - 
// * topic - Строка - 
Функция ПолучитьСтруктуруСобытия(ОписаниеДействия, КоличествоСобытий = 1, СтруктураКлиентаДляМетрики,
	ИдентификаторЗапроса = "", ЭтоВызовСКлиента = Ложь) Экспорт

	РезультатФункции = Неопределено;

	ОтправлятьДанные = Не КонтурЗакупки_ПодсистемаНастройкиВызовСервера.ПолучитьЗначениеНастройки("КонтурПодсистема",
		"ОтключитьМетрику", Ложь);

	Если ОтправлятьДанные Тогда

		Категория = "Actions";
		Топик = "Log";

		ИмяСобытия = ?(ЭтоВызовСКлиента, "Client: ", "Server: ") + ОписаниеДействия["action"];
		ПредставлениеСобытия = ОписаниеДействия["view"];
		Метка = ОписаниеДействия["connect"];
		ПроизвольноеЗначение = ОписаниеДействия["data"];

		СтруктураПрочихДанных = Новый Структура("data", Метрика_СформироватьСтруктуруОписанияЗначения(
			ПроизвольноеЗначение));

		Если ЗначениеЗаполнено(СтруктураКлиентаДляМетрики["ClientID"]) И ЗначениеЗаполнено(
			СтруктураКлиентаДляМетрики["ClientName"]) И ЗначениеЗаполнено(СтруктураКлиентаДляМетрики["moduleName"]) Тогда
			МассивСобытий = Новый Массив;
			Для Индекс = 1 По КоличествоСобытий Цикл
				СтруктураМетрики = ПолучитьСтруктуруМетрики(СтруктураКлиентаДляМетрики, Категория, ИмяСобытия, Метка,
					ПредставлениеСобытия, СтруктураПрочихДанных, ИдентификаторЗапроса);
				ВставитьСтруктуруВремениДляОтправки(СтруктураМетрики);
				МассивСобытий.Добавить(СтруктураМетрики);
			КонецЦикла;

			РезультатФункции = Новый Структура;
			РезультатФункции.Вставить("СтруктураКлиента", СтруктураКлиентаДляМетрики);
			РезультатФункции.Вставить("МассивСобытий", МассивСобытий);
			РезультатФункции.Вставить("topic", Топик);
		КонецЕсли;

	КонецЕсли;

	Возврат РезультатФункции;

КонецФункции

// Получить структуру ошибки.
// 
// Параметры:
//  ОписаниеДействия - Структура - Описание действия:
// * action - Строка - идентификатор действия, например get_organizations
// * view - Строка - представление действия, например Получить список организаций
// * connect - Строка - Строка запроса
// * data - Строка, Структура - произвольные значения, задаются строкой или структурой
//  ТекстОшибки - Строка - Текст ошибки
//  СтруктураКлиентаДляМетрики  - см. КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьСтруктуруКлиентаДляМетрики
//  ИдентификаторЗапроса - Строка - Trace-Id
//  ЭтоВызовСКлиента - Булево - Вызов идет с клиента
// 
// Возвращаемое значение:
//  Неопределено, Структура - Получить структуру ошибки:
// * СтруктураКлиента  - см. КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьСтруктуруКлиентаДляМетрики
// * МассивСобытий - Массив из Структура - 
// * topic - Строка - 
Функция ПолучитьСтруктуруОшибки(ОписаниеДействия, ТекстОшибки, СтруктураКлиентаДляМетрики, ИдентификаторЗапроса = "",
	ЭтоВызовСКлиента = Ложь) Экспорт

	РезультатФункции = Неопределено;

	ОтправлятьДанные = Не КонтурЗакупки_ПодсистемаНастройкиВызовСервера.ПолучитьЗначениеНастройки("КонтурПодсистема",
		"ОтключитьМетрику", Ложь);

	Если ОтправлятьДанные Тогда

		Категория = "Errors";
		Топик = "Log";

		ИмяСобытия = ?(ЭтоВызовСКлиента, "Client: ", "Server: ") + ОписаниеДействия["action"];
		ПредставлениеСобытия = ОписаниеДействия["view"];
		Метка = ОписаниеДействия["connect"];

		Если ЗначениеЗаполнено(СтруктураКлиентаДляМетрики["ClientID"]) И ЗначениеЗаполнено(
			СтруктураКлиентаДляМетрики["ClientName"]) И ЗначениеЗаполнено(СтруктураКлиентаДляМетрики["moduleName"]) Тогда
			МассивСобытий = Новый Массив;

			СтруктураПрочихДанных = Новый Структура("error", Метрика_СформироватьСтруктуруОписанияЗначения(ТекстОшибки));

			СтруктураМетрики = ПолучитьСтруктуруМетрики(СтруктураКлиентаДляМетрики, Категория, ИмяСобытия, Метка,
				ПредставлениеСобытия, СтруктураПрочихДанных, ИдентификаторЗапроса);
			ВставитьСтруктуруВремениДляОтправки(СтруктураМетрики);
			МассивСобытий.Добавить(СтруктураМетрики);

			РезультатФункции = Новый Структура;
			РезультатФункции.Вставить("СтруктураКлиента", СтруктураКлиентаДляМетрики);
			РезультатФункции.Вставить("МассивСобытий", МассивСобытий);
			РезультатФункции.Вставить("topic", Топик);
		КонецЕсли;

	КонецЕсли;

	Возврат РезультатФункции;
КонецФункции

// Получить структуру метрики.
// 
// Параметры:
//  СтруктураДанных - Структура - Структура данных:
// * СтруктураКлиента  - см. КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьСтруктуруКлиентаДляМетрики
// * МассивСобытий - Массив из Структура - 
// * topic - Строка - 
// 
// Возвращаемое значение:
//   См. КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьСтруктуруПараметровHTTPЗапроса
Функция ПолучитьСтруктуруЗапросаМетрики(СтруктураДанных) Экспорт

	СтруктураКлиента = СтруктураДанных["СтруктураКлиента"];
	МассивСобытий = СтруктураДанных["МассивСобытий"];
	Топик = СтруктураДанных["topic"];

	ПараметрыHTTPЗапроса = ПолучитьПараметрыHTTPЗапросаМетрики();

	ТелоЗапроса = ПреобразоватьВJSON(МассивСобытий);

	ЗаголовокHTTP = Новый Соответствие;
	ЗаголовокHTTP.Вставить("accept", "application/json");

	ПараметрыHTTPЗапроса.Метод = "POST";
	ПараметрыHTTPЗапроса.СтрокаПодключения = АдресДляОтправкиДанныхОСобытии(СтруктураКлиента, Топик);
	ПараметрыHTTPЗапроса.ЗаголовокHTTP = ЗаголовокHTTP;
	ПараметрыHTTPЗапроса.ОтправитьФайл = Ложь;
	ПараметрыHTTPЗапроса.ПолучитьФайл = Ложь;
	ПараметрыHTTPЗапроса.ТелоЗапроса = ТелоЗапроса;

	ПараметрыHTTPЗапроса.ЗащищенноеСоединение = Истина;
	ПараметрыHTTPЗапроса.ПортСервера = 443;

	Возврат ПараметрыHTTPЗапроса;

КонецФункции
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
#Область КонтекстПриложения

// Метрика новый контекст приложения браузер.
// 
// Возвращаемое значение:
//  Неопределено, Соответствие из Строка - Метрика новый контекст приложения браузер
Функция КонтекстПриложенияБраузер()

	СистемнаяИнформация = Новый СистемнаяИнформация;

	UserAgent = СистемнаяИнформация.ИнформацияПрограммыПросмотра;
	Если ПустаяСтрока(UserAgent) Тогда
		Возврат Неопределено;
	КонецЕсли;

	КП_Браузер = Новый Соответствие;
	КП_Браузер.Вставить("UserAgent", UserAgent);

	Возврат КП_Браузер;

КонецФункции

// Метрика новый контекст приложения ОС.
// 
// Возвращаемое значение:
//  Соответствие из Строка -  Метрика новый контекст приложения ОС
Функция КонтекстПриложенияОС()

	Перем BitSet, Name, Version;

	СистемнаяИнформация = Новый СистемнаяИнформация;
	СтрокаТипПлатформы  = НРег(СистемнаяИнформация.ТипПлатформы);

	Если СтрНайти(СтрокаТипПлатформы, "64") <> 0 Тогда
		BitSet = "x64";
	Иначе
		BitSet = "x86";
	КонецЕсли;

	Если СтрНайти(СтрокаТипПлатформы, НРег("Linux")) <> 0 Тогда
		Name = "Linux";
	ИначеЕсли СтрНайти(СтрокаТипПлатформы, НРег("MacOS")) <> 0 Тогда
		Name = "MacOS";
	ИначеЕсли СтрНайти(СтрокаТипПлатформы, НРег("Windows")) <> 0 Тогда
		Name = "Windows";
	КонецЕсли;

	Version = "0.0.0";

	КП_ОС = Новый Соответствие;
	КП_ОС.Вставить("BitSet", BitSet);
	КП_ОС.Вставить("Name", Name);
	КП_ОС.Вставить("Version", Version);

	Возврат КП_ОС;

КонецФункции

// Метрика новый контекст приложения платформа.
// 
// Возвращаемое значение:
//  Соответствие из Строка -  Метрика новый контекст приложения платформа
Функция КонтекстПриложенияПлатформа()

	СистемнаяИнформация  = Новый СистемнаяИнформация;
	Name = "1С:Предприятие 8";
	Configuration = Метаданные.Имя;
	ConfigurationVersion = Метаданные.Версия;
	РежимЗапуска1С = ТекущийРежимЗапуска();
	RunMode = Строка(?(РежимЗапуска1С = Неопределено, "Фоновое задание", РежимЗапуска1С));
	Version = СистемнаяИнформация.ВерсияПриложения;

	КП_Платформа = Новый Соответствие;
	КП_Платформа.Вставить("Name", Name);
	КП_Платформа.Вставить("Configuration", Configuration);
	КП_Платформа.Вставить("ConfigurationVersion", ПреобразоватьВерсиюВСемантик(ConfigurationVersion));
	КП_Платформа.Вставить("RunMode", RunMode);
	КП_Платформа.Вставить("Version", ПреобразоватьВерсиюВСемантик(Version));

	Возврат КП_Платформа;
КонецФункции
#КонецОбласти

// Получить структуру метрики.
// 
// Параметры:
//  СтруктураКлиентаДляМетрики - Структура: См. КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьСтруктуруКлиентаДляМетрики
//  Категория - Строка - Категория
//  ИмяСобытия - Строка - Имя события
//  Метка - Строка - Метка
//  Представление - Строка - Представление
//  СтруктураПрочихДанных - Структура - Структура прочих данных:
// * data - Структура - :
// ** value - Строка - 
// ** type - Строка - 
//  ИдентификаторЗапроса - Строка - Trace-Id
// 
// Возвращаемое значение:
//  Структура - Структура метрики
Функция ПолучитьСтруктуруМетрики(СтруктураКлиентаДляМетрики, Категория, ИмяСобытия, Метка, Представление,
	СтруктураПрочихДанных, ИдентификаторЗапроса = "")

	СтруктураВремени = ПолучитьСтруктуруВремени();
	СтруктураСобытия = ПолучитьСтруктуруСобытияМерики(ИмяСобытия, Категория, Метка, Представление);
	СтруктураСессии = ПолучитьСтруктуруСессии();

	СтруктураМетрики = Новый Структура;
	СтруктураМетрики.Вставить("Id", Строка(Новый УникальныйИдентификатор));
	СтруктураМетрики.Вставить("ClientInstanceId", СтруктураКлиентаДляМетрики["ClientID"]);
	СтруктураМетрики.Вставить("Time", СтруктураВремени);
	СтруктураМетрики.Вставить("Path", СтруктураСобытия);
	СтруктураМетрики.Вставить("Session", СтруктураСессии);
	Если ЗначениеЗаполнено(ИдентификаторЗапроса) Тогда
		СтруктураМетрики.Вставить("TraceId", ИдентификаторЗапроса);
	КонецЕсли;

	СтруктураДанныхПриложения = ПолучитьСтруктуруДанныхПриложения(СтруктураКлиентаДляМетрики);
	СтруктураМетрики.Вставить("AppContext", СтруктураДанныхПриложения);	//системная информация, пока не надо

	Если Не СтруктураПрочихДанных = Неопределено Тогда
		СтруктураМетрики.Вставить("Variables", СтруктураПрочихДанных);
	КонецЕсли;

	СтруктураМетрики.Вставить("ClientInfo", ПолучитьСтруктуруКлиента(СтруктураКлиентаДляМетрики));

	Возврат СтруктураМетрики;

КонецФункции

// Метрика получить структуру времени.
// 
// Возвращаемое значение:
//  Соответствие из Строка - Метрика получить структуру времени
Функция ПолучитьСтруктуруВремени()

	ВремяВозникновенияСобытия = ДатаВФормате_ISO8601(УниверсальноеВремя(ТекущаяДатаСеанса()));
	МоментВремени = Новый Соответствие;
	МоментВремени.Вставить("ClientTime", ВремяВозникновенияСобытия);
	МоментВремени.Вставить("SendFromClientTime", ВремяВозникновенияСобытия);

	Возврат МоментВремени;

КонецФункции

// Метрика получить структуру клиента.
// 
// Параметры:
//  СтруктураКлиентаДляМетрики - Структура -  Структура клиента:
// * ClientID - Строка - 
// * ClientName - Строка - 
// * ClientVersion - Строка - 
// * moduleName - Строка - 
// 
// Возвращаемое значение:
//  Соответствие из Строка -  Метрика получить структуру клиента
Функция ПолучитьСтруктуруКлиента(СтруктураКлиентаДляМетрики)

	Результат = Новый Соответствие;
	Результат.Вставить("ClientName", СтруктураКлиентаДляМетрики["ClientName"]);
	Результат.Вставить("ClientVersion", ПреобразоватьВерсиюВСемантик(
	СтруктураКлиентаДляМетрики["ClientVersion"]));

	Возврат Результат;

КонецФункции

// Метрика вставить структуру времени для отправки.
// 
// Параметры:
//  СтруктураМетрики - Соответствие из Строка -  Структура метрики
Процедура ВставитьСтруктуруВремениДляОтправки(СтруктураМетрики)

	ВремяОтправки = ДатаВФормате_ISO8601(УниверсальноеВремя(ТекущаяДатаСеанса()));

	СтруктураМетрики["Time"].Вставить("SendFromClientTime", ВремяОтправки);
КонецПроцедуры

// Получить структуру события.
// 
// Параметры:
//  ИмяСобытия - Строка -  Имя события
//  Категория - Строка -  Категория
//  Метка - Строка -  Метка
//  Представление - Строка -  Представление
// 
// Возвращаемое значение:
//  Структура -  Метрика получить структуру события:
// * Action - Строка - ИмяСобытия
// * Category - Строка - Категория
// * Label - Строка - Метка
// * View - Строка - Представление
Функция ПолучитьСтруктуруСобытияМерики(ИмяСобытия, Категория, Метка, Представление)

	Результат = Новый Структура;
	Результат.Вставить("Action", ИмяСобытия);
	Результат.Вставить("Category", Категория);
	Результат.Вставить("Label", Метка);
	Результат.Вставить("View", Представление);

	Возврат Результат;

КонецФункции

// Получить структуру данных приложения.
// 
// Параметры:
//  СтруктураКлиента - Структура -  Структура клиента:
// * ClientID - Строка - 
// * ClientName - Строка - 
// * ClientVersion - Строка - 
// * moduleName - Строка - 
// 
// Возвращаемое значение:
//  Соответствие из Строка -  Получить структуру данных приложения
Функция ПолучитьСтруктуруДанныхПриложения(СтруктураКлиента)

	Результат = Новый Соответствие;

	Результат.Вставить("Platform", КонтекстПриложенияПлатформа());
	Результат.Вставить("OS", КонтекстПриложенияОС());
	Результат.Вставить("AppVersion", ПреобразоватьВерсиюВСемантик(СтруктураКлиента["ClientVersion"]));
	Результат.Вставить("Browser", КонтекстПриложенияБраузер());

	Возврат Результат;

КонецФункции

// Метрика преобразовать ВJSON.
// 
// Параметры:
//  Значение  - Структура,Массив из Неопределено - Значение
// 
// Возвращаемое значение:
//  Строка -  Метрика преобразовать ВJSON
Функция ПреобразоватьВJSON(Значение)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);

	Возврат ЗаписьJSON.Закрыть();

КонецФункции

// Метрика сформировать структуру описания значения.
// 
// Параметры:
//  Значение - Произвольный - Значение
// 
// Возвращаемое значение:
//  Структура - Метрика сформировать структуру описания значения:
// * value - Строка - 
// * type - Строка - 
Функция Метрика_СформироватьСтруктуруОписанияЗначения(Значение)

	Результат = Новый Структура("value, type", "", "");
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Результат.value = Формат(Значение, "ЧН=;ЧГ=");
		Результат.type = "number";
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
		Результат.value = Значение;
		Результат.type = "string";
	ИначеЕсли ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
		Результат.value = Строка(Значение);
		Результат.type = "uuid";
	ИначеЕсли ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
		Результат.value = Base64Строка(Значение);
		Результат.type = "base64";
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
		Результат.value = Формат(Значение, "БЛ=False;БИ=True");
		Результат.type = "string";
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		Результат.value = Формат(Значение, "ДЛФ=DT;ДП=");
		Результат.type = "string";
	Иначе
		Попытка
			Результат.value = ПреобразоватьВJSON(Значение);
			Результат.type = "string";
		Исключение
			Результат.value = "convert_error";
			Результат.type = "string";
		КонецПопытки;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ДатаВФормате_ISO8601(ДатаВремя)
	ФорматнаяСтрока = "ДФ=yyyy-MM-ddTHH:mm:ss+00:00";

	Возврат Формат(ДатаВремя, ФорматнаяСтрока);
КонецФункции

// Преобразовать версию в семантик.
// 
// Параметры:
//  Версия - Строка -  Версия
// 
// Возвращаемое значение:
//  Строка -  версия в семантик
Функция ПреобразоватьВерсиюВСемантик(Знач Версия)

	Если Не ЗначениеЗаполнено(Версия) Тогда
		Возврат "0.0.0";
	КонецЕсли;

	Версия  = Строка(Версия);
	МассивРазрядов  = РазложитьСтрокуВМассивСлов(Версия, "./");
	СемантикВерсия = "";

	Счетчик = 0;
	Разделитель = "";
	ТекРазряд = "";
	Для Каждого Разряд Из МассивРазрядов Цикл
		Счетчик = Счетчик + 1;
		Если Счетчик < 4 Тогда
			ТекРазряд = ?(ТолькоЦифрыВСтроке(Разряд), Разряд, "0");
		Иначе
			ТекРазряд = СтрЗаменить(Разряд, " ", "");
		КонецЕсли;
		СемантикВерсия = СемантикВерсия + Разделитель + ТекРазряд;
		Если Счетчик < 3 Тогда
			Разделитель = ".";
		ИначеЕсли Счетчик = 3 Тогда
			Разделитель = "-";
		Иначе
			Разделитель = "";
		КонецЕсли;
	КонецЦикла;

	Пока Счетчик < 3 Цикл
		СемантикВерсия = СемантикВерсия + ".0";
		Счетчик = Счетчик + 1;
	КонецЦикла;

	Возврат СемантикВерсия;

КонецФункции

// Разложить строку в массив слов.
// 
// Параметры:
//  Строка - Строка -  Строка
//  РазделителиСлов - Строка -  Разделители слов
// 
// Возвращаемое значение:
//  Массив из Строка -  Метрика разложить строку в массив слов
Функция РазложитьСтрокуВМассивСлов(Знач Строка, РазделителиСлов = "")

	Слова = Новый Массив;

	Если СтрДлина(РазделителиСлов) = 1 Тогда

		НайденныйСимвол = СтрНайти(Строка, РазделителиСлов);
		Пока НайденныйСимвол > 0 Цикл
			Слова.Добавить(Лев(Строка, НайденныйСимвол - 1));
			Строка = Сред(Строка, НайденныйСимвол + 1);
			НайденныйСимвол = СтрНайти(Строка, РазделителиСлов);
		КонецЦикла;

		Если Не ПустаяСтрока(Строка) Тогда
			Слова.Добавить(Строка);
		КонецЕсли;

	Иначе

		Для Сч = 1 По СтрДлина(РазделителиСлов) Цикл
			Строка = СтрЗаменить(Строка, Сред(РазделителиСлов, Сч, 1), Символы.ПС);
		КонецЦикла;

		Для Сч = 1 По СтрЧислоСтрок(Строка) Цикл
			ТекСлово = СокрЛП(СтрПолучитьСтроку(Строка, Сч));
			Если ТекСлово <> "" Тогда
				Слова.Добавить(ТекСлово);
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	Возврат Слова;

КонецФункции

// Метрика только цифры в строке.
// 
// Параметры:
//  СтрокаПроверки - Произвольный -  Строка проверки
// 
// Возвращаемое значение:
//  Булево -  Метрика только цифры в строке
Функция ТолькоЦифрыВСтроке(СтрокаПроверки)

	Возврат СтрДлина(
	СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
	СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
	СокрЛП(СтрокаПроверки), "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""),
		"9", "")) = 0;

КонецФункции

// Получить структуру сессии.
// 
// Возвращаемое значение:
//  Соответствие из Строка -  Метрика получить структуру сессии
Функция ПолучитьСтруктуруСессии()

	Результат = Новый Соответствие;
	Результат.Вставить("CustomSessionId", Строка(Новый УникальныйИдентификатор));

	Возврат Результат;

КонецФункции

// Получить параметры HTTPЗапроса метрики.
// 
// Возвращаемое значение:
//  См. КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьСтруктуруПараметровHTTPЗапроса
Функция ПолучитьПараметрыHTTPЗапросаМетрики()

	ПараметрыHTTPЗапроса	= КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьСтруктуруПараметровHTTPЗапроса();

	ПараметрыHTTPЗапроса.АдресСервера = "api.kontur.ru";
	ПараметрыHTTPЗапроса.ЗащищенноеСоединение = Истина;
	ПараметрыHTTPЗапроса.ПортСервера = 443;

	Возврат ПараметрыHTTPЗапроса;

КонецФункции

// Адрес для отправки данных о событии.
// 
// Параметры:
//  СтруктураКлиента - Структура - Структура клиента
//  Топик - Строка - Topic
// 
// Возвращаемое значение:
//  Строка -  Адрес для отправки данных о событии
Функция АдресДляОтправкиДанныхОСобытии(СтруктураКлиента, Топик)

	Возврат "/metrika-pipe/v1/sources/1CModule/topics/" + СтруктураКлиента["moduleName"] + "_" + Топик + "/events";

КонецФункции
#КонецОбласти