#Область Интерфейс

Функция ПолучитьСтруктуруОтвета() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Результат", Ложь);
	Результат.Вставить("Данные");
	Результат.Вставить("КодОшибки");
	Результат.Вставить("ТекстОшибки");
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьОшибкуДляВозврата(Ответ, КодОшибки, ТекстОшибки) Экспорт
	
	Ответ.Результат = Ложь;
	Ответ.КодОшибки = КодОшибки;
	Ответ.ТекстОшибки = ТекстОшибки;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьДанныеДляТСД(ПараметрыЗапроса, ПараметрыURL) Экспорт

	Ответ = ПолучитьСтруктуруОтвета();
	
	ТСД = ПолучитьПланОбменаДляТСДПодИД(ПараметрыURL["id"]);
	
	Если НЕ ЗначениеЗаполнено(ТСД) Тогда
		Возврат СформироватьОшибкуДляВозврата(Ответ, 1, СтрШаблон("Не найден ТСД с кодом %1", ПараметрыURL["id"]));
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Выборка = ПланыОбмена.ВыбратьИзменения(ТСД);
	Пока Выборка.Следующий() Цикл
		
		ТекОбъект = Выборка.Получить();
		Если ТипЗнч(ТекОбъект) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			ДанныеДляПередачи = ПолучитьДокументПриобретениеТоваровДляПередачиНаТСД(ТекОбъект);
			Если ДанныеДляПередачи <> Неопределено Тогда
				Результат.Добавить(ДанныеДляПередачи);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ.Результат=Истина;
	Ответ.Данные=Результат;
	
	Возврат Ответ;
	
КонецФункции

Функция ПринятьДанныеОтТСД(ПараметрыЗапроса, ПараметрыURL) Экспорт

	Ответ = ПолучитьСтруктуруОтвета();
	
	Ответ.Результат=Истина;
	//Ответ.Данные=Результат;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область Служебные

Функция ПолучитьПланОбменаДляТСДПодИД(ИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АУ_ТСД.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.АУ_ТСД КАК АУ_ТСД
	|ГДЕ
	|	АУ_ТСД.Код = &Код";
	Запрос.УстановитьПараметр("Код", ИД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДокументПриобретениеТоваровДляПередачиНаТСД(Документ)
	
	Если Документ.ШтрихкодыУпаковок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Номер", Документ.Номер);
	Результат.Вставить("Дата", Документ.Дата);
	Результат.Вставить("Контрагент", Строка(Документ.Контрагент));
	
	Результат.Вставить("Товары", Новый Массив);
	Результат.Вставить("ШтрихкодыУпаковок", Новый Массив);
	
	Для каждого стрТовары Из Документ.Товары Цикл
		
		стрТоварыСтруктура = Новый Структура;
		стрТоварыСтруктура.Вставить("Номенклатура", ПолучитьНоменклатуруДляПередачиНаТСД(стрТовары.Номенклатура));
		стрТоварыСтруктура.Вставить("Количество", стрТовары.КоличествоУпаковок);
		
		Результат.Товары.Добавить(стрТоварыСтруктура);
		
	КонецЦикла;
	
	Для каждого стрШтрихкодУпаковки Из Документ.ШтрихкодыУпаковок Цикл
		
		стрШтрихкодУпаковкиСтруктура = Новый Структура;
		стрШтрихкодУпаковкиСтруктура.Вставить("ШтрихкодУпаковки", Строка(стрШтрихкодУпаковки.ШтрихкодУпаковки));
		стрШтрихкодУпаковкиСтруктура.Вставить("ЗначениеШтрихкода", стрШтрихкодУпаковки.ЗначениеШтрихкода);
		
		Результат.ШтрихкодыУпаковок.Добавить(стрТоварыСтруктура);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНоменклатуруДляПередачиНаТСД(Номенклатура)
	
	Результат = Новый Структура;
	Результат.Вставить("Код", Номенклатура.Код);
	Результат.Вставить("Наименование", Номенклатура.Наименование);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти