
&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма,"АУ_ЗагрузкаИзЭксель","Загрузить из эксель","АУ_ЗагрузкаИзЭксель");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма,"АУ_ЗагрузкаИзЭксель","ФормаКоманднаяПанель",,"АУ_ЗагрузкаИзЭксель",1);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗагрузкаИзЭксель(Кнопка)
	
	ОткрытьФорму("Обработка.АУ_ЗагрузкаДанныхВДокументы.Форма.ЗагрузкаНоменклатурыКонтрагентов",Новый Структура);
	
КонецПроцедуры