#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_СменитьЗаказПоставщику", НСтр("ru = 'Сменить заказ'"), "АУ_СменитьЗаказПоставщику");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(
		ЭтаФорма,
		"АУ_СменитьЗаказПоставщику",
		"ГруппаЗаказ",
		НСтр("ru = 'Сменить заказ'"),
		"АУ_СменитьЗаказПоставщику",
		2);

	Элемент = АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "ТоварыАУ_Шифр", , "Шифр", 1, "Объект.Товары.АУ_Шифр", Новый Структура("Ширина", 7));
	Элементы.Переместить(Элемент, Элементы.Товары, Элементы.ТоварыНоменклатураАртикул);

	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_ЗаполнитьШифрПоЗаказу", "Заполнить шифр по заказу", "АУ_ЗаполнитьШифрПоЗаказу");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ЗаполнитьШифрПоЗаказу", "ТоварыЗаполнить", "Заполнить шифр по заказу", "АУ_ЗаполнитьШифрПоЗаказу", 1);

	АУ_ОбщиеПроцедурыИФункцииСервер.ОтключитьВидимостьНоменклатурыИзАрхиваВФормеДокумента(ЭтаФорма);

	Если Элементы.Найти("ТоварыЗаполнить") <> Неопределено Тогда

		АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_ЗаполнитьХарактеристики", "Заполнить характеристики", "АУ_ЗаполнитьХарактеристики");
		АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ЗаполнитьХарактеристики", "ТоварыЗаполнить", , "АУ_ЗаполнитьХарактеристики", 1);
		АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ЗаполнитьХарактеристики1", "ТоварыКонтекстноеМеню", , "АУ_ЗаполнитьХарактеристики", 1);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АУ_АУ_ПрикрепитьЗаказКСтрокеПосле(Команда)

	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора", , ЭтаФорма, Новый УникальныйИдентификатор, , , Новый ОписаниеОповещения("ПрикрепитьЗаказПоставщикуКСтркоеЗавершение", ЭтаФорма, Новый Структура("КлючСтроки", Элементы.Товары.ТекущаяСтрока)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗаполнитьШифрПоЗаказу(Команда)

	АУ_ЗаполнитьШифрПоЗаказуСервер();

КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗаполнитьХарактеристики(Команда)

	ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора", , ЭтаФорма, Новый УникальныйИдентификатор, , , Новый ОписаниеОповещения("АУ_ЗаполнитьХарактеристикиЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура АУ_СменитьЗаказПоставщику(Элемент)

	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора", , ЭтаФорма, Новый УникальныйИдентификатор, , , Новый ОписаниеОповещения("СменитьЗаказПоставщикуЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура СменитьЗаказПоставщикуЗавершение(Значение, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(Значение) Тогда

		Объект.ЗаказПоставщику = Значение;
		СменитьЗаказПоставщикуСервер();
		Модифицированность = Истина;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СменитьЗаказПоставщикуСервер(НомерСтроки = Неопределено)

	Если НомерСтроки = Неопределено Тогда

		Для каждого стрТовары Из Объект.Товары Цикл

			НайденныеСтроки = Объект.ЗаказПоставщику.Товары.НайтиСтроки(Новый Структура("Номенклатура", стрТовары.Номенклатура));
			Если НайденныеСтроки.Количество()>0 Тогда

				стрТовары.ЗаказПоставщику = Объект.ЗаказПоставщику;
				стрТовары.КодСтроки = НайденныеСтроки[0].КодСтроки;

			КонецЕсли;

		КонецЦикла;

	Иначе

		стрТовары = Объект.Товары[НомерСтроки-1];

		НайденныеСтроки = стрТовары.ЗаказПоставщику.Товары.НайтиСтроки(Новый Структура("Номенклатура", стрТовары.Номенклатура));
		Если НайденныеСтроки.Количество()>0 Тогда

			стрТовары.КодСтроки = НайденныеСтроки[0].КодСтроки;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьЗаказПоставщикуКСтркоеЗавершение(Значение, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(Значение) Тогда

		ТекСтрока = Объект.Товары.НайтиПоИдентификатору(ДопПараметры.КлючСтроки);

		ТекСтрока.ЗаказПоставщику = Значение;
		СменитьЗаказПоставщикуСервер(ТекСтрока.НомерСтроки);
		Модифицированность = Истина;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура АУ_ЗаполнитьШифрПоЗаказуСервер()

	Для каждого стрТовары Из Объект.Товары Цикл

		Если ЗначениеЗаполнено(стрТовары.ЗаказПоставщику) Тогда

			НайденныеСтроки = стрТовары.ЗаказПоставщику.Товары.НайтиСтроки(Новый Структура("КодСтроки,Номенклатура,Характеристика", стрТовары.КодСтроки, стрТовары.Номенклатура, стрТовары.Характеристика));
			Если НайденныеСтроки.Количество()>0 Тогда

				стрТовары.АУ_Шифр = НайденныеСтроки[0].АУ_Шифр;
				Модифицированность = Истина;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗаполнитьХарактеристикиЗавершение(Значение, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(Значение) Тогда

		Для каждого стр Из Элементы.Товары.ВыделенныеСтроки Цикл

			стрТовары = Объект.Товары.НайтиПоИдентификатору(стр);
			Если стрТовары.ХарактеристикиИспользуются Тогда

				стрТовары.Характеристика = Значение;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти
