Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаТрН(Данные, Представление, СтандартнаяОбработка, "7");
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	//МассивОбязательных.Добавить("НаимДокументаОснованияПА");
	//МассивОбязательных.Добавить("НомерДокументаОснованияПА");
	//МассивОбязательных.Добавить("ДатаДокументаОснованияПА");
	//МассивОбязательных.Добавить("СтороныСоставителиДокументаОснованияПА");
	МассивОбязательных.Добавить("АдрВыгруз");
	МассивОбязательных.Добавить("ДатВрНовВыгрПА");
	МассивОбязательных.Добавить("ДатВрПА");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("ДокументЭТРН");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатаИнфПА");
	МассивКлючевых.Добавить("ВрИнфПА");
	
	МассивКлючевых.Добавить("ИдФайлПрвПрием");
	МассивКлючевых.Добавить("ДатФайлПрвПрием");
	МассивКлючевых.Добавить("ВрФайлПрвПрием");
	МассивКлючевых.Добавить("ЭППВ");
	МассивКлючевых.Добавить("ЭПУвПА");
	МассивКлючевых.Добавить("ЭтоВозвратнаяЦепочка");
	
	Возврат МассивКлючевых;
	
КонецФункции

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиПредыдущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ДокументОбъектИлиСсылка.ДокументЭТРН, ТаблицаОшибок);
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		// TODO понять какие сценарии проверки входящего документа
		
	Иначе
		
		// TODO реализовать проверку документа
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ПроверитьОтметки(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьДружбуКонтрагентов(ДокументОбъектИлиСсылка, ТаблицаОшибок);
				
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ДокументЭТРН = Объект.ДокументЭТРН;
	
	Если НЕ ЗначениеЗаполнено(ДокументЭТРН)  Тогда
		
		ТекстОшибки = "Титул не привязан к Документу электронной транспортной накладной";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ДокументЭТРН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		// TODO
		//Если Объект.ОтказВПриемке И не ЗначениеЗаполнено(СокрЛП(Объект.ПричОтк)) Тогда 
		//	
		//	ТекстОшибки = "Укажите причину отказа от приемки";
		//	КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		//	"ПричОтк", КатегорияОшибка, ТекстОшибки, "Указать");
		//	
		//КонецЕсли;
		
		ОбязательныеРеквизитыТРН = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МассивОбязательныхРеквизитов();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыТРН Цикл
			Если НЕ ЗначениеЗаполнено(ДокументЭТРН[ОбязательныйРевизит])  Тогда
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной транспортной накладной";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		// можно не проверять этрн - она была сформирована на этапе Т1
		// Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПроверитьКлючевыеРеквизитыЭтРН(ДокументЭТРН, ТаблицаОшибок);

	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЭППВ)  Тогда
		
		ТекстОшибки = "Не получена подпись перевозчика";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ЭПГО", КатегорияОшибка, ТекстОшибки, "Выполнить обмен");
	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ТрН_Титул7.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	// Основание переадресовки
	
	Если Не ЗначениеЗаполнено(Объект.ИдДокОснПА) 
		И Не ЗначениеЗаполнено(Объект.НаимДокОснПА) 
		И Не ЗначениеЗаполнено(Объект.ДатаДокОснПА) 
		И Не ЗначениеЗаполнено(Объект.СтороныСостДокОснПА) 
		И Не ЗначениеЗаполнено(Объект.ДопСостДокОснПА) Тогда 
	
		ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей документа основания переадресовки.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ИдДокДокОснПА", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;	
		
	Если Не ЗначениеЗаполнено(Объект.ИдДокОснПА) 
		И (ЗначениеЗаполнено(Объект.НаимДокОснПА)
		Или ЗначениеЗаполнено(Объект.НомерДокОснПА) 
		Или ЗначениеЗаполнено(Объект.ДатаДокОснПА)
		Или ЗначениеЗаполнено(Объект.ДопСведДокОснПА)
		Или ЗначениеЗаполнено(Объект.СтороныСостДокОснПА) 
		Или ЗначениеЗаполнено(Объект.ДопСостДокОснПА)) Тогда	
			
		Если Не ЗначениеЗаполнено(Объект.НаимДокОснПА) Тогда 
			
			ТекстОшибки = "Укажите наименование Документа основания переадресовки.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"НаимДокОснПА", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ДатаДокОснПА) Тогда 
			
			ТекстОшибки = "Укажите дату Документа основания переадресовки.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"ДатаДокОснПА", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.СтороныСостДокОснПА) И Не ЗначениеЗаполнено(Объект.ДопСостДокОснПА) Тогда 
			
			ТекстОшибки = "Укажите стороны составители или доп.составителя Документа основания переадресовки.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"СтороныСостДокОснПА", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
			
	КонецЕсли;		
	
	// Новый грузополучатель
	
	Если ЗначениеЗаполнено(Объект.НовГрузПол) Тогда 	
		
		Если Не ЗначениеЗаполнено(Объект.НовГрузПол.ИНН) Тогда 
	
			ТекстОшибки = "Укажите ИНН в новом Грузополучателе.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"НовГрузПол.ИНН", КатегорияОшибка, ТекстОшибки, "Указать");
				
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.НовГрузПол.НаименованиеОрганизацииПолное) Тогда 
	
			ТекстОшибки = "Укажите Полное наименование в новом Грузополучателе.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"НовГрузПол.НаименованиеОрганизацииПолное", КатегорияОшибка, ТекстОшибки, "Указать");
				
		КонецЕсли;
		
		Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефонЗаполнен(Объект.НовГрузПол) Тогда 
	
			ТекстОшибки = "Укажите Телефон нового Грузополучателя.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"НовГрузПол.Телефон", КатегорияОшибка, ТекстОшибки, "Указать");
				
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.НовГрузПол.ИдентификаторУчастникаЭДО) Тогда 
	
			ТекстОшибки = "Укажите Идентификатор участника ЭДО в новом Грузополучателя.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"НовГрузПол.ИдентификаторУчастникаЭДО", КатегорияОшибка, ТекстОшибки, "Указать");
				
		КонецЕсли;
		
	КонецЕсли;
	
	Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПроверитьЗаполнениеАдреса(ТаблицаОшибок, КатегорияОшибка, Объект.АдрВыгруз, "АдрВыгруз", Истина);
			
	// Провдение документа основания
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
	
	//Если Объект.КоличествоМест <> Объект.Товары.Итог("КоличествоМест") Тогда 
	//	ТекстОшибки = "Количество Мест в шапке документа отличается от итога по табличной части грузов";
	//	КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
	//				"КоличествоМест", КатегорияПредупреждение, ТекстОшибки, "Проверить");
	//КонецЕсли;
	

	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьОтметки(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка 		= Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ИмяТЧ = "ОтметкиПА";
	
	Для Каждого Отметка Из Объект.ОтметкиПА Цикл 
		
		ТекущийНомерСтроки = Отметка.НомерСтроки;
		
		Если Не ЗначениеЗаполнено(Отметка.ДатаИВремяОтметки) Тогда
			
			ТекстОшибки = "Укажите Дату отметки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ДатаИВремяОтметки", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Отметка.ОписаниеОбстоятельств) Тогда
			
			ТекстОшибки = "Укажите Описание обстоятельств отметки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОписаниеОбстоятельств", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать описание обстоятельств");
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры	


Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ТрН_Титул7.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

Функция ВсеПереадресации(ДокументЭТрНСсылка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул7.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА КонтурЛогистика_ТрН_Титул7.НовГрузПол = КонтурЛогистика_ТрН_Титул7.ДокументЭТРН.Грузоотправитель
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПереадресацияИлиВозвратКартинка,
	|	КонтурЛогистика_ТрН_Титул7.АдрВыгруз КАК МестоДоставки,
	|	КонтурЛогистика_ТрН_Титул7.НовГрузПол КАК Грузополучатель
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул7 КАК КонтурЛогистика_ТрН_Титул7
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул7.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул7.ДокументЭТРН = &ДокументЭТРН
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтурЛогистика_ТрН_Титул7.Дата";
	
	Запрос.УстановитьПараметр("ДокументЭТРН", ДокументЭТрНСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

#КонецЕсли