#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ТрН_Титул7_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ДатВрПА = ТекущаяДатаСеанса();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();	
		
	КонецЕсли;
	
	НайденныйТ3Приемки = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ3Основную(ДокументЭТРН);
	Если ЗначениеЗаполнено(НайденныйТ3Приемки) Тогда
		ТекСтатусОсновногоТ3 = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(НайденныйТ3Приемки, Истина);
		Если ТекСтатусОсновногоТ3 = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен
			Или ТекСтатусОсновногоТ3 = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
			Или ТекСтатусОсновногоТ3 = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением
			Или ТекСтатусОсновногоТ3 = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена Тогда
			
			ЭтоВозвратнаяЦепочка = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ТрН_Титул7_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
		
КонецПроцедуры

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументЭТРН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлу(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументЭТРН) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти Документ ЭТРН, создание не выполнено");
		
	Иначе
		
		ДокументЭТРН = НайденныйДокументЭТРН;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
		ЗаполнитьПредЗначенияРеквизитов();
		
		// Комментарий - нет в формате минтранса // TODO есть в Диадоке - научиться доставать из ДД 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	// Предыдущий титул может быть любым титулом в цепочке (точно может быть Т2, Т3, Т4)
	// В соотв. с логикой ГИС требуется всегдя ссылаться на Т2 (с учетом исправлений на последнюю редакцию)
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	Если ДанныеЗаполнения.Свойство("СпецСценарий") Тогда
		
		СпецСценарий = ДанныеЗаполнения.СпецСценарий;
		
	ИначеЕсли ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул3")
		И (ПредыдущийТитул.ОтказВПриемке Или ПредыдущийТитул.ПринятьЧастично) Тогда
		
		СпецСценарий = Перечисления.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул7ПослеТитула4;
		
	Иначе
		
		СпецСценарий = Неопределено;
		
	КонецЕсли;
	
	НайденныйДокУчСист = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДокументУчетнойСистемыДляСледующегоТитула(ПредыдущийТитул, СпецСценарий);
	
	Если ЗначениеЗаполнено(НайденныйДокУчСист) Тогда
		ДокументОснование = НайденныйДокУчСист;
	КонецЕсли;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		ДанныеЗаполнения.ТипЛогистика,, СпецСценарий);
	
	ДокументЭТРН = ПредыдущийТитул.ДокументЭТРН;
	
	ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
	ЗаполнитьПредЗначенияРеквизитов();
	
	Если ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул3")
		ИЛИ ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул4") Тогда 
		
		// это возвратный Т7 - мы можем по умолчанию указать нового получателя и новое место - это исходные, откуда ехал груз
		НовГрузПол = ДокументЭТРН.Грузоотправитель;
		АдрВыгруз  = ДокументЭТРН.МестоПогрузки;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда
		ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул) Экспорт
	
	ПервоначальнаВерсияТ2 = ПредыдущийТитул;
	
	НайденнаяПервоначальнаВерсияТ2 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПервоначальнуюВерсиюТ2(ПредыдущийТитул);
	Если НайденнаяПервоначальнаВерсияТ2 <> Неопределено Тогда 
		ПервоначальнаВерсияТ2 = НайденнаяПервоначальнаВерсияТ2;
	Иначе
		ВызватьИсключение "Не найдена первоначальная версия Т2 по " + ПредыдущийТитул;
	КонецЕсли;

	ФайлТитула2 = Справочники.КонтурЛогистика_ФайлыОбмена.ПервыйНеошибочныйФайлДокумента(ПервоначальнаВерсияТ2);
	
	ИдФайлПрвПрием	= СтрЗаменить(ФайлТитула2.ИмяФайла, ".xml", "");
	ДатФайлПрвПрием	= ПервоначальнаВерсияТ2.ДатИнфПрвПрием;
	ВрФайлПрвПрием	= ПервоначальнаВерсияТ2.ВрИнфПрвПрием;
	
	ДвоичныеДанныеПодписи 	= ФайлТитула2.Подпись.Получить();
	ЭППВ 					= Base64Строка(ДвоичныеДанныеПодписи);

КонецПроцедуры

Процедура ЗаполнитьПредЗначенияРеквизитов()
	
	ПредГрузополучатель = ДокументЭТРН.Грузополучатель;
	ПредМестоВыгрузки 	= ДокументЭТРН.МестоДоставки;
	
КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации) Экспорт

	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		//Заполнить ЭтотТитул
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ДокументЭТРН.Перевозчик,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ = КС.XDTO_Вычислить(XDTO, "Документ");
	СодИнфПА = КС.XDTO_Вычислить(XDTO, "Документ.СодИнфПА");
	ОтметПрв = КС.XDTO_Вычислить(СодИнфПА, "ОтметкиПА");
	
	ДатВрПА = КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(КС.XDTO_Вычислить(СодИнфПА, "ДатВрПА"));
	
	ДатаИнфПА 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатаИнфПА"));
	ВрИнфПА 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрИнфПА"));
	
	XDTO_ИдИнфПрвПрием	= КС.XDTO_Вычислить(Документ, "ИдИнфПрвПрием");
	ИдФайлПрвПрием		= КС.XDTO_Вычислить(XDTO_ИдИнфПрвПрием, "ИдФайлПрвПрием");
	ДатФайлПрвПрием		= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO_ИдИнфПрвПрием, "ДатФайлПрвПрием"));
	ВрФайлПрвПрием		= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(XDTO_ИдИнфПрвПрием, "ВрФайлПрвПрием"));
	ЭППВ				= КС.XDTO_Вычислить(XDTO_ИдИнфПрвПрием, "ЭП");
	
	ЭПУвПА 	= КС.XDTO_Вычислить(СодИнфПА, "ИдИнфПрвПрием.ЭПУвПА");
	
	НомИспр		= КС.XDTO_Вычислить(СодИнфПА, "ИспрТрН.НомИспр");
	ДатаИспр	= КС.XDTO_Вычислить(СодИнфПА, "ИспрТрН.ДатаИспр");
	
	НаимДокОснПА 	= КС.XDTO_Вычислить(СодИнфПА, "ОснПА.НаимДок");
	НомерДокОснПА 	= КС.XDTO_Вычислить(СодИнфПА, "ОснПА.НомерДок");
	ДатаДокОснПА 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(СодИнфПА, "ОснПА.ДатаДок"));
	ДопСведДокОснПА = КС.XDTO_Вычислить(СодИнфПА, "ОснПА.ДопСведДок");
	ИдДокОснПА	= КС.XDTO_Вычислить(СодИнфПА, "ОснПА.ИдДок");
	
	МассивСторон =  КС.Конвертировать_ИдРекСостТип_вМассивСторонСоставителей(КС.XDTO_Вычислить(СодИнфПА, "ОснПА.ИдРекСост"));
	Составители = Перечисления.КонтурЛогистика_СтороныСоставители.СоставителиИзМассиваСторон(ДокументЭТРН, МассивСторон);
	
	СтороныСостДокОснПА = Составители.Составитель;
	ДопСостДокОснПА 	= Составители.ДопСоставитель;
	
	НовГрузПол 		= КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(КС.XDTO_Вычислить(СодИнфПА, "НовГрузПол"));
	АдрВыгруз 		= КС.Конвертировать_АдресПользТип_вПунктМаршрутаЛогистика(КС.XDTO_Вычислить(СодИнфПА, "НовПунктВыгр.АдрВыгруз"));
	ДатВрНовВыгрПА 	= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(КС.XDTO_Вычислить(СодИнфПА, "НовПунктВыгр.ДатВрНовВыгрПА"));
	
	СтатПодп_raw = КС.XDTO_Вычислить(Документ, "Подписант.СтатПодп");
	СтатПодп = Перечисления.КонтурЛогистика_СтатусыПодписанта.ЗначениеИзXDTO(СтатПодп_raw);
	
	Должность 	= КС.XDTO_Вычислить(Документ, "Подписант.Должн");
	Фамилия 	= КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Фамилия");
	Имя 		= КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Имя");
	Отчество 	= КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Отчество");
	
	ЕстьОтметкиПА = КонтурЛогистика_ОбработкаДокументовСервер.ЕстьОтметкиПеревозчикаXDTO(ОтметПрв); 
	
	Если ЕстьОтметкиПА Тогда 
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьОтметкиПеревозчикаXDTO(ОтметПрв, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ТрН_Титул7.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ДатаИнфПА = ТекущаяДатаСеанса();
		ВрИнфПА = ТекущаяДатаСеанса();
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ДатаИнфПА, ВрИнфПА);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфПрвПрием и ВрИнфПрвПрием
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	НомерТитула 		= 7; 
	Формат 				= "5.01";
	ТипДокументооборота = "__etrnTitle";
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула);
	GUID = Строка(Новый УникальныйИдентификатор);
	
	ДополнительныеПолучателиФайлаОбмена = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДопПолучателейФайла(ДокументЭТРН);
	
	Если ДополнительныеПолучателиФайлаОбмена.Количество() > 0 Тогда 
		W = 1;
	Иначе
		W = 0;
	КонецЕсли;
	Если ЗначениеЗаполнено(НовГрузПол) Тогда 
		W = 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовГрузПол) Тогда 
		
		XDTO_Файл.ИдПолИной.Добавить(НовГрузПол.ИдентификаторУчастникаЭДО);
		
	КонецЕсли;	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайлаОбмена); 	
	
	Если ДокументЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку И ЗначениеЗаполнено(ДокументЭТРН.ПогрузкуОсуществляет) Тогда 
		ИстинныйГрузоотправитель = ДокументЭТРН.ПогрузкуОсуществляет;
	Иначе
		ИстинныйГрузоотправитель = ДокументЭТРН.Грузоотправитель;
	КонецЕсли;
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаТРН(НомерТитула, 
												ИстинныйГрузоотправитель,
												ДокументЭТРН.Перевозчик,
												ДокументЭТРН.Грузополучатель,
												GUID,
												W); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументЭТРН.Перевозчик, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_Подписант(НомерТитула, ТипДокументооборота, Формат, ПодписантСтруктура);
	КС.XDTO_Подписант_СформироватьСведенияМЧД(НомерТитула, XDTO_Подписант, ПодписантСтруктура, Результат);
		
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, ТипДокументооборота, Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	XDTO_СодИнфПА = КС.XDTO_СодИнфПА(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодИнфПА", XDTO_СодИнфПА);
	
	XDTO_ИдИнфПрвПрием 		= КС.XDTO_ИдИнфПрвПрием_Т7(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфПрвПрием", XDTO_ИдИнфПрвПрием);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
