#Область ПеренесеноСДоработками

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_СменитьЗаказПоставщику", "Сменить заказ", "АУ_СменитьЗаказПоставщику");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_СменитьЗаказПоставщику", "ГруппаКомандыРасшифровки", , "АУ_СменитьЗаказПоставщику", 2);
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_СменитьОснование", "Сменить основание", "АУ_СменитьОснование");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_СменитьОснование", "АУ_ГруппаКомандСменитьОснование", , "АУ_СменитьОснование", 2);
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_УбратьОснование", "Убрать основание", "АУ_УбратьОснование");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_УбратьОснование", "АУ_ГруппаКомандСменитьОснование", , "АУ_УбратьОснование", 2);
	
	СтраницаСтатьиБюджета=АУ_СозданиеЭлементовФормы.СоздатьСтраница(ЭтаФорма,"АУ_СтраницаСтатьиБюджета",Элементы.ГруппаСтраницы,"Аналитика",1);
	
	Колонки = Новый Структура("СтатьяБюджета,  Сумма, НомерКонтракта, Программа, Шифр, ОбъектСтрока, ПризнакРасходов, Комментарий, ЗаказКлиента",
							  "Статья бюджета", "Сумма", "Контракт", "Программа", "Шифр", "Объект", "Признак расходов", "Комментарий", "ЗаказКлиента");
	ТаблицаСтатьиБюджета=АУ_СозданиеЭлементовФормы.СоздатьТаблицаФормы(ЭтаФорма,"АУ_СтатьиБюджета",СтраницаСтатьиБюджета,"Объект.АУ_СтатьиБюджета", Колонки);
	
	//Элементы.АУ_СтатьиБюджетаОбъект.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	
	Элементы.АУ_СтатьиБюджетаСтатьяБюджета.УстановитьДействие("ПриИзменении", "ПриИзмененииСтатьиБюджета");
	Элементы.АУ_СтатьиБюджетаНомерКонтракта.УстановитьДействие("ПриИзменении", "ПриИзмененииНомераКонтракта");
	Элементы.АУ_СтатьиБюджета.УстановитьДействие("ПриНачалеРедактирования", "ПриНачалеРедактированияСтатейБюджета");
	//Элементы.АУ_СтатьиБюджетаОбъект.УстановитьДействие("НачалоВыбора", "НачалоВыбораОбъекта");
	Элементы.АУ_СтатьиБюджетаШифр.УстановитьДействие("ОбработкаВыбора", "ОбработкаВыбораШифра");
	Элементы.АУ_СтатьиБюджета.УстановитьДействие("ПриОкончанииРедактирования", "ПриОкончанииРедактированияАУ_СтатьиБюджета");
	Элементы.АУ_СтатьиБюджетаОбъектСтрока.УстановитьДействие("ОбработкаВыбора", "ОбработкаВыбораОбъекта");
	Элементы.АУ_СтатьиБюджетаОбъектСтрока.УстановитьДействие("НачалоВыбора", "НачалоВыбораОбъекта");
	Элементы.АУ_СтатьиБюджетаОбъектСтрока.УстановитьДействие("АвтоПодбор", "ОбъектСтрокаАвтоПодбор");
	
	Элементы.АУ_СтатьиБюджетаШифр.КнопкаВыпадающегоСписка = Истина;
	Элементы.АУ_СтатьиБюджетаОбъектСтрока.КнопкаВыбора = Истина;
	
	ЗаполнитьСпискиВыбораЭлементов();
	
	ОбновитьЗаголовокСтраницыАналитика();
	
	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(ЭтаФорма, "АУ_ДокументОснование", Новый ОписаниеТипов(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.Реквизиты.ДокументОснование.Тип));
	
	Если Параметры.Ключ.Пустая() Тогда
		АУ_ЗаполнитьСтатьюДДСПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АУ_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.АУ_СтатьиБюджета.Количество()=0 Тогда
		
		Если ЗначениеЗаполнено(ТекущийОбъект.Контрагент.Партнер.АУ_СтатьяБюджета) Тогда
			НоваяСтрока=ТекущийОбъект.АУ_СтатьиБюджета.Добавить();
			НоваяСтрока.СтатьяБюджета=ТекущийОбъект.Контрагент.Партнер.АУ_СтатьяБюджета;
			НоваяСтрока.Сумма=ТекущийОбъект.СуммаДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ХозяйственнаяОперацияПриИзмененииПосле(Элемент)
	АУ_ЗаполнитьСтатьюДДСПоУмолчанию();
КонецПроцедуры

&НаСервере
Процедура АУ_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого стр Из ТекущийОбъект.РасшифровкаПлатежа Цикл
		Если стр.СтатьяДвиженияДенежныхСредств.Пустая() Тогда
			ОбщегоНазначения.СообщитьПользователю("Необходимо заполнить Статью ДДС",,СтрШаблон("Объект.РасшифровкаПлатежа[%1].СтатьяДвиженияДенежныхСредств",Формат(стр.НомерСтроки-1,"ЧГ=")),,Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
&Перед("ХозяйственнаяОперацияПриИзмененииСервер")
Процедура АУ_ХозяйственнаяОперацияПриИзмененииСервер()
	
	ЭтаФорма.АУ_ДокументОснование = Объект.ДокументОснование;
	
КонецПроцедуры

&НаСервере
&После("ХозяйственнаяОперацияПриИзмененииСервер")
Процедура АУ_ХозяйственнаяОперацияПриИзмененииСервер1()
	
	Объект.ДокументОснование = ЭтаФорма.АУ_ДокументОснование;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИОбработчики

&НаКлиенте
Процедура АУ_СменитьЗаказПоставщику(Элемент)
	
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора",,ЭтаФорма,Новый УникальныйИдентификатор,,,Новый ОписаниеОповещения("СменитьЗаказПоставщикуЗавершение",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьОснованиеЗавершение(Значение,ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Объект.ДокументОснование=Значение;
		ЗаполнитьСпискиВыбораЭлементов();
		Модифицированность=Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_СменитьОснование(Элемент)
	
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора",,ЭтаФорма,Новый УникальныйИдентификатор,,,Новый ОписаниеОповещения("СменитьОснованиеЗавершение",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_УбратьОснование(Элемент)
	
	Объект.ДокументОснование=Неопределено;
	Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьЗаказПоставщикуЗавершение(Значение,ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Для каждого стр Из Объект.РасшифровкаПлатежа Цикл
			
			стр.Заказ=Значение;
			
		КонецЦикла;
		
		Модифицированность=Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СменитьЗаказПоставщикуСервер()
	
	//Для каждого стрТовары Из Объект.Товары Цикл
	//	
	//	НайденныеСтроки=Объект.ЗаказПоставщику.Товары.НайтиСтроки(Новый Структура("Номенклатура",стрТовары.Номенклатура));
	//	Если НайденныеСтроки.Количество()>0 Тогда
	//		стрТовары.ЗаказПоставщику=Объект.ЗаказПоставщику;
	//		стрТовары.КодСтроки=НайденныеСтроки[0].КодСтроки;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриНачалеРедактированияСтатейБюджета(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элемент.ТекущиеДанные.Сумма = Объект.СуммаДокумента - Объект.АУ_СтатьиБюджета.Итог("Сумма");
		ЗаполнитьЗначенияВСтрокеСтатейБюджетаПоУмолчанию(Элемент.ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНомераКонтракта(Элемент)
	
	ПриИзмененииНомераКонтрактаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОкончанииРедактированияАУ_СтатьиБюджета(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьЗаголовокСтраницыАналитика();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНомераКонтрактаСервер()
	
	ТекущаяСтрока = Объект.АУ_СтатьиБюджета.НайтиПоИдентификатору(Элементы.АУ_СтатьиБюджета.ТекущаяСтрока);
	МассивЗаказовКлиентов = ПолучитьЗаказыКлиентаИзЗаказаПоставщику();
	
	Для каждого стрЗаказ Из МассивЗаказовКлиентов Цикл
		
		Если стрЗаказ.Договор.АУ_КраткийНомер = ТекущаяСтрока.НомерКонтракта Тогда
			ТекущаяСтрока.ЗаказКлиента = стрЗаказ;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АУ_ТаблицаСоответствияКонтрактовРасходки.Программа КАК Программа,
	|	АУ_ТаблицаСоответствияКонтрактовРасходки.Объект КАК Объект,
	|	АУ_ТаблицаСоответствияКонтрактовРасходки.ОбъектСтрока КАК ОбъектСтрока
	|ИЗ
	|	РегистрСведений.АУ_ТаблицаСоответствияКонтрактовРасходки КАК АУ_ТаблицаСоответствияКонтрактовРасходки
	|ГДЕ
	|	АУ_ТаблицаСоответствияКонтрактовРасходки.НомерКонтракта = &НомерКонтракта";
	
	Запрос.УстановитьПараметр("НомерКонтракта", ТекущаяСтрока.НомерКонтракта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораОбъекта(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//МассивПартнеров = ПолучитьМассивПартнеров();
	//Если МассивПартнеров.Количество() > 0 Тогда
	//	Отбор = Новый Структура("Партнеры", ПолучитьМассивПартнеров());
	//Иначе
	//	Отбор = Новый Структура;
	//КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	ОткрытьФорму("Справочник.АУ_Объекты.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораШифра(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Объект.АУ_СтатьиБюджета.НайтиПоИдентификатору(Элементы.АУ_СтатьиБюджета.ТекущаяСтрока);
	Если ЗначениеЗаполнено(ТекущаяСтрока.Шифр) И СтрНайти(ТекущаяСтрока.Шифр, ВыбранноеЗначение) = 0 Тогда
		ТекущаяСтрока.Шифр = СтрШаблон("%1,%2", ТекущаяСтрока.Шифр, ВыбранноеЗначение);
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущаяСтрока.Шифр) Тогда
		ТекущаяСтрока.Шифр = ВыбранноеЗначение;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораОбъекта(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Объект.АУ_СтатьиБюджета.НайтиПоИдентификатору(Элементы.АУ_СтатьиБюджета.ТекущаяСтрока);
	Если ЗначениеЗаполнено(ТекущаяСтрока.ОбъектСтрока) И СтрНайти(ТекущаяСтрока.ОбъектСтрока, ВыбранноеЗначение) = 0 Тогда
		ТекущаяСтрока.ОбъектСтрока = СтрШаблон("%1,%2", ТекущаяСтрока.ОбъектСтрока, ВыбранноеЗначение);
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущаяСтрока.ОбъектСтрока) Тогда
		ТекущаяСтрока.ОбъектСтрока = ВыбранноеЗначение;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСтатьиБюджета(Элемент)
	
	ПриИзмененииСтатьиБюджетаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтрокаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = АУ_ОбщиеПроцедурыИФункцииВызовСервера.ПолучитьСписокОбъектовДляВыбора(Текст);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ЗаполнитьЗначенияВСтрокеСтатейБюджетаПоУмолчанию(ИДСтроки)
	
	ТекущаяСтрока = Объект.АУ_СтатьиБюджета.НайтиПоИдентификатору(ИДСтроки);
	
	Если Элементы.АУ_СтатьиБюджетаПрограмма.СписокВыбора.Количество() = 1 Тогда
		ТекущаяСтрока.Программа = Элементы.АУ_СтатьиБюджетаПрограмма.СписокВыбора[0].Значение;
	КонецЕсли;
	
	Если Элементы.АУ_СтатьиБюджетаНомерКонтракта.СписокВыбора.Количество() = 1 Тогда
		ТекущаяСтрока.НомерКонтракта = Элементы.АУ_СтатьиБюджетаНомерКонтракта.СписокВыбора[0].Значение;
	КонецЕсли;
	
	МассивЗаказовКлиентов = ПолучитьЗаказыКлиентаИзЗаказаПоставщику();
	Если МассивЗаказовКлиентов.Количество() = 1 Тогда
		ТекущаяСтрока.ЗаказКлиента = МассивЗаказовКлиентов[0];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АУ_ЗаполнитьСтатьюДДСПоУмолчанию()
	
	Если НЕ Объект.Автор.АУ_СтатьяДДС.Пустая() Тогда
			
		Объект.СтатьяДвиженияДенежныхСредств = Объект.Автор.АУ_СтатьяДДС;
		
		Для каждого стр Из Объект.РасшифровкаПлатежа Цикл
			
			стр.СтатьяДвиженияДенежныхСредств = Объект.Автор.АУ_СтатьяДДС;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаказыКлиентаИзЗаказаПоставщику()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПоставщику.ДокументОснование КАК ЗаказКлиента
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&Ссылка)
	|	И ЗаказПоставщику.ДокументОснование ССЫЛКА Документ.ЗаказКлиента
	|	И НЕ ЗаказПоставщику.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПоставщикуТовары.АУ_ЗаказКлиента
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В(&Ссылка)
	|	И НЕ ЗаказПоставщикуТовары.АУ_ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКЛиента.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПоставщику.ДокументОснование.ДокументОснование
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&Ссылка)
	|	И ЗаказПоставщику.ДокументОснование ССЫЛКА Документ.ЗаказНаСборку
	|	И НЕ ЗаказПоставщику.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказНаСборку.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПоставщикуТовары.АУ_ЗаказНаСборку.ДокументОснование
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В(&Ссылка)
	|	И НЕ ЗаказПоставщикуТовары.АУ_ЗаказНаСборку = ЗНАЧЕНИЕ(Документ.ЗаказНаСборку.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&Ссылка)";
	
	МассивЗП = Новый Массив;
	МассивЗП.Добавить(Объект.ДокументОснование);
	Для каждого стрРасшифровкаПлатежа Из Объект.РасшифровкаПлатежа Цикл
		
		Если ТипЗнч(стрРасшифровкаПлатежа.ОбъектРасчетов.Объект) = Тип("ДокументСсылка.ЗаказПоставщику") И ЗначениеЗаполнено(стрРасшифровкаПлатежа.ОбъектРасчетов.Объект) Тогда
			МассивЗП.Добавить(стрРасшифровкаПлатежа.ОбъектРасчетов.Объект);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Ссылка", МассивЗП);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказКлиента");
	
КонецФункции

&НаСервере
Функция ПолучитьМассивПартнеров()
	
	МассивПартнеров = Новый Массив;
	МассивЗаказаовКлиентов = ПолучитьЗаказыКлиентаИзЗаказаПоставщику();
	
	Для каждого стрЗаказ Из МассивЗаказаовКлиентов Цикл
		МассивПартнеров.Добавить(стрЗаказ.Партнер);
	КонецЦикла;
	
	МассивПартнеров = ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(МассивПартнеров);
	
	Возврат МассивПартнеров;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСпискиВыбораЭлементов()
	
	МассивЗаказовКлиентов = ПолучитьЗаказыКлиентаИзЗаказаПоставщику();
	
	Элементы.АУ_СтатьиБюджетаПрограмма.СписокВыбора.Очистить();
	Элементы.АУ_СтатьиБюджетаНомерКонтракта.СписокВыбора.Очистить();
	Элементы.АУ_СтатьиБюджетаЗаказКлиента.СписокВыбора.Очистить();
	Элементы.АУ_СтатьиБюджетаШифр.СписокВыбора.Очистить();
	
	Для каждого стрЗаказ Из МассивЗаказовКлиентов Цикл
		
		Если Элементы.АУ_СтатьиБюджетаПрограмма.СписокВыбора.НайтиПоЗначению(стрЗаказ.АУ_Программа) = Неопределено Тогда
			Элементы.АУ_СтатьиБюджетаПрограмма.СписокВыбора.Добавить(стрЗаказ.АУ_Программа);
		КонецЕсли;
		
		Если Элементы.АУ_СтатьиБюджетаНомерКонтракта.СписокВыбора.НайтиПоЗначению(стрЗаказ.Договор.АУ_КраткийНомер) = Неопределено Тогда
			Элементы.АУ_СтатьиБюджетаНомерКонтракта.СписокВыбора.Добавить(стрЗаказ.Договор.АУ_КраткийНомер);
		КонецЕсли;
		
		Для каждого стрТовары Из стрЗаказ.Товары Цикл
			
			Если ЗначениеЗаполнено(стрТовары.АУ_Шифр) Тогда
				Если Элементы.АУ_СтатьиБюджетаШифр.СписокВыбора.НайтиПоЗначению(стрТовары.АУ_Шифр) = Неопределено Тогда
					Элементы.АУ_СтатьиБюджетаШифр.СписокВыбора.Добавить(стрТовары.АУ_Шифр);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стрТовары.Характеристика) Тогда
				
				Шифр = СокрЛП(стрТовары.Характеристика);
				Если Элементы.АУ_СтатьиБюджетаШифр.СписокВыбора.НайтиПоЗначению(Шифр) = Неопределено Тогда
					Элементы.АУ_СтатьиБюджетаШифр.СписокВыбора.Добавить(Шифр);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Элементы.АУ_СтатьиБюджетаЗаказКлиента.СписокВыбора.Добавить(стрЗаказ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокСтраницыАналитика()
	
	Элементы.АУ_СтраницаСтатьиБюджета.Заголовок = СтрШаблон("Аналитика (%1)", Объект.АУ_СтатьиБюджета.Количество());
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСтатьиБюджетаСервер()
	
	ТекущаяСтрока = Объект.АУ_СтатьиБюджета.НайтиПоИдентификатору(Элементы.АУ_СтатьиБюджета.ТекущаяСтрока);
	ТекущаяСтрока.ПризнакРасходов = ТекущаяСтрока.СтатьяБюджета.ПризнакРасходов;
	
КонецПроцедуры

&НаСервере
&Вместо("ЗаполнитьНазначениеПлатежаСервер")
Процедура АУ_ЗаполнитьНазначениеПлатежаСервер()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
			
			Попытка
				Объект.НазначениеПлатежа = СтрШаблон("Оплата по счету №%1 от %2, договор №%3 от %4, за",
													Объект.ДокументОснование.НомерПоДаннымПоставщика,
													Формат(Объект.ДокументОснование.ДатаПоДаннымПоставщика, "ДФ=dd.MM.yyyy"),
													Объект.РасшифровкаПлатежа[0].Договор.Номер,
													Формат(Объект.РасшифровкаПлатежа[0].Договор.Дата, "ДФ=dd.MM.yyyy"));
			Исключение
				Объект.НазначениеПлатежа = "Оплата по сч №____ от __________, дог №_________ от __________, за '________________'";
			КонецПопытки;
												
		Иначе
			Объект.НазначениеПлатежа = "Оплата по сч №____ от __________, дог №_________ от __________, за '________________'";
		КонецЕсли;
		
		РеквизитыВалюты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Валюта, "Код, Наименование");
		Если РеквизитыВалюты.Код = "643" Тогда
			ВалютаДляПечати = НСтр("ru = 'руб.'");
		Иначе
			ВалютаДляПечати = СокрЛП(РеквизитыВалюты.Наименование);
		КонецЕсли;
		
		ТекстСумма = "Сумма " + Формат(Объект.СуммаДокумента, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=") + " " + ВалютаДляПечати;
		ТекстСуммаНДС = ДенежныеСредстваСервер.ТекстСуммаНДСПлатежа(Объект.Организация, Объект.Валюта, Объект.РасшифровкаПлатежа, Истина);
		Объект.НазначениеПлатежа = Объект.НазначениеПлатежа + Символы.ПС + ТекстСумма + Символы.ПС + ТекстСуммаНДС + " " + ВалютаДляПечати;
		
	Иначе
		ПродолжитьВызов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
&После("УстановитьСписокСтатусов")
Процедура АУ_УстановитьСписокСтатусов()
	
	Если (ПравоСогласования И Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отложена) Тогда
		
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
		
	ИначеЕсли Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отложена Тогда
		
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
		
	КонецЕсли;
	
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отложена);
	
КонецПроцедуры

#КонецОбласти