#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Таблица = АУ_СозданиеЭлементовФормы.СоздатьТаблицаФормы(ЭтаФорма, "АУ_Предметы", ЭтаФорма, "Объект.АУ_Предметы", Новый Структура("Предмет"),, Новый Структура("Выбор", "АУ_ВыборДополнительногоПредмета"));
	Таблица.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	Таблица.Заголовок = "Дополнительные предметы";
	Таблица.ТолькоПросмотр = Истина;
	
	Элементы.АУ_ПредметыКоманднаяПанель.Видимость = Ложь;
	
	Если ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.Задание") И ЗначениеЗаполнено(Объект.БизнесПроцесс) Тогда
		
		Если Объект.БизнесПроцесс.АУ_ВидЗадания = Перечисления.АУ_ВидыЗаданий.УточнениеДатыИсполненияКонтракта Тогда
			
			МассивЗначений = Новый Массив;
			МассивЗначений.Добавить("Не выбрано");
			МассивЗначений.Добавить("Контракт исполнен в срок");
			МассивЗначений.Добавить("Контракт исполнен с просрочкой");
			
			СтруктураСобытий = Новый Структура;
			СтруктураСобытий.Вставить("ПриИзменении", "ПриИзмененииВариантаИсполненияКонтракта");
			
			Группа = АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычнаяБезОтображения(ЭтаФорма, "АУ_ГруппаИсполнениеКонтракта", "ГруппаРезультат", 3, 1,,, "ОписаниеРезультата");
			Переключатель = АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ВариантИсполненияКонтракта", Группа,, 4, "Объект.АУ_ВариантИсполненияКонтракта",, СтруктураСобытий);
			АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ПеренесенныйСрокИсполненияКонтракта", Группа,, 1, "Объект.АУ_ПеренесенныйСрокИсполненияКонтракта");
			
			Переключатель.ВидПереключателя = ВидПереключателя.Тумблер;
			Переключатель.СписокВыбора.Добавить(0, "Не выбрано");
			Переключатель.СписокВыбора.Добавить(1, "Контракт будет исполнен своевременно");
			Переключатель.СписокВыбора.Добавить(2, "Контракт будет исполнен с просрочкой");
			
		КонецЕсли;
		
	КонецЕсли;
	
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_Цвет", "ГруппыШапки",, 1, "Объект.АУ_Цвет");
	
	АУ_УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриИзмененииВариантаИсполненияКонтракта(Элемент)
	
	АУ_УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАУ_Предметы

&НаКлиенте
Процедура АУ_ВыборДополнительногоПредмета(ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.АУ_Предметы.ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПоказатьЗначение(, Элементы.АУ_Предметы.ТекущиеДанные.Предмет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АУ_УстановитьВидимостьДоступность()
	
	Если ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.Задание") И ЗначениеЗаполнено(Объект.БизнесПроцесс) Тогда
		
		Если Объект.БизнесПроцесс.АУ_ВидЗадания = Перечисления.АУ_ВидыЗаданий.УточнениеДатыИсполненияКонтракта Тогда
			
			Элементы.АУ_ПеренесенныйСрокИсполненияКонтракта.Видимость = (Объект.АУ_ВариантИсполненияКонтракта = 2);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
