#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ЗапросДереваСуществующихУпаковок")
Функция АУ_ЗапросДереваСуществующихУпаковок(Параметры)
	
	ЭтоЗаказНаЭмиссию = ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ",       Параметры.Документ);
	Запрос.УстановитьПараметр("ТоварнаяГруппа", Параметры.ТоварнаяГруппа);
	
	ДополнительноеУсловие =
	"	И ПулКодовМаркировки.ШтрихкодУпаковки <> ЗНАЧЕНИЕ(
	|		Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)" + ?(ЗначениеЗаполнено(Параметры.ТоварнаяГруппа), "
	|	И ПулКодовМаркировки.ТоварнаяГруппа = &ТоварнаяГруппа", "");
	
	ДополнитьЗапросКодамиСМРЦ(Запрос, ЭтоЗаказНаЭмиссию, ДополнительноеУсловие);
	
	Запрос.УстановитьПараметр("ПустаяНоменклатура", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Номенклатура"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.КодМаркировки,
	|	Таблица.ХешСуммаКодаМаркировки,
	|	Таблица.КодМаркировкиСМРЦ,
	|	Таблица.ХешСуммаКодаМаркировкиСМРЦ
	|ПОМЕСТИТЬ ТаблицаКодовСМРЦ
	|ИЗ
	|	&ТаблицаКодовСМРЦ КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПулКодовМаркировки.ХешСуммаУпаковки КАК ХешСуммаУпаковки,
	|	ПулКодовМаркировки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ПулКодовМаркировки.Номенклатура КАК Номенклатура,
	|	ПулКодовМаркировки.Характеристика КАК Характеристика,
	|	ПулКодовМаркировки.ТоварнаяГруппа КАК ТоварнаяГруппа,
	|	ВЫБОР
	|		КОГДА ПулКодовМаркировки.Номенклатура = &ПустаяНоменклатура
	|			ТОГДА ПулКодовМаркировки.GTIN
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК GTIN,
	|	ПулКодовМаркировки.Шаблон КАК Шаблон,
	|	ПулКодовМаркировки.СпособВводаВОборот КАК СпособВводаВОборот,
	|	ЕСТЬNULL(ТаблицаКодовСМРЦ.КодМаркировкиСМРЦ, ПулКодовМаркировки.КодМаркировки) КАК КодМаркировки,
	|	ЕСТЬNULL(ТаблицаКодовСМРЦ.ХешСуммаКодаМаркировкиСМРЦ, ПулКодовМаркировки.ХешСуммаКодаМаркировки) КАК ХешСуммаКодаМаркировки,
	|	ВЫБОР
	|		КОГДА ПулКодовМаркировки.ШтрихкодУпаковки.ТипШтрихкода В
	|		(Значение(Перечисление.ТипыШтрихкодов.DataMatrix), Значение(Перечисление.ТипыШтрихкодов.GS1_DataMatrix))
	|		И (ЕСТЬNULL(ТаблицаКодовСМРЦ.КодМаркировкиСМРЦ,
	|				ПулКодовМаркировки.КодМаркировки) <> ПулКодовМаркировки.ШтрихкодУпаковки.ЗначениеШтрихкода
	|			ИЛИ ЕСТЬNULL(ТаблицаКодовСМРЦ.ХешСуммаКодаМаркировкиСМРЦ,
	|				ПулКодовМаркировки.ХешСуммаКодаМаркировки) <> ПулКодовМаркировки.ШтрихкодУпаковки.ХешСуммаЗначенияШтрихкода)
	|			ТОГДА ПулКодовМаркировки.ШтрихкодУпаковки.ЗначениеШтрихкода
	|		Иначе """"
	|	КОНЕЦ КАК ЗначениеШтрихкодаУпаковки,
	|	ВЫБОР
	|		КОГДА ПулКодовМаркировки.ШтрихкодУпаковки.ТипШтрихкода В
	|		(Значение(Перечисление.ТипыШтрихкодов.DataMatrix), Значение(Перечисление.ТипыШтрихкодов.GS1_DataMatrix))
	|		И (ЕСТЬNULL(ТаблицаКодовСМРЦ.КодМаркировкиСМРЦ,
	|				ПулКодовМаркировки.КодМаркировки) <> ПулКодовМаркировки.ШтрихкодУпаковки.ЗначениеШтрихкода
	|			ИЛИ ЕСТЬNULL(ТаблицаКодовСМРЦ.ХешСуммаКодаМаркировкиСМРЦ,
	|				ПулКодовМаркировки.ХешСуммаКодаМаркировки) <> ПулКодовМаркировки.ШтрихкодУпаковки.ХешСуммаЗначенияШтрихкода)
	|			ТОГДА ПулКодовМаркировки.ШтрихкодУпаковки.ХешСуммаЗначенияШтрихкода
	|		Иначе """"
	|	КОНЕЦ КАК ХешСуммаЗначенияШтрихкодаУпаковки,
	|	ВЫБОР
	|		КОГДА ПулКодовМаркировки.ШтрихкодУпаковки.ТипШтрихкода В
	|		(Значение(Перечисление.ТипыШтрихкодов.DataMatrix), Значение(Перечисление.ТипыШтрихкодов.GS1_DataMatrix))
	|			ТОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТаблицаКодовСМРЦ.КодМаркировкиСМРЦ,
	|						ПулКодовМаркировки.КодМаркировки) = ПулКодовМаркировки.ШтрихкодУпаковки.ЗначениеШтрихкода
	|					И ЕСТЬNULL(ТаблицаКодовСМРЦ.ХешСуммаКодаМаркировкиСМРЦ,
	|						ПулКодовМаркировки.ХешСуммаКодаМаркировки) = ПулКодовМаркировки.ШтрихкодУпаковки.ХешСуммаЗначенияШтрихкода
	|					ТОГДА 1 // Набор или Групповая упаковка без логистической упаковки
	|				ИНАЧЕ 2 // Составляющая набора или групповой упаковки
	|			КОНЕЦ
	|		ИНАЧЕ 0 // Потребительская упаковка / Групповая упаковка / Набор, находящиеся в логистической упаковке
	|	КОНЕЦ КАК ПризнакСоставляющей" + ?(Параметры.ДляПечати, ",
	|	ПулКодовМаркировки.ДатаПечатиУниверсальная <> ДАТАВРЕМЯ(1, 1, 1) КАК Распечатан", "") + "
	|ПОМЕСТИТЬ " + ?(Параметры.ДляПечати, "ВТКодыМаркировкиДокумента", "ВТКодыМаркировки") + "
	|ИЗ
	|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКодовСМРЦ КАК ТаблицаКодовСМРЦ
	|		ПО ПулКодовМаркировки.КодМаркировки = ТаблицаКодовСМРЦ.КодМаркировки
	|			И ПулКодовМаркировки.ХешСуммаКодаМаркировки = ТаблицаКодовСМРЦ.ХешСуммаКодаМаркировки
	|ГДЕ
	|	ПулКодовМаркировки." + ?(ЭтоЗаказНаЭмиссию, "ЗаказНаЭмиссию", "ДокументОснование") + " = &Документ
	|	И ПулКодовМаркировки.ШтрихкодУпаковки <> ЗНАЧЕНИЕ(
	|		Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)" + ?(ЗначениеЗаполнено(Параметры.ТоварнаяГруппа), "
	|	И ПулКодовМаркировки.ТоварнаяГруппа = &ТоварнаяГруппа", "") + ?(Параметры.ДляПечати, "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Упаковки.ХешСуммаУпаковки,
	|	Упаковки.ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТШтрихкодыУпаковок
	|ИЗ
	|	(ВЫБРАТЬ
	|		КодыМаркировки.ХешСуммаУпаковки КАК ХешСуммаУпаковки,
	|		КодыМаркировки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|		МАКСИМУМ(КодыМаркировки.Распечатан) КАК Распечатан
	|	ИЗ
	|		ВТКодыМаркировкиДокумента КАК КодыМаркировки
	|	ГДЕ
	|		КодыМаркировки.ПризнакСоставляющей <> 2
	|	СГРУППИРОВАТЬ ПО
	|		КодыМаркировки.ХешСуммаУпаковки,
	|		КодыМаркировки.ШтрихкодУпаковки
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		КодыМаркировки.ХешСуммаУпаковки КАК ХешСуммаУпаковки,
	|		КодыМаркировки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|		МАКСИМУМ(ВложенныеЕдиницы.Распечатан) КАК Распечатан
	|	ИЗ
	|		ВТКодыМаркировкиДокумента КАК ВложенныеЕдиницы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКодыМаркировкиДокумента КАК КодыМаркировки
	|			ПО ВложенныеЕдиницы.ЗначениеШтрихкодаУпаковки = КодыМаркировки.КодМаркировки
	|			И ВложенныеЕдиницы.ХешСуммаЗначенияШтрихкодаУпаковки = КодыМаркировки.ХешСуммаКодаМаркировки
	|	ГДЕ
	|		ВложенныеЕдиницы.ПризнакСоставляющей = 2
	|	СГРУППИРОВАТЬ ПО
	|		КодыМаркировки.ХешСуммаУпаковки,
	|		КодыМаркировки.ШтрихкодУпаковки) КАК Упаковки
	|СГРУППИРОВАТЬ ПО
	|	Упаковки.ХешСуммаУпаковки,
	|	Упаковки.ШтрихкодУпаковки
	#Удаление
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Упаковки.Распечатан) = ЛОЖЬ
	#КонецУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыМаркировки.*
	|ПОМЕСТИТЬ ВТКодыМаркировки
	|ИЗ
	|	ВТКодыМаркировкиДокумента КАК КодыМаркировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|		ПО КодыМаркировки.ХешСуммаУпаковки = ШтрихкодыУпаковок.ХешСуммаУпаковки
	|				И КодыМаркировки.ШтрихкодУпаковки = ШтрихкодыУпаковок.ШтрихкодУпаковки
	|ГДЕ
	|	НЕ ШтрихкодыУпаковок.ХешСуммаУпаковки ЕСТЬ NULL
	#Удаление
	|	ИЛИ КодыМаркировки.ПризнакСоставляющей = 2 И НЕ КодыМаркировки.Распечатан", "") + "
	#КонецУдаления
	#Вставка
	|	ИЛИ КодыМаркировки.ПризнакСоставляющей = 2", "") + "
	#КонецВставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыМаркировки.ХешСуммаУпаковки КАК ХешСуммаУпаковки,
	|	МАКСИМУМ(КодыМаркировки.ШтрихкодУпаковки) КАК ШтрихкодУпаковки,
	|	МАКСИМУМ(КодыМаркировки.ПризнакСоставляющей = 1) КАК БезУпаковки,
	|	КОЛИЧЕСТВО(Различные КодыМаркировки.ШтрихкодУпаковки) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ВТХешСуммыУпаковок
	|ИЗ
	|	ВТКодыМаркировки КАК КодыМаркировки
	|ГДЕ
	|	КодыМаркировки.ПризнакСоставляющей <> 2
	|СГРУППИРОВАТЬ ПО
	|	КодыМаркировки.ХешСуммаУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХешСуммыУпаковок.ХешСуммаУпаковки
	|ПОМЕСТИТЬ ВТПроизвольныеУпаковки
	|ИЗ
	|	ВТХешСуммыУпаковок КАК ХешСуммыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКодыМаркировки КАК КодыМаркировки
	|		ПО ХешСуммыУпаковок.ХешСуммаУпаковки = КодыМаркировки.ХешСуммаУпаковки
	|			И ХешСуммыУпаковок.ШтрихкодУпаковки = КодыМаркировки.ШтрихкодУпаковки
	|			И КодыМаркировки.ПризнакСоставляющей = 0
	|СГРУППИРОВАТЬ ПО
	|	ХешСуммыУпаковок.ХешСуммаУпаковки,
	|	ХешСуммыУпаковок.ШтрихкодУпаковки
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодыМаркировки.Номенклатура) > 1
	|	ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодыМаркировки.Характеристика) > 1
	|	ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодыМаркировки.GTIN) > 1
	|	ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодыМаркировки.Шаблон) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХешСуммыУпаковок.ХешСуммаУпаковки КАК ХешСуммаУпаковки,
	|	ХешСуммыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ХешСуммыУпаковок.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ХешСуммыУпаковок.БезУпаковки КАК БезУпаковки,
	|	НЕ ПроизвольныеУпаковки.ХешСуммаУпаковки ЕСТЬ NULL КАК ПроизвольнаяУпаковка,
	|	История.СоставУпаковки КАК СоставУпаковки" + ?(Параметры.ДляПечати, ",
	|	ШаблоныЭтикеток.СоставУпаковки КАК СоставУпаковкиСШаблономЭтикетки", "") + "
	|ИЗ
	|	ВТХешСуммыУпаковок КАК ХешСуммыУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПроизвольныеУпаковки КАК ПроизвольныеУпаковки
	|		ПО ХешСуммыУпаковок.ХешСуммаУпаковки = ПроизвольныеУпаковки.ХешСуммаУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИспользованияСоставаУпаковкиИСМП КАК История
	|		ПО ХешСуммыУпаковок.ХешСуммаУпаковки = История.ХешСуммаУпаковки" + ?(Параметры.ДляПечати, "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИспользованияШаблонаЭтикеткиУпаковкиИСМП КАК ШаблоныЭтикеток
	|		ПО ХешСуммыУпаковок.ХешСуммаУпаковки = ШаблоныЭтикеток.ХешСуммаУпаковки", "") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыМаркировки.ХешСуммаУпаковки КАК ХешСуммаУпаковки,
	|	КодыМаркировки.Номенклатура КАК Номенклатура,
	|	КодыМаркировки.Характеристика КАК Характеристика,
	|	КодыМаркировки.ТоварнаяГруппа КАК ТоварнаяГруппа,
	|	КодыМаркировки.GTIN КАК GTIN,
	|	КодыМаркировки.Шаблон КАК Шаблон,
	|	КодыМаркировки.СпособВводаВОборот КАК СпособВводаВОборот,
	|	КодыМаркировки.ПризнакСоставляющей КАК ПризнакСоставляющей,
	|	ХешСуммыУпаковок.КоличествоУпаковок КАК КоличествоУпаковок,
	|	КОЛИЧЕСТВО(КодыМаркировки.КодМаркировки) КАК КоличествоВУпаковке,
	|	МАКСИМУМ(КодыМаркировки.ХешСуммаКодаМаркировки) КАК КодМаркировки,
	|	ЕСТЬNULL(КэшОписанияОстатков.Представление, """") КАК ПредставлениеИзКешаОписанияОстатков,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(КодыМаркировки.Номенклатура) КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(КодыМаркировки.Характеристика) КАК ХарактеристикаПредставление
	|ИЗ
	|	ВТКодыМаркировки КАК КодыМаркировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТХешСуммыУпаковок КАК ХешСуммыУпаковок
	|		ПО КодыМаркировки.ХешСуммаУпаковки = ХешСуммыУпаковок.ХешСуммаУпаковки
	|		И КодыМаркировки.ШтрихкодУпаковки = ХешСуммыУпаковок.ШтрихкодУпаковки
	|		И КодыМаркировки.ПризнакСоставляющей <> 2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КэшОписанияОстатковИСМП КАК КэшОписанияОстатков
	|		ПО КодыМаркировки.GTIN = КэшОписанияОстатков.GTIN
	|СГРУППИРОВАТЬ ПО
	|	КодыМаркировки.ХешСуммаУпаковки,
	|	КодыМаркировки.Номенклатура,
	|	КодыМаркировки.Характеристика,
	|	КодыМаркировки.ТоварнаяГруппа,
	|	КодыМаркировки.GTIN,
	|	КодыМаркировки.Шаблон,
	|	КодыМаркировки.СпособВводаВОборот,
	|	КодыМаркировки.ПризнакСоставляющей,
	|	ХешСуммыУпаковок.КоличествоУпаковок,
	|	ЕСТЬNULL(КэшОписанияОстатков.Представление, """")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныеЕдиницы.ХешСуммаУпаковки,
	|	ВложенныеЕдиницы.Номенклатура,
	|	ВложенныеЕдиницы.Характеристика,
	|	ВложенныеЕдиницы.ТоварнаяГруппа,
	|	ВложенныеЕдиницы.GTIN,
	|	ВложенныеЕдиницы.Шаблон,
	|	ВложенныеЕдиницы.СпособВводаВОборот,
	|	ВложенныеЕдиницы.ПризнакСоставляющей,
	|	ХешСуммыУпаковок.КоличествоУпаковок * Количество(Различные КодыМаркировки.ХешСуммаКодаМаркировки),
	|	ВЫРАЗИТЬ(Количество(ВложенныеЕдиницы.КодМаркировки) / Количество(Различные КодыМаркировки.ХешСуммаКодаМаркировки) КАК
	|		ЧИСЛО(10, 0)),
	|	МАКСИМУМ(КодыМаркировки.ХешСуммаКодаМаркировки),
	|	ЕСТЬNULL(КэшОписанияОстатков.Представление, """"),
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВложенныеЕдиницы.Номенклатура),
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВложенныеЕдиницы.Характеристика)
	|ИЗ
	|	ВТКодыМаркировки КАК ВложенныеЕдиницы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКодыМаркировки КАК КодыМаркировки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТХешСуммыУпаковок КАК ХешСуммыУпаковок
	|			ПО КодыМаркировки.ХешСуммаУпаковки = ХешСуммыУпаковок.ХешСуммаУпаковки
	|			И КодыМаркировки.ШтрихкодУпаковки = ХешСуммыУпаковок.ШтрихкодУпаковки
	|		ПО ВложенныеЕдиницы.ХешСуммаУпаковки = КодыМаркировки.ХешСуммаУпаковки
	|		И ВложенныеЕдиницы.ЗначениеШтрихкодаУпаковки = КодыМаркировки.КодМаркировки
	|		И ВложенныеЕдиницы.ХешСуммаЗначенияШтрихкодаУпаковки = КодыМаркировки.ХешСуммаКодаМаркировки
	|		И ВложенныеЕдиницы.ПризнакСоставляющей = 2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КэшОписанияОстатковИСМП КАК КэшОписанияОстатков
	|		ПО ВложенныеЕдиницы.GTIN = КэшОписанияОстатков.GTIN
	|СГРУППИРОВАТЬ ПО
	|	ВложенныеЕдиницы.ХешСуммаУпаковки,
	|	ВложенныеЕдиницы.Номенклатура,
	|	ВложенныеЕдиницы.Характеристика,
	|	ВложенныеЕдиницы.ТоварнаяГруппа,
	|	ВложенныеЕдиницы.GTIN,
	|	ВложенныеЕдиницы.Шаблон,
	|	ВложенныеЕдиницы.СпособВводаВОборот,
	|	ВложенныеЕдиницы.ПризнакСоставляющей,
	|	ХешСуммыУпаковок.КоличествоУпаковок,
	|	ЕСТЬNULL(КэшОписанияОстатков.Представление, """")
	|УПОРЯДОЧИТЬ ПО
	|	ТоварнаяГруппа,
	|	ХешСуммаУпаковки,
	|	КодМаркировки,
	|	ПризнакСоставляющей";
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#КонецЕсли
