///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем".
// ОбщийМодуль.НастройкиПлатежныхСистемКлиент.
// 
// Клиентские методы работы с платежными системами:
//  - создание новой настройки;
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Открывает форму мастера настройки подключения к платежной системе.
// 
// Параметры:
//  ПлатежнаяСистема - Строка - платежная система, для которой необходимо выполнить настройку подключения.
//    Может принимать значения "СистемаБыстрыхПлатежей", "ИнтернетЭквайринг", "ОзонПэй".
//  ПараметрыПодключения - см. НастройкиПлатежныхСистемКлиент.НовыйПараметрыПодключения.
//  ПараметрыФормы - Структура, Неопределено - Параметры формы мастера создания новой настройки.
//
Процедура ПодключитьПлатежнуюСистему(ПлатежнаяСистема, ПараметрыПодключения, ПараметрыФормы = Неопределено) Экспорт
	
	НовыйПараметрыФормы = НовыйПараметрыФормыМастераПлатежнойСистемы();
	Если ПараметрыФормы <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НовыйПараметрыФормы, ПараметрыФормы);
	КонецЕсли;
	
	НастройкиПлатежныхСистемКлиентСобытия.ПриПодключенииПлатежнойСистемы(
		ПлатежнаяСистема,
		ПараметрыПодключения,
		НовыйПараметрыФормы);
	
КонецПроцедуры

// Формирует описание параметров формы мастера создания новой настройки.
//
// Возвращаемое значение:
//  Структура - параметров формы:
//    * РежимРаботы - Строка - идентификатор режима работы формы
//
Функция НовыйПараметрыФормыМастераПлатежнойСистемы() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("РежимРаботы", "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
