#Область ПрограммныйИнтерфейс

#Область Низкоуровневые

// Отправляет готовый титул транспортной накладной с подписью или без нее 
//
// Параметры:
//  ПараметрыСервиса  - Структура - Структура, содержащая параметры сервиса. Например, ApiKey
//  Файлы             - Массив    - Массив, подготовленный файлов
//  ИдентификаторЭТрН - Строка    - Идентификатор ЭТРН в Логистике (transportationId)
// 
// Возвращаемое значение:
//  Результат - содержит kl-id созданной ТрН
//
Функция ОтправитьТитулТрН(Знач ПараметрыСервиса, Знач Файлы, Знач ИдентификаторЭТрН = Неопределено) Экспорт
	
	// /v1/documents/waybill
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	Разделитель = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/v1/documents/waybill";
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);
	
	Если ИдентификаторЭТрН <> Неопределено Тогда
		ПараметрыЗапроса.Параметры.Вставить("transportationId", ИдентификаторЭТрН);
	КонецЕсли;
	
	ПараметрыЗапроса.ТелоЗапроса = ЗакодироватьФайлы(Файлы, Разделитель);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	ЧислоПопыток = 5;
	Для й = 1 По ЧислоПопыток Цикл 
	
		Попытка
			
			Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
			Прервать;
			
		Исключение
			
			// плавающий баг на стороне сервиса
			текОписаниеОшибки = ОписаниеОшибки();
			Если Найти(текОписаниеОшибки, "Object reference not set to an instance of an object") = 0
				Или й = ЧислоПопыток Тогда // получили неизвестную ошибку или последняя попытка тоже неудачна
				ВызватьИсключение текОписаниеОшибки;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ОбработатьРезультатЗапроса(Результат, Ответ, "ТитулТрН");
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьРезультатЗапроса(Результат, Ответ, ТипТитула)
	
	Если Ответ.Свойство("КодОтветаДопустимый") Тогда 
	
		РезультатСтруктура = JsonПрочитать(Ответ.ТелоОтвета);
			
		Результат.Вставить("ТелоОтвета", 			Ответ.ТелоОтвета);
		Результат.Вставить("КодСостояния", 			Ответ.КодОтвета);
		Результат.Вставить("Успешно", 				Ответ.КодОтветаДопустимый);
		
		Если Ответ.КодОтветаДопустимый Тогда
		   		
			Результат.Вставить("РезультатОтправки", РезультатСтруктура);		
			
			Если ТипТитула = "ТитулТрН" Тогда
				Результат.Вставить("transportationId", РезультатСтруктура.Получить("transportationId"));
			ИначеЕсли ТипТитула = "ТитулПЛ" Тогда
				Результат.Вставить("eplId", РезультатСтруктура.Получить("eplId"));
			ИначеЕсли ТипТитула = "ЧерновикТитулаТрН" Тогда
				Результат.Вставить("transportationId", РезультатСтруктура.Получить("transportationId"));
				Результат.Вставить("draftId", РезультатСтруктура.Получить("draftId"));
			КонецЕсли;
			
			ДобавитьДатуОтветаСервиса(Ответ, Результат);
			
		Иначе
			
			Результат.Вставить("ОписаниеОшибки", Ответ.ПодробноеОписаниеОшибки);
			Результат.Вставить("РезультатОтправки", Ответ);
			
		КонецЕсли;
		
	Иначе
		
		Результат.Вставить("Успешно", Ложь);
		Результат.Вставить("ОписаниеОшибки", Ответ.ПодробноеОписаниеОшибки);
		Результат.Вставить("РезультатОтправки", Ответ);	
		
	КонецЕсли;	
	
КонецПроцедуры

// Отправляет готовый титул путевого листа с подписью
//
// Параметры:
//  ПараметрыСервиса  - Структура - Структура, содержащая параметры сервиса. Например, ApiKey
//  Файлы             - Массив    - Массив, подготовленный файлов
// 
// Возвращаемое значение:
//  Результат - См. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ОтправитьТитулПутевогоЛиста(Знач ПараметрыСервиса, Знач Файлы, Знач ИдентификаторЭПЛ = Неопределено) Экспорт
	
	// /v1/documents/epl
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	Разделитель = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "POST";
	ПараметрыЗапроса.АдресМетода = "/v1/documents/epl";
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);
	ПараметрыЗапроса.ТелоЗапроса = ЗакодироватьФайлы(Файлы, Разделитель);
	
	Если ИдентификаторЭПЛ <> Неопределено Тогда
		ПараметрыЗапроса.Параметры.Вставить("eplId", ИдентификаторЭПЛ);
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если ПараметрыЗапроса.Параметры.Свойство("DiadocBoxId") Тогда
		ПараметрыЗапроса.Параметры.Удалить("DiadocBoxId");
	КонецЕсли;
	
	// Для поддержания обработки подряд отправляемых титулов сервис может держать соединение
	// до 60 секунд, пока идет обработка документа
	ПараметрыСервиса.Таймаут = 60;
	
	// Первая попытка
	ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(504);	// Один тайм-аут допускаем
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если Ответ.КодОтвета = 504 Тогда
		// Вторая попытка
		ИндексКода = ПараметрыЗапроса.ДопустимыеКодыОтвета.Найти(504);
		Если ИндексКода <> Неопределено Тогда
			ПараметрыЗапроса.ДопустимыеКодыОтвета.Удалить(ИндексКода);
		КонецЕсли;
		
		Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	КонецЕсли;
	
	ОбработатьРезультатЗапроса(Результат, Ответ, "ТитулПЛ");
	
	Возврат Результат;
	
КонецФункции

// Отправляет черновик транспортной накладной без подписи
//
// Параметры:
//  ПараметрыСервиса  - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
//  Файлы             - Массив    - Массив, подготовленный файлов
//  ИдентификаторЭТрН - Строка    - Идентификатор ЭТРН в Логистике (transportationId)
// 
// Возвращаемое значение:
// 	Результат - содержит kl-id созданной ТрН 
//
Функция ОтправитьНеподписанныйТитулТрН(Знач ПараметрыСервиса, Знач Файлы, Знач ИдентификаторЭТрН = Неопределено, draftAction = Неопределено) Экспорт
	
	// /v1/documents/waybill/draft
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	Разделитель = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод		 = "POST";
	ПараметрыЗапроса.АдресМетода = "/v1/documents/waybill/draft";
	
	Если ИдентификаторЭТрН <> Неопределено И ИдентификаторЭТрН <> "" Тогда 
		ПараметрыЗапроса.Параметры.Вставить("transportationId", ИдентификаторЭТрН);
	КонецЕсли;
	
	Если draftAction <> Неопределено И draftAction <> "" Тогда
		ПараметрыЗапроса.Параметры.Вставить("draftAction", draftAction);
	КонецЕсли;
	
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);
	
	ПараметрыЗапроса.ТелоЗапроса = ЗакодироватьФайлы(Файлы, Разделитель);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	ЧислоПопыток = 5;
	Для й = 1 По ЧислоПопыток Цикл 
	
		Попытка
			
			Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
			Прервать;
			
		Исключение
			
			// плавающий баг на стороне сервиса
			текОписаниеОшибки = ОписаниеОшибки();
			Если Найти(текОписаниеОшибки, "Object reference not set to an instance of an object") = 0
				Или й = ЧислоПопыток Тогда // получили неизвестную ошибку или последняя попытка тоже неудачна
				ВызватьИсключение текОписаниеОшибки;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ОбработатьРезультатЗапроса(Результат, Ответ, "ЧерновикТитулаТрН");
	
	Возврат Результат
	
КонецФункции

// Получает сведения о собственной организации по ApiKey
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
// 
// Возвращаемое значение:
//  Результат - Структура, содержащая данные по организации 
//
Функция ПолучитьСведенияОСобственнойОрганизации(Знач ПараметрыСервиса) Экспорт 
	
	// /v1/organizations/my
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/organizations/my";
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = JsonПрочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Получает сведения о собственной организации
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
// 
// Возвращаемое значение:
//  Результат - Структура, содержащая данные по организации
//
Функция ПолучитьСведенияОСобственнойОрганизацииV2(Знач ПараметрыСервиса) Экспорт 
	
	// /v2/organizations/my
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v2/organizations/my";
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = JsonПрочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Получает данные по организации, в том числе идентификатор fnsParticipantId организации, участника ЭДО, и сведения о роуминге
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey
//	ИНН - ИНН организации
//  КПП - КПП организации. Если пкстой, по будут получены данные только по филиалу.
// 
// Возвращаемое значение:
//  Результат - Структура, содержащая данные по организации 
//
Функция ПолучитьРеквизитыОрганизации(Знач ПараметрыСервиса, ИНН, КПП = Неопределено) Экспорт 
	
	// /v1/organizations/requisites
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/organizations/requisites";
	
	ПараметрыЗапроса.Параметры.Вставить("inn", ИНН);
	
	Если ЗначениеЗаполнено(КПП) Тогда
		ПараметрыЗапроса.Параметры.Вставить("kpp", КПП);
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = JsonПрочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Получает настройки организации
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey
//  diadocBoxId		 - Строка	 - Идентификатор ящика в Диадоке
// 
// Возвращаемое значение:
//  Структура - содержит настройки организации
//
Функция ПолучитьНастройкиОрганизации(Знач ПараметрыСервиса, diadocBoxId) Экспорт
	
	// get /v1/epl/organizations/{diadocBoxId}/settings
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	ПараметрыЗапроса.АдресМетода = "/v1/epl/organizations/{diadocBoxId}/settings";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{diadocBoxId}", diadocBoxId);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Сохранить настройки организации
//
// Параметры:
//  ПараметрыСервиса	 - Структура - Структура, содержащая параметры сервиса. Например, ApiKey
//  diadocBoxId			 - Строка	 - Идентификатор ящика в Диадоке
//  НастройкиОрганизации - Структура	 - Настройки организации
// 
// Возвращаемое значение:
//  Структура - содержит настройки организации
//
Функция СохранитьНастройкиОрганизации(Знач ПараметрыСервиса, diadocBoxId, НастройкиОрганизации) Экспорт
	
	// put /v1/epl/organizations/{diadocBoxId}/settings
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "PUT";
	ПараметрыЗапроса.АдресМетода = "/v1/epl/organizations/{diadocBoxId}/settings";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{diadocBoxId}", diadocBoxId);
	ПараметрыЗапроса.ТелоЗапроса = КонтурЛогистика_СтдJSONКлиентСервер.ЗаписатьЗначение(НастройкиОрганизации);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Получает ленту событий ЭТрН
//
// Параметры:
//  ПараметрыСервиса - Структура 	- Структура, содержащая параметры сервиса. Например, ApiKey 
//  FromId			 - Строка 		- Идентификатор события, с которого продолжить чтение
//  FromDt			 - Дата 		- Значение даты и времени, с которого продолжить чтение. 
//									  Будет использовано, если не указано значение поля FromId
//  Count			 - Число 		- Количество запрашиваемых событий, не больше 1000
// 
// Возвращаемое значение:
//  Результат - содержит массив событий ленты 
//
Функция ПолучитьЛентуСобытий(Знач ПараметрыСервиса, Знач FromId = Неопределено, Знач FromDt = Неопределено, Знач Count = Неопределено) Экспорт 
	
	// /v1/events
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/events";
	
	Если ЗначениеЗаполнено(FromId) Тогда
		ПараметрыЗапроса.Параметры.Вставить("FromId", FromId);
	Иначе
		Если ЗначениеЗаполнено(FromDt) Тогда
			ПараметрыЗапроса.Параметры.Вставить("FromDt", УниверсальнаяДата(FromDt));
		КонецЕсли;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Count) Тогда
		Count = 10;
	КонецЕсли;
	
	ПараметрыЗапроса.Параметры.Вставить("Count", Формат(Count,"ЧГ="));
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = JsonПрочитать(Ответ.ТелоОтвета);
	
	Возврат Результат.Получить("events");
	
КонецФункции

// Получает ленту событий путевых листов
//
// Параметры:
//  ПараметрыСервиса - Структура 	- Структура, содержащая параметры сервиса. Например, ApiKey 
//  FromId			 - Строка 		- Идентификатор события, с которого продолжить чтение
//  FromDt			 - Дата 		- Значение даты и времени, с которого продолжить чтение. 
//									  Будет использовано, если не указано значение поля FromId
//  Count			 - Число 		- Количество запрашиваемых событий, не больше 1000
// 
// Возвращаемое значение:
//  Результат - содержит массив событий ленты
//
Функция ПолучитьЛентуСобытийПутевыхЛистов(Знач ПараметрыСервиса, diadocBoxId, FromId = Неопределено, FromDt = Неопределено, Count = Неопределено) Экспорт
	
	// /v1/epls/news/by-diadoc-box-id/{diadocBoxId}
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/epls/news/by-diadoc-box-id/" + diadocBoxId;
	
	Если ЗначениеЗаполнено(FromId) Тогда
		ПараметрыЗапроса.Параметры.Вставить("afterEventId", FromId);
	Иначе
		Если ЗначениеЗаполнено(FromDt) Тогда
			Результат = ПолучитьИдентификаторСобытияЛентыПутевогоЛиста(ПараметрыСервиса, diadocBoxId, УниверсальнаяДата(FromDt));
			
			ПараметрыЗапроса.Параметры.Вставить("afterEventId", Результат.Получить("eventId"));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Count) Тогда
		Count = 10;
	КонецЕсли;
	
	ПараметрыЗапроса.Параметры.Вставить("Count", Формат(Count,"ЧГ="));
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если ПараметрыЗапроса.Параметры.Свойство("DiadocBoxId") Тогда
		ПараметрыЗапроса.Параметры.Удалить("DiadocBoxId");
	КонецЕсли;
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = JsonПрочитать(Ответ.ТелоОтвета);
	
	Возврат Результат.Получить("events");
	
КонецФункции

// Получает идентификатор события ленты путевого листа по метке времени
//
// Параметры:
//  ПараметрыСервиса - Структура	 - См. КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика
//  BoxId			 - Строка		 - Идентификатор ящика в Диадок
//  TimeStamp		 - Дата			 - Метка времени
// 
// Возвращаемое значение:
//  Результат - содержит смещение, с которого можно продолжить чтение
//
Функция ПолучитьИдентификаторСобытияЛентыПутевогоЛиста(Знач ПараметрыСервиса, Знач BoxId, Знач TimeStamp) Экспорт
	
	// /v1/epls/news/by-diadoc-box-id/{diadocBoxId}/find-eventId-by-timestamp
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/epls/news/by-diadoc-box-id/{diadocBoxId}/find-eventId-by-timestamp";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{diadocBoxId}", BoxId);
	
	ПараметрыЗапроса.Параметры.Вставить("timestamp", TimeStamp);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если ПараметрыЗапроса.Параметры.Свойство("DiadocBoxId") Тогда
		ПараметрыЗапроса.Параметры.Удалить("DiadocBoxId");
	КонецЕсли;
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = JsonПрочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Получает УИД из пула Минтранса
//
// Параметры:
//  ПараметрыСервиса - Структура	- Структура, содержащая параметры сервиса. Например, ApiKey 
// 
// Возвращаемое значение:
//  Результат - содержит УИД Минтранса 
//
Функция ПолучитьУИДИзПулаМинтранса(Знач ПараметрыСервиса) Экспорт 
	
	// /v1/mintransgateway/uuid
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/mintransgateway/uuid";
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = JsonПрочитать(Ответ.ТелоОтвета);
	
	Возврат Результат.Получить("result");
	
КонецФункции

// Получает УИДы из пула Минтранса
//
// Параметры:
//  ПараметрыСервиса - Структура	- Структура, содержащая параметры сервиса. Например, ApiKey 
// 
// Возвращаемое значение:
//  Результат - содержит УИД Минтранса 
//
Функция ПолучитьУИДыИзПулаМинтранса(Знач ПараметрыСервиса, ЗапрашиваемоеКоличество = 1, Знач diadocBoxId = Неопределено) Экспорт
	
	// /v1/mintransgateway/uuids
	// Query parameters:
	// count: integer  <int32>  default: 1
	// diadocBoxId: string
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	ПараметрыЗапроса.АдресМетода = "/v1/mintransgateway/uuids";
	
	ПараметрыЗапроса.Параметры.Вставить("count", ЗапрашиваемоеКоличество);
	Если ЗначениеЗаполнено(diadocBoxId) Тогда
		ПараметрыЗапроса.Параметры.Вставить("diadocBoxId", diadocBoxId);
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = JsonПрочитать(Ответ.ТелоОтвета);
	
	Возврат Результат.Получить("result");
	
КонецФункции

// Получает реестр документов
//
// Параметры:
//  ПараметрыСервиса - Структура	- Структура, содержащая параметры сервиса. Например, ApiKey 
//  Ids				 - Массив 		- Массив идентификаторов перевозок
// 
// Возвращаемое значение:
//  Результат - содержит двоичные данные реестра документов
//
Функция ПолучитьРеестрДокументов(Знач ПараметрыСервиса, Знач Ids) Экспорт 
	
	// /v1/registry
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/registry";
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ПараметрыЗапроса.Параметры.Вставить("Ids", Ids);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

// Получение сведений о перевозках
//
// Параметры:
//  ПараметрыСервиса - Структура	- Структура, содержащая параметры сервиса. Например, ApiKey
//  DateFrom		 - Дата 		- Дата и время начала периода
//  DateTo			 - Дата 		- Дата и время окончания периода. По умолчанию используется текущая дата
//  Status			 - Строка       - Требуемый статус перевозок
//  Skip			 - Число	 	- Количество записей, которые надо пропустить
//  Take			 - Число 		- 
//  TimeKind		 - Строка 		- Тип фильтрации по периоду. По умолчанию - фильтрация по дате изменения.
//								      Принимает значения: "Modified" и "Created" 
//  SortDirection	 - Строка	 	- Способ сортировки. По умолчанию: Descending  
// 									  Принимает значения: "Descending" и "Ascending"
// 
// Возвращаемое значение:
//  Результат - Структура, содержащая сведения о перевозках 
//
Функция ПолучитьСведенияОПеревозках(Знач ПараметрыСервиса, 
									Знач DateFrom = Неопределено, 
									Знач DateTo = Неопределено, 
									Знач Status = Неопределено, 
									Знач Skip = Неопределено, 
									Знач Take = 200, 
									Знач TimeKind = "Modified", 
									Знач SortDirection = "Descending") Экспорт 
	
	// /v1/transportations
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/transportations";
	
	ПараметрыЗапроса.Параметры.Вставить("Take", 			Take);
	ПараметрыЗапроса.Параметры.Вставить("TimeKind", 		TimeKind);
	ПараметрыЗапроса.Параметры.Вставить("SortDirection", 	SortDirection);
	
	Если ЗначениеЗаполнено(DateFrom) Тогда 
		ПараметрыЗапроса.Параметры.Вставить("From", УниверсальнаяДата(DateFrom));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(DateTo) Тогда 
		DateTo = ТекущаяДатаСеанса();
	КонецЕсли;	
	ПараметрыЗапроса.Параметры.Вставить("To", УниверсальнаяДата(DateTo));
		
	Если ЗначениеЗаполнено(Status) Тогда 
		ПараметрыЗапроса.Параметры.Вставить("Status", Status);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Skip) Тогда 
		ПараметрыЗапроса.Параметры.Вставить("Skip", Skip);
	КонецЕсли;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = JsonПрочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Получение сведений о перевозке
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
//  id				 - Строка	 - Идентификатор перевозки
// 
// Возвращаемое значение:
//  Результат - Структура, содержащая сведения о перевозке 
//
Функция ПолучитьСведенияОПеревозке(Знач ПараметрыСервиса, Знач transportationId) Экспорт 
	
	// /v1/transportations/{id}
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/transportations/{transportationId}";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{transportationId}", transportationId);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = JsonПрочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Получение сведений о путевом листе
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
//  eplId			 - Строка	 - Идентификатор путевого листа
// 
// Возвращаемое значение:
//  Результат - Структура, содержащая сведения о перевозке
//
Функция ПолучитьСведенияОПутевомЛисте(Знач ПараметрыСервиса, Знач eplId, ТипДокумента = Неопределено) Экспорт
	
	// /v1/epls/{id}
	// /v2/epls/{id}
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	Если ЗначениеЗаполнено(ТипДокумента) И Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ_5_02(ТипДокумента) Тогда
		// для формата 5.02
		ПараметрыЗапроса.АдресМетода = "/v2/epls/{id}";	
	Иначе
		ПараметрыЗапроса.АдресМетода = "/v1/epls/{id}";
	КонецЕсли;
	
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{id}", eplId);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если ПараметрыЗапроса.Параметры.Свойство("DiadocBoxId") Тогда
		ПараметрыЗапроса.Параметры.Удалить("DiadocBoxId");
	КонецЕсли;
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = JsonПрочитать(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Получение файлов титула ЭТрН
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
//  transportationId - Строка    - Идентификатор перевозки
//  titleId			 - Строка    - Идентификатор
// 
// Возвращаемое значение:
//  РезультатЗапроса - Структура, содержащая двоичные данные 
//
Функция ПолучитьФайлыТитулаЭТрН(Знач ПараметрыСервиса, Знач transportationId, Знач titleId) Экспорт
	
	// /v1/transportations/{transportationId}/titles/{titleId}
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/transportations/{transportationId}/titles/{titleId}";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{transportationId}", transportationId);
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{titleId}", titleId);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

// Получение файлов титула ЭПЛ
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
//  eplId            - Строка    - Идентификатор перевозки
//  titleId          - Строка    - Идентификатор
// 
// Возвращаемое значение:
//  РезультатЗапроса - Структура, содержащая двоичные данные 
//
Функция ПолучитьФайлыТитулаЭПЛ(Знач ПараметрыСервиса, Знач eplId, Знач titleId) Экспорт
	
	// /v1/epls/{id}/titles/{titleId}
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/epls/{id}/titles/{titleId}";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{id}", eplId);
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{titleId}", titleId);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если ПараметрыЗапроса.Параметры.Свойство("DiadocBoxId") Тогда
		ПараметрыЗапроса.Параметры.Удалить("DiadocBoxId");
	КонецЕсли;
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

// Получает печатную форму транспортной накладной
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
//  transportationId - Строка	 - Идеттификатор транспортной накладной
// 
// Возвращаемое значение:
//  Результат - Содержит двоичные данные печатной формы в формате PDF 
//
Функция ПолучитьПечатнуюФормуТранспортнойНакладной(Знач ПараметрыСервиса, Знач transportationId) Экспорт
	
	// /v1/transportations/{transportationId}/print-form
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/transportations/{transportationId}/print-form";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{transportationId}", transportationId);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

// Получает печатную форму путевого листа
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
//  eplId - Строка	 - Идентификатор путевого листа
//  ТипПечатнойФормы - Перечисление.КонтурЛогистика_ТипыПечатныхФормПутыхЛистов	 - тип запрашиваемой печатной формы
// 
// Возвращаемое значение:
//  Результат - Содержит двоичные данные печатной формы в формате PDF 
//
Функция ПолучитьПечатнуюФормуПутевогоЛиста(Знач ПараметрыСервиса, Знач eplId, Знач ТипПечатнойФормы) Экспорт
	
	// /v1/epls/{eplId}/print-form
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/epls/{eplId}/print-form";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{eplId}", eplId);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	ПараметрыЗапроса.Метод = "POST";
	
	ЗначениеТипПечатнойФормы = Перечисления.КонтурЛогистика_ТипыПечатныхФормПутыхЛистов.ЗначениеТипаПечатнойФормы(ТипПечатнойФормы);
	
	// Настройки получения
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("type", ЗначениеТипПечатнойФормы);
	
	ПараметрыЗапроса.ТелоЗапроса = КонтурЛогистика_СтдJSONКлиентСервер.ЗаписатьЗначение(ТелоЗапроса);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если ПараметрыЗапроса.Параметры.Свойство("DiadocBoxId") Тогда
		ПараметрыЗапроса.Параметры.Удалить("DiadocBoxId");
	КонецЕсли;
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

// Получает полный документооборот по перевозке
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
//  transportationId - Строка	 - Идентификатор транспортной накладной
// 
// Возвращаемое значение:
//  Результат - Содержит двоичные данные Документооборота 
//
Функция ПолучитьПолныйДокументооборотПоПеревозке(Знач ПараметрыСервиса, Знач transportationId) Экспорт 
	
	// /v1/transportations/{transportationId}/full-docflow
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/transportations/{transportationId}/full-docflow";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{transportationId}", transportationId);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

// Получает полный документооборот по путевому листу
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса
//  eplId - Строка - Идентификатор путевого листа
//  ТипПечатнойФормы - Перечисление.КонтурЛогистика_ТипыПечатныхФормПутыхЛистов	 - тип запрашиваемой печатной формы
// 
// Возвращаемое значение:
//  Результат - Содержит двоичные данные Документооборота
//
Функция ПолучитьПолныйДокументооборотПоПутевомуЛисту(Знач ПараметрыСервиса, Знач eplId, Знач ТипПечатнойФормы) Экспорт
	
	// /v1/epls/{eplId}/full-docflow
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/epls/{eplId}/full-docflow";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{eplId}", eplId);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	ПараметрыЗапроса.Метод = "POST";
	
	ЗначениеТипПечатнойФормы = Перечисления.КонтурЛогистика_ТипыПечатныхФормПутыхЛистов.ЗначениеТипаПечатнойФормы(ТипПечатнойФормы);
	ТребованияКПФ = Новый Структура("type", ЗначениеТипПечатнойФормы);
	
	// Параметр, указывающий, что в результат нужно включить ЭП
	НужноВключатьЭП = Новый Структура("includeSignatures", Истина);
	
	// Настройки получения
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("includePrintForm", ТребованияКПФ);
	ТелоЗапроса.Вставить("includeTitles", НужноВключатьЭП);
	
	ПараметрыЗапроса.ТелоЗапроса = КонтурЛогистика_СтдJSONКлиентСервер.ЗаписатьЗначение(ТелоЗапроса);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если ПараметрыЗапроса.Параметры.Свойство("DiadocBoxId") Тогда
		ПараметрыЗапроса.Параметры.Удалить("DiadocBoxId");
	КонецЕсли;
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = Ответ.ТелоОтвета;
	
	Возврат Результат;
	
КонецФункции

// Получает QR-код ЭТрН в виде gif-файла
//
// Параметры:
//  ПараметрыСервиса - Структура	- Структура, содержащая параметры сервиса
//  transportationId - Строка		- Идентификатор перевозки
// 
// Возвращаемое значение:
//  Результат - gif-файл
//
Функция ПолучитьQRКодЭТрНGIFФайла(Знач ПараметрыСервиса, Знач transportationId) Экспорт
	
	// /v1/transportations/{transportationId}/qr
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/transportations/{transportationId}/qr";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{transportationId}", transportationId);
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Результат.ТелоОтвета;
	
КонецФункции

// Получает QR-код ЭПЛ в виде gif-файла
//
// Параметры:
//  ПараметрыСервиса - Структура	- Структура, содержащая параметры сервиса
//  transportationId - Строка		- Идентификатор перевозки
// 
// Возвращаемое значение:
//  Результат - gif-файл
//
Функция ПолучитьQRКодЭПЛGIFФайла(Знач ПараметрыСервиса, Знач eplId) Экспорт
	
	// /v1/epls/{eplId}/qr-code
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/epls/{eplId}/qr-code";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{eplId}", eplId);
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если ПараметрыЗапроса.Параметры.Свойство("DiadocBoxId") Тогда
		ПараметрыЗапроса.Параметры.Удалить("DiadocBoxId");
	КонецЕсли;
	
	Результат = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Возврат Результат.ТелоОтвета;
	
КонецФункции

#Область ГСМ

// Получение показаний топлива на выезде
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
//  eplId            - Строка    - Идентификатор перевозки
// 
// Возвращаемое значение:
//  РезультатЗапроса - Структура, содержащая сведения о показаниях топлива
//                     См. КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.НовоеПоказанияТоплива
//
Функция ПолучитьПоказанияТопливаНаВыезде(Знач ПараметрыСервиса, Знач eplId) Экспорт
	
	// get /v1/epls/{eplId}/pre-trip/fuel-readings
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/epls/{eplId}/pre-trip/fuel-readings";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{eplId}", eplId);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Получение показаний топлива на заезде
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
//  eplId            - Строка    - Идентификатор перевозки
// 
// Возвращаемое значение:
//  РезультатЗапроса - Структура, содержащая сведения о показаниях топлива
//                     См. КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.НовоеПоказанияТоплива
//
Функция ПолучитьПоказанияТопливаНаЗаезде(Знач ПараметрыСервиса, Знач eplId) Экспорт
	
	// get /v1/epls/{eplId}/post-trip/fuel-readings
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/epls/{eplId}/post-trip/fuel-readings";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{eplId}", eplId);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Получение информации о заправках
//
// Параметры:
//  ПараметрыСервиса - Структура - Структура, содержащая параметры сервиса. Например, ApiKey 
//  eplId            - Строка    - Идентификатор перевозки
// 
// Возвращаемое значение:
//  РезультатЗапроса - Массив структур, содержащая сведения о показаниях топлива
//                     См. КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.НовоеПоказанияТоплива
//
Функция ПолучитьПолученияИнформацииОЗаправках(Знач ПараметрыСервиса, Знач eplId) Экспорт
	
	// get /v1/epls/{eplId}/refuels
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.АдресМетода = "/v1/epls/{eplId}/refuels";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{eplId}", eplId);
	
	ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные = Истина;
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Сохранение показаний топлива на выезде
//
// Параметры:
//  ПараметрыСервиса  - Структура - Структура, содержащая параметры сервиса. Например, ApiKey
//  eplId             - Строка    - Идентификатор перевозки
//  Показания         - Структура - Показания топлива, см. КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.НовоеПоказанияТоплива
// 
// Возвращаемое значение:
//  Результат - Структура, содержащая сведения о показаниях топлива
//              См. КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.НовоеПоказанияТоплива
//
Функция СохраненитьПоказанияТопливаНаВыезде(Знач ПараметрыСервиса, Знач eplId, Знач Показания, Знач ДатаДанных) Экспорт
	
	// post /v1/epls/{eplId}/pre-trip/fuel-readings
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "POST";
	ПараметрыЗапроса.АдресМетода = "/v1/epls/{eplId}/pre-trip/fuel-readings";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{eplId}", eplId);
	ПараметрыЗапроса.ТелоЗапроса = КонтурЛогистика_СтдJSONКлиентСервер.ЗаписатьЗначение(Показания);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	ПятьМинутВСекундах = 60 * 5;
	Если ТекущаяДатаСеанса() - ДатаДанных < ПятьМинутВСекундах Тогда
		// NotFound допускаем в течении 5 мину, так как накладная могла и не создаться еще
		ПараметрыЗапроса.ДопустимыеКодыОтвета.Добавить(404);
	КонецЕсли;
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если Ответ.КодОтвета = 404 Тогда
		// В следующий раз попытаемся еще раз
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Сохранение показаний топлива на заезде
//
// Параметры:
//  ПараметрыСервиса  - Структура - Структура, содержащая параметры сервиса. Например, ApiKey
//  eplId             - Строка    - Идентификатор перевозки
//  Показания         - Структура - Показания топлива, см. КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.НовоеПоказанияТоплива
// 
// Возвращаемое значение:
//  Результат - Структура, содержащая сведения о показаниях топлива
//              См. КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.НовоеПоказанияТоплива
//
Функция СохраненитьПоказанияТопливаНаЗаезде(Знач ПараметрыСервиса, Знач eplId, Знач Показания) Экспорт
	
	// post /v1/epls/{eplId}/post-trip/fuel-readings
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "POST";
	ПараметрыЗапроса.АдресМетода = "/v1/epls/{eplId}/post-trip/fuel-readings";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{eplId}", eplId);
	ПараметрыЗапроса.ТелоЗапроса = КонтурЛогистика_СтдJSONКлиентСервер.ЗаписатьЗначение(Показания);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

// Сохранение информации о заправке
//
// Параметры:
//  ПараметрыСервиса  - Структура - Структура, содержащая параметры сервиса. Например, ApiKey
//  eplId             - Строка    - Идентификатор перевозки
//  Показания         - Структура - Показания топлива, см. КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.НовоеПоказанияТоплива
// 
// Возвращаемое значение:
//  РезультатЗапроса - Массив структур, содержащая сведения о показаниях топлива
//                     См. КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.НовоеПоказанияТоплива
//
Функция СохраненитьИнформациюОЗаправке(Знач ПараметрыСервиса, Знач eplId, Знач Показания) Экспорт
	
	// post /v1/epls/{eplId}/refuels
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	
	ПараметрыЗапроса.Метод = "POST";
	ПараметрыЗапроса.АдресМетода = "/v1/epls/{eplId}/refuels";
	ПараметрыЗапроса.АдресМетода = СтрЗаменить(ПараметрыЗапроса.АдресМетода, "{eplId}", eplId);
	ПараметрыЗапроса.ТелоЗапроса = КонтурЛогистика_СтдJSONКлиентСервер.ЗаписатьЗначение(Показания);
	
	ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса);
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Результат = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(Ответ.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Подготавливает файлы для отправки
//
// Параметры:
//  ДанныеФайлов - Структура - см. функцию МанифестФайловДляПодготовки
// 
// Возвращаемое значение:
//  Массив - массив подготовленных файлов 
//
Функция ПодготовитьФайлы(ДанныеФайлов) Экспорт 
	
	Результат = Новый Массив;
	
	// Пока апи логистики поддерживает draft (неподписанный) только для Т3
	Если ЗначениеЗаполнено(ДанныеФайлов.ТипДокумента)
		И (ДанныеФайлов.ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3 
			ИЛИ ДанныеФайлов.ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1)
		И Не ЗначениеЗаполнено(ДанныеФайлов.Подпись) Тогда
		
		ИмяФайлаТитула = "draft";
	Иначе
		ИмяФайлаТитула = "formFiles";
	КонецЕсли;
	
	ФайлТитула = Новый Структура;
	ФайлТитула.Вставить("Имя", ИмяФайлаТитула);
	ФайлТитула.Вставить("Данные", ДанныеФайлов.Титул);
	ФайлТитула.Вставить("ИмяФайла", ДанныеФайлов.ИмяФайла + ".xml");
	ФайлТитула.Вставить("Тип", "multipart/form-data");
	
	Результат.Добавить(ФайлТитула);
	
	Если ЗначениеЗаполнено(ДанныеФайлов.Подпись) Тогда
		
		ФайлПодписи = Новый Структура;
		ФайлПодписи.Вставить("Имя", "formFiles");
		ФайлПодписи.Вставить("Данные", ДанныеФайлов.Подпись);
		ФайлПодписи.Вставить("ИмяФайла", ДанныеФайлов.ИмяФайла + ".sig");
		ФайлПодписи.Вставить("Тип", "multipart/form-data");
		
		Результат.Добавить(ФайлПодписи);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МанифестФайловДляПодготовки() Экспорт 
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИмяФайла", 		"");
	Результат.Вставить("ТипДокумента", 	"");
	Результат.Вставить("Титул", 		"");
	Результат.Вставить("Подпись", 		"");
	
	Возврат Результат;
	
КонецФункции	

Функция МанифестПараметрыСервиса(АдресСервераЛогистика) Экспорт
	
	URL_Структура = URL_Структура(АдресСервераЛогистика);
	
	Результат = Новый Структура;
	Результат.Вставить("АвторизацияВыполнена", Ложь);
	Результат.Вставить("ОрганизацияДиадок", Неопределено);
	Результат.Вставить("Схема", URL_Структура.Схема);
	Результат.Вставить("АдресВебСервиса", URL_Структура.Хост);
	Результат.Вставить("Порт", URL_Структура.Порт);
	Результат.Вставить("ApiKey", Неопределено);
	Результат.Вставить("Токен", Неопределено);
	Результат.Вставить("DiadocBoxId", Неопределено);
	Результат.Вставить("НастройкиПрокси", ОписаниеНастроекПрокси());
	Результат.Вставить("Таймаут", КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ТаймаутHTTP"));
	Результат.Вставить("РежимАвторизации", КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РежимАвторизации"));
	
	Возврат Результат;
	
КонецФункции

Функция JsonЗаписать(Значение) Экспорт 
	
	// BSLLS:Typo-off
	НастройкиСериализации = Вычислить("Новый НастройкиСериализацииJSON");
	НастройкиСериализации.ВариантЗаписиДаты		 = Вычислить("ВариантЗаписиДатыJSON.УниверсальнаяДата");	
	НастройкиСериализации.ФорматСериализацииДаты = Вычислить("ФорматДатыJSON.ISO");
	НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
		
	ЗаписьJSON = Вычислить("Новый ЗаписьJSON");
	ЗаписьJSON.УстановитьСтроку();
	
	Выполнить("ЗаписатьJSON(ЗаписьJSON, Значение, НастройкиСериализации, ""ФункцияПреобразованияJson"", КонтурЛогистика_API_Логистика)");	
	// BSLLS:Typo-on
	
	Возврат ЗаписьJSON.Закрыть();	
	
КонецФункции

Функция JsonПрочитать(Значение) Экспорт
	
	ЧтениеJSON = Вычислить("Новый ЧтениеJSON");
	ЧтениеJSON.УстановитьСтроку(Значение);
	
	Результат = Вычислить("ПрочитатьJSON(ЧтениеJSON, Истина)");
	
	Возврат Результат;
	
КонецФункции

// заглушка
Процедура Ошибка_Обработать(Знач ВидОперации, 
							ПодробныйТекстОшибки, 
							ДопИнформация = Неопределено, 
							ТекстСообщения = Неопределено, 
							ИдентификаторФормы = Неопределено, 
							ПолеФормы = Неопределено) Экспорт
	
							
							
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗаголовокАвторизации(ПараметрыСервиса, ПараметрыЗапроса) Экспорт
	
	ЭтоСервисФизическихЛиц = ПараметрыСервиса.Свойство("ЭтоСервисФизическихЛиц");
	
	Если Не ЭтоСервисФизическихЛиц
		И ПараметрыСервиса.РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow Тогда
		
		ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer " + ПараметрыСервиса.Токен);
		
		Если ЗначениеЗаполнено(ПараметрыСервиса.DiadocBoxId) Тогда
			
			Если ПараметрыЗапроса.АдресМетода = "/v1/documents/waybill/draft" Тогда
				ПараметрыЗапроса.Параметры.Вставить("initiatorBoxId", ПараметрыСервиса.DiadocBoxId);
			Иначе
				ПараметрыЗапроса.Параметры.Вставить("DiadocBoxId", ПараметрыСервиса.DiadocBoxId);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыЗапроса.Заголовки.Вставить("x-kontur-apikey", ПараметрыСервиса.ApiKey);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗакодироватьФайлы(Файлы, Разделитель)
	
	МассивЧастей = Новый Массив;
	РазделительСтрок = Символы.ВК + Символы.ПС;
	
	Для Каждого Файл Из Файлы Цикл
		
		Часть = СоздатьПолеФормы(Файл);
		
		МассивЧастей.Добавить(_ПолучитьДвоичныеДанныеИзСтроки("--" + Разделитель + РазделительСтрок, "windows-1251"));
		МассивЧастей.Добавить(_ПолучитьДвоичныеДанныеИзСтроки(ЗаголовкиВСтроку(Часть.Заголовки), "windows-1251"));
		МассивЧастей.Добавить(Часть.Данные);
		МассивЧастей.Добавить(_ПолучитьДвоичныеДанныеИзСтроки(РазделительСтрок, "windows-1251"));
		
	КонецЦикла;
	
	МассивЧастей.Добавить(_ПолучитьДвоичныеДанныеИзСтроки("--" + Разделитель + "--" + РазделительСтрок, "windows-1251"));	

	Возврат _СоединитьДвоичныеДанные(МассивЧастей);
	
КонецФункции

Функция СоздатьПолеФормы(ИсходныеПараметры)
	
	Поле = Новый Структура("Имя,ИмяФайла,Данные,Тип,Заголовки");
	Поле.Имя = ИсходныеПараметры.Имя;
	Поле.Данные = ИсходныеПараметры.Данные;
	
	Поле.Тип = ПолучитьЗначениеПоКлючу(ИсходныеПараметры, "Тип");
	Поле.Заголовки = ПолучитьЗначениеПоКлючу(ИсходныеПараметры, "Заголовки", Новый Соответствие);
	Поле.ИмяФайла = ПолучитьЗначениеПоКлючу(ИсходныеПараметры, "ИмяФайла");
	
	Ключ = "Content-Disposition";
	Если ПолучитьЗначениеЗаголовка("content-disposition", Поле.Заголовки, Ключ) = Ложь Тогда
		Поле.Заголовки.Вставить("Content-Disposition", "form-data");
	КонецЕсли;
	
	Части = Новый Массив;
	Части.Добавить(Поле.Заголовки[Ключ]);
	Части.Добавить(СтрЗаменить("name=""%1""", "%1", Поле.Имя));
	Если ЗначениеЗаполнено(Поле.ИмяФайла) Тогда
		Части.Добавить(СтрЗаменить("filename=""%1""", "%1", Поле.ИмяФайла));
	КонецЕсли;
	
	Поле.Заголовки[Ключ] = СоединитьВXML(Части, "; ");
	Поле.Заголовки["Content-Type"] = Поле.Тип;
	
	Возврат Поле;
	
КонецФункции

Функция ПолучитьЗначениеПоКлючу(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство(Ключ) Тогда
		Значение = Структура[Ключ];
	ИначеЕсли ТипЗнч(Структура) = Тип("Соответствие") И Структура.Получить(Ключ) <> Неопределено Тогда
		Значение = Структура.Получить(Ключ);
	Иначе
		Значение = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция _ПолучитьДвоичныеДанныеИзСтроки(Строка, КодировкаТекста_ = "windows-1251", ЗаписатьBOM = Ложь)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	Если ЗаписатьBOM Тогда
		ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста_);	
	Иначе	
		ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста.ANSI);	
	КонецЕсли;
	ЗаписьТекста.Закрыть();
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста_,, Истина, Символы.ПС);
	ЗаписьТекста.Записать(Строка);
	ЗаписьТекста.Закрыть();
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ДвоичныеДанные;
	
КонецФункции

Функция ЗаголовкиВСтроку(Заголовки)
	
	РазделительСтрок = Символы.ВК + Символы.ПС;
	Строки = Новый Массив;
	
	СортированныеЗаголовки = "Content-Disposition,Content-Type,Content-Location";
	Для Каждого Ключ Из РазделитьСтроку(СортированныеЗаголовки, ",") Цикл
		Значение = ПолучитьЗначениеЗаголовка(Ключ, Заголовки);
		Если Значение <> Ложь И ЗначениеЗаполнено(Значение) Тогда
			Строки.Добавить(Ключ + ": " + Значение);
		КонецЕсли;
	КонецЦикла;
	
	Ключи = РазделитьСтроку(ВРег(СортированныеЗаголовки), ",");
	Для Каждого Заголовок_ Из Заголовки Цикл
		Если Ключи.Найти(ВРег(Заголовок_.Ключ)) = Неопределено Тогда
			Строки.Добавить(Заголовок_.Ключ + ": " + Заголовок_.Значение);
		КонецЕсли;
	КонецЦикла;
	Строки.Добавить(РазделительСтрок);
	
	Возврат СоединитьВXML(Строки, РазделительСтрок);
	
КонецФункции

Функция _СоединитьДвоичныеДанные(МассивДвоичныхДанных) Экспорт
	
	// Аналог СоединитьДвоичныеДанные для 8.2
	
	МассивИменДвоичныхДанных = Новый Массив;
	
	Для Каждого Элемент Из МассивДвоичныхДанных Цикл
			
		// BSLLS:MissingTemporaryFileDeletion-off
		// Диагностика не находит удаления		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();	
		// BSLLS:MissingTemporaryFileDeletion-on	
		МассивИменДвоичныхДанных.Добавить(ИмяВременногоФайла);
		
		Элемент.Записать(ИмяВременногоФайла);		
		
	КонецЦикла;
	
	ИмяВременногоФайлаРезультат = ПолучитьИмяВременногоФайла();
	
	ОбъединитьФайлы(МассивИменДвоичныхДанных, ИмяВременногоФайлаРезультат);	
	
	ДвоичныеДанныеСоединенные = Новый ДвоичныеДанные(ИмяВременногоФайлаРезультат);
	
	// Удаление файлов
	
	УдалитьФайлы(ИмяВременногоФайлаРезультат);	
	Для Каждого ИмяВременногоФайла Из МассивИменДвоичныхДанных Цикл
		УдалитьФайлы(ИмяВременногоФайла);	
	КонецЦикла;
	
	Возврат ДвоичныеДанныеСоединенные;
	
КонецФункции

Функция СоединитьВXML(Строки, Разделитель = "") Экспорт
                
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку(); 

	ЭтоМассивСтрок = Истина;
	ЭтоПерваяСтрока = Истина;
	Для Каждого Элемент Из Строки Цикл
		
		Строка = Элемент;
		Если ЭтоПерваяСтрока Тогда
			Запись.ЗаписатьБезОбработки(Строка);
			ЭтоПерваяСтрока = Ложь;
		Иначе
			Запись.ЗаписатьБезОбработки(Разделитель);
			Запись.ЗаписатьБезОбработки(Строка);           
		КонецЕсли;
	               
	КонецЦикла;

	Возврат Запись.Закрыть();

КонецФункции

Функция ПолучитьЗначениеЗаголовка(Заголовок_, ВсеЗаголовки, Ключ = Неопределено)
	
	Для Каждого ОчереднойЗаголовок Из ВсеЗаголовки Цикл
		Если НРег(ОчереднойЗаголовок.Ключ) = НРег(Заголовок_) Тогда
			Ключ = ОчереднойЗаголовок.Ключ;
			Возврат ОчереднойЗаголовок.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция УниверсальнаяДата(ДатаВремя)
	
	УниверсальнаяДата = УниверсальноеВремя(ДатаВремя);
	
	Возврат Формат(УниверсальнаяДата, "ДФ=yyyy-MM-ddTHH:mm:ssZ");
	
КонецФункции

Функция ВСтрокеТолькоЦифры(Строка)
	
	Результат = Истина;
	
	КодСимвола0 = КодСимвола("0");
	КодСимвола9 = КодСимвола("9");
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Для Сч = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Строка, Сч);
		
		Если КодСимвола < КодСимвола0
			Или КодСимвола > КодСимвола9 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеНастроекПрокси() 
	
	Настройки = Новый Структура;
	
	Настройки.Вставить("ПроксиИспользовать");
	Настройки.Вставить("РежимПрокси");
	Настройки.Вставить("АдресПроксиСервера");
	Настройки.Вставить("ПортПроксиСервера");
	Настройки.Вставить("ЛогинПроксиСервера");
	Настройки.Вставить("ПарольПроксиСервера");
	
	Возврат Настройки;
	
КонецФункции

// Разбирает строку URI на составные части и возвращает их в виде структуры
// На основе RFC 3986 (метод из БСП)
//
// Параметры:
//  СтрокаURI - Строка - ссылка на ресурс в формате:
//                       <схема>://<логин>:<пароль>@<хост>:<порт>/<путь>?<параметры>#<якорь>.
//
// Возвращаемое значение:
//  Структура - составные части URI согласно формату:
//   * Схема         - Строка - схема из URI.
//   * Логин         - Строка - логин из URI.
//   * Пароль        - Строка - пароль из URI.
//   * ИмяСервера    - Строка - часть <хост>:<порт> из URI.
//   * Хост          - Строка - хост из URI.
//   * Порт          - Строка - порт из URI.
//   * ПутьНаСервере - Строка - часть <путь>?<параметры>#<якорь> из URI.
//
Функция URL_Структура(Знач СтрокаURI) Экспорт
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	
	// Строка соединения и путь на сервере.
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
	
	// Информация пользователя и имя сервера.
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = Найти(СтрокаСоединения, "@");
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = Найти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
		Если Не ВСтрокеТолькоЦифры(Порт) Тогда
			Порт = "";
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(ПустаяСтрока(Порт), Неопределено, Число(Порт)));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;

	
КонецФункции

// Разделяет строку на части по указанным символам-разделителям.
// По аналогии с глобальным методом СтрРазделить, добавленным в платформу версии 8.3.6.
//
// Параметры:
//  Строка         - Строка - разделяемая строка;
//  Разделитель    - Строка - строка символов, каждый из которых является индивидуальным разделителем;
//  ВключатьПустые - Булево - Ложь, если пустые части строки включать в результат не нужно.
// 
// Возвращаемое значение:
//   Массив - массив со строками, которые получились в результате разделения исходной строки.
//
Функция РазделитьСтроку(Знач Строка, Разделитель = ",", ВключатьПустые = Истина)
	
	Результат = Новый Массив;
	
	МассивРазделителей = Новый Массив;
	
	Для Сч = 1 По СтрДлина(Разделитель) Цикл
		СимволРазделителя = Сред(Разделитель, Сч, 1);
		МассивРазделителей.Добавить(СимволРазделителя);
	КонецЦикла;
	
	Пока Истина Цикл
		
		Поз = 0;
		
		Для Каждого СимволРазделителя Из МассивРазделителей Цикл
			
			Поз = Найти(Строка, СимволРазделителя);
			
			Если Поз > 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Поз = 0 Тогда
			Подстрока	 = СокрЛП(Строка);
			Строка		 = "";
		Иначе
			Подстрока	 = СокрЛП(Лев(Строка, Поз - 1));
			Строка		 = Сред(Строка, Поз + 1);
		КонецЕсли;
		
		Если ВключатьПустые ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать; // Нет разделителя, за которым могла бы быть следующая часть строки.
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьДатуОтветаСервиса(Знач Ответ, Результат)
	
	ДатаОтветаСервисаМСК = Неопределено;
	
	Попытка
		ДатаОтвета = Ответ.Заголовки["Date"];
	Исключение
		ДатаОтвета = Неопределено;
	КонецПопытки;
	
	Если ДатаОтвета <> Неопределено Тогда
		
		Попытка
			УниверсальноеВремяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДатаRFC1123(ДатаОтвета);
			ДатаОтветаСервисаМСК = МестноеВремя(УниверсальноеВремяСобытия, "GMT+3");
		Исключение
			НичегоНеДелаем = Истина;
		КонецПопытки;
		
	КонецЕсли;
	
	Результат.Вставить("ДатаОтветаСервисаМСК", ДатаОтветаСервисаМСК);
	
КонецПроцедуры

#КонецОбласти
