// @strict-types
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НаименованиеОбъектаЗакупки = Параметры.НаименованиеОбъектаЗакупки;
	ТЗХарактеристики = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыХарактеристик);
	Если ЗначениеЗаполнено(ТЗХарактеристики) И ТипЗнч(ТЗХарактеристики) = Тип("ТаблицаЗначений") Тогда
		Характеристики.Загрузить(ТЗХарактеристики);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти