#Область СлужебныйПрограммныйИнтерфейс

Процедура СохранитьПолныйКодМаркировкиВПулПриСканированииСуществующего(ДанныеШтрихкода, ПараметрыСканирования) Экспорт
	
	ДанныеШтрихкодаПолные = ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьДанныеШтрихкода(ПараметрыСканирования);
	ДанныеШтрихкодаПолные.Штрихкод       = ДанныеШтрихкода.Штрихкод;
	ДанныеШтрихкодаПолные.ШтрихкодBase64 = ДанныеШтрихкода.ПолныйКодМаркировки;
	
	Если ДанныеШтрихкода.Свойство("ДанныеРазбора") Тогда
		ЗаполнитьЗначенияСвойств(ДанныеШтрихкодаПолные, ДанныеШтрихкода.ДанныеРазбора);
		ЗаполнитьЗначенияСвойств(ДанныеШтрихкодаПолные, ДанныеШтрихкода.ДанныеРазбора.СоставКодаМаркировки);
	КонецЕсли;
	
	РегистрыСведений.ПулКодовМаркировкиСУЗ.ЗаписатьДанныеКодаМаркировки(
		ДанныеШтрихкодаПолные,
		ПараметрыСканирования);
	
КонецПроцедуры

Функция КомплектующиеНаборов(НоменклатураНабора, ХарактеристикаНабора, GTIN) Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	
	ЭлементДанных = Новый Структура;
	ЭлементДанных.Вставить("НомерСтроки",        1);
	ЭлементДанных.Вставить("Номенклатура",       НоменклатураНабора);
	ЭлементДанных.Вставить("Характеристика",     ХарактеристикаНабора);
	ЭлементДанных.Вставить("GTIN",               GTIN);
	ЭлементДанных.Вставить("Упаковка",           Неопределено);
	ЭлементДанных.Вставить("КоличествоУпаковок", 1);
	ЭлементДанных.Вставить("Количество",         1);
	
	Наборы = Новый Массив;
	Наборы.Добавить(ЭлементДанных);
	
	КомплектующиеНаборов = ИнтеграцияИСМП.КомплектующиеНаборов(Наборы);
	
	Для Каждого ЭлементНабора Из КомплектующиеНаборов Цикл
		
		ЭлементДанных = Новый Структура;
		ЭлементДанных.Вставить("Номенклатура",   ЭлементНабора.Номенклатура);
		ЭлементДанных.Вставить("Характеристика", ЭлементНабора.Характеристика);
		ЭлементДанных.Вставить("Количество",     ЭлементНабора.Количество);
		
		ВозвращаемоеЗначение.Добавить(ЭлементДанных);
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ВесПоGTIN(СписокGTIN, ПараметрыСканирования) Экспорт
	
	Если СписокGTIN.Количество() = 0 Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	ШтрихкодEAN = Новый Массив;
	
	GTINEAN = Новый Соответствие;
	EANGTIN = Новый Соответствие;
	Для Каждого GTIN Из СписокGTIN Цикл
		Если GTINEAN[GTIN] = Неопределено Тогда
			EAN = РазборКодаМаркировкиИССлужебныйКлиентСервер.ШтрихкодEANИзGTIN(GTIN);
			ШтрихкодEAN.Добавить(EAN);
			GTINEAN[GTIN] = EAN;
			EANGTIN[EAN]  = GTIN;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеПоШтрихкодамEANРезультат = ШтрихкодированиеОбщегоНазначенияИС.ДанныеПоШтрихкодамEAN(ШтрихкодEAN, ПараметрыСканирования, GTINEAN);
	ДанныеПоШтрихкодамEAN = ДанныеПоШтрихкодамEANРезультат.ДанныеПоШтрихкодамEAN;
	
	Результат = Новый Соответствие;
	
	Для Каждого СтрокаТЧ Из ДанныеПоШтрихкодамEAN Цикл
		Если СтрокаТЧ.Количество > 0 Тогда
			Результат.Вставить(EANGTIN[СтрокаТЧ.ШтрихкодEAN], СтрокаТЧ.Коэффициент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеНоменклатуры(Номенклатура) Экспорт
	Возврат ИнтеграцияИСМП.ДанныеНоменклатуры(Номенклатура);
КонецФункции

Функция КоличествоПотребительскихУпаковокПоGTIN(ДанныеДляРасчетаПоGTIN, ПараметрыСканирования) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии",          Ложь);
	ВозвращаемоеЗначение.Вставить("КоличествоПотребительскихУпаковокПоGTIN", Неопределено);
	
	СписокДляПолученияВеса = Новый Массив;
	СписокДляПолученияИзСервиса = Новый Массив;
	Номенклатура = Новый Массив;
	
	Для Каждого КлючИЗначение Из ДанныеДляРасчетаПоGTIN Цикл
		GTIN = КлючИЗначение.Ключ;
		Если КлючИЗначение.Значение.ТребуетВзвешивания Тогда
			СтруктураДляЗапроса = Новый Структура("GTIN, Номенклатура, Количество");
			ЗаполнитьЗначенияСвойств(СтруктураДляЗапроса, КлючИЗначение.Значение);
			СтруктураДляЗапроса.GTIN = GTIN;
			СписокДляПолученияИзСервиса.Добавить(СтруктураДляЗапроса);
			Номенклатура.Добавить(КлючИЗначение.Значение.Номенклатура);
		Иначе
			СписокДляПолученияВеса.Добавить(GTIN);
		КонецЕсли;
		
	КонецЦикла;
	
	ЕдиницаИзмеренияКилограмм = ИнтеграцияИСКлиентСерверПовтИсп.ЕдиницаИзмеренияКилограмм();
	
	КоэффициентыУпаковокНоменклатуры = Новый Соответствие();
	
	ИнтеграцияИСПереопределяемый.ПриОпределенииКоэффициентовУпаковки(ЕдиницаИзмеренияКилограмм,  Номенклатура, КоэффициентыУпаковокНоменклатуры);
	
	АнализируемыеGTIN = Новый Массив;
	
	Для Каждого Строка Из СписокДляПолученияИзСервиса Цикл
		
		ДанныеКоэффициента = КоэффициентыУпаковокНоменклатуры.Получить(Строка.Номенклатура);
		КоэффициентКилограммВГраммы = 1000;
		Если ДанныеКоэффициента <> Неопределено Тогда
			
			ДанныеДляРасчета = Новый Структура("GTIN, Вес");
			ДанныеДляРасчета.GTIN = Строка.GTIN;
			ДанныеДляРасчета.Вес = Формат(
				КоэффициентКилограммВГраммы * ДанныеКоэффициента.Коэффициент * Строка.Количество,
				"ЧН=0; ЧГ=0");
			АнализируемыеGTIN.Добавить(ДанныеДляРасчета);
			
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоПотребительскихУпаковокПоGTIN = Новый Соответствие();
	
	Если АнализируемыеGTIN.Количество() > 0 Тогда
		
		РезультатСервиса = ИнтерфейсИСМП.КоличествоПотребительскихУпаковокНаОснованииВеса(
			ПараметрыСканирования.Организация, Неопределено, АнализируемыеGTIN);
		
		Если РезультатСервиса.ТребуетсяОбновлениеКлючаСессии Тогда
			ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			Возврат ВозвращаемоеЗначение;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатСервиса.ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(РезультатСервиса.ТекстОшибки);
			Возврат ВозвращаемоеЗначение;
		КонецЕсли;
		
		Для Каждого GTIN Из ДанныеДляРасчетаПоGTIN Цикл
			ДанныеИзСервиса = РезультатСервиса.КоличествоПотребительскихУпаковок.Получить(GTIN.Ключ);
			Если ДанныеИзСервиса = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеДляЗаполнения = Новый Структура("КоличествоВложенныхЕдиниц, КоличествоПодобрано");
			ДанныеДляЗаполнения.КоличествоВложенныхЕдиниц = ДанныеИзСервиса;
			ДанныеДляЗаполнения.КоличествоПодобрано       = GTIN.Значение.Количество;
			КоличествоПотребительскихУпаковокПоGTIN.Вставить(GTIN.Ключ, ДанныеДляЗаполнения);
		КонецЦикла;
		
	КонецЕсли;
	
	ВесаПоGTIN = ВесПоGTIN(СписокДляПолученияВеса, ПараметрыСканирования);
	
	Для Каждого GTIN Из ДанныеДляРасчетаПоGTIN Цикл
		
		Если GTIN.Значение.ТребуетВзвешивания Тогда
			Продолжить;
		КонецЕсли;
		
		Вес = ВесаПоGTIN[GTIN.Ключ];
		
		Если Вес = Неопределено Или Вес = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеДляЗаполнения = Новый Структура("КоличествоВложенныхЕдиниц, КоличествоПодобрано");
		ДанныеДляЗаполнения.КоличествоВложенныхЕдиниц = Окр(GTIN.Значение.Количество / Вес, 0);
		ДанныеДляЗаполнения.КоличествоПодобрано       = Окр(ДанныеДляЗаполнения.КоличествоВложенныхЕдиниц * Вес, 3);
		
		Если ДанныеДляЗаполнения.КоличествоПодобрано = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоПотребительскихУпаковокПоGTIN.Вставить(GTIN.Ключ, ДанныеДляЗаполнения);
		
	КонецЦикла;
	
	ВозвращаемоеЗначение.КоличествоПотребительскихУпаковокПоGTIN = КоличествоПотребительскихУпаковокПоGTIN;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция СписокGTINПоДаннымВиртуальногоБаланса(Организация, ВидПродукции, МассивGTIN) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	ВозвращаемоеЗначение.Вставить("СписокGTIN",                     Неопределено);
	ВозвращаемоеЗначение.Вставить("ВНаличииНаБалансе",              Неопределено);
	
	РезультатСервиса = ИнтерфейсИСМП.ОстатокGTINПоДаннымВиртуальногоБаланса(Организация, ВидПродукции, МассивGTIN);
	
	Если РезультатСервиса.ТребуетсяОбновлениеКлючаСессии Тогда
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатСервиса.ТекстОшибки) Тогда
		ВызватьИсключение РезультатСервиса.ТекстОшибки;
	КонецЕсли;
	
	ВНаличииНаБалансе = Новый Массив;
	СписокGTIN = Новый СписокЗначений;
	
	Если РезультатСервиса.ОстатокGTIN <> Неопределено Тогда
		
		Для Каждого СтрокаОтвет Из РезультатСервиса.ОстатокGTIN Цикл
			
			Если СтрокаОтвет.Значение > 0 Тогда
				ВНаличииНаБалансе.Добавить(СтрокаОтвет.Ключ);
			КонецЕсли;
			
			ПредставлениеОстаток = Новый ФорматированнаяСтрока(
				СтрШаблон(
					НСтр("ru = 'Остаток в ГИС МТ: %1'"),
					СтрокаОтвет.Значение),,
				ЦветаСтиля.СтатусОбработкиПередаетсяГосИС);
			ПредставлениеЗначения = Новый ФорматированнаяСтрока(СтрокаОтвет.Ключ, " ", ПредставлениеОстаток);
			СписокGTIN.Добавить(СтрокаОтвет.Ключ, ПредставлениеЗначения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение.СписокGTIN        = СписокGTIN;
	ВозвращаемоеЗначение.ВНаличииНаБалансе = ВНаличииНаБалансе;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ОперацияДокументаМаркировкиТоваровов(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Неопределено;
	ИначеЕсли ТипЗнч(Документ) <> Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда
		ВызватьИсключение НСтр("ru = 'Не верный тип значения документа маркировки товаров для получения операции'");
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Операция");
	
КонецФункции

#Область ФормаПроверкиИПодбора

Функция КодыМаркировкиПоОснованию(Документ) Экспорт
	
	Основания = ПечатьЭтикетокИСМП.МассивСвязанныхДокументовОснований(Документ);
	
	Возврат РегистрыСведений.ПулКодовМаркировкиСУЗ.КодыМаркировкиПоОснованию(Основания);
	
КонецФункции

Функция КодыМаркировкиПоЗаказамНаЭмиссию(ЗаказыНаЭмиссию, РежимПолученияКодов) Экспорт
	
	Возврат РегистрыСведений.ПулКодовМаркировкиСУЗ.КодыМаркировкиПоОснованию(ЗаказыНаЭмиссию, РежимПолученияКодов);
	
КонецФункции

Функция КодыМаркировкиПоМаркировкеТоваров(ОтчетыОНанесении) Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	СписокЗапросов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ОтчетыОНанесении);
	
	СписокЗапросов.Добавить(
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДанныеОтчетаПроизводственнойЛинии.ЗначениеШтрихкода = """"
		|		ТОГДА ДанныеОтчетаПроизводственнойЛинии.НормализованноеЗначениеШтрихкода
		|		ИНАЧЕ ДанныеОтчетаПроизводственнойЛинии.ЗначениеШтрихкода
		|	КОНЕЦ КАК ЗначениеШтрихкода,
		|	ВЫБОР
		|		КОГДА ДанныеОтчетаПроизводственнойЛинии.ЗначениеШтрихкодаУпаковки = """"
		|		ТОГДА ДанныеОтчетаПроизводственнойЛинии.НормализованноеЗначениеШтрихкодаУпаковки
		|		ИНАЧЕ ДанныеОтчетаПроизводственнойЛинии.ЗначениеШтрихкодаУпаковки
		|	КОНЕЦ КАК ЗначениеШтрихкодаУпаковки,
		|	ВЫБОР
		|		КОГДА ДанныеОтчетаПроизводственнойЛинии.ЗначениеШтрихкода = """"
		|		ТОГДА ЛОЖЬ
		|		ИНАЧЕ ДанныеОтчетаПроизводственнойЛинии.ФорматBase64
		|	КОНЕЦ КАК ФорматBase64
		|	ПОМЕСТИТЬ ВсеШтрихкодыСИерархией
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.ДанныеОтчетаПроизводственнойЛинии КАК
		|		ДанныеОтчетаПроизводственнойЛинии
		|ГДЕ
		|	ДанныеОтчетаПроизводственнойЛинии.Ссылка В (&Ссылка)
		|	И ДанныеОтчетаПроизводственнойЛинии.Ссылка.ОтчетПроизводственнойЛинии
		|	И ВЫРАЗИТЬ(ДанныеОтчетаПроизводственнойЛинии.ТекстОшибкиЗначениеШтрихкода КАК СТРОКА(1)) = """"
		|	И ВЫРАЗИТЬ(ДанныеОтчетаПроизводственнойЛинии.ТекстОшибкиЗначениеШтрихкодаУпаковки КАК СТРОКА(1)) = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДанныеОтчетаПроизводственнойЛинии.ЗначениеШтрихкода = """"
		|		ТОГДА ДанныеОтчетаПроизводственнойЛинии.НормализованноеЗначениеШтрихкода
		|		ИНАЧЕ ДанныеОтчетаПроизводственнойЛинии.ЗначениеШтрихкода
		|	КОНЕЦ КАК ЗначениеШтрихкода,
		|	ВЫБОР
		|		КОГДА ДанныеОтчетаПроизводственнойЛинии.ЗначениеШтрихкодаУпаковки = """"
		|		ТОГДА ДанныеОтчетаПроизводственнойЛинии.НормализованноеЗначениеШтрихкодаУпаковки
		|		ИНАЧЕ ДанныеОтчетаПроизводственнойЛинии.ЗначениеШтрихкодаУпаковки
		|	КОНЕЦ КАК ЗначениеШтрихкодаУпаковки,
		|	ВЫБОР
		|		КОГДА ДанныеОтчетаПроизводственнойЛинии.ЗначениеШтрихкода = """"
		|		ТОГДА ЛОЖЬ
		|		ИНАЧЕ ДанныеОтчетаПроизводственнойЛинии.ФорматBase64
		|	КОНЕЦ КАК ФорматBase64
		|ИЗ
		|	РегистрСведений.ДанныеОтчетаПроизводственнойЛинииИСМП КАК
		|		ДанныеОтчетаПроизводственнойЛинии
		|ГДЕ
		|	ДанныеОтчетаПроизводственнойЛинии.Документ В (&Ссылка)
		|	И ВЫРАЗИТЬ(ДанныеОтчетаПроизводственнойЛинии.ТекстОшибкиЗначениеШтрихкода КАК СТРОКА(1)) = """"
		|	И ВЫРАЗИТЬ(ДанныеОтчетаПроизводственнойЛинии.ТекстОшибкиЗначениеШтрихкодаУпаковки КАК СТРОКА(1)) = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода, """") КАК ЗначениеШтрихкода,
		|	""""                                                                 КАК ЗначениеШтрихкодаУпаковки,
		|	ЛОЖЬ                                                                 КАК ФорматBase64
		|
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
		|ГДЕ
		|	ШтрихкодыУпаковок.Ссылка В (&Ссылка)
		|	И НЕ ШтрихкодыУпаковок.Ссылка.ОтчетПроизводственнойЛинии");
	
	СписокЗапросов.Добавить(
		"ВЫБРАТЬ
		|	ВсеШтрихкодыСИерархией.ЗначениеШтрихкода,
		|	ВсеШтрихкодыСИерархией.ЗначениеШтрихкодаУпаковки,
		|	ВсеШтрихкодыСИерархией.ФорматBase64
		|ИЗ
		|	ВсеШтрихкодыСИерархией КАК ВсеШтрихкодыСИерархией",
		"ВсеШтрихкодыСИерархией");
		
	СписокЗапросов.Добавить(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеШтрихкодыСИерархией.ЗначениеШтрихкода КАК Родитель,
		|	ВсеШтрихкодыСИерархией.ФорматBase64      КАК ФорматBase64
		|ИЗ
		|	ВсеШтрихкодыСИерархией КАК ВсеШтрихкодыСИерархией
		|ГДЕ
		|	ВсеШтрихкодыСИерархией.ЗначениеШтрихкодаУпаковки = """"
		|	И ВсеШтрихкодыСИерархией.ЗначениеШтрихкода <> """"
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеШтрихкодыСИерархией.ЗначениеШтрихкодаУпаковки,
		|	ВсеШтрихкодыСИерархией.ФорматBase64
		|ИЗ
		|	ВсеШтрихкодыСИерархией КАК ВсеШтрихкодыСИерархией
		|ГДЕ
		|	ВсеШтрихкодыСИерархией.ЗначениеШтрихкодаУпаковки <> """"",
		"ВозможныеРодители");
	
	РезультатЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	ВерхиниеУровни = Новый Соответствие();
	
	//@skip-warning
	Выборка = РезультатЗапроса["ВозможныеРодители"].Выбрать();
	Пока Выборка.Следующий() Цикл
		ВерхиниеУровни.Вставить(Выборка.Родитель, Выборка.ФорматBase64);
	КонецЦикла;
	
	//@skip-warning
	Выборка = РезультатЗапроса["ВсеШтрихкодыСИерархией"].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ВерхиниеУровни[Выборка.ЗначениеШтрихкода] <> Неопределено
			И ЗначениеЗаполнено(Выборка.ЗначениеШтрихкодаУпаковки) Тогда
			ВерхиниеУровни.Удалить(Выборка.ЗначениеШтрихкода);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ВерхиниеУровни Цикл
		
		Штрихкод     = КлючИЗначение.Ключ;
		ФорматBase64 = КлючИЗначение.Значение;
		
		ПоляСтрокой = Новый Структура("Количество,ШтрихкодМаркиАлкогольнойПродукции,ШтрихкодУпаковки",1,"","");
		ПоляСтрокой.Вставить("Штрихкод",     Штрихкод);
		ПоляСтрокой.Вставить("ФорматBase64", ФорматBase64);
		
		Если ФорматBase64 Тогда
			КодМаркировки = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.Base64ВШтрихкод(Штрихкод);
			Если Не ЗначениеЗаполнено(КодМаркировки) Тогда
				ПоляСтрокой.ФорматBase64 = Ложь;
			КонецЕсли;
		КонецЕсли;
		ВозвращаемоеЗначение.Добавить(ПоляСтрокой);
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти
