&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтруктураИнформации = ПолучитьИнформациюОРасширении();
	
	ПерваяСтрока = Истина;
	Для каждого КИЗ ИЗ СтруктураИнформации Цикл
		ИнформацияОРасширении = ИнформацияОРасширении + ?(ПерваяСтрока, "", Символы.ПС) +
			КИЗ.Ключ + ": " + КИЗ.Значение;		
		
		Если ПерваяСтрока Тогда
			ПерваяСтрока = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюОРасширении()
	
	СтруктураИнформации = Новый Структура;
	
	ИмяОбработки  = РеквизитФормыВЗначение("Объект").Метаданные().Имя;
	ИмяРасширения = Метаданные.Обработки[ИмяОбработки].РасширениеКонфигурации().Имя;
	
	МассивРасширений = РасширенияКонфигурации.Получить(Новый Структура("Имя", ИмяРасширения));
	Если МассивРасширений.Количество() Тогда
		РасширениеОбъект = МассивРасширений[0];
		
		СтруктураИнформации.Вставить("Имя",		РасширениеОбъект.Имя);
		СтруктураИнформации.Вставить("Синоним", РасширениеОбъект.Синоним);
		СтруктураИнформации.Вставить("Версия", 	РасширениеОбъект.Версия);
		СтруктураИнформации.Вставить("Активно", РасширениеОбъект.Активно);
	КонецЕсли;
	
	Возврат СтруктураИнформации;
	
КонецФункции

