
&НаСервере
Перем _ОбработкаОбъект;

&НаСервере
Перем _МодульЯдроНаСервере;

//{ Сервисные методы

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Результат = ОсновнаяФорма().Модуль_ЯдроНаКлиенте();
	
	Возврат Результат;
	
КонецФункции

//} Сервисные методы


//{ ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипУчастника = Неопределено;
	ВызывающаяФорма = Неопределено;
	
	Параметры.Объект.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	Параметры.Свойство("ТипУчастника", ТипУчастника);
	Параметры.Свойство("ВызывающаяФорма", ВызывающаяФорма);
	
	БиблиотекаКартинокЯдра = Модуль_ЯдроНаСервере().БиблиотекаКартинок();
	КартинкаВниманиеПрозрачная = БиблиотекаКартинокЯдра.КартинкаВниманиеПрозрачная;
	
	АдресКартинкиВнимание = ПоместитьВоВременноеХранилище(КартинкаВниманиеПрозрачная, УникальныйИдентификатор);
	
	НастроитьФормуПоТипуУчастникаБезСопоставления(ВызывающаяФорма, ТипУчастника);
	
КонецПроцедуры

//} ОбработчикиСобытийФормы


//{ ОбработчикиКомандФормы

&НаКлиенте
Процедура СопоставитьКонтрагента(Команда)
	
	ДействиеМетрики = Метрики_ДействиеНажатиеСопоставитьКонтрагента();
	
	Метрики_ДобавитьПоведение(ДействиеМетрики);
	Метрики_ДобавитьСтатистику(ДействиеМетрики);
	
	Закрыть(КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДругогоКонтрагента(Команда)
	
	ДействиеМетрики = Метрики_ДействиеНажатиеВыбратьДругогоКонтрагента();
	
	Метрики_ДобавитьПоведение(ДействиеМетрики);
	Метрики_ДобавитьСтатистику(ДействиеМетрики);
	
	Закрыть(КодВозвратаДиалога.Прервать);
	
КонецПроцедуры

//} ОбработчикиКомандФормы


//{ Метрики

&НаКлиенте
Процедура Метрики_ДобавитьПоведение(ДействиеМетрики)
	
	НазваниеФормы = Метрики_НазваниеФормы();
	КатегорияМетрики = Метрики_КатегорияКонтрагентНеСопоставлен();
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Ядро.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НазваниеФормы,
		КатегорияМетрики,
		ДействиеМетрики
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрики_ДобавитьСтатистику(ДействиеМетрики)
	
	КатегорияМетрики = Метрики_КатегорияКонтрагентНеСопоставлен();
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Ядро.Метрика_ДобавитьСтатистику_ПоКонтексту(
		КатегорияМетрики,
		ДействиеМетрики
	);
	
КонецПроцедуры

&НаКлиенте
Функция Метрики_НазваниеФормы()
	Возврат "Форма контрагент не сопоставлен";
КонецФункции

&НаКлиенте
Функция Метрики_КатегорияКонтрагентНеСопоставлен()
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Категории = Ядро.Метрика_НазваниеКатегории();
	Результат = Категории.КонтрагентНеСопоставлен;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрики_ДействиеНажатиеВыбратьДругогоКонтрагента()
	Возврат "ВыбратьДругогоКонтрагента";
КонецФункции

&НаКлиенте
Функция Метрики_ДействиеНажатиеСопоставитьКонтрагента()
	Возврат "СопоставитьКонтрагента";
КонецФункции

//} Метрики

//{ Служебные процедуры и функции

&НаСервере
Процедура НастроитьФормуПоТипуУчастникаБезСопоставления(ВызывающаяФорма, ТипУчастника)
	
	Если ВызывающаяФорма = "ФормаЛогистики" Тогда
		
		Если ТипУчастника = "Организация" Тогда
			
			ТекстПредупрежденияПользователю = "Выбранная организация 1С не сопоставлена";
			ТекстПодсказкиПользователю = "Для указания этой организации участником обмена
				|транспортными документами необходимо выполнить ее сопоставление";
			ТекстКнопкиСопоставить = "Сопоставить организацию";
			ТекстКнопкиВыбратьДругого = "Выбрать другую организацию";
			
		Иначе
			
			ТекстПредупрежденияПользователю = "Выбранный контрагент 1С не сопоставлен";
			ТекстПодсказкиПользователю = "Для указания этого контрагента участником обмена
				|транспортными документами необходимо выполнить его сопоставление";
			ТекстКнопкиСопоставить = "Сопоставить контрагента";
			ТекстКнопкиВыбратьДругого = "Выбрать другого контрагента";
			
		КонецЕсли;
		
	Иначе
		
		ТекстПредупрежденияПользователю = "Выбранный контрагент 1С не сопоставлен";
		ТекстПодсказкиПользователю = "Для отображения списка документов по выбранному контрагенту
			|необходимо выполнить его сопоставление";
		ТекстКнопкиСопоставить = "Сопоставить контрагента";
		ТекстКнопкиВыбратьДругого = "Выбрать другого контрагента";
		
	КонецЕсли;
	
	Элементы.НадписьПредупреждениеПользователя.Заголовок = ТекстПредупрежденияПользователю;
	Элементы.НадписьПодсказкаПользователю.Заголовок = ТекстПодсказкиПользователю;
	Элементы.ВыбратьДругогоКонтрагента.Заголовок = ТекстКнопкиВыбратьДругого;
	Элементы.СопоставитьКонтрагента.Заголовок = ТекстКнопкиСопоставить;
	
КонецПроцедуры

//} Служебные процедуры и функции
