
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ЗапускРоботов", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускРоботов()
	
	Попытка
		
		// Выполняем сценарии
		ДокументыНаПодписание = ЗапускРоботовСервер();
		
		Для Счет = 1 По 10 Цикл
			
			// Подписываем документы
			КонтурЛогистика_ИнтеграцияДиадокКлиентСервер.ПодписатьФайлыОбмена(ДокументыНаПодписание);
			
			// Повторно выполняем сценарии, для обработки уже подписанных
			ДокументыНаПодписание = ЗапускРоботовСервер();
			
			// Если не оказалось документов на подписание, то завершаем
			Если ДокументыНаПодписание.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Закрыть();
		
	Исключение
		
		// Регистрируем ошибку
		ЗаписатьОшибкуЗапускаРоботовВЖР(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьОшибкуЗапускаРоботовВЖР(ОписаниеОшибки)
	
	ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
	ТекстОшибки = "Запуск роботов.
		|" + ОписаниеОшибки;
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапускРоботовСервер()
	
	БезПодписанияНаСервере = Истина;
	
	Возврат Справочники.КонтурЛогистика_СценарииАвтоматическойРаботы.ВыполнитьВсеАктивныеСценарии(БезПодписанияНаСервере);
	
КонецФункции
