
#Область СлужебныйПрограммныйИнтерфейс

// Основная учетная запись.
// 
// Возвращаемое значение:
//  СправочникСсылка.УчетныеЗаписиМаркетплейсов - Основная учетная запись
Функция ОсновнаяУчетнаяЗапись() Экспорт
	
	ПараметрыМетода = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьУчетныеЗаписи();
	ПараметрыМетода.УчетнаяЗапись = Неопределено;
	ПараметрыМетода.ПроверятьТокены = Истина;
	ПараметрыМетода.ВсеУчетныеЗаписи = Истина;
	ПараметрыМетода.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.СервисАналитикиSellmonitor;
	
	ПараметрыМетода.Вставить("Метод", "Get");
	ПараметрыМетода.Вставить("ИмяМетода", ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьУчетныеЗаписи());
	
	РезультаМетода = ИнтеграцияСМаркетплейсамиСИ.ПолучитьУчетныеЗаписи(ПараметрыМетода);
	
	Если ТипЗнч(РезультаМетода) <> Тип("Структура") Тогда
		Возврат Справочники.УчетныеЗаписиМаркетплейсов.ПустаяСсылка();
	КонецЕсли;
	
	Если РезультаМетода.КодСостояния <> 200 Тогда
		Возврат Справочники.УчетныеЗаписиМаркетплейсов.ПустаяСсылка();
	КонецЕсли;
	
	Если РезультаМетода.Ответ.УчетныеЗаписи.Количество() = 0 Тогда
		Возврат Справочники.УчетныеЗаписиМаркетплейсов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат РезультаМетода.Ответ.УчетныеЗаписи[0].УчетнаяЗапись;
	
КонецФункции

// Возвращает имя события журнала регистрации работы с сервисом.
//
// Возвращаемое значение:
//   Строка - Наименование события для записей в журнале регистрации.
Функция СобытиеЖурналаРегистрации() Экспорт
	Возврат НСтр("ru = 'Интеграция с Sellmonitor'", ОбщегоНазначения.КодОсновногоЯзыка());
КонецФункции

#КонецОбласти
