
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПереформироватьДинСпискокТД();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПереформироватьДинСпискокТД();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ПереформироватьДинСпискокТД()
	
	Если ЗначениеЗаполнено(Объект.КодПартнераКонтур) Тогда 
		СопоставленияПунктовМаршрута.Параметры.УстановитьЗначениеПараметра("ПартнерСсылка", Объект.Ссылка); 
		Элементы.СопоставленияПунктовМаршрута.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
		Элементы.ПунктыМаршрута.Видимость = Не ЗначениеЗаполнено(Объект.Ссылка);
		Элементы.ГруппаНеЗаписан.Видимость = Не ЗначениеЗаполнено(Объект.Ссылка);
		Элементы.СопоставленияПунктовМаршрута.Обновить();
		Элементы.ГруппаПунктыМаршрута.Видимость = Истина;
	Иначе
		Элементы.ГруппаПунктыМаршрута.Видимость = Ложь;
		Элементы.ГруппаНеЗаписан.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновитьДинСписок(Параметр1, параметр2) Экспорт

	ПереформироватьДинСпискокТД();

КонецПроцедуры

&НаКлиенте
Процедура СопоставленияПунктовМаршрутаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		
		ПараметрыФормы = Новый Структура;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
			
			ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);
			
		Иначе
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Наименование", ТекущиеДанные.Название);
			ДанныеЗаполнения.Вставить("Адрес", ТекущиеДанные.АдресСтрока);
			ДанныеЗаполнения.Вставить("GLN", ТекущиеДанные.GLN);
			ДанныеЗаполнения.Вставить("АдресИндекс", ТекущиеДанные.АдресИндекс);
			ДанныеЗаполнения.Вставить("Партнер", Объект.Ссылка);
			ДанныеЗаполнения.Вставить("Прибытие", Истина);
			ДанныеЗаполнения.Вставить("АдресКодРегион", ТекущиеДанные.АдресКодРегион);
			ПараметрыФормы.Вставить("Основание", ДанныеЗаполнения); 
			
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_ПунктыМаршрута.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОбновитьДинСписок", ПараметрыФормы); 
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПунктыМаршрутаСервер(МассивСтруктурДанныеСтроки)
	
	Для Каждого СтруктураТочкиДоставки Из МассивСтруктурДанныеСтроки Цикл 
		
		НовыйПунктМаршрута = Справочники.КонтурЛогистика_ПунктыМаршрута.СоздатьЭлемент();
		НовыйПунктМаршрута.Заполнить(СтруктураТочкиДоставки);
		НовыйПунктМаршрута.Записать();
		
	КонецЦикла;
	
	ПереформироватьДинСпискокТД();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыделенныеПунктыМаршрута(Команда)
	
	текВыделенныеСтроки = Элементы.СопоставленияПунктовМаршрута.ВыделенныеСтроки;

	МассивСтруктур = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из текВыделенныеСтроки Цикл
		
		ТекущиеДанные = Элементы.СопоставленияПунктовМаршрута.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда 
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Наименование", ТекущиеДанные.Название);
			ДанныеЗаполнения.Вставить("Адрес", ТекущиеДанные.АдресСтрока);
			ДанныеЗаполнения.Вставить("GLN", ТекущиеДанные.GLN);
			ДанныеЗаполнения.Вставить("АдресИндекс", ТекущиеДанные.АдресИндекс);
			ДанныеЗаполнения.Вставить("Партнер", Объект.Ссылка);
			ДанныеЗаполнения.Вставить("Прибытие", Истина);
			ДанныеЗаполнения.Вставить("АдресКодРегион", ТекущиеДанные.АдресКодРегион);
			МассивСтруктур.Добавить(ДанныеЗаполнения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДобавитьПунктыМаршрутаСервер(МассивСтруктур);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНастройкаПриИзменении(Элемент)
	
	// установить в значение дефолтное значение
	Если ЗначениеЗаполнено(Элементы.Настройки.ТекущиеДанные.Настройка) Тогда 
		Элементы.Настройки.ТекущиеДанные.Значение = 
			КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
				Элементы.Настройки.ТекущиеДанные.Настройка, "Значение");
				
	КонецЕсли;
	
КонецПроцедуры