#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "СписокАУ_ПричинаЗакрытия", "Список", , 1, "Список.Ссылка.АУ_ПричинаЗакрытия");
	Элементы.Переместить(Элементы.СписокАУ_ПричинаЗакрытия, Элементы.Список, Элементы.СписокСуммаАвансаДоОбеспечения);

	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "СписокАУ_Программа", "Список", , 1, "Список.Ссылка.АУ_Программа");

	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "СписокАУ_КраткийНомер", "Список", "Краткий номер контракта", 1, "Список.Договор.АУ_КраткийНомер");
	Элементы.Переместить(Элементы.СписокАУ_КраткийНомер, Элементы.Список, Элементы.СписокСостояние);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
