#Область ПрограммныйИнтерфейс

// Получает список физических лиц по организации
//
// Параметры:
//  Организация - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок - организация, по которой необходимо получить список физ лиц
//  ПараметрыЗапроса - Соответствие - дополнительные параметры запроса
// 
// Возвращаемое значение:
//  Результат - Массив, содержащий данные по физическим лицам 
//
Функция СписокФизическихЛиц(Организация, ПараметрыЗапроса = Неопределено) Экспорт
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ПараметрыСервисаСервисаФизическихЛиц(Организация);
	СписокФизическихЛиц = КонтурЛогистика_API_СервисФизическихЛиц.СписокФизическихЛиц(ПараметрыСервиса, Организация.DirectoryId, ПараметрыЗапроса);
	Результат = КонтурЛогистика_API_СервисФизическихЛиц.НормализоватьСписокФизическихЛиц(СписокФизическихЛиц);
	
	Возврат Результат;
	
КонецФункции

// Получает данные физического лица в заданной организации
//
// Параметры:
//  Организация - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок - организация, в которой находится физ лицо
//  ИдФизЛица - Строка - personId физического лица
// 
// Возвращаемое значение:
//  Результат - Структура, содержащая данные по физическому лицу
//
Функция ПолучитьФизическоеЛицо(Организация, ИдФизЛица) Экспорт
	
	Попытка
	
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ПараметрыСервисаСервисаФизическихЛиц(Организация);
		Результат = КонтурЛогистика_API_СервисФизическихЛиц.ПолучитьФизическоеЛицо(ПараметрыСервиса, Организация.DirectoryId, ИдФизЛица);
		
		Если Результат.ФизЛицо <> Неопределено Тогда
			Результат.ФизЛицо = КонтурЛогистика_API_СервисФизическихЛиц.НормализоватьФизическоеЛицо(Результат.ФизЛицо);
		КонецЕсли;
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		
		Если Найти(ОписаниеОшибки, "Код ошибки: 400") Тогда
			ТекстОшибки = "Некорректные параметры запроса. " + Символы.ПС + ОписаниеОшибки;
		ИначеЕсли Найти(ОписаниеОшибки, "Код ошибки: 403") Тогда
			ТекстОшибки = "Доступ запрещен. " + Символы.ПС + ОписаниеОшибки;
		ИначеЕсли Найти(ОписаниеОшибки, "Код ошибки: 404") Тогда
			ТекстОшибки = "Физическое лицо не найдено. " + Символы.ПС + ОписаниеОшибки;
		ИначеЕсли Найти(ОписаниеОшибки, "Код ошибки: 410") Тогда
			ТекстОшибки = "Физическое лицо было удалено. " + Символы.ПС + ОписаниеОшибки
		Иначе
			ТекстОшибки = ОписаниеОшибки;
		КонецЕсли;
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
			
	Возврат Результат;
	
КонецФункции

// Изменяет данные физического лица в заданной организации
//
// Параметры:
//  Организация - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок - организация, в которой находится физ лицо
//  Сотрудник - СправочникСсылка.КонтурЛогистика_Сотрудники - сотрудник, откуда берем данные для изменения физ лица
//  ИдФизЛица - Строка - personId физического лица
//  Телефон - Строка - телефон на который будет отправлено приглашение
// 
// Возвращаемое значение:
//  Результат - Структура, содержащая номер версии данных физ лица
//
Функция ИзменитьФизическоеЛицо(Организация, Сотрудник, ИдФизЛица, Телефон = Неопределено, IdentityDocumentId = Неопределено) Экспорт

	Попытка
	
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ПараметрыСервисаСервисаФизическихЛиц(Организация);	
		Person = КонтурЛогистика_API_СервисФизическихЛиц.Person(Сотрудник, Телефон, IdentityDocumentId);	
		Результат = КонтурЛогистика_API_СервисФизическихЛиц.ИзменитьФизическоеЛицо(ПараметрыСервиса, Person, Организация.DirectoryId, ИдФизЛица);
	
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		
		Если Найти(ОписаниеОшибки, "Код ошибки: 400") Тогда
			ТекстОшибки = "Некорректные параметры запроса. " + Символы.ПС + ОписаниеОшибки;
		ИначеЕсли Найти(ОписаниеОшибки, "Код ошибки: 403") Тогда
			ТекстОшибки = "Доступ запрещен. " + Символы.ПС + ОписаниеОшибки;
		ИначеЕсли Найти(ОписаниеОшибки, "Код ошибки: 404") Тогда
			ТекстОшибки = "Физическое лицо не найдено. " + Символы.ПС + ОписаниеОшибки;
		Иначе
			ТекстОшибки = ОписаниеОшибки;
		КонецЕсли;
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Создает физическое лицо в заданной организации
//
// Параметры:
//  Организация - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок - организация в которой будет создано физ лицо
//  Сотрудник - СправочникСсылка.КонтурЛогистика_Сотрудники - сотрудник, откуда берем данные для создания физ лица
//  Телефон - Строка - телефон на который будет отправлено приглашение
// 
// Возвращаемое значение:
//  Результат - Структура, содержащая идентификатор физ лица (personId)
//
Функция СоздатьФизическоеЛицо(Организация, Сотрудник, Телефон) Экспорт
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ПараметрыСервисаСервисаФизическихЛиц(Организация);
	Person = КонтурЛогистика_API_СервисФизическихЛиц.Person(Сотрудник, Телефон);
	Результат = КонтурЛогистика_API_СервисФизическихЛиц.СоздатьФизическоеЛицо(ПараметрыСервиса, Person, Организация.DirectoryId);
	
	Возврат Результат;
	
КонецФункции

// Удаляет физическое лицо в заданной организации
//
// Параметры:
//  Организация - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок - организация, в которой находится физ лицо
//  ИдФизЛица - Строка - personId физического лица
// 
// Возвращаемое значение:
//  Результат - Булево - результат выполнения запроса
//
Функция УдалитьФизическоеЛицо(Организация, ИдФизЛица) Экспорт
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ПараметрыСервисаСервисаФизическихЛиц(Организация);	
	Результат = КонтурЛогистика_API_СервисФизическихЛиц.УдалитьФизическоеЛицо(ПараметрыСервиса, Организация.DirectoryId, ИдФизЛица);
	
	Возврат Результат;
	
КонецФункции

// Отправляет приглашение физическому лицу по заданному сценарию
//
// Параметры:
//  Организация - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок - организация, в которой находится физ лицо
//  ИдФизЛица - Строка - personId физического лица
//  Сценарий - Строка - сценарий приглашения
// 
// Возвращаемое значение:
//  Результат - Структура, содержащая идентификатор приглашения
//
Функция ОтправитьПриглашение(Организация, ИдФизЛица, Сценарий) Экспорт
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ПараметрыСервисаСервисаФизическихЛиц(Организация);
	
	ИмяСценарияПриглашения = КонтурЛогистика_API_СервисФизическихЛиц.ИмяСценарияПриглашения(Сценарий);
	Результат = КонтурЛогистика_API_СервисФизическихЛиц.ОтправитьПриглашение(ПараметрыСервиса, Организация.DirectoryId, ИдФизЛица, ИмяСценарияПриглашения);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
