
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Результат = РазбитьПакетСервер(ПараметрКоманды);
	
	Если Результат.Успешно Тогда 
		Состояние("В пакете!", , "Файлы разделены из пакета", БиблиотекаКартинок.КонтурЛогистика_РазделитьПакет);
	Иначе
		Состояние("Не удалось разделить пакет",, "Подробности выведены в сообщения", БиблиотекаКартинок.КонтурЛогистика_ИсправитьОшибки);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьООшибкиВыполненияФункции(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РазбитьПакетСервер(ПараметрКоманды)
	
	МассивСтруктурDocumentId = Новый Массив;
	Для й = 1 По ПараметрКоманды.Количество() - 1 Цикл 
		МассивСтруктурDocumentId.Добавить(Новый Структура("MessageId, EntityId", ПараметрКоманды[й].MessageID, ПараметрКоманды[й].DocumentId));
	КонецЦикла;
	
	Результат = КонтурЛогистика_API_Диадок.ВыполнитьЗапросУбратьДокументыИзПакета(ПараметрКоманды[0], МассивСтруктурDocumentId);
	
	Если Результат.Успешно Тогда
		
		Для й = 1 По ПараметрКоманды.Количество() - 1 Цикл
			
			ФайлСсылка = ПараметрКоманды[й];
			ФайлОбъект = ФайлСсылка.ПолучитьОбъект();
			ФайлОбъект.PacketId = "";
			ФайлОбъект.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции 