
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивДокументовУчетнойСистемы.ЗагрузитьЗначения(Параметры.МассивДокументовУчетнойСистемы);
	ПереформироватьДерево();	
	
КонецПроцедуры

&НаСервере
Процедура ПереформироватьДерево()
	
	текДеревоСвязей = КонтурЛогистика_ИнтеграцияКонтурСервер.СостояниеЭПДДерево(МассивДокументовУчетнойСистемы.ВыгрузитьЗначения());
	текДеревоСвязей.Колонки.Добавить("Картинка");
	текДеревоСвязей.Колонки.Добавить("КартинкаТД");
	текДеревоСвязей.Колонки.Добавить("КартинкаСтатус");
	
	ПроставитьКартинки(текДеревоСвязей);
	
	ЗначениеВРеквизитФормы(текДеревоСвязей, "ДеревоСвязей");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ВвестиДокумент"
		Или ИмяСобытия = "КонтурЛогистика_ОбновитьФормуСпискаЗадач"
		Или ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" Тогда 
		
		ОбработчикОбновить();
		
	ИначеЕсли ИмяСобытия = "ЗавершениеФоновогоЗадания"
		И Параметр.Свойство("КлючФЗ")
		И Параметр.КлючФЗ = "Выполнение обмена" Тогда
		
		ОбработчикОбновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт

	ПереформироватьДерево();
	КоллекцияЭлементовДерева = ДеревоСвязей.ПолучитьЭлементы();	
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
	    ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
	    Элементы.ДеревоСвязей.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;

	ИдентификаторФЗ_ВыполнитьОбмен = "";
	АдресРезультатаВыполнитьОбмен = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповеститьОВыполненииКоманды(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт

	ОбработчикОбновить();

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбработчикОбновить();
	
КонецПроцедуры

&НаСервере
Процедура ПроставитьКартинки(текДеревоСвязей)

	Для Каждого Строка1 Из текДеревоСвязей.Строки Цикл 
		Для Каждого Строка2 Из Строка1.Строки Цикл 
			
			ПроставитьКартинкиСтрок(Строка2);
			
			Для Каждого СтрокаЭПД Из Строка2.Строки Цикл 
				
				ПроставитьКартинкиСтрок(СтрокаЭПД);
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПроставитьКартинкиСтрок(Знач СтрокаЭПД)
	
	Если СтрокаЭПД.ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.Оформить Тогда 
		СтрокаЭПД.КартинкаТД = БиблиотекаКартинок.КонтурЛогистика_Пункт;
	Иначе
		Если СтрокаЭПД.ТипЭПД = "Заказ (заявка)" Тогда
			СтрокаЭПД.Картинка = БиблиотекаКартинок.КонтурЛогистика_ЛогоСКарандашом;
		ИначеЕсли СтрокаЭПД.ТипЭПД = "Транспортная накладная" Тогда
			СтрокаЭПД.Картинка = БиблиотекаКартинок.КонтурЛогистика_Грузовик;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаЭПД.Статус =  КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.НайтиСостояниеДОПоКоду("on-the-way")
		ИЛИ СтрокаЭПД.Статус =  КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.НайтиСостояниеДОПоКоду("pd-on-the-way") Тогда 
		
		СтрокаЭПД.КартинкаСтатус = БиблиотекаКартинок.КонтурЛогистика_QR16;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоСвязейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = ДеревоСвязей.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Поле.Имя = "ДеревоСвязейТребуемоеДействие" Тогда 
		
		Если ТекСтрока.ТребуемоеДействие = "Ввести док. основание для ЭПД" Тогда
			
			ВвестиДокументУчетнойСистемыОснование(ТекСтрока.ДокументОснование);
			
		ИначеЕсли ТекСтрока.ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПродолжитьОформление") Тогда 
			
			// TODO открыть сразу ввод следующего если это сейчас требуется
			ОткрытьЭПДТекСтроки(ТекСтрока);
			
		ИначеЕсли ТекСтрока.ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Оформить") Тогда
			
			ВвестиЭПДпоТекСтроке(ТекСтрока);
			
		ИначеЕсли ТекСтрока.ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВыполнитьОбмен") Тогда
			
			ВыполнитьОбмен();
			ТекСтрока.ТребуемоеДействие = "Обмен запущен";
			
		Иначе
			Если ЗначениеЗаполнено(ТекСтрока.ДокументЭПД) Тогда 
				ОткрытьЭПДТекСтроки(ТекСтрока);
			Иначе
				// ничего не делаем
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ДеревоСвязейДокументОснование" Тогда
		
		// открыть док
		Если ЗначениеЗаполнено(ТекСтрока.ДокументЭПД) Тогда
			
			ОткрытьЭПДТекСтроки(ТекСтрока);
			
		ИначеЕсли ЗначениеЗаполнено(ТекСтрока.ДокументОснованиеЭПД) Тогда
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекСтрока.ДокументОснованиеЭПД);
			
		ИначеЕсли ЗначениеЗаполнено(ТекСтрока.ДокументОснование) Тогда
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекСтрока.ДокументОснование);
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ДеревоСвязейСтатус" Тогда
		
		Если ТекСтрока.Статус = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.НайтиСостояниеДОПоКоду("on-the-way") Тогда 
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("ДокументСсылка", ТекСтрока.ДокументЭПД);
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("ОбщаяФорма.КонтурЛогистика_ОтправкаQRКода", ПараметрыОткрытия);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЭПДТекСтроки(Знач ТекСтрока)
	
	// открыть титул
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
		ТекСтрока.ДокументЭПД,
		ЭтаФорма,
		"ОбработчикОбновить",
		Новый Структура("ДокументЭПД", ТекСтрока.ДокументЭПД));

КонецПроцедуры

&НаКлиенте
Процедура ВвестиЭПДпоТекСтроке(Знач ТекСтрока)
	
	Перем массивОснованийЭПД, ПараметрыВводаЭПД, ТекРодитель;
	
	ТекРодитель = ТекСтрока.ПолучитьРодителя(); 
	ПараметрыВводаЭПД = Новый Структура();
	ПараметрыВводаЭПД.Вставить("Форма", ЭтаФорма);
	ПараметрыВводаЭПД.Вставить("ИмяОбработчикаОповещения", "ОбработчикОповеститьОВыполненииКоманды"); 
	ПараметрыВводаЭПД.Вставить("ПараметрыОбработчика", Новый Структура("ИсходныйДокумент", ТекРодитель.ДокументОснованиеЭПД));
	
	массивОснованийЭПД = Новый Массив;
	массивОснованийЭПД.Добавить(ТекРодитель.ДокументОснованиеЭПД);
	
	Если ТекСтрока.ТипЭПД = "Заказ (заявка)" Тогда 
		КонтурЛогистика_ИнтеграцияКонтурКлиент.ВвестиЗаказЗаявкуПоОснованиямЭПД(массивОснованийЭПД, ПараметрыВводаЭПД);
	ИначеЕсли ТекСтрока.ТипЭПД = "Транспортная накладная" Тогда 
		КонтурЛогистика_ИнтеграцияКонтурКлиент.ВвестиЭТРНПоОснованиямЭПД(массивОснованийЭПД, ПараметрыВводаЭПД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен()
	
	Если ЗначениеЗаполнено(ИдентификаторФЗ_ВыполнитьОбмен) Тогда 
		
		// Открываем отслеживание
		КонтурЛогистика_ДлительныеОперацииКлиент.СледитьЗаФоновымЗаданиемВФорме(ИдентификаторФЗ_ВыполнитьОбмен, "Фоновое задание Выполнение обмена", Ложь);
		
	Иначе
		
		// Запускаем новое
		АдресРезультатаВыполнитьОбмен = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание(
			"КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьОбмен",,
			"КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьОбмен",
			"Фоновое задание Выполнение обмена",
			АдресРезультатаВыполнитьОбмен);
		
		Если РезультатЗапуска.Статус = "Выполняется" Тогда
			
			ИдентификаторФЗ_ВыполнитьОбмен = РезультатЗапуска.ИдентификаторЗадания;
			ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеВыполнитьОбмен", 0.1, Истина);
			
		ИначеЕсли РезультатЗапуска.Статус = "Выполнено" Тогда
			
			ИдентификаторФЗ_ВыполнитьОбмен = "";
			ПроверитьФоновоеЗаданиеВыполнитьОбмен();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗаданиеВыполнитьОбмен() Экспорт
	
	ИнтервалОбработчикаОжидания = 2;
	
	ЗаданиеЕщеВыполняется = КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(ИдентификаторФЗ_ВыполнитьОбмен);
	
	Если ЗаданиеЕщеВыполняется Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеВыполнитьОбмен", ИнтервалОбработчикаОжидания, Истина);
		
	Иначе
		
		ОбработчикОбновить();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВвестиДокументУчетнойСистемыОснование(ДокументОснование)

	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	Если ИмяКонфигурации = "УФ_УТ" 
		ИЛИ ИмяКонфигурации = "ERP" 
		ИЛИ ИмяКонфигурации = "КА_2" Тогда
		
		// ввести док ТРН
		ERP_ВвестиТранспортнуюНакладную(ДокументОснование);
		
	ИначеЕсли ИмяКонфигурации = "КЛ" Тогда
		
		КЛ_ВвестиТранспортнуюНакладную(ДокументОснование);
		
	Иначе
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Для вашей конфигурации не удалось найти обработчик ввода подходящего документа");
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КЛ_ВвестиТранспортнуюНакладную(ДокументОснование)

	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("ДокументОснование", ДокументОснование);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
	ОткрытьФорму("Документ.УчетнаяСистема_ТранспортнаяНакладная.ФормаОбъекта", ПараметрыФормы,,,,,
	Новый ОписаниеОповещения("ОбработчикОбновить", ЭтаФорма));

КонецПроцедуры 

&НаКлиенте
Процедура ERP_ВвестиТранспортнуюНакладную(ДокументОснование)
	
    // если есть задание на перевозку - открыть его, если нет - открыть управление доставкой
	
	ЗаданияНаПеревозку = ЗаданияНаперевозкуПоРТУ(ДокументОснование);
	
	Если ЗаданияНаПеревозку.Количество() > 0 Тогда 
		ПоказатьЗначение(Новый ОписаниеОповещения("ОбработчикОбновить", ЭтаФорма), ЗаданияНаПеревозку[0]);
	Иначе
		ОткрытьФорму("Обработка.РабочееМестоМенеджераПоДоставке.Форма.Форма",,ЭтаФорма,,,,Новый ОписаниеОповещения("ОбработчикОбновить", ЭтаФорма));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданияНаперевозкуПоРТУ(Распоряжение)
	
	МассивЗаданий = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК ЗаданиеНаПревозку
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|ГДЕ
	|	НЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ПометкаУдаления
	|	И ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = &Распоряжение";

	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);

	Результат = Запрос.Выполнить();
	МассивЗаданий = Результат.Выгрузить().ВыгрузитьКолонку("ЗаданиеНаПревозку");
	
	Возврат МассивЗаданий;
	
КонецФункции