#Область СлужебныйПрограммныйИнтерфейс

#Область ЭлементыКонструктораВидовПродукции

// Функция проверяет, доступен ли указанный формат обмена с СУЗ для вида продукции.
// 
// Параметры:
//  ФорматОбмена - ПеречислениеСсылка.ВерсииФорматаОбменаСУЗ
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// Возвращаемое значение:
//  Булево - доступность поля.
Функция ПоддерживаетсяФорматОбменаСУЗ(ФорматОбмена, ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат ФорматОбмена = ПредопределенноеЗначение("Перечисление.ВерсииФорматаОбменаСУЗ.V3")
		Или КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПоддерживаетсяФорматаОбменаСУЗНижеV3"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа))

КонецФункции

// Функция проверяет, требуется ли подписание заказа на эмиссию.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  ФорматОбмена - ПеречислениеСсылка.ВерсииФорматаОбменаСУЗ
// 
// Возвращаемое значение:
//  Булево - требуется подписание.
Функция ТребуетсяПодписание(ВидПродукцииТоварнаяГруппа, ФорматОбмена) Экспорт

	Возврат ФорматОбмена = ПредопределенноеЗначение("Перечисление.ВерсииФорматаОбменаСУЗ.V3")
		Или КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ТребуетсяПодписаниеЗаказаНаЭмиссиюСУЗНижеV3"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа))

КонецФункции

// Функция проверяет, требуется ли передавать способ изготовления кодов маркировки в СУЗ.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - признак того, что требуется передавать.
Функция ПередаватьСпособИзготовленияКодовМаркировкиВСУЗ(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПередаватьСпособИзготовленияКодовМаркировкиВСУЗ"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа))

КонецФункции

// Функция проверяет, доступно ли поле "Тип оплаты кодов маркировки" для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - доступность поля "Тип оплаты кодов маркировки" для указанного вида продукции 
Функция ДоступноПолеТипОплатыКодовМаркировки(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеТипОплатыКодовМаркировки"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));

КонецФункции

// Функция проверяет, доступно ли поле "Сервис провайдер" для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ.
// 
// Возвращаемое значение:
//  Булево - доступность поля.
Функция ДоступноПолеСервисПровайдер(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот) Экспорт

	Возврат СпособВводаВОборот <> ПредопределенноеЗначение(
			"Перечисление.СпособыВводаВОборотСУЗ.Комиссия")
		И КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСервисПровайдер"),
			ВидПродукцииТоварнаяГруппа);

КонецФункции

// Функция проверяет, доступно ли поле "Владелец GTIN" для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - доступность поля.
Функция ДоступноПолеВладелецGTIN(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеВладелецGTIN"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);
	
КонецФункции

// Функция проверяет, доступно ли поле "Без учета номенклатуры" для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - доступность поля.
Функция ДоступноПолеБезУчетаНоменклатуры(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеБезУчетаНоменклатуры"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);

КонецФункции

// Функция проверяет, доступно ли поле "Ввезен после даты обязательной маркировки" для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - доступность поля.
Функция ДоступноПолеВвезенПослеДатыОбязательнойМаркировки(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеВвезенПослеДатыОбязательнойМаркировки"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);

КонецФункции

// Функция проверяет, доступно ли поле "Приобретен / произведен после даты обязательной маркировки" для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - доступность поля.
Функция ДоступноПолеПриобретенПроизведенПослеДатыОбязательнойМаркировки(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеПриобретенПроизведенПослеДатыОбязательнойМаркировки"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);

КонецФункции

// Функция проверяет, доступно ли поле "Идентификатор производственного объекта" для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - доступность поля.
Функция ДоступноПолеПроизводственныйОбъектИдентификатор(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеПроизводственныйОбъектИдентификатор"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);
	
КонецФункции

// Функция проверяет, доступно ли поле "Идентификатор производственной линии" для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - доступность поля.
Функция ДоступноПолеИдентификаторПроизводственнойЛинии(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеИдентификаторПроизводственнойЛинии"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);
	
КонецФункции

// Функция проверяет, доступно ли поле "Представление адреса производственного объекта" для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - доступность поля.
Функция ДоступноПолеПредставлениеАдресаПроизводственногоОбъекта(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеПредставлениеАдресаПроизводственногоОбъекта"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);
	
КонецФункции

// Функция проверяет, доступно ли поле "Ожидаемая дата начала производства" для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - доступность поля.
Функция ДоступноПолеОжидаемаяДатаНачалаПроизводства(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеОжидаемаяДатаНачалаПроизводства"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);
	
КонецФункции

// Функция проверяет, доступно ли поле "Товарный знак" для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - доступность поля
Функция ДоступноПолеТоварныйЗнак(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеТоварныйЗнак"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

// Доступные способы ввода в оборот для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Массив из ОпределяемыйТип.ЗначениеЭлементаКонструктораВидовПродукцииИС - доступные способы ввода в оборот.
Функция ДоступныеСпособыВводаВОборот(ВидПродукцииТоварнаяГруппа) Экспорт
	
	ДоступныеЗначения = Новый Массив;
	
	Для Каждого Элемент Из КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСпособВводаВОборот"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа)) Цикл
		
		Если ТипЗнч(Элемент) = Тип("ПеречислениеСсылка.СпособыВводаВОборотСУЗ")
			И (Элемент <> ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков")
				Или КонструкторИСМПКлиентСервер.ВидПродукцииПодлежитМаркировкеОстатков(ВидПродукцииТоварнаяГруппа)) Тогда
			ДоступныеЗначения.Добавить(Элемент);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДоступныеЗначения;
	
КонецФункции

// Функция проверяет, доступен указанный способ ввода в оборот для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "GLN"
Функция ДоступенСпособВводаВОборот(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСпособВводаВОборот"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);

КонецФункции

// Префиксы наименования упрощенного описания остатков для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Массив из ОпределяемыйТип.ЗначениеЭлементаКонструктораВидовПродукцииИС - префиксы.
Функция ПрефиксыНаименованияУпрощенногоОписанияОстатков(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПрефиксНаименованияУпрощенногоОписанияОстатков"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

// Функция проверяет, требует ли поле "Способ ввода в оборот" обязательного заполнения для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Способ ввода в оборот"
Функция ПроверятьЗаполнениеСпособаВводаВОборот(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляСпособВводаВОборот"),
		ВидПродукцииТоварнаяГруппа);
		
КонецФункции

// Функция проверяет, требуют ли поля "Номер договора с оператором" и "Дата договора с оператором" обязательного заполнения
//  для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения полей "Номер договора с оператором" и "Дата договора с оператором"
Функция ПроверятьЗаполнениеДоговораСОператором(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляДоговорСОператором"),
		ВидПродукцииТоварнаяГруппа);
	
КонецФункции

// Функция проверяет, требует ли поле "Способ получения" обязательного заполнения для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Способ получения"
Функция ПроверятьЗаполнениеСпособаПолучения(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляСпособПолучения"),
		ВидПродукцииТоварнаяГруппа);
	
КонецФункции

// Функция проверяет, требует ли поле "Вид КИЗ" обязательного заполнения для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Вид КИЗ"
Функция ПроверятьЗаполнениеВидаКИЗ(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляВидКИЗ"),
		ВидПродукцииТоварнаяГруппа);

КонецФункции

// Функция проверяет, требует ли поле "Размер КИЗ" обязательного заполнения для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Размер КИЗ"
Функция ПроверятьЗаполнениеРазмераКИЗ(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляРазмерКИЗ"),
		ВидПродукцииТоварнаяГруппа);

КонецФункции

// Функция проверяет, требует ли поле "Код ТН ВЭД" обязательного заполнения для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Код ТН ВЭД"
Функция ПроверятьЗаполнениеКодаТНВЭДВТабличнойЧасти(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляКодТНВЭДВТабличнойЧасти"),
		ВидПродукцииТоварнаяГруппа);

КонецФункции

// Функция проверяет, требует ли поле "Способ ввода в оборот" обязательного заполнения для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Способ ввода в оборот"
Функция ПроверятьЗаполнениеСпособаВводаВОборотВТабличнойЧасти(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляСпособВводаВОборотВТабличнойЧасти"),
		ВидПродукцииТоварнаяГруппа);

КонецФункции

// Функция проверяет, требует ли поле "GLN" обязательного заполнения для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "GLN"
Функция ПроверятьЗаполнениеGLNОрганизации(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляGLNОрганизации"),
		ВидПродукцииТоварнаяГруппа,
		Операция);

КонецФункции

// Функция проверяет, требует ли поле "Способ формирования серийного номера" обязательного заполнения для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Способ формирования серийного номера"
Функция ПроверятьЗаполнениеСпособаФормированияСерийныхНомеров(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляСпособФормированияСерийныхНомеров"),
		ВидПродукцииТоварнаяГруппа);

КонецФункции

// Функция проверяет, требует ли поле "Производственная линия" обязательного заполнения для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Производственная линия"
Функция ПроверятьЗаполнениеПоляИдентификаторПроизводственнойЛинии(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот = Неопределено) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляИдентификаторПроизводственнойЛинии"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);

КонецФункции

// Функция проверяет, требует ли поле "Идентификатор производственного объекта" обязательного заполнения для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Идентификатор производственного объекта"
Функция ПроверятьЗаполнениеПоляИдентификаторПроизводственногоОбъекта(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот = Неопределено) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляПроизводственныйОбъектИдентификатор"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);

КонецФункции

// Функция проверяет, требует ли поле "Адрес производственного объекта" обязательного заполнения для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Адрес производственного объекта"
Функция ПроверятьЗаполнениеПоляПроизводственныйОбъектАдресСтрокой(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот = Неопределено) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляПроизводственныйОбъектАдресСтрокой"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);

КонецФункции

// Функция проверяет, требует ли поле "Контрагент" обязательного заполнения для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Контрагент"
Функция ПроверятьЗаполнениеПоляКонтрагент(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот = Неопределено) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляКонтрагент"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);

КонецФункции

// Функция проверяет, требует ли поле "Номенклатура" обязательного заполнения для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Номенклатура"
Функция ПроверятьЗаполнениеПоляНоменклатураВТабличнойЧасти(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот = Неопределено) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляНоменклатураВТабличнойЧасти"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);

КонецФункции

// Функция проверяет, требует ли поле "GTIN" обязательного заполнения для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "GTIN"
Функция ПроверятьЗаполнениеПоляGTIN(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот = Неопределено) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляGTIN"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);

КонецФункции

// Функция проверяет, требует ли поле "Приобретен/ввезен после даты обязательной маркировки" обязательного заполнения для указанного вида продукции и способа ввода в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  СпособВводаВОборот - ПеречислениеСсылка.СпособыВводаВОборотСУЗ
// 
// Возвращаемое значение:
//  Булево - Обязательность заполнения поля "Приобретен/ввезен после даты обязательной маркировки"
Функция ПроверятьЗаполнениеПоляПриобретенПроизведенПослеДатыОбязательнойМаркировки(ВидПродукцииТоварнаяГруппа, СпособВводаВОборот = Неопределено) Экспорт

	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляПриобретенПроизведенПослеДатыОбязательнойМаркировки"),
		ВидПродукцииТоварнаяГруппа,
		СпособВводаВОборот);

КонецФункции

// Функция возвращает список товарных групп, доступных для использования сервис-провайдером.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ТоварныеГруппыГИСМТ
Функция ТоварныеГруппыДоступныеДляСервисПровайдера() Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ"),
		КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСервисПровайдер")));
	
КонецФункции

#КонецОбласти

#Область Прочее

Процедура УстановитьПредставлениеШаблонаВСтроке(Строка) Экспорт
	
	Если Не Строка.ЭтоНабор И Не Строка.ЭтоГрупповаяУпаковка
		Или Не ЗначениеЗаполнено(Строка.ИдентификаторСтрокиВладельца)
		Или Строка.ИдентификаторСтрокиВладельца = Строка.ИдентификаторСтроки Тогда
		Возврат
	КонецЕсли;
	
	Если Строка.ЭтоНабор Тогда
		Дополнение = НСтр("ru = '(входит в набор)'");
	Иначе
		Дополнение = НСтр("ru = '(входит в групповую упаковку)'");
	КонецЕсли;
	
	Строка.ПредставлениеШаблона = СтрШаблон("%1 %2",
		Строка(Строка.Шаблон), Дополнение);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 