&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборПоНаправлению = "Все";
	КонтурЛогистика_ОнбордингСервер.ПриСозданииФормы(ЭтаФорма);
	
	Если КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСерверПовтИсп.РасширениеСДополнительнымиРеквизитамиУстановлено() 
		Или КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФПовтИсп.КонфигурацияСДополнительнымиРеквизитамиУстановлена() Тогда
		Элементы.ФормаОткрытьСправочникНастроекДополнительныхРеквизитов.Видимость = Истина;		
	Иначе
		Элементы.ФормаОткрытьСправочникНастроекДополнительныхРеквизитов.Видимость = Ложь;		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ЗаполнитьНастройкиДополнительныхРеквизитов(, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоНаправлениюПриИзменении(Элемент)
	
	УстановитьОтборДинСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинСписка()
	
	Список.Отбор.Элементы.Очистить(); 
	
	Если  ОтборПоНаправлению <> "Все" Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		ЭлементОтбора.ПравоеЗначение = Ложь;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НаправлениеКонвертации");
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				
		Если ОтборПоНаправлению = "Исходящие" Тогда
			
			ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НаправлениеКонвертации.Исходящее");
			
		ИначеЕсли ОтборПоНаправлению = "Входящие" Тогда
			
			ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НаправлениеКонвертации.Входящее");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникНастроекДополнительныхРеквизитов(Команда)
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_НастройкиДополнительныхРеквизитов.Форма.ФормаСписка",,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОткрытьОнбординг", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОнбординг()
	
	КонтурЛогистика_ОнбордингКлиент.ПриОткрытииФормы(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры