#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	КонтурЗакупки_ЛокализацияВызовСервера.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если КонтурЗакупки_ЛокализацияСервер.ЕстьДок_ЗадачаСотрудника() Тогда
		КнопкаЗадачи = Элементы.Добавить("КомандаСоздатьЗадачуСотруднику", Тип("КнопкаФормы"),
			Элементы.ФормаГруппаСоздатьНаОсновании);
		КнопкаЗадачи.ИмяКоманды = "КомандаСоздатьЗадачуСотруднику";
	КонецЕсли;

	Если КонтурЗакупки_ЛокализацияСервер.ЕстьБП_Задание() Тогда
		КнопкаЗадачи = Элементы.Добавить("КомандаСоздатьЗадание", Тип("КнопкаФормы"),
			Элементы.ФормаГруппаСоздатьНаОсновании);
		КнопкаЗадачи.ИмяКоманды = "КомандаСоздатьЗадание";
	КонецЕсли;

	Если КонтурЗакупки_ЛокализацияСервер.ЕстьДокумент("CRM_Интерес") Тогда
		КнопкаЗадачи = Элементы.Добавить("КомандаСоздатьИнтерес", Тип("КнопкаФормы"),
			Элементы.ФормаГруппаСоздатьНаОсновании);
		КнопкаЗадачи.ИмяКоманды = "КомандаСоздатьИнтерес";
	КонецЕсли;

	Если КонтурЗакупки_ЛокализацияСервер.ЕстьСправочник("СделкиСКлиентами") Тогда
		КнопкаЗадачи = Элементы.Добавить("КомандаСоздатьСделку", Тип("КнопкаФормы"),
			Элементы.ФормаГруппаСоздатьНаОсновании);
		КнопкаЗадачи.ИмяКоманды = "КомандаСоздатьСделку";
	КонецЕсли;

	Если КонтурЗакупки_ЛокализацияСервер.ЕстьДокумент("ЗаказКлиента") Тогда
		КнопкаЗадачи = Элементы.Добавить("КомандаСоздатьЗаказКлиента", Тип("КнопкаФормы"),
			Элементы.ФормаГруппаСоздатьНаОсновании);
		КнопкаЗадачи.ИмяКоманды = "КомандаСоздатьЗаказКлиента";
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Элементы.ФормаОткрытьПрикрепленныеФайлы.Доступность = Истина;
		
		Попытка
			ПапкиФайлов = ПолучитьСоздатьСправочникПапкиФайлов(Объект.Ссылка.УникальныйИдентификатор());
		Исключение
			Элементы.ФормаОткрытьПрикрепленныеФайлы.Доступность = Ложь;
			Элементы.ФормаОткрытьПрикрепленныеФайлыРасширеннаяПодсказка.Заголовок = СтрШаблон(
				НСтр("ru = 'Нет прав на папку %1'"), ПолучитьНаименованиеПапкиФайловВерхнегоУровня());
		КонецПопытки;
			
	КонецЕсли;
	
	ПМ_КомандаСоздатьОбъектПодключаемая = КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ОбработкаЗакупкиКомандаСоздатьОбъектПодключаемая", Неопределено, Ложь);
	Если ПМ_КомандаСоздатьОбъектПодключаемая <> Неопределено Тогда
		Элементы.КнопкаСоздатьОбъектПодключаемая.Заголовок = ПМ_КомандаСоздатьОбъектПодключаемая["Заголовок"];
	Иначе
		Элементы.КнопкаСоздатьОбъектПодключаемая.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьТекстЖелаемаяДатаПодсказка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДанныеПоКодам = ПолучитьИмеющиесяДанныеПоКодам();

	Элементы.ОбъектыЗакупкиОКПД2Код.Видимость = ДанныеПоКодам.ЕстьОКПД2;
	Элементы.ОбъектыЗакупкиОКПД2Расшифровка.Видимость = ДанныеПоКодам.ЕстьОКПД2;

	Элементы.ОбъектыЗакупкиОКВЭД2Код.Видимость = ДанныеПоКодам.ЕстьОКВЭД2;
	Элементы.ОбъектыЗакупкиОКВЭД2Расшифровка.Видимость = ДанныеПоКодам.ЕстьОКВЭД2;

	Элементы.ОбъектыЗакупкиКТРУКод.Видимость = ДанныеПоКодам.ЕстьКТРУ;
	Элементы.ОбъектыЗакупкиКТРУРасшифровка.Видимость = ДанныеПоКодам.ЕстьКТРУ;

	Элементы.ДанныеПоставкиОКПД2Код.Видимость = ДанныеПоКодам.ЕстьОКПД2;
	Элементы.ДанныеПоставкиОКПД2Расшифровка.Видимость = ДанныеПоКодам.ЕстьОКПД2;

	Элементы.ДанныеПоставкиОКВЭД2Код.Видимость = ДанныеПоКодам.ЕстьОКВЭД2;
	Элементы.ДанныеПоставкиОКВЭД2Расшифровка.Видимость = ДанныеПоКодам.ЕстьОКВЭД2;

	Элементы.ДанныеПоставкиКТРУКод.Видимость = ДанныеПоКодам.ЕстьКТРУ;
	Элементы.ДанныеПоставкиКТРУРасшифровка.Видимость = ДанныеПоКодам.ЕстьКТРУ;

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	КонтурЗакупки_ЛокализацияКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусОбработкиЗакупкиПриИзменении(Элемент)
	СброситьПризнакЗадания();
	УстановитьПользователяПоСтатусу();
	Если ПроверитьЗаполнение() Тогда
		Элементы.КартинкаПравильностьЗаполнения.Картинка = БиблиотекаКартинок.КонтурЗакупки_Проверено;
	Иначе
		Элементы.КартинкаПравильностьЗаполнения.Картинка = БиблиотекаКартинок.КонтурЗакупки_Предупреждение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	СброситьПризнакЗадания();
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованияПриИзменении(Элемент)

	Если Объект.ОбъектыЗакупки.Количество() > 0 Тогда
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ДокументОснованияПриИзмененииОтвет", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Документ не пустой.
							|Выбор документа очистит все предыдущие данные.
							|Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницыДокументаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаШапка Тогда
		Объект.СуммаЗатрат = Объект.ОбъектыЗакупки.Итог("СуммаЗатрат");
		Объект.СуммаЗатратВЦене = Объект.ОбъектыЗакупки.Итог("СуммаЗатратВЦене");
		Объект.СуммаЗакупки = Объект.ОбъектыЗакупки.Итог("ОбщаяСтоимостьОбъекта");
		Объект.СуммаПоставщика = Объект.ОбъектыЗакупки.Итог("СуммаПоставщика");
		Объект.СуммаПродажи = Объект.ОбъектыЗакупки.Итог("СуммаПродажи");
		Объект.СуммаПрибыли = Объект.ОбъектыЗакупки.Итог("СуммаПрибыли");
		Объект.Вес = Объект.ОбъектыЗакупки.Итог("Вес");
		Объект.Объем = Объект.ОбъектыЗакупки.Итог("Объем");
		Если Объект.СуммаПоставщика > 0 Тогда
			Объект.ПроцентМаржи = Объект.СуммаПрибыли * 100 / Объект.СуммаПоставщика;
		Иначе
			Объект.ПроцентМаржи = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыЗакупки
&НаКлиенте
Процедура ДокументыЗакупкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ДокументыЗакупкиИмяФайла Тогда
		ПерейтиПоНавигационнойСсылке(Элемент.ТекущиеДанные.СсылкаНаФайл);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыЗакупки

&НаКлиенте
Процедура ОбъектыЗакупкиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ИдентификаторСтроки = Элементы.ОбъектыЗакупки.ТекущаяСтрока;
	ОповещениеВопросПередУдалениемСтроки = Новый ОписаниеОповещения("ОповещениеВопросПередУдалениемСтроки", ЭтотОбъект,
		ИдентификаторСтроки);
	ПоказатьВопрос(ОповещениеВопросПередУдалениемСтроки, НСтр("ru = 'Удалить строку?'"), РежимДиалогаВопрос.ДаНет, ,
		КодВозвратаДиалога.Нет);
КонецПроцедуры
&НаКлиенте
Процедура ОбъектыЗакупкиСтоимостьЗаЕдиницуОбъектаПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ОбъектыЗакупки.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.ОбщаяСтоимостьОбъекта = ТекущаяСтрока.СтоимостьЗаЕдиницуОбъекта * ТекущаяСтрока.Количество;
		ПересчитатьПрибыль(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыЗакупкиОбщаяСтоимостьОбъектаПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ОбъектыЗакупки.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		Если Не ТекущаяСтрока.Количество = 0 Тогда
			ТекущаяСтрока.СтоимостьЗаЕдиницуОбъекта  = ТекущаяСтрока.ОбщаяСтоимостьОбъекта / ТекущаяСтрока.Количество;
			ПересчитатьПрибыль(ТекущаяСтрока);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыЗакупкиКоличествоПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ОбъектыЗакупки.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.ОбщаяСтоимостьОбъекта = ТекущаяСтрока.СтоимостьЗаЕдиницуОбъекта * ТекущаяСтрока.Количество;
		ПересчитатьПрибыль(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеПоставки

&НаКлиенте
Процедура ДанныеПоставкиНоменклатураПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ПриИзмененииНоменклатуры(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ИдентификаторСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;
	ОповещениеВопросПередУдалениемСтроки = Новый ОписаниеОповещения("ОповещениеВопросПередУдалениемСтроки", ЭтотОбъект,
		ИдентификаторСтроки);
	ПоказатьВопрос(ОповещениеВопросПередУдалениемСтроки, НСтр("ru='Удалить строку?'"), РежимДиалогаВопрос.ДаНет, ,
		КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиПоставщикПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ОбъектыЗакупкиДанныеПоставкиПоставщикПриИзмененииНаСервере(ИДТекущейСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиОбъемЕдиницыПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.Объем = ТекущаяСтрока.ОбъемЕдиницы * ТекущаяСтрока.КоличествоПоставщика;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиВесЕдиницыПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.Вес = ТекущаяСтрока.ВесЕдиницы * ТекущаяСтрока.КоличествоПоставщика;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиОбъемПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		Если Не ТекущаяСтрока.КоличествоПоставщика = 0 Тогда
			ТекущаяСтрока.ОбъемЕдиницы = ТекущаяСтрока.Объем / ТекущаяСтрока.КоличествоПоставщика;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиВесПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		Если Не ТекущаяСтрока.КоличествоПоставщика = 0 Тогда
			ТекущаяСтрока.ВесЕдиницы = ТекущаяСтрока.Вес / ТекущаяСтрока.КоличествоПоставщика;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура ОбъектыЗакупкиДанныеПоставкиНоменклатураПриИзменении(Элемент)
//	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;
//	Если Не ИДТекущейСтроки = Неопределено Тогда
//
//		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
//		ПриИзмененииНоменклатуры(ТекущаяСтрока);
//	КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиСуммаПоставщикаПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);

		ПриИзмененииСуммыПоставщика(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиСуммаПоставщикаБезНДСПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда
	
		//@skip-check invocation-parameter-type-intersect
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		Если Не ТекущаяСтрока.КоличествоПоставщика = 0 Тогда
			ТекущаяСтрока.ЦенаПоставщикаБезНДС = ТекущаяСтрока.СуммаПоставщикаБезНДС
				/ ТекущаяСтрока.КоличествоПоставщика;

			ТекущаяСтрока.СуммаПоставщика = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуСНДС(
					ТекущаяСтрока.СуммаПоставщикаБезНДС, ТекущаяСтрока.СтавкаНДСПоставщика);

			ТекущаяСтрока.ЦенаПоставщика = ТекущаяСтрока.СуммаПоставщика / ТекущаяСтрока.КоличествоПоставщика;

//			ТекущаяСтрока.СуммаПоставщика = ТекущаяСтрока.ЦенаПоставщика * ТекущаяСтрока.КоличествоПоставщика;

			ТекущаяСтрока.СуммаНДСПоставщика = ТекущаяСтрока.СуммаПоставщика - ТекущаяСтрока.СуммаПоставщикаБезНДС;
			ПересчитатьПрибыль(ТекущаяСтрока);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиСуммаНДСПоставщикаПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		Если Не ТекущаяСтрока.КоличествоПоставщика = 0 Тогда
			ТекущаяСтрока.СуммаПоставщика = ТекущаяСтрока.СуммаНДСПоставщика + ТекущаяСтрока.СуммаПоставщикаБезНДС;

			ТекущаяСтрока.ЦенаПоставщика = ТекущаяСтрока.СуммаПоставщика / ТекущаяСтрока.КоличествоПоставщика;

			ТекущаяСтрока.ЦенаПоставщикаБезНДС = ТекущаяСтрока.СуммаПоставщикаБезНДС
				/ ТекущаяСтрока.КоличествоПоставщика;

			ПересчитатьПрибыль(ТекущаяСтрока);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиСтавкаНДСПоставщикаПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда

		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);

		ТекущаяСтрока.СуммаПоставщикаБезНДС = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуБезНДС(
					ТекущаяСтрока.СуммаПоставщика, ТекущаяСтрока.СтавкаНДСПоставщика);

		ТекущаяСтрока.СуммаНДСПоставщика = ТекущаяСтрока.СуммаПоставщика - ТекущаяСтрока.СуммаПоставщикаБезНДС;

		Если Не ТекущаяСтрока.КоличествоПоставщика = 0 Тогда
			ТекущаяСтрока.ЦенаПоставщикаБезНДС = ТекущаяСтрока.СуммаПоставщикаБезНДС
				/ ТекущаяСтрока.КоличествоПоставщика;
		КонецЕсли;
		ПересчитатьПрибыль(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиКоличествоПоставщикаПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ПриИзмененииКоличествоПоставщика(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиЦенаПоставщикаПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда

		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.СуммаПоставщика = ТекущаяСтрока.ЦенаПоставщика * ТекущаяСтрока.КоличествоПоставщика;

		ТекущаяСтрока.ЦенаПоставщикаБезНДС = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуБезНДС(
				ТекущаяСтрока.ЦенаПоставщика, ТекущаяСтрока.СтавкаНДСПоставщика);

		ТекущаяСтрока.СуммаПоставщикаБезНДС = ТекущаяСтрока.ЦенаПоставщикаБезНДС * ТекущаяСтрока.КоличествоПоставщика;

		ТекущаяСтрока.СуммаНДСПоставщика = ТекущаяСтрока.СуммаПоставщика - ТекущаяСтрока.СуммаПоставщикаБезНДС;
		ПересчитатьПрибыль(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоставкиЦенаПоставщикаБезНДСПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда

		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.СуммаПоставщикаБезНДС = ТекущаяСтрока.ЦенаПоставщикаБезНДС * ТекущаяСтрока.КоличествоПоставщика;

		ТекущаяСтрока.ЦенаПоставщика = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуСНДС(
			ТекущаяСтрока.ЦенаПоставщикаБезНДС, ТекущаяСтрока.СтавкаНДСПоставщика);

		ТекущаяСтрока.СуммаПоставщика = ТекущаяСтрока.ЦенаПоставщика * ТекущаяСтрока.КоличествоПоставщика;

		ТекущаяСтрока.СуммаНДСПоставщика = ТекущаяСтрока.СуммаПоставщика - ТекущаяСтрока.СуммаПоставщикаБезНДС;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДанныеПоставкиПоставкаНевозможнаПриИзменении(Элемент)
	
	Если Элементы.ДанныеПоставки.ТекущиеДанные.ПоставкаНевозможна И СтрокаОбъектаЗакупкиЗаполнена(Элементы.ДанныеПоставки.ТекущиеДанные) Тогда
		ДополнительныеПараметры = Новый Структура("ТекущаяСтрока", Элементы.ДанныеПоставки.ТекущиеДанные);
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОчистка", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Очистить данные в строке?';"
		+ " en = 'Clean row data?'"), Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОчистка(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	МассивИменРеквизитов = МассивИменРеквизитовСтрокиОбъектаЗакупки();
	ТекущаяСтрока = ДополнительныеПараметры.ТекущаяСтрока;
	ТекущаяСтрока.ПозицияВыиграна = Ложь;
	Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока[ИмяРеквизита]) Тогда
			ТекущаяСтрока[ИмяРеквизита] = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКП

&НаКлиенте
Процедура КПСуммаЗатратВЦенеПриИзменении(Элемент)
	ПриИзмененииСуммыЗатрат();
КонецПроцедуры

&НаКлиенте
Процедура КПЦенаПродажиПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.КП.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.ЦенаПродажиБезНДС = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуБезНДС(
					ТекущаяСтрока.ЦенаПродажи, ТекущаяСтрока.СтавкаНДСПродажи);
		ТекущаяСтрока.СуммаПродажи = ТекущаяСтрока.ЦенаПродажи * ТекущаяСтрока.КоличествоПоставщика;
		ПриИзмененииСуммыПродажи(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КПЦенаПродажиБезНДСПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.КП.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.ЦенаПродажи = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуСНДС(
					ТекущаяСтрока.ЦенаПродажиБезНДС, ТекущаяСтрока.СтавкаНДСПродажи);
		ТекущаяСтрока.СуммаПродажи = ТекущаяСтрока.ЦенаПродажи * ТекущаяСтрока.КоличествоПоставщика;
		ПриИзмененииСуммыПродажи(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КПСтавкаНДСПродажиПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.КП.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.ЦенаПродажиБезНДС = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуБезНДС(
					ТекущаяСтрока.ЦенаПродажи, ТекущаяСтрока.СтавкаНДСПродажи);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КППередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ИдентификаторСтроки = Элементы.КП.ТекущаяСтрока;
	ОповещениеВопросПередУдалениемСтроки = Новый ОписаниеОповещения("ОповещениеВопросПередУдалениемСтроки", ЭтотОбъект,
		ИдентификаторСтроки);
	ПоказатьВопрос(ОповещениеВопросПередУдалениемСтроки, НСтр("ru='Удалить строку?'"), РежимДиалогаВопрос.ДаНет, ,
		КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура КПСуммаПоставщикаПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.КП.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ПриИзмененииСуммыПоставщика(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КПСуммаНаценкиПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.КП.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.СуммаПродажи = ТекущаяСтрока.СуммаПоставщика + ТекущаяСтрока.СуммаНаценки
			+ ТекущаяСтрока.СуммаЗатратВЦене;
			
		Если Не ТекущаяСтрока.СуммаПоставщика = 0 Тогда
			ТекущаяСтрока.ПроцентНаценки = ТекущаяСтрока.СуммаНаценки * 100 / ТекущаяСтрока.СуммаПоставщика;
		Иначе
			ТекущаяСтрока.ПроцентНаценки = 0;
		КонецЕсли;

		ПересчитатьЦеныПродажи(ТекущаяСтрока);
		ПересчитатьПрибыль(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КПСуммаЗатратПриИзменении(Элемент)
	ПриИзмененииСуммыЗатрат();
КонецПроцедуры

&НаКлиенте
Процедура КППроцентНаценкиПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.КП.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.СуммаНаценки = ТекущаяСтрока.СуммаПоставщика * (ТекущаяСтрока.ПроцентНаценки / 100);
		ТекущаяСтрока.СуммаПродажи = ТекущаяСтрока.СуммаПоставщика + ТекущаяСтрока.СуммаНаценки
			+ ТекущаяСтрока.СуммаЗатратВЦене;

		ПересчитатьЦеныПродажи(ТекущаяСтрока);
		ПересчитатьПрибыль(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КПСуммаПродажиПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.КП.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ПриИзмененииСуммыПродажи(ТекущаяСтрока);
		ПересчитатьЦеныПродажи(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыЗатрат

&НаКлиенте
Процедура ЗатратыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
	НазначитьЗатратыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыСтавкаНДСПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ОбъектыЗатрат.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗатрат.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.СуммаБезНДС = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуБезНДС(
				ТекущаяСтрока.Сумма, ТекущаяСтрока.СтавкаНДС);
		ТекущаяСтрока.СуммаНДС = ТекущаяСтрока.Сумма - ТекущаяСтрока.СуммаБезНДС;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыСуммаБезНДСПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ОбъектыЗатрат.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда

		ТекущаяСтрока = Объект.ОбъектыЗатрат.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.Сумма = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуСНДС(
			ТекущаяСтрока.СуммаБезНДС, ТекущаяСтрока.СтавкаНДС);
		ТекущаяСтрока.СуммаНДС = ТекущаяСтрока.Сумма - ТекущаяСтрока.СуммаБезНДС;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ЗатратыСуммаПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ОбъектыЗатрат.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда

		ТекущаяСтрока = Объект.ОбъектыЗатрат.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.СуммаБезНДС = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуБезНДС(
			ТекущаяСтрока.Сумма, ТекущаяСтрока.СтавкаНДС);
		ТекущаяСтрока.СуммаНДС = ТекущаяСтрока.Сумма - ТекущаяСтрока.СуммаБезНДС;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыСуммаНДСПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ОбъектыЗатрат.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда

		ТекущаяСтрока = Объект.ОбъектыЗатрат.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.Сумма = ТекущаяСтрока.СуммаБезНДС + ТекущаяСтрока.СуммаНДС;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыСтатьяЗатратПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ОбъектыЗатрат.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда

		ТекущаяСтрока = Объект.ОбъектыЗатрат.НайтиПоИдентификатору(ИДТекущейСтроки);
		СтруктураСуммыСтатьиЗатрат = ПолучитьСуммыСтатьиЗатрат(ТекущаяСтрока.СтатьяЗатрат);
		Если СтруктураСуммыСтатьиЗатрат.Сумма > 0 Тогда
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСуммыСтатьиЗатрат);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыЗатратПриИзменении(Элемент)
	
	РаспределениеЗатратНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПользователиПоРолям

&НаКлиенте
Процедура ПользователиПоРолямПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПользователиПоРолямПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
&НаКлиенте
Процедура ПользователиПоРолямПользовательНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(ПользователиПоРолямНаСервере(
		Элементы.ПользователиПоРолям.ТекущиеДанные.РольИмя));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОрганизаторыЗаказчики
&НаКлиенте
Процедура ОрганизаторыЗаказчикиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		Элемент.ТекущиеДанные.ЭтоОрганизатор = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизаторыЗаказчикиПередНачаломИзменения(Элемент, Отказ)
	ИДСтроки = Элементы.ОрганизаторыЗаказчики.ТекущаяСтрока;
	Если Элемент.ТекущиеДанные.ЭтоОрганизатор Тогда
		Отказ = Истина;
	Иначе
		Для Каждого СтрокаОЗ Из Объект.ОрганизаторыЗаказчики Цикл
			Если СтрокаОЗ.ЭтоОрганизатор И Не СтрокаОЗ.ПолучитьИдентификатор() = ИДСтроки Тогда
				СтрокаОЗ.ЭтоОрганизатор = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизаторыЗаказчикиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Элемент.ТекущиеДанные.ЭтоОрганизатор Тогда
		Объект.Организатор = Элемент.ТекущиеДанные.ОрганизаторЗаказчик;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСоздатьЗадачуСотруднику(Команда)
	ОписаниеРезультата = "";
	ТипОбъекта = КонтурЗакупки_ЛокализацияВызовСервера.ПредставлениеТипаЗадачаСотрудника();
	ЗадачаСсылка = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьСсылкуНаОбъектИзПривязки(
		Объект.Ссылка, ТипОбъекта, "");
	Создавать = Ложь;

	Если ЗадачаСсылка = Неопределено Тогда
		Создавать = Истина;
	КонецЕсли;

	Если Создавать Тогда
		ЗадачуСотрудникуСсылка = КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"СоздатьЗадачуСотруднику", Объект.Ссылка, Истина);

		Если ЗадачуСотрудникуСсылка = Неопределено Тогда
			Если КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьЗадачуСотруднику(Объект.Ссылка,
				ЗадачаСсылка, ОписаниеРезультата) Тогда

				КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьПривязкуОбработкиЗакупки(
					Объект.Ссылка, ТипОбъекта, "", ЗадачаСсылка.УникальныйИдентификатор(), Строка(ЗадачаСсылка));
			Иначе
				КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеРезультата);
			КонецЕсли;
		Иначе
			КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьПривязкуОбработкиЗакупки(Объект.Ссылка,
				ТипОбъекта, "", ЗадачаСсылка.УникальныйИдентификатор(), Строка(ЗадачаСсылка));
		КонецЕсли;
	КонецЕсли;

	СтруктураЗадача = Новый Структура("Ключ", ЗадачаСсылка);
		//@skip-check bsl-legacy-check-string-literal
	ОткрытьФорму("Документ.ЗадачаСотрудника.ФормаОбъекта", СтруктураЗадача);

КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗадание(Команда)
	ОписаниеРезультата = "";
	ТипОбъекта = КонтурЗакупки_ЛокализацияВызовСервера.ПредставлениеТипаЗадание();
	ЗаданиеСсылка  = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьСсылкуНаОбъектИзПривязки(
		Объект.Ссылка, ТипОбъекта, "");
	Создавать = Ложь;

	Если ЗаданиеСсылка = Неопределено Тогда
		Создавать = Истина;
	КонецЕсли;

	Если Создавать Тогда
		ЗаданиеСсылка = КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"СоздатьЗадание", Объект.Ссылка, Истина);

		Если ЗаданиеСсылка = Неопределено Тогда
			Если КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьЗадание(Объект.Ссылка,
				ЗаданиеСсылка, ОписаниеРезультата) Тогда

				КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьПривязкуОбработкиЗакупки(
					Объект.Ссылка, ТипОбъекта, "", ЗаданиеСсылка.УникальныйИдентификатор(), Строка(ЗаданиеСсылка));
			Иначе
				КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеРезультата);
			КонецЕсли;
		Иначе
			КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьПривязкуОбработкиЗакупки(Объект.Ссылка,
				ТипОбъекта, "", ЗаданиеСсылка.УникальныйИдентификатор(), Строка(ЗаданиеСсылка));
		КонецЕсли;
	КонецЕсли;

	СтруктураЗадание = Новый Структура("Ключ", ЗаданиеСсылка);
		//@skip-check bsl-legacy-check-string-literal
	ОткрытьФорму("БизнесПроцесс.Задание.ФормаОбъекта", СтруктураЗадание);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьИнтерес(Команда)
	ОписаниеРезультата = "";
	ТипОбъекта = КонтурЗакупки_ЛокализацияВызовСервера.ПредставлениеТипаИнтерес();
	ИнтересСсылка = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьСсылкуНаОбъектИзПривязки(
		Объект.Ссылка, ТипОбъекта, "");
	Создавать = Ложь;

	Если ИнтересСсылка = Неопределено Тогда
		Создавать = Истина;
	КонецЕсли;

	Если Создавать Тогда
		ИнтересСсылка = КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"СоздатьИнтерес", Объект.Ссылка, Истина);

		Если ИнтересСсылка = Неопределено Тогда
			Если КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьИнтерес(Объект.Ссылка,
				ИнтересСсылка, ОписаниеРезультата) Тогда

				КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьПривязкуОбработкиЗакупки(
					Объект.Ссылка, ТипОбъекта, "", ИнтересСсылка.УникальныйИдентификатор(), Строка(ИнтересСсылка));
			Иначе
				КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеРезультата);
			КонецЕсли;
		Иначе
			КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьПривязкуОбработкиЗакупки(Объект.Ссылка,
				ТипОбъекта, "", ИнтересСсылка.УникальныйИдентификатор(), Строка(ИнтересСсылка));
		КонецЕсли;
	КонецЕсли;

	СтруктураИнтерес = Новый Структура("Ключ", ИнтересСсылка);
		//@skip-check bsl-legacy-check-string-literal
	ОткрытьФорму("Документ.CRM_Интерес.ФормаОбъекта", СтруктураИнтерес);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьСделку(Команда)
	ТипОбъекта = КонтурЗакупки_ЛокализацияВызовСервера.ПредставлениеТипаСделка();
	МассивСделкаСсылка  = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьМассивСсылокНаОбъектИзПривязки(
		Объект.Ссылка, ТипОбъекта);

	Если МассивСделкаСсылка.Количество() > 0 Тогда
		СписокКнопокВопроса = Новый СписокЗначений;
		СписокКнопокВопроса.Добавить("Открыть", НСтр("ru='Открыть существующую'"));
		СписокКнопокВопроса.Добавить("Создать", НСтр("ru='Создать новую'"));
		СписокКнопокВопроса.Добавить("Отмена", НСтр("ru='Отмена'"));
		ПослеОтветаОСозданииСделки = Новый ОписаниеОповещения("ПослеОтветаОСозданииСделки", ЭтотОбъект,
			МассивСделкаСсылка);
		ПоказатьВопрос(ПослеОтветаОСозданииСделки, НСтр("ru='Сделка уже существует'"), СписокКнопокВопроса);
	Иначе
		СделкаСсылка = СоздатьСделкуНаКлиенте();
		ОткрытьФорму("Справочник.СделкиСКлиентами.ФормаОбъекта", Новый Структура("Ключ", СделкаСсылка));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьЗатраты(Команда)
	ЗаполнитьПредставлениеЗатратНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НазначитьЗатраты(Команда)
	НазначитьЗатратыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрикрепленныеФайлы(Команда)
	
	Если ЗначениеЗаполнено(ПапкиФайлов) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВладелецФайла", ПапкиФайлов);
		ПараметрыФормы.Вставить("СкрыватьВладельца", Истина);
		ПараметрыФормы.Вставить("ТекущаяСтрока", УникальныйИдентификатор);
		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, ЭтотОбъект, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадание(Команда)
	СоздатьЗаданиеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыиграныВсеПозиции(Команда)
	Для Каждого СтрокаТЧ Из Объект.ОбъектыЗакупки Цикл
		СтрокаТЧ.ПозицияВыиграна = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РазделитьСтрокуПоКоличеству(Команда)
	ИДТекущейСтроки = Элементы.ОбъектыЗакупки.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		НачатьРазделениеСтроки(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазделитьСтрокуПоКоличествуПоставщика(Команда)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		НачатьРазделениеСтрокиКоличествоПоставщика(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеПривязки(Команда)
	ИДТекущейСтроки = Элементы.ДанныеПоставки.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);

		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ОбъектЗакупки", ТекущаяСтрока.ОбъектЗакупки);

		СписокОрганизаторов = Новый СписокЗначений;
		СписокОрганизаторов.ЗагрузитьЗначения(ПолучитьМассивОрганизаторов());
		ПараметрыОткрытия.Вставить("СписокОрганизаторов", СписокОрганизаторов);

		ОткрытьФорму(
			"РегистрСведений.КонтурЗакупки_СоответствиеНоменклатуры.Форма.ФормаРедактированиеПривязки",
			ПараметрыОткрытия, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСуммуПродажиРавнойОбщейСтоимости(Команда)
	Для Каждого ТекущаяСтрока Из Объект.ОбъектыЗакупки Цикл
		ТекущаяСтрока.СуммаПродажи = ТекущаяСтрока.ОбщаяСтоимостьОбъекта;
		ПриИзмененииСуммыПродажи(ТекущаяСтрока);
		ПересчитатьЦеныПродажи(ТекущаяСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоПоставкиИзКоличестваЗакупки(Команда)
	Для Каждого СтрокаТЧ Из Объект.ОбъектыЗакупки Цикл
		Если Не СтрокаТЧ.ПоставкаНевозможна Тогда
			СтрокаТЧ.КоличествоПоставщика = СтрокаТЧ.Количество;
			ПриИзмененииКоличествоПоставщика(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеНоменклатурыИзФайла(Команда)

	Если ЕстьОбъектыЗакупки() Тогда
		СписокКнопокВопроса = Новый СписокЗначений;
		СписокКнопокВопроса.Добавить("Очистить", НСтр("ru='Очистить и загрузить'"));
		СписокКнопокВопроса.Добавить("НеОчищать", НСтр("ru='Не очищать и загрузить'"));
		СписокКнопокВопроса.Добавить("Отмена", НСтр("ru='Отмена'"));
		ПослеОтветаОЗагрузке = Новый ОписаниеОповещения("ПослеОтветаОЗагрузке", ЭтотОбъект);
		ПоказатьВопрос(ПослеОтветаОЗагрузке, НСтр("ru='Имеются объекты закупки'"), СписокКнопокВопроса);
	Иначе
		ЗагрузитьОбъектыЗакупки();
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура УстановитьПроцентНаценки(Команда)
	ОповещениеОВводе = Новый ОписаниеОповещения("ПриОкончанииВводаПроцентаНаценки", ЭтотОбъект);
	ПоказатьВводЧисла(ОповещениеОВводе, 0, НСтр("ru = 'Введите процент наценки'"), 10, 2);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПроцентНаценкиДляВыделенныхСтрок(Команда)
	ОповещениеОВводе = Новый ОписаниеОповещения("ПриОкончанииВводаПроцентаНаценкиДляСтрок", ЭтотОбъект);
	ПоказатьВводЧисла(ОповещениеОВводе, 0, НСтр("ru = 'Введите процент наценки'"), 10, 2);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПроцентНаценкиПоПараметрам(Команда)
	УстановитьНаценкиНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеНоменклатурыИзПривязки(Команда)
	ЗаполнениеНоменклатурыИзПривязкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспределениеЗатрат(Команда)
	РаспределениеЗатратНаСервере();
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	КонтурЗакупки_ЛокализацияКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	КонтурЗакупки_ЛокализацияКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаданиеНаСогласованииУЛогиста(Команда)
	СоздатьЗаданиеНаСогласованииУЛогистаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСрокПодготовкиПродукцииУПоставщика(Команда)
	ЗавершениеВводаСрока = Новый ОписаниеОповещения("ОкончаниеВводаСрокаПодготовки", ЭтотОбъект);
	ПоказатьВводЧисла(ЗавершениеВводаСрока, , НСтр("ru = 'Введите срок подготовки у поставщика'"), 15, 0);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСрокДоставкиДоЗаказчика(Команда)
	ЗавершениеВводаСрока = Новый ОписаниеОповещения("ОкончаниеВводаСрокаДоставки", ЭтотОбъект);
	ПоказатьВводЧисла(ЗавершениеВводаСрока, , НСтр("ru = 'Введите срок доставки до заказчика'"), 15, 0);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗаказКлиента(Команда)
	ОписаниеРезультата = "";
	ТипОбъекта = КонтурЗакупки_ЛокализацияВызовСервера.ПредставлениеТипаЗаказКлиента();
	ЗаказКлиентаСсылка  = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьСсылкуНаОбъектИзПривязки(
		Объект.Ссылка, ТипОбъекта, "");
	Создавать = Ложь;

	Если ЗаказКлиентаСсылка = Неопределено Тогда
		Создавать = Истина;
	КонецЕсли;

	Если Создавать Тогда
		ЗаказКлиентаСсылка = КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"СоздатьЗаказКлиента", Объект.Ссылка, Истина);

		Если ЗаказКлиентаСсылка = Неопределено Тогда
			Если КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьЗаказКлиента(Объект.Ссылка,
				ЗаказКлиентаСсылка, ОписаниеРезультата) Тогда

				КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьПривязкуОбработкиЗакупки(
					Объект.Ссылка, ТипОбъекта, "", ЗаказКлиентаСсылка.УникальныйИдентификатор(), Строка(
					ЗаказКлиентаСсылка));
			Иначе
				КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеРезультата);
			КонецЕсли;
		Иначе
			КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьПривязкуОбработкиЗакупки(Объект.Ссылка,
				ТипОбъекта, "", ЗаказКлиентаСсылка.УникальныйИдентификатор(), Строка(ЗаказКлиентаСсылка));
		КонецЕсли;
	КонецЕсли;

	СтруктураЗаказКлиента = Новый Структура("Ключ", ЗаказКлиентаСсылка);
		//@skip-check bsl-legacy-check-string-literal
	ОткрытьФорму("Документ.ЗаказКлиента.ФормаОбъекта", СтруктураЗаказКлиента);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВыиграныВсе(Команда)
	УстановитьСнятьВыиграныВсе(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыиграныВсе(Команда)
	УстановитьСнятьВыиграныВсе(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьОбъектПодключаемая(Команда)
	
	ОписаниеРезультата = "";
	
	ПМ_КомандаСоздатьОбъектПодключаемая = КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ОбработкаЗакупкиКомандаСоздатьОбъектПодключаемая", Неопределено, Ложь);
	ТипОбъекта = ПМ_КомандаСоздатьОбъектПодключаемая["ТипОбъекта"];
	РезультатСсылка  = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьСсылкуНаОбъектИзПривязки(
		Объект.Ссылка, ТипОбъекта, "");
		
	Если Не ЗначениеЗаполнено(РезультатСсылка) Тогда
		РезультатСсылка = КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"ОбработкаЗакупкиСоздатьОбъектПодключаемая", Объект.Ссылка, Истина);
		Если РезультатСсылка <> Неопределено Тогда
			КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьПривязкуОбработкиЗакупки(Объект.Ссылка,
				ТипОбъекта, "", РезультатСсылка.УникальныйИдентификатор(), Строка(РезультатСсылка));
		КонецЕсли;
	КонецЕсли;

	ПоказатьЗначение(, РезультатСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОтветаОСозданииСделки(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = "Открыть" Тогда

		Если ДополнительныеПараметры.Количество() = 1 Тогда
			СтруктураСделка = Новый Структура("Ключ", ДополнительныеПараметры[0]);
			ОткрытьФорму("Справочник.СделкиСКлиентами.ФормаОбъекта", СтруктураСделка);
		Иначе
			СписокВыбора = Новый СписокЗначений;
			СписокВыбора.ЗагрузитьЗначения(ДополнительныеПараметры);

			ПослеВыбораСделки = Новый ОписаниеОповещения("ПослеВыбораСделки", ЭтотОбъект);
			СписокВыбора.ПоказатьВыборЭлемента(ПослеВыбораСделки);
		КонецЕсли;
	ИначеЕсли РезультатВопроса = "Создать" Тогда
		СделкаСсылка = СоздатьСделкуНаКлиенте();
		СтруктураСделка = Новый Структура("Ключ", СделкаСсылка);
		ОткрытьФорму("Справочник.СделкиСКлиентами.ФормаОбъекта", СтруктураСделка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСделки(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		СтруктураСделка = Новый Структура("Ключ", ВыбранныйЭлемент.Значение);
		ОткрытьФорму("Справочник.СделкиСКлиентами.ФормаОбъекта", СтруктураСделка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция СоздатьСделкуНаКлиенте()
	ОписаниеРезультата = "";
	ТипОбъекта = КонтурЗакупки_ЛокализацияВызовСервера.ПредставлениеТипаСделка();
	СделкаСсылка = КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
				"СоздатьСделку", Объект.Ссылка, Истина);

	Если СделкаСсылка = Неопределено Тогда
		Если КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьСделку(Объект.Ссылка, СделкаСсылка,
			ОписаниеРезультата) Тогда

			КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьПривязкуОбработкиЗакупки(
						Объект.Ссылка, ТипОбъекта, Строка(СделкаСсылка.УникальныйИдентификатор()),
				СделкаСсылка.УникальныйИдентификатор(), Строка(СделкаСсылка));
		Иначе
			КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеРезультата);
		КонецЕсли;
	Иначе
		КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьПривязкуОбработкиЗакупки(Объект.Ссылка,
			ТипОбъекта, Строка(СделкаСсылка.УникальныйИдентификатор()), СделкаСсылка.УникальныйИдентификатор(), Строка(
			СделкаСсылка));
	КонецЕсли;
	Возврат СделкаСсылка;
КонецФункции

&НаКлиенте
Процедура УстановитьСнятьВыиграныВсе(Флаг)
	Для Каждого СтрокаТЗ Из Объект.ОбъектыЗакупки Цикл
		Если Не СтрокаТЗ.ПоставкаНевозможна Тогда
			СтрокаТЗ.ПозицияВыиграна = Флаг;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВводаСрокаПодготовки(ВведенноеЧисло, ДополнительныеПараметры) Экспорт
	Для Каждого СтрокаТЧ Из Объект.ОбъектыЗакупки Цикл
		Если Не СтрокаТЧ.ПоставкаНевозможна Тогда
			СтрокаТЧ.СрокПодготовкиПродукцииУПоставщика = ВведенноеЧисло;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВводаСрокаДоставки(ВведенноеЧисло, ДополнительныеПараметры) Экспорт
	Для Каждого СтрокаТЧ Из Объект.ОбъектыЗакупки Цикл
		Если Не СтрокаТЧ.ПоставкаНевозможна Тогда
			СтрокаТЧ.СрокДоставкиДоЗаказчика = ВведенноеЧисло;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьПользователяПоСтатусу()
	РольПользователя = Неопределено;
	Если Объект.СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.НаСогласованииУЛогиста Тогда
		РольПользователя = Метаданные.Роли.КонтурЗакупки_ОтделЛогистики;
	ИначеЕсли Объект.СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.ПустаяСсылка()
		Или Объект.СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.Новая
		Или Объект.СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.СогласованСЛогистом
		Или Объект.СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.ПоданаЗаявкаНаУчастие
		Или Объект.СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.ЗаключениеДоговора Тогда
		РольПользователя = Метаданные.Роли.КонтурЗакупки_ОтделПродаж;
	ИначеЕсли Объект.СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.ПринятВРаботу
		Или Объект.СтатусОбработкиЗакупки = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.Переторжка Тогда
		РольПользователя = Метаданные.Роли.КонтурЗакупки_ОтделСнабжения;
	КонецЕсли;
	Если Не РольПользователя = Неопределено Тогда
		Отбор = Новый Структура("РольИмя", РольПользователя.Имя);
		СтрокиСПользователями = Объект.ПользователиПоРолям.НайтиСтроки(Отбор);
		Если СтрокиСПользователями.Количество() > 0 Тогда
			Объект.Пользователь = СтрокиСПользователями[0].Пользователь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросПередУдалениемСтроки(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьСтрокуНаСервере(ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуНаСервере(ИдентификаторСтроки)
	СтрокаПоИдентификатору = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИдентификаторСтроки);
	Объект.ОбъектыЗакупки.Удалить(СтрокаПоИдентификатору);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаОЗагрузке(Результат, Параметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		Если Результат = "Очистить" Тогда
			ОчиститьТабличнуюЧастьОбъектов();
			ЗагрузитьОбъектыЗакупки();
		ИначеЕсли Результат = "НеОчищать" Тогда
			ЗагрузитьОбъектыЗакупки();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ОчиститьТабличнуюЧастьОбъектов()
	Объект.ОбъектыЗакупки.Очистить();
КонецПроцедуры
&НаСервере
Функция ЕстьОбъектыЗакупки()
	Возврат Объект.ОбъектыЗакупки.Количество() > 0;
КонецФункции
&НаКлиенте
Процедура ЗагрузитьОбъектыЗакупки()
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "Документ.КонтурЗакупки_ОбработкаЗакупки.ОбъектыЗакупки";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка из файла'");
	СтруктураДопПараметры = Новый Структура;
	СтруктураДопПараметры.Вставить("МассивОрганизаторов", ПолучитьМассивОрганизаторов());
	ПараметрыЗагрузки.ДополнительныеПараметры = СтруктураДопПараметры;

	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура НазначитьЗатратыНаКлиенте()
	Оповещение = Новый ОписаниеОповещения("ПослеНазначенияЗатрат", ЭтотОбъект);
	ПараметрыНазначенияЗатрат = Новый Структура;
	ПараметрыНазначенияЗатрат.Вставить("АдресХраненияТаблицыОбъектыЗакупки",
		ПолучитьАдресХраненияТаблицыОбъектыЗакупки());
	ПараметрыНазначенияЗатрат.Вставить("АдресХраненияТаблицыОбъектыЗатрат", ПолучитьАдресХраненияТаблицыОбъектыЗатрат());
	ОткрытьФорму("Документ.КонтурЗакупки_ОбработкаЗакупки.Форма.ФормаРаспределенияЗатрат", ПараметрыНазначенияЗатрат, ,
		, , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаценкиНаКлиенте()
	Оповещение = Новый ОписаниеОповещения("ПослеУстановкиНаценки", ЭтотОбъект);
	ПараметрыУстановкиНаценки = Новый Структура;
	ПараметрыУстановкиНаценки.Вставить("АдресХраненияТаблицыОбъектыЗакупки",
		ПолучитьАдресХраненияТаблицыОбъектыЗакупки());
	ПараметрыУстановкиНаценки.Вставить("АдресХраненияСтруктурыНаценки", ПолучитьАдресХраненияСтруктурыНаценки());
	ОткрытьФорму("Документ.КонтурЗакупки_ОбработкаЗакупки.Форма.ФормаУстановкиНаценки", ПараметрыУстановкиНаценки, , ,
		, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеЗатратНаСервере()
	ОчиститьПредставлениеЗатрат();

	ТаблицаГруппировок = Объект.ОбъектыЗатрат.Выгрузить();
	ТаблицаГруппировок.Свернуть("ГруппировкаЗатрат, КолонкиГруппировкиЗатрат");

	Для Каждого СтрокаГруппировки Из ТаблицаГруппировок Цикл

		Если СтрокаГруппировки.ГруппировкаЗатрат = "ВсеСтроки" Тогда
			ОтборПоЗатратам = Новый Структура("ГруппировкаЗатрат", СтрокаГруппировки.ГруппировкаЗатрат);
			НашлиСтрокиЗатрат = Объект.ОбъектыЗатрат.НайтиСтроки(ОтборПоЗатратам);
			Для Каждого НашлиСтрокуЗатрат Из НашлиСтрокиЗатрат Цикл      
				// каждая строка это затрата.
				Для Каждого СтрокаИтог Из Объект.ОбъектыЗакупки Цикл
					СтрокаИтог.ПредставлениеЗатрат = Строка(СтрокаИтог.ПредставлениеЗатрат) + Строка(
						НашлиСтрокуЗатрат.СтатьяЗатрат) + " (" + Строка(НашлиСтрокуЗатрат.Сумма) + ")" + "; ";
				КонецЦикла;
			КонецЦикла;
		Иначе
			ОтборПоЗатратам = Новый Структура("ГруппировкаЗатрат", СтрокаГруппировки.ГруппировкаЗатрат);
			НашлиСтрокиЗатрат = Объект.ОбъектыЗатрат.НайтиСтроки(ОтборПоЗатратам);
			Для Каждого НашлиСтрокуЗатрат Из НашлиСтрокиЗатрат Цикл 
				// нужен отбор для поиска строк в объектах закупок  
				ТекОтбор = Новый Структура(СтрокаГруппировки.КолонкиГруппировкиЗатрат);
				ЗаполнитьЗначенияСвойств(ТекОтбор, НашлиСтрокуЗатрат);
				НашлиСтрокиОбъектовЗакупки = Объект.ОбъектыЗакупки.НайтиСтроки(ТекОтбор);
				Для Каждого НашлиСтроку Из НашлиСтрокиОбъектовЗакупки Цикл
					НашлиСтроку.ПредставлениеЗатрат = Строка(НашлиСтроку.ПредставлениеЗатрат) + Строка(
						НашлиСтрокуЗатрат.СтатьяЗатрат) + " (" + Строка(НашлиСтрокуЗатрат.Сумма) + ")" + "; ";
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Получить массив строк объектов закупки по группировке затрат.
// 
// Параметры:
//  СтрокаОбъектаЗатрат - ДанныеФормыЭлементКоллекции - Строка объекта затрат
// 
// Возвращаемое значение:
//  Массив Из ДанныеФормыЭлементКоллекции, ДанныеФормыКоллекция - Получить массив строк объектов закупки по группировке затрат
&НаСервере
Функция ПолучитьСтрокиОбъектовЗакупкиПоГруппировкеЗатрат(СтрокаОбъектаЗатрат)
	МассивСтрок = Новый Массив;
	Если СтрокаОбъектаЗатрат.ГруппировкаЗатрат = "ВсеСтроки" Тогда
		МассивСтрок	= Объект.ОбъектыЗакупки;
	Иначе
		ТекОтбор = Новый Структура(СтрокаОбъектаЗатрат.КолонкиГруппировкиЗатрат);
		ЗаполнитьЗначенияСвойств(ТекОтбор, СтрокаОбъектаЗатрат);
		МассивСтрок = Объект.ОбъектыЗакупки.НайтиСтроки(ТекОтбор);
	КонецЕсли;

	Возврат МассивСтрок;
КонецФункции

&НаСервере
Функция ПолучитьСтрокиОбъектовЗакупкиПоГруппировкеНаценки(СтруктураНаценки)
	МассивСтрок = Новый Массив;
	Если СтруктураНаценки.ГруппировкаНаценки = "ВсеСтроки" Тогда
		МассивСтрок	= Объект.ОбъектыЗакупки;
	Иначе
		ТекОтбор = Новый Структура(СтруктураНаценки.КолонкиГруппировкиНаценки);
		ЗаполнитьЗначенияСвойств(ТекОтбор, СтруктураНаценки);
		МассивСтрок = Объект.ОбъектыЗакупки.НайтиСтроки(ТекОтбор);
	КонецЕсли;

	Возврат МассивСтрок;
КонецФункции

&НаСервере
Процедура ЗагрузитьТаблицуОбъектыЗатрат(РезультатЗакрытия)
	Объект.ОбъектыЗатрат.Загрузить(ПолучитьИзВременногоХранилища(РезультатЗакрытия));
КонецПроцедуры

&НаКлиенте
Процедура ПослеНазначенияЗатрат(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если Не РезультатЗакрытия = Неопределено И Не ПустаяСтрока(РезультатЗакрытия) Тогда
		ЗагрузитьТаблицуОбъектыЗатрат(РезультатЗакрытия);
		ЗаполнитьПредставлениеЗатратНаСервере();
		РаспределениеЗатратНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеУстановкиНаценки(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если Не РезультатЗакрытия = Неопределено И Не ПустаяСтрока(РезультатЗакрытия) Тогда
		СтруктураНаценка = ПолучитьИзВременногоХранилища(РезультатЗакрытия);
		УстановитьПроцентНаценкиНаСервере(СтруктураНаценка);
//		ЗагрузитьТаблицуОбъектыЗатрат(РезультатЗакрытия);
//		ЗаполнитьПредставлениеЗатратНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьПроцентНаценкиНаСервере(СтруктураНаценка)
	МассивСтрок = ПолучитьСтрокиОбъектовЗакупкиПоГруппировкеНаценки(СтруктураНаценка);
	Для Каждого СтрокаОбъектаЗакупок Из МассивСтрок Цикл
		СтрокаОбъектаЗакупок.ПроцентНаценки = СтруктураНаценка.ПроцентНаценки;
		СтрокаОбъектаЗакупок.СуммаНаценки = СтрокаОбъектаЗакупок.СуммаПоставщика * (СтрокаОбъектаЗакупок.ПроцентНаценки
			/ 100);
		СтрокаОбъектаЗакупок.СуммаПродажи = СтрокаОбъектаЗакупок.СуммаПоставщика + СтрокаОбъектаЗакупок.СуммаНаценки 
											+ СтрокаОбъектаЗакупок.СуммаЗатратВЦене;;
		ПересчитатьПрибыльНаСервере(СтрокаОбъектаЗакупок);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХраненияТаблицыОбъектыЗакупки()
	ТаблицаДанных = Объект.ОбъектыЗакупки.Выгрузить();
	АдресХраненияТаблицыОбъектыЗакупки = ПоместитьВоВременноеХранилище(ТаблицаДанных, УникальныйИдентификатор);
	Возврат АдресХраненияТаблицыОбъектыЗакупки;
КонецФункции

&НаСервере
Функция ПолучитьАдресХраненияТаблицыОбъектыЗатрат()
	ТаблицаДанных = Объект.ОбъектыЗатрат.Выгрузить();
	АдресХраненияТаблицыОбъектыЗатрат = ПоместитьВоВременноеХранилище(ТаблицаДанных, УникальныйИдентификатор);
	Возврат АдресХраненияТаблицыОбъектыЗатрат;
КонецФункции

&НаСервере
Функция ПолучитьАдресХраненияСтруктурыНаценки()
	СтруктураНаценки = Документы.КонтурЗакупки_ОбработкаЗакупки.ПолучитьСтруктуруНаценки();
	АдресХраненияСтруктурыНаценки = ПоместитьВоВременноеХранилище(СтруктураНаценки, УникальныйИдентификатор);
	Возврат АдресХраненияСтруктурыНаценки;
КонецФункции

&НаСервере
Процедура ОчиститьСуммыЗатрат()
	Для Каждого СтрОбъекта Из Объект.ОбъектыЗакупки Цикл
		СтрОбъекта.СуммаЗатрат = 0;
		СтрОбъекта.СуммаЗатратВЦене = 0;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОчиститьПредставлениеЗатрат()
	Для Каждого СтрОбъекта Из Объект.ОбъектыЗакупки Цикл
		СтрОбъекта.ПредставлениеЗатрат = "";
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура РаспределениеЗатратНаСервере()

	ОчиститьСуммыЗатрат();

	Для Каждого СтрокаЗатрат Из Объект.ОбъектыЗатрат Цикл
		СтрокиОбъектовЗакупки = ПолучитьСтрокиОбъектовЗакупкиПоГруппировкеЗатрат(СтрокаЗатрат);
		СуммаБазыДляРаспределения = ПолучитьСуммуДляРаспределенияЗатрат(СтрокиОбъектовЗакупки,
			СтрокаЗатрат.ПоказательРаспределенияЗатрат);
		СуммаСтрокиЗатрат = СтрокаЗатрат.Сумма;

		Если СуммаБазыДляРаспределения > 0 Тогда
			Пропорция = СуммаСтрокиЗатрат / СуммаБазыДляРаспределения;
		Иначе
			Пропорция = 0;
		КонецЕсли;

		Для Каждого СтрокаОбъектаЗакупок Из СтрокиОбъектовЗакупки Цикл
			Если СтрокаЗатрат.ПоказательРаспределенияЗатрат
				= Перечисления.КонтурЗакупки_ПоказателиРаспределенияЗатрат.Вес Тогда
				СуммаРеквизитаСтроки = СтрокаОбъектаЗакупок.Вес;
			ИначеЕсли СтрокаЗатрат.ПоказательРаспределенияЗатрат
				= Перечисления.КонтурЗакупки_ПоказателиРаспределенияЗатрат.Объем Тогда
				СуммаРеквизитаСтроки = СтрокаОбъектаЗакупок.Объем;
			ИначеЕсли СтрокаЗатрат.ПоказательРаспределенияЗатрат
				= Перечисления.КонтурЗакупки_ПоказателиРаспределенияЗатрат.ВесИОбъем Тогда
				СуммаРеквизитаСтроки = СтрокаОбъектаЗакупок.Вес + СтрокаОбъектаЗакупок.Объем;
			ИначеЕсли СтрокаЗатрат.ПоказательРаспределенияЗатрат
				= Перечисления.КонтурЗакупки_ПоказателиРаспределенияЗатрат.СуммаЗакупки Тогда
				СуммаРеквизитаСтроки = СтрокаОбъектаЗакупок.ОбщаяСтоимостьОбъекта;
			ИначеЕсли СтрокаЗатрат.ПоказательРаспределенияЗатрат
				= Перечисления.КонтурЗакупки_ПоказателиРаспределенияЗатрат.СуммаПоставщика Тогда
				СуммаРеквизитаСтроки = СтрокаОбъектаЗакупок.СуммаПоставщика;
			Иначе
				СуммаРеквизитаСтроки = 0;
			КонецЕсли;
			
			СуммаБазыДляРаспределения = СуммаБазыДляРаспределения - СуммаРеквизитаСтроки;
			
			Если СуммаБазыДляРаспределения = 0 Тогда
				СуммаЗатратСтроки = СуммаСтрокиЗатрат;
			Иначе
				СуммаЗатратСтроки = Окр(СуммаРеквизитаСтроки * Пропорция, 2);
			КонецЕсли;
			
			СуммаСтрокиЗатрат = СуммаСтрокиЗатрат - СуммаЗатратСтроки;
			
			Если СтрокаЗатрат.ЗатратыВЦене Тогда
				СтрокаОбъектаЗакупок.СуммаЗатратВЦене = СтрокаОбъектаЗакупок.СуммаЗатратВЦене + СуммаЗатратСтроки;
			Иначе
				СтрокаОбъектаЗакупок.СуммаЗатрат = СтрокаОбъектаЗакупок.СуммаЗатрат + СуммаЗатратСтроки;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаОбъектаЗакупок Из СтрокиОбъектовЗакупки Цикл
		ПересчитатьПрибыльНаСервере(СтрокаОбъектаЗакупок);
	КонецЦикла;
		
	ЗаполнитьПредставлениеЗатратНаСервере();
	
КонецПроцедуры

// Получить сумму для распределения затрат.
// 
// Параметры:
//  МассивСтрокОбъектовЗакупки - Массив Из ДанныеФормыЭлементКоллекции - Массив строк объектов закупки
//  ПоказательРаспределенияЗатрат - ПеречислениеСсылка.КонтурЗакупки_ПоказателиРаспределенияЗатрат - Показатель распределения затрат
// 
// Возвращаемое значение:
//  Число -  Cумма показателя(ей) для распределения затрат
&НаСервере
Функция ПолучитьСуммуДляРаспределенияЗатрат(МассивСтрокОбъектовЗакупки, ПоказательРаспределенияЗатрат)
	СуммаПоказателя = 0;
	Если ЗначениеЗаполнено(ПоказательРаспределенияЗатрат) Тогда
		Для Каждого СтрокаОбъектаЗатрат Из МассивСтрокОбъектовЗакупки Цикл
			Если ПоказательРаспределенияЗатрат = Перечисления.КонтурЗакупки_ПоказателиРаспределенияЗатрат.Вес Тогда
				СуммаПоказателя = СуммаПоказателя + СтрокаОбъектаЗатрат.Вес;
			ИначеЕсли ПоказательРаспределенияЗатрат = Перечисления.КонтурЗакупки_ПоказателиРаспределенияЗатрат.Объем Тогда
				СуммаПоказателя = СуммаПоказателя + СтрокаОбъектаЗатрат.Объем;
			ИначеЕсли ПоказательРаспределенияЗатрат
				= Перечисления.КонтурЗакупки_ПоказателиРаспределенияЗатрат.ВесИОбъем Тогда
				СуммаПоказателя = СуммаПоказателя + СтрокаОбъектаЗатрат.Объем + СтрокаОбъектаЗатрат.Вес;
			ИначеЕсли ПоказательРаспределенияЗатрат
				= Перечисления.КонтурЗакупки_ПоказателиРаспределенияЗатрат.СуммаЗакупки Тогда
				СуммаПоказателя = СуммаПоказателя + СтрокаОбъектаЗатрат.ОбщаяСтоимостьОбъекта;
			ИначеЕсли ПоказательРаспределенияЗатрат
				= Перечисления.КонтурЗакупки_ПоказателиРаспределенияЗатрат.СуммаПоставщика Тогда
				СуммаПоказателя = СуммаПоказателя + СтрокаОбъектаЗатрат.СуммаПоставщика;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат СуммаПоказателя;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНаименованиеПапкиФайловВерхнегоУровня()
	Возврат "Файлы_КонтурЗакупки_ОбработкаЗакупки";
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСоздатьСправочникПапкиФайлов(УИДДокумента)
	
	НаименованиеВехнийУровень = ПолучитьНаименованиеПапкиФайловВерхнегоУровня();
	СсылкаВерхнийУровень = Справочники.ПапкиФайлов.НайтиПоНаименованию(НаименованиеВехнийУровень, Истина);
	Если Не ЗначениеЗаполнено(СсылкаВерхнийУровень) Тогда
		ОбъектВерхнийУровень = Справочники.ПапкиФайлов.СоздатьЭлемент();
		ОбъектВерхнийУровень.Наименование = НаименованиеВехнийУровень;
		ОбъектВерхнийУровень.Записать();

		СсылкаВерхнийУровень = ОбъектВерхнийУровень.Ссылка;
	КонецЕсли;

	СсылкаПапкиФайлов = Справочники.ПапкиФайлов.НайтиПоНаименованию(XMLСтрока(УИДДокумента), Истина,
		СсылкаВерхнийУровень);

	Если Не ЗначениеЗаполнено(СсылкаПапкиФайлов) Тогда
		ОбъектПапкиФайлов = Справочники.ПапкиФайлов.СоздатьЭлемент();
		ОбъектПапкиФайлов.Наименование = XMLСтрока(УИДДокумента);
		ОбъектПапкиФайлов.Родитель = СсылкаВерхнийУровень;
		ОбъектПапкиФайлов.Записать();

		СсылкаПапкиФайлов = ОбъектПапкиФайлов.Ссылка;
	КонецЕсли;

	Возврат СсылкаПапкиФайлов;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииСуммыЗатрат()
	ИДТекущейСтроки = Элементы.КП.ТекущаяСтрока;
	Если Не ИДТекущейСтроки = Неопределено Тогда
		ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);
		ТекущаяСтрока.СуммаПродажи = ТекущаяСтрока.СуммаПоставщика + ТекущаяСтрока.СуммаНаценки
			+ ТекущаяСтрока.СуммаЗатратВЦене;
		ПересчитатьЦеныПродажи(ТекущаяСтрока);
		ПересчитатьПрибыль(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаданиеНаКлиенте()
	СоздаватьЗадание = Истина;
	ОписаниеРезультата = "";

	Если Не ЗначениеЗаполнено(Объект.Пользователь) Тогда
		СоздаватьЗадание = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Не заполнен пользователь'");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.СтатусОбработкиЗакупки) Тогда
		СоздаватьЗадание = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + ?(Не ПустаяСтрока(ОписаниеРезультата), Символы.ПС, "") + НСтр(
				"ru = 'Не заполнен статус обработки'");
	КонецЕсли;

	Если Объект.ЗаданиеСоздано Тогда
		СоздаватьЗадание = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + ?(Не ПустаяСтрока(ОписаниеРезультата), Символы.ПС, "") + НСтр(
				"ru = 'Задание уже создано'");
	КонецЕсли;

	Если СоздаватьЗадание Тогда
		СоздатьЗаданиеНаСервере();
	Иначе
		КонтурЗакупки_СлужебныеВызовСервера.СообщитьПользователю(ОписаниеРезультата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаданиеНаСогласованииУЛогистаНаКлиенте()
	ОписаниеРезультата = "";

	Если Не СоздатьЗаданиеНаСогласованииУЛогистаНаСервере(ОписаниеРезультата) Тогда
		КонтурЗакупки_СлужебныеВызовСервера.СообщитьПользователю(ОписаниеРезультата);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьЗаданиеНаСогласованииУЛогистаНаСервере(ОписаниеРезультата = "")
	СоздаватьЗадание = Истина;
	МассивЛогистов = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.ПолучитьМассивПользователейСРолью(
		Метаданные.Роли.КонтурЗакупки_ОтделЛогистики);

	Если МассивЛогистов.Количество() = 0 Тогда
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Нет пользователей с ролью КонтурЗакупки_ОтделЛогистики'")
			+ Символы.ПС;
		СоздаватьЗадание = Ложь;
	КонецЕсли;

	Если СоздаватьЗадание Тогда
		Для Каждого ПользовательЛогист Из МассивЛогистов Цикл

			ОписаниеРезультата = "";
			ЗаданиеСсылка = Неопределено;

			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Автор", ПараметрыСеанса.ТекущийПользователь);
			ПараметрыЗадания.Вставить("Исполнитель", ПользовательЛогист);

			Если Не КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьЗаданиеОбработкиЗакупки(
		Объект.Ссылка, "Задание" + Строка(Объект.СтатусОбработкиЗакупки) + Строка(Объект.Пользователь),
				ПараметрыЗадания, ЗаданиеСсылка, ОписаниеРезультата) Тогда
				Объект.ЗаданиеСоздано = Ложь;
				КонтурЗакупки_СлужебныеВызовСервера.СообщитьПользователю(ОписаниеРезультата);
			Иначе
				ЗаданиеСсылка.Объект.ЗаданиеСоздано = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат СоздаватьЗадание;
КонецФункции

&НаСервере
Процедура СоздатьЗаданиеНаСервере()
	ОписаниеРезультата = "";
	ЗаданиеСсылка = Неопределено;

	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Автор", ПараметрыСеанса.ТекущийПользователь);
	ПараметрыЗадания.Вставить("Исполнитель", Объект.Пользователь);

	Если Не КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.СоздатьЗаданиеОбработкиЗакупки(
		Объект.Ссылка, "Задание" + Строка(Объект.СтатусОбработкиЗакупки) + Строка(Объект.Пользователь),
		ПараметрыЗадания, ЗаданиеСсылка, ОписаниеРезультата) Тогда
		Объект.ЗаданиеСоздано = Ложь;
		КонтурЗакупки_СлужебныеВызовСервера.СообщитьПользователю(ОписаниеРезультата);
	Иначе
		Объект.ЗаданиеСоздано = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВводаКоличестваДеленияСтроки(ВведенноеЧисло, ТекущаяСтрока) Экспорт

	Если Не ВведенноеЧисло = Неопределено И ВведенноеЧисло < ТекущаяСтрока.Количество И ТекущаяСтрока.Количество > 0
		И ВведенноеЧисло > 0 Тогда

		РазделитьСтроку(ВведенноеЧисло, ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВводаКоличестваПоставщикаДеленияСтроки(ВведенноеЧисло, ТекущаяСтрока) Экспорт

	Если Не ВведенноеЧисло = Неопределено И ВведенноеЧисло < ТекущаяСтрока.КоличествоПоставщика
		И ТекущаяСтрока.КоличествоПоставщика > 0 И ВведенноеЧисло > 0 Тогда

		РазделитьСтроку(ВведенноеЧисло, ТекущаяСтрока, "КоличествоПоставщика");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазделитьСтроку(ВведенноеЧисло, ТекущаяСтрока, РеквизитДляПропорции = "Количество")
	Пропорция = ВведенноеЧисло / ТекущаяСтрока[РеквизитДляПропорции];
	НомерНовойСтроки = Объект.ОбъектыЗакупки.Индекс(ТекущаяСтрока) + 1;
	НоваяСтрока = Объект.ОбъектыЗакупки.Вставить(НомерНовойСтроки);

	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);

	ТекущаяСтрока[РеквизитДляПропорции] = ТекущаяСтрока[РеквизитДляПропорции] - ВведенноеЧисло;
	НоваяСтрока[РеквизитДляПропорции] = ВведенноеЧисло;
		
	// суммы новой строки пересчитываем по пропорции
	МассивРеквизитСумм = Новый Массив;
	МассивРеквизитСумм.Добавить("ОбщаяСтоимостьОбъекта");
	МассивРеквизитСумм.Добавить("Вес");
	МассивРеквизитСумм.Добавить("Объем");
	Если РеквизитДляПропорции = "Количество" Тогда
		МассивРеквизитСумм.Добавить("КоличествоПоставщика");
	ИначеЕсли РеквизитДляПропорции = "КоличествоПоставщика" Тогда
		МассивРеквизитСумм.Добавить("Количество");
	КонецЕсли;
	МассивРеквизитСумм.Добавить("СуммаПоставщика");
	МассивРеквизитСумм.Добавить("СуммаНДСПоставщика");
	МассивРеквизитСумм.Добавить("СуммаНаценки");
	МассивРеквизитСумм.Добавить("СуммаПродажи");
	МассивРеквизитСумм.Добавить("СуммаЗатрат");
	МассивРеквизитСумм.Добавить("СуммаПрибыли");

	Для Каждого РеквизитСуммы Из МассивРеквизитСумм Цикл
		НоваяСтрока[РеквизитСуммы] = ТекущаяСтрока[РеквизитСуммы] * Пропорция;
		ТекущаяСтрока[РеквизитСуммы] = ТекущаяСтрока[РеквизитСуммы] - НоваяСтрока[РеквизитСуммы];
	КонецЦикла;
	ПересчитатьПрибыль(ТекущаяСтрока);
	ПересчитатьПрибыль(НоваяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура НачатьРазделениеСтроки(ТекущаяСтрока)

	ЗавершениеВводаКоличестваДеления = Новый ОписаниеОповещения("ОкончаниеВводаКоличестваДеленияСтроки", ЭтотОбъект,
		ТекущаяСтрока);
	ПоказатьВводЧисла(ЗавершениеВводаКоличестваДеления, , НСтр("ru = 'Введите количество новой строки'"), 15, 2);
КонецПроцедуры

&НаКлиенте
Процедура НачатьРазделениеСтрокиКоличествоПоставщика(ТекущаяСтрока)

	ЗавершениеВводаКоличестваДеления = Новый ОписаниеОповещения("ОкончаниеВводаКоличестваПоставщикаДеленияСтроки",
		ЭтотОбъект, ТекущаяСтрока);
	ПоказатьВводЧисла(ЗавершениеВводаКоличестваДеления, , НСтр("ru = 'Введите количество новой строки'"), 15, 2);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСуммыПродажи(ТекущаяСтрока)
	ТекущаяСтрока.СуммаНаценки = ТекущаяСтрока.СуммаПродажи - ТекущаяСтрока.СуммаПоставщика
		- ТекущаяСтрока.СуммаЗатратВЦене;
	Если Не ТекущаяСтрока.СуммаПоставщика = 0 Тогда
		ТекущаяСтрока.ПроцентНаценки = ТекущаяСтрока.СуммаНаценки * 100 / ТекущаяСтрока.СуммаПоставщика;
	КонецЕсли;

	ПересчитатьПрибыль(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКоличествоПоставщика(ТекущаяСтрока)
	ТекущаяСтрока.СуммаПоставщика = ТекущаяСтрока.ЦенаПоставщика * ТекущаяСтрока.КоличествоПоставщика;

	ТекущаяСтрока.СуммаПоставщикаБезНДС = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуБезНДС( 
	ТекущаяСтрока.СуммаПоставщика, ТекущаяСтрока.СтавкаНДСПоставщика);

	ТекущаяСтрока.СуммаНДСПоставщика = ТекущаяСтрока.СуммаПоставщика - ТекущаяСтрока.СуммаПоставщикаБезНДС;

	ПересчитатьЦеныПродажи(ТекущаяСтрока);
	ПересчитатьСуммыОВХ(ТекущаяСтрока);
	ПересчитатьПрибыль(ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОрганизаторов()
	Возврат Объект.ОрганизаторыЗаказчики.Выгрузить().ВыгрузитьКолонку("ОрганизаторЗаказчик");
КонецФункции

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)

	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);

	Для Каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ОбъектЗакупки) Тогда
			НовСтрока = Объект.ОбъектыЗакупки.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	Если Не АдресЗагруженныхДанных = Неопределено Тогда
		ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСуммыПоставщика(ТекущаяСтрока)
	Если Не ТекущаяСтрока.КоличествоПоставщика = 0 Тогда
		ТекущаяСтрока.СуммаПоставщикаБезНДС = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуБезНДС(
		ТекущаяСтрока.СуммаПоставщика, ТекущаяСтрока.СтавкаНДСПоставщика);

		ТекущаяСтрока.ЦенаПоставщика = ТекущаяСтрока.СуммаПоставщика / ТекущаяСтрока.КоличествоПоставщика;
		ТекущаяСтрока.ЦенаПоставщикаБезНДС = ТекущаяСтрока.СуммаПоставщикаБезНДС / ТекущаяСтрока.КоличествоПоставщика;

		ТекущаяСтрока.СуммаНДСПоставщика = ТекущаяСтрока.СуммаПоставщика - ТекущаяСтрока.СуммаПоставщикаБезНДС;
		ПересчитатьПрибыль(ТекущаяСтрока);
		ПересчитатьНаценку(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ТекущаяСтрока)
	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда

		СтруктураДанныеНоменклатуры = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьДанныеНоменклатуры(
					ТекущаяСтрока.Номенклатура);
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураДанныеНоменклатуры);
		ПересчитатьСуммыОВХ(ТекущаяСтрока);

		ОбъектыЗакупкиНоменклатураПриИзмененииНаСервере(ТекущаяСтрока.ОбъектЗакупки, ТекущаяСтрока.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбъектыЗакупкиДанныеПоставкиПоставщикПриИзмененииНаСервере(ИДТекущейСтроки)
	ТекущаяСтрока = Объект.ОбъектыЗакупки.НайтиПоИдентификатору(ИДТекущейСтроки);

	Заполнять = ЗначениеЗаполнено(ТекущаяСтрока.Контрагент);

	Если Заполнять Тогда
		ПВХГородОтгрузкиПартнера = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
			"ПВХГородОтгрузкиПартнера", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка());
		Если Не ЗначениеЗаполнено(ПВХГородОтгрузкиПартнера) Тогда
			ЗаполнитьГородИзКлассификатора( ТекущаяСтрока);
		Иначе
			ЗаполнитьГородИзПВХ(ТекущаяСтрока, ПВХГородОтгрузкиПартнера);
		КонецЕсли;
	Иначе
		ТекущаяСтрока.ГородПоставщика = Справочники.КонтурЗакупки_Города.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГородИзПВХ(ТекущаяСтрока, ПВХГородОтгрузкиПартнера)
	Заполнять = Истина;

	Если Заполнять Тогда
		ГородПоставщика = УправлениеСвойствами.ЗначениеСвойства(ТекущаяСтрока.Контрагент, ПВХГородОтгрузкиПартнера);
		Если Не ЗначениеЗаполнено(ГородПоставщика) Тогда
			ГородПоставщика = УправлениеСвойствами.ЗначениеСвойства(ТекущаяСтрока.Контрагент.Партнер,
				ПВХГородОтгрузкиПартнера);
			Если Не ЗначениеЗаполнено(ГородПоставщика) Тогда
				Заполнять = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Заполнять Тогда
		СтруктураГород = Новый Структура("Наименование", СокрЛП(ГородПоставщика));

		ТекущаяСтрока.ГородПоставщика = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.НайтиСоздатьСправочникПоНаименованию(
				"КонтурЗакупки_Города", СтруктураГород);
	Иначе
		ТекущаяСтрока.ГородПоставщика = Справочники.КонтурЗакупки_Города.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГородИзКлассификатора(ТекущаяСтрока)
	Заполнять = Истина;
	КонтИнф = Неопределено;

	Если Заполнять Тогда
		//@skip-check empty-except-statement
		Попытка
			ОтборКИ = УправлениеКонтактнойИнформацией.ОтборКонтактнойИнформации();
			ОтборКИ.Дата = Объект.Дата;
			ОтборКИ.ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
			ОтборКИ.ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
			КонтИнф = УправлениеКонтактнойИнформацией.КонтактнаяИнформация(ТекущаяСтрока.Контрагент, ОтборКИ);
		Исключение

		КонецПопытки;

		//@skip-check empty-except-statement
		Попытка
			КонтИнф = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущаяСтрока.Контрагент,
				Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, Объект.Дата, Ложь);
			КонтИнф1 = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущаяСтрока.Контрагент,
				Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, Объект.Дата, Ложь);
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(КонтИнф1, КонтИнф);
		Исключение

		КонецПопытки;
		Заполнять = Не КонтИнф = Неопределено;
	КонецЕсли;

	Если Заполнять И КонтИнф.Количество() = 0 Тогда
		Заполнять = Ложь;
	КонецЕсли;

	Если Заполнять Тогда
		Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(КонтИнф[0].ЗначенияПолей) Тогда
			МодульУправлениеКонтактнойИнформациейЛокализация = Неопределено;
			ЕстьОМ = Истина;
			Попытка
				//@skip-check wrong-string-literal-content
				МодульУправлениеКонтактнойИнформациейЛокализация = ОбщегоНазначения.ОбщийМодуль(
				"УправлениеКонтактнойИнформациейЛокализация");
			Исключение
				ЕстьОМ = Ложь;
			КонецПопытки;

			Если Не ЕстьОМ Тогда
				МодульУправлениеКонтактнойИнформациейЛокализация = ОбщегоНазначения.ОбщийМодуль(
					"УправлениеКонтактнойИнформациейСлужебный");
			КонецЕсли;

			XDTOКонтактнаяИнформация = МодульУправлениеКонтактнойИнформациейЛокализация.КонтактнаяИнформацияИзXML(
				КонтИнф[0].ЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.Адрес);
		Иначе
			Заполнять = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если Заполнять Тогда
		Если XDTOКонтактнаяИнформация.Состав = Неопределено Тогда
			Заполнять = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если Заполнять Тогда
		Если XDTOКонтактнаяИнформация.Состав.Страна = Неопределено Тогда
			Заполнять = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если Заполнять Тогда
		Если XDTOКонтактнаяИнформация.Состав.Состав = Неопределено Тогда
			Заполнять = Ложь;
		КонецЕсли;
	КонецЕсли;

	ГородПоставщика = "";
	Если Заполнять Тогда
		Если Не XDTOКонтактнаяИнформация.Состав.Состав.Город = Неопределено Тогда
			ГородПоставщика = XDTOКонтактнаяИнформация.Состав.Состав.Город;
		КонецЕсли;

		Если Не XDTOКонтактнаяИнформация.Состав.Состав.НаселПункт = Неопределено Тогда
			ГородПоставщика = ГородПоставщика + " " + XDTOКонтактнаяИнформация.Состав.Состав.НаселПункт;
		КонецЕсли;

		Если ПустаяСтрока(ГородПоставщика) Тогда
			Заполнять = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если Заполнять Тогда
		СтруктураГород = Новый Структура("Наименование", СокрЛП(ГородПоставщика));

		ТекущаяСтрока.ГородПоставщика = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.НайтиСоздатьСправочникПоНаименованию(
				"КонтурЗакупки_Города", СтруктураГород);
	Иначе
		ТекущаяСтрока.ГородПоставщика = Справочники.КонтурЗакупки_Города.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбъектыЗакупкиНоменклатураПриИзмененииНаСервере(ОбъектЗакупки, Номенклатура)
	МассивОрганизаторов = Объект.ОрганизаторыЗаказчики.Выгрузить().ВыгрузитьКолонку("ОрганизаторЗаказчик");
	КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ЗаписатьНоменклатуруПоОбъектуЗакупки(
			МассивОрганизаторов, ОбъектЗакупки, Номенклатура);
КонецПроцедуры

// Пересчитать ОВХ.
// 
// Параметры:
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - Строка ТЧ
&НаКлиенте
Процедура ПересчитатьСуммыОВХ(ТекущаяСтрока)
	ТекущаяСтрока.Вес = ТекущаяСтрока.ВесЕдиницы * ТекущаяСтрока.КоличествоПоставщика;
	ТекущаяСтрока.Объем = ТекущаяСтрока.ОбъемЕдиницы * ТекущаяСтрока.КоличествоПоставщика;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦеныПродажи(ТекущаяСтрока)
	Если Не ТекущаяСтрока.КоличествоПоставщика = 0 Тогда
		ТекущаяСтрока.ЦенаПродажи = ТекущаяСтрока.СуммаПродажи / ТекущаяСтрока.КоличествоПоставщика;
		ТекущаяСтрока.ЦенаПродажиБезНДС = КонтурЗакупки_ЛокализацияУТ11_РасчетНДСКлиентСервер.ПолучитьСуммуБезНДС(
			ТекущаяСтрока.ЦенаПродажи, ТекущаяСтрока.СтавкаНДСПродажи);
	КонецЕсли;
КонецПроцедуры

// Пересчитать прибыль на клиенте.
// 
// Параметры:
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - Строка ТЧ
&НаКлиенте
Процедура ПересчитатьПрибыль(ТекущаяСтрока)
	ТекущаяСтрока.СуммаПрибыли = ТекущаяСтрока.СуммаНаценки - ТекущаяСтрока.СуммаЗатрат;
	Если Не ТекущаяСтрока.СуммаПоставщика = 0 Тогда
		ТекущаяСтрока.ПроцентМаржи = ТекущаяСтрока.СуммаПрибыли * 100 / ТекущаяСтрока.СуммаПоставщика;
	Иначе
		ТекущаяСтрока.ПроцентМаржи = 0;
	КонецЕсли;
КонецПроцедуры

// Пересчитать прибыль на сервере.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаТабличнойЧасти - Строка ТЧ
&НаСервере
Процедура ПересчитатьПрибыльНаСервере(ТекущаяСтрока)
	
	//ТекущаяСтрока.СуммаПрибыли = ТекущаяСтрока.СуммаНаценки - ТекущаяСтрока.СуммаЗатрат - ТекущаяСтрока.СуммаЗатратВЦене;
	
	ТекущаяСтрока.СуммаПрибыли = ТекущаяСтрока.СуммаПродажи
								- ТекущаяСтрока.СуммаПоставщика
								- ТекущаяСтрока.СуммаЗатрат
								- ТекущаяСтрока.СуммаЗатратВЦене;
	
	Если Не ТекущаяСтрока.СуммаПоставщика = 0 Тогда
		ТекущаяСтрока.ПроцентМаржи = ТекущаяСтрока.СуммаПрибыли * 100 / ТекущаяСтрока.СуммаПоставщика;
	Иначе
		ТекущаяСтрока.ПроцентМаржи = 0;
	КонецЕсли;
	
КонецПроцедуры

// Пересчитать наценку.
// 
// Параметры:
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции -  Текущая строка
&НаКлиенте
Процедура ПересчитатьНаценку(ТекущаяСтрока)
	ТекущаяСтрока.СуммаНаценки = ТекущаяСтрока.СуммаПродажи - ТекущаяСтрока.СуммаПоставщика
		- ТекущаяСтрока.СуммаЗатратВЦене;
	Если Не ТекущаяСтрока.СуммаПоставщика = 0 Тогда
		ТекущаяСтрока.ПроцентНаценки = ТекущаяСтрока.СуммаНаценки * 100 / ТекущаяСтрока.СуммаПоставщика;
	Иначе
		ТекущаяСтрока.ПроцентНаценки = 0;
	КонецЕсли;
КонецПроцедуры

// Получить имеющиеся данные по кодам.
// 
// Возвращаемое значение:
//  Структура -  Получить имеющиеся данные по кодам:
// * ЕстьОКВЭД2 - Булево - 
// * ЕстьОКПД2 - Булево - 
// * ЕстьКТРУ - Булево - 
&НаСервере
Функция ПолучитьИмеющиесяДанныеПоКодам()
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ЕстьОКВЭД2", Ложь);
	СтруктураДанные.Вставить("ЕстьОКПД2", Ложь);
	СтруктураДанные.Вставить("ЕстьКТРУ", Ложь);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗДокумента.ОКПД2Код,
	|	ТЗДокумента.ОКВЭД2Код,
	|	ТЗДокумента.КТРУКод
	|ПОМЕСТИТЬ ТЗКодов
	|ИЗ
	|	&ТЗДокумента КАК ТЗДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЗКодов.ОКПД2Код) КАК КолОКПД2Код,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЗКодов.ОКВЭД2Код) КАК КолОКВЭД2Код,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЗКодов.КТРУКод) КАК КолКТРУКод,
	|	МАКСИМУМ(ТЗКодов.ОКПД2Код) КАК МаксОКПД2Код,
	|	МАКСИМУМ(ТЗКодов.ОКВЭД2Код) КАК МаксОКВЭД2Код,
	|	МАКСИМУМ(ТЗКодов.КТРУКод) КАК МаксКТРУКод
	|ИЗ
	|	ТЗКодов КАК ТЗКодов";
	Запрос.УстановитьПараметр("ТЗДокумента", Объект.ОбъектыЗакупки.Выгрузить());

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураДанные.ЕстьОКВЭД2 = (Выборка.КолОКВЭД2Код > 1) Или Не ПустаяСтрока(Выборка.МаксОКВЭД2Код);
		СтруктураДанные.ЕстьОКПД2 = (Выборка.КолОКПД2Код > 1) Или Не ПустаяСтрока(Выборка.МаксОКПД2Код);
		СтруктураДанные.ЕстьКТРУ = (Выборка.КолКТРУКод > 1) Или Не ПустаяСтрока(Выборка.МаксКТРУКод);
	КонецЕсли;

	Возврат СтруктураДанные;
КонецФункции

// Получить суммы статьи затрат.
// 
// Параметры:
//  СтатьяЗатрат - СправочникСсылка.КонтурЗакупки_СтатьиЗатрат - Статья затрат
// 
// Возвращаемое значение:
//  Структура - Получить суммы статьи затрат:
// * СуммаБезНДС - Число - 
// * СтавкаНДС - ПеречислениеСсылка.КонтурЗакупки_СтавкиНДС - Ставка НДС
// * Сумма - Число - 
// * ПоказательРаспределенияЗатрат - ПеречислениеСсылка.КонтурЗакупки_ПоказателиРаспределенияЗатрат - Показатель распределения затрат
&НаСервере
Функция ПолучитьСуммыСтатьиЗатрат(СтатьяЗатрат)
	СтруктураСуммыСтатьиЗатрат = Новый Структура;
	СтруктураСуммыСтатьиЗатрат.Вставить("СуммаБезНДС", 0);
	СтруктураСуммыСтатьиЗатрат.Вставить("СтавкаНДС", Перечисления.КонтурЗакупки_СтавкиНДС.ПустаяСсылка());
	СтруктураСуммыСтатьиЗатрат.Вставить("Сумма", 0);
	СтруктураСуммыСтатьиЗатрат.Вставить("СуммаНДС", 0);
	СтруктураСуммыСтатьиЗатрат.Вставить("ПоказательРаспределенияЗатрат",
		Перечисления.КонтурЗакупки_ПоказателиРаспределенияЗатрат.ПустаяСсылка());
	Если ЗначениеЗаполнено(СтатьяЗатрат) Тогда
		ЗаполнитьЗначенияСвойств(СтруктураСуммыСтатьиЗатрат, СтатьяЗатрат);
		СтруктураСуммыСтатьиЗатрат.СуммаНДС =  СтруктураСуммыСтатьиЗатрат.Сумма - СтруктураСуммыСтатьиЗатрат.СуммаБезНДС;
	КонецЕсли;
	Возврат СтруктураСуммыСтатьиЗатрат;
КонецФункции

// Документ основания при изменении ответ.
// 
// Параметры:
//  РезультатВопроса - КодВозвратаДиалога, ЭлементСпискаЗначений - Результат вопроса
//  ДополнительныеПараметры - Неопределено - Дополнительные параметры
&НаКлиенте
Процедура ДокументОснованияПриИзмененииОтвет(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДокументОснованияПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДокументОснованияПриИзмененииНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Заполнить(Объект.ДокументОснования);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	УстановитьТекстЖелаемаяДатаПодсказка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОкончанииВводаПроцентаНаценки(ПроцентНаценки, Параметры) Экспорт
	Если Не ПроцентНаценки = Неопределено Тогда
		УстановитьПроцентНаценкиДляВсехСтрок(ПроцентНаценки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОкончанииВводаПроцентаНаценкиДляСтрок(ПроцентНаценки, Параметры) Экспорт
	Если Не ПроцентНаценки = Неопределено Тогда
		Для Каждого СтрокаКП Из Элементы.КП.ВыделенныеСтроки Цикл
			УстановитьПроцентНаценкиДляСтроки(Объект.ОбъектыЗакупки.НайтиПоИдентификатору(СтрокаКП), ПроцентНаценки);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПроцентНаценкиДляВсехСтрок(ПроцентНаценки)
	Для Каждого СтрокаТЧ Из Объект.ОбъектыЗакупки Цикл
		УстановитьПроцентНаценкиДляСтроки(СтрокаТЧ, ПроцентНаценки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПроцентНаценкиДляСтроки(ТекущаяСтрока, ПроцентНаценки)
	ТекущаяСтрока.ПроцентНаценки = ПроцентНаценки;
	ТекущаяСтрока.СуммаНаценки = ТекущаяСтрока.СуммаПоставщика * (ТекущаяСтрока.ПроцентНаценки / 100);
	ТекущаяСтрока.СуммаПродажи = ТекущаяСтрока.СуммаПоставщика + ТекущаяСтрока.СуммаНаценки+ ТекущаяСтрока.СуммаЗатратВЦене;;
	ПересчитатьЦеныПродажи(ТекущаяСтрока);
	ПересчитатьПрибыль(ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеНоменклатурыИзПривязкиНаСервере()
	Для Каждого СтрокаТЧ Из Объект.ОбъектыЗакупки Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			МассивОрганизаторЗаказчик = Объект.ОрганизаторыЗаказчики.Выгрузить().ВыгрузитьКолонку("ОрганизаторЗаказчик");
			Номенклатура = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьНоменклатуруПоОбъектуЗакупки(
				МассивОрганизаторЗаказчик, СтрокаТЧ.ОбъектЗакупки);
			Если ЗначениеЗаполнено(Номенклатура) Тогда
				СтрокаТЧ.Номенклатура = Номенклатура;
				СтруктураДанныеНоменклатуры = КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиВызовСервера.ПолучитьДанныеНоменклатуры(
					Номенклатура);
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураДанныеНоменклатуры);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	КонтурЗакупки_ЛокализацияВызовСервера.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура СброситьПризнакЗадания()
	Объект.ЗаданиеСоздано = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПользователиПоРолямНаСервере(ИмяРоли)
	Возврат КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.ПолучитьМассивПользователейСРолью(
				Метаданные.Роли[ИмяРоли]);
КонецФункции

&НаКлиенте
Функция СтрокаОбъектаЗакупкиЗаполнена(СтрокаОбъектаЗакупки)
	
	Результат = Ложь;
	
	МассивИменРеквизитов = МассивИменРеквизитовСтрокиОбъектаЗакупки();
	
	Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
		Если ЗначениеЗаполнено(СтрокаОбъектаЗакупки[ИмяРеквизита]) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция МассивИменРеквизитовСтрокиОбъектаЗакупки()
	
	Результат = Новый Массив;
	
	Результат.Добавить("Номенклатура");
	Результат.Добавить("Вес");
	Результат.Добавить("Объем");
	Результат.Добавить("Контрагент");
	Результат.Добавить("ЦенаПоставщикаБезНДС");
	Результат.Добавить("ЦенаПоставщика");
	Результат.Добавить("КоличествоПоставщика");
	Результат.Добавить("СуммаПоставщика");
	Результат.Добавить("Производитель");
	Результат.Добавить("Упаковка");
	Результат.Добавить("СтавкаНДСПоставщика");
	Результат.Добавить("СуммаНДСПоставщика");
	Результат.Добавить("ВесЕдиницы");
	Результат.Добавить("ОбъемЕдиницы");
	Результат.Добавить("ПроцентНаценки");
	Результат.Добавить("СуммаНаценки");
	Результат.Добавить("СуммаПродажи");
	Результат.Добавить("СуммаЗатрат");
	Результат.Добавить("СуммаПрибыли");
	Результат.Добавить("ПроцентМаржи");
	Результат.Добавить("ГородПоставщика");
	Результат.Добавить("СрокПодготовкиПродукцииУПоставщика");
	Результат.Добавить("ПредставлениеЗатрат");
	Результат.Добавить("СрокДоставкиДоЗаказчика");
	Результат.Добавить("НормативныйДокумент");
	Результат.Добавить("ПроцентКоммерческихРасходов");
	Результат.Добавить("СуммаКоммерческихРасходов");
	Результат.Добавить("ЦенаПродажиБезНДС");
	Результат.Добавить("ЦенаПродажи");
	Результат.Добавить("СтавкаНДСПродажи");
	Результат.Добавить("СуммаЗатратВЦене");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДанныеПоставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДанныеПоставкиПоставкаНевозможна" Тогда
		
		Модифицированность = Истина;
		ТекущиеДанные = Элементы.ДанныеПоставки.ТекущиеДанные;
		ПоставкаНевозможна = Не ТекущиеДанные.ПоставкаНевозможна;
		ТекущиеДанные.ПоставкаНевозможна = ПоставкаНевозможна;
		
		Если ПоставкаНевозможна  И СтрокаОбъектаЗакупкиЗаполнена(ТекущиеДанные) Тогда
			ДополнительныеПараметры = Новый Структура("ТекущаяСтрока", ТекущиеДанные);
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОчистка", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Очистить данные в строке?';"
			+ " en = 'Clean row data?'"), Режим, 0);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстЖелаемаяДатаПодсказка()
	
	ТекстПодсказки = "";
	
	Если ЗначениеЗаполнено(Объект.ДокументОснования) Тогда
		
		РеквизитыЗакупки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументОснования, "ДатаОкончанияПодачиЗаявок,ДатаПроведенияАукциона");
		Если ЗначениеЗаполнено(РеквизитыЗакупки.ДатаОкончанияПодачиЗаявок) Тогда
			ТекстПодсказки = СтрШаблон(НСтр("ru='Окончание подачи заявок (MSK): %1'", "ru"), Формат(РеквизитыЗакупки.ДатаОкончанияПодачиЗаявок, "ДФ=dd.MM.yyyy"));
		ИначеЕсли ЗначениеЗаполнено(РеквизитыЗакупки.ДатаПроведенияАукциона) Тогда
			ТекстПодсказки = СтрШаблон(НСтр("ru='Дата проведения аукциона (MSK): %1'", "ru"), Формат(РеквизитыЗакупки.ДатаПроведенияАукциона, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ЖелаемаяДатаРасширеннаяПодсказка.Заголовок = ТекстПодсказки;
	
КонецПроцедуры

#КонецОбласти