///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем".
// ОбщийМодуль.НастройкиПлатежныхСистемВызовСервера.
// 
// Серверные методы, которые могут вызываться с клиента:
//  - установка значения константы ДлительностьОперацииПлатежныхСистем.
//  - параметры оплаты для указанной настройки подключения.
//  
////////////////////////////////////////////////////////////////////////////////
 
#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает значение константы ДлительностьОперацииПлатежныхСистем.
//
// Параметры:
//  Значение - Число - количество секунд.
//
Процедура УстановитьДлительностьОперации(Знач Значение) Экспорт
	
	НастройкиПлатежныхСистемСлужебный.УстановитьДлительностьОперации(Значение);
	
КонецПроцедуры

// См. НастройкиПлатежныхСистемСлужебный.ПараметрыОплатыПоНастройке.
//
Функция ПараметрыОплатыПоНастройке(Знач НастройкаПодключения) Экспорт
	
	Возврат НастройкиПлатежныхСистемСлужебный.ПараметрыОплатыПоНастройке(НастройкаПодключения);
	
КонецФункции

#КонецОбласти
