#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокаСИБ = СтрокаСоединенияИнформационнойБазы();
	
	Если Лев(СтрокаСИБ, 4) = "File" Тогда
		АвтообменВариантБазыДанных = "ФайловыйВариант";
		ПутьКБазе = НСтр(СтрокаСоединенияИнформационнойБазы(), "File");
	ИначеЕсли Лев(СтрокаСИБ, 4) = "Srvr" Тогда
		АвтообменВариантБазыДанных = "СерверныйВариант";
		Сервер = НСтр(СтрокаСоединенияИнформационнойБазы(), "Srvr");
		ИмяБазы = НСтр(СтрокаСоединенияИнформационнойБазы(), "Ref");
	КонецЕсли;
	
	Для Каждого ТекущийПользователь Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
		Элементы.ПользовательИБ.СписокВыбора.Добавить(ТекущийПользователь.Имя, ТекущийПользователь.ПолноеИмя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗавершатьРаботу = Истина;
	АвтообменНастроитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АвтообменВариантБазыДанныхПриИзменении(Элемент)
	
	АвтообменНастроитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКБазеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
		"ВыборПутиКБазеЗаверешение", ЭтаФорма, РежимДиалогаВыбораФайла.ВыборКаталога,
		"Укажите расположение базы данных...", ПутьКБазе);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПутиКБазеЗаверешение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		ПутьКБазе = Результат;
	Иначе
		ПутьКБазе = Результат[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКМодулюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
		"ПутьКМодулюНачалоВыбораЗаверешение", ЭтаФорма, РежимДиалогаВыбораФайла.ВыборКаталога,
		"Укажите расположение обработки...", ПутьКОбработке);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКМодулюНачалоВыбораЗаверешение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		ПутьКОбработке = Результат;
	Иначе
		ПутьКОбработке = Результат[0];
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьФайлАвтозапуска(Команда)
	
	ЕстьОшибки = Ложь;
	
	Если АвтообменВариантБазыДанных = "ФайловыйВариант" Тогда
		Если Не ЗначениеЗаполнено(ПутьКБазе) Тогда
			Сообщить("Не заполнено обязательное поле ""Путь к базе""");
			ЕстьОшибки = Истина;
		КонецЕсли;
	ИначеЕсли АвтообменВариантБазыДанных = "СерверныйВариант" Тогда
		Если Не ЗначениеЗаполнено(Сервер) Тогда
			Сообщить("Не заполнено обязательное поле ""Сервер""");
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ИмяБазы) Тогда
			Сообщить("Не заполнено обязательное поле ""Имя базы""");
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ПользовательИБ) Тогда
		Сообщить("Не заполнено необязательное поле ""Пользователь""");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПутьКОбработке) Тогда
		Сообщить("Не заполнено обязательное поле ""Путь к модулю""");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Сообщить("Не заполнены одно или несколько обязательных полей!");
		Возврат;
	КонецЕсли;
	
	СохранитьОбработкуЗапускаСценариев();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
		"ВыборФайлаАвтозапускаЗаверешение", ЭтаФорма, РежимДиалогаВыбораФайла.Сохранение, "Выберите место сохранения файла...",,
		"Пакетный файл Windows" + "(*.bat)|*.bat", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОбработкуЗапускаСценариев()
	
	ДвоичныеДанныеОбработки = ДвоичныеДанныеОбработки(ЗавершатьРаботу);
	
	Если ЗавершатьРаботу Тогда
		ИмяОбработки = "\КонтурЛогистика_ЗапускСценариевАвтоматическойРаботы.epf";
	Иначе
		ИмяОбработки = "\КонтурЛогистика_ЗапускСценариевАвтоматическойРаботыБезЗавершения.epf";
	КонецЕсли;
	
	Попытка
		ДвоичныеДанныеОбработки.Записать(ПутьКОбработке + ИмяОбработки);
	Исключение
		Сообщить("Внешний файл не сохранен. " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДвоичныеДанныеОбработки(ЗавершатьРаботу)
	
	Если ЗавершатьРаботу Тогда
		ДвоичныеДанные = ПолучитьОбщийМакет("КонтурЛогистика_ЗапускСценариевАвтоматическойРаботы");
	Иначе
		ДвоичныеДанные = ПолучитьОбщийМакет("КонтурЛогистика_ЗапускСценариевАвтоматическойРаботыБезЗавершения");
	КонецЕсли;
	
	Возврат ДвоичныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ВыборФайлаАвтозапускаЗаверешение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоИнтерфейс82() Тогда
		ИмяФайла1С = "1cv8.exe";
	Иначе
		ИмяФайла1С = "1cv8c.exe";
	КонецЕсли;
	
	Если ЗавершатьРаботу Тогда
		ИмяОбработки = "\КонтурЛогистика_ЗапускСценариевАвтоматическойРаботы.epf";
	Иначе
		ИмяОбработки = "\КонтурЛогистика_ЗапускСценариевАвтоматическойРаботыБезЗавершения.epf";
	КонецЕсли;
	
	ПакетнаяКоманда = "";
	
	ПакетнаяКоманда = ПакетнаяКоманда + """" + КаталогПрограммы() + ИмяФайла1С + """ ";
	ПакетнаяКоманда = ПакетнаяКоманда + "enterprise ";
	Если АвтообменВариантБазыДанных = "ФайловыйВариант" Тогда
		ПакетнаяКоманда = ПакетнаяКоманда + "/F" + " " + """" + ПутьКБазе + """ ";
	ИначеЕсли АвтообменВариантБазыДанных = "СерверныйВариант" Тогда
		ПакетнаяКоманда = ПакетнаяКоманда + "/S" + " " + """" + Сервер + "\" + ИмяБазы + """ ";
	КонецЕсли;
	ПакетнаяКоманда = ПакетнаяКоманда + "/N" + " " + """" + ПользовательИБ + """" + " " + "/P" + " " + """" + Пароль + """ ";
	ПакетнаяКоманда = ПакетнаяКоманда + "/Execute" + " " + """" + ПутьКОбработке + ИмяОбработки + """";
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		ИмяБатФайла = Результат;
	Иначе
		ИмяБатФайла = Результат[0];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяБатФайла) Тогда
		Попытка
			БатФайл = Новый ЗаписьТекста(ИмяБатФайла, КодировкаТекста.OEM);
			БатФайл.ЗаписатьСтроку(ПакетнаяКоманда);
			БатФайл.Закрыть();
			Сообщить("Файл автозапуска успешно сохранен!");
		Исключение
			Сообщить("Не удалось записать файл: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура АвтообменНастроитьВидимостьЭлементов()
	
	Если АвтообменВариантБазыДанных = "ФайловыйВариант" Тогда
		Элементы.ПутьКБазе.Видимость = Истина;
		Элементы.Сервер.Видимость = Ложь;
		Элементы.ИмяБазы.Видимость = Ложь;
	ИначеЕсли АвтообменВариантБазыДанных = "СерверныйВариант" Тогда
		Элементы.ПутьКБазе.Видимость = Ложь;
		Элементы.Сервер.Видимость = Истина;
		Элементы.ИмяБазы.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоИнтерфейс82()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82();
	
КонецФункции

#КонецОбласти