#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Параметры:
//  Отказ - Булево
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка
		Или Значение = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне();
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.КлючФоновогоЗадания = "ОбновитьПоддерживаемыеФорматыАбонентовИзСервисаНастроек";
	// См. СинхронизацияЭДО.ОбновитьПоддерживаемыеФорматыАбонентовИзСервисаНастроек
	ДлительныеОперации.ВыполнитьВФоне("СинхронизацияЭДО.ОбновитьПоддерживаемыеФорматыАбонентовИзСервисаНастроек",
		Дата(1, 1, 1), ПараметрыВыполнения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
