&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	АУ_Привелигированный.ИзменитьСтатьиБюджетаВДокументе(Объект.Документ,Объект.СтатьиБюджета.Выгрузить(),Объект.ДатаБюджета,Объект.ФактическийКурсВалюты);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеИзДокумента()
	
	Объект.СтатьиБюджета.Загрузить(Объект.Документ.АУ_СтатьиБюджета.Выгрузить());
	Объект.ДатаБюджета = Объект.Документ.АУ_ДатаБюджета;
	Объект.ФактическийКурсВалюты = Объект.Документ.АУ_ФактическийКурсВалюты;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") Тогда
		
		Объект.Документ = Параметры.Документ;
		СуммаДокумента = Параметры.Документ.СуммаДокумента;
		
	КонецЕсли;
	
	ПрочитатьДанныеИзДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	
	ПрочитатьДанныеИзДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиБюджетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Сумма = СуммаДокумента - Объект.СтатьиБюджета.Итог("Сумма");
	КонецЕсли;
	
КонецПроцедуры
