&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ТолькоРедактирование Тогда
		Роль = "MobileDeviceUser";
	КонецЕсли;
	
	СписокСлужебныхДокументов = _ЛокКонтекст.ЛокЯдро_ПолучитьСписокСлужебныхДокументовMS();
	
	// Проставляем флажки и добавляем отсутствующие типы документов
	Если ТолькоРедактирование Тогда
		Для Каждого ДанныеДокумента Из _ЛокКонтекст.СтруктураМетаданных.ДокументыMS Цикл
			ТекСтрокаТипа = ТипыДокументов.НайтиПоЗначению(ДанныеДокумента.Ключ);
			Если ТекСтрокаТипа <> Неопределено Тогда
				ТекСтрокаТипа.Пометка = Истина;
			Иначе 			
				ТипыДокументов.Добавить(ДанныеДокумента.Ключ, ДанныеДокумента.Значение.Синоним);		
			КонецЕсли;
		КонецЦикла;                                                                                 
		
		Для Каждого ДанныеСлужДокумента Из СписокСлужебныхДокументов Цикл
			ТекСтрокаТипа = ТипыДокументов.НайтиПоЗначению(ДанныеСлужДокумента.Значение);
			Если ТекСтрокаТипа <> Неопределено Тогда
				ТекСтрокаТипа.Пометка = Истина;
			Иначе 			
				ТипыДокументов.Добавить(ДанныеСлужДокумента.Значение, ДанныеСлужДокумента.Представление);		
			КонецЕсли;
		КонецЦикла;		
	Иначе        
		ЗагрузитьТаблицуИдентификаторов(АдресИдентификаторов);
		Идентификатор = ПолучитьИдПоУмолчанию();
		
		Для Каждого ДанныеДокумента Из _ЛокКонтекст.СтруктураМетаданных.ДокументыMS Цикл
			ТипыДокументов.Добавить(ДанныеДокумента.Ключ, ДанныеДокумента.Значение.Синоним, Истина);					
		КонецЦикла;
		
		Для Каждого ДанныеСлужДокумента Из СписокСлужебныхДокументов Цикл
			ТипыДокументов.Добавить(ДанныеСлужДокумента.Значение, ДанныеСлужДокумента.Представление, Истина);					
		КонецЦикла;                                                                                 		
	КонецЕсли;
	
	УправлениеДоступностью();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Не ПроверкаЗаполненияПолей() Тогда
		Возврат;
	КонецЕсли;	

	ПараметрыГруппы = Новый Соответствие;
	ПараметрыГруппы.Вставить("id", 						Идентификатор);
	ПараметрыГруппы.Вставить("name", 					ИмяГруппы);		
	
	// Типы документов SMARTS
	СписокТипов = Новый Массив;
	Для Каждого КлюЗначениеТипа Из ТипыДокументов Цикл
		Если КлюЗначениеТипа.Пометка Тогда
			СписокТипов.Добавить(КлюЗначениеТипа.Значение);
		КонецЕсли;			
	КонецЦикла;                                                 
	ПараметрыГруппы.Вставить("documentTypeNames", 		СписокТипов);	
	// Типы документов для кома-режима
	ПараметрыГруппы.Вставить("AlldocumentTypeNames", 	ТипыДокументов);				
	ПараметрыГруппы.Вставить("batchMode", 				Ложь);		
	ПараметрыГруппы.Вставить("role", 					Роль);		
	ПараметрыГруппы.Вставить("serverSideInventory", 	Ложь);		
	ПараметрыГруппы.Вставить("autorunDocumentTypeName", "");		
	ПараметрыГруппы.Вставить("onStartHandlerName", 		"При начале работы пользователя");		
	ПараметрыГруппы.Вставить("onFinishHandlerName", 	"При завершении работы пользователя");			
	
	РезультатЗагрузки = _ЛокКонтекст.ЛокЯдро_ЗагрузитьГруппыПользователейВSMARTS(ПараметрыГруппы);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда		
		Если НЕ ОписаниеОповещенияОЗакрытии = Неопределено Тогда	
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, РезультатЗагрузки);
		КонецЕсли;                              		
	#КонецЕсли	
	
	Закрыть(РезультатЗагрузки);
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаКлиенте
Процедура УправлениеДоступностью()
	
	Элементы.Идентификатор.Доступность = Не ТолькоРедактирование;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуИдентификаторов(Адрес)
	
	МассивИд = ПолучитьИзВременногоХранилища(Адрес);
	СписокИдентификаторов.ЗагрузитьЗначения(МассивИд);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполненияПолей()
	
	Отказ = Ложь;
	
    ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("Идентификатор");	
	ОбязательныеПоля.Добавить("ИмяГруппы");
	ОбязательныеПоля.Добавить("Роль");
		
	Для Каждого Поле Из ОбязательныеПоля Цикл
		Если ПустаяСтрока(ЭтаФорма[Поле]) Тогда
			Отказ = Истина;
			#Если ТолстыйКлиентОбычноеПриложение Тогда	                      
				ЗаголовокПоля = Элементы[Поле + "Надпись"].Заголовок;
			#Иначе
				ЗаголовокПоля = Элементы[Поле].Заголовок;
			#КонецЕсли
			Сообщение = НСтр("be = 'Поле ""%1"" не павінна быць пустым'; en = 'Field ""%1"" must not be empty'; es = 'El campo ""%1"" no debe estar vacío'; ka = 'ველი ""%1"" არ უნდა იყოს ცარიელი'; kk = '""%1"" толтырылмауы тиіс емес'; ro = 'Câmpul ""%1"" nu trebuie să fie gol'; ru = 'Поле ""%1"" не должно быть пустым'; tr = '""%1"" alanı boş olmamalı'; uk = 'Поле ""%1"" не повинно бути порожнім'; uz = '""%1"" maydoni bo''sh bo''lishi mumkin emas'");
			Сообщение = _ЛокКонтекст.ЛокЯдро_СтрШаблон(Сообщение, ЗаголовокПоля);
			Сообщить(Сообщение); 			
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Не Отказ;	
	
КонецФункции    
     
&НаКлиенте
Функция ПолучитьИдПоУмолчанию()
	
	Инд = 1;
	
	Пока (Истина) Цикл		
		Если СписокИдентификаторов.НайтиПоЗначению(Строка(Инд)) = Неопределено Тогда
			Возврат Строка(Инд);		
		КонецЕсли;              
		
		Инд = Инд + 1;		
	КонецЦикла;
	
КонецФункции

#КонецОбласти   

#Если ТолстыйКлиентОбычноеПриложение Тогда
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	Объект = ЭтотОбъект;
#КонецЕсли
