#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка 
		Или ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторСуществует() Тогда
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Элемент справочника с идентификатором %1 уже существует.'"),
			Идентификатор);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Идентификатор = "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаЗаполненияОбъекта

Функция ИдентификаторСуществует()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КлассификаторСырьяГИСМТ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторСырьяГИСМТ КАК КлассификаторСырьяГИСМТ
	|ГДЕ
	|	КлассификаторСырьяГИСМТ.Идентификатор = &Идентификатор
	|	И НЕ КлассификаторСырьяГИСМТ.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И КлассификаторСырьяГИСМТ.Ссылка <> &ИсключаемыйЭлемент";
		Запрос.УстановитьПараметр("ИсключаемыйЭлемент", Ссылка);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
