#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть")
		Или ДополнительныеСвойства.Свойство("ОтчетПроизводственнойЛинии") Тогда
		Товары.Очистить();
		ШтрихкодыУпаковок.Очистить();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	ИнтеграцияИСМПВЕТИС.ОбработкаЗаполненияМаркировкиТоваровИСМП(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ИнтеграцияИСМППереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
	Если ДополнительныеСвойства.Свойство("ОтчетПроизводственнойЛинии") Тогда
		ЗаполнитьСрокГодностиВЕТИС();
	Иначе
		ЗаполнитьТабличнуюЧастьТоварыСрокомГодностиВЕТИС();
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ЗаполнитьКодыТНВЭДПоНоменклатуреВТабличнойЧасти(Товары);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("Товары.GTIN");
	НепроверяемыеРеквизиты.Добавить("Товары.Количество");
	НепроверяемыеРеквизиты.Добавить("Товары.КоличествоУпаковок");
	НепроверяемыеРеквизиты.Добавить("Товары.КоличествоПотребительскихУпаковок");
	НепроверяемыеРеквизиты.Добавить("Товары.ИдентификаторПроисхожденияВЕТИС");
	НепроверяемыеРеквизиты.Добавить("Товары.СрокГодности");
	НепроверяемыеРеквизиты.Добавить("Товары.Сертификация");
	НепроверяемыеРеквизиты.Добавить("Товары.Цена");
	НепроверяемыеРеквизиты.Добавить("Товары.СуммаАкциза");
	НепроверяемыеРеквизиты.Добавить("Товары.КодТНВЭД");
	НепроверяемыеРеквизиты.Добавить("Товары.ВидМеха");
	
	НепроверяемыеРеквизиты.Добавить("ПринятоеРешение");
	НепроверяемыеРеквизиты.Добавить("КодТаможенногоОргана");
	НепроверяемыеРеквизиты.Добавить("СтранаПроисхождения");
	НепроверяемыеРеквизиты.Добавить("ДатаДекларации");
	НепроверяемыеРеквизиты.Добавить("РегистрационныйНомерДекларации");
	НепроверяемыеРеквизиты.Добавить("Контрагент");
	НепроверяемыеРеквизиты.Добавить("СрокГодности");
	НепроверяемыеРеквизиты.Добавить("ДатаПроизводства");
	НепроверяемыеРеквизиты.Добавить("ДатаИмпорта");
	НепроверяемыеРеквизиты.Добавить("ДатаПервичногоДокумента");
	НепроверяемыеРеквизиты.Добавить("НомерПервичногоДокумента");
	НепроверяемыеРеквизиты.Добавить("СодержаниеЭтиловогоСпирта");
	НепроверяемыеРеквизиты.Добавить("ИдентификаторПроисхожденияВЕТИС");
	НепроверяемыеРеквизиты.Добавить("ИдентификаторПроисхожденияВЕТИССтрокой");
	НепроверяемыеРеквизиты.Добавить("ИдентификаторПроизводственнойЛинии");
	НепроверяемыеРеквизиты.Добавить("НомерСерии");
	НепроверяемыеРеквизиты.Добавить("КодТНВЭД");
	НепроверяемыеРеквизиты.Добавить("ВариантЗаполненияДекларации");
	НепроверяемыеРеквизиты.Добавить("ВариантФормированияАТКИСМП");
	НепроверяемыеРеквизиты.Добавить("GLNОрганизации");
	НепроверяемыеРеквизиты.Добавить("МестоОсуществленияДеятельностиАдресСтрокой");
	
	// Пиво
	НепроверяемыеРеквизиты.Добавить("Товары.НомерПервичногоДокумента");
	НепроверяемыеРеквизиты.Добавить("Товары.ДатаПервичногоДокумента");
	НепроверяемыеРеквизиты.Добавить("Товары.СодержаниеЭтиловогоСпирта");
	НепроверяемыеРеквизиты.Добавить("НомерСерии");
	
	// Сырье
	НепроверяемыеРеквизиты.Добавить("Товары.Сырье");
	НепроверяемыеРеквизиты.Добавить("Производитель");
	НепроверяемыеРеквизиты.Добавить("СтранаПроизводства");
	НепроверяемыеРеквизиты.Добавить("НаименованиеПервичногоДокумента");
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ТекущееСостояние = РегистрыСведений.СтатусыДокументовИСМП.ТекущееСостояние(Ссылка);
		ДальнейшееДействие = ТекущееСостояние.ДальнейшееДействие1;
	Иначе
		Реквизиты = Новый Структура(Документы.МаркировкаТоваровИСМП.ИменаРеквизитовДляРасчетаДальнейшегоДействия());
		ЗаполнитьЗначенияСвойств(Реквизиты, ЭтотОбъект);
		ДальнейшееДействие = Документы.МаркировкаТоваровИСМП.ДальнейшееДействиеПоУмолчанию(Реквизиты);
	КонецЕсли;
	
	ТекущаяОперация = МаркировкаТоваровКлиентСервер.ТекущаяОперацияПоДальнейшемуДействию(
		Операция, ОперацияНанесения, ДальнейшееДействие);
	
	ОперацииМаркировки = ИнтеграцияИСМПСлужебныйКлиентСервер.ОперацииМаркировки(Операция);
	
	ВидыПродукцииПоТоварнойГруппе = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоТоварнойГруппе(ТоварнаяГруппа);
	ЭтоСырьеГИСМТ = КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ВидыПродукцииПоТоварнойГруппе);
	
	ОбязательныеРеквизиты = Новый Массив;
	Если Не ЭтоСырьеГИСМТ Тогда
		Для Каждого СтрокаТовары Из Товары Цикл
			Если СтрокаТовары.Количество = 0
				И СтрокаТовары.КоличествоПотребительскихУпаковок = 0  Тогда
				ТекстСообщения = СтрШаблон(
					НСтр(
						"ru = 'В строке %1 табличной части Товары не заполнено поле ""Количество""'"),
						СтрокаТовары.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						"Товары", СтрокаТовары.НомерСтроки, "КоличествоУпаковок"),,
					Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПроверятьЗаполнениеСрокаГодности = КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоВидПродукцииСОбязательнымУказаниемСроковГодности(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация)
		И Не ОперацияНанесенияТолькоДляНаборов;
	ПроверятьЗаполнениеДатыПроизводства = КонструкторИСМПКлиентСервер.ЭтоВидПродукцииСОбязательнымУказаниемДатыПроизводства(ТоварнаяГруппа, ТекущаяОперация);
	
	Если ПроверятьЗаполнениеДатыПроизводства Тогда
		ОбязательныеРеквизиты.Добавить("ДатаПроизводства");
	КонецЕсли;
	
	Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляНомерСерии(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
		ОбязательныеРеквизиты.Добавить("НомерСерии");
	КонецЕсли;
	
	Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляКонтрагент(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
		ОбязательныеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
	
	Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляИдентификаторПроизводственнойЛинии(ВидыПродукцииПоТоварнойГруппе) Тогда
		ОбязательныеРеквизиты.Добавить("ИдентификаторПроизводственнойЛинии");
	КонецЕсли;
	
	Если ОтчетПроизводственнойЛинии Тогда
		
		НепроверяемыеРеквизиты.Добавить("Товары");
		
		Если ПроверятьЗаполнениеСрокаГодности Тогда
			ОбязательныеРеквизиты.Добавить("СрокГодности");
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляНомерДатаПервичногоДокумента(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("ДатаПервичногоДокумента");
			ОбязательныеРеквизиты.Добавить("НомерПервичногоДокумента");
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляСодержаниеЭтиловогоСпирта(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("СодержаниеЭтиловогоСпирта");
		КонецЕсли;
		
		Если ИнтеграцияИСМПВЕТИСКлиентСервер.ЭтоВидПродукцииИСМПВЕТИС(ТоварнаяГруппа)
			И ОперацииМаркировки.ТребуетсяЗаполнениеИдентификаторовПримененияВЕТИС Тогда
			Если ЗначениеЗаполнено(Номенклатура) Тогда
				ИнтеграцияИСМП.ПроверкаЗаполненияИдентификатораПроисхожденияВЕТИС(ЭтотОбъект, Отказ, Номенклатура, Истина);
			КонецЕсли;
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляКодТНВЭД(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация)
			И Не ЗначениеЗаполнено(КодТНВЭД) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнено поле ""Код ТН ВЭД""'");
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				Ссылка, 
				"КодТНВЭД",,
				Отказ);
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляСертификация(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация)
			И Не ЗначениеЗаполнено(НомерЛицензииНаПользованиеНедрами)
			И Не ЗначениеЗаполнено(НомерПаспортаСоответствия)
			И Не ЗначениеЗаполнено(НомерДокументаСертификации) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнено поле ""Сертификация""'");
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				Ссылка, 
				"Сертификация",,
				Отказ);
		КонецЕсли;
		
		Если ПроверятьЗаполнениеДанныхДекларации(ДальнейшееДействие) Тогда
			Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляТаможеннаяДекларация(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
				ДополнитьОбязательныеРеквизитыДекларации(ОбязательныеРеквизиты, Не ЭтоСырьеГИСМТ);
			КонецЕсли;
			Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляПринятоеРешениеКодТаможенногоОргана(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
				ДополнитьОбязательныеРеквизитыПринятоеРешениеКодТаможенногоОргана(ОбязательныеРеквизиты);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		НепроверяемыеРеквизиты.Добавить("ДанныеОтчетаПроизводственнойЛинии");
		
		Если Операция = Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗ Тогда
			НепроверяемыеРеквизиты.Добавить("Товары");
		КонецЕсли;
		
		// Специфика молочной продукции: нужен срок годности для операций нанесения
		Если ПроверятьЗаполнениеСрокаГодности Тогда
			ОбязательныеРеквизиты.Добавить("Товары.СрокГодности");
		КонецЕсли;
		
		// Специфика молочной продукции: нужен идентификатор ВЕТИС для операций ввода в оборот
		Если ИнтеграцияИСМПВЕТИСКлиентСервер.ЭтоВидПродукцииИСМПВЕТИС(ТоварнаяГруппа)
			И ОперацииМаркировки.ТребуетсяЗаполнениеИдентификаторовПримененияВЕТИС Тогда
			ИнтеграцияИСМП.ПроверкаЗаполненияИдентификатораПроисхожденияВЕТИС(ЭтотОбъект, Отказ);
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляКодТНВЭД(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("Товары.КодТНВЭД")
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляСертификация(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("Товары.Сертификация");
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляGLNОрганизации(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("GLNОрганизации");
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляНомерДатаПервичногоДокумента(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("ДатаПервичногоДокумента");
			ОбязательныеРеквизиты.Добавить("НомерПервичногоДокумента");
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляПервичныйДокументВТабличнойЧасти(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("Товары.ДатаПервичногоДокумента");
			ОбязательныеРеквизиты.Добавить("Товары.НомерПервичногоДокумента");
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляСодержаниеЭтиловогоСпирта(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("Товары.СодержаниеЭтиловогоСпирта");
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляСумма(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("Товары.Цена");
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляСуммаАкциза(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("Товары.СуммаАкциза");
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеНоменклатурыЕслиGTINНе029(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			
			НепроверяемыеРеквизиты.Добавить("Товары.Номенклатура");
			НепроверяемыеРеквизиты.Добавить("Товары.Характеристика");
			
			НачалоGTINМаркировкиОстатков = ИнтеграцияИСМПСлужебныйКлиентСервер.НачалоGTINМаркировкиОстатков();
			
			Для Каждого СтрокаТовары Из Товары Цикл
				Если Не ЗначениеЗаполнено(СтрокаТовары.Номенклатура)
					И Не СтрНачинаетсяС(СтрокаТовары.GTIN, НачалоGTINМаркировкиОстатков)Тогда
					ТекстСообщения = СтрШаблон(
						НСтр(
							"ru = 'В строке %1 табличной части Товары не заполнено поле Номенклатура'"),
							СтрокаТовары.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
							"Товары", СтрокаТовары.НомерСтроки, "Номенклатура"),,
						Отказ);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеНоменклатурыЕслиНеЗаполненGTIN(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			
			НепроверяемыеРеквизиты.Добавить("Товары.Номенклатура");
			НепроверяемыеРеквизиты.Добавить("Товары.Характеристика");
			
			Для Каждого СтрокаТовары Из Товары Цикл
				Если Не ЗначениеЗаполнено(СтрокаТовары.GTIN)
					И Не ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
					ТекстСообщения = СтрШаблон(
						НСтр(
							"ru = 'В строке %1 табличной части Товары не заполнено поле GTIN'"),
							СтрокаТовары.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
							"Товары", СтрокаТовары.НомерСтроки, "GTIN"),,
						Отказ);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если ПроверятьЗаполнениеДанныхДекларации(ДальнейшееДействие) Тогда
			Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляТаможеннаяДекларация(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
				ДополнитьОбязательныеРеквизитыДекларации(ОбязательныеРеквизиты, Не ЭтоСырьеГИСМТ);
			КонецЕсли;
			Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляПринятоеРешениеКодТаможенногоОргана(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
				ДополнитьОбязательныеРеквизитыПринятоеРешениеКодТаможенногоОргана(ОбязательныеРеквизиты);
			КонецЕсли;
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляСтранаПроисхождения(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("СтранаПроисхождения");
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляДатаИмпорта(ТоварнаяГруппа, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("ДатаИмпорта");
		КонецЕсли;
		
		Если ЭтоСырьеГИСМТ Тогда
			
			ОбязательныеРеквизиты.Добавить("Товары.Сырье");
			ИнтеграцияИСМП.ПроверкаЗаполненияДанныхФармацевтическогоСырья(ЭтотОбъект, Операция, Отказ);
			Если МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляВидПервичногоДокумента(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
				ОбязательныеРеквизиты.Добавить("НаименованиеПервичногоДокумента");
			КонецЕсли;
			
		КонецЕсли;
		
		Если МаркировкаТоваровКлиентСервер.ПриВводеВОборотПередаватьИдентификаторМОД(ВидыПродукцииПоТоварнойГруппе, ТекущаяОперация) Тогда
			ОбязательныеРеквизиты.Добавить("МестоОсуществленияДеятельностиАдресСтрокой");
		КонецЕсли;
		
		ИнтеграцияИСМППереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
		
		Если Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТС Тогда
			
			ОбязательныеРеквизиты.Добавить("ВариантЗаполненияДекларации");
			Если ВариантЗаполненияДекларации = Перечисления.ВариантыЗаполненияДекларацииИСМП.АТК Тогда
				ОбязательныеРеквизиты.Добавить("ВариантФормированияАТКИСМП");
			КонецЕсли;
			
		КонецЕсли;
		
		Если Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТСМех Тогда
			
			КодТНВЭДПрочиеПредметыОдеждыИСМП = ИнтеграцияИСМПКлиентСервер.КодТНВЭДПрочиеПредметыОдеждыИСМП();
			Для Каждого СтрокаТовары Из Товары Цикл
				Если СтрокаТовары.КодТНВЭД = КодТНВЭДПрочиеПредметыОдеждыИСМП
					И Не ЗначениеЗаполнено(СтрокаТовары.ВидМеха) Тогда
					ТекстСообщения = СтрШаблон(
						НСтр(
							"ru = 'В строке %1 табличной части Товары не заполнено поле Вид меха'"),
							СтрокаТовары.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
							"Товары", СтрокаТовары.НомерСтроки, "ВидМеха"),,
						Отказ);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если Операция = Перечисления.ВидыОперацийИСМП.Агрегация Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", ШтрихкодыУпаковок.ВыгрузитьКолонку("ШтрихкодУпаковки"));
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода
			|ИЗ
			|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
			|ГДЕ
			|	ШтрихкодыУпаковокТоваров.Ссылка В (&Ссылка)
			|	И ШтрихкодыУпаковокТоваров.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() Тогда
				ТекстСообщения = НСтр("ru = 'Для операции Агрегация требуется указание упаковок.
				                            |Откройте форму проверки и подбора и агрегируйте все коды маркировки.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
					ЭтотОбъект,
					"Операция",,
					Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Операция <> Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗ
			И Не ЭтоСырьеГИСМТ Тогда
			ИнтеграцияИСМПСлужебный.ПроверитьЗаполнениеШтрихкодовУпаковок(ЭтотОбъект, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	НепроверяемыеРеквизиты = ОбщегоНазначенияКлиентСервер.РазностьМассивов(НепроверяемыеРеквизиты, ОбязательныеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	Если Не ЭтоСырьеГИСМТ Тогда
		ИнтеграцияИСМП.ПроверкаЗаполненияКоличестваПотребительскихУпаковок(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ДанныеОтчетаПроизводственнойЛинии.Количество() > ИнтеграцияИСМПСлужебныйКлиентСервер.МаксимальноеКоличествоЗаписейВТабличнойЧасти() Тогда
		
		Если ЭтоНовый() Тогда
			СсылкаНаДокумент = Документы.МаркировкаТоваровИСМП.ПолучитьСсылку();
			УстановитьСсылкуНового(СсылкаНаДокумент);
		Иначе
			СсылкаНаДокумент = Ссылка;
		КонецЕсли;
		
		Блокировка                = Новый БлокировкаДанных();
		ЭлементБлокировки         = Блокировка.Добавить("РегистрСведений.ДанныеОтчетаПроизводственнойЛинииИСМП");
		ЭлементБлокировки.Режим   = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Документ", СсылкаНаДокумент);
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ДанныеОтчетаПроизводственнойЛинииИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(СсылкаНаДокумент, Истина);
		КлючЗаписи = 1;
		Для Каждого СтрокаТЧ Из ДанныеОтчетаПроизводственнойЛинии Цикл
			
			СтрокаНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаТЧ);
			СтрокаНабора.Документ   = СсылкаНаДокумент;
			СтрокаНабора.КлючЗаписи = КлючЗаписи;
			
			КлючЗаписи = КлючЗаписи + 1;
			
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
		
		ДанныеОтчетаПроизводственнойЛинии.Очистить();
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ТоварнаяГруппа) Тогда
		РегистрыСведений.СоответствиеНоменклатурыСырьяГИСМТ.ЗаписатьСоответствие(ЭтотОбъект);
	КонецЕсли;
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование   = Неопределено;
	ИдентификаторЗаявки = Неопределено;
	ШтрихкодыУпаковок.Очистить();
	ШтрихкодыАТК.Очистить();
	ИдентификаторПроизводственногоЗаказа = "";
	ИдентификаторПроизводственнойЛинии   = "";
	ХешСумма         = "";
	ДатаПроизводства = "";
	
	ДанныеОтчетаПроизводственнойЛинии.Очистить();
	ПроверятьСоставУпаковокПоДаннымИСМП = Ложь;
	Номенклатура                    = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Номенклатура");
	Характеристика                  = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ХарактеристикаНоменклатуры");
	Серия                           = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры");
	ИдентификаторПроисхожденияВЕТИС = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ИдентификаторПроисхожденияВЕТИС");
	
	СрокГодности                           = "";
	СкоропортящаясяПродукция               = Ложь;
	ИдентификаторПроисхожденияВЕТИССтрокой = "";
	
	СоздаватьШтрихкодыУпаковок = Ложь;
	ВариантВыполненияАгрегации = Перечисления.ВариантыВыполненияАгрегацииИСМП.ПустаяСсылка();
	Количество = 0;
	ОперацияНанесенияТолькоДляНаборов = Ложь;
	
	ПроверитьАктуальностьОперации();
	ПроверитьАктуальностьВариантаВыполненияАгрегации();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ОбменДаннымиИСМП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеИСМП.ДанныеЗаполненияМаркировкиТоваровИСМП(Организация, Операция, ТоварнаяГруппа);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
	ПроверитьАктуальностьОперации();
	
	ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьДанныеПоТоварамМаркировкиТоваровИСМП(
		Товары,
		ЭтотОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьТоварыСрокомГодностиВЕТИС()
	
	Если ИнтеграцияИСМПВЕТИСКлиентСервер.ЭтоВидПродукцииИСМПВЕТИС(ТоварнаяГруппа) Тогда
		Возврат;
	КонецЕсли;
	
	Идентификаторы = Товары.Выгрузить(,"ИдентификаторПроисхожденияВЕТИС").ВыгрузитьКолонку("ИдентификаторПроисхожденияВЕТИС");
	ДанныеИдентификаторовПроисхождения = ИнтеграцияИСМПВЕТИС.ДанныеИдентификаторовПроисхождения(Идентификаторы);
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТовары.ИдентификаторПроисхожденияВЕТИС) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеПоИдентификатору = ДанныеИдентификаторовПроисхождения.Получить(СтрокаТовары.ИдентификаторПроисхожденияВЕТИС);
		Если ДанныеПоИдентификатору = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТовары.СрокГодности = ДанныеПоИдентификатору.СрокГодности;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСрокГодностиВЕТИС()
	
	Если Не ИнтеграцияИСМПВЕТИСКлиентСервер.ЭтоВидПродукцииИСМПВЕТИС(ТоварнаяГруппа) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИнтеграцияИСМПВЕТИС.ИспользуетсяПодсистемаВетИС() Тогда
		Возврат;
	КонецЕсли;
	
	СрокГодности    = '00010101';
	СкоропортящаясяПродукция = Ложь;
	
	Если ЗначениеЗаполнено(ИдентификаторПроисхожденияВЕТИС) Тогда
		Идентификаторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторПроисхожденияВЕТИС);
		ДанныеИдентификаторовПроисхождения = ИнтеграцияИСМПВЕТИС.ДанныеИдентификаторовПроисхождения(Идентификаторы);
		
		ДанныеПоИдентификатору = ДанныеИдентификаторовПроисхождения.Получить(ИдентификаторПроисхожденияВЕТИС);
		Если ДанныеПоИдентификатору = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СрокГодности = ДанныеПоИдентификатору.СрокГодности;
		СкоропортящаясяПродукция = ДанныеПоИдентификатору.СкоропортящаясяПродукция;
		ИдентификаторПроисхожденияВЕТИССтрокой = ДанныеПоИдентификатору.Идентификатор;

	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьАктуальностьОперации()
	
	Если Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков
		И Не КонструкторИСМПКлиентСервер.ВидПродукцииПодлежитМаркировкеОстатков(ТоварнаяГруппа) Тогда
		Операция = Неопределено;
		Товары.Очистить();
	КонецЕсли;
	
	Если ИнтеграцияИСМПКлиентСервер.ОперацииНанесенияКодовМаркировки().Найти(Операция) <> Неопределено
		И ИнтеграцияИСМПКлиентСервер.ОперацииНанесенияКодовМаркировки(Ложь, ТоварнаяГруппа).Найти(Операция) = Неопределено Тогда
		Операция = Неопределено;
	КонецЕсли;
	
	Если Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТС
		И Не ЗначениеЗаполнено(ВариантЗаполненияДекларации) Тогда
		ВариантЗаполненияДекларации = Перечисления.ВариантыЗаполненияДекларацииИСМП.КодыМаркировки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьАктуальностьВариантаВыполненияАгрегации()
	
	Если Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТС
		И (ВариантЗаполненияДекларации = Перечисления.ВариантыЗаполненияДекларацииИСМП.КодыУпаковок
			Или ВариантЗаполненияДекларации = Перечисления.ВариантыЗаполненияДекларацииИСМП.АТК) Тогда
		ВариантВыполненияАгрегации = Перечисления.ВариантыВыполненияАгрегацииИСМП.ПередВводомВОборот;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура ДополнитьОбязательныеРеквизитыДекларации(ОбязательныеРеквизиты, ВключаяДату = Истина)
	
	ОбязательныеРеквизиты.Добавить("РегистрационныйНомерДекларации");
	Если ВключаяДату Тогда
		ОбязательныеРеквизиты.Добавить("ДатаДекларации");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьОбязательныеРеквизитыПринятоеРешениеКодТаможенногоОргана(ОбязательныеРеквизиты)
	
	ОбязательныеРеквизиты.Добавить("ПринятоеРешение");
	ОбязательныеРеквизиты.Добавить("КодТаможенногоОргана");
	
КонецПроцедуры

Функция ПроверятьЗаполнениеДанныхДекларации(ДальнейшееДействие)
	
	Если ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ВведитеВОборот
		Или ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ВведитеВОборотСИсправлениями
		Или ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ПередайтеДанные
		Или ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ПередайтеДанныеСИсправлениями Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецЕсли
