#Область ОписаниеПеременных

&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _КлиентскиеВызовы;

&НаКлиенте
Перем СписокВыбораВидУпак;

&НаКлиенте
Перем СписокВыбораТекстИнфИдентиф;

&НаКлиенте
Перем СписокВыбораТипКузова;

&НаКлиенте
Перем СписокВыбораВидТС;

&НаКлиенте
Перем _Платформа;

&НаСервере
Перем _МодульЯдроНаСервере;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовок();
	
	Если Параметры.Свойство("ОбщийКонтекстКлиентСервер") Тогда
		ОбщийКонтекстКлиентСервер = Параметры.ОбщийКонтекстКлиентСервер;
	КонецЕсли;
	
	_ДокументыОснования = ОпределитьДокументыОснованияИОсновной(Параметры);

	Если Параметры.Свойство("СтрокаСписка")
		И Параметры.СтрокаСписка <> Неопределено Тогда
		СтрокаСписка = Параметры.СтрокаСписка;
	КонецЕсли;
		
	МодульОбъекта = ОбработкаОбъект();
		
	УстановитьОграниченияТипов();
	
	Если _ДокументыОснования.Количество() > 0 Тогда
		ЗаполнитьДокументыОснования(_ДокументыОснования);
		ЗаполнитьДанныеФормы();
	КонецЕсли;
		
	//заполняется в "ЗаполнитьДанныеФормы"
	//УстановитьСписокВыбораАдрПунктНазн();
	//УстановитьСписокВыбораАдрГруз();
 	УстановитьПараметрыВыбораДоговора(рл_СвЭксп, "рл_ДогТрЭксп");
	
	УстановитьЗаголовокГруппыДатыИВремя();
	УстановитьУсловноеОформлениеНаСервере();
	
	ИдентификаторыКЛНТ = МодульОбъекта.ИдентификаторыЭДО(рл_СвКлнт, Истина);
	ИдКЛНТ = ИдентификаторыКЛНТ.ID;
	ИдентификаторыЭКСП = МодульОбъекта.ИдентификаторыЭДО(рл_СвЭксп, Ложь);
	ИдЭКСП = ИдентификаторыЭКСП.ID;
	
	РежимПереотправки = Ложь;

	ОпределитьЗапретРедактирования();
	ДоступностьФормы();
		
	ПроверитьЭПЭ();
	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();
	
	ДопПеременные = Новый Соответствие;
	
	Если ЭтоНовыйДокументПЭ() Тогда
		
		Модифицированность = Истина;
		ДействиеМетрики = МодульОбъекта.Метрика_НазваниеДействий().СозданиеЭПЭ;
		
	Иначе
		
		ДействиеМетрики = МодульОбъекта.Метрика_НазваниеДействий().ОткрытиеФормыЭПЭ;
		ДопПеременные.Вставить(МодульОбъекта.Метрика_КлючОшибки(), Метрики_ПредставлениеОшибокВМассиве());
		
	КонецЕсли;
	
	МодульОбъекта.Метрика_ЗаполнитьВыбранныеДокументыПоТипам(ДопПеременные, _ДокументыОснования);
	ДопПеременные.Вставить(МодульОбъекта.Метрика_КлючИдентификатораПеревозочногоДокумента(), Строка(ИдентификаторПЭ));
	
	НаименованиеФормы = Метрика_НаименованиеФормы();
	
	МодульОбъекта.Метрика_ДобавитьСтатистику_ПоКонтексту(ДействиеМетрики, ДопПеременные, , НаименованиеФормы);
	
	Ядро = Модуль_Ядро();
	Ядро.СписокОшибок_Очистить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграниченияТипов()

	МодульОбъекта = ОбработкаОбъект();

	МассивТиповОрганизация = Новый Массив;
	МассивТиповОрганизация.Добавить(МодульОбъекта.СправочникТипОрганизации());
	Элементы.рл_СвКлнт.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповОрганизация);
	
	МассивТиповКонтрагент = Новый Массив;
	МассивТиповКонтрагент.Добавить(МодульОбъекта.СправочникТипОрганизации());
	МассивТиповКонтрагент.Добавить(МодульОбъекта.СправочникТипКонтрагенты());
	Элементы.рл_СвГруз_СвГО.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);
	Элементы.рл_СвГруз_СвГП.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);

	МассивТиповКонтрагент = Новый Массив;
	МассивТиповКонтрагент.Добавить(МодульОбъекта.СправочникТипКонтрагенты());
	Элементы.рл_СвЭксп.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);
	
	МассивТиповДоговоры = Новый Массив;
	МассивТиповДоговоры.Добавить(МодульОбъекта.СправочникТипДоговорыКонтрагентов());
	Элементы.рл_ДогТрЭксп.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповДоговоры);

	МассивТиповСотрудники = Новый Массив;
	МассивТиповСотрудники.Добавить(МодульОбъекта.СправочникТипФизическиеЛица());
	
	МассивТиповВалюта = Новый Массив;
	МассивТиповВалюта.Добавить(МодульОбъекта.СправочникТипВалюты());
	Элементы.рл_СвГруз_ОпГрузОбъявлСтГруз_Валюта.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповВалюта);

	МассивТиповНоменклатура = Новый Массив;
	МассивТиповНоменклатура.Добавить(МодульОбъекта.СправочникТипНоменклатура());
	Элементы.рл_СвГруз_ОпГрузНоменклатура.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповНоменклатура);
	
	МассивТиповСтраны = Новый Массив;
	МассивТиповСтраны.Добавить(МодульОбъекта.СправочникТипСтраны());
	Элементы.рл_СвГруз_ОпГрузСвСтрПроисх.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповСтраны);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьКомандФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(СтрокаСписка);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность
		И НЕ РежимПереотправки Тогда
		
		Отказ = Истина;
		Если ЗавершениеРаботы = Истина Тогда
			ТекстПредупреждения = "Настройки были изменены. Все изменения будут потеряны.";
			Возврат;
		КонецЕсли;
		
		Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВопросаОЗакрытии", ЭтаФорма);
		ПоказатьВопрос(Оповещение,"Настройки были изменены, ВЫЙТИ без сохранения?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВопросаОЗакрытии(РезультатВопроса,ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ЭтаФорма.Закрыть();	
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиСобытийЭлементовФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура рл_СвГруз_АдрПунктНазнПриИзменении(Элемент)
	
	Адреса = ПолучитьИзВременногоХранилища(ХранениеАдресаДоставки);
	Адрес = рл_СвГруз_АдрПунктНазн_АдрВыдГруз_Адрес_АдрИнф_АдрТекст;
	Для Каждого СтруктураАдреса Из Адреса Цикл
		Если СтруктураАдреса.Адрес = Адрес Тогда
			рл_СвГруз_АдрПунктНазн_АдрВыдГруз_Адрес_АдрРФ = СтруктураАдреса.ЗначениеАдреса;                     
		КонецЕсли;
	КонецЦикла;
	Модифицированность = Истина;
	
КонецПроцедуры 

&НаКлиенте
Процедура рл_СвГруз_СвГОПриИзменении(Элемент)

	УстановитьСписокВыбораАдрГруз();	
  	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_СвГООткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если НельзяОткрыть(рл_СвГруз_СвГО, "рл_СвГруз_СвГО") Тогда
		Возврат;	
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвГруз_СвГО);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаУчастника"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", "рл_СвГруз_СвГО");

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаУчастника", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура рл_СвКлнтПриИзменении(Элемент)

	Если ЗначениеЗаполнено(рл_СвКлнт) 
		И Не ЕстьИдентификаторыЭДО(рл_СвКлнт, Истина) Тогда
		ПредложитьСопоставитьКонтрагента("рл_СвКлнт");
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвКлнтОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НельзяОткрыть(рл_СвКлнт, "рл_СвКлнт") Тогда
		Возврат;	
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвКлнт);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаУчастника"));
	
	ДополнительныеПараметры = Новый Структура;

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаУчастника", ПараметрыФормы, ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвЭкспПриИзменении(Элемент)

	УстановитьСписокВыбораАдрГруз();
	УстановитьСписокВыбораАдрПунктНазн();
	
	Если ЗначениеЗаполнено(рл_СвЭксп) 
		И Не ЕстьИдентификаторыЭДО(рл_СвЭксп, Ложь) Тогда
		ПредложитьСопоставитьКонтрагента("рл_СвЭксп");
	КонецЕсли;

	рл_ДогТрЭксп = Неопределено;
 	УстановитьПараметрыВыбораДоговора(рл_СвЭксп, "рл_ДогТрЭксп"); 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвЭкспОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НельзяОткрыть(рл_СвЭксп, "рл_СвЭксп") Тогда
		Возврат;	
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвЭксп);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаУчастника"));
	
	ДополнительныеПараметры = Новый Структура;

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаУчастника", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура рл_ДогТрЭкспПриИзменении(Элемент)

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_СвГППриИзменении(Элемент)
	
	УстановитьСписокВыбораАдрПунктНазн();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_СвГПОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если НельзяОткрыть(рл_СвГруз_СвГП, "рл_СвГруз_СвГП") Тогда
		Возврат;	
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвГруз_СвГП);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаУчастника"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", "рл_СвГруз_СвГП");
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаУчастника", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеЗакрытияФормыРедактирования(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия <> Неопределено Тогда
		Если ДополнительныеПараметры.Свойство("ИмяРеквизита") Тогда
			Если ЭтоРеквизитXML(ДополнительныеПараметры.ИмяРеквизита) И ТипЗнч(РезультатЗакрытия) = Тип("Строка") Тогда
				ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита] = РезультатЗакрытия;
				ЭтаФорма[КлючПредставление(ДополнительныеПараметры.ИмяРеквизита)] = ЗначениеПредставлениеПоСтрокеXML(РезультатЗакрытия);
			ИначеЕсли ДополнительныеПараметры.ИмяРеквизита = "рл_СвГруз_СвГО" Тогда	
				УстановитьСписокВыбораАдрГруз();
			ИначеЕсли ДополнительныеПараметры.ИмяРеквизита = "рл_СвГруз_СвГП" Тогда	
				УстановитьСписокВыбораАдрПунктНазн();
			КонецЕсли;
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БаннерБольшеВозможностейТекстГиперссылкаНажатие(Элемент)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().БольшеВозможностейЛогистики;
	Метрика_ПриВыполненииДействия(ДействиеМетрики);
	
	_КлиентскиеВызовы.ОткрытьСтраницуСИнформациейОМодулеЛогистики();
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_СвТС_ВидТСНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если СписокВыбораВидТС = Неопределено Тогда
		СписокВыбораВидТС = СписокВыбораВидТС();
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораВидаТС", ЭтаФорма);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораВидТС, Оповещение, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораВидаТС(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		рл_СвГруз_СвТС_ВидТС = ЗначениеВыбора.Значение;
		ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_СвТС_ВидТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если СписокВыбораВидТС = Неопределено Тогда
		СписокВыбораВидТС = СписокВыбораВидТС();
	КонецЕсли;
	ВыполнитьАвтоПодбор(СписокВыбораВидТС, Текст, Элемент.ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_СвТС_ТипКузовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если СписокВыбораТипКузова = Неопределено Тогда
		СписокВыбораТипКузова = СписокВыбораТипКузова();
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораТипаКузова", ЭтаФорма);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораТипКузова, Оповещение, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораТипаКузова(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		рл_СвГруз_СвТС_ТипКузов = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_СвТС_ТипКузовАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СписокВыбораТипКузова = Неопределено Тогда
		СписокВыбораТипКузова = СписокВыбораТипКузова();
	КонецЕсли;
	ВыполнитьАвтоПодбор(СписокВыбораТипКузова, Текст, Элемент.ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_АдрГруз_МестоПриемПриИзменении(Элемент)
	
	УстановитьСписокВыбораАдрГруз();
	Если рл_СвГруз_АдрГруз_МестоПрием = 1 Тогда
		Элементы.рл_СвГруз_АдрГруз_АдрПриемГруз_Адрес_АдрИнф_АдрТекст.ПодсказкаВвода = "<адреса для выбора заполняются в карточке грузоотправителя>";
	Иначе
		Элементы.рл_СвГруз_АдрГруз_АдрПриемГруз_Адрес_АдрИнф_АдрТекст.ПодсказкаВвода = "<адреса для выбора заполняются в карточке экспедитора>";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_АдрПунктНазн_МестоВыдПриИзменении(Элемент)
	
	УстановитьСписокВыбораАдрПунктНазн();
	Если рл_СвГруз_АдрПунктНазн_МестоВыд = 1 Тогда
		Элементы.рл_СвГруз_АдрПунктНазн_АдрВыдГруз_Адрес_АдрИнф_АдрТекст.ПодсказкаВвода = "<адреса для выбора заполняются в карточке грузополучателя>";
	Иначе
		Элементы.рл_СвГруз_АдрПунктНазн_АдрВыдГруз_Адрес_АдрИнф_АдрТекст.ПодсказкаВвода = "<адреса для выбора заполняются в карточке экспедитора>";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_АдрГрузПриИзменении(Элемент)

	Адреса = ПолучитьИзВременногоХранилища(ХранениеАдресаПогрузки);
	Адрес = рл_СвГруз_АдрГруз_АдрПриемГруз_Адрес_АдрИнф_АдрТекст;
	Для Каждого СтруктураАдреса Из Адреса Цикл
		Если СтруктураАдреса.Адрес = Адрес Тогда
			рл_СвГруз_АдрГруз_АдрПриемГруз_Адрес_АдрРФ = СтруктураАдреса.ЗначениеАдреса;                     
		КонецЕсли;
	КонецЦикла;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ОтмПриемПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ДатОтгрСПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвГруз_ДатОтгрСВрПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ДатОтгрПоПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвГруз_ДатОтгрПоВрПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ДатДостГрСПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвГруз_ДатДостГрС_ВрПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ДатДостГрПоПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвГруз_ДатДостГрПо_ВрПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_рл_СвГруз_ОпГруз

&НаКлиенте
Процедура рл_СвГруз_ОпГрузПередУдалением(Элемент, Отказ)

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ОпГрузПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ОпГрузПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока = Истина Тогда
		ТекущиеДанные = Элементы.рл_СвГруз_ОпГруз.ТекущиеДанные;
		ТекущиеДанные.КонтейнерыГиперссылка = "<добавить>";
		ТекущиеДанные.ОпасныеГрузыГиперссылка = "<добавить>";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ОпГрузВесГруз_ВесБруттоПриИзменении(Элемент)
	     
	ЗаполнитьВесГрузПарт_ВесБрутто();
	Модифицированность = Истина;
	
КонецПроцедуры 

&НаКлиенте
Процедура рл_СвГруз_ОпГрузКолМестГрПриИзменении(Элемент)

	ЗаполнитьКолМестПарт();
 	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ОпГрузПриИзменении(Элемент)

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ОпГрузВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	Если Поле.Имя = "рл_СвГруз_ОпГрузКонтейнерыГиперссылка" Тогда
		
		ТекущиеДанные = Элементы.рл_СвГруз_ОпГруз.ТекущиеДанные;
		ТекущаяСтрока = Элементы.рл_СвГруз_ОпГруз.ТекущаяСтрока;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КонтейнерыXML", ТекущиеДанные.КонтейнерыXML);
		ПараметрыФормы.Вставить("ЗапретРедактирования", ЗапретРедактирования);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИндентификаторСтроки", ТекущаяСтрока);
		
		Если ЗапретРедактирования Тогда
			Оповещение = Неопределено;
		Иначе
			Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеРедактированияКонтейнеров", ЭтаФорма, ДополнительныеПараметры);
		КонецЕсли;
		
		_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаРедактированияКонтейнеров", ПараметрыФормы, ЭтаФорма, Оповещение);

	ИначеЕсли Поле.Имя = "рл_СвГруз_ОпГрузОпасныеГрузыГиперссылка"  Тогда

		ТекущиеДанные = Элементы.рл_СвГруз_ОпГруз.ТекущиеДанные;
		ТекущаяСтрока = Элементы.рл_СвГруз_ОпГруз.ТекущаяСтрока;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОпасныеГрузыXML", ТекущиеДанные.ОпасныеГрузыXML);
		ПараметрыФормы.Вставить("ЗапретРедактирования", ЗапретРедактирования);
		ПараметрыФормы.Вставить("ИмяФормы", "ФормаПЭ");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИндентификаторСтроки", ТекущаяСтрока);
		
		Если ЗапретРедактирования Тогда
			Оповещение = Неопределено;
		Иначе
			Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеРедактированияОпасныхГрузов", ЭтаФорма, ДополнительныеПараметры);
		КонецЕсли;
		
		_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаРедактированияОпасныхГрузов", ПараметрыФормы, ЭтаФорма, Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеРедактированияКонтейнеров(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		ТекущиеДанные = рл_СвГруз_ОпГруз.НайтиПоИдентификатору(ДополнительныеПараметры.ИндентификаторСтроки);
		ТекущиеДанные.КонтейнерыXML = РезультатЗакрытия;
		Если ТекущиеДанные.КонтейнерыXML = "" Тогда
			ТекущиеДанные.КонтейнерыГиперссылка = "<добавить>";
		Иначе
			ТекущиеДанные.КонтейнерыГиперссылка = "<редактировать>";
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеРедактированияОпасныхГрузов(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		ТекущиеДанные = рл_СвГруз_ОпГруз.НайтиПоИдентификатору(ДополнительныеПараметры.ИндентификаторСтроки);
		ТекущиеДанные.ОпасныеГрузыXML = РезультатЗакрытия;
		Если ТекущиеДанные.ОпасныеГрузыXML = "" Тогда
			ТекущиеДанные.ОпасныеГрузыГиперссылка = "<добавить>";
		Иначе
			ТекущиеДанные.ОпасныеГрузыГиперссылка = "<редактировать>";
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ИнфПолТекстИнф_ИдентифНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если СписокВыбораТекстИнфИдентиф = Неопределено Тогда
		СписокВыбораТекстИнфИдентиф = СписокВыбораТекстИнфИдентиф();
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура("ИндентификаторСтроки", Элементы.рл_СвГруз_ИнфПол.ТекущаяСтрока);
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораТекстИнфИдентиф", ЭтаФорма, ДополнительныеПараметры);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораТекстИнфИдентиф, Оповещение, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораТекстИнфИдентиф(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		ТекущиеДанные = рл_СвГруз_ИнфПол.НайтиПоИдентификатору(ДополнительныеПараметры.ИндентификаторСтроки);
		ТекущиеДанные.ТекстИнф_Идентиф = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ОпГрузВесГруз_ВесНеттоПриИзменении(Элемент)
	ЗаполнитьВесГрузПарт_ВесНетто();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ОпГрузВесГруз_КолПаллПриИзменении(Элемент)
	ЗаполнитьВесГрузПарт_КолПалл();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ОпГрузИнфУпГруз_ВидУпакНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если СписокВыбораВидУпак = Неопределено Тогда
		СписокВыбораВидУпак = СписокВыбораВидУпак(); 
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеДляВыбора", СписокВыбораВидУпак);
	ПараметрыФормы.Вставить("ОтображатьПредставление", Ложь);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИндентификаторСтроки", Элементы.рл_СвГруз_ОпГруз.ТекущаяСтрока);

	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораВидаТары", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаВыбораЗначений", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораВидаТары(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		ТекущиеДанные = рл_СвГруз_ОпГруз.НайтиПоИдентификатору(ДополнительныеПараметры.ИндентификаторСтроки);
		ТекущиеДанные.ИнфУпГруз_ВидУпак = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ОпГрузИнфУпГруз_ВидУпакОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если СписокВыбораВидУпак = Неопределено Тогда
		СписокВыбораВидУпак = СписокВыбораВидУпак(); 
	КонецЕсли;
	
	ТекущиеДанные = Элементы.рл_СвГруз_ОпГруз.ТекущиеДанные;
	ЭлементСписка = СписокВыбораВидУпак.НайтиПоЗначению(ВыбранноеЗначение);
	Если ЭлементСписка = Неопределено Тогда
		ТекущиеДанные.ИнфУпГруз_ВидУпак = "";
	Иначе
		ТекущиеДанные.ИнфУпГруз_ВидУпак = ЭлементСписка.Значение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ОпГрузИнфУпГруз_ВидУпакОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если СписокВыбораВидУпак = Неопределено Тогда
		СписокВыбораВидУпак = СписокВыбораВидУпак(); 
	КонецЕсли;

	ТекущиеДанные = Элементы.рл_СвГруз_ОпГруз.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(Текст) Тогда
		ТекущиеДанные.ИнфУпГруз_ВидУпак = "";
	Иначе
		СтрокаПоиска = СтрокаПоискаФильтра(Текст, Элемент.ТекстРедактирования);
		Если СтрокаПоиска = Неопределено Тогда
			ТекущиеДанные.ИнфУпГруз_ВидУпак = "";
		Иначе
			ДанныеВыбора = СписокЗначенийНайти(СтрокаПоиска, СписокВыбораВидУпак);
			Если ДанныеВыбора.Количество() > 0 Тогда
				ТекущиеДанные.ИнфУпГруз_ВидУпак = ДанныеВыбора[0].Значение;
			Иначе
				ТекущиеДанные.ИнфУпГруз_ВидУпак = "";
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;  

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГруз_ОпГрузИнфУпГруз_ВидУпакПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.рл_СвГруз_ОпГруз.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ИнфУпГруз_ВидУпак) Тогда
		ТекущиеДанные.ИнфУпГруз_ВесУпак = 0;
		ТекущиеДанные.ИнфУпГруз_ГабарУпак_ВысЗнач = 0;
		ТекущиеДанные.ИнфУпГруз_ГабарУпак_ДлЗнач = 0;
		ТекущиеДанные.ИнфУпГруз_ГабарУпак_ШирЗнач = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОснования

&НаКлиенте
Процедура ДокументыОснованияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = ДокументыОснования.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументОснование) Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ДокументОснование);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОшибки

&НаКлиенте
Процедура ОшибкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда
		
		ТекДанные = Элементы.Ошибки.ТекущиеДанные;
		Если СтрНайтиЛок(ЭтаФорма.ИмяФормы, ТекДанные.ИмяФормы) = 0 Тогда
			
			ОбязательныеРеквизиты = ОбязательныеРеквизитыФормы(ТекДанные.ИмяФормы);
			
			Попытка
				ЗначениеРодителя = ЭтаФорма[ТекДанные.ИмяРеквизитаРодителя];
			Исключение
				ЗначениеРодителя = Неопределено;
			КонецПопытки;
			
			Если ЗначениеРодителя <> Неопределено И ЗначениеЗаполнено(ЗначениеРодителя) Тогда
				
				НазваниеФормы = ТекДанные.ИмяФормы;
				НазваниеРеквизита = ТекДанные.НазваниеРеквизита;
				Если НазваниеФормы = "ФормаДоговора" Тогда      
					//пока так, далее реализуем форму в форме.
					НазваниеФормы = "ФормаТранспортногоСредства";
					НазваниеРеквизита = "пр_ОснАрЛиз";
				КонецЕсли;
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("СсылкаНаОбъект", ЗначениеРодителя); 
				ПараметрыФормы.Вставить("ЗначениеРеквизита", ЗначениеРодителя);
				ПараметрыФормы.Вставить("ИмяТекущегоЭлемента", НазваниеРеквизита);
				ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизиты);
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ИмяРеквизита", ТекДанные.ИмяРеквизитаРодителя);
				ДополнительныеПараметры.Вставить("ЗначениеРеквизита", ЗначениеРодителя);
				
				Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);
				
				_КлиентскиеВызовы.ОткрытьФормуПоИмени(НазваниеФормы, ПараметрыФормы, ЭтаФорма, Оповещение);

			КонецЕсли;
			
		Иначе
			
			НазваниеРеквизита = ТекДанные.НазваниеРеквизита;
			Если СтрНайтиЛок(НазваниеРеквизита, "рл_ДогТрЭксп") > 0 Тогда
				НазваниеРеквизита = "рл_ДогТрЭксп";
			КонецЕсли;

			Попытка
				ЭтаФорма.ТекущийЭлемент = Элементы[НазваниеРеквизита];
			Исключение
			КонецПопытки;
				
			Если ЗначениеЗаполнено(ТекДанные.ИдентификаторСтроки) Тогда
				Элементы[ТекДанные.ИмяРеквизитаТЧ].ТекущаяСтрока = Число(ТекДанные.ИдентификаторСтроки);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекДанные.НазваниеРеквизита = "рл_СвКлнт"
			Или ТекДанные.НазваниеРеквизита = "рл_СвЭксп" Тогда
			Если СтрНайтиЛок(ТекДанные.Представление, "ЭДО - совпадают идентификаторы") > 0 Тогда
			Иначе
				ПредложитьСопоставитьКонтрагента(ТекДанные.НазваниеРеквизита);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьЧерновик();
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ЗаписатьЭПЭ;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить(
		_КлиентскиеВызовы.Метрика_КлючИдентификатораПеревозочногоДокумента(), Строка(ИдентификаторПЭ));
		
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючОшибки(), Метрики_ПредставлениеОшибокВМассиве());
	Метрика_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЭПЭ(Команда)
	
	Результат = ПодготовитьЭПЭ(Ложь);
	
	Если Результат <> Неопределено Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(Результат);
		ТекстовыйДокумент.Показать("Поручение экспедитору");
	КонецЕсли;
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПоказатьЭПЭ;
	Метрика_ПриВыполненииДействия(ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВремяОтгрузкиТекущим(Команда)

	рл_СвГруз_ДатОтгрС = ТекущаяДата();

	Продолжительность = 60;
	Если ТипЗнч(Продолжительность) = Тип("Число") Тогда
		рл_СвГруз_ДатОтгрПо = рл_СвГруз_ДатОтгрС + Продолжительность * 60;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВремяДоставкиТекущим(Команда)

	рл_СвГруз_ДатДостГрС = ТекущаяДата();

	Продолжительность = 60;
	Если ТипЗнч(Продолжительность) = Тип("Число") Тогда
		рл_СвГруз_ДатДостГрПо = рл_СвГруз_ДатДостГрС + Продолжительность * 60;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправитьИсходящий(Команда)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПодписатьИОтправить;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Resend", РежимПереотправки);
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючИдентификатораПеревозочногоДокумента(), Строка(ИдентификаторПЭ));
	ДополнитьДопПеременныеИдентификаторамиУчастников(ДопПеременные);
	
	Метрика_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);
	
	Если РежимПереотправки Тогда
		ПодписатьИОтправитьПовторноИсходящийДокумент();
	Иначе
		ПодписатьИОтправитьИсходящийДокумент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДопПеременныеИдентификаторамиУчастников(ДопПеременные)
	
	СтруктураУчастников = Новый Структура();
	
	УчастникГО = _КлиентскиеВызовы.Контракт_СтруктураУчастника(рл_СвКлнт, Истина);
	СтруктураУчастников.Вставить("УчастникГО", УчастникГО);
	
	УчастникПер= _КлиентскиеВызовы.Контракт_СтруктураУчастника(рл_СвЭксп, Ложь);
	СтруктураУчастников.Вставить("УчастникПер", УчастникПер);
	
	ЗаполнитьИдентификаторыЭДОУчастниковНаСервере(СтруктураУчастников);
	
	УчастникГО = СтруктураУчастников.УчастникГО;
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючBoxIDГО(), УчастникГО.Идентификатор);
	УчастникПер = СтруктураУчастников.УчастникПер;
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючBoxIDПРВ(), УчастникПер.Идентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИдентификаторыЭДОУчастниковНаСервере(СтруктураУчастников)
	
	МодульОбъекта = ОбработкаОбъект();
	МодульОбъекта.ЗаполнитьИдентификаторыЭДОУчастников(СтруктураУчастников);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборДокументовОснования(Команда)

	ПараметрыФормы = Новый Структура;
	мДокументыОснования = Новый Массив;
	Для Каждого СтрокаОснования Из ДокументыОснования Цикл
		мДокументыОснования.Добавить(СтрокаОснования.ДокументОснование);	
	КонецЦикла;
	ПараметрыФормы.Вставить("ДокументыОснования", мДокументыОснования);
	ПараметрыФормы.Вставить("Период", Новый СтандартныйПериод(рл_ДатаДок, ТекущаяДата()));
	ПараметрыФормы.Вставить("РежимПодбораИзЭПЭ", Истина);
	
	ДополнительныеПараметры = Новый Структура;

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеПодбораДокументовОснования", ЭтаФорма, ДополнительныеПараметры);
  	_КлиентскиеВызовы.ОткрытьФормуПодбораДокументов(ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеПодбораДокументовОснования(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия <> Неопределено 
		И РезультатЗакрытия.ДокументыОснования.Количество() > 0 Тогда
		
		ПерезаполнитьШапку = Ложь;
		
		ДокументыОснования.Очистить();
		Если РезультатЗакрытия.ДокументыОснования.Найти(ОсновнойДокумент) = Неопределено Тогда
			ОсновнойДокумент = РезультатЗакрытия.ДокументыОснования[0];
			ПерезаполнитьШапку = Истина;
		КонецЕсли;
		
		Для Каждого ВыбранныйДокумент Из РезультатЗакрытия.ДокументыОснования Цикл	
			НоваяСтрока = ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование = ВыбранныйДокумент;
			Если НоваяСтрока.ДокументОснование = ОсновнойДокумент Тогда
				НоваяСтрока.ГлавныйДокумент = Истина;	
			КонецЕсли;
		КонецЦикла;
		
		ПерезаполнитьОпГруз = Истина;
		ЗаполнитьДанныеФормы(ПерезаполнитьШапку, ПерезаполнитьОпГруз);
        ПроверитьЭПЭ();
		Модифицированность = Истина;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДокументОсновным(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.ДокументыОснования.ТекущаяСтрока);

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ОтветУстановитьДокументОсновным", ЭтаФорма, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Установить документ основным?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ОтветУстановитьДокументОсновным(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> Неопределено Тогда
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Поиск = Новый Структура("ГлавныйДокумент", Истина);
			НашлиСтроки = ДокументыОснования.НайтиСтроки(Поиск);
			Для Каждого НашлиСтроку Из НашлиСтроки Цикл
				НашлиСтроку.ГлавныйДокумент = Ложь;
			КонецЦикла;
			ТекущиеДанные = ДокументыОснования.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
			ТекущиеДанные.ГлавныйДокумент = Истина;
			ОсновнойДокумент = ТекущиеДанные.ДокументОснование;
			ДокументыОснования.Сортировать("ГлавныйДокумент Убыв");
			Модифицированность = Истина;
		КонецЕсли;    
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	//Только если не отправлен!
	
	Если ТипЗнч(СтрокаСписка) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(СтрокаСписка.LetterId) Тогда
			ПоказатьПредупреждение(Неопределено, "Нельзя удалять отправленный документ");
		Иначе
			Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ОтветНаВопросУдаления", ЭтаФорма);
			ПоказатьВопрос(Оповещение, "Вы действительно хотите удалить данные по поручению экспедитору?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ОтветНаВопросУдаления(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса <> Неопределено Тогда
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			УдалитьНаСервере();
			СтрокаСписка = Истина; // Обновить весь список
			ЭтаФорма.Закрыть(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьЭПЭ(Команда)
	
	ПредставлениеОшибокВМассивеДо = Метрики_ПредставлениеОшибокВМассиве();
	КоличествоОшибокДо = ФорматированиеЧислаСтрокой(ПредставлениеОшибокВМассивеДо.Количество());
	
	ПроверитьЭПЭ();
	
	ПредставлениеОшибокВМассивеПосле = Метрики_ПредставлениеОшибокВМассиве();
	КоличествоОшибокПосле = ФорматированиеЧислаСтрокой(ПредставлениеОшибокВМассивеПосле.Количество());
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПроверитьНаНаличиеОшибок;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючИдентификатораПеревозочногоДокумента(),
		Строка(ИдентификаторПЭ));
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючКоличествоОшибокДо(), КоличествоОшибокДо);
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючКоличествоОшибокПосле(), КоличествоОшибокПосле);
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючОшибкиПосле(), ПредставлениеОшибокВМассивеПосле);
		
	Метрика_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);
	
КонецПроцедуры

&НаКлиенте
Функция ФорматированиеЧислаСтрокой(ВходящееЧисло)
	Возврат Формат(ВходящееЧисло, "ЧН=; ЧГ=");
КонецФункции

&НаКлиенте
Процедура СохранитьДокументНаДиск(Команда)
	
	ДокументОтправлен = ДокументОтправлен();
	Если ДокументОтправлен Тогда
		Пакет = ПодготовитьПакетНаСервере();
		ВОтправленномПакетеЕстьДокумент = Пакет.Документы.Количество() > 0;
	Иначе
		ВОтправленномПакетеЕстьДокумент = Ложь;
	КонецЕсли;
	
	ДокументПакета = Неопределено;
	
	Если ВОтправленномПакетеЕстьДокумент Тогда
		
		ДокументПакета = Пакет.Документы[0];
		
		ИмяФайла = ДокументПакета.Документооборот.ХранилищеКонтента.ИмяФайла;
		ДанныеДокумента = ДокументПакета.Документооборот.ХранилищеКонтента.Данные;
		
	Иначе
		
		ЭПДСтрокой = ПодготовитьЭПЭ();
		
		ИдФайлСтрокой = СтрПолучитьСтроку(ЭПДСтрокой, 2);
		ИдФайлСтроками = СтрЗаменить(ИдФайлСтрокой, """", Символы.ПС);
		
		ИмяФайла = СтрПолучитьСтроку(ИдФайлСтроками, 2) + ".xml";
		ДанныеДокумента = ЭПДСтрокой;
		
	КонецЕсли;

	ПараметрыКоманды = _Платформа.ПараметрыКомандыСохранитьДокументНаДиск(ИмяФайла, ДанныеДокумента);
	ПараметрыКоманды.КатегорияМетрики = _КлиентскиеВызовы.Метрика_НазваниеКатегории().Перевозочные;
	ПараметрыКоманды.НазваниеФормыДляМетрики = Метрика_НаименованиеФормы();
	ПараметрыКоманды.ПредставлениеМетрики = Метрика_ПредставленияМетрик().ИсходящийПакет;
	ПараметрыКоманды.ДокументДляМетрики = ДокументПакета;
	ПараметрыКоманды.ТипКодировки = "utf-8";
	
	_Платформа.СохранитьДокументНаДиск(ПараметрыКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПечатнуюФорму(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеФормы = Метрика_НаименованиеФормы();
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПолучитьПечатнуюФорму;
	ПредставлениеМетрики = Метрика_ПредставленияМетрик().Исходящийпакет;
	
	_КлиентскиеВызовы.Метрика_ДобавитьПоведение_НажатиеКнопки(НаименованиеФормы, ДействиеМетрики, ПредставлениеМетрики);
	
	Документ = Пакет.Документы[0];
	
	ДокументОтправлен = ДокументОтправлен();
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("BoxID", Документ.Идентификаторы.BoxId);
	ДопПеременные.Вставить("DocumentType", Документ.Тип.ТипДокумента);
	
	Если ДокументОтправлен Тогда
		ДопПеременные.Вставить("LetterId", Документ.Идентификаторы.LetterId);
		ДопПеременные.Вставить("DocumentId", Документ.Идентификаторы.DocumentId);
		ДопПеременные.Вставить("Status", Документ.Статусы.Статус);
	Иначе
		ДопПеременные.Вставить("Status", Перечисление_ЛокальныеСтатусыДокумента().Подготовлен);
	КонецЕсли;
	
	КатегорияМетрики = _КлиентскиеВызовы.Метрика_НазваниеКатегории().Перевозочные;
	
	_Платформа.ПолучитьПечатнуюФормуСервераДиадок(Документ, ДопПеременные, КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДокументооборот(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Пакет.Документы[0];
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("BoxID", Документ.Идентификаторы.BoxId);
	ДопПеременные.Вставить("LetterId", Документ.Идентификаторы.LetterId);
	ДопПеременные.Вставить("DocumentId", Документ.Идентификаторы.DocumentId);
	ДопПеременные.Вставить("Status", Документ.Статусы.Статус);
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().СохранитьДокументооборот;
	Метрика_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);
	
	_Платформа.СохранитьДокументооборот(Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВДиадок(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПерейтиВДиадок;
	Метрика_ПриВыполненииДействия(ДействиеМетрики);
	
	_Платформа.ПерейтиВДиадок(Пакет.Документы[0]);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереотправитьИсходящий(Команда)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().Переотправить;
	Метрика_ПриВыполненииДействия(ДействиеМетрики);
	
	РежимПереотправки = Истина;
	ЗапретРедактирования = Ложь;
	
	СтрокаСписка.Статус = "";
	
	ПодготовитьЭПЭ();
	НастроитьВидимостьКомандФормы();
	ДоступностьФормы();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТипКонтента_ЭПЭ()
	Возврат "kl_porek_wt3_05_02_01";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидТитула_ЭПЭ()
	Возврат "LogisticsForwardingOrder";
КонецФункции

&НаКлиенте
Процедура НастроитьПараметрыПодписания(Команда)
	
	BoxId = ПолучитьBoxIdНаСервере();
	
	Если ЗначениеЗаполнено(BoxId) Тогда
		
		Модуль_Платформа = Модуль_Платформа();
		ПараметрыОткрытия = Модуль_Платформа.ПараметрыФормыРедактированияПолномочий();
		
		ПараметрыОткрытия.АдресЯщика = BoxId;
		ПараметрыОткрытия.ТипКонтента = ТипКонтента_ЭПЭ();
		ПараметрыОткрытия.ПокупательПродавец = "Продавец";
		ПараметрыОткрытия.ВидТитула = ВидТитула_ЭПЭ();
		
		Модуль_Платформа.ОткрытьФормуДиадокМодальноЛок(
			"РедактированиеПолномочийУправляемая",
			ЭтаФорма,
			ПараметрыОткрытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)
	
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеОтветаПерезаполнения", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Документ поручение экспедитору будет перезаполнен. Продолжить?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеОтветаПерезаполнения(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПерезаполнитьШапку = Истина;
		ПерезаполнитьОпГруз = Истина;
		ЗаполнитьДанныеФормы(ПерезаполнитьШапку, ПерезаполнитьОпГруз);
		ПроверитьЭПЭ();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

#Область ИнфраструктураМодуля

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		Модуль_Ядро = Модуль_Ядро();
		_ОбработкаОбъект.ИнициализироватьМодуль(Модуль_Ядро); 
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция Модуль_Платформа() Экспорт
	Возврат _Платформа;
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Возврат _КлиентскиеВызовы.Модуль_ЯдроНаКлиенте();
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьФорму(ФормаКлиентскиеВызовы, Модуль_Платформа) Экспорт
	
	_КлиентскиеВызовы = ФормаКлиентскиеВызовы;
	_Платформа = Модуль_Платформа;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьДокументыОснованияИОсновной(Параметры)
	
	МодульОбъекта = ОбработкаОбъект();
	
	Если Метаданные.Документы.Найти("РеализацияТоваровУслуг") <> Неопределено Тогда
		ОсновнойДокумент = Документы["РеализацияТоваровУслуг"].ПустаяСсылка();
	ИначеЕсли Метаданные.Документы.Найти("РасходнаяНакладная") <> Неопределено Тогда	
		ОсновнойДокумент = Документы["РасходнаяНакладная"].ПустаяСсылка();
	КонецЕсли;
	
	_ДокументыОснования = Новый Массив;
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		
		ОсновнойДокумент = Параметры.ДокументОснование;
		_ДокументыОснования.Добавить(ОсновнойДокумент);
		
	ИначеЕсли Параметры.Свойство("ДокументыОснования")
		И Параметры.ДокументыОснования.Количество() > 0 Тогда
		
		Если ТипЗнч(Параметры.ДокументыОснования[0]) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
			
			ИдентификаторПЭ = Параметры.ДокументыОснования[0];
			_ДокументыОснования = МодульОбъекта.ДокументыОснования(МодульОбъекта.КлючИдентификатораПЭ(), ИдентификаторПЭ);
			ОсновнойДокумент = _ДокументыОснования[0];       
			
		Иначе
			_ДокументыОснования = Параметры.ДокументыОснования;
			ОсновнойДокумент = _ДокументыОснования[0];       
		КонецЕсли;
		
	Иначе
		
		_ДокументыОснования.Добавить(ОсновнойДокумент);

	КонецЕсли;  
	
	Возврат _ДокументыОснования;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовок()
	ЭтаФорма.Заголовок = "Диадок: Поручение экспедитору";
КонецПроцедуры

&НаСервере
Процедура ОпределитьЗапретРедактирования()
	
	Если ТипЗнч(СтрокаСписка) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(СтрокаСписка.LetterId) Тогда
			ЗапретРедактирования = Истина;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДоступностьФормы()
	
	Элементы.ГруппаНомерДата.ТолькоПросмотр = ЗапретРедактирования;
	Элементы.ГруппаСтраницы.ТолькоПросмотр = ЗапретРедактирования;
	Элементы.ФормаСохранить.Доступность = Не ЗапретРедактирования; 
	
	Элементы.ДокументыОснованияПодборДокументовОснования.Доступность = Не ЗапретРедактирования;
	Элементы.ДокументыОснованияУстановитьДокументОсновным.Доступность = Не ЗапретРедактирования;
	Элементы.УстановитьДатуВремяОтгрузкиТекущим.Доступность = Не ЗапретРедактирования;
	Элементы.УстановитьДатуВремяДоставкиТекущим.Доступность = Не ЗапретРедактирования;

КонецПроцедуры

&НаСервере
Функция Модуль_Ядро() Экспорт
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		АдресОбработкиЯдра = СвойствоСтруктуры(ОбщийКонтекстКлиентСервер, "АдресОбработкиЯдра");
		
		Если ЗначениеЗаполнено(АдресОбработкиЯдра) Тогда
			_МодульЯдроНаСервере = ХранилищеОбработки_Прочитать(АдресОбработкиЯдра);
		КонецЕсли;
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

// Возвращает объект обработки из временного хранилища
//
// Параметры:
//  АдресОбработки - Строка - адрес обработки во временном хранилище
// 
// Возвращаемое значение:
//  ОбработкаОбъект - если обект обработки все еще загружен в память
//  Неопределено    - если объект обработки уже уничтожен
//
&НаСервереБезКонтекста
Функция ХранилищеОбработки_Прочитать(АдресОбработки)
	
	СтруктураОбработки = ПолучитьИзВременногоХранилища(АдресОбработки);
	
	Результат = СвойствоСтруктуры(СтруктураОбработки, "ОбработкаОбъект");
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
// 
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Имя ключа структуры,
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в структуре нет указанного свойства.
// 
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
&НаСервереБезКонтекста
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем Значение;
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ЭтоСтруктура(Структура) И ЗначениеЗаполнено(Ключ) Тогда
		
		Если Структура.Свойство(Ключ, Значение) Тогда
			Результат = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение структурой или фиксированной структурой.
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить.
// 
// Возвращаемое значение:
//   Булево - Истина, если переданое значение является структрой или фиксированной структурой.
//
&НаСервереБезКонтекста
Функция ЭтоСтруктура(Значение)
	
	Результат = Ложь;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура")
		Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область РаботаСКонтрагентами

&НаКлиенте
Процедура ОсновнойДокументПриИзменении(Элемент)
	
	_ДокументыОснования = Новый Массив;
	_ДокументыОснования.Добавить(ОсновнойДокумент);
	
	ЗаполнитьДокументыОснования(_ДокументыОснования);
	ЗаполнитьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьСопоставитьКонтрагента(ИмяРеквизита)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().НеСопоставленУчастник;
	Представление = "Контрагент не сопоставлен";
	_КлиентскиеВызовы.Метрика_ДобавитьСтатистику_ПоКонтексту(ДействиеМетрики, , Представление);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", ИмяРеквизита);
	
	ОписаниеЗакрытияФормы = _Платформа.НовыйОписаниеОповещения("ОбработатьРезультатПредложенияСопоставленияКонтрагента", ЭтаФорма, ДополнительныеПараметры);
	
	ТипУчастникаБезСопоставления = СокрЛП(ТипЗнч(ЭтаФорма[ИмяРеквизита]));
	
	_КлиентскиеВызовы.ОткрытьПредложениеСопоставления(ОписаниеЗакрытияФормы, ТипУчастникаБезСопоставления);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПредложенияСопоставленияКонтрагента(РезультатПредложения, ДополнительныеПараметры) Экспорт
	
	Если РезультатПредложения = КодВозвратаДиалога.Да Тогда
		
		НачатьСопоставление(ДополнительныеПараметры.ИмяРеквизита);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСопоставление(ИмяРеквизита)
	
	ОписаниеЗакрытияФормы = _Платформа.НовыйОписаниеОповещения("ОбработатьРезультатСопоставленияКонтрагента", ЭтаФорма);
	ОтборПоКонтрагенту = ЭтаФорма[ИмяРеквизита];
	
	НужноСопоставлениеСОрганизациейДиадок = НужноСопоставлениеСОрганизациейДиадок(ИмяРеквизита);
	Если НужноСопоставлениеСОрганизациейДиадок Тогда
		
		_КлиентскиеВызовы.НачатьСопоставлениеСОрганизациейДиадок(ОтборПоКонтрагенту, ОписаниеЗакрытияФормы);
		
	Иначе
		
		ОтборПоОрганизации = ЭтаФорма["рл_Организация"];
		
		Если ЗначениеЗаполнено(ОтборПоКонтрагенту) И ЗначениеЗаполнено(ОтборПоОрганизации) Тогда
			_КлиентскиеВызовы.ОткрытьСопоставление(ОтборПоОрганизации, ОтборПоКонтрагенту, ОписаниеЗакрытияФормы);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатСопоставленияКонтрагента(РезультатСопоставления, ДополнительныеПараметры) Экспорт
	
	Если РезультатСопоставления = КодВозвратаДиалога.Да Тогда
		ПроверитьЭПЭ();			
	Иначе
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьИдентификаторыЭДО(ЗначениеРеквизита, ЭтоОрганизация) 
	
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		МодульОбъекта = ОбработкаОбъект();
		
		ИдентификаторыЭДО = МодульОбъекта.ИдентификаторыЭДО(ЗначениеРеквизита, ЭтоОрганизация);
		ID = ИдентификаторыЭДО.ID;
		Если ЗначениеЗаполнено(ID) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

&НаКлиенте
Функция НужноСопоставлениеСОрганизациейДиадок(ИмяСопоставляемогоРеквизита)
	
	ИмяРеквизита = "рл_СвКлнт";
	
	Возврат ИмяСопоставляемогоРеквизита = ИмяРеквизита;
	
КонецФункции

#КонецОбласти


#Область ДанныеФормыИСохранение

&НаКлиенте
Процедура СохранитьЧерновик()
	
	СохранитьНаСервере();
	ПодготовитьЭПЭ();
	СохранитьСтатусНаСервере();
	ПодготовитьСтрокуСпискаПоДаннымЧерновика();
	НастроитьВидимостьКомандФормы();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	Модифицированность = Ложь;
	
	МодульОбъекта = ОбработкаОбъект();
	
	ЗначенияРеквизитовПЭ = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма, "ФормаПЭ");
	_ДокументыОснования = ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	ПараметрыПЭ = МодульОбъекта.ПараметрыПЭ(ОсновнойДокумент, _ДокументыОснования, ЗначенияРеквизитовПЭ);
 	МодульОбъекта.СохранитьЗначенияЭПД(МодульОбъекта.КлючИдентификатораПЭ(), ИдентификаторПЭ, МодульОбъекта.КлючРеквизитовПЭ(), ЗначенияРеквизитовПЭ, ПараметрыПЭ);

КонецПроцедуры

&НаСервере
Процедура СохранитьСтатусНаСервере()
	
	МодульОбъекта = ОбработкаОбъект();

	// ошибки заполняются в процессе сохранения, статус необходимо записать после сохранения и проверок.
	ЕстьОшибки = ?(Ошибки.Количество() = 0, Ложь, Истина);
	Статус = МодульОбъекта.ОпределитьСтатусПЭ(ЕстьОшибки);
	МодульОбъекта.СохранитьСтатусПЭ(ИдентификаторПЭ, Статус);

КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере()
	
	Если ЗначениеЗаполнено(ИдентификаторПЭ) Тогда
		
		МодульОбъекта = ОбработкаОбъект();
		МодульОбъекта.Удалить(МодульОбъекта.КлючИдентификатораПЭ(), ИдентификаторПЭ);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыОснования(_ДокументыОснования)
	
	МодульОбъекта = ОбработкаОбъект();
	
	мДокументыОснования = Новый Массив;
	
	Для Каждого ДокументОснование Из _ДокументыОснования Цикл
		
		ИдентификаторПЭ = МодульОбъекта.ИдентификаторПЭ(ДокументОснование, Истина);
		Если ИдентификаторПЭ = Неопределено Тогда
			ОснованияПоИдентификаторуПЭ = Новый Массив;
		Иначе
			ОснованияПоИдентификаторуПЭ = МодульОбъекта.ДокументыОснования(МодульОбъекта.КлючИдентификатораПЭ(), ИдентификаторПЭ);
		КонецЕсли;
		
		Если ОснованияПоИдентификаторуПЭ.Количество() = 0 Тогда
			ОснованияПоИдентификаторуПЭ.Добавить(ДокументОснование);
		КонецЕсли;
		
		Для Каждого ОснованиеПоИдентификаторуПЭ Из ОснованияПоИдентификаторуПЭ Цикл
			Если мДокументыОснования.Найти(ОснованиеПоИдентификаторуПЭ) = Неопределено Тогда
				мДокументыОснования.Добавить(ОснованиеПоИдентификаторуПЭ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ДокументыОснования.Очистить();
	Для Каждого ДокументОснование Из мДокументыОснования Цикл
		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ДокументОснование;
		Если ДокументОснование = ОсновнойДокумент Тогда
			НоваяСтрока.ГлавныйДокумент = Истина;	
		КонецЕсли;
	КонецЦикла; 
	ДокументыОснования.Сортировать("ГлавныйДокумент Убыв");
	
	Если ИдентификаторПЭ = Неопределено И ДокументыОснования.Количество() > 0  Тогда
		ИдентификаторПЭ = МодульОбъекта.ИдентификаторПЭ(ДокументыОснования[0].ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы(ПерезаполнитьШапку = Ложь, ПерезаполнитьОпГруз = Ложь)
	
	МодульОбъекта = ОбработкаОбъект();	
	
	мДокументыОснования = ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	
	ДанныеПЭ = МодульОбъекта.ДанныеПЭ(ИдентификаторПЭ, мДокументыОснования, ПерезаполнитьШапку, ПерезаполнитьОпГруз);

	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеПЭ, ЭтаФорма); 

	УстановитьСписокВыбораАдрПунктНазн(ДанныеПЭ);
	УстановитьСписокВыбораАдрГруз(ДанныеПЭ);
	
КонецПроцедуры

&НаСервере
Функция ЭтоНовыйДокументПЭ()

	Если Не ЭтоСтруктура(СтрокаСписка) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Не ЗначениеЗаполнено(СвойствоСтруктуры(СтрокаСписка, "Ключ"));

КонецФункции

&НаСервере
Функция ЗначениеПредставлениеПоСтрокеXML(РезультатЗакрытия)
	
	МодульОбъекта = ОбработкаОбъект();
	Возврат МодульОбъекта.ЗначениеПредставлениеПоСтрокеXML(РезультатЗакрытия);
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыВыбораДоговора(Владелец, РеквизитДоговор)
	
	МодульОбъекта = ОбработкаОбъект();
	ИмяСправочника = МодульОбъекта.ИмяСправочникаДоговорыКонтрагентов();
	Если Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено Тогда
		// проверим наличие владельца
		Если Метаданные.Справочники[ИмяСправочника].Владельцы.Количество() > 0 Тогда
			ПараметрыВыбора = Новый Массив;
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Владелец));
			ЭтаФорма.Элементы[РеквизитДоговор].ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		// проверим наличие контрагента
		ИначеЕсли Метаданные.Справочники[ИмяСправочника].Реквизиты.Найти("Контрагент") <> Неопределено Тогда
			ПараметрыВыбора = Новый Массив;
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", Владелец));
			ЭтаФорма.Элементы[РеквизитДоговор].ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере                
Процедура УстановитьСписокВыбораАдрПунктНазн(ДанныеПЭ = Неопределено)
	
	МодульОбъекта = ОбработкаОбъект();

	Адреса = Новый Массив;
	АдресаПоПредставлению = Новый Массив; // для проверки дублей
	
	Если рл_СвГруз_АдрПунктНазн_МестоВыд = 2 Тогда
		Грузополучатель = ЭтаФорма.рл_СвЭксп;
	Иначе
		Грузополучатель = ЭтаФорма.рл_СвГруз_СвГП;
	КонецЕсли;
               
	ИсточникиАдреса = Новый Массив;
	Если ЗначениеЗаполнено(Грузополучатель) Тогда
		ИсточникиАдреса.Добавить(Грузополучатель);
	КонецЕсли;
	
	Если ЭтаФорма.ОсновнойДокумент <> Неопределено И рл_СвГруз_АдрПунктНазн_МестоВыд = 1 Тогда
		ДанныеСклада = Новый Структура("Склад, СкладПолучатель, СтруктурнаяЕдиницаПолучатель");
		ЗаполнитьЗначенияСвойств(ДанныеСклада, ЭтаФорма.ОсновнойДокумент);
		Если ЗначениеЗаполнено(ДанныеСклада.Склад) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.Склад);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СкладПолучатель) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СкладПолучатель);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СтруктурнаяЕдиницаПолучатель) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СтруктурнаяЕдиницаПолучатель);
		КонецЕсли;
	КонецЕсли;
	
	
	Для Каждого Источник Из ИсточникиАдреса Цикл
		
		Поиск = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
		КонтактнаяИнформация = МодульОбъекта.ДанныеКонтактнаяИнформацияАдреса(Источник);
		Для Каждого СтрокаАдреса Из КонтактнаяИнформация Цикл
			Адрес = СтрокаАдреса.Адрес;
			Если АдресаПоПредставлению.Найти(Адрес) = Неопределено Тогда
				ЗначениеАдреса = СтрокаАдреса.АдресРФ;
				ПредставлениеАдреса = СтрокаАдреса.Адрес;
				Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, ЗначениеАдреса, ПредставлениеАдреса));	
				АдресаПоПредставлению.Добавить(Адрес)
			КонецЕсли; 
		КонецЦикла;
			
	КонецЦикла;

	Если ЭтаФорма.ОсновнойДокумент <> Неопределено Тогда
		
		МетаданныеДокумента = ЭтаФорма.ОсновнойДокумент.Метаданные();
				
		Если МодульОбъекта.ЕстьРеквизитМетаданных(МетаданныеДокумента, "АдресДоставкиЗначение") 
			И МодульОбъекта.ЕстьРеквизитМетаданных(МетаданныеДокумента, "АдресДоставки") Тогда
			Адрес = ЭтаФорма.ОсновнойДокумент.АдресДоставки;
			Если АдресаПоПредставлению.Найти(Адрес) = Неопределено Тогда
				ЗначениеАдреса = ЭтаФорма.ОсновнойДокумент.АдресДоставкиЗначение;
				ПредставлениеАдреса = ЭтаФорма.ОсновнойДокумент.АдресДоставки;
				Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, ЗначениеАдреса, ПредставлениеАдреса));		
				АдресаПоПредставлению.Добавить(Адрес)
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	СписокВыбораАдреса = Элементы.рл_СвГруз_АдрПунктНазн_АдрВыдГруз_Адрес_АдрИнф_АдрТекст.СписокВыбора;
	СписокВыбораАдреса.Очистить();
	Для Каждого СтруктураАдреса Из Адреса Цикл
		СписокВыбораАдреса.Добавить(СтруктураАдреса.Адрес, СтруктураАдреса.ПредставлениеАдреса);
	КонецЦикла;
	
	Если МодульОбъекта.ЕстьИЗаполненоСвойствоСтруктуры(ДанныеПЭ, "СвГруз.АдрПунктНазн.АдрВыдГруз.Адрес.АдрИнф.АдрТекст") Тогда
		Адрес = ДанныеПЭ.СвГруз.АдрПунктНазн.АдрВыдГруз.Адрес.АдрИнф.АдрТекст;
		АдресРФ = ДанныеПЭ.СвГруз.АдрПунктНазн.АдрВыдГруз.Адрес.АдрРФ;
		Если ЗначениеЗаполнено(Адрес) Тогда
			Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, АдресРФ, Адрес));
			НайденныйАдрес = СписокВыбораАдреса.НайтиПоЗначению(Адрес);
			Если НайденныйАдрес = Неопределено Тогда
				СписокВыбораАдреса.Добавить(Адрес, Адрес);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ХранениеАдресаДоставки = ПоместитьВоВременноеХранилище(Адреса, УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораАдрГруз(ДанныеПЭ = Неопределено)
	
	МодульОбъекта = ОбработкаОбъект();

	Адреса = Новый Массив;
	АдресаПоПредставлению = Новый Массив; // для проверки дублей
	
	Если рл_СвГруз_АдрГруз_МестоПрием = 2 Тогда
		Грузоотправитель = ЭтаФорма.рл_СвЭксп;
	Иначе
		Грузоотправитель = ЭтаФорма.рл_СвГруз_СвГО;
	КонецЕсли;

	ИсточникиАдреса = Новый Массив;
	Если ЗначениеЗаполнено(Грузоотправитель) Тогда
		ИсточникиАдреса.Добавить(Грузоотправитель);
	КонецЕсли;
	
	Если ЭтаФорма.ОсновнойДокумент <> Неопределено И рл_СвГруз_АдрГруз_МестоПрием = 1 Тогда
		ДанныеСклада = Новый Структура("Склад, СкладОтправитель, СтруктурнаяЕдиница, СкладКомпании");
		ЗаполнитьЗначенияСвойств(ДанныеСклада, ЭтаФорма.ОсновнойДокумент);
		Если ЗначениеЗаполнено(ДанныеСклада.Склад) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.Склад);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СкладОтправитель) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СкладОтправитель);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СтруктурнаяЕдиница) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СтруктурнаяЕдиница);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СкладКомпании) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СкладКомпании);
		КонецЕсли;
	КонецЕсли;

	Для Каждого Источник Из ИсточникиАдреса Цикл
		
		Поиск = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
		КонтактнаяИнформация = МодульОбъекта.ДанныеКонтактнаяИнформацияАдреса(Источник);
		Для Каждого СтрокаАдреса Из КонтактнаяИнформация Цикл
			Адрес = СтрокаАдреса.Адрес;
			Если АдресаПоПредставлению.Найти(Адрес) = Неопределено Тогда
				ЗначениеАдреса = СтрокаАдреса.АдресРФ;
				ПредставлениеАдреса = СтрокаАдреса.Адрес;
				Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, ЗначениеАдреса, ПредставлениеАдреса));	
				АдресаПоПредставлению.Добавить(Адрес)
			КонецЕсли; 
		КонецЦикла;
			
	КонецЦикла;
	
	СписокВыбораАдреса = Элементы.рл_СвГруз_АдрГруз_АдрПриемГруз_Адрес_АдрИнф_АдрТекст.СписокВыбора;
	СписокВыбораАдреса.Очистить();
	Для Каждого СтруктураАдреса Из Адреса Цикл
		СписокВыбораАдреса.Добавить(СтруктураАдреса.Адрес, СтруктураАдреса.ПредставлениеАдреса);
	КонецЦикла;
	
	Если МодульОбъекта.ЕстьИЗаполненоСвойствоСтруктуры(ДанныеПЭ, "СвГруз.АдрГруз.АдрПриемГруз.Адрес.АдрИнф.АдрТекст") Тогда
		Адрес = ДанныеПЭ.СвГруз.АдрГруз.АдрПриемГруз.Адрес.АдрИнф.АдрТекст;
		АдресРФ = ДанныеПЭ.СвГруз.АдрГруз.АдрПриемГруз.Адрес.АдрРФ;
		Если ЗначениеЗаполнено(Адрес) Тогда
			Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, АдресРФ, Адрес));
			НайденныйАдрес = СписокВыбораАдреса.НайтиПоЗначению(Адрес);
			Если НайденныйАдрес = Неопределено Тогда
				СписокВыбораАдреса.Добавить(Адрес, Адрес);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ХранениеАдресаПогрузки = ПоместитьВоВременноеХранилище(Адреса, УникальныйИдентификатор);

КонецПроцедуры


#КонецОбласти


#Область ПроверкаИСтатусы

&НаСервере
Функция ПодготовитьЭПЭ(УчитыватьОшибки = Истина)
	
	МодульОбъекта = ОбработкаОбъект();
	Формат = "__kl_porek_wt3_05_02_01";
	ПараметрыПЭ = Новый Структура;
	ПараметрыПЭ.Вставить("ДанныеСотрудника", Новый Структура);

	мДокументыОснования = МодульОбъекта.ДокументыОснования(МодульОбъекта.КлючИдентификатораПЭ(), ИдентификаторПЭ);
	Если мДокументыОснования.Найти(ОсновнойДокумент) = Неопределено
		И ЗначениеЗаполнено(ОсновнойДокумент) Тогда
		мДокументыОснования.Добавить(ОсновнойДокумент);
	КонецЕсли;
	СообщениеПЭ = МодульОбъекта.ПодготовитьСообщениеПЭ(Формат, ИдентификаторПЭ, мДокументыОснования, ПараметрыПЭ);

	ЕстьОшибки = ОбработатьОшибки(МодульОбъекта, СообщениеПЭ);
	Если ЕстьОшибки И УчитыватьОшибки Тогда
		Результат = Неопределено;
	Иначе
		Кодировка = "utf-8";
		Результат = МодульОбъекта.СобратьXmlПоДокументу(СообщениеПЭ, Формат, ПараметрыПЭ, Кодировка);
	КонецЕсли;

	ОпределитьСтатусДокумента(ЕстьОшибки);	

	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОпределитьСтатусДокумента(ЕстьОшибки)

	МодульОбъекта = ОбработкаОбъект();

	СтатусЛокальный = МодульОбъекта.ОпределитьСтатусПЭ(ЕстьОшибки);
	СтатусДокумента = МодульОбъекта.СтрШаблонЛок("(%1)", СтатусЛокальный);
	
	СтатусыДоОтправки = МодульОбъекта.СтатусыДоОтправки();
	Если ТипЗнч(СтрокаСписка) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(СтрокаСписка.Статус) 
			И СтатусыДоОтправки.Найти(СтрокаСписка.Статус) = Неопределено Тогда
			СтатусДокумента = МодульОбъекта.СтрШаблонЛок("(%1 %2)", СтрокаСписка.Статус, СтрокаСписка.ДополнительныйСтатус);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьЭПЭ()
	
	МодульОбъекта = ОбработкаОбъект();
	
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма, "ФормаПЭ");
	СообщениеПЭ = Новый Структура;
	МодульОбъекта.ЗаменитьСсылкиНаСтруктуры(СообщениеПЭ, ЗначенияДополнительныхСвойств);

	ЕстьОшибки = ОбработатьОшибки(МодульОбъекта, СообщениеПЭ);
	
	ОпределитьСтатусДокумента(ЕстьОшибки);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьОшибки(МодульОбъекта, СообщениеПЭ)
	     
	НезаполненныеРеквизиты = Новый Массив;
	ПараметрыВалидации = МодульОбъекта.ВсеПараметрыВалидацииПЭ();
	МодульОбъекта.ПроверитьОбязательныеПоля(СообщениеПЭ, СообщениеПЭ, ПараметрыВалидации, НезаполненныеРеквизиты);
	МодульОбъекта.ПроверитьИдентификаторыЭДО(СообщениеПЭ, НезаполненныеРеквизиты, "ФормаПЭ");
	
	Ошибки.Очистить();
	Для Каждого ПараметрыПоля Из НезаполненныеРеквизиты Цикл
		
		СтрокаСОшибкой = "";
		ИдентификаторСтроки = "";
		Если ПараметрыПоля.Свойство("НомерСтрокиОшибки") И ПараметрыПоля.НомерСтрокиОшибки > 0 Тогда
			СтрокаСОшибкой = " строка " + ПараметрыПоля.НомерСтрокиОшибки;
			ИдентификаторСтроки = ЭтаФорма[ПараметрыПоля.ИмяРеквизитаТЧ][ПараметрыПоля.НомерСтрокиОшибки-1].ПолучитьИдентификатор();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыПоля.ИмяФормы) Тогда
			НоваяСтрока = Ошибки.Добавить();
			НоваяСтрока.НазваниеРеквизита = ПараметрыПоля.НазваниеРеквизита;
			Если ПараметрыПоля.Свойство("ТекстОшибки") Тогда
				НоваяСтрока.Представление = ПараметрыПоля.ТекстОшибки;
				НоваяСтрока.НекорректноЗаполнено = Истина;
			Иначе
				НоваяСтрока.Представление = "Указать: " + ПараметрыПоля.Представление + СтрокаСОшибкой;
			КонецЕсли;
			НоваяСтрока.Действие = "Указать";
			НоваяСтрока.ИмяФормы = ПараметрыПоля.ИмяФормы;
			НоваяСтрока.ИмяРеквизитаРодителя = ПараметрыПоля.ИмяРеквизитаРодителя;
			НоваяСтрока.ИмяРеквизитаТЧ = ПараметрыПоля.ИмяРеквизитаТЧ;
			НоваяСтрока.ИндексКартинки = Истина;
			НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
			Если МодульОбъекта.СтрНайтиЛок(ЭтаФорма.ИмяФормы, ПараметрыПоля.ИмяФормы) > 0
				И ПараметрыПоля.ОтметкаНезаполненного Тогда
				Попытка
					Элементы[ПараметрыПоля.НазваниеРеквизита].АвтоОтметкаНезаполненного = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ЕстьОшибки = Ошибки.Количество() > 0;
	Если ЕстьОшибки Тогда
		Элементы.ГруппаОшибки.Видимость = Истина;
	Иначе
		Элементы.ГруппаОшибки.Видимость = Ложь;
	КонецЕсли; 
	
	Возврат ЕстьОшибки;
	
КонецФункции

#КонецОбласти


#Область ОформлениеИВидимостьФормы

&НаСервере
Процедура ЗаполнитьКолМестПарт()
	
	рл_СвГруз_КолМестПарт = рл_СвГруз_ОпГруз.Итог("КолМестГр");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВесГрузПарт_ВесБрутто()
	
	рл_СвГруз_ВесГрузПарт_ВесБрутто = рл_СвГруз_ОпГруз.Итог("ВесГруз_ВесБрутто");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВесГрузПарт_ВесНетто()
	
	рл_СвГруз_ВесГрузПарт_ВесНетто = рл_СвГруз_ОпГруз.Итог("ВесГруз_ВесНетто");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВесГрузПарт_КолПалл()
	
	рл_СвГруз_ВесГрузПарт_КолПалл = рл_СвГруз_ОпГруз.Итог("ВесГруз_КолПалл");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокГруппыДатыИВремя()
	
	МодульОбъекта = ОбработкаОбъект();
	
	ЧасовойПоясСервера = ЧасовойПоясСеанса();
	ТекущаяДатаСервера = ТекущаяДатаСеанса();
	УниверсальнаяДата = УниверсальноеВремя(ТекущаяДатаСервера, ЧасовойПоясСервера);
	СмещениеОтUTC = СмещениеСтандартногоВремени(ЧасовойПоясСервера, УниверсальнаяДата);
	
	ЗнакСмещенияUTC = ?(СмещениеОтUTC >= 0, "+", "-");
	СмещениеОтUTCВЧасах = СмещениеОтUTC / 3600;
	СтрокаСмещениеUTC = ЗнакСмещенияUTC + Строка(СмещениеОтUTCВЧасах);
	
	СмещениеОтMSKВЧасах = СмещениеОтUTCВЧасах - 3;
	ЗнакСмещенияMSK = ?(СмещениеОтMSKВЧасах >= 0, "+", "-");
	СтрокаСмещениеMSK = ЗнакСмещенияMSK + Строка(СмещениеОтMSKВЧасах);
	
	Элементы.ГруппаДатыИВремя.Заголовок = МодульОбъекта.СтрШаблонЛок("%1 MSK%2 (UTC%3)", Элементы.ГруппаДатыИВремя.Заголовок, СтрокаСмещениеMSK, СтрокаСмещениеUTC);
	Элементы.ГруппаДатаОтгрузки.Заголовок = МодульОбъекта.СтрШаблонЛок("%1 MSK%2 (UTC%3)", Элементы.ГруппаДатаОтгрузки.Заголовок, СтрокаСмещениеMSK, СтрокаСмещениеUTC);
	Элементы.ГруппаДатаДоставки.Заголовок = МодульОбъекта.СтрШаблонЛок("%1 MSK%2 (UTC%3)", Элементы.ГруппаДатаДоставки.Заголовок, СтрокаСмещениеMSK, СтрокаСмещениеUTC);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНаСервере()
	
	УсловноеОформление.Элементы.Очистить();
	
	//главный документ
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокументыОснования.ГлавныйДокумент");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУсловия.Использование = Истина;
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументыОснованияДокументОснование");
	

	// габариты, при условии заполнения вида упаковки

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГруз.ИнфУпГруз_ВидУпак");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловия.Использование = Истина;
 	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГрузИнфУпГруз_ВесУпак");
 	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГрузИнфУпГруз_ГабарУпак_ВысЗнач");
 	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГрузИнфУпГруз_ГабарУпак_ДлЗнач");
 	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГрузИнфУпГруз_ГабарУпак_ШирЗнач");

	// габариты, при условии заполнения вида упаковки

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГруз.ИнфУпГруз_ВидУпак");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловия.Использование = Истина;
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГруз.ИнфУпГруз_ВесУпак");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловия.Использование = Истина;
 	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГрузИнфУпГруз_ВесУпак");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГруз.ИнфУпГруз_ВидУпак");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловия.Использование = Истина;
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГруз.ИнфУпГруз_ГабарУпак_ВысЗнач");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловия.Использование = Истина;
 	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГрузИнфУпГруз_ГабарУпак_ВысЗнач");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГруз.ИнфУпГруз_ВидУпак");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловия.Использование = Истина;
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГруз.ИнфУпГруз_ГабарУпак_ДлЗнач");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловия.Использование = Истина;
 	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГрузИнфУпГруз_ГабарУпак_ДлЗнач");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГруз.ИнфУпГруз_ВидУпак");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловия.Использование = Истина;
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГруз.ИнфУпГруз_ГабарУпак_ШирЗнач");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловия.Использование = Истина;
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("рл_СвГруз_ОпГрузИнфУпГруз_ГабарУпак_ШирЗнач");
	
КонецПроцедуры

#КонецОбласти


#Область СпискиВыбора

&НаСервере
Функция СписокВыбораВидУпак()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияВидТары");
		
	Для НомерСтроки = 3 По Макет.ВысотаТаблицы Цикл  //пропустить "не указан"
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		ПолноеНаименованиеЗначения = СокрЛП(Макет.Область(НомерСтроки, 2).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(ПолноеНаименованиеЗначения, ПолноеНаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораТекстИнфИдентиф()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияТекстИнфИдентиф");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораВидТС()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияВидТС");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораТипКузова()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияТипКузова");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

#КонецОбласти


#Область ПодготовкаПакетаИОтправка

&НаСервере
Функция ОписаниеВидаПакета(ВидПакетаID)
	
	Модуль_Ядро = Модуль_Ядро();
	
	Результат = Модуль_Ядро.Списки_ОписаниеВидаПакета(ВидПакетаID);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Перечисление_ЛокальныеСтатусыДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("Черновик", "Черновик");
	Результат.Вставить("Подготовлен", "Подготовлен");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей()
	
	МодульОбъекта = ОбработкаОбъект();
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма, "ФормаПЭ");
	СообщениеПЭ = Новый Структура;
	МодульОбъекта.ЗаменитьСсылкиНаСтруктуры(СообщениеПЭ, ЗначенияДополнительныхСвойств);
	
	ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Ложь);

	ПараметрыВалидации = МодульОбъекта.ВсеПараметрыВалидацииПЭ();
	ОбязательныеРеквизитыПоФормам = МодульОбъекта.РеквизитыОбязательныхПолейПоФормам(СообщениеПЭ, СообщениеПЭ, ПараметрыВалидации);
	
	ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Истина);

КонецПроцедуры

&НаСервере
Процедура ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Значение)
	
	ОбязательныеРеквизиты = ОбязательныеРеквизитыФормы("ФормаПЭ");
	
	Для Каждого ИмяРеквизита Из ОбязательныеРеквизиты Цикл
		Попытка
			Если ЭтоРеквизитXML(ИмяРеквизита) Тогда
				ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "рл", "пр");
			КонецЕсли;
			Элементы[ИмяРеквизита].АвтоОтметкаНезаполненного = Значение;
			Если Не ЗначениеЗаполнено(ЭтаФорма[ИмяРеквизита]) И Значение = Истина Тогда
				Элементы[ИмяРеквизита].ОтметкаНезаполненного = Истина;
			Иначе 
				Элементы[ИмяРеквизита].ОтметкаНезаполненного = Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НельзяОткрыть(ЗначениеРеквизита, ИмяРеквизита)
	
	Если Не ЗначениеЗаполнено(ЗначениеРеквизита)
		И Не ЭтоРеквизитXML(ИмяРеквизита) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ОбязательныеРеквизитыФормы(ИмяФормы)
	
	Результат = Новый Массив;
		
	Если ТипЗнч(ОбязательныеРеквизитыПоФормам) = Тип("Структура")
		И ОбязательныеРеквизитыПоФормам.Свойство(ИмяФормы) Тогда
		Результат = ОбязательныеРеквизитыПоФормам[ИмяФормы];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ПодготовитьПакетНаСервере()
	
	Ядро = Модуль_Ядро();
	Результат = Ядро.Пакеты_ПодготовитьПакет(СтрокаСписка, Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПослеОтправкиПакета(ПакетОтправлен, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ПакетОтправлен Тогда
		
		СтрокаСписка = Истина; // Обновить весь список
		Состояние("Поручение экспедитору подписан и отправлен");
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПодписатьИОтправитьИсходящийДокумент()
	
	МожноПодписатьОтправить = Ошибки.Количество() = 0;
	
	Если МожноПодписатьОтправить Тогда
		
		СохранитьЧерновик();
		
		Пакет = ПодготовитьПакетНаСервере();
		ОповещениеПослеОтправкиПакета = _Платформа.НовыйОписаниеОповещения("ПослеОтправкиПакета", ЭтаФорма);
		
		ПараметрыКоманды = _Платформа.ПараметрыКомандыДействияСПакетом(
			Пакет,
			ОповещениеПослеОтправкиПакета
		);
		
		_Платформа.ПодписатьИОтправитьИсходящийПакет(ПараметрыКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправитьПовторноИсходящийДокумент()
	
	ПроверитьЭПЭ();
	
	МожноПодписатьОтправить = Ошибки.Количество() = 0;
	
	Если МожноПодписатьОтправить Тогда
		
		СохранитьЧерновик();
		
		Пакет = ПодготовитьПереотправляемыйПакетНаСервере();
		ОповещениеПослеОтправкиПакета = _Платформа.НовыйОписаниеОповещения("ПослеОтправкиПакета", ЭтаФорма);
		
		ПараметрыКоманды = _Платформа.ПараметрыКомандыДействияСПакетом(
			Пакет,
			ОповещениеПослеОтправкиПакета
		);
		
		_Платформа.ПодписатьИОтправитьИсходящийПакет(ПараметрыКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПереотправляемыйПакетНаСервере()
	
	ПереотправляемыйПакет = Новый Структура;
	ПереотправляемыйПакет.Вставить("BoxId", СтрокаСписка.BoxId);
	ПереотправляемыйПакет.Вставить("LetterId", СтрокаСписка.LetterId);
	ПереотправляемыйПакет.Вставить("ПакетЭДО", СтрокаСписка.Пакет);
	
	ПодготовитьСтрокуСпискаПоДаннымЧерновика();
	
	СтрокаСписка.Пакет = Неопределено;
	СтрокаСписка.LetterId = "";
	
	Результат = ПодготовитьПакетНаСервере();
	
	ПараметрыПереотправки = Новый Структура;
	ПараметрыПереотправки.Вставить("ПереотправляемыйПакет", ПереотправляемыйПакет);
	ПараметрыПереотправки.Вставить("ВыполнитьУдалениеНеактуальныхДокументовПакета", Ложь);
	
	Результат.СлужебнаяИнформация.Вставить("ПараметрыПереотправки", ПараметрыПереотправки);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьBoxIdНаСервере()
	
	BoxId = "";
	
	МодульОбъекта = ОбработкаОбъект();
	ИдентификаторыКЛНТ = МодульОбъекта.ИдентификаторыЭДО(рл_СвКлнт, Истина);
	BoxId = ИдентификаторыКЛНТ.BoxId;
	
	Возврат BoxId;

КонецФункции

#КонецОбласти

#Область УниверсальныеВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьНачалоВыбораИзСписка(СписокВыбора, Оповещение, ОтображатьПредставление = Истина)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеДляВыбора", СписокВыбора);
	ПараметрыФормы.Вставить("ОтображатьПредставление", ОтображатьПредставление);
	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаВыбораЗначений", ПараметрыФормы, ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвтоПодбор(СписокВыбора, Текст, ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаПоиска = СтрокаПоискаФильтра(Текст, ТекстРедактирования);
	Если СтрокаПоиска = Неопределено Тогда
		ДанныеВыбора = СписокВыбора;//Новый СписокЗначений;
		СтандартнаяОбработка = Ложь;
	Иначе
		ДанныеВыбора = СписокЗначенийНайти(СтрокаПоиска, СписокВыбора); 
		Если ДанныеВыбора.Количество() = 0 Тогда
			СтандартнаяОбработка = Истина;
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СписокЗначенийНайти(СтрокаПоиска, СписокЗначений, РеквизитПоиска = "Представление") Экспорт

	Результат = Новый СписокЗначений;
	Для Каждого Элемент Из СписокЗначений Цикл
		Если Найти(ВРег(Элемент[РеквизитПоиска]), ВРег(СтрокаПоиска)) > 0 Тогда
			Результат.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаКлиенте
Функция СтрокаПоискаФильтра(Текст, ТекстРедактирования) Экспорт

	МинимальноеКоличествоСимволов = 2;
	Если СтрДлина(СокрЛП(Текст)) >= МинимальноеКоличествоСимволов Тогда
		СтрокаПоиска = СокрЛП(Текст);
	ИначеЕсли СтрДлина(СокрЛП(ТекстРедактирования)) >= МинимальноеКоличествоСимволов Тогда
		СтрокаПоиска = СокрЛП(ТекстРедактирования);
	Иначе
		СтрокаПоиска = Неопределено;
	КонецЕсли;

	Возврат СтрокаПоиска;

КонецФункции

&НаКлиенте
Функция СтрНайтиЛок(Строка, ПодстрокаПоиска)
	
	// BSLLS:DeprecatedFind-off
	Результат = Найти(Строка, ПодстрокаПоиска);
	// BSLLS:DeprecatedFind-on
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область XMLВспомогательныеФункции

&НаСервереБезКонтекста
Функция ДесериализоватьXML(СтрокаXML)
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.УстановитьСтроку(СтрокаXML);
		Значение = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Исключение
		Значение = Новый Структура;
	КонецПопытки;
	
	Возврат Значение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитыXML()
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРеквизитXML(ИмяРеквизита)
	
	РеквизитыXML = РеквизитыXML();
	Если РеквизитыXML.Найти(ИмяРеквизита) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция КлючПредставление(Ключ)
	
	Результат = СтрЗаменить(Ключ, "рл_", "пр_");
	Возврат Результат;

КонецФункции

#КонецОбласти

&НаСервере
Процедура ПодготовитьСтрокуСпискаПоДаннымЧерновика()
	
	МодульОбъекта = ОбработкаОбъект();
	
	ЕстьОшибки = Ошибки.Количество() > 0;
	СтатусПЭ = МодульОбъекта.ОпределитьСтатусПЭ(ЕстьОшибки);
	СтатусПодготовлен = Перечисление_ЛокальныеСтатусыДокумента().Подготовлен;
	
	//Если СтатусПЭ <> СтатусПодготовлен Тогда
	//	Возврат;
	//КонецЕсли;
	
	КлючИдентификатораПЭ = МодульОбъекта.КлючИдентификатораПЭ();
	
	ПараметрыПолученияЧерновиковЭПЭ = Новый Структура;
	ПараметрыПолученияЧерновиковЭПЭ.Вставить(КлючИдентификатораПЭ, ИдентификаторПЭ);
	ПараметрыПолученияЧерновиковЭПЭ.Вставить("НачалоПериода", НачалоДня(рл_ДатаДок));
	ПараметрыПолученияЧерновиковЭПЭ.Вставить("КонецПериода", КонецДня(рл_ДатаДок));
	
	ДанныеЧерновиковЭПЭ = МодульОбъекта.ДанныеДляОтправкиТитуловЭПЭ(ПараметрыПолученияЧерновиковЭПЭ);
	
	Если ДанныеЧерновиковЭПЭ[ОсновнойДокумент] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЧерновика = ДанныеЧерновиковЭПЭ[ОсновнойДокумент];
		
	ВидПакетаID = МодульОбъекта.ИдентификаторПакетаЭПЭ();
	ВидПакета = ОписаниеВидаПакета(ВидПакетаID);
	
	ЗаполнитьЗначенияСвойств(СтрокаСписка, ДанныеЧерновика);
	
	СтрокаСписка.Ключ = Строка(ДанныеЧерновика.ИдентификаторДокумента);
	СтрокаСписка.Направление = "Исходящее";
	СтрокаСписка.ВидПакета = ВидПакета.Наименование;
	СтрокаСписка.СодержимоеПакета = ВидПакета.Наименование;
	СтрокаСписка.Организация = ДанныеЧерновика.Грузоотправитель;
	СтрокаСписка.Контрагент = ДанныеЧерновика.Перевозчик;
	СтрокаСписка.ПромежуточныйПолучатель = ДанныеЧерновика.Грузополучатель;
	
	СлужебнаяИнформацияСтроки = СвойствоСтруктуры(СтрокаСписка, "СлужебнаяИнформация", Новый Структура);
	СлужебнаяИнформацияСтроки.Вставить(МодульОбъекта.КлючИдентификаторПеревозочногоДокумента(), Строка(ИдентификаторПЭ));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьКомандФормы()
	
	СтатусПодготовлен = Перечисление_ЛокальныеСтатусыДокумента().Подготовлен;
	СтатусДокументаПодготовлен = Найти(СтатусДокумента, СтатусПодготовлен) > 0;
	ДокументБезОшибок = Ошибки.Количество() = 0;

	Если РежимПереотправки Тогда
		ЭтоНовыйДокумент = Истина;
		ДокументОтправлен = Ложь;
	Иначе
		ЭтоНовыйДокумент = ЭтоНовыйДокументПЭ();
		ДокументОтправлен = ДокументОтправлен();
	КонецЕсли;
	
	ДоступныеДействияПодписатьИОтправить = Ложь;
	ДоступныеДействияНастроитьПараметрыПодписания = Ложь;
	
	Если Не ЭтоНовыйДокумент И ДокументБезОшибок Тогда
		
		Пакет = ПодготовитьПакетНаСервере();
		Документ = Пакет.Документы[0];
		
		Ядро = Модуль_ЯдроНаКлиенте();
		ДоступныеДействия = Ядро.Документы_ДоступныеДействия(Документ);
		
		ДоступныеДействияПодписатьИОтправить = ДоступныеДействия.ПодписатьИОтправить;
		ДоступныеДействияНастроитьПараметрыПодписания = ДоступныеДействия.НастроитьПараметрыПодписания;
		
		Элементы.ПередатьНаСогласование.Видимость = ДоступныеДействия.ПередатьНаСогласование;
		Элементы.ПередатьНаПодпись.Видимость = ДоступныеДействия.ПередатьНаПодпись;
		Элементы.ПередатьПоМаршруту.Видимость = ДоступныеДействия.ПередатьПоМаршруту;
		Элементы.Согласовать.Видимость = ДоступныеДействия.Согласование;
		Элементы.ОтказатьВСогласовании.Видимость = ДоступныеДействия.ОтказВСогласовании;
		Элементы.КнопкаОтказатьВЗапросеПодписи.Видимость = ДоступныеДействия.ОтказВЗапросеПодписи;
		
		Элементы.ГруппаСогласованиеПередать.Видимость = ДоступныеДействия.ПередатьНаСогласование
			Или ДоступныеДействия.ПередатьНаПодпись
			Или ДоступныеДействия.ПередатьПоМаршруту;
		Элементы.ГруппаСогласованиеВердикт.Видимость = ДоступныеДействия.Согласование
			Или ДоступныеДействия.ОтказВСогласовании;
		Элементы.ГруппаСогласование.Видимость = Элементы.ГруппаСогласованиеПередать.Видимость
			Или Элементы.ГруппаСогласованиеВердикт.Видимость;
			
	Иначе
			
		Элементы.ПередатьНаСогласование.Видимость = Ложь;
		Элементы.ПередатьНаПодпись.Видимость = Ложь;
		Элементы.ПередатьПоМаршруту.Видимость = Ложь;
		Элементы.Согласовать.Видимость = Ложь;
		Элементы.ОтказатьВСогласовании.Видимость = Ложь;
		Элементы.КнопкаОтказатьВЗапросеПодписи.Видимость = Ложь;
		
		Элементы.ГруппаСогласованиеПередать.Видимость = Ложь;
		Элементы.ГруппаСогласованиеВердикт.Видимость = Ложь;
		Элементы.ГруппаСогласование.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.ПодписатьИОтправитьИсходящий.Видимость = ДоступныеДействияПодписатьИОтправить Или РежимПереотправки;
	Элементы.НастроитьПараметрыПодписания.Видимость = ДоступныеДействияНастроитьПараметрыПодписания;
	Элементы.СохранитьДокументНаДиск.Видимость = ДокументОтправлен Или ДокументБезОшибок;
	Элементы.ПолучитьПечатнуюФорму.Видимость = ДокументОтправлен Или СтатусДокументаПодготовлен;
	Элементы.СохранитьДокументооборот.Видимость = ДокументОтправлен;
	Элементы.ПерейтиВДиадок.Видимость = ДокументОтправлен;
	Элементы.ПереотправитьИсходящий.Видимость = ДокументОтправлен;
	Элементы.ФормаСохранить.Видимость = Не ДокументОтправлен И Не РежимПереотправки;
	Элементы.Перезаполнить.Видимость = Не ДокументОтправлен;
	Элементы.ПоказатьСодержимоеДокументаXML.Видимость = Не ДокументОтправлен;
	
	Элементы.ПередатьВПодразделение.Видимость = ДокументОтправлен;
	
	Элементы.СтраницаИсторияПоДокументу.Видимость = ДокументОтправлен;
	Если ДокументОтправлен Тогда
		УстановитьВидимостьКартинкаОшибкиИсторияПоДокументу();
	КонецЕсли;
	
	УстановитьДоступностьФункцийТарифа();
	
КонецПроцедуры

&НаКлиенте
Функция ДокументОтправлен()
	
	Если ТипЗнч(СтрокаСписка) = Тип("Структура")
		И ЗначениеЗаполнено(СтрокаСписка.LetterId) Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура рл_СопрДокПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_ИнфПолПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ПриВыполненииДействия(ДействиеМетрики, Доппеременные = Неопределено)
	
	НаименованиеФормы = Метрика_НаименованиеФормы();
	
	ДокументОтправлен = ДокументОтправлен();
	Если РежимПереотправки Тогда
		ДокументОтправлен = Ложь;
	КонецЕсли;
	
	Если ДокументОтправлен Тогда
		ПредставлениеМетрики = Метрика_ПредставленияМетрик().Исходящийпакет;
	Иначе
		ПредставлениеМетрики = Метрика_ПредставленияМетрик().ПакетНаОтправку;
	КонецЕсли;
	
	_КлиентскиеВызовы.Метрика_ДобавитьПоведение_НажатиеКнопки(НаименованиеФормы, ДействиеМетрики, ПредставлениеМетрики);
	_КлиентскиеВызовы.Метрика_ДобавитьСтатистику_ПоКонтексту(ДействиеМетрики, ДопПеременные);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_НаименованиеФормы()
	Возврат "Поручение экспедитору";
КонецФункции

&НаКлиенте
Функция Метрика_ПредставленияМетрик()
	
	Результат = Новый Структура;
	Результат.Вставить("ПакетНаОтправку", "Пакет на отправку ЭПЭ");
	Результат.Вставить("Исходящийпакет", "Исходящий пакет ЭПЭ");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Метрики_ПредставлениеОшибокВМассиве()
	
	Результат = Новый Массив;
	
	ТаблицаОшибок = Ошибки.Выгрузить(, "Представление");
	Результат = ТаблицаОшибок.ВыгрузитьКолонку("Представление");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Элементы.СтраницаИсторияПоДокументу Тогда
		
		ЗаполнитьИсториюПоДокументу();
		
	КонецЕсли;
	
КонецПроцедуры


#Область ИсторияПоДокументу

&НаКлиенте
Процедура ЗаполнитьИсториюПоДокументу()
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Пакет.Документы[0];
	
	ИсторияДокументаHTML = "";
	
	Если ЗначениеЗаполнено(Документ.Идентификаторы.DocumentId) Тогда
		ЗаполнитьИсториюПоДокументуВызовСервера(Документ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсториюПоДокументуВызовСервера(Документ)
	
	Ядро = Модуль_Ядро();
	ВнешниеСтатусы = Документ.Статусы.ВнешниеСтатусы;
	ИдентификаторПеревозочного_kl_id = СвойствоСтруктуры(ВнешниеСтатусы, "kl_id");
	
	ИсторияДО = Ядро.Документы_ИсторияДО(Документ.Идентификаторы, ИдентификаторПеревозочного_kl_id);
	// BSLLS:UnusedLocalVariable-off
	ИсторияДокументаHTML = Ядро.HTMLИсторияДокументооборота(ИсторияДО);
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияДокументаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	АдресСсылки = Неопределено;
	ДопПараметры = Неопределено;
	
	ДанныеСобытия.Свойство("href", АдресСсылки);
	
	Если ЗначениеЗаполнено(АдресСсылки) Тогда
		// BSLLS:UnusedLocalVariables-off
		СтандартнаяОбработка = Ложь;
		// BSLLS:UnusedLocalVariables-on
		_Платформа.ОповеститьИлиПерейтиПоСсылке(АдресСсылки, ДопПараметры, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуЭлектроннаяПодписьИДоверенности(
		АдресВременногоХранилища = Неопределено,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	Пакет = ПодготовитьПакетНаСервере();
	Документ = Пакет.Документы[0];
	ПредставлениеТекущегоДокумента = Документ.ИмяФайла;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "ФормаЭлектроннаяПодписьИДоверенности");
	ПараметрыОткрытияФормы.Вставить("АдресВременногоХранилища", АдресВременногоХранилища);
	ПараметрыОткрытияФормы.Вставить("ПредставлениеТекущегоДокумента", ПредставлениеТекущегоДокумента);
	
	_Платформа.ОткрытьФормуДиадокМодальноЛок(
		"ФормаHTMLСообщенияУправляемая",
		ЭтаФорма,
		ПараметрыОткрытияФормы
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_СохранитьQRКод(АдресВременногоХранилища, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:MissingTempStorageDeletion-off
	ДанныеQR = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	// BSLLS:MissingTempStorageDeletion-on
	ИмяФайла = ДанныеQR.ИмяФайла;
	ДвоичныеДанные = ДанныеQR.Data;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Заголовок = "Укажите файл, в который нужно сохранить QR код";
	ДиалогВыбора.Фильтр = "GIF (*.gif)|*.gif";
	ДиалогВыбора.ПолноеИмяФайла = ИмяФайла;
	
	Если НЕ ДиалогВыбора.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
		
		Попытка
			
			Файл = Новый Файл(ДиалогВыбора.ПолноеИмяФайла);
			// BSLLS:UsingSynchronousCalls-off
			СоздатьКаталог(Файл.Путь);
			// BSLLS:UsingSynchronousCalls-on
			ДвоичныеДанные.Записать(ДиалогВыбора.ПолноеИмяФайла);
			
		Исключение
			
			Сообщить(ОписаниеОшибки());
			
		КонецПопытки;
		
	Иначе
		
		Сообщить(НСтр("ru = 'Не удалось получить файл QR кода'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКартинкаОшибкиИсторияПоДокументу()
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Пакет.Документы[0];
	
	СтатусМЧДКритичность = Документ.Статусы.СтатусМЧДКритичность;
	СтатусПКФНСКритичность = Документ.Статусы.СтатусПКФНСКритичность;
	
	Ядро = Модуль_Ядро();
	УровниКритичности = Ядро.Контракт_УровниКритичностиСтатусаДокумента();
	
	ЕстьОшибкаПроверкиМЧД = СтатусМЧДКритичность = УровниКритичности.Error
		Или СтатусМЧДКритичность = УровниКритичности.Warning;
	
	СтатусПКФНСКритичность = СтатусПКФНСКритичность = УровниКритичности.Error
		Или СтатусПКФНСКритичность = УровниКритичности.Warning;
		
	Если Не ЕстьОшибкаПроверкиМЧД И Не СтатусПКФНСКритичность Тогда
		Элементы.СтраницаИсторияПоДокументу.Картинка = Новый Картинка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Согласование

&НаКлиенте
Процедура ПередатьНаСогласование(Команда)
	
	НачатьПроцессСогласования("ПередатьНаСогласование");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьНаПодпись(Команда)
	
	НачатьПроцессСогласования("ПередатьНаПодпись");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьПоМаршруту(Команда)
	
	НачатьПроцессСогласования("ПередатьПоМаршруту");
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	
	НачатьПроцессСогласования("Согласование");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВСогласовании(Команда)
	
	НачатьПроцессСогласования("ОтказВСогласовании");
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроцессСогласования(РежимФормыСогласования)
	
	ПакетОтправлен = ДокументОтправлен();
	
	Пакет = ПодготовитьПакетНаСервере();
	
	ДанныеДляОбработки = Новый Массив;
	Если ПакетОтправлен Тогда
		Документ = Пакет.Документы[0];
		ДанныеДляОбработки.Добавить(Документ);
	Иначе
		ДанныеДляОбработки.Добавить(Пакет);
	КонецЕсли;
	
	КатегорияМетрики = Метрика_НазваниеКатегорииПоНаправлению();
	КоличествоДанных = ДанныеДляОбработки.Количество();
	ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте();
	ДействиеМетрики = ЯдроНаКлиенте.Метрика_НазваниеДействияМаршрутизации(РежимФормыСогласования);
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, КоличествоДанных);
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(
		ДанныеДляОбработки,
		РежимФормыСогласования,
		КатегорияМетрики,
		ДействиеМетрики);
	
	ПараметрыОбработки.Вставить("BoxId", Пакет.Идентификаторы.BoxId);
	ПараметрыОбработки.Вставить("ДокументыОтправлены", ПакетОтправлен);
	ПараметрыОбработки.ИсточникОткрытия = Неопределено; //ИсточникОткрытия;
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОбработатьДействиеПоМаршрутизации( , ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Функция Новый_ПараметрыГрупповойОбработки(
	ДокументыДляОбработки,
	Действие,
	КатегорияМетрики,
	ДействиеМетрики,
	Знач ФормаВыполнения = Неопределено,
	ИдентификаторЯщика = Неопределено,
	КонтрагентПоддерживаетМЧД = Истина)
	
	Если ФормаВыполнения = Неопределено Тогда
		ФормаВыполнения = ЭтаФорма;
	КонецЕсли;
	
	ВыполнениеИзФормыПакета = Истина;
	РежимОтображенияДокументов = РежимыОтображения().Перевозочные;
	ИдентификаторОсновнойФормы = Неопределено;
	
	Модуль_Платформа = Модуль_Платформа();
	
	Результат = Модуль_Платформа.Новый_ПараметрыГрупповойОбработки(
		ДокументыДляОбработки,
		Действие,
		КатегорияМетрики,
		ДействиеМетрики,
		ФормаВыполнения,
		ИдентификаторЯщика,
		КонтрагентПоддерживаетМЧД,
		ВыполнениеИзФормыПакета,
		РежимОтображенияДокументов,
		ИдентификаторОсновнойФормы
	);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, КоличествоДанных = 1)
	
	НазваниеФормыДляМетрики = Метрика_НаименованиеФормы();
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Ядро.Метрика_ДобавитьПоведение_МассовоеДействиеНажатиеКнопки(НазваниеФормыДляМетрики,
		КатегорияМетрики,
		ДействиеМетрики,
		КоличествоДанных);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеКатегорииПоНаправлению()
	
	Результат = "";
	
	//Если Направление = Направление().Входящее Тогда
	//	Результат = "Действие во входящих";
	//ИначеЕсли Направление = Направление().Внутреннее Тогда
	//	Результат = "Действие во внутренних";
	//ИначеЕсли Направление = Направление().Исходящее И ПакетОтправлен Тогда
	//	Результат = "Действие в исходящих";
	//ИначеЕсли Направление = Направление().Исходящее И НЕ ПакетОтправлен Тогда
		Результат = "Действия в пакете перевозочных";	
	//КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимыОтображения()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Перевозочные", "ПеревозочныеДокументы");
	
	Возврат Результат
	
КонецФункции

&НаКлиенте
Процедура ОбновитьФорму(ДанныеДляОбработки = Неопределено) Экспорт
	
	НастроитьВидимостьКомандФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииПакета() Экспорт
	
	ОповеститьОВыборе(СтрокаСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВПодразделение(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	ДанныеДляОбработки = Новый Массив;
	Документ = Пакет.Документы[0];
	ДанныеДляОбработки.Добавить(Документ);
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииПоНаправлению();
	КоличествоДанных	= ДанныеДляОбработки.Количество();
	
	ДействиеМетрики		= "Передать в подразделение";
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, КоличествоДанных);
	
	ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте();
	Действие = ЯдроНаКлиенте.Перечисление_ДействияЭДО().ПередатьВПодразделение;
	
	Модуль_Платформа = Модуль_Платформа();
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(
		ДанныеДляОбработки,
		Действие,
		КатегорияМетрики,
		ДействиеМетрики
	);
	ПараметрыОбработки.ИсточникОткрытия = Неопределено;
	Модуль_Платформа.ОбработатьПередатьВПодразделение(, ПараметрыОбработки);
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьПередатьНаСогласование(ЕстьОграниченияПоТарифу)
	
	Если ЕстьОграниченияПоТарифу Тогда
		Элементы.ПередатьНаСогласование.Видимость = Ложь;
		Элементы.ПередатьНаСогласованиеЗаглушка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьПередатьПоМаршруту(ЕстьОграниченияПоТарифу)
	
	Если ЕстьОграниченияПоТарифу Тогда
		Элементы.ПередатьПоМаршруту.Видимость = Ложь;
		Элементы.ПередатьПоМаршрутуЗаглушка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьФункциональностьПоТарифуМини(ЕстьОграниченияПоТарифу)
	
	ОтключитьВключитьПередатьНаСогласование(ЕстьОграниченияПоТарифу);
	ОтключитьВключитьПередатьПоМаршруту(ЕстьОграниченияПоТарифу);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьФункцийТарифа()
	
	Ядро = Модуль_Ядро();
	ЕстьОграниченияПоТарифу = Ядро.ЕстьОграниченияПоТарифу();
	ОтключитьВключитьФункциональностьПоТарифуМини(ЕстьОграниченияПоТарифу);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВЗапросеПодписи(Команда)
	
	НачатьПроцессСогласования("ОтказВЗапросеПодписи");
	
КонецПроцедуры

#КонецОбласти
