#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда 
		
		ТипДокумента = ДанныеЗаполнения.ТипДокумента;
		
		ТекстФайла = ДанныеЗаполнения.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ДанныеЗаполнения + " нет текста титула");
			Возврат;
		КонецЕсли;
		
		// Идентификатор в Логистике
		kl_id       = ДанныеЗаполнения.kl_id;
		
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		Если ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда 
			
			КС = КонтурЛогистика_КонструкторыXDTO;
			СодИнфГО 	= XDTO.Документ.СодИнфГО;
			
			УИД_ТрН_ИзПула = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "УИД_ТрН"); // мог быть отправлен "из пула", тогда он есть сразу в Т1 
			Если ЗначениеЗаполнено(УИД_ТрН_ИзПула) Тогда 
				УИД = УИД_ТрН_ИзПула;
			КонецЕсли;
			
			НомерТрН 	= КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "НомерТрН");
			ДатаТрН_raw = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "ДатаТрН");
			ДатаТрН     = КС.Конвертировать_ДатаТип_вДата(ДатаТрН_raw);
			НомЗак 		= КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "НомЗак");
			ДатаЗак_raw	= КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "ДатаЗак");
			ДатаЗак     = КС.Конвертировать_ДатаТип_вДата(ДатаЗак_raw);
			ГОЭксп = КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО.СвГО, "ГОЭксп");
			ЭтоЭкспедиция = ГОЭксп = "1";
			
			// если указана эл. заказ (заявка) то найти её
			ИдЗак =  КС.XDTO_Вычислить(СодИнфГО, "ИдЗак");
			Если ИдЗак <> Неопределено Тогда 
				ИдФайлЗак = КС.XDTO_ПолучитьЗначениеСвойства(ИдЗак, "ИдФайлЗак")
			КонецЕсли;                                                         
			НайденныйФайлЗЗ = Справочники.КонтурЛогистика_ФайлыОбмена.НайтиФайлОбменаПоИмениФайла(ИдФайлЗак);
			Если ЗначениеЗаполнено(НайденныйФайлЗЗ) Тогда 
				ЗаказЗаявкаОснование = НайденныйФайлЗЗ.ГлавныйДокумент;
			КонецЕсли;
			
			ИдентификаторыУчастниковЭДО = КонтурЛогистика_КонструкторыXDTO.ИдентификаторыСторонИзИмениФайлаТитулаТРН(ДанныеЗаполнения.ИмяФайла);
			
			Грузоотправитель 	= КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
				КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО.СвГО, "РекИдентГО"), ИдентификаторыУчастниковЭДО.Грузоотправитель);
			Перевозчик 			= КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
				КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО, "СвПер"), ИдентификаторыУчастниковЭДО.Грузоперевозчик);
				
			СвГП = КС.XDTO_Вычислить(СодИнфГО, "СвГП");
			Если СвГП <> Неопределено Тогда // в черновике может не быть ГП
				Грузополучатель 	= КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
												КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО.СвГП, "РекИдентГП"), ИдентификаторыУчастниковЭДО.Грузополучатель);
				МестоДоставки  		= КС.Конвертировать_АдресПользТип_вПунктМаршрутаЛогистика(КС.XDTO_ПолучитьЗначениеСвойства(СвГП, "АдресДостГр"));
			КонецЕсли;
			
			Если ЭтоЭкспедиция Тогда 
				ЭкспедицияЗаказчик = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(КС.XDTO_ПолучитьЗначениеСвойства(СодИнфГО.СвЗак, "РекИдентЗак"));
				ДогУслПерXDTO = КС.XDTO_Вычислить(СодИнфГО, "СвЗак.ДогУслПер");
				ЭкспедицияДоговор		 = КС.Конвертировать_РеквДокТип_вДоговорЛогистика(ДогУслПерXDTO);
			КонецЕсли;
			
			СвТС = КС.XDTO_Вычислить(СодИнфГО, "СвТС");
			Если СвТС <> Неопределено Тогда // в черновике может не быть ТС
				ТранспортноеСредство = КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(КС.XDTO_ПолучитьЗначениеСвойства(СвТС, "ТС"));
				ПрицепыXDTOМассив = КС.XDTO_ВычислитьМассивXDTO(КС.XDTO_ПолучитьЗначениеСвойства(СвТС, "Прицеп"));
				Если ПрицепыXDTOМассив <> Неопределено Тогда
					КоличествоПрицепов = ПрицепыXDTOМассив.Количество();
					
					Если КоличествоПрицепов > 0 Тогда
						Прицеп = КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(ПрицепыXDTOМассив[0]);
						
						Если КоличествоПрицепов > 1 Тогда
							Прицеп2 = КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(ПрицепыXDTOМассив[1]);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			СвПогруз = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз");
			Если СвПогруз <> Неопределено Тогда // в черновике может не быть места погрузки
				МестоПогрузки  		= КС.Конвертировать_АдресПользТип_вПунктМаршрутаЛогистика(
					КС.XDTO_ПолучитьЗначениеСвойства(СвПогруз, "ФАдресПогр"), КС.XDTO_ПолучитьЗначениеСвойства(СвПогруз, "ВладИнфр"));
			КонецЕсли;
			
			СвВодит = КС.XDTO_Вычислить(СодИнфГО, "СвВодит");
			Если СвВодит <> Неопределено Тогда // в черновике может не быть водителя
				
				СвВодитМассив = КС.XDTO_ВычислитьМассивXDTO(СвВодит);				
				Если СвВодитМассив <> Неопределено И СвВодитМассив.Количество() > 0 Тогда
					
					Тлф = КС.XDTO_Вычислить(СвВодитМассив[0], "Тлф");
					Если Тлф <> Неопределено Тогда
						
						ТлфМассив = КС.XDTO_ВычислитьМассивXDTO(Тлф);						
						Если ТлфМассив <> Неопределено И ТлфМассив.Количество() > 0 Тогда
							ТелефонВодителя = ТлфМассив[0];
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ГрузоотправительПодразделение = ДанныеЗаполнения.ОтправительПодразделение;
			ГрузополучательПодразделение = ДанныеЗаполнения.ПолучательПодразделение;
			// ПеревозчикПодразделение = эмм, а откуда брать?  TODO
			
			СвЛицПогрГр_СовпГОП = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.СовпГОП");
			Если СвЛицПогрГр_СовпГОП = "1" Тогда
				
				ПогрузкуОсуществляет = Грузоотправитель;
				
			Иначе
				
				ПогрузкуОсуществляет = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.РекЛицПогрГр"), 
						ИдентификаторыУчастниковЭДО.Грузоотправитель, 
						Истина);
				
				Если ДанныеЗаполнения.Отправитель = ПогрузкуОсуществляет Тогда 
					ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			ОснПогрГрXDTO = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.ОснПогрГр");
			ПогрузкаДоговор		 = КС.Конвертировать_РеквДокТип_вДоговорЛогистика(ОснПогрГрXDTO);
			
			РабЛицПогрГрXDTO = КС.XDTO_Вычислить(СодИнфГО, "СвПогруз.СвЛицПогрГр.РабЛицПогрГр");
			ПогрузкаСотрудник    = КС.Конвертировать_РабЛицПогрГр_вСотрудникаЛогистика(РабЛицПогрГрXDTO);
			
			СрокДоставки		= КС.XDTO_Вычислить(СодИнфГО, "УказГО.СрокДостГр");
			ДатаВремяДоставкиRAW= КС.XDTO_Вычислить(СодИнфГО, "УказГО.ДатВрДостГр");
			Если ЗначениеЗаполнено(ДатаВремяДоставкиRAW) Тогда 
            	ДатаВремяДоставки	= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДатаВремяДоставкиRAW);
			КонецЕсли;
			
			МаршрутТекст		= КС.XDTO_Вычислить(СодИнфГО, "УказГО.МршПрвз.МршТекст");
			МаршрутМашиночитаемый = КС.XDTO_Вычислить(СодИнфГО, "УказГО.МршПрвз.МршМашЧит");
			
			
		ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2 Тогда 
			
		Иначе
			 Сообщить("Обработка заполнения Документа ЭТРН из " + ТипДокумента + " не поддерживается");
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда 
		
		Если Не ЗначениеЗаполнено(ГрузоотправительПодразделение) И ЗначениеЗаполнено(Грузоотправитель) Тогда
			ГрузоотправительПодразделение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(Грузоотправитель, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПеревозчикПодразделение) И ЗначениеЗаполнено(Перевозчик) Тогда
			ПеревозчикПодразделение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(Перевозчик, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ГрузополучательПодразделение) И ЗначениеЗаполнено(Грузополучатель) Тогда
			ГрузополучательПодразделение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(Грузополучатель, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПогрузкуОсуществляетПодразделение) И ЗначениеЗаполнено(ПогрузкуОсуществляет) Тогда
			ПогрузкуОсуществляетПодразделение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(ПогрузкуОсуществляет, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьПартнераГО()

	Если ЗначениеЗаполнено(Грузоотправитель) Тогда 
		ПартнерГрузоотправитель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Грузоотправитель);
	Иначе
		ПартнерГрузоотправитель = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьПартнераПВ()

	Если ЗначениеЗаполнено(Перевозчик) Тогда 
		ПартнерПеревозчик = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Перевозчик);
	Иначе
		ПартнерПеревозчик = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьПартнераГП()

	Если ЗначениеЗаполнено(Грузополучатель) Тогда 
		ПартнерГрузополучатель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Грузополучатель);
	Иначе
		ПартнерГрузополучатель = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

#КонецЕсли