
#Область СлужебныйПрограммныйИнтерфейс
#Область КомандыПечатиАнкеты

// Процедура выполняет печать анкеты в формате "Microsoft Word"
//
// Параметры:
//  ОписаниеКоманды - Структура - Описание команды.
//
Процедура ПечатьАнкетыMicrosoftWord(ОписаниеКоманды) Экспорт
	//++ Локализация
	
	Если ТипЗнч(ОписаниеКоманды) = Тип("Структура") Тогда
		СоставДокументов = ОписаниеКоманды.ОбъектыПечати; // массив
	Иначе
		СоставДокументов = Новый Массив;
		СоставДокументов.Добавить(ОписаниеКоманды);
	КонецЕсли;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Справочник.КартыЛояльности",
		"АнкетаMicrosoftWord",
		СоставДокументов,
		Неопределено);
	
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#КонецОбласти
