#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	КонтролируемаяПартия = Неопределено;
	ЕстьКонтролируемаяПартия = Параметры.Свойство("КонтролируемаяПартия", КонтролируемаяПартия);
	ЕстьСклад = Параметры.Свойство("Склад") И ЗначениеЗаполнено(Параметры.Склад);
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений();
	ДействияПоТоварам = Перечисления.ДействияПоТоварамВАктеКонтроляКачества;
	Для Индекс = 0 По ДействияПоТоварам.Количество() - 1 Цикл
		ЭлементВыбора = Перечисления.ДействияПоТоварамВАктеКонтроляКачества.Получить(Индекс);
		ДанныеВыбора.Добавить(ЭлементВыбора, ЭлементВыбора);
	КонецЦикла;
	
	// Ограничение списка действий.
	УдаляемыеЭлементы = Новый Массив();
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПеремещениеТоваров") Тогда
		УдаляемыеЭлементы.Добавить(ДействияПоТоварам.ОформитьПеремещение);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьКачествоТоваров") Тогда
		УдаляемыеЭлементы.Добавить(ДействияПоТоварам.ИзменитьКачество);
		УдаляемыеЭлементы.Добавить(ДействияПоТоварам.ОформитьПорчу);
	КонецЕсли;
	
	Если ЕстьКонтролируемаяПартия Тогда
		КонтрольКачества.ОграничитьДанныеВыбораДействияПоПартии(КонтролируемаяПартия, УдаляемыеЭлементы);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОрдернуюСхемуПриПоступлении")
			Или ЕстьСклад И Не СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(Параметры.Склад, Параметры.Дата) Тогда
		УдаляемыеЭлементы.Добавить(ДействияПоТоварам.ИзменитьКачество);
	КонецЕсли;
	
	Для Каждого ЗначениеВыбора Из УдаляемыеЭлементы Цикл
		ЭлементВыбора = ДанныеВыбора.НайтиПоЗначению(ЗначениеВыбора);
		Если ЭлементВыбора <> Неопределено Тогда
			ДанныеВыбора.Удалить(ЭлементВыбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти
