
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Элементы.ТоварыХарактеристика.Видимость = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики()
												И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяХарактеристики") = Истина;
	
	ОбновитьДанныеФормы();
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	
	РазблокироватьДанныеФормыДляРедактирования();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// баги старой платформы при отрисовке сложных группировок:
	// в режиме интерфейса 8.2 отображаем в режиме "на отдельных закладках" шапку и тч
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоИнтерфейс82() Тогда 
		ШапкаНаОтдельнойЗакладке = Истина;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШапка;
		элементы.Группа16.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;

	УправлениеВидимостьюИДоступностью(); // в будущем завернуть на проверить документ
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" 
		И 	(Параметр = Объект.Ссылка 
				ИЛИ
			(Параметр <> Неопределено 
			И ТипЗнч(Параметр) = Тип("Массив") 
			И Параметр.Найти(Объект.Ссылка) <> Неопределено)) Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполнитьТребуемыеДействияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоДокОснованию(Команда)
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("Да, и СВ и Титул");
	СписокКнопок.Добавить("Да, только Титул");
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика("Действие полностью перезаполнит документ по Основанию. Вы АБСОЛЮТНО уверены?",
		СписокКнопок,
		"Подтвердите операцию",
		,
		ЭтаФорма,
		"ОбработчикСогласияПерезаполнения");
		
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработчикСогласияПерезаполнения(Ответ, ДопПараметр = Неопределено) Экспорт
	
	Если Ответ = "Да, и СВ и Титул" Тогда 
		ПерезаполнитьПоДокОснованиюСервер(Истина);
		ОбновитьДанныеФормы();
	ИначеЕсли Ответ = "Да, только Титул" Тогда
		ПерезаполнитьПоДокОснованиюСервер(Ложь);
		ОбновитьДанныеФормы();
	КонецЕсли;
	
	ОбновитьОтображениеДанных();
	ПолностьюОбновитьПредставлениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТитулаПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.ДокументСВ, Истина);
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда 
		ПерешелВЛогистическиеСтатус = Истина;
	Иначе
		ПерешелВЛогистическиеСтатус = Ложь;
	КонецЕсли;
	Элементы.ТекущийСтатус.Видимость = Не ПерешелВЛогистическиеСтатус;
	Элементы.ТекущийСтатусДокументооборота.Видимость = ПерешелВЛогистическиеСтатус;
	
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Повторно выполнить задачу";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Переотправить неподписанный (черновик)";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Выполнить задачу";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Отправить неподписанный (черновик)";
	КонецЕсли;

	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = ЭтоВходящий И Не ЕстьДокУчСист;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
	КонецЕсли;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;
	
	Элементы.ПерезаполнитьПоДокОснованию.Видимость = НЕ ЭтоВходящий И ЕстьДокУчСист;
	Элементы.ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = НЕ ЕстьДокУчСист;
	Элементы.ПользовательПодписант.Видимость = НЕ ЭтоВходящий;
	
	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, Объект.ДокументОснование, Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер(ПерезаполнятьЭТРН = Ложь)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Объект.Товары.Очистить();
		Объект.Маркировки.Очистить();
		Объект.ОпасныеГрузы.Очистить();
		Объект.Контейнеры.Очистить();
		Объект.ДополнительныеВодители.Очистить();
		
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ДокОбъект.Заполнить(Новый Структура("ДокументОснование, ТипЛогистика, ПерезаполнитьГлавныйДокументЕслиСуществует", ДокОбъект.ДокументОснование, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, ПерезаполнятьЭТРН));
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолностьюОбновитьПредставлениеДанных()

	//УстановитьТипыЗначенийРеквизитов(); // TODO
	
	ОповеститьОбИзменении(Объект.ДокументСВ);
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	
	ЗаполнитьТребуемыеДействияТоваров();
	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

// УПРАВЛЕНИЕ ВИДИМОСТЬЮ И ДОСТУПНОСТЬЮ
&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	УстановитьПоложениеСохраняемыхЭлементов();
	УстановитьФорматыКолонокСКоличеством();

	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	ЭтоВыгрузка = МассивТиповГдеЕстьВыгрузка().Найти(Объект.ТипТитула) <> Неопределено;
	ЭтоПогрузка = МассивТиповГдеЕстьПогрузка().Найти(Объект.ТипТитула) <> Неопределено;
	
	Элементы.ГруппаДатаВыгрузки.Видимость = ЭтоВыгрузка;
	Элементы.ГруппаДатаПогрузки.Видимость = ЭтоПогрузка;
	
	Элементы.ГруппаВыгрузка.Видимость = ЭтоВыгрузка;
	Элементы.ГруппаПогрузка.Видимость = ЭтоПогрузка;
	
	// TODO уточнить видимость когда ФНС нормально напишет чего имела в виду
	//Элементы.КонтейнерыДатВрСдПгр.Видимость = ЭтоВыгрузка;
	//Элементы.КонтейнерыДатВрВозврКонт.Видимость = ЭтоПогрузка;
	
КонецПроцедуры

&НаКлиенте
Функция МассивТиповГдеЕстьВыгрузка()

	текМассив = Новый Массив;
	текМассив.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул1"));
	текМассив.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул2"));
	текМассив.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул5"));
	текМассив.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул6"));
	
	Возврат текМассив;
	
КонецФункции

&НаКлиенте
Функция МассивТиповГдеЕстьПогрузка()

	
	текМассив = Новый Массив;
	текМассив.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул3"));
	текМассив.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул4"));
	текМассив.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул7"));
	текМассив.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул8"));
	текМассив.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул9"));
	
	Возврат текМассив;
	
КонецФункции

&НаКлиенте
Процедура УстановитьФорматыКолонокСКоличеством()
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары, "МассаКонтейнеровБрутто", Элементы.ТоварыМассаКонтейнеровБрутто);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары, "ПлановаяМассаГрузаБрутто", Элементы.ТоварыПлановаяМассаГрузаБрутто);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары, "КоличествоМест", Элементы.ТоварыКоличествоМест);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары, "Плотность", Элементы.ТоварыПлотность);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеСохраняемыхЭлементов()
	
	УстановитьВидимостьНеучитываемыхИФильтраОшибок();
	УстановитьПоложениеШапки();
	УстановитьСвернутостьПодробностейОТоварах();

КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормыВЗависимостиОтСтатуса()
	
	СтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	Если СтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик 
		Или (СтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка И ЗначениеЗаполнено(Объект.ДокументСВ.УИД)) Тогда
		
		ТолькоПросмотр = Ложь;
		Элементы.ГруппаИсправление.Видимость = Объект.НомИспр > 0;
		Если Элементы.Найти("ВнестиИсправлениеТитула") <> Неопределено Тогда
			Элементы.ВнестиИсправлениеТитула.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		ТолькоПросмотр = Истина;
		Элементы.ГруппаИсправление.Видимость = Истина;
		Если Элементы.Найти("ВнестиИсправлениеТитула") <> Неопределено Тогда
			Элементы.ВнестиИсправлениеТитула.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Управление положением подробных сведений о товаре

&НаКлиенте
Процедура СвернутьПодробныеСведенияНажатие(Элемент)
	
	СкрытьПодробностиТоваров = Истина;
	УстановитьСвернутостьПодробностейОТоварах();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаРазвернутьПодробностиТоваровНажатие(Элемент)
	
	СкрытьПодробностиТоваров = Ложь;
	УстановитьСвернутостьПодробностейОТоварах();
	
КонецПроцедуры

// Вспомогательные для Обработчики команд

&НаКлиенте
Процедура УстановитьСвернутостьПодробностейОТоварах()
	
	Элементы.ГруппаПодробныеСведенияСвернутая.Видимость = СкрытьПодробностиТоваров;
	Элементы.ГруппаПодробныеСведения.Видимость = НЕ Элементы.ГруппаПодробныеСведенияСвернутая.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ОтборСтрок = Неопределено;
	
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда  
		
		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиТоваров", Элемент.ТекущиеДанные.ИдентификаторСтроки);	
		
	КонецЕсли;	
					
	Элементы.Маркировки.ОтборСтрок 			= ОтборСтрок;
	Элементы.ОпасныеГрузы.ОтборСтрок 		= ОтборСтрок;					
					
	КонтурЛогистика_ПанельОшибокКлиент.УстановитьОтборТаблицыОшибокПоНомеруСтроки(ТаблицаОшибок, Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура СвернутьШапку(Команда)
	
	ШапкаНаОтдельнойЗакладке = Истина;
	УстановитьПоложениеШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьШапку(Команда)
	
	ШапкаНаОтдельнойЗакладке = Ложь;
	УстановитьПоложениеШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеШапки()
	
	Если ШапкаНаОтдельнойЗакладке Тогда
		
		текАктивнаяЗакладка = Элементы.Страницы.ТекущаяСтраница;
		
		ПереместитьШапкуВызовСервера();
		//Элементы.Переместить(Элементы.ГруппаШапкаЛево, Элементы.СтраницаШапка);
		Элементы.СвернутьШапку.Видимость = Ложь;
		Элементы.РазвернутьШапку.Видимость = Истина;
		
		ПанельОшибокРазвернута = Элементы.ПанельОшибок.РастягиватьПоВертикали;
		Если Не ПанельОшибокРазвернута Тогда 
			ПанельОшибокСвернутьРазвернутьВызовОМ();
		КонецЕсли;
		                                             
		Элементы.Страницы.ТекущаяСтраница = текАктивнаяЗакладка;
		
	Иначе
		
		ПереместитьШапкуВызовСервера();
		//Элементы.Переместить(Элементы.ГруппаШапкаЛево, Элементы.ГруппаШапкаМестоположение);
		Элементы.СвернутьШапку.Видимость = Истина;
		Элементы.РазвернутьШапку.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПереместитьШапкуВызовСервера()
	
	Если ШапкаНаОтдельнойЗакладке Тогда
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма, Элементы.ГруппаШапкаДанные, Элементы.СтраницаШапка);
	Иначе
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма, Элементы.ГруппаШапкаДанные, Элементы.ГруппаШапкаМестоположение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СделатьНесопоставленныеНеУчитываемыми(Команда)
	
	НесопоставленныеСтроки = Объект.Товары.НайтиСтроки(
		Новый Структура("КоличествоМест,МассаКонтейнеровБрутто,ОтгрузочноеНаименование,Учитывать", 
			0,
			0,
			"",
			Истина)
		);
	Если НесопоставленныеСтроки.Количество() > 0 Тогда
			
		Для Каждого текСтр Из НесопоставленныеСтроки Цикл
			СделатьСтрокуТовараНеучитываемой(текСтр);
		КонецЦикла;
		
		ПолностьюОбновитьПредставлениеДанных();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьСтрокуТовараНеучитываемой(Знач ТекДанныеТоваров)
	
	СделатьНоменклатуруНеучитываемой(ТекДанныеТоваров.Номенклатура, ТекДанныеТоваров.УпаковкаЕдиницаИзмерения);
	
	// эта номенклатура может быть еще в других строках
	// требуется переконвертировать все строки с этой номенклатурой
	МассивСтрокСЭтойНоменклатурой = Объект.ТоварыДокумента1С.НайтиСтроки(Новый Структура("Номенклатура", ТекДанныеТоваров.Номенклатура));
	
	Для Каждого СтрокаПереконвертации Из МассивСтрокСЭтойНоменклатурой Цикл
		
		СконвертироватьСтрокуТоваровКлиент(СтрокаПереконвертации.ПолучитьИдентификатор());
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СделатьНоменклатуруНеучитываемой(Номенклатура, УпаковкаЕдиницаИзмерения)
	
	РегистрыСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.ПрисвоитьСоответствиеНоменклатуры(Номенклатура, Новый Структура("Учитывать,УпаковкаЕдиницаИзмерения", Ложь, УпаковкаЕдиницаИзмерения));	
	
КонецПроцедуры 

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)
	
	ОбработчикПеречитатьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ПолностьюОбновитьПредставлениеДанных();
	ОбновитьДанныеФормы();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьПиктограммыОшибокТабличнойЧасти(Объект.Товары, ТаблицаОшибок, "Товары", "КартинкаОшибок");
	
	ЗаполнитьТребуемыеДействияТоваров(); 	// требуемые действия зависят от результатов проверки 
	УправлениеВидимостьюИДоступностью(); 	// доступность команд
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_СВ_ТитулПВ.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		СтрокаТовара.Картинка = 0;
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТребуемыеДействияТоваров()

	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		
		СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара)
	
	Если СтрокаТовара = Неопределено Тогда 	
		Возврат;
	КонецЕсли;
	
	СтрокаТовара.ТребуемоеДействие = "";
	
	// Блок 1 - Требуемые действия ведения пользователя за ручку по номенклатуре
	
	Если НЕ СтрокаТовара.Учитывать Тогда 
		СтрокаТовара.ТребуемоеДействие = "Не учитывается";
		Возврат;
	КонецЕсли;
	
	// Для исходящих одни требуемые действия, а для исходящих другие
	Если ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен") Тогда 
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ИспользоватьИПрименятьБазовыеСоответствия") Тогда 
			// эти требуемые действия блока 1 не являются блокирующими по документу - они только ведут пользователя
			Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда 
				СтрокаТовара.ТребуемоеДействие = "Указать Номенклатуру";
				
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.УпаковкаЕдиницаИзмерения) Тогда 
				СтрокаТовара.ТребуемоеДействие = "Указать Единицу измерения";
				
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.Количество) Тогда 
				СтрокаТовара.ТребуемоеДействие = "Указать Количество";
				
				
			ИначеЕсли
					Не ЗначениеЗаполнено(СтрокаТовара.КоличествоМест) 
					ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.СпособУпаковки) 
					ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.СостояниеГруза) 
					ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.ВидТары) 
					ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.ПлановаяМассаГрузаБрутто) 
					ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.ОтгрузочноеНаименование) Тогда
					
				Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ТребоватьНаличиеБазовыхСоответствий") Тогда 
					СтрокаТовара.ТребуемоеДействие = "Установить соответствие";
				Иначе
					СтрокаТовара.ТребуемоеДействие = "Заполнить обязательные поля";
				КонецЕсли;
				
			Иначе
				СтрокаТовара.ТребуемоеДействие = "Готов";
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда 
			СтрокаТовара.ТребуемоеДействие = "Сопоставить";
		Иначе
			СтрокаТовара.ТребуемоеДействие = "ОК";
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьЗаголовкиКоличества(Форма)
	Форма.Элементы.ТоварыКоличествоМест.Заголовок = Форма.Объект.Товары.Итог("КоличествоМест");	
	Форма.Элементы.ТоварыКоличество.Заголовок = Форма.Объект.Товары.Итог("Количество");	
КонецПроцедуры

// Обслуживание панели ошибок

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()
	
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокРежимПриИзменении(Элемент)
	КонтурЛогистика_ПанельОшибокКлиент.ПриИзмененииРежимаПанелиОшибок(Элементы.ТаблицаОшибок, ПанельОшибокРежимТекущейСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокРежимТекущейСтрокиПриИзменении(Элемент)
	КонтурЛогистика_ПанельОшибокКлиент.ПриИзмененииРежимаПанелиОшибок(Элементы.ТаблицаОшибок, ПанельОшибокРежимТекущейСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокФильтроватьСТрокиПоОшибке(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, "ТаблицаОшибокТекстОшибки");
	УстановитьВидимостьНеучитываемыхИФильтраОшибок(); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтключитьФильтрТаблицыОшибок(Команда)
	
	ОтборТаблицыОшибокЗначение = "";
	
	Если Элементы.Товары.ОтборСтрок <> Неопределено Тогда
		
		ВременнаяСтруктура = Новый Структура(Элементы.Товары.ОтборСтрок);
		
		Если ВременнаяСтруктура.Свойство("ПризнакОтбораТаблицыОшибок") Тогда 
			ВременнаяСтруктура.Удалить("ПризнакОтбораТаблицыОшибок");
			Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(ВременнаяСтруктура);
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ОтключитьФильтрТаблицыОшибок.Видимость = Ложь;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьФильтрТаблицыОшибокТовары(Команда)
	
	ОтборТаблицыОшибокЗначениеТовары = "";
	
	Если Элементы.Товары.ОтборСтрок <> Неопределено Тогда
		
		ВременнаяСтруктура = Новый Структура(Элементы.Товары.ОтборСтрок);
		
		Если ВременнаяСтруктура.Свойство("ПризнакОтбораТаблицыОшибок") Тогда 
			ВременнаяСтруктура.Удалить("ПризнакОтбораТаблицыОшибок");
			Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(ВременнаяСтруктура);
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ОтключитьФильтрТаблицыОшибокТовары.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВремяПодачиПлановоеПриИзменении(Элемент)
	
	ДатаВремяПодачиПлановаяПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяПодачиПлановаяПриИзменении(Элемент = Неопределено)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПрибытияПриИзменении(Элемент)
	ДатаВремяПрибытияПриИзменении()
КонецПроцедуры

&НаКлиенте
Процедура ВремяПрибытияПриИзменении(Элемент)
	
	ДатаВремяПрибытияПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяПрибытияПриИзменении(Элемент = Неопределено)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатТСВыгрТекущим(Команда)
	
	Объект.ДатТСВыгр = ТекущаяДата();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатТСПогрТекущим(Команда)
	
	Объект.ДатТСПогр = ТекущаяДата();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	СформироватьТребуемоеДействиеСтрокиТовара(Элемент.ТекущиеДанные);
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТоварыТребуемоеДействие" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекДанные = Элемент.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда 
			
			ТребуемоеДействие = ТекДанные.ТребуемоеДействие; 
			ПараметрыТекСтрока = ВыбраннаяСтрока;
			Если ТребуемоеДействие 		= "Указать Номенклатуру" Тогда
				
				ТипСправочникаНоменклатура = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяСправочникаНоменклатура");
				
				КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы(
					"Справочник." + ТипСправочникаНоменклатура + ".ФормаВыбора",
					,
					ЭтаФорма,
					ЭтаФорма,
					"ОбработчикВыбораНоменклатуры",
					ПараметрыТекСтрока);
					
			ИначеЕсли ТребуемоеДействие = "Указать Единицу измерения" Тогда
				
				Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыУпаковкаЕдиницаИзмерения;
				Элементы.Товары.ИзменитьСтроку();
					
			ИначеЕсли ТребуемоеДействие = "Указать Количество" Тогда
				
				Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыКоличество;
				Элементы.Товары.ИзменитьСтроку();
					
			ИначеЕсли ТребуемоеДействие = "Установить соответствие"
				ИЛИ ТребуемоеДействие = "Не учитывается" Тогда
				
				ОткрытьСоответствияТекущейСтроки();
				
			Иначе // требуемое действие от таблицы ошибок
				
				ОбработатьТребуемоеДействие(ТребуемоеДействие, Неопределено);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчики для требуемых действий

&НаКлиенте
Процедура ОбработатьТребуемоеДействие(ТребуемоеДействие, ПолеТаблицыОшибок = Неопределено)
	
	// реализуем отдельную обработку некоторых требуемых действий
	Если Ложь Тогда // Какие-то особенные UI для требуемых действий, например: ТребуемоеДействие = "Исправить GTIN" Тогда
		
	Иначе // типовая обработка таблицы ошибок
		
		Если ПолеТаблицыОшибок <> Неопределено Тогда
			КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, ПолеТаблицыОшибок.Имя);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствияТекущейСтроки()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = "Табличная часть пуста! Сначала добавьте товар.";
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения);	
		
	Иначе

		текНоменклатура 	= ТекущиеДанные.Номенклатура;
		текЕдиница 			= ТекущиеДанные.УпаковкаЕдиницаИзмерения;
		текХарактеристика 	= ТекущиеДанные.Характеристика;
		
		КонтурЛогистика_КонвертацияКлиент.ОткрытьСоответствияНоменклатуры(текНоменклатура, текЕдиница, текХарактеристика, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораНоменклатуры(ВыбранноеЗначение, ПараметрИдСтрокиТоваров) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		ТекДанные = Объект.Товары.НайтиПоИдентификатору(ПараметрИдСтрокиТоваров);
		ТекДанные.Номенклатура = ВыбранноеЗначение;
		
		ОбработчикПереконвертироватьСтроку(ПараметрИдСтрокиТоваров, ТекДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораЕдиницыИзмерения(ВыбранноеЗначение, ПараметрИдСтрокиТоваров) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда
		
		ТекДанные = Объект.Товары.НайтиПоИдентификатору(ПараметрИдСтрокиТоваров);
		ТекДанные.УпаковкаЕдиницаИзмерения = ВыбранноеЗначение;
		
		ОбработчикПереконвертироватьСтроку(ПараметрИдСтрокиТоваров, ТекДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПереконвертироватьСтроку(ИдСтрокиТоваров, ТекДанные)

	СконвертироватьСтрокуТоваровКлиент(ИдСтрокиТоваров);
	СформироватьТребуемоеДействиеСтрокиТовара(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикИзмененияСоответствий(Параметр, ДопПараметр) Экспорт
	
	Если ЗначениеЗаполнено(ДопПараметр) Тогда
		
		локМассивСтрокСЭтойНоменклатурой = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ДопПараметр));
		локМассивИдентификаторов = Новый Массив;
		
		Для Каждого СтрокаПереконвертации Из локМассивСтрокСЭтойНоменклатурой Цикл
			
			СконвертироватьСтрокуТоваровКлиент(СтрокаПереконвертации.ПолучитьИдентификатор());
			локМассивИдентификаторов.Добавить(СтрокаПереконвертации.ИдентификаторСтроки);
			
		КонецЦикла;
		
		ПолностьюОбновитьПредставлениеДанных();
		
		ТоварыКоличествоМестПриИзменении(Неопределено);
		ТоварыМассаПлановаяБруттоКгПриИзменении(Неопределено);
		
		ПересчитатьЗаголовкиКоличества(ЭтаФорма);
		
		Модифицированность = Истина;
	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СконвертироватьСтрокуТоваровКлиент(ИдентификаторСтрокиТоваров)
	
	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтрокиТоваров);
	
	Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) И ЗначениеЗаполнено(ТекСтрока.УпаковкаЕдиницаИзмерения) Тогда
		СконвертироватьСтрокуТоваров1СвЛогистика(ИдентификаторСтрокиТоваров);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СконвертироватьСтрокуТоваров1СвЛогистика(ИдентификаторСтрокиТоваров)
	
	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтрокиТоваров);
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.СконвертироватьСтрокуТоваров1СвЛогистика(СтрокаТоваров.НомерСтроки); 
	
	ЗаполнитьЗначенияСвойств(СтрокаТоваров, ДокОбъект.Товары[СтрокаТоваров.НомерСтроки - 1])
	// маркировки проч не переносим т.к. можно потерять данные
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьНеучитываемые(Команда)
	
	СкрытьНеучитываемые = Не СкрытьНеучитываемые;
	УстановитьВидимостьНеучитываемыхИФильтраОшибок();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНеучитываемыхИФильтраОшибок()
	
	КонтурЛогистика_ОбработкаДокументовКлиент.УстановитьВидимостьНеучитываемыхИФильтраОшибок(Объект.Товары, СкрытьНеучитываемые, Элементы.Товары, Элементы.ТоварыИтоги);
	
	// лишним не будет
	Элементы.ОтключитьФильтрТаблицыОшибокТовары.Видимость = ЗначениеЗаполнено(ОтборТаблицыОшибокЗначениеТовары);	

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствияНоменклатуры(Команда)
	
	ОткрытьСоответствияТекущейСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДобавить(Команда)
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);	
	НоваяСтрока.Учитывать = Истина;	
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики()
		И КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ИспользуютсяХарактеристики() Тогда 
		НоваяСтрока.Характеристика =  КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ПустаяХарактеристика();
	КонецЕсли;
	
	ПроверитьДокумент();
	ЗаполнитьТребуемыеДействияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкопировать(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДокументСВНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Объект.ДокументСВ);
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
												"Документ.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ФормаОбъекта",
												ПараметрыФормы,
												ЭтаФорма,
												ЭтаФорма,
												"ОбработчикПерепроверить")
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМассаПлановаяБруттоКгПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоМестПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто") Тогда 
		Объект.МассаБруттоКг = Объект.Товары.Итог("МассаПлановаяБруттоКг")
	КонецЕсли;
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест") Тогда 
		Объект.КоличествоМест = Объект.Товары.Итог("КоличествоМест")
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СоставительПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорОснованиеДоверияКСоставителюПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()

	Представления = ПолучитьПредставлениеРеквизитовДокументаОснования(Объект.ДокументОснование, Объект);	
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл 
		
		Значение = Неопределено;
		
		Если  Представления.Свойство("ДокУчСист_" + Эл.Ключ, Значение) Тогда 
			текВыражение = "ДокУчСист_" + Эл.Ключ  + " = Значение";
			Выполнить (текВыражение);
			
			
			// определим доступность команды сопоставления
			ИмяЭлементаЛогистика = Эл.Значение; // сконвертированного
			ИмяЭлементаНадписиСопоставить = "ДокУчСист_" + Эл.Ключ + "_Сопоставить";
			
			Если ЗначениеЗаполнено(ИмяЭлементаЛогистика) И ЗначениеЗаполнено(Этаформа["ДокУчСист_" + Эл.Ключ]) Тогда // если этот элемент выведен на форму и он рассчитан из документа уч сист
				
				Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
					
					ПутьПроверкиДанных = Элементы.Найти(ИмяЭлементаЛогистика).ПутьКДанным;
					ЗначениеВРеквизите = Вычислить(ПутьПроверкиДанных);
					НужноСопоставить = Не ЗначениеЗаполнено(ЗначениеВРеквизите);
					
				Иначе
					
					НужноСопоставить = Ложь;
					
				КонецЕсли;
				
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость = НЕ НужноСопоставить;
				Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = НужноСопоставить;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРеквизитовДокументаОснования(ДокументОснование, Знач ДокументТитулОбъект)
	
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	СтруктураПредставлений = Новый Структура;
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл 
		СтруктураПредставлений.Вставить("ДокУчСист_" + Эл);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда 
		
		НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, ДокументОснование);
		
		Если НастройкаКонвертации <> Неопределено Тогда
			
			Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл 
				
				Если Эл.Ключ = "Водитель" Тогда // в другой ТЧ 
					НастройкаКонвертацииРеквизита = НастройкаКонвертации.ПравилаКонвертацииТитулаРеквизиты.Найти(Эл.Ключ, "РеквизитТитула");
				Иначе
					НастройкаКонвертацииРеквизита = НастройкаКонвертации.ПравилаКонвертацииГлавногоДокумента.Найти(Эл.Ключ, "РеквизитТитула");
				КонецЕсли;
				
				РезультатВычисления = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьРеквизитОснования(
											ДокументОснование,
											НастройкаКонвертацииРеквизита,
											НастройкаКонвертации,
											ДокументТитулОбъект,
											Ложь);
				
				Если РезультатВычисления.Успешно Тогда 
					СтруктураПредставлений.Вставить("ДокУчСист_" + Эл.Ключ, 	РезультатВычисления.Значение);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		 
	КонецЕсли;
	
	Возврат СтруктураПредставлений;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()
	
	Перем МассивКонвертируемыхРеквизитов;
	
	МассивКонвертируемыхРеквизитов = Новый Соответствие;
	МассивКонвертируемыхРеквизитов.Вставить("Грузоотправитель"				, "ДокументСВГрузоотправитель");
	МассивКонвертируемыхРеквизитов.Вставить("Перевозчик"					, "ДокументСВПеревозчик");
	МассивКонвертируемыхРеквизитов.Вставить("Грузополучатель"				, "ДокументСВГрузополучатель");
	МассивКонвертируемыхРеквизитов.Вставить("ТранспортноеСредство"			, "ДокументСВТранспортноеСредство");
	МассивКонвертируемыхРеквизитов.Вставить("Прицеп"						, "ДокументСВПрицеп");
	МассивКонвертируемыхРеквизитов.Вставить("МестоПогрузки"					, "ДокументСВМестоПогрузки");
	МассивКонвертируемыхРеквизитов.Вставить("МестоДоставки"					, "ДокументСВМестоДоставки");
	МассивКонвертируемыхРеквизитов.Вставить("ГрузоотправительПодразделение"	, ""); // элементов нет в Т1
	МассивКонвертируемыхРеквизитов.Вставить("ПеревозчикПодразделение"		, "");
	МассивКонвертируемыхРеквизитов.Вставить("ГрузополучательПодразделение"	, "");
	МассивКонвертируемыхРеквизитов.Вставить("ПогрузкаДоговор"				, "");
	МассивКонвертируемыхРеквизитов.Вставить("ПогрузкаСотрудник"				, "ДокументСВПогрузкаСотрудник");
	МассивКонвертируемыхРеквизитов.Вставить("Водитель"						, "Водитель");
	МассивКонвертируемыхРеквизитов.Вставить("ЭкспедицияЗаказчик"			, "ДокументСВЭкспедицияЗаказчик");
	МассивКонвертируемыхРеквизитов.Вставить("ЭкспедицияДоговор"				, "ДокументСВЭкспедицияДоговор");
	Возврат МассивКонвертируемыхРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДокУчСист_Реквизит_СопоставитьНажатие(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	ОбъектДокУчСистПуть = "ЭтаФорма." + СтрЗаменить(ИмяЭлемента, "_Сопоставить", "");
	ЗначениеОбъектДокУчСист = Вычислить(ОбъектДокУчСистПуть);
	
	ОткрытьФормуПодбораСущностиЛогистика(ЗначениеОбъектДокУчСист, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)
	
	ПараметрыФормыПоиска = Новый Структура;
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);
	
	Если Элемент.Имя = "ДокУчСист_Грузоотправитель_Сопоставить"
		ИЛИ Элемент.Имя = "ДокУчСист_Перевозчик_Сопоставить"
		ИЛИ Элемент.Имя = "ДокУчСист_Грузополучатель_Сопоставить"
		ИЛИ Элемент.Имя = "ДокУчСист_ЭкспедицияЗаказчик_Сопоставить"
		Тогда 
		
		ИмяСущности = "КонтурЛогистика_ОрганизацииДиадок";
		
	ИначеЕсли Элемент.Имя = "ДокУчСист_МестоПогрузки_Сопоставить"
		ИЛИ Элемент.Имя = "ДокУчСист_МестоДоставки_Сопоставить"
		Тогда
		
		ИмяСущности = "КонтурЛогистика_ПунктыМаршрута";
		
	ИначеЕсли Элемент.Имя = "ДокУчСист_ТранспортноеСредство_Сопоставить"
		ИЛИ Элемент.Имя = "ДокУчСист_Прицеп_Сопоставить"
		Тогда
		
		ИмяСущности = "КонтурЛогистика_ТранспортныеСредства";
		
	ИначеЕсли Элемент.Имя = "ДокУчСист_ПогрузкаСотрудник_Сопоставить"
		ИЛИ Элемент.Имя = "ДокУчСист_Водитель_Сопоставить"
		Тогда
		
		ИмяСущности = "КонтурЛогистика_Сотрудники";
		
	ИначеЕсли Элемент.Имя = "ДокУчСист_ЭкспедицияДоговор_Сопоставить"
		Тогда
		
		ИмяСущности = "КонтурЛогистика_Договоры";
		
	Иначе
		
		ВызватьИсключение "не реализовано";
		
	КонецЕсли;
	
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник." + ИмяСущности + ".ФормаВыбора",
			ПараметрыФормыПоиска,
			ЭтаФорма,
			ЭтаФорма,
			"ОбработчикВыбораСопоставленияРеквизитаДокумента",
			ПараметрыОбработчика);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСопоставленияРеквизитаДокумента(ВыбранноеЗначение, ДопПараметры) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда 
		
		// Выполнить переконвертацию или присваивание
		ПовторноСконвертироватьРеквизит(ДопПараметры.ИмяЭлементаФормы);
		
		ПолностьюОбновитьПредставлениеДанных();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПовторноСконвертироватьРеквизит(ИмяЭлементаФормы)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	ПерезаполнитьЭТРН = Ложь;
	
	ИмяРеквизита = СтрЗаменить(ИмяЭлементаФормы, "ДокУчСист_", "");
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "_Сопоставить", "");
	
	// надо понять, требуется ли переконвертировать ЭТРН или надо конвертнуть только титул	
	СоотвРеквизита = СоответствиеКонвертируемыхРеквизитовИзДокУчСист().Получить(ИмяРеквизита);
	Если СоотвРеквизита <> Неопределено Тогда 
		Если Найти(СоотвРеквизита, "ДокументСВ") Тогда 
			ПерезаполнитьЭТРН = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура("ДокументОснование, ТипЛогистика, ПерезаполнитьГлавныйДокументЕслиСуществует", Объект.ДокументОснование, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, ПерезаполнитьЭТРН);
	ДокОбъект.Заполнить(ДанныеЗаполнения);
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭТРН()
	
	ДокЭТРН = Объект.ДокументСВ;
	Если ЗначениеЗаполнено(ДокЭТРН) Тогда 
		ДокЭТРНОбъект = ДокЭТРН.ПолучитьОбъект();
		ДокЭТРНОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		И ЗначениеЗаполнено(Объект.ДокументОснование)
		И (ЗавершениеРаботы = Неопределено Или Не ЗавершениеРаботы) Тогда
		
		УдалитьЭТРН();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура МаркировкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекИдентификаторСтрокиТовара(Знач НоваяСтрока, Знач Элемент)
	
	Перем ТекТовар;
	
	Если НоваяСтрока Тогда 
		
		ТекТовар = Элементы.Товары.ТекущиеДанные;
		
		Элемент.ТекущиеДанные.ИдентификаторСтрокиТоваров = ТекТовар.ИдентификаторСтроки;
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеВодителиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеВодителиПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВремяУбытияПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТелефоныПереадресующегоПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТелефоныПереадресующегоПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ИнициаторПереадресацииПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура АктыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Отметки.ТекущиеДанные = Неопределено Тогда 
		
		Отказ = Истина;
		Сообщить("Сначала добавьте Отметку, к которой будет относиться акт");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		
	Если Элементы.Отметки.ТекущиеДанные = Неопределено Тогда 
		
		Отказ = Истина;
		Сообщить("Сначала добавьте Отметку, к которой будет относиться акт");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АктыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда 
		
		ТекОтметка = Элементы.Отметки.ТекущиеДанные;
		
		Если ТекОтметка <> Неопределено Тогда 
			
			Элемент.ТекущиеДанные.ИдентификаторСтрокиОтметки = ТекОтметка.ИдентификаторСтроки;
			Элемент.ТекущиеДанные.АктДата = ТекущаяДата();
			Элемент.ТекущиеДанные.АктНаименование = "Акт";
			
		КонецЕсли
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда 
		
		ТекОтметка = Элементы.Отметки.ТекущиеДанные;
		
		Если ТекОтметка <> Неопределено Тогда 
			
			Элемент.ТекущиеДанные.ИдентификаторСтрокиОтметки = ТекОтметка.ИдентификаторСтроки;
			
		КонецЕсли
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		
		Элементы.Акты.ОтборСтрок 			= Неопределено;
		Элементы.Штрафы.ОтборСтрок 			= Неопределено;
		
	Иначе
		
		Элементы.Акты.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки", Элемент.ТекущиеДанные.ИдентификаторСтроки);    
		Элементы.Штрафы.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки", Элемент.ТекущиеДанные.ИдентификаторСтроки);    
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтметкиДобавить(Команда)
	
	НоваяСтрока = Объект.ОтметкиГрузоотправителя.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);	
	НоваяСтрока.ДатаИВремяОтметки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ТекущийМоментВремени();
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиСкопировать(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПутевойЛистСрокДействияПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура МестоПогрузкиПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура МестоВыгрузкиПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПрицепПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОтвЛицоГОПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОтвЛицоПВПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОтвЛицоГППриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПлотностьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанные.Плотность = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОкруглитьПлотность(ТекущиеДанные.Плотность);
	
КонецПроцедуры
