&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("УказатьКлючАПИ", УказатьКлючАПИ);
	Параметры.Свойство("УказатьПодразделениеОтправитель", УказатьПодразделениеОтправитель);
	Параметры.Свойство("УказатьПодразделениеПолучатель", УказатьПодразделениеПолучатель);
	
	КлючОшибки = Параметры.КлючОшибки;
	
	ИспользоватьОтправкуВТелеграм = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
	ИспользоватьОтправкуНаПочту = НастройкиОтправкиПочтыЗаполнены();
	ЕстьДоступКНастройкам = (КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		Или РольДоступна("КонтурЛогистика_УправлениеОрганизациями"));
	РежимАвторизации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РежимАвторизации");
	АвторизацияПоOIDC = (РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow);
	
	ДоступныйФункционал = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПолучитьДоступныйФункционал(Объект);
	ДоступнаТрН = ДоступныйФункционал.ТрН;
	ДоступенПЛ	= ДоступныйФункционал.ПЛ;
	
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
	// +++ КонтурЛогистика_НастройкиКонвертацииСправочников
	
	КонтурЛогистика_КонвертацияСервер.НастройкиКонвертацииСправочников_ПриСозданииНаСервере(
		ЭтаФорма, "КонтурЛогистика_ОрганизацииДиадок", ЭтаФорма, Элементы.Группа2);
		
	// --- КонтурЛогистика_НастройкиКонвертацииСправочников
	
	// Определяем использованность каналов отправки
	Элементы.ГруппаИспользоватьОтправкуВТелеграм.Видимость =
		Не Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
	Элементы.ГруппаИспользоватьОтправкуНаПочту.Видимость =
		Не КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ПроставитьНазваниеРегиона();
	
	УстановитьВидимостьСвойствЛогистики();
	
	ИнициализироватьСервисФизическихЛиц();
	
	ОбновитьГруппуАвторизацииНаПортале();
	
	АктуальностьЛентыСобытийДиадок = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗначениеНастройки(
			Объект.Ссылка, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадок);
	АктуальностьЛентыСобытийДиадокДата = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗначениеНастройки(
			Объект.Ссылка, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадокДата);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ИзмениласьРоль = ИзмениласьРоль(ТекущийОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОтправитьМетрикуЗаписи();
	
	Оповестить("КонтурЛогистика_ПерепроверитьДокумент");
	
	Если ИзмениласьРоль = Истина Тогда 
		
		Оповестить("КонтурЛогистика_ИзмениласьРольОрганизации", Объект.Ссылка, "КонтурЛогистика_ОрганизацииДиадок.ФормаЭлемента");
		
	КонецЕсли;
	
	Если ТребуетсяОбновитьПовторноИспользуемыеЗначения Тогда
		ОбновитьПовторноИспользуемыеЗначения();
		ТребуетсяОбновитьПовторноИспользуемыеЗначения = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИзмениласьРоль(ОрганизацияОбъект)
	
	МассивПроверяемыхРеквизитов = Новый Массив;
	
	МассивПроверяемыхРеквизитов.Добавить("Грузоотправитель");
	МассивПроверяемыхРеквизитов.Добавить("Перевозчик");
	МассивПроверяемыхРеквизитов.Добавить("Грузополучатель");
	МассивПроверяемыхРеквизитов.Добавить("Оформитель");
	МассивПроверяемыхРеквизитов.Добавить("Медик");
	МассивПроверяемыхРеквизитов.Добавить("ТехОсмотр");
	МассивПроверяемыхРеквизитов.Добавить("Одометр");
	
	Для Каждого Реквизит Из МассивПроверяемыхРеквизитов Цикл
		
		Если ОрганизацияОбъект.Ссылка[Реквизит] <> ОрганизацияОбъект[Реквизит] Тогда
			Возврат Истина;			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьСвойствЛогистики()
	
	// индикатор наличия в сервисе выводим только если введен хотя бы 1 апикей (иначе мы никак не можем вычитать значение индикатора и он будет врать что ложь)
	ТочноеСовпадение = Ложь;
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
	Если ПараметрыСервиса.АвторизацияВыполнена Тогда
		Элементы.ГруппаЕстьВЛогистике.Видимость = Истина;
	Иначе
		Элементы.ГруппаЕстьВЛогистике.Видимость = Ложь;
	КонецЕсли;
	
	// статусы прод/тест если есть в логистике
	Элементы.ГруппаБойТест.Видимость 			= Объект.ЕстьВСервисеЛогистика;
	
	Если Объект.ЕстьВСервисеЛогистика Тогда
		Элементы.ЕстьВСервисеЛогистика.Подсказка = "Есть в сервисе Логистика, может обмениваться ЭПД";
	Иначе
		Элементы.ЕстьВСервисеЛогистика.Подсказка = "Готов к началу работы в сервисе";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроставитьНазваниеРегиона()

	ТаблицаРегионов = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТаблицуРегионовРФ();
	Если ЗначениеЗаполнено(Объект.АдресRegion) Тогда 
		НайденнаяРасшифровка = ТаблицаРегионов.Найти(Объект.АдресRegion, "Код");
		Если НайденнаяРасшифровка<> Неопределено Тогда 
			ИмяРегиона = НайденнаяРасшифровка.Наименование;
		Иначе
			ИмяРегиона = "<неизвестный регион>";
		КонецЕсли;
			
	Иначе
		ИмяРегиона = "";
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСвязанныеОбъектыКонтрагентов" Тогда
		
		ОбновитьСвязанныеОбъектыКонтрагентов();
		
	ИначеЕсли ИмяСобытия = "ОбновитьКонтрагентовОрганизации" Или ИмяСобытия = "КонтурЛогистика_ОбновитьОрганизациюДиадок" Тогда
		
		ЭтаФорма.Прочитать();
		ПоказатьСтатусОтправкиПолученияДокументов();
		Элементы.КонтрагентыДинСписок.Обновить();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" Тогда
		
		Прочитать();
		ОбновитьВидимостьДоступностьГраниц();
		
	ИначеЕсли ИмяСобытия = "ИзменениеОбщейНастройки"
		И Параметр = "ИспользоватьОтправкуВТелеграм" Тогда
		
		ИспользоватьОтправкуВТелеграм = ЗначениеОбщейНастройки("ИспользоватьОтправкуВТелеграм");
		УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
		ОбновитьВидимостьГруппыТелеграм();
		
		Если ЗначениеЗаполнено(Объект.ТелефонУведомленияОшибокРоботов) Тогда
			ПроверитьРегистрациюТелефонаУведомленияОшибокРоботовТелеграм();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзменениеНастройкиУчетнойЗаписиЭлектроннойПочты" Тогда
		
		ИспользоватьОтправкуНаПочту = НастройкиОтправкиПочтыЗаполнены();
		УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
		ОбновитьВидимостьГруппыТелеграм();
		
	ИначеЕсли ИмяСобытия = "ЗавершениеФоновогоЗадания"		
		И Параметр.Свойство("КлючФЗ")
		И Параметр.КлючФЗ = "Синхронизировать контрагентов организации" Тогда
		
		ЭтаФорма.Прочитать();
		ПоказатьСтатусОтправкиПолученияДокументов();
		Элементы.КонтрагентыДинСписок.Обновить();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФизическиеЛица" Тогда		
		Элементы.ФизическиеЛица.Обновить();
		УстановитьВидимостьИПараметрыФизическихЛиц();
	КонецЕсли;
	
	КонтурЛогистика_КонвертацияКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьДанныеДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//УстановитьВидимостьДоступностьЭлементов();
	Если ЗначениеЗаполнено(КлючОшибки) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы[КлючОшибки];
	Иначе
		
		Если ЗначениеЗаполнено(Объект.АдресZipCode) И ЗначениеЗаполнено(Объект.АдресRegion) Тогда 
			Элементы.СтраницыАдрес.ТекущаяСтраница = Элементы.СтраницаКладр;
		КонецЕсли;
		
	КонецЕсли;
	
	Если УказатьКлючАПИ Тогда
		УстановитьКлючАПИ();
	КонецЕсли;
	
	Если УказатьПодразделениеОтправитель
		Или УказатьПодразделениеПолучатель Тогда
		
		УказатьПодразделениеПЛ();
	КонецЕсли;
	
	ЧитатьЛентуДиадок = ПолучитьЗначениеНастройки(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуДиадок"));
	ЧитатьЛентуЛогистики = ПолучитьЗначениеНастройки(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуЛогистики"));
		
	ПоказатьСтатусОтправкиПолученияДокументов();
	
	ОбновитьВидимостьДоступностьГраниц();
	ОбновитьВидимостьГруппыТелеграм();
	ОбновитьВидимостьФильтраПоИнфоПолям();
	ОбновитьВидимостьАвторизации();
	
	Если ИспользоватьОтправкуВТелеграм Тогда
		Если ЗначениеЗаполнено(Объект.ТелефонУведомленияОшибокРоботов) Тогда
			ПроверитьРегистрациюТелефонаУведомленияОшибокРоботовТелеграм();
		КонецЕсли;
	КонецЕсли;
	
	Если (Не Объект.ЕстьВСервисеЛогистика
			Или Не Объект.ПродуктивТрн
			Или Не Объект.ПродуктивЭпл)
		И ЗначениеЗаполнено(Объект.ИНН) Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикАвтообновлениеИзЛогистики", 0.1, Истина);
		
	КонецЕсли;
	
	Если АвторизацияПоOIDC И Объект.Наш И Не АвторизацияВыполнена Тогда
		// Откроем авторизацию
		ПодключитьОбработчикОжидания("ВыполнитьАвторизациюНаПорталеПриОткрытии", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикАвтообновлениеИзЛогистики()
	
	ОбновитьИзЛогистикиСервер();
	Прочитать();
	УстановитьВидимостьСвойствЛогистики();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИзЛогистикиСервер()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Объект.Ссылка);
	Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.СинхронизироватьИзСервисаЛогистика();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступностьГраниц()
	
	ЧитатьЛентуДиадок = ПолучитьЗначениеНастройки(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуДиадок"));
	ЧитатьЛентуЛогистики = ПолучитьЗначениеНастройки(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуЛогистики"));
	ЕстьКлючАПИЛогистики = ЕстьКлючАПИЛогистики();
	
	Элементы.ГруппаГраницаСинхронизацииДиадок.Видимость = ЧитатьЛентуДиадок;
	Элементы.ГруппаГраницаСинхронизацииЛогистики.Видимость = (ЕстьКлючАПИЛогистики Или АвторизацияПоOIDC) И ЧитатьЛентуЛогистики;
	Элементы.ГруппаУстановкаГраницыОбщая.Видимость = (ЕстьКлючАПИЛогистики Или АвторизацияПоOIDC) И ЧитатьЛентуЛогистики И ЧитатьЛентуДиадок;
	Элементы.ГруппаОсобенностиНашихОрганизаций.Видимость = Объект.Наш И (ЧитатьЛентуЛогистики Или ЧитатьЛентуДиадок);
	
	Элементы.ЧитатьЛентуДиадокФлажекВыкл.Видимость = Не ЧитатьЛентуДиадок;
	Элементы.ЧитатьЛентуДиадокФлажекВкл.Видимость = ЧитатьЛентуДиадок;
	Элементы.ЧитатьЛентуЛогистикиФлажекВыкл.Видимость = Не ЧитатьЛентуЛогистики;
	Элементы.ЧитатьЛентуЛогистикиФлажекВкл.Видимость = ЧитатьЛентуЛогистики;
		
	ВсеДатыГраницСинхронизацииЛогистика = Новый Массив;
		
	Если ДоступнаТрН Тогда		
		ДобавитьДатуГраницыСинхронизацииЛогистика(ВсеДатыГраницСинхронизацииЛогистика,
												  ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДата"));
	КонецЕсли;
	
	Если ДоступенПЛ Тогда
		ДобавитьДатуГраницыСинхронизацииЛогистика(ВсеДатыГраницСинхронизацииЛогистика,
												  ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДатаПЛ"));
	КонецЕсли;
	
	ДатаГраницыСинхронизацииЛогистика = ВыбратьМинДатуГраницыСинхронизацииЛогистика(ВсеДатыГраницСинхронизацииЛогистика);
			
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДатуГраницыСинхронизацииЛогистика(ВсеДатыГраницСинхронизацииЛогистика, НастройкаАктуальностьЛентыСобытийДата)
	
	ОчереднаяДатаГраницыСинхронизацииЛогистика = ПолучитьЗначениеНастройки(НастройкаАктуальностьЛентыСобытийДата);
	Если ОчереднаяДатаГраницыСинхронизацииЛогистика = Неопределено Тогда
		ОчереднаяДатаГраницыСинхронизацииЛогистика = Дата(1,1,1);
	КонецЕсли;
	
	ВсеДатыГраницСинхронизацииЛогистика.Добавить(ОчереднаяДатаГраницыСинхронизацииЛогистика);	
	
КонецПроцедуры

&НаКлиенте
Функция ВыбратьМинДатуГраницыСинхронизацииЛогистика(ВсеДатыГраницСинхронизацииЛогистика)
	
	МинДатаГраницыСинхронизацииЛогистика = Дата(1,1,1);
	
	Для Каждого ОчереднаяДатаГраницыСинхронизацииЛогистика Из ВсеДатыГраницСинхронизацииЛогистика Цикл
		
		Если МинДатаГраницыСинхронизацииЛогистика = Дата(1,1,1) Тогда
			МинДатаГраницыСинхронизацииЛогистика = ОчереднаяДатаГраницыСинхронизацииЛогистика;
		ИначеЕсли ОчереднаяДатаГраницыСинхронизацииЛогистика < МинДатаГраницыСинхронизацииЛогистика Тогда
			МинДатаГраницыСинхронизацииЛогистика = ОчереднаяДатаГраницыСинхронизацииЛогистика;
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат МинДатаГраницыСинхронизацииЛогистика;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьМетрикуЗаписи()
	
	// общепродуктовая метрика настройки организации (сейчас считаем что настройка = выбрана роль у "нашей" организации и есть соответствие)
	Если Объект.Наш 
		И Объект.СвязанныеОбъекты.Количество() > 0
		И (Объект.Грузоотправитель
		ИЛИ Объект.Перевозчик
		ИЛИ Объект.Грузополучатель
		ИЛИ Объект.Оформитель
		ИЛИ Объект.Медик
		ИЛИ Объект.ТехОсмотр
		ИЛИ Объект.Одометр) Тогда
		
		ОтправитьМетрикуЗаписиСервер();
		                                 
		ЭтаФорма.Прочитать();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтправитьМетрикуЗаписиСервер()
	
	КонтурЛогистика_Метрика.Общепродуктовая_ОтправитьВыполнениеНастройки(Объект.Ссылка, "КарточкаОрганизации");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКлючАПИ()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаНастройки;
	
	НастройкаКлючаАПИ = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey");
	ТекстЗаголовка = "Введите значение настройки: " + НастройкаКлючаАПИ;
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьВводСтроки_КонтурЛогистика("", ТекстЗаголовка, Ложь, ЭтаФорма, "УстановитьКлючАПИЗавершение");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКлючАПИЗавершение(НовоеЗначение, ДополнительныеПараметры) Экспорт
	
	Если НовоеЗначение = Неопределено Тогда	// Нажали отмена
		Возврат;
	КонецЕсли;
	
	НастройкаКлючаАПИ = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey");
	УстановитьЗначениеНастройки(НастройкаКлючаАПИ, НовоеЗначение);
	
	Записать();
	
	Элементы.НастройкиДинСписок.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьПодразделениеПЛ()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаНастройки;
	
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_ПодразделенияДиадок.Форма.ФормаВыбора";
	ЗначениеОтбора = Новый Структура("Организация", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыФормы, ЭтаФорма, ЭтаФорма,
		"УказатьПодразделениеЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьПодразделениеЗавершение(НовоеЗначение, ДополнительныеПараметры) Экспорт
	
	Если НовоеЗначение = Неопределено Тогда	// Нажали отмена
		Возврат;
	КонецЕсли;
	
	Если УказатьПодразделениеОтправитель Тогда
		НастройкаПодразделение = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеОтправительПутевогоЛиста");
	Иначе
		НастройкаПодразделение = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеПолучательПутевогоЛиста");
	КонецЕсли;
	
	УстановитьЗначениеНастройки(НастройкаПодразделение, НовоеЗначение);
	
	Записать();
	
	Элементы.НастройкиДинСписок.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтатусОтправкиПолученияДокументов()
	
	Статус = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПредставлениеСтатусаОтправкиПолученияДокументов(Объект.Sociability);
	Если ЗначениеЗаполнено(Статус) Тогда
		Элементы.ТекстСтатусаОтправкиПолученияДокументов.Заголовок = Статус;
	КонецЕсли;
	Элементы.ТекстСтатусаОтправкиПолученияДокументов.Видимость = ЗначениеЗаполнено(Статус);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЛицаПриИзменении(Элемент)
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступностьЭлементов(Форма)

	Форма.Элементы.ГруппаРеквизитыИП.Видимость = 
		Форма.Объект.ТипЛица = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛиц.ФизЛицо")
			ИЛИ
		Форма.Объект.ТипЛица = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛиц.ИП");
		
		
	Форма.Элементы.ГруппаОсобенностиНашихОрганизаций.Видимость 	= Форма.Объект.Наш;	
	
	Форма.Элементы.ДатаГраницыСинхронизации.Видимость 			= Истина;
	Форма.Элементы.ДатаГраницыСинхронизацииВвод.Видимость 		= Ложь;
	
	ЭтоИностранный = 
		Форма.Объект.ТипЛица = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛиц.ИностранныйФизЛицо")
			ИЛИ
		Форма.Объект.ТипЛица = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛиц.ИностранныйЮрЛицо");
		
	Форма.Элементы.ГруппаИностранный.Видимость = ЭтоИностранный;
	Форма.Элементы.СтраницаАдресИностранный.Видимость = ЭтоИностранный;
	
	Форма.Элементы.СтраницаПредставление.Видимость = НЕ ЭтоИностранный;
	Форма.Элементы.СтраницаКладр.Видимость = НЕ ЭтоИностранный;
	Форма.Элементы.Группа7.Видимость = НЕ ЭтоИностранный;
	Форма.Элементы.ОГРН.Видимость = НЕ ЭтоИностранный;
	
	Форма.Элементы.ГруппаИнфоОСопоставлении.Видимость = Форма.Параметры.Свойство("ПоказатьИнфоОСопоставлении");
	
	Форма.Элементы.ГруппаТелефонУведомленияОшибокРоботов.Видимость = Форма.ИспользоватьОтправкуВТелеграм;
	Форма.Элементы.ГруппаНастройкиТелеграм.Видимость = Не Форма.ИспользоватьОтправкуВТелеграм;
	
	Форма.Элементы.АдресЭлектроннойПочтыУведомленияОшибокРоботов.Видимость = Форма.ИспользоватьОтправкуНаПочту;
	Форма.Элементы.ГруппаНастройкиПочты.Видимость = Не Форма.ИспользоватьОтправкуНаПочту;
	
	Форма.Элементы.ГруппаНастройки.ТолькоПросмотр = Не Форма.ЕстьДоступКНастройкам;
	Форма.Элементы.НастройкиДинСписок.Доступность = Форма.ЕстьДоступКНастройкам;
	Форма.Элементы.СтраницаТехПоля.ТолькоПросмотр = Не Форма.ЕстьДоступКНастройкам;
	Форма.Элементы.ГруппаОсобенностиНашихОрганизаций.Доступность = Форма.ЕстьДоступКНастройкам;
	
	Форма.Элементы.ГруппаФильтрПоИнфоПолям.Видимость = Форма.Объект.Наш;
	Форма.Элементы.ГруппаЧитатьЛенту.Видимость = Форма.Объект.Наш;
	
	Форма.Элементы.ГруппаСвидетельствоИП.Видимость = Форма.Объект.ТипЛица = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛиц.ИП");
	
	Форма.Элементы.ТехОсмотр.Видимость = Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДействуетФорматЭПЛ502();
	Форма.Элементы.Одометр.Видимость = Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДействуетФорматЭПЛ502();
		
КонецПроцедуры

&НаКлиенте
Процедура НашПриИзменении(Элемент)
	
	Если Не ПроверитьЗаполнение() Тогда
		Объект.Наш = Не Объект.Наш;
		Возврат;
	КонецЕсли;
	
	Если Объект.Наш Тогда
		Если АвторизацияПоOIDC Тогда
			Если Не ЧитатьЛентуДиадок Тогда
				ЧитатьЛентуДиадок = Истина;
				УстановитьЗначениеНастройкиЧитатьЛентуДиадок();
			КонецЕсли;
			
			Если Не ЧитатьЛентуЛогистики Тогда
				АктуальностьЛентыСобытийДата = ПолучитьЗначениеНастройки(ПредопределенноеЗначение(
					"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДата"));
				АктуальностьЛентыСобытий = ПолучитьЗначениеНастройки(ПредопределенноеЗначение(
					"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытий"));
				
				Если Не ЗначениеЗаполнено(АктуальностьЛентыСобытийДата)
					И Не ЗначениеЗаполнено(АктуальностьЛентыСобытий) Тогда
					
					ЧитатьЛентуЛогистики = Истина;
					УстановитьЗначениеНастройкиЧитатьЛентуЛогистики();
				КонецЕсли;
			КонецЕсли;
		Иначе
			ОбработатьПриВключенииНаш();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
	ОбновитьВидимостьАвторизации();
	
	Если Объект.Наш И АвторизацияПоOIDC И Не АвторизацияВыполнена Тогда
		ВыполнитьАвторизациюНаПортале(Истина);
	КонецЕсли;
	
	Если Не Объект.Наш И АвторизацияПоOIDC И АвторизацияВыполнена Тогда
		УдалитьАвторизациюНаПортале();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПриВключенииНаш()
	
	Если Не ЗначениеЗаполнено(АктуальностьЛентыСобытийДиадокДата) И Не ЧитатьЛентуДиадок Тогда
		ЧитатьЛентуДиадок = Истина;
		УстановитьЗначениеНастройкиЧитатьЛентуДиадок();
	КонецЕсли;
	
	Если Не ЧитатьЛентуЛогистики Тогда
		
		АктуальностьЛентыСобытийДата = ПолучитьЗначениеНастройки(ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДата"));
		АктуальностьЛентыСобытий = ПолучитьЗначениеНастройки(ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытий"));
		
		Если Не ЗначениеЗаполнено(АктуальностьЛентыСобытийДата) 
			И Не ЗначениеЗаполнено(АктуальностьЛентыСобытий)
			И (ЕстьКлючАПИЛогистики()
				Или АвторизацияПоOIDC) Тогда
			
			ЧитатьЛентуЛогистики = Истина;
			УстановитьЗначениеНастройкиЧитатьЛентуЛогистики();
		КонецЕсли;
		
	КонецЕсли;
	
	Записать();
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаНастройки;
	
	ОбновитьИнформациюИзДиадока();
	
	Модифицированность = Ложь;
	
	Прочитать();
	
	ИнициализироватьСервисФизическихЛиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаГраницыСинхронизацииВводПриИзменении(Элемент)
	
	УстановитьЗначениеНастройкиСервер(Объект.Ссылка, 
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадок"), "");
	УстановитьЗначениеНастройкиСервер(Объект.Ссылка, 
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадокДата"), АктуальностьЛентыСобытийДиадокДата);	
	
	Элементы.AfterIndexKey.Видимость = Ложь;
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура AfterIndexKeyПриИзменении(Элемент)
	
	УстановитьЗначениеНастройкиСервер(Объект.Ссылка, 
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадок"), АктуальностьЛентыСобытийДиадок);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаГраницыСинхронизацииЛогистикаВводПриИзменении(Элемент)
	
	Элементы.ДатаГраницыСинхронизацииЛогистика.Видимость = Истина;
	Элементы.ДатаГраницыСинхронизацииЛогистикаВвод.Видимость = Ложь;
	
	Если ДоступнаТрН Тогда
	
		НастройкаАктуальностьЛентыСобытийДата = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДата");
		УстановитьЗначениеНастройки(НастройкаАктуальностьЛентыСобытийДата, ДатаГраницыСинхронизацииЛогистика);
		
		НастройкаАктуальностьЛентыСобытий = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытий");
		УстановитьЗначениеНастройки(НастройкаАктуальностьЛентыСобытий, "");
		
	КонецЕсли;
	
	Если ДоступенПЛ Тогда
		
		НастройкаАктуальностьЛентыСобытийДатаПЛ = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДатаПЛ");
		УстановитьЗначениеНастройки(НастройкаАктуальностьЛентыСобытийДатаПЛ, ДатаГраницыСинхронизацииЛогистика);
		
		НастройкаАктуальностьЛентыСобытийПЛ = ПредопределенноеЗначение(
			"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийПЛ");
		УстановитьЗначениеНастройки(НастройкаАктуальностьЛентыСобытийПЛ, "");
		
	КонецЕсли;
	
	Записать();
	
	Элементы.НастройкиДинСписок.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАктуальность(Команда)
	
	Элементы.ДатаГраницыСинхронизации.Видимость = Ложь;
	Элементы.ДатаГраницыСинхронизацииВвод.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАктуальностьЛогистика(Команда)
	
	Элементы.ДатаГраницыСинхронизацииЛогистика.Видимость = Ложь;
	Элементы.ДатаГраницыСинхронизацииЛогистикаВвод.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьAfterIndexKey(Команда)
	Элементы.AfterIndexKey.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеДинамическихСписков()

	//Подразделения.Параметры.УстановитьЗначениеПараметра("OrgId", Объект.OrgId);	
	
	ЭлементОтбора = Подразделения.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("IDВладелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.OrgId;
	
	НастройкиДинСписок.Параметры.УстановитьЗначениеПараметра("ОрганизацияСсылка", Объект.Ссылка);
	КонтрагентыДинСписок.Параметры.УстановитьЗначениеПараметра("ОрганизацияСсылка", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПередУдалением(Элемент, Отказ)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюИзДиадока()
	
	Состояние("Выполняется обновление данных организации из Диадока", 20, "обновление организации данными из Диадок", БиблиотекаКартинок.КонтурЛогистика_Загрузить);
	ОбновитьИнформациюИзДиадокаНаСервере();
			
	Состояние("Обновление данных заверщено", 100, "обновление организации данными из Диадок завершено", БиблиотекаКартинок.КонтурЛогистика_Загрузить);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюИзДиадокаНаСервере()
	
	Попытка
		
		АктуализироватьКонтрагентовИзДиадокаСервер();
		
		Справочники.КонтурЛогистика_ОрганизацииДиадок.ОбновитьСвязанныеОбъекты(Объект.Ссылка);
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось обновить информацию из Диадока: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязнанныеОрганизацииУКонтрагентов()
		
	Для Каждого СтрокаКонтрагент Из Объект.Контрагенты Цикл 
		
		Если ЗначениеЗаполнено(СтрокаКонтрагент.Контрагент.СвязанныеОбъекты) Тогда 
			
			Для Каждого Строка Из СтрокаКонтрагент.Контрагент.СвязанныеОбъекты Цикл 
				
				СтрокаКонтрагент.ОрганизацииВБазе.Добавить(Строка.СвязанныйОбъект);
				
			КонецЦикла;	
			
		Иначе
			
			СтрокаКонтрагент.ТребуемоеДействие 		= "Сопоставить";
			СтрокаКонтрагент.СопоставленКартинка 	= 1;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура КонтрагентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элемент.ТекущиеДанные;
	КонтрагентСсылка =  ТекСтрока.Контрагент;
	
	Если Поле.Имя = "КонтрагентыКонтрагент" 
		Или Поле.Имя = "КонтрагентыОрганизацииВБазе"
		Или Поле.Имя = "КонтрагентыТребуемоеДействие" Тогда 
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаЭлемента", 
			Новый Структура("Ключ", КонтрагентСсылка), 
			ЭтаФорма,
			ЭтаФорма,
			"ОбработчикПослеСопоставленияКонтрагентов");
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПослеСопоставленияКонтрагентов(Результат, ДопПараметры) Экспорт 

	Элементы.КонтрагентыДинСписок.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСвязанныеОбъектыКонтрагентов() 
	
	Для Каждого СтрокаКонтрагент Из Объект.Контрагенты Цикл
		ОбновитьСвязанныеОбъектыПоСтроке(СтрокаКонтрагент.Контрагент);
	КонецЦикла;
				
КонецПроцедуры

&НаСервере
Процедура ОбновитьСвязанныеОбъектыПоСтроке(КонтрагентСсылка)  
				
	нСтроки = Объект.Контрагенты.НайтиСтроки(Новый Структура("Контрагент", КонтрагентСсылка));
	
	Если нСтроки.Количество() Тогда 
		
		СтрокаКонтрагент = нСтроки[0];
		
		СтрокаКонтрагент.ОрганизацииВБазе.ЗагрузитьЗначения(КонтрагентСсылка.СвязанныеОбъекты.ВыгрузитьКолонку("СвязанныйОбъект"));
		
		Если Не СтрокаКонтрагент.ОрганизацииВБазе.Количество() Тогда 
			СтрокаКонтрагент.ТребуемоеДействие = "Сопоставить";
			СтрокаКонтрагент.СопоставленКартинка = 1;
		Иначе	
			СтрокаКонтрагент.ТребуемоеДействие = "";
			СтрокаКонтрагент.СопоставленКартинка = 0;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьКонтрагентов(Команда)
	
	АктуализироватьКонтрагентовИзДиадокаСервер();
	
	ПоказатьСтатусОтправкиПолученияДокументов();
			
КонецПроцедуры

&НаСервере
Процедура АктуализироватьКонтрагентовИзДиадокаСервер()
	
	Если Не Объект.Ссылка.Наш Тогда 
		Сообщить("Организация не отмечена как наша, контрагенты не загружены");
		Возврат
	КонецЕсли;
	
	Попытка
		
		Результат = Справочники.КонтурЛогистика_ОрганизацииДиадок.СинхронизироватьНастройкиОрганизации(Объект.Ссылка);
		
		Если Результат.Свойство("Sociability") Тогда
			Объект.Sociability = Результат.Sociability;	
		КонецЕсли;
						
	Исключение
		
		Сообщить("Неудача при вычитывании данных из Диадок по Организации: " + Объект.Ссылка + " - " + ОписаниеОшибки());
		
	КонецПопытки;
	
	МассивКонтрагентов = Новый Массив;
	
	Для Каждого СтрокаКонтрагент Из Объект.Контрагенты Цикл 
		
		МассивКонтрагентов.Добавить(СтрокаКонтрагент.Контрагент);
		
	КонецЦикла;
	
	Справочники.КонтурЛогистика_ОрганизацииДиадок.ОбновитьСвязанныеОбъекты(МассивКонтрагентов);
	
	ОбновитьСвязанныеОбъектыКонтрагентов();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНастройку_(Команда)
	
	ТекущиеДанные = Элементы.НастройкиДинСписок.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	текНастройка = ТекущиеДанные.Настройка;
	УдалитьНастройкуОрганизации(текНастройка);
	
	Элементы.НастройкиДинСписок.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНастройкуОрганизации(Настройка)

	РегистрыСведений.КонтурЛогистика_НастройкиОрганизаций.УдалитьНастройкуОрганизации(Объект.Ссылка, Настройка);

КонецПроцедуры


&НаСервере
Процедура УстановитьНастроку(Настройка)
	
	Справочники.КонтурЛогистика_ОрганизацииДиадок.УстановитьНастройку(Настройка, Объект.Ссылка, "");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДинСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЕстьДоступКНастройкам Тогда 
		ТекущиеДанные = Элементы.НастройкиДинСписок.ТекущиеДанные;
		
		Если Поле.Имя = "НастройкиДинСписокЗначениеНастройки" Тогда
			ИзменитьНастройку(ТекущиеДанные);
		КонецЕсли;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНастройку(ТекущиеДанные)
	
	ЗаполнятьПоказанияГСМВЭПЛ = ПредопределенноеЗначение(
		"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЗаполнятьПоказанияГСМВЭПЛ");
	РазрешитьВодителямВноситьПоказанияГСМ = ПредопределенноеЗначение(
		"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.РазрешитьВодителямВноситьПоказанияГСМ");
	
	Если ТипЗнч(ТекущиеДанные.Настройка) = Тип("ПеречислениеСсылка.КонтурЛогистика_НастройкиОрганизацийДиадок") Тогда
		ТипВыбораНастройки = ТипЗначенияВыбораПоНастройке(ТекущиеДанные.Настройка);
	Иначе
		ТипВыбораНастройки = Тип("Строка");
	КонецЕсли;
	
	Если ТекущиеДанные.Настройка = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey") Тогда
		
		ПараметрыФормы = Новый Структура("КлючАПИ", ТекущиеДанные.ЗначениеНастройки);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаВводаАпиКлюча", ПараметрыФормы, ЭтаФорма, ЭтаФорма,
			"ИзменениеНастройкиЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ТипВыбораНастройки = Тип("СправочникСсылка.КонтурЛогистика_ПодразделенияДиадок") Тогда
		
		ИмяФормыСправочника = "Справочник.КонтурЛогистика_ПодразделенияДиадок.Форма.ФормаВыбора";
		ЗначениеОтбора = Новый Структура("Организация", Объект.Ссылка);
		ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			ИмяФормыСправочника, ПараметрыФормы, ЭтаФорма, ЭтаФорма,
			"ИзменениеНастройкиЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ТекущиеДанные.Настройка = ЗаполнятьПоказанияГСМВЭПЛ
		Или ТекущиеДанные.Настройка = РазрешитьВодителямВноситьПоказанияГСМ
		Или ТипВыбораНастройки = Тип("Строка") Тогда
		
		ПараметрыРедактированияЗанчения = ПараметрыРедактированияЗанчения(ТекущиеДанные.Настройка);
		Если ТекущиеДанные.Настройка = ЗаполнятьПоказанияГСМВЭПЛ Тогда
			ПараметрыРедактированияЗанчения.Комментарий =
				"При включенной настройке будет проверка передачи показаний ГСМ на выезде в сервис Логистики при подписании П4 и П5";
			ТекстЗаголовка = Строка(Элементы.НастройкиДинСписок.ТекущиеДанные.Настройка);
		ИначеЕсли ТекущиеДанные.Настройка = РазрешитьВодителямВноситьПоказанияГСМ Тогда
			ПараметрыРедактированияЗанчения.Комментарий =
				"При включенной настройке водители получат возможность вносить показания ГСМ в мобильном приложении";
			ТекстЗаголовка = Строка(Элементы.НастройкиДинСписок.ТекущиеДанные.Настройка);
		Иначе
			ТекстЗаголовка = "Введите значение настройки: " + Элементы.НастройкиДинСписок.ТекущиеДанные.Настройка;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", ТекстЗаголовка);
		ПараметрыФормы.Вставить("ЗначениеСтрока", ТекущиеДанные.ЗначениеНастройки);
		ПараметрыФормы.Вставить("ЗначениеБулево", ТекущиеДанные.ЗначениеНастройки);
		ПараметрыФормы.Вставить("ТипВыбораНастройки", ТипВыбораНастройки);
		ПараметрыФормы.Вставить("ПараметрыРедактирования", ПараметрыРедактированияЗанчения);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаВводаЗначенияНастройки", ПараметрыФормы, ЭтаФорма, ЭтаФорма,
			"ИзменениеНастройкиЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ТипВыбораНастройки = Тип("Дата") Тогда
		
		ТекстЗаголовка = "Введите значение настройки: " + Элементы.НастройкиДинСписок.ТекущиеДанные.Настройка;
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьВводЗначения_КонтурЛогистика(
			ТекущиеДанные.ЗначениеНастройки, ТекстЗаголовка,Тип("Дата") , ЭтаФорма, "ИзменениеНастройкиЗавершение");
			
	ИначеЕсли ТипВыбораНастройки = Тип("Булево") Тогда
			
		ТекстЗаголовка = "Введите значение настройки: " + Элементы.НастройкиДинСписок.ТекущиеДанные.Настройка;
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьВводЗначения_КонтурЛогистика(
			ТекущиеДанные.ЗначениеНастройки, ТекстЗаголовка,Тип("Булево") , ЭтаФорма, "ИзменениеНастройкиЗавершение");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыРедактированияЗанчения(Настройка)
	
	Возврат Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПараметрыРедактированияЗанчения(Настройка)
	
КонецФункции

&НаКлиенте
Процедура ИзменениеНастройкиЗавершение(НовоеЗначение, ДополнительныеПараметры) Экспорт
	
	Если НовоеЗначение = Неопределено Тогда	// Нажали отмена
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.НастройкиДинСписок.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Настройка = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуЛогистики") 
		И Объект.Наш 
		И НовоеЗначение Тогда
		
		ApiKey = ПолучитьЗначениеНастройки(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey"));
		Если Не ЗначениеЗаполнено(ApiKey) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Не заполнен Logistics api key");
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТекущиеДанные.Настройка = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуДиадок") 
		И Объект.Наш
		И Не НовоеЗначение Тогда
		
		ИспользуетсяЗаказЗаявка = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЗаказЗаявка");
		ИспользуетсяЭкспедиторскаяРасписка = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЭкспедиторскаяРасписка");
		
		Если ИспользуетсяЗаказЗаявка Или ИспользуетсяЭкспедиторскаяРасписка Тогда
			
			ЧитатьЛентуДиадок = Не ЧитатьЛентуДиадок;
			
			ТекстВопроса = ТекстВопросаДляВыключенияЧтенияЛентыСобытийДиадок(ИспользуетсяЗаказЗаявка, ИспользуетсяЭкспедиторскаяРасписка);
			КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(ТекстВопроса, РежимДиалогаВопрос.ДаНет,
				,, ЭтаФорма,
				"ВыключениеНастройкиЧитатьЛентуДиадокЗавершение");
				
			Возврат;
				
		КонецЕсли;
		
	ИначеЕсли ТекущиеДанные.Настройка 
				= ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийСервисаФизическихЛицДата") Тогда
		Оповестить("ОбновитьРабочийСтол");				
	КонецЕсли;
	
	УстановитьЗначениеНастройки(ТекущиеДанные.Настройка, НовоеЗначение);
	
	Записать();
	
	Элементы.НастройкиДинСписок.Обновить();
	
	Если ТекущиеДанные.Настройка = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey") И Объект.Наш Тогда
		
		Если ЗначениеЗаполнено(НовоеЗначение) И Не ЧитатьЛентуЛогистики Тогда			
			ЧитатьЛентуЛогистики = Истина;
			УстановитьЗначениеНастройкиЧитатьЛентуЛогистики();
		ИначеЕсли Не ЗначениеЗаполнено(НовоеЗначение) И ЧитатьЛентуЛогистики Тогда	
			ЧитатьЛентуЛогистики = Ложь;
			УстановитьЗначениеНастройкиЧитатьЛентуЛогистики();
		КонецЕсли;
		
	КонецЕсли;
	
	РазрешитьВодителямВноситьПоказанияГСМ = ПредопределенноеЗначение(
		"Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.РазрешитьВодителямВноситьПоказанияГСМ");
	Если ТекущиеДанные.Настройка = РазрешитьВодителямВноситьПоказанияГСМ И Объект.Наш Тогда
		СохранитьНастройкиОрганизации();
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьГраниц();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеНастройки(Настройка, НовоеЗначение)
	
	УстановитьЗначениеНастройкиСервер(Объект.Ссылка, Настройка, НовоеЗначение);
	Элементы.НастройкиДинСписок.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОрганизации()
	
	КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.СохранитьНастройкиОрганизации(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеНастройкиСервер(Ссылка, Настройка, НовоеЗначение)
	
	Справочники.КонтурЛогистика_ОрганизацииДиадок.УстановитьНастройку(Ссылка, Настройка, НовоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНастройку(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьВводСтроки_КонтурЛогистика(
		"", "Введите имя настойки", Ложь, ЭтаФорма, "ДобавлениеНастройкиЗавершение");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНастройкиЗавершение(ИмяНастройки, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекЗначение = ПолучитьЗначениеНастройки(ИмяНастройки);
	Если ТекЗначение <> Неопределено Тогда 
		Сообщить("Настройка с именем """ + ИмяНастройки + """ уже есть");
		Возврат;
	КонецЕсли;
	
	УстановитьЗначениеНастройки(ИмяНастройки, "");
	
	Элементы.НастройкиДинСписок.Обновить();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗначениеНастройки(Настройка)
	
	Возврат ПолучитьЗначениеНастройкиСервер(Настройка, Объект.Ссылка);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеНастройкиСервер(Настройка, Ссылка)
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗначениеНастройки(Ссылка, Настройка)
	
КонецФункции

&НаСервереБезКонтекста
Функция ТипЗначенияВыбораПоНастройке(Настройка)
	
	Возврат Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ТипЗначенияВыбораПоНастройке(Настройка);
	
КонецФункции

&НаКлиенте
Процедура ВыбратьBoxID(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо записать карточку организации");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ИНН) Тогда
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "Необходимо заполнить ИНН";
		ПараметрыСообщения.ПутьКДанным  = "Объект.ИНН";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИНН", Объект.ИНН);
	ПараметрыФормы.Вставить("КПП", Объект.КПП);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаВыбораПоИННКПП",
		ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ВыбратьBoxIDЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьBoxIDЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОрганизацияСсылка = ЗаполнитьОрганизациюИзДанныхДиадока(Результат, Объект.Ссылка);
	
	Если ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
		Сообщить("Данные организации были обновлены.");
		Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьОрганизациюИзДанныхДиадока(ДанныеОднойОрганизации, ОрганизацияКЗаполнению)
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗаполнитьОрганизациюИзДанныхДиадока(ДанныеОднойОрганизации, ОрганизацияКЗаполнению);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСсылкуДДНастройки(Команда)
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок") Тогда
		СсылкаДиадок = "https://diadoc-staging.kontur.ru/" + Объект.ID + "/CompanyDetails";		
	Иначе
		СсылкаДиадок = "https://diadoc.kontur.ru/" + Объект.ID + "/CompanyDetails";
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		ЗапуститьПриложение(СсылкаДиадок);
	Иначе
		ПерейтиПоНавигационнойСсылке(СсылкаДиадок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыДинСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элемент.ТекущиеДанные;
	КонтрагентСсылка =  ТекСтрока.Контрагент;
	
	Если Поле.Имя = "КонтрагентыДинСписокКонтрагент" 
		Или Поле.Имя = "КонтрагентыДинСписокОрганизацииВБазе"
		Или Поле.Имя = "КонтрагентыДинСписокТребуемоеДействие" Тогда 
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаЭлемента", 
			Новый Структура("Ключ", КонтрагентСсылка), 
			ЭтаФорма,
			ЭтаФорма,
			"ОбработчикПослеСопоставленияКонтрагентов");
			
	ИначеЕсли Поле.Имя = "КонтрагентыДинСписокСтатус" Тогда
		
		ПараметрыФормы = Новый Структура("Отправитель, Получатель", Объект.Ссылка, ТекСтрока.Контрагент);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"ОбщаяФорма.КонтурЛогистика_ФормаДружбыКонтрагентов",
				Параметрыформы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактыПолучателейУведомленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Контекст", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ТипКонтакта", ТекущиеДанные.Тип);
	ПараметрыОткрытия.Вставить("ЗначениеКонтакта", ТекущиеДанные.Контакт);
	ПараметрыОткрытия.Вставить("ТрНЗамечанияОтВодителя", ТекущиеДанные.ТрНЗамечанияОтВодителя);
	ПараметрыОткрытия.Вставить("ТрНЗамечанияОтПеревозчика", ТекущиеДанные.ТрНЗамечанияОтПеревозчика);
	ПараметрыОткрытия.Вставить("ТрНОтказПВ", ТекущиеДанные.ТрНОтказПВ);
	ПараметрыОткрытия.Вставить("ТрНОтказГП", ТекущиеДанные.ТрНОтказГП);
	
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_ПунктыМаршрута.Форма.ФормаВыбораКонтакта";
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыОткрытия, ЭтаФорма, ЭтаФорма,
		"ИзменениеКонтактнойИнформацииЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонтактыПолучателейУведомлений(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед добавлением необходимо сохранить");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Контекст", Объект.Ссылка);
	
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_ПунктыМаршрута.Форма.ФормаВыбораКонтакта";
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыОткрытия, ЭтаФорма, ЭтаФорма,
		"ДобавлениеКонтактнойИнформацииЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеКонтактнойИнформацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Объект.КонтактыПолучателейУведомлений.Добавить();
	НоваяСтрока.Тип = Результат.ТипКонтакта;
	НоваяСтрока.Контакт = Результат.ЗначениеКонтакта;
	НоваяСтрока.ТрНЗамечанияОтВодителя = Результат.ТрНЗамечанияОтВодителя;
	НоваяСтрока.ТрНЗамечанияОтПеревозчика = Результат.ТрНЗамечанияОтПеревозчика;
	НоваяСтрока.ТрНОтказПВ = Результат.ТрНОтказПВ;
	НоваяСтрока.ТрНОтказГП = Результат.ТрНОтказГП;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеКонтактнойИнформацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные.Тип = Результат.ТипКонтакта;
	Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные.Контакт = Результат.ЗначениеКонтакта;
	Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные.ТрНЗамечанияОтВодителя = Результат.ТрНЗамечанияОтВодителя;
	Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные.ТрНЗамечанияОтПеревозчика = Результат.ТрНЗамечанияОтПеревозчика;
	Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные.ТрНОтказПВ = Результат.ТрНОтказПВ;
	Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные.ТрНОтказГП = Результат.ТрНОтказГП;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактыПолучателейУведомленийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// +++ КонтурЛогистика_НастройкиКонвертацииСправочников

&НаКлиенте
Процедура СоздатьНастройкуКонвертации(Элемент) Экспорт
	
	КонтурЛогистика_КонвертацияКлиент.СоздатьНастройкуКонвертации(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкеКонвертацииСправочника(Элемент) Экспорт 
	
	КонтурЛогистика_КонвертацияКлиент.ПерейтиКНастройкеКонвертацииСправочника(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если (ЗавершениеРаботы = Ложь Или ЗавершениеРаботы = Неопределено)
		И Не Объект.Ссылка.Пустая() Тогда
		
		Оповестить("ОбновитьСтартовыйПомошник", Объект.Ссылка);
		Оповестить("ОбновитьРабочийСтол", Объект.Ссылка);
		Оповестить("ОбновитьФормуМЧД", Объект.Ссылка);
		Оповестить("КонтурЛогистика_ОрганизацияЗаписана", Объект.Ссылка);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АдресRegionПриИзменении(Элемент)
	ПроставитьНазваниеРегиона();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКАВручную(Команда)
	
	ОткрытьФорму("Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаРучногоРедактирвоанияСпискаКонтрагентов",
					Новый Структура("Ключ", Объект.Ссылка),
					ЭтаФорма);
					
КонецПроцедуры

// --- КонтурЛогистика_НастройкиКонвертацииСправочников

&НаКлиенте
Процедура УстановитьГраницуАктуальностиВезде(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Записать();
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВыборДатыЗавершение", ЭтаФорма);
	ПоказатьВводДаты(Оповещение, ДатаГраницыСинхронизацииЛогистика, "Границ актуальности лент", ЧастиДаты.ДатаВремя);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДатыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	// Установим дату ленты АПИ Диадок
	АктуальностьЛентыСобытийДиадокДата = Результат;
	АктуальностьЛентыСобытийДиадок = "";
	Элементы.AfterIndexKey.Видимость = Ложь;
	
	Если ЕстьКлючАПИЛогистики() Или АвторизацияПоOIDC Тогда
		
		Если ДоступнаТрН Тогда
			
			// Очистим метку ленты
			УстановитьЗначениеНастройкиСервер(Объект.Ссылка,
				ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытий"), "");
			
			// Установим дату ленты АПИ ДД
			УстановитьЗначениеНастройкиСервер(Объект.Ссылка,
				ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДата"), Результат);
			
		КонецЕсли;
		
		Если ДоступенПЛ Тогда
			
			// Очистим метку ленты
			УстановитьЗначениеНастройкиСервер(Объект.Ссылка,
				ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийПЛ"), "");
			
			// Установим дату ленты АПИ Логистики
			УстановитьЗначениеНастройкиСервер(Объект.Ссылка,
				ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДатаПЛ"), Результат);
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьЗначениеНастройкиСервер(Объект.Ссылка, 
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадокДата"), Результат);
	
	ДатаГраницыСинхронизацииЛогистика = Результат;
	
	Записать();
	
	Элементы.НастройкиДинСписок.Обновить();
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьКлючАПИЛогистики()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Апикей = ПолучитьЗначениеНастройки(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey"));
	Если ЗначениеЗаполнено(Апикей) Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура НастроитьОтправкуВТелеграм(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ПолучитьНастройкуПоИмениПредопределенного("ИспользоватьОтправкуВТелеграм"));
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_Настройки.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, ЭтаФорма,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтправкуНаПочту(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_НастройкаУчетнойЗаписиЭлектроннойПочты",, ЭтаФорма, ЭтаФорма,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодключитьТелеграмНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_QRКодБотаКаналаТелеграм",,
		ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьГруппыТелеграм()
	
	Элементы.ДекорацияИдетПроверкаТелеграм.Видимость = Ложь;
	Элементы.ДекорацияРезультатУспехТелеграм.Видимость = Ложь;
	Элементы.ДекорацияПодключитьТелеграм.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ТелефонУведомленияОшибокРоботов) Тогда
		Элементы.ГруппаПроверкаТелеграм.Видимость = Истина;
		
		Если ИдетПроверкаТелефонаУведомленияОшибокРоботовВТелеграм Тогда
			Элементы.ДекорацияИдетПроверкаТелеграм.Видимость = Истина;
		ИначеЕсли ТелефонУведомленияОшибокРоботовЗарегестрированВТелеграм Тогда
			Элементы.ДекорацияРезультатУспехТелеграм.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПодключитьТелеграм.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ГруппаПроверкаТелеграм.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРегистрациюТелефонаУведомленияОшибокРоботовТелеграм()
	
	ИдетПроверкаТелефонаУведомленияОшибокРоботовВТелеграм = Истина;
	ПодключитьОбработчикОжидания("ПроверитьРегистрациюТелефонаУведомленияОшибокРоботовТелеграмВФоне", 0.1, Истина);
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРегистрациюТелефонаУведомленияОшибокРоботовТелеграмВФоне()
	
	ТелефонУведомленияОшибокРоботовЗарегестрированВТелеграм = ПроверитьРегистрациюТелеграмНаСервере(Объект.ТелефонУведомленияОшибокРоботов);
	ИдетПроверкаТелефонаУведомленияОшибокРоботовВТелеграм = Ложь;
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьРегистрациюТелеграмНаСервере(Телефон)
	
	Попытка
		ТелефонЗарегестрированВТелеграм = КонтурЛогистика_РаботаСТелеграм.ТелефонЗарегестрирован(Телефон);
	Исключение
		ТелефонЗарегестрированВТелеграм = Ложь;
	КонецПопытки;
	
	Возврат ТелефонЗарегестрированВТелеграм;
	
КонецФункции

&НаСервереБезКонтекста
Функция НастройкиОтправкиПочтыЗаполнены()
	
	Возврат КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНастройкуПоИмениПредопределенного(ИмяПредопределенного)
	
	Возврат Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(ИмяПредопределенного);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеОбщейНастройки(ИмяПредопределенного)
	
	Возврат Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки(ИмяПредопределенного);
	
КонецФункции

&НаКлиенте
Процедура ТелефонУведомленияОшибокРоботовПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ТелефонУведомленияОшибокРоботов) Тогда
		ПроверитьРегистрациюТелефонаУведомленияОшибокРоботовТелеграмВФоне();
	Иначе
		ОбновитьВидимостьГруппыТелеграм();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСсылкуНастроекВебЛогистика(Команда)
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок") Тогда
		СсылкаНастройкиВебЛогистики = "https://logist-staging.kontur.ru/" + Объект.ID + "/administrator?mode=counteragent";		
	Иначе
		СсылкаНастройкиВебЛогистики = "https://logist.kontur.ru/" + Объект.ID + "/administrator?mode=counteragent";
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		ЗапуститьПриложение(СсылкаНастройкиВебЛогистики);
	Иначе
		ПерейтиПоНавигационнойСсылке(СсылкаНастройкиВебЛогистики);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектОткрытие(Элемент, СтандартнаяОбработка)
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьСвязанныйОбъект(ЭтаФорма, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПоказатьСписокТиповДляСвязанногоОбъекта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработкаВыбораСвязанногоОбъекта(ЭтаФорма, ВыбранноеЗначение);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед добавлением необходимо сохранить");
		Возврат;
	КонецЕсли;
			
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаВыбора";
	НаправлениеКонвертации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НаправлениеКонвертации.Входящее");
	ИмяТипаСправочника = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоСсылкеНаДокумент(Объект.Ссылка);
	
	ЗначениеОтбора = Новый Структура("НаправлениеКонвертации, ТипСправочникаЛогистика", НаправлениеКонвертации, ИмяТипаСправочника); 
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыФормы, ЭтаФорма, ЭтаФорма,
		"СоздатьНаОснованииНачалоВыбораЗавершение", Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОснованииНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Сообщить("Не выбрана настройка конвертации справочника");
		Возврат;
	КонецЕсли;
	
	НастройкаКонвертацииСправочника = Результат;
	КонтурЛогистика_КонвертацияКлиент.КонвертироватьОбъектСправочникаЛогистикиВОбъектУС(ЭтаФорма, НастройкаКонвертацииСправочника);
	
КонецПроцедуры

#Область Авторизация

&НаСервере
Процедура ОбновитьГруппуАвторизацииНаПортале()
	
	АвторизацияВыполнена = Ложь;
	
	Если Не АвторизацияПоOIDC Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		АвторизацияНаПорталеИконка = 0;
		АвторизацияНаПортале = "Авторизоваться";
		Возврат;
	КонецЕсли;
	
	ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ДанныеАутентификацииПоОрганизации(Объект.Ссылка);
	Если ЗначениеЗаполнено(ДанныеАутентификации.ТокенДоступа) Тогда
		
		АвторизацияНаПорталеИконка = 2;
		АвторизацияНаПортале = "Выйти (" + ДанныеАутентификации.ФИО + ")";
		АвторизацияВыполнена = Истина;
		
	Иначе
		
		АвторизацияНаПорталеИконка = 0;
		АвторизацияНаПортале = "Авторизоваться";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьАвторизации()
	
	Элементы.ГруппаАвторизация.Видимость = (АвторизацияПоOIDC И Объект.Наш);
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияНаПорталеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если АвторизацияНаПортале = "Авторизоваться" Тогда
		
		ВыполнитьАвторизациюНаПортале();
		
	Иначе
		
		УдалитьАвторизациюНаПортале();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвторизациюНаПорталеПриОткрытии()
	
	ВыполнитьАвторизациюНаПортале();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвторизациюНаПортале(ПриУстановкеПризнакаНаш = Ложь)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Организация", Объект.Ссылка);
	Если ПриУстановкеПризнакаНаш Тогда
		ДополнительныеПараметры.Вставить("ПриУстановкеПризнакаНаш");
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеАутентификации", ЭтаФорма, ДополнительныеПараметры);
	
	ОтборСессий = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОтборСессий(Объект.Ссылка);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПолучениеСессии(Оповещение, ОтборСессий);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьАвторизациюНаПортале()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(Объект.Ссылка);
	
	ОбновитьГруппуАвторизацииНаПортале();
	
	ОбновитьВидимостьАвторизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеАутентификации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Получим доступные организации
	МоиОрганизацииДиадок = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetMyOrganizations(Результат.ТокенДоступа);
	
	Если МоиОрганизацииДиадок.Organizations.Количество() = 0 Тогда
		Сообщить("У вас нет доступа в эту организацию");
		КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(ДополнительныеПараметры.Организация);
		Возврат;
	КонецЕсли;
	
	// Проверим, что текущая организация доступна текущему пользователю
	ОрганизацияДоступна = Ложь;
	ТекущийOrgId = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
		ДополнительныеПараметры.Организация, "OrgId");
	Для Каждого ТекущаяСтрока Из МоиОрганизацииДиадок.Organizations Цикл
		Если ТекущаяСтрока.OrgId = ТекущийOrgId Тогда
			ОрганизацияДоступна = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ОрганизацияДоступна Тогда
		КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(ДополнительныеПараметры.Организация);
		Сообщить("Авторизованный пользователь не имеет доступа к выбранной организации: "
			+ Строка(ДополнительныеПараметры.Организация));
		Возврат;
	КонецЕсли;
	
	РезультатПроверкиПрав = КонтурЛогистика_API_Диадок.ПроверкаПравДляРаботыСервисом(Объект.Ссылка, Результат.ТокенДоступа);
	Если Не РезультатПроверкиПрав.ПравДостаточно Тогда
		
		Если РезультатПроверкиПрав.ПереченьНедостающихПрав.Количество() <> 0 Тогда
			ОткрытьФормуПроверкиПравДоступа(Объект.Ссылка, Результат.ТокенДоступа, Результат.ФИО);
		ИначеЕсли Не РезультатПроверкиПрав.ОплатаТарифа Тогда
			Сообщить("Необходима оплата тарифа АПИ");
		ИначеЕсли РезультатПроверкиПрав.ТекстОшибки <> "" Тогда
			Сообщить(РезультатПроверкиПрав.ТекстОшибки);
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(Объект.Ссылка);
		
	КонецЕсли;
	
	Если Не КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.ПравДостаточноДляРаботыСервисом(Объект.Ссылка, Результат.ТокенДоступа) Тогда
		
		ОткрытьФормуПроверкиПравДоступа(Объект.Ссылка, Результат.ТокенДоступа, Результат.ФИО);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.УдалитьСессиюАутентификацииПоОрганизации(Объект.Ссылка);
		
	КонецЕсли;
	
	ОбновитьГруппуАвторизацииНаПортале();
	
	ОбновитьВидимостьАвторизации();
	
	Если ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.Свойство("ПриУстановкеПризнакаНаш") Тогда
		ОбработатьПриВключенииНаш();
	КонецЕсли;
	
	Если АвторизацияВыполнена Тогда
		// Отправить метрику успешной авторизации
		ОрганизацийДД = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
		КонтурЛогистика_Метрика.Общепродуктовая_ОтправитьАвторизацию(ОрганизацийДД, "OIDC_Админ");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПроверкиПравДоступа(Организация, ТокенДоступа, ФИО)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Токен", ТокенДоступа);
	ПараметрыФормы.Вставить("ФИО", ФИО);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаПроверкиПравДоступа", ПараметрыФормы,
		ЭтаФорма,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ФильтрПоИнфоПолям

&НаКлиенте
Процедура ФильтрПоИнфоПолямКодомПриИзменении(Элемент)
	
	ТребуетсяОбновитьПовторноИспользуемыеЗначения = Истина;
	
	ОбновитьВидимостьФильтраПоИнфоПолям();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьФильтраПоИнфоПолям()
	
	Элементы.ГруппаФильтрПоИнфоПолямМаппинг.Видимость = Не Объект.ФильтрПоИнфоПолямКодом;
	Элементы.ГруппаФильтрПоИнфоПолямКодом.Видимость = Объект.ФильтрПоИнфоПолямКодом;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоИнфоПолямКодомВыражениеВычисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ФильтрПоИнфоПолямВыражениеВычисления) Тогда
		// Добавим пример
		Объект.ФильтрПоИнфоПолямВыражениеВычисления =
		"//Пример:
		|//Доступны: Организация (ссылка) и ИнфоПоля (соответствие).
		|//Для Каждого ТекущееПоле Из ИнфоПоля Цикл
		|//	Если ТекущееПоле.Ключ = ""НомерПодразделения"" И ТекущееПоле.Значение = ""13"" Тогда
		|//		РезультатВычисления = Истина;
		|//		Прервать;
		|//	КонецЕсли;
		|//КонецЦикла;";
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьФормуРедактированияТекста(
		Объект.ФильтрПоИнфоПолямВыражениеВычисления, Объект, "ФильтрПоИнфоПолямВыражениеВычисления");
	
	ТребуетсяОбновитьПовторноИспользуемыеЗначения = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоИнфоПолямВыражениеВычисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		УспешнаяЗапись = ЭтаФорма.Записать();
		Если Не УспешнаяЗапись Тогда 
			Сообщить("Не удалось записать настройку. Запишите вручную, затем переходите к настройке.");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ФильтрПоИнфоПолям.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СпособМаппинга) Тогда
		ТекущиеДанные.СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ФиксированноеЗначение");
	КонецЕсли;
	
	ПараметрыФормыНастройки = Новый Структура(
		"ВыражениеВычисления, ВыражениеВычисления2, ВыражениеВычисленияСтрокаНеогр, ИмяНастраиваемогоПоля, СвойствоОбъекта,
		|КлючДопСвойстваРеквизита, НастройкаКонвертации, СпособМаппинга, ИмяТабЧастьТовары, ПутьКоллекцияТабЧастьТовары,
		|ПутьКоллекцияТабЧастьТоварыИмяРеквизитаТЧ");
	ПараметрыФормыНастройки.Вставить("ИмяНастраиваемогоПоля", ТекущиеДанные.Ключ);
	
	ПараметрыФормыНастройки.Вставить("НастройкаКонвертации",
		ПредопределенноеЗначение("Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ПустаяСсылка"));
	ПараметрыФормыНастройки.Вставить("СпособМаппинга", ТекущиеДанные.СпособМаппинга);
	ПараметрыФормыНастройки.Вставить("ВыражениеВычисления", ТекущиеДанные.ВыражениеВычисления);
	ПараметрыФормыНастройки.Вставить("ВыражениеВычисленияСтрокаНеогр", ТекущиеДанные.ВыражениеВычисленияСтрокаНеогр);
	ПараметрыФормыНастройки.Вставить("НастройкаИнфоПолей");
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_НастойкиКонвертации_Помощник", ПараметрыФормыНастройки,
		ЭтаФорма, ЭтаФорма, "ОбработчикРедактированиеСтрокиВДопФорме", "ФильтрПоИнфоПолям");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРедактированиеСтрокиВДопФорме(ВыбранноеЗначение = Неопределено, ИмяЭлемента = Неопределено) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено
		И ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
		И ИмяЭлемента <> Неопределено Тогда
		
		Модифицированность = Истина;
		
		ТекущиеДанные = Элементы[ИмяЭлемента].ТекущиеДанные;
		ТекущиеДанные.СпособМаппинга = ВыбранноеЗначение.СпособМаппинга;
		ТекущиеДанные.ВыражениеВычисления = ВыбранноеЗначение.ВыражениеВычисления;
		ТекущиеДанные.ВыражениеВычисленияСтрокаНеогр = ВыбранноеЗначение.ВыражениеВычисленияСтрокаНеогр;
		
		ТребуетсяОбновитьПовторноИспользуемыеЗначения = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтключениеЧтенияЛенты

&НаКлиенте
Процедура ЧитатьЛентуДиадокФлажекВклВыклНажатие(Элемент)
	
	ЧитатьЛентуДиадок = Не ЧитатьЛентуДиадок;
	
	ИспользуетсяЗаказЗаявка = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЗаказЗаявка");
	ИспользуетсяЭкспедиторскаяРасписка = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЭкспедиторскаяРасписка");
	
	Если Не ЧитатьЛентуДиадок И (ИспользуетсяЗаказЗаявка Или ИспользуетсяЭкспедиторскаяРасписка) Тогда
		ТекстВопроса = ТекстВопросаДляВыключенияЧтенияЛентыСобытийДиадок(ИспользуетсяЗаказЗаявка, ИспользуетсяЭкспедиторскаяРасписка);
		КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(ТекстВопроса, РежимДиалогаВопрос.ДаНет,
			,, ЭтаФорма,
			"ВыключениеНастройкиЧитатьЛентуДиадокЗавершение");
	Иначе
	
		УстановитьЗначениеНастройкиЧитатьЛентуДиадок();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ТекстВопросаДляВыключенияЧтенияЛентыСобытийДиадок(ИспользуетсяЗаказЗаявка, ИспользуетсяЭкспедиторскаяРасписка)
	
	ТекстВопроса = "";
	
	Если ИспользуетсяЗаказЗаявка И ИспользуетсяЭкспедиторскаяРасписка Тогда
		ТекстВопроса = "В модуле используются документы Заказ (заявка) и Экспедиторская расписка.";
	ИначеЕсли ИспользуетсяЗаказЗаявка И Не ИспользуетсяЭкспедиторскаяРасписка Тогда
		ТекстВопроса = "В модуле используется документ Заказ (заявка).";
	ИначеЕсли Не ИспользуетсяЗаказЗаявка И ИспользуетсяЭкспедиторскаяРасписка Тогда
		ТекстВопроса = "В модуле используется документ Экспедиторская расписка.";
	КонецЕсли;
	
	ТекстВопроса = ТекстВопроса + " " + "Обновление статусов документов происходит только через ленту Диадок. После выключения настройки статусы документов обновляться не будут. Выключить настройку?";
			
	Возврат ТекстВопроса;
		
КонецФункции

&НаКлиенте
Процедура ВыключениеНастройкиЧитатьЛентуДиадокЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ЧитатьЛентуДиадок = Не ЧитатьЛентуДиадок;
		Возврат;
	КонецЕсли;
	
	УстановитьЗначениеНастройкиЧитатьЛентуДиадок();		
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеНастройкиЧитатьЛентуДиадок()
		
	УстановитьЗначениеНастройки(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуДиадок"), ЧитатьЛентуДиадок);
			
	Если ЧитатьЛентуДиадок И ЗначениеЗаполнено(АктуальностьЛентыСобытийДиадокДата) Тогда
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазницаВДнях(НачалоДня(ТекущаяДата()), НачалоДня(АктуальностьЛентыСобытийДиадокДата)) > 14 Тогда
			УстановитьЗначениеНастройкиСервер(
				Объект.Ссылка, ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадокДата"), НачалоДня(ТекущаяДата()));
		КонецЕсли;
		
	КонецЕсли;
	
	Записать();
	
	Элементы.НастройкиДинСписок.Обновить();	
	ОбновитьВидимостьДоступностьГраниц();
			
КонецПроцедуры

&НаКлиенте
Процедура ЧитатьЛентуЛогистикиФлажекВклВыклНажатие(Элемент)
	
	ЧитатьЛентуЛогистики = Не ЧитатьЛентуЛогистики;
	ЕстьКлючАПИЛогистики = ЕстьКлючАПИЛогистики();
	
	Если ЧитатьЛентуЛогистики И Не АвторизацияПоOIDC И Не ЕстьКлючАПИЛогистики Тогда
		
		ПараметрыФормы = Новый Структура("КлючАПИ", "");
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаВводаАпиКлюча", ПараметрыФормы, ЭтаФорма, ЭтаФорма,
			"ИзменениеНастройкиКлючАПИПриУстановкеЧтенияЛентыЛогистики",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		УстановитьЗначениеНастройкиЧитатьЛентуЛогистики();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеНастройкиЧитатьЛентуЛогистики()
		
	УстановитьЗначениеНастройки(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуЛогистики"), ЧитатьЛентуЛогистики);
		
	ДатаГраницыСинхронизацииЛогистика = ПолучитьЗначениеНастройки(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДата"));
	
	Если ЧитатьЛентуЛогистики И ЗначениеЗаполнено(ДатаГраницыСинхронизацииЛогистика) Тогда
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазницаВДнях(НачалоДня(ТекущаяДата()), НачалоДня(АктуальностьЛентыСобытийДиадокДата)) > 14 Тогда
			УстановитьЗначениеНастройки(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДата"), НачалоДня(ТекущаяДата()));
			УстановитьЗначениеНастройки(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытий"), "");	
		КонецЕсли;
		
	КонецЕсли;
	
	Записать();
		
	Элементы.НастройкиДинСписок.Обновить();		
	ОбновитьВидимостьДоступностьГраниц();
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеНастройкиКлючАПИПриУстановкеЧтенияЛентыЛогистики(НовоеЗначение, ДополнительныеПараметры) Экспорт
	
	Если НовоеЗначение = Неопределено Тогда
		ЧитатьЛентуЛогистики = Не ЧитатьЛентуЛогистики;
		ОбновитьВидимостьДоступностьГраниц();
	Иначе		
			
		УстановитьЗначениеНастройки(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey"), НовоеЗначение);
		УстановитьЗначениеНастройкиЧитатьЛентуЛогистики();
		 		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыПослеУдаления(Элемент)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СервисФизическихЛиц

&НаСервере
Процедура ИнициализироватьСервисФизическихЛиц()
	
	ДоступенСервисФизЛиц = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ДоступенСервисФизЛиц(Объект.Ссылка);
	
	ОтборФизическиеЛица = "Все";
	ФизическиеЛица.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Ссылка);
	
	УстановитьВидимостьИПараметрыФизическихЛиц();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИПараметрыФизическихЛиц()

	Если ЗначениеЗаполнено(Объект.Ссылка) И ДоступенСервисФизЛиц Тогда
		Элементы.СтраницаФизическиеЛица.Видимость = Истина;
	Иначе
		Элементы.СтраницаФизическиеЛица.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	МастерДанныеСотрудников = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("МастерДанныеСотрудников");
	Если МастерДанныеСотрудников = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_МастерДанныеСотрудников.Модуль1с") Тогда
		Элементы.ОткрытьНастройкуМастерДанные.Заголовок = "Источник данных: 1С";
		Элементы.СинхронизироватьФизическиеЛица.Заголовок = "Выгрузить всех в сервис";
	Иначе
		Элементы.ОткрытьНастройкуМастерДанные.Заголовок = "Источник данных: сервис";
		Элементы.СинхронизироватьФизическиеЛица.Заголовок = "Обновить всех из сервиса";
	КонецЕсли;
	
	Элементы.ФизическиеЛицаПроверитьПриглашения.Видимость = КонтурЛогистика_СервисФизическихЛицСервер.ЕстьНепринятыеПриглашения(, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФизическоеЛицо(Команда)
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		"Добавление сотрудника", "Добавить сотрудника", "Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаЭлемента", "Организация");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Ссылка);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_СервисФизическихЛиц.Форма.ФормаОтправкиПриглашения", 
		ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОтправкиПриглашения");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОтправкиПриглашения(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ФизическиеЛица.Обновить();
	
	УстановитьВидимостьИПараметрыФизическихЛиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборФизическиеЛицаПриИзменении(Элемент)
	
	ФизическиеЛица.Отбор.Элементы.Очистить();
	
	Если ОтборФизическиеЛица = "НеПринятые" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФизическиеЛица, "Статус",
			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение"), ВидСравненияКомпоновкиДанных.Равно,, Истина);
	ИначеЕсли ОтборФизическиеЛица = "Ошибка" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФизическиеЛица, "ЕстьОшибка",
			Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	ИначеЕсли ОтборФизическиеЛица = "ЕстьРасхождения" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФизическиеЛица, "ЕстьРасхождения",
			Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	ИначеЕсли ОтборФизическиеЛица = "Удалены" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФизическиеЛица, "Статус",
			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.Удалено"), ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьФизическиеЛица(Команда)
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Организация", Объект.Ссылка);
	
	Прогресс = Новый Структура("ПорядковыйНомер, Колво", 0, 0);
	
	МастерДанныеСотрудников = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("МастерДанныеСотрудников");
	Если МастерДанныеСотрудников = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_МастерДанныеСотрудников.Модуль1с") Тогда
		
		АдресПрогрессаВыгрузкиСотрудниковВСервис = ПоместитьВоВременноеХранилище(Прогресс, ЭтаФорма.УникальныйИдентификатор);
		
		ПараметрыФоновогоЗадания.Вставить("АдресПрогресса", АдресПрогрессаВыгрузкиСотрудниковВСервис);
		
		РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание(
			"КонтурЛогистика_ДлительныеОперацииСервер.ВыгрузитьСотрудниковВСервисФизическихЛиц",
			ПараметрыФоновогоЗадания,
			"КлючФЗ_ВыгрузитьСотрудниковВСервисФизическихЛиц",
			"Выгрузить сотрудник в сервис физических лиц");
			
		Сообщить("Выполняется выгрузка сотрудников в сервис");
			
		Если РезультатЗапуска.Статус = "Выполняется" Тогда
			
			ИдентификаторФЗ_ВыгрузитьСотрудниковВСервис = РезультатЗапуска.ИдентификаторЗадания;
			
			ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеВыгрузкиСотрудниковВСервисФизическихЛиц", 0.1, Истина);
			
		ИначеЕсли РезультатЗапуска.Статус = "Выполнено" Тогда
			
			ПроверитьФоновоеЗаданиеВыгрузкиСотрудниковВСервисФизическихЛиц();
			
		КонецЕсли;
		
	Иначе
		
		АдресПрогрессаЗагрузкиСотрудниковИзСервиса = ПоместитьВоВременноеХранилище(Прогресс, ЭтаФорма.УникальныйИдентификатор);

		ПараметрыФоновогоЗадания.Вставить("АдресПрогресса", АдресПрогрессаЗагрузкиСотрудниковИзСервиса);
			
		РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание(
			"КонтурЛогистика_ДлительныеОперацииСервер.ЗагрузитьСотрудниковИзСервисаФизическихЛиц",
			ПараметрыФоновогоЗадания,
			"КлючФЗ_ЗагрузитьСотрудниковИзСервисаФизическихЛиц",
			"Загрузить сотрудников из сервиса физических лиц");
			
		Сообщить("Выполняется обновление сотрудников из сервиса");
			
		Если РезультатЗапуска.Статус = "Выполняется" Тогда
			
			ИдентификаторФЗ_ЗагрузитьСотрудниковИзСервиса = РезультатЗапуска.ИдентификаторЗадания;
			
			ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеЗагрузкиСотрудниковИзСервисаФизическихЛиц", 0.1, Истина);
			
		ИначеЕсли РезультатЗапуска.Статус = "Выполнено" Тогда
			
			ПроверитьФоновоеЗаданиеЗагрузкиСотрудниковИзСервисаФизическихЛиц();
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьВидимостьИПараметрыФизическихЛиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗаданиеВыгрузкиСотрудниковВСервисФизическихЛиц() Экспорт
	
	ИнтервалОбработчикаОжидания = 1;
	
	ЗаданиеЕщеВыполняется = КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(
		ИдентификаторФЗ_ВыгрузитьСотрудниковВСервис, Элементы.ЛоадерВыполнитьОбмен);
	
	Если ЗаданиеЕщеВыполняется Тогда 
		
		Прогресс = ПолучитьИзВременногоХранилища(АдресПрогрессаВыгрузкиСотрудниковВСервис);
		
		Если Прогресс.КолВо > 0 Тогда
			Пояснение = ?(ЗначениеЗаполнено(Прогресс.Сотрудник), Строка(Прогресс.ПорядковыйНомер) + " " + СокрЛП(Прогресс.Сотрудник), "");
			Состояние("Выполняется выгрузка сотрудников", Прогресс.ПорядковыйНомер / Прогресс.КолВо * 100, Пояснение);
			Элементы.ФизическиеЛица.Обновить();
		Иначе
			Состояние("Выполняется выгрузка сотрудников",);	
		КонецЕсли;
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеВыгрузкиСотрудниковВСервисФизическихЛиц", ИнтервалОбработчикаОжидания, Истина);
		
	Иначе
		
		Элементы.ФизическиеЛица.Обновить();
		
		Сообщить("Выгрузка сотрудников в сервис выполнена");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗаданиеЗагрузкиСотрудниковИзСервисаФизическихЛиц() Экспорт
	
	ИнтервалОбработчикаОжидания = 1;
	
	ЗаданиеЕщеВыполняется = КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(
		ИдентификаторФЗ_ЗагрузитьСотрудниковИзСервиса, Элементы.ЛоадерВыполнитьОбмен);
	
	Если ЗаданиеЕщеВыполняется Тогда 
		
		Прогресс = ПолучитьИзВременногоХранилища(АдресПрогрессаЗагрузкиСотрудниковИзСервиса);
		
		Если Прогресс.КолВо > 0 Тогда
			Пояснение = ?(ЗначениеЗаполнено(Прогресс.Сотрудник), Строка(Прогресс.ПорядковыйНомер) + СокрЛП(Прогресс.Сотрудник), "");
			Состояние("Выполняется загрузка и обновление сотрудников", Прогресс.ПорядковыйНомер / Прогресс.КолВо * 100, Пояснение);
			Элементы.ФизическиеЛица.Обновить();
		Иначе
			Состояние("Выполняется загрузка и обновление сотрудников");
		КонецЕсли;
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеЗагрузкиСотрудниковИзСервисаФизическихЛиц", ИнтервалОбработчикаОжидания, Истина);
		
	Иначе
		
		Элементы.ФизическиеЛица.Обновить();
		
		Сообщить("Обновление сотрудников из сервиса выполнено");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо записать сотрудника");
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ФизическиеЛица.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ, ТекущийЭлемент", ТекущиеДанные.Сотрудник, "ФизическиеЛица");
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуМастерДанные(Команда)
	
	НастройкаМастерДанныеСотрудников = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьОбщуюНастройку("МастерДанныеСотрудников");
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(НастройкаМастерДанныеСотрудников);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПриглашения(Команда)
	
	КонтурЛогистика_СервисФизическихЛицСервер.ПроверитьПриглашения(Объект.Ссылка);
	
	Элементы.ФизическиеЛица.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструкцияДобавитьСотрудникаВСервис(Команда)
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Открытие инструкции", "Нажать на гиперссылку", 
		"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаЭлемента", "Добавление инструкции в карточке организации");
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		ЗапуститьПриложение("https://support.kontur.ru/logistika-1s/56876-rabota_s_sotrudnikami");
	Иначе
		ПерейтиПоНавигационнойСсылке("https://support.kontur.ru/logistika-1s/56876-rabota_s_sotrudnikami");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРасхожденияСотрудников(Команда)
	
	КонтурЛогистика_СервисФизическихЛицСервер.ОбновитьФизическиеЛицаСотрудников(Объект.Ссылка);
	
	Элементы.ФизическиеЛица.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область РеквизитыПоУмолчанию

&НаКлиенте
Процедура ТранспортноеСредствоПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
			
	ПараметрыФормы = Новый Структура("ОтборЭтоТС", Истина);
	ДополнительныеПараметры = Новый Структура("Реквизит", "ТранспортноеСредствоПоУмолчанию");
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_ТранспортныеСредства.Форма.ФормаВыбора", ПараметрыФормы, 
		ЭтаФорма, ЭтаФорма, "ОбработчикВыбораРеквизитаПоУмолчанию", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
			
	ПараметрыФормы = Новый Структура("ОтборРоль", "Водители");
	ДополнительныеПараметры = Новый Структура("Реквизит", "ВодительПоУмолчанию");
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаВыбора", ПараметрыФормы, 
		ЭтаФорма, ЭтаФорма, "ОбработчикВыбораРеквизитаПоУмолчанию", ДополнительныеПараметры); 
	
КонецПроцедуры

&НаКлиенте
Процедура Водитель2ПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ПараметрыФормы = Новый Структура("ОтборРоль", "Водители");
	ДополнительныеПараметры = Новый Структура("Реквизит", "Водитель2ПоУмолчанию");
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаВыбора", ПараметрыФормы, 
		ЭтаФорма, ЭтаФорма, "ОбработчикВыбораРеквизитаПоУмолчанию", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораРеквизитаПоУмолчанию(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено
		И ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("Реквизит") Тогда
		Объект[ДополнительныеПараметры.Реквизит] = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСлужебным(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;  
	Отбор = Новый Структура;  
	Отбор.Вставить("ОрганизацияДиадок", Объект.Ссылка);  
	ПараметрыОткрытияФормы.Вставить("Отбор", Отбор);  
	ОткрытьФорму("РегистрСведений.КонтурЛогистика_НастройкиОрганизацийСлужебные.ФормаСписка", ПараметрыОткрытияФормы);
	
КонецПроцедуры

#КонецОбласти
