#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.НастройкаРаспределенияПоНаправлениямДеятельности.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.27.19";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("33ed1c42-17e8-4104-8b0c-a93b76737381");
	Обработчик.Многопоточный = Истина;
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.НастройкаРаспределенияПоНаправлениямДеятельности.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заменяет в регистре сведений ""Настройка распределения по направлениям деятельности"" 
										| пустые ссылки на справочники ""Номенклатура"" и ""Партнеры"" на Неопределено.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыСведений.НастройкаРаспределенияПоНаправлениямДеятельности.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыСведений.НастройкаРаспределенияПоНаправлениямДеятельности.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыСведений.НастройкаРаспределенияПоНаправлениямДеятельности.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
КонецПроцедуры
	
// Регистрирует документы к обработке для изменения.
//
// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = "РегистрСведений.НастройкаРаспределенияПоНаправлениямДеятельности";
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.Вставить("ЭтоНезависимыйРегистрСведений", Истина);
	ДополнительныеПараметры.Вставить("ПолноеИмяРегистра", "РегистрСведений.НастройкаРаспределенияПоНаправлениямДеятельности");
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкаРаспределенияПоНаправлениямДеятельности.Период КАК Период,
	|	НастройкаРаспределенияПоНаправлениямДеятельности.Организация КАК Организация,
	|	НастройкаРаспределенияПоНаправлениямДеятельности.Номенклатура КАК Номенклатура,
	|	НастройкаРаспределенияПоНаправлениямДеятельности.Подразделение КАК Подразделение,
	|	НастройкаРаспределенияПоНаправлениямДеятельности.Партнер КАК Партнер,
	|	НастройкаРаспределенияПоНаправлениямДеятельности.Склад КАК Склад
	|ИЗ
	|	РегистрСведений.НастройкаРаспределенияПоНаправлениямДеятельности КАК НастройкаРаспределенияПоНаправлениямДеятельности
	|ГДЕ
	|	(НастройкаРаспределенияПоНаправлениямДеятельности.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ИЛИ НастройкаРаспределенияПоНаправлениямДеятельности.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))";
	
	РегистрируемыеИзмерения = Запрос.Выполнить().Выгрузить();
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, РегистрируемыеИзмерения, ДополнительныеПараметры);
	
КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрСведений.НастройкаРаспределенияПоНаправлениямДеятельности";
	
	Если Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра) Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Для Каждого Строка Из ТаблицаОбновляемыеДанные Цикл
		
		Набор = Неопределено;
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкаРаспределенияПоНаправлениямДеятельности");
			ЭлементБлокировки.УстановитьЗначение("Период",			Строка.Период);
			ЭлементБлокировки.УстановитьЗначение("Организация",		Строка.Организация);
			ЭлементБлокировки.УстановитьЗначение("Номенклатура",	Строка.Номенклатура);
			ЭлементБлокировки.УстановитьЗначение("Подразделение",	Строка.Подразделение);
			ЭлементБлокировки.УстановитьЗначение("Партнер",			Строка.Партнер);
			ЭлементБлокировки.УстановитьЗначение("Склад",			Строка.Склад);
			
			Блокировка.Заблокировать();
			
			Набор = РегистрыСведений.НастройкаРаспределенияПоНаправлениямДеятельности.СоздатьНаборЗаписей();
			Набор.Отбор.Период.Установить(Строка.Период);
			Набор.Отбор.Организация.Установить(Строка.Организация);
			Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
			КонецЕсли;
			Набор.Отбор.Подразделение.Установить(Строка.Подразделение);
			Если ЗначениеЗаполнено(Строка.Партнер) Тогда
				Набор.Отбор.Партнер.Установить(Строка.Партнер);
			КонецЕсли;
			Набор.Отбор.Склад.Установить(Строка.Склад);
			Набор.Прочитать();
			
			Для Каждого Запись Из Набор Цикл
				Если Запись.Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
					Запись.Номенклатура = Неопределено;
				КонецЕсли;
				Если Запись.Партнер = Справочники.Партнеры.ПустаяСсылка() Тогда
					Запись.Партнер = Неопределено;
				КонецЕсли;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			Если Набор = Неопределено Тогда
				Набор = РегистрыСведений.НастройкаРаспределенияПоНаправлениямДеятельности.СоздатьНаборЗаписей();
				Набор.Отбор.Период.Установить(Строка.Период);
				Набор.Отбор.Организация.Установить(Строка.Организация);
				Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
				Набор.Отбор.Подразделение.Установить(Строка.Подразделение);
				Набор.Отбор.Партнер.Установить(Строка.Партнер);
				Набор.Отбор.Склад.Установить(Строка.Склад);
			КонецЕсли;
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Набор);
		КонецПопытки;
		
	КонецЦикла;
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;

	ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ТаблицаОбновляемыеДанные, ДополнительныеПараметры);
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
