#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	ОбновлениеИнформационнойБазыГосИС.ДобавитьОбработчикОбновленияПереходаНаКонструкторНастроек(
		Обработчики,
		Метаданные.РегистрыСведений.КлючиПартийЗЕРНО,
		Новый УникальныйИдентификатор("a239977c-d420-4bc7-9fba-e1a3c96629f2"));
	
КонецПроцедуры

// Регистрирует данные для обработчика обновления перехода на конструктор настроек
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.РегистрыСведений.КлючиПартийЗЕРНО;
	ОбновлениеИнформационнойБазыЗЕРНО.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюКонструктораНастроекРегистрСведений(
		ОбъектМетаданных, Параметры);
	
КонецПроцедуры

// Обработка данных перехода на конструктор настроек видов продукции
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.РегистрыСведений.КлючиПартийЗЕРНО;
	ОбновлениеИнформационнойБазыЗЕРНО.ОбработатьДанныеДляПереходаНаНовуюВерсиюКонструктораНастроекРегистраСведений(
		ОбъектМетаданных, Параметры);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
