#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть") Тогда
		Товары.Очистить();
		ШтрихкодыУпаковок.Очистить();
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ВидыПродукцииПоТоварнойГруппе = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоТоварнойГруппе(ТоварнаяГруппа);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Товары.КоличествоПотребительскихУпаковок");
	
	ЭтоСписаниеПриПоступленииКИЗ = Операция = Перечисления.ВидыОперацийИСМП.СписаниеЧерезСУЗМех;
	
	Если Не ОтчетПроизводственнойЛинии Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДанныеОтчетаПроизводственнойЛинии");
	КонецЕсли;
	
	Если ОтчетПроизводственнойЛинии Или ЭтоСписаниеПриПоступленииКИЗ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары");
	КонецЕсли;
	
	Если Не МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляGLNОрганизации(ВидыПродукцииПоТоварнойГруппе, Операция) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("GLNОрганизации");
	КонецЕсли;
	
	ПроверятьЗаполнениеПоляВидПервичногоДокумента = МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляВидПервичногоДокумента(
		ВидыПродукцииПоТоварнойГруппе, Операция);
	ПроверятьЗаполнениеПоляНомерДатаПервичногоДокумента = МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляНомерДатаПервичногоДокумента(
		ВидыПродукцииПоТоварнойГруппе, Операция);
	
	Если Не ПроверятьЗаполнениеПоляВидПервичногоДокумента Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидПервичногоДокумента");
	КонецЕсли;

	Если Не ПроверятьЗаполнениеПоляНомерДатаПервичногоДокумента Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаПервичногоДокумента");
		МассивНепроверяемыхРеквизитов.Добавить("НомерПервичногоДокумента");
	КонецЕсли;
	
	Если Не ПроверятьЗаполнениеПоляНомерДатаПервичногоДокумента И Не ПроверятьЗаполнениеПоляВидПервичногоДокумента Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НаименованиеПервичногоДокумента");
	КонецЕсли;
	
	Если ВидПервичногоДокумента <> Перечисления.ВидыПервичныхДокументовИСМП.Прочее Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("НаименованиеПервичногоДокумента");
		
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары.GTIN");
		
	Если Не СписаниеКодовМаркировкиКлиентСервер.ПроверятьЗаполнениеПоляПричинаСписанияВТабличнойЧасти(ВидыПродукцииПоТоварнойГруппе,
		Операция, ПричинаСписания) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ПричинаСписания");
	КонецЕсли;
	
	Если Не СписаниеКодовМаркировкиКлиентСервер.ПроверятьЗаполнениеПоляПроизводственныйОбъект(ВидыПродукцииПоТоварнойГруппе, Операция) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПроизводственныйОбъект");
	КонецЕсли;
	
	Если Не СписаниеКодовМаркировкиКлиентСервер.ПроверятьЗаполнениеПоляПроизводственныйОбъектАдресСтрокой(ВидыПродукцииПоТоварнойГруппе, ПричинаСписания) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПроизводственныйОбъектАдресСтрокой");
	КонецЕсли;
	
	Если Не МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеПоляИдентификаторПроизводственнойЛинии(ВидыПродукцииПоТоварнойГруппе, ПричинаСписания) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПроизводственныйОбъектИдентификатор");
		МассивНепроверяемыхРеквизитов.Добавить("ИдентификаторПроизводственногоЗаказа");
		МассивНепроверяемыхРеквизитов.Добавить("ИдентификаторПроизводственнойЛинии");
	КонецЕсли;
	
	Если Не МаркировкаТоваровКлиентСервер.ПроверятьЗаполнениеНоменклатурыЕслиНеЗаполненGTIN(ВидыПродукцииПоТоварнойГруппе, Операция) Тогда
		Для Каждого СтрокаТовары Из Товары Цикл
			Если Не ЗначениеЗаполнено(СтрокаТовары.GTIN)
				И Не ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
				ТекстСообщения = СтрШаблон(
					НСтр(
						"ru = 'В строке %1 табличной части Товары не заполнено поле GTIN'"),
						СтрокаТовары.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						"Товары", СтрокаТовары.НомерСтроки, "GTIN"),,
					Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не СписаниеКодовМаркировкиКлиентСервер.ПроверятьЗаполнениеПоляКодФиас(ВидыПродукцииПоТоварнойГруппе, Операция) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КодФИАС");
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	Если Операция <> Перечисления.ВидыОперацийИСМП.СписаниеЧерезСУЗМех Тогда
		ИнтеграцияИСМПСлужебный.ПроверитьЗаполнениеШтрихкодовУпаковок(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ИнтеграцияИСМП.ПроверкаЗаполненияКоличестваПотребительскихУпаковок(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиИСМП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование   = Неопределено;
	ИдентификаторЗаявки = Неопределено;
	ШтрихкодыУпаковок.Очистить();
	ИдентификаторПроизводственногоЗаказа = "";
	ИдентификаторПроизводственнойЛинии   = "";
	ДанныеОтчетаПроизводственнойЛинии.Очистить();
	
	ВидПервичногоДокумента          = Неопределено;
	ДатаПервичногоДокумента         = "";
	НомерПервичногоДокумента        = "";
	НаименованиеПервичногоДокумента = "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеИСМП.ДанныеЗаполненияСписанияКодовМаркировкиИСМП(Организация);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
