Функция ПолучитьСписокСотрудниковGET(Запрос)
	
	Параметры=ДГ_РаботаССервисомСервис.ПолучитьСтруктуруПараметровДляОбработкиЗапроса();
	Параметры.ИмяМетода="/GetEmployees";
	Параметры.ТипМетода="GET";
	Параметры.ЗапросХТТП=Запрос;
	
	Возврат ДГ_РаботаССервисомСервис.ОбработатьЗапрос(Параметры);
	
КонецФункции

Функция ПолучитьПрофилиГруппДоступаGET(Запрос)
	
	Параметры=ДГ_РаботаССервисомСервис.ПолучитьСтруктуруПараметровДляОбработкиЗапроса();
	Параметры.ИмяМетода="/GetProfiles";
	Параметры.ТипМетода="GET";
	Параметры.ЗапросХТТП=Запрос;
	
	Возврат ДГ_РаботаССервисомСервис.ОбработатьЗапрос(Параметры);
	
КонецФункции

Функция ПолучитьГруппыДоступаGET(Запрос)
	
	Параметры=ДГ_РаботаССервисомСервис.ПолучитьСтруктуруПараметровДляОбработкиЗапроса();
	Параметры.ИмяМетода="/GetGroups";
	Параметры.ТипМетода="GET";
	Параметры.ЗапросХТТП=Запрос;
	
	Возврат ДГ_РаботаССервисомСервис.ОбработатьЗапрос(Параметры);
	
КонецФункции

Функция ПолучитьПользователейGET(Запрос)
	
	Параметры=ДГ_РаботаССервисомСервис.ПолучитьСтруктуруПараметровДляОбработкиЗапроса();
	Параметры.ИмяМетода="/GetUsers";
	Параметры.ТипМетода="GET";
	Параметры.ЗапросХТТП=Запрос;
	
	Возврат ДГ_РаботаССервисомСервис.ОбработатьЗапрос(Параметры);
	
КонецФункции

Функция СоздатьОбновитьПользователяPOST(Запрос)
	
	Параметры=ДГ_РаботаССервисомСервис.ПолучитьСтруктуруПараметровДляОбработкиЗапроса();
	Параметры.ИмяМетода="/CreateUpdateUser";
	Параметры.ТипМетода="POST";
	Параметры.ЗапросХТТП=Запрос;
	
	Возврат ДГ_РаботаССервисомСервис.ОбработатьЗапрос(Параметры);
	
КонецФункции

Функция ПолучитьПодразделенияGet(Запрос)
	
	Параметры=ДГ_РаботаССервисомСервис.ПолучитьСтруктуруПараметровДляОбработкиЗапроса();
	Параметры.ИмяМетода="/GetDivisions";
	Параметры.ТипМетода="GET";
	Параметры.ЗапросХТТП=Запрос;
	
	Возврат ДГ_РаботаССервисомСервис.ОбработатьЗапрос(Параметры);
	
КонецФункции

Функция ПолучитьСтруктуруПредприятияGET(Запрос)
	
	Параметры=ДГ_РаботаССервисомСервис.ПолучитьСтруктуруПараметровДляОбработкиЗапроса();
	Параметры.ИмяМетода="/GetUprDivisions";
	Параметры.ТипМетода="GET";
	Параметры.ЗапросХТТП=Запрос;
	
	Возврат ДГ_РаботаССервисомСервис.ОбработатьЗапрос(Параметры);
	
КонецФункции
