#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаКомандировку") Тогда
		Документы.ЗаявкаНаКомандировку.ЗаполнитьПоОснованию(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ОперацияСЭлектроннымБилетом.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	ВзаиморасчетыСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
	БронированиеЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ПараметрыЗаполнения = Документы.ОперацияСЭлектроннымБилетом.ПараметрыЗаполненияВидаДеятельностиНДС(ЭтотОбъект);
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ЗакупкаПодДеятельность, ПараметрыЗаполнения);
	ПараметрыВыбораСтатейИАналитик = Документы.ОперацияСЭлектроннымБилетом.ПараметрыВыбораСтатейИАналитикДляСписанияПрямымМетодом();
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	ВзаиморасчетыСервер.ПриКопировании(ЭтотОбъект);
	
	БронированиеЛокализация.ПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
	АвансовыйОтчет 			= Документы.АвансовыйОтчет.ПустаяСсылка();
	ИдентификаторДокумента 	= "";
	ИдентификаторСмартвей	= 0;
	
	Если ЭтоЭлектронныйБилет() Тогда
	
		ДеталиПоездки			= "";
		НомерБилета				= "";
		ДатаОтправления			= Неопределено;
		ДатаПрибытия			= Неопределено;
		
		НеКопируемыеТипыОпераций = Новый Массив;
		НеКопируемыеТипыОпераций.Добавить(Перечисления.ТипыОперацийСБилетами.Доплата);
		НеКопируемыеТипыОпераций.Добавить(Перечисления.ТипыОперацийСБилетами.Возврат);
		СтрокиКУдалению = Новый Массив;
		
		Для Каждого СтрокаСостава Из Операции Цикл
			Если НеКопируемыеТипыОпераций.Найти(СтрокаСостава.ТипОперации) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СтрокиКУдалению.Добавить(СтрокаСостава);
		КонецЦикла;
		
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			Операции.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		Если Не СпособСписанияНапрямую Тогда
			ПринятьНДСКВычету = Ложь;
		КонецЕсли;
		
		Если Не ПринятьНДСКВычету Тогда
			КодВидаОперации = "";
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗаполнения = Документы.ОперацияСЭлектроннымБилетом.ПараметрыЗаполненияВидаДеятельностиНДС(ЭтотОбъект);
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ЗакупкаПодДеятельность, ПараметрыЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.БронированиеЧерезАгента Тогда
		НепроверяемыеРеквизиты.Добавить("Агент");
		НепроверяемыеРеквизиты.Добавить("КонтрагентАгент");
	КонецЕсли;
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо Тогда
		НепроверяемыеРеквизиты.Добавить("ПодотчетноеЛицо");
		НепроверяемыеРеквизиты.Добавить("ПодразделениеПодотчетногоЛица");
	КонецЕсли;
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.БронированиеЧерезАгента
		И ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.БронированиеУПоставщика Тогда
		НепроверяемыеРеквизиты.Добавить("Договор");
	КонецЕсли;
	
	Если СпособСписанияНапрямую Тогда
		НепроверяемыеРеквизиты.Добавить("Сотрудник");
	Иначе
		НепроверяемыеРеквизиты.Добавить("СтатьяРасходов");НепроверяемыеРеквизиты.Добавить("ЗакупкаПодДеятельность");
		НепроверяемыеРеквизиты.Добавить("ЗакупкаПодДеятельность");
	КонецЕсли;
	
	Если Не ПринятьНДСКВычету Тогда
		НепроверяемыеРеквизиты.Добавить("КодВидаОперации");
	КонецЕсли;
	
	ПараметрыВыбораСтатейИАналитик = Документы.ОперацияСЭлектроннымБилетом.ПараметрыВыбораСтатейИАналитикДляСписанияПрямымМетодом();
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	
	МассивРеквизитовРучнойПроверки = Новый Массив;
	МассивРеквизитовРучнойПроверки.Добавить("Операции.СтатьяРасходов");
	МассивРеквизитовРучнойПроверки.Добавить("Операции.АналитикаРасходов");
	МассивРеквизитовРучнойПроверки.Добавить("Операции.АналитикаАктивовПассивов");
	
	Для каждого Реквизит Из МассивРеквизитовРучнойПроверки Цикл
		НепроверяемыеРеквизиты.Добавить(Реквизит);
	КонецЦикла;
	
	КлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(ЭтотОбъект);
	ТабличнаяЧасть = Метаданные().ТабличныеЧасти.Найти("Операции");
	Реквизит = ТабличнаяЧасть.Реквизиты.Найти("СтатьяРасходов");
	
	ОперацияВозврата = Перечисления.ТипыОперацийСБилетами.Возврат;
	
	Для Каждого СтрокаТЧ Из Операции Цикл
		
		Если СтрокаТЧ.ТипОперации = ОперацияВозврата Тогда
			
			Если СтрокаТЧ.СуммаШтрафа <> 0 И Не ЗначениеЗаполнено(СтрокаТЧ["СтатьяРасходов"]) Тогда
		
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Операции", СтрокаТЧ.НомерСтроки, "СтатьяРасходов");
				ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон(НСтр("ru = 'Не заполнено поле ""%1"" в строке %2 списка ""%3""'"),
						Реквизит.Синоним, СтрокаТЧ.НомерСтроки, ТабличнаяЧасть.Синоним),
					КлючДанных,
					Поле,
					"Объект",
					Отказ);
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Реквизиты = Новый Структура("Операции", "СтатьяРасходов,АналитикаРасходов");
	ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(ЭтотОбъект, Реквизиты, НепроверяемыеРеквизиты, Отказ);

	ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(ЭтотОбъект, "СтатьяРасходов,АналитикаРасходов", НепроверяемыеРеквизиты, Отказ);
	
	ПараметрыПроверки = УчетНДСУП.ПараметрыПроверкиЗаполненияДокументаПоВидуДеятельностиНДС();
	ПараметрыПроверки.ИмяРеквизитаСтатьяРасходов = "СтатьяРасходов";
	ПараметрыПроверки.ИмяРеквизитаАналитикаРасходов = "АналитикаРасходов";
	ПараметрыПроверки.ИмяРеквизитаСтатьяАктивовПассивов = "СтатьяРасходов";
	ПараметрыПроверки.ИмяРеквизитаАналитикаАктивовПассивов = "АналитикаАктивовПассивов";
	УчетНДСУП.ПроверитьЗаполнениеДокументаПоВидуДеятельностиНДС(
		ЭтотОбъект, 
		ЗакупкаПодДеятельность, 
		ПараметрыПроверки, 
		Отказ);
	
	ПроверитьДатыПоездки(Отказ);
	
	ПроверкаВозможностиПроведенияОперации(Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	БронированиеЛокализация.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьВозможностьОтменыПокупкиИДоплаты(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ЭтоЭлектронныйБилет = ЭтоЭлектронныйБилет();
	
	СтрокаТЧ = Операции.Найти(Перечисления.ТипыОперацийСБилетами.Покупка);
	Если СтрокаТЧ <> Неопределено Тогда
		СтавкаНДС = СтрокаТЧ.СтавкаНДС;
	КонецЕсли;
	
	ЭлектронныйБилетСодержитСтрокиОпераций = Документы.ОперацияСЭлектроннымБилетом.ЭлектронныйБилетСодержитСтрокиОпераций(ЭтотОбъект);
	Если ЭлектронныйБилетСодержитСтрокиОпераций Тогда
		СтрокиОперацииПокупки = Операции.НайтиСтроки(Новый Структура("ТипОперации", Перечисления.ТипыОперацийСБилетами.Покупка));
		Для Каждого ОперацияПокупки Из СтрокиОперацииПокупки Цикл
			ОперацияПокупки.Дата = Дата;
		КонецЦикла;
	КонецЕсли;
	
	
	ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, "Операции");
	
	Для Каждого СтрокаТЧ Из Операции Цикл
		
		Если СтрокаТЧ.СуммаШтрафа <> 0 И Не ЗначениеЗаполнено(СтрокаТЧ.ИдентификаторСтрокиШтрафа) Тогда
			СтрокаТЧ.ИдентификаторСтрокиШтрафа = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
		
		Если Не ЭлектронныйБилетСодержитСтрокиОпераций И Не СтрокаТЧ.Дата = НачалоДня(Дата) Тогда
			СтрокаТЧ.Дата = Дата;
		КонецЕсли;
		
	КонецЦикла;
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Запись Тогда
		ПроверитьЗапретИзмененияДанных(Отказ);
	КонецЕсли;
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ОперацияСЭлектроннымБилетом.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	ВзаиморасчетыСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи);
	Если ЭтоЭлектронныйБилет Тогда
		ОтделитьОперацииОтЭлектронногоБилета();
	КонецЕсли;
	
	РассчитатьСуммуДокумента(ЭтоЭлектронныйБилет);
	
	Если ЭтоЭлектронныйБилет Тогда
		Состояние = Документы.ОперацияСЭлектроннымБилетом.НовоеСостояниеБилета(Ссылка, ЭтотОбъект);
	КонецЕсли;
	
	ПараметрыРегистрации = Документы.ОперацияСЭлектроннымБилетом.ПараметрыРегистрацииСчетовФактурПолученных(ЭтотОбъект);
	УчетНДСУП.АктуализироватьСчетаФактурыПолученныеПередЗаписью(ПараметрыРегистрации, РежимЗаписи, ПометкаУдаления, Проведен);
	
	БронированиеЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ОперацияСЭлектроннымБилетом.ПараметрыВыбораСтатейИАналитикДляСписанияПрямымМетодом();
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	Если ЭтоЭлектронныйБилет И ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ПропускатьРегистрациюВНеоперативнуюОчередь");
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("АвансовыйОтчет", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "АвансовыйОтчет"));
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ДополнительныеСвойства.Свойство("ЗаписьБезДвижений") Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ПараметрыРегистрации = Документы.ОперацияСЭлектроннымБилетом.ПараметрыРегистрацииСчетовФактурПолученных(ЭтотОбъект);
	УчетНДСУП.АктуализироватьСчетаФактурыПолученныеПриПроведении(ПараметрыРегистрации);
	
	БронированиеЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	ЗаписатьОперацииБилетаПриЗаписиПроведении(Истина, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ПараметрыРегистрации = Документы.ОперацияСЭлектроннымБилетом.ПараметрыРегистрацииСчетовФактурПолученных(ЭтотОбъект);
	УчетНДСУП.АктуализироватьСчетаФактурыПолученныеПриУдаленииПроведения(ПараметрыРегистрации);
	
	БронированиеЛокализация.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
	Если ЗначениеЗаполнено(АвансовыйОтчет)
		И Не ДополнительныеСвойства.Свойство("НеОбновлятьАвансовыйОтчет") Тогда
		
		ТаблицыДляДвижений = ПроведениеДокументов.ДанныеДокументаДляПроведения(АвансовыйОтчет, "РеестрДокументов");
		РегистрыСведений.РеестрДокументов.ЗаписатьДанные(ТаблицыДляДвижений, АвансовыйОтчет, Неопределено, Отказ);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("АвансовыйОтчет")
		И Не ДополнительныеСвойства.Свойство("НеОбновлятьАвансовыйОтчет")
		И ЗначениеЗаполнено(ДополнительныеСвойства.АвансовыйОтчет)
		И ДополнительныеСвойства.АвансовыйОтчет <> АвансовыйОтчет Тогда
		
		ТаблицыДляДвижений = ПроведениеДокументов.ДанныеДокументаДляПроведения(
			ДополнительныеСвойства.АвансовыйОтчет, "РеестрДокументов");
		РегистрыСведений.РеестрДокументов.ЗаписатьДанные(
			ТаблицыДляДвижений,
			ДополнительныеСвойства.АвансовыйОтчет,
			Неопределено,
			Отказ);
	КонецЕсли;
	
	БронированиеЛокализация.ПриЗаписи(ЭтотОбъект, Отказ);
	
	ЗаписатьОперацииБилетаПриЗаписиПроведении(
		ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись И Не Проведен, Отказ);
	
	СоздатьЗаданияПоДокументуПриЗаписи();
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	БронированиеЛокализация.ПередУдалением(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РассчитатьСуммуДокумента(ЭтоЭлектронныйБилет)
	
	СуммаКВыдачеНакопительная = 0;
	СуммаДокументаНакопительная = 0;
	СуммаНДСНакопительная = 0;
	ТекущийИтог = 0;
	Для Каждого СтрокаТЧ Из Операции Цикл
		
		СуммаШтрафа = 0;
		Если СтрокаТЧ.ТипОперации = Перечисления.ТипыОперацийСБилетами.Покупка
			Или СтрокаТЧ.ТипОперации = Перечисления.ТипыОперацийСБилетами.Доплата Тогда
			
			СуммаОперации = СтрокаТЧ.Сумма;
			СуммаНДСОперации = СтрокаТЧ.СуммаНДС;
			ТекущийИтог = ТекущийИтог + СтрокаТЧ.Сумма;
			СтрокаТЧ.СуммаИтог = ТекущийИтог;
			СуммаКВыдачеНакопительная = СуммаКВыдачеНакопительная + СуммаОперации;
			
		ИначеЕсли СтрокаТЧ.ТипОперации = Перечисления.ТипыОперацийСБилетами.Возврат Тогда
			
			Если ЭтоЭлектронныйБилет Тогда
				СуммаОперации = -СтрокаТЧ.Сумма;
				СуммаНДСОперации = -СтрокаТЧ.СуммаНДС;
				СуммаШтрафа = СтрокаТЧ.СуммаШтрафа;
				СуммаКВыдачеНакопительная = СуммаКВыдачеНакопительная + СуммаОперации;
			Иначе
				СуммаОперации = СтрокаТЧ.Сумма;
				СуммаНДСОперации = СтрокаТЧ.СуммаНДС;
				СуммаКВыдачеНакопительная = СуммаКВыдачеНакопительная - СуммаОперации;
			КонецЕсли;
			
		КонецЕсли;
		
		СуммаДокументаНакопительная = СуммаДокументаНакопительная + СуммаОперации + СуммаШтрафа;
		СуммаНДСНакопительная = СуммаНДСНакопительная + СуммаНДСОперации;
		
	КонецЦикла;
	
	СуммаКВыдаче = СуммаКВыдачеНакопительная;
	СуммаДокумента = СуммаДокументаНакопительная;
	СуммаНДС = СуммаНДСНакопительная;
	
КонецПроцедуры

Процедура ПроверкаВозможностиПроведенияОперации(Отказ)
	
	Если ЭтоЭлектронныйБилет() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйБилет, "Проведен") Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон(НСтр("ru = 'Невозможно провести операцию %1, т.к. не проведен электронный билет'"), Ссылка),
					Ссылка,
					"ЭлектроныйБилет",
					"Объект",
					Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьОперацииБилетаПриЗаписиПроведении(ЗаписыватьОперации, Отказ)
	
	Если ДополнительныеСвойства.Свойство("ОперацииЭлектронногоБилета") И ЗаписыватьОперации Тогда
		Для Каждого ОперацияЭлектронногоБилета Из ДополнительныеСвойства.ОперацииЭлектронногоБилета.Операции Цикл
			
			Попытка
				ОперацияЭлектронногоБилета.Записать(ДополнительныеСвойства.РежимЗаписи);
			Исключение
				Отказ = Истина;
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось записать операцию электронного билета по причине %1'"),
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВозможностьОтменыПокупкиИДоплаты(Отказ)
	
	Если ТипОперации = Перечисления.ТипыОперацийСБилетами.Доплата Тогда
	
		ОперацииПоБилету = Документы.ОперацияСЭлектроннымБилетом.ОперацииЭлектронногоБилета(ЭлектронныйБилет,,Ссылка, Истина);
		СуммыВРазрезеСтавокНДС = ОперацииПоБилету.Скопировать(Новый Структура("Проведен", Истина), "СтавкаНДС,РассчитываемаяСумма");
		СуммыВРазрезеСтавокНДС.Свернуть("СтавкаНДС", "РассчитываемаяСумма");
		
		Для Каждого СтрокаСтавок Из СуммыВРазрезеСтавокНДС Цикл
			Если СтрокаСтавок.РассчитываемаяСумма < 0 Тогда
				Отказ = Истина;
				ТекстСообщения =
				Нстр("ru = 'Невозможно отменить %1, т.к. данная доплата возвращена'");
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, Строка(Ссылка)),,,, Отказ);
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли;
	
	Если ЭтоЭлектронныйБилет() Тогда
		ОперацииПоБилету = Документы.ОперацияСЭлектроннымБилетом.ОперацииЭлектронногоБилета(Ссылка,,Ссылка);
		ПроведенныеОперации = ОперацииПоБилету.НайтиСтроки(Новый Структура("Проведен", Истина));
		Если ПроведенныеОперации.Количество() Тогда
			Отказ = Истина;
			ТекстСообщения =
			Нстр("ru = 'Невозможно отменить %1, т.к. по нему имеются операции'");
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, Строка(Ссылка)),,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоЭлектронныйБилет()
	Возврат Не ЗначениеЗаполнено(ЭлектронныйБилет);
КонецФункции

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный = Пользователи.ТекущийПользователь();
	Валюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками") Тогда
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			ДанныеЗаполнения.Вставить("ХозяйственнаяОперация",
				Перечисления.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо);
		Иначе
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			ЗаполнитьОперациюПоЭлектронномуБилету(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗапретИзмененияДанных(Отказ)
	
	ДанныеДляПроверки = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
	
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("Дата");
	
	Если ЭтоЭлектронныйБилет() Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаПрибытия");
	КонецЕсли;
	
	НепроверяемыеРеквизиты = Новый Структура;
	Для каждого Реквизит Из Метаданные().Реквизиты Цикл
		Если ПроверяемыеРеквизиты.Найти(Реквизит.Имя) = Неопределено Тогда
			НепроверяемыеРеквизиты.Вставить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	НепроверяемыеТабличныеЧасти = Новый Структура;
	НепроверяемыеТабличныеЧасти.Вставить("ДополнительныеРеквизиты");
	НепроверяемыеТабличныеЧасти.Вставить("Сборы");
	
	ИзмененияДокумента = ОбщегоНазначенияУТ.ИзмененияДокумента(ЭтотОбъект, НепроверяемыеРеквизиты, НепроверяемыеТабличныеЧасти);
	
	Если ИзмененияДокумента.Свойство("Реквизиты") Тогда
		Для каждого ИзменениеРеквизита Из ИзмененияДокумента.Реквизиты Цикл
			
			Если ЗначениеЗаполнено(ИзменениеРеквизита.СтароеЗначение) Тогда
				НоваяСтрока = ДанныеДляПроверки.Добавить();
				НоваяСтрока.Дата   = ИзменениеРеквизита.СтароеЗначение;
				НоваяСтрока.Раздел = "АвансовыеОтчеты";
				НоваяСтрока.Объект = Организация;
				
				НоваяСтрока = ДанныеДляПроверки.Добавить();
				НоваяСтрока.Дата   = ИзменениеРеквизита.СтароеЗначение;
				НоваяСтрока.Раздел = "ФинансовыйКонтур";
				НоваяСтрока.Объект = Организация;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ИзменениеРеквизита.НовоеЗначение) Тогда
				НоваяСтрока = ДанныеДляПроверки.Добавить();
				НоваяСтрока.Дата   = ИзменениеРеквизита.НовоеЗначение;
				НоваяСтрока.Раздел = "АвансовыеОтчеты";
				НоваяСтрока.Объект = Организация;
				
				НоваяСтрока = ДанныеДляПроверки.Добавить();
				НоваяСтрока.Дата   = ИзменениеРеквизита.НовоеЗначение;
				НоваяСтрока.Раздел = "ФинансовыйКонтур";
				НоваяСтрока.Объект = Организация;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ИзмененияДокумента.Свойство("ТабличныеЧасти") И ИзмененияДокумента.ТабличныеЧасти.Свойство("Операции") Тогда
		Для каждого ИзменениеОперации Из ИзмененияДокумента.ТабличныеЧасти.Операции Цикл
			Если ЗначениеЗаполнено(ИзменениеОперации.Дата) Тогда
				НоваяСтрока = ДанныеДляПроверки.Добавить();
				НоваяСтрока.Дата   = ИзменениеОперации.Дата;
				НоваяСтрока.Раздел = "АвансовыеОтчеты";
				НоваяСтрока.Объект = Организация;
				
				НоваяСтрока = ДанныеДляПроверки.Добавить();
				НоваяСтрока.Дата   = ИзменениеОперации.Дата;
				НоваяСтрока.Раздел = "ФинансовыйКонтур";
				НоваяСтрока.Объект = Организация;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("НоваяВерсия", Истина);
	ОписаниеДанных.Вставить("Данные",      ЭтотОбъект);
	
	ОписаниеОшибки = "";
	Если ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ДанныеДляПроверки, ОписаниеДанных, ОписаниеОшибки) Тогда
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДатыПоездки(Отказ)

	Если ДатаПрибытия < ДатаОтправления
		И ДатаОтправления - ДатаПрибытия >= 90000 Тогда
		
		ТекстСообщения =
			НСтр("ru = 'Значение в поле ""Дата прибытия"" не может быть меньше значения ""Дата отправления"" более, чем на 25 часов'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "ДатаПрибытия", "Объект", Отказ);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОперациюПоЭлектронномуБилету(ДанныеДляЗаполнения)
	
	Если ДанныеДляЗаполнения.Свойство("ДанныеДляСозданияОперацииБилета") Тогда
		
		КлючевыеРеквизиты =
			СтрСоединить(Документы.ОперацияСЭлектроннымБилетом.КлючевыеРеквизитыЭлектронногоБилета(Ложь), ",");
			
		ДанныеДляСозданияОперацииБилета = ДанныеДляЗаполнения.ДанныеДляСозданияОперацииБилета;
		
		ДанныеЭлектронногоБилета = ДанныеДляСозданияОперацииБилета.ДанныеЭлектронногоБилета;
		Если ДанныеЭлектронногоБилета = Неопределено Тогда
			ДанныеЭлектронногоБилета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйБилет, КлючевыеРеквизиты);
		КонецЕсли;
		
		ОписаниеОперации = ДанныеДляСозданияОперацииБилета.ОписаниеОперации;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЭлектронногоБилета, КлючевыеРеквизиты);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОписаниеОперации);
		ДатаБилета = ДанныеЭлектронногоБилета.Дата;
		
		Если Не ДанныеДляСозданияОперацииБилета.ЭтоРазделениеБилета Тогда
			Дата = Неопределено;
		КонецЕсли;
		
		Если ОписаниеОперации.ЭтоПолныйВозврат Тогда
			ОбработатьПолныйВозврат();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьПолныйВозврат()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭлектронныйБилет", ЭлектронныйБилет);
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса", НачалоДня(ТекущаяДатаСеанса()));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат) КАК ТипОперации,
	|	&ТекущаяДатаСеанса КАК Дата,
	|	СУММА(СуммыВРазрезеСтавок.Сумма) КАК Сумма,
	|	СУММА(СуммыВРазрезеСтавок.СуммаНДС) КАК СуммаНДС,
	|	СуммыВРазрезеСтавок.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ОперацияСЭлектроннымБилетом.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|				ТОГДА -ОперацияСЭлектроннымБилетом.Сумма
	|			ИНАЧЕ ОперацияСЭлектроннымБилетом.Сумма
	|		КОНЕЦ КАК Сумма,
	|		ВЫБОР
	|			КОГДА ОперацияСЭлектроннымБилетом.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|				ТОГДА -ОперацияСЭлектроннымБилетом.СуммаНДС
	|			ИНАЧЕ ОперацияСЭлектроннымБилетом.СуммаНДС
	|		КОНЕЦ КАК СуммаНДС,
	|		ОперацияСЭлектроннымБилетом.СтавкаНДС КАК СтавкаНДС
	|	ИЗ
	|		Документ.ОперацияСЭлектроннымБилетом.Операции КАК ОперацияСЭлектроннымБилетом
	|	ГДЕ
	|		ОперацияСЭлектроннымБилетом.Ссылка = &ЭлектронныйБилет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ОперацияСЭлектроннымБилетом.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|				ТОГДА -СоставОперации.Сумма
	|			ИНАЧЕ СоставОперации.Сумма
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ОперацияСЭлектроннымБилетом.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|				ТОГДА -СоставОперации.СуммаНДС
	|			ИНАЧЕ СоставОперации.СуммаНДС
	|		КОНЕЦ,
	|		СоставОперации.СтавкаНДС
	|	ИЗ
	|		Документ.ОперацияСЭлектроннымБилетом КАК ОперацияСЭлектроннымБилетом
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияСЭлектроннымБилетом.Операции КАК СоставОперации
	|			ПО ОперацияСЭлектроннымБилетом.Ссылка = СоставОперации.Ссылка
	|	ГДЕ
	|		ОперацияСЭлектроннымБилетом.ЭлектронныйБилет = &ЭлектронныйБилет
	|		И НЕ ОперацияСЭлектроннымБилетом.ПометкаУдаления) КАК СуммыВРазрезеСтавок
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыВРазрезеСтавок.СтавкаНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(СуммыВРазрезеСтавок.Сумма) > 0";
	
	СоставОперации = Запрос.Выполнить().Выгрузить();
	Операции.Загрузить(СоставОперации);
	
КонецПроцедуры

Процедура ОтделитьОперацииОтЭлектронногоБилета()
	
	СоздаватьОперацииПоБилету =
		Документы.ОперацияСЭлектроннымБилетом.ЭлектронныйБилетСодержитСтрокиОпераций(ЭтотОбъект);
		
	Если Не СоздаватьОперацииПоБилету Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ОперацииЭлектронногоБилета") Тогда
		
		ОперацииЭлектронногоБилета = Новый Структура;
		ОперацииЭлектронногоБилета.Вставить("Операции", Новый Массив);
		ДополнительныеСвойства.Вставить("ОперацииЭлектронногоБилета", ОперацииЭлектронногоБилета);
		
	КонецЕсли;
	
	ОбновляемыеОперации = ДополнительныеСвойства.ОперацииЭлектронногоБилета.Операции;
	
	ТипыОпераций = Новый Массив;
	ТипыОпераций.Добавить(Перечисления.ТипыОперацийСБилетами.Доплата);
	ТипыОпераций.Добавить(Перечисления.ТипыОперацийСБилетами.Возврат);
	
	СтрокиКУдалению = Новый Массив;
	
	ИзмеренияОпераций = "ТипОперации,Дата,ИдентификаторВерсииСмартвей";
	ТаблицаДляСозданияОпераций = Операции.Выгрузить(, ИзмеренияОпераций);
	ТаблицаДляСозданияОпераций.Свернуть(ИзмеренияОпераций);
	
	ДанныеДляСозданияОперацииБилета = Документы.ОперацияСЭлектроннымБилетом.ДанныеДляСозданияОперацииБилета();
	ЭтоНовыйБилет = ЭтоНовый();
	СсылкаНаЭлектронныйБилет = ?(ЭтоНовыйБилет, ПолучитьСсылкуНового(), Ссылка);
	
	Для Каждого ОписаниеОперации Из ТаблицаДляСозданияОпераций Цикл
		
		Если ОписаниеОперации.ТипОперации = Перечисления.ТипыОперацийСБилетами.Покупка Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяОперация = Документы.ОперацияСЭлектроннымБилетом.СоздатьДокумент();
		
		ДанныеДляЗаполнения = Новый Структура();
		ДанныеДляЗаполнения.Вставить("ЭлектронныйБилет", СсылкаНаЭлектронныйБилет);
		ДанныеДляСозданияОперацииБилета.ДанныеЭлектронногоБилета = ЭтотОбъект;
		ЗаполнитьЗначенияСвойств(ДанныеДляСозданияОперацииБилета.ОписаниеОперации, ОписаниеОперации);
		ДанныеДляСозданияОперацииБилета.ЭтоРазделениеБилета = Истина;
			
		ДанныеДляЗаполнения.Вставить("ДанныеДляСозданияОперацииБилета", ДанныеДляСозданияОперацииБилета);
		
		НоваяОперация.Заполнить(ДанныеДляЗаполнения);
		
		ФильтрСтрок = Новый Структура(ИзмеренияОпераций);
		ЗаполнитьЗначенияСвойств(ФильтрСтрок, ОписаниеОперации);
		СтрокиТекущегоБилета = Операции.НайтиСтроки(ФильтрСтрок);
		Для Каждого СтрокаТекущегоБилета Из СтрокиТекущегоБилета Цикл
			ЗаполнитьЗначенияСвойств(НоваяОперация.Операции.Добавить(), СтрокаТекущегоБилета);
			СтрокиКУдалению.Добавить(СтрокаТекущегоБилета);
		КонецЦикла;
		
		Если Не ЭтоНовыйБилет Тогда
			НоваяОперация.ДополнительныеСвойства.Вставить("ПропускатьРегистрациюВНеоперативнуюОчередь");
		КонецЕсли;
		ОбновляемыеОперации.Добавить(НоваяОперация);
		
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		Операции.Удалить(СтрокаКУдалению);
	КонецЦикла;
	
КонецПроцедуры

#Область НеоперативнаяОчередьЗаданий

Процедура СоздатьЗаданияПоДокументуПриЗаписи()
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПропускатьРегистрациюВНеоперативнуюОчередь")
		ИЛИ Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВидЗадания = Справочники.ВидыНеоперативныхЗаданий.АктуализацияОперацийИСостоянияЭлектронногоБилета;
	
	Задания = РегистрыСведений.ЗаданияНеоперативногоДопроведенияДокументов.СоздатьНаборЗаписей();
	
	НовоеЗадание = Задания.Добавить();
	НовоеЗадание.Организация = Организация;
	НовоеЗадание.ПериодЗадания = Дата;
	НовоеЗадание.Документ = Ссылка;
	НовоеЗадание.ВидЗадания = ВидЗадания;
	НовоеЗадание.ИдентификаторЗаписи = Новый УникальныйИдентификатор;
	
	УстановитьПривилегированныйРежим(Истина);
	Задания.Записать(Ложь);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли