#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ПараметрыПоля = Новый Структура;
	ПараметрыПоля.Вставить("АвтоМаксимальнаяШирина", Элементы.Грузополучатель.АвтоМаксимальнаяШирина);
	ПараметрыПоля.Вставить("МаксимальнаяШирина", Элементы.Грузополучатель.МаксимальнаяШирина);

	События = Новый Структура;
	События.Вставить("ПриИзменении", "ПриИзмененииАУ_ПриемГруза");

	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ПриемГруза", "ГруппаЛево", , 1, "Объект.АУ_ПриемГруза", ПараметрыПоля, События);

	АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычнаяБезОтображения(ЭтаФорма, "АУ_ГруппаЗаявка", "ГруппаПраво", 3, 2);
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_НомерЗаявки", "АУ_ГруппаЗаявка", , 1, "Объект.АУ_НомерЗаявки");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ДатаЗаявки", "АУ_ГруппаЗаявка", , 1, "Объект.АУ_ДатаЗаявки");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ОригиналПолучен", "ГруппаЛево", , 2, "Объект.АУ_ОригиналПолучен");

	Элементы.ГруппаКомментарий.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_ИзменитьКомментарий", "Изменить комментарий", "АУ_ИзменитьКомментарий");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ИзменитьКомментарий", "ГруппаКомментарий", , "АУ_ИзменитьКомментарий", 2, Новый Структура("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеЭлемента.Лево));

	АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычнаяБезОтображения(ЭтаФорма, "АУ_ГруппаЗаявкаКоманды", "ГруппаПраво", 3, 2);
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_ИзменитьНомерЗаявки", "Изменить номер заявки", "АУ_ИзменитьНомерЗаявки");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ИзменитьНомерЗаявки", "АУ_ГруппаЗаявкаКоманды", , "АУ_ИзменитьНомерЗаявки", 2);
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_ИзменитьДатуЗаявки", "Изменить дату заявки", "АУ_ИзменитьДатуЗаявки");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ИзменитьДатуЗаявки", "АУ_ГруппаЗаявкаКоманды", , "АУ_ИзменитьДатуЗаявки", 2);

	Элементы.Водитель.КнопкаВыбора = Истина;
	Элементы.АвтомобильГосударственныйНомер.КнопкаВыбора = Истина;

	ЗаполнитьАдресаПогрузкиИДоставки();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АУ_ВодительНачалоВыбораВместо(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.АУ_Водители.ФормаВыбора", , ЭтаФорма, , , , Новый ОписаниеОповещения("ВодительЗавершениеВыбора", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура АУ_АвтомобильГосударственныйНомерНачалоВыбораВместо(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.АУ_Автомобили.ФормаВыбора", , ЭтаФорма, , , , Новый ОписаниеОповещения("АвтомобильЗавершениеВыбора", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАдресДоставки

&НаКлиенте
Процедура АУ_АдресДоставкиОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)

	ЗаполнитьАдресДоставки(ВыбранноеЗначение);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАдресПогрузки

&НаКлиенте
Процедура АУ_АдресПогрузкиОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)

	ЗаполнитьАдресПогрузки(ВыбранноеЗначение);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АУ_ИзменитьКомментарий(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда

		ОбщегоНазначенияКлиент.СообщитьПользователю("Перед изменением комментария необходимо записать документ !");
		Возврат;

	КонецЕсли;

	ПоказатьВводСтроки(Новый ОписаниеОповещения("АУ_ИзменитьКомментарийЗавершение", ЭтаФорма), Объект.Комментарий);

КонецПроцедуры

&НаКлиенте
Процедура АУ_ИзменитьНомерЗаявки(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда

		ОбщегоНазначенияКлиент.СообщитьПользователю("Перед изменением номера заявки необходимо записать документ !");
		Возврат;

	КонецЕсли;

	ПоказатьВводСтроки(Новый ОписаниеОповещения("АУ_ИзменитьНомерЗаявкаЗавершение", ЭтаФорма), Объект.АУ_НомерЗаявки);

КонецПроцедуры

&НаКлиенте
Процедура АУ_ИзменитьДатуЗаявки(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда

		ОбщегоНазначенияКлиент.СообщитьПользователю("Перед изменением номера заявки необходимо записать документ !");
		Возврат;

	КонецЕсли;

	ПоказатьВводДаты(Новый ОписаниеОповещения("АУ_ИзменитьДатуЗаявкиЗавершение", ЭтаФорма), Объект.АУ_ДатаЗаявки, , Частидаты.Дата);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура АУ_ИзменитьКомментарийЗавершение(Значение, ДопПараметры) Экспорт

	Если НЕ Значение = Неопределено Тогда

		АУ_Привелигированный.ИзменитьРеквизитДокумента(Объект.Ссылка, "Комментарий", Значение);
		Прочитать();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АУ_ИзменитьНомерЗаявкаЗавершение(Значение, ДопПараметры) Экспорт

	Если НЕ Значение = Неопределено Тогда

		АУ_Привелигированный.ИзменитьРеквизитДокумента(Объект.Ссылка, "АУ_НомерЗаявки", Значение);
		Прочитать();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АУ_ИзменитьДатуЗаявкиЗавершение(Значение, ДопПараметры) Экспорт

	Если НЕ Значение = Неопределено Тогда

		АУ_Привелигированный.ИзменитьРеквизитДокумента(Объект.Ссылка, "АУ_ДатаЗаявки", Значение);
		Прочитать();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВодительЗавершениеВыбора(Значение, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(Значение) Тогда

		ЗаполнитьДанныеВодителяВДокумент(Значение);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АвтомобильЗавершениеВыбора(Значение, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(Значение) Тогда

		ЗаполнитьДанныеАвтомобиляВДокумент(Значение);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииАУ_ПриемГруза(Элемент)

	ЗаполнитьАдресаПогрузкиИДоставки();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеВодителяВДокумент(Водитель)

	Объект.Водитель = Водитель;
	ЗаполнитьЗначенияСвойств(Объект, Водитель);

	Если ЗначениеЗаполнено(Водитель.Автомобиль) Тогда

		ЗаполнитьДанныеАвтомобиляВДокумент(Водитель.Автомобиль);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеАвтомобиляВДокумент(Автомобиль)

	Объект.АвтомобильГосударственныйНомер = Автомобиль.Код;
	ЗаполнитьЗначенияСвойств(Объект, Автомобиль);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресПогрузки(ВыбранноеЗначение)

	Адрес = АУ_ПолучениеДанныхСервис.ПолучитьОбъектИзJSON(ВыбранноеЗначение);
	Если НЕ Адрес = Неопределено И ТипЗнч(Адрес) = Тип("Структура") И Адрес.Свойство("value") Тогда

		Объект.АдресПогрузки = Адрес.value;
		Объект.АдресПогрузкиЗначенияПолей = ВыбранноеЗначение;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресДоставки(ВыбранноеЗначение)

	Адрес = АУ_ПолучениеДанныхСервис.ПолучитьОбъектИзJSON(ВыбранноеЗначение);
	Если НЕ Адрес = Неопределено И ТипЗнч(Адрес) = Тип("Структура") И Адрес.Свойство("value") Тогда

		Объект.АдресДоставки = Адрес.value;
		Объект.АдресДоставкиЗначенияПолей = ВыбранноеЗначение;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗаполнитьАдресаПогрузкиИДоставки()
	
	Элементы.АдресПогрузки.СписокВыбора.Очистить();
	Элементы.АдресДоставки.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	|	ВЫРАЗИТЬ(ОрганизацииКонтактнаяИнформация.ЗначенияПолей КАК СТРОКА(1000)) КАК ЗначенияПолей
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Ссылка В(&Ссылка)
	|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Представление,
	|	ВЫРАЗИТЬ(Контрагенты.ЗначенияПолей КАК СТРОКА(1000))
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В(&Ссылка)
	|	И Контрагенты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)";
	
	Массив = Новый Массив;
	Массив.Добавить(АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("ОрганизацияАурум"));
	Массив.Добавить(Объект.Грузополучатель);
	
	Запрос.УстановитьПараметр("Ссылка", Массив);
	
	ТЗАдресовОрганизации = Запрос.Выполнить().Выгрузить();
	
	Для каждого стрКонтакт Из ТЗАдресовОрганизации Цикл
		
		ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(стрКонтакт.ЗначенияПолей);
		Элементы.АдресДоставки.СписокВыбора.Добавить(ЗначенияПолей, стрКонтакт.Представление);
			
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	|	ВЫРАЗИТЬ(ОрганизацииКонтактнаяИнформация.ЗначенияПолей КАК СТРОКА(1000)) КАК ЗначенияПолей
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Ссылка В(&Ссылка)
	|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Представление,
	|	ВЫРАЗИТЬ(Контрагенты.ЗначенияПолей КАК СТРОКА(1000))
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В(&Ссылка)
	|	И Контрагенты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)";
	
	Массив = Новый Массив;
	Массив.Добавить(АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("ОрганизацияАурум"));
	Массив.Добавить(Объект.АУ_ПриемГруза);
	Массив.Добавить(Объект.Грузоотправитель);
	
	Запрос.УстановитьПараметр("Ссылка", Массив);
	
	ТЗАдресов = Запрос.Выполнить().Выгрузить();
	
	Для каждого стрКонтакт Из ТЗАдресов Цикл
	
		ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(стрКонтакт.ЗначенияПолей);
		Элементы.АдресПогрузки.СписокВыбора.Добавить(ЗначенияПолей, стрКонтакт.Представление);
			
	КонецЦикла;
	
КонецФункции

#КонецОбласти
