&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли


	
#Область ОбработчикиСобытийФормы
	
&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ОбновитьТаблицуТаймаутов();	
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	Сохранить("");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ОП = Новый ОписаниеОповещения("СохранитьПослеПодключения",ЭтаФорма);
	_ЛокКонтекст.ЛокЯдро_ПроверитьСоединениеССерверомSMARTS(,,Ложь,,,,ОП);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПослеПодключения(СерверДоступен,ДопПараметры) Экспорт
	
	Если Не СерверДоступен = Истина Тогда
		ОповещениеСохранитьНастройкиВФайл = Новый ОписаниеОповещения("ПредложитьПользователюСохранитьНастройкиВФайлЗавершение", ЭтаФорма);
		ТекстВопроса = НСтр("be = 'У гэты момант сервер Cleverence недаступны для захавання налад'; en = 'Currently, the Cleverence server is unavailable for saving settings.'; es = 'En este momento el servidor de Cleverence no está disponible para guardar las configuraciones'; ka = 'Cleverence სერვერი ამჟამად არ არის ხელმისაწვდომი პარამეტრების შენახვისთვის.'; kk = 'В данный момент сервер Cleverence недоступен для сохранения настроек - Ағымдағы Cleverence сервері параметрлерді сақтау үшін қол жетімді емес'; ro = 'În acest moment, serverul Cleverence nu este disponibil pentru salvarea setărilor'; ru = 'В данный момент сервер Клеверенс недоступен для сохранения настроек.'; tr = 'Şu anda Cleverence sunucusu ayarların kaydedilmesi için kullanılamıyor.'; uk = 'У данний момент сервер Cleverence недоступний для збереження налаштувань.'; uz = 'Hozirgi paytda Cleverence serveri sozlamalarni saqlash uchun mavjud emas.'")
						+ Символы.ПС
						+ НСтр("be = 'Захаваць налады ў файл?'; en = 'Save settings to file?'; es = '¿Guardar ajustes en archivo?'; ka = 'პარამეტრების შენახვა ფაილში?'; kk = 'Параметрлерді файлға сақтау керек пе?'; ro = 'Salvați setările în fișier?'; ru = 'Сохранить настройки в файл?'; tr = 'Ayarları dosyaya kaydetmek istiyor musunuz?'; uk = 'Зберегти налаштування в файл?'; uz = 'Созламаларни файлга сақлаш керакми?  '");
		ПоказатьВопрос(ОповещениеСохранитьНастройкиВФайл, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , _ЛокКонтекст.ЛокЯдро_ТекстВнимание()); 
		Возврат;
	КонецЕсли;
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("НастройкиТаймаутов",_ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("НастройкиТаймаутов"));
	СтруктураНастройки.Вставить("ВерсияОбработкиНастроек",_ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ВерсияОбработкиНастроек"));
	
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкиВФайл(СтруктураНастройки, "НастройкиТаймаутов");
КонецПроцедуры
	
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтаФорма);
	
	_ЛокКонтекст.ЛокЯдро_ПолучитьНастройкиИзФайла("НастройкиТаймаутов", ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(СтруктураНастроек, ДополнительныеПараметры) Экспорт

	Если СтруктураНастроек <> Неопределено 
		И ТипЗнч(СтруктураНастроек) = Тип("Структура") 
		И СтруктураНастроек.Свойство("НастройкиТаймаутов") Тогда
		
		НастройкиТаймаутов = СтруктураНастроек.НастройкиТаймаутов;
		
		ТаблицаТаймаутов.Очистить();																 // 1.Очищаем текущие
		
		_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("НастройкиТаймаутов", НастройкиТаймаутов);	 // 2.Записываем в кэш настройки из файла
		_ЛокКонтекст.ЛокЯдро_ПроверитьНастройкиТаймаутов();											 // 3.Проверяем, обновляем
		
		ОбновитьТаблицуТаймаутов();																	 // 4.Обновляем на форме
		
		_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("НастройкиТаймаутов", НастройкиТаймаутов);// 5.Сохраняем в настройки МС
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройки(Команда)
	ОповещениеВосстановитьНастройки = Новый ОписаниеОповещения("ВосстановитьНастройкиЗавершение", ЭтаФорма);
	
	ТекстВопроса = НСтр("be = 'Бягучыя налады таймаўтаў будуць страчаныя! Будуць аднавіць значэнні па змаўчанні. Працягнуць?'; en = 'Current timeout settings will be lost! Default values will be restored. Continue?'; es = '¡Se perderán las configuraciones de tiempo actuales! Se restaurarán los valores predeterminados. ¿Continuar?'; ka = 'მიმდინარე ტაიმაუტები დაკარგული იქნება! სტანდარტული მნიშვნელობები აღდგება. გაგრძელება?'; kk = 'Уақытша таймаут параметрлері жоқ болады! Өзгертуінің негізгі мәндері қалпына келтіріледі. Жалғастыру керек пе?'; ro = 'Setările actuale ale timeout-ului vor fi pierdute! Valorile implicite vor fi restaurate. Continuați?'; ru = 'Текущие настройки таймаутов будут утеряны! Будут восстановлены значения по умолчанию. Продолжить?'; tr = 'Geçerli zaman aşımı ayarları kaybolacak! Varsayılan değerler geri yüklenecek. Devam etmek istiyor musunuz?'; uk = 'Поточні налаштування таймаутів будуть втрачені! Будуть відновлені значення за замовчуванням. Продовжити?'; uz = ""Текущий таймаутлар sozlamalari yo'q bo'ladi! Aralash qiymatlar tiklanadi. Davom etamizmi?""");
	ПоказатьВопрос(ОповещениеВосстановитьНастройки, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , _ЛокКонтекст.ЛокЯдро_ТекстВнимание()); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаТаймаутов.Очистить();
	
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("НастройкиТаймаутов", Ложь);
	_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("НастройкиТаймаутов", Ложь);
	_ЛокКонтекст.ЛокЯдро_ПроверитьНастройкиТаймаутов();
	
	ОбновитьТаблицуТаймаутов();
				
КонецПроцедуры

#КонецОбласти
	
#Область ВспомогательныеМеханизмы

&НаКлиенте
Процедура ОбновитьТаблицуТаймаутов()
	
	ТаблицаТаймаутов.Очистить();
	НастройкиТаймаутов = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("НастройкиТаймаутов");
	Если НЕ НастройкиТаймаутов = Ложь И ТипЗнч(НастройкиТаймаутов) = Тип("Массив")  Тогда
		Для Каждого СтрокаТаймаута Из НастройкиТаймаутов Цикл
			Если ТипЗнч(СтрокаТаймаута) = Тип("Структура") И СтрокаТаймаута.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;	
			ЗаполнитьЗначенияСвойств(ТаблицаТаймаутов.Добавить(), СтрокаТаймаута);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти	

#Область ОбщиеМеханизмы

&НаКлиенте
Процедура СохранитьНастройки()
	
	МассивТаймаутов = ПолучитьМассивТаймаутов();
	
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("НастройкиТаймаутов", МассивТаймаутов);
	_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("НастройкиТаймаутов", МассивТаймаутов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьПользователюСохранитьНастройкиВФайлЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	 
	СохранитьВФайл("");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивТаймаутов()
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый Структура("ЭтоТаблицаЗначений,КолонкиТаблицыЗначений",Истина,"ТипЗапроса,ТипЗапросаСиноним,Значение,Комментарий"));
	Для Каждого Строка Из ТаблицаТаймаутов Цикл
		Параметр = Новый Структура("ТипЗапроса,ТипЗапросаСиноним,Значение,Комментарий",Строка.ТипЗапроса,Строка.ТипЗапросаСиноним,Строка.Значение,Строка.Комментарий);	
		МассивПараметров.Добавить(Параметр);
	КонецЦикла;
	Возврат МассивПараметров;
КонецФункции

#КонецОбласти

#Если ТолстыйКлиентОбычноеПриложение Тогда 	
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = Новый Структура();
	Для каждого Элемент ИЗ ЭлементыФормы Цикл
		Элементы.Вставить(Элемент.Имя,Элемент);
		Если ТипЗнч(Элемент) = Тип("ТабличноеПоле") Тогда
			Для каждого Колонка ИЗ Элемент.Колонки Цикл
				Элементы.Вставить(Колонка.Имя,Колонка);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Объект = ЭтотОбъект;
#КонецЕсли

