// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

// Устанавливает вариант проверки сертификатов доверителей - не проверять по сроку действия.
//
// Параметры:
//  Параметры - Структура - параметры обработчика обновления.
//                          См. документацию по подсистеме СтандартныеПодсистемы.ОбновлениеВерсииИБ.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбработкаЗавершена = Ложь;
	
	МетаданныеОбъекта = Метаданные.Константы.ВариантПроверкиСертификатовМЧДЭДО;
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя(); 
	ПараметрыОтметкиВыполнения = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
		
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Записать = Ложь;
		
		МенеджерЗначения = Константы.ВариантПроверкиСертификатовМЧДЭДО.СоздатьМенеджерЗначения();
		МенеджерЗначения.Прочитать();
		
		Если МенеджерЗначения.Значение.Пустая() Тогда
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Параметры.ВерсияПодсистемыНаНачалоОбновления, "0.0.0.0") = 0 Тогда
				МенеджерЗначения.Значение = Перечисления.ВариантыПроверкиСертификатовМЧДЭДО.НеПроверятьПоСрокуДействия;
				Записать = Истина;
			Иначе
				МенеджерЗначения.Значение = Перечисления.ВариантыПроверкиСертификатовМЧДЭДО.ПолнаяПроверка;
				Записать = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Записать Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначения);
		Иначе
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(МенеджерЗначения, ПараметрыОтметкиВыполнения);
		КонецЕсли; 
		
		ОбработкаЗавершена = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщения =
			НСтр("ru = 'Не удалось обработать константу ""Вариант проверки сертификатов доверителей МЧД"" по причине:'")
			+ Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение, МетаданныеОбъекта, , ТекстСообщения);
		
	КонецПопытки;
	
	Если ОбработкаЗавершена Тогда
		
		ТекстСообщения = НСтр("ru = 'Обработана константа ""Вариант проверки сертификатов доверителей МЧД"".'");
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта, , ТекстСообщения);
			
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#КонецОбласти

#КонецЕсли