#Область СлужебныйПрограммныйИнтерфейс

#Область МенеджерМногопоточнойОбработкиРасчетов

Функция ПараметрыДанныхМногопоточнойОбработки() Экспорт
	
	ДанныеОбработки = Новый Структура;
	ДанныеОбработки.Вставить("ПоследняяЗапись", Неопределено);
	ДанныеОбработки.Вставить("РазмерПорции", Неопределено);
	ДанныеОбработки.Вставить("УсловиеЗапроса", "");
	ДанныеОбработки.Вставить("ПараметрыЗапроса", Новый Структура);
	
	КортежиВОбработке = Новый ТаблицаЗначений();
	КортежиВОбработке.Колонки.Добавить("ИдПотока", Новый ОписаниеТипов("УникальныйИдентификатор"));
	КортежиВОбработке.Колонки.Добавить("ТипРасчетов", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыРасчетовСПартнерами"));
	КортежиВОбработке.Колонки.Добавить("АналитикаУчетаПоПартнерам", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам"));
	КортежиВОбработке.Колонки.Добавить("ОбъектРасчетов", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
	КортежиВОбработке.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	ДанныеОбработки.Вставить("КортежиВОбработке", КортежиВОбработке);
	
	Возврат ДанныеОбработки;
	
КонецФункции

Функция ДанныеДляОбработки(Параметры, ЭтоПереходСОфлайн = Ложь) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Кортежи.ТипРасчетов КАК ТипРасчетов,
	|	Кортежи.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Кортежи.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Кортежи.Валюта КАК Валюта
	|ПОМЕСТИТЬ втКортежиВРаботе
	|ИЗ
	|	&КортежиВОбработке КАК Кортежи
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипРасчетов,
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта
	|	
	|;
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Задания.КоличествоДокументов КАК КоличествоДокументов,
	|	Задания.ТипРасчетов КАК ТипРасчетов,
	|	Задания.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Задания.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Задания.Валюта КАК Валюта
	|ПОМЕСТИТЬ втКортежиКОбработке
	|ИЗ
	|	РегистрСведений.ЗаданияКРаспределениюРасчетов КАК Задания
	|	ЛЕВОЕ СОЕДИНЕНИЕ втКортежиВРаботе КАК КортежиВРаботе
	|	ПО Задания.ТипРасчетов = КортежиВРаботе.ТипРасчетов
	|		И Задания.ТипРасчетов = КортежиВРаботе.ТипРасчетов
	|		И Задания.АналитикаУчетаПоПартнерам = КортежиВРаботе.АналитикаУчетаПоПартнерам
	|		И Задания.ОбъектРасчетов = КортежиВРаботе.ОбъектРасчетов
	|		И Задания.Валюта = КортежиВРаботе.Валюта
	|ГДЕ 
	|	КортежиВРаботе.ОбъектРасчетов ЕСТЬ NULL
	|	И (Задания.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|			И Задания.ОбъектРасчетов > &ОбъектРасчетов
	|		ИЛИ Задания.АналитикаУчетаПоПартнерам > &АналитикаУчетаПоПартнерам
	|		ИЛИ &БезАналитики)
	|
	|СГРУППИРОВАТЬ ПО
	|	Задания.КоличествоДокументов,
	|	Задания.ТипРасчетов,
	|	Задания.АналитикаУчетаПоПартнерам,
	|	Задания.ОбъектРасчетов,
	|	Задания.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипРасчетов,
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта
	|;
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК ОсталосьЗаданий
	|ИЗ
	|	РегистрСведений.ЗаданияКРаспределениюРасчетов КАК Задания
	|;
	|
	|ВЫБРАТЬ
	|	КортежиКОбработке.КоличествоДокументов КАК КоличествоДокументов,
	|	КортежиКОбработке.ТипРасчетов КАК ТипРасчетов,
	|	КортежиКОбработке.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	КортежиКОбработке.ОбъектРасчетов КАК ОбъектРасчетов,
	|	КортежиКОбработке.Валюта КАК Валюта
	|ИЗ
	|	втКортежиКОбработке КАК КортежиКОбработке
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоДокументов УБЫВ,
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов
	|;
	|
	|ВЫБРАТЬ
	|	Задания.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ЭтоРасчетыСКлиентами,
	|	Задания.ТипРасчетов КАК ТипРасчетов,
	|	Задания.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Задания.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Задания.ОбъектРасчетов.Объект КАК Объект,
	|	Задания.Валюта КАК Валюта,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) КАК АналитикаУчетаПоПартнерамПриемник,
	|	ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка) КАК ОбъектРасчетовПриемник,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаПриемник,
	|	Задания.Документ КАК Документ,
	|	МАКСИМУМ(Задания.Приоритет) КАК Приоритет,
	|	ВЫБОР КОГДА МАКСИМУМ(Задания.Приоритет) = 2
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПоДаннымОбъектаРасчетовИсточника,
	|	МИНИМУМ(Задания.ДатаПересчета) КАК ДатаПересчета,
	|	МИНИМУМ(Задания.ДатаПересчета) КАК ДатаНачалаПересчета,
	|	МИНИМУМ(ВЫБОР КОГДА &ЭтоПереходСОфлайн
	|					ИЛИ ТИПЗНАЧЕНИЯ(Задания.Документ) В (&СписокТиповРегистраторовПланов)
	|				ТОГДА ДАТАВРЕМЯ(3999,1,1)
	|				ИНАЧЕ Задания.ПериодКонтроляИзменений
	|			КОНЕЦ) КАК ПериодКонтроляИзмененийИСозданияЗаданий,
	|	КортежиКОбработке.КоличествоДокументов КАК КоличествоДокументов
	|ИЗ
	|	РегистрСведений.ЗаданияКРаспределениюРасчетов КАК Задания
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКортежиКОбработке КАК КортежиКОбработке
	|	ПО Задания.ТипРасчетов = КортежиКОбработке.ТипРасчетов
	|		И Задания.АналитикаУчетаПоПартнерам = КортежиКОбработке.АналитикаУчетаПоПартнерам
	|		И Задания.ОбъектРасчетов = КортежиКОбработке.ОбъектРасчетов
	|		И Задания.Валюта = КортежиКОбработке.Валюта
	|ГДЕ
	|	&Условие
	|
	|СГРУППИРОВАТЬ ПО
	|	Задания.ТипРасчетов,
	|	Задания.АналитикаУчетаПоПартнерам,
	|	Задания.ОбъектРасчетов,
	|	Задания.Валюта,
	|	Задания.Документ,
	|	КортежиКОбработке.КоличествоДокументов
	|
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(Задания.Приоритет) ВОЗР,
	|	КоличествоДокументов УБЫВ,
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов";

	Если Параметры.РазмерПорции = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, " ПЕРВЫЕ 1000", "");
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1000", Формат(Параметры.РазмерПорции, "ЧН=0; ЧГ=0"));
	УсловиеЗапроса = Параметры.УсловиеЗапроса;
	Если НЕ ЗначениеЗаполнено(УсловиеЗапроса) Тогда
		УсловиеЗапроса = "ИСТИНА";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие", УсловиеЗапроса);

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КоличествоДокументов", 0);
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", Неопределено);
	Запрос.УстановитьПараметр("ОбъектРасчетов", Неопределено);
	Запрос.УстановитьПараметр("БезАналитики", Истина);
	Запрос.УстановитьПараметр("КортежиВОбработке", Параметры.КортежиВОбработке);
	Запрос.УстановитьПараметр("ЭтоПереходСОфлайн", ЭтоПереходСОфлайн);
	Запрос.УстановитьПараметр("СписокТиповРегистраторовПланов", ОперативныеВзаиморасчетыСервер.СписокТиповРегистраторовПланов());

	ПоследняяЗапись = Параметры.ПоследняяЗапись;
	Если ПоследняяЗапись <> Неопределено Тогда
		Запрос.УстановитьПараметр("КоличествоДокументов", ПоследняяЗапись.КоличествоДокументов);
		Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", ПоследняяЗапись.АналитикаУчетаПоПартнерам);
		Запрос.УстановитьПараметр("ОбъектРасчетов", ПоследняяЗапись.ОбъектРасчетов);
		Запрос.УстановитьПараметр("БезАналитики", НЕ ЗначениеЗаполнено(ПоследняяЗапись.АналитикаУчетаПоПартнерам));
	КонецЕсли;

	Для Каждого Параметр Из Параметры.ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Данные = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить();
	Данные.Индексы.Добавить("ТипРасчетов,АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта");
	Кортежи = РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выгрузить();
	Задания = РезультатЗапроса[РезультатЗапроса.ВГраница()-2].Выбрать();
	Если Задания.Следующий() Тогда
		ОсталосьОбработать = Задания.ОсталосьЗаданий;
	Иначе
		ОсталосьОбработать = 0;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Кортежи", Кортежи);
	Результат.Вставить("Данные", Данные);
	Результат.Вставить("ОсталосьОбработать", ОсталосьОбработать);

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеИОчисткаРегистров

// Регистрирует объекты расчетов для отложенного расчета по срокам и планом
// 
// Параметры:
// 	Регистратор - ДокументСсылка - Регистратор, инициатор регистрации заданий (проводимый документ).
// 	ТаблицаИзменений - см. ОперативныеВзаиморасчетыСервер.ТаблицаКРаспределению
Процедура ЗарегистрироватьИзмененияКОтложенномуРаспределению(Регистратор, ТаблицаИзменений) Экспорт
	
	Для Каждого СтрокаИзменений Из ТаблицаИзменений Цикл
		
		НаборЗаписей = РегистрыСведений.ЗаданияКРаспределениюРасчетов.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.ТипРасчетов.Установить(СтрокаИзменений.ТипРасчетов);
		НаборЗаписей.Отбор.АналитикаУчетаПоПартнерам.Установить(СтрокаИзменений.АналитикаУчетаПоПартнерам);
		НаборЗаписей.Отбор.ОбъектРасчетов.Установить(СтрокаИзменений.ОбъектРасчетов);
		НаборЗаписей.Отбор.Валюта.Установить(СтрокаИзменений.Валюта);
		
		НаборЗаписей.Отбор.ДатаПересчета.Установить(СтрокаИзменений.ДатаНачалаПересчета);
		НаборЗаписей.Отбор.Документ.Установить(Регистратор);
		
		НовСтр = НаборЗаписей.Добавить();
		НовСтр.ТипРасчетов = СтрокаИзменений.ТипРасчетов;
		НовСтр.АналитикаУчетаПоПартнерам = СтрокаИзменений.АналитикаУчетаПоПартнерам;
		НовСтр.ОбъектРасчетов = СтрокаИзменений.ОбъектРасчетов;
		НовСтр.Валюта = СтрокаИзменений.Валюта;
		НовСтр.ДатаПересчета = СтрокаИзменений.ДатаНачалаПересчета;
		НовСтр.Документ = Регистратор;
		НовСтр.Приоритет = ?(СтрокаИзменений.ПоДаннымОбъектаРасчетовИсточника, 2, 1);
		НовСтр.КоличествоДокументов = 1;
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет распределение расчетов по текущим заданиям к распределению в регистрах ЗаданияКРаспределениюРасчетов и ЗаданияКРаспределениюВзаиморасчетов
// 
// Параметры:
// 	Параметры - Структура, Неопределено - В структуре передается таблица заданий для распределения:
// 	 *ДанныеКОтработке - см. ДанныеДляОбработки.
// 	АдресРезультата - Строка - адрес временного хранилища, в которое будет помещен результат работы процедуры.
Процедура ВыполнитьОтложенноеРаспределение(Параметры = Неопределено, АдресРезультата = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Если НЕ Константы.НоваяАрхитектураВзаиморасчетов.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры <> Неопределено И Параметры.Свойство("ДанныеКОбработке") Тогда
		ДанныеКОбработке = Параметры.ДанныеКОбработке;
	Иначе
		ПараметрыДанных = ПараметрыДанныхМногопоточнойОбработки();
		ДанныеКОбработке = ДанныеДляОбработки(ПараметрыДанных).Данные;
	КонецЕсли;
	
	ТаблицаОбъектовОплаты = Новый ТаблицаЗначений;
	ТаблицаОбъектовОплаты.Колонки.Добавить("ОбъектОплаты", Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ОбъектРасчетов.Тип));
	ТаблицаОбъектовОплаты.Колонки.Добавить("ОбъектРасчетов", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
	ТаблицаОбъектовОплаты.Колонки.Добавить("ЭтоРасчетыСКлиентами", Новый ОписаниеТипов("Булево"));
	ТаблицаОбъектовОплаты.Индексы.Добавить("ЭтоРасчетыСКлиентами, ОбъектОплаты, ОбъектРасчетов");
	
	ПараметрыОтбораВТаблицеОбъектовОплаты = Новый Структура;
	ПараметрыОтбораВТаблицеОбъектовОплаты.Вставить("ОбъектОплаты", Неопределено);
	ПараметрыОтбораВТаблицеОбъектовОплаты.Вставить("ОбъектРасчетов", Справочники.ОбъектыРасчетов.ПустаяСсылка());
	ПараметрыОтбораВТаблицеОбъектовОплаты.Вставить("ЭтоРасчетыСКлиентами", Ложь);
	
	НеобходимоДополнениеТаблицыИзменений = Истина;
	Если Параметры <> Неопределено Тогда
		НеобходимоДополнениеТаблицыИзменений = Параметры.ДополнитьРаспределитьПриемники;
	КонецЕсли;
	РегистрироватьЗаданияПоПриемникам = Ложь;
	Если Параметры <> Неопределено Тогда
		Параметры.Свойство("РегистрироватьЗаданияПоПриемникам", РегистрироватьЗаданияПоПриемникам);
	КонецЕсли;
	
	Если НеобходимоДополнениеТаблицыИзменений Тогда
		Для Каждого СтрокаТаблицы Из ДанныеКОбработке Цикл
			СтрокаТаблицы.ПоДаннымОбъектаРасчетовИсточника = СтрокаТаблицы.Приоритет = 2;
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыРаспределения = ОперативныеВзаиморасчетыСервер.ПараметрыРаспределенияРасчетов();
	ПараметрыРаспределения.ДополнитьРаспределитьПриемники = НеобходимоДополнениеТаблицыИзменений;
	ПараметрыРаспределения.РегистрироватьЗаданияПоПриемникам = РегистрироватьЗаданияПоПриемникам;
	
	НачатьТранзакцию();
	
	Попытка
		
		ОперативныеВзаиморасчетыСервер.ЗаполнитьОперативныеВзаиморасчетыПоТаблице(ПараметрыРаспределения, ДанныеКОбработке);
		
		Для Каждого Запись Из ДанныеКОбработке Цикл
			
			ОперативныеВзаиморасчетыСервер.ОтметитьВыполнениеЗадания(Запись,"Документ");
			
			Если ЗначениеЗаполнено(Запись.Объект) Тогда
				
				ЗаполнитьЗначенияСвойств(ПараметрыОтбораВТаблицеОбъектовОплаты, Запись);
				ПараметрыОтбораВТаблицеОбъектовОплаты.ОбъектОплаты = Запись.Объект;
				
				НайденныеСтроки = ТаблицаОбъектовОплаты.НайтиСтроки(ПараметрыОтбораВТаблицеОбъектовОплаты);
				
				Если НайденныеСтроки.Количество() = 0 Тогда
					НовСтр = ТаблицаОбъектовОплаты.Добавить();
					НовСтр.ЭтоРасчетыСКлиентами = Запись.ЭтоРасчетыСКлиентами;
					НовСтр.ОбъектРасчетов = Запись.ОбъектРасчетов;
					НовСтр.ОбъектОплаты = Запись.Объект;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
	// Для определения состояний заказов используются данные распределенных расчетов
	ОтразитьСостоянияЗаказов(ДанныеКОбработке);
	
	РегистрыСведений.ГрафикПлатежей.РассчитатьГрафикПлатежейПоРасчетамСКлиентами(
				ТаблицаОбъектовОплаты.Скопировать(Новый Структура("ЭтоРасчетыСКлиентами", Истина)));
	РегистрыСведений.ГрафикПлатежей.РассчитатьГрафикПлатежейПоРасчетамСПоставщиками(
				ТаблицаОбъектовОплаты.Скопировать(Новый Структура("ЭтоРасчетыСКлиентами", Ложь)));
КонецПроцедуры

// Очищает оперативные регистры взаиморасчетов и удаляет служебные регистраторы.
// 
// Параметры:
//  ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов
//  АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика учета по партнерам
Процедура ОчиститьРегистрыВзаиморасчетовИУдалитьСлужебныеРегистраторы(ОбъектРасчетов = Неопределено, АналитикаУчетаПоПартнерам = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектРасчетов", ОбъектРасчетов);
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", АналитикаУчетаПоПартнерам);
	Запрос.Текст = "ВЫБРАТЬ
	|	РегистраторРасчетов.Ссылка КАК Ссылка,
	|	РегистраторРасчетов.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	Документ.РегистраторРасчетов КАК РегистраторРасчетов
	|ГДЕ
	|	РегистраторРасчетов.ОбъектРасчетов = &ОбъектРасчетов
	|	И РегистраторРасчетов.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам";
	
	Если ОбъектРасчетов = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистраторРасчетов.ОбъектРасчетов = &ОбъектРасчетов", "Истина");
	КонецЕсли;

	Если АналитикаУчетаПоПартнерам = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"РегистраторРасчетов.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам", "Истина");
	КонецЕсли;
	
	ТаблицаРегистраторРасчетов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущийДокумент Из ТаблицаРегистраторРасчетов Цикл

		Если ТекущийДокумент.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
			ОчиститьРегистрВзаиморасчетовПоДокументу(ТекущийДокумент.Ссылка, "РасчетыСКлиентамиПоСрокам");
			ОчиститьРегистрВзаиморасчетовПоДокументу(ТекущийДокумент.Ссылка, "РасчетыСКлиентамиПланОплат");
			ОчиститьРегистрВзаиморасчетовПоДокументу(ТекущийДокумент.Ссылка, "РасчетыСКлиентамиПланОтгрузок");
		Иначе
			ОчиститьРегистрВзаиморасчетовПоДокументу(ТекущийДокумент.Ссылка, "РасчетыСПоставщикамиПоСрокам");
			ОчиститьРегистрВзаиморасчетовПоДокументу(ТекущийДокумент.Ссылка, "РасчетыСПоставщикамиПланОплат");
			ОчиститьРегистрВзаиморасчетовПоДокументу(ТекущийДокумент.Ссылка, "РасчетыСПоставщикамиПланПоставок");
		КонецЕсли;

	КонецЦикла;
	
	СписокДокументовКОбработке = ОбщегоНазначенияКлиентСервер.СвернутьМассив(
		ТаблицаРегистраторРасчетов.ВыгрузитьКолонку("Ссылка"));
		
	Если СписокДокументовКОбработке.Количество() > 0 Тогда

		Параметры = Новый Структура;
		Параметры.Вставить("ДанныеКОбработке", СписокДокументовКОбработке);

		УдалитьСлужебныеРегистраторы(Параметры);

	КонецЕсли;
	
КонецПроцедуры

// Очищает регистры взаиморасчетов.
// 
// Параметры:
//  ТолькоПлановыеРасчеты - Булево - Не нужно очищать фактические расчеты.
Процедура ОчиститьРегистрыВзаиморасчетов(ТолькоПлановыеРасчеты = Ложь) Экспорт
	
	ОписаниеЗамераОчистки = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Взаиморасчеты.ОчисткаРегистров.Многопоточный");
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ОписаниеЗамераОчистки = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Взаиморасчеты.ОчисткаРегистров.ФайловаяБаза");
	КонецЕсли;
	
	ВсегоОбработано = 0;
	Если ТолькоПлановыеРасчеты Тогда
		ОчиститьРегистр("РасчетыСКлиентамиПланОплат", ВсегоОбработано);
		ОчиститьРегистр("РасчетыСКлиентамиПланОтгрузок", ВсегоОбработано);
		ОчиститьРегистр("РасчетыСПоставщикамиПланОплат", ВсегоОбработано);
		ОчиститьРегистр("РасчетыСПоставщикамиПланПоставок", ВсегоОбработано);
	Иначе
		ОписаниеЗамераОтключениеИтогов = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Взаиморасчеты.ОчисткаРегистров.ОтключениеИтогов");
		ОтключитьИтогиРегистровРасчетов();
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамераОтключениеИтогов, 1);
		
		ОписаниеЗамераУдалениеДвижений = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Взаиморасчеты.ОчисткаРегистров.УдалениеДвижений");
		ОчиститьРегистр("РасчетыСКлиентамиПоСрокам", ВсегоОбработано);
		ОчиститьРегистр("РасчетыСКлиентамиПланОплат", ВсегоОбработано);
		ОчиститьРегистр("РасчетыСКлиентамиПланОтгрузок", ВсегоОбработано);
		ОчиститьРегистр("РасчетыСПоставщикамиПоСрокам", ВсегоОбработано);
		ОчиститьРегистр("РасчетыСПоставщикамиПланОплат", ВсегоОбработано);
		ОчиститьРегистр("РасчетыСПоставщикамиПланПоставок", ВсегоОбработано);
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамераУдалениеДвижений, ВсегоОбработано / 100);
		
		ОписаниеЗамераВключитьИтоги = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Взаиморасчеты.ОчисткаРегистров.ВключениеИтогов");
		ВключитьИтогиРегистровРасчетов();
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамераВключитьИтоги, 1);
		
		УдалитьСлужебныеРегистраторыМногопоточно();
		УдалитьСистемныеКорректировкиРегистров(Дата(1,1,1));
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамераОчистки, ВсегоОбработано / 100);
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Завершена очистка новых регистров'");
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);
		
КонецПроцедуры

//Очищает переданный регистр расчетов.
Процедура ОчиститьРегистр(ИмяРегистра, ВсегоОбработано = 0) Экспорт
	
	Если НЕ ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		КоличествоЗаписей = ВыполнитьОчисткуРегистраМногопоточно(ИмяРегистра);
		ВсегоОбработано = ВсегоОбработано + КоличествоЗаписей;
		
	Иначе
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Расчеты.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
		|ГДЕ
		|	Расчеты.Регистратор ССЫЛКА Документ.РегистраторРасчетов";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.РасчетыСКлиентамиПоСрокам", "РегистрНакопления." + ИмяРегистра);
		Запрос = Новый Запрос(ТекстЗапроса);
		Выборка = Запрос.Выполнить().Выбрать();
		ВсегоОбработано = ВсегоОбработано + Выборка.Количество();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Завершена очистка регистра'") + ": " + ИмяРегистра;
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);
	
КонецПроцедуры

//Очищает переданный регистр расчетов по регистратору
Процедура ОчиститьРегистрВзаиморасчетовПоДокументу(Регистратор, ИмяРегистра) Экспорт
	
	НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать();

КонецПроцедуры

//Очищает переданный регистр расчетов в несколько потоков.
// 
// Параметры:
// 	ИмяРегистра - Строка - Имя очищаемого регистра накопления
// Возвращаемое значение:
// 	Число - Количество обработанных регистраторов
//
Функция ВыполнитьОчисткуРегистраМногопоточно(ИмяРегистра) Экспорт
	
	Потоки = Новый Массив;
	КоличествоСвободныхПотоков = 1; // КоличествоПотоковРаспределенияВзаиморасчетов(); до исправления 10231410
	КоличествоОбъектовДляОчистки = РазмерПорцииОбработкиВОдномПотоке() * КоличествоСвободныхПотоков;
	// для избежания взаимоблокировок при записи даты минимальных итогов в таблицу AccumRegOpt
	Первый = ДанныеДляОчистки(ИмяРегистра, Неопределено, 1);
	Если Первый.Следующий() Тогда
		НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей
		НаборЗаписей.Отбор.Регистратор.Установить(Первый.Регистратор);
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;
	МоментВремени = Неопределено;
	КонтрольныйЗапуск = 3;
	КоличествоОбработанныхЗаписей = 0;
	Пока КоличествоОбъектовДляОчистки > 0 И КонтрольныйЗапуск > 0 Цикл
		
		Если КоличествоСвободныхПотоков > 0 Тогда
			
			РазмерВыборки = РазмерПорцииОбработкиВОдномПотоке() * КоличествоСвободныхПотоков;
			ВыборкаДляОчистки = ДанныеДляОчистки(ИмяРегистра, МоментВремени, РазмерВыборки);
			КоличествоОбработанныхЗаписей = КоличествоОбработанныхЗаписей + ВыборкаДляОчистки.Количество();
			КоличествоОбъектовДляОчистки = ВыборкаДляОчистки.Количество();
			Если КоличествоОбъектовДляОчистки > 0 Тогда
				
				ДанныеПотока = Новый Массив;
				Пока ВыборкаДляОчистки.Следующий() Цикл
					
					МоментВремени = ВыборкаДляОчистки.МоментВремени;
					ДанныеПотока.Добавить(ВыборкаДляОчистки.Регистратор);
					Если ДанныеПотока.Количество() = РазмерПорцииОбработкиВОдномПотоке() Тогда
						Поток = НовоеОписаниеПотока("ОперативныеВзаиморасчетыСервер.УдалитьЗаписиДокументов");
						Поток.НаименованиеЗадания = НСтр("ru = 'Очистка регистра'") + " " + ИмяРегистра;
						Поток.ПараметрыПроцедуры.Вставить("ДанныеКОбработке", ДанныеПотока);
						Поток.ПараметрыПроцедуры.Вставить("ИмяРегистра", ИмяРегистра);
						ЗапуститьОбработкуВФоне(Поток);
						Потоки.Добавить(Поток);
						ДанныеПотока = Новый Массив;
					КонецЕсли;
					
				КонецЦикла;
				
				Если ДанныеПотока.Количество() > 0 Тогда
					Поток = НовоеОписаниеПотока("ОперативныеВзаиморасчетыСервер.УдалитьЗаписиДокументов");
					Поток.НаименованиеЗадания = НСтр("ru = 'Очистка регистра'") + " " + ИмяРегистра;
					Поток.ПараметрыПроцедуры.Вставить("ДанныеКОбработке", ДанныеПотока);
					Поток.ПараметрыПроцедуры.Вставить("ИмяРегистра", ИмяРегистра);
					ЗапуститьОбработкуВФоне(Поток);
					Потоки.Добавить(Поток);
				КонецЕсли;
				
			ИначеЕсли КонтрольныйЗапуск > 0 Тогда
				МоментВремени = Неопределено;
				КонтрольныйЗапуск = КонтрольныйЗапуск - 1;
			КонецЕсли;
			
		КонецЕсли;
		
		ОжидатьЗавершениеПотока(Поток);
		
		ЗавершитьПотокиВыполнившиеФЗ(Потоки);
		
		КоличествоДоступныхПотоков = 1; // КоличествоПотоковРаспределенияВзаиморасчетов(); до исправления 10231410
		КоличествоСвободныхПотоков = Макс(КоличествоДоступныхПотоков - Потоки.Количество(), 0);
		
	КонецЦикла;
	
	ОжидатьЗавершениеВсехПотоков(Потоки);
	
	Возврат КоличествоОбработанныхЗаписей;
	
КонецФункции

Процедура УдалитьСлужебныеРегистраторыМногопоточно()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РегистраторРасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РегистраторРасчетов КАК РегистраторРасчетов";
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоОбработанныхЗаписей = Выборка.Количество();
	РазмерПорцииОдномПотоке = Цел(Выборка.Количество()/КоличествоПотоковРаспределенияВзаиморасчетов()) + 1;
	Потоки = Новый Массив;
	ДанныеПотока = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ДанныеПотока.Добавить(Выборка.Ссылка);
		Если ДанныеПотока.Количество() = РазмерПорцииОдномПотоке Тогда
			Поток = НовоеОписаниеПотока("ОперативныеВзаиморасчетыСервер.УдалитьСлужебныеРегистраторы");
			Поток.НаименованиеЗадания = НСтр("ru = 'Удаление служебных регистраторов'");
			Поток.ПараметрыПроцедуры.Вставить("ДанныеКОбработке", ДанныеПотока);
			ЗапуститьОбработкуВФоне(Поток);
			Потоки.Добавить(Поток);
			ДанныеПотока = Новый Массив;
		КонецЕсли;
	КонецЦикла;
	
	Если ДанныеПотока.Количество() > 0 Тогда
		Поток = НовоеОписаниеПотока("ОперативныеВзаиморасчетыСервер.УдалитьСлужебныеРегистраторы");
		Поток.НаименованиеЗадания = НСтр("ru = 'Удаление служебных регистраторов'");
		Поток.ПараметрыПроцедуры.Вставить("ДанныеКОбработке", ДанныеПотока);
		ЗапуститьОбработкуВФоне(Поток);
		Потоки.Добавить(Поток);
		ДанныеПотока = Новый Массив;
	КонецЕсли;
	
	ОжидатьЗавершениеВсехПотоков(Потоки,,КоличествоОбработанныхЗаписей);
	
КонецПроцедуры

Функция ДанныеДляОчистки(ИмяРегистра, МоментВремени, РазмерПорции = 0)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Расчеты.МоментВремени КАК МоментВремени,
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|ГДЕ
	|	Расчеты.Регистратор ССЫЛКА Документ.РегистраторРасчетов
	|	И (&БезОтбора ИЛИ Расчеты.МоментВремени > &МоментВремени)
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.МоментВремени,
	|	Расчеты.Регистратор
	|УПОРЯДОЧИТЬ ПО
	|	Расчеты.МоментВремени"; // сортировать только по возрастанию периода для избежания взаимоблокировок при записи даты минимальных итогов в таблицу AccumRegOpt 
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.РасчетыСКлиентамиПоСрокам", "РегистрНакопления."+ИмяРегистра);
	Если РазмерПорции > 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1000", Формат(РазмерПорции, "ЧН=0; ЧГ=0"));
	КонецЕсли;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	Если МоментВремени = Неопределено Тогда
		Запрос.УстановитьПараметр("МоментВремени", Новый МоментВремени('00010101'));
	КонецЕсли;
	Запрос.УстановитьПараметр("БезОтбора", МоментВремени = Неопределено);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка;
	
КонецФункции

//Заполнение новых регистров по всем объектам расчетов.
// 
// Параметры:
//  ТолькоПлановыеРасчеты - Булево - Только плановые расчеты
Процедура ЗаполнитьПоВсемРасчетам(ТолькоПлановыеРасчеты = Ложь) Экспорт
	
	ОчиститьРегистрыВзаиморасчетов(ТолькоПлановыеРасчеты);
	
	ПараметрыРаспределения = ОперативныеВзаиморасчетыСервер.ПараметрыРаспределенияРасчетов();
	ПараметрыРаспределения.ДополнитьРаспределитьПриемники = Истина;
	ПараметрыРаспределения.ТолькоПлановыеРасчеты = ТолькоПлановыеРасчеты;
	
	ОперативныеВзаиморасчетыСервер.ЗаполнитьОперативныеВзаиморасчетыПоТаблице(ПараметрыРаспределения,ПолучитьВсеОбъекты());

КонецПроцедуры

Процедура УдалитьЗаписиДокументов(Параметры, АдресРезультата = Неопределено) Экспорт
	
	ДанныеКОбработке = Параметры.ДанныеКОбработке;
	ИмяРегистра = Параметры.ИмяРегистра;
	КоличествоРегистраторов = ДанныеКОбработке.Количество();
	Для Каждого Регистратор Из ДанныеКОбработке Цикл
		НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей
		НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
	КонецЦикла;
	
	Если АдресРезультата <> Неопределено Тогда
		Результат = Новый Структура("КоличествоОбработанныхЗаписей", КоличествоРегистраторов);
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьСлужебныеРегистраторы(Параметры, АдресРезультата = Неопределено) Экспорт
	
	ДанныеКОбработке = Параметры.ДанныеКОбработке;
	КоличествоРегистраторов = ДанныеКОбработке.Количество();
	Для Каждого Регистратор Из ДанныеКОбработке Цикл
		
		ДокументОбъект = Регистратор.ПолучитьОбъект();
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Удалить();
		
	КонецЦикла;
	
	Если АдресРезультата <> Неопределено Тогда
		Результат = Новый Структура("КоличествоОбработанныхЗаписей", КоличествоРегистраторов);
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИсправлениеОшибок

// Формирует текст запроса для поиска некорректных данных в расчетных регистрах. 
// 
// Параметры:
// 	ИмяВТ - Строка - Имя временной таблицы для помещения результата
// 	БезРучныхКорректировок - Булево - необходимость исключения из результата запроса Аналитик расчетов по партнерам 
// 	                                  и Объектов расчетов, по которым введены ручные корректировки регистров.
// Возвращаемое значение:
// 	Строка - Текст запроса
Функция ТекстЗапросаНекорректныхОстаткиВзаиморасчетовПоСрокам(ИмяВТ = "", БезРучныхКорректировок = Истина) Экспорт
	
	МассивТекстовЗапросов = Новый Массив;
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Ключи.Ссылка      КАК АналитикаУчетаПоПартнерам,
		|	Ключи.Организация КАК Организация
		|ПОМЕСТИТЬ ВтАналитика
		|ИЗ
		|	Справочник.КлючиАналитикиУчетаПоПартнерам КАК Ключи
		|ГДЕ
		|	Ключи.Организация В (&МассивОрганизаций)
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаПоПартнерам";
	МассивТекстовЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	МИНИМУМ(ВложенныйЗапрос.Период) КАК Период
		|ПОМЕСТИТЬ ПериодВводаОстатков
		|ИЗ (
		|	ВЫБРАТЬ
		|		Ввод.Дата КАК Период
		|	ИЗ
		|		Документ.ВводОстатковВзаиморасчетов КАК Ввод
		|	ГДЕ
		|		Ввод.Проведен
		|	) КАК ВложенныйЗапрос
		|;
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ТипРасчетов                           КАК ТипРасчетов,
		|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
		|	ВложенныйЗапрос.ОбъектРасчетов                        КАК ОбъектРасчетов,
		|	ВложенныйЗапрос.Валюта                                КАК Валюта,
		|	СУММА(ВложенныйЗапрос.Сумма)                          КАК Сумма,
		|	СУММА(ВложенныйЗапрос.СуммаПоСрокам)                  КАК СуммаПоСрокам
		|ПОМЕСТИТЬ ВтОстатки
		|ИЗ (ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
		|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам                     КАК АналитикаУчетаПоПартнерам,
		|		РасчетыСКлиентами.ОбъектРасчетов                                КАК ОбъектРасчетов,
		|		РасчетыСКлиентами.Валюта                                        КАК Валюта,
		|		
		|		РасчетыСКлиентами.СуммаОстаток                                  КАК Сумма,
		|		0                                                               КАК СуммаПоСрокам
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентами.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыСКлиентами
		|	ГДЕ
		|		РасчетыСКлиентами.СуммаОстаток <> 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)                     КАК ТипРасчетов,
		|		РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам                                 КАК АналитикаУчетаПоПартнерам,
		|		РасчетыСКлиентамиПоСрокам.ОбъектРасчетов                                            КАК ОбъектРасчетов,
		|		РасчетыСКлиентамиПоСрокам.Валюта                                                    КАК Валюта,
		|		
		|		0                                                                                   КАК Сумма,
		|		РасчетыСКлиентамиПоСрокам.ДолгОстаток - РасчетыСКлиентамиПоСрокам.ПредоплатаОстаток КАК СуммаПоСрокам
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыСКлиентамиПоСрокам
		|	ГДЕ
		|		РасчетыСКлиентамиПоСрокам.ДолгОстаток <> 0
		|		ИЛИ РасчетыСКлиентамиПоСрокам.ПредоплатаОстаток <> 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
		|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам                     КАК АналитикаУчетаПоПартнерам,
		|		РасчетыСПоставщиками.ОбъектРасчетов                                КАК ОбъектРасчетов,
		|		РасчетыСПоставщиками.Валюта                                        КАК Валюта,
		|		
		|		РасчетыСПоставщиками.СуммаОстаток                                  КАК Сумма,
		|		0                                                                  КАК СуммаПоСрокам
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыСПоставщиками
		|	ГДЕ
		|		РасчетыСПоставщиками.СуммаОстаток <> 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)                        КАК ТипРасчетов,
		|		РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам                                    КАК АналитикаУчетаПоПартнерам,
		|		РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов                                               КАК ОбъектРасчетов,
		|		РасчетыСПоставщикамиПоСрокам.Валюта                                                       КАК Валюта,
		|		
		|		0                                                                                         КАК Сумма,
		|		РасчетыСПоставщикамиПоСрокам.ПредоплатаОстаток - РасчетыСПоставщикамиПоСрокам.ДолгОстаток КАК СуммаПоСрокам
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыСПоставщикамиПоСрокам
		|	ГДЕ
		|		РасчетыСПоставщикамиПоСрокам.ДолгОстаток <> 0
		|		ИЛИ РасчетыСПоставщикамиПоСрокам.ПредоплатаОстаток <> 0) КАК ВложенныйЗапрос
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПериодВводаОстатков КАК ПериодВводаОстатков
		|		ПО ИСТИНА
		|ГДЕ
		|	&НачалоМесяца > ЕСТЬNULL(ПериодВводаОстатков.Период, ДАТАВРЕМЯ(1,1,1))
		|СГРУППИРОВАТЬ ПО 
		|	ВложенныйЗапрос.ТипРасчетов,
		|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
		|	ВложенныйЗапрос.ОбъектРасчетов,
		|	ВложенныйЗапрос.Валюта
		|ИМЕЮЩИЕ
		|	СУММА(ВложенныйЗапрос.СуммаПоСрокам) <> СУММА(ВложенныйЗапрос.Сумма)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)    КАК ТипРасчетов,
		|	РасчетыПоСрокам.АналитикаУчетаПоПартнерам                          КАК АналитикаУчетаПоПартнерам,
		|	РасчетыПоСрокам.ОбъектРасчетов                                     КАК ОбъектРасчетов,
		|	РасчетыПоСрокам.Валюта                                             КАК Валюта,
		|	ВЫБОР КОГДА НЕ РасчетыПоСрокам.РасчетныйДокумент ЕСТЬ NULL
		|		И НЕ РасчетыПоСрокам.ДатаПлановогоПогашения ЕСТЬ NULL
		|		И НЕ РасчетыПоСрокам.ДатаВозникновения ЕСТЬ NULL
		|		ТОГДА 0
		|		ИНАЧЕ 0 
		|	КОНЕЦ                                                              КАК Сумма,
		|	РасчетыПоСрокам.ДолгОстаток + РасчетыПоСрокам.ПредоплатаОстаток    КАК СуммаПоСрокам
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыПоСрокам
		|ГДЕ
		|	РасчетыПоСрокам.ДолгОстаток < 0
		|	ИЛИ РасчетыПоСрокам.ПредоплатаОстаток < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
		|	РасчетыПоСрокам.АналитикаУчетаПоПартнерам                          КАК АналитикаУчетаПоПартнерам,
		|	РасчетыПоСрокам.ОбъектРасчетов                                     КАК ОбъектРасчетов,
		|	РасчетыПоСрокам.Валюта                                             КАК Валюта,
		|	ВЫБОР КОГДА НЕ РасчетыПоСрокам.РасчетныйДокумент ЕСТЬ NULL
		|		И НЕ РасчетыПоСрокам.ДатаПлановогоПогашения ЕСТЬ NULL
		|		И НЕ РасчетыПоСрокам.ДатаВозникновения ЕСТЬ NULL
		|		ТОГДА 0
		|		ИНАЧЕ 0 
		|	КОНЕЦ                                                              КАК Сумма,
		|	РасчетыПоСрокам.ДолгОстаток + РасчетыПоСрокам.ПредоплатаОстаток    КАК СуммаПоСрокам
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыПоСрокам
		|ГДЕ
		|	РасчетыПоСрокам.ДолгОстаток < 0
		|	ИЛИ РасчетыПоСрокам.ПредоплатаОстаток < 0";
	Если Не БезРучныхКорректировок Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоМесяца", "&НачалоПериода");
	КонецЕсли;
	МассивТекстовЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "УНИЧТОЖИТЬ ПериодВводаОстатков";
	МассивТекстовЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВтРучныхКорректировок();
	Если Не БезРучныхКорректировок Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоМесяца", "&НачалоПериода");
	КонецЕсли;
	МассивТекстовЗапросов.Добавить(ТекстЗапроса);
	
	Если БезРучныхКорректировок Тогда
		ТекстЗапроса = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Аналитика.Организация             КАК Организация,
			|	Остатки.ТипРасчетов               КАК ТипРасчетов,
			|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	Остатки.ОбъектРасчетов            КАК ОбъектРасчетов,
			|	Остатки.Валюта                    КАК Валюта
			|ПОМЕСТИТЬ ИмяВТ
			|ИЗ ВтОстатки КАК Остатки
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитика КАК Аналитика
			|		ПО Аналитика.АналитикаУчетаПоПартнерам = Остатки.АналитикаУчетаПоПартнерам
			|ГДЕ
			|	НЕ (Остатки.АналитикаУчетаПоПартнерам, Остатки.ОбъектРасчетов) В
			|				(ВЫБРАТЬ
			|					ВтРучныеКорректировки.АналитикаУчетаПоПартнерам,
			|					ВтРучныеКорректировки.ОбъектРасчетов
			|				ИЗ
			|					ВтРучныеКорректировки)
			|	И НЕ Остатки.ОбъектРасчетов = ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)";
	Иначе
		ТекстЗапроса = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Аналитика.Организация             КАК Организация,
			|	Остатки.ТипРасчетов               КАК ТипРасчетов,
			|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	Остатки.ОбъектРасчетов            КАК ОбъектРасчетов,
			|	Остатки.Валюта                    КАК Валюта,
			|	ВтРучныеКорректировки.Регистратор КАК РучнаяКорректировка
			|ПОМЕСТИТЬ ИмяВТ
			|ИЗ
			|	ВтОстатки КАК Остатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитика КАК Аналитика
			|		ПО (Аналитика.АналитикаУчетаПоПартнерам = Остатки.АналитикаУчетаПоПартнерам)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРучныеКорректировки КАК ВтРучныеКорректировки
			|		ПО Остатки.АналитикаУчетаПоПартнерам = ВтРучныеКорректировки.АналитикаУчетаПоПартнерам
			|			И Остатки.ОбъектРасчетов = ВтРучныеКорректировки.ОбъектРасчетов
			|ГДЕ
			|	&ПериодВДиапазонеПересчета";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяВТ) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПОМЕСТИТЬ ИмяВТ","ПОМЕСТИТЬ "+ИмяВТ);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПОМЕСТИТЬ ИмяВТ","");
	КонецЕсли;
	
	МассивТекстовЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(МассивТекстовЗапросов, ";");
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует текст запроса для поиска записей с развернутым сальдо в расчетных регистрах. 
// 
// Параметры:
// 	ИмяВТ - Строка - Имя временной таблицы для помещения результата
// 	БезРучныхКорректировок - Булево - необходимость исключения из результата запроса Аналитик расчетов по партнерам 
// Возвращаемое значение:
// 	Строка - Текст запроса
Функция ТекстЗапросаРазвернутоеСальдо(ИмяВт = "", БезРучныхКорректировок = Истина) Экспорт
	
	МассивТекстовЗапросов = Новый Массив;
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Ключи.Ссылка      КАК АналитикаУчетаПоПартнерам,
		|	Ключи.Организация КАК Организация
		|ПОМЕСТИТЬ ВтАналитика
		|ИЗ
		|	Справочник.КлючиАналитикиУчетаПоПартнерам КАК Ключи
		|ГДЕ
		|	Ключи.Организация В (&МассивОрганизаций)
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаПоПартнерам";
	МассивТекстовЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
		|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам              КАК АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентамиОстатки.ОбъектРасчетов                         КАК ОбъектРасчетов,
		|	РасчетыСКлиентамиОстатки.Валюта                                 КАК Валюта,
		|	РасчетыСКлиентамиОстатки.ДолгОстаток                            КАК ДолгОстаток,
		|	РасчетыСКлиентамиОстатки.ПредоплатаОстаток                      КАК ПредоплатаОстаток
		|ПОМЕСТИТЬ ВтСальдо
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыСКлиентамиОстатки
		|ГДЕ
		|	РасчетыСКлиентамиОстатки.ДолгОстаток > 0 
		|	И РасчетыСКлиентамиОстатки.ПредоплатаОстаток > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
		|	РасчетыСПоставщикамиОстатки.АналитикаУчетаПоПартнерам              КАК АналитикаУчетаПоПартнерам,
		|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов                         КАК ОбъектРасчетов,
		|	РасчетыСПоставщикамиОстатки.Валюта                                 КАК Валюта,
		|	РасчетыСПоставщикамиОстатки.ДолгОстаток                            КАК ДолгОстаток,
		|	РасчетыСПоставщикамиОстатки.ПредоплатаОстаток                      КАК ПредоплатаОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыСПоставщикамиОстатки
		|ГДЕ
		|	РасчетыСПоставщикамиОстатки.ДолгОстаток > 0 
		|	И РасчетыСПоставщикамиОстатки.ПредоплатаОстаток > 0";
	Если Не БезРучныхКорректировок Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоМесяца", "&НачалоПериода");
	КонецЕсли;
	МассивТекстовЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВтРучныхКорректировок();
	Если Не БезРучныхКорректировок Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоМесяца", "&НачалоПериода");
	КонецЕсли;
	МассивТекстовЗапросов.Добавить(ТекстЗапроса);
	
	Если БезРучныхКорректировок Тогда
		ТекстЗапроса = "
			|ВЫБРАТЬ
			|	Аналитика.Организация             КАК Организация,
			|	Сальдо.ТипРасчетов                КАК ТипРасчетов,
			|	Сальдо.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
			|	Сальдо.ОбъектРасчетов             КАК ОбъектРасчетов,
			|	Сальдо.Валюта                     КАК Валюта,
			|	Сальдо.ДолгОстаток                КАК ДолгОстаток,
			|	Сальдо.ПредоплатаОстаток          КАК ПредоплатаОстаток
			|ПОМЕСТИТЬ ИмяВТ
			|ИЗ ВтСальдо КАК Сальдо
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитика КАК Аналитика
			|		ПО Аналитика.АналитикаУчетаПоПартнерам = Сальдо.АналитикаУчетаПоПартнерам
			|ГДЕ
			|	НЕ (Сальдо.АналитикаУчетаПоПартнерам, Сальдо.ОбъектРасчетов) В
			|				(ВЫБРАТЬ
			|					ВтРучныеКорректировки.АналитикаУчетаПоПартнерам,
			|					ВтРучныеКорректировки.ОбъектРасчетов
			|				ИЗ
			|					ВтРучныеКорректировки)
			|	И НЕ Сальдо.ОбъектРасчетов = ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)";
	Иначе
		ТекстЗапроса = "
			|ВЫБРАТЬ
			|	Аналитика.Организация             КАК Организация,
			|	Сальдо.ТипРасчетов                КАК ТипРасчетов,
			|	Сальдо.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
			|	Сальдо.ОбъектРасчетов             КАК ОбъектРасчетов,
			|	Сальдо.Валюта                     КАК Валюта,
			|	Сальдо.ДолгОстаток                КАК ДолгОстаток,
			|	Сальдо.ПредоплатаОстаток          КАК ПредоплатаОстаток,
			|	ВтРучныеКорректировки.Регистратор КАК РучнаяКорректировка
			|ПОМЕСТИТЬ ИмяВТ
			|ИЗ
			|	ВтСальдо КАК Сальдо
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитика КАК Аналитика
			|		ПО (Аналитика.АналитикаУчетаПоПартнерам = Сальдо.АналитикаУчетаПоПартнерам)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРучныеКорректировки КАК ВтРучныеКорректировки
			|		ПО Сальдо.АналитикаУчетаПоПартнерам = ВтРучныеКорректировки.АналитикаУчетаПоПартнерам
			|			И Сальдо.ОбъектРасчетов = ВтРучныеКорректировки.ОбъектРасчетов
			|ГДЕ
			|	&ПериодВДиапазонеПересчета";
	КонецЕсли;
	
	Если ИмяВт <> "" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПОМЕСТИТЬ ИмяВТ","ПОМЕСТИТЬ "+ИмяВт);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПОМЕСТИТЬ ИмяВТ","");
	КонецЕсли;
	
	МассивТекстовЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(МассивТекстовЗапросов, ";");
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Исправление остатков по взаиморасчетам
// 
// Параметры:
// 	Период - Дата - Период проверки, на начало месяца периода будут проверены остатки, 
//		если они некорректные, то будет создана корректировка на конец предыдущего месяца.
//		Если на начало периода остатки в порядке, а на начало следующего месяца - нет, то будет запущен частичный пересчет расчетов.
// 	МассивОрганизаций - Массив из СправочникСсылка.Организации - Массив организация, по которым требуется исправить остатки взаиморасчетов
Процедура ИсправитьОстаткиВзаиморасчетов(Период, ЗНАЧ МассивОрганизаций = Неопределено) Экспорт
	
	ДатаКорректировки    = НачалоМесяца(Период)-1; //Для корректировки и движений
	ПорядокКорректировки = Формат(ДатаКорректировки,"ДФ=ггггММдд9ЧЧммсс99"); //Для запроса данных остатков.
	ПериодРасчета        = НачалоМесяца(Период); //Для сравнения остатков
	
	МассивОрганизаций = ?(МассивОрганизаций = Неопределено,
							Справочники.Организации.ДоступныеОрганизации(),
							МассивОрганизаций);
	
	ТипыРасчетов = Новый Массив;
	ТипыРасчетов.Добавить(Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
	ТипыРасчетов.Добавить(Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = ТекстЗапросаНекорректныхОстаткиВзаиморасчетовПоСрокам();
	Запрос.УстановитьПараметр("НачалоМесяца",       ПериодРасчета);
	Запрос.УстановитьПараметр("МассивОрганизаций",  МассивОрганизаций);
	Запрос.УстановитьПараметр("Порядок",            ПорядокКорректировки);
	
	//Удалим корректировки
	НекорректныеОстатки = Запрос.Выполнить().Выгрузить();
	
	Если НекорректныеОстатки.Количество() > 0 Тогда
		МассивОрганизацийДляОбработки = НекорректныеОстатки.Скопировать(,"Организация");
		МассивОрганизацийДляОбработки.Свернуть("Организация");
		МассивОрганизацийДляОбработки = МассивОрганизацийДляОбработки.ВыгрузитьКолонку("Организация");
		Для Каждого Организация Из МассивОрганизацийДляОбработки Цикл
			УдалитьСистемныеКорректировкиРегистров(ДатаКорректировки,Организация)
		КонецЦикла;
		
		Запрос.Текст = "УНИЧТОЖИТЬ ВтАналитика; УНИЧТОЖИТЬ ВтОстатки; УНИЧТОЖИТЬ ВтРучныеКорректировки";
		Запрос.Выполнить();
		
		//Перечитываем остатки
		Запрос.Текст = ТекстЗапросаНекорректныхОстаткиВзаиморасчетовПоСрокам();
		
		НекорректныеОстатки = Запрос.Выполнить().Выгрузить();
		НекорректныеОстатки.Индексы.Добавить("ТипРасчетов, Организация");
		СтруктураПоиска = Новый Структура("ТипРасчетов, Организация");
		
		МассивОрганизацийДляОбработки = НекорректныеОстатки.Скопировать(,"Организация");
		МассивОрганизацийДляОбработки.Свернуть("Организация");
		МассивОрганизацийДляОбработки = МассивОрганизацийДляОбработки.ВыгрузитьКолонку("Организация");
		
		Для Каждого Организация Из МассивОрганизацийДляОбработки Цикл
			
			КорректировкаОбъект = КорректировкаРегистров(ДатаКорректировки, Организация, Перечисления.ОперацииКорректировкиРегистров.ИсправлениеРазрывовОстатковВзаиморасчетов);
			
			Для Каждого ТипРасчетов Из ТипыРасчетов Цикл
				
				Если ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
					Движения = КорректировкаОбъект.Движения["РасчетыСКлиентамиПоСрокам"]; // РегистрНакопленияНаборЗаписей
					ЭтоРасчетыСКлиентами = Истина;
				Иначе
					Движения = КорректировкаОбъект.Движения["РасчетыСПоставщикамиПоСрокам"]; // РегистрНакопленияНаборЗаписей
					ЭтоРасчетыСКлиентами = Ложь;
				КонецЕсли;
				
				СтруктураПоиска.ТипРасчетов = ТипРасчетов;
				СтруктураПоиска.Организация = Организация;
				ЗаписиНекорректныхОстатков = НекорректныеОстатки.НайтиСтроки(СтруктураПоиска);
				
				Для Каждого ЗаписьНекорректныхОстатков Из ЗаписиНекорректныхОстатков Цикл
					
					//Рассчитаем корректные остатки.
					
					РасчетныеДвижения = Новый Структура();
					ПараметрыРаспределения = ОперативныеВзаиморасчетыСервер.ПараметрыРаспределенияРасчетов();
					ПараметрыРаспределения.ЗаписыватьИзменения              = Ложь;
					ПараметрыРаспределения.Вставить("РасчетныеДвижения",РасчетныеДвижения);
					ПараметрыРаспределения.Вставить("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
					
					ТаблицаКРаспределению = ОперативныеВзаиморасчетыСервер.ТаблицаКРаспределению();
					ЗаписьТаблицы = ТаблицаКРаспределению.Добавить();
					ЗаполнитьЗначенияСвойств(ЗаписьТаблицы, ЗаписьНекорректныхОстатков);
					
					ОперативныеВзаиморасчетыСервер.ЗаполнитьОперативныеВзаиморасчеты(ПараметрыРаспределения, ТаблицаКРаспределению);
					
					//Сравним с остатками до и рассчитаем записи корректировки.
					
					Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", ЗаписьНекорректныхОстатков.АналитикаУчетаПоПартнерам);
					Запрос.УстановитьПараметр("ОбъектРасчетов",            ЗаписьНекорректныхОстатков.ОбъектРасчетов);
					Запрос.УстановитьПараметр("Валюта",                    ЗаписьНекорректныхОстатков.Валюта);
					Если ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
						Запрос.УстановитьПараметр("РасчетыПоСрокам",           РасчетныеДвижения["РасчетыСКлиентамиПоСрокам"]);
					Иначе
						Запрос.УстановитьПараметр("РасчетыПоСрокам",           РасчетныеДвижения["РасчетыСПоставщикамиПоСрокам"]);
					КонецЕсли;
					
					Запрос.Текст = "
						//Записи после
						|ВЫБРАТЬ
						|	РасчетыПоСрокамПосле.Период                        КАК Период,
						|	РасчетыПоСрокамПосле.ВидДвижения                   КАК ВидДвижения,
						|	
						|	РасчетыПоСрокамПосле.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
						|	РасчетыПоСрокамПосле.ОбъектРасчетов                КАК ОбъектРасчетов,
						|	РасчетыПоСрокамПосле.Валюта                        КАК Валюта,
						|	РасчетыПоСрокамПосле.РасчетныйДокумент             КАК РасчетныйДокумент,
						|	РасчетыПоСрокамПосле.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
						|	РасчетыПоСрокамПосле.ДатаВозникновения             КАК ДатаВозникновения,
						|	
						|	ВЫРАЗИТЬ(РасчетыПоСрокамПосле.Предоплата КАК ЧИСЛО(31,2))     КАК Предоплата,
						|	ВЫРАЗИТЬ(РасчетыПоСрокамПосле.ПредоплатаРегл КАК ЧИСЛО(31,2)) КАК ПредоплатаРегл,
						|	ВЫРАЗИТЬ(РасчетыПоСрокамПосле.ПредоплатаУпр КАК ЧИСЛО(31,2))  КАК ПредоплатаУпр,
						|	ВЫРАЗИТЬ(РасчетыПоСрокамПосле.Долг КАК ЧИСЛО(31,2))           КАК Долг,
						|	ВЫРАЗИТЬ(РасчетыПоСрокамПосле.ДолгРегл КАК ЧИСЛО(31,2))       КАК ДолгРегл,
						|	ВЫРАЗИТЬ(РасчетыПоСрокамПосле.ДолгУпр КАК ЧИСЛО(31,2))        КАК ДолгУпр,
						|	
						|	РасчетыПоСрокамПосле.ПорядокЗачета                 КАК ПорядокЗачета,
						|	РасчетыПоСрокамПосле.ПорядокОперации               КАК ПорядокОперации,
						|	РасчетыПоСрокамПосле.СвязанныйДокумент             КАК СвязанныйДокумент,
						|	РасчетыПоСрокамПосле.ВалютаДокумента               КАК ВалютаДокумента,
						|	РасчетыПоСрокамПосле.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
						|ПОМЕСТИТЬ РасчетыПоСрокамПосле
						|ИЗ &РасчетыПоСрокам КАК РасчетыПоСрокамПосле
						|ИНДЕКСИРОВАТЬ ПО
						|	АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, РасчетныйДокумент
						|;
						//Расхождения
						|ВЫБРАТЬ
						|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
						|	ВложенныйЗапрос.ОбъектРасчетов            КАК ОбъектРасчетов,
						|	ВложенныйЗапрос.Валюта                    КАК Валюта,
						|	ВложенныйЗапрос.РасчетныйДокумент         КАК РасчетныйДокумент,
						|	ВложенныйЗапрос.ДатаПлановогоПогашения    КАК ДатаПлановогоПогашения,
						|	ВложенныйЗапрос.ДатаВозникновения         КАК ДатаВозникновения,
						|	СУММА(ВложенныйЗапрос.Предоплата)         КАК Предоплата,
						|	СУММА(ВложенныйЗапрос.ПредоплатаРегл)     КАК ПредоплатаРегл,
						|	СУММА(ВложенныйЗапрос.ПредоплатаУпр)      КАК ПредоплатаУпр,
						|	СУММА(ВложенныйЗапрос.Долг)               КАК Долг,
						|	СУММА(ВложенныйЗапрос.ДолгРегл)           КАК ДолгРегл,
						|	СУММА(ВложенныйЗапрос.ДолгУпр)            КАК ДолгУпр
						|ПОМЕСТИТЬ ТаблицаИзменений
						|ИЗ
						|	(ВЫБРАТЬ
						|		РасчетыПоСрокамДо.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
						|		РасчетыПоСрокамДо.ОбъектРасчетов            КАК ОбъектРасчетов,
						|		РасчетыПоСрокамДо.Валюта                    КАК Валюта,
						|		РасчетыПоСрокамДо.РасчетныйДокумент         КАК РасчетныйДокумент,
						|		РасчетыПоСрокамДо.ДатаПлановогоПогашения    КАК ДатаПлановогоПогашения,
						|		РасчетыПоСрокамДо.ДатаВозникновения         КАК ДатаВозникновения,
						|		-РасчетыПоСрокамДо.ПредоплатаОстаток        КАК Предоплата,
						|		-РасчетыПоСрокамДо.ПредоплатаРеглОстаток    КАК ПредоплатаРегл,
						|		-РасчетыПоСрокамДо.ПредоплатаУпрОстаток     КАК ПредоплатаУпр,
						|		-РасчетыПоСрокамДо.ДолгОстаток              КАК Долг,
						|		-РасчетыПоСрокамДо.ДолгРеглОстаток          КАК ДолгРегл,
						|		-РасчетыПоСрокамДо.ДолгУпрОстаток           КАК ДолгУпр
						|	ИЗ
						|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&НачалоМесяца, 
						|			АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
						|			И ОбъектРасчетов = &ОбъектРасчетов
						|			И Валюта = &Валюта) КАК РасчетыПоСрокамДо
						|		
						|	ОБЪЕДИНИТЬ ВСЕ
						|	
						|	ВЫБРАТЬ
						|		РасчетыПоСрокамПосле.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
						|		РасчетыПоСрокамПосле.ОбъектРасчетов            КАК ОбъектРасчетов,
						|		РасчетыПоСрокамПосле.Валюта                    КАК Валюта,
						|		РасчетыПоСрокамПосле.РасчетныйДокумент         КАК РасчетныйДокумент,
						|		РасчетыПоСрокамПосле.ДатаПлановогоПогашения    КАК ДатаПлановогоПогашения,
						|		РасчетыПоСрокамПосле.ДатаВозникновения         КАК ДатаВозникновения,
						|		ВЫБОР КОГДА РасчетыПоСрокамПосле.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|				ТОГДА -РасчетыПоСрокамПосле.Предоплата
						|			ИНАЧЕ РасчетыПоСрокамПосле.Предоплата
						|		КОНЕЦ                                          КАК Предоплата,
						|		ВЫБОР КОГДА РасчетыПоСрокамПосле.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|				ТОГДА -РасчетыПоСрокамПосле.ПредоплатаРегл
						|			ИНАЧЕ РасчетыПоСрокамПосле.ПредоплатаРегл
						|		КОНЕЦ                                          КАК ПредоплатаРегл,
						|		ВЫБОР КОГДА РасчетыПоСрокамПосле.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|				ТОГДА -РасчетыПоСрокамПосле.ПредоплатаУпр
						|			ИНАЧЕ РасчетыПоСрокамПосле.ПредоплатаУпр
						|		КОНЕЦ                                          КАК ПредоплатаУпр,
						|		ВЫБОР КОГДА РасчетыПоСрокамПосле.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|				ТОГДА -РасчетыПоСрокамПосле.Долг
						|			ИНАЧЕ РасчетыПоСрокамПосле.Долг
						|		КОНЕЦ                                          КАК Долг,
						|		ВЫБОР КОГДА РасчетыПоСрокамПосле.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|				ТОГДА -РасчетыПоСрокамПосле.ДолгРегл
						|			ИНАЧЕ РасчетыПоСрокамПосле.ДолгРегл
						|		КОНЕЦ                                          КАК ДолгРегл,
						|		ВЫБОР КОГДА РасчетыПоСрокамПосле.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|				ТОГДА -РасчетыПоСрокамПосле.ДолгУпр
						|			ИНАЧЕ РасчетыПоСрокамПосле.ДолгУпр
						|		КОНЕЦ                                          КАК ДолгУпр
						|	ИЗ
						|		РасчетыПоСрокамПосле КАК РасчетыПоСрокамПосле
						|	ГДЕ
						|		РасчетыПоСрокамПосле.Период < &НачалоМесяца) КАК ВложенныйЗапрос
						|СГРУППИРОВАТЬ ПО
						|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
						|	ВложенныйЗапрос.ОбъектРасчетов,
						|	ВложенныйЗапрос.Валюта,
						|	ВложенныйЗапрос.РасчетныйДокумент,
						|	ВложенныйЗапрос.ДатаПлановогоПогашения,
						|	ВложенныйЗапрос.ДатаВозникновения
						|ИМЕЮЩИЕ
						|	СУММА(ВложенныйЗапрос.Предоплата) <> 0 ИЛИ СУММА(ВложенныйЗапрос.Долг) <> 0
						|ИНДЕКСИРОВАТЬ ПО
						|	АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, РасчетныйДокумент
						|;
						|
						//Данные для движений
						|ВЫБРАТЬ
						|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                       КАК ВидДвижения,
						|	
						|	Изменения.АналитикаУчетаПоПартнерам                          КАК АналитикаУчетаПоПартнерам,
						|	Изменения.ОбъектРасчетов                                     КАК ОбъектРасчетов,
						|	Изменения.Валюта                                             КАК Валюта,
						|	Изменения.РасчетныйДокумент                                  КАК РасчетныйДокумент,
						|	Изменения.ДатаПлановогоПогашения                             КАК ДатаПлановогоПогашения,
						|	Изменения.ДатаВозникновения                                  КАК ДатаВозникновения,
						|	
						|	Изменения.Предоплата                                         КАК Предоплата,
						|	Изменения.ПредоплатаРегл                                     КАК ПредоплатаРегл,
						|	Изменения.ПредоплатаУпр                                      КАК ПредоплатаУпр,
						|	Изменения.Долг                                               КАК Долг,
						|	Изменения.ДолгРегл                                           КАК ДолгРегл,
						|	Изменения.ДолгУпр                                            КАК ДолгУпр,
						|	
						|	МИНИМУМ(РасчетыПоСрокамПосле.ПорядокЗачета)                  КАК ПорядокЗачета,
						|	МИНИМУМ(РасчетыПоСрокамПосле.ПорядокОперации)                КАК ПорядокОперации,
						|	МАКСИМУМ(РасчетыПоСрокамПосле.СвязанныйДокумент)             КАК СвязанныйДокумент,
						|	МИНИМУМ(РасчетыПоСрокамПосле.ВалютаДокумента)                КАК ВалютаДокумента,
						|	МАКСИМУМ(РасчетыПоСрокамПосле.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
						|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)    КАК ХозяйственнаяОперация
						|
						|ИЗ
						|	ТаблицаИзменений КАК Изменения
						|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПоСрокамПосле КАК РасчетыПоСрокамПосле
						|			ПО РасчетыПоСрокамПосле.АналитикаУчетаПоПартнерам    = Изменения.АналитикаУчетаПоПартнерам
						|				И РасчетыПоСрокамПосле.ОбъектРасчетов            = Изменения.ОбъектРасчетов
						|				И РасчетыПоСрокамПосле.Валюта                    = Изменения.Валюта
						|				И РасчетыПоСрокамПосле.РасчетныйДокумент         = Изменения.РасчетныйДокумент
						|ГДЕ
						|	Изменения.Предоплата > 0 ИЛИ Изменения.Долг > 0
						|СГРУППИРОВАТЬ ПО
						|	Изменения.АналитикаУчетаПоПартнерам,
						|	Изменения.ОбъектРасчетов,
						|	Изменения.Валюта,
						|	Изменения.РасчетныйДокумент,
						|	Изменения.ДатаПлановогоПогашения,
						|	Изменения.ДатаВозникновения,
						|	Изменения.Предоплата,
						|	Изменения.ПредоплатаРегл,
						|	Изменения.ПредоплатаУпр,
						|	Изменения.Долг,
						|	Изменения.ДолгРегл,
						|	Изменения.ДолгУпр
						|	
						|ОБЪЕДИНИТЬ ВСЕ
						|	
						|ВЫБРАТЬ
						|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
						|	
						|	Изменения.АналитикаУчетаПоПартнерам                       КАК АналитикаУчетаПоПартнерам,
						|	Изменения.ОбъектРасчетов                                  КАК ОбъектРасчетов,
						|	Изменения.Валюта                                          КАК Валюта,
						|	Изменения.РасчетныйДокумент                               КАК РасчетныйДокумент,
						|	Изменения.ДатаПлановогоПогашения                          КАК ДатаПлановогоПогашения,
						|	Изменения.ДатаВозникновения                               КАК ДатаВозникновения,
						|	
						|	-Изменения.Предоплата                                     КАК Предоплата,
						|	-Изменения.ПредоплатаРегл                                 КАК ПредоплатаРегл,
						|	-Изменения.ПредоплатаУпр                                  КАК ПредоплатаУпр,
						|	-Изменения.Долг                                           КАК Долг,
						|	-Изменения.ДолгРегл                                       КАК ДолгРегл,
						|	-Изменения.ДолгУпр                                        КАК ДолгУпр,
						|	
						|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокЗачета)                  КАК ПорядокЗачета,
						|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокОперации)                КАК ПорядокОперации,
						|	МАКСИМУМ(РасчетыПоСрокамДо.СвязанныйДокумент)             КАК СвязанныйДокумент,
						|	МИНИМУМ(РасчетыПоСрокамДо.ВалютаДокумента)                КАК ВалютаДокумента,
						|	МАКСИМУМ(РасчетыПоСрокамДо.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
						|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация
						|
						|ИЗ
						|	ТаблицаИзменений КАК Изменения
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокамДо
						|			ПО РасчетыПоСрокамДо.АналитикаУчетаПоПартнерам    = Изменения.АналитикаУчетаПоПартнерам
						|				И РасчетыПоСрокамДо.ОбъектРасчетов            = Изменения.ОбъектРасчетов
						|				И РасчетыПоСрокамДо.Валюта                    = Изменения.Валюта
						|				И РасчетыПоСрокамДо.РасчетныйДокумент         = Изменения.РасчетныйДокумент
						|				И РасчетыПоСрокамДо.Период                    < &НачалоМесяца
						|				И РасчетыПоСрокамДо.Активность
						|ГДЕ
						|	Изменения.Предоплата < 0 ИЛИ Изменения.Долг < 0
						|СГРУППИРОВАТЬ ПО
						|	Изменения.АналитикаУчетаПоПартнерам,
						|	Изменения.ОбъектРасчетов,
						|	Изменения.Валюта,
						|	Изменения.РасчетныйДокумент,
						|	Изменения.ДатаПлановогоПогашения,
						|	Изменения.ДатаВозникновения,
						|	-Изменения.Предоплата,
						|	-Изменения.ПредоплатаРегл,
						|	-Изменения.ПредоплатаУпр,
						|	-Изменения.Долг,
						|	-Изменения.ДолгРегл,
						|	-Изменения.ДолгУпр";
						
						Если ТипРасчетов <> Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
							Запрос.Текст = СтрЗаменить(Запрос.Текст,
								"РегистрНакопления.РасчетыСКлиентамиПоСрокам",
								"РегистрНакопления.РасчетыСПоставщикамиПоСрокам");
						КонецЕсли;
						
						Результат = Запрос.Выполнить();
						Выборка = Результат.Выбрать();
						
						Запрос.Текст = "УНИЧТОЖИТЬ РасчетыПоСрокамПосле; УНИЧТОЖИТЬ ТаблицаИзменений";
						Запрос.Выполнить();
						
						Пока Выборка.Следующий() Цикл
							
							НовСтр = Движения.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
							
							НовСтр.ДокументРегистратор = КорректировкаОбъект.Ссылка;
							НовСтр.Период = ДатаКорректировки;
							Если Выборка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
								Если Выборка.Долг <> 0 Тогда
									НовСтр.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеДолга;
								Иначе
									НовСтр.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеПредоплаты;
								КонецЕсли;
							Иначе
								Если Выборка.Долг <> 0 Тогда
									НовСтр.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеДолга;
								Иначе
									НовСтр.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеПредоплаты;
								КонецЕсли;
							КонецЕсли;
							
						КонецЦикла;
						
				КонецЦикла;
				
				Движения.Записать();
				
				ТаблицаКРаспределению = ОперативныеВзаиморасчетыСервер.ТаблицаКРаспределению();
				ПараметрыРаспределения = ОперативныеВзаиморасчетыСервер.ПараметрыРаспределенияРасчетов();
				ПараметрыРаспределения.Вставить("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
				Для Каждого ЗаписьНекорректныхОстатков Из ЗаписиНекорректныхОстатков Цикл
					НовСтр = ТаблицаКРаспределению.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, ЗаписьНекорректныхОстатков);
					НовСтр.ДатаНачалаПересчета = ПериодРасчета;
				КонецЦикла;
				ОперативныеВзаиморасчетыСервер.ЗаполнитьОперативныеВзаиморасчеты(ПараметрыРаспределения, ТаблицаКРаспределению);
				
			КонецЦикла;
			
			Если КорректировкаОбъект.Движения.РасчетыСКлиентамиПоСрокам.Количество() = 0 
				И КорректировкаОбъект.Движения.РасчетыСПоставщикамиПоСрокам.Количество() = 0 Тогда
				КорректировкаОбъект.Удалить();
			Иначе
				ДополнитьКорректировкуДвижениямиПоПрочимДоходамРасходам(КорректировкаОбъект);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.Текст = "УНИЧТОЖИТЬ ВтАналитика; УНИЧТОЖИТЬ ВтОстатки; УНИЧТОЖИТЬ ВтРучныеКорректировки";
	Запрос.Выполнить();
	
	// Если на начало периода все хорошо, а на конец есть некорректные остатки - пересчитаем их.
	Запрос.Текст = ТекстЗапросаНекорректныхОстаткиВзаиморасчетовПоСрокам();
	Запрос.УстановитьПараметр("НачалоМесяца",       КонецМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("Порядок",            Формат(КонецМесяца(ПериодРасчета),"ДФ=ггггММдд9ЧЧммсс99"));
	НекорректныеОстатки = Запрос.Выполнить().Выгрузить();
	
	ТаблицаКРаспределению = ОперативныеВзаиморасчетыСервер.ТаблицаКРаспределению();
	Для Каждого Стр Из НекорректныеОстатки Цикл
		НовСтр = ТаблицаКРаспределению.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		НовСтр.ДатаНачалаПересчета = ПериодРасчета;
		НовСтр.ПериодКонтроляИзмененийИСозданияЗаданий = ПериодРасчета;
	КонецЦикла;
	ОсновныеПараметры = ОперативныеВзаиморасчетыСервер.ПараметрыРаспределенияРасчетов();
	ОперативныеВзаиморасчетыСервер.ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры, ТаблицаКРаспределению);
	
КонецПроцедуры

// Исправление развернутого сальдо по взаиморасчетам
// 
// Параметры:
// 	Период - Дата - Период проверки, требуется указать конец месяца
// 	МассивОрганизаций - Массив из СправочникСсылка.Организации - Массив организация, по которым требуется исправить развернутое сальдо взаиморасчетов
Процедура ИсправитьРазвернутоеСальдо(Период, ЗНАЧ МассивОрганизаций = Неопределено) Экспорт
	
	ДатаКорректировки    = НачалоМесяца(Период)-1; //Для корректировки и движений
	ПорядокКорректировки = Формат(ДатаКорректировки,"ДФ=ггггММдд9ЧЧммсс99"); //Для запроса данных остатков.
	ПериодРасчета        = НачалоМесяца(Период); //Для сравнения остатков
	
	МассивОрганизаций = ?(МассивОрганизаций = Неопределено,
							Справочники.Организации.ДоступныеОрганизации(),
							МассивОрганизаций);
	
	ТипыРасчетов = Новый Массив;
	ТипыРасчетов.Добавить(Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
	ТипыРасчетов.Добавить(Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = ТекстЗапросаРазвернутоеСальдо("АналитикиСуммы");
	Запрос.УстановитьПараметр("НачалоМесяца",       ПериодРасчета);
	Запрос.УстановитьПараметр("МассивОрганизаций",  МассивОрганизаций);
	Запрос.УстановитьПараметр("Порядок",            ПорядокКорректировки);
	Запрос.Выполнить();
	
	РазвернутоеСальдо = Запрос.МенеджерВременныхТаблиц.Таблицы["АналитикиСуммы"].ПолучитьДанные().Выгрузить();
	
	МассивОрганизацийДляОбработки = РазвернутоеСальдо.Скопировать(,"Организация");
	МассивОрганизацийДляОбработки.Свернуть("Организация");
	МассивОрганизацийДляОбработки = МассивОрганизацийДляОбработки.ВыгрузитьКолонку("Организация");
	
	Если РазвернутоеСальдо.Количество() > 0 Тогда
		Для Каждого Организация Из МассивОрганизацийДляОбработки Цикл
			УдалитьСистемныеКорректировкиРегистров(ДатаКорректировки, Организация, Перечисления.ОперацииКорректировкиРегистров.ИсправлениеРазвернутогоСальдоВзаиморасчетов)
		КонецЦикла;
		
		Запрос.Текст = "УНИЧТОЖИТЬ ВтАналитика; УНИЧТОЖИТЬ ВтСальдо; УНИЧТОЖИТЬ АналитикиСуммы; УНИЧТОЖИТЬ ВтРучныеКорректировки";
		Запрос.Выполнить();
		
		//Перечитываем остатки
		
		Запрос.Текст = ТекстЗапросаРазвернутоеСальдо("АналитикиСуммы");
		Запрос.Выполнить();
		РазвернутоеСальдо = Запрос.МенеджерВременныхТаблиц.Таблицы["АналитикиСуммы"].ПолучитьДанные().Выгрузить(); //ТаблицаЗначений
		
		РазвернутоеСальдо.Индексы.Добавить("ТипРасчетов, Организация");
		СтруктураПоиска = Новый Структура("ТипРасчетов, Организация");
		
		Запрос.Текст = "ВЫБРАТЬ
			|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСКлиентамиПоСрокамОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
			|	РасчетыСКлиентамиПоСрокамОстатки.Валюта КАК Валюта,
			|	РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
			|	РасчетыСКлиентамиПоСрокамОстатки.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
			|	РасчетыСКлиентамиПоСрокамОстатки.ДатаВозникновения КАК ДатаВозникновения,
			|	РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаОстаток КАК Предоплата,
			|	РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаРеглОстаток КАК ПредоплатаРегл,
			|	РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаУпрОстаток КАК ПредоплатаУпр,
			|	РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток КАК Долг,
			|	РасчетыСКлиентамиПоСрокамОстатки.ДолгРеглОстаток КАК ДолгРегл,
			|	РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток КАК ДолгУпр
			|ПОМЕСТИТЬ ВТРасчетыСКлиентамиПоСрокамОстатки
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&НачалоМесяца, 
			|		(АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта)
			|			В (ВЫБРАТЬ АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта 
			|				ИЗ АналитикиСуммы
			|				ГДЕ ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
			|				)) КАК РасчетыСКлиентамиПоСрокамОстатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, РасчетныйДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыСПоставщикамиПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
			|	РасчетыСПоставщикамиПоСрокамОстатки.Валюта КАК Валюта,
			|	РасчетыСПоставщикамиПоСрокамОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ДатаВозникновения КАК ДатаВозникновения,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ПредоплатаОстаток КАК ПредоплатаОстаток,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ПредоплатаРеглОстаток КАК ПредоплатаРеглОстаток,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ПредоплатаУпрОстаток КАК ПредоплатаУпрОстаток,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ДолгОстаток КАК ДолгОстаток,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ДолгРеглОстаток КАК ДолгРеглОстаток,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ДолгУпрОстаток КАК ДолгУпрОстаток
			|ПОМЕСТИТЬ ВТРасчетыСПоставщикамиПоСрокамОстатки
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(&НачалоМесяца, 
			|		(АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта)
			|			В (ВЫБРАТЬ АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта
			|					ИЗ АналитикиСуммы
			|					ГДЕ ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
			|					)) КАК РасчетыСПоставщикамиПоСрокамОстатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, РасчетныйДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
			|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	РасчетыПоСрокамОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
			|	РасчетыПоСрокамОстатки.Валюта КАК Валюта,
			|	РасчетыПоСрокамОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
			|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
			|	РасчетыПоСрокамОстатки.ДатаВозникновения КАК ДатаВозникновения,
			|	РасчетыПоСрокамОстатки.Предоплата КАК Предоплата,
			|	РасчетыПоСрокамОстатки.ПредоплатаРегл КАК ПредоплатаРегл,
			|	РасчетыПоСрокамОстатки.ПредоплатаУпр КАК ПредоплатаУпр,
			|	РасчетыПоСрокамОстатки.Долг КАК Долг,
			|	РасчетыПоСрокамОстатки.ДолгРегл КАК ДолгРегл,
			|	РасчетыПоСрокамОстатки.ДолгУпр КАК ДолгУпр,
			|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокЗачета) КАК ПорядокЗачета,
			|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокОперации) КАК ПорядокОперации,
			|	МАКСИМУМ(РасчетыПоСрокамДо.СвязанныйДокумент) КАК СвязанныйДокумент,
			|	МИНИМУМ(РасчетыПоСрокамДо.ВалютаДокумента) КАК ВалютаДокумента,
			|	МАКСИМУМ(РасчетыПоСрокамДо.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
			|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация
			|ИЗ
			|	ВТРасчетыСКлиентамиПоСрокамОстатки КАК РасчетыПоСрокамОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокамДо
			|		ПО (РасчетыПоСрокамДо.АналитикаУчетаПоПартнерам = РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам)
			|			И (РасчетыПоСрокамДо.ОбъектРасчетов = РасчетыПоСрокамОстатки.ОбъектРасчетов)
			|			И (РасчетыПоСрокамДо.Валюта = РасчетыПоСрокамОстатки.Валюта)
			|			И (РасчетыПоСрокамДо.РасчетныйДокумент = РасчетыПоСрокамОстатки.РасчетныйДокумент)
			|			И (РасчетыПоСрокамДо.Период < &НачалоМесяца)
			|			И (РасчетыПоСрокамДо.Активность)
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам,
			|	РасчетыПоСрокамОстатки.ОбъектРасчетов,
			|	РасчетыПоСрокамОстатки.Валюта,
			|	РасчетыПоСрокамОстатки.РасчетныйДокумент,
			|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения,
			|	РасчетыПоСрокамОстатки.ДатаВозникновения,
			|	РасчетыПоСрокамОстатки.Предоплата,
			|	РасчетыПоСрокамОстатки.ПредоплатаРегл,
			|	РасчетыПоСрокамОстатки.ПредоплатаУпр,
			|	РасчетыПоСрокамОстатки.Долг,
			|	РасчетыПоСрокамОстатки.ДолгРегл,
			|	РасчетыПоСрокамОстатки.ДолгУпр
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком),
			|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам,
			|	РасчетыПоСрокамОстатки.ОбъектРасчетов,
			|	РасчетыПоСрокамОстатки.Валюта,
			|	РасчетыПоСрокамОстатки.РасчетныйДокумент,
			|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения,
			|	РасчетыПоСрокамОстатки.ДатаВозникновения,
			|	РасчетыПоСрокамОстатки.ПредоплатаОстаток,
			|	РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток,
			|	РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток,
			|	РасчетыПоСрокамОстатки.ДолгОстаток,
			|	РасчетыПоСрокамОстатки.ДолгРеглОстаток,
			|	РасчетыПоСрокамОстатки.ДолгУпрОстаток,
			|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокЗачета),
			|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокОперации),
			|	МАКСИМУМ(РасчетыПоСрокамДо.СвязанныйДокумент),
			|	МИНИМУМ(РасчетыПоСрокамДо.ВалютаДокумента),
			|	МАКСИМУМ(РасчетыПоСрокамДо.СтатьяДвиженияДенежныхСредств),
			|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
			|ИЗ
			|	ВТРасчетыСПоставщикамиПоСрокамОстатки КАК РасчетыПоСрокамОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокамДо
			|		ПО (РасчетыПоСрокамДо.АналитикаУчетаПоПартнерам = РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам)
			|			И (РасчетыПоСрокамДо.ОбъектРасчетов = РасчетыПоСрокамОстатки.ОбъектРасчетов)
			|			И (РасчетыПоСрокамДо.Валюта = РасчетыПоСрокамОстатки.Валюта)
			|			И (РасчетыПоСрокамДо.РасчетныйДокумент = РасчетыПоСрокамОстатки.РасчетныйДокумент)
			|			И (РасчетыПоСрокамДо.Период < &НачалоМесяца)
			|			И (РасчетыПоСрокамДо.Активность)
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам,
			|	РасчетыПоСрокамОстатки.ОбъектРасчетов,
			|	РасчетыПоСрокамОстатки.Валюта,
			|	РасчетыПоСрокамОстатки.РасчетныйДокумент,
			|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения,
			|	РасчетыПоСрокамОстатки.ДатаВозникновения,
			|	РасчетыПоСрокамОстатки.ПредоплатаОстаток,
			|	РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток,
			|	РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток,
			|	РасчетыПоСрокамОстатки.ДолгОстаток,
			|	РасчетыПоСрокамОстатки.ДолгРеглОстаток,
			|	РасчетыПоСрокамОстатки.ДолгУпрОстаток
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокОперации)";
		
		ДетальныеЗаписи = Запрос.Выполнить().Выгрузить();
		ДетальныеЗаписи.Индексы.Добавить("ТипРасчетов, АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта");
		СтруктураПоискаДетальныхЗаписей = Новый Структура("ТипРасчетов, АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта");
		
		МассивОрганизацийДляОбработки = РазвернутоеСальдо.Скопировать(,"Организация");
		МассивОрганизацийДляОбработки.Свернуть("Организация");
		МассивОрганизацийДляОбработки = МассивОрганизацийДляОбработки.ВыгрузитьКолонку("Организация");
		
		Для Каждого Организация Из МассивОрганизацийДляОбработки Цикл
			
			КорректировкаОбъект = КорректировкаРегистров(ДатаКорректировки, Организация, Перечисления.ОперацииКорректировкиРегистров.ИсправлениеРазвернутогоСальдоВзаиморасчетов);
			
			Для Каждого ТипРасчетов Из ТипыРасчетов Цикл
				
				ТипРасчетовСтрокой = ?(ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом,"РасчетыСКлиентами","РасчетыСПоставщиками");
				
				Движения = КорректировкаОбъект.Движения[ТипРасчетовСтрокой + "ПоСрокам"]; // РегистрНакопленияНаборЗаписей
				
				СтруктураПоиска.ТипРасчетов = ТипРасчетов;
				СтруктураПоиска.Организация = Организация;
				ЗаписиРазвернутогоСальдо = РазвернутоеСальдо.НайтиСтроки(СтруктураПоиска);
				
				Для Каждого ЗаписьРазвернутогоСальдо Из ЗаписиРазвернутогоСальдо Цикл
					ЗаполнитьЗначенияСвойств(СтруктураПоискаДетальныхЗаписей, ЗаписьРазвернутогоСальдо);
					СтруктураПоискаДетальныхЗаписей.Валюта = ЗаписьРазвернутогоСальдо.Валюта;
					ДетальныеЗаписиАналитики = ДетальныеЗаписи.НайтиСтроки(СтруктураПоискаДетальныхЗаписей);
					
					СуммаКРаспределениюДолг = Мин(ЗаписьРазвернутогоСальдо.ДолгОстаток, ЗаписьРазвернутогоСальдо.ПредоплатаОстаток);
					СуммаКРаспределениюПредоплата = СуммаКРаспределениюДолг;
					
					Для Каждого СтрокаДетальныхЗаписей Из ДетальныеЗаписиАналитики Цикл
						
						Если СуммаКРаспределениюДолг = 0 И СуммаКРаспределениюПредоплата = 0 Тогда
							Прервать;
						КонецЕсли;
						
						НовСтр = Движения.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
						
						НовСтр.Период              = ДатаКорректировки;
						НовСтр.ВидДвижения         = ВидДвиженияНакопления.Расход;
						НовСтр.ДокументРегистратор = КорректировкаОбъект.Ссылка;
						НовСтр.ПорядокОперации     = ПорядокКорректировки;
						
						Если СтрокаДетальныхЗаписей.Долг > 0 Тогда
							СуммаСписания = Мин(СуммаКРаспределениюДолг, СтрокаДетальныхЗаписей.Долг);
							
							НовСтр.ДолгРегл = СтрокаДетальныхЗаписей.ДолгРегл / СтрокаДетальныхЗаписей.Долг * СуммаСписания;
							НовСтр.ДолгУпр  = СтрокаДетальныхЗаписей.ДолгУпр / СтрокаДетальныхЗаписей.Долг * СуммаСписания;
							НовСтр.Долг     = СуммаСписания;
							НовСтр.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеДолга;
							
							СуммаКРаспределениюДолг = СуммаКРаспределениюДолг - СуммаСписания;
						КонецЕсли;
						
						Если СтрокаДетальныхЗаписей.Предоплата > 0 Тогда
							СуммаСписания = Мин(СуммаКРаспределениюПредоплата, СтрокаДетальныхЗаписей.Предоплата);
							
							НовСтр.ПредоплатаРегл = СтрокаДетальныхЗаписей.ПредоплатаРегл / СтрокаДетальныхЗаписей.Предоплата * СуммаСписания;
							НовСтр.ПредоплатаУпр  = СтрокаДетальныхЗаписей.ПредоплатаУпр / СтрокаДетальныхЗаписей.Предоплата * СуммаСписания;
							НовСтр.Предоплата     = СуммаСписания;
							НовСтр.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеПредоплаты;
							
							СуммаКРаспределениюПредоплата = СуммаКРаспределениюПредоплата - СуммаСписания;
						КонецЕсли;
						
					КонецЦикла;
				КонецЦикла;
				
				Движения.Записать();
				ТаблицаКРаспределению = ОперативныеВзаиморасчетыСервер.ТаблицаКРаспределению();
				Для Каждого СтрокаАналитики Из ЗаписиРазвернутогоСальдо Цикл
					НовСтр = ТаблицаКРаспределению.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаАналитики);
					НовСтр.ДатаНачалаПересчета = ПериодРасчета;
				КонецЦикла;
				ОсновныеПараметры = ОперативныеВзаиморасчетыСервер.ПараметрыРаспределенияРасчетов();
				ОперативныеВзаиморасчетыСервер.ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры, ТаблицаКРаспределению);
			КонецЦикла;
			
			Если КорректировкаОбъект.Движения.РасчетыСКлиентамиПоСрокам.Количество() = 0 
				И КорректировкаОбъект.Движения.РасчетыСПоставщикамиПоСрокам.Количество() = 0 Тогда
				КорректировкаОбъект.Удалить();
			Иначе
				ДополнитьКорректировкуДвижениямиПоПрочимДоходамРасходам(КорректировкаОбъект);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.Текст = "УНИЧТОЖИТЬ ВтАналитика; УНИЧТОЖИТЬ ВтСальдо; УНИЧТОЖИТЬ ВтРучныеКорректировки";
	Запрос.Выполнить();
	
	// Если на начало периода все хорошо, а на конец есть развернутое сальдо - пересчитаем их.
	Запрос.Текст = ТекстЗапросаРазвернутоеСальдо();
	Запрос.УстановитьПараметр("НачалоМесяца",       КонецМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("Порядок",            Формат(КонецМесяца(ПериодРасчета),"ДФ=ггггММдд9ЧЧммсс99"));
	НекорректныеОстатки = Запрос.Выполнить().Выгрузить();
	
	ТаблицаКРаспределению = ОперативныеВзаиморасчетыСервер.ТаблицаКРаспределению();
	Для Каждого Стр Из НекорректныеОстатки Цикл
		НовСтр = ТаблицаКРаспределению.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		НовСтр.ДатаНачалаПересчета = ПериодРасчета;
		НовСтр.ПериодКонтроляИзмененийИСозданияЗаданий = ПериодРасчета;
	КонецЦикла;
	ОсновныеПараметры = ОперативныеВзаиморасчетыСервер.ПараметрыРаспределенияРасчетов();
	ОперативныеВзаиморасчетыСервер.ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры,ТаблицаКРаспределению);
	
КонецПроцедуры

Процедура УдалитьСистемныеКорректировкиРегистров(ДатаПересчета, Организация = Неопределено, Операция = Неопределено, Контрагент = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КорректировкаРегистров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
	|ГДЕ
	|	КорректировкаРегистров.Дата >= &Дата
	|	И (КорректировкаРегистров.Организация = &Организация ИЛИ &ПоВсемОрганизациям)
	|	И КорректировкаРегистров.Операция В (&Операции)
	|	И &ПоВсемКонтрагентам
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючАналитики
	|			ПО КлючАналитики.Ссылка = Расчеты.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	Расчеты.Период >= &Дата
	|	И КлючАналитики.Контрагент = &Контрагент
	|	И (КлючАналитики.Организация = &Организация ИЛИ &ПоВсемОрганизациям)
	|	И НЕ &ПоВсемКонтрагентам
	|	И Расчеты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|	И ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.КорректировкаРегистров).Операция В (&Операции)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючАналитики
	|			ПО КлючАналитики.Ссылка = Расчеты.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	Расчеты.Период >= &Дата
	|	И КлючАналитики.Контрагент = &Контрагент
	|	И (КлючАналитики.Организация = &Организация ИЛИ &ПоВсемОрганизациям)
	|	И НЕ &ПоВсемКонтрагентам
	|	И Расчеты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|	И ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.КорректировкаРегистров).Операция В (&Операции)
	|
	|;
	|
	|ВЫБРАТЬ
	|	КлючиАналитикиУчетаПоПартнерам.Ссылка КАК АналитикаУчетаПоПартнерам
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|ГДЕ
	|	(КлючиАналитикиУчетаПоПартнерам.Организация = &Организация ИЛИ &ПоВсемОрганизациям)
	|	И КлючиАналитикиУчетаПоПартнерам.Контрагент = &Контрагент
	|	И НЕ &ПоВсемКонтрагентам";
	Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаПересчета));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", Организация = Неопределено);
	Запрос.УстановитьПараметр("ПоВсемКонтрагентам", Контрагент = Неопределено);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Операции = Новый Массив;
	Если ЗначениеЗаполнено(Операция) Тогда
		Операции.Добавить(Операция);
	Иначе
		Операции.Добавить(Перечисления.ОперацииКорректировкиРегистров.ИсправлениеРазрывовОстатковВзаиморасчетов);
		Операции.Добавить(Перечисления.ОперацииКорректировкиРегистров.ИсправлениеРазвернутогоСальдоВзаиморасчетов);
	КонецЕсли;
	Запрос.УстановитьПараметр("Операции", Операции);
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать();
	ТаблицаАналитик = Результат[1].Выгрузить();
	ТаблицаАналитик.Индексы.Добавить("АналитикаУчетаПоПартнерам");
	
	ВРежимеЗагрузки = ДатаПересчета = Дата(1,1,1);
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект(); // ДокументОбъект.КорректировкаРегистров
		
		Для Каждого Регистр Из ДокументОбъект.ТаблицаРегистров Цикл
			Движения = ДокументОбъект.Движения[Регистр.Имя]; // РегистрНакопленияНаборЗаписей
			Движения.ОбменДанными.Загрузка = ВРежимеЗагрузки;
			Если ЗначениеЗаполнено(Контрагент) 
				И (Регистр.Имя = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Имя 
					Или Регистр.Имя = Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.Имя) Тогда
					Движения.Прочитать();
					Счетчик = Движения.Количество();
					Пока Счетчик > 0 Цикл
						Счетчик = Счетчик - 1;
						Если ТаблицаАналитик.Найти(Движения[Счетчик].АналитикаУчетаПоПартнерам) <> Неопределено Тогда
							Движения.Удалить(Счетчик);
						КонецЕсли;
					КонецЦикла;
					
			КонецЕсли;
			Движения.Записать();
		КонецЦикла;
		
		Если ДокументОбъект.Движения.РасчетыСКлиентамиПоСрокам.Количество() = 0 
			И ДокументОбъект.Движения.РасчетыСПоставщикамиПоСрокам.Количество() = 0 Тогда
			ДокументОбъект.ОбменДанными.Загрузка = ВРежимеЗагрузки;
			ДокументОбъект.Удалить();
		Иначе
			ДополнитьКорректировкуДвижениямиПоПрочимДоходамРасходам(ДокументОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеДанных

// Суммы документа.
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура, ДокументОбъект, СправочникОбъект - Объект
//  СтруктураПараметров - Структура  - Структура параметров
// 
// Возвращаемое значение:
//   Структура:
//      * СуммаВзаиморасчетовБезЗалога - Число.
//      * СуммаДокументаБезЗалога - Число.
//      * СуммаЗалогаЗаТару - Число.
//      * СуммаВзаиморасчетовПоТаре - Число.
//      * СуммаВзаиморасчетов - Число.
//      * СуммаДокумента - Число.
Функция СуммыДокумента(Объект, СтруктураПараметров, СуммыПоЗаказам = Неопределено) Экспорт
	
	Если СтруктураПараметров.Свойство("СуммыДокумента") Тогда
		Возврат СтруктураПараметров.СуммыДокумента;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Если СтруктураПараметров.ИсточникСуммТабличнаяЧасть Тогда
		Если СуммыПоЗаказам = Неопределено Тогда
			СуммыПоЗаказам                = ВзаиморасчетыСервер.ТаблицаСуммПоЗаказам(Объект,СтруктураПараметров);
		КонецЕсли;
		СуммаЗалогаЗаТару            = СуммыПоЗаказам.Итог("СуммаЗалогаЗаТару");
		СуммаДокументаБезЗалога      = СуммыПоЗаказам.Итог("СуммаПлатежа");
		СуммаВзаиморасчетовПоТаре    = СуммыПоЗаказам.Итог("СуммаВзаиморасчетовПоТаре");
		СуммаВзаиморасчетовБезЗалога = СуммыПоЗаказам.Итог("СуммаВзаиморасчетов");
	ИначеЕсли ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧ) Тогда
		ТабличнаяЧасть = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧ);
		СуммаДокументаБезЗалога      = ВзаиморасчетыКлиентСервер.ИтогПоСуммамОдногоЗнака(ТабличнаяЧасть,СтруктураПараметров.ИмяРеквизитаТЧСуммаСНДС);
		СуммаВзаиморасчетовБезЗалога = 0;
		Если ТабличнаяЧасть.Количество() > 0 Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТабличнаяЧасть[0],"СуммаВзаиморасчетов") Тогда
				СуммаВзаиморасчетовБезЗалога = ВзаиморасчетыКлиентСервер.ИтогПоСуммамОдногоЗнака(ТабличнаяЧасть, "СуммаВзаиморасчетов");
			Иначе
				СуммаВзаиморасчетовБезЗалога = ВзаиморасчетыКлиентСервер.ИтогПоСуммамОдногоЗнака(ТабличнаяЧасть, СтруктураПараметров.ИмяРеквизитаТЧСуммаСНДС);
			КонецЕсли;
		КонецЕсли;
		СуммаЗалогаЗаТару = 0;
		СуммаВзаиморасчетовПоТаре = 0;
	Иначе
		СуммаЗалогаЗаТару            = 0;
		СуммаДокументаБезЗалога      = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.СуммаДокумента);
		СуммаВзаиморасчетовБезЗалога = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.СуммаВзаиморасчетов, , 0);
		СуммаВзаиморасчетовПоТаре    = 0;
	КонецЕсли;
	
	Результат.Вставить("СуммаВзаиморасчетовБезЗалога", СуммаВзаиморасчетовБезЗалога);
	Результат.Вставить("СуммаДокументаБезЗалога", СуммаДокументаБезЗалога);
	Результат.Вставить("СуммаЗалогаЗаТару", СуммаЗалогаЗаТару);
	Результат.Вставить("СуммаВзаиморасчетовПоТаре", СуммаВзаиморасчетовПоТаре);
	Результат.Вставить("СуммаВзаиморасчетов", СуммаВзаиморасчетовБезЗалога + СуммаВзаиморасчетовПоТаре);
	Результат.Вставить("СуммаДокумента", ?(СуммаДокументаБезЗалога = Неопределено,0,СуммаДокументаБезЗалога + СуммаЗалогаЗаТару));
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыСоглашения(Соглашение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗнч(Соглашение) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
		РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение,
			"ИспользуютсяДоговорыКонтрагентов, ПорядокРасчетов,Календарь, СрокПереходаПраваСобственности, ГрафикОплаты");
	Иначе
		РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение,
			"ИспользуютсяДоговорыКонтрагентов, ПорядокРасчетов, Календарь, СрокПереходаПраваСобственности");
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РеквизитыСоглашения;
КонецФункции

//Возвращает порядок расчетов по умолчанию.
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура, ДокументОбъект, СправочникОбъект - Объект
//  СтруктураПараметров - Структура  - Структура параметров
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ПорядокРасчетов - Порядок расчетов по параметрам
Функция ПорядокРасчетовПоПараметрам(Объект, СтруктураПараметров) Экспорт
	
	ЗаказОснование = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование);
	Если Не ЗначениеЗаполнено(ЗаказОснование) Тогда
		МассивЗаказов = ПолучитьМассивЗаказовИзТЧ(Объект, СтруктураПараметров);
		Если МассивЗаказов.Количество() > 0 Тогда
			ЗаказОснование = МассивЗаказов[0];
		КонецЕсли;
	КонецЕсли;
	Соглашение     = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Соглашение);
	Если ЗначениеЗаполнено(СтруктураПараметров.ДоговорКомиссионера) Тогда
		Договор        = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДоговорКомиссионера);
	Иначе
		
		Если СтруктураПараметров.Договор = "Объект.ДоговорПродажи"
			Или СтруктураПараметров.Договор = "Объект.ДоговорПокупки" Тогда
			Договор = Неопределено;
		Иначе
			Договор = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
		КонецЕсли;
		
	КонецЕсли;
	ЭтоЗаказ       = СтруктураПараметров.ЭтоЗаказ;
	
	Возврат ВзаиморасчетыСервер.ПорядокРасчетов(ЭтоЗаказ, ЗаказОснование, Соглашение, Договор);
	
КонецФункции

//Возвращает порядок оплаты по умолчанию.
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура, ДокументОбъект, СправочникОбъект - Объект
//  СтруктураПараметров - Структура  - Структура параметров
//  СистемныеНастройки - Структура -Системные настройки
// 
// Возвращаемое значение:
//  СправочникСсылка.ГруппыФинансовогоУчетаРасчетов - ГФУПо умолчанию
Функция ГФУПоУмолчанию(Объект, СтруктураПараметров, СистемныеНастройки) Экспорт
	
	ПорядокРасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.ПорядокРасчетов);
	НакладнаяПоЗаказам = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.НакладнаяПоЗаказам,,Ложь);
	Соглашение = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.Соглашение);
	Договор = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.Договор);
	
	ГФУПоУмолчанию = ПредопределенноеЗначение("Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка");
	
	Если СтруктураПараметров.ЭтоЗаказ
		Или СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент
		Или СтруктураПараметров.ЭтоПродажаЗакупка
			И (ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказам")
				И Не НакладнаяПоЗаказам
					Или ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоЗаказамНакладным")
					Или ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамНакладным")
					Или ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоНакладным")) Тогда
		
		Если ЗначениеЗаполнено(Соглашение) Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение, "ИспользуютсяДоговорыКонтрагентов, ГруппаФинансовогоУчета");
			УстановитьПривилегированныйРежим(Ложь);
			
			Если РеквизитыСоглашения.ИспользуютсяДоговорыКонтрагентов
				И ЗначениеЗаполнено(Договор) Тогда
				ГФУПоУмолчанию = ГФУПоДоговору(Договор, СтруктураПараметров);
			Иначе
				ГФУПоУмолчанию = РеквизитыСоглашения.ГруппаФинансовогоУчета;
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Договор) Тогда
			
			ГФУПоУмолчанию = ГФУПоДоговору(Договор, СтруктураПараметров);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ГФУПоУмолчанию;
	
КонецФункции

//Возвращает порядок оплаты по умолчанию.
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура, ДокументОбъект, СправочникОбъект - Объект
//  СтруктураПараметров - Структура  - Структура параметров
// 
// Возвращаемое значение:
//  Булево, Произвольный - Оплата в валюте по умолчанию
Функция ОплатаВВалютеПоУмолчанию(Объект, СтруктураПараметров) Экспорт
	
	ФормаОплаты               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ФормаОплаты);
	БанковскийСчет            = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.БанковскийСчетОрганизации);
	Касса                     = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Касса);
	ЗаказОснование            = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование);
	Соглашение                = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Соглашение);
	Договор                   = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
	Организация               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
	
	ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	
	ВалютаОплаты = ДенежныеСредстваСервер.ПолучитьВалютуОплаты(ФормаОплаты, БанковскийСчет, Касса);
	ОплатаВВалюте = Взаиморасчетысервер.ПолучитьОплатуВВалютеПоУмолчанию(ВалютаОплаты, Организация);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ЗаказОснование)
			И ОбщегоНазначения.ЕстьРеквизитОбъекта("ОплатаВВалюте", ЗаказОснование.Метаданные()) Тогда
		ОплатаВВалюте = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказОснование, "ОплатаВВалюте");
	ИначеЕсли ЗначениеЗаполнено(Соглашение) Тогда
		УстановитьПривилегированныйРежим(Истина);
		РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение, "ИспользуютсяДоговорыКонтрагентов, ОплатаВВалюте");
		УстановитьПривилегированныйРежим(Ложь);
		Если РеквизитыСоглашения.ИспользуютсяДоговорыКонтрагентов И ЗначениеЗаполнено(Договор) Тогда
			ОплатаВВалюте = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ОплатаВВалюте");
		ИначеЕсли РеквизитыСоглашения.ИспользуютсяДоговорыКонтрагентов = Ложь Тогда
			ОплатаВВалюте = РеквизитыСоглашения.ОплатаВВалюте;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Договор) Тогда
		ОплатаВВалюте = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ОплатаВВалюте");
	Иначе 
		ВалютаОплаты = ДенежныеСредстваСервер.ПолучитьВалютуОплаты(ФормаОплаты, БанковскийСчет, Касса);
		Если НЕ ЗначениеЗаполнено(ВалютаОплаты) Тогда
			ВалютаОплаты = ВалютаРегламентированногоУчета;
		КонецЕсли;
		
		Если НЕ ВалютаОплаты = ВалютаРегламентированногоУчета Тогда
			ОплатаВВалюте = Истина;
		Иначе
			ОплатаВВалюте = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ОплатаВВалюте;
	
КонецФункции

#КонецОбласти

#Область ОчисткаПолей

//Очищает табличные части этапов графика оплат.
Процедура ОчиститьЭтапыГрафикаОплаты(Объект, СтруктураПараметров) Экспорт
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) Тогда
		ЭтапыГрафикаОплаты = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
		ЭтапыГрафикаОплаты.Очистить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ДатаПлатежа) Тогда
		Реквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.ДатаПлатежа);
		Реквизит.Данные[Реквизит.Имя] = Дата(1,1,1);
	КонецЕсли;
	
КонецПроцедуры

//Очищает ссылки на справочник Объекты расчетов.
Процедура ОчиститьОбъектРасчетов(Объект, СтруктураПараметров) Экспорт
	
	РеквизитОбъектРасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.ОбъектРасчетов);
	ЧислоВхождений = СтрЧислоВхождений(СтруктураПараметров.ОбъектРасчетов, ".");
	
	Если ЧислоВхождений = 0 Тогда
		Возврат;
	ИначеЕсли ЧислоВхождений = 1 Тогда
		РеквизитОбъектРасчетов.Данные[РеквизитОбъектРасчетов.Имя] = Справочники.ОбъектыРасчетов.ПустаяСсылка();
	Иначе 
		Для Каждого СтрокаТЧ Из РеквизитОбъектРасчетов.Данные Цикл
			СтрокаТЧ[РеквизитОбъектРасчетов.Имя] = Справочники.ОбъектыРасчетов.ПустаяСсылка();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//Очищает суммы взаиморасчетов в табличной части документа
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма объекта настройки.
// 	ПутьКДаннымТЧ - Строка - Путь к данным табличной части, в которой требуется очистить сумму взаиморасчетов.
//
Процедура ОчиститьСуммыВзаиморасчетовТЧ(Объект, СтруктураПараметров) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧ) Тогда
		Возврат;
	КонецЕсли;
	
	ТЧ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧ);
	
	Если ТЧ.Количество() > 0 И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТЧ[0], "СуммаВзаиморасчетов") Тогда
		ЕстьНДС = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТЧ[0], "СуммаНДСВзаиморасчетов");
		
		Для Каждого Стр Из ТЧ Цикл
			Стр.СуммаВзаиморасчетов = 0;
			Если ЕстьНДС Тогда
				Стр.СуммаНДСВзаиморасчетов = 0;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ДоступныеПоляЗапроса(ТекстЗапроса) Экспорт
	
	КлючевоеСлово = "ВЫБРАТЬ"; //@Query-part
	КонецВЫБРАТЬ = СтрНайти(ТекстЗапроса, КлючевоеСлово) + СтрДлина(КлючевоеСлово);
	
	КлючевоеСлово = "ИЗ"; //@Query-part
	НачалоИЗ = СтрНайти(ТекстЗапроса, КлючевоеСлово);
	
	ТекстВыборки = Сред(ТекстЗапроса, КонецВЫБРАТЬ, НачалоИЗ - КонецВЫБРАТЬ);
	
	ПодстрокиВыборки = СтрРазделить(ТекстВыборки, ",", Ложь);
	
	ДоступныеПоля = Новый Массив;
	
	КлючевоеСлово = "КАК"; //@Query-part
	ДлинаКАК = СтрДлина(КлючевоеСлово);
	// В тексте полей выборки может встречаться запятая как строка в двойных кавычках и ключевое слово КАК внутри скобок оператора ВЫРАЗИТЬ
	// необходимо соединить подстроки в целое выражение поля выборки вместе с псевдонимом, и только после этого искать ключевое слово КАК, отделяющее псевдоним
	ТекстПоляВыборки = "";
	Для каждого Подстрока Из ПодстрокиВыборки Цикл
		
		ТекстПоляВыборки = ТекстПоляВыборки + ?(ТекстПоляВыборки = "", "", ",") + Подстрока;
		
		ЧислоОткрытийЗакрытийСкобок = СтрЧислоВхождений(ТекстПоляВыборки, "(") - СтрЧислоВхождений(ТекстПоляВыборки, ")");
		ЧислоДвойныхКавычек = СтрЧислоВхождений(ТекстПоляВыборки, """");
		
		Если ЧислоОткрытийЗакрытийСкобок = 0 И ЧислоДвойныхКавычек%2 = 0 Тогда
			
			НачалоКАК = СтрНайти(ТекстПоляВыборки, КлючевоеСлово, НаправлениеПоиска.СКонца);
			Если НачалоКАК = 0 Тогда
				ВызватьИсключение НСтр("ru = 'Для всех полей выборки должен быть задан псевдоним'");
			КонецЕсли;
			
			Псевдоним = СокрЛП(Прав(ТекстПоляВыборки, СтрДлина(ТекстПоляВыборки) - (НачалоКАК + ДлинаКАК)));
			ДоступныеПоля.Добавить(Псевдоним);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДоступныеПоля;
	
КонецФункции

// Проверяет равенство таблиц по общим колонкам
// 
// Параметры:
//  Таблица1 - ТаблицаЗначений - первая таблица.
//  Таблица2 - ТаблицаЗначений - вторая таблица.
// 
// Возвращаемое значение:
//  Булево - Истина, если таблицы равны
Функция ТаблицыРавны(Таблица1, Таблица2) Экспорт
	
	МассивКолонок = Новый Массив;
	КолонкаНомерСтроки = Таблица1.Колонки.Найти("НомерСтроки");
	КолонкаИсходныйНомерСтроки = Таблица1.Колонки.Найти("ИсходныйНомерСтроки");
	Если КолонкаНомерСтроки <> Неопределено Тогда
		Таблица1.Колонки.Удалить(КолонкаНомерСтроки);
	КонецЕсли;
	Если КолонкаИсходныйНомерСтроки <> Неопределено Тогда
		Таблица1.Колонки.Удалить(КолонкаИсходныйНомерСтроки);
	КонецЕсли;
	Для Каждого Колонка Из Таблица1.Колонки Цикл
		Если ТипЗнч(Таблица2) = Тип("ТаблицаЗначений") 
			И Таблица2.Колонки.Найти(Колонка.Имя) <> Неопределено Тогда
			МассивКолонок.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Истина;
	Если Таблица1.Количество() <> Таблица2.Количество() Тогда
		Результат = Ложь;
	КонецЕсли;
	Если Результат Тогда
		Для Счетчик = 0 По Таблица1.Количество() - 1 Цикл
			Если Не ОбщегоНазначенияУТКлиентСервер.СтруктурыРавны(
						Таблица1[Счетчик],
						Таблица2[Счетчик],
						МассивКолонок) Тогда
				Результат = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	Возврат Результат;
	
КонецФункции

// Процедура заполняет курс документа по умолчанию
//
// Обязательные параметры:
//	Дата
//	ВалютаДокумента
//	ВалютаВзаиморасчетов
//
Процедура ЗаполнитьКурсКратностьПоУмолчанию(Объект, ДополненныеПараметрыМеханизма) Экспорт
	
	Для Каждого СтруктураПараметров Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
		
		Если СтруктураПараметров.КурсЧислитель = "" Или ТипЗнч(СтруктураПараметров.КурсЧислитель)<> Тип("Строка")
			Или СтруктураПараметров.КурсЗнаменатель = "" Или ТипЗнч(СтруктураПараметров.КурсЗнаменатель)<> Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;
		
		ПроверитьПараметры(СтруктураПараметров, "ВалютаДокумента,ВалютаВзаиморасчетов");
		
		Дата                 = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
		ВалютаДокумента      = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаДокумента);
		ВалютаВзаиморасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаВзаиморасчетов);
		Организация          = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
		КурсЧислитель        = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.КурсЧислитель);
		КурсЗнаменатель      = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.КурсЗнаменатель);
		ВариантКурсаДоговора = СтруктураПараметров.ВариантКурсаДоговора;
		Договор              = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
		
		ВалютаРеглУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
		
		Если Не ЗначениеЗаполнено(Дата) Тогда
			Дата = ТекущаяДатаСеанса();
		КонецЕсли;
		
		Если ВалютаДокумента = ВалютаВзаиморасчетов 
			ИЛИ НЕ ЗначениеЗаполнено(ВалютаДокумента) 
			ИЛИ НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов)
			ИЛИ НЕ ЗначениеЗаполнено(ВалютаРеглУчета) Тогда
			
			КурсЧислитель.Данные[КурсЧислитель.Имя]     = 1;
			КурсЗнаменатель.Данные[КурсЗнаменатель.Имя] = 1;
			Возврат;
			
		ИначеЕсли ВалютаДокумента = ВалютаРеглУчета И НЕ ВалютаВзаиморасчетов = ВалютаРеглУчета Тогда
			
			Если ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.УстановленныйВДоговоре Тогда
				СтруктураКурса = РегистрыСведений.КурсыВалютРасчетовПоДоговорам.ПолучитьЗначенияКурсаВалютыДоговора(Договор, Дата);
			Иначе
				СтруктураКурса = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(ВалютаВзаиморасчетов, Дата, ВалютаРеглУчета);
			КонецЕсли;
			
		ИначеЕсли НЕ ВалютаДокумента = ВалютаРеглУчета И ВалютаВзаиморасчетов = ВалютаРеглУчета Тогда
			
			СтруктураКурса = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(ВалютаДокумента, Дата, ВалютаРеглУчета);
			
		Иначе
			
			Если ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.УстановленныйВДоговоре Тогда
				КурсВалютыВзаиморасчетов = РегистрыСведений.КурсыВалютРасчетовПоДоговорам.ПолучитьЗначенияКурсаВалютыДоговора(Договор, Дата);
			Иначе
				КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(ВалютаВзаиморасчетов, Дата, ВалютаРеглУчета);
			КонецЕсли;
			КурсВалютыДокумента      = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(ВалютаДокумента, Дата, ВалютаРеглУчета);
			СтруктураКурса           = РаботаСКурсамиВалютУТ.ПолучитьКроссКурсВалют(КурсВалютыДокумента, КурсВалютыВзаиморасчетов);
			
		КонецЕсли;
		
		КурсЧислитель.Данные[КурсЧислитель.Имя] = СтруктураКурса.КурсЧислитель;
		КурсЗнаменатель.Данные[КурсЗнаменатель.Имя] = СтруктураКурса.КурсЗнаменатель;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтключитьИтогиРегистровРасчетов() Экспорт
	
	РегистрыНакопления.РасчетыСКлиентамиПланОплат.УстановитьИспользованиеИтогов(Ложь);
	РегистрыНакопления.РасчетыСКлиентамиПланОтгрузок.УстановитьИспользованиеИтогов(Ложь);
	РегистрыНакопления.РасчетыСКлиентамиПоСрокам.УстановитьИспользованиеИтогов(Ложь);
	РегистрыНакопления.РасчетыСПоставщикамиПланОплат.УстановитьИспользованиеИтогов(Ложь);
	РегистрыНакопления.РасчетыСПоставщикамиПланПоставок.УстановитьИспользованиеИтогов(Ложь);
	РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.УстановитьИспользованиеИтогов(Ложь);
	
КонецПроцедуры

Процедура ВключитьИтогиРегистровРасчетов() Экспорт
	
	РегистрыНакопления.РасчетыСКлиентамиПланОплат.УстановитьИспользованиеИтогов(Истина);
	РегистрыНакопления.РасчетыСКлиентамиПланОтгрузок.УстановитьИспользованиеИтогов(Истина);
	РегистрыНакопления.РасчетыСКлиентамиПоСрокам.УстановитьИспользованиеИтогов(Истина);
	РегистрыНакопления.РасчетыСПоставщикамиПланОплат.УстановитьИспользованиеИтогов(Истина);
	РегистрыНакопления.РасчетыСПоставщикамиПланПоставок.УстановитьИспользованиеИтогов(Истина);
	РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.УстановитьИспользованиеИтогов(Истина);
	
	РегистрыНакопления.РасчетыСКлиентамиПланОплат.ПересчитатьИтоги();
	РегистрыНакопления.РасчетыСКлиентамиПланОтгрузок.ПересчитатьИтоги();
	РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПересчитатьИтоги();
	РегистрыНакопления.РасчетыСПоставщикамиПланОплат.ПересчитатьИтоги();
	РегистрыНакопления.РасчетыСПоставщикамиПланПоставок.ПересчитатьИтоги();
	РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПересчитатьИтоги();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСПотоками

Функция РазмерПорцииОбработкиВОдномПотоке() Экспорт
	
	Возврат 1000;
	
КонецФункции

Функция КоличествоПотоковРаспределенияВзаиморасчетов() Экспорт
	
	Количество = Константы.КоличествоПотоковРаспределенияВзаиморасчетов.Получить();
	Если Количество = 0 Тогда
		Количество = 8;
	КонецЕсли;
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Количество = 1;
	КонецЕсли;
	Возврат Количество;
	
КонецФункции

// Новое описание потока.
// 
// Параметры:
//  ИмяМетода - Строка - Имя метода
// 
// Возвращаемое значение:
//  Структура - Новое описание потока:
// * ИдентификаторЗадания - Неопределено - 
// * Процедура - Строка - 
// * АдресРезультата - Строка - 
// * НаименованиеЗадания - Строка - 
// * ПараметрыПроцедуры - Структура - 
Функция НовоеОписаниеПотока(ИмяМетода = "") Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("ИдентификаторЗадания", Неопределено);
	Описание.Вставить("Процедура", ИмяМетода);
	Описание.Вставить("АдресРезультата", "");
	Описание.Вставить("НаименованиеЗадания", "");
	Описание.Вставить("ПараметрыПроцедуры", Новый Структура);
	Возврат Описание;
	
КонецФункции

Процедура ЗапуститьОбработкуВФоне(Поток) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Неопределено);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Поток.НаименованиеЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	РезультатЗапуска = ДлительныеОперации.ВыполнитьВФоне(Поток.Процедура, Поток.ПараметрыПроцедуры, ПараметрыВыполнения);
	
	Поток.АдресРезультата = РезультатЗапуска.АдресРезультата;
	Статус = РезультатЗапуска.Статус;
	
	Если Статус = "Выполняется" Тогда
		Поток.ИдентификаторЗадания = РезультатЗапуска.ИдентификаторЗадания;
	ИначеЕсли Статус <> "Выполняется" И Статус <> "Выполнено" Тогда
		ВызватьИсключение РезультатЗапуска.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОжидатьЗавершениеВсехПотоков(Потоки, КортежиВОбработке = Неопределено, КоличествоОбработанныхЗаписей = 0) Экспорт
	Пока Потоки.Количество() > 0 Цикл
		Если НЕ ЗавершитьПотокиВыполнившиеФЗ(Потоки, КортежиВОбработке, КоличествоОбработанныхЗаписей) Тогда
			ОжидатьЗавершениеПотока(Потоки[0]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЗавершитьПотокиВыполнившиеФЗ(Потоки, КортежиВОбработке = Неопределено, КоличествоОбработанныхЗаписей = 0) Экспорт
	
	ЕстьЗавершенныеПотоки = Ложь;
	
	Индекс = Потоки.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Поток = Потоки[Индекс];
		ИдентификаторЗадания = Поток.ИдентификаторЗадания;
		
		Если ИдентификаторЗадания <> Неопределено Тогда
			ЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
		КонецЕсли;
		
		Если ИдентификаторЗадания = Неопределено ИЛИ ЗаданиеВыполнено Тогда
			Если ЗначениеЗаполнено(Поток.АдресРезультата) Тогда
				Результат = ПолучитьИзВременногоХранилища(Поток.АдресРезультата);
				Если Результат <> Неопределено И Результат.Свойство("КоличествоОбработанныхЗаписей") Тогда
					КоличествоОбработанныхЗаписей = КоличествоОбработанныхЗаписей + Результат.КоличествоОбработанныхЗаписей;
				КонецЕсли;
				УдалитьИзВременногоХранилища(Поток.АдресРезультата);
			КонецЕсли;
			Отбор = Новый Структура("ИдПотока",ИдентификаторЗадания);
			Если КортежиВОбработке <> Неопределено Тогда
				КортежиКУдалению = КортежиВОбработке.НайтиСтроки(Отбор);
				Для Каждого Кортеж Из КортежиКУдалению Цикл
					КортежиВОбработке.Удалить(Кортеж);
				КонецЦикла;
			КонецЕсли;
			Потоки.Удалить(Индекс);
			ЕстьЗавершенныеПотоки = Истина;
		КонецЕсли;
		
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Возврат ЕстьЗавершенныеПотоки;
	
КонецФункции

Функция ОжидатьЗавершениеПотока(Поток, Длительность = 1) Экспорт
	
	Если Поток <> Неопределено И Поток.ИдентификаторЗадания <> Неопределено Тогда
		Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Поток.ИдентификаторЗадания);
		
		Если Задание <> Неопределено Тогда
			Попытка
				Задание.ОжидатьЗавершенияВыполнения(Длительность);
				Возврат Истина;
			Исключение
				// Специальная обработка не требуется, возможно исключение вызвано истечением времени ожидания.
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

// Находит по указанным параметрам корректировки регистров, очищает их и возвращает новую корректировку.
//
// Параметры:
//   ПериодКорректировки - Дата - Все корректировки позже этой даты будут очищены, а с равной датой еще и удалены.
//   Организация - СправочникСсылка.Организации.
//   Операция - ПеречислениеСсылка.ОперацииКорректировкиРегистров.
//
// Возвращаемое значение:
//   ДокументОбъект.КорректировкаРегистров - Пустой документ корректировки, с заполненными реквизитами.
//
Функция КорректировкаРегистров(ПериодКорректировки, Организация, Операция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КорректировкаРегистров.Ссылка КАК Ссылка,
	|	КорректировкаРегистров.Дата КАК Дата
	|ИЗ
	|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
	|ГДЕ
	|	КорректировкаРегистров.Дата >= &Дата
	|	И КорректировкаРегистров.Операция = &Операция
	|	И КорректировкаРегистров.Организация = &Организация
	|УПОРЯДОЧИТЬ ПО
	|	КорректировкаРегистров.Дата ВОЗР";
	Запрос.УстановитьПараметр("Дата", КонецМесяца(ПериодКорректировки));
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	КорректировкаОбъект = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект(); // ДокументОбъект.КорректировкаРегистров
		Для Каждого Регистр Из ДокументОбъект.ТаблицаРегистров Цикл
			Движения = ДокументОбъект.Движения[Регистр.Имя]; // РегистрНакопленияНаборЗаписей
			Движения.Записать();
		КонецЦикла;
		
		Если Выборка.Дата = КонецМесяца(ПериодКорректировки) Тогда
			КорректировкаОбъект = ДокументОбъект;
			КорректировкаОбъект.УстановитьПометкуУдаления(Ложь);
		Иначе
			ДокументОбъект.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
	Если КорректировкаОбъект = Неопределено Тогда
		КорректировкаОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
		КорректировкаОбъект.Дата        = ПериодКорректировки;
		КорректировкаОбъект.Операция    = Операция;
		КорректировкаОбъект.Организация = Организация;
		КорректировкаОбъект.УстановитьСсылкуНового(Документы.КорректировкаРегистров.ПолучитьСсылку());
		
		НовСтр = КорректировкаОбъект.ТаблицаРегистров.Добавить();
		НовСтр.Имя = "РасчетыСКлиентамиПоСрокам";
		НовСтр = КорректировкаОбъект.ТаблицаРегистров.Добавить();
		НовСтр.Имя = "РасчетыСПоставщикамиПоСрокам";
		
		КорректировкаОбъект.Записать();
	КонецЕсли;
	
	Возврат КорректировкаОбъект;
	
КонецФункции

// Временная таблица для определения наличичия ручных корректировок регистров 
// при проверке развернутого сальдо и некорректных остатков.
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ТекстЗапросаВтРучныхКорректировок()
	
	Возврат "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.ОбъектРасчетов КАК ОбъектРасчетов,
	|	МАКСИМУМ(ВложенныйЗапрос.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ВтРучныеКорректировки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоСрокам.ОбъектРасчетов            КАК ОбъектРасчетов,
	|		РасчетыСКлиентамиПоСрокам.Регистратор               КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|	ГДЕ
	|		РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам В
	|			(ВЫБРАТЬ
	|				Т.АналитикаУчетаПоПартнерам
	|			ИЗ
	|				ВтАналитика КАК Т)
	|		И РасчетыСКлиентамиПоСрокам.Активность
	|		И РасчетыСКлиентамиПоСрокам.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|		И ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокам.Регистратор КАК Документ.КорректировкаРегистров).Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииКорректировкиРегистров.РучнаяКорректировка)
	|		И РасчетыСКлиентамиПоСрокам.Период <= &НачалоМесяца
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов,
	|		РасчетыСПоставщикамиПоСрокам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам В
	|			(ВЫБРАТЬ
	|				Т.АналитикаУчетаПоПартнерам
	|			ИЗ
	|				ВтАналитика КАК Т)
	|		И РасчетыСПоставщикамиПоСрокам.Активность
	|		И РасчетыСПоставщикамиПоСрокам.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|		И ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.Регистратор КАК Документ.КорректировкаРегистров).Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииКорректировкиРегистров.РучнаяКорректировка)
	|		И РасчетыСПоставщикамиПоСрокам.Период <= &НачалоМесяца
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентами.ОбъектРасчетов,
	|		РасчетыСКлиентами.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|	ГДЕ
	|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам В
	|			(ВЫБРАТЬ
	|				Т.АналитикаУчетаПоПартнерам
	|			ИЗ
	|				ВтАналитика КАК Т)
	|		И РасчетыСКлиентами.Активность
	|		И РасчетыСКлиентами.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|		И ВЫРАЗИТЬ(РасчетыСКлиентами.Регистратор КАК Документ.КорректировкаРегистров).Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииКорректировкиРегистров.РучнаяКорректировка)
	|		И РасчетыСКлиентами.Период <= &НачалоМесяца
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщиками.ОбъектРасчетов,
	|		РасчетыСПоставщиками.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|	ГДЕ
	|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам В
	|			(ВЫБРАТЬ
	|				Т.АналитикаУчетаПоПартнерам
	|			ИЗ
	|				ВтАналитика КАК Т)
	|		И РасчетыСПоставщиками.Активность
	|		И РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|		И ВЫРАЗИТЬ(РасчетыСПоставщиками.Регистратор КАК Документ.КорректировкаРегистров).Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииКорректировкиРегистров.РучнаяКорректировка)
	|		И РасчетыСПоставщиками.Период <= &НачалоМесяца) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.ОбъектРасчетов
	|";
	
КонецФункции

// Добавляет в движения данные по прочим доходам/расходам 
// 
// Параметры:
// 	КорректировкаОбъект - ДокументОбъект.КорректировкаРегистров - ДокументОбъект, с уже записанными движениями по расчетам.
Процедура ДополнитьКорректировкуДвижениямиПоПрочимДоходамРасходам(КорректировкаОбъект) Экспорт
	
	Если КорректировкаОбъект.ТаблицаРегистров.Найти("ПрочиеДоходы","Имя") = Неопределено Тогда
		НовСтр = КорректировкаОбъект.ТаблицаРегистров.Добавить();
		НовСтр.Имя = "ПрочиеДоходы";
	КонецЕсли;
	
	Если КорректировкаОбъект.ТаблицаРегистров.Найти("ПрочиеРасходы","Имя") = Неопределено Тогда
		НовСтр = КорректировкаОбъект.ТаблицаРегистров.Добавить();
		НовСтр.Имя = "ПрочиеРасходы";
	КонецЕсли;
	
	Если КорректировкаОбъект.ТаблицаРегистров.Найти("ПрочиеАктивыПассивы","Имя") = Неопределено Тогда
		НовСтр = КорректировкаОбъект.ТаблицаРегистров.Добавить();
		НовСтр.Имя = "ПрочиеАктивыПассивы";
	КонецЕсли;
	
	НачалоТекущегоПериода = КонецМесяца(КорректировкаОбъект.Дата)+1;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КорректировкаСсылка", КорректировкаОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", НачалоТекущегоПериода);
	Запрос.УстановитьПараметр("СтатьяДоходов", ПланыВидовХарактеристик.СтатьиДоходов.ПрибыльУбытокПрошлыхЛет);
	Запрос.УстановитьПараметр("СтатьяРасходов", ПланыВидовХарактеристик.СтатьиРасходов.ПрибыльУбытокПрошлыхЛет);
	Запрос.УстановитьПараметр("УправленческийУчетОрганизаций", РасчетСебестоимостиПовтИсп.УправленческийУчетОрганизаций(НачалоТекущегоПериода));
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	&Период                                 КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)  КАК ВидДвижения,
	|	ВложенныйЗапрос.Организация             КАК Организация,
	|	ВложенныйЗапрос.Подразделение           КАК Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&СтатьяДоходов                          КАК СтатьяДоходов,
	|	ВложенныйЗапрос.Организация             КАК АналитикаДоходов,
	|	СУММА(ВложенныйЗапрос.Сумма)            КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаРегл)        КАК СуммаРегл,
	|	СУММА(ВЫБОР КОГДА &УправленческийУчетОрганизаций 
	|				ТОГДА ВложенныйЗапрос.СуммаУпр
	|				ИНАЧЕ 0
	|		КОНЕЦ)                              КАК СуммаУпр
	|ИЗ (ВЫБРАТЬ
	|		Расчеты.АналитикаУчетаПоПартнерам.Организация             КАК Организация,
	|		ЕСТЬNULL(Расчеты.ОбъектРасчетов.Подразделение,
	|			ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|		Расчеты.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		
	|		ВЫБОР КОГДА Расчеты.Долг < 0
	|			ТОГДА -Расчеты.Долг
	|			ИНАЧЕ Расчеты.Долг
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.Предоплата < 0
	|			ТОГДА -Расчеты.Предоплата
	|			ИНАЧЕ Расчеты.Предоплата
	|		КОНЕЦ                                                     КАК Сумма,
	|		ВЫБОР КОГДА Расчеты.ДолгРегл < 0
	|			ТОГДА -Расчеты.ДолгРегл
	|			ИНАЧЕ Расчеты.ДолгРегл
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаРегл < 0
	|			ТОГДА -Расчеты.ПредоплатаРегл
	|			ИНАЧЕ Расчеты.ПредоплатаРегл
	|		КОНЕЦ                                                     КАК СуммаРегл,
	|		ВЫБОР КОГДА Расчеты.ДолгУпр < 0
	|			ТОГДА -Расчеты.ДолгУпр
	|			ИНАЧЕ Расчеты.ДолгУпр
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаУпр < 0
	|			ТОГДА -Расчеты.ПредоплатаУпр
	|			ИНАЧЕ Расчеты.ПредоплатаУпр
	|		КОНЕЦ                                                     КАК СуммаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|	ГДЕ
	|		Расчеты.Активность
	|		И Расчеты.Регистратор = &КорректировкаСсылка
	|		И ((Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И (Расчеты.Предоплата > 0 ИЛИ Расчеты.Долг < 0))
	|			ИЛИ (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И (Расчеты.Долг > 0 ИЛИ Расчеты.Предоплата < 0)))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Расчеты.АналитикаУчетаПоПартнерам.Организация             КАК Организация,
	|		ЕСТЬNULL(Расчеты.ОбъектРасчетов.Подразделение,
	|			ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|		Расчеты.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		
	|		ВЫБОР КОГДА Расчеты.Долг < 0
	|				ТОГДА -Расчеты.Долг
	|			ИНАЧЕ Расчеты.Долг
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.Предоплата < 0
	|			ТОГДА -Расчеты.Предоплата
	|			ИНАЧЕ Расчеты.Предоплата
	|		КОНЕЦ                                                     КАК Сумма,
	|		ВЫБОР КОГДА Расчеты.ДолгРегл < 0
	|			ТОГДА -Расчеты.ДолгРегл
	|			ИНАЧЕ Расчеты.ДолгРегл
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаРегл < 0
	|			ТОГДА -Расчеты.ПредоплатаРегл
	|			ИНАЧЕ Расчеты.ПредоплатаРегл
	|		КОНЕЦ                                                     КАК СуммаРегл,
	|		ВЫБОР КОГДА Расчеты.ДолгУпр < 0
	|			ТОГДА -Расчеты.ДолгУпр
	|			ИНАЧЕ Расчеты.ДолгУпр
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаУпр < 0
	|			ТОГДА -Расчеты.ПредоплатаУпр
	|			ИНАЧЕ Расчеты.ПредоплатаУпр
	|		КОНЕЦ                                                     КАК СуммаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
	|	ГДЕ	
	|		Расчеты.Активность
	|		И Расчеты.Регистратор = &КорректировкаСсылка
	|		И ((Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И (Расчеты.Предоплата > 0 ИЛИ Расчеты.Долг < 0))
	|			ИЛИ (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И (Расчеты.Долг > 0 ИЛИ Расчеты.Предоплата < 0)))) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности
	|;
	|ВЫБРАТЬ
	|	&Период                                 КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)  КАК ВидДвижения,
	|	ВложенныйЗапрос.Организация             КАК Организация,
	|	ВложенныйЗапрос.Подразделение           КАК Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&СтатьяРасходов                         КАК СтатьяРасходов,
	|	ВложенныйЗапрос.Организация             КАК АналитикаРасходов,
	|	СУММА(ВложенныйЗапрос.Сумма)            КАК Сумма,
	|	СУММА(ВложенныйЗапрос.Сумма)            КАК СуммаБезНДС,
	|	СУММА(ВложенныйЗапрос.СуммаРегл)        КАК СуммаРегл,
	|	СУММА(ВЫБОР КОГДА &УправленческийУчетОрганизаций
	|				ТОГДА ВложенныйЗапрос.СуммаУпр
	|				ИНАЧЕ 0
	|		КОНЕЦ)                              КАК СуммаУпр,
	|	0                                       КАК ПостояннаяРазница,
	|	0                                       КАК ВременнаяРазница
	|ИЗ (ВЫБРАТЬ
	|		Расчеты.АналитикаУчетаПоПартнерам.Организация             КАК Организация,
	|		ЕСТЬNULL(Расчеты.ОбъектРасчетов.Подразделение,
	|			ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|		Расчеты.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		
	|		ВЫБОР КОГДА Расчеты.Долг < 0
	|			ТОГДА -Расчеты.Долг
	|			ИНАЧЕ Расчеты.Долг
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.Предоплата < 0
	|			ТОГДА -Расчеты.Предоплата
	|			ИНАЧЕ Расчеты.Предоплата
	|		КОНЕЦ                                                     КАК Сумма,
	|		ВЫБОР КОГДА Расчеты.ДолгРегл < 0
	|			ТОГДА -Расчеты.ДолгРегл
	|			ИНАЧЕ Расчеты.ДолгРегл
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаРегл < 0
	|			ТОГДА -Расчеты.ПредоплатаРегл
	|			ИНАЧЕ Расчеты.ПредоплатаРегл
	|		КОНЕЦ                                                     КАК СуммаРегл,
	|		ВЫБОР КОГДА Расчеты.ДолгУпр < 0
	|			ТОГДА -Расчеты.ДолгУпр
	|			ИНАЧЕ Расчеты.ДолгУпр
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаУпр < 0
	|			ТОГДА -Расчеты.ПредоплатаУпр
	|			ИНАЧЕ Расчеты.ПредоплатаУпр
	|		КОНЕЦ                                                     КАК СуммаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|	ГДЕ
	|		Расчеты.Активность
	|		И Расчеты.Регистратор = &КорректировкаСсылка
	|		И ((Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И (Расчеты.Предоплата > 0 ИЛИ Расчеты.Долг < 0))
	|			ИЛИ (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И (Расчеты.Долг > 0 ИЛИ Расчеты.Предоплата < 0)))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Расчеты.АналитикаУчетаПоПартнерам.Организация             КАК Организация,
	|		ЕСТЬNULL(Расчеты.ОбъектРасчетов.Подразделение,
	|			ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|		Расчеты.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		
	|		ВЫБОР КОГДА Расчеты.Долг < 0
	|				ТОГДА -Расчеты.Долг
	|			ИНАЧЕ Расчеты.Долг
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.Предоплата < 0
	|			ТОГДА -Расчеты.Предоплата
	|			ИНАЧЕ Расчеты.Предоплата
	|		КОНЕЦ                                                     КАК Сумма,
	|		ВЫБОР КОГДА Расчеты.ДолгРегл < 0
	|			ТОГДА -Расчеты.ДолгРегл
	|			ИНАЧЕ Расчеты.ДолгРегл
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаРегл < 0
	|			ТОГДА -Расчеты.ПредоплатаРегл
	|			ИНАЧЕ Расчеты.ПредоплатаРегл
	|		КОНЕЦ                                                     КАК СуммаРегл,
	|		ВЫБОР КОГДА Расчеты.ДолгУпр < 0
	|			ТОГДА -Расчеты.ДолгУпр
	|			ИНАЧЕ Расчеты.ДолгУпр
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаУпр < 0
	|			ТОГДА -Расчеты.ПредоплатаУпр
	|			ИНАЧЕ Расчеты.ПредоплатаУпр
	|		КОНЕЦ                                                     КАК СуммаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
	|	ГДЕ	
	|		Расчеты.Активность
	|		И Расчеты.Регистратор = &КорректировкаСсылка
	|		И ((Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И (Расчеты.Предоплата > 0 ИЛИ Расчеты.Долг < 0))
	|			ИЛИ (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И (Расчеты.Долг > 0 ИЛИ Расчеты.Предоплата < 0)))) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности
	|";
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Доходы = Результаты[0].Выгрузить();
	Расходы = Результаты[1].Выгрузить();
	
	ДвиженияДоходы = КорректировкаОбъект.Движения.ПрочиеДоходы;
	ДвиженияДоходы.Загрузить(Доходы);
	ДвиженияДоходы.Записать();
	
	ДвиженияРасходы = КорректировкаОбъект.Движения.ПрочиеРасходы;
	ДвиженияРасходы.Загрузить(Расходы);
	ДвиженияРасходы.Записать();
	
	КорректировкаОбъект.Записать();
	
	УправленческийУчетПроведениеСервер.ОбновитьДвиженияАктивовПассивов(КорректировкаОбъект.Ссылка, КорректировкаОбъект.Движения);
	
	АктивыПассивы = КорректировкаОбъект.Движения.ПрочиеАктивыПассивы.Выгрузить();
	АктивыПассивы.ЗаполнитьЗначения(НачалоТекущегоПериода, "Период");
	КорректировкаОбъект.Движения.ПрочиеАктивыПассивы.Загрузить(АктивыПассивы);
	КорректировкаОбъект.Движения.ПрочиеАктивыПассивы.Записать();
	
КонецПроцедуры

//Возвращает таблицу объектов расчетов по которым есть движения по ресурсам "Сумма", "КОплате", "КОтгрузке"
//
//	Возвращаемое значение:
//		ТаблицаЗначений - см. ТаблицаКРаспределению - таблица всех кортежей аналитик и объектов расчетов к пересчету.
//
Функция ПолучитьВсеОбъекты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Расчеты.Валюта КАК Валюта,
	|	ДАТАВРЕМЯ(1,1,1) КАК ДатаНачалаПересчета,
	|	ДАТАВРЕМЯ(3999,1,1) КАК ПериодКонтроляИзмененийИСозданияЗаданий,
	|
	|	Расчеты.ОбъектРасчетовПриемник КАК ОбъектРасчетовПриемник,
	|	Расчеты.АналитикаУчетаПоПартнерамПриемник КАК АналитикаУчетаПоПартнерамПриемник,
	|	Расчеты.ВалютаПриемник КАК ВалютаПриемник,
	|	Расчеты.ПоДаннымОбъектаРасчетовИсточника КАК ПоДаннымОбъектаРасчетовИсточника,
	|	МИНИМУМ(Расчеты.Регистратор) КАК Документ
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК СвязанныеРасчетыСКлиентами
	|			ПО СвязанныеРасчетыСКлиентами.АналитикаУчетаПоПартнерам = Расчеты.АналитикаУчетаПоПартнерамПриемник
	|			И СвязанныеРасчетыСКлиентами.ОбъектРасчетов = Расчеты.ОбъектРасчетовПриемник
	|			И СвязанныеРасчетыСКлиентами.Валюта = Расчеты.ВалютаПриемник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК СвязанныеРасчетыСПоставщиками
	|			ПО СвязанныеРасчетыСПоставщиками.АналитикаУчетаПоПартнерам = Расчеты.АналитикаУчетаПоПартнерамПриемник
	|			И СвязанныеРасчетыСПоставщиками.ОбъектРасчетов = Расчеты.ОбъектРасчетовПриемник
	|			И СвязанныеРасчетыСПоставщиками.Валюта = Расчеты.ВалютаПриемник
	|ГДЕ
	|	(Расчеты.Сумма <> 0 ИЛИ Расчеты.КОплате <> 0 ИЛИ Расчеты.КОтгрузке <> 0)
	|	И Расчеты.Активность
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.АналитикаУчетаПоПартнерам ,
	|	Расчеты.ОбъектРасчетов ,
	|	Расчеты.Валюта ,
	|	Расчеты.ОбъектРасчетовПриемник ,
	|	Расчеты.АналитикаУчетаПоПартнерамПриемник ,
	|	Расчеты.ВалютаПриемник ,
	|	Расчеты.ПоДаннымОбъектаРасчетовИсточника
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Расчеты.Валюта КАК Валюта,
	|	ДАТАВРЕМЯ(1,1,1) КАК ДатаНачалаПересчета,
	|	ДАТАВРЕМЯ(3999,1,1) КАК ПериодКонтроляИзмененийИСозданияЗаданий,
	|
	|	Расчеты.ОбъектРасчетовПриемник КАК ОбъектРасчетовПриемник,
	|	Расчеты.АналитикаУчетаПоПартнерамПриемник КАК АналитикаУчетаПоПартнерамПриемник,
	|	Расчеты.ВалютаПриемник КАК ВалютаПриемник,
	|	Расчеты.ПоДаннымОбъектаРасчетовИсточника КАК ПоДаннымОбъектаРасчетовИсточника,
	|	МИНИМУМ(Расчеты.Регистратор) КАК Документ
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК СвязанныеРасчетыСКлиентами
	|			ПО СвязанныеРасчетыСКлиентами.АналитикаУчетаПоПартнерам = Расчеты.АналитикаУчетаПоПартнерамПриемник
	|			И СвязанныеРасчетыСКлиентами.ОбъектРасчетов = Расчеты.ОбъектРасчетовПриемник
	|			И СвязанныеРасчетыСКлиентами.Валюта = Расчеты.ВалютаПриемник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК СвязанныеРасчетыСПоставщиками
	|			ПО СвязанныеРасчетыСПоставщиками.АналитикаУчетаПоПартнерам = Расчеты.АналитикаУчетаПоПартнерамПриемник
	|			И СвязанныеРасчетыСПоставщиками.ОбъектРасчетов = Расчеты.ОбъектРасчетовПриемник
	|			И СвязанныеРасчетыСПоставщиками.Валюта = Расчеты.ВалютаПриемник
	|ГДЕ
	|	(Расчеты.Сумма <> 0 ИЛИ Расчеты.КОплате <> 0 ИЛИ Расчеты.КПоступлению <> 0)
	|	И Расчеты.Активность
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.АналитикаУчетаПоПартнерам ,
	|	Расчеты.ОбъектРасчетов ,
	|	Расчеты.Валюта ,
	|	Расчеты.ОбъектРасчетовПриемник ,
	|	Расчеты.АналитикаУчетаПоПартнерамПриемник ,
	|	Расчеты.ВалютаПриемник ,
	|	Расчеты.ПоДаннымОбъектаРасчетовИсточника
	|";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОтразитьСостоянияЗаказов(ОбработанныеДанные)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбработанныеДанные", ОбработанныеДанные);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ПОМЕСТИТЬ ВтОбработанныеДанные
	|ИЗ
	|	&ОбработанныеДанные КАК Таблица
	|
	|;
	|
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Объект КАК ОбработанныйДокумент
	|ИЗ
	|	ВтОбработанныеДанные КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ОбъектыРасчетов.Ссылка = Таблица.ОбъектРасчетов
	|ГДЕ
	|	ОбъектыРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Заказ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	РасчетыСКлиентами.ПродажаПоЗаказу КАК ОбработанныйДокумент
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ОбъектыРасчетов.Объект = РасчетыСКлиентами.ПродажаПоЗаказу
	|		И НЕ ОбъектыРасчетов.ПометкаУдаления
	|ГДЕ
	|	(РасчетыСКлиентами.АналитикаУчетаПоПартнерам, РасчетыСКлиентами.ОбъектРасчетов)
	|	В (ВЫБРАТЬ Т.АналитикаУчетаПоПартнерам, Т.ОбъектРасчетов ИЗ ВтОбработанныеДанные КАК Т)
	|	И РасчетыСКлиентами.ПродажаПоЗаказу <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	РасчетыСПоставщиками.ЗакупкаПоЗаказу КАК ОбработанныйДокумент
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ОбъектыРасчетов.Объект = РасчетыСПоставщиками.ЗакупкаПоЗаказу
	|		И НЕ ОбъектыРасчетов.ПометкаУдаления
	|ГДЕ
	|	(РасчетыСПоставщиками.АналитикаУчетаПоПартнерам, РасчетыСПоставщиками.ОбъектРасчетов)
	|	В (ВЫБРАТЬ Т.АналитикаУчетаПоПартнерам, Т.ОбъектРасчетов ИЗ ВтОбработанныеДанные КАК Т)
	|	И РасчетыСПоставщиками.ЗакупкаПоЗаказу <> НЕОПРЕДЕЛЕНО
	|";
	
	МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбработанныйДокумент");
	
	РегистрыКОтражению = СостоянияДокументов.РегистрыКОтражениюСостоянияЗаказов();
	РегистрыКОтражению.СостоянияЗаказовКлиентов    = Истина;
	РегистрыКОтражению.СостоянияЗаказовПоставщикам = Истина;
	
	СостоянияДокументов.ДобавитьЗаданияКОтражениюСостоянияЗаказов(Неопределено, МассивДокументов,, РегистрыКОтражению);
	
КонецПроцедуры

Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Взаиморасчеты'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

// Возвращает группу финансового учета по договору
Функция ГФУПоДоговору(Договор, СтруктураПараметров)
	
	Если ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями")
		И СтруктураПараметров.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком Тогда
		ИмяРеквизитаГФУ = "ГруппаФинансовогоУчетаПолучателя";
	Иначе
		ИмяРеквизитаГФУ = "ГруппаФинансовогоУчета";
	КонецЕсли;
	
	ГруппаФинансовогоУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, ИмяРеквизитаГФУ);
	
	Возврат ГруппаФинансовогоУчета;
	
КонецФункции

// Для накладной по нескольким заказам возвращает массив этих заказов
//
// Параметры:
//  Объект - ДокументОбъект, СправочникОбъект, ФормаКлиентскогоПриложения - объект для поиска заказов
//  СтруктураПараметров - см. ВзаиморасчетыСервер.ПараметрыМеханизма
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка
Функция ПолучитьМассивЗаказовИзТЧ(Объект, СтруктураПараметров) Экспорт
	
	МассивЗаказов = Новый Массив;
	ТЧ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧ);
	Если ЗначениеЗаполнено(ТЧ) И ЗначениеЗаполнено(СтруктураПараметров.ИмяРеквизитаТЧЗаказ) Тогда
		Заказы = ТЧ.Выгрузить(, СтруктураПараметров.ИмяРеквизитаТЧЗаказ);
		Заказы.Свернуть(СтруктураПараметров.ИмяРеквизитаТЧЗаказ,);
		МассивЗаказов = Заказы.ВыгрузитьКолонку(СтруктураПараметров.ИмяРеквизитаТЧЗаказ);
		
		сч = 0;
		Пока сч < МассивЗаказов.Количество() Цикл
			Если Не ЗначениеЗаполнено(МассивЗаказов[сч]) Тогда
				МассивЗаказов.Удалить(сч);
			Иначе
				сч= сч + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивЗаказов;
	
Конецфункции

Процедура ПроверитьПараметры(СтруктураПараметров, ОбязательныеПараметры)
	
	Параметры = СтрРазделить(ОбязательныеПараметры, ",");
	Для Каждого Параметр Из Параметры Цикл
		Если НЕ ЗначениеЗаполнено(СтруктураПараметров[СокрЛП(Параметр)]) Тогда
			ВызватьИсключение(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В модуле менеджера документа не заполнен путь к необходимому параметру %1'"),
				СокрЛП(Параметр)))
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
