#Область СлужебныйПрограммныйИнтерфейс

// Дополняет массив исключений источников оповещений.
// 
// Параметры:
//  Исключения - Массив из Строка - Источники оповещений исключения
Процедура ДополнитьИсточникиОповещенийИсключения(Исключения) Экспорт
	ОповещенияПользователейОСобытияхЛокализация.ДополнитьИсточникиОповещенийИсключения(Исключения);
КонецПроцедуры

// Дополняет массив объектами с описанием видов оповещений.
// 
// Параметры:
//  МассивОбъектов - Массив из Строка - Источники оповещений исключения
Процедура ДополнитьОбъектыСОписаниемВидовОповещений(МассивОбъектов) Экспорт
	
	МассивОбъектов.Добавить(Метаданные.Справочники.ДоговорыКонтрагентов.ПолноеИмя());
	МассивОбъектов.Добавить(Метаданные.Справочники.СоглашенияСКлиентами.ПолноеИмя());
	МассивОбъектов.Добавить(Метаданные.Справочники.СоглашенияСПоставщиками.ПолноеИмя());
	
	МассивОбъектов.Добавить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя());
	
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ДенежныеСредстваКВыплате.ПолноеИмя());
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ЗаказыПоставщикам.ПолноеИмя());
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.ПолноеИмя());
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя());
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОплат.ПолноеИмя());
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя());
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат.ПолноеИмя());
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ТоварыКОтгрузке.ПолноеИмя());
	МассивОбъектов.Добавить(Метаданные.РегистрыНакопления.ТоварыКПоступлению.ПолноеИмя());
	
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.СостоянияЗаказовКлиентов.ПолноеИмя());
	МассивОбъектов.Добавить(Метаданные.РегистрыСведений.СостоянияЗаказовПоставщикам.ПолноеИмя());
	
	ОповещенияПользователейОСобытияхЛокализация.ДополнитьОбъектыСОписаниемВидовОповещений(МассивОбъектов);
	
КонецПроцедуры

// Формирует массив объектов с описанием видов оповещений.
// 
// Параметры:
//  ГруппыВидовОповещений - см. ОповещенияПользователейОСобытиях.ГруппыВидовОповещений
Процедура ДополнитьГруппыВидовОповещений(ГруппыВидовОповещений) Экспорт
	
	ГруппыВидовОповещений.Вставить("Продажи",
		ОповещенияПользователейОСобытиях.ОписаниеГруппыВидовОповещений("9ca9ef1c-d839-4fae-b1e9-ec578486c184", 
			НСтр("ru = 'Продажи'", ОбщегоНазначения.КодОсновногоЯзыка())));
	
	ГруппыВидовОповещений.Вставить("Закупки",
		ОповещенияПользователейОСобытиях.ОписаниеГруппыВидовОповещений("9ed8539b-1da7-4801-966d-bab6969a3968", 
			НСтр("ru = 'Закупки'", ОбщегоНазначения.КодОсновногоЯзыка())));
	
	ГруппыВидовОповещений.Вставить("Казначейство",
		ОповещенияПользователейОСобытиях.ОписаниеГруппыВидовОповещений("dee8a453-b373-40cc-9096-830f95f0f4fd", 
			НСтр("ru = 'Казначейство'", ОбщегоНазначения.КодОсновногоЯзыка())));

	ГруппыВидовОповещений.Вставить("ВзаиморасчетыСКлиентами",
		ОповещенияПользователейОСобытиях.ОписаниеГруппыВидовОповещений("b2f42f53-94a6-4f6d-99f9-ab78f91074d6", 
			НСтр("ru = 'Взаиморасчеты с клиентами'", ОбщегоНазначения.КодОсновногоЯзыка())));
	
	ГруппыВидовОповещений.Вставить("ВзаиморасчетыСПоставщиками",
		ОповещенияПользователейОСобытиях.ОписаниеГруппыВидовОповещений("105818a5-b852-4e3a-aeff-60487133f51d", 
			НСтр("ru = 'Взаиморасчеты с поставщиками'", ОбщегоНазначения.КодОсновногоЯзыка())));
			
	ГруппыВидовОповещений.Вставить("ДоговорыКонтрагентов",
		ОповещенияПользователейОСобытиях.ОписаниеГруппыВидовОповещений("75d39378-7656-4717-816c-494b8f04cc47", 
			НСтр("ru = 'Договоры контрагентов'", ОбщегоНазначения.КодОсновногоЯзыка())));
	
	ОповещенияПользователейОСобытияхЛокализация.ДополнитьГруппыВидовОповещений(ГруппыВидовОповещений);
	
КонецПроцедуры

// Дополняет поддерживаемые виды метаданных.
// 
// Параметры:
//  ПоддерживаемыеВидыМетаданных - см. ОповещенияПользователейОСобытиях.ПоддерживаемыеВидыМетаданных
Процедура ДополнитьПоддерживаемыеВидыМетаданных(ПоддерживаемыеВидыМетаданных) Экспорт
	
КонецПроцедуры

// Переопределение получения автора оповещений пользователей.
// 
// Параметры:
//  Автор - Неопределено, СправочникСсылка.Пользователи - Автор оповещений пользователей
Процедура ПриПолученииАвторОповещенийПользователей(Автор) Экспорт
	
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы
//++ Локализация

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОповещенияПользователейОСобытияхПереопределяемый.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.27.8";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e99acf6e-79cb-4af2-ae19-386e979f3f17");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ОповещенияПользователейОСобытияхПереопределяемый.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	
	СписокОписаний = Новый Массив;
	СписокОписаний.Добавить(НСтр("ru = 'Обновление справочника ""Виды оповещений пользователей"":'"));
	СписокОписаний.Добавить(НСтр("ru = '- Включение видов оповещений сервиса Сверка 2.0, если это необходимо';"));
	
	Обработчик.Комментарий = СтрСоединить(СписокОписаний, Символы.ПС);
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Справочники.СервисСверкиРасчетовНастройкиОповещенийПользователей.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Справочники.ВидыОповещенийПользователей.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = Справочники.ВидыОповещенийПользователей.ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыОповещенийПользователей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыОповещенийПользователей КАК ВидыОповещенийПользователей
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СервисСверкиРасчетовНастройкиОповещенийПользователей КАК ОповещенияСервисаСверки
	|	ПО (ИСТИНА)
	|ГДЕ
	|	ВидыОповещенийПользователей.Родитель = &ГруппаСервисаСверки
	|	И НЕ ВидыОповещенийПользователей.Активен
	|	И ОповещенияСервисаСверки.Ссылка ЕСТЬ НЕ NULL
	|	И НЕ ОповещенияСервисаСверки.ПометкаУдаления
	|	И ОповещенияСервисаСверки.ОповещатьОРасхождениях
	|	И ОповещенияСервисаСверки.ЭтоГлобальнаяНастройка
	|	И &ИспользоватьСервисСверки
	|";
	ГруппаВидаОповещенийСервисСверка20 = ОповещенияПользователейОСобытиях.ГруппаВидаОповещений("СервисСверка20");
	Идентификатор = Новый УникальныйИдентификатор(ГруппаВидаОповещенийСервисСверка20.Идентификатор);
	ГруппаОповещенийСверки = Справочники.ВидыОповещенийПользователей.ПолучитьСсылку(Идентификатор);
	Запрос.УстановитьПараметр("ГруппаСервисаСверки", ГруппаОповещенийСверки);
	Запрос.УстановитьПараметр("ИспользоватьСервисСверки", ПолучитьФункциональнуюОпцию("ИспользуетсяСервисСверкиРасчетов"));
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

// Обработчик обновления
// 
// Параметры:
// 	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки 
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = Справочники.ВидыОповещенийПользователей.ПустаяСсылка().Метаданные().ПолноеИмя();
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		
		Параметры.ОбработкаЗавершена =
			ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
		
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	ИсключенияПриОбновлении = Новый Массив;
	
	СписокОписаний = Новый Массив;
	СписокОписаний.Добавить(НСтр("ru = 'Не удалось обработать справочник ""Виды оповещений пользователей"" по обработчику:'"));
	СписокОписаний.Добавить(НСтр("ru = '- Включение оповещений сервиса Сверка 2.0, если необходимо';"));
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДляОбновления.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ДанныеДляОбновления КАК ДанныеДляОбновления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВидыОповещенийПользователей.ВерсияДанных КАК ВерсияДанных
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыОповещенийПользователей КАК ВидыОповещенийПользователей
	|		ПО ВТ.Ссылка = ВидыОповещенийПользователей.Ссылка";
	
	Запрос.УстановитьПараметр("ДанныеДляОбновления", ОбновляемыеДанные);
	
	Справочник = Запрос.Выполнить().Выбрать();
	
	Пока Справочник.Следующий() Цикл
		
		ПричинаИсключения = "";
		Рекомендация = "";
		
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = "Блокировка";
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Справочник.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			СправочникОбъект = ОбновлениеИнформационнойБазыУТ.ПроверитьПолучитьОбъект(
				Справочник.Ссылка, Справочник.ВерсияДанных, Параметры.Очередь); // СправочникОбъект
			
			ПричинаИсключения = "ПлохиеДанные";
			Рекомендация = НСтр("ru = 'Проверьте данные справочника вручную.'");
			
			Если СправочникОбъект <> Неопределено Тогда
				
				СправочникОбъект.Активен = Истина;
				
			КонецЕсли;
			
			ПричинаИсключения = "Запись";
			
			Если СправочникОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Справочник.Ссылка);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Справочник.Ссылка);
			
			Если ПричинаИсключения = "ПлохиеДанные" Тогда
				
				ОписаниеПроблемы = ОбновлениеИнформационнойБазыУТ.ПроблемаСДанными(
					Справочник.Ссылка, Рекомендация, ИнформацияОбОшибке());
				ИсключенияПриОбновлении.Добавить(ОписаниеПроблемы);
				
			ИначеЕсли ПричинаИсключения = "Запись" Тогда
				
				ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(
					ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
				ВызватьИсключение СтрСоединить(СписокОписаний, Символы.ПС);
				
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано > 0 И ПроблемныхОбъектов > 0 Тогда
		ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(
			ИсключенияПриОбновлении, ОбъектовОбработано, Параметры);
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена =
		ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры
//-- Локализация

#КонецОбласти

#КонецОбласти