#Область Интерфейс

Функция ПолучитьСтруктуруОтвета() Экспорт
	
	Результат=Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("Данные");
	Результат.Вставить("КодОшибки");
	Результат.Вставить("ТекстОшибки");
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьОшибкуДляВозврата(Ответ,КодОшибки,ТекстОшибки) Экспорт
	
	Ответ.Результат=Ложь;
	Ответ.КодОшибки=КодОшибки;
	Ответ.ТекстОшибки=ТекстОшибки;
	
	Возврат Ответ;
	
КонецФункции

Функция ВернутьОстаткиТоваровНаСкладах(ПараметрыЗапроса) Экспорт
	
	Ответ=ПолучитьСтруктуруОтвета();
	
	Запрос=Новый Запрос;
	МассивСкладов=Новый Массив;
	Если ПараметрыЗапроса.Свойство("Склады") Тогда
		Запрос.УстановитьПараметр("ВсеСклады",Ложь);
		Для каждого стрСклад Из ПараметрыЗапроса.Склады Цикл
			Склад=Справочники.Склады.НайтиПоКоду(стрСклад);
			Если ЗначениеЗаполнено(Склад) Тогда
				МассивСкладов.Добавить(Склад);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Запрос.УстановитьПараметр("ВсеСклады",Истина);
	КонецЕсли;
	Запрос.УстановитьПараметр("Склады",МассивСкладов);
	Запрос.УстановитьПараметр("ДатаОстатков",ПрочитатьДатуJSON(ПараметрыЗапроса.Дата,ФорматДатыJSON.ISO));
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ТоварыНаСкладахОстатки.Склад.Наименование КАК Склад,
	             |	ТоварыНаСкладахОстатки.Номенклатура.Код КАК Номенклатура,
	             |	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество
	             |ИЗ
	             |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	             |			&ДатаОстатков,
	             |			Склад В (&Склады)
	             |				ИЛИ &ВсеСклады) КАК ТоварыНаСкладахОстатки
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ТоварыНаСкладахОстатки.Склад.Наименование,
	             |	ТоварыНаСкладахОстатки.Номенклатура.Код";
	
	Массив=Новый Массив;
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Данные=Новый Структура;
		Данные.Вставить("Склад",Выборка.Склад);
		Данные.Вставить("Номенклатура",Выборка.Номенклатура);
		Данные.Вставить("Количество",Выборка.Количество);
		Массив.Добавить(Данные);
		
	КонецЦикла;
	
	Ответ.Результат=Истина;
	Ответ.Данные=Массив;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти
