#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1 
	|	Справочник.Ссылка
	|ИЗ
	|	Справочник.ФормулыРасчетаДатыПлатежа КАК Справочник
	|ГДЕ
	|	Справочник.Наименование = &Наименование
	|	И Справочник.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru='Уже существует формула с наименованием %1.'"),Наименование),,,,Отказ);
	КонецЕсли;
	
	Если СтрНайти(Формула, "ДатаОтгрузки") > 0
		Или СтрНайти(Формула, "ДатаПоступления") > 0
		Или СтрНайти(Формула, "ДатаПереходаПраваСобственности") > 0 Тогда
		ЗависитОтДатыОтгрузки = Истина;
	Иначе
		ЗависитОтДатыОтгрузки = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли