///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем".
// ОбщийМодуль.НастройкиПлатежныхСистем.
// 
// Серверные процедуры работы с различными платежными системами:
//  - получение статуса операции;
//  - формирование QR-кода.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет загрузку статусов операций, по которым было отложено получение результата.
//
// Параметры:
//  Подсистемы - Строка - идентификаторы подсистем, которые должны быть обработаны, перечисленные
//    через запятую. Допустимые значения: "Все", "СБП", "ИнтернетЭквайринг", "ПлатежныеСистемы".
//    Если не заполнено, то обрабатываются все подсистемы.
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - данные обработанных документов по типам платежных систем:
//    * Ключ - Строка - платежная система, по которой была выполнена загрузка. Доступные значения: "СБП",
//        "ИнтернетЭквайринг", "ПлатежныеСистемы".
//    * Значение - Неопределено - указанная подсистема не используется в конфигурации, либо она не указана
//                 в параметре Подсистемы.
//               - Массив Из ОпределяемыйТип.ДокументОперацииСБП - данные обработанных
//                   документов, если Ключ = "СБП".
//               - Массив Из ОпределяемыйТип.ДокументОперацииИнтернетЭквайринга - данные обработанных
//                   документов, если Ключ = "ИнтернетЭквайринг".
//               - Массив из ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - данные обработанных
//                   документов, если Ключ = "ПлатежныеСистемы".
//               
Функция СтатусыОпераций(Знач Подсистемы = "") Экспорт
	
	// Проверка входных параметров
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"НастройкиПлатежныхСистем.СтатусыОпераций",
		"Подсистемы",
		Подсистемы,
		Тип("Строка"));
	
	ОбработанныеОперации = Новый Соответствие;
	ОбработанныеОперации.Вставить("СБП", Неопределено);
	ОбработанныеОперации.Вставить("ИнтернетЭквайринг", Неопределено);
	ОбработанныеОперации.Вставить("ПлатежныеСистемы", Неопределено);
	
	ВсеПодсистемы = Ложь;
	ВыбранныеПодсистемы = СтрРазделить(СокрЛП(Подсистемы), ", ", Ложь);
	Если ВыбранныеПодсистемы.Количество() = 0
		Или ВыбранныеПодсистемы.Найти("Все") <> Неопределено Тогда
		ВсеПодсистемы = Истина;
	КонецЕсли;
	
	Если (ВсеПодсистемы Или ВыбранныеПодсистемы.Найти("СБП") <> Неопределено)
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП") Тогда
		
		МодульСистемаБыстрыхПлатежейСлужебный = ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежейСлужебный");
		ОбработанныеОперации.Вставить(
			"СБП",
			МодульСистемаБыстрыхПлатежейСлужебный.СтатусыОпераций());
			
	КонецЕсли;
	
	Если (ВсеПодсистемы Или ВыбранныеПодсистемы.Найти("ПлатежныеСистемы") <> Неопределено)
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.БазоваяФункциональностьПлатежныхСистем") Тогда
		
		МодульПлатежныеСистемыСлужебный = ОбщегоНазначения.ОбщийМодуль("ПлатежныеСистемыСлужебный");
		
		ОбработанныеОперации.Вставить(
			"ПлатежныеСистемы",
			МодульПлатежныеСистемыСлужебный.СтатусыОпераций());
		
	КонецЕсли;
	
	Возврат ОбработанныеОперации;
	
КонецФункции

// Формирование изображения идентификатора оплаты (QR-кода).
//
// Параметры: 
//  ФункциональнаяСсылка - Строка - идентификатор оплаты.
//  Размер - Число - размер QR-кода в пикселях.
//  ПлатежнаяСистема - Строка - платежная система, логотип которой должен быть использован.
//    Допустимые значения: "СистемаБыстрыхПлатежей", "ЯндексПэй".
//    При указании любого другого значения QR-код будет выведен без логотипа.
//  ТипПечати - Число - вариант печати QR-кода. В зависимости от выбранного варианта
//    печати подбирается картинка с логотипом платежной системы.
//    Возможные варианты:
//      0 - цветной логотип.
//      1 - монохромный логотип (оттенки серого).
//      2 - черно-белый логотип.
//      3 - без логотипа.
//    Особенности вывода изображений для разных платежных систем:
//      для Яндекс Пэй используется одинаковая картинка для типа печати 1 и 2.
//
// Возвращаемое значение:
//  ДвоичныеДанные - данные изображения QR-кода.
//
Функция ИзображениеQRКода(ФункциональнаяСсылка, Размер, ПлатежнаяСистема, Знач ТипПечати = 0) Экспорт
	
	// Проверка входных параметров
	ИмяФункции = "НастройкиПлатежныхСистем.ИзображениеQRКода";
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ФункциональнаяСсылка",
		ФункциональнаяСсылка,
		Тип("Строка"));
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"Размер",
		Размер,
		Тип("Число"));
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ПлатежнаяСистема",
		ПлатежнаяСистема,
		Тип("Строка"));
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ТипПечати",
		ТипПечати,
		Тип("Число"));
	
	ИменаКартинок = Новый Структура("Цветной, Монохромный, Черный");
	
	Преобразовать = Ложь;
	
	Если ПлатежнаяСистема = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыСБП() Тогда
		ИменаКартинок.Цветной = "ЛоготипСБПЦветной";
		ИменаКартинок.Монохромный = "ЛоготипСБПМонохромный";
		ИменаКартинок.Черный = "ЛоготипСБПЧерный";
	ИначеЕсли ПлатежнаяСистема = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыЯндексПэй() Тогда
		ИменаКартинок.Цветной = "ЛоготипЯндексПэй";
		ИменаКартинок.Монохромный = "ЛоготипЯндексПэйМонохромный";
		ИменаКартинок.Черный = "ЛоготипЯндексПэйМонохромный";
		Преобразовать = Истина;
	Иначе
		ТипПечати = 3;
	КонецЕсли;
	
	Логотип = Неопределено;
	Если ТипПечати = 0 Тогда
		Логотип = БиблиотекаКартинок[ИменаКартинок.Цветной];
	ИначеЕсли ТипПечати = 1 Тогда
		Логотип = БиблиотекаКартинок[ИменаКартинок.Монохромный];
	ИначеЕсли ТипПечати = 2 Тогда
		Логотип = БиблиотекаКартинок[ИменаКартинок.Черный];
	КонецЕсли;
	
	// Метод ГенерацияШтрихкода.ИзображениеШтрихкода принимает только PNG,
	// поэтому преобразовываем, если другой формат
	Если Преобразовать И Логотип <> Неопределено Тогда
		Логотип = Логотип.Преобразовать(ФорматКартинки.PNG);
	КонецЕсли;
	
	ПараметрыГенерации = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыГенерации.Ширина = Размер;
	ПараметрыГенерации.Высота = Размер;
	ПараметрыГенерации.ТипКода = 16;
	ПараметрыГенерации.Штрихкод = ФункциональнаяСсылка;
	ПараметрыГенерации.УровеньКоррекцииQR = 3;
	
	ПараметрыГенерации.ЛоготипКартинка = ?(Логотип = Неопределено,
		"",
		Base64Строка(Логотип.ПолучитьДвоичныеДанные()));
	ПараметрыГенерации.ЛоготипРазмерПроцентОтШК = ?(Логотип = Неопределено,
		0,
		33);
	
	Результат = ГенерацияШтрихкода.ИзображениеШтрихкода(
		ПараметрыГенерации);
	
	Возврат Результат.ДвоичныеДанные;
	
КонецФункции

#КонецОбласти