#Область ПрограммныйИнтерфейс

&ИзменениеИКонтроль("ШтрихкодыВалидны")
Функция АУ_ШтрихкодыВалидны(Штрихкоды, ВыводитьОповещение)

	ШтрихкодыВалидны = Истина;
	
	Если ТипЗнч(Штрихкоды) = Тип("Массив") Тогда
		МассивШтрихкодов = Штрихкоды;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(Штрихкоды);
	КонецЕсли;
	
	Для Каждого ТекШтрихкод Из МассивШтрихкодов Цикл
		
		#Вставка
		ТекШтрихкод.Штрихкод=СтрЗаменить(ТекШтрихкод.Штрихкод, Символ(29),"");
		#КонецВставки
		
		#Если ВебКлиент Тогда
			Если СтрНайти(ТекШтрихкод.Штрихкод, Символ(29)) <> 0 Тогда
				ШтрихкодыВалидны = Ложь;
				Прервать;
			КонецЕсли;
		#Иначе
			Если ОбработкаСтрокиXML.НайтиНедопустимыеСимволыXML(ТекШтрихкод.Штрихкод) <> 0 Тогда
				ШтрихкодыВалидны = Ложь;
				Прервать;
			КонецЕсли;
		#КонецЕсли
	КонецЦикла;
	
	Если Не ШтрихкодыВалидны Тогда
		ТекстОповещения = НСтр("ru = 'Коды маркируемой продукции необходимо считывать в форме проверки и подбора.'");
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Ошибка чтения штрихкода'"),
			,
			ТекстОповещения,
			БиблиотекаКартинок.Предупреждение32);
	КонецЕсли;
	
	#Вставка
	Возврат Истина;
	#КонецВставки
	
	Возврат ШтрихкодыВалидны;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
