Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = "ЭТрН №" + КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УдалитьЛидирующиеНули(Данные.Ссылка.НомерТрН) + " от " + Формат(Данные.Ссылка.ДатаТрН,"ДФ=dd.MM.yy");

КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("НомерТрН");
	МассивОбязательных.Добавить("ДатаТрН");
	МассивОбязательных.Добавить("Грузоотправитель");
	МассивОбязательных.Добавить("Перевозчик");
	МассивОбязательных.Добавить("Грузополучатель");
	МассивОбязательных.Добавить("ЭтоЭкспедиция");
	МассивОбязательных.Добавить("МестоПогрузки");
	МассивОбязательных.Добавить("МестоДоставки");
	МассивОбязательных.Добавить("ТранспортноеСредство");
	МассивОбязательных.Добавить("ДатаЗак");
	МассивОбязательных.Добавить("УИД");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовПрототипа() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("НомерТрН");
	МассивОбязательных.Добавить("ДатаТрН");
	МассивОбязательных.Добавить("Грузоотправитель");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ПогрузкуОсуществляет");
	МассивОбязательных.Добавить("ПогрузкаДоговор");
	МассивОбязательных.Добавить("ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку");
	МассивОбязательных.Добавить("ПогрузкаСотрудник");
	МассивОбязательных.Добавить("Прицеп");
	МассивОбязательных.Добавить("Прицеп2");
	МассивОбязательных.Добавить("ЭкспедицияЗаказчик");
	МассивОбязательных.Добавить("ЭкспедицияДоговор");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	// в этом документе пока нет
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("kl_id");
	МассивКлючевых.Добавить("УИД");
	МассивКлючевых.Добавить("ВозвратМесто");
	МассивКлючевых.Добавить("ПереадресовкаИсходноеМестоДоставки");
	МассивКлючевых.Добавить("ВозвратПолучатель");
	МассивКлючевых.Добавить("ПереадресовкаИсходныйПолучатель");
	МассивКлючевых.Добавить("КоличествоПереадресовок");
	МассивКлючевых.Добавить("КоличествоСменВодителей");
	МассивКлючевых.Добавить("КоличествоСменТС");
	МассивКлючевых.Добавить("КомментарииВодителяПриПогрузке");
	МассивКлючевых.Добавить("КомментарииВодителяПриВыгрузке");
	МассивКлючевых.Добавить("ЗаказЗаявкаОснование");
	МассивКлючевых.Добавить("ПартнерПеревозчик");
	МассивКлючевых.Добавить("ПартнерГрузополучатель");
	МассивКлючевых.Добавить("ПартнерГрузоотправитель");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

Функция ПогрузкуОсуществляетДругаяОрганизация(ДокЭТрНСсылка) Экспорт

	Если (ЗначениеЗаполнено(ДокЭТрНСсылка.ПогрузкуОсуществляет) 
		Или ЗначениеЗаполнено(ДокЭТрНСсылка.ПогрузкаДоговор)
		Или ДокЭТрНСсылка.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку)
		И ЗначениеЗаполнено(ДокЭТрНСсылка.Грузоотправитель)
		И ДокЭТрНСсылка.ПогрузкуОсуществляет <> ДокЭТрНСсылка.Грузоотправитель Тогда
		
		ПогрузкуОсуществляетДругаяОрганизация = Истина;
		
	Иначе
		
		ПогрузкуОсуществляетДругаяОрганизация = Ложь;
		
	КонецЕсли;
	
	Возврат ПогрузкуОсуществляетДругаяОрганизация;

КонецФункции

// Допроверяет то что не проверено вызовом МассивОбязательныхРеквизитов
Процедура ПроверитьКлючевыеРеквизитыЭтРН(ДокЭТрНСсылка, ТаблицаОшибок, ВместоОшибокПредупреждения = Ложь, ПолнаяПроверка = Истина) Экспорт
	
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	Если ВместоОшибокПредупреждения Тогда 
		КатегорияОшибка = КатегорияПредупреждение;
	Иначе
		КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КонецЕсли;
	КатегорияОшибкаБезусловная = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
		
	Если ДокЭТрНСсылка.Перевозчик.ИНН = ДокЭТрНСсылка.Грузополучатель.ИНН Тогда
		
		ТекстОшибки = "Грузополучатель и перевозчик совпадают.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.ДокументЭТРН", КатегорияПредупреждение, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	// ИНН
	Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.Грузоотправитель.ИНН) Тогда 
		
		ТекстОшибки = "Укажите в Грузоотправителе ИНН (в Документе электронной транспортной накладной)";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Грузоотправитель.ИНН", КатегорияОшибкаБезусловная, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.Перевозчик.ИНН) Тогда 
		
		ТекстОшибки = "Укажите в Перевозчике ИНН (в Документе электронной транспортной накладной)";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Перевозчик.ИНН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.Грузополучатель.ИНН) Тогда 
		
		ТекстОшибки = "Укажите в Грузополучателе ИНН (в Документе электронной транспортной накладной)";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Грузополучатель.ИНН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	// НаименованиеОрганизацииПолное
	Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.Грузоотправитель.НаименованиеОрганизацииПолное) Тогда 
		
		ТекстОшибки = "Укажите в Грузоотправителе Полное наименование (в Документе электронной транспортной накладной)";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Грузоотправитель.НаименованиеОрганизацииПолное", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.Перевозчик.НаименованиеОрганизацииПолное) Тогда 
		
		ТекстОшибки = "Укажите в Перевозчике Полное наименование (в Документе электронной транспортной накладной)";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Перевозчик.НаименованиеОрганизацииПолное", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.Грузополучатель.НаименованиеОрганизацииПолное) Тогда 
		
		ТекстОшибки = "Укажите в Грузополучателе Полное наименование (в Документе электронной транспортной накладной)";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Грузополучатель.НаименованиеОрганизацииПолное", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	// ИдентификаторУчастникаЭДО
	Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.Грузоотправитель.ИдентификаторУчастникаЭДО) Тогда 
		
		ТекстОшибки = "Укажите в Грузоотправителе Идентификатор участника ЭДО (в Документе электронной транспортной накладной)";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Грузоотправитель.ИдентификаторУчастникаЭДО", КатегорияОшибкаБезусловная, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.Перевозчик.ИдентификаторУчастникаЭДО) Тогда 
		
		ТекстОшибки = "Укажите в Перевозчике Идентификатор участника ЭДО (в Документе электронной транспортной накладной)";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Перевозчик.ИдентификаторУчастникаЭДО", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.Грузополучатель.ИдентификаторУчастникаЭДО) Тогда 
		
		ТекстОшибки = "Укажите в Грузополучателе Идентификатор участника ЭДО (в Документе электронной транспортной накладной)";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Грузополучатель.ИдентификаторУчастникаЭДО", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	// Для титулов 2 и 3 дальнейшие прверки не важны
	Если Не ПолнаяПроверка Тогда
		Возврат;
	КонецЕсли;
	
	// Телефоны
	Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефонЗаполнен(ДокЭТрНСсылка.Грузоотправитель) Тогда 
		
		ТекстОшибки = "Укажите Телефон Грузоотправителя";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Грузоотправитель.Телефон", КатегорияОшибка, ТекстОшибки, "Указать");
			
	КонецЕсли;
	
	Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефонЗаполнен(ДокЭТрНСсылка.Перевозчик) Тогда 
		
		ТекстОшибки = "Укажите Телефон Перевозчика";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Перевозчик.Телефон", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефонЗаполнен(ДокЭТрНСсылка.Грузополучатель) Тогда 
		
		ТекстОшибки = "Укажите Телефон Грузополучателя";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Грузополучатель.Телефон", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	// Экспедитор
	Если ДокЭТрНСсылка.ЭтоЭкспедиция Тогда 
		
		Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.ЭкспедицияЗаказчик.ИНН) Тогда 
			
			ТекстОшибки = "Укажите в Заказчике перевозки ИНН (в Документе электронной транспортной накладной)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент.ЭкспедицияЗаказчик.ИНН", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.ЭкспедицияЗаказчик.НаименованиеОрганизацииПолное) Тогда 
			
			ТекстОшибки = "Укажите в Заказчике перевозки Полное наименование (в Документе электронной транспортной накладной)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент.ЭкспедицияЗаказчик.НаименованиеОрганизацииПолное", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефонЗаполнен(ДокЭТрНСсылка.ЭкспедицияЗаказчик) Тогда 
			
			ТекстОшибки = "Укажите Телефон Заказчика перевозки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент.ЭкспедицияЗаказчик.Телефон", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.ЭкспедицияДоговор) Тогда
			
			ТекстОшибки = "Укажите договор с заказчиком перевозки (экспедиторский договор)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент.ЭкспедицияДоговор", КатегорияОшибка, ТекстОшибки, "Указать");
			
		Иначе
			
			Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.ЭкспедицияДоговор.Организация) 
				И Не ЗначениеЗаполнено(ДокЭТрНСсылка.ЭкспедицияДоговор.ОрганизацияИНН) Тогда
				
				ТекстОшибки = "Укажите организацию или ИНН, к которой относится договор с заказчиком перевозки (экспедиторский договор)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ГлавныйДокумент.ЭкспедицияДоговор.ОрганизацияИНН", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.ЭкспедицияДоговор.Контрагент) 
				И Не ЗначениеЗаполнено(ДокЭТрНСсылка.ЭкспедицияДоговор.КонтрагентИНН) Тогда
				
				ТекстОшибки = "Укажите контрагента или ИНН, с которым у организации заключен договор с заказчиком перевозки (экспедиторский договор)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ГлавныйДокумент.ЭкспедицияДоговор.КонтрагентИНН", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
			КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьДоговор(ДокЭТрНСсылка.ЭкспедицияДоговор, ТаблицаОшибок, КатегорияОшибка, "ГлавныйДокумент.ПогрузкаДоговор.ДатаДокумента");
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Откуда и куда везем
	МестоПогрузки = ДокЭТрНСсылка.МестоПогрузки;
	ПроверитьЗаполнениеАдреса(ТаблицаОшибок, КатегорияОшибка, МестоПогрузки);
	
	Если ЗначениеЗаполнено(МестоПогрузки) И Не ЗначениеЗаполнено(МестоПогрузки.Собственник) И Не ЗначениеЗаполнено(СокрЛП(МестоПогрузки.СобственникНеУказанПричина)) Тогда
		
		ТекстОшибки = "Укажите Собственника Места погрузки (в Документе электронной транспортной накладной) или причину почему информации о собственнике нет";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.МестоПогрузки.Собственник", КатегорияОшибка, ТекстОшибки, "Указать");
		
	ИначеЕсли ЗначениеЗаполнено(МестоПогрузки) И ЗначениеЗаполнено(МестоПогрузки.Собственник) Тогда 
		
		Если Не ЗначениеЗаполнено(МестоПогрузки.Собственник.ИНН) Тогда
			
			ТекстОшибки = "Укажите в Собственнике Места погрузки ИНН (в Документе электронной транспортной накладной)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент.МестоПогрузки.Собственник.ИНН", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(МестоПогрузки.Собственник.НаименованиеОрганизацииПолное) Тогда
			
			ТекстОшибки = "Укажите в Собственнике Места погрузки Полное наименование организации (в Документе электронной транспортной накладной)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент.МестоПогрузки.Собственник.НаименованиеОрганизацииПолное", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефонЗаполнен(МестоПогрузки.Собственник) Тогда
			
			ТекстОшибки = "Укажите телефон в Собственнике Места погрузки (в Документе электронной транспортной накладной)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент.МестоПогрузки.Собственник.ТелефонОсновной", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
	КонецЕсли;
	
	МестоДоставки = ДокЭТрНСсылка.МестоДоставки;
	ПроверитьЗаполнениеАдреса(ТаблицаОшибок, КатегорияОшибка, МестоДоставки, "МестоДоставки");
	
	Если Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПогрузкуОсуществляетДругаяОрганизация(ДокЭТрНСсылка) Тогда
		
		Если ЗначениеЗаполнено(ДокЭТрНСсылка.ПогрузкуОсуществляет) Тогда
		
			Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.ПогрузкуОсуществляет.ИНН) Тогда
				
				ТекстОшибки = "Укажите в Организации осуществляющей погрузку ИНН (в Документе электронной транспортной накладной)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ГлавныйДокумент.ПогрузкуОсуществляет.ИНН", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.ПогрузкуОсуществляет.НаименованиеОрганизацииПолное) Тогда
				
				ТекстОшибки = "Укажите в Организации осуществляющей погрузку Полное наименование организации (в Документе электронной транспортной накладной)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ГлавныйДокумент.ПогрузкуОсуществляет.НаименованиеОрганизацииПолное", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
			Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефонЗаполнен(ДокЭТрНСсылка.ПогрузкуОсуществляет) Тогда
				
				ТекстОшибки = "Укажите Телефон в Организации осуществляющей погрузку(в Документе электронной транспортной накладной)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ГлавныйДокумент.ПогрузкуОсуществляет.Телефон", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		
		КонецЕсли;
			
		Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.ПогрузкаДоговор) Тогда
		
			ТекстОшибки = "Укажите договор-основание полномочий составителя файла обмена";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент.ПогрузкаДоговор", КатегорияОшибка, ТекстОшибки, "Указать");
			
		Иначе 
			
			Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.ПогрузкаДоговор.Организация) И Не ЗначениеЗаполнено(ДокЭТрНСсылка.ПогрузкаДоговор.ОрганизацияИНН) Тогда
				
				ТекстОшибки = "Укажите организацию или ИНН, к которой относится договор-погрузки";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ГлавныйДокумент.ПогрузкаДоговор.ОрганизацияИНН", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(ДокЭТрНСсылка.ПогрузкаДоговор.Контрагент) И Не ЗначениеЗаполнено(ДокЭТрНСсылка.ПогрузкаДоговор.КонтрагентИНН) Тогда
				
				ТекстОшибки = "Укажите контрагента или ИНН, с которым у организации заключен договор погрузки";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ГлавныйДокумент.ПогрузкаДоговор.КонтрагентИНН", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
			КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьДоговор(ДокЭТрНСсылка.ПогрузкаДоговор, ТаблицаОшибок, КатегорияОшибка, "ГлавныйДокумент.ПогрузкаДоговор.ДатаДокумента");
			
		КонецЕсли;		
		
	КонецЕсли;
	
	// Проверяем заполнены ли поля Лизингодатель/Договор для отдельных видов владения
	РезультатПроверкиПолейТС = РезультатПроверкиПолейТС(ДокЭтрнСсылка);
	Если РезультатПроверкиПолейТС.ЕстьОшибки Тогда
		
		Для Каждого ОшибкаПоля Из РезультатПроверкиПолейТС.ОшибкиПолей Цикл
			
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, 
				"", 
				"", 
				"ГлавныйДокумент." + ОшибкаПоля.ИмяПоля, 
				КатегорияОшибка, 
				ОшибкаПоля.ТекстОшибки, 
				"Указать");
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПоследнийПоДатеТитулЭТРН(ДокЭТрНСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ТрН_Титул1.Дата КАК Дата
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул2.Ссылка,
	|	КонтурЛогистика_ТрН_Титул2.Дата
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2 КАК КонтурЛогистика_ТрН_Титул2
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул2.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул3.Ссылка,
	|	КонтурЛогистика_ТрН_Титул3.Дата
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул3 КАК КонтурЛогистика_ТрН_Титул3
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул3.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул4.Ссылка,
	|	КонтурЛогистика_ТрН_Титул4.Дата
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул4 КАК КонтурЛогистика_ТрН_Титул4
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул4.ДокументЭТРН = &ДокументЭТРН
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументЭТРН", ДокЭТрНСсылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
	
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСледующийПоЦепочкеТипТитулаЭТРН(ДокЭтрнСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ДокЭтрнСсылка) Тогда 
		ВызватьИсключение "Не заполнен Этрн - не могу определить титул";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2) КАК ТипТитула
	|ПОМЕСТИТЬ ВТ_ВсеТитулыЭТРН
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН = &ДокументЭТРН
	|	И НЕ КонтурЛогистика_ТрН_Титул1.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3)
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2 КАК КонтурЛогистика_ТрН_Титул2
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул2.ДокументЭТРН = &ДокументЭТРН
	|	И НЕ КонтурЛогистика_ТрН_Титул2.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4)
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул3 КАК КонтурЛогистика_ТрН_Титул3
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул3.ДокументЭТРН = &ДокументЭТРН
	|	И НЕ КонтурЛогистика_ТрН_Титул3.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеТитулыЭТРН.ТипТитула КАК ТипТитула
	|ИЗ
	|	ВТ_ВсеТитулыЭТРН КАК ВТ_ВсеТитулыЭТРН
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ВсеТитулыЭТРН.ТипТитула.Порядок УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументЭТРН", ДокЭтрнСсылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ТипТитула;
	Иначе
		Возврат Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеДляПечатиТрН(МассивДокументовЭТрН) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка КАК Ссылка,
	|	ТранспортныеСредства.Ссылка КАК ТранспортноеСредство
	|ПОМЕСТИТЬ ВТ_ЭТрН
	|ИЗ
	|	Документ.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная КАК КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ТранспортныеСредства КАК ТранспортныеСредства
	|		ПО КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ТранспортноеСредство = ТранспортныеСредства.Ссылка
	|			И (НЕ КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПометкаУдаления)
	|ГДЕ
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка В(&МассивДокументовЭТрН)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭТрН.Ссылка.kl_id КАК kl_id,
	|	ВТ_ЭТрН.Ссылка КАК ДокументЭТРН,
	|	ВТ_ЭТрН.Ссылка.НомерТрН КАК НомерТрН,
	|	ВТ_ЭТрН.Ссылка.ДатаТрН КАК ДатаТрН,
	|	ВЫБОР
	|		КОГДА ВТ_ЭТрН.Ссылка.НомЗак = """"
	|			ТОГДА ""Без номера""
	|		ИНАЧЕ ВТ_ЭТрН.Ссылка.НомЗак
	|	КОНЕЦ КАК НомЗак,
	|	ВТ_ЭТрН.Ссылка.ДатаЗак КАК ДатаЗак,
	|	ВЫБОР
	|		КОГДА ВТ_ЭТрН.Ссылка.ЭтоЭкспедиция
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК ГОЭксп,
	|	ВТ_ЭТрН.Ссылка.Грузоотправитель КАК Грузоотправитель,
	|	ВТ_ЭТрН.Ссылка.Грузополучатель КАК Грузополучатель,
	|	ВТ_ЭТрН.Ссылка.Перевозчик КАК Перевозчик,
	|	ВТ_ЭТрН.Ссылка.МестоДоставки.АдресИнфАдрес КАК АдресДостГр,
	|	ВТ_ЭТрН.Ссылка.МестоДоставки.АдресИнфКодСтраны.Наименование КАК АдресДостГрСтрана,
	|	ВТ_ЭТрН.Ссылка.СрокДоставки КАК СрокДостГр,
	|	ВТ_ЭТрН.Ссылка.ДатаВремяДоставки КАК ДатВрДостГр,
	|	ВЫРАЗИТЬ(ВТ_ЭТрН.Ссылка.МаршрутТекст КАК СТРОКА(1000)) КАК МршПрвз,
	|	ВТ_ЭТрН.ТранспортноеСредство.ТипТС КАК ТипТС,
	|	ВТ_ЭТрН.ТранспортноеСредство.МаркаТС КАК МаркаТС,
	|	ВТ_ЭТрН.ТранспортноеСредство.ГрузоподъемностьТонн КАК ГрузоподъемностьТонн,
	|	ВТ_ЭТрН.ТранспортноеСредство.ВместимостьКубМ КАК ВместимостьКубМ,
	|	ВТ_ЭТрН.ТранспортноеСредство.РегНомер КАК РегНомер,
	|	ВТ_ЭТрН.ТранспортноеСредство.ВидВладения КАК ТипВлад,
	|	ВТ_ЭТрН.ТранспортноеСредство.ДоговорАрендаЛизинг КАК ДоговорАрендаЛизинг,
	|	ВТ_ЭТрН.Ссылка.ПогрузкуОсуществляет КАК СвЛицПогрГр,
	|	ВТ_ЭТрН.Ссылка.МестоПогрузки.Собственник КАК ВладИнфр,
	|	ВТ_ЭТрН.Ссылка.МестоПогрузки.АдресИнфАдрес КАК ФАдресПогр,
	|	ВТ_ЭТрН.Ссылка.МестоПогрузки.АдресИнфКодСтраны.Наименование КАК ФАдресПогрСтрана,
	|	ВТ_ЭТрН.Ссылка.ПогрузкаСотрудник КАК РабЛицПогрГр,
	|	ВТ_ЭТрН.Ссылка.ПогрузкаДоговор КАК ДогЛицПогрГр,
	|	ВТ_ЭТрН.Ссылка.ЭкспедицияЗаказчик КАК ЭкспедицияЗаказчик,
	|	ВТ_ЭТрН.Ссылка.ЭкспедицияДоговор КАК ЭкспедицияДоговор,
	|	ВТ_ЭТрН.Ссылка.Прицеп КАК Прицеп,
	|	ВТ_ЭТрН.Ссылка.Прицеп2 КАК Прицеп2,
	|	1 КАК НалКоорТочВрДост,
	|	""Электронное уведомление перевозчика о переадресовке"" КАК СпосПерУкПА,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Титул1.УказанияВОтношенииНормПеревозки КАК СТРОКА(1000))) = """"
	|			ТОГДА ""Отсутствуют""
	|		ИНАЧЕ ВЫРАЗИТЬ(Титул1.УказанияВОтношенииНормПеревозки КАК СТРОКА(1000))
	|	КОНЕЦ КАК УкНормПрвз,
	|	ЕСТЬNULL(Титул1.ПерегрузкаЗапрещена, ЛОЖЬ) КАК ЗапрПерегруз,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Титул1.СведенияОПломбах КАК СТРОКА(1000)), """") КАК СвПломба,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Титул1.ОграничениеСкорости КАК СТРОКА(1000)), """") КАК ОгрСкор,
	|	ЕСТЬNULL(Титул1.ИнициаторПереадресации, """") КАК ЛицоПА,
	|	ЕСТЬNULL(Титул1.ТемператураНеНиже, """") КАК ТемпНеНиже,
	|	ЕСТЬNULL(Титул1.ТемператураНеВыше, """") КАК ТемпНеВыше,
	|	ЕСТЬNULL(Титул1.ВлажностьНеНиже, """") КАК ВлажнНеНиже,
	|	ЕСТЬNULL(Титул1.ВлажностьНеВыше, """") КАК ВлажнНеВыше,
	|	ЕСТЬNULL(Титул1.ДатаВремяПодачиПлановая, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ЗаявПогр,
	|	ЕСТЬNULL(Титул1.ДатаВремяПрибытия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ФДатВрПриб,
	|	ЕСТЬNULL(Титул1.ДатаВремяУбытия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ФДатВрУбыт,
	|	ЕСТЬNULL(Титул1.МетодОпределенияМассы, """") КАК МетОпрМасс,
	|	ЕСТЬNULL(Титул1.МассаБруттоКг, """") КАК МасБрутОтгр,
	|	ЕСТЬNULL(Титул1.КоличествоМест, 0) КАК КолМестПрием,
	|	ЕСТЬNULL(Титул1.Водитель, """") КАК Водитель,
	|	ЕСТЬNULL(Титул1.ПутевойЛистНомер, """") КАК ПутевойЛистНомер,
	|	ЕСТЬNULL(Титул1.ПутевойЛистДата, """") КАК ПутевойЛистДата,
	|	ЕСТЬNULL(Титул2.ЗамДатВрПриб, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ЗамДатВрПриб,
	|	ЕСТЬNULL(Титул2.ЗамДатВрУбыт, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ЗамДатВрУбыт,
	|	ЕСТЬNULL(Титул2.ЗамДатВрПосПрием, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ЗамДатВрПосПрием,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Титул2.ЗамСостГруз КАК СТРОКА(1000)), """") КАК ЗамСостГруз,
	|	ЕСТЬNULL(Титул2.ЗамМасс, """") КАК ЗамМасс,
	|	ЕСТЬNULL(Титул2.ЗамКолМест, """") КАК ЗамКолМест,
	|	ЕСТЬNULL(Титул2.ЗамПогрРаб, """") КАК ЗамПогрРаб,
	|	Титул1.ДокументОснование КАК ДокументОснование,
	|	ЕСТЬNULL(Титул3.МестоВыгрузки.АдресИнфАдрес, """") КАК АдрВыгрузТ3,
	|	ЕСТЬNULL(Титул3.МестоВыгрузки.АдресИнфКодСтраны.Наименование, """") КАК АдрВыгрузТ3Страна,
	|	ЕСТЬNULL(Титул3.ЗаявДатВрПриб, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ЗаявДатВрПрибТ3,
	|	ЕСТЬNULL(Титул3.ФДатВрПриб, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ФДатВрПрибТ3,
	|	ЕСТЬNULL(Титул3.ФДатВрУбыт, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ФДатВрУбытТ3,
	|	ЕСТЬNULL(Титул3.КоличествоМестПринято, 0) КАК КолМестПриемЧТ3,
	|	ЕСТЬNULL(Титул3.МассаБруттоКг, 0) КАК МассыВыгрТ3,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Титул3.ОбщееСостояние КАК СТРОКА(1000)), """") КАК ОбщСвСостТ3,
	|	МАКСИМУМ(Титул4.Ссылка) КАК Титул4,
	|	МАКСИМУМ(Титул1.Ссылка) КАК Титул1,
	|	МАКСИМУМ(Титул2.Ссылка) КАК Титул2,
	|	МАКСИМУМ(Титул3.Ссылка) КАК Титул3
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1 КАК Титул1
	|		ПО ВТ_ЭТрН.Ссылка = Титул1.ДокументЭТРН
	|			И (НЕ Титул1.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул2 КАК Титул2
	|		ПО ВТ_ЭТрН.Ссылка = Титул2.ДокументЭТРН
	|			И (НЕ Титул2.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул3 КАК Титул3
	|		ПО ВТ_ЭТрН.Ссылка = Титул3.ДокументЭТРН
	|			И (НЕ Титул3.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул4 КАК Титул4
	|		ПО ВТ_ЭТрН.Ссылка = Титул4.ДокументЭТРН
	|			И (НЕ НЕ Титул4.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЭТрН.Ссылка.kl_id,
	|	ВТ_ЭТрН.Ссылка.НомерТрН,
	|	ВТ_ЭТрН.Ссылка,
	|	ВТ_ЭТрН.Ссылка.ДатаТрН,
	|	ВТ_ЭТрН.Ссылка.ДатаЗак,
	|	ВТ_ЭТрН.Ссылка.Грузоотправитель,
	|	ВТ_ЭТрН.Ссылка.Грузополучатель,
	|	ВТ_ЭТрН.Ссылка.Перевозчик,
	|	ВТ_ЭТрН.Ссылка.МестоДоставки.АдресИнфАдрес,
	|	ВТ_ЭТрН.Ссылка.МестоДоставки.АдресИнфКодСтраны.Наименование,
	|	ВТ_ЭТрН.Ссылка.СрокДоставки,
	|	ВТ_ЭТрН.Ссылка.ДатаВремяДоставки,
	|	ВТ_ЭТрН.ТранспортноеСредство.ТипТС,
	|	ВТ_ЭТрН.ТранспортноеСредство.МаркаТС,
	|	ВТ_ЭТрН.ТранспортноеСредство.ГрузоподъемностьТонн,
	|	ВТ_ЭТрН.ТранспортноеСредство.ВместимостьКубМ,
	|	ВТ_ЭТрН.ТранспортноеСредство.РегНомер,
	|	ВТ_ЭТрН.ТранспортноеСредство.ВидВладения,
	|	ВТ_ЭТрН.ТранспортноеСредство.ДоговорАрендаЛизинг,
	|	ВТ_ЭТрН.Ссылка.ПогрузкуОсуществляет,
	|	ВТ_ЭТрН.Ссылка.МестоПогрузки.Собственник,
	|	ВТ_ЭТрН.Ссылка.МестоПогрузки.АдресИнфАдрес,
	|	ВТ_ЭТрН.Ссылка.МестоПогрузки.АдресИнфКодСтраны.Наименование,
	|	ВТ_ЭТрН.Ссылка.ПогрузкаСотрудник,
	|	Титул1.ДокументОснование,
	|	ВТ_ЭТрН.Ссылка.ЭкспедицияЗаказчик,
	|	ВТ_ЭТрН.Ссылка.ЭкспедицияДоговор,
	|	ВЫБОР
	|		КОГДА ВТ_ЭТрН.Ссылка.НомЗак = """"
	|			ТОГДА ""Без номера""
	|		ИНАЧЕ ВТ_ЭТрН.Ссылка.НомЗак
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ЭТрН.Ссылка.ЭтоЭкспедиция
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(Титул1.УказанияВОтношенииНормПеревозки КАК СТРОКА(1000))) = """"
	|			ТОГДА ""Отсутствуют""
	|		ИНАЧЕ ВЫРАЗИТЬ(Титул1.УказанияВОтношенииНормПеревозки КАК СТРОКА(1000))
	|	КОНЕЦ,
	|	ЕСТЬNULL(Титул1.ПерегрузкаЗапрещена, ЛОЖЬ),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Титул1.СведенияОПломбах КАК СТРОКА(1000)), """"),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Титул1.ОграничениеСкорости КАК СТРОКА(1000)), """"),
	|	ЕСТЬNULL(Титул1.ИнициаторПереадресации, """"),
	|	ЕСТЬNULL(Титул1.ТемператураНеНиже, """"),
	|	ЕСТЬNULL(Титул1.ТемператураНеВыше, """"),
	|	ЕСТЬNULL(Титул1.ВлажностьНеНиже, """"),
	|	ЕСТЬNULL(Титул1.ВлажностьНеВыше, """"),
	|	ВЫРАЗИТЬ(ВТ_ЭТрН.Ссылка.МаршрутТекст КАК СТРОКА(1000)),
	|	ЕСТЬNULL(Титул1.ДатаВремяПодачиПлановая, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	|	ЕСТЬNULL(Титул1.ДатаВремяПрибытия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	|	ЕСТЬNULL(Титул1.ДатаВремяУбытия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	|	ЕСТЬNULL(Титул1.МетодОпределенияМассы, """"),
	|	ЕСТЬNULL(Титул1.МассаБруттоКг, """"),
	|	ЕСТЬNULL(Титул1.КоличествоМест, 0),
	|	ЕСТЬNULL(Титул1.Водитель, """"),
	|	ЕСТЬNULL(Титул1.ПутевойЛистНомер, """"),
	|	ЕСТЬNULL(Титул1.ПутевойЛистДата, """"),
	|	ЕСТЬNULL(Титул2.ЗамДатВрПриб, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	|	ЕСТЬNULL(Титул2.ЗамДатВрУбыт, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	|	ЕСТЬNULL(Титул2.ЗамДатВрПосПрием, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Титул2.ЗамСостГруз КАК СТРОКА(1000)), """"),
	|	ЕСТЬNULL(Титул2.ЗамМасс, """"),
	|	ЕСТЬNULL(Титул2.ЗамКолМест, """"),
	|	ЕСТЬNULL(Титул2.ЗамПогрРаб, """"),
	|	ВТ_ЭТрН.Ссылка.ПогрузкаДоговор,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Титул3.ОбщееСостояние КАК СТРОКА(1000)), """"),
	|	ЕСТЬNULL(Титул3.МестоВыгрузки.АдресИнфАдрес, """"),
	|	ЕСТЬNULL(Титул3.МестоВыгрузки.АдресИнфКодСтраны.Наименование, """"),
	|	ЕСТЬNULL(Титул3.ЗаявДатВрПриб, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	|	ЕСТЬNULL(Титул3.ФДатВрПриб, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	|	ЕСТЬNULL(Титул3.ФДатВрУбыт, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
	|	ЕСТЬNULL(Титул3.КоличествоМестПринято, 0),
	|	ЕСТЬNULL(Титул3.МассаБруттоКг, 0),
	|	ВТ_ЭТрН.Ссылка.Прицеп,
	|	ВТ_ЭТрН.Ссылка.Прицеп2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1Товары.Ссылка.ДокументЭТРН КАК ДокументЭТРН,
	|	КонтурЛогистика_ТрН_Титул1Товары.ОтгрузочноеНаименование КАК НаимГруз,
	|	КонтурЛогистика_ТрН_Титул1Товары.СостояниеГруза КАК СостГруз,
	|	КонтурЛогистика_ТрН_Титул1Товары.СпособУпаковки КАК СпУпак,
	|	КонтурЛогистика_ТрН_Титул1Товары.ВидТары КАК ВидТары,
	|	КонтурЛогистика_ТрН_Титул1Товары.КоличествоМест КАК КолМестГр,
	|	КонтурЛогистика_ТрН_Титул1Товары.ОбъемКубМ КАК Объем,
	|	КонтурЛогистика_ТрН_Титул1Товары.МассаПлановаяБруттоКг КАК МасБрутЗнач,
	|	КонтурЛогистика_ТрН_Титул1Товары.МассаПлановаяНеттоКг КАК МасНетЗнач,
	|	КонтурЛогистика_ТрН_Титул1Товары.КоличествоПаллет КАК КолПалл,
	|	КонтурЛогистика_ТрН_Титул1Товары.ОбъявленнаяЦенность КАК ЦеннГруз,
	|	КонтурЛогистика_ТрН_Титул1Товары.ОбъявленнаяЦенностьВалюта КАК НаимОКВ,
	|	&ЗаменаКодаВалюты КАК КодОКВ,
	|	КонтурЛогистика_ТрН_Титул1Товары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1.Товары КАК КонтурЛогистика_ТрН_Титул1Товары
	|		ПО ВТ_ЭТрН.Ссылка = КонтурЛогистика_ТрН_Титул1Товары.Ссылка.ДокументЭТРН
	|			И (КонтурЛогистика_ТрН_Титул1Товары.Учитывать)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1Маркировки.Ссылка.ДокументЭТРН КАК ДокументЭТРН,
	|	КонтурЛогистика_ТрН_Титул1Маркировки.ИдентификаторСтрокиТоваров КАК ИдентификаторСтрокиТоваров,
	|	КонтурЛогистика_ТрН_Титул1Маркировки.ЗначениеМаркировки КАК ЗначениеМаркировки
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1.Маркировки КАК КонтурЛогистика_ТрН_Титул1Маркировки
	|		ПО ВТ_ЭТрН.Ссылка = КонтурЛогистика_ТрН_Титул1Маркировки.Ссылка.ДокументЭТРН
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ТрН_Титул1Маркировки.Ссылка.ДокументЭТРН,
	|	КонтурЛогистика_ТрН_Титул1Маркировки.ИдентификаторСтрокиТоваров,
	|	КонтурЛогистика_ТрН_Титул1Маркировки.ЗначениеМаркировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1ТелефоныПереадресующего.Ссылка.ДокументЭТРН КАК ДокументЭТРН,
	|	КонтурЛогистика_ТрН_Титул1ТелефоныПереадресующего.Телефон КАК Телефон
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1.ТелефоныПереадресующего КАК КонтурЛогистика_ТрН_Титул1ТелефоныПереадресующего
	|		ПО ВТ_ЭТрН.Ссылка = КонтурЛогистика_ТрН_Титул1ТелефоныПереадресующего.Ссылка.ДокументЭТРН
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ТрН_Титул1ТелефоныПереадресующего.Ссылка.ДокументЭТРН,
	|	КонтурЛогистика_ТрН_Титул1ТелефоныПереадресующего.Телефон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.Ссылка.ДокументЭТРН КАК ДокументЭТРН,
	|	КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.ДатаИВремяОтметки КАК ДатаИВремяОтметки,
	|	ВЫРАЗИТЬ(КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.ОписаниеОбстоятельств КАК СТРОКА(1000)) КАК ОписаниеОбстоятельств,
	|	СУММА(ЕСТЬNULL(КонтурЛогистика_ТрН_Титул2Штрафы.ИтогРазмШтрРФ, 0)) КАК ИтогРазмШтрРФ,
	|	ЕСТЬNULL(КонтурЛогистика_ТрН_Титул2Штрафы.РасчШтр, """") КАК РасчШтр
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул2.ОтметкиПеревозчика КАК КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул2.Штрафы КАК КонтурЛогистика_ТрН_Титул2Штрафы
	|			ПО КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.Ссылка = КонтурЛогистика_ТрН_Титул2Штрафы.Ссылка
	|				И КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.ИдентификаторСтроки = КонтурЛогистика_ТрН_Титул2Штрафы.ИдентификаторСтрокиОтметки
	|		ПО ВТ_ЭТрН.Ссылка = КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.Ссылка.ДокументЭТРН
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.Ссылка.ДокументЭТРН,
	|	КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.ДатаИВремяОтметки,
	|	ВЫРАЗИТЬ(КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.ОписаниеОбстоятельств КАК СТРОКА(1000)),
	|	ЕСТЬNULL(КонтурЛогистика_ТрН_Титул2Штрафы.РасчШтр, """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1Товары.Ссылка.ДокументЭТРН КАК ДокументЭТРН,
	|	КонтурЛогистика_ТрН_Титул1Товары.ЗаказчикОрганизацияДиадок КАК Заказчик
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1.Товары КАК КонтурЛогистика_ТрН_Титул1Товары
	|		ПО ВТ_ЭТрН.Ссылка = КонтурЛогистика_ТрН_Титул1Товары.Ссылка.ДокументЭТРН
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ТрН_Титул1Товары.ЗаказчикОрганизацияДиадок,
	|	КонтурЛогистика_ТрН_Титул1Товары.Ссылка.ДокументЭТРН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1ДополнительныеВодители.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ТрН_Титул1ДополнительныеВодители.Водитель КАК Водитель,
	|	КонтурЛогистика_ТрН_Титул1ДополнительныеВодители.ПутевойЛистНомер КАК ПутевойЛистНомер,
	|	КонтурЛогистика_ТрН_Титул1ДополнительныеВодители.ПутевойЛистДата КАК ПутевойЛистДата
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1.ДополнительныеВодители КАК КонтурЛогистика_ТрН_Титул1ДополнительныеВодители
	|		ПО ВТ_ЭТрН.Ссылка = КонтурЛогистика_ТрН_Титул1ДополнительныеВодители.Ссылка.ДокументЭТРН
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ТрН_Титул1ДополнительныеВодители.Ссылка,
	|	КонтурЛогистика_ТрН_Титул1ДополнительныеВодители.Водитель,
	|	КонтурЛогистика_ТрН_Титул1ДополнительныеВодители.ПутевойЛистНомер,
	|	КонтурЛогистика_ТрН_Титул1ДополнительныеВодители.ПутевойЛистДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1СопроводительныеДокументы.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ТрН_Титул1СопроводительныеДокументы.Тип КАК Тип,
	|	КонтурЛогистика_ТрН_Титул1СопроводительныеДокументы.ДокументНаименование КАК ДокументНаименование,
	|	КонтурЛогистика_ТрН_Титул1СопроводительныеДокументы.ДокументНомер КАК ДокументНомер,
	|	КонтурЛогистика_ТрН_Титул1СопроводительныеДокументы.ДокументДата КАК ДокументДата
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1.СопроводительныеДокументы КАК КонтурЛогистика_ТрН_Титул1СопроводительныеДокументы
	|		ПО ВТ_ЭТрН.Ссылка = КонтурЛогистика_ТрН_Титул1СопроводительныеДокументы.Ссылка.ДокументЭТРН
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ТрН_Титул1СопроводительныеДокументы.Ссылка,
	|	КонтурЛогистика_ТрН_Титул1СопроводительныеДокументы.Тип,
	|	КонтурЛогистика_ТрН_Титул1СопроводительныеДокументы.ДокументНаименование,
	|	КонтурЛогистика_ТрН_Титул1СопроводительныеДокументы.ДокументНомер,
	|	КонтурЛогистика_ТрН_Титул1СопроводительныеДокументы.ДокументДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭТрН.Ссылка КАК ДокументЭТрН,
	|	КонтурЛогистика_ФайлыОбмена.Ссылка КАК ФайлОбмена,
	|	ВЫБОР
	|		КОГДА КонтурЛогистика_ФайлыОбмена.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1)
	|			ТОГДА 1
	|		КОГДА КонтурЛогистика_ФайлыОбмена.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2)
	|			ТОГДА 2
	|		КОГДА КонтурЛогистика_ФайлыОбмена.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3)
	|			ТОГДА 3
	|		КОГДА КонтурЛогистика_ФайлыОбмена.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4)
	|			ТОГДА 4
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерТитула,
	|	КонтурЛогистика_ФайлыОбмена.КомуВыданСертификат КАК КомуВыданСертификат,
	|	КонтурЛогистика_ФайлыОбмена.Сертификат КАК Сертификат,
	|	КонтурЛогистика_ФайлыОбмена.ДатаВремяФормирования КАК ДатаВремяФормирования,
	|	КонтурЛогистика_ФайлыОбменаOuterDocflows.ДатаСобытия КАК ВодительДатаСобытия,
	|	КонтурЛогистика_ФайлыОбменаOuterDocflows.Текст КАК ВодительТекст
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ФайлыОбмена КАК КонтурЛогистика_ФайлыОбмена
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ФайлыОбмена.OuterDocflows КАК КонтурЛогистика_ФайлыОбменаOuterDocflows
	|			ПО КонтурЛогистика_ФайлыОбмена.Ссылка = КонтурЛогистика_ФайлыОбменаOuterDocflows.Ссылка
	|				И (КонтурЛогистика_ФайлыОбменаOuterDocflows.DocflowNamedId = ""KlDriverConfirm"")
	|		ПО ВТ_ЭТрН.Ссылка = КонтурЛогистика_ФайлыОбмена.ГлавныйДокумент
	|			И (НЕ КонтурЛогистика_ФайлыОбмена.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТитула,
	|	ДатаВремяФормирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1ДополнительныеВодители.Водитель КАК Сотрудник
	|ПОМЕСТИТЬ Сотрудники
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1.ДополнительныеВодители КАК КонтурЛогистика_ТрН_Титул1ДополнительныеВодители
	|		ПО ВТ_ЭТрН.Ссылка = КонтурЛогистика_ТрН_Титул1ДополнительныеВодители.Ссылка.ДокументЭТРН
	|			И (КонтурЛогистика_ТрН_Титул1ДополнительныеВодители.Водитель <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Сотрудники.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Титул1.Водитель
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1 КАК Титул1
	|		ПО ВТ_ЭТрН.Ссылка = Титул1.ДокументЭТРН
	|			И (НЕ Титул1.ПометкаУдаления)
	|			И (Титул1.Водитель <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Сотрудники.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭТрН.Ссылка.ПогрузкаСотрудник
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|ГДЕ
	|	ВТ_ЭТрН.Ссылка.ПогрузкаСотрудник <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Сотрудники.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_Сотрудники.Ссылка КАК Сотрудник,
	|	КонтурЛогистика_Сотрудники.Фамилия + "" "" + КонтурЛогистика_Сотрудники.Имя + "" "" + КонтурЛогистика_Сотрудники.Отчество КАК ФИО,
	|	КонтурЛогистика_Сотрудники.Должность КАК Должность,
	|	КонтурЛогистика_Сотрудники.ИНН КАК ИНН,
	|	КонтурЛогистика_Сотрудники.ОснованиеПолномочий КАК ОДолжОб,
	|	КонтурЛогистика_Сотрудники.ОснованиеПолномочийДоговор КАК ОснПогрГр,
	|	КонтурЛогистика_Сотрудники.ТелефонЗапасной КАК ТелефонЗапасной,
	|	КонтурЛогистика_Сотрудники.ТелефонОсновной КАК ТелефонОсновной,
	|	КонтурЛогистика_Сотрудники.Фамилия КАК Фамилия,
	|	КонтурЛогистика_Сотрудники.Имя КАК Имя,
	|	КонтурЛогистика_Сотрудники.Отчество КАК Отчество,
	|	КонтурЛогистика_Сотрудники.ВУДатаВыдачи КАК ВУДатаВыдачи,
	|	КонтурЛогистика_Сотрудники.ВУНомер КАК ВУНомер,
	|	КонтурЛогистика_Сотрудники.ВУСерия КАК ВУСерия,
	|	""ВУ: "" + КонтурЛогистика_Сотрудники.ВУСерия + "" "" + КонтурЛогистика_Сотрудники.ВУНомер КАК ВУВодителя
	|ИЗ
	|	Справочник.КонтурЛогистика_Сотрудники КАК КонтурЛогистика_Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Сотрудники КАК Сотрудники
	|		ПО КонтурЛогистика_Сотрудники.Ссылка = Сотрудники.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭТрН.Ссылка.ЭкспедицияДоговор КАК Договор
	|ПОМЕСТИТЬ Договоры
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|ГДЕ
	|	ВТ_ЭТрН.Ссылка.ЭкспедицияДоговор <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Договоры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭТрН.ТранспортноеСредство.ДоговорАрендаЛизинг
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|ГДЕ
	|	ВТ_ЭТрН.ТранспортноеСредство.ДоговорАрендаЛизинг <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Договоры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭТрН.Ссылка.ПогрузкаДоговор
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|ГДЕ
	|	ВТ_ЭТрН.Ссылка.ПогрузкаДоговор <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Договоры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_Договоры.Ссылка КАК Договор,
	|	КонтурЛогистика_Договоры.Наименование КАК Наименование,
	|	КонтурЛогистика_Договоры.НомерДокумента КАК НомерДокумента,
	|	КонтурЛогистика_Договоры.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	Справочник.КонтурЛогистика_Договоры КАК КонтурЛогистика_Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
	|		ПО КонтурЛогистика_Договоры.Ссылка = Договоры.Договор
	|			И (НЕ КонтурЛогистика_Договоры.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭТрН.Ссылка.Грузоотправитель КАК Организация
	|ПОМЕСТИТЬ Организации
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|ГДЕ
	|	ВТ_ЭТрН.Ссылка.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭТрН.Ссылка.ЭкспедицияЗаказчик
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|ГДЕ
	|	ВТ_ЭТрН.Ссылка.ЭкспедицияЗаказчик <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭТрН.Ссылка.Грузополучатель
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|ГДЕ
	|	ВТ_ЭТрН.Ссылка.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭТрН.Ссылка.Перевозчик
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|ГДЕ
	|	ВТ_ЭТрН.Ссылка.Перевозчик <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭТрН.Ссылка.ПогрузкуОсуществляет
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|ГДЕ
	|	ВТ_ЭТрН.Ссылка.ПогрузкуОсуществляет <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭТрН.Ссылка.МестоПогрузки.Собственник
	|ИЗ
	|	ВТ_ЭТрН КАК ВТ_ЭТрН
	|ГДЕ
	|	ВТ_ЭТрН.Ссылка.МестоПогрузки.Собственник <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Организация,
	|	КонтурЛогистика_ОрганизацииДиадок.НаименованиеОрганизацииПолное КАК ПолноеНаименование,
	|	КонтурЛогистика_ОрганизацииДиадок.ТелефонОсновной КАК ТелефонОсновной,
	|	КонтурЛогистика_ОрганизацииДиадок.ИНН КАК ИНН,
	|	КонтурЛогистика_ОрганизацииДиадок.КПП КАК КПП,
	|	КонтурЛогистика_ОрганизацииДиадок.АдресПредставление КАК ЮридическийАдрес,
	|	КонтурЛогистика_ОрганизацииДиадок.КонтактнаяИнформация.(
	|		Значение КАК Значение,
	|		ВидКонтактнойИнформации КАК ВидКонтактнойИнформации
	|	) КАК КонтактнаяИнформация,
	|	КонтурЛогистика_ОрганизацииДиадок.ТипЛица КАК ТипЛица
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Организации КАК Организации
	|		ПО КонтурЛогистика_ОрганизацииДиадок.Ссылка = Организации.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Договоры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Организации";
	
	Запрос.УстановитьПараметр("МассивДокументовЭТрН", МассивДокументовЭТрН);

	СоответствиеНастройки = Справочники.КонтурЛогистика_Настройки.ПолучитьПроверкуНастроекОсобенностейХраненияДанных();
	Если СоответствиеНастройки.Получить("ИмяСправочникаВалюты") Тогда
		ИмяСправочника = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИмяСправочникаВалюты");
		ТекстЗамены = "ВЫРАЗИТЬ (КонтурЛогистика_ТрН_Титул1Товары.ОбъявленнаяЦенностьВалюта КАК Справочник." + ИмяСправочника + ").Код"
	Иначе
		ТекстЗамены = """""";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗаменаКодаВалюты", ТекстЗамены);
	
	Пакеты = Запрос.ВыполнитьПакет();
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Шапка", Пакеты[1].Выбрать());
	ДанныеПечати.Вставить("Товары", Пакеты[2].Выгрузить());
	ДанныеПечати.Вставить("Маркировки", Пакеты[3].Выгрузить());
	ДанныеПечати.Вставить("ТелефоныПА", Пакеты[4].Выгрузить());
	ДанныеПечати.Вставить("Отметки", Пакеты[5].Выгрузить());
	ДанныеПечати.Вставить("Заказчики", Пакеты[6].Выгрузить());
	ДанныеПечати.Вставить("ДопВодители", Пакеты[7].Выгрузить());
	ДанныеПечати.Вставить("СопроводительныеДокументы", Пакеты[8].Выгрузить());
	ДанныеПечати.Вставить("ДанныеПодписания", Пакеты[9].Выгрузить());
	ДанныеПечати.Вставить("ДанныеСотрудников", Пакеты[11].Выгрузить());
	ДанныеПечати.Вставить("ДанныеДоговоров", Пакеты[13].Выгрузить());
	ДанныеПечати.Вставить("ВыборкаОрганизации", Пакеты[15].Выбрать());
	
	Возврат ДанныеПечати;
	
КонецФункции

Процедура ОбновитьГрузополучателяИМестоДоставки(ДокЭтрнСсылка, Титул7Ссылка) Экспорт 
			
		ДокЭтрнОбъект = ДокЭтрнСсылка.ПолучитьОбъект();
		
		НайденныйДокументТитул3 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3, ДокЭтрнСсылка);
				
		// для титула 2 перезапишем в ЭТрН новое место доставки и нового ГП
		// для титула 4, а значит и для титула 3 запишем возвратные место и ГП
		Если ЗначениеЗаполнено(НайденныйДокументТитул3) Тогда 
			
			ДокЭтрнОбъект.ВозвратМесто = Титул7Ссылка.АдрВыгруз;
			
			Если ЗначениеЗаполнено(Титул7Ссылка.НовГрузПол) Тогда 
				ДокЭтрнОбъект.ВозвратПолучатель = Титул7Ссылка.НовГрузПол;
			КонецЕсли;
			
		Иначе
			
			// значит сюда попали изи титула 7 до приемки

			// в документе теперь новое место доставки
			// НО! это могла быть не первая переадресовка. 
			// и заменять ПереадресовкаИсходноеМестоДоставки и ПереадресовкаИсходныйПолучатель
			// нужно только если они пустые
			Если Не ЗначениеЗаполнено(ДокЭтрнОбъект.ПереадресовкаИсходноеМестоДоставки) Тогда 
				ДокЭтрнОбъект.ПереадресовкаИсходноеМестоДоставки = ДокЭтрнОбъект.МестоДоставки;
			КонецЕсли;
			ДокЭтрнОбъект.МестоДоставки 	= Титул7Ссылка.АдрВыгруз;
			
			Если ЗначениеЗаполнено(Титул7Ссылка.НовГрузПол) Тогда
				// в документе теперь новый грузополучатель
				// см. чуть выше - важно учесть что это может быть не первая переадресовка
				Если Не ЗначениеЗаполнено(ДокЭтрнОбъект.ПереадресовкаИсходныйПолучатель) Тогда 
					ДокЭтрнОбъект.ПереадресовкаИсходныйПолучатель = ДокЭтрнОбъект.Грузополучатель;
				КонецЕсли;
				ДокЭтрнОбъект.Грузополучатель = Титул7Ссылка.НовГрузПол;
			КонецЕсли;
			
		КонецЕсли;
		
		ДокЭтрнОбъект.Записать();
			
КонецПроцедуры	

Процедура ОбновитьСчетчикПереадресовок(ДокЭтрнСсылка) Экспорт 
	
	ДокЭтрнОбъект = ДокЭтрнСсылка.ПолучитьОбъект();
	
	ДокЭтрнОбъект.КоличествоПереадресовок = ДокЭтрнОбъект.КоличествоПереадресовок + 1;
	
	ДокЭтрнОбъект.Записать();
	
КонецПроцедуры

Процедура ОбновитьСчетчикСменИТелефон(ДокЭтрнСсылка, Титул8Ссылка) Экспорт 
	
	ДокЭтрнОбъект = ДокЭтрнСсылка.ПолучитьОбъект();
	
	Если Титул8Ссылка.НовыеВодители.Количество() Тогда  
		ДокЭтрнОбъект.КоличествоСменВодителей = ДокЭтрнОбъект.КоличествоСменВодителей + 1;
		
		Если ЗначениеЗаполнено(Титул8Ссылка.НовыеВодители[0].Водитель)
			И ЗначениеЗаполнено(Титул8Ссылка.НовыеВодители[0].Водитель.ТелефонОсновной) Тогда
			
			ДокЭтрнОбъект.ТелефонВодителя = Титул8Ссылка.НовыеВодители[0].Водитель.ТелефонОсновной;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Титул8Ссылка.НовыеТранспортныеСредства.Количество() Или Титул8Ссылка.НовыеПрицепы.Количество() Тогда 
		ДокЭтрнОбъект.КоличествоСменТС = ДокЭтрнОбъект.КоличествоСменТС + 1;
	КонецЕсли;
	

	ДокЭтрнОбъект.Записать();
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеАдреса(ТаблицаОшибок, КатегорияОшибка, ПунктМаршрутаСсылка, ИмяПунктаМаршрута = "МестоПогрузки", ПроверкаТ7 = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ПунктМаршрутаСсылка) Тогда
		
		ЗаполнениеАдресаВариант1 = ЗначениеЗаполнено(ПунктМаршрутаСсылка.АдресИнфАдрес) И ЗначениеЗаполнено(ПунктМаршрутаСсылка.АдресИнфКодСтраны);
		ЗаполнениеАдресаВариант2 = ЗначениеЗаполнено(ПунктМаршрутаСсылка.АдресИндекс) И ЗначениеЗаполнено(ПунктМаршрутаСсылка.АдресКодРегион);
		ЗаполнениеАдресаВариант3 = ЗначениеЗаполнено(ПунктМаршрутаСсылка.КодГАР);
		
		СинонимПоля = "";
		Если ИмяПунктаМаршрута = "МестоПогрузки" Тогда 
			СинонимПоля	= "Месте погрузки";
		ИначеЕсли ИмяПунктаМаршрута = "МестоДоставки" Тогда 
			СинонимПоля	= "Месте доставки";
		ИначеЕсли ИмяПунктаМаршрута = "АдрВыгруз" Тогда 
			СинонимПоля	= "Новом Месте доставки";
		Иначе
			СинонимПоля	= ИмяПунктаМаршрута;
		КонецЕсли;
		
		
		Если Не ЗаполнениеАдресаВариант1 И Не ЗаполнениеАдресаВариант2 И Не ЗаполнениеАдресаВариант3 Тогда 
			
			Если ЗначениеЗаполнено(ПунктМаршрутаСсылка.АдресИнфАдрес) И Не ЗначениеЗаполнено(ПунктМаршрутаСсылка.АдресИнфКодСтраны) И Не ЗаполнениеАдресаВариант2 И Не ЗаполнениеАдресаВариант3 Тогда 
				
				ТекстОшибки = "Укажите Код страны в " + СинонимПоля + ?(ПроверкаТ7, "" , " (в Документе электронной транспортной накладной)");
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				?(ПроверкаТ7, "" , "ГлавныйДокумент.") + ИмяПунктаМаршрута + ".АдресИнфКодСтраны", КатегорияОшибка, ТекстОшибки, "Указать");
				
			ИначеЕсли Не ЗначениеЗаполнено(ПунктМаршрутаСсылка.АдресИнфАдрес) И ЗначениеЗаполнено(ПунктМаршрутаСсылка.АдресИнфКодСтраны) И Не ЗаполнениеАдресаВариант2 И Не ЗаполнениеАдресаВариант3 Тогда 
				
				ТекстОшибки = "Укажите Адрес в " + СинонимПоля + ?(ПроверкаТ7, "" , " (в Документе электронной транспортной накладной)");
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				?(ПроверкаТ7, "" , "ГлавныйДокумент.") + ИмяПунктаМаршрута + ".АдресИнфАдрес", КатегорияОшибка, ТекстОшибки, "Указать");		
				
			ИначеЕсли ЗначениеЗаполнено(ПунктМаршрутаСсылка.АдресИндекс) И Не ЗначениеЗаполнено(ПунктМаршрутаСсылка.АдресКодРегион) И Не ЗаполнениеАдресаВариант1 И Не ЗаполнениеАдресаВариант3 Тогда 
				
				ТекстОшибки = "Укажите Код региона в " + СинонимПоля + ?(ПроверкаТ7, "" , " (в Документе электронной транспортной накладной)");
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				?(ПроверкаТ7, "" , "ГлавныйДокумент.") + ИмяПунктаМаршрута + ".АдресКодРегион", КатегорияОшибка, ТекстОшибки, "Указать");
				
			ИначеЕсли Не ЗначениеЗаполнено(ПунктМаршрутаСсылка.АдресИндекс) И ЗначениеЗаполнено(ПунктМаршрутаСсылка.АдресКодРегион) И Не ЗаполнениеАдресаВариант1 И Не ЗаполнениеАдресаВариант3 Тогда 
				
				ТекстОшибки = "Укажите Индекс в " + СинонимПоля + ?(ПроверкаТ7, "" , " (в Документе электронной транспортной накладной)");
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				?(ПроверкаТ7, "" , "ГлавныйДокумент.") + ИмяПунктаМаршрута + ".АдресИндекс", КатегорияОшибка, ТекстОшибки, "Указать");
				
			Иначе
				
				ТекстОшибки = "Укажите Адрес и Код страны в " + СинонимПоля + ?(ПроверкаТ7, "" , " (в Документе электронной транспортной накладной)");
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				?(ПроверкаТ7, "" , "ГлавныйДокумент.") + ИмяПунктаМаршрута + ".АдресИнфАдрес", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВсеОтметкиПоЭТрН(ДокЭтрнСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""Грузополучатель, Погрузка"" КАК Сторона,
	|	КонтурЛогистика_ТрН_Титул1ОтметкиГрузоотправителя.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	КонтурЛогистика_ТрН_Титул1ОтметкиГрузоотправителя.ДатаИВремяОтметки КАК ДатаИВремяОтметки,
	|	КонтурЛогистика_ТрН_Титул1ОтметкиГрузоотправителя.ОписаниеОбстоятельств КАК ОписаниеОбстоятельств,
	|	"""" КАК ОтмАктВзв
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул1.ОтметкиГрузоотправителя КАК КонтурЛогистика_ТрН_Титул1ОтметкиГрузоотправителя
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул1ОтметкиГрузоотправителя.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул1ОтметкиГрузоотправителя.Ссылка.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Перевозчик, Погрузка"",
	|	КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.ИдентификаторСтроки,
	|	КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.ДатаИВремяОтметки,
	|	КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.ОписаниеОбстоятельств,
	|	КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.ОтмАктВзв
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2.ОтметкиПеревозчика КАК КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.Ссылка.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Грузополучатель, Выгрузка"",
	|	КонтурЛогистика_ТрН_Титул3ОтметкиГрузополучателя.ИдентификаторСтроки,
	|	КонтурЛогистика_ТрН_Титул3ОтметкиГрузополучателя.ДатаИВремяОтметки,
	|	КонтурЛогистика_ТрН_Титул3ОтметкиГрузополучателя.ОписаниеОбстоятельств,
	|	""""
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул3.ОтметкиГрузополучателя КАК КонтурЛогистика_ТрН_Титул3ОтметкиГрузополучателя
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул3ОтметкиГрузополучателя.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул3ОтметкиГрузополучателя.Ссылка.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Перевозчик, Выгрузка"",
	|	КонтурЛогистика_ТрН_Титул4ОтметкиПеревозчика.ИдентификаторСтроки,
	|	КонтурЛогистика_ТрН_Титул4ОтметкиПеревозчика.ДатаИВремяОтметки,
	|	КонтурЛогистика_ТрН_Титул4ОтметкиПеревозчика.ОписаниеОбстоятельств,
	|	КонтурЛогистика_ТрН_Титул4ОтметкиПеревозчика.ОтмАктВзв
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул4.ОтметкиПеревозчика КАК КонтурЛогистика_ТрН_Титул4ОтметкиПеревозчика
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул4ОтметкиПеревозчика.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул4ОтметкиПеревозчика.Ссылка.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Перевозчик, Переадресация"",
	|	"""",
	|	КонтурЛогистика_ТрН_Титул7ОтметкиПА.ДатаИВремяОтметки,
	|	КонтурЛогистика_ТрН_Титул7ОтметкиПА.ОписаниеОбстоятельств,
	|	""""
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул7.ОтметкиПА КАК КонтурЛогистика_ТрН_Титул7ОтметкиПА
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул7ОтметкиПА.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул7ОтметкиПА.Ссылка.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Перевозчик, Замена водитетя | ТС"",
	|	КонтурЛогистика_ТрН_Титул8ОтметЗам.ИдентификаторСтроки,
	|	КонтурЛогистика_ТрН_Титул8ОтметЗам.ДатаИВремяОтметки,
	|	КонтурЛогистика_ТрН_Титул8ОтметЗам.ОписаниеОбстоятельств,
	|	""""
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул8.ОтметЗам КАК КонтурЛогистика_ТрН_Титул8ОтметЗам
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул8ОтметЗам.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул8ОтметЗам.Ссылка.ДокументЭТРН = &ДокументЭТРН";
	
	Запрос.УстановитьПараметр("ДокументЭТРН", ДокЭтрнСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ВсеШтрафыПоЭТрН(ДокЭтрнСсылка) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1Штрафы.ИдентификаторСтрокиОтметки КАК ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул1Штрафы.ФактКолЕдИзм КАК ФактКолЕдИзм,
	|	КонтурЛогистика_ТрН_Титул1Штрафы.ИтогРазмШтрРФ КАК ИтогРазмШтрРФ,
	|	КонтурЛогистика_ТрН_Титул1Штрафы.РасчШтр КАК РасчШтр
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул1.Штрафы КАК КонтурЛогистика_ТрН_Титул1Штрафы
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул1Штрафы.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул1Штрафы.Ссылка.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул2Штрафы.ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул2Штрафы.ФактКолЕдИзм,
	|	КонтурЛогистика_ТрН_Титул2Штрафы.ИтогРазмШтрРФ,
	|	КонтурЛогистика_ТрН_Титул2Штрафы.РасчШтр
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2.Штрафы КАК КонтурЛогистика_ТрН_Титул2Штрафы
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул2Штрафы.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул2Штрафы.Ссылка.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул3Штрафы.ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул3Штрафы.ФактКолЕдИзм,
	|	КонтурЛогистика_ТрН_Титул3Штрафы.ИтогРазмШтрРФ,
	|	КонтурЛогистика_ТрН_Титул3Штрафы.РасчШтр
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул3.Штрафы КАК КонтурЛогистика_ТрН_Титул3Штрафы
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул3Штрафы.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул3Штрафы.Ссылка.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул4Штрафы.ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул4Штрафы.ФактКолЕдИзм,
	|	КонтурЛогистика_ТрН_Титул4Штрафы.ИтогРазмШтрРФ,
	|	КонтурЛогистика_ТрН_Титул4Штрафы.РасчШтр
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул4.Штрафы КАК КонтурЛогистика_ТрН_Титул4Штрафы
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул4Штрафы.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул4Штрафы.Ссылка.ДокументЭТРН = &ДокументЭТРН";
	
	Запрос.УстановитьПараметр("ДокументЭТРН", ДокЭтрнСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции 

Функция ВсеАктыПоЭТрН(ДокЭтрнСсылка) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1Акты.ИдентификаторСтрокиОтметки КАК ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул1Акты.АктНомер КАК АктНомер,
	|	КонтурЛогистика_ТрН_Титул1Акты.АктДата КАК АктДата,
	|	КонтурЛогистика_ТрН_Титул1Акты.АктНаименование КАК АктНаименование,
	|	КонтурЛогистика_ТрН_Титул1Акты.АктИдДок КАК АктИдДок,
	|	КонтурЛогистика_ТрН_Титул1Акты.АктДопСведДок КАК АктДопСведДок,
	|	КонтурЛогистика_ТрН_Титул1Акты.АктЭтоАктВзвешивания КАК АктЭтоАктВзвешивания,
	|	КонтурЛогистика_ТрН_Титул1Акты.СтороныСоставители КАК СтороныСоставители,
	|	КонтурЛогистика_ТрН_Титул1Акты.ДополнительныйСоставитель КАК ДополнительныйСоставитель
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул1.Акты КАК КонтурЛогистика_ТрН_Титул1Акты
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул1Акты.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул1Акты.Ссылка.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул2Акты.ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул2Акты.АктНомер,
	|	КонтурЛогистика_ТрН_Титул2Акты.АктДата,
	|	КонтурЛогистика_ТрН_Титул2Акты.АктНаименование,
	|	КонтурЛогистика_ТрН_Титул2Акты.АктИдДок,
	|	КонтурЛогистика_ТрН_Титул2Акты.АктДопСведДок,
	|	ЛОЖЬ,
	|	КонтурЛогистика_ТрН_Титул2Акты.СтороныСоставители,
	|	КонтурЛогистика_ТрН_Титул2Акты.ДополнительныйСоставитель
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2.Акты КАК КонтурЛогистика_ТрН_Титул2Акты
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул2Акты.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул2Акты.Ссылка.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул3Акты.ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул3Акты.АктНомер,
	|	КонтурЛогистика_ТрН_Титул3Акты.АктДата,
	|	КонтурЛогистика_ТрН_Титул3Акты.АктНаименование,
	|	КонтурЛогистика_ТрН_Титул3Акты.АктИдДок,
	|	КонтурЛогистика_ТрН_Титул3Акты.АктДопСведДок,
	|	КонтурЛогистика_ТрН_Титул3Акты.АктЭтоАктВзвешивания,
	|	КонтурЛогистика_ТрН_Титул3Акты.СтороныСоставители,
	|	КонтурЛогистика_ТрН_Титул3Акты.ДополнительныйСоставитель
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул3.Акты КАК КонтурЛогистика_ТрН_Титул3Акты
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул3Акты.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул3Акты.Ссылка.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул4Акты.ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул4Акты.АктНомер,
	|	КонтурЛогистика_ТрН_Титул4Акты.АктДата,
	|	КонтурЛогистика_ТрН_Титул4Акты.АктНаименование,
	|	КонтурЛогистика_ТрН_Титул4Акты.АктИдДок,
	|	КонтурЛогистика_ТрН_Титул4Акты.АктДопСведДок,
	|	ЛОЖЬ,
	|	КонтурЛогистика_ТрН_Титул4Акты.СтороныСоставители,
	|	КонтурЛогистика_ТрН_Титул4Акты.ДополнительныйСоставитель
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул4.Акты КАК КонтурЛогистика_ТрН_Титул4Акты
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул4Акты.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул4Акты.Ссылка.ДокументЭТРН = &ДокументЭТРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул8Акты.ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул8Акты.АктНомер,
	|	КонтурЛогистика_ТрН_Титул8Акты.АктДата,
	|	КонтурЛогистика_ТрН_Титул8Акты.АктНаименование,
	|	КонтурЛогистика_ТрН_Титул8Акты.АктИдДок,
	|	КонтурЛогистика_ТрН_Титул8Акты.АктДопСведДок,
	|	ЛОЖЬ,
	|	КонтурЛогистика_ТрН_Титул8Акты.СтороныСоставители,
	|	КонтурЛогистика_ТрН_Титул8Акты.ДополнительныйСоставитель
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул8.Акты КАК КонтурЛогистика_ТрН_Титул8Акты
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул8Акты.Ссылка.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул8Акты.Ссылка.ДокументЭТРН = &ДокументЭТРН";
	
	Запрос.УстановитьПараметр("ДокументЭТРН", ДокЭтрнСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ЯвляетсяУчастникомПеревозки(Организация, ДокЭтрнСсылка) Экспорт
	
	Если Организация = ДокЭтрнСсылка.Грузоотправитель
		Или Организация = ДокЭтрнСсылка.Перевозчик
		Или Организация = ДокЭтрнСсылка.Грузополучатель
		Или (ДокЭтрнСсылка.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку 
			И ЗначениеЗаполнено(ДокЭтрнСсылка.ПогрузкуОсуществляет) 
			И Организация = ДокЭтрнСсылка.ПогрузкуОсуществляет) Тогда
			
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Функция возвращает заказчика экспедиции, если это экспедиторская перевозка
//
// Параметры:
//  ДокументЭТРН	- ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная - По какому ЭТРН
// 
// Возвращаемое значение:
//  ЭкспедицияЗаказчик - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок
// 
//  Если заказчик не найден, вернется Неопределено.
//
Функция ПолучитьЗаказчикаЭкспедиции(ДокументЭТРН) Экспорт
		
	Если ДокументЭТРН.ЭтоЭкспедиция И ЗначениеЗаполнено(ДокументЭТРН.ЭкспедицияЗаказчик) Тогда
		Возврат ДокументЭТРН.ЭкспедицияЗаказчик;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Функция РезультатПроверкиПолейТС(ДокЭтрнСсылка)
	
	Отказ = Ложь;
	
	РезультатПроверкиОбщий = Справочники.КонтурЛогистика_ТранспортныеСредства.ОписаниеРезультатаПроверки();
	РезультатПроверкиТС = Справочники.КонтурЛогистика_ТранспортныеСредства.ОписаниеРезультатаПроверки();
	РезультатПроверкиПрицепа = Справочники.КонтурЛогистика_ТранспортныеСредства.ОписаниеРезультатаПроверки();
	РезультатПроверкиПрицепа2 = Справочники.КонтурЛогистика_ТранспортныеСредства.ОписаниеРезультатаПроверки();
	
	ТранспортноеСредство = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаСсылки(ДокЭТрНСсылка, "ТранспортноеСредство");
	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда 
		
		РезультатПроверкиТС = Справочники.КонтурЛогистика_ТранспортныеСредства.РезультатПроверкиАрендатораДоговора(ТранспортноеСредство, Отказ);
		
		Если РезультатПроверкиТС.ЕстьОшибки Тогда
			Для Каждого Ошибка Из РезультатПроверкиТС.ОшибкиПолей Цикл
				Ошибка.ИмяПоля = "ТранспортноеСредство." + Ошибка.ИмяПоля; 
				РезультатПроверкиОбщий.ОшибкиПолей.Добавить(Ошибка);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Прицеп = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаСсылки(ДокЭТрНСсылка, "Прицеп");
	Если ЗначениеЗаполнено(Прицеп) Тогда 
		РезультатПроверкиПрицепа = Справочники.КонтурЛогистика_ТранспортныеСредства.РезультатПроверкиАрендатораДоговора(Прицеп, Отказ);
		
		Если РезультатПроверкиПрицепа.ЕстьОшибки Тогда
			Для Каждого Ошибка Из РезультатПроверкиПрицепа.ОшибкиПолей Цикл 
				Ошибка.ИмяПоля = "Прицеп." + Ошибка.ИмяПоля; 
				РезультатПроверкиОбщий.ОшибкиПолей.Добавить(Ошибка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Прицеп2 = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаСсылки(ДокЭТрНСсылка, "Прицеп2");
	Если ЗначениеЗаполнено(Прицеп2) Тогда 
		РезультатПроверкиПрицепа2 = Справочники.КонтурЛогистика_ТранспортныеСредства.РезультатПроверкиАрендатораДоговора(Прицеп2, Отказ);
		
		Если РезультатПроверкиПрицепа2.ЕстьОшибки Тогда
			Для Каждого Ошибка Из РезультатПроверкиПрицепа2.ОшибкиПолей Цикл 
				Ошибка.ИмяПоля = "Прицеп2." + Ошибка.ИмяПоля; 
				РезультатПроверкиОбщий.ОшибкиПолей.Добавить(Ошибка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	РезультатПроверкиОбщий.ЕстьОшибки = РезультатПроверкиТС.ЕстьОшибки Или РезультатПроверкиПрицепа.ЕстьОшибки Или РезультатПроверкиПрицепа2.ЕстьОшибки;
	
	Возврат РезультатПроверкиОбщий;
	
КонецФункции

#КонецОбласти

#КонецЕсли