Функция ЗаполнитьЗначениямиПоУмолчанию() Экспорт
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	ТаблицаУпаковок = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТаблицуУпаковокПоУмолчанию();
	
	Если ЗначениеЗаполнено(ТаблицаУпаковок) Тогда 
		
		Для Каждого Строка Из ТаблицаУпаковок Цикл
			
			НайденнаяУпаковка = Справочники.КонтурЛогистика_КлассификаторУпаковок.НайтиПоКоду(Строка.Код);  
			
			Если Не ЗначениеЗаполнено(НайденнаяУпаковка) Тогда 
				
				Упаковка = Справочники.КонтурЛогистика_КлассификаторУпаковок.СоздатьЭлемент();
				
			Иначе
				
				Упаковка = НайденнаяУпаковка.ПолучитьОбъект();
				
			КонецЕсли;	
			
			Упаковка.Код 			= Строка.Код;
			Упаковка.Наименование 	= Строка.Наименование;
			
			Упаковка.Записать();
			
		КонецЦикла;
		
		Результат.Успешно = Истина;
		
	Иначе 
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Предопределенные значение для заполнения классификатора упаковок не найдены.";
			
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция НастройкиЗаполнены() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_КлассификаторУпаковок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_КлассификаторУпаковок КАК КонтурЛогистика_КлассификаторУпаковок";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции