#Область ПрограммныйИнтерфейс

&ИзменениеИКонтроль("ПечатьЭтикетокИСМП")
Процедура АУ_ПечатьЭтикетокИСМП(ТаблицаДанных, ТабличныйДокумент, СтруктураНастроек)

	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаИСМП";
	
	// Собираем используемые поля из шаблонов.
	СоответствиеШаблонов    = Новый Соответствие();
	ХэшиРазмеровШаблонов    = Неопределено;
	РазмерыШаблоновРазличны = Ложь;
	
	ДанныеШаблоновЭтикеток = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ТаблицаДанных.ВыгрузитьКолонку("ШаблонЭтикетки"), "ТипШтрихкода");
	ОшибкиПоТипуШтрихкода  = Новый Соответствие;
	
	Для Каждого СтрокаТЧ Из ТаблицаДанных Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) И СтрокаТЧ.Количество > 0 Тогда
			Если СтрокаТЧ.ЭтоКодМаркировки
				И ЗначениеЗаполнено(СтрокаТЧ.ТипШтрихкода) Тогда
				ДанныеШаблонаЭтикеток = ДанныеШаблоновЭтикеток[СтрокаТЧ.ШаблонЭтикетки];
				Если ДанныеШаблонаЭтикеток <> Неопределено
					И ЗначениеЗаполнено(ДанныеШаблонаЭтикеток.ТипШтрихкода)
					И ДанныеШаблонаЭтикеток.ТипШтрихкода <> СтрокаТЧ.ТипШтрихкода Тогда
					Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
						КлючНоменклатура = СтрокаТЧ.Номенклатура;
					Иначе
						КлючНоменклатура = Лев(СтрокаТЧ.ПредставлениеНоменклатуры, 100);
					КонецЕсли;
					ОшибкаПоТипуШтрихкода = ОшибкиПоТипуШтрихкода[КлючНоменклатура];
					Если ОшибкаПоТипуШтрихкода = Неопределено Тогда
						ОшибкиПоТипуШтрихкода.Вставить(КлючНоменклатура, Новый Соответствие);
						ОшибкаПоТипуШтрихкода = ОшибкиПоТипуШтрихкода[КлючНоменклатура];
					КонецЕсли;
					ОшибкаПоШаблону = ОшибкаПоТипуШтрихкода[СтрокаТЧ.Шаблон];
					Если ОшибкаПоШаблону = Неопределено Тогда
						ПредставлениеШаблона = Строка(СтрокаТЧ.Шаблон);
						ОшибкаПоТипуШтрихкода.Вставить(СтрокаТЧ.Шаблон, СтрШаблон(
							НСтр("ru = 'При печати кодов маркировки для продукции %1 с видом упаковки %2 не может быть использован шаблон этикетки с типом штрихкода %3, укажите шаблон этикетки с типом штрихкода %4'"),
							КлючНоменклатура,
							ПредставлениеШаблона,
							ДанныеШаблонаЭтикеток.ТипШтрихкода,
							СтрокаТЧ.ТипШтрихкода));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЭтикетки);
		КонецЕсли;
	КонецЦикла;
	
	Если ОшибкиПоТипуШтрихкода.Количество() > 0 Тогда
		Для Каждого КлючИЗначениеНоменклатура Из ОшибкиПоТипуШтрихкода Цикл
			Для Каждого КлючИЗначениеШаблон Из КлючИЗначениеНоменклатура.Значение Цикл
				ОбщегоНазначения.СообщитьПользователю(КлючИЗначениеШаблон.Значение);
			КонецЦикла;
		КонецЦикла;
		ВызватьИсключение НСтр("ru = 'Не удалось выполнить печать этикеток'");
	КонецЕсли;
	
	Если СтруктураНастроек.Свойство("СтруктураМакетаШаблона")
		И ЗначениеЗаполнено(СтруктураНастроек.СтруктураМакетаШаблона) Тогда
		СоответствиеШаблонов.Вставить(Справочники.ШаблоныЭтикетокИЦенников.ПустаяСсылка());
	КонецЕсли;
	
	// Заполняем коллекцию обязательных полей и формируем соответствие шаблонов.
	Для Каждого КлючИЗначение Из СоответствиеШаблонов Цикл
		
		ШаблонЭтикетокИЦенников = КлючИЗначение.Ключ;
		
		Если ЗначениеЗаполнено(ШаблонЭтикетокИЦенников) Тогда
			
			СтруктураШаблона = ШаблонЭтикетокИЦенников.Шаблон.Получить();
			Хэширование      = Новый ХешированиеДанных(ХешФункция.SHA256);
			ДанныеДляХэша    = Новый Массив();
			ОбластьПечати    = СтруктураШаблона.МакетЭтикетки.ПолучитьОбласть(СтруктураШаблона.ИмяОбластиПечати);
			
			ДанныеДляХэша.Добавить(ОбластьПечати.ШиринаТаблицы);
			ДанныеДляХэша.Добавить(ОбластьПечати.ВысотаТаблицы);
			
			Для НомерКолонки = 1 По ОбластьПечати.ШиринаТаблицы Цикл
				Колонка = ОбластьПечати.Область(, НомерКолонки,, НомерКолонки);
				ДанныеДляХэша.Добавить(Колонка.ШиринаКолонки);
			КонецЦикла;
			
			Для НомерСтроки = 1 По ОбластьПечати.ВысотаТаблицы Цикл
				Строка = ОбластьПечати.Область(НомерСтроки,, НомерСтроки,);
				ДанныеДляХэша.Добавить(Строка.ВысотаСтроки);
				ДанныеДляХэша.Добавить(Строка.АвтоВысотаСтроки);
			КонецЦикла;
			
			Хэширование.Добавить(СтрСоединить(ДанныеДляХэша));
			
			Если ХэшиРазмеровШаблонов = Неопределено Тогда
				ХэшиРазмеровШаблонов = Base64Строка(Хэширование.ХешСумма);
			ИначеЕсли ХэшиРазмеровШаблонов <> Base64Строка(Хэширование.ХешСумма) Тогда
				РазмерыШаблоновРазличны = Истина;
			КонецЕсли;
			
		Иначе
			СтруктураШаблона = СтруктураНастроек.СтруктураМакетаШаблона;
		КонецЕсли;
		
		// Структура шаблонов.
		СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов.Вставить(ШаблонЭтикетокИЦенников, СтруктураШаблона);
		
		// Добавляем в массив обязательных полей поля, присутствующие в печатной форме ценника.
		Для Каждого Элемент Из СтруктураШаблона.ПараметрыШаблона Цикл
			СтруктураНастроек.ОбязательныеПоля.Добавить(Элемент.Ключ);
		КонецЦикла;
		
	КонецЦикла;
	
	#Область ПодготовкаСтруктурыДанныхШаблона
	СтруктураНастроек.ИсходныеДанные = ТаблицаДанных;
	СтруктураРезультата = Обработки.ПечатьЭтикетокИЦенников.ПодготовитьСтруктуруДанных(
		СтруктураНастроек, "ЭтикеткаКодМаркировкиИСМП");
	
	#КонецОбласти
	
	#Область ФормированиеТабличногоДокумента
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	ПоследняяВыведеннаяШирина            = 0;
	ВыведеноОбластейВШирину              = 0;
	НомерПредыдущейВерхнейГраницы        = 0;
	ПредыдущийШаблонПечати               = Неопределено;
	ПараметрыТабличногоДокументЗаполнены = Ложь;
	КоличествоЭтикетокВШиринуПоШаблону   = Новый Соответствие();
	
	ПредыдущейНомерВГруппе = Неопределено;
	ПредыдущаяСтрокаПечати = Новый Структура("Номенклатура, Характеристика, GTIN");
	
	#Вставка
	Счетчик=0;
	ПредыдущаяНоменклатура=Неопределено;
	#КонецВставки
	Для Каждого СтрокаТовары Из СтруктураРезультата.Таблица Цикл
		
		КоличествоЭтикеток = СтрокаТовары.Количество;
		Если КоличествоЭтикеток <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		#Вставка
		Если ПредыдущаяНоменклатура<>СтрокаТовары.Номенклатура Тогда
			Счетчик=0;
		КонецЕсли;
		Счетчик=Счетчик+1;
		#КонецВставки
		ТекущийНомерВГруппе = СтрокаТовары.НомерВГруппе;
		
		СтруктураШаблона = СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов.Получить(СтрокаТовары.ШаблонЭтикетки);
		Область          = СтруктураШаблона.МакетЭтикетки.ПолучитьОбласть(СтруктураШаблона.ИмяОбластиПечати);
		
		Если Не ПараметрыТабличногоДокументЗаполнены Тогда
			// Применение настроек табличного документа.
			ЗаполнитьЗначенияСвойств(
				ТабличныйДокумент,
				СтруктураШаблона.МакетЭтикетки,,
				"ОбластьПечати, АвтоМасштаб");
				
			ПараметрыТабличногоДокументЗаполнены = Истина;
		КонецЕсли;
		
		// Расчет для разных шаблонов
		Если РазмерыШаблоновРазличны И ЗначениеЗаполнено(ШаблонЭтикетокИЦенников) Тогда
			
			ДанныеПоКоличеству = КоличествоЭтикетокВШиринуПоШаблону[СтрокаТовары.ШаблонЭтикетки];
			
			Если ДанныеПоКоличеству = Неопределено Тогда
				
				КоличествоПоШирине = 1;
				
				Если Не СтруктураНастроек.КаждаяЭтикеткаНаНовомЛисте Тогда
					
					ТабличныйДокументПроверкаВывода = Новый ТабличныйДокумент();
					ЗаполнитьЗначенияСвойств(
						ТабличныйДокументПроверкаВывода,
						СтруктураШаблона.МакетЭтикетки,,
						"ОбластьПечати, АвтоМасштаб");
					
					ТабличныйДокументПроверкаВывода.Вывести(Область);
					
					Пока ТабличныйДокументПроверкаВывода.ПроверитьПрисоединение(Область) Цикл
						КоличествоПоШирине = КоличествоПоШирине + 1;
						ТабличныйДокументПроверкаВывода.Присоединить(Область);
						Если КоличествоПоШирине > 100 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
				КоличествоЭтикетокВШиринуПоШаблону.Вставить(СтрокаТовары.ШаблонЭтикетки, КоличествоПоШирине);
				
			КонецЕсли;
			
		КонецЕсли;
			
		Для каждого ПараметрШаблона Из СтруктураШаблона.ПараметрыШаблона Цикл
			Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Область.Параметры, ПараметрШаблона.Значение) Тогда
				НаименованиеКолонки = СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить(Справочники.ШаблоныЭтикетокИЦенников.ИмяПоляВШаблоне(ПараметрШаблона.Ключ));
				Если НаименованиеКолонки <> Неопределено Тогда
					Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
				КонецЕсли;
			КонецЕсли;
			#Вставка
			Если ПараметрШаблона.Ключ="Счетчик" Тогда
				Область.Параметры[ПараметрШаблона.Значение] = Формат(Счетчик,"ЧЦ=4; ЧВН=; ЧГ=");
			КонецЕсли;
			#КонецВставки
		КонецЦикла;
		
		СтрокаТаблицыДанных = ТаблицаДанных.Найти(СтрокаТовары.КодМаркировки, "КодМаркировки");
		Если СтрокаТаблицыДанных = Неопределено Тогда
			ШтрихкодВBase64 = Ложь;
		Иначе
			ШтрихкодВBase64 = СтрокаТаблицыДанных.ШтрихкодВBase64;
		КонецЕсли;
		
		#Область ПечатьИзображенияШтрихкода
		Для каждого Рисунок Из Область.Рисунки Цикл
			
			Если СтрНайти(Рисунок.Имя, Справочники.ШаблоныЭтикетокИЦенников.ИмяПараметраШтрихкод()) = 1 Тогда
				
				ЗначениеШтрихкода = СтрокаТовары[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить(Справочники.ШаблоныЭтикетокИЦенников.ИмяПараметраШтрихкод())];
				Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
					
					Если СтруктураШаблона.Свойство("УровеньЧеткости") Тогда
						УровеньЧеткости = СтруктураШаблона.УровеньЧеткости;
					Иначе
						УровеньЧеткости = 1;
					КонецЕсли;
					
					ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
					ПараметрыШтрихкода.Ширина = Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе) * УровеньЧеткости;
					ПараметрыШтрихкода.Высота = Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе) * УровеньЧеткости;
					ПараметрыШтрихкода.ТипКода = СтруктураШаблона.ТипКода;
					
					Если ШтрихкодВBase64 Тогда
						ПараметрыШтрихкода.ТипВходныхДанных = 1;
						ПараметрыШтрихкода.Штрихкод         = ЗначениеШтрихкода;
					Иначе
						ТипВходныхДанных = 0;
						КодGS1ДляКомпонентыПечати = ШтрихкодированиеИС.КодGS1ДляКомпонентыПечати(ЗначениеШтрихкода, СтруктураШаблона.ТипКода, ТипВходныхДанных);
						ПараметрыШтрихкода.ТипВходныхДанных = ТипВходныхДанных;
						ПараметрыШтрихкода.Штрихкод         = КодGS1ДляКомпонентыПечати;
					КонецЕсли;
					
					ПараметрыШтрихкода.ОтображатьТекст = СтруктураШаблона.ОтображатьТекст;
					ПараметрыШтрихкода.РазмерШрифта = СтруктураШаблона.РазмерШрифта * УровеньЧеткости;
					
					Если СтруктураШаблона.Свойство("GS1DatabarКоличествоСтрок") Тогда
						ПараметрыШтрихкода.GS1DatabarКоличествоСтрок = СтруктураШаблона.GS1DatabarКоличествоСтрок;
					КонецЕсли;
					Если СтруктураШаблона.Свойство("ТипШрифта") Тогда
						ПараметрыШтрихкода.Вставить("ТипШрифта", СтруктураШаблона.МонохромныйШрифт);
					КонецЕсли;
					Если СтруктураШаблона.Свойство("УголПоворота") Тогда
						ПараметрыШтрихкода.УголПоворота = СтруктураШаблона.УголПоворота;
					КонецЕсли;
					Если СтруктураШаблона.Свойство("МонохромныйШрифт") Тогда
						ПараметрыШтрихкода.Вставить("МонохромныйШрифт", СтруктураШаблона.МонохромныйШрифт);
					КонецЕсли;
					Если СтруктураШаблона.Свойство("Масштабировать") Тогда
						ПараметрыШтрихкода.Масштабировать = СтруктураШаблона.Масштабировать;
					КонецЕсли;
					Если СтруктураШаблона.Свойство("СохранятьПропорции") Тогда
						ПараметрыШтрихкода.СохранятьПропорции = СтруктураШаблона.СохранятьПропорции;
					КонецЕсли;
					Если СтруктураШаблона.Свойство("ВертикальноеВыравнивание") Тогда
						ПараметрыШтрихкода.ВертикальноеВыравнивание = СтруктураШаблона.ВертикальноеВыравнивание;
					КонецЕсли;
					
					РезультатГенерацииШтрихкода = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
					Если РезультатГенерацииШтрихкода.Картинка <> Неопределено Тогда
						Рисунок.Картинка = РезультатГенерацииШтрихкода.Картинка;
					Иначе
						ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'При генерации картинки штрихкода произошла ошибка'"));
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрНайти(Рисунок.Имя, "ЗнакВалюты") = 1 Тогда
				ЗначениеКодаВалюты = СтрокаТовары[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить(Справочники.ШаблоныЭтикетокИЦенников.ИмяПараметраКодВалюты())];
				Попытка
					Рисунок.Картинка = Новый Картинка(Справочники.ШаблоныЭтикетокИЦенников.ПолучитьМакет("ЗнакВалюты" + ЗначениеКодаВалюты), Истина);
				Исключение
					Рисунок.Картинка = Новый Картинка;
				КонецПопытки;
			КонецЕсли;
			
		КонецЦикла;
		#КонецОбласти
		
		ИспользоватьХарактеристики = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "Характеристика");
		
		#Область КоличествоЭкземпляров
		Для Индекс = 1 По КоличествоЭтикеток Цикл // Цикл по количеству экземпляров
			
			Если СтруктураНастроек.КаждаяЭтикеткаНаНовомЛисте Тогда
				
				Если РазмерыШаблоновРазличны Тогда
					
					ВременныйТабличныйДокумент = Новый ТабличныйДокумент;
					ВременныйТабличныйДокумент.Вывести(Область);
					
					ОбластьИсточник = ВременныйТабличныйДокумент.Область(
						1,
						1,
						ВременныйТабличныйДокумент.ВысотаТаблицы,
						ВременныйТабличныйДокумент.ШиринаТаблицы);
					
					Если ТабличныйДокумент.ВысотаТаблицы = 1 Тогда
						НомерПервойСтрокиНовойОбласти    = 1;
						НомерПоследнейСтрокиНовойОбласти = ВременныйТабличныйДокумент.ВысотаТаблицы;
					Иначе
						НомерПервойСтрокиНовойОбласти    = ТабличныйДокумент.ВысотаТаблицы + 1;
						НомерПоследнейСтрокиНовойОбласти = НомерПервойСтрокиНовойОбласти   + Область.ВысотаТаблицы - 1;
					КонецЕсли;
					
					ТабличныйДокумент.Область(
						НомерПервойСтрокиНовойОбласти,
						,
						НомерПоследнейСтрокиНовойОбласти,
						).СоздатьФорматСтрок();
					
					Для Счетчик = 1 По ВременныйТабличныйДокумент.ШиринаТаблицы Цикл
						ТабличныйДокумент.Область(НомерПервойСтрокиНовойОбласти, Счетчик).ШиринаКолонки = Область.Область(1, Счетчик).ШиринаКолонки;
					КонецЦикла;
					Для Счетчик = 1 По ВременныйТабличныйДокумент.ВысотаТаблицы Цикл
						НомерТекущейСтроки              = НомерПервойСтрокиНовойОбласти + Счетчик - 1;
						СтрокаИсточник                  = Область.Область(Счетчик, ,Счетчик);
						СтрокаПриемник                  = ТабличныйДокумент.Область(НомерТекущейСтроки,, НомерТекущейСтроки);
						СтрокаПриемник.ВысотаСтроки     = СтрокаИсточник.ВысотаСтроки;
						СтрокаПриемник.АвтоВысотаСтроки = СтрокаИсточник.АвтоВысотаСтроки;
					КонецЦикла;
					
					ТабличныйДокумент.ВставитьОбласть(
						ОбластьИсточник,
						ТабличныйДокумент.Область(
							НомерПервойСтрокиНовойОбласти,
							1,
							НомерПоследнейСтрокиНовойОбласти,
							ВременныйТабличныйДокумент.ШиринаТаблицы),
							ТипСмещенияТабличногоДокумента.БезСмещения);
					
				Иначе
					
					ТабличныйДокумент.Вывести(Область);
					
				КонецЕсли;
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			Иначе
				
				ВывестиГоризонтальныйРазделитель = Ложь;
				Если ПредыдущейНомерВГруппе = Неопределено Тогда
					ПредыдущейНомерВГруппе = ТекущийНомерВГруппе;
				КонецЕсли;
				
				Присоединять = ТабличныйДокумент.ВысотаТаблицы > 0;
				Если ТекущийНомерВГруппе = "" Тогда
					// Группа не поменялась, возможно другая номенклатура с такой же группой
					Если ЗначениеЗаполнено(ПредыдущаяСтрокаПечати.Номенклатура)
						И (ИспользоватьХарактеристики И ПредыдущаяСтрокаПечати.Характеристика <> СтрокаТовары.Характеристика)
						Или ПредыдущаяСтрокаПечати.Номенклатура <> СтрокаТовары.Номенклатура 
						Или (Не ЗначениеЗаполнено(СтрокаТовары.Номенклатура)
							И ПредыдущаяСтрокаПечати.GTIN <> СтрокаТовары.GTIN) Тогда
						ВывестиГоризонтальныйРазделитель = Истина;
					КонецЕсли;
				ИначеЕсли ТекущийНомерВГруппе<>ПредыдущейНомерВГруппе Тогда
					ВывестиГоризонтальныйРазделитель = Истина;
					ПредыдущейНомерВГруппе = ТекущийНомерВГруппе;
				КонецЕсли;
				
				Если ВывестиГоризонтальныйРазделитель Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					Присоединять = Ложь;
				КонецЕсли;
				
				МассивОбластейПрисоединения = Новый Массив();
				
				Если РазмерыШаблоновРазличны Тогда
					
					ВременныйТабличныйДокумент = Новый ТабличныйДокумент;
					ВременныйТабличныйДокумент.Вывести(Область);
					
					МассивОбластейПрисоединения.Добавить(Область);
					
					Если ЗначениеЗаполнено(ПредыдущийШаблонПечати) И ПредыдущийШаблонПечати <> СтрокаТовары.ШаблонЭтикетки Тогда
						Присоединять = Ложь;
					КонецЕсли;
					
					УмещаетсяЭтикетокВШирину = КоличествоЭтикетокВШиринуПоШаблону.Получить(СтрокаТовары.ШаблонЭтикетки);
					
					Если Присоединять И ВыведеноОбластейВШирину < УмещаетсяЭтикетокВШирину Тогда
						
						ОбластьИсточник = ВременныйТабличныйДокумент.Область(1, 1, Область.ВысотаТаблицы, Область.ШиринаТаблицы);
						
						ОбластьПриемник = ТабличныйДокумент.Область(
							НомерПредыдущейВерхнейГраницы + 1,
							ПоследняяВыведеннаяШирина + 1,
							НомерПредыдущейВерхнейГраницы + Область.ВысотаТаблицы,
							ПоследняяВыведеннаяШирина + Область.ШиринаТаблицы);
							
						ТабличныйДокумент.ВставитьОбласть(
							ОбластьИсточник,
							ОбластьПриемник);
							
						ОбластьПриемник.СоздатьФорматСтрок();
						
						Для Счетчик = 1 По ВременныйТабличныйДокумент.ШиринаТаблицы Цикл
							ТабличныйДокумент.Область(НомерПервойСтрокиНовойОбласти, Счетчик + ПоследняяВыведеннаяШирина).ШиринаКолонки = Область.Область(1, Счетчик).ШиринаКолонки;
						КонецЦикла;
						
						ПоследняяВыведеннаяШирина = ПоследняяВыведеннаяШирина + ВременныйТабличныйДокумент.ШиринаТаблицы;
						ВыведеноОбластейВШирину   = ВыведеноОбластейВШирину   + 1;
						
					Иначе
						
						Если Не ТабличныйДокумент.ПроверитьВывод(ВременныйТабличныйДокумент) И Присоединять Тогда
							ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;
						
						НомерПредыдущейВерхнейГраницы    = ТабличныйДокумент.ВысотаТаблицы;
						НомерПервойСтрокиНовойОбласти    = ТабличныйДокумент.ВысотаТаблицы + 1;
						НомерПоследнейСтрокиНовойОбласти = ТабличныйДокумент.ВысотаТаблицы + ВременныйТабличныйДокумент.ВысотаТаблицы;
						
						ТабличныйДокумент.Вывести(ВременныйТабличныйДокумент);
						
						ТабличныйДокумент.Область(
							НомерПервойСтрокиНовойОбласти,
							,
							НомерПоследнейСтрокиНовойОбласти,
							).СоздатьФорматСтрок();
						
						Для Счетчик = 1 По Область.ШиринаТаблицы Цикл
							ТабличныйДокумент.Область(НомерПервойСтрокиНовойОбласти, Счетчик,, Счетчик).ШиринаКолонки = Область.Область(1, Счетчик).ШиринаКолонки;
						КонецЦикла;
						
						ПоследняяВыведеннаяШирина = Область.ШиринаТаблицы;
						ВыведеноОбластейВШирину   = 1;
						
					КонецЕсли;
					
					ПредыдущийШаблонПечати = СтрокаТовары.ШаблонЭтикетки;
					
				Иначе
					
					МассивОбластейПрисоединения.Добавить(Область);
					
					Если Присоединять И ТабличныйДокумент.ПроверитьПрисоединение(МассивОбластейПрисоединения) Тогда
						
						ТабличныйДокумент.Присоединить(Область);
						
					Иначе
						
						Если Не ТабличныйДокумент.ПроверитьВывод(Область) И Присоединять Тогда
							ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;
						
						ТабличныйДокумент.Вывести(Область);
						
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЕсли;
			
			#Вставка
			ПредыдущаяНоменклатура=СтрокаТовары.Номенклатура;
			#КонецВставки
		КонецЦикла; // Цикл по количеству экземпляров
		
		#КонецОбласти
		
		ЗаполнитьЗначенияСвойств(ПредыдущаяСтрокаПечати, СтрокаТовары,, "GTIN");
		Если Не ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
			ПредыдущаяСтрокаПечати.GTIN = СтрокаТовары.GTIN;
		КонецЕсли;
		
	КонецЦикла; // Цикл по строкам таблицы товаров
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
