#Область СлужебныйПрограммныйИнтерфейс

// Заполняет поля данных штрихкода, используемые подсистемой МОТП, после уточнения данных:
//  * Выбор вида и типа упаковки (пачка/блок), если ранее он не распознан, по коэффициенту вложенности (количеству пачек)
//  * По виду упаковки и коэффициенту указание количества пачек и блоков.
//
// Параметры:
//  ДанныеШтрихкода - Структура - текущие данные штрихкода
//  ДанныеВыбора    - Структура - данные уточнения номенклатуры
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
//  РезультатОбработки    - Структура - Результат обработки штрихкода.
Процедура ОбработатьУточнениеДанных(ДанныеШтрихкода, ДанныеВыбора, ПараметрыСканирования, РезультатОбработки) Экспорт
	
	Описание = ОбщегоНазначенияИС.ОписаниеНоменклатуры(ДанныеШтрихкода.Номенклатура).Получить(ДанныеШтрихкода.Номенклатура);
	Если Описание = Неопределено Тогда
		КоличествоВПотребительскойУпаковке = 0;
	Иначе
		КоличествоВПотребительскойУпаковке = Описание.КоличествоВПотребительскойУпаковке;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеШтрихкода.КоличествоПотребительскихУпаковок) Тогда
		Если ДанныеШтрихкода.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			ДанныеШтрихкода.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
			ДанныеШтрихкода.КоличествоПотребительскихУпаковок = 1;
			ДанныеШтрихкода.Коэффициент = КоличествоВПотребительскойУпаковке;
		КонецЕсли;
	КонецЕсли;
	
	ШтрихкодированиеИСМПСлужебный.ОбработатьУточнениеДанныхЧастичноеВыбытие(ДанныеВыбора, ДанныеШтрихкода, ПараметрыСканирования);
	
КонецПроцедуры

// Формирует данные по неизвестным кодам табачных пачек и заполняет данные по штрихкодам.
// 
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
Процедура ЗаполнитьДанныеНеизвестнойМаркируемойПродукции(ДанныеПоШтрихкодам, ПараметрыСканирования) Экспорт
	
	ШтрихкодированиеОбщегоНазначенияМОТП.ДобавитьКолонкиТаблицыДанныеКодовМаркировки(
		ДанныеПоШтрихкодам, ПараметрыСканирования);
	
	МассивСтрокСЗапросомСтатусовМОТП  = Новый Массив;
	МассивСтрокБезЗапросаСтатусовМОТП = Новый Массив;
	
	Для Каждого СтрокаДанныхКодовМаркировки Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл

		ЗапрашиватьДанныеИСМП  = ОбщегоНазначенияИСМПКлиентСервер.ЗначениеПараметраСканированияЗапрашиватьДанныеСервисаИСМП(
			ПараметрыСканирования, СтрокаДанныхКодовМаркировки.ОтключитьЗапросВСервисПоОперацииИПродукции);
		
		Если ЗапрашиватьДанныеИСМП Тогда
			МассивСтрокСЗапросомСтатусовМОТП.Добавить(СтрокаДанныхКодовМаркировки);
		Иначе
			МассивСтрокБезЗапросаСтатусовМОТП.Добавить(СтрокаДанныхКодовМаркировки);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСтрокСЗапросомСтатусовМОТП.Количество() Тогда
		ЗаполнитьДанныеНеизвестныхТабачныхПачекСЗапросомСведенийМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования, МассивСтрокСЗапросомСтатусовМОТП);
	КонецЕсли;
	
	Если МассивСтрокБезЗапросаСтатусовМОТП.Количество() Тогда
		ЗаполнитьДанныеНеизвестныхТабачныхПачекБезЗапросаСведенийМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования, МассивСтрокБезЗапросаСтатусовМОТП);
	КонецЕсли;
	
КонецПроцедуры

// Приводит дерево упаковок и таблицу маркированные товары к детализации, которая указана в параметрах сканирования.
//
// Параметры:
//  ВложенныеШтрихкоды - Структура - Включает в себя таблицу значений "Маркированные товары" и "Дерево упаковок".
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования.
//  ДанныеКодовМаркировки - Неопределено, ТаблицаЗначений - связанные данные кодов маркировки.
Процедура ПривестиВложенныеШтрихкодыКТребуемомуВидуДетализации(ВложенныеШтрихкоды, ПараметрыСканирования, ДанныеКодовМаркировки = Неопределено) Экспорт
	
	Детализация = ПараметрыСканирования.ДетализацияСтруктурыХранения;
	
	СозданиеНаборов = ПараметрыСканирования.СозданиеНаборов;
	
	ДопустимыНаборы = Ложь;
	Для Каждого ВидПродукции Из ПараметрыСканирования.ДопустимыеВидыПродукции Цикл
		Если КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииИспользуетНаборы(ВидПродукции) Тогда
			ДопустимыНаборы = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Полная детализация требуется для того, что бы в ДанныхКодовМаркировки можно
	// было найти информацию о вложенных единицах. В противном случае разрывается связь
	// между кодами из сервиса и считанными штрихкодами.
	Если Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки
		Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими Тогда
		Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.Полная;
	КонецЕсли;
	
	Если (Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.Полная
		Или Не ЗначениеЗаполнено(Детализация))
		И (Не ДопустимыНаборы Или (ДопустимыНаборы И СозданиеНаборов)) Тогда
		Возврат;
	КонецЕсли;
	
	ДеревоУпаковок = ВложенныеШтрихкоды.ДеревоУпаковок;
	Если Не ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева Тогда
		МаркированныеТовары = ВложенныеШтрихкоды.МаркированныеТовары;
	КонецЕсли;
	
	МассивУдаляемыхСтрок = Новый Массив;

	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		
		Если Не (ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияИСМП(СтрокаДерева.ВидПродукции, Истина) // Все виды продукции ИС МП и МОТП
			Или Не ЗначениеЗаполнено(СтрокаДерева.ВидПродукции)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если
			// Если детализация полная - любые упаковки добавляются в дерево упаковок.
			(Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.Полная
				Или Не ЗначениеЗаполнено(Детализация))
			
			// Если детализация - палеты с коробками, то все верхнеуровневые упаковки добавляются в дерево упаковок.
			Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
			
			// Если детализация - коробки с блоками, то все верхнеуровневые упаковки добавляются в дерево упаковок.
			Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками
			
			// Если детализация - блоки с пачками или блоки, то верхнеуровневые упаковки добавляются в дерево
			// упаковок только в случае если они являются блоками или пачками.
			Или ((Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими
					Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки
					Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки)
				И СтрокаДерева.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Логистическая) Тогда
				
				Если ((СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Или СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор)
					И (Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками
						Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
						Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки))
					Или (СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор И Не СозданиеНаборов) Тогда
					
					Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
						УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, МаркированныеТовары);
						УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
					КонецЦикла;
					
					СтрокаДерева.Строки.Очистить();
					Продолжить;
					
				КонецЕсли;
				
				Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
					И Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами Тогда
					
					GTIN = СтрокаДерева.GTIN;
					
					Если ЗначениеЗаполнено(GTIN) Тогда
						
						Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
							УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, МаркированныеТовары);
							УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
						КонецЦикла;
						
						СтрокаДерева.Строки.Очистить();
						Продолжить;
						
					КонецЕсли;
					
				КонецЕсли;
				
		ИначеЕсли СтрокаДерева.ВидУпаковки <> Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет Тогда
			
			МассивУдаляемыхСтрок.Добавить(СтрокаДерева);
			
		КонецЕсли;
		
		ОпределитьУдаляемыеСтрокиДереваПоДетализации(
			СтрокаДерева.Строки, ПараметрыСканирования, МассивУдаляемыхСтрок, МаркированныеТовары, ДанныеКодовМаркировки);
		
	КонецЦикла;
	
	Если МассивУдаляемыхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСтрокиДереваУпаковокПоДетализации(
		ДеревоУпаковок,
		МассивУдаляемыхСтрок,
		МаркированныеТовары,
		ДанныеКодовМаркировки);
	
	Если Не ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева Тогда
		ВложенныеШтрихкоды.МаркированныеТовары = МаркированныеТовары;
	КонецЕсли;
	ВложенныеШтрихкоды.ДеревоУпаковок      = ДеревоУпаковок;
	
КонецПроцедуры

// Дополнение полученных данных штрихкодов данными, которые актуальны для табачной продукции.
// 
// Параметры:
//  ДанныеПоШтрихкодам    - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
//  ПараметрыДополнения   - Неопределено - Поддержка обратной совместимости.
//                        - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыДополненияВложенныхШтрихкодовУпаковок.
//  ЗаполнятьСтрокиДерева - Булево - заполнять строки дерева упаковок.
Процедура ДополнитьДанныеПоШтрихкодамСпецификой(ДанныеПоШтрихкодам, ПараметрыСканирования, ПараметрыДополнения = Неопределено, ЗаполнятьСтрокиДерева = Ложь) Экспорт
	
	МассивСтрокСЗапросомСтатусовМОТП  = Новый Массив;
	МассивСтрокБезЗапросаСтатусовМОТП = Новый Массив;
	
	ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП = Неопределено;
	Для Каждого СтрокаДанныхКодовМаркировки Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		
		Если СтрокаДанныхКодовМаркировки.ЭтоШтрихкодНоменклатуры Тогда
			Продолжить;
		КонецЕсли;
		
		ЗапрашиватьДанныеИСМП = ОбщегоНазначенияИСМПКлиентСервер.ЗначениеПараметраСканированияЗапрашиватьДанныеСервисаИСМП(
			ПараметрыСканирования,
			СтрокаДанныхКодовМаркировки.ОтключитьЗапросВСервисПоОперацииИПродукции,
			ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП);
		
		Если ЗапрашиватьДанныеИСМП Тогда
			МассивСтрокСЗапросомСтатусовМОТП.Добавить(СтрокаДанныхКодовМаркировки);
		Иначе
			МассивСтрокБезЗапросаСтатусовМОТП.Добавить(СтрокаДанныхКодовМаркировки);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСтрокСЗапросомСтатусовМОТП.Количество() Тогда
		
		ДополнитьДанныеПоШтрихкодамСпецификойСЗапросомСтатусовМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования, МассивСтрокСЗапросомСтатусовМОТП);
		
		Если ДанныеПоШтрихкодам.ВложенныеШтрихкоды <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ДанныеПоШтрихкодам.ВложенныеШтрихкоды, ДанныеПоШтрихкодам, "ТекстОшибки, ЕстьОшибки, ТребуетсяОбновлениеКлючаСессии");
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивСтрокБезЗапросаСтатусовМОТП.Количество() Тогда
		ШтрихкодированиеИСМПСлужебный.ДополнитьДанныеПоШтрихкодамСпецификойБезЗапросаСтатусовИСМП(
			ДанныеПоШтрихкодам, ПараметрыСканирования, МассивСтрокБезЗапросаСтатусовМОТП);
	КонецЕсли;
	
	ШтрихкодированиеИСМПСлужебный.ЗаполнитьПредставлениеНоменклатурыОстаточныхШтрихкодов(
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ПараметрыСканирования);
	
	Если ДанныеПоШтрихкодам.Свойство("ВложенныеШтрихкоды")
		И ДанныеПоШтрихкодам.ВложенныеШтрихкоды <> Неопределено Тогда
		
		ШтрихкодированиеИСМПСлужебный.НормализоватьДанныеВложенныхШтрихкодов(
			ДанныеПоШтрихкодам.ВложенныеШтрихкоды,
			ПараметрыСканирования,
			ДанныеПоШтрихкодам.ДанныеКодовМаркировки,
			ЗаполнятьСтрокиДерева);
		
	КонецЕсли;
	
	ШтрихкодированиеИСМПСлужебный.ДополнитьДанныеПоШтрихкодамДаннымиПулаКодовМаркировки(
		ДанныеПоШтрихкодам, ПараметрыСканирования);
	
	ШтрихкодированиеИСМПСлужебный.ДополнитьДанныеПоШтрихкодамПараметрамиДополнения(
		ДанныеПоШтрихкодам, ПараметрыСканирования, ПараметрыДополнения);
	
	// Заполнение количества пачек по коэффициентам упаковок и коэффициентам из таблицы Описание GTIN
	СтрокиДляЗаполненияСЗапросомИСМП  = Новый Массив;
	СтрокиДляЗаполненияБезЗапросаИСМП = Новый Массив;
	
	ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП = Неопределено;
	Для Каждого СтрокаДанных Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		
		ЗапрашиватьДанныеИСМП = ОбщегоНазначенияИСМПКлиентСервер.ЗначениеПараметраСканированияЗапрашиватьДанныеСервисаИСМП(
			ПараметрыСканирования,
			СтрокаДанных.ОтключитьЗапросВСервисПоОперацииИПродукции,
			ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП);
		
		Если ЗначениеЗаполнено(СтрокаДанных.ШтрихкодУпаковки) Тогда
			
			Если ЗапрашиватьДанныеИСМП Тогда
				СтрокиДляЗаполненияСЗапросомИСМП.Добавить(СтрокаДанных);
			Иначе
				СтрокиДляЗаполненияБезЗапросаИСМП.Добавить(СтрокаДанных);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрокиДляЗаполненияСЗапросомИСМП.Количество() Тогда
		// Заполнить только коэффициенты упаковок, если не заполнены ранее
		ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(СтрокиДляЗаполненияСЗапросомИСМП, ПараметрыСканирования, Ложь);
	КонецЕсли;
	
	Если СтрокиДляЗаполненияБезЗапросаИСМП.Количество() Тогда
		// Заполнить коэффициенты упаковок и количество вложенных пачек
		ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(СтрокиДляЗаполненияБезЗапросаИСМП, ПараметрыСканирования);
	КонецЕсли;
	
	ДополнитьДанныеПоШтрихкодамСпецификойЧастичногоВыбытия(ДанныеПоШтрихкодам, ПараметрыСканирования);
	ДополнитьДанныеПоШтрихкодамСпецификойМинимальныхЦен(ДанныеПоШтрихкодам, ПараметрыСканирования);
	
КонецПроцедуры

Процедура РасширеннаяПроверкаНаОшибкиПоПравилам(ДанныеПоШтрихкодам, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ЕстьОшибки) Экспорт
	
	ПредставленияСтатусов = Неопределено;

	Если ДанныеПоШтрихкодам.ВложенныеШтрихкоды <> Неопределено Тогда

		ДеревоУпаковок = ДанныеПоШтрихкодам.ВложенныеШтрихкоды.ДеревоУпаковок;

		ПроверитьНаОшибкиСтрокиДерева(
			ДеревоУпаковок.Строки, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ДанныеПоШтрихкодам, ЕстьОшибки);
		ДанныеПоШтрихкодам.ЕстьОшибкиВДеревеУпаковок = ЕстьОшибки;

		// Приоритет 1.
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольПолногоКодаМаркировки")
			И ПравилаПроверкиНаОшибки.КонтрольПолногоКодаМаркировки.Количество() > 0 Тогда

			Для Каждого ЭлементДанных Из ПравилаПроверкиНаОшибки.КонтрольПолногоКодаМаркировки Цикл

				Если ЭлементДанных.СтрокаДерева.ЕстьОшибки Тогда
					Продолжить;
				КонецЕсли;

				ЭлементДанных.СтрокаДерева.ТекстОшибки = ЭлементДанных.ТекстОшибки;
				ЭлементДанных.СтрокаДерева.ЕстьОшибки  = Истина;

			КонецЦикла;

			ПравилаПроверкиНаОшибки.КонтрольПолногоКодаМаркировки.Очистить();

		КонецЕсли;

		// Приоритет 2.
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСтатусов")
			И ПравилаПроверкиНаОшибки.КонтрольСтатусов.СтрокиСОшибками.Количество() > 0 Тогда

			Если ПредставленияСтатусов = Неопределено Тогда
				ПредставленияСтатусов = ШтрихкодированиеОбщегоНазначенияИСМП.ПредставленияСтатусов();
			КонецЕсли;

			Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтрольСтатусов.СтрокиСОшибками Цикл

				Если СтрокаДерева.ЕстьОшибки Тогда
					Продолжить;
				КонецЕсли;

				ПредставлениеСтатуса = ПредставленияСтатусов.Получить(СтрокаДерева.Статус);
				Если ПредставлениеСтатуса = Неопределено Тогда
					ПредставлениеСтатуса = НСтр("ru='<Неопределен>'");
				КонецЕсли;

				СтрокаДерева.ТекстОшибки = СтрШаблон(НСтр("ru = 'Статус: %1'"), ПредставлениеСтатуса);
				СтрокаДерева.ЕстьОшибки  = Истина;
				
				ЗапретитьОтключениеКонтроляСтатусов = СтрокаДерева.ПодлежитПроверкеРазрешительногоРежима;
				СписокОрганизацийБлокировки         = "";
				
				Если Не СтрокаДерева.СписокОрганизацийБлокировкиКМ = Неопределено Тогда
					
					ОрганизацииБлокировки = 
						ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ОрганыВластиУстанавливающиеБлокировкуНаКМПоДаннымГИСМТ(СтрокаДерева.СписокОрганизацийБлокировкиКМ);
					СписокОрганизацийБлокировки = СтрСоединить(ОрганизацииБлокировки, ", ");
					
				КонецЕсли;
				
				ВидДополнения = ШтрихкодированиеИСМПСлужебный.ВидДополненияПредставленияОшибки();
				ВидДополнения.Статус                              = СтрокаДерева.Статус;
				ВидДополнения.ОсобоеСостояние                     = СтрокаДерева.ОсобоеСостояние;
				ВидДополнения.СписокОрганизацийБлокировкиКМ       = СписокОрганизацийБлокировки;
				ВидДополнения.ВидОперацииИСМП                     = ПараметрыСканирования.ВидОперацииИСМП;
				ВидДополнения.ЗапретитьОтключениеКонтроляСтатусов = ЗапретитьОтключениеКонтроляСтатусов;
				ШтрихкодированиеИСМПКлиентСервер.ДополнитьПредставлениеОшибки(СтрокаДерева, ВидДополнения);

			КонецЦикла;

			ПравилаПроверкиНаОшибки.КонтрольСтатусов.СтрокиСОшибками.Очистить();

		КонецЕсли;

		// Приоритет 3.
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольПустыхУпаковок")
			И ПравилаПроверкиНаОшибки.КонтрольПустыхУпаковок.Количество() > 0 Тогда

			Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтрольПустыхУпаковок Цикл

				Если СтрокаДерева.ЕстьОшибки Тогда
					Продолжить;
				КонецЕсли;

				Если СтрокаДерева.Коэффициент = Неопределено Тогда
					Продолжить;
				КонецЕсли;

				СтрокаДерева.ТекстОшибки = НСтр("ru = 'Пустая упаковка'");
				СтрокаДерева.ЕстьОшибки = Истина;

			КонецЦикла;

			ПравилаПроверкиНаОшибки.КонтрольПустыхУпаковок.Очистить();

		КонецЕсли;

		// Приоритет 4.
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольВладельца")
			И ПравилаПроверкиНаОшибки.КонтрольВладельца.Количество() > 0 Тогда

			Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтрольВладельца Цикл

				Если СтрокаДерева.ЕстьОшибки Тогда
					Продолжить;
				КонецЕсли;
				
				ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = (ЗначениеЗаполнено(СтрокаДерева.РазрешительныйРежимДатаЗапросаГИСМТ)
					И Не ЗначениеЗаполнено(СтрокаДерева.РазрешительныйРежимИдентификаторЗапросаГИСМТ));
				
				Если ПродажаРазрешенаВОтсутствиеОтветаГИСМТ
					Или СтрокаДерева.ПродажаПоДаннымОффлайнРежима
					Или СтрокаДерева.ТребуетсяПроверкаРазрешительногоРежимаНаЛокальномМодуле Тогда
					Продолжить;
				КонецЕсли;
				
				ИННВладельцаПредставление = СтрокаДерева.ИННВладельца;
				
				Если ЗначениеЗаполнено(СтрокаДерева.Владелец) Тогда
					ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Владелец: %1 (%2)'"),
						СтрокаДерева.Владелец,
						ИННВладельцаПредставление);
				ИначеЕсли ЗначениеЗаполнено(СтрокаДерева.ИННВладельца) Тогда
					ТекстОшибки = СтрШаблон(
						НСтр("ru = 'ИНН владельца: %1'"),
						ИННВладельцаПредставление);
				Иначе
					ТекстОшибки = НСтр("ru = 'Принадлежит другой организации'");
				КонецЕсли;

				СтрокаДерева.ТекстОшибки = ТекстОшибки;
				СтрокаДерева.ЕстьОшибки  = Истина;
				
				ВидДополнения = ШтрихкодированиеИСМПСлужебный.ВидДополненияПредставленияОшибки();
				ВидДополнения.Владелец                            = Истина;
				ВидДополнения.ВидОперацииИСМП                     = ПараметрыСканирования.ВидОперацииИСМП;
				ШтрихкодированиеИСМПКлиентСервер.ДополнитьПредставлениеОшибки(СтрокаДерева, ВидДополнения);

			КонецЦикла;

			ПравилаПроверкиНаОшибки.КонтрольВладельца.Очистить();

		КонецЕсли;

		// Приоритет 5.
		Если ПравилаПроверкиНаОшибки.Свойство("КонтролироватьРасхождениеСоставаУпаковокМеждуИБиИСМП") Тогда

			ЕстьРасхождения = Ложь;
			ШтрихкодированиеИС.ВыявитьРасхожденияВСоставахДеревьев(
				ДеревоУпаковок, ДанныеПоШтрихкодам.ДеревоПоДаннымСервиса,
				ЕстьРасхождения, ПараметрыСканирования);

			Если ЕстьРасхождения Тогда
				// Правило является исключением, проверка выполняется после завершения всех остальных проверок.
				// Установка флага обязательна.
				ЕстьОшибки = Истина;
				ДанныеПоШтрихкодам.ЕстьОшибкиВДеревеУпаковок = Истина;
			КонецЕсли;

		КонецЕсли;

		ШтрихкодированиеОбщегоНазначенияИСМП.ОписаниеОшибокКонтроляЧастичногоВыбытия(ПравилаПроверкиНаОшибки, ПараметрыСканирования);

		Если ПравилаПроверкиНаОшибки.Свойство("КонтролироватьСоставЛогистическихУпаковок")
			И ПравилаПроверкиНаОшибки.КонтролироватьСоставЛогистическихУпаковок.Количество() Тогда

			Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтролироватьСоставЛогистическихУпаковок Цикл

				Если СтрокаДерева.ЕстьОшибки Тогда
					Продолжить;
				КонецЕсли;

				СтрокаДерева.ЕстьОшибки  = Истина;
				СтрокаДерева.ТекстОшибки = НСтр("ru = 'Логистическая упаковка может содержать только один вид упаковок (логистические, групповые или потребительские)'");

				Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл

					Если ВложеннаяСтрокаДерева.ЕстьОшибки Тогда
						Продолжить;
					КонецЕсли;

					ВложеннаяСтрокаДерева.ЕстьОшибки  = Истина;
					ВложеннаяСтрокаДерева.ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Вид упаковки %1 отличается от вложенных упаковок'"),
						ВложеннаяСтрокаДерева.ВидУпаковки);

				КонецЦикла;

			КонецЦикла;
			
			ПравилаПроверкиНаОшибки.КонтролироватьСоставЛогистическихУпаковок.Очистить();

		КонецЕсли;

		Если ПравилаПроверкиНаОшибки.Свойство("КонтролироватьСоставГрупповыхУпаковок")
			И ПравилаПроверкиНаОшибки.КонтролироватьСоставГрупповыхУпаковок.Количество() Тогда

			Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтролироватьСоставГрупповыхУпаковок Цикл

				Если СтрокаДерева.ЕстьОшибки Тогда
					Продолжить;
				КонецЕсли;

				СтрокаДерева.ЕстьОшибки  = Истина;
				СтрокаДерева.ТекстОшибки = НСтр("ru = 'Групповая упаковка не может содержать разные наименования продукции'");

				Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл

					Если ВложеннаяСтрокаДерева.ЕстьОшибки Тогда
						Продолжить;
					КонецЕсли;

					ВложеннаяСтрокаДерева.ЕстьОшибки  = Истина;
					ВложеннаяСтрокаДерева.ТекстОшибки = НСтр("ru = 'Номенклатура отличается от номенклатуры вложенных упаковок'");

				КонецЦикла;
				
			КонецЦикла;

			ПравилаПроверкиНаОшибки.КонтролироватьСоставГрупповыхУпаковок.Очистить();

		КонецЕсли;

		Если ПравилаПроверкиНаОшибки.Свойство("КонтролироватьВложенныеТипыШтрихкодаГрупповыхУпаковок")
			И ПравилаПроверкиНаОшибки.КонтролироватьВложенныеТипыШтрихкодаГрупповыхУпаковок.Количество() Тогда

			Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтролироватьВложенныеТипыШтрихкодаГрупповыхУпаковок Цикл
				
				Если СтрокаДерева.ЕстьОшибки Тогда
					Продолжить;
				КонецЕсли;

				СтрокаДерева.ЕстьОшибки  = Истина;
				СтрокаДерева.ТекстОшибки = НСтр("ru = 'Групповая упаковка не может содержать разные шаблоны кодов маркировки.'");

				Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл

					Если ВложеннаяСтрокаДерева.ЕстьОшибки Тогда
						Продолжить;
					КонецЕсли;

					ВложеннаяСтрокаДерева.ЕстьОшибки  = Истина;
					ВложеннаяСтрокаДерева.ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Тип штрихкода %1 отличается от типа штрихкода вложенных упаковок'"),
						ВложеннаяСтрокаДерева.ТипШтрихкода);

				КонецЦикла;

			КонецЦикла;

			ПравилаПроверкиНаОшибки.КонтролироватьВложенныеТипыШтрихкодаГрупповыхУпаковок.Очистить();

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура РасширенныеПроверкиПоСтрокеДанныхМОТП(СтрокаДанных, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ЕстьОшибки) Экспорт

	Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСпособаВводаВОборот") Тогда

		Если ЗначениеЗаполнено(СтрокаДанных.СпособВводаВОборот) // Агрегация, новые упаковки.
			И СтрокаДанных.СпособВводаВОборот <> ПараметрыСканирования.ДопустимыйСпособВводаВОборот Тогда

			ЕстьОшибки = Истина;
			ПравилаПроверкиНаОшибки.КонтрольСпособаВводаВОборот.Добавить(СтрокаДанных);

		КонецЕсли;

	КонецЕсли;

	Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСпособаВводаВОборотОффлайн") Тогда

		Если СтрокаДанных.ЭтоКодВводаОстатков
			И ПараметрыСканирования.ДопустимыйСпособВводаВОборот <> Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков Тогда

			ЕстьОшибки = Истина;
			ПравилаПроверкиНаОшибки.КонтрольСпособаВводаВОборотОффлайн.Добавить(СтрокаДанных);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// Заполняет представления статусов, владельцев и прочую дополнительную информацию
//
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
Процедура ЗаполнитьПредставленияДанных(ДанныеПоШтрихкодам, ПараметрыСканирования) Экспорт
	
	МассивИНН = ДанныеПоШтрихкодам.ДанныеКодовМаркировки.ВыгрузитьКолонку("ИННВладельца");
	МассивИНН = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивИНН);
	Если МассивИНН.Количество() > 0 Тогда

		КонтрагентыПоИНН = ИнтеграцияИСМП.КонтрагентыПоСпискуИНН(МассивИНН);
		ОрганизацииПоИНН = ИнтеграцияИСМП.ОрганизацииПоСпискуИНН(МассивИНН);
		Для Каждого СтрокаДанных Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл

			Если Не ЗначениеЗаполнено(СтрокаДанных.Владелец)
				И ЗначениеЗаполнено(СтрокаДанных.ИННВладельца) Тогда
				СтрокаДанных.Владелец = КонтрагентыПоИНН.Получить(СтрокаДанных.ИННВладельца);
				Если Не ЗначениеЗаполнено(СтрокаДанных.Владелец) Тогда
					СтрокаДанных.Владелец = ОрганизацииПоИНН.Получить(СтрокаДанных.ИННВладельца);
				КонецЕсли;
				Если СтрокаДанных.СтрокаДерева <> Неопределено Тогда
					СтрокаДанных.СтрокаДерева.Владелец = СтрокаДанных.Владелец;
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

// Реализует обработку действий пользователя. Возвращает результат обработки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  Действие - Строка - Идентификатор действия.
//  Параметры - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьПараметрыОбработкиВыбора).
// Возвращаемое значение:
//  (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьРезультатОбработкиШтрихкода).
Функция ВыполнитьДействие(Форма, Действие, Параметры) Экспорт

	Если Действие = "ОбработатьВыборСерии" Тогда
		
		РезультатВыбора             = Параметры.РезультатВыбора;
		РезультатОбработкиШтрихкода = Параметры.РезультатОбработкиШтрихкода;
		КэшированныеЗначения        = Параметры.КэшированныеЗначения;
		РезультатВыбора = ШтрихкодированиеИСМПСлужебный.ОбработатьВыборСерии(Форма, РезультатВыбора, РезультатОбработкиШтрихкода, КэшированныеЗначения);
		
		Возврат РезультатВыбора;
		
	КонецЕсли;
	
КонецФункции

// Получает данные из государтсвенных информационных систем и заполняет данные для упаковок, о которых нет никакой 
// информации в справочнике Штрихкоды упаковок.
// 
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
Процедура ЗаполнитьДанныеНеизвестныхУпаковок(ДанныеПоШтрихкодам, ПараметрыСканирования) Экспорт
	
	МассивСтрокТаблицыСЗапросомИСМП  = Новый Массив;
	МассивСтрокТаблицыБезЗапросаИСМП = Новый Массив;
	
	Для Каждого СтрокаДанных Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		
		Если СтрокаДанных.ОбработанСОшибками Тогда
			Продолжить;
		КонецЕсли;
		
		Если ГрупповаяОбработкаШтрихкодовИС.ЭтоАгрегатТСД(СтрокаДанных.Штрихкод) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ВидПродукции)
			И Не ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(СтрокаДанных.ВидПродукции) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДанных.Идентифицирован Тогда
			Если Не ШтрихкодированиеИСМПСлужебный.СтруктураДанныхТребуетЗагрузкиВложенныхКодовМаркировки(СтрокаДанных, ПараметрыСканирования) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ПрисутствуетТабачнаяПродукция = ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(СтрокаДанных.ВидПродукции)
			Или ШтрихкодированиеОбщегоНазначенияИС.ПрисутствуетТабачнаяПродукция(СтрокаДанных.ВидыПродукцииКодаМаркировки);
		ЭтоЛогистическаяИлиГрупповаяУпаковка = ОбщегоНазначенияИСКлиентСервер.ЭтоУпаковкаПоВиду(СтрокаДанных.ВидУпаковки,, Ложь)
			Или (Не ЗначениеЗаполнено(СтрокаДанных.ВидУпаковки)
				И СтрокаДанных.ДанныеРазбора <> Неопределено
				И ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ВозможнаГрупповаяУпаковкаИлиНабор(
					СтрокаДанных.ДанныеРазбора.ВидУпаковки, СтрокаДанных.ДанныеРазбора));
		
		// В каких случаях требуется выдавать сообщение об ошибке, если ЗапрашиватьДанныеНеизвестныхУпаковок = Ложь
		// - если в упаковке нет GTIN
		// - В зависимости от детализации:
		//     * Полная                                          - сканируем короб или блок
		//     * Индивидуальные потребительские упаковки (пачки) - сканируем короб или блок
		//     * Блоки с пачками                                 - сканируем короб или блок
		//     * Короба с блоками                                - сканируем короб
		//     * Потребительские упаковки                        - сканируем короб
		Если ПрисутствуетТабачнаяПродукция
			И Не ОбщегоНазначенияИСМПКлиентСервер.ЗначениеПараметраСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования)
			И Не ГрупповаяОбработкаШтрихкодовИС.ЭтоАгрегатТСД(СтрокаДанных.Штрихкод)
			И Не ПараметрыСканирования.РазрешенаОбработкаНеНайденныхЛогистическихУпаковок Тогда
			
			ТекстОшибки = Неопределено;
			
			Если ЭтоЛогистическаяИлиГрупповаяУпаковка
				И Не ЗначениеЗаполнено(СтрокаДанных.GTIN) Тогда
				
				ТекстОшибки = НСтр(
					"ru = 'В коде упаковки не содержится GTIN, невозможно определить
					      |количество вложенных пачек.
					      |Включите опцию ""Контроль статусов кодов маркировки""
					      |в панели администрирования
					      |""Маркировка (Честный знак) - Настройки и справочники - Контроль кодов маркировки""
					      |или отсканируйте содержимое упаковки.'");
				
			КонецЕсли;
			
			Если ЭтоЛогистическаяИлиГрупповаяУпаковка
				И (ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.Полная
				Или Не ЗначениеЗаполнено(ПараметрыСканирования.ДетализацияСтруктурыХранения))
				И ПараметрыСканирования.ВидОперацииИСМП <> Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки Тогда
				
				ТекстОшибки = НСтр(
					"ru = 'В режиме детализации: ""Полная"" обработка логистических упаковок и блоков
					      |невозможна, так как выключена опция
					      |""Контроль статусов кодов маркировки"".
					      |Включите опцию в панели администрирования
					      |""Маркировка (Честный знак) - Настройки и справочники - Контроль кодов маркировки""
					      |или отсканируйте вложенные пачки
					      |или измените режим детализации на ""Коробки с блоками"".'");
				
			КонецЕсли;
			
			Если ЭтоЛогистическаяИлиГрупповаяУпаковка
				И ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки Тогда
				
				ТекстОшибки = НСтр(
					"ru = 'В режиме детализации: ""Пачки"" обработка логистических упаковок и блоков
					      |невозможна, так как выключена опция
					      |""Контроль статусов кодов маркировки"".
					      |Включите опцию в панели администрирования
					      |""Маркировка (Честный знак) - Настройки и справочники - Контроль кодов маркировки""
					      |или отсканируйте вложенные пачки
					      |или измените режим детализации на ""Коробки с блоками"".'");
				
			КонецЕсли;
			
			Если ЭтоЛогистическаяИлиГрупповаяУпаковка
				И ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими Тогда
				
				ТекстОшибки = НСтр(
					"ru = 'В режиме детализации: ""Блоки с пачками"" обработка логистических упаковок
					      |и блоков невозможна, так как выключена опция
					      |""Контроль статусов кодов маркировки"".
					      |Включите опцию в панели администрирования
					      |""Маркировка (Честный знак) - Настройки и справочники - Контроль кодов маркировки""
					      |или отсканируйте вложенные пачки
					      |или измените режим детализации на ""Коробки с блоками"".'");
				
			КонецЕсли;
			
			Если СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
				И ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками Тогда
				
				ТекстОшибки = НСтр(
					"ru = 'В режиме детализации: ""Коробки с блоками"" обработка логистических упаковок
					      |невозможна, так как выключена опция
					      |""Контроль статусов кодов маркировки"".
					      |Включите опцию в панели администрирования
					      |""Маркировка (Честный знак) - Настройки и справочники - Контроль кодов маркировки""
					      |или отсканируйте вложенные блоки
					      |или измените режим детализации на ""Палеты с коробками"".'");
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				Если ПустаяСтрока(СтрокаДанных.ТекстОшибки) Тогда
					СтрокаДанных.ТекстОшибки = ТекстОшибки;
				Иначе
					СтрокаДанных.ТекстОшибки = СтрШаблон(
						"%1
						|%2", СтрокаДанных.ТекстОшибки, ТекстОшибки);
				КонецЕсли;
				Если СтрокаДанных.СтрокаДерева <> Неопределено Тогда
					ДанныеПоШтрихкодам.ЕстьОшибкиВДеревеУпаковок = Истина;
					СтрокаДанных.СтрокаДерева.ЕстьОшибки = Истина;
					СтрокаДанных.СтрокаДерева.ТекстОшибки = ТекстОшибки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		ЗапрашиватьДанныеИСМП = ОбщегоНазначенияИСМПКлиентСервер.ЗначениеПараметраСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(
			ПараметрыСканирования, СтрокаДанных.ОтключитьЗапросВСервисПоОперацииИПродукции);
		
		Если ЭтоЛогистическаяИлиГрупповаяУпаковка
			И Не СтрокаДанных.Идентифицирован
			И ПрисутствуетТабачнаяПродукция
			И Не ЗначениеЗаполнено(СтрокаДанных.ТекстОшибки) Тогда
			
			Если ЗапрашиватьДанныеИСМП Тогда
				МассивСтрокТаблицыСЗапросомИСМП.Добавить(СтрокаДанных);
			Иначе
				МассивСтрокТаблицыБезЗапросаИСМП.Добавить(СтрокаДанных);
			КонецЕсли;
			
			СтрокаДанных.Идентифицирован = ЗначениеЗаполнено(СтрокаДанных.GTIN);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСтрокТаблицыСЗапросомИСМП.Количество() = 0 И МассивСтрокТаблицыБезЗапросаИСМП.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// В маркировке товаров разрешено добавлять пустые упаковки при выключенном запросе статусов
	Если МассивСтрокТаблицыСЗапросомИСМП.Количество() Тогда
		
		Результат = ШтрихкодированиеИСМПСлужебный.ДеревоУпаковокПоДаннымИСМП(МассивСтрокТаблицыСЗапросомИСМП, ПараметрыСканирования);
		
		Если Не ПустаяСтрока(Результат.ТекстОшибки) Тогда
			
			ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
			ДанныеПоШтрихкодам.ТекстОшибки                    = Результат.ТекстОшибки;
			ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = Результат.ТребуетсяОбновлениеКлючаСессии;
			
			Возврат;
			
		КонецЕсли;
		
		Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
			И ПараметрыСканирования.ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТП Тогда
			
			РезультатПроверкиСеройЗоны = ПроверитьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодов(
				Результат, ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ПараметрыСканирования);
			
			Если Не ПустаяСтрока(РезультатПроверкиСеройЗоны.ТекстОшибки) Тогда
				
				ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
				ДанныеПоШтрихкодам.ТекстОшибки                    = РезультатПроверкиСеройЗоны.ТекстОшибки;
				ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = РезультатПроверкиСеройЗоны.ТребуетсяОбновлениеКлючаСессии;
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПараметрыОбработки = Новый Структура;
		ПараметрыОбработки.Вставить("ЭтоДополнениеСпецификойПотребительскихУпаковок",                 Ложь);
		ПараметрыОбработки.Вставить("ЭтоДополнениеСпецификойГрупповыхУпаковокИЛогистическихУпаковок", Истина);
		ПараметрыОбработки.Вставить("ЭтоЗаполнениеВложенныхШтрихкодов",                               Ложь);
		
		ШтрихкодированиеИСМПСлужебный.ОбработатьДеревоПолученноеИзИСМП(
			Результат.ДеревоУпаковок, ДанныеПоШтрихкодам, ПараметрыСканирования,
			ПараметрыОбработки);
		
	КонецЕсли;
	
	Если МассивСтрокТаблицыБезЗапросаИСМП.Количество() Тогда
		
		// Заполнить коэффициенты упаковок и количество вложенных пачек
		ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(МассивСтрокТаблицыБезЗапросаИСМП, ПараметрыСканирования);
		
	КонецЕсли;
	
	ШтрихкодированиеИСМПСлужебный.ДополнитьДанныеПоШтрихкодамДаннымиПулаКодовМаркировки(ДанныеПоШтрихкодам, ПараметрыСканирования);
	
КонецПроцедуры

Функция ПроверитьПотребительскиеУпаковкиНаВхождениеВСеруюЗону(ЭлементыДанных, ПараметрыСканирования)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	КандидатыВСеруюЗону = Новый Массив;
	Для Каждого ЭлементДанных Из ЭлементыДанных Цикл
		
		Если Не КонструкторИСМПКлиентСервер.ПоддерживаетсяСераяЗона(ЭлементДанных.ВидПродукции) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
			ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП;
		ИначеЕсли ЭлементДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор
			И ПараметрыСканирования.ДопустимыеСтатусыНаборовМОТП <> Неопределено Тогда
			ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыНаборовМОТП;
		ИначеЕсли ЭлементДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
			И ПараметрыСканирования.ДопустимыеСтатусыНаборовМОТП <> Неопределено Тогда
			ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыНаборовМОТП;
		Иначе
			ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыМОТП;
		КонецЕсли;
		
		Если ДопустимыеСтатусыМОТП.Найти(ЭлементДанных.Статус) = Неопределено Тогда
			КандидатыВСеруюЗону.Добавить(ЭлементДанных);
		КонецЕсли;
	
	КонецЦикла;
	
	Если КандидатыВСеруюЗону.Количество() = 0 Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	РезультатПроверки = ИнтерфейсМОТП.ПроверитьСеруюЗонуКодовМаркировки(КандидатыВСеруюЗону);
	Если РезультатПроверки.СостояниеСеройЗоны <> Неопределено Тогда
		
		Для Каждого ЭлементДанных Из КандидатыВСеруюЗону Цикл
			
			СостояниеСеройЗоны = РезультатПроверки.СостояниеСеройЗоны[ЭлементДанных];
			
			Если СостояниеСеройЗоны = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементДанных.ВСеройЗоне = СостояниеСеройЗоны.ВСеройЗоне;
			
		КонецЦикла;
		
	Иначе
		
		ВозвращаемоеЗначение.ТекстОшибки                    = РезультатПроверки.ТекстОшибки;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатПроверки.ТребуетсяОбновлениеКлючаСессии;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПроверитьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодов(Результат, ДанныеКодовМаркировки, ПараметрыСканирования) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	ШтрихкодыEAN = Новый Массив;
	Для Каждого СтрокаТЧ Из Результат.GTIN Цикл
		ШтрихкодыEAN.Добавить(РазборКодаМаркировкиИССлужебныйКлиентСервер.ШтрихкодEANИзGTIN(СтрокаТЧ.GTIN));
	КонецЦикла;
	
	ДанныеПоШтрихкодамEANРезультат = ШтрихкодированиеОбщегоНазначенияИС.ДанныеПоШтрихкодамEAN(ШтрихкодыEAN);
	ИнформацияПоШтрихкодамEAN = ДанныеПоШтрихкодамEANРезультат.ДанныеПоШтрихкодамEAN;
	
	СтандартнаяВложенностьУпаковок = Новый Соответствие;
	Для Каждого СтрокаТЧ Из ИнформацияПоШтрихкодамEAN Цикл
		СтандартнаяВложенностьУпаковок.Вставить(
			ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.GTINПоШтрихкодуEAN(СтрокаТЧ.ШтрихкодEAN),
			СтрокаТЧ.ПлановоеКоличествоПотребительскихУпаковок);
	КонецЦикла;
	
	КПолучениюОписанияGTIN = Новый Массив;
	Для Каждого СтрокаТЧ Из Результат.GTIN Цикл
		Если Не ЗначениеЗаполнено(СтандартнаяВложенностьУпаковок[СтрокаТЧ.GTIN]) Тогда
			КПолучениюОписанияGTIN.Добавить(СтрокаТЧ.GTIN);
		КонецЕсли;
	КонецЦикла;
	
	Если КПолучениюОписанияGTIN.Количество() > 0 Тогда
		КоэффициентыОписанияGTIN = РегистрыСведений.ОписаниеGTINИС.ПолучитьОписание(КПолучениюОписанияGTIN);
		Для Каждого КлючИЗначение Из КоэффициентыОписанияGTIN Цикл
			СтандартнаяВложенностьУпаковок.Вставить(
				КлючИЗначение.Ключ,
				КлючИЗначение.Значение.КоличествоПотребительскихУпаковок);
		КонецЦикла;
	КонецЕсли;
	
	КандидатыВСеруюЗону = Новый ТаблицаЗначений;
	КандидатыВСеруюЗону.Колонки.Добавить("СтрокаДерева");
	КандидатыВСеруюЗону.Колонки.Добавить("ОбработаноСерыхКодов", Новый ОписаниеТипов("Число"));
	КандидатыВСеруюЗону.Индексы.Добавить("СтрокаДерева");
	
	Для Каждого СтрокаДерева Из Результат.ДеревоУпаковок.Строки Цикл
		
		НайтиУпаковкиДляПроверкиНаВхождениеВСеруюЗону(
			СтрокаДерева, КандидатыВСеруюЗону, СтандартнаяВложенностьУпаковок, ПараметрыСканирования);
		
	КонецЦикла;
	
	Если КандидатыВСеруюЗону.Количество() = 0 Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	РезультатПроверки = ИнтерфейсМОТП.ПроверитьСеруюЗонуКодовМаркировки(КандидатыВСеруюЗону.ВыгрузитьКолонку("СтрокаДерева"));
	Если РезультатПроверки.СостояниеСеройЗоны <> Неопределено Тогда
		
		Для Каждого ЭлементДанных Из КандидатыВСеруюЗону Цикл
			
			СтрокаДерева = ЭлементДанных.СтрокаДерева;
			
			СостояниеСеройЗоны = РезультатПроверки.СостояниеСеройЗоны[СтрокаДерева];
			
			Если СостояниеСеройЗоны = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДерева.ВСеройЗоне        = СостояниеСеройЗоны.ВСеройЗоне;
			СтрокаДерева.СодержитСерыеКоды = СостояниеСеройЗоны.СодержитСерыеКоды;
			
			ИзменениеКоличествоПотребительскихУпаковок = 0;
			ОчиститьГрупповыеУпаковки = Истина;
			
			Если СостояниеСеройЗоны.СодержитСерыеКоды
				И Не ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП
				И Не ПараметрыСканирования.ЭтоОтчетПроизводственнойЛинии Тогда
				
				// Очистить вложенные упаковки, привести количество пачек к количеству, заданному произодителем
				ИзменениеКоличествоПотребительскихУпаковок = СостояниеСеройЗоны.КоличествоПотребительскихУпаковок - ЭлементДанных.ОбработаноСерыхКодов;
				Если ИзменениеКоличествоПотребительскихУпаковок <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ЭлементДанных.ОбработаноСерыхКодов = ЭлементДанных.ОбработаноСерыхКодов + ИзменениеКоличествоПотребительскихУпаковок;
				
				СтрокаДерева.КоличествоПотребительскихУпаковок = СтрокаДерева.КоличествоПотребительскихУпаковок + ИзменениеКоличествоПотребительскихУпаковок;
				Если СтрокаДерева.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Групповая Тогда
					ОчиститьГрупповыеУпаковки = Истина;
					СтрокаДерева.КоличествоГрупповыхУпаковок = 0;
				КонецЕсли;
				
				СтрокаДерева.Строки.Очистить();
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаДерева.ДатаПроизводства)
				И СтрокаДерева.ДатаПроизводства < ПараметрыСканирования.ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП
				И Не ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП
				И Не ПараметрыСканирования.ЭтоОтчетПроизводственнойЛинии Тогда
				
				// До первого июля не действует контроль...
				ИзменениеКоличествоПотребительскихУпаковок = СтандартнаяВложенностьУпаковок[СтрокаДерева.GTIN] - СтрокаДерева.КоличествоПотребительскихУпаковок;
				СтрокаДерева.КоличествоПотребительскихУпаковок = СтандартнаяВложенностьУпаковок[СтрокаДерева.GTIN];
				Если СтрокаДерева.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Групповая Тогда
					ОчиститьГрупповыеУпаковки = Истина;
					СтрокаДерева.КоличествоГрупповыхУпаковок = 0;
				КонецЕсли;
				
				СтрокаДерева.Строки.Очистить();
				
			КонецЕсли;
			
			Если СтрокаДерева.Родитель <> Неопределено Тогда
				ПрименитьИзменениеКСтрокамВышестоящегоУровня(СтрокаДерева.Родитель, ИзменениеКоличествоПотребительскихУпаковок, ОчиститьГрупповыеУпаковки, КандидатыВСеруюЗону);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ВозвращаемоеЗначение.ТекстОшибки                    = РезультатПроверки.ТекстОшибки;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатПроверки.ТребуетсяОбновлениеКлючаСессии;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ПрименитьИзменениеКСтрокамВышестоящегоУровня(СтрокаДерева, ИзменениеКоличествоПотребительскихУпаковок, ОчиститьГрупповыеУпаковки, КандидатыВСеруюЗону)
	
	ЭлементДанных = КандидатыВСеруюЗону.Найти(СтрокаДерева, "СтрокаДерева");
	Если ЭлементДанных <> Неопределено Тогда
		ЭлементДанных.ОбработаноСерыхКодов = ЭлементДанных.ОбработаноСерыхКодов + ИзменениеКоличествоПотребительскихУпаковок;
	КонецЕсли;
	
	СтрокаДерева.КоличествоПотребительскихУпаковок = СтрокаДерева.КоличествоПотребительскихУпаковок + ИзменениеКоличествоПотребительскихУпаковок;
	Если ОчиститьГрупповыеУпаковки Тогда
		СтрокаДерева.КоличествоГрупповыхУпаковок = 0;
	КонецЕсли;
	
	Если СтрокаДерева.Родитель <> Неопределено Тогда
		
		ПрименитьИзменениеКСтрокамВышестоящегоУровня(СтрокаДерева.Родитель, ИзменениеКоличествоПотребительскихУпаковок, ОчиститьГрупповыеУпаковки, КандидатыВСеруюЗону);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(СтрокаДерева, ДанныеКодовМаркировки) Экспорт
	
	Если ДанныеКодовМаркировки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДанныеКодовМаркировки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СтрокаДанных = ДанныеКодовМаркировки.Найти(СтрокаДерева, "СтрокаДерева");
	Если СтрокаДанных <> Неопределено Тогда
		ДанныеКодовМаркировки.Удалить(СтрокаДанных);
	КонецЕсли;
	
	Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
		УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиУпаковкиДляПроверкиНаВхождениеВСеруюЗону(СтрокаДерева, КандидатыВСеруюЗону, СтандартнаяВложенностьУпаковок, ПараметрыСканирования)
	
	ПоддерживаетсяСераяЗона = КонструкторИСМПКлиентСервер.ПоддерживаетсяСераяЗона(СтрокаДерева.ВидПродукции);
	
	ДобавитьВКандидаты = Ложь;
	Если СтрокаДерева.Строки.Количество() > 0 Тогда
		
		ФактическоеКоличествоВложенныхУпаковок = 0;
		КоэффициентВложенныхЕдиниц             = Неопределено;
		Для Каждого СтрокаДереваВложенная Из СтрокаДерева.Строки Цикл
			
			Если Не КонструкторИСМПКлиентСервер.ПоддерживаетсяСераяЗона(СтрокаДереваВложенная.ВидПродукции) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДереваВложенная.GTIN) Тогда
				
				КоэффициентТекущейУпаковки = КоэффициентУпаковки(СтрокаДереваВложенная, СтандартнаяВложенностьУпаковок);
				Если Не ЗначениеЗаполнено(КоэффициентТекущейУпаковки)
					И СтрокаДереваВложенная.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
					КоэффициентТекущейУпаковки = 1;
				КонецЕсли;
				
				Если КоэффициентВложенныхЕдиниц = Неопределено Тогда
					КоэффициентВложенныхЕдиниц = КоэффициентТекущейУпаковки;
					Если Не ЗначениеЗаполнено(КоэффициентВложенныхЕдиниц)
						И СтрокаДереваВложенная.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
						КоэффициентВложенныхЕдиниц = 1;
					КонецЕсли;
				ИначеЕсли КоэффициентВложенныхЕдиниц <> КоэффициентТекущейУпаковки Тогда
					// В упаковке содержится разная продукция
					КоэффициентВложенныхЕдиниц = 0;
				КонецЕсли;
				
				ФактическоеКоличествоВложенныхУпаковок = ФактическоеКоличествоВложенныхУпаковок + 1;
				
			КонецЕсли;
			
			НайтиУпаковкиДляПроверкиНаВхождениеВСеруюЗону(
				СтрокаДереваВложенная, КандидатыВСеруюЗону, СтандартнаяВложенностьУпаковок, ПараметрыСканирования);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СтрокаДерева.GTIN) Тогда
			КоэффициентУпаковки = КоэффициентУпаковки(СтрокаДерева, СтандартнаяВложенностьУпаковок);
		Иначе
			КоэффициентУпаковки = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(КоэффициентВложенныхЕдиниц)
			И ЗначениеЗаполнено(КоэффициентУпаковки)
			И ПоддерживаетсяСераяЗона Тогда
			
			ЕмкостьУпаковки = КоэффициентУпаковки / КоэффициентВложенныхЕдиниц;
			
			Если ЕмкостьУпаковки <> ФактическоеКоличествоВложенныхУпаковок
				И ЕмкостьУпаковки <> 1 Тогда
				ДобавитьВКандидаты = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли (СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
		Или СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая)
		И ПоддерживаетсяСераяЗона Тогда
		
		Если ЗначениеЗаполнено(СтрокаДерева.GTIN) Тогда
			КоэффициентУпаковки = КоэффициентУпаковки(СтрокаДерева, СтандартнаяВложенностьУпаковок);
		Иначе
			КоэффициентУпаковки = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КоэффициентУпаковки)
			И КоэффициентУпаковки <> СтрокаДерева.КоличествоПотребительскихУпаковок Тогда
			ДобавитьВКандидаты = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ДобавитьВКандидаты
		И ПоддерживаетсяСераяЗона Тогда
		
		Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
			ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП;
		ИначеЕсли СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор
			И ПараметрыСканирования.ДопустимыеСтатусыНаборовМОТП <> Неопределено Тогда
			ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыНаборовМОТП;
		ИначеЕсли СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
			И ПараметрыСканирования.ДопустимыеСтатусыНаборовМОТП <> Неопределено Тогда
			ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыНаборовМОТП;
		Иначе
			ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыМОТП;
		КонецЕсли;
		
		Если ДопустимыеСтатусыМОТП.Найти(СтрокаДерева.Статус) = Неопределено Тогда
			ДобавитьВКандидаты = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДобавитьВКандидаты
		И СтрокаДерева.Статус <> Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен
		И ПоддерживаетсяСераяЗона Тогда
		КандидатВСеруюЗону = КандидатыВСеруюЗону.Добавить();
		КандидатВСеруюЗону.СтрокаДерева = СтрокаДерева;
	КонецЕсли;
	
КонецПроцедуры

Функция КоэффициентУпаковки(СтрокаДерева, СтандартнаяВложенностьУпаковок)
	
	КоличествоВложенныхЕдиницGTIN02 = Неопределено;
	Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
		И СтрокаДерева.СоставКодаМаркировки <> Неопределено Тогда
		СтрокаДерева.СоставКодаМаркировки.Свойство("КоличествоВложенныхЕдиниц", КоличествоВложенныхЕдиницGTIN02);
	КонецЕсли;
	
	Если КоличествоВложенныхЕдиницGTIN02 <> Неопределено Тогда
		
		КоэффициентGTIN02 = СтандартнаяВложенностьУпаковок[СтрокаДерева.GTIN];
		
		Если ТипЗнч(КоэффициентGTIN02) = Тип("Число") И КоэффициентGTIN02 > 0 Тогда
			КоэффициентУпаковки = КоличествоВложенныхЕдиницGTIN02 * КоэффициентGTIN02;
		Иначе
			КоэффициентУпаковки = КоличествоВложенныхЕдиницGTIN02;
		КонецЕсли;
		
	Иначе
		КоэффициентУпаковки = СтандартнаяВложенностьУпаковок[СтрокаДерева.GTIN];
	КонецЕсли;
	
	Возврат КоэффициентУпаковки;
	
КонецФункции

Функция GTINВложеннойГрупповойУпаковки(СтрокаДерева)
	
	Если СтрокаДерева.Строки.Количество() > 0 Тогда
		
		Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
			Если ВложеннаяСтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
				Возврат ВложеннаяСтрокаДерева.GTIN;
			ИначеЕсли ВложеннаяСтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
				Возврат GTINВложеннойГрупповойУпаковки(ВложеннаяСтрокаДерева);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Дополняет данные по штрихкодам информацией по табачным пачкам без запроса сведений из МОТП.
// 
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
//  МассивСтрок - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки)
Процедура ЗаполнитьДанныеНеизвестныхТабачныхПачекБезЗапросаСведенийМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования, МассивСтрок = Неопределено)
	
	Если МассивСтрок = Неопределено Тогда
		МассивСтрок = ДанныеПоШтрихкодам.ДанныеКодовМаркировки;
	КонецЕсли;
	
	КодыДляАнализа = Новый Массив;
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		
		Если СтрокаТаблицы.ОбработанСОшибками Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ВозможнаПродукцияМОТП(СтрокаТаблицы) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			
			СтрокаТаблицы.КоличествоПотребительскихУпаковок  = 1;
			СтрокаТаблицы.ШтрихкодУпаковки = ШтрихкодированиеИС.СоздатьМаркированныйТоварПоДаннымШтрихкода(СтрокаТаблицы, ПараметрыСканирования);
			Если СтрокаТаблицы.СтрокаДерева <> Неопределено Тогда
				СтрокаТаблицы.СтрокаДерева.ШтрихкодУпаковки = СтрокаТаблицы.ШтрихкодУпаковки;
			КонецЕсли;
			СтрокаТаблицы.Идентифицирован  = Истина;
			
		Иначе
			
			КодыДляАнализа.Добавить(СтрокаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнить только коэффициенты упаковок, если не заполнены ранее
	ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(КодыДляАнализа, ПараметрыСканирования, Ложь);
	
	Для Каждого СтрокаТаблицы Из КодыДляАнализа Цикл
		
		Если СтрокаТаблицы.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			
			СтрокаТаблицы.КоличествоПотребительскихУпаковок  = 1;
			СтрокаТаблицы.ШтрихкодУпаковки = ШтрихкодированиеИС.СоздатьМаркированныйТоварПоДаннымШтрихкода(СтрокаТаблицы, ПараметрыСканирования);
			Если СтрокаТаблицы.СтрокаДерева <> Неопределено Тогда
				СтрокаТаблицы.СтрокаДерева.ШтрихкодУпаковки = СтрокаТаблицы.ШтрихкодУпаковки;
			КонецЕсли;
			СтрокаТаблицы.Идентифицирован  = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Запрашивает сведения из МОТП по кодам марировки табачных пачек. Дополняет данные по штрихкодам полученными сведениями.
// 
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
//  МассивСтрок - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки)
Процедура ЗаполнитьДанныеНеизвестныхТабачныхПачекСЗапросомСведенийМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования, МассивСтрок = Неопределено)
	
	Если МассивСтрок = Неопределено Тогда
		МассивСтрок = ДанныеПоШтрихкодам.ДанныеКодовМаркировки;
	КонецЕсли;
	
	МассивСтрокТаблицы = Новый Массив;
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		
		Если СтрокаТаблицы.ОбработанСОшибками
			Или ЗначениеЗаполнено(СтрокаТаблицы.ТекстОшибки) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не СтрокаТаблицы.Идентифицирован
			И ВозможнаПродукцияМОТП(СтрокаТаблицы)
			И (СтрокаТаблицы.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
				Или СтрокаТаблицы.ВидУпаковки = Перечисления.ВидыУпаковокИС.ПустаяСсылка()) Тогда
			
			Если Не СтрокаТаблицы.ТребуетсяКонтрольМарок Тогда
				Продолжить;
			КонецЕсли;
		
			МассивСтрокТаблицы.Добавить(СтрокаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивСтрокТаблицы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ШтрихкодированиеИСМПСлужебный.ДеревоУпаковокПоДаннымИСМП(МассивСтрокТаблицы, ПараметрыСканирования);
	
	Если Не ПустаяСтрока(Результат.ТекстОшибки) Тогда
		
		ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
		ДанныеПоШтрихкодам.ТекстОшибки                    = Результат.ТекстОшибки;
		ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = Результат.ТребуетсяОбновлениеКлючаСессии;
		
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
		И ПараметрыСканирования.ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП Тогда
		
		РезультатПроверкиСеройЗоны = ПроверитьПотребительскиеУпаковкиНаВхождениеВСеруюЗону(Результат.ДеревоУпаковок.Строки, ПараметрыСканирования);
		
		Если Не ПустаяСтрока(РезультатПроверкиСеройЗоны.ТекстОшибки) Тогда
			
			ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
			ДанныеПоШтрихкодам.ТекстОшибки                    = РезультатПроверкиСеройЗоны.ТекстОшибки;
			ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = РезультатПроверкиСеройЗоны.ТребуетсяОбновлениеКлючаСессии;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ЭтоДополнениеСпецификойПотребительскихУпаковок",                 Истина);
	ПараметрыОбработки.Вставить("ЭтоДополнениеСпецификойГрупповыхУпаковокИЛогистическихУпаковок", Ложь);
	ПараметрыОбработки.Вставить("ЭтоЗаполнениеВложенныхШтрихкодов",                               Ложь);
	
	ШтрихкодированиеИСМПСлужебный.ОбработатьДеревоПолученноеИзИСМП(Результат.ДеревоУпаковок, ДанныеПоШтрихкодам, ПараметрыСканирования, ПараметрыОбработки);
	
КонецПроцедуры

// Расчитывает МРЦ по строкам дерева по групповой упаковке в родительской строке.
// 
// Параметры:
// 	ВычисляемыеСтроки - Массив из СтрокаДереваЗначений - данные для расчета МРЦ по строкам.
Процедура РасчетМРЦПоСтрокамДерева(ВычисляемыеСтроки) Экспорт
	
	Если ВычисляемыеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из ВычисляемыеСтроки Цикл
		
		РодительСтроки = СтрокаДерева.Родитель;
		Если РодительСтроки = Неопределено
			Или ЗначениеЗаполнено(СтрокаДерева.МРЦ)
			Или Не ЗначениеЗаполнено(РодительСтроки.МРЦ)
			Или Не ЗначениеЗаполнено(РодительСтроки.КоличествоПотребительскихУпаковок) Тогда
			Продолжить;
		КонецЕсли;
		
		Если РодительСтроки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
			И СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			СтрокаДерева.МРЦ = РодительСтроки.МРЦ / РодительСтроки.КоличествоПотребительскихУпаковок;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция НормализованныйШтрихкод(Штрихкод, ВидПродукции, КэшДанныхРазбора = Неопределено, ПользовательскиеПараметрыРазбора = Неопределено) Экспорт
	
	НормализованныйШтрихкод = "";
	
	Если КэшДанныхРазбора = Неопределено Тогда
		ПримечаниеКРезультатуРазбора = Неопределено;
		ДанныеРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(Штрихкод, ВидПродукции, ПримечаниеКРезультатуРазбора,, ПользовательскиеПараметрыРазбора);
	Иначе
		ДанныеРазбораИРезультат = КэшДанныхРазбора[Штрихкод];
		Если ДанныеРазбораИРезультат <> Неопределено Тогда
			ПримечаниеКРезультатуРазбора = ДанныеРазбораИРезультат.ПримечаниеКРазборуШтрихкода;
			ДанныеРазбора                = ДанныеРазбораИРезультат.ДанныеРазбора;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеРазбора = Неопределено Тогда
		Возврат Штрихкод;
	КонецЕсли;
	
	ВключатьТабачнуюПродукцию = Истина;
	Если КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоПродукцияИСМП(ВидПродукции, ВключатьТабачнуюПродукцию)
		И (ДанныеРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
			Или ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ВозможнаГрупповаяУпаковкаИлиНабор(ДанныеРазбора.ВидУпаковки, ДанныеРазбора)) Тогда
		
		ПараметрыНормализацииКМ = РазборКодаМаркировкиИССлужебныйКлиентСервер.НастройкиРазбораКодаМаркировкиДляХэшаНормализации();
		НормализованныйШтрихкод = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
			ДанныеРазбора, ВидПродукции, ПараметрыНормализацииКМ);
		
	ИначеЕсли ДанныеРазбора.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая")
		И ДанныеРазбора.ТипШтрихкода = ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.GS1_128") Тогда
		
		Если ЗначениеЗаполнено(ВидПродукции) Тогда
			ВидПродукции = ВидПродукции;
		ИначеЕсли ДанныеРазбора.ВидыПродукции.Количество() Тогда
			ВидПродукции = ДанныеРазбора.ВидыПродукции.Получить(0);
		КонецЕсли;
		
		ПараметрыНормализацииКМ = РазборКодаМаркировкиИССлужебныйКлиентСервер.НастройкиРазбораКодаМаркировкиДляХэшаНормализации();
		ПараметрыНормализацииКМ.ИмяСвойстваКодМаркировки = "КодМаркировки";
		
		НормализованныйШтрихкод = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
			ДанныеРазбора, ВидПродукции, ПараметрыНормализацииКМ);
		
	ИначеЕсли ДанныеРазбора.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая") Тогда
		
		НормализованныйШтрихкод = Штрихкод;
		
	Иначе
		
		НормализованныйШтрихкод = ДанныеРазбора.НормализованныйКодМаркировки;
		
	КонецЕсли;
	
	Возврат НормализованныйШтрихкод;
	
КонецФункции

Процедура РасчетКоэффициентовПоСтатистике(ДеревоУпаковок, УточнениеКоэффициентовУпаковок, ПараметрыСканирования) Экспорт
	
	ДоляКоличестваОтклонений = 10; // допускается <= 10% упаковок с отклонением по количеству
	СодержитСерыеКоды        = Новый Соответствие();
	
	ДанныеДляОбработки = Новый ТаблицаЗначений();
	ДанныеДляОбработки.Колонки.Добавить("GTIN",           Метаданные.ОпределяемыеТипы.GTIN.Тип);
	ДанныеДляОбработки.Колонки.Добавить("ВидУпаковки",    Новый ОписаниеТипов("ПеречислениеСсылка.ВидыУпаковокИС"));
	ДанныеДляОбработки.Колонки.Добавить("ВидПродукции",   Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС"));
	ДанныеДляОбработки.Колонки.Добавить("ИсходныеДанные", Неопределено);
	ДанныеДляОбработки.Колонки.Добавить("СтрокиДерева",   Неопределено);
	
	ДанныеДляОбработки.Индексы.Добавить("GTIN,ВидУпаковки");
	
	Для Каждого СтрокаУточнения Из УточнениеКоэффициентовУпаковок Цикл
		
		НоваяСтрока = ДанныеДляОбработки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУточнения);
		
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("GTIN",        СтрокаУточнения.GTIN);
		СтруктураПоиска.Вставить("ВидУпаковки", СтрокаУточнения.ВидУпаковки);
		
		НоваяСтрока.ИсходныеДанные = СтрокаУточнения;
		НоваяСтрока.СтрокиДерева   = ДеревоУпаковок.Строки.НайтиСтроки(СтруктураПоиска, Истина);
		
	КонецЦикла;
	
	ДопустимыПроверкиСеройЗоныМОТП = ПараметрыСканирования.Свойство(
		"ДопустимыПроверкиСеройЗоныМОТП") И ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП;
	
	Если ДопустимыПроверкиСеройЗоныМОТП
		И Не ПараметрыСканирования.ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТП Тогда
		
		МассивСтрокДляПроверкиСеройЗоны = Новый Массив;
		
		Для Каждого СтрокаДанных Из ДанныеДляОбработки Цикл
			
			Если Не КонструкторИСМПКлиентСервер.ПоддерживаетсяСераяЗона(СтрокаДанных.ВидПродукции) Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого СтрокаДерева Из СтрокаДанных.СтрокиДерева Цикл
				МассивСтрокДляПроверкиСеройЗоны.Добавить(СтрокаДерева);
			КонецЦикла;
			
		КонецЦикла;
		
		Если МассивСтрокДляПроверкиСеройЗоны.Количество() Тогда
			
			РезультатПроверки = ИнтерфейсМОТП.ПроверитьСеруюЗонуКодовМаркировки(МассивСтрокДляПроверкиСеройЗоны);
			Если РезультатПроверки.СостояниеСеройЗоны <> Неопределено Тогда
				
				Для Каждого СтрокаДерева Из МассивСтрокДляПроверкиСеройЗоны Цикл
					
					СостояниеСеройЗоны = РезультатПроверки.СостояниеСеройЗоны[СтрокаДерева];
					
					Если СостояниеСеройЗоны = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					Если СостояниеСеройЗоны.СодержитСерыеКоды Тогда
						СодержитСерыеКоды.Вставить(СтрокаДерева, СостояниеСеройЗоны);
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из ДанныеДляОбработки Цикл
		
		ТаблицаРасчетаКоличестваПотребительскихУпаковок = Новый ТаблицаЗначений;
		ТаблицаРасчетаКоличестваПотребительскихУпаковок.Колонки.Добавить("Количество",         ОбщегоНазначения.ОписаниеТипаЧисло(10));
		ТаблицаРасчетаКоличестваПотребительскихУпаковок.Колонки.Добавить("КоличествоУпаковок", ОбщегоНазначения.ОписаниеТипаЧисло(10));
		
		Для Каждого СтрокаДерева Из СтрокаДанных.СтрокиДерева Цикл
			
			Если ДопустимыПроверкиСеройЗоныМОТП
				И (СтрокаДерева.СодержитСерыеКоды
					Или СодержитСерыеКоды.Получить(СтрокаДерева) <> Неопределено) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор Тогда
				
				Если СтрокаДерева.Строки.Количество() = 0 Тогда
					НоваяСтрока = ТаблицаРасчетаКоличестваПотребительскихУпаковок.Добавить();
					НоваяСтрока.Количество         = 0;
					НоваяСтрока.КоличествоУпаковок = 1;
				Иначе
					GTIN = NULL;
					Для Каждого СтрокаДерева Из СтрокаДерева.Строки Цикл
						Если GTIN = NULL Тогда
							GTIN = СтрокаДерева.GTIN;
						ИначеЕсли СтрокаДерева.GTIN <> GTIN Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если GTIN = Неопределено Тогда
						НоваяСтрока = ТаблицаРасчетаКоличестваПотребительскихУпаковок.Добавить();
						НоваяСтрока.Количество         = 0;
						НоваяСтрока.КоличествоУпаковок = 1;
					Иначе
						НоваяСтрока = ТаблицаРасчетаКоличестваПотребительскихУпаковок.Добавить();
						НоваяСтрока.Количество         = СтрокаДерева.Строки.Количество();
						НоваяСтрока.КоличествоУпаковок = 1;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока = ТаблицаРасчетаКоличестваПотребительскихУпаковок.Добавить();
				НоваяСтрока.Количество         = СтрокаДерева.КоличествоПотребительскихУпаковок;
				НоваяСтрока.КоличествоУпаковок = 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТаблицаРасчетаКоличестваПотребительскихУпаковок.Свернуть("Количество", "КоличествоУпаковок");
		ВсегоУпаковок = ТаблицаРасчетаКоличестваПотребительскихУпаковок.Итог("КоличествоУпаковок");
		
		Для Каждого СтрокаТаблицы Из ТаблицаРасчетаКоличестваПотребительскихУпаковок Цикл
			Если (СтрокаТаблицы.КоличествоУпаковок / ВсегоУпаковок * 100) >= (100 - ДоляКоличестваОтклонений) Тогда
				СтрокаДанных.ИсходныеДанные.КоличествоПотребительскихУпаковок = СтрокаТаблицы.Количество;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьРасширенныеКолонкиТаблицыДанныхКодовМаркировки(ПараметрыСканирования, ОбязательныеКолонки) Экспорт

	Если ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП Тогда
		КоллекцияДополнительныхКолонокДереваУпаковокДляФормыПроверкиКодовМаркировки(ОбязательныеКолонки);
	КонецЕсли;
	
	ОбязательныеКолонки.Вставить("СпособВводаВОборот",   Новый ОписаниеТипов("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	
КонецПроцедуры

Процедура ДополнитьРасширенныеКолонкиДереваУпаковокИСМП(КоллекцияДополнительныхКолонок) Экспорт
	
	КоллекцияДополнительныхКолонок.Вставить("СпособВводаВОборот",   Новый ОписаниеТипов("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает текст ошибки о запрещении запрашивать данные по неизвестным кодам в МОТП.
// 
// Возвращаемое значение:
//  Строка - Текст ошибки.
Функция ТекстОшибкиЗапрещеноЗапрашиватьДанныеВМОТП() Экспорт
	
	Возврат НСтр("ru = 'Запрещено запрашивать данные по неизвестным штрихкодам в ГИС МТ.'");
	
КонецФункции

// Получение специфичных данных, используемых только для табачной продукции
// 
// Параметры:
//  ШтрихкодыДляПолученияСпецифики - Массив - Коды маркировок.
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
// Возвращаемое значение:
//  Структура - Описание:
//   * СпецификаШтрихкодов - Неопределено, соответствие - Ключ - код маркировки, значение - данные, полученные из МОТП.
//   * ЕстьОшибки - Булево - Истина, если при попытке получения данных из МОТП возникла ошибка.
//   * ТекстОшибки - Строка - Описание ошибки.
Функция СпецификаДляДополненияДанныхПоШтрихкодам(СтрокиТаблицыДанныхДляПолученияСпецифики, ПараметрыСканирования)
	
	Результат = Новый Структура;
	Результат.Вставить("СпецификаШтрихкодов",            Неопределено);
	Результат.Вставить("ЕстьОшибки",                     Ложь);
	Результат.Вставить("ТекстОшибки",                    "");
	Результат.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	ДанныеПоШтрихкодамМОТП = ИнтерфейсМОТП.ЗапроситьСтатусыКодовМаркировки(
		СтрокиТаблицыДанныхДляПолученияСпецифики,
		ПараметрыСканирования.Организация,
		ШтрихкодированиеИСМПКлиентСервер.РазрешеноЗапрашиватьСтатусыКодовЕАЭС(ПараметрыСканирования));
	
	Если ДанныеПоШтрихкодамМОТП.ТребуетсяОбновлениеКлючаСессии Тогда
		Результат.ЕстьОшибки  = Истина;
		Результат.ТекстОшибки = НСтр("ru = 'Не удалось получить данные из ИС МП.
		                                   |По причине: Требуется обновление ключа сессии.'");
		Результат.ТребуетсяОбновлениеКлючаСессии = Истина;
		
		Возврат Результат;
	ИначеЕсли ЗначениеЗаполнено(ДанныеПоШтрихкодамМОТП.ТекстОшибки) Тогда
		Результат.ЕстьОшибки  = Истина;
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось получить данные из ИС МОТП.
			           |По причине: %1'"), ДанныеПоШтрихкодамМОТП.ТекстОшибки);
		
		Возврат Результат;
	КонецЕсли;
	
	Результат.СпецификаШтрихкодов = ДанныеПоШтрихкодамМОТП.СтатусыКодовМаркировки;
	
	Возврат Результат;
	
КонецФункции

// Удаляет строки дерева упаковок по массиву удаляемых строк. Удаление происходит путем копирования структуры дерева и
// его заполнения, исключая удаляемые строки.
//
// Параметры:
//  ДеревоУпаковок - ДеревоЗначений - Дерево упаковок. Будет заменено.
//  МассивУдаляемыхСтрок - Массив - Строки, дерева упаковок, которые нужно удалить.
//  МаркированныеТовары - ТаблицаЗначений - Таблица связанных с деревом вложенных упаковок. Будет заменена.
//  ДанныеКодовМаркировки - ТаблицаЗначений - Таблица связанных с деревом внешних упаковок. Будет обновлена.
Процедура УдалитьСтрокиДереваУпаковокПоДетализации(ДеревоУпаковок, МассивУдаляемыхСтрок, МаркированныеТовары, ДанныеКодовМаркировки) Экспорт
	
	ДеревоУпаковокПриемник = Новый ДеревоЗначений;
	Для Каждого Колонка Из ДеревоУпаковок.Колонки Цикл
		ДеревоУпаковокПриемник.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;

	СоответствиеСтрокИсточникаПриемника = Новый Соответствие;
	СкопироватьСтрокиДереваСУчетомИсключаемыхСтрок(
		ДеревоУпаковокПриемник.Строки, ДеревоУпаковок.Строки, МассивУдаляемыхСтрок,
		СоответствиеСтрокИсточникаПриемника, Неопределено);
	
	Если МаркированныеТовары <> Неопределено Тогда
		
		МаркированныеТоварыПриемник = МаркированныеТовары.СкопироватьКолонки();
		Для Каждого СтрокаТЧ Из МаркированныеТовары Цикл

			СсылкаНаСтрокуДерева = СоответствиеСтрокИсточникаПриемника.Получить(СтрокаТЧ.СтрокаДерева);
			Если СсылкаНаСтрокуДерева <> Неопределено Тогда
				НоваяСтрокаПриемник = МаркированныеТоварыПриемник.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПриемник, СтрокаТЧ);
				НоваяСтрокаПриемник.СтрокаДерева = СсылкаНаСтрокуДерева;
				НоваяСтрокаПриемник.УпаковкаВерхнегоУровня = Неопределено;
			КонецЕсли;

		КонецЦикла;

		МаркированныеТовары = МаркированныеТоварыПриемник;

	КонецЕсли;
	
	Если ДанныеКодовМаркировки <> Неопределено Тогда

		Для Каждого СтрокаТЧ Из ДанныеКодовМаркировки Цикл
			СсылкаНаСтрокуДерева = СоответствиеСтрокИсточникаПриемника.Получить(СтрокаТЧ.СтрокаДерева);
			СтрокаТЧ.СтрокаДерева = СсылкаНаСтрокуДерева;
		КонецЦикла;

		// Определение вида продукции для удаляемых строк.
		// Вид продукции в дереве рассчитан по иерархии, если строка дерева удаляется,
		// то в некоторых сценариях становится невозможным определить вид продукции в данных штрихкодов.
		ПараметрыОтбора = Новый Структура("НормализованныйШтрихкод");
		Для Каждого СтрокаДерева Из МассивУдаляемыхСтрок Цикл
			ПараметрыОтбора.НормализованныйШтрихкод = СтрокаДерева.НормализованныйШтрихкод;
			НайденныеСтроки = ДанныеКодовМаркировки.НайтиСтроки(ПараметрыОтбора);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если Не ЗначениеЗаполнено(НайденнаяСтрока.ВидПродукции) Тогда
					НайденнаяСтрока.ВидПродукции = СтрокаДерева.ВидПродукции;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;

	КонецЕсли;
	
	ДеревоУпаковок = ДеревоУпаковокПриемник;
	
КонецПроцедуры

// Производит копирование значений строк дерева источника в строки дерева приемника, исключая строки, входящие в
// массив удаляемых строк.
//
// Параметры:
//  СтрокиПриемника - КоллекцияСтрокДереваЗначений - Строки дерева значений приемника.
//  СтрокиИсточника - КоллекцияСтрокДереваЗначений - Строки дерева значений источника.
//  МассивУдаляемыхСтрок - Массив из СтрокаДереваЗначений - Строки дерева, которые должны быть удалены.
//  СоответствиеСтрокИсточникаПриемника - Соответствие - Строки дерева значений источника.
//  ВерхнийУровень - СтрокаДереваЗначений - Верхняя строка иерархии.
Процедура СкопироватьСтрокиДереваСУчетомИсключаемыхСтрок(СтрокиПриемника, СтрокиИсточника, МассивУдаляемыхСтрок,
														СоответствиеСтрокИсточникаПриемника, ВерхнийУровень)
	
	Для Каждого СтрокаИсточника Из СтрокиИсточника Цикл
		
		Если МассивУдаляемыхСтрок.Найти(СтрокаИсточника) = Неопределено Тогда
			СтрокаПриемника = СтрокиПриемника.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
			СоответствиеСтрокИсточникаПриемника.Вставить(СтрокаИсточника, СтрокаПриемника);
			
			Если Не ЗначениеЗаполнено(ВерхнийУровень) Тогда
				ВерхнийУровень = СтрокаИсточника;
			КонецЕсли;
			
			СкопироватьСтрокиДереваСУчетомИсключаемыхСтрок(
				СтрокаПриемника.Строки, СтрокаИсточника.Строки, МассивУдаляемыхСтрок, СоответствиеСтрокИсточникаПриемника, ВерхнийУровень);
				
		Иначе
			
			СкопироватьСтрокиДереваСУчетомИсключаемыхСтрок(
				СтрокиПриемника, СтрокаИсточника.Строки, МассивУдаляемыхСтрок, СоответствиеСтрокИсточникаПриемника, ВерхнийУровень);
				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Определяет строки дерева, которые необходимо удалить с соответствии с детализацией.
//
// Параметры:
//  СтрокиДерева - КоллекцияСтрокДереваЗначений - Строки дерева упаковок.
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования
//  МассивУдаляемыхСтрок - Массив из СтрокаДереваЗначений- Коллекция строк дерева, которые должны быть удалены из маркированных товаров.
//  МаркированныеТовары   - ТаблицаЗначений - таблица с кодами маркировок из дерева
//  ДанныеКодовМаркировки - ТаблицаЗначений - таблица с кодами маркировок из дерева
Процедура ОпределитьУдаляемыеСтрокиДереваПоДетализации(СтрокиДерева, ПараметрыСканирования, МассивУдаляемыхСтрок, МаркированныеТовары, ДанныеКодовМаркировки) Экспорт
	
	Детализация = ПараметрыСканирования.ДетализацияСтруктурыХранения;
	
	СозданиеНаборов = ПараметрыСканирования.СозданиеНаборов;
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
			Или СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
			Или СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор
			Или СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет Тогда
			
			Если ((СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Или СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор)
				И (Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками
					Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
					Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки))
				Или (СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор И Не СозданиеНаборов) Тогда
				
				Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
					УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, МаркированныеТовары);
					УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
				КонецЦикла;
				
				СтрокаДерева.Строки.Очистить();
				Продолжить;
				
			КонецЕсли;
			
			Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
				И Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами Тогда
				
				GTIN = СтрокаДерева.GTIN;
				
				Если ЗначениеЗаполнено(GTIN) Тогда
					
					Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
						УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, МаркированныеТовары);
						УдалитьСтрокиПоСсылкамНаСтрокиДереваРекурсивно(ВложеннаяСтрокаДерева, ДанныеКодовМаркировки);
					КонецЦикла;
					
					СтрокаДерева.Строки.Очистить();
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;
			
			GTINКоробаВерхнегоУровня = "";
			Если СтрокаДерева.Родитель.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
				GTINКоробаВерхнегоУровня = СтрокаДерева.Родитель.GTIN;
			КонецЕсли;
			
			ПропуститьУпаковку =
				// В детализации Пачки - пропускаются все упаковки
				(Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки)
				// В детализации Блоки с пачками - пропускаются все упаковки кроме блоков
				Или (Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими
					И СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая)
				// В детализации Групповые упаковки - пропускаются все упаковки кроме блоков
				Или (Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки
					И СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая)
				Или (Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
					И Не ПустаяСтрока(GTINКоробаВерхнегоУровня));
			
			Если ПропуститьУпаковку Тогда
				МассивУдаляемыхСтрок.Добавить(СтрокаДерева);
			КонецЕсли;
			
			ОпределитьУдаляемыеСтрокиДереваПоДетализации(
				СтрокаДерева.Строки, ПараметрыСканирования, МассивУдаляемыхСтрок,
				МаркированныеТовары, ДанныеКодовМаркировки);
			
		Иначе
			
			ДобавлятьПачку = Ложь;
			Если Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
				Или Детализация = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками Тогда
				
				GTINКоробаВерхнегоУровня = "";
				Если СтрокаДерева.Родитель.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
					GTINКоробаВерхнегоУровня = СтрокаДерева.Родитель.GTIN;
				КонецЕсли;
				
				Если СтрокиДерева.Родитель.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
					И ПустаяСтрока(GTINКоробаВерхнегоУровня) Тогда
					ДобавлятьПачку = Истина;
				КонецЕсли;
				
			Иначе
				// Детализация: Полная, Пачки, Блоки с пачками
				ДобавлятьПачку = Истина;
			КонецЕсли;
			
			Если Не ДобавлятьПачку Тогда
				МассивУдаляемыхСтрок.Добавить(СтрокаДерева);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует правила детализации.
//
// Возвращаемое значение:
//  Соответствие - Ключ - ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС, значение - свойство
//      правила. (См. ШтрихкодированиеМОТП.СвойствоПравилаДетализации).
Функция ПравилаДетализацииДереваУпаковок() Экспорт
	
	ПравилаДетализации = Новый Соответствие;
	
	ДетализацияБлокиСПачками = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими;
	ДетализацияКоробки       = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами;
	ДетализацияКоробкиИБлоки = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками;
	ДетализацияПолная        = Перечисления.ДетализацияСтруктурыХраненияИС.Полная;
	ДетализацияПачки         = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки;
	
	ПравилаДетализации.Вставить(ДетализацияПолная,        СвойствоПравилаДетализации(Истина, Истина, Истина));
	ПравилаДетализации.Вставить(ДетализацияКоробки,       СвойствоПравилаДетализации(Истина, Ложь,   Ложь));
	ПравилаДетализации.Вставить(ДетализацияКоробкиИБлоки, СвойствоПравилаДетализации(Истина, Истина, Ложь));
	ПравилаДетализации.Вставить(ДетализацияБлокиСПачками, СвойствоПравилаДетализации(Ложь,   Истина, Истина));
	ПравилаДетализации.Вставить(ДетализацияПачки,         СвойствоПравилаДетализации(Ложь,   Ложь,   Истина));
	
	Возврат ПравилаДетализации;
	
КонецФункции

// Формирует свойство правила детализации.
//
// Параметры:
//  РазрешеныКоробки - Булево - Истина, в дереве разрешено показывать упаковки.
//  РазрешеныБлоки - Булево - Истина, в дереве разрешено показывать табачные блоки.
//  РазрешеныПачки - Булево - Истина, в дереве разрешено показывать пачки.
// Возвращаемое значение:
//  Структура - Описание:
// * РазрешеныКоробки - Булево - Истина, в дереве разрешено показывать упаковки.
// * РазрешеныБлоки - Булево - Истина, в дереве разрешено показывать табачные блоки.
// * РазрешеныПачки - Булево - Истина, в дереве разрешено показывать пачки.
Функция СвойствоПравилаДетализации(РазрешеныКоробки, РазрешеныБлоки, РазрешеныПачки)
	
	Возврат Новый Структура("РазрешеныКоробки, РазрешеныБлоки, РазрешеныПачки",
							РазрешеныКоробки, РазрешеныБлоки, РазрешеныПачки);
	
КонецФункции

#Область ПроверкаНаОшибки

// Выполняет проверку строк дерева на ошибки.
//
// Параметры:
//  СтрокиДерева - КоллекцияСтрокДереваЗначений - Строки дерева упаковок.
//  ПравилаПроверкиНаОшибки - Структура - правила, по которым выполняется проверка:
//   * КонтрольВладельца - Массив - Коллекция строк дерева, в которых ИНН владельца не соответствует ожидаемому,
//   * КонтрольПустыхУпаковок - Массив - Коллекция пустых упаковок дерева,
//   * КонтрольСерий - Массив - для дерева заполнение серий не контролируется.
//   * КонтрольСтатусов - Массив - Коллекция строк дерева, в которых статус не соответствует ожидаемому.
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования.
//  ДанныеПоШтрихкодам - см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам
//  ЕстьОшибки - Булево - Истина, если при проверке выявлены ошибки.
Процедура ПроверитьНаОшибкиСтрокиДерева(СтрокиДерева, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ДанныеПоШтрихкодам, ЕстьОшибки)
	
	ВладелецМожетБытьПустым = Ложь;
	
	Если ПравилаПроверкиНаОшибки.Свойство("КонтрольВладельца")
		И ПараметрыСканирования.КонтролироватьВладельцевКодовМаркировкиИСМП Тогда
		
		ВладелецМожетБытьПустым = ПроверкаИПодборПродукцииИС.ЭтоДокументПриобретения(ПараметрыСканирования.СсылкаНаОбъект);
		
	КонецЕсли;
	
	КэшМаркируемойПродукции           = Неопределено;
	ПроверятьСтруктуруКодовМаркировки = ПараметрыСканирования.ПроверятьСтруктуруКодовМаркировки;
	
	ЭтоФормаДокументаМаркировкаТоваров = Не ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева
		И ТипЗнч(ПараметрыСканирования.СсылкаНаОбъект) = Тип("ДокументСсылка.МаркировкаТоваровИСМП");
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если Не ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(СтрокаДерева.ВидПродукции) Тогда
			Продолжить;
		КонецЕсли;
		
		ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = (ЗначениеЗаполнено(СтрокаДерева.РазрешительныйРежимДатаЗапросаГИСМТ)
			И Не ЗначениеЗаполнено(СтрокаДерева.РазрешительныйРежимИдентификаторЗапросаГИСМТ));
		
		СтрокаДанных = Неопределено;
		
		Если СтрокаДанных = Неопределено Тогда
			СтрокаДанных = ДанныеПоШтрихкодам.ДанныеКодовМаркировки.Найти(
				СтрокаДерева.НормализованныйШтрихкод, "НормализованныйШтрихкод");
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольПустыхУпаковок") Тогда
			
			Если ИнтеграцияИСКлиентСервер.ЭтоУпаковка(СтрокаДерева.ТипУпаковки)
				И СтрокаДерева.Строки.Количество() = 0
				И (СтрокаДерева.КоличествоПотребительскихУпаковок = 0
					Или ПараметрыСканирования.ЭтоМаркировкаТоваровИСМП)
				И Не ГрупповаяОбработкаШтрихкодовИС.ЭтоАгрегатТСД(СтрокаДерева.Штрихкод) Тогда
				ЕстьОшибки = Истина;
				ПравилаПроверкиНаОшибки.КонтрольПустыхУпаковок.Добавить(СтрокаДерева);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыСканирования.КонтролироватьСтатусыКодовМаркировкиИСМП Тогда
			КонтролироватьСтатусыКодовМаркировки = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.КонтролироватьСтатусыКодовМаркировки(
				СтрокаДерева.ВидПродукции,
				ПараметрыСканирования.ВидОперацииИСМП,
				ПараметрыСканирования.ТребуетсяПроверкаСредствамиККТ Или ПараметрыСканирования.ЭтоОблачнаяККТИСМП);
		Иначе
			КонтролироватьСтатусыКодовМаркировки = Ложь;
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСтатусов")
			И КонтролироватьСтатусыКодовМаркировки Тогда
			
			Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
				ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП;
			ИначеЕсли СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор
				И ПараметрыСканирования.ДопустимыеСтатусыНаборовМОТП <> Неопределено Тогда
				ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыНаборовМОТП;
			ИначеЕсли СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
				И ПараметрыСканирования.ДопустимыеСтатусыНаборовМОТП <> Неопределено Тогда
				ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыНаборовМОТП;
			Иначе
				ДопустимыеСтатусыМОТП = ПараметрыСканирования.ДопустимыеСтатусыМОТП;
			КонецЕсли;
			
			ПроверятьСеруюЗону          = ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
				И ПараметрыСканирования.ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП;
			
			Если ПроверятьСеруюЗону Тогда
				ВыполнятьКонтрольСУчетомСеройЗоны = Не СтрокаДерева.ВСеройЗоне;
			Иначе
				ВыполнятьКонтрольСУчетомСеройЗоны = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДерева.ДатаПроизводства)
				И ВыполнятьКонтрольСУчетомСеройЗоны Тогда
				ДатаПроизводстваДопускаетКонтроль = СтрокаДерева.ДатаПроизводства >= ПараметрыСканирования.ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП;
			Иначе
				ДатаПроизводстваДопускаетКонтроль = Истина;
			КонецЕсли;
				
			ОтсутствуетДопустимыйСтатус = (ДопустимыеСтатусыМОТП.Найти(СтрокаДерева.Статус) = Неопределено);
			
			Если СтрокаДерева <> Неопределено
				И СтрокаДерева.Статус = Перечисления.СтатусыКодовМаркировкиИСМП.Нанесен
				И ЗначениеЗаполнено(СтрокаДерева.РазрешительныйРежимДатаЗапросаГИСМТ) Тогда
				// табачная продукция в статусе Нанесен, владелец не указан, но указан производитель
				Если ШтрихкодированиеОбщегоНазначенияИСМП.ИННСоответствуетОперации(СтрокаДерева, ДанныеПоШтрихкодам, ПараметрыСканирования, Ложь) Тогда
					ОтсутствуетДопустимыйСтатус = Ложь;
				ИначеЕсли ПроверятьСеруюЗону И СтрокаДерева.ВСеройЗоне Тогда
					ОтсутствуетДопустимыйСтатус = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			КодЗаблокированОГВ = 
				(СтрокаДерева.Статус = Перечисления.СтатусыКодовМаркировкиИСМП.ЗаблокированОГВ
					Или СтрокаДерева.Статус = Перечисления.СтатусыКодовМаркировкиИСМП.ЗаблокированОГВ
					Или СтрокаДерева.ОсобоеСостояние = Перечисления.СтатусыКодовМаркировкиИСМП.ЗаблокированОГВ);
			
			КодПроданПоДаннымОффлайнРежима = (СтрокаДерева.Статус = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота
				Или СтрокаДерева.Статус = Перечисления.СтатусыКодовМаркировкиИСМП.Продан);
			
			Если ПродажаРазрешенаВОтсутствиеОтветаГИСМТ
				Или (СтрокаДерева.ПродажаПоДаннымОффлайнРежима И Не КодЗаблокированОГВ И Не КодПроданПоДаннымОффлайнРежима)
				Или СтрокаДерева.ТребуетсяПроверкаРазрешительногоРежимаНаЛокальномМодуле
				Или СтрокаДерева.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ Тогда
				ОтсутствуетДопустимыйСтатус = Ложь;
			КонецЕсли;
			
			// В форме документа Маркировка товаров можно обрабатывать коды логистических упаковок только
			// если агрегация была выполнена ранее (созданы элементы справочника штрихкодов упаковок),
			// например с помощью виртуальной агрегации.
			Если ОтсутствуетДопустимыйСтатус
				И ЭтоФормаДокументаМаркировкаТоваров
				И СтрокаДерева.Статус = Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен
				И СтрокаДерева.Строки.Количество() > 0 Тогда
				ОтсутствуетДопустимыйСтатус = Ложь;
			КонецЕсли;
			
			Если ОтсутствуетДопустимыйСтатус
				И Не ГрупповаяОбработкаШтрихкодовИС.ЭтоАгрегатТСД(СтрокаДерева.Штрихкод)
				И ДатаПроизводстваДопускаетКонтроль
				И Не ШтрихкодированиеОбщегоНазначенияИСМП.ЭтоПродажаВыбывшегоЧастично(
					СтрокаДерева,
					ПараметрыСканирования,
					ДопустимыеСтатусыМОТП) Тогда
				
				ЕстьОшибки = Истина;
				ПравилаПроверкиНаОшибки.КонтрольСтатусов.СтрокиСОшибками.Добавить(СтрокаДерева);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ШтрихкодированиеОбщегоНазначенияИС.ТребуетсяЧастичноеВыбытие(ПараметрыСканирования, ДанныеПоШтрихкодам)
			И ШтрихкодированиеОбщегоНазначенияИСМП.СтрокаСодержитОшибкиЧастичногоВыбытия(
				СтрокаДерева,
				ПараметрыСканирования,
				ПравилаПроверкиНаОшибки,
				КэшМаркируемойПродукции) Тогда
			
			ЕстьОшибки = Истина;
			
		КонецЕсли;
		
		Если ПараметрыСканирования.КонтролироватьВладельцевКодовМаркировкиИСМП Тогда
			КонтролироватьВладельцевКодовМаркировки = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.КонтролироватьСтатусыКодовМаркировки(
				СтрокаДерева.ВидПродукции, ПараметрыСканирования.ВидОперацииИСМП)
				И НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.КонтролироватьВладельцевКодовМаркировки(
					СтрокаДерева.ВидПродукции, ПараметрыСканирования.ВидОперацииИСМП);
		Иначе
			КонтролироватьВладельцевКодовМаркировки = Ложь;
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольВладельца")
			И КонтролироватьВладельцевКодовМаркировки Тогда
			
			Если СтрокаДерева.Статус <> Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен
				И СтрокаДерева.Статус <> Неопределено
				И Не ШтрихкодированиеОбщегоНазначенияИСМП.ИННСоответствуетОперации(СтрокаДерева, ДанныеПоШтрихкодам, ПараметрыСканирования) Тогда
				
				Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
					И ПараметрыСканирования.ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП Тогда
					ВыполнятьКонтрольСУчетомСеройЗоны = Не СтрокаДерева.ВСеройЗоне;
				Иначе
					ВыполнятьКонтрольСУчетомСеройЗоны = Истина;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаДерева.ДатаПроизводства)
					И ВыполнятьКонтрольСУчетомСеройЗоны Тогда
					ДатаПроизводстваДопускаетКонтроль = СтрокаДерева.ДатаПроизводства >= ПараметрыСканирования.ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП;
				Иначе
					ДатаПроизводстваДопускаетКонтроль = Истина;
				КонецЕсли;
				
				Если ВладелецМожетБытьПустым И Не ЗначениеЗаполнено(СтрокаДерева.ИННВладельца)
					Или ПродажаРазрешенаВОтсутствиеОтветаГИСМТ
					Или СтрокаДанных.ПродажаПоДаннымОффлайнРежима
					Или СтрокаДанных.ТребуетсяПроверкаРазрешительногоРежимаНаЛокальномМодуле
					Или СтрокаДанных.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ Тогда
				ИначеЕсли ДатаПроизводстваДопускаетКонтроль Тогда
					ЕстьОшибки = Истина;
					ПравилаПроверкиНаОшибки.КонтрольВладельца.Добавить(СтрокаДерева);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСпособаВводаВОборот") Тогда
			
			Если СтрокаДерева.Статус <> Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен
				И СтрокаДерева.СпособВводаВОборот <> ПараметрыСканирования.ДопустимыйСпособВводаВОборот
				И Не ГрупповаяОбработкаШтрихкодовИС.ЭтоАгрегатТСД(СтрокаДерева.Штрихкод) Тогда
				
				ЕстьОшибки = Истина;
				ПравилаПроверкиНаОшибки.КонтрольСпособаВводаВОборот.Добавить(СтрокаДерева);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольСпособаВводаВОборотОффлайн") Тогда
			
			Если РазборКодаМаркировкиИССлужебныйКлиентСервер.ЭтоШтрихкодВводаОстатков(СтрокаДерева.Штрихкод, Истина)
				И ПараметрыСканирования.ДопустимыйСпособВводаВОборот <> Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков Тогда

				ЕстьОшибки = Истина;
				ПравилаПроверкиНаОшибки.КонтрольСпособаВводаВОборотОффлайн.Добавить(СтрокаДерева);

			КонецЕсли;

		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтрольПолногоКодаМаркировки") Тогда
			
			Если СтрокаДанных <> Неопределено Тогда
				
				ВыполнятьКонтроль = (ПараметрыСканирования.ОперацияНанесенияТолькоДляНаборов
					И СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор)
					Или Не ПараметрыСканирования.ОперацияНанесенияТолькоДляНаборов;
					
				ПропуститьВложенныеПачкиГрупповойУпаковки = Ложь;
				
				Если СтрокаДанных.ПодлежитПроверкеРазрешительногоРежима Тогда
					
					ПропуститьВложенныеПачкиГрупповойУпаковки = СтрокаДанных.СтрокаДерева <> Неопределено
						И СтрокаДанных.СтрокаДерева.Родитель <> Неопределено
						И СтрокаДанных.СтрокаДерева.Родитель.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая;
						
				КонецЕсли;
				
				ДанныеРазбора = СтрокаДанных.ДанныеРазбора;
				Если ВыполнятьКонтроль
					И ДанныеРазбора <> Неопределено
					И Не ПропуститьВложенныеПачкиГрупповойУпаковки
					И (СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
						Или ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ВозможнаГрупповаяУпаковкаИлиНабор(
							СтрокаДанных.ВидУпаковки, ДанныеРазбора)) Тогда

					СоставКодаМаркировки   = ДанныеРазбора.СоставКодаМаркировки;
					КодВключаетКриптоХвост = Ложь;
					ВключаетИдентификаторыПрименения = Ложь;
					СодержитРазделительGS            = Ложь;

					Если ДанныеРазбора.Свойство("Детализация") Тогда
						ВключаетИдентификаторыПрименения = ДанныеРазбора.Детализация.ВключаетИдентификаторыПрименения;
						СодержитРазделительGS = ДанныеРазбора.Детализация.СодержитРазделительGS;
					КонецЕсли;

					Если СоставКодаМаркировки <> Неопределено
						И СоставКодаМаркировки.Свойство("ВключаетКриптоХвост") Тогда
						КодВключаетКриптоХвост = СоставКодаМаркировки.ВключаетКриптоХвост;
						Если Не КодВключаетКриптоХвост
							И ПроверятьСтруктуруКодовМаркировки
							И СтрокаДанных.ЕстьВПулеКодовМаркировки Тогда
							ПолныйКодМаркировки = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.Base64ВШтрихкод(СтрокаДанных.ПолныйКодМаркировки);
							ДанныеРазбораПолногоКода = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ПолныйКодМаркировки, СтрокаДанных.ВидыПродукцииКодаМаркировки);
							Если ДанныеРазбораПолногоКода <> Неопределено
								И ДанныеРазбораПолногоКода.СоставКодаМаркировки <> Неопределено
								И ДанныеРазбораПолногоКода.СоставКодаМаркировки.Свойство("ВключаетКриптоХвост") Тогда
								КодВключаетКриптоХвост = ДанныеРазбораПолногоКода.СоставКодаМаркировки.ВключаетКриптоХвост;
								Если КодВключаетКриптоХвост
									И ВключаетИдентификаторыПрименения
									И Не СодержитРазделительGS Тогда
									СодержитРазделительGS = СтрНайти(ПолныйКодМаркировки, РазборКодаМаркировкиИССлужебныйКлиентСервер.РазделительGS()) > 0;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					Если Не КодВключаетКриптоХвост
						И Не СтрокаДерева.ЕстьВПулеКодовМаркировки Тогда
						
						ЕстьОшибки = Истина;
						ПравилаПроверкиНаОшибки.КонтрольПолногоКодаМаркировки.Добавить(
							Новый Структура(
								"СтрокаДерева, ТекстОшибки",
								СтрокаДерева,
								НСтр("ru = 'В структуре кода маркировки отсутствует криптохвост.
								|Отсканируйте полный код маркировки.'")));
						
					ИначеЕсли Не КодВключаетКриптоХвост
						И ПроверятьСтруктуруКодовМаркировки Тогда
						
						ЕстьОшибки = Истина;
						ПравилаПроверкиНаОшибки.КонтрольПолногоКодаМаркировки.Добавить(
							Новый Структура(
								"СтрокаДерева, ТекстОшибки",
								СтрокаДерева,
								НСтр("ru = 'В структуре кода маркировки отсутствует криптохвост.
								|Отсканируйте полный код маркировки или в настройках сканирования отключите опцию ""Проверять структуру кодов маркировки"".'")));
						
					ИначеЕсли ПроверятьСтруктуруКодовМаркировки
						И КодВключаетКриптоХвост
						И ВключаетИдентификаторыПрименения
						И Не СодержитРазделительGS
						И Не ДанныеРазбора.Детализация.НачинаетсяСоСкобки Тогда
						
						ЕстьОшибки = Истина;
						ПравилаПроверкиНаОшибки.КонтрольПолногоКодаМаркировки.Добавить(
							Новый Структура(
								"СтрокаДерева, ТекстОшибки",
								СтрокаДерева, НСтр("ru = 'В структуре кода маркировки отсутствуют разделители GS'")));
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтролироватьСоставГрупповыхУпаковок") Тогда
			
			Если СтрокаДанных <> Неопределено
				И ШтрихкодированиеИСМПСлужебный.ПроверитьНаОшибкиГрупповуюУпаковку(СтрокаДанных, СтрокаДерева, ПравилаПроверкиНаОшибки) Тогда
				ЕстьОшибки = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравилаПроверкиНаОшибки.Свойство("КонтролироватьСоставЛогистическихУпаковок") Тогда
			
			Если СтрокаДанных <> Неопределено
				И Не ГрупповаяОбработкаШтрихкодовИС.ЭтоАгрегатТСД(СтрокаДерева.Штрихкод)
				И ШтрихкодированиеИСМПСлужебный.ПроверитьНаОшибкиЛогистическуюУпаковку(СтрокаДанных, СтрокаДерева, ПравилаПроверкиНаОшибки) Тогда
				ЕстьОшибки = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		ПравилаПроверкиНаОшибки.ПроверенныеШтрихкоды.Вставить(СтрокаДерева.Штрихкод, Истина);
		ПроверитьНаОшибкиСтрокиДерева(СтрокаДерева.Строки, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ДанныеПоШтрихкодам, ЕстьОшибки);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ДополнениеДанныхШтрихкодовСпецификой

#Область НормализацияДанныхВложенныхШтрихкодов

#Область НормализацияДанныхДереваУпаковок

Функция КоллекцияДополнительныхКолонокДереваУпаковокДляФормыПроверкиКодовМаркировки(КоллекцияДополнительныхКолонок = Неопределено) Экспорт
	
	Если КоллекцияДополнительныхКолонок = Неопределено Тогда
		КоллекцияДополнительныхКолонок = Новый Структура;
	КонецЕсли;
	
	КоллекцияДополнительныхКолонок.Вставить("ДатаЭмиссии",               Новый ОписаниеТипов("Дата"));
	КоллекцияДополнительныхКолонок.Вставить("ДатаВводаВОборот",          Новый ОписаниеТипов("Дата"));
	КоллекцияДополнительныхКолонок.Вставить("ДатаНанесения",             Новый ОписаниеТипов("Дата"));
	КоллекцияДополнительныхКолонок.Вставить("ИННПроизводителя",          Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("НаименованиеПроизводителя", Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("ПредставлениеНоменклатуры", Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("НомерПартии",               Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("КодТНВЭД",                  Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("ГруппаТНВЭД",               Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("ГруппаОКПД2",               Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("КодОКПД2",                  Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("КодАлкогольнойПродукции",   Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("ИмяТоварнойГруппы",         Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("ИдентификаторПроизводственногоВСД", Новый ОписаниеТипов("Строка"));
	КоллекцияДополнительныхКолонок.Вставить("ПодлежитВетеринарномуКонтролю");

	Возврат КоллекцияДополнительныхКолонок;
	
КонецФункции

// Выполняет замену значений строки дерева со значениями Неопределено на пустые ссылки.
// 
// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений - Описание
Процедура ЗаменитьЗначенияНеопределеноНаПустыеСсылкиВСтрокеДерева(СтрокаДерева) Экспорт
	
	ПустаяНоменклатура   = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Номенклатура");
	ПустаяХарактеристика = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ХарактеристикаНоменклатуры");
	ПустаяСерия          = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры");
	
	Если СтрокаДерева.Номенклатура = Неопределено Тогда
		СтрокаДерева.Номенклатура = ПустаяНоменклатура;
	КонецЕсли;
	
	Если СтрокаДерева.Характеристика = Неопределено Тогда
		СтрокаДерева.Характеристика = ПустаяХарактеристика;
	КонецЕсли;
	
	Если СтрокаДерева.Серия = Неопределено Тогда
		СтрокаДерева.Серия = ПустаяСерия;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

Процедура ЗапросИРасчетМРЦПоСтрокамДерева(ЗапрашиваемыеСтроки, ВычисляемыеСтроки, ПараметрыСканирования) Экспорт
	
	СтрокиЗапроса    = Новый Массив();
	СтрокиВычисления = Новый Массив();
	КэшРезультат     = Новый Соответствие();
	
	Если Не ОбщегоНазначенияИСМПКлиентСервер.ЗначениеПараметраСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитыватьМРЦ()
		И Не ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП
		И Не ПараметрыСканирования.ЭтоОтчетПроизводственнойЛинии Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из ЗапрашиваемыеСтроки Цикл
		
		Если УчитыватьМРЦПоСтрокеКоллекции(СтрокаДерева, КэшРезультат, ПараметрыСканирования) Тогда
			СтрокиЗапроса.Добавить(СтрокаДерева);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаДерева Из ВычисляемыеСтроки Цикл
		
		Если УчитыватьМРЦПоСтрокеКоллекции(СтрокаДерева, КэшРезультат, ПараметрыСканирования) Тогда
			СтрокиВычисления.Добавить(СтрокаДерева);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекущиеСтрокиЗапроса = СтрокиЗапроса;
	Пока ТекущиеСтрокиЗапроса.Количество() > 0
		Или СтрокиВычисления.Количество() > 0 Цикл
		
		ИнтерфейсМОТП.ЗапросМРЦПоСтрокамДерева(ТекущиеСтрокиЗапроса);
		РасчетМРЦПоСтрокамДерева(СтрокиВычисления);
		
		ТекущиеСтрокиЗапроса = Новый Массив();
		Для Каждого СтрокаРасчета Из СтрокиВычисления Цикл
			Если Не ЗначениеЗаполнено(СтрокаРасчета.МРЦ) Тогда
				ТекущиеСтрокиЗапроса.Добавить(СтрокаРасчета);
			КонецЕсли;
		КонецЦикла;
		
		СтрокиВычисления.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

// Дополняет таблицу "Маркированные товары" табачными блоками, которые присутствуют в "Дереве упаковок".
//
// Параметры:
//  СтрокиДерева - КоллекцияСтрокДереваЗначений - Строки "Дерева упаковок".
//  МаркированныеТовары - ТаблицаЗначений - таблица с маркированными товарами.
//  УпаковкаВерхнегоУровня - СтрокаДереваЗначений - Самая верхняя строка в иерархии.
Процедура ДополнитьМаркированныеТоварыБлокамиПоСтрокамДерева(СтрокиДерева, МаркированныеТовары, УпаковкаВерхнегоУровня = Неопределено)

	Для Каждого СтрокаДерева Из СтрокиДерева Цикл

		Если УпаковкаВерхнегоУровня = Неопределено Тогда
			УпаковкаВерхнегоУровня = СтрокаДерева.ШтрихкодУпаковки;
		КонецЕсли;

		Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
			НоваяСтрока = МаркированныеТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
			НоваяСтрока.СтрокаДерева = СтрокаДерева;
			НоваяСтрока.УпаковкаВерхнегоУровня = УпаковкаВерхнегоУровня;
		КонецЕсли;

		ДополнитьМаркированныеТоварыБлокамиПоСтрокамДерева(СтрокаДерева.Строки, МаркированныеТовары, УпаковкаВерхнегоУровня);

	КонецЦикла;

КонецПроцедуры

// Дополняет данные по штрихкодам спецификой табачной продукции, полученной из МОТП.
//
// Параметры:
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам).
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
//  МассивСтрок - См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки
Процедура ДополнитьДанныеПоШтрихкодамСпецификойСЗапросомСтатусовМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования, МассивСтрок = Неопределено)
	
	Если МассивСтрок = Неопределено Тогда
		МассивСтрок = ДанныеПоШтрихкодам.ДанныеКодовМаркировки;
	КонецЕсли;
	
	СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок = СформироватьДеревоУпаковокПоДаннымСервиса(
		ДанныеПоШтрихкодам, ПараметрыСканирования, МассивСтрок);
	
	ДополнитьТаблицуДанныеКодовМаркировкиСпецификой(
		Неопределено,
		СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок,
		ДанныеПоШтрихкодам,
		ПараметрыСканирования);
	
	ПотребительскиеУпаковки = СтрокиТаблицыДанныхДляПолученияСпецифики(
		МассивСтрок, СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок, ПараметрыСканирования);
	
	Если ПотребительскиеУпаковки.Количество() > 0 Тогда
		
		Результат = СпецификаДляДополненияДанныхПоШтрихкодам(
			ПотребительскиеУпаковки,
			ПараметрыСканирования);
		Если Результат.ЕстьОшибки Тогда
			
			ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
			ДанныеПоШтрихкодам.ТекстОшибки                    = Результат.ТекстОшибки;
			ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = Результат.ТребуетсяОбновлениеКлючаСессии;
			
			Возврат;
			
		Иначе
			СпецификаШтрихкодовПотребительскихУпаковок = Результат.СпецификаШтрихкодов;
		КонецЕсли;
		
		ДополнитьТаблицуДанныеКодовМаркировкиСпецификой(
			СпецификаШтрихкодовПотребительскихУпаковок,
			Неопределено,
			ДанныеПоШтрихкодам,
			ПараметрыСканирования);
		
	КонецЕсли;
	
	СтрокиДанныхДляЗаполненияПредставления = Новый Массив;
	МассивНеизвестныхEAN                   = Новый Массив;
	Для Каждого СтрокаДанных Из ПотребительскиеУпаковки Цикл
		Если СтрокаДанных.ТребуетсяСопоставление
			И Не ЗначениеЗаполнено(СтрокаДанных.ПредставлениеНоменклатуры) Тогда
			МассивНеизвестныхEAN.Добавить(СтрокаДанных.EAN);
			СтрокиДанныхДляЗаполненияПредставления.Добавить(СтрокаДанных);
		КонецЕсли;
	КонецЦикла;
	МассивНеизвестныхEAN = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНеизвестныхEAN);
	
	Если СтрокиДанныхДляЗаполненияПредставления.Количество() > 0 Тогда
		ШтрихкодированиеИСМПСлужебный.ЗаполнитьПредставлениеНоменклатурыПоДаннымИСМП(
			ДанныеПоШтрихкодам, СтрокиДанныхДляЗаполненияПредставления, МассивНеизвестныхEAN);
	КонецЕсли;
	
	Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
		И ПараметрыСканирования.ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП Тогда
		
		// Логистические упаковки проверяются отдельно
		РезультатПроверкиСеройЗоны = ПроверитьПотребительскиеУпаковкиНаВхождениеВСеруюЗону(ПотребительскиеУпаковки, ПараметрыСканирования);
		
		Если Не ПустаяСтрока(РезультатПроверкиСеройЗоны.ТекстОшибки) Тогда
			
			ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
			ДанныеПоШтрихкодам.ТекстОшибки                    = РезультатПроверкиСеройЗоны.ТекстОшибки;
			ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = РезультатПроверкиСеройЗоны.ТребуетсяОбновлениеКлючаСессии;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет строки таблицы Данные кодов маркировки спецификой, полученной из МОТП.
// 
// Параметры:
//  СпецификаШтрихкодов - Соответствие - Ключ - строка таблицы Данные кодов маркировки, значение - специфика, полученная
//                                       из сервиса МОТП.
//  ДеревоПоДаннымСервиса - ДеревоЗначений - Дерево кодов маркировки по данным сервиса.
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования.
Процедура ДополнитьТаблицуДанныеКодовМаркировкиСпецификой(
	СпецификаШтрихкодовПотребительскихУпаковок,
	СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок, ДанныеПоШтрихкодам, ПараметрыСканирования)
	
	ПредставленияСтатусов = ШтрихкодированиеОбщегоНазначенияИСМП.ПредставленияСтатусов();
	
	Если СпецификаШтрихкодовПотребительскихУпаковок <> Неопределено Тогда
		НаличиеКолонокВДанных = Новый Соответствие;
		Для Каждого КлючЗначение Из СпецификаШтрихкодовПотребительскихУпаковок Цикл
			
			СтрокаТаблицыДанных = КлючЗначение.Ключ;
			СпецификаСтроки     = КлючЗначение.Значение;
			
			Если ЗначениеЗаполнено(СпецификаСтроки) Тогда
				
				ПоляДляЗаполнения = Новый Массив;
				Для Каждого КлючИЗначение Из СпецификаСтроки Цикл
					
					ИмяСвойства  = КлючИЗначение.Ключ;
					ЕстьСвойство = НаличиеКолонокВДанных.Получить(ИмяСвойства);
					Если ЕстьСвойство = Неопределено Тогда
						ЕстьСвойство = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицыДанных, ИмяСвойства);
						НаличиеКолонокВДанных.Вставить(ИмяСвойства, ЕстьСвойство);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(КлючИЗначение.Значение)
						И ЕстьСвойство Тогда
						ПоляДляЗаполнения.Добавить(КлючИЗначение.Ключ);
					КонецЕсли;
					
				КонецЦикла;
				
				Если ПоляДляЗаполнения.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыДанных, СпецификаСтроки, СтрСоединить(ПоляДляЗаполнения, ","));
				КонецЕсли;
				
				Если СтрокаТаблицыДанных.СтрокаДерева = Неопределено Тогда
					Если СтрокаТаблицыДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
						КоличествоПотребительскихУпаковок = 0;
						Если СпецификаСтроки <> Неопределено И СпецификаСтроки.ВложенныеУпаковки <> Неопределено Тогда
							КоличествоПотребительскихУпаковок = СпецификаСтроки.ВложенныеУпаковки.Количество();
						КонецЕсли;
						СтрокаТаблицыДанных.КоличествоГрупповыхУпаковок       = 1;
						СтрокаТаблицыДанных.КоличествоПотребительскихУпаковок = КоличествоПотребительскихУпаковок;
					ИначеЕсли СтрокаТаблицыДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
						СтрокаТаблицыДанных.КоличествоГрупповыхУпаковок       = 0;
						СтрокаТаблицыДанных.КоличествоПотребительскихУпаковок = 1;
					Иначе
						СтрокаТаблицыДанных.КоличествоГрупповыхУпаковок       = 0;
						СтрокаТаблицыДанных.КоличествоПотребительскихУпаковок = СтрокаТаблицыДанных.ПлановоеКоличествоПотребительскихУпаковок;
					КонецЕсли;
				Иначе
					СтрокаТаблицыДанных.КоличествоГрупповыхУпаковок       = СтрокаТаблицыДанных.СтрокаДерева.КоличествоГрупповыхУпаковок;
					СтрокаТаблицыДанных.КоличествоПотребительскихУпаковок = СтрокаТаблицыДанных.СтрокаДерева.КоличествоПотребительскихУпаковок;
				КонецЕсли;
				
				СтрокаТаблицыДанных.ПредставлениеСтатуса = ПредставленияСтатусов.Получить(СтрокаТаблицыДанных.Статус);
				
				ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокуПоДаннымРазбораКодаМаркировки(
					СтрокаТаблицыДанных, Неопределено,
					ПараметрыСканирования);
				
				Если ШтрихкодированиеИСМПСлужебный.ТребуетсяЗагрузкаВложенныхКодовМаркировки(
					СпецификаСтроки, СтрокаТаблицыДанных, ПараметрыСканирования) Тогда
					СтрокаТаблицыДанных.Идентифицирован = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	Если СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок <> Неопределено
		И СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок.Количество() Тогда
		
		ПараметрыОбработки = Новый Структура;
		ПараметрыОбработки.Вставить("ЭтоДополнениеСпецификойПотребительскихУпаковок",                 Ложь);
		ПараметрыОбработки.Вставить("ЭтоДополнениеСпецификойГрупповыхУпаковокИЛогистическихУпаковок", Истина);
		ПараметрыОбработки.Вставить("ЭтоЗаполнениеВложенныхШтрихкодов",                               Ложь);
		
		ШтрихкодированиеИСМПСлужебный.ОбработатьДеревоПолученноеИзИСМП(
			ДанныеПоШтрихкодам.ДеревоПоДаннымСервиса, ДанныеПоШтрихкодам, ПараметрыСканирования, ПараметрыОбработки);
		
		Для Каждого КлючЗначение Из СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок Цикл
			
			СтрокаТаблицыДанных = КлючЗначение.Ключ;
			СпецификаСтроки     = КлючЗначение.Значение;
			
			Если ЗначениеЗаполнено(СпецификаСтроки) Тогда
				
				Если ШтрихкодированиеИСМПСлужебный.ТребуетсяЗагрузкаВложенныхКодовМаркировки(
					СпецификаСтроки, СтрокаТаблицыДанных, ПараметрыСканирования) Тогда
					СтрокаТаблицыДанных.Идентифицирован = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает все коды маркировки, находящиеся в данных по штрихкодам.
// 
// Параметры:
//  ДанныеПоШтрихкодам                                 - См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам
//  СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок - Соответствие
//  ПараметрыСканирования                              - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
// Возвращаемое значение:
//  Массив из Строка - Коды маркировки.
Функция СтрокиТаблицыДанныхДляПолученияСпецифики(ДанныеКодовМаркировки, СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок, ПараметрыСканирования)
	
	СтрокиТаблицыДанных = Новый Массив;
	
	Для Каждого СтрокаДанных Из ДанныеКодовМаркировки Цикл
		
		Если СтрокаДанных.ОбработанСОшибками Тогда
			Продолжить;
		КонецЕсли;
		
		ПеречитыватьДляОбязательныхТоварныхГруппПриРозничнойПродажеГИСМТ =
			Не СтрокаДанных.ПодлежитПроверкеРазрешительногоРежима
			Или ЗначениеЗаполнено(СтрокаДанных.РазрешительныйРежимИдентификаторЗапросаГИСМТ);
		
		Если ВозможнаПродукцияМОТП(СтрокаДанных)
			И ЗначениеЗаполнено(СтрокаДанных.ШтрихкодУпаковки)
			И (СтрокаДанных.Входящий Или Не ЗначениеЗаполнено(СтрокаДанных.Статус))
			И ПеречитыватьДляОбязательныхТоварныхГруппПриРозничнойПродажеГИСМТ
			И СпецификаШтрихкодовГрупповыхИЛогистическихУпаковок[СтрокаДанных] = Неопределено Тогда
				СтрокиТаблицыДанных.Добавить(СтрокаДанных);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрокиТаблицыДанных;
	
КонецФункции

// Возвращает признак, что обрабатываемый код маркировки относится либо может относиться к МОТП
//
// Параметры:
//   СтрокаДанных - Произвольный - элемент коллекции "ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки"
//     либо совместимый по полям (строка дерева значений, структура).
// Возвращаемое значение:
//   Булево - в текущей строке продукция МОТП явно присутствует либо возможна
Функция ВозможнаПродукцияМОТП(СтрокаДанных)

	Если СтрокаДанных.ЭтоШтрихкодНоменклатуры Тогда
		Возврат Ложь;
	ИначеЕсли ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(СтрокаДанных.ВидПродукции) Тогда
		Возврат Истина;
	ИначеЕсли ЗначениеЗаполнено(СтрокаДанных.ВидПродукции) Тогда
		Возврат Ложь;
	ИначеЕсли СтрокаДанных.ПрисутствуетТабачнаяПродукция Тогда // Флаг заполняется если неизвестно АТП это или классический табак
		Возврат Истина;
	КонецЕсли;

	Для Каждого ВидПродукции Из СтрокаДанных.ВидыПродукцииКодаМаркировки Цикл
		Если ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(ВидПродукции) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Получает дерево упаковок из системы МОТП для контроля расхождений состава с данными ИБ.
//
// Параметры:
//  ДанныеПоШтрихкодам - См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования
//  МассивСтрок - См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//   * Ключ     - См. ИнициализацияТаблицыДанныхКодовМаркировки
//   * Значение - СтрокаДереваЗначений
Функция СформироватьДеревоУпаковокПоДаннымСервиса(ДанныеПоШтрихкодам, ПараметрыСканирования, МассивСтрок = Неопределено)
	
	ТребуютсяПроверки = (ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
		И ПараметрыСканирования.ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТП)
		Или ПараметрыСканирования.КонтролироватьРасхождениеСоставаУпаковокМеждуИБиИСМП;
	
	Если Не ТребуютсяПроверки Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Если МассивСтрок = Неопределено Тогда
		МассивСтрок = ДанныеПоШтрихкодам.ДанныеКодовМаркировки;
	КонецЕсли;
	
	СтрокиТаблицыДляЗапроса = Новый Массив;
	Для Каждого СтрокаДанных Из МассивСтрок Цикл
		
		Если СтрокаДанных.ОбработанСОшибками Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначенияИСКлиентСервер.ЭтоУпаковкаПоВиду(СтрокаДанных.ВидУпаковки,, Ложь)
			И ШтрихкодированиеОбщегоНазначенияИС.ПрисутствуетТабачнаяПродукция(СтрокаДанных.ВидыПродукцииКодаМаркировки)
			И ЗначениеЗаполнено(СтрокаДанных.ШтрихкодУпаковки)
			И СтрокаДанных.Входящий
			И (СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
				И Не СтрокаДанных.ПодлежитПроверкеРазрешительногоРежима
				Или Не СтрокаДанных.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая) Тогда
			
			СтрокиТаблицыДляЗапроса.Добавить(СтрокаДанных);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрокиТаблицыДляЗапроса.Количество() = 0 Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	РезультатПолученияДанных = ШтрихкодированиеИСМПСлужебный.ДеревоУпаковокПоДаннымИСМП(СтрокиТаблицыДляЗапроса, ПараметрыСканирования); 
	Если ЗначениеЗаполнено(РезультатПолученияДанных.ТекстОшибки) Тогда
		
		ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
		ДанныеПоШтрихкодам.ТекстОшибки                    = РезультатПолученияДанных.ТекстОшибки;
		ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = РезультатПолученияДанных.ТребуетсяОбновлениеКлючаСессии;
		
	Иначе
		
		Если ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП
			И ПараметрыСканирования.ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТП Тогда
			
			РезультатПроверкиСеройЗоны = ПроверитьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодов(
				РезультатПолученияДанных, ДанныеПоШтрихкодам.ДанныеКодовМаркировки, ПараметрыСканирования);
			
			Если Не ПустаяСтрока(РезультатПроверкиСеройЗоны.ТекстОшибки) Тогда
				
				ДанныеПоШтрихкодам.ЕстьОшибки                     = Истина;
				ДанныеПоШтрихкодам.ТекстОшибки                    = РезультатПроверкиСеройЗоны.ТекстОшибки;
				ДанныеПоШтрихкодам.ТребуетсяОбновлениеКлючаСессии = РезультатПроверкиСеройЗоны.ТребуетсяОбновлениеКлючаСессии;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеПоШтрихкодам.ДеревоПоДаннымСервиса = РезультатПолученияДанных.ДеревоУпаковок;
		
	КонецЕсли;
	
	Возврат РезультатПолученияДанных.СоответствиеСтрокДерева;
	
КонецФункции

Процедура ДополнитьДанныеПоШтрихкодамСпецификойЧастичногоВыбытия(ДанныеПоШтрихкодам, ПараметрыСканирования)
	
	Если Не ШтрихкодированиеОбщегоНазначенияИС.ТребуетсяЧастичноеВыбытие(ПараметрыСканирования, ДанныеПоШтрихкодам) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = Неопределено;
	Для Каждого СтрокаДанных Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		Если ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(СтрокаДанных.ВидПродукции) Тогда
			ШтрихкодированиеИСМПСлужебный.ДобавитьСтрокуДляЗаполненияДаннымиЧастичногоВыбытия(
				СтрокаДанных,
				ПараметрыСканирования,
				ДанныеЗаполнения);
		КонецЕсли;
	КонецЦикла;
	
	ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхДаннымиЧастичногоВыбытия(
		ДанныеПоШтрихкодам,
		ДанныеЗаполнения,
		ПараметрыСканирования);
	
	Если Не ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева
		И ДанныеПоШтрихкодам.ВложенныеШтрихкоды <> Неопределено Тогда
		
		Для Каждого СтрокаДанных Из ДанныеПоШтрихкодам.ВложенныеШтрихкоды.МаркированныеТовары Цикл
			
			Если СтрокаДанных.СтрокаДерева <> Неопределено
				И ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(СтрокаДанных.ВидПродукции)
				И ОбщегоНазначенияИСКлиентСерверПовтИсп.ПоддерживаетсяЧастичноеВыбытие(
					СтрокаДанных.ВидПродукции,
					ПараметрыСканирования.ВидОперацииИСМП) Тогда
				
				СтрокаДанных.ЧастичноеВыбытие               = СтрокаДанных.СтрокаДерева.ЧастичноеВыбытие;
				СтрокаДанных.ЧастичноеВыбытиеВариантУчета   = СтрокаДанных.СтрокаДерева.ЧастичноеВыбытиеВариантУчета;
				СтрокаДанных.Количество                     = СтрокаДанных.СтрокаДерева.Количество;
				СтрокаДанных.ЕмкостьПотребительскойУпаковки = СтрокаДанных.СтрокаДерева.ЕмкостьПотребительскойУпаковки;
				СтрокаДанных.ЧастичноеВыбытиеНоменклатура   = СтрокаДанных.СтрокаДерева.ЧастичноеВыбытиеНоменклатура;
				СтрокаДанных.ЧастичноеВыбытиеХарактеристика = СтрокаДанных.СтрокаДерева.ЧастичноеВыбытиеХарактеристика;
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

#Область УчетМРЦ

Функция УчитыватьМРЦПоСтрокеКоллекции(СтрокаКоллекции, Кэш, ПараметрыСканирования, УчетМРЦВключен = Истина)
	
	ВозвращаемоеЗначение = Ложь;
	
	Если УчетМРЦВключен
		И КонструкторИСМПОбщегоНазначенияКлиентСервер.ДоступноПолеМРЦ(СтрокаКоллекции.ВидПродукции) Тогда
		
		Если СтрокаКоллекции.ПодлежитПроверкеРазрешительногоРежима Тогда
			
			ТребуетсяЗапрос = Ложь;
			
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаКоллекции, "Номенклатура") Тогда
			
			ТребуетсяЗапрос = Кэш.Получить(СтрокаКоллекции.Номенклатура);
			Если ТребуетсяЗапрос = Неопределено Тогда
				
				ТребуетсяЗапрос = Истина;
				ШтрихкодированиеМОТППереопределяемый.ПриОпределенииНеобходимостиЗапросаМРЦ(
					СтрокаКоллекции.Номенклатура,
					ТребуетсяЗапрос);
				Кэш.Вставить(СтрокаКоллекции.Номенклатура, ТребуетсяЗапрос);
				
			КонецЕсли;
			
		Иначе
			
			ТребуетсяЗапрос = УчетМРЦВключен;
			
		КонецЕсли;
		
		Если ТребуетсяЗапрос Тогда
			ВозвращаемоеЗначение = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

Процедура ДополнитьДанныеПоШтрихкодамСпецификойМинимальныхЦен(ДанныеПоШтрихкодам, ПараметрыСканирования) Экспорт
	
	Если ПараметрыСканирования.Свойство("КонтролироватьМинимальныеЦены")
		И ПараметрыСканирования.КонтролироватьМинимальныеЦены Тогда
		ТаблицаКодовМаркировки = ДанныеПоШтрихкодам.ДанныеКодовМаркировки;
		
		Если ТаблицаКодовМаркировки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураМинимальныхЦен = ОбщегоНазначенияИСМП.МинимальнаяЦенаРозничнойПродажиТабачнойПродукции();
		Если Не СтруктураМинимальныхЦен.ЗагруженыАктуальныеЦены Тогда
			Возврат;
		КонецЕсли;
		
		МинимальнаяЦена = СтруктураМинимальныхЦен.МинРЦ;
		
		Для Каждого СтрокаКодаМаркировки Из ТаблицаКодовМаркировки Цикл
			Если СтрокаКодаМаркировки.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Потребительская Тогда
				Продолжить;
			КонецЕсли; 
			
			МаксимальнаяЦена = СтрокаКодаМаркировки.МРЦ;
			
			Если МаксимальнаяЦена = 0 Тогда
				СоставКодаМаркировки = СтрокаКодаМаркировки.ДанныеРазбора.СоставКодаМаркировки;
				Если СоставКодаМаркировки <> Неопределено
					И СоставКодаМаркировки.Свойство("ВключаетМРЦ")
					И СоставКодаМаркировки.ВключаетМРЦ Тогда
					МаксимальнаяЦена = СоставКодаМаркировки.МРЦ;
				КонецЕсли;
			КонецЕсли;
			
			Если МаксимальнаяЦена < МинимальнаяЦена Тогда
				СтрокаКодаМаркировки.ТекстОшибки = НСтр("ru='МРЦ меньше минимальной розничной цены Р'");
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
