#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Источник <> Неопределено Тогда
		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		СвойстваСписка.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "ИСТИНА", "ТаблицаРегистраПереопределяемый.Источник = &Источник");
		ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
		Список.Параметры.УстановитьЗначениеПараметра("Источник", Параметры.Источник);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
