#Область ПрограммныйИнтерфейс

// Записать данные маркируемой продукции.
// 
// Параметры:
//  ПараметрыЗаписи - см. АдминистрированиеИСМПКлиентСервер.ПараметрыЗаписиМаркируемойПродукции
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока, Строка - Записать данные маркируемой продукции
Функция ЗаписатьДанныеМаркируемойПродукции(ПараметрыЗаписи) Экспорт
	
	Результат                                  = "";
	ИменаДатНачалаРаботыСМаркируемойПродукцией = КонструкторИСМПОбщегоНазначенияКлиентСервер.ИменаДатНачалаРаботыСМаркируемойПродукцией();
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого СтрокаДанных Из ПараметрыЗаписи.Данные Цикл
			
			Если ПараметрыЗаписи.ЗаписыватьВидПродукции
				И СтрокаДанных.ВидПродукцииВерхнегоУровня Тогда
				Набор = РегистрыСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.СоздатьНаборЗаписей();
				Набор.Отбор.ЭлементКонструктора.Установить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ);
				Набор.Отбор.ВидПродукции.Установить(СтрокаДанных.ВидПродукции);
				Запись = Набор.Добавить();
				Запись.ЭлементКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ;
				Запись.ВидПродукции = СтрокаДанных.ВидПродукции;
				Запись.ПометкаУдаления = СтрокаДанных.УдалениеДанных;
				Набор.Записать();
			КонецЕсли;
			
			Для Каждого Имя Из ИменаДатНачалаРаботыСМаркируемойПродукцией Цикл
				Если ПараметрыЗаписи["Записывать" + Имя] Тогда
					ИмяЭлементаКонструктора = КонструкторИСМПОбщегоНазначенияКлиентСервер.ИмяЭлементаКонструктораПоИмениДаты(Имя);
					Набор = РегистрыСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.СоздатьНаборЗаписей();
					Набор.Отбор.ЭлементКонструктора.Установить(Справочники.ЭлементыКонструктораВидовПродукцииИС[ИмяЭлементаКонструктора]);
					Набор.Отбор.ВидПродукции.Установить(СтрокаДанных.ВидПродукции);
					Если ЗначениеЗаполнено(СтрокаДанных[Имя]) Тогда
						Запись = Набор.Добавить();
						Запись.ЭлементКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС[ИмяЭлементаКонструктора];
						Запись.ВидПродукции = СтрокаДанных.ВидПродукции;
						Запись.Значение = СтрокаДанных[Имя];
						Запись.ПометкаУдаления = СтрокаДанных.УдалениеДанных;
					КонецЕсли;
					Набор.Записать();
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Результат = ОбработкаОшибок.СообщениеОбОшибкеДляПользователя(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти