#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Замещение Тогда
		ЭлементКонструктора = Отбор.ЭлементКонструктора.Значение;
		Если ЗначениеЗаполнено(ЭлементКонструктора) Тогда
			ПараметрыЭлемента = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементаКонструктора(ЭлементКонструктора);
			Если ПараметрыЭлемента.КаждомуВидуПродукцииСоответствуетОдноЗначение Тогда
				ВидыПродукции = Новый Массив;
				Для Каждого Запись Из ЭтотОбъект Цикл
					Если ЗначениеЗаполнено(Запись.ВидПродукции) Тогда
						Если ВидыПродукции.Найти(Запись.ВидПродукции) <> Неопределено Тогда
							СообщитьОбОшибкеКонтроляУникальности(Запись.ВидПродукции, Отказ);
							Возврат;
						КонецЕсли;
						ВидыПродукции.Добавить(Запись.ВидПродукции);
					КонецЕсли;
				КонецЦикла;
				ВыполнитьПроверкуКонтроляУникальностиПоВидуПродукции(ЭлементКонструктора, ВидыПродукции, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьПроверкуКонтроляУникальностиПоВидуПродукции(ЭлементКонструктора, ВидыПродукции, Отказ)
	
	Если ВидыПродукции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭлементКонструктора", ЭлементКонструктора);
	Запрос.УстановитьПараметр("ВидыПродукции", ВидыПродукции);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияЭлементовКонструктораВидовПродукцииИС.ВидПродукции
	|ИЗ
	|	РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктораВидовПродукцииИС
	|ГДЕ
	|	ЗначенияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора = &ЭлементКонструктора
	|	И ЗначенияЭлементовКонструктораВидовПродукцииИС.ВидПродукции В (&ВидыПродукции)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СообщитьОбОшибкеКонтроляУникальности(Выборка.ВидПродукции, Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура СообщитьОбОшибкеКонтроляУникальности(ВидПродукции, Отказ)
	
	ОбщегоНазначения.СообщитьПользователю(
		СтрШаблон(НСтр("ru = 'Значение для вида продукции %1 должно быть уникально'"),
		ВидПродукции),,,, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли