#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборСостояние = "Активные";
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере_ФормаСписка(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборДинСписка();
	
	ПериодОбновления = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПериодОбновленияФорм");	
	ПодключитьОбработчикОжидания("ОбновитьСписок", ПериодОбновления, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусДокументооборотаПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НовыйТ1(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ЗЗ_Титул1.ФормаОбъекта",
		, ЭтаФорма, ЭтаФорма, "ОбработчикОбновитьСписок");
		
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработчикОбновитьСписок(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт

	ОтборСостояние = "Активные";	
	УстановитьОтборДинСписка();
	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок()
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинСписка()
	
	Список.Отбор.Элементы.Очистить(); 
	
	Если ЗначениеЗаполнено(ОтборСтатусДокументооборота) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусДокументооборота");
		ЭлементОтбора.ПравоеЗначение = ОтборСтатусДокументооборота;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если  ОтборСостояние <> "Все" Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		ЭлементОтбора.ПравоеЗначение = Ложь;
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусДокументооборота");
		ЭлементОтбора.Использование = Истина;
		
		Если ОтборСостояние = "Активные" Тогда
			
			ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостоянияЗЗ_НеЗавершена_ДляСписка();
			
		ИначеЕсли ОтборСостояние = "Завершенные" Тогда
			
			ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостоянияЗЗ_ЗавешенаУспешно_ДляСписка();
			
		ИначеЕсли ОтборСостояние = "Отказ" Тогда
			
			ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостоянияЗЗ_Отказы();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьСписок();
	
КонецПроцедуры

#КонецОбласти