#Область ПрограммныйИнтерфейс
// Получить структуру параметров HTTP запроса.
// 
// Возвращаемое значение:
//  Структура -  Получить структуру параметров HTTPЗапроса:
// * АдресСервера - Строка - Адрес сервера 
// * ПортСервера - Число - Порт сервера
// * ЗащищенноеСоединение - Булево - Защищенное соединение. Использовать SSL
// * Метод - Строка - Метод (GET/POST и т.п.)
// * СтрокаПодключения - Строка - Строка ресурса на сервере
// * ЗаголовокHTTP - Соответствие из Строка - Куки
// * ОтправитьФайл - Булево - Признак отправки файла
// * ПолучитьФайл - Булево - Признак получения файла
// * ТелоЗапроса - Неопределено, Строка, ДвоичныеДанные - Передаваемые данные
Функция ПолучитьСтруктуруПараметровHTTPЗапроса() Экспорт
	ПараметрыHTTPЗапроса	= Новый Структура;
	ПараметрыHTTPЗапроса.Вставить("АдресСервера", "");
	ПараметрыHTTPЗапроса.Вставить("ПортСервера", 80);
	ПараметрыHTTPЗапроса.Вставить("ЗащищенноеСоединение", Ложь);
	ПараметрыHTTPЗапроса.Вставить("Метод", "");
	ПараметрыHTTPЗапроса.Вставить("СтрокаПодключения", "");
	ПараметрыHTTPЗапроса.Вставить("ЗаголовокHTTP", Новый Соответствие);
	ПараметрыHTTPЗапроса.Вставить("ОтправитьФайл", Ложь);
	ПараметрыHTTPЗапроса.Вставить("ПолучитьФайл", Ложь);
	ПараметрыHTTPЗапроса.Вставить("ТелоЗапроса", Неопределено);

	Возврат ПараметрыHTTPЗапроса;

КонецФункции

// Инициализировать результат функции.
// 
// Возвращаемое значение:
//  Неопределено, Структура - Инициализировать результат функции:
// * data - Неопределено, Произвольный - 
// * error - Булево - 
// * message - Строка - 
// * traceId - Строка - 
Функция ИнициализироватьРезультатФункции() Экспорт

	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("data", Неопределено);
	РезультатФункции.Вставить("error", Ложь);
	РезультатФункции.Вставить("message", "");
	РезультатФункции.Вставить("traceId", "");

	Возврат РезультатФункции;

КонецФункции

// Получить описание действия.
// 
// Параметры:
//  ИдентификаторДействия - Строка - action Идентификатор действия
//  ПредставлениеДействия - Строка - view Представление действия
//  СтрокаЗапроса - Строка - connect Строка запроса
//  ПроизвольныеЗначения - Строка, Структура - data Произвольные значения
// 
// Возвращаемое значение:
//  Структура - Получить описание действия:
// * action - Строка - идентификатор действия, например get_organizations
// * view - Строка - представление действия, например Получить список организаций
// * connect - Строка - Строка запроса
// * data - Строка, Структура - произвольные значения, задаются строкой или структурой
Функция ПолучитьОписаниеДействия(ИдентификаторДействия, ПредставлениеДействия, СтрокаЗапроса, ПроизвольныеЗначения) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("action", ИдентификаторДействия);
	Результат.Вставить("view", ПредставлениеДействия);
	Результат.Вставить("connect", СтрокаЗапроса);
	Результат.Вставить("data", ПроизвольныеЗначения);

	Возврат Результат;

КонецФункции

#КонецОбласти