
&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФИО 							= _ЛокКонтекст.ЛокЯдро_ПолучитьДанныеИзХранилища1С("Cleverence_SD_ФИОПользователя");
	Почта 							= _ЛокКонтекст.ЛокЯдро_ПолучитьДанныеИзХранилища1С("Cleverence_SD_АдресЭлектроннойПочты");
	НомерТелефона 				= _ЛокКонтекст.ЛокЯдро_ПолучитьДанныеИзХранилища1С("Cleverence_SD_НомерТелефона");
	НомерОбращения			 	= _ЛокКонтекст.ЛокЯдро_ПолучитьДанныеИзХранилища1С("Cleverence_SD_НомерПоследнегоОбращения");
	ДатаСледующегоОбращения 	= _ЛокКонтекст.ЛокЯдро_ПолучитьНастройкуНаСервереSMARTS("SD_ДатаСледующегоОбращения");
	СогласиеНаОбработкуПерсДанных = Истина;
	
	ИзменитьОтображениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗакрытиеФормыСРезультатом(?(ОтчетОтправлен ИЛИ РучноеФормирование, "", "Отложить"));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаНаПорталТПКлеверенсНажатие(Элемент)
	
	#Если ВебКлиент Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("УстановитьЕслиНеПодключено", Истина);
		ДополнительныеПараметры.Вставить("ВыборЗавершение", Новый ОписаниеОповещения("ОткрытьПорталТПКлеверенс", ЭтаФорма));
		
		_ЛокКонтекст.ЛокЯдро_ПередПодключениемРасширенияРаботыСФайлами(ДополнительныеПараметры);		
	#Иначе
		ОткрытьПорталТПКлеверенс();
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьОтчет(Команда)
	
	Если ПроверитьЗаполнениеРеквизитов() Тогда
		
		_ЛокКонтекст.ЛокЯдро_СохранитьДанныеВХранилище1С("Cleverence_SD_ФИОПользователя", ФИО);
		_ЛокКонтекст.ЛокЯдро_СохранитьДанныеВХранилище1С("Cleverence_SD_АдресЭлектроннойПочты", Почта);
		_ЛокКонтекст.ЛокЯдро_СохранитьДанныеВХранилище1С("Cleverence_SD_НомерТелефона", НомерТелефона);
		
		ДанныеПользователя = Новый Структура;
		ДанныеПользователя.Вставить("ФИО", ФИО);
		ДанныеПользователя.Вставить("Почта", Почта);
		ДанныеПользователя.Вставить("НомерТелефона", НомерТелефона);
		ДанныеПользователя.Вставить("Описание", Описание);
		
		ДопПараметры.Вставить("ДанныеПользователя", ДанныеПользователя);
		
		СтруктураРезультата = _ЛокКонтекст.ЛокЯдро_СерверКачества_ОтправитьОтчетОбОшибкахНаСервер(ДопПараметры, РучноеФормирование);
		
		ОтчетОтправлен = СтруктураРезультата.ОтчетОтправлен;
		НомерОбращения = СтруктураРезультата.НомерОбращения;
		
		ОбновитьОтображениеФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	ЗакрытиеФормыСРезультатом("Отложить");
КонецПроцедуры

&НаКлиенте
Процедура БольшеНеСпрашивать(Команда)
	ЗакрытиеФормыСРезультатом("БольшеНеСпрашивать");
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьНомерОбращения(Команда)
	
	Попытка
		ОбъектКопирования = Новый COMОбъект("htmlfile"); 
		ОбъектКопирования.ParentWindow.ClipboardData.SetData("Text", НомерОбращения);
	Исключение
		Сообщить("Не удалось скопировать");
		Возврат;
	КонецПопытки;
	
	ПоказатьОповещениеПользователя("Номер обращения скопирован в буфер обмена.",, НомерОбращения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФайлДляТехПоддержкиНажатие(Команда)

	#Если ВебКлиент Тогда
		Сообщение = НСтр("be = 'Кнопка захавання інфармацыі для тэхнічнай падтрымкі недаступна з web-кліента 1С, запусціце з тонкага кліента 1С.'; en = 'The button to save information for technical support is not available from 1C web client, launch from 1C thin client.'; es = 'El botón de guardar información para soporte técnico no está disponible desde el cliente web de 1C, inicie desde el cliente ligero de 1C.'; ka = 'ტექნიკური მხარდაჭერის ინფორმაციის შენახვის ღილაკი არ არის ხელმისაწვდო 1C web-კლიენტიდან, გაუშვით 1C მკერდი კლიენტიდან.'; kk = 'Техникалық қолдау үшін ақпаратты сақтау түймесі web-клиенті 1С-тен қол жетімді емес, 1С-тің жуыр клиентінен іске қосыңыз.'; ro = 'Buton salvare informații pentru suport tehnic indisponibil din client web 1C, porniți din client subțire 1C.'; ru = 'Кнопка сохранения информации для технической поддержки недоступна из web-клиента 1С, запустите из тонкого клиента 1С.'; tr = 'Teknik destek için bilgiyi kaydetme düğmesi 1C web istemcisinden erişilemez, 1C ince istemcisinden başlatın.'; uk = 'Кнопка збереження інформації для технічної підтримки недоступна з web-клієнта 1С, запустіть з тонкого клієнта 1С.'; uz = ""Texnik yordam uchun ma'lumotni saqlash tugmasi veb-klient 1C dan mavjud emas, 1C ning qalin klientidan ishga tushiring.""");
		Сообщить(Сообщение); 
		Возврат; // Временная заглушка
	#Иначе
		
		ИмяКаталога = "";
		
		ДиалогВыбораКаталога 			= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогВыбораКаталога.Заголовок 	= НСтр("be = 'Выберыце тэчку для захавання файлаў!'; en = 'Choose a folder to save files!'; es = '¡Seleccione una carpeta para guardar los archivos!'; ka = 'აირჩიეთ ფოლდერი ფაილების შენახვისთვის!'; kk = 'Файлдарды сақтау үшін папка таңдаңыз!'; ro = 'Alegeți folderul pentru salvarea fișierelor!'; ru = 'Выберите папку для сохранения файлов!'; tr = 'Dosyaları kaydetmek için bir klasör seçin!'; uk = 'Оберіть папку для збереження файлів!'; uz = 'Fayllarni saqlash uchun papkani tanlang!'");
		
		Если ДиалогВыбораКаталога.Выбрать() Тогда
			ИмяКаталога = ДиалогВыбораКаталога.Каталог;
		КонецЕсли;
		
		Если ИмяКаталога = "" Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураПараметров = _ЛокКонтекст.ПолучитьПараметрыВыполненияАвтотестов();
		
		СтрокаВыделенияАвтотестов		= СтруктураПараметров.СтрокаВыделенияАвтотестов;
		СтруктураВыполненияАвтотестов 	= СтруктураПараметров.СтруктураВыполненияАвтотестов;
		
		// Выгрузка записей ЖР, добавленных при работе с обработкой
		ИмяФайлаОбщегоЛога = "\Logs\Logs_full_";
		ИмяФайлаЛогаОшибок = "\Logs\Logs_errors_";
		
		ШапкаПолногоЛогаЗаписана = _ЛокКонтекст.ЛокЯдро_ЗаписатьШапкуЛога(ИмяФайлаОбщегоЛога, ИмяФайлаЛогаОшибок);
		
		// Установка даты, начиная с которой будут получены и выгружены в лог записи ЖР
		ДатаНачалаВыгрузкиЖР = НачалоДня(ТекущаяДата()) - 7 * 24 * 60 * 60; // 7 дней назад
		_ЛокКонтекст.КомЯдро_СохранитьЗначениеПеременной("ДатаНачалаВыгрузкиЖР", ДатаНачалаВыгрузкиЖР);
		
		ДанныеДляОтбораЖР = "MobileSMARTSLog";
		
		Если ШапкаПолногоЛогаЗаписана Тогда
			_ЛокКонтекст.ЛокЯдро_ВыгрузитьЛогИзЖурналаРегистрации(ДанныеДляОтбораЖР);
		КонецЕсли;
		
		// Сохранение в папку, выбранную пользователем	
		ИмяФайлаОбщегоЛога = "\Logs_full_";
		ИмяФайлаЛогаОшибок = "\Logs_errors_";
		
		ШапкаПолногоЛогаЗаписана = _ЛокКонтекст.ЛокЯдро_ЗаписатьШапкуЛога(ИмяФайлаОбщегоЛога, ИмяФайлаЛогаОшибок, ИмяКаталога);
		
		Если ШапкаПолногоЛогаЗаписана Тогда
			_ЛокКонтекст.ЛокЯдро_ВыгрузитьЛогИзЖурналаРегистрации(ДанныеДляОтбораЖР,, ИмяКаталога);
		КонецЕсли;
		
		// Выполнение операций автотестов
		Попытка
			// Установка признака выполнения автотестов, чтобы можно было получить записи ЖР только по выполняемым операциям
			_ЛокКонтекст.КомЯдро_СохранитьЗначениеПеременной("Автотест", Истина);
			ИдАвтотеста = Строка(Новый УникальныйИдентификатор);
			_ЛокКонтекст.КомЯдро_СохранитьЗначениеПеременной("ИдАвтотеста", ИдАвтотеста);	
			
			ИмяФайлаОбщегоЛога = "\Logs\Autotest1C_logs_full_";
			ИмяФайлаЛогаОшибок = "\Logs\Autotest1C_logs_errors_";
			
			ШапкаЛогаЗаписана = _ЛокКонтекст.ЛокЯдро_ЗаписатьШапкуЛога(ИмяФайлаОбщегоЛога, ИмяФайлаЛогаОшибок);
			
			// Выполнение операций автотестов. Вместо параметра запуска будем передавать полное имя автотеста, 
			// т.к. в параметре запуска его может не быть, но в рамках данного автотеста необходимо его выполнить
			
			// Расширения не используются в обычном приложении, поэтому проверяем их только в управляемом
			_ЛокКонтекст.ВыполнитьОперациюАвтотестовКлеверенс(
			"КлеверенсАвтотесты.ПроверкаПодключенныхРасширенийИПатчей", 
			"КлеверенсАвтотесты.ПроверкаПодключенныхРасширенийИПатчей", 
			СтруктураВыполненияАвтотестов, 
			Ложь, 
			Ложь, 
			СтрокаВыделенияАвтотестов);
			
			_ЛокКонтекст.ВыполнитьОперациюАвтотестовКлеверенс(
			"КлеверенсАвтотесты.ПроверкаДоступностиРаботыСДокументами1С", 
			"КлеверенсАвтотесты.ПроверкаДоступностиРаботыСДокументами1С", 
			СтруктураВыполненияАвтотестов, 
			Ложь, 
			Ложь, 
			СтрокаВыделенияАвтотестов);
			
			_ЛокКонтекст.ВыполнитьОперациюАвтотестовКлеверенс(
			"КлеверенсАвтотесты.ПолучитьСписокГлобальныхПеременныхИЗначений", 
			"КлеверенсАвтотесты.ПолучитьСписокГлобальныхПеременныхИЗначений", 
			СтруктураВыполненияАвтотестов, 
			Ложь, 
			Ложь, 
			СтрокаВыделенияАвтотестов);		
			
			_ЛокКонтекст.ВыполнитьОперациюАвтотестовКлеверенс(
			"КлеверенсАвтотесты.ПолучитьСписокМакетовСКДДляВыгрузкиСправочников", 
			"КлеверенсАвтотесты.ПолучитьСписокМакетовСКДДляВыгрузкиСправочников", 
			СтруктураВыполненияАвтотестов, 
			Ложь, 
			Ложь, 
			СтрокаВыделенияАвтотестов);		
			
			_ЛокКонтекст.ВыполнитьОперациюАвтотестовКлеверенс(
			"КлеверенсАвтотесты.ПолучитьСписокВсехБизнесПроцессов", 
			"КлеверенсАвтотесты.ПолучитьСписокВсехБизнесПроцессов", 
			СтруктураВыполненияАвтотестов, 
			Ложь, 
			Ложь, 
			СтрокаВыделенияАвтотестов);
			
			_ЛокКонтекст.ВыполнитьОперациюАвтотестовКлеверенс(
			"КлеверенсАвтотесты.ПроверкаСоответствияИспользованияБизнесПроцессовИОтборов", 
			"КлеверенсАвтотесты.ПроверкаСоответствияИспользованияБизнесПроцессовИОтборов", 
			СтруктураВыполненияАвтотестов, 
			Ложь, 
			Ложь, 
			СтрокаВыделенияАвтотестов);			
			
			_ЛокКонтекст.ВыполнитьОперациюАвтотестовКлеверенс(
			"КлеверенсАвтотесты.ПроверитьКорректностьНастроекБизнесПроцессов", 
			"КлеверенсАвтотесты.ПроверитьКорректностьНастроекБизнесПроцессов", 
			СтруктураВыполненияАвтотестов, 
			Ложь, 
			Ложь, 
			СтрокаВыделенияАвтотестов);
			
			ДанныеДляОтбораЖР = ИдАвтотеста;
			
			Если ШапкаЛогаЗаписана Тогда
				_ЛокКонтекст.ЛокЯдро_ВыгрузитьЛогИзЖурналаРегистрации(ДанныеДляОтбораЖР);
			КонецЕсли;
			
			// Сохранение в папку, выбранную пользователем
			ИмяФайлаОбщегоЛога = "\Autotest1C_logs_full_";
			ИмяФайлаЛогаОшибок = "\Autotest1C_logs_errors_";
			
			ШапкаЛогаЗаписана = _ЛокКонтекст.ЛокЯдро_ЗаписатьШапкуЛога(ИмяФайлаОбщегоЛога, ИмяФайлаЛогаОшибок, ИмяКаталога);
			
			Если ШапкаЛогаЗаписана Тогда
				_ЛокКонтекст.ЛокЯдро_ВыгрузитьЛогИзЖурналаРегистрации(ДанныеДляОтбораЖР,, ИмяКаталога);
			КонецЕсли;
			
			// Сбрасываем признак выполнения автотестов
			_ЛокКонтекст.КомЯдро_СохранитьЗначениеПеременной("Автотест", Ложь);
			
		Исключение
			// Сбрасываем признак выполнения автотестов
			_ЛокКонтекст.КомЯдро_СохранитьЗначениеПеременной("Автотест", Ложь);
		КонецПопытки;
		
		Если ШапкаПолногоЛогаЗаписана Или ШапкаЛогаЗаписана Тогда
			Сообщение = НСтр("be = 'Выгрузка скончана.'; en = 'Unloading is complete.'; es = 'Descarga completada'; ka = 'გამოსახულება დასრულდა.'; kk = 'Жүктеу аяқталды.'; ro = 'Descărcarea a fost finalizată.'; ru = 'Выгрузка окончена.'; tr = 'Dışa aktarma tamamlandı.'; uk = 'Вивантаження завершено.'; uz = 'Yuklash tugallandi.'");
			Сообщить(Сообщение); 
		Иначе
			Сообщение = НСтр("be = 'Не ўдалося выгрузіць файлы.'; en = 'Failed to export files.'; es = 'No se pudieron descargar los archivos.'; ka = 'ფაილების გაყიდვა ვერ მოხდა.'; kk = 'Файлдарды шығару мүмкін емес.'; ro = 'Nu s-au putut descărca fișierele.'; ru = 'Не удалось выгрузить файлы.'; tr = 'Dosyalar aktarılamadı.'; uk = 'Не вдалося вивантажити файли.'; uz = 'Файлларни чиқариш мумкин эмас.'");
			Сообщить(Сообщение); 
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьОтображениеФормы()
	
	Если РучноеФормирование И ДатаСледующегоОбращения > ДопПараметры.ДатаТекущейПроверки Тогда
		ПревышенЛимитОбращений = Истина;
		ОтчетОтправлен = Истина;
		Заголовок = "Клеверенс: Обращение [" +  НомерОбращения + "] уже заведено!";
		Элементы.ОписаниеПослеОтправки.Заголовок = "Вы недавно уже заводили обращение в техническую поддержку, проверьте свою почту в папке ""Входящие"" или в папке ""Спам"". В почте должны быть сообщения о ходе работы над вашим обращением. Если уведомления на почту не приходят, зайдите на портал технической поддержки Клеверенс.";
		
		ОбновитьОтображениеФормы();
		Возврат;
	КонецЕсли;
	
	Если РучноеФормирование Тогда
		Заголовок = "Клеверенс: Формирование обращения для технической поддержки";
	КонецЕсли;
	
	Элементы.Отложить.Заголовок = "Отложить на " + ГлубинаОтбораОшибок + " дня";
	Элементы.Отложить.Видимость = НЕ РучноеФормирование;
	Элементы.БольшеНеСпрашивать.Видимость = НЕ РучноеФормирование;
	
	ОбновитьОтображениеФормы();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьОтображениеФормы()
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Элементы.ГруппаТелоФормы.Страницы.ГруппаФормированиеОтчета.Видимость				= НЕ ОтчетОтправлен;	
		Элементы.ГруппаТелоФормы.Страницы.ГруппаПослеУспешнойОтправкиОтчета.Видимость	= ОтчетОтправлен;
	#Иначе
		Элементы.ГруппаФормированиеОтчета.Видимость				= НЕ ОтчетОтправлен;	
		Элементы.ГруппаПослеУспешнойОтправкиОтчета.Видимость	= ОтчетОтправлен;
	#КонецЕсли
	
	Элементы.ПочтаПоследнегоОбращения.Видимость = ОтчетОтправлен;
	
	Если ОтчетОтправлен И НЕ ПревышенЛимитОбращений Тогда
		Заголовок = "Клеверенс: Обращение успешно зарегистрировано!";
	КонецЕсли;
	
	// Отображение кнопок
	Элементы.Отложить.Видимость 										= НЕ ОтчетОтправлен И НЕ РучноеФормирование;
	Элементы.БольшеНеСпрашивать.Видимость 						= НЕ ОтчетОтправлен И НЕ РучноеФормирование;
	Элементы.ОтправитьОтчет.Видимость								= НЕ ОтчетОтправлен;
	Элементы.КнопкаЗакрыть.Видимость								= РучноеФормирование ИЛИ ОтчетОтправлен;
	//Элементы.ПолучитьФайлДляТехПоддержки.Видимость 			= ПревышенЛимитОбращений;
	Элементы.ОтправитьОтчет.КнопкаПоУмолчанию						= НЕ ОтчетОтправлен;
	Элементы.КнопкаЗакрыть.КнопкаПоУмолчанию						= ОтчетОтправлен;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Элементы.ПолучитьФайлДляТехПоддержки.Видимость 			= НЕ Элементы.КнопкаЗакрыть.Видимость;
		Элементы.ПолучитьФайлДляТехПоддержкиОФ.Видимость 		= Элементы.КнопкаЗакрыть.Видимость;
	#КонецЕсли
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗакрытиеФормыСРезультатом(РезультатВопроса)
	
	РезультатЗакрытия = Новый Структура("РезультатВопроса", РезультатВопроса);
	Если РезультатВопроса = "Отложить" Тогда
		РезультатЗакрытия.Вставить("СрокДоСледующейПроверки", ГлубинаОтбораОшибок);
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ОписаниеОповещенияОЗакрытии <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, РезультатЗакрытия);
		КонецЕсли;
	#Иначе
		Закрыть(РезультатЗакрытия);
	#КонецЕсли
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьПорталТПКлеверенс(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПорталТПКлеверенсЗавершение", ЭтаФорма);
	НачатьЗапускПриложения(ОписаниеОповещения, Элементы.СсылкаНаПорталТПКлеверенс.Подсказка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПорталТПКлеверенсЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	
	Результат = Истина;
	ОчиститьСообщения();
	
	Если НомерТелефона <> "" И _ЛокКонтекст.ЛокЯдро_СтрРазделить(НомерТелефона, " ").Количество() > 3 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Некорректный номер телефона";
		Сообщение.Поле = "НомерТелефона";
		Сообщение.УстановитьДанные(НомерТелефона);
		Сообщение.Сообщить();
		
		Результат = Ложь;
	КонецЕсли;
	
	Почта = СтрЗаменить(СокрЛП(Почта), " ", "");
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Если Почта <> "" И НЕ _ЛокКонтекст.ЛокЯдро_ПроверитьКорректностьEmail(Почта) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Некорректный адрес электронный почты";
		Сообщение.Поле = "Почта";
		Сообщение.УстановитьДанные(Почта);
		Сообщение.Сообщить();
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

#Если ТолстыйКлиентОбычноеПриложение Тогда
	Элементы = ЭлементыФормы;
#КонецЕсли