
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		ПараметрыВыполненияКоманды.Источник.РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	УточнениеТипаЛогистика = "";
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		Форма = ПараметрыВыполненияКоманды.Источник;
		Если Форма.Элементы.Найти("ТипЛогистика") <> Неопределено Тогда
			УточнениеТипаЛогистика = Форма.ТипЛогистика;
		КонецЕсли;
	Иначе
		Форма = Неопределено;
	КонецЕсли;
	
	Состояние("Ищем фалы обмена", 10, "ищем файлы обмена", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
	ФайлыОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ФайлыОбменаСогласованния(ПараметрКоманды);
	
	#Если ВебКлиент Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрКоманды", ПараметрКоманды);
		ДополнительныеПараметры.Вставить("ФайлыОбмена", ФайлыОбмена);
		
		Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСКриптографиейПодключено", ЭтотОбъект, ДополнительныеПараметры);
		НачатьПодключениеРасширенияРаботыСКриптографией(Оповещение);
		
	#Иначе
		
		СогласованныеФайлыОбмена = СогласоватьФайлыОбмена(ФайлыОбмена);
		
		Состояние("Отправляем документы", 50, "требуется около 3 секунд на 1 документ", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
		ОтправитьСогласованныеФайлы(СогласованныеФайлыОбмена);
		
		Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
		Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
		Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", ПараметрКоманды);
		Оповестить("КонтурЛогистика_ОбновитьЗадачи", ПараметрКоманды);
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСКриптографиейПодключено(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Не Подключено Тогда
		НачатьУстановкуРасширенияРаботыСКриптографией(Неопределено);
		Возврат;
	КонецЕсли;
	
	ОповещениеПодписатьФайлыЗавершение = Новый ОписаниеОповещения("ПодписатьФайлыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Состояние("Подписываем документы", 20, "создаем файлы обмена", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
	
	КонтурЛогистика_ИнтеграцияДиадокКлиент.СогласоватьФайлыОбменаАсинхронно(
		ДополнительныеПараметры.ФайлыОбмена, ОповещениеПодписатьФайлыЗавершение);
	
КонецПроцедуры

&НаКлиенте
Функция ПодписатьФайлыЗавершение(МассивПодписанныхФайловОбмена, ДополнительныеПараметры) Экспорт
	
	ОтправитьСогласованныеФайлы(МассивПодписанныхФайловОбмена);
	
	Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
	ОповеститьОбИзменении(ТипЗнч(ДополнительныеПараметры.ПараметрКоманды[0]));
	Оповестить("КонтурЛогистика_ОбновитьЗадачи", ДополнительныеПараметры.ПараметрКоманды);
	
Конецфункции

&НаКлиенте
Функция СогласоватьФайлыОбмена(ФайлыОбмена)
	
	Состояние("Подписываем документы", 20, "создаем файлы обмена", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
	
	СогласованныеФайлыОбмена = КонтурЛогистика_ОбработкаДокументовКлиент.СогласоватьФайлыОбмена(ФайлыОбмена);
	
	Возврат СогласованныеФайлыОбмена;
	
КонецФункции

&НаСервере
Процедура ОтправитьСогласованныеФайлы(ФайлыОбмена)
	
	Если ТипЗнч(ФайлыОбмена) = Тип("Массив")
		И ФайлыОбмена.Количество() > 0 Тогда
		
		РезультатОтправки = КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьСогласованныеФайлыВДиадок(ФайлыОбмена);
		Если Не РезультатОтправки.Успешно Тогда
			Сообщить("Проблемы при отправке документов: "
				+ КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатОтправки));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры