
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УчетнаяЗаписьТорговойПлощадки = Параметры.УчетнаяЗаписьТорговойПлощадки;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьТорговойПлощадки) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	ИспользоватьУпаковкиНоменклатуры	   = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	
	ЗаполнитьСписокСкладовТорговойПлощадки();
	ОбновитьИнформациюОРегламентномЗадании();
	ОбновитьДатуАктуальностиДанныхОПродажахТоваров();
	УстановитьПараметрыДинамическихСписков();
	
	ПериодАнализаОтгрузок.ДатаОкончания = КонецДня(ТекущаяДатаСеанса() - 86400);
	ПериодАнализаОтгрузок.ДатаНачала    = НачалоДня(ПериодАнализаОтгрузок.ДатаОкончания - 7 * 86400);
	КоличествоДнейПланирования          = 7;
	
	СтрокаПолей = "Заказано, Отменено, ДнейВНаличии, СреднийЗаказВДень, ВНаличии, ЗапасДней, ВПоставке, ПлановаяПотребность, ВНаличииНаСкладах1С, ЗапланироватьКПоставке";
	СписокПолей = СтрРазделить(СтрЗаменить(СтрокаПолей, " ", ""), ",");
	Для Каждого ЭлементКоллекции Из СписокПолей Цикл
		ПолеНабораДанных = ДанныеДляПланирования.Поля.Найти(ЭлементКоллекции);
		Если ПолеНабораДанных <> Неопределено Тогда
			ЗадатьПолюОграниченияИспользования(ПолеНабораДанных, Истина);
		КонецЕсли;
	КонецЦикла;
	
	АдресСчетчикДляЗамеров = ПоместитьВоВременноеХранилище(0, УникальныйИдентификатор);
	УстановитьКэшированныеЗначения();
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ИспользоватьSellmonitor", Кэш.ИспользоватьSellmonitor);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("АдресСчетчикДляЗамеров", АдресСчетчикДляЗамеров);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СпособПланирования", "1С");
	
	Элементы.ГруппаПланированиеПоставокПодсказка.Видимость = Ложь;
	
	Если Кэш.ИспользоватьSellmonitor Тогда
		
		ДобавитьРеквизитыSellmonitor();
		
		НоваяСтрока = ТаблицаВыбораСпособыПланирования.Добавить();
		НоваяСтрока.Значение = "1С";
		
		НоваяСтрока = ТаблицаВыбораСпособыПланирования.Добавить();
		НоваяСтрока.Значение = "Sellmonitor";
		
		Элементы.СтратегияПереизбытка.СписокВыбора.Добавить("ignoreOverflow", "Игнорировать");
		Элементы.СтратегияПереизбытка.СписокВыбора.Добавить("redistributeOverflow", "Перераспределить");
		
		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("АдресаСтраницПотребностьSellmonitor", Новый СписокЗначений);
		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СпособыПланирования", СпособыПланирования);
		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.СпособПланирования = СпособПланирования;
		
		ДобавитьПоляSellmonitor();
	Иначе
		Элементы.ГруппаСпособыПланирования.Видимость = Ложь;
		Элементы.ГруппаСервисАналитикиSellmonitor.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.ИдентификаторСкладаТорговойПлощадки.СписокВыбора.НайтиПоЗначению(ИдентификаторСкладаТорговойПлощадки) = Неопределено Тогда
		ИдентификаторСкладаТорговойПлощадки = "";
	КонецЕсли;

	ОчиститьДанныеДляПланированияНаСервере();
	УстановитьВидимостьДоступность();

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСSellmonitor") Тогда
		
		Если ЗначениеЗаполнено(СпособПланирования) Тогда
			СтруктураОтбора = Новый Структура("Значение", СпособПланирования);
			НайденныеСтроки = ТаблицаВыбораСпособыПланирования.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СпособыПланирования.Добавить(СпособПланирования,,,БиблиотекаКартинок.Избранное);
				Элементы.СпособПланирования.СписокВыбора.Добавить(СпособПланирования);
			Иначе
				СпособПланирования = "";
			КонецЕсли;
		КонецЕсли;
		
		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СпособыПланирования", СпособыПланирования);
		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СпособПланирования", СпособПланирования);
		
		Элементы.ГруппаСервисАналитикиSellmonitor.Видимость							 = АнализироватьОтгрузки;
		Элементы.ГруппаСервисАналитикиSellmonitor.Доступность = СпособыПланирования.НайтиПоЗначению("Sellmonitor") <> Неопределено;
		
		Если СпособыПланирования.НайтиПоЗначению("Sellmonitor") <> Неопределено И Не АнализироватьОтгрузки Тогда
			АнализироватьОтгрузки = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИнтеграцияСМаркетплейсомOzonСервер.ОбновитьДанные" Тогда
		Если ЗначениеЗаполнено(Параметр)
				И Параметр = УчетнаяЗаписьТорговойПлощадки Тогда
			ОбновитьДатуАктуальностиДанныхОПродажахТоваров();
			
			Если Кэш.ИспользоватьSellmonitor И Кэш.ЕстьНераспознаннаяНСИ Тогда
				ОбновитьИнформациюОНераспознаннойНСИ(УчетнаяЗаписьТорговойПлощадки, Кэш,
					Элементы.ДекорацияПредупреждениеSellmonitorТекст.Заголовок,
					Элементы.ГруппаПредупреждениеSellmonitor.Видимость);
			КонецЕсли;
				
			Если Элементы.СтраницыПланирования.ТекущаяСтраница = Элементы.СтраницаПланирование Тогда
				Элементы.ДанныеДляПланирования.Обновить();
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "УправлениеПродажамиНаOzon.ПланированиеПоставокНаСкладыТорговойПлощадки.СоздатьЗаявкиНаПоставку" Тогда
		Если ЗначениеЗаполнено(Параметр)
				И Параметр = УчетнаяЗаписьТорговойПлощадки Тогда
			Если Элементы.СтраницыПланирования.ТекущаяСтраница = Элементы.СтраницаРезультат Тогда
				Элементы.СформированныеДокументы.Обновить();
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант" Тогда
		Если ЗначениеЗаполнено(Параметр)
				И СтрНайти("ИспользоватьПартнеровИКонтрагентов, ИспользоватьСоглашенияСКлиентами, ИспользоватьДоговорыСКлиентами", Источник) > 0 Тогда
			УстановитьПараметрыДинамическихСписков();
			
			Если Элементы.СтраницыПланирования.ТекущаяСтраница = Элементы.СтраницаПланирование Тогда
				Элементы.ДанныеДляПланирования.Обновить();
			ИначеЕсли Элементы.СтраницыПланирования.ТекущаяСтраница = Элементы.СтраницаРезультат Тогда
				Элементы.СформированныеДокументы.Обновить();
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Маркетплейсы_ЗавершениеМенеджерДлительныхОпераций" Тогда
		Если Источник.ИдентификаторНазначения = УникальныйИдентификатор Тогда
			ОбработатьРезультатДлительныхОпераций(Параметр, Источник);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПланированияПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	СтраницыПланированияПослеСменыСтраницы(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПоставкиПриИзменении(Элемент)

	Если ВидПоставки = 0 Тогда
		ИдентификаторСкладаТорговойПлощадки = "";
	КонецЕсли;
	
	ОчиститьДанныеДляПланированияНаСервере();
	УстановитьВидимостьДоступность("ВидПоставки");

КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторСкладаТорговойПлощадкиПриИзменении(Элемент)
	
	ОчиститьДанныеДляПланированияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеСклады1СПриИзменении(Элемент)
	
	ОчиститьДанныеДляПланированияНаСервере();
	
КонецПроцедуры
	
&НаКлиенте
Процедура КатегорииТорговойПлощадкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УчетнаяЗаписьТорговойПлощадки", УчетнаяЗаписьТорговойПлощадки);
	ПараметрыОткрытия.Вставить("ВыбранныеКатегории",            КатегорииТорговойПлощадки);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыборКатегорийТорговойПлощадкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.УправлениеПродажамиНаOzon.Форма.МножественныйВыборКатегорийТорговойПлощадки", 
		ПараметрыОткрытия,
		,,,, 
		ОповещениеОЗакрытии);
			
КонецПроцедуры

&НаКлиенте
Процедура АнализироватьОтгрузкиПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность("АнализироватьОтгрузки");
	
	Если Кэш.ИспользоватьSellmonitor Тогда
		НайденныйСпособПланирования = СпособыПланирования.НайтиПоЗначению("Sellmonitor");
		Если НайденныйСпособПланирования <> Неопределено Тогда
			СпособыПланирования.Удалить(НайденныйСпособПланирования);
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Значение", "Sellmonitor");
		НайденныеСтроки = ТаблицаВыбораСпособыПланирования.НайтиСтроки(СтруктураПоиска);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Отметка = Ложь;
			НайденнаяСтрока.Основной = Ложь;
			Если СпособПланирования = "Sellmonitor" Тогда
				СпособПланирования = "";
			КонецЕсли;
			НайденныйЭлементВыбора = Элементы.СпособПланирования.СписокВыбора.НайтиПоЗначению("Sellmonitor");
			Если НайденныйЭлементВыбора <> Неопределено Тогда
				Элементы.СпособПланирования.СписокВыбора.Удалить(НайденныйЭлементВыбора);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособыПланированияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	СтандартнаяОбработка = Ложь;
	
	Для Каждого СтрокаТаблицы Из ТаблицаВыбораСпособыПланирования Цикл
		НайденныйЭлемент = СпособыПланирования.НайтиПоЗначению(СтрокаТаблицы.Значение);
		Если НайденныйЭлемент = Неопределено Тогда
			СтрокаТаблицы.Отметка = Ложь;
			СтрокаТаблицы.Основной = Ложь;
		Иначе
			СтрокаТаблицы.Отметка = Истина;
			СтрокаТаблицы.Основной = НайденныйЭлемент.Картинка = БиблиотекаКартинок.Избранное;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ГруппаСпособыПланированияВыбор.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособыПланированияОчистка(Элемент, СтандартнаяОбработка)
	СпособПланирования = "";
	Элементы.СпособПланирования.СписокВыбора.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СпособПланированияПриИзменении(Элемент)
	
	Для Каждого ЭлементСписка Из СпособыПланирования Цикл
		Если ЭлементСписка.Значение = СпособПланирования Тогда
			ЭлементСписка.Картинка = БиблиотекаКартинок.Избранное;
		Иначе
			ЭлементСписка.Картинка = Новый Картинка;
		КонецЕсли;
	КонецЦикла;
	
	Если Кэш.ИспользоватьSellmonitor Тогда
		ВидимостьПоказателейДляРасчета();
		ОбновитьДатуАктуальностиНаФорме();
		ВидимостьДатаАктуальности();
	КонецЕсли;
	
	// Определение свойств, необходимых для формирования заказов клиента
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.СпособПланирования = СпособПланирования;
	Если Кэш.ИспользоватьSellmonitor И СпособПланирования = "Sellmonitor" Тогда
		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ДатаОтгрузки",                       ДатаПоставкиПлан);
	Иначе
		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ДатаОтгрузки",                       ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПланированияОчистка(Элемент, СтандартнаяОбработка)
	Для Каждого ЭлементСписка Из СпособыПланирования Цикл
		ЭлементСписка.Картинка = Новый Картинка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПредупреждениеSellmonitorКартинкаНажатие(Элемент)
	Элементы.ГруппаПредупреждениеSellmonitorРасшифровка.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПредупреждениеSellmonitorТекстОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "Card" Тогда
		
		НераспозначнныеНСИ = ПолучитьИзВременногоХранилища(Кэш.АдресНераспознаннойНСИ);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("УчетнаяЗапись", УчетнаяЗаписьТорговойПлощадки);
		ПараметрыФормы.Вставить("ОтборПоSKU",  Новый СписокЗначений);
		Для Каждого НераспознаннаяКТ Из НераспозначнныеНСИ.НераспознанныеКТ Цикл
			ПараметрыФормы.ОтборПоSKU.Добавить(НераспознаннаяКТ);
		КонецЦикла;
		ПараметрыФормы.Вставить("ВРежимеИмпортаДанных", Истина);
		ОткрытьФорму("Обработка.УправлениеПродажамиНаOzon.Форма.ПубликацияТоваров", ПараметрыФормы, ЭтотОбъект
			,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "Warehouse" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("УчетнаяЗаписьМаркетплейса", УчетнаяЗаписьТорговойПлощадки);
		ПараметрыФормы.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
		РезультатРегистрации = ЗарегистрироватьНераспознанныеСклады(ПараметрыФормы, Кэш.АдресНераспознаннойНСИ);
		
		Если Не РезультатРегистрации.ЕстьОшибка Тогда
			
			ОбновитьИнформациюОНераспознаннойНСИ(УчетнаяЗаписьТорговойПлощадки, Кэш,
				Элементы.ДекорацияПредупреждениеSellmonitorТекст.Заголовок,
				Элементы.ГруппаПредупреждениеSellmonitor.Видимость);
				
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("УчетнаяЗапись", Кэш.УчетнаяЗаписьSellmonitor);
			ПараметрыФормы.Вставить("УчетнаяЗаписьМП", УчетнаяЗаписьТорговойПлощадки);
			ПараметрыФормы.Вставить("ТекущаяСтраница", "СтраницаСклады");
			ОткрытьФорму("Обработка.СервисSellmonitor.Форма.НастройкиИнтеграции", ПараметрыФормы, ЭтотОбъект);
			
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ГруппаПредупреждениеSellmonitorРасшифровка.Скрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеДляПланирования

&НаКлиенте
Процедура ДанныеДляПланированияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ДанныеДляПланированияИзменить(Элемент, Поле);

КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляПланированияПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;
	ДанныеДляПланированияИзменить(Элемент);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДанныеДляПланированияПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)

	ВыполняетсяЗамер = Ложь;
	ЧастотаЗамеров = 10;
	СчетчикДляЗамеров = ПолучитьИзВременногоХранилища(Настройки.ДополнительныеСвойства.АдресСчетчикДляЗамеров);
	
	Если СчетчикДляЗамеров % ЧастотаЗамеров = 0 Тогда
		ВыполняетсяЗамер = Истина;
		Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
			"Обработка.УправлениеПродажамиНаOzon.ПланированиеПоставокНаСкладыТорговойПлощадки.ДанныеДляПланированияПриПолученииДанныхНаСервере");
	КонецЕсли;
	
	СчетчикДляЗамеров = СчетчикДляЗамеров + 1;
	ПоместитьВоВременноеХранилище(СчетчикДляЗамеров, Настройки.ДополнительныеСвойства.АдресСчетчикДляЗамеров);

	ИспользоватьХарактеристикиНоменклатуры = Настройки.ДополнительныеСвойства.ИспользоватьХарактеристикиНоменклатуры;
	ИспользоватьУпаковкиНоменклатуры	   = Настройки.ДополнительныеСвойства.ИспользоватьУпаковкиНоменклатуры;
	УчетнаяЗаписьТорговойПлощадки          = Настройки.ДополнительныеСвойства.УчетнаяЗаписьТорговойПлощадки;
	
	// Подготовка для Sellmonitor
	ТекущаяСтраница = Неопределено;
	Если Настройки.ДополнительныеСвойства.ИспользоватьSellmonitor Тогда
		ПланироватьПоSellmonitor = Настройки.ДополнительныеСвойства.СпособПланирования = "Sellmonitor";
		ПоказатьПотребностьSellmonitor = Настройки.ДополнительныеСвойства.СпособыПланирования.НайтиПоЗначению("Sellmonitor") <> Неопределено;
	Иначе
		ПланироватьПоSellmonitor = Ложь;
		ПоказатьПотребностьSellmonitor = Ложь;
	КонецЕсли;
	
	Если ПоказатьПотребностьSellmonitor И Настройки.ДополнительныеСвойства.АдресаСтраницПотребностьSellmonitor.Количество() > 0 Тогда
		ПервыйКлюч = "";
		
		Для Каждого СтрокаПлан Из Строки Цикл
			КлючПоиска = Новый Массив;
			КлючПоиска.Добавить(СтрокаПлан.Значение.Данные.Номенклатура);
			КлючПоиска.Добавить(СтрокаПлан.Значение.Данные.Характеристика);
			КлючПоиска.Добавить(СтрокаПлан.Значение.Данные.Упаковка);
			
			ТекущийКлюч = ИнтеграцияСМаркетплейсамиСИ.ПолучитьВнутреннийИдентификатор(КлючПоиска);
			СтрокаПлан.Значение.Данные.СтрокаИдентификатор = ТекущийКлюч;
			
			Если ПервыйКлюч = "" Или СтрСравнить(ПервыйКлюч, ТекущийКлюч) = 1 Тогда
				ПервыйКлюч = ТекущийКлюч;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого КэшСтраницы Из Настройки.ДополнительныеСвойства.АдресаСтраницПотребностьSellmonitor Цикл
			
			Если ТекущаяСтраница = Неопределено 
				И ПервыйКлюч >= КэшСтраницы.Значение.ПервыйКлюч И ПервыйКлюч <= КэшСтраницы.Значение.ПоследнийКлюч Тогда
				
				ТекущаяСтраница = КэшСтраницы;
				Прервать;
			КонецЕсли;
				
		КонецЦикла;

		СчитанныеДанныеКэша = Новый Соответствие;
		
		Если ТекущаяСтраница <> Неопределено Тогда
			ДанныеТекущейСтраницы = ПолучитьИзВременногоХранилища(ТекущаяСтраница.Значение.АдресСтраницы);
			Если ДанныеТекущейСтраницы = Неопределено Тогда
				Возврат;
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Подготовка для встроенного способа планирования
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваров.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаТоваров.Колонки.Добавить("Упаковка",       Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	
	ТаблицаТоваров.Колонки.Добавить(
		"НоменклатураПартнера", Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));

	Для Каждого КлючЗаписи Из Строки.ПолучитьКлючи() Цикл
		СтрокаТаблицыЗначений = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыЗначений, КлючЗаписи);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ТаблицаТоваров.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
		|	ВЫРАЗИТЬ(ТаблицаТоваров.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
		|	ВЫРАЗИТЬ(ТаблицаТоваров.НоменклатураПартнера КАК Справочник.НоменклатураКонтрагентов) КАК НоменклатураПартнера,
		|	"""" КАК ИдентификаторПубликации
		|ПОМЕСТИТЬ ВТ_ТаблицаТоваров
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Упаковка" 
	
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ Обработки.УправлениеПродажамиНаOzon.ТекстЗапросаДанныхПланирования()
		
		+ "УНИЧТОЖИТЬ ВТ_ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.Номенклатура КАК Номенклатура,
		|	ВТ_Данные.Характеристика КАК Характеристика,
		|	ВТ_Данные.Упаковка КАК Упаковка,
		|	ВТ_Данные.НоменклатураПартнера КАК НоменклатураПартнера,
		|	ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК КоэффициентУпаковки,
		|	ВТ_Данные.ВНаличииНаСкладах1С КАК ВНаличииНаСкладах1С,
		|	ВТ_Данные.ЗарезервированоНаСкладах1С КАК ЗарезервированоНаСкладах1С,
		|	ВТ_Данные.ВПоставке КАК ВПоставке,
		|	ВТ_Данные.ВНаличии КАК ВНаличии,
		|	ВТ_Данные.Заказано КАК Заказано,
		|	ВТ_Данные.Отменено КАК Отменено,
		|	ВТ_Данные.ДнейВНаличии КАК ДнейВНаличии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|
		|УПОРЯДОЧИТЬ ПО
		|	Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Показатели
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Данные";
	
	Обработки.УправлениеПродажамиНаOzon.СкорректироватьТекстЗапросаДанныхПланирования(Запрос, Настройки.ДополнительныеСвойства);
	
	Запрос.УстановитьПараметр("УчетнаяЗаписьТорговойПлощадки", УчетнаяЗаписьТорговойПлощадки);
	Запрос.УстановитьПараметр("ТаблицаТоваров", 			   ТаблицаТоваров);
	
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("УчетнаяЗаписьМаркетплейса", УчетнаяЗаписьТорговойПлощадки);
		СтруктураОтбора.Вставить("ВидОбъектаМаркетплейса",    Перечисления.ВидыОбъектовМаркетплейсов.Товар);
		СтруктураОтбора.Вставить("Номенклатура",			  ВыборкаДанных.Номенклатура);
		Если ИспользоватьХарактеристикиНоменклатуры Тогда 
			СтруктураОтбора.Вставить("Характеристика", ВыборкаДанных.Характеристика);
		КонецЕсли;
		Если ИспользоватьУпаковкиНоменклатуры Тогда
			СтруктураОтбора.Вставить("Упаковка", ВыборкаДанных.Упаковка);
		КонецЕсли;
		СтруктураОтбора.Вставить("ОбъектПубликации", Неопределено);
		
		СтруктураОтбора.Вставить("НоменклатураПартнера", ВыборкаДанных.НоменклатураПартнера);
		
		КлючЗаписи   = РегистрыСведений.СтатусыПубликацииОбъектовМаркетплейсаOzon.СоздатьКлючЗаписи(СтруктураОтбора);
		СтрокаСписка = Строки[КлючЗаписи];
		
		Если СтрокаСписка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтрокиСписка          = СтрокаСписка.Данные;
		ДанныеСтрокиСписка.ВНаличии = ВыборкаДанных.ВНаличии;
		
		Если Настройки.ДополнительныеСвойства.АнализироватьОтгрузки Тогда
			ДанныеСтрокиСписка.Заказано 		   = ВыборкаДанных.Заказано;
			ДанныеСтрокиСписка.Отменено            = ВыборкаДанных.Отменено;
			ДанныеСтрокиСписка.ДнейВНаличии        = ВыборкаДанных.ДнейВНаличии;
			ДанныеСтрокиСписка.СреднийЗаказВДень   = Окр(?(ДанныеСтрокиСписка.ДнейВНаличии = 0, 0, 
															(ДанныеСтрокиСписка.Заказано - ДанныеСтрокиСписка.Отменено) / ДанныеСтрокиСписка.ДнейВНаличии), 3, РежимОкругления.Окр15как20);
			ДанныеСтрокиСписка.ЗапасДней           = Окр(?(ДанныеСтрокиСписка.СреднийЗаказВДень = 0, 0, 
															ДанныеСтрокиСписка.ВНаличии / ДанныеСтрокиСписка.СреднийЗаказВДень), 1, РежимОкругления.Окр15как20);
			ДанныеСтрокиСписка.ПлановаяПотребность = Окр(Макс(0, 
															Настройки.ДополнительныеСвойства.КоличествоДнейПланирования * ДанныеСтрокиСписка.СреднийЗаказВДень - ДанныеСтрокиСписка.ВНаличии + 0.4), 0, РежимОкругления.Окр15как20);
		КонецЕсли;
	
		КоэффициентУпаковки                           = ?(ВыборкаДанных.КоэффициентУпаковки = 0, 1, ВыборкаДанных.КоэффициентУпаковки);
		ДанныеСтрокиСписка.ВПоставке		          = Окр(ВыборкаДанных.ВПоставке / КоэффициентУпаковки, 3, РежимОкругления.Окр15как20);
		ДанныеСтрокиСписка.ВНаличииНаСкладах1С        = Окр(ВыборкаДанных.ВНаличииНаСкладах1С / КоэффициентУпаковки, 3, РежимОкругления.Окр15как20);
		ДанныеСтрокиСписка.ЗарезервированоНаСкладах1С = Окр(ВыборкаДанных.ЗарезервированоНаСкладах1С / КоэффициентУпаковки, 3, РежимОкругления.Окр15как20);
		ДанныеСтрокиСписка.ЗапланироватьКПоставке     = Макс(0, Мин(?(Настройки.ДополнительныеСвойства.АнализироватьОтгрузки, ДанныеСтрокиСписка.ПлановаяПотребность, 0) - ДанныеСтрокиСписка.ВПоставке, 
																	ДанныеСтрокиСписка.ВНаличииНаСкладах1С));
		ДанныеСтрокиСписка.РучноеИзменение            = Ложь;
		
		Если ДанныеСтрокиСписка.ВНаличииНаСкладах1С > 0 Тогда
			Ключ                  = ПолучитьКлючПланирования(ВыборкаДанных.Номенклатура, ВыборкаДанных.Характеристика);
			ПланированиеПоСкладам = Настройки.ДополнительныеСвойства.ПланированиеПоСкладам.Получить(Ключ);

			Если ПланированиеПоСкладам = Неопределено Тогда
				ПланированиеПоСкладам = Новый Соответствие;
			КонецЕсли;
			
			Данные = ПланированиеПоСкладам.Получить(ДанныеСтрокиСписка.ИдентификаторПубликации);
			
			Если Данные = Неопределено Тогда
				Данные = Новый Структура;
				Данные.Вставить("НомерПоПорядку",         ПланированиеПоСкладам.Количество() + 1);
				Данные.Вставить("ПредставлениеОбъекта",   ДанныеСтрокиСписка.ПредставлениеОбъектаМаркетплейса);
				Данные.Вставить("Упаковка",               ВыборкаДанных.Упаковка);
				Данные.Вставить("КоэффициентУпаковки",    КоэффициентУпаковки);
				Данные.Вставить("Остаток",                ВыборкаДанных.ВНаличииНаСкладах1С);			// В базовых единицах
				Данные.Вставить("ЗапланироватьКПоставке", ДанныеСтрокиСписка.ЗапланироватьКПоставке);	// В упаковках
				Данные.Вставить("ПоСкладам",              Новый Массив);
			КонецЕсли;
			
			Если Данные.ПоСкладам.Количество() = 0 Тогда
				Зарезервировано = 0;
				
				Для Каждого КлючЗначение Из ПланированиеПоСкладам Цикл
					Если КлючЗначение.Значение.НомерПоПорядку <> Данные.НомерПоПорядку Тогда
						Зарезервировано = Зарезервировано 
											+ Окр(КлючЗначение.Значение.ЗапланироватьКПоставке * КлючЗначение.Значение.КоэффициентУпаковки, 3, РежимОкругления.Окр15как20);
					КонецЕсли;
				КонецЦикла;
				
				Если Не ПланироватьПоSellmonitor Тогда
					Данные.ЗапланироватьКПоставке = Макс(0, Мин(?(Настройки.ДополнительныеСвойства.АнализироватьОтгрузки, ДанныеСтрокиСписка.ПлановаяПотребность, 0) - ДанныеСтрокиСписка.ВПоставке, 
															ДанныеСтрокиСписка.ВНаличииНаСкладах1С - Окр(Зарезервировано / Данные.КоэффициентУпаковки, 3, РежимОкругления.Окр15как20)));
				КонецЕсли;
			КонецЕсли;
			
			Если Не ПланироватьПоSellmonitor Тогда
				ДанныеСтрокиСписка.ЗапланироватьКПоставке = Данные.ЗапланироватьКПоставке;
			КонецЕсли;
			ДанныеСтрокиСписка.РучноеИзменение        = (Данные.ПоСкладам.Количество() > 0);
			
			ПланированиеПоСкладам.Вставить(ДанныеСтрокиСписка.ИдентификаторПубликации, Данные);
			Настройки.ДополнительныеСвойства.ПланированиеПоСкладам.Вставить(Ключ, ПланированиеПоСкладам);
		КонецЕсли;

		// Sellmonitor
		Если ПоказатьПотребностьSellmonitor И ТекущаяСтраница <> Неопределено Тогда
			
			КлючПоиска = ДанныеСтрокиСписка.ИдентификаторFBO;
			
			// 1. Ищем в данных текущей страницы
			СтрокаПланаSellmonitor = ДанныеТекущейСтраницы.Получить(КлючПоиска);
			
			// 2. Ищем в извлеченных из хранилища данных других страниц
			Если СтрокаПланаSellmonitor = Неопределено Тогда
				Для Каждого КлючЗначение Из СчитанныеДанныеКэша Цикл
					СтрокаПланаSellmonitor = КлючЗначение.Значение.Получить(КлючПоиска);
					Если СтрокаПланаSellmonitor <> Неопределено Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			// 3. Ищем среди хранилища адресов подходящую страницу и извлекаем из нее данные
			Если СтрокаПланаSellmonitor = Неопределено Тогда
				
				Для Каждого КэшСтраницы Из Настройки.ДополнительныеСвойства.АдресаСтраницПотребностьSellmonitor Цикл
					Если ТекущийКлюч >= КэшСтраницы.Значение.ПервыйКлюч И ТекущаяСтраница <> КэшСтраницы 
						И СчитанныеДанныеКэша.Получить(КэшСтраницы.Значение.АдресСтраницы) = Неопределено Тогда
						ДанныеКэшаСтраницаДляТекущегоКлюча = ПолучитьИзВременногоХранилища(КэшСтраницы.Значение.АдресСтраницы);
						
						СчитанныеДанныеКэша.Вставить(КэшСтраницы.Значение.АдресСтраницы, ДанныеКэшаСтраницаДляТекущегоКлюча);
						СтрокаПланаSellmonitor = ДанныеКэшаСтраницаДляТекущегоКлюча.Получить(КлючПоиска);
					
						Если СтрокаПланаSellmonitor <> Неопределено Тогда
							Прервать;
						КонецЕсли;
						
					ИначеЕсли ТекущийКлюч < КэшСтраницы.Значение.ПервыйКлюч Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			// 4. В текущем кэше нет информации о номенклатуре
			Если СтрокаПланаSellmonitor = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// 5. Выводим данные на экран
			ДанныеСтрокиСписка.ВНаличииSellmonitor = СтрокаПланаSellmonitor.ВНаличии;
			ДанныеСтрокиСписка.ПлановаяПотребностьSellmonitor = СтрокаПланаSellmonitor.ПлановаяПотребность;
			
			Если ПланироватьПоSellmonitor Тогда
				ДанныеСтрокиСписка.ЗаказаноSellmonitor			= СтрокаПланаSellmonitor.Заказано;
				ДанныеСтрокиСписка.ОтмененоSellmonitor			= СтрокаПланаSellmonitor.Отменено;
				ДанныеСтрокиСписка.ДнейВНаличииSellmonitor		= СтрокаПланаSellmonitor.ДнейВНаличии;
				ДанныеСтрокиСписка.СреднийЗаказВДеньSellmonitor	= Окр(?(СтрокаПланаSellmonitor.ДнейВНаличии = 0, 0, 
																(СтрокаПланаSellmonitor.Заказано - СтрокаПланаSellmonitor.Отменено) / СтрокаПланаSellmonitor.ДнейВНаличии), 3, РежимОкругления.Окр15как20);
				ДанныеСтрокиСписка.ЗапасДнейSellmonitor			= Окр(?(СтрокаПланаSellmonitor.СреднийЗаказВДень = 0, 0, 
																СтрокаПланаSellmonitor.ВНаличии / СтрокаПланаSellmonitor.СреднийЗаказВДень), 1, РежимОкругления.Окр15как20);

				// Количество упаковок товаров в документах "Заказ клиента"
				ДанныеСтрокиСписка.ВПоставкеSellmonitor          = Окр(ВыборкаДанных.ВПоставке / КоэффициентУпаковки, 3, РежимОкругления.Окр15как20);
				
				Если ДанныеСтрокиСписка.ВНаличииНаСкладах1С > 0 Тогда
					Ключ                  = ПолучитьКлючПланирования(ВыборкаДанных.Номенклатура, ВыборкаДанных.Характеристика);
					ПланированиеПоСкладам = Настройки.ДополнительныеСвойства.ПланированиеПоСкладам.Получить(Ключ);

					Если ПланированиеПоСкладам = Неопределено Тогда
						ПланированиеПоСкладам = Новый Соответствие;
					КонецЕсли;
					
					Данные = ПланированиеПоСкладам.Получить(ДанныеСтрокиСписка.ИдентификаторПубликации);
					
					Если Данные = Неопределено Тогда
						Данные = Новый Структура;
						Данные.Вставить("НомерПоПорядку",         ПланированиеПоСкладам.Количество() + 1);
						Данные.Вставить("ПредставлениеОбъекта",   ДанныеСтрокиСписка.ПредставлениеОбъектаМаркетплейса);
						Данные.Вставить("Упаковка",               ВыборкаДанных.Упаковка);
						Данные.Вставить("КоэффициентУпаковки",    КоэффициентУпаковки);
						Данные.Вставить("Остаток",                ВыборкаДанных.ВНаличииНаСкладах1С);			// В базовых единицах
						Данные.Вставить("ЗапланироватьКПоставке", ДанныеСтрокиСписка.ЗапланироватьКПоставке);	// В упаковках
						Данные.Вставить("ПоСкладам",              Новый Массив);
					КонецЕсли;
					
					Если Данные.ПоСкладам.Количество() = 0 Тогда
						Зарезервировано = 0;
						
						Для Каждого КлючЗначение Из ПланированиеПоСкладам Цикл
							Если КлючЗначение.Значение.НомерПоПорядку <> Данные.НомерПоПорядку Тогда
								Зарезервировано = Зарезервировано 
													+ Окр(КлючЗначение.Значение.ЗапланироватьКПоставке * КлючЗначение.Значение.КоэффициентУпаковки, 3, РежимОкругления.Окр15как20);
							КонецЕсли;
						КонецЦикла;
						
						Данные.ЗапланироватьКПоставке = Макс(0, Мин(ДанныеСтрокиСписка.ПлановаяПотребностьSellmonitor - ДанныеСтрокиСписка.ВПоставкеSellmonitor,
																	ДанныеСтрокиСписка.ВНаличииНаСкладах1С - Окр(Зарезервировано / Данные.КоэффициентУпаковки, 3, РежимОкругления.Окр15как20)));
					КонецЕсли;
					
					ДанныеСтрокиСписка.ЗапланироватьКПоставке = Данные.ЗапланироватьКПоставке;
					ДанныеСтрокиСписка.РучноеИзменение        = (Данные.ПоСкладам.Количество() > 0);
					
					ПланированиеПоСкладам.Вставить(ДанныеСтрокиСписка.ИдентификаторПубликации, Данные);
					Настройки.ДополнительныеСвойства.ПланированиеПоСкладам.Вставить(Ключ, ПланированиеПоСкладам);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыполняетсяЗамер Тогда
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, ТаблицаТоваров.Количество());
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаВыбораСпособыПланирования

&НаКлиенте
Процедура ТаблицаВыбораСпособыПланированияПриАктивизацииЯчейки(Элемент)

	Если Элементы.ГруппаСпособыПланированияВыбор.Скрыта() Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.ВыделенныеСтроки.Очистить();
	
	Если Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаВыбораСпособыПланированияОсновной" Тогда

		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ТекущиеДанные.Отметка Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого СтрокаВыбора Из ТаблицаВыбораСпособыПланирования Цикл
			СтрокаВыбора.Основной = Ложь;
		КонецЦикла;
		Для Каждого ЭлементСписка Из СпособыПланирования Цикл
			Если ЭлементСписка.Значение = ТекущиеДанные.Значение Тогда
				ЭлементСписка.Картинка = БиблиотекаКартинок.Избранное;
			Иначе
				ЭлементСписка.Картинка = Новый Картинка;
			КонецЕсли;
		КонецЦикла;
		
		ТекущиеДанные.Основной = Истина;
		СпособПланирования  = ТекущиеДанные.Значение;

		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СпособыПланирования", СпособыПланирования);
		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СпособПланирования", СпособПланирования);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораСпособыПланированияОтметкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаВыбораСпособыПланирования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйЭлементВыбора = Элементы.СпособПланирования.СписокВыбора.НайтиПоЗначению(ТекущиеДанные.Значение);
	
	Если ТекущиеДанные.Отметка Тогда
		Если ТекущиеДанные.Основной Тогда
			СпособыПланирования.Добавить(ТекущиеДанные.Значение,,, БиблиотекаКартинок.Избранное);
			СпособПланирования = ТекущиеДанные.Значение;
		Иначе
			СпособыПланирования.Добавить(ТекущиеДанные.Значение);
		КонецЕсли;
		
		Если НайденныйЭлементВыбора = Неопределено Тогда
			Элементы.СпособПланирования.СписокВыбора.Добавить(ТекущиеДанные.Значение);
		КонецЕсли;
		
		Если ТекущиеДанные.Значение = "Sellmonitor" И Не АнализироватьОтгрузки Тогда
			АнализироватьОтгрузки = Истина;
			УстановитьВидимостьДоступность("АнализироватьОтгрузки");
		КонецЕсли;
		
	Иначе
		ТекущиеДанные.Основной = Ложь;
		НайденныйЭлемент = СпособыПланирования.НайтиПоЗначению(ТекущиеДанные.Значение);
		Если НайденныйЭлемент <> Неопределено Тогда
			Если СпособПланирования = НайденныйЭлемент.Значение Тогда
				СпособПланирования = "";
			КонецЕсли;
			СпособыПланирования.Удалить(НайденныйЭлемент);
		КонецЕсли;
		
		Если НайденныйЭлементВыбора <> Неопределено Тогда
			Элементы.СпособПланирования.СписокВыбора.Удалить(НайденныйЭлементВыбора);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекущиеДанные.Значение = "Sellmonitor" Тогда
		Элементы.ГруппаСервисАналитикиSellmonitor.Доступность = ТекущиеДанные.Отметка;
	КонецЕсли;

	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СпособыПланирования", СпособыПланирования);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СпособПланирования", СпособПланирования);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПериодАнализаОтгрузок(Команда)

	Диалог        = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = ПериодАнализаОтгрузок;
	
	Диалог.Показать(Новый ОписаниеОповещения("ВыборПериодаАнализаОтгрузокЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеОбновленияИнформацииОПродажахТоваров(Команда)

	Префиксы                        = ИнтеграцияСМаркетплейсомOzonКлиентСервер.ПрефиксыСервиса();
	РегламентноеЗаданиеПрефикс      = Префиксы.ОбновлениеИнформацииОПродажахТоваров;
	РегламентноеЗаданиеНаименование = ИнтеграцияСМаркетплейсомOzonКлиентСервер.НаименованиеРегламентногоЗадания(РегламентноеЗаданиеПрефикс);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УчетнаяЗаписьМаркетплейса",        УчетнаяЗаписьТорговойПлощадки);
	ПараметрыОткрытия.Вставить("ИмяМетаданных",                    "ОбновлениеИнформацииОПродажахТоваровЧерезСкладыOzon");
	ПараметрыОткрытия.Вставить("Префикс",                          РегламентноеЗаданиеПрефикс);  
	ПараметрыОткрытия.Вставить("Наименование",                     РегламентноеЗаданиеНаименование);
	ПараметрыОткрытия.Вставить("ОткрыватьПодОграниченнымиПравами", Истина);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастроитьРасписаниеОбновленияИнформацииОПродажахТоваровЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.Форма.РегламентноеЗадание",
		ПараметрыОткрытия,
		ЭтотОбъект,,,,
		ОповещениеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)

	СменитьСтраницу("_Далее");

КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)

	СменитьСтраницу("_Назад");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеДляПланирования(Команда)

	Настройки = ПолучитьНастройкиПланированияНаСервере();
	
	Если Настройки.ДополнительныеСвойства.Свойство("РучныеИзменения")
			И Настройки.ДополнительныеСвойства.РучныеИзменения Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьДанныеДляПланированияЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеОЗавершении, 
			НСтр("ru = 'Данные ручного планирования будут заменены на рассчитанные автоматически. Продолжить?'"), 
			РежимДиалогаВопрос.ДаНет, 
			, 
			КодВозвратаДиалога.Да, 
			НСтр("ru = 'Планирование поставок на склады Ozon'"), 
			КодВозвратаДиалога.Нет);
		
	Иначе
		ЗаполнитьДанныеДляПланированияЗавершение(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодсказку(Команда)
	
	ОчиститьСообщения();
	ИзменитьВидимостьПодсказки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПодсказку(Команда)
	
	ОчиститьСообщения();
	ИзменитьВидимостьПодсказки(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокСкладовТорговойПлощадки()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СоответствияОбъектовМаркетплейсов.ИдентификаторОбъектаМаркетплейса КАК ИдентификаторОбъектаМаркетплейса,
		|	СоответствияОбъектовМаркетплейсов.НаименованиеОбъектаМаркетплейса КАК НаименованиеОбъектаМаркетплейса
		|ИЗ
		|	РегистрСведений.СоответствияОбъектовМаркетплейсов КАК СоответствияОбъектовМаркетплейсов
		|ГДЕ
		|	СоответствияОбъектовМаркетплейсов.УчетнаяЗаписьМаркетплейса = &УчетнаяЗаписьТорговойПлощадки
		|	И СоответствияОбъектовМаркетплейсов.ВидОбъектаМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовМаркетплейсов.Склад)
		|	И СоответствияОбъектовМаркетплейсов.ИспользуетсяДляСхемыРаботыFBO";

	Запрос.УстановитьПараметр("УчетнаяЗаписьТорговойПлощадки", УчетнаяЗаписьТорговойПлощадки);
	
	Элементы.ИдентификаторСкладаТорговойПлощадки.СписокВыбора.Очистить();
	ВыборкаСкладов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСкладов.Следующий() Цикл
		Элементы.ИдентификаторСкладаТорговойПлощадки.СписокВыбора.Добавить(
			ВыборкаСкладов.ИдентификаторОбъектаМаркетплейса,
			ВыборкаСкладов.НаименованиеОбъектаМаркетплейса);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОРегламентномЗадании()

	Префиксы                   = ИнтеграцияСМаркетплейсомOzonКлиентСервер.ПрефиксыСервиса();
	РегламентноеЗаданиеПрефикс = Префиксы.ОбновлениеИнформацииОПродажахТоваров;
	РегламентноеЗаданиеКлюч    = РегламентноеЗаданиеПрефикс + Строка(УчетнаяЗаписьТорговойПлощадки.УникальныйИдентификатор());

	УстановитьПривилегированныйРежим(Истина);
	
	Отбор     = Новый Структура("Ключ", РегламентноеЗаданиеКлюч);
	Результат = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	
	Если Результат.Количество() > 0 Тогда
		Если Результат[0].Использование Тогда
			Элементы.РасписаниеОбновленияИнформацииОПродажахТоваровОтключено.Видимость = Ложь;
			Элементы.НастроитьРасписаниеОбновленияИнформацииОПродажахТоваров.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Обновление информации о продажах товаров на складах торговой площадки выполняется: %1'"), 
				Результат[0].Расписание);
			
		Иначе
			Элементы.РасписаниеОбновленияИнформацииОПродажахТоваровОтключено.Видимость = Истина;
			Элементы.НастроитьРасписаниеОбновленияИнформацииОПродажахТоваров.Заголовок =
				НСтр("ru = 'Обновление информации о продажах товаров на складах торговой площадки'");
		КонецЕсли;

	Иначе
		Элементы.РасписаниеОбновленияИнформацииОПродажахТоваровОтключено.Видимость = Истина;
		Элементы.НастроитьРасписаниеОбновленияИнформацииОПродажахТоваров.Заголовок =
			НСтр("ru = 'Обновление информации о продажах товаров на складах торговой площадки'");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическихСписков()
	
	НастройкиУчетнойЗаписи             = Справочники.УчетныеЗаписиМаркетплейсов.НастройкиУчетнойЗаписи(УчетнаяЗаписьТорговойПлощадки);
	ИспользоватьПартнеровИКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов");
	ИспользоватьСоглашенияСКлиентами   = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользуютсяДоговорыКонтрагентов   = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	Если ИспользоватьСоглашенияСКлиентами Тогда
		УстановитьПривилегированныйРежим(Истина);
		ИспользуютсяДоговорыКонтрагентов = ИспользуютсяДоговорыКонтрагентов
											И ЗначениеЗаполнено(НастройкиУчетнойЗаписи.Соглашение)
												И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкиУчетнойЗаписи.Соглашение, "ИспользуютсяДоговорыКонтрагентов");
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	СформированныеДокументы.Параметры.УстановитьЗначениеПараметра("Организация",					    НастройкиУчетнойЗаписи.Организация);
	СформированныеДокументы.Параметры.УстановитьЗначениеПараметра("Партнер",						    НастройкиУчетнойЗаписи.Партнер);
	СформированныеДокументы.Параметры.УстановитьЗначениеПараметра("ИспользоватьПартнеровИКонтрагентов", ИспользоватьПартнеровИКонтрагентов);
	СформированныеДокументы.Параметры.УстановитьЗначениеПараметра("Контрагент",                         НастройкиУчетнойЗаписи.Контрагент);
	СформированныеДокументы.Параметры.УстановитьЗначениеПараметра("ИспользоватьСоглашенияСКлиентами",   ИспользоватьСоглашенияСКлиентами);
	СформированныеДокументы.Параметры.УстановитьЗначениеПараметра("Соглашение",						    НастройкиУчетнойЗаписи.Соглашение);
	СформированныеДокументы.Параметры.УстановитьЗначениеПараметра("ИспользуютсяДоговорыКонтрагентов",   ИспользуютсяДоговорыКонтрагентов);
	СформированныеДокументы.Параметры.УстановитьЗначениеПараметра("Договор",						    НастройкиУчетнойЗаписи.ДоговорПродажиЧерезСкладыТорговойПлощадки);
	
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("Организация",					      НастройкиУчетнойЗаписи.Организация);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("Партнер",						      НастройкиУчетнойЗаписи.Партнер);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ИспользоватьПартнеровИКонтрагентов", ИспользоватьПартнеровИКонтрагентов);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("Контрагент",                         НастройкиУчетнойЗаписи.Контрагент);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ИспользоватьСоглашенияСКлиентами",   ИспользоватьСоглашенияСКлиентами);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("Соглашение",						  НастройкиУчетнойЗаписи.Соглашение);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ИспользуютсяДоговорыКонтрагентов",   ИспользуютсяДоговорыКонтрагентов);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("Договор",						      НастройкиУчетнойЗаписи.ДоговорПродажиЧерезСкладыТорговойПлощадки);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДатуАктуальностиДанныхОПродажахТоваров()
	
	ДатаАктуальностиДанныхОПродажахТоваров = Дата(1, 1, 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ТоварыНаСкладахТорговыхПлощадокЗаДеньСрезПоследних.ДатаОбновленияОстатков), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОбновленияОстатков,
		|	ЕСТЬNULL(МАКСИМУМ(ТоварыНаСкладахТорговыхПлощадокЗаДеньСрезПоследних.ДатаОбновленияОборотов), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОбновленияОборотов
		|ИЗ
		|	РегистрСведений.ТоварыНаСкладахТорговыхПлощадокЗаДень.СрезПоследних(, УчетнаяЗаписьТорговойПлощадки = &УчетнаяЗаписьТорговойПлощадки) КАК ТоварыНаСкладахТорговыхПлощадокЗаДеньСрезПоследних";
	
	Запрос.УстановитьПараметр("УчетнаяЗаписьТорговойПлощадки", УчетнаяЗаписьТорговойПлощадки);
	
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	Если ВыборкаДанных.Следующий() Тогда
		ДатаАктуальностиДанныхОПродажахТоваров = Макс(ВыборкаДанных.ДатаОбновленияОстатков, ВыборкаДанных.ДатаОбновленияОборотов);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаАктуальностиДанныхОПродажахТоваров) Тогда
		Элементы.ДанныеДляПланированияГруппаОстаткиНаСкладахТорговойПлощадки.Заголовок = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Остатки на складах Ozon на %1'"),
				Формат(ДатаАктуальностиДанныхОПродажахТоваров, "ДЛФ=DT"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	// Упаковка
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДанныеДляПланированияУпаковка.Имя);
	
	ОтборЭлемента                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДанныеДляПланирования.ИспользоватьУпаковки");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст",      Новый ПолеКомпоновкиДанных("ДанныеДляПланирования.ЕдиницаИзмерения"));
	
	//
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДанныеДляПланированияУпаковка.Имя);
	
	ОтборЭлемента                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДанныеДляПланирования.ИспользоватьУпаковки");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДанныеДляПланирования.Упаковка");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст",      Новый ПолеКомпоновкиДанных("ДанныеДляПланирования.ЕдиницаИзмерения"));
	
	// Сформированные документы
	
	// Условное оформление динамического списка
	СформированныеДокументыУсловноеОформление = СформированныеДокументы.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СформированныеДокументыУсловноеОформление.Элементы.Очистить();
	
	// Документ имеет высокий приоритет
	Элемент               = СформированныеДокументыУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Документ имеет высокий приоритет'");
	
	ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Приоритет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.Приоритеты.ПолучитьВысшийПриоритет();
	
	ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ВысокийПриоритетДокумента);
	
	// Документ имеет низкий приоритет
	Элемент               = СформированныеДокументыУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Документ имеет низкий приоритет'");
	
	ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Приоритет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.Приоритеты.ПолучитьНизшийПриоритет();
	
	ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.НизкийПриоритетДокумента);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
		// Выделение цветом состояния "Закрыт"
		Элемент               = СформированныеДокументыУсловноеОформление.Элементы.Добавить();
		Элемент.Представление = НСтр("ru = 'Выделение цветом состояния ""Закрыт""'");
		
		ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Состояние");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовКлиентов.Закрыт;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);
	КонецЕсли;
	
	// Выделение цветом просроченного заказа
	Элемент               = СформированныеДокументыУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Выделение цветом просроченного заказа'");
	
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Состояние");
	
	ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Просрочен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныйДокумент);
	
	// Дата
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "СформированныеДокументы.Дата", Элементы.СформированныеДокументыДата.Имя);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПодчиненныеЭлементыФормы(Знач Элемент)
	
	Результат = Новый Массив;
	
	Для Каждого ЭлементКоллекции Из Элемент.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ЭлементКоллекции) = Тип("ГруппаФормы") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ПолучитьПодчиненныеЭлементыФормы(ЭлементКоллекции));
		Иначе
			Результат.Добавить(ЭлементКоллекции);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность(Знач Элемент = Неопределено)

	Если Элемент = Неопределено 
			Или Элемент = "СтраницыПланирования" Тогда
		Если Элементы.СтраницыПланирования.ТекущаяСтраница = Элементы.СтраницаНастройки Тогда
			Элементы.ФормаДалее.Видимость         = Истина;
			Элементы.ФормаДалее.КнопкаПоУмолчанию = Истина;
			Элементы.ФормаДалее.Заголовок         = НСтр("ru = 'Перейти к планированию поставок >>'");
			Элементы.ФормаНазад.Видимость         = Ложь;
		ИначеЕсли Элементы.СтраницыПланирования.ТекущаяСтраница = Элементы.СтраницаПланирование Тогда
			Элементы.ФормаДалее.Видимость         = Истина;
			Элементы.ФормаДалее.КнопкаПоУмолчанию = Истина;
			Элементы.ФормаДалее.Заголовок         = НСтр("ru = 'Создать заявки на поставку >>'");
			Элементы.ФормаНазад.Видимость         = Истина;
			Элементы.ФормаНазад.Заголовок         = НСтр("ru = '<< Вернуться к настройкам'");
		ИначеЕсли Элементы.СтраницыПланирования.ТекущаяСтраница = Элементы.СтраницаРезультат Тогда
			Элементы.ФормаДалее.Видимость         = Ложь;
			Элементы.ФормаНазад.Видимость         = Истина;
			Элементы.ФормаНазад.КнопкаПоУмолчанию = Истина;
			Элементы.ФормаНазад.Заголовок         = НСтр("ru = '<< Вернуться к планированию поставок'");
		КонецЕсли;
	КонецЕсли;
	
	Если Элемент = Неопределено 
			Или Элемент = "ВидПоставки" Тогда
		Элементы.ИдентификаторСкладаТорговойПлощадки.Доступность    = (ВидПоставки = 1);
		Элементы.ИдентификаторСкладаТорговойПлощадки.ПодсказкаВвода = ?(ВидПоставки = 0, 
			НСтр("ru = '<Не указывается>'"),
			НСтр("ru = '<Выберите склад>'"));
	КонецЕсли;
		
	Если Элемент = Неопределено 
			Или Элемент = "АнализироватьОтгрузки" Тогда
		Элементы.ГруппаПериодАнализаОтгрузок.Видимость									 = АнализироватьОтгрузки;
		Элементы.ГруппаРегламентноеЗаданиеОбновленияИнформацииОПродажахТоваров.Видимость = АнализироватьОтгрузки;
		Элементы.ГруппаАктуальностьДанныхОПродажахТоваров1.Видимость					 = АнализироватьОтгрузки И (ДатаАктуальностиДанныхОПродажахТоваров <> Дата(1, 1, 1));
		Элементы.ГруппаОбновлятьИнформациюОПродажахТоваровПриЗаполненииДанных.Видимость	 = АнализироватьОтгрузки;
		Элементы.ГруппаДнейПланирования.Видимость										 = АнализироватьОтгрузки;

		Элементы.ГруппаАктуальностьДанныхОПродажахТоваров2.Видимость					 = АнализироватьОтгрузки И (ДатаАктуальностиДанныхОПродажахТоваров <> Дата(1, 1, 1));
		Элементы.ДанныеДляПланированияГруппаЗаказыСоСкладовТорговойПлощадки.Видимость    = АнализироватьОтгрузки;
		Элементы.ДанныеДляПланированияЗапасДней.Видимость                                = АнализироватьОтгрузки;
		Элементы.ДанныеДляПланированияПлановаяПотребность.Видимость                      = АнализироватьОтгрузки;
		
		Если Кэш.ИспользоватьSellmonitor Тогда
			Элементы.ГруппаСервисАналитикиSellmonitor.Видимость							 = АнализироватьОтгрузки;
			Элементы.ГруппаСервисАналитикиSellmonitor.Доступность = СпособыПланирования.НайтиПоЗначению("Sellmonitor") <> Неопределено;
		КонецЕсли;
		
	КонецЕсли;
		
	Если Элемент = "ДатаАктуальностиДанныхОПродажахТоваров" Тогда
		Элементы.ГруппаАктуальностьДанныхОПродажахТоваров1.Видимость = АнализироватьОтгрузки И (ДатаАктуальностиДанныхОПродажахТоваров <> Дата(1, 1, 1));
		Элементы.ГруппаАктуальностьДанныхОПродажахТоваров2.Видимость = АнализироватьОтгрузки И (ДатаАктуальностиДанныхОПродажахТоваров <> Дата(1, 1, 1));
	КонецЕсли;
	
	Если Кэш.ИспользоватьSellmonitor Тогда
		Если Элемент = "СтраницыПланирования" Тогда
			ВидимостьПоказателейДляРасчета();
		КонецЕсли;
		Если Элемент = Неопределено Или Элемент = "СтраницыПланирования" Тогда
			ВидимостьДатаАктуальности(Элементы.СтраницыПланирования.ТекущаяСтраница = Элементы.СтраницаПланирование);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция СоответствиеПереключенияСтраниц()

	СоответствиеПереключенияСтраниц = Новый Соответствие;
	СоответствиеПереключенияСтраниц.Вставить("СтраницаНастройки_Далее",    "СтраницаПланирование");
	СоответствиеПереключенияСтраниц.Вставить("СтраницаПланирование_Далее", "СтраницаРезультат");
	СоответствиеПереключенияСтраниц.Вставить("СтраницаПланирование_Назад", "СтраницаНастройки");
	СоответствиеПереключенияСтраниц.Вставить("СтраницаРезультат_Назад",    "СтраницаПланирование");

	Возврат СоответствиеПереключенияСтраниц;

КонецФункции

&НаКлиенте
Процедура СменитьСтраницу(Постфикс)

	СоответствиеПереключенияСтраниц = СоответствиеПереключенияСтраниц();
	ИмяСледующейСтраницы            = СоответствиеПереключенияСтраниц.Получить(Элементы.СтраницыПланирования.ТекущаяСтраница.Имя + Постфикс);
	
	Если ЗначениеЗаполнено(ИмяСледующейСтраницы) Тогда
		Если ИмяСледующейСтраницы = "СтраницаРезультат" Тогда
			
			Если Кэш.ИспользоватьSellmonitor Тогда
				Если Не ЗначениеЗаполнено(СпособПланирования) Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите способ планирования'"),,"СпособПланирования");
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			ОповещениеОЗавершении = Новый ОписаниеОповещения("СтраницыПланированияПриСменеСтраницыЗавершение", ЭтотОбъект, "СтраницаРезультат");
			ПоказатьВопрос(ОповещениеОЗавершении, 
				НСтр("ru = 'Создать заявки на поставку по данным планирования?'"), 
				РежимДиалогаВопрос.ДаНетОтмена, 
				, 
				КодВозвратаДиалога.Да, 
				НСтр("ru = 'Планирование поставок на склады Ozon'"), 
				КодВозвратаДиалога.Отмена);
				
			Возврат;
		ИначеЕсли ИмяСледующейСтраницы = "СтраницаПланирование" Тогда
			Если Кэш.ИспользоватьSellmonitor Тогда
				
				Если СпособыПланирования.Количество() = 0 Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(
						НСтр("ru = 'Укажите хотя бы один способ планирования'")
						,, "СпособыПланирования");
						
					Возврат;
					
				ИначеЕсли СпособыПланирования.НайтиПоЗначению("Sellmonitor") <> Неопределено Тогда
					Если ДатаПоставкиПлан < НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса())  Тогда
						ОбщегоНазначенияКлиент.СообщитьПользователю(
							НСтр("ru = 'Планируемая дата поставки не может быть меньше текущей даты'")
							,, "ДатаПоставкиПлан");
						
						Возврат;
					КонецЕсли;
				КонецЕсли;
				
				Если СпособыПланирования.Количество() = 1 И Не ЗначениеЗаполнено(СпособПланирования) Тогда
					СпособПланирования = СпособыПланирования[0].Значение;
					СпособыПланирования[0].Картинка = БиблиотекаКартинок.Избранное;
					ПараметрыПоиска = Новый Структура("Значение", СпособПланирования);
					НайденныеСтроки = ТаблицаВыбораСпособыПланирования.НайтиСтроки(ПараметрыПоиска);
					Если НайденныеСтроки.Количество() = 1 Тогда
						НайденныеСтроки[0].Основной = Истина;
					КонецЕсли;
				КонецЕсли;

				ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.СпособыПланирования = СпособыПланирования;
				ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.СпособПланирования = СпособПланирования;
				
				Элементы.ДанныеДляПланированияПлановаяПотребность.Видимость = СпособыПланирования.НайтиПоЗначению("1С") <> Неопределено;
				Элементы.ДанныеДляПланированияПлановаяПотребностьSellmonitor.Видимость = СпособыПланирования.НайтиПоЗначению("Sellmonitor") <> Неопределено;
				
			КонецЕсли;
		КонецЕсли;
		
		Элементы.СтраницыПланирования.ТекущаяСтраница = Элементы[ИмяСледующейСтраницы];
		СтраницыПланированияПослеСменыСтраницы(Элементы.СтраницыПланирования.ТекущаяСтраница);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницыПланированияПослеСменыСтраницы(ТекущаяСтраница)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени(
		"Обработка.УправлениеПродажамиНаOzon.ПланированиеПоставокНаСкладыТорговойПлощадки.ПриСменеСтраницы");

	Если ТекущаяСтраница = Элементы.СтраницаПланирование Тогда
		Настройки = ПолучитьНастройкиПланированияНаСервере();
		
		Если Настройки.ДополнительныеСвойства.Свойство("РучныеИзменения")
				И Настройки.ДополнительныеСвойства.РучныеИзменения Тогда
			Если (Настройки.ДополнительныеСвойства.АнализироватьОтгрузки <> АнализироватьОтгрузки
					Или Настройки.ДополнительныеСвойства.НачалоПериодаАнализаОтгрузок <> ПериодАнализаОтгрузок.ДатаНачала
					Или Настройки.ДополнительныеСвойства.ОкончаниеПериодаАнализаОтгрузок <> ПериодАнализаОтгрузок.ДатаОкончания
					Или Настройки.ДополнительныеСвойства.КоличествоДнейПланирования <> КоличествоДнейПланирования) Тогда
				ОповещениеОЗавершении = Новый ОписаниеОповещения("СтраницыПланированияПриСменеСтраницыЗавершение", ЭтотОбъект, "СтраницаПланирования");
				ПоказатьВопрос(ОповещениеОЗавершении, 
					НСтр("ru = 'При изменении настроек данные планирования рекомендуется заменить на рассчитанные автоматически. Выполнить сброс результатов ручного планирования?'"), 
					РежимДиалогаВопрос.ДаНет, 
					, 
					КодВозвратаДиалога.Да, 
					НСтр("ru = 'Планирование поставок на склады Ozon'"), 
					КодВозвратаДиалога.Нет);
					
			Иначе
				СтраницыПланированияПриСменеСтраницыЗавершение(КодВозвратаДиалога.Нет, "СтраницаПланирование");
			КонецЕсли;
			
		Иначе
			СтраницыПланированияПриСменеСтраницыЗавершение(КодВозвратаДиалога.Да, "СтраницаПланирование");
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДоступность("СтраницыПланирования");
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПланированияПриСменеСтраницыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если ДополнительныеПараметры = "СтраницаПланирование" Тогда
		ОчиститьДанныеДляПланирования = (РезультатВопроса = КодВозвратаДиалога.Да);
		ЗаполнитьДанныеДляПланированияНаКлиенте(ОчиститьДанныеДляПланирования);
		
	ИначеЕсли ДополнительныеПараметры = "СтраницаРезультат" Тогда
		Если РезультатВопроса <> КодВозвратаДиалога.Отмена Тогда
			Элементы.СтраницыПланирования.ТекущаяСтраница = Элементы.СтраницаРезультат;
			СтраницыПланированияПослеСменыСтраницы(Элементы.СтраницыПланирования.ТекущаяСтраница);
		КонецЕсли;
		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			ОчиститьСообщения();
			ПоказатьОповещениеПользователя(
				НСтр("ru = 'Планирование поставок на склады Ozon'"),
				, 
				НСтр("ru = 'Создание заявок на поставку на склады Ozon...'"),
				БиблиотекаКартинок.ЛоготипOzon1);
				
			ОповещениеОЗавершении = Новый ОписаниеОповещения("СоздатьЗаявкиНаПоставкуЗавершениеФоновогоЗадания", ЭтотОбъект);
			
			ДлительнаяОперация    = СоздатьЗаявкиНаПоставкуНаСервере();
			
			Если ДлительнаяОперация.Статус = "Выполнено" Тогда
				ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, ДлительнаяОперация);
				
			Иначе
				ПараметрыОжидания 								   = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
				ПараметрыОжидания.ВыводитьОкноОжидания 			   = Истина;
				ПараметрыОжидания.ТекстСообщения                   = НСтр("ru = 'Создание заявок на поставку на склады Ozon...'");
				ПараметрыОжидания.ОповещениеПользователя.Показать  = Истина;
				ПараметрыОжидания.ОповещениеПользователя.Текст 	   = НСтр("ru = 'Планирование поставок на склады Ozon'");
				ПараметрыОжидания.ОповещениеПользователя.Пояснение = НСтр("ru = 'Завершено создание заявок на поставку на склады Ozon.'");
				ПараметрыОжидания.ОповещениеПользователя.Картинка  = БиблиотекаКартинок.ЛоготипOzon2;
				
				ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыборКатегорийТорговойПлощадкиЗавершение(РезультатЗакрытия, ДополнительныеПараметры = Неопределено) Экспорт

	Если РезультатЗакрытия <> Неопределено Тогда
		КатегорииТорговойПлощадки = РезультатЗакрытия;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаАнализаОтгрузокЗавершение(Период, ДополнительныеПараметры) Экспорт
    
    Если Период <> Неопределено Тогда 
        ПериодАнализаОтгрузок = ДополнительныеПараметры.Диалог.Период;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеОбновленияИнформацииОПродажахТоваровЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ОбновитьИнформациюОРегламентномЗадании();

КонецПроцедуры

&НаСервере
Функция ОбновитьИнформациюОПродажахТоваровЧерезТорговуюПлощадкуНаСервере()
	
	ПараметрыВыполнения 							 = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение            = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания  = НСтр("ru = 'Ozon. Обновление информации о продажах товаров через торговую площадку.'");
	ПараметрыВыполнения.ЗапуститьВФоне               = Истина;
	ПараметрыВыполнения.ПрерватьВыполнениеЕслиОшибка = Истина;

	ИмяМетода = "ИнтеграцияСМаркетплейсомOzonСервер.ОбновитьИнформациюОПродажахТоваровЧерезТорговуюПлощадку";

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		ИмяМетода, 
		УчетнаяЗаписьТорговойПлощадки,
		Неопределено, 
		Неопределено);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнформациюОПродажахТоваровЧерезТорговуюПлощадкуЗавершениеФоновогоЗадания(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Статус = "Ошибка" Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
		ИначеЕсли Результат.Статус = "Выполнено" 
		 		 	И Результат.Свойство("АдресРезультата") Тогда
			Ошибка = ИнтеграцияСМаркетплейсомOzonВызовСервера.ПолучитьРезультатВыполненияФоновогоЗадания(Результат.АдресРезультата);
			
			Если Не ПустаяСтрока(Ошибка.КодОшибки) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибка.ОписаниеОшибки);
			Иначе
				Оповестить("ИнтеграцияСМаркетплейсомOzonСервер.ОбновитьДанные", 
					УчетнаяЗаписьТорговойПлощадки, 
					"Обработка.УправлениеПродажамиНаOzon.ПланированиеПоставокНаСкладыТорговойПлощадки.ОбновитьИнформациюОПродажахТоваровЧерезТорговуюПлощадку");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Элементы.ГруппаОбновлениеДанныхОПродажахТоваров.Видимость    = Ложь;
	Элементы.ГруппаАктуальностьДанныхОПродажахТоваров2.Видимость = АнализироватьОтгрузки И (ДатаАктуальностиДанныхОПродажахТоваров <> Дата(1, 1, 1));

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючПланирования(Номенклатура, Характеристика)
	
	Возврат Строка(Номенклатура.УникальныйИдентификатор()) + "_" + Строка(Характеристика.УникальныйИдентификатор());
	
КонецФункции

&НаСервере
Функция ПолучитьНастройкиПланированияНаСервере()
	
	Возврат ДанныеДляПланирования.КомпоновщикНастроек.Настройки;
	
КонецФункции
	
&НаСервере
Процедура ОчиститьДанныеДляПланированияНаСервере()
	
	НаименованиеСкладаТорговойПлощадки = "";
	АдресСкладаТорговойПлощадки = "";
	
	Если ВидПоставки = 0 Тогда
		НаименованиеСкладаТорговойПлощадки = НСтр("ru = 'Поставка через вРЦ'");
		
	ИначеЕсли Не ПустаяСтрока(ИдентификаторСкладаТорговойПлощадки) Тогда
		ДанныеСклада = Элементы.ИдентификаторСкладаТорговойПлощадки.СписокВыбора.НайтиПоЗначению(
			ИдентификаторСкладаТорговойПлощадки);
		НаименованиеСкладаТорговойПлощадки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Поставка на склад %1'"),
			ДанныеСклада.Представление);
		АдресСкладаТорговойПлощадки = АдресСкладаТорговойПлощадки(
			УчетнаяЗаписьТорговойПлощадки,
			ИдентификаторСкладаТорговойПлощадки);
	КонецЕсли;
	
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ИспользоватьХарактеристикиНоменклатуры", ИспользоватьХарактеристикиНоменклатуры);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ИспользоватьУпаковкиНоменклатуры",       ИспользоватьУпаковкиНоменклатуры);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("УчетнаяЗаписьТорговойПлощадки",          УчетнаяЗаписьТорговойПлощадки);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ИдентификаторСкладаТорговойПлощадки",    ИдентификаторСкладаТорговойПлощадки);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("НаименованиеСкладаТорговойПлощадки",     НаименованиеСкладаТорговойПлощадки);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("АдресСкладаТорговойПлощадки",            АдресСкладаТорговойПлощадки);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ДоступныеСклады1С",                      ДоступныеСклады1С);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("КатегорииТорговойПлощадки",              КатегорииТорговойПлощадки);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("АнализироватьОтгрузки",                  АнализироватьОтгрузки);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("НачалоПериодаАнализаОтгрузок",           ПериодАнализаОтгрузок.ДатаНачала);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ОкончаниеПериодаАнализаОтгрузок",        ПериодАнализаОтгрузок.ДатаОкончания);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("КоличествоДнейПланирования",             КоличествоДнейПланирования);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ПланированиеПоСкладам",                  Новый Соответствие);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("РучныеИзменения",                        Ложь);
	
	Если Кэш.ИспользоватьSellmonitor И СпособПланирования = "Sellmonitor" Тогда
		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ДатаОтгрузки",                       ДатаПоставкиПлан);
	Иначе
		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ДатаОтгрузки",                       ТекущаяДатаСеанса());
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресСкладаТорговойПлощадки(УчетнаяЗапись, ИдентификаторСклада)
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Соответствия.ДополнительныеСведения КАК АдресСклада
		|ИЗ
		|	РегистрСведений.СоответствияОбъектовМаркетплейсов КАК Соответствия
		|ГДЕ
		|	Соответствия.УчетнаяЗаписьМаркетплейса = &УчетнаяЗапись
		|	И Соответствия.ВидОбъектаМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовМаркетплейсов.Склад)
		|	И Соответствия.ИдентификаторОбъектаМаркетплейса = &ИдентификаторСклада";

	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Запрос.УстановитьПараметр("ИдентификаторСклада", ИдентификаторСклада);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Результат = Выборка.АдресСклада; // Строка
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДанныеДляПланированияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьДанныеДляПланирования = Истина;
		ЗаполнитьДанныеДляПланированияНаКлиенте(ОчиститьДанныеДляПланирования);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеДляПланированияНаКлиенте(ОчиститьДанныеДляПланирования = Ложь)
	
	ЗаполнитьДанныеДляПланированияНаСервере(ОчиститьДанныеДляПланирования);
	
	ОбновитьДатуАктуальностиНаФорме();
			
	Если АнализироватьОтгрузки И ОбновлятьИнформациюОПродажахТоваровПриЗаполненииДанных Тогда
		Элементы.ГруппаАктуальностьДанныхОПродажахТоваров2.Видимость = Ложь;
		Элементы.ГруппаОбновлениеДанныхОПродажахТоваров.Видимость    = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьИнформациюОПродажахТоваровЧерезТорговуюПлощадкуЗавершениеФоновогоЗадания", ЭтотОбъект);
		ДлительнаяОперация    = ОбновитьИнформациюОПродажахТоваровЧерезТорговуюПлощадкуНаСервере();
		
		Если ДлительнаяОперация.Статус = "Выполнено" Тогда
			ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, ДлительнаяОперация);
			
		Иначе
			ПараметрыОжидания 					   = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаАктуальностьДанныхОПродажахТоваров2.Видимость = АнализироватьОтгрузки И (ДатаАктуальностиДанныхОПродажахТоваров <> Дата(1, 1, 1));
		Элементы.ГруппаОбновлениеДанныхОПродажахТоваров.Видимость    = Ложь;
	КонецЕсли;

	Если СпособыПланирования.НайтиПоЗначению("Sellmonitor") <> Неопределено Тогда
		
		ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
		ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
	
		ПараметрыОперации.Очередь.Добавить( , ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодРассчитатьПотребностьВЗапасахSellmonitor());
		
		// Методы, зависимые от РассчитатьПотребностьВЗапасахSellmonitor
		ПараметрыМетода = Новый Структура("Пауза, ЗависитОт, ЗависимыеПоля", 1,
			ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодРассчитатьПотребностьВЗапасахSellmonitor(), "Тикет");
		ПараметрыОперации.Очередь.Добавить(ПараметрыМетода, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьРассчитаннуюПотребностьВЗапасахSellmonitor());
		НачатьВыполнениеДлительныхОпераций(ПараметрыОперации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДляПланированияНаСервере(ОчиститьДанныеДляПланирования = Ложь)
	
	Если ОчиститьДанныеДляПланирования Тогда
		ОчиститьДанныеДляПланированияНаСервере();
	КонецЕсли;
	
	ДанныеДляПланирования.Параметры.УстановитьЗначениеПараметра("УчетнаяЗаписьТорговойПлощадки",    УчетнаяЗаписьТорговойПлощадки);
	ДанныеДляПланирования.Параметры.УстановитьЗначениеПараметра("КатегорииТорговойПлощадки",        КатегорииТорговойПлощадки);
	ДанныеДляПланирования.Параметры.УстановитьЗначениеПараметра("ПоВсемКатегориямТорговойПлощадки", (КатегорииТорговойПлощадки.Количество() = 0));
	
	Элементы.ДанныеДляПланирования.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляПланированияИзменить(Элемент, Поле = Неопределено)

	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Неопределено Тогда
		Поле = Элементы.ДанныеДляПланирования.ТекущийЭлемент;
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторПубликации) Тогда
		Ключ				  = ПолучитьКлючПланирования(ТекущиеДанные.Номенклатура, ТекущиеДанные.Характеристика);
		Настройки             = ПолучитьНастройкиПланированияНаСервере();
		ПланированиеПоСкладам = Настройки.ДополнительныеСвойства.ПланированиеПоСкладам.Получить(Ключ);

		ПараметрыОткрытия = Новый Структура;
		Для Каждого КлючЗначение Из Настройки.ДополнительныеСвойства Цикл
			ПараметрыОткрытия.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
		
		ПараметрыОткрытия.Вставить("ИдентификаторПубликации",          ТекущиеДанные.ИдентификаторПубликации);
		ПараметрыОткрытия.Вставить("ИдентификаторОбъектаМаркетплейса", ТекущиеДанные.ИдентификаторОбъектаМаркетплейса);
		ПараметрыОткрытия.Вставить("ПредставлениеОбъектаМаркетплейса", ТекущиеДанные.ПредставлениеОбъектаМаркетплейса);
		ПараметрыОткрытия.Вставить("Номенклатура",                     ТекущиеДанные.Номенклатура);
		ПараметрыОткрытия.Вставить("Характеристика",                   ТекущиеДанные.Характеристика);
		ПараметрыОткрытия.Вставить("Упаковка",                         ТекущиеДанные.Упаковка);
		ПараметрыОткрытия.Вставить("НоменклатураПартнера",             ТекущиеДанные.НоменклатураПартнера);
		ПараметрыОткрытия.Вставить("ПлановаяПотребность",              ТекущиеДанные.ПлановаяПотребность);
		ПараметрыОткрытия.Вставить("ПланированиеПоСкладам",            ПланированиеПоСкладам);
		
		Если Поле.Имя = "ДанныеДляПланированияВНаличииНаСкладах1С"
				Или Поле.Имя = "ДанныеДляПланированияЗапланироватьКПоставке" Тогда
			ПараметрыОткрытия.Вставить("ДанныеТорговойПлощадки", Ложь);
		Иначе                               
			ПараметрыОткрытия.Вставить("ДанныеТорговойПлощадки", Истина);
		КонецЕсли;
		
		Если Кэш.ИспользоватьSellmonitor И СпособПланирования = "Sellmonitor" Тогда
			
			ТекущийКлючSellmonitor = ТекущиеДанные.СтрокаИдентификатор;
			КлючПоиска = ТекущиеДанные.ИдентификаторFBO;
			
			ТекущаяСтраница = Неопределено;
			Для Каждого КэшСтраницы Из Настройки.ДополнительныеСвойства.АдресаСтраницПотребностьSellmonitor Цикл
			
				Если ТекущаяСтраница = Неопределено 
					И ТекущийКлючSellmonitor >= КэшСтраницы.Значение.ПервыйКлюч И ТекущийКлючSellmonitor <= КэшСтраницы.Значение.ПоследнийКлюч Тогда
				
					ТекущаяСтраница = КэшСтраницы;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ТекущаяСтраница <> Неопределено Тогда
				ДанныеСтраницы = ПолучитьИзВременногоХранилища(ТекущаяСтраница.Значение.АдресСтраницы);
				ДанныеТовара = ДанныеСтраницы.Получить(КлючПоиска);
				Если ДанныеТовара <> Неопределено Тогда
					ДанныеПоСкладамSellmonitor = ДанныеТовара.Склады;
				Иначе
					ДанныеПоСкладамSellmonitor = Неопределено;
				КонецЕсли;
				Если ДанныеПоСкладамSellmonitor <> Неопределено Тогда
					ПараметрыОткрытия.Вставить("ПланПоСкладамSellmonitor", ДанныеПоСкладамSellmonitor);
					ПараметрыОткрытия.Вставить("ПлановаяПотребность", ТекущиеДанные.ПлановаяПотребностьSellmonitor);
					ПараметрыОткрытия.Вставить("УчетнаяЗаписьТорговойПлощадки", УчетнаяЗаписьТорговойПлощадки);
				Иначе
					ПараметрыОткрытия.Вставить("ПланПоСкладамSellmonitor", Новый Соответствие);
					ПараметрыОткрытия.Вставить("ПлановаяПотребность", 0);
					ПараметрыОткрытия.Вставить("УчетнаяЗаписьТорговойПлощадки", УчетнаяЗаписьТорговойПлощадки);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДанныеДляПланированияВыборЗавершение", ЭтотОбъект);
		ОткрытьФорму("Обработка.УправлениеПродажамиНаOzon.Форма.ПланированиеПоставкиДляТовара",
			ПараметрыОткрытия,
			ЭтотОбъект,,,,
			ОповещениеОЗакрытии,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляПланированияВыборЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		ДанныеДляПланированияОбновитьНаСервере(РезультатЗакрытия);
		Элементы.ДанныеДляПланирования.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДанныеДляПланированияОбновитьНаСервере(РезультатЗакрытия)
	
	Ключ                  = ПолучитьКлючПланирования(РезультатЗакрытия.Номенклатура, РезультатЗакрытия.Характеристика);
	ПланированиеПоСкладам = ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ПланированиеПоСкладам.Получить(Ключ);
	
	Если ПланированиеПоСкладам = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Данные = ПланированиеПоСкладам.Получить(РезультатЗакрытия.ИдентификаторПубликации);
	
	Если Данные = Неопределено Тогда
		Данные = Новый Структура;
		Данные.Вставить("НомерПоПорядку",       ПланированиеПоСкладам.Количество() + 1);
		Данные.Вставить("ПредставлениеОбъекта", РезультатЗакрытия.ПредставлениеОбъектаМаркетплейса);
		Данные.Вставить("Упаковка",             РезультатЗакрытия.Упаковка);
		Данные.Вставить("КоэффициентУпаковки",  РезультатЗакрытия.КоэффициентУпаковки);
	КонецЕсли;
	
	Данные.Вставить("Остаток",                РезультатЗакрытия.ВНаличииНаСкладах1С);				// В базовых единицах
	Данные.Вставить("ЗапланироватьКПоставке", РезультатЗакрытия.ЗапланироватьКПоставке);			// В упаковках
	Данные.Вставить("ПоСкладам",              РезультатЗакрытия.ПоСкладам);
	
	ПланированиеПоСкладам.Вставить(РезультатЗакрытия.ИдентификаторПубликации, Данные);
	ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ПланированиеПоСкладам.Вставить(Ключ, ПланированиеПоСкладам);
	
	Если Данные.ПоСкладам.Количество() > 0 Тогда
		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.РучныеИзменения = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьЗаявкиНаПоставкуНаСервере()
	
	ПараметрыВыполнения 							 = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение            = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания  = НСтр("ru = 'Ozon. Создание заявок на поставку.'");
	ПараметрыВыполнения.ЗапуститьВФоне               = Истина;
	ПараметрыВыполнения.ПрерватьВыполнениеЕслиОшибка = Истина;
	
	Если Кэш.ИспользоватьSellmonitor Тогда
		ДополнительныеСвойства = ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
		ДополнительныеСвойства.Вставить("СпособыПланирования", СпособыПланирования);
		ДополнительныеСвойства.Вставить("СпособПланирования", СпособПланирования);
	
		Если СпособПланирования = "Sellmonitor" Тогда
			ДополнительныеСвойства.Вставить("ДанныеСтраницПотребностьSellmonitor", Новый Массив);
			ДанныеСтраницПотребностьSellmonitor = ДополнительныеСвойства.ДанныеСтраницПотребностьSellmonitor;
			Для Каждого ОписаниеСтраницы Из ДополнительныеСвойства.АдресаСтраницПотребностьSellmonitor Цикл
				Если Не ЭтоАдресВременногоХранилища(ОписаниеСтраницы.Значение.АдресСтраницы) Тогда
					Продолжить;
				КонецЕсли;
			
				ДанныеСтраницы = ПолучитьИзВременногоХранилища(ОписаниеСтраницы.Значение.АдресСтраницы);
				Если ДанныеСтраницы = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ДанныеСтраницПотребностьSellmonitor.Добавить(ДанныеСтраницы);
			КонецЦикла;
			
			ПредАнализироватьОтгрузки = ДополнительныеСвойства.АнализироватьОтгрузки;
			ДополнительныеСвойства.АнализироватьОтгрузки = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ИмяМетода = "Обработки.УправлениеПродажамиНаOzon.СоздатьЗаявкиНаПоставку";

	Результат = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		ИмяМетода, 
		УчетнаяЗаписьТорговойПлощадки,
		ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства);
		
	Если СпособПланирования = "Sellmonitor" Тогда
		ДополнительныеСвойства.Удалить("ДанныеСтраницПотребностьSellmonitor");
		ДополнительныеСвойства.АнализироватьОтгрузки = ПредАнализироватьОтгрузки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СоздатьЗаявкиНаПоставкуЗавершениеФоновогоЗадания(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Статус = "Ошибка" Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
		ИначеЕсли Результат.Статус = "Выполнено" 
		 		 	И Результат.Свойство("АдресРезультата") Тогда
			Ошибка = ИнтеграцияСМаркетплейсомOzonВызовСервера.ПолучитьРезультатВыполненияФоновогоЗадания(Результат.АдресРезультата);
			
			Если Не ПустаяСтрока(Ошибка.КодОшибки) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибка.ОписаниеОшибки);
			Иначе
				ОчиститьДанныеДляПланированияНаСервере();
				
				Оповестить("УправлениеПродажамиНаOzon.ПланированиеПоставокНаСкладыТорговойПлощадки.СоздатьЗаявкиНаПоставку", 
					УчетнаяЗаписьТорговойПлощадки, 
					"Обработка.УправлениеПродажамиНаOzon.ПланированиеПоставокНаСкладыТорговойПлощадки.СоздатьЗаявкиНаПоставку");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьКэшированныеЗначения()
	
	Кэш = Новый Структура;
	Кэш.Вставить("ИспользоватьSellmonitor", ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСSellmonitor"));
	Если Кэш.ИспользоватьSellmonitor Тогда
		Кэш.Вставить("УчетнаяЗаписьSellmonitor", ИнтеграцияСSellmonitorСервер.ОсновнаяУчетнаяЗапись());
		НераспознаннаяНСИ = Новый Структура("НераспознанныеКТ, НераспознанныеСклады", Новый Массив, Новый Массив);
		Кэш.Вставить("АдресНераспознаннойНСИ", ПоместитьВоВременноеХранилище(НераспознаннаяНСИ, УникальныйИдентификатор));
		Кэш.Вставить("ЕстьНераспознаннаяНСИ", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункцииSellmonitor

&НаСервере
Процедура ДобавитьРеквизитыSellmonitor()
		
	ДобавляемыеРеквизиты = Новый Массив;
	РеквизитФормы = Новый РеквизитФормы("ДатаАктуальностиДанныхОПродажахТоваровSellmonitor", 
		Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)),,
		НСтр("ru = 'Информация по товарам на складах торговой площадки актуальна на дату'"));
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры
	
&НаСервере
Процедура ДобавитьПоляSellmonitor()
	
	СписокСвойствЗаполнения = "Формат, ЦветТекстаЗаголовка, ЦветТекста, Шрифт, Ширина, АвтомаксимальнаяШирина, РастягиватьПоГоризонтали, ВыделятьОтрицательные, Заголовок";
	
	// 
	НовыйЭлемент = Элементы.Добавить("ДатаАктуальностиДанныхОПродажахТоваровSellmonitor2", 
		Тип("ПолеФормы"), Элементы.ГруппаАктуальностьДанныхОПродажахТоваров2);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ДатаАктуальностиДанныхОПродажахТоваровSellmonitor";
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элементы.ДатаАктуальностиДанныхОПродажахТоваров2, СписокСвойствЗаполнения);
	НовыйЭлемент.Видимость = Ложь;
	
	// Группа Заказы для складов
	ПолеСКД = ДанныеДляПланирования.ВычисляемыеПоля.Добавить();
	ПолеСКД.ПутьКДанным = "ЗаказаноSellmonitor";
	ПолеСКД.Заголовок = НСТр("ru = 'Заказано'");
	ПолеСКД.ТипЗначения = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3));
	ПолеСКД.Выражение = "0";
	
	ПолеСКД = ДанныеДляПланирования.ВычисляемыеПоля.Добавить();
	ПолеСКД.ПутьКДанным = "ОтмененоSellmonitor";
	ПолеСКД.Заголовок = НСТр("ru = 'Отменено'");
	ПолеСКД.ТипЗначения = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3));
	ПолеСКД.Выражение = "0";
	
	ПолеСКД = ДанныеДляПланирования.ВычисляемыеПоля.Добавить();
	ПолеСКД.ПутьКДанным = "ДнейВНаличииSellmonitor";
	ПолеСКД.Заголовок = НСТр("ru = 'Дней в наличии'");
	ПолеСКД.ТипЗначения = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(6,0));
	ПолеСКД.Выражение = "0";
	
	ПолеСКД = ДанныеДляПланирования.ВычисляемыеПоля.Добавить();
	ПолеСКД.ПутьКДанным = "СреднийЗаказВДеньSellmonitor";
	ПолеСКД.Заголовок = НСТр("ru = 'Средний заказ в день'");
	ПолеСКД.ТипЗначения = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3));
	ПолеСКД.Выражение = "0";
	
	// Группа "Остатки на складах Озон"
	ПолеСКД = ДанныеДляПланирования.ВычисляемыеПоля.Добавить();
	ПолеСКД.ПутьКДанным = "ВНаличииSellmonitor";
	ПолеСКД.Заголовок = НСТр("ru = 'В наличии'");
	ПолеСКД.ТипЗначения = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(6,0));
	ПолеСКД.Выражение = "0";
	
	ПолеСКД = ДанныеДляПланирования.ВычисляемыеПоля.Добавить();
	ПолеСКД.ПутьКДанным = "ЗапасДнейSellmonitor";
	ПолеСКД.Заголовок = НСТр("ru = 'Запас, дней'");
	ПолеСКД.ТипЗначения = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(6,0));
	ПолеСКД.Выражение = "0";
	
	ПолеСКД = ДанныеДляПланирования.ВычисляемыеПоля.Добавить();
	ПолеСКД.ПутьКДанным = "ВПоставкеSellmonitor";
	ПолеСКД.Заголовок = НСТр("ru = 'В поставке'");
	ПолеСКД.ТипЗначения = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3));
	ПолеСКД.Выражение = "0";
	
	// Группа "Плановая потребность"
	ПолеСКД = ДанныеДляПланирования.ВычисляемыеПоля.Добавить();
	ПолеСКД.ПутьКДанным = "ПлановаяПотребностьSellmonitor";
	ПолеСКД.Заголовок = НСТр("ru = 'Sellmonitor'");
	ПолеСКД.ТипЗначения = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3));
	ПолеСКД.Выражение = "0";
	ЗадатьПолюОграниченияИспользования(ПолеСКД, Истина);
	
	НовыйЭлемент = Элементы.Добавить("ДанныеДляПланированияЗаказаноSellmonitor", Тип("ПолеФормы"), Элементы.ДанныеДляПланированияГруппаЗаказыСоСкладовТорговойПлощадки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ДанныеДляПланирования.ЗаказаноSellmonitor";
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элементы.ДанныеДляПланированияЗаказано, СписокСвойствЗаполнения);
	НовыйЭлемент.Видимость = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("ДанныеДляПланированияОтмененоSellmonitor", Тип("ПолеФормы"), Элементы.ДанныеДляПланированияГруппаЗаказыСоСкладовТорговойПлощадки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ДанныеДляПланирования.ОтмененоSellmonitor";
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элементы.ДанныеДляПланированияОтменено, СписокСвойствЗаполнения);
	НовыйЭлемент.Видимость = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("ДанныеДляПланированияДнейВНаличииSellmonitor", Тип("ПолеФормы"), Элементы.ДанныеДляПланированияГруппаЗаказыСоСкладовТорговойПлощадки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ДанныеДляПланирования.ДнейВНаличииSellmonitor";
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элементы.ДанныеДляПланированияДнейВНаличии, СписокСвойствЗаполнения);
	НовыйЭлемент.Видимость = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("ДанныеДляПланированияСреднийЗаказВДеньSellmonitor", Тип("ПолеФормы"), Элементы.ДанныеДляПланированияГруппаЗаказыСоСкладовТорговойПлощадки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ДанныеДляПланирования.СреднийЗаказВДеньSellmonitor";
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элементы.ДанныеДляПланированияСреднийЗаказВДень, СписокСвойствЗаполнения);
	НовыйЭлемент.Видимость = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("ДанныеДляПланированияВНаличииSellmonitor", Тип("ПолеФормы"), Элементы.ДанныеДляПланированияГруппаОстаткиНаСкладахТорговойПлощадки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ДанныеДляПланирования.ВНаличииSellmonitor";
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элементы.ДанныеДляПланированияВНаличии, СписокСвойствЗаполнения);
	НовыйЭлемент.Видимость = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("ДанныеДляПланированияЗапасДнейSellmonitor", Тип("ПолеФормы"), Элементы.ДанныеДляПланированияГруппаОстаткиНаСкладахТорговойПлощадки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ДанныеДляПланирования.ЗапасДнейSellmonitor";
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элементы.ДанныеДляПланированияЗапасДней, СписокСвойствЗаполнения);
	НовыйЭлемент.Видимость = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("ДанныеДляПланированияВПоставкеSellmonitor", Тип("ПолеФормы"), Элементы.ДанныеДляПланированияГруппаОстаткиНаСкладахТорговойПлощадки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ДанныеДляПланирования.ВПоставкеSellmonitor";
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элементы.ДанныеДляПланированияВПоставке, СписокСвойствЗаполнения);
	НовыйЭлемент.Видимость = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("ДанныеДляПланированияПлановаяПотребностьSellmonitor", Тип("ПолеФормы"), Элементы.ГруппаДанныеДляПланированияПлановаяПотребность);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ДанныеДляПланирования.ПлановаяПотребностьSellmonitor";
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элементы.ДанныеДляПланированияПлановаяПотребность, СписокСвойствЗаполнения);
	НовыйЭлемент.Заголовок = "Sellmonitor";
	НовыйЭлемент.Видимость = Истина;
	
	ДанныеДляПланирования.УстановитьОбязательноеИспользование("ЗаказаноSellmonitor", Истина);
	ДанныеДляПланирования.УстановитьОбязательноеИспользование("ОтмененоSellmonitor", Истина);
	ДанныеДляПланирования.УстановитьОбязательноеИспользование("ДнейВНаличииSellmonitor", Истина);
	ДанныеДляПланирования.УстановитьОбязательноеИспользование("СреднийЗаказВДеньSellmonitor", Истина);
	ДанныеДляПланирования.УстановитьОбязательноеИспользование("ВНаличииSellmonitor", Истина);
	ДанныеДляПланирования.УстановитьОбязательноеИспользование("ЗапасДнейSellmonitor", Истина);
	ДанныеДляПланирования.УстановитьОбязательноеИспользование("ВПоставкеSellmonitor", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьПоказателейДляРасчета()
	
	ВидимостьВстроенный = СпособПланирования = "1С";
	
	Элементы.ДанныеДляПланированияЗаказано.Видимость = ВидимостьВстроенный;
	Элементы.ДанныеДляПланированияОтменено.Видимость = ВидимостьВстроенный;
	Элементы.ДанныеДляПланированияДнейВНаличии.Видимость = ВидимостьВстроенный;
	Элементы.ДанныеДляПланированияСреднийЗаказВДень.Видимость = ВидимостьВстроенный;
	Элементы.ДанныеДляПланированияВНаличии.Видимость = ВидимостьВстроенный;
	Элементы.ДанныеДляПланированияЗапасДней.Видимость = ВидимостьВстроенный;
	Элементы.ДанныеДляПланированияВПоставке.Видимость = ВидимостьВстроенный;
	Элементы.ДанныеДляПланированияПлановаяПотребность.Доступность = ВидимостьВстроенный;
	
	Элементы["ДанныеДляПланированияЗаказаноSellmonitor"].Видимость = Не ВидимостьВстроенный;
	Элементы["ДанныеДляПланированияОтмененоSellmonitor"].Видимость = Не ВидимостьВстроенный;
	Элементы["ДанныеДляПланированияДнейВНаличииSellmonitor"].Видимость = Не ВидимостьВстроенный;
	Элементы["ДанныеДляПланированияСреднийЗаказВДеньSellmonitor"].Видимость = Не ВидимостьВстроенный;
	Элементы["ДанныеДляПланированияВНаличииSellmonitor"].Видимость = Не ВидимостьВстроенный;
	Элементы["ДанныеДляПланированияЗапасДнейSellmonitor"].Видимость = Не ВидимостьВстроенный;
	Элементы["ДанныеДляПланированияВПоставкеSellmonitor"].Видимость = Не ВидимостьВстроенный;
	Элементы["ДанныеДляПланированияПлановаяПотребностьSellmonitor"].Доступность = Не ВидимостьВстроенный;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьДатаАктуальности(Видимость = Истина)
	
	ВидимостьВстроенный = СпособПланирования = "1С";
	
	Элементы.ДатаАктуальностиДанныхОПродажахТоваров2.Видимость = Видимость И ВидимостьВстроенный;
	Элементы["ДатаАктуальностиДанныхОПродажахТоваровSellmonitor2"].Видимость = Видимость И Не ВидимостьВстроенный;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьПодсказки(ВидимостьПодсказки)

	Если Элементы.СтраницыПланирования.ТекущаяСтраница = Элементы.СтраницаПланирование Тогда
		ИмяГруппыПодсказки = "ГруппаПланированиеПоставокПодсказка";
	КонецЕсли;

	Элементы[ИмяГруппыПодсказки].Видимость = ВидимостьПодсказки;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДатуАктуальностиНаФорме()
	
	Если Кэш.ИспользоватьSellmonitor И СпособПланирования = "Sellmonitor" Тогда
			Элементы.ДанныеДляПланированияГруппаОстаткиНаСкладахТорговойПлощадки.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Остатки на складах Ozon на %1'"),
				ЭтотОбъект["ДатаАктуальностиДанныхОПродажахТоваровSellmonitor"]);
	Иначе
		Элементы.ДанныеДляПланированияГруппаОстаткиНаСкладахТорговойПлощадки.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Остатки на складах Ozon на %1'"),
			ДатаАктуальностиДанныхОПродажахТоваров);
			
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ДлительныеОперации

#Область ИнициализацияДлительныхОпераций

&НаКлиенте
Процедура НачатьВыполнениеДлительныхОпераций(ПараметрыОперации)
	
	ИнтернетПоддержкаПодключена = Ложь;
	ВыполнитьДлительныеОперации(ИнтернетПоддержкаПодключена, ПараметрыОперации);
	
	Если ИнтернетПоддержкаПодключена Тогда
		НачатьВыполнениеДлительныхОперацийПродолжение(Истина, ПараметрыОперации);
	Иначе
		Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеДлительныхОперацийПродолжение", ЭтотОбъект, ПараметрыОперации);
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(Оповещение, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыполнениеДлительныхОперацийПродолжение(Результат, ПараметрыОперации) Экспорт
	
	ФоновоеЗадание = ПараметрыОперации.ФоновоеЗадание;
	
	Если Результат = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Отсутствует подключение к Интернет-поддержке пользователей.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда
		// Повторный вызов метода после подключения к Интернет-поддержке.
		ВыполнитьДлительныеОперации(Ложь, ПараметрыОперации);
		ФоновоеЗадание = ПараметрыОперации.ФоновоеЗадание;
	КонецЕсли;
	
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ФоновоеЗадание.Статус = "Выполняется" Тогда
		ОжидатьЗавершениеДлительныхОпераций(ПараметрыОперации);
	ИначеЕсли ФоновоеЗадание.Статус = "Выполнено" Тогда
		ОбработатьРезультатДлительныхОпераций(ФоновоеЗадание, ПараметрыОперации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершениеДлительныхОпераций(ПараметрыОперации)
	
	Если Не ПараметрыОперации.ВыводитьОкноОжидания Тогда
		
		ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	ИнтеграцияСМаркетплейсамиСИКлиент.ОжидатьЗавершениеДлительныхОпераций(ЭтотОбъект, ПараметрыОперации);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДлительныеОперации(ИнтернетПоддержкаПодключена, ПараметрыОперации)

	Если Не ИнтеграцияСМаркетплейсамиСИ.ВозможенЗапускФоновогоЗадания(ЭтотОбъект, ПараметрыОперации,
		ИнтернетПоддержкаПодключена) Тогда
		Возврат;
	КонецЕсли;

	Отказ = Ложь;

	ЗаполнитьПараметрыДлительныхОпераций(ПараметрыОперации, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ИнтеграцияСМаркетплейсамиСИ.ВыполнитьДлительныеОперации(ЭтотОбъект, ПараметрыОперации);

КонецПроцедуры

#КонецОбласти

#Область ПараметрыДлительныхОпераций

&НаСервере
Процедура ЗаполнитьПараметрыДлительныхОпераций(ПараметрыОперации, Отказ)
	
	Для Каждого Операция Из ПараметрыОперации.Очередь Цикл
		
		Если Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодРассчитатьПотребностьВЗапасахSellmonitor() Тогда
			ПараметрыЗапросаРассчитатьПотребностьВЗапасахSellmonitor(Операция.Значение);
		ИначеЕсли Операция.Представление = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьРассчитаннуюПотребностьВЗапасахSellmonitor() Тогда
			ПараметрыЗапросаПолучитьРассчитаннуюПотребностьВЗапасахSellmonitor(Операция.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОперации.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.СервисАналитикиSellmonitor;
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапросаРассчитатьПотребностьВЗапасахSellmonitor(ПараметрыЗапроса)
	
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаРассчитатьПотребностьВЗапасахSellmonitor();
	ПараметрыЗапроса.УчетнаяЗапись = ИнтеграцияСSellmonitorСервер.ОсновнаяУчетнаяЗапись();
	ПараметрыЗапроса.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.СервисАналитикиSellmonitor;

	РеквизитыУчетнойЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗаписьТорговойПлощадки, "ИдентификаторКлиента");
	
	ПараметрыЗапроса.ИдентификаторАккаунта = РеквизитыУчетнойЗаписи.ИдентификаторКлиента;
	ПараметрыЗапроса.ВидМаркетплейсаАккаунта = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon;
	ПараметрыЗапроса.ДатаПоставкиПлан = ДатаПоставкиПлан;
	ПараметрыЗапроса.ПериодРасчетаТип = "interval";
	ПараметрыЗапроса.ПериодРасчетаС = НачалоДня(ПериодАнализаОтгрузок.ДатаНачала);
	ПараметрыЗапроса.ПериодРасчетаДо = НачалоДня(ПериодАнализаОтгрузок.ДатаОкончания + 86400);
	ПараметрыЗапроса.ИнтервалПоставок = КоличествоДнейПланирования;
	ПараметрыЗапроса.ПроцентКорректировки = ПроцентКорректировки;
	ПараметрыЗапроса.ТипРасчета = "byWarehouses";
	ПараметрыЗапроса.СтратегияПереизбытка = "ignoreOverflow";
	
	Если ЗначениеЗаполнено(ИдентификаторСкладаТорговойПлощадки) Тогда

		ИдСкладаSellmonitor = ПолучитьИдентификаторСкладаSellmonitor(ИдентификаторСкладаТорговойПлощадки);
		Если ИдСкладаSellmonitor <> Неопределено Тогда
			ПараметрыЗапроса.СкладыХранения.Добавить(ИдСкладаSellmonitor);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторСкладаSellmonitor(ИдентификаторСкладаТорговойПлощадки)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствияОбъектовМаркетплейсов.ИдентификаторОбъектаМаркетплейса КАК ИдентификаторОбъектаМП
	|ИЗ
	|	РегистрСведений.СоответствияОбъектовМаркетплейсов КАК СоответствияОбъектовМаркетплейсов
	|ГДЕ
	|	СоответствияОбъектовМаркетплейсов.УчетнаяЗаписьМаркетплейса = &УчетнаяЗапись
	|	И СоответствияОбъектовМаркетплейсов.ВидОбъектаМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовМаркетплейсов.Склад)
	|	И СоответствияОбъектовМаркетплейсов.Объект1С = &Объект1С";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись", ИнтеграцияСSellmonitorСервер.ОсновнаяУчетнаяЗапись());
	Запрос.УстановитьПараметр("Объект1С", ИдентификаторСкладаТорговойПлощадки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Число(Выборка.ИдентификаторОбъектаМП);
	
КонецФункции

&НаСервере
Процедура ПараметрыЗапросаПолучитьРассчитаннуюПотребностьВЗапасахSellmonitor(ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьРассчитаннуюПотребностьВЗапасахSellmonitor();
	ПараметрыЗапроса.УчетнаяЗапись = ИнтеграцияСSellmonitorСервер.ОсновнаяУчетнаяЗапись();
	ПараметрыЗапроса.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.СервисАналитикиSellmonitor;
	ПараметрыЗапроса.СхемаРаботыСкладов = Перечисления.СхемыРаботыТорговыхПлощадок.FBO;
	
	ПараметрыЗапроса.Пауза = 1;
	ПараметрыЗапроса.Тикет = Тикет;
	ПараметрыЗапроса.Аккаунт = УчетнаяЗаписьТорговойПлощадки;
	ПараметрыЗапроса.Сортировка = "СтрокаИдентификатор"; 
	
	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПараметрыЗапросаПолучитьСкладыМаркетплейса(ПараметрыЗапроса)
	
	ВходящиеПараметры = ПараметрыЗапроса;
	
	ПараметрыЗапроса = ИнтеграцияСМаркетплейсамиСИ.НовыйПараметрыЗапросаПолучитьСкладыМаркетплейса();
	
	ПараметрыЗапроса.ЗапроситьДанныеСМаркетплейса = Истина;

	ПараметрыЗапроса.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.СервисАналитикиSellmonitor;
	ПараметрыЗапроса.УчетнаяЗапись = ИнтеграцияСSellmonitorСервер.ОсновнаяУчетнаяЗапись();
	ПараметрыЗапроса.ВидМаркетплейсаАккаунта = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon;

	Если ВходящиеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ВходящиеПараметры);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область РезультатыДлительныхОпераций

&НаКлиенте
Процедура ОбработатьРезультатДлительныхОпераций(Результат, ДополнительныеПараметры)
	
	Отказ = ТипЗнч(Результат) <> Тип("Структура");
	
	Если Отказ Или Результат.Статус <> "Выполнено" Тогда
		ПослеОбработкиРезультатаДлительныхОпераций(Результат, ДополнительныеПараметры, Истина);
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ОбработкаРезультатаНаСервере Тогда
		РезультатМенеджера = ОбработатьРезультатМенеджераДлительныхОпераций(Результат.АдресРезультата);
	Иначе
		РезультатМенеджера = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	КонецЕсли;
	
	Очередь = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатМенеджера, "Очередь", Новый СписокЗначений);
	
	Для Каждого Операция Из Очередь Цикл
		
		ИмяМетода = Операция.Представление;
		РезультатОперации = Операция.Значение;
		
		Если ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьРассчитаннуюПотребностьВЗапасахSellmonitor() Тогда
			Если РезультатОперации.КодСостояния = 201 И РезультатОперации.Пауза < 10 Тогда
				ПараметрыОперации = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыеПараметрыМенеджераДлительныхОпераций();
				ПараметрыОперации.ОбработкаРезультатаНаСервере = Истина;
				
				ПараметрыМетода = Новый Структура("Тикет, Пауза", РезультатОперации.Тикет, РезультатОперации.Пауза * 1.5);
				
				ПараметрыОперации.Очередь.Добавить(ПараметрыМетода, ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьРассчитаннуюПотребностьВЗапасахSellmonitor());
				НачатьВыполнениеДлительныхОпераций(ПараметрыОперации);
				
			ИначеЕсли РезультатОперации.КодСостояния = 200 Тогда
				ОбновитьДатуАктуальностиНаФорме();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПослеОбработкиРезультатаДлительныхОпераций(Результат, ДополнительныеПараметры, Отказ);
	
КонецПроцедуры

// Обрабатывает результат менеджера длительных операций на сервере.
// 
// Параметры:
//  АдресРезультата - Строка - Адрес результата
// 
// Возвращаемое значение:
//  Произвольный - Результат обработки
&НаСервере
Функция ОбработатьРезультатМенеджераДлительныхОпераций(Знач АдресРезультата)
	
	РезультатМенеджера = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Очередь = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатМенеджера, "Очередь", Новый СписокЗначений);
	РезультатМенеджера.Вставить("КодСостояния", 200);
	
	Для Каждого Операция Из Очередь Цикл
		
		ИмяМетода = Операция.Представление;
		РезультатОперации = Операция.Значение;
		РезультатОбработки = Истина;
		
		Если ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодРассчитатьПотребностьВЗапасахSellmonitor() Тогда
			ОбработатьРезультатРассчитатьПотребностьВЗапасахSellmonitor(РезультатОперации, РезультатОбработки);
		ИначеЕсли ИмяМетода = ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьРассчитаннуюПотребностьВЗапасахSellmonitor() Тогда
			ОбработатьРезультатПолучитьРассчитаннуюПотребностьВЗапасахSellmonitor(РезультатОперации, РезультатОбработки);
		КонецЕсли;
		
		Если РезультатОперации.КодСостояния <> 200 Тогда
			РезультатМенеджера.КодСостояния = РезультатОперации.КодСостояния;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатМенеджера;
	
КонецФункции

&НаКлиенте
Процедура ПослеОбработкиРезультатаДлительныхОпераций(Результат, ДополнительныеПараметры, Отказ)
	
	ИнтеграцияСМаркетплейсамиСИКлиент.ПослеОбработкиРезультатаДлительныхОпераций(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатРассчитатьПотребностьВЗапасахSellmonitor(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Лев(РезультатОперации.КодСостояния,2) <> "20" И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(Ошибка);
		КонецЦикла;
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Тикет = РезультатОперации.Тикет;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатПолучитьРассчитаннуюПотребностьВЗапасахSellmonitor(РезультатОперации, РезультатОбработки)
	
	Если РезультатОперации = Неопределено Тогда
		РезультатОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Если РезультатОперации.КодСостояния <> 200 И РезультатОперации.Ошибки.Количество() > 0 Тогда
		Для Каждого Ошибка Из РезультатОперации.Ошибки Цикл
			ОбщегоНазначения.СообщитьПользователю(Ошибка);
		КонецЦикла;
		РезультатОбработки = Ложь;
		Возврат;
	ИначеЕсли РезультатОперации.КодСостояния = 500 Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатОперации.Тикет <> Тикет Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатОперации.КодСостояния = 201 Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект["ДатаАктуальностиДанныхОПродажахТоваровSellmonitor"] = РезультатОперации.ДатаАктуальности; 
	
	ДополнительныеСвойства = ДанныеДляПланирования.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	ДополнительныеСвойства.АдресаСтраницПотребностьSellmonitor.Очистить();
	
	// Кэшируем рассчитанную потребность
	РазмерСтраницы = 500;
	
	Если РезультатОперации.Потребность.Количество() > 0 Тогда
		Потребность = Новый Соответствие;
		СтраницаКэша = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыйСтраницаКэша();
		СтраницаКэша.ПервыйКлюч = РезультатОперации.Потребность[0].Представление;
		
		НомерСтроки = 1;
		Для Каждого СтрокаПотребность Из РезультатОперации.Потребность Цикл
			
			Если Не ПустаяСтрока(СтраницаКэша.ПоследнийКлюч) Тогда
				СтраницаКэша = ИнтеграцияСМаркетплейсамиСИКлиентСервер.НовыйСтраницаКэша();
				Потребность = Новый Соответствие;
				СтраницаКэша.ПервыйКлюч = СтрокаПотребность.Представление;
				
			КонецЕсли;
			
			Потребность.Вставить(СтрокаПотребность.Значение.ИдентификаторТовара, СтрокаПотребность.Значение);
			
			Если НомерСтроки % РазмерСтраницы = 0 Тогда
				СтраницаКэша.ПоследнийКлюч = Строка(СтрокаПотребность.Представление);
				СтраницаКэша.АдресСтраницы = ПоместитьВоВременноеХранилище(Потребность, УникальныйИдентификатор);
				ДополнительныеСвойства.АдресаСтраницПотребностьSellmonitor.Добавить(СтраницаКэша, СтраницаКэша.ПервыйКлюч);

			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		Если Потребность.Количество() > 0 Тогда
			СтраницаКэша.ПоследнийКлюч = СтрокаПотребность.Представление;
			СтраницаКэша.АдресСтраницы = ПоместитьВоВременноеХранилище(Потребность, УникальныйИдентификатор);
			ДополнительныеСвойства.АдресаСтраницПотребностьSellmonitor.Добавить(СтраницаКэша, СтраницаКэша.ПервыйКлюч);
		КонецЕсли;
		
	КонецЕсли;
	
	НераспознаннаяНСИ = Новый Структура("НераспознанныеКТ, НераспознанныеСклады", Новый Массив, Новый Массив);
	Кэш.ЕстьНераспознаннаяНСИ = Ложь;
	
	КоличествоНераспознано = РезультатОперации.НераспознанныеКТ.Количество();
	Если КоличествоНераспознано > 0 Тогда
		НераспознаннаяНСИ.НераспознанныеКТ = РезультатОперации.НераспознанныеКТ;
		Кэш.ЕстьНераспознаннаяНСИ = Истина;
	КонецЕсли;
	
	КоличествоНераспознано = РезультатОперации.НераспознанныеСклады.Количество();
	Если КоличествоНераспознано > 0 Тогда
		НераспознаннаяНСИ.НераспознанныеСклады = РезультатОперации.НераспознанныеСклады;
		Кэш.ЕстьНераспознаннаяНСИ = Истина;
	КонецЕсли;
	
	Кэш.АдресНераспознаннойНСИ = ПоместитьВоВременноеХранилище(НераспознаннаяНСИ, Кэш.АдресНераспознаннойНСИ);
	
	ЗаполнитьТекстПредупрежденияSellmonitor(НераспознаннаяНСИ,
		Элементы.ДекорацияПредупреждениеSellmonitorТекст.Заголовок,
		Элементы.ГруппаПредупреждениеSellmonitor.Видимость);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьТекстПредупрежденияSellmonitor(НераспознаннаяНСИ, ТекстПредупреждения, ВидимостьПредупреждения)
	
	ЕстьНераспознаннаяНСИ = Ложь;
	
	ЧастиТекстаДляПредупреждения = Новый Массив;
	
	КоличествоНераспознано = НераспознаннаяНСИ.НераспознанныеКТ.Количество();
	Если КоличествоНераспознано > 0 Тогда
		ЕстьНераспознаннаяНСИ = Истина;
		ТекстПредупреждения = СтрШаблон(НСтр("ru='Не распознано %1.'"),
			ПолучитьСклоненияСтрокиПоЧислу(НСтр("ru='карточка товара'"), КоличествоНераспознано, "", "ЧС=Количественное", "ПД=Именительный")[0]);
		ЧастиТекстаДляПредупреждения.Добавить(ТекстПредупреждения);
		ЧастиТекстаДляПредупреждения.Добавить(" ");
		
		ТекстПредупреждения = Новый ФорматированнаяСтрока(НСтр("ru = 'Начать ручное сопоставление'"),,,,"Card");
		ЧастиТекстаДляПредупреждения.Добавить(ТекстПредупреждения);
	КонецЕсли;
	
	КоличествоНераспознано = НераспознаннаяНСИ.НераспознанныеСклады.Количество();
	Если КоличествоНераспознано > 0 Тогда
		
		Если ЕстьНераспознаннаяНСИ Тогда
			ЧастиТекстаДляПредупреждения.Добавить(Символы.ПС);
			ЧастиТекстаДляПредупреждения.Добавить(Символы.ПС);
		КонецЕсли;
		
		ЕстьНераспознаннаяНСИ = Истина;
		
		ТекстПредупреждения = СтрШаблон(НСтр("ru='Не распознано %1.'"),
			ПолучитьСклоненияСтрокиПоЧислу(НСтр("ru='склад'"), КоличествоНераспознано, "", "ЧС=Количественное", "ПД=Именительный")[0]);
		ЧастиТекстаДляПредупреждения.Добавить(ТекстПредупреждения);
		ЧастиТекстаДляПредупреждения.Добавить(" ");
		
		ТекстПредупреждения = Новый ФорматированнаяСтрока(НСтр("ru = 'Начать автоматическое сопоставление'"),,,,"Warehouse");
		ЧастиТекстаДляПредупреждения.Добавить(ТекстПредупреждения);
	КонецЕсли;
	
	ТекстПредупреждения = Новый ФорматированнаяСтрока(ЧастиТекстаДляПредупреждения);
	ВидимостьПредупреждения = ЕстьНераспознаннаяНСИ;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьИнформациюОНераспознаннойНСИ(УчетнаяЗапись, Кэш, ТекстПредупреждения, ВидимостьПредупреждения)
	
	НераспознаннаяНСИ = ПолучитьИзВременногоХранилища(Кэш.АдресНераспознаннойНСИ);
	
	Если НераспознаннаяНСИ.НераспознанныеКТ.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтатусыПубликацииОбъектовМаркетплейсаOzon.ИдентификаторFBOSKU КАК ИдентификаторМП
		|ИЗ
		|	РегистрСведений.СтатусыПубликацииОбъектовМаркетплейсаOzon КАК СтатусыПубликацииОбъектовМаркетплейсаOzon
		|ГДЕ
		|	СтатусыПубликацииОбъектовМаркетплейсаOzon.УчетнаяЗаписьМаркетплейса = &УчетнаяЗапись
		|	И СтатусыПубликацииОбъектовМаркетплейсаOzon.ВидОбъектаМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовМаркетплейсов.Товар)
		|	И СтатусыПубликацииОбъектовМаркетплейсаOzon.ИдентификаторFBOSKU В(&ИдентификаторыОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтатусыПубликацииОбъектовМаркетплейсаOzon.Номенклатура";
			
		Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
		Запрос.УстановитьПараметр("ИдентификаторыОбъектов", НераспознаннаяНСИ.НераспознанныеКТ);
			
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(НераспознаннаяНСИ.НераспознанныеКТ, Выборка.ИдентификаторМП);
		КонецЦикла;
	КонецЕсли;
	
	Если НераспознаннаяНСИ.НераспознанныеСклады.Количество() > 0 Тогда
		Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СоответствияОбъектовМаркетплейсов.ИдентификаторОбъектаМаркетплейса КАК ИдентификаторМП
			|ИЗ
			|	РегистрСведений.СоответствияОбъектовМаркетплейсов КАК СоответствияОбъектовМаркетплейсов
			|ГДЕ
			|	СоответствияОбъектовМаркетплейсов.УчетнаяЗаписьМаркетплейса = &УчетнаяЗапись
			|	И СоответствияОбъектовМаркетплейсов.ВидОбъектаМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовМаркетплейсов.Склад)
			|	И СоответствияОбъектовМаркетплейсов.ИдентификаторОбъектаМаркетплейса В(&ИдентификаторыОбъектов)";
			
			Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
			Запрос.УстановитьПараметр("ИдентификаторыОбъектов", НераспознаннаяНСИ.НераспознанныеСклады);
			
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(НераспознаннаяНСИ.НераспознанныеСклады, Выборка.ИдентификаторМП);
		КонецЦикла;
	КонецЕсли;
	
	Кэш.АдресНераспознаннойНСИ = ПоместитьВоВременноеХранилище(НераспознаннаяНСИ, Кэш.АдресНераспознаннойНСИ);
	
	ЗаполнитьТекстПредупрежденияSellmonitor(НераспознаннаяНСИ, ТекстПредупреждения, ВидимостьПредупреждения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗарегистрироватьНераспознанныеСклады(ПараметрыФормы, АдресНераспознаннойНСИ)
	
	Результат = Новый Структура("ЕстьОшибка, ОписаниеОшибки", Ложь, "");
	
	Если Не ЭтоАдресВременногоХранилища(АдресНераспознаннойНСИ) Тогда
		Результат.ЕстьОшибка = Истина;
		Результат.ОписаниеОшибки = НСтр("ru = 'Идентификаторы складов утеряны'");
		Возврат Результат;
	КонецЕсли;
	
	НераспознаннаяНСИ = ПолучитьИзВременногоХранилища(АдресНераспознаннойНСИ);
	
	Если НераспознаннаяНСИ.НераспознанныеСклады.Количество() = 0 Тогда
		Результат.ЕстьОшибка = Истина;
		Результат.ОписаниеОшибки = НСтр("ru = 'Идентификаторы складов утеряны'");
		Возврат Результат;
	КонецЕсли;
	
	УчетнаяЗаписьSellmonitor = ИнтеграцияСSellmonitorСервер.ОсновнаяУчетнаяЗапись();
	ИдентификаторУчетнойЗаписиМП = XMLСтрока(ПараметрыФормы.УчетнаяЗаписьМаркетплейса); 
	СкладыМП = ПолучитьСкладыМаркетплейса(ПараметрыФормы);
	
	НаборЗаписей = РегистрыСведений.СоответствияОбъектовМаркетплейсов.СоздатьНаборЗаписей();
	НаборЗаписейSellmonitor = РегистрыСведений.СоответствияОбъектовМаркетплейсов.СоздатьНаборЗаписей();
	
	ОставшиесяНераспознанныеСклады = Новый Массив;
	
	Для Каждого ИдентификаторСклада Из НераспознаннаяНСИ.НераспознанныеСклады Цикл
		
		ОписаниеСкладаМП = СкладыМП.Получить(ИдентификаторСклада);
		Если ОписаниеСкладаМП = Неопределено Тогда
			ОставшиесяНераспознанныеСклады.Добавить(ИдентификаторСклада);
			Продолжить;
		КонецЕсли;
		
		Запись = НаборЗаписей.Добавить();
		Запись.УчетнаяЗаписьМаркетплейса = ПараметрыФормы.УчетнаяЗаписьМаркетплейса;
		Запись.ВидОбъектаМаркетплейса = Перечисления.ВидыОбъектовМаркетплейсов.Склад;
		
		Запись.ИдентификаторОбъектаМаркетплейса = ОписаниеСкладаМП.ИдентификаторСкладаМаркетплейса;
		
		Запись.НаименованиеОбъектаМаркетплейса = ОписаниеСкладаМП.НаименованиеСкладаСервиса;
		Если ОписаниеСкладаМП.СхемаРаботыСклада = Перечисления.СхемыРаботыТорговыхПлощадок.FBO Тогда
			Запись.ИспользуетсяДляСхемыРаботыFBO = Истина;
		ИначеЕсли ОписаниеСкладаМП.СхемаРаботыСклада = Перечисления.СхемыРаботыТорговыхПлощадок.FBS Тогда
			Запись.ИспользуетсяДляСхемыРаботыFBS = Истина;
		ИначеЕсли ОписаниеСкладаМП.СхемаРаботыСклада = Перечисления.СхемыРаботыТорговыхПлощадок.DBS Тогда
			Запись.ИспользуетсяДляСхемыРаботыDBS = Истина;
		КонецЕсли;
		
		ЗаписьSellmonitor = НаборЗаписейSellmonitor.Добавить();
		ЗаписьSellmonitor.УчетнаяЗаписьМаркетплейса = УчетнаяЗаписьSellmonitor;
		ЗаписьSellmonitor.ВидОбъектаМаркетплейса = Перечисления.ВидыОбъектовМаркетплейсов.Склад;
		
		ЗаписьSellmonitor.ИдентификаторОбъектаМаркетплейса = ИдентификаторСклада;
		ЗаписьSellmonitor.ИдентификаторВладельцаОбъектаМаркетплейса = ИдентификаторУчетнойЗаписиМП;
		
		ЗаписьSellmonitor.Объект1С = ОписаниеСкладаМП.ИдентификаторСкладаМаркетплейса;
			
		ЗаписьSellmonitor.НаименованиеОбъектаМаркетплейса = ОписаниеСкладаМП.НаименованиеСкладаСервиса;

		ЗаписьSellmonitor.ИспользуетсяДляСхемыРаботыFBO = Запись.ИспользуетсяДляСхемыРаботыFBO;
		ЗаписьSellmonitor.ИспользуетсяДляСхемыРаботыFBS = Запись.ИспользуетсяДляСхемыРаботыFBS;
		ЗаписьSellmonitor.ИспользуетсяДляСхемыРаботыDBS = Запись.ИспользуетсяДляСхемыРаботыDBS;
		
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать(РежимЗамещения.Слияние);
		НаборЗаписейSellmonitor.Записать(РежимЗамещения.Слияние);
		
		НераспознаннаяНСИ.НераспознанныеСклады.Очистить();
		Для Каждого ИдентификаторСклада Из ОставшиесяНераспознанныеСклады Цикл
			НераспознаннаяНСИ.НераспознанныеСклады.Добавить(ИдентификаторСклада);
		КонецЦикла;
		
		ПоместитьВоВременноеХранилище(НераспознаннаяНСИ, АдресНераспознаннойНСИ);
		
	Исключение
		Результат.ЕстьОшибка = Истина;
		Результат.ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСкладыМаркетплейса(ПараметрыФормы)
	
	Результат = Новый Соответствие;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Аккаунт", ПараметрыФормы.УчетнаяЗаписьМаркетплейса);
	ПараметрыЗапросаПолучитьСкладыМаркетплейса(ПараметрыМетода);
	
	ПараметрыМетода.Вставить("Метод", "GET");
	ПараметрыМетода.Вставить("ИмяМетода", ИнтеграцияСМаркетплейсамиСИКлиентСервер.МетодПолучитьСкладыМаркетплейса());
	АдресВХ = ПоместитьВоВременноеХранилище(Неопределено, ПараметрыФормы.УникальныйИдентификатор);
	РезультатПолученияСкладов =  ИнтеграцияСМаркетплейсамиСИ.ПолучитьСкладыМаркетплейса(ПараметрыМетода, АдресВХ);
	Если ТипЗнч(РезультатПолученияСкладов) = Тип("Структура") И РезультатПолученияСкладов.КодСостояния = 200 Тогда
		СкладыМаркетплейса = РезультатПолученияСкладов.СкладыМаркетплейса;
		Для Каждого СкладМаркетплейса Из СкладыМаркетплейса Цикл
			Результат.Вставить(СкладМаркетплейса.ИдентификаторСкладаСервиса, СкладМаркетплейса);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗадатьПолюОграниченияИспользования(ПолеНабораДанных, ЗначениеОграничения)
	ПолеНабораДанных.ОграничениеИспользования.Группировка = ЗначениеОграничения;
	ПолеНабораДанных.ОграничениеИспользования.Порядок = ЗначениеОграничения;
	ПолеНабораДанных.ОграничениеИспользования.Условие = ЗначениеОграничения;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
