#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаПЛ(Данные, Представление, СтандартнаяОбработка, "5");
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаЗаполнения

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиПредыдущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ДокументОбъектИлиСсылка.Титул1, ТаблицаОшибок);
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		// TODO понять какие сценарии проверки входящего документа
		
	Иначе
		
		// TODO реализовать проверку документа
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ПроверитьИнфПол(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);

	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ДокументТитул1 = Объект.Титул1;
	
	Если НЕ ЗначениеЗаполнено(ДокументТитул1)  Тогда
		
		ТекстОшибки = "Титул не привязан к первому титулу Путевого листа";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументТитул1", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ЭППредрейсовыйМО) Тогда
		
		ТекстОшибки = "Не получена подпись сотавителя Т2";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ЭППредрейсовыйМО", КатегорияОшибка, ТекстОшибки, "Выполнить обмен");
		
	КонецЕсли;
	
	Если Объект.ЕстьОтказВПодписи И Не ЗначениеЗаполнено(Объект.ПричинаОтказаВПодписи) Тогда 
		
		ТекстОшибки = "Не указана причина отказа в подписи";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ПричинаОтказаВПодписи", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ПЛ_Титул5_5_02.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, "", "", ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументТитул1.ОрганизацияМедик) Тогда 
		
		Если Не ДокументТитул1.ОрганизацияМедик.Наш Тогда 
			
			ТекстОшибки = "Организация проводящая медосмотр не Наша";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументТитул1ЛицоМедик", КатегорияОшибка, ТекстОшибки, "Ошибка");
			
		КонецЕсли;
		
		Если ДокументТитул1.ЛицоОформившееПЛ <> ДокументТитул1.ОрганизацияМедик Тогда
			
			Если Не ЗначениеЗаполнено(ДокументТитул1.ОрганизацияМедик.ИНН) Тогда 
				
				ТекстОшибки = "У организация проводящей медосмотр не заполнен ИНН";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ДокументТитул1ЛицоМедик.ИНН", КатегорияОшибка, ТекстОшибки, "Ошибка");
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДокументТитул1.ОрганизацияМедик.НаименованиеОрганизацииПолное) Тогда 
				
				ТекстОшибки = "У организация проводящей медосмотр не заполнено полное наименование";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ДокументТитул1ЛицоМедик.НаименованиеОрганизацииПолное", КатегорияОшибка, ТекстОшибки, "Ошибка");
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если Не ДокументТитул1.ЛицоОформившееПЛ.Наш Тогда 
			
			ТекстОшибки = "Организация оформившая ПЛ и проводящая медосмотр не Наша";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументТитул1ЛицоОформившее", КатегорияОшибка, ТекстОшибки, "Ошибка");
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Водитель
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьВодителя(Объект.Водитель, ТаблицаОшибок,
		КатегорияОшибка,, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02, Объект.Титул1);
		
	// Медик
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьМедика(Объект, ТаблицаОшибок);
		
	// МедЛицензия
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьМедЛицензию(Объект, ТаблицаОшибок);
	
	// Провдение документа основания
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьИнфПол(Знач Объект, ТаблицаОшибок)
	
	СтуктураПроверки = Новый Структура;
	СтуктураПроверки.Вставить("ИнфПол", "");
		
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьИнфПолСИдФайл(Объект, СтуктураПроверки, ТаблицаОшибок);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиКонвертацииДокументов

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	МассивОбязательных.Добавить("МедРаботник");
	МассивОбязательных.Добавить("МедЛицензия");
	МассивОбязательных.Добавить("ДатВрПрМО");
	МассивОбязательных.Добавить("Водитель");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_ПЛ");
	МассивКлючевых.Добавить("Титул1");
	МассивКлючевых.Добавить("Титул2");
	МассивКлючевых.Добавить("ДатФайлИнфМО");
	МассивКлючевых.Добавить("ВрФайлИнфМО");
	МассивКлючевых.Добавить("ИдФайлИнфМО");
	МассивКлючевых.Добавить("ЭППредрейсовыйМО");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфПМО");
	МассивКлючевых.Добавить("ВрИнфПМО");
	
	МассивКлючевых.Добавить("РезультатМедОсмотра");
	
	Возврат МассивКлючевых;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ПЛ_Титул5_5_02.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

#КонецОбласти

#КонецЕсли