#Область ПрограммныйИнтерфейс

// Это расширенная версия ИС МП
// 
// Возвращаемое значение:
//  Булево - Это расширенная версия ИС МП
Функция ЭтоРасширеннаяВерсияГосИС() Экспорт
	
	Возврат ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС();
	
КонецФункции

// Возвращает признак включения режима работы с тестовым контуром ИС МП
//
// Возвращаемое значение:
//  Булево - Истина, если включен режим работы с тестовым контуром ИС МП.
//
Функция РежимРаботыСТестовымКонтуромИСМП() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("РежимРаботыСТестовымКонтуромИСМП");
	
КонецФункции

// Возвращает признак ведения учета маркируемой продукци переданного вида.
// 
// Параметры:
//  ВидМаркируемойПродукции - СправочникСсылка.ВидыПродукцииИС - вид маркируемой продукции
// Возвращаемое значение:
// 	Булево - признак ведения учета маркируемой продукции переданного вида.
//
Функция ВестиУчетМаркируемойПродукции(ВидМаркируемойПродукции = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидМаркируемойПродукции) Тогда
		
		Если ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
			//@skip-check wrong-string-literal-content
			Возврат ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП");
		Иначе
			Возврат ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМПРМК");
		КонецЕсли;
		
	ИначеЕсли ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияИСМП(ВидМаркируемойПродукции, Истина) Тогда
		
		Возврат ОбщегоНазначенияИСМП.ВестиУчетМаркируемойПродукции(ВидМаркируемойПродукции);
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Возвращает настройки сканирования кодов маркировки ИС МП.
//
// Возвращаемое значение:
//  Булево - Истина, в случае необходимости контроля статусов.
Функция НастройкиСканированияКодовМаркировки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("РежимКонтроляСредствамиККТ",      "");
	Результат.Вставить("ПропускатьПроверкуСредствамиККТ", Ложь);
	
	Если ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИС = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИС");
		Если МодульИнтеграцияИС.УпрощеннаяИнтеграцияБЭД() Тогда
			Результат.Вставить("КонтролироватьСтандартнуюВложенность", Истина);
		Иначе
			Результат.Вставить("КонтролироватьСтандартнуюВложенность", Ложь);
		КонецЕсли;
	Иначе
		Результат.Вставить("КонтролироватьСтандартнуюВложенность", Ложь);
	КонецЕсли;
	
	Результат.Вставить("ПропускатьСтрокиСОшибкамиПриЗагрузкеИзТСД", Истина);
	Результат.Вставить("ПроверятьАлфавитКодовМаркировки",           Истина);
	
	Результат.Вставить("ПроверятьСтруктуруКодовМаркировки", Истина);
	
	Результат.Вставить("КоличествоКодовВПакетеДляЗапросаСтатусов", 500);

	Результат.Вставить("СлужебныйШтрихкодПечатиУпаковки", "");
	// Табачная продукция
	Результат.Вставить("ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП",          Истина);
	Результат.Вставить("ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТП", Истина);
	Результат.Вставить("УчитыватьМРЦ",                                                       Истина);
	Результат.Вставить("ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП",          ОбщегоНазначенияИСМПКлиентСервер.ДатаНачалаКонтроляКодовМаркировкиМОТП());
	// Весовая продукция
	Результат.Вставить("ЗапрашиватьКоличествоМерногоТовара", Истина);
	// Частичное выбытие
	Результат.Вставить("ПодбиратьКодыМаркировкиВскрытыхПотребительскихУпаковокПоFIFO", Ложь);

	// Разрешительный режим розничной продажи
	Результат.Вставить("ИспользоватьПроверкуРозничнымМетодомДляОпределенныхТоварныхГрупп", Истина); // устарела, не используется
	Результат.Вставить("ВремяБлокировкиCDNПлощадок",                                       15);     // в минутах
	Результат.Вставить("ВремяОтветаCDNПлощадокПриПробитииЧека",                            1.5);    // в секундах
	Результат.Вставить("ЧастотаОбновленияCDNПлощадок",                                     6);      // в часах
	Результат.Вставить("СрокДействияИдентификатораРазрешительногоРежима",                  300);    // в секундах
	Результат.Вставить("АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата",      Дата(1, 1, 1));
	
	УстановитьПривилегированныйРежим(Истина);
	ЗначениеКонстанты = Константы.НастройкиСканированияКодовМаркировкиИСМП.Получить().Получить();
	Если ТипЗнч(ЗначениеКонстанты) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Результат, ЗначениеКонстанты);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Возвращает учитываемые виды маркируемой продукции.
//  При вызове с параметрами -только находящиеся в тестовом/обязательном периоде эксплуатации.
//
//Параметры:
//   НаДату - Неопределено - все учитываемые
//          - Дата - требуется получение только видов продукции в тестовом/обязательном периоде на указанную дату
//   ТестовыйПериод - Булево - признак тестового периода
//
// Возвращаемое значение:
//   ФиксированныйМассив Из СправочникСсылка.ВидыПродукцииИС - учитываемые виды маркируемой продукции.
//
Функция УчитываемыеВидыМаркируемойПродукции(НаДату = Неопределено, ТестовыйПериод = Ложь) Экспорт
	
	ВидыПродукции = Новый Массив;
	
	ИмяФункциональнойОпцииВестиУчет = "";
	
	Если ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС() Тогда
		ИмяФункциональнойОпцииВестиУчет = "ВестиУчетМаркируемойПродукцииИСМП";
	Иначе
		ИмяФункциональнойОпцииВестиУчет = "ВестиУчетМаркируемойПродукцииИСМПРМК";
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию(ИмяФункциональнойОпцииВестиУчет) Тогда
		
		ВидыПродукцииГИСМТ = КонструкторИСОбщегоНазначенияКлиентСервер.УчитываемыеВидыПродукцииИСМП(Истина);
		
		Для Каждого ВидПродукцииГИСМТ Из ВидыПродукцииГИСМТ Цикл
			
			ДатаНачалаПроизводства = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаПроизводства(ВидПродукцииГИСМТ);
			ДатаНачалаРозничныхПродаж = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаРозничныхПродаж(ВидПродукцииГИСМТ);
			ДатаНачалаОформленияУПДОСУ = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаОформленияУПДОСУ(ВидПродукцииГИСМТ);
			ДатаНачалаОформленияУПДПоштучно = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаОформленияУПДПоштучно(ВидПродукцииГИСМТ);
			
			ДатаВБудущем = '30010101';
			ДатаНачалаПроизводства = ?(ДатаНачалаПроизводства = Неопределено, ДатаВБудущем, ДатаНачалаПроизводства);
			ДатаНачалаРозничныхПродаж = ?(ДатаНачалаРозничныхПродаж = Неопределено, ДатаВБудущем, ДатаНачалаРозничныхПродаж);
			ДатаНачалаОформленияУПДОСУ = ?(ДатаНачалаОформленияУПДОСУ = Неопределено, ДатаВБудущем, ДатаНачалаОформленияУПДОСУ);
			ДатаНачалаОформленияУПДПоштучно = ?(ДатаНачалаОформленияУПДПоштучно = Неопределено, ДатаВБудущем, ДатаНачалаОформленияУПДПоштучно);
			
			Если НаДату = Неопределено Тогда
				ВидыПродукции.Добавить(ВидПродукцииГИСМТ);
			ИначеЕсли ТестовыйПериод = (
				НаДату < Мин(ДатаНачалаПроизводства,
				             ДатаНачалаРозничныхПродаж,
				             ДатаНачалаОформленияУПДОСУ,
				             ДатаНачалаОформленияУПДПоштучно)) Тогда
				ВидыПродукции.Добавить(ВидПродукцииГИСМТ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(ВидыПродукции);
	
КонецФункции

// Возвращает признак, нужно ли писать данные успешных операций сканирования в РС ОперацииПроверкиКМ при настройке
// Проверка кодов маркировки средствами ККТ = Перед пробитием чека
// 
// Возвращаемое значение:
//  Булево - Истина, если установлена нужная версия БПО, есть где хранить логи, Проверка кодов маркировки средствами ККТ = Перед пробитием чека и
//  включена настройка Хранить успешные операции при разрешительном режиме
Функция ХранитьУспешныеОперацииПриПроверкеКМ() Экспорт
	
	Возврат ОбщегоНазначенияИСМППовтИсп.ХранитьУспешныеОперацииПриПроверкеКМ();
	
КонецФункции

// Возвращает ранжированный список локальных модулей "Честный знак" для оффлайн проверки кодов маркировки
//  от наиболее приоритетного до наименее приоритетного
// Параметры:
//  Организация - ОпределяемыйТип.Организация - организация для отправки запроса в ЛМ
//  РабочееМесто - ОпределяемыйТип.РабочиеМестаИС - рабочее место для получения запроса
// 
// Возвращаемое значение:
//  Структура:
//  * СерверныеМодули - Массив из см. КонструкторТаблицыЛокальныхМодулейЧестныйЗнак
//	* КлиентскиеМодули - Массив из см. КонструкторТаблицыЛокальныхМодулейЧестныйЗнак
Функция СортированнаяТаблицаЛокальныхМодулейЧестныйЗнак(Организация, РабочееМесто = Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияИСМП.СортированнаяТаблицаЛокальныхМодулейЧестныйЗнак(Организация, РабочееМесто);
	
КонецФункции

// Настройки основного подключения локальному модулю честный знак по ККТ.
// 
// Параметры:
//  ПодключаемоеОборудованиеККТ - СправочникСсылка.ПодключаемоеОборудование - ссылка на ККТ
// 
// Возвращаемое значение:
//  Структура:
//  * НастроеноПодключение - Булево - Истина, если настроено подключение к ЛМ ЧЗ
//  * Настройки - см. КонструкторПодключенияЛокальногоМодуляЧестныйЗнак
Функция НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоККТ(ПодключаемоеОборудованиеККТ) Экспорт
	
	Возврат ОбщегоНазначенияИСМП.НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоККТ(ПодключаемоеОборудованиеККТ);
	
КонецФункции

// Функция возвращает признак возможности продажи и оборота немаркируемых остатков маркируемой продукции
// Возможность оборота регулируется настройкой даты в рабочем месте Интеграция ИС МП (обувь, одежда, табак...)
//  и текущим законодательством
// 
// Параметры:
//  ВидПродукции - СправочникСсылка.ВидыПродукцииИС - вид маркируемой продукции
//  НаДату       - Неопределено, Дата               - дата контроля
// 
// Возвращаемое значение:
//  Булево - Истина, если разрешен оборот немаркируемых остатков продукции
Функция РазрешенОборотНемаркируемыхОстатковПродукции(ВидПродукции, НаДату = Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияИСМППовтИсп.РазрешенОборотНемаркируемыхОстатковПродукции(ВидПродукции, НаДату);
	
КонецФункции

// Функция возвращает признак необходимости получения КМ в зависимости от вида операции
// Возможность оборота регулируется настройками дат в рабочем месте Интеграция ИС МП (обувь, одежда, табак...)
//  и текущим законодательством
// 
// Параметры:
//  ВидОперации         - ПеречислениеСсылка.ВидыОперацийИСМП - вид операции
//  ВидПродукции        - СправочникСсылка.ВидыПродукцииИС    - вид маркируемой продукции
//  НаДату              - Неопределено, Дата                  - дата контроля
// 
// Возвращаемое значение:
//  Булево - Истина, если для данной операции требуется контролировать наличие марок
Функция ДействуетКонтрольОборотаМарокПоОперации(ВидОперации, ВидПродукции, НаДату = Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияИСМППовтИсп.ДействуетКонтрольПоВидуОперацииИПродукции(ВидОперации, ВидПродукции, НаДату);
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ПолучитьСокращеннуюИнформациюПоКМДлительнаяОперация", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеТоварнойГруппы(ТоварнаяГруппа) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварнаяГруппа, "Код,Имя");
	
КонецФункции

Функция ТоварнаяГруппаПоРеквизиту(ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр(ИмяРеквизита, ЗначениеРеквизита);
	Запрос.Текст = СтрШаблон(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварныеГруппыГИСМТ.Ссылка
	|ИЗ
	|	Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
	|ГДЕ
	|	ТоварныеГруппыГИСМТ.%1 = &%1",
	ИмяРеквизита);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РазрешительныйРежимРозничныхПродаж

// Включает аварийный режим на определенное пользователем время;
// Аварийный режим подразумевает полное отключение запросов к ГИС МТ и розничную продажу
// отслеживаемых товарных групп без проверок разрешительного режима
// 
// Параметры:
//  СрокДействияВЧасах - Число - Срок включения аварийного режима в часах
Процедура ВключитьАварийныйРежимРазрешительнойСистемы(СрокДействияВЧасах) Экспорт
	
	ОбщегоНазначенияИСМП.ВключитьАварийныйРежимРазрешительнойСистемы(СрокДействияВЧасах);
	
КонецПроцедуры

// Отключает действие аварийного режима
// Действие разрешительного режима возобновляется в штатном режиме
//
Процедура ОтключитьАварийныйРежимРазрешительнойСистемы() Экспорт
	
	ОбщегоНазначенияИСМП.ОтключитьАварийныйРежимРазрешительнойСистемы();
	
КонецПроцедуры

// Возвращает признак необходимости обновления списка CDN-площадок
// 
// Возвращаемое значение:
//  Булево - Истина, если все площадки обновлены ранее, чем указанное в настройках количество часов назад
Функция ПроверитьНеобходимостьОбновленияCDNПлощадок() Экспорт
	
	ТекущиеУчитываемыеТГОбязательнойОнлайнПроверки = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииОбязательнойОнлайнПроверкиПередРозничнойПродажейНаДату();
	
	Если ТекущиеУчитываемыеТГОбязательнойОнлайнПроверки.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Истина КАК ЕстьАктуальныеПлощадки
		|ИЗ
		|	РегистрСведений.СостоянияCDNПлощадокИСМП КАК CDNПлощадкиИСМП
		|ГДЕ
		|	ДОБАВИТЬКДАТЕ(CDNПлощадкиИСМП.ДатаОбновленияУниверсальная, ЧАС,
		|		&ВремяОбновленияПлощадок) >= &ТекущаяУниверсальнаяДата";
	
	Запрос.УстановитьПараметр("ВремяОбновленияПлощадок",  ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЧастотаОбновленияCDNПлощадок());
	Запрос.УстановитьПараметр("ТекущаяУниверсальнаяДата", ТекущаяУниверсальнаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// если результат пустой, все площадки просрочены. надо обновить
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

// Возвращает признак действия аварийного режима при розничных продажах
//  Запросы разрешительного режима не выполняются, их результаты не контролируются
// 
// Возвращаемое значение:
//  Булево - Истина, если аварийный режим включен
Функция ДействуетАварийныйРежимДляРозничныхПродаж() Экспорт
	
	НастройкиСканирования = НастройкиСканированияКодовМаркировки();
	ДатаДействияАварийногоРежима = НастройкиСканирования.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата;
	
	Возврат ДатаДействияАварийногоРежима > ТекущаяУниверсальнаяДата();
	
КонецФункции

Функция НачатьПолучениеИдентификаторовЗапросаГИСМТПриРозничнойПродаже(ПараметрыСканирования, ДанныеДляЗапроса, УникальныйИдентификатор) Экспорт
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("УникальныйИдентификатор",          УникальныйИдентификатор);
	ПараметрыПроцедуры.Вставить("ПараметрыСканирования",            ПараметрыСканирования);
	ПараметрыПроцедуры.Вставить("ДанныеДляЗапроса",                 ДанныеДляЗапроса);
	ПараметрыПроцедуры.Вставить("ПараметрыЛогированияЗапросовИСМП", ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Фоновое получение идентификаторов запроса ГИС МТ при розничной продаже'");
	
	Если ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыПроцедуры, ПараметрыВыполнения);
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ОбщегоНазначенияИСМПВызовСервера.ПолучитьСокращеннуюИнформациюПоКМДлительнаяОперация",
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

Процедура ПолучитьСокращеннуюИнформациюПоКМДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	Результат = Новый Соответствие();
	
	СписокДанныхШтрихкодов = Новый Массив;
	
	ПараметрыСканированияЛокальные = ОбщегоНазначения.СкопироватьРекурсивно(Параметры.ПараметрыСканирования, Ложь);
	
	ПараметрыСканированияЛокальные.РазрешеноЗапрашиватьКодМаркировки = Ложь;
	ПараметрыСканированияЛокальные.КэшМаркируемойПродукции           = Неопределено;
	ПараметрыСканированияЛокальные.ВыводитьСообщенияОбОшибках        = Ложь;
	ПараметрыСканированияЛокальные.ИспользуетсяСоответствиеШтрихкодовСтрокДерева = Ложь;
	ПараметрыСканированияЛокальные.ВозможнаЗагрузкаТСД               = Ложь;
	
	ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(Параметры.ПараметрыЛогированияЗапросовИСМП);
	ЛогированиеЗапросовИС.НастроитьПараметрыЛогированияВФоновомЗадании(Параметры.ПараметрыЛогированияЗапросовИСМП);
	ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(Параметры.ПараметрыЛогированияЗапросовИСМП);
	
	КоличествоДанных                = Параметры.ДанныеДляЗапроса.Количество();
	КоличествоОбработано            = 0;
	СоответствиеКодаИндексаЭлемента = Новый Соответствие();
	
	Шаблон = НСтр("ru = 'Обработано %1 из %2 кодов маркировки.'");
	
	Для Каждого ЭлементДанных Из Параметры.ДанныеДляЗапроса Цикл
		
		СтруктураКодаМаркировки = Новый Структура();
		СтруктураКодаМаркировки.Вставить("ПолныйКодМаркировки",          "");
		СтруктураКодаМаркировки.Вставить("НормализованныйКодМаркировки", "");
		СтруктураКодаМаркировки.Вставить("ВидПродукции",                 Справочники.ВидыПродукцииИС.ПустаяСсылка());
		СтруктураКодаМаркировки.Вставить("СоставКодаМаркировки",         Новый Структура);
		СтруктураКодаМаркировки.Вставить("ПредставлениеНоменклатуры",    "");
		
		ЗаполнитьЗначенияСвойств(СтруктураКодаМаркировки, ЭлементДанных);
		
		Если Не ЗначениеЗаполнено(ЭлементДанных.ПолныйКодМаркировки)
			Или Не ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ПродукцияПодлежитОбязательнойОнлайнПроверкеПередРозничнойПродажей(СтруктураКодаМаркировки.ВидПродукции) Тогда
			
			КоличествоОбработано = КоличествоОбработано + 1;
			ТекстПрогресса = СтрШаблон(Шаблон, КоличествоОбработано, КоличествоДанных);
			ДлительныеОперации.СообщитьПрогресс(КоличествоОбработано, ТекстПрогресса);
			
			Продолжить;
			
		КонецЕсли;
		
		СписокДанныхШтрихкодов.Добавить(
			Новый Структура(
				"Штрихкод, Количество, ШтрихкодBase64", 
				ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.Base64ВШтрихкод(ЭлементДанных.ПолныйКодМаркировки), 1, ЭлементДанных.ПолныйКодМаркировки));
				
		СоответствиеКодаИндексаЭлемента.Вставить(ЭлементДанных.ПолныйКодМаркировки, ЭлементДанных.ИндексЭлемента);
		
	КонецЦикла;
	
	ОтсутствуютCDNПлощадки             = Ложь;
	ОтсутствуютУстановленныеЛМЧЗ       = Ложь;
	ТребуетсяАвторизацияИСМПРозница    = Ложь;
	ТребуетсяПроверкаНаТСПИоТ          = Ложь;
	СписокЛокальныхМодулейДляОбработки = Неопределено;
	ПараметрыЗапросаТСПИоТ             = Неопределено;
	
	Если Не СписокДанныхШтрихкодов.Количество() = 0 Тогда
	
		РезультатОбработкиШтрихкодов = ШтрихкодированиеОбщегоНазначенияИС.ОбработатьШтрихкоды(
			СписокДанныхШтрихкодов, ПараметрыСканированияЛокальные, Неопределено, Параметры.УникальныйИдентификатор);
		
		Если РезультатОбработкиШтрихкодов.РезультатыОбработки <> Неопределено Тогда
		
			Для Каждого КлючИЗначение Из РезультатОбработкиШтрихкодов.РезультатыОбработки Цикл
				
				РезультатПроверки = КлючИЗначение.Значение;
				ДанныеПоШтрихкоду = РезультатПроверки.ДанныеШтрихкода;
				
				УникальныйИдентификатор = Новый УникальныйИдентификатор();
				
				ПроверкаСвойств         = Новый Структура();
				ПроверкаСвойств.Вставить("ТребуетсяАвторизацияИСМПРозница",                УникальныйИдентификатор);
				ПроверкаСвойств.Вставить("ОтсутствуютCDNПлощадки",                         УникальныйИдентификатор);
				ПроверкаСвойств.Вставить("ОтсутствуютУстановленныеЛМЧЗ",                   УникальныйИдентификатор);
				ПроверкаСвойств.Вставить("ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ", УникальныйИдентификатор);
				ПроверкаСвойств.Вставить("ПроверкаНаТСПИоТЗавершена",                      УникальныйИдентификатор);
				
				ЗаполнитьЗначенияСвойств(ПроверкаСвойств, РезультатПроверки);
				
				Если ПроверкаСвойств.ТребуетсяАвторизацияИСМПРозница = Истина Тогда
					
					ТребуетсяАвторизацияИСМПРозница = Истина;
					Прервать;
					
				ИначеЕсли ПроверкаСвойств.ОтсутствуютCDNПлощадки = Истина Тогда
					
					ОтсутствуютCDNПлощадки = Истина;
					Прервать;
					
				ИначеЕсли ПроверкаСвойств.ОтсутствуютУстановленныеЛМЧЗ = Истина Тогда
					
					ОтсутствуютУстановленныеЛМЧЗ = Истина;
					Прервать;
					
				ИначеЕсли ПроверкаСвойств.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ = Истина
					И ПроверкаСвойств.ПроверкаНаТСПИоТЗавершена = Ложь Тогда
					
					ТребуетсяПроверкаНаТСПИоТ = Истина;
					ПараметрыЗапросаТСПИоТ    = РезультатПроверки.ДанныеНастройкиТСПИоТ;
					
				КонецЕсли;
				
				Если ДанныеПоШтрихкоду = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ИндексЭлемента = СоответствиеКодаИндексаЭлемента.Получить(ДанныеПоШтрихкоду.ПолныйКодМаркировки);
				
				Если ИндексЭлемента = Неопределено Тогда
					Продолжить;
				КонецЕсли;
			
				Результат.Вставить(ИндексЭлемента, КлючИЗначение.Значение);
				
				КоличествоОбработано = КоличествоОбработано + 1;
				
				ТекстПрогресса = СтрШаблон(Шаблон, КоличествоОбработано, КоличествоДанных);
				ДлительныеОперации.СообщитьПрогресс(КоличествоОбработано, ТекстПрогресса);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если РезультатОбработкиШтрихкодов.ДанныеПоШтрихкодам <> Неопределено Тогда
			СписокЛокальныхМодулейДляОбработки = РезультатОбработкиШтрихкодов.ДанныеПоШтрихкодам.СписокЛокальныхМодулейДляОбработки;
		КонецЕсли;
		
	Иначе
		Результат = Новый Соответствие();
	КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ДанныеИдентификаторов",              Результат);
	ВозвращаемоеЗначение.Вставить("ОтсутствуютCDNПлощадки",             ОтсутствуютCDNПлощадки);
	ВозвращаемоеЗначение.Вставить("ТребуетсяАвторизацияИСМПРозница",    ТребуетсяАвторизацияИСМПРозница);
	ВозвращаемоеЗначение.Вставить("ОтсутствуютУстановленныеЛМЧЗ",       ОтсутствуютУстановленныеЛМЧЗ);
	ВозвращаемоеЗначение.Вставить("СписокЛокальныхМодулейДляОбработки", СписокЛокальныхМодулейДляОбработки);
	ВозвращаемоеЗначение.Вставить("ТребуетсяПроверкаНаТСПИоТ",          ТребуетсяПроверкаНаТСПИоТ);
	ВозвращаемоеЗначение.Вставить("ПараметрыЗапросаТСПИоТ",             ПараметрыЗапросаТСПИоТ);
	
	ЛогированиеЗапросовИСМП.ЗаполнитьВозвращаемыеДанныеФоновогоЗадания(ВозвращаемоеЗначение);
	
	ДлительныеОперации.СообщитьПрогресс(КоличествоДанных, ТекстПрогресса);
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);

КонецПроцедуры

// Запуск в фоне актуализации списка и скорости отклика CDN-площадок
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, от имени которой выполняется запрос к ГИС МТ
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
//  ОбновлятьБезПроверкиДатыОбновления - Булево - если Истина, то запускается процедура обновления списка вне зависимости от даты актуальности
//   В противном случае обновление будет вызвано только если прошел срок актуальности загрузки площадок
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьВФоне.
Функция ЗапуститьОбновлениеCDNПлощадок(Организация, УникальныйИдентификатор = Неопределено, ОбновлятьБезПроверкиДатыОбновления = Ложь) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление CDN-площадок'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Организация",                        Организация);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыЛогированияЗапросовИСМП",   ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП);
	ПараметрыФоновогоЗадания.Вставить("ОбновлятьБезПроверкиДатыОбновления", ОбновлятьБезПроверкиДатыОбновления);
	
	Если ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбщегоНазначенияИСМП.ВыполнитьАктуализациюCDNПлощадокДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Инициализация в фоне конфигураци Локального модуля "Честный знак"
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, от имени которой выполняется запрос к ГИС МТ
//  ПараметрыУстановки - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияЛокальногоМодуляЧЗ
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьВФоне.
Функция ИнициализироватьКонфигурациюЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки, УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Инициализация конфигурации локального модуля ЧЗ'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Организация",                      Организация);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыЛогированияЗапросовИСМП", ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыУстановки",               ПараметрыУстановки);
	
	Если ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбщегоНазначенияИСМП.ВыполнитьИнициализациюКонфигурацииЛокальногоМодуляЧЗДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Получение в фоне статуса Локального модуля "Честный знак"
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, от имени которой выполняется запрос к ГИС МТ
//  ПараметрыУстановки - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияЛокальногоМодуляЧЗ
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьВФоне.
Функция ЗапроситьСтатусЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки, УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Запрос статуса локального модуля ЧЗ'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Организация",                      Организация);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыЛогированияЗапросовИСМП", ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыУстановки",               ПараметрыУстановки);
	
	Если ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбщегоНазначенияИСМП.ВыполнитьЗапросСтатусаЛокальногоМодуляЧЗДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Изменение в фоне пароля администратора Локального модуля "Честный знак"
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, от имени которой выполняется запрос к ГИС МТ
//  ПараметрыУстановки - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияЛокальногоМодуляЧЗ
//  НовыйПароль - Строка - согласно API ЛМ ЧЗ должна отвечать следующим требованиям:
//		Пароль не может содержать пустую строку
//		Длина пароля должна быть не менее 8 символов. 
//		Пароль должен содержать буквы и цифры
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьВФоне.
Функция ИзменитьПарольАдминистратораЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки, НовыйПароль, УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Смена пароля администратора локального модуля ЧЗ'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Организация",                      Организация);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыЛогированияЗапросовИСМП", ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыУстановки",               ПараметрыУстановки);
	ПараметрыФоновогоЗадания.Вставить("НовыйПароль",                      НовыйПароль);
	
	Если ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбщегоНазначенияИСМП.ВыполнитьСменуПароляАдминистрированияЛокальногоМодуляЧЗДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Настройка товарных групп Локального модуля "Честный знак". Финальный этап настройки.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, от имени которой выполняется запрос к ГИС МТ
//  ПараметрыУстановки - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияЛокальногоМодуляЧЗ
//  ПараметрыНастройкиТоварныхГрупп - Соответствие из КлючИЗначение:
//  	Ключ - СправочникСсылка.ВидыПродукцииИС - товарная группа для настройки
//  	Значение - Число - количество дней для выгрузки карточек КИ
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьВФоне.
Функция НастроитьТоварныеГруппыЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки, ПараметрыНастройкиТоварныхГрупп, УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Настройка товарных групп локального модуля ЧЗ'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Организация",                      Организация);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыЛогированияЗапросовИСМП", ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыУстановки",               ПараметрыУстановки);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыНастройкиТоварныхГрупп",  ПараметрыНастройкиТоварныхГрупп);
	
	Если ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбщегоНазначенияИСМП.ВыполнитьНастройкуТоварныхГруппЛокальногоМодуляЧЗДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Проверка конфигурации Локального модуля "Честный знак". Для проверки применения настроек ТГ и готовности к работе
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, от имени которой выполняется запрос к ГИС МТ
//  ПараметрыУстановки - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияЛокальногоМодуляЧЗ
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьВФоне.
Функция ПолучитьКонфигурациюЛокальногоМодуляЧЗ(Организация, ПараметрыУстановки, УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка конфигурации локального модуля ЧЗ'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Организация",                      Организация);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыЛогированияЗапросовИСМП", ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыУстановки",               ПараметрыУстановки);
	
	Если ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбщегоНазначенияИСМП.ВыполнитьПолучениеКонфигурацииЛокальногоМодуляЧЗДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Получение данных настроек ТС ПИоТ по адресу
// 
// Параметры:
//  ПараметрыНастройки - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьВФоне.
Функция ПолучитьДанныеНастройкиТСПИоТ(ПараметрыНастройки, УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка настройки ТС ПИоТ'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("ПараметрыЛогированияЗапросовИСМП", ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыНастройки",               ПараметрыНастройки);
	
	Если ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ОбщегоНазначенияИСМП.ВыполнитьПроверкуНастройкиТСПИоТДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

Функция АрхивироватьДокументы(ДокументыКАрхивированию) Экспорт
	
	Возврат РегистрыСведений.СтатусыДокументовИСМП.Архивировать(ДокументыКАрхивированию);
	
КонецФункции

#КонецОбласти
