#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.КонецПериода = ТекущаяДатаСеанса();
	Объект.НачалоПериода = КонтурЗакупки_СлужебныеКлиентСервер.ДобавитьДней(ТекущаяДатаСеанса(), -7);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьНадписьКоличестваМеток();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ШаблонПоискаПриИзменении(Элемент)
	ШаблонПоискаПриИзмененииНаСервере();
	ОбновитьНадписьКоличестваМеток();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаТекущаяПриИзменении(Элемент)
	Объект.СтраницаТекущая = Мин(Макс(Объект.СтраницаТекущая, 1), Объект.СтраницВсего);
	ПолучитьИзбранныеЗакупкиНаКлиенте(Объект.СтраницаТекущая);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабличнаяЧастьИзбранныеЗакупки
&НаКлиенте
Процедура ТабличнаяЧастьИзбранныеЗакупкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ТабличнаяЧастьИзбранныеЗакупкиСсылкаНаЗагруженный Тогда
		ПоказатьЗначение( , Элемент.ТекущиеДанные.СсылкаНаЗагруженный);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьИзбранныеЗакупкиЗагружатьПриИзменении(Элемент)
	ОбновитьНадписьКнопкиЗагрузитьЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьИзбранныеЗакупкиПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент = Элементы.ТабличнаяЧастьИзбранныеЗакупкиИдентификаторЗакупки Тогда
		Отказ = Истина;
		Если Не Элемент.ТекущиеДанные = Неопределено Тогда
			Если Элемент.ТекущиеДанные.Загружен Тогда
				ПоказатьЗначение( , Элемент.ТекущиеДанные.СсылкаНаЗагруженный);
			Иначе
				ОповещениеОкончанияВопросаОЗагрузке = Новый ОписаниеОповещения("ОповещениеОкончанияВопросаОЗагрузке",
					ЭтаФорма, Элемент.ТекущиеДанные.ИдентификаторЗакупки);
				ПоказатьВопрос(ОповещениеОкончанияВопросаОЗагрузке, СтрШаблон(НСтр(
						"ru = 'Загрузить закупку с идентификатором %1'"), Элемент.ТекущиеДанные.ИдентификаторЗакупки),
					РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет, НСтр("ru = 'Загрузить закупку?'"));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ТабличнаяЧастьИзбранныеЗакупкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа,
	Параметр)
	Отказ = Истина;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НадписьМеткиНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОбновитьМеткиНаСервере();

	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыборМетки", ЭтаФорма);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Метки", Объект.Метки);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	Открытьформу("Обработка.КонтурЗакупки_ПолучениеИзбранныхЗакупок.Форма.ФормаВыбораМеток", ПараметрыФормы, ЭтаФорма,
		, , , ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#Область Пангинация

&НаКлиенте
Процедура НавигацияПоСтраницамПервая(Команда)
	Если Не Объект.СтраницаТекущая = 1 Тогда
		Объект.СтраницаТекущая = 1;
		ПолучитьИзбранныеЗакупкиНаКлиенте(Объект.СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамСледующая(Команда)
	Если Не Объект.СтраницаТекущая = Мин(Объект.СтраницаТекущая + 1, Объект.СтраницВсего) Тогда
		Объект.СтраницаТекущая = Мин(Объект.СтраницаТекущая + 1, Объект.СтраницВсего);
		ПолучитьИзбранныеЗакупкиНаКлиенте(Объект.СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамПредыдущая(Команда)
	Если Не Объект.СтраницаТекущая = Макс(Объект.СтраницаТекущая - 1, 1) Тогда
		Объект.СтраницаТекущая = Макс(Объект.СтраницаТекущая - 1, 1);
		ПолучитьИзбранныеЗакупкиНаКлиенте(Объект.СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамПоследняя(Команда)
	Если Не Объект.СтраницаТекущая = Объект.СтраницВсего Тогда
		Объект.СтраницаТекущая = Объект.СтраницВсего;
		ПолучитьИзбранныеЗакупкиНаКлиенте(Объект.СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ЗагрузитьВыбранныеЗакупки(Команда)
	ЗагрузитьЗакупкиПоСпискуНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныСохранить(Команда)
	ШаблоныСохранитьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьЗакупкиНеЗагруженные(Команда)
	ОтметитьЗакупкиНеЗагруженныеНаСервере();
	ОбновитьНадписьКнопкиЗагрузитьЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьЗакупкиВсе(Команда)
	ОтметитьЗакупкиВсеНаСервере();
	ОбновитьНадписьКнопкиЗагрузитьЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиЗакупкиВсе(Команда)
	СнятьОтметкиЗакупкиВсеНаСервере();
	ОбновитьНадписьКнопкиЗагрузитьЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИзбранныеЗакупки(Команда)
	ПолучитьИзбранныеЗакупкиНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	ДиалогВыбораПериода  = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогВыбораПериода.Период.ДатаНачала = Объект.НачалоПериода;
	ДиалогВыбораПериода.Период.ДатаОкончания = Объект.КонецПериода;
	ОповеститьОВыбореПериода = Новый ОписаниеОповещения("ОкончаниеВыбораПериода", ЭтаФорма);
	ДиалогВыбораПериода.Показать(ОповеститьОВыбореПериода);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

#Область Метки
&НаСервере
Процедура ОбновитьМеткиНаСервере()

	ОбработкаОбновления = Обработки.КонтурЗакупки_ПолучениеМетокИзбранного.Создать();
	ОбработкаОбновления.ПолучитьМеткиИзбранного();

КонецПроцедуры
&НаКлиенте
Процедура ВыборМетки(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если Не РезультатЗакрытия = Неопределено Тогда
		ВыборМеткиНаСервере(РезультатЗакрытия, ДополнительныеПараметры);
		ОбновитьНадписьКоличестваМеток();
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ВыборМеткиНаСервере(РезультатЗакрытия, ДополнительныеПараметры)
	ТЗМеток = РезультатЗакрытия.Выгрузить();
	ТЗМеток.Свернуть("Метка");
	Объект.Метки.Загрузить(ТЗМеток);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьНадписьКоличестваМеток()

	КоличествоВыделенныхМеток = ПолучитьКоличествоМеток();
	НадписьМетки = ?(КоличествоВыделенныхМеток > 0, Лев(СтрШаблон("(%1) %2", КоличествоВыделенныхМеток,
		ПредставлениеМеток()), 140), "все метки");
КонецПроцедуры
&НаСервере
Функция ПолучитьКоличествоМеток()
	Возврат Объект.Метки.Количество();
КонецФункции
&НаСервере
Функция ПредставлениеМеток()

	Результат = "";
	Для Каждого СтрокаТЗ Из Объект.Метки Цикл
		Результат = Результат + СтрокаТЗ.Метка + "; ";
	КонецЦикла;

	Возврат Результат;

КонецФункции
#КонецОбласти
#Область ОбработкиТабличнойЧастиЗакупок
&НаКлиенте
Процедура ОбновитьНадписьКнопкиЗагрузитьЗакупки()
	НадписьГруппыКЗагрузке = "Выбрано: " + ПолучитьКоличествоЗакупокНаЗагрузку();
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоЗакупокНаЗагрузку()

	ОтборПоОтмеченным = Новый Структура("Загружать", Истина);
	МассивНаЗагрузку = Объект.ИзбранныеЗакупки.НайтиСтроки(ОтборПоОтмеченным);

	Возврат МассивНаЗагрузку.Количество();
КонецФункции

&НаКлиенте
Процедура ЗагрузитьЗакупкиПоСпискуНаКлиенте()
	СинхронизацияНаКлиенте = КонтурЗакупки_ПодсистемаНастройкиВызовСервера.ПолучитьЗначениеНастройки("КонтурПодсистема",
		"СинхронизацияНаКлиенте", Ложь);
	Если СинхронизацияНаКлиенте Тогда
		ЗагрузитьЗакупкиПоСпискуНаКлиентеФорма();
	Иначе
		ЗагрузитьЗакупкиПоСпискуНаСервереФорма();
	КонецЕсли;
	ОбновитьНадписьКнопкиЗагрузитьЗакупки();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗакупкиПоСпискуНаСервереФорма()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьЗакупкиПоСписку();
	ОбработкаОбъект.ОбновитьПризнакиЗагрузкиИСсылки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗакупкиПоСпискуНаКлиентеФорма()
	МассивИдентификаторовЗакупок = ПолучитьМассивИдентификаторовЗакупокНаЗагрузкуФорма();
	Для Каждого ИдентификаторЗакупки Из МассивИдентификаторовЗакупок Цикл
		ЗагрузитьЗакупкуПоИдентификаторуНаКлиентеФорма(ИдентификаторЗакупки);
	КонецЦикла;
	ОбновитьПризнакиЗагрузкиИСсылкиФорма();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗакупкуПоИдентификаторуНаКлиентеФорма(ИдентификаторЗакупки)
	СтруктураПараметров = Новый Структура("ИдентификаторЗакупки", ИдентификаторЗакупки);
	ФормаЗагрузки = ПолучитьФорму("Обработка.КонтурЗакупки_ДанныеЗакупки.Форма", СтруктураПараметров, ЭтаФорма);
	ФормаЗагрузки.ПолучитьДанныеНаКлиенте();
	ОбновитьПризнакиЗагрузкиИСсылкиФорма();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПризнакиЗагрузкиИСсылкиФорма()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОбновитьПризнакиЗагрузкиИСсылки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОкончанияВопросаОЗагрузке(РезультатВопроса, ИдентификаторЗакупки) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗагрузитьЗакупкуПоИдентификаторуНаКлиентеФорма(ИдентификаторЗакупки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивИдентификаторовЗакупокНаЗагрузкуФорма()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьМассивИдентификаторовЗакупокНаЗагрузку();
КонецФункции

#КонецОбласти

#Область РаботаСШаблонами
&НаКлиенте
Процедура ШаблоныСохранитьНаКлиенте()
	Если Не ЗначениеЗаполнено(Объект.ШаблонЗагрузки) Тогда
		НазваниеШаблона = "";
		ОповещениеОкончниеВводаНазванияШаблона = Новый ОписаниеОповещения("ОкончниеВводаНазванияШаблона", ЭтаФорма);
		ПоказатьВводСтроки(ОповещениеОкончниеВводаНазванияШаблона, НазваниеШаблона, "Введите название шаблона", 150);
	Иначе
		ШаблоныСохранитьНаСервере();
		//Модифицированность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОкончниеВводаНазванияШаблона(ВведеннаяСтрока, ДополнительныеПараметры) Экспорт
	Если Не ПустаяСтрока(ВведеннаяСтрока) Тогда
		ШаблоныСохранитьНаСервере(ВведеннаяСтрока);
		//Модифицированность = Ложь;
	Иначе
		КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Пустое наименование шаблона.
																	   |Шаблон не сохранен'"));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ШаблоныСохранитьНаСервере(НазваниеШаблона = "")
	Если ЗначениеЗаполнено(Объект.ШаблонЗагрузки) Тогда
		СпрШаблон = Объект.ШаблонЗагрузки.ПолучитьОбъект();
	Иначе
		СпрШаблон = Справочники.КонтурЗакупки_ШаблоныЗагрузкиИзбранного.СоздатьЭлемент();
		СпрШаблон.Наименование = НазваниеШаблона;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(СпрШаблон, Объект);
	СпрШаблон.Метки.Загрузить(Объект.Метки.Выгрузить());
	СпрШаблон.Записать();

	Объект.ШаблонЗагрузки = СпрШаблон.Ссылка;

	ТекущийПользователь = КонтурЗакупки_ЛокализацияВызовСервера.ПолучитьТекущегоПользователя();
	Если Не ТекущийПользователь = Неопределено Тогда
		КонтурЗакупки_ЛокализацияВызовСервера.УстановитьОтветственного(СпрШаблон.Ссылка, ТекущийПользователь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ШаблонПоискаПриИзмененииНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьПоискПоШаблону();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

#КонецОбласти

#Область ОтметкиОЗагрузке

&НаСервере
Процедура ОтметитьЗакупкиНеЗагруженныеНаСервере()
	Для Каждого СтрокаТЧ Из Объект.ИзбранныеЗакупки Цикл
		Если Не СтрокаТЧ.Загружен Тогда
			СтрокаТЧ.Загружать = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура ОтметитьЗакупкиВсеНаСервере()
	Для Каждого СтрокаТЧ Из Объект.ИзбранныеЗакупки Цикл
		СтрокаТЧ.Загружать = Истина;
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура СнятьОтметкиЗакупкиВсеНаСервере()
	Для Каждого СтрокаТЧ Из Объект.ИзбранныеЗакупки Цикл
		СтрокаТЧ.Загружать = Ложь;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ОкончаниеВыбораПериода(ВыбранныйПериод, ДополнительныеПараметры) Экспорт
	Если Не ВыбранныйПериод = Неопределено Тогда
		Объект.НачалоПериода = ВыбранныйПериод.ДатаНачала;
		Объект.КонецПериода = ВыбранныйПериод.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьРезультатаФорма(ДанныеСоответствие)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьТабличнуюЧастьРезультата(ДанныеСоответствие);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПоискаФорма(СтраницаЗначение = 1)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьСтруктуруПоиска(СтраницаЗначение);
КонецФункции

&НаСервере
Процедура ОчиститьТабличнаяЧастьИзбранныеЗакупки()
	Объект.ИзбранныеЗакупки.Очистить();
КонецПроцедуры
&НаКлиенте
Функция ПолучитьИзбранныеЗакупкиНаКлиентеФорма(СтраницаЗначение, ОписаниеРезультата = "")
	Результат = Истина;
	ОчиститьТабличнаяЧастьИзбранныеЗакупки();

	СтруктураПоиска = ПолучитьСтруктуруПоискаФорма(СтраницаЗначение);

	РезультатHTTPЗапроса = КонтурЗакупки_httpЗапросыКлиентСервер.http_ПолучитьИзбранныеЗакупки(СтруктураПоиска);
	Если Не РезультатHTTPЗапроса = Неопределено Тогда
		Если Не РезультатHTTPЗапроса["data"] = Неопределено Тогда
			ДанныеПоиска = РезультатHTTPЗапроса["data"];
			ЗаполнитьТабличнуюЧастьРезультатаФорма(ДанныеПоиска);
		ИначеЕсли Не РезультатHTTPЗапроса["error"] = Неопределено И РезультатHTTPЗапроса["error"] = Истина Тогда
			Результат = Ложь;
			ОписаниеРезультата = ОписаниеРезультата + СтрШаблон(
			НСтр("ru = 'Ошибка: %1'"), РезультатHTTPЗапроса["message"]) + Символы.ПС;
		КонецЕсли;
	Иначе
		Результат = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Ошибка'") + Символы.ПС;
	КонецЕсли;

	Возврат Результат
КонецФункции
&НаКлиенте
Функция ПолучитьИзбранныеЗакупкиНаКлиенте(СтраницаЗначение = 1)
	Результат = Истина;
	ОписаниеРезультата = "";
	Результат = ПолучитьИзбранныеЗакупкиНаКлиентеФорма(СтраницаЗначение, ОписаниеРезультата);

	Если Не Результат Тогда
		КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеРезультата);
	КонецЕсли;

	Возврат Результат;
КонецФункции
#КонецОбласти