#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийОбъекта

// Вызывается из соответствующего обработчика модуля объекта
//
// Параметры:
//  Объект - СправочникОбъект.НаправленияДеятельности - Обрабатываемый объект
//  Отказ - Булево - Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то будет выполнен отказ от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив Из Строка - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	//++ Локализация
	
	//-- Локализация
	
КонецПроцедуры

// Вызывается из соответствующего обработчика модуля объекта
//
// Параметры:
//  Объект - СправочникОбъект.НаправленияДеятельности - Обрабатываемый объект
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	
	//-- Локализация
	
КонецПроцедуры

// Вызывается из соответствующего обработчика модуля объекта
//
// Параметры:
//  Объект - СправочникОбъект.НаправленияДеятельности - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//
Процедура ПередЗаписью(Объект, Отказ) Экспорт
	
	//++ Локализация
	
	//-- Локализация
	
КонецПроцедуры

// Вызывается из соответствующего обработчика модуля объекта
//
// Параметры:
//  Объект - СправочникОбъект.НаправленияДеятельности - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина, то запись выполнена не будет и будет вызвано исключение.
//
Процедура ПриЗаписи(Объект, Отказ) Экспорт
	//++ Локализация
	
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область МетодыМодуляМенеджера

// Дополняет массив блокируемых реквизитов объекта (см. Справочники.НаправленияДеятельности.ПолучитьБлокируемыеРеквизитыОбъекта).
//
// Параметры:
// 	БлокируемыеРеквизиты - Массив Из Строка - Блокируемые реквизиты объекта
//
Процедура ДополнитьБлокируемыеРеквизитыОбъекта(БлокируемыеРеквизиты) Экспорт
	//++ Локализация
	БлокируемыеРеквизиты.Добавить("ИсполнениеГосударственногоКонтракта");
	БлокируемыеРеквизиты.Добавить("ГосударственныйКонтракт");
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Вызывается из соответствующего метода формы объекта
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ПриЧтенииСозданииНаСервере(Форма) Экспорт
	//++ Локализация
	

	//-- Локализация
КонецПроцедуры

// Вызывается из соответствующего обработчика формы объекта
//
// Параметры:
// 	ИмяЭлемента - Строка - Имя элемента управления
// 	Форма - ФормаКлиентскогоПриложения - Форма плана видов характеристик
//
Процедура ПриИзмененииРеквизита(ИмяЭлемента, Форма) Экспорт
	//++ Локализация


	//-- Локализация
КонецПроцедуры

// Вызывается из соответствующего обработчика формы объекта
//
// Параметры:
// 	ИмяКоманды - Строка - Имя команды
// 	Форма - ФормаКлиентскогоПриложения - Форма плана видов характеристик
//
Процедура ВыполнитьКоманду(ИмяКоманды, Форма) Экспорт
	//++ Локализация
	
	//-- Локализация
КонецПроцедуры

#КонецОбласти

// Вызывается из соответствующего обработчика формы элемента
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
Процедура ПриСозданииНаСервереФормаЭлемента(Форма) Экспорт
	//++ Локализация

	//-- Локализация

КонецПроцедуры

// Вызывается из соответствующего обработчика формы элемента
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
// 	ТекущийОбъект - СправочникОбъект.НаправленияДеятельности -
//
Процедура ПриЧтенииНаСервереФормаЭлемента(Форма, ТекущийОбъект) Экспорт
	
	//++ Локализация
	
	
	//-- Локализация

КонецПроцедуры

#КонецОбласти

//++ Локализация

#Область СлужебныеПроцедурыИФункции


#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "НаправленияДеятельностиЛокализация.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.27.26";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c1aa7366-3032-4f5c-a3a8-7a69efc426e7");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "НаправленияДеятельностиЛокализация.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	Обработчик.Комментарий = НСтр("ru = 'Заполняет флаг ""Исполнение государственного контракта""'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Справочники.НаправленияДеятельности.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Справочники.НаправленияДеятельности.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Справочники.НаправленияДеятельности.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = Метаданные.Справочники.НаправленияДеятельности.ПолноеИмя();
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаправленияДеятельности.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НаправленияДеятельности КАК НаправленияДеятельности
	|ГДЕ
	|	НаправленияДеятельности.ГосударственныйКонтракт <> ЗНАЧЕНИЕ(Справочник.ГосударственныеКонтракты.ПустаяСсылка)
	|	И НЕ НаправленияДеятельности.ИсполнениеГосударственногоКонтракта";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	Параметры.ОбработкаЗавершена = Ложь;
	
	ПолноеИмяОбъекта = Метаданные.Справочники.НаправленияДеятельности.ПолноеИмя();
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
			Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ПлохиеДанные = Новый Массив;
	
	Для каждого СтрокаТаблицы Из ОбновляемыеДанные Цикл
		
		ПредставлениеОбъекта = "";
		ПричинаИсключения = Неопределено;
		
		НачатьТранзакцию();
		Попытка
			
			ПричинаИсключения = "Блокировка";
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаТаблицы.Ссылка);
			Блокировка.Заблокировать();
			
			СправочникОбъект = СтрокаТаблицы.Ссылка.ПолучитьОбъект(); // СправочникОбъект.НаправленияДеятельности - 
			
			Если СправочникОбъект = Неопределено Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ПричинаИсключения = "ПлохиеДанные";
			Рекомендация = НСтр("ru = 'Установить флаг ""Исполнение государственного контракта, контракта на банковском и казначейском сопровождении"" вручную.'");
			
			Если ЗначениеЗаполнено(СправочникОбъект.ГосударственныйКонтракт) 
				И Не СправочникОбъект.ИсполнениеГосударственногоКонтракта Тогда
				СправочникОбъект.ИсполнениеГосударственногоКонтракта = Истина;
			КонецЕсли;
			
			ПричинаИсключения = "Запись";
			Если СправочникОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);
			КонецЕсли;
				
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(),СтрокаТаблицы.Ссылка, ПредставлениеОбъекта);
			
			Если ПричинаИсключения = "ПлохиеДанные" Тогда
				ПроблемаСДанными = Новый Структура("СсылкаНаОбъект,Рекомендация,ИнформацияОбОшибке",
					СтрокаТаблицы.Ссылка,
					Рекомендация,
					ИнформацияОбОшибке());
				ПлохиеДанные.Добавить(ПроблемаСДанными);
			ИначеЕсли ПричинаИсключения <> "Блокировка" Тогда
				ЗаписатьПлохиеДанные(ПлохиеДанные, ОбъектовОбработано);
				ВызватьИсключение НСтр("ru = 'Ошибка блокировки при записи элемента справочника ""Направления деятельности"".'");
			КонецЕсли;
			
		КонецПопытки;
	КонецЦикла;
	
	Если ОбъектовОбработано > 0 Тогда
		ЗаписатьПлохиеДанные(ПлохиеДанные, ОбъектовОбработано)
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);

КонецПроцедуры

Процедура ЗаписатьПлохиеДанные(ПлохиеДанные, ОбъектовОбработано)
	Если ОбъектовОбработано > 0 Тогда
		Для Каждого ПроблемаСДанными Из ПлохиеДанные Цикл
			ПредставлениеСсылки = Строка(ПроблемаСДанными.СсылкаНаОбъект);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось заполнить реквизиты ""%1"" по причине:
						|%2.
						|%3'"), 
					ПредставлениеСсылки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ПроблемаСДанными.ИнформацияОбОшибке),
					ПроблемаСДанными.Рекомендация);
			ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(ПроблемаСДанными, ТекстСообщения);
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ПроблемаСДанными.СсылкаНаОбъект);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

//-- Локализация