// Вводит документ КонтурЛогистика на основании документа учетной системы и показывает пользователю
//
// Параметры:
//  ТипЛогистика	- ПеречислениеСсылка.КонтурЛогистика_ТипыЛогистическихДокументов - какой тип логистического документа будем вводить
//  ДокументСсылка	- ДокументСсылка - исходный документ (например РТУ) на базе которого надо подготовить логистический документ
//  Источник		- Управляемая форма - форма, инициировавшая ввод
//
Процедура ВвестиДокументЛогистикаПоДокументу1С(ТипЛогистика, ДокументСсылка, Источник, ДокументыОснования = Неопределено) Экспорт
	
	Если НЕ КонтурЛогистика_ОбработкаДокументовСервер.ПроверкаПроведенияПройдена(ДокументСсылка, ТипЛогистика) Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ должен быть проведен для отражения в Контур.Логистика";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	МассивУжеВведенныхДокументов = КонтурЛогистика_ОбработкаДокументовСервер.УжеВведенныеДокументыЛогистикаПоДокументу1С(ДокументСсылка, ТипЛогистика);

	
	Если МассивУжеВведенныхДокументов.Количество() = 0 Тогда
		
		Разделители = РассчитатьРазделительДокументаУчетнойСистемы(ТипЛогистика, ДокументСсылка);
		
		Если Разделители = Неопределено ИЛИ Разделители.Количество() < 2 Тогда	// можно открыть форму нового	
			
			ДанныеЗаполнения 	= Новый Структура("ДокументОснование, ТипЛогистика", ДокументСсылка, ТипЛогистика);
			
			Если Разделители <> Неопределено И Разделители.Количество() > 0 Тогда
				ДанныеЗаполнения.Вставить("Разделитель", Разделители[0])
			КонецЕсли;
			
			Если ДокументыОснования <> Неопределено Тогда
				ДанныеЗаполнения.Вставить("ДокументыОснования", ДокументыОснования)
			КонецЕсли;
			
			ПараметрыФормы 		= Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ." + КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоТипуЛогистика(ТипЛогистика) + ".ФормаОбъекта",
				ПараметрыФормы,
				,
				Источник,
				"ОбработчикОповеститьОВыполненииКоманды");
		Иначе
			
			МассивДокументовОснований = Новый Массив;
			МассивДокументовОснований.Добавить(ДокументСсылка);
			КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументыПакетно(МассивДокументовОснований, Ложь, ТипЛогистика);
			ОбработчикОповеститьОВыполненииКоманды();
			
		КонецЕсли;
		
	ИначеЕсли МассивУжеВведенныхДокументов.Количество() = 1 Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(МассивУжеВведенныхДокументов[0]);
		
	Иначе // в массиве более 2 документов
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(МассивУжеВведенныхДокументов);
		
	КонецЕсли;
	
КонецПроцедуры

// Вводит документ КонтурЛогистика на основании предыдущего в цепочке титула и показывает пользователю
//
// Параметры:
//  ТипЛогистика	- ПеречислениеСсылка.КонтурЛогистика_ТипыЛогистическихДокументов - какой тип логистического документа будем вводить
//  Предыдущийтитул	- ДокументСсылка - исходный документ титул на базе которого надо подготовить следующий в цепочке логистический документ
//  Источник		- Управляемая форма - форма, инициировавшая ввод
//
Процедура ВвестиДокументЛогистикаИзПредыдущегоТитула(ТипЛогистика, ПредыдущийТитул, Источник = Неопределено, Знач ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда 
		
		ДопПараметры = Новый Структура;
		
		Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2") 
			ИЛИ ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6") Тогда 
			
			// попробовать определить второго водителя и подсунуть его доп параметром, если было несколько в Т1
			
		КонецЕсли;
		
	КонецЕсли;
	
	ГлавныйДок = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоТитулу(ПредыдущийТитул);
	
	МассивУжеВведенныхДокументов = КонтурЛогистика_ОбработкаДокументовСервер.УжеВведенныеДокументыЛогистикаПоГлавномуДокументу(ГлавныйДок, ТипЛогистика, ПредыдущийТитул, ДопПараметры);
	
	Если МассивУжеВведенныхДокументов.Количество() = 0 Тогда
		
		ДанныеЗаполнения 	= Новый Структура("ПредыдущийТитул, ТипЛогистика", ПредыдущийТитул, ТипЛогистика);
		Если ЗначениеЗаполнено(ГлавныйДок) И ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная") Тогда 
			ДанныеЗаполнения.Вставить("ДокументЭТРН", ГлавныйДок);
		КонецЕсли;
		
		Для Каждого ДопПараметр Из ДопПараметры Цикл 
			ДанныеЗаполнения.Вставить(ДопПараметр.Ключ, ДопПараметр.Значение);
		КонецЦикла;
		
		ПараметрыФормы 		= Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
		
		// обработчик подключим только для формы Задач 
		Если ТипЗнч(Источник) = Тип("УправляемаяФорма") 
			И Источник.ИмяФормы = "ОбщаяФорма.КонтурЛогистика_Задачи" Тогда
			КонтекстОбработчика = Источник;
			ИмяОбработчика = "ОбработчикОповеститьОВыполненииКоманды";
			ДанныеЗаполнения.Вставить("СпецСценарий", Источник.СпецСценарий);
		Иначе
			КонтекстОбработчика = Неопределено;
			ИмяОбработчика = Неопределено 
		КонецЕсли;
		
		Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2") Тогда
			
			РазрешитьОтправлятьТ2ДоВодителя = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РазрешитьОтправлятьТ2ДоВодителя");
			ТекСостояниеДО = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьСтатусДО(ГлавныйДок);
			
			Если Не РазрешитьОтправлятьТ2ДоВодителя И ТекСостояниеДО = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеСостоянияДО("r-wait-driver-approve") Тогда
				Сообщить("Ожидается подпись водителя");
				Возврат;
			КонецЕсли;
			
		ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4") Тогда
			
			РазрешитьОтправлятьТ4ДоВодителя = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РазрешитьОтправлятьТ4ДоВодителя");
			ТекСостояниеДО = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьСтатусДО(ГлавныйДок);
			
			Если Не РазрешитьОтправлятьТ4ДоВодителя 
				И (ТекСостояниеДО = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеСостоянияДО("d-wait-driver-approve")
					Или ТекСостояниеДО = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеСостоянияДО("pd-wait-driver-approve")) Тогда
					
				Сообщить("Ожидается подпись водителя");
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗнч(ПредыдущийТитул) <> Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная") Тогда 
			КрайнийНеошибочныйФайл = КонтурЛогистика_ОбработкаДокументовСервер.НайтиКрайнийНеошибочныйФайлДокумента(ПредыдущийТитул);
			Если КрайнийНеошибочныйФайл = Неопределено Тогда
				ТипЛогистикаПредыдущий = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(ПредыдущийТитул);
				КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Невозможно сформировать титул """ + ТипЛогистика + """, так как предыдущий титул """ + ТипЛогистикаПредыдущий + """ не был подписан. Для продолжения процесса дождитесь подписания предыдущего титула.");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Документ." + КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоТипуЛогистика(ТипЛогистика) + ".ФормаОбъекта",
			ПараметрыФормы,
			,
			КонтекстОбработчика,
			ИмяОбработчика);
	
	ИначеЕсли МассивУжеВведенныхДокументов.Количество() = 1 Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(МассивУжеВведенныхДокументов[0]);
		
	Иначе // в массиве более 2 документов
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(МассивУжеВведенныхДокументов);
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет текущий документ КонтурЛогистика на основании документа (ищет предыдущий) в цепочке титула и показывает пользователю
//
// Параметры:
//  ТипЛогистика	- ПеречислениеСсылка.КонтурЛогистика_ТипыЛогистическихДокументов - какой тип логистического документа будем вводить
//  Предыдущийтитул	- ДокументСсылка - исходный документ титул на базе которого надо подготовить следующий в цепочке логистический документ
//  Источник		- Управляемая форма - форма, инициировавшая ввод
//
Процедура ЗаполнитьТекущийДокументЛогистикаИзПредыдущегоТитула(ТекущийДокумент, Источник) Экспорт
	
	КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьТекущийДокументЛогистикаИзПредыдущеготитула(ТекущийДокумент);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОповеститьОбИзмененииДокумента(ТекущийДокумент);
	
КонецПроцедуры

Процедура ВвестиТРНизЗЗ(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ПараметрыВводаДокументов = Новый Структура("МассивДокументов", ПараметрКоманды);
	
	Форма = Неопределено;
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		Форма = ПараметрыВыполненияКоманды.Источник;
	КонецЕсли;
	
	Если ПараметрКоманды.Количество() = 1 Тогда // через форму документа 
		
		ДокументСсылка = ПараметрКоманды[0];
		
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул2") Тогда 
			ДокументСсылка = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(ДокументСсылка, "Титул1");
		КонецЕсли;
		
		СуществующийТитул1ЭТРН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул1ЭТрНпоЗаказЗаявке(ДокументСсылка);
		Если ЗначениеЗаполнено(СуществующийТитул1ЭТРН) Тогда 
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(СуществующийТитул1ЭТРН);
		Иначе
			
			ГОНаш = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(ДокументСсылка, "Грузоотправитель.Наш");
			Если ГОНаш <> Истина Тогда
				КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Для ввода ЭТрН требуется доступ от имени Грузоотправителя (сейчас ГО не наш)");
				Возврат;
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура("Основание", ДокументСсылка);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"Документ.КонтурЛогистика_ТрН_Титул1.Форма.ФормаДокумента", ПараметрыФормы, Форма,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	Иначе // без открытия форм
		
		КонтурЛогистика_ОбработкаДокументовСервер.ВвестиТРНизЗЗПакетно(ПараметрКоманды);
		Оповестить("КонтурЛогистика_ВвестиДокумент");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидимостьНеучитываемыхИФильтраОшибок(ТаблицаДокумента, СкрытьНеучитываемые, ЭлементТаблица, ЭлементПереключателяИтогов) Экспорт
	
	// рассчет итогов по ТЧ
	КоличествоУчитываемых = ТаблицаДокумента.НайтиСтроки(Новый Структура("Учитывать", Истина)).Количество();
	КоличествоВсего = ТаблицаДокумента.Количество();
	
	ЭлементПереключателяИтогов.Видимость = КоличествоВсего <> 0;
	
	Если КоличествоВсего = КоличествоУчитываемых Тогда
		
		ЭлементПереключателяИтогов.Видимость = Ложь;
		ЭлементПереключателяИтогов.Заголовок = " ";// + КоличествоВсего + ?(КоличествоВсего = 1, " груз", " груза(ов)");
		СкрытьНеучитываемые 				 = Ложь;
		ЭлементПереключателяИтогов.Отображение = ОтображениеКнопки.Текст;
		
	Иначе
		
		ЭлементПереключателяИтогов.Видимость = Истина;
		ЭлементПереключателяИтогов.Заголовок = "Учитываемые товары (" + КоличествоУчитываемых + " из " + КоличествоВсего + ")"; // + ?(КоличествоУчитываемых = 1, " учитываемый", " учитываемые") ;
		ЭлементПереключателяИтогов.Отображение = ОтображениеКнопки.КартинкаИТекст;
		
	КонецЕсли;
	
	// формирование отбора строк
	// ВНИМАНИЕ Отбором строк также управляет панель ошибок, поэтому действуем аккуратно
	Если СкрытьНеучитываемые = Истина Тогда
		
		Если ЭлементТаблица.ОтборСтрок = Неопределено Тогда
			
			ЭлементТаблица.ОтборСтрок = Новый ФиксированнаяСтруктура("Учитывать", Истина);
			
		Иначе
			
			ВременнаяСтруктура = Новый Структура(ЭлементТаблица.ОтборСтрок);
			ВременнаяСтруктура.Вставить("Учитывать", Истина);
			ЭлементТаблица.ОтборСтрок = Новый ФиксированнаяСтруктура(ВременнаяСтруктура);
			
		КонецЕсли;
		
	Иначе  // СырьеСкрытьНеподнадзорные = ложь
		
		Если НЕ ЭлементТаблица.ОтборСтрок = Неопределено Тогда
			
			ВременнаяСтруктура = Новый Структура(ЭлементТаблица.ОтборСтрок);
			
			Если ВременнаяСтруктура.Свойство("Учитывать") Тогда 
				ВременнаяСтруктура.Удалить("Учитывать");
				ЭлементТаблица.ОтборСтрок = Новый ФиксированнаяСтруктура(ВременнаяСтруктура);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// видимость и оформление элементов управления отборов
	Если СкрытьНеучитываемые Тогда 
		ЭлементПереключателяИтогов.Картинка = БиблиотекаКартинок.КонтурЛогистика_Вкл_Красный16;
	Иначе
		ЭлементПереключателяИтогов.Картинка = БиблиотекаКартинок.КонтурЛогистика_Выкл16;
	КонецЕсли;
	
КонецПроцедуры

Функция СсылкаВБраузереДиадок(ДокументСсылка) Экспорт
	
	Возврат КонтурЛогистика_ОбработкаДокументовСервер.СсылкаВБраузереДиадок(ДокументСсылка);
	
КонецФункции

Функция СсылкаВБраузереЛогиситка(ДокументСсылка) Экспорт
	
	Возврат КонтурЛогистика_ОбработкаДокументовСервер.СсылкаВБраузереЛогистика(ДокументСсылка);
	
КонецФункции

Функция ПодписатьФайлыОбмена(МассивФайловОбмена) Экспорт
	
	МассивПодписанныхФайловОбмена = КонтурЛогистика_ИнтеграцияДиадокКлиентСервер.ПодписатьФайлыОбмена(МассивФайловОбмена);
			
	Возврат МассивПодписанныхФайловОбмена;
	
КонецФункции

Функция СогласоватьФайлыОбмена(МассивФайловОбмена) Экспорт
	
	Возврат КонтурЛогистика_ИнтеграцияДиадокКлиентСервер.СогласоватьФайлыОбмена(МассивФайловОбмена);
	
КонецФункции

Функция ПодготовленныеКПатчуФайлыОбмена(МассивФайловОбмена) Экспорт
	
	Возврат КонтурЛогистика_ОбработкаДокументовСервер.ПодготовитьКПодписаниюФайлыОбменаПатчем(МассивФайловОбмена); 
	
КонецФункции

Функция ЭтоТитулТрн(ДокТитулСсылка) Экспорт
	
	ТипЗнчОбъекта = ТипЗнч(ДокТитулСсылка);
	
	Если ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул2")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул3")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул4")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул5")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул6")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул7")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул8")
		Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоТитулПЛ(ДокТитулСсылка) Экспорт
	
	ТипЗнчОбъекта = ТипЗнч(ДокТитулСсылка);
	
	Если ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул2")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул3")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул4")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул5")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул6")
		Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоТитулПЛ_5_02(ДокТитулСсылка) Экспорт
	
	ТипЗнчОбъекта = ТипЗнч(ДокТитулСсылка);
	
	Если ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1_5_02")
		Или ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул2_5_02")
		Или ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул3_5_02")
		Или ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул4_5_02")
		Или ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул5_5_02")
		Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоТитулЗЗ(ДокТитулСсылка) Экспорт
	
	ТипЗнчОбъекта = ТипЗнч(ДокТитулСсылка);
	
	Если ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул2")
		Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоТитулДФ(ДокТитулСсылка) Экспорт
	
	ТипЗнчОбъекта = ТипЗнч(ДокТитулСсылка);
	
	Если ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ДФ_Титул1")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ДФ_Титул2")
		Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоТитулЗН(ДокТитулСсылка) Экспорт
	
	ТипЗнчОбъекта = ТипЗнч(ДокТитулСсылка);
	
	Если ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ЗН_Титул1")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ЗН_Титул2")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ЗН_Титул3")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_ЗН_Титул4")
		Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоТитулСВ(ДокТитулСсылка) Экспорт
	
	ТипЗнчОбъекта = ТипЗнч(ДокТитулСсылка);
	
	Если ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_СВ_ТитулГО")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_СВ_ТитулПВ")
		ИЛИ ТипЗнчОбъекта = Тип("ДокументСсылка.КонтурЛогистика_СВ_ТитулГП")
		Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ОбработчикОповеститьОВыполненииКоманды(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт

	Оповестить("КонтурЛогистика_ВвестиДокумент");

КонецПроцедуры

Процедура ИсправитьТитул(ТитулСсылка, ФормаВладельца) Экспорт 
	
	ФайлыКУдалению = Новый Массив;
	
	// Поиск всех файлов
	Если ТипЗнч(ТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1") Тогда
		
		ДокументЭТРН = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			ТитулСсылка, "ДокументЭТРН");
		
		ФайлТитула = КонтурЛогистика_ОбработкаДокументовСервер.НайтиФайлТитулаПоГлавномуДокументу(
			ДокументЭТРН, ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1"));
		
		Если ЗначениеЗаполнено(ФайлТитула) Тогда
			ФайлыКУдалению.Добавить(ФайлТитула);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул3") Тогда
		
		ДокументЭТРН = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			ТитулСсылка, "ДокументЭТРН");
		
		ФайлТитула = КонтурЛогистика_ОбработкаДокументовСервер.НайтиФайлТитулаПоГлавномуДокументу(
			ДокументЭТРН, ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3"));
		
		Если ЗначениеЗаполнено(ФайлТитула) Тогда
			ФайлыКУдалению.Добавить(ФайлТитула);
		КонецЕсли;
		
	Иначе
		
		ФайлыКУдалению = КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьСледующиеФайлыОбмена(ТитулСсылка);
		
	КонецЕсли;
	
	Если ФайлыКУдалению.Количество() Тогда
		
		ПараметрыФормы = Новый Структура("ФайлыКУдалению, Титул", ФайлыКУдалению, ТитулСсылка);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"ОбщаяФорма.КонтурЛогистика_ИсправлениеТитула", ПараметрыФормы, ФормаВладельца, КонтурЛогистика_ОбработкаДокументовКлиент,
			"ИсправитьТитул_Продолжение", ПараметрыФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ВызватьИсключение "Исправление недоступно. Проверьте, есть ли файлы обмена по данной ЭТрН.";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИсправитьТитул_Продолжение(Результат, ДопПараметры) Экспорт 
	
	Если ЗначениеЗаполнено(Результат) Тогда 
	
		Оповестить("КонтурЛогистика_ОбновитьЗадачи");
		
		ИмяТитула = КонтурЛогистика_ОбщегоНазначенияСервер.ПолноеИмяОбъектаПоСсылке(Результат);
				
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			ИмяТитула + ".Форма.ФормаДокумента",
			Новый Структура("Ключ", Результат));
		
	КонецЕсли;

КонецПроцедуры

Функция РассчитатьРазделительДокументаУчетнойСистемы(ТипЛогистика, ДокументОснованиеУчетнойСистемы) Экспорт
	
	Возврат КонтурЛогистика_ОбработкаДокументовСервер.РассчитатьРазделительДокументаУчетнойСистемы(ТипЛогистика, ДокументОснованиеУчетнойСистемы);
	
КонецФункции

Процедура УдалитьДокументыДиадок(ГлавныйДокументИлиТитул, ФормаВладельца) Экспорт 
				
	ПараметрыФормы = Новый Структура("ГлавныйДокументИлиТитул", ГлавныйДокументИлиТитул);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_УдалениеДокументовДиадок",
		ПараметрыФормы,
		ФормаВладельца,
		КонтурЛогистика_ОбработкаДокументовКлиент,
		"ОбработчикУдаленияДокументовДиадок",
		ПараметрыФормы,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
	
КонецПроцедуры

Процедура ОбработчикУдаленияДокументовДиадок(Результат, ДопПараметры) Экспорт 
	
	Оповестить("КонтурЛогистика_ОбновитьЗадачи");

КонецПроцедуры
	
Функция ПолучитьНастройкуКонвертации(ТипЛогистическогоДокумента, ДокументОснованиеУчетнойСистемы = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ТипЛогистическогоДокумента) Тогда 
		НастройкаКонвертации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьНастройкуКонвертации(ТипЛогистическогоДокумента, ДокументОснованиеУчетнойСистемы)
	Иначе
		НастройкаКонвертации = Неопределено;
	КонецЕсли;

	Возврат НастройкаКонвертации;
	
КонецФункции

Процедура ОткрытьНастройкуКонвертации(ТипЛогистическогоДокумента, ДокументОснованиеУчетнойСистемы) Экспорт

	Если (ТипЛогистическогоДокумента = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1")
		Или ТипЛогистическогоДокумента = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1"))
		И ДокументОснованиеУчетнойСистемы = Неопределено Тогда 
		
		НастройкаКонвертации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьНастройкуКонвертацииТ1РучногоВвода(ТипЛогистическогоДокумента);
		
		Если НастройкаКонвертации = Неопределено Тогда // возможно документа основания нет по причине того что это обработка входящего
			НастройкаКонвертации = КонтурЛогистика_ОбработкаДокументовКлиент.ПолучитьНастройкуКонвертации(ТипЛогистическогоДокумента, ДокументОснованиеУчетнойСистемы); 
		КонецЕсли;
		
	Иначе
		НастройкаКонвертации = КонтурЛогистика_ОбработкаДокументовКлиент.ПолучитьНастройкуКонвертации(ТипЛогистическогоДокумента, ДокументОснованиеУчетнойСистемы); 
	КонецЕсли;
		
	Если НастройкаКонвертации <> Неопределено Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(НастройкаКонвертации);
	Иначе
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Не найдена настройка конвертации по: " + ТипЛогистическогоДокумента + " и: " + ДокументОснованиеУчетнойСистемы);
	КонецЕсли;

КонецПроцедуры

Процедура ОткрытьНастройку(ИмяПредопределенного) Экспорт
	
	Настройка 
		= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьНастройку_(ИмяПредопределенного);
	ПараметрыФормы = Новый Структура("Ключ", Настройка);
	ОткрытьФорму("Справочник.КонтурЛогистика_Настройки.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

Процедура ОтказатьсяВПодписи(ТитулСылка, Параметры) Экспорт
	
	Если ТипЗнч(ТитулСылка) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул6") Тогда 
		// недоработочка на стороне порядка обмена - действие не описано
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("В порядке обмена законодательно не описаны действия, если послерейсовый медосмотр не пройден. 
		|Мы ожидаем, что в новой редакции порядка обмена случай будет уточнен.",
																	"Сценарий законодательно не определен");
		Возврат;
	КонецЕсли;
	
	
	Если ТипЗнч(Параметры.Источник) = Тип("УправляемаяФорма") Тогда
		Параметры.Источник.РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	Если ТипЗнч(ТитулСылка) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул5_5_02") Тогда
		
		РезультатВалидации = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьДокумент(ТитулСылка);
		Если РезультатВалидации.КоличествоОшибок > 0  Тогда
			Сообщить("При проверке обнаружены ошибки, подпись невозможна");
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("ТитулСсылка", ТитулСылка);
		ПараметрыОбработчика = Новый Структура("ТитулСсылка, Форма", ТитулСылка, Параметры.Источник);
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ПЛ_Титул5_5_02.Форма.ФормаОтказаВПодписи",
			ПараметрыФормы,,КонтурЛогистика_ОбработкаДокументовКлиент, "ПослеВводаПричиныОтказа", ПараметрыОбработчика);
			
	ИначеЕсли ТипЗнч(ТитулСылка) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул2_5_02")
		Или ТипЗнч(ТитулСылка) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул3_5_02") Тогда
		
		ПараметрыФормированияФайлов = Новый Структура("ЭтоОтказ");
		РезультатВалидации = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьДокумент(ТитулСылка, ПараметрыФормированияФайлов);
		Если РезультатВалидации.КоличествоОшибок > 0  Тогда
			Сообщить("При проверке обнаружены ошибки, подпись невозможна");
			Возврат;
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьВводЗначения_КонтурЛогистика(Неопределено, "Укажите причину отказа в подписи", Тип("Строка"), 
			КонтурЛогистика_ОбработкаДокументовКлиент, "ПослеВводаПричиныОтказа", Новый Структура("ТитулСсылка, Форма", ТитулСылка, Параметры.Источник));
			
	Иначе
				
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьВводЗначения_КонтурЛогистика(
			Неопределено, 
			"Укажите причину отказа в подписи", 
			Тип("Строка"), 
			КонтурЛогистика_ОбработкаДокументовКлиент, 
			"ПослеВводаПричиныОтказа",
			Новый Структура("ТитулСсылка, Форма", ТитулСылка, Параметры.Источник));
			
			
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПослеВводаПричиныОтказа(Результат, ДопПараметры) Экспорт 
	
	Если ЗначениеЗаполнено(Результат) Тогда 
		
		#Если ВебКлиент Тогда
			ПослеВводаПричиныОтказаНаВебКлиенте(Результат, ДопПараметры.ТитулСсылка, ДопПараметры.Форма);	
		#Иначе
			ПослеВводаПричиныОтказаНаКлиенте(Результат, ДопПараметры.ТитулСсылка);	
			
			Если Найти(ДопПараметры.Форма.ИмяФормы, "ФормаДокумента") Тогда 
				ДопПараметры.Форма.Закрыть();
			КонецЕсли;
			
			Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", ДопПараметры.ТитулСсылка);
			Оповестить("КонтурЛогистика_ОбновитьЗадачи");
		#КонецЕсли	
		
	Иначе
		
		ВызватьИсключение "Вы не указали причину отказа";
		
	КонецЕсли;	
	      
КонецПроцедуры

Функция ПолучитьПодробноеОписаниеОшибки(ДокументСсылка) Экспорт
	
	Возврат КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьПодробноеОписаниеОшибки(ДокументСсылка);
	
КонецФункции

Процедура ОпределитьПредыдущийТипЛогистика(ТипЛогистика) Экспорт

	

КонецПроцедуры

Процедура УстановитьСтатус(Документ, Статус, УказатьПользователя = Ложь, ПроверятьПоследовательностьСтатуса = Ложь, СтруктураОшибки = Неопределено) Экспорт
	
	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьСтатус(Документ, Статус, УказатьПользователя, ПроверятьПоследовательностьСтатуса, СтруктураОшибки);
	
КонецПроцедуры

Процедура ПослеВводаПричиныОтказаНаКлиенте(ПричинаОтказа, ТитулСсылка) Экспорт 
	
	// запишем причину отказа
	КонтурЛогистика_ОбработкаДокументовСервер.ЗаписатьПричинуОтказаВТитул(ПричинаОтказа, ТитулСсылка);
	
	МассивДокументовЛогистика = Новый Массив;
	МассивДокументовЛогистика.Добавить(ТитулСсылка);
	
	УточнениеТипаЛогистика = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(ТитулСсылка);
	
	ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика", МассивДокументовЛогистика, УточнениеТипаЛогистика); 
	
	ПараметрыФормированияФайловРеквизиты = Новый Структура;
	ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
	
	МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
	МассивПодписанныхФайловОбмена = КонтурЛогистика_ИнтеграцияДиадокКлиентСервер.ПодписатьФайлыОбмена(МассивФайловОбмена);
	
	// Отправим файлы
	Если ТипЗнч(МассивПодписанныхФайловОбмена) = Тип("Массив")
		И МассивПодписанныхФайловОбмена.Количество() > 0 Тогда
		
		РезультатОтправки = КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлыВДиадок(МассивПодписанныхФайловОбмена);
		Если НЕ РезультатОтправки.Успешно Тогда
			ВызватьИсключение "Проблемы при отправке документов: " + КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатОтправки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Если ВебКлиент Тогда

Процедура ПослеВводаПричиныОтказаНаВебКлиенте(ПричинаОтказа, ТитулСсылка, Форма) Экспорт 
	
	// запишем причину отказа
	КонтурЛогистика_ОбработкаДокументовСервер.ЗаписатьПричинуОтказаВТитул(ПричинаОтказа, ТитулСсылка);
	
	МассивДокументовЛогистика = Новый Массив;
	МассивДокументовЛогистика.Добавить(ТитулСсылка);
	
	УточнениеТипаЛогистика = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(ТитулСсылка);
	
	ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика", МассивДокументовЛогистика, УточнениеТипаЛогистика); 
	
	ПараметрыФормированияФайловРеквизиты = Новый Структура;
	ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
	
	МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивФайловОбмена", МассивФайловОбмена);
	ДополнительныеПараметры.Вставить("ТитулСсылка", ТитулСсылка);
	ДополнительныеПараметры.Вставить("Форма", Форма);
		
	Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСКриптографиейПодключеноОтказ", КонтурЛогистика_ОбработкаДокументовКлиент, ДополнительныеПараметры);	
	НачатьПодключениеРасширенияРаботыСКриптографией(Оповещение);
		
КонецПроцедуры

Процедура РасширениеРаботыСКриптографиейПодключеноОтказ(Подключено, ДополнительныеПараметры) Экспорт
 
	Если НЕ Подключено Тогда
	 
		НачатьУстановкуРасширенияРаботыСКриптографией(Неопределено);
		Возврат;
		  
	КонецЕсли;
	
	ОповещениеПодписатьФайлыЗавершение = Новый ОписаниеОповещения("ПодписатьФайлыЗавершениеОтказ", КонтурЛогистика_ОбработкаДокументовКлиент, ДополнительныеПараметры);
	КонтурЛогистика_ИнтеграцияДиадокКлиент.ПодписатьФайлыОбменаАсинхронно(ДополнительныеПараметры.МассивФайловОбмена, ОповещениеПодписатьФайлыЗавершение);
	
КонецПроцедуры
	
Функция ПодписатьФайлыЗавершениеОтказ(МассивПодписанныхФайловОбмена, ДополнительныеПараметры) Экспорт
	
	// Отправим файлы
	Если ТипЗнч(МассивПодписанныхФайловОбмена) = Тип("Массив")
		И МассивПодписанныхФайловОбмена.Количество() > 0 Тогда
		
		РезультатОтправки = КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлыВДиадок(МассивПодписанныхФайловОбмена);
		Если НЕ РезультатОтправки.Успешно Тогда
			ВызватьИсключение "Проблемы при отправке документов: " + КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатОтправки);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Найти(ДополнительныеПараметры.Форма.ИмяФормы, "ФормаДокумента") Тогда 
		ДополнительныеПараметры.Форма.Закрыть();
	КонецЕсли;
		
	Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", ДополнительныеПараметры.ТитулСсылка);
	Оповестить("КонтурЛогистика_ОбновитьЗадачи");
		
Конецфункции

#КонецЕсли

#Область ВыполнитьДействиеПоУмолчанию

// Процедура - Выполнить текущие требуемые действия
//
// Параметры:
//  ПараметрКоманды				 - 	КонтурЛогистика_<ЛюбойТитул> - массив строго документов-титулов подсистемы
//  ПараметрыВыполненияКоманды	 - Форма - форма из которой вызвана команда
//
Процедура ВыполнитьТекущиеТребуемыеДействия(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		ПараметрыВыполненияКоманды.Источник.РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	Попытка
		МестоВызова = ПараметрыВыполненияКоманды.Источник.ИмяФормы;
	Исключение
		МестоВызова = "";
	КонецПопытки;
	
	Если ПараметрКоманды.Количество() = 0 Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Выделите строки для которых выполнить действие");
		Возврат;
	КонецЕсли;
	
	Для Каждого Документ Из ПараметрКоманды Цикл
		
		ТребуемоеДействие = КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьДействиеПоУмолчаниюДокТитул(Документ);
		
		ТипЛогистика = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(Документ);
		ПараметрыВводаДокументов = Новый Структура("УточнениеТипаЛогистика", ТипЛогистика);
		
		ВыполнитьТребуемоеДействие(ТребуемоеДействие, Документ, ПараметрыВводаДокументов, ТипЛогистика, МестоВызова);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьТребуемоеДействие(Знач ТребуемоеДействие, Знач Документ, Знач ПараметрыВводаДокументов, Знач ТипЛогистика, МестоВызова = "") Экспорт
	
	Перем МассивДокументовЛогистика, МассивПодписанныхФайловОбмена, МассивФайловОбмена;
	
	МассивИз1Документа = Новый Массив;
	
	Если ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный") Тогда
		
		// Проверим права сотрудника
		НовоеТребуемоеДействие = КонтурЛогистика_ОбработкаДокументовСервер.ТребуемоеДействиеРазрешенияРаботыСДокументамиПользователя(
			ТребуемоеДействие, Документ);
		Если ТребуемоеДействие = НовоеТребуемоеДействие Тогда
			МассивИз1Документа.Добавить(Документ);
		Иначе
			ТекстСообщения = "Нет права """ + Строка(ТребуемоеДействие) + """ по документу: " + Строка(Документ);
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
		Если МассивИз1Документа.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
	Иначе
		МассивИз1Документа.Добавить(Документ);
	КонецЕсли;
	
	ПараметрыВводаДокументов.Вставить("МассивДокументов", МассивИз1Документа);
	ПараметрыВводаДокументов.Вставить("Интерактивно");
	
	МассивДокументовПодсистемы = Новый Массив;
	МассивДокументовПодсистемы.Добавить(Документ);
	
	Если ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПродолжитьОформление") Тогда
		
		Состояние("Готовим данные", 20, "создаем документы", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументы(МассивДокументовПодсистемы, ТипЛогистика);
		
		Состояние("Обработка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
		Оповестить("КонтурЛогистика_ВвестиДокумент");
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Переотправить") Тогда
		
		ВыполнитьСценарийПереотправка(МассивИз1Документа, ТипЛогистика);
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьЧерновик")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю") Тогда
		
		ПараметрыФормированияФайловРеквизиты = Новый Структура;
		ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
		Если ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание") Тогда
			ПараметрыФормированияФайловРеквизиты.Вставить("ПередатьНаПодписание");
			
			ИмяСсылкиПоТипу = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьИмяСсылкиПоТипуЛогистики(ТипЛогистика);
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
				"Передача на подписание", "Передать на подписание", МестоВызова, ИмяСсылкиПоТипу);
		ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю") Тогда
			ПараметрыФормированияФайловРеквизиты.Вставить("ПередатьНаСогласованиеВодителю");
			
			ИмяСсылкиПоТипу = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьИмяСсылкиПоТипуЛогистики(ТипЛогистика);
			КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
				"Передача водителю", "Передать водителю", МестоВызова, ИмяСсылкиПоТипу);
		КонецЕсли;
		
		Состояние("Готовим данные", 20, "создаем документы и файлы обмена", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		
		Если ПараметрыВводаДокументов.Свойство("ОтправитьЧерновикПовторно") И ПараметрыВводаДокументов.ОтправитьЧерновикПовторно Тогда
			МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыДляОтправкиЧерновиков(
				ПараметрыВводаДокументов.МассивДокументов, ПараметрыФормированияФайловРеквизиты);
		Иначе
			МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(
				ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
		КонецЕсли;
		
		Состояние("Отправляем документы", 50, "требуется около 3 секунд на 1 документ", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
		КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлы(МассивФайловОбмена);
		
		Если МассивФайловОбмена.Количество() > 0 Тогда 
			Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
			Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
			Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", МассивДокументовПодсистемы);
		Иначе
			Состояние("Неудачная операция", 100, "не  удалось отправить", БиблиотекаКартинок.КонтурЛогистика_Отменить);
		КонецЕсли;
		
	// как организовать отправку в фоне?
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьВФонеЧерновик") Тогда
		
		Состояние("Готовим данные", 20, "создаем документы", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		МассивДокументовЛогистика = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументы(МассивДокументовПодсистемы, ТипЛогистика);
		
		Состояние("Переводим статус готовности", 50, "проверяем документы", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
		КонтурЛогистика_ОбработкаДокументовСервер.ПодготовитьКОтправкеНеподписанные(МассивДокументовЛогистика);
		
		Если МассивДокументовПодсистемы.Количество() = 1 И КонтурЛогистика_ОбработкаДокументовСервер.ДокументУспешноПодготовлен(МассивДокументовПодсистемы[0]) Тогда 
			Состояние("Обработка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
			Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
			Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", МассивДокументовПодсистемы);
		КонецЕсли;
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный") Тогда
		
		РезультатВалидации = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьДокумент(Документ);
		Если РезультатВалидации.КоличествоОшибок > 0  Тогда
			Сообщить("При проверке обнаружены ошибки, подпись невозможна");
			Возврат;
		КонецЕсли;
		
		ПараметрыФормированияФайловРеквизиты = Новый Структура;
		ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
		
		Состояние("Готовим данные", 20, "создаем документы и файлы обмена", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
		
		Состояние("Формируем документы из шаблона", 30, "подготавливаем документ из шаблона", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбменаДокументовИзШаблонов(МассивФайловОбмена);
		
		#Если ВебКлиент Тогда
		
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ПараметрКоманды", МассивДокументовПодсистемы);
			ДополнительныеПараметры.Вставить("МассивФайловОбмена", МассивФайловОбмена);
			ДополнительныеПараметры.Вставить("ДействиеПоУмолч", ТребуемоеДействие);
			
			Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСКриптографиейПодключено", КонтурЛогистика_ОбработкаДокументовКлиент, ДополнительныеПараметры);	
			НачатьПодключениеРасширенияРаботыСКриптографией(Оповещение);	
			
		#Иначе
			
			МассивПодписанныхФайловОбмена = ПодписатьФайлы(МассивФайловОбмена);
			
			Состояние("Отправляем документы", 50, "требуется около 3 секунд на 1 документ", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
			КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлы(МассивПодписанныхФайловОбмена);
			
			Если МассивПодписанныхФайловОбмена.Количество() > 0 Тогда 
				Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
				Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
				Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", МассивДокументовПодсистемы);
			Иначе
				Состояние("Неудачная операция", 100, "не  удалось отправить", БиблиотекаКартинок.КонтурЛогистика_Отменить);
				Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
				Оповестить("КонтурЛогистика_ОбновитьЗадачи");				
			КонецЕсли;
			
		#КонецЕсли
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьВФонеПодписанный") Тогда 
		
		РезультатВалидации = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьДокумент(Документ);
		Если РезультатВалидации.КоличествоОшибок > 0  Тогда
			Сообщить("При проверке обнаружены ошибки, подпись невозможна");
			Возврат;
		КонецЕсли;
		
		ПараметрыФормированияФайловРеквизиты = Новый Структура;
		ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
		
		Состояние("Готовим данные", 20, "создаем документы и подписи", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
		
		Состояние("Формируем документы из шаблона", 30, "подготавливаем документ из шаблона", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбменаДокументовИзШаблонов(МассивФайловОбмена);
		Состояние("Подписываем документы", 50, "изготавливаем подписи", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		
		#Если ВебКлиент Тогда
		
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ПараметрКоманды", МассивДокументовПодсистемы);
			ДополнительныеПараметры.Вставить("МассивФайловОбмена", МассивФайловОбмена);
			ДополнительныеПараметры.Вставить("ДействиеПоУмолч", ТребуемоеДействие);
			
			Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСКриптографиейПодключено", КонтурЛогистика_ОбработкаДокументовКлиент, ДополнительныеПараметры);	
			НачатьПодключениеРасширенияРаботыСКриптографией(Оповещение);
			
		#Иначе
		
			МассивПодписанныхФайловОбмена = ПодписатьФайлы(МассивФайловОбмена);
			
			Если МассивПодписанныхФайловОбмена.Количество() > 0 Тогда 
				Состояние("Завершено", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
				Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", МассивДокументовПодсистемы);
			Иначе
				Состояние("Неудачная операция", 100, "не  удалось сформировать подписанные файлы", БиблиотекаКартинок.КонтурЛогистика_Отменить);
				Оповестить("КонтурЛогистика_ОбновитьЗадачи");
			КонецЕсли;
			Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
			
		#КонецЕсли
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Обработать") Тогда
		
		Состояние("Обрабатываем документы", 20, "Обрабатываем документы", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		
		БылиОшибкиПриКонвертации = Ложь;
		Для каждого Док Из ПараметрыВводаДокументов.МассивДокументов Цикл
			КонтурЛогистика_ОбработкаДокументовСервер.ОбработатьДокументЛогистики(Док, Истина, БылиОшибкиПриКонвертации);	
		КонецЦикла;
		
		Состояние("Обработка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
		Оповестить("КонтурЛогистика_ОбновитьЗадачи");
		
		Если БылиОшибкиПриКонвертации Тогда
			Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");	
		Иначе
			Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", МассивДокументовПодсистемы);			
		КонецЕсли;
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОжиданиеДругогоСотрудника") Тогда
		
		Сообщить("У вас нет прав на выполнение требуемого действия. Ожидаем другого сотрудника.");
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.РаботаЗавершена") Тогда
		
		// NOP
		
	Иначе
		
		Сообщить("Не могу выполнить операцию - в коде не реализован алгоритм обработки требуемого действия " + ТребуемоеДействие + ". Проверьте настройки конвертации.");
		
	КонецЕсли;

	ОповеститьОбИзменении(ТипЗнч(МассивДокументовПодсистемы[0]));

КонецПроцедуры

Процедура ПодготовитьДанныеДляВыполненияСценария(МассивДокументов, ТребуемоеДействие, УточнениеТипаЛогистика) Экспорт

	ДействиеПоУмолч = Неопределено;
			
	Если ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Обработать") Тогда
		
		ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииОтправкиТитулов.ОбработатьВходящий");
		ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика", МассивДокументов, УточнениеТипаЛогистика);
		КонтурЛогистика_ОбработкаДокументовКлиент.ВыполнитьСценарий(ДействиеПоУмолч, МассивДокументов, ПараметрыВводаДокументов, УточнениеТипаЛогистика);
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный") Тогда
		
		ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе");
		ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика", МассивДокументов, УточнениеТипаЛогистика);
		КонтурЛогистика_ОбработкаДокументовКлиент.ВыполнитьСценарий(ДействиеПоУмолч, МассивДокументов, ПараметрыВводаДокументов, УточнениеТипаЛогистика);
		
	ИначеЕсли ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьЧерновик") Тогда
		
		ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииОтправкиТитулов.НеПодписыватьОтправитьВСеансе");
		ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика, ОтправитьЧерновикПовторно", МассивДокументов, УточнениеТипаЛогистика, Истина);
		КонтурЛогистика_ОбработкаДокументовКлиент.ВыполнитьСценарий(ДействиеПоУмолч, МассивДокументов, ПараметрыВводаДокументов, УточнениеТипаЛогистика);
			
	КонецЕсли;
		
КонецПроцедуры

Процедура ВыполнитьСценарий(Знач ДействиеПоУмолч, Знач ПараметрКоманды, Знач ПараметрыВводаДокументов, Знач ТипЛогистика) Экспорт
	
	Перем МассивДокументовЛогистика, МассивПодписанныхФайловОбмена, МассивФайловОбмена;
	
	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда 		
		Возврат
	КонецЕсли;
			
	Если ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииОтправкиТитулов.СоздатьЧерновик") Тогда
		
		Состояние("Готовим данные", 20, "создаем документы", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументы(ПараметрКоманды, ТипЛогистика);
		
		Состояние("Обработка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
		Оповестить("КонтурЛогистика_ВвестиДокумент");
		
	ИначеЕсли ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииОтправкиТитулов.НеПодписыватьОтправитьВСеансе") Тогда
		
		Если ПараметрыВводаДокументов.Свойство("ОтправитьЧерновикПовторно") И ПараметрыВводаДокументов.ОтправитьЧерновикПовторно Тогда
			
			ПараметрыФормированияФайловРеквизиты = Новый Структура;
			ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
						
			Состояние("Готовим данные", 20, "создаем документы и файлы обмена", БиблиотекаКартинок.КонтурЛогистика_Лого16);
			МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыДляОтправкиЧерновиков(ПараметрыВводаДокументов.МассивДокументов, ПараметрыФормированияФайловРеквизиты);
			
			Состояние("Отправляем документы", 50, "требуется около 3 секунд на 1 документ", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
			КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлы(МассивФайловОбмена);
			
			Если МассивФайловОбмена.Количество() > 0 Тогда 
				Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
				Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
				Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", ПараметрКоманды);
			Иначе
				Состояние("Неудачная операция", 100, "не  удалось отправить", БиблиотекаКартинок.КонтурЛогистика_Отменить);
			КонецЕсли;
		
		Иначе
		
			ПараметрыФормированияФайловРеквизиты = Новый Структура;
			ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
			
			Состояние("Готовим данные", 20, "создаем документы и файлы обмена", БиблиотекаКартинок.КонтурЛогистика_Лого16);
			МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
			
			Состояние("Отправляем документы", 50, "требуется около 3 секунд на 1 документ", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
			КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлы(МассивФайловОбмена);
			
			Если МассивФайловОбмена.Количество() > 0 Тогда 
				Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
				Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
				Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", ПараметрКоманды);
			Иначе
				Состояние("Неудачная операция", 100, "не  удалось отправить", БиблиотекаКартинок.КонтурЛогистика_Отменить);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииОтправкиТитулов.НеПодписыватьОтправитьВФоне") Тогда
		
		Состояние("Готовим данные", 20, "создаем документы", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		МассивДокументовЛогистика = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументы(ПараметрКоманды, ТипЛогистика);
		
		Состояние("Переводим статус готовности", 50, "проверяем документы", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
		КонтурЛогистика_ОбработкаДокументовСервер.ПодготовитьКОтправкеНеподписанные(МассивДокументовЛогистика);
		
		Если ПараметрКоманды.Количество() = 1 И КонтурЛогистика_ОбработкаДокументовСервер.ДокументУспешноПодготовлен(ПараметрКоманды[0]) Тогда 
			Состояние("Обработка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
			Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
			Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", ПараметрКоманды);
		КонецЕсли;
		
	ИначеЕсли ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе") Тогда
		
		ПараметрыФормированияФайловРеквизиты = Новый Структура;
		ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
		
		Состояние("Готовим данные", 20, "создаем документы и файлы обмена", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
		
		#Если ВебКлиент Тогда
		
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ПараметрКоманды", ПараметрКоманды);
			ДополнительныеПараметры.Вставить("МассивФайловОбмена", МассивФайловОбмена);
			ДополнительныеПараметры.Вставить("ДействиеПоУмолч", ДействиеПоУмолч);
			
			Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСКриптографиейПодключено", КонтурЛогистика_ОбработкаДокументовКлиент, ДополнительныеПараметры);	
			НачатьПодключениеРасширенияРаботыСКриптографией(Оповещение);	
			
		#Иначе
			
			МассивПодписанныхФайловОбмена = ПодписатьФайлы(МассивФайловОбмена);
			
			Состояние("Отправляем документы", 50, "требуется около 3 секунд на 1 документ", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
			КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлы(МассивПодписанныхФайловОбмена);
			
			Если МассивПодписанныхФайловОбмена.Количество() > 0 Тогда 
				Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
				Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
				Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", ПараметрКоманды);
			Иначе
				Состояние("Неудачная операция", 100, "не  удалось отправить", БиблиотекаКартинок.КонтурЛогистика_Отменить);
			КонецЕсли;
			
		#КонецЕсли
		
	ИначеЕсли ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВФоне") Тогда 
		
		ПараметрыФормированияФайловРеквизиты = Новый Структура;
		ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
		
		Состояние("Готовим данные", 20, "создаем документы и подписи", БиблиотекаКартинок.КонтурЛогистика_Лого16);
		МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
		
		#Если ВебКлиент Тогда
		
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ПараметрКоманды", ПараметрКоманды);
			ДополнительныеПараметры.Вставить("МассивФайловОбмена", МассивФайловОбмена);
			ДополнительныеПараметры.Вставить("ДействиеПоУмолч", ДействиеПоУмолч);
			
			Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСКриптографиейПодключено", КонтурЛогистика_ОбработкаДокументовКлиент, ДополнительныеПараметры);	
			НачатьПодключениеРасширенияРаботыСКриптографией(Оповещение);	
			
		#Иначе
		
			МассивПодписанныхФайловОбмена = ПодписатьФайлы(МассивФайловОбмена);
			
			Состояние("ГотовПереводим статус готовности", 50, "проверяем документы", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
			КонтурЛогистика_ОбработкаДокументовСервер.ПодготовитьКОтправкеПодписанные(МассивПодписанныхФайловОбмена);
			
			Если МассивПодписанныхФайловОбмена.Количество() > 0 Тогда 
				Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
				Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
				Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", ПараметрКоманды);
			Иначе
				Состояние("Неудачная операция", 100, "не  удалось сформировать подписанные файлы", БиблиотекаКартинок.КонтурЛогистика_Отменить);
			КонецЕсли;
			
		#КонецЕсли
		
	ИначеЕсли ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииОтправкиТитулов.ОбработатьВходящий") Тогда
		
		Состояние("Обрабатываем документы", 20, "Обрабатываем документы", БиблиотекаКартинок.КонтурЛогистика_Лого16);
						
		Для каждого Док Из ПараметрыВводаДокументов.МассивДокументов Цикл
			КонтурЛогистика_ОбработкаДокументовСервер.ОбработатьДокументЛогистики(Док, Истина);	
		КонецЦикла;
		
		Состояние("Обработка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
		Оповестить("КонтурЛогистика_ОбновитьЗадачи");
		
	Иначе
		
		Сообщить("Не могу выполнить операцию - не знаю действие по умолчанию. Проверьте настройки конвертации.");
		
	КонецЕсли;

	ОповеститьОбИзменении(ТипЗнч(ПараметрКоманды[0]));

КонецПроцедуры

Процедура РасширениеРаботыСКриптографиейПодключено(Подключено, ДополнительныеПараметры) Экспорт
 
	Если НЕ Подключено Тогда
	 
		НачатьУстановкуРасширенияРаботыСКриптографией(Неопределено);
		Возврат;
		  
	КонецЕсли;
	
	ОповещениеПодписатьФайлыЗавершение = Новый ОписаниеОповещения("ПодписатьФайлыЗавершение", КонтурЛогистика_ОбработкаДокументовКлиент, ДополнительныеПараметры);
	
	Состояние("Подписываем документы", 60, "создаем файлы обмена", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);	
	КонтурЛогистика_ИнтеграцияДиадокКлиент.ПодписатьФайлыОбменаАсинхронно(ДополнительныеПараметры.МассивФайловОбмена, ОповещениеПодписатьФайлыЗавершение);
	
КонецПроцедуры
	
Функция ПодписатьФайлыЗавершение(МассивПодписанныхФайловОбмена, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе")
		Или ДополнительныеПараметры.ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный") Тогда
		
		Состояние("Отправляем документы", 50, "требуется около 3 секунд на 1 документ", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
		КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлы(МассивПодписанныхФайловОбмена);
		
		Если МассивПодписанныхФайловОбмена.Количество() > 0 Тогда 
			Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
			Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
			Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", ДополнительныеПараметры.ПараметрКоманды);
		Иначе
			Состояние("Неудачная операция", 100, "не  удалось отправить", БиблиотекаКартинок.КонтурЛогистика_Отменить);
		КонецЕсли;
			
	ИначеЕсли ДополнительныеПараметры.ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВФоне")
		Или ДополнительныеПараметры.ДействиеПоУмолч = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьВФонеПодписанный") Тогда
		
		Состояние("ГотовПереводим статус готовности", 50, "проверяем документы", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
		КонтурЛогистика_ОбработкаДокументовСервер.ПодготовитьКОтправкеПодписанные(МассивПодписанныхФайловОбмена);
		
		Если МассивПодписанныхФайловОбмена.Количество() > 0 Тогда 
			Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
			Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
			Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", ДополнительныеПараметры.ПараметрКоманды);
		Иначе
			Состояние("Неудачная операция", 100, "не  удалось сформировать подписанные файлы", БиблиотекаКартинок.КонтурЛогистика_Отменить);
		КонецЕсли;
		
	КонецЕсли;
	
Конецфункции

Процедура ВыполнитьСценарийПереотправка(Знач МассивТитулов, ТипЛогистика)
	
	Если Не ЗначениеЗаполнено(МассивТитулов) Тогда 		
		Возврат
	КонецЕсли;
	
	Состояние("Готовим данные", 20, "создаем документы", БиблиотекаКартинок.КонтурЛогистика_Лого16);
	МассивВведенных = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументыПереотправка(МассивТитулов, ТипЛогистика);
	
	Состояние("Обработка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
		
	ОповеститьОбИзменении(ТипЗнч(МассивТитулов[0]));

	Если МассивВведенных.Количество() = 1 Тогда 
		
		Оповестить("КонтурЛогистика_ОбновитьОткрытыеТитулы");
		Оповестить("КонтурЛогистика_ЗакрытьФормыТитулов", МассивТитулов);
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(МассивВведенных[0]);		
	
	КонецЕсли;	
	
КонецПроцедуры
	
Функция ПодписатьФайлы(МассивФайловОбмена)
		
	Состояние("Подписываем документы", 60, "создаем файлы обмена", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
	
	МассивПодписанныхФайловОбмена = КонтурЛогистика_ОбработкаДокументовКлиент.ПодписатьФайлыОбмена(МассивФайловОбмена);
	
	Возврат МассивПодписанныхФайловОбмена;

КонецФункции

#КонецОбласти