#Область СлужебныйПрограммныйИнтерфейс

#Область ЭлементыКонструктораВидовПродукции

// Функция проверяет, доступно ли поле "Страна производства" для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - доступность поля "Страна производства" для указанного вида продукции 
Функция ДоступноПолеСтранаПроизводства(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСтранаПроизводства"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));

КонецФункции

// Функция проверяет, доступно ли поле "Цвет" для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - доступность поля "Цвет" для указанного вида продукции 
Функция ДоступноПолеЦвет(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеЦвет"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));

КонецФункции

// Функция проверяет, доступно ли поле "Размер" для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - доступность поля "Размер" для указанного вида продукции 
Функция ДоступноПолеРазмер(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеРазмер"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));

КонецФункции

// Функция проверяет, доступно ли поле "Размер" для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - доступность поля "Размер" для указанного вида продукции 
Функция ДоступноПолеСертификация(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСертификация"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа),
		ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.Перемаркировка"));

КонецФункции

// Функция возвращает доступные причины перемаркировки для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Массив из ОпределяемыйТип.ЗначениеЭлементаКонструктораВидовПродукцииИС - значение. 
Функция ДопустимыеПричиныПеремаркировкиКодовМаркировки(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПричиныПеремаркировкиКодовМаркировки"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));

КонецФункции

// Функция проверяет, доступность операции блокировки кодов маркировки для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - доступность блокировки кодов маркировки для указанного вида продукции 
Функция ДоступнаБлокировкаКодовМаркировки(ВидПродукцииТоварнаяГруппа) Экспорт

	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.БлокировкаКодовМаркировки"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));

КонецФункции

// Определяет допустимый способ ввода в оборот при перемаркировке
//
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.КлючиВидовПродукцииИС,
//                               СправочникСсылка.ВидыПродукцииИС,
//                               Массив из СправочникСсылка.ВидыПродукцииИС - Виды продукции,
//                               СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа.
// Возвращаемое значение:
//  ПеречислениеСсылка.СпособыВводаВОборотСУЗ - способ ввода в оборот.
Функция СпособВводаВОборотПриПеремаркировке(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Результат = Неопределено;
	
	Способы = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.СпособВводаВОборотПриПеремаркировке"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
	Если Способы.Количество() > 0 Тогда
		Результат = Способы[0];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти