Функция ВыполнитьHTTPЗапросКШине(Адрес,Тело=Неопределено,Идентификация=Истина) Экспорт
	
	ДанныеПодключенияКШине=ш_РаботаСШинойПовтИсп.ПолучитьПараметрыШины();
	
	HTTPСоединение = Новый HTTPСоединение(ДанныеПодключенияКШине.СтруктураURL.Хост, ДанныеПодключенияКШине.Порт, ДанныеПодключенияКШине.ИмяПользователя, ДанныеПодключенияКШине.Пароль,,,); 
	
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json;charset=utf-8");
	ЗаголовокЗапросаHTTP.Вставить("auth", ?(ДанныеПодключенияКШине.ИД="",1,ДанныеПодключенияКШине.ИД));
	
	HTTPЗапрос = Новый HTTPЗапрос(ДанныеПодключенияКШине.СтруктураURL.ПутьНаСервере+"/"+Адрес, ЗаголовокЗапросаHTTP);

	Попытка
		HTTPЗапрос.УстановитьТелоИзСтроки(Тело,КодировкаТекста.UTF8);
		Если Тело=Неопределено Тогда
			Результат = HTTPСоединение.Получить(HTTPЗапрос);
		Иначе
			Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		КонецЕсли;
	Исключение
		ш_РаботаСшинойДанныхСервер.ЗаписатьОшибкуВЛог(Адрес,"",,ш_РаботаСшинойДанныхСервер.СформироватьОписаниеОшибки(ИнформацияОбОшибке()));
		Возврат Новый HTTPСервисОтвет;
	КонецПопытки;
	
	Если Результат.КодСостояния=555 ИЛИ Результат.КодСостояния=554 И Идентификация Тогда
		АвторизоватьсяВШине();
		Возврат ВыполнитьHTTPЗапросКШине(Адрес,Тело,Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция АвторизоватьсяВШине()
	
	Ответ=ш_РаботаСшинойДанныхСервер.ПолучитьСтруктуруОтвета();
	
	ДанныеПодключенияКШине=ш_РаботаСШинойПовтИсп.ПолучитьПараметрыШины();
	ТелоЗапроса=ш_РаботаСшинойДанныхСервер.ЗаписатьОбъектВJSON(Новый Структура("user,password",ДанныеПодключенияКШине.ИмяПользователяСистемы,ДанныеПодключенияКШине.ПарольПользователяСистемы));
	Результат=ВыполнитьHTTPЗапросКШине("Auth",ТелоЗапроса,Ложь);
	
	Если Результат.КодСостояния=200 Тогда
		
		Данные=ш_РаботаСшинойДанныхСервер.ПолучитьОбъектИзJSON(Результат.ПолучитьТелоКакСтроку());
		Ответ.Результат=Истина;
		Ответ.Данные=Данные.id;
		
		Если НЕ ДанныеПодключенияКШине.ИД=Данные.id Тогда
			ДанныеПодключенияКШине.ИД=Данные.id;
			ДанныеПодключенияКШинеВБазе=ЗначениеИзСтрокиВнутр(Константы.ш_ПараметрыПодключенияКШине.Получить());
			ДанныеПодключенияКШинеВБазе.ИД=Данные.id;
			Константы.ш_ПараметрыПодключенияКШине.Установить(ЗначениеВСтрокуВнутр(ДанныеПодключенияКШинеВБазе));
		КонецЕсли;
		
		Возврат Ответ;
		
	Иначе
		ш_РаботаСшинойДанныхСервер.ЗаписатьОшибкуВЛог("Auth",ТелоЗапроса,Результат.КодСостояния,Результат.ПолучитьТелоКакСтроку());
		Возврат ш_РаботаСшинойДанныхСервер.СформироватьОшибкуДляВозврата(Ответ,Результат.КодСостояния,Результат.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
КонецФункции

Функция ОбновитьСписокСистемИзШины() Экспорт
	
	Ответ=ш_РаботаСшинойДанныхСервер.ПолучитьСтруктуруОтвета();
	Результат=ВыполнитьHTTPЗапросКШине("getSystems");
	
	Если Результат.КодСостояния=200 Тогда
		
		Данные=ш_РаботаСшинойДанныхСервер.ПолучитьОбъектИзJSON(Результат.ПолучитьТелоКакСтроку());
		Ответ.Результат=Истина;
		Ответ.Данные=Данные;
		
		Возврат Ответ;
		
	Иначе
		ш_РаботаСшинойДанныхСервер.ЗаписатьОшибкуВЛог("getSystems","",Результат.КодСостояния,Результат.ПолучитьТелоКакСтроку());
		Возврат ш_РаботаСшинойДанныхСервер.СформироватьОшибкуДляВозврата(Ответ,Результат.КодСостояния,Результат.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
КонецФункции

Функция ОтправитьПакетыВШину(Пакет) Экспорт
	
	Ответ=ш_РаботаСшинойДанныхСервер.ПолучитьСтруктуруОтвета();
	
	Если ТипЗнч(Пакет)=Тип("Структура") Тогда
		МассивПакетов=Новый Массив;
		МассивПакетов.Добавить(Пакет);
	ИначеЕсли ТипЗнч(Пакет)=Тип("Массив") Тогда
		МассивПакетов=Пакет;
	Иначе
		Возврат ш_РаботаСшинойДанныхСервер.СформироватьОшибкуДляВозврата(Ответ,1,"Неизвестный параметр");
	КонецЕсли;
	
	Результат=ВыполнитьHTTPЗапросКШине("sendData",ш_РаботаСшинойДанныхСервер.ЗаписатьОбъектВJSON(МассивПакетов));
	
	Если Результат.КодСостояния=200 Тогда
		
		Данные=ш_РаботаСшинойДанныхСервер.ПолучитьОбъектИзJSON(Результат.ПолучитьТелоКакСтроку());
		Ответ.Результат=Истина;
		Ответ.Данные=Данные;
		
		Возврат Ответ;
		
	Иначе
		ш_РаботаСшинойДанныхСервер.ЗаписатьОшибкуВЛог("sendData","",Результат.КодСостояния,Результат.ПолучитьТелоКакСтроку());
		Возврат ш_РаботаСшинойДанныхСервер.СформироватьОшибкуДляВозврата(Ответ,Результат.КодСостояния,Результат.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПакетыИзШины() Экспорт
	
	Ответ=ш_РаботаСшинойДанныхСервер.ПолучитьСтруктуруОтвета();
	
	Результат=ВыполнитьHTTPЗапросКШине("getData");
	
	Если Результат.КодСостояния=200 Тогда
		
		Данные=ш_РаботаСшинойДанныхСервер.ПолучитьОбъектИзJSON(Результат.ПолучитьТелоКакСтроку());
		Ответ.Результат=Истина;
		Ответ.Данные=Данные;
		
		Возврат Ответ;
		
	Иначе
		ш_РаботаСшинойДанныхСервер.ЗаписатьОшибкуВЛог("getData","",Результат.КодСостояния,Результат.ПолучитьТелоКакСтроку());
		Возврат ш_РаботаСшинойДанныхСервер.СформироватьОшибкуДляВозврата(Ответ,Результат.КодСостояния,Результат.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
КонецФункции

Функция ОтправитьПодтверждениеПолученияДанных(МассивИД) Экспорт
	
	Ответ=ш_РаботаСшинойДанныхСервер.ПолучитьСтруктуруОтвета();
	
	Результат=ВыполнитьHTTPЗапросКШине("sendTicket",ш_РаботаСшинойДанныхСервер.ЗаписатьОбъектВJSON(Новый Структура("id",МассивИД)));
	
	Если Результат.КодСостояния=200 Тогда
		
		Ответ.Результат=Истина;
		Возврат Ответ;
		
	Иначе
		ш_РаботаСшинойДанныхСервер.ЗаписатьОшибкуВЛог("getData","",Результат.КодСостояния,Результат.ПолучитьТелоКакСтроку());
		Возврат ш_РаботаСшинойДанныхСервер.СформироватьОшибкуДляВозврата(Ответ,Результат.КодСостояния,Результат.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
КонецФункции

