#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Возврат;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроверитьНаДубли(Отказ);
	
	ХешСуммаТекущегоСостояния = ХешСуммаТекущегоСостояния();
	
	Если ХешСуммаТекущегоСостояния <> ХешСумма Тогда
		ХешСумма = ХешСуммаТекущегоСостояния;
	КонецЕсли;
	
	Если ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Архивный                   = Неопределено;
	Идентификатор              = Неопределено;
	Код                        = Неопределено;
	ХешСуммаПоставляемыхДанных = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаДубли(Отказ)
	
	Если Не ИспользоватьПоУмолчанию Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",         Ссылка);
	Запрос.УстановитьПараметр("ТоварнаяГруппа", ТоварнаяГруппа);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныКодовМаркировки.Ссылка
	|ИЗ
	|	Справочник.ШаблоныКодовМаркировкиСУЗ КАК ШаблоныКодовМаркировки
	|ГДЕ
	|	ШаблоныКодовМаркировки.Ссылка <> &Ссылка
	|	И ШаблоныКодовМаркировки.ТоварнаяГруппа = &ТоварнаяГруппа
	|	И ШаблоныКодовМаркировки.ИспользоватьПоУмолчанию
	|	И (ШаблоныКодовМаркировки.ТипКодаМаркировки = Значение(Перечисление.ТипыКодовМаркировкиИСМП.ЕдиницаТовара)
	|		ИЛИ ШаблоныКодовМаркировки.ТипКодаМаркировки = Значение(Перечисление.ТипыКодовМаркировкиИСМП.Комплект))";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			НСтр("ru = 'Для товарной группы <%1> уже назначен шаблон <%2> используемый по умолчанию.'"),
			ТоварнаяГруппа,
			Выборка.Ссылка));
	КонецЕсли;
	
КонецПроцедуры

Функция ХешСуммаТекущегоСостояния()

	ДанныеДляРасчета = Новый СписокЗначений();
	
	ДанныеДляРасчета.Добавить(Наименование);
	ДанныеДляРасчета.Добавить(Код);
	ДанныеДляРасчета.Добавить(ТоварнаяГруппа);
	ДанныеДляРасчета.Добавить(ТипШтрихкода);
	ДанныеДляРасчета.Добавить(ДлинаСерийногоНомера);
	ДанныеДляРасчета.Добавить(Архивный);
	ДанныеДляРасчета.Добавить(ИспользоватьПоУмолчанию);
	ДанныеДляРасчета.Добавить(Статус);
		
	Для каждого ЭлементСостава Из ШаблоныРазбораКодовМаркировки Цикл
		СтрокаШаблонов = Новый Массив;
		СтрокаШаблонов.Вставить(0, ЭлементСостава.ШаблонРазбораКодовМаркировки);
		СтрокаШаблонов.Вставить(1, ЭлементСостава.Импорт);
		
		ХешСуммаСтрокиСостава = ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрСоединить(СтрокаШаблонов));
		ДанныеДляРасчета.Добавить(ХешСуммаСтрокиСостава);
		
	КонецЦикла;
	
	ДанныеДляРасчета.СортироватьПоЗначению();
	
	СтрокаДляРасчетаХеша = СтрСоединить(ДанныеДляРасчета.ВыгрузитьЗначения());

	Возврат ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрокаДляРасчетаХеша);
	
КонецФункции

#КонецОбласти

#КонецЕсли