#Область ПрограммныйИнтерфейс

// Это модуль-маршрутизатор. Здесь не нужно писать обработчики.
// Пишите обработчики в обработке КонтурЗакупки_ПодключаемыйМодуль (она может быть сохранена как внешняя)
// Маршрутизирует вызов, возвращает результат работы ПМ
// (Результат необязателен, результатом может быть ИЗМЕНЕНИЕ параметров)
// 
// Параметры:
//  ИмяСобытия - Строка - Название события для понимания места его возникновения и назначения
//  ПараметрыПодключаемогоМодуля - Произвольный - Передаются параметры для работы конкретного события
// (можно изменять значенияэтиз паратмеров в ПМ)
//  СтандартнаяОбработка - Булево - В ряде событий предоставляет возможность отказаться от
// типового поведения системы после выполнения события
// 
// Возвращаемое значение:
//  Произвольный - результат выполнения ПМ
Функция ОбработкаСобытияПодключаемогоМодуля(ИмяСобытия, ПараметрыПодключаемогоМодуля = Неопределено,
	СтандартнаяОбработка = Истина) Экспорт

	ПодключаемыйМодуль = КонтурЗакупки_ПодключаемыйМодульПовтИсп.ПодключаемыйМодуль();

	Если Не ПодключаемыйМодуль = Неопределено Тогда

		Попытка
			РезультатРаботыПМ = ПодключаемыйМодуль.ОбработатьСобытиеКонтурЗакупки(ИмяСобытия,
				ПараметрыПодключаемогоМодуля, СтандартнаяОбработка);
		Исключение
			СтрокаОшибки = ОписаниеОшибки();

			СтруктураДействия = КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьОписаниеДействия("PM", "Вызов функции ПМ",
				ИмяСобытия, "");
			СтруктураКлиентаДляМетрики = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьСтруктуруКлиентаДляМетрики();

			СтруктураДляОтправкиОшибки = КонтурЗакупки_МетрикиВызовСервера.ПолучитьСтруктуруОшибки(
		СтруктураДействия, СтрокаОшибки, СтруктураКлиентаДляМетрики);
			КонтурЗакупки_МетрикиВызовСервера.ОтправитьМетрику(СтруктураДляОтправкиОшибки);
			ВызватьИсключение СтрокаОшибки;
		КонецПопытки;

	Иначе
		РезультатРаботыПМ = Неопределено;
	КонецЕсли;

	Возврат РезультатРаботыПМ;

КонецФункции
#КонецОбласти