Функция СтавкаНДСПоПредставлению(Представление) Экспорт 
	
	Если Представление = "0%" Тогда 
		СтавкаНДС = НДС0;
	ИначеЕсли Представление = "10%" Тогда	
		СтавкаНДС = НДС10;
	ИначеЕсли Представление = "20%" Тогда	
		СтавкаНДС = НДС20;
	ИначеЕсли Представление = "10/110" Тогда	
		СтавкаНДС = НДС10_110;
	ИначеЕсли Представление = "20/120" Тогда	
		СтавкаНДС = НДС20_120;
	ИначеЕсли Представление = "без НДС" Тогда	
		СтавкаНДС = БезНДС;
	ИначеЕсли Представление = "НДС исчисляется налоговым агентом" Тогда	
		СтавкаНДС = "НДСИсчисляетсяНалоговымАгентом";
	// новые ставки c 2025	
	ИначеЕсли Представление = "5%" Тогда	
		СтавкаНДС = НДС5;
	ИначеЕсли Представление = "7%" Тогда	
		СтавкаНДС = НДС7;
	ИначеЕсли Представление = "22%" Тогда	
		СтавкаНДС = НДС22;
	ИначеЕсли Представление = "5/105" Тогда	
		СтавкаНДС = НДС5_105;
	ИначеЕсли Представление = "7/107" Тогда	
		СтавкаНДС = НДС7_107;
	ИначеЕсли Представление = "22/122" Тогда	
		СтавкаНДС = НДС22_122;
	ИначеЕсли Представление = "9,09%" Тогда	
		СтавкаНДС = НДС9_09;
	ИначеЕсли Представление = "16,67%" Тогда	
		СтавкаНДС = НДС16_67;
	ИначеЕсли Представление = "18,03%" Тогда	
		СтавкаНДС = НДС18_03;
		
	Иначе
		ВызватьИсключение "Не смог определить ставку НДС по переданному представлению.";
	КонецЕсли;
	
	Возврат СтавкаНДС;
		
КонецФункции

Функция ПредставлениеСтавкиНДСПоЗначению(Значение) Экспорт 
	
	Если Значение = НДС0 Тогда 
		Представление = "0%";
	ИначеЕсли Значение = НДС10 Тогда	
		Представление = "10%";
	ИначеЕсли Значение = НДС20 Тогда	
		Представление = "20%";
	ИначеЕсли Значение = НДС10_110 Тогда
		Представление = "10/110"
	ИначеЕсли Значение = НДС20_120 Тогда
		Представление = "20/120"
	ИначеЕсли Значение = БезНДС Тогда
		Представление = "без НДС"
	ИначеЕсли Значение = НДСИсчисляетсяНалоговымАгентом Тогда
		Представление = "НДС исчисляется налоговым агентом"
	// новые ставки c 2025	
	ИначеЕсли Значение = НДС5 Тогда	
		Представление = "5%";
	ИначеЕсли Значение = НДС7 Тогда	
		Представление = "7%";
	ИначеЕсли Значение = НДС22 Тогда	
		Представление = "22%";
	ИначеЕсли Значение = НДС5_105 Тогда	
		Представление = "5/105";
	ИначеЕсли Значение = НДС7_107 Тогда	
		Представление = "7/107";
	ИначеЕсли Значение = НДС22_122 Тогда
		Представление = "22/122"
	ИначеЕсли Значение = НДС9_09 Тогда	
		Представление = "9,09%";
	ИначеЕсли Значение = НДС16_67 Тогда	
		Представление = "16,67%";
	ИначеЕсли Значение = НДС18_03 Тогда	
		Представление = "18,03%";
	Иначе
		ВызватьИсключение "Не смог определить представление ставки НДС по переданному значению.";
	КонецЕсли;
	
	Возврат Представление;
		
КонецФункции