#Область ПрограммныйИнтерфейс

// Http получить актуальную версию расширения.
// 
// Параметры:
//  НазваниеПродукта - Строка - Название продукта
// 
// Возвращаемое значение:
//  Строка -  Http получить актуальную версию расширения
Функция http_ПолучитьАктуальнуюВерсиюПродукта(НазваниеПродукта) Экспорт

	Результат = "0.0.0.0";

	СтруктураДанныхДляЗапроса = КонтурЗакупки_ОбновлениеВызовСервера.api_ПолучитьАктуальнуюВерсиюПродукта(
		НазваниеПродукта);
	ПолныйПутьЗапроса = СтруктураДанныхДляЗапроса.АдресСервера + СтруктураДанныхДляЗапроса.СтрокаПодключения;
	ОписаниеДействия = КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьОписаниеДействия(
		"check_update", "Проверка обновлений", ПолныйПутьЗапроса, "");

	РезультатHTTPЗапроса = КонтурЗакупки_httpКлиентСервер.ВыполнитьHTTPЗапросСМетрикой(СтруктураДанныхДляЗапроса,
		ОписаниеДействия);

	Если РезультатHTTPЗапроса["data"] <> Неопределено Тогда
		Результат = РезультатHTTPЗапроса["data"]["name"];
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Http скачать обновление.
// 
// Параметры:
//  НазваниеМодуля - Строка - Название модуля
//  ТипМодуля - Строка - Тип модуля
//  НомерВерсии - Строка -  Номер версии
// 
// Возвращаемое значение:
//  Неопределено -  Http скачать обновление
Функция http_СкачатьОбновление(НазваниеМодуля, ТипМодуля, НомерВерсии = "") Экспорт

	Результат = Неопределено;

	СтруктураДанныхДляЗапроса = КонтурЗакупки_ОбновлениеВызовСервера.api_СкачатьОбновление(НазваниеМодуля, ТипМодуля,
		НомерВерсии);

	ПолныйПутьЗапроса = СтруктураДанныхДляЗапроса.АдресСервера + СтруктураДанныхДляЗапроса.СтрокаПодключения;
	ОписаниеДействия = КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьОписаниеДействия(
		"get_update", "Получение обновлений", ПолныйПутьЗапроса, "");

	РезультатHTTPЗапроса = КонтурЗакупки_httpКлиентСервер.ВыполнитьHTTPЗапросСМетрикой(СтруктураДанныхДляЗапроса,
		ОписаниеДействия);

	Если РезультатHTTPЗапроса["data"] <> Неопределено Тогда
		Результат = РезультатHTTPЗапроса["data"];
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Получить текущую версию расширения.
// 
// Параметры:
//  КлючРасширения - Строка - Ключ расширения
// 
// Возвращаемое значение:
//  Структура -  Получить текущую версию расширения:
// * Версия - Строка - 
// * Синоним - Строка - 
// * ХешСумма - Строка - 
// * ЗащитаОтОпасныхДействий - Булево - 
// * БезопасныйРежим - Булево - 
Функция ПолучитьТекущуюВерсиюРасширения(КлючРасширения) Экспорт
	Возврат КонтурЗакупки_ОбновлениеВызовСервера.ПолучитьТекущуюВерсиюРасширения(КлючРасширения);
КонецФункции

// Это новая версия.
// 
// Параметры:
//  СтараяВерсия - Строка - Старая версия
//  НоваяВерсия - Строка - Новая версия
// 
// Возвращаемое значение:
//  Булево -  Это новая версия
Функция ЭтоНоваяВерсия(СтараяВерсия, НоваяВерсия) Экспорт
	Возврат КонтурЗакупки_ОбновлениеВызовСервера.ЭтоНоваяВерсия(СтараяВерсия, НоваяВерсия);
КонецФункции

// Доступно обновление подсистем.
// 
// Возвращаемое значение:
//  Булево -  Доступно обновление подсистем
Функция ДоступноОбновлениеПодсистем() Экспорт

	Результат = Ложь;

	МассивПодсистем = КонтурЗакупки_ОбновлениеВызовСервера.ПолучитьМассивПодсистем();

	Для Каждого Подсистема Из МассивПодсистем Цикл
		Если Подсистема.ТекущаяВерсия.Версия = "0.0.0.0" Тогда
			Продолжить;
		КонецЕсли;
		Подсистема.АктуальнаяВерсия = http_ПолучитьАктуальнуюВерсиюПродукта(
				Подсистема.НазваниеПродукта);
		Если ЭтоНоваяВерсия(Подсистема.ТекущаяВерсия.Версия, Подсистема.АктуальнаяВерсия) Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции
#КонецОбласти