#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим пустые строки из ОстаткиТоплива и Заправки
	УдалитьПустыеСтрокиИзТаблицТоплива(); 
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ПЛ_Титул4_5_02_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		КонтурЛогистика_ОбработкаДокументовСервер.ДополнитьДополнительныхПолучателейИзГлавногоДокумента(ЭтотОбъект, Титул1);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);

	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ПЛ_Титул4_5_02_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти

#Область ЗаполнитьИзФайлаОбмена

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументТ1 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлуПЛ(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументТ1) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти исходный документ Титул1 путевого листа, создание не выполнено");
		
	Иначе
		
		Титул1 = НайденныйДокументТ1;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
				
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ 		= КС.XDTO_Вычислить(XDTO, "Документ");
	
	ДатИнфВозвр 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатИнфВозвр"));
	ВрИнфВозвр 		= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрИнфВозвр"));
	
	ДатФайлИнфВыпуск = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфВыпуск.ДатФайлИнфВыпуск"));
	ВрФайлИнфВыпуск 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфВыпуск.ВрФайлИнфВыпуск"));
	ИдФайлИнфВыпуск 	= КС.XDTO_Вычислить(Документ, "ИдИнфВыпуск.ИдФайлИнфВыпуск");
	
	ЭПВыезд = КС.XDTO_Вычислить(Документ, "ИдИнфВыпуск.ЭП");
	
	ТипПодпис_raw = КС.XDTO_Вычислить(Документ, "ПодпИнфВозвр.ТипПодпис");
	ТипПодпис = Перечисления.КонтурЛогистика_ТипыПодписи.ЗначениеИзXDTO(ТипПодпис_raw);
	
	СпосПодтПолном_raw = КС.XDTO_Вычислить(Документ, "ПодпИнфВозвр.СпосПодтПолном");
	СпосПодтПолном = Перечисления.КонтурЛогистика_СпособыПодтвержденияПолномочий.ЗначениеИзXDTO(СпосПодтПолном_raw);
	
	Фамилия 	= КС.XDTO_Вычислить(Документ, "ПодпИнфВозвр.ФИО.Фамилия");
	Имя 		= КС.XDTO_Вычислить(Документ, "ПодпИнфВозвр.ФИО.Имя");
	Отчество 	= КС.XDTO_Вычислить(Документ, "ПодпИнфВозвр.ФИО.Отчество");
	
	ДопСведенияОПодписанте = КС.XDTO_Вычислить(Документ, "ПодпИнфВозвр.ДопСведПодп");
	
	СодИнфВозвр 		= КС.XDTO_Вычислить(Документ, "СодИнфВозвр");
	
	ПоказанияОдометра 	= КС.XDTO_Вычислить(СодИнфВозвр, "ОдомВозвр");   
	ДтВрВозвр 			= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(КС.XDTO_Вычислить(СодИнфВозвр, "ДтВрВозвр"));
	
	// Остатки топлива
	КС.Конвертировать_ТоплТип_вТЧТопливоЛогистика(СодИнфВозвр, "СвТоплВозвр", ЭтотОбъект, "ОстаткиТоплива");
	
	// Заправки
	КС.Конвертировать_ТоплТип_вТЧТопливоЛогистика(СодИнфВозвр, "СвЗапрТопл", ЭтотОбъект, "Заправки");
	
	// ИнфПол
	КС.ЗаполнитьИнфПолИзXDTOсИдФайл(СодИнфВозвр, ЭтотОбъект, "ИнфПол");
	
	КС.ЗаполнитьДополнительныхПолучателей(XDTO, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ЗаполнитьПоПредыдущемуТитулу

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	Если ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1_5_02") Тогда 
		Титул1 	= ПредыдущийТитул;
	Иначе
		Титул1 	= ПредыдущийТитул.Титул1;
	КонецЕсли;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02);
	
	// поиск документа учетной системы
	Если ЗначениеЗаполнено(НастройкаКонвертации.ТипДокумента1С) Тогда
		
		НайденныйДокУчСист = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДокументУчетнойСистемыПоТипуЛогистика(
			Титул1, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02);
		
		Если ЗначениеЗаполнено(НайденныйДокУчСист) Тогда 
			ДокументОснование = НайденныйДокУчСист;
		КонецЕсли;
		
	КонецЕсли;
	
	Титул3 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02, Титул1);
	
	Если Не ЗначениеЗаполнено(ДтВрВозвр) Тогда
		ДтВрВозвр = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЗаполнитьУказателиНаПредыдущийТитул(Титул1, Титул3);
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации);
	КонецЕсли;
	
	// Данные из рабочего места
	Если ДанныеЗаполнения.Свойство("ЭтоСменаВодителя") И ЗначениеЗаполнено(ДанныеЗаполнения.ЭтоСменаВодителя) Тогда
		ЭтоСменаВодителя = ДанныеЗаполнения.ЭтоСменаВодителя;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ОдометрРаботник") И ЗначениеЗаполнено(ДанныеЗаполнения.ОдометрРаботник) Тогда
		ОдометрРаботник = ДанныеЗаполнения.ОдометрРаботник;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("Должность") И ЗначениеЗаполнено(ДанныеЗаполнения.Должность) Тогда
		Должность = ДанныеЗаполнения.Должность;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ПоказанияОдометра") И ЗначениеЗаполнено(ДанныеЗаполнения.ПоказанияОдометра) Тогда
		ПоказанияОдометра = ДанныеЗаполнения.ПоказанияОдометра;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ДатВрОдометр") И ЗначениеЗаполнено(ДанныеЗаполнения.ДатВрОдометр) Тогда
		ДтВрВозвр = ДанныеЗаполнения.ДатВрОдометр;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач Титул1, Титул3) Экспорт

	ФайлТитула3 = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(Титул3);
	
	Если Не ЗначениеЗаполнено(ФайлТитула3) Тогда 
		ВызватьИсключение "Не найден файл обмена Титулом 3 Путевого листа - невозможно создать Титул 4: " + Титул3;
	КонецЕсли;
	
	ИдФайлИнфВыпуск 	= СтрЗаменить(ФайлТитула3.ИмяФайла, ".xml", "");
	ДатФайлИнфВыпуск 	= Титул3.ДатИнфВыпуск;
	ВрФайлИнфВыпуск  	= Титул3.ВрИнфВыпуск;
	
	ДвоичныеДанныеПодписи = ФайлТитула3.Подпись.Получить();
	ЭПВыезд 			= Base64Строка(ДвоичныеДанныеПодписи);

КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации) Экспорт

	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		//Заполнить ЭтотТитул
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ГенерацияXML

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ПЛ_Титул4_5_02.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ДатИнфВозвр = ТекущаяДатаСеанса();
		ВрИнфВозвр = ТекущаяДатаСеанса();
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфВозвр, ВрИнфВозвр);
		
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать();
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 4;
	Формат = "5.02";
	ТипДокументооборота = "__PL";
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула, Формат, ТипДокументооборота);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	Если ДополнительныеПолучателиФайла.Количество() > 0 Тогда 
		W = 1;
	Иначе
		W = 0;
	КонецЕсли;
	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайла); 	
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаПЛ_5_02(НомерТитула, 
												Титул1.ЛицоОформившееПЛ,
												Титул1.ОрганизацияМедик,												
												GUID,
												W); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
												
	ОрганизацияПодписанта = Титул1.ЛицоОформившееПЛ;
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ОрганизацияПодписанта, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_ПодпИнф(НомерТитула, ТипДокументооборота, Формат, ПодписантСтруктура);
	Если ЗначениеЗаполнено(ПодписантСтруктура.МЧД) И ПодписантСтруктура.СпосПодтПолном = "3" Тогда 
		Результат.Вставить("ИдентификаторМЧД",	ПодписантСтруктура.МЧД);
	КонецЕсли;
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, ТипДокументооборота, Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	XDTO_ИдИнфВыпуск 		= КС.XDTO_ПЛ_ИдИнфВыпуск(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфВыпуск", XDTO_ИдИнфВыпуск);
			
	XDTO_СодИнфВозвр = КС.XDTO_ПЛ_СодИнфВозвр(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодИнфВозвр", XDTO_СодИнфВозвр);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ОрганизацияПодписанта = Титул1.ЛицоОформившееПЛ;
			
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ОрганизацияПодписанта,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
				
	Исключение
		
		КонтурЛогистика_Метрика.Метрика_Отправить_Предупреждение("КонтурЛогистика_ЗаполнитьРеквизитыПоПользователю", 
			"ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьПустыеСтрокиИзТаблицТоплива()
	
	НаименованияСтолбцов = Новый Структура("Топливо, КоличествоТоплива, КоличествоЧасовРаботыСВключеннымОтопителем, КоличествоЧасовРаботыОборудования",
		Справочники.КонтурЛогистика_ГорючеСмазочныеМатериалы.ПустаяСсылка(), 0, 0, 0);  
		
	ПустыеСтроки = ОстаткиТоплива.НайтиСтроки(НаименованияСтолбцов);  
	Для Каждого Строка Из ПустыеСтроки Цикл  
		ОстаткиТоплива.Удалить(Строка);  
	КонецЦикла;
	
	ПустыеСтроки = Заправки.НайтиСтроки(НаименованияСтолбцов);  
	Для Каждого Строка Из ПустыеСтроки Цикл  
		Заправки.Удалить(Строка);  
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли