
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область БиблиотекаЭлектронныхДокументов

Процедура ПриОпределенииПодписокНаСобытияБЭД(Подписки) Экспорт
	
	Подписки.БизнесСеть.ПриРегистрацииКонтрагентов              = Истина;
	Подписки.БизнесСеть.ПриИзмененииИдентификаторовКонтрагентов = Истина;
	Подписки.БизнесСеть.ПриИзмененииИдентификаторовОрганизаций  = Истина;
	
КонецПроцедуры

#Область БизнесСеть

// См. БизнесСетьСлужебный.ПриРегистрацииКонтрагентов
Процедура ПриРегистрацииКонтрагентов(Знач Контрагенты) Экспорт

	Если Контрагенты.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Если СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов() Тогда 
		// Если сверка включена, то очистим устаревшие идентификаторы для зарегистрированных контрагентов (если имеются).
		РегистрыСведений.СервисСверкиРасчетовУстаревшиеIDУчастниковСверки.ОчиститьРегистрПоУчастникамСверки(
			Контрагенты.ВыгрузитьКолонку("Контрагент"));
		Возврат;
	КонецЕсли;
	
	// Если сверка отключена, то добавим запись в регистр "Участники сверки с обновленными ID" для пересчета баннеров.
	// Достаточно добавить одну запись в регистр в качестве флага для пересчета.
	НаборЗаписей = РегистрыСведений.СервисСверкиРасчетовУчастникиСверкиСОбновленнымиID.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УчастникСверки.Установить(Контрагенты[0].Контрагент);
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.УчастникСверки               = Контрагенты[0].Контрагент;
	ЗаписьНабора.ИдентификаторПослеОбновления = Контрагенты[0].Идентификатор;
	
	НаборЗаписей.Записать();
	
	// Включим при необходимости рег задание по обработке участников сверки.
	СервисСверкиРасчетов.ОпределитьНеобходимостьОбработкиУчастниковСверки();
	
КонецПроцедуры

// См. БизнесСетьСлужебный.ПриИзмененииИдентификаторовКонтрагентов
Процедура ПриИзмененииИдентификаторовКонтрагентов(Знач Контрагенты) Экспорт
	
	// При отключенном сервисе сверки изменения идентификаторов не обрабатываем.
	Если НЕ СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаКонтрагент Из Контрагенты Цикл 
		Если ЗначениеЗаполнено(СтрокаКонтрагент.СтарыйИдентификатор) И ЗначениеЗаполнено(СтрокаКонтрагент.НовыйИдентификатор) Тогда
			// Получен новый идентификатор.
			НаборЗаписей = РегистрыСведений.СервисСверкиРасчетовУчастникиСверкиСОбновленнымиID.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.УчастникСверки.Установить(СтрокаКонтрагент.Контрагент);
			
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.УчастникСверки               = СтрокаКонтрагент.Контрагент;
			ЗаписьНабора.ИдентификаторДоОбновления    = СтрокаКонтрагент.СтарыйИдентификатор;
			ЗаписьНабора.ИдентификаторПослеОбновления = СтрокаКонтрагент.НовыйИдентификатор;
			
			НаборЗаписей.Записать();
		ИначеЕсли ЗначениеЗаполнено(СтрокаКонтрагент.СтарыйИдентификатор) И НЕ ЗначениеЗаполнено(СтрокаКонтрагент.НовыйИдентификатор) Тогда
			// Удален идентификатор.
			НаборЗаписей = РегистрыСведений.СервисСверкиРасчетовУстаревшиеIDУчастниковСверки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.УчастникСверки.Установить(СтрокаКонтрагент.Контрагент);
			
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.УчастникСверки = СтрокаКонтрагент.Контрагент;
			ЗаписьНабора.Идентификатор  = СтрокаКонтрагент.СтарыйИдентификатор;
			
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
	// Включим при необходимости рег задание по обработке участников сверки.
	СервисСверкиРасчетов.ОпределитьНеобходимостьОбработкиУчастниковСверки();
	
КонецПроцедуры

// См. БизнесСетьСлужебный.ПриИзмененииИдентификаторовОрганизаций
Процедура ПриИзмененииИдентификаторовОрганизаций(Знач Организации) Экспорт
	
	// При отключенном сервисе сверки изменения идентификаторов не обрабатываем.
	Если НЕ СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаОрганизация Из Организации Цикл 
		
		НаборЗаписей = РегистрыСведений.СервисСверкиРасчетовУчастникиСверкиСОбновленнымиID.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УчастникСверки.Установить(СтрокаОрганизация.Организация);
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.УчастникСверки               = СтрокаОрганизация.Организация;
		ЗаписьНабора.ИдентификаторДоОбновления    = СтрокаОрганизация.СтарыйИдентификатор;
		ЗаписьНабора.ИдентификаторПослеОбновления = СтрокаОрганизация.НовыйИдентификатор;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	// Включим при необходимости рег задание по обработке участников сверки.
	СервисСверкиРасчетов.ОпределитьНеобходимостьОбработкиУчастниковСверки();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// см. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбменССервисомСверкиРасчетов.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбменССервисомСверкиРасчетовОтправка.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.СервисСверкиРасчетовОбработатьУчастниковСверки.ИмяМетода);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти