#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("СВ_ТитулГО_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);

	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"СВ_ТитулГО_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
							ДанныеЗаполнения.ТипЛогистика);
							
	УИД_СВ 		= ПредыдущийТитул.УИД_СВ;
	Если Не ЗначениеЗаполнено(УИД_СВ) Тогда 
		УИД_СВ = "Отсутствует";
	КонецЕсли;
	ДокументСВ 	= ПредыдущийТитул.ДокументСВ;
	
	СкопироватьКонтейнерыИзПредыдущеготитула(ПредыдущийТитул);
	
	ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
		
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		
		ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации);

	КонецЕсли;
	
КонецПроцедуры

Процедура СкопироватьКонтейнерыИзПредыдущеготитула(Знач ПредыдущийТитул)
	
	Перем СкопированнаяСтрокаКонтейнера, СтрокаКонтейнера;
	
	Контейнеры.Очистить();
	Для Каждого СтрокаКонтейнера Из ПредыдущийТитул.Контейнеры Цикл 
		СкопированнаяСтрокаКонтейнера = Контейнеры.Добавить();
		ЗаполнитьЗначенияСвойств(СкопированнаяСтрокаКонтейнера, СтрокаКонтейнера); 
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул) Экспорт
	
	Перем ДвоичныеДанныеПодписи, ФайлТитула1;
	
	ФайлТитула1 = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ПредыдущийТитул);
	
	ИдФайлИнфПрв 	= СтрЗаменить(ФайлТитула1.ИмяФайла, ".xml", "");
	ДатФайлИнфПрв 	= ПредыдущийТитул.ДатИнфПрв;
	ВрФайлИнфПрв  	= ПредыдущийТитул.ВрИнфПрв;
	
	ДвоичныеДанныеПодписи = ФайлТитула1.Подпись.Получить();
	ЭППВ 				= Base64Строка(ДвоичныеДанныеПодписи);

	ТипПредыдущегоТитула = ПредыдущийТитул.ТипТитула;
	
	ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СледующийТипДокумента(ТипПредыдущегоТитула);
	
КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации)

	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		//Заполнить ЭтотТитул
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДата();
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Из док Основания

Процедура ЗаполнитьПоДокОснованию(Знач ДанныеЗаполнения)
	
	Перем ДокументСВОбъект, НайденныйСВ, НастройкаКонвертации, ТЗ_ТоварыВременная;
	
	ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
								ДанныеЗаполнения.ТипЛогистика, 
								ДанныеЗаполнения.ДокументОснование);
	
	// ДокументЭТрН потребуется создать(найти) и записать в базу.
	
	НайденныйСВ = КонтурЛогистика_ОбработкаДокументовСервер.НайтиЭТрН(ДокументОснование, НастройкаКонвертации);
	Если ЗначениеЗаполнено(НайденныйСВ) Тогда 
		ДокументСВ = НайденныйСВ;
		
		// перезаполним ЭТРН если взведен флаг
		Если ДанныеЗаполнения.Свойство("ПерезаполнитьГлавныйДокументЕслиСуществует") И ДанныеЗаполнения.ПерезаполнитьГлавныйДокументЕслиСуществует Тогда 
			
			ДокументСВОбъект = ДокументСВ.ПолучитьОбъект();
			КонтурЛогистика_КонвертацияСервер.ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы(ДокументСВОбъект, ДанныеЗаполнения.ДокументОснование, НастройкаКонвертации);
			ДокументСВОбъект.Записать();
			
		КонецЕсли;
	Иначе
		
		ДокументСВОбъект = Документы.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость.СоздатьДокумент();
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы(ДокументСВОбъект, ДанныеЗаполнения.ДокументОснование, НастройкаКонвертации);
		ДокументСВОбъект.Записать();
		ДокументСВ = ДокументСВОбъект.Ссылка;
		
	КонецЕсли;
	
	//Заполнить ЭтотТитул
	КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ДокументСВ.Грузоотправитель,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Из пришедшего файла XML

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	Перем XDTO, ВидТар_raw, ВодительN, ДатаВремяПодачиПлановая_raw, ДатаВремяПрибытия_raw, ДатаВремяУбытия_raw, ЗакУсл_raw, ИнициаторПереадресации_стр, й, КС, МассивОпГруз, МассивСвВодит_XDTO, МетодОпределенияМассы_raw, НайденныйДокументЭТРН, НоваяСтрокаТовара, ОбъявленнаяЦенность, ОбъявленнаяЦенность_raw, ОпГруз, ОпГруз_raw, СвВодит_XDTO, СодИнфГО, стрОбъявленнаяЦенность_raw, СтрокаДопВодителя, СтрокаТелефонаПА, ТелефонПереадресующего, ТелефоныПереадресующего_raw, ТелефоныПереадресующего_массив;
	
	НайденныйДокументЭТРН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлу(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументЭТРН) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти Документ ЭТРН, создание не выполнено");
		
	Иначе
		
		ДокументЭТРН = НайденныйДокументЭТРН;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		ЗаполнитьРеквизитыТитулаИзXDTO(XDTO, СодИнфГО);
		
		// TODO ИнфПол
		
		// Комментарий - нет в формате минтранса // TODO есть в Диадоке - научиться доставать из ДД 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO, СодИнфГО)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	СодИнфГО 	= XDTO.Документ.СодИнфГО;
	
	// TODO

КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Генерация xml

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_СВ_ТитулГО.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	ДатИнфГО = ТекущаяДатаСеанса();
	ВрИнфГО = ТекущаяДатаСеанса();
	
	Попытка
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфГО, ВрИнфГО);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										ТипТитула,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфГО и ВрИнфГО
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = "Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить(ТекстОшибки);
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(2, ,"__SoprVed");
	
	GUID = Строка(Новый УникальныйИдентификатор);
	НомерТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.НомерТитула(ТипТитула);
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаСВ(НомерТитула, 
												ДокументСВ.Грузоотправитель,
												ДокументСВ.Перевозчик,
												ДокументСВ.Грузополучатель,
												GUID); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументСВ.Грузоотправитель, ПользовательПодписант, ДокументСВ.ДатаСВ, ЭтотОбъект, ПараметрНастроекПодписания);
	XDTO_Подписант 		= КС.XDTO_Подписант(2, "__SoprVed", , ПодписантСтруктура, неопределено); // TODO МЧД
	
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(2, "__SoprVed", , XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	XDTO_СодСВИнфГО = КС.XDTO_СодСВИнфГО(2, , Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодСВИнфГО", XDTO_СодСВИнфГО);
	
	XDTO_ИдИнфПрв = КС.XDTO_ИдИнфПрв_СВ(2, , Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфПрв", XDTO_ИдИнфПрв);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла", ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли

