#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НоваяКоманда = Команды.Добавить("АУ_ЗагрузитьДанные");
	НоваяКоманда.Заголовок = "Загрузить из Excel";
	НоваяКоманда.Действие = "АУ_ЗагрузитьДанные"; //указываем только имя процедуры
	
	НовыйЭлемент = Элементы.Добавить("АУ_ЗагрузитьДанные", Тип("КнопкаФормы"),Элементы.ГруппаТоварыЗаполнить);
	НовыйЭлемент.ИмяКоманды = "АУ_ЗагрузитьДанные";
	НовыйЭлемент.Вид=ВидКнопкиФормы.КнопкаКоманднойПанели;
	
	НоваяКоманда = Команды.Добавить("АУ_ПривязатьКСтрокеЗаказаКлиента");
	НоваяКоманда.Заголовок = "Привязать к строке заказа клиента";
	НоваяКоманда.Действие = "АУ_ПривязатьКСтрокеЗаказаКлиента"; //указываем только имя процедуры
	
	НовыйЭлемент = Элементы.Добавить("АУ_ПривязатьКСтрокеЗаказаКлиента", Тип("КнопкаФормы"),Элементы.ТоварыКоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "АУ_ПривязатьКСтрокеЗаказаКлиента";
	НовыйЭлемент.Вид=ВидКнопкиФормы.КнопкаКоманднойПанели;
	
	АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычнаяБезОтображения(ЭтаФорма,"АУ_ГруппаСуммаНДСВсего","ГруппаИтого",1);
	Элемент=АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма,"АУ_СуммаНДСВсего","АУ_ГруппаСуммаНДСВсего","Сумма НДС",1,"АУ_СуммаНДСВсего");
	Элемент.ТолькоПросмотр=Истина;
	
	Элемент=АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма,"ТоварыАУ_Шифр", "Товары", "Шифр",1,"Объект.Товары.АУ_Шифр",Новый Структура("Ширина",7));
	Элементы.Переместить(Элемент,Элементы.Товары,Элементы.ТоварыНоменклатураАртикул);
	
	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(ЭтаФорма, "АУ_Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_Сумма", "ГруппаИтого", "Сумма строк", 1, "АУ_Сумма", Новый Структура("ТолькоПросмотр", Истина));
	
	Элемент = АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "ТоварыАУ_ЗаказНаСборку", "Товары",, 1, "Объект.Товары.АУ_ЗаказНаСборку");
	
	АУ_ОбщиеПроцедурыИФункцииСервер.ОтключитьВидимостьНоменклатурыИзАрхиваВФормеДокумента(ЭтаФорма);
	
	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(ЭтаФорма, "АУ_РазныеЦеныДляОдинаковыхТоваров", АУ_СозданиеЭлементовФормы.ОписаниеТипаБулево());
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_РазныеЦеныДляОдинаковыхТоваров", "ГруппаТоварыПодвал", "Разные цены для товаров", 2, "АУ_РазныеЦеныДляОдинаковыхТоваров");
	
	Если Элементы.Найти("ГруппаТоварыЗаполнить") <> Неопределено Тогда
		
		АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_ЗаполнитьХарактеристики", "Заполнить характеристики", "АУ_ЗаполнитьХарактеристики");
		АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ЗаполнитьХарактеристики", "ГруппаТоварыЗаполнить",, "АУ_ЗаполнитьХарактеристики", 1);
		АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ЗаполнитьХарактеристики1", "ТоварыКонтекстноеМеню",, "АУ_ЗаполнитьХарактеристики", 1);
		
	КонецЕсли;
	
	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(ЭтаФорма, "АУ_Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_ОбъединитьСтроки", "Объединить строки", "АУ_ОбъединитьСтроки");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ОбъединитьСтроки", "ГруппаТоварыЗаполнить",, "АУ_ОбъединитьСтроки", 1);
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ОбъединитьСтроки1", "ТоварыКонтекстноеМеню",, "АУ_ОбъединитьСтроки", 1);
	
КонецПроцедуры

&НаСервере
Процедура АУ_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	
	Попытка
		АУ_СозданиеЭлементовФормы.СоздатьРеквизит(ЭтаФорма,"АУ_СуммаНДСВсего",АУ_СозданиеЭлементовФормы.ОписаниеТипаЧисло(15,2));
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
&Перед("ПриЧтенииСозданииНаСервере")
Процедура АУ_ПриЧтенииСозданииНаСервере()
	Попытка
		АУ_СозданиеЭлементовФормы.СоздатьРеквизит(ЭтаФорма,"АУ_СуммаНДСВсего",АУ_СозданиеЭлементовФормы.ОписаниеТипаЧисло(15,2));
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура АУ_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Элементы.Договор.Видимость И НЕ ЗначениеЗаполнено(ТекущийОбъект.Договор) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнен договор !",ТекущийОбъект.Ссылка,"Договора","Объект.Договор",Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Команды

&НаКлиенте
Процедура АУ_СменитьЗаказКлиента(Команда)
	
	СписокВидовДокумента = Новый СписокЗначений;
	СписокВидовДокумента.Добавить("Документ.ЗаказКлиента.ФормаВыбора", НСтр("ru = 'Заказ клиента'"));
	СписокВидовДокумента.Добавить("Документ.ЗаказНаСборку.ФормаВыбора", НСтр("ru = 'Заказ на сборку'"));
	
	ПоказатьВыборИзМеню(
		Новый ОписаниеОповещения("АУ_СменитьЗаказКлиентаВыборВидаЗавершение", ЭтаФорма),
		СписокВидовДокумента,
		Элементы.АУ_СменитьЗаказКлиента);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_СменитьЗаказКлиентаВыборВидаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(
		ВыбранныйЭлемент.Значение,,
		ЭтаФорма,
		Новый УникальныйИдентификатор,,,
		Новый ОписаниеОповещения("СменитьЗаказКлиентаЗавершение", ЭтаФорма),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ОтвязатьОтЗаказаКлиента(Команда)
	
	Объект.ДокументОснование=Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьЗаказКлиентаЗавершение(Значение,ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Объект.ДокументОснование=Значение;
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОснование", "Видимость", ЗначениеЗаполнено(Объект.ДокументОснование));
		Элементы.АУ_СменитьЗаказКлиента.Заголовок="Сменить заказ";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗагрузитьДанные(Команда)
	
	ОткрытьФорму("Обработка.АУ_ЗагрузкаДанныхВДокументы.Форма.ЗагрузкаВЗаказКлиента",,ЭтаФорма,,,,Новый ОписаниеОповещения("АУ_ЗагрузкаДанныхЗавершение",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗагрузкаДанныхЗавершение(Значение,ДопПараметры) Экспорт
	
	Если ЭтоАдресВременногоХранилища(Значение) Тогда
		АУ_ЗагрузкаДанныхЗавершениеСервер(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ПривязатьКСтрокеЗаказаКлиента(Команда)
	
	Если Элементы.Товары.ТекущаяСтрока=Неопределено ИЛИ Элементы.Товары.ВыделенныеСтроки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказПоставщику.Форма.АУ_ФормаВыбораСтрокиЗаказаКлиента",,ЭтаФорма,,,,Новый ОписаниеОповещения("АУ_ПриВыбореСтрокиЗаказаКлиента",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
&Перед("Подключаемый_ОбработатьЗаписьОбъекта")
Процедура АУ_Подключаемый_ОбработатьЗаписьОбъекта()
	АУ_ИсправитьКоды();
КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗаполнитьХарактеристики(Команда)
	
	ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора",, ЭтаФорма, Новый УникальныйИдентификатор,,, Новый ОписаниеОповещения("АУ_ЗаполнитьХарактеристикиЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗаполнитьХарактеристикиЗавершение(Значение, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Для каждого стр Из Элементы.Товары.ВыделенныеСтроки Цикл
			
			стрТовары = Объект.Товары.НайтиПоИдентификатору(стр);
			Если стрТовары.ХарактеристикиИспользуются Тогда
				стрТовары.Характеристика = Значение;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ОбъединитьСтроки(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",, ЭтаФорма,,,, Новый ОписаниеОповещения("АУ_ОбъединитьСтрокиЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ОбъединитьСтрокиЗавершение(Номенклатура, ДопПараметры) Экспорт
	
	Если Номенклатура = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	МинимальноеКоличествоСтрокДляОбъединения = 2;
	
	Если ВыделенныеСтроки.Количество() < МинимальноеКоличествоСтрокДляОбъединения Тогда
		Возврат;
	КонецЕсли;
	
	ПерваяСтрока = Объект.Товары.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
	
	ИтоговоеКоличество = 0;
	ИтоговоеКоличествоУпаковок = 0;
	ИтоговаяСумма = 0;
	ИтоговаяСуммаНДС = 0;
	ИтоговаяСуммаСНДС = 0;
	ИтоговаяСуммаРучнойСкидки = 0;
	
	Для Каждого ИД Из ВыделенныеСтроки Цикл
		
		СтрокаТП = Объект.Товары.НайтиПоИдентификатору(ИД);
		
		ИтоговоеКоличество = ИтоговоеКоличество + СтрокаТП.Количество;
		ИтоговоеКоличествоУпаковок = ИтоговоеКоличествоУпаковок + СтрокаТП.КоличествоУпаковок;
		ИтоговаяСумма = ИтоговаяСумма + СтрокаТП.Сумма;
		ИтоговаяСуммаНДС = ИтоговаяСуммаНДС + СтрокаТП.СуммаНДС;
		ИтоговаяСуммаСНДС = ИтоговаяСуммаСНДС + СтрокаТП.СуммаСНДС;
		ИтоговаяСуммаРучнойСкидки = ИтоговаяСуммаРучнойСкидки + СтрокаТП.СуммаРучнойСкидки;
		
	КонецЦикла;
	
	НоваяСтрока = Объект.Товары.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ПерваяСтрока);
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Количество = ИтоговоеКоличество;
	НоваяСтрока.КоличествоУпаковок = ИтоговоеКоличествоУпаковок;
	НоваяСтрока.Сумма = ИтоговаяСумма;
	НоваяСтрока.СуммаНДС = ИтоговаяСуммаНДС;
	НоваяСтрока.СуммаСНДС = ИтоговаяСуммаСНДС;
	НоваяСтрока.СуммаРучнойСкидки = ИтоговаяСуммаРучнойСкидки;
	НоваяСтрока.КодСтроки = ПолучитьПоследнийКодСтроки(Объект) + 1;
	
	Для Каждого ИД Из ВыделенныеСтроки Цикл
		
		СтрокаТП = Объект.Товары.НайтиПоИдентификатору(ИД);
		СтрокаТП.Отменено = Истина;
		
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура АУ_ТоварыПриАктивизацииСтрокиПосле(Элемент)
	
	ПосчитатьСуммуВыделенныхСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ТоварыЦенаПриИзмененииПосле(Элемент)
	
	Если Элементы.Товары.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтаФорма.АУ_РазныеЦеныДляОдинаковыхТоваров Тогда
	
		ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
		КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура));
		Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
			
			Если стрНайденныеСтроки = ТекущаяСтрока Тогда
				Продолжить;
			КонецЕсли;
			
			стрНайденныеСтроки.Цена = ТекущаяСтрока.Цена;
			
			СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСумму");
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
			СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
			ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(стрНайденныеСтроки, СтруктураДействий, КэшированныеЗначения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	ПосчитатьСуммуВыделенныхСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ТоварыПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		ТекущиеДанные.КодСтроки = ПолучитьПоследнийКодСтроки(Объект)+1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ТоварыНоменклатураПриИзмененииПеред(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ЭтаФорма.АУ_Назначение = ТекущаяСтрока.Назначение;
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Назначение = ЭтаФорма.АУ_Назначение;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ПосчитатьСуммуВыделенныхСтрок()
	
	ЭтаФорма.АУ_Сумма = 0;
	
	Для каждого стр Из Элементы.Товары.ВыделенныеСтроки Цикл
		
		стрТовары = Объект.Товары.НайтиПоИдентификатору(стр);
		ЭтаФорма.АУ_Сумма = ЭтаФорма.АУ_Сумма + стрТовары.СуммаСНДС;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура АУ_ЗагрузкаДанныхЗавершениеСервер(АдресХранилища)
	
	Счетчик=0;
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	ТЗ=ПолучитьИзВременногоХранилища(АдресХранилища);
	КодСтроки=ПолучитьПоследнийКодСтроки(Объект)+1;
	Для каждого стрТЗ Из ТЗ Цикл
		
		Счетчик=Счетчик+1;
		
		НоваяСтрока=Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура=стрТЗ.Номенклатура;
		НоваяСтрока.ИдентификаторСтроки=Новый УникальныйИдентификатор;
		НоваяСтрока.КодСтроки=КодСтроки;
		
		ТекущаяСтрока = НоваяСтрока;
		
		СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
		СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Объект.Партнер);
		СтруктураДействий.Вставить(
			"ПроверитьЗаполнитьСклад",
			ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(
				Объект,
				СкладГруппа));
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		
		Если ИспользоватьСоглашенияСПоставщиками И ЗначениеЗаполнено(Объект.Соглашение) Тогда
			СтруктураДействий.Вставить("ЗаполнитьУсловияЗакупок", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект));
		Иначе
			СтруктураДействий.Вставить("ЗаполнитьЦенуЗакупки", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект));
		КонецЕсли;
		
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект));
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатуры",
			Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
		
		//
		Если КонтролироватьАссортимент Тогда
			СтруктураПроверкиАссортимента = АссортиментКлиентСервер.ПараметрыПроверкиАссортимента();
			СтруктураПроверкиАссортимента.Ссылка = Объект.Ссылка;
			СтруктураПроверкиАссортимента.Склад = Объект.Склад;
			СтруктураПроверкиАссортимента.Дата = ?(ЗначениеЗаполнено(Объект.ЖелаемаяДатаПоступления), Объект.ЖелаемаяДатаПоступления, Объект.Дата);
			СтруктураПроверкиАссортимента.ТекстСообщения = НСтр("ru = 'Товар %1 не включен в ассортимент магазина. Заказывать его не рекомендуется.'");
			СтруктураПроверкиАссортимента.ИмяРесурсаАссортимента = "РазрешеныЗакупки";
			СтруктураПроверкиАссортимента.ПровереноМожноДобавлять = Истина;
			СтруктураПроверкиАссортимента.РазрешатьДобавление = Истина;
			//
			СтруктураДействий.Вставить("ПроверитьАссортиментСтроки", СтруктураПроверкиАссортимента);
		КонецЕсли;
		НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействий);
		СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
			ЭтаФорма.ИмяФормы, "Товары"));

		ДоходыИРасходыКлиентСервер.ВставитьДействиеОчиститьСтатьюИАналитикуРасходов(СтруктураДействий, ЭтотОбъект);
			
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
			
		Если ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Или
			ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара") Или 
			ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Набор")
				Или ЗначениеЗаполнено(ТекущаяСтрока.Назначение) Тогда
				
			ТекущаяСтрока.СписатьНаРасходы = Ложь;
			ТекущаяСтрока.Подразделение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
			
		ИначеЕсли ИспользоватьУчетПрочихДоходовРасходов
			И ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
			ТекущаяСтрока.СписатьНаРасходы = Истина;
		КонецЕсли;
		
		ДоходыИРасходыКлиентСервер.ПриИзмененииРеквизитаДоступностиСтатьиВСтроке(ЭтотОбъект, ТекущаяСтрока, "Объект.Товары");
		
		НоваяСтрока.КоличествоУпаковок=стрТЗ.Количество;
		НоваяСтрока.Количество=стрТЗ.Количество;
		НоваяСтрока.Цена=стрТЗ.Цена;
		НоваяСтрока.Сумма=стрТЗ.Сумма;
		НоваяСтрока.СтавкаНДС=стрТЗ.СтавкаНДС;
		НоваяСтрока.СуммаНДС=стрТЗ.СуммаНДС;
		НоваяСтрока.СуммаСНДС=стрТЗ.Сумма;
		НоваяСтрока.КодСтроки=Счетчик;
		НоваяСтрока.Склад=Объект.Склад;
		
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		
		КодСтроки=КодСтроки+1;
		
	КонецЦикла;
	
	Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ПриВыбореСтрокиЗаказаКлиента(Значение,ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Модифицированность=Истина;
		
		Для каждого стрСтрока Из Элементы.Товары.ВыделенныеСтроки Цикл
			стрТовары=Объект.Товары.НайтиПоИдентификатору(стрСтрока);
			стрТовары.АУ_ЗаказКлиента=Значение.Заказ;
			стрТовары.АУ_КодСтроки=Значение.ИдентификаторСтроки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&После("РассчитатьИтоговыеПоказателиЗаказа")
Процедура АУ_РассчитатьИтоговыеПоказателиЗаказа(Форма)
	
	АУ_СуммаНДСВсего_лок=0;
	Для каждого стр Из Форма.Объект.Товары Цикл
		Если НЕ стр.Отменено Тогда
			АУ_СуммаНДСВсего_лок=АУ_СуммаНДСВсего_лок+стр.СуммаНДС;
		КонецЕсли;
	КонецЦикла;
	Форма.АУ_СуммаНДСВсего=АУ_СуммаНДСВсего_лок;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнийКодСтроки(ЗНАЧ ТекОбъект)
	
	Результат=1;
	Для каждого стрТовары Из ТекОбъект.Товары Цикл
		Результат=Макс(стрТовары.КодСтроки,Результат);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура АУ_ИсправитьКоды()
	
	Для каждого стрТовары Из Объект.Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(стрТовары.КодСтроки) Тогда
			стрТовары.КодСтроки=ПолучитьПоследнийКодСтроки(Объект)+1;
			Продолжить;
		КонецЕсли;
			
		НайденныеСтроки=Объект.Товары.НайтиСтроки(Новый Структура("КодСтроки",стрТовары.КодСтроки));
		Если НайденныеСтроки.Количество()>1 Тогда
			Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
				Если стрНайденныеСтроки<>стрТовары Тогда
					стрТовары.КодСтроки=ПолучитьПоследнийКодСтроки(Объект)+1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
