&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
		
	ЗагрузитьТаблицуСкладовНаСервере(АдресСкладов);                          
	ЗагрузитьГруппыПользователейНаСервере(АдресГруппыПользователей);                          		
	ЗагрузитьТаблицуИдентификаторов(АдресИдентификаторов);	
	
	Если ТолькоРедактирование Тогда
		// Просто маска, т.к. данные зашифрованы, и мы их не можем получить из SMARTS
		Штрихкод 	= "111";		
		Пароль 		= "111";		
		
		// Проставляем флажки у складов пользователя (т.к. на форме представлены все)
		Для Каждого КлючИЗначение Из ИдСкладовПользователя Цикл
			СкладПользователя = Склады.НайтиПоЗначению(КлючИЗначение.Значение);
			Если СкладПользователя <> Неопределено Тогда
				СкладПользователя.Пометка = Истина;
			КонецЕсли;
		КонецЦикла;                                                                                                      
	Иначе                                                                                       
		// Присваиваем значения "по умолчанию": "Общая" группа, "Общий" склад
		ГруппаПоУмолчанию 	= ГруппыПользователей.НайтиПоЗначению("Общая");
		Если ПустаяСтрока(ИмяГруппы) Тогда
			ИмяГруппы 		= ?(ГруппаПоУмолчанию = Неопределено, "", ГруппаПоУмолчанию.Значение); 
		КонецЕсли;
		Идентификатор		= ПолучитьИдПоУмолчанию();
		
		СкладПоУмолчанию 	= Склады.НайтиПоЗначению("1");      
		Если СкладПоУмолчанию <> Неопределено Тогда
			СкладПоУмолчанию.Пометка = Истина;
		КонецЕсли;
	КонецЕсли;
	
	УправлениеДоступностью();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Не ПроверкаЗаполненияПолей() Тогда
		Возврат;
	КонецЕсли;	
	
	ПараметрыПользователя = Новый Соответствие;
	ПараметрыПользователя.Вставить("id", 			Идентификатор);
	ПараметрыПользователя.Вставить("name", 			ИмяПользователя);		
	ПараметрыПользователя.Вставить("description", 	Описание);		
	// Для существующих пользователей отправляем пароли/ШК только в случае их изменения
	Если Не ТолькоРедактирование Или ИзменениеШК Тогда
		ПараметрыПользователя.Вставить("barcode", 	Штрихкод);		
	КонецЕсли;                                        
	Если Не ТолькоРедактирование Или ИзменениеПароля Тогда
		ПараметрыПользователя.Вставить("password", 	Пароль);					
	КонецЕсли;
	ПараметрыПользователя.Вставить("ТолькоРедактирование", 	ТолькоРедактирование);
	
	// Группа пользователей
	ТекГруппа = ГруппыПользователей.НайтиПоЗначению(ИмяГруппы);
	Если ТекГруппа = Неопределено Тогда			
		ТекГруппа = ГруппыПользователей.НайтиПоЗначению("Общая");		
	КонецЕсли;
	ПараметрыПользователя.Вставить("groupId", 		?(ТекГруппа = Неопределено, "", ТекГруппа.Значение));		
	ПараметрыПользователя.Вставить("groupName", 	?(ТекГруппа = Неопределено, "", ТекГруппа.Представление));		
	
	// Склады пользователей
	СписокСкладов = Новый Массив;
	Для Каждого КлюЗначениеСклада Из Склады Цикл
		Если КлюЗначениеСклада.Пометка Тогда
			СписокСкладов.Добавить(КлюЗначениеСклада.Значение);
		КонецЕсли;			
	КонецЦикла;                                                 
	ПараметрыПользователя.Вставить("warehouseIds", СписокСкладов);		
	// Склады для кома-режима
	ПараметрыПользователя.Вставить("allWarehouses", Склады);		

	РезультатЗагрузки = _ЛокКонтекст.ЛокЯдро_ЗагрузитьПользователейВSMARTS(ПараметрыПользователя);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда		
		Если НЕ ОписаниеОповещенияОЗакрытии = Неопределено Тогда	
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, РезультатЗагрузки);
		КонецЕсли;                              		
	#КонецЕсли	
	
	Закрыть(РезультатЗагрузки);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ИзменитьПароль(Команда)
	
	Пароль = "";
	Элементы.Пароль.Доступность = Истина;
	ИзменениеПароля = Истина;		
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьШтрихкод(Команда)
	
	Штрихкод = "";
	Элементы.Штрихкод.Доступность = Истина;
	ИзменениеШК = Истина;		
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаКлиенте
Процедура УправлениеДоступностью()
	
	Элементы.Идентификатор.Доступность 			= Не ТолькоРедактирование;	
	Элементы.Штрихкод.Доступность 				= Не ТолькоРедактирование;
	Элементы.Пароль.Доступность 				= Не ТолькоРедактирование;
	Элементы.ИзменитьПароль.Видимость 			= ТолькоРедактирование;
	Элементы.ИзменитьШтрихкод.Видимость 		= ТолькоРедактирование;
	Элементы.Штрихкод.АвтоОтметкаНезаполненного = (ТолькоРедактирование И СписокИдентификаторов.Количество() > 1) 
		Или (Не ТолькоРедактирование И СписокИдентификаторов.Количество());
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуСкладовНаСервере(Адрес)
	
	пТаблицаСкладовMS = ПолучитьИзВременногоХранилища(Адрес);
	Если пТаблицаСкладовMS <> Неопределено Тогда
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			СкладыВспомогательные = пТаблицаСкладовMS.Скопировать();
		#Иначе
			СкладыВспомогательные.Загрузить(пТаблицаСкладовMS);
		#КонецЕсли
	КонецЕсли; 
	
	Для Каждого Склад Из СкладыВспомогательные Цикл
		Склады.Добавить(Склад.Ид, Склад.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьГруппыПользователейНаСервере(Адрес)
	
	ГруппыПользователей = Элементы.ИмяГруппы.СписокВыбора;
	ГруппыПользователей.Очистить();
	
	пТаблицаГруппMS = ПолучитьИзВременногоХранилища(Адрес);
	Если пТаблицаГруппMS <> Неопределено Тогда       
		Для Каждого СтрокаТаблицы Из пТаблицаГруппMS Цикл
			ГруппыПользователей.Добавить(СтрокаТаблицы.Ид, СтрокаТаблицы.Имя);		
		КонецЦикла;		
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуИдентификаторов(Адрес)
	
	МассивИд = ПолучитьИзВременногоХранилища(Адрес);
	СписокИдентификаторов.ЗагрузитьЗначения(МассивИд);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполненияПолей()
	
	Отказ = Ложь;
	
    ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("Идентификатор");
	ОбязательныеПоля.Добавить("ИмяПользователя");      
	ОбязательныеПоля.Добавить("ИмяГруппы");	
	
	Для Каждого Поле Из ОбязательныеПоля Цикл
		Если ПустаяСтрока(ЭтаФорма[Поле]) Тогда
			Отказ = Истина;      
			#Если ТолстыйКлиентОбычноеПриложение Тогда	                      
				ЗаголовокПоля = Элементы[Поле + "Надпись"].Заголовок;
			#Иначе
				ЗаголовокПоля = Элементы[Поле].Заголовок;
			#КонецЕсли
			Сообщение = НСтр("be = 'Поле ""%1"" не павінна быць пустым'; en = 'Field ""%1"" must not be empty'; es = 'El campo ""%1"" no debe estar vacío'; ka = 'ველი ""%1"" არ უნდა იყოს ცარიელი'; kk = '""%1"" толтырылмауы тиіс емес'; ro = 'Câmpul ""%1"" nu trebuie să fie gol'; ru = 'Поле ""%1"" не должно быть пустым'; tr = '""%1"" alanı boş olmamalı'; uk = 'Поле ""%1"" не повинно бути порожнім'; uz = '""%1"" maydoni bo''sh bo''lishi mumkin emas'");
			Сообщение = _ЛокКонтекст.ЛокЯдро_СтрШаблон(Сообщение, ЗаголовокПоля);
			Сообщить(Сообщение); 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Отказ Тогда
		НетСкладов = Истина;
		Для Каждого КлючЗначение Из Склады Цикл
			Если КлючЗначение.Пометка = Истина Тогда
				НетСкладов = Ложь;
			КонецЕсли;
		КонецЦикла;              
		
		Если НетСкладов Тогда
			Отказ = Истина;
			Сообщение = НСтр("ru = 'Пользователь должен иметь хотя бы один склад");
			Сообщить(Сообщение); 
		КонецЕсли;
	КонецЕсли;

	Возврат Не Отказ;	
	
КонецФункции    
     
&НаКлиенте
Функция ПолучитьИдПоУмолчанию()
	
	Инд = 1;
	
	Пока (Истина) Цикл		
		Если СписокИдентификаторов.НайтиПоЗначению(Строка(Инд)) = Неопределено Тогда
			Возврат Строка(Инд);		
		КонецЕсли;              
		
		Инд = Инд + 1;		
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Если ТолстыйКлиентОбычноеПриложение Тогда
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	Объект = ЭтотОбъект;
#КонецЕсли
