
#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоРасширеннаяВерсияГосИС(Подсистема = Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияИСВызовСервера.ЭтоРасширеннаяВерсияГосИС(Подсистема);
	
КонецФункции

Функция ИменаПараметровРаботыКлиентаВыборТипаПодписиБСП() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	
	ВозвращаемоеЗначение.Вставить("ИмяПараметраПриложения", "ГОСИС_ВыборТипаПодписиБСП");
	ВозвращаемоеЗначение.Вставить(
		"ЗначениеПараметраВыборТипаПодписиНеПоддерживается",
		"ИнтеграцияГОСИС.ВыборТипаПодписиБСП.ВыборТипаПодписиНеПоддерживается");
	ВозвращаемоеЗначение.Вставить(
		"ЗначениеПараметраВыборТипаПодписиИспользуетКонструктор",
		"ИнтеграцияГОСИС.ВыборТипаПодписиБСП.ВыборТипаПодписиИспользуетКонструктор");
	ВозвращаемоеЗначение.Вставить(
		"ЗначениеПараметраВыборТипаПодписиЗадаетсяПеречислением",
		"ИнтеграцияГОСИС.ВыборТипаПодписиБСП.ВыборТипаПодписиЗадаетсяПеречислением");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает признак принадлежности переданного в параметре вида продукции к наборам или групповым упаковкам.
// 
// Параметры:
// 	ВидПродукции - СправочникСсылка.ВидыПродукцииИС - Вид продукции для анализа.
// 	ВидУпаковки - ПеречислениеСсылка.ВидыУпаковокИС
// Возвращаемое значение:
// 	Булево - Принадлежность к виду продукции ИСМП
//
Функция ВидПродукцииИспользуетНаборыИлиГрупповыеУпаковки(ВидПродукции, ВидУпаковки = Неопределено) Экспорт
	
	Если ВидУпаковки = Неопределено Тогда
		Если КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииИспользуетНаборы(ВидПродукции) Тогда
			Возврат Истина;
		ИначеЕсли КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииИспользуетГрупповыеУпаковки(ВидПродукции) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Если ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Групповая")
			И КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииИспользуетГрупповыеУпаковки(ВидПродукции) Тогда
			Возврат Истина;
		ИначеЕсли ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор")
			И КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииИспользуетНаборы(ВидПродукции) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ВидПродукцииИспользуетОбъемноСортовойУчет(ВидПродукции) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииИспользуетОбъемноСортовойУчет(ВидПродукции);
	
КонецФункции

// Возвращает объект ЗащищенноеСоединениеOpenSSL
// 
// Возвращаемое значение:
// 	ЗащищенноеСоединениеOpenSSL - Описание
Функция ЗащищенноеСоединение() Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	
КонецФункции

// Создает и возвращает новый глобальный кэш на основе соответствия.
//
// Возвращаемое значение:
//   Соответствие из Произвольный - созданный пустой объект для хранения данных в глобальном кэше
Функция ГлобальныйКеш() Экспорт

	Возврат Новый Соответствие;

КонецФункции

#Область ЧастичноеВыбытие

// Возвращает признак возможности для вида продукции участвовать в частичном выбытии.
// 
// Параметры:
//  ВидПродукции    - СправочникСсылка.ВидыПродукцииИС                - вид маркируемой продукции.
//  ВидОперацииИС - ПеречислениеСсылка.ВидыОперацийИСМП, ПеречислениеСсылка.ВидыДокументовЕГАИС, Неопределено - вид операции ИСМП.
// Возвращаемое значение:
//  Булево - Вид продукци может выбывать частично.
Функция ПоддерживаетсяЧастичноеВыбытие(ВидПродукции, ВидОперацииИС = Неопределено) Экспорт
	
	Возврат ОбщегоНазначенияИСВызовСервера.ПоддерживаетсяЧастичноеВыбытие(ВидПродукции, ВидОперацииИС);
	
КонецФункции

Функция ЗапрашиватьДанныеЧастичногоВыбытияИзСервиса(ВидПродукции, РасширеннаяВерсияГосИС) Экспорт
	
	Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоМаркируемаяПродукцияЕГАИС(ВидПродукции) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаголовокРежимаВыбытияПоВидуОперации(ОперацияИС) Экспорт
	
	Если ТипЗнч(ОперацияИС) = Тип("ПеречислениеСсылка.ВидыОперацийИСМП") Тогда
		Если ОперацияИС = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа")
			Или ОперацияИС = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ОтгрузкаПродажа") Тогда
			Возврат НСтр("ru = 'Продается'");
		Иначе
			Возврат НСтр("ru = 'Возвращается'");
		КонецЕсли;
	Иначе
		Возврат НСтр("ru = 'Продается'");
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеРежимаВыбытияПоВидуПродукции(РежимВыбытия, ВидПродукции) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	Если РежимВыбытия = "Полностью" Тогда
		
		ВариантИспользованияЕдиницы = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначениеАтрибутаЭлементаКонструктора(
			"ВариантИспользованияЕдиницы",
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.НастройкаПредставлений"),
			ВидПродукции);
		ВозвращаемоеЗначение = ВариантИспользованияЕдиницы;
		
	Иначе
		
		ВозвращаемоеЗначение = КонструкторИСМПОбщегоНазначенияКлиентСервер.КраткаяФормаЧастичногоВыбытияПоВидуПродукции(ВидПродукции);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область КонструкторВидовПродукции

// Возвращает текущие элементы конструктора видов продукции ИС.
// 
// Возвращаемое значение:
//  см. Справочники.ЭлементыКонструктораВидовПродукцииИС.ЭлементыКонструктора
Функция ЭлементыКонструктора() Экспорт
	
	Возврат ОбщегоНазначенияИСВызовСервера.ЭлементыКонструктора();
	
КонецФункции

// Возвращает ключи видов продукции ИС.
// 
// Возвращаемое значение:
//  см. Справочники.КлючиВидовПродукцииИС.КлючиВидовПродукции
Функция КлючиВидовПродукции() Экспорт
	
	Возврат ОбщегоНазначенияИСВызовСервера.КлючиВидовПродукции();
	
КонецФункции

// Проверяет соответствие вида продукции заданному ключу видов продукции.
//
// Параметры:
//   ВидПродукции - СправочникСсылка.ВидыПродукцииИС - проверяемый вид продукции
//   КлючВидовПродукции - СправочникСсылка.КлючиВидовПродукцииИС - ключ видов продукции для проверки
//
// Возвращаемое значение:
//   Булево - Истина, если вид продукции соответствует ключу, иначе Ложь
Функция ВидПродукцииСоответствуетКлючу(ВидПродукции, КлючВидовПродукции) Экспорт
	
	Если ТипЗнч(КлючВидовПродукции) = Тип("СправочникСсылка.КлючиВидовПродукцииИС") Тогда
		ВидыПродукцииКлюча = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииКлюча(КлючВидовПродукции);
		Если ВидыПродукцииКлюча.Найти(ВидПродукции) <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПредставленияВидовУпаковокПоВидамПродукции() Экспорт
	Возврат ОбщегоНазначенияИСВызовСервера.ПредставленияВидовУпаковокПоВидамПродукции();
КонецФункции

#КонецОбласти

Функция ОрганизацияИмеетПодконтрольныеОбъектыВЕТИС(Организация) Экспорт
	Возврат ОбщегоНазначенияИСВызовСервера.ОрганизацияИмеетПодконтрольныеОбъектыВЕТИС(Организация);	
КонецФункции

#КонецОбласти