#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДанные(ИдентификаторыНовыхРасхождений) Экспорт 
	
	Если ИдентификаторыНовыхРасхождений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.РасширенныеРежимыЗамещения = Истина;
		
	Для Каждого ИдентификаторРасхождения Из ИдентификаторыНовыхРасхождений Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.ИдентификаторРасхождения = ИдентификаторРасхождения;
		Запись.ЭтоНовоеРасхождение = Истина;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
	
КонецПроцедуры

Функция ОчиститьСтатусыРасхождений() Экспорт
	
	НаборЗаписейРасхождения= РегистрыСведений.СервисСверкиРасчетовСтатусыРасхождений.СоздатьНаборЗаписей();
	НаборЗаписейРасхождения.Записать();
	
КонецФункции

#КонецОбласти

#КонецЕсли