#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") Тогда
		
		Номенклатура = Параметры.Номенклатура;
		
		Для каждого стрНаименование Из Номенклатура.АУ_АльтернативныеНаименования Цикл
			СписокНаименований.Добавить(стрНаименование.НаименованиеПолное);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область КомандыИСобытия

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(Элементы.СписокНаименований.ТекущиеДанные.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНаименованийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(Элементы.СписокНаименований.ТекущиеДанные.Значение);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные


#КонецОбласти




