// ПоказатьПредупреждение
Функция Предупреждение_КонтурЛогистика(ТекстПредупреждения, 
									Заголовок = "Контур.Логистика", 
									Таймаут = 0, 
									КонтекстОбработчика = Неопределено, 
									ИмяОбработчика = Неопределено,
									ПараметрыОбработчика = Неопределено) Экспорт
									
	Если СокрЛП(ТекстПредупреждения) = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеОбработчика = Неопределено;
	Если Не ИмяОбработчика = Неопределено и Не КонтекстОбработчика = Неопределено Тогда
		ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика);
	КонецЕсли;
	ПоказатьПредупреждение(ОписаниеОбработчика, ТекстПредупреждения, Таймаут, Заголовок);
		
	Возврат Неопределено;
	
КонецФункции

Функция Вопрос_КонтурЛогистика(ТекстВопроса,
									КнопкиИлиРежимДиалогаВопрос = Неопределено,
									Заголовок = "Контур.Логистика", 
									Таймаут = 0, 
									КонтекстОбработчика = Неопределено, 
									ИмяОбработчика = Неопределено,
									ПараметрыОбработчика = Неопределено) Экспорт
									
	Если СокрЛП(ТекстВопроса) = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если КнопкиИлиРежимДиалогаВопрос = Неопределено Тогда
		
		КнопкиИлиРежимДиалогаВопрос = РежимДиалогаВопрос.ДаНетОтмена;
	
	КонецЕсли;
	
	ОписаниеОбработчика = Неопределено;
	Если Не ИмяОбработчика = Неопределено и Не КонтекстОбработчика = Неопределено Тогда
		ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика);
	КонецЕсли;
	ПоказатьВопрос(ОписаниеОбработчика, ТекстВопроса, КнопкиИлиРежимДиалогаВопрос, Таймаут, , Заголовок);
		
	Возврат Неопределено;
	
КонецФункции

// ПоказатьВыборИзСписка
Функция ВыбратьИзСписка_КонтурЛогистика(СписокЗначений,
									ЭлементФормы = Неопределено,
									КонтекстОбработчика, 
									ИмяОбработчика,
									ПараметрыОбработчика = Неопределено,
									Форма = Неопределено) Экспорт
									
	Если ТипЗНЧ(СписокЗначений) <> Тип("СписокЗначений") ИЛИ СписокЗначений.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Форма = Неопределено Тогда 
		Форма = КонтекстОбработчика;
	КонецЕсли;
	
	ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика);
	Форма.ПоказатьВыборИзСписка(ОписаниеОбработчика, СписокЗначений, ЭлементФормы);
		
	Возврат Неопределено;
	
КонецФункции

// ПоказатьВыборЭлемента
Функция ПоказатьВыборПериода_КонтурЛогистика(ДиалогРедактированияСтандартногоПериода, 
												КонтекстОбработчика, 
												ИмяОбработчика,
												ПараметрыОбработчика = Неопределено) Экспорт
	
	Если ТипЗНЧ(ДиалогРедактированияСтандартногоПериода) <> Тип("ДиалогРедактированияСтандартногоПериода") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика);
	ДиалогРедактированияСтандартногоПериода.Показать(ОписаниеОбработчика);
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПоказатьЗначение_КонтурЛогистика(Значение,
											КонтекстОбработчика = Неопределено, 
											ИмяОбработчика = Неопределено,
											ПараметрыОбработчика = Неопределено) Экспорт
	
	ОписаниеОбработчика = Неопределено;
	Если Не ИмяОбработчика = Неопределено и Не КонтекстОбработчика = Неопределено Тогда
		ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика);
	КонецЕсли;
	ПоказатьЗначение(ОписаниеОбработчика, Значение); 	
	
КонецПроцедуры

// ПоказатьВводСтроки
Функция ПоказатьВводСтроки_КонтурЛогистика(ИсходнаяСтрока,
									Заголовок = "Введите строку",
									Многострочность = Ложь,
									КонтекстОбработчика, 
									ИмяОбработчика,
									ПараметрыОбработчика = Неопределено) Экспорт
									
	ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика);
	ПоказатьВводСтроки(ОписаниеОбработчика, ИсходнаяСтрока, Заголовок, , Многострочность);
		
	Возврат Неопределено;
	
КонецФункции

// ПоказатьВводЗначения
Функция ПоказатьВводЗначения_КонтурЛогистика(ИсходноеЗначение,
									Заголовок = "Введите дату",
									ТипЗначения = Неопределено,
									КонтекстОбработчика, 
									ИмяОбработчика,
									ПараметрыОбработчика = Неопределено) Экспорт
									
	ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика);
	ПоказатьВводЗначения(ОписаниеОбработчика, ИсходноеЗначение, Заголовок, ТипЗначения);
		                               
	Возврат Неопределено;

КонецФункции

Процедура ОповеститьОбИзмененииДокумента(ДокументСсылка) Экспорт
	
	ОповеститьОбИзменении(ДокументСсылка);
	Оповестить("КонтурЛогистика_ИзменениеДокумента", ДокументСсылка) 
	
КонецПроцедуры

Процедура ВыбратьФайл(ИмяОбработчика,
								КонтекстОбработчика,
								РежимДиалога,
								Заголовок = "",
								НачальноеИмя = "",
								Фильтр = Неопределено,
								МножественныйВыбор = Ложь,
								Расширение = "",
								ДополнительныеПараметры = Неопределено) Экспорт
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПолноеИмяФайла = НачальноеИмя;
	ДиалогВыбораФайла.Заголовок = Заголовок;
	ДиалогВыбораФайла.Фильтр = Фильтр;
	ДиалогВыбораФайла.МножественныйВыбор = МножественныйВыбор;
	ДиалогВыбораФайла.Расширение = Расширение;
	
	ОписаниеОбработчика = Неопределено;
		
	ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ДополнительныеПараметры);
	ДиалогВыбораФайла.Показать(ОписаниеОбработчика);
		
КонецПроцедуры

Функция ПреобразоватьXMLвHTML(ТекстXML) Экспорт
	
	Если ТекстXML = "" Тогда
		Возврат "";
	КонецЕсли;
		
	ТекстHTML = ТекстXML;
	
	Попытка
		ТаблицаСтилейXSL = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ПолучитьТаблицуСтилейXSL();
		#Если ВебКлиент Тогда
			ОписаниеОшибки = "Не поддерживается в веб-клиенте";
		ТекстHTML = "<!DOCTYPE html><html><head></head><body>Не удалось преобразовать в HTML: " + ОписаниеОшибки + "</body></html>"; 
		#Иначе
		Преобразование = Новый ПреобразованиеXSL;
		Преобразование.ЗагрузитьТаблицуСтилейXSLИзСтроки(ТаблицаСтилейXSL);
		ТекстHTML = Преобразование.ПреобразоватьИзСтроки(ТекстXML);
		#КонецЕсли
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ТекстHTML = "<!DOCTYPE html><html><head></head><body>Не удалось преобразовать в HTML: " + ОписаниеОшибки + "</body></html>"; 
		МетрикаОшибка = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка");
		КонтурЛогистика_Метрика.Метрика_Отправить_Ошибку(МетрикаОшибка, "ПреобразоватьXMLвHTML", ОписаниеОшибки);
	КонецПопытки;
	
	Возврат ТекстHTML;
	
КонецФункции

Процедура УстановитьФорматКолонкиКоличества(ТабличнаяЧасть, ИмяРеквизита, Поле) Экспорт
	
	ЗнаковПослеЗапятой = 0;
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		
		Дробь = Строка[ИмяРеквизита] - Цел(Строка[ИмяРеквизита]);
		Дробь = ?(Дробь < 0, -Дробь, Дробь);// 0.123
		Знаков = СтрДлина(Дробь) - 2;
		Знаков = ?(Знаков > 0, Знаков, 0);
		ЗнаковПослеЗапятой = Макс(Знаков, ЗнаковПослеЗапятой);
		
	КонецЦикла;
	
	Поле.Формат = "ЧДЦ=" + ЗнаковПослеЗапятой;
	
КонецПроцедуры

Процедура УстановитьВидимостьКолонкиПоЗаполненностиЗначения(ТабличнаяЧасть, ИмяРеквизита, ЭлементФормы) Экспорт
	
	ЕстьХоть1Значение = Ложь;
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		
		Значение = Строка[ИмяРеквизита];
		Если ЗначениеЗаполнено(Значение) Тогда 
			ЕстьХоть1Значение = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ЭлементФормы.Видимость = ЕстьХоть1Значение;
	
КонецПроцедуры

Процедура ПриОткрытииНаКлиенте(Форма, Отказ) Экспорт
	
	Если Не Форма.Параметры.Свойство("Ключ") Тогда
		КонтурЛогистика_ОбновлениеКлиент.ПроверитьНаличиеУведомлений(Форма);
		Возврат;
	КонецЕсли;
	
	Если Не КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(Форма.Параметры.Ключ)
		И Не КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(Форма.Параметры.Ключ)
		И Не КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЗЗ(Форма.Параметры.Ключ) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.Параметры.Ключ) Тогда
		ДокументОснование = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Форма.Параметры.Ключ, "ДокументОснование");
	Иначе
		ДокументОснование = Форма.Объект.ДокументОснование;
	КонецЕсли;
	
	Если ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1")
		Или ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул3")
		Или ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1")
		Или ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1") Тогда
		
		Если Форма.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен")
			Или Форма.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки")
			Или Форма.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением") Тогда
			
			КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(Форма, ДокументОснование);
		КонецЕсли;
		
	Иначе
		КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(Форма, ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

// ОткрытьФорму
Функция ОткрытьФорму_Подсистемы(ИмяФормы, 
								ПараметрыФормы = Неопределено, 
								ВладелецФормы = Неопределено, 
								КонтекстОбработчика = Неопределено, 
								ИмяОбработчика = Неопределено,
								ПараметрыОбработчика = Неопределено,
								РежимОткрытияОкна = Неопределено,
								Уникальность = Ложь) Экспорт
									
	Если РежимОткрытияОкна = Неопределено Тогда
		РежимОткрытияОкна =	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	               
	ПолноеИмяФормы = ИмяФормы;
		
	ОткрытьФормуПоПолномуИмени(ПолноеИмяФормы, ПараметрыФормы, ВладелецФормы, КонтекстОбработчика, ИмяОбработчика, ПараметрыОбработчика, РежимОткрытияОкна, Уникальность);
	
	Возврат Неопределено;	
	
КонецФункции

Функция ОткрытьФорму_УчетнойСистемы(ИмяФормы, 
								ПараметрыФормы = Неопределено, 
								ВладелецФормы = Неопределено, 
								КонтекстОбработчика = Неопределено, 
								ИмяОбработчика = Неопределено,
								ПараметрыОбработчика = Неопределено,
								РежимОткрытияОкна = Неопределено,
								Уникальность = Ложь) Экспорт
									
	Если РежимОткрытияОкна = Неопределено Тогда
		РежимОткрытияОкна =	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	               
	ПолноеИмяФормы = ИмяФормы;
	
	Попытка
		ЭтоУправляемаяФорма = ТипЗнч(ПолучитьФорму(ПолноеИмяФормы))= Тип("УправляемаяФорма")
	Исключение
		ЭтоУправляемаяФорма = Истина;
	КонецПопытки;
		
	Если ЭтоУправляемаяФорма Тогда
		
		ОткрытьФормуПоПолномуИмени(ПолноеИмяФормы, ПараметрыФормы, ВладелецФормы, КонтекстОбработчика, ИмяОбработчика, ПараметрыОбработчика, РежимОткрытияОкна, Уникальность);
		
	Иначе // Обычная форма
	
		Результат = ОткрытьОбычнуюФорму(ПолноеИмяФормы, ПараметрыФормы, ВладелецФормы, Уникальность);
		Если Не ИмяОбработчика = Неопределено и Не КонтекстОбработчика = Неопределено Тогда 
			Выполнить("КонтекстОбработчика." + ИмяОбработчика + "(Результат, ПараметрыОбработчика);");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции

Процедура ПоказатьФормуНастройки(ИмяНастройки,
									КонтекстОбработчика = Неопределено,
									ИмяОбработчика = Неопределено,
									ПараметрыОбработчика = Неопределено) Экспорт

	ОбщаяНастройка = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьНастройку_(ИмяНастройки);
	
	Если ЗначениеЗаполнено(ОбщаяНастройка) Тогда
		ПоказатьЗначение_КонтурЛогистика(ОбщаяНастройка, КонтекстОбработчика, ИмяОбработчика, ПараметрыОбработчика);
	Иначе
		Предупреждение_КонтурЛогистика("Настройка " + ИмяНастройки + " не найдена",,, КонтекстОбработчика, ИмяОбработчика, ПараметрыОбработчика);
	КонецЕсли;

КонецПроцедуры

Процедура ПерейтиПоКолбасеКТитулу(ФормаТитула, ВыбранныйЭлементФормы) Экспорт

	ТекТитулСсылка = ФормаТитула.Объект.Ссылка;
		
	Если ТипЗнч(ТекТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная") Тогда 
		ТипОткрытогоСейчасТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПустаяСсылка");
	Иначе
		ТипОткрытогоСейчасТитула =  КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(ТекТитулСсылка);
	КонецЕсли;
	
	Если КонтурЛогистика_ОбработкаДокументовКлиент.ЭтоТитулПЛ_5_02(ТекТитулСсылка) Тогда
		
		Если Прав(ВыбранныйЭлементФормы.Имя, 3) = "доп" Тогда 
			НомерТитула = Лев(Прав(ВыбранныйЭлементФормы.Имя, 4),1) + "_5_02";
		Иначе
			НомерТитула = Прав(ВыбранныйЭлементФормы.Имя, 1) + "_5_02";
		КонецЕсли;
		
		ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул" + НомерТитула);
		
	ИначеЕсли КонтурЛогистика_ОбработкаДокументовКлиент.ЭтоТитулПЛ(ТекТитулСсылка) Тогда
		
		Если Прав(ВыбранныйЭлементФормы.Имя, 3) = "доп" Тогда 
			ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул" + Лев(Прав(ВыбранныйЭлементФормы.Имя, 4),1));
		Иначе
			ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул" + Прав(ВыбранныйЭлементФормы.Имя, 1));
		КонецЕсли;
		
	ИначеЕсли КонтурЛогистика_ОбработкаДокументовКлиент.ЭтоТитулЗЗ(ТекТитулСсылка) Тогда
		
		ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул" + Прав(ВыбранныйЭлементФормы.Имя, 1));
			
	// ТРН содержит сложные условия возвратной цепочки	
	ИначеЕсли КонтурЛогистика_ОбработкаДокументовКлиент.ЭтоТитулТРН(ТекТитулСсылка)
		ИЛИ ТипЗнч(ТекТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная") Тогда
		
		Если ТипЗнч(ТекТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная") Тогда 
			ДокументЭТРН = ФормаТитула.Объект.Ссылка;
		Иначе
			ДокументЭТРН = ФормаТитула.Объект.ДокументЭТРН;
		КонецЕсли;
						
		// отдельно обработаем сценарии ввода возвратной цепочки
		Если Найти(ВыбранныйЭлементФормы.Имя,"ПереадресовкаВозврата") > 0 Тогда
			
			ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7");
			НайденнаяПереадресовкаВозврата = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПереадресовкуТрнТ7Возвратную(ДокументЭТРН);
			Если ЗначениеЗаполнено(НайденнаяПереадресовкаВозврата) Тогда 
				КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(НайденнаяПереадресовкаВозврата);
				Если ЗначениеЗаполнено(ФормаТитула.Объект.Ссылка) Тогда 
					ФормаТитула.Закрыть();
				КонецЕсли;
				
			Иначе
				// ввести возвратный Т7 на основании основного Т3 
				НайденныйПрямойТ3 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ3Основную(ДокументЭТРН);
				Если ЗначениеЗаполнено(НайденныйПрямойТ3) Тогда 
					КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(ТипОткрываемогоТитула, НайденныйПрямойТ3, ФормаТитула, Новый Структура("ЭтоВозвратнаяЦепочка", Истина));
				КонецЕсли;
			КонецЕсли;
			Возврат;
			
		ИначеЕсли Найти(ВыбранныйЭлементФормы.Имя,"ПриемкаВозврата") > 0 Тогда
			
			ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3");
			НайденныйВозвратныйТ3 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ3Возвратную(ДокументЭТРН);
			Если ЗначениеЗаполнено(НайденныйВозвратныйТ3) Тогда 
				КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(НайденныйВозвратныйТ3);
				Если ЗначениеЗаполнено(ФормаТитула.Объект.Ссылка) Тогда 
					ФормаТитула.Закрыть();
				КонецЕсли;
				
			Иначе
				// ввести возвратный Т3 на основании возвратного Т7
				НайденныйВозвратныйТ7 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПереадресовкуТрнТ7Возвратную(ДокументЭТРН);
				Если ЗначениеЗаполнено(НайденныйВозвратныйТ7) Тогда 
					КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(ТипОткрываемогоТитула, НайденныйВозвратныйТ7, ФормаТитула, Новый Структура("ЭтоПриемВозврата", Истина));
				КонецЕсли;
			КонецЕсли;
			Возврат;
			
		ИначеЕсли Найти(ВыбранныйЭлементФормы.Имя,"РазгрузкаВозврата") > 0 Тогда
			
			ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4");
			НайденныйВозвратныйТ4 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ4Возвратную(ДокументЭТРН);
			Если ЗначениеЗаполнено(НайденныйВозвратныйТ4) Тогда 
				КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(НайденныйВозвратныйТ4);
				Если ЗначениеЗаполнено(ФормаТитула.Объект.Ссылка) Тогда 
					ФормаТитула.Закрыть();
				КонецЕсли;
				
			Иначе
				// ввести возвратный Т4
				НайденныйВозвратныйТ3 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ3Возвратную(ДокументЭТРН);
				Если ЗначениеЗаполнено(НайденныйВозвратныйТ3) Тогда 
					КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(ТипОткрываемогоТитула, НайденныйВозвратныйТ3, ФормаТитула, Новый Структура("ЭтоПриемВозврата", Истина));
				КонецЕсли;
			КонецЕсли;
			Возврат;
			
		Иначе	
			ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул" + Прав(ВыбранныйЭлементФормы.Имя, 1));
		КонецЕсли;
		
	КонецЕсли;
	
	Если КонтурЛогистика_ОбработкаДокументовКлиент.ЭтоТитулТРН(ТекТитулСсылка)
		И Не КонтурЛогистика_ОбщегоНазначенияСервер.ОткрыватьТитулЧерезКолбасу(ФормаТитула.Объект.ДокументЭТРН, ТипОткрываемогоТитула, ТекТитулСсылка) Тогда
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("ВыполнитьОбмен", "Выполнить обмен");
		Кнопки.Добавить("Закрыть", "Закрыть");
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаВыполнитьОбмен", КонтурЛогистика_ОбщегоНазначенияКлиент);
		ПоказатьВопрос(Оповещение, "Обмен про предыдущему титулу до конца не выполнен", Кнопки, , "ВыполнитьОбмен");
		
		Возврат;
		
	КонецЕсли;
			
	Если ТипОткрываемогоТитула <> ТипОткрытогоСейчасТитула 
		Или ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3")
		Или ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4")
		Или ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7")
		Или ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2")
		Или ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6")
		Или ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02")
		Или ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02")
		Тогда
		
		Если КонтурЛогистика_ОбработкаДокументовКлиент.ЭтоТитулПЛ(ТекТитулСсылка) Тогда 
			
			Если ТипОткрытогоСейчасТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1") Тогда
				Титул1 = ФормаТитула.Объект.Ссылка;
			Иначе
				Титул1 = ФормаТитула.Объект.Титул1;
			КонецЕсли;
			
			Если ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2")
				Или ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6") Тогда
				
				Если Прав(ВыбранныйЭлементФормы.Имя, 3) = "доп" Тогда
					Водитель = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаСсылки(Титул1, "Водитель2");
				Иначе
					Водитель = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаСсылки(Титул1, "Водитель");
				КонецЕсли;
				
				НайденныйМедосмотр = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПЛМедосмотрВодителя(Титул1, ТипОткрываемогоТитула, Водитель);
				
				Если ЗначениеЗаполнено(НайденныйМедосмотр) Тогда 
					Если ТекТитулСсылка <> НайденныйМедосмотр Тогда 
						КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(НайденныйМедосмотр);
						Если ЗначениеЗаполнено(ФормаТитула.Объект.Ссылка) Тогда 
							ФормаТитула.Закрыть();
						КонецЕсли;
					КонецЕсли;
				Иначе
					
					// Если у нас внешний медик, то мы не найдем титул на отказ, тогда и перехода нет
					Если Лев(ВыбранныйЭлементФормы.Имя, 6) = "Пункт2"
						И ВыбранныйЭлементФормы.Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктОтказ Тогда
						Возврат;
					КонецЕсли;
					
					ДопПараметрыДействия = Новый Структура("Водитель", Водитель);
					Если ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2") Тогда 
						КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(ТипОткрываемогоТитула, Титул1, ФормаТитула, ДопПараметрыДействия); 
					ИначеЕсли ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6") Тогда
						Титул5 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5"), Титул1);
						Если ЗначениеЗаполнено(Титул5) Тогда 
							КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(ТипОткрываемогоТитула, Титул5, ФормаТитула, ДопПараметрыДействия); 
						Иначе
							Предупреждение_КонтурЛогистика("Для ввода послесменного медосмотра требуется титул одометра при возврате");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			Иначе;
				
				КонтурЛогистика_ОбщегоНазначенияКлиент.НайтиИОткрытьДругойТитулВместоТекущего(Титул1, ТипОткрываемогоТитула, ФормаТитула, ТекТитулСсылка);
				
			КонецЕсли;
			
		ИначеЕсли КонтурЛогистика_ОбработкаДокументовКлиент.ЭтоТитулПЛ_5_02(ТекТитулСсылка) Тогда 
			
			Если ТипОткрытогоСейчасТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02") Тогда
				Титул1 = ФормаТитула.Объект.Ссылка;
			Иначе
				Титул1 = ФормаТитула.Объект.Титул1;
			КонецЕсли;
			
			Если ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02")
				Или ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02") Тогда
				
				Если Прав(ВыбранныйЭлементФормы.Имя, 3) = "доп" Тогда
					Водитель = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаСсылки(Титул1, "Водитель2");
				Иначе
					Водитель = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаСсылки(Титул1, "Водитель");
				КонецЕсли;
				
				НайденныйМедосмотр = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПЛМедосмотрВодителя(Титул1, ТипОткрываемогоТитула, Водитель);
				
				Если ЗначениеЗаполнено(НайденныйМедосмотр) Тогда 
					Если ТекТитулСсылка <> НайденныйМедосмотр Тогда 
						КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(НайденныйМедосмотр);
						Если ЗначениеЗаполнено(ФормаТитула.Объект.Ссылка) Тогда 
							ФормаТитула.Закрыть();
						КонецЕсли;
					КонецЕсли;
				Иначе
					
					// Если у нас внешний медик, то мы не найдем титул на отказ, тогда и перехода нет
					Если Лев(ВыбранныйЭлементФормы.Имя, 6) = "Пункт2"
						И ВыбранныйЭлементФормы.Картинка = БиблиотекаКартинок.КонтурЛогистика_ПунктОтказ Тогда
						Возврат;
					КонецЕсли;
					
					ДопПараметрыДействия = Новый Структура("Водитель", Водитель);
					Если ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02") Тогда 
						КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(ТипОткрываемогоТитула, Титул1, ФормаТитула, ДопПараметрыДействия); 
					ИначеЕсли ТипОткрываемогоТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02") Тогда
						Титул4 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(ПредопределенноеЗначение(
							"Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02"), Титул1);
						Если ЗначениеЗаполнено(Титул4) Тогда 
							КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(ТипОткрываемогоТитула, Титул4, ФормаТитула, ДопПараметрыДействия); 
						Иначе
							Предупреждение_КонтурЛогистика("Для ввода послесменного медосмотра требуется титул одометра при возврате");
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе;
				
				КонтурЛогистика_ОбщегоНазначенияКлиент.НайтиИОткрытьДругойТитулВместоТекущего(Титул1, ТипОткрываемогоТитула, ФормаТитула, ТекТитулСсылка);
				
			КонецЕсли;
				
		ИначеЕсли ТипЗнч(ТекТитулСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная") Тогда
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.НайтиИОткрытьДругойТитулВместоТекущего(ТекТитулСсылка, ТипОткрываемогоТитула, ФормаТитула, ТекТитулСсылка);
			
		ИначеЕсли КонтурЛогистика_ОбработкаДокументовКлиент.ЭтоТитулТРН(ТекТитулСсылка) Тогда
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.НайтиИОткрытьДругойТитулВместоТекущего(ФормаТитула.Объект.ДокументЭТРН, ТипОткрываемогоТитула, ФормаТитула, ТекТитулСсылка);
			
		ИначеЕсли КонтурЛогистика_ОбработкаДокументовКлиент.ЭтоТитулЗЗ(ТекТитулСсылка) Тогда
			
			Если ТипОткрытогоСейчасТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1") Тогда
				Титул1 = ФормаТитула.Объект.Ссылка;
			Иначе
				Титул1 = ФормаТитула.Объект.Титул1;
			КонецЕсли;
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.НайтиИОткрытьДругойТитулВместоТекущего(Титул1, ТипОткрываемогоТитула, ФормаТитула, ТекТитулСсылка);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗакрытияВопросаВыполнитьОбмен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "ВыполнитьОбмен" Тогда
		
		КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеВыполнениеСотслеживаниемВНовойФорме("КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьОбмен",
				"Выполнение обмена колбаса",
				Новый Структура,
				"Выполнение обмена",
				Истина,
				Истина);		
		
	КонецЕсли;

КонецПроцедуры

Процедура НайтиИОткрытьДругойТитулВместоТекущего(ГлавныйДокумент, ТипТитула, ЗакрываемаяФорма, ТекущийТитул) Экспорт
	
	ДопПараметрыДействия = Новый Структура;
	
	Если ТипТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3") Тогда
		
		НайденныйДокумент = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ3Основную(ГлавныйДокумент);
		ДопПараметрыДействия.Вставить("ЭтоПриемВозврата", Ложь);
		
	ИначеЕсли ТипТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4") Тогда
		
		НайденныйДокумент = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ4Основную(ГлавныйДокумент);
		ДопПараметрыДействия.Вставить("ЭтоПриемВозврата", Ложь);
		
	ИначеЕсли ТипТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7") Тогда
		
		НайденныйДокумент = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПереадресовкуТрнТ7Основную(ГлавныйДокумент);
		ДопПараметрыДействия.Вставить("ЭтоВозвратнаяЦепочка", Ложь);
		
	Иначе
		
		НайденныйДокумент = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(ТипТитула, ГлавныйДокумент);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденныйДокумент) Тогда
		
		Если ТекущийТитул <> НайденныйДокумент Тогда 
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(НайденныйДокумент);
			Если ЗначениеЗаполнено(ЗакрываемаяФорма.Объект.Ссылка) Тогда 
				ЗакрываемаяФорма.Закрыть();
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(ТекущийТитул) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Для ввода нового титула требуется сначала записать текущий открытый");
			Возврат;
		КонецЕсли;
		
		Попытка
			
			// Если отказ, то не открываем
			СостояниеОтказа = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостояниеОтказа();
			ТекущийСтатусДО = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьСтатусДО(ГлавныйДокумент);
			Если СостояниеОтказа.Найти(ТекущийСтатусДО) <> Неопределено Тогда
				ТекстПредупреждения = "Для ввода титула: " + ТипТитула + " не подходящий статус ДО - " + ТекущийСтатусДО;
				КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения);
				Возврат;
			КонецЕсли;
			
			// Требуется получить актуальный предыдущий титул для вводимого.
			ТипНужногоПредыдущегоТитула = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПредыдущийПоЦепочкеТипЛогистика(ТипТитула);
			НайденныйПредыдущийТитул = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(ТипНужногоПредыдущегоТитула, ГлавныйДокумент);
			
			Если ТипТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4") Тогда  
				
				// для отправки Т4 необходимо, чтобы все предыдущие титулы были отправлены
				
				ТипТ2 = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2");
				ТитулыТ2 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиОтправленныеПолученныеТитулыГлавногоПоТипу(ТипТ2, ГлавныйДокумент, Истина);
				ЕстьТ2 = ТитулыТ2.Количество() > 0;
				
				ТипТ3 = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3");
				ТитулыТ3 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиОтправленныеПолученныеТитулыГлавногоПоТипу(ТипТ3, ГлавныйДокумент, Истина);
				ЕстьТ3 = ТитулыТ3.Количество() > 0;				
				
				Если ЕстьТ2 И ЕстьТ3 Тогда
					КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(ТипТитула, ТитулыТ3[0], ЗакрываемаяФорма, ДопПараметрыДействия);
				Иначе
					
					Предупреждение = "Для ввода титула: " + ТипТитула;
					Если Не ЕстьТ2 И Не ЕстьТ3 Тогда
						Предупреждение = Предупреждение +" требуется титул " + ТипТ2 + "(не найден) и титул " + ТипТ3 + "(не найден)";
					Иначе
						Предупреждение = Предупреждение + ?(ЕстьТ2, " требуется титул " + ТипТ3 + "(не найден)", " требуется титул " + ТипТ2 + "(не найден)");	
					КонецЕсли;
					
					КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(Предупреждение);
					
				КонецЕсли;
				
			Иначе	
				Если ЗначениеЗаполнено(НайденныйПредыдущийТитул) Тогда 
					// можем ввести прямо сейчас? требуется ли проверить что есть настройка конвертации?
					// в текущем исполнении просто пробуем через попытку - там или исключение приедет или валидатор запретит, в будущем стоит подстелить соломку пообстоятельней
					КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(ТипТитула, НайденныйПредыдущийТитул, ЗакрываемаяФорма, ДопПараметрыДействия);				
				Иначе
					КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Для ввода титула: " + ТипТитула + " требуется титул " + ТипНужногоПредыдущегоТитула + "(не найден)");
				КонецЕсли;
			КонецЕсли;
			
		Исключение
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Проблема при создании титула: " + Символы.ПС + Символы.ПС + ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УбратьПризнакНашПриСменеОкружения() Экспорт
	
	ВсеНашиОрганизации = КонтурЛогистика_ОбщегоНазначенияСервер.ВсеНашиОрганизации();
	КолвоОрг = ВсеНашиОрганизации.Количество();
	
	Если КолвоОрг > 0 Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВсеНашиОрганизации", ВсеНашиОрганизации);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросУбратьПризнакНашПриСменеОкруженияЗавершение", КонтурЛогистика_ОбщегоНазначенияКлиент, ДополнительныеПараметры);
		
		Если КолвоОрг % 10 = 1 И КолвоОрг <> 11 Тогда
			ТекстВопроса = "Убрать признак ""Наш"" у " + Строка(КолвоОрг) + " организации?";
		Иначе
			ТекстВопроса = "Убрать признак ""Наш"" у " + Строка(КолвоОрг) + " организаций?";
		КонецЕсли;
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВопросУбратьПризнакНашПриСменеОкруженияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Или Результат = КодВозвратаДиалога.Отмена Тогда
        Возврат;
    КонецЕсли;

    КонтурЛогистика_ОбщегоНазначенияСервер.УбратьПризнакНашУОрганизаций(ДополнительныеПараметры.ВсеНашиОрганизации);
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ОчиститьВсеАвторизации();
	
	Оповестить("ПеречитатьМоиОрганизацииСтартовыйПомошник");

КонецПроцедуры

// Выбор единиц измерения, Характеристик

Функция ЕдинственнаяЕдиницаИзмеренияНоменклатуры(Номенклатура) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	КонтурЛогистика_ОбщегоНазначенияСервер.ЗаполнитьСписокЕдиницИзмерения(Номенклатура, СписокВыбора);
	
	Если СписокВыбора.Количество() = 1 Тогда 
		Возврат СписокВыбора[0].Значение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЕдиницаИзмеренияНачалоВыбора(Номенклатура, Элемент, Форма, СтандартнаяОбработка, ПараметрыОбработчика = Неопределено) Экспорт
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ОпределитьКонфигурацию();
	
	Если Лев(ИмяКонфигурации, 2) = "КЛ" 
		ИЛИ Лев(ИмяКонфигурации, 2) = "УТ"
		ИЛИ Лев(ИмяКонфигурации, 3) = "УПП"
		ИЛИ Лев(ИмяКонфигурации, 2) = "БП"  
		ИЛИ Лев(ИмяКонфигурации, 2) = "КА"  
		ИЛИ Лев(ИмяКонфигурации, 2) = "УФ" 
		ИЛИ Лев(ИмяКонфигурации, 3) = "ERP" 
		ИЛИ Лев(ИмяКонфигурации, 4) = "УС_3" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(Номенклатура) Тогда 
			
			СписокВыбора = Новый СписокЗначений;
			КонтурЛогистика_ОбщегоНазначенияСервер.ЗаполнитьСписокЕдиницИзмерения(Номенклатура, СписокВыбора);
			Если СписокВыбора.Количество() = 0 Тогда 
				КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Не удалось найти ни одной единицы измерения для этой номенклатуры.");
			Иначе
				КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьИзСписка_КонтурЛогистика(СписокВыбора, Элемент, Форма, "ЕдиницаИзмеренияНачалоВыбораЗавершение", ПараметрыОбработчика);
			КонецЕсли;
		
		Иначе
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Сначала необходимо выбрать номенклатуру");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ХарактеристикаНачалоВыбора(Номенклатура, текХарактеристика, Элемент, Форма, СтандартнаяОбработка) Экспорт
	
	ИмяКонфигурации1С = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ОпределитьКонфигурацию();
	
	СтандартнаяОбработка = Ложь;
	
	ИмяСправочникаХарКи = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ПолучитьИмяСправочникаСущности("Характеристика");
	НастроеныИВключены = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ИспользуютсяХарактеристики() И ИмяСправочникаХарКи <> Неопределено;

	Если Не НастроеныИВключены = Истина Тогда 
		Возврат;		
	КонецЕсли;
	
	//ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	ПараметрыВыбора = Новый Структура;
	//ДополнительныеПараметры = Новый Структура("ТекущиеДанные", ТекущиеДанные);
	
	ПараметрыВыбора.Вставить("ТекущийЭлемент"  , текХарактеристика);
	ПараметрыВыбора.Вставить("Номенклатура"    , Номенклатура);
		
	Если ИмяКонфигурации1С = "УФ_УНФ" 
		ИЛИ ИмяКонфигурации1С = "УТ"
		ИЛИ ИмяКонфигурации1С = "УПП" 
		ИЛИ ИмяКонфигурации1С = "КЛ"
		ИЛИ ИмяКонфигурации1С = "КА"
		
		Тогда
		
		ОтборХарактеристик = Новый Структура;
		ОтборХарактеристик.Вставить("Владелец",Номенклатура);
		ПараметрыВыбора.Вставить("Отбор"  , ОтборХарактеристик);
		ПараметрыВыбора.Вставить("ТекущаяСтрока"  , текХарактеристика);
		
	ИначеЕсли ИмяКонфигурации1С = "УФ_УТ" Тогда
		
		ОтборХарактеристик = Новый Структура;
		ОтборХарактеристик.Вставить("Владелец", Номенклатура);
		
		ПараметрыВыбора.Вставить("СтрокаПоиска", "");
		ПараметрыВыбора.Вставить("Отбор", ОтборХарактеристик);
		ПараметрыВыбора.Вставить("ТекущаяСтрока", текХарактеристика);
		
	КонецЕсли;
	
	СписокВыбора = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьСписокВыбораСправочника(ИмяСправочникаХарКи, ПараметрыВыбора);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьИзСписка_КонтурЛогистика(СписокВыбора, Элемент, Форма, "ХарактеристикаНачалоВыбораЗавершение");
	
КонецПроцедуры

// см. описание КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика
Функция ЗначенияРеквизитовОбъекта_КонтурЛогистика(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(Ссылка, Реквизиты, ВыбратьРазрешенные);	
	
КонецФункции

// см. описание КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика
Функция ЗначениеРеквизитаОбъекта_КонтурЛогистика(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь) Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);	
	
КонецФункции 

// Представление данных границы синхронизации
//
// Параметры:
//  ДанныеГраницы	 - Структура	 - см. Справочники.КонтурЛогистика_ОрганизацииДиадок.ПолучитьМинимальнуюДатуГраницыСинхронизации().
// 
// Возвращаемое значение:
//  Структура - 
//    * Видимость - Булево - Признак видимости элемента.
//    * Заголовок - Строка - Заголовок элемента.
//    * ЦветТекста - Цвет - Цвет еткста элемента.
//
Функция ПредставлениеДанныхГраницыСинхронизации(ДанныеГраницы) Экспорт
	
	ПредставлениеДанных = Новый Структура;
	ПредставлениеДанных.Вставить("Видимость", Ложь);
	ПредставлениеДанных.Вставить("Заголовок", "Обмен не выполнялся");
	ПредставлениеДанных.Вставить("ЦветТекста", Новый Цвет(255, 0, 0));
	
	Если ДанныеГраницы = Неопределено Тогда
		
		// TODO отправлять метрику
		Возврат ПредставлениеДанных;
		
	КонецЕсли;
	
	ДатаГраницыСинхронизацииМСК = ДанныеГраницы.ДатаГраницыСинхронизации;
	ОрганизацияГраницыСинхронизации = ДанныеГраницы.Организация;
	
	Если Не ЗначениеЗаполнено(ДатаГраницыСинхронизацииМСК) Тогда 
		
		ПредставлениеДанных.Видимость = Истина;
		ПредставлениеДанных.Заголовок = "Обмен не выполнялся";
		
	Иначе
		
		ТекМоментМСК = КонтурЛогистика_ОбщегоНазначенияСервер.ТекущийМоментВремениМСК();
		ДатаГраницыСинхронизацииТек = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ВремяВТекущемПоясеИзМСК(ДатаГраницыСинхронизацииМСК);
		ПрошлоВремени = ТекМоментМСК - ДатаГраницыСинхронизацииМСК;
		
		Если ПрошлоВремени > 1200 Тогда
			
			ПредставлениеДанных.ЦветТекста = Новый Цвет(255, 0, 0);
			
			Дней = Окр(ПрошлоВремени / 86400);
			Часов = Окр(ПрошлоВремени / 3600);
			Минут = Окр(ПрошлоВремени / 60);
			Если Дней > 0 Тогда
				Срок = "" + Дней + " " + КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьДниВСклонении(Дней);
				ТекстПредупрежденияОбмена = "Обмен давно не выполнялся (" + Срок + ")";
			ИначеЕсли Часов > 0 Тогда
				Срок = "" + Часов + " " + КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьЧасыВСклонении(Часов);
				ТекстПредупрежденияОбмена = "Обмен давно не выполнялся (" + Срок + ")";
			Иначе
				Срок = "" + Минут + " минут";
				ТекстПредупрежденияОбмена = "Обмен не выполнялся " + Срок + "";
				ПредставлениеДанных.ЦветТекста = Новый Цвет(51, 51, 51);
			КонецЕсли;
			
			ПредставлениеДанных.Видимость = Истина;
			ПредставлениеДанных.Заголовок = ТекстПредупрежденияОбмена;
			
		Иначе
			
			ПредставлениеДанных.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПредставлениеДанных;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////
// Вспомогательные

Процедура ПерейтиПоСсылке(СсылкаПерехода) Экспорт
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82()
		Или КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоРежимСовместимости_8_2() Тогда
		
		ЗапуститьПриложение(СсылкаПерехода);
	Иначе
		ПерейтиПоНавигационнойСсылке(СсылкаПерехода);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуПоПолномуИмени(ПолноеИмяФормы,
										ПараметрыФормы=Неопределено,
										ВладелецФормы=Неопределено,
										КонтекстОбработчика=Неопределено,
										ИмяОбработчика=Неопределено,
										ПараметрыОбработчика=Неопределено,
										РежимОткрытияОкна = Неопределено,
										Уникальность = Ложь)
	
	//@skip-warning
	ОписаниеОбработчика = Неопределено;
	
	// не компилируем этот код на старых платформах - поэтому через Выполнить
	Если Не ИмяОбработчика = Неопределено и Не КонтекстОбработчика = Неопределено Тогда
		ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика);
	КонецЕсли;
	
	ОткрытьФорму(ПолноеИмяФормы, ПараметрыФормы, ВладелецФормы, Уникальность, , , ОписаниеОбработчика, РежимОткрытияОкна);
	
КонецПроцедуры

Функция ОткрытьОбычнуюФорму(ПолноеИмяФормы,
							ПараметрыФормы = Неопределено,
							ВладелецФормы  = Неопределено,
							Уникальность = Ложь)
	
	Если ПараметрыФормы <> Неопределено И ПараметрыФормы.Свойство("Отбор") Тогда		
		
		ФормаВыбора = ПолучитьФорму(ПолноеИмяФормы,, ВладелецФормы, Уникальность);		
		
		Для Каждого Элемент Из ПараметрыФормы.Отбор Цикл
			
			ЭлементОтбораФормы = ФормаВыбора.Отбор.Найти(Элемент.Ключ);
			
			Если ЭлементОтбораФормы <> Неопределено Тогда   
				
				Если ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
					СПЗначений = Новый СписокЗначений;
					СПЗначений.ЗагрузитьЗначения(Элемент.Значение);
				
					ЭлементОтбораФормы.ВидСравнения  = ВидСравнения.ВСписке;
					ЭлементОтбораФормы.Значение		 = СПЗначений;		
					ЭлементОтбораФормы.Использование = Истина;	
				
				Иначе
					
					ЭлементОтбораФормы.Значение		 = Элемент.Значение;		
					ЭлементОтбораФормы.Использование = Истина;
								
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат ФормаВыбора.ОткрытьМодально();
		
	Иначе				
		
		ПараметрыФормы = Новый Структура;
		
		Возврат ПолучитьФорму(ПолноеИмяФормы, ПараметрыФормы, ВладелецФормы, Уникальность, ).ОткрытьМодально();	
		
	КонецЕсли;
		
КонецФункции

#Область Аутентификация

Процедура ПолучениеСессии(Оповещение, ОтборСессий = Неопределено) Экспорт
	
	Аутентификатор = КлиентАутентификации(ОтборСессий);
	Аутентификатор.ОткрытьАутентификатор(Оповещение);
	
КонецПроцедуры

Процедура ОбновитьСессии(Оповещение, ОтборСессий = Неопределено) Экспорт
	
	Аутентификатор = КлиентАутентификации(ОтборСессий);
	Аутентификатор.НачатьОбновлениеСессии(Оповещение);
	
КонецПроцедуры

Процедура ЗавершитьСессию(ОтборСессий) Экспорт
	
	Аутентификатор = КлиентАутентификации(ОтборСессий);
	Аутентификатор.ЗавершитьСессию();
	
КонецПроцедуры

Функция КлиентАутентификации(Знач ОтборСессий = Неопределено)

	ИспользоватьТестовыйСерверДиадок = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"ИспользоватьТестовыйСерверДиадок");
	КонфигурацияПриложения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонфигурацияПриложения(ИспользоватьТестовыйСерверДиадок);
	КонфигурацияПровайдера = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонфигурацияПровайдера(ИспользоватьТестовыйСерверДиадок);
	Если ОтборСессий = Неопределено Тогда
		Отбор = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОтборСессий();
	Иначе
		Отбор = ОтборСессий;
	КонецЕсли;
	
	Результат = ПолучитьФорму("Обработка.КонтурЛогистика_Аутентификатор.Форма.Клиент");
	Результат.УстановитьКонфигурациюПриложения(КонфигурацияПриложения);
	Результат.УстановитьКонфигурациюПровайдера(КонфигурацияПровайдера);
	Результат.УстановитьХранилищеСессий("КонтурЛогистика_Аутентификация");
	Результат.УстановитьОтборСессий(Отбор);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти