
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументУчетнойСистемы 	= Параметры.ДокументУчетнойСистемы;
	ПутьПеревозчика 		= Параметры.ПутьПеревозчика;
	
	Элементы.ПутьПеревозчика.СписокВыбора.ЗагрузитьЗначения(Параметры.СписокВыбораРеквизитов);
	
	ВидимостьКнопок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьНеУказан(Команда)
	Закрыть("");
КонецПроцедуры

&НаКлиенте
Процедура ПутьУказан(Команда)
	
	Если Не ЗначениеЗаполнено(ПутьПеревозчика) Тогда 
		Сообщить("Укажите путь перевозчика.");
	КонецЕсли;	
		
	Закрыть(ПутьПеревозчика);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьКнопок(Форма)

	Форма.Элементы.ПутьНеУказан.Видимость 	= Форма.ПутьПеревозчика = "";
	Форма.Элементы.отмена.Видимость 		= Не Форма.ПутьПеревозчика = "";

КонецПроцедуры

&НаКлиенте
Процедура ПутьПеревозчикаПриИзменении(Элемент)
	ВидимостьКнопок(ЭтаФорма);
КонецПроцедуры
