#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДоступныеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция выполняет заполнение списка значений 
// данных выбора.
//
Функция ПолучитьДоступныеЗначения()
	
	ДоступныеЗначения = Новый СписокЗначений;
	УправлениеТорговлей = ПолучитьФункциональнуюОпцию("УправлениеТорговлей");

	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВариантыОформленияДокументовПоУслугам.ЗначенияПеречисления Цикл
		Если УправлениеТорговлей Тогда
			Если ЗначениеПеречисления.Имя = "ПоступлениеУслугСторнируется" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		Ссылка = Перечисления.ВариантыОформленияДокументовПоУслугам[ЗначениеПеречисления.Имя];

		ДоступныеЗначения.Добавить(Ссылка, ЗначениеПеречисления.Синоним);
	КонецЦикла;
	
	Возврат ДоступныеЗначения;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли