// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение:
//  см. УправлениеКонтактнойИнформацией.ПараметрыАдреса
//
Функция ПараметрыАдреса() Экспорт
	
	Возврат УправлениеКонтактнойИнформацией.ПараметрыАдреса();
	
КонецФункции

// Возвращаемое значение:
//  см. ДоставкаТоваров.ПроверитьВозможностьПереходаНаДоставку25
//
Функция ПроверитьВозможностьПереходаНаДоставку25() Экспорт
	
	Возврат ДоставкаТоваров.ПроверитьВозможностьПереходаНаДоставку25();
	
КонецФункции

// Возвращаемое значение:
//  см. ДоставкаТоваров.ДанныеЗаданийНаПеревозкуБезОтметкиОДоставке
//
Функция ДанныеЗаданийНаПеревозкуБезОтметкиОДоставке() Экспорт
	
	Возврат ДоставкаТоваров.ДанныеЗаданийНаПеревозкуБезОтметкиОДоставке();
	
КонецФункции

#Область Доставка20

// Параметры:
//  Адрес - Строка 
// 
// Возвращаемое значение:
//  Произвольный, Неопределено -
//
Функция ПолучитьУдалитьИзВременногоХранилища(Адрес) Экспорт
	
	Возврат ДоставкаТоваров.ПолучитьУдалитьИзВременногоХранилища(Адрес);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Серверный обработчик события ОбработкаПолученияДанныхВыбора справочника ТранспортныеСредства.
//
Процедура ТранспортныеСредстваОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаПоиска = Параметры.СтрокаПоиска; // Строка
	
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		
		ДанныеВыбора = Новый СписокЗначений;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТранспортныеСредства.Ссылка КАК Значение,
		|	ПРЕДСТАВЛЕНИЕ(ТранспортныеСредства.Ссылка) КАК Представление
		|ИЗ
		|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
		|ГДЕ
		|	ТранспортныеСредства.Код ПОДОБНО &Текст
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		Запрос.УстановитьПараметр("Текст", "%" + СокрЛП(СтрокаПоиска) + "%");
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Значение, Выборка.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
