Функция ЗначениеДляXDTO(Ссылка) Экспорт

	Если Ссылка = _01 Тогда 
		Результат = "01";
	ИначеЕсли Ссылка = _02 Тогда 
		Результат = "02";
	ИначеЕсли Ссылка= _03 Тогда 
		Результат = "03";
	Иначе
		
		ВызватьИсключение "Для заполнения в xml передано неверное значение метода определения массы: " + Ссылка;
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции 

Функция ЗначениеИзXDTO(Строка, ЭтоТитул1 = Истина) Экспорт
	
	Результат = ПустаяСсылка();
	
	Если Строка = "01" Тогда 
		Результат = _01;
	ИначеЕсли Строка = "02" Тогда 
		Результат = _02;
	ИначеЕсли Строка= "03" Тогда 
		Результат = _03;
	Иначе
		
		Результат = ПустаяСсылка();
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстОшибки = "Для Титула 1 в xml передано неверное значение метода определения массы: " + Строка;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
