#Область ПрограммныйИнтерфейс

Функция ИдентификаторПользователяИБ() Экспорт

	ИдентификаторПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
    АнонимныйПользовательИБ = Строка(ИдентификаторПользователяИБ) = "071523a4-516f-4fce-ba4b-0d11ab7a1893";
    Если АнонимныйПользовательИБ Тогда
        ИдентификаторПользователяИБ = ИдентификаторПользователяОС();
    КонецЕсли;
 
    Возврат ИдентификаторПользователяИБ;
	
КонецФункции

Функция IDСессии() Экспорт

	Возврат КонтурЛогистика_МетрикаКлиентСервер.НовыйУИД();

КонецФункции

Функция ОписаниеОС() Экспорт

	СисИнфо = Новый СистемнаяИнформация();
	ТипОС = НРег(СисИнфо.ТипПлатформы);

	Если Найти(ТипОС, НРег("Linux")) > 0 Тогда
		Name = "Linux";
	ИначеЕсли Найти(ТипОС, НРег("MacOS")) > 0 Тогда
		Name = "MacOS";
	ИначеЕсли Найти(ТипОС, НРег("Windows")) > 0 Тогда
		Name = "Windows";
	КонецЕсли;

	Если Найти(ТипОС, "64") > 0 Тогда
		BitSet = "x64";
	Иначе
		BitSet = "x86";
	КонецЕсли;

	Результат = Новый Структура();
	Результат.Вставить("Name", 		Name);
	Результат.Вставить("BitSet", 	BitSet);
	Результат.Вставить("Version", 	"1.0.0");

	Возврат Результат;

КонецФункции

Функция ОписаниеБраузера() Экспорт

	Результат = Новый Структура();
	СисИнфо = Новый СистемнаяИнформация();

	UserAgent = СисИнфо.ИнформацияПрограммыПросмотра;
	Если ЗначениеЗаполнено(UserAgent) Тогда
		Результат.Вставить("UserAgent", UserAgent);
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ОписаниеПрограммы() Экспорт

	СисИнфо = Новый СистемнаяИнформация();

	Если Найти(СисИнфо.ТипПлатформы, "64") > 0 Тогда
		BitSet = "x64";
	Иначе
		BitSet = "x86";
	КонецЕсли;

	ТекущийРежимЗапуска	 = ТекущийРежимЗапуска();
	RunMode 	         = ?(ТекущийРежимЗапуска = Неопределено, "Регламентное задание", Строка(ТекущийРежимЗапуска));

	Результат = Новый Структура();
	Результат.Вставить("Name", 					"1С:Предприятие 8 " + BitSet);
	Результат.Вставить("Configuration", 		Метаданные.Имя);
	Результат.Вставить("ConfigurationVersion", 	КонтурЛогистика_Метрика.ПреобразоватьВерсиюВСемантик(Метаданные.Версия));
	Результат.Вставить("RunMode", 				RunMode);
	Результат.Вставить("Version", 				КонтурЛогистика_Метрика.ПреобразоватьВерсиюВСемантик(СисИнфо.ВерсияПриложения));

	Возврат Результат;

КонецФункции

Функция ОписаниеАппаратногоОбеспечения() Экспорт

	СисИнфо = Новый СистемнаяИнформация();
	TotalMemoryGb = Окр(СисИнфо.ОперативнаяПамять / 1000);

	Результат = Новый Структура();
	Результат.Вставить("TotalMemoryGb", TotalMemoryGb);

	Возврат Результат;

КонецФункции

Функция РазобратьСтрокуСоединенияИнформационнойБазы() Экспорт
	
	Результат = Новый Структура;
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	Если Найти(ВРег(СтрокаСоединения),"FILE")>0 Тогда
		Результат.Вставить("ТипСоединения","Файловая");
		КаталогБазы = Сред(СтрокаСоединения,7);
		ПозицияРазделителя = Найти(КаталогБазы,"""");
		
		Если ПозицияРазделителя=0 Тогда
			Сообщить("Не удалось разобрать путь к базе:" + СтрокаСоединенияИнформационнойБазы());	
			Возврат Результат;
		КонецЕсли;	
		
		КаталогБазы = Лев(КаталогБазы,ПозицияРазделителя-1);
		Если Прав(КаталогБазы,1)<>"\" Тогда 
			КаталогБазы = КаталогБазы+"\"; 
		КонецЕсли;
		
		Результат.Вставить("КаталогБазы",КаталогБазы);
		
	ИначеЕсли Найти(ВРег(СтрокаСоединения),"SRVR")>0 Тогда
		Результат.Вставить("ТипСоединения","Серверная");
		СтрокаСоединения = Сред(СтрокаСоединения,7);
		ПозицияРазделителя = Найти(СтрокаСоединения,";");
		
		Если ПозицияРазделителя=0 Тогда
			Сообщить("Не удалось разобрать путь к базе:"+СтрокаСоединенияИнформационнойБазы());	
			Возврат Результат;
		КонецЕсли;	
		
		ИмяСервера = Лев(СтрокаСоединения,ПозицияРазделителя-2);
		
		ИмяБазы = Сред(СтрокаСоединения,ПозицияРазделителя+6);
		ПозицияРазделителя = Найти(ИмяБазы,";");
		
		Если ПозицияРазделителя=0 Тогда
			Сообщить("Не удалось разобрать путь к базе:"+СтрокаСоединенияИнформационнойБазы());	
			Возврат Результат;
		КонецЕсли;	
		
		ИмяБазы = Лев(ИмяБазы,ПозицияРазделителя-2);
		
		Результат.Вставить("ИмяСервера",ИмяСервера);
		Результат.Вставить("ИмяБазы",ИмяБазы);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекПользовательБазы() Экспорт
	
	Попытка
		ПользовательБазы = Неопределено;
		Выполнить("ПользовательБазы = ПользователиИнформационнойБазы.ТекущийПользователь()");
		ПользовательБазы = Строка(ПользовательБазы);
	Исключение
		ПользовательБазы = "НеОпределен";
	КонецПопытки;
	
	Возврат ПользовательБазы;
	
КонецФункции

Функция ИнфоОПроцессоре() Экспорт
	
	СИ = Новый СистемнаяИнформация;
	
	Возврат СИ.Процессор;
	
КонецФункции

Функция ВерсияБСП() Экспорт
	
	ВерсияБСП = Неопределено;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные("ОбщиеМодули.СтандартныеПодсистемыСервер") Тогда
		
		Попытка
			
			Выполнить("ВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки()");
			
		Исключение
			
			ВерсияБСП = "0.0.0"; 
						
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ВерсияБСП;

КонецФункции

Функция ИнфоОНастройках() Экспорт
		
	Настройки = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтурЛогистика_Настройки.ИмяПредопределенногоДляРасширения КАК ИмяПредопределенногоДляРасширения,
	               |	КонтурЛогистика_Настройки.Значение КАК Значение
	               |ИЗ
	               |	Справочник.КонтурЛогистика_Настройки КАК КонтурЛогистика_Настройки
	               |ГДЕ
	               |	НЕ КонтурЛогистика_Настройки.ИмяПредопределенногоДляРасширения = """"
	               |	И НЕ КонтурЛогистика_Настройки.ЭтоГруппа
	               |	И НЕ КонтурЛогистика_Настройки.ИмяПредопределенногоДляРасширения ПОДОБНО ""%Пароль%""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Настройки.Вставить(Выборка.ИмяПредопределенногоДляРасширения, Строка(Выборка.Значение));
			
	КонецЦикла;
	
	Возврат Настройки;
	
КонецФункции

Функция ИнфоОПартнерах() Экспорт
		
	МассивПартнеров = Справочники.КонтурЛогистика_Партнеры.ДобавленныеПартнеры();
	
	Возврат МассивПартнеров;
	
КонецФункции

Функция НастройкиОрганизации(ОрганизацияДиадок) Экспорт
	
	СписокИсключений = Новый Массив;
	СписокИсключений.Добавить(Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey);
	СписокИсключений.Добавить(Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытий);
	СписокИсключений.Добавить(Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДата);
	СписокИсключений.Добавить(Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДатаПЛ);
	СписокИсключений.Добавить(Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийПЛ);
	
	НастройкиОрганизации = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияДиадок", ОрганизацияДиадок);
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЛогистика_НастройкиОрганизаций.Настройка КАК Настройка,
	|	КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки КАК ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_НастройкиОрганизаций
	|ГДЕ
	|	КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок = &ОрганизацияДиадок
	|	И НЕ КонтурЛогистика_НастройкиОрганизаций.Настройка В(&СписокИсключений)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НастройкиОрганизации.Вставить(Строка(Выборка.Настройка), Строка(Выборка.ЗначениеНастройки));
	КонецЦикла;
	
	Возврат НастройкиОрганизации;
	
КонецФункции

Функция ДанныеАвтоматическогоОбновления() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Данные = Новый Структура;
	Данные.Вставить("АвтоматическоеОбновлениеВключено", Ложь);
	Данные.Вставить("РасписаниеАвтоматическогоОбновления", "");
	
	Если Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодсистемаКакРасширение() Тогда
		Возврат Данные;
	КонецЕсли;
	
	ИмяОбъекта = "РасширениеКонтурЛогистикаБандл";
	Идентификатор = "РасширениеКонтурЛогистикаБандл.ffdfc67a4c844632b3af1b6ef03dc40b";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработкиКоманды.РегламентноеЗаданиеGUID КАК РегламентноеЗаданиеGUID
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|		ПО (ДополнительныеОтчетыИОбработкиКоманды.Ссылка = ДополнительныеОтчетыИОбработки.Ссылка)
	|ГДЕ
	|	ДополнительныеОтчетыИОбработки.ИмяОбъекта = &ИмяОбъекта
	|	И ДополнительныеОтчетыИОбработкиКоманды.Идентификатор = &Идентификатор";
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Возврат Данные;
	КонецПопытки;
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.РегламентноеЗаданиеGUID) Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Выборка.РегламентноеЗаданиеGUID);
		
		Данные.АвтоматическоеОбновлениеВключено = РегламентноеЗадание.Использование;
		Данные.РасписаниеАвтоматическогоОбновления = Строка(РегламентноеЗадание.Расписание);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ИдентификаторПользователяОС() Экспорт
 
    СистемнаяИнформация1 = Новый СистемнаяИнформация;
    СистемнаяИнформация2 = Новый СистемнаяИнформация;
 
    Если СистемнаяИнформация1.ИдентификаторКлиента = СистемнаяИнформация2.ИдентификаторКлиента Тогда
        ИдентификаторКлиента = СистемнаяИнформация1.ИдентификаторКлиента;
    Иначе
        // https://devtrainingforum.v8.1c.ru/forum/thread.jsp?id=588350&threadtype=0
        // Константа - Ошибка идентификации клиента, переменный идентификатор
        ИдентификаторКлиента = Новый УникальныйИдентификатор("d808d128-2d0e-498e-a728-20bdbe6aae56");
    КонецЕсли; 
 
    Если Строка(ИдентификаторКлиента) = "00000000-0000-0000-0000-000000000000" Тогда
        // Константа - Ошибка идентификации клиента, пустой идентификатор
        ИдентификаторКлиента = Новый УникальныйИдентификатор("d808d128-7a45-43c4-88f2-7d666470b842");
    КонецЕсли;  
 
    Возврат ИдентификаторКлиента;
 
КонецФункции

Функция АдресСервера() Экспорт
	
	// метрики всегда отправляются на бой. в самой метрике есть признак "Окружение", 
	// по которому будем определять какой сервер ДД используется тестовый или боевой
	
	ОтправлятьМетрикиВТест 				= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ОтправлятьМетрикиВТест");
	ИспользоватьТестовыйСерверДиадок 	= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
	
	URLАдреса_Контур = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.URLАдреса_Контур();
	
	Если ИспользоватьТестовыйСерверДиадок Или ОтправлятьМетрикиВТест Тогда 	
	
		Возврат URLАдреса_Контур.СервисПорталТестовый;
		
	Иначе
		
		Возврат URLАдреса_Контур.СервисПортал;
		
	КонецЕсли;
		
КонецФункции

Функция ОтправкаМетрикНаТестовыйСерверЗаблокирована() Экспорт
	
	ОтправлятьМетрикиВТест 				= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ОтправлятьМетрикиВТест");
	ИспользоватьТестовыйСерверДиадок 	= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
	
	Возврат ИспользоватьТестовыйСерверДиадок И НЕ ОтправлятьМетрикиВТест;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПустаяВерсия()

	Возврат "0.0.0";

КонецФункции

#КонецОбласти