#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

&После("ДобавитьКомандыПечати")
Процедура АУ_ДобавитьКомандыПечати(КомандыПечати)

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АУ_АктПередачи(OfficeOpenXML)";
	КомандаПечати.Представление = НСтр("ru = 'Акт приема-передачи (Аурум)'");
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АУ_АктНаПеремещение(OfficeOpenXML)";
	КомандаПечати.Представление = НСтр("ru = 'Акт на перемещение 2024(Аурум)'");
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АУ_АктПриемаПередачиДЗКС(OfficeOpenXML)";
	КомандаПечати.Представление = НСтр("ru = 'Акт приема передачи ДЗКС 2024(Аурум)'");
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АУ_АктВводаДЗКС(OfficeOpenXML)";
	КомандаПечати.Представление = НСтр("ru = 'Акт ввода ДЗКС 2024(Аурум)'");
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АУ_АктВводаПоМСУ(OfficeOpenXML)";
	КомандаПечати.Представление = НСтр("ru = 'Акт ввода по МСУ-1(Аурум)'");
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АУ_УведомлениеОбОтгрузке(OfficeOpenXML)";
	КомандаПечати.Представление = НСтр("ru = 'Уведомление об отгрузке(Аурум)'");
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АУ_УпаковочныйЛист(OfficeOpenXML)";
	КомандаПечати.Представление = НСтр("ru = 'Упаковочный лист(Аурум)'");
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

КонецПроцедуры

&Вместо("Печать")
Процедура АУ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)

	БылаПечать = Ложь;
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АУ_АктПередачи(OfficeOpenXML)");
	Если ПечатнаяФорма <> Неопределено Тогда

		ИмяМакета = "АУ_АктПередачи(OfficeOpenXML)";
		МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати("Документ.РеализацияТоваровУслуг", ИмяМакета, МассивОбъектов);

		ОфисныеДокументы = Новый Соответствие;

		Шаблон = НСтр("ru = 'Акт приема-передачи (Аурум) - [Организация] №[Номер]'");
		ЗначенияРеквизитовДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "Организация,Номер,Ссылка");

		Для Каждого Ссылка Из МассивОбъектов Цикл

			ЗначенияРеквизитовДокумента = ЗначенияРеквизитовДокументов[Ссылка];
			ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ЗначенияРеквизитовДокументов[Ссылка]);

			АдресХранилищаОфисныйДокумент = НапечататьАУ_АктПередачи(Ссылка, МакетИДанныеОбъекта, ИмяМакета);

			ОфисныеДокументы.Вставить(АдресХранилищаОфисныйДокумент, ИмяДокумента);
		КонецЦикла;

		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт приема-передачи (Аурум)'");
		ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;

		БылаПечать = Истина;

	КонецЕсли;

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АУ_АктНаПеремещение(OfficeOpenXML)");
	Если ПечатнаяФорма <> Неопределено Тогда

		ИмяМакета = "АУ_АктНаПеремещение(OfficeOpenXML)";
		МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати("Документ.РеализацияТоваровУслуг", ИмяМакета, МассивОбъектов);

		ОфисныеДокументы = Новый Соответствие;

		Шаблон = НСтр("ru = 'Акт на перемещение (Аурум) - [Организация] №[Номер]'");
		ЗначенияРеквизитовДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "Организация,Номер,Ссылка");

		Для Каждого Ссылка Из МассивОбъектов Цикл

			ЗначенияРеквизитовДокумента = ЗначенияРеквизитовДокументов[Ссылка];
			ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ЗначенияРеквизитовДокументов[Ссылка]);

			АдресХранилищаОфисныйДокумент = НапечататьАУ_АктНаПеремещение(Ссылка, МакетИДанныеОбъекта, ИмяМакета);

			ОфисныеДокументы.Вставить(АдресХранилищаОфисныйДокумент, ИмяДокумента);
		КонецЦикла;

		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт на перемещение (Аурум)'");
		ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;

		БылаПечать = Истина;

	КонецЕсли;

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АУ_АктПриемаПередачиДЗКС(OfficeOpenXML)");
	Если ПечатнаяФорма <> Неопределено Тогда

		ИмяМакета = "АУ_АктПриемаПередачиДЗКС(OfficeOpenXML)";
		МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати("Документ.РеализацияТоваровУслуг", ИмяМакета, МассивОбъектов);

		ОфисныеДокументы = Новый Соответствие;

		Шаблон = НСтр("ru = 'Акт приема передачи ДЗКС (Аурум) - [Организация] №[Номер]'");
		ЗначенияРеквизитовДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "Организация,Номер,Ссылка");

		Для Каждого Ссылка Из МассивОбъектов Цикл

			ЗначенияРеквизитовДокумента = ЗначенияРеквизитовДокументов[Ссылка];
			ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ЗначенияРеквизитовДокументов[Ссылка]);

			АдресХранилищаОфисныйДокумент = НапечататьАУ_АУ_АктПриемаПередачиДЗКС(Ссылка, МакетИДанныеОбъекта, ИмяМакета);

			ОфисныеДокументы.Вставить(АдресХранилищаОфисныйДокумент, ИмяДокумента);
		КонецЦикла;

		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт приема передачи ДЗКС (Аурум)'");
		ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;

		БылаПечать = Истина;

	КонецЕсли;

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АУ_АктВводаДЗКС(OfficeOpenXML)");
	Если ПечатнаяФорма <> Неопределено Тогда

		ИмяМакета = "АУ_АктВводаДЗКС(OfficeOpenXML)";
		МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати("Документ.РеализацияТоваровУслуг", ИмяМакета, МассивОбъектов);

		ОфисныеДокументы = Новый Соответствие;

		Шаблон = НСтр("ru = 'Акт ввода ДЗКС (Аурум) - [Организация] №[Номер]'");
		ЗначенияРеквизитовДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "Организация,Номер,Ссылка");

		Для Каждого Ссылка Из МассивОбъектов Цикл

			ЗначенияРеквизитовДокумента = ЗначенияРеквизитовДокументов[Ссылка];
			ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ЗначенияРеквизитовДокументов[Ссылка]);

			АдресХранилищаОфисныйДокумент = НапечататьАУ_АУ_АктВводаДЗКС(Ссылка, МакетИДанныеОбъекта, ИмяМакета);

			ОфисныеДокументы.Вставить(АдресХранилищаОфисныйДокумент, ИмяДокумента);
		КонецЦикла;

		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт ввода ДЗКС (Аурум)'");
		ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;

		БылаПечать = Истина;

	КонецЕсли;

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АУ_АктВводаПоМСУ(OfficeOpenXML)");
	Если ПечатнаяФорма <> Неопределено Тогда

		ИмяМакета = "АУ_АктВводаПоМСУ(OfficeOpenXML)";
		МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати("Документ.РеализацияТоваровУслуг", ИмяМакета, МассивОбъектов);

		ОфисныеДокументы = Новый Соответствие;

		Шаблон = НСтр("ru = 'Акт по МСУ-1 (Аурум) - [Организация] №[Номер]'");
		ЗначенияРеквизитовДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "Организация,Номер,Ссылка");

		Для Каждого Ссылка Из МассивОбъектов Цикл

			ЗначенияРеквизитовДокумента = ЗначенияРеквизитовДокументов[Ссылка];
			ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ЗначенияРеквизитовДокументов[Ссылка]);

			АдресХранилищаОфисныйДокумент = НапечататьАУ_АктВводаПоМСУ(Ссылка, МакетИДанныеОбъекта, ИмяМакета);

			ОфисныеДокументы.Вставить(АдресХранилищаОфисныйДокумент, ИмяДокумента);
		КонецЦикла;

		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт ввода по МСУ-1 (Аурум)'");
		ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;

		БылаПечать = Истина;

	КонецЕсли;

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АУ_УведомлениеОбОтгрузке(OfficeOpenXML)");
	Если ПечатнаяФорма <> Неопределено Тогда

		ИмяМакета = "АУ_УведомлениеОбОтгрузке(OfficeOpenXML)";
		МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати("Документ.РеализацияТоваровУслуг", ИмяМакета, МассивОбъектов);

		ОфисныеДокументы = Новый Соответствие;

		Шаблон = НСтр("ru = 'Уведомление об отгрузке (Аурум) - [Организация] №[Номер]'");
		ЗначенияРеквизитовДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "Организация,Номер,Ссылка");

		Для Каждого Ссылка Из МассивОбъектов Цикл

			ЗначенияРеквизитовДокумента = ЗначенияРеквизитовДокументов[Ссылка];
			ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ЗначенияРеквизитовДокументов[Ссылка]);

			АдресХранилищаОфисныйДокумент = НапечататьАУ_УведомлениеОбОтгрузке(Ссылка, МакетИДанныеОбъекта, ИмяМакета);

			ОфисныеДокументы.Вставить(АдресХранилищаОфисныйДокумент, ИмяДокумента);
		КонецЦикла;

		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Уведомление об отгрузке (Аурум)'");
		ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;

		БылаПечать = Истина;

	КонецЕсли;

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АУ_УпаковочныйЛист(OfficeOpenXML)");
	Если ПечатнаяФорма <> Неопределено Тогда

		ИмяМакета = "АУ_УпаковочныйЛист(OfficeOpenXML)";
		МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати("Документ.РеализацияТоваровУслуг", ИмяМакета, МассивОбъектов);

		ОфисныеДокументы = Новый Соответствие;

		Шаблон = НСтр("ru = 'Упаковочный лист (Аурум) - [Организация] №[Номер]'");
		ЗначенияРеквизитовДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "Организация,Номер,Ссылка");

		Для Каждого Ссылка Из МассивОбъектов Цикл

			ЗначенияРеквизитовДокумента = ЗначенияРеквизитовДокументов[Ссылка];
			ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ЗначенияРеквизитовДокументов[Ссылка]);

			АдресХранилищаОфисныйДокумент = НапечататьАУ_УпаковочныйЛист(Ссылка, МакетИДанныеОбъекта, ИмяМакета);

			ОфисныеДокументы.Вставить(АдресХранилищаОфисныйДокумент, ИмяДокумента);
		КонецЦикла;

		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Упаковочный лист (Аурум)'");
		ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;

		БылаПечать = Истина;

	КонецЕсли;

	Если НЕ БылаПечать Тогда
		ПродолжитьВызов(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьДанныеПечати(Знач Документы, Знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	СоответствиеПоДокументам = СоответствиеДанныхДляПечатиДокументов(Документы);
	
	Для Каждого ОбъектСсылка Из Документы Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, СоответствиеПоДокументам[ОбъектСсылка]);
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		
		Если ИмяМакета = "АУ_АктПередачи(OfficeOpenXML)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_DOC_АУ_АктПередачи"));
			ОписаниеОбластей.Вставить(ИмяМакета, ОписаниеОбластейМакета_АУ_АктПередачи());
		КонецЕсли;
		
		Если ИмяМакета = "АУ_АктНаПеремещение(OfficeOpenXML)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_DOC_АУ_АктНаПеремещение"));
			ОписаниеОбластей.Вставить(ИмяМакета, ОписаниеОбластейМакета_АУ_АктНаПеремещение());
		КонецЕсли;
		
		Если ИмяМакета = "АУ_АктПриемаПередачиДЗКС(OfficeOpenXML)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_DOC_АУ_АктПриемаПередачиДЗКС"));
			ОписаниеОбластей.Вставить(ИмяМакета, ОписаниеОбластейМакета_АУ_АктПриемаПередачиДЗКС());
		КонецЕсли;
		
		Если ИмяМакета = "АУ_АктВводаДЗКС(OfficeOpenXML)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_DOC_АУ_АктВводаДЗКС"));
			ОписаниеОбластей.Вставить(ИмяМакета, ОписаниеОбластейМакета_АУ_АктВводаДЗКС());
		КонецЕсли;
		
		Если ИмяМакета = "АУ_АктВводаПоМСУ(OfficeOpenXML)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_DOC_АУ_АктВводаПоМСУ"));
			ОписаниеОбластей.Вставить(ИмяМакета, ОписаниеОбластейМакета_АУ_АктВводаДЗКС());
		КонецЕсли;
		
		Если ИмяМакета = "АУ_УведомлениеОбОтгрузке(OfficeOpenXML)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_DOC_УведомлениеОбОтгрузке"));
			ОписаниеОбластей.Вставить(ИмяМакета, ОписаниеОбластейМакета_АУ_УведомлениеОбОтгрузке());
		КонецЕсли;
		
		Если ИмяМакета = "АУ_УпаковочныйЛист(OfficeOpenXML)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_DOC_УпаковочныйЛист"));
			ОписаниеОбластей.Вставить(ИмяМакета, ОписаниеОбластейМакета_АУ_УпаковочныйЛист());
		КонецЕсли;
		
	КонецЦикла;

	Макеты = Новый Структура("ОписаниеОбластей, ДвоичныеДанныеМакетов");
	Макеты.ОписаниеОбластей = ОписаниеОбластей;
	Макеты.ДвоичныеДанныеМакетов = ДвоичныеДанныеМакетов;
	
	ДанныеПечати = Новый Структура("Данные, Макеты");
	ДанныеПечати.Данные = ДанныеПоВсемОбъектам;
	ДанныеПечати.Макеты = Макеты;
	
	Возврат ДанныеПечати;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПечатиДокументов(Документы)
	
	ДанныеДляПечати = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&Документы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРеализации.Ссылка КАК Ссылка,
	|	МАКСИМУМ(КонтактныеЛицаПартнеров.Ссылка) КАК КонтактноеЛицо
	|ПОМЕСТИТЬ ВТРеализацияСКонтактами
	|ИЗ
	|	ВТРеализации КАК ВТРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|		ПО ВТРеализации.Партнер = КонтактныеЛицаПартнеров.Владелец
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРеализации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Грузополучатель.НаименованиеПолное КАК ГрузополучательНаименованиеПолное,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Договор.Наименование КАК ДоговорНаименование,
	|	РеализацияТоваровУслуг.Договор.Номер КАК ДоговорНомер,
	|	РеализацияТоваровУслуг.Договор.Дата КАК ДоговорДата,
	|	РеализацияТоваровУслуг.Договор.Сумма КАК ДоговорСумма,
	|	РеализацияТоваровУслуг.Договор.ВалютаВзаиморасчетов КАК ДоговорВалюта,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	РеализацияТоваровУслуг.Контрагент.ИНН КАК КонтрагентИНН,
	|	РеализацияТоваровУслуг.Контрагент.КПП КАК КонтрагентКПП,
	|	РеализацияТоваровУслуг.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ВТРеализацияСКонтактами.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ВТРеализацияСКонтактами.КонтактноеЛицо.Наименование КАК КонтактноеЛицоНаименование,
	|	ВТРеализацияСКонтактами.КонтактноеЛицо.ДолжностьПоВизитке КАК КонтактноеЛицоДолжность,
	|	РеализацияТоваровУслуг.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		АУ_Шифр КАК АУ_Шифр,
	|		Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|		Номенклатура.ЕдиницаИзмерения.Наименование КАК НоменклатураЕдиницаИзмеренияНаименование,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		СтавкаНДС КАК СтавкаНДС,
	|		СуммаСНДС КАК СуммаСНДС,
	|		СуммаНДС КАК СуммаНДС,
	|		НомерСтроки КАК НомерСтроки
	|	) КАК Товары,
	|	ТранспортнаяНакладнаяДокументыОснования.Ссылка.АдресДоставки КАК АдресДоставки
	|ИЗ
	|	ВТРеализацияСКонтактами КАК ВТРеализацияСКонтактами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	|			ПО ТранспортнаяНакладнаяДокументыОснования.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|		ПО ВТРеализацияСКонтактами.Ссылка = РеализацияТоваровУслуг.Ссылка";
		
	Запрос.УстановитьПараметр("Документы", Документы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Описание=Новый Структура("Ссылка",Выборка.Ссылка);
		Описание.Вставить("Номер",ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер));
		Описание.Вставить("Дата",Формат(Выборка.Дата,"ДЛФ=Д"));
		Описание.Вставить("ДатаПрописью",Формат(Выборка.Дата,"ДФ='дд ММММ гггг ""г.""'"));
		Описание.Вставить("Договор",Выборка.ДоговорНаименование);
		Описание.Вставить("ДатаДоговора",Формат(Выборка.ДоговорДата,"ДЛФ=Д"));
		Описание.Вставить("ДатаДоговораПрописью",Формат(Выборка.ДоговорДата,"ДФ='дд ММММ гггг ""г.""'"));
		Описание.Вставить("НомерДоговора",Выборка.ДоговорНомер);
		Описание.Вставить("СуммаДоговора",Выборка.ДоговорСумма);
		Описание.Вставить("СуммаДоговораПрописью",ЧислоПрописью(Выборка.ДоговорСумма,,Выборка.ДоговорВалюта.ПараметрыПрописи));
		Описание.Вставить("КонтрагентНаименованиеПолное",Выборка.КонтрагентНаименованиеПолное);
		Описание.Вставить("КонтрагентНаименование",Выборка.КонтрагентНаименование);
		Описание.Вставить("ДолжностьПодписантКонтрагентРП",СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.КонтактноеЛицоДолжность,2));
		Описание.Вставить("ФИОПодписантКонтрагентРП",СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.КонтактноеЛицоНаименование,2));
		Описание.Вставить("ДолжностьПодписантКонтрагент",Выборка.КонтактноеЛицоДолжность);
		Описание.Вставить("Помещения","");
		Описание.Вставить("Объект","");
		Описание.Вставить("ОснованиеКонтрагентРП","Доверенности от 31.05.2024 №96/2024");
		Описание.Вставить("Грузополучатель", Выборка.ГрузополучательНаименованиеПолное);
		Описание.Вставить("АдресДоставки", Выборка.АдресДоставки);
		
		ФИОФизическогоЛица = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.КонтактноеЛицоНаименование);
		ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИОФизическогоЛица);
		Описание.Вставить("ФиоИнициалыПодписантКонтрагент",ФамилияИнициалы);
		Описание.Вставить("ИнициалыФиоПодписантКонтрагент",ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИОФизическогоЛица,,Истина));
		
		Товары=Новый Массив;
		ИтогоСуммаНДС=0;
		ИтогоСумма=0;
		стрТовары=Выборка.Товары.Выбрать();
		Пока стрТовары.Следующий() Цикл
			
			НоваяСтрока=Новый Структура();
			НоваяСтрока.Вставить("НомерСтроки",стрТовары.НомерСтроки);
			НоваяСтрока.Вставить("Шифр",стрТовары.АУ_Шифр);
			НоваяСтрока.Вставить("Номенклатура",стрТовары.НоменклатураНаименованиеПолное);
			НоваяСтрока.Вставить("Единица",стрТовары.НоменклатураЕдиницаИзмеренияНаименование);
			НоваяСтрока.Вставить("Количество",стрТовары.Количество);
			НоваяСтрока.Вставить("Цена",СокрЛП(стрТовары.Цена));
			НоваяСтрока.Вставить("СтавкаНДС",СокрЛП(стрТовары.СтавкаНДС));
			НоваяСтрока.Вставить("СуммаНДС",СокрЛП(стрТовары.СуммаНДС));
			НоваяСтрока.Вставить("Сумма",СокрЛП(стрТовары.СуммаСНДС));
			НоваяСтрока.Вставить("СуммаБезНДС",СокрЛП(стрТовары.СуммаСНДС-стрТовары.СуммаНДС));
			
			Товары.Добавить(НоваяСтрока);
			
			ИтогоСуммаНДС=ИтогоСуммаНДС+стрТовары.СуммаНДС;
			ИтогоСумма=ИтогоСумма+стрТовары.СуммаСНДС;
		
		КонецЦикла;
		
		Описание.Вставить("ИтогоСумма",ИтогоСумма);
		Описание.Вставить("ИтогоСуммаНДС",ИтогоСуммаНДС);
		
		НоваяСтрока=Новый Структура();
		НоваяСтрока.Вставить("НомерСтроки","");
		НоваяСтрока.Вставить("Номенклатура","Итого:");
		НоваяСтрока.Вставить("Единица","");
		НоваяСтрока.Вставить("Количество","");
		НоваяСтрока.Вставить("Цена","");
		НоваяСтрока.Вставить("СтавкаНДС","");
		НоваяСтрока.Вставить("СуммаНДС",ИтогоСуммаНДС);
		НоваяСтрока.Вставить("Сумма",ИтогоСумма);
		НоваяСтрока.Вставить("СуммаБезНДС","");
		
		Товары.Добавить(НоваяСтрока);
		
		Описание.Вставить("Товары",Товары);
		Описание.Вставить("СуммаВсегоСНДСПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтогоСумма, Константы.ВалютаРегламентированногоУчета.Получить()));
		Описание.Вставить("СуммаНДСПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтогоСуммаНДС, Константы.ВалютаРегламентированногоУчета.Получить()));
		Описание.Вставить("КоличествоСтрок",Товары.Количество()-1);
		
		ДанныеДляПечати.Добавить(Описание);
		
	КонецЦикла;
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция СоответствиеДанныхДляПечатиДокументов(Документы)
	
	Соответствие = Новый Соответствие;
	
	ДанныеДляПечати = ДанныеДляПечатиДокументов(Документы);
	
	Для Каждого ОписаниеДокумента Из ДанныеДляПечати Цикл
		Соответствие.Вставить(ОписаниеДокумента.Ссылка, ОписаниеДокумента);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ОписаниеОбластейМакета_АУ_АктПередачи()
	
	ОписаниеОбластей = Новый Структура;
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",		 "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Строка",		 "СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",		 "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция ОписаниеОбластейМакета_АУ_АктНаПеремещение()
	
	ОписаниеОбластей = Новый Структура;
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",		 "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Строка",		 "СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",		 "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция ОписаниеОбластейМакета_АУ_АктПриемаПередачиДЗКС()
	
	ОписаниеОбластей = Новый Структура;
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",		 "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Строка",		 "СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",		 "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция ОписаниеОбластейМакета_АУ_АктВводаДЗКС()
	
	ОписаниеОбластей = Новый Структура;
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",		 "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Строка",		 "СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",		 "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция ОписаниеОбластейМакета_АУ_АктВводаМСУ()
	
	ОписаниеОбластей = Новый Структура;
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",		 "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Строка",		 "СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",		 "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция ОписаниеОбластейМакета_АУ_УведомлениеОбОтгрузке()
	
	ОписаниеОбластей = Новый Структура;
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ВерхнийКолонтитул",	"ВерхнийКолонтитул");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",		 "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Строка",		 "СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",		 "Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция ОписаниеОбластейМакета_АУ_УпаковочныйЛист()
	
	ОписаниеОбластей = Новый Структура;
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",		 "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Строка",		 "СтрокаТаблицы");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция НапечататьАУ_АктПередачи(ДокументСсылка, МакетИДанныеОбъекта, ИмяМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
	ДанныеОбъекта			= МакетИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета];
	
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	Попытка
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета, Макет);
		АдресХранилищаПечатнойФормы = "";
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат "";
		КонецЕсли;
		
		// Вывод обычных областей с параметрами.
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Шапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Для каждого стр Из ДанныеОбъекта.Товары Цикл
			
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Строка"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, стр, Ложь);
			
		КонецЦикла;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Подвал"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗакрытьОкноПечатнойФормы = Истина;
		Возврат "";
	КонецПопытки;
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции

Функция НапечататьАУ_АктНаПеремещение(ДокументСсылка, МакетИДанныеОбъекта, ИмяМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
	ДанныеОбъекта			= МакетИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета];
	
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	Попытка
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета, Макет);
		АдресХранилищаПечатнойФормы = "";
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат "";
		КонецЕсли;
		
		// Вывод обычных областей с параметрами.
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Шапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Для каждого стр Из ДанныеОбъекта.Товары Цикл
			
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Строка"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, стр, Ложь);
			
		КонецЦикла;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Подвал"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗакрытьОкноПечатнойФормы = Истина;
		Возврат "";
	КонецПопытки;
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции

Функция НапечататьАУ_АУ_АктПриемаПередачиДЗКС(ДокументСсылка, МакетИДанныеОбъекта, ИмяМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
	ДанныеОбъекта			= МакетИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета];
	
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	Попытка
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета, Макет);
		АдресХранилищаПечатнойФормы = "";
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат "";
		КонецЕсли;
		
		// Вывод обычных областей с параметрами.
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Шапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Для каждого стр Из ДанныеОбъекта.Товары Цикл
			
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Строка"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, стр, Ложь);
			
		КонецЦикла;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Подвал"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗакрытьОкноПечатнойФормы = Истина;
		Возврат "";
	КонецПопытки;
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции

Функция НапечататьАУ_АУ_АктВводаДЗКС(ДокументСсылка, МакетИДанныеОбъекта, ИмяМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
	ДанныеОбъекта			= МакетИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета];
	
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	Попытка
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета, Макет);
		АдресХранилищаПечатнойФормы = "";
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат "";
		КонецЕсли;
		
		// Вывод обычных областей с параметрами.
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Шапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Для каждого стр Из ДанныеОбъекта.Товары Цикл
			
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Строка"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, стр, Ложь);
			
		КонецЦикла;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Подвал"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗакрытьОкноПечатнойФормы = Истина;
		Возврат "";
	КонецПопытки;
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции

Функция НапечататьАУ_АктВводаПоМСУ(ДокументСсылка, МакетИДанныеОбъекта, ИмяМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
	ДанныеОбъекта			= МакетИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета];
	
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	Попытка
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета, Макет);
		АдресХранилищаПечатнойФормы = "";
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат "";
		КонецЕсли;
		
		// Вывод обычных областей с параметрами.
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Шапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Для каждого стр Из ДанныеОбъекта.Товары Цикл
			
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Строка"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, стр, Ложь);
			
		КонецЦикла;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Подвал"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗакрытьОкноПечатнойФормы = Истина;
		Возврат "";
	КонецПопытки;
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции

Функция НапечататьАУ_УведомлениеОбОтгрузке(ДокументСсылка, МакетИДанныеОбъекта, ИмяМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
	ДанныеОбъекта			= МакетИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета];
	
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	Попытка
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета, Макет);
		АдресХранилищаПечатнойФормы = "";
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат "";
		КонецЕсли;
		
		// Вывод обычных областей с параметрами.
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ВерхнийКолонтитул"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Шапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Для каждого стр Из ДанныеОбъекта.Товары Цикл
			
			Если НЕ стр.Номенклатура = "Итого:" Тогда
				Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Строка"]);
				УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, стр, Ложь);
			КонецЕсли;
			
		КонецЦикла;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Подвал"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗакрытьОкноПечатнойФормы = Истина;
		Возврат "";
	КонецПопытки;
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции

Функция НапечататьАУ_УпаковочныйЛист(ДокументСсылка, МакетИДанныеОбъекта, ИмяМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
	ДанныеОбъекта			= МакетИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета];
	
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	Попытка
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета, Макет);
		АдресХранилищаПечатнойФормы = "";
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат "";
		КонецЕсли;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Шапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Для каждого стр Из ДанныеОбъекта.Товары Цикл
			
			Если НЕ стр.Номенклатура = "Итого:" Тогда
				Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Строка"]);
				УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, стр, Ложь);
			КонецЕсли;
			
		КонецЦикла;
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗакрытьОкноПечатнойФормы = Истина;
		Возврат "";
	КонецПопытки;
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции

&ИзменениеИКонтроль("СформироватьПечатнуюФормуРасходнаяНакладная")
Функция АУ_СформироватьПечатнуюФормуРасходнаяНакладная(МассивОбъектов, ОбъектыПечати)

	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_РасходнаяНакладная";
	
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов();
	ИмяКолонкиКодов = КолонкаКодов.ИмяКолонки;
	ПредставлениеКолонкиКодов = КолонкаКодов.ПредставлениеКолонки;
	ВыводитьКоды = ЗначениеЗаполнено(ИмяКолонкиКодов);
	
	ИспользоватьРучныеСкидки         = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	ИспользоватьУпаковки             = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	
	ЗапросПоСкладам = Новый Запрос;
	ЗапросПоСкладам.Текст = "
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка                                        КАК Ссылка,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ХозяйственнаяОперация)        КАК ХозяйственнаяОперация,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ХозяйственнаяОперация = 
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереходПраваСобственности)) КАК ЭтоПереходПраваСобственности,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры В (
	|		                                                ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|		                                                ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|		                                                )
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ)                                                                     КАК ВДокументеЕстьТоварТара
	|ПОМЕСТИТЬ ОбъектыПечати
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Ссылка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 1
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугТовары.Склад  КАК Склад,
	|	ЕСТЬNULL(РеализацияТоваровУслугТовары.Склад.ИспользоватьСерииНоменклатуры, ЛОЖЬ) КАК ИспользоватьСерииНоменклатуры
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыПечати КАК ОбъектыПечати
	|		ПО РеализацияТоваровУслугТовары.Ссылка = ОбъектыПечати.Ссылка
	|		И НЕ ОбъектыПечати.ЭтоПереходПраваСобственности
	|		И ОбъектыПечати.ВДокументеЕстьТоварТара
	|
	|ИТОГИ ПО
	|	Ссылка,
	|	ИспользоватьСерииНоменклатуры
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 2
	|ВЫБРАТЬ
	|	ОбъектыПечати.Ссылка                               КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ОбъектыПечати.Ссылка)                КАК ПредставлениеСсылки,
	|	ОбъектыПечати.ХозяйственнаяОперация                КАК ХозяйственнаяОперация,
	|	ПРЕДСТАВЛЕНИЕ(ОбъектыПечати.ХозяйственнаяОперация) КАК ПредставлениеХозяйственнойОперации,
	|	ОбъектыПечати.ЭтоПереходПраваСобственности         КАК ЭтоПереходПраваСобственности,
	|	ОбъектыПечати.ВДокументеЕстьТоварТара              КАК ВДокументеЕстьТоварТара
	|ИЗ
	|	ОбъектыПечати КАК ОбъектыПечати
	|";
	
	ЗапросПоСкладам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатыЗапроса = ЗапросПоСкладам.ВыполнитьПакет();

	ДеревоОбъектов = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выгрузить(
		ОбходРезультатаЗапроса.ПоГруппировкам); // 1
	ТаблицаПроверки = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выгрузить(); // 2
	
	ПервыйДокумент = Истина;
	
	Для Каждого СтрокаДокумента Из ДеревоОбъектов.Строки Цикл
		
		НомерСтрокиНачало = Неопределено;
		
		Для Каждого ИспользованиеСерий Из СтрокаДокумента.Строки Цикл
			
			ЗапросПоТоварам = Новый Запрос;
			ЗапросПоТоварам.УстановитьПараметр("МассивОбъектов", СтрокаДокумента.Ссылка);
			ЗапросПоТоварам.УстановитьПараметр("МассивСкладов",  ИспользованиеСерий.Строки.ВыгрузитьКолонку("Склад"));
			
			Если ИспользованиеСерий.ИспользоватьСерииНоменклатуры Тогда
				
				ТекстЗапросаПоТоварам = 
				"ВЫБРАТЬ
				|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
				|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
				|	РеализацияТоваровУслугТовары.Склад КАК Склад,
				|	РеализацияТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
				|	РеализацияТоваровУслугТовары.Количество КАК Количество,
				|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
				|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
				|	РеализацияТоваровУслугТовары.Упаковка КАК Упаковка,
				|	"""" КАК Серия
				#Вставка
				|	,РеализацияТоваровУслугТовары.АУ_Шифр КАК Шифр
				#КонецВставки
				|ПОМЕСТИТЬ ТаблицаТоваров
				|ИЗ
				|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
				|ГДЕ
				|	РеализацияТоваровУслугТовары.Ссылка В(&МассивОбъектов)
				|	И РеализацияТоваровУслугТовары.Склад В(&МассивСкладов)
				|	И НЕ(РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
				|				И РеализацияТоваровУслугТовары.СтатусУказанияСерий В (2, 4, 6, 8))
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РеализацияТоваровУслугСерии.НомерСтроки,
				|	РеализацияТоваровУслугСерии.Ссылка,
				|	РеализацияТоваровУслугСерии.Склад,
				|	РеализацияТоваровУслугСерии.Количество,
				|	РеализацияТоваровУслугСерии.Количество,
				|	РеализацияТоваровУслугСерии.Номенклатура,
				|	РеализацияТоваровУслугСерии.Характеристика,
				|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
				|	РеализацияТоваровУслугСерии.Серия
				#Вставка
				|	,ТаблицаТовары.АУ_Шифр КАК Шифр
				#КонецВставки
				|ИЗ
				|	Документ.РеализацияТоваровУслуг.Серии КАК РеализацияТоваровУслугСерии
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
				|		ПО РеализацияТоваровУслугСерии.Ссылка = ТаблицаТовары.Ссылка
				|			И РеализацияТоваровУслугСерии.Номенклатура = ТаблицаТовары.Номенклатура
				|			И РеализацияТоваровУслугСерии.Характеристика = ТаблицаТовары.Характеристика
				|			И РеализацияТоваровУслугСерии.Склад = ТаблицаТовары.Склад
				|ГДЕ
				|	РеализацияТоваровУслугСерии.Ссылка В(&МассивОбъектов)
				|	И РеализацияТоваровУслугСерии.Склад В(&МассивСкладов)
				|	И РеализацияТоваровУслугСерии.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
				|	И ТаблицаТовары.СтатусУказанияСерий В (2, 4, 6, 8, 10)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТаблицаТоваров.НомерСтроки,
				|	ТаблицаТоваров.Ссылка,
				|	ТаблицаТоваров.Склад,
				|	СУММА(ТаблицаТоваров.КоличествоУпаковок) КАК КоличествоУпаковок,
				|	СУММА(ТаблицаТоваров.Количество) КАК Количество,
				|	ТаблицаТоваров.Номенклатура,
				|	ТаблицаТоваров.Характеристика,
				|	ТаблицаТоваров.Упаковка,
				|	ВЫБОР
				|		КОГДА ТаблицаТоваров.Номенклатура.ВидНоменклатуры.НастройкаИспользованияСерий = ЗНАЧЕНИЕ(Перечисление.НастройкиИспользованияСерийНоменклатуры.ЭкземплярТовара)
				|			ТОГДА NULL
				|		ИНАЧЕ ТаблицаТоваров.Серия
				|	КОНЕЦ КАК Серия
				#Вставка
				|	,ТаблицаТоваров.Шифр КАК Шифр
				#КонецВставки
				|ПОМЕСТИТЬ СуммированнаяТаблицаТоваров
				|ИЗ
				|	ТаблицаТоваров КАК ТаблицаТоваров
				|
				|СГРУППИРОВАТЬ ПО
				|	ТаблицаТоваров.НомерСтроки,
				|	ТаблицаТоваров.Ссылка,
				|	ТаблицаТоваров.Склад,
				|	ТаблицаТоваров.Номенклатура,
				|	ТаблицаТоваров.Характеристика,
				|	ТаблицаТоваров.Упаковка,
				|	ВЫБОР
				|		КОГДА ТаблицаТоваров.Номенклатура.ВидНоменклатуры.НастройкаИспользованияСерий = ЗНАЧЕНИЕ(Перечисление.НастройкиИспользованияСерийНоменклатуры.ЭкземплярТовара)
				|			ТОГДА NULL
				|		ИНАЧЕ ТаблицаТоваров.Серия
				|	КОНЕЦ
				#Вставка
				|	,ТаблицаТоваров.Шифр
				#КонецВставки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТаблицаТоваров.НомерСтроки,
				|	ТаблицаТоваров.Ссылка КАК Ссылка,
				|	ТаблицаТоваров.Ссылка.Организация КАК Организация,
				|	ТаблицаТоваров.Ссылка.Контрагент КАК Контрагент,
				|	ТаблицаТоваров.Ссылка.Номер КАК Номер,
				|	ТаблицаТоваров.Ссылка.Дата КАК Дата,
				|	ТаблицаТоваров.Ссылка.Организация.Префикс КАК Префикс,
				|	ТаблицаТоваров.Склад КАК Склад,
				|	ВЫБОР
				|		КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
				|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения)
				|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТоваров.Упаковка)
				|	КОНЕЦ КАК ПредставлениеЕдиницыИзмеренияУпаковки,
				|	ПРЕДСТАВЛЕНИЕ(ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения) КАК ПредставлениеБазовойЕдиницыИзмерения,
				|	ТаблицаТоваров.КоличествоУпаковок КАК КоличествоУпаковок,
				|	ТаблицаТоваров.Количество КАК Количество,
				|	ТаблицаТоваров.Номенклатура.ВидНоменклатуры.НастройкаИспользованияСерий КАК НастройкаИспользованияСерий,
				|	ТаблицаТоваров.Номенклатура.Код КАК Код,
				|	ТаблицаТоваров.Номенклатура.Артикул КАК Артикул,
				|	ТаблицаТоваров.Номенклатура.НаименованиеПолное КАК ПредставлениеНоменклатуры,
				|	ТаблицаТоваров.Характеристика.НаименованиеПолное КАК ПредставлениеХарактеристики,
				|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
				|	ТаблицаТоваров.Характеристика КАК Характеристика,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) = 1
				|			ТОГДА НЕОПРЕДЕЛЕНО
				|		ИНАЧЕ ТаблицаТоваров.Упаковка.Наименование
				|	КОНЕЦ КАК Упаковка,
				|	ТаблицаТоваров.Серия.Наименование КАК ПредставлениеСерии,
				|	ВЫБОР
				|		КОГДА ТаблицаТоваров.Ссылка.ВернутьМногооборотнуюТару
				|				И ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоВозвратнаяТара
				#Вставка
				|	,ТаблицаТоваров.Шифр КАК Шифр
				#КонецВставки
				|ИЗ
				|	СуммированнаяТаблицаТоваров КАК ТаблицаТоваров
				|
				|УПОРЯДОЧИТЬ ПО НомерСтроки
				|
				|ИТОГИ ПО
				|	Ссылка,
				|	Склад,
				|	Номенклатура,
				|	Характеристика
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТаблицаТоваров.НомерСтроки,
				|	ТаблицаТоваров.Ссылка КАК Ссылка,
				|	ТаблицаТоваров.Склад КАК Склад,
				|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
				|	ТаблицаТоваров.Характеристика КАК Характеристика,
				|	ТаблицаТоваров.Серия.Наименование КАК ПредставлениеСерии
				#Вставка
				|	,ТаблицаТоваров.Шифр КАК Шифр
				#КонецВставки
				|ИЗ
				|	ТаблицаТоваров КАК ТаблицаТоваров
				|ГДЕ
				|	ТаблицаТоваров.Номенклатура.ВидНоменклатуры.НастройкаИспользованияСерий = ЗНАЧЕНИЕ(Перечисление.НастройкиИспользованияСерийНоменклатуры.ЭкземплярТовара)
				|	И НЕ ТаблицаТоваров.Серия ЕСТЬ NULL 
				|УПОРЯДОЧИТЬ ПО НомерСтроки
				|";
				
				ТекстЗапросаПоТоварам = СтрЗаменить(ТекстЗапросаПоТоварам, "&ТекстЗапросаКоэффициентУпаковки",
					Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
						"ТаблицаТоваров.Упаковка",
						"ТаблицаТоваров.Номенклатура"));
				
				ЗапросПоТоварам.Текст	 = ТекстЗапросаПоТоварам;
				МассивРезультатов		 = ЗапросПоТоварам.ВыполнитьПакет();
				
				РезультатДанныеПечати		= МассивРезультатов[2]; // РезультатЗапроса
				РезультатВыборкаПоСериям	= МассивРезультатов[3]; // РезультатЗапроса
				
				ДанныеПечати				= РезультатДанныеПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ВыборкаПоСериям 			= РезультатВыборкаПоСериям.Выбрать();
				
			Иначе
				
				ТекстЗапросаПоТоварам = 
				"ВЫБРАТЬ
				|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
				|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
				|	РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация,
				|	РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
				|	РеализацияТоваровУслугТовары.Ссылка.Номер КАК Номер,
				|	РеализацияТоваровУслугТовары.Ссылка.Дата КАК Дата,
				|	РеализацияТоваровУслугТовары.Ссылка.Организация.Префикс КАК Префикс,
				|	РеализацияТоваровУслугТовары.Склад КАК Склад,
				|	ВЫБОР
				|		КОГДА РеализацияТоваровУслугТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
				|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения)
				|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслугТовары.Упаковка)
				|	КОНЕЦ КАК ПредставлениеЕдиницыИзмеренияУпаковки,
				|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения) КАК ПредставлениеБазовойЕдиницыИзмерения,
				|	РеализацияТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
				|	РеализацияТоваровУслугТовары.Количество КАК Количество,
				|	РеализацияТоваровУслугТовары.Номенклатура.Код КАК Код,
				|	РеализацияТоваровУслугТовары.Номенклатура.Артикул КАК Артикул,
				|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК ПредставлениеНоменклатуры,
				|	РеализацияТоваровУслугТовары.Характеристика.НаименованиеПолное КАК ПредставлениеХарактеристики,
				|	"""" КАК ПредставлениеСерии,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) = 1
				|			ТОГДА НЕОПРЕДЕЛЕНО
				|		ИНАЧЕ РеализацияТоваровУслугТовары.Упаковка.Наименование
				|	КОНЕЦ КАК Упаковка,
				|	ВЫБОР
				|		КОГДА РеализацияТоваровУслугТовары.Ссылка.ВернутьМногооборотнуюТару
				|				И РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоВозвратнаяТара,
				|	NULL КАК НастройкаИспользованияСерий,
				|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
				|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика
				#Вставка
				|	,РеализацияТоваровУслугТовары.АУ_Шифр КАК Шифр
				#КонецВставки
				|ИЗ
				|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
				|ГДЕ
				|	РеализацияТоваровУслугТовары.Ссылка В(&МассивОбъектов)
				|	И РеализацияТоваровУслугТовары.Склад В(&МассивСкладов)
				|	И РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
				|
				|УПОРЯДОЧИТЬ ПО НомерСтроки
				|
				|ИТОГИ ПО
				|	Ссылка,
				|	Склад,
				|	Номенклатура,
				|	Характеристика";
				
				ТекстЗапросаПоТоварам = СтрЗаменить(ТекстЗапросаПоТоварам, "&ТекстЗапросаКоэффициентУпаковки",
					Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
						"РеализацияТоваровУслугТовары.Упаковка",
						"РеализацияТоваровУслугТовары.Номенклатура"));
				
				ЗапросПоТоварам.Текст = ТекстЗапросаПоТоварам;
				ДанныеПечати = ЗапросПоТоварам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
			КонецЕсли;
			
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_РасходнаяНакладная");
			
			ШиринаОтсутствующихОбластей = 0;
			Если НЕ ВыводитьКоды Тогда
				ШиринаОтсутствующихОбластей = Макет.Область("КолонкаКодов").ШиринаКолонки;
			КонецЕсли;
			
			Если Не ИспользоватьУпаковки Тогда
				
				ШиринаОтсутствующихОбластей = ШиринаОтсутствующихОбластей + Макет.Область("КолонкаКоличестваУпаковок").ШиринаКолонки;
				ШиринаОтсутствующихОбластей = ШиринаОтсутствующихОбластей + Макет.Область("КолонкаПредставленияУпаковок").ШиринаКолонки;
				
			КонецЕсли;
			
			// Раздвинуть колонку "КолонкаТоваров" на ширину отсутствующих областей
			Макет.Область("КолонкаТоваров").ШиринаКолонки = Макет.Область("КолонкаТоваров").ШиринаКолонки + ШиринаОтсутствующихОбластей;
			
			РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс, Представление");
	
			Пока ДанныеПечати.Следующий() Цикл
				
				ПараметрыПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
				НайденныеСтроки = ТаблицаПроверки.НайтиСтроки(ПараметрыПоиска);
				
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					ТаблицаПроверки.Удалить(НайденнаяСтрока);
				КонецЦикла;
				
				Если НомерСтрокиНачало = Неопределено Тогда
					НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ДанныеПечати);
				
				ВыборкаПоСкладам = ДанныеПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоСкладам.Следующий() Цикл
					
					Если Не ПервыйДокумент Тогда
						ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ПервыйДокумент = Ложь;
					
					Область = Макет.ПолучитьОбласть("Заголовок");
					СтруктураДанныхЗаголовок = Новый Структура;
					СтруктураДанныхЗаголовок.Вставить("ТекстЗаголовка", НСтр("ru='Расходная накладная'", ОбщегоНазначения.КодОсновногоЯзыка()));
					ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, Область, ДанныеПечати.Ссылка);
					Область.Параметры.Заполнить(СтруктураДанныхЗаголовок);
					ТабличныйДокумент.Вывести(Область);
					
					Область = Макет.ПолучитьОбласть("Шапка");
					СтруктураДанныхШапка = Новый Структура;
					СтруктураДанныхШапка.Вставить("ПредставлениеРаспоряжения", ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(
						РеквизитыДокумента, НСтр("ru='Реализация товаров'", ОбщегоНазначения.КодОсновногоЯзыка())));
					СтруктураДанныхШапка.Вставить("ПредставлениеСклада", ВыборкаПоСкладам.Склад);
					СтруктураДанныхШапка.Вставить("Склад", ВыборкаПоСкладам.Склад);
					Область.Параметры.Заполнить(СтруктураДанныхШапка);
					ТабличныйДокумент.Вывести(Область);
					
					Область = Макет.ПолучитьОбласть("Поставщик");
					СтруктураДанныхПоставщик = Новый Структура;
					СтруктураДанныхПоставщик.Вставить("ПредставлениеОрганизации", 
						ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаПоСкладам.Организация, ВыборкаПоСкладам.Дата), 
							"ПолноеНаименование"));
					СтруктураДанныхПоставщик.Вставить("Организация", ВыборкаПоСкладам.Организация);
					Область.Параметры.Заполнить(СтруктураДанныхПоставщик);
					ТабличныйДокумент.Вывести(Область);
					
					Область = Макет.ПолучитьОбласть("Покупатель");
					СтруктураДанныхПокупатель = Новый Структура;
					СтруктураДанныхПоставщик.Вставить("ПредставлениеПартнера", 
						ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаПоСкладам.Контрагент, ВыборкаПоСкладам.Дата),
							"ПолноеНаименование"));
					СтруктураДанныхПоставщик.Вставить("Контрагент", ВыборкаПоСкладам.Контрагент);
					Область.Параметры.Заполнить(СтруктураДанныхПоставщик);
					ТабличныйДокумент.Вывести(Область);
					
					Область = Макет.ПолучитьОбласть("ШапкаТаблицы|НачалоСтроки");
					ТабличныйДокумент.Вывести(Область);
					Если ВыводитьКоды Тогда
						Область = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
						СтруктураДанныхКоды = Новый Структура("ИмяКолонкиКодов", ПредставлениеКолонкиКодов);
						Область.Параметры.Заполнить(СтруктураДанныхКоды);
						ТабличныйДокумент.Присоединить(Область);
					КонецЕсли;
					Область = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаТоваров");
					ТабличныйДокумент.Присоединить(Область);
					Если ИспользоватьУпаковки Тогда
						Область = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкиУпаковок");
						ТабличныйДокумент.Присоединить(Область);
					КонецЕсли;
					Область = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкиКоличества");
					ТабличныйДокумент.Присоединить(Область);
					
					ОбластьНачалоСтроки		 = Макет.ПолучитьОбласть("СтрокаТаблицы|НачалоСтроки");
					ОбластьКолонкаКодов		 = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаКодов");
					ОбластьКолонкаТоваров	 = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаТоваров");
					ОбластьКолонкаУпаковок	 = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкиУпаковок");
					ОбластьКолонкаКоличества = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкиКоличества");
	
					СчетСтрок = 1;				
	
					ВыборкаПоСсылкамТЧ = ВыборкаПоСкладам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
					Пока ВыборкаПоСсылкамТЧ.Следующий() Цикл
	
						ВыборкаПоНоменклатуреТЧ = ВыборкаПоСсылкамТЧ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
						Пока ВыборкаПоНоменклатуреТЧ.Следующий() Цикл
	
							ВыборкаПоСтрокамТЧ = ВыборкаПоНоменклатуреТЧ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							ПерваяСтрока = Истина;
							СтрокаУпаковок = "";
							СтрокаКоличестваУпаковок = "";
							СтрокаЕдиницИзмерений = "";
							СтрокаКоличества = "";
							
							Пока ВыборкаПоСтрокамТЧ.Следующий() Цикл
								
								Если ВыборкаПоСтрокамТЧ.НастройкаИспользованияСерий = Перечисления.НастройкиИспользованияСерийНоменклатуры.ЭкземплярТовара Тогда
									
									Если ПерваяСтрока Тогда
										
										СтруктураДанныхНомерСтроки = Новый Структура("НомерСтроки", СчетСтрок);
										
										#Вставка
										ОбластьНачалоСтроки.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
										#КонецВставки
										
										ОбластьНачалоСтроки.Параметры.Заполнить(СтруктураДанныхНомерСтроки);
										СчетСтрок = СчетСтрок + 1;
										ТабличныйДокумент.Вывести(ОбластьНачалоСтроки);
										Если ВыводитьКоды Тогда
											СтруктураДанныхКоды = Новый Структура("ЗначениеКода", ВыборкаПоСтрокамТЧ[ИмяКолонкиКодов]);
											ОбластьКолонкаКодов.Параметры.Заполнить(СтруктураДанныхКоды);
											ТабличныйДокумент.Присоединить(ОбластьКолонкаКодов);
										КонецЕсли;
										
										СтруктураПоиска = Новый Структура;
										СтруктураПоиска.Вставить("Ссылка", ВыборкаПоСтрокамТЧ.Ссылка);
										СтруктураПоиска.Вставить("Склад", ВыборкаПоСтрокамТЧ.Склад);
										СтруктураПоиска.Вставить("Номенклатура", ВыборкаПоСтрокамТЧ.Номенклатура);
										СтруктураПоиска.Вставить("Характеристика", ВыборкаПоСтрокамТЧ.Характеристика);
										
										СтрокаСерий = "";
										Пока ВыборкаПоСериям.НайтиСледующий(СтруктураПоиска) Цикл
											СтрокаСерий = СтрокаСерий + ВыборкаПоСериям.ПредставлениеСерии + ", ";
										КонецЦикла;
										
										Если СтрДлина(СтрокаСерий) <> 0 Тогда
											СтрокаСерий = Лев(СтрокаСерий, СтрДлина(СтрокаСерий) - 2);
										КонецЕсли;
										
										ДополнительныеПараметрыПолученияНаименованияДляПечати = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
										ДополнительныеПараметрыПолученияНаименованияДляПечати.ВозвратнаяТара = ВыборкаПоСтрокамТЧ.ЭтоВозвратнаяТара;
										ДополнительныеПараметрыПолученияНаименованияДляПечати.КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
										
										Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
											ВыборкаПоСтрокамТЧ.ПредставлениеНоменклатуры,
											ВыборкаПоСтрокамТЧ.ПредставлениеХарактеристики,
											,
											СтрокаСерий,
											ДополнительныеПараметрыПолученияНаименованияДляПечати);
										
										СтруктураДанныхТовар = Новый Структура("Товар", Товар);
										ОбластьКолонкаТоваров.Параметры.Заполнить(СтруктураДанныхТовар);
										
										ТабличныйДокумент.Присоединить(ОбластьКолонкаТоваров);
										
										ПерваяСтрока = Ложь;
										
									КонецЕсли;
									
									Если ИспользоватьУпаковки Тогда
										СтрокаУпаковок = СтрокаУпаковок + ВыборкаПоСтрокамТЧ.ПредставлениеЕдиницыИзмеренияУпаковки + Символы.ПС;
										СтрокаКоличестваУпаковок = СтрокаКоличестваУпаковок + ВыборкаПоСтрокамТЧ.КоличествоУпаковок + Символы.ПС;
									КонецЕсли;
									
									СтрокаЕдиницИзмерений = СтрокаЕдиницИзмерений + ВыборкаПоСтрокамТЧ.ПредставлениеБазовойЕдиницыИзмерения + Символы.ПС;
									СтрокаКоличества = СтрокаКоличества + ВыборкаПоСтрокамТЧ.Количество + Символы.ПС;
									
									ТоварССериейЭкземпляром = Истина;
																	
								Иначе			
									
									СтруктураДанныхНомерСтроки = Новый Структура("НомерСтроки", СчетСтрок);
									ОбластьНачалоСтроки.Параметры.Заполнить(СтруктураДанныхНомерСтроки);
									СчетСтрок = СчетСтрок + 1;
									ТабличныйДокумент.Вывести(ОбластьНачалоСтроки);
									
									Если ВыводитьКоды Тогда
										СтруктураДанныхКоды = Новый Структура("ЗначениеКода", ВыборкаПоСтрокамТЧ[ИмяКолонкиКодов]);
										ОбластьКолонкаКодов.Параметры.Заполнить(СтруктураДанныхКоды);
										ТабличныйДокумент.Присоединить(ОбластьКолонкаКодов);
									КонецЕсли;
									
									ДополнительныеПараметрыПолученияНаименованияДляПечати = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
									ДополнительныеПараметрыПолученияНаименованияДляПечати.ВозвратнаяТара = ВыборкаПоСтрокамТЧ.ЭтоВозвратнаяТара;
									ДополнительныеПараметрыПолученияНаименованияДляПечати.КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
									
									Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
										ВыборкаПоСтрокамТЧ.ПредставлениеНоменклатуры,
										ВыборкаПоСтрокамТЧ.ПредставлениеХарактеристики,
										,
										ВыборкаПоСтрокамТЧ.ПредставлениеСерии,
										ДополнительныеПараметрыПолученияНаименованияДляПечати);
										
									СтруктураДанныхТовар = Новый Структура("Товар", Товар);
									ОбластьКолонкаТоваров.Параметры.Заполнить(СтруктураДанныхТовар);
									
									ТабличныйДокумент.Присоединить(ОбластьКолонкаТоваров);
									
									Если ИспользоватьУпаковки Тогда 									
										ОбластьКолонкаУпаковок.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
										ТабличныйДокумент.Присоединить(ОбластьКолонкаУпаковок);
									КонецЕсли;
									
									ОбластьКолонкаКоличества.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
									ТабличныйДокумент.Присоединить(ОбластьКолонкаКоличества);
									
									ТоварССериейЭкземпляром = Ложь;
												
								КонецЕсли;
								
							КонецЦикла;
							
							Если ТоварССериейЭкземпляром Тогда
								Если ИспользоватьУпаковки Тогда
									СтруктураДанныхКолонкаУпаковок = Новый Структура;
									СтруктураДанныхКолонкаУпаковок.Вставить("КоличествоУпаковок", СтрокаКоличестваУпаковок);
									СтруктураДанныхКолонкаУпаковок.Вставить("ПредставлениеЕдиницыИзмеренияУпаковки", СтрокаУпаковок);
									ОбластьКолонкаУпаковок.Параметры.Заполнить(СтруктураДанныхКолонкаУпаковок);
									ТабличныйДокумент.Присоединить(ОбластьКолонкаУпаковок);
								КонецЕсли;
								
								СтруктураДанныхКолонкаКоличества = Новый Структура;
								СтруктураДанныхКолонкаКоличества.Вставить("Количество", СтрокаКоличества);
								СтруктураДанныхКолонкаКоличества.Вставить("ПредставлениеБазовойЕдиницыИзмерения", СтрокаЕдиницИзмерений);
								ОбластьКолонкаКоличества.Параметры.Заполнить(СтруктураДанныхКолонкаКоличества);
								ТабличныйДокумент.Присоединить(ОбластьКолонкаКоличества);
								
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЦикла;
					
					Область = Макет.ПолучитьОбласть("ПодвалТаблицы|НачалоСтроки");
					ТабличныйДокумент.Вывести(Область);
					Если ВыводитьКоды Тогда
						Область = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
						ТабличныйДокумент.Присоединить(Область);
					КонецЕсли;
					Область = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаТоваров");
					ТабличныйДокумент.Присоединить(Область);
					Если ИспользоватьУпаковки Тогда
						Область = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкиУпаковок");
						ТабличныйДокумент.Присоединить(Область);
					КонецЕсли;
					Область = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкиКоличества");
					ТабличныйДокумент.Присоединить(Область);
					
					Область = Макет.ПолучитьОбласть("Подписи");
					ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%'", ОбщегоНазначения.КодОсновногоЯзыка());
					ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", СчетСтрок-1);
					СтруктураДанныхИтоговаяСтрока = Новый Структура;
					СтруктураДанныхЗаголовок.Вставить("ИтоговаяСтрока", ТекстИтоговойСтроки);
					Область.Параметры.Заполнить(СтруктураДанныхЗаголовок);
					ТабличныйДокумент.Вывести(Область);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Не НомерСтрокиНачало = Неопределено Тогда
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, СтрокаДокумента.Ссылка);
		КонецЕсли;
	
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ТаблицаПроверки Цикл
		
		Если СтрокаТаблицы.ЭтоПереходПраваСобственности Тогда
			
			ТекстСообщения = НСтр("ru = 'В документе %1 хозяйственная операция %2. Печать расходной накладной не требуется.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения,
				СтрокаТаблицы.ПредставлениеСсылки,
				СтрокаТаблицы.ПредставлениеХозяйственнойОперации);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				СтрокаТаблицы.Ссылка);
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не СтрокаТаблицы.ВДокументеЕстьТоварТара Тогда
		
			ТекстСообщения = НСтр("ru = 'В документе %1 отсутствуют товары. Печать расходной накладной не требуется.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения,
				СтрокаТаблицы.ПредставлениеСсылки);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				СтрокаТаблицы.Ссылка);
		
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&ИзменениеИКонтроль("СформироватьПечатнуюФормуНакладная")
Функция АУ_СформироватьПечатнуюФормуНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)

	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыПечати <> Неопределено
		И ПараметрыПечати.Свойство("ОтображатьСкидки") Тогда
		
		ОтображатьСкидки = ПараметрыПечати.ОтображатьСкидки;
		
	Иначе
		ОтображатьСкидки = (Константы.ОтображениеСкидокВПечатныхФормахДокументовПродажи.Получить()
							<> Перечисления.ВариантыВыводаСкидокВПечатныхФормах.НеВыводитьСкидки);
	КонецЕсли;
	
	КолонкаКодов				= ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов();
	ИмяКолонкиКодов				= КолонкаКодов.ИмяКолонки;
	ПредставлениеКолонкиКодов	= КолонкаКодов.ПредставлениеКолонки;
	ВыводитьКоды				= ЗначениеЗаполнено(ИмяКолонкиКодов);
	
	ИспользоватьРучныеСкидки			= ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьАвтоматическиеСкидки	= ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка				КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер				КАК Номер,
	|	РеализацияТоваровУслуг.Дата					КАК Дата,
	|	РеализацияТоваровУслуг.Партнер				КАК Партнер,
	|	РеализацияТоваровУслуг.Контрагент			КАК Получатель,
	|	РеализацияТоваровУслуг.Организация			КАК Организация,
	|	РеализацияТоваровУслуг.Организация.Префикс	КАК Префикс,
	|	РеализацияТоваровУслуг.Валюта				КАК Валюта,
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС		КАК ЦенаВключаетНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.НалогообложениеНДС В(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|															ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ										КАК УчитыватьНДС,
	|	РеализацияТоваровУслуг.Отпустил				КАК ОтпускПроизвел
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 1
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка										КАК Ссылка,
	|	РеализацияТоваровУслуг.НомерСтроки									КАК НомерСтроки,
	|	ВариантыКомплектацииНоменклатуры.Ссылка										КАК ВариантКомплектацииНоменклатуры,
	|	ВариантыКомплектацииНоменклатуры.ВариантПредставленияНабораВПечатныхФормах	КАК ВариантПредставленияНабораВПечатныхФормах,
	|	ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора					КАК ВариантРасчетаЦеныНабора,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.АналитикаУчетаНаборов.НоменклатураНабора,
	|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))							КАК НоменклатураНабора,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.АналитикаУчетаНаборов.ХарактеристикаНабора,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))			КАК ХарактеристикаНабора,
	|	РеализацияТоваровУслуг.АналитикаУчетаНоменклатуры.Номенклатура		КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ &ТекстЗапросаКоэффициентУпаковки1
	|	КОНЕЦ																КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ РеализацияТоваровУслуг.Упаковка
	|	КОНЕЦ																КАК ЕдиницаИзмерения,
	|	РеализацияТоваровУслуг.АналитикаУчетаНоменклатуры.Характеристика	КАК Характеристика,
	|	РеализацияТоваровУслуг.Упаковка										КАК Упаковка,
	|	РеализацияТоваровУслуг.СтавкаНДС									КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки
	|			ТОГДА РеализацияТоваровУслуг.Цена
	|		ИНАЧЕ РеализацияТоваровУслуг.СуммаСНДС / РеализацияТоваровУслуг.КоличествоУпаковок
	|	КОНЕЦ																КАК Цена,
	|	РеализацияТоваровУслуг.Количество									КАК Количество,
	|	РеализацияТоваровУслуг.КоличествоУпаковок							КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Ссылка.ЦенаВключаетНДС
	|			ТОГДА РеализацияТоваровУслуг.СуммаСНДС
	|		ИНАЧЕ РеализацияТоваровУслуг.СуммаСНДС - РеализацияТоваровУслуг.СуммаНДС
	|	КОНЕЦ																КАК Сумма,
	|	ВЫБОР
	|		КОГДА &ОтображатьСкидки ТОГДА
	|			РеализацияТоваровУслуг.СуммаРучнойСкидки + РеализацияТоваровУслуг.СуммаАвтоматическойСкидки
	|		ИНАЧЕ 0
	|	КОНЕЦ																КАК СуммаСкидки,
	|	РеализацияТоваровУслуг.СуммаСНДС + РеализацияТоваровУслуг.СуммаРучнойСкидки
	|		+ РеализацияТоваровУслуг.СуммаАвтоматическойСкидки				КАК СуммаБезСкидки,
	|	РеализацияТоваровУслуг.СуммаНДС										КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ РеализацияТоваровУслуг.КоличествоПоРНПТ
	|	КОНЕЦ																КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|		ИНАЧЕ РеализацияТоваровУслуг.НомерГТД
	|	КОНЕЦ																КАК НомерГТД
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО ВариантыКомплектацииНоменклатуры.Владелец = РеализацияТоваровУслуг.АналитикаУчетаНаборов.НоменклатураНабора
	|			И ВариантыКомплектацииНоменклатуры.Характеристика = РеализацияТоваровУслуг.АналитикаУчетаНаборов.ХарактеристикаНабора
	|			И ВариантыКомплектацииНоменклатуры.Основной
	|
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)
	|	И &УсловиеПоТипуНоменклатуры
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 2
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка                КАК Ссылка,
	|	МИНИМУМ(ТаблицаТоваров.НомерСтроки)  КАК НомерСтроки,
	|	ТаблицаТоваров.НоменклатураНабора    КАК НоменклатураНабора,
	|	ТаблицаТоваров.ХарактеристикаНабора  КАК ХарактеристикаНабора,
	|	СУММА(ТаблицаТоваров.Сумма)          КАК Сумма,
	|	СУММА(ТаблицаТоваров.СуммаБезСкидки) КАК СуммаБезСкидки,
	|	СУММА(ТаблицаТоваров.СуммаСкидки)    КАК СуммаСкидки,
	|	СУММА(ТаблицаТоваров.СуммаНДС)       КАК СуммаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыПодготовка
	|ИЗ
	|	Товары КАК ТаблицаТоваров
	|
	|ГДЕ
	|	ТаблицаТоваров.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Ссылка,
	|	ТаблицаТоваров.НоменклатураНабора,
	|	ТаблицаТоваров.ХарактеристикаНабора
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 3
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТоварыРазличные
	|ИЗ
	|	Товары КАК ТаблицаТоваров
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 4
	|ВЫБРАТЬ
	|	Товары.Ссылка										КАК Ссылка,
	|	Товары.ВариантКомплектацииНоменклатуры				КАК ВариантКомплектацииНоменклатуры,
	|	Товары.ВариантПредставленияНабораВПечатныхФормах	КАК ВариантПредставленияНабораВПечатныхФормах,
	|	Товары.ВариантРасчетаЦеныНабора						КАК ВариантРасчетаЦеныНабора,
	|	Товары.НоменклатураНабора							КАК НоменклатураНабора,
	|	Товары.ХарактеристикаНабора							КАК ХарактеристикаНабора,
	|	Товары.Номенклатура									КАК Номенклатура,
	|	Товары.Характеристика								КАК Характеристика,
	|	ВЫБОР
	|		КОГДА Товары.ВариантКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Товары.Номенклатура
	|				И Товары.ВариантКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Товары.Характеристика
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ												КАК ОсновнаяКомплектующая,
	|	Товары.СтавкаНДС									КАК СтавкаНДС,
	|	0													КАК КоличествоПоУмолчанию,
	|	Товары.Количество									КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьПервая
	|ИЗ
	|	Товары КАК Товары
	|
	|ГДЕ
	|	Товары.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыРазличные.Ссылка										КАК Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка											КАК ВариантКомплектацииНоменклатуры,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантПредставленияНабораВПечатныхФормах	КАК ВариантПредставленияНабораВПечатныхФормах,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора					КАК ВариантРасчетаЦеныНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец									КАК НоменклатураНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика							КАК ХарактеристикаНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура			КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика		КАК Характеристика,
	|	ЛОЖЬ КАК ОсновнаяКомплектующая,
	|	NULL														КАК СтавкаНДС,
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество)	КАК КоличествоПоУмолчанию,
	|	0															КАК Количество
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыРазличные КАК ТоварыРазличные
	|		ПО ИСТИНА
	|
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка В
	|		(ВЫБРАТЬ
	|			Т.ВариантКомплектацииНоменклатуры
	|		ИЗ
	|			Товары КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыРазличные.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 5
	|ВЫБРАТЬ
	|	Таблица.Ссылка										КАК Ссылка,
	|	Таблица.ВариантКомплектацииНоменклатуры				КАК ВариантКомплектацииНоменклатуры,
	|	Таблица.ВариантРасчетаЦеныНабора					КАК ВариантРасчетаЦеныНабора,
	|	Таблица.ВариантПредставленияНабораВПечатныхФормах	КАК ВариантПредставленияНабораВПечатныхФормах,
	|	Таблица.НоменклатураНабора							КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора						КАК ХарактеристикаНабора,
	|	Таблица.Номенклатура								КАК Номенклатура,
	|	Таблица.Характеристика								КАК Характеристика,
	|	МАКСИМУМ(Таблица.СтавкаНДС)							КАК СтавкаНДС,
	|	МАКСИМУМ(Таблица.ОсновнаяКомплектующая)				КАК ОсновнаяКомплектующая,
	|	СУММА(Таблица.КоличествоПоУмолчанию)				КАК КоличествоПоУмолчанию,
	|	СУММА(Таблица.Количество)							КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьВторая
	|ИЗ
	|	ВременнаяТаблицаНаборыДополнительноЧастьПервая КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Ссылка,
	|	Таблица.ВариантКомплектацииНоменклатуры,
	|	Таблица.ВариантРасчетаЦеныНабора,
	|	Таблица.ВариантПредставленияНабораВПечатныхФормах,
	|	Таблица.НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора,
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 6
	|ВЫБРАТЬ
	|	Результат.Ссылка									КАК Ссылка,
	|	Результат.ВариантКомплектацииНоменклатуры			КАК ВариантКомплектацииНоменклатуры,
	|	Результат.ВариантРасчетаЦеныНабора					КАК ВариантРасчетаЦеныНабора,
	|	Результат.ВариантПредставленияНабораВПечатныхФормах	КАК ВариантПредставленияНабораВПечатныхФормах,
	|	Результат.НоменклатураНабора						КАК НоменклатураНабора,
	|	Результат.ХарактеристикаНабора						КАК ХарактеристикаНабора,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Результат.ОсновнаяКомплектующая
	|				ТОГДА Результат.СтавкаНДС
	|			ИНАЧЕ NULL
	|		КОНЕЦ)											КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(МИНИМУМ(ВЫБОР
	|			КОГДА Результат.КоличествоПоУмолчанию <> 0
	|					И Результат.ОсновнаяКомплектующая
	|				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
	|			ИНАЧЕ NULL
	|		КОНЕЦ) + 0.5 КАК Число(10,0)) - 1				КАК Количество,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Результат.КоличествоПоУмолчанию <> 0
	|				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
	|			ИНАЧЕ NULL
	|		КОНЕЦ)											КАК КоэффициентМаксимум,
	|	ВЫРАЗИТЬ(МИНИМУМ(ВЫБОР
	|			КОГДА Результат.КоличествоПоУмолчанию <> 0
	|				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
	|			ИНАЧЕ NULL
	|		КОНЕЦ) + 0.5 КАК Число(10,0)) - 1				КАК КоэффициентМинимум
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительно
	|ИЗ
	|	ВременнаяТаблицаНаборыДополнительноЧастьВторая КАК Результат
	|
	|СГРУППИРОВАТЬ ПО
	|	Результат.Ссылка,
	|	Результат.ВариантКомплектацииНоменклатуры,
	|	Результат.ВариантРасчетаЦеныНабора,
	|	Результат.ВариантПредставленияНабораВПечатныхФормах,
	|	Результат.НоменклатураНабора,
	|	Результат.ХарактеристикаНабора
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 7
	|ВЫБРАТЬ
	|	Таблица.Ссылка														КАК Ссылка,
	|	Таблица.НомерСтроки													КАК НомерСтроки,
	|	ВременнаяТаблицаНаборыДополнительно.ВариантКомплектацииНоменклатуры	КАК ВариантКомплектацииНоменклатуры,
	|	ВЫБОР
	|		КОГДА Таблица.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
	|					ИНАЧЕ ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	|				КОНЕЦ
	|		ИНАЧЕ ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	|	КОНЕЦ																КАК ВариантПредставленияНабораВПечатныхФормах,
	|	ВЫБОР
	|		КОГДА Таблица.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор)
	|								ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
	|							ИНАЧЕ ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	|						КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)
	|								И ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора В(ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам),
	|																								ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям))
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)
	|					ИНАЧЕ ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора
	|				КОНЕЦ
	|			ИНАЧЕ ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора
	|	КОНЕЦ																КАК ВариантРасчетаЦеныНабора,
	|	Таблица.НоменклатураНабора											КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора										КАК ХарактеристикаНабора,
	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1)			КАК КоличествоУпаковок,
	|	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1)			КАК Количество,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаНаборыДополнительно.КоэффициентМинимум = ВременнаяТаблицаНаборыДополнительно.КоэффициентМаксимум
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ																КАК ПолныйНабор,
	|	Таблица.Сумма														КАК Сумма,
	|	Таблица.СуммаБезСкидки												КАК СуммаБезСкидки,
	|	Таблица.СуммаСкидки													КАК СуммаСкидки,
	|	Таблица.СуммаНДС													КАК СуммаНДС,
	|	ВременнаяТаблицаНаборыДополнительно.СтавкаНДС						КАК СтавкаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаНаборы
	|ИЗ
	|	ВременнаяТаблицаНаборыПодготовка КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборыДополнительно КАК ВременнаяТаблицаНаборыДополнительно
	|		ПО Таблица.НоменклатураНабора = ВременнаяТаблицаНаборыДополнительно.НоменклатураНабора
	|			И Таблица.ХарактеристикаНабора = ВременнаяТаблицаНаборыДополнительно.ХарактеристикаНабора
	|			И Таблица.Ссылка = ВременнаяТаблицаНаборыДополнительно.Ссылка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 8
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка										КАК Ссылка,
	|	ВложенныйЗапрос.НомерСтроки									КАК НомерСтроки,
	|	ВложенныйЗапрос.ВариантПредставленияНабораВПечатныхФормах	КАК ВариантПредставленияНабораВПечатныхФормах,
	|	ВложенныйЗапрос.ВариантРасчетаЦеныНабора					КАК ВариантРасчетаЦеныНабора,
	|	ВложенныйЗапрос.НоменклатураНабора							КАК НоменклатураНабора,
	|	ВложенныйЗапрос.ХарактеристикаНабора						КАК ХарактеристикаНабора,
	|	ВложенныйЗапрос.ЭтоНабор									КАК ЭтоНабор,
	|	ВложенныйЗапрос.ЭтоКомплектующие							КАК ЭтоКомплектующие,
	|	ВложенныйЗапрос.ПолныйНабор									КАК ПолныйНабор,
	|	ВложенныйЗапрос.Номенклатура								КАК Номенклатура,
	|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное				КАК ТоварНаименованиеПолное,
	|	ВложенныйЗапрос.Номенклатура.Код							КАК Код,
	|	ВложенныйЗапрос.Номенклатура.Артикул						КАК Артикул,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Наименование				КАК ЕдиницаЦены,
	|	ВложенныйЗапрос.ЕдиницаИзмерения							КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаИзмеренияТНВЭД.Представление КАК ЕдиницаИзмеренияТНВЭД,
	|	ВложенныйЗапрос.Характеристика.НаименованиеПолное			КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.Упаковка.Наименование
	|	КОНЕЦ														КАК Упаковка,
	|	ВложенныйЗапрос.КоличествоУпаковок							КАК Количество,
	|	ВложенныйЗапрос.КоличествоПоРНПТ							КАК КоличествоПоРНПТ,
	|	ВложенныйЗапрос.НомерГТД									КАК НомерГТД,
	|	ВложенныйЗапрос.НомерГТД.ТипНомераГТД						КАК ТипНомераГТД,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.НомерГТД.РегистрационныйНомер = """"
	|			ТОГДА ВложенныйЗапрос.НомерГТД.Представление
	|		ИНАЧЕ ВложенныйЗапрос.НомерГТД.РегистрационныйНомер
	|	КОНЕЦ														КАК НомерРНПТ,
	|	ВложенныйЗапрос.Цена										КАК Цена,
	|	ВложенныйЗапрос.Сумма										КАК Сумма,
	|	ВложенныйЗапрос.СуммаСкидки									КАК СуммаСкидки,
	|	ВложенныйЗапрос.СуммаБезСкидки								КАК СуммаБезСкидки,
	|	ВложенныйЗапрос.СтавкаНДС									КАК СтавкаНДС,
	|	ВложенныйЗапрос.СуммаНДС									КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Ссылка.ВернутьМногооборотнуюТару
	|				И ВложенныйЗапрос.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ														КАК ЭтоВозвратнаяТара
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Ссылка					КАК Ссылка,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0
	|				ТОГДА ВременнаяТаблицаНаборы.НомерСтроки
	|			ИНАЧЕ Таблица.НомерСтроки
	|		КОНЕЦ							КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0
	|				ТОГДА ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ПустаяСсылка)
	|		КОНЕЦ							КАК ВариантПредставленияНабораВПечатныхФормах,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0
	|				ТОГДА ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)
	|		КОНЕЦ							КАК ВариантРасчетаЦеныНабора,
	|		Таблица.НоменклатураНабора		КАК НоменклатураНабора,
	|		Таблица.ХарактеристикаНабора	КАК ХарактеристикаНабора,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ							КАК ЭтоКомплектующие,
	|		ЛОЖЬ							КАК ЭтоНабор,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0
	|				ТОГДА ВременнаяТаблицаНаборы.ПолныйНабор
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ							КАК ПолныйНабор,
	|		Таблица.Номенклатура			КАК Номенклатура,
	|		Таблица.Количество				КАК Количество,
	|		Таблица.КоличествоУпаковок		КАК КоличествоУпаковок,
	|		Таблица.КоличествоПоРНПТ		КАК КоличествоПоРНПТ,
	|		Таблица.НомерГТД				КАК НомерГТД,
	|		Таблица.Цена					КАК Цена,
	|		Таблица.Сумма					КАК Сумма,
	|		Таблица.СтавкаНДС				КАК СтавкаНДС,
	|		Таблица.СуммаНДС				КАК СуммаНДС,
	|		Таблица.Характеристика			КАК Характеристика,
	|		Таблица.Упаковка				КАК Упаковка,
	|		Таблица.ЕдиницаИзмерения		КАК ЕдиницаИзмерения,
	|		Таблица.СуммаСкидки				КАК СуммаСкидки,
	|		Таблица.СуммаБезСкидки			КАК СуммаБезСкидки
	|	ИЗ
	|		Товары КАК Таблица
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
	|			ПО ВременнаяТаблицаНаборы.НоменклатураНабора = Таблица.НоменклатураНабора
	|				И ВременнаяТаблицаНаборы.ХарактеристикаНабора = Таблица.ХарактеристикаНабора
	|				И ВременнаяТаблицаНаборы.Ссылка = Таблица.Ссылка
	|	
	|	ГДЕ
	|		Таблица.НоменклатураНабора = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		ИЛИ (Таблица.НоменклатураНабора <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			И ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах В(ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоКомплектующие),
	|																				ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие)))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВременнаяТаблицаНаборы.Ссылка										КАК Ссылка,
	|		ВременнаяТаблицаНаборы.НомерСтроки									КАК НомерСтроки,
	|		ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах	КАК ВариантПредставленияНабораВПечатныхФормах,
	|		ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора						КАК ВариантРасчетаЦеныНабора,
	|		ВременнаяТаблицаНаборы.НоменклатураНабора							КАК НоменклатураНабора,
	|		ВременнаяТаблицаНаборы.ХарактеристикаНабора							КАК ХарактеристикаНабора,
	|		ЛОЖЬ																КАК ЭтоКомплектующие,
	|		ИСТИНА																КАК ЭтоНабор,
	|		ВременнаяТаблицаНаборы.ПолныйНабор									КАК ПолныйНабор,
	|		ВременнаяТаблицаНаборы.НоменклатураНабора							КАК Номенклатура,
	|		ВременнаяТаблицаНаборы.Количество									КАК Количество,
	|		ВременнаяТаблицаНаборы.КоличествоУпаковок							КАК КоличествоУпаковок,
	|		0																	КАК КоличествоПоРНПТ,
	|		ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) КАК НомерГТД,
	|		ВЫБОР
	|			КОГДА &ОтображатьСкидки
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1) <> 0
	|							ТОГДА (ВременнаяТаблицаНаборы.СуммаБезСкидки) / ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1) <> 0
	|							ТОГДА (ВременнаяТаблицаНаборы.Сумма) / ЕСТЬNULL(ВременнаяТаблицаНаборы.КоличествоУпаковок, 1)
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|		КОНЕЦ																КАК Цена,
	|		ВременнаяТаблицаНаборы.Сумма										КАК Сумма,
	|		ВременнаяТаблицаНаборы.СтавкаНДС									КАК СтавкаНДС,
	|		ВременнаяТаблицаНаборы.СуммаНДС										КАК СуммаНДС,
	|		ВременнаяТаблицаНаборы.ХарактеристикаНабора							КАК Характеристика,
	|		ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)			КАК Упаковка,
	|		ВременнаяТаблицаНаборы.НоменклатураНабора.ЕдиницаИзмерения			КАК ЕдиницаИзмерения,
	|		ВременнаяТаблицаНаборы.СуммаСкидки									КАК СуммаСкидки,
	|		ВременнаяТаблицаНаборы.СуммаБезСкидки								КАК СуммаБезСкидки
	|	ИЗ
	|		ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
	|
	|	ГДЕ
	|		ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах В(ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор),
	|																			ЗНАЧЕНИЕ(Перечисление.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие))
	|	) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Ссылка,
	|	НомерСтроки,
	|	ЭтоНабор УБЫВ
	|
	|ИТОГИ
	|	СУММА(СуммаСкидки)
	|ПО
	|	Ссылка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 10
	|ВЫБРАТЬ
	|	Товары.Ссылка	КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				И НАЧАЛОПЕРИОДА(Товары.Ссылка.Дата, МЕСЯЦ) >= &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|				И ЕСТЬNULL(Товары.Ссылка.Соглашение.КомиссионерВедетУчетПоРНПТ, ЛОЖЬ)
	|				И Товары.Ссылка.ХозяйственнаяОперация В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию),
	|														ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионера))
	|				И ЕСТЬNULL(Товары.НомерГТД.ТипНомераГТД, НЕОПРЕДЕЛЕНО) В(ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.НомерРНПТ),
	|																		ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.НомерРНПТКомплекта))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ)			КАК ЕстьРНПТ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК Товары
	|
	|ГДЕ
	|	Товары.Ссылка В(&МассивДокументов)
	|	И Товары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры
	|		В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.Ссылка
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 10
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокумента.НомерГТД							КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА Комплектующие.НомерРНПТ.РегистрационныйНомер = """"
	|			ТОГДА Комплектующие.НомерРНПТ
	|		ИНАЧЕ Комплектующие.НомерРНПТ.РегистрационныйНомер
	|	КОНЕЦ												КАК НомерРНПТ,
	|	Комплектующие.КоличествоПоРНПТ						КАК КоличествоПоРНПТ,
	|	Комплектующие.ЕдиницаИзмеренияТНВЭД.Представление	КАК ЕдиницаИзмеренияТНВЭД
	|ИЗ
	|	Товары КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НомераГТД.ПрослеживаемыеКомплектующие КАК Комплектующие
	|		ПО ТаблицаДокумента.НомерГТД = Комплектующие.Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
								"&ТекстЗапросаКоэффициентУпаковки1",
								Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
									"РеализацияТоваровУслуг.Упаковка",
									"РеализацияТоваровУслуг.АналитикаУчетаНоменклатуры.Номенклатура"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
								"&ТекстЗапросаКоэффициентУпаковки2",
								Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
									"ВложенныйЗапрос.Упаковка",
									"ВложенныйЗапрос.Номенклатура"));
	
	Если ОбщегоНазначенияУТКлиентСервер.АвторизованВнешнийПользователь() Тогда
		УсловиеПоТипуНоменклатуры = "ИСТИНА";
	Иначе
		УсловиеПоТипуНоменклатуры =
			"РеализацияТоваровУслуг.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры В(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
			|																					ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоТипуНоменклатуры", УсловиеПоТипуНоменклатуры);
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	Запрос.УстановитьПараметр("ОтображатьСкидки", ОтображатьСкидки);
	
	УчетПрослеживаемыхТоваровЛокализация.УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Накладная";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатДанныеПечати				= МассивРезультатов[0]; // РезультатЗапроса - 
	РезультатВыборкаПоДокументам		= МассивРезультатов[8]; // РезультатЗапроса - 
	ДанныеПрослеживаемостиДокументов	= МассивРезультатов[9].Выгрузить(); // ТаблицаЗначений - 
	ПрослеживаемыеКомплектующие			= МассивРезультатов[10].Выгрузить(); // ТаблицаЗначений - 
	
	ДанныеПечати		= РезультатДанныеПечати.Выбрать();
	ВыборкаПоДокументам	= РезультатВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПоказыватьНДС = Константы.ВыводитьДопКолонкиНДС.Получить();
	
	ПервыйДокумент = Истина;
	ЕстьРНПТ = Ложь;
	
	ДанныеПрослеживаемостиДокументов.Индексы.Добавить("Ссылка");
	
	Пока ДанныеПечати.Следующий() Цикл
		
		// Найдем в выборке товары по текущему документу
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		НайденСледующий = ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
		
		// Если в накладной только услуги - перейдем к следующему документу
		Если НайденСледующий Тогда
			ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
			
			ЗаголовокСкидки = ФормированиеПечатныхФорм.НужноВыводитьСкидки(ВыборкаПоТоварам,
																			ИспользоватьРучныеСкидки
																				Или ИспользоватьАвтоматическиеСкидки);
			ЕстьСкидки		= ЗаголовокСкидки.ЕстьСкидки;
			ЕстьНДС			= ДанныеПечати.УчитыватьНДС;
			ЕстьРНПТ		= Ложь;
			
			ОтборСтрокДокументов = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
			СтрокиДокументов = ДанныеПрослеживаемостиДокументов.НайтиСтроки(ОтборСтрокДокументов);
			
			Если СтрокиДокументов.Количество() > 0 Тогда
				ЕстьРНПТ = СтрокиДокументов[0].ЕстьРНПТ;
			КонецЕсли;
			
			ВыборкаПоТоварам.Сбросить();
		Иначе
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В документе %1 отсутствуют товары. Печать накладной не требуется'"),
					ДанныеПечати.Ссылка);
			
			ОбщегоНазначения.СообщитьПользователю(Текст, ДанныеПечати.Ссылка);
			
			Продолжить;
		КонецЕсли;
		
		// Макет необходимо получать для каждого документа, т.к. размеры колонок изменяются динамически.
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_РеализацияТоваров");
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент		= Ложь;
		НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент,
																		Макет,
																		ОбластьМакета,
																		ДанныеПечати.Ссылка);
		ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(
							ДанныеПечати,
							НСтр("ru='Реализация товаров'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		СтруктураДанныхШапки = Новый Структура;
		СтруктураДанныхШапки.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокПодчеркивание");
		Если ЕстьРНПТ Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокПодчеркиваниеРНПТ");
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		
		ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(
									ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата),
									"ПолноеНаименование");
		
		СтруктураДанныхПоставщик = Новый Структура;
		СтруктураДанныхПоставщик.Вставить("ПредставлениеПоставщика", ПредставлениеПоставщика);
		СтруктураДанныхПоставщик.Вставить("Поставщик", ДанныеПечати.Организация);
		
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПоставщик);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		
		ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(
									ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Получатель, ДанныеПечати.Дата),
									"ПолноеНаименование");
		
		СтруктураДанныхПокупатель = Новый Структура;
		СтруктураДанныхПокупатель.Вставить("ПредставлениеПолучателя", ПредставлениеПолучателя);
		СтруктураДанныхПокупатель.Вставить("Получатель", ДанныеПечати.Получатель);
		
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПокупатель);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок таблицы Товары
		НазванияОбластейСтрок = НазванияОбластейСтрок(ЕстьСкидки, ЕстьНДС И ПоказыватьНДС, ЕстьРНПТ);
		НазванияОбластейКолонок = НазванияОбластейКолонок(ЕстьСкидки, ЕстьНДС И ПоказыватьНДС, ЕстьРНПТ);
		
		ОбластьКолонкаТовар = Макет.Область(НазванияОбластейКолонок.ПерваяКолонкаТовара);
		ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки
											+ ?(ВыводитьКоды,
												0,
												Макет.Область(НазванияОбластейКолонок.КолонкаКодов).ШиринаКолонки);
		
		ОбластьНомера			= Макет.ПолучитьОбласть(НазванияОбластейСтрок.ШапкаТаблицы
														+ "|" + НазванияОбластейКолонок.НомерСтроки);
		ОбластьКодов			= Макет.ПолучитьОбласть(НазванияОбластейСтрок.ШапкаТаблицы
														+ "|" + НазванияОбластейКолонок.КолонкаКодов);
		ОбластьТовар			= Макет.ПолучитьОбласть(НазванияОбластейСтрок.ШапкаТаблицы
														+ "|" + НазванияОбластейКолонок.Товар);
		ОбластьДанныеКоличество	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.ШапкаТаблицы
														+ "|" + НазванияОбластейКолонок.ДанныеКоличество);
		ОбластьДанныеНомерРНПТ	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.ШапкаТаблицы
														+ "|" + НазванияОбластейКолонок.ДанныеНомерРНПТ);
		ОбластьДанныеСуммовые	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.ШапкаТаблицы
														+ "|" + НазванияОбластейКолонок.ДанныеСуммовые);
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			СтруктураДанныхКоды = Новый Структура("ИмяКолонкиКодов", ПредставлениеКолонкиКодов);
			
			ОбластьКодов.Параметры.Заполнить(СтруктураДанныхКоды);
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанныеКоличество);
		
		Если ЕстьРНПТ Тогда
			ТабличныйДокумент.Присоединить(ОбластьДанныеНомерРНПТ);
		КонецЕсли;
		
		Если ЕстьСкидки Тогда
			СтруктураЗаголовокСкидки = Новый Структура("Скидка, СуммаБезСкидки",
														ЗаголовокСкидки.Скидка, ЗаголовокСкидки.СуммаСкидки);
			ОбластьДанныеСуммовые.Параметры.Заполнить(СтруктураЗаголовокСкидки);
		КонецЕсли;
		
		ТабличныйДокумент.Присоединить(ОбластьДанныеСуммовые);
		
		ОбластьНомераСтрокиСтандарт				= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицы
																		+ "|" + НазванияОбластейКолонок.НомерСтроки);
		ОбластьКодовСтрокиСтандарт				= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицы
																		+ "|" + НазванияОбластейКолонок.КолонкаКодов);
		ОбластьТоварСтрокиСтандарт				= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицы
																		+ "|" + НазванияОбластейКолонок.Товар);
		ОбластьДанныеКоличествоСтрокиСтандарт	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицы
																		+ "|" + НазванияОбластейКолонок.ДанныеКоличество);
		ОбластьДанныеНомерРНПТСтрокиСтандарт	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицы
																		+ "|" + НазванияОбластейКолонок.ДанныеНомерРНПТ);
		ОбластьДанныеСуммовыеСтрокиСтандарт		= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицы
																		+ "|" + НазванияОбластейКолонок.ДанныеСуммовые);
		
		ИспользоватьНаборы = Ложь;
		
		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ВыборкаПоДокументам, "ЭтоНабор") Тогда
			ИспользоватьНаборы = Истина;
			
			ОбластьНомераСтрокиНабор			= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыНабор
																		+ "|" + НазванияОбластейКолонок.НомерСтроки);
			ОбластьКодовСтрокиНабор				= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыНабор
																		+ "|" + НазванияОбластейКолонок.КолонкаКодов);
			ОбластьТоварСтрокиНабор				= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыНабор
																		+ "|" + НазванияОбластейКолонок.Товар);
			ОбластьДанныеКоличествоСтрокиНабор	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыНабор
																		+ "|" + НазванияОбластейКолонок.ДанныеКоличество);
			ОбластьДанныеНомерРНПТСтрокиНабор	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыНабор
																		+ "|" + НазванияОбластейКолонок.ДанныеНомерРНПТ);
			ОбластьДанныеСуммовыеНабор			= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыНабор
																		+ "|" + НазванияОбластейКолонок.ДанныеСуммовые);
			
			ОбластьНомераСтрокиКомплектующие			= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыКомплектующие
																				+ "|" + НазванияОбластейКолонок.НомерСтроки);
			ОбластьКодовСтрокиКомплектующие				= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыКомплектующие
																				+ "|" + НазванияОбластейКолонок.КолонкаКодов);
			ОбластьТоварСтрокиКомплектующие				= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыКомплектующие
																				+ "|" + НазванияОбластейКолонок.Товар);
			ОбластьДанныеКоличествоКомплектующие		= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыКомплектующие
																				+ "|" + НазванияОбластейКолонок.ДанныеКоличество);
			ОбластьДанныеНомерРНПТСтрокиКомплектующие	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыКомплектующие
																				+ "|" + НазванияОбластейКолонок.ДанныеНомерРНПТ);
			ОбластьДанныеСуммовыеКомплектующие			= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыКомплектующие
																				+ "|" + НазванияОбластейКолонок.ДанныеСуммовые);
		КонецЕсли;
		
		Сумма          = 0;
		СуммаНДС       = 0;
		ВсегоСкидок    = 0;
		НомерСтроки    = 0;
		ВсегоБезСкидок = 0;
		
		ПустыеДанные = НаборыСервер.ПустыеДанные();
		
		// Выводим строки таблицы Товары
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			Если НаборыСервер.ИспользоватьОбластьНабор(ВыборкаПоТоварам, ИспользоватьНаборы) Тогда
				ОбластьКодовСтроки				= ОбластьКодовСтрокиНабор;
				ОбластьНомераСтроки				= ОбластьНомераСтрокиНабор;
				ОбластьТоварСтроки				= ОбластьТоварСтрокиНабор;
				ОбластьДанныеКоличествоСтроки	= ОбластьДанныеКоличествоСтрокиНабор;
				ОбластьДанныеНомерРНПСтроки		= ОбластьДанныеНомерРНПТСтрокиНабор;
				ОбластьДанныеСуммовыеСтроки		= ОбластьДанныеСуммовыеНабор;
				
			ИначеЕсли НаборыСервер.ИспользоватьОбластьКомплектующие(ВыборкаПоТоварам, ИспользоватьНаборы) Тогда
				ОбластьКодовСтроки				= ОбластьКодовСтрокиКомплектующие;
				ОбластьНомераСтроки				= ОбластьНомераСтрокиКомплектующие;
				ОбластьТоварСтроки				= ОбластьТоварСтрокиКомплектующие;
				ОбластьДанныеКоличествоСтроки	= ОбластьДанныеКоличествоКомплектующие;
				ОбластьДанныеНомерРНПСтроки		= ОбластьДанныеНомерРНПТСтрокиКомплектующие;
				ОбластьДанныеСуммовыеСтроки		= ОбластьДанныеСуммовыеКомплектующие;
			Иначе
				ОбластьКодовСтроки				= ОбластьКодовСтрокиСтандарт;
				ОбластьНомераСтроки				= ОбластьНомераСтрокиСтандарт;
				ОбластьТоварСтроки				= ОбластьТоварСтрокиСтандарт;
				ОбластьДанныеКоличествоСтроки	= ОбластьДанныеКоличествоСтрокиСтандарт;
				ОбластьДанныеНомерРНПСтроки		= ОбластьДанныеНомерРНПТСтрокиСтандарт;
				ОбластьДанныеСуммовыеСтроки		= ОбластьДанныеСуммовыеСтрокиСтандарт;
			КонецЕсли;
			
			Если НаборыСервер.ВыводитьТолькоЗаголовок(ВыборкаПоТоварам, ИспользоватьНаборы) Тогда
				УстановитьПараметр(ОбластьНомераСтроки, "НомерСтроки", Неопределено);
			Иначе
				НомерСтроки = НомерСтроки + 1;
				УстановитьПараметр(ОбластьНомераСтроки, "НомерСтроки", НомерСтроки);
			КонецЕсли;
			#Вставка
			НайденныеСтроки=ДанныеПечати.Ссылка.Товары.НайтиСтроки(Новый Структура("Номенклатура",ВыборкаПоТоварам.Номенклатура));
			Если НайденныеСтроки.Количество()>0 Тогда
				ОбластьНомераСтроки.Параметры.Заполнить(НайденныеСтроки[0]);
			КонецЕсли;
			#КонецВставки
			
			Если ВыводитьКоды Тогда
				СтруктураДанныхКоды = Новый Структура("Артикул", ВыборкаПоТоварам[ИмяКолонкиКодов]);
				
				ОбластьКодовСтроки.Параметры.Заполнить(СтруктураДанныхКоды);
			КонецЕсли;
			
			ПрефиксИПостфикс = НаборыСервер.ПолучитьПрефиксИПостфикс(ВыборкаПоТоварам, ИспользоватьНаборы);
			
			ОбластьТоварСтроки.Параметры.Заполнить(ВыборкаПоТоварам);
			
			ДополнительныеПараметрыПолученияНаименованияДляПечати = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
			ДополнительныеПараметрыПолученияНаименованияДляПечати.ВозвратнаяТара	= ВыборкаПоТоварам.ЭтоВозвратнаяТара;
			ДополнительныеПараметрыПолученияНаименованияДляПечати.КодОсновногоЯзыка	= ОбщегоНазначения.КодОсновногоЯзыка();
			
			ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
											ВыборкаПоТоварам.ТоварНаименованиеПолное,
											ВыборкаПоТоварам.Характеристика,
											,
											,
											ДополнительныеПараметрыПолученияНаименованияДляПечати);
			Товар					= ПрефиксИПостфикс.Префикс + ПредставлениеНоменклатуры + ПрефиксИПостфикс.Постфикс;
			
			СтруктураДанныхТовар = Новый Структура("Товар", Товар);
			
			ОбластьТоварСтроки.Параметры.Заполнить(СтруктураДанныхТовар);
			
			Если ЗаголовокСкидки.ЕстьСкидки Тогда
				СуммаСкидки = ?(ЗаголовокСкидки.ТолькоНаценка, - ВыборкаПоТоварам.СуммаСкидки, ВыборкаПоТоварам.СуммаСкидки);
				СтруктураДанныхСуммаСкидки = Новый Структура("СуммаСкидки", СуммаСкидки);
				
				ОбластьДанныеСуммовыеСтроки.Параметры.Заполнить(СтруктураДанныхСуммаСкидки);
			КонецЕсли;
			
			Если НаборыСервер.ВыводитьТолькоЗаголовок(ВыборкаПоТоварам, ИспользоватьНаборы) Тогда
				ОбластьДанныеКоличествоСтроки.Параметры.Заполнить(ПустыеДанные);
				ОбластьДанныеСуммовыеСтроки.Параметры.Заполнить(ПустыеДанные);
			Иначе
				ОбластьДанныеКоличествоСтроки.Параметры.Заполнить(ВыборкаПоТоварам);
				ОбластьДанныеСуммовыеСтроки.Параметры.Заполнить(ВыборкаПоТоварам);
			КонецЕсли;
			
			Если ЕстьРНПТ
				И ЗначениеЗаполнено(ВыборкаПоТоварам.НомерГТД)
				И ВыборкаПоТоварам.НомерГТД <> Перечисления.ТипыНомеровГТД.НомерГТД Тогда
				
				Если ВыборкаПоТоварам.ТипНомераГТД = Перечисления.ТипыНомеровГТД.НомерРНПТ Тогда
					ДанныеНомераРНПТ = Новый Структура("НомерРНПТ, КоличествоПоРНПТ, ЕдиницаИзмеренияТНВЭД");
					ДанныеНомераРНПТ.НомерРНПТ				= СокрЛП(ВыборкаПоТоварам.НомерРНПТ);
					ДанныеНомераРНПТ.КоличествоПоРНПТ		= ВыборкаПоТоварам.КоличествоПоРНПТ;
					ДанныеНомераРНПТ.ЕдиницаИзмеренияТНВЭД	= СокрЛП(ВыборкаПоТоварам.ЕдиницаИзмеренияТНВЭД);
					
					ОбластьДанныеНомерРНПСтроки.Параметры.Заполнить(ДанныеНомераРНПТ);
					
					ТабличныйДокумент.Вывести(ОбластьНомераСтроки);
					Если ВыводитьКоды Тогда
						ТабличныйДокумент.Присоединить(ОбластьКодовСтроки);
					КонецЕсли;
					ТабличныйДокумент.Присоединить(ОбластьТоварСтроки);
					ТабличныйДокумент.Присоединить(ОбластьДанныеКоличествоСтроки);
					ТабличныйДокумент.Присоединить(ОбластьДанныеНомерРНПСтроки);
					ТабличныйДокумент.Присоединить(ОбластьДанныеСуммовыеСтроки);
					
				Иначе
					
					ОбластьНомераСтрокиРНПТНабор			= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыНаборРНПТ
																					+ "|" + НазванияОбластейКолонок.НомерСтроки);
					ОбластьКодовСтрокиРНПТНабор				= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыНаборРНПТ
																					+ "|" + НазванияОбластейКолонок.КолонкаКодов);
					ОбластьТоварСтрокиРНПТНабор				= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыНаборРНПТ
																					+ "|" + НазванияОбластейКолонок.Товар);
					ОбластьДанныеКоличествоСтрокиРНПТНабор	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыНаборРНПТ
																					+ "|" + НазванияОбластейКолонок.ДанныеКоличество);
					ОбластьДанныеСуммовыеСтрокиРНПТНабор	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыНаборРНПТ
																					+ "|" + НазванияОбластейКолонок.ДанныеСуммовые);
					
					ОбластьНомераСтрокиРНПТКомплектующие			= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыКомплектующиеРНПТ
																							+ "|" + НазванияОбластейКолонок.НомерСтроки);
					ОбластьКодовСтрокиРНПТКомплектующие				= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыКомплектующиеРНПТ
																							+ "|" + НазванияОбластейКолонок.КолонкаКодов);
					ОбластьТоварСтрокиРНПТКомплектующие				= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыКомплектующиеРНПТ
																							+ "|" + НазванияОбластейКолонок.Товар);
					ОбластьДанныеКоличествоСтрокиРНПТКомплектующие	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыКомплектующиеРНПТ
																							+ "|" + НазванияОбластейКолонок.ДанныеКоличество);
					ОбластьДанныеСуммовыеСтрокиРНПТКомплектующие	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.СтрокаТаблицыКомплектующиеРНПТ
																							+ "|" + НазванияОбластейКолонок.ДанныеСуммовые);
					
					ОбластьНомераСтрокиРНПТНабор.Параметры.Заполнить(ОбластьНомераСтроки.Параметры);
					ОбластьКодовСтрокиРНПТНабор.Параметры.Заполнить(ОбластьКодовСтроки.Параметры);
					ОбластьТоварСтрокиРНПТНабор.Параметры.Заполнить(ОбластьТоварСтроки.Параметры);
					ОбластьДанныеКоличествоСтрокиРНПТНабор.Параметры.Заполнить(ОбластьДанныеКоличествоСтроки.Параметры);
					ОбластьДанныеСуммовыеСтрокиРНПТНабор.Параметры.Заполнить(ОбластьДанныеСуммовыеСтроки.Параметры);
					
					ОтборСтрок = Новый Структура("НомерГТД", ВыборкаПоТоварам.НомерГТД);
					СтрокиКомплекта = ПрослеживаемыеКомплектующие.НайтиСтроки(ОтборСтрок);
					
					НомерСтрокиКомплекта = 1;
					
					Для Каждого СтрокаКомплекта Из СтрокиКомплекта Цикл
						ДанныеНомераРНПТ = Новый Структура("НомерРНПТ, КоличествоПоРНПТ, ЕдиницаИзмеренияТНВЭД");
						ДанныеНомераРНПТ.НомерРНПТ				= СокрЛП(СтрокаКомплекта.НомерРНПТ);
						ДанныеНомераРНПТ.КоличествоПоРНПТ		= ВыборкаПоТоварам.Количество * СтрокаКомплекта.КоличествоПоРНПТ;
						ДанныеНомераРНПТ.ЕдиницаИзмеренияТНВЭД	= СокрЛП(СтрокаКомплекта.ЕдиницаИзмеренияТНВЭД);
						
						ОбластьДанныеНомерРНПСтроки.Параметры.Заполнить(ДанныеНомераРНПТ);
						
						Если НомерСтрокиКомплекта = 1 Тогда
							ТабличныйДокумент.Вывести(ОбластьНомераСтрокиРНПТНабор);
							Если ВыводитьКоды Тогда
								ТабличныйДокумент.Присоединить(ОбластьКодовСтрокиРНПТНабор);
							КонецЕсли;
							ТабличныйДокумент.Присоединить(ОбластьТоварСтрокиРНПТНабор);
							ТабличныйДокумент.Присоединить(ОбластьДанныеКоличествоСтрокиРНПТНабор);
							ТабличныйДокумент.Присоединить(ОбластьДанныеНомерРНПСтроки);
							ТабличныйДокумент.Присоединить(ОбластьДанныеСуммовыеСтрокиРНПТНабор);
						Иначе
							ТабличныйДокумент.Вывести(ОбластьНомераСтрокиРНПТКомплектующие);
							Если ВыводитьКоды Тогда
								ТабличныйДокумент.Присоединить(ОбластьКодовСтрокиРНПТКомплектующие);
							КонецЕсли;
							ТабличныйДокумент.Присоединить(ОбластьТоварСтрокиРНПТКомплектующие);
							ТабличныйДокумент.Присоединить(ОбластьДанныеКоличествоСтрокиРНПТКомплектующие);
							ТабличныйДокумент.Присоединить(ОбластьДанныеНомерРНПСтроки);
							ТабличныйДокумент.Присоединить(ОбластьДанныеСуммовыеСтрокиРНПТКомплектующие);
						КонецЕсли;
						
						НомерСтрокиКомплекта = НомерСтрокиКомплекта + 1;
					КонецЦикла;
				КонецЕсли;
				
			Иначе
				ТабличныйДокумент.Вывести(ОбластьНомераСтроки);
				Если ВыводитьКоды Тогда
					ТабличныйДокумент.Присоединить(ОбластьКодовСтроки);
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьТоварСтроки);
				ТабличныйДокумент.Присоединить(ОбластьДанныеКоличествоСтроки);
				Если ЕстьРНПТ Тогда
					ДанныеНомераРНПТ = Новый Структура("НомерРНПТ, КоличествоПоРНПТ, ЕдиницаИзмеренияТНВЭД",
														"-", 0, "-");
					ОбластьДанныеНомерРНПСтроки.Параметры.Заполнить(ДанныеНомераРНПТ);
					
					ТабличныйДокумент.Присоединить(ОбластьДанныеНомерРНПСтроки);
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьДанныеСуммовыеСтроки);
			КонецЕсли;
			
			Если Не НаборыСервер.ИспользоватьОбластьКомплектующие(ВыборкаПоТоварам, ИспользоватьНаборы) Тогда
				Сумма		= Сумма + ВыборкаПоТоварам.Сумма;
				СуммаНДС	= СуммаНДС + ВыборкаПоТоварам.СуммаНДС;
				
				Если ЕстьСкидки Тогда
					ВсегоСкидок		= ВсегоСкидок + ВыборкаПоТоварам.СуммаСкидки;
					ВсегоБезСкидок	= ВсегоБезСкидок + ВыборкаПоТоварам.СуммаБезСкидки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		// Выводим подвал
		ОбластьНомера			= Макет.ПолучитьОбласть(НазванияОбластейСтрок.ПодвалТаблицы
														+ "|" + НазванияОбластейКолонок.НомерСтроки);
		ОбластьКодов			= Макет.ПолучитьОбласть(НазванияОбластейСтрок.ПодвалТаблицы
														+ "|" + НазванияОбластейКолонок.КолонкаКодов);
		ОбластьТовар			= Макет.ПолучитьОбласть(НазванияОбластейСтрок.ПодвалТаблицы
														+ "|" + НазванияОбластейКолонок.Товар);
		ОбластьДанныеКоличество	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.ПодвалТаблицы
														+ "|" + НазванияОбластейКолонок.ДанныеКоличество);
		ОбластьДанныеНомерРНПТ	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.ПодвалТаблицы
														+ "|" + НазванияОбластейКолонок.ДанныеНомерРНПТ);
		ОбластьДанныеСуммовые	= Макет.ПолучитьОбласть(НазванияОбластейСтрок.ПодвалТаблицы
														+ "|" + НазванияОбластейКолонок.ДанныеСуммовые);
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанныеКоличество);
		
		Если ЕстьРНПТ Тогда
			ТабличныйДокумент.Присоединить(ОбластьДанныеНомерРНПТ);
		КонецЕсли;
		
		СтруктураДанныхВсегоСкидки = Новый Структура;
		
		Если ЕстьСкидки Тогда
			СтруктураДанныхВсегоСкидки.Вставить("ВсегоСкидок", ?(ЗаголовокСкидки.ТолькоНаценка,-ВсегоСкидок, ВсегоСкидок));
			СтруктураДанныхВсегоСкидки.Вставить("ВсегоБезСкидок", ВсегоБезСкидок);
		КонецЕсли;
		СтруктураДанныхВсегоСкидки.Вставить("Всего", ФормированиеПечатныхФорм.ФорматСумм(Сумма));
		
		ОбластьДанныеСуммовые.Параметры.Заполнить(СтруктураДанныхВсегоСкидки);
		ТабличныйДокумент.Присоединить(ОбластьДанныеСуммовые);
		
		// Выводим ИтогоНДС
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетНДС") Тогда
			Область = Макет.ПолучитьОбласть("ПодвалНДС");
			Если ЕстьРНПТ Тогда
				Область = Макет.ПолучитьОбласть("ПодвалНДСРНПТ");
			КонецЕсли;
			
			Если ЕстьНДС Тогда
				НадписьНДС = ?(ДанныеПечати.ЦенаВключаетНДС,
								НСтр("ru='В том числе НДС:'", ОбщегоНазначения.КодОсновногоЯзыка()),
								НСтр("ru='Сумма НДС:'", ОбщегоНазначения.КодОсновногоЯзыка()));
			Иначе
				НадписьНДС = НСтр("ru='Без налога (НДС)'", ОбщегоНазначения.КодОсновногоЯзыка());
			КонецЕсли;
			
			СтруктураДанныхПодвалНДС = Новый Структура;
			СтруктураДанныхПодвалНДС.Вставить("ВсегоНДС",	СуммаНДС);
			СтруктураДанныхПодвалНДС.Вставить("НДС",		НадписьНДС);
			
			Область.Параметры.Заполнить(СтруктураДанныхПодвалНДС);
			ТабличныйДокумент.Присоединить(Область);
		КонецЕсли;
		
		// Выводим Сумму прописью
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		
		СуммаКПрописи	= Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
		ИтоговаяСтрока	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru='Всего наименований %1, на сумму %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
							ВыборкаПоТоварам.Количество(),
							ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
		СуммаПрописью	= РаботаСКурсамиВалютУТ.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта);
		
		СтруктураДанныхСуммаПрописью = Новый Структура;
		СтруктураДанныхСуммаПрописью.Вставить("ИтоговаяСтрока",	ИтоговаяСтрока);
		СтруктураДанныхСуммаПрописью.Вставить("СуммаПрописью",	СуммаПрописью);
		
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхСуммаПрописью);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим подписи
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		Если ЕстьРНПТ Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ПодписиРНПТ");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПечати.ОтпускПроизвел) Тогда
			СтруктураДанныхОтпускПроизвел = Новый Структура;
			СтруктураДанныхОтпускПроизвел.Вставить("ОтпускПроизвел",
													ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.ОтпускПроизвел, ДанныеПечати.Дата));
			
			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхОтпускПроизвел);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
														НомерСтрокиНачало,
														ОбъектыПечати,
														ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
