#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Список.УсловноеОформление.Элементы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АУ_Цвета.Цвет КАК Цвет,
	|	АУ_Цвета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.АУ_Цвета КАК АУ_Цвета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Цвет) Тогда
			Цвет = WebЦвета.Белый;
		Иначе
			Цвет = ЗначениеИзСтрокиВнутр(Выборка.Цвет);
		КонецЕсли;
		
		ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

		// Создаем условие отбора
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка"); // имя поля
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; // либо задаем свой
		//**** Значение для отбора
		ЭлементОтбора.ПравоеЗначение = Выборка.Ссылка;
		ЭлементОтбора.Использование = Истина;

		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Цвет);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Цвет);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
		
		ЭлементОтбора.Использование = Истина;

		// Создаем поля оформления
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Цвет");
		ПолеОформления.Использование = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти