#Область ПрограммныйИнтерфейс

#Область НастройкиВстраиванияФормПроверкиИПодбора

// Возвращает структуру, заполненную значениями по умолчанию, используемую для интеграции формы проверки и подбора
//   в прикладные документы конфигураци - потребителя библиотеки ГосИС. Если передана форма - сразу заполняет ее
//   специфику в переопределяемом модуле.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения, Неопределено - форма для которой возвращаются параметры интеграции
//
// Возвращаемое значение:
//  Массив Из См. ПараметрыИнтеграцииФормПроверкиИПодбора.
//
Функция ПараметрыИнтеграцииФормыПроверкиИПодбора(Форма = Неопределено) Экспорт
	
	ПараметрыИнтеграции = Новый Массив;
	
	Если Форма <> Неопределено Тогда
		ПроверкаИПодборПродукцииЕГАИС.ПриОпределенииПараметровИнтеграцииФормыПроверкиИПодбора(
			Форма, ПараметрыИнтеграции);
		ПроверкаИПодборПродукцииИСМП.ПриОпределенииПараметровИнтеграцииФормыПроверкиИПодбора(
			Форма, ПараметрыИнтеграции);
		ПроверкаИПодборПродукцииИСПереопределяемый.ПриОпределенииПараметровИнтеграцииФормыПроверкиИПодбора(
			Форма, ПараметрыИнтеграции);
	КонецЕсли;
	
	Возврат ПараметрыИнтеграции;
	
КонецФункции

#КонецОбласти

#Область РаботаСоСтатусамиПроверкиПодбораСтрок

// Подключить обработку кодов маркировки.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ЕстьТабличнаяЧастьШтрихкодыУпаковок - Булево - Есть табличная часть штрихкоды упаковок
//  ДополнительныеКлючиШтрихкодовУпаковок - Строка - Дополнительные ключи штрихкодов упаковок
Процедура ПодключитьОбработкуКодовМаркировки(Форма, ЕстьТабличнаяЧастьШтрихкодыУпаковок=Истина, ДополнительныеКлючиШтрихкодовУпаковок = "") Экспорт
	
	Форма.КэшМаркируемойПродукции = ПоместитьВоВременноеХранилище(
		ШтрихкодированиеИС.ИнициализацияКэшаМаркируемойПродукции(), Форма.УникальныйИдентификатор);

	Если ЕстьТабличнаяЧастьШтрихкодыУпаковок Тогда
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавитьТаблицуШтрихкодовУпаковок(Форма, Новый Соответствие, ДобавляемыеРеквизиты, ДополнительныеКлючиШтрихкодовУпаковок);
		ДобавитьТаблицуДатыКонтролейМаркировки(Форма, Новый Соответствие, ДобавляемыеРеквизиты);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;

	ШтрихкодированиеИС.ОбновитьКэшМаркируемойПродукции(Форма);
	
КонецПроцедуры

// Добавить таблицу штрихкодов упаковок (кешированные данные подобранной продукции).
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ПараметрыИнтеграции - Соответствие Из Произвольный - Параметры интеграции
//  ДобавляемыеРеквизиты - Массив Из РеквизитФормы - Добавляемые реквизиты
//  ДополнительныеКлючи - Строка - Дополнительные ключи
Процедура ДобавитьТаблицуШтрихкодовУпаковок(Форма, ПараметрыИнтеграции, ДобавляемыеРеквизиты, ДополнительныеКлючи = "") Экспорт
	
	Если ПараметрыИнтеграции.Получить("ДанныеШтрихкодовУпаковокГосИС") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыИнтеграции.Вставить("ДанныеШтрихкодовУпаковокГосИС", Новый Структура("Заполнение", Ложь));
	
	Таблица = Новый РеквизитФормы("ДанныеШтрихкодовУпаковокГосИС", Новый ОписаниеТипов("ТаблицаЗначений"));
	ДобавляемыеРеквизиты.Добавить(Таблица);
	
	Колонка = Новый РеквизитФормы("Сценарий", Новый ОписаниеТипов("Число"), "ДанныеШтрихкодовУпаковокГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("Номенклатура", Метаданные.ОпределяемыеТипы.Номенклатура.Тип, "ДанныеШтрихкодовУпаковокГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип, "ДанныеШтрихкодовУпаковокГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("Серия", Метаданные.ОпределяемыеТипы.СерияНоменклатуры.Тип, "ДанныеШтрихкодовУпаковокГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("Количество", Новый ОписаниеТипов("Число"), "ДанныеШтрихкодовУпаковокГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("БезКоличества", Новый ОписаниеТипов("Булево"), "ДанныеШтрихкодовУпаковокГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("ПодменнаяНоменклатура", Новый ОписаниеТипов("Булево"), "ДанныеШтрихкодовУпаковокГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("ШтрихкодыУпаковок", Новый ОписаниеТипов, "ДанныеШтрихкодовУпаковокГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	
	// Специфика таблицы
	ДополнительныеКлючиМассив = СтрРазделить(ДополнительныеКлючи, ",");
	
	Если ДополнительныеКлючиМассив.Найти("Справка2") <> Неопределено Тогда
		Колонка = Новый РеквизитФормы("Справка2",
			Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"),
			"ДанныеШтрихкодовУпаковокГосИС");
		ДобавляемыеРеквизиты.Добавить(Колонка);
	КонецЕсли;
	
	Если ДополнительныеКлючиМассив.Найти("ИдентификаторПроисхожденияВЕТИС") <> Неопределено Тогда
		Колонка = Новый РеквизитФормы("ИдентификаторПроисхожденияВЕТИС",
			Метаданные.ОпределяемыеТипы["ИдентификаторПроисхожденияВЕТИС"].Тип,
			"ДанныеШтрихкодовУпаковокГосИС");
		ДобавляемыеРеквизиты.Добавить(Колонка);
	КонецЕсли;
	
	Если ДополнительныеКлючиМассив.Найти("СрокГодности") <> Неопределено Тогда
		Колонка = Новый РеквизитФормы("СрокГодности",
			Новый ОписаниеТипов("Дата"),
			"ДанныеШтрихкодовУпаковокГосИС");
		ДобавляемыеРеквизиты.Добавить(Колонка);
	КонецЕсли;
	
	Если ДополнительныеКлючиМассив.Найти("GTIN") <> Неопределено Тогда
		Колонка = Новый РеквизитФормы("GTIN",
			Метаданные.ОпределяемыеТипы.GTIN.Тип,
			"ДанныеШтрихкодовУпаковокГосИС");
		ДобавляемыеРеквизиты.Добавить(Колонка);
	КонецЕсли;
	
	Если ДополнительныеКлючиМассив.Найти("КоличествоПотребительскихУпаковок") <> Неопределено Тогда
		Колонка = Новый РеквизитФормы("КоличествоПотребительскихУпаковок",
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3)),
			"ДанныеШтрихкодовУпаковокГосИС");
		ДобавляемыеРеквизиты.Добавить(Колонка);
	КонецЕсли;
	
КонецПроцедуры

// Процедура создает на форме кешированный список дат разделенного контроля по учитываемым товарным группам
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - прикладная или библиотечная форма
//  ПараметрыИнтеграции - Структура - параметры интеграции ГосИС
//  ДобавляемыеРеквизиты - Массив из РеквизитФормы - добавляемые на форму реквизиты
Процедура ДобавитьТаблицуДатыКонтролейМаркировки(Форма, ПараметрыИнтеграции, ДобавляемыеРеквизиты) Экспорт
	
	Если ПараметрыИнтеграции.Получить("ТаблицаКонтролейДатМаркировкиГосИС") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыИнтеграции.Вставить("ТаблицаКонтролейДатМаркировкиГосИС", Новый Структура("Заполнение", Ложь));
	
	Таблица = Новый РеквизитФормы("ТаблицаКонтролейДатМаркировкиГосИС", Новый ОписаниеТипов("ТаблицаЗначений"));
	ДобавляемыеРеквизиты.Добавить(Таблица);
	
	Колонка = Новый РеквизитФормы("ВидПродукции", Новый ОписаниеТипов("СправочникСсылка.КлючиВидовПродукцииИС"), "ТаблицаКонтролейДатМаркировкиГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("ДатаКонтрольПроизводства", Новый ОписаниеТипов("Дата"), "ТаблицаКонтролейДатМаркировкиГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("ДатаКонтрольВыводИзОборота", Новый ОписаниеТипов("Дата"), "ТаблицаКонтролейДатМаркировкиГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("ДатаРозницаУведомительныйРежим", Новый ОписаниеТипов("Дата"), "ТаблицаКонтролейДатМаркировкиГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("ДатаОптКонтрольПоштучно", Новый ОписаниеТипов("Дата"), "ТаблицаКонтролейДатМаркировкиГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("ДатаОптКонтрольОСУ", Новый ОписаниеТипов("Дата"), "ТаблицаКонтролейДатМаркировкиГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("ДатаЗапретПродажиНемаркированныхОстатков", Новый ОписаниеТипов("Дата"), "ТаблицаКонтролейДатМаркировкиГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	
КонецПроцедуры

#Область Товары

// Дополнить таблицу товаров.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ПараметрыИнтеграции - Соответствие Из Произвольный - Параметры интеграции
//  ПутьКРеквизиту - Строка - Путь к реквизиту-таблице формы
//  ДобавляемыеРеквизиты - Массив Из РеквизитФормы - Добавляемые реквизиты
Процедура ДополнитьТаблицуТоваров(Форма, ПараметрыИнтеграции, ПутьКРеквизиту, ДобавляемыеРеквизиты) Экспорт
	
	Если ПараметрыИнтеграции.Получить("ИнтерфейсШтрихкодовУпаковокГосИС") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыИнтеграции.Вставить("ИнтерфейсШтрихкодовУпаковокГосИС", Новый Структура("Заполнение", Ложь));
	
	Колонка = Новый РеквизитФормы("МаркируемаяПродукция", Новый ОписаниеТипов("Булево"), ПутьКРеквизиту, НСтр("ru = 'Маркируемая продукция'"));
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("ВидПродукцииИС", Новый ОписаниеТипов("СправочникСсылка.КлючиВидовПродукцииИС"), ПутьКРеквизиту, НСтр("ru = 'Вид продукции'"));
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("СтатусПроверкиГосИС", Новый ОписаниеТипов("Число"), ПутьКРеквизиту, НСтр("ru = 'Статус проверки подбора'"));
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("АвтоматическийОСУИС", Новый ОписаниеТипов("Булево"), ПутьКРеквизиту, НСтр("ru = 'Коды ОСУ формируются автоматически'"));
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("РазрешенОборотНемаркированныхОстатков", Новый ОписаниеТипов("Булево"), ПутьКРеквизиту, НСтр("ru = 'Действует разрешение на оборот немаркированных остатков маркируемой продукции'"));
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("ДействуетКонтрольОборотаМарок", Новый ОписаниеТипов("Булево"), ПутьКРеквизиту, НСтр("ru = 'Действует контроль оборота марок'"));
	ДобавляемыеРеквизиты.Добавить(Колонка);
	
КонецПроцедуры

#КонецОбласти

// Заполнить кеш штрихкодов упаковок.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  Настройки - См. НастройкиИсточникаКешаШтрихкодовУпаковок
//  Инициализация - Булево - Инициализация
Процедура ЗаполнитьКешШтрихкодовУпаковок(Форма, Настройки = Неопределено, Инициализация = Ложь) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.ШтрихкодыУпаковокТоваров) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если Настройки = Неопределено Тогда
		Настройки = НастройкиИсточникаКешаШтрихкодовУпаковок(Истина);
	КонецЕсли;
	
	Если Инициализация Тогда
		ПараметрыИнтеграцииГосИС = Новый Соответствие(Форма.ПараметрыИнтеграцииГосИС);
		Если ПараметрыИнтеграцииГосИС.Получить("ДанныеШтрихкодовУпаковокГосИС" + Настройки.Сценарий) <> Неопределено
				И ПараметрыИнтеграцииГосИС.Получить("ДанныеШтрихкодовУпаковокГосИС" + Настройки.Сценарий).Заполнение = Истина Тогда
			Возврат;
		КонецЕсли;
		ПараметрыИнтеграцииГосИС.Вставить("ДанныеШтрихкодовУпаковокГосИС" + Настройки.Сценарий, Новый Структура("Заполнение", Истина));
		Форма.ПараметрыИнтеграцииГосИС = Новый ФиксированноеСоответствие(ПараметрыИнтеграцииГосИС);
	КонецЕсли;
	
	ДанныеШтрихкодовУпаковокГосИС = Форма.ДанныеШтрихкодовУпаковокГосИС.Выгрузить(Новый Структура("Сценарий", Неопределено));
	Для Каждого СтрокаТЧ Из Форма.ДанныеШтрихкодовУпаковокГосИС Цикл
		Если СтрокаТЧ.Сценарий <> Настройки.Сценарий Тогда
			ЗаполнитьЗначенияСвойств(ДанныеШтрихкодовУпаковокГосИС.Добавить(), СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Настройки.Объект) Тогда
		Объект = Форма[Настройки.Объект];
	Иначе
		Объект = Форма;
	КонецЕсли;
	
	// Дополнительное поле сравнения
	ЕстьКоличествоПотребительскихКодов = ДанныеШтрихкодовУпаковокГосИС.Колонки.Найти("КоличествоПотребительскихУпаковок")<>Неопределено;
	
	ШтрихкодыУпаковокИсходнаяТаблица = Объект[Настройки.Штрихкоды].Выгрузить();
	
	// Частичное выбытие: строки, где указано количество в табличной части штрихкодов, обрабатываем индивидуально
	Если Настройки.ЧастичноеВыбытие Тогда
		СтрокиЧастичногоВыбытия = ШтрихкодыУпаковокИсходнаяТаблица.СкопироватьКолонки();
		Для Каждого СтрокаШтрихкод Из ШтрихкодыУпаковокИсходнаяТаблица Цикл
			Если ЗначениеЗаполнено(СтрокаШтрихкод.ЧастичноеВыбытиеКоличество) Тогда
				ЗаполнитьЗначенияСвойств(СтрокиЧастичногоВыбытия.Добавить(), СтрокаШтрихкод);
			КонецЕсли;
		КонецЦикла;
		ШтрихкодыУпаковокИсходнаяТаблица = ШтрихкодыУпаковокИсходнаяТаблица.Скопировать(Новый Структура("ЧастичноеВыбытиеКоличество", 0));
	КонецЕсли;
	
	// Дополнительные ключи связи, специфика: могут быть дубли строк с заполненными ключами (маркировка).
	ЭтоМаркировкаСоСпецификой = ДанныеШтрихкодовУпаковокГосИС.Колонки.Найти("ИдентификаторПроисхожденияВЕТИС")<>Неопределено;
	ЕстьСрокГодности = ДанныеШтрихкодовУпаковокГосИС.Колонки.Найти("СрокГодности") <> Неопределено;
	
	Специфика = Новый Массив;
	Если ЭтоМаркировкаСоСпецификой Тогда
		Для Каждого СтрокаШтрихкоды Из ШтрихкодыУпаковокИсходнаяТаблица Цикл
			Если ЗначениеЗаполнено(СтрокаШтрихкоды.СрокГодности)
					Или ЗначениеЗаполнено(СтрокаШтрихкоды.ИдентификаторПроисхожденияВЕТИС) Тогда
				Специфика.Добавить(СтрокаШтрихкоды.ШтрихкодУпаковки);
			КонецЕсли;
		КонецЦикла;
		Если Специфика.Количество() > 0 Тогда
			ШтрихкодыУпаковокИсходнаяТаблица.Индексы.Добавить("ШтрихкодУпаковки");
		Иначе
			ЭтоМаркировкаСоСпецификой = Ложь;
			ЕстьСрокГодности = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Дополнительные ключи связи, специфика: берем только строки с заполненными ключами (ЕГАИС).
	ЭтоЕГАИС = ДанныеШтрихкодовУпаковокГосИС.Колонки.Найти("Справка2") <> Неопределено;
	Если ЭтоЕГАИС Тогда
		Специфика = Новый Массив;
		Для Каждого СтрокаШтрихкоды Из ШтрихкодыУпаковокИсходнаяТаблица Цикл
			Если ЗначениеЗаполнено(СтрокаШтрихкоды.Справка2) Тогда
				Специфика.Добавить(СтрокаШтрихкоды.ШтрихкодУпаковки);
			КонецЕсли;
		КонецЦикла;
		Если Специфика.Количество() Тогда
			ШтрихкодыУпаковокИсходнаяТаблица.Индексы.Добавить("ШтрихкодУпаковки");
		Иначе
			ЭтоЕГАИС = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПоляПоиска = "Сценарий,Номенклатура,Характеристика,Серия";
	Если ЭтоЕГАИС Тогда
		ПоляПоиска = ПоляПоиска + ",Справка2";
	ИначеЕсли ЭтоМаркировкаСоСпецификой Тогда
		ПоляПоиска = ПоляПоиска + ",ИдентификаторПроисхожденияВЕТИС,СрокГодности";
	ИначеЕсли ЕстьСрокГодности Тогда
		ПоляПоиска = ПоляПоиска + ",СрокГодности";
	КонецЕсли;
	ДанныеШтрихкодовУпаковокГосИС.Индексы.Добавить(ПоляПоиска);
	
	// Дополнительные ключи связи, специфика: поля поиска для незаполненной номенклатуры.
	ЕстьGTIN = ДанныеШтрихкодовУпаковокГосИС.Колонки.Найти("GTIN")<>Неопределено;
	ПоляПоискаДляПустойНоменклатуры = ПоляПоиска + ",GTIN";
	Если ЕстьGTIN Тогда
		ДанныеШтрихкодовУпаковокГосИС.Индексы.Добавить(ПоляПоискаДляПустойНоменклатуры);
	КонецЕсли;
	
	МассивИменКолонокШтрихкодовУпаковки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		Настройки.ШтрихкодУпаковки, ",", Истина);
	ШтрихкодыУпаковок = Неопределено;
	Для Каждого ИмяКолонки Из МассивИменКолонокШтрихкодовУпаковки Цикл
		Если ШтрихкодыУпаковок = Неопределено Тогда
			ШтрихкодыУпаковок = ШтрихкодыУпаковокИсходнаяТаблица.ВыгрузитьКолонку(ИмяКолонки);
		Иначе
			ШтрихкодыУпаковокДополнительное = ШтрихкодыУпаковокИсходнаяТаблица.ВыгрузитьКолонку(ИмяКолонки);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ШтрихкодыУпаковок, ШтрихкодыУпаковокДополнительное);
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодыУпаковок.Ссылка            КАК Штрихкод,
	|	ШтрихкодыУпаковок.Номенклатура      КАК Номенклатура,
	|	ШтрихкодыУпаковок.Характеристика    КАК Характеристика,
	|	ШтрихкодыУпаковок.Серия             КАК Серия,
	|	ШтрихкодыУпаковок.Количество        КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ (&ПроизвольнаяЕдиницаУчета)
	|			ТОГДА 0
	|		КОГДА ШтрихкодыУпаковок.КоличествоПотребительскихУпаковок = 0
	|			ТОГДА ШтрихкодыУпаковок.Количество
	|		ИНАЧЕ ШтрихкодыУпаковок.КоличествоПотребительскихУпаковок
	|	КОНЕЦ                               КАК КоличествоПотребительскихУпаковок,
	|	ШтрихкодыУпаковок.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	|	ЛОЖЬ                                КАК ПодменнаяНоменклатура
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ЕстьВложенныеШтрихкоды
	|		ПО ЕстьВложенныеШтрихкоды.Ссылка = ШтрихкодыУпаковок.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|		ПО &ТоварыОписаниеНоменклатурыИС
	|ГДЕ
	|	ШтрихкодыУпаковок.Ссылка В (&ШтрихкодУпаковки)
	|	И (ЕстьВложенныеШтрихкоды.Ссылка ЕСТЬ NULL
	|		ИЛИ &ЭтоШтрихкодУпаковкиНабора)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕстьВложенныеШтрихкоды.Ссылка КАК Родитель,
	|	ЕстьВложенныеШтрихкоды.Штрихкод КАК Штрихкод,
	|	ЕстьВложенныеШтрихкоды.Штрихкод В (&УточненоОтдельно) КАК УточненоОтдельно
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ЕстьВложенныеШтрихкоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковок
	|		ПО ЕстьВложенныеШтрихкоды.Ссылка = ШтрихкодыУпаковок.Ссылка
	|		И ШтрихкодыУпаковок.Ссылка В (&ШтрихкодУпаковки)
	|ГДЕ
	|	ЕстьВложенныеШтрихкоды.Ссылка В (&ШтрихкодУпаковки)
	|		И Не &ЭтоШтрихкодУпаковкиНабора
	|";
	ОбщегоНазначенияИС.ОбновитьТекстЗапросаСРегистромОписаниеНоменклатурыИС(ТекстЗапроса, "ОписаниеНоменклатурыИС", "ШтрихкодыУпаковок.Номенклатура");
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Если Не Настройки.ВключаяКомплектующие Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, "&ЭтоШтрихкодУпаковкиНабора",
			"(ШтрихкодыУпаковок.КоличествоПотребительскихУпаковок = 1
			|	ИЛИ (ШтрихкодыУпаковок.КоличествоПотребительскихУпаковок = 0 И ШтрихкодыУпаковок.Количество = 1))");
	КонецЕсли;
	Запрос.УстановитьПараметр("ЭтоШтрихкодУпаковкиНабора", Ложь);
	Запрос.УстановитьПараметр("УточненоОтдельно", Специфика);
	
	КешВложенности = Новый Соответствие;
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	СтруктураПоискаДляПустойНоменклатуры = Новый Структура(ПоляПоискаДляПустойНоменклатуры);
	СтруктураПоиска.Сценарий = Настройки.Сценарий;
	СтруктураПоискаДляПустойНоменклатуры.Сценарий = Настройки.Сценарий;
	
	ОбходТаблицы = Истина;
	
	Пока ОбходТаблицы Цикл
		
		Запрос.УстановитьПараметр("ШтрихкодУпаковки", ШтрихкодыУпаковок);
		
		//@skip-check query-in-loop
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СоставУпаковки = МассивРезультатов[0].Выбрать();
		ВложенныеЗаписи = МассивРезультатов[1].Выбрать();
		НуженОбходДочерних = ВложенныеЗаписи.Количество();
		
		Пока СоставУпаковки.Следующий() Цикл
			
			ИсходныйШтрихкод = КешВложенности.Получить(СоставУпаковки.Штрихкод);
			Если ИсходныйШтрихкод = Неопределено Тогда
				ИсходныйШтрихкод = СоставУпаковки.Штрихкод;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СоставУпаковки);
			
			Если ЭтоЕГАИС Тогда
				Расшифровка = ШтрихкодыУпаковокИсходнаяТаблица.Найти(ИсходныйШтрихкод, "АкцизнаяМарка");
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, Расшифровка, "Справка2");
			ИначеЕсли ЭтоМаркировкаСоСпецификой Тогда
				Расшифровка = ШтрихкодыУпаковокИсходнаяТаблица.Найти(ИсходныйШтрихкод, "ШтрихкодУпаковки");
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, Расшифровка, "ИдентификаторПроисхожденияВЕТИС, СрокГодности");
			ИначеЕсли ЕстьСрокГодности Тогда
				Расшифровка = ШтрихкодыУпаковокИсходнаяТаблица.Найти(ИсходныйШтрихкод, "ШтрихкодУпаковки");
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, Расшифровка, "СрокГодности");
			КонецЕсли;
			
			Если ЕстьGTIN И Не ЗначениеЗаполнено(СтруктураПоиска.Номенклатура) Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПоискаДляПустойНоменклатуры, СтруктураПоиска);
				Если СтрНачинаетсяС(СоставУпаковки.ЗначениеШтрихкода, "(") Тогда
					СтруктураПоискаДляПустойНоменклатуры.GTIN = Сред(СоставУпаковки.ЗначениеШтрихкода, 5, 14);
				Иначе 
					СтруктураПоискаДляПустойНоменклатуры.GTIN = Сред(СоставУпаковки.ЗначениеШтрихкода, 1, 14);
				КонецЕсли;
				СтрокиКеша = ДанныеШтрихкодовУпаковокГосИС.НайтиСтроки(СтруктураПоискаДляПустойНоменклатуры);
			Иначе
				СтрокиКеша = ДанныеШтрихкодовУпаковокГосИС.НайтиСтроки(СтруктураПоиска);
			КонецЕсли;
			
			Если СтрокиКеша.Количество() Тогда
				
				СтрокиКеша0 = СтрокиКеша[0];
				Если ЕстьКоличествоПотребительскихКодов И СоставУпаковки.КоличествоПотребительскихУпаковок > 0 Тогда
					Если СоставУпаковки.Количество = 0 Тогда
						СтрокиКеша0.БезКоличества = Истина;
					КонецЕсли;
					СтрокиКеша0.Количество = СтрокиКеша0.Количество + СоставУпаковки.Количество;
					СтрокиКеша0.КоличествоПотребительскихУпаковок = СтрокиКеша0.КоличествоПотребительскихУпаковок + СоставУпаковки.КоличествоПотребительскихУпаковок;
				Иначе
					СтрокиКеша0.Количество = СтрокиКеша0.Количество + ?(СоставУпаковки.Количество = 0, 1, СоставУпаковки.Количество);
				КонецЕсли;
				СтрокиКеша0.ШтрихкодыУпаковок.Вставить(ИсходныйШтрихкод, Истина);
				
			Иначе
				
				НоваяСтрока = ДанныеШтрихкодовУпаковокГосИС.Добавить();
				НоваяСтрока.Сценарий = Настройки.Сценарий;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СоставУпаковки);
				Если СоставУпаковки.КоличествоПотребительскихУпаковок > 0 И СоставУпаковки.Количество = 0 Тогда
					НоваяСтрока.БезКоличества = Истина;
				ИначеЕсли НоваяСтрока.Количество = 0 Тогда
					НоваяСтрока.Количество = 1;
				КонецЕсли;
				Если ЕстьGTIN И Не ЗначениеЗаполнено(СтруктураПоиска.Номенклатура) Тогда
					НоваяСтрока.GTIN = СтруктураПоискаДляПустойНоменклатуры.GTIN;
				КонецЕсли;
				НоваяСтрока.ШтрихкодыУпаковок = Новый Соответствие;
				НоваяСтрока.ШтрихкодыУпаковок.Вставить(ИсходныйШтрихкод, Истина);
				Если ЭтоЕГАИС Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПоиска, "Справка2");
				ИначеЕсли ЭтоМаркировкаСоСпецификой Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПоиска, "ИдентификаторПроисхожденияВЕТИС, СрокГодности");
				ИначеЕсли ЕстьСрокГодности Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПоиска, "СрокГодности");
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НуженОбходДочерних Тогда
			ШтрихкодыУпаковок = Новый Массив;
			Пока ВложенныеЗаписи.Следующий() Цикл
				ИсходныйШтрихкод = КешВложенности.Получить(ВложенныеЗаписи.Родитель);
				Если ИсходныйШтрихкод = Неопределено Тогда
					ИсходныйШтрихкод = ВложенныеЗаписи.Родитель;
				КонецЕсли;
				КешВложенности.Вставить(ВложенныеЗаписи.Штрихкод, ИсходныйШтрихкод);
				Если ВложенныеЗаписи.УточненоОтдельно Тогда
					Для Каждого СтрокаКеша Из СтрокиКеша Цикл
						Если СтрокаКеша.ШтрихкодыУпаковок.Получить(ВложенныеЗаписи.Штрихкод) <> Неопределено Тогда
							СтрокаКеша.ШтрихкодыУпаковок.Вставить(ИсходныйШтрихкод, Истина);
						КонецЕсли;
					КонецЦикла;
				Иначе
					ШтрихкодыУпаковок.Добавить(ВложенныеЗаписи.Штрихкод);
				КонецЕсли;
			КонецЦикла;
			ОбходТаблицы = ШтрихкодыУпаковок.Количество() > 0;
		Иначе
			ОбходТаблицы = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	// Обработка строк с частичным выбытием
	Если Настройки.ЧастичноеВыбытие И СтрокиЧастичногоВыбытия.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ШтрихкодыУпаковки", СтрокиЧастичногоВыбытия);
		Запрос.УстановитьПараметр("ПустаяСерия",       ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры"));
		Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ
		|	Штрихкоды.%1                             КАК ШтрихкодУпаковки,
		|	Штрихкоды.ЧастичноеВыбытиеКоличество     КАК Количество,
		|	Штрихкоды.ЧастичноеВыбытиеВариантУчета   КАК ВариантУчета,
		|	Штрихкоды.ЧастичноеВыбытиеНоменклатура   КАК НоменклатураЧастичногоВыбытия,
		|	Штрихкоды.ЧастичноеВыбытиеХарактеристика КАК ХарактеристикаЧастичногоВыбытия
		|ПОМЕСТИТЬ ЧастичноеВыбытие
		|ИЗ
		|	&ШтрихкодыУпаковки КАК Штрихкоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штрихкоды.Ссылка КАК Штрихкод,
		|	ВЫБОР
		|		КОГДА ЧастичноеВыбытие.ВариантУчета = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаЧастичногоВыбытияИС.НастроеннаяНоменклатура)
		|			ТОГДА ЧастичноеВыбытие.НоменклатураЧастичногоВыбытия
		|		ИНАЧЕ Штрихкоды.Номенклатура
		|	КОНЕЦ КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ЧастичноеВыбытие.ВариантУчета = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаЧастичногоВыбытияИС.НастроеннаяНоменклатура)
		|			ТОГДА ЧастичноеВыбытие.ХарактеристикаЧастичногоВыбытия
		|		ИНАЧЕ Штрихкоды.Характеристика
		|	КОНЕЦ КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ЧастичноеВыбытие.ВариантУчета = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаЧастичногоВыбытияИС.НастроеннаяНоменклатура)
		|			ТОГДА &ПустаяСерия
		|		ИНАЧЕ Штрихкоды.Серия
		|	КОНЕЦ КАК Серия,
		|	ВЫБОР
		|		КОГДА ЧастичноеВыбытие.ВариантУчета = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаЧастичногоВыбытияИС.НастроеннаяНоменклатура)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПодменнаяНоменклатура,
		|	ЧастичноеВыбытие.Количество КАК Количество,
		|	Штрихкоды.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	1 КАК КоличествоПотребительскихУпаковок
		|ИЗ
		|	ЧастичноеВыбытие КАК ЧастичноеВыбытие
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК Штрихкоды
		|		ПО Штрихкоды.Ссылка = ЧастичноеВыбытие.ШтрихкодУпаковки
		|", Настройки.ШтрихкодУпаковки);
		СоставУпаковки = Запрос.Выполнить().Выбрать();
		Пока СоставУпаковки.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СоставУпаковки);
			СтрокиКеша = ДанныеШтрихкодовУпаковокГосИС.НайтиСтроки(СтруктураПоиска);
			
			Если СтрокиКеша.Количество() Тогда
				СтрокиКеша0 = СтрокиКеша[0];
				СтрокиКеша0.Количество = СтрокиКеша0.Количество + СоставУпаковки.Количество;
				Если ЕстьКоличествоПотребительскихКодов Тогда
					СтрокиКеша0.КоличествоПотребительскихУпаковок = СтрокиКеша0.КоличествоПотребительскихУпаковок + 1;
				КонецЕсли;
				СтрокиКеша0.ШтрихкодыУпаковок.Вставить(СоставУпаковки.Штрихкод, Истина);
			Иначе
				НоваяСтрока = ДанныеШтрихкодовУпаковокГосИС.Добавить();
				НоваяСтрока.Сценарий = Настройки.Сценарий;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СоставУпаковки);
				НоваяСтрока.ШтрихкодыУпаковок = Новый Соответствие;
				НоваяСтрока.ШтрихкодыУпаковок.Вставить(СоставУпаковки.Штрихкод, Истина);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Политики учета серий могут предусматривать различное указание серий в разных документах.
	// Если в конкретном документе серии по номенклатуре не указываются, добавление в него кодов маркировки с сериями
	//   ошибкой не является и обрабатывается как код маркировки без серии.
	ЭтоПрикладнойДокумент = Не Настройки.ВсеМаркируемые;
	Если ЭтоПрикладнойДокумент Тогда
		
		ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Форма);
		
		Если ЗначениеЗаполнено(ПараметрыСканирования.ПараметрыУказанияСерий) Тогда
			
			УдалитьСтроки = Новый Массив;
			Для Каждого СтрокаКеша Из ДанныеШтрихкодовУпаковокГосИС Цикл
				Если СтрокаКеша.Сценарий <> Настройки.Сценарий Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаКеша.Серия)
					И Не ОбщегоНазначенияИС.ТребуетсяВыборСерии(СтрокаКеша, ПараметрыСканирования) Тогда
					
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаКеша);
					СтруктураПоиска.Серия = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры");
					СтрокиБезСерий = ДанныеШтрихкодовУпаковокГосИС.НайтиСтроки(СтруктураПоиска);
					Если СтрокиБезСерий.Количество() Тогда
						СтрокаПриемник = СтрокиБезСерий[0];
						СтрокаПриемник.Количество = СтрокаПриемник.Количество + СтрокаКеша.Количество;
						СтрокаПриемник.БезКоличества = СтрокаПриемник.БезКоличества Или СтрокаКеша.БезКоличества;
						Если ЕстьКоличествоПотребительскихКодов Тогда
							СтрокаПриемник.КоличествоПотребительскихУпаковок = СтрокаПриемник.КоличествоПотребительскихУпаковок + СтрокаКеша.КоличествоПотребительскихУпаковок;
						КонецЕсли;
						Для Каждого ШтрихкодУпаковки Из СтрокаКеша.ШтрихкодыУпаковок Цикл
							СтрокаПриемник.ШтрихкодыУпаковок.Вставить(ШтрихкодУпаковки.Ключ, Истина);
						КонецЦикла;
						УдалитьСтроки.Добавить(СтрокаКеша);
					Иначе
						СтрокаКеша.Серия = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры");
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого СтрокаКеша Из УдалитьСтроки Цикл
				ДанныеШтрихкодовУпаковокГосИС.Удалить(СтрокаКеша);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ДанныеШтрихкодовУпаковокГосИС Цикл
		Если СтрокаТаблицы.Сценарий = Настройки.Сценарий Тогда
			СтрокаТаблицы.ШтрихкодыУпаковок = Новый ФиксированноеСоответствие(СтрокаТаблицы.ШтрихкодыУпаковок);
		КонецЕсли;
	КонецЦикла;
	
	Форма.ДанныеШтрихкодовУпаковокГосИС.Загрузить(ДанныеШтрихкодовУпаковокГосИС);
	
КонецПроцедуры

// Возвращает настройки, используемые для встраивания интерфейса кеша штрихкодов упаковок в конкретную форму.
// 
// Параметры:
//  ЭтоДокументГосИС - Булево - преднастройка для библиотечных документов (все товары маркируемые)
// 
// Возвращаемое значение:
//  Структура -- настройки встраивания:
// * Объект - Строка - имя реквизита формы Объект (сама форма если пусто).
// * ВсеМаркируемые - Булево - истина - не проверять товары на признак "Маркируемые".
// * ИспользоватьОСУ - Булево - истина - проверять товары на признак "АвтоматическийОСУИС".
// * Сценарий - Число - индекс используемой настройки.
// * Штрихкоды - Строка - имя табличной части "Штрихкоды упаковок".
// * ШтрихкодУпаковки - Строка - имя колонки табличной части "Штрихкоды упаковок" содержащей ссылку на штрихкод.
// * Товары - Строка - имя табличной части "Товары".
// * Серии - Строка - имя табличной части "Серии".
// * Количество - Строка - имя колонки "Количество" в табличных частях.
// * ЧастичноеВыбытие - Булево - в документе осуществляется частичное выбытие по кодам маркировки
// * ВключаяКомплектующие - Булево - для маркировки наборов в документе "Маркировка товаров ИС МП"
Функция НастройкиИсточникаКешаШтрихкодовУпаковок(ЭтоДокументГосИС = Ложь) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Объект",          "Объект");
	Результат.Вставить("ВсеМаркируемые",  ЭтоДокументГосИС);
	Результат.Вставить("ИспользоватьОСУ", Не ЭтоДокументГосИС);
	
	Результат.Вставить("Сценарий",         0);
	Результат.Вставить("Штрихкоды",        "ШтрихкодыУпаковок");
	Результат.Вставить("ШтрихкодУпаковки", "ШтрихкодУпаковки");
	
	Результат.Вставить("Товары", "Товары");
	Результат.Вставить("Серии",  "");
	
	Результат.Вставить("Количество", "Количество");
	Результат.Вставить("ЧастичноеВыбытие", Ложь);
	
	Результат.Вставить("ВключаяКомплектующие", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Обновляет статусы проверки и подбора в строках таблицы товаров формы (документа)
//
// Параметры:
//   Форма               - ФормаКлиентскогоПриложения - форма для обновления статусов строк.
//   Настройки           - Неопределено, Структура    - (См. НастройкиИсточникаКешаШтрихкодовУпаковок).
//   ОбновитьТовары      - Булево                     - необходимость обновить таблицу товаров по таблице штрихкодов.
//   ДополнительныеКлючи - Строка                     - ключи связи строк табличных частей.
//
Процедура ПрименитьКешШтрихкодовУпаковок(Форма, Настройки = Неопределено, ОбновитьТовары = Ложь, ДополнительныеКлючи = "") Экспорт
	
	Если Настройки = Неопределено Тогда
		Настройки = НастройкиИсточникаКешаШтрихкодовУпаковок(Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройки.Объект) Тогда
		Объект = Форма[Настройки.Объект];
	Иначе
		Объект = Форма;
	КонецЕсли;
	
	ТабличнаяЧастьТовары = Объект[Настройки.Товары];
	
	Если ЗначениеЗаполнено(Настройки.Серии) И Объект[Настройки.Серии].Количество() Тогда
		ТабличнаяЧастьСерии = Объект[Настройки.Серии];
	Иначе
		ТабличнаяЧастьСерии = Неопределено;
	КонецЕсли;
	
	ОбновитьПризнакиКонтроляОборотаМарок(Форма, ТабличнаяЧастьТовары, Настройки);
	ЗаполнитьПризнакМаркируемаяПродукцияГосИС(ТабличнаяЧастьТовары, Настройки);
	
	КолонкиТаблицыТовары = ТабличнаяЧастьТовары.Выгрузить(Новый Массив).Колонки;
	СтруктураПоиска = Новый Структура("Номенклатура");
	СтруктураПоискаБезСерий = Новый Структура("Номенклатура");
	Если КолонкиТаблицыТовары.Найти("Характеристика")<> Неопределено Тогда
		СтруктураПоиска.Вставить("Характеристика");
		СтруктураПоискаБезСерий.Вставить("Характеристика");
	КонецЕсли;
	Если КолонкиТаблицыТовары.Найти("Серия")<> Неопределено Тогда
		СтруктураПоиска.Вставить("Серия");
	КонецЕсли;
	Для Каждого КлючПоиска Из СтрРазделить(ДополнительныеКлючи, ",", Ложь) Цикл
		СтруктураПоиска.Вставить(КлючПоиска);
	КонецЦикла;
	
	// Дополнительное поле сравнения
	ЕстьКоличествоПотребительскихКодов = Форма.ДанныеШтрихкодовУпаковокГосИС.Выгрузить(Новый Массив).Колонки.Найти("КоличествоПотребительскихУпаковок")<>Неопределено;
	
	Если ОбновитьТовары Тогда
		ТабличнаяЧастьШтрихкоды = Объект[Настройки.Штрихкоды];
		УдалитьСвязанныеШтрихкодыУпаковок = Новый Соответствие;
		УдалитьСтрокиШтрихкодов = Новый Массив;
		//Удалились товары
		Для Каждого СтрокаТовары Из Форма.ДанныеШтрихкодовУпаковокГосИС Цикл
			Если СтрокаТовары.Сценарий <> Настройки.Сценарий Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовары);
			ЗаполнитьЗначенияСвойств(СтруктураПоискаБезСерий, СтрокаТовары);
			//Специфика: GTIN используется только при пустой номенклатуре
			Если СтруктураПоиска.Свойство("GTIN") И ЗначениеЗаполнено(СтруктураПоиска.Номенклатура) Тогда
				СтруктураПоиска.GTIN = "";
			КонецЕсли;
			
			Если СтрокаТовары.ПодменнаяНоменклатура Тогда
				СтрокиТовары = ТабличнаяЧастьТовары.НайтиСтроки(СтруктураПоискаБезСерий);
			Иначе
				СтрокиТовары = ТабличнаяЧастьТовары.НайтиСтроки(СтруктураПоиска);
			КонецЕсли;
			
			Если СтрокиТовары.Количество() = 0 И ТабличнаяЧастьСерии <> Неопределено Тогда
				СтрокиТовары = ТабличнаяЧастьТовары.НайтиСтроки(СтруктураПоискаБезСерий);
				Если СтрокиТовары.Количество() Тогда
					СтрокиТовары = ТабличнаяЧастьСерии.НайтиСтроки(СтруктураПоиска);
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокиТовары.Количество() = 0 Тогда
				Для Каждого ЭлементСоответствия Из СтрокаТовары.ШтрихкодыУпаковок Цикл
					УдалитьСвязанныеШтрихкодыУпаковок.Вставить(ЭлементСоответствия.Ключ, Истина);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		ИмяКолонкиШтрихкодУпаковки = СтрРазделить(Настройки.ШтрихкодУпаковки, ",", Ложь)[0];
		Если УдалитьСвязанныеШтрихкодыУпаковок.Количество() Тогда
			//Удалим все упаковки верхнего уровня где они есть из ТЧ
			Для Каждого СтрокаШтрихкоды Из ТабличнаяЧастьШтрихкоды Цикл
				Если УдалитьСвязанныеШтрихкодыУпаковок.Получить(СтрокаШтрихкоды[ИмяКолонкиШтрихкодУпаковки])=Истина Тогда
					УдалитьСтрокиШтрихкодов.Добавить(СтрокаШтрихкоды);
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаУдалить Из УдалитьСтрокиШтрихкодов Цикл
				ТабличнаяЧастьШтрихкоды.Удалить(СтрокаУдалить);
			КонецЦикла;
			ЗаполнитьКешШтрихкодовУпаковок(Форма, Настройки);
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаТовары Из ТабличнаяЧастьТовары Цикл
		
		ДействуетКонтрольОборотаМарок = ?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "ДействуетКонтрольОборотаМарок"),
			СтрокаТовары.ДействуетКонтрольОборотаМарок, Истина);
		
		Если Настройки.ВсеМаркируемые
			Или СтрокаТовары.МаркируемаяПродукция Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовары);
			
			//Специфика: GTIN используется только при пустой номенклатуре
			Если СтруктураПоиска.Свойство("GTIN") И ЗначениеЗаполнено(СтруктураПоиска.Номенклатура) Тогда
				СтруктураПоиска.GTIN = "";
			КонецЕсли;
			
			СтрокиКеша = Форма.ДанныеШтрихкодовУпаковокГосИС.НайтиСтроки(СтруктураПоиска);
			СтрокиТовары = ТабличнаяЧастьТовары.НайтиСтроки(СтруктураПоиска);
			
			Если СтрокиКеша.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПоискаБезСерий, СтрокаТовары);
				СтрокиКешаБезСерий = Форма.ДанныеШтрихкодовУпаковокГосИС.НайтиСтроки(СтруктураПоискаБезСерий);
				Если (ТабличнаяЧастьСерии <> Неопределено Или СтрокиКешаБезСерий.Количество() <> 0) Тогда
					СтрокиКеша = СтрокиКешаБезСерий;
					СтрокиТовары = ТабличнаяЧастьТовары.НайтиСтроки(СтруктураПоискаБезСерий);
				КонецЕсли;
			КонецЕсли;
			
			КоличествоПоКлючу = 0;
			Для Каждого СтрокаПоКлючу Из СтрокиТовары Цикл
				КоличествоПоКлючу = КоличествоПоКлючу + СтрокаПоКлючу[Настройки.Количество];
			КонецЦикла;
			
			КоличествоВКеше = 0;
			БезКоличества = Ложь;
			Для Каждого СтрокаПоКлючу Из СтрокиКеша Цикл
				КоличествоВКеше = КоличествоВКеше + СтрокаПоКлючу.Количество;
				БезКоличества = БезКоличества Или СтрокаПоКлючу.БезКоличества;
			КонецЦикла;
			КоличествоВКеше = Окр(КоличествоВКеше, 3);
			
			КоличествоПотребительскихКодовРазница = 0;
			Если ЕстьКоличествоПотребительскихКодов Тогда
				Для Каждого СтрокаПоКлючу Из СтрокиТовары Цикл
					КоличествоПотребительскихКодовРазница = КоличествоПотребительскихКодовРазница + СтрокаПоКлючу.КоличествоПотребительскихУпаковок;
				КонецЦикла;
				Для Каждого СтрокаПоКлючу Из СтрокиКеша Цикл
					КоличествоПотребительскихКодовРазница = КоличествоПотребительскихКодовРазница - СтрокаПоКлючу.КоличествоПотребительскихУпаковок;
				КонецЦикла;
			КонецЕсли;
			
			// Легенда:
			// 0 - пустая иконка. 				Продукция немаркируемая.
			// 1 - зеленая иконка.				Продукция маркируемая, отсканировано столько марок, сколько требуется единиц товара.
			// 2 - красная иконка.				Продукция маркируемая, марок нет совсем или отсканировано недостаточно.
			// 3 - голубая иконка.				Продукция требует взвешивания.
			// 4 - серая иконка.				Марки отгружаются по ОСУ. Конкретные коды ОСУ не указаны.
			// 5 - ?
			// 6 - иконка с вопросом.			Разрешен оборот немаркируемых остатков, марки не отсканированы.
			// 7 - иконка с вопросом и зеленым.	Разрешен оборот немаркируемых остатков, отсканированы марки или подобраны по ОСУ, но не по всему количеству.
			
			Если СтрокиКеша.Количество() = 0 Тогда
				//установлено ранее
			ИначеЕсли КоличествоПоКлючу = КоличествоВКеше // Штучная продукция
				И (Не ЕстьКоличествоПотребительскихКодов Или КоличествоПотребительскихКодовРазница = 0) Тогда
				СтрокаТовары.СтатусПроверкиГосИС = 1;
			ИначеЕсли БезКоличества И Не ЕстьКоличествоПотребительскихКодов Тогда
				СтрокаТовары.СтатусПроверкиГосИС = 3;
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "РазрешенОборотНемаркированныхОстатков")
				И (СтрокаТовары.РазрешенОборотНемаркированныхОстатков Или Не ДействуетКонтрольОборотаМарок)
				И КоличествоПоКлючу > КоличествоВКеше
				И КоличествоВКеше > 0
				И (Не ЕстьКоличествоПотребительскихКодов Или КоличествоПотребительскихКодовРазница > 0) Тогда
				СтрокаТовары.СтатусПроверкиГосИС = 7;
			ИначеЕсли ДействуетКонтрольОборотаМарок Тогда
				СтрокаТовары.СтатусПроверкиГосИС = 2;
			Иначе
				СтрокаТовары.СтатусПроверкиГосИС = 0;
			КонецЕсли;
			
		Иначе
			СтрокаТовары.СтатусПроверкиГосИС = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область Штрихкодирование

//Для связи механизма штрихкодирования и кеша строк: является входящим параметром
//   при обработке данных кода маркировки (добавлении кода маркировки или упаковки в таблицу штрихкодов упаковок),
//   для обновления кеша штрихкодов упаковок добавлением вместо пересчета.
//
//Параметры:
//   ДанныеШтрихкода - Структура, СтрокаДереваЗначений - разобранные данные штрихкода.
//   Специфика       - Строка - ключ описания специфики данных штрихкода.
//
//Возвращаемое значение:
//   Структура - поля кеша и служебная информация:
// 
// * Специфика - Строка - специфика штрихкода и кеша
// 
// * ШтрихкодУпаковки - СправочникСсылка.ШтрихкодыУпаковокТоваров  - добавляемый штрихкод.
// * Номенклатура     - ОпределяемыйТип.Номенклатура               - номенклатура из упаковки или кода маркировки.
// * Характеристика   - ОпределяемыйТип.ХарактеристикаНоменклатуры - характеристика из упаковки или кода маркировки.
// * Серия            - ОпределяемыйТип.СерияНоменклатуры          - серия из упаковки или кода маркировки.
// * Количество       - Число                                      - количество добавленных единиц.
// * GTIN - ОпределяемыйТип.GTIN - GTIN номенклатуры (если доступны коды маркировки остатков);
// * ИдентификаторПроисхожденияВЕТИС - ОпределяемыйТип.ИдентификаторПроисхожденияВЕТИС - для маркировки продукции ВетИС;
// * СрокГодности                    - Дата                                            - для маркировки продукции ВетИС;
// * СкоропортящаясяПродукция   - Булево                                               - для маркировки продукции ВетИС;
// * ШтрихкодОднороднойУпаковки      - СправочникСсылка.ШтрихкодыУпаковокТоваров       - для маркировки продукции ВетИС;
// * ЧастичноеВыбытиеОтдельнойНоменклатуры - Булево - при добавлении отдельной номенклатуры частичного выбытия
//
Функция ДанныеШтрихкодаДляДобавленияВКеш(ДанныеШтрихкода, Специфика = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Специфика", Специфика);
	
	Результат.Вставить("Номенклатура");
	Результат.Вставить("Характеристика");
	Результат.Вставить("Серия");
	Результат.Вставить("Количество");
	Результат.Вставить("КоличествоУпаковок");
	Результат.Вставить("ШтрихкодУпаковки");
	Результат.Вставить("ЧастичноеВыбытиеОтдельнойНоменклатуры", Ложь);
	Результат.Вставить("ЧастичноеВыбытиеНоменклатура");
	Результат.Вставить("ЧастичноеВыбытиеХарактеристика");
	Результат.Вставить("ЧастичноеВыбытиеВариантУчета");
	Результат.Вставить("ЧастичноеВыбытиеКоличество");
	Результат.Вставить("СтрокаШтрихкодаУпаковки");
	
	Если СтрНайти(Специфика, "КоличествоКодов") Тогда
		Результат.Вставить("КоличествоПотребительскихУпаковок");
	КонецЕсли;
	
	Если СтрНайти(Специфика, "СрокГодности") Тогда
		Результат.Вставить("СрокГодности");
		Результат.Вставить("ШтрихкодОднороднойУпаковки");
	КонецЕсли;
	Если СтрНайти(Специфика, "ВЕТИС") Тогда
		Результат.Вставить("ИдентификаторПроисхожденияВЕТИС");
		Результат.Вставить("ШтрихкодОднороднойУпаковки");
	КонецЕсли;
	Если СтрНайти(Специфика, "ДоступныКодыМаркировкиОстатков")
		Или Специфика = "ЗаказНаЭмиссию"
		Или СтрНайти(Специфика, "GTIN") Тогда
		// Коды маркировки остатков
		Результат.Вставить("GTIN");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, ДанныеШтрихкода);
	Результат.КоличествоУпаковок = Результат.Количество;
	
	//Частичное выбытие
	Если Результат.ЧастичноеВыбытиеВариантУчета = Перечисления.ВариантыУчетаЧастичногоВыбытияИС.НастроеннаяНоменклатура Тогда
		Результат.ЧастичноеВыбытиеНоменклатура = Результат.Номенклатура;
		Результат.ЧастичноеВыбытиеХарактеристика = Результат.Характеристика;
	КонецЕсли;
	
	//Поля с разным названием
	ДанныеСпецифики = Новый Структура("СрокГодности,СкоропортящаясяПродукция");
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеШтрихкода, "ГоденДо") Тогда
		ДанныеСпецифики.СрокГодности = ДанныеШтрихкода.ГоденДо;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеШтрихкода, "СкоропортящаясяПродукция") Тогда
		ДанныеСпецифики.СкоропортящаясяПродукция= ДанныеШтрихкода.СкоропортящаясяПродукция;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Результат, ДанныеСпецифики);
	
	//Взаимоисключающие поля
	Если СтрНайти(Специфика, "ДоступныКодыМаркировкиОстатков") > 0 И ЗначениеЗаполнено(Результат.Номенклатура) Тогда
		Результат.GTIN = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Для связи механизма штрихкодирования и кеша строк: обновление кеша по добавленному коду маркировки.
//   Прикладные документы (без специфики без заполнения табличной части).
//
// Параметры:
//   Форма             - ФормаКлиентскогоПриложения           - источник вызова.
//   ОбновляемаяСтрока - См. ДанныеШтрихкодаДляДобавленияВКеш.
//   Сценарий          - Число                                - ключ кеша
//
Процедура ДополнитьКеш(Форма, ОбновляемаяСтрока, Сценарий = 0) Экспорт
	
	ДанныеШтрихкодовУпаковокГосИС = Форма.ДанныеШтрихкодовУпаковокГосИС;
	
	// Дополнительные ключи связи, специфика: поля поиска для незаполненной номенклатуры.
	ПоляПоиска = ИнтеграцияИС.ПоляПоискаМаркируемойПродукции();
	
	ЗаполнитьЗначенияСвойств(ПоляПоиска, ОбновляемаяСтрока);
	Если ОбновляемаяСтрока.ЧастичноеВыбытиеОтдельнойНоменклатуры Тогда
		ПоляПоиска.Серия = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры");
	КонецЕсли;
	ПоляПоиска.Вставить("Сценарий", Сценарий);
	
	ДанныеКеша = ДанныеШтрихкодовУпаковокГосИС.НайтиСтроки(ПоляПоиска);
	Если ДанныеКеша.Количество() Тогда
		СтрокаКеша = ДанныеКеша[0];
		СтрокаКеша.Количество = СтрокаКеша.Количество + ОбновляемаяСтрока.Количество;
		Если СтрокаКеша.ШтрихкодыУпаковок.Получить(ОбновляемаяСтрока.ШтрихкодУпаковки) = Неопределено Тогда
			Штрихкоды = Новый Соответствие(СтрокаКеша.ШтрихкодыУпаковок);
			Штрихкоды.Вставить(ОбновляемаяСтрока.ШтрихкодУпаковки, Истина);
			СтрокаКеша.ШтрихкодыУпаковок = Новый ФиксированноеСоответствие(Штрихкоды);
		КонецЕсли;
	Иначе
		СтрокаКеша = ДанныеШтрихкодовУпаковокГосИС.Добавить();
		СтрокаКеша.Сценарий = Сценарий;
		ЗаполнитьЗначенияСвойств(СтрокаКеша, ОбновляемаяСтрока);
		Если ОбновляемаяСтрока.ЧастичноеВыбытиеОтдельнойНоменклатуры Тогда
			СтрокаКеша.ПодменнаяНоменклатура = Истина;
		КонецЕсли;
		Штрихкоды = Новый Соответствие;
		Штрихкоды.Вставить(ОбновляемаяСтрока.ШтрихкодУпаковки, Истина);
		СтрокаКеша.ШтрихкодыУпаковок = Новый ФиксированноеСоответствие(Штрихкоды);
	КонецЕсли;
	
КонецПроцедуры

// Для связи механизма штрихкодирования и кеша строк: обновление кеша по добавленному коду маркировки.
// Только для ТЧ ШтрихкодыУпаковок (библиотечное использование)
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - источник вызова.
//  ОбновляемаяСтрока - См. ДанныеШтрихкодаДляДобавленияВКеш.
//  ДобавленныеШтрихкодыУпаковок - Неопределено, Массив Из СправочникСсылка.ШтрихкодыУпаковокТоваров - уже добавленные штрихкоды упаковок (специфика документа маркировки)
//  Сценарий - Число - Ключ сценария использования
//  ИмяТЧ - Строка - Имя табличной части штрихкодов сценария использования
Процедура ДополнитьКешИТаблицуШтрихкодовУпаковок(Форма, ОбновляемаяСтрока,
	ДобавленныеШтрихкодыУпаковок = Неопределено, Сценарий = 0, ИмяТЧ = "ШтрихкодыУпаковок") Экспорт
	
	ДанныеШтрихкодовУпаковокГосИС = Форма.ДанныеШтрихкодовУпаковокГосИС;
	
	// Дополнительные ключи связи, специфика: поля поиска для незаполненной номенклатуры.
	КолонкиКеша = ДанныеШтрихкодовУпаковокГосИС.Выгрузить(Новый Массив).Колонки;
	ЕстьGTIN = КолонкиКеша.Найти("GTIN") <> Неопределено;
	// Дополнительное поле кеша, КМ на переменное количество: должны быть и колонка и переменное количество
	ЕстьКоличествоКодов = КолонкиКеша.Найти("КоличествоПотребительскихУпаковок") <> Неопределено
		И ОбновляемаяСтрока.Свойство("КоличествоПотребительскихУпаковок");
	// Дополнительные ключи связи, специфика: поля поиска для маркировки молочной продукции
	ДобавитьШтрихкодОднороднойУпаковки = ОбновляемаяСтрока.Свойство("ШтрихкодОднороднойУпаковки");

	ПоляПоиска = ИнтеграцияИС.ПоляПоискаМаркируемойПродукции(, ЕстьGTIN, ДобавитьШтрихкодОднороднойУпаковки);
	
	ЗаполнитьЗначенияСвойств(ПоляПоиска, ОбновляемаяСтрока);
	Если ОбновляемаяСтрока.ЧастичноеВыбытиеОтдельнойНоменклатуры Тогда
		ПоляПоиска.Серия = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры");
	КонецЕсли;
	ПоляПоиска.Вставить("Сценарий", Сценарий);
	
	ДанныеКеша = ДанныеШтрихкодовУпаковокГосИС.НайтиСтроки(ПоляПоиска);
	Если ДанныеКеша.Количество() Тогда
		СтрокаКеша = ДанныеКеша[0];
		ШтрихкодыУпаковок = Новый Соответствие(СтрокаКеша.ШтрихкодыУпаковок);
		Если ЕстьКоличествоКодов Тогда
			СтрокаКеша.Количество = СтрокаКеша.Количество + ОбновляемаяСтрока.Количество;
			СтрокаКеша.КоличествоПотребительскихУпаковок = СтрокаКеша.КоличествоПотребительскихУпаковок + ОбновляемаяСтрока.КоличествоПотребительскихУпаковок;
		Иначе
			СтрокаКеша.Количество = СтрокаКеша.Количество + ?(ОбновляемаяСтрока.Количество = 0, 1, ОбновляемаяСтрока.Количество);
		КонецЕсли;
	Иначе
		СтрокаКеша = ДанныеШтрихкодовУпаковокГосИС.Добавить();
		СтрокаКеша.Сценарий = Сценарий;
		ЗаполнитьЗначенияСвойств(СтрокаКеша, ОбновляемаяСтрока);
		Если ОбновляемаяСтрока.ЧастичноеВыбытиеОтдельнойНоменклатуры Тогда
			СтрокаКеша.ПодменнаяНоменклатура = Истина;
		КонецЕсли;
		ШтрихкодыУпаковок = Новый Соответствие;
	КонецЕсли;
	
	Если ОбновляемаяСтрока.Количество = 0 Тогда
		СтрокаКеша.БезКоличества = Истина;
	КонецЕсли;
	
	ДобавитьШтрихкодУпаковки = ДобавленныеШтрихкодыУпаковок.Найти(ОбновляемаяСтрока.ШтрихкодУпаковки) = Неопределено;

	// Добавление штрихкодов упаковок, специфика маркировки молочной продукции
	Если ДобавитьШтрихкодОднороднойУпаковки
		И ЗначениеЗаполнено(ОбновляемаяСтрока.ШтрихкодОднороднойУпаковки) Тогда
		
		ШтрихкодыУпаковок.Вставить(ОбновляемаяСтрока.ШтрихкодОднороднойУпаковки);
		
		НоваяСтрока = Форма.Объект[ИмяТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОбновляемаяСтрока);
		НоваяСтрока.ШтрихкодУпаковки = ОбновляемаяСтрока.ШтрихкодОднороднойУпаковки;
		
		ДобавитьШтрихкодУпаковки = ДобавитьШтрихкодУпаковки
			И ОбновляемаяСтрока.ШтрихкодОднороднойУпаковки <> ОбновляемаяСтрока.ШтрихкодУпаковки;
		
	КонецЕсли;
	
	ШтрихкодыУпаковок.Вставить(ОбновляемаяСтрока.ШтрихкодУпаковки);
	
	Если ДобавитьШтрихкодУпаковки Тогда
		
		НоваяСтрока = Форма.Объект[ИмяТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОбновляемаяСтрока);
		Если ДобавитьШтрихкодОднороднойУпаковки Тогда
			ОчищаемыеРеквизиты = Новый Структура("СрокГодности,ИдентификаторПроисхожденияВЕТИС");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОчищаемыеРеквизиты);
		КонецЕсли;
		ДобавленныеШтрихкодыУпаковок.Добавить(ОбновляемаяСтрока.ШтрихкодУпаковки);
		
	КонецЕсли;
	
	СтрокаКеша.ШтрихкодыУпаковок = Новый ФиксированноеСоответствие(ШтрихкодыУпаковок);
	
КонецПроцедуры

//Для связи механизма штрихкодирования и кеша строк: получение текущих данных кеша по добавляемому коду маркировки
//
//Параметры:
//   Форма - ФормаКлиентскогоПриложения - источник вызова.
//   ОбновляемаяСтрока - (См. ДанныеШтрихкодаДляДобавленияВКеш)
//   ИмяПоляКоличество - Строка - требуемая колонка количества.
//   Сценарий - Число - индекс сценария использования.
//
//Возвращаемое значение:
//   Число - количество единиц по кодам маркировки по полям поиска текущей маркируемой продукции
//
Функция КоличествоПоДаннымКеша(Форма, ОбновляемаяСтрока, ИмяПоляКоличество = "Количество", Сценарий = 0) Экспорт
	
	ДанныеШтрихкодовУпаковокГосИС = Форма.ДанныеШтрихкодовУпаковокГосИС;
	ПоляПоиска = ИнтеграцияИС.ПоляПоискаМаркируемойПродукции(,ОбновляемаяСтрока.Свойство("GTIN"),ОбновляемаяСтрока.Свойство("ШтрихкодОднороднойУпаковки"));
	ЗаполнитьЗначенияСвойств(ПоляПоиска, ОбновляемаяСтрока);
	ПоляПоиска.Вставить("Сценарий", Сценарий);
	ДанныеКеша = ДанныеШтрихкодовУпаковокГосИС.НайтиСтроки(ПоляПоиска);
	Если ДанныеКеша.Количество() Тогда
		Возврат ДанныеКеша[0][ИмяПоляКоличество];
	КонецЕсли;
	Возврат 0;
	
КонецФункции

// При сканировании кода маркировки, требующего уточнения, забирает количество с не полностью заполненных строк
//   с той же номенклатурой и характеристикой.
// Требования: в форме используется механика статусов проверки и подбора строк.
// 
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма в которой происходит сканирование
//   ОбновляемаяСтрока - См. ДанныеШтрихкодаДляДобавленияВКеш.
//   Настройки - см. НастройкиРаспределенияНезаполненныхСтрок
// 
// Возвращаемое значение:
//   Массив Из ДанныеФормыЭлементКоллекции - измененные строки табличной части
Функция РаспределитьНаНезаполненныеСтроки(Форма, Знач ОбновляемаяСтрока, Настройки = Неопределено) Экспорт
	
	Если Настройки = Неопределено Тогда
		Настройки = НастройкиРаспределенияНезаполненныхСтрок();
	КонецЕсли;
	КоличествоМаркируемойПродукции = ОбновляемаяСтрока.Количество;
	Товары = Форма;
	Для Каждого ЭлементПути Из СтрРазделить(Настройки.Товары, ".") Цикл
		Товары = Товары[ЭлементПути];
	КонецЦикла;
	ЕстьВЕТИС = ОбновляемаяСтрока.Свойство("ИдентификаторПроисхожденияВЕТИС");
	ЕстьСрокГодности = ОбновляемаяСтрока.Свойство("СрокГодности");
	
	ИзмененныеСтроки = Новый Массив;
	
	КлючПоиска = Новый Структура;
	КлючПоиска.Вставить(Настройки.Номенклатура, ОбновляемаяСтрока.Номенклатура);
	Если ЗначениеЗаполнено(Настройки.Характеристика) Тогда
		КлючПоиска.Вставить(Настройки.Характеристика,ОбновляемаяСтрока.Характеристика);
	КонецЕсли;
	СтрокиТовары = Товары.НайтиСтроки(КлючПоиска);
	
	Для Каждого СтрокаТЧ Из СтрокиТовары Цикл
		
		Если КоличествоМаркируемойПродукции = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ДанныеПроверки = ОбщегоНазначения.СкопироватьРекурсивно(ОбновляемаяСтрока);
		СтрокаПодходит = Истина;
		СтрокиСовпадают = Истина;
		Если ЗначениеЗаполнено(Настройки.Серия) Тогда
			ДанныеПроверки.Серия = СтрокаТЧ[Настройки.Серия];
			СтрокаПодходит = СтрокаПодходит И ( ОбновляемаяСтрока.Серия = ДанныеПроверки.Серия
				Или Не ЗначениеЗаполнено(ДанныеПроверки.Серия));
			СтрокиСовпадают = СтрокиСовпадают И ОбновляемаяСтрока.Серия = ДанныеПроверки.Серия;
		КонецЕсли;
		Если ЕстьВЕТИС Тогда
			ДанныеПроверки.ИдентификаторПроисхожденияВЕТИС = СтрокаТЧ.ИдентификаторПроисхожденияВЕТИС;
			СтрокаПодходит = СтрокаПодходит И (
				ОбновляемаяСтрока.ИдентификаторПроисхожденияВЕТИС = СтрокаТЧ.ИдентификаторПроисхожденияВЕТИС
				Или Не ЗначениеЗаполнено(СтрокаТЧ.ИдентификаторПроисхожденияВЕТИС));
			СтрокиСовпадают = СтрокиСовпадают И ОбновляемаяСтрока.ИдентификаторПроисхожденияВЕТИС = ДанныеПроверки.ИдентификаторПроисхожденияВЕТИС;
		КонецЕсли;
		Если ЕстьСрокГодности Тогда
			ДанныеПроверки.СрокГодности = СтрокаТЧ.СрокГодности;
			СтрокаПодходит = СтрокаПодходит И (ОбновляемаяСтрока.СрокГодности = СтрокаТЧ.СрокГодности
				Или Не ЗначениеЗаполнено(СтрокаТЧ.СрокГодности));
			СтрокиСовпадают = СтрокиСовпадают И ОбновляемаяСтрока.СрокГодности = ДанныеПроверки.СрокГодности;
		КонецЕсли;
		
		Если СтрокаПодходит И Не СтрокиСовпадают Тогда
			КоличествоПросканировано = КоличествоПоДаннымКеша(Форма, ДанныеПроверки);
			МожноРаспределить = СтрокаТЧ[Настройки.Количество] - КоличествоПросканировано;
			Распределить = Мин(МожноРаспределить, КоличествоМаркируемойПродукции);
			Если Распределить > 0 Тогда
				КоличествоМаркируемойПродукции = КоличествоМаркируемойПродукции - Распределить;
				СтрокаТЧ[Настройки.Количество] = СтрокаТЧ[Настройки.Количество] - Распределить;
				ИзмененныеСтроки.Добавить(СтрокаТЧ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИзмененныеСтроки;
	
КонецФункции

// Настройки распределения незаполненных строк.
// 
// Параметры:
//  ЕстьСерии - Строка - возможность распределения с недозаполненных строк с пустой/той же серией.
// 
// Возвращаемое значение:
//  Структура - описание имен полей, которые будут использоваться для поиска недозаполненных строк:
//  * Товары         - Строка - путь к табличной части на форме.
//  * Номенклатура   - Строка - имя реквизита Номенклатура.
//  * Характеристика - Строка - имя реквизита Характеристика. Пусто если не используется.
//  * Серия          - Строка - имя реквизита Серия. Пусто если не используется.
//  * Количество     - Строка - имя реквизита Количество.
Функция НастройкиРаспределенияНезаполненныхСтрок(ЕстьСерии = "Серия") Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Товары",         "Объект.Товары");
	Результат.Вставить("Номенклатура",   "Номенклатура");
	Результат.Вставить("Характеристика", "Характеристика");
	Результат.Вставить("Количество",     "Количество");
	Результат.Вставить("Серия",          ЕстьСерии);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область РаботаСоСтатусамиПроверкиПодбораДокумента

// Добавляет на форму таблицу статусов проверки ()для отображения статуса проверки документа).
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ПараметрыИнтеграции - Соответствие Из Произвольный - Параметры интеграции
//  ДобавляемыеРеквизиты - Массив Из РеквизитФормы - Добавляемые реквизиты
Процедура ДобавитьТаблицуСтатусовПроверки(Форма, ПараметрыИнтеграции, ДобавляемыеРеквизиты) Экспорт
	
	Если ПараметрыИнтеграции.Получить("СтатусыПроверкиПодбораГосИС") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыИнтеграции.Вставить("СтатусыПроверкиПодбораГосИС", Новый Массив);
	
	Таблица = Новый РеквизитФормы("СтатусыПроверкиПодбораГосИС", Новый ОписаниеТипов("ТаблицаЗначений"));
	ДобавляемыеРеквизиты.Добавить(Таблица);
	
	Колонка = Новый РеквизитФормы("Сценарий", Новый ОписаниеТипов("Число"), "СтатусыПроверкиПодбораГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("Статус",Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыПроверкиИПодбораИС"),"СтатусыПроверкиПодбораГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("Видимость",Новый ОписаниеТипов("Булево"),"СтатусыПроверкиПодбораГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	Колонка = Новый РеквизитФормы("Описание",Новый ОписаниеТипов("Строка"),"СтатусыПроверкиПодбораГосИС");
	ДобавляемыеРеквизиты.Добавить(Колонка);
	
КонецПроцедуры

Процедура УстановитьВидимостьЭлементов(Форма, ВидимостьЭлементов, ПараметрыИнтеграции)
	
	ОбновитьОбщийСтатусПодменю(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойПроверкиИПодбора

// Возвращает детализацию структуры хранения, рассчитанную по данным статистики по документу.
// 
// Параметры:
//  ДанныеШтрихкодовСписок - ТаблицаЗначений - таблица штрихкодов упаковок проверяемого документа. (См ШтрихкодированиеИССлужебный.ШтрихкодыУпаковокИзДокумента).
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
//  ПроверяемыйДокумент - ДокументСсылка - ссылка на проверяемый документ.
//  Кэш - Неопределено, Соответствие Из Произвольный - кэш.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС - детализация структуры хранения.
Функция ДетализацияНаОснованииСтатистикиПоШтрихкодам(ДанныеШтрихкодовСписок, ПараметрыСканирования, ПроверяемыйДокумент, Кэш = Неопределено) Экспорт
	
	Если ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЭтоМаркировкаТоваровИСМП(ПараметрыСканирования) Тогда
		Возврат Перечисления.ДетализацияСтруктурыХраненияИС.Полная;
	ИначеЕсли ЗначениеЗаполнено(ПроверяемыйДокумент)
		И ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЕГАИС")
		И ИнтеграцияИС.СодержитсяВПодсистеме("ГосИС.ЕГАИС", ПроверяемыйДокумент.Метаданные()) Тогда
		Возврат Перечисления.ДетализацияСтруктурыХраненияИС.Полная;
	КонецЕсли;
	
	КоличествоПалет           = 0;
	КоличествоКоробов         = 0;
	КоличествоГрупповых       = 0;
	КоличествоПотребительских = 0;
	
	Кэш                 = Новый Соответствие;
	КоличествоПоGTIN    = Новый Соответствие();
	GTINБезВидаУпаковки = Новый Массив;
	
	ДоступнаКолонкаВидУпаковки        = Ложь;
	ПрямойДоступКЗначениюВидаУпаковки = Истина;
	ДоступнаКолонкаВидПродукции       = Ложь;
	Если ТипЗнч(ДанныеШтрихкодовСписок) = Тип("Соответствие") Тогда
		ИмяКолонкиШтрихкод                = "Ключ";
		ДоступнаКолонкаВидУпаковки        = Истина;
		ПрямойДоступКЗначениюВидаУпаковки = Ложь;
	ИначеЕсли ТипЗнч(ДанныеШтрихкодовСписок) = Тип("Массив")
		Или ТипЗнч(ДанныеШтрихкодовСписок) = Тип("ТаблицаЗначений") Тогда
		ИмяКолонкиШтрихкод         = "Штрихкод";
		ДоступнаКолонкаВидУпаковки = ДанныеШтрихкодовСписок.Количество() > 0
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеШтрихкодовСписок[0], "ВидУпаковки");
		ДоступнаКолонкаВидПродукции = ДанныеШтрихкодовСписок.Количество() > 0
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеШтрихкодовСписок[0], "ВидПродукции");
	КонецЕсли;
	
	Для Каждого ДанныеШтрихкода Из ДанныеШтрихкодовСписок Цикл
		
		КодМаркировки = ДанныеШтрихкода[ИмяКолонкиШтрихкод];
		
		Если Кэш[КодМаркировки] = Неопределено Тогда
			
			Если ДоступнаКолонкаВидПродукции И ЗначениеЗаполнено(ДанныеШтрихкода.ВидПродукции) Тогда
				ВидПродукции = ДанныеШтрихкода.ВидПродукции;
			КонецЕсли;
			
			ПримечаниеКРезультатуРазбора = Неопределено;
			ДанныеРазбора                = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(КодМаркировки, ВидПродукции, ПримечаниеКРезультатуРазбора);
			
			Кэш[КодМаркировки] = Новый Структура("ДанныеРазбора, ПримечаниеКРезультатуРазбора", ДанныеРазбора, ПримечаниеКРезультатуРазбора);
			
		Иначе
			
			Продолжить; // Групповая/Логистическая упаковки уже посчитаны
			
		КонецЕсли;
		
		Если ДанныеРазбора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДоступнаКолонкаВидУпаковки
			И Не ЗначениеЗаполнено(ДанныеРазбора.ВидУпаковки) Тогда
			Если ПрямойДоступКЗначениюВидаУпаковки Тогда
				ВидУпаковки = ДанныеШтрихкода.ВидУпаковки;
			Иначе
				ВидУпаковки = ДанныеШтрихкода.Значение.ВидУпаковки;
			КонецЕсли;
			Если ЗначениеЗаполнено(ВидУпаковки) Тогда
				ДанныеРазбора.ВидУпаковки = ВидУпаковки;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
			Если ДанныеРазбора.СоставКодаМаркировки.Свойство("GTIN")
				И ЗначениеЗаполнено(ДанныеРазбора.СоставКодаМаркировки.GTIN) Тогда
				КоличествоКоробов = КоличествоКоробов + 1;
			Иначе
				КоличествоПалет = КоличествоПалет + 1;
			КонецЕсли;
		ИначеЕсли ДанныеРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
			Или ПроверкаИПодборПродукцииИСКлиентСервер.ВСтрокеНаборКакГрупповая(ДанныеРазбора, Ложь, ПараметрыСканирования) Тогда
			КоличествоГрупповых = КоличествоГрупповых + 1;
		ИначеЕсли ДанныеРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
			Или ПроверкаИПодборПродукцииИСКлиентСервер.ВСтрокеНаборКакПотребительская(ДанныеРазбора, Ложь, ПараметрыСканирования) Тогда
			КоличествоПотребительских = КоличествоПотребительских + 1;
		ИначеЕсли ДанныеРазбора.СоставКодаМаркировки.Свойство("GTIN")
			И ЗначениеЗаполнено(ДанныеРазбора.СоставКодаМаркировки.GTIN) Тогда
			GTIN = ДанныеРазбора.СоставКодаМаркировки.GTIN;
			ТекущееКоличествоПоGTIN = КоличествоПоGTIN[GTIN];
			Если ТекущееКоличествоПоGTIN = Неопределено Тогда
				КоличествоПоGTIN[GTIN] = 1;
				GTINБезВидаУпаковки.Добавить(GTIN);
			Иначе
				КоличествоПоGTIN[GTIN] = ТекущееКоличествоПоGTIN + 1;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если GTINБезВидаУпаковки.Количество() Тогда
		ОписанияGTIN = РегистрыСведений.ОписаниеGTINИС.ПолучитьОписание(GTINБезВидаУпаковки);
		Для Каждого КлючИЗначение Из КоличествоПоGTIN Цикл
			GTIN         = КлючИЗначение.Ключ;
			Количество   = КлючИЗначение.Значение;
			ОписаниеGTIN = ОписанияGTIN[GTIN];
			Если ОписаниеGTIN <> Неопределено Тогда
				Если ОписаниеGTIN.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
					КоличествоПотребительских = КоличествоПотребительских + Количество;
				ИначеЕсли ОписаниеGTIN.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
					КоличествоГрупповых = КоличествоГрупповых + Количество;
				ИначеЕсли ОписаниеGTIN.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
					КоличествоКоробов = КоличествоКоробов + Количество;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВозможныеДетализации = Новый Массив;
	
	Если КоличествоПалет > 0 Тогда
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами);
	ИначеЕсли КоличествоКоробов >= 25 Тогда
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами);
	ИначеЕсли КоличествоКоробов >= 5 Тогда
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками);
	ИначеЕсли КоличествоГрупповых >= 250 Тогда
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками);
	Иначе
		
		Если ОбщегоНазначенияИСМПКлиентСервер.ЗначениеПараметраСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования) Тогда
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.Полная);
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами);
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками);
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки);
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими);
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки);
		Иначе
			
			// ГрупповыеУпаковки не поддерживаются в форме проверки
			
			Если КоличествоПотребительских > 0
				И КоличествоГрупповых = 0
				И КоличествоКоробов = 0
				И КоличествоПалет = 0 Тогда
				ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки);
			КонецЕсли;
			
			Если КоличествоПалет = 0 Тогда
				ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками);
			КонецЕсли;
			
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.Полная);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыСканирования.ДетализацияСтруктурыХранения) Тогда
		Возврат ВозможныеДетализации[0];
	ИначеЕсли ВозможныеДетализации.Найти(ПараметрыСканирования.ДетализацияСтруктурыХранения) = Неопределено Тогда
		Возврат ВозможныеДетализации[0];
	ИначеЕсли ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
		Или ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками Тогда
		Возврат Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками;
	КонецЕсли;
	
	Возврат ПараметрыСканирования.ДетализацияСтруктурыХранения;
	
КонецФункции

// Возвращает детализацию переданной иерархической структуры упаковок маркируемой продукции.
// 
// Параметры:
//	ДеревоУпаковок - ДеревоЗначений, ДанныеФормыКоллекция - иерархическая структура упаковок маркируемой продукции.
// Возвращаемое значение:
//	ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС - расчитаная детализация структуры упаковок
//
Функция ДетализацияСтруктурыХраненияДерева(ДеревоУпаковок) Экспорт
	
	Если ТипЗнч(ДеревоУпаковок) = Тип("ДеревоЗначений") Тогда
		СтрокиДерева = ДеревоУпаковок.Строки;
	Иначе
		СтрокиДерева = Новый Массив;
		СтрокиДерева.Добавить(ДеревоУпаковок);
	КонецЕсли;
	
	ДетализацияСтруктурыХраненияДерева = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки;
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если ИнтеграцияИСКлиентСервер.ЭтоУпаковка(СтрокаДерева.ТипУпаковки) Тогда
			
			Если (СтрокаДерева.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Групповая")
				Или СтрокаДерева.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор")) Тогда
				Если ДетализацияСтруктурыХраненияДерева = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки Тогда
					ДетализацияСтруктурыХраненияДерева = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки;
					Для Каждого ПодчиненнаяСтрока Из СтрокаДерева.Строки Цикл
						ДетализацияСтруктурыХраненияДерева = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими;
					КонецЦикла;
				КонецЕсли;
			Иначе
				ДетализацияСтруктурыХраненияДерева = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками;
				Для Каждого ПодчиненнаяСтрока Из СтрокаДерева.Строки Цикл
					Если ИнтеграцияИСКлиентСервер.ЭтоУпаковка(ПодчиненнаяСтрока.ТипУпаковки) Тогда
						ДетализацияСтруктурыХраненияДерева = Перечисления.ДетализацияСтруктурыХраненияИС.Полная;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДетализацияСтруктурыХраненияДерева = Перечисления.ДетализацияСтруктурыХраненияИС.Полная Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДетализацияСтруктурыХраненияДерева;
	
КонецФункции

//Возвращает сформированный ранее Акт о расхождениях для переданного документа.
// 
//Параметры:
//   Документ - ДокументСсылка - ссылка на документ, для которого необходимо получить Акт о расхождениях:
//Возвращаемое значение:
//   Неопределено, ДокументСсылка - ссылка на Акт о расхождениях
Функция СформированныйАктОРасхождениях(Документ) Экспорт
	
	АктОРасхождениях = Неопределено;
	ПроверкаИПодборПродукцииИСПереопределяемый.ПолучитьСформированныйАктОРасхождениях(Документ, АктОРасхождениях);
	Возврат АктОРасхождениях;
	
КонецФункции

//Возвращает для переданного документа таблицу его товаров для сценария проверки и подбора.
//
//Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка - документ, продукцию которого необходимо получить.
//  Сценарий - Число - номер сценария проверки/подбора продукции в документе.
// Возвращаемое значение:
//  ТаблицаЗначений - См. НоваяТаблицаПродукции
//
Функция ТаблицаПродукцииДокумента(Контекст = Неопределено, Сценарий = Неопределено) Экспорт
	
	Таблица = НоваяТаблицаПродукции();
	
	Если Контекст = Неопределено Тогда
		
	ИначеЕсли ТипЗнч(Контекст) = Тип("ДанныеФормыСтруктура") Тогда
		
		ПроверкаИПодборПродукцииИСПереопределяемый.ПриОпределенииПродукцииДокумента(
			Контекст, Сценарий, Таблица);
		
	Иначе
		
		МетаданныеДокумента = Контекст.Метаданные();
		
		Если ИнтеграцияИС.СодержитсяВПодсистеме("ГосИС", МетаданныеДокумента) Тогда
			МенеджерДокумента = ОбщегоНазначенияИС.МенеджерОбъектаПоПолномуИмени(МетаданныеДокумента.ПолноеИмя());
			МенеджерДокумента.ЗаполнитьПродукциюДокумента(Таблица, Контекст, Сценарий);
		Иначе
			ПроверкаИПодборПродукцииИСПереопределяемый.ПриОпределенииПродукцииДокумента(
				Контекст, Сценарий, Таблица);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

// Возвращает сохраненную в хранилище настроек данных форм детализацию отображения структуры упаковок в формах проверки и подбора ИСМП.
// 
// Параметры:
// 	РежимПодбораСуществующихУпаковок - Булево - признак работы со штрихкодами упаковок, имеющимися в информационной базе.
// Возвращаемое значение:
// 	ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС - сохраненная детализация отображения структуры упаковок
Функция СохраненнаяДетализацияСтруктурыХранения(РежимПодбораСуществующихУпаковок) Экспорт
	
	ПолноеИмяФормы = Метаданные.Обработки.ПроверкаИПодборПродукцииИС.Формы.ПроверкаИПодбор.ПолноеИмя();
	
	СохраненнаяДетализация = Неопределено;
	СохраненныеНастройки   = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ПолноеИмяФормы, "");
	
	Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
		Если РежимПодбораСуществующихУпаковок
			И СохраненныеНастройки.Свойство("ДетализацияСтруктурыХранения") Тогда
			СохраненнаяДетализация = СохраненныеНастройки.ДетализацияСтруктурыХранения;
		ИначеЕсли Не РежимПодбораСуществующихУпаковок
			И СохраненныеНастройки.Свойство("ДетализацияСтруктурыХраненияПриобретение") Тогда
			СохраненнаяДетализация = СохраненныеНастройки.ДетализацияСтруктурыХраненияПриобретение;
		ИначеЕсли СохраненныеНастройки.Свойство("ДетализацияСтруктурыХранения") Тогда
			СохраненнаяДетализация = СохраненныеНастройки.ДетализацияСтруктурыХранения;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СохраненнаяДетализация;
	
КонецФункции

#КонецОбласти

#Область ВстраиваниеФормыПроверкиИПодбора

// Вызывается при закрытии формы проверки и подбора маркируемой продукции из форм прикладных документов
//   в конфигурации - потребителе библиотеки ГосИС и при инициализации формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма прикладного документа, в который встраивается функциональность библиотеки ГосИС
//  ВидимостьЭлементов - Булево - флаг видимости соответствующего блока по виду продукции
//  ПараметрыИнтеграции - См. ПараметрыИнтеграцииФормыПроверкиИПодбора
//
Процедура УправлениеЭлементамиОткрытияФормыПроверкиИПодбора(Форма, ВидимостьЭлементов, ПараметрыИнтеграции) Экспорт
	
	Объект = Форма[ПараметрыИнтеграции.ИмяРеквизитаФормыОбъект];
	СтатусПроверкиИПодбора  = РегистрыСведений.СтатусыПроверкиИПодбораИС.ТекущийСтатус(Объект.Ссылка, ПараметрыИнтеграции.Сценарий);
	
	Если ПараметрыИнтеграции.ИспользоватьСтатусПроверкиПодбораДокумента Тогда
		
		УстановитьСтатус(Форма, СтатусПроверкиИПодбора, ПараметрыИнтеграции.Сценарий);
		ОбновитьИнтерфейсПоСценарию(Форма, СтатусПроверкиИПодбора, ПараметрыИнтеграции);
		УстановитьВидимостьЭлементов(Форма, ВидимостьЭлементов, ПараметрыИнтеграции);
		
		Если ПараметрыИнтеграции.ОтображатьОшибкиПроверкиСредствамиККТ Тогда
			Модуль = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ПроверкаИПодборПродукцииИСМП");
			Модуль.ДополнитьПредставлениеКомандыПроверкиИПодбораНаличиемОшибокСредствамиККТ(Форма, ПараметрыИнтеграции.Сценарий);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Управление видимостью элементов проверки и подбора.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура УправлениеВидимостьюЭлементовПроверкиИПодбора(Форма) Экспорт
	
	НастройкиМассив = Форма.ПараметрыИнтеграцииГосИС.Получить("ФормаПроверкиИПодбора");
	Если НастройкиМассив = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Настройки Из НастройкиМассив Цикл
		
		Если Не Настройки.РазмещатьЭлементыИнтерфейса
			Или Не ЗначениеЗаполнено(Настройки.ИмяРеквизитаФормы) Тогда
			Продолжить;
		КонецЕсли;
		
		Объект = Форма[Настройки.ИмяРеквизитаФормыОбъект];
		
		ВидимостьЭлементов = Настройки.ИспользоватьБезМаркируемойПродукции
			Или ЕстьМаркируемаяПродукцияВКоллекции(Объект, Настройки.ИмяТабличнойЧастиТовары);
			
		УправлениеЭлементамиОткрытияФормыПроверкиИПодбора(Форма, ВидимостьЭлементов, Настройки);
			
	КонецЦикла;
	
	ПроверкаИПодборПродукцииИСПереопределяемый.ПриПримененииПараметровИнтеграцииФормыПроверкиИПодбора(Форма);
	
КонецПроцедуры

// Модификация реквизитов формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ПараметрыИнтеграции - Соответствие Из Произвольный - Параметры интеграции
//  ДобавляемыеРеквизиты - Массив Из РеквизитФормы - Добавляемые реквизиты
Процедура МодификацияРеквизитовФормы(Форма, ПараметрыИнтеграции, ДобавляемыеРеквизиты) Экспорт
	
	Если ПараметрыИнтеграции.Получить("ФормаПроверкиИПодбора")<>Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыИнтеграцииМассив = ПараметрыИнтеграцииФормыПроверкиИПодбора(Форма);
	ПараметрыИнтеграции.Вставить("ФормаПроверкиИПодбора", ПараметрыИнтеграцииМассив);
	
	Для Каждого ПараметрыИнтеграцииФормыПроверки Из ПараметрыИнтеграцииМассив Цикл
		
		Если ЗначениеЗаполнено(ПараметрыИнтеграцииФормыПроверки.ИмяРеквизитаФормы) Тогда
			
			Если ПараметрыИнтеграцииФормыПроверки.ИспользоватьСтатусПроверкиПодбораДокумента Тогда
				
				ДобавитьТаблицуСтатусовПроверки(Форма, ПараметрыИнтеграции, ДобавляемыеРеквизиты);
				
			КонецЕсли;
			
			Если ПараметрыИнтеграцииФормыПроверки.ИспользоватьКолонкуСтатусаПроверкиПодбора Тогда
				
				Если ПараметрыИнтеграцииФормыПроверки.РазмещатьЭлементыИнтерфейса Тогда
					
					Если ПараметрыИнтеграцииФормыПроверки.ДоступныОбъемноСортовыеКоды Тогда
						ПараметрыИнтеграции.Вставить("ДоступныОбъемноСортовыеКоды", Истина);
					КонецЕсли;
					
					ПутьКРеквизиту = ПараметрыИнтеграцииФормыПроверки.ИмяРеквизитаФормыОбъект+"."+ПараметрыИнтеграцииФормыПроверки.ИмяТабличнойЧастиТовары;
					ДополнитьТаблицуТоваров(Форма, ПараметрыИнтеграции, ПутьКРеквизиту, ДобавляемыеРеквизиты);
				
				КонецЕсли;
				
				ДобавитьТаблицуШтрихкодовУпаковок(Форма, ПараметрыИнтеграции, ДобавляемыеРеквизиты);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Модификация элементов формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура МодификацияЭлементовФормы(Форма) Экспорт
	
	НастройкиМассивом = Форма.ПараметрыИнтеграцииГосИС.Получить("ФормаПроверкиИПодбора");
	Если НастройкиМассивом = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Настройки Из НастройкиМассивом Цикл
		Если Не Настройки.РазмещатьЭлементыИнтерфейса Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьКоманднуюПанельПроверкиИПодбора(Форма, Настройки);
		ДобавитьКнопкуПроверкиИПодбора(Форма, Настройки);
		ДобавитьКолонкуСтатусаПроверкиПодбора(Форма, Настройки);
	КонецЦикла;
	
КонецПроцедуры

// Заполнение добавленных реквизитов формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура ЗаполнениеРеквизитовФормы(Форма) Экспорт
	
	НастройкиМассивом = Форма.ПараметрыИнтеграцииГосИС.Получить("ФормаПроверкиИПодбора");
	ЕстьДанныеШтрихкодовУпаковок = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ДанныеШтрихкодовУпаковокГосИС");
	
	Если ЕстьДанныеШтрихкодовУпаковок Тогда
		// Библиотечные документы
		Если НастройкиМассивом = Неопределено Тогда
			ЗаполнитьКешШтрихкодовУпаковок(Форма);
			ПрименитьКешШтрихкодовУпаковок(Форма);
		Иначе
		// Настраиваемые библиотечные и прикладные документы
			Для Каждого Настройки Из НастройкиМассивом Цикл
				Если Не Настройки.РазмещатьЭлементыИнтерфейса Тогда
					Продолжить;
				ИначеЕсли Не Настройки.ИспользоватьКолонкуСтатусаПроверкиПодбора Тогда
					Продолжить;
				КонецЕсли;
				НастройкиЗаполнения = НастройкиИсточникаКешаШтрихкодовУпаковок();
				НастройкиЗаполнения.Сценарий         = Настройки.Сценарий;
				НастройкиЗаполнения.ВсеМаркируемые   = Настройки.ВсеТоварыМаркируемые;
				НастройкиЗаполнения.Объект           = Настройки.ИмяРеквизитаФормыОбъект;
				НастройкиЗаполнения.Штрихкоды        = Настройки.ИмяТабличнойЧастиШтрихкодыУпаковок;
				НастройкиЗаполнения.ШтрихкодУпаковки = Настройки.ИмяКолонкиШтрихкодУпаковки;
				НастройкиЗаполнения.Товары           = Настройки.ИмяТабличнойЧастиТовары;
				НастройкиЗаполнения.Серии            = Настройки.ИмяТабличнойЧастиСерии;
				НастройкиЗаполнения.ЧастичноеВыбытие = Настройки.ДоступноЧастичноеВыбытие;
				НастройкиЗаполнения.ИспользоватьОСУ  = Настройки.ДоступныОбъемноСортовыеКоды;
				НастройкиЗаполнения.Количество       = Настройки.ИмяКолонкиКоличество;
				ЗаполнитьКешШтрихкодовУпаковок(Форма, НастройкиЗаполнения);
				ПрименитьКешШтрихкодовУпаковок(Форма, НастройкиЗаполнения);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	УправлениеВидимостьюЭлементовПроверкиИПодбора(Форма);
	
КонецПроцедуры

// Фиксирует результаты сканирования в форме проверки и подбора в документе, из которого она была вызвана.
//
// Параметры:
//   РезультатПроверки - см. ПараметрыОкончанияПроверки.
//
Процедура ЗафиксироватьРезультатПроверкиИПодбора(РезультатПроверки) Экспорт
	
	СохранитьШтрихкодыНоменклатуры(РезультатПроверки);
	
	МетаданныеДокумента = РезультатПроверки.ПроверяемыйДокумент.Метаданные();
	
	Если ИнтеграцияИС.СодержитсяВПодсистеме("ГосИС", МетаданныеДокумента) Тогда
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеДокумента.ПолноеИмя());
		МенеджерДокумента.ОтразитьРезультатыПроверкиИПодбора(РезультатПроверки);
	Иначе
		ПроверкаИПодборПродукцииИСПереопределяемый.ЗафиксироватьРезультатПроверкиИПодбора(РезультатПроверки);
	КонецЕсли;
	
	ШтрихкодированиеИСМПСлужебный.СинхронизироватьРезультатПроверкиСредствамиККТ(
		РезультатПроверки.ДеревоМаркированнойПродукции,
		РезультатПроверки.ПроверяемыйДокумент);
		
КонецПроцедуры

// Инициализирует структуру параметров завершения проверки и подбора маркируемой продукции
// 
// Возвращаемое значение:
//   Структура - содержит следующие поля:
//     * СоздаватьАктОРасхождениях       - Булево - признак, того что требуется создания документа "Акт о расхождениях".
//     * СозданныйАктОРасхождениях       - ДокументСсылка - в данный параметр требуется поместить созданный документ "Акт о расхождениях".
//     * ПроверяемыйДокумент             - ДокументСсылка - документ, для которого выполнялась проверка и подбор.
//     * ТаблицаШтрихкодовВерхнегоУровня - ТаблицаЗначений - содержит следующие колонки:
//        ** ШтрихкодУпаковки - СправочникСсылка.ШтрихкодыУпаковокТоваров - Штрихкод упаковки
//        ** Штрихкод - Строка - Значение штрихкода
//     * ТаблицаПодобраннойПровереннойПродукции - см. ПустаяТаблицаПодобраннойПровереннойПродукции.
//     * ТаблицаРасхожденийШтриховыхКодов - ТаблицаЗначений - содержит расхождения при проверке маркируемой продукции
//     * ТаблицаОписанияGTIN - см. ПустаяТаблицаОписанияGTIN.
//     * ДанныеКонтроляВидовПродукцииПоРазделеннымДатам - Соответствие из КлючИЗначение:
//     		** Ключ - СправочникСсылка.ВидыПродукцииИС
//     		** Значение - см. СтруктураДанныхКонтроляПоРазделеннымДатам
Функция ПараметрыОкончанияПроверки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СоздаватьАктОРасхождениях", Ложь);
	Результат.Вставить("СозданныйАктОРасхождениях");
	Результат.Вставить("ПроверяемыйДокумент");
	Результат.Вставить("ТаблицаШтрихкодовВерхнегоУровня");
	Результат.Вставить("ТаблицаШтрихкодовОбщая");
	Результат.Вставить("ТаблицаПодобраннойПровереннойПродукции", ПустаяТаблицаПодобраннойПровереннойПродукции());
	Результат.Вставить("ТаблицаРасхожденийШтриховыхКодов");
	Результат.Вставить("ТаблицаОписанияGTIN", ПустаяТаблицаОписанияGTIN());
	Результат.Вставить("ТаблицаУпаковкиПоДокументу");
	Результат.Вставить("ШтрихкодыУпаковокПланЭДО");
	Результат.Вставить("ШтрихкодыУпаковокФактЭДО");
	Результат.Вставить("ШтрихкодыУпаковокРасхождения");
	Результат.Вставить("ДеревоМаркированнойПродукции");
	Результат.Вставить("Сценарий");
	Результат.Вставить("ДанныеПроверкиИПодбора");
	Результат.Вставить("ДанныеКонтроляВидовПродукцииПоРазделеннымДатам", Новый Соответствие);
	
	Возврат Результат;
	
КонецФункции

// Структура данных контроля по видам продукции по разделенным датам.
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ВидПродукции          - СправочникСсылка.ВидыПродукцииИС
// 
// Возвращаемое значение:
//  Структура - Структура данных контроля по разделенным датам:
// * РазрешенОборотНемаркируемыхОстатковПродукции - Булево - Истина, если разрешен оборот немаркированных остатков
// * ТребуетсяКонтрольМарок - Булево - Истина, если требуется контроль марок по операции
// * УменьшатьКоличествоТовараПоКоличествуПодобранныхМарок - Булево - Истина, если при сохранении результатов необходимо
//		ориентироваться на количество подобранных марок. Устанавливается Истина, если не разрешен оборот немаркированных остатков
//		и требуется контроль марок по операции
Функция СтруктураДанныхКонтроляПоРазделеннымДатам(ПараметрыСканирования, ВидПродукции) Экспорт
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("РазрешенОборотНемаркируемыхОстатковПродукции",          Ложь);
	СтруктураВозврата.Вставить("ТребуетсяКонтрольМарок",                                Истина);
	СтруктураВозврата.Вставить("УменьшатьКоличествоТовараПоКоличествуПодобранныхМарок", Истина);
	
	Если ПараметрыСканирования.ИСМП Тогда
		
		СтруктураВозврата.РазрешенОборотНемаркируемыхОстатковПродукции = ОбщегоНазначенияИСМППовтИсп.РазрешенОборотНемаркируемыхОстатковПродукции(ВидПродукции, ПараметрыСканирования.ДатаДокумента);
		СтруктураВозврата.ТребуетсяКонтрольМарок                       = ОбщегоНазначенияИСМППовтИсп.ДействуетКонтрольПоВидуОперацииИПродукции(ПараметрыСканирования.ВидОперацииИСМП, ВидПродукции, ПараметрыСканирования.ДатаДокумента);
		
		СтруктураВозврата.УменьшатьКоличествоТовараПоКоличествуПодобранныхМарок = Не СтруктураВозврата.РазрешенОборотНемаркируемыхОстатковПродукции И СтруктураВозврата.ТребуетсяКонтрольМарок;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Формирует пустую таблицу о штриховых кодах верхнего уровня, для дальнейшего наполнения информацией из формы проверки и подбора.
// 
// Возвращаемое значение:
// 	ТаблицаЗначений - Описание:
// * ШтрихкодУпаковки - СправочникСсылка.ШтрихкодыУпаковокТоваров 
// * Штрихкод - Строка 
//  * ИдентификаторПроисхожденияВЕТИС - ОпределяемыйТип.ИдентификаторПроисхожденияВЕТИС - идентификатор происхождения ВЕТИС.
//  * СрокГодности        - Дата - Срок годности.
Функция ПустаяТаблицаШтрихкодовВерхнегоУровня() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("ШтрихкодУпаковки",           Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
	Таблица.Колонки.Добавить("Штрихкод",                   ОбщегоНазначения.ОписаниеТипаСтрока(200));
	Таблица.Колонки.Добавить("ИдентификаторПроисхожденияВЕТИС", Метаданные.ОпределяемыеТипы.ИдентификаторПроисхожденияВЕТИС.Тип);
	Таблица.Колонки.Добавить("СрокГодности",                    Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("Справка2",                        Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"));
	// Специфика разрешительного режима
	Таблица.Колонки.Добавить("РазрешительныйРежимИдентификаторЗапросаГИСМТ", Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	Таблица.Колонки.Добавить("РазрешительныйРежимДатаЗапросаГИСМТ",          Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("РазрешительныйРежимИдентификаторЭкземпляраПО", Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	Таблица.Колонки.Добавить("РазрешительныйРежимВерсияБазы",                Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	// Специфика частичного выбытия
	Таблица.Колонки.Добавить("ЧастичноеВыбытиеКоличество",     ОбщегоНазначения.ОписаниеТипаЧисло(18, 8));
	Таблица.Колонки.Добавить("ЧастичноеВыбытиеВариантУчета",   Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыУчетаЧастичногоВыбытияИС"));
	Таблица.Колонки.Добавить("ЧастичноеВыбытиеНоменклатура",   Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	Таблица.Колонки.Добавить("ЧастичноеВыбытиеХарактеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	
	Возврат Таблица;
	
КонецФункции

// Формирует пустую таблицу информации о проверенных и под, сформированную в форме проверки и подбора.
// 
// Возвращаемое значение:
// 	ТаблицаЗначений - содержит следующие колонки:
//  * Номенклатура        - ОпределяемыйТип.Номенклатура - Номекнлатура.
//  * Характеристика      - ОпределяемыйТип.ХарактеристикаНоменклатуры - Характеристика.
//  * Серия               - ОпределяемыйТип.СерияНоменклатуры - Серия.
//  * Количество          - Число - количество по документу.
//  * КоличествоПодобрано - Число - фактическое (учетное) количество по результатам проверки и подбора.
//  * КоличествоПотребительскихУпаковок - Число - фактическое количество (потребительских кодов маркировки) по
//      результатам проверки и подбора. Заполняется если товар не штучный.
//  * GTIN                - ОпределяемыйТип.GTIN - GTIN.
//  * ИдентификаторПроисхожденияВЕТИС - ОпределяемыйТип.ИдентификаторПроисхожденияВЕТИС - идентификатор происхождения ВЕТИС.
//  * СрокГодности        - Дата - Срок годности.
Функция ПустаяТаблицаПодобраннойПровереннойПродукции() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("Номенклатура",        Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	Таблица.Колонки.Добавить("Характеристика",      Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	Таблица.Колонки.Добавить("Серия",               Метаданные.ОпределяемыеТипы.СерияНоменклатуры.Тип);
	Таблица.Колонки.Добавить("Количество",          ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	Таблица.Колонки.Добавить("КоличествоПодобрано", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	Таблица.Колонки.Добавить("GTIN",                Метаданные.ОпределяемыеТипы.GTIN.Тип);
	Таблица.Колонки.Добавить("КоличествоПотребительскихУпаковок", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	
	Таблица.Колонки.Добавить("ИдентификаторПроисхожденияВЕТИС", Метаданные.ОпределяемыеТипы.ИдентификаторПроисхожденияВЕТИС.Тип);
	Таблица.Колонки.Добавить("СрокГодности", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("МРЦ",                 ОбщегоНазначения.ОписаниеТипаЧисло(10, 2));
	
	Таблица.Колонки.Добавить("АлкогольнаяПродукция", Новый ОписаниеТипов("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС"));
	Таблица.Колонки.Добавить("Справка2",             Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"));
	
	Таблица.Колонки.Добавить("РазрешительныйРежимИдентификаторЗапросаГИСМТ", Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	Таблица.Колонки.Добавить("РазрешительныйРежимДатаЗапросаГИСМТ",          Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("РазрешительныйРежимИдентификаторЭкземпляраПО", Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	Таблица.Колонки.Добавить("РазрешительныйРежимВерсияБазы",                Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	
	Таблица.Колонки.Добавить("ЧастичноеВыбытиеКоличество",     ОбщегоНазначения.ОписаниеТипаЧисло(18, 8));
	Таблица.Колонки.Добавить("ЧастичноеВыбытиеВариантУчета",   Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыУчетаЧастичногоВыбытияИС"));
	Таблица.Колонки.Добавить("ЧастичноеВыбытиеНоменклатура",   Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	Таблица.Колонки.Добавить("ЧастичноеВыбытиеХарактеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	
	Возврат Таблица;
	
КонецФункции

// Формирует пустую таблицу информации о GTIN, сопоставлении с номенклатурой, коэффициентах групповых упаковок.
// 
// Возвращаемое значение:
// 	ТаблицаЗначений - Описание:
// 	* GTIN                - ОпределяемыйТип.GTIN                       - GTIN.
//  * Номенклатура        - ОпределяемыйТип.Номенклатура               - Номекнлатура.
//  * Характеристика      - ОпределяемыйТип.ХарактеристикаНоменклатуры - Характеристика.
//  * Серия               - ОпределяемыйТип.СерияНоменклатуры          - Серия.
//  * Упаковка            - ОпределяемыйТип.Упаковка                   - Упаковка.
//  * ВидУпаковки         - ПеречислениеСсылка.ВидыУпаковокИС          - Вид упаковки.
//  * Коэффициент         - Число                                      - Коэффициент групповой упаковки.
Функция ПустаяТаблицаОписанияGTIN() Экспорт
	
	ТаблицаПодобраннойПровереннойПродукции = Новый ТаблицаЗначений;
	
	ТипыВидовПродукции = Новый Массив;
	ТипыВидовПродукции.Добавить(Тип("СправочникСсылка.КлючиВидовПродукцииИС"));
	ТипыВидовПродукции.Добавить(Тип("СправочникСсылка.ВидыПродукцииИС"));
	
	ТаблицаПодобраннойПровереннойПродукции.Колонки.Добавить("GTIN",                               Метаданные.ОпределяемыеТипы.GTIN.Тип);
	ТаблицаПодобраннойПровереннойПродукции.Колонки.Добавить("Номенклатура",                       Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	ТаблицаПодобраннойПровереннойПродукции.Колонки.Добавить("Характеристика",                     Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	ТаблицаПодобраннойПровереннойПродукции.Колонки.Добавить("Серия",                              Метаданные.ОпределяемыеТипы.СерияНоменклатуры.Тип);
	ТаблицаПодобраннойПровереннойПродукции.Колонки.Добавить("Упаковка",                           Метаданные.ОпределяемыеТипы.Упаковка.Тип);
	ТаблицаПодобраннойПровереннойПродукции.Колонки.Добавить("Коэффициент",                        ОбщегоНазначения.ОписаниеТипаЧисло(10, 3));
	ТаблицаПодобраннойПровереннойПродукции.Колонки.Добавить("КоличествоПотребительскихУпаковок",  ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаПодобраннойПровереннойПродукции.Колонки.Добавить("ВидУпаковки",                        Новый ОписаниеТипов("ПеречислениеСсылка.ВидыУпаковокИС"));
	ТаблицаПодобраннойПровереннойПродукции.Колонки.Добавить("ЕмкостьПотребительскойУпаковки",     ОбщегоНазначения.ОписаниеТипаЧисло(10, 3));
	ТаблицаПодобраннойПровереннойПродукции.Колонки.Добавить("КоличествоВПотребительскойУпаковке", ОбщегоНазначения.ОписаниеТипаЧисло(18, 8));
	ТаблицаПодобраннойПровереннойПродукции.Колонки.Добавить("ВидПродукции",                       Новый ОписаниеТипов(ТипыВидовПродукции));
	
	ТаблицаПодобраннойПровереннойПродукции.Индексы.Добавить("GTIN, ВидУпаковки");
	
	Возврат ТаблицаПодобраннойПровереннойПродукции;
	
КонецФункции

// Сохраняет штрихкоды номенклатуры
//
// Параметры:
//   РезультатПроверки - См. ПараметрыОкончанияПроверки.
//
Процедура СохранитьШтрихкодыНоменклатуры(РезультатПроверки)
	
	Если РезультатПроверки.ТаблицаОписанияGTIN = Неопределено
		Или РезультатПроверки.ТаблицаОписанияGTIN.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаИПодборПродукцииИСПереопределяемый.СохранитьШтрихкодыНоменклатуры(РезультатПроверки.ТаблицаОписанияGTIN);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РеквизитыФорм

Процедура ПроверитьКолонкиИсточникаИПриемникаНаСовместимость(ДеревоИсточник, ДеревоПриемник) Экспорт
	
	Для Каждого КолонкаИсточника Из ДеревоИсточник.Колонки Цикл
		КолонкаПриемник = ДеревоПриемник.Колонки.Найти(КолонкаИсточника.Имя);
		Если КолонкаПриемник = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(
					НСтр("ru = 'Внутренняя ошибка: Колонка %1 не найдена в приемнике'"), КолонкаИсточника.Имя));
		Иначе
			ТипыКолонкиИсточника = КолонкаИсточника.ТипЗначения.Типы();
			Для Каждого ТипКолонкиИсточника Из ТипыКолонкиИсточника Цикл
				Если Не КолонкаПриемник.ТипЗначения.СодержитТип(ТипКолонкиИсточника) Тогда
					ОбщегоНазначения.СообщитьПользователю(
						СтрШаблон(
							НСтр("ru = 'Внутренняя ошибка: Колонка %1 включает тип %2, который отсутствует в типе колонки приемника'"), КолонкаИсточника.Имя, ТипКолонкиИсточника));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КолонкаПриемника Из ДеревоПриемник.Колонки Цикл
		КолонкаИсточник = ДеревоИсточник.Колонки.Найти(КолонкаПриемника.Имя);
		Если КолонкаИсточник = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(
					НСтр("ru = 'Внутренняя ошибка: Колонка %1 не найдена в источнике'"), КолонкаПриемника.Имя));
		Иначе
			ТипыКолонкиПриемника = КолонкаПриемника.ТипЗначения.Типы();
			Для Каждого ТипКолонкиПриемника Из ТипыКолонкиПриемника Цикл
				Если Не КолонкаИсточник.ТипЗначения.СодержитТип(ТипКолонкиПриемника) Тогда
					ОбщегоНазначения.СообщитьПользователю(
						СтрШаблон(
							НСтр("ru = 'Внутренняя ошибка: Колонка %1 включает тип %2, который отсутствует в типе колонки источника'"), КолонкаПриемника.Имя, ТипКолонкиПриемника));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиВстраиванияФормПроверкиИПодбора

// Возвращает структуру, заполненную значениями по умолчанию, используемую для интеграции форм проверки и подбора
//   в прикладные документы конфигурации - потребителя библиотеки ГосИС.
//
// Возвращаемое значение:
//  Структура - значения, используемые для интеграции формы проверки и подбора:
//   * ИспользоватьБезМаркируемойПродукции        - Булево - признак показа гиперссылки в форме документа без
//           маркируемой продукции.
//   * БлокироватьТабличнуюЧастьТоварыПриПроверке - Булево - признак блокировки табличной части "Товары" для изменений
//           после начала проверки в форме.
//   * ИнформацияДляПользователяОБлокировке       - Строка - информационная надпись на форме над табличной частью
//           "Товары" при БлокироватьТабличнуюЧастьТоварыПриПроверке = Истина.
//   * ИнформацияДляПользователяОПроверке         - Строка - информационная надпись на форме над табличной частью
//           "Товары" при БлокироватьТабличнуюЧастьТоварыПриПроверке = Ложь.
//   * ИспользоватьСтатусПроверкаЗавершена        - Булево - признак допустимости у документа состояния завершения
//           проверки. При значении Ложь проверку можно выполнять многократно.
//   * ИмяРеквизитаФормыОбъект                    - Строка - имя реквизита формы, содержащего объект документа.
//   * ИмяТабличнойЧастиТовары                    - Строка - имя табличной части документа, содержащей номенклатуру.
//   * ИмяТабличнойЧастиСерии                     - Строка - имя табличной части документа, содержащей данные по сериям.
//   * ИмяРодительскойГруппыФормы                 - Строка - имя элемента-группы формы документа, в которую необходимо
//           добавить гиперссылку для открытия формы проверки.
//   * ИмяЭлементаФормыТовары                     - Строка - имя элемента формы документа, в котором выводится табличная
//           часть с номенклатурой.
//   * ИмяПоследующегоЭлементаФормы               - Строка - имя элемента формы, перед которым необходимо добавить
//           гиперссылку для открытия формы проверки.
//   * БлокируемыеЭлементы              - Массив Из Строка - имена элементов формы документа, которые необходимо
//           заблокировать после начала работы с формой проверки.
//   * ИспользоватьСтатусПроверкиПодбораДокумента - Булево - признак наличия у формы реквизита "СтатусПроверкиГосИС".
//   * ИспользоватьКолонкуСтатусаПроверкиПодбора  - Булево - признак использования специальной колонки в таблице товаров
//           для отображения статуса проверки товара.
//   * ИмяСледующейКолонки                        - Строка - имя колонки, перед которой необходимо вставить колонку для
//           отображения статуса проверки товара.
//   * ИмяТабличнойЧастиШтрихкодыУпаковок         - Строка - имя табличной части документа, содержащей штрихкоды
//           упаковок номенклатуры.
//   * ИмяКолонкиШтрихкодУпаковки                 - Строка - имя колонки табличной части штрихкодов содержащей штрихкоды
//           упаковок номенклатуры.
//   * ДоступноЧастичноеВыбытие                   - Булево - признак наличия в табличной части штрихкодов упаковок
//           колонок частичного выбытия кодов маркировки (ЧастичноеВыбытиеНоменклатура, ЧастичноеВыбытиеХарактеристика,
//           ЧастичноеВыбытиеКоличество, ЧастичноеВыбытиеВариантУчета)
//   * ДоступныОбъемноСортовыеКоды                - Булево - возможность использования в табличной части "Товары"
//           маркируемой продукции с автоматическим указанием агрегатов ОСУ без их подбора в форме проверки
//   * ХарактеристикиИспользуются                 - Булево - общий признак использования характеристик.
//   * СерииИспользуются                          - Булево - общий признак использования серий.
//   * РазмещатьЭлементыИнтерфейса                - Булево - необходимость размещения гиперссылок проверки и подбора.
//   * ИмяРеквизитаФормы                          - Строка - имя реквизита формы для вывода гиперссылки проверки/подбора.
//   * ЕстьПравоИзменения                         - Булево - право пользователя на редактирование текущего документа.
//   * ЭтоДокументПриобретения                    - Булево - признак встраивания в документ приобретения.
//   * ЕстьЭлектронныйДокумент                    - Булево - признак наличия ЭДО по объекту.
//   * Заголовки                        - Массив Из Строка - варианты представления заголовков кнопок для пользователя.
//   * ВсеТоварыМаркируемые                       - Булево - необходимость учета признака "Маркируемая продукция" в построчном статусе.
//   * Сценарий                                   - Число  - сценарий встраивания (расположение) формы проверки и подбора.
//   * ОтображатьОшибкиПроверкиСредствамиККТ      - Булево - отображение в состоянии проверки КМ ошибок проверки ККТ.
//   * ИмяКоманднойПанели                         - Строка - при размещении кнопки проверки и подбора в сущствующем подменю.
//
Функция ПараметрыИнтеграцииФормПроверкиИПодбора() Экспорт
	
	ПараметрыИнтеграции = Новый Структура();
	
	#Область СвойстваФормыИОбъектаВстраивания
	
	ПараметрыИнтеграции.Вставить("ЭтоДокументПриобретения",            Ложь);
	ПараметрыИнтеграции.Вставить("ЕстьЭлектронныйДокумент",            Ложь);
	
	ПараметрыИнтеграции.Вставить("ИмяРеквизитаФормыОбъект",            "Объект");
	ПараметрыИнтеграции.Вставить("ИмяТабличнойЧастиТовары",            "Товары");
	ПараметрыИнтеграции.Вставить("ИмяТабличнойЧастиСерии",             "Серии");
	ПараметрыИнтеграции.Вставить("ИмяТабличнойЧастиШтрихкодыУпаковок", "ШтрихкодыУпаковок");
	ПараметрыИнтеграции.Вставить("ИмяКолонкиШтрихкодУпаковки",         "ШтрихкодУпаковки");
	ПараметрыИнтеграции.Вставить("ДоступноЧастичноеВыбытие",           Ложь);
	ПараметрыИнтеграции.Вставить("ДоступныОбъемноСортовыеКоды",        Ложь);
	
	ПараметрыИнтеграции.Вставить("БлокируемыеЭлементы", Новый Массив);
	
	ПараметрыИнтеграции.Вставить("Сценарий", 0);
	ПараметрыИнтеграции.Вставить("РазмещатьЭлементыИнтерфейса", Ложь);
	ПараметрыИнтеграции.Вставить("ИмяРеквизитаФормы",           "ТекстПроверкаПодбор");
	
	ПараметрыИнтеграции.Вставить("ИмяРодительскойГруппыФормы",   "СтраницаТовары");
	ПараметрыИнтеграции.Вставить("ИмяПоследующегоЭлементаФормы", "Товары");
	ПараметрыИнтеграции.Вставить("ИмяЭлементаФормыТовары",       "Товары");
	ПараметрыИнтеграции.Вставить("ИмяСледующейКолонки",          "ТоварыНоменклатура");
	ПараметрыИнтеграции.Вставить("ИмяКоманднойПанели",           "");
	ПараметрыИнтеграции.Вставить("ИмяПоследующегоЭлементаФормыПодменю", "");
	ПараметрыИнтеграции.Вставить("УправлятьВидимостьюКоманднойПанели",  Истина);
	
	#КонецОбласти
	
	#Область НастройкиИнтеграцииФормыПроверки
	
	ПараметрыИнтеграции.Вставить("ИспользоватьСтатусПроверкаЗавершена",        Истина);
	ПараметрыИнтеграции.Вставить("ИспользоватьБезМаркируемойПродукции",        Ложь);
	ПараметрыИнтеграции.Вставить("БлокироватьТабличнуюЧастьТоварыПриПроверке", Истина);
	ПараметрыИнтеграции.Вставить("ИспользоватьСтатусПроверкиПодбораДокумента", Истина);
	ПараметрыИнтеграции.Вставить("ИспользоватьКолонкуСтатусаПроверкиПодбора",  Ложь);
	ПараметрыИнтеграции.Вставить("ИмяКолонкиКоличество",                       "Количество");
	ПараметрыИнтеграции.Вставить("ВсеТоварыМаркируемые",                       Ложь);
	ПараметрыИнтеграции.Вставить("ОтображатьОшибкиПроверкиСредствамиККТ",      Ложь);
	
	#КонецОбласти
	
	#Область ОбщиеНастройкиСистемы
	
	ПараметрыИнтеграции.Вставить("ХарактеристикиИспользуются", ОбщегоНазначенияИС.ХарактеристикиИспользуются());
	ПараметрыИнтеграции.Вставить("СерииИспользуются",          ОбщегоНазначенияИС.СерииИспользуются());
	ПараметрыИнтеграции.Вставить("ЕстьПравоИзменение",         Ложь);
	
	#КонецОбласти
	
	#Область Тексты
	
	ПараметрыИнтеграции.Вставить("ИнформацияДляПользователяОБлокировке",
		НСтр("ru = 'До окончания работы в форме проверки и подбора внесение изменений в данной форме недоступно.'"));
	ПараметрыИнтеграции.Вставить("ИнформацияДляПользователяОПроверке",
		НСтр("ru = 'Выполняется проверка маркируемой продукции. При завершении проверки табличная часть может быть изменена.'"));
	
	ПараметрыИнтеграции.Вставить("Заголовки", Новый Массив);
	ПараметрыИнтеграции.Заголовки.Добавить(НСтр("ru = 'Проверить поступившую маркируемую продукцию'"));
	ПараметрыИнтеграции.Заголовки.Добавить(НСтр("ru = 'Подобрать и проверить маркируемую продукцию'"));
	ПараметрыИнтеграции.Заголовки.Добавить(НСтр("ru = 'Продолжить проверку поступившей маркируемой продукции'"));
	ПараметрыИнтеграции.Заголовки.Добавить(НСтр("ru = 'Продолжить подбор и проверку маркируемой продукции'"));
	ПараметрыИнтеграции.Заголовки.Добавить(НСтр("ru = 'Результаты проверки маркируемой продукции'"));
	ПараметрыИнтеграции.Заголовки.Добавить(НСтр("ru = 'Результаты подбора маркируемой продукции'"));
	ПараметрыИнтеграции.Заголовки.Добавить(НСтр("ru = 'Промежуточные результаты проверки маркируемой продукции'"));
	ПараметрыИнтеграции.Заголовки.Добавить(НСтр("ru = 'Промежуточные результаты подбора маркируемой продукции'"));
	
	#КонецОбласти
	
	Возврат ПараметрыИнтеграции;
	
КонецФункции

Функция ЗаголовокКомандыПроверкиИПодбора(ПараметрыИнтеграции, СтатусПроверкиИПодбора) Экспорт
	
	Результат = "";
	
	ИндексПравоИзменение      = ?(ПараметрыИнтеграции.ЕстьПравоИзменение, 0, 4);
	ИндексЭлектронныйДокумент = ?(ПараметрыИнтеграции.ЕстьЭлектронныйДокумент, 0, 1);
	
	Если СтатусПроверкиИПодбора = Перечисления.СтатусыПроверкиИПодбораИС.Выполняется Тогда
		
		Результат = ПараметрыИнтеграции.Заголовки[2 + ИндексПравоИзменение + ИндексЭлектронныйДокумент];
		
	ИначеЕсли СтатусПроверкиИПодбора = Перечисления.СтатусыПроверкиИПодбораИС.Завершено
		И ПараметрыИнтеграции.ИспользоватьСтатусПроверкаЗавершена Тогда
		
		Результат = ПараметрыИнтеграции.Заголовки[4 + ИндексЭлектронныйДокумент];
		
	Иначе
	
		Результат = ПараметрыИнтеграции.Заголовки[ИндексЭлектронныйДокумент];
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РасчетХешСумм

Процедура РассчитатьХешСуммыУпаковки(СтрокаДерева, ТаблицаХешСумм, ВключаяПодчиненные, ЕстьКолонкаСтатусПроверки = Истина, ЕстьКолонкаХешСуммаНормализации = Неопределено, ИмяПоляКоличество = Неопределено) Экспорт
	
	ДанныеДляРасчетаХешСуммы = Новый СписокЗначений();
	
	Если ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева") Тогда
		ПодчиненныеСтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
		ИдентификаторВДереве    = СтрокаДерева.ПолучитьИдентификатор();
	Иначе
		ПодчиненныеСтрокиДерева = СтрокаДерева.Строки;
		ИдентификаторВДереве    = СтрокаДерева.ИдентификаторСтроки;
	КонецЕсли;
	
	Если ЕстьКолонкаХешСуммаНормализации = Неопределено
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДерева, "ХешСуммаНормализации") Тогда
		ЕстьКолонкаХешСуммаНормализации = Истина;
	КонецЕсли;
	
	ГруппировкаОбъемноСортовогоУчетаПоGTIN = Перечисления.ПрочиеЗоныПересчетаПродукцииИС.ГруппировкаОбъемноСортовогоУчетаПоGTIN;
	
	Для Каждого ПодчиненнаяСтрока Из ПодчиненныеСтрокиДерева Цикл
		
		Если ЕстьКолонкаХешСуммаНормализации = Неопределено Тогда
			ЕстьКолонкаХешСуммаНормализации = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПодчиненнаяСтрока, "ХешСуммаНормализации");
		КонецЕсли;
		
		Если ЕстьКолонкаСтатусПроверки
			И ПодчиненнаяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиНаличияПродукцииИС.Отсутствует Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИнтеграцияИСКлиентСервер.ЭтоУпаковка(ПодчиненнаяСтрока.ТипУпаковки)
			Или ПодчиненнаяСтрока.ТипУпаковки = ГруппировкаОбъемноСортовогоУчетаПоGTIN Тогда
			
			Если ВключаяПодчиненные Тогда
				РассчитатьХешСуммыУпаковки(ПодчиненнаяСтрока, ТаблицаХешСумм, ВключаяПодчиненные, ЕстьКолонкаСтатусПроверки, ЕстьКолонкаХешСуммаНормализации, ИмяПоляКоличество);
			КонецЕсли;
			
			ЗначениеДляРасчета = ПодчиненнаяСтрока.ХешСумма;
			Если Не ЗначениеЗаполнено(ЗначениеДляРасчета) Тогда
				СтрокаДерева.ХешСумма = "";
				Возврат;
			КонецЕсли;
			
		Иначе
			
			Если ЕстьКолонкаХешСуммаНормализации И ЗначениеЗаполнено(ПодчиненнаяСтрока.ХешСуммаНормализации) Тогда
				ЗначениеДляРасчета = ПодчиненнаяСтрока.ХешСуммаНормализации;
			Иначе
				ЗначениеДляРасчета = ПодчиненнаяСтрока.Штрихкод;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗначениеДляРасчета) Тогда
			ДанныеДляРасчетаХешСуммы.Добавить(ЗначениеДляРасчета);
		КонецЕсли;

	КонецЦикла;
	
	Если ИмяПоляКоличество <> Неопределено
		И ДанныеДляРасчетаХешСуммы.Количество() = 0 Тогда
		
		Если ЕстьКолонкаХешСуммаНормализации = Неопределено Тогда
			ЕстьКолонкаХешСуммаНормализации = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДерева, "ХешСуммаНормализации");
		КонецЕсли;
		
		Если ЕстьКолонкаХешСуммаНормализации = Истина
			И ЗначениеЗаполнено(СтрокаДерева.ХешСуммаНормализации) Тогда
			ЗначениеШтрихкода = СтрокаДерева.ХешСуммаНормализации;
		Иначе
			ЗначениеШтрихкода = СтрокаДерева.Штрихкод;
		КонецЕсли;
		
		Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет Тогда
			
			НоменклатураGUID   = СтрокаGUID(СтрокаДерева.Номенклатура);
			ХарактеристикаGUID = СтрокаGUID(СтрокаДерева.Характеристика);
			СерияGUID          = СтрокаGUID(СтрокаДерева.Серия);
			
			Количество = СтрокаДерева.Количество;
			Если Количество = 0
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДерева, "КоличествоПоДаннымИБ") Тогда
				Количество = СтрокаДерева.КоличествоПоДаннымИБ;
			КонецЕсли;
			
			// Количество - в том числе Вес,
			// КоличествоПотребительскихУпаковок содержится в самом штрихкоде
			ДанныеДляРасчетаХешСуммы.Добавить(
			СтрШаблон("%1|%2|%3|%4|%5",
				ЗначениеШтрихкода,
				Формат(Количество, "ЧГ=0;"),
				НоменклатураGUID, ХарактеристикаGUID, СерияGUID));
			
		Иначе
			
			ДанныеДляРасчетаХешСуммы.Добавить(
				СтрШаблон("%1|%2",
					ЗначениеШтрихкода,
					Формат(СтрокаДерева[ИмяПоляКоличество], "ЧГ=0;")));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИнтеграцияИСКлиентСервер.ЭтоУпаковка(СтрокаДерева.ТипУпаковки)
		Или СтрокаДерева.ТипУпаковки = ГруппировкаОбъемноСортовогоУчетаПоGTIN Тогда
		
		СтрокаДерева.ХешСумма = Справочники.ШтрихкодыУпаковокТоваров.ХешСуммаСодержимогоУпаковки(ДанныеДляРасчетаХешСуммы);
		
		СтрокаТаблицыХешСуммы = ТаблицаХешСумм.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыХешСуммы, СтрокаДерева);
		СтрокаТаблицыХешСуммы.ИдентификаторВДереве = ИдентификаторВДереве;
		Если ИмяПоляКоличество = "КоличествоПодчиненныхПотребительскихУпаковок" Тогда
			СтрокаТаблицыХешСуммы.СодержимоеОтсутствует = (СтрокаДерева.КоличествоПодчиненныхВсего = СтрокаДерева.КоличествоПодчиненныхОтсутствует);
		КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПустаяТаблицаХешСумм() Экспорт

	ТаблицаХешСумм = Новый ТаблицаЗначений;
	ТаблицаХешСумм.Колонки.Добавить("ХешСумма", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаХешСумм.Колонки.Добавить("Штрихкод", ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаХешСумм.Колонки.Добавить("ИдентификаторВДереве", ОбщегоНазначения.ОписаниеТипаЧисло(15, 0, ДопустимыйЗнак.Неотрицательный));
	ТаблицаХешСумм.Колонки.Добавить("ХешСуммаНормализации", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаХешСумм.Колонки.Добавить("ВидУпаковки"); // Для ОСУ
	ТаблицаХешСумм.Колонки.Добавить("ТипУпаковки"); // Для ОСУ
	ТаблицаХешСумм.Колонки.Добавить("СодержимоеОтсутствует", Новый ОписаниеТипов("Булево"));

	Возврат ТаблицаХешСумм;

КонецФункции

#КонецОбласти

#Область Перемаркировка

// Возвращает таблицу для перемаркировки продукции
//
// Параметры:
//  ТаблицаХешСумм - ТаблицаЗначений - Таблица хеш сумм
//  ШтрихкодИДанныеУпаковки - Соответствие Из Строка, Произвольный - исходящий параметр
// Возвращаемое значение:
//  См. ПустаяТаблицаПеремаркировки
Функция ТаблицаПеремаркировки(ТаблицаХешСумм, ШтрихкодИДанныеУпаковки = Неопределено) Экспорт
	
	ТаблицаПеремаркировки = ПустаяТаблицаПеремаркировки();
	Если ТаблицаХешСумм.Количество() = 0 Тогда
		Возврат ТаблицаПеремаркировки;
	КонецЕсли;
	
	ШтрихкодыУпаковок = ШтрихкодированиеИС.ШтрихкодыУпаковок(ТаблицаХешСумм,,, Ложь);
	
	ШтрихкодИДанныеУпаковки = Новый Соответствие;
	Для Каждого ДанныеУпаковки Из ШтрихкодыУпаковок Цикл
		ШтрихкодИДанныеУпаковки[ДанныеУпаковки.Штрихкод] = ДанныеУпаковки;
	КонецЦикла;
	
	Для Каждого СтрокаХешСуммы Из ТаблицаХешСумм Цикл
		
		СтрокаПеремаркировки = ТаблицаПеремаркировки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПеремаркировки, СтрокаХешСуммы);
		
		ДанныеУпаковки = ШтрихкодИДанныеУпаковки[СтрокаХешСуммы.Штрихкод];
		
		Если ДанныеУпаковки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПеремаркировки.ПустаяУпаковка = ПустаяСтрока(ДанныеУпаковки.ХешСумма);
		Если СтрокаХешСуммы.ХешСумма = ДанныеУпаковки.ХешСумма
			И ПустаяСтрока(СтрокаХешСуммы.ХешСумма) Тогда
			СтрокаПеремаркировки.ТребуетсяПеремаркировка = (СтрокаХешСуммы.СодержимоеОтсутствует
				И (ДанныеУпаковки.Количество <> 0 Или ДанныеУпаковки.КоличествоПотребительскихУпаковок <> 0));
		Иначе
			СтрокаПеремаркировки.ТребуетсяПеремаркировка = (СтрокаХешСуммы.ХешСумма <> ДанныеУпаковки.ХешСумма);
		КонецЕсли;


		Если СтрокаПеремаркировки.ТребуетсяПеремаркировка Тогда
			СтрокаПеремаркировки.ШтрихкодУпаковки = ДанныеУпаковки.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПеремаркировки;
	
КонецФункции

// Пустая таблица перемаркировки.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Пустая таблица перемаркировки:
// * ИдентификаторВДереве - Число - Идентификатор в дереве
// * ТребуетсяПеремаркировка - Булево - Признак необходимости перемаркировки
// * ПустаяУпаковка - Булево - Признак пустой упаковки
// * ШтрихкодУпаковки - СправочникСсылка.ШтрихкодыУпаковокТоваров, Неопределено - Штрихкод упаковки
Функция ПустаяТаблицаПеремаркировки() Экспорт
	
	ТаблицаПеремаркировки = Новый ТаблицаЗначений;
	ТаблицаПеремаркировки.Колонки.Добавить("ИдентификаторВДереве",    ОбщегоНазначения.ОписаниеТипаЧисло(15, 0, ДопустимыйЗнак.Неотрицательный));
	ТаблицаПеремаркировки.Колонки.Добавить("ТребуетсяПеремаркировка", Новый ОписаниеТипов("Булево"));
	ТаблицаПеремаркировки.Колонки.Добавить("ПустаяУпаковка",          Новый ОписаниеТипов("Булево"));
	ТаблицаПеремаркировки.Колонки.Добавить("ШтрихкодУпаковки");

	Возврат ТаблицаПеремаркировки;
	
КонецФункции

Процедура ОбработатьТаблицуПеремаркировкиСУчетомДетализации(Форма, ТаблицаПеремаркировки, ШтрихкодИДанныеУпаковки) Экспорт

	ШтрихкодыДляПерепроверки = Новый Массив;
	Для Каждого СтрокаТЧ Из ТаблицаПеремаркировки Цикл

		Если СтрокаТЧ.ТребуетсяПеремаркировка Тогда
			ШтрихкодыДляПерепроверки.Добавить(СтрокаТЧ.ШтрихкодУпаковки);
		КонецЕсли;

	КонецЦикла;

	ПараметрыПоиска = Новый Структура();
	ПараметрыПоиска.Вставить("ИмяКолонкиКоличествоПотребительскихУпаковок", "КоличествоПодчиненныхПотребительскихУпаковок");

	Если Форма.ПараметрыСканирования <> Неопределено
		И ШтрихкодыДляПерепроверки.Количество() Тогда

		ВложенныеШтрихкодыУпаковок = ШтрихкодированиеИС.ВложенныеШтрихкодыИзвестныхУпаковок(
			ШтрихкодыДляПерепроверки, Форма.ПараметрыСканирования);

		Индекс = Новый Соответствие;
		Для Каждого СтрокаДерева Из ВложенныеШтрихкодыУпаковок.ДеревоУпаковок.Строки Цикл
			ПроиндексироватьВложенныеШтрихкодыУпаковок(СтрокаДерева, Индекс);
		КонецЦикла;

		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ШтрихкодИДанныеУпаковки",    ШтрихкодИДанныеУпаковки);
		ПараметрыПоиска.Вставить("ТаблицаПеремаркировки",      ТаблицаПеремаркировки);
		ПараметрыПоиска.Вставить("ВложенныеШтрихкодыУпаковок", ВложенныеШтрихкодыУпаковок);
		ПараметрыПоиска.Вставить("Индекс",                     Индекс);

		СнятьПризнакТребуетсяПеремаркировкаЕслиОтличаетсяТолькоДетализация(Форма.ДеревоМаркированнойПродукции, ПараметрыПоиска);

	КонецЕсли;

КонецПроцедуры

Процедура ПроиндексироватьВложенныеШтрихкодыУпаковок(СтрокаДерева, Индекс)
	
	Индекс.Вставить(СтрокаДерева.ШтрихкодУпаковки, СтрокаДерева);
	Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
		ПроиндексироватьВложенныеШтрихкодыУпаковок(ВложеннаяСтрокаДерева, Индекс);
	КонецЦикла;
	
КонецПроцедуры

Процедура СнятьПризнакТребуетсяПеремаркировкаЕслиОтличаетсяТолькоДетализация(СтрокиДереваМаркированнойПродукции, ПараметрыПоиска)

	Если ТипЗнч(СтрокиДереваМаркированнойПродукции) = Тип("ДанныеФормыДерево")
		Или ТипЗнч(СтрокиДереваМаркированнойПродукции) = Тип("ДанныеФормыЭлементДерева") Тогда
		СтрокиДереваМаркированнойПродукцииЭлементы = СтрокиДереваМаркированнойПродукции.ПолучитьЭлементы()
	ИначеЕсли ТипЗнч(СтрокиДереваМаркированнойПродукции) = Тип("Массив") Тогда
		СтрокиДереваМаркированнойПродукцииЭлементы = СтрокиДереваМаркированнойПродукции;
	Иначе
		СтрокиДереваМаркированнойПродукцииЭлементы = СтрокиДереваМаркированнойПродукции.Строки;
	КонецЕсли;

	Для Каждого СтрокаДереваМаркированнойПродукции Из СтрокиДереваМаркированнойПродукцииЭлементы Цикл

		СнятьПризнакТребуетсяПеремаркировкаЕслиОтличаетсяТолькоДетализация(СтрокаДереваМаркированнойПродукции, ПараметрыПоиска);

		Если ТипЗнч(СтрокаДереваМаркированнойПродукции) = Тип("ДанныеФормыЭлементДерева") Тогда
			ИдентификаторВДереве = СтрокаДереваМаркированнойПродукции.ПолучитьИдентификатор();
			СтрокаДереваМаркированнойПродукцииЭлементы = СтрокаДереваМаркированнойПродукции.ПолучитьЭлементы();
		Иначе
			ИдентификаторВДереве = СтрокаДереваМаркированнойПродукции.ИдентификаторСтроки;
			СтрокаДереваМаркированнойПродукцииЭлементы = СтрокаДереваМаркированнойПродукции.Строки;
		КонецЕсли;

		СтрокаТаблицыПеремаркировки = ПараметрыПоиска.ТаблицаПеремаркировки.Найти(ИдентификаторВДереве, "ИдентификаторВДереве");
		Если СтрокаТаблицыПеремаркировки <> Неопределено
			И СтрокаТаблицыПеремаркировки.ТребуетсяПеремаркировка Тогда

			СтрокаДерева = ПараметрыПоиска.Индекс[СтрокаТаблицыПеремаркировки.ШтрихкодУпаковки];
			Если СтрокаДерева <> Неопределено Тогда

				КоличествоСтрокВДереве = СтрокаДерева.Строки.Количество();
				КоличествоСтрокВДеревеМаркированнойПродукции = СтрокаДереваМаркированнойПродукцииЭлементы.Количество();

				КоличествоОтсутствует = 0;
				Для Каждого ВложеннаяСтрокаДереваМаркированнойПродукции Из СтрокаДереваМаркированнойПродукцииЭлементы Цикл
					Если ВложеннаяСтрокаДереваМаркированнойПродукции.СтатусПроверки = Перечисления.СтатусыПроверкиНаличияПродукцииИС.Отсутствует Тогда
						КоличествоОтсутствует = КоличествоОтсутствует + 1;
					КонецЕсли;
				КонецЦикла;

				Если (КоличествоСтрокВДереве = 0
					Или КоличествоСтрокВДеревеМаркированнойПродукции = 0)
					И КоличествоОтсутствует = 0 Тогда
					// Разница в детализации
					СтрокаТаблицыПеремаркировки.ТребуетсяПеремаркировка = Ложь;
				ИначеЕсли КоличествоСтрокВДереве = (КоличествоСтрокВДеревеМаркированнойПродукции - КоличествоОтсутствует) Тогда

					ТребуетсяАнализВложенныхСтрок = Истина;
					ШтрихкодыУпаковокВложенныхСтрокДерева                       = Новый Массив;
					ШтрихкодыУпаковокВложенныхСтрокДереваМаркированнойПродукции = Новый Массив;

					Для Каждого ВложеннаяСтрокаДереваМаркированнойПродукции Из СтрокаДереваМаркированнойПродукцииЭлементы Цикл

						Если ВложеннаяСтрокаДереваМаркированнойПродукции.СтатусПроверки = Перечисления.СтатусыПроверкиНаличияПродукцииИС.Отсутствует Тогда
							Продолжить;
						КонецЕсли;

						ДанныеУпаковки = ПараметрыПоиска.ШтрихкодИДанныеУпаковки[ВложеннаяСтрокаДереваМаркированнойПродукции.Штрихкод];
						Если ДанныеУпаковки <> Неопределено Тогда
							ШтрихкодыУпаковокВложенныхСтрокДереваМаркированнойПродукции.Добавить(ДанныеУпаковки.Ссылка);
						Иначе
							ТребуетсяАнализВложенныхСтрок = Ложь;
							Прервать;
						КонецЕсли;

					КонецЦикла;

					Если ТребуетсяАнализВложенныхСтрок Тогда

						Для Каждого ВложеннаяСтрокаДерева Из СтрокаДерева.Строки Цикл
							ШтрихкодыУпаковокВложенныхСтрокДерева.Добавить(ВложеннаяСтрокаДерева.ШтрихкодУпаковки);
						КонецЦикла;

						СпискиЗначенийИдентичны = ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(
							ШтрихкодыУпаковокВложенныхСтрокДерева,
							ШтрихкодыУпаковокВложенныхСтрокДереваМаркированнойПродукции);
						Если СпискиЗначенийИдентичны Тогда
							// Разница в детализации
							СтрокаТаблицыПеремаркировки.ТребуетсяПеремаркировка = Ложь;
						КонецЕсли;

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

Функция ИмяКнопкиИКоманды(Сценарий) Экспорт
	
	Суффикс = Формат(Сценарий, "ЧЦ=1; ЧН=0;");
	Возврат "ПодобратьИПроверитьПродукциюГосИС" + Суффикс;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСоСтатусамиПроверкиПодбораДокументаСлужебный

Процедура УстановитьСтатус(Форма, Статус, Сценарий)
	
	СтрокаСтатуса = Форма.СтатусыПроверкиПодбораГосИС.НайтиСтроки(Новый Структура("Сценарий", Сценарий));
	Если СтрокаСтатуса.Количество() = 0 Тогда
		СтрокаСтатуса = Форма.СтатусыПроверкиПодбораГосИС.Добавить();
		СтрокаСтатуса.Сценарий  = Сценарий;
		СтрокаСтатуса.Видимость = Истина;
	Иначе
		СтрокаСтатуса = СтрокаСтатуса[0];
	КонецЕсли;
	СтрокаСтатуса.Статус = Статус;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСтатусамиПроверкиПодбораСтрокСлужебный

Процедура ЗаполнитьПризнакМаркируемаяПродукцияГосИС(ТабличнаяЧасть, Настройки)
	
	ВсеМаркируемые  = Настройки.ВсеМаркируемые;
	ИспользоватьОСУ = Настройки.ИспользоватьОСУ;
	
	ЕстьКолонкаДействуетКонтрольОборотаМарок         = Неопределено;
	ЕстьКолонкаРазрешенОборотНемаркированныхОстатков = Неопределено;
	
	Для Каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
		
		Если ЕстьКолонкаДействуетКонтрольОборотаМарок = Неопределено Тогда
			ЕстьКолонкаДействуетКонтрольОборотаМарок = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТабличнойЧасти, "ДействуетКонтрольОборотаМарок");
		КонецЕсли;
		
		Если ЕстьКолонкаДействуетКонтрольОборотаМарок Тогда
			ДействуетКонтрольОборотаМарок = СтрокаТабличнойЧасти.ДействуетКонтрольОборотаМарок
				Или СтрокаТабличнойЧасти.АвтоматическийОСУИС;
		Иначе
			ДействуетКонтрольОборотаМарок = Истина;
		КонецЕсли;
		
		Если ЕстьКолонкаРазрешенОборотНемаркированныхОстатков = Неопределено Тогда
			ЕстьКолонкаРазрешенОборотНемаркированныхОстатков = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТабличнойЧасти, "РазрешенОборотНемаркированныхОстатков");
		КонецЕсли;
		
		Если ЕстьКолонкаРазрешенОборотНемаркированныхОстатков Тогда
			РазрешенОборотНемаркированныхОстатков = СтрокаТабличнойЧасти.РазрешенОборотНемаркированныхОстатков;
		Иначе
			РазрешенОборотНемаркированныхОстатков = Ложь;
		КонецЕсли;
		
		// Легенда:
		// 0 - пустая иконка. 			Продукция немаркируемая.
		// 1 - зеленая иконка.			Продукция маркируемая, отсканировано столько марок, сколько требуется единиц товара.
		// 2 - красная иконка.			Продукция маркируемая, марок нет совсем или отсканировано недостаточно.
		// 3 - голубая иконка.			Продукция требует взвешивания.
		// 4 - серая иконка.			ОСУ или разрешен оборот немаркируемых остатков.
		// 5 - ?
		// 6 - иконка с вопросом.			Разрешен оборот немаркируемых остатков, отсканированы марки, но не по всему количеству.
		// 7 - иконка с вопросом и зеленым.	Разрешен оборот немаркируемых остатков, отсканированы марки или подобраны по ОСУ, но не по всему количеству.
		
		Если ВсеМаркируемые Или СтрокаТабличнойЧасти.МаркируемаяПродукция Тогда
			// автоОСУ
			Если ИспользоватьОСУ И СтрокаТабличнойЧасти.АвтоматическийОСУИС Тогда
				СтрокаТабличнойЧасти.СтатусПроверкиГосИС = 4;
			// марки нужны, но не обязательны
			ИначеЕсли ДействуетКонтрольОборотаМарок И РазрешенОборотНемаркированныхОстатков Тогда
				СтрокаТабличнойЧасти.СтатусПроверкиГосИС = 6;
			// марки обязательны
			ИначеЕсли ДействуетКонтрольОборотаМарок Тогда
				СтрокаТабличнойЧасти.СтатусПроверкиГосИС = 2;
			// не действует контроль за оборотом марок
			Иначе
				СтрокаТабличнойЧасти.СтатусПроверкиГосИС = 0;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПризнакиКонтроляОборотаМарок(Форма, ТабличнаяЧасть, Настройки = Неопределено)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыИнтеграцииГосИС") Тогда
		
		Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП") <> Неопределено Тогда
			
			ПроверкаИПодборПродукцииИСМП.ОбновитьПризнакиКонтроляОборотаМарок(Форма, ТабличнаяЧасть, Настройки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция СтрокаGUID(Ссылка)

	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Строка(Ссылка.УникальныйИдентификатор());
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

Функция ЕстьМаркируемаяПродукцияВКоллекции(Объект, ТабличнаяЧастьТовары)
	
	ЕстьМаркируемаяПродукция = Ложь;
	ПроверкаИПодборПродукцииИСПереопределяемый.ЕстьМаркируемаяПродукция(Объект, ТабличнаяЧастьТовары, ЕстьМаркируемаяПродукция);
	Возврат ЕстьМаркируемаяПродукция;
	
КонецФункции

Процедура ОбновитьОбщийСтатусПодменю(Форма)
	
	Сценарии = Новый Массив;
	Для Каждого СтрокаТаблицы Из Форма.СтатусыПроверкиПодбораГосИС Цикл
		Если Сценарии.Найти(СтрокаТаблицы.Сценарий) = Неопределено Тогда
			Сценарии.Добавить(СтрокаТаблицы.Сценарий);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Сценарий Из Сценарии Цикл
		
		ИмяЭлемента = "СводнаяИнформацияОПроверкеИПодбореПродукцииГосИС" + Сценарий;
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщийСтатус = Неопределено;
		ОбщееОписание = Новый Массив;
		
		Для Каждого СтрокаТаблицы Из Форма.СтатусыПроверкиПодбораГосИС Цикл
			
			Если Не СтрокаТаблицы.Видимость Тогда
				Продолжить;
			ИначеЕсли СтрокаТаблицы.Сценарий <> Сценарий Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Описание) Тогда
				ОбщееОписание.Добавить(СтрокаТаблицы.Описание);
			КонецЕсли;
			
			Индекс = Перечисления.СтатусыПроверкиИПодбораИС.Индекс(СтрокаТаблицы.Статус);
			Если ОбщийСтатус = Неопределено Тогда
				ОбщийСтатус = Индекс;
			Иначе
				ОбщийСтатус = Мин(ОбщийСтатус, Индекс);
			КонецЕсли;
		КонецЦикла;
	
		Если ОбщееОписание.Количество() Тогда
			Форма.Элементы[ИмяЭлемента].Видимость = Истина;
			Форма.Элементы["НадписьПроверкаИПодборПродукцииГосИС" + Сценарий].Заголовок = СтрСоединить(ОбщееОписание, Символы.ПС);
		Иначе
			Форма.Элементы[ИмяЭлемента].Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ЭлементыФорм

#Область ДобавлениеРеквизитов

// Добавляет на форму кнопки проверки и подбора, возобновления проверки по видам продукции ГосИС
// 
// Параметры:
//   Форма               - ФормаКлиентскогоПриложения                   - форма для встраивания гиперссылок проверки и подбора
//   ПараметрыИнтеграции - См. ПараметрыИнтеграцииФормПроверкиИПодбора
//
Процедура ДобавитьКнопкуПроверкиИПодбора(Форма, ПараметрыИнтеграции)
	
	ИмяКомандыПроверкаПодбор = ИмяКнопкиИКоманды(ПараметрыИнтеграции.Сценарий);
	
	Если Форма.Команды.Найти(ИмяКомандыПроверкаПодбор) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Цвет = Форма.ПараметрыИнтеграцииГосИС.Получить("ЦветГиперссылки");
	
	КомандаФормы = Форма.Команды.Добавить(ИмяКомандыПроверкаПодбор);
	КомандаФормы.Действие  = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	КомандаФормы.Заголовок = "Проверка и подбор маркируемой продукции";
	
	РазмещениеВКоманднойПанели = ЗначениеЗаполнено(ПараметрыИнтеграции.ИмяКоманднойПанели);
	ПоследующийЭлемент = Неопределено;
	Если ЗначениеЗаполнено(ПараметрыИнтеграции.ИмяПоследующегоЭлементаФормыПодменю) Тогда
		ПоследующийЭлемент = Форма.Элементы.Найти(ПараметрыИнтеграции.ИмяПоследующегоЭлементаФормыПодменю);
	КонецЕсли;
	
	Кнопка = Форма.Элементы.Вставить(
		ИмяКомандыПроверкаПодбор,
		Тип("КнопкаФормы"),
		Форма.Элементы[ИмяКоманднойПанели(ПараметрыИнтеграции.Сценарий, ПараметрыИнтеграции.ИмяКоманднойПанели)],
		ПоследующийЭлемент);
	Кнопка.ИмяКоманды = ИмяКомандыПроверкаПодбор;
	Кнопка.ЦветТекста = Цвет;
	Если Не РазмещениеВКоманднойПанели Тогда
		Кнопка.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
	КонецЕсли;
	Кнопка.Картинка = БиблиотекаКартинок.МаркируемаяПродукцияШапка;
	
КонецПроцедуры

// Добавляет на форму подменю проверки и подбора по видам продукции ГосИС
// 
// Параметры:
//   Форма               - ФормаКлиентскогоПриложения - форма для встраивания гиперссылок проверки и подбора
//   ПараметрыИнтеграции - Структура        - параметры интеграции прикладной формы
//
Процедура ДобавитьКоманднуюПанельПроверкиИПодбора(Форма, ПараметрыИнтеграции)
	
	ЭлементыФормы = Форма.Элементы;
	ИмяКоманднойПанели = ИмяКоманднойПанели(ПараметрыИнтеграции.Сценарий, ПараметрыИнтеграции.ИмяКоманднойПанели);
	Если ЭлементыФормы.Найти(ИмяКоманднойПанели)<>Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоследующийЭлемент = ?(ЗначениеЗаполнено(ПараметрыИнтеграции.ИмяПоследующегоЭлементаФормы),
		ЭлементыФормы[ПараметрыИнтеграции.ИмяПоследующегоЭлементаФормы],
		Неопределено);
	Если ПоследующийЭлемент <> Неопределено
			И ПоследующийЭлемент.Родитель <> ЭлементыФормы[ПараметрыИнтеграции.ИмяРодительскойГруппыФормы] Тогда
		ПоследующийЭлемент = Неопределено;
	КонецЕсли;
		
	ПанельСканированиеИПроверка = ЭлементыФормы.Вставить(
		ИмяКоманднойПанели,
		Тип("ГруппаФормы"),
		ЭлементыФормы[ПараметрыИнтеграции.ИмяРодительскойГруппыФормы],
		ПоследующийЭлемент);
	ПанельСканированиеИПроверка.Вид = ВидГруппыФормы.КоманднаяПанель;
	
	ИнформацияОПроверкеИПодборе = ЭлементыФормы.Вставить(
		"СводнаяИнформацияОПроверкеИПодбореПродукцииГосИС" + ПараметрыИнтеграции.Сценарий,
		Тип("ГруппаФормы"),
		ЭлементыФормы[ПараметрыИнтеграции.ИмяРодительскойГруппыФормы],
		ПоследующийЭлемент);
	
	ИнформацияОПроверкеИПодборе.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ИнформацияОПроверкеИПодборе.ОтображатьЗаголовок = Ложь;
	ИнформацияОПроверкеИПодборе.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ИнформацияОПроверкеИПодборе.РастягиватьПоВертикали = Ложь;
	ИнформацияОПроверкеИПодборе.РастягиватьПоГоризонтали = Истина;
	
	Картинка = ЭлементыФормы.Добавить("КартинкаПроверкаИПодборПродукцииГосИС" + ПараметрыИнтеграции.Сценарий,
		Тип("ДекорацияФормы"), ИнформацияОПроверкеИПодборе);
	Картинка.Вид      = ВидДекорацииФормы.Картинка;
	Картинка.Картинка = БиблиотекаКартинок.ИнформацияГосИС;
	
	Надпись = ЭлементыФормы.Добавить("НадписьПроверкаИПодборПродукцииГосИС" + ПараметрыИнтеграции.Сценарий,
		Тип("ДекорацияФормы"), ИнформацияОПроверкеИПодборе);
	Надпись.Вид = ВидДекорацииФормы.Надпись;
	Надпись.АвтоМаксимальнаяШирина = Ложь;
	
	
КонецПроцедуры

Функция ИмяКоманднойПанели(Сценарий, ИмяКоманднойПанели)
	Если ЗначениеЗаполнено(ИмяКоманднойПанели) Тогда
		Возврат ИмяКоманднойПанели;
	КонецЕсли;
	Возврат "КоманднаяПанельПроверкаИПодборПродукцииГосИС" + Сценарий;
КонецФункции

// Добавляет на форму колонку статуса проверки и подбора в табличной части
//
// Параметры:
//   Форма               - ФормаКлиентскогоПриложения                   - форма для встраивания
//   ПараметрыИнтеграции - Структура                          - параметры интеграции прикладной формы
//
Процедура ДобавитьКолонкуСтатусаПроверкиПодбора(Форма, ПараметрыИнтеграции)
	
	Если ПараметрыИнтеграции.ИспользоватьКолонкуСтатусаПроверкиПодбора Тогда
		
		ПутьКРеквизиту = ПараметрыИнтеграции.ИмяРеквизитаФормыОбъект+"."+ПараметрыИнтеграции.ИмяТабличнойЧастиТовары;
		ПутьКРеквизиту = ПутьКРеквизиту + ".СтатусПроверкиГосИС";
		ИмяКолонкиРеквизита = СтрШаблон("%1СтатусПроверкиГосИС",ПараметрыИнтеграции.ИмяТабличнойЧастиТовары);
		
		Если Форма.Элементы.Найти(ИмяКолонкиРеквизита) = Неопределено Тогда
		
			КолонкаИнтерфейса = Форма.Элементы.Вставить(
				ИмяКолонкиРеквизита,
				Тип("ПолеФормы"),
				Форма.Элементы[ПараметрыИнтеграции.ИмяЭлементаФормыТовары],
				Форма.Элементы[ПараметрыИнтеграции.ИмяСледующейКолонки]);
			КолонкаИнтерфейса.ПутьКДанным = ПутьКРеквизиту;
			КолонкаИнтерфейса.Вид = ВидПоляФормы.ПолеКартинки;
			КолонкаИнтерфейса.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			КолонкаИнтерфейса.КартинкаЗначений = БиблиотекаКартинок.МаркируемаяПродукцияТЧ;
			КолонкаИнтерфейса.КартинкаШапки = БиблиотекаКартинок.МаркируемаяПродукцияШапка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Преобразовать несериализуемые значения.
// 
// Параметры:
//  ПроверяемыеДанные - Структура - Проверяемые данные:
//   * МаркированныеТовары - ТаблицаЗначений - маркированные товары для проверки,
//   * ДеревоУпаковок - ДеревоЗначений - упаковки для проверки.
Процедура ПреобразоватьНесериализуемыеЗначения(ПроверяемыеДанные) Экспорт
	
	Если Не ПроверяемыеДанные.Свойство("МаркированныеТовары") Тогда
		Возврат;
	КонецЕсли;
	
	Дерево  = ПроверяемыеДанные.ДеревоУпаковок;
	Таблица = ПроверяемыеДанные.МаркированныеТовары;
	
	ИменаКолонокДерева = Новый Массив;
	
	Для Каждого КолонкаДерева Из Дерево.Колонки Цикл
		ИменаКолонокДерева.Добавить(КолонкаДерева.Имя);
	КонецЦикла;
	
	ИменаКолонокДерева = СтрСоединить(ИменаКолонокДерева, ",");
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		ЗначенияСтрокиДерева = Новый Структура(ИменаКолонокДерева);
		ЗаполнитьЗначенияСвойств(ЗначенияСтрокиДерева, СтрокаТаблицы.СтрокаДерева);
		СтрокаТаблицы.СтрокаДерева = ЗначенияСтрокиДерева;
		СтрокаТаблицы.УпаковкаВерхнегоУровня = Неопределено; //не используется при загрузке
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДобавленнымиРеквизитами

Процедура ОбновитьИнтерфейсПоСценарию(Форма, СтатусПроверкиИПодбора, ПараметрыИнтеграции)
	
	ИмяКомандыПроверкаПодбор = ИмяКнопкиИКоманды(ПараметрыИнтеграции.Сценарий);
	
	Если Форма.Элементы.Найти(ИмяКомандыПроверкаПодбор) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КнопкаФормы  = Форма.Элементы[ИмяКомандыПроверкаПодбор];
	
	КнопкаФормы.Заголовок = ЗаголовокКомандыПроверкиИПодбора(ПараметрыИнтеграции, СтатусПроверкиИПодбора);
	Форма.Команды[КнопкаФормы.ИмяКоманды].Подсказка = КнопкаФормы.Заголовок;
	
	СтрокаСтатуса = Форма.СтатусыПроверкиПодбораГосИС.НайтиСтроки(Новый Структура("Сценарий", ПараметрыИнтеграции.Сценарий));
	Если СтрокаСтатуса.Количество() Тогда
		
		Если СтатусПроверкиИПодбора = Перечисления.СтатусыПроверкиИПодбораИС.Выполняется
			И ПараметрыИнтеграции.ЕстьПравоИзменение Тогда
			
			Если ПараметрыИнтеграции.БлокироватьТабличнуюЧастьТоварыПриПроверке Тогда
				СтрокаСтатуса[0].Описание = ПараметрыИнтеграции.ИнформацияДляПользователяОБлокировке;
			Иначе
				СтрокаСтатуса[0].Описание = ПараметрыИнтеграции.ИнформацияДляПользователяОПроверке;
			КонецЕсли;
		Иначе
			
			СтрокаСтатуса[0].Описание = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РаботаСФормойПроверкиИПодбора

//Формирует пустую таблицу маркируемой продукции
//
//Возвращаемое значение:
//  ТаблицаЗначений - таблица определяющая состав маркируемой продукции документа:
//    GTIN           - ОпределяемыйТип.GTIN                         - штрихкод.
//    КлючВидовПродукции   - СправочникСсылка.КлючиВидовПродукцииИС - вид маркируемой продукции.
//    Номенклатура   - ОпределяемыйТип.Номенклатура                 - номенклатура.
//    Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры   - характеристика.
//    Серия          - ОпределяемыйТип.СерияНоменклатуры            - серия.
//    Количество     - Число                                        - количество.
//    КодыGTIN       - СписокЗначений из ОпределяемыйТип.GTIN       - штрихкоды номенклатура.
//    ИдентификаторПроисхожденияВЕТИС  - ОпределяемыйТип.ИдентификаторПроисхожденияВЕТИС - идентификатор происхождения ВетИС.
//    ИдентификаторыПроисхожденияВЕТИС - Массив Из ОпределяемыйТип.ИдентификаторПроисхожденияВЕТИС - идентификаторы происхождения ВетИС.
//    СкоропортящаясяПродукция         - Булево - скоропортящаяся продукция
//    ГоденДо                          - Дата   - срок годности продукции
//
Функция НоваяТаблицаПродукции()
	
	ТаблицаМаркируемойПродукции = Новый ТаблицаЗначений();
	ТаблицаМаркируемойПродукции.Колонки.Добавить("GTIN",           Метаданные.ОпределяемыеТипы.GTIN.Тип);
	ТаблицаМаркируемойПродукции.Колонки.Добавить("КлючВидовПродукции", Новый ОписаниеТипов("СправочникСсылка.КлючиВидовПродукцииИС"));
	ТаблицаМаркируемойПродукции.Колонки.Добавить("Номенклатура",   Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	ТаблицаМаркируемойПродукции.Колонки.Добавить("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	ТаблицаМаркируемойПродукции.Колонки.Добавить("Серия",          Метаданные.ОпределяемыеТипы.СерияНоменклатуры.Тип);
	ТаблицаМаркируемойПродукции.Колонки.Добавить("Количество",     Новый ОписаниеТипов("Число"));
	ТаблицаМаркируемойПродукции.Колонки.Добавить("КодыGTIN",       Новый ОписаниеТипов("СписокЗначений"));
	ТаблицаМаркируемойПродукции.Колонки.Добавить("КоличествоПотребительскихУпаковок", Новый ОписаниеТипов("Число"));
	ТаблицаМаркируемойПродукции.Колонки.Добавить("ИдентификаторПроисхожденияВЕТИС",   Метаданные.ОпределяемыеТипы.ИдентификаторПроисхожденияВЕТИС.Тип);
	ТаблицаМаркируемойПродукции.Колонки.Добавить("ИдентификаторыПроисхожденияВЕТИС",  Новый ОписаниеТипов("Массив"));
	ТаблицаМаркируемойПродукции.Колонки.Добавить("СкоропортящаясяПродукция",          Новый ОписаниеТипов("Булево"));
	ТаблицаМаркируемойПродукции.Колонки.Добавить("ГоденДо",                           Новый ОписаниеТипов("Дата"));
	ТаблицаМаркируемойПродукции.Колонки.Добавить("АлкогольнаяПродукция", Новый ОписаниеТипов("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС"));
	ТаблицаМаркируемойПродукции.Колонки.Добавить("Справка2", Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"));
	
	Возврат ТаблицаМаркируемойПродукции;
	
КонецФункции

Процедура ДополнитьТаблицуПодобраннойМаркируемойПродукции(ТаблицаМаркируемойПродукции, ДанныеДокумента, ПараметрыСканирования) Экспорт
	
	Если ТаблицаМаркируемойПродукции.Количество() = 0 И ДанныеДокумента.ПодобраннаяМаркируемаяПродукция.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаИзмененийПодобраннойПродукции = СформироватьТаблицуИзмененийПодобраннойПродукции(ТаблицаМаркируемойПродукции, ДанныеДокумента, ПараметрыСканирования);
	ДополнитьGTINПодобраннойПродукцииПоМаркируемымТоварам(ДанныеДокумента, ТаблицаИзмененийПодобраннойПродукции);
	
	ДопустимаПроизвольнаяЕдиницаУчета = ОбщегоНазначенияИС.ИспользуетсяПроизвольнаяЕдиницаУчета()
		Или ОбщегоНазначенияИСКлиентСервер.ПоддерживаетсяЧастичноеВыбытие(ПараметрыСканирования);
	
	ПоддерживаетсяОбъемноСортовойУчет = ПараметрыСканирования.ПоддерживаетсяОбъемноСортовойУчет;
	
	Контекст = Новый Структура;
	Контекст.Вставить("ПодобраннаяМаркируемаяПродукция",   ДанныеДокумента.ПодобраннаяМаркируемаяПродукция);
	Контекст.Вставить("РежимПодбораСуществующихУпаковок",  ДанныеДокумента.РежимПодбораСуществующихУпаковок);
	Контекст.Вставить("ПроверяемыйДокумент",               ДанныеДокумента.ПроверяемыйДокумент);
	Контекст.Вставить("ДопустимаПроизвольнаяЕдиницаУчета", ДопустимаПроизвольнаяЕдиницаУчета);
	Контекст.Вставить("ДопустимУчетМерныхТоваров",         ОбщегоНазначенияИС.ЕстьПродукцияТребующаяВзвешивания());
	Контекст.Вставить("ПараметрыПроверкиКодовМаркировки",  Новый Структура("ЗапрашиватьКоличествоМерногоТовара", Ложь));
	Контекст.Вставить("ПоддерживаетсяОбъемноСортовойУчет", ПоддерживаетсяОбъемноСортовойУчет);
	Контекст.Вставить("ПараметрыСканирования",             ПараметрыСканирования);
	
	ДополнительныеПараметры = ПроверкаИПодборПродукцииИСКлиентСервер.ПараметрыИзмененияСтрокиПодобраннойПродукции();
	ДополнительныеПараметры.ЭтоЗагрузкаДанныхДокументаПриОткрытииФормы = Истина;
	ДополнительныеПараметры.УточнитьКоличествоИС = Не ДанныеДокумента.РежимПодбораСуществующихУпаковок;
	
	КэшированныеЗначения = Неопределено;
	
	Для Каждого СтрокаТаблицы Из ТаблицаИзмененийПодобраннойПродукции Цикл
		
		ПроверкаИПодборПродукцииИСКлиентСервер.ДобавлениеСтрокиПодобраннойПродукции(
			Контекст, СтрокаТаблицы, СтрокаТаблицы.Изменение, ДополнительныеПараметры);
		
	КонецЦикла;
	
	Строки = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из Контекст.ПодобраннаяМаркируемаяПродукция Цикл
		Строки.Вставить(СтрокаТаблицы);
	КонецЦикла;
	
	Действия = Новый Соответствие;
	Действия.Вставить("ОбработатьИзменениеНоменклатуры", Истина);
	Действия.Вставить("ОбработатьИзменениеКоличества", Истина);
	
	ПроверкаИПодборПродукцииИСПереопределяемый.ОбработатьПодобраннуюПродукцию(
		Контекст, Строки, Действия, КэшированныеЗначения, Контекст.ПараметрыСканирования.ПараметрыУказанияСерий);
	
КонецПроцедуры

Процедура ДополнитьGTINПодобраннойПродукцииПоМаркируемымТоварам(ДанныеДокумента, МаркированныеТовары)
	
	Если ДанныеДокумента.ПодобраннаяМаркируемаяПродукция.Количество()= 0 Или МаркированныеТовары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	АнализируемыйТовар = Новый Соответствие;
	Для Каждого Строка Из МаркированныеТовары Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		ИспользуемыеХарактеристикиИGTIN = АнализируемыйТовар[Строка.Номенклатура];
		Если ИспользуемыеХарактеристикиИGTIN = Неопределено Тогда
			ИспользуемыеХарактеристикиИGTIN = Новый Соответствие;
			АнализируемыйТовар.Вставить(Строка.Номенклатура, ИспользуемыеХарактеристикиИGTIN);
		КонецЕсли;
		
		ИспользуемыеGTIN = ИспользуемыеХарактеристикиИGTIN[Строка.Характеристика];
		Если ИспользуемыеGTIN = Неопределено Тогда
			ИспользуемыеGTIN = Новый Соответствие;
			ИспользуемыеХарактеристикиИGTIN.Вставить(Строка.Характеристика, ИспользуемыеGTIN);
		КонецЕсли;
		
		Если ИспользуемыеGTIN[Строка.GTIN] = Неопределено Тогда
			ИспользуемыеGTIN.Вставить(Строка.GTIN, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Если АнализируемыйТовар.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПерезаполнитьПродукцияПоДокументу = Ложь;
	
	Для Каждого СтрокаПодобраннойПродукции Из ДанныеДокумента.ПодобраннаяМаркируемаяПродукция Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаПодобраннойПродукции.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		ИспользуемыеХарактеристикиИGTIN = АнализируемыйТовар[СтрокаПодобраннойПродукции.Номенклатура];
		Если ИспользуемыеХарактеристикиИGTIN = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ИспользуемыеGTIN = ИспользуемыеХарактеристикиИGTIN[СтрокаПодобраннойПродукции.Характеристика];
		Если ИспользуемыеGTIN = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущиеGTIN = Новый Соответствие;
		Для Каждого ЭлементСписка Из СтрокаПодобраннойПродукции.КодыGTIN Цикл
			ТекущиеGTIN.Вставить(ЭлементСписка.Значение, Истина);
		КонецЦикла;
		
		Для Каждого КлючЗначение Из ИспользуемыеGTIN Цикл
			GTIN = КлючЗначение.Ключ;
			Если ТекущиеGTIN[GTIN] = Неопределено Тогда
				СтрокаПодобраннойПродукции.КодыGTIN.Добавить(GTIN);
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаПодобраннойПродукции.КодыGTIN.Количество() > ТекущиеGTIN.Количество() Тогда
			
			СтрокаПодобраннойПродукции.ПредставлениеGTIN = ПроверкаИПодборПродукцииИСКлиентСервер.ПредставлениеМассиваGTIN(СтрокаПодобраннойПродукции.КодыGTIN);
			Если СтрокаПодобраннойПродукции.КодыGTIN.Количество() = 1 Тогда
				СтрокаПодобраннойПродукции.GTIN = СтрокаПодобраннойПродукции.КодыGTIN[0].Значение;
			ИначеЕсли СтрокаПодобраннойПродукции.КодыGTIN.Количество() > 1 Тогда
				СтрокаПодобраннойПродукции.GTIN = "";
			КонецЕсли;
			
			ПерезаполнитьПродукцияПоДокументу = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПерезаполнитьПродукцияПоДокументу Тогда
		
		ПродукцияПоДокументу = ДанныеДокумента.ПодобраннаяМаркируемаяПродукция.СкопироватьКолонки();
		
		Для Каждого СтрокаПодобраннойПродукции Из ДанныеДокумента.ПодобраннаяМаркируемаяПродукция Цикл
			
			Если СтрокаПодобраннойПродукции.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(
				ПродукцияПоДокументу.Добавить(), СтрокаПодобраннойПродукции);
			
		КонецЦикла;
		
		ДанныеДокумента.Вставить("ПродукцияПоДокументу", ПродукцияПоДокументу);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаСтрокиЧастичногоВыбытияПриВосстановленииДанных(СтрокаПриемника, СтрокаИсточника, ПараметрыСканирования) Экспорт
	
	Если ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЭтоСтрокаДанныхЧастичногоВыбытия(
		СтрокаИсточника, ПараметрыСканирования, Истина) Тогда
		
		Если СтрокаИсточника.ЧастичноеВыбытие Тогда
			
			Если СтрокаИсточника.ЧастичноеВыбытиеВариантУчета = Перечисления.ВариантыУчетаЧастичногоВыбытияИС.НастроеннаяНоменклатура Тогда
				СтрокаПриемника.Номенклатура             = СтрокаИсточника.ЧастичноеВыбытиеНоменклатура;
				СтрокаПриемника.Характеристика           = СтрокаИсточника.ЧастичноеВыбытиеХарактеристика;
			КонецЕсли;
			
			СтрокаПриемника.ПроизвольнаяЕдиницаУчета = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьТаблицуИзмененийПодобраннойПродукции(ТаблицаМаркируемойПродукции, ДанныеДокумента, ПараметрыСканирования)
	
	КолонкиТаблицы = КолонкиДляТаблицыИзмененийПодобраннойПродукции();
	
	ТаблицаИзмененийПодобраннойПродукции = Новый ТаблицаЗначений;
	
	Для Каждого ОписаниеКолонки Из КолонкиТаблицы Цикл
		ТаблицаИзмененийПодобраннойПродукции.Колонки.Добавить(ОписаниеКолонки.Имя, ОписаниеКолонки.ОписаниеТипов);
	КонецЦикла;
	
	Если ТаблицаМаркируемойПродукции.Количество() = 0 Тогда
		Возврат ТаблицаИзмененийПодобраннойПродукции;
	КонецЕсли;
	
	ПустаяХарактеристикаНоменклатуры = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ХарактеристикаНоменклатуры");
	ПустаяСерияНоменклатуры          = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры");
	ПустаяНоменклатура               = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Номенклатура");
	
	ЕстьКолонкаGTIN = ТаблицаМаркируемойПродукции.Колонки.Найти("GTIN") <> Неопределено;
	ЕстьКолонкаМРЦ = ТаблицаМаркируемойПродукции.Колонки.Найти("МРЦ") <> Неопределено;
	ЕстьКолонкаПредставлениеНоменклатуры = ТаблицаИзмененийПодобраннойПродукции.Колонки.Найти("ПредставлениеНоменклатуры") <> Неопределено;
	
	Для Каждого СтрокаИсточника Из ТаблицаМаркируемойПродукции Цикл
		
		ОбработкаСтрокиЧастичногоВыбытияПриВосстановленииДанных(
			СтрокаИсточника,
			СтрокаИсточника,
			ПараметрыСканирования);
		
		Если ЕстьКолонкаGTIN Тогда
			СтрокаИсточника.GTIN = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.GTINПоШтрихкодуEAN(СтрокаИсточника.GTIN);
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
		Если ЕстьКолонкаGTIN Тогда
			СтруктураПоиска.Вставить("GTIN", СтрокаИсточника.GTIN);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаИсточника.Номенклатура) Тогда
			
			СтруктураПоиска.Вставить("Номенклатура", СтрокаИсточника.Номенклатура);
			
			Если ЗначениеЗаполнено(СтрокаИсточника.Характеристика) Тогда
				СтруктураПоиска.Вставить("Характеристика", СтрокаИсточника.Характеристика);
			Иначе
				СтруктураПоиска.Вставить("Характеристика", ПустаяХарактеристикаНоменклатуры);
			КонецЕсли;
			
			Если ДанныеДокумента.РежимПодбораСуществующихУпаковок Тогда
				Если ЗначениеЗаполнено(СтрокаИсточника.Серия) Тогда
					СтруктураПоиска.Вставить("Серия", СтрокаИсточника.Серия);
				Иначе
					СтруктураПоиска.Вставить("Серия", ПустаяСерияНоменклатуры);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			СтруктураПоиска.Вставить("Номенклатура", ПустаяНоменклатура);
			
		КонецЕсли;
		
		Для Каждого ОписаниеСвойства Из ДополнительныеСвойстваВидовПродукции() Цикл
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаИсточника, ОписаниеСвойства) Тогда
				СтруктураПоиска.Вставить(ОписаниеСвойства, СтрокаИсточника[ОписаниеСвойства]);
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураПоиска.Вставить("ВидУпаковки", СтрокаИсточника.ВидУпаковки);
			
		СтрокиПродукции = ТаблицаИзмененийПодобраннойПродукции.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиПродукции.Количество() = 0 Тогда
			СтрокаПродукции = ТаблицаИзмененийПодобраннойПродукции.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПродукции, СтрокаИсточника); 
			ЗаполнитьЗначенияСвойств(СтрокаПродукции, СтруктураПоиска);
			Если ЕстьКолонкаПредставлениеНоменклатуры Тогда
				СтрокаПродукции.ПредставлениеНоменклатуры = СтрокаИсточника.ПредставлениеНоменклатуры;
			КонецЕсли;
			СтрокаПродукции.Количество = 0;
			СтрокаПродукции.КоличествоПотребительскихУпаковок = 0;
		Иначе
			СтрокаПродукции = СтрокиПродукции[0];
		КонецЕсли;
		
		Если ЕстьКолонкаМРЦ Тогда
			Если ЗначениеЗаполнено(СтрокаИсточника.МРЦ) Тогда
				СтрокаПродукции.ВключаетМРЦ = Истина;
			ИначеЕсли СтрокаИсточника.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская
				Или СтрокаИсточника.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
				СтрокаПродукции.ВключаетМРЦ = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДоступноПолеМРЦ(СтрокаИсточника.ВидПродукции);
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаИсточника.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			КоличествоИзменение = 1;
		Иначе
			КоличествоИзменение = СтрокаИсточника.КоличествоПотребительскихУпаковок;
		КонецЕсли;
		
		СтрокаПродукции.Изменение = СтрокаПродукции.Изменение + КоличествоИзменение;
		
		Если ЗначениеЗаполнено(СтрокаИсточника.Номенклатура) Тогда
			СтрокаПродукции.Количество = СтрокаПродукции.Количество + СтрокаИсточника.Количество;
			СтрокаПродукции.КоличествоПотребительскихУпаковок = СтрокаПродукции.КоличествоПотребительскихУпаковок + СтрокаИсточника.КоличествоПотребительскихУпаковок;
		Иначе 
			СтрокаПродукции.Количество = СтрокаПродукции.Количество + 1;
			СтрокаПродукции.КоличествоПотребительскихУпаковок = СтрокаПродукции.КоличествоПотребительскихУпаковок + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаИзмененийПодобраннойПродукции;
	
КонецФункции

Функция КолонкиДляТаблицыИзмененийПодобраннойПродукции() Экспорт
	
	ОписаниеСвойства = "Имя, ОписаниеТипов";
	
	ТипыВидовПродукции = Новый Массив;
	ТипыВидовПродукции.Добавить(Тип("СправочникСсылка.КлючиВидовПродукцииИС"));
	ТипыВидовПродукции.Добавить(Тип("СправочникСсылка.ВидыПродукцииИС"));
	
	ОписаниеСвойств = Новый Массив;
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "Номенклатура",              Метаданные.ОпределяемыеТипы.Номенклатура.Тип));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "Характеристика",            Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "Серия",                     Метаданные.ОпределяемыеТипы.СерияНоменклатуры.Тип));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "GTIN",                      Метаданные.ОпределяемыеТипы.GTIN.Тип));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "ТипУпаковки",               Новый ОписаниеТипов("ПеречислениеСсылка.ТипыУпаковок")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "ВидПродукции",              Новый ОписаниеТипов(ТипыВидовПродукции)));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "ВидУпаковки",               Новый ОписаниеТипов("ПеречислениеСсылка.ВидыУпаковокИС")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "ПредставлениеНоменклатуры", Новый ОписаниеТипов("Строка")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "Изменение",                 Новый ОписаниеТипов("Число")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "Количество",                Новый ОписаниеТипов("Число")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "ПроизвольнаяЕдиницаУчета",  Новый ОписаниеТипов("Булево")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "ТребуетВзвешивания",        Новый ОписаниеТипов("Булево")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "НеПересчитыватьКоличествоПотребительскихУпаковок", Новый ОписаниеТипов("Булево")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "ИдентификаторПроисхожденияВЕТИС", Метаданные.ОпределяемыеТипы.ИдентификаторПроисхожденияВЕТИС.Тип));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "ГоденДо",                         Новый ОписаниеТипов("Дата")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "СкоропортящаясяПродукция",        Новый ОписаниеТипов("Булево")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "МРЦ",         Новый ОписаниеТипов("Число")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "ВключаетМРЦ", Новый ОписаниеТипов("Булево")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "АлкогольнаяПродукция", Новый ОписаниеТипов("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "Справка2", Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС")));
	ОписаниеСвойств.Добавить(Новый Структура(ОписаниеСвойства, "КоличествоПотребительскихУпаковок", Новый ОписаниеТипов("Число")));
	
	Возврат ОписаниеСвойств;
	
КонецФункции

Функция ДополнительныеСвойстваВидовПродукции()
	
	Результат = Новый Массив;
	Результат.Добавить("ИдентификаторПроисхожденияВЕТИС");
	Результат.Добавить("ГоденДо");
	Результат.Добавить("СкоропортящаясяПродукция");
	Результат.Добавить("МРЦ");
	Результат.Добавить("ВключаетМРЦ");
	Результат.Добавить("АлкогольнаяПродукция");
	Результат.Добавить("Справка2");
	Возврат Результат;
	
КонецФункции

Функция ЭтоДокументПриобретения(ДокументСсылка) Экспорт
	
	Если ДокументСсылка = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Результат = Ложь;
	ИмяДокумента = ДокументСсылка.Метаданные().Имя;
	Если ИмяДокумента = "ПриемкаТоваровИСМП" Тогда
		Результат = Истина;
	ИначеЕсли ИмяДокумента = "ЭлектронныйДокументВходящийЭДО" Тогда
		Результат = Истина;
	ИначеЕсли ИмяДокумента = "ТТНВходящаяЕГАИС" Тогда
		Результат = Истина;
	КонецЕсли;
	ПроверкаИПодборПродукцииИСПереопределяемый.ЭтоДокументПриобретения(ИмяДокумента, Результат);
	Возврат Результат;
	
КонецФункции

Функция ЭтоАктОРасхождениях(ДокументСсылка) Экспорт
	
	Если ДокументСсылка = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Результат = Ложь;
	ИмяДокумента = ДокументСсылка.Метаданные().Имя;
	ПроверкаИПодборПродукцииИСПереопределяемый.ЭтоАктОРасхождениях(ИмяДокумента, Результат);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
