#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Склад)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Запрос - Запрос -
//  ИмяТаблицы - Строка - 
//  УстановленныеБлокировки - см. РегистрыНакопления.ЗапасыИПотребности.УстановитьБлокировкиЗаказовИТоваров
//  ПодключаемыйНабор - РегистрНакопленияНаборЗаписей.ЗапасыИПотребности - набор, из которого нужно взять незаписанные
//                                                                         в базу движения документа, а не из базы.
Процедура ВременнаяТаблицаЗакрытияГрафика(Запрос, ИмяТаблицы, УстановленныеБлокировки, ПодключаемыйНабор = Неопределено) Экспорт
	
	Заказы = УстановленныеБлокировки.Заказы;
	РегистраторыИЗаказы = УстановленныеБлокировки.РегистраторыИЗаказы;
	РегистраторЗаказа = Новый Соответствие();
	Для Каждого Строка Из РегистраторыИЗаказы Цикл
		РегистраторЗаказа.Вставить(Строка.Заказ, Строка.Регистратор);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Заказы", Заказы);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", Неопределено);
	
	ТекстДвижений =
		"ВЫБРАТЬ
		|	Движения.Период КАК Период,
		|	Движения.ВидДвижения КАК ВидДвижения,
		|	Движения.Номенклатура КАК Номенклатура,
		|	Движения.Характеристика КАК Характеристика,
		|	Движения.Склад КАК Склад,
		|	Движения.Назначение КАК Назначение,
		|	Движения.Заказ КАК Заказ,
		|	Движения.ДатаСобытия КАК ДатаСобытия,
		|	Движения.Поступит КАК Поступит,
		|	Движения.Заказано КАК Заказано,
		|	Движения.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
		|	Движения.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
		|	Движения.ОтложитьРезервирование КАК ОтложитьРезервирование,
		|	Движения.КОбеспечению КАК КОбеспечению,
		|	Движения.НеОбеспечивать КАК НеОбеспечивать,
		|	Движения.ЗаблокированоВНаличии КАК ЗаблокированоВНаличии,
		|	Движения.ЗаблокированоПоступит КАК ЗаблокированоПоступит,
		|	
			// Корреспонденция ресурсов ЗаблокированоВНаличии и ЗаблокированоПоступит с ресурсом КРазблокировке.
			// Ресурс КРазблокировке не закрывается напрямую, а закрывается через эти два ресурса.
			// Это накладывает ограничения на операции движения в модуле РаспределениеЗапасовДвижения.
			// КРазблокировке =
			//	ЗаблокированоВНаличии (с признаком ПодлежитРазблокировке)
			//	+ ЗаблокированоПоступит (с признаком ПодлежитРазблокировке)
		|	ВЫБОР
		|		КОГДА Движения.ПодлежитРазблокировке
		|			ТОГДА Движения.ЗаблокированоВНаличии
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗаблокированоВНаличииКРазблокировке,
		|	
		|	ВЫБОР
		|		КОГДА Движения.ПодлежитРазблокировке
		|			ТОГДА Движения.ЗаблокированоПоступит
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗаблокированоПоступитКРазблокировке,
		|	
		|	Движения.КРазблокировке КАК КРазблокировке,
		|
		|	Движения.РезервироватьНаСкладеИзЗаблокированных КАК РезервироватьНаСкладеИзЗаблокированных,
		|	Движения.РезервироватьПоМереПоступленияИзЗаблокированных КАК РезервироватьПоМереПоступленияИзЗаблокированных,
			// Для закрытия ресурса Заказано и Поступит.
		|	Движения.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления,
		|	
			// Для закрытия ресурса ЗаблокированоПоступит.
		|	ВЫБОР
		|		КОГДА Движения.ПроконтролироватьКачество
		|			ТОГДА Движения.ЗакрытьГрафикПоступления
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗакрытьГрафикПоступленияПроконтролироватьКачество,
		|	
			// Для закрытия ресурса КРазблокировке.
		|	ВЫБОР
		|		КОГДА Движения.ПодлежитРазблокировке
		|			ТОГДА Движения.ЗакрытьГрафикПоступления
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗакрытьГрафикПоступленияПодлежитРазблокировке,
		|	
			// Для закрытия ресурсов НеОбеспечивать, КОбеспечению, ОтложитьРезервирование, РезервироватьПоМереПоступления,
			// РезервироватьНаСкладе, РезервироватьНаСкладеИзЗаблокированных,РезервироватьНаСкладеИзЗаблокированных.
		|	Движения.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузки,
		|	Движения.Сторно КАК Сторно
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности КАК Движения
		|ГДЕ
		|	Движения.Заказ В(&Заказы)
		|		И НЕ Движения.Регистратор = &ИсключаемыйРегистратор
		|		И Движения.Активность
		|		И Движения.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись)";
	
	Если ПодключаемыйНабор <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("ПодключаемыйНабор", ПодключаемыйНабор.Выгрузить());
		Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ПодключаемыйНабор.Отбор.Регистратор.Значение);
		
		Тексты = Новый Массив();
		Тексты.Добавить(ТекстДвижений);
		
		ПозицияЗнака = СтрНайти(ТекстДвижений, "РегистрНакопления.ЗапасыИПотребности");
		ПозицияЗнака = СтрНайти(ТекстДвижений, "ГДЕ", , ПозицияЗнака);
		Текст = Лев(ТекстДвижений, ПозицияЗнака - 1);
		Текст = СтрЗаменить(Текст, "РегистрНакопления.ЗапасыИПотребности", "ПодключаемыйНабор");
		
		Тексты.Добавить(Текст);
		ТекстДвижений = СтрСоединить(Тексты, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
		
		ТекстВременнойТаблицы =
			"ВЫБРАТЬ
			|	Набор.Период КАК Период,
			|	Набор.ВидДвижения КАК ВидДвижения,
			|	Набор.Номенклатура КАК Номенклатура,
			|	Набор.Характеристика КАК Характеристика,
			|	Набор.Склад КАК Склад,
			|	Набор.Назначение КАК Назначение,
			|	Набор.Заказ КАК Заказ,
			|	Набор.ДатаСобытия КАК ДатаСобытия,
			|	Набор.Поступит КАК Поступит,
			|	Набор.Заказано КАК Заказано,
			|	Набор.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
			|	Набор.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
			|	Набор.ОтложитьРезервирование КАК ОтложитьРезервирование,
			|	Набор.КОбеспечению КАК КОбеспечению,
			|	Набор.НеОбеспечивать КАК НеОбеспечивать,
			|	Набор.ЗаблокированоПоступит КАК ЗаблокированоПоступит,
			|	Набор.ЗаблокированоВНаличии КАК ЗаблокированоВНаличии,
			|	Набор.КРазблокировке КАК КРазблокировке,
			|	Набор.РезервироватьНаСкладеИзЗаблокированных КАК РезервироватьНаСкладеИзЗаблокированных,
			|	Набор.РезервироватьПоМереПоступленияИзЗаблокированных КАК РезервироватьПоМереПоступленияИзЗаблокированных,
			|	Набор.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления,
			|	Набор.ПроконтролироватьКачество КАК ПроконтролироватьКачество,
			|	Набор.ПодлежитРазблокировке КАК ПодлежитРазблокировке,
			|	Набор.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузки,
			|	Набор.Сторно КАК Сторно
			|ПОМЕСТИТЬ ПодключаемыйНабор
			|ИЗ
			|	&ПодключаемыйНабор КАК Набор
			|ГДЕ
			|	Набор.Активность
			|		И Набор.Заказ В(&Заказы)
			|		И Набор.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись)";
		
	КонецЕсли;
	
	ТекстДвижений = СтрШаблон("(%1)", ТекстДвижений);
	Текст =
		"ВЫБРАТЬ
		|	МИНИМУМ(Движения.Период) КАК Период,
		|	Движения.Номенклатура КАК Номенклатура,
		|	Движения.Характеристика КАК Характеристика,
		|	Движения.Склад КАК Склад,
		|	Движения.Назначение КАК Назначение,
		|	Движения.Заказ КАК Заказ,
		|	Движения.ДатаСобытия КАК ДатаСобытия,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.Поступит
		|			ИНАЧЕ -Движения.Поступит
		|		КОНЕЦ) КАК Поступит,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.Заказано
		|			ИНАЧЕ -Движения.Заказано
		|		КОНЕЦ) КАК Заказано,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.РезервироватьНаСкладе
		|			ИНАЧЕ -Движения.РезервироватьНаСкладе
		|		КОНЕЦ) КАК РезервироватьНаСкладе,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.РезервироватьПоМереПоступления
		|			ИНАЧЕ -Движения.РезервироватьПоМереПоступления
		|		КОНЕЦ) КАК РезервироватьПоМереПоступления,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.ОтложитьРезервирование
		|			ИНАЧЕ -Движения.ОтложитьРезервирование
		|		КОНЕЦ) КАК ОтложитьРезервирование,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.КОбеспечению
		|			ИНАЧЕ -Движения.КОбеспечению
		|		КОНЕЦ) КАК КОбеспечению,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.НеОбеспечивать
		|			ИНАЧЕ -Движения.НеОбеспечивать
		|		КОНЕЦ) КАК НеОбеспечивать,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.ЗаблокированоВНаличии
		|			ИНАЧЕ -Движения.ЗаблокированоВНаличии
		|		КОНЕЦ) КАК ЗаблокированоВНаличии,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.ЗаблокированоПоступит
		|			ИНАЧЕ -Движения.ЗаблокированоПоступит
		|		КОНЕЦ) КАК ЗаблокированоПоступит,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.ЗаблокированоВНаличииКРазблокировке
		|			ИНАЧЕ -Движения.ЗаблокированоВНаличииКРазблокировке
		|		КОНЕЦ) КАК ЗаблокированоВНаличииКРазблокировке,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.ЗаблокированоПоступитКРазблокировке
		|			ИНАЧЕ -Движения.ЗаблокированоПоступитКРазблокировке
		|		КОНЕЦ) КАК ЗаблокированоПоступитКРазблокировке,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА Движения.ЗаблокированоВНаличии
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И Движения.ЗаблокированоВНаличии < 0
		|				ТОГДА -Движения.ЗаблокированоВНаличии
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|			+ ВЫБОР
		// В типовых операциях проведения не бывает отрицательного прихода по ресурсу КРазблокировке,
		// кроме исправительного документа, в котором движения формируются техническим сторнированием. На это количество остаток по ресурсу
		// КРазблокировке закроется автоматически платформенным вычислением остатка с учетом измерения дата события. Нужно уменьшить величину,
		// на которое собираемся закрывать ресурс КРазблокировке.
		|				КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И Движения.КРазблокировке < 0
		|					ТОГДА Движения.КРазблокировке
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК ЗаблокированоВНаличииРасход,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.КРазблокировке
		|			ИНАЧЕ -Движения.КРазблокировке
		|		КОНЕЦ) КАК КРазблокировке,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.РезервироватьНаСкладеИзЗаблокированных
		|			ИНАЧЕ -Движения.РезервироватьНаСкладеИзЗаблокированных
		|		КОНЕЦ) КАК РезервироватьНаСкладеИзЗаблокированных,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.РезервироватьПоМереПоступленияИзЗаблокированных
		|			ИНАЧЕ -Движения.РезервироватьПоМереПоступленияИзЗаблокированных
		|		КОНЕЦ) КАК РезервироватьПоМереПоступленияИзЗаблокированных,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.ЗакрытьГрафикПоступления
		|			ИНАЧЕ -Движения.ЗакрытьГрафикПоступления
		|		КОНЕЦ) КАК ЗакрытьГрафикПоступления,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.ЗакрытьГрафикПоступленияПроконтролироватьКачество
		|			ИНАЧЕ -Движения.ЗакрытьГрафикПоступленияПроконтролироватьКачество
		|		КОНЕЦ) КАК ЗакрытьГрафикПоступленияПроконтролироватьКачество,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.ЗакрытьГрафикПоступленияПодлежитРазблокировке
		|			ИНАЧЕ -Движения.ЗакрытьГрафикПоступленияПодлежитРазблокировке
		|		КОНЕЦ) КАК ЗакрытьГрафикПоступленияПодлежитРазблокировке,
		|	СУММА(
		|		ВЫБОР
		|			КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА Движения.ЗакрытьГрафикОтгрузки
		|			ИНАЧЕ -Движения.ЗакрытьГрафикОтгрузки
		|		КОНЕЦ) КАК ЗакрытьГрафикОтгрузки
		|ПОМЕСТИТЬ ОборотыГрафика
		|ИЗ
		|	НаборПереопределяемый КАК Движения
		|СГРУППИРОВАТЬ ПО
		|	Движения.Номенклатура,
		|	Движения.Характеристика,
		|	Движения.Склад,
		|	Движения.Назначение,
		|	Движения.Заказ,
		|	Движения.ДатаСобытия
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, Заказ
		|;
		|
		|//////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Движения.Номенклатура КАК Номенклатура,
		|	Движения.Характеристика КАК Характеристика,
		|	Движения.Склад КАК Склад,
		|	Движения.Назначение КАК Назначение,
		|	Движения.Заказ КАК Заказ,
		|	СУММА(Движения.ЗакрытьГрафикОтгрузки) КАК ЗакрытьГрафикОтгрузки,
		|	СУММА(Движения.ЗакрытьГрафикПоступления) КАК ЗакрытьГрафикПоступления,
		|	СУММА(Движения.ЗакрытьГрафикПоступленияПодлежитРазблокировке) КАК ЗакрытьГрафикПоступленияПодлежитРазблокировке,
		|
			// Для первой итерации закрытия графика по ресурсу ЗаблокированоПоступит.
			// когда в записях закрытия признак ПроконтролироватьКачество установлен.
		|	СУММА(Движения.ЗакрытьГрафикПоступленияПроконтролироватьКачество) КАК ЗакрытьГрафикПоступленияПроконтролироватьКачество,
		|
			// Для второй итерации закрытия графика по ресурсу ЗаблокированоПоступит, 
			// когда в записях закрытия признак ПроконтролироватьКачество не установлен.
		|	ВЫБОР
				// Остаток ЗаблокированоПоступит > Остаток Поступит.
		|		КОГДА СУММА(Движения.ЗаблокированоПоступит) - СУММА(Движения.ЗакрытьГрафикПоступленияПроконтролироватьКачество) > 0
		|				И СУММА(Движения.ЗаблокированоПоступит) - СУММА(Движения.ЗакрытьГрафикПоступленияПроконтролироватьКачество)
		|					> СУММА(Движения.Поступит) - СУММА(Движения.ЗакрытьГрафикПоступления)
		|				ТОГДА
		|					ВЫБОР
		|						КОГДА СУММА(Движения.Поступит) - СУММА(Движения.ЗакрытьГрафикПоступления) > 0
									// Закрыть на разницу ЗаблокированоПоступит - Поступит.
		|							ТОГДА
		|								СУММА(Движения.ЗаблокированоПоступит) - СУММА(Движения.ЗакрытьГрафикПоступленияПроконтролироватьКачество)
		|									- (СУММА(Движения.Поступит) - СУММА(Движения.ЗакрытьГрафикПоступления))
								// Закрыть ЗаблокированоПоступит целиком.
		|						ИНАЧЕ
		|							СУММА(Движения.ЗаблокированоПоступит) - СУММА(Движения.ЗакрытьГрафикПоступленияПроконтролироватьКачество)
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ ЗакрытьГрафикПоступленияНеПроконтролироватьКачество,
		|	
			// Исходное количество ЗаблокированоПоступит,ЗаблокированоВНаличииКРазблокировке,ЗаблокированоПоступитКРазблокировке
			// сводно, без учета дат поступления.
		|	СУММА(Движения.ЗаблокированоПоступит) ЗаблокированоПоступитПриход,
		|	СУММА(Движения.ЗаблокированоВНаличииКРазблокировке) КАК ЗаблокированоВНаличииКРазблокировкеПриход,
		|	СУММА(Движения.ЗаблокированоПоступитКРазблокировке) КАК ЗаблокированоПоступитКРазблокировкеПриход,
		|	
		|	СУММА(Движения.ЗаблокированоВНаличииРасход) КАК ЗаблокированоВНаличииРасход
		|ПОМЕСТИТЬ ОстаткиГрафика
		|ИЗ
		|	ОборотыГрафика КАК Движения
		|СГРУППИРОВАТЬ ПО
		|	Движения.Номенклатура,
		|	Движения.Характеристика,
		|	Движения.Склад,
		|	Движения.Назначение,
		|	Движения.Заказ
		|ИМЕЮЩИЕ
		|	СУММА(Движения.ЗакрытьГрафикПоступления) > 0
		|		ИЛИ СУММА(Движения.ЗакрытьГрафикОтгрузки) > 0
		|		ИЛИ СУММА(Движения.ЗакрытьГрафикПоступленияПроконтролироватьКачество) > 0
		|		ИЛИ СУММА(Движения.ЗакрытьГрафикПоступленияПодлежитРазблокировке) > 0
		|		ИЛИ СУММА(Движения.ЗаблокированоВНаличииРасход) > 0
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад, Назначение, Заказ
		|;
		|
		|//////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборотыГрафика.Период КАК Период,
		|	ОстаткиГрафика.Номенклатура КАК Номенклатура,
		|	ОстаткиГрафика.Характеристика КАК Характеристика,
		|	ОстаткиГрафика.Склад КАК Склад,
		|	ОстаткиГрафика.Назначение КАК Назначение,
		|	ОстаткиГрафика.Заказ КАК Заказ,
		|	ОборотыГрафика.ДатаСобытия КАК ДатаСобытия,
		|	ВЫБОР
		|		КОГДА ОборотыГрафика.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1) И ОборотыГрафика.Заказано > 0
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПорядокДляОжидаемыхПоступлений,
		|	
			// Для закрытия ресурсов НеОбеспечивать, КОбеспечению, ОтложитьРезервирование, РезервироватьПоМереПоступления,
			// РезервироватьНаСкладе, РезервироватьНаСкладеИзЗаблокированных,РезервироватьНаСкладеИзЗаблокированных.
		|	ОстаткиГрафика.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузки,
		|
			// Для закрытия ресурса Заказано.
		|	ОстаткиГрафика.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступленияЗаказано,
		|
			// Для закрытия ресурса ЗаблокированоПоступит.
		|	ОстаткиГрафика.ЗакрытьГрафикПоступленияПроконтролироватьКачество
		|		+ ОстаткиГрафика.ЗакрытьГрафикПоступленияНеПроконтролироватьКачество КАК ЗакрытьГрафикПоступленияЗаблокированоПоступит,
		|	
			// Для закрытия ресурса Поступит.
		|	ОстаткиГрафика.ЗакрытьГрафикПоступления
				// Уменьшить закрытие, так как алгоритм закрытия работает так:
				// Поступит - закрытие ЗаблокированоПоступит - ЗакрытьГрафикПоступления
		|		- ВЫБОР
		|			КОГДА ОстаткиГрафика.ЗаблокированоПоступитПриход
		|					- ОстаткиГрафика.ЗакрытьГрафикПоступленияПроконтролироватьКачество
		|					- ОстаткиГрафика.ЗакрытьГрафикПоступленияНеПроконтролироватьКачество > 0
		|				ТОГДА ОстаткиГрафика.ЗакрытьГрафикПоступленияПроконтролироватьКачество
		|						+ ОстаткиГрафика.ЗакрытьГрафикПоступленияНеПроконтролироватьКачество
		|			ИНАЧЕ ОстаткиГрафика.ЗаблокированоПоступитПриход
		|		КОНЕЦ КАК ЗакрытьГрафикПоступленияПоступит,
		|	
			// Для закрытия ресурса КРазблокировке.
			// Первая итерация для партий непоступившего товара: закрытие ЗаблокированоПоступитКРазблокировке по записям
			// с установленным признаком ПодлежитРазблокировке:
		|	ВЫБОР
		|		КОГДА ОстаткиГрафика.ЗаблокированоПоступитКРазблокировкеПриход < 0
		|				ИЛИ ОстаткиГрафика.ЗаблокированоПоступитКРазблокировкеПриход < 0
		|			ТОГДА 0
		|		КОГДА ОстаткиГрафика.ЗакрытьГрафикПоступленияПодлежитРазблокировке
		|				< ОстаткиГрафика.ЗаблокированоПоступитКРазблокировкеПриход
		|			ТОГДА ОстаткиГрафика.ЗакрытьГрафикПоступленияПодлежитРазблокировке
		|		ИНАЧЕ ОстаткиГрафика.ЗаблокированоПоступитКРазблокировкеПриход
		|	КОНЕЦ
			// Вторая итерация для партий непоступившего товара: закрытие ЗаблокированоПоступитКРазблокировке по записям
			// с не установленным признаком ПодлежитРазблокировке:
			// Увеличить закрытие, иначе график разблокировки превысит график поступления заблокированного товара.
		|	+ ВЫБОР
				// Остаток КРазблокировке <= 0
		|		КОГДА ОстаткиГрафика.ЗаблокированоПоступитКРазблокировкеПриход - ОстаткиГрафика.ЗакрытьГрафикПоступленияПодлежитРазблокировке < 0
		|				ИЛИ ОстаткиГрафика.ЗаблокированоПоступитКРазблокировкеПриход < 0
		|			ТОГДА 0
				// Остаток КРазблокировке > Остаток ЗаблокированоПоступит
		|		КОГДА ОстаткиГрафика.ЗаблокированоПоступитКРазблокировкеПриход - ОстаткиГрафика.ЗакрытьГрафикПоступленияПодлежитРазблокировке >
		|				ОстаткиГрафика.ЗаблокированоПоступитПриход
		|					- ОстаткиГрафика.ЗакрытьГрафикПоступленияПроконтролироватьКачество
		|					- ОстаткиГрафика.ЗакрытьГрафикПоступленияНеПроконтролироватьКачество
		|			ТОГДА
		|				ВЫБОР
		|					КОГДА
		|							ОстаткиГрафика.ЗаблокированоПоступитПриход
		|								- ОстаткиГрафика.ЗакрытьГрафикПоступленияПроконтролироватьКачество
		|								- ОстаткиГрафика.ЗакрытьГрафикПоступленияНеПроконтролироватьКачество > 0
		|						ТОГДА
									// Закрыть на разницу КРазблокировке - ЗаблокированоПоступит.
		|							 ОстаткиГрафика.ЗаблокированоПоступитКРазблокировкеПриход
		|									- ОстаткиГрафика.ЗакрытьГрафикПоступленияПодлежитРазблокировке
		|								- (ОстаткиГрафика.ЗаблокированоПоступитПриход
		|									- ОстаткиГрафика.ЗакрытьГрафикПоступленияПроконтролироватьКачество
		|									- ОстаткиГрафика.ЗакрытьГрафикПоступленияНеПроконтролироватьКачество)
		|					ИНАЧЕ
								// Закрыть КРазблокировке целиком.
		|						ОстаткиГрафика.ЗаблокированоПоступитКРазблокировкеПриход
		|							- ОстаткиГрафика.ЗакрытьГрафикПоступленияПодлежитРазблокировке
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ
		// Первая итерация для партий поступившего товара: закрытие ЗаблокированоВНаличииКРазблокировке по записям расхода
		// со склада товара партии. 
		|	+ ВЫБОР
		|		КОГДА ОстаткиГрафика.ЗаблокированоВНаличииРасход < 0 ИЛИ ОстаткиГрафика.ЗаблокированоВНаличииКРазблокировкеПриход < 0
		|			ТОГДА 0
		|		КОГДА ОстаткиГрафика.ЗаблокированоВНаличииРасход < ОстаткиГрафика.ЗаблокированоВНаличииКРазблокировкеПриход
		|			ТОГДА ОстаткиГрафика.ЗаблокированоВНаличииРасход
		|		ИНАЧЕ ОстаткиГрафика.ЗаблокированоВНаличииКРазблокировкеПриход
		|	КОНЕЦ КАК ЗакрытьГрафикРазблокировки,
		|	ВЫБОР
		|		КОГДА ОборотыГрафика.Поступит < 0
		|			ТОГДА 0
		|		ИНАЧЕ ОборотыГрафика.Поступит
		|	КОНЕЦ КАК Поступит,
		|	ВЫБОР
		|		КОГДА ОборотыГрафика.Заказано < 0
		|			ТОГДА 0
		|		ИНАЧЕ ОборотыГрафика.Заказано
		|	КОНЕЦ КАК Заказано,
		|	ВЫБОР
		|		КОГДА ОборотыГрафика.РезервироватьНаСкладе < 0
		|			ТОГДА 0
		|		ИНАЧЕ ОборотыГрафика.РезервироватьНаСкладе
		|	КОНЕЦ КАК РезервироватьНаСкладе,
		|	ВЫБОР
		|		КОГДА ОборотыГрафика.РезервироватьПоМереПоступления < 0
		|			ТОГДА 0
		|		ИНАЧЕ ОборотыГрафика.РезервироватьПоМереПоступления
		|	КОНЕЦ КАК РезервироватьПоМереПоступления,
		|	ВЫБОР
		|		КОГДА ОборотыГрафика.ОтложитьРезервирование < 0
		|			ТОГДА 0
		|		ИНАЧЕ ОборотыГрафика.ОтложитьРезервирование
		|	КОНЕЦ КАК ОтложитьРезервирование,
		|	ВЫБОР
		|		КОГДА ОборотыГрафика.КОбеспечению < 0
		|			ТОГДА 0
		|		ИНАЧЕ ОборотыГрафика.КОбеспечению
		|	КОНЕЦ КАК КОбеспечению,
		|	ВЫБОР
		|		КОГДА ОборотыГрафика.НеОбеспечивать < 0
		|			ТОГДА 0
		|		ИНАЧЕ ОборотыГрафика.НеОбеспечивать
		|	КОНЕЦ КАК НеОбеспечивать,
		|	ВЫБОР
		|		КОГДА ОборотыГрафика.ЗаблокированоПоступит < 0
		|			ТОГДА 0
		|		ИНАЧЕ ОборотыГрафика.ЗаблокированоПоступит
		|	КОНЕЦ КАК ЗаблокированоПоступит,
		|	ВЫБОР
		|		КОГДА ОборотыГрафика.КРазблокировке < 0
		|			ТОГДА 0
		|		ИНАЧЕ ОборотыГрафика.КРазблокировке
		|	КОНЕЦ КАК КРазблокировке,
		|	ВЫБОР
		|		КОГДА ОборотыГрафика.РезервироватьНаСкладеИзЗаблокированных < 0
		|			ТОГДА 0
		|		ИНАЧЕ ОборотыГрафика.РезервироватьНаСкладеИзЗаблокированных
		|	КОНЕЦ КАК РезервироватьНаСкладеИзЗаблокированных,
		|	ВЫБОР
		|		КОГДА ОборотыГрафика.РезервироватьПоМереПоступленияИзЗаблокированных < 0
		|			ТОГДА 0
		|		ИНАЧЕ ОборотыГрафика.РезервироватьПоМереПоступленияИзЗаблокированных
		|	КОНЕЦ КАК РезервироватьПоМереПоступленияИзЗаблокированных
		|ИЗ
		|	ОстаткиГрафика КАК ОстаткиГрафика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОборотыГрафика КАК ОборотыГрафика
		|		ПО ОборотыГрафика.Номенклатура = ОстаткиГрафика.Номенклатура
		|		 И ОборотыГрафика.Характеристика = ОстаткиГрафика.Характеристика
		|		 И ОборотыГрафика.Склад = ОстаткиГрафика.Склад
		|		 И ОборотыГрафика.Назначение = ОстаткиГрафика.Назначение
		|		 И ОборотыГрафика.Заказ = ОстаткиГрафика.Заказ
		|		 И (ОборотыГрафика.Заказано > 0 И ОстаткиГрафика.ЗакрытьГрафикПоступления > 0
		|				ИЛИ ОборотыГрафика.Поступит > 0 И ОстаткиГрафика.ЗакрытьГрафикПоступления > 0
		|				ИЛИ ОборотыГрафика.Поступит > 0 И ОстаткиГрафика.ЗакрытьГрафикПоступленияПроконтролироватьКачество > 0
		|				ИЛИ ОборотыГрафика.ЗаблокированоПоступит > 0 И ОстаткиГрафика.ЗакрытьГрафикПоступленияПроконтролироватьКачество > 0
		|				ИЛИ ОборотыГрафика.ЗаблокированоПоступит > 0 И ОстаткиГрафика.ЗакрытьГрафикПоступленияНеПроконтролироватьКачество > 0
		|				ИЛИ ОборотыГрафика.КРазблокировке > 0 И ОстаткиГрафика.ЗакрытьГрафикПоступленияПодлежитРазблокировке > 0
		|				ИЛИ ОборотыГрафика.КРазблокировке > 0 И ОстаткиГрафика.ЗакрытьГрафикПоступленияПроконтролироватьКачество > 0
		|				ИЛИ ОборотыГрафика.КРазблокировке > 0 И ОстаткиГрафика.ЗакрытьГрафикПоступленияНеПроконтролироватьКачество > 0
		|				ИЛИ ОборотыГрафика.КРазблокировке > 0 И ОстаткиГрафика.ЗаблокированоВНаличииКРазблокировкеПриход > 0 И ОстаткиГрафика.ЗаблокированоВНаличииРасход > 0
		|				ИЛИ ОборотыГрафика.РезервироватьНаСкладе > 0 И ОстаткиГрафика.ЗакрытьГрафикОтгрузки > 0
		|				ИЛИ ОборотыГрафика.РезервироватьПоМереПоступления > 0 И ОстаткиГрафика.ЗакрытьГрафикОтгрузки > 0
		|				ИЛИ ОборотыГрафика.РезервироватьНаСкладеИзЗаблокированных > 0 И ОстаткиГрафика.ЗакрытьГрафикОтгрузки > 0
		|				ИЛИ ОборотыГрафика.РезервироватьПоМереПоступленияИзЗаблокированных > 0 И ОстаткиГрафика.ЗакрытьГрафикОтгрузки > 0
		|				ИЛИ ОборотыГрафика.ОтложитьРезервирование > 0 И ОстаткиГрафика.ЗакрытьГрафикОтгрузки > 0
		|				ИЛИ ОборотыГрафика.КОбеспечению > 0 И ОстаткиГрафика.ЗакрытьГрафикОтгрузки > 0
		|				ИЛИ ОборотыГрафика.НеОбеспечивать > 0 И ОстаткиГрафика.ЗакрытьГрафикОтгрузки > 0)
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Склад,
		|	Назначение,
		|	Заказ,
		|	ПорядокДляОжидаемыхПоступлений,
		|	ДатаСобытия,
		|	Период,
		|	Поступит УБЫВ,
		|	РезервироватьНаСкладе УБЫВ,
		|	РезервироватьПоМереПоступления УБЫВ,
		|	РезервироватьНаСкладеИзЗаблокированных УБЫВ,
		|	РезервироватьПоМереПоступленияИзЗаблокированных УБЫВ,
		|	ОтложитьРезервирование УБЫВ,
		|	КОбеспечению УБЫВ,
		|	НеОбеспечивать УБЫВ
		|;
		|
		|/////////////////////////
		|УНИЧТОЖИТЬ ОстаткиГрафика;
		|УНИЧТОЖИТЬ ОборотыГрафика";
	
	СмещениеВПакете = 3;
	Текст = СтрЗаменить(Текст, "НаборПереопределяемый", ТекстДвижений);
	Если ПодключаемыйНабор <> Неопределено Тогда
		
		Тексты = Новый Массив();
		Тексты.Добавить(ТекстВременнойТаблицы);
		Тексты.Добавить(Текст);
		Тексты.Добавить("УНИЧТОЖИТЬ ПодключаемыйНабор");
		Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
		
		СмещениеВПакете = СмещениеВПакете + 1;
		
	КонецЕсли;
		
	Запрос.Текст = Текст;
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	График = ПакетРезультатов[ПакетРезультатов.Количество() - СмещениеВПакете].Выгрузить(); // ТаблицаЗначений -
	График.Колонки.Добавить("ЕстьГрафик", Новый ОписаниеТипов("Булево"));
	График.Колонки.Добавить("Регистратор",
		Метаданные.РегистрыНакопления.ЗапасыИПотребности.СтандартныеРеквизиты.Регистратор.Тип);
	
	Номенклатура = Неопределено;
	Характеристика = Неопределено;
	Склад = Неопределено;
	Назначение = Неопределено;
	Заказ = Неопределено;
	
	Для Индекс = 0 По График.Количество() - 1 Цикл
		
		ТекСтрока = График[Индекс];
		Если ТекСтрока.Номенклатура <> Номенклатура
				Или ТекСтрока.Характеристика <> Характеристика
				Или ТекСтрока.Склад <> Склад
				Или ТекСтрока.Назначение <> Назначение
				Или ТекСтрока.Заказ <> Заказ Тогда
				
				Номенклатура = ТекСтрока.Номенклатура;
				Характеристика = ТекСтрока.Характеристика;
				Склад = ТекСтрока.Склад;
				Назначение = ТекСтрока.Назначение;
				Заказ = ТекСтрока.Заказ;
				ЗакрытьГрафикПоступленияЗаказано = Макс(ТекСтрока.ЗакрытьГрафикПоступленияЗаказано, 0);
				ЗакрытьГрафикПоступленияПоступит = Макс(ТекСтрока.ЗакрытьГрафикПоступленияПоступит, 0); // здесь количество, которое нужно закрыть дополнительно к ЗакрытьГрафикПоступленияЗаблокированоПоступит
				ЗакрытьГрафикПоступленияЗаблокированоПоступит = Макс(ТекСтрока.ЗакрытьГрафикПоступленияЗаблокированоПоступит, 0);
				ЗакрытьГрафикРазблокировки = Макс(ТекСтрока.ЗакрытьГрафикРазблокировки, 0);
				ЗакрытьГрафикОтгрузки = Макс(ТекСтрока.ЗакрытьГрафикОтгрузки, 0);
		КонецЕсли;
		
		ЗаблокированоПоступит = Мин(ТекСтрока.ЗаблокированоПоступит, ЗакрытьГрафикПоступленияЗаблокированоПоступит);
		ЗакрытьГрафикПоступленияЗаблокированоПоступит = ЗакрытьГрафикПоступленияЗаблокированоПоступит - ЗаблокированоПоступит;
		ТекСтрока.ЗаблокированоПоступит = -ЗаблокированоПоступит;
		
		ПоступитЗаблокировано = Мин(ТекСтрока.Поступит, ЗаблокированоПоступит);
		
		Поступит = Мин(ТекСтрока.Поступит - ПоступитЗаблокировано, ЗакрытьГрафикПоступленияПоступит);
		ЗакрытьГрафикПоступленияПоступит = ЗакрытьГрафикПоступленияПоступит - Поступит;
		ТекСтрока.Поступит = - Поступит - ПоступитЗаблокировано;
		
		ЗаказаноПоступит = Мин(ТекСтрока.Заказано, Поступит + ПоступитЗаблокировано);
		ЗакрытьГрафикПоступленияЗаказано = ЗакрытьГрафикПоступленияЗаказано - ЗаказаноПоступит;
		
		Заказано = Мин(ТекСтрока.Заказано - ЗаказаноПоступит, ЗакрытьГрафикПоступленияЗаказано);
		ЗакрытьГрафикПоступленияЗаказано = ЗакрытьГрафикПоступленияЗаказано - Заказано;
		ТекСтрока.Заказано = - Заказано - ЗаказаноПоступит;
		
		КРазблокировке = Мин(ТекСтрока.КРазблокировке, ЗакрытьГрафикРазблокировки);
		ЗакрытьГрафикРазблокировки = ЗакрытьГрафикРазблокировки - КРазблокировке;
		ТекСтрока.КРазблокировке = - КРазблокировке;
		
		Потребность = Мин(ТекСтрока.РезервироватьНаСкладе, ЗакрытьГрафикОтгрузки);
		ЗакрытьГрафикОтгрузки = ЗакрытьГрафикОтгрузки - Потребность;
		ТекСтрока.РезервироватьНаСкладе = - Потребность;
		
		Потребность = Мин(ТекСтрока.РезервироватьПоМереПоступления, ЗакрытьГрафикОтгрузки);
		ЗакрытьГрафикОтгрузки = ЗакрытьГрафикОтгрузки - Потребность;
		ТекСтрока.РезервироватьПоМереПоступления = - Потребность;
		
		Потребность = Мин(ТекСтрока.РезервироватьНаСкладеИзЗаблокированных, ЗакрытьГрафикОтгрузки);
		ЗакрытьГрафикОтгрузки = ЗакрытьГрафикОтгрузки - Потребность;
		ТекСтрока.РезервироватьНаСкладеИзЗаблокированных = - Потребность;
		
		Потребность = Мин(ТекСтрока.РезервироватьПоМереПоступленияИзЗаблокированных, ЗакрытьГрафикОтгрузки);
		ЗакрытьГрафикОтгрузки = ЗакрытьГрафикОтгрузки - Потребность;
		ТекСтрока.РезервироватьПоМереПоступленияИзЗаблокированных = - Потребность;
		
		Потребность = Мин(ТекСтрока.ОтложитьРезервирование, ЗакрытьГрафикОтгрузки);
		ЗакрытьГрафикОтгрузки = ЗакрытьГрафикОтгрузки - Потребность;
		ТекСтрока.ОтложитьРезервирование = - Потребность;
		
		Потребность = Мин(ТекСтрока.КОбеспечению, ЗакрытьГрафикОтгрузки);
		ЗакрытьГрафикОтгрузки = ЗакрытьГрафикОтгрузки - Потребность;
		ТекСтрока.КОбеспечению = - Потребность;
		
		Потребность = Мин(ТекСтрока.НеОбеспечивать, ЗакрытьГрафикОтгрузки);
		ЗакрытьГрафикОтгрузки = ЗакрытьГрафикОтгрузки - Потребность;
		ТекСтрока.НеОбеспечивать = - Потребность;
		
		ТекСтрока.Регистратор = РегистраторЗаказа.Получить(ТекСтрока.Заказ);
		ТекСтрока.ЕстьГрафик = ТекСтрока.Поступит < 0
			Или ТекСтрока.Заказано < 0
			Или ТекСтрока.РезервироватьНаСкладе < 0
			Или ТекСтрока.РезервироватьПоМереПоступления < 0
			Или ТекСтрока.ЗаблокированоПоступит < 0
			Или ТекСтрока.КРазблокировке < 0
			Или ТекСтрока.РезервироватьНаСкладеИзЗаблокированных < 0
			Или ТекСтрока.РезервироватьПоМереПоступленияИзЗаблокированных < 0
			Или ТекСтрока.ОтложитьРезервирование < 0
			Или ТекСтрока.КОбеспечению < 0
			Или ТекСтрока.НеОбеспечивать < 0;
		
	КонецЦикла;
	Запрос.УстановитьПараметр("ТаблицаГрафикПоступления", График.Скопировать(Новый Структура("ЕстьГрафик", Истина)));
	Текст =
		"ВЫБРАТЬ
		|	График.Регистратор КАК Регистратор,
		|	График.Период КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ИСТИНА КАК Активность,
		|	График.Номенклатура КАК Номенклатура,
		|	График.Характеристика КАК Характеристика,
		|	График.Склад КАК Склад,
		|	График.Назначение КАК Назначение,
		|	График.Заказ КАК Заказ,
		|	График.ДатаСобытия КАК ДатаСобытия,
		|	0 КАК ВНаличии,
		|	График.Поступит КАК Поступит,
		|	График.Заказано КАК Заказано,
		|	График.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
		|	График.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
		|	График.ОтложитьРезервирование КАК ОтложитьРезервирование,
		|	График.КОбеспечению КАК КОбеспечению,
		|	График.НеОбеспечивать КАК НеОбеспечивать,
		|	0 КАК ЗаблокированоВНаличии,
		|	График.ЗаблокированоПоступит КАК ЗаблокированоПоступит,
		|	График.КРазблокировке КАК КРазблокировке,
		|	График.РезервироватьНаСкладеИзЗаблокированных КАК РезервироватьНаСкладеИзЗаблокированных,
		|	График.РезервироватьПоМереПоступленияИзЗаблокированных КАК РезервироватьПоМереПоступленияИзЗаблокированных,
		|	ЛОЖЬ КАК ПроконтролироватьКачество,
		|	ЛОЖЬ КАК ПодлежитРазблокировке,
		|	0 КАК ЗакрытьГрафикПоступления,
		|	0 КАК ЗакрытьГрафикОтгрузки,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.РасчетГрафика) КАК ТипЗаписи,
		|	ЛОЖЬ КАК Сторно
		|ПОМЕСТИТЬ ТаблицаПереопределяемый
		|ИЗ
		|	&ТаблицаГрафикПоступления КАК График
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор";
	
	Запрос.Текст = СтрЗаменить(Текст, "ТаблицаПереопределяемый", ИмяТаблицы);
	Запрос.Выполнить();
	
КонецПроцедуры

// Параметры:
//  УстановленныеБлокировки - см. РегистрыНакопления.ЗапасыИПотребности.УстановитьБлокировкиЗаказовИТоваров
//  Запрос - Запрос -
//  ИсключаемыйРегистратор - ЛюбаяСсылка
Процедура ЗаписатьРезультатРасчетаГрафика(УстановленныеБлокировки, Запрос, ИсключаемыйРегистратор = Неопределено) Экспорт
	
	Регистраторы = УстановленныеБлокировки.РегистраторыИЗаказы.Скопировать();
	Регистраторы.Свернуть("Регистратор");
	Регистраторы = Регистраторы.ВыгрузитьКолонку("Регистратор");
	Элемент = Регистраторы.Найти(ИсключаемыйРегистратор);
	Если Элемент <> Неопределено Тогда
		Регистраторы.Удалить(Элемент);
	КонецЕсли;
	
	НаборЗаписейГрафик = СоздатьНаборЗаписей();
	НаборЗаписейГрафик.ОбменДанными.Загрузка = Истина;
	Для Каждого Регистратор Из Регистраторы Цикл
		
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Движения.Регистратор КАК Регистратор,
			|	Движения.Период КАК Период,
			|	Движения.ВидДвижения КАК ВидДвижения,
			|	Движения.Активность КАК Активность,
			|	Движения.Номенклатура КАК Номенклатура,
			|	Движения.Характеристика КАК Характеристика,
			|	Движения.Склад КАК Склад,
			|	Движения.Назначение КАК Назначение,
			|	Движения.Заказ КАК Заказ,
			|	Движения.ДатаСобытия КАК ДатаСобытия,
			|	Движения.ВНаличии КАК ВНаличии,
			|	Движения.Поступит КАК Поступит,
			|	Движения.Заказано КАК Заказано,
			|	Движения.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
			|	Движения.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
			|	Движения.ОтложитьРезервирование КАК ОтложитьРезервирование,
			|	Движения.КОбеспечению КАК КОбеспечению,
			|	Движения.НеОбеспечивать КАК НеОбеспечивать,
			|	Движения.ЗаблокированоВНаличии КАК ЗаблокированоВНаличии,
			|	Движения.ЗаблокированоПоступит КАК ЗаблокированоПоступит,
			|	Движения.КРазблокировке КАК КРазблокировке,
			|	Движения.РезервироватьНаСкладеИзЗаблокированных КАК РезервироватьНаСкладеИзЗаблокированных,
			|	Движения.РезервироватьПоМереПоступленияИзЗаблокированных КАК РезервироватьПоМереПоступленияИзЗаблокированных,
			|	Движения.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления,
			|	Движения.ПроконтролироватьКачество КАК ПроконтролироватьКачество,
			|	Движения.ПодлежитРазблокировке КАК ПодлежитРазблокировке,
			|	Движения.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузки,
			|	Движения.ОтгружаемыйЗаказ КАК ОтгружаемыйЗаказ,
			|	Движения.ТипЗаписи КАК ТипЗаписи,
			|	Движения.Сторно КАК Сторно
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности КАК Движения
			|ГДЕ
			|	Движения.Регистратор = &Регистратор
			|		И (Движения.ТипЗаписи В(
			|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись),
			|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ОтложенноеРезервирование))
			|			ИЛИ НЕ Движения.Заказ В(&Заказы))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РезультатыРасчета.Регистратор КАК Регистратор,
			|	РезультатыРасчета.Период КАК Период,
			|	РезультатыРасчета.ВидДвижения КАК ВидДвижения,
			|	РезультатыРасчета.Активность КАК Активность,
			|	РезультатыРасчета.Номенклатура КАК Номенклатура,
			|	РезультатыРасчета.Характеристика КАК Характеристика,
			|	РезультатыРасчета.Склад КАК Склад,
			|	РезультатыРасчета.Назначение КАК Назначение,
			|	РезультатыРасчета.Заказ КАК Заказ,
			|	РезультатыРасчета.ДатаСобытия КАК ДатаСобытия,
			|	РезультатыРасчета.ВНаличии КАК ВНаличии,
			|	РезультатыРасчета.Поступит КАК Поступит,
			|	РезультатыРасчета.Заказано КАК Заказано,
			|	РезультатыРасчета.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
			|	РезультатыРасчета.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
			|	РезультатыРасчета.ОтложитьРезервирование КАК ОтложитьРезервирование,
			|	РезультатыРасчета.КОбеспечению КАК КОбеспечению,
			|	РезультатыРасчета.НеОбеспечивать КАК НеОбеспечивать,
			|	РезультатыРасчета.ЗаблокированоВНаличии КАК ЗаблокированоВНаличии,
			|	РезультатыРасчета.ЗаблокированоПоступит КАК ЗаблокированоПоступит,
			|	РезультатыРасчета.КРазблокировке КАК КРазблокировке,
			|	РезультатыРасчета.РезервироватьНаСкладеИзЗаблокированных КАК РезервироватьНаСкладеИзЗаблокированных,
			|	РезультатыРасчета.РезервироватьПоМереПоступленияИзЗаблокированных КАК РезервироватьПоМереПоступленияИзЗаблокированных,
			|	РезультатыРасчета.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления,
			|	РезультатыРасчета.ПроконтролироватьКачество КАК ПроконтролироватьКачество,
			|	РезультатыРасчета.ПодлежитРазблокировке КАК ПодлежитРазблокировке,
			|	РезультатыРасчета.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузки,
			|	НЕОПРЕДЕЛЕНО КАК ОтгружаемыйЗаказ,
			|	РезультатыРасчета.ТипЗаписи КАК ТипЗаписи,
			|	РезультатыРасчета.Сторно КАК Сторно
			|ИЗ
			|	РезультатыРасчетаГрафика КАК РезультатыРасчета
			|ГДЕ
			|	РезультатыРасчета.Регистратор = &Регистратор";
			
		Таблица = Запрос.Выполнить().Выгрузить();
		НаборЗаписейГрафик.Отбор.Регистратор.Установить(Регистратор);
		НаборЗаписейГрафик.Загрузить(Таблица);
		НаборЗаписейГрафик.Записать();
		
	КонецЦикла

КонецПроцедуры

// Параметры:
//  Набор - РегистрНакопленияНаборЗаписей.ЗапасыИПотребности -
Процедура ДополнитьНаборЗаписямиОтложенногоОбеспечения(Набор) Экспорт
	
	Если Набор.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТаблицаТоваров", Набор.Выгрузить());
	Запрос.УстановитьПараметр("Регистратор", Набор[0].Регистратор);
	
	Тексты = Новый Массив();
	Текст =
		"ВЫБРАТЬ
		|	Движения.Регистратор КАК Регистратор,
		|	Движения.Период КАК Период,
		|	Движения.ВидДвижения КАК ВидДвижения,
		|	Движения.Номенклатура КАК Номенклатура,
		|	Движения.Характеристика КАК Характеристика,
		|	Движения.Склад КАК Склад,
		|	Движения.Назначение КАК Назначение,
		|	Движения.Заказ КАК Заказ,
		|	Движения.ДатаСобытия КАК ДатаСобытия,
		|	Движения.ВНаличии КАК ВНаличии,
		|	Движения.Поступит КАК Поступит,
		|	Движения.Заказано КАК Заказано,
		|	Движения.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
		|	Движения.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
		|	Движения.ОтложитьРезервирование КАК ОтложитьРезервирование,
		|	Движения.КОбеспечению КАК КОбеспечению,
		|	Движения.НеОбеспечивать КАК НеОбеспечивать,
		|	Движения.ЗаблокированоВНаличии КАК ЗаблокированоВНаличии,
		|	Движения.ЗаблокированоПоступит КАК ЗаблокированоПоступит,
		|	Движения.КРазблокировке КАК КРазблокировке,
		|	Движения.РезервироватьНаСкладеИзЗаблокированных КАК РезервироватьНаСкладеИзЗаблокированных,
		|	Движения.РезервироватьПоМереПоступленияИзЗаблокированных КАК РезервироватьПоМереПоступленияИзЗаблокированных,
		|	Движения.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления,
		|	Движения.ПроконтролироватьКачество КАК ПроконтролироватьКачество,
		|	Движения.ПодлежитРазблокировке КАК ПодлежитРазблокировке,
		|	Движения.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузки
		|ПОМЕСТИТЬ ДвиженияПриЗаписи
		|ИЗ
		|	&ТаблицаТоваров КАК Движения";
	Тексты.Добавить(Текст);
	
	Если Набор.ДополнительныеСвойства.Свойство("АктуализацияОтложенногоОбеспечения") Тогда
		Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК ЕстьЗаписи
			|ПОМЕСТИТЬ ТребуетсяПересчет";
	Иначе
		Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК ЕстьЗаписи
			|ПОМЕСТИТЬ ТребуетсяПересчет
			|ИЗ(
			|	ВЫБРАТЬ
			|		Движения.Регистратор КАК Регистратор,
			|		Движения.Период КАК Период,
			|		Движения.ВидДвижения КАК ВидДвижения,
			|		Движения.Номенклатура КАК Номенклатура,
			|		Движения.Характеристика КАК Характеристика,
			|		Движения.Склад КАК Склад,
			|		Движения.Назначение КАК Назначение,
			|		Движения.Заказ КАК Заказ,
			|		Движения.ДатаСобытия КАК ДатаСобытия,
			|		Движения.ВНаличии КАК ВНаличии,
			|		Движения.Поступит КАК Поступит,
			|		Движения.Заказано КАК Заказано,
			|		Движения.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
			|		Движения.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
			|		Движения.ОтложитьРезервирование КАК ОтложитьРезервирование,
			|		Движения.КОбеспечению КАК КОбеспечению,
			|		Движения.НеОбеспечивать КАК НеОбеспечивать,
			|		Движения.ЗаблокированоВНаличии КАК ЗаблокированоВНаличии,
			|		Движения.ЗаблокированоПоступит КАК ЗаблокированоПоступит,
			|		Движения.КРазблокировке КАК КРазблокировке,
			|		Движения.РезервироватьНаСкладеИзЗаблокированных КАК РезервироватьНаСкладеИзЗаблокированных,
			|		Движения.РезервироватьПоМереПоступленияИзЗаблокированных КАК РезервироватьПоМереПоступленияИзЗаблокированных,
			|		Движения.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления,
			|		Движения.ПроконтролироватьКачество КАК ПроконтролироватьКачество,
			|		Движения.ПодлежитРазблокировке КАК ПодлежитРазблокировке,
			|		Движения.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузки
			|	ИЗ
			|		ДвиженияПриЗаписи КАК Движения
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Движения.Регистратор КАК Регистратор,
			|		Движения.Период КАК Период,
			|		Движения.ВидДвижения КАК ВидДвижения,
			|		Движения.Номенклатура КАК Номенклатура,
			|		Движения.Характеристика КАК Характеристика,
			|		Движения.Склад КАК Склад,
			|		Движения.Назначение КАК Назначение,
			|		Движения.Заказ КАК Заказ,
			|		Движения.ДатаСобытия КАК ДатаСобытия,
			|		-Движения.ВНаличии КАК ВНаличии,
			|		-Движения.Поступит КАК Поступит,
			|		-Движения.Заказано КАК Заказано,
			|		-Движения.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
			|		-Движения.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
			|		-Движения.ОтложитьРезервирование КАК ОтложитьРезервирование,
			|		-Движения.КОбеспечению КАК КОбеспечению,
			|		-Движения.НеОбеспечивать КАК НеОбеспечивать,
			|		-Движения.ЗаблокированоВНаличии КАК ЗаблокированоВНаличии,
			|		-Движения.ЗаблокированоПоступит КАК ЗаблокированоПоступит,
			|		-Движения.КРазблокировке КАК КРазблокировке,
			|		-Движения.РезервироватьНаСкладеИзЗаблокированных КАК РезервироватьНаСкладеИзЗаблокированных,
			|		-Движения.РезервироватьПоМереПоступленияИзЗаблокированных КАК РезервироватьПоМереПоступленияИзЗаблокированных,
			|		-Движения.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления,
			|		Движения.ПроконтролироватьКачество КАК ПроконтролироватьКачество,
			|		Движения.ПодлежитРазблокировке КАК ПодлежитРазблокировке,
			|		-Движения.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузки
			|	ИЗ
			|		РегистрНакопления.ЗапасыИПотребности КАК Движения
			|	ГДЕ
			|		Движения.Регистратор = &Регистратор
			|			И Движения.Активность
			|			И Движения.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись)) КАК Изменения
			|СГРУППИРОВАТЬ ПО
			|	Изменения.Регистратор,
			|	Изменения.Период,
			|	Изменения.ВидДвижения,
			|	Изменения.Номенклатура,
			|	Изменения.Характеристика,
			|	Изменения.Склад,
			|	Изменения.Назначение,
			|	Изменения.Заказ,
			|	Изменения.ДатаСобытия,
			|	Изменения.ПроконтролироватьКачество,
			|	Изменения.ПодлежитРазблокировке
			|ИМЕЮЩИЕ
			|	СУММА(Изменения.ВНаличии) <> 0
			|		ИЛИ СУММА(Изменения.Поступит) <> 0
			|		ИЛИ СУММА(Изменения.Заказано) <> 0
			|		ИЛИ СУММА(Изменения.РезервироватьНаСкладе) <> 0
			|		ИЛИ СУММА(Изменения.РезервироватьПоМереПоступления) <> 0
			|		ИЛИ СУММА(Изменения.ОтложитьРезервирование) <> 0
			|		ИЛИ СУММА(Изменения.КОбеспечению) <> 0
			|		ИЛИ СУММА(Изменения.НеОбеспечивать) <> 0
			|		ИЛИ СУММА(Изменения.ЗаблокированоВНаличии) <> 0
			|		ИЛИ СУММА(Изменения.ЗаблокированоПоступит) <> 0
			|		ИЛИ СУММА(Изменения.КРазблокировке) <> 0
			|		ИЛИ СУММА(Изменения.РезервироватьНаСкладеИзЗаблокированных) <> 0
			|		ИЛИ СУММА(Изменения.РезервироватьПоМереПоступленияИзЗаблокированных) <> 0
			|		ИЛИ СУММА(Изменения.ЗакрытьГрафикПоступления) <> 0
			|		ИЛИ СУММА(Изменения.ЗакрытьГрафикОтгрузки) <> 0";
	КонецЕсли;
	Тексты.Добавить(Текст);
	
	Текст =
		"ВЫБРАТЬ
		|	Движения.Регистратор КАК Регистратор,
		|	Движения.Период КАК Период,
		|	Движения.ВидДвижения КАК ВидДвижения,
		|	Движения.Номенклатура КАК Номенклатура,
		|	Движения.Характеристика КАК Характеристика,
		|	Движения.Склад КАК Склад,
		|	Движения.Назначение КАК Назначение,
		|	Движения.Заказ КАК Заказ,
		|	Движения.ДатаСобытия КАК ДатаСобытия,
		|	Движения.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления
		|ПОМЕСТИТЬ Строки
		|ИЗ
		|	ДвиженияПриЗаписи КАК Движения
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТребуетсяПересчет КАК ТребуетсяПересчет
		|		ПО ТребуетсяПересчет.ЕстьЗаписи
		|ГДЕ
		|	Движения.РезервироватьПоМереПоступления <> 0
		|		И Движения.ДатаСобытия > &НачалоТекущегоДня
		|		И НЕ ТребуетсяПересчет.ЕстьЗаписи ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Строки.Номенклатура КАК Номенклатура,
		|	Строки.Характеристика КАК Характеристика,
		|	Строки.Склад КАК Склад
		|ПОМЕСТИТЬ РазличныеТоварыБезНазначений
		|ИЗ
		|	Строки КАК Строки
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад";
		
	Тексты.Добавить(Текст);
	
	Текст = ОбеспечениеВДокументахСервер.ВременнаяТаблицаГраницыПериодаОбеспечения(
		"РазличныеТоварыБезНазначений", "&НачалоТекущегоДня");
	Тексты.Добавить(Текст);
	
	Текст =
		"ВЫБРАТЬ
		|	ТаблицаТоваров.Регистратор КАК Регистратор,
		|	ТаблицаТоваров.Период КАК Период,
		|	ТаблицаТоваров.ВидДвижения КАК ВидДвижения,
		|	ИСТИНА КАК Активность,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.Характеристика КАК Характеристика,
		|	ТаблицаТоваров.Склад КАК Склад,
		|	ТаблицаТоваров.Назначение КАК Назначение,
		|	ТаблицаТоваров.Заказ КАК Заказ,
		|	ТаблицаТоваров.ДатаСобытия КАК ДатаСобытия,
		|	0 КАК ВНаличии,
		|	0 КАК Поступит,
		|	0 КАК Заказано,
		|	0 КАК РезервироватьНаСкладе,
		|	-ТаблицаТоваров.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
		|	ТаблицаТоваров.РезервироватьПоМереПоступления КАК ОтложитьРезервирование,
		|	0 КАК КОбеспечению,
		|	0 КАК НеОбеспечивать,
		|	0 КАК ЗаблокированоВНаличии,
		|	0 КАК ЗаблокированоПоступит,
		|	0 КАК КРазблокировке,
		|	0 КАК РезервироватьНаСкладеИзЗаблокированных,
		|	0 КАК РезервироватьПоМереПоступленияИзЗаблокированных,
		|	0 КАК ЗакрытьГрафикПоступления,
		|	ЛОЖЬ КАК ПроконтролироватьКачество,
		|	ЛОЖЬ КАК ПодлежитРазблокировке,
		|	0 КАК ЗакрытьГрафикОтгрузки,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ОтложенноеРезервирование) КАК ТипЗаписи,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	Строки КАК ТаблицаТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыПериодаОбеспечения КАК Границы
		|		ПО Границы.Номенклатура = ТаблицаТоваров.Номенклатура
		|		 И Границы.Характеристика = ТаблицаТоваров.Характеристика
		|		 И Границы.Склад = ТаблицаТоваров.Склад
		|		 И Границы.ГраницаПериода < ТаблицаТоваров.ДатаСобытия
		|		 И Границы.ГраницаПериода > ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Движения.Регистратор КАК Регистратор,
		|	Движения.Период КАК Период,
		|	Движения.ВидДвижения КАК ВидДвижения,
		|	ИСТИНА КАК Активность,
		|	Движения.Номенклатура КАК Номенклатура,
		|	Движения.Характеристика КАК Характеристика,
		|	Движения.Склад КАК Склад,
		|	Движения.Назначение КАК Назначение,
		|	Движения.Заказ КАК Заказ,
		|	Движения.ДатаСобытия КАК ДатаСобытия,
		|	Движения.ВНаличии КАК ВНаличии,
		|	Движения.Поступит КАК Поступит,
		|	Движения.Заказано КАК Заказано,
		|	Движения.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
		|	Движения.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
		|	Движения.ОтложитьРезервирование КАК ОтложитьРезервирование,
		|	Движения.КОбеспечению КАК КОбеспечению,
		|	Движения.НеОбеспечивать КАК НеОбеспечивать,
		|	Движения.ЗаблокированоВНаличии КАК ЗаблокированоВНаличии,
		|	Движения.ЗаблокированоПоступит КАК ЗаблокированоПоступит,
		|	Движения.КРазблокировке КАК КРазблокировке,
		|	Движения.РезервироватьНаСкладеИзЗаблокированных КАК РезервироватьНаСкладеИзЗаблокированных,
		|	Движения.РезервироватьПоМереПоступленияИзЗаблокированных КАК РезервироватьПоМереПоступленияИзЗаблокированных,
		|	Движения.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления,
		|	Движения.ПроконтролироватьКачество КАК ПроконтролироватьКачество,
		|	Движения.ПодлежитРазблокировке КАК ПодлежитРазблокировке,
		|	Движения.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузки,
		|	Движения.ТипЗаписи КАК ТипЗаписи,
		|	Движения.Сторно КАК Сторно
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности КАК Движения
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТребуетсяПересчет КАК ТребуетсяПересчет
		|		ПО ТребуетсяПересчет.ЕстьЗаписи
		|ГДЕ
		|	Движения.Регистратор = &Регистратор
		|		И Движения.Активность
		|		И Движения.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ОтложенноеРезервирование)
		|		И ТребуетсяПересчет.ЕстьЗаписи ЕСТЬ NULL";
		
	Тексты.Добавить(Текст);
	
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ТаблицаОтложенногоОбеспечения = Запрос.Выполнить().Выгрузить();
	
	ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(ТаблицаОтложенногоОбеспечения, Набор);
	
КонецПроцедуры

// Параметры:
//  НаборЗаписей - РегистрНакопленияНаборЗаписей.ЗапасыИПотребности - записываемый набор
//  Ссылка - ЛюбаяСсылка - записываемый документ.
//  ЭтоОбновлениеИБ - Булево - признак, что блокировки нужно установить из обработчика обновления регистра ЗапасыИПотребности.
// Возвращаемое значение:
// Структура - структура с полями:
//  * РегистраторыИЗаказы - ТаблицаЗначений - таблица с колонкой:
//   ** Регистратор - ЛюбаяСсылка - документ, в том числе служебный регистратор ЗапасыИПотребности, по которому
//                                  установлены блокировки, и который требует расчета движений по закрытию графика.
//   ** Заказ - ОпределяемыйТип.ОжидаемаяОтгрузкаИлиПоступление - значение измерение Заказ, соотвествующее данному регистратору.
//  * Заказы - Массив Из ОпределяемыйТип.ОжидаемаяОтгрузкаИлиПоступление - массив значений измерения заказ, по которому
//                                  установлены блокировки, и который требует расчета движений по закрытию графика.
Функция УстановитьБлокировкиЗаказовИТоваров(НаборЗаписей, Ссылка, ЭтоОбновлениеИБ) Экспорт
	
	Запрос = Новый Запрос();
	Заказы = НаборЗаписей.Выгрузить(, "Заказ");
	Запрос.УстановитьПараметр("Заказы", Заказы);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заказы.Заказ КАК Заказ
		|ПОМЕСТИТЬ ЗаказыПриЗаписи
		|ИЗ
		|	&Заказы КАК Заказы
		|ГДЕ
		|	Заказы.Заказ <> НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////
		// Разделяемая блокировка на документ уже установлена, значит можно читать движения документа из базы
		// так как, документ не могут записать/изменить, а значит не могут изменить его движения.
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Движения.Заказ КАК Ссылка
		|ПОМЕСТИТЬ РазличныеДокументыДоговорыИПартии
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности КАК Движения
		|ГДЕ
		|	Движения.Регистратор = &Регистратор
		|		И Движения.Активность
		|		И Движения.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись)
		|		И Движения.Заказ <> НЕОПРЕДЕЛЕНО
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Движения.Заказ КАК Ссылка
		|ИЗ
		|	ЗаказыПриЗаписи КАК Движения
		|ИНДЕКСИРОВАТЬ ПО
		|Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////
		// Индекс в пакете - 2. Значения изменения "Заказ" для установки управляемой блокировки.
		|ВЫБРАТЬ
		|	Ссылки.Ссылка КАК Заказ,
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура
		|ИЗ
		|	РазличныеДокументыДоговорыИПартии КАК Ссылки
		|ГДЕ
		// Если партия в документе не заполнена, но стоит флаг ПроконтролироватьКачество. Эти движения некорректные.
		|	Ссылки.Ссылка <> ЗНАЧЕНИЕ(Справочник.КонтролируемыеПартии.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ссылки.Ссылка КАК Заказ,
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура
		|ИЗ
		|	РазличныеДокументыДоговорыИПартии КАК Ссылки
		|ГДЕ
		// Если партия в документе не заполнена, но стоит флаг ПроконтролироватьКачество. Эти движения некорректные.
		|	Ссылки.Ссылка <> ЗНАЧЕНИЕ(Справочник.КонтролируемыеПартии.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Ссылки.Ссылка.Партия, Ссылки.Ссылка) КАК Ссылка,
		|	Ссылки.Ссылка КАК Заказ
		|ПОМЕСТИТЬ РазличныеДокументыИДоговоры
		|ИЗ
		|	РазличныеДокументыДоговорыИПартии КАК Ссылки
		|ГДЕ
		// Если партия в документе не заполнена, но стоит флаг ПроконтролироватьКачество. Эти движения некорректные.
		|	Ссылки.Ссылка <> ЗНАЧЕНИЕ(Справочник.КонтролируемыеПартии.ПустаяСсылка)
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////
		// Индекс в пакете - 5. Регистраторы для установки управляемой блокировки.
		|ВЫБРАТЬ
		|	0 КАК Порядок,
		|	МИНИМУМ(Таблица.Ссылка) КАК Регистратор,
		|	Ссылки.Ссылка КАК Заказ
		|ИЗ
		|	РазличныеДокументыИДоговоры КАК Ссылки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РегистраторЗапасыИПотребности КАК Таблица
		|		ПО Таблица.Распоряжение = Ссылки.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	Ссылки.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	Ссылки.Ссылка КАК Регистратор,
		|	Ссылки.Заказ КАК Заказ
		|ИЗ
		|	РазличныеДокументыИДоговоры КАК Ссылки
		|ГДЕ
		|	НЕ ТИПЗНАЧЕНИЯ(Ссылки.Ссылка) В(
		|		ТИП(Справочник.СоглашенияСПоставщиками),
		|		ТИП(Справочник.ДоговорыКонтрагентов))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2 КАК Порядок,
		|	&Регистратор КАК Регистратор,
		|	НЕОПРЕДЕЛЕНО КАК Заказ
		|УПОРЯДОЧИТЬ ПО
		|	Порядок
		|;
		|
		|///////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьПустыеПартии
		|ИЗ
		|	РазличныеДокументыДоговорыИПартии КАК Ссылки
		|ГДЕ
		// Если партия в документе не заполнена, но стоит флаг ПроконтролироватьКачество. Эти движения некорректные.
		|	Ссылки.Ссылка = ЗНАЧЕНИЕ(Справочник.КонтролируемыеПартии.ПустаяСсылка)";
		
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	Заказы = ПакетРезультатов[2];
	РегистраторыИЗаказы = ПакетРезультатов[5];
	
	ЕстьПустыеПартии = Не ПакетРезультатов[6].Пустой();
	Если ЕстьПустыеПартии Тогда
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru = 'Некорректные движения по контролируемой партии при проведении: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Ссылка);
		СобытиеЖурнала = ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(
			СобытиеЖурнала,
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыНакопления.ЗапасыИПотребности,
			НаборЗаписей,
			ТекстСообщения);
		
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных();
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ЗапасыИПотребности");
	
	// Ждут регистраторы с такими же заказами как у текущего регистратора.
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Заказы;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Заказ", "Заказ");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	
	// Нужно ответственно прочитать номенклатуру указанную в заказах нашего документа, а затем подложить под заказы расчетные записи.
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ЗапасыИПотребности.НаборЗаписей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РегистраторыИЗаказы;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
	
	//@skip-check lock-out-of-try
	БлокировкаДанных.Заблокировать();
	
	РегистраторыИЗаказы = РегистраторыИЗаказы.Выгрузить();
	Регистраторы = РегистраторыИЗаказы.ВыгрузитьКолонку("Регистратор"); // значения могут повторяться
	Запрос.УстановитьПараметр("ТаблицаТовары", НаборЗаписей.Выгрузить());
	
	ТекстыЗапроса = Новый Массив();
	ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Склад КАК Склад,
		|	Товары.Назначение КАК Назначение,
		|	Товары.Заказ КАК Заказ,
		|	Товары.ДатаСобытия КАК ДатаСобытия
		|ПОМЕСТИТЬ ДвиженияПриЗаписи
		|ИЗ
		|	&ТаблицаТовары КАК Товары
		|ГДЕ
		|	Товары.Активность");
	
	ТекстыИзмерений = Новый Массив();
	
	ТекстыИзмерений.Добавить(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Склад КАК Склад,
		|	Товары.Назначение КАК Назначение,
		|	Товары.Заказ КАК Заказ,
		|	Товары.ДатаСобытия КАК ДатаСобытия
		|ИЗ
		|	ДвиженияПриЗаписи КАК Товары");
	
	РегистраторыПоТипам = РегистраторыПоТипам(Регистраторы);
	Для Каждого Элемент Из РегистраторыПоТипам Цикл
		
		ТекстПоТипуРегистратора =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Движения.Номенклатура КАК Номенклатура,
			|	Движения.Характеристика КАК Характеристика,
			|	Движения.Склад КАК Склад,
			|	Движения.Назначение КАК Назначение,
			|	Движения.Заказ КАК Заказ,
			|	Движения.ДатаСобытия КАК ДатаСобытия
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности КАК Движения
			|ГДЕ
			|	Движения.Регистратор В(&РегистраторыПереопределяемый)
			|		И Движения.Активность";
		ТекстПоТипуРегистратора = СтрЗаменить(ТекстПоТипуРегистратора, "РегистраторыПереопределяемый", Элемент.ИмяПараметра);
		ТекстыИзмерений.Добавить(ТекстПоТипуРегистратора);
		Запрос.УстановитьПараметр(Элемент.ИмяПараметра, Элемент.Регистраторы);
		
	КонецЦикла;
	
	ТекстРазличныеИзмерения = СтрСоединить(ТекстыИзмерений, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении(Истина));
	ТекстыЗапроса.Добавить(ТекстРазличныеИзмерения);
	Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Товары = Запрос.Выполнить();
	
	// Блокируем фактические измерения, которые могут быть затронуты при записи наборов по текущему регистратору и по заказам.
	БлокировкаДанных = Новый БлокировкаДанных();
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ЗапасыИПотребности");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Назначение", "Назначение");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Заказ", "Заказ");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДатаСобытия", "ДатаСобытия");
	
	Если Не ЭтоОбновлениеИБ Тогда
		ДосчитыватьРегистрРегламентнымЗаданием = РаспределениеЗапасов.ДосчитыватьРегистрРегламентнымЗаданием();
		Если Не ДосчитыватьРегистрРегламентнымЗаданием Тогда
			
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Склад КАК Склад,
			|	Товары.Назначение КАК Назначение
			|ПОМЕСТИТЬ ДвиженияПриЗаписи
			|ИЗ
			|	&ТаблицаТовары КАК Товары
			|ГДЕ
			|	Товары.Активность
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Склад КАК Склад,
			|	Товары.Назначение КАК Назначение
			|ИЗ
			|	ДвиженияПриЗаписи КАК Товары
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Движения.Номенклатура КАК Номенклатура,
			|	Движения.Характеристика КАК Характеристика,
			|	Движения.Склад КАК Склад,
			|	Движения.Назначение КАК Назначение
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности КАК Движения
			|ГДЕ
			|	Движения.Регистратор = &Регистратор
			|		И Движения.Активность
			|;
			|
			|/////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Склад КАК Склад,
			|	Товары.Назначение КАК Назначение
			|ИЗ
			|	ДвиженияПриЗаписи КАК Товары
			|ГДЕ
			|	Товары.Склад <> НЕОПРЕДЕЛЕНО
			|		И Товары.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
			|		И ТИПЗНАЧЕНИЯ(Товары.Склад) = ТИП(Справочник.Склады)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Движения.Номенклатура КАК Номенклатура,
			|	Движения.Характеристика КАК Характеристика,
			|	Движения.Склад КАК Склад,
			|	Движения.Назначение КАК Назначение
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности КАК Движения
			|ГДЕ
			|	Движения.Регистратор = &Регистратор
			|		И Движения.Активность
			|		И Движения.Склад <> НЕОПРЕДЕЛЕНО
			|		И Движения.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
			|		И ТИПЗНАЧЕНИЯ(Движения.Склад) = ТИП(Справочник.Склады)";
			
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			
			РаспределениеЗапасов.ДобавитьБлокировки(БлокировкаДанных, Неопределено,
				РезультатЗапроса[РезультатЗапроса.ВГраница() - 1], РезультатЗапроса[РезультатЗапроса.ВГраница()]);
			
		КонецЕсли;
		
		//@skip-check lock-out-of-try
		БлокировкаДанных.Заблокировать();
		
	КонецЕсли;
	
	// Если это заказ, то он уже был в первых двух секциях запроса другие регистраторы как результат не нужны.
	РегистраторыИЗаказы.Удалить(РегистраторыИЗаказы.Количество() - 1);
	Заказы = Заказы.Выгрузить().ВыгрузитьКолонку("Заказ");
	Результат = Новый Структура("РегистраторыИЗаказы,Заказы", РегистраторыИЗаказы, Заказы);
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьЗаказыСогласноРасчетам(УстановленныеБлокировки, Запрос)
	
	Регистраторы = УстановленныеБлокировки.РегистраторыИЗаказы.Скопировать();
	Регистраторы.Свернуть("Регистратор");
	Регистраторы = Регистраторы.ВыгрузитьКолонку("Регистратор");
	
	НаборЗаписейГрафик = СоздатьНаборЗаписей();
	НаборЗаписейГрафик.ОбменДанными.Загрузка = Истина;
	НаборЗаписейГрафик.ДополнительныеСвойства.Вставить("РегистрироватьНаУзлахПлановОбменаПриОбновленииИБ");
	НаборЗаписейГрафик.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	Для Каждого Регистратор Из Регистраторы Цикл
		
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Движения.Регистратор КАК Регистратор,
			|	Движения.Период КАК Период,
			|	Движения.ВидДвижения КАК ВидДвижения,
			|	Движения.Активность КАК Активность,
			|	Движения.Номенклатура КАК Номенклатура,
			|	Движения.Характеристика КАК Характеристика,
			|	Движения.Склад КАК Склад,
			|	Движения.Назначение КАК Назначение,
			|	Движения.Заказ КАК Заказ,
			|	Движения.ДатаСобытия КАК ДатаСобытия,
			|	Движения.ВНаличии КАК ВНаличии,
			|	Движения.Поступит КАК Поступит,
			|	Движения.Заказано КАК Заказано,
			|	Движения.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
			|	Движения.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
			|	Движения.ОтложитьРезервирование КАК ОтложитьРезервирование,
			|	Движения.КОбеспечению КАК КОбеспечению,
			|	Движения.НеОбеспечивать КАК НеОбеспечивать,
			|	Движения.ЗаблокированоВНаличии КАК ЗаблокированоВНаличии,
			|	Движения.ЗаблокированоПоступит КАК ЗаблокированоПоступит,
			|	Движения.КРазблокировке КАК КРазблокировке,
			|	Движения.РезервироватьНаСкладеИзЗаблокированных КАК РезервироватьНаСкладеИзЗаблокированных,
			|	Движения.РезервироватьПоМереПоступленияИзЗаблокированных КАК РезервироватьПоМереПоступленияИзЗаблокированных,
			|	Движения.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления,
			|	Движения.ПроконтролироватьКачество КАК ПроконтролироватьКачество,
			|	Движения.ПодлежитРазблокировке КАК ПодлежитРазблокировке,
			|	Движения.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузки,
			|	Движения.ОтгружаемыйЗаказ КАК ОтгружаемыйЗаказ,
			|	Движения.ТипЗаписи КАК ТипЗаписи,
			|	Движения.Сторно КАК Сторно
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности КАК Движения
			|ГДЕ
			|	Движения.Регистратор = &Регистратор
			|		И (Движения.ТипЗаписи В(
			|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись),
			|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ОтложенноеРезервирование))
			|			ИЛИ НЕ Движения.Заказ В(&Заказы))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РезультатыРасчета.Регистратор КАК Регистратор,
			|	РезультатыРасчета.Период КАК Период,
			|	РезультатыРасчета.ВидДвижения КАК ВидДвижения,
			|	РезультатыРасчета.Активность КАК Активность,
			|	РезультатыРасчета.Номенклатура КАК Номенклатура,
			|	РезультатыРасчета.Характеристика КАК Характеристика,
			|	РезультатыРасчета.Склад КАК Склад,
			|	РезультатыРасчета.Назначение КАК Назначение,
			|	РезультатыРасчета.Заказ КАК Заказ,
			|	РезультатыРасчета.ДатаСобытия КАК ДатаСобытия,
			|	РезультатыРасчета.ВНаличии КАК ВНаличии,
			|	РезультатыРасчета.Поступит КАК Поступит,
			|	РезультатыРасчета.Заказано КАК Заказано,
			|	РезультатыРасчета.РезервироватьНаСкладе КАК РезервироватьНаСкладе,
			|	РезультатыРасчета.РезервироватьПоМереПоступления КАК РезервироватьПоМереПоступления,
			|	РезультатыРасчета.ОтложитьРезервирование КАК ОтложитьРезервирование,
			|	РезультатыРасчета.КОбеспечению КАК КОбеспечению,
			|	РезультатыРасчета.НеОбеспечивать КАК НеОбеспечивать,
			|	РезультатыРасчета.ЗаблокированоВНаличии КАК ЗаблокированоВНаличии,
			|	РезультатыРасчета.ЗаблокированоПоступит КАК ЗаблокированоПоступит,
			|	РезультатыРасчета.КРазблокировке КАК КРазблокировке,
			|	РезультатыРасчета.РезервироватьНаСкладеИзЗаблокированных КАК РезервироватьНаСкладеИзЗаблокированных,
			|	РезультатыРасчета.РезервироватьПоМереПоступленияИзЗаблокированных КАК РезервироватьПоМереПоступленияИзЗаблокированных,
			|	РезультатыРасчета.ЗакрытьГрафикПоступления КАК ЗакрытьГрафикПоступления,
			|	РезультатыРасчета.ПроконтролироватьКачество КАК ПроконтролироватьКачество,
			|	РезультатыРасчета.ПодлежитРазблокировке КАК ПодлежитРазблокировке,
			|	РезультатыРасчета.ЗакрытьГрафикОтгрузки КАК ЗакрытьГрафикОтгрузки,
			|	НЕОПРЕДЕЛЕНО КАК ОтгружаемыйЗаказ,
			|	РезультатыРасчета.ТипЗаписи КАК ТипЗаписи,
			|	РезультатыРасчета.Сторно КАК Сторно
			|ИЗ
			|	РезультатыРасчетаГрафика КАК РезультатыРасчета
			|ГДЕ
			|	РезультатыРасчета.Регистратор = &Регистратор";
			
		Таблица = Запрос.Выполнить().Выгрузить();
		НаборЗаписейГрафик.Отбор.Регистратор.Установить(Регистратор);
		НаборЗаписейГрафик.Загрузить(Таблица);
		НаборЗаписейГрафик.Записать();
		
	КонецЦикла
	
КонецПроцедуры

Функция РегистраторыПоТипам(Регистраторы)
	
	ТипыРегистраторов = Новый Соответствие();
	РегистраторыПоТипам = Новый Массив();
	
	Для Каждого Ссылка Из Регистраторы Цикл
		
		ТипРегистратора = ТипЗнч(Ссылка);
		ЭлементыМассива = ТипыРегистраторов[ТипРегистратора]; 
		Если ЭлементыМассива = Неопределено Тогда
			МетаданныеДокумента = Ссылка.Метаданные(); // ОбъектМетаданных
			ИмяПараметра = "Регистраторы" + МетаданныеДокумента.Имя;
			ЭлементыМассива = Новый Массив();
			ТипыРегистраторов.Вставить(ТипРегистратора, ЭлементыМассива);
			РегистраторыПоТипам.Добавить(Новый Структура("Регистраторы,ИмяПараметра", ЭлементыМассива, ИмяПараметра));
		КонецЕсли;
		
		ЭлементыМассива.Добавить(Ссылка);
		
	КонецЦикла;
	
	Возврат РегистраторыПоТипам;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.ЗапасыИПотребности.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.27.41";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c050f1a4-0885-4ddf-9d5b-0f9575629156");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.ЗапасыИПотребности.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	Обработчик.Комментарий = НСтр("ru = 'Обновляет движения по регистру накопления ""Запасы и потребности"" для документов ""Акт о расхождениях после приемки"", при раздельном оформлении закупок.
	| Также обновляет движения документов ""Корректировка приобретения"", при раздельном оформлении закупок, либо содержащих работы.
	| Также обновляет движения документов ""Приобретение товаров и услуг"", при раздельном оформлении закупок, содержащих работы.
	| Исправляет ошибку движений документов ""Пересчет товаров"" по товарным местам.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.АктОРасхожденияхПослеПриемки.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.КорректировкаПриобретения.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ПриобретениеТоваровУслуг.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ПересчетТоваров.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыНакопления.ЗапасыИПотребности.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.ЗапасыИПотребности.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
КонецПроцедуры

// Обработчик обновления
// 
// Параметры:
// 	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки 
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	СписокДокументов = Новый Массив;
	СписокДокументов.Добавить("Документ.АктОРасхожденияхПослеПриемки");
	СписокДокументов.Добавить("Документ.КорректировкаПриобретения");
	СписокДокументов.Добавить("Документ.ПриобретениеТоваровУслуг");
	СписокДокументов.Добавить("Документ.ПересчетТоваров");
	
	ПолноеИмяРегистра = Метаданные.РегистрыНакопления.ЗапасыИПотребности.ПолноеИмя();
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = СтрСоединить(СписокДокументов, ",");
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	ИмяРегистра = "ЗапасыИПотребности";
	
	ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	ДопПараметры.ПолучитьТекстыЗапроса = Истина;
	
	ТекстыЗапроса = Документы.АктОРасхожденияхПослеПриемки.ДанныеДокументаДляПроведения(
		Неопределено,
		ИмяРегистра,
		ДопПараметры);
	
	РегистраторыАктыПослеПриемки = ПроведениеДокументов.РегистраторыДляПерепроведения(
		ТекстыЗапроса,
		ПолноеИмяРегистра,
		"Документ.АктОРасхожденияхПослеПриемки",
		Неопределено,
		"ЗакрытьГрафикПоступления,ЗакрытьГрафикОтгрузки",
		"ТаблицаРегистра.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись)");
	
	ТекстыЗапроса = Документы.КорректировкаПриобретения.ДанныеДокументаДляПроведения(
		Неопределено,
		ИмяРегистра,
		ДопПараметры);
	
	РегистраторыКорректировкиПриобретения = ПроведениеДокументов.РегистраторыДляПерепроведения(
		ТекстыЗапроса,
		ПолноеИмяРегистра,
		"Документ.КорректировкаПриобретения",
		Неопределено,
		"ЗакрытьГрафикПоступления,ЗакрытьГрафикОтгрузки",
		"ТаблицаРегистра.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись)");
	
	ТекстыЗапроса = Документы.ПриобретениеТоваровУслуг.ДанныеДокументаДляПроведения(
		Неопределено,
		ИмяРегистра,
		ДопПараметры);
	
	РегистраторыПриобретения = ПроведениеДокументов.РегистраторыДляПерепроведения(
		ТекстыЗапроса,
		ПолноеИмяРегистра,
		"Документ.ПриобретениеТоваровУслуг",
		Неопределено,
		"ЗакрытьГрафикПоступления,ЗакрытьГрафикОтгрузки",
		"ТаблицаРегистра.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись)");
	
	ТекстыЗапроса = Документы.ПересчетТоваров.ДанныеДокументаДляПроведения(
		Неопределено,
		ИмяРегистра,
		ДопПараметры);
	
	РегистраторыПересчетыТоваров = ПроведениеДокументов.РегистраторыДляПерепроведения(
		ТекстыЗапроса,
		ПолноеИмяРегистра,
		"Документ.ПересчетТоваров",
		Неопределено,
		"ЗакрытьГрафикПоступления,ЗакрытьГрафикОтгрузки",
		"ТаблицаРегистра.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейЗапасыИПотребности.ПервичнаяЗапись)");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистраторыАктыПослеПриемки", РегистраторыАктыПослеПриемки);
	Запрос.УстановитьПараметр("РегистраторыКорректировкиПриобретения", РегистраторыКорректировкиПриобретения);
	Запрос.УстановитьПараметр("РегистраторыПриобретения", РегистраторыПриобретения);
	Запрос.УстановитьПараметр("РегистраторыПересчетыТоваров", РегистраторыПересчетыТоваров);
	Запрос.Текст =
		// Перенос движений по отражению расхождений в корректировку приобретения.
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.АктОРасхожденияхПослеПриемки КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И ТаблицаДокумента.Ссылка В (&РегистраторыАктыПослеПриемки)
		|	И ТаблицаДокумента.ХозяйственнаяОперация В(
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуПоступлениеИзТоваровВПути))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Перенос движений по отражению расхождений в корректировку приобретения.
		// Также добавление движений по работам в двухходовке.
		// Удаление движений по наличию работ в одноходовке для варианта отражения Отразить на доходах/ Списать на расходы
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.КорректировкаПриобретения КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И ТаблицаДокумента.Ссылка В (&РегистраторыКорректировкиПриобретения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Движения по работам документов не поддерживающих двухходовку работ (по старым договорам)
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И ТаблицаДокумента.Ссылка В (&РегистраторыПриобретения)
		|	И ТаблицаДокумента.ХозяйственнаяОперация В(
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Неверные движения пересчетов товаров по упаковкам товарных мест.
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.ПересчетТоваров КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И ТаблицаДокумента.Ссылка В (&РегистраторыПересчетыТоваров)";
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
КонецПроцедуры

// Обработчик обновления.
//
// Параметры:
//	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	СписокДокументов = Новый Массив;
	СписокДокументов.Добавить("Документ.АктОРасхожденияхПослеПриемки");
	СписокДокументов.Добавить("Документ.КорректировкаПриобретения");
	СписокДокументов.Добавить("Документ.ПриобретениеТоваровУслуг");
	СписокДокументов.Добавить("Документ.ПересчетТоваров");
	
	ПолноеИмяРегистра = Метаданные.РегистрыНакопления.ЗапасыИПотребности.ПолноеИмя();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазыУТ.ДополнительныеПараметрыПерезаписиДвиженийИзОчереди();
	ДополнительныеПараметры.ОбновляемыеДанные = Параметры.ОбновляемыеДанные;
	
	ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(
		СписокДокументов,
		ПолноеИмяРегистра,
		Параметры.Очередь,
		ДополнительныеПараметры);
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

Процедура СформироватьИЗаписатьДвижения(НаборЗаписей, Ссылка, ЗаписатьДвижения) Экспорт
	
	Если ЗаписатьДвижения Тогда
		
		// Получение первичных движений.
		ТаблицыДляДвижений = ПроведениеДокументов.ДанныеДокументаДляПроведения(Ссылка, "ЗапасыИПотребности");
		ТаблицаДанных = ТаблицыДляДвижений["Таблица" + "ЗапасыИПотребности"];
		НаборЗаписей.Загрузить(ТаблицаДанных);
		
		УстановленныеБлокировки = УстановитьБлокировкиЗаказовИТоваров(НаборЗаписей, Ссылка, Истина);
		
		ВозможноОтложенноеОбеспечение = Ложь;
		Если Константы.ВариантУпорядочиванияПотребностейПоЗаказамДляОбеспечения.Получить()
					<> Перечисления.ВариантыУпорядочиванияПотребностейПоЗаказамДляОбеспечения.ПриоритетИДатаДокумента
				И Не Константы.КонтролироватьЗапасыТоваровПодлежащихРезервированиюПоМереПоступления.Получить() Тогда
				
			Для Каждого Строка Из ТаблицаДанных Цикл
				Если ЗначениеЗаполнено(Строка.ДатаСобытия) И Строка.РезервироватьПоМереПоступления <> 0 Тогда
					ВозможноОтложенноеОбеспечение = Истина;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		// Расчет отложенного резервирования.
		Если ВозможноОтложенноеОбеспечение Тогда
			
			ДополнитьНаборЗаписямиОтложенногоОбеспечения(НаборЗаписей);
			
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
		
		// Расчет графика поступления и графика отгрузки.
		Если УстановленныеБлокировки.Заказы.Количество() > 0 Тогда
			
			Запрос = Новый Запрос();
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
			ВременнаяТаблицаЗакрытияГрафика(Запрос, "РезультатыРасчетаГрафика", УстановленныеБлокировки);
			ЗаписатьЗаказыСогласноРасчетам(УстановленныеБлокировки, Запрос);
			
		КонецЕсли;
		
	Иначе
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
