 //@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение = Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда
		
		ИспользуетсяДоставка25 = ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка25();
		Если ИспользуетсяДоставка25
			И ДоставкаТоваров.ЕстьСкладыССборкойПослеДоставки(Истина) Тогда
			
			ТекстСообщения = НСтр("ru = 'Включение опции ""Сначала заказы и накладные, затем ордера"" возможно при отсутствии в системе ордерных складов с настройкой ""Сборка осуществляется после планирования рейса"".'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли