
// #Область ПрограммныйИнтерфейс

// Открывает форму слежения за фоновым заданием
Процедура ЗапуститьФоновоеВыполнениеСотслеживаниемВНовойФорме(ЗапускаемыйМетодФоновогоЗадания,
														КлючФоновогоЗадания,
														ПараметрыЗапускаемогоМетода = Неопределено,
														ПредставлениеЗадачи = "Фоновая задача",
														ЗакрытьПриУспешномВыполнении = Истина,
														ОтображатьПрогресс = Ложь,
														Режим = Неопределено) Экспорт
	
														
	Если Режим = Неопределено Тогда 
		Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
														
	ПараметрыЗапускаФоновогоЗадания = КонтурЛогистика_ДлительныеОперацииКлиент.ПараметрыЗапускаФоновогоЗаданияВФормеФоновогоЗадания();
	
	ПараметрыЗапускаФоновогоЗадания.ЗапуститьМетод 					= ЗапускаемыйМетодФоновогоЗадания;
	ПараметрыЗапускаФоновогоЗадания.КлючФоновогоЗадания 			= КлючФоновогоЗадания;
	ПараметрыЗапускаФоновогоЗадания.ПараметрыЗапускаемогоМетода 	= ПараметрыЗапускаемогоМетода;
	ПараметрыЗапускаФоновогоЗадания.ПредставлениеЗадачи 			= ПредставлениеЗадачи;
	ПараметрыЗапускаФоновогоЗадания.ЗакрытьПриУспешномВыполнении 	= ЗакрытьПриУспешномВыполнении;
	ПараметрыЗапускаФоновогоЗадания.ОтображатьПрогресс 				= ОтображатьПрогресс;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("ОбщаяФорма.КонтурЛогистика_ФоновоеЗадание",
		ПараметрыЗапускаФоновогоЗадания,
		,
		,
		,
		, Режим);
	
КонецПроцедуры

// запускает фоновое и крутит на переданной форме лоадер, присваивает ей идентификатор ФЗ, подключает обработчик слежения за ФЗ
Процедура ЗапуститьФоновоеВыполнениеСотслеживаниемВТекущейФорме(Лоадер,
																ЗапускаемыйМетодФоновогоЗадания,
																КлючФоновогоЗадания,
																ПараметрыЗапускаемогоМетода = Неопределено,
																ПредставлениеЗадачи = "Фоновая задача") Экспорт
	
	// TODO реализовать 
	//			запуск ФЗ
	//			передачу в форму Идентификатора ФЗ
	//			активацию функционала формы связанного со слежением за ФЗ 
	//РезультатЗапускаФоновогоЗаданияИлиВыполненияБезФонового = ЗапуститьФоновоеЗадание(ЗапускаемыйМетодФоновогоЗадания,
	//							Неопределено,
	//							КлючФоновогоЗадания,
	//							ПредставлениеЗадачи,
	//							АдресРезультатаФЗ)
	
	
КонецПроцедуры

Функция ЗапуститьФоновоеЗадание(Метод,
								ПараметрыМетодаСтруктура = Неопределено,
								КлючФоновогоЗадания = Неопределено,
								НаименованиеФЗ = "Фоновая задача",
								АдресРезультатаФЗ = Неопределено) Экспорт
								
	
	РезультатЗапускаФоновогоЗаданияИлиВыполненияБезФонового = КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьВФоне(Метод,
																ПараметрыМетодаСтруктура,
																КлючФоновогоЗадания,
																НаименованиеФЗ,
																АдресРезультатаФЗ);									
			
	Возврат РезультатЗапускаФоновогоЗаданияИлиВыполненияБезФонового;	
								
КонецФункции

Функция СостояниеЗадания(Знач ИдентификаторЗадания, Знач ИсключениеПриОшибке = Ложь, ВыводитьСообщения = Ложь) Экспорт
	
	Возврат КонтурЛогистика_ДлительныеОперацииСервер.ЗаданиеВыполнено(ИдентификаторЗадания, ИсключениеПриОшибке, ВыводитьСообщения);
	
КонецФункции

// вернет Истина если задание все еще выполняется и ложь если завершено, устанавливает состояние лоадера
Функция ОбработчикСлеженияЗаФЗ(Знач ИдентификаторЗадания, ЭлементФормыЛоадер = Неопределено, ЭлементФормыВыполнение = Неопределено) Экспорт
	
	Если Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.МенеджерФоновыхЗаданийДоступен() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ИдентификаторЗадания = "" Или ИдентификаторЗадания = Неопределено Тогда
		
		Если ЭлементФормыЛоадер <> Неопределено Тогда
			ЭлементФормыЛоадер.Видимость = Ложь;
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
			"Не передан идентификатор задания! Не могу проверить выполнение.
			|При повторении проблемы обратитесь в техподдержку");
		Возврат Ложь;
		
	КонецЕсли;
	
	Попытка
		РезультатПроверкиФЗ = СостояниеЗадания(ИдентификаторЗадания,, Истина);
	Исключение
		
		Если ЭлементФормыЛоадер <> Неопределено Тогда
			ЭлементФормыЛоадер.Видимость = Ложь;
		КонецЕсли;
		
		ИдентификаторЗадания = "";
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
			"Не могу проверить состояние задания.
			|При повторении проблемы обратитесь в техподдержку");
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Если РезультатПроверкиФЗ.Статус = "Выполняется" Тогда
		
		Если ЭлементФормыЛоадер <> Неопределено Тогда
			ЭлементФормыЛоадер.Видимость = Истина;
			ЭлементФормыЛоадер.Картинка = БиблиотекаКартинок.КонтурЛогистика_Лоадер16;
		КонецЕсли;
		
		Возврат Истина;
		
	Иначе
		
		Если РезультатПроверкиФЗ.Статус = "Выполнено"
			И Найти(РезультатПроверкиФЗ.Наименование, "ТихийРежим") = 0 Тогда
			
			Состояние("Завершено задание", , РезультатПроверкиФЗ.Наименование, БиблиотекаКартинок.КонтурЛогистика_Окончание16);
			Если ЭлементФормыВыполнение <> Неопределено Тогда
				ЭлементФормыВыполнение.Картинка = БиблиотекаКартинок.КонтурЛогистика_Галочка;
				ЭлементФормыВыполнение.Заголовок = "Успешно! (открыть подробности)";
			КонецЕсли;
			
		ИначеЕсли РезультатПроверкиФЗ.Статус = "Ошибка" Тогда
			
			Состояние("Завершено с ошибками: " + РезультатПроверкиФЗ.Наименование,,
				РезультатПроверкиФЗ.КраткоеПредставлениеОшибки, БиблиотекаКартинок.КонтурЛогистика_Восклицание);
			Если ЭлементФормыВыполнение <> Неопределено Тогда
				ЭлементФормыВыполнение.Картинка = БиблиотекаКартинок.КонтурЛогистика_ИсправитьОшибки;
				ЭлементФормыВыполнение.Заголовок = "Не выполнено! (" + РезультатПроверкиФЗ.КраткоеПредставлениеОшибки + ")";
			КонецЕсли;
			
		ИначеЕсли РезультатПроверкиФЗ.Статус = "Отменено" Тогда
			
			Состояние("Отменено: ", , РезультатПроверкиФЗ.Наименование, БиблиотекаКартинок.КонтурЛогистика_ИсправитьОшибки);
			Если ЭлементФормыВыполнение <> Неопределено Тогда
				ЭлементФормыВыполнение.Картинка = БиблиотекаКартинок.КонтурЛогистика_Отменить;
				ЭлементФормыВыполнение.Заголовок = "отменено. (открыть подробности)";
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭлементФормыВыполнение <> Неопределено Тогда
			ЭлементФормыВыполнение.Видимость = Истина;
		КонецЕсли;
		
		Если ЭлементФормыЛоадер <> Неопределено Тогда
			ЭлементФормыЛоадер.Видимость = Ложь;
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Процедура ЗапуститьОбработкуЗаявокВФоне(МассивЗаявок) Экспорт
	
	СписокЗаявок = Новый СписокЗначений;
	СписокЗаявок.ЗагрузитьЗначения(МассивЗаявок);
	
	СписокДокументов = Новый СписокЗначений;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
					"Справочник.КонтурЛогистика_Заявки.Форма.ФормаСлеженияЗаНесколькими",
					Новый Структура("СписокЗаявок, СписокДокументов", СписокЗаявок, СписокДокументов));
	
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

Процедура СледитьЗаФоновымЗаданиемВФорме(ИдентификаторФоновогоЗадания,
										ПредставлениеЗадачи = "Фоновая задача",
										ЗакрытьПриУспешномВыполнении = Ложь,
										ОтображатьПрогресс = Ложь) Экспорт
	
	ПараметрыЗапускаФоновогоЗадания = КонтурЛогистика_ДлительныеОперацииКлиент.ПараметрыЗапускаФоновогоЗаданияВФормеФоновогоЗадания();
	ПараметрыЗапускаФоновогоЗадания.ИдентификаторФоновогоЗадания 	= ИдентификаторФоновогоЗадания;
	ПараметрыЗапускаФоновогоЗадания.ЗакрытьПриУспешномВыполнении 	= ЗакрытьПриУспешномВыполнении;
	ПараметрыЗапускаФоновогоЗадания.ПредставлениеЗадачи 			= ПредставлениеЗадачи;
	ПараметрыЗапускаФоновогоЗадания.ОтображатьПрогресс 				= ОтображатьПрогресс;
	
	ОткрытьФорму("ОбщаяФорма.КонтурЛогистика_ФоновоеЗадание", ПараметрыЗапускаФоновогоЗадания);
	
КонецПроцедуры

//// Предполагается открытие формы слежения за ФЗ с клиента:
//
// ПараметрыЗапускаФоновогоЗадания = КонтурЛогистика_ДлительныеОперацииКлиент.ПараметрыЗапускаФоновогоЗаданияВФормеФоновогоЗадания();
//// Установка своих значений в ПараметрыЗапускаФоновогоЗадания и выполнение:
// ОткрытьФорму("ОбщаяФорма.КонтурЛогистика_ФоновоеЗадание", ПараметрыЗапускаФоновогоЗадания);
// далее форма будт открыта и 
Функция ПараметрыЗапускаФоновогоЗаданияВФормеФоновогоЗадания() Экспорт

	ПараметрыФормы = Новый Структура;                                      // Пример
	
	ПараметрыФормы.Вставить("ИдентификаторФоновогоЗадания", "");			// если передать то форма будет только следить за этим ФЗ
	ПараметрыФормы.Вставить("ЗапуститьМетод", "");						// "КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ТестоваяДлительнаяОперация");
	ПараметрыФормы.Вставить("КлючФоновогоЗадания", ""); 				// "Тест1");
	ПараметрыФормы.Вставить("ПараметрыЗапускаемогоМетода" , Неопределено);
	ПараметрыФормы.Вставить("ПредставлениеЗадачи" , "");				// "Обновление чего-то");
	ПараметрыФормы.Вставить("ЗакрытьПриУспешномВыполнении" , Ложь);
	ПараметрыФормы.Вставить("ОтображатьПрогресс" , Ложь);

	Возврат ПараметрыФормы;
	
КонецФункции

// #КонецОбласти
