// Универсальные механизмы интеграции ИС (ЕГАИС, ГИСМ, ВЕТИС, ...)

#Область ПрограммныйИнтерфейс

#Область Прочие

// Обработчик команды "Разбить строку".
//
//	Параметры:
//		ТЧ - ДанныеФормыКоллекция
//		ЭлементФормы - ТаблицаФормы
//		ОповещениеПослеРазбиения - ОписаниеОповещения
//		ПараметрыРазбиенияСтроки - см. ОбщегоНазначенияУТКлиент.ПараметрыРазбиенияСтроки.
//
Процедура РазбитьСтрокуТабличнойЧасти(ТЧ, ЭлементФормы, ОповещениеПослеРазбиения, ПараметрыРазбиенияСтроки) Экспорт
	
	ПараметрыРазбиения = РаботаСТабличнымиЧастямиКлиент.ПараметрыРазбиенияСтроки();
	ЗаполнитьЗначенияСвойств(ПараметрыРазбиения, ПараметрыРазбиенияСтроки);
	РаботаСТабличнымиЧастямиКлиент.РазбитьСтроку(ТЧ, ЭлементФормы, ОповещениеПослеРазбиения, ПараметрыРазбиения);
	
КонецПроцедуры

// см. СобытияФормИСКлиентПереопределяемый.ПриИзмененииНоменклатуры
Процедура ПриИзмененииНоменклатуры(Форма, ТекущаяСтрока, КэшированныеЗначения, ПараметрыУказанияСерий = Неопределено) Экспорт
	
	Количество = Неопределено;
	СтруктураДействий = Новый Структура;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "Характеристика") Тогда
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу",
			ТекущаяСтрока.Характеристика);
			
		СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
			Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "Серия") Тогда
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры",
			Новый Структура("Номенклатура", "ТипНоменклатуры"));
	КонецЕсли;
			
	Если ПараметрыУказанияСерий <> Неопределено Тогда
		
		ИсточникЗначенийВФорме = Форма;
		ПараметрыУказанияСерийКопия = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ПараметрыУказанияСерий, Ложь);
			
		ИмяТЧ = "Товары";
		ИмяПоляСклад = "Склад";
			
		Если ПараметрыУказанияСерийКопия.Свойство("ВыходныеИзделия") Тогда
			ПараметрыУказанияСерийКопия = ПараметрыУказанияСерийКопия.ВыходныеИзделия;
			ИмяТЧ = "ВыходныеИзделия";
			ИмяПоляСклад = "Получатель";
		КонецЕсли;
		
		Если ПараметрыУказанияСерийКопия.ИмяИсточникаЗначенийВФормеОбъекта = "ТекущиеДанные" Тогда
			ИсточникЗначенийВФорме = ТекущаяСтрока;
		ИначеЕсли ЗначениеЗаполнено(ПараметрыУказанияСерийКопия.ИмяИсточникаЗначенийВФормеОбъекта) Тогда
			ИсточникЗначенийВФорме = Форма[ПараметрыУказанияСерийКопия.ИмяИсточникаЗначенийВФормеОбъекта];
		КонецЕсли;
	
		Склад = Неопределено;
		Если СтрНачинаетсяС(Форма.ИмяФормы, "Обработка.ПроверкаИПодбор") Тогда
			ПараметрыУказанияСерийКопия.ИмяТЧТовары = ИмяТЧ;
			ПараметрыУказанияСерийКопия.ИмяТЧСерии = ИмяТЧ;
			ИнтеграцияИСУТКлиентСервер.ПараметрыУказанияСерийЗаменитьИмяТЧ(ПараметрыУказанияСерийКопия);
			ПараметрыУказанияСерийКопия.ИменаПолейДополнительные.Удалить(
				ПараметрыУказанияСерийКопия.ИменаПолейДополнительные.Найти("КоличествоПодобрано"));
			ТекущаяСтрока[ИмяПоляСклад] = Форма.Склад;
			Склад = Форма.Склад;
			// Количество сохраняется и восстанавливается при завершении обработки
			// для корректного расчета статусов указания серий.
			Количество = ТекущаяСтрока.Количество;
			ТекущаяСтрока.Количество = ТекущаяСтрока.КоличествоПодобрано;
		ИначеЕсли СтрНачинаетсяС(Форма.ИмяФормы, "ОбщаяФорма.УточнениеСоставаУпаковкиИС") Тогда
			ПараметрыУказанияСерийКопия.ИмяТЧТовары = ИмяТЧ;
			ПараметрыУказанияСерийКопия.ИмяТЧСерии = ИмяТЧ;
			ИнтеграцияИСУТКлиентСервер.ПараметрыУказанияСерийЗаменитьИмяТЧ(ПараметрыУказанияСерийКопия);
			ТекущаяСтрока[ИмяПоляСклад] = Форма.Склад;
		ИначеЕсли ПараметрыУказанияСерийКопия <> Неопределено И Не ПустаяСтрока(ПараметрыУказанияСерийКопия.ИмяПоляСклад) Тогда
			Склад = ИсточникЗначенийВФорме[ПараметрыУказанияСерий.ИмяПоляСклад];
		КонецЕсли;
		
		СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус",
			Новый Структура("ПараметрыУказанияСерий, Склад", ПараметрыУказанияСерийКопия, Склад));
			
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "Артикул") Тогда
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ЕдиницаИзмерения") Тогда
		СтруктураДействий.Вставить("ЗаполнитьПризнакЕдиницаИзмерения", Новый Структура("Номенклатура", "ЕдиницаИзмерения"));
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "СтавкаНДС") Тогда
		ПараметрыДействия = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС();
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыДействия, Форма.Объект);
		Иначе
			ЗаполнитьЗначенияСвойств(ПараметрыДействия, Форма);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ПараметрыДействия, ТекущаяСтрока);
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПараметрыДействия);
	КонецЕсли;
	
	СтруктураПересчетаСуммы = Новый Структура;
	СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "СуммаНДС") Тогда
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "СуммаСНДС") Тогда
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "Сумма") Тогда
		СтруктураДействий.Вставить("ПересчитатьСумму");
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "Упаковка") Тогда
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "КодТНВЭД") Тогда
		СтруктураДействий.Вставить("ЗаполнитьКодТНВЭД");
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ТребуетВзвешивания") Тогда
		СтруктураДействий.Вставить("ЗаполнитьПризнакТребуетВзвешивания", Новый Структура("Номенклатура", "ТребуетВзвешивания"));
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ПроизвольнаяЕдиницаУчета") Тогда
		СтруктураДействий.Вставить("ЗаполнитьПризнакПроизвольнаяЕдиницаУчета", Новый Структура("Номенклатура", "ПроизвольнаяЕдиницаУчета"));
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "СкоропортящаясяПродукция") Тогда
		СтруктураДействий.Вставить("ЗаполнитьПризнакСкоропортящаясяПродукция", Новый Структура("Номенклатура", "СкоропортящаясяПродукция"));
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ВидПродукции") Тогда
		СтруктураДействий.Вставить("ЗаполнитьВидПродукцииИС", Новый Структура("Номенклатура", "ВидПродукции"));
	КонецЕсли;
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	Если Количество <> Неопределено Тогда
		
		ТекущаяСтрока.Количество = Количество;
		// Для обхода ошибки расчета статуса указания серий
		Если ТекущаяСтрока.СтатусУказанияСерий = 1
			И ЗначениеЗаполнено(ТекущаяСтрока.Серия) Тогда
			ТекущаяСтрока.СтатусУказанияСерий = 2;
		ИначеЕсли ТекущаяСтрока.СтатусУказанияСерий = 3
			И ЗначениеЗаполнено(ТекущаяСтрока.Серия) Тогда
			ТекущаяСтрока.СтатусУказанияСерий = 4;
		ИначеЕсли ТекущаяСтрока.СтатусУказанияСерий = 5
			И ЗначениеЗаполнено(ТекущаяСтрока.Серия) Тогда
			ТекущаяСтрока.СтатусУказанияСерий = 6;
		ИначеЕсли ТекущаяСтрока.СтатусУказанияСерий = 7
			И ЗначениеЗаполнено(ТекущаяСтрока.Серия) Тогда
			ТекущаяСтрока.СтатусУказанияСерий = 8;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьВыборДокументовМаркировки(ДанныеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ДанныеВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ИмяКоманды", "ЗаполнитьПоДокументамМаркировки");
	ПараметрыОбработки.Вставить("ДанныеВыбора", ДанныеВыбора);
	ДополнительныеПараметры.Форма.Подключаемый_ВыполнитьПереопределяемуюКомандуНаСервере(ПараметрыОбработки);
	
КонецПроцедуры

Функция ПользовательРазрешилРедактированиеРеквизита(Форма, ИмяРеквизита = "ЕдиницаИзмерения") Экспорт
	
	ЗаблокированныеРеквизиты           = ЗапретРедактированияРеквизитовОбъектовКлиент.Реквизиты(Форма, Истина);
	ПользовательРазрешилРедактирование = (ЗаблокированныеРеквизиты.Найти(ИмяРеквизита) = Неопределено);
	
	Возврат ПользовательРазрешилРедактирование;
	
КонецФункции

Процедура ЗаполнениеУпаковкиЧастичногоВыбытияПоДаннымиГИСМТ(Форма) Экспорт
	
	ПараметрыЗапроса = ИнтерфейсИСМПОбщегоНазначенияКлиент.ПараметрыЗапросаДанных();
	ПараметрыЗапроса.Параметры = Новый Структура();
	ПараметрыЗапроса.Параметры.Вставить("Номенклатура", Форма.Объект.Ссылка);
	
	ПараметрыЗавершения = Новый Структура();
	ПараметрыЗавершения.Вставить("Форма",                   Форма);
	ПараметрыЗавершения.Вставить("ПотребительскаяУпаковка", Форма.ПотребительскаяУпаковкаИС);
	ПараметрыЗавершения.Вставить("Номенклатура",            Форма.Объект.Ссылка);
	
	ПараметрыЗапроса.ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ДанныеПродукцииПоШтрихкодуЗавершение",
		ЭтотОбъект,
		ПараметрыЗавершения);
	
	ИнтерфейсИСМПОбщегоНазначенияКлиент.ЕмкостьУпаковкиПоGTIN(ПараметрыЗапроса);
	
КонецПроцедуры

Процедура ДанныеПродукцииПоШтрихкодуЗавершение(ДанныеРезультата, ПараметрыЗавершения) Экспорт
	
	Если ДанныеРезультата.ЕстьОшибки Тогда
		ПоказатьПредупреждение(, ДанныеРезультата.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ЕмкостиУпаковки = Новый Соответствие();
	Для Каждого КлючИЗначение Из ДанныеРезультата.Результат Цикл
		Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			ЕмкостиУпаковки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЕмкостьУпаковки = Неопределено;
	Если ЕмкостиУпаковки.Количество() > 1 Тогда
		Тексты = Новый Массив();
		Для Каждого КлючИЗначение Из ЕмкостиУпаковки Цикл
			Тексты.Добавить(СтрШаблон("%1: %2", КлючИЗначение.Ключ, КлючИЗначение.Значение));
		КонецЦикла;
		ПоказатьПредупреждение(, СтрШаблон(
			НСтр("ru = 'В ГИС МТ по GTIN найдено более одной емкости потребительской упаковки:
				       |%1'"),
			СтрСоединить(Тексты, Символы.ПС)));
		Возврат;
	ИначеЕсли ЕмкостиУпаковки.Количество() = 1 Тогда
		Для Каждого КлючИЗначение Из ЕмкостиУпаковки Цикл
			ЕмкостьУпаковки = КлючИЗначение.Значение;
		КонецЦикла;
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'В ГИС МТ по GTIN не найдено ни одного значения емкости потребительской упаковки.'"));
		Возврат;
	КонецЕсли;
	
	Номенклатура   = ПараметрыЗавершения.Номенклатура;
	Форма          = ПараметрыЗавершения.Форма;
	ДанныеУпаковки = ИнтеграцияИСВызовСервераУТ.ДанныеУпаковкиНоменклатурыЧастичногоВыбытия(
		Номенклатура,
		ПараметрыЗавершения.ПотребительскаяУпаковка,
		ЕмкостьУпаковки);
	
	Если ДанныеУпаковки.Упаковка = Неопределено Тогда
		
		ПараметрыСоздания = Новый Структура( );
		ПараметрыСоздания.Вставить("Владелец",              Номенклатура);
		ПараметрыСоздания.Вставить("ЗначенияЗаполнения",    Новый Структура());
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ФормаНоменклатуры", Форма);
		
		ОповещениеЗакрытияНовойУпаковки = Новый ОписаниеОповещения(
			"ЗаписьУпаковкиЧастичногоВыбытияЗавершение",
			ЭтотОбъект,
			ДополнительныеПараметры);
		
		ПараметрыСоздания.ЗначенияЗаполнения.Вставить("ТипУпаковки", ДанныеУпаковки.ТипУпаковки);
		ПараметрыСоздания.ЗначенияЗаполнения.Вставить("Числитель",   ДанныеУпаковки.Числитель);
		ПараметрыСоздания.ЗначенияЗаполнения.Вставить("Знаменатель", ДанныеУпаковки.Знаменатель);
		ПараметрыСоздания.ЗначенияЗаполнения.Вставить("КоличествоУпаковок",    ДанныеУпаковки.КоличествоУпаковок);
		ПараметрыСоздания.ЗначенияЗаполнения.Вставить("ТипИзмеряемойВеличины", ПредопределенноеЗначение("Перечисление.ТипыИзмеряемыхВеличин.Упаковка"));
		ПараметрыСоздания.ЗначенияЗаполнения.Вставить("Владелец",              Номенклатура);
		
		Если ДанныеУпаковки.ТипУпаковки = ПредопределенноеЗначение("Перечисление.ТипыУпаковокНоменклатуры.Составная") Тогда
			ПараметрыСоздания.ЗначенияЗаполнения.Вставить("Родитель", ПараметрыЗавершения.ПотребительскаяУпаковка);
		КонецЕсли;
		
		ОткрытьФорму(
			"Справочник.УпаковкиЕдиницыИзмерения.Форма.ФормаЭлементаУпаковки",
			ПараметрыСоздания,
			Форма,,,,
			ОповещениеЗакрытияНовойУпаковки,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		Оповестить("ЗаполнитьПараметрыНовойУпаковкиЧастичногоВыбытия", ПараметрыСоздания.ЗначенияЗаполнения, Форма);
		
	Иначе
		Форма.УпаковкаЧастичногоВыбытияИС = ДанныеУпаковки.Упаковка;
		Форма.Модифицированность          = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыНовойУпаковкиЧастичногоВыбытия(Форма, Параметры) Экспорт
	
	Объект                    = Форма.Объект;
	Объект.КоличествоУпаковок = Параметры.КоличествоУпаковок;
	Объект.Числитель          = Параметры.Числитель;
	Объект.Знаменатель        = Параметры.Знаменатель;
	
	Если ТипЗнч(Форма.ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры) = Тип("Структура") Тогда
		Форма.ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Вставить("ФормаУпаковки", Форма);
	КонецЕсли;
	
	Оповестить("УпаковкиНоменклатуры_ОтработатьЛогикуСвязиРеквизитов",, Форма);
	
КонецПроцедуры

Процедура ЗаписьУпаковкиЧастичногоВыбытияЗавершение(Упаковка, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ДополнительныеПараметры) <> Тип("Структура")
		Или Не ДополнительныеПараметры.Свойство("ФормаУпаковки")
		Или ДополнительныеПараметры.ФормаУпаковки.Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Упаковка = ДополнительныеПараметры.ФормаУпаковки.Объект.Ссылка;
	ДополнительныеПараметры.ФормаНоменклатуры.УпаковкаЧастичногоВыбытияИС = Упаковка;
	ДополнительныеПараметры.ФормаНоменклатуры.Модифицированность          = Истина;
	
КонецПроцедуры

Функция ЗначениеЭлементаФормыПоИмени(Элемент, Имя) Экспорт
	
	ТипЭлемента = ТипЗнч(Элемент);
	Если ТипЭлемента = Тип("ТаблицаФормы") Тогда
		Результат = Неопределено;
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			Элемент.ТекущиеДанные.Свойство(Имя, Результат);
		КонецЕсли;
		Возврат Результат;
	ИначеЕсли ТипЭлемента = Тип("ФормаКлиентскогоПриложения") Тогда
		Результат = Неопределено;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элемент, Имя) Тогда
			Результат = Элемент[Имя];
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элемент, "Объект")
			И ТипЗнч(Элемент.Объект) = Тип("ДанныеФормыСтруктура") Тогда
			Элемент.Объект.Свойство(Имя, Результат);
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	Возврат ЗначениеЭлементаФормыПоИмени(Элемент.Родитель, Имя);
	
КонецФункции

Процедура ЗаполнитьКодТНВЭДПоСтрокеПослеВыбораИзСервиса(ВыбранноеЗначение, ДанныеТекущейСтроки) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеТекущейСтроки.КодТНВЭД = ИнтеграцияИСВызовСервераУТ.ПолучитьКодТНВЭД(ВыбранноеЗначение);
	
КонецПроцедуры

Процедура УстановитьИмяФормыПроверкиСопоставлениеСырья(Форма, Параметры) Экспорт
	
	ВидыПродукцииСырье = КонструкторИСМПКлиентСервер.ВидыПродукцииСырьеГИСМТ();
	Если ВидыПродукцииСырье.Количество() Тогда
		Для Каждого СтрокаТовары Из Форма.Объект.Товары Цикл
			Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(СтрокаТовары.ВидПродукцииИС) Тогда
				Параметры.ИмяФормыПроверки = "СопоставлениеСырья";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
