
#Область ОписаниеПеременных

&НаКлиенте
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

#КонецОбласти 

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КатегорииНастроекMS = _ЛокКонтекст.КатегорииНастроекMS;
	
	НастройкиТаблиц 		= КатегорииНастроекMS.СериализуемыеНастройки;
	НастройкиПодключения 	= КатегорииНастроекMS.НастройкиПодключения;
	НастройкиНоменклатуры 	= КатегорииНастроекMS.НастройкиНоменклатуры;
	НастройкиСправочников 	= КатегорииНастроекMS.НастройкиСправочников;
		
	ПрефиксНастройкиПодключения		= "Подключение";	
	ПрефиксНастройкиСправочников 	= "Справочники";			
	ПрефиксНастройкиНоменклатуры 	= "Номенклатура";		
	ПрефиксНастройкиБП 				= "БизнесПроцессы";
	ПрефиксНастройкиТаблиц 			= "Таблица";
	ПрефиксПрочее					= "Прочее";
	
	Для каждого СтрокаНастройки Из _ЛокКонтекст.ТекущиеНастройкиMS Цикл
						
		Если ВРег(СокрЛП(СтрокаНастройки.Ключ)) = ВРег(СокрЛП("НастройкиБизнесПроцессов")) Тогда									
			
			Для каждого СтрокаБП Из СтрокаНастройки.Значение Цикл
			
				НоваяСтрока 						= Настройки.Добавить();	
				НоваяСтрока.Наименование			= СтрокаБП.Название;
				НоваяСтрока.ПолноеНаименование 		= ПрефиксНастройкиБП + "." + СтрокаБП.Название;
				НоваяСтрока.ЗначениеСоставногоТипа 	= ПоместитьВоВременноеХранилище(СтрокаБП, Новый УникальныйИдентификатор);
				НоваяСтрока.ТипЗначения				= СокрЛП(ТипЗнч(СтрокаБП));				
				
				Если ЗначениеЗаполнено(НоваяСтрока.ЗначениеСоставногоТипа) Тогда
					Если НоваяСтрока.ЗначениеСоставногоТипа <> Ложь Тогда
						НоваяСтрока.ТекущееЗначение = "Настроено";
					Иначе
						НоваяСтрока.ТекущееЗначение = "Настроить";
					КонецЕсли;				
				КонецЕсли;					
				
				ДобавитьСтрокуВТаблицуЗначений(Настройки, СтрокаБП, ПрефиксНастройкиБП + "." + СтрокаБП.Название);								
				
			КонецЦикла; 
			
		Иначе
			
			НоваяСтрока = Настройки.Добавить();
			
			Если НастройкиПодключения.Найти(СтрокаНастройки.Ключ) <> Неопределено Тогда	
				
				ПрефиксНаименования = ПрефиксНастройкиПодключения;				
				
			ИначеЕсли НастройкиСправочников.Найти(СтрокаНастройки.Ключ) <> Неопределено Тогда	
				
				ПрефиксНаименования = ПрефиксНастройкиСправочников;
				
			ИначеЕсли НастройкиНоменклатуры.Найти(СтрокаНастройки.Ключ) <> Неопределено Тогда	
				
				ПрефиксНаименования = ПрефиксНастройкиНоменклатуры;
				
			ИначеЕсли НастройкиТаблиц.Найти(СтрокаНастройки.Ключ) <> Неопределено Тогда	
				
				ПрефиксНаименования = ПрефиксНастройкиТаблиц;
				
			Иначе
				
				ПрефиксНаименования = ПрефиксПрочее;
				
			КонецЕсли;			
			
			Если НастройкиПодключения.Найти(СтрокаНастройки.Ключ) <> Неопределено Тогда	
								
				НоваяСтрока.ТолькоЧтение = Истина;
				
			КонецЕсли;					
				
			Если НастройкиТаблиц.Найти(СтрокаНастройки.Ключ) <> Неопределено Тогда	
								
				НоваяСтрока.ЗначениеСоставногоТипа = ПоместитьВоВременноеХранилище(СтрокаНастройки.Значение, Новый УникальныйИдентификатор);							
				
				Если ТипЗнч(НоваяСтрока.ЗначениеСоставногоТипа) = Тип("Массив") Тогда				
					
					Для каждого ВложеннаяСтрока Из НоваяСтрока.ЗначениеСоставногоТипа Цикл
						
						Если ВложеннаяСтрока.Свойство("ЭтоТаблицаЗначений") Тогда
							Продолжить;													
						КонецЕсли; 
						
						ДобавитьСтрокуВТаблицуЗначений(Настройки, ВложеннаяСтрока, ПрефиксНаименования, СтрокаНастройки.Ключ);
						
					КонецЦикла; 							
					
				КонецЕсли;	
								
			КонецЕсли;	
			
			НоваяСтрока.Наименование 		= СтрокаНастройки.Ключ;
			НоваяСтрока.ПолноеНаименование 	= ПрефиксНаименования + "." + СтрокаНастройки.Ключ;
			НоваяСтрока.ТекущееЗначение 	= СтрокаНастройки.Значение;						
			НоваяСтрока.ТипЗначения			= СокрЛП(ТипЗнч(СтрокаНастройки.Значение));				
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.ЗначениеСоставногоТипа) Тогда
			Если НоваяСтрока.ЗначениеСоставногоТипа <> Ложь Тогда
				НоваяСтрока.ТекущееЗначение = "Настроено";
			Иначе
				НоваяСтрока.ТекущееЗначение = "Настроить";
			КонецЕсли;				
		КонецЕсли;	
				
	КонецЦикла; 								
	
	Для каждого Строка Из Настройки Цикл
		ЗаполнитьЗначенияСвойств(КопияНастроек.Добавить(), Строка);			
	КонецЦикла; 	
		
	СкрытьПустыеЗначения = Ложь;
	
	НаложитьОтборНаТаблицуНастроек(Поиск);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПоискАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
		
	НаложитьОтборНаТаблицуНастроек(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискОчистка(Элемент, СтандартнаяОбработка)
			
	НаложитьОтборНаТаблицуНастроек();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поиск = Текст;
	
	НаложитьОтборНаТаблицуНастроек(Поиск);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПустыеЗначенияПриИзменении(Элемент)
	
	НаложитьОтборНаТаблицуНастроек(Поиск);		
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыНастройки

&НаКлиенте
Процедура НастройкиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
			
	Для каждого Ячейка Из ОформлениеСтроки.Ячейки Цикл				
		Если ДанныеСтроки.ТолькоЧтение Тогда				
			Ячейка.ТолькоПросмотр = Истина;					
		КонецЕсли; 									
	КонецЦикла;	
	
	Если ДанныеСтроки.Модифицированность Тогда
		ОформлениеСтроки.ЦветФона 	= WebЦвета.Золотой;
		ОформлениеСтроки.Шрифт 		= Новый Шрифт(ОформлениеСтроки.Шрифт,,,Истина); // жирный
	КонецЕсли;
	
	Если ДанныеСтроки.ТекущееЗначение = "Настроено" ИЛИ ДанныеСтроки.ТекущееЗначение = "Настроить" Тогда
		
		ОформлениеСтроки.Ячейки.ТекущееЗначение.Гиперссылка = Истина;
		
		Если ДанныеСтроки.ТекущееЗначение = "Настроено" Тогда
			ОформлениеСтроки.Ячейки.ТекущееЗначение.ЦветТекста = WebЦвета.Зеленый;
		Иначе	
			ОформлениеСтроки.Ячейки.ТекущееЗначение.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;  			
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьСтрокуВТаблицуЗначений(ТаблицаЗначений, Строка, ПрефиксКатегорииНастроек, ПрефиксНастройки = "", ИмяКолонкиВладельца = "")
	
	Для каждого Колонка Из Строка Цикл
			
		Если ТипЗнч(Колонка.Значение) = Тип("Массив") Тогда
						
			Для каждого ВложеннаяСтрока Из Колонка.Значение Цикл
				
				Если ВложеннаяСтрока.Свойство("ЭтоТаблицаЗначений") Тогда			
					Продолжить;			
				КонецЕсли; 				
				
				Если 	ВРег(СокрЛП(Колонка.Ключ)) = ВРег(СокрЛП("НастройкаВыгрузкиПолей"))
					ИЛИ ВРег(СокрЛП(Колонка.Ключ)) = ВРег(СокрЛП("НастройкаЗагрузкиПолей")) Тогда
					
					ИмяКолонки = Колонка.Ключ + "." + ВложеннаяСтрока.ИмяПриемника;
					
				ИначеЕсли 	ВРег(СокрЛП(Колонка.Ключ)) = ВРег(СокрЛП("НастройкаВыгрузкиТЧ"))
						ИЛИ ВРег(СокрЛП(Колонка.Ключ)) = ВРег(СокрЛП("НастройкаЗагрузкиТЧ")) Тогда	
					
					ИмяКолонки = Колонка.Ключ + "." + ВложеннаяСтрока.НастройкаТЧСтрокой;
					
				ИначеЕсли ВРег(СокрЛП(Колонка.Ключ)) = ВРег(СокрЛП("ТабличнаяЧастьДокумента1С")) Тогда
					
					ИмяКолонки = ИмяКолонкиВладельца + "." + Колонка.Ключ + "." + Строка.НастройкаТЧСтрокой + "." + ВложеннаяСтрока.ИмяПриемника;
					
				Иначе										
					
					ИмяКолонки = Колонка.Ключ;
					
				КонецЕсли;  					
				
				ДобавитьСтрокуВТаблицуЗначений(ТаблицаЗначений, ВложеннаяСтрока, ПрефиксКатегорииНастроек, ИмяКолонки, Колонка.Ключ);
				
			КонецЦикла; 			
			
		Иначе			
			
			НоваяСтрока 					= ТаблицаЗначений.Добавить();
			НоваяСтрока.Наименование 		= Колонка.Ключ;
			НоваяСтрока.ПолноеНаименование 	= ПрефиксКатегорииНастроек + "." + ?(ЗначениеЗаполнено(ПрефиксНастройки), ПрефиксНастройки + ".", "") + Колонка.Ключ;		
			НоваяСтрока.ТекущееЗначение 	= Колонка.Значение;
			НоваяСтрока.ТипЗначения			= СокрЛП(ТипЗнч(Колонка.Значение));				
			НоваяСтрока.ТолькоЧтение		= Истина;				
			
		КонецЕсли;	
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура НаложитьОтборНаТаблицуНастроек(ПодстрокаПоиска = "")

	Настройки.Очистить();
			
	Для каждого СтрокаНастройки Из КопияНастроек Цикл
		
		Если НЕ СкрытьПустыеЗначения ИЛИ СкрытьПустыеЗначения И ЗначениеЗаполнено(СтрокаНастройки.ТекущееЗначение) Тогда
			
			Если НЕ ЗначениеЗаполнено(ПодстрокаПоиска) Тогда		
				ЗаполнитьЗначенияСвойств(Настройки.Добавить(), СтрокаНастройки);
			ИначеЕсли Найти(ВРег(СокрЛП(СтрокаНастройки.ПолноеНаименование)), ВРег(СокрЛП(ПодстрокаПоиска))) ИЛИ Найти(ВРег(СокрЛП(СтрокаНастройки.ТекущееЗначение)), ВРег(СокрЛП(ПодстрокаПоиска))) Тогда					
				ЗаполнитьЗначенияСвойств(Настройки.Добавить(), СтрокаНастройки);
			КонецЕсли;		
			
		КонецЕсли;		
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти