#Область ПрограммныйИнтерфейс

// Выполняет запись ошибки в журнал регистрации, добавляя имя события ЕГАИС.
//
// Параметры:
//  ТекстОшибки - Строка - текст ошибки.
//
Процедура ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки) Экспорт
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'ЕГАИС'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,
		ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Учитываемые виды маркируемой продукции.
// 
// Возвращаемое значение:
//  ФиксированныйМассив из СправочникСсылка.ВидыПродукцииИС - Учитываемые виды маркируемой продукции
Функция УчитываемыеВидыМаркируемойПродукции() Экспорт
	
	ВидыПродукции = Новый Массив;
	Если ОбщегоНазначенияЕГАИСКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС() Тогда
		ИмяФО = "ВестиСведенияДляДекларацийПоАлкогольнойПродукции";
	Иначе
		ИмяФО = "ВестиСведенияДляДекларацийПоАлкогольнойПродукцииРМК";
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию(ИмяФО) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыПродукции, КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииЕГАИСМаркируемые());
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(ВидыПродукции);
	
КонецФункции

Функция ИспользуетсяМаркируемаяПродукция() Экспорт
	
	Возврат ОбщегоНазначенияЕГАИС.ИспользуетсяМаркируемаяПродукция();
	
КонецФункции

Функция ЭтоРасширеннаяВерсияГосИС() Экспорт
	
	Возврат ОбщегоНазначенияЕГАИС.ЭтоРасширеннаяВерсияГосИС();
	
КонецФункции

// Получает контрагента торгового объекта.
//
// Параметры:
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - Торговый объект, для которого необходимо получить контрагента.
//
// Возвращаемое значение:
//   ОпределяемыйТип.ОрганизацияКонтрагентГосИС - контрагент торгового объекта.
//
Функция КонтрагентТорговогоОбъекта(ТорговыйОбъект) Экспорт
	
	Контрагент = Неопределено;
	РаботаСКонтрагентамиЕГАИСПереопределяемый.КонтрагентТорговогоОбъекта(Контрагент, ТорговыйОбъект);
	Возврат Контрагент;
	
КонецФункции

#КонецОбласти
