#Область СлужебныйПрограммныйИнтерфейс

// Значение типа печатной формы для запроса API
//
// Параметры:
//  ТипПечатнойФормы - Перечисление.КонтурЛогистика_ТипыПечатныхФормПутыхЛистов	 - тип запрашиваемой печатной формы
// 
// Возвращаемое значение:
//  Строка - значение типа ПФ
//
Функция ЗначениеТипаПечатнойФормы(ТипПечатнойФормы) Экспорт
	
	Если ТипПечатнойФормы = Перечисления.КонтурЛогистика_ТипыПечатныхФормПутыхЛистов.ГрузовогоАвтомобиляФорма4С Тогда
		
		ЗначениеТипа = "Epl4S";
		
	ИначеЕсли ТипПечатнойФормы = Перечисления.КонтурЛогистика_ТипыПечатныхФормПутыхЛистов.ЛегковогоАвтомобиляФорма3 Тогда
		
		ЗначениеТипа = "Epl3";
		
	Иначе
		
		ЗначениеТипа = "";
		
	КонецЕсли;
	
	Возврат ЗначениеТипа;
	
КонецФункции

#КонецОбласти