// Выполняет HTTP запрос к серверу.
//
// Параметры:
//	 Метод 			  - Строка 	  - Метод запроса, например: "GET", "POST".
//	 АдресРесурса 	  - Строка 	  - Адрес ресурса, например: "https://diadoc-api.kontur.ru/GetBox"
//	 ПараметрыЗапроса - Структура - Различные параметры запроса
//	 Состав структуры:
//		Параметры		- Соответствие - (необязательный) Параметры строки запроса, где:
//											Ключ 	 - Имя параметра
//											Значение - Значение параметра
//		Заголовки		- Соответствие - (необязательный) Заголовки запроса, где:
//											Ключ 	 - Имя заголовка
//											Значение - Значение заголовка
//		ТелоЗапроса					   - (необязательный) 
//														 Примеры: Новый Структура("ДвоичныеДанные", ДвоичныеДанные)
//			  													  Новый Структура("file", ПолноеИмяФайла)
//																  Новый Структура("Файл", ПолноеИмяФайла)
//																  Новый Структура("Строка", Строка)
//																  Новый Структура("string", Строка)
//		ТелоОтвета					   - (необязательный)
//														 Примеры: Новый Структура("ДвоичныеДанные", ДвоичныеДанные)
//			  													  Новый Структура("file", ПолноеИмяФайла)
//																  Новый Структура("Файл", ПолноеИмяФайла)
//																  Новый Структура("Строка", Строка)
//																  Новый Структура("string", Строка)
Функция ВыполнитьHTTPЗапрос(Адрес, ПараметрыЗапроса) Экспорт
	
	Метод = ПараметрыЗапроса.Метод;
	
	СоставАдреса = Новый Структура;
	СоставАдреса = СтруктураURI_(Адрес);
	
	Если ПустаяСтрока(СоставАдреса.Порт) Тогда
		Протокол = ВРег(СоставАдреса.Схема);
		Если Протокол = "HTTP" Тогда
			СоставАдреса.Порт = 80;
		ИначеЕсли Протокол = "HTTPS" Тогда
			СоставАдреса.Порт = 443;
		КонецЕсли;
	КонецЕсли;
	
	Прокси = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьИнтернетПрокси();
	
	СтрокаПараметрыЗапроса = ПолучитьСтрокуПараметровHTTPЗапроса(ПараметрыЗапроса.Параметры);
	АдресРесурса = СоставАдреса.ПутьНаСервере
	+ ?(ПустаяСтрока(СтрокаПараметрыЗапроса), "", "?") + СтрокаПараметрыЗапроса;
	
	Если ВРег(СоставАдреса.Схема) = "HTTPS" Тогда
		ЗащищенноеСоединение = Вычислить("Новый ЗащищенноеСоединениеOpenSSL");
	Иначе
		ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	Таймаут = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ТаймаутHTTP");
	Если ПараметрыЗапроса.Свойство("Таймаут") Тогда
		Таймаут = ПараметрыЗапроса.Таймаут;
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение(СоставАдреса.Хост, СоставАдреса.Порт, , , Прокси, Таймаут, ЗащищенноеСоединение);
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, ПараметрыЗапроса.Заголовки);
	
	Если ПараметрыЗапроса.ТелоЗапроса.Свойство("string")
		Или ПараметрыЗапроса.ТелоЗапроса.Свойство("Строка") Тогда
		
		ТелоЗапроса = ?(
		ПараметрыЗапроса.ТелоЗапроса.Свойство("string"),
		ПараметрыЗапроса.ТелоЗапроса.string,
		ПараметрыЗапроса.ТелоЗапроса.Строка
		);
		
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, "CESU-8");
		
	ИначеЕсли ПараметрыЗапроса.ТелоЗапроса.Свойство("ДвоичныеДанные") Тогда
		
		HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ПараметрыЗапроса.ТелоЗапроса.ДвоичныеДанные);
		
	ИначеЕсли ПараметрыЗапроса.ТелоЗапроса.Свойство("файл")
		Или ПараметрыЗапроса.ТелоЗапроса.Свойство("file") Тогда
		
		ТелоЗапроса = ?(
		ПараметрыЗапроса.ТелоЗапроса.Свойство("файл"),
		ПараметрыЗапроса.ТелоЗапроса.файл,
		ПараметрыЗапроса.ТелоЗапроса.file
		);
		
		HTTPЗапрос.УстановитьИмяФайлаТела(ТелоЗапроса);
		
	КонецЕсли;
	
	Если ВРег(Метод) = "GET" Тогда
		
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		
	ИначеЕсли ВРег(Метод) = "POST" Тогда
		
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	ИначеЕсли ВРег(Метод) = "PUT" Тогда
		
		HTTPОтвет = HTTPСоединение.Записать(HTTPЗапрос);
		
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
	
	Если ПараметрыЗапроса.ТелоОтвета.Свойство("string")
		Или ПараметрыЗапроса.ТелоОтвета.Свойство("Строка") Тогда
		
		Ответ.Вставить("ТелоОтвета", HTTPОтвет.ПолучитьТелоКакСтроку());
		
	ИначеЕсли ПараметрыЗапроса.ТелоОтвета.Свойство("ДвоичныеДанные") Тогда
		
		Ответ.Вставить("ТелоОтвета", HTTPОтвет.ПолучитьТелоКакДвоичныеДанные());
	Иначе
		Ответ.Вставить("ТелоОтвета", "");
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьСтрокуПараметровHTTPЗапроса(Соответствие)
	
	Результат = "";
	
	Если ТипЗнч(Соответствие) <> Тип("Соответствие") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Разделитель = "";
	
	Для Каждого Элемент Из Соответствие Цикл
		
		Имя				= Элемент.Ключ;
		Значение		= Элемент.Значение;
		СтрокаЗначение	= Строка(Значение);
		
		Результат = Результат + Разделитель + Имя + ?(ЗначениеЗаполнено(СтрокаЗначение), "=" + СтрокаЗначение, "");
		
		Разделитель = "&";
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


// Разбирает строку URI на составные части и возвращает в виде структуры.
// На основе RFC 3986.
//
// Параметры:
//  СтрокаURI - Строка - ссылка на ресурс в формате:
//                       <схема>://<логин>:<пароль>@<хост>:<порт>/<путь>?<параметры>#<якорь>.
//
// Возвращаемое значение:
//  Структура - составные части URI согласно формату:
//   * Схема         - Строка - схема из URI.
//   * Логин         - Строка - логин из URI.
//   * Пароль        - Строка - пароль из URI.
//   * ИмяСервера    - Строка - часть <хост>:<порт> из URI.
//   * Хост          - Строка - хост из URI.
//   * Порт          - Строка - порт из URI.
//   * ПутьНаСервере - Строка - часть <путь>?<параметры>#<якорь> из URI.
//
Функция СтруктураURI_(Знач СтрокаURI) Экспорт
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	
	// Строка соединения и путь на сервере.
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
	
	// Информация пользователя и имя сервера.
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = Найти(СтрокаСоединения, "@");
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = Найти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
		Если Не КонтурЛогистика_ОбщегоНазначенияСервер.СтрокаСодержитТолькоЦифры(Порт) Тогда
			Порт = "";
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(ПустаяСтрока(Порт), Неопределено, Число(Порт)));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции

// Предназначен для последовательного чтения JSON-данных из файла или строки
//
Функция JSONПрочитать(Значение) Экспорт
	
	ЧтениеJSON = Вычислить("Новый ЧтениеJSON");
	ЧтениеJSON.УстановитьСтроку(Значение);
	Результат = Вычислить("ПрочитатьJSON(ЧтениеJSON, Истина)");
	
	Возврат Результат;
	
КонецФункции

// Получает значение заголовка
// 
// Возвращаемое значение:
//  Строка, Булево - значение заголовка.
//
Функция ПолучитьЗначениеЗаголовка(Заголовок, ВсеЗаголовки, Ключ = Неопределено) Экспорт
	
	Для Каждого ОчереднойЗаголовок Из ВсеЗаголовки Цикл
		Если НРег(ОчереднойЗаголовок.Ключ) = НРег(Заголовок) Тогда
			Ключ = ОчереднойЗаголовок.Ключ;
			Возврат ОчереднойЗаголовок.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции