#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив из Строка - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("Обеспечение");
	
КонецПроцедуры

// Возвращает параметры выбора статей в документе.
//
// Параметры:
//  ЦельЗакупки - ПеречислениеСсылка.ЦелиЗакупки - Соответствующий реквизит документа
// 
// Возвращаемое значение:
// 	См. ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики
//
Функция ПараметрыВыбораСтатейИАналитик(ЦельЗакупки) Экспорт
	
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект.Товары";
	ПараметрыВыбора.Статья = "СтатьяРасходов";
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходов";
	
	ПараметрыВыбора.ДоступностьПоОперации = ЦелиЗакупкиСКонтролемЛимитовБДР().Найти(ЦельЗакупки) <> Неопределено;
	
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("ТоварыСтатьяРасходов");
	
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("ТоварыАналитикаРасходов");
	
	Возврат ПараметрыВыбора;
	
КонецФункции

#КонецОбласти

// Инициализирует параметры, обслуживающие выбор назначений в формах документа.
//
//  Возвращаемое значение:
//  См. Справочники.Назначения.МакетФормыВыбораНазначений
//
Функция МакетФормыВыбораНазначений() Экспорт
	
	МакетФормы = Справочники.Назначения.МакетФормыВыбораНазначений();
	
	ШаблонНазначения = Справочники.Назначения.ДобавитьШаблонНазначений(МакетФормы);
	
	// Потребности в товарах на складе.
	ОписаниеКолонок = Справочники.Назначения.ДобавитьОписаниеКолонок(МакетФормы, "ОбеспечениеЗаказов", Истина, "Объект.Товары.Назначение");
	ОписаниеКолонок.Колонки.НайтиПоЗначению("Потребность").Пометка = Истина;
	ОписаниеКолонок.УсловиеИспользования = "Объект.Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)";
	
	ОписаниеКолонок.ПутиКДанным.Номенклатура     = "Объект.Товары.Номенклатура";
	ОписаниеКолонок.ПутиКДанным.Характеристика   = "Объект.Товары.Характеристика";
	ОписаниеКолонок.ПутиКДанным.Склад            = "Объект.Товары.Склад";
	ОписаниеКолонок.ПутиКДанным.Валюта           = "Объект.Валюта";
	
	// Потребности в работах в подразделении-получателе.
	ОписаниеКолонок = Справочники.Назначения.ДобавитьОписаниеКолонок(МакетФормы, "ОбеспечениеЗаказовРаботами", Истина, "Объект.Товары.Назначение");
	ОписаниеКолонок.Колонки.НайтиПоЗначению("Потребность").Пометка = Истина;
	ОписаниеКолонок.УсловиеИспользования = "Объект.Товары.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)";
	
	ОписаниеКолонок.ПутиКДанным.Номенклатура     = "Объект.Товары.Номенклатура";
	ОписаниеКолонок.ПутиКДанным.Характеристика   = "Объект.Товары.Характеристика";
	ОписаниеКолонок.ПутиКДанным.Подразделение    = "Объект.Товары.Подразделение";
	ОписаниеКолонок.ПутиКДанным.Валюта           = "Объект.Валюта";
		
	Возврат МакетФормы;
	
КонецФункции

#Область ПодключаемыеКоманды

#Область СозданиеНаОсновании

// Добавляет команду создания документа "Заявка на закупку".
//
// Параметры:
//  КомандыСозданияНаОсновании - ТаблицаЗначений - таблица команд.
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - Добавленная строка таблицы, если команда доступна
//@skip-check function-return-types
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	КомандаСоздатьНаОсновании = Неопределено;
	
	МетаданныеДокумента = Метаданные.Документы.ЗаявкаНаЗакупку;
	Если ПравоДоступа("Добавление", МетаданныеДокумента) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = МетаданныеДокумента.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(МетаданныеДокумента);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьЗаявкиНаЗакупку";
		
	КонецЕсли;
	
	Возврат КомандаСоздатьНаОсновании;
	
КонецФункции

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	ЗаявкаНаЗакупкуЛокализация.ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры);
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
		
	КомандаОтчет = Отчеты.СостояниеВыполненияДокументов.ДобавитьКомандуСостояниеВыполненияДокументЗакупки(КомандыОтчетов);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.Порядок = 1;
	КонецЕсли;
		
	КомандаОтчет = Отчеты.ОтклоненияОтУсловийЗакупок.ДобавитьКомандуОтчета(КомандыОтчетов);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.ВидимостьВФормах = "ФормаДокумента,ФормаСписка";
	КонецЕсли;
	
	
КонецПроцедуры

// Осуществляет инициализацию структуры состояния выполнения документа
//
// Возвращаемое значение:
//  Структура - см. Отчеты.СостояниеВыполненияДокументов.ИнициализироватьСтруктуруСостояниеВыполненияДокумента
//
Функция СтруктураСостояниеВыполненияДокумента() Экспорт
	
	СтруктураСостояние = Отчеты.СостояниеВыполненияДокументов.ИнициализироватьСтруктуруСостояниеВыполненияДокумента();
	СтруктураСостояние.ВыводитьТаблицуКЗаказу = 1;
	
	Возврат СтруктураСостояние;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ТекущиеДела

// Заполняет список текущих дел пользователя.
// Параметры:
//   ТекущиеДела - см. ТекущиеДелаСервер.ТекущиеДела.
//
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	ОбщиеПараметрыЗапросов = ТекущиеДелаСервер.ОбщиеПараметрыЗапросов();
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Документы.ЗаявкаНаЗакупку)
		Или Не ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаЗакупку") Тогда
		Возврат;
	КонецЕсли;
	
	Исполнитель = ОбщиеПараметрыЗапросов.Пользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЕСТЬNULL(КОЛИЧЕСТВО(ЗаявкаНаЗакупку.Ссылка), 0) КАК КоличествоЗаявок
	|ИЗ
	|	Документ.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку
	|ГДЕ
	|	ЗаявкаНаЗакупку.Исполнитель = &Исполнитель
	|	И ЗаявкаНаЗакупку.Проведен";
	
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	КоличествоЗаявокКОбработке = Выборка.КоличествоЗаявок;
	ЕстьДела = ЗначениеЗаполнено(КоличествоЗаявокКОбработке);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураБыстрогоОтбора", ОтборЗаявкиКОтработке(Исполнитель));
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ЗаявкиКОтработке");
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Проведен", Истина));
	
	ИдентификаторРодителя = "ЗаявкиНаЗакупку";
	
	ДелоРодитель = ТекущиеДела.Добавить();
	ДелоРодитель.Идентификатор  = ИдентификаторРодителя;
	ДелоРодитель.Представление  = НСтр("ru = 'Заявки на закупку'");
	ДелоРодитель.Владелец       = Метаданные.Подсистемы.Закупки;
	ДелоРодитель.ЕстьДела       = ЕстьДела;
	
	ТекущееДело = ТекущиеДела.Добавить();
	ТекущееДело.Идентификатор = "ЗаявкиНаЗакупкуКОбработке";
	ТекущееДело.Представление = НСтр("ru = 'Заявки на закупку к отработке'");
	ТекущееДело.Количество = КоличествоЗаявокКОбработке;
	ТекущееДело.Форма = "Документ.ЗаявкаНаЗакупку.ФормаСписка";
	ТекущееДело.ПараметрыФормы = ПараметрыФормы;
	ТекущееДело.Владелец = ИдентификаторРодителя;
	ТекущееДело.ЕстьДела = ЕстьДела;
		
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеПоСтатистике

// Формирует описание реквизитов объекта, заполняемых по статистике их использования.
//
// Параметры:
//  ОписаниеРеквизитов - Структура - описание реквизитов, для которых необходимо получить значения по статистике
//
//
Процедура ЗадатьОписаниеЗаполняемыхРеквизитовПоСтатистике(ОписаниеРеквизитов) Экспорт
	
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Автор";
	Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Автор";
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(ОписаниеРеквизитов,
		"Организация, Склад, Подразделение, Ответственный", Параметры);
	
КонецПроцедуры

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Возврат; // Пустой обработчик
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область УправлениеДоступом

// Описание логики ограничения доступа.
// 
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Склад)
	|	И ЗначениеРазрешено(Подразделение)";

КонецПроцедуры

#КонецОбласти

#Область ОбработкаТабличнойЧасти

#Область ЗаполнитьНалогообложениеНДСЗакупки

// Возвращает параметры заполнения реквизита "НалогообложениеНДС" для строки табличной части.
// ВАЖНО! В строку должен быть добавлен реквизит "ХозяйственнаяОперация".
// 
// Параметры:
//  СтрокаТоваров - ДанныеФормыЭлементКоллекции, СтрокаТаблицыЗначений - Строка табличной части 
//  ПараметрыДействия - Структура:
//   * Дата - Дата - Дата документа.
// 
// Возвращаемое значение:
// см. УчетНДСУПКлиентСервер.ПараметрыЗаполненияНалогообложенияНДСЗакупки
Функция ПараметрыНалогообложенияНДС(СтрокаТоваров, ПараметрыДействия) Экспорт
	
	ПараметрыЗаполнения = УчетНДСУПКлиентСервер.ПараметрыЗаполненияНалогообложенияНДСЗакупки();
	
	ПараметрыЗаполнения.Период     = ПараметрыДействия.Дата;
	ПараметрыЗаполнения.Контрагент = СтрокаТоваров.Контрагент;
	ПараметрыЗаполнения.Договор    = СтрокаТоваров.Договор;
	 
	ХозОперацииЗакупкаУПоставщика = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(
		Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
	
	ХозОперацииЗакупкаВСтранахЕАЭС = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(
		Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	
	ХозОперацииЗакупкаПоИмпорту = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(
		Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
		
	Если ХозОперацииЗакупкаУПоставщика.Найти(СтрокаТоваров.ХозяйственнаяОперация) <> Неопределено Тогда
		
		ПараметрыЗаполнения.ПриобретениеТоваров = Истина;
		ПараметрыЗаполнения.ПриобретениеРабот = Истина;
		ПараметрыЗаполнения.ПриобретениеНаСтатьи = Истина;
		
	ИначеЕсли ХозОперацииЗакупкаВСтранахЕАЭС.Найти(СтрокаТоваров.ХозяйственнаяОперация) <> Неопределено Тогда
		
		ПараметрыЗаполнения.ВвозТоваровИзТаможенногоСоюза = Истина;
		
	ИначеЕсли ХозОперацииЗакупкаПоИмпорту.Найти(СтрокаТоваров.ХозяйственнаяОперация) <> Неопределено Тогда
		
		ПараметрыЗаполнения.ИмпортТоваров = Истина;
		
	ИначеЕсли  СтрокаТоваров.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи Тогда
		
		ПараметрыЗаполнения.ПриемНаХранение = Истина;
		
	ИначеЕсли СтрокаТоваров.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаКомиссию Тогда
		
		ПараметрыЗаполнения.ПриемНаКомиссию = Истина;
		
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Содержит методы, описывающие взаимодействие заявок на закупку с заказами поставщикам
#Область ЗаказыПоставщикам

// Получает заявку на основании которой создан заказ поставщику.
// 
// Параметры:
//  ЗаказПоставщику - ДокументСсылка.ЗаказПоставщику, ДокументОбъект.ЗаказПоставщику, ДанныеФормыСтруктура - Заказ, Основание которого необходимо получить.
// 
// Возвращаемое значение:
//  ДокументСсылка.ЗаявкаНаЗакупку - Заявка-основание заказа поставщику
Функция ЗаявкаОснованиеЗаказаПоставщику(Знач ЗаказПоставщику) Экспорт
	
	ВозвращаемоеЗначение = ПустаяСсылка();
	
	Если ТипЗнч(ЗаказПоставщику) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Если ЗначениеЗаполнено(ЗаказПоставщику.ДокументОснование)
			И ТипЗнч(ЗаказПоставщику.ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаЗакупку") Тогда
			
			// Для случаев, когда создан новый объект на основании заявки.
			Возврат ЗаказПоставщику.ДокументОснование;
		
		ИначеЕсли ЗначениеЗаполнено(ЗаказПоставщику.Ссылка) Тогда
			
			// Выполнение стандартной логики поиска по запросам коммерческих предложений.
			ЗаказПоставщику = ЗаказПоставщику.Ссылка;
			
		Иначе // Новый объект, созданный не на основании заявки.
			
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отборы = НовыеОтборыПредставленийЗаявокНаЗакупку();
	УстановитьОтборПредставленийЗаявокНаЗакупку(Отборы.ЗаказПоставщику, ЗаказПоставщику);
	УстановитьОтборПредставленийЗаявокНаЗакупку(Отборы.ЗаказСозданПоЗаявке, Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаЗаказыЗаявок(Отборы, Ложь);
	УстановитьОтборыЗаявокНаЗакупкуВПараметрыЗапроса(Запрос, Отборы);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ВозвращаемоеЗначение = Выборка.ЗаявкаНаЗакупку;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Дополнить список значений с текстами запросов 
// для формирования таблицы "КЗаказу" отчета "СостояниеВыполненияДокументов".
// 
// Параметры:
//  ТекстыЗапросов - СписокЗначений из Строка - Дополняемый список текстов запросов
//  ИмяПараметраОтбораЗаявок - Строка - Имя параметра, в котором передается массив заявок на закупку в дополняемом запросе.
Процедура ДополнитьТекстЗапросаТаблицыКЗаказу(ТекстыЗапросов, ИмяПараметраОтбораЗаявок) Экспорт
	
	Отборы = НовыеОтборыПредставленийЗаявокНаЗакупку();
	УстановитьОтборПредставленийЗаявокНаЗакупку(Отборы.ЗаявкаНаЗакупку, "&" + ИмяПараметраОтбораЗаявок, Истина);
	УстановитьОтборПредставленийЗаявокНаЗакупку(Отборы.ЗаказПроведен, Истина);
	
	РазделительПакетаЗапросов = ОбщегоНазначения.РазделительПакетаЗапросов();
	
	ТекстЗапросаЗаказыЗаявок = ТекстЗапросаЗаказыЗаявок(Отборы) + РазделительПакетаЗапросов;
	ТекстЗапросаЗаявкиНаЗакупкуПриходДетально = ТекстЗапросаЗаявкиНаЗакупкуПриходДетально(Отборы) + РазделительПакетаЗапросов;
	ТекстЗапросаЗаявкиНаЗакупкуРасходДетально = ТекстЗапросаЗаявкиНаЗакупкуРасходДетально() + РазделительПакетаЗапросов;
	ТекстЗапросаЗаявкиНаЗакупкуОстаткиПоЖесткомуКлючу = ТекстЗапросаЗаявкиНаЗакупкуОстаткиПоЖесткомуКлючу() + РазделительПакетаЗапросов;
	ТекстЗапросаЗаявкиНаЗакупкуОстаткиБезСоглашений = ТекстЗапросаЗаявкиНаЗакупкуОстаткиБезСоглашений() + РазделительПакетаЗапросов;
	ТекстЗапросаЗаявкиНаЗакупкуОстаткиБезПартнеров = ТекстЗапросаЗаявкиНаЗакупкуОстаткиБезПартнеров() + РазделительПакетаЗапросов;
	ТекстЗапросаЗаявкиНаЗакупкуОстаткиОбобщенно = ТекстЗапросаЗаявкиНаЗакупкуОстаткиОбобщенно(
		"ЗаявкиНаЗакупкуОстаткиОбобщенно",
		Истина) + РазделительПакетаЗапросов;
	ТекстЗапросаТаблицаКЗаказу = ТекстЗапросаТаблицаКЗаказу() + РазделительПакетаЗапросов;
	
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаказыЗаявок,                          "ЗаказыЗаявокНаЗакупку");
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуПриходДетально,         "ЗаявкиНаЗакупкуПриходДетально");
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуРасходДетально,         "ЗаявкиНаЗакупкуРасходДетально");
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуОстаткиПоЖесткомуКлючу, "ЗаявкиНаЗакупкуОстаткиПоЖесткомуКлючу");
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуОстаткиБезСоглашений,   "ЗаявкиНаЗакупкуОстаткиБезСоглашений");
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуОстаткиБезПартнеров,    "ЗаявкиНаЗакупкуОстаткиБезПартнеров");
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуОстаткиОбобщенно,       "ЗаявкиНаЗакупкуОстаткиОбобщенно");
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблицаКЗаказу,                        "ТаблицаКЗаказу");
	
КонецПроцедуры

// Описывает заказ, который необходимо ввести по указанным строкам заявки на закупку.
// 
// Параметры:
//  ЗаявкаНаЗакупку - ДокументСсылка.ЗаявкаНаЗакупку - Основание для создаваемого заказа поставщику
//  НомераСтрок - Массив из Число - Номера строк заявки на закупку, по которым выполняется формирование заказа поставщику.
// 
// Возвращаемое значение:
//  Структура - Описание заказа к созданию:
// * ДанныеЗаказа - 
//   - Неопределено
//   - Структура:
//   ** Основание - ДокументСсылка.ЗаявкаНаЗакупку - По которой создается заказ.
//   ** Организация - СправочникСсылка.Организации
//   ** Склад - СправочникСсылка.Склады
//   ** Подразделение - СправочникСсылка.СтруктураПредприятия
//   ** Валюта - СправочникСсылка.Валюты
//   ** ЦенаВключаетНДС - Булево
//   ** Партнер - СправочникСсылка.Партнеры
//   ** Контрагент - СправочникСсылка.Контрагенты
//   ** Соглашение - СправочникСсылка.СоглашенияСПоставщиками
//   ** Договор - СправочникСсылка.ДоговорыКонтрагентов
//   ** Товары - ТаблицаЗначений:
//     *** Номенклатура - СправочникСсылка.Номенклатура
//     *** Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//     *** Назначение - СправочникСсылка.Назначения
//     *** НоменклатураПартнера - СправочникСсылка.НоменклатураКонтрагентов
//     *** ВидЦеныПоставщика - СправочникСсылка.ВидыЦенПоставщиков
//     *** Цена -Число
//     *** СтавкаНДС - СправочникСсылка.СтавкиНДС
//     *** Количество - Число
//     *** КоличествоУпаковок - Число
//     *** Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения
//     *** Склад - СправочникСсылка.Склады
//     *** Подразделение - СправочникСсылка.СтруктураПредприятия
//     *** Сумма - Число
//     *** СуммаНДС - Число
//     *** СуммаСНДС - Число
// * ОбработаноИсходныхСтрок - Число - Количество исходных строк заявки на закупку, которые будут заказаны в созданном заказе.
// * НеОбработаноИсходныхСтрок - Число - Количество исходных строк заявки на закупку, которые требуют создания заказа поставщику,
//    но не могут быть добавлены в заказ, т.к. имеют другие значения реквизитов, формирующих шапку заказа.
//
Функция ОписаниеЗаказаКСозданию(ЗаявкаНаЗакупку, НомераСтрок) Экспорт
	
	ОписаниеЗаказаКСозданию = Неопределено;
	МинимальныйНомерИсходнойСтроки = Неопределено;
	НеОбработаноСтрок = 0;
	Для Каждого ОписаниеЗаказа Из ОписаниеЗаказовКСозданию(ЗаявкаНаЗакупку, НомераСтрок) Цикл
		
		НеОбработаноСтрок = НеОбработаноСтрок + ОписаниеЗаказа.ОбработаноИсходныхСтрок;
		
		Если МинимальныйНомерИсходнойСтроки = Неопределено
			Или МинимальныйНомерИсходнойСтроки > ОписаниеЗаказа.МинимальныйНомерИсходнойСтроки Тогда
			МинимальныйНомерИсходнойСтроки = ОписаниеЗаказа.МинимальныйНомерИсходнойСтроки;
			ОписаниеЗаказаКСозданию = ОписаниеЗаказа;
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеЗаказа = Неопределено;
	ОбработаноИсходныхСтрок = 0;
	Если ОписаниеЗаказаКСозданию <> Неопределено Тогда
		ОбработаноИсходныхСтрок = ОписаниеЗаказаКСозданию.ОбработаноИсходныхСтрок;
		НеОбработаноСтрок = НеОбработаноСтрок - ОбработаноИсходныхСтрок;
		ДанныеЗаказа = ОписаниеЗаказаКСозданию.ДанныеЗаказа;
	КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ДанныеЗаказа", ДанныеЗаказа);
	ВозвращаемоеЗначение.Вставить("ОбработаноИсходныхСтрок", ОбработаноИсходныхСтрок);
	ВозвращаемоеЗначение.Вставить("НеОбработаноИсходныхСтрок", НеОбработаноСтрок);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Формирует текст запроса "остатка" по заявкам на закупку, которые обеспечивают планы закупок
// Параметры:
//  ИмяТаблицыПланов - Строка - Имя временной таблицы планов на закупку по которой выполняется поиск заявок на закупку.
//  ИмяТаблицыОстатков - Строка - Имя временной таблицы с "остатками" заявок на закупку, которая будет сформирована при выполнении возвращаемого текста запроса.
// Возвращаемое значение:
//  Строка - Текст запроса, формирующий временную таблицу с именем <ИмяТаблицыОстатков>.
Функция ТекстЗапросаОстаткиЗаявокНаЗакупкуПоПланам(ИмяТаблицыПланов, ИмяТаблицыОстатков) Экспорт
	
	НазначениеИспользования = "ОстаткиЗаявокНаЗакупкуПоПланам";
	ТекстыЗапросов = Новый Массив;
	
	// Поиск заявок выполняется с отбором по "жесткому ключу" и дате, чтобы максимально ограничить количество данных к расчету.
	// При этом дальнейший расчет остатка выполняется без учета даты, т.к. может быть ситуация когда:
	// - В месяце x-2 в заявке y1 штук
	// - В месяце x-1 в заявке y2 штук
	// - В месяце x заказе поставщику y3 штук.
	// В этом случае, если план по месяцу х-1, то остаток должен рассчитаться как y1 + y2 - y3
	// Примечание: в разрезе "жесткого ключа" используется максимальная дата в разрезе заявки.
	// Таблица сворачивается, т.к. в плане может быть несколько строк с одинаковым "жестким ключом".
	ТекстЗапросаЖесткийКлючПоПланамЗакупок = СтрЗаменить(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаЗакупкуТовары.Ссылка         КАК ЗаявкаНаЗакупку,
	|	ЗаявкаНаЗакупкуТовары.Номенклатура   КАК Номенклатура,
	|	ЗаявкаНаЗакупкуТовары.Характеристика КАК Характеристика,
	|	ЗаявкаНаЗакупкуТовары.Склад          КАК Склад,
	|	ЗаявкаНаЗакупкуТовары.Назначение     КАК Назначение,
	|	ЗаявкаНаЗакупкуТовары.Подразделение  КАК Подразделение,
	|	ЗаявкаНаЗакупкуТовары.Партнер        КАК Партнер,
	|	ЗаявкаНаЗакупкуТовары.Соглашение     КАК Соглашение
	|ПОМЕСТИТЬ ОтборПоЖесткомуКлючу
	|ИЗ
	|	Документ.ЗаявкаНаЗакупку.Товары КАК ЗаявкаНаЗакупкуТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТаблицыПланов КАК ИмяТаблицыПланов
	|		ПО (ЗаявкаНаЗакупкуТовары.ЖелаемаяДатаПоступления МЕЖДУ ИмяТаблицыПланов.ДатаПоступления И ИмяТаблицыПланов.ОкончаниеПериодаПоступления)
	|			И ЗаявкаНаЗакупкуТовары.Номенклатура = ИмяТаблицыПланов.Номенклатура
	|			И ЗаявкаНаЗакупкуТовары.Характеристика = ИмяТаблицыПланов.Характеристика
	|			И (НЕ &ПланированиеПоНазначениям
	|				ИЛИ ИмяТаблицыПланов.Назначение = ЗаявкаНаЗакупкуТовары.Назначение)
	|			И (ИмяТаблицыПланов.Склад В (ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), ЗаявкаНаЗакупкуТовары.Склад))
	|			И (ИмяТаблицыПланов.ПартнерПлан В (ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка), ЗаявкаНаЗакупкуТовары.Партнер))
	|			И (ИмяТаблицыПланов.СоглашениеПлан = ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка)
	|				ИЛИ ИмяТаблицыПланов.Соглашение = ЗаявкаНаЗакупкуТовары.Соглашение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку
	|		ПО ЗаявкаНаЗакупкуТовары.Ссылка = ЗаявкаНаЗакупку.Ссылка
	|ГДЕ
	|	ИмяТаблицыПланов.Подразделение В (ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка), ЗаявкаНаЗакупку.Подразделение)
	|	И ЗаявкаНаЗакупку.Проведен
	|	И НЕ ЗаявкаНаЗакупкуТовары.Отменено",
	"ИмяТаблицыПланов",
	ИмяТаблицыПланов);
	
	ТекстыЗапросов.Добавить(ТекстЗапросаЖесткийКлючПоПланамЗакупок);
	
	Отборы = НовыеОтборыПредставленийЗаявокНаЗакупку();
	УстановитьОтборПредставленийЗаявокНаЗакупку(Отборы.ЗаявкаПроведена, Истина);
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуПриходДетально(
		Отборы,
		НазначениеИспользования,
		"ОтборПоЖесткомуКлючу")); // Основные отборы накладываются по входной таблице.
		
	Отборы = НовыеОтборыПредставленийЗаявокНаЗакупку();
	УстановитьОтборПредставленийЗаявокНаЗакупку(Отборы.ЗаявкаНаЗакупку,
		"ВЫБРАТЬ т.ЗаявкаНаЗакупку ИЗ ЗаявкиНаЗакупкуПриходДетально КАК т", // Работа с заявками, найденными по планам.
		Истина);
	УстановитьОтборПредставленийЗаявокНаЗакупку(Отборы.ЗаказПроведен, Истина);
	
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаказыЗаявок(Отборы));
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуРасходДетально());
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуОстаткиПоЖесткомуКлючу());
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуОстаткиБезСоглашений());
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуОстаткиБезПартнеров());
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуОстаткиОбобщенно(ИмяТаблицыОстатков));
	
	ТекстЗапроса = СтрСоединить(
		ТекстыЗапросов,
		ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует текст, который необходимо подставить в результирующий запрос схемы компоновки данных в качестве используемой таблицы,
// чтобы при расчете остатка с помощью "ТекстЗапросаОстаткиЗаявокНаЗакупкуПоПланам" сохранить корректные группировки, т.к.
// СКД оптимизирует запрос и ссылка на документ не попадает в группировки промежуточных ВТ.
// В результате максимальная дата вычисляется не в разрезе заявки, а в менее детальном разрезе.
// Добавляем использование поля для отключения этой оптимизации.
// 
// Параметры:
//   ИмяТаблицыОстатков - Строка - См. ТекстЗапросаОстаткиЗаявокНаЗакупкуПоПланам.ИмяТаблицыОстатков
//
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстИспользованияПромежуточныхПолейФормированияОстатка(ИмяТаблицыОстатков) Экспорт
	
	Возврат СтрЗаменить(
	"(ВЫБРАТЬ
	|СУММА(0) КАК НеиспользуемоеПоле
	|ИЗ
	|	ИмяТаблицыОстатков КАК ИмяТаблицыОстатков
	|ГДЕ
	|	ЛОЖЬ
	|	И ИмяТаблицыОстатков.ЗаявкаНаЗакупку = NULL)",
	"ИмяТаблицыОстатков",
	ИмяТаблицыОстатков);
	
КонецФункции

// Проверяет наличие незаказанных строк в заявке на закупку.
//
// Параметры:
//   Объект - ДокументОбъект.ЗаявкаНаЗакупку, ДанныеФормыСтруктура - объект заявки на закупку
//
// Возвращаемое значение:
//   Булево - признак наличия незаказанных строк
Функция ЕстьНезаказанныеСтроки(Объект) Экспорт
	
	ОстаткиПострочно = Неопределено;
	Если ЗначениеЗаполнено(Объект.Ссылка) И Объект.Проведен Тогда
		ОстаткиПострочно = ОстаткиЗаявокПострочно(Объект).Получить(Объект.Ссылка);
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(ОстаткиПострочно);
	
КонецФункции

// Отменяет незаказанные строки в заявке на закупку.
//
// Параметры:
//   Объект - ДокументОбъект.ЗаявкаНаЗакупку, ДанныеФормыСтруктура - объект заявки на закупку
//
// Возвращаемое значение:
//   Структура:
//    * СтрокиСИзменениемКоличества - Массив Из ДокументТабличнаяЧастьСтрока.ЗаявкаНаЗакупку.Товары - Строки товаров, в которых изменилось количество.
//    * ОтмененныеСтроки - Массив Из ДокументТабличнаяЧастьСтрока.ЗаявкаНаЗакупку.Товары - Строки товаров, в которых установлен флаг "отменено"
//    * ИзмененныеСтроки - Массив Из ДокументТабличнаяЧастьСтрока.ЗаявкаНаЗакупку.Товары - Содержит "СтрокиСИзменениемКоличества" и "ОтмененныеСтроки".
Функция ОтменитьНезаказанныеСтроки(Объект) Экспорт
	
	ОстаткиПострочно = Неопределено;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОстаткиПострочно = ОстаткиЗаявокПострочно(Объект).Получить(Объект.Ссылка);
	КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("СтрокиСИзменениемКоличества", Новый Массив);
	ВозвращаемоеЗначение.Вставить("ОтмененныеСтроки", Новый Массив);
	ВозвращаемоеЗначение.Вставить("ИзмененныеСтроки", Новый Массив);
	
	Для ОбратныйИндекс = -Объект.Товары.Количество() + 1 По 0 Цикл
		
		СтрокаТоваров = Объект.Товары[-ОбратныйИндекс];
		
		Если ОстаткиПострочно = Неопределено Тогда
			
			// Ссылка не создана, значит заказов нет и остаток = текущему значению.
			Остаток = СтрокаТоваров.Количество;
			
		Иначе
			
			Остаток = ОстаткиПострочно.Получить(СтрокаТоваров.НомерСтроки);
			Если Остаток = Неопределено Тогда
				// По строке оформлены заказы, действия не требуются.
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Остаток = СтрокаТоваров.Количество Тогда
			
			СтрокаТоваров.Отменено = Истина;
			
			ВозвращаемоеЗначение.ОтмененныеСтроки.Добавить(СтрокаТоваров);
			ВозвращаемоеЗначение.ИзмененныеСтроки.Добавить(СтрокаТоваров);
			
		Иначе // Разбивка строки на две:
			
			СтрокаТоваров.Количество = СтрокаТоваров.Количество - Остаток;
			
			ВозвращаемоеЗначение.СтрокиСИзменениемКоличества.Добавить(СтрокаТоваров);
			ВозвращаемоеЗначение.ИзмененныеСтроки.Добавить(СтрокаТоваров);
			
			ОтмененнаяСтрока = Объект.Товары.Вставить(СтрокаТоваров.НомерСтроки);
			ЗаполнитьЗначенияСвойств(ОтмененнаяСтрока, СтрокаТоваров);
			ОтмененнаяСтрока.Отменено = Истина;
			ОтмененнаяСтрока.Количество = Остаток;
			
			ВозвращаемоеЗначение.СтрокиСИзменениемКоличества.Добавить(ОтмененнаяСтрока);
			ВозвращаемоеЗначение.ОтмененныеСтроки.Добавить(ОтмененнаяСтрока);
			ВозвращаемоеЗначение.ИзмененныеСтроки.Добавить(ОтмененнаяСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Действия = Новый Структура;
	Действия.Вставить("ПересчитатьКоличествоУпаковок", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаКоличестваУпаковок());
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ЗаявкаНаЗакупкуКлиентСервер.ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС), Истина);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ВозвращаемоеЗначение.СтрокиСИзменениемКоличества,
		Действия,
		Объект.Товары,
		ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения());
		
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область ЛимитыБДР

// Возвращает флаг о необходимости проверять лимиты БДР в заявке на закупку.
// 
// Параметры:
//  ЗаявкаНаЗакупку - ДокументОбъект.ЗаявкаНаЗакупку, ДанныеФормыСтруктура - Заявка на закупку
// 
// Возвращаемое значение:
//  Булево
Функция КонтролироватьЛимитыБДР(ЗаявкаНаЗакупку) Экспорт
	
	Возврат ИспользоватьЛимитыБДР()
		И ЦелиЗакупкиСКонтролемЛимитовБДР().Найти(ЗаявкаНаЗакупку.ЦельЗакупки) <> Неопределено;
	
КонецФункции

// Цели закупки по которым выполняется контроль лимитов БДР
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ЦелиЗакупки
Функция ЦелиЗакупкиСКонтролемЛимитовБДР() Экспорт

	ВозвращаемоеЗначение = Новый Массив;
	
	Если ИспользоватьЛимитыБДР() Тогда
		ВозвращаемоеЗначение.Добавить(Перечисления.ЦелиЗакупки.СобственныеНужды);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;

КонецФункции

// Возвращает флаг использования лимитов БДР в заявках на закупку.
// 
// Возвращаемое значение:
//  Булево
Функция ИспользоватьЛимитыБДР() Экспорт
	
	ВозвращаемоеЗначение = Ложь;
	
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Текст для вывода ошибки при создании перечня документов.
// Выводится из обработок в случае, 
// если есть документы с незаполненными обязательными реквизитами контроля лимитов БДР,
// чтобы не выводить множество однотипных ошибок. 
// 
// Возвращаемое значение:
//  Строка - Текст ошибки лимитов БДР
Функция ТекстОшибкиЛимитовБДР() Экспорт
	
	Возврат НСтр("ru = 'Необходимо заполнить реквизиты контроля лимитов и провести документы'");
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Отборы

Функция ОтборЗаявкиКОтработке(Исполнитель)
	
	ОтборСписка = НовыйОтборСписка();
	ОтборСписка.Исполнитель.Добавить(Исполнитель);
	
	Возврат ОтборСписка;
	
КонецФункции

// Структура быстрого отбора динамического списка. 
// 
// Возвращаемое значение:
//  Структура - Новый отбор списка:
// * Менеджер - СписокЗначений из СправочникСсылка.Пользователи 
// * Исполнитель - СписокЗначений из СправочникСсылка.Пользователи 
// * Ответственный - СписокЗначений из СправочникСсылка.Пользователи
// * Статус - СписокЗначений из ПеречислениеСсылка.СтатусыЗаявокНаЗакупку
// * Автор - СписокЗначений из СправочникСсылка.Пользователи
Функция НовыйОтборСписка() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Менеджер", Новый СписокЗначений);
	ВозвращаемоеЗначение.Вставить("Исполнитель", Новый СписокЗначений);
	ВозвращаемоеЗначение.Вставить("Ответственный", Новый СписокЗначений);
	ВозвращаемоеЗначение.Вставить("Статус", Новый СписокЗначений);
	ВозвращаемоеЗначение.Вставить("Автор", Новый СписокЗначений);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область Проведение

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументОбъект.ЗаявкаНаЗакупку, ДокументСсылка.ЗаявкаНаЗакупку - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - см. ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения
//
// Возвращаемое значение:
//  Структура - коллекция элементов - таблиц значений - данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;

	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаЗакупку") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
	КонецЕсли;
	
	ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры);
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	 
КонецПроцедуры

Процедура ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры)
	
	ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата КАК Период,
		|	ТабЧасть.Номенклатура КАК Номенклатура,
		|	ТабЧасть.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТабЧасть.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|			ТОГДА ТабЧасть.Подразделение
		|		ИНАЧЕ ТабЧасть.Склад
		|	КОНЕЦ КАК Склад,
		|	ТабЧасть.Назначение КАК Назначение,
		|	ЛОЖЬ КАК ПроконтролироватьКачество,
		|	ЛОЖЬ КАК ПодлежитРазблокировке,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПодтвержденияКачества,
		|	ТабЧасть.Количество КАК Количество,
		|	ТабЧасть.Ссылка КАК Заказ,
		|	ТабЧасть.ЖелаемаяДатаПоступления КАК ДатаПоступления,
		|	ЛОЖЬ КАК ДоступенДляРасхода,
		|	ЛОЖЬ КАК ПоГрафику,
		|	НЕОПРЕДЕЛЕНО КАК РаспоряжениеВГрафике,
		|	0 КАК КоличествоВГрафике
		|ИЗ
		|	Документ.ЗаявкаНаЗакупку.Товары КАК ТабЧасть
		|ГДЕ
		|	НЕ ТабЧасть.Отменено";
	
	РаспределениеЗапасовДвижения.ЗапланироватьПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть, Ложь, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Имена реквизитов условий закупки.
// 
// Возвращаемое значение:
//  Массив Из Строка - Имена реквизитов условий закупки
Функция ИменаРеквизитовУсловийЗакупки() Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	
	ВозвращаемоеЗначение.Добавить("Партнер");
	ВозвращаемоеЗначение.Добавить("Контрагент");
	ВозвращаемоеЗначение.Добавить("Соглашение");
	ВозвращаемоеЗначение.Добавить("Договор");
	ВозвращаемоеЗначение.Добавить("Цена");
	ВозвращаемоеЗначение.Добавить("Сумма");
	ВозвращаемоеЗначение.Добавить("СтавкаНДС");
	ВозвращаемоеЗначение.Добавить("СуммаНДС");
	
	Возврат ВозвращаемоеЗначение; 
	
КонецФункции

// Описывает хозяйственные операции соглашений, доступные к выбору в заявке на закупку.
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ХозяйственныеОперации - Доступные операции.
Функция ДоступныеОперацииСоглашений() Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	
	ВозвращаемоеЗначение.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
	ВозвращаемоеЗначение.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
	ВозвращаемоеЗначение.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// В документе отсутствует хоз. операция и, соответственно, отбор договоров по ней.
// В случае, если соглашение в строке указано, то отбор будет выполняться по хоз. операции из соглашения.
// Но если соглашение не указано, то необходимо ограничить выбор договорами закупки. Для этого используется отбор по типу.
// 
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.ТипыДоговоров
Функция ДоступныеТипыДоговоров() Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	
	ВозвращаемоеЗначение.Добавить(Перечисления.ТипыДоговоров.СПоставщиком);
	ВозвращаемоеЗначение.Добавить(Перечисления.ТипыДоговоров.Импорт);
	ВозвращаемоеЗначение.Добавить(Перечисления.ТипыДоговоров.ВвозИзЕАЭС);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Определяет имена реквизитов, которые участвуют в списании лимитов по документу.
// 
// Возвращаемое значение:
//  Массив из Строка - Имена реквизитов.
//
Функция ИменаРеквизитовАналитикЛимитирования() Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	
	ВозвращаемоеЗначение.Добавить("Товары.СтатьяБюджетов");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область ЗаказыПоставщикам

// Формирует описание заказов поставщику к созданию на основании заявки на закупку.
//
// Параметры:
//   ЗаявкаНаЗакупку - ДокументСсылка.ЗаявкаНаЗакупку - ссылка на документ Заявка на закупку
//   НомераСтрок - Массив из Число - номера строк табличной части Товары.
//
// Возвращаемое значение:
//   Массив Из Структура - массив структур с описанием заказов к созданию
Функция ОписаниеЗаказовКСозданию(ЗаявкаНаЗакупку, НомераСтрок)
	
	#Область ТекстЗапроса
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Остатки.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку,
	|	Остатки.НомерСтроки КАК НомерСтроки,
	|	Остатки.Количество КАК Количество
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	&Остатки КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Шапка.Ссылка                                     КАК Основание,
	|	ТабличнаяЧасть.Номенклатура                      КАК Номенклатура,
	|	ТабличнаяЧасть.Характеристика                    КАК Характеристика,
	|	ТабличнаяЧасть.Назначение                        КАК Назначение,
	|	Шапка.Организация                                КАК Организация,
	|	ТабличнаяЧасть.Склад                             КАК Склад,
	|	ТабличнаяЧасть.Подразделение                     КАК Подразделение,
	|	Шапка.Валюта                                     КАК Валюта,
	|	Шапка.ЦенаВключаетНДС                            КАК ЦенаВключаетНДС,
	|	ТабличнаяЧасть.Партнер                           КАК Партнер,
	|	ТабличнаяЧасть.Контрагент                        КАК Контрагент,
	|	ТабличнаяЧасть.Соглашение                        КАК Соглашение,
	|	ТабличнаяЧасть.Договор                           КАК Договор,
	|	ТабличнаяЧасть.НоменклатураПартнера              КАК НоменклатураПартнера,
	|	ТабличнаяЧасть.ВидЦеныПоставщика                 КАК ВидЦеныПоставщика,
	|	ТабличнаяЧасть.Цена                              КАК Цена,
	|	ТабличнаяЧасть.СтавкаНДС                         КАК СтавкаНДС,
	|	ТабличнаяЧасть.НомерСтроки                       КАК НомерСтроки,
	|	Остатки.Количество                               КАК Количество,
	|	ТабличнаяЧасть.Упаковка                          КАК Упаковка,
	|	Шапка.Подразделение                              КАК ПодразделениеШапки,
	|	Шапка.Склад                                      КАК СкладШапки,
	|	ТабличнаяЧасть.Сумма                             КАК Сумма,
	|	ТабличнаяЧасть.СуммаНДС                          КАК СуммаНДС,
	|	ТабличнаяЧасть.СуммаСНДС                         КАК СуммаСНДС,
	|	ТабличнаяЧасть.КоличествоУпаковок                КАК КоличествоУпаковок,
	|	Остатки.Количество <> ТабличнаяЧасть.Количество  КАК ТребуетсяПересчет,
	|	
	|	// Договоры с порядком расчетов ""ПоДоговорамКонтрагентов"" устанавливают Н.Д. в заказе, не позволяют его изменить и используют его в качестве отбора по назначениям.
	|	// В остальных случаях Н.Д. в заказе не используется, либо может быть очищено для выбора любого назначения.
	|	ВЫБОР КОГДА ЕСТЬNULL(ДоговорыКонтрагентов.ПорядокРасчетов,
	|				ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов) ТОГДА
	|		ДоговорыКонтрагентов.НаправлениеДеятельности
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ                                            КАК НаправлениеДеятельности,
	|	
	|	&ИспользоватьУчетПрочихДоходовРасходов И ТабличнаяЧасть.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|                                                    КАК СписатьНаРасходы
	|ИЗ
	|	Документ.ЗаявкаНаЗакупку.Товары КАК ТабличнаяЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаЗакупку КАК Шапка
	|		ПО ТабличнаяЧасть.Ссылка = Шапка.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ТабличнаяЧасть.Ссылка = Остатки.ЗаявкаНаЗакупку
	|			И ТабличнаяЧасть.НомерСтроки = Остатки.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ТабличнаяЧасть.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &ЗаявкаНаЗакупку
	|	И ТабличнаяЧасть.НомерСтроки В(&НомераСтрок)";
	#КонецОбласти

	ПоляШапки = Новый Массив;
	ПоляШапки.Добавить("Основание");
	ПоляШапки.Добавить("Организация");
	ПоляШапки.Добавить("СкладШапки");
	ПоляШапки.Добавить("ПодразделениеШапки");
	ПоляШапки.Добавить("Валюта");
	ПоляШапки.Добавить("ЦенаВключаетНДС");
	ПоляШапки.Добавить("Партнер");
	ПоляШапки.Добавить("Контрагент");
	ПоляШапки.Добавить("Соглашение");
	ПоляШапки.Добавить("Договор");
	ПоляШапки.Добавить("НаправлениеДеятельности");
	
	ИсключаемыеКолонкиТаблицы = Новый Массив;
	ИсключаемыеКолонкиТаблицы.Добавить("НомерСтроки");
	ИсключаемыеКолонкиТаблицы.Добавить("ТребуетсяПересчет");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИсключаемыеКолонкиТаблицы, ПоляШапки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	" + СтрСоединить(ПоляШапки, ",
	|	") + ",
	|	НомерСтроки"; // Для получение минимальной строки, попавшей в заказ.
	
	Запрос.УстановитьПараметр("Остатки", ТаблицаОстатковЗаявокПострочно(ЗаявкаНаЗакупку));
	Запрос.УстановитьПараметр("ЗаявкаНаЗакупку", ЗаявкаНаЗакупку);
	Запрос.УстановитьПараметр("НомераСтрок", НомераСтрок);
	Запрос.УстановитьПараметр("ИспользоватьУчетПрочихДоходовРасходов", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихДоходовРасходов"));
	
	ИсходныеДанные = Запрос.Выполнить().Выгрузить();
	КэшируемыеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ТребуетсяПересчет", Истина);
	СтруктураПоиска.Вставить("ЦенаВключаетНДС", Ложь);
	
	ЗначенияЦенаВключаетНДС = Новый Массив;
	ЗначенияЦенаВключаетНДС.Добавить(Ложь);
	ЗначенияЦенаВключаетНДС.Добавить(Истина);
	
	Для Каждого ЦенаВключаетНДС Из ЗначенияЦенаВключаетНДС Цикл
		
		СтруктураПоиска.ЦенаВключаетНДС = ЦенаВключаетНДС;
		НайденныеСтроки = ИсходныеДанные.НайтиСтроки(СтруктураПоиска);
		
		Действия = Новый Структура;
		Действия.Вставить("ПересчитатьКоличествоУпаковок", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаКоличестваУпаковок());
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ЗаявкаНаЗакупкуКлиентСервер.ДействияПересчетаСуммы(ЦенаВключаетНДС), Истина);
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
			НайденныеСтроки,
			Действия,
			ИсходныеДанные,
			КэшируемыеЗначения);
		
	КонецЦикла;
	
	Переименования = Новый Структура;
	Переименования.Вставить("СкладШапки", "Склад");
	Переименования.Вставить("ПодразделениеШапки", "Подразделение");
	
	ДанныеЗаказов = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(ИсходныеДанные, СтрСоединить(ПоляШапки, ", "));
	ОписаниеЗаказов = Новый Массив;
	Для Каждого КлючИТаблица Из ДанныеЗаказов Цикл
		
		ДанныеЗаказа = Новый Структура;
		Для Каждого ПолеКлюча Из КлючИТаблица.Ключ Цикл
			
			ИмяПоля = ПолеКлюча.Ключ;
			ИмяПоля = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Переименования, ИмяПоля, ИмяПоля);
			
			ДанныеЗаказа.Вставить(ИмяПоля, ПолеКлюча.Значение);
			
		КонецЦикла;
		
		Товары = КлючИТаблица.Таблица;
		ДанныеЗаказа.Вставить("Товары", Товары);
		
		ОписаниеЗаказа = Новый Структура;
		ОписаниеЗаказа.Вставить("ДанныеЗаказа", ДанныеЗаказа);
		ОписаниеЗаказа.Вставить("МинимальныйНомерИсходнойСтроки", Товары[0].НомерСтроки);
		Товары.Колонки.Удалить("НомерСтроки");
		
		ОписаниеЗаказа.Вставить("ОбработаноИсходныхСтрок", Товары.Количество());
		
		ОписаниеЗаказов.Добавить(ОписаниеЗаказа);
		
	КонецЦикла;
	
	Возврат ОписаниеЗаказов;
	
КонецФункции

// Описание связи между заявками на закупку и заказами поставщикам.
// 
// Параметры:
// Отборы - См. НовыеОтборыПредставленийЗаявокНаЗакупку
//  ПомещатьВоВременнуюТаблицу - Булево - Определяет необходимость создания временной таблицы "ЗаказыЗаявок"
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаЗаказыЗаявок(Отборы, ПомещатьВоВременнуюТаблицу = Истина)
		
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
	|	ДокументЗаказПоставщику.ДокументОснование КАК ЗаявкаНаЗакупку
	|ПОМЕСТИТЬ ЗаказыЗаявок
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ДокументЗаказПоставщику
	|ГДЕ
	|	&ДоступныеОтборы";
	
	Если Не ПомещатьВоВременнуюТаблицу Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ПОМЕСТИТЬ ЗаказыЗаявок",
			"");
	КонецЕсли;
	
	ДоступныеОтборы = НовыеДоступныеОтборыЗаявокНаЗакупку();
	ДоступныеОтборы.ЗаявкаНаЗакупку = "ДокументЗаказПоставщику.ДокументОснование";
	ДоступныеОтборы.ЗаказПоставщику = "ДокументЗаказПоставщику.Ссылка";
	ДоступныеОтборы.ЗаказСозданПоЗаявке = "ДокументЗаказПоставщику.ДокументОснование ССЫЛКА Документ.ЗаявкаНаЗакупку";
	ДоступныеОтборы.ЗаказПроведен = "ДокументЗаказПоставщику.Проведен";
	ТекстЗапроса = УстановитьОтборыЗаявокНаЗакупкуВТекстеЗапроса(ТекстЗапроса, Отборы, ДоступныеОтборы);
	
	ДоступныеОтборы = НовыеДоступныеОтборыЗаявокНаЗакупку();
	ЗаявкаНаЗакупкуЛокализация.ДополнитьТекстЗапросаЗаказыЗаявок(ТекстЗапроса, ДоступныеОтборы);
	ТекстЗапроса = УстановитьОтборыЗаявокНаЗакупкуВТекстеЗапроса(ТекстЗапроса, Отборы, ДоступныеОтборы);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Потребность в закупке, сформированная заявками на закупку.
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаЗаявкиНаЗакупкуПриходДетально(Отборы, НазначениеИспользования = "", ОписаниеИсточника = Неопределено)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаявкаНаЗакупкуТовары.Ссылка               КАК ЗаявкаНаЗакупку,
	|	ЗаявкаНаЗакупкуТовары.Номенклатура         КАК Номенклатура,
	|	ЗаявкаНаЗакупкуТовары.Характеристика       КАК Характеристика,
	|	ЗаявкаНаЗакупкуТовары.Назначение           КАК Назначение,
	|	ЗаявкаНаЗакупкуШапка.Организация           КАК Организация,
	|	ЗаявкаНаЗакупкуТовары.Склад                КАК Склад,
	|	ЗаявкаНаЗакупкуТовары.Подразделение        КАК Подразделение,
	|	ЗаявкаНаЗакупкуТовары.Партнер              КАК Партнер,
	|	ЗаявкаНаЗакупкуТовары.Соглашение           КАК Соглашение,
	|	ЗаявкаНаЗакупкуТовары.Контрагент           КАК Контрагент,
	|	ЗаявкаНаЗакупкуТовары.Договор              КАК Договор,
	|	ЗаявкаНаЗакупкуШапка.Валюта                КАК Валюта,
	|	ЗаявкаНаЗакупкуШапка.ЦенаВключаетНДС       КАК ЦенаВключаетНДС,
	|	ЗаявкаНаЗакупкуТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ЗаявкаНаЗакупкуТовары.ВидЦеныПоставщика    КАК ВидЦеныПоставщика,
	|	ЗаявкаНаЗакупкуТовары.Цена                 КАК Цена,
	|	ЗаявкаНаЗакупкуТовары.СтавкаНДС            КАК СтавкаНДС,
	|	ЗаявкаНаЗакупкуТовары.НомерСтроки          КАК НомерСтроки,
	|	ЗаявкаНаЗакупкуТовары.Количество           КАК Количество,
	|	ЗаявкаНаЗакупкуТовары.Упаковка             КАК Упаковка,
	|	ЗаявкаНаЗакупкуШапка.Подразделение         КАК ПодразделениеШапки,
	|	ЗаявкаНаЗакупкуШапка.Склад                 КАК СкладШапки,
	|	ВЫБОР
	|		КОГДА ЗаявкаНаЗакупкуТовары.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЗаявкаНаЗакупкуШапка.Дата
	|		ИНАЧЕ ЗаявкаНаЗакупкуТовары.ЖелаемаяДатаПоступления
	|	КОНЕЦ                                  КАК ДатаПоступления
	|ПОМЕСТИТЬ ЗаявкиНаЗакупкуПриходДетально
	|ИЗ
	|	Документ.ЗаявкаНаЗакупку.Товары КАК ЗаявкаНаЗакупкуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупкуШапка
	|		ПО ЗаявкаНаЗакупкуТовары.Ссылка = ЗаявкаНаЗакупкуШапка.Ссылка
	|			И (&СвязьСТаблицейОтборов)
	|ГДЕ
	|	НЕ ЗаявкаНаЗакупкуТовары.Отменено
	|	И &ДоступныеОтборы";
	
	ДоступныеОтборы = НовыеДоступныеОтборыЗаявокНаЗакупку();
	ДоступныеОтборы.ЗаявкаНаЗакупку = "ЗаявкаНаЗакупкуТовары.Ссылка";
	ДоступныеОтборы.ЗаявкаПроведена = "ЗаявкаНаЗакупкуШапка.Проведен";
	ТекстЗапроса = УстановитьОтборыЗаявокНаЗакупкуВТекстеЗапроса(ТекстЗапроса, Отборы, ДоступныеОтборы);
	
	ТекстСвязиСТаблицейОтборов = "";
	Если НазначениеИспользования = "ОстаткиЗаявокНаЗакупкуПоПланам" Тогда
		
		ИмяТаблицыОтбора = ОписаниеИсточника; // Имя временной таблицей с жестким ключом.
		ТекстСвязиСТаблицейОтборов = СтрЗаменить(
		"ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТаблицыОтбора КАК ИмяТаблицыОтбора
		|		ПО ЗаявкаНаЗакупкуТовары.Номенклатура      = ИмяТаблицыОтбора.Номенклатура
		|			И ЗаявкаНаЗакупкуТовары.Характеристика = ИмяТаблицыОтбора.Характеристика
		|			И ЗаявкаНаЗакупкуТовары.Склад          = ИмяТаблицыОтбора.Склад
		|			И ЗаявкаНаЗакупкуТовары.Назначение     = ИмяТаблицыОтбора.Назначение
		|			И ЗаявкаНаЗакупкуТовары.Подразделение  = ИмяТаблицыОтбора.Подразделение
		|			И ИмяТаблицыОтбора.Партнер В (ЗаявкаНаЗакупкуТовары.Партнер,
		|			                                   ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)) 
		|			И ИмяТаблицыОтбора.Соглашение В (ЗаявкаНаЗакупкуТовары.Соглашение,
		|			                                      ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка))",
		"ИмяТаблицыОтбора",
		ИмяТаблицыОтбора);
		
		// Пустой в плане -- > Нет отбора
		// Заполненный в плане --> 
		
	ИначеЕсли НазначениеИспользования = "ПоОбъекту" Тогда
		
		// Заменяем получение данных "по ссылке" на передачу данных через параметры:
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ЗаявкаНаЗакупку.Товары", "&Товары");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗаявкаНаЗакупкуШапка.", "&");
		
		// Удаляем лишние связи, оставляя только таблицу товаров:
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		ЗапросПакета = СхемыЗапросов.ЗапросПакетаЗапросов(СхемаЗапроса);
		
		Для Каждого ОператорВыбора Из ЗапросПакета.Операторы Цикл
			
			Для ОбратныйИндекс = -ОператорВыбора.Источники.Количество() + 1 По 0 Цикл
				
				Индекс = -ОбратныйИндекс;
				ОписаниеИсточника = ОператорВыбора.Источники.Получить(Индекс);
				
				Если ТипЗнч(ОписаниеИсточника) <> Тип("ИсточникСхемыЗапроса")
					Или ОписаниеИсточника.Источник.ИмяТаблицы  <> "&Товары" Тогда
					ОператорВыбора.Источники.Удалить(Индекс);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
		
	ИначеЕсли НазначениеИспользования <> "" Тогда
		
		ТекстОшибки = НСтр("ru = 'Недопустимое значение ""%1"" для параметра %2 в методе %3'");
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстОшибки,
			НазначениеИспользования,
			"НазначениеИспользования",
			"Документ.ЗаявкаНаЗакупку.ТекстЗапросаЗаявкиНаЗакупкуПриходДетально");
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И (&СвязьСТаблицейОтборов)", ТекстСвязиСТаблицейОтборов);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Обеспечение потребности в закупке (заказы поставщикам, "закрывающие" заявки на закупку).
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаЗаявкиНаЗакупкуРасходДетально()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаказыЗаявок.ЗаявкаНаЗакупку                                    КАК ЗаявкаНаЗакупку,
	|	ЗаказыПоставщикам.Номенклатура                                  КАК Номенклатура,
	|	ЗаказыПоставщикам.Характеристика                                КАК Характеристика,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Назначение,
	|		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))               КАК Назначение,
	|	ЗаказПоставщикуШапка.Организация                                КАК Организация,
	|	ЗаказыПоставщикам.Склад                                         КАК Склад,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))     КАК Подразделение,
	|	ЗаказПоставщикуШапка.Партнер                                    КАК Партнер,
	|	ЗаказПоставщикуШапка.Соглашение                                 КАК Соглашение,
	|	ЗаказПоставщикуШапка.Контрагент                                 КАК Контрагент,
	|	ЗаказПоставщикуШапка.Договор                                    КАК Договор,
	|	ЗаказПоставщикуШапка.Валюта                                     КАК Валюта,
	|	ЗаказПоставщикуШапка.ЦенаВключаетНДС                            КАК ЦенаВключаетНДС,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.НоменклатураПартнера,
	|		ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)) КАК НоменклатураПартнера,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.ВидЦеныПоставщика,
	|		ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка))       КАК ВидЦеныПоставщика,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Цена, 0)                         КАК Цена,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.СтавкаНДС,
	|		ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка))                КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ЗаказыПоставщикам.КОформлению
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                           КАК Поступило,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗаказыПоставщикам.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                           КАК Заказано,
	|	АВТОНОМЕРЗАПИСИ()                                               КАК НомерЗаписи
	|ПОМЕСТИТЬ ЗаявкиНаЗакупкуРасходДетально
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаказыЗаявок КАК ЗаказыЗаявок
	|		ПО ЗаказыПоставщикам.ЗаказПоставщику = ЗаказыЗаявок.ЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО ЗаказыПоставщикам.ЗаказПоставщику   = ЗаказПоставщикуТовары.Ссылка
	|			И ЗаказыПоставщикам.Номенклатура   = ЗаказПоставщикуТовары.Номенклатура
	|			И ЗаказыПоставщикам.Характеристика = ЗаказПоставщикуТовары.Характеристика
	|			И ЗаказыПоставщикам.КодСтроки      = ЗаказПоставщикуТовары.КодСтроки
	|			И ЗаказыПоставщикам.Склад          = ЗаказПоставщикуТовары.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщикуШапка
	|		ПО ЗаказыПоставщикам.ЗаказПоставщику = ЗаказПоставщикуШапка.Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Правила распределения заказов по заявкам на закупку.
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаЗаявкиНаЗакупкуДанныеРасчетаПострочногоОстатка()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаявкиНаЗакупкуПриходДетально.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку,
	|	ЗаявкиНаЗакупкуПриходДетально.НомерСтроки КАК НомерСтроки,
	|	ЗаявкиНаЗакупкуРасходДетально.НомерЗаписи КАК НомерЗаписиРасхода,
	|	ЗаявкиНаЗакупкуПриходДетально.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) КАК ПартнерЗаполнен,
	|	ЗаявкиНаЗакупкуПриходДетально.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|		И ЗаявкиНаЗакупкуПриходДетально.Соглашение <> ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка) КАК СоглашениеЗаполнено,
	|	ЗаявкиНаЗакупкуПриходДетально.Контрагент = ЗаявкиНаЗакупкуРасходДетально.Контрагент
	|		И ЗаявкиНаЗакупкуПриходДетально.Договор = ЗаявкиНаЗакупкуРасходДетально.Договор
	|		И ЗаявкиНаЗакупкуПриходДетально.Валюта = ЗаявкиНаЗакупкуРасходДетально.Валюта
	|		И ЗаявкиНаЗакупкуПриходДетально.ЦенаВключаетНДС = ЗаявкиНаЗакупкуРасходДетально.ЦенаВключаетНДС
	|		И ЗаявкиНаЗакупкуПриходДетально.НоменклатураПартнера = ЗаявкиНаЗакупкуРасходДетально.НоменклатураПартнера
	|		И ЗаявкиНаЗакупкуПриходДетально.ВидЦеныПоставщика = ЗаявкиНаЗакупкуРасходДетально.ВидЦеныПоставщика
	|		И ЗаявкиНаЗакупкуПриходДетально.Цена = ЗаявкиНаЗакупкуРасходДетально.Цена
	|		И ЗаявкиНаЗакупкуПриходДетально.СтавкаНДС = ЗаявкиНаЗакупкуРасходДетально.СтавкаНДС КАК МягкийКлючСовпадает
	|ИЗ
	|	ЗаявкиНаЗакупкуПриходДетально КАК ЗаявкиНаЗакупкуПриходДетально
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаявкиНаЗакупкуРасходДетально КАК ЗаявкиНаЗакупкуРасходДетально
	|		ПО ЗаявкиНаЗакупкуПриходДетально.ЗаявкаНаЗакупку = ЗаявкиНаЗакупкуРасходДетально.ЗаявкаНаЗакупку
	|			И ЗаявкиНаЗакупкуПриходДетально.Номенклатура = ЗаявкиНаЗакупкуРасходДетально.Номенклатура
	|			И ЗаявкиНаЗакупкуПриходДетально.Характеристика = ЗаявкиНаЗакупкуРасходДетально.Характеристика
	|			И ЗаявкиНаЗакупкуПриходДетально.Назначение = ЗаявкиНаЗакупкуРасходДетально.Назначение
	|			И ЗаявкиНаЗакупкуПриходДетально.Организация = ЗаявкиНаЗакупкуРасходДетально.Организация
	|			И ЗаявкиНаЗакупкуПриходДетально.Склад = ЗаявкиНаЗакупкуРасходДетально.Склад
	|			И ЗаявкиНаЗакупкуПриходДетально.Подразделение = ЗаявкиНаЗакупкуРасходДетально.Подразделение
	|			И (ЗаявкиНаЗакупкуПриходДетально.Партнер = ЗаявкиНаЗакупкуРасходДетально.Партнер
	|				ИЛИ ЗаявкиНаЗакупкуПриходДетально.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))
	|			И (ЗаявкиНаЗакупкуПриходДетально.Соглашение = ЗаявкиНаЗакупкуРасходДетально.Соглашение
	|				ИЛИ ЗаявкиНаЗакупкуПриходДетально.Соглашение = ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявкаНаЗакупку,
	|	ПартнерЗаполнен УБЫВ,
	|	СоглашениеЗаполнено УБЫВ,
	|	МягкийКлючСовпадает УБЫВ,
	|	ЗаявкиНаЗакупкуПриходДетально.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаЗакупкуПриходДетально.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку,
	|	ЗаявкиНаЗакупкуПриходДетально.НомерСтроки КАК НомерСтроки,
	|	ЗаявкиНаЗакупкуПриходДетально.Количество КАК Количество
	|ИЗ
	|	ЗаявкиНаЗакупкуПриходДетально КАК ЗаявкиНаЗакупкуПриходДетально
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявкаНаЗакупку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаЗакупкуРасходДетально.НомерЗаписи КАК НомерЗаписи,
	|	ЗаявкиНаЗакупкуРасходДетально.ЗаявкаНаЗакупку КАК ЗаявкаНаЗакупку,
	|	ЗаявкиНаЗакупкуРасходДетально.Заказано КАК Количество
	|ИЗ
	|	ЗаявкиНаЗакупкуРасходДетально КАК ЗаявкиНаЗакупкуРасходДетально
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует таблицу остатков заявок построчно.
//
// Параметры:
//   ЗаявкаНаЗакупку - ДокументСсылка.ЗаявкаНаЗакупку - Заявка на закупку
//
// Возвращаемое значение:
//   ТаблицаЗначений - ТаблицаЗначений:
//     * ЗаявкаНаЗакупку - ДокументСсылка.ЗаявкаНаЗакупку - По которой получен остаток.
//     * НомерСтроки - Число - Номер строки заявки на закупку.
//     * Количество - Число - остаток по строке.
Функция ТаблицаОстатковЗаявокПострочно(ЗаявкаНаЗакупку)
	
	ВозвращаемоеЗначение = Новый ТаблицаЗначений;
	ВозвращаемоеЗначение.Колонки.Добавить("ЗаявкаНаЗакупку", Новый ОписаниеТипов("ДокументСсылка.ЗаявкаНаЗакупку"));
	ВозвращаемоеЗначение.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(15, 0));
	ВозвращаемоеЗначение.Колонки.Добавить("Количество", ОбщегоНазначенияУТ.ОписаниеТипаКоличественногоПоля());
	
	Для Каждого ОписаниеЗаявки Из ОстаткиЗаявокПострочно(ЗаявкаНаЗакупку) Цикл
		
		Для Каждого КлючИЗначение Из ОписаниеЗаявки.Значение Цикл
			
			СтрокаТаблицы = ВозвращаемоеЗначение.Добавить();
			СтрокаТаблицы.ЗаявкаНаЗакупку = ОписаниеЗаявки.Ключ;
			СтрокаТаблицы.НомерСтроки = КлючИЗначение.Ключ;
			СтрокаТаблицы.Количество = КлючИЗначение.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает остатки заявок построчно.
//
// Параметры:
//   ЗаявкаНаЗакупку - Массив из ДокументСсылка.ЗаявкаНаЗакупку, ДокументОбъект.ЗаявкаНаЗакупку, ДанныеФормыСтруктура - Заявки для расчета остатка
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение:
//      * Ключ - ДокументСсылка.ЗаявкаНаЗакупку
//      * Значение - Соответствие из КлючИЗначение:
//          ** Ключ - Число - Номер строки заявки на закупку.
//          ** Значение - Число - Количество-остаток по строке.
Функция ОстаткиЗаявокПострочно(ЗаявкаНаЗакупку)
	
	ЭтоОстаткиПоОбъекту = ТипЗнч(ЗаявкаНаЗакупку) = Тип("ДокументОбъект.ЗаявкаНаЗакупку")
		Или ТипЗнч(ЗаявкаНаЗакупку) = Тип("ДанныеФормыСтруктура");
		
	Отборы = НовыеОтборыПредставленийЗаявокНаЗакупку();
	УстановитьОтборПредставленийЗаявокНаЗакупку(Отборы.ЗаказПроведен, Истина);
	
	ТекстыЗапросов = Новый Массив;
	Если ЭтоОстаткиПоОбъекту Тогда
		УстановитьОтборПредставленийЗаявокНаЗакупку(Отборы.ЗаявкаНаЗакупку, ЗаявкаНаЗакупку.Ссылка);
		ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуПриходДетально(Отборы, "ПоОбъекту"));
	Иначе
		УстановитьОтборПредставленийЗаявокНаЗакупку(Отборы.ЗаявкаНаЗакупку, ЗаявкаНаЗакупку);
		ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуПриходДетально(Отборы));
	КонецЕсли;
	
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаказыЗаявок(Отборы));
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуРасходДетально());
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявкиНаЗакупкуДанныеРасчетаПострочногоОстатка());
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос = Новый Запрос(ТекстЗапроса);
	УстановитьОтборыЗаявокНаЗакупкуВПараметрыЗапроса(Запрос, Отборы);
	
	Если ЭтоОстаткиПоОбъекту Тогда
		
		Товары = ЗаявкаНаЗакупку.Товары.Выгрузить();
		Товары.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ЗаявкаНаЗакупку"));
		Товары.ЗаполнитьЗначения(ЗаявкаНаЗакупку.Ссылка, "Ссылка");
		Запрос.УстановитьПараметр("Товары", Товары);
		
		// Все поля шапки заменены одноименными параметрами. Установим их значения:
		НайденныеПараметры = Новый Структура(
			СтрСоединить(
				ОбщегоНазначения.ВыгрузитьКолонку(
					Запрос.НайтиПараметры(),
					"Имя"),
				", "));
		ЗаполнитьЗначенияСвойств(НайденныеПараметры, ЗаявкаНаЗакупку);
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Запрос.Параметры, НайденныеПараметры, Ложь);
		
	КонецЕсли;
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	Выборка = РезультатПакета[РезультатПакета.Количество() - 3].Выбрать();
	ВыборкаПрихода = РезультатПакета[РезультатПакета.Количество() - 2].Выбрать();
	ДанныеРасхода = РезультатПакета[РезультатПакета.Количество() - 1].Выгрузить();
	
	ТекущаяЗаявка = ПустаяСсылка();
	ОписаниеЗаявок = Новый Соответствие;
	ОписаниеЗаявки = Неопределено;
	Пока ВыборкаПрихода.Следующий() Цикл
		
		Если ТекущаяЗаявка <> ВыборкаПрихода.ЗаявкаНаЗакупку Тогда
			
			ТекущаяЗаявка = ВыборкаПрихода.ЗаявкаНаЗакупку;
			
			ОписаниеЗаявки = Новый Соответствие;
			ОписаниеЗаявок.Вставить(ТекущаяЗаявка, ОписаниеЗаявки);
			
		КонецЕсли;
		
		ОписаниеЗаявки.Вставить(ВыборкаПрихода.НомерСтроки, ВыборкаПрихода.Количество);
		
	КонецЦикла;
	
	СдвигИндексаОтНомераЗаписи = ?(ЗначениеЗаполнено(ДанныеРасхода),
		ДанныеРасхода[0].НомерЗаписи,
		0);
		
	ТекущаяЗаявка = ПустаяСсылка();
	Пока Выборка.Следующий() Цикл
		
		Если ТекущаяЗаявка <> Выборка.ЗаявкаНаЗакупку Тогда 
			ОписаниеЗаявки = ОписаниеЗаявок[Выборка.ЗаявкаНаЗакупку];
		КонецЕсли;
		
		Остаток = ОписаниеЗаявки[Выборка.НомерСтроки];
		Если Остаток = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРасхода = ДанныеРасхода.Получить(Выборка.НомерЗаписиРасхода - СдвигИндексаОтНомераЗаписи);
		Если СтрокаРасхода.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КСписанию = Мин(Остаток, СтрокаРасхода.Количество);
		СтрокаРасхода.Количество = СтрокаРасхода.Количество - КСписанию;
		Остаток = Остаток - КСписанию;
		
		Если Остаток = 0 Тогда
			ОписаниеЗаявки.Удалить(Выборка.НомерСтроки);
		Иначе
			ОписаниеЗаявки[Выборка.НомерСтроки] = Остаток;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОписаниеЗаявок;
	
КонецФункции

// Свертка приходов и расходов.
Функция ТекстЗапросаЗаявкиНаЗакупкуОстаткиПоЖесткомуКлючу()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОстаткиПоЖесткомуКлючу.ЗаявкаНаЗакупку              КАК ЗаявкаНаЗакупку,
	|	ОстаткиПоЖесткомуКлючу.Номенклатура                 КАК Номенклатура,
	|	ОстаткиПоЖесткомуКлючу.Характеристика               КАК Характеристика,
	|	ОстаткиПоЖесткомуКлючу.Назначение                   КАК Назначение,
	|	ОстаткиПоЖесткомуКлючу.Организация                  КАК Организация,
	|	ОстаткиПоЖесткомуКлючу.Склад                        КАК Склад,
	|	ОстаткиПоЖесткомуКлючу.Подразделение                КАК Подразделение,
	|	ОстаткиПоЖесткомуКлючу.Партнер                      КАК Партнер,
	|	ОстаткиПоЖесткомуКлючу.Соглашение                   КАК Соглашение,
	|	СУММА(ОстаткиПоЖесткомуКлючу.ВЗаявке)               КАК ВЗаявке,
	|	СУММА(ОстаткиПоЖесткомуКлючу.Заказано)              КАК Заказано,
	|	СУММА(ОстаткиПоЖесткомуКлючу.Количество)            КАК Количество,
	|	СУММА(ОстаткиПоЖесткомуКлючу.Поступило)             КАК Поступило,
	|	МАКСИМУМ(ОстаткиПоЖесткомуКлючу.УпаковкаВЗаявке)    КАК УпаковкаВЗаявке,
	|	МАКСИМУМ(ОстаткиПоЖесткомуКлючу.ДатаПоступления)    КАК ДатаПоступления,
	|	МАКСИМУМ(ОстаткиПоЖесткомуКлючу.ПодразделениеШапки) КАК ПодразделениеШапки
	|ПОМЕСТИТЬ ЗаявкиНаЗакупкуОстаткиПоЖесткомуКлючу
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаявкиНаЗакупкуПриходДетально.ЗаявкаНаЗакупку    КАК ЗаявкаНаЗакупку,
	|		ЗаявкиНаЗакупкуПриходДетально.Номенклатура       КАК Номенклатура,
	|		ЗаявкиНаЗакупкуПриходДетально.Характеристика     КАК Характеристика,
	|		ЗаявкиНаЗакупкуПриходДетально.Назначение         КАК Назначение,
	|		ЗаявкиНаЗакупкуПриходДетально.Организация        КАК Организация,
	|		ЗаявкиНаЗакупкуПриходДетально.Склад              КАК Склад,
	|		ЗаявкиНаЗакупкуПриходДетально.Подразделение      КАК Подразделение,
	|		ЗаявкиНаЗакупкуПриходДетально.Партнер            КАК Партнер,
	|		ЗаявкиНаЗакупкуПриходДетально.Соглашение         КАК Соглашение,
	|		ЗаявкиНаЗакупкуПриходДетально.Количество         КАК ВЗаявке,
	|		0                                                КАК Заказано,
	|		ЗаявкиНаЗакупкуПриходДетально.Количество         КАК Количество,
	|		0                                                КАК Поступило,
	|		ЗаявкиНаЗакупкуПриходДетально.Упаковка           КАК УпаковкаВЗаявке,
	|		ЗаявкиНаЗакупкуПриходДетально.ДатаПоступления    КАК ДатаПоступления,
	|		ЗаявкиНаЗакупкуПриходДетально.ПодразделениеШапки КАК ПодразделениеШапки
	|	ИЗ
	|		ЗаявкиНаЗакупкуПриходДетально КАК ЗаявкиНаЗакупкуПриходДетально
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаявкиНаЗакупкуРасходДетально.ЗаявкаНаЗакупку              КАК ЗаявкаНаЗакупку,
	|		ЗаявкиНаЗакупкуРасходДетально.Номенклатура                 КАК Номенклатура,
	|		ЗаявкиНаЗакупкуРасходДетально.Характеристика               КАК Характеристика,
	|		ЗаявкиНаЗакупкуРасходДетально.Назначение                   КАК Назначение,
	|		ЗаявкиНаЗакупкуРасходДетально.Организация                  КАК Организация,
	|		ЗаявкиНаЗакупкуРасходДетально.Склад                        КАК Склад,
	|		ЗаявкиНаЗакупкуРасходДетально.Подразделение                КАК Подразделение,
	|		ЗаявкиНаЗакупкуРасходДетально.Партнер                      КАК Партнер,
	|		ЗаявкиНаЗакупкуРасходДетально.Соглашение                   КАК Соглашение,
	|		0                                                          КАК ВЗаявке,
	|		ЗаявкиНаЗакупкуРасходДетально.Заказано                     КАК Заказано,
	|		-ЗаявкиНаЗакупкуРасходДетально.Заказано                    КАК Количество,
	|		ЗаявкиНаЗакупкуРасходДетально.Поступило                    КАК Поступило,
	|		ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК УпаковкаВЗаявке,
	|		ДАТАВРЕМЯ(1, 1, 1)                                         КАК ДатаПоступления,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)     КАК ПодразделениеШапки
	|	ИЗ
	|		ЗаявкиНаЗакупкуРасходДетально КАК ЗаявкиНаЗакупкуРасходДетально) КАК ОстаткиПоЖесткомуКлючу
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоЖесткомуКлючу.ЗаявкаНаЗакупку,
	|	ОстаткиПоЖесткомуКлючу.Номенклатура,
	|	ОстаткиПоЖесткомуКлючу.Характеристика,
	|	ОстаткиПоЖесткомуКлючу.Назначение,
	|	ОстаткиПоЖесткомуКлючу.Организация,
	|	ОстаткиПоЖесткомуКлючу.Склад,
	|	ОстаткиПоЖесткомуКлючу.Подразделение,
	|	ОстаткиПоЖесткомуКлючу.Партнер,
	|	ОстаткиПоЖесткомуКлючу.Соглашение";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Списание перепоставки со строк с пустыми соглашениями.
Функция ТекстЗапросаЗаявкиНаЗакупкуОстаткиБезСоглашений()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОстаткиБезСоглашений.ЗаявкаНаЗакупку              КАК ЗаявкаНаЗакупку,
	|	ОстаткиБезСоглашений.Номенклатура                 КАК Номенклатура,
	|	ОстаткиБезСоглашений.Характеристика               КАК Характеристика,
	|	ОстаткиБезСоглашений.Назначение                   КАК Назначение,
	|	ОстаткиБезСоглашений.Организация                  КАК Организация,
	|	ОстаткиБезСоглашений.Склад                        КАК Склад,
	|	ОстаткиБезСоглашений.Подразделение                КАК Подразделение,
	|	ОстаткиБезСоглашений.Партнер                      КАК Партнер,
	|	ОстаткиБезСоглашений.Соглашение                   КАК Соглашение,
	|	СУММА(ОстаткиБезСоглашений.ВЗаявке)               КАК ВЗаявке,
	|	СУММА(ОстаткиБезСоглашений.Заказано)              КАК Заказано,
	|	СУММА(ОстаткиБезСоглашений.Количество)            КАК Количество,
	|	СУММА(ОстаткиБезСоглашений.Поступило)             КАК Поступило,
	|	МАКСИМУМ(ОстаткиБезСоглашений.УпаковкаВЗаявке)    КАК УпаковкаВЗаявке,
	|	МАКСИМУМ(ОстаткиБезСоглашений.ДатаПоступления)    КАК ДатаПоступления,
	|	МАКСИМУМ(ОстаткиБезСоглашений.ПодразделениеШапки) КАК ПодразделениеШапки
	|ПОМЕСТИТЬ ЗаявкиНаЗакупкуОстаткиБезСоглашений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиБезСоглашений.ЗаявкаНаЗакупку    КАК ЗаявкаНаЗакупку,
	|		ОстаткиБезСоглашений.Номенклатура       КАК Номенклатура,
	|		ОстаткиБезСоглашений.Характеристика     КАК Характеристика,
	|		ОстаткиБезСоглашений.Назначение         КАК Назначение,
	|		ОстаткиБезСоглашений.Организация        КАК Организация,
	|		ОстаткиБезСоглашений.Склад              КАК Склад,
	|		ОстаткиБезСоглашений.Подразделение      КАК Подразделение,
	|		ОстаткиБезСоглашений.Партнер            КАК Партнер,
	|		ОстаткиБезСоглашений.Соглашение         КАК Соглашение,
	|		ОстаткиБезСоглашений.ВЗаявке            КАК ВЗаявке,
	|		ОстаткиБезСоглашений.Заказано           КАК Заказано,
	|		ОстаткиБезСоглашений.Количество         КАК Количество,
	|		ОстаткиБезСоглашений.Поступило          КАК Поступило,
	|		ОстаткиБезСоглашений.УпаковкаВЗаявке    КАК УпаковкаВЗаявке,
	|		ОстаткиБезСоглашений.ДатаПоступления    КАК ДатаПоступления,
	|		ОстаткиБезСоглашений.ПодразделениеШапки КАК ПодразделениеШапки
	|	ИЗ
	|		ЗаявкиНаЗакупкуОстаткиПоЖесткомуКлючу КАК ОстаткиБезСоглашений
	|	ГДЕ
	|		ОстаткиБезСоглашений.Соглашение = ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка)
	|		И ОстаткиБезСоглашений.Количество > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтрицательныеОстаткиБезУчетаСоглашений.ЗаявкаНаЗакупку     КАК ЗаявкаНаЗакупку,
	|		ОтрицательныеОстаткиБезУчетаСоглашений.Номенклатура        КАК Номенклатура,
	|		ОтрицательныеОстаткиБезУчетаСоглашений.Характеристика      КАК Характеристика,
	|		ОтрицательныеОстаткиБезУчетаСоглашений.Назначение          КАК Назначение,
	|		ОтрицательныеОстаткиБезУчетаСоглашений.Организация         КАК Организация,
	|		ОтрицательныеОстаткиБезУчетаСоглашений.Склад               КАК Склад,
	|		ОтрицательныеОстаткиБезУчетаСоглашений.Подразделение       КАК Подразделение,
	|		ОтрицательныеОстаткиБезУчетаСоглашений.Партнер             КАК Партнер,
	|		ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка)  КАК Соглашение,
	|		ОтрицательныеОстаткиБезУчетаСоглашений.ВЗаявке             КАК ВЗаявке,
	|		ОтрицательныеОстаткиБезУчетаСоглашений.Заказано            КАК Заказано,
	|		ОтрицательныеОстаткиБезУчетаСоглашений.Количество          КАК Количество,
	|		ОтрицательныеОстаткиБезУчетаСоглашений.Поступило           КАК Поступило,
	|		ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК УпаковкаВЗаявке,
	|		ДАТАВРЕМЯ(1, 1, 1)                                         КАК ДатаПоступления,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)     КАК ПодразделениеШапки
	|	ИЗ
	|		ЗаявкиНаЗакупкуОстаткиПоЖесткомуКлючу КАК ОтрицательныеОстаткиБезУчетаСоглашений
	|	ГДЕ
	|		ОтрицательныеОстаткиБезУчетаСоглашений.Количество < 0) КАК ОстаткиБезСоглашений
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиБезСоглашений.Подразделение,
	|	ОстаткиБезСоглашений.ЗаявкаНаЗакупку,
	|	ОстаткиБезСоглашений.Партнер,
	|	ОстаткиБезСоглашений.Организация,
	|	ОстаткиБезСоглашений.Номенклатура,
	|	ОстаткиБезСоглашений.Назначение,
	|	ОстаткиБезСоглашений.Соглашение,
	|	ОстаткиБезСоглашений.Склад,
	|	ОстаткиБезСоглашений.Характеристика";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Списание перепоставки со строк с пустыми партнерами.
Функция ТекстЗапросаЗаявкиНаЗакупкуОстаткиБезПартнеров()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОстаткиБезПартнеров.ЗаявкаНаЗакупку              КАК ЗаявкаНаЗакупку,
	|	ОстаткиБезПартнеров.Номенклатура                 КАК Номенклатура,
	|	ОстаткиБезПартнеров.Характеристика               КАК Характеристика,
	|	ОстаткиБезПартнеров.Назначение                   КАК Назначение,
	|	ОстаткиБезПартнеров.Организация                  КАК Организация,
	|	ОстаткиБезПартнеров.Склад                        КАК Склад,
	|	ОстаткиБезПартнеров.Подразделение                КАК Подразделение,
	|	ОстаткиБезПартнеров.Партнер                      КАК Партнер,
	|	ОстаткиБезПартнеров.Соглашение                   КАК Соглашение,
	|	СУММА(ОстаткиБезПартнеров.ВЗаявке)               КАК ВЗаявке,
	|	СУММА(ОстаткиБезПартнеров.Заказано)              КАК Заказано,
	|	СУММА(ОстаткиБезПартнеров.Количество)            КАК Количество,
	|	СУММА(ОстаткиБезПартнеров.Поступило)             КАК Поступило,
	|	МАКСИМУМ(ОстаткиБезПартнеров.УпаковкаВЗаявке)    КАК УпаковкаВЗаявке,
	|	МАКСИМУМ(ОстаткиБезПартнеров.ДатаПоступления)    КАК ДатаПоступления,
	|	МАКСИМУМ(ОстаткиБезПартнеров.ПодразделениеШапки) КАК ПодразделениеШапки
	|ПОМЕСТИТЬ ЗаявкиНаЗакупкуОстаткиБезПартнеров
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиБезПартнеров.ЗаявкаНаЗакупку    КАК ЗаявкаНаЗакупку,
	|		ОстаткиБезПартнеров.Номенклатура       КАК Номенклатура,
	|		ОстаткиБезПартнеров.Характеристика     КАК Характеристика,
	|		ОстаткиБезПартнеров.Назначение         КАК Назначение,
	|		ОстаткиБезПартнеров.Организация        КАК Организация,
	|		ОстаткиБезПартнеров.Склад              КАК Склад,
	|		ОстаткиБезПартнеров.Подразделение      КАК Подразделение,
	|		ОстаткиБезПартнеров.Партнер            КАК Партнер,
	|		ОстаткиБезПартнеров.Соглашение         КАК Соглашение,
	|		ОстаткиБезПартнеров.ВЗаявке            КАК ВЗаявке,
	|		ОстаткиБезПартнеров.Заказано           КАК Заказано,
	|		ОстаткиБезПартнеров.Количество         КАК Количество,
	|		ОстаткиБезПартнеров.Поступило          КАК Поступило,
	|		ОстаткиБезПартнеров.УпаковкаВЗаявке    КАК УпаковкаВЗаявке,
	|		ОстаткиБезПартнеров.ДатаПоступления    КАК ДатаПоступления,
	|		ОстаткиБезПартнеров.ПодразделениеШапки КАК ПодразделениеШапки
	|	ИЗ
	|		ЗаявкиНаЗакупкуОстаткиБезСоглашений КАК ОстаткиБезПартнеров
	|	ГДЕ
	|		ОстаткиБезПартнеров.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|		И ОстаткиБезПартнеров.Соглашение = ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка)
	|		И ОстаткиБезПартнеров.Количество > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтрицательныеОстаткиБезУчетаПартнеров.ЗаявкаНаЗакупку      КАК ЗаявкаНаЗакупку,
	|		ОтрицательныеОстаткиБезУчетаПартнеров.Номенклатура         КАК Номенклатура,
	|		ОтрицательныеОстаткиБезУчетаПартнеров.Характеристика       КАК Характеристика,
	|		ОтрицательныеОстаткиБезУчетаПартнеров.Назначение           КАК Назначение,
	|		ОтрицательныеОстаткиБезУчетаПартнеров.Организация          КАК Организация,
	|		ОтрицательныеОстаткиБезУчетаПартнеров.Склад                КАК Склад,
	|		ОтрицательныеОстаткиБезУчетаПартнеров.Подразделение        КАК Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)                 КАК Партнер,
	|		ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка)  КАК Соглашение,
	|		ОтрицательныеОстаткиБезУчетаПартнеров.ВЗаявке              КАК ВЗаявке,
	|		ОтрицательныеОстаткиБезУчетаПартнеров.Заказано             КАК Заказано,
	|		ОтрицательныеОстаткиБезУчетаПартнеров.Количество           КАК Количество,
	|		ОтрицательныеОстаткиБезУчетаПартнеров.Поступило            КАК Поступило,
	|		ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК УпаковкаВЗаявке,
	|		ДАТАВРЕМЯ(1, 1, 1)                                         КАК ДатаПоступления,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)     КАК ПодразделениеШапки
	|	ИЗ
	|		ЗаявкиНаЗакупкуОстаткиБезСоглашений КАК ОтрицательныеОстаткиБезУчетаПартнеров
	|	ГДЕ
	|		ОтрицательныеОстаткиБезУчетаПартнеров.Количество < 0) КАК ОстаткиБезПартнеров
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиБезПартнеров.ЗаявкаНаЗакупку,
	|	ОстаткиБезПартнеров.Номенклатура,
	|	ОстаткиБезПартнеров.Характеристика,
	|	ОстаткиБезПартнеров.Назначение,
	|	ОстаткиБезПартнеров.Организация,
	|	ОстаткиБезПартнеров.Склад,
	|	ОстаткиБезПартнеров.Подразделение,
	|	ОстаткиБезПартнеров.Партнер,
	|	ОстаткиБезПартнеров.Соглашение";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Объединение исходной свертки приход-расход с уточнениями по списанию перепоставки с пустых соглашений и партнеров.
Функция ТекстЗапросаЗаявкиНаЗакупкуОстаткиОбобщенно(ИмяВременнойТаблицы = "ЗаявкиНаЗакупкуОстаткиОбобщенно", ИспользуетсяПоступление = Ложь)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОстаткиПоЖесткомуКлючу.ЗаявкаНаЗакупку    КАК ЗаявкаНаЗакупку,
	|	ОстаткиПоЖесткомуКлючу.Номенклатура       КАК Номенклатура,
	|	ОстаткиПоЖесткомуКлючу.Характеристика     КАК Характеристика,
	|	ОстаткиПоЖесткомуКлючу.Назначение         КАК Назначение,
	|	ОстаткиПоЖесткомуКлючу.Организация        КАК Организация,
	|	ОстаткиПоЖесткомуКлючу.Склад              КАК Склад,
	|	ОстаткиПоЖесткомуКлючу.Подразделение      КАК Подразделение,
	|	ОстаткиПоЖесткомуКлючу.Партнер            КАК Партнер,
	|	ОстаткиПоЖесткомуКлючу.Соглашение         КАК Соглашение,
	|	ОстаткиПоЖесткомуКлючу.ВЗаявке            КАК ВЗаявке,
	|	ОстаткиПоЖесткомуКлючу.Заказано           КАК Заказано,
	|	ОстаткиПоЖесткомуКлючу.Количество         КАК Количество,
	|	ОстаткиПоЖесткомуКлючу.Поступило          КАК Поступило,
	|	ОстаткиПоЖесткомуКлючу.УпаковкаВЗаявке    КАК УпаковкаВЗаявке,
	|	ОстаткиПоЖесткомуКлючу.ДатаПоступления    КАК ДатаПоступления,
	|	ОстаткиПоЖесткомуКлючу.ПодразделениеШапки КАК ПодразделениеШапки
	|ПОМЕСТИТЬ ЗаявкиНаЗакупкуОстаткиОбобщенно
	|ИЗ
	|	ЗаявкиНаЗакупкуОстаткиПоЖесткомуКлючу КАК ОстаткиПоЖесткомуКлючу
	|ГДЕ
	|	ОстаткиПоЖесткомуКлючу.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И ОстаткиПоЖесткомуКлючу.Соглашение <> ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка)
	|	И (ОстаткиПоЖесткомуКлючу.Количество > 0
	|		ИЛИ &ИспользуетсяПоступление И ОстаткиПоЖесткомуКлючу.ВЗаявке - ОстаткиПоЖесткомуКлючу.Поступило > 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиБезСоглашений.ЗаявкаНаЗакупку    КАК ЗаявкаНаЗакупку,
	|	ОстаткиБезСоглашений.Номенклатура       КАК Номенклатура,
	|	ОстаткиБезСоглашений.Характеристика     КАК Характеристика,
	|	ОстаткиБезСоглашений.Назначение         КАК Назначение,
	|	ОстаткиБезСоглашений.Организация        КАК Организация,
	|	ОстаткиБезСоглашений.Склад              КАК Склад,
	|	ОстаткиБезСоглашений.Подразделение      КАК Подразделение,
	|	ОстаткиБезСоглашений.Партнер            КАК Партнер,
	|	ОстаткиБезСоглашений.Соглашение         КАК Соглашение,
	|	ОстаткиБезСоглашений.ВЗаявке            КАК ВЗаявке,
	|	ОстаткиБезСоглашений.Заказано           КАК Заказано,
	|	ОстаткиБезСоглашений.Количество         КАК Количество,
	|	ОстаткиБезСоглашений.Поступило          КАК Поступило,
	|	ОстаткиБезСоглашений.УпаковкаВЗаявке    КАК УпаковкаВЗаявке,
	|	ОстаткиБезСоглашений.ДатаПоступления    КАК ДатаПоступления,
	|	ОстаткиБезСоглашений.ПодразделениеШапки КАК ПодразделениеШапки
	|ИЗ
	|	ЗаявкиНаЗакупкуОстаткиБезСоглашений КАК ОстаткиБезСоглашений
	|ГДЕ
	|	ОстаткиБезСоглашений.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И (ОстаткиБезСоглашений.Количество > 0
	|		ИЛИ &ИспользуетсяПоступление И ОстаткиБезСоглашений.ВЗаявке - ОстаткиБезСоглашений.Поступило > 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиБезПартнеров.ЗаявкаНаЗакупку    КАК ЗаявкаНаЗакупку,
	|	ОстаткиБезПартнеров.Номенклатура       КАК Номенклатура,
	|	ОстаткиБезПартнеров.Характеристика     КАК Характеристика,
	|	ОстаткиБезПартнеров.Назначение         КАК Назначение,
	|	ОстаткиБезПартнеров.Организация        КАК Организация,
	|	ОстаткиБезПартнеров.Склад              КАК Склад,
	|	ОстаткиБезПартнеров.Подразделение      КАК Подразделение,
	|	ОстаткиБезПартнеров.Партнер            КАК Партнер,
	|	ОстаткиБезПартнеров.Соглашение         КАК Соглашение,
	|	ОстаткиБезПартнеров.ВЗаявке            КАК ВЗаявке,
	|	ОстаткиБезПартнеров.Заказано           КАК Заказано,
	|	ОстаткиБезПартнеров.Количество         КАК Количество,
	|	ОстаткиБезПартнеров.Поступило          КАК Поступило,
	|	ОстаткиБезПартнеров.УпаковкаВЗаявке    КАК УпаковкаВЗаявке,
	|	ОстаткиБезПартнеров.ДатаПоступления    КАК ДатаПоступления,
	|	ОстаткиБезПартнеров.ПодразделениеШапки КАК ПодразделениеШапки
	|ИЗ
	|	ЗаявкиНаЗакупкуОстаткиБезПартнеров КАК ОстаткиБезПартнеров
	|ГДЕ
	|	ОстаткиБезПартнеров.Количество > 0
	|	И (ОстаткиБезПартнеров.Количество > 0
	|		ИЛИ &ИспользуетсяПоступление И ОстаткиБезПартнеров.ВЗаявке - ОстаткиБезПартнеров.Поступило > 0)";
	
	ИспользованиеПоступленияВЗапросе = Формат(ИспользуетсяПоступление, "БЛ=ЛОЖЬ; БИ=ИСТИНА");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИспользуетсяПоступление", ИспользованиеПоступленияВЗапросе);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"ПОМЕСТИТЬ ЗаявкиНаЗакупкуОстаткиОбобщенно",
		"ПОМЕСТИТЬ " + ИмяВременнойТаблицы);
		
	Возврат ТекстЗапроса;
	
КонецФункции

// Данные для вывода таблицы "КЗаказу" в отчете "СостояниеВыполненияДокументов"
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаТаблицаКЗаказу()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаявкиНаЗакупкуОстаткиОбобщенно.ЗаявкаНаЗакупку               КАК Документ,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкиНаЗакупкуОстаткиОбобщенно.Номенклатура)   КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкиНаЗакупкуОстаткиОбобщенно.Характеристика) КАК ХарактеристикаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкиНаЗакупкуОстаткиОбобщенно.Назначение)     КАК НазначениеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкиНаЗакупкуОстаткиОбобщенно.Склад)          КАК СкладПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкиНаЗакупкуОстаткиОбобщенно.Подразделение)  КАК ПодразделениеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкиНаЗакупкуОстаткиОбобщенно.Партнер)        КАК ПартнерПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкиНаЗакупкуОстаткиОбобщенно.Соглашение)     КАК СоглашениеПредставление,
	|	ВЫБОР
	|		КОГДА ЗаявкиНаЗакупкуОстаткиОбобщенно.УпаковкаВЗаявке = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ЗаявкиНаЗакупкуОстаткиОбобщенно.Номенклатура.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ЗаявкиНаЗакупкуОстаткиОбобщенно.УпаковкаВЗаявке)
	|	КОНЕЦ КАК УпаковкаПредставление,
	|	ВЫБОР
	|		КОГДА ЗаявкиНаЗакупкуОстаткиОбобщенно.УпаковкаВЗаявке = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ЗаявкиНаЗакупкуОстаткиОбобщенно.Номенклатура.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ЗаявкиНаЗакупкуОстаткиОбобщенно.УпаковкаВЗаявке)
	|	КОНЕЦ КАК Упаковка,
	|	ЗаявкиНаЗакупкуОстаткиОбобщенно.ВЗаявке   / &ТекстЗапросаКоэффициентаУпаковки  КАК ВЗаявке,
	|	ЗаявкиНаЗакупкуОстаткиОбобщенно.Заказано  / &ТекстЗапросаКоэффициентаУпаковки  КАК Заказано,
	|	ЗаявкиНаЗакупкуОстаткиОбобщенно.Поступило / &ТекстЗапросаКоэффициентаУпаковки  КАК Поступило,
	|	ЗаявкиНаЗакупкуОстаткиОбобщенно.Количество / &ТекстЗапросаКоэффициентаУпаковки КАК КЗаказу,
	|
	|	ВЫБОР
	|		КОГДА ЗаявкиНаЗакупкуОстаткиОбобщенно.Заказано = 0
	|			ТОГДА 0
	|		КОГДА ЗаявкиНаЗакупкуОстаткиОбобщенно.Заказано < ЗаявкиНаЗакупкуОстаткиОбобщенно.ВЗаявке
	|			ТОГДА 1
	|		КОГДА ЗаявкиНаЗакупкуОстаткиОбобщенно.Поступило < ЗаявкиНаЗакупкуОстаткиОбобщенно.ВЗаявке
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ПриоритетВывода
	| 
	|
	|ИЗ
	|	ЗаявкиНаЗакупкуОстаткиОбобщенно КАК ЗаявкиНаЗакупкуОстаткиОбобщенно
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриоритетВывода,
	|	ЗаявкиНаЗакупкуОстаткиОбобщенно.Номенклатура,
	|	ЗаявкиНаЗакупкуОстаткиОбобщенно.Характеристика,
	|	ЗаявкиНаЗакупкуОстаткиОбобщенно.Назначение,
	|	ЗаявкиНаЗакупкуОстаткиОбобщенно.Склад,
	|	ЗаявкиНаЗакупкуОстаткиОбобщенно.Подразделение
	|ИТОГИ ПО
	|	Документ";
	
	ТекстЗапросаКоэффициентаУпаковки = СтрШаблон("ЕСТЬNULL(%1, 1)",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
				"ЗаявкиНаЗакупкуОстаткиОбобщенно.УпаковкаВЗаявке",
				"ЗаявкиНаЗакупкуОстаткиОбобщенно.Номенклатура"));
			
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ТекстЗапросаКоэффициентаУпаковки",
		ТекстЗапросаКоэффициентаУпаковки);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#Область ОтборыПредставленийЗаявокНаЗакупку
// Аналог отборов построителя запроса для работы с временными таблицами, таблицами значений и возможностью подстановки текстов запросов вместо значений отборов.
// Для использования:
// 1. Инициализировать описание отборов для текущего запроса: НовыеОтборыПредставленийЗаявокНаЗакупку().
// 2. Установить необходимые отборы с помощью метода: "УстановитьОтборПредставленийЗаявокНаЗакупку()". Например:
//    УстановитьОтборПредставленийЗаявокНаЗакупку(НовыеОтборыПредставленийЗаявокНаЗакупку.ЗаявкаНаЗакупку, Документы.ЗаявкаНаЗакупку.НайтиПоНомеру("1"));
//    В результате, если текст запроса поддерживает отбор по заявке на закупку, то будет добавлено соответствующее условие.
// 3. Добавить в текст запроса ключевое слово "&ДоступныеОтборы" в секцию "ГДЕ". Например:
//    ТекстЗапроса = "Выбрать т.Ссылка Из т ГДЕ &ДоступныеОтборы"
// 4. Описать левые части отборов, доступные в тексте запроса с помощью метода: "НовыеДоступныеОтборыЗаявокНаЗакупку". Например:
//     НовыеДоступныеОтборыЗаявокНаЗакупку.ЗаявкаНаЗакупку = "т.Ссылка";
// 5. Изменить текст запроса с помощью вызова метода: "УстановитьОтборыЗаявокНаЗакупкуВТекстеЗапроса".
//     В примере, т.к. установлен отбор по заявке на закупку (п.2) и текст запроса его поддерживает (п.3. + п.4) будет получен текст:
//     "Выбрать т.Ссылка Из т ГДЕ т.ссылка = &Параметр"
// 6. Установить параметры запроса с помощью метода: "УстановитьОтборыЗаявокНаЗакупкуВПараметрыЗапроса".

// Конструктор для описания значений отборов в текущем запросе.
// 
// Возвращаемое значение:
//  Структура
Функция НовыеОтборыПредставленийЗаявокНаЗакупку()
	
	ШаблонОтбора = Новый Структура;
	ШаблонОтбора.Вставить("Использование", Ложь);
	ШаблонОтбора.Вставить("ЭтоТекстЗапроса", Ложь);
	ШаблонОтбора.Вставить("Значение", Неопределено);
	ШаблонОтбора.Вставить("ИдентификаторВЗапросе", "");
	
	ВозвращаемоеЗначение = Новый Структура(
		ИменаОтборовПредставленийЗаявокНаЗакупку());
	
	Для Каждого КлючИЗначение Из ВозвращаемоеЗначение Цикл
		
		ИмяОтбора = КлючИЗначение.Ключ;
		ЭлементОтбора = ОбщегоНазначения.СкопироватьРекурсивно(ШаблонОтбора);
		ЭлементОтбора.ИдентификаторВЗапросе = ИмяОтбора;
		
		ВозвращаемоеЗначение[ИмяОтбора] = ЭлементОтбора;
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Конструктор для описания отборов, которые поддерживает текущий текст запроса.
// 
// Возвращаемое значение:
//  Структура
Функция НовыеДоступныеОтборыЗаявокНаЗакупку()
	
	ВозвращаемоеЗначение = Новый Структура(
		ИменаОтборовПредставленийЗаявокНаЗакупку());
	
	Для Каждого КлючИЗначение Из ВозвращаемоеЗначение Цикл
		
		ИмяОтбора = КлючИЗначение.Ключ;
		ВозвращаемоеЗначение[ИмяОтбора] = "";
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Имена всех доступных отборов в представлениях заявок на закупку. 
// 
// Возвращаемое значение:
//  Строка - Имена отборов представлений заявок на закупку
Функция ИменаОтборовПредставленийЗаявокНаЗакупку()
	
	ВозвращаемоеЗначение = 
	"ЗаявкаНаЗакупку,
	|ЗаявкаПроведена,
	|
	|ЗаказПоставщику,
	|ЗаказПроведен,
	|ЗаказСозданПоЗаявке";
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Добавляет описания отбора в запросе.
//
// Параметры:
//   ЭлементОтбора - Структура - Указывает на какое поле будет накладываться отбор в запросе:
//       Например, НовыеДоступныеОтборыЗаявокНаЗакупку().ЗаявкаНаЗакупку.
//       Имена доступных полей см в "ИменаОтборовПредставленийЗаявокНаЗакупку()". 
//   ЗначениеОтбора - Произвольный - Значение отбора, которое будет установлено в параметр запроса.
//   ЭтоТекстЗапроса - Булево - Если Истина, то вместо установки параметра запроса будет подставлен текст из значения.
Процедура УстановитьОтборПредставленийЗаявокНаЗакупку(ЭлементОтбора, ЗначениеОтбора, ЭтоТекстЗапроса = Ложь)

	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЭтоТекстЗапроса = ЭтоТекстЗапроса;
	Если ЭтоТекстЗапроса Тогда
		ЭлементОтбора.ИдентификаторВЗапросе = ЗначениеОтбора;
	Иначе
		ЭлементОтбора.Значение = ЗначениеОтбора;
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает описанные отборы в качестве параметров запроса. 
// 
// Параметры:
//  Запрос - Запрос - Запрос в который необходимо установить параметры.
//  Отборы - Структура - см. НовыеОтборыПредставленийЗаявокНаЗакупку()
Процедура УстановитьОтборыЗаявокНаЗакупкуВПараметрыЗапроса(Запрос, Отборы)
	
	Для Каждого КлючИЗначение Из Отборы Цикл
		
		ЭлементОтбора = КлючИЗначение.Значение;
		
		Если Не ЭлементОтбора.Использование
			Или ЭлементОтбора.ЭтоТекстЗапроса Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос.УстановитьПараметр(ЭлементОтбора.ИдентификаторВЗапросе, ЭлементОтбора.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает отборы в тексте запроса по описанным значениям.
// 
// Параметры:
//  ТекстЗапроса - Строка - с ключевым словом "&ДоступныеОтборы" в секции "ГДЕ".
//  Отборы - Структура - см. НовыеОтборыПредставленийЗаявокНаЗакупку()
//  ДоступныеОтборы - Структура - см. НовыеДоступныеОтборыЗаявокНаЗакупку()
// 
// Возвращаемое значение:
//  Строка - Установить отборы заявок на закупку в тексте запроса
Функция УстановитьОтборыЗаявокНаЗакупкуВТекстеЗапроса(Знач ТекстЗапроса, Отборы, ДоступныеОтборы)
	
	ТекстОтборов = Новый Массив;
	ТекстОтборов.Добавить("ИСТИНА");
	Для Каждого КлючИЗначение Из ДоступныеОтборы Цикл
		
		ЭлементОтбора = Отборы[КлючИЗначение.Ключ];
		Если Не ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		ЛеваяЧасть = КлючИЗначение.Значение;
		Если ПустаяСтрока(ЛеваяЧасть) Тогда
			Продолжить;
		КонецЕсли;
		
		ТипЗначения = ТипЗнч(ЭлементОтбора.Значение);
		Если ЭлементОтбора.ЭтоТекстЗапроса Тогда
			
			ШаблонУсловия = "%1 В (%2)";  //@query-part
			
		ИначеЕсли ТипЗначения = Тип("Массив") Тогда
			
			ШаблонУсловия = СтрШаблон("%1 В (&%2)");
			
		ИначеЕсли ТипЗначения = Тип("Булево") Тогда
			
			Если ЭлементОтбора.Значение Тогда
				ШаблонУсловия = "%1";  //@query-part
			Иначе
				ШаблонУсловия = "НЕ %1";  //@query-part
			КонецЕсли;
			
		Иначе
			
			ШаблонУсловия = "%1 = &%2"; //@query-part
			
		КонецЕсли;
		
		ТекстОтборов.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонУсловия,
			ЛеваяЧасть,
			ЭлементОтбора.ИдентификаторВЗапросе));
		
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДоступныеОтборы", СтрСоединить(ТекстОтборов, "
	|	И "));  //@query-part
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти


#КонецОбласти

#КонецЕсли
