#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПроверкаОтвета", РежимПроверкиОтвета);
	
	Элементы.ТоварыХарактеристика.Видимость =
		(КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики()
			И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяХарактеристики") = Истина);
	
	ОбновитьДанныеФормы();
	
	Элементы.ДокументОснование.Доступность = ТипыДокументаОснованияНастроеныДляТитула();
	
	РазблокироватьДанныеФормыДляРедактирования();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьДокумент();
	
	УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" 
		И (Параметр = Объект.Ссылка
			Или (Параметр <> Неопределено
				И ТипЗнч(Параметр) = Тип("Массив")
				И Параметр.Найти(Объект.Ссылка) <> Неопределено)) Тогда
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();

	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи"
		И Параметр <> Неопределено
		И ТипЗнч(Параметр) = Тип("Массив")
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов"
		И Параметр <> Неопределено
		И ТипЗнч(Параметр) = Тип("Массив")
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполнитьТребуемыеДействияТоваров();
	Оповестить("КонтурЛогистика_ВвестиДокумент");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокУчСист_Реквизит_СопоставитьНажатие(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	ОбъектДокУчСистПуть = "ЭтаФорма." + СтрЗаменить(ИмяЭлемента, "_Сопоставить", "");
	ЗначениеОбъектДокУчСист = Вычислить(ОбъектДокУчСистПуть);
	
	Если ЗначениеЗаполнено(ЗначениеОбъектДокУчСист) Тогда
		
		ОткрытьФормуПодбораСущностиЛогистика(ЗначениеОбъектДокУчСист, Элемент);
		
	Иначе
		
		// Открыть документ
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Объект.ДокументОснование);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоМестПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура МассаБруттоКгПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокРежимТекущейСтрокиПриИзменении(Элемент)
	
	КонтурЛогистика_ПанельОшибокКлиент.ПриИзмененииРежимаПанелиОшибок(
		Элементы.ТаблицаОшибок, ПанельОшибокРежимТекущейСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя, "ПослеВыбораВТаблицеОшибок");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВТаблицеОшибок(Действие) Экспорт 
	
	Если Действие = "Добавить груз" Тогда
		ТоварыДобавить(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Редактирование_ОтправительШаблонаПриИзменении(Элемент)
	
	ОбновитьДанныеФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	СформироватьТребуемоеДействиеСтрокиТовара(Элемент.ТекущиеДанные);
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> "ТоварыТребуемоеДействие" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТребуемоеДействие = ТекДанные.ТребуемоеДействие;
	ПараметрыТекСтрока = ВыбраннаяСтрока;
	Если ТребуемоеДействие = "Указать Номенклатуру" Тогда
		
		ТипСправочникаНоменклатура = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяСправочникаНоменклатура");
		ИмяФормыОткрытия = "Справочник." + ТипСправочникаНоменклатура + ".ФормаВыбора";
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы(
			ИмяФормыОткрытия,, ЭтаФорма, ЭтаФорма, "ОбработчикВыбораНоменклатуры", ПараметрыТекСтрока);
		
	ИначеЕсли ТребуемоеДействие = "Указать Единицу измерения" Тогда
		
		Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыУпаковкаЕдиницаИзмерения;
		Элементы.Товары.ИзменитьСтроку();
		
	ИначеЕсли ТребуемоеДействие = "Указать Количество" Тогда
		
		Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыКоличество;
		Элементы.Товары.ИзменитьСтроку();
		
	ИначеЕсли ТребуемоеДействие = "Установить соответствие" Или ТребуемоеДействие = "Не учитывается" Тогда
		
		ОткрытьСоответствияТекущейСтроки();
		
	Иначе // Требуемое действие от таблицы ошибок
		
		ОбработатьТребуемоеДействие(ТребуемоеДействие, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ОтборСтрок = Неопределено;
	
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда
		ОтборСтрок = Новый ФиксированнаяСтруктура(
			"ИдентификаторСтрокиТоваров", Элемент.ТекущиеДанные.ИдентификаторСтроки);
	КонецЕсли;
	
	Элементы.Маркировки.ОтборСтрок = ОтборСтрок;
	
	КонтурЛогистика_ПанельОшибокКлиент.УстановитьОтборТаблицыОшибокПоНомеруСтроки(
		ТаблицаОшибок, Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто") Тогда
		Объект.МассаБруттоКг = МассаПлановаяБруттоКгТоваров();
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест") Тогда
		Объект.КоличествоМест = КоличествоМестТоваров();
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоМестПриИзменении(Элемент)
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест") Тогда
		Объект.КоличествоМест = КоличествоМестТоваров();
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМассаПлановаяБруттоКгПриИзменении(Элемент)
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто") Тогда
		Объект.МассаБруттоКг = МассаПлановаяБруттоКгТоваров();
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПодробныеСведенияНажатие(Элемент)
	
	СкрытьПодробностиТоваров = Истина;
	УстановитьСвернутостьПодробностейОТоварах();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаРазвернутьПодробностиТоваровНажатие(Элемент)
	
	СкрытьПодробностиТоваров = Ложь;
	УстановитьСвернутостьПодробностейОТоварах();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвернутостьПодробностейОТоварах()
	
	Элементы.ГруппаПодробныеСведенияСвернутая.Видимость = СкрытьПодробностиТоваров;
	Элементы.ГруппаПодробныеСведения.Видимость = Не Элементы.ГруппаПодробныеСведенияСвернутая.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура МаркировкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрНастроекПодписанияПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПлотностьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанные.Плотность = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОкруглитьПлотность(ТекущиеДанные.Плотность);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУчитыватьПриИзменении(Элемент)
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест") Тогда
		Объект.КоличествоМест = КоличествоМестТоваров();
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто") Тогда
		Объект.МассаБруттоКг = МассаПлановаяБруттоКгТоваров();
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// Если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(
		ТекущийСтатус, ЭтаФорма, РезультатПроверки, КодТекущегоСтатусаДокументооборота = "r-rejected");
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	
	ПанельОшибокСвернутьРазвернутьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьШапку(Команда)
	
	ШапкаНаОтдельнойЗакладке = Истина;
	УстановитьПоложениеШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьШапку(Команда)
	
	ШапкаНаОтдельнойЗакладке = Ложь;
	УстановитьПоложениеШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоДокОснованию(Команда)
	
	ПерезаполнитьПоДокОснованиюСервер();
	
	ОбновитьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДобавить(Команда)
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	НоваяСтрока.Учитывать = Истина;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики()
		И КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ИспользуютсяХарактеристики() Тогда
		
		НоваяСтрока.Характеристика =  КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ПустаяХарактеристика();
	КонецЕсли;
	
	ПроверитьДокумент();
	
	ЗаполнитьТребуемыеДействияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкопировать(Команда)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	НоваяСтрока.Учитывать = Истина;
	
	Если ТекСтрока <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,, "ИдентификаторСтроки");
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьНеучитываемые(Команда)
	
	СкрытьНеучитываемые = Не СкрытьНеучитываемые;
	УстановитьВидимостьНеучитываемыхИФильтраОшибок();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНеучитываемыхИФильтраОшибок()
	
	КонтурЛогистика_ОбработкаДокументовКлиент.УстановитьВидимостьНеучитываемыхИФильтраОшибок(
		Объект.Товары, СкрытьНеучитываемые, Элементы.Товары, Элементы.ТоварыИтоги);
	
	// Лишним не будет
	Элементы.ОтключитьФильтрТаблицыОшибокТовары.Видимость = ЗначениеЗаполнено(ОтборТаблицыОшибокЗначениеТовары);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьФильтрТаблицыОшибокТовары(Команда)
	
	ОтборТаблицыОшибокЗначениеТовары = "";
	
	Если Элементы.Товары.ОтборСтрок <> Неопределено Тогда
		
		ВременнаяСтруктура = Новый Структура(Элементы.Товары.ОтборСтрок);
		
		Если ВременнаяСтруктура.Свойство("ПризнакОтбораТаблицыОшибок") Тогда
			ВременнаяСтруктура.Удалить("ПризнакОтбораТаблицыОшибок");
			Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(ВременнаяСтруктура);
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ОтключитьФильтрТаблицыОшибокТовары.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствияНоменклатуры(Команда)
	
	ОткрытьСоответствияТекущейСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьНесопоставленныеНеУчитываемыми(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КоличествоМест", 0);
	ПараметрыОтбора.Вставить("МассаПлановаяБруттоКг", 0);
	ПараметрыОтбора.Вставить("ОтгрузочноеНаименование", "");
	ПараметрыОтбора.Вставить("Учитывать", Истина);
	
	НесопоставленныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
	
	Если НесопоставленныеСтроки.Количество() > 0 Тогда
		
		Для Каждого текСтр Из НесопоставленныеСтроки Цикл
			СделатьСтрокуТовараНеучитываемой(текСтр);
		КонецЦикла;
		
		ОбновитьПредставлениеДанных();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗначенияДокументаУчетнойСистемы(Команда)
	
	РеквизитыУчетногоДокументаВидимы = Не РеквизитыУчетногоДокументаВидимы;
	Если РеквизитыУчетногоДокументаВидимы Тогда 
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Скрыть;
	Иначе
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Показать;
	КонецЕсли;
	
	СкрытьПоказатьЗначенияДокУчСист();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьЗначенияДокУчСист()
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуКонвертации(Команда)
	
	КонтурЛогистика_ОбработкаДокументовКлиент.ОткрытьНастройкуКонвертации(
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка"), Объект.ДокументОснование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	УстановитьПоложениеСохраняемыхЭлементов();
	
	УстановитьФорматыКолонокСКоличеством();
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеСохраняемыхЭлементов()
	
	УстановитьВидимостьНеучитываемыхИФильтраОшибок();
	
	УстановитьПоложениеШапки();
	
	УстановитьСвернутостьПодробностейОТоварах();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФорматыКолонокСКоличеством()
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(
		Объект.Товары, "МассаПлановаяНеттоКг", Элементы.ТоварыМассаПлановаяНеттоКг);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(
		Объект.Товары, "МассаПлановаяБруттоКг", Элементы.ТоварыМассаПлановаяБруттоКг);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(
		Объект.Товары, "Количество", Элементы.ТоварыКоличество);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(
		Объект.Товары, "Плотность", Элементы.ТоварыПлотность);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	// Видимость номенклатуры в зависимости от того есть ли там номенклатура (она есть если отправляли Т1 из этой базы)
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьВидимостьКолонкиПоЗаполненностиЗначения(
		Объект.Товары, "Номенклатура", Элементы.ТоварыГруппаНоменклатура);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьВидимостьКолонкиПоЗаполненностиЗначения(
		Объект.Товары, "Номенклатура", Элементы.ТоварыХарактеристика);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьВидимостьКолонкиПоЗаполненностиЗначения(
		Объект.Товары, "Номенклатура", Элементы.ТоварыГруппаЕдиницы);
	
	СкрытьПоказатьЗначенияДокУчСист();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийКодСостоянияДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.Ссылка).Код;
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.Ссылка);
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда
		
		ПерешелВЛогистическиеСтатус = Истина;
	Иначе
		ПерешелВЛогистическиеСтатус = Ложь;
	КонецЕсли;
	Элементы.ТекущийСтатус.Видимость = Не ПерешелВЛогистическиеСтатус;
	Элементы.ТекущийСтатусДокументооборота.Видимость = ПерешелВЛогистическиеСтатус;
	
	ВозможностьОтветнойПодписи = ВозможностьОтветнойПодписи();
	
	Если ТекущийКодСостоянияДокументооборота = "fr-сheck-forwarder"
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		
		ВозможностьПодписанияИОтправки = Не ВозможностьОтветнойПодписи;
	Иначе
		ВозможностьПодписанияИОтправки = Ложь;
	КонецЕсли;
	
	ДоступнаОсновнаяКнопкаПоУмолчанию = Не ВозможностьОтветнойПодписи И ВозможностьПодписанияИОтправки;
	ДоступностьКнопкиСогласования = ВозможностьОтветнойПодписи;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Повторно выполнить задачу";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Выполнить задачу";
	КонецЕсли;
	
	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Элементы.ПерезаполнитьПоДокОснованию.Видимость = Не ЭтоВходящий И ЕстьДокУчСист;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = ЭтоВходящий И Не ЕстьДокУчСист;
	Элементы.ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = Не ЕстьДокУчСист;
	
	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(
		Объект.Ссылка, Объект.ДокументОснование,
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус);
	
	Если ЗначениеЗаполнено(Объект.ОтправительШаблона) И ТекущийКодСостоянияДокументооборота = "" Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Отправить шаблон экспедитору";
	КонецЕсли;
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_Согласовать.Видимость = ДоступностьКнопкиСогласования;
	
	Если Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.КнопкаПоУмолчанию = Истина;
	ИначеЕсли Элементы.ФормаОбщаяКомандаКонтурЛогистика_Согласовать.Видимость Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_Согласовать.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Элементы.ОткрытьНастройкуКонвертации.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеДанных()
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	ЗаполнитьТребуемыеДействияТоваров();
	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипыДокументаОснованияНастроеныДляТитула()
	
	ТипыНастроены = Истина;
	
	РеквизитМД = Метаданные.Документы["КонтурЛогистика_ЭкспедиторскаяРасписка"].Реквизиты.ДокументОснование;
	
	МассивТипов = РеквизитМД.Тип.Типы();
	
	Если МассивТипов.Количество() = 1 И МассивТипов.Найти(Тип("ДокументСсылка.КонтурЛогистика_Вспомогательный")) = 0 Тогда
		ТипыНастроены = Ложь;
	КонецЕсли;
	
	Возврат ТипыНастроены;
	
КонецФункции

&НаСервере
Процедура УправлениеЭлементамиФормыВЗависимостиОтСтатуса()
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		
		ЛокальныйТолькоПросмотр = Ложь;
	Иначе
		ЛокальныйТолькоПросмотр = Истина;
	КонецЕсли;
	
	ВозможностьОтветнойПодписи = ВозможностьОтветнойПодписи();
	
	Если ВозможностьОтветнойПодписи Тогда 
		ЛокальныйТолькоПросмотр = Истина;
	КонецЕсли;
	
	ВозможностьПодписанияИОтправки = Не ЛокальныйТолькоПросмотр И Не ВозможностьОтветнойПодписи;
	
	Элементы.ГруппаШапкаМестоположение.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.Товары.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.Маркировки.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	Элементы.СтраницаДополнительныеПоля.ТолькоПросмотр = ЛокальныйТолькоПросмотр;
	
	Элементы.ТоварыСкопировать.Видимость = Не ЛокальныйТолькоПросмотр;
	Элементы.ТоварыДобавить.Видимость = Не ЛокальныйТолькоПросмотр;
	Элементы.ТоварыГруппаТребуемоеДействие.Видимость = Не ЛокальныйТолькоПросмотр;
	Элементы.ТоварыГруппаУправление.Видимость = Не ЛокальныйТолькоПросмотр;
	
	// ПодменюУправление
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_СформироватьФайлыОбмена", Не ЛокальныйТолькоПросмотр);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный", Ложь);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке", Ложь);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаПодписание", Ложь);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить", ВозможностьПодписанияИОтправки);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИПодготовитьКОтправке", ВозможностьПодписанияИОтправки);
	ИзменитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_Согласовать", ВозможностьОтветнойПодписи);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьДоступностьЭлемента(ИмяЭлемента, ЗначениеДоступности)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент <> Неопределено Тогда
		НайденныйЭлемент.Доступность = ЗначениеДоступности;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВозможностьОтветнойПодписи()
	
	ТребуетсяОтветнаяПодпись = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ТребуетсяОтветнаяПодписьЗаказчикаЭР");
	
	Если ТекущийКодСостоянияДокументооборота = "fr-сheck-cargo-owner"
		И ТребуетсяОтветнаяПодпись Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПоложениеШапки()
	
	Если ШапкаНаОтдельнойЗакладке Тогда
		
		текАктивнаяЗакладка = Элементы.Страницы.ТекущаяСтраница;
		
		ПереместитьШапкуВызовСервера();
		Элементы.СвернутьШапку.Видимость = Ложь;
		Элементы.РазвернутьШапку.Видимость = Истина;
		
		ПанельОшибокРазвернута = Элементы.ПанельОшибок.РастягиватьПоВертикали;
		Если Не ПанельОшибокРазвернута Тогда
			ПанельОшибокСвернутьРазвернутьВызовОМ();
		КонецЕсли;
		
		Элементы.Страницы.ТекущаяСтраница = текАктивнаяЗакладка;
		
	Иначе
		
		ПереместитьШапкуВызовСервера();
		Элементы.СвернутьШапку.Видимость = Истина;
		Элементы.РазвернутьШапку.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПереместитьШапкуВызовСервера()
	
	Если ШапкаНаОтдельнойЗакладке Тогда
		Если Элементы.СтраницаШапка.ПодчиненныеЭлементы.Найти(Элементы.ГруппаШапкаДанные.Имя) = Неопределено Тогда
			КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(
				ЭтаФорма, Элементы.ГруппаШапкаДанные, Элементы.СтраницаШапка);
		КонецЕсли;
	Иначе
		Если Элементы.ГруппаШапкаМестоположение.ПодчиненныеЭлементы.Найти(Элементы.ГруппаШапкаДанные.Имя) = Неопределено Тогда
			КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(
				ЭтаФорма, Элементы.ГруппаШапкаДанные, Элементы.ГруппаШапкаМестоположение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	Если ТекущийКодСостоянияДокументооборота = "fr-wait-forwarder"
		Или ТекущийКодСостоянияДокументооборота = "fr-wait-cargo-owner"
		Или ТекущийКодСостоянияДокументооборота = "fr-completed" Тогда
		
		ВсегдаВыводитьРезультатВалидации = Ложь;
	Иначе
		ВсегдаВыводитьРезультатВалидации = Истина;
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(
		ТекущийСтатус, ЭтаФорма, РезультатПроверки, ВсегдаВыводитьРезультатВалидации);
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьПиктограммыОшибокТабличнойЧасти(
		Объект.Товары, ТаблицаОшибок, "Товары", "КартинкаОшибок");
	
	ЗаполнитьТребуемыеДействияТоваров(); // Требуемые действия зависят от результатов проверки
	УправлениеВидимостьюИДоступностью(); // Доступность команд
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ЭкспедиторскаяРасписка.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		СтрокаТовара.Картинка = 0;
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьПредставлениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТребуемыеДействияТоваров()
	
	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьТребуемоеДействие(ТребуемоеДействие, ПолеТаблицыОшибок = Неопределено)
	
	// Реализуем отдельную обработку некоторых требуемых действий
	Если Ложь Тогда // Какие-то особенные UI для требуемых действий, например: ТребуемоеДействие = "Исправить GTIN" Тогда
	
	Иначе // Типовая обработка таблицы ошибок
		
		Если ПолеТаблицыОшибок <> Неопределено Тогда
			КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, ПолеТаблицыОшибок.Имя);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствияТекущейСтроки()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = "Табличная часть пуста! Сначала добавьте товар.";
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения);	
		
	Иначе

		текНоменклатура 	= ТекущиеДанные.Номенклатура;
		текЕдиница 			= ТекущиеДанные.УпаковкаЕдиницаИзмерения;
		текХарактеристика 	= ТекущиеДанные.Характеристика;
		
		КонтурЛогистика_КонвертацияКлиент.ОткрытьСоответствияНоменклатуры(текНоменклатура, текЕдиница, текХарактеристика, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара)
	
	Если СтрокаТовара = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТовара.ТребуемоеДействие = "";
	
	// Блок 1 - Требуемые действия ведения пользователя за ручку по номенклатуре
	Если Не СтрокаТовара.Учитывать Тогда
		СтрокаТовара.ТребуемоеДействие = "Не учитывается";
		Возврат;
	КонецЕсли;
	
	// Для исходящих одни требуемые действия, а для исходящих другие
	Если ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен") Тогда
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ИспользоватьИПрименятьБазовыеСоответствия") Тогда 
			// Эти требуемые действия блока 1 не являются блокирующими по документу - они только ведут пользователя
			Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) И Не СтрокаТовара.Свернута Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Номенклатуру";
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.УпаковкаЕдиницаИзмерения) И Не СтрокаТовара.Свернута Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Единицу измерения";
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.Количество) И Не СтрокаТовара.Свернута Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Количество";
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.КоличествоМест)
				Или Не ЗначениеЗаполнено(СтрокаТовара.СпособУпаковки)
				Или Не ЗначениеЗаполнено(СтрокаТовара.СостояниеГруза)
				Или Не ЗначениеЗаполнено(СтрокаТовара.ВидТары)
				Или Не ЗначениеЗаполнено(СтрокаТовара.МассаПлановаяБруттоКг)
				Или Не ЗначениеЗаполнено(СтрокаТовара.ОтгрузочноеНаименование) Тогда
				
				Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ТребоватьНаличиеБазовыхСоответствий") Тогда
					СтрокаТовара.ТребуемоеДействие = "Установить соответствие";
				Иначе
					СтрокаТовара.ТребуемоеДействие = "Заполнить обязательные поля";
				КонецЕсли;
				
			Иначе
				СтрокаТовара.ТребуемоеДействие = "Готов";
			КонецЕсли;
			
			Если СтрокаТовара.Свернута Тогда 
				СтрокаТовара.ТребуемоеДействие = СтрокаТовара.ТребуемоеДействие + ", свернута";
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			СтрокаТовара.ТребуемоеДействие = "Сопоставить";
		Иначе
			СтрокаТовара.ТребуемоеДействие = "ОК";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Товары.Очистить();
	Объект.ИнфПол.Очистить();
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.Заполнить(Новый Структура("ДокументОснование, ТипЛогистика", 
		ДокОбъект.ДокументОснование, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка));
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)
	
	ПараметрыФормыПоиска = Новый Структура();
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);
	
	ПараметрыОбработчика = Новый Структура();
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);
	
	Если Элемент.Имя = "ДокУчСист_Грузоотправитель"
		Или Элемент.Имя = "ДокУчСист_Клиент"
		Или Элемент.Имя = "ДокУчСист_ОтправительШаблона"
		Или Элемент.Имя = "ДокУчСист_Экспедитор" Тогда
		
		ИмяСущности = "КонтурЛогистика_ОрганизацииДиадок";
		
	Иначе
		
		ВызватьИсключение "Не реализовано";
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник." + ИмяСущности + ".ФормаВыбора", ПараметрыФормыПоиска, ЭтаФорма, ЭтаФорма,
		"ОбработчикВыбораСопоставленияРеквизитаДокумента", ПараметрыОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСопоставленияРеквизитаДокумента(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Выполнить переконвертацию или присваивание
	ПовторноСконвертироватьРеквизит(ДопПараметры.ИмяЭлементаФормы);
	
	ОбновитьПредставлениеДанных();
	
	ОбновитьДанныеФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПовторноСконвертироватьРеквизит(ИмяЭлементаФормы)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	ИмяРеквизита = СтрЗаменить(ИмяЭлементаФормы, "ДокУчСист_", "");
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "_Сопоставить", "");
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование", Объект.ДокументОснование);
	ДанныеЗаполнения.Вставить("ТипЛогистика", Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка);
	
	ДокОбъект.Заполнить(ДанныеЗаполнения);
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьСтрокуТовараНеучитываемой(Знач ТекДанныеТоваров)
	
	СделатьНоменклатуруНеучитываемой(ТекДанныеТоваров.Номенклатура, ТекДанныеТоваров.УпаковкаЕдиницаИзмерения);
	
	// Эта номенклатура может быть еще в других строках
	// Требуется переконвертировать все строки с этой номенклатурой
	ПараметрыОтбора = Новый Структура("Номенклатура", ТекДанныеТоваров.Номенклатура);
	МассивСтрокСЭтойНоменклатурой = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаПереконвертации Из МассивСтрокСЭтойНоменклатурой Цикл
		СконвертироватьСтрокуТоваровКлиент(СтрокаПереконвертации.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СделатьНоменклатуруНеучитываемой(Номенклатура, УпаковкаЕдиницаИзмерения)
	
	СтруктураПрисвоения = Новый Структура;
	СтруктураПрисвоения.Вставить("Учитывать", Ложь);
	СтруктураПрисвоения.Вставить("УпаковкаЕдиницаИзмерения", УпаковкаЕдиницаИзмерения);
	
	РегистрыСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.ПрисвоитьСоответствиеНоменклатуры(
		Номенклатура, СтруктураПрисвоения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикИзмененияСоответствий(Параметр, ДопПараметр) Экспорт
	
	Если Не ЗначениеЗаполнено(ДопПараметр) Тогда
		Возврат;
	КонецЕсли;
	
	локМассивСтрокСЭтойНоменклатурой = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ДопПараметр));
	локМассивИдентификаторов = Новый Массив();
	
	Для Каждого СтрокаПереконвертации Из локМассивСтрокСЭтойНоменклатурой Цикл
		СконвертироватьСтрокуТоваровКлиент(СтрокаПереконвертации.ПолучитьИдентификатор());
		локМассивИдентификаторов.Добавить(СтрокаПереконвертации.ИдентификаторСтроки);
	КонецЦикла;
	
	ОбновитьПредставлениеДанных();
	
	ТоварыКоличествоМестПриИзменении(Неопределено);
	ТоварыМассаПлановаяБруттоКгПриИзменении(Неопределено);
	
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьЗаголовкиКоличества(Форма)
	
	КоличествоМест = 0;
	
	Для Каждого ТекущаяСтрока Из Форма.Объект.Товары Цикл
		Если Не ТекущаяСтрока.Учитывать Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоМест = КоличествоМест + ТекущаяСтрока.КоличествоМест;
	КонецЦикла;
	
	Форма.Элементы.ТоварыКоличествоМест.Заголовок = КоличествоМест;
	
	Форма.Элементы.ТоварыКоличество.Заголовок = Форма.Объект.Товары.Итог("Количество");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораНоменклатуры(ВыбранноеЗначение, ПараметрИдСтрокиТоваров) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Объект.Товары.НайтиПоИдентификатору(ПараметрИдСтрокиТоваров);
	ТекДанные.Номенклатура = ВыбранноеЗначение;
	
	ОбработчикПереконвертироватьСтроку(ПараметрИдСтрокиТоваров, ТекДанные);
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораЕдиницыИзмерения(ВыбранноеЗначение, ПараметрИдСтрокиТоваров) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Объект.Товары.НайтиПоИдентификатору(ПараметрИдСтрокиТоваров);
	ТекДанные.УпаковкаЕдиницаИзмерения = ВыбранноеЗначение;
	
	ОбработчикПереконвертироватьСтроку(ПараметрИдСтрокиТоваров, ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПереконвертироватьСтроку(ИдСтрокиТоваров, ТекДанные)
	
	СконвертироватьСтрокуТоваровКлиент(ИдСтрокиТоваров);
	СформироватьТребуемоеДействиеСтрокиТовара(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СконвертироватьСтрокуТоваровКлиент(ИдентификаторСтрокиТоваров)
	
	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтрокиТоваров);
	
	Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) И ЗначениеЗаполнено(ТекСтрока.УпаковкаЕдиницаИзмерения) Тогда
		СконвертироватьСтрокуТоваров1СвЛогистика(ИдентификаторСтрокиТоваров);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СконвертироватьСтрокуТоваров1СвЛогистика(ИдентификаторСтрокиТоваров)
	
	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтрокиТоваров);
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.СконвертироватьСтрокуТоваров1СвЛогистика(СтрокаТоваров.НомерСтроки);
	
	ЗаполнитьЗначенияСвойств(СтрокаТоваров, ДокОбъект.Товары[СтрокаТоваров.НомерСтроки - 1]);
	// Маркировки проч не переносим т.к. можно потерять данные
	
КонецПроцедуры

&НаКлиенте
Функция КоличествоМестТоваров()
	
	КоличествоМест = 0;
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если Не ТекущаяСтрока.Учитывать Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоМест = КоличествоМест + ТекущаяСтрока.КоличествоМест;
	КонецЦикла;
	
	Возврат КоличествоМест;
	
КонецФункции

&НаКлиенте
Функция МассаПлановаяБруттоКгТоваров()
	
	КоличествоЕдиниц = 0;
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если Не ТекущаяСтрока.Учитывать Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоЕдиниц = КоличествоЕдиниц + ТекущаяСтрока.МассаПлановаяБруттоКг;
	КонецЦикла;
	
	Возврат КоличествоЕдиниц;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТекИдентификаторСтрокиТовара(Знач НоваяСтрока, Знач Элемент)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ИдентификаторСтрокиТоваров = Элементы.Товары.ТекущиеДанные.ИдентификаторСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()
	
	Представления = ПолучитьПредставлениеРеквизитовДокументаОснования(Объект.ДокументОснование, Объект);
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		
		Значение = Неопределено;
		
		ИмяЭлементаЛогистика = Эл.Значение; // сконвертированного
		ИмяЭлементаНадписиСопоставить = "ДокУчСист_" + Эл.Ключ + "_Сопоставить";
		ИмяЭлементаЗначениеИзДокУчСист = "ДокУчСист_" + Эл.Ключ;
		ИмяЭлементаРедактированиеЭТРН = "Редактирование_" + Эл.Ключ;
		
		Если Представления.Свойство("ДокУчСист_" + Эл.Ключ, Значение) Тогда
			
			// Есть значение в реквизите ДокУчСист_ххх извлеченного из Документа учетной системы
			текВыражение = "ДокУчСист_" + Эл.Ключ + " = Значение";
			Выполнить (текВыражение);
			
			// Определим доступность команды сопоставления
			Если Не ЗначениеЗаполнено(ИмяЭлементаЛогистика) Тогда
				Продолжить;
			КонецЕсли;
			
			ПутьПроверкиДанных = Элементы.Найти(ИмяЭлементаЛогистика).ПутьКДанным;
			
			РеквизитИзвлеченИзДокумента = ЗначениеЗаполнено(Этаформа[ИмяЭлементаЗначениеИзДокУчСист]);
			
			Если Элементы.Найти(ИмяЭлементаРедактированиеЭТРН) <> Неопределено Тогда
				Элементы.Найти(ИмяЭлементаРедактированиеЭТРН).Видимость = Не РеквизитИзвлеченИзДокумента;
			КонецЕсли;
			
			Если РеквизитИзвлеченИзДокумента Тогда // Если этот элемент выведен на форму и он рассчитан из документа уч сист
				
				Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
					ЗначениеВРеквизите = Вычислить(ПутьПроверкиДанных);
					НужноСопоставить = Не ЗначениеЗаполнено(ЗначениеВРеквизите);
				Иначе
					НужноСопоставить = Ложь;
				КонецЕсли;
				
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость = Не НужноСопоставить;
				Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = НужноСопоставить;
				Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = НужноСопоставить Или РеквизитыУчетногоДокументаВидимы;
				Элементы.Найти(ИмяЭлементаНадписиСопоставить).Заголовок = "Сопоставить";
				Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Установить новое соответствие";
				
			Иначе // Не извлечен из документа Уч сист
				
				Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = Ложь;
				Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = Ложь;
				
				Если Элементы.Найти(ИмяЭлементаРедактированиеЭТРН) <> Неопределено Тогда 
					Элементы.Найти(ИмяЭлементаЛогистика).Видимость = Ложь;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка =
						"Не извлечен или не заполнен в док. основании. Открыть исходный документ";
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			// Не выведено поле ДокументаУчетной системы - только выберем видимость в пользу поля ввода РедактированиеЭТРНххх вместо ДокументЭТРНххх
			ЕстьЭлементРедактированиеЭТРН = Элементы.Найти(ИмяЭлементаРедактированиеЭТРН) <> Неопределено;
			Если ЕстьЭлементРедактированиеЭТРН Тогда 
				Элементы.Найти(ИмяЭлементаРедактированиеЭТРН).Видимость = Не ТолькоПросмотр И ЕстьЭлементРедактированиеЭТРН;
			КонецЕсли;
				
			Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость = ТолькоПросмотр ИЛИ Не ЕстьЭлементРедактированиеЭТРН;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРеквизитовДокументаОснования(ДокументОснование, Знач ДокументТитулОбъект)
	
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	СтруктураПредставлений = Новый Структура();
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		СтруктураПредставлений.Вставить("ДокУчСист_" + Эл.Ключ);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат СтруктураПредставлений;
	КонецЕсли;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка, ДокументОснование);
	
	Если НастройкаКонвертации = Неопределено Тогда
		Возврат СтруктураПредставлений;
	КонецЕсли;
	
	Переменные = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьПеременные(
		ДокументТитулОбъект, ДокументОснование, НастройкаКонвертации, "");
	
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		
		НастройкаКонвертацииРеквизита = НастройкаКонвертации.ПравилаКонвертацииТитулаРеквизиты.Найти(
			Эл.Ключ, "РеквизитТитула");
		ТекущийОбъектДляВычисления = ДокументТитулОбъект;
		
		Если НастройкаКонвертацииРеквизита = Неопределено Тогда 
			// Настройка не введена
			Продолжить;
		КонецЕсли;
		
		РезультатВычисления = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьРеквизитОснования(
			ДокументОснование, НастройкаКонвертацииРеквизита, НастройкаКонвертации,
			ТекущийОбъектДляВычисления, Ложь, Переменные);
		
		Если РезультатВычисления.Успешно Тогда
			СтруктураПредставлений.Вставить("ДокУчСист_" + Эл.Ключ, РезультатВычисления.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураПредставлений;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()
	
	МассивКонвертируемыхРеквизитов = Новый Соответствие();
	МассивКонвертируемыхРеквизитов.Вставить("ОтправительШаблона", "ОтправительШаблона");
	МассивКонвертируемыхРеквизитов.Вставить("Грузоотправитель", "Грузоотправитель");
	МассивКонвертируемыхРеквизитов.Вставить("Клиент", "Клиент");
	МассивКонвертируемыхРеквизитов.Вставить("Экспедитор", "Экспедитор");
	
	Возврат МассивКонвертируемыхРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

#Область Сертификаты

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Элемент)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ПанельОшибок

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()
	
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти