#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Для товаров и складов из временной таблицы получает информацию о свободном для продажи количестве, суммарно по всем складам.
//
// Параметры:
//  ИмяТаблицыТовары - Строка - Имя временной таблицы товаров.
//
// Возвращаемое значение:
//  Строка - Текст запроса временной таблицы "ВтСвободноДляПродажи".
//
Функция ВременнаяТаблицаСвободноДляПродажиСуммарноПоСкладам(ИмяТаблицыТовары) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Склад КАК Склад,
		|	Запасы.Назначение КАК Назначение,
		|	Запасы.ВНаличииОстаток КАК ВНаличииОстаток,
		|	Запасы.ЗаблокированоВНаличииОстаток КАК ЗаблокированоВНаличииОстаток,
		|	Запасы.ЗаказаноОстаток КАК ЗаказаноОстаток,
		|	Запасы.ПоступитОстаток КАК ПоступитОстаток,
		|	Запасы.ЗаблокированоПоступитОстаток КАК ЗаблокированоПоступитОстаток,
		|	Запасы.РезервироватьНаСкладеОстаток КАК РезервироватьНаСкладеОстаток,
		|	Запасы.РезервироватьПоМереПоступленияОстаток КАК РезервироватьПоМереПоступленияОстаток,
		|	Запасы.ОтложитьРезервированиеОстаток КАК ОтложитьРезервированиеОстаток,
		|	Запасы.КОбеспечениюОстаток КАК КОбеспечениюОстаток,
		|	Запасы.НеОбеспечиватьОстаток КАК НеОбеспечиватьОстаток
		|ПОМЕСТИТЬ ЗапасыИПотребностиОстатки
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
		|		(Номенклатура, Характеристика, Склад, Назначение) В(
		|			ВЫБРАТЬ
		|				ТоварыКорзины.Номенклатура КАК Номенклатура,
		|				ТоварыКорзины.Характеристика КАК Характеристика,
		|				ТоварыКорзины.Склад КАК Склад,
		|				ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение
		|			ИЗ
		|				&ВтТовары КАК ТоварыКорзины)) КАК Запасы
		|;
		|
		|//////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Расчет.Номенклатура КАК Номенклатура,
		|	Расчет.Характеристика КАК Характеристика,
		|	СУММА(Расчет.КоличествоДляДействияОтгрузить) КАК Свободно
		|ПОМЕСТИТЬ ВтСвободноДляПродажи
		|ИЗ
		|	РасчетОстатковДляУстановкиДействий КАК Расчет
		|СГРУППИРОВАТЬ ПО
		|	Расчет.Номенклатура,
		|	Расчет.Характеристика
		|ИМЕЮЩИЕ
		|	СУММА(Расчет.КоличествоДляДействияОтгрузить) <> 0
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика
		|;
		|УНИЧТОЖИТЬ ЗапасыИПотребностиОстатки";
	
	ИменаТаблиц = ОбеспечениеВДокументахСервер.НовыеИменаТаблицДляРасчетаОстатковДляУстановкиДействий();
	ИменаТаблиц.Остатки = "ЗапасыИПотребностиОстатки"; // @query-part-1
	ИменаТаблиц.Результат = "РасчетОстатковДляУстановкиДействий"; // @query-part-1
	ОбеспечениеВДокументахСервер.РасчетОстатковДляУстановкиДействий(ТекстЗапроса, ИменаТаблиц);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВтТовары", ИмяТаблицыТовары);
	Возврат ТекстЗапроса;
	
КонецФункции

// Для товаров и складов из временной таблицы получает необходимые временные таблицы для расчета ближайшей доступности товара на складе.
//
// Параметры:
//  ИмяТаблицыТовары - Строка - Имя временной таблицы товаров.
//
// Возвращаемое значение:
//  Строка - Текст запроса временных таблиц "ВтБлижайшиеДатыДоступности", "ВтДоступныеОстаткиПоДатам".
//
Функция ВременныеТаблицыДляРасчетаДоступныхОстатков(ИмяТаблицыТовары) Экспорт
	
	Тексты = Новый Массив();
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Склад КАК Склад,
		|	Запасы.Назначение КАК Назначение,
		|	Запасы.ВНаличииОстаток КАК ВНаличииОстаток,
		|	Запасы.ЗаблокированоВНаличииОстаток КАК ЗаблокированоВНаличииОстаток,
		|	Запасы.ЗаказаноОстаток КАК ЗаказаноОстаток,
		|	Запасы.ПоступитОстаток КАК ПоступитОстаток,
		|	Запасы.ЗаблокированоПоступитОстаток КАК ЗаблокированоПоступитОстаток,
		|	Запасы.РезервироватьНаСкладеОстаток КАК РезервироватьНаСкладеОстаток,
		|	Запасы.РезервироватьПоМереПоступленияОстаток КАК РезервироватьПоМереПоступленияОстаток,
		|	Запасы.ОтложитьРезервированиеОстаток КАК ОтложитьРезервированиеОстаток,
		|	Запасы.КОбеспечениюОстаток КАК КОбеспечениюОстаток,
		|	Запасы.НеОбеспечиватьОстаток КАК НеОбеспечиватьОстаток
		|ПОМЕСТИТЬ ЗапасыИПотребностиОстатки
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
		|		(Номенклатура, Характеристика, Склад, Назначение) В
		|			(ВЫБРАТЬ
		|				ТоварыКорзины.Номенклатура КАК Номенклатура,
		|				ТоварыКорзины.Характеристика КАК Характеристика,
		|				ТоварыКорзины.Склад КАК Склад,
		|				ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение
		|			ИЗ
		|				&ВтТовары КАК ТоварыКорзины)) КАК Запасы";
	Тексты.Добавить(ТекстЗапроса);
	
	Набор = Новый Массив();

	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Расчет.Номенклатура КАК Номенклатура,
		|	Расчет.Характеристика КАК Характеристика,
		|	Расчет.Склад КАК Склад,
		|	&НачалоТекущегоДня КАК Период,
		|	Расчет.КоличествоДляДействияОтгрузить КАК Количество
		|ПОМЕСТИТЬ ВтОжидаемоеПоступление
		|ИЗ
		|	РасчетОстатковДляУстановкиДействий КАК Расчет
		|ГДЕ
		|	Расчет.КоличествоДляДействияОтгрузить <> 0";
	ИменаТаблиц = ОбеспечениеВДокументахСервер.НовыеИменаТаблицДляРасчетаОстатковДляУстановкиДействий();
	ИменаТаблиц.Остатки = "ЗапасыИПотребностиОстатки"; // @query-part-1
	ИменаТаблиц.Результат = "РасчетОстатковДляУстановкиДействий"; // @query-part-1
	ОбеспечениеВДокументахСервер.РасчетОстатковДляУстановкиДействий(ТекстЗапроса, ИменаТаблиц);
	Набор.Добавить(ТекстЗапроса);

	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ОжидаемыеПоступления.Номенклатура    КАК Номенклатура,
		|	ОжидаемыеПоступления.Характеристика  КАК Характеристика,
		|	ОжидаемыеПоступления.Склад           КАК Склад,
		|	ВЫБОР КОГДА ОжидаемыеПоступления.ДатаДоступности <= ДОБАВИТЬКДАТЕ(&НачалоТекущегоДня, ДЕНЬ, 1) ТОГДА
		|				ДОБАВИТЬКДАТЕ(&НачалоТекущегоДня, ДЕНЬ, 1)
		|			ИНАЧЕ
		|				ОжидаемыеПоступления.ДатаДоступности
		|		КОНЕЦ КАК Период,
		|	СУММА(ОжидаемыеПоступления.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК ОжидаемыеПоступления
		|ГДЕ
		|	ОжидаемыеПоступления.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|	И ОжидаемыеПоступления.СостояниеЗапаса В(
		|		ЗНАЧЕНИЕ(Перечисление.СостоянияЗапаса.ВНаличииОжидаетсяРазблокировка),
		|		ЗНАЧЕНИЕ(Перечисление.СостоянияЗапаса.ОжидаетсяКПоступлению),
		|		ЗНАЧЕНИЕ(Перечисление.СостоянияЗапаса.ОжидаетсяКПоступлениюСБлокировкой))
		|	И ОжидаемыеПоступления.ХарактеристикаПотребности В(
		|		ЗНАЧЕНИЕ(Перечисление.ХарактеристикиПотребности.ОтложитьРезервирование),
		|		ЗНАЧЕНИЕ(Перечисление.ХарактеристикиПотребности.КОбеспечению),
		|		ЗНАЧЕНИЕ(Перечисление.ХарактеристикиПотребности.Излишек))
		|	И ИСТИНА В(
		|		ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА КАК УдловлетворяетОтбору
		|		ИЗ
		|			&ВтТовары КАК ТоварыКорзины
		|		ГДЕ
		|			ТоварыКорзины.Номенклатура = ОжидаемыеПоступления.Номенклатура
		|				И ТоварыКорзины.Характеристика = ОжидаемыеПоступления.Характеристика
		|				И ТоварыКорзины.Склад = ОжидаемыеПоступления.Склад)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОжидаемыеПоступления.Номенклатура,
		|	ОжидаемыеПоступления.Характеристика,
		|	ОжидаемыеПоступления.Склад,
		|	ВЫБОР КОГДА ОжидаемыеПоступления.ДатаДоступности <= ДОБАВИТЬКДАТЕ(&НачалоТекущегоДня, ДЕНЬ, 1) ТОГДА
		|				ДОБАВИТЬКДАТЕ(&НачалоТекущегоДня, ДЕНЬ, 1)
		|			ИНАЧЕ
		|				ОжидаемыеПоступления.ДатаДоступности
		|		КОНЕЦ
		|ИМЕЮЩИЕ
		|	СУММА(ОжидаемыеПоступления.Количество) <> 0";
	Набор.Добавить(ТекстЗапроса);
	ТекстЗапроса = СтрСоединить(Набор, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	Тексты.Добавить(ТекстЗапроса);
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОжидаемыеПоступления.Номенклатура КАК Номенклатура,
		|	ОжидаемыеПоступления.Характеристика КАК Характеристика,
		|	ОжидаемыеПоступления.Склад КАК Склад,
		|	ОжидаемыеПоступления.Период КАК Период,
		|	СУММА(РанееОжидаемыеПоступления.Количество) КАК Количество
		|ПОМЕСТИТЬ ВтДоступныеОстаткиПоДатам
		|ИЗ
		|	ВтОжидаемоеПоступление КАК ОжидаемыеПоступления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОжидаемоеПоступление КАК РанееОжидаемыеПоступления
		|		ПО ОжидаемыеПоступления.Номенклатура = РанееОжидаемыеПоступления.Номенклатура
		|			И ОжидаемыеПоступления.Характеристика = РанееОжидаемыеПоступления.Характеристика
		|			И ОжидаемыеПоступления.Склад = РанееОжидаемыеПоступления.Склад
		|			И ОжидаемыеПоступления.Период >= РанееОжидаемыеПоступления.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ОжидаемыеПоступления.Номенклатура,
		|	ОжидаемыеПоступления.Характеристика,
		|	ОжидаемыеПоступления.Склад,
		|	ОжидаемыеПоступления.Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВтОжидаемоеПоступление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступныеОстаткиПоДатам.Номенклатура КАК Номенклатура,
		|	ДоступныеОстаткиПоДатам.Характеристика КАК Характеристика,
		|	ДоступныеОстаткиПоДатам.Склад КАК Склад,
		|	МИНИМУМ(ДоступныеОстаткиПоДатам.Период) КАК Дата
		|ПОМЕСТИТЬ ВтБлижайшиеДатыДоступности
		|ИЗ
		|	ВтДоступныеОстаткиПоДатам КАК ДоступныеОстаткиПоДатам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаХарактеристика
		|		ПО ДоступныеОстаткиПоДатам.Склад = НастройкаХарактеристика.Склад
		|			И ДоступныеОстаткиПоДатам.Номенклатура = НастройкаХарактеристика.Номенклатура
		|			И ДоступныеОстаткиПоДатам.Характеристика = НастройкаХарактеристика.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаНоменклатура
		|		ПО ДоступныеОстаткиПоДатам.Склад = НастройкаНоменклатура.Склад
		|			И ДоступныеОстаткиПоДатам.Номенклатура = НастройкаНоменклатура.Номенклатура
		|			И (НастройкаНоменклатура.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|			И (НастройкаХарактеристика.Склад ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаСклад
		|		ПО ДоступныеОстаткиПоДатам.Склад = НастройкаСклад.Склад
		|			И (НастройкаСклад.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|			И (НастройкаСклад.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|			И (НастройкаХарактеристика.Склад ЕСТЬ NULL)
		|			И (НастройкаНоменклатура.Склад ЕСТЬ NULL)
		|ГДЕ
		|	ЕСТЬNULL(НастройкаХарактеристика.КонтролироватьСвободныеОстатки, ЕСТЬNULL(НастройкаНоменклатура.КонтролироватьСвободныеОстатки, НастройкаСклад.КонтролироватьСвободныеОстатки))
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеОстаткиПоДатам.Номенклатура,
		|	ДоступныеОстаткиПоДатам.Характеристика,
		|	ДоступныеОстаткиПоДатам.Склад
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Склад
		|;
		|УНИЧТОЖИТЬ ЗапасыИПотребностиОстатки
		|;
		|УНИЧТОЖИТЬ РасчетОстатковДляУстановкиДействий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
	Тексты.Добавить(ТекстЗапроса);
	ТекстЗапроса = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВтТовары", ИмяТаблицыТовары);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти


#КонецЕсли
