#Область ПанельСтатусыПодписиСертификатаМЧД

Процедура ВывестиСтатусыПодписиСертификатаМЧД(ДокументСсылка, Форма) Экспорт
	
	Файл = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ДокументСсылка);
	Если Не ЗначениеЗаполнено(Файл) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Файл.Отпечаток) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ВывестиГруппаСертификатМЧД(Форма, Файл);
		
		Если Файл.ПолномочияМЧДНеПрошлиПроверку Тогда
			ВывестиГруппаПредупреждениеПолномочияМЧД(Форма, Файл);
		КонецЕсли;
		
		Если Файл.СогласующиеПодписи.Количество() <> 0 Тогда
			// Выведем вторую подпись
			ВывестиГруппаСертификатМЧД(Форма, Файл, Истина);
		КонецЕсли;
		
	Исключение
		
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстОшибки = "Ошибка вывода статуса подписи.
			|Текст ошибки: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ВывестиГруппаПредупреждениеПолномочияМЧД(Форма, Файл)
	
	МЧДСсылка = Справочники.КонтурЛогистика_МЧД.НайтиПоРеквизиту("ИдентификаторДоверенности", Файл.ИдентификаторМЧД);		
	Если Не ЗначениеЗаполнено(МЧДСсылка) Тогда
	    Возврат;		
	КонецЕсли;
	
	Полномочие = Перечисления.КонтурЛогистика_Полномочия.ПолучитьПолномочиеПоТипуЛогистическогоДокумента(Файл.ТипДокумента);
	
	Форма.ДФИ_Полномочие = Полномочие;
	
	ТипТитула = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(Форма.Параметры.Ключ); 
	Если РегистрыСведений.КонтурЛогистика_НастройкиПолномочийМЧД.ПроверитьПолномочияМЧД(Файл.СвязанныйДокумент, МЧДСсылка, Полномочие, ТипТитула, Файл.Отпечаток) Тогда
		Возврат;	
	КонецЕсли;
	
	РодительГруппы = Форма.Элементы.Найти("ОсновнаяЧастьФормы");
		
	СвойстваГруппы = Новый Структура;
	СвойстваГруппы.Вставить("ЦветФона", Новый Цвет(255, 225, 0));
	СвойстваГруппы.Вставить("РастягиватьПоГоризонтали", Истина);
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(Форма, "ГруппаПредупреждениеПолномочияМЧД", РодительГруппы, 3, , , СвойстваГруппы, "ГруппаШапка");
	
	СвойстваКартинки = СвойстваДляКартинки("КонтурЛогистика_ВосклицаниеЧерный");
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(Форма, "КартинкаПредупреждениеПолномочияМЧД", "ГруппаПредупреждениеПолномочияМЧД", СвойстваКартинки);
			
	СвойстваЭФ = Новый Структура;
	СвойстваЭФ.Вставить("Заголовок", "У МЧД нет разрешенных полномочий");
	СвойстваЭФ.Вставить("ГиперСсылка", Истина);
	СвойстваЭФ.Вставить("ЦветТекста", Новый Цвет(65, 48, 3));
	СобытияЭФ = Новый Структура;
	СобытияЭФ.Вставить("Нажатие", "КомандаСтатусПодписиСертификатаМЧД");
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(Форма, "ТекстРазрешитьПолномочия", "ГруппаПредупреждениеПолномочияМЧД", СвойстваЭФ, СобытияЭФ);
			
КонецПроцедуры

Процедура ВывестиГруппаСертификатМЧД(Форма, Файл, ВтораяПодпись = Ложь)
	
	Если ВтораяПодпись Тогда
		ДанныеПодписи = Файл.СогласующиеПодписи[0];
		ПодписьВерна = Файл.ВтораяПодписьВерна;
		ПостфиксИмениЭлементов = "_2";
	Иначе
		ДанныеПодписи = Файл;
		ПодписьВерна = Файл.ПодписьВерна;
		ПостфиксИмениЭлементов = "";
	КонецЕсли;
	
	ПроверкаСертификатаПройдена = (ПодписьВерна И ДанныеПодписи.СтатусПроверкиСертификата = 0);
	ПроверкаМЧДПройдена = (КонтурЛогистика_МашиночитаемыеДовернностиСервер.МЧДВалидна(ДанныеПодписи.СтатусПроверкиМЧДПоТитулу) 
		Или Не ЗначениеЗаполнено(ДанныеПодписи.СтатусПроверкиМЧДПоТитулу));
		
	ТребуетсяМЧД = ДанныеПодписи.СтатусПриложенностиМЧД = "PowerOfAttorneyRequired" И Не ЗначениеЗаполнено(ДанныеПодписи.ИдентификаторМЧД);
	
	тзОшибокМЧД = КонтурЛогистика_МашиночитаемыеДовернностиСервер.тзОшибокПроверкиМЧД(ДанныеПодписи.ОшибкиПроверкиМЧД);
	
	ДоверятьМЧД = Ложь;
	МЧДСсылка = Справочники.КонтурЛогистика_МЧД.НайтиПоРеквизиту("ИдентификаторДоверенности", ДанныеПодписи.ИдентификаторМЧД);
	Если ЗначениеЗаполнено(МЧДСсылка) Тогда
						
		Форма.ДФИ_МЧД = МЧДСсылка;
		Форма.ДФИ_ОшибкиМЧД = ДанныеПодписи.ОшибкиПроверкиМЧД;
				
		Если Не ПроверкаМЧДПройдена Тогда
					
			ДоверятьМЧД = КонтурЛогистика_МашиночитаемыеДовернностиСервер.ПроверитьДоверие(МЧДСсылка, ДанныеПодписи.Отпечаток, тзОшибокМЧД);
				
			Если ДоверятьМЧД Тогда
				ПроверкаМЧДПройдена = Истина;
			КонецЕсли;
						
		КонецЕсли;
						
	КонецЕсли;
	
	Если ДоверятьМЧД Тогда
		ЗаголовокМЧД = "МЧД (доверяем)";
	Иначе
		ЗаголовокМЧД = ?(ПроверкаМЧДПройдена, "МЧД проверена", "МЧД:");
	КонецЕсли;
	
	Если ПроверкаСертификатаПройдена И ПроверкаМЧДПройдена И Не ТребуетсяМЧД Тогда
		
		Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ_5_02(Файл.ТипДокумента) Тогда
			ГруппаРодитель = "СтраницаОсновное";	
		Иначе
			ГруппаРодитель = "ГруппаШапкаРеквизиты";	
		КонецЕсли;
		ЭлементПеред = Форма.Элементы.Найти("Комментарий");
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(
			Форма, "ГруппаСертификатМЧД" + ПостфиксИмениЭлементов, ГруппаРодитель, 1);
		
	Иначе
		
		РодительГруппы = Форма.Элементы.Найти("ОсновнаяЧастьФормы");
		
		СвойстваГруппы = Новый Структура;
		СвойстваГруппы.Вставить("ЦветФона", Новый Цвет(255, 225, 0));
		СвойстваГруппы.Вставить("РастягиватьПоГоризонтали", Истина);
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(
			Форма, "ГруппаСертификатМЧД" + ПостфиксИмениЭлементов, РодительГруппы, 1,,, СвойстваГруппы, "ГруппаШапка");
		
	КонецЕсли;
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(
		Форма, "ГруппаСертификатМЧДСсылки" + ПостфиксИмениЭлементов, "ГруппаСертификатМЧД", 3);
	
	ВывестиСертификат(Форма, ДанныеПодписи, ПроверкаСертификатаПройдена, ПроверкаМЧДПройдена, ПостфиксИмениЭлементов, ТребуетсяМЧД);
	
	ВывестиМЧД(Форма, ДанныеПодписи, МЧДСсылка, ЗаголовокМЧД, ПроверкаМЧДПройдена, тзОшибокМЧД, ПостфиксИмениЭлементов);
	
	Если Не ПроверкаСертификатаПройдена Тогда
		ВывестиОшибкиСертификата(Форма, ДанныеПодписи, ПроверкаСертификатаПройдена);
	КонецЕсли;
	
	// Пустая надпись для растягивания в ОФ
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		СвойстваЭФ = Новый Структура;
		СвойстваЭФ.Вставить("Заголовок", "");
		СвойстваЭФ.Вставить("РастягиватьПоГоризонтали", Истина);
		
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
			Форма, "ТекстДоп", "ГруппаСертификатМЧДСсылки" + ПостфиксИмениЭлементов, СвойстваЭФ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиСертификат(Форма, ДанныеПодписи, ПроверкаСертификатаПройдена, ПроверкаМЧДПройдена, ПостфиксИмениЭлементов, ТребуетсяМЧД)
	
	Форма["ДФИ_ОтпечатокСертификата" + ПостфиксИмениЭлементов] = ДанныеПодписи.Отпечаток;
	Форма["ДФИ_КомуВыданСертификат" + ПостфиксИмениЭлементов] = ДанныеПодписи.КомуВыданСертификат;
	
	ИмяГруппыРодитель = "ГруппаСертификатМЧДСсылки" + ПостфиксИмениЭлементов;
	
	// Картинка сертификата
	Если ПроверкаСертификатаПройдена И ПроверкаМЧДПройдена Тогда
		СвойстваКартинки = СвойстваДляКартинки("КонтурЛогистика_СертификатЧерный");
	ИначеЕсли ПроверкаСертификатаПройдена И Не ПроверкаМЧДПройдена Тогда
		СвойстваКартинки = СвойстваДляКартинки("КонтурЛогистика_СертификатЗеленый", ПроверкаМЧДПройдена);
	Иначе
		СвойстваКартинки = СвойстваДляКартинки("КонтурЛогистика_ИсправитьОшибки");
	КонецЕсли;
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
		Форма, "КартинкаСертификат" + ПостфиксИмениЭлементов, ИмяГруппыРодитель, СвойстваКартинки);
	
	СертификатСсылка = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ПолучитьСертификатПоОтпечатку(
		ДанныеПодписи.Отпечаток, ДанныеПодписи.СертификатНаСервере);
	
	Если ЗначениеЗаполнено(СертификатСсылка) Тогда
		Форма["ДФИ_СертификатЭП" + ПостфиксИмениЭлементов] = СертификатСсылка;
		ПредставлениеСертификата = СертификатСсылка.Наименование;
	Иначе
		ПредставлениеСертификата = ДанныеПодписи.КомуВыданСертификат;
	КонецЕсли;
	
	// Надпись сертификата
	СвойстваЭФ = Новый Структура;
	СвойстваЭФ.Вставить("Заголовок", ПредставлениеСертификата);
	СвойстваЭФ.Вставить("ГиперСсылка", ЗначениеЗаполнено(СертификатСсылка));
	СвойстваЭФ.Вставить("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
	
	СобытияЭФ = Новый Структура;
	СобытияЭФ.Вставить("Нажатие", "КомандаСтатусПодписиСертификатаМЧД");
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
		Форма, "ТекстСертификат" + ПостфиксИмениЭлементов, ИмяГруппыРодитель, СвойстваЭФ, СобытияЭФ);
		
	Если ТребуетсяМЧД Тогда
			
		СвойстваЭФ = Новый Структура;
		СвойстваЭФ.Вставить("Заголовок", ДанныеПодписи.СтатусПриложенностиМЧДОписание);
		СвойстваЭФ.Вставить("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
		
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
			Форма, "ТекстСертификатСтатусПриложенностиМЧД" + ПостфиксИмениЭлементов, ИмяГруппыРодитель, СвойстваЭФ);	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиОшибкиСертификата(Форма, ДанныеПодписи, ПроверкаСертификатаПройдена)
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(
		Форма, "ГруппаСертификатМЧДОшибкиСертификата", "ГруппаСертификатМЧД", 3);
	
	// Надпись проблем сертификата
	Если ДанныеПодписи.СтатусПроверкиСертификата <> 0 Тогда
		СвойстваЭФ = Новый Структура;
		СвойстваЭФ.Вставить("Заголовок", "Подпись не верна: "
			+ КонтурЛогистика_КриптографияСервер.ПолучитьСтатусПроверкиСертификатаПоКоду(ДанныеПодписи.СтатусПроверкиСертификата));
		СвойстваЭФ.Вставить("ЦветТекста", Новый Цвет(255, 0, 0));
		СвойстваЭФ.Вставить("РастягиватьПоГоризонтали", Ложь);
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
			Форма, "ТекстСертификатОшибки", "ГруппаСертификатМЧДОшибкиСертификата", СвойстваЭФ);
		
		ВывестиСсылкуНаДиадок(Форма);
	ИначеЕсли ДанныеПодписи.СтатусПодписи = Перечисления.КонтурЛогистика_СтатусыПодписи.SenderSignatureCheckedAndInvalid Тогда 
		СвойстваЭФ = Новый Структура;
		СвойстваЭФ.Вставить("Заголовок", "Подпись не верна");
		СвойстваЭФ.Вставить("ЦветТекста", Новый Цвет(255, 0, 0));	
		СвойстваЭФ.Вставить("РастягиватьПоГоризонтали", Ложь);
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
			Форма, "ТекстСертификатОшибки", "ГруппаСертификатМЧДОшибкиСертификата", СвойстваЭФ);
		
		ВывестиСсылкуНаДиадок(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиСсылкуНаДиадок(Форма)
	
	// Надпись
	СвойстваЭФ = Новый Структура;
	СвойстваЭФ.Вставить("Заголовок", "подробнее");
	СвойстваЭФ.Вставить("ГиперСсылка", Истина);
	СвойстваЭФ.Вставить("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
	СвойстваЭФ.Вставить("РастягиватьПоГоризонтали", Ложь);
	
	СобытияЭФ = Новый Структура;
	СобытияЭФ.Вставить("Нажатие", "КомандаСтатусПодписиСертификатаМЧД");
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
		Форма, "ТекстСсылкаВДиадок", "ГруппаСертификатМЧДОшибкиСертификата", СвойстваЭФ, СобытияЭФ);
	
КонецПроцедуры

Процедура ВывестиМЧД(Форма, ДанныеПодписи, МЧДСсылка, ЗаголовокМЧД, ПроверкаМЧДПройдена, тзОшибок, ПостфиксИмениЭлементов)
	
	Если Не ЗначениеЗаполнено(ДанныеПодписи.ИдентификаторМЧД) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяГруппыРодитель = "ГруппаСертификатМЧДСсылки" + ПостфиксИмениЭлементов;
	
	// Картинка МЧД
	Если Не ПроверкаМЧДПройдена Тогда
		СвойстваКартинки = СвойстваДляКартинки("КонтурЛогистика_Восклицание");
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
			Форма, "КартинкаМЧД" + ПостфиксИмениЭлементов, ИмяГруппыРодитель, СвойстваКартинки);
	КонецЕсли;
	
	// Надпись МЧД
	СвойстваЭФ = Новый Структура;
	СвойстваЭФ.Вставить("Заголовок", ЗаголовокМЧД);
	СвойстваЭФ.Вставить("ГиперСсылка", ЗначениеЗаполнено(МЧДСсылка));
	СвойстваЭФ.Вставить("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
	СобытияЭФ = Новый Структура;
	СобытияЭФ.Вставить("Нажатие", "КомандаСтатусПодписиСертификатаМЧД");
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
		Форма, "ТекстМЧД" + ПостфиксИмениЭлементов, ИмяГруппыРодитель, СвойстваЭФ, СобытияЭФ);
	
	Если Не ПроверкаМЧДПройдена Тогда
		
		// Надпись ошибки МЧД
		ЭтоПредупреждение = ДанныеПодписи.СтатусПроверкиМЧДПоТитулу = "HasWarnings";
				
		СвойстваЭФ = Новый Структура;
		СвойстваЭФ.Вставить("Заголовок", ?(ЭтоПредупреждение, "Предупреждения - ", "Ошибки - ") + Строка(тзОшибок.Количество()));
		СвойстваЭФ.Вставить("ГиперСсылка", Истина);
		СвойстваЭФ.Вставить("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
		
		СобытияЭФ = Новый Структура;
		СобытияЭФ.Вставить("Нажатие", "КомандаСтатусПодписиСертификатаМЧД");
		
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
			Форма, "ТекстМЧДОшибки" + ПостфиксИмениЭлементов, ИмяГруппыРодитель, СвойстваЭФ, СобытияЭФ);
		
		Если ЗначениеЗаполнено(МЧДСсылка) Тогда 
			
			// Надпись доверять
			СвойстваЭФ = Новый Структура;
			СвойстваЭФ.Вставить("Заголовок", "Доверять");
			СвойстваЭФ.Вставить("ГиперСсылка", Истина);
			Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82()
				И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.МодальностьЗапрещена() Тогда
				
				СвойстваЭФ.Вставить("ОтображениеПодсказки", ОтображениеПодсказки.Кнопка);
				СвойстваЭФ.Вставить("Подсказка", ВопросДоверятьМЧД(ЭтоПредупреждение));
			КонецЕсли;
			
			СобытияЭФ = Новый Структура;
			СобытияЭФ.Вставить("Нажатие", "КомандаСтатусПодписиСертификатаМЧД");
						
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
				Форма, "ТекстДоверять" + ПостфиксИмениЭлементов, ИмяГруппыРодитель, СвойстваЭФ, СобытияЭФ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СвойстваДляКартинки(ИмяКартинки, Доступность = Истина)
	
	СвойстваЭФ = Новый Структура;
	СвойстваЭФ.Вставить("Вид", ВидДекорацииФормы.Картинка);
	СвойстваЭФ.Вставить("Картинка", БиблиотекаКартинок[ИмяКартинки]);
	СвойстваЭФ.Вставить("Высота", 1);
	СвойстваЭФ.Вставить("Ширина", 2);
	СвойстваЭФ.Вставить("Доступность", Доступность);
	
	Возврат СвойстваЭФ;
	
КонецФункции

Функция ДополнительныеРеквизитыФормыДляПанелиСтатусовПодписи(Форма) Экспорт
	
	ДополнительныеРеквизиты = Новый Массив;
	
	Если Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЕстьСвойствоОбъекта_(Форма, "ДФИ_СертификатЭП") Тогда
		// Пока что незачем проверять каждый реквизит
		РеквизитСертификат = Новый РеквизитФормы("ДФИ_СертификатЭП",
			Новый ОписаниеТипов("СправочникСсылка.КонтурЛогистика_СертификатыЭлектроннойПодписи"));
		РеквизитМЧД = Новый РеквизитФормы("ДФИ_МЧД",
			Новый ОписаниеТипов("СправочникСсылка.КонтурЛогистика_МЧД"));
		РеквизитОшибкиМЧД = Новый РеквизитФормы("ДФИ_ОшибкиМЧД", Новый ОписаниеТипов("Строка"));
		РеквизитОтпечатокСертификата = Новый РеквизитФормы("ДФИ_ОтпечатокСертификата", Новый ОписаниеТипов("Строка"));
		РеквизитКомуВыданСертификат = Новый РеквизитФормы("ДФИ_КомуВыданСертификат", Новый ОписаниеТипов("Строка"));
		РеквизитПолномочие = Новый РеквизитФормы("ДФИ_Полномочие", Новый ОписаниеТипов("ПеречислениеСсылка.КонтурЛогистика_Полномочия"));
		
		ДополнительныеРеквизиты.Добавить(РеквизитСертификат);
		ДополнительныеРеквизиты.Добавить(РеквизитМЧД);
		ДополнительныеРеквизиты.Добавить(РеквизитОшибкиМЧД);
		ДополнительныеРеквизиты.Добавить(РеквизитОтпечатокСертификата);
		ДополнительныеРеквизиты.Добавить(РеквизитКомуВыданСертификат);
	КонецЕсли;
	
	Если Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЕстьСвойствоОбъекта_(Форма, "ДФИ_СертификатЭП_2") Тогда
		// Пока что незачем проверять каждый реквизит
		РеквизитСертификат = Новый РеквизитФормы("ДФИ_СертификатЭП_2",
			Новый ОписаниеТипов("СправочникСсылка.КонтурЛогистика_СертификатыЭлектроннойПодписи"));
		РеквизитМЧД = Новый РеквизитФормы("ДФИ_МЧД_2",
			Новый ОписаниеТипов("СправочникСсылка.КонтурЛогистика_МЧД"));
		РеквизитОшибкиМЧД = Новый РеквизитФормы("ДФИ_ОшибкиМЧД_2", Новый ОписаниеТипов("Строка"));
		РеквизитОтпечатокСертификата = Новый РеквизитФормы("ДФИ_ОтпечатокСертификата_2", Новый ОписаниеТипов("Строка"));
		РеквизитКомуВыданСертификат = Новый РеквизитФормы("ДФИ_КомуВыданСертификат_2", Новый ОписаниеТипов("Строка"));
		
		ДополнительныеРеквизиты.Добавить(РеквизитСертификат);
		ДополнительныеРеквизиты.Добавить(РеквизитМЧД);
		ДополнительныеРеквизиты.Добавить(РеквизитОшибкиМЧД);
		ДополнительныеРеквизиты.Добавить(РеквизитОтпечатокСертификата);
		ДополнительныеРеквизиты.Добавить(РеквизитКомуВыданСертификат);
		ДополнительныеРеквизиты.Добавить(РеквизитПолномочие);
	КонецЕсли;
	
	Возврат ДополнительныеРеквизиты;
	
КонецФункции

Функция ВопросДоверятьМЧД(ЭтоПредупреждение = Ложь) Экспорт 
	
	Если ЭтоПредупреждение Тогда
		Возврат "Предупреждения МЧД будут проигнорированы в дальнейшем";	
	Иначе
		Возврат "Ошибки МЧД будут проигнорированы в дальнейшем";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПанельСвязанныхОбъектов

Процедура ВывестиСвязанныеОбъекты(ДокументСсылка, ОтображаемДокументОснование, Форма, ОтображаемыйДокумент) Экспорт
	
	ЭлементПеред = Неопределено;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1")
		И ТипЗнч(ОтображаемыйДокумент) = Тип("ДокументСсылка.КонтурЛогистика_ЭкспедиторскаяРасписка") Тогда
		
		ИмяГлавногоРодителя = "ГруппаЭкспедиция";
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ЭкспедиторскаяРасписка") Тогда
		
		ИмяГлавногоРодителя = "ГруппаШапкаРеквизиты";
		ЭлементПеред = "ГруппаШапкаДанныеСтолбцы";
		Если Не ЗначениеЗаполнено(Форма.Объект.ДокументОснование) Тогда
			Форма.Элементы.ГруппаДокументОснования.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		ИмяГлавногоРодителя = "ГруппаШапкаРеквизиты";
		
	КонецЕсли;
	
	ГлавныйРодитель = Форма.Элементы.Найти(ИмяГлавногоРодителя);
	Если ГлавныйРодитель = Неопределено Тогда
		ГлавныйРодитель = Форма.Элементы.Найти("ГруппаШапкаДанные");
	КонецЕсли;
	
	// Главная группа
	ГлавнаяГруппа = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(
		Форма, "ГруппаСвязиДокументов", ГлавныйРодитель, 3,,,, ЭлементПеред);
	
	// Картинка связей
	СвойстваКартинки = СвойстваДляКартинки("КонтурЛогистика_СвязиДокументов");
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
		Форма, "СвязиДокументовДекорация", ГлавнаяГруппа, СвойстваКартинки);
	
	// Выведем представление связанного документа
	СвойстваПоля = Новый Структура;
	СвойстваПоля.Вставить("АвтоМаксимальнаяШирина", Ложь);
	СвойстваПоля.Вставить("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздПолеГиперссылка(
		Форма, "СвязиДокументовДокументСвязи", ГлавнаяГруппа,,, "ПредставлениеСвязанногоДокумента", СвойстваПоля);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеНаОснованииЭлементаУчетнойСистемы

Функция ЕстьНастройкаКонвертацииРеквизитаНименование(НастройкиКонвертацииСправочников) Экспорт
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("РеквизитСправочникаЛогистика", "Наименование");
	
	Попытка
		НайденныеСтроки = НастройкиКонвертацииСправочников.ПравилаКонвертации.НайтиСтроки(ПараметрыПоиска);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденныеСтроки.Количество() <> 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ТекущаяНастройка Из НайденныеСтроки Цикл
		Если ТекущаяНастройка = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область КомандыДокументОснование

Процедура ВывестиКомандыДокументаОснования(ДокументСсылка, Форма, НастройкаКонвертации) Экспорт
	
	Форма.Элементы.ДокументОснование.КнопкаОчистки = Истина;
	
	Если Форма.Элементы.Найти("ПерезаполнитьПоДокОснованию") <> Неопределено
		И Не ЗначениеЗаполнено(ДокументСсылка.ДокументОснование) Тогда
		
		Форма.Элементы.ПерезаполнитьПоДокОснованию.Видимость = Ложь;
		
	КонецЕсли;
	Если Форма.Элементы.Найти("ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы") <> Неопределено Тогда
		Форма.Элементы.ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = Ложь;
	КонецЕсли;
	
	ДобавитьКомандыДокументОснование(Форма, ДокументСсылка, НастройкаКонвертации);
				
КонецПроцедуры

Процедура ДобавитьКомандыДокументОснование(Форма, ДокументСсылка, НастройкаКонвертации)
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорацияНадпись(Форма, "ТекстДокументОснование", "ГруппаДокументОснование", "Документ учетной системы: ", Ложь);
			
	СвойстваЭФ = Новый Структура;
	СвойстваЭФ.Вставить("Заголовок", "<не заполнен> ");
	СвойстваЭФ.Вставить("ЦветТекста", Новый Цвет(65, 48, 3));
	СвойстваЭФ.Вставить("Шрифт", Новый Шрифт(,, Истина));
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(Форма, "ТекстДокументОснованиеНеЗаполнен", "ГруппаДокументОснование", СвойстваЭФ);
	
	// Кнопка Найти не требуется - она "внутри Заполнить"
	//СвойстваЭФ = Новый Структура;
	//СвойстваЭФ.Вставить("Заголовок", "Найти");
	//СвойстваЭФ.Вставить("ГиперСсылка", Истина);
	//СвойстваЭФ.Вставить("ЦветТекста", Новый Цвет(65, 48, 3));
	//СобытияЭФ = Новый Структура;
	//СобытияЭФ.Вставить("Нажатие", "КомандаДокументОснование");
	//КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(Форма, "КомандаДокументОснованиеНайти", "ГруппаДокументОснование", СвойстваЭФ, СобытияЭФ);
	
	// кнопка заполнения учетного документа
	
	Если ЗначениеЗаполнено(ДокументСсылка.ДокументОснование) Тогда 
		ИмяКнопкиЗаполнения = "Заполнить";
	Иначе
		ИмяКнопкиЗаполнения = "Найти и заполнить";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда
		
		Если Форма.Команды.Найти("КомандаДокументОснованиеЗаполнить") = Неопределено Тогда 
			СвойстваКоманды = Новый Структура;
			СвойстваКоманды.Вставить("Картинка", БиблиотекаКартинок.КонтурЛогистика_СтрелкаВУчетныйДокумент);
			СвойстваКоманды.Вставить("Подсказка", "Найти и заполнить учетный документ из данных ЭПД (в настройке конвертации также может быть указано создать и/или провести документ)");
			СвойстваКоманды.Вставить("Отображение", ОтображениеКнопки.КартинкаИТекст);
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(
				Форма, "КомандаДокументОснованиеЗаполнить",, "КомандаДокументОснование", СвойстваКоманды);
		КонецЕсли;	
			
		СвойстваЭФ = Новый Структура;
		СвойстваЭФ.Вставить("Заголовок", ИмяКнопкиЗаполнения);
		СвойстваЭФ.Вставить("Картинка", БиблиотекаКартинок.КонтурЛогистика_СтрелкаВУчетныйДокумент);
		СвойстваЭФ.Вставить("ЦветТекста", Новый Цвет(65, 48, 3));
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(Форма, "КомандаДокументОснованиеЗаполнить", "ГруппаДокументОснование", ИмяКнопкиЗаполнения, "КомандаДокументОснованиеЗаполнить", 1, СвойстваЭФ);
	КонецЕсли;
		
	// Команда ручного выбора
	Если Форма.Команды.Найти("КомандаДокументОснованиеВыбратьВручную") = Неопределено Тогда 
		СвойстваКоманды = Новый Структура;
		// без картинки
		СвойстваКоманды.Вставить("Подсказка", "Выбрать вручную документ учетной систем");
		СвойстваКоманды.Вставить("Отображение", ОтображениеКнопки.КартинкаИТекст);
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(
			Форма, "КомандаДокументОснованиеВыбратьВручную",, "КомандаДокументОснование", СвойстваКоманды);
	КонецЕсли;	
	СвойстваЭФ = Новый Структура;
	СвойстваЭФ.Вставить("Заголовок", "Выбрать вручную");
	// без картинки
	СвойстваЭФ.Вставить("ЦветТекста", Новый Цвет(65, 48, 3));
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(Форма, "КомандаДокументОснованиеВыбратьВручную", "ГруппаДокументОснование", "Выбрать вручную", "КомандаДокументОснованиеВыбратьВручную", 1, СвойстваЭФ);
	
КонецПроцедуры

Функция ДополнительныеРеквизитыФормыДляОбработкиДокументаОбратнымМаппингом(Форма) Экспорт
	
	ДополнительныеРеквизиты = Новый Массив;
	
	Если Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЕстьСвойствоОбъекта_(Форма, "ДФИ_ОписаниеПредупрежденияОбработки") Тогда
		
		РеквизитОписаниеПредупрежденияОбработки = Новый РеквизитФормы("ДФИ_ОписаниеПредупрежденияОбработки", Новый ОписаниеТипов("Строка"));
	    	
    	ДополнительныеРеквизиты.Добавить(РеквизитОписаниеПредупрежденияОбработки);
		
	КонецЕсли;
   	
	Возврат ДополнительныеРеквизиты;
	
КонецФункции

Процедура ВывестиПанельОбработкиДокументаОбратнымМаппингом(ДокументСсылка, Форма, ТипТитула) Экспорт
	
	Если Форма.ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		СтруктураОшибки = КонтурЛогистика_ОбработкаДокументовСервер.ПолучитьПодробноеОписаниеОшибки(ДокументСсылка); 
		Форма.ДФИ_ОписаниеПредупрежденияОбработки = СтруктураОшибки.ПодробноеОписаниеОшибки;
		
		СвойстваГруппы = Новый Структура;
		СвойстваГруппы.Вставить("ЦветФона", Новый Цвет(255, 225, 0));
		СвойстваГруппы.Вставить("РастягиватьПоГоризонтали", Истина);
		
		Если ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2 Тогда
			РодительГруппы = "ГруппаШапкаДанные";
			ЭлементПеред = "ГруппаШапкаМестоположение";
		Иначе
			РодительГруппы = "ГруппаШапкаМестоположение";
			ЭлементПеред = "ГруппаШапкаДанные";
		КонецЕсли;
		
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(Форма, "ГруппаПанельОбработкиДокументаОбратнымМаппингом", РодительГруппы, 3, , , СвойстваГруппы, ЭлементПеред);
		
		СвойстваКартинки = СвойстваДляКартинки("КонтурЛогистика_Предупреждение");
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(Форма, "КартинкаПредупреждениеОбработкиДокументаОбратнымМаппингом", "ГруппаПанельОбработкиДокументаОбратнымМаппингом", СвойстваКартинки);
		
		СвойстваЭФ = Новый Структура;
		СвойстваЭФ.Вставить("Заголовок", "При заполнение документа учетной системы из этого титула возникли ошибки. ");
		СвойстваЭФ.Вставить("ЦветТекста", Новый Цвет(65, 48, 3));
		СвойстваЭФ.Вставить("АвтоМаксимальнаяШирина", Ложь);
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
			СвойстваЭФ.Вставить("Ширина", 55);
		КонецЕсли;
		
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(Форма, "ТекстОписаниеПанелиОбработки", "ГруппаПанельОбработкиДокументаОбратнымМаппингом", СвойстваЭФ);

		
		СвойстваЭФ = Новый Структура;
		СвойстваЭФ.Вставить("Заголовок", "Ошибки - " + Строка(СтруктураОшибки.КоличествоОшибок));
		СвойстваЭФ.Вставить("ГиперСсылка", Истина);
		СвойстваЭФ.Вставить("ЦветТекста", Новый Цвет(65, 48, 3));
		СобытияЭФ = Новый Структура;
		СобытияЭФ.Вставить("Нажатие", "КомандаДокументОснование");
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(Форма, "КомандаПоказатьПредупреждения", "ГруппаПанельОбработкиДокументаОбратнымМаппингом", СвойстваЭФ, СобытияЭФ);
		
		СвойстваЭФ = Новый Структура;
		СвойстваЭФ.Вставить("Заголовок", "Игнорировать");
		СвойстваЭФ.Вставить("ГиперСсылка", Истина);
		СвойстваЭФ.Вставить("ЦветТекста", Новый Цвет(65, 48, 3));
		СобытияЭФ = Новый Структура;
		СобытияЭФ.Вставить("Нажатие", "КомандаДокументОснование");
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(Форма, "КомандаИгнорировать", "ГруппаПанельОбработкиДокументаОбратнымМаппингом", СвойстваЭФ, СобытияЭФ);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОтображениеКомандыПропуститьОбработкуВходящегоДокумента(Форма, НастройкаКонвертации) Экспорт
	
	Если Форма.Элементы.Найти("ФормаОбщаяКомандаКонтурЛогистика_ПропуститьОбработкуВходящегоДокумента") <> Неопределено Тогда
				
		Если Форма.ИмяФормы = "ОбщаяФорма.КонтурЛогистика_Задачи" И НастройкаКонвертации.ОбратныйМаппинг Тогда 
			Форма.Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПропуститьОбработкуВходящегоДокумента.Видимость = Истина;
		ИначеЕсли Найти(Форма.ИмяФормы, "Документ.КонтурЛогистика") > 0 
			И Форма.ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
			И НастройкаКонвертации.ОбратныйМаппинг Тогда
		    Форма.Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПропуститьОбработкуВходящегоДокумента.Видимость = Истина;
		Иначе
			Форма.Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПропуститьОбработкуВходящегоДокумента.Видимость = Ложь;
		КонецЕсли;
				
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ФормаОбщаяКомандаКонтурЛогистика_ПропуститьОбработкуВходящегоДокумента1") <> Неопределено Тогда
				
		Если Форма.ИмяФормы = "ОбщаяФорма.КонтурЛогистика_Задачи" И НастройкаКонвертации.ОбратныйМаппинг Тогда 
			Форма.Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПропуститьОбработкуВходящегоДокумента1.Видимость = Истина;
		ИначеЕсли Найти(Форма.ИмяФормы, "Документ.КонтурЛогистика") > 0 
			И Форма.ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
			И НастройкаКонвертации.ОбратныйМаппинг Тогда
		    Форма.Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПропуститьОбработкуВходящегоДокумента1.Видимость = Истина;
		Иначе
			Форма.Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПропуститьОбработкуВходящегоДокумента1.Видимость = Ложь;
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФормаОписаниеОшибкиСРешением

Процедура ВывестиВариантРешенияНаФорме(Форма, ВариантРешения, Родитель, инд) Экспорт
	
	СвойстваЭФ = Новый Структура;
	
	Если ТипЗнч(ВариантРешения.Наименование) = Тип("Массив") Тогда					
		ВариантРешения.Наименование.Вставить(0, " - ");		
		СвойстваЭФ.Вставить("Заголовок", Новый ФорматированнаяСтрока(ВариантРешения.Наименование));		
	Иначе
		СвойстваЭФ.Вставить("Заголовок", " - " + ВариантРешения.Наименование);
	КонецЕсли;	
	
	СвойстваЭФ.Вставить("ГиперСсылка", ВариантРешения.Свойство("ГиперСсылка"));
	СвойстваЭФ.Вставить("АвтоМаксимальнаяШирина", Ложь);
	СвойстваЭФ.Вставить("РастягиватьПоВертикали", Истина);
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		СвойстваЭФ.Вставить("Высота", 2);	
	КонецЕсли;
	
	СобытияЭФ = Новый Структура;
	Если ВариантРешения.Свойство("ГиперСсылка") Тогда			
		
		СобытияЭФ.Вставить("Нажатие", "ОткрытьГиперСсылку");
					
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
			Форма, ВариантРешения.РеквизитГиперСсылка, Родитель, СвойстваЭФ, СобытияЭФ);
		
	Иначе
		
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
			Форма, "ТекстРешение" + Строка(инд), Родитель, СвойстваЭФ, СобытияЭФ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиАрхива

Процедура ВывестиПредупреждениеНастройкиАрхива(Форма, ТекстПредупреждения) Экспорт
	
	Если Форма.Элементы.Найти("ГруппаПредупреждениеНастройкиАрхива") = Неопределено Тогда
	
		СвойстваЭФ = Новый Структура;
		СвойстваЭФ.Вставить("ЦветФона", Новый Цвет(255, 225, 0));
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(
			Форма, "ГруппаПредупреждениеНастройкиАрхива", ,3,,, СвойстваЭФ, "ИмяПредопределенныхДанных");
			
		СвойстваКартинки = СвойстваДляКартинки("КонтурЛогистика_Предупреждение");
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
			Форма, "КартинкаПредупреждение", "ГруппаПредупреждениеНастройкиАрхива", СвойстваКартинки);
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорацияНадпись(
			Форма, "ПредупреждениеПрисоединенныеФайлы", "ГруппаПредупреждениеНастройкиАрхива", ТекстПредупреждения);
			
	Иначе
			
		Форма.Элементы.ПредупреждениеПрисоединенныеФайлы.Заголовок = ТекстПредупреждения;		
			
	КонецЕсли;
			
КонецПроцедуры

Процедура СоздатьЭлементыФормыДляКаталогаСохраненияАрхиваДокументооборота(Форма) Экспорт
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(
		Форма, "ПроверитьДоступКаталогаСохраненияАрхиваДокументооборота", , "ПроверитьДоступКаталогаСохраненияАрхиваДокументооборота");
		
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(Форма, "ГруппаПроверкаДоступа", "ГруппаЗначение",3);
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(
		Форма, "ПроверитьДоступ", "ГруппаПроверкаДоступа", "Проверить доступ", "ПроверитьДоступКаталогаСохраненияАрхиваДокументооборота", 1);	
		
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорацияНадпись(Форма, "РезультатПроверкиДоступаКаталога", "ГруппаПроверкаДоступа", "");
	
КонецПроцедуры
	
#КонецОбласти

#Область РазрешениеРедактированияРеквизитов

Процедура ДобавитьРеквизитЭлементыДляРазрешенияРедактирования(Форма) Экспорт
	
	ДополнительныеРеквизиты = Новый Массив;
	РеквизитЭлементыДляРазрешенияРедактирования = Новый РеквизитФормы("ДФИ_ЭлементыДляРазрешенияРедактирования", Новый ОписаниеТипов("СписокЗначений"));	    	
	ДополнительныеРеквизиты.Добавить(РеквизитЭлементыДляРазрешенияРедактирования);
	Форма.ИзменитьРеквизиты(ДополнительныеРеквизиты);
	
КонецПроцедуры

Процедура ДобавитьЭлементыФормыДляРазрешенияРедактирования(Форма) Экспорт
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(
			Форма, "РазрешитьРедактированиеРеквизитов", , "РазрешитьРедактированиеРеквизитов");
							
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(
		Форма, "РазрешитьРедактированиеРеквизитов", Форма.КоманднаяПанель, "Разрешить редактирование технических реквизитов", "РазрешитьРедактированиеРеквизитов", 1);
		
	Форма.Элементы.РазрешитьРедактированиеРеквизитов.ТолькоВоВсехДействиях = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область НетиповыеСправочникиВСвязанныхОбъектах

Функция ДанныеДляДобавленияСвязанногоОбъекта(СвязанныйОбъект) Экспорт
	
	Данные = Новый Структура;
	
	Данные.Вставить("УИД", СвязанныйОбъект.УникальныйИдентификатор());
	Данные.Вставить("ТипЗначенияУИД", СвязанныйОбъект.Метаданные().ПолноеИмя());
	
	Возврат Данные;
	
КонецФункции

Процедура УстановитьСвязьОбъектовЛогистикаУчСист(ЭлементСправочника_Ссылка, ОбъектУчетнойСистемы) Экспорт
	
	ЭтоНетиповаяСсылка = КонтурЛогистика_КонвертацияСервер.ЭтоНетиповаяСсылкаДляСвязанногоОбъекта(
		ЭлементСправочника_Ссылка, ОбъектУчетнойСистемы);
	Если ЭтоНетиповаяСсылка Тогда
		УИД = ОбъектУчетнойСистемы.УникальныйИдентификатор();
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	Если ЭтоНетиповаяСсылка Тогда
		
		// Для нетиповой найдем по колонке УИД
		ПараметрыОтбора.Вставить("УИД", Строка(УИД));
		
	Иначе
		
		// Поищем по ссылке в колонке СвязанныйОбъект
		ПараметрыОтбора.Вставить("СвязанныйОбъект", ОбъектУчетнойСистемы);
		
	КонецЕсли;
	
	НайденныеСтроки = ЭлементСправочника_Ссылка.СвязанныеОбъекты.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		// Уже есть связанный объект
		Возврат;
	КонецЕсли;
	
	// Добавим новый связанный объект
	ТекущийОбъект = ЭлементСправочника_Ссылка.ПолучитьОбъект();
	
	НоваяСвязь = ТекущийОбъект.СвязанныеОбъекты.Добавить();
	НоваяСвязь.СвязанныйОбъект = ОбъектУчетнойСистемы;
	
	Если ЭтоНетиповаяСсылка Тогда
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьДанныеДляНетиповогоСправочникаВСвязанныхОбъектах(
			НоваяСвязь, ОбъектУчетнойСистемы);
	КонецЕсли;
	
	ТекущийОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти
