#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//// Это подключаемый модуль НаСервере
//// РЕКОМЕНДУЕТСЯ добавлять РАСШИРЕНИЯ к текущим событиям ПМ
////   в случае, если расширения недоступны, рекомендуется разблокировать изменение Этой обработки
//    (КонтурЗакупки_ПодключаемыйМодуль) и вносить изменения непосредственно в обработчики из блока
//     Прикладные обработчики
//
//
#Область ПрограммныйИнтерфейс
// ТОЧКА ВХОДА

// Маршрутизирует вызов в конкретные обработчики (которые можно модифицировать), возвращает результат работы ПМ
// (Результат необязателен, результатом может быть ИЗМЕНЕНИЕ параметров)
// 
// Параметры:
//  ИмяСобытия - Строка - Название события для понимания места его возникновения и назначения
//  ПараметрыПодключаемогоМодуля - Произвольный - Передаются параметры для работы конкретного события
// (можно изменять значенияэтих паратмеров в ПМ)
//  СтандартнаяОбработкаПМ - Булево - В ряде событий предоставляет возможность отказаться от типового поведения
// системы после выполнения события
// 
// Возвращаемое значение:
//  Произвольный - результат выполнения ПМ
Функция ОбработатьСобытиеКонтурЗакупки(ИмяСобытия, ПараметрыПодключаемогоМодуля, СтандартнаяОбработкаПМ = Истина) Экспорт
	
	Если ИмяСобытия = "СведенияОВнешнейОбработке" Тогда
		Возврат СведенияОВнешнейОбработке();
	ИначеЕсли ИмяСобытия = "ЗакупкаКомандаСоздатьОбъектПодключаемая" Тогда
		// при определении необходимо вренуть структуру со свойствами Заголовок и ТипОбъекта
		// Например: 
		//	СведенияОКоманде = Новый Структура("Заголовок, ТипОбъекта", "Создать свой документ", "Документы.СвойТипДокумента");
		//	Возврат СведенияОКоманде;
		Возврат Неопределено;
	ИначеЕсли ИмяСобытия = "ЗакупкаСоздатьОбъектПодключаемая" Тогда
		// при переопределении необходимо вернуть ссылку на созданный объект
		// ПараметрыПодключаемогоМодуля - Ссылка на документ КонтурЗакупки_Закупка
		Возврат Неопределено;
	ИначеЕсли ИмяСобытия = "ОбработкаЗакупкиКомандаСоздатьОбъектПодключаемая" Тогда
		// при определении необходимо вренуть структуру со свойствами Заголовок и ТипОбъекта
		// Например: 
		//	СведенияОКоманде = Новый Структура("Заголовок, ТипОбъекта", "Создать свой документ", "Документы.СвойТипДокумента");
		//	Возврат СведенияОКоманде;
		Возврат Неопределено;
	ИначеЕсли ИмяСобытия = "ОбработкаЗакупкиСоздатьОбъектПодключаемая" Тогда
		// при переопределении необходимо вернуть ссылку на созданный объект
		// ПараметрыПодключаемогоМодуля - Ссылка на документ КонтурЗакупки_ОбработкаЗакупки
		Возврат Неопределено;
	ИначеЕсли ИмяСобытия = "СоздатьЗадание" Тогда
		// при переопределении необходимо вернуть ссылку на созданный объект
		// ПараметрыПодключаемогоМодуля - Ссылка на документ КонтурЗакупки_Закупка
		Возврат Неопределено;
	ИначеЕсли ИмяСобытия = "СоздатьЗадачуСотруднику" Тогда
		// при переопределении необходимо вернуть ссылку на созданный объект
		// ПараметрыПодключаемогоМодуля - Ссылка на документ КонтурЗакупки_Закупка
		Возврат Неопределено;
	ИначеЕсли ИмяСобытия = "СоздатьИнтерес" Тогда
		// при переопределении необходимо вернуть ссылку на созданный объект
		// ПараметрыПодключаемогоМодуля - Ссылка на документ КонтурЗакупки_Закупка
		Возврат Неопределено;
	ИначеЕсли ИмяСобытия = "СоздатьСделку" Тогда
		// при переопределении необходимо вернуть ссылку на созданный объект
		// ПараметрыПодключаемогоМодуля - Ссылка на документ КонтурЗакупки_Закупка
		Возврат Неопределено;
	ИначеЕсли ИмяСобытия = "ПолучитьТекущегоПользователя" Тогда
		// при переопределении необходимо вернуть ссылку
		Возврат Неопределено;
	ИначеЕсли ИмяСобытия = "ЗаполнитьДокументЗадачаСотрудника" Тогда
		// При реализации своей логики заполнения установить СтандартнаяОбработкаПМ = Ложь
		// Параметры:
		// ОбъектДляЗаполнения = ПараметрыПодключаемогоМодуля.ОбъектДляЗаполнения;
		// ДокументОснование = ПараметрыПодключаемогоМодуля.ДокументОснование;
		Возврат Неопределено;
	ИначеЕсли ИмяСобытия = "ЗаполнитьБПЗадание" Тогда
		// При реализации своей логики заполнения установить СтандартнаяОбработкаПМ = Ложь
		// Параметры:
		// ОбъектДляЗаполнения = ПараметрыПодключаемогоМодуля.ОбъектДляЗаполнения;
		// ДокументОснование = ПараметрыПодключаемогоМодуля.ДокументОснование;
		Возврат Неопределено;
	ИначеЕсли ИмяСобытия = "ЗаполнитьДокументИнтерес" Тогда
		// При реализации своей логики заполнения установить СтандартнаяОбработкаПМ = Ложь
		// Параметры:
		// ОбъектДляЗаполнения = ПараметрыПодключаемогоМодуля.ОбъектДляЗаполнения;
		// ДокументОснование = ПараметрыПодключаемогоМодуля.ДокументОснование;
		Возврат Неопределено;
	ИначеЕсли ИмяСобытия = "ЗаполнитьСправочникСделкиСКлиентами" Тогда
		// При реализации своей логики заполнения установить СтандартнаяОбработкаПМ = Ложь
		// Параметры:
		// ОбъектДляЗаполнения = ПараметрыПодключаемогоМодуля.ОбъектДляЗаполнения;
		// ДокументОснование = ПараметрыПодключаемогоМодуля.ДокументОснование;
		Возврат Неопределено;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Интерфейс для регистрации обработки.
// Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
// 
// Возвращаемое значение:
//  Структура - Сведения о внешней обработке:
// * Вид - Строка - возможные значения
//   "ДополнительнаяОбработка"
//   "ДополнительныйОтчет"
//   "ЗаполнениеОбъекта"
//   "Отчет"
//   "ПечатнаяФорма"
//   "СозданиеСвязанныхОбъектов"
// * Назначение - Массив из Строка - массив строк имен объектов метаданных в формате
//   <ИмяКлассаОбъектаМетаданного>.[ * | <ИмяОбъектаМетаданных>]
//   Например, "Документ.СчетЗаказ" или "Справочник.*"
//   Прим. параметр имеет смысл только для назначаемых обработок
// * Наименование - Строка - наименование обработки, которым будет заполненонаименование справочника по
//   умолчанию - краткая строка для идентификации обработки администратором
// * Версия - Строка - версия обработки в формате <старший номер>.<младший номер> используется при загрузке обработок
//   в информационную базу
// * БезопасныйРежим - Булево - Если истина, обработка будет запущена в безопасном режиме.
//   Более подбробная информация в справке.
// * Информация - Строка - краткая информация по обработке, описание обработки
// * ВерсияБСП - Строка - Минимальная версия БСП, на которую рассчитывает коддополнительной обработки.
//   Номер версии БСП задается в формате «РР.ПП.ВВ.СС
//   »(РР - старший номер редакции; ПП - младший номер ре-дакции; ВВ - номер версии; СС - номер сборки).
// * Команды - ТаблицаЗначений - команды, поставляемые обработкой, одная строка таблицы соотвествуетодной команде:
// ** Представление - Строка - представление команды конечному пользователю
// ** Идентификатор - Строка - идентефикатор команды. В случае печатных форм перечисление через запятую списка макетов
// ** Использование - Строка - варианты запуска обработки
//              "ОткрытиеФормы" - открыть форму обработки
//              "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//              "ВызовСерверногоМетода" - вызов серверного экспортного метода из модуля объекта обработки
// ** ПоказыватьОповещение - Булево - если Истина, требуется оказывать оповещение при начале и при окончании запуска
//              обработки. Прим. Имеет смысл только при запуске обработки без открытия формы.
// ** Модификатор - Строка - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов
//              подсистемы Печать требуется установить как "ПечатьMXL"
Функция СведенияОВнешнейОбработке() Экспорт

	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", "Контур.Закупки подключаемый модуль");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Версия", "1.0.0");

	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");

	РегистрационныеДанные.Вставить("Информация", "Обработка подключаемого модуля для Контур.Закупки");

	ТЗКоманд = Новый ТаблицаЗначений;
	ТЗКоманд.Колонки.Добавить("Идентификатор");
	ТЗКоманд.Колонки.Добавить("Представление");
	ТЗКоманд.Колонки.Добавить("Модификатор");
	ТЗКоманд.Колонки.Добавить("ПоказыватьОповещение");
	ТЗКоманд.Колонки.Добавить("Использование");

	РегистрационныеДанные.Вставить("Команды", ТЗКоманд);

	Возврат РегистрационныеДанные;

КонецФункции

#КонецОбласти
#КонецЕсли