&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _КлиентскиеВызовы;

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьФорму(ФормаКлиентскиеВызовы) Экспорт
	
	_КлиентскиеВызовы = ФормаКлиентскиеВызовы;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресНастройкиСКД = Параметры.АдресНастройкиСКД;
	МетаданныеДокумента = Параметры.МетаданныеДокумента;
	МетаданныеДокументаПредставление = Параметры.МетаданныеДокументаПредставление;
	ИдентификаторНастройки = Параметры.ИдентификаторНастройки;
	
	Если ЭтоАдресВременногоХранилища(АдресНастройкиСКД) Тогда
		НастройкаСКД = ПолучитьИзВременногоХранилища(АдресНастройкиСКД).Получить();
	Иначе
		НастройкаСКД = Неопределено;
	КонецЕсли;
	ИнициализироватьКомпоновщикДанных(МетаданныеДокумента, МетаданныеДокументаПредставление, ИдентификаторНастройки, НастройкаСКД);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикДанных(МетаданныеДокумента, МетаданныеДокументаПредставление, ИдентификаторНастройки, НастройкаСКД)
	
	ОбработкаОбъект = ОбработкаОбъект();
	
	СтруктураНастройкиТипа = Новый Структура;
	СтруктураНастройкиТипа.Вставить("МетаданныеДокумента", МетаданныеДокумента);	
	СтруктураНастройкиТипа.Вставить("ИдентификаторНастройки", ИдентификаторНастройки);	
 	СтруктураНастройкиТипа.Вставить("МетаданныеДокументаПредставление", МетаданныеДокументаПредставление);	

	МассивНастроек = Новый Массив;
	МассивНастроек.Добавить(СтруктураНастройкиТипа);
	НовыйСКД = ОбработкаОбъект.ИнициализироватьСКД(МассивНастроек);

	Если НовыйСКД <> Неопределено Тогда
		
		URLСхемы = ПоместитьВоВременноеХранилище(НовыйСКД, Новый УникальныйИдентификатор());
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
		КомпоновщикНастроекСКД.Инициализировать(ИсточникНастроек);
				
		Если НастройкаСКД <> Неопределено Тогда
			КомпоновщикНастроекСКД.ЗагрузитьНастройки(НастройкаСКД);
		Иначе
			КомпоновщикНастроекСКД.ЗагрузитьНастройки(НовыйСКД.НастройкиПоУмолчанию);
		КонецЕсли;
					
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ЗначениеВыбора = ЗначениеВыбораНаСервере();
	ОповеститьОВыборе(ЗначениеВыбора);
	
КонецПроцедуры

&НаСервере
Функция ЗначениеВыбораНаСервере()
	
	Результат = Новый Структура;
	
	Если КомпоновщикНастроекСКД.Настройки.Отбор.Элементы.Количество() = 0 
		И КомпоновщикНастроекСКД.Настройки.Выбор.Элементы.Количество() = 0 Тогда
		НастройкаСКД = Неопределено;
		Результат.Вставить("ПредставлениеНастройкиСКД", "<Все документы>");
	Иначе
		НастройкаСКД = КомпоновщикНастроекСКД.Настройки;
		Результат.Вставить("ПредставлениеНастройкиСКД", Строка(НастройкаСКД.Отбор));
	КонецЕсли;
	
	Результат.Вставить("АдресНастройкиСКД", ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(НастройкаСКД), АдресНастройкиСКД));
	
	Возврат Результат;

КонецФункции

