#Область СлужебныеПроцедурыИФункции

#Область Обмен

Функция ПараметрыЗавершенияОбмена() Экспорт
	
	ПараметрыЗавершения = Новый Структура;
	ПараметрыЗавершения.Вставить("Контекст");
	ПараметрыЗавершения.Вставить("ОповещениеПриЗавершении");
	
	Возврат ПараметрыЗавершения;
	
КонецФункции

Функция ПредставлениеПодсистемы() Экспорт
	
	Возврат "ИС МП";
	
КонецФункции

#КонецОбласти

#Область Подпись

// Обработчик завершения определения вида упаковок
//
// Параметры:
//  Результат                - Массив - содержит передаваемые сообщения.
//  Контекст  - Структура - содержит дополнительные параметры обработчика.
//
Процедура ПродолжитьВыполнениеОбменаПослеУточненияВидаУпаковок(Результат, Контекст) Экспорт
	
	Если Результат <> "УточненыКоэффициентыУпаковокИСМП" Тогда
		Возврат;
	КонецЕсли;
	
	РезультатОбмена = ОбменДаннымиИСМПВызовСервера.ПродолжитьВыполнениеОбмена(
		Контекст.ПодписанныеСообщенияПоОрганизациям,
		Контекст.АдресРезультатаОбменаВоВременномХранилище);
	
	ОбменДаннымиИСМПКлиент.ОбработатьРезультатОбмена(
		РезультатОбмена,
		Контекст.Форма, Контекст, Контекст.ОповещениеПриЗавершении, Истина);
	
КонецПроцедуры

#КонецОбласти

// Обработчик завершения регистрации МОД в ГИС МТ
//
// Параметры:
//  Результат - Структура - содержит результаты регистрации МОД.
//  Контекст  - Структура - содержит дополнительные параметры обработчика.
//
Процедура ПродолжитьВыполнениеОбменаПослеУточненияПараметровРегистрацииМОД(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Или Не Результат.МОДЗарегистрирован Тогда
		Возврат;
	КонецЕсли;
	
	РезультатОбмена = ОбменДаннымиИСМПВызовСервера.ПродолжитьВыполнениеОбмена(
		Контекст.ПодписанныеСообщенияПоОрганизациям,
		Контекст.АдресРезультатаОбменаВоВременномХранилище);
	
	ОбменДаннымиИСМПКлиент.ОбработатьРезультатОбмена(
		РезультатОбмена,
		Контекст.Форма, Контекст, Контекст.ОповещениеПриЗавершении, Истина);
	
КонецПроцедуры

#КонецОбласти