
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрСостояние = Новый ПараметрКомпоновкиДанных("СпСостояние");
	НайдПараметрСостояние = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СпСостояние"));
	Если НайдПараметрСостояние <> Неопределено Тогда
		Если ТолькоЗавершенные Тогда
			СпСостояние = Новый Массив;
			СпСостояние.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("completed", Неопределено));
			СпСостояние.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("c-completed", Неопределено));
			
			НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрСостояние, СпСостояние);
		Иначе
			НайдПараметрСостояние.Использование = Ложь;
		КонецЕсли;
	КонецЕсли;
	ЭтотОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		ЭтотОбъект.СхемаКомпоновкиДанных,
		ЭтотОбъект.КомпоновщикНастроек.Настройки,
		ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
	
КонецПроцедуры

Функция НайтиСостояниеДОПоКоду(КодАнгл, ОтвСторона = Неопределено)
	Возврат Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду(КодАнгл, ОтвСторона)
КонецФункции
