
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПроверкаОтвета", РежимПроверкиОтвета);
	
	ОбновитьДанныеФормы();
	
	Если ЗначениеЗаполнено(Объект.Титул1) Тогда 
		Элементы.Титул1.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Титул1.Гиперссылка = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюИДоступностью();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Повторно выполнить задачу";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Выполнить задачу";
	КонецЕсли;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
	КонецЕсли;
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;
	
	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	
	// TODO
	//ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	//Элементы.ФормаОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = ЭтоВходящий И Не ЕстьДокУчСист;
	
	//Элементы.ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = Не ЕстьДокУчСист;	
	//Элементы.ПерезаполнитьПоДокОснованию.Видимость = НЕ ЭтоВходящий И ЕстьДокУчСист;
	
	Элементы.ПользовательПодписант.Видимость = НЕ ЭтоВходящий;
	
	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, 
		Объект.ДокументОснование,
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, 
		ТекущийСтатус);
		
	СоставительТ1 	= Объект.Титул1.Составитель;
	//НаимЭкСубСостТ1 = Объект.Титул1.НаимЭкСубСост;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();

	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()

	ЭтаФорма.Прочитать();
	ОбновитьДанныеФормы();
	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()

	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ЭтоВходящий = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен");
	ЭтоЧерновик = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
			
	// причина отказа в подписи 
	
	Элементы.ОтказатьВПриемеЗаявки.Видимость 	= ЭтоЧерновик;
	Элементы.ЕстьОтказВПриеме.Видимость 		= (ЭтоВходящий Или Не ЭтоЧерновик) И Объект.ЕстьОтказВПодписи;	
	Элементы.ПричинаОтказаВПриеме.Видимость 	= Объект.ЕстьОтказВПодписи;
	
	Элементы.ПричинаОтказаВПриеме.ТолькоПросмотр = ЭтоВходящий Или Не ЭтоЧерновик;
	
	// режим проверки
	Элементы.ГруппаОтказВПриеме.Видимость 				= Не РежимПроверкиОтвета;
	Элементы.ГруппаКоманднаяПанельПроверка.Видимость 	= РежимПроверкиОтвета;
	Элементы.ГруппаКоманднаяПанельНеПроверка.Видимость 	= Не РежимПроверкиОтвета;
	
	ЭтаФорма.ТолькоПросмотр = РежимПроверкиОтвета;
	
КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
	УправлениеВидимостьюИДоступностью();
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ДФ_Титул2.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура СвернутьШапку(Команда)

	ШапкаНаОтдельнойЗакладке = Истина;
	УстановитьПоложениеШапки();

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьШапку(Команда)

	ШапкаНаОтдельнойЗакладке = Ложь;
	УстановитьПоложениеШапки();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеШапки()

	Если ШапкаНаОтдельнойЗакладке Тогда

		текАктивнаяЗакладка = Элементы.Страницы.ТекущаяСтраница;

		ПереместитьШапкуВызовСервера();
		Элементы.СвернутьШапку.Видимость = Ложь;
		Элементы.РазвернутьШапку.Видимость = Истина;

		ПанельОшибокРазвернута = Элементы.ПанельОшибок.РастягиватьПоВертикали;
		Если Не ПанельОшибокРазвернута Тогда
			ПанельОшибокСвернутьРазвернутьВызовОМ();
		КонецЕсли;

		Элементы.Страницы.ТекущаяСтраница = текАктивнаяЗакладка;

	Иначе

		ПереместитьШапкуВызовСервера();
		Элементы.СвернутьШапку.Видимость = Истина;
		Элементы.РазвернутьШапку.Видимость = Ложь;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПереместитьШапкуВызовСервера()

	Если ШапкаНаОтдельнойЗакладке Тогда
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма,
															   Элементы.ГруппаШапкаМестоположение,
															   Элементы.СтраницаШапка);
	Иначе
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма,
															   Элементы.ГруппаШапкаМестоположение,
															   Элементы.ГруппаШапкаДанные);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()

	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

// Обслуживание панели ошибок

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТумблерПодписатьИОтправитьПриИзменении(Элемент)
	
	Если Не Объект.ЕстьОтказВПодписи Тогда 
		Объект.ПричинаОтказаВПодписи = "";
	КонецЕсли;	
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаОтказаВПодписиПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставительПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОснДовОргСостПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура Титул1ПриИзменении(Элемент)
	ОбновитьДанныеФормы();
КонецПроцедуры
