#Область Служебные

Функция СформироватьОписаниеПоручения(Документ) Экспорт
	
	МассивОписания = Новый Массив;
	
	Для каждого стрОснование Из Документ.Основания Цикл
		
		Если ТипЗнч(стрОснование.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			МассивОписания.Добавить(СтрШаблон("Номер счета %1 от %2", стрОснование.Основание.НомерПоДаннымПоставщика, Формат(стрОснование.Основание.ДатаПоДаннымПоставщика, "ДФ=dd.MM.yyyy")));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стрОснование.Основание.Комментарий) Тогда
			МассивОписания.Добавить(стрОснование.Основание.Комментарий);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(МассивОписания, Символы.ПС);
	
КонецФункции

#КонецОбласти
