#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура АУ_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОсобыеУсловияПеревозкиОписание = Документы.ПоручениеЭкспедитору.СформироватьОписаниеПоручения(ЭтотОбъект);
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура АУ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ ДополнительныеСвойства.БылПроведен Тогда
		
		ВидСобытияУведомления = "ПроведеноПоручениюЭкспедитору";
		СуществующееУведомление = АУ_Уведомления.ПолучитьИнформациюОПоследнемУведомлении(Ссылка, ВидСобытияУведомления);
		Если СуществующееУведомление.Объект = Неопределено Тогда
			
			АдресаПолучателей = АУ_Уведомления.СформироватьМассивАдресовПолучателейПоМассивуПользователей(ЭтотОбъект.АУ_Исполнители.Выгрузить().ВыгрузитьКолонку("Исполнитель"));
		
			Если АдресаПолучателей.Количество() > 0 Тогда
				
				Тема = СтрШаблон("Создан документ %1", Ссылка);
				Тело = СтрШаблон("Создан документ %1
								 |Ссылка на документ : %2", Ссылка, ПолучитьНавигационнуюСсылку(Ссылка));
				
				АУ_Уведомления.ОтправитьПочтовоеУведомление(Ссылка, ВидСобытияУведомления, Тема, Тело, АдресаПолучателей,,,,,,,);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура АУ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("БылПроведен", Ссылка.Проведен);
	
КонецПроцедуры

#КонецОбласти
