
// Все изменения сделаннные в формах основной обработки ФормаСлужебная_ИмпортЭкспортНастроек и ФормаСлужебная_МножественныйВыборИзСписка
// 	должны быть перенесены и во внешнюю обработку КлеверенсТСД_ИмпортЭкспортНастроек. 
// 	Внешняя обработка хранится по пути \core\Служебные обработки\КлеверенсТСД_ИмпортЭкспортНастроек
// Эти формы должны быть совместимы, если используются в виде внешней обработки.
// Внешняя обработка была сделана для совместимости с ОО 1.6.0. Неизвесто начиная с какой верссии импорт/экспорт работает корректно.

&НаКлиенте
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

&НаКлиенте
Перем ЗапускИзОсновнойОбработки Экспорт;

&НаКлиенте
Перем КатегорииНастроекMS;

&НаКлиенте
Функция ВерсияВнешнейОбработки()
	Возврат "0.19, 23.08.2024";
КонецФункции 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		РеквизитОбъект 			= РеквизитФормыВЗначение("Объект");
		ПолноеИмяОбъекта 		= РеквизитОбъект.Метаданные().ПолноеИмя();
		//ИспользуемоеИмяФайла 	= ?(ЛокЯдро_ЭтоВнешняяОбработка(), РеквизитОбъект.ИспользуемоеИмяФайла, "");
		//ИмяОбъекта 				= РеквизитОбъект.Метаданные().Имя;
	#КонецЕсли	
	
	// Добавляем колонки в таблицы, которые не отображаются на форме. Программное добавление сделано для совместимости с ОФ
	ДобавляемыеРеквизиты = Новый Массив;
	
	// ТаблицаБизнесПроцессов
	ИмяТаблицы = "ТаблицаБизнесПроцессов";
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ID_БизнесПроцесса",		Новый ОписаниеТипов("Строка"), 	ИмяТаблицы)); 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Название",				Новый ОписаниеТипов("Строка"), 	ИмяТаблицы)); 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("НомерСтроки",			Новый ОписаниеТипов("Число"), 	ИмяТаблицы)); 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Картинка",				Новый ОписаниеТипов("Картинка"), 	ИмяТаблицы)); 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Синоним",				Новый ОписаниеТипов("Строка"), 	ИмяТаблицы)); 
	
	// ТаблицаУзлов
	ИмяТаблицы = "ТаблицаУзлов";
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Наименование",			Новый ОписаниеТипов("Строка"), 	ИмяТаблицы)); 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ID_Узла",					Новый ОписаниеТипов("Строка"), 	ИмяТаблицы));
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Для каждого НовыйРеквизит Из ДобавляемыеРеквизиты Цикл
			ИмяТаблицы = НовыйРеквизит.Путь;
			Таблица = ЭтаФорма[ИмяТаблицы];
			Таблица.Колонки.Добавить(НовыйРеквизит.Имя, НовыйРеквизит.ТипЗначения);	
		КонецЦикла;
	#Иначе
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
		ПриСозданииНаСервере(Неопределено, Неопределено);
		ДеревоНастроек.Колонки.Добавить("Картинка", Новый ОписаниеТипов("Картинка"));
	#КонецЕсли
	
	РежимОбмена = ?(РежимОбмена = "" ИЛИ РежимОбмена = "0", "Импорт", РежимОбмена);
	
	Если ЗапускИзОсновнойОбработки = Истина Тогда
		Заголовок = "Клеверенс: " + РежимОбмена + " настроек";
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			//Элементы.ДеревоНастроекДополнительнаяКоманднаяПанель.Кнопки.Еще.Кнопки.ДеревоНастроекВерсияВнешнейОбработки.Видимость = Ложь;
			Элементы.РежимОбменаИмпорт.Видимость = Ложь;
			Элементы.РежимОбменаЭкспорт.Видимость = Ложь;
		#Иначе
			Элементы.ДеревоНастроекВерсияВнешнейОбработки.Видимость = Ложь;
			Элементы.РежимОбмена.Видимость = Ложь;
		#КонецЕсли
		
	Иначе
		Заголовок = "Клеверенс: Импорт/экспорт настроек";
		ЗапускИзОсновнойОбработки = Ложь;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Элементы.ДеревоНастроекДополнительнаяКоманднаяПанель.Кнопки.Еще.Кнопки.ДеревоНастроекВерсияВнешнейОбработки.Текст = "Версия обработки: " + ВерсияВнешнейОбработки();
		#Иначе
			Элементы.ДеревоНастроекВерсияВнешнейОбработки.Заголовок = "Версия обработки: " + ВерсияВнешнейОбработки();
		#КонецЕсли
		
		#Область СовместимыйКодFresh
		//Возврат;
		#КонецОбласти //СовместимыйКодFresh
		
		ГлавнаяФорма = ПроверитьДоступностьОсновнойОбработки();
		Если ГлавнаяФорма = Ложь Тогда
			Возврат;
		КонецЕсли;
		
		// +++ TODO:
		// Костыльный вариант сделан для совместимости со старыми вресиями ОО
		РезультатВыбора = Новый Структура("Данные", Новый Структура("Ид"));
		ДопПараметры = Новый Структура("ПроцедураКВыполнениюПослеВыбора, ОбъектыНазначения, ЛокКонтекст", "ДопПараметры.ЛокКонтекст = _ЛокКонтекст //");
		ГлавнаяФорма.ОповещениеОткрытьОкноВыбораДокументаСмартсЗавершение(РезультатВыбора, ДопПараметры);
		_ЛокКонтекст = ДопПараметры.ЛокКонтекст;
		// ---
		
	КонецЕсли;
	
	ПереключитьОтображениеСлужебныхПолей(Неопределено);
	ЕстьЧастнаяБаза = _ЛокКонтекст.ЕстьЧастнаяБаза;
	ИнициализацияСПроверкойПодключения(, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимОбменаПриИзменении(Элемент)
	ИнициализацияСПроверкойПодключения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ДеревоНастроекПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТекущаяКолонка = Элементы.ДеревоНастроек.ТекущаяКолонка.Имя;
	#Иначе
		ТекущаяКолонка = Элементы.ДеревоНастроек.ТекущийЭлемент.Имя;
	#КонецЕсли
	
	Если ТекущаяКолонка = "ДеревоНастроекИспользовать" Тогда
		
		ТекущиеДанные = Элементы.ДеревоНастроек.ТекущиеДанные;
		Если НЕ ТекущиеДанные.Доступность Тогда
			Сообщить("Данная настройка недоступна");
			ТекущиеДанные.Использовать = Ложь;
			Возврат;
		КонецЕсли;
		
		УстанавливатьИзменениеДетальныхЗаписей = НЕ (ТекущиеДанные.ТипСтроки = "Группа" ИЛИ ТекущиеДанные.ТипСтроки = "Файл");
		
		Если НЕ УстанавливатьИзменениеДетальныхЗаписей Тогда
			УстановитьЗначениеВДеревоРекурсивно(ПолучитьЭлементыСтроки(ТекущиеДанные), "Использовать", ТекущиеДанные.Использовать);
			ТекущиеДанные.ИзменениеДетальныхЗаписей = Ложь;
		КонецЕсли;
		
		СвязанныеЭлементыВыбраны = ВыбратьСвязанныеЭлементыНастроек(ТекущиеДанные);
		
		Если СвязанныеЭлементыВыбраны Тогда
			РежимИспользования = ОбновитьПризнакИспользованияРекурсивно(ПолучитьЭлементыСтроки(ДеревоНастроек));
		Иначе
			ПервыйРодитель = ПолучитьПервогоРодителяСтроки(ТекущиеДанные);
			Если ПервыйРодитель <> ТекущиеДанные Тогда
				РежимИспользования = ОбновитьПризнакИспользованияРекурсивно(ПолучитьЭлементыСтроки(ПервыйРодитель));
				ПервыйРодитель.Использовать = РежимИспользования > 0;
				ПервыйРодитель.ИзменениеДетальныхЗаписей = РежимИспользования = 2 
					И НЕ ПервыйРодитель.ТипСтроки = "Группа"
					И РежимОбмена = "Импорт";
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерезапуститьОбработку(Команда)
	Если ОбработкаИнициализирована Тогда
		ИнициализацияСПроверкойПодключения();
	Иначе
		ПриОткрытии(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ОчиститьСообщения();
	ТаблицаОшибок.Очистить();
	Если НЕ ПроверитьДоступностьОбмена() Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимОбмена = "Импорт" Тогда
		СохранитьНастройкиВБазуSMARTS();
	ИначеЕсли РежимОбмена = "Экспорт" Тогда
		СтруктураНастроек = ПолучитьИзВременногоХранилища(АдресДанныхНастроек);
		Если ЗапускИзОсновнойОбработки = Истина Тогда
			_ЛокКонтекст.ЛокЯдро_СохранитьНастройкиВФайл(СтруктураНастроек, "ИмпортЭкспортНастроек", Истина);
		Иначе
			_ЛокКонтекст.ЛокЯдро_СохранитьНастройкиВФайл(СтруктураНастроек, "ИмпортЭкспортНастроек");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	УстановитьЗначениеВДеревоРекурсивно(ПолучитьЭлементыСтроки(ДеревоНастроек), "Использовать", Истина);
	УстановитьЗначениеВДеревоРекурсивно(ПолучитьЭлементыСтроки(ДеревоНастроек), "ИзменениеДетальныхЗаписей", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановитьЗначениеВДеревоРекурсивно(ПолучитьЭлементыСтроки(ДеревоНастроек), "Использовать", Ложь);
	УстановитьЗначениеВДеревоРекурсивно(ПолучитьЭлементыСтроки(ДеревоНастроек), "ИзменениеДетальныхЗаписей", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПоУзлу(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	Для каждого СтрокаУзла Из ТаблицаУзлов Цикл
		СписокВыбора.Добавить(СтрокаУзла.ID_Узла, СтрокаУзла.Наименование);
	КонецЦикла;
	
	ПараметрыВыбора  = Новый Структура();
	ПараметрыВыбора.Вставить("ПолеСравнения", "ID_Узла");
	ПараметрыВыбора.Вставить("КоличествоСтрок", СписокВыбора.Количество());
	ПараметрыВыбора.Вставить("ВыборПо", "Узлы");
	
	ОП = Новый ОписаниеОповещения("ВыборПоОтборуЗавершение", ЭтаФорма, ПараметрыВыбора);
	ОткрытьФормуМножественногоВыбора("Клеверенс: Выберете торговые объекты", "<Описание>", СписокВыбора, ОП);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПоБП(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	Для каждого СтрокаУзла Из ТаблицаБизнесПроцессов Цикл
		СписокВыбора.Добавить(СтрокаУзла.ID_БизнесПроцесса, СтрокаУзла.Синоним);
	КонецЦикла;
	
	ПараметрыВыбора  = Новый Структура();
	ПараметрыВыбора.Вставить("ПолеСравнения", "Ид");
	ПараметрыВыбора.Вставить("КоличествоСтрок", СписокВыбора.Количество());
	ПараметрыВыбора.Вставить("ВыборПо", "БизнесПроцессы");
	
	ОП = Новый ОписаниеОповещения("ВыборПоОтборуЗавершение", ЭтаФорма, ПараметрыВыбора);
	ОткрытьФормуМножественногоВыбора("Клеверенс: Выберете бизнес-процессы", "<Описание>", СписокВыбора, ОП);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьОтображениеСлужебныхПолей(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		лЭлементы = Элементы.ДеревоНастроек.Колонки;
	#Иначе
		лЭлементы = Элементы;
	#КонецЕсли
	
	Видимость = НЕ лЭлементы.ДеревоНастроекИмя.Видимость;
	
	лЭлементы.ДеревоНастроекИмя.Видимость = Видимость;
	лЭлементы.ДеревоНастроекТипСтроки.Видимость = Видимость;
	лЭлементы.ДеревоНастроекИзменениеДетальныхЗаписей.Видимость = Видимость;
	лЭлементы.ДеревоНастроекЭтоРодитель.Видимость = Видимость;
	лЭлементы.ДеревоНастроекДоступность.Видимость = Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьНастройки(Команда)
	
	Если ОбработкаИнициализирована Тогда
		Если РежимОбмена = "Импорт" Тогда
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьНастройкиИзФайлаЗавершение", ЭтаФорма);
			Если ЗапускИзОсновнойОбработки = Истина Тогда
				_ЛокКонтекст.ЛокЯдро_ПолучитьНастройкиИзФайла("ИмпортЭкспортНастроек", ОповещениеОЗавершении, Истина);
			Иначе
				_ЛокКонтекст.ЛокЯдро_ПолучитьНастройкиИзФайла("ИмпортЭкспортНастроек", ОповещениеОЗавершении);
			КонецЕсли;
		Иначе
			ИнициализацияСПроверкойПодключения();
		КонецЕсли;
	Иначе
		ПриОткрытии(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОшибки(Команда)
	ТаблицаОшибок.Очистить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьОтображение(КритическаяОшибка = "")
	
	ЭтоИмпорт = РежимОбмена = "Импорт";
	
	Если КритическаяОшибка  = "НетГлавнойФормы" И НЕ ЗапускИзОсновнойОбработки Тогда
		
		Элементы.ОшибкаИнициализации.Заголовок = 
			"Не удалось найти главную форму основной обработки Клеверенс! 
			|Для импорта/экспорта настроек необходимо открыть основную обработку.";
		ОбработкаИнициализирована = Ложь;
		
	ИначеЕсли КритическаяОшибка = "НетПодключенияSMARTS" Тогда
		
		Элементы.ОшибкаИнициализации.Заголовок = 
			"Ошибка подключения к базе MobileSmarts";
		ОбработкаИнициализирована = Ложь;
		
	ИначеЕсли ОбработкаИнициализирована Тогда
		Элементы.ВыполнитьОбмен.КнопкаПоУмолчанию = Истина;
		Элементы.ВыполнитьОбмен.Заголовок = ТРег(РежимОбмена);
	КонецЕсли;
	
	Элементы.ПерезапуститьОбработку.КнопкаПоУмолчанию = НЕ ОбработкаИнициализирована;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ОбработкаИнициализирована Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.Страницы.ГруппаТелоФормы
		Иначе
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.Страницы.ГруппаОшибкаИнициализации
		КонецЕсли;
		Элементы.ДеревоНастроек.Колонки.ДеревоНастроекИспользовать.Доступность = ЭтоИмпорт;
		
		Элементы.ДеревоНастроекКоманднаяПанель.Кнопки.ВыбратьВсе.Доступность = ЭтоИмпорт;
		Элементы.ДеревоНастроекКоманднаяПанель.Кнопки.СнятьВсе.Доступность = ЭтоИмпорт;
		Для каждого КнопкаВыбора Из Элементы.ДеревоНастроекКоманднаяПанель.Кнопки.ГруппаДеревоНастроекВыбор.Кнопки Цикл
			КнопкаВыбора.Доступность = ЭтоИмпорт;
		КонецЦикла;
		
	#Иначе
		Если ОбработкаИнициализирована Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаТелоФормы;
		Иначе
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОшибкаИнициализации;
		КонецЕсли;
		Элементы.ДеревоНастроекИспользовать.Доступность = ЭтоИмпорт;
		
		Элементы.ВыбратьВсе.Доступность = ЭтоИмпорт;
		Элементы.СнятьВсе.Доступность = ЭтоИмпорт;
		Элементы.ГруппаДеревоНастроекВыбор.Доступность = ЭтоИмпорт;
		
	#КонецЕсли
	
	Элементы.ВерсияНастроек.Видимость = НЕ ПустаяСтрока(ВерсияНастроек);
	Элементы.ВерсияНастроекЗаголовок.Видимость = Элементы.ВерсияНастроек.Видимость;
	
	Если ЭтоИмпорт Тогда
		Элементы.ПеречитатьНастройки.Заголовок = "Получить настройки из файла";
		Элементы.ПеречитатьНастройки.Картинка = БиблиотекаКартинок.ОткрытьФайл;
	Иначе
		Элементы.ПеречитатьНастройки.Заголовок = "Перечитать настройки";
		Элементы.ПеречитатьНастройки.Картинка = БиблиотекаКартинок.Обновить;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция ПредставлениеВерсииНастроек(ДанныеНастроек)
	Возврат Строка(ДанныеНастроек.ВерсияОбработкиНастроек) + " (" + ДанныеНастроек.ДатаНастроек + ")";
КонецФункции 

&НаКлиенте
Функция ПроверитьДоступностьОбмена()
	
	Доступно = Истина;
	
	Если ПроверитьДоступностьОсновнойОбработки() = Ложь Тогда
		Возврат Ложь;		
	КонецЕсли;
	
	Если АдресДанныхНастроек = "" Тогда
		Сообщить("Пустая таблица настроек.");
		Доступно = Ложь;
	КонецЕсли;
	
	Если АдресДанныхНастроек <> "" И РежимОбмена = "Импорт" Тогда
		
		ЕстьОтмеченныеЭлементы = НайтиПервоеЗначениеДереваРекурсивно(ПолучитьЭлементыСтроки(ДеревоНастроек), "Использовать", Истина);
		Если ЕстьОтмеченныеЭлементы = Неопределено Тогда
			Сообщить("Нет отмеченных настроек для импорта.");
			Доступно = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Доступно;
	
КонецФункции 

&НаКлиенте
Процедура ВыборПоОтборуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭлементыДерева = ПолучитьЭлементыСтроки(ДеревоНастроек);
		
		Если ДополнительныеПараметры.ВыборПо = "БизнесПроцессы"
			И ДополнительныеПараметры.КоличествоСтрок = Результат.Количество() Тогда
			
			Для каждого Строка Из ЭлементыДерева Цикл
				Если Строка.Имя = "НастройкиБП_Общий"
					ИЛИ Строка.Имя = "НастройкиОтборов"
					ИЛИ Строка.Имя = "ГлобальныеПараметры_Общий"
					ИЛИ Строка.Имя = "ПроизвольныеКоды" Тогда
					УстановитьЗначениеВДеревоРекурсивно(ПолучитьЭлементыСтроки(Строка), "Использовать", Истина);					
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			Для каждого Идентификатор Из Результат Цикл
				УстановитьЗначениеВДеревоПоУсловию(ЭлементыДерева, "Использовать", Истина, ДополнительныеПараметры.ПолеСравнения, "Равно", Идентификатор, Истина);	
			КонецЦикла;
		КонецЕсли;
		
		РежимИспользования = ОбновитьПризнакИспользованияРекурсивно(ЭлементыДерева);
		
	КонецЕсли;
	
КонецПроцедуры 

#Область ИнициализацияНастроек

&НаКлиенте
Функция ПроверитьДоступностьОсновнойОбработки()
	
	Если ЗапускИзОсновнойОбработки Тогда
		Возврат Истина;
	КонецЕсли;
		
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		ГлавнаяФорма = Неопределено;
		Попытка
			ГлавнаяФорма = ПолучитьФорму("ВнешняяОбработка.КлеверенсТСД_ОсновнаяОбработка.Форма.ОФ_ГлавнаяФорма");
		Исключение
		КонецПопытки;
		
		Если ГлавнаяФорма = Неопределено Тогда
			Попытка
				ГлавнаяФорма = ПолучитьФорму("Обработка.КлеверенсТСД_ОсновнаяОбработка.Форма.ОФ_ГлавнаяФорма");
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	#Иначе
		
		ЗаголовокПоиска = НСтр("be = 'Cleverence'; en = 'Cleverence'; es = 'Cleverence'; ka = 'Cleverence'; kk = 'Cleverence'; ro = 'Cleverence'; ru = 'Клеверенс'; tr = 'Cleverence'; uk = 'Cleverence'; uz = 'Cleverence'");
		АктивныеОкна = ПолучитьОкна();
		ГлавнаяФорма = Неопределено;
		
		Для каждого ТекОкно Из АктивныеОкна Цикл
			Если _ЛокКонтекст.ЛокЯдро_СтрНайти(ТекОкно.Заголовок, ЗаголовокПоиска) И ТекОкно.Содержимое.Количество() Тогда
				ДанныеФормы = ТекОкно.Содержимое[0];
				Если _ЛокКонтекст.ЛокЯдро_СтрНайти(ДанныеФормы.ИмяФормы, "ГлавнаяФорма") Тогда
					ГлавнаяФорма = ДанныеФормы;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	#КонецЕсли

	Если ГлавнаяФорма = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ГлавнаяФорма.ID_ТекущейБазы) Тогда
		ОбновитьОтображение("НетГлавнойФормы");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ГлавнаяФорма;
	
КонецФункции 

&НаКлиенте
Процедура ИнициализацияСПроверкойПодключения(ДанныеНастроек = Неопределено, ПроверитьДоступностьОО = Истина)
	
	Если ПроверитьДоступностьОО И ПроверитьДоступностьОсновнойОбработки() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("ДанныеНастроек", ДанныеНастроек);
	ОП = Новый ОписаниеОповещения("ИнициализацияПослеПодключения",ЭтаФорма, ДопПараметры);
	_ЛокКонтекст.ЛокЯдро_ПроверитьСоединениеССерверомSMARTS(,,?(ЕстьЧастнаяБаза,"Частная","Основная"),,,,ОП);
	
КонецПроцедуры 

&НаКлиенте
Процедура ИнициализацияПослеПодключения(СерверДоступен, ДополнительныеПараметры) Экспорт
	
	ЕстьУзлы = Ложь;
	ОбработкаИнициализирована = Ложь;
	АдресДанныхНастроек = "";
	ВерсияНастроек = "";
	
	ТаблицаБизнесПроцессов.Очистить();
	ТаблицаУзлов.Очистить();
	ПолучитьЭлементыСтроки(ДеревоНастроек).Очистить();
	
	Если НЕ СерверДоступен Тогда
		ОбновитьОтображение("НетПодключенияSMARTS");
		Возврат;
	КонецЕсли;
	
	КатегорииНастроекMS = _ЛокКонтекст.КомЯдро_ПолучитьЗначениеПеременной("КатегорииНастроекMS");
	Если КатегорииНастроекMS = Неопределено Тогда
		КатегорииНастроекMS = _ЛокКонтекст.ЛокЯдро_ПолучитьКатегорииНастроекMS();
	КонецЕсли;
	
	АдресаПеременных = _ЛокКонтекст.АдресаПеременных;
	МетаданныеНастроек = МетаданныеНастроек();
	Если РежимОбмена = "Импорт"
		И ДополнительныеПараметры.ДанныеНастроек <> Неопределено Тогда
		
		ЗаполнитьТаблицуНастроекНаКлиенте(ДополнительныеПараметры.ДанныеНастроек, МетаданныеНастроек);
		
	ИначеЕсли РежимОбмена = "Экспорт" Тогда
		ЗаполнитьТаблицуНастроекНаКлиенте(ПолучитьНастройкиИзSMARTS(), МетаданныеНастроек);
		ВыбратьВсе(Неопределено);
	КонецЕсли;
	
	ОбработкаИнициализирована = Истина;
	ОбновитьОтображение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНастройкиИзФайлаЗавершение(СтруктураНастроек, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(СтруктураНастроек) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализацияСПроверкойПодключения(СтруктураНастроек);
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьНастройкиИзSMARTS(ПолучитьВсе = Истина, ОтборНастроек = Неопределено)
	
	Если ОтборНастроек = Неопределено Тогда
		ОтборНастроек = Новый Структура;
	КонецЕсли;
	
	//ВерсияНастроек
	//ВерсияОбработкиНастроек
	//ГлобальныеПараметры_Значения
	//ГлобальныеПараметры_Значения_Узлы
	//ГлобальныеПараметры_Пользовательские
	//ГруппыПользователей
	//НастройкиБизнесПроцессов_Пользовательские
	//НастройкиБизнесПроцессов_ПользовательскиеНастройки
	//НастройкиБизнесПроцессов_ПользовательскиеНастройки_Узлы
	//НастройкиБизнесПроцессов_ПоУмолчанию
	//НастройкиОбменаСправочников
	//НастройкиОбменаСправочников_Узлы
	//НастройкиОбменаСправочников_Шапка
	//НастройкиОтборовУзлов_Автообмен
	//НастройкиОтборовУзлов_Автообмен_Узлы
	//НастройкиОтборовУзлов_Интерактивный
	//НастройкиОтборовУзлов_Интерактивный_Узлы
	//НастройкиОтборовУзлов_Онлайн
	//НастройкиОтборовУзлов_Онлайн_Узлы
	//Пользователи
	//ПользователиТСД_Узлы
	//ПроизвольныеКоды_Пользовательские
	//ПроизвольныеКоды_ПоУмолчанию
	//ПроизвольныеОтборыДокументов
	//Узлы
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДатаНастроек", ТекущаяДата());
	СтруктураНастроек.Вставить("ВерсияОбработкиОбменаНастроек", ВерсияВнешнейОбработки());
	
	ЗначенияНастроек = Новый Структура;
	
	НастройкиКПолучению = Новый Структура;
	НастройкиКПолучению.Вставить("ВерсияОбработкиНастроек");
	НастройкиКПолучению.Вставить("Узлы");
	_ЛокКонтекст.ЛокЯдро_ПолучитьНастройкиНаСервереSMARTS(НастройкиКПолучению);
	Для каждого НастройкаMS Из НастройкиКПолучению Цикл
		ЗначенияНастроек.Вставить(НастройкаMS.Ключ, НастройкаMS.Значение);
	КонецЦикла;
	
	// Узлы обработка значений
	ЗначенияНастроек.Вставить("ЕстьУзлы", Ложь);
	Узлы = ЗначенияНастроек.Узлы;
	МассивИдУзлов = Новый Массив;
	Если НЕ Узлы = Ложь И ТипЗнч(Узлы) = Тип("Массив")  Тогда
		Для Каждого СтрокаУзла Из Узлы Цикл
			Если ТипЗнч(СтрокаУзла) = Тип("Структура") И СтрокаУзла.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;	
			МассивИдУзлов.Добавить(СтрокаУзла.ID_Узла);
			ЗначенияНастроек.ЕстьУзлы = Истина;
		КонецЦикла;
	КонецЕсли;
	ЗначенияНастроек.Вставить("ИдУзлов", МассивИдУзлов);
	
	// Бизнес-процессы
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("ОбщаяСтруктураБизнесПроцессов") ИЛИ ОтборНастроек.Свойство("НастройкиОтборов") Тогда
		ЗначенияНБП = ПолучитьСтруктуруНастроекБизнесПроцессов();
		Для каждого КлючЗначение Из ЗначенияНБП Цикл
			ЗначенияНастроек.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
		ЗначенияНастроек.Вставить("НастройкиБизнесПроцессов_ПользовательскиеНастройки_Узлы", 	ПолучитьНастройкиПоУзламSMARTS("НастройкиБизнесПроцессов_ПользовательскиеНастройки", МассивИдУзлов));
	КонецЕсли;
	
	НастройкиКПолучению = Новый Структура;
	
	// Глобальные параметры
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("ГлобальныеПараметры_Значения") Тогда
		НастройкиКПолучению.Вставить("ГлобальныеПараметры_ПоУмолчанию");
		НастройкиКПолучению.Вставить("ГлобальныеПараметры_Пользовательские");
		НастройкиКПолучению.Вставить("ГлобальныеПараметры_Значения");
	КонецЕсли;
	
	// Обмен справочников
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("НастройкиОбменаСправочников") Тогда
		НастройкиКПолучению.Вставить("НастройкиОбменаСправочников");
		ЗначенияНастроек.Вставить("НастройкиОбменаСправочников_Узлы", 				ПолучитьНастройкиПоУзламSMARTS("НастройкиОбменаСправочников", МассивИдУзлов));
	КонецЕсли;
	
	// Настройки отборов	
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("НастройкиОтборовУзлов_Автообмен") Тогда
		НастройкиКПолучению.Вставить("НастройкиОтборовУзлов_Автообмен");
	КонецЕсли;
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("НастройкиОтборовУзлов_Интерактивный") Тогда
		НастройкиКПолучению.Вставить("НастройкиОтборовУзлов_Интерактивный");
	КонецЕсли;
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("НастройкиОтборовУзлов_Онлайн") Тогда
		НастройкиКПолучению.Вставить("НастройкиОтборовУзлов_Онлайн");
	КонецЕсли;
	
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("НастройкиОтборовУзлов_Онлайн_Узлы") Тогда
		ЗначенияНастроек.Вставить("НастройкиОтборовУзлов_Онлайн_Узлы", 				ПолучитьНастройкиПоУзламSMARTS("НастройкиОтборовУзлов_Онлайн", МассивИдУзлов));
	КонецЕсли;
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("НастройкиОтборовУзлов_Интерактивный_Узлы") Тогда
		ЗначенияНастроек.Вставить("НастройкиОтборовУзлов_Интерактивный_Узлы",		ПолучитьНастройкиПоУзламSMARTS("НастройкиОтборовУзлов_Интерактивный", МассивИдУзлов));
	КонецЕсли;
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("НастройкиОтборовУзлов_Автообмен_Узлы") Тогда
		ЗначенияНастроек.Вставить("НастройкиОтборовУзлов_Автообмен_Узлы", 			ПолучитьНастройкиПоУзламSMARTS("НастройкиОтборовУзлов_Автообмен", МассивИдУзлов));
	КонецЕсли;
	
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("НастройкиОтборов") Тогда
		НастройкиКПолучению.Вставить("ПроизвольныеОтборыДокументов");
	КонецЕсли;
	
	// Произвольные коды
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("ПроизвольныеКоды") Тогда
		НастройкиКПолучению.Вставить("ПроизвольныеКоды_Пользовательские");
		НастройкиКПолучению.Вставить("ПроизвольныеКоды_ПоУмолчанию");
	КонецЕсли;
	
	_ЛокКонтекст.ЛокЯдро_ПолучитьНастройкиНаСервереSMARTS(НастройкиКПолучению);
	Для каждого НастройкаMS Из НастройкиКПолучению Цикл
		ЗначенияНастроек.Вставить(НастройкаMS.Ключ, НастройкаMS.Значение);
	КонецЦикла;
	
	// Шапка обмена справочников
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("НастройкиОбменаСправочников_Шапка") Тогда
		НастройкиКПолучению = Новый Структура;
		НастройкиКПолучению.Вставить("ВыгружатьНоменклатуруДокументаПередВыгрузкойДокумента");
		НастройкиКПолучению.Вставить("ДлинаКодаВесовогоТовара");
		НастройкиКПолучению.Вставить("ИспользоватьШаблоныВесовогоТовара");
		НастройкиКПолучению.Вставить("ПереписыватьНоменклатуруПриВыгрузке");
		НастройкиКПолучению.Вставить("ПрефиксВключенВКодВесовогоТовара");
		НастройкиКПолучению.Вставить("ПрефиксКодаВесовогоТовара");
		НастройкиКПолучению.Вставить("РазмерПорцииНоменклатуры");
		НастройкиКПолучению.Вставить("УстановитьПоискПоНаименованиюИАртикулу");
		НастройкиКПолучению.Вставить("ЧислоЗнаковПослеЗапятойВесТовара");
		
		_ЛокКонтекст.ЛокЯдро_ПолучитьНастройкиНаСервереSMARTS(НастройкиКПолучению);
		ЗначенияНастроек.Вставить("НастройкиОбменаСправочников_Шапка", НастройкиКПолучению);
	КонецЕсли;
	
	// Пользователи
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("Пользователи") Тогда
		// Пользователи
		ЗначениеНастройки = _ЛокКонтекст.ЛокЯдро_ПолучитьПользователейSMARTS();
		Если ЭтоАдресВременногоХранилища(ЗначениеНастройки) Тогда
			ЗначениеНастройки = ПолучитьИзВременногоХранилища(ЗначениеНастройки);
		КонецЕсли;
		ЗначенияНастроек.Вставить("Пользователи", ЗначениеНастройки);
	КонецЕсли;
	
	// Группы пользователей
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("ГруппыПользователей") Тогда
		// Группы пользователей
		ЗначениеНастройки = _ЛокКонтекст.ЛокЯдро_ПолучитьГруппыПользователейSMARTS();
		Если ЭтоАдресВременногоХранилища(ЗначениеНастройки) Тогда	
			ЗначениеНастройки = ПолучитьИзВременногоХранилища(ЗначениеНастройки);
		КонецЕсли;
		ЗначенияНастроек.Вставить("ГруппыПользователей", ЗначениеНастройки);
	КонецЕсли;
	
	// Пользователи ТСД
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("ПользователиТСД_Узлы") Тогда
		ЗначенияНастроек.Вставить("ПользователиТСД_Узлы", ПолучитьНастройкиПоУзламSMARTS("ПользователиТСД", МассивИдУзлов));
	КонецЕсли;
	
	// Обработка глобальных параметров
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("ГлобальныеПараметры_Значения") Тогда
		// Глобальные параметры
		ГлобальныеПараметры = Новый Массив();
		ГлобальныеПараметры_ПоУмолчанию 	 =  ЗначенияНастроек.ГлобальныеПараметры_ПоУмолчанию;
		ГлобальныеПараметры_Пользовательские = ЗначенияНастроек.ГлобальныеПараметры_Пользовательские;
		
		Если ЗначениеЗаполнено(ГлобальныеПараметры_ПоУмолчанию) И НЕ ГлобальныеПараметры_ПоУмолчанию = Ложь Тогда
			Для каждого СтрокаГП ИЗ ГлобальныеПараметры_ПоУмолчанию Цикл
				Если НЕ СтрокаГП.Свойство("ЭтоТаблицаЗначений") Тогда
					СтрокаГП.Вставить("Типовой", Истина);
					ГлобальныеПараметры.Добавить(_ЛокКонтекст.ЛокЯдро_СкопироватьСтруктуру(СтрокаГП));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГлобальныеПараметры_Пользовательские) И НЕ ГлобальныеПараметры_Пользовательские = Ложь Тогда
			Для каждого СтрокаГП ИЗ ГлобальныеПараметры_Пользовательские Цикл
				Если НЕ СтрокаГП.Свойство("ЭтоТаблицаЗначений") Тогда
					НайденныйПараметр = _ЛокКонтекст.ЛокЯдро_НайтиСтруктуруВМассивеПоЭлементу(ГлобальныеПараметры_ПоУмолчанию, "ID_Параметра", СтрокаГП.ID_Параметра);
					Если НайденныйПараметр = Неопределено Тогда
						СтрокаГП.Вставить("Типовой", Ложь);
						ГлобальныеПараметры.Добавить(_ЛокКонтекст.ЛокЯдро_СкопироватьСтруктуру(СтрокаГП));
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ГлобальныеПараметры_Значения = ЛокЯдро_ПолучитьЗначенияГлобальныхПараметров(ГлобальныеПараметры,  ЗначенияНастроек.ГлобальныеПараметры_Значения);
		ЗначенияНастроек.Вставить("ГлобальныеПараметры_Значения", ГлобальныеПараметры_Значения);
	КонецЕсли;
	
	// Глобальные параметры узлов
	Если ПолучитьВсе ИЛИ ОтборНастроек.Свойство("ГлобальныеПараметры_Значения_Узлы") Тогда
		ГлобальныеПараметры_Значения_Узлы = ПолучитьНастройкиПоУзламSMARTS("ГлобальныеПараметры_Значения", МассивИдУзлов);
		Для каждого КлючЗначение Из ГлобальныеПараметры_Значения_Узлы Цикл
			ЗначениеУзла = ЛокЯдро_ПолучитьЗначенияГлобальныхПараметров(ГлобальныеПараметры, КлючЗначение.Значение, КлючЗначение.Ключ);
			ГлобальныеПараметры_Значения_Узлы.Вставить(КлючЗначение.Ключ, ЗначениеУзла);
		КонецЦикла;
		ЗначенияНастроек.Вставить("ГлобальныеПараметры_Значения_Узлы", ГлобальныеПараметры_Значения_Узлы);
	КонецЕсли;
	
	СтруктураНастроек.Вставить("ВерсияОбработкиНастроек", ЗначенияНастроек.ВерсияОбработкиНастроек);
	СтруктураНастроек.Вставить("Значения", ЗначенияНастроек);
	Возврат СтруктураНастроек;
	
КонецФункции

&НаКлиенте
Функция ПолучитьНовыеЗначенияSMARTS()
	
	ЗначенияНастроек = Новый Структура;
	ЗначенияНастроек.Вставить("Узлы");
	
	_ЛокКонтекст.ЛокЯдро_ПолучитьНастройкиНаСервереSMARTS(ЗначенияНастроек);
	
	// Получение узлов
	ЗначенияНастроек.Вставить("ЕстьУзлы", Ложь);
	Узлы = ЗначенияНастроек.Узлы;
	МассивИдУзлов = Новый Массив;
	Если НЕ Узлы = Ложь И ТипЗнч(Узлы) = Тип("Массив")  Тогда
		Для Каждого СтрокаУзла Из Узлы Цикл
			Если ТипЗнч(СтрокаУзла) = Тип("Структура") И СтрокаУзла.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;	
			МассивИдУзлов.Добавить(СтрокаУзла.ID_Узла);
			ЗначенияНастроек.ЕстьУзлы = Истина;
		КонецЦикла;
	КонецЕсли;
	ЗначенияНастроек.Вставить("ИдУзлов", МассивИдУзлов);
	
	ЗначенияНБП = ПолучитьСтруктуруНастроекБизнесПроцессов();
	Для каждого КлючЗначение Из ЗначенияНБП Цикл
		ЗначенияНастроек.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	ОбработатьОбщуюСтруктуруБизнесПроцессов(ЗначенияНастроек);
	
	Возврат ЗначенияНастроек;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруНастроекБизнесПроцессов()
	
	ЗначенияНастроек = Новый Структура;
	ЗначенияНастроек.Вставить("НастройкиБизнесПроцессов_Пользовательские");
	ЗначенияНастроек.Вставить("НастройкиБизнесПроцессов_ПользовательскиеНастройки");
	ЗначенияНастроек.Вставить("НастройкиБизнесПроцессов_ПоУмолчанию");
	ЗначенияНастроек.Вставить("ВерсияНастроек");
	
	_ЛокКонтекст.ЛокЯдро_ПолучитьНастройкиНаСервереSMARTS(ЗначенияНастроек);
	
	пВерсияНастроек = _ЛокКонтекст.ЛокЯдро_ПолучитьНастройкуНаСервереSMARTS("ВерсияНастроек");
	Для каждого КлючЗначение Из ЗначенияНастроек Цикл
		Если НЕ ТипЗнч(КлючЗначение.Значение) = Тип("Структура") Тогда
			ЗначенияНастроек.Вставить(КлючЗначение.Ключ, Новый Структура("ВерсияНастроек,НастройкиБизнесПроцессов", пВерсияНастроек, КлючЗначение.Значение));
		КонецЕсли;
	КонецЦикла;
	
	НастройкиБизнесПроцессов_ПоУмолчанию 					= ?(ЗначенияНастроек.НастройкиБизнесПроцессов_ПоУмолчанию = Ложь, Ложь, ЗначенияНастроек.НастройкиБизнесПроцессов_ПоУмолчанию.НастройкиБизнесПроцессов);
	НастройкиБизнесПроцессов_Пользовательские 				= ?(ЗначенияНастроек.НастройкиБизнесПроцессов_Пользовательские = Ложь, Ложь, ЗначенияНастроек.НастройкиБизнесПроцессов_Пользовательские.НастройкиБизнесПроцессов);
	НастройкиБизнесПроцессов_ПользовательскиеНастройки 	= ?(ЗначенияНастроек.НастройкиБизнесПроцессов_ПользовательскиеНастройки = Ложь, Ложь, ЗначенияНастроек.НастройкиБизнесПроцессов_ПользовательскиеНастройки.НастройкиБизнесПроцессов);
	ЗначенияНастроек.Вставить("НастройкиБизнесПроцессов_ПоУмолчанию", 						НастройкиБизнесПроцессов_ПоУмолчанию);	
	ЗначенияНастроек.Вставить("НастройкиБизнесПроцессов_Пользовательские", 					НастройкиБизнесПроцессов_Пользовательские);	
	ЗначенияНастроек.Вставить("НастройкиБизнесПроцессов_ПользовательскиеНастройки", 		НастройкиБизнесПроцессов_ПользовательскиеНастройки);
	
	Возврат ЗначенияНастроек;
	
КонецФункции 

&НаКлиенте
Процедура ОбработатьОбщуюСтруктуруБизнесПроцессов(ЗначенияНастроек)
	
	Если НЕ ЗначенияНастроек.Свойство("НастройкиБизнесПроцессов_ПоУмолчанию") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщаяСтруктураБизнесПроцессов = ЛокЯдро_ПолучитьОбщуюСтруктуруБизнесПроцессов(ЗначенияНастроек.НастройкиБизнесПроцессов_ПоУмолчанию, ЗначенияНастроек.НастройкиБизнесПроцессов_Пользовательские, ЗначенияНастроек.НастройкиБизнесПроцессов_ПользовательскиеНастройки);
	ЗначенияНастроек.Вставить("ОбщаяСтруктураБизнесПроцессов", ОбщаяСтруктураБизнесПроцессов);
	
	ИдБизнесПроцессов = Новый Массив;
	Для Каждого СтрокаНастройки Из ОбщаяСтруктураБизнесПроцессов Цикл
		Если СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
			Продолжить;
		КонецЕсли;
		ИдБизнесПроцессов.Добавить(СтрокаНастройки.ID_БизнесПроцесса);
	КонецЦикла;
	ЗначенияНастроек.Вставить("ИдБизнесПроцессов", ИдБизнесПроцессов);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройкиПоУзламSMARTS(ИмяНастройки, ИдУзлов)
	
	Сериализовать = КатегорииНастроекMS.СериализуемыеНастройки.Найти(ИмяНастройки) <> Неопределено;
	
	СтруктураНастроек = Новый Структура;
	Для Каждого ID_Узла Из ИдУзлов Цикл
		ЗначениеНастройки = _ЛокКонтекст.ЛокЯдро_ПолучитьНастройкуНаСервереSMARTS(ИмяНастройки, ID_Узла);
		Если НЕ ЗначениеНастройки = Ложь И Сериализовать Тогда
			ЗначениеНастройки = СериализоватьНастройки(ЗначениеНастройки, "ИзСтроки");
		КонецЕсли;
		СтруктураНастроек.Вставить(ID_Узла, ЗначениеНастройки);
	КонецЦикла;
	
	Возврат СтруктураНастроек;
	
КонецФункции 

&НаКлиенте
Функция МетаданныеНастроек()
	
	МетаданныеСписокНастроек = Новый Структура;
	МетаданныеДеревоНастроек = Новый Структура;
	
	// Торговые объекты {
	
	// Группа Торговые объекты
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "Узлы";
	Настройка.Синоним		= "Торговые объекты";
	Настройка.ТипСтроки		= "Файл";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= Неопределено;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	МетаданныеДеревоНастроек.Вставить(Настройка.Имя, Настройка);
	
	// } Торговые объекты
	
	
	
	// Бизнес-процессы {
	
	// Группа Бизнес-процессы
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиБП_Общий";
	Настройка.Синоним		= "Бизнес-процессы";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= Неопределено;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	МетаданныеДеревоНастроек.Вставить(Настройка.Имя, Настройка);
	
	// ++ Бизнес-процессы настройки
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "ОбщаяСтруктураБизнесПроцессов";
	Настройка.Синоним		= "Настройки";
	Настройка.ТипСтроки		= "Файл";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиБП_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Бизнес-процессы настройки
	
	// ++ Группа Бизнес-процессы использование по ТО
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиБизнесПроцессов_ПользовательскиеНастройки_Узлы";
	Настройка.Синоним		= "По торговым объектам";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Истина;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиБП_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Группа Бизнес-процессы использование по ТО
	
	// } Бизнес-процессы
	
	
	
	// Отборы (онлайн, интерактивные, автообмен, произвольные запросы) {
	
	// Группа Отборы 
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОтборов";
	Настройка.Синоним		= "Настройки отборов";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= Неопределено;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	МетаданныеДеревоНастроек.Вставить(Настройка.Имя, Настройка);
	
	// Отборы онлайн {
	
	// Группа Отборы онлайн
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОтборовУзлов_Онлайн_Общий";
	Настройка.Синоним		= "Онлайн";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОтборов;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	
	
	// ++ Отборы онлайн общие
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОтборовУзлов_Онлайн";
	Настройка.Синоним		= "Настройки";
	Настройка.ТипСтроки		= "Файл";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОтборовУзлов_Онлайн_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Отборы онлайн общие
	
	// ++ Группа Отборы онлайн торговых объектов
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОтборовУзлов_Онлайн_Узлы";
	Настройка.Синоним		= "По торговым объектам";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Истина;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОтборовУзлов_Онлайн_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Группа Отборы онлайн торговых объектов
	
	// } Отборы онлайн
	
	
	// Отборы интерактивные {
	
	// Группа Отборы интерактивные
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОтборовУзлов_Интерактивный_Общий";
	Настройка.Синоним		= "Интерактивные";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОтборов;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	
	// ++ Отборы интерактивные общие
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОтборовУзлов_Интерактивный";
	Настройка.Синоним		= "Настройки";
	Настройка.ТипСтроки		= "Файл";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОтборовУзлов_Интерактивный_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Отборы интерактивные общие
	
	// ++ Отборы интерактивные торговых объектов
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОтборовУзлов_Интерактивный_Узлы";
	Настройка.Синоним		= "По торговым объектам";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Истина;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОтборовУзлов_Интерактивный_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Отборы интерактивные торговых объектов
	
	// } Отборы интерактивные
	
	// Отборы Автообмен {
	
	// Группа Отборы Автообмен
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОтборовУзлов_Автообмен_Общий";
	Настройка.Синоним		= "Автообмен";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОтборов;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	
	// ++ Отборы Автообмен общие
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОтборовУзлов_Автообмен";
	Настройка.Синоним		= "Настройки";
	Настройка.ТипСтроки		= "Файл";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОтборовУзлов_Автообмен_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Отборы Автообмен общие
	
	// ++ Отборы Автообмен торговых объектов
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОтборовУзлов_Автообмен_Узлы";
	Настройка.Синоним		= "По торговым объектам";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Истина;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОтборовУзлов_Автообмен_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Отборы Автообмен торговых объектов
	
	// } Отборы Автообмен
	
	// Отборы произвольные запросы {
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "ПроизвольныеОтборыДокументов";
	Настройка.Синоним		= "Произвольные запросы";
	Настройка.ТипСтроки		= "Файл";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОтборов;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// } Отборы произвольные запросы
	
	// } Отборы онлайн, интерактивные, автообмен,  произвольные запросы)
	
	
	
	
	// Глобальные параметры {
	
	// Группа Глобальные параметры
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "ГлобальныеПараметры_Общий";
	Настройка.Синоним		= "Глобальные параметры";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= Неопределено;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	МетаданныеДеревоНастроек.Вставить(Настройка.Имя, Настройка);
	
	// ++ Глобальные параметры общие
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "ГлобальныеПараметры_Значения";
	Настройка.Синоним		= "Настройки";
	Настройка.ТипСтроки		= "Файл";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Ложь;
	Настройка.Родитель		= МетаданныеСписокНастроек.ГлобальныеПараметры_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Глобальные параметры общие
	
	// ++ Глобальные параметры торговых объектов
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "ГлобальныеПараметры_Значения_Узлы";
	Настройка.Синоним		= "По торговым объектам";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Истина;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.ГлобальныеПараметры_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Глобальные параметры торговых объектов
	
	// } Глобальные параметры
	
	
	
	// Настройки справочников {
	// Группа Настройки справочников
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОбменаСправочников_Группа";
	Настройка.Синоним		= "Настройки справочников";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= Неопределено;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	МетаданныеДеревоНастроек.Вставить(Настройка.Имя, Настройка);
	
	// ++ Настройки справочников общие
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОбменаСправочников_Шапка";
	Настройка.Синоним		= "Общие параметры";
	Настройка.ТипСтроки		= "Файл";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Ложь;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОбменаСправочников_Группа;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Настройки справочников общие
	
	// ++ Настройки справочников общие
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОбменаСправочников";
	Настройка.Синоним		= "Настройки обмена";
	Настройка.ТипСтроки		= "Файл";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Ложь;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОбменаСправочников_Группа;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Настройки справочников общие
	
	// ++ Настройки справочников торговых объектов
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "НастройкиОбменаСправочников_Узлы";
	Настройка.Синоним		= "По торговым объектам";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Истина;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.НастройкиОбменаСправочников_Группа;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	// -- Настройки справочников торговых объектов
	
	
	// } Настройки справочников
	
	
	
	// Произвольные коды {
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "ПроизвольныеКоды";
	Настройка.Синоним		= "Произвольные коды";
	Настройка.ТипСтроки		= "Файл";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= Неопределено;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	МетаданныеДеревоНастроек.Вставить(Настройка.Имя, Настройка);
	// } Произвольные коды
	
	
	
	// Пользователи {
	
	// Группа Настройки пользователей
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "Пользователи_Общий";
	Настройка.Синоним		= "Настройки пользователей";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= Неопределено;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	МетаданныеДеревоНастроек.Вставить(Настройка.Имя, Настройка);
	
	// Настройки Пользователи
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "Пользователи";
	Настройка.Синоним		= "Пользователи";
	Настройка.ТипСтроки		= "Файл";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.Пользователи_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	
	// Группы Пользователей
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "ГруппыПользователей";
	Настройка.Синоним		= "Группы пользователей";
	Настройка.ТипСтроки		= "Файл";
	Настройка.ТребуютсяТО	= Ложь;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.Пользователи_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	
	// Пользователи по узлам
	Настройка = ПолучитьСтруктуруМетаданныхНастроек();
	Настройка.Имя				= "ПользователиТСД_Узлы";
	Настройка.Синоним		= "По торговым объектам";
	Настройка.ТипСтроки		= "Группа";
	Настройка.ТребуютсяТО	= Истина;
	Настройка.ЭтоРодитель	= Истина;
	Настройка.Родитель		= МетаданныеСписокНастроек.Пользователи_Общий;
	МетаданныеСписокНастроек.Вставить(Настройка.Имя, Настройка);
	
	// } Пользователи
	
	
	
	Результат = Новый Структура;
	Результат.Вставить("СписокНастроек", МетаданныеСписокНастроек);
	Результат.Вставить("ДеревоНастроек", МетаданныеДеревоНастроек);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруМетаданныхНастроек()
	
	Настройка = Новый Структура;
	Настройка.Вставить("Имя", "");
	Настройка.Вставить("Синоним", "");
	Настройка.Вставить("ТипСтроки", "");
	Настройка.Вставить("ЭтоРодитель", Ложь);
	Настройка.Вставить("Родитель");
	Настройка.Вставить("Использовать", Ложь);
	Настройка.Вставить("Доступность", Истина);
	Настройка.Вставить("ТребуютсяТО", Ложь);
	Настройка.Вставить("ЭтоДетальныеЗаписиУзлов", Ложь);
	
	Возврат Настройка;
	
КонецФункции 

&НаСервере
Функция ПолучитьСтруктуруМетаданныхНастроекНаСервере()
	
	Настройка = Новый Структура;
	Настройка.Вставить("Имя", "");
	Настройка.Вставить("Синоним", "");
	Настройка.Вставить("ТипСтроки", "");
	Настройка.Вставить("ЭтоРодитель", Ложь);
	Настройка.Вставить("Родитель");
	Настройка.Вставить("Использовать", Ложь);
	Настройка.Вставить("Доступность", Истина);
	Настройка.Вставить("ТребуютсяТО", Ложь);
	Настройка.Вставить("ЭтоДетальныеЗаписиУзлов", Ложь);
	
	Возврат Настройка;
	
КонецФункции 

&НаКлиенте
Процедура СохранитьНастройкиВБазуSMARTS()
	
	СтрокиДерева = ПолучитьЭлементыСтроки(ДеревоНастроек);
	
	НастройкиSMARTS = ПолучитьНастройкиИзSMARTS(Ложь, ПолучитьИменаВыбранныхНастроек(СтрокиДерева));
	ОбработатьОбщуюСтруктуруБизнесПроцессов(НастройкиSMARTS.Значения);
	ДанныеНастроек = ПолучитьИзВременногоХранилища(АдресДанныхНастроек);
	ДанныеНастроек.Вставить("НастройкиSMARTS", НастройкиSMARTS);
	
	ДополнительныеПараметры = Новый Структура("ВыгрузитьБизнесПроцессы", Ложь);
	СохранитьНастройкиВБазуSMARTSРекурсивно(СтрокиДерева, ДанныеНастроек, ДополнительныеПараметры);
	
	Если ДополнительныеПараметры.ВыгрузитьБизнесПроцессы Тогда
		ЛокЯдро_ВыгрузитьБизнесПроцессыВТаблицу();
	КонецЕсли;
	
	ЛокЯдро_ОбновитьНастройкиMobileSMARTS();
	ПоказатьПредупреждение(, "Импорт настроек завершен");
	
КонецПроцедуры 

&НаКлиенте
Процедура СохранитьНастройкиВБазуSMARTSРекурсивно(СтрокиДерева, ДанныеНастроек, ДополнительныеПараметры)
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.Использовать Тогда
			
			Если СтрокаДерева.ТипСтроки = "Группа" Тогда
				СохранитьНастройкиВБазуSMARTSРекурсивно(ПолучитьЭлементыСтроки(СтрокаДерева), ДанныеНастроек, ДополнительныеПараметры);
				
			ИначеЕсли СтрокаДерева.ТипСтроки = "Файл" Тогда
				ОбработчикСохраненияНастроекSMARTS(СтрокаДерева, ДанныеНастроек, ДополнительныеПараметры);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработчикСохраненияНастроекSMARTS(СтрокаДерева, ДанныеНастроек, ДополнительныеПараметры)
	
	ИмяНастройки 					= СтрокаДерева.Имя;
	ИмяНастройкиБезРасширения 	= СтрЗаменить(ИмяНастройки, "_Узлы", "");
	ID_Узла 							= СтрокаДерева.ID_Узла;
	ЗначенияИмпорт					= ДанныеНастроек.Значения;
	ЗначенияSMARTS 					= ДанныеНастроек.НастройкиSMARTS.Значения;
	
	// Проверка на наличие узла в базе или импортируемых настройках
	Если ИмяНастройкиБезРасширения <> "Узлы" И ID_Узла <> "" Тогда
		Если НЕ ЗначенияSMARTS.ЕстьУзлы
			ИЛИ ЗначенияSMARTS.ИдУзлов.Найти(ID_Узла) = Неопределено Тогда
			УзелНастройки = ТаблицаУзлов.НайтиСтроки(Новый Структура("ID_Узла", ID_Узла))[0];
			ОписаниеОшибки = "Не удалось найти торговый объект: " + УзелНастройки.Наименование + ". Выберете торговые объекты для импорта";
			ДобавитьЗаписьОшибки(ОписаниеОшибки, ИмяНастройки, ID_Узла);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Получение значений импортируемых настроек и объединение с текущими настройками базы MS
	ОбновитьЗначенияSMARTS = Ложь;
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("ВерсияОбработкиНастроек", ДанныеНастроек.ВерсияОбработкиНастроек);
	
	Если ИмяНастройкиБезРасширения = "ОбщаяСтруктураБизнесПроцессов" Тогда
		
		ПараметрыОтбора = Новый Структура("ЛевоеПоле, ПравоеПоле", "ID_БизнесПроцесса", "Ид");
		ВыбранныеНБП_ПоУмолчанию 					= ПолучитьДанныеВыбранныхДетальныхЗаписей(СтрокаДерева, ЗначенияИмпорт.НастройкиБизнесПроцессов_ПоУмолчанию, 					ПараметрыОтбора);
		ВыбранныеНБП_Пользовательские 				= ПолучитьДанныеВыбранныхДетальныхЗаписей(СтрокаДерева, ЗначенияИмпорт.НастройкиБизнесПроцессов_Пользовательские, 				ПараметрыОтбора);
		ВыбранныеНБП_ПользовательскиеНастройки 	= ПолучитьДанныеВыбранныхДетальныхЗаписей(СтрокаДерева, ЗначенияИмпорт.НастройкиБизнесПроцессов_ПользовательскиеНастройки, 	ПараметрыОтбора);
		
		СтруктураОтбора 						= Новый Структура("ID_БизнесПроцесса");
		БП_ПоУмолчанию 					= ОбъединитьМассивыУникальнымиЗначениями(ВыбранныеНБП_ПоУмолчанию, 					ЗначенияSMARTS.НастройкиБизнесПроцессов_ПоУмолчанию, СтруктураОтбора);
		БП_Пользовательские 				= ОбъединитьМассивыУникальнымиЗначениями(ВыбранныеНБП_Пользовательские, 				ЗначенияSMARTS.НастройкиБизнесПроцессов_Пользовательские, СтруктураОтбора);
		БП_ПользовательскиеНастройки 		= ОбъединитьМассивыУникальнымиЗначениями(ВыбранныеНБП_ПользовательскиеНастройки, 	ЗначенияSMARTS.НастройкиБизнесПроцессов_ПользовательскиеНастройки, СтруктураОтбора);
		
		СтруктураНастройки.Вставить("НастройкиБизнесПроцессов_ПоУмолчанию", БП_ПоУмолчанию);
		СтруктураНастройки.Вставить("НастройкиБизнесПроцессов_Пользовательские", БП_Пользовательские);
		СтруктураНастройки.Вставить("НастройкиБизнесПроцессов_ПользовательскиеНастройки", БП_ПользовательскиеНастройки);
		ОбновитьЗначенияSMARTS = Истина;
		ДополнительныеПараметры.ВыгрузитьБизнесПроцессы = Истина;
		
	ИначеЕсли ИмяНастройкиБезРасширения = "ПроизвольныеКоды" Тогда
		
		СтруктураОтбора = Новый Структура("ID_ПроизвольногоКода");
		ПараметрыОтбора = Новый Структура("ЛевоеПоле, ПравоеПоле", "ID_ПроизвольногоКода", "Ид");
		
		ЗначениеИмпорт 					= НайтиЗначениеНастройки(ЗначенияИмпорт, "ПроизвольныеКоды_ПоУмолчанию");
		ЗначениеSMARTS 					= НайтиЗначениеНастройки(ЗначенияSMARTS, "ПроизвольныеКоды_ПоУмолчанию");
		ВыбранныеЗначенияИмпорт 		= ПолучитьДанныеВыбранныхДетальныхЗаписей(СтрокаДерева, ЗначениеИмпорт, ПараметрыОтбора);
		ВыбранныеЗначенияИмпорт 		= ОбъединитьМассивыУникальнымиЗначениями(ВыбранныеЗначенияИмпорт, ЗначениеSMARTS, СтруктураОтбора);
		СтруктураНастройки.Вставить("ПроизвольныеКоды_ПоУмолчанию", ВыбранныеЗначенияИмпорт);
		
		ЗначениеИмпорт 					= НайтиЗначениеНастройки(ЗначенияИмпорт, "ПроизвольныеКоды_Пользовательские");
		ЗначениеSMARTS 					= НайтиЗначениеНастройки(ЗначенияSMARTS, "ПроизвольныеКоды_Пользовательские");
		ВыбранныеЗначенияИмпорт 		= ПолучитьДанныеВыбранныхДетальныхЗаписей(СтрокаДерева, ЗначениеИмпорт, ПараметрыОтбора);
		ВыбранныеЗначенияИмпорт 		= ОбъединитьМассивыУникальнымиЗначениями(ВыбранныеЗначенияИмпорт, ЗначениеSMARTS, СтруктураОтбора);
		СтруктураНастройки.Вставить("ПроизвольныеКоды_Пользовательские", ВыбранныеЗначенияИмпорт);
		
	ИначеЕсли ИмяНастройкиБезРасширения = "НастройкиОбменаСправочников_Шапка" Тогда
		
		ЗначениеИмпорт = НайтиЗначениеНастройки(ЗначенияИмпорт, ИмяНастройки, ID_Узла);
		Для каждого КлючЗначение Из ЗначениеИмпорт Цикл
			СтруктураНастройки.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
		
	ИначеЕсли ИмяНастройки = "ГлобальныеПараметры_Значения" Тогда
		
		ЗначениеИмпорт = НайтиЗначениеНастройки(ЗначенияИмпорт, ИмяНастройки, ID_Узла);
		ЗначениеSMARTS = НайтиЗначениеНастройки(ЗначенияSMARTS, ИмяНастройки, ID_Узла);
		ПараметрыОтбора = Новый Структура("ЛевоеПоле, ПравоеПоле", "ID_Параметра", "Ид");
		ВыбранныеЗначенияИмпорт = ПолучитьДанныеВыбранныхДетальныхЗаписей(СтрокаДерева, ЗначениеИмпорт, ПараметрыОтбора);
			
		Если НЕ ТипЗнч(ВыбранныеЗначенияИмпорт) = Тип("Массив") 
			ИЛИ НЕ МассивСтруктурСодержитЭлементы(ВыбранныеЗначенияИмпорт) Тогда
			Возврат;
		КонецЕсли;
		
		ЗначениеИмпорт = ОбъединитьМассивыУникальнымиЗначениями(ВыбранныеЗначенияИмпорт, ЗначениеSMARTS, Новый Структура("ID_Параметра"));
		СтруктураНастройки.Вставить(ИмяНастройкиБезРасширения, ЗначениеИмпорт);
		
		// Поиск ГП в типовых ГП базы
		ЗначениеSMARTS 					= НайтиЗначениеНастройки(ЗначенияSMARTS, "ГлобальныеПараметры_ПоУмолчанию");
		ВыбранныеЗначенияSMARTS 	= ПолучитьДанныеВыбранныхДетальныхЗаписей(СтрокаДерева, ЗначениеSMARTS, ПараметрыОтбора);
		
		// Отбираем новые ГП
		СтруктураОтбора = Новый Структура("ID_Параметра");
		ПользовательскиеНастройки = Новый Массив;
		Для каждого СтрокаНастройки Из ВыбранныеЗначенияИмпорт Цикл
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаНастройки);
			РезультатПоиска = _ЛокКонтекст.ЛокЯдро_НайтиВМассивеСтруктурПоОтбору(ВыбранныеЗначенияSMARTS, СтруктураОтбора, Истина);
			Если РезультатПоиска = Неопределено Тогда
				ПользовательскиеНастройки.Добавить(СтрокаНастройки);
			КонецЕсли;
		КонецЦикла;
		
		// Если найдены новые ГП, то импортируем их в ГлобальныеПараметры_Пользовательские
		Если ПользовательскиеНастройки.Количество() Тогда
			
			СтруктураОтбора = Новый Структура("ID_Параметра");
			
			ГП_ПоУмолчанию 						= НайтиЗначениеНастройки(ЗначенияИмпорт, "ГлобальныеПараметры_ПоУмолчанию");
			ЗначениеИмпорт_ПоУмолчанию 		= НайтиЭлементыПоВхождениюВМассив(ПользовательскиеНастройки, ГП_ПоУмолчанию, СтруктураОтбора, Истина);
			
			Если ТипЗнч(ЗначениеИмпорт_ПоУмолчанию) = Тип("Массив") Тогда
				Для каждого СтрокаНастройки Из ЗначениеИмпорт_ПоУмолчанию Цикл
					Если СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") И СтрокаНастройки.ЭтоТаблицаЗначений Тогда
						Продолжить;
					КонецЕсли;
					СтрокаНастройки.Типовой = Ложь;
				КонецЦикла;
			КонецЕсли;
			
			ГП_Пользовательские				= НайтиЗначениеНастройки(ЗначенияИмпорт, "ГлобальныеПараметры_Пользовательские");
			ЗначениеИмпорт_Пользовательские 	= НайтиЭлементыПоВхождениюВМассив(ПользовательскиеНастройки, ГП_Пользовательские, СтруктураОтбора, Истина);
			ЗначениеИмпорт_Пользовательские 	= ОбъединитьМассивыУникальнымиЗначениями(ЗначениеИмпорт_Пользовательские, ЗначениеИмпорт_ПоУмолчанию, СтруктураОтбора);
			
			ЗначениеSMARTS 					= НайтиЗначениеНастройки(ЗначенияSMARTS, "ГлобальныеПараметры_Пользовательские");
			ВыбранныеЗначенияИмпорт 		= ОбъединитьМассивыУникальнымиЗначениями(ЗначениеИмпорт_Пользовательские, ЗначениеSMARTS, СтруктураОтбора);
			СтруктураНастройки.Вставить("ГлобальныеПараметры_Пользовательские", ВыбранныеЗначенияИмпорт);
			
		КонецЕсли;
		
	Иначе
		
		ЗначениеИмпорт = НайтиЗначениеНастройки(ЗначенияИмпорт, ИмяНастройки, ID_Узла);
		
		// Поиск строк в сохраненных настройках SMARTS. Нужно чтобы не затереть уже сохраненные настройки в MS
		КлючиОтбора = "";
		Если ИмяНастройкиБезРасширения = "Узлы" Тогда
			КлючиОтбора = "ID_Узла";
			ОбновитьЗначенияSMARTS = Истина;
			ДополнительныеПараметры.ВыгрузитьБизнесПроцессы = Истина;
		ИначеЕсли ИмяНастройкиБезРасширения = "ПроизвольныеОтборыДокументов" Тогда
			КлючиОтбора = "ID_ПроизвольногоОтбора";
		ИначеЕсли ИмяНастройкиБезРасширения = "НастройкиОбменаСправочников" Тогда
			КлючиОтбора = "ИмяТаблицы";
		ИначеЕсли ИмяНастройкиБезРасширения = "Пользователи" Тогда
			КлючиОтбора = "Ид";
		ИначеЕсли ИмяНастройкиБезРасширения = "ГруппыПользователей" Тогда
			КлючиОтбора = "Ид";
		ИначеЕсли ИмяНастройкиБезРасширения = "ПользователиТСД" Тогда
			КлючиОтбора = "ID_Пользователя";
		ИначеЕсли _ЛокКонтекст.ЛокЯдро_СтрНайти(ИмяНастройкиБезРасширения, "НастройкиОтборовУзлов") Тогда			
			КлючиОтбора = "ID_БизнесПроцесса";			
		КонецЕсли;
		
		Если КлючиОтбора <> "" Тогда
			ЗначениеSMARTS = НайтиЗначениеНастройки(ЗначенияSMARTS, ИмяНастройки, ID_Узла);
			ПараметрыОтбора = Новый Структура("ЛевоеПоле, ПравоеПоле", КлючиОтбора, "Ид");
			ВыбранныеЗначенияИмпорт = ПолучитьДанныеВыбранныхДетальныхЗаписей(СтрокаДерева, ЗначениеИмпорт, ПараметрыОтбора);
			
			Если НЕ ТипЗнч(ВыбранныеЗначенияИмпорт) = Тип("Массив") Тогда
				Возврат;
			КонецЕсли;
			
			Если _ЛокКонтекст.ЛокЯдро_СтрНайти(ИмяНастройкиБезРасширения, "НастройкиОтборовУзлов") Тогда
				// Проверка на наличие БП в базе или импортируемых настройках
				ОтобранныеЗначения = Новый Массив;
				Для каждого СтрокаНастройки Из ВыбранныеЗначенияИмпорт Цикл
					Если ТипЗнч(СтрокаНастройки) = Тип("Структура") И СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
						ОтобранныеЗначения.Добавить(СтрокаНастройки);
					ИначеЕсли ЗначенияSMARTS.ИдБизнесПроцессов.Найти(СтрокаНастройки.ID_БизнесПроцесса) = Неопределено Тогда
						ОписаниеОшибки = "Не удалось найти бизнес-процесс: " + СтрокаНастройки.Название + ". Выберете бизнес-процессы для импорта";
						ДобавитьЗаписьОшибки(ОписаниеОшибки, ИмяНастройки, СтрокаНастройки.ID_БизнесПроцесса);
					Иначе
						ОтобранныеЗначения.Добавить(СтрокаНастройки);
					КонецЕсли;
				КонецЦикла;
				ВыбранныеЗначенияИмпорт = ОтобранныеЗначения;
			КонецЕсли;
			
			Если НЕ МассивСтруктурСодержитЭлементы(ВыбранныеЗначенияИмпорт) Тогда
				Возврат;
			КонецЕсли;
			
			ЗначениеИмпорт = ОбъединитьМассивыУникальнымиЗначениями(ВыбранныеЗначенияИмпорт, ЗначениеSMARTS, Новый Структура(КлючиОтбора));
			
		КонецЕсли;
		
		СтруктураНастройки.Вставить(ИмяНастройкиБезРасширения, ЗначениеИмпорт);
		
	КонецЕсли;
	
	// Сохранение настроек
	Если ИмяНастройкиБезРасширения = "ОбщаяСтруктураБизнесПроцессов" Тогда
		
		ФормаСписка_БизнесПроцессы = ПолучитьФормуОсновнойОбработки("ФормаСписка_БизнесПроцессы");
		ФормаСписка_БизнесПроцессы._ЛокКонтекст = _ЛокКонтекст;
		ФормаСписка_БизнесПроцессы.ЗагрузитьИзФайлаЗавершение(СтруктураНастройки, Неопределено);
		
	ИначеЕсли ИмяНастройкиБезРасширения = "ПроизвольныеКоды" Тогда
		
		ФормаСписка_ПроизвольныеКоды = ПолучитьФормуОсновнойОбработки("ФормаСписка_ПроизвольныеКоды");
		ФормаСписка_ПроизвольныеКоды._ЛокКонтекст = _ЛокКонтекст;
		ФормаСписка_ПроизвольныеКоды.ЗагрузитьИзФайлаЗавершение(СтруктураНастройки, Неопределено);
		
	ИначеЕсли ИмяНастройкиБезРасширения = "Пользователи" Тогда
		
		// TODO: Сделать загрузку пользователей без цикла, одним запросом
		Для каждого СтрокаПользователя Из ЗначениеИмпорт Цикл
			
			ПараметрыПользователя = Новый Соответствие;
			ПараметрыПользователя.Вставить("id", 				СтрокаПользователя.Ид);
			ПараметрыПользователя.Вставить("name", 			СтрокаПользователя.Имя);		
			ПараметрыПользователя.Вставить("description", 	СтрокаПользователя.Описание);		
			ПараметрыПользователя.Вставить("password", 		СтрокаПользователя.Пароль);			
			ПараметрыПользователя.Вставить("barcode", 		СтрокаПользователя.Штрихкод);		
			ПараметрыПользователя.Вставить("groupId", 		СтрокаПользователя.ИдГруппы);		
			ПараметрыПользователя.Вставить("groupName", 	СтрокаПользователя.ИмяГруппы);		
			ПараметрыПользователя.Вставить("warehouseIds",  СтрокаПользователя.ИдСкладов.ВыгрузитьЗначения());				
			
			ЗагрузкаПользователя = _ЛокКонтекст.ЛокЯдро_ЗагрузитьПользователейВSMARTS(ПараметрыПользователя);    
			
		КонецЦикла;
		
	ИначеЕсли ИмяНастройкиБезРасширения = "ГруппыПользователей" Тогда
		
		// TODO: Сделать загрузку групп без цикла, одним запросом
		Для каждого СтрокаГруппы Из ЗначениеИмпорт Цикл
			
			ПараметрыГруппы = Новый Соответствие;
			ПараметрыГруппы.Вставить("id", 								СтрокаГруппы.Ид);
			ПараметрыГруппы.Вставить("name", 							СтрокаГруппы.Имя);		                                            
			ПараметрыГруппы.Вставить("documentTypeNames", 			СтрокаГруппы.ТипыДокументов);	
			
			// Типы документов для кома-режима
			ПараметрыГруппы.Вставить("batchMode", 					Ложь);		
			ПараметрыГруппы.Вставить("role", 							СтрокаГруппы.Роль);		
			ПараметрыГруппы.Вставить("serverSideInventory", 			Ложь);		
			ПараметрыГруппы.Вставить("autorunDocumentTypeName", 	"");		
			ПараметрыГруппы.Вставить("onStartHandlerName", 			"При начале работы пользователя");		
			ПараметрыГруппы.Вставить("onFinishHandlerName", 		"При завершении работы пользователя");			
			
			РезультатЗагрузки = _ЛокКонтекст.ЛокЯдро_ЗагрузитьГруппыПользователейВSMARTS(ПараметрыГруппы);
			
		КонецЦикла;
		
	Иначе
		
		//Выполним обновление - Начало
		ВерсияОбработки =_ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ВерсияОбработки");		
		Если СтруктураНастройки.Свойство("ВерсияОбработкиНастроек") Тогда
			ВерсияОбработкиНастроек = СтруктураНастройки.ВерсияОбработкиНастроек;
		Иначе
			ВерсияОбработкиНастроек = 0;		
		КонецЕсли;  
		Если ВерсияОбработки>ВерсияОбработкиНастроек Тогда
			СтруктураВызова = Новый Структура;
			СтруктураВызова.Вставить("ТипМетода", "Функция");
			СтруктураВызова.Вставить("ИмяМетода", "ВыполнитьОбновлениеНастроек");
			СтруктураВызова.Вставить("ПараметрыМетода", Новый Структура("ВерсияНастроек,СтруктураНастроек",ВерсияОбработкиНастроек,СтруктураНастройки));
			
			СтруктураНастройки = _ЛокКонтекст.Транзит_ВызватьГлобальныйМетодНаКлиенте(СтруктураВызова,,_ЛокКонтекст.АдресаПеременных);
		КонецЕсли;
		//Выполним обновление - Конец
		
		_ЛокКонтекст.ЛокЯдро_СохранитьНастройкиВБазеSMARTS(СтруктураНастройки, ID_Узла);
	КонецЕсли;
	
	Если ОбновитьЗначенияSMARTS Тогда
		НовыеЗначения = ПолучитьНовыеЗначенияSMARTS();
		Для каждого КлючЗначение Из НовыеЗначения Цикл
			ЗначенияSMARTS.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
		ДанныеНастроек.НастройкиSMARTS.Вставить("Значения", ЗначенияSMARTS);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьДанныеВыбранныхДетальныхЗаписей(СтрокаДерева, ИсточникДанных, ПараметрыОтбора)
	
	Если НЕ ТипЗнч(ИсточникДанных) = Тип("Массив") 
		ИЛИ ИсточникДанных.Количество() = 0 Тогда
		Возврат ИсточникДанных;
	КонецЕсли;
	
	Если НЕ СтрокаДерева.ИзменениеДетальныхЗаписей Тогда
		Возврат ИсточникДанных;
	КонецЕсли;
	
	МассивРезультат = Новый Массив;
	
	СтрокаКолонок = ИсточникДанных[0];
	Если СтрокаКолонок.Свойство("ЭтоТаблицаЗначений") И СтрокаКолонок.ЭтоТаблицаЗначений Тогда
		МассивРезультат.Добавить(СтрокаКолонок);
	КонецЕсли;
	
	ДетальныеЗаписи	= ПолучитьЭлементыСтроки(СтрокаДерева);
	Для каждого ДетальнаяЗапись Из ДетальныеЗаписи Цикл
		
		Если НЕ ДетальнаяЗапись.Использовать Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура(ПараметрыОтбора.ЛевоеПоле, ДетальнаяЗапись[ПараметрыОтбора.ПравоеПоле]);
		РезультатПоиска = _ЛокКонтекст.ЛокЯдро_НайтиВМассивеСтруктурПоОтбору(ИсточникДанных, СтруктураОтбора, Истина);
		Если РезультатПоиска <> Неопределено Тогда
			МассивРезультат.Добавить(РезультатПоиска);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции 

&НаКлиенте
Функция ПолучитьИменаВыбранныхНастроек(СтрокиДерева)
	
	НайденныеСтроки = НайтиСтрокиДереваРекурсивно(СтрокиДерева, "Использовать", Истина);
	
	ИменаНастроек = Новый Структура;
	Для каждого СтрокаДерева Из НайденныеСтроки Цикл
		ИменаНастроек.Вставить(СтрокаДерева.Имя);
	КонецЦикла;
	
	Возврат ИменаНастроек
	
КонецФункции

&НаКлиенте
Функция МассивСтруктурСодержитЭлементы(МассивСтруктур)
	
	Результат = Ложь;
	Если МассивСтруктур.Количество() Тогда
		Если МассивСтруктур[0].Свойство("ЭтоТаблицаЗначений") 
			И МассивСтруктур[0].ЭтоТаблицаЗначений Тогда
			Результат = МассивСтруктур.Количество() > 1;
		Иначе
			Результат = Истина;
		КонецЕсли;			
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти

#Область ЗаполнениеДереваНастроек

&НаКлиенте
Процедура ЗаполнитьТаблицуНастроекНаКлиенте(ДанныеНастроек, МетаданныеНастроек)
	
	ЗначенияНастроек = ДанныеНастроек.Значения;
	ОбработатьОбщуюСтруктуруБизнесПроцессов(ЗначенияНастроек);
	
	АдресДанныхНастроек = ПоместитьВоВременноеХранилище(ДанныеНастроек, ЭтаФорма.УникальныйИдентификатор);
	ВерсияНастроек = ПредставлениеВерсииНастроек(ДанныеНастроек);
	
	// Заполнение торговых объектов
	Если ЗначенияНастроек.ЕстьУзлы Тогда
		Для Каждого СтрокаУзла Из ЗначенияНастроек.Узлы Цикл
			Если ТипЗнч(СтрокаУзла) = Тип("Структура") И СтрокаУзла.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;	
			НоваяСтрока = ТаблицаУзлов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУзла);
		КонецЦикла;
	КонецЕсли;
	ЕстьУзлы = ТаблицаУзлов.Количество() > 0;
	
	НомерСтроки = 0;
	Для Каждого СтрокаНастройки Из ЗначенияНастроек.ОбщаяСтруктураБизнесПроцессов Цикл
		Если СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаБизнесПроцессов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНастройки);
		НомерСтроки = НомерСтроки + 1;
		НоваяСтрока.НомерСтроки = НомерСтроки;
		НоваяСтрока.Синоним = "" + НомерСтроки + ". " + НоваяСтрока.Название;
		
		Если СтрокаНастройки.Свойство("ЭтоТиповойБизнесПроцесс") И СтрокаНастройки.ЭтоТиповойБизнесПроцесс = Истина Тогда
			Если СтрокаНастройки.Свойство("ПользовательскаяНастройка") И СтрокаНастройки.ПользовательскаяНастройка = Истина Тогда
				НоваяСтрока.Картинка = БиблиотекаКартинок.ТабличныйДокументТолькоПросмотр;		
			Иначе
				НоваяСтрока.Картинка = БиблиотекаКартинок.ТабличныйДокументОтображатьЗаголовки;
			КонецЕсли;
		Иначе
			Если СтрокаНастройки.Свойство("ПользовательскаяНастройка") И СтрокаНастройки.ПользовательскаяНастройка = Истина Тогда
				НоваяСтрока.Картинка = БиблиотекаКартинок.Изменить;		
			Иначе
				НоваяСтрока.Картинка = БиблиотекаКартинок.Пользователь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьТаблицуНастроекНаСервере(ДанныеНастроек, МетаданныеНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНастроекНаСервере(ДанныеНастроек, МетаданныеНастроек)
	
	МетаданныеСписокНастроек = МетаданныеНастроек.СписокНастроек;
	МетаданныеДеревоНастроек = МетаданныеНастроек.ДеревоНастроек;	
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЛокДеревоНастроек = ДеревоНастроек.Скопировать();
	#Иначе
		ЛокДеревоНастроек = РеквизитФормыВЗначение("ДеревоНастроек");
	#КонецЕсли
	//ЛокДеревоНастроек.Колонки.Добавить("Картинка", Новый ОписаниеТипов("Картинка"))
	ЛокДеревоНастроек.Строки.Очистить();
	
	ДополнительныеПараметры = Новый Структура("ДанныеНастроек, МетаданныеСписокНастроек", ДанныеНастроек, МетаданныеСписокНастроек);
	Для каждого МетаданныеНастройки Из МетаданныеДеревоНастроек Цикл
		ДобавитьСтрокиНастроекРекурсивно(ЛокДеревоНастроек.Строки, МетаданныеНастройки.Значение, МетаданныеСписокНастроек, ДополнительныеПараметры);
	КонецЦикла;
	
	УстановитьКартинкиРекурсивно(ЛокДеревоНастроек.Строки);
	ЗадатьПризнакРодителяРекурсивно(ЛокДеревоНастроек.Строки);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ДеревоНастроек = ЛокДеревоНастроек;
	#Иначе
		ЗначениеВРеквизитФормы(ЛокДеревоНастроек, "ДеревоНастроек");
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьСтрокиНастроекРекурсивно(СтрокиДерева, МетаданныеНастройки, МетаданныеНастроек, ДополнительныеПараметры = Неопределено)
	
	СтрокаДерева = СтрокиДерева.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, МетаданныеНастройки);
	ДобавитьДетальныеЗаписиНастроек(СтрокаДерева.Строки, МетаданныеНастройки, ДополнительныеПараметры);
	
	Если МетаданныеНастройки.ЭтоРодитель Тогда
		
		Для каждого ТекМетаданные Из МетаданныеНастроек Цикл
			ТекМетаданные = ТекМетаданные.Значение;
			Если ТекМетаданные.Родитель <> Неопределено
				И ТекМетаданные.Родитель.Имя = МетаданныеНастройки.Имя Тогда
				ДобавитьСтрокиНастроекРекурсивно(СтрокаДерева.Строки, ТекМетаданные, МетаданныеНастроек, ДополнительныеПараметры);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьДетальныеЗаписиНастроек(СтрокиДерева, МетаданныеНастройки, ДополнительныеПараметры = Неопределено)
	
	ЗначенияНастроек = ДополнительныеПараметры.ДанныеНастроек.Значения;
	МетаданныеСписокНастроек = ДополнительныеПараметры.МетаданныеСписокНастроек;
	
	ИмяНастройки 					= МетаданныеНастройки.Имя;
	ИмяНастройкиБезДЗ 				= СтрЗаменить(ИмяНастройки, "_ДЗ", "");
	ИмяНастройкиСДЗ 				= ИмяНастройкиБезДЗ + "_ДЗ";
	ИмяНастройкиБезРасширения 	= СтрЗаменить(ИмяНастройки, "_Узлы_ДЗ", "");
	ID_Узла 							= СтрокиДерева.Родитель.ID_Узла;
	
	ЗначениеНастройки = Ложь;
	Если ЗначенияНастроек.Свойство(ИмяНастройкиБезДЗ) Тогда
		ЗначениеНастройки = ЗначенияНастроек[ИмяНастройкиБезДЗ];
		Если МетаданныеНастройки.ЭтоДетальныеЗаписиУзлов
			И ТипЗнч(ЗначениеНастройки) = Тип("Структура")
			И ЗначениеНастройки.Свойство(ID_Узла) Тогда
			ЗначениеНастройки = ЗначениеНастройки[ID_Узла];
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяНастройки = "Узлы" Тогда
		
		Для каждого СтрокаУзла Из ТаблицаУзлов Цикл
			ДетальнаяЗапись = СтрокиДерева.Добавить();
			ДетальнаяЗапись.Имя						= ИмяНастройкиСДЗ;
			ДетальнаяЗапись.Синоним				= СтрокаУзла.Наименование;
			ДетальнаяЗапись.Ид						= СтрокаУзла.ID_Узла;
			ДетальнаяЗапись.ID_Узла					= СтрокаУзла.ID_Узла;
			ДетальнаяЗапись.ТипСтроки				= "ДетальнаяЗапись";
			ДетальнаяЗапись.Использовать			= Ложь;
			ДетальнаяЗапись.Доступность			= Истина;
		КонецЦикла;
		
	ИначеЕсли ИмяНастройки = "ОбщаяСтруктураБизнесПроцессов" Тогда
		
		Для каждого СтрокаНастройки Из ТаблицаБизнесПроцессов Цикл
			ДетальнаяЗапись = СтрокиДерева.Добавить();
			ЗаполнитьЗначенияСвойств(ДетальнаяЗапись, СтрокаНастройки);
			ДетальнаяЗапись.Имя						= ИмяНастройкиСДЗ;
			ДетальнаяЗапись.Синоним				= СтрокаНастройки.Синоним;
			ДетальнаяЗапись.Ид						= СтрокаНастройки.ID_БизнесПроцесса;
			ДетальнаяЗапись.ID_Узла					= "";
			ДетальнаяЗапись.ТипСтроки				= "ДетальнаяЗапись";
			ДетальнаяЗапись.Использовать			= Ложь;
			ДетальнаяЗапись.Доступность			= Истина;
		КонецЦикла;
		
	ИначеЕсли ИмяНастройкиБезРасширения = "НастройкиБизнесПроцессов_ПользовательскиеНастройки" Тогда
		
		Для каждого СтрокаНастройки Из ТаблицаБизнесПроцессов Цикл
			ДетальнаяЗапись = СтрокиДерева.Добавить();
			ЗаполнитьЗначенияСвойств(ДетальнаяЗапись, СтрокаНастройки);
			ДетальнаяЗапись.Имя						= ИмяНастройкиСДЗ;
			ДетальнаяЗапись.Синоним				= СтрокаНастройки.Синоним;
			ДетальнаяЗапись.Ид						= СтрокаНастройки.ID_БизнесПроцесса;
			ДетальнаяЗапись.ID_Узла					= ID_Узла;
			ДетальнаяЗапись.ТипСтроки				= "ДетальнаяЗапись";
			ДетальнаяЗапись.Использовать			= Ложь;
			ДетальнаяЗапись.Доступность			= Истина;
		КонецЦикла;
		
	ИначеЕсли ИмяНастройкиБезРасширения = "НастройкиОбменаСправочников" ИЛИ ИмяНастройкиБезРасширения = "НастройкиОбменаСправочников_Узлы" И МетаданныеНастройки.ТипСтроки <> "Группа"  Тогда
		
		ЗначениеНастройки = ЗначенияНастроек[ИмяНастройкиБезДЗ];
		Если ИмяНастройкиСДЗ = "НастройкиОбменаСправочников_Узлы_ДЗ" Тогда
			ЗначениеНастройки = ЗначениеНастройки[ID_Узла];
		КонецЕсли;
		
		Если ЗначениеНастройки <> Ложь И ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			Для каждого СтрокаНастройки Из ЗначениеНастройки Цикл
				Если ТипЗнч(СтрокаНастройки) = Тип("Структура") И СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
					Продолжить;
				КонецЕсли;
				
				ДетальнаяЗапись = СтрокиДерева.Добавить();
				ЗаполнитьЗначенияСвойств(ДетальнаяЗапись, СтрокаНастройки);
				ДетальнаяЗапись.Имя						= ИмяНастройкиСДЗ;
				ДетальнаяЗапись.Синоним				= СтрокаНастройки.ИмяТаблицыПредставление;
				ДетальнаяЗапись.Ид						= "";
				ДетальнаяЗапись.ID_Узла					= ID_Узла;
				ДетальнаяЗапись.ТипСтроки				= "ДетальнаяЗапись";
				ДетальнаяЗапись.Использовать			= Ложь;
				ДетальнаяЗапись.Доступность			= Истина;
				ДетальнаяЗапись.Картинка 				= ?(СтрокаНастройки.Типовой, БиблиотекаКартинок.ТабличныйДокументОтображатьЗаголовки, БиблиотекаКартинок.Пользователь);
				
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ИмяНастройки = "ПроизвольныеКоды" Тогда
		
		Если ЗначенияНастроек.ПроизвольныеКоды_ПоУмолчанию <> Ложь И ЗначениеЗаполнено(ЗначенияНастроек.ПроизвольныеКоды_ПоУмолчанию) Тогда
			Для каждого СтрокаНастройки Из ЗначенияНастроек.ПроизвольныеКоды_ПоУмолчанию Цикл
				Если ТипЗнч(СтрокаНастройки) = Тип("Структура") И СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
					Продолжить;
				КонецЕсли;
				ДетальнаяЗапись = СтрокиДерева.Добавить();
				ЗаполнитьЗначенияСвойств(ДетальнаяЗапись, СтрокаНастройки);
				ДетальнаяЗапись.Имя						= ИмяНастройкиСДЗ;
				ДетальнаяЗапись.Синоним				= СтрокаНастройки.Наименование;
				ДетальнаяЗапись.Ид						= СтрокаНастройки.ID_ПроизвольногоКода;
				ДетальнаяЗапись.ID_Узла					= "";
				ДетальнаяЗапись.ТипСтроки				= "ДетальнаяЗапись";
				ДетальнаяЗапись.Использовать			= Ложь;
				ДетальнаяЗапись.Доступность			= Истина;
				ДетальнаяЗапись.Картинка 				= БиблиотекаКартинок.ТабличныйДокументОтображатьЗаголовки;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначенияНастроек.ПроизвольныеКоды_Пользовательские <> Ложь И ЗначениеЗаполнено(ЗначенияНастроек.ПроизвольныеКоды_Пользовательские) Тогда
			Для каждого СтрокаНастройки Из ЗначенияНастроек.ПроизвольныеКоды_Пользовательские Цикл
				Если ТипЗнч(СтрокаНастройки) = Тип("Структура") И СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
					Продолжить;
				КонецЕсли;
				ДетальнаяЗапись = СтрокиДерева.Добавить();
				ЗаполнитьЗначенияСвойств(ДетальнаяЗапись, СтрокаНастройки);
				ДетальнаяЗапись.Имя						= ИмяНастройкиСДЗ;
				ДетальнаяЗапись.Синоним				= СтрокаНастройки.Наименование;
				ДетальнаяЗапись.Ид						= СтрокаНастройки.ID_ПроизвольногоКода;
				ДетальнаяЗапись.ID_Узла					= "";
				ДетальнаяЗапись.ТипСтроки				= "ДетальнаяЗапись";
				ДетальнаяЗапись.Использовать			= Ложь;
				ДетальнаяЗапись.Доступность			= Истина;
				ДетальнаяЗапись.Картинка 				= БиблиотекаКартинок.Пользователь;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ИмяНастройки = "ПроизвольныеОтборыДокументов" Тогда
		Если ЗначениеНастройки <> Ложь И ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			Для каждого СтрокаНастройки Из ЗначениеНастройки Цикл
				Если ТипЗнч(СтрокаНастройки) = Тип("Структура") И СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
					Продолжить;
				КонецЕсли;
				ДетальнаяЗапись = СтрокиДерева.Добавить();
				ЗаполнитьЗначенияСвойств(ДетальнаяЗапись, СтрокаНастройки);
				ДетальнаяЗапись.Имя						= ИмяНастройкиСДЗ;
				ДетальнаяЗапись.Синоним				= СтрокаНастройки.Наименование;
				ДетальнаяЗапись.Ид						= СтрокаНастройки.ID_ПроизвольногоОтбора;
				ДетальнаяЗапись.ID_Узла					= "";
				ДетальнаяЗапись.ТипСтроки				= "ДетальнаяЗапись";
				ДетальнаяЗапись.Использовать			= Ложь;
				ДетальнаяЗапись.Доступность			= Истина;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ИмяНастройкиБезРасширения = "ГлобальныеПараметры"
				ИЛИ ИмяНастройкиБезРасширения = "ГлобальныеПараметры_Значения" Тогда
		
		Если ЗначениеНастройки <> Ложь И ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			Для каждого СтрокаНастройки Из ЗначениеНастройки Цикл
				Если ТипЗнч(СтрокаНастройки) = Тип("Структура") И СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
					Продолжить;
				КонецЕсли;
				ДетальнаяЗапись = СтрокиДерева.Добавить();
				ЗаполнитьЗначенияСвойств(ДетальнаяЗапись, СтрокаНастройки);
				ДетальнаяЗапись.Имя						= ИмяНастройкиСДЗ;
				ДетальнаяЗапись.Синоним				= СтрокаНастройки.Наименование;
				ДетальнаяЗапись.Ид						= СтрокаНастройки.ID_Параметра;
				ДетальнаяЗапись.ID_Узла					= ID_Узла;
				ДетальнаяЗапись.ТипСтроки				= "ДетальнаяЗапись";
				ДетальнаяЗапись.Использовать			= Ложь;
				ДетальнаяЗапись.Доступность			= Истина;
				ДетальнаяЗапись.Картинка 				= ?(НЕ СтрокаНастройки.Свойство("Типовой") ИЛИ СтрокаНастройки.Типовой, БиблиотекаКартинок.ТабличныйДокументОтображатьЗаголовки, БиблиотекаКартинок.Пользователь);
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ЛокЯдро_СтрНайтиНаСервере(ИмяНастройки, "НастройкиОтборовУзлов") И МетаданныеНастройки.ТипСтроки <> "Группа" Тогда
		
		Если ЗначениеНастройки <> Ложь И ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			Для каждого СтрокаНастройки Из ЗначениеНастройки Цикл
				Если ТипЗнч(СтрокаНастройки) = Тип("Структура") И СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
					Продолжить;
				КонецЕсли;
				
				ПоискБП = ТаблицаБизнесПроцессов.НайтиСтроки(Новый Структура("ID_БизнесПроцесса", СтрокаНастройки.ID_БизнесПроцесса));
				Если НЕ ПоискБП.Количество() Тогда
					Продолжить;
				КонецЕсли;
				ПоискБП = ПоискБП[0];
				
				ДетальнаяЗапись = СтрокиДерева.Добавить();
				ЗаполнитьЗначенияСвойств(ДетальнаяЗапись, СтрокаНастройки);
				ДетальнаяЗапись.Имя						= ИмяНастройкиСДЗ;
				ДетальнаяЗапись.Синоним				= ПоискБП.Синоним;
				ДетальнаяЗапись.Ид						= СтрокаНастройки.ID_БизнесПроцесса;
				ДетальнаяЗапись.ID_Узла					= ID_Узла;
				ДетальнаяЗапись.ТипСтроки				= "ДетальнаяЗапись";
				ДетальнаяЗапись.Использовать			= Ложь;
				ДетальнаяЗапись.Доступность			= Истина;
				ДетальнаяЗапись.Картинка 				= ПоискБП.Картинка;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли МетаданныеНастройки.ТребуютсяТО Тогда
		ДобавитьДетальныеЗаписиТорговыхОбъектов(СтрокиДерева, МетаданныеНастройки, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьДетальныеЗаписиТорговыхОбъектов(СтрокиДерева, МетаданныеНастройки, ДополнительныеПараметры = Неопределено)
	
	Если НЕ ТаблицаУзлов.Количество() Тогда
		СтрокиДерева.Родитель.Доступность = Ложь;
	КонецЕсли;
	
	ИмяСтроки = МетаданныеНастройки.Имя;
	ИмяСтрокиБезРасширения = СтрЗаменить(ИмяСтроки, "_Общий", "");
	ТипСтроки = "Файл";
	//ТипСтроки = ?(ИмяСтроки = "НастройкиОбменаСправочников_Общий_Узлы", "Группа", "Файл");
	
	Для каждого СтрокаУзла Из ТаблицаУзлов Цикл
		ДетальнаяЗапись = СтрокиДерева.Добавить();
		ДетальнаяЗапись.Имя						= ИмяСтроки;
		ДетальнаяЗапись.Синоним				= СтрокаУзла.Наименование;
		ДетальнаяЗапись.Ид						= СтрокаУзла.ID_Узла;
		ДетальнаяЗапись.ID_Узла					= СтрокаУзла.ID_Узла;
		ДетальнаяЗапись.ТипСтроки				= ТипСтроки;
		ДетальнаяЗапись.Использовать			= Ложь;
		ДетальнаяЗапись.Доступность			= Истина;
		
		МетаданныеНастройки_ДЗ = ПолучитьСтруктуруМетаданныхНастроекНаСервере();
		МетаданныеНастройки_ДЗ.Имя				= ИмяСтрокиБезРасширения + "_ДЗ";
		МетаданныеНастройки_ДЗ.Синоним			= "";
		МетаданныеНастройки_ДЗ.ТипСтроки		= "ДетальнаяЗапись";
		МетаданныеНастройки_ДЗ.ТребуютсяТО		= Ложь;
		МетаданныеНастройки_ДЗ.ЭтоРодитель		= Ложь;
		МетаданныеНастройки_ДЗ.ЭтоДетальныеЗаписиУзлов		= Истина;
		
		ДобавитьДетальныеЗаписиНастроек(ДетальнаяЗапись.Строки, МетаданныеНастройки_ДЗ, ДополнительныеПараметры);
		
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти

#КонецОбласти

#Область ГлобальныйКонтекст

&НаКлиенте
Функция ПолучитьФормуОсновнойОбработки(ИмяФормы)
	
	//Если ЗапускИзОсновнойОбработки = Истина Тогда
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаРезультат = _ЛокКонтекст.ВладелецФормы.ПолучитьФорму("ОФ_" + ИмяФормы,, ЭтаФорма);
		#Иначе
			ФормаРезультат = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма." + ИмяФормы,, ЭтаФорма);	
		#КонецЕсли
	//Иначе
	//	#Если ТолстыйКлиентОбычноеПриложение Тогда
	//		ФормаРезультат = _ЛокКонтекст.ВладелецФормы.ПолучитьФорму("ОФ_" + ИмяФормы);
	//	#Иначе
	//		ФормаРезультат = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма." + ИмяФормы);	
	//	#КонецЕсли
	//КонецЕсли;
	
	Возврат ФормаРезультат;
	
КонецФункции

&НаКлиенте
Функция СериализоватьНастройки(ЗНАЧ ЗначениеНастройки, Направление)
	
	Если Направление = "ИзСтроки" Тогда
		Результат = _ЛокКонтекст.ЛокЯдро_ЗначениеИзСтрокиXML(ЗначениеНастройки,Истина);
	ИначеЕсли Направление = "ВСтроку" Тогда	
		Результат = _ЛокКонтекст.ЛокЯдро_ЗначениеВСтрокуXML(ЗначениеНастройки);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Функция ЛокЯдро_ПолучитьЗначенияГлобальныхПараметров(ОбщиеПараметры, ЧастныеПараметры, ID_Узла = "")
	
	Если НЕ ЗначениеЗаполнено(ЧастныеПараметры) ИЛИ ЧастныеПараметры = Ложь  Тогда
		ЧастныеПараметры = Новый Массив;
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("ОбщиеПараметры", 	 		ОбщиеПараметры);
	ПараметрыМетода.Вставить("ЧастныеПараметры", 			ЧастныеПараметры);
	ПараметрыМетода.Вставить("ID_Узла", 		 				ID_Узла);
	ПараметрыМетода.Вставить("ПолучатьНеиспользуемые", 	Истина);
	
	СтруктураВызова = Новый Структура;
	СтруктураВызова.Вставить("ТипМетода", "Функция");
	СтруктураВызова.Вставить("ИмяМетода", "ПолучитьЗначенияГлобальныхПараметров");
	СтруктураВызова.Вставить("ПараметрыМетода", ПараметрыМетода);
	
	Попытка
		ТаблицаПараметров = _ЛокКонтекст.Транзит_ВызватьГлобальныйМетодНаКлиенте(СтруктураВызова,, АдресаПеременных);
	Исключение
		Если НЕ ЗапускИзОсновнойОбработки Тогда
			СтруктураВызова.ПараметрыМетода.Удалить("ПолучатьНеиспользуемые");
			ТаблицаПараметров = _ЛокКонтекст.Транзит_ВызватьГлобальныйМетодНаКлиенте(СтруктураВызова,, АдресаПеременных);
		КонецЕсли;
	КонецПопытки;
	
	Возврат ТаблицаПараметров;
	
КонецФункции 

// Получаем общую структуру настроек бизнес-процессов по узлу
// Скопировано из ЛокальныйКонтекст с изменениями
&НаКлиенте
Функция ЛокЯдро_ПолучитьОбщуюСтруктуруБизнесПроцессов(НБП_ПоУмолчанию, НБП_Пользовательские, НБП_ПользовательскиеНастройки) Экспорт
	
	НастройкиБизнесПроцессов_ПоУмолчанию = НБП_ПоУмолчанию;
	НастройкиБизнесПроцессов_Пользовательские = НБП_Пользовательские;
	НастройкиБизнесПроцессов_ПользовательскиеНастройки = НБП_ПользовательскиеНастройки;
	НастройкиБизнесПроцессов_ПользовательскиеНастройки_ГлавныйУзел = НБП_ПользовательскиеНастройки;
	//НастройкиБизнесПроцессов_ПользовательскиеНастройки_ГлавныйУзел = ?(НБП_ПользовательскиеНастройки_ГлавныйУзел = Неопределено, НБП_ПользовательскиеНастройки, НБП_ПользовательскиеНастройки_ГлавныйУзел);
	
	НастройкиБизнесПроцессов = Новый Массив();
	ИдТиповыхБП = Новый Массив();
	
	Если ЗначениеЗаполнено(НастройкиБизнесПроцессов_ПоУмолчанию) И НЕ НастройкиБизнесПроцессов_ПоУмолчанию = Ложь Тогда
		Если ТипЗнч(НастройкиБизнесПроцессов_ПоУмолчанию) = Тип("Строка") Тогда
			НастройкиБизнесПроцессов_ПоУмолчанию = _ЛокКонтекст.ЛокЯдро_ЗначениеИзСтрокиXML(НастройкиБизнесПроцессов_ПоУмолчанию, Истина);		
		КонецЕсли;
		Для Каждого СтрокаБП Из НастройкиБизнесПроцессов_ПоУмолчанию Цикл			
			Если НЕ СтрокаБП.Свойство("ЭтоТаблицаЗначений") Тогда
				СтрокаБП.Вставить("ЭтоТиповойБизнесПроцесс",Истина);
				НастройкиБизнесПроцессов.Добавить(_ЛокКонтекст.ЛокЯдро_СкопироватьСтруктуру(СтрокаБП));
				ИдТиповыхБП.Добавить(СтрокаБП.ID_БизнесПроцесса);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиБизнесПроцессов_Пользовательские) И НЕ НастройкиБизнесПроцессов_Пользовательские = Ложь Тогда
		Если ТипЗнч(НастройкиБизнесПроцессов_Пользовательские) = Тип("Строка") Тогда
			НастройкиБизнесПроцессов_Пользовательские = _ЛокКонтекст.ЛокЯдро_ЗначениеИзСтрокиXML(НастройкиБизнесПроцессов_Пользовательские, Истина);		
		КонецЕсли;
		Для Каждого СтрокаБП Из НастройкиБизнесПроцессов_Пользовательские Цикл
			Если НЕ СтрокаБП.Свойство("ЭтоТаблицаЗначений") Тогда			
				СтрокаБП.Вставить("ЭтоТиповойБизнесПроцесс",Ложь);
				Если ИдТиповыхБП.Найти(СтрокаБП.ID_БизнесПроцесса) = Неопределено Тогда
					НастройкиБизнесПроцессов.Добавить(_ЛокКонтекст.ЛокЯдро_СкопироватьСтруктуру(СтрокаБП));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЭтоГлавныйУзел = Истина;
	
	Если КатегорииНастроекMS = Неопределено Тогда
		КатегорииНастроекMS = _ЛокКонтекст.ЛокЯдро_ПолучитьКатегорииНастроекMS();
	КонецЕсли;
	
	ПользовательскиеНастройкиГлавногоУзла = КатегорииНастроекMS.ПользовательскиеНастройкиГлавногоУзла;
	
	Если ЗначениеЗаполнено(НастройкиБизнесПроцессов_ПользовательскиеНастройки) И НЕ (НастройкиБизнесПроцессов_ПользовательскиеНастройки) = Ложь Тогда
		Если ТипЗнч(НастройкиБизнесПроцессов_ПользовательскиеНастройки) = Тип("Строка") Тогда
			НастройкиБизнесПроцессов_ПользовательскиеНастройки = _ЛокКонтекст.ЛокЯдро_ЗначениеИзСтрокиXML(НастройкиБизнесПроцессов_ПользовательскиеНастройки, Истина);		
		КонецЕсли;
		Для Каждого СтрокаБП Из НастройкиБизнесПроцессов_ПользовательскиеНастройки Цикл
			Если СтрокаБП.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			Если ЭтоГлавныйУзел И ИдТиповыхБП.Найти(СтрокаБП.ID_БизнесПроцесса) = Неопределено Тогда
			    Продолжить;
			КонецЕсли;
			Индекс = _ЛокКонтекст.ЛокЯдро_НайтиСтруктуруВМассивеПоЭлементу(НастройкиБизнесПроцессов, "ID_БизнесПроцесса", СтрокаБП.ID_БизнесПроцесса, Истина);
			Если Индекс <> Неопределено Тогда
				НастройкиБизнесПроцессов[Индекс].Вставить("ПользовательскаяНастройка", Истина);
				Для Каждого КлючИЗначение Из СтрокаБП Цикл
					Если НЕ ЭтоГлавныйУзел И ПользовательскиеНастройкиГлавногоУзла.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					НастройкиБизнесПроцессов[Индекс].Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиБизнесПроцессов_ПользовательскиеНастройки_ГлавныйУзел) И НЕ НастройкиБизнесПроцессов_ПользовательскиеНастройки_ГлавныйУзел = Ложь Тогда
		Если ТипЗнч(НастройкиБизнесПроцессов_ПользовательскиеНастройки_ГлавныйУзел) = Тип("Строка") Тогда
			НастройкиБизнесПроцессов_ПользовательскиеНастройки_ГлавныйУзел = _ЛокКонтекст.ЛокЯдро_ЗначениеИзСтрокиXML(НастройкиБизнесПроцессов_ПользовательскиеНастройки_ГлавныйУзел, Истина);
		КонецЕсли;
		Для Каждого СтрокаБП Из НастройкиБизнесПроцессов_ПользовательскиеНастройки_ГлавныйУзел Цикл
			Если СтрокаБП.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			Индекс = _ЛокКонтекст.ЛокЯдро_НайтиСтруктуруВМассивеПоЭлементу(НастройкиБизнесПроцессов, "ID_БизнесПроцесса", СтрокаБП.ID_БизнесПроцесса, Истина);
			Если Индекс <> Неопределено Тогда
				НастройкиБизнесПроцессов[Индекс].Вставить("ПользовательскаяНастройка", Истина);
				Для Каждого КлючИЗначение Из СтрокаБП Цикл
					Если ПользовательскиеНастройкиГлавногоУзла.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					НастройкиБизнесПроцессов[Индекс].Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат НастройкиБизнесПроцессов;
	
КонецФункции

&НаКлиенте
Процедура ЛокЯдро_ВыгрузитьБизнесПроцессыВТаблицу()
	
	НастройкиБизнесПроцессов = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("НастройкиБизнесПроцессов");
	Если ЗапускИзОсновнойОбработки Тогда
		_ЛокКонтекст.ЛокЯдро_ВыгрузитьБизнесПроцессыСобытиеФормы(НастройкиБизнесПроцессов);
		Возврат;
	КонецЕсли;
	
	ID_Узла = "";
	ВерсияВыгрузки_6_0 = Истина;
	
	//ВерсияКонфигурацииSMARTS = _ЛокКонтекст.ЛокЯдро_ПолучитьВерсиюКонфигурацииSMARTS();
	//Если ВерсияКонфигурацииSMARTS >= 60000 Тогда
	//	ВерсияВыгрузки_6_0 = Истина;
	//КонецЕсли;
	
	// Получение настроек бизнес-процессов для всех узлов, кроме текущего	
	МассивНастроекБизнесПроцессовПоУзлам = Новый Массив;
	ВсеУзлы = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("Узлы");
	Если ЗначениеЗаполнено(ID_Узла) И ТипЗнч(ВсеУзлы) <> Тип("Массив") Тогда
		ВсеУзлы = Новый Массив;
	КонецЕсли;
	МассивУзловЧастныхБаз = Новый Массив;
	
	// Содержатся все узлы, кроме пустого, у которого ID_узла = ""
	Если НЕ ВсеУзлы = Ложь И ТипЗнч(ВсеУзлы) = Тип("Массив") Тогда
		//Скопируем массив всех узлов, чтобы при редактировании массива ВсеУзлы не изменять значение в кэше
		ВсеУзлы = _ЛокКонтекст.ЛокЯдро_СкопироватьМассив(ВсеУзлы);
		// Добавим пустой идентификатор узла, т.к. его нет в массиве "ВсеУзлы"
		СтруктураПустогоУзла = Новый Структура;
		СтруктураПустогоУзла.Вставить("ID_Узла", "");
		ВсеУзлы.Добавить(СтруктураПустогоУзла);
		
		НастройкиБизнесПроцессовПоУзлам = Новый Структура;
		
		Для Каждого СтрокаУзла Из ВсеУзлы Цикл
			Если ТипЗнч(СтрокаУзла) = Тип("Структура") Тогда 
				Если СтрокаУзла.Свойство("ЭтоТаблицаЗначений") Тогда
					Продолжить;
				КонецЕсли;
				//Получение настроек бизнес-процессов для всех узлов, кроме текущего, т.к. настройки текущего узла содержатся в реквизите ОтображаемыеНастройкиБизнесПроцессов
				Если СтрокаУзла.Свойство("ID_Узла")
					И СтрокаУзла.ID_Узла <> ID_Узла Тогда
					
					НастройкиБизнесПроцессовПоУзлам.Вставить(?(ЗначениеЗаполнено(СтрокаУзла.ID_Узла), СтрокаУзла.ID_Узла, "ГлавныйУзел"), Неопределено);
					
				КонецЕсли;
				Если СтрокаУзла.Свойство("ИспользоватьЧастнуюБазу")
					И СтрокаУзла.ИспользоватьЧастнуюБазу Тогда
					МассивУзловЧастныхБаз.Добавить(СтрокаУзла.ID_Узла);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		_ЛокКонтекст.ЛокЯдро_ПолучитьЗначенияКэшируемойНастройкиПоУзлам("НастройкиБизнесПроцессов", НастройкиБизнесПроцессовПоУзлам, "ID_БизнесПроцесса,Используется");
		
		Для каждого СтрокаНастройки ИЗ НастройкиБизнесПроцессовПоУзлам Цикл
			ОбрабатываемыйУзел = ?(СтрокаНастройки.Ключ = "ГлавныйУзел", "", СтрокаНастройки.Ключ);
			
			НастройкиБизнесПроцессовПоУзлу = СтрокаНастройки.Значение;
			Если НЕ ЗначениеЗаполнено(НастройкиБизнесПроцессовПоУзлу) Тогда
				НастройкиБизнесПроцессовПоУзлу = _ЛокКонтекст.ЛокЯдро_ПолучитьОбщуюСтруктуруБизнесПроцессов(ОбрабатываемыйУзел);
			КонецЕсли;
			
			МассивНастроекБизнесПроцессовПоУзлам.Добавить(Новый Структура("ID_Узла, НастройкиБизнесПроцессов", ОбрабатываемыйУзел, НастройкиБизнесПроцессовПоУзлу));
		КонецЦикла;
		
	КонецЕсли;
	
	//
	ТаблицыMS = _ЛокКонтекст.СтруктураМетаданных.Tables;
	Если _ЛокКонтекст.ЛокЯдро_НайтиВСпискеПоПредставлению(ТаблицыMS, "БизнесПроцессы") <> Неопределено Тогда
		ИмяТаблицыБП = "БизнесПроцессы";
	Иначе
		ИмяТаблицыБП = "BusinessProcesses";		
	КонецЕсли;
	
	// Выгружаются все строки бизнес-процессов, которые активны хотя бы для одного узла, в таблицу БизнесПроцессы базы смартс.
	ТаблицаДляВыгрузки = Новый Массив;
	Для Каждого СтрокаНастройки ИЗ НастройкиБизнесПроцессов Цикл
		Если СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
			Продолжить;
		КонецЕсли;
		
		МассивУзлов = Новый Массив;
		
		Для Каждого СтруктураНастроекБизнесПроцессовПоУзлу Из МассивНастроекБизнесПроцессовПоУзлам Цикл
			НастройкиБизнесПроцессовПоУзлу = СтруктураНастроекБизнесПроцессовПоУзлу.НастройкиБизнесПроцессов;
			
			Если ТипЗнч(НастройкиБизнесПроцессовПоУзлу) = Тип("Массив") Тогда
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ID_БизнесПроцесса", СтрокаНастройки.ID_БизнесПроцесса);
				
				НастройкиПоБизнесПроцессуПоУзлу = _ЛокКонтекст.ЛокЯдро_НайтиВМассивеСтруктурПоОтбору(НастройкиБизнесПроцессовПоУзлу, СтруктураОтбора);
				Если НастройкиПоБизнесПроцессуПоУзлу <> Неопределено Тогда
					НастройкаПоБизнесПроцессуПоУзлу = НастройкиПоБизнесПроцессуПоУзлу[0];
					Если НастройкаПоБизнесПроцессуПоУзлу.Свойство("Используется") 
						И НастройкаПоБизнесПроцессуПоУзлу.Используется Тогда
						МассивУзлов.Добавить(СтруктураНастроекБизнесПроцессовПоУзлу.ID_Узла);
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		БПВключен = СтрокаНастройки.Используется;
		БПВключенДляТекУзла = МассивУзлов.Найти(ID_Узла) <> Неопределено;
		
		Если БПВключен <> БПВключенДляТекУзла Тогда
			Если БПВключенДляТекУзла Тогда
				МассивУзлов.Удалить(МассивУзлов.Найти(ID_Узла));
			Иначе
				МассивУзлов.Добавить(ID_Узла);
			КонецЕсли;
		КонецЕсли;
				
		Если МассивУзлов.Количество() = 0 Тогда
			// Бизнес-процесс отключен на всех узлах. Не выгружаем БП
			Продолжить;
		КонецЕсли;
		
		Если НЕ ВерсияВыгрузки_6_0 Тогда
			// Удаляем идентификатор пустого узла
			ИндексУзла = МассивУзлов.Найти("");
			Если ИндексУзла <> Неопределено Тогда
				МассивУзлов.Удалить(ИндексУзла);
			КонецЕсли;
				
			СтрокаУзел = _ЛокКонтекст.ЛокЯдро_СтрСоединить(МассивУзлов, ",");
			
			МассивУзлов = Новый Массив;
			МассивУзлов.Добавить(СтрокаУзел);
		КонецЕсли;
		
		Для каждого СтрокаУзел ИЗ МассивУзлов Цикл
		
			Настройка = Новый Структура();
			Если ИмяТаблицыБП = "БизнесПроцессы" Тогда
				Настройка.Вставить("Ид",							СтрокаНастройки.ID_БизнесПроцесса);
				Настройка.Вставить("Наименование",					СтрокаНастройки.Название);
				Настройка.Вставить("ТипДокументаMobileSMARTS",		СтрокаНастройки.ТипДокументаMS);
				Настройка.Вставить("ТипИсходногоДокумента",			СтрокаНастройки.ТипИсходногоДокумента1С);
				Настройка.Вставить("ТипРезультирующегоДокумента",	СтрокаНастройки.ТипРезультирующегоДокумента1С);
				Настройка.Вставить("Узел",							СтрокаУзел);
			Иначе
				Настройка.Вставить("Id",							СтрокаНастройки.ID_БизнесПроцесса);
				Настройка.Вставить("Name",							СтрокаНастройки.Название);
				Настройка.Вставить("MSDocumentType",				СтрокаНастройки.ТипДокументаMS);
				Настройка.Вставить("SourceDocumentType",			СтрокаНастройки.ТипИсходногоДокумента1С);
				Настройка.Вставить("ResultDocumentType",			СтрокаНастройки.ТипРезультирующегоДокумента1С);
				Настройка.Вставить("Description",					СтрокаНастройки.Комментарий);
				Настройка.Вставить("Nodes",							СтрокаУзел);
			КонецЕсли;
		    ТаблицаДляВыгрузки.Добавить(Настройка);
			
		КонецЦикла; // Для каждого СтрокаУзел ИЗ МассивУзлов
	КонецЦикла;
	
	_ЛокКонтекст.ЛокЯдро_ВыгрузитьПодготовленнуюТаблицуНаСерверSMARTS(ИмяТаблицыБП, ТаблицаДляВыгрузки);
	
	Если ID_Узла = "" 
		И МассивУзловЧастныхБаз.Количество() > 0 Тогда // Будем выгружать таблицу БП в частные базы только если не выбран никакой ТО, чтоб лишний раз не гонять данные
		Для Каждого ИдУзла Из МассивУзловЧастныхБаз Цикл
			_ЛокКонтекст.ЛокЯдро_УстановитьДанныеТекущегоУзла(ИдУзла); 
			_ЛокКонтекст.ЛокЯдро_ВыгрузитьПодготовленнуюТаблицуНаСерверSMARTS(ИмяТаблицыБП, ТаблицаДляВыгрузки, "Частная");	
		КонецЦикла;
		_ЛокКонтекст.ЛокЯдро_УстановитьДанныеТекущегоУзла("");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛокЯдро_ОбновитьНастройкиMobileSMARTS()
	
	ПараметрыПодключенияMS = _ЛокКонтекст.ПараметрыПодключенияMS;
	Если ПараметрыПодключенияMS = Неопределено Тогда
		ПараметрыПодключенияMS = _ЛокКонтекст.ЛокЯдро_ПолучитьДанныеИзХранилища1С("Cleverence_ПараметрыПодключенияMS");
	КонецЕсли;
		
	ИдентификаторБазыMS = "";
	Если ТипЗнч(ПараметрыПодключенияMS) = Тип("Структура") Тогда
		ИдентификаторБазыMS = ?(ПараметрыПодключенияMS.Свойство("Ид"), ПараметрыПодключенияMS.Ид, "");
		ИдентификаторБазыMS = СтрЗаменить(ИдентификаторБазыMS, "-", "_");
	КонецЕсли;
	
	Если ПустаяСтрока(ИдентификаторБазыMS) Тогда
		Сообщение = НСтр("be = 'Не ўдалося вызначыць ідэнтыфікатар падключанай базы Cleverence!'; en = 'Failed to determine the identifier of the connected Cleverence database!'; es = 'No se pudo determinar el identificador de la base de datos conectada de Cleverence!'; ka = 'დაკვირვების იდენტიფიკატორი არ მოხდა კლევერენსის დაკვირვების ბაზაში!'; kk = 'Cleverence базасының айырмашылықты анықтау мүмкін емес!'; ro = 'Nu s-a putut determina identificatorul bazei de date Cleverence conectate!'; ru = 'Не удалось определить идентификатор подключенной базы Клеверенс!'; tr = 'Bağlı Cleverence veritabanı kimliği belirlenemedi!'; uk = 'Не вдалося визначити ідентифікатор підключеної бази Cleverence!'; uz = 'Уланган Cleverence базаси идентификаторини топиш мумкин эмас!'");
		Сообщить(Сообщение); 
		Возврат;		
	КонецЕсли;
	
	_ЛокКонтекст.ЛокЯдро_ОчиститьКэшируемыеНастройки(ИдентификаторБазыMS);
	
	_ЛокКонтекст.ЛокЯдро_Инициализация(ПараметрыПодключенияMS);
	
	_ЛокКонтекст.ЛокЯдро_ВыполнитьПроверкуБизнесПроцессовПоМетаданнымMS();

КонецПроцедуры

&НаСервере
Функция ЛокЯдро_СтрНайтиНаСервере(Строка, ПодстрокаПоиска, НаправлениеПоиска = Неопределено, НачальнаяПозиция = Неопределено, НомерВхождения = 1) Экспорт
	Результат = 0;
	
	// НаправлениеПоиска: СКонца,СНачала. По умолчанию: СНачала
	Если Строка = "" и ПодстрокаПоиска = "" Тогда
		// чтобы отрабатывало как в платформе
		Если НаправлениеПоиска = "СКонца" Тогда
			Если НомерВхождения = 1 Тогда
				Возврат 1;
			Иначе
				Возврат 0;
			КонецЕсли;
		Иначе
			Возврат мин(НомерВхождения, ?(НачальнаяПозиция=Неопределено, 1, НачальнаяПозиция));
		КонецЕсли;
	КонецЕсли;
	
	Если НачальнаяПозиция = Неопределено Тогда
		Если НаправлениеПоиска = "СКонца" Тогда
			лНачальнаяПозиция = СтрДлина(Строка);
		Иначе
			лНачальнаяПозиция = 1;
		КонецЕсли;
	Иначе
		лНачальнаяПозиция = НачальнаяПозиция;
	КонецЕсли;
	
	Если НаправлениеПоиска = "СКонца" Тогда
		лСтрока = "";
		Для сч = 1 По СтрДлина(Строка) Цикл
			лСтрока = Сред(Строка, сч, 1) + лСтрока;
		КонецЦикла;
		лПодстрокаПоиска = "";
		Для сч = 1 По СтрДлина(ПодстрокаПоиска) Цикл
			лПодстрокаПоиска = Сред(ПодстрокаПоиска, сч, 1) + лПодстрокаПоиска;
		КонецЦикла;
		лНачальнаяПозиция = макс(1, СтрДлина(Строка)-лНачальнаяПозиция-СтрДлина(ПодстрокаПоиска)+2);
	Иначе
		лСтрока = Строка;
		лПодстрокаПоиска = ПодстрокаПоиска;
		лНачальнаяПозиция = лНачальнаяПозиция;
	КонецЕсли;
	
	лНомерВхождения = 0;
	Результат = Найти(Сред(лСтрока, лНачальнаяПозиция), лПодстрокаПоиска);
	Пока Результат Цикл
		лНачальнаяПозиция = Результат + лНачальнаяПозиция + СтрДлина(ПодстрокаПоиска)-1;
		лНомерВхождения = лНомерВхождения + 1;
		Если лНомерВхождения = НомерВхождения Тогда
			Прервать;
		КонецЕсли;
		Результат = Найти(Сред(лСтрока, лНачальнаяПозиция), лПодстрокаПоиска);
	КонецЦикла;
	
	Если лНомерВхождения = НомерВхождения Тогда
		Результат = лНачальнаяПозиция - СтрДлина(ПодстрокаПоиска);
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Если НаправлениеПоиска = "СКонца" И Результат<>0 Тогда
		Результат = СтрДлина(Строка) - Результат - СтрДлина(ПодстрокаПоиска) + 2;
	КонецЕсли;
	
	Возврат Результат;        
			
КонецФункции


#КонецОбласти

#Область УниверсальныеМеханизмы

&НаКлиенте
Функция НайтиЗначениеНастройки(ЗначенияНастроек, ИмяНастройки, ID_Узла = "")
	
	Если НЕ ЗначенияНастроек.Свойство(ИмяНастройки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗначениеНастройки = ЗначенияНастроек[ИмяНастройки];
	Если ID_Узла <> "" И _ЛокКонтекст.ЛокЯдро_СтрНайти(ИмяНастройки, "_Узлы")  Тогда
		ПоискЗначения = Неопределено;
		Для каждого ЗначениеУзла Из ЗначениеНастройки Цикл
			Если ЗначениеУзла.Ключ = ID_Узла Тогда
				ПоискЗначения = ЗначениеУзла.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ЗначениеНастройки = ПоискЗначения;
	КонецЕсли;
	
	Возврат ЗначениеНастройки;
	
КонецФункции 

&НаКлиенте
Функция ОбъединитьМассивыУникальнымиЗначениями(МассивПриемник, МассивИсточник, СтруктураОтбора)
	
	Если ТипЗнч(МассивПриемник) = Тип("Массив")
		И ТипЗнч(МассивИсточник) = Тип("Массив") Тогда
		
		Результат = _ЛокКонтекст.ЛокЯдро_СкопироватьМассив(МассивПриемник);
		Для каждого СтрокаЗначения Из МассивИсточник Цикл
			Если ТипЗнч(СтрокаЗначения) = Тип("Структура") И СтрокаЗначения.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаЗначения);
			РезультатПоиска = _ЛокКонтекст.ЛокЯдро_НайтиВМассивеСтруктурПоОтбору(Результат, СтруктураОтбора, Истина);
			Если РезультатПоиска = Неопределено Тогда
				Результат.Добавить(СтрокаЗначения);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(МассивПриемник) = Тип("Массив") Тогда
		Результат = _ЛокКонтекст.ЛокЯдро_СкопироватьМассив(МассивПриемник);
	ИначеЕсли ТипЗнч(МассивИсточник) = Тип("Массив") Тогда
		Результат = _ЛокКонтекст.ЛокЯдро_СкопироватьМассив(МассивИсточник);
	Иначе
		Результат = МассивПриемник;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Функция НайтиЭлементыПоВхождениюВМассив(МассивОтбор, МассивИсточник, Знач ПараметрыОтбора, ВернутьОписаниеИсточника = Ложь)
	
	МассивРезультат = Новый Массив;
	
	Если НЕ ТипЗнч(МассивОтбор) = Тип("Массив") 
		ИЛИ МассивОтбор.Количество() = 0 Тогда
		Возврат МассивРезультат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(МассивИсточник) = Тип("Массив") 
		ИЛИ МассивИсточник.Количество() = 0 Тогда
		Возврат МассивРезультат;
	КонецЕсли;
	
	Если ВернутьОписаниеИсточника Тогда
		СтрокаКолонок = МассивИсточник[0];
		Если СтрокаКолонок.Свойство("ЭтоТаблицаЗначений") И СтрокаКолонок.ЭтоТаблицаЗначений Тогда
			МассивРезультат.Добавить(СтрокаКолонок);
		КонецЕсли;
	КонецЕсли;
	
	Для каждого СтрокаМассива Из МассивОтбор Цикл
		
		Если СтрокаМассива.Свойство("ЭтоТаблицаЗначений") И СтрокаМассива.ЭтоТаблицаЗначений Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаМассива);
		РезультатПоиска = _ЛокКонтекст.ЛокЯдро_НайтиВМассивеСтруктурПоОтбору(МассивИсточник, ПараметрыОтбора, Истина);
		Если РезультатПоиска <> Неопределено Тогда
			МассивРезультат.Добавить(РезультатПоиска);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции 

&НаКлиенте
Процедура ДобавитьЗаписьОшибки(ОписаниеОшибки, ИмяНастройки, Идентификатор)
	
	НоваяСтрока = ТаблицаОшибок.Добавить();
	НоваяСтрока.НомерСтроки = ТаблицаОшибок.Количество();
	НоваяСтрока.Описание = ОписаниеОшибки;
	НоваяСтрока.ИмяНастройки = ИмяНастройки;
	НоваяСтрока.Идентификатор = Идентификатор;
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		Элементы.ГруппаТаблицаОшибок.Показать();
	#КонецЕсли
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФормуМножественногоВыбора(ЗаголовокФормы, Описание, СписокВыбора, ОповещенияОЗакрытии)
	
	Если ЗапускИзОсновнойОбработки = Истина Тогда
		ФормаСлужебная_МножественныйВыборИзСписка = ПолучитьФормуОсновнойОбработки("ФормаСлужебная_МножественныйВыборИзСписка");
	Иначе
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаСлужебная_МножественныйВыборИзСписка = ПолучитьФорму("ОФ_ФормаСлужебная_МножественныйВыборИзСписка", ЭтаФорма);
		#Иначе
			ФормаСлужебная_МножественныйВыборИзСписка = ПолучитьФорму(ПолноеИмяОбъекта + ".Форма.ФормаСлужебная_МножественныйВыборИзСписка",, ЭтаФорма);	
		#КонецЕсли
	КонецЕсли;
	
	ФормаСлужебная_МножественныйВыборИзСписка.ВнешнийСписок = СписокВыбора;
	ФормаСлужебная_МножественныйВыборИзСписка.Заголовок = ЗаголовокФормы;
	ФормаСлужебная_МножественныйВыборИзСписка.ОписаниеОповещенияОЗакрытии = ОповещенияОЗакрытии;
	ФормаСлужебная_МножественныйВыборИзСписка.Описание = Описание;
	ФормаСлужебная_МножественныйВыборИзСписка.Открыть();
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьЗначениеВДеревоРекурсивно(СтрокиДерева, ИмяПоля, Значение)
	Для каждого ТекСтрока Из СтрокиДерева Цикл
		ТекСтрока[ИмяПоля] = Значение;
		УстановитьЗначениеВДеревоРекурсивно(ПолучитьЭлементыСтроки(ТекСтрока), ИмяПоля, Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеВДеревоПоУсловию(СтрокиДерева, ИмяПриемника, НовоеЗначение, ПолеСравнения, Условие, ПравоеЗначение, ВыбиратьСвязанные = Ложь)
	
	Для каждого ТекСтрока Из СтрокиДерева Цикл	
		УстановитьЗначениеВДеревоПоУсловию(ПолучитьЭлементыСтроки(ТекСтрока), ИмяПриемника, НовоеЗначение, ПолеСравнения, Условие, ПравоеЗначение, ВыбиратьСвязанные);	
		ЛевоеЗначение = ТекСтрока[ПолеСравнения];
		Если Условие = "Равно" Тогда
			Если НЕ ЛевоеЗначение = ПравоеЗначение Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	
		ТекСтрока[ИмяПриемника] = НовоеЗначение;
		
		Если ВыбиратьСвязанные Тогда
			ВыбратьСвязанныеЭлементыНастроек(ТекСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ВыбратьСвязанныеЭлементыНастроек(ДанныеСтроки)
	
	СвязанныеЭлементыВыбраны = Ложь;
	
	Родитель 							= ПолучитьРодителяСтроки(ДанныеСтроки);
	ИмяНастройки 					= ДанныеСтроки.Имя;
	ИмяНастройкиБезДЗ 				= СтрЗаменить(ИмяНастройки, "_ДЗ", "");
	ИмяНастройкиСДЗ 				= ИмяНастройкиБезДЗ + "_ДЗ";
	ИмяНастройкиБезРасширения 	= СтрЗаменить(ИмяНастройки, "_Узлы_ДЗ", "");
	
	Если ДанныеСтроки.Использовать Тогда
		
		Если ИмяНастройки = "ОбщаяСтруктураБизнесПроцессов"
			ИЛИ ИмяНастройки = "НастройкиБП_Общий" Тогда
			УстановитьЗначениеВДеревоПоУсловию(ПолучитьЭлементыСтроки(ДеревоНастроек), "Использовать", Истина, "Имя", "Равно", "ГлобальныеПараметры_Значения_ДЗ");
			УстановитьЗначениеВДеревоПоУсловию(ПолучитьЭлементыСтроки(ДеревоНастроек), "Использовать", Истина, "Имя", "Равно", "ПроизвольныеКоды_ДЗ");
			СвязанныеЭлементыВыбраны = Истина;
		ИначеЕсли ИмяНастройки = "ОбщаяСтруктураБизнесПроцессов_ДЗ" Тогда
			
			СтруктураНастроек = ПолучитьИзВременногоХранилища(АдресДанныхНастроек);
			ОбщаяСтруктураБизнесПроцессов = СтруктураНастроек.Значения.ОбщаяСтруктураБизнесПроцессов;
			Для каждого СтрокаНастройки Из ОбщаяСтруктураБизнесПроцессов Цикл
				Если СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
					Продолжить;
				КонецЕсли;
				Если СтрокаНастройки.ID_БизнесПроцесса = ДанныеСтроки.Ид Тогда
					НастройкаБП = СтрокаНастройки;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			СвязанныеЭлементыИдентификаторы = Новый Массив;
			Если НастройкаБП.Свойство("ID_ПроизвольногоКода_Выгрузка_Документ") Тогда
				СвязанныеЭлементыИдентификаторы.Добавить(НастройкаБП.ID_ПроизвольногоКода_Выгрузка_Документ);
			КонецЕсли;
			
			Если НастройкаБП.Свойство("ID_ПроизвольногоКода_Загрузка_Документ") Тогда
				СвязанныеЭлементыИдентификаторы.Добавить(НастройкаБП.ID_ПроизвольногоКода_Загрузка_Документ);
			КонецЕсли;
			
			СвязанныеЭлементыИдентификаторы.Добавить(НастройкаБП.Обработчик_ПередВыгрузкойДокумента);
			СвязанныеЭлементыИдентификаторы.Добавить(НастройкаБП.Обработчик_ПередЗаполнениемДокумента);
			СвязанныеЭлементыИдентификаторы.Добавить(НастройкаБП.Обработчик_ПослеВыгрузкиДокумента);
			СвязанныеЭлементыИдентификаторы.Добавить(НастройкаБП.Обработчик_ПослеЗаполненияДокумента);
			СвязанныеЭлементыИдентификаторы.Добавить(НастройкаБП.Обработчик_ПослеОткрытияФормыДокумента);
			СвязанныеЭлементыИдентификаторы.Добавить(НастройкаБП.Обработчик_ПослеОтправкиДокумента);
			
			ПолучитьИдентификаторыПоРеквизитам(СвязанныеЭлементыИдентификаторы, НастройкаБП.НастройкаВыгрузкиПолей);
			ПолучитьИдентификаторыПоРеквизитам(СвязанныеЭлементыИдентификаторы, НастройкаБП.НастройкаЗагрузкиПолей);
			
			Если ТипЗнч(НастройкаБП.НастройкаВыгрузкиТЧ) = Тип("Массив") Тогда
				Для каждого НастройкаТЧ Из НастройкаБП.НастройкаВыгрузкиТЧ Цикл
					Если НастройкаТЧ.Свойство("ЭтоТаблицаЗначений") Тогда
						Продолжить;
					ИначеЕсли НастройкаТЧ.Свойство("ТабличнаяЧастьДокумента1С") Тогда
						ПолучитьИдентификаторыПоРеквизитам(СвязанныеЭлементыИдентификаторы, НастройкаТЧ.ТабличнаяЧастьДокумента1С);
					ИначеЕсли НастройкаТЧ.Свойство("ТабличнаяЧастьДокумента1ССтрокой") Тогда
						РеквизитыТЧ = _ЛокКонтекст.ЛокЯдро_ЗначениеИзСтрокиXML(НастройкаТЧ.ТабличнаяЧастьДокумента1ССтрокой);
						ПолучитьИдентификаторыПоРеквизитам(СвязанныеЭлементыИдентификаторы, РеквизитыТЧ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ТипЗнч(НастройкаБП.НастройкаЗагрузкиТЧ) = Тип("Массив") Тогда
				Для каждого НастройкаТЧ Из НастройкаБП.НастройкаЗагрузкиТЧ Цикл
					Если НастройкаТЧ.Свойство("ЭтоТаблицаЗначений") Тогда
						Продолжить;
					ИначеЕсли НастройкаТЧ.Свойство("ТабличнаяЧастьДокумента1С") Тогда
						ПолучитьИдентификаторыПоРеквизитам(СвязанныеЭлементыИдентификаторы, НастройкаТЧ.ТабличнаяЧастьДокумента1С);
					ИначеЕсли НастройкаТЧ.Свойство("ТабличнаяЧастьДокумента1ССтрокой") Тогда
						РеквизитыТЧ = _ЛокКонтекст.ЛокЯдро_ЗначениеИзСтрокиXML(НастройкаТЧ.ТабличнаяЧастьДокумента1ССтрокой);
						ПолучитьИдентификаторыПоРеквизитам(СвязанныеЭлементыИдентификаторы, РеквизитыТЧ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Для каждого Идентификатор Из СвязанныеЭлементыИдентификаторы Цикл
				Если НЕ ЗначениеЗаполнено(Идентификатор) ИЛИ Идентификатор = Ложь Тогда
					Продолжить;
				КонецЕсли;
				УстановитьЗначениеВДеревоПоУсловию(ПолучитьЭлементыСтроки(ДеревоНастроек), "Использовать", Истина, "Ид", "Равно", Идентификатор);
				СвязанныеЭлементыВыбраны = Истина;
			КонецЦикла;
			
		ИначеЕсли ИмяНастройки = "ПользователиТСД_Узлы" Тогда
			УстановитьЗначениеВДеревоПоУсловию(ПолучитьЭлементыСтроки(ДеревоНастроек), "Использовать", Истина, "Имя", "Равно", "Пользователи");
		ИначеЕсли _ЛокКонтекст.ЛокЯдро_СтрНайти(ИмяНастройки, "НастройкиОтборовУзлов") Тогда
			
			Если ДанныеСтроки.ТипСтроки = "Файл"
				ИЛИ ДанныеСтроки.ТипСтроки = "Группа" Тогда
				УстановитьЗначениеВДеревоПоУсловию(ПолучитьЭлементыСтроки(ДеревоНастроек), "Использовать", Истина, "Имя", "Равно", "ПроизвольныеОтборыДокументов_ДЗ");
				СвязанныеЭлементыВыбраны = Истина;
			ИначеЕсли ДанныеСтроки.ТипСтроки = "ДетальнаяЗапись" Тогда
				
				СтруктураНастроек = ПолучитьИзВременногоХранилища(АдресДанныхНастроек);
				ЗначениеНастройки = СтруктураНастроек.Значения[ИмяНастройкиБезДЗ];
				Если ДанныеСтроки.ID_Узла <> "" Тогда
					ЗначениеНастройки = ЗначениеНастройки[ДанныеСтроки.ID_Узла];
				КонецЕсли;
				
				СвязанныеЭлементыИдентификаторы = Новый Массив;
				
				Если ЗначениеНастройки <> Ложь И ЗначениеЗаполнено(ЗначениеНастройки) Тогда
					Для каждого СтрокаНастройки Из ЗначениеНастройки Цикл
						Если ТипЗнч(СтрокаНастройки) = Тип("Структура") И СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
							Продолжить;
						ИначеЕсли ДанныеСтроки.Ид = СтрокаНастройки.ID_БизнесПроцесса Тогда
							НастройкаОтбора = СтрокаНастройки;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если (НастройкаОтбора.ВариантОтбора = "Только запрос"
						ИЛИ НастройкаОтбора.ВариантОтбора = "Конструктор и запрос")
						И НастройкаОтбора.Свойство("ID_ПроизвольногоОтбора") Тогда
						СвязанныеЭлементыИдентификаторы.Добавить(НастройкаОтбора.ID_ПроизвольногоОтбора);
					КонецЕсли;
					
				КонецЕсли;
				
				Для каждого Идентификатор Из СвязанныеЭлементыИдентификаторы Цикл
					Если НЕ ЗначениеЗаполнено(Идентификатор) ИЛИ Идентификатор = Ложь Тогда
						Продолжить;
					КонецЕсли;
					УстановитьЗначениеВДеревоПоУсловию(ПолучитьЭлементыСтроки(ДеревоНастроек), "Использовать", Истина, "Ид", "Равно", Идентификатор);
					СвязанныеЭлементыВыбраны = Истина;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СвязанныеЭлементыВыбраны;
	
КонецФункции 

&НаКлиенте
Процедура ПолучитьИдентификаторыПоРеквизитам(МассивЗаполнения, МассивРеквизитов)
	
	Если ТипЗнч(МассивРеквизитов) = Тип("Массив") Тогда
		
		Для каждого НастройкаПоля Из МассивРеквизитов Цикл
			Если НастройкаПоля.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			Если НастройкаПоля.ТипИсточника = "ПроизвольныйКод"
				ИЛИ НастройкаПоля.ТипИсточника = "ГлобальныйПараметр" Тогда
				МассивЗаполнения.Добавить(НастройкаПоля.ИмяИсточника);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьПервогоРодителяСтроки(СтрокаДереваЗначений)
	
	Родитель = ПолучитьРодителяСтроки(СтрокаДереваЗначений);
	Если Родитель <> Неопределено Тогда
		Возврат ПолучитьПервогоРодителяСтроки(Родитель);
	Иначе
		Возврат СтрокаДереваЗначений;
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Функция НайтиПервоеЗначениеДереваРекурсивно(СтрокиДерева, ИмяПоля, Значение)
	
	Для каждого ТекСтрока Из СтрокиДерева Цикл
		
		РезультатПоиска = НайтиПервоеЗначениеДереваРекурсивно(ПолучитьЭлементыСтроки(ТекСтрока), ИмяПоля, Значение);
		Если РезультатПоиска <> Неопределено Тогда
			Возврат РезультатПоиска;
		КонецЕсли;
		
		Если НЕ ТекСтрока.ЭтоРодитель И ТекСтрока[ИмяПоля] = Значение Тогда
			Возврат ТекСтрока;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции 

&НаКлиенте
Функция НайтиСтрокиДереваРекурсивно(СтрокиДерева, Колонка, Значение)
	
	Результат = Новый Массив;
	Для каждого ТекСтрока Из СтрокиДерева Цикл	
		
		Если ТекСтрока[Колонка] = Значение Тогда
			Результат.Добавить(ТекСтрока);
		КонецЕсли;
		
		СтрокиПодчиненные = НайтиСтрокиДереваРекурсивно(ПолучитьЭлементыСтроки(ТекСтрока), Колонка, Значение);
		Для каждого СтрокаПодчиненная Из СтрокиПодчиненные Цикл
			Результат.Добавить(СтрокаПодчиненная);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОбновитьПризнакИспользованияРекурсивно(СтрокиДерева)
	
	КэшРежимИспользования = -1;
	Для каждого ТекСтрока Из СтрокиДерева Цикл
		
		РежимИспользования = 0;
		Если ТекСтрока.Доступность Тогда
			Если ТекСтрока.ЭтоРодитель Тогда
				РежимИспользования = ОбновитьПризнакИспользованияРекурсивно(ПолучитьЭлементыСтроки(ТекСтрока));
			Иначе
				Если ТекСтрока.Использовать
					И ТекСтрока.ИзменениеДетальныхЗаписей Тогда
					РежимИспользования = 2;
				ИначеЕсли ТекСтрока.Использовать Тогда
					РежимИспользования = 1;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если КэшРежимИспользования >= 0 И КэшРежимИспользования <> РежимИспользования Тогда
			КэшРежимИспользования = 2;
		Иначе
			КэшРежимИспользования	 = Макс(КэшРежимИспользования, РежимИспользования);
		КонецЕсли;
		
		ТекСтрока.Использовать = РежимИспользования > 0;
		ТекСтрока.ИзменениеДетальныхЗаписей = РежимИспользования = 2 
														И НЕ ТекСтрока.ТипСтроки = "Группа"
														И РежимОбмена = "Импорт";
		
	КонецЦикла;
	
	Возврат КэшРежимИспользования;
	
КонецФункции 

&НаКлиенте
Процедура УстановитьЗначениеРодителейВДеревоРекурсивно(ПодчиненнаяСтрока, ИмяПоля, Значение, ПервоеВхождение = Истина)
	
	Родитель = ПолучитьРодителяСтроки(ПодчиненнаяСтрока);
	Если Родитель <> Неопределено Тогда
		УстановитьЗначениеРодителейВДеревоРекурсивно(Родитель, ИмяПоля, Значение, Ложь);
	КонецЕсли;
	
	Если НЕ ПервоеВхождение Тогда
		ПодчиненнаяСтрока[ИмяПоля] = Значение;		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗадатьПризнакРодителяРекурсивно(СтрокиДерева)
	Для каждого ТекСтрока Из СтрокиДерева Цикл
		Если ТекСтрока.ТипСтроки = "Группа"
			ИЛИ ТекСтрока.Строки.Количество() Тогда
			ТекСтрока.ЭтоРодитель = Истина;
			ЗадатьПризнакРодителяРекурсивно(ТекСтрока.Строки);
		Иначе
			ТекСтрока.ЭтоРодитель = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Процедура УстановитьКартинкиРекурсивно(СтрокиДерева)
	
	Для каждого ТекСтрока Из СтрокиДерева Цикл
		УстановитьКартинкуСтроки(ТекСтрока);
		УстановитьКартинкиРекурсивно(ТекСтрока.Строки);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьКартинкуСтроки(СтрокаДерева)
	
	Картинка = Неопределено;
	Если ЗначениеЗаполнено(СтрокаДерева.Картинка) Тогда	
		Картинка = СтрокаДерева.Картинка;
	ИначеЕсли СтрокаДерева.ТипСтроки = "Группа" Тогда
		Картинка = БиблиотекаКартинок.ЖурналДокументов;
	ИначеЕсли СтрокаДерева.ТипСтроки = "Файл" Тогда
		Картинка = БиблиотекаКартинок.Задача;
	ИначеЕсли СтрокаДерева.ТипСтроки = "ДетальнаяЗапись" Тогда
		Картинка = БиблиотекаКартинок.ТабличныйДокументОтображатьЗаголовки;
	КонецЕсли;
	СтрокаДерева.Картинка = Картинка;
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЭлементыСтроки(СтрокаДерева)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат СтрокаДерева.Строки;
	#Иначе
		Возврат СтрокаДерева.ПолучитьЭлементы();
	#КонецЕсли
КонецФункции 

&НаКлиенте
Функция ПолучитьРодителяСтроки(СтрокаДерева)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат СтрокаДерева.Родитель;
	#Иначе
		Возврат СтрокаДерева.ПолучитьРодителя();
	#КонецЕсли
КонецФункции

#КонецОбласти

#Если ТолстыйКлиентОбычноеПриложение Тогда
	
Процедура ДеревоНастроекПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	ОформлениеСтроки.Ячейки.ДеревоНастроекКартинка.ОтображатьКартинку = Истина;
	ОформлениеСтроки.Ячейки.ДеревоНастроекКартинка.ОтображатьТекст = Ложь;
	ОформлениеСтроки.Ячейки.ДеревоНастроекКартинка.Картинка = ДанныеСтроки.Картинка;

КонецПроцедуры

	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	
#КонецЕсли