#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Наименование) Тогда 
		Наименование = "" + РегНомер + " " + ТипТС + " " + МаркаТС + " " + Формат(ГрузоподъемностьТонн,"ЧН=; ЧГ=") + " т"; 
	КонецЕсли;
	
	Если Не (ДополнительныеСвойства.Свойство("ОтключитьПроверки") И ДополнительныеСвойства.ОтключитьПроверки) Тогда 
	
		РезультатПроверки = Справочники.КонтурЛогистика_ТранспортныеСредства.РезультатПроверкиАрендатораДоговора(ЭтотОбъект, Отказ);
		Справочники.КонтурЛогистика_ТранспортныеСредства.ВывестиРезультатПроверкиПолей(РезультатПроверки);
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипПечатнойФормыПутыхЛистов)
		И ЗначениеЗаполнено(ТипТС) Тогда
		
		ТипПечатнойФормыПутыхЛистов = Справочники.КонтурЛогистика_ТранспортныеСредства.ТипПечатнойФормыПоТипуТранспортногоСредства(ТипТС);
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ", ЭтотОбъект, Отказ);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("КонтурЛогистика_ТранспортныеСредства_ПередЗаписью_После", Истина, ПараметрыПМ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ОбъектУчетнойСистемыСсылка")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка) Тогда 
		
		ОбъектУчетнойСистемыСсылка = ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка;
		
		Наименование = Строка(ОбъектУчетнойСистемыСсылка);
		НоваяСвязь = СвязанныеОбъекты.Добавить();
		НоваяСвязь.СвязанныйОбъект = ОбъектУчетнойСистемыСсылка;
		
		Если КонтурЛогистика_КонвертацияСервер.ЭтоНетиповаяСсылкаДляСвязанногоОбъекта(Ссылка, ОбъектУчетнойСистемыСсылка) Тогда
			КонтурЛогистика_КонвертацияСервер.ЗаполнитьДанныеДляНетиповогоСправочникаВСвязанныхОбъектах(НоваяСвязь, ОбъектУчетнойСистемыСсылка)
		КонецЕсли;
		
		// TODO включить после реализации справочника конвертации справочников
		// Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ЗаполнитьСущность(ЭтотОбъект, ОбъектУчетнойСистемыСсылка, Перечисления.КонтурЛогистика_СправочникиКонтурЛогистика);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти