#Область ПрограммныйИнтерфейс

// Получает экземпляр обработки КонтурДиадокАпдейтКлиент
//
// Возвращаемое значение:
//  ОбработкаОбъект - экземпляр обработки КонтурДиадокАпдейтКлиент
//
Функция АпдейтКлиент() Экспорт
	
	МодульЯдро = КонтурДиадокСерверПовтИсп.МодульЯдро();
	
	Результат = МодульЯдро.Модуль_АпдейтКлиент();
	
	ПараметрыКлиента = Результат.АпдейтКлиентПараметры();
	ПараметрыКлиента.Локация = КонтурДиадокОбновлениеСервер.АдресСервисаОбновлений();
	
	Результат.АпдейтКлиент(ПараметрыКлиента);
	
	Возврат Результат;
	
КонецФункции

// Сверяет контрольную сумму установленного расширения с контрольной суммой из сервиса обновлений
//
// Возвращаемое значение:
//  Булево - Истина если контрольная сумма совпадает, Ложь если контрольная сумма не совпадает
//
Функция УстановленноеРасширениеТиповое() Экспорт
	
	КонтрольнаяСуммаИзСервиса = КонтурДиадокОбновлениеСервер.КонтрольнаяСуммаРасширенияИзСервисаОбновлений();
	КонтрольнаяСуммаУстановленногоРасширения = КонтурДиадокОбновлениеСервер.КонтрольнаяСуммаУстановленногоРасширения();
	
	Результат = (КонтрольнаяСуммаИзСервиса = КонтрольнаяСуммаУстановленногоРасширения);
	
	Возврат Результат;
	
КонецФункции

// Читает значение настройки АвтоматическиОбновлятьМодуль
//
// Возвращаемое значение:
//  Булево - Истина если включено автоматическое обновление модуля, по умолчанию Истина
//
Функция ОтключеноАвтоматическоеОбновлениеМодуля() Экспорт
	
	МодульЯдро = КонтурДиадокСерверПовтИсп.МодульЯдро();
	
	Результат = МодульЯдро.ОбщиеНастройки_Прочитать("АвтоматическиОбновлятьМодуль");
	
	ТипНастройки = Тип("Булево");
	ЗначениеПоУмолчанию = Истина;
	
	Если ТипЗнч(Результат) <> ТипНастройки Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат НЕ Результат;
	
КонецФункции

#КонецОбласти