
// Выполняет инициализацию основного функционала расширения
//
Процедура Клеверенс_Инициализация() Экспорт
	
	//Получение из настроек
	ПараметрыПодключенияMS = ПолучитьПараметрыПодключенияMS();
	
	ТипИнтеграционнойОбработки 		= Неопределено;
	ПутьИнтеграционнойОбработки		= Неопределено;
	ОтключитьРаботуСКнопкамиОбмена	= Истина;
	
	Если ТипЗнч(ПараметрыПодключенияMS) = Тип("Структура") Тогда

		ПараметрыПодключенияMS.Свойство("ТипОбработки", 					ТипИнтеграционнойОбработки);			
		ПараметрыПодключенияMS.Свойство("ПутьИнтеграционнойОбработки", 		ПутьИнтеграционнойОбработки);
		Если ПараметрыПодключенияMS.Свойство("ОтключитьРаботуСКнопкамиОбмена") Тогда
			ОтключитьРаботуСКнопкамиОбмена = ПараметрыПодключенияMS.ОтключитьРаботуСКнопкамиОбмена;
		КонецЕсли;
			
	КонецЕсли;
		
	ВидыОбмена = Новый Массив;
	ВидыОбмена.Добавить("ЗагрузкаДокументов");
	ВидыОбмена.Добавить("ВыгрузкаДокументов");
	ВидыОбмена.Добавить("ВыгрузкаСправочников");
	ВидыОбмена.Добавить("ИменаФормЗагрузкиДокументов");
	ВидыОбмена.Добавить("ИменаФормВыгрузкиДокументов");
	ВидыОбмена.Добавить("МестаВстраиванияКнопкиЗагрузки");
	ВидыОбмена.Добавить("МестаВстраиванияКнопкиВыгрузки");
	
	Если ОтключитьРаботуСКнопкамиОбмена = Истина
		ИЛИ НЕ ЗначениеЗаполнено(ПутьИнтеграционнойОбработки) 
		ИЛИ (НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("Клеверенс_Кнопки")) Тогда
		
		// Очистка настроек имен объектов, участвующих в выгрузке/загрузке в MS
		Для каждого ВидОбмена ИЗ ВидыОбмена Цикл
			Клеверенс_ОбщегоНазначенияСервер.ОчиститьИменаОбъектовОбмена(ВидОбмена);
		КонецЦикла;	
	
	ИначеЕсли ОтключитьРаботуСКнопкамиОбмена = Ложь
		И ЗначениеЗаполнено(ПутьИнтеграционнойОбработки)
		И (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Клеверенс_Кнопки")) Тогда
		
		ИнтеграционнаяОбработка = ПодключитьОбработкуНаСервере(ПутьИнтеграционнойОбработки, ТипИнтеграционнойОбработки);
		
		Если ИнтеграционнаяОбработка <> Неопределено Тогда
			// Запись в настройки имен объектов, участвующих в выгрузке/загрузке в MS
			Для каждого ВидОбмена ИЗ ВидыОбмена Цикл
				Клеверенс_ОбщегоНазначенияСервер.СохранитьИменаОбъектовОбмена(ИнтеграционнаяОбработка, ВидОбмена);
			КонецЦикла;
		КонецЕсли;

	КонецЕсли;
	
	// Сохраним в хранилище пользователя структуру, которую будем использовать для хранения данных на время сеанса
	Клеверенс_ОбщегоНазначенияСервер.ЗаписатьНастройкуВХранилище("CleverenceButtonsExtension_КэшДанных", Новый Структура);
	
КонецПроцедуры

// Получает параметры подключения MS из настроек
//
// Возвращаемое значение:
//   Структура   - параметры подключения MS
//
Функция ПолучитьПараметрыПодключенияMS() Экспорт

	ПользовательскиеПараметрыПодключенияMS = Клеверенс_ОбщегоНазначенияСервер.ПолучитьНастройкуОбщегоХранилища("Cleverence_ПараметрыПодключенияMS", Истина);
	Если ПользовательскиеПараметрыПодключенияMS = Неопределено Тогда
		ОбщиеПараметрыПодключенияMS = Клеверенс_ОбщегоНазначенияСервер.ПолучитьНастройкуОбщегоХранилища("Cleverence_ПараметрыПодключенияMS", Ложь);
		ПараметрыПодключенияMS = ОбщиеПараметрыПодключенияMS;
	Иначе
		ПараметрыПодключенияMS = ПользовательскиеПараметрыПодключенияMS;
	КонецЕсли;

	Возврат ПараметрыПодключенияMS;
	
КонецФункции

// Проверяет, существует ли объект метаданных
//
// Параметры:
//  ПолноеИмя  - Строка - полное имя объекта метаданных (например, Справочник.Номенклатура, Документ.ПриемНаРаботу.)
//
// Возвращаемое значение:
//   Булево   - признак наличия объекта метаданных
//
Функция ПроверитьОбъектМетаданныхСуществует(ПолноеИмя) Экспорт
	
	ОбъектСуществует = Метаданные.НайтиПоПолномуИмени(ПолноеИмя) <> Неопределено;
	
	Возврат ОбъектСуществует;
	
КонецФункции

Процедура ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, УровеньСтрокой, Комментарий)  Экспорт
	
    Клеверенс_ОбщегоНазначенияСервер.ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, УровеньСтрокой, Комментарий);
	
КонецПроцедуры

Функция ПолучитьСсылкуИзЗначенияСтрокиСписка(ЗначениеСтрокиСписка) Экспорт
    
	Попытка
		Ссылка = ЗначениеСтрокиСписка.Ссылка;
	Исключение
		Ссылка = Неопределено;
	КонецПопытки;
	
	Возврат Ссылка;
	
КонецФункции

Процедура ЗаписатьНастройкуВХранилище(КлючНастройки, Настройка, ПользовательскаяНастройка = Истина) Экспорт
	
	Клеверенс_ОбщегоНазначенияСервер.ЗаписатьНастройкуВХранилище(КлючНастройки, Настройка, ПользовательскаяНастройка);
	
КонецПроцедуры

Функция ПолучитьНастройкуОбщегоХранилища(КлючНастройки, ПользовательскаяНастройка = Истина) Экспорт
	
	ДанныеИзХранилища = Клеверенс_ОбщегоНазначенияСервер.ПолучитьНастройкуОбщегоХранилища(КлючНастройки, ПользовательскаяНастройка);
	
	Возврат ДанныеИзХранилища;
	
КонецФункции

// См. Клеверенс_ОбщегоНазначенияСервер.ПодключитьОбработку()
Функция ПодключитьОбработкуНаСервере(ПутьОбработки, ТипОбработки) Экспорт
	Возврат Клеверенс_ОбщегоНазначенияСервер.ПодключитьОбработку(ПутьОбработки, ТипОбработки);
КонецФункции

// См. Клеверенс_ОбщегоНазначенияСервер.ПодключитьОбработку()
Процедура ПодключитьОбработку(ПутьОбработки, ТипОбработки) Экспорт
	Клеверенс_ОбщегоНазначенияСервер.ПодключитьОбработку(ПутьОбработки, ТипОбработки);
КонецПроцедуры

Функция ПолучитьОбъектИнтеграционнойОбработки() Экспорт
	
	//Получение из настроек
	ПараметрыПодключенияMS = ПолучитьПараметрыПодключенияMS();
	
	Если ТипЗнч(ПараметрыПодключенияMS) = Тип("Структура") Тогда

		ТипИнтеграционнойОбработки 		= Неопределено;
		ПутьИнтеграционнойОбработки		= Неопределено;
		
		ПараметрыПодключенияMS.Свойство("ТипОбработки", 				ТипИнтеграционнойОбработки);			
		ПараметрыПодключенияMS.Свойство("ПутьИнтеграционнойОбработки", 	ПутьИнтеграционнойОбработки);
			
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ПутьИнтеграционнойОбработки) Тогда		
		ИнтеграционнаяОбработка = ПодключитьОбработкуНаСервере(ПутьИнтеграционнойОбработки, ТипИнтеграционнойОбработки);
	Иначе
		ИнтеграционнаяОбработка = Неопределено;
	КонецЕсли;
	
	Возврат ИнтеграционнаяОбработка;
		
КонецФункции

//Проверяет, созданы ли ПрофилиГруппДоступа и ГруппыДоступа для ролей Клеверенс
Процедура ПроверитьСоздатьПрофилиПользователей() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка	
		ВерсияСовместимости = СтрЗаменить(Метаданные.РежимСовместимости,"Версия","");
		ВерсияМассив = СтрРазделить(ВерсияСовместимости,"_");
		
		ВерсияМассивЧисло= Новый Массив;
		Для Каждого Стр Из ВерсияМассив Цикл
			Стр = Число(Стр);
			ВерсияМассивЧисло.Добавить(Стр);
		КонецЦикла;
		
		Если НЕ (ВерсияМассивЧисло[0] >= 8 И ВерсияМассивЧисло[1] >= 3 И ВерсияМассивЧисло[2] >= 14)  Тогда
			Возврат;
		КонецЕсли;
	Исключение
		Возврат;
	КонецПопытки;
	
	
	Если Метаданные.Справочники.Найти("ПрофилиГруппДоступа") = Неопределено ИЛИ Метаданные.Справочники.Найти("ГруппыДоступа") = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	
	СправочникИдентификаторыСуществует = Метаданные.Справочники.Найти("ИдентификаторыОбъектовМетаданных") <> Неопределено;
	
	СправочникМенеджер = Справочники["ПрофилиГруппДоступа"]; 	
	
	ПроФильМеню = СправочникМенеджер.НайтиПоНаименованию("Клеверенс главное меню");
	ПроФильКнопок = СправочникМенеджер.НайтиПоНаименованию("Клеверенс кнопки в документах");
	
	
	Если (ПроФильМеню = СправочникМенеджер.ПустаяСсылка()) ИЛИ  (ПроФильКнопок = СправочникМенеджер.ПустаяСсылка()) Тогда
		
		ТипРолиВПрофилеГруппДоступа = Неопределено;
		
		СтараяКонфигурация = Ложь;
		
		Попытка
			ТипРолиВПрофилеГруппДоступа = Тип(Метаданные.Справочники.ПрофилиГруппДоступа.ТабличныеЧасти.Роли.Реквизиты.Роль.Тип);
		Исключение
		КонецПопытки;
		
		Если ТипРолиВПрофилеГруппДоступа = ТипЗнч("Строка") Тогда  //проверим тип значнеия роли в ПрофилеГруппыДоступа
			
			СтараяКонфигурация = Истина; 
			
			РольОсновное = "Клеверенс_Основное"; 
			РольГлавноеМеню= "Клеверенс_ГлавноеМеню";
			РольКнопки = "Клеверенс_Кнопки";
		Иначе
			РольОсновное = "Роль.Клеверенс_Основное"; 
			РольГлавноеМеню= "Роль.Клеверенс_ГлавноеМеню";
			РольКнопки = "Роль.Клеверенс_Кнопки";	
			
			Роли = Новый Массив;
			Роли.Добавить(РольОсновное);
			Роли.Добавить(РольГлавноеМеню);
			Роли.Добавить(РольКнопки);	
			
			Если СправочникИдентификаторыСуществует Тогда
				Попытка
					ИдентификаторыРолей = Справочники.ИдентификаторыОбъектовМетаданных.ИдентификаторыОбъектовМетаданных(
					Роли, ложь);
				Исключение
					Возврат
				КонецПопытки
			КонецЕсли;
			
		КонецЕсли;
		
		// Создаем ПрофильГруппыДоступа
		
		ТзПрофилиГрупп = Новый ТаблицаЗначений;
		ТзПрофилиГрупп.Колонки.Добавить("Имя");
		ТзПрофилиГрупп.Колонки.Добавить("Ссылка");
		ТзПрофилиГрупп.Колонки.Добавить("Роли");
		
		НовСтр= ТзПрофилиГрупп.Добавить();
		Новстр.Имя = "Клеверенс главное меню";
		НовСтр.Ссылка = СправочникМенеджер.НайтиПоНаименованию(Новстр.Имя);
		РолиПрофиля = Новый Массив;
		РолиПрофиля.Добавить(РольОсновное);
		РолиПрофиля.Добавить(РольГлавноеМеню);
		НовСтр.роли = РолиПрофиля;
		
		НовСтр= ТзПрофилиГрупп.Добавить();
		Новстр.Имя = "Клеверенс кнопки в документах";
		НовСтр.Ссылка = СправочникМенеджер.НайтиПоНаименованию(Новстр.Имя);
		РолиПрофиля = Новый Массив;
		РолиПрофиля.Добавить(РольОсновное);
		РолиПрофиля.Добавить(РольКнопки);
		НовСтр.роли = РолиПрофиля;
		
		
		Для Каждого ПрофильГруппы Из ТзПрофилиГрупп Цикл
			Если ПрофильГруппы.Ссылка = СправочникМенеджер.ПустаяСсылка() Тогда
				
				НовОбъект = СправочникМенеджер.СоздатьЭлемент();
				НовОбъект.Наименование = ПрофильГруппы.имя;
				
				Если НЕ СтараяКонфигурация Тогда
					СтНазначение = НовОбъект.Назначение.Добавить();    
					СтНазначение.ТипПользователей = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
				КонецЕсли;
				
				Для Каждого Роль из ПрофильГруппы.Роли Цикл
					ДобавляемаяРоль = НовОбъект.Роли.Добавить();
					Если СтараяКонфигурация Тогда
						ДобавляемаяРоль.Роль = Роль;
					Иначе
						ЗначениеРоли = ИдентификаторыРолей.Получить(Роль);
						ДобавляемаяРоль.Роль = ЗначениеРоли;
					КонецЕсли;
					НовОбъект.Записать();
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ПроФильМеню = СправочникМенеджер.НайтиПоНаименованию("Клеверенс главное меню"); // обновим ссылки
		ПроФильКнопок = СправочникМенеджер.НайтиПоНаименованию("Клеверенс кнопки в документах");
	КонецЕсли;
	
	// Создаем ГруппыДоступа
	СправочникМенеджер = Справочники["ГруппыДоступа"];	
	
	ГруппаМеню = СправочникМенеджер.НайтиПоНаименованию("Клеверенс главное меню");
	ГруппаКнопок = СправочникМенеджер.НайтиПоНаименованию("Клеверенс кнопки в документах");
	
	Если ГруппаМеню = СправочникМенеджер.ПустаяСсылка() Тогда 
		НовГруппа = СправочникМенеджер.СоздатьЭлемент();
		НовГруппа.Наименование = "Клеверенс главное меню";
		НовГруппа.Профиль = ПроФильМеню;
		НовГруппа.Записать();
	КонецЕсли;
	
	Если ГруппаКнопок = СправочникМенеджер.ПустаяСсылка() Тогда 
		НовГруппа = СправочникМенеджер.СоздатьЭлемент();
		НовГруппа.Наименование = "Клеверенс кнопки в документах";
		НовГруппа.Профиль = ПроФильКнопок;
		НовГруппа.Наименование = ПроФильКнопок;
		НовГруппа.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры