#Область ПеренесеноСДоработками

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_АдресДоставки", "ГруппаОткуда", , 1, "Объект.АУ_АдресДоставки");
	Элементы.АУ_АдресДоставки.АвтоМаксимальнаяШирина = Ложь;
	
	АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычнаяБезОтображения(ЭтаФорма, "АУ_ГруппаСтатусы", ЭтаФорма, 3, , , , "ГруппаНомерДата");
	Элементы.Переместить(Элементы.СпособДоставки, Элементы.АУ_ГруппаСтатусы);
	
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_СпособДоставки", "АУ_ГруппаСтатусы", , 4, "Объект.АУ_СпособДоставки");
	Элементы.АУ_СпособДоставки.ВидПереключателя = ВидПереключателя.Тумблер;
	Элементы.АУ_СпособДоставки.СписокВыбора.Добавить(Перечисления.СпособыДоставки.Самовывоз);
	Элементы.АУ_СпособДоставки.СписокВыбора.Добавить(Перечисления.СпособыДоставки.ДоКлиента);
	
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_Статус", "АУ_ГруппаСтатусы", , 1, "Объект.АУ_Статус");
	
	АУ_СозданиеЭлементовФормы.СоздатьТаблицаФормы(ЭтаФорма, "АУ_Исполнители", , "Объект.АУ_Исполнители", Новый Структура("Исполнитель", "Исполнитель"));
	Элементы.АУ_Исполнители.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	Элементы.АУ_Исполнители.ВысотаВСтрокахТаблицы = 3;
	Элементы.АУ_Исполнители.АвтоМаксимальнаяВысота = Ложь;
	Элементы.АУ_Исполнители.РастягиватьПоВертикали = Ложь;
	
	Элементы.ГруппаКонтактВремя.Видимость = Ложь;
	Элементы.Комментарий.Видимость = Ложь;
	
	Группа = АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычнаяБезОтображения(ЭтаФорма, "АУ_ГруппаОснование", ЭтаФорма, 3,,,, "ГруппаНомерДата");
	Элементы.Переместить(Элементы.НадписьОснование, Группа);
	
	Элементы.ОписаниеПоручения.РастягиватьПоВертикали = Истина;
	
	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(ЭтаФорма, "АУ_КонтактнаяИнформация", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Элемент = АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_КонтактнаяИнформация", "ГруппаПунктЗона",,7, "АУ_КонтактнаяИнформация");
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элемент.Шрифт = Новый Шрифт(,, Истина);
	Элемент.ЦветТекста = WebЦвета.Синий;
	ЗаполнитьКонтактнуюИнформацию();
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_СменитьОснование", "Сменить основание", "АУ_СменитьОснование");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_СменитьОснование", Группа,, "АУ_СменитьОснование", 2);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.АУ_Статус = Перечисления.АУ_СтатусыПорученийЭкспедиторам.Подготовлено;
		
		НоваяСтрока = Объект.АУ_Исполнители.Добавить();
		НоваяСтрока.Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Семенихина Ольга Андреевна");
		
		НоваяСтрока = Объект.АУ_Исполнители.Добавить();
		НоваяСтрока.Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Сафонин Виктор Михайлович");
		
	КонецЕсли;
	
	Если НЕ РольДоступна("ПолныеПрава") И Объект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтаФорма, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ПриОткрытииПосле(Отказ)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИОбработчики

&НаКлиенте
Процедура СменитьОснованиеЗавершение(Значение,ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Объект.Основания.Очистить();
		НоваяСтрока = Объект.Основания.Добавить();
		НоваяСтрока.Основание=Значение;
		Модифицированность=Истина;
		ОтобразитьОснование();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_СменитьОснование(Элемент)
	
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора",,ЭтаФорма,Новый УникальныйИдентификатор,,,Новый ОписаниеОповещения("СменитьОснованиеЗавершение",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ЗаполнитьКонтактнуюИнформацию()
	
	ЭтаФорма.АУ_КонтактнаяИнформация = АУ_ОбщиеПроцедурыИФункцииСервер.ПолучитьТелефонКонтактногоЛица(Объект.КонтактноеЛицо);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_КонтактноеЛицоПриИзмененииПосле(Элемент)
	
	ЗаполнитьКонтактнуюИнформацию();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти