////////////////////////////////////////////////////////////////////////////////
// Содержит события форм, вызываемые на клиенте
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет переопределяемую команду
//
// Параметры:
//  Форма	- ФормаКлиентскогоПриложения - форма, в которой расположена команда
//  Команда	- КомандаФормы - команда формы
//  ДополнительныеПараметры	- Структура - дополнительные параметры.
//
Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры) Экспорт
	
	//++ Локализация

	Если Форма.ИмяФормы <> "Документ.ОтчетОбИмпортеЕГАИС.Форма.ФормаДокумента"
		И Форма.ИмяФормы <> "Документ.ОтчетОПроизводствеЕГАИС.Форма.ФормаДокумента" Тогда
		СобытияФормИСКлиент.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
	КонецЕсли;
	
	Если Команда.Имя = "КомандаЗаполнитьУпаковкуЧастичногоВыбытияИС" Тогда
		ИнтеграцияИСУТКлиент.ЗаполнениеУпаковкиЧастичногоВыбытияПоДаннымиГИСМТ(Форма);
	КонецЕсли;
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаСписка"
		И Команда.Имя = "НастройкаИнтеграцииНоменклатурыИС" Тогда
		
		ИмяЭлементаСписка = ПодборТоваровКлиентСервер.ИмяСпискаНоменклатурыПоВариантуПоиска(Форма);
		ВыделенныеСтроки = Форма.Элементы[ИмяЭлементаСписка].ВыделенныеСтроки;
		
		ОтборПоНоменклатуре = Новый Массив;
		Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
			Если ТипЗнч(ВыделеннаяСтрока) = Тип("СправочникСсылка.Номенклатура") Тогда
				ОтборПоНоменклатуре.Добавить(ВыделеннаяСтрока);
			КонецЕсли;
		КонецЦикла;
		
		Если ОтборПоНоменклатуре.Количество() = 0 Тогда
			ПоказатьПредупреждение(,
				НСтр("ru = 'Отсутствуют выделенные строки для настройки интеграции с ФГИС'"));
		Иначе
			ПараметрыОткрытияФормы = Новый Структура;
			ПараметрыОткрытияФормы.Вставить("ОтборПоНоменклатуре", ОтборПоНоменклатуре);
			ОткрытьФорму("ОбщаяФорма.НастройкаИнтеграцииНоменклатурыИС", ПараметрыОткрытияФормы,, "ОтборПоНоменклатуре");
		КонецЕсли;
		
	КонецЕсли;
	
	ИнтеграцияСМаркетплейсамиКлиент.ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры);
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  ИмяСобытия				- Строка - идентификатор сообщения принимающей формой (см. метод Оповестить)
//  Параметр				- Произвольный - параметр сообщения (см. метод Оповестить)
//  Источник				- Произвольный - источник события (см. метод Оповестить)
//  ДополнительныеПараметры	- Структура - дополнительные параметры.
//
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры = Неопределено) Экспорт
	
	//++ Локализация
	СобытияФормИСКлиент.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
	ОформлениеПередачиТоваровМеждуОрганизациямиКлиент.ОбработкаОповещения(Форма, ИмяСобытия, Параметр);
	Если ИмяСобытия = "ЗаполнитьПараметрыНовойУпаковкиЧастичногоВыбытия"
		И Форма.ВладелецФормы = Источник Тогда
		ИнтеграцияИСУТКлиент.ЗаполнитьПараметрыНовойУпаковкиЧастичногоВыбытия(Форма, Параметр);
	КонецЕсли;
	Если ИмяСобытия = "Запись_НаборУпаковок"
		И Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		ИсточникОписания = ИнтеграцияИСУТКлиентСервер.ИсточникДанныхПоВидамУпаковок(Форма.Объект);
		Если ТипЗнч(ИсточникОписания) = Тип("СправочникСсылка.НаборыУпаковок")
			И ИсточникОписания = Форма.Объект.НаборУпаковок Тогда
			ЗаполнитьЗначенияСвойств(Форма, Источник, "ПотребительскаяУпаковкаИС,ИспользуетсяЧастичноеВыбытиеИС,УпаковкаЧастичногоВыбытияИС");
		КонецЕсли;
	КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//	см. справочную информацию по событиям управляемой формы.
//	НавигационнаяСсылкаФорматированнойСтроки - Строка - строка навигационной ссылки
//	СтандартнаяОбработка - Булево - признак стандартной обработки события
//
Процедура ОбработкаНавигационнойСсылки(Форма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	СобытияФормИСКлиент.ОбработкаНавигационнойСсылки(Форма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	ОформлениеПередачиТоваровМеждуОрганизациямиКлиент.ОбработкаНавигационнойСсылки(Форма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма			- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  ПараметрыЗаписи	- Структура        - параметры записи, см. справочную информацию по событиям управляемой формы
//
Процедура ПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
	//++ Локализация
	СобытияФормИСКлиент.ПослеЗаписи(Форма, ПараметрыЗаписи);
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента"
		Или Форма.ИмяФормы = "Справочник.НаборыУпаковок.Форма.ФормаЭлемента" Тогда
		ПользовательРазрешилРедактирование = ИнтеграцияИСУТКлиент.ПользовательРазрешилРедактированиеРеквизита(Форма);
		ИнтеграцияИСУТКлиентСервер.НастройкаЭлементовВидаУпаковки(Форма, ПользовательРазрешилРедактирование, Ложь);
	КонецЕсли;
	Если Форма.ИмяФормы = "Справочник.НаборыУпаковок.Форма.ФормаЭлемента" Тогда
		Оповестить("Запись_НаборУпаковок", ПараметрыЗаписи, Форма);
	КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ	- Булево - признак отказа от открытия формы.
//
Процедура ПриОткрытии(Форма, Отказ) Экспорт
	
	//++ Локализация
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента"
		Или Форма.ИмяФормы = "Справочник.НаборыУпаковок.Форма.ФормаЭлемента" Тогда
		
		ПользовательРазрешилРедактирование = ИнтеграцияИСУТКлиент.ПользовательРазрешилРедактированиеРеквизита(Форма);
		ИнтеграцияИСУТКлиентСервер.НастройкаЭлементовВидаУпаковки(Форма, ПользовательРазрешилРедактирование, Ложь);
		
	КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

#Область СобытияЭлементовФорм

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
// Параметры:
//   Форма                   - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//   Элемент                 - Произвольный     - источник события "При изменении":
//    *Имя                    - Строка           - имя источника события "При изменении"
//   ДополнительныеПараметры - Структура        - значения дополнительных параметров влияющих на обработку.
//
Процедура ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	СобытияФормИСКлиент.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента"
		Или Форма.ИмяФормы = "Справочник.НаборыУпаковок.Форма.ФормаЭлемента" Тогда
		
		РедактированиеРеквизитовРазрешено = Истина;
		
		ЭтоФормаНабораУпаковок = Форма.ИмяФормы = "Справочник.НаборыУпаковок.Форма.ФормаЭлемента";
		
		Если Элемент.Имя = "ИспользованиеУпаковокИндивидуальныйНабор"
			Или Элемент.Имя = "ИспользованиеУпаковокОбщийНабор"
			Или Элемент.Имя = "ИспользоватьУпаковки" Тогда
			ИнтеграцияИСУТКлиентСервер.УправлениеРеквизитамиУпаковокПриПереключенииИспользованияНабораУпаковок(Форма, РедактированиеРеквизитовРазрешено);
		КонецЕсли;
		
		Если Элемент.Имя = "ПотребительскаяУпаковкаИС"
			Или Элемент.Имя = "УпаковкаЧастичногоВыбытияИС"
			Или Элемент.Имя = "ИспользуетсяЧастичноеВыбытиеИС"
			Или Элемент.Имя = "ЕдиницаИзмерения" И ЭтоФормаНабораУпаковок Тогда
			ИнтеграцияИСУТКлиентСервер.НастройкаЭлементовВидаУпаковки(Форма, РедактированиеРеквизитовРазрешено, ЭтоФормаНабораУпаковок);
		КонецЕсли;
		
		Если Элемент.Имя = "ИспользоватьУпаковки"  Тогда
			ИнтеграцияИСУТКлиентСервер.УправлениеПризнакомИспользованияЧастичногоВыбытия(Форма);
		КонецЕсли;
		
		Если Элемент.Имя = "ПотребительскаяУпаковкаИС"
			Или Элемент.Имя = "УпаковкаЧастичногоВыбытияИС"
			Или Элемент.Имя = "ИспользуетсяЧастичноеВыбытиеИС" Тогда
			ИнтеграцияИСУТКлиентСервер.ОбработкаИзмененияПолейУпаковок(Форма, Элемент.Имя);
		КонецЕсли;
		
		Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента"
				И ТипЗнч(Форма.ПараметрыСоздания) = Тип("ФиксированнаяСтруктура")
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.ПараметрыСоздания, "УчетнаяЗапись") Тогда
			МодульИнтеграцияСМаркетплейсамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияСМаркетплейсамиКлиент");
			МодульИнтеграцияСМаркетплейсамиКлиент.ОбработкаИзмененияПолей(Форма, Элемент, ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "РегистрСведений.ШтрихкодыНоменклатуры.Форма.ФормаЗаписи" Тогда
		Если Элемент.Имя = "ВидУпаковкиИС"  Тогда
			Если Форма.ВидУпаковкиИС = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Потребительская") Тогда
				Форма.КоличествоПотребительскихУпаковокИС = 1;
			ИначеЕсли Не ЗначениеЗаполнено(Форма.ВидУпаковкиИС)
				Или Форма.ВидУпаковкиИС = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор") Тогда
				Форма.КоличествоПотребительскихУпаковокИС = 0;
			КонецЕсли;
			ИнтеграцияИСУТКлиентСервер.УправлениеЭлементамиФормыШтрихкодаНоменклатуры(Форма);
		КонецЕсли;
		Если Элемент.Имя = "КоличествоПотребительскихУпаковокИС"  Тогда
			ИнтеграцияИСУТКлиентСервер.УправлениеЭлементамиФормыШтрихкодаНоменклатуры(Форма);
		КонецЕсли;
	КонецЕсли;
	
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
Процедура ПриВыбореЭлемента(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	
	//++ Локализация
	СобытияФормИСКлиент.ПриВыбореЭлемента(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ДополнительныеПараметры);
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
Процедура ПриАктивизацииЯчейки(Форма, Элемент, ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	СобытияФормИСКлиент.ПриАктивизацииЯчейки(Форма, Элемент, ДополнительныеПараметры);
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
Процедура ПриАктивизацииСтроки(Форма, Элемент, ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	СобытияФормИСКлиент.ПриАктивизацииСтроки(Форма, Элемент, ДополнительныеПараметры);
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события элемента.
//
Процедура ПриНачалеРедактирования(Форма, Элемент, НоваяСтрока, Копирование, ДополнительныеПараметры) Экспорт
	
	//++ Локализация
	СобытияФормИСКлиент.ПриНачалеРедактирования(Форма, Элемент, НоваяСтрока, Копирование, ДополнительныеПараметры);
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура НачалоВыбораЭлемента(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		Если Элемент.Имя = "КодТНВЭД" Тогда
			
			Объект = Форма.Объект;
			КлючВидовПродукции = Форма.КлючВидовПродукции;
			Если КлючВидовПродукции <> Неопределено Тогда
				
				Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияИСМП(КлючВидовПродукции, Истина) Тогда
					
					СтандартнаяОбработка = Ложь;
					
					ПараметрыФормы = Новый Структура;
					
					ПараметрыФормы.Вставить("ТекущаяСтрока",                           Объект.КодТНВЭД);
					ПараметрыФормы.Вставить("ВидПродукцииТоварнаяГруппа",              КлючВидовПродукции);
					ПараметрыФормы.Вставить("РежимВыбора",                             Истина);
					ПараметрыФормы.Вставить("ВозвращатьСсылкуНаЭлементКлассификатора", Истина);
					
					ОткрытьФорму("РегистрСведений.КодыТНВЭДИСМП.Форма.ФормаСписка", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
					
				ИначеЕсли КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияЗЕРНО(КлючВидовПродукции) Тогда
					
					СтандартнаяОбработка = Ложь;
					
					ПараметрыФормы = Новый Структура;
					
					ПараметрыФормы.Вставить("ТекущаяСтрока", Объект.КодТНВЭД);
					ВидыПродукции = ИнтеграцияЗЕРНОКлиентСервер.ВидыПродукции(КлючВидовПродукции);
					Если ВидыПродукции.Количество() Тогда
						ПараметрыФормы.Вставить("ВидПродукции", ВидыПродукции[0]);
					Иначе
						ПараметрыФормы.Вставить("ВидПродукции", КлючВидовПродукции);
					КонецЕсли;
					ПараметрыФормы.Вставить("РежимВыбора",                             Истина);
					ПараметрыФормы.Вставить("ВозвращатьСсылкуНаЭлементКлассификатора", Истина);
					ПараметрыФормы.Вставить("ОКПД2",                                   Объект.КодОКПД2);
					
					ОткрытьФорму(
						"РегистрСведений.ВидыСельскохозяйственныхКультурЗЕРНО.Форма.ФормаПодбораТНВЭД",
						ПараметрыФормы,
						Элемент,,,,,
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Элемент.Имя = "КодОКПД2" Тогда
			
			Объект = Форма.Объект;
			КлючВидовПродукции = Форма.КлючВидовПродукции;
			Если КлючВидовПродукции <> Неопределено Тогда
				
				Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияИСМП(КлючВидовПродукции, Истина) Тогда
					
					СтандартнаяОбработка = Ложь;
					
					ПараметрыФормы = Новый Структура;
					
					ПараметрыФормы.Вставить("ТекущаяСтрока",                           Объект.КодОКПД2);
					ПараметрыФормы.Вставить("ТНВЭД",                                   Объект.КодТНВЭД);
					ПараметрыФормы.Вставить("ВидПродукцииТоварнаяГруппа",              КлючВидовПродукции);
					ПараметрыФормы.Вставить("РежимВыбора",                             Истина);
					ПараметрыФормы.Вставить("ВозвращатьСсылкуНаЭлементКлассификатора", Истина);
					
					ОткрытьФорму("РегистрСведений.КодыОКПД2ИСМП.Форма.ФормаСписка",
						ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
						
				ИначеЕсли КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияЗЕРНО(КлючВидовПродукции) Тогда
					
					СтандартнаяОбработка = Ложь;
					
					ПараметрыФормы = Новый Структура;
					
					ПараметрыФормы.Вставить("ТекущаяСтрока", Объект.КодОКПД2);
					ВидыПродукции = ИнтеграцияЗЕРНОКлиентСервер.ВидыПродукции(КлючВидовПродукции);
					Если ВидыПродукции.Количество() Тогда
						ПараметрыФормы.Вставить("ВидПродукции", ВидыПродукции[0]);
					Иначе
						ПараметрыФормы.Вставить("ВидПродукции", КлючВидовПродукции);
					КонецЕсли;
					ПараметрыФормы.Вставить("РежимВыбора",                             Истина);
					ПараметрыФормы.Вставить("ВозвращатьСсылкуНаЭлементКлассификатора", Истина);
					
					ОткрытьФорму(
						"Справочник.КлассификаторНСИЗЕРНО.Форма.ФормаСпискаОКПД2",
						ПараметрыФормы,
						Элемент,,,,,
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

#КонецОбласти

Процедура Подключаемый_ПроверитьВыполнениеЗаданияИС() Экспорт
	//++ Локализация
	СоответствиеТребованиямГИСМТКлиент.ПроверитьВыполнениеЗадания(ЭтотОбъект);
	//-- Локализация
	Возврат;
КонецПроцедуры

// Функция возвращает имя события, требующего обновления гиперссылки проверки документов ГИС МТ.
// 
// Возвращаемое значение:
//  Строка - Имя события после пробития чека для обновления проверки ГИС МТ.
Функция ИмяСобытияПослеПробитияЧекаДляОбновленияПроверкиГИСМТ() Экспорт
	
	ИмяСобытия = "";
	
	// ++ Локализация
	ИмяСобытия = "ПробитиеЧекаПоПрикладномуДокументуГИСМТ";
	// -- Локализация
	Возврат ИмяСобытия;
	
КонецФункции

#КонецОбласти
