// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение = Истина Тогда
		
		ИспользоваласьДоставка25 = ДоставкаТоваров.ИспользоваласьДоставка25();
		
		Если ИспользоваласьДоставка25 Тогда
			
			Константы.НеИспользоватьУправлениеДоставкой20.Установить(Истина);
			Константы.НеИспользоватьУправлениеДоставкой25.Установить(Ложь);
			
		Иначе
			
			Константы.НеИспользоватьУправлениеДоставкой20.Установить(Ложь);
			Константы.НеИспользоватьУправлениеДоставкой25.Установить(Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли