Процедура ЗаполнитьЗначениямиПоУмолчанию() Экспорт

	ТаблицаКлассификатора = Справочники.КонтурЛогистика_КлассификаторПолномочийМЧД.ТаблицаКлассификатораПолномочийМЧД();
	
	Для каждого Стр Из ТаблицаКлассификатора Цикл
		
		Если Не ЗначениеЗаполнено(Справочники.КонтурЛогистика_КлассификаторПолномочийМЧД.НайтиПоРеквизиту("КодКлассификатора", Стр.КодКлассификатора)) Тогда
			НовоеПолномочие = Справочники.КонтурЛогистика_КлассификаторПолномочийМЧД.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НовоеПолномочие, Стр);
			НовоеПолномочие.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаКлассификатораПолномочийМЧД() Экспорт 
	
	ТаблицаКлассификатора = Новый ТаблицаЗначений;
	ТаблицаКлассификатора.Колонки.Добавить("КодКлассификатора", Новый ОписаниеТипов("Строка",,
		Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	ТаблицаКлассификатора.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,
		Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	ТаблицаКлассификатора.Колонки.Добавить("Мнемоника", Новый ОписаниеТипов("Строка",,
		Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	ТаблицаКлассификатора.Колонки.Добавить("ПолноеНаименование", Новый ОписаниеТипов("Строка",,
		Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
		
	Макет = Справочники.КонтурЛогистика_КлассификаторПолномочийМЧД.ПолучитьМакет("ДанныеКлассификатора");
	Область = Макет.ПолучитьОбласть("Классификатор");
	
	Для Сч = 1 По Область.ВысотаТаблицы Цикл
		
		Наименование = ПолучитьТекстЯчейкиОбласти(Область, Сч, 3);
		
		Если Не ЗначениеЗаполнено(Наименование) Или Наименование = "NAME" Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаТаблицы = ТаблицаКлассификатора.Добавить();
		
		НоваяСтрокаТаблицы.КодКлассификатора	= ПолучитьТекстЯчейкиОбласти(Область, Сч, 1);
		НоваяСтрокаТаблицы.Наименование			= Наименование;
		НоваяСтрокаТаблицы.Мнемоника			= ПолучитьТекстЯчейкиОбласти(Область, Сч, 2);
		НоваяСтрокаТаблицы.ПолноеНаименование	= ПолучитьТекстЯчейкиОбласти(Область, Сч, 4);
		
		
	КонецЦикла;
	
	Возврат ТаблицаКлассификатора;
	
КонецФункции

Функция ПолучитьТекстЯчейкиОбласти(Область, Строка, Колонка)
	
	Возврат Строка(Область.ПолучитьОбласть("R" + Формат(Строка, "ЧГ=0") + "C" + Формат(Колонка, "ЧГ=0")).ТекущаяОбласть.Текст);
	
КонецФункции