#Область ПрограммныйИнтерфейс

// Параметры:
//  ЭтотОбъект - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  ПроверяемыеРеквизиты - Массив из Строка - Проверяемые реквизиты
Процедура ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Экспорт 
	
	//++ Локализация
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Обработка проверки заполнения. Проверка заполнения кодов маркировки только осообщает о несоответствии,
	// но НЕ блокирует обработку документа.

	ОтказПроверки = Ложь;
	ПроверкаУникальностиМаркируемыхТоваров(ЭтотОбъект, ОтказПроверки);
	
	Если ОтказПроверки Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаЗаполненияМаркируемойПродукции(ЭтотОбъект, ОтказПроверки);
	
	//-- Локализация
	
КонецПроцедуры

// Установить условное оформление.
// 
// Параметры:
//  ФормаДокумента - ФормаКлиентскогоПриложения -
Процедура УстановитьУсловноеОформление(ФормаДокумента) Экспорт

	//++ Локализация
	ИмяРеквизитаПодбораМП = "КоманднаяПанельПроверкаИПодборПродукцииГосИС";
	ИмяРеквизитаКолонкиСтатусаМП = "ОтгружаемыеТоварыСтатусПроверкиГосИС";
	
	Если ФормаДокумента.Элементы.Найти(ИмяРеквизитаПодбораМП) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//
	
	ФормаДокумента.Элементы[ИмяРеквизитаПодбораМП].Видимость = 
		СкладскиеОперацииКонтроляМаркировки().НайтиПоЗначению(ФормаДокумента.Объект.СкладскаяОперация) <> Неопределено;
		
	//
	
	Если ФормаДокумента.Элементы.Найти(ИмяРеквизитаКолонкиСтатусаМП) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = ФормаДокумента.УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ФормаДокумента.Элементы[ИмяРеквизитаКолонкиСтатусаМП].Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СкладскаяОперация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборЭлемента.ПравоеЗначение = СкладскиеОперацииКонтроляМаркировки();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	//-- Локализация
	
КонецПроцедуры

#Область МаркируемаяПродукция

// Определяет ведение учета маркируемой продукции.
// 
// Возвращаемое значение:
//  Булево - Используется маркируемая продукция
Функция ИспользуетсяМаркируемаяПродукция() Экспорт
	
	Возврат СкладыЛокализация.ИспользуетсяМаркируемаяПродукция();
	
КонецФункции

Процедура ЗаполнитьКешШтрихкодовУпаковок(Форма, Настройки = Неопределено, Инициализация = Ложь) Экспорт
	
	//++ Локализация
	Если Настройки = Неопределено Тогда
		Настройки = ПроверкаИПодборПродукцииИСМПУТ.НастройкиИсточникаКешаРасходногоОрдера();
	КонецЕсли;
	ПроверкаИПодборПродукцииИС.ЗаполнитьКешШтрихкодовУпаковок(Форма, Настройки, Инициализация);
	//-- Локализация
	
КонецПроцедуры

// Установить признак использования маркируемой продукции.
// 
// Параметры:
//  Форма - см. СкладыЛокализация.УстановитьПризнакИспользованияМаркируемойПродукции.Форма
Процедура УстановитьПризнакИспользованияМаркируемойПродукции(Форма) Экспорт
	
	СкладыЛокализация.УстановитьПризнакИспользованияМаркируемойПродукции(Форма);
	
КонецПроцедуры

// Определение признака поэкземплярного учета продукции на дату.
// 
// Параметры:
//  ВидПродукции         - Произвольный - вид продукции
//  НаДату               - Дата - дата контроля
//  ВедетсяПоштучныйУчет - Булево - Истина, если ведется поэкземплярный учет марок продукции.
Процедура ОпределениеПризнакаПоэкземплярногоУчетаПродукцииНаДату(ВидПродукции, НаДату, ВедетсяПоштучныйУчет) Экспорт
	
	ВедетсяПоштучныйУчет = Ложь;
	//++ Локализация
	ВедетсяПоштучныйУчет = ИнтеграцияИСУТ.ДействуетПоэкземплярныйУчетПродукцииНаДату(ВидПродукции, НаДату);
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонтрольЗаполнения

//++ Локализация

#Область КонтрольНоменклатурыПоРаспоряжениям

// Контроль товарного состава распоряжений. На текущий момент действует ограничение:
// одна номенклатурная позиция ордера может присутствовать только в одном распоряжении этого ордера.
// Параметры:
//	ДокументОбъект - ДокументОбъект.РасходныйОрдерНаТовары
//	Отказ - Булево - возвращаемый параметр
Процедура ПроверкаУникальностиМаркируемыхТоваров(ДокументОбъект, Отказ)
	
	Ошибки = Неопределено;
	
	КонтрольныеТипыДокументов = ТипыДокументовБезПовторенияТоваров();
	
	ИмяТаблицыТовары = "ТоварыПоРаспоряжениям";
	
	ЗапросМаркируемыхТоваров = Новый Запрос;
	ЗапросМаркируемыхТоваров.УстановитьПараметр("Ссылка", ДокументОбъект[ИмяТаблицыТовары].Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	ЗапросМаркируемыхТоваров.УстановитьПараметр("ВидыПродукции", ОбщегоНазначенияИСМП.ВидыПродукцииОбязательнойМаркировки());
	
	ЗапросМаркируемыхТоваров.Текст = 
	"ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|	ПО ОписаниеНоменклатурыИС.Номенклатура = СправочникНоменклатура.Ссылка
	|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ В (&ВидыПродукции)
	|ГДЕ
	|	СправочникНоменклатура.Ссылка В(&Ссылка)";
	ПроверяемыеТовары = ЗапросМаркируемыхТоваров.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если ПроверяемыеТовары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыУказанияСерий = Документы[ДокументОбъект.Ссылка.Метаданные().Имя].ПараметрыУказанияСерий(ДокументОбъект)[ИмяТаблицыТовары];
	
	Для каждого ПроверяемыйТовар Из ПроверяемыеТовары Цикл
		
		ОтборПоТоварам = Новый Структура("Номенклатура",ПроверяемыйТовар);
		СтрокиТаблицы = ДокументОбъект[ИмяТаблицыТовары].НайтиСтроки(ОтборПоТоварам);
		Для каждого СтрокаТовары Из СтрокиТаблицы Цикл
		
			ПроверитьСерии =
				Не НоменклатураКлиентСервер.ВЭтомСтатусеСерииНеУказываются(СтрокаТовары.СтатусУказанияСерий, ПараметрыУказанияСерий)
				И НоменклатураКлиентСервер.ВЭтомСтатусеСерииУказываютсяВТЧТовары(СтрокаТовары, ПараметрыУказанияСерий);
			ОтборПоПолям = ИнтеграцияИС.ПоляПоискаМаркируемойПродукции(ПроверитьСерии);
			ЗаполнитьЗначенияСвойств(ОтборПоПолям, СтрокаТовары);
			
			СтрокиТоваров = ДокументОбъект[ИмяТаблицыТовары].НайтиСтроки(ОтборПоПолям);	// массив из СтрокаТабличнойЧасти
			ЗначимыеРаспоряжения = Новый Массив;
			Для каждого Элем Из СтрокиТоваров Цикл
				
				ТекРаспоряжение = Элем.Распоряжение;
				Если КонтрольныеТипыДокументов.Найти(ТипЗнч(ТекРаспоряжение)) = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				
				Если ЗначимыеРаспоряжения.Найти(ТекРаспоряжение) = Неопределено Тогда
					ЗначимыеРаспоряжения.Добавить(ТекРаспоряжение);
				КонецЕсли; 
				
				Если ЗначимыеРаспоряжения.Количество() > 1 Тогда
					
					Шаблон = НСтр("ru = 'Одинаковый товар %1 в распоряжениях %2 и %3'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						Шаблон,
						Элем.Номенклатура,
						ЗначимыеРаспоряжения[0],
						ЗначимыеРаспоряжения[1]);
					
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
						Ошибки,
						СтрШаблон("Объект.%1[%%1].Распоряжение",ИмяТаблицыТовары),
						ТекстОшибки,
						"",
						Элем.НомерСтроки-1);
						
					ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
					
					Возврат;
		
				КонецЕсли;
				
			КонецЦикла; 
		
		КонецЦикла; 
	
	КонецЦикла; 
			
КонецПроцедуры

Функция ТипыДокументовБезПовторенияТоваров()

	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	
	Возврат ТипыДокументов;
	
КонецФункции // ТипыДокументовБезПовторенияТоваров()

#КонецОбласти 

#Область СопоставлениеКоличестваМарок
	
// Параметры:
//	ДокументОбъект - ДокументОбъект.РасходныйОрдерНаТовары
//	Отказ - Булево
Процедура ПроверкаЗаполненияМаркируемойПродукции(ДокументОбъект, Отказ)
	
	СтатусыКонтроля = СтатусыКонтроляМаркировки();
	СкладскиеОперацииКонтроля = СкладскиеОперацииКонтроляМаркировки(); 
	Если СкладскиеОперацииКонтроля.Найти(ДокументОбъект.СкладскаяОперация) = Неопределено
		ИЛИ СтатусыКонтроля.Найти(ДокументОбъект.Статус) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияИСМП.ИспользуетсяМаркируемаяПродукция() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоРозница = ДокументОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаВРозницу;
	ПараметрыТоваров = Новый Структура;
	ПараметрыТоваров.Вставить("ИмяТаблицыТовары","ТоварыПоРаспоряжениям");
	ПараметрыТоваров.Вставить("ИмяПоляТовары","Номенклатура");
	ПараметрыТоваров.Вставить("ИмяПараметраУказанияСерий","ТоварыПоРаспоряжениям");
	ИнтеграцияИСУТ.ПроверитьЗаполнениеАкцизныхМарок(ДокументОбъект, Отказ,, ПараметрыТоваров,, Не ЭтоРозница);
	
КонецПроцедуры

Функция СтатусыКонтроляМаркировки()
	
	СтатусыКонтроля = Новый Массив;
	СтатусыКонтроля.Добавить(Перечисления.СтатусыРасходныхОрдеров.Проверен);
	СтатусыКонтроля.Добавить(Перечисления.СтатусыРасходныхОрдеров.КОтгрузке);
	СтатусыКонтроля.Добавить(Перечисления.СтатусыРасходныхОрдеров.Отгружен);
	
	Возврат СтатусыКонтроля;
	
КонецФункции

Функция СкладскиеОперацииКонтроляМаркировки()

	СкладскиеОперацииКонтроля = Новый Массив;
	СкладскиеОперацииКонтроля.Добавить(Перечисления.СкладскиеОперации.КонтрольОтгрузки);
	СкладскиеОперацииКонтроля.Добавить(Перечисления.СкладскиеОперации.ОтгрузкаКлиенту);
	СкладскиеОперацииКонтроля.Добавить(Перечисления.СкладскиеОперации.ОтгрузкаПоВозвратуПоставщику);
	СкладскиеОперацииКонтроля.Добавить(Перечисления.СкладскиеОперации.ОтгрузкаВРозницу);
	
	Возврат СкладскиеОперацииКонтроля;
	
КонецФункции

#КонецОбласти 

//-- Локализация

#КонецОбласти

#КонецОбласти
