// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  ЭлектронныйДокумент - см. ПакетыДокументовЭДО.ИдентификаторПакетаДокумента.ЭлектронныйДокумент
// 
// Возвращаемое значение:
//  См. ПакетыДокументовЭДО.ИдентификаторПакетаДокумента
Функция ИдентификаторПакетаДокумента(ЭлектронныйДокумент) Экспорт
	Возврат ПакетыДокументовЭДО.ИдентификаторПакетаДокумента(ЭлектронныйДокумент);
КонецФункции

// Параметры:
//  ИдентификаторПакета - Строка
// 
// Возвращаемое значение:
//  См. ПакетыДокументовЭДО.ДокументыПакета
Функция ДокументыПакета(ИдентификаторПакета) Экспорт
	Возврат ПакетыДокументовЭДО.ДокументыПакета(Новый УникальныйИдентификатор(ИдентификаторПакета));
КонецФункции

// Параметры:
//  ИдентификаторПакета - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоЗакрытыйПакет(ИдентификаторПакета) Экспорт
	Возврат ПакетыДокументовЭДО.ЭтоЗакрытыйПакет(Новый УникальныйИдентификатор(ИдентификаторПакета));
КонецФункции

#КонецОбласти
