#Область ПрограммныйИнтерфейс

// Правила поиска дублей НСИ при создании на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
Процедура ПравилаПоискаДублейНСИ_ПриСозданииНаСервере(Форма, Отказ) Экспорт
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	ЭтоПравилоПоНастройкамУникальностиНоменклатуры = Ложь;
	Если Объект.Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Номенклатура_ПоНастройкамУникальностиВидаНоменклатуры
		Или Объект.Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_ХарактеристикиНоменклатуры_ПоНастройкамУникальностиВидаНоменклатуры Тогда 
		ЭтоПравилоПоНастройкамУникальностиНоменклатуры = Истина;
	КонецЕсли;
	Элементы.ТекстЗапроса.Доступность = Не ЭтоПравилоПоНастройкамУникальностиНоменклатуры;
	Элементы.ГруппаЗапросКнопки.Доступность = Не ЭтоПравилоПоНастройкамУникальностиНоменклатуры;
	Элементы.ДекорацияПравилоПоНастройкамУникальности.Видимость = ЭтоПравилоПоНастройкамУникальностиНоменклатуры;
	Элементы.ОбъектМетаданных.Доступность = Не Объект.Предопределенный;
КонецПроцедуры

// См. Справочники.ПравилаПоискаДублейНСИ.СформироватьЗапросПоПравилу
// 
Функция СформироватьЗапросПоПравилу(Правило, ТолькоНовыеДубли = Истина, Объекты = Неопределено) Экспорт
	Если Правило = Справочники.ПравилаПоискаДублейНСИ.Справочник_Номенклатура_ПоНастройкамУникальностиВидаНоменклатуры Тогда
		ИмяТаблицыСправочника = "Номенклатура";
		ИмяТЧРеквизитыДляКонтроля = "РеквизитыДляКонтроляНоменклатуры";
	Иначе
		ИмяТаблицыСправочника = "ХарактеристикиНоменклатуры";
		ИмяТЧРеквизитыДляКонтроля = "РеквизитыДляКонтроляХарактеристик";
	КонецЕсли;
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВидНоменклатуры.Ссылка КАК Ссылка,
	|	ВидНоменклатуры.Ссылка.Наименование КАК Наименование,
	|	ВидНоменклатуры.ИмяРеквизита КАК ИмяРеквизита,
	|	ВидНоменклатуры.Свойство КАК Свойство
	|ИЗ
	|	Справочник.ВидыНоменклатуры.РеквизитыДляКонтроляНоменклатуры КАК ВидНоменклатуры
	|ГДЕ
	|	ВидНоменклатуры.Уникален
	|	И ВидНоменклатуры.ИмяРеквизита <> ""Штрихкод""";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РеквизитыДляКонтроляНоменклатуры", ИмяТЧРеквизитыДляКонтроля);
	Запрос.Текст = ТекстЗапроса;
	РеквизитыКонтроляУникальности = Запрос.Выполнить().Выгрузить();
	Если РеквизитыКонтроляУникальности.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК Дубль,
		|	НЕОПРЕДЕЛЕНО КАК Ссылка1,
		|	НЕОПРЕДЕЛЕНО КАК Код,
		|	НЕОПРЕДЕЛЕНО КАК Группа
		|ГДЕ
		|	ЛОЖЬ";
		Возврат Запрос;
	КонецЕсли;

	ВидыНоменклатуры = РеквизитыКонтроляУникальности.Скопировать();
	ВидыНоменклатуры.Свернуть("Ссылка, Наименование");
	
	НомерЗапроса = 1;
	
	ТекстыЗапросов = Новый Массив;
	ИтоговыйЗапрос = Новый Массив;
	ИндексПараметровСвойств = 1;
	Запрос = Новый Запрос;
	Для Каждого ВидНоменклатуры Из ВидыНоменклатуры Цикл
		ЕстьУникальныеСвойства = Ложь;
		СтруктураПоиска = Новый Структура("Ссылка", ВидНоменклатуры.Ссылка);
		Реквизиты = РеквизитыКонтроляУникальности.НайтиСтроки(СтруктураПоиска);
		Для Каждого Реквизит Из Реквизиты Цикл
			Если ЗначениеЗаполнено(Реквизит.Свойство) Тогда
				ЕстьУникальныеСвойства = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьУникальныеСвойства Тогда
			ТекстЗапросаПоВидуНоменклатуры = 
			"ВЫБРАТЬ
			|	Справочник.ВидНоменклатуры КАК ВидНоменклатуры,
			|	Справочник.Ссылка КАК Ссылка,
			|	ИСТИНА
			|ПОМЕСТИТЬ ВидНоменклатурыНомерЗапроса
			|ИЗ
			|	Справочник.Номенклатура КАК Справочник
			|	// Соединения
			|ГДЕ
			|	Справочник.ВидНоменклатуры = &ВидНоменклатурыНомерЗапроса";
			Соединения = Новый Массив;
			Индекс = 0;
			ПоляВыбора = Новый Массив;
			Для Каждого Реквизит Из Реквизиты Цикл
				Если Не ЗначениеЗаполнено(Реквизит.Свойство) Тогда
					Продолжить;
				КонецЕсли;
				Индекс = Индекс + 1;
				Соединение = "ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДопРеквизитыИндекс 
				|	ПО Справочник.Ссылка = ДопРеквизитыИндекс.Ссылка
				|		И ДопРеквизитыИндекс.Свойство = &СвойствоИндексПараметровСвойств";
				ИмяПараметра = СтрШаблон("Свойство%1", ИндексПараметровСвойств);
				Соединение = СтрЗаменить(Соединение, "Номенклатура", ИмяТаблицыСправочника);
				Соединение = СтрЗаменить(Соединение, "&СвойствоИндексПараметровСвойств", "&" + ИмяПараметра);
				Соединение = СтрЗаменить(Соединение, "ДопРеквизитыИндекс", СтрШаблон("ДопРеквизиты%1", Индекс));
				Соединения.Добавить(Соединение);
				Запрос.УстановитьПараметр(ИмяПараметра, Реквизит.Свойство);
				ИндексПараметровСвойств = ИндексПараметровСвойств + 1;
				ШаблонПолейВыбора = "
				|	ДопРеквизитыИндекс.Свойство КАК СвойствоИндекс,
				|	ДопРеквизитыИндекс.Значение КАК ЗначениеИндекс";
				ШаблонПолейВыбора = СтрЗаменить(ШаблонПолейВыбора, "СвойствоИндекс", СтрШаблон("Свойство%1", Индекс));
				ШаблонПолейВыбора = СтрЗаменить(ШаблонПолейВыбора, "ЗначениеИндекс", СтрШаблон("Значение%1", Индекс));
				ШаблонПолейВыбора = СтрЗаменить(ШаблонПолейВыбора, "ДопРеквизитыИндекс", СтрШаблон("ДопРеквизиты%1", Индекс)); 
				ПоляВыбора.Добавить(ШаблонПолейВыбора);
			КонецЦикла;
			ИмяПараметра = СтрШаблон("ВидНоменклатуры%1",НомерЗапроса);
			ТекстЗапросаПоВидуНоменклатуры = СтрЗаменить(ТекстЗапросаПоВидуНоменклатуры, 
			"ИСТИНА",
			СтрСоединить(ПоляВыбора, ",
			|	"));
			ТекстЗапросаПоВидуНоменклатуры = СтрЗаменить(ТекстЗапросаПоВидуНоменклатуры,
			"Номенклатура",
			ИмяТаблицыСправочника);
			ТекстЗапросаПоВидуНоменклатуры = СтрЗаменить(ТекстЗапросаПоВидуНоменклатуры,
			"ВидНоменклатурыНомерЗапроса",
			ИмяПараметра);
			ТекстЗапросаПоВидуНоменклатуры = СтрЗаменить(ТекстЗапросаПоВидуНоменклатуры,
			"// Соединения",
			СтрСоединить(Соединения,"
			|
			|"));
			ТекстыЗапросов.Добавить(ТекстЗапросаПоВидуНоменклатуры);
			
			ТекстИтоговогоЗапроса = 
			"ВЫБРАТЬ
			|	НСИДубль.Ссылка КАК Дубль,
			|	НСИОригинал.Ссылка КАК Ссылка1,
			|	НЕОПРЕДЕЛЕНО КАК Код,
			|	""ПредставлениеГруппы"" КАК Группа
			|ИЗ
			|	ВидНоменклатурыНомерЗапроса КАК НСИОригинал
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВидНоменклатурыНомерЗапроса КАК НСИДубль
			|		ПО НЕ НСИОригинал.Ссылка = НСИДубль.Ссылка
			|			И НСИОригинал.Ссылка.Владелец = НСИДубль.Ссылка.Владелец
			|			// Соединения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИ КАК ДублиНСИОригинал
			|		ПО ДублиНСИОригинал.Оригинал = НСИОригинал.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИ КАК ДублиНСИДубль
			|		ПО ДублиНСИДубль.Дубль = НСИОригинал.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИ КАК ДублиНСИОригинал1
			|		ПО ДублиНСИОригинал1.Оригинал = НСИДубль.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИ КАК ДублиНСИДубль1
			|		ПО ДублиНСИДубль1.Дубль = НСИДубль.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждениюОригинал
			|		ПО ДублиНСИКПодтверждениюОригинал.Дубль = НСИОригинал.Ссылка
			|			И &ТолькоНовыеДубли
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждениюДубль
			|		ПО ДублиНСИКПодтверждениюДубль.Дубль = НСИДубль.Ссылка
			|			И &ТолькоНовыеДубли
			|ГДЕ
			|	(ДублиНСИОригинал.Оригинал ЕСТЬ NULL
			|		И ДублиНСИДубль.Оригинал ЕСТЬ NULL
			|		И ДублиНСИОригинал.Дубль ЕСТЬ NULL
			|		И ДублиНСИДубль.Дубль ЕСТЬ NULL
			|		И ДублиНСИОригинал1.Оригинал ЕСТЬ NULL
			|		И ДублиНСИДубль1.Оригинал ЕСТЬ NULL
			|		И ДублиНСИОригинал1.Дубль ЕСТЬ NULL
			|		И ДублиНСИДубль1.Дубль ЕСТЬ NULL)
			|	И ВЫБОР КОГДА
			|		&ТолькоНовыеДубли 
			|	ТОГДА
			|		ДублиНСИКПодтверждениюОригинал.Дубль ЕСТЬ NULL
			|				И ДублиНСИКПодтверждениюДубль.Дубль ЕСТЬ NULL
			|	ИНАЧЕ ИСТИНА
			|	КОНЕЦ
			|	И ИСТИНА";
			
			Соединения = Новый Массив;
			Запрос.УстановитьПараметр("ТолькоНовыеДубли", ТолькоНовыеДубли);
			ШаблонСоединенияПоРеквизитам = "НСИОригинал.Ссылка.%1 = НСИДубль.Ссылка.%1";
			ШаблонСоединенияПоДопРеквизитам = "
			|	НСИОригинал.Свойство%1 = НСИДубль.Свойство%1
			|	И НСИОригинал.Значение%1 = НСИДубль.Значение%1";
			Индекс = 0;
			ЗначенияПолей = Новый Массив;
			Для Каждого Реквизит Из Реквизиты Цикл
				Если Не ЗначениеЗаполнено(Реквизит.Свойство) Тогда
					Если Метаданные.Справочники[ИмяТаблицыСправочника].Реквизиты.Найти(Реквизит.ИмяРеквизита) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					Соединения.Добавить(СтрШаблон(ШаблонСоединенияПоРеквизитам, Реквизит.ИмяРеквизита));
				Иначе
					Индекс = Индекс + 1;
					Соединения.Добавить(СтрШаблон(ШаблонСоединенияПоДопРеквизитам, Индекс));
				КонецЕсли;
				ЗначенияПолей.Добавить(Строка(Реквизит.Свойство));
			КонецЦикла;
			ГруппаДублей = ВидНоменклатуры.Наименование + " (%1)";
			ГруппаДублей = СтрШаблон(ГруппаДублей, СтрСоединить(ЗначенияПолей, ", "));
			Если ИмяТаблицыСправочника = "Номенклатура" Тогда
				ТекстИтоговогоЗапроса = СтрЗаменить(ТекстИтоговогоЗапроса, 
					"И НСИОригинал.Ссылка.Владелец = НСИДубль.Ссылка.Владелец",
					"");
			КонецЕсли;
			ТекстИтоговогоЗапроса = СтрЗаменить(ТекстИтоговогоЗапроса, "ВидНоменклатурыНомерЗапроса", ИмяПараметра);
			ТекстИтоговогоЗапроса = СтрЗаменить(ТекстИтоговогоЗапроса, "ПредставлениеГруппы", ГруппаДублей);
			ТекстИтоговогоЗапроса = СтрЗаменить(ТекстИтоговогоЗапроса, "// Соединения", " И " + СтрСоединить(Соединения,"
			|	И "));
			
			Если ИмяТаблицыСправочника = "Номенклатура" Тогда
				ТекстИтоговогоЗапроса = СтрЗаменить(ТекстИтоговогоЗапроса, "НЕОПРЕДЕЛЕНО", "НСИОригинал.Ссылка.Код");
			КонецЕсли;
			Если Не Объекты = Неопределено Тогда
				Запрос.УстановитьПараметр("Объекты", Объекты);
				ТекстИтоговогоЗапроса = СтрЗаменить(ТекстИтоговогоЗапроса, "ИСТИНА",
				"НСИОригинал.Ссылка В (&Объекты) И НСИДубль.Ссылка В (&Объекты)");
			КонецЕсли;
			Запрос.УстановитьПараметр(ИмяПараметра, ВидНоменклатуры.Ссылка);
			ИтоговыйЗапрос.Добавить(ТекстИтоговогоЗапроса);
		Иначе
			ТекстЗапросаПоВидуНоменклатуры = 
			"ВЫБРАТЬ
			|	НСИДубль.Ссылка КАК Дубль,
			|	НСИОригинал.Ссылка КАК Ссылка1,
			|	НЕОПРЕДЕЛЕНО КАК Код,
			|	""ПредставлениеГруппы"" КАК Группа
			|ИЗ
			|	Справочник.Номенклатура КАК НСИОригинал
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НСИДубль
			|		ПО НЕ НСИОригинал.Ссылка = НСИДубль.Ссылка
			|			И НСИОригинал.Ссылка.Владелец = НСИДубль.Ссылка.Владелец
			|			// Соединения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИ КАК ДублиНСИОригинал
			|		ПО ДублиНСИОригинал.Оригинал = НСИОригинал.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИ КАК ДублиНСИДубль
			|		ПО ДублиНСИДубль.Дубль = НСИОригинал.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИ КАК ДублиНСИОригинал1
			|		ПО ДублиНСИОригинал1.Оригинал = НСИДубль.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИ КАК ДублиНСИДубль1
			|		ПО ДублиНСИДубль1.Дубль = НСИДубль.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждениюОригинал
			|		ПО ДублиНСИКПодтверждениюОригинал.Дубль = НСИОригинал.Ссылка
			|			И &ТолькоНовыеДубли
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждениюДубль
			|		ПО ДублиНСИКПодтверждениюДубль.Дубль = НСИДубль.Ссылка
			|			И &ТолькоНовыеДубли
			|ГДЕ
			|	НСИОригинал.ВидНоменклатуры = &ВидНоменклатурыНомерЗапроса
			|	И ((ДублиНСИОригинал.Оригинал ЕСТЬ NULL
			|		И ДублиНСИДубль.Оригинал ЕСТЬ NULL
			|		И ДублиНСИОригинал.Дубль ЕСТЬ NULL
			|		И ДублиНСИДубль.Дубль ЕСТЬ NULL
			|		И ДублиНСИОригинал1.Оригинал ЕСТЬ NULL
			|		И ДублиНСИДубль1.Оригинал ЕСТЬ NULL
			|		И ДублиНСИОригинал1.Дубль ЕСТЬ NULL
			|		И ДублиНСИДубль1.Дубль ЕСТЬ NULL)
			|	И ВЫБОР КОГДА
			|		&ТолькоНовыеДубли 
			|	ТОГДА
			|		ДублиНСИКПодтверждениюОригинал.Дубль ЕСТЬ NULL
			|				И ДублиНСИКПодтверждениюДубль.Дубль ЕСТЬ NULL
			|	ИНАЧЕ ИСТИНА
			|	КОНЕЦ)
			|	И ИСТИНА";
			Запрос.УстановитьПараметр("ТолькоНовыеДубли", ТолькоНовыеДубли);
			Соединения = Новый Массив;
			ТекстЗапросаПоВидуНоменклатуры = СтрЗаменить(ТекстЗапросаПоВидуНоменклатуры, "Номенклатура", ИмяТаблицыСправочника);
			ЗначенияПолей = Новый Массив;
			Для Каждого Реквизит Из Реквизиты Цикл
				Если Метаданные.Справочники[ИмяТаблицыСправочника].Реквизиты.Найти(Реквизит.ИмяРеквизита) = Неопределено Тогда
					Продолжить;
				Иначе 
					МетаданныеРеквизита = Метаданные.Справочники[ИмяТаблицыСправочника].Реквизиты[Реквизит.ИмяРеквизита];
					ЗначенияПолей.Добавить(МетаданныеРеквизита.Синоним);
				КонецЕсли;
				Соединение = "НСИОригинал.Ссылка = НСИДубль.Ссылка";
				Соединения.Добавить(СтрЗаменить(Соединение, "Ссылка", Реквизит.ИмяРеквизита));
			КонецЦикла;
			ГруппаДублей = ВидНоменклатуры.Наименование + " (%1)";
			ГруппаДублей = СтрШаблон(ГруппаДублей, СтрСоединить(ЗначенияПолей, ", "));
			ТекстЗапросаПоВидуНоменклатуры = СтрЗаменить(ТекстЗапросаПоВидуНоменклатуры, "ПредставлениеГруппы", ГруппаДублей);
			Если ИмяТаблицыСправочника = "Номенклатура" Тогда
				ТекстЗапросаПоВидуНоменклатуры = СтрЗаменить(ТекстЗапросаПоВидуНоменклатуры, 
					"И НСИОригинал.Ссылка.Владелец = НСИДубль.Ссылка.Владелец",
					"");
				ТекстЗапросаПоВидуНоменклатуры = СтрЗаменить(ТекстЗапросаПоВидуНоменклатуры,
					"НЕОПРЕДЕЛЕНО",
					"НСИОригинал.Код");
			КонецЕсли;
			Соединения = СтрСоединить(Соединения, "
			|		И ");
			ИмяПараметра = СтрШаблон("ВидНоменклатуры%1", НомерЗапроса);
			ТекстЗапросаПоВидуНоменклатуры = СтрЗаменить(ТекстЗапросаПоВидуНоменклатуры, "// Соединения", "И " + Соединения);
			ТекстЗапросаПоВидуНоменклатуры = СтрЗаменить(ТекстЗапросаПоВидуНоменклатуры, "&ВидНоменклатурыНомерЗапроса", "&"+ИмяПараметра);
			ИтоговыйЗапрос.Добавить(ТекстЗапросаПоВидуНоменклатуры);
			
			Запрос.УстановитьПараметр(ИмяПараметра, ВидНоменклатуры.Ссылка);
			Если Не Объекты = Неопределено Тогда
				Запрос.УстановитьПараметр("Объекты", Объекты);
				ТекстИтоговогоЗапроса = СтрЗаменить(ТекстИтоговогоЗапроса, "ИСТИНА",
				"НСИОригинал.Ссылка В (&Объекты) И НСИДубль.Ссылка В (&Объекты)");
			КонецЕсли;
		КонецЕсли;
		
		НомерЗапроса = НомерЗапроса + 1;
	КонецЦикла;
	ИтоговыйЗапрос = СтрСоединить(ИтоговыйЗапрос, "
		|
		|	ОБЪЕДИНИТЬ
		|");
	ТекстыЗапросов.Добавить(ИтоговыйЗапрос);
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, "
	|
	|;
	|");
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос;
КонецФункции

// Заполнить поставляемое правило.
// 
// Параметры:
//  Объект - СправочникСсылка.ПравилаПоискаДублейНСИ
//
Процедура ЗаполнитьПоставляемоеПравило(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.ПравилаПоискаДублейНСИ") Тогда
		Объект = Объект.ПолучитьОбъект();
	КонецЕсли;
	
	Если (Объект.Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Номенклатура_ПоНастройкамУникальностиВидаНоменклатуры 
		Или Объект.Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_ХарактеристикиНоменклатуры_ПоНастройкамУникальностиВидаНоменклатуры)
		И Не Объект.Переопределяемое Тогда
		Объект.Переопределяемое = Истина;
	КонецЕсли;
	ТекстЗапроса = ТекстЗапросаПоставляемогоПравила(Объект.Ссылка);
	Описание = ОписаниеПоставляемогоПравила(Объект.Ссылка);
	Наименование = НаименованиеПоставляемогоПравила(Объект.Ссылка);
	Идентификатор = ОбъектМетаданныхПоставляемогоПравила(Объект.ИмяПредопределенныхДанных);

	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("ТекстЗапроса", ТекстЗапроса);
	Объект.Запрос = Новый ХранилищеЗначения(СтруктураЗапроса, Новый СжатиеДанных(9));
	Объект.ОбъектМетаданных = Идентификатор;
	Объект.Описание = Описание;
	Объект.Наименование = Наименование;
КонецПроцедуры

// Текст запроса поставляемого правила.
// 
// Параметры:
//  Ссылка - СправочникСсылка.ПравилаПоискаДублейНСИ - Ссылка
// 
// Возвращаемое значение:
//  Строка - Текст запроса поставляемого правила
Функция ТекстЗапросаПоставляемогоПравила(Ссылка) Экспорт
	ТекстЗапроса = "";
	Если Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Контрагенты_СовпадаетИННКПП Тогда
		ТекстЗапроса = ТекстЗапроса_ПравилаПоискаДублей_Контрагенты_СовпадаетИННКПП();
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Партнеры_СовпадаетКонтактнаяИнформация Тогда
		ТекстЗапроса = ТекстЗапроса_ПравилаПоискаДублей_Партнеры_СовпадаетКонтактнаяИнформация();
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Контрагенты_СовпадаетКонтактнаяИнформацияИНеЗаполненИНН Тогда
		ТекстЗапроса = ТекстЗапроса_ПравилаПоискаДублей_Контрагенты_СовпадаетКонтактнаяИнформацияИНеЗаполненИНН();
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Номенклатура_СовпадаетНаименование Тогда
		ТекстЗапроса = ТекстЗапроса_ПравилаПоискаДублей_Номенклатура_СовпадаетНаименование();
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Партнеры_СовпадаетНаименование Тогда
		ТекстЗапроса = ТекстЗапроса_ПравилаПоискаДублей_Партнеры_СовпадаетНаименование();
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_ХарактеристикиНоменклатуры_СовпадаетНаименование Тогда
		ТекстЗапроса = ТекстЗапроса_ПравилаПоискаДублей_ХарактеристикиНоменклатуры_СовпадаетНаименование();
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Контрагенты_СовпадаетНаименованиеИКонтактнаяИнформация Тогда
		ТекстЗапроса = ТекстЗапроса_ПравилаПоискаДублей_Контрагенты_СовпадаетНаименованиеИКонтактнаяИнформация();
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Контрагенты_СовпадаетНомерБанковскогоСчета Тогда
		ТекстЗапроса = ТекстЗапроса_ПравилаПоискаДублей_Контрагенты_СовпадаетНомерБанковскогоСчета();
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Контрагенты_СовпадаетРегистрационныйИлиНалоговыйНомерНерезидента Тогда
		ТекстЗапроса = ТекстЗапроса_ПравилаПоискаДублей_Контрагенты_СовпадаетРегистрационныйИлиНалоговыйНомерНерезидента();
	КонецЕсли;
	Возврат ТекстЗапроса;
КонецФункции

// Наименование поставляемого правила.
// 
// Параметры:
//  Ссылка - СправочникСсылка.ПравилаПоискаДублейНСИ - Ссылка
// 
// Возвращаемое значение:
//  Строка - Наименование поставляемого правила
Функция НаименованиеПоставляемогоПравила(Ссылка) Экспорт
	Если Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Контрагенты_СовпадаетИННКПП Тогда
		Наименование = НСтр("ru = 'Совпадает ИНН'");
		//++ Локализация
		Наименование = НСтр("ru = 'Совпадает ИНН и КПП'");
		//-- Локализация
	Иначе
		Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Наименование");
	КонецЕсли;
	Возврат Наименование;
КонецФункции

// Описание поставляемого правила.
// 
// Параметры:
//  Ссылка - СправочникСсылка.ПравилаПоискаДублейНСИ - Ссылка
// 
// Возвращаемое значение:
//  Строка - Описание поставляемого правила
Функция ОписаниеПоставляемогоПравила(Ссылка) Экспорт
	Если Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Контрагенты_СовпадаетИННКПП Тогда
		Описание = НСтр("ru = 'Поиск контрагентов одинакового типа с совпадающими ИНН'");
		// ++ Локализация
		Описание = НСтр("ru = 'Поиск контрагентов одинакового типа с совпадающими ИНН и КПП'");
		// -- Локализация
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Контрагенты_СовпадаетНаименованиеИКонтактнаяИнформация Тогда
		Описание = НСтр("ru = 'Поиск контрагентов одинакового типа с совпадающим наименованием и совпадающими или отсутсвующими адресами'");
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Контрагенты_СовпадаетНомерБанковскогоСчета Тогда
		Описание = НСтр("ru = 'Поиск контрагентов с одинаковыми номерами банковских счетов'");
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Контрагенты_СовпадаетРегистрационныйИлиНалоговыйНомерНерезидента Тогда
		Описание = НСтр("ru = 'Поиск контрагентов-нерезидентов с одинаковым налоговым или регистрационным номером'");
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Контрагенты_СовпадаетКонтактнаяИнформацияИНеЗаполненИНН Тогда
		Описание = НСтр("ru = 'Поиск контрагентов с совпадающей контактной информацией (адрес, телефон, электронная почта и т.д.) и не заполненным ИНН у одного или обоих контрагентов'");
		
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Партнеры_СовпадаетНаименование Тогда
		Описание = НСтр("ru = 'Поиск партнеров с одинаковым наименованием и отсутствием контактов или совпадающими адресными данными'");
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Партнеры_СовпадаетКонтактнаяИнформация Тогда
		Описание = НСтр("ru = 'Поиск партнеров с совпадающими адресами и телефоном/адресом электронной почты'");

	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Номенклатура_СовпадаетНаименование Тогда
		Описание = НСтр("ru = 'Поиск номенклатуры с совпадающим наименованием и другими ключевыми реквизитами (вид, единица измерения и др.)'");
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_Номенклатура_ПоНастройкамУникальностиВидаНоменклатуры Тогда
		Описание = НСтр("ru = 'Поиск дублей номенклатуры по настройкам уникальности вида номенклатуры (для номенклатуры)'");
		
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_ХарактеристикиНоменклатуры_СовпадаетНаименование Тогда
		Описание = НСтр("ru = 'Поиск характеристик одной номенклатуры с одинаковым наименованием'");
	ИначеЕсли Ссылка = Справочники.ПравилаПоискаДублейНСИ.Справочник_ХарактеристикиНоменклатуры_ПоНастройкамУникальностиВидаНоменклатуры Тогда
		Описание = НСтр("ru = 'Поиск дублей характеристик номенклатуры по настройкам уникальности вида номенклатуры (для характеристик номенклатуры)'");
	КонецЕсли;
	
	Возврат Описание;
КонецФункции

// Позволяет задать список подчиненных объектов и их связь с основными объектами.
// Реквизиты связанного объекта будут показаны в составе реквизитов основного объекта в отчете о сравнении дублей.
//
// Параметры:
//   СвязиПодчиненныхОбъектов - ТаблицаЗначений - таблица связей см. ПоискИЗаменаДублейНСИ.СвязанныеОбъекты
//
// Пример:
//   Связь = СвязиПодчиненныхОбъектов.Добавить();
//   Связь.СвязанныйОбъект = Метаданные.Справочники.Контрагенты;
//   Связь.ПолеСвязи = "Партнер";
//
Процедура ПриОпределенииСвязанныхОбъектов(СвязиПодчиненныхОбъектов) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда
		Связь = СвязиПодчиненныхОбъектов.Добавить();
		Связь.СвязанныйОбъект = Метаданные.Справочники.Контрагенты;
		Связь.ПолеСвязи = "Партнер";
	КонецЕсли;
	
КонецПроцедуры

// По именам определяет реквизиты и табличные части, которые должны быть исключены из отображения в отчете о сравнении дублей.
// Например, рекомендуется скрывать такие служебные реквизиты как ПометкаУдаления и ИмяПредопределенныхДанных. 
//
// Параметры:
//   СлужебныеРеквизиты - ТаблицаЗначений - коллекция для добавления ограничений см. ПоискИЗаменаДублейНСИ.ИсключенияРеквизитовСравнения
//
Процедура ПриОпределенииИсключенийРеквизитов(СлужебныеРеквизиты) Экспорт
	
	ИменаРеквизитов = "ПометкаУдаления,ИмяПредопределенныхДанных,Предопределенный,Представления";
	Для Каждого ИмяРеквизита Из СтрРазделить(ИменаРеквизитов, ", ", Ложь) Цикл
		Ограничение = СлужебныеРеквизиты.Добавить();
		Ограничение.Метаданные = Метаданные.Справочники.Номенклатура;
		Ограничение.ИмяРеквизита = ИмяРеквизита;
	КонецЦикла;
	
	ИменаРеквизитов = "ПометкаУдаления,ИмяПредопределенныхДанных,Предопределенный,Представления";
	Для Каждого ИмяРеквизита Из СтрРазделить(ИменаРеквизитов, ", ", Ложь) Цикл
		Ограничение = СлужебныеРеквизиты.Добавить();
		Ограничение.Метаданные = Метаданные.Справочники.ХарактеристикиНоменклатуры;
		Ограничение.ИмяРеквизита = ИмяРеквизита;
	КонецЦикла;
	
	ИменаРеквизитов = "ПометкаУдаления,ИмяПредопределенныхДанных,Предопределенный,Представления";
	Для Каждого ИмяРеквизита Из СтрРазделить(ИменаРеквизитов, ", ", Ложь) Цикл
		Ограничение = СлужебныеРеквизиты.Добавить();
		Ограничение.Метаданные = Метаданные.Справочники.Партнеры;
		Ограничение.ИмяРеквизита = ИмяРеквизита;
	КонецЦикла;
	
	ИменаРеквизитов = "ПометкаУдаления,ИмяПредопределенныхДанных,Предопределенный,Представления";
	Для Каждого ИмяРеквизита Из СтрРазделить(ИменаРеквизитов, ", ", Ложь) Цикл
		Ограничение = СлужебныеРеквизиты.Добавить();
		Ограничение.Метаданные = Метаданные.Справочники.Контрагенты;
		Ограничение.ИмяРеквизита = ИмяРеквизита;
	КонецЦикла;
	
КонецПроцедуры

// Позволяет дополнить реквизитный состав дополнительными реквизитами, которые хранятся в табличных частях
// для вывода их в отчет о сравнении дублей.
//
// Параметры:
//   ДополнительныеРеквизиты - ТаблицаЗначений:
//      *ИмяТабличнойЧасти - Строка - имя табличной части, которая описывается как реквизит.
//      *КолонкаРеквизита - Строка - имя колонки в табличной части, содержащей имя реквизита.
//      *КолонкаЗначения - Строка - имя колонки в табличной части, содержащей значение реквизита.
//
Процедура ПриОпределенииДополнительныхРеквизитов(ДополнительныеРеквизиты) Экспорт
	
	ОписаниеТабличнойЧасти = ДополнительныеРеквизиты.Добавить();
	ОписаниеТабличнойЧасти.ИмяТабличнойЧасти = "ДополнительныеРеквизиты";
	ОписаниеТабличнойЧасти.КолонкаРеквизита = "Свойство";
	ОписаниеТабличнойЧасти.КолонкаЗначения = "Значение";
	
	ОписаниеТабличнойЧасти = ДополнительныеРеквизиты.Добавить();
	ОписаниеТабличнойЧасти.ИмяТабличнойЧасти = "КонтактнаяИнформация";
	ОписаниеТабличнойЧасти.КолонкаРеквизита = "Вид";
	ОписаниеТабличнойЧасти.КолонкаЗначения = "Представление";
	
КонецПроцедуры

// Позволяет проверить возможность замены дублей на оригиналы по прикладным правилам.
// Если для некоторой пары из ПарыЗамен невозможно произвести замену ссылок в базе, потому что это нарушит
// корректную работу какого-либо механизма, то дубль из такой пары необходимо добавить в коллекцию невозможных замен.
// Для удобства выполнения проверок метод вызывается несколько раз, чтобы обеспечить группировку по типу ссылок.
//
// Параметры:
//   ПарыЗамен - Соответствие из КлючИЗначение - пары для замены:
//    * Ключ - СправочникСсылка,ПланВидовХарактеристикСсылка - дублирующая ссылка.
//    * Значение - СправочникСсылка,ПланВидовХарактеристикСсылка - оригинальная ссылка.
//   НевозможныеЗамены - ТаблицаЗначений - таблица невозможных замен:
//    * Ссылка - СправочникСсылка,ПланВидовХарактеристикСсылка - дублирующая ссылка.
//    * ТекстОшибки - Строка - текст ошибки, поясняющий причину невозможности замены.
//    * ОбъектОшибки - ЛюбаяСсылка - объект, в котором присутствует ссылка на дубль.
//   Тип - Тип - Тип ссылок в параметре ПарыЗамен.
//
//  Пример:
//    Для Каждого ДубльОригинал Из ПарыЗамен Цикл
//      Если Не ВозможноЗаменитьДубльНаОригиналВБазе(ДубльОригинал) Тогда
//        НевозможнаяЗамена = НевозможныеЗамены.Добавить();
//        НевозможнаяЗамена.Ссылка = ДубльОригинал.Ключ;
//        НевозможнаяЗамена.ТекстОшибки = НСтр("ru = 'Запрещено заменять номенклатуру с артикулом 00001'");
//        НевозможнаяЗамена.ОбъектОшибки = ДокументСсылка;
//      КонецЕсли;
//    КонецЦикла;
//
Процедура ПроверитьВозможностьЗаменыДублей(ПарыЗамен, НевозможныеЗамены, Тип) Экспорт
	ОбщегоНазначенияУТ.ПроверитьВозможностьЗаменыДублей(ПарыЗамен, НевозможныеЗамены, Тип);
КонецПроцедуры

// Дает возможность обработать пары дублей после их получения для заданного правила.
//
// Параметры:
//   ПарыДублей - ТаблицаЗначений
//      *Ссылка - СправочникСсылка,ПланВидовХарактеристикСсылка - возможный дубль.
//      *Ссылка1 - СправочникСсылка,ПланВидовХарактеристикСсылка - возможный дубль.
//   Правило - СправочникСсылка.ПравилаПоискаДублейНСИ.
//
Процедура ПриПоискеДублейНСИ(ПарыДублей, Правило) Экспорт
	ОбщегоНазначенияУТ.ПриПоискеДублейНСИ(ПарыДублей, Правило);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПоставляемыеПравилаПоискаДублей

Функция ТекстЗапроса_ПравилаПоискаДублей_Контрагенты_СовпадаетИННКПП()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Контрагент.Ссылка,
	|	Контрагент1.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагент
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагент1
	|	ПО Контрагент.Ссылка < Контрагент1.Ссылка
	|ГДЕ
	|	Контрагент.ИНН = Контрагент1.ИНН
	
	//++ Локализация
	|		И (НЕ (Контрагент.КПП = """" ИЛИ Контрагент1.КПП = """")
	|		И Контрагент.КПП = Контрагент1.КПП)
	//-- Локализация
	
	|		И Контрагент.ЮридическоеФизическоеЛицо = Контрагент1.ЮридическоеФизическоеЛицо
	|		И Контрагент.ЮрФизЛицо = Контрагент1.ЮрФизЛицо
	|		И НЕ Контрагент.ИНН = """"";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапроса_ПравилаПоискаДублей_Партнеры_СовпадаетКонтактнаяИнформация()
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПартнерКИ.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СовпадаетАдрес.Ссылка, ЕСТЬNULL(СовпадаетТелефон.Ссылка, СовпадаетЭлектроннаяПочта.Ссылка)) КАК Ссылка1
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерКИ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК СовпадаетАдрес
	|		ПО (ПартнерКИ.Ссылка < СовпадаетАдрес.Ссылка)
	|			И ПартнерКИ.Тип = СовпадаетАдрес.Тип
	|			И (ПартнерКИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И ПартнерКИ.Представление = СовпадаетАдрес.Представление
	|			И ПартнерКИ.Ссылка.ЮрФизЛицо = СовпадаетАдрес.Ссылка.ЮрФизЛицо
	|			И (НЕ СовпадаетАдрес.Ссылка ЕСТЬ NULL)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК СовпадаетТелефон
	|		ПО (ПартнерКИ.Ссылка < СовпадаетТелефон.Ссылка)
	|			И ПартнерКИ.Тип = СовпадаетТелефон.Тип
	|			И (ПартнерКИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И ПартнерКИ.Представление = СовпадаетТелефон.Представление
	|			И ПартнерКИ.Ссылка.ЮрФизЛицо = СовпадаетТелефон.Ссылка.ЮрФизЛицо
	|			И (НЕ СовпадаетТелефон.Ссылка ЕСТЬ NULL)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК СовпадаетЭлектроннаяПочта
	|		ПО (ПартнерКИ.Ссылка < СовпадаетЭлектроннаяПочта.Ссылка)
	|			И ПартнерКИ.Тип = СовпадаетЭлектроннаяПочта.Тип
	|			И (ПартнерКИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И ПартнерКИ.Представление = СовпадаетЭлектроннаяПочта.Представление
	|			И ПартнерКИ.Ссылка.ЮрФизЛицо = СовпадаетТелефон.Ссылка.ЮрФизЛицо
	|			И (НЕ СовпадаетЭлектроннаяПочта.Ссылка ЕСТЬ NULL)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ТекущаяКИАдрес
	|		ПО ПартнерКИ.Ссылка = ТекущаяКИАдрес.Ссылка
	|			И (ТекущаяКИАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ТекущаяКИЭлПочтаТелефон
	|		ПО ПартнерКИ.Ссылка = ТекущаяКИЭлПочтаТелефон.Ссылка
	|			И (ТекущаяКИЭлПочтаТелефон.Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты), ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)))
	|ГДЕ
	|	НЕ ЕСТЬNULL(СовпадаетАдрес.Ссылка, ЕСТЬNULL(СовпадаетТелефон.Ссылка, СовпадаетЭлектроннаяПочта.Ссылка)) ЕСТЬ NULL
	|	И (НЕ ТекущаяКИАдрес.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ТекущаяКИЭлПочтаТелефон.Ссылка ЕСТЬ NULL)";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапроса_ПравилаПоискаДублей_Контрагенты_СовпадаетКонтактнаяИнформацияИНеЗаполненИНН()
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагент1.Ссылка КАК Контрагент,
	|	Контрагент2.Ссылка КАК Дубль
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагент1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагент2
	|		ПО Контрагент1.Ссылка < Контрагент2.Ссылка
	|			И Контрагент1.ЮридическоеФизическоеЛицо = Контрагент2.ЮридическоеФизическоеЛицо
	|			И Контрагент1.ЮрФизЛицо = Контрагент2.ЮрФизЛицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КИ1
	|		ПО КИ1.Ссылка = Контрагент1.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КИ2
	|		ПО КИ2.Ссылка = Контрагент2.Ссылка
	|ГДЕ
	|	(Контрагент1.ИНН = """"
	|			ИЛИ Контрагент2.ИНН = """")
	|	И (КИ1.Тип = КИ2.Тип
	|				И КИ1.Представление <> """"
	|				И КИ1.Представление = КИ2.Представление
	|			ИЛИ КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И КИ1.НомерТелефона <> """"
	|				И КИ1.НомерТелефона = КИ2.НомерТелефона
	|			ИЛИ КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|				И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|				И КИ1.АдресЭП <> """"
	|				И КИ1.АдресЭП = КИ2.АдресЭП)";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапроса_ПравилаПоискаДублей_Номенклатура_СовпадаетНаименование()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура1.Ссылка КАК Ссылка1
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
	|		ПО (Номенклатура.Ссылка < Номенклатура1.Ссылка)
	|			И Номенклатура.Наименование = Номенклатура1.Наименование
	|ГДЕ	
	|	Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Номенклатура1.ВидНоменклатуры.ТипНоменклатуры
	|		И Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик = Номенклатура1.ВидНоменклатуры.ИспользованиеХарактеристик
	|		И Номенклатура.ВидНоменклатуры.ИспользоватьСерии = Номенклатура1.ВидНоменклатуры.ИспользоватьСерии
	|		И Номенклатура.ВидНоменклатуры.ОсобенностьУчета = Номенклатура1.ВидНоменклатуры.ОсобенностьУчета
	|		И Номенклатура.ЕдиницаИзмерения = Номенклатура1.ЕдиницаИзмерения
	|		И Номенклатура.Принципал = Номенклатура1.Принципал
	|		И Номенклатура.Контрагент = Номенклатура1.Контрагент
	|		И Номенклатура.ГруппаФинансовогоУчета = Номенклатура1.ГруппаФинансовогоУчета
	|		И Номенклатура.Качество = Номенклатура1.Качество
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура1.Ссылка КАК Ссылка1
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
	|		ПО (Номенклатура.Ссылка < Номенклатура1.Ссылка)
	|			И Номенклатура.НаименованиеПолное = Номенклатура1.НаименованиеПолное
	|ГДЕ
	|	Номенклатура.НаименованиеПолное <> """"
	|	И Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Номенклатура1.ВидНоменклатуры.ТипНоменклатуры
	|		И Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик = Номенклатура1.ВидНоменклатуры.ИспользованиеХарактеристик
	|		И Номенклатура.ВидНоменклатуры.ИспользоватьСерии = Номенклатура1.ВидНоменклатуры.ИспользоватьСерии
	|		И Номенклатура.ВидНоменклатуры.ОсобенностьУчета = Номенклатура1.ВидНоменклатуры.ОсобенностьУчета
	|		И Номенклатура.ЕдиницаИзмерения = Номенклатура1.ЕдиницаИзмерения
	|		И Номенклатура.Принципал = Номенклатура1.Принципал
	|		И Номенклатура.Контрагент = Номенклатура1.Контрагент
	|		И Номенклатура.ГруппаФинансовогоУчета = Номенклатура1.ГруппаФинансовогоУчета
	|		И Номенклатура.Качество = Номенклатура1.Качество";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапроса_ПравилаПоискаДублей_Партнеры_СовпадаетНаименование()
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партнер1.Ссылка КАК Партнер,
	|	Партнер2.Ссылка КАК Дубль
	|ИЗ
	|	Справочник.Партнеры КАК Партнер1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнер2
	|		ПО Партнер1.Ссылка < Партнер2.Ссылка
	|			И Партнер1.Наименование = Партнер2.Наименование
	|			И Партнер1.ЮрФизЛицо = Партнер2.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК КИ1
	|		ПО КИ1.Ссылка = Партнер1.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК КИ2
	|		ПО КИ2.Ссылка = Партнер2.Ссылка
	|ГДЕ
	|	(КИ1.Ссылка ЕСТЬ NULL
	|			ИЛИ (КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|					И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|					И КИ1.НомерТелефона <> """"
	|					И КИ1.НомерТелефона = КИ2.НомерТелефона
	|				ИЛИ КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|					И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|					И КИ1.АдресЭП <> """"
	|					И КИ1.АдресЭП = КИ2.АдресЭП
	|				ИЛИ КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И (КИ1.Представление <> """"
	|							И КИ1.Представление = КИ2.Представление)))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партнер1.Ссылка КАК Партнер,
	|	Партнер2.Ссылка КАК Дубль
	|ИЗ
	|	Справочник.Партнеры КАК Партнер1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнер2
	|		ПО Партнер1.Ссылка < Партнер2.Ссылка
	|			И Партнер1.НаименованиеПолное = Партнер2.НаименованиеПолное
	|			И Партнер1.ЮрФизЛицо = Партнер2.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК КИ1
	|		ПО КИ1.Ссылка = Партнер1.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК КИ2
	|		ПО КИ2.Ссылка = Партнер2.Ссылка
	|ГДЕ
	|	Партнер1.НаименованиеПолное <> """"
	|	И (КИ1.Ссылка ЕСТЬ NULL
	|			ИЛИ (КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|					И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|					И КИ1.НомерТелефона <> """"
	|					И КИ1.НомерТелефона = КИ2.НомерТелефона
	|				ИЛИ КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|					И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|					И КИ1.АдресЭП <> """"
	|					И КИ1.АдресЭП = КИ2.АдресЭП
	|				ИЛИ КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И (КИ1.Представление <> """"
	|							И КИ1.Представление = КИ2.Представление)))";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапроса_ПравилаПоискаДублей_ХарактеристикиНоменклатуры_СовпадаетНаименование()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
	|	ХарактеристикиНоменклатуры1.Ссылка КАК Ссылка1
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры1
	|		ПО ХарактеристикиНоменклатуры.Владелец = ХарактеристикиНоменклатуры1.Владелец
	|			И ХарактеристикиНоменклатуры.Ссылка < ХарактеристикиНоменклатуры1.Ссылка
	|ГДЕ
	|	 (ХарактеристикиНоменклатуры.Наименование = ХарактеристикиНоменклатуры1.Наименование
	|		ИЛИ (ХарактеристикиНоменклатуры.НаименованиеПолное = ХарактеристикиНоменклатуры1.НаименованиеПолное
	|		И НЕ ХарактеристикиНоменклатуры.НаименованиеПолное = """"))";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапроса_ПравилаПоискаДублей_Контрагенты_СовпадаетНаименованиеИКонтактнаяИнформация()
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагент1.Ссылка КАК Контрагент,
	|	Контрагент2.Ссылка КАК Дубль
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагент1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагент2
	|		ПО Контрагент1.Ссылка < Контрагент2.Ссылка
	|			И Контрагент1.Наименование = Контрагент2.Наименование
	|			И Контрагент1.ЮридическоеФизическоеЛицо = Контрагент2.ЮридическоеФизическоеЛицо
	|			И Контрагент1.ЮрФизЛицо = Контрагент2.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КИ1
	|		ПО КИ1.Ссылка = Контрагент1.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КИ2
	|		ПО КИ2.Ссылка = Контрагент2.Ссылка
	|ГДЕ
	|	(КИ1.Ссылка ЕСТЬ NULL
	|			ИЛИ (КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|					И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|					И КИ1.НомерТелефона <> """"
	|					И КИ1.НомерТелефона = КИ2.НомерТелефона
	|				ИЛИ КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|					И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|					И КИ1.АдресЭП <> """"
	|					И КИ1.АдресЭП = КИ2.АдресЭП
	|				ИЛИ КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И (КИ1.Представление <> """"
	|							И КИ1.Представление = КИ2.Представление)))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагент1.Ссылка КАК Контрагент,
	|	Контрагент2.Ссылка КАК Дубль
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагент1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагент2
	|		ПО Контрагент1.Ссылка < Контрагент2.Ссылка
	|			И Контрагент1.НаименованиеПолное = Контрагент2.НаименованиеПолное
	|			И Контрагент1.ЮридическоеФизическоеЛицо = Контрагент2.ЮридическоеФизическоеЛицо
	|			И Контрагент1.ЮрФизЛицо = Контрагент2.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КИ1
	|		ПО КИ1.Ссылка = Контрагент1.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КИ2
	|		ПО КИ2.Ссылка = Контрагент2.Ссылка
	|ГДЕ
	|	Контрагент1.НаименованиеПолное <> """"
	|	И (КИ1.Ссылка ЕСТЬ NULL
	|			ИЛИ (КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|					И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|					И КИ1.НомерТелефона <> """"
	|					И КИ1.НомерТелефона = КИ2.НомерТелефона
	|				ИЛИ КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|					И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|					И КИ1.АдресЭП <> """"
	|					И КИ1.АдресЭП = КИ2.АдресЭП
	|				ИЛИ КИ1.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И КИ2.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И (КИ1.Представление <> """"
	|							И КИ1.Представление = КИ2.Представление)))";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапроса_ПравилаПоискаДублей_Контрагенты_СовпадаетНомерБанковскогоСчета()
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БанковскиеСчетаКонтрагентов.Владелец КАК Владелец,
	|	БанковскиеСчетаКонтрагентов1.Владелец КАК Владелец1
	|ИЗ
	|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов1
	|		ПО БанковскиеСчетаКонтрагентов.Владелец <> БанковскиеСчетаКонтрагентов1.Владелец
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА НЕ БанковскиеСчетаКонтрагентов.Банк = ЗНАЧЕНИЕ(Справочник.КлассификаторБанков.ПустаяСсылка) 
	|			ТОГДА БанковскиеСчетаКонтрагентов.Банк = БанковскиеСчетаКонтрагентов1.Банк
	|		ИНАЧЕ БанковскиеСчетаКонтрагентов.БИКБанка = БанковскиеСчетаКонтрагентов1.БИКБанка
	|			И БанковскиеСчетаКонтрагентов.СВИФТБанка = БанковскиеСчетаКонтрагентов1.СВИФТБанка
	|	КОНЕЦ
	|	И БанковскиеСчетаКонтрагентов.НомерСчета = БанковскиеСчетаКонтрагентов1.НомерСчета
	|	И БанковскиеСчетаКонтрагентов.Владелец ССЫЛКА Справочник.Контрагенты
	|	И БанковскиеСчетаКонтрагентов1.Владелец ССЫЛКА Справочник.Контрагенты";
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапроса_ПравилаПоискаДублей_Контрагенты_СовпадаетРегистрационныйИлиНалоговыйНомерНерезидента()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты1.Ссылка КАК Ссылка1
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты1
	|		ПО Контрагенты.Ссылка < Контрагенты1.Ссылка
	|ГДЕ
	|	 (Контрагенты.НалоговыйНомер <> """"
	|		И Контрагенты1.НалоговыйНомер <> """"
	|		И Контрагенты.НалоговыйНомер = Контрагенты1.НалоговыйНомер)
	|	ИЛИ (Контрагенты.РегистрационныйНомер <> """"
	|		И Контрагенты1.РегистрационныйНомер <> """"
	|		И Контрагенты.РегистрационныйНомер = Контрагенты1.РегистрационныйНомер)
	|	И Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент)
	|	И Контрагенты1.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент)";
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

Функция ОбъектМетаданныхПоставляемогоПравила(ИмяПредопределенныхДанных) 
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Справочник_Номенклатура_ПоНастройкамУникальностиВидаНоменклатуры", "Справочник.Номенклатура");
	Соответствие.Вставить("Справочник_ХарактеристикиНоменклатуры_ПоНастройкамУникальностиВидаНоменклатуры", "Справочник.ХарактеристикиНоменклатуры");
	Соответствие.Вставить("Справочник_Контрагенты_СовпадаетИННКПП", "Справочник.Контрагенты");
	Соответствие.Вставить("Справочник_Партнеры_СовпадаетКонтактнаяИнформация", "Справочник.Партнеры");
	Соответствие.Вставить("Справочник_Контрагенты_СовпадаетКонтактнаяИнформацияИНеЗаполненИНН", "Справочник.Контрагенты");
	Соответствие.Вставить("Справочник_Номенклатура_СовпадаетНаименование", "Справочник.Номенклатура");
	Соответствие.Вставить("Справочник_Партнеры_СовпадаетНаименование", "Справочник.Партнеры");
	Соответствие.Вставить("Справочник_ХарактеристикиНоменклатуры_СовпадаетНаименование", "Справочник.ХарактеристикиНоменклатуры");
	Соответствие.Вставить("Справочник_Контрагенты_СовпадаетНаименованиеИКонтактнаяИнформация", "Справочник.Контрагенты");
	Соответствие.Вставить("Справочник_Контрагенты_СовпадаетНомерБанковскогоСчета", "Справочник.Контрагенты");
	Соответствие.Вставить("Справочник_Контрагенты_СовпадаетРегистрационныйИлиНалоговыйНомерНерезидента", "Справочник.Контрагенты");
	ИмяТипа = Соответствие[ИмяПредопределенныхДанных]; 
	Если ИмяТипа = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Идентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ИмяТипа);
	Возврат Идентификатор;
КонецФункции

#КонецОбласти
