
&НаКлиенте
Процедура ИмяПапкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Показать(Новый ОписаниеОповещения("ИмяПапкиЗавершениеВыбора", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПапкиЗавершениеВыбора(Значение, ДопПараметры) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Массив") И Значение.Количество() > 0 Тогда
		ИмяПапки = Значение[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	
	ДанныеВыписки.Очистить();
	
	Файлы = НайтиФайлы(ИмяПапки, "*.xml", Ложь);
	Для каждого стрФайл Из Файлы Цикл
		
		АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(стрФайл.ПолноеИмя), УникальныйИдентификатор);
		ДобавитьФайлДляЗагрузки(АдресФайла);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьФайлДляЗагрузки(АдресФайла)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	КоличествоОбязательныхРеквизитов = 12;
	КоличествоПрочитанныхАтрибутов = 0;
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ИмяВременногоФайла);
	
	НоваяСтрока = ДанныеВыписки.Добавить();
	
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "BasicRequisites_DocNum" ИЛИ Чтение.Имя = "AccDoc_DocNum" Тогда
				Чтение.Прочитать();
				НоваяСтрока.НомерДокумента = Чтение.Значение;
				КоличествоПрочитанныхАтрибутов = КоличествоПрочитанныхАтрибутов + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "BasicRequisites_DocDate" ИЛИ Чтение.Имя = "AccDoc_DocDate" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ДатаДокумента = Дата(Лев(Чтение.Значение, 4), Сред(Чтение.Значение, 6, 2), Сред(Чтение.Значение, 9, 2));
				КоличествоПрочитанныхАтрибутов = КоличествоПрочитанныхАтрибутов + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "BasicRequisites_PaySum" Тогда
				Чтение.Прочитать();
				НоваяСтрока.Сумма = Чтение.Значение;
				КоличествоПрочитанныхАтрибутов = КоличествоПрочитанныхАтрибутов + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "PayerAndRecipient_Payer_INN" ИЛИ Чтение.Имя = "Payer_INN" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ПлательщикИНН = Чтение.Значение;
				КоличествоПрочитанныхАтрибутов = КоличествоПрочитанныхАтрибутов + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "PayerAndRecipient_Payer_KPP" ИЛИ Чтение.Имя = "Payer_KPP" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ПлательщикКПП = Чтение.Значение;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "PayerAndRecipient_Payer_Name" ИЛИ Чтение.Имя = "Payer_Name" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ПлательщикНаименование = Чтение.Значение;
				КоличествоПрочитанныхАтрибутов = КоличествоПрочитанныхАтрибутов + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "PayerAndRecipient_Payer_PersonalAcc" ИЛИ Чтение.Имя = "Payer_AccNum" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ПлательщикНомерСчета = Чтение.Значение;
				КоличествоПрочитанныхАтрибутов = КоличествоПрочитанныхАтрибутов + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "PayerAndRecipient_Payer_BIK" ИЛИ Чтение.Имя = "Payer_BIK" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ПлательщикБИК = Чтение.Значение;
				КоличествоПрочитанныхАтрибутов = КоличествоПрочитанныхАтрибутов + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "PayerAndRecipient_Payer_BankName" ИЛИ Чтение.Имя = "Payer_BankName" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ПлательщикБанк = Чтение.Значение;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "PayerAndRecipient_Recip_INN" ИЛИ Чтение.Имя = "Recip_INN" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ПолучательИНН = Чтение.Значение;
				КоличествоПрочитанныхАтрибутов = КоличествоПрочитанныхАтрибутов + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "PayerAndRecipient_Recip_KPP" ИЛИ Чтение.Имя = "Recip_KPP" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ПолучательКПП = Чтение.Значение;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "PayerAndRecipient_Recip_CheckAcc" ИЛИ Чтение.Имя = "Recip_AccNum" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ПолучательНомерСчета = Чтение.Значение;
				КоличествоПрочитанныхАтрибутов = КоличествоПрочитанныхАтрибутов + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "PayerAndRecipient_Recip_BIK" ИЛИ Чтение.Имя = "Recip_BIK" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ПолучательБИК = Чтение.Значение;
				КоличествоПрочитанныхАтрибутов = КоличествоПрочитанныхАтрибутов + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "PayerAndRecipient_Recip_BankName" ИЛИ Чтение.Имя = "Recip_BankName" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ПолучательБанк = Чтение.Значение;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "PayerAndRecipient_Recip_Name" ИЛИ Чтение.Имя = "Recip_Name" Тогда
				Чтение.Прочитать();
				НоваяСтрока.ПолучательНаименование = Чтение.Значение;
				КоличествоПрочитанныхАтрибутов = КоличествоПрочитанныхАтрибутов + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если Чтение.Имя = "TranscriptPP_PayPurpose" ИЛИ Чтение.Имя = "DepInfo_PayPurpose" Тогда
				Чтение.Прочитать();
				НоваяСтрока.НазначениеПлатежа = Чтение.Значение;
				КоличествоПрочитанныхАтрибутов = КоличествоПрочитанныхАтрибутов + 1;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоПрочитанныхАтрибутов >= КоличествоОбязательныхРеквизитов Тогда
		
		НоваяСтрока.Загружать = Истина;
		ЗаполнитьСтрокуВыпискиОбъектамиБД(НоваяСтрока);
		
	Иначе
		ДанныеВыписки.Удалить(НоваяСтрока);
	КонецЕсли;
	
	Чтение.Закрыть();
	УдалитьФайлы(ИмяВременногоФайла);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуВыпискиОбъектамиБД(СтрокаВыписки)
	
	//ПЛАТЕЛЬЩИК
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Данные.Ссылка КАК Ссылка,
	|	Данные.Приоритет КАК Приоритет
	|ИЗ
	|	(ВЫБРАТЬ
	|		Организации.Ссылка КАК Ссылка,
	|		1 КАК Приоритет
	|	ИЗ
	|		Справочник.Организации КАК Организации
	|	ГДЕ
	|		Организации.ИНН = &ИНН
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Контрагенты.Ссылка,
	|		2
	|	ИЗ
	|		Справочник.Контрагенты КАК Контрагенты
	|	ГДЕ
	|		Контрагенты.ИНН = &ИНН
	|		И Контрагенты.КПП = &КПП) КАК Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("ИНН", СтрокаВыписки.ПлательщикИНН);
	Запрос.УстановитьПараметр("КПП", СтрокаВыписки.ПлательщикКПП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтрокаВыписки.Плательщик = Выборка.Ссылка;
	КонецЕсли;
	
	//ПОЛУЧАТЕЛЬ
	Запрос.УстановитьПараметр("ИНН", СтрокаВыписки.ПолучательИНН);
	Запрос.УстановитьПараметр("КПП", СтрокаВыписки.ПолучательКПП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтрокаВыписки.Получатель = Выборка.Ссылка;
	КонецЕсли;
	
	//СЧЕТ ПЛАТЕЛЬЩИКА
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.НомерСчета = &НомерСчета
	|	И БанковскиеСчета.Владелец = &Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.НомерСчета = &НомерСчета
	|	И БанковскиеСчета.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("НомерСчета", СтрокаВыписки.ПлательщикНомерСчета);
	Запрос.УстановитьПараметр("Владелец", СтрокаВыписки.Плательщик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтрокаВыписки.СчетПлательщика = Выборка.Ссылка;
	КонецЕсли;
	
	//СЧЕТ ПОЛУЧАТЕЛЯ
	Запрос.УстановитьПараметр("НомерСчета", СтрокаВыписки.ПолучательНомерСчета);
	Запрос.УстановитьПараметр("Владелец", СтрокаВыписки.Получатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтрокаВыписки.СчетПолучателя = Выборка.Ссылка;
	КонецЕсли;
	
	//ДОКУМЕНТ
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеСРасчетногоСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеСРасчетногоСчета
	|ГДЕ
	|	СписаниеСРасчетногоСчета.Организация = &Организация
	|	И СписаниеСРасчетногоСчета.БанковскийСчет = &СчетОрганизации
	|	И СписаниеСРасчетногоСчета.НомерВходящегоДокумента = &НомерВходящегоДокумента
	|	И СписаниеСРасчетногоСчета.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Организация = &Организация
	|	И ПоступлениеНаРасчетныйСчет.БанковскийСчет = &СчетОрганизации
	|	И ПоступлениеНаРасчетныйСчет.НомерВходящегоДокумента = &НомерВходящегоДокумента
	|	И ПоступлениеНаРасчетныйСчет.ДатаВходящегоДокумента = &ДатаВходящегоДокумента";
	
	Запрос.УстановитьПараметр("Организация", ?(ТипЗнч(СтрокаВыписки.Плательщик) = Тип("СправочникСсылка.Организации"), СтрокаВыписки.Плательщик, СтрокаВыписки.Получатель));
	Запрос.УстановитьПараметр("СчетОрганизации", ?(ТипЗнч(СтрокаВыписки.Плательщик) = Тип("СправочникСсылка.Организации"), СтрокаВыписки.СчетПлательщика, СтрокаВыписки.СчетПолучателя));
	Запрос.УстановитьПараметр("НомерВходящегоДокумента", СтрокаВыписки.НомерДокумента);
	Запрос.УстановитьПараметр("ДатаВходящегоДокумента", СтрокаВыписки.ДатаДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтрокаВыписки.Документ = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеПоСтрокеВыписки(ИДСтроки)
	
	стрВыписка = ДанныеВыписки.НайтиПоИдентификатору(ИДСтроки);
	
	Если ЗначениеЗаполнено(стрВыписка.Документ) Тогда
		Сообщить(СтрШаблон("В строке № %1 документ уже был загружен ранее %2", ДанныеВыписки.Индекс(стрВыписка) + 1, стрВыписка.Документ));
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(стрВыписка.Плательщик) = Тип("СправочникСсылка.Организации")
		И ТипЗнч(стрВыписка.Получатель) = Тип("СправочникСсылка.Организации") Тогда
		
		Документ = Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент();
		Документ.Дата = стрВыписка.ДатаДокумента;
		Документ.НомерВходящегоДокумента = стрВыписка.НомерДокумента;
		Документ.ДатаВходящегоДокумента = стрВыписка.ДатаДокумента;
		Документ.ДатаПроведенияБанком = стрВыписка.ДатаДокумента;
		Документ.ПроведеноБанком = Истина;
		Документ.НазначениеПлатежа = стрВыписка.НазначениеПлатежа;
		Документ.Организация = стрВыписка.Плательщик;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет;
		Документ.ОчередностьПлатежа = 5;
		Документ.БанковскийСчетПолучатель = стрВыписка.СчетПолучателя;
		Документ.СуммаДокумента = стрВыписка.Сумма;
		Документ.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		Документ.БанковскийСчет = стрВыписка.СчетПлательщика;
		Документ.ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;
		Документ.Ответственный = Пользователи.АвторизованныйПользователь();
		Документ.Автор = Пользователи.АвторизованныйПользователь();
		
		Документ.Записать(РежимЗаписиДокумента.Запись);
		стрВыписка.Документ = Документ.Ссылка;
		
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан документ %1", Документ.Ссылка), Документ.Ссылка);
		
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(СтрШаблон("%1%2%3", Документ.Ссылка, Символы.ПС, ОписаниеОшибки()));
		КонецПопытки;
		
	ИначеЕсли ТипЗнч(стрВыписка.Плательщик) = Тип("СправочникСсылка.Контрагенты")
		И ТипЗнч(стрВыписка.Получатель) = Тип("СправочникСсылка.Организации") Тогда
		
		Документ = Документы.ПоступлениеБезналичныхДенежныхСредств.СоздатьДокумент();
		Документ.Дата = стрВыписка.ДатаДокумента;
		Документ.НомерВходящегоДокумента = стрВыписка.НомерДокумента;
		Документ.ДатаВходящегоДокумента = стрВыписка.ДатаДокумента;
		Документ.ДатаПроведенияБанком = стрВыписка.ДатаДокумента;
		Документ.ПроведеноБанком = Истина;
		Документ.НазначениеПлатежа = стрВыписка.НазначениеПлатежа;
		Документ.Организация = стрВыписка.Получатель;
		Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;
		Документ.БанковскийСчет = стрВыписка.СчетПолучателя;
		Документ.СуммаДокумента = стрВыписка.Сумма;
		Документ.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		Документ.БанковскийСчетКонтрагента = стрВыписка.СчетПлательщика;
		Документ.ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;
		Документ.Ответственный = Пользователи.АвторизованныйПользователь();
		Документ.Автор = Пользователи.АвторизованныйПользователь();
		Документ.Контрагент = стрВыписка.Плательщик;
		Документ.Партнер = Документ.Контрагент.Партнер;
		
		НоваяСтрока = Документ.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.Партнер = Документ.Партнер;
		НоваяСтрока.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
		НоваяСтрока.Сумма = стрВыписка.Сумма;
		НоваяСтрока.ВалютаВзаиморасчетов = Документ.Валюта;
		НоваяСтрока.СуммаВзаиморасчетов = стрВыписка.Сумма;
		НоваяСтрока.Организация = Документ.Организация;
		
		Если СтрНайти(стрВыписка.НазначениеПлатежа, "18%") > 0 ИЛИ СтрНайти(стрВыписка.НазначениеПлатежа, "18 %") Тогда
			НоваяСтрока.СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС18);
		ИначеЕсли СтрНайти(стрВыписка.НазначениеПлатежа, "18%") > 0 ИЛИ СтрНайти(стрВыписка.НазначениеПлатежа, "10 %") Тогда
			НоваяСтрока.СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС10);
		Иначе
			НоваяСтрока.СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.БезНДС);
		КонецЕсли;
		НоваяСтрока.КурсЗнаменательВзаиморасчетов = 1;
		НоваяСтрока.КурсЧислительВзаиморасчетов = 1;
		
		Документ.Записать(РежимЗаписиДокумента.Запись);
		стрВыписка.Документ = Документ.Ссылка;
		
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан документ %1", Документ.Ссылка), Документ.Ссылка);
		
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(СтрШаблон("%1%2%3", Документ.Ссылка, Символы.ПС, ОписаниеОшибки()));
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	Для каждого стрВыписка Из ДанныеВыписки Цикл
		
		Если стрВыписка.Загружать Тогда
			ЗагрузитьДанныеПоСтрокеВыписки(стрВыписка.ПолучитьИдентификатор());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
