Функция ЗначениеДляXDTO(Ссылка) Экспорт
	
	Если Ссылка= РП Тогда 
		Результат = "РП";
	ИначеЕсли Ссылка= ПГ Тогда 
		Результат = "ПГ";
	ИначеЕсли Ссылка= ЗП Тогда 
		Результат = "ЗП";
	ИначеЕсли Ссылка= ЛТ Тогда 
		Результат = "ЛТ";
	ИначеЕсли Ссылка= ПД Тогда 
		Результат = "ПД";
	Иначе
		
		ВызватьИсключение "Для заполнения в xml передано неверное значение Вида коммерческих перевозок: " + Ссылка;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(Строка) Экспорт
	
	Если Строка = Неопределено Тогда 
		Результат = ПустаяСсылка();
	ИначеЕсли Строка= "РП" Тогда 
		Результат = РП;
	ИначеЕсли Строка= "ПГ" Тогда 
		Результат = ПГ;
	ИначеЕсли Строка= "ЗП" Тогда 
		Результат = ЗП;
	ИначеЕсли Строка= "ЛТ" Тогда 
		Результат = ЛТ;
	ИначеЕсли Строка= "ПД" Тогда 
		Результат = ПД;
	Иначе
		
		Результат = ПустаяСсылка();
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

