&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
 	СохраненныйРежимОтладки = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("РежимОтладки");
	Если  СохраненныйРежимОтладки <> Ложь
		И СохраненныйРежимОтладки <> Неопределено Тогда
		РежимОтладки = СохраненныйРежимОтладки;
	Иначе
		РежимОтладки = "ТолькоОшибки";
	КонецЕсли;
	ОбновитьЦветРежимаОтладки();
	РаботаБезАлкоголя = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("РаботаБезАлкоголя");
	
	// Закомментировано. Сжатие используем всегда
	// ОтключитьСжатиеДанных = _ЛокКонтекст.ЛокЯдро_ПолучитьНастройкуНаСервереSMARTS("ОтключитьСжатиеДанных");
	// _ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("ОтключитьСжатиеДанных", ОтключитьСжатиеДанных);
	
	ОтключитьРаботуВФоне = _ЛокКонтекст.КомЯдро_ПолучитьЗначениеПеременной("ОтключитьРаботуВФоне");
	
	ОтключитьОбновление_ОсновнаяОбработка 		= _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ОтключитьОбновление_ОсновнаяОбработка");
	ОтключитьОбновление_ИнтеграционнаяОбработка = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ОтключитьОбновление_ИнтеграционнаяОбработка");
	ОтключитьРаботуСКнопкамиОбмена				= _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ОтключитьРаботуСКнопкамиОбмена",,, Истина);
	ВключитьРаботуСКнопкамиОбмена = Не ОтключитьРаботуСКнопкамиОбмена;
	
	СохраненныйВыводитьСообщенияНаТСД = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов");
	Если СохраненныйВыводитьСообщенияНаТСД <> Ложь 
		и Не ПустаяСтрока(СохраненныйВыводитьСообщенияНаТСД) Тогда
		ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов = СохраненныйВыводитьСообщенияНаТСД;
	Иначе
		ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов = "ТолькоОшибки";
	КонецЕсли;
	ОбновитьЦветОтправкиСообщений();
	
	//ЗаполнитьИнформациюОбОсновнойОбработке();
	
	//Элементы.СкопироватьНастройкиПодключенияДругимПользователям1С.Доступность = ЕстьПравоАдминистрированияДанных();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦветРежимаОтладки()
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		Если РежимОтладки = "Выключена" Тогда
			Элементы.РежимОтладки.ЦветТекста = WebЦвета.Красный;
		ИначеЕсли РежимОтладки = "ТолькоОшибки" Тогда
			Элементы.РежимОтладки.ЦветТекста = WebЦвета.Золотистый;
		ИначеЕсли РежимОтладки = "ВсяИнформация" Тогда
			Элементы.РежимОтладки.ЦветТекста = WebЦвета.Зеленый;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаПроизвольныхКодов(Команда)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСпискаПроизвольныхКодов = ПолучитьФорму("ОФ_ФормаСписка_ПроизвольныеКоды", ЭтаФорма);
	#Иначе
		ФормаСпискаПроизвольныхКодов = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСписка_ПроизвольныеКоды", , ЭтаФорма, ЭтаФорма);
	#КонецЕсли
	ФормаСпискаПроизвольныхКодов.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаСпискаПроизвольныхКодов._ЛокКонтекст = _ЛокКонтекст;
	ФормаСпискаПроизвольныхКодов.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтладкиПриИзменении(Элемент)
	
	ОбновитьЦветРежимаОтладки();

	Если РежимОтладки <>   _ЛокКонтекст. ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("РежимОтладки") Тогда
		_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("РежимОтладки", РежимОтладки);
		_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("РежимОтладки", РежимОтладки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСАлкоголемПриИзменении(Элемент)
	
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("РаботаБезАлкоголя", РаботаБезАлкоголя);
	_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("РаботаБезАлкоголя", 	РаботаБезАлкоголя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСжатиеДанныхПриИзменении(Элемент)
	
    //_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("ОтключитьСжатиеДанных", ОтключитьСжатиеДанных);
	//_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("ОтключитьСжатиеДанных", ОтключитьСжатиеДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьРаботуВФонеПриИзменении(Элемент)
	
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("ОтключитьРаботуВФоне", ОтключитьРаботуВФоне);
	_ЛокКонтекст.КомЯдро_СохранитьЗначениеПеременной("ОтключитьРаботуВФоне", ОтключитьРаботуВФоне);
	_ЛокКонтекст.ЛокЯдро_СохранитьДанныеВХранилище1С("Cleverence_ОтключитьРаботуВФоне", ОтключитьРаботуВФоне);
	
	// Передаем признак в лок контекст
	Если _ЛокКонтекст.ДоступноВыполнениеВФоне Тогда
		_ЛокКонтекст.ДоступноВыполнениеВФоне = Не ОтключитьРаботуВФоне;
	Иначе
		_ЛокКонтекст.ДоступноВыполнениеВФоне = Не ОтключитьРаботуВФоне
			И _ЛокКонтекст.ЛокЯдро_ДоступноВыполнениеВФоне();
	КонецЕсли;
	
	_ЛокКонтекст.КомЯдро_СохранитьЗначениеПеременной("ДоступноВыполнениеВФоне", _ЛокКонтекст.ДоступноВыполнениеВФоне); // Записываем в кэш
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОбновление_ОсновнаяОбработкаПриИзменении(Элемент)
	
 	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("ОтключитьОбновление_ОсновнаяОбработка", ОтключитьОбновление_ОсновнаяОбработка);
	_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("ОтключитьОбновление_ОсновнаяОбработка", 	ОтключитьОбновление_ОсновнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОбновление_ИнтеграционнаяОбработкаПриИзменении(Элемент)
	
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("ОтключитьОбновление_ИнтеграционнаяОбработка", ОтключитьОбновление_ИнтеграционнаяОбработка);
	_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("ОтключитьОбновление_ИнтеграционнаяОбработка",	  ОтключитьОбновление_ИнтеграционнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРаботуСКнопкамиОбменаПриИзменении(Элемент)

	ОтключитьРаботуСКнопкамиОбмена = Не ВключитьРаботуСКнопкамиОбмена;
	
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("ОтключитьРаботуСКнопкамиОбмена", ОтключитьРаботуСКнопкамиОбмена);
	_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("ОтключитьРаботуСКнопкамиОбмена",	 ОтключитьРаботуСКнопкамиОбмена);
	
	ПараметрыПодключенияMS = _ЛокКонтекст.КомЯдро_ПолучитьЗначениеПеременной("ПараметрыПодключенияMS");
	Если ПараметрыПодключенияMS = Неопределено ИЛИ ПараметрыПодключенияMS = Ложь Тогда
		ПараметрыПодключенияMS = _ЛокКонтекст.ЛокЯдро_ПолучитьДанныеИзХранилища1С("Cleverence_ПараметрыПодключенияMS");
	КонецЕсли;
	
	ПараметрыПодключенияMS.Вставить("ОтключитьРаботуСКнопкамиОбмена", ОтключитьРаботуСКнопкамиОбмена);
	
	_ЛокКонтекст.ЛокЯдро_СохранитьДанныеВХранилище1С("Cleverence_ПараметрыПодключенияMS", ПараметрыПодключенияMS);
	_ЛокКонтекст.КомЯдро_СохранитьЗначениеПеременной("ПараметрыПодключенияMS",			  ПараметрыПодключенияMS);
	
	Попытка
		_ЛокКонтекст.ЛокЯдро_ОбщийМодуль("Клеверенс_ОбщегоНазначенияВызовСервера").Клеверенс_Инициализация();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиТаймаутов(Команда)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСпискаНастройкиТаймаутов = ПолучитьФорму("ОФ_ФормаСписка_ТаймаутыИПорции", ЭтаФорма);
	#Иначе
		ФормаСпискаНастройкиТаймаутов = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСписка_ТаймаутыИПорции", , ЭтаФорма, ЭтаФорма);
	#КонецЕсли
	ФормаСпискаНастройкиТаймаутов.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаСпискаНастройкиТаймаутов._ЛокКонтекст = _ЛокКонтекст;
	ФормаСпискаНастройкиТаймаутов.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМетаданныеДокументов1С(Команда)
	
	_ЛокКонтекст.ЛокЯдро_ОбновлениеМетаданныхДокументов1С(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМетаданныеДокументовMS(Команда)
	
	_ЛокКонтекст.ЛокЯдро_СохранитьДанныеВХранилище1С("Cleverence_ДанныеУстройствMS",   Неопределено);
	_ЛокКонтекст.ЛокЯдро_СохранитьДанныеВХранилище1С("Cleverence_ДатаЗапросаЛицензий", Неопределено);
	
	пСтруктураМетаданных = _ЛокКонтекст.ЛокЯдро_ОбновитьМетаданныеДокументовMS(Ложь, Истина);
	
	_ЛокКонтекст.ЛокЯдро_ВыполнитьПроверкуБизнесПроцессовПоМетаданнымMS();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиMobileSMARTS(Команда)
	
	ПараметрыПодключенияMS = _ЛокКонтекст.ПараметрыПодключенияMS;
	Если ПараметрыПодключенияMS = Неопределено Тогда
		ПараметрыПодключенияMS = _ЛокКонтекст.ЛокЯдро_ПолучитьДанныеИзХранилища1С("Cleverence_ПараметрыПодключенияMS");
	КонецЕсли;
		
	ИдентификаторБазыMS = "";
	Если ТипЗнч(ПараметрыПодключенияMS) = Тип("Структура") Тогда
		ИдентификаторБазыMS = ?(ПараметрыПодключенияMS.Свойство("Ид"), ПараметрыПодключенияMS.Ид, "");
		ИдентификаторБазыMS = СтрЗаменить(ИдентификаторБазыMS, "-", "_");
	КонецЕсли;
	
	Если ПустаяСтрока(ИдентификаторБазыMS) Тогда
		Сообщение = НСтр("be = 'Не ўдалося вызначыць ідэнтыфікатар падключанай базы Cleverence!'; en = 'Failed to determine the identifier of the connected Cleverence database!'; es = 'No se pudo determinar el identificador de la base de datos conectada de Cleverence!'; ka = 'დაკვირვების იდენტიფიკატორი არ მოხდა კლევერენსის დაკვირვების ბაზაში!'; kk = 'Cleverence базасының айырмашылықты анықтау мүмкін емес!'; ro = 'Nu s-a putut determina identificatorul bazei de date Cleverence conectate!'; ru = 'Не удалось определить идентификатор подключенной базы Клеверенс!'; tr = 'Bağlı Cleverence veritabanı kimliği belirlenemedi!'; uk = 'Не вдалося визначити ідентифікатор підключеної бази Cleverence!'; uz = 'Уланган Cleverence базаси идентификаторини топиш мумкин эмас!'");
		Сообщить(Сообщение); 
		Возврат;		
	КонецЕсли;
	
	_ЛокКонтекст.ЛокЯдро_ОчиститьКэшируемыеНастройки(ИдентификаторБазыMS);
	
	ИнициализацияВФоне = _ЛокКонтекст.ДоступноВыполнениеВФоне И НЕ _ЛокКонтекст.РасположениеКомпоненты = "НаКлиенте";
		
	ОписаниеОповещения = Неопределено;
	Если ИнициализацияВФоне Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПроверкуБизнесПроцессовПослеИнициализации", ЭтаФорма);
	КонецЕсли;
	
	_ЛокКонтекст.ЛокЯдро_Инициализация(ПараметрыПодключенияMS, ОписаниеОповещения);
	
	Если НЕ ИнициализацияВФоне Тогда
		ВыполнитьПроверкуБизнесПроцессовПослеИнициализации(, Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуБизнесПроцессовПослеИнициализации(Результат = Неопределено, ДополнительныеПараметры) Экспорт
	
	Если Результат = "ОшибкаИнициализации" Тогда
		Возврат;
	КонецЕсли;
	
	_ЛокКонтекст.ЛокЯдро_ВыполнитьПроверкуБизнесПроцессовПоМетаданнымMS();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьВсеИнформационныеСообщения(Команда)

	НастройкиКВосстановлению = Новый Массив;
	НастройкиКВосстановлению.Добавить("ВыводИнфоСообщений1СФормыОбмена");
	НастройкиКВосстановлению.Добавить("ВыводИнфоСообщений1СПустойФормыОбмена");
	НастройкиКВосстановлению.Добавить("ВыводИнфоСообщенийMSФормыОбмена");
	НастройкиКВосстановлению.Добавить("ВыводИнфоСообщенийMSПустойФормыОбмена");
	НастройкиКВосстановлению.Добавить("НапоминаниеПроКнопочноеРасширение");
	НастройкиКВосстановлению.Добавить("ВыводИнфоСообщенийФормаСпискаОтборы");
	
	стрНастроек = _ЛокКонтекст.ЛокЯдро_ПолучитьСтруктуруПользовательскихНастроек();	
	
	Для Каждого элНастройка Из НастройкиКВосстановлению Цикл           
		стрНастроек.Вставить(элНастройка, Истина);
	КонецЦикла;  
	
	_ЛокКонтекст.ЛокЯдро_СохранитьДанныеВХранилище1С("Cleverence_НастройкиПодсказокПользователю", стрНастроек);
	_ЛокКонтекст.КомЯдро_СохранитьЗначениеПеременной("НастройкиПодсказокПользователю", стрНастроек);	
	
	Сообщение = НСтр("be = 'Уключана адлюстраванне ўсіх падказак.'; en = 'Display all tooltips enabled.'; es = 'Activada la visualización de todas las sugerencias.'; ka = 'ყველა მინიშნების ჩვენება ჩართულია.'; kk = 'Барлық көмекшілерді көрсету қосылған.'; ro = 'Activată afișarea tuturor sugestiilor.'; ru = 'Включено отображение всех подсказок.'; tr = 'Tüm ipuçlarının görüntülenmesi etkinleştirildi.'; uk = 'Увімкнено відображення всіх підказок.'; uz = 'Барча эслатмаларни кўрсатиш ёқилган.'");
	Сообщить(Сообщение); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьХранилищеОбщихНастроек(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ВопросОчиститьХранилищеОбщихНастроек1СЗавершение", ЭтаФорма);
	ТекстВопроса = НСтр("be = 'Будуць выдаленыя налады падлучэння да базы Cleverence пасля чаго патрабуецца наладзіць падлучэнне ўручную або праз майстар налад'; en = 'The connection settings to the Cleverence database will be deleted, after which you will need to configure the connection manually or through the settings wizard. Clear the shared 1C settings storage?'; es = 'Se eliminarán las configuraciones de conexión a la base de datos de Cleverence, luego será necesario configurar la conexión manualmente o a través del asistente de configuración. ¿Limpiar el almacén de configuraciones compartidas de 1C?'; ka = 'Cleverence ბაზასთან დაკავშირების პარამეტრები წაიშლება და შემდეგ გესმის ხელხელვა ან პარამეტრების მასტერით დაკავშირება. გსურთ 1C-ის საერთო პარამეტრების საწინააღმდეგოდ გასულის წაშლა?'; kk = 'Cleverence базасына қосылу орнату параметрлері жойылады, содан кейін параметрлерді қолдану үшін параметрлерді қолданушының қолымен немесе параметрлер мастері арқылы орнатуы қажет. 1С-нің жалпы параметрлер ағымын тазалау керек пе?'; ro = 'Vor fi șterse setările de conectare la baza de date Cleverence, după care va trebui să configurați manual conexiunea sau prin intermediul expertului de configurare. Ștergeți depozitul de setări comune 1C?'; ru = 'Будут удалены настройки подключения к базе Клеверенс после чего потребуется настроить подключение вручную или через мастер настроек. Очистить хранилище общих настроек 1С?'; tr = 'Cleverence veritabanı bağlantı ayarları silinecek, ardından bağlantı manuel olarak veya ayar sihirbazı aracılığıyla yeniden yapılandırılması gerekecek. 1C genel ayarlar deposunu temizlemek mi?'; uk = 'Будуть видалені налаштування підключення до бази Cleverence після чого потрібно буде налаштувати підключення вручну або через майстер налаштувань. Очистити сховище загальних налаштувань 1С?'; uz = ""Cleverence bazasiga ulanish sozlamalari o'chiriladi, so'ng ulanishni qo'llab-quvvatlash uchun qo'llanma yoki sozlash ustoz orqali sozlash kerak bo'ladi. 1C umumiy sozlamalarini tozalash kerakmi?""");
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0,КодВозвратаДиалога.Нет, ВРег(_ЛокКонтекст.ЛокЯдро_ТекстВнимание()) + "!"); 
		
КонецПроцедуры

&НаКлиенте
Процедура ВопросОчиститьХранилищеОбщихНастроек1СЗавершение(РезультатВопроса,Параметр) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		_ЛокКонтекст.ЛокЯдро_ОчиститьХранилищеОбщихНастроек1С();
		ЭтаФорма.ВладелецФормы.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьНастройкиПодключенияДругимПользователям1С(Команда)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСлужебная_ПодборПользователей1С = ПолучитьФорму("ОФ_ФормаСлужебная_ПодборПользователей1С", ЭтаФорма);
	#Иначе
		ФормаСлужебная_ПодборПользователей1С = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСлужебная_ПодборПользователей1С", , ЭтаФорма);	
	#КонецЕсли
	
	ФормаСлужебная_ПодборПользователей1С.ЗакрыватьПриЗакрытииВладельца 	= Истина;
	ФормаСлужебная_ПодборПользователей1С._ЛокКонтекст 					= _ЛокКонтекст;	
	ФормаСлужебная_ПодборПользователей1С.ПодборДляКопированияНастроек	= Истина;
	
	ОП = Новый ОписаниеОповещения("СкопироватьНастройкиПодключенияДругимПользователям1СЗавершение", ЭтаФорма);
	ФормаСлужебная_ПодборПользователей1С.ОписаниеОповещенияОЗакрытии = ОП;
	
	ФормаСлужебная_ПодборПользователей1С.Открыть();
КонецПроцедуры 

&НаКлиенте
Процедура СкопироватьНастройкиПодключенияДругимПользователям1СЗавершение(СписокПользователей, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(СписокПользователей) = Тип("СписокЗначений") Тогда
		_ЛокКонтекст.ЛокЯдро_СкопироватьНастройкиПодключенияДругимПользователям1С(СписокПользователей);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЕстьПравоАдминистрированияДанных() 
	Возврат ПравоДоступа("АдминистрированиеДанных", Метаданные);
КонецФункции

&НаКлиенте
Процедура ОбновитьЦветОтправкиСообщений()
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		Если ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов = "Выключена" Тогда
			Элементы.ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов.ЦветТекста = WebЦвета.Красный;
		ИначеЕсли ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов = "ТолькоОшибки" Тогда
			Элементы.ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов.ЦветТекста = WebЦвета.Золотистый;
		ИначеЕсли ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов = "ВсяИнформация" Тогда
			Элементы.ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов.ЦветТекста = WebЦвета.Зеленый;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьСообщенияНаТСДПослеЗагрузкиДокументовПриИзменении(Элемент)

	ОбновитьЦветОтправкиСообщений();
	
	Если ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов <> _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов") Тогда
		_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов", ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов);
		_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов",   ВыводитьСообщенияНаТСДПослеЗагрузкиДокументов);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуИмпортаНастроек(Команда)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСлужебная_ИмпортЭкспортНастроек = ПолучитьФорму("ОФ_ФормаСлужебная_ИмпортЭкспортНастроек", ЭтаФорма);
	#Иначе
		ФормаСлужебная_ИмпортЭкспортНастроек = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСлужебная_ИмпортЭкспортНастроек", , ЭтаФорма, ЭтаФорма);
	#КонецЕсли
	ФормаСлужебная_ИмпортЭкспортНастроек.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаСлужебная_ИмпортЭкспортНастроек.РежимОбмена = "Импорт";
	ФормаСлужебная_ИмпортЭкспортНастроек.ЗапускИзОсновнойОбработки = Истина;
	ФормаСлужебная_ИмпортЭкспортНастроек._ЛокКонтекст = _ЛокКонтекст;
	ФормаСлужебная_ИмпортЭкспортНастроек.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЭкспортаНастроек(Команда)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСлужебная_ИмпортЭкспортНастроек = ПолучитьФорму("ОФ_ФормаСлужебная_ИмпортЭкспортНастроек", ЭтаФорма);
	#Иначе
		ФормаСлужебная_ИмпортЭкспортНастроек = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСлужебная_ИмпортЭкспортНастроек", , ЭтаФорма, ЭтаФорма);
	#КонецЕсли
	ФормаСлужебная_ИмпортЭкспортНастроек.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаСлужебная_ИмпортЭкспортНастроек.РежимОбмена = "Экспорт";
	ФормаСлужебная_ИмпортЭкспортНастроек.ЗапускИзОсновнойОбработки = Истина;
	ФормаСлужебная_ИмпортЭкспортНастроек._ЛокКонтекст = _ЛокКонтекст;
	ФормаСлужебная_ИмпортЭкспортНастроек.Открыть();
КонецПроцедуры

#Если ТолстыйКлиентОбычноеПриложение Тогда
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	Объект = ЭтотОбъект;
#КонецЕсли
