#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область Печать

// Сформировать печатные формы объектов.
//
// Параметры:
//   МассивОбъектов        - Массив из Произвольный         - ссылки на объекты, которые нужно распечатать
//   ПараметрыПечати       - Структура                      - дополнительные настройки печати
//   КоллекцияПечатныхФорм - ТаблицаЗначений                - сформированные табличные документы (выходной параметр)
//   ОбъектыПечати         - СписокЗначений из Произвольный - имя области, в которой был выведен объект (выходной параметр)
//   ПараметрыВывода       - Структура                      - дополнительные параметры сформированных табличных документов (выходной параметр)
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТабличныйДокумент") Тогда
		
		ТабличныйДокумент = ПараметрыПечати.ТабличныйДокумент;
		Если ТипЗнч(ТабличныйДокумент) <> Тип("ТабличныйДокумент") Тогда
			Возврат;
		КонецЕсли;
		// ivcs }
		
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПроверкиИПодборКодовМаркировкиИСМП_ТабличныйДокумент";
			
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ТабличныйДокумент",
			НСтр("ru = 'Этикетки ИС МП'"),
			ТабличныйДокумент);
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииКомандПодключенныхКОбъекту(Команды) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

// Устанавливает связанные значения новому элементу справочник ШтрихкодыУпаковок при перемаркировке
// 
// Параметры:
// 	КодМаркировки - СправочникСсылка.ШтрихкодыУпаковокТоваров - Старый код маркировки
// 	НовыйКодМаркировки - СправочникСсылка.ШтрихкодыУпаковокТоваров - Новый код маркировки
Процедура УстановитьЗначенияНовогоКодаМаркировки(КодМаркировки, НовыйКодМаркировки) Экспорт
	
	Штрихкоды = Новый Массив;
	Штрихкоды.Добавить(КодМаркировки);
	Штрихкоды.Добавить(НовыйКодМаркировки);
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Штрихкоды, "Серия, СтатусУказанияСерий");
	Если Реквизиты[КодМаркировки].Серия <> Реквизиты[НовыйКодМаркировки].Серия Тогда
		ШтрихкодУпаковкиОбъект = НовыйКодМаркировки.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ШтрихкодУпаковкиОбъект, Реквизиты[КодМаркировки]);
		ШтрихкодУпаковкиОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли