
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ОтборТипДокумента) Тогда 
		ОтборТипДокумента = Параметры.ОтборТипДокумента;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ОтборГлавныйДокумент) Тогда 
		ОтборГлавныйДокумент = Параметры.ОтборГлавныйДокумент;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ОтборСвязанныйДокумент) Тогда 
		ОтборСвязанныйДокумент = Параметры.ОтборСвязанныйДокумент;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ОтборСписокФайлов) Тогда 
		ОтборСписокФайлов = Параметры.ОтборСписокФайлов;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ОтборСостояние) Тогда 
		ОтборСостояние = Параметры.ОтборСостояние;
	Иначе
		ОтборСостояние = Перечисления.КонтурЛогистика_ОтборыПоСостояниюЗадач.Все;
	КонецЕсли;
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьФормуПоИзменившимсяОтборам();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФормуПоИзменившимсяОтборам()
	
	УстановитьОтборДинСписка();
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьОтборДинСписка()
	
	Список.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(ОтборТипДокумента) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипДокумента");
		ЭлементОтбора.ПравоеЗначение = ОтборТипДокумента;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборСписокФайлов) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ПравоеЗначение = ОтборСписокФайлов;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборГлавныйДокумент) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГлавныйДокумент");
		ЭлементОтбора.ПравоеЗначение = ОтборГлавныйДокумент;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборСвязанныйДокумент) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СвязанныйДокумент");
		ЭлементОтбора.ПравоеЗначение = ОтборСвязанныйДокумент;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если  ОтборСостояние <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Все") Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние");
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СосотоянияФайловОбмена.Отправлен");
		
		Если ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Активные") Тогда
			
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
			
		ИначеЕсли ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Ошибки") Тогда
			
			ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СосотоянияФайловОбмена.ОшибкаОтправки");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			
		ИначеЕсли ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Входящие") Тогда
			
			ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СосотоянияФайловОбмена.Получен");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			
		Иначе
			
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();

	
КонецПроцедуры


&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	ОбновитьФормуПоИзменившимсяОтборам();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаПриИзменении(Элемент)
	ОбновитьФормуПоИзменившимсяОтборам();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСвязанныйДокументПриИзменении(Элемент)
	ОбновитьФормуПоИзменившимсяОтборам();
КонецПроцедуры

&НаКлиенте
Процедура ОтборГлавныйДокументПриИзменении(Элемент)
	ОбновитьФормуПоИзменившимсяОтборам();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Элементы.Список.Обновить();
КонецПроцедуры

