#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&ИзменениеИКонтроль("ЗаписатьОбъект")
Процедура АУ_ЗаписатьОбъект(ПроверятьСвязи)
	
	Отказ = Ложь;
	
	Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
	ОбъектXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
		Прокси,
		"DMInternalDocument",
		ВнешнийОбъект);
	
	Обработки.ИнтеграцияС1СДокументооборотБазоваяФункциональность.СформироватьДополнительныеСвойства(
		Прокси,
		ОбъектXDTO,
		ЭтотОбъект);
	
	// Заявки на оплату.
	Если ЯвляетсяЗаявкойНаОплату Тогда
		ЗаполнитьДанныеЗаявкиНаОплату();
	КонецЕсли;
	
	// Заполним простые свойства по реквизитам формы.
	СоответствиеРеквизитов =
		Справочники.ПравилаИнтеграцииС1СДокументооборотом.СоответствиеСвойствXDTOиРеквизитовФормыОбъектаДО(Тип);
	Для Каждого СтрокаСоответствия Из СоответствиеРеквизитов Цикл
		ИнтеграцияС1СДокументооборот.ЗаполнитьСвойствоXDTOизСтруктурыРеквизитов(
			Прокси,
			ОбъектXDTO,
			СтрокаСоответствия.Ключ,
			ЭтотОбъект,
			СтрокаСоответствия.Значение);
	КонецЦикла;
	
	// Заполним независимые состояния.
	Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ДоступенФункционалВерсииСервиса("1.3.2.3.CORP") Тогда
		
		ВозможныеСостояния =
			Справочники.ПравилаИнтеграцииС1СДокументооборотом.СоответствиеСвойствXDTOиСостоянийДокумента(Тип);
		Для Каждого СтрокаСоответствия Из ВозможныеСостояния Цикл
			ИнтеграцияС1СДокументооборот.ЗаполнитьСвойствоXDTOизСтруктурыРеквизитов(
				Прокси,
				ОбъектXDTO,
				СтрокаСоответствия.Ключ,
				ЭтотОбъект,
				СтрокаСоответствия.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПередЗаписьюДокумента(Прокси, ОбъектXDTO, ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектXDTO.name = Представление;
	Если ОбъектXDTO.Свойства().Получить("checkRelations") <> Неопределено Тогда
		ОбъектXDTO.checkRelations = ПроверятьСвязи;
	КонецЕсли;
	
	#Вставка
	Если ТипЗнч(ВнешнийОбъект) = Тип("СправочникСсылка.Претензии") Тогда
		
		ДопДанные = Новый Структура;
		ДопДанные.Вставить("АУ_НомерДоговора", ВнешнийОбъект.Наименование);
		ДопДанные.Вставить("АУ_Дата", ВнешнийОбъект.АУ_ДатаПретензии);
		ДопДанные.Вставить("АУ_ВидДоговора", ?(ВнешнийОбъект.ЭтоПретензияПоставщику, "Исходящая претензия", "Претензия от заказчика (штрафы/пени)"));
		ДопДанные.Вставить("АУ_КДоговоруНомер", СокрЛП(ВнешнийОбъект.Договор.Номер));
		ДопДанные.Вставить("АУ_ГК", СокрЛП(ВнешнийОбъект.Договор.Номер));
		
		Свойство = ОбъектXDTO.enabledProperties.Добавить(ЗначениеВСтрокуВнутр(ДопДанные));
	КонецЕсли;
	#КонецВставки
	Если ЗначениеЗаполнено(ID) И ЗначениеЗаполнено(Тип) Тогда // Обновление.
		
		ОбъектXDTO.objectID = ЭтотОбъектДО(Прокси);
		
		ТаблицаПодписей = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ТаблицаПодписей(
			ДеревоПодписей,,
			ID);
		ДанныеПодписейДокумента = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ДанныеПодписей(ТаблицаПодписей);
		ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьПодписиОбъектаXDTO(
			Прокси,
			ОбъектXDTO,
			ДанныеПодписейДокумента);
		
		Результат = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаписатьОбъект(Прокси, ОбъектXDTO);
		
		ОбъектXDTO = Результат.objects[0];
		
		Если ИспользоватьСвязанныеДокументы1СДокументооборота
				И ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ДоступенФункционалВерсииСервиса("2.1.0.1") Тогда
			Обработки.ИнтеграцияС1СДокументооборот.ЗаписатьСвязиНовогоДокумента(
				ДеревоСвязей,
				ID,
				Тип,
				Представление);
		КонецЕсли;
		
	Иначе // Создание.
		
		ОбъектXDTO.objectID = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьObjectID(Прокси);
		
		Запрос = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, "DMCreateRequest");
		Запрос.object = ОбъектXDTO;
		
		Результат = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ВыполнитьЗапрос(Прокси, Запрос);
		ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьВозвратВебСервиса(Прокси, Результат);
		
		ОбъектXDTO = Результат.object;
		ID = ОбъектXDTO.objectID.ID;
		Тип = ОбъектXDTO.objectID.type;
		Представление = Результат.object.name;
		
		Обработки.ИнтеграцияС1СДокументооборот.ЗаписатьФайлыНовогоДокумента(
			Файлы,
			ID,
			Тип,
			Представление,
			ВнешнийОбъект);
		
		Если ИспользоватьСвязанныеДокументы1СДокументооборота
				И ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ДоступенФункционалВерсииСервиса("2.1.0.1") Тогда
			Обработки.ИнтеграцияС1СДокументооборот.ЗаписатьСвязиНовогоДокумента(
				ДеревоСвязей,
				ID,
				Тип,
				Представление);
		КонецЕсли;
		
		// Возможно, созданному объекту нужно присвоить штрихкод.
		ИнтеграцияС1СДокументооборотБазоваяФункциональность.УстановитьШтрихкод(ВнешнийОбъект, ID, Тип);
		
	КонецЕсли;
	
	Если ТипЗнч(КонтрольОтправкиФайлов) = Тип("ХранилищеЗначения") Тогда
		ТаблицаКонтрольОтправкиФайлов = КонтрольОтправкиФайлов.Получить(); // см. ИнтеграцияС1СДокументооборотБазоваяФункциональность.КонтрольОтправкиФайлов
		Для Каждого Строка Из ТаблицаКонтрольОтправкиФайлов Цикл
			РегистрыСведений.КонтрольОтправкиФайловВ1СДокументооборот.СохранитьХешСуммуВерсииФайла(
				Строка.Источник,
				Строка.ИмяФайла,
				Строка.ТабличныйДокумент)
		КонецЦикла;
	КонецЕсли;
	
	// Запишем авансовый отчет заявки на расход ДС.
	Если ЯвляетсяЗаявкойНаОплату
		И (ПолучательТип = "DMUser"
			Или ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИмяТипаXDTO(ПолучательТип) = "DMUser") Тогда
		
		СвязьУжеЕсть = Ложь;
		АвансовыйОтчетXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПредопределенноеЗначениеДО(
			"DMRelationType", "АвансовыйОтчет"); //@NON-NLS-2
		ТипСвязиАвансовыйОтчет = Новый Структура("ID, Тип, Представление",
			АвансовыйОтчетXDTO.objectID.ID, АвансовыйОтчетXDTO.objectID.type, АвансовыйОтчетXDTO.name);
		ИсходныйДокумент = Новый Структура("ID, Тип, Представление", ID, Тип, Представление);
		
		Для Каждого ЭлТипСвязи Из ДеревоСвязей.ПолучитьЭлементы() Цикл
			Если ЭлТипСвязи.ID = ТипСвязиАвансовыйОтчет.ID Тогда
				
				Для Каждого ЭлСвязанныйДокумент Из ЭлТипСвязи.ПолучитьЭлементы() Цикл
					Если ЭлСвязанныйДокумент.ID = АвансовыйОтчетID
							И ЭлСвязанныйДокумент.Тип = АвансовыйОтчетТип Тогда
						СвязьУжеЕсть = Истина;
						
					Иначе
						СвязанныйДокумент = Новый Структура("ID, Тип, Представление",
							ЭлСвязанныйДокумент.ID, ЭлСвязанныйДокумент.Тип, ЭлСвязанныйДокумент.Заголовок);
						ИнтеграцияС1СДокументооборотВызовСервера.УдалитьСвязьДокументов(
							ИсходныйДокумент, СвязанныйДокумент, ТипСвязиАвансовыйОтчет);
						
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
		Если СвязьУжеЕсть = Ложь И АвансовыйОтчетID <> "" Тогда
			СвязанныйДокумент = Новый Структура("ID, Тип, Представление",
				АвансовыйОтчетID, АвансовыйОтчетТип, АвансовыйОтчет);
			ИнтеграцияС1СДокументооборотВызовСервера.ДобавитьСвязьДокументов(
				ИсходныйДокумент, СвязанныйДокумент, ТипСвязиАвансовыйОтчет);
		КонецЕсли;
		
	КонецЕсли;
	
	ПрочитатьОбъектВФорму(ОбъектXDTO);
	
	Если ОбъектXDTO.Установлено("keyPropertiesValue") Тогда
		АдресДвоичныхДанныхОбъекта.АдресСлепкаДокумента = ПоместитьВоВременноеХранилище(
			ОбъектXDTO.keyPropertiesValue, УникальныйИдентификатор);
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти
