#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_ЗагрузитьДанные", "Загрузить из Excel", "АУ_ЗагрузитьДанные");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ЗагрузитьДанные", "ТоварыГруппаЗаполнить", , "АУ_ЗагрузитьДанные", 1);

	АУ_ОбщиеПроцедурыИФункцииСервер.ОтключитьВидимостьНоменклатурыИзАрхиваВФормеДокумента(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АУ_ЗагрузитьДанные(Команда)

	ОткрытьФорму("Обработка.АУ_ЗагрузкаДанныхВДокументы.Форма.ЗагрузкаВКомплектацию", , ЭтаФорма, , , , Новый ОписаниеОповещения("АУ_ЗагрузкаДанныхЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура АУ_ЗагрузкаДанныхЗавершение(Значение, ДопПараметры) Экспорт

	Если ЭтоАдресВременногоХранилища(Значение) Тогда

		АУ_ЗагрузкаДанныхЗавершениеСервер(Значение);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнийКодСтроки()
	
	Результат=1;
	Для каждого стрТовары Из Объект.Товары Цикл
		Результат=Макс(стрТовары.КодСтроки,Результат);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура АУ_ЗагрузкаДанныхЗавершениеСервер(АдресХранилища)

	ТЗ = ПолучитьИзВременногоХранилища(АдресХранилища);
	КодСтроки = ПолучитьПоследнийКодСтроки();
	Для каждого стрТЗ Из ТЗ Цикл

		КодСтроки = КодСтроки+1;
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = стрТЗ.Номенклатура;
		НоваяСтрока.КоличествоУпаковок = стрТЗ.Количество;
		НоваяСтрока.Количество = стрТЗ.Количество;
		НоваяСтрока.КодСтроки = КодСтроки;
		НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;

	КонецЦикла;

	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти
