
&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НоваяКоманда = Команды.Добавить("АУ_ЗагрузитьДанные");
	НоваяКоманда.Заголовок = "Загрузить из Excel";
	НоваяКоманда.Действие = "АУ_ЗагрузитьДанные"; //указываем только имя процедуры
	
	НовыйЭлемент = Элементы.Добавить("АУ_ЗагрузитьДанные", Тип("КнопкаФормы"),Элементы.ТоварыГруппаЗаполнить);
	НовыйЭлемент.ИмяКоманды = "АУ_ЗагрузитьДанные";
	НовыйЭлемент.Вид=ВидКнопкиФормы.КнопкаКоманднойПанели;
	
	АУ_ОбщиеПроцедурыИФункцииСервер.ОтключитьВидимостьНоменклатурыИзАрхиваВФормеДокумента(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗагрузитьДанные(Команда)
	
	ОткрытьФорму("Обработка.АУ_ЗагрузкаДанныхВДокументы.Форма.ЗагрузкаВКомплектацию",,ЭтаФорма,,,,Новый ОписаниеОповещения("АУ_ЗагрузкаДанныхЗавершение",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗагрузкаДанныхЗавершение(Значение,ДопПараметры) Экспорт
	
	Если ЭтоАдресВременногоХранилища(Значение) Тогда
		АУ_ЗагрузкаДанныхЗавершениеСервер(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнийКодСтроки()
	
	Результат=1;
	Для каждого стрТовары Из Объект.Товары Цикл
		Результат=Макс(стрТовары.КодСтроки,Результат);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура АУ_ЗагрузкаДанныхЗавершениеСервер(АдресХранилища)
	
	ТЗ=ПолучитьИзВременногоХранилища(АдресХранилища);
	КодСтроки=ПолучитьПоследнийКодСтроки();
	Для каждого стрТЗ Из ТЗ Цикл
		
		КодСтроки=КодСтроки+1;
		НоваяСтрока=Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура=стрТЗ.Номенклатура;
		НоваяСтрока.КоличествоУпаковок=стрТЗ.Количество;
		НоваяСтрока.Количество=стрТЗ.Количество;
		НоваяСтрока.КодСтроки=КодСтроки;
		НоваяСтрока.ИдентификаторСтроки=Новый УникальныйИдентификатор;
		
	КонецЦикла;
	
	Модифицированность=Истина;
	
КонецПроцедуры
