#Область СлужебныеПроцедурыИФункции

&После("ПриСозданииНаСервере")
Процедура АУ_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	Если СтрНайти(Форма.ИмяФормы, "Обработка.АУ_ОбращениеВПоддержку") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКомандыПроблемы = "АУ_СообщитьОПроблеме";
	Если Форма.Команды.Найти(ИмяКомандыПроблемы) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КомандаФормы = Форма.Команды.Добавить(ИмяКомандыПроблемы);
	КомандаФормы.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	КомандаФормы.Заголовок = НСтр("ru = 'Сообщить о проблеме'");
	
	Если Метаданные.ОбщиеКартинки.Найти("Сообщение") <> Неопределено Тогда
		КомандаФормы.Картинка = БиблиотекаКартинок.Сообщение;
	КонецЕсли;
	
	ПанельКоманд = Форма.Элементы.Найти("ФормаКоманднаяПанель");
	Если ПанельКоманд = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КнопкаКоманды = Форма.Элементы.Вставить(ИмяКомандыПроблемы, Тип("КнопкаФормы"), ПанельКоманд);
	КнопкаКоманды.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КнопкаКоманды.ИмяКоманды = ИмяКомандыПроблемы;
	
КонецПроцедуры

#КонецОбласти
