#Область СлужебныеПроцедурыИФункции

&После("ПриСозданииНаСервере")
Процедура АУ_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	Если СтрНайти(Форма.ИмяФормы, "Обработка.АУ_ОбращениеВПоддержку") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКомандыПроблемы = "АУ_СообщитьОПроблеме";
	Если Форма.Команды.Найти(ИмяКомандыПроблемы) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ФормаКоманднаяПанель") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(
		Форма,
		ИмяКомандыПроблемы,
		НСтр("ru = 'Сообщить о проблеме'"),
		"Подключаемый_ВыполнитьПереопределяемуюКоманду");
	
	Если Метаданные.ОбщиеКартинки.Найти("Сообщение") <> Неопределено Тогда
		Форма.Команды[ИмяКомандыПроблемы].Картинка = БиблиотекаКартинок.Сообщение;
	КонецЕсли;
	
	СвойстваКнопки = Новый Структура;
	СвойстваКнопки.Вставить("Вид", ВидКнопкиФормы.КнопкаКоманднойПанели);
	
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(
		Форма,
		ИмяКомандыПроблемы,
		"ФормаКоманднаяПанель",
		,
		ИмяКомандыПроблемы,
		0,
		СвойстваКнопки);
	
КонецПроцедуры

#КонецОбласти
