#Область ПрограммныйИнтерфейс
// Проверить доступность каталога на сервере.
// 
// Параметры:
//  ПутьККаталогуНаСервере - Строка - Путь к каталогу на сервере
//  ПроверятьДоступностьДляЗаписи - Булево - Проверять доступность для записи
//  ОписаниеРезультата - Строка - Возвращается описание результата в случае ошибки
// 
// Возвращаемое значение:
//  Булево - Результат доступности каталога на сервере
Функция ПроверитьДоступностьКаталогаНаСервере(Знач ПутьККаталогуНаСервере, ПроверятьДоступностьДляЗаписи = Ложь,
	ОписаниеРезультата = "") Экспорт
	ПутьДоступен = Истина;

	Если ПустаяСтрока(ПутьККаталогуНаСервере) Тогда
		ПутьДоступен = Ложь;
		ОписаниеРезультата = НСтр("ru = 'Путь не задан'");
	КонецЕсли;

	Если ПутьДоступен Тогда
		Попытка
			ПапкаФайлов = Новый Файл(ПутьККаталогуНаСервере);
		Исключение
			ПутьДоступен = Ложь;
			ОписаниеРезультата = СтрШаблон(НСтр("ru = 'Ошибка %1'"), ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;

	Если ПутьДоступен Тогда
		Если Не ПапкаФайлов.Существует() Тогда
			ПутьДоступен = Ложь;
			ОписаниеРезультата = СтрШаблон(НСтр("ru = 'Каталог %1 отсутствует'"), ПутьККаталогуНаСервере);
		КонецЕсли;
	КонецЕсли;

	Если ПутьДоступен Тогда
		Если Не ПапкаФайлов.ЭтоКаталог() Тогда
			ПутьДоступен = Ложь;
			ОписаниеРезультата = СтрШаблон(НСтр("ru = '%1 не является каталогом'"), ПутьККаталогуНаСервере);
		КонецЕсли;
	КонецЕсли;

	ИмяВФ = "temp.tmp";

	Если ПутьДоступен И ПроверятьДоступностьДляЗаписи Тогда
		Текст = Новый ТекстовыйДокумент;
		Текст.ДобавитьСтроку("Проверка");
		Попытка
			Текст.Записать(СформироватьПутьККаталогу(ПутьККаталогуНаСервере) + ИмяВФ);
		Исключение
			ПутьДоступен = Ложь;
			ОписаниеРезультата = СтрШаблон(НСтр("ru = 'Каталог %1 не доступен для записи'"), ПутьККаталогуНаСервере);
		КонецПопытки;
	КонецЕсли;

	Если ПутьДоступен И ПроверятьДоступностьДляЗаписи Тогда
		Попытка
			УдалитьФайлы(СформироватьПутьККаталогу(ПутьККаталогуНаСервере) + ИмяВФ);
		Исключение
			ПутьДоступен = Ложь;
			ОписаниеРезультата = СтрШаблон(НСтр("ru = 'Каталог %1 не доступен для удаления файлов'"),
				ПутьККаталогуНаСервере);
		КонецПопытки;
	КонецЕсли;
	Возврат ПутьДоступен;
КонецФункции

// Сформировать путь к каталогу. Дополняет разделителем путь, если его нет.
// 
// Параметры:
//  ПутьККаталогуНаСервере - Строка - Путь к каталогу на сервере
// 
// Возвращаемое значение:
//  Строка - Путь к каталогу
Функция СформироватьПутьККаталогу(Знач ПутьККаталогуНаСервере) Экспорт
	Если Не Прав(СокрЛП(ПутьККаталогуНаСервере), 1) = ПолучитьРазделительПути() Тогда
		Возврат СокрЛП(ПутьККаталогуНаСервере) + ПолучитьРазделительПути();
	Иначе
		Возврат СокрЛП(ПутьККаталогуНаСервере);
	КонецЕсли;
КонецФункции
#КонецОбласти