Процедура ОбновитьТипПодписиЧерезДиадок() Экспорт
	
	Если ТипПодписи = Перечисления.КонтурЛогистика_ТипыПодписи.Тестовая Тогда
		Возврат;	
	КонецЕсли;
	
	ДвоичныеДанныеСертификата = ДанныеСертификата.Получить();
		
	Если ЗначениеЗаполнено(ДвоичныеДанныеСертификата) Тогда
		
		НашаОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЛюбаяНашаОрганизация();
		
		Если ЗначениеЗаполнено(ДвоичныеДанныеСертификата) И ЗначениеЗаполнено(НашаОрганизация) И ЗначениеЗаполнено(НашаОрганизация.ID) Тогда
			
			Результат = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ВыполнитьПроверкуСертификатаЧерезДиадок(НашаОрганизация.ID, ДвоичныеДанныеСертификата);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
			Записать();			
			
		КонецЕсли;
			
	КонецЕсли;	
	
КонецПроцедуры

