&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлючОшибки = Параметры.КлючОшибки;
	
	Заголовок = "Электронная транспортная накладная " + Объект.НомерТрН + " от " + Объект.ДатаТрН;
	
	ПогрузкуОсуществляетДругаяОрганизация = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПогрузкуОсуществляетДругаяОрганизация(Объект.Ссылка);
	
	СтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.Ссылка);
	Если ЗначениеЗаполнено(СтатусДокументооборота) 
		И СтатусДокументооборота.Код <> "r-wait-storekeeper" Тогда // при ожидании кладовщика даем редактирование
		
		ТолькоПросмотр = Истина;
		Элементы.ФормаЗаписатьИЗакрыть.Видимость = Ложь;
		Элементы.ФормаЗаписать.Видимость = Ложь;
		
	КонецЕсли;
	
	СвязанныеДокументыТитулы.Параметры.УстановитьЗначениеПараметра("ДокументЭТРН", Объект.Ссылка);
	Элементы.КомментарииВодителяПриВыгрузке.Видимость = ЗначениеЗаполнено(Объект.КомментарииВодителяПриВыгрузке);
	Элементы.КомментарииВодителяПриПогрузке.Видимость = ЗначениеЗаполнено(Объект.КомментарииВодителяПриПогрузке);
	
	Элементы.ГруппаПометкаУдаление.Видимость = Объект.ПометкаУдаления;
	
	ЭлементыДляРазрешенияРедактирования = Новый Массив;
	ЭлементыДляРазрешенияРедактирования.Добавить("УИД");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ЭлементыДляРазрешенияРедактирования);
	
	УстановитьВидимостьИнфоПереодресовокИЗамен(ЭтаФорма);
	
	УправлениеОтображениемПредупреждение();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы = Истина Тогда 
		Возврат; 
	КонецЕсли;	
		
	Если Не ОписаниеОповещенияОЗакрытии = Неопределено  
		 И ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		
		ДополнительныеПараметры = ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры;
		
		Если ДополнительныеПараметры = Неопределено Тогда 
			ДополнительныеПараметры = Новый Структура("ДокументЭТРН", Объект.Ссылка);
		Иначе 
			ДополнительныеПараметры.Вставить("ДокументЭТРН",  Объект.Ссылка);
		КонецЕсли;	
		
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения(ОписаниеОповещенияОЗакрытии.ИмяПроцедуры, 
			ОписаниеОповещенияОЗакрытии.Модуль, ДополнительныеПараметры);
		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РассчитатьОформлениеЭлементов();
			
КонецПроцедуры

&НаКлиенте
Процедура ПогрузкуОсуществляетДругаяОрганизацияПриИзменении(Элемент)
	
	РассчитатьОформлениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОформлениеЭлементов()

	Элементы.ГруппаПогрузкуОсуществляетДругаяОрганизация.Видимость = ПогрузкуОсуществляетДругаяОрганизация = Истина; 	
	Элементы.ГруппаЭкспедицияРеквизиты.Видимость = Объект.ЭтоЭкспедиция = Истина; 	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СвязанныеДокументыТитулы.Параметры.УстановитьЗначениеПараметра("ДокументЭТРН", Объект.Ссылка);
	Элементы.КомментарииВодителяПриВыгрузке.Видимость = ЗначениеЗаполнено(Объект.КомментарииВодителяПриВыгрузке);
	Элементы.КомментарииВодителяПриПогрузке.Видимость = ЗначениеЗаполнено(Объект.КомментарииВодителяПриПогрузке);

КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументыТитулыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекКолонка = Поле;
		ИмяКолонки = ТекКолонка.Имя;
		
		Если ИмяКолонки = "СвязанныеДокументыТитулыСсылка" Тогда 
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
			ТекущиеДанные.Ссылка);
			
		ИначеЕсли ИмяКолонки = "СвязанныеДокументыТитулыДокументОснование" Тогда 
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
			ТекущиеДанные.ДокументОснование);
			
		ИначеЕсли ИмяКолонки = "СвязанныеДокументыТитулыФайлОбмена" Тогда 
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
			ТекущиеДанные.ФайлОбмена);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоЭкспедицияПриИзменении(Элемент)
	РассчитатьОформлениеЭлементов();	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьИнфоПереодресовокИЗамен(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаИнфоПереадресовки.Видимость 	= ЗначениеЗаполнено(Объект.КоличествоПереадресовок);
	Элементы.ГруппаПереадресовка.Видимость 		= ЗначениеЗаполнено(Объект.ПереадресовкаИсходныйПолучатель) Или ЗначениеЗаполнено(Объект.ПереадресовкаИсходноеМестоДоставки);
	Элементы.ГруппаКомуАдресованВозврат.Видимость = ЗначениеЗаполнено(Объект.ВозвратПолучатель) Или ЗначениеЗаполнено(Объект.ВозвратМесто);
	Элементы.ГруппаИнфоСменыВодителя.Видимость 	= ЗначениеЗаполнено(Объект.КоличествоСменВодителей);
	Элементы.ГруппаИнфоСменыТС.Видимость 		= ЗначениеЗаполнено(Объект.КоличествоСменТС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктКолбасыНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоКолбасеКТитулу(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()

	ЭтаФорма.Прочитать();
	УправлениеКолбасойТитуловВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеКолбасойТитуловВызовСервера()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УправлениеСтатусомПодписиИКолбасойТитулов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "ПометкаУдаленияДокумента" Тогда
		
		ЭтаФорма.Прочитать();		
		Элементы.ГруппаПометкаУдаление.Видимость = Объект.ПометкаУдаления;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеОтображениемПредупреждение()
	
	Титул1 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Титул1) Тогда 
		
		Файл = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(Титул1);
		
		РазличныеУИДВCustomData = Справочники.КонтурЛогистика_ФайлыОбмена.РазличныеУИДВCustomDataФайла(Файл);
		Элементы.ГруппаПредупреждение.Видимость = РазличныеУИДВCustomData;
		
		Если РазличныеУИДВCustomData Тогда
			Элементы.ОписаниеПредупреждения.Заголовок = "В таблице CustomData записаны несколько различных УИД. Возможна ошибка при отправке титула. Обратитесть в тех поддержку";
		Иначе
			Элементы.ОписаниеПредупреждения.Заголовок = "";
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаПредупреждение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитов(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.РазрешитьРедактированиеРеквизитов(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ПогрузкуОсуществляетДругаяОрганизация Тогда
		
		Объект.ПогрузкуОсуществляет = "";
		Объект.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку = "";
		Объект.ПогрузкуОсуществляетПодразделение = "";
		Объект.ПогрузкаДоговор = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	РассчитатьПартнераГО();
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Перевозчик) Тогда
		Возврат;
	КонецЕсли;
		
	ТранспортноеСредствоПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Объект.Перевозчик, "ТранспортноеСредствоПоУмолчанию");
	ВодительПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Объект.Перевозчик, "ВодительПоУмолчанию");
	Водитель2ПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Объект.Перевозчик, "Водитель2ПоУмолчанию");
	
	ИспользуютсяРеквизитыПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ИспользуютсяРеквизитыПоУмолчаниюВОрганизации();
	
	Если ИспользуютсяРеквизитыПоУмолчанию Тогда
		Объект.ТранспортноеСредство = ТранспортноеСредствоПоУмолчанию;
	КонецЕсли;
	
	Если ИспользуютсяРеквизитыПоУмолчанию И ЗначениеЗаполнено(ТранспортноеСредствоПоУмолчанию) Тогда
			
		ПрицепПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(ТранспортноеСредствоПоУмолчанию, "ПрицепПоУмолчанию");
		Объект.Прицеп = ПрицепПоУмолчанию;
		
		Прицеп2ПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(ТранспортноеСредствоПоУмолчанию, "Прицеп2ПоУмолчанию");
		Объект.Прицеп2 = Прицеп2ПоУмолчанию;
		
	КонецЕсли;
	
	РассчитатьПартнераПВ();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	РассчитатьПартнераГП();
КонецПроцедуры

&НаСервере
Процедура РассчитатьПартнераГО()

	Если ЗначениеЗаполнено(Объект.Грузоотправитель) Тогда 
		Объект.ПартнерГрузоотправитель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Объект.Грузоотправитель);
	Иначе
		Объект.ПартнерГрузоотправитель = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РассчитатьПартнераПВ()

	Если ЗначениеЗаполнено(Объект.Перевозчик) Тогда 
		Объект.ПартнерПеревозчик = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Объект.Перевозчик);
	Иначе
		Объект.ПартнерПеревозчик = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РассчитатьПартнераГП()

	Если ЗначениеЗаполнено(Объект.Грузополучатель) Тогда 
		Объект.ПартнерГрузополучатель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(Объект.Грузополучатель);
	Иначе
		Объект.ПартнерГрузополучатель = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ИспользуютсяРеквизитыПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ИспользуютсяРеквизитыПоУмолчаниюВОрганизации();
	Если ИспользуютсяРеквизитыПоУмолчанию Тогда
		Если Не ЗначениеЗаполнено(ВодительПоУмолчанию) И ЗначениеЗаполнено(Объект.Перевозчик) Тогда
			ВодительПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
				Объект.Перевозчик, "ВодительПоУмолчанию");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Водитель2ПоУмолчанию) И ЗначениеЗаполнено(Объект.Перевозчик) Тогда
			Водитель2ПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
				Объект.Перевозчик, "Водитель2ПоУмолчанию");
		КонецЕсли;
		
		РеквизитыПоУмолчанию = Новый Структура;
		РеквизитыПоУмолчанию.Вставить("ВодительПоУмолчанию", ВодительПоУмолчанию);
		РеквизитыПоУмолчанию.Вставить("Водитель2ПоУмолчанию", Водитель2ПоУмолчанию);
		
		Оповестить("КонтурЛогистика_ОбновитьВодителяПоУмолчанию", РеквизитыПоУмолчанию);
	КонецЕсли;
	
КонецПроцедуры
