#Область СлужебныйПрограммныйИнтерфейс

// В процедуре нужно реализовать возможность работы с видами продукции, с которыми предполагается работа объектов.
//
// Параметры:
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования.
//  Контекст - Неопределено, ФормаКлиентскогоПриложения, ДокументСсылка - Описание
//  ВидПродукции - Массив Из СправочникСсылка.ВидыПродукцииИС - Вид продукции, по которому будут инициализированы параметры сканирования
//  Сценарий - Число - сценарий при наличии нескольких возможных сценариев.
Процедура ПриЗаполненииПараметровСканирования(ПараметрыСканирования, Контекст, ВидПродукции, Сценарий = 0) Экспорт
	
	//++ НЕ ГОСИС
	ИнтеграцияИСУТКлиентСервер.ВключитьПоддержкуВидовПродукцииИС(Контекст, ПараметрыСканирования, ВидПродукции, Сценарий);
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

// БРМК. При экранировании кода маркировки.
// В методе полный код маркировки конвертировать в значение, которое срохраняется в см. ОпределяемыйТип.ШтрихкодУпаковкиИС
// Параметры:
//  КодМаркировки - Строка - полный код маркировки, содерщаний символ <GS>
Процедура ПриЭкранированнииПолногоКодаМаркировки(КодМаркировки) Экспорт
	
	Возврат;
	
КонецПроцедуры

// БРМК. При восстановлении экранированного кода маркировки.
// В методе необходим восстанавить исходной код маркировки, если он был изменен при первоначальной обработке.
// Параметры:
//  КодМаркировки - Строка - экранированный маркировки, который необхоидимо восстановить.
Процедура ПриВосстановленииЭкранированногоКодаМаркировки(КодМаркировки) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
