//@strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Объект") Тогда
		
		ТочкаДоставки = Параметры.Объект;
		ОсновнаяТочкаДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТочкаДоставки, "ОсновнаяТочка");
		
	Иначе
		
		ТекстИсключения = НСтр("ru = 'Форма не предназначена для непосредственного открытия'");
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьЭлементов();
	НастроитьДоступностьФлажков();
	ИзменитьФлажки(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	СоответствиеРеквизитов = Новый Соответствие;
	СоответствиеРеквизитов.Вставить("РазрешитьРедактированиеВладелец", "Владелец");
	СоответствиеРеквизитов.Вставить("РазрешитьРедактированиеАдрес", "Адрес");
	СоответствиеРеквизитов.Вставить("РазрешитьРедактированиеЗонаДоставки", "ЗонаДоставки");
	
	//++ Локализация
	СоответствиеРеквизитов.Вставить("РазрешитьРедактированиеИдентификаторТочкиДоставки", "ИдентификаторТочкиДоставки");
	СоответствиеРеквизитов.Вставить("РазрешитьРедактированиеПереопределитьИдентификатор", "ИдентификаторПереопределен");
	//-- Локализация
	
	Результат = Новый Массив; // Массив из Строка
	Для Каждого КлючЗначение Из СоответствиеРеквизитов Цикл
		
		Если ЭтотОбъект[КлючЗначение.Ключ] = Истина Тогда
			
			Результат.Добавить(КлючЗначение.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИспользование(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПроверитьИспользованиеЗавершение", ЭтотОбъект);
	ДлительнаяОперация = ПроверитьИспользованиеНаСервере();
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ИзменитьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ИзменитьФлажки(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьДоступностьФлажков()
	
	Если ОсновнаяТочкаДоставки Тогда
		
		МассивЭлементов = Новый Массив; // Массив из Строка
		МассивЭлементов.Добавить(Элементы.РазрешитьРедактированиеВладелец.Имя);
		МассивЭлементов.Добавить(Элементы.РазрешитьРедактированиеАдрес.Имя);
		
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Доступность", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажки(Значение)
	
	РазрешитьРедактированиеЗонаДоставки = Значение;
	
	Если НЕ ОсновнаяТочкаДоставки Тогда
		
		РазрешитьРедактированиеВладелец = Значение;
		РазрешитьРедактированиеАдрес = Значение;
		
	КонецЕсли;
	
	//++ Локализация
	РазрешитьРедактированиеИдентификаторТочкиДоставки = Значение;
	РазрешитьРедактированиеПереопределитьИдентификатор = Значение;
	//-- Локализация
	
КонецПроцедуры

&НаСервере
Функция ПроверитьИспользованиеНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ДоставкаТоваров.ТочкаИспользуетсяПриПланированииДоставки",
		ТочкаДоставки);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьИспользованиеЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ТочкаИспользуется = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата); // Булево
		НастроитьВидимостьЭлементов(ТочкаИспользуется);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда 
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			РезультатВыполнения.КраткоеПредставлениеОшибки,
			,
			"ПроверитьИспользование");
		
		НастроитьВидимостьЭлементов();
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ТочкаДоставкиИспользуется - Булево
//
&НаКлиенте
Процедура НастроитьВидимостьЭлементов(ТочкаДоставкиИспользуется = Неопределено)
	
	МассивВсехЭлементов = Новый Массив; // Массив из Строка
	МассивВсехЭлементов.Добавить(Элементы.ДекорацияОбъектИспользуется.Имя);
	МассивВсехЭлементов.Добавить(Элементы.ДекорацияОбъектНеИспользуется.Имя);
	МассивВсехЭлементов.Добавить(Элементы.ДекорацияРекомендация.Имя);
	
	МассивВидимых = Новый Массив; // Массив из строка
	
	Если ТочкаДоставкиИспользуется = Неопределено Тогда
		
		МассивВидимых.Добавить(Элементы.ДекорацияРекомендация.Имя);
		
	ИначеЕсли ТочкаДоставкиИспользуется Тогда
		
		МассивВидимых.Добавить(Элементы.ДекорацияОбъектИспользуется.Имя);
		
	Иначе
		
		МассивВидимых.Добавить(Элементы.ДекорацияОбъектНеИспользуется.Имя);
		
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьВидимостьЭлементовПоМассиву(
		Элементы, МассивВсехЭлементов, МассивВидимых);
	
КонецПроцедуры

#КонецОбласти
