#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Правило = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Правило").Значение;
	Если ТипЗнч(Правило) <> Тип("СправочникСсылка.ПравилаПоискаДублейНСИ") Тогда
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("Группа");
		ТаблицаДанных.Колонки.Добавить("Дубль");
		ТаблицаДанных.Колонки.Добавить("Код");
	Иначе
		Запрос = Справочники.ПравилаПоискаДублейНСИ.СформироватьЗапросПоПравилу(Правило);
		Переопределяемое = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Правило, "Переопределяемое");
		
		Если Переопределяемое Тогда
			ТаблицаДанных = Запрос.Выполнить().Выгрузить();
			ТаблицаДанных.Колонки.Удалить("Ссылка1");
			ТаблицаДанных.Свернуть("Дубль, Группа, Код");
		Иначе
			ТаблицаДанных = РегистрыСведений.ДублиНСИКПодтверждению.РаспределитьДублиПоГруппам(Запрос.Выполнить().Выгрузить(), Правило);
		
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаДанных.ГруппаДублей КАК ГруппаДублей,
			|	ТаблицаДанных.Дубль КАК Дубль
			|ПОМЕСТИТЬ ВТ_ТаблицаДанных
			|ИЗ
			|	&ТаблицаДанных КАК ТаблицаДанных
			|;
			|ВЫБРАТЬ
			|	ТаблицаДанных.ГруппаДублей КАК ГруппаДублей,
			|	ТаблицаДанных.Дубль.Наименование КАК Наименование,
			|	ТаблицаДанных.Дубль.Код КАК Код,
			|	ТаблицаДанных.Дубль КАК Ссылка
			|ИЗ
			|	ВТ_ТаблицаДанных КАК ТаблицаДанных
			|ИТОГИ ПО
			|	ТаблицаДанных.ГруппаДублей";
		
			Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
			ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Правило, "ОбъектМетаданных");
			Ссылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторОбъектаМетаданных, "ЗначениеПустойСсылки");
			МетаданныеОбъекта = Ссылка.Метаданные();
			Если МетаданныеОбъекта.ДлинаКода = 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаДанных.Дубль.Код", """""");
			КонецЕсли;
			Если МетаданныеОбъекта.ДлинаНаименования = 0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаДанных.Дубль.Наименование", """""");
			КонецЕсли;
	
			ВыборкаГруппа = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ТаблицаДанных.Колонки.Добавить("Группа");
			ТаблицаДанных.Колонки.Добавить("Код");
			Пока ВыборкаГруппа.Следующий() Цикл
				Выборка = ВыборкаГруппа.Выбрать();
				МассивЭлементов = Новый Массив;
				Пока Выборка.Следующий() Цикл
					МассивЭлементов.Добавить(Выборка.Наименование);
					СтрокиДанных = ТаблицаДанных.НайтиСтроки(Новый Структура("Дубль", Выборка.Ссылка));
					СтрокиДанных[0].Код = Выборка.Код;
				КонецЦикла;
				НаименованиеГруппы = РегистрыСведений.ДублиНСИКПодтверждению.ПредставлениеГруппы(МассивЭлементов);
				СтруктураПоиска = Новый Структура("ГруппаДублей", ВыборкаГруппа.ГруппаДублей);
				СтрокиДанных = ТаблицаДанных.НайтиСтроки(СтруктураПоиска);
				Для Каждого Строка Из СтрокиДанных Цикл
					Строка.Группа = НаименованиеГруппы;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТаблицаДанных", ТаблицаДанных);
	
	НастройкиСКД = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиСКД, ДанныеРасшифровки);
	ПроцессорКомпоновкиСКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиСКД.Инициализировать(Макет, СтруктураДанных, ДанныеРасшифровки);
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиСКД);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВариантыОтчетов

// Задать настройки формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//         - Неопределено
//   КлючВарианта - Строка
//                - Неопределено
//   Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения СКД отчета.
//
// Параметры:
//   Контекст - Произвольный
//   КлючСхемы - Строка
//   КлючВарианта - Строка
//                - Неопределено
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных
//                    - Неопределено
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных
//                                    - Неопределено
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") И Контекст.Параметры.Свойство("Правило") Тогда 
		НовыеНастройкиКД.ПараметрыДанных.УстановитьЗначениеПараметра("Правило",Контекст.Параметры.Правило);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли