// @strict-types
#Область ПрограммныйИнтерфейс

// Генерация текста события, для записиси в журнал регистрации
// 
// Параметры:
//  ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - вид электронной торговой площадки
// 
// Возвращаемое значение:
// 	Строка - текст события
//  
Функция СобытиеЖурналаРегистрации(ВидЭТП) Экспорт

	ПредставлениеВидаЭТП = XMLСтрока(ВидЭТП);

	ШаблонТекстаСобытия = "ru = 'Интеграция с %1'";
	ТекстСобытия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(ШаблонТекстаСобытия,
		ОбщегоНазначения.КодОсновногоЯзыка()), ПредставлениеВидаЭТП);

	Возврат ТекстСобытия;

КонецФункции

// Возвращает список используемых подсистемой префиксов настроек.
// Параметры:
//   ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - электронная торговая площадка.
//
// Возвращаемое значение:
//   Структура - список используемых подсистемой префиксов настроек. Содержит свойства:
//		* НастройкиСервиса - строка - идентификатор хранения настроек в безопасном хранилище
//		* КлючДоступа - строка - идентификатор хранения ключей доступа в безопасном хранилище
//
Функция ПрефиксыСервиса(ВидЭТП) Экспорт

	ПредставлениеВидаЭТП = XMLСтрока(ВидЭТП);

	Префиксы = Новый Структура;
	Префиксы.Вставить("НастройкиСервиса", ПредставлениеВидаЭТП + "Setup_");
	Префиксы.Вставить("КлючДоступа", ПредставлениеВидаЭТП + "AccessKey_");

	Возврат Префиксы;

КонецФункции

// Проверяет возможность установки соединения с электронной торговой площадкой.
//
// Параметры:
//   ДанныеДляПодключения - структура - данные для подключения. Содержит свойства: 
//   	* УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - учетная запись, для которой проверяется подключение.
//   	* ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - необязателен при заполненном свойстве УчетнаяЗапись.
//   	* ИзмененныеПоля - Строка - Список имен полей авторизации содержащих данные в открытом виде.
//   	* KeyAPI - Строка - ключ, используемый для авторизации для поставщиков(необязателен при заполненном свойстве УчетнаяЗапись).
//   АдресРезультата - Строка - Адрес результата, обязательный при выполнение через длительную операцию
// 
// Возвращаемое значение:
//   Структура - содержит свойства:
//     * КодСостояния - Число - код состояния (ответа) выполнения запроса HTTP-сервера, 
//                        см. http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html .
//     * ТекстОшибки  - Строка - описание ошибки при выполнении HTTP-запроса.
//
Функция ПроверитьСвязьСЭТПБидзаарДляПоставщиков(ДанныеДляПодключения, АдресРезультата = "") Экспорт

	Результат = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();

	УчетнаяЗапись = ДанныеДляПодключения.УчетнаяЗапись;
	ДанныеДляПодключения.Свойство("УчетнаяЗапись", УчетнаяЗапись);
	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики;
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ДанныеАвторизаци = ДанныеАвторизации(ВидЭТП, УчетнаяЗапись); // См. НовыйДанныеАвторизации
		ИзмененныеПоля = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДляПодключения, "ИзмененныеПоля", "");	// Строка
		ЗаполнитьЗначенияСвойств(ДанныеАвторизаци, ДанныеДляПодключения, ИзмененныеПоля);
	Иначе
		// Используется для проверки подключения новой учетной записи
		ДанныеАвторизаци = НовыйДанныеАвторизации(ВидЭТП);
		ЗаполнитьЗначенияСвойств(ДанныеАвторизаци, ДанныеДляПодключения);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеАвторизаци.KeyAPI) Тогда
		Результат.КодСостояния = 401;
		Результат.ТекстОшибки = НСтр(
			"ru = 'Не удалось авторизоваться, проверьте корректность настроек подключения'");
		
		Если Не ПустаяСтрока(АдресРезультата) Тогда
			ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		КонецЕсли;
		
		Возврат Результат;
	КонецЕсли;

	//Параметры, необходимые для генерации http-запроса
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Сервер", ДанныеАвторизаци.Сервер);
	ПараметрыЗапроса.Вставить("KeyAPI", ДанныеАвторизаци.KeyAPI);
	ПараметрыЗапроса.Вставить("ВариантВыгрузки", -1);
	
	//Параметры, необходимые для генерации и выполнения http-запроса
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПоставщики());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	ЗапросСервиса = ЗапросСервисаПубликацияТоваровИУслугБидзаар(ПараметрыЗапроса, Истина);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
	
	ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса);

	Если РезультатЗапроса.КодСостояния <> 0 Тогда
		Результат.ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса);
	КонецЕсли;

	Если Не ПустаяСтрока(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Проверяет возможность установки соединения с электронной торговой площадкой
// 
// Параметры:
//  ДанныеДляПодключения - структура - Данные для подключения. Содержит свойства:
//  * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - учетная запись, под которой происходит подключение к ЭТП
//  * Источник - Произвольный - Объект, который должен получить оповещение с результатом выполнения, обязательный при выполнение через длительную операцию
//  * ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - Вид ЭТП, который должен получить оповещение с
//  * ИзмененныеПоля - Строка - Список имен полей авторизации содержащих данные в открытом виде.
//  АдресРезультата - Строка - Адрес результата, обязательный при выполнение через длительную операцию
//
// Возвращаемое значение:
//  Структура - результат проверки связи с ЭТП. Содержит свойства:
// * КодСостояния - число - код состояния http
// * ТекстОшибки - строка - описание возникшей ошибки
Функция ПроверитьСвязьСЭТПБидзаарДляПокупателей(ДанныеДляПодключения, АдресРезультата = "") Экспорт
	
	Результат = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	
	УчетнаяЗапись = ДанныеДляПодключения.УчетнаяЗапись;
	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		// Используется для проверки подключения существующей учетной записи
		ДанныеАвторизаци = ДанныеАвторизации(ВидЭТП, УчетнаяЗапись); // См. НовыйДанныеАвторизации
		ИзмененныеПоля = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДляПодключения, "ИзмененныеПоля", "");	// Строка
		Если Не ПустаяСтрока(ИзмененныеПоля) Тогда
			ЗаполнитьЗначенияСвойств(ДанныеАвторизаци, ДанныеДляПодключения, ИзмененныеПоля);
		КонецЕсли;
	Иначе
		// Используется для проверки подключения новой учетной записи
		ДанныеАвторизаци = НовыйДанныеАвторизации(ВидЭТП);
		ЗаполнитьЗначенияСвойств(ДанныеАвторизаци, ДанныеДляПодключения);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДанныеАвторизаци.Client_id) Или Не ЗначениеЗаполнено(ДанныеАвторизаци.Client_secret) Тогда
		Результат.КодСостояния = 401;
		Результат.ТекстОшибки = НСтр(
			"ru = 'Не удалось авторизоваться, проверьте корректность настроек подключения'");
		
		Если Не ПустаяСтрока(АдресРезультата) Тогда
			ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		КонецЕсли;
		
		Возврат Результат;
	КонецЕсли;

	//Параметры, необходимые для генерации http-запроса
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Сервер", ДанныеАвторизаци.Сервер);
	ПараметрыЗапроса.Вставить("Client_id", ДанныеАвторизаци.Client_id);
	ПараметрыЗапроса.Вставить("Client_secret", ДанныеАвторизаци.Client_secret);
	
	//Параметры, необходимые для генерации и выполнения http-запроса 
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	ЗапросСервиса = ЗапросСервисаПолучитьТокенДоступаБидзаар(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
	
	ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса);
	
	Если РезультатЗапроса.КодСостояния <> 0 Тогда
		Результат.ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса);
	КонецЕсли;
	
	Если Не ПустаяСтрока(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Отправляет товары и услуги на электронную торговую площадку
//
// Параметры:
// 	ПараметрыЗапроса - Структура - данные для формирования запроса. Содержит свойства:
//  * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - учетная запись подключения к сервису.
//  * ЛимитПозицийНаИтерацию - Число - ограничения выгрузки публикуемых данных на одну итерацию.
//  * Список - ТаблицаЗначений - данные ключевых реквизитов номенклатурных позиций, выгружаемых на этп.
//	* ВариантВыгрузки - число - управляет способом получения данных для выгрузки. Возможные значения:
//		-1 - выгрузить пустой список данных
//		 1 - выгрузить данные, находящиеся в статусе "К публикации" 
//		 2 - выгрузить данные указанным в "Список"
//		 любое другое чило - выгрузить все имеющиеся данные, не смотря на их статус.
//	АдресРезультата - Строка - Адрес временного хранилища, в которм будет размещен результат выполнения
//
Процедура ПубликацияТоваровИУслугБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт

	РезультатПубликации = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	РезультатПубликации.Вставить("КоличествоОпубликованныхПозиций", 0);

	ПараметрыЗапроса.Свойство("УчетнаяЗапись", ПараметрыЗапроса.УчетнаяЗапись);
	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики;

	ДанныеАвторизаци = ДанныеАвторизации(ВидЭТП, ПараметрыЗапроса.УчетнаяЗапись);
	Если ПустаяСтрока(ДанныеАвторизаци.KeyAPI) Тогда
		РезультатПубликации.ТекстОшибки = НСтр(
			"ru = 'Не удалось выгрузить данные, введите уникальный ключ API в настройках подключения организации к Бидзаар'");
		ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
		Возврат;
	КонецЕсли;

	ДанныеДляПодключения = Новый Структура("УчетнаяЗапись, ВидЭТП", ПараметрыЗапроса.УчетнаяЗапись, ВидЭТП);
	РезультатПроверкиСвязи = ПроверитьСвязьСЭТПБидзаарДляПоставщиков(ДанныеДляПодключения);

	Если РезультатПроверкиСвязи.КодСостояния <> 200 Тогда
		РезультатПроверкиСвязи.Свойство("ТекстОшибки", РезультатПроверкиСвязи.ТекстОшибки);
		ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
		Возврат;
	КонецЕсли;

	ПараметрыЗапроса.Вставить("Сервер", ДанныеАвторизаци.Сервер);
	ПараметрыЗапроса.Вставить("KeyAPI", ДанныеАвторизаци.KeyAPI);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета",
		ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПоставщики());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

	ЕстьДанныеДляОбработки = Истина;
	ПараметрыЗапроса.Вставить("НачалоВыгрузки", ТекущаяДатаСеанса());

	Пока ЕстьДанныеДляОбработки Цикл

		ЗапросСервиса = ЗапросСервисаПубликацияТоваровИУслугБидзаар(ПараметрыЗапроса, ЕстьДанныеДляОбработки);

		РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
		ЗаполнитьЗначенияСвойств(РезультатПубликации, РезультатЗапроса);

		РезультатЗапроса.Свойство("ТекстОшибки", РезультатПубликации.ТекстОшибки);
		Если ЗначениеЗаполнено(РезультатПубликации.ТекстОшибки) Тогда
			ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
			Возврат;
		КонецЕсли;

		Если ТипЗнч(РезультатЗапроса) = Тип("Структура") Тогда
			КоличествоОпубликованныхПозиций = ОбработатьРезультатЗапросаПубликацияТоваровИУслугБидзаар(
				ЗапросСервиса.ОбработкаРезультата);
		КонецЕсли;

		РезультатПубликации.КоличествоОпубликованныхПозиций = РезультатПубликации.КоличествоОпубликованныхПозиций
			+ КоличествоОпубликованныхПозиций;

	КонецЦикла;

	ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);

КонецПроцедуры

// Публикация запроса коммерческих предложений в ЭТП Бидзаар.
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//  	* ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - публикуемый документ
//  	* ПубликоватьПрисоединенныеФайлы - булево - указывает необходимость публикации присоединенных к документу файлов
//  	* ПодобратьКлючевыеСлова - булево - указывает необходимость подбора ключевых слов после обновления запроса на площадке Бидзаар
//  АдресРезультата - строка - Адрес временного хранилища в которое помещена структура РезультатПубликации. Содержит свойства:
//		* Идентификатор - строка - идентификатор публикации запроса коммерческих предложений на ЭТП
//		* КодСостояния - Число - код состояния выполнения запроса в сервис этп
//		* ТекстОшибки - строка - текст ошибки
//		* РезультатПодбораКлючевыхСлов - см. ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РезультатПодбораКлючевыхСлов
//
Процедура ПубликацияЗапросаКоммерческихПредложенийБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт

	//Данные для оповещения публикуемого документа о результате публикации
	СостояниеДокумента = Новый Структура;
	СостояниеДокумента.Вставить("СостояниеСинхронизации", Перечисления.СостоянияСинхронизацииЗапросовКоммерческихПредложений.ПустаяСсылка());
	СостояниеДокумента.Вставить("Детализация", Новый Соответствие);

	РезультатПубликации = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	РезультатПубликации.Вставить("Идентификатор", "");
	РезультатПубликации.Вставить("СостояниеДокумента", СостояниеДокумента);
	РезультатПубликации.Вставить("ИдентификаторыФайлов", Новый Массив);
	РезультатПубликации.Вставить("РезультатПодбораКлючевыхСлов", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РезультатПодбораКлючевыхСлов());
	
	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;
	СобытиеЖР = СобытиеЖурналаРегистрации(ВидЭТП);

	РеквизитыЗапросаКП = ДанныеАвторизацииИзЗКП(ПараметрыЗапроса.ЗапросКоммерческихПредложений);
	Если РеквизитыЗапросаКП.УчетнаяЗапись = Неопределено Тогда
		РезультатПубликации.ТекстОшибки = "В документе не вабрана учетная запись";
		СостояниеДокумента.СостояниеСинхронизации = Перечисления.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Ошибка;

		ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	УчетнаяЗапись = РеквизитыЗапросаКП.УчетнаяЗапись;

	ПланПубликации = ПланПубликацииЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапроса.ЗапросКоммерческихПредложений,
		РеквизитыЗапросаКП.Организация,
		Перечисления.ДействияСинхронизацииЗапросовКоммерческихПредложений.Добавить);
	Если ПланПубликации = Неопределено Тогда
		РезультатПубликации.ТекстОшибки = "Не удалось создать служебные объекты публикации";
		СостояниеДокумента.СостояниеСинхронизации = Перечисления.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Ошибка;

		ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	ПараметрыПолученияКлюча = Новый Структура;
	ПараметрыПолученияКлюча.Вставить("ВидЭТП", ВидЭТП);
	ПараметрыПолученияКлюча.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыПолученияКлюча.Вставить("Сервер", РеквизитыЗапросаКП.Сервер);
	
	РезультатПолученияКлючаДоступа = ПолучитьОбновитьКлючДоступа(ПараметрыПолученияКлюча, Ложь);
	Если РезультатПолученияКлючаДоступа.ТекстОшибки <> "" Тогда
		РезультатПубликации.ТекстОшибки = РезультатПолученияКлючаДоступа.ТекстОшибки;
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
			РезультатПолученияКлючаДоступа.ТекстОшибки);
		ИзменитьСостояниеПланаПубликации(ПланПубликации, РезультатПубликации, ПараметрыЗапроса);
		
		ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
		Возврат;
	КонецЕсли;
		
	ПараметрыЗапроса.Вставить("Сервер", РезультатПолученияКлючаДоступа.КлючДоступа.Сервер);
	ПараметрыЗапроса.Вставить("ТокенДоступа", РезультатПолученияКлючаДоступа.КлючДоступа.ТокенДоступа);
	ПараметрыЗапроса.Вставить("UserEmail", РеквизитыЗапросаКП.МенеджерEmail);
	
	ОписанияФайловСервиса = Новый Массив; // Массив из Структура
	ПараметрыЗапроса.Вставить("ОписанияФайловСервиса", ОписанияФайловСервиса); 

	//Параметры, необходимые для генерации и выполнения http-запроса
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

	//Публикация файлов и получение идентификаторов публикаций для их последующей привязке к публикации ЗКП
	ОписанияФайлов = ОписанияФайловДляПубликацииЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапроса.ЗапросКоммерческихПредложений);
	Если ПараметрыЗапроса.ПубликоватьПрисоединенныеФайлы Тогда
		АдресРезультатаПубликацииДокументов = ПоместитьВоВременноеХранилище("");

		ПараметрыЗапросаПубликацииДокументов = Новый Структура;
		
		ПубликуемыеФайлы = Новый Массив; // Массив из Структура
		Для Каждого ОписаниеФайла Из ОписанияФайлов Цикл
			Если ПустаяСтрока(ОписаниеФайла.ИдентификаторВСервисе) И Не ОписаниеФайла.ПометкаУдаления Тогда
				ПубликуемыеФайлы.Добавить(ОписаниеФайла);
			КонецЕсли;
		КонецЦикла;
		ПараметрыЗапросаПубликацииДокументов.Вставить("ОписанияФайлов", ПубликуемыеФайлы);
		
		ПараметрыЗапросаПубликацииДокументов.Вставить("УчетнаяЗапись", УчетнаяЗапись);
		ПараметрыЗапросаПубликацииДокументов.Вставить("Сервер", ПараметрыЗапроса.Сервер);
		ПараметрыЗапросаПубликацииДокументов.Вставить("ТокенДоступа", ПараметрыЗапроса.ТокенДоступа);
		ПараметрыЗапросаПубликацииДокументов.Вставить("МенеджерEmail", РеквизитыЗапросаКП.МенеджерEmail);

		ПубликацияФайловБидзаар(ПараметрыЗапросаПубликацииДокументов, АдресРезультатаПубликацииДокументов);
		РезультатПубликацииФайлов = ПолучитьИзВременногоХранилища(АдресРезультатаПубликацииДокументов); // см. РезультатПубликацииФайловБидзаар
		
		Если ТипЗнч(РезультатПубликацииФайлов) = Тип("Структура") Тогда
			ОпубликованныеВСервисеФайлы = ЗарегистрироватьИдентификаторыФайловВСервисе(ОписанияФайлов, РезультатПубликацииФайлов.ОписанияФайловСервиса);
			Для Каждого ОписаниеФайлаСервиса Из ОпубликованныеВСервисеФайлы Цикл
				ПараметрыЗапроса.ОписанияФайловСервиса.Добавить(ОписаниеФайлаСервиса);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	//Вызов http-сервиса публикации запроса коммерческих предложений
	ЗапросСервиса = ЗапросСервисаПубликацияЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
	
	Если Не ЗначениеЗаполнено(РезультатЗапроса) Тогда
		ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатПубликации, РезультатЗапроса);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		ДанныеОтвета = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ТекстОтвета, , Ложь);

		Если ТипЗнч(ДанныеОтвета) = Тип("Структура") Тогда
			РезультатПубликации.ТекстОшибки = "";
			ДанныеОтвета.Свойство("id", РезультатПубликации.Идентификатор);
		Иначе
			РезультатПубликации.ТекстОшибки = ТекстОшибкиПоКодуОтвета();
		КонецЕсли;
	Иначе
		Если РезультатЗапроса.КодСостояния = 0 Тогда
			ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса, ПараметрыЗапроса);
		КонецЕсли;
		РезультатПубликации.ТекстОшибки = ТекстОшибки;

		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка, , , РезультатЗапроса.ТекстОтвета);
		
		ИзменитьСостояниеПланаПубликации(ПланПубликации, РезультатПубликации, ПараметрыЗапроса);
		
		ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
		Возврат;
	КонецЕсли;

	//Изменение состояния документа
	ИзменитьСостояниеПланаПубликации(ПланПубликации, РезультатПубликации, ПараметрыЗапроса);
	
	//Приглашение участников
	АдресХраненияУчастников = ПоместитьВоВременноеХранилище("");
	
	ПараметрыЗапросаПриглашениеУчастников = Новый Структура;
	ПараметрыЗапросаПриглашениеУчастников.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыЗапросаПриглашениеУчастников.Вставить("МенеджерEmail", РеквизитыЗапросаКП.МенеджерEmail);
	ПараметрыЗапросаПриглашениеУчастников.Вставить("ИдентификаторЗапроса", РезультатПубликации.Идентификатор);
	ПараметрыЗапросаПриглашениеУчастников.Вставить("Сервер", ПараметрыЗапроса.Сервер);
	ПараметрыЗапросаПриглашениеУчастников.Вставить("ТокенДоступа", ПараметрыЗапроса.ТокенДоступа);
	
	ОписанияУчастников = ПолучитьСписокПриглашаемыхУчастников(ПараметрыЗапроса);
	Если ОписанияУчастников.Количество() > 0 Тогда
		ПараметрыЗапросаПриглашениеУчастников.Вставить("ОписанияУчастников", ОписанияУчастников);
		ПриглашениеУчастниковБидзаар(ПараметрыЗапросаПриглашениеУчастников, АдресХраненияУчастников);
	КонецЕсли;

	//Подбор ключевых слов с помощью AI
	Если ПустаяСтрока(РезультатПубликации.ТекстОшибки)
		И ПараметрыЗапроса.ПодобратьКлючевыеСлова Тогда
		
		АдресРезультатаПодбораКлючевыхСлов = ПоместитьВоВременноеХранилище("");

		ПараметрыЗапросаПодбораКлючевыхСлов = Новый Структура;
		ПараметрыЗапросаПодбораКлючевыхСлов.Вставить("ЗапросКоммерческихПредложений",ПараметрыЗапроса.ЗапросКоммерческихПредложений);
		ПараметрыЗапросаПодбораКлючевыхСлов.Вставить("ИдентификаторПроцедуры", РезультатПубликации.Идентификатор);
		ПараметрыЗапросаПодбораКлючевыхСлов.Вставить("Сервер", ПараметрыЗапроса.Сервер);
		ПараметрыЗапросаПодбораКлючевыхСлов.Вставить("ТокенДоступа", ПараметрыЗапроса.ТокенДоступа);
		ПараметрыЗапросаПодбораКлючевыхСлов.Вставить("UserEmail", ПараметрыЗапроса.UserEmail);
		
		ПодборКлючевыхСловДляЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапросаПодбораКлючевыхСлов, АдресРезультатаПодбораКлючевыхСлов);
		РезультатЗапросаПодбораКлючевыхСлов = ПолучитьИзВременногоХранилища(АдресРезультатаПодбораКлючевыхСлов);
		Если ТипЗнч(РезультатЗапросаПодбораКлючевыхСлов) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(РезультатПубликации.РезультатПодбораКлючевыхСлов,РезультатЗапросаПодбораКлючевыхСлов);
		КонецЕсли;
		
		РезультатПубликации.РезультатПодбораКлючевыхСлов.ПодборВыполнялся = Истина;
			
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);

КонецПроцедуры

// Обновление запроса коммерческих предложений
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//  	* ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - публикуемый документ
//  	* ПубликоватьПрисоединенныеФайлы - булево - указывает необходимость публикации присоединенных к документу файлов
//  	* ПодобратьКлючевыеСлова - булево - указывает необходимость подбора ключевых слов после обновления запроса на площадке Бидзаар
//  АдресРезультата - строка - Адрес временного хранилища в которое помещена структура РезультатПубликации. Содержит свойства:
//		* Идентификатор - строка - идентификатор публикации запроса коммерческих предложений на ЭТП
//		* КодСостояния - Число - код состояния выполнения запроса в сервис этп
//		* ТекстОшибки - строка - текст ошибки
//		* РезультатПодбораКлючевыхСлов - см. ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РезультатПодбораКлючевыхСлов
//
Процедура ОбновлениеЗапросаКоммерческихПредложенийБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт
	
	//Данные для оповещения публикуемого документа о результате публикации
	СостояниеДокумента = Новый Структура;
	СостояниеДокумента.Вставить("СостояниеСинхронизации", Перечисления.СостоянияСинхронизацииЗапросовКоммерческихПредложений.ПустаяСсылка());
	СостояниеДокумента.Вставить("Детализация", Новый Соответствие);

	РезультатПубликации = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	РезультатПубликации.Вставить("Идентификатор", "");
	РезультатПубликации.Вставить("СостояниеДокумента", СостояниеДокумента);
	РезультатПубликации.Вставить("ИдентификаторыФайлов", Новый Массив);
	РезультатПубликации.Вставить("РезультатПодбораКлючевыхСлов", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РезультатПодбораКлючевыхСлов());

	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;
	СобытиеЖР = СобытиеЖурналаРегистрации(ВидЭТП);

	РеквизитыЗапросаКП = ДанныеАвторизацииИзЗКП(ПараметрыЗапроса.ЗапросКоммерческихПредложений);
	Если РеквизитыЗапросаКП.УчетнаяЗапись = Неопределено Тогда
		РезультатПубликации.ТекстОшибки = "В документе не вабрана учетная запись";
		СостояниеДокумента.СостояниеСинхронизации = Перечисления.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Ошибка;

		ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	УчетнаяЗапись = РеквизитыЗапросаКП.УчетнаяЗапись;

	ПланПубликации = ПланПубликацииЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапроса.ЗапросКоммерческихПредложений,
		РеквизитыЗапросаКП.Организация,
		Перечисления.ДействияСинхронизацииЗапросовКоммерческихПредложений.Изменить);
	Если ПланПубликации = Неопределено Тогда
		РезультатПубликации.ТекстОшибки = "Не удалось создать служебные объекты публикации";
		СостояниеДокумента.СостояниеСинхронизации = Перечисления.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Ошибка;

		ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	ПараметрыПолученияКлюча = Новый Структура;
	ПараметрыПолученияКлюча.Вставить("ВидЭТП", ВидЭТП);
	ПараметрыПолученияКлюча.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыПолученияКлюча.Вставить("Сервер", РеквизитыЗапросаКП.Сервер);
	
	РезультатПолученияКлючаДоступа = ПолучитьОбновитьКлючДоступа(ПараметрыПолученияКлюча, Ложь);
	Если РезультатПолученияКлючаДоступа.ТекстОшибки <> "" Тогда
		РезультатПубликации.ТекстОшибки = РезультатПолученияКлючаДоступа.ТекстОшибки;
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
			РезультатПолученияКлючаДоступа.ТекстОшибки);
		ИзменитьСостояниеПланаПубликации(ПланПубликации, РезультатПубликации, ПараметрыЗапроса);
		
		ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
		Возврат;
	КонецЕсли;
		
	ПараметрыЗапроса.Вставить("Сервер", РезультатПолученияКлючаДоступа.КлючДоступа.Сервер);
	ПараметрыЗапроса.Вставить("ТокенДоступа", РезультатПолученияКлючаДоступа.КлючДоступа.ТокенДоступа);
	ПараметрыЗапроса.Вставить("UserEmail", РеквизитыЗапросаКП.МенеджерEmail);
	ПараметрыЗапроса.Вставить("ИдентификаторЗапросаКП", РеквизитыЗапросаКП.ИдентификаторВСервисе);
	
	ОписанияФайловСервиса = Новый Массив; // Массив из Структура
	ПараметрыЗапроса.Вставить("ОписанияФайловСервиса", ОписанияФайловСервиса); 

	//Параметры, необходимые для генерации и выполнения http-запроса
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

	//Публикация файлов и получение идентификаторов публикаций для их последующей привязке к публикации ЗКП 
	ОписанияФайлов = ОписанияФайловДляПубликацииЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапроса.ЗапросКоммерческихПредложений);
	
	Если ПараметрыЗапроса.ПубликоватьПрисоединенныеФайлы Тогда
		АдресРезультатаПубликацииДокументов = ПоместитьВоВременноеХранилище("");

		ПараметрыЗапросаПубликацииДокументов = Новый Структура;
		
		ПубликуемыеФайлы = Новый Массив; // Массив из Структура
		Для Каждого ОписаниеФайла Из ОписанияФайлов Цикл
			Если ПустаяСтрока(ОписаниеФайла.ИдентификаторВСервисе) И Не ОписаниеФайла.ПометкаУдаления Тогда
				ПубликуемыеФайлы.Добавить(ОписаниеФайла);
			КонецЕсли;
		КонецЦикла;
		ПараметрыЗапросаПубликацииДокументов.Вставить("ОписанияФайлов", ПубликуемыеФайлы);
		
		ПараметрыЗапросаПубликацииДокументов.Вставить("УчетнаяЗапись", УчетнаяЗапись);
		ПараметрыЗапросаПубликацииДокументов.Вставить("Сервер", ПараметрыЗапроса.Сервер);
		ПараметрыЗапросаПубликацииДокументов.Вставить("ТокенДоступа", ПараметрыЗапроса.ТокенДоступа);
		ПараметрыЗапросаПубликацииДокументов.Вставить("МенеджерEmail", РеквизитыЗапросаКП.МенеджерEmail);
		
		ПубликацияФайловБидзаар(ПараметрыЗапросаПубликацииДокументов, АдресРезультатаПубликацииДокументов);
		РезультатПубликацииФайлов = ПолучитьИзВременногоХранилища(АдресРезультатаПубликацииДокументов); // см. РезультатПубликацииФайловБидзаар
		Если ТипЗнч(РезультатПубликацииФайлов) = Тип("Структура") Тогда
			ОпубликованныеВСервисеФайлы = ЗарегистрироватьИдентификаторыФайловВСервисе(ОписанияФайлов, РезультатПубликацииФайлов.ОписанияФайловСервиса);
			Для Каждого ОписаниеФайлаСервиса Из ОпубликованныеВСервисеФайлы Цикл
				ПараметрыЗапроса.ОписанияФайловСервиса.Добавить(ОписаниеФайлаСервиса);
			КонецЦикла;
		КонецЕсли;
	Иначе
		Для Каждого ОписаниеФайла Из ОписанияФайлов Цикл
			Если Не ПустаяСтрока(ОписаниеФайла.ИдентификаторВСервисе) Тогда
				ОписаниеФайлаСервиса = НовыйОписаниеОпубликованногоФайлаБидзаар();
				ОписаниеФайлаСервиса.id = ОписаниеФайла.ИдентификаторВСервисе;
				ОписаниеФайлаСервиса.name = ОписаниеФайла.Имя;
				ОписаниеФайлаСервиса.extension = ОписаниеФайла.Расширение;
				ОписаниеФайлаСервиса.length = ОписаниеФайла.Размер;
				Если ОписаниеФайла.ПометкаУдаления Тогда
					ОписаниеФайлаСервиса.deletedDate = ТекущаяДатаСеанса();
				КонецЕсли;
				ПараметрыЗапроса.ОписанияФайловСервиса.Добавить(ОписаниеФайлаСервиса);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Вызов http-сервиса публикации запроса коммерческих предложений
	ЗапросСервиса = ЗапросСервисаОбновленияЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
	
	Если Не ЗначениеЗаполнено(РезультатЗапроса) Тогда
		ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатПубликации, РезультатЗапроса);

	Если РезультатЗапроса.КодСостояния = 200 Тогда

		ДанныеОтвета = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ТекстОтвета, , Ложь);

		Если ТипЗнч(ДанныеОтвета) = Тип("Структура") Тогда
			РезультатПубликации.ТекстОшибки = "";
			ДанныеОтвета.Свойство("id", РезультатПубликации.Идентификатор);
		Иначе
			РезультатПубликации.ТекстОшибки = ТекстОшибкиПоКодуОтвета();
		КонецЕсли;

	Иначе

		Если РезультатЗапроса.КодСостояния = 0 Тогда
			ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса, ПараметрыЗапроса);
		КонецЕсли;

		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка, , , РезультатЗапроса.ТекстОтвета);

		РезультатПубликации.ТекстОшибки = ТекстОшибки;

		ИзменитьСостояниеПланаПубликации(ПланПубликации, РезультатПубликации, ПараметрыЗапроса);
		
		ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
		Возврат;
	КонецЕсли;

	//Изменение состояния документа
	ИзменитьСостояниеПланаПубликации(ПланПубликации, РезультатПубликации, ПараметрыЗапроса);
	
	//Приглашение участников
	АдресХраненияУчастников = ПоместитьВоВременноеХранилище("");
	
	ПараметрыЗапросаПриглашениеУчастников = Новый Структура;
	ПараметрыЗапросаПриглашениеУчастников.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыЗапросаПриглашениеУчастников.Вставить("МенеджерEmail", РеквизитыЗапросаКП.МенеджерEmail);
	ПараметрыЗапросаПриглашениеУчастников.Вставить("ИдентификаторЗапроса", РезультатПубликации.Идентификатор);
	ПараметрыЗапросаПриглашениеУчастников.Вставить("Сервер", ПараметрыЗапроса.Сервер);
	ПараметрыЗапросаПриглашениеУчастников.Вставить("ТокенДоступа", ПараметрыЗапроса.ТокенДоступа);
	
	ОписанияУчастников = ПолучитьСписокПриглашаемыхУчастников(ПараметрыЗапроса);
	Если ОписанияУчастников.Количество() > 0 Тогда
		ПараметрыЗапросаПриглашениеУчастников.Вставить("ОписанияУчастников", ОписанияУчастников);
		ПриглашениеУчастниковБидзаар(ПараметрыЗапросаПриглашениеУчастников, АдресХраненияУчастников);
	КонецЕсли;
	
	//Подбор ключевых слов с помощью AI
	Если ПустаяСтрока(РезультатПубликации.ТекстОшибки)
		И ПараметрыЗапроса.ПодобратьКлючевыеСлова Тогда
		
		АдресРезультатаПодбораКлючевыхСлов = ПоместитьВоВременноеХранилище("");

		ПараметрыЗапросаПодбораКлючевыхСлов = Новый Структура;
		ПараметрыЗапросаПодбораКлючевыхСлов.Вставить("ЗапросКоммерческихПредложений",ПараметрыЗапроса.ЗапросКоммерческихПредложений);
		ПараметрыЗапросаПодбораКлючевыхСлов.Вставить("ИдентификаторПроцедуры", РезультатПубликации.Идентификатор);
		ПараметрыЗапросаПодбораКлючевыхСлов.Вставить("Сервер", ПараметрыЗапроса.Сервер);
		ПараметрыЗапросаПодбораКлючевыхСлов.Вставить("ТокенДоступа", ПараметрыЗапроса.ТокенДоступа);
		ПараметрыЗапросаПодбораКлючевыхСлов.Вставить("UserEmail", ПараметрыЗапроса.UserEmail);
		
		ПодборКлючевыхСловДляЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапросаПодбораКлючевыхСлов, АдресРезультатаПодбораКлючевыхСлов);
		РезультатЗапросаПодбораКлючевыхСлов = ПолучитьИзВременногоХранилища(АдресРезультатаПодбораКлючевыхСлов);
		Если ТипЗнч(РезультатЗапросаПодбораКлючевыхСлов) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(РезультатПубликации.РезультатПодбораКлючевыхСлов,РезультатЗапросаПодбораКлючевыхСлов);
		КонецЕсли;
		
		РезультатПубликации.РезультатПодбораКлючевыхСлов.ПодборВыполнялся = Истина;
			
	КонецЕсли;

	ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
КонецПроцедуры

// Публикация файлов на ЭТП Бидзаар.
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса.Содержит свойства:
//   * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - учетная запись ЭТП
//   * ОписанияФайлов - массив из структура - данные публикуемых файлов
//   * МенеджерEmail - строка - email пользователя площадки Бидзаар
//   * Сервер - строка - Имя сервера сервиса Бидзаар. Необязательный, если не заполнен токен
//   * ТокенДоступа - строка - токен доступа к сервису Бидзаар. Необязательный, если не заполнен Сервер
//  АдресРезультата - строка - Адрес временного хранилища в которое помещена структура РезультатПубликации (см. РезультатПубликацииФайловБидзаар)
//
Процедура ПубликацияФайловБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт
	
	РезультатПубликации = РезультатПубликацииФайловБидзаар();
	
	//Описание возвращаемого значения
	ОписанияОпубликованныхФайлов = РезультатПубликации.ОписанияФайловСервиса;
	
	//Получение входящих параметров
	УчетнаяЗапись = ПараметрыЗапроса.УчетнаяЗапись;
	МенеджерEmail = ПараметрыЗапроса.МенеджерEmail;

	//Проверка наличия токена доступа и сервера, на который предоставлен доступ по токену
	Сервер = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "Сервер", "");
	ТокенДоступа = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "ТокенДоступа", "");

	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;

	Если ТокенДоступа = "" Или Сервер = "" Тогда
		ДанныеАвторизации = ПолучитьОбновитьДанныеАвторизацииИДоступаБидзаар(УчетнаяЗапись, МенеджерEmail);
	
		Если ДанныеАвторизации.ТекстОшибки <> "" Тогда
			РезультатПубликации.ТекстОшибки = ДанныеАвторизации.ТекстОшибки;
			ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
			Возврат;
		КонецЕсли;
		
		Сервер = ДанныеАвторизации.Сервер;
		ТокенДоступа = ДанныеАвторизации.ТокенДоступа;
		
		ПараметрыЗапроса.Сервер = Сервер;
		ПараметрыЗапроса.ТокенДоступа = ТокенДоступа;
	КонецЕсли;
	
	//Параметры, необходимые для генерации http-запроса
	ПараметрыЗапроса.Вставить("UserEmail", МенеджерEmail);

	//Параметры, необходимые для генерации и выполнения http-запроса
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	//Форомирование текста и вызов http-запроса
	ЗапросСервиса = ЗапросСервисаПубликацияФайловБидзаар(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
	
	ЗаполнитьЗначенияСвойств(РезультатПубликации, РезультатЗапроса);

	Если РезультатЗапроса.КодСостояния = 200 Тогда

		ДанныеОтвета = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ТекстОтвета, , Ложь);

		Если ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
			РезультатПубликации.ТекстОшибки = "";

			Для Каждого ДанныеФайла Из ДанныеОтвета Цикл
				ОписаниеОпубликованногоФайла = НовыйОписаниеОпубликованногоФайлаБидзаар();
				ЗаполнитьЗначенияСвойств(ОписаниеОпубликованногоФайла, ДанныеФайла);
				ОписанияОпубликованныхФайлов.Добавить(ОписаниеОпубликованногоФайла);
			КонецЦикла;

		Иначе
			РезультатПубликации.ТекстОшибки = ТекстОшибкиПоКодуОтвета();
		КонецЕсли;
	Иначе

		Если РезультатЗапроса.КодСостояния = 0 Тогда
			ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса);
		КонецЕсли;

		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
			РезультатЗапроса.ТекстОтвета);

		РезультатПубликации.ТекстОшибки = ТекстОшибки;

	КонецЕсли;

	ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);

КонецПроцедуры

// Получение файлов коммерческих предложений из ЭТП Бидзаар
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//  * ОписанияФайлов - соответствие из КлючИЗначение - информация о загружаемых файлах. Содержит КлючИЗначение: 
//  ** Ключ - ДокументСсылка.КоммерческоеПредложениеПоставщика - документ в который будут вложены файлы
//  ** Значение - массив из Структура - содержит:
//  	*** ИдентификаторФайла - Строка - идентификатор файла в сервисе Бидзаар
//  	*** Имя - Строка - имя файла
//  	*** Расширение - Строка - расширение файла
//  АдресРезультата - Строка
// 
Процедура ПолучениеФайловКоммерческихПредложенийБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт
	
	ТаблицаДанныхФайлов = Новый ТаблицаЗначений();
	ТаблицаДанныхФайлов.Колонки.Добавить("ВладелецФайла", Новый ОписаниеТипов("ДокументСсылка.КоммерческоеПредложениеПоставщика"));
	ТаблицаДанныхФайлов.Колонки.Добавить("ИдентификаторВСервисе", Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(36)));
	ТаблицаДанныхФайлов.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	ТаблицаДанныхФайлов.Колонки.Добавить("Расширение", Новый ОписаниеТипов("Строка"));
	
	Для Каждого ОписанияФайловДокумента Из ПараметрыЗапроса.ОписанияФайлов Цикл
		Для Каждого ОписаниеФайла Из ОписанияФайловДокумента.Значение Цикл
			НС = ТаблицаДанныхФайлов.Добавить();
			НС.ВладелецФайла = ОписанияФайловДокумента.Ключ;
			НС.ИдентификаторВСервисе = ОписаниеФайла.ИдентификаторФайла;
			НС.Имя = ОписаниеФайла.Имя;
			НС.Расширение = ОписаниеФайла.Расширение;
		КонецЦикла;
	КонецЦикла;
	
	// Проверка необходимости создания файлов
	// Сопоствляем данные с уже созданными присоединенными файлами
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеФайлов.ВладелецФайла КАК ВладелецФайла,
	|	ДанныеФайлов.ИдентификаторВСервисе КАК ИдентификаторВСервисе,
	|	ДанныеФайлов.Имя КАК Имя,
	|	ДанныеФайлов.Расширение КАК Расширение
	|ПОМЕСТИТЬ ВТ_ДанныеФайлов
	|ИЗ
	|	&ДанныеФайлов КАК ДанныеФайлов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеФайлов.ВладелецФайла КАК ВладелецФайла,
	|	ВТ_ДанныеФайлов.ИдентификаторВСервисе КАК ИдентификаторВСервисе,
	|	ВТ_ДанныеФайлов.Имя КАК Имя,
	|	ВТ_ДанныеФайлов.Расширение КАК Расширение
	|ИЗ
	|	ВТ_ДанныеФайлов КАК ВТ_ДанныеФайлов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы КАК КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы
	|		ПО КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.ВладелецФайла = ВТ_ДанныеФайлов.ВладелецФайла
	|		И КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.ИдентификаторВСервисе = ВТ_ДанныеФайлов.ИдентификаторВСервисе
	|		И НЕ КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.ПометкаУдаления
	|ГДЕ
	|	КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДанныеФайлов", ТаблицаДанныхФайлов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСозданияФайлов = РезультатЗапроса.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КоммерческоеПредложениеПоставщика.Ссылка КАК ВладелецФайла,
	|	ЗКП.УчетнаяЗапись КАК УчетнаяЗапись,
	|	КоммерческоеПредложениеПоставщика.ДокументОснование.МенеджерEmail КАК МенеджерEmail
	|ИЗ
	|	Документ.КоммерческоеПредложениеПоставщика КАК КоммерческоеПредложениеПоставщика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросКоммерческихПредложенийПоставщиков КАК ЗКП
	|		ПО КоммерческоеПредложениеПоставщика.ДокументОснование = ЗКП.Ссылка
	|ГДЕ
	|	КоммерческоеПредложениеПоставщика.Ссылка В(&ДокументыВладельцы)
	|	И ЗКП.Ссылка ЕСТЬ НЕ NULL 
	|ИТОГИ ПО
	|	УчетнаяЗапись";

	ДокументыВладельцы = ДанныеСозданияФайлов.ВыгрузитьКолонку("ВладелецФайла");
	ДокументыВладельцы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДокументыВладельцы);
	Запрос.УстановитьПараметр("ДокументыВладельцы", ДокументыВладельцы);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ВыборкаУчетнаяЗапись = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаУчетнаяЗапись.Следующий() Цикл
		УчетнаяЗапись = ВыборкаУчетнаяЗапись.УчетнаяЗапись; // СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок

		Выборка = ВыборкаУчетнаяЗапись.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтруктураПоиска = Новый Структура("ВладелецФайла", Выборка.ВладелецФайла);
			ОписанияФайлов = ДанныеСозданияФайлов.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого ОписаниеФайлаИзПараметраЗапроса Из ОписанияФайлов Цикл
				ПараметрыЗапросаПолученияФайла = Новый Структура;
				ПараметрыЗапросаПолученияФайла.Вставить("УчетнаяЗапись", УчетнаяЗапись);
				ПараметрыЗапросаПолученияФайла.Вставить("МенеджерEmail", Выборка.МенеджерEmail);
				ПараметрыЗапросаПолученияФайла.Вставить("ИдентификаторФайла", ОписаниеФайлаИзПараметраЗапроса.ИдентификаторВСервисе);

				АдресРезультатаПолученияФайла = ПоместитьВоВременноеХранилище("");

				ПолучениеФайлаБидзаар(ПараметрыЗапросаПолученияФайла, АдресРезультатаПолученияФайла);

				РезультатПолученияФайла = ПолучитьИзВременногоХранилища(АдресРезультатаПолученияФайла);

				Если РезультатПолученияФайла.ТекстОшибки = "" Тогда

					ОписаниеФайлаСервиса = РезультатПолученияФайла.ОписаниеФайлаСервиса;
					
					ДополнительныеРеквизитыФайла = Новый Структура;
					ДополнительныеРеквизитыФайла.Вставить("ИдентификаторВСервисе", ОписаниеФайлаИзПараметраЗапроса.ИдентификаторВСервисе);
					
					ПараметрыФайла = РаботаСФайламиСлужебныйКлиентСервер.ПараметрыДобавленияФайла(ДополнительныеРеквизитыФайла);
					ПараметрыФайла.ВладелецФайлов = Выборка.ВладелецФайла;
					ПараметрыФайла.ИмяБезРасширения = ОписаниеФайлаИзПараметраЗапроса.Имя;
					ПараметрыФайла.РасширениеБезТочки = ОписаниеФайлаИзПараметраЗапроса.Расширение;
					Если ТипЗнч(ОписаниеФайлаСервиса.Данные) = Тип("ДвоичныеДанные") Тогда
						АдресВременногоХранилищаФайла = ПоместитьВоВременноеХранилище(ОписаниеФайлаСервиса.Данные);
						РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресВременногоХранилищаФайла);
					КонецЕсли;
				КонецЕсли;

			КонецЦикла;
		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

// Получение файла Бидзаар
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса.Содержит свойства:
//   *УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - учетная запись ЭТП
//   *МенеджерEmail - строка - email пользователя площадки Бидзаар
//   *ИдентифифкаторФайла - строка - идентификатор файла в Бидзаар.
//  АдресРезультата - Строка - Адрес временного хранилища в которое помещена структура РезультатПубликации. Содержит свойства:
//		*ОписаниеФайлаСервиса - см. ОписаниеФайлаСервиса 
//		*ТекстОшибки - строка - текст ошибки
//
Процедура ПолучениеФайлаБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт
	
	ОписаниеФайлаСервиса = ОписаниеФайлаСервиса();
	
	Результат = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	Результат.Вставить("ОписаниеФайлаСервиса", ОписаниеФайлаСервиса);
	
	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;
	СобытиеЖР = СобытиеЖурналаРегистрации(ВидЭТП);
	
	//Получение входящих параметров
	УчетнаяЗапись = ПараметрыЗапроса.УчетнаяЗапись;
	РеквизитыУЗ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыЗапроса.УчетнаяЗапись, "Сервер");
	МенеджерEmail = ПараметрыЗапроса.МенеджерEmail;

	ДанныеАвторизаци = ДанныеАвторизации(ВидЭТП, УчетнаяЗапись);
	Client_id = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАвторизаци, "client_id", "");
	Client_secret = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАвторизаци, "Client_secret", "");

	Если Не ЗначениеЗаполнено(Client_id) Или Не ЗначениеЗаполнено(Client_secret) Тогда
		ТекстОшибки = СтрШаблон(НСтр(
			"ru = 'Не удалось выгрузить данные, введите %1 и %2 в настройках подключения организации к Бидзаар'"),
			"client_id", "client_secret");

		Результат.ТекстОшибки = ТекстОшибки;

		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		Возврат;

	КонецЕсли;

	//Параметры, необходимые для генерации http-запроса
	ПараметрыЗапроса.Вставить("client_id", Client_id);
	ПараметрыЗапроса.Вставить("client_secret", Client_secret);
	ПараметрыЗапроса.Вставить("UserEmail", МенеджерEmail);
	
	ПараметрыПолученияКлюча = Новый Структура;
	ПараметрыПолученияКлюча.Вставить("ВидЭТП", ВидЭТП);
	ПараметрыПолученияКлюча.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыПолученияКлюча.Вставить("Сервер", РеквизитыУЗ.Сервер);
	
	РезультатПолученияКлючаДоступа = ПолучитьОбновитьКлючДоступа(ПараметрыПолученияКлюча, Ложь);
	Если РезультатПолученияКлючаДоступа.ТекстОшибки <> "" Тогда

		Результат.ТекстОшибки = РезультатПолученияКлючаДоступа.ТекстОшибки;

		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка, , , РезультатПолученияКлючаДоступа.ТекстОшибки);

		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		Возврат;

	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("Сервер", РезультатПолученияКлючаДоступа.КлючДоступа.Сервер);
	ПараметрыЗапроса.Вставить("ТокенДоступа", РезультатПолученияКлючаДоступа.КлючДоступа.ТокенДоступа);

	//Параметры, необходимые для генерации и выполнения http-запроса
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	//Форомирование текста и вызов http-запроса
	ЗапросСервиса = ЗапросСервисаПолучениеФайлаБидзаар(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
	ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса);

	Если РезультатЗапроса.КодСостояния = 200 Тогда
		
		Если РезультатЗапроса.ДвоичныеДанныеОтвета = Неопределено Тогда
		
			ДанныеОтвета = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ТекстОтвета, , Ложь);

			Если ТипЗнч(ДанныеОтвета) = Тип("Структура") Тогда
				Результат.ТекстОшибки = "";
				
				ОписаниеФайлаСервиса.Имя = ДанныеОтвета["Name"];
				ОписаниеФайлаСервиса.Расширение = ДанныеОтвета["Extension"];
				ОписаниеФайлаСервиса.Данные = Base64Значение(ДанныеОтвета["base64"]);
				
			Иначе
				Результат.ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса);
			КонецЕсли;
		Иначе
			Результат.ТекстОшибки = "";
			ОписаниеФайлаСервиса.Имя = "";
			ОписаниеФайлаСервиса.Расширение = "";
			ОписаниеФайлаСервиса.Данные = РезультатЗапроса.ДвоичныеДанныеОтвета;
		КонецЕсли;
	Иначе

		Если РезультатЗапроса.КодСостояния = 0 Тогда
			ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса);
		КонецЕсли;

		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка, , , РезультатЗапроса.ТекстОтвета);

		Результат.ТекстОшибки = ТекстОшибки;

	КонецЕсли;

	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

// Приглашение физических и юридических лиц к рассмотрению запроса коммерческих предложений на площадке Бидзаар.
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//   * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - учетная запись
//   * МенеджерEmail - строка - email менеджера
//   * ТокенДоступа - строка - токен доступа к сервису Бидзаар. Необязательный
//   * ОписанияУчастников - массив из структура - см описание ЗаполнитьДанныеДляСервисаПриглашениеУчастниковБидзаар
//  АдресРезультата - строка - Адрес временного хранилища результата вызова сервиса
//
Процедура ПриглашениеУчастниковБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт
	//Описание возвращаемого значения
	ОписанияПриглашенныхУчастников = Новый Массив; // Массив из Структура

	РезультатПубликации = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	РезультатПубликации.Вставить("ОписанияПриглашенныхУчастников", ОписанияПриглашенныхУчастников);
	
	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;
	СобытиеЖР = СобытиеЖурналаРегистрации(ВидЭТП);
	
	//Получение входящих параметров
	УчетнаяЗапись = ПараметрыЗапроса.УчетнаяЗапись;
	МенеджерEmail = ПараметрыЗапроса.МенеджерEmail;

	//Проверка наличия токена доступа
	ТокенДоступа = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "ТокенДоступа", "");
	Сервер = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "Сервер", "");

	Если ТокенДоступа = "" Тогда
		ДанныеАвторизации = ПолучитьОбновитьДанныеАвторизацииИДоступаБидзаар(УчетнаяЗапись, МенеджерEmail);
	
		Если ДанныеАвторизации.ТекстОшибки <> "" Тогда
			РезультатПубликации.ТекстОшибки = ДанныеАвторизации.ТекстОшибки;
			ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);
			Возврат;
		КонецЕсли;
		
		Сервер = ДанныеАвторизации.Сервер;
		ТокенДоступа = ДанныеАвторизации.ТокенДоступа;
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("Сервер", Сервер);
	ПараметрыЗапроса.Вставить("ТокенДоступа", ТокенДоступа);
	ПараметрыЗапроса.Вставить("UserEmail", МенеджерEmail);

	//Параметры, необходимые для генерации и выполнения http-запроса
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	//Форомирование текста и вызов http-запроса
	ЗапросСервиса = ЗапросСервисаПриглашениеУчастниковБидзаар(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
	ЗаполнитьЗначенияСвойств(РезультатПубликации, РезультатЗапроса);

	Если РезультатЗапроса.КодСостояния = 200 Тогда

		ДанныеОтвета = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ТекстОтвета, , Ложь);

		Если ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
			РезультатПубликации.ТекстОшибки = "";
		Иначе
			РезультатПубликации.ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса);
		КонецЕсли;
	Иначе

		Если РезультатЗапроса.КодСостояния = 0 Тогда
			ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса);
		КонецЕсли;

		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка, , , РезультатЗапроса.ТекстОтвета);

		РезультатПубликации.ТекстОшибки = ТекстОшибки;

	КонецЕсли;

	ПоместитьВоВременноеХранилище(РезультатПубликации, АдресРезультата);	
КонецПроцедуры

// Получение событий прошедших на ЭТП Бидзаар
// 
// Параметры:
//  ПараметрыЗапроса - Структура - Данные, необходимые для выполения запроса. Содержит свойства:
// * ОпубликованныеДокументы - Массив из ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - Перечень документов 
// 																	по которым необходимо получить актуальные состояния.
//  АдресРезультата - Строка - Адрес временного хранилища в которое помещена структура РезультатПубликации. Содержит свойства:
// * ТекстОшибки - Строка - Текст ошибки
Процедура ЗапросТекущихСостоянийОпубликованныхДокументовБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт

	РезультатВыполнения = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	РезультатВыполнения.Вставить("СостоянияДокументов", Новый Соответствие);
	РезультатВыполнения.Вставить("КоличестваПобедителей", Новый Соответствие);

	ТаблицаСобытий = НовыйТаблицаСобытийБидзаар();
	СостоянияДокументовБидзаар = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СостоянияЗапросаКоммерческогоПредложенияБидзаар();

	ТаблицаОшибок = Новый ТаблицаЗначений;
	ТаблицаОшибок.Колонки.Добавить("УчетнаяЗапись", Новый ОписаниеТипов("СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок"));
	ТаблицаОшибок.Колонки.Добавить("ТекстОшибки", Новый ОписаниеТипов("Строка"));

	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;
	ВсеДокументы = ПараметрыЗапроса.ОпубликованныеДокументы.Количество() = 0;
	ДокументИдентификаторВСервисе = ?(ВсеДокументы, "", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ПараметрыЗапроса.ОпубликованныеДокументы[0], "ИдентификаторВСервисе"));

	ИмяКлючевойОперации = "ОбщийМодуль.ИнтеграцияСЭлектроннымиТорговымиПлощадками.СостоянияВБидзаар.УчЗаписьЭмейлДата";
	Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(ИмяКлючевойОперации); // Соответсвие

	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ИнтеграцияСЭлектроннымиТорговымиПлощадкамиПереопределяемый.ПодготовитьТаблицуОпубликованныхДокументовБидзаар(МенеджерВТ, ПараметрыЗапроса.ОпубликованныеДокументы);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВТ_СостоянияОпубликованныхДокументов.УчетнаяЗапись) КАК КоличествоЗаписей
	|ПОМЕСТИТЬ ВТ_КоличествоЗаписей
	|ИЗ
	|	ВТ_СостоянияОпубликованныхДокументов КАК ВТ_СостоянияОпубликованныхДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УчетныеЗаписиЭлектронныхТорговыхПлощадок.Ссылка КАК УчетнаяЗапись,
	|	УчетныеЗаписиЭлектронныхТорговыхПлощадок.Организация КАК Организация,
	|	УчетныеЗаписиЭлектронныхТорговыхПлощадок.Сервер КАК Сервер,
	|	ВТ_СостоянияОпубликованныхДокументов.Email КАК Email,
	|	МИНИМУМ(ВТ_СостоянияОпубликованныхДокументов.Дата) КАК ДатаОбновления
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок КАК УчетныеЗаписиЭлектронныхТорговыхПлощадок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СостоянияОпубликованныхДокументов КАК ВТ_СостоянияОпубликованныхДокументов
	|		ПО УчетныеЗаписиЭлектронныхТорговыхПлощадок.Ссылка = ВТ_СостоянияОпубликованныхДокументов.УчетнаяЗапись
	|ГДЕ
	|	НЕ УчетныеЗаписиЭлектронныхТорговыхПлощадок.ПометкаУдаления
	|	И УчетныеЗаписиЭлектронныхТорговыхПлощадок.ВидЭТП = &ВидЭТП
	|	И ВТ_СостоянияОпубликованныхДокументов.Email <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СостоянияОпубликованныхДокументов.Email,
	|	УчетныеЗаписиЭлектронныхТорговыхПлощадок.Ссылка
	|ИТОГИ ПО
	|	УчетнаяЗапись";
	
	Запрос.УстановитьПараметр("ВидЭТП", ВидЭТП);
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатЗапросаКоличествоДанных = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТ_КоличествоЗаписей"].ПолучитьДанные();
	Если РезультатЗапросаКоличествоДанных.Пустой() Тогда
		КоличествоДанных = 0;
	Иначе
		ВыборкаКоличествоДанных = РезультатЗапросаКоличествоДанных.Выбрать();
		ВыборкаКоличествоДанных.Следующий();
		КоличествоДанных = ВыборкаКоличествоДанных.КоличествоЗаписей; // Число
	КонецЕсли;
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, ?(КоличествоДанных = 0, 0.01, КоличествоДанных / 100));
	
	ВыполнялосьПолучениеКоличестваПобедителей = Ложь;
	
	ВыборкаУчетныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаУчетныеЗаписи.Следующий() Цикл

		УчетнаяЗапись = ВыборкаУчетныеЗаписи["УчетнаяЗапись"]; // СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок
		
		ПараметрыПолученияКлюча = Новый Структура;
		ПараметрыПолученияКлюча.Вставить("ВидЭТП", ВидЭТП);
		ПараметрыПолученияКлюча.Вставить("УчетнаяЗапись", УчетнаяЗапись);
		ПараметрыПолученияКлюча.Вставить("Сервер", ВыборкаУчетныеЗаписи.Сервер);

		РезультатПолученияКлючаДоступа = ПолучитьОбновитьКлючДоступа(ПараметрыПолученияКлюча, Ложь);
		Если РезультатПолученияКлючаДоступа.ТекстОшибки <> "" Тогда

			ТекстОшибки = РезультатПолученияКлючаДоступа.ТекстОшибки;

			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);

			СтрокаТаблицыОшибок = ТаблицаОшибок.Добавить();
			СтрокаТаблицыОшибок.УчетнаяЗапись = УчетнаяЗапись;
			СтрокаТаблицыОшибок.ТекстОшибки = ТекстОшибки;

			Продолжить;

		КонецЕсли;
		
		ПараметрыЗапроса.Вставить("Сервер", РезультатПолученияКлючаДоступа.КлючДоступа.Сервер);
		ПараметрыЗапроса.Вставить("ТокенДоступа", РезультатПолученияКлючаДоступа.КлючДоступа.ТокенДоступа);

		//Параметры, необходимые для генерации и выполнения http-запроса
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
		ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
		ПараметрыЗапроса.Вставить("ДатаОбновления", НачалоДня(НачалоДня(ВыборкаУчетныеЗаписи["ДатаОбновления"])-1));
		ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

		ВыборкаEmail = ВыборкаУчетныеЗаписи.Выбрать();
		Пока ВыборкаEmail.Следующий() Цикл

			ПараметрыЗапроса.Вставить("UserEmail", ВыборкаEmail["Email"]);

			ЗапросСервиса = ЗапросСервисаПолучениеСобытийБидзаар(ПараметрыЗапроса);
			РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);

			//Обработка результата запроса
			Если РезультатЗапроса.КодСостояния = 200 Тогда

				ДанныеОтвета = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ТекстОтвета, "date", Истина); // Массив, Неопределено

				Если ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
					Для Каждого СобытиеПоОпубликованномуДокументу Из ДанныеОтвета Цикл
						ИдентификаторВСервисе = СобытиеПоОпубликованномуДокументу["procedureId"]; // Строка
						Если (Не ВсеДокументы И ИдентификаторВСервисе <> ДокументИдентификаторВСервисе)
							Или ТаблицаСобытий.Найти(ИдентификаторВСервисе) <> Неопределено Тогда
							Продолжить;
						КонецЕсли;
						НС = ТаблицаСобытий.Добавить();
						НС.УчетнаяЗапись = УчетнаяЗапись;
						НС.Организация = ВыборкаEmail.Организация;
						НС.ИдентификаторПроцедуры = ИдентификаторВСервисе;
						Событие = СостоянияДокументовБидзаар.Получить(СобытиеПоОпубликованномуДокументу["type"]);
						Если Не ВсеДокументы И Событие
							= ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СостояниеСборПредложенийЗавершен() Тогда
							ПараметрыЗапроса.Вставить("ИдентификаторЗапросаКП", ИдентификаторВСервисе);
							АдресРезультатаЗавершения = ПоместитьВоВременноеХранилище(Неопределено);
							ПолучениеДанныхУчастниковПоЗапросуБидзаар(ПараметрыЗапроса, АдресРезультатаЗавершения);
							Результат = ПолучитьИзВременногоХранилища(АдресРезультатаЗавершения); // Структура
							Если ТипЗнч(Результат) = Тип("Структура") Тогда
								ТекстОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ТекстОшибки",
									СтрШаблон(НСтр("ru = 'Свойство %1 не обнаружено'"), "ТекстОшибки")); // Строка
								Если ПустаяСтрока(ТекстОшибки) Тогда
									ДанныеУчастников = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат,
										"ДанныеУчастников", Новый Массив); // Массив
									НС.КоличествоПобедителей = ДанныеУчастников.Количество();
									ВыполнялосьПолучениеКоличестваПобедителей = Истина;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						НС.Событие = Событие;
						НС.Дата = СобытиеПоОпубликованномуДокументу["date"];
					КонецЦикла;
				Иначе
					ТекстОшибки = ТекстОшибкиПоКодуОтвета();

					ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
						ТекстОшибки);

					СтрокаТаблицыОшибок = ТаблицаОшибок.Добавить();
					СтрокаТаблицыОшибок.УчетнаяЗапись = УчетнаяЗапись;
					СтрокаТаблицыОшибок.ТекстОшибки = ТекстОшибки;
				КонецЕсли;

			Иначе

				Если РезультатЗапроса.КодСостояния = 0 Тогда
					ТекстОшибки = РезультатЗапроса.ТекстОшибки;
				Иначе
					ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса);
				КонецЕсли;

				ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
					РезультатЗапроса.ТекстОтвета);

				СтрокаТаблицыОшибок = ТаблицаОшибок.Добавить();
				СтрокаТаблицыОшибок.УчетнаяЗапись = УчетнаяЗапись;
				СтрокаТаблицыОшибок.ТекстОшибки = ТекстОшибки;

			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ТаблицаСобытий.Количество() = 0 Тогда

		СообщенияОбОшибках = Новый Массив; //массив из строка
		Для Каждого СтрокаТаблицыОшибок Из ТаблицаОшибок Цикл
			СообщенияОбОшибках.Добавить(СтрокаТаблицыОшибок.ТекстОшибки);
		КонецЦикла;

		РезультатВыполнения.ТекстОшибки = СтрСоединить(СообщенияОбОшибках, Символы.ПС);

	Иначе

		РезультатРегистрации = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиПереопределяемый.ЗарегистрироватьСостоянияОпубликованныхДокументовБидзаар(МенеджерВТ, ТаблицаСобытий);
		
		Для Каждого КлючЗначение Из РезультатРегистрации Цикл
			РезультатВыполнения.СостоянияДокументов.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
		
		Если ВыполнялосьПолучениеКоличестваПобедителей Тогда
			РезультатСопоставления = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиПереопределяемый.СопоставитьКоличестваПобедителейСДокументамиБидзаар(МенеджерВТ, ТаблицаСобытий);
			Для Каждого КлючЗначение Из РезультатСопоставления Цикл
				РезультатВыполнения.КоличестваПобедителей.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.ОпубликованныеДокументы.Количество() > 0 Тогда
		СостоянияОпубликованныхДокументов =  ИнтеграцияСЭлектроннымиТорговымиПлощадкамиПереопределяемый.ПолучитьТекущееСостояниеВСервисеБидзаар(ПараметрыЗапроса.ОпубликованныеДокументы);
		Для Каждого КлючЗначение Из СостоянияОпубликованныхДокументов Цикл
			РезультатВыполнения.СостоянияДокументов.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);

КонецПроцедуры

// Получение коммерческих предложений по запросу Бидзаар.
// 
// Параметры:
//  ПараметрыЗапроса - структура - параметры запроса. Содержит свойства:
//   * ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - запрос, по которому нужно получить данные коммерческих предложений
//  АдресРезультата - Строка - Адрес временного хранилища, в которое помещены данные коммерческих предложений. Содержит свойства:
//   * ДанныеКоммерческихПредложений - массив из структура - данные коммерческих предложений
//	 * ТекстОшибки - строка - текст ошибки
//
Процедура ПолучениеДанныхКоммерческихПредложенийПоЗапросуБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт
	
	РезультатВыполнения = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	РезультатВыполнения.Вставить("ДанныеКоммерческихПредложений", Новый Массив);
	
	АдресДляИдентификторов = ПоместитьВоВременноеХранилище("");
	
	ПолучениеИдентификаторовКоммерческихПредложенийБидзаар(ПараметрыЗапроса, АдресДляИдентификторов);
	
	РезультатЗапроса = ПолучитьИзВременногоХранилища(АдресДляИдентификторов);
	
	Если РезультатЗапроса= Неопределено Тогда
		РезультатВыполнения.ТекстОшибки = ТекстОшибкиПоКодуОтвета();
		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
		Возврат;
		
	ИначеЕсли РезультатЗапроса["ТекстОшибки"] <> "" Тогда
		РезультатВыполнения.ТекстОшибки = РезультатЗапроса["ТекстОшибки"];
		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
		Возврат;
	КонецЕсли;

	ПараметрыЗапроса.Вставить("ИдентификаторыКП", РезультатЗапроса.ИдентификаторыКП);
	ПолучениеДанныхКоммерческихПредложенийБидзаар(ПараметрыЗапроса, АдресРезультата);
	
КонецПроцедуры

// Получение идентификаторв коммерческих предложений по запросу
// 
// Параметры:
//  ПараметрыЗапроса - Структура - Параметры запроса. Содержит свойства:
//  	* ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков
//  АдресРезультата - Строка - Адрес временного хранилища в которое помещена структура РезультатВыполения. Содержит свойства:
//  	* ИдентификаторыКП - массив из структура - идентификаторы коммерческих предложений. Содержит свойства:
//		  ** Идентификатор - строка - идентификатор коммерческого предложения
//		  ** Состояние - строка - состояние коммерческого предложения
//		* ТекстОшибки - строка - текст ошибки
//
Процедура ПолучениеИдентификаторовКоммерческихПредложенийБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт
	
	ИдентификаторыКП = Новый Массив();	//Массив из строка
	
	РезультатВыполнения = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	РезультатВыполнения.Вставить("ИдентификаторыКП", ИдентификаторыКП);

	РеквизитыЗапросаКП = ДанныеАвторизацииИзЗКП(ПараметрыЗапроса.ЗапросКоммерческихПредложений);
	Если РеквизитыЗапросаКП.УчетнаяЗапись = Неопределено Тогда
		РезультатВыполнения.ТекстОшибки = "В документе не вабрана учетная запись";

		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	//Получение данных для авторизации
	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;
	УчетнаяЗапись = РеквизитыЗапросаКП.УчетнаяЗапись;
	
	ПараметрыПолученияКлюча = Новый Структура;
	ПараметрыПолученияКлюча.Вставить("ВидЭТП", ВидЭТП);
	ПараметрыПолученияКлюча.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыПолученияКлюча.Вставить("Сервер", РеквизитыЗапросаКП.Сервер);
	
	РезультатПолученияКлючаДоступа = ПолучитьОбновитьКлючДоступа(ПараметрыПолученияКлюча, Ложь);
	Если РезультатПолученияКлючаДоступа.ТекстОшибки <> "" Тогда
		РезультатВыполнения.ТекстОшибки = РезультатПолученияКлючаДоступа.ТекстОшибки;
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
			РезультатПолученияКлючаДоступа.ТекстОшибки);
		
		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
		Возврат;
	КонецЕсли;

	//Параметры, необходимые для генерации http-запроса
	ПараметрыЗапроса.Вставить("ИдентификаторЗапросаКП", РеквизитыЗапросаКП.ИдентификаторВСервисе);
	ПараметрыЗапроса.Вставить("Сервер", РезультатПолученияКлючаДоступа.КлючДоступа.Сервер);
	ПараметрыЗапроса.Вставить("ТокенДоступа", РезультатПолученияКлючаДоступа.КлючДоступа.ТокенДоступа);
	ПараметрыЗапроса.Вставить("UserEmail", РеквизитыЗапросаКП.МенеджерEmail);

	//Параметры, необходимые для генерации и выполнения http-запроса
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

	ЗапросСервиса = ЗапросСервисаПолучениеИдентификаторовКоммерческихПредложенийБидзаар(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
	ЗаполнитьЗначенияСвойств(РезультатВыполнения, РезультатЗапроса);

	Если РезультатЗапроса.КодСостояния = 200 Тогда
		
		ДанныеОтвета = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ТекстОтвета, , Ложь);
		
		Если ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
			РезультатВыполнения.ТекстОшибки = "";
			
			Для Каждого СтрокаДанныеОтвета Из ДанныеОтвета Цикл

				Идентификатор = "";
				Если ТипЗнч(СтрокаДанныеОтвета) = Тип("Структура") Тогда
					СтрокаДанныеОтвета.Свойство("id", Идентификатор);
					
				ИначеЕсли ТипЗнч(СтрокаДанныеОтвета) = Тип("Строка") Тогда
					Идентификатор = СтрокаДанныеОтвета;
					
				КонецЕсли;
				
				ИдентификаторыКП.Добавить(Идентификатор);
			КонецЦикла;
			
		Иначе
			РезультатВыполнения.ТекстОшибки = ТекстОшибкиПоКодуОтвета();
		КонецЕсли;
	Иначе

		Если РезультатЗапроса.КодСостояния = 0 Тогда
			ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса);
		КонецЕсли;

		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
			РезультатЗапроса.ТекстОтвета);

		РезультатВыполнения.ТекстОшибки = ТекстОшибки;

	КонецЕсли;

	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
	
КонецПроцедуры

// Получение данных коммерческих предложений из ЭТП Бидзаар.
// 
// Параметры:
//  ПараметрыЗапроса - Структура - Параметры запроса. Содержит свойства:
//  	* ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - документ, для которого запрашиваются коммерческие предложения
//  	* ИдентификаторыКП - массив из строка - идентификаторы коммерческих предложений. Идентификаторы можно получить в процедуре ПолучениеИдентификаторовКоммерческихПредложенийБидзаар
//  АдресРезультата - Строка - Адрес временного хранилища в которое помещена структура РезультатВыполения. Содержит свойства:
//  	* ДанныеКП - массив из структура - данные коммерческих предложений. Содержит свойства:
//		* ТекстОшибки - строка - текст ошибки
//
Процедура ПолучениеДанныхКоммерческихПредложенийБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт
	
	РезультатВыполнения = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	РезультатВыполнения.Вставить("ДанныеКоммерческихПредложений", Новый Массив);

	РеквизитыЗапросаКП = ДанныеАвторизацииИзЗКП(ПараметрыЗапроса.ЗапросКоммерческихПредложений);
	Если РеквизитыЗапросаКП.УчетнаяЗапись = Неопределено Тогда
		РезультатВыполнения.ТекстОшибки = "В документе не вабрана учетная запись";

		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;
	УчетнаяЗапись = РеквизитыЗапросаКП.УчетнаяЗапись;
	
	ПараметрыПолученияКлюча = Новый Структура;
	ПараметрыПолученияКлюча.Вставить("ВидЭТП", ВидЭТП);
	ПараметрыПолученияКлюча.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыПолученияКлюча.Вставить("Сервер", РеквизитыЗапросаКП.Сервер);
	
	РезультатПолученияКлючаДоступа = ПолучитьОбновитьКлючДоступа(ПараметрыПолученияКлюча, Ложь);
	Если РезультатПолученияКлючаДоступа.ТекстОшибки <> "" Тогда
		РезультатВыполнения.ТекстОшибки = РезультатПолученияКлючаДоступа.ТекстОшибки;
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
			РезультатПолученияКлючаДоступа.ТекстОшибки);
		
		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	//Параметры, необходимые для генерации http-запроса
	ПараметрыЗапроса.Вставить("ИдентификаторЗапросаКП", РеквизитыЗапросаКП.ИдентификаторВСервисе);
	ПараметрыЗапроса.Вставить("Сервер", РезультатПолученияКлючаДоступа.КлючДоступа.Сервер);
	ПараметрыЗапроса.Вставить("ТокенДоступа", РезультатПолученияКлючаДоступа.КлючДоступа.ТокенДоступа);
	ПараметрыЗапроса.Вставить("UserEmail", РеквизитыЗапросаКП.МенеджерEmail);

	//Параметры, необходимые для генерации и выполнения http-запроса
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

	ЗапросСервиса = ЗапросСервисаПолучениеДанныхКоммерческихПредложенийБидзаар(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
	ЗаполнитьЗначенияСвойств(РезультатВыполнения, РезультатЗапроса);

	Если РезультатЗапроса.КодСостояния = 200 Тогда
		
		ДанныеОтвета = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ТекстОтвета, , Ложь);
		
		Если ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
			РезультатВыполнения.ТекстОшибки = "";
			
			Для Каждого СтрокаДанныеОтвета Из ДанныеОтвета Цикл //массив из структура
				ДанныеКП = Новый Структура;
				ДанныеКП.Вставить("ИдентификаторПредложения", СтрокаДанныеОтвета["id"]);
				ДанныеКП.Вставить("ИдентификаторУчастника", СтрокаДанныеОтвета["participantId"]);	//Идентификатор в пределах документа
				ДанныеКП.Вставить("НомерПредложенияУчастника", СтрокаДанныеОтвета["number"]);
				ДанныеКП.Вставить("ЭтоОсновноеПредложение", СтрокаДанныеОтвета["number"] = 1);
				ДанныеКП.Вставить("ИдентификаторКонтрагента", СтрокаДанныеОтвета["companyId"]);
				ДанныеКП.Вставить("СуммаПоДокументу", СтрокаДанныеОтвета["price"]);
				ДанныеКП.Вставить("Валюта", СтрокаДанныеОтвета["currency"]);
				ДанныеКП.Вставить("СуммаПоДокументуВВалюте", СтрокаДанныеОтвета["priceInCurrency"]);
				ДанныеКП.Вставить("ЭтоПобедитель", СтрокаДанныеОтвета["selected"]);
				
				//Файлы поставщиков
				ОписанияФайлов = Новый Массив;	//массив из структура
				ОписанияФайловСервиса = СтрокаДанныеОтвета["files"]; //массив из структура
				
				Для Каждого ОписаниеФайлаСервиса Из ОписанияФайловСервиса Цикл
					ОписаниеФайла = Новый Структура;
					ОписаниеФайла.Вставить("Идентификатор", ОписаниеФайлаСервиса["id"]);
					ОписаниеФайла.Вставить("Имя", ОписаниеФайлаСервиса["name"]);
					ОписаниеФайла.Вставить("Расширение",ОписаниеФайлаСервиса["extension"]);
					ОписаниеФайла.Вставить("Длина", ОписаниеФайлаСервиса["length"]);
					ОписаниеФайла.Вставить("ДатаУдаления", ОписаниеФайлаСервиса["deletedDate"]);
					ОписанияФайлов.Добавить(ОписаниеФайла);
				КонецЦикла;
				ДанныеКП.Вставить("ОписанияФайлов", ОписанияФайлов);
				
				// Товары и услуги
				ТоварыИУслуги = Новый Массив;
				Для Каждого ГруппаПозиций из СтрокаДанныеОтвета["positionGroups"] Цикл //массив из структура
					
					Для Каждого Позиция Из ГруппаПозиций["positions"] Цикл //массив из структура
						ОписаниеПозиции = Новый Структура;
						ОписаниеПозиции.Вставить("ИдентификаторПозиции", Позиция["originId"]);
						ОписаниеПозиции.Вставить("Номенклатура", Позиция["originId"]);
						ОписаниеПозиции.Вставить("Наименование", Позиция["name"]);
						ОписаниеПозиции.Вставить("ЭтоПобедитель", Позиция["selected"]);
						ОписаниеПозиции.Вставить("КоличествоПобедителя", Позиция["selectedCount"]);
						ОписаниеПозиции.Вставить("КоличествоУчастника", Позиция["count"]);
						ОписаниеПозиции.Вставить("ПредставлениеЕдиницыИзмерения", Позиция["unit"]);
						ОписаниеПозиции.Вставить("ЦенаУчастника", Позиция["price"]);
						ОписаниеПозиции.Вставить("СтавкаНДС", Позиция["vat"]);
						ОписаниеПозиции.Вставить("ЕстьПредложение", Не Позиция["dontHaveAny"]);
						ОписаниеПозиции.Вставить("Валюта", Позиция["currency"]);
						ОписаниеПозиции.Вставить("СуммаВВалюте", Позиция["priceInCurrency"]);
						ОписаниеПозиции.Вставить("Комментарий", Позиция["comment"]);
						
						ОписанияДопПолей = Новый Массив();
						Для Каждого ДопПолеПозиции Из Позиция["additionalFieldsValues"] Цикл //Структура
							ОписаниеДопПоля = Новый Структура;
							ОписаниеДопПоля.Вставить("Идентификатор", ДопПолеПозиции["originId"]);
							ОписаниеДопПоля.Вставить("Наименование", ДопПолеПозиции["name"]);
							ОписаниеДопПоля.Вставить("Тип", ДопПолеПозиции["type"]);
							ОписаниеДопПоля.Вставить("Значение", ДопПолеПозиции["value"]);
							
							ОписанияДопПолей.Добавить(ОписаниеДопПоля);
						КонецЦикла;
						ОписаниеПозиции.Вставить("ДополнительныеПоля", ОписанияДопПолей);

						ТоварыИУслуги.Добавить(ОписаниеПозиции);
					КонецЦикла;
				КонецЦикла;
				
				ДанныеКП.Вставить("ТоварыИУслуги", ТоварыИУслуги);
				
				// Ответы на вопросы
				ОтветыНаВопросы = Новый Соответствие;
				Для Каждого Ответ Из СтрокаДанныеОтвета["questionnaire"] Цикл // Структура
					
					ВариантыОтветов = Новый Массив;
					ИдентификаторВопроса = Ответ["originId"]; // Строка
					Если Ответ.type = "multiple" Тогда
						Для Каждого ВариантОтвета Из Ответ["value"] Цикл
							ВариантыОтветов.Добавить(ВариантОтвета);
						КонецЦикла;
					ИначеЕсли Ответ.type = "datetime" Тогда
						ВариантыОтветов.Добавить(
							ПрочитатьДатуJSON(Ответ["value"], ФорматДатыJSON.ISO));
					Иначе
						ВариантыОтветов.Добавить(Ответ["value"]);
					КонецЕсли;
					
					ОтветыНаВопросы.Вставить(ИдентификаторВопроса, ВариантыОтветов);
				КонецЦикла;
				
				ДанныеКП.Вставить("ОтветыНаВопросы", ОтветыНаВопросы);
				
				РезультатВыполнения.ДанныеКоммерческихПредложений.Добавить(ДанныеКП);
			КонецЦикла;
			
		Иначе
			РезультатВыполнения.ТекстОшибки = ТекстОшибкиПоКодуОтвета();
		КонецЕсли;
	Иначе

		Если РезультатЗапроса.КодСостояния = 0 Тогда
			ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса);
		КонецЕсли;

		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
			РезультатЗапроса.ТекстОтвета);

		РезультатВыполнения.ТекстОшибки = ТекстОшибки;

	КонецЕсли;

	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
КонецПроцедуры

// Получение данных коммерческих предложений из ЭТП Бидзаар.
// 
// Параметры:
//  ПараметрыЗапроса - Структура - Параметры запроса. Содержит свойства:
//  	* ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - опубликованный документ.
//  	* ТолькоПобедители - булево - получить только победителей
//  АдресРезультата - Строка - Адрес временного хранилища в которое помещена структура РезультатВыполения. Содержит свойства:
//  	* ДанныеКП - массив из структура - данные коммерческих предложений. Содержит свойства:
//		* ТекстОшибки - строка - текст ошибки
//
Процедура ПолучениеДанныхУчастниковПоЗапросуБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт
	
	РезультатВыполнения = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	РезультатВыполнения.Вставить("ДанныеУчастников", Новый Массив);

	ТолькоПобедители = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "ТолькоПобедители", Ложь);
	
	Если ПараметрыЗапроса.Свойство("ЗапросКоммерческихПредложений") Тогда
		
		РеквизитыЗапросаКП = ДанныеАвторизацииИзЗКП(ПараметрыЗапроса.ЗапросКоммерческихПредложений);
		Если РеквизитыЗапросаКП.УчетнаяЗапись = Неопределено Тогда
			РезультатВыполнения.ТекстОшибки = "В документе не вабрана учетная запись";

			ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
			Возврат;
		КонецЕсли;
		
		//Получение данных для авторизации
		ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;
		УчетнаяЗапись = РеквизитыЗапросаКП.УчетнаяЗапись;
		
		ПараметрыПолученияКлюча = Новый Структура;
		ПараметрыПолученияКлюча.Вставить("ВидЭТП", ВидЭТП);
		ПараметрыПолученияКлюча.Вставить("УчетнаяЗапись", УчетнаяЗапись);
		ПараметрыПолученияКлюча.Вставить("Сервер", РеквизитыЗапросаКП.Сервер);
		
		РезультатПолученияКлючаДоступа = ПолучитьОбновитьКлючДоступа(ПараметрыПолученияКлюча, Ложь);
		Если РезультатПолученияКлючаДоступа.ТекстОшибки <> "" Тогда
			РезультатВыполнения.ТекстОшибки = РезультатПолученияКлючаДоступа.ТекстОшибки;
			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
				РезультатПолученияКлючаДоступа.ТекстОшибки);
			
			ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
			Возврат;
		КонецЕсли;
		
		//Параметры, необходимые для генерации http-запроса
		ПараметрыЗапроса.Вставить("ИдентификаторЗапросаКП", РеквизитыЗапросаКП.ИдентификаторВСервисе);
		ПараметрыЗапроса.Вставить("Сервер", РезультатПолученияКлючаДоступа.КлючДоступа.Сервер);
		ПараметрыЗапроса.Вставить("ТокенДоступа", РезультатПолученияКлючаДоступа.КлючДоступа.ТокенДоступа);
		ПараметрыЗапроса.Вставить("UserEmail", РеквизитыЗапросаКП.МенеджерEmail);

		//Параметры, необходимые для генерации и выполнения http-запроса
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
		ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
		ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	КонецЕсли;
	
	ЗапросСервиса = ЗапросСервисаПолучениеДанныхУчастниковПоЗапросуБидзаар(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);
	ЗаполнитьЗначенияСвойств(РезультатВыполнения, РезультатЗапроса);

	//Обработка результата выполения запроса
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		
		ДанныеОтвета = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ТекстОтвета, , Ложь);
		
		Если ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
			РезультатВыполнения.ТекстОшибки = "";
			
			Для Каждого СтрокаДанныеОтвета Из ДанныеОтвета Цикл
				
				Если ТолькоПобедители = Истина И СтрокаДанныеОтвета["businessStatus"] <> 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ДанныеУчастника = Новый Структура;
				ДанныеУчастника.Вставить("ИдентификаторУчастника", СтрокаДанныеОтвета["id"]);
				ДанныеУчастника.Вставить("ИдентификаторКонтрагента", СтрокаДанныеОтвета["companyId"]);
				ДанныеУчастника.Вставить("ЭтоПобедитель", СтрокаДанныеОтвета["businessStatus"] = 0);
				ДанныеУчастника.Вставить("Заблокирован",  СтрокаДанныеОтвета["isBlocked"]);
				ДанныеУчастника.Вставить("КонтактИмя",  СтрокаДанныеОтвета["contactName"]);
				ДанныеУчастника.Вставить("КонтактТелефон",  СтрокаДанныеОтвета["contactPhone"]);
				ДанныеУчастника.Вставить("КонтактEmail",  СтрокаДанныеОтвета["contactEmail"]);
				
				Если СтрокаДанныеОтвета["companyInfo"] <> Неопределено Тогда
					ДанныеУчастника.Вставить("Наименование",СтрокаДанныеОтвета["companyInfo"]["name"]);
					ДанныеУчастника.Вставить("ПолноеНаименование",  СтрокаДанныеОтвета["companyInfo"]["requisites"]["name"]);
				
					ЧастиИННКПП = СтрРазделить(СтрокаДанныеОтвета["companyInfo"]["requisites"]["tin"], "/");
					Если ЧастиИННКПП.Количество()>0 Тогда
						ДанныеУчастника.Вставить("ИНН", ЧастиИННКПП[0]);
					Иначе
						ДанныеУчастника.Вставить("ИНН", "");
					КонецЕсли;
					Если ЧастиИННКПП.Количество()>1 Тогда
						ДанныеУчастника.Вставить("КПП", ЧастиИННКПП[1]);
					Иначе
						ДанныеУчастника.Вставить("КПП", "");
					КонецЕсли;
				Иначе
					ДанныеУчастника.Вставить("Наименование", "");
					ДанныеУчастника.Вставить("ПолноеНаименование",  "");
					ДанныеУчастника.Вставить("ИНН", "");
					ДанныеУчастника.Вставить("КПП", "");
				КонецЕсли;
					
				РезультатВыполнения.ДанныеУчастников.Добавить(ДанныеУчастника);
			КонецЦикла;
			
		Иначе
			РезультатВыполнения.ТекстОшибки = ТекстОшибкиПоКодуОтвета();
		КонецЕсли;
	Иначе

		Если РезультатЗапроса.КодСостояния = 0 Тогда
			ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса, ПараметрыЗапроса);
		КонецЕсли;

		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
			РезультатЗапроса.ТекстОтвета);

		РезультатВыполнения.ТекстОшибки = ТекстОшибки;

	КонецЕсли;

	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
КонецПроцедуры

// Получить вид ЭТП по разделу учета или раздел учета по виду ЭТП.
// 
// Параметры:
//  Параметр - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок, Строка - Соответствующий возвращаемому значению
//  ПолучитьВидЭТП - Булево - Истина (вид ЭТП), Ложь (раздел учета)
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок, Строка - Вид ЭТП или раздел учета
Функция ПолучитьВидЭТПИлиРазделУчета(Параметр, ПолучитьВидЭТП = Истина) Экспорт

	Контекст = "ИнтеграцияСЭлектроннымиТорговымиПлощадками.ПолучитьВидЭТПИлиРазделУчета";

	Если ПолучитьВидЭТП Тогда
		Если Параметр = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели() Тогда
			Возврат ПредопределенноеЗначение("Перечисление.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели");
		ИначеЕсли Параметр = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПоставщики() Тогда
			Возврат ПредопределенноеЗначение("Перечисление.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики");
		КонецЕсли;
	Иначе
		Если Параметр = ПредопределенноеЗначение("Перечисление.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели") Тогда
			Возврат ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели();
		ИначеЕсли Параметр = ПредопределенноеЗначение("Перечисление.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики") Тогда
			Возврат ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПоставщики();
		КонецЕсли;
	КонецЕсли;

	ВызватьИсключение(Контекст);

КонецФункции

// Подбор ключевых слов для запроса коммерческих предложений.
// 
// Параметры:
//  ПараметрыЗапроса - Структура - Параметры запроса. Содержит свойства:
//  	* ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - документ, для которого подбираются ключевые слова
//		* ИдентификаторПроцедуры - Строка - учетная запись. Необязательный
//   	* UserEmail - строка - email менеджера. Необязательный
//   	* ТокенДоступа - строка - токен доступа к сервису Бидзаар. Необязательный
//   	* Сервер - строка - адрес сервера для запроса к API Бидзаар. Необязательный
//  АдресРезультата - Строка - Адрес временного хранилища в которое помещена структура РезультатВыполения. Содержит свойства:
//  	* КлючевыеСлова - СписокЗначений Из Строка - ключевые слова
//		* ТекстОшибки - Строка - текст ошибки
//
Процедура ПодборКлючевыхСловДляЗапросаКоммерческихПредложенийБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт
	
	РезультатВыполнения = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	РезультатВыполнения.Вставить("КлючевыеСлова",ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СписокКлючевыхСлов());
	
	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;
	
	//Предусмотрен вызов метода с заранее заданными параметрами запроса
	//Если один из параметров не задан, то подбираем их автоматически
	ИдентификаторПроцедуры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса,"ИдентификаторПроцедуры");
	UserEmail = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса,"UserEmail");
	Сервер = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса,"Сервер");
	ТокенДоступа = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса,"ТокенДоступа");
	
	Если Не ЗначениеЗаполнено(ИдентификаторПроцедуры) Или Не ЗначениеЗаполнено(UserEmail)
		Или Не ЗначениеЗаполнено(Сервер) Или Не ЗначениеЗаполнено(ТокенДоступа) Тогда
		
		РеквизитыЗапросаКП = ДанныеАвторизацииИзЗКП(ПараметрыЗапроса.ЗапросКоммерческихПредложений);
		Если РеквизитыЗапросаКП.УчетнаяЗапись = Неопределено Тогда
			РезультатВыполнения.ТекстОшибки = "В документе не вабрана учетная запись";
	
			ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
			Возврат;
		КонецЕсли;
		
		УчетнаяЗапись = РеквизитыЗапросаКП.УчетнаяЗапись;
		
		Если Сервер = Неопределено Или ТокенДоступа = Неопределено Тогда
			ПараметрыПолученияКлюча = Новый Структура;
			ПараметрыПолученияКлюча.Вставить("ВидЭТП", ВидЭТП);
			ПараметрыПолученияКлюча.Вставить("УчетнаяЗапись", УчетнаяЗапись);
			ПараметрыПолученияКлюча.Вставить("Сервер", РеквизитыЗапросаКП.Сервер);
			
			РезультатПолученияКлючаДоступа = ПолучитьОбновитьКлючДоступа(ПараметрыПолученияКлюча, Ложь);
			Если РезультатПолученияКлючаДоступа.ТекстОшибки <> "" Тогда
				РезультатВыполнения.ТекстОшибки = РезультатПолученияКлючаДоступа.ТекстОшибки;
				ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
					РезультатПолученияКлючаДоступа.ТекстОшибки);
				
				ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		//Параметры, необходимые для выполнения http-запроса
		ПараметрыЗапроса.Вставить("ИдентификаторПроцедуры", РеквизитыЗапросаКП.ИдентификаторВСервисе);
		ПараметрыЗапроса.Вставить("UserEmail", РеквизитыЗапросаКП.МенеджерEmail);
		ПараметрыЗапроса.Вставить("Сервер", РезультатПолученияКлючаДоступа.КлючДоступа.Сервер);
		ПараметрыЗапроса.Вставить("ТокенДоступа", РезультатПолученияКлючаДоступа.КлючДоступа.ТокенДоступа);
		
	КонецЕсли;
	
	//Параметры, необходимые для генерации и выполнения http-запроса
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

	ЗапросСервиса = ЗапросСервисаПодбораКлючевыхСловБидзаар(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);

	Если РезультатЗапроса.КодСостояния = 200 Тогда
		
		ДанныеОтвета = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ТекстОтвета, , Ложь);
		
		Если ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
			РезультатВыполнения.ТекстОшибки = "";
			РезультатВыполнения.КлючевыеСлова.ЗагрузитьЗначения(ДанныеОтвета);
		Иначе
			РезультатВыполнения.ТекстОшибки = ТекстОшибкиПоКодуОтвета();
		КонецЕсли;
	Иначе

		Если РезультатЗапроса.КодСостояния = 0 Тогда
			ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса);
		КонецЕсли;

		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
			РезультатЗапроса.ТекстОтвета);

		РезультатВыполнения.ТекстОшибки = ТекстОшибки;

	КонецЕсли;

	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
КонецПроцедуры

// Получает ключевые слова из сервиса Бидзаар.
// 
// Параметры:
//  ПараметрыЗапроса - Структура - Параметры запроса. Содержит свойства:
//  	* УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок
//  	* МенеджерEmail - Строка
//  	* СтрокаПоиска - Строка - строка поиска для отбора ключевых слов по наименованию. Необязательный
//  АдресРезультата - Строка - Адрес временного хранилища в которое помещена структура РезультатВыполения. Содержит свойства:
//  	* КлючевыеСлова - СписокЗначений Из Строка - ключевые слова
//		* ТекстОшибки - Строка - текст ошибки
//
Процедура КлючевыеСловаБидзаар(Знач ПараметрыЗапроса, АдресРезультата) Экспорт
	
	РезультатВыполнения = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	РезультатВыполнения.Вставить("КлючевыеСлова", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СписокКлючевыхСлов());
	
	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;
	
	Если ПараметрыЗапроса.УчетнаяЗапись = Неопределено Тогда
		РезультатВыполнения.ТекстОшибки = "В документе не вабрана учетная запись";

		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	ДанныеУчетнойЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыЗапроса.УчетнаяЗапись, "Сервер");
	
	ПараметрыПолученияКлюча = Новый Структура;
	ПараметрыПолученияКлюча.Вставить("ВидЭТП", ВидЭТП);
	ПараметрыПолученияКлюча.Вставить("УчетнаяЗапись", ПараметрыЗапроса.УчетнаяЗапись);
	ПараметрыПолученияКлюча.Вставить("Сервер", ДанныеУчетнойЗаписи.Сервер);
	
	РезультатПолученияКлючаДоступа = ПолучитьОбновитьКлючДоступа(ПараметрыПолученияКлюча, Ложь);
	Если РезультатПолученияКлючаДоступа.ТекстОшибки <> "" Тогда
		РезультатВыполнения.ТекстОшибки = РезультатПолученияКлючаДоступа.ТекстОшибки;
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
			РезультатПолученияКлючаДоступа.ТекстОшибки);
		
		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	//Параметры, необходимые для выполнения http-запроса
	ПараметрыЗапроса.Вставить("UserEmail", ПараметрыЗапроса.МенеджерEmail);
	ПараметрыЗапроса.Вставить("Сервер", РезультатПолученияКлючаДоступа.КлючДоступа.Сервер);
	ПараметрыЗапроса.Вставить("ТокенДоступа", РезультатПолученияКлючаДоступа.КлючДоступа.ТокенДоступа);
	
	//Параметры, необходимые для генерации и выполнения http-запроса
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

	ЗапросСервиса = ЗапросСервисаКлючевыеСловаБидзаар(ПараметрыЗапроса);
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);

	Если РезультатЗапроса.КодСостояния = 200 Тогда
		
		ДанныеОтвета = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ТекстОтвета, , Ложь);
		
		Если ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
			РезультатВыполнения.ТекстОшибки = "";
			РезультатВыполнения.КлючевыеСлова.ЗагрузитьЗначения(ДанныеОтвета);
		Иначе
			РезультатВыполнения.ТекстОшибки = ТекстОшибкиПоКодуОтвета();
		КонецЕсли;
	Иначе

		Если РезультатЗапроса.КодСостояния = 0 Тогда
			ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ТекстОшибкиПоКодуОтвета(РезультатЗапроса);
		КонецЕсли;

		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(ВидЭТП), УровеньЖурналаРегистрации.Ошибка, , ,
			РезультатЗапроса.ТекстОтвета);

		РезультатВыполнения.ТекстОшибки = ТекстОшибки;

	КонецЕсли;

	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	ИмяПроцедурыПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	ШаблонКомментария = "%1 %2.";
	
	// Установка имени сервера и сброс токенов
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.5.27.21";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4b7d08c3-8c0c-4c46-afb3-eb5591427cce");
	Обработчик.Процедура = 
		"Справочники.УчетныеЗаписиЭлектронныхТорговыхПлощадок.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
	Обработчик.Многопоточный = Истина;
	
	Обработчик.ПроцедураЗаполненияДанныхОбновления = 
		"Справочники.УчетныеЗаписиЭлектронныхТорговыхПлощадок.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = ИмяПроцедурыПроверки;
	Обработчик.Комментарий = СтрШаблон(ШаблонКомментария, НСтр("ru = 'Заполняет справочник'"),
		Метаданные.Справочники.УчетныеЗаписиЭлектронныхТорговыхПлощадок.Синоним);
	Обработчик.ЧитаемыеОбъекты      = "Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок";
	Обработчик.ИзменяемыеОбъекты    = "Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок";
	Обработчик.БлокируемыеОбъекты   = "Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// При создании на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево - Стандартная обработка
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

	Если Форма.ИмяФормы = "Документ.ЗапросКоммерческихПредложенийПоставщиков.Форма.ФормаДокумента" Тогда
		
		ГруппаФормы = Форма.Элементы.Вставить("ГруппаРегистрацииБидзаар", Тип("ГруппаФормы"),
			Форма.Элементы.ГруппаДополнительноВладелец,
			Форма.Элементы.ГруппаРегистрацииБизнесСеть);
		ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормы.ОтображатьЗаголовок = Ложь;
		ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		ДекорацияРегистрацияБидзаарИмя = "ДекорацияРегистрацияБидзаар";
		ЭлементФормы = Форма.Элементы.Добавить(ДекорацияРегистрацияБидзаарИмя, Тип("ДекорацияФормы"), ГруппаФормы);
		ЭлементФормы.Вид = ВидДекорацииФормы.Надпись;
		
		ЧастиЗаголовка = Новый Массив; // Массив из строка
		ЧастиЗаголовка.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Организация не подключена к сервису Бидзаар.'"),
			, WebЦвета.Красный));
		ЧастиЗаголовка.Добавить(" ");
		Если ДоступноПравоНастройкиАвторизацииБидзаар() И (ДоступноПравоАктивацииИнтеграцииДляПокупателейБидзаар()
			Или ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСЭТПБидзаарДляПокупателей")) Тогда
			ЧастиЗаголовка.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Подключить'"), , , , "Открыть"));
		Иначе
			Текст = НСтр("ru = 'Интеграция с ЭТП Бидзаар для покупателей не активирована, обратитесь к администратору.'");
			ИнтеграцияСЭлектроннымиТорговымиПлощадкамиПереопределяемый.СкорректироватьТекст(ДекорацияРегистрацияБидзаарИмя, Текст);
			ЧастиЗаголовка.Добавить(Новый ФорматированнаяСтрока(Текст, , WebЦвета.Красный));
		КонецЕсли;
		
		ЭлементФормы.Заголовок = Новый ФорматированнаяСтрока(ЧастиЗаголовка);
		ЭлементФормы.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_ДекорацияРегистрацияБидзаарОбработкаНавигационнойСсылки");
		
		Форма.СписокКлючевыхСлов.ЗагрузитьЗначения(ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.МассивКлючевыхСлов(Форма.Объект.КлючевыеСлова));
		
	КонецЕсли;

	ИнтеграцияСЭлектроннымиТорговымиПлощадкамиПереопределяемый.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

// Перед записью на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  ТекущийОбъект - ДокументОбъект.ЗапросКоммерческихПредложенийПоставщиков
//  ПараметрыЗаписи - Структура
Процедура ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

	Если Форма.ИмяФормы = "Документ.ЗапросКоммерческихПредложенийПоставщиков.Форма.ФормаДокумента" Тогда
		
		ТекущийОбъект.КлючевыеСлова = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.СтрокаКлючевыхСлов(Форма.СписокКлючевыхСлов);
		
	КонецЕсли;

КонецПроцедуры

// Перед записью на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ТекущийОбъект - ДокументОбъектИмяДокумента
Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт

	Если Форма.ИмяФормы = "Документ.ЗапросКоммерческихПредложенийПоставщиков.Форма.ФормаДокумента" Тогда
		
		Форма.СписокКлючевыхСлов.ЗагрузитьЗначения(ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.МассивКлючевыхСлов(ТекущийОбъект.КлючевыеСлова));
		
	КонецЕсли;

КонецПроцедуры

// Возвращает представление настроек учетной записи, которые будут доступны на клиенте
// 
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок -
// 
// Возвращаемое значение:
//  Структура - см. НовыйДанныеАвторизации
//
Функция ПолучитьПредставлениеНастроекУчетнойЗаписи(УчетнаяЗапись) Экспорт

	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат НовыйДанныеАвторизации(Неопределено);
	КонецЕсли;
	
	ИдентификаторУчетнойЗаписи = XMLСтрока(УчетнаяЗапись);
	ВидЭТП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ВидЭТП");
	
	ДанныеАвторизации = НовыйДанныеАвторизации(ВидЭТП);

	Если ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики
		Или ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели Тогда

		УстановитьПривилегированныйРежим(Истина);
		ВладелецЗаписиХранилища = ПрефиксыСервиса(ВидЭТП).НастройкиСервиса + XMLСтрока(УчетнаяЗапись);
		КлючиДоступа = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВладелецЗаписиХранилища, "КлючиДоступа");
		Если ТипЗнч(КлючиДоступа) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ДанныеАвторизации, КлючиДоступа);
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	// Подмена значения ключа
	ИменаКлючей = СтрРазделить(ДанныеАвторизации.ИменаКлючей, ",", Ложь);
	Для Каждого ИмяКлюча Из ИменаКлючей Цикл
		ИмяКлюча = СокрЛП(ИмяКлюча);
		Если ЗначениеЗаполнено(ДанныеАвторизации[ИмяКлюча]) Тогда
			ДанныеАвторизации[ИмяКлюча] = ИдентификаторУчетнойЗаписи;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеАвторизации;

КонецФункции

// Очищает сохраненные данные авторизации по учетной записи.
//
// Параметры:
//   УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - учетная запись подключения к сервису.
// 
// Возвращаемое значение:
//   Булево - результат выполнения очистки.
//
Функция ОчиститьНастройкиУчетнойЗаписи(УчетнаяЗапись) Экспорт

	ОчисткаУспешна = Истина;

	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);

	Попытка

		ОбъектЭТП = УчетнаяЗапись.ПолучитьОбъект();

		ВладелецЗаписиХранилища = ПрефиксыСервиса(ОбъектЭТП.ВидЭТП).НастройкиСервиса + УчетнаяЗапись.УникальныйИдентификатор();
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(ВладелецЗаписиХранилища, Неопределено);
		УстановитьПривилегированныйРежим(Ложь);

		ОбъектЭТП.УстановитьПометкуУдаления(Истина);

		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();
		ОчисткаУспешна = Ложь;

		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось очистить настройки по причине: %1'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(
			ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

	КонецПопытки;

	Возврат ОчисткаУспешна;

КонецФункции

// Возвращает общие параметры подключения к REST API торговой площадки
//
// Параметры:
//   ПараметрыЗапроса - Структура - содержит свойства:
//   * Сервер - Строка - Имя сервера
//     
// Возвращаемое значение:
//  Структура - содержит свойства:
//  * Сервер - Строка - Имя сервера.
//  * Порт - число - номер порта подключения.
//  * Протокол - строка - протокол передачи данных
//  * Таймаут - число - время ожидания ответа в секундах
//	* ШаблонОшибки - строка
//	* ШаблонОшибкиСКодом - строка
Функция ПараметрыРаботыССервисомАвторизации(ПараметрыЗапроса) Экспорт

	ПараметрыРаботы = Новый Структура;
	ПараметрыРаботы.Вставить("Сервер", ?(ПараметрыЗапроса.Сервер = "", "bidzaar.com", ПараметрыЗапроса.Сервер));
	
	ПараметрыРаботы.Вставить("Порт", 443);
	ПараметрыРаботы.Вставить("Протокол", "https");
	ПараметрыРаботы.Вставить("Таймаут", 20);
	ПараметрыРаботы.Вставить("ШаблонОшибки", НСтр("ru = 'При выполнении метода API %1 возникла ошибка: %2'",
		ОбщегоНазначения.КодОсновногоЯзыка()));
	ПараметрыРаботы.Вставить("ШаблонОшибкиСКодом", НСтр(
		"ru = 'При выполнении метода API %1 возникла ошибка: (%2) %3'", ОбщегоНазначения.КодОсновногоЯзыка()));

	Возврат ПараметрыРаботы;

КонецФункции

Функция ДоступноПравоНастройкиАвторизацииБидзаар() Экспорт
	Возврат ПравоДоступа("Просмотр", Метаданные.Обработки.УправлениеВыгрузкамиВБидзаар);
КонецФункции

Функция ДоступноПравоАктивацииИнтеграцииДляПоставщиковБидзаар() Экспорт
	Возврат ПравоДоступа("Изменение", Метаданные.Константы.ИспользоватьИнтеграциюСЭТПБидзаарДляПоставщиков);
КонецФункции

Функция ДоступноПравоАктивацииИнтеграцииДляПокупателейБидзаар() Экспорт
	Возврат ПравоДоступа("Изменение", Метаданные.Константы.ИспользоватьИнтеграциюСЭТПБидзаарДляПокупателей);
КонецФункции

// Возвращает данные валюты из классификатора ОКВ по цифровому коду.
//
// Параметры:
//  КодВалюты - Строка - Цифровой код валюты.
//
// Возвращаемое значение:
//  Неопределено, Структура - содержит свойства:
//   * КодВалютыЦифровой - Строка - Цифровой код валюты.
//   * КодВалютыБуквенный - Строка - Буквенный код валюты.
//   * Наименование - Строка - Полное наименование валюты.
//  Неопределено - Если валюта не найдена в классификаторе.
//
Функция ДанныеВалютыПоКлассификатору(КодВалюты) Экспорт

	Результат = Неопределено;
	
	ДанныеКлассификатора = ДанныеКлассификатораВалют();
	Если ДанныеКлассификатора <> Неопределено И ДанныеКлассификатора.Количество() Тогда
		СтрокаВалюты = ДанныеКлассификатора.Найти(КодВалюты, "КодВалютыЦифровой");
		
		Если СтрокаВалюты <> Неопределено Тогда
			Результат = Новый Структура("КодВалютыЦифровой, КодВалютыБуквенный, Наименование","","","");
			ЗаполнитьЗначенияСвойств(Результат, СтрокаВалюты);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Проверяет, поддерживается ли указанный буквенный код валюты сервисом "Бидзаар".
//
// Параметры:
//  БуквенныйКодВалюты - Строка - Проверяемый буквенный код валюты (например, "RUB", "USD").
//
// Возвращаемое значение:
//  Булево - Истина, если буквенный код валюты входит в список поддерживаемых сервисом;
//           Ложь в противном случае.
//
Функция ПроверитьБуквенныйКодВалютыБидзаар(БуквенныйКодВалюты) Экспорт
	
	МассивПоддерживаемыхВалют = ПоддерживаемыеВалютыБидзаар();
	
	Возврат МассивПоддерживаемыхВалют.Найти(БуквенныйКодВалюты) <> Неопределено;
				
КонецФункции

#Область СлужебныйПрограммныйИнтерфейсПокупатели

// Описания файлов для публикации запроса коммерческих предложений бидзаар.
// 
// Параметры:
//  ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - документ
// 
// Возвращаемое значение:
// Массив Из Структура - Описания файлов для публикации запроса коммерческих предложений бидзаар:
// * Ссылка - СправочникСсылка.ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы -
// * Имя - Строка - имя файла без расширения
// * Расширение - Строка - расширения файла
// * Размер -Число - Размер файла в байтах
// * ПометкаУдаления - Булево - файл помечен на удаление
// * ИдентификаторВСервисе - Строка - Идентификатор сервиса, назначенный после публикации 
// * Данные - ДвоичныеДанные - данные документа
Функция ОписанияФайловДляПубликацииЗапросаКоммерческихПредложенийБидзаар(ЗапросКоммерческихПредложений) Экспорт
	
	ОписанияФайлов = Новый Массив;	//массив из структура

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Файлы.Ссылка КАК Ссылка,
	|	Файлы.Наименование КАК Имя,
	|	Файлы.Расширение КАК Расширение,
	|	Файлы.ИдентификаторВСервисе КАК ИдентификаторВСервисе,
	|	Файлы.Размер КАК Размер,
	|	Файлы.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ЗапросКоммерческихПредложений
	|	И НЕ Файлы.ПометкаУдаления
	|	И НЕ Файлы.ЭтоИзображениеТоварнойПозиции";
	
	Запрос.УстановитьПараметр("ЗапросКоммерческихПредложений", ЗапросКоммерческихПредложений);
	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		ОписаниеФайла = Новый Структура;
		Для Каждого ПолеЗапроса Из РезультатЗапроса.Колонки Цикл
			ОписаниеФайла.Вставить(ПолеЗапроса.Имя, Выборка[ПолеЗапроса.Имя]);
		КонецЦикла;
		Если ПустаяСтрока(Выборка.ИдентификаторВСервисе) Тогда
			ОписаниеФайла.Вставить("Данные", РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Ссылка));
		Иначе
			ОписаниеФайла.Вставить("Данные", Неопределено);
		КонецЕсли;
		
		ОписанияФайлов.Добавить(ОписаниеФайла);
	КонецЦикла;
	
	Возврат ОписанияФайлов;
	
КонецФункции

// См. КоммерческиеПредложенияДокументыПереопределяемый.ПриОпределенииНастроекУчета.
//
Процедура ПриОпределенииНастроекУчета(Настройки) Экспорт

	Настройки.ИспользоватьИнтеграциюСЭТПБидзаарДляПокупателей =
		ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСЭТПБидзаарДляПокупателей");

	ИнтеграцияСЭлектроннымиТорговымиПлощадкамиПереопределяемый.ПриОпределенииНастроекУчета(Настройки);

КонецПроцедуры

#КонецОбласти

// Очиститка токенов
// 
// Параметры:
//  ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - 
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - 
Процедура ОчиститьТокены(ВидЭТП, УчетнаяЗапись) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ВладелецЗаписиХранилища = СтрШаблон("%1%2", 
		ИнтеграцияСЭлектроннымиТорговымиПлощадками.ПрефиксыСервиса(ВидЭТП).КлючДоступа,
		XMLСтрока(УчетнаяЗапись));
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ВладелецЗаписиХранилища, Неопределено, "КлючДоступа");
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Имена реквизитов ЗКП, данные из которых выгружаются на торговую площадку.
// 
// Возвращаемое значение:
//  СписокЗначений Из Строка - описание публикуемых реквизитов ЗКП:
//   * Значение - Строка -Имя реквизита ЗКП
//   * Представление - Строка - Имя формы реквизита ЗКП
//   * Пометка - Булево - Изменение реквизита и последующая публикация ЗКП приведет к отмене поданых поставщиками предложений
Функция ИменаРеквизитовЗКППубликуемыхВБидзаар() Экспорт
	
	Результат = Новый СписокЗначений;	// СписокЗначений Из Строка
	
	Результат.Добавить("Наименование", "Наименование", Ложь);
	Результат.Добавить("ДатаОкончанияПубликации", "ДатаОкончанияПубликации", Ложь);
	Результат.Добавить("Налогообложение", "Налогообложение", Истина);
	Результат.Добавить("ЦенаВключаетНДС", "ЦенаВключаетНДС", Истина);
	Результат.Добавить("УсловиеПоставкиТекст", "УсловиеПоставкиТекст", Ложь);
	Результат.Добавить("УсловияОплатыТекст", "УсловияОплатыТекст", Ложь);
	Результат.Добавить("ПрочаяДополнительнаяИнформацияТекст", "ПрочаяДополнительнаяИнформацияТекст", Ложь);
	Результат.Добавить("АдресДоставки", "АдресДоставки", Ложь);
	Результат.Добавить("КлючевыеСлова", "СписокКлючевыхСлов", Ложь);
	Результат.Добавить("Валюта", "Валюта", Ложь);
	Результат.Добавить("МожетОбеспечиватьсяЧастично", "МожетОбеспечиватьсяЧастично", Истина);																							
	Результат.Добавить("ДатаНачалаПубликации", "ДатаНачалаПубликации", Ложь);
	Результат.Добавить("ДатаОкончанияРассмотрения", "ДатаОкончанияРассмотрения", Ложь);
	Результат.Добавить("ПроведениеОпроса", "ПроведениеОпроса", Истина);
	Результат.Добавить("ПредставлениеКИ", "МенеджерКонтактныеДанныеПредставление", Ложь);
	
	Результат.Добавить("Товары", "Товары", Истина);
	Результат.Добавить("СписокПолучателейЗапроса", "СписокПолучателейЗапроса", Ложь);
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеПроцедурыИФункцииДляРаботыССервисом

// Данные для прохождения авторизации в сервисе электронной торговой площадки
// 
// Параметры:
//  ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок -
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок -
// 
// Возвращаемое значение:
//  Структура - значения свойств, необходимых для авторизации
//
Функция ДанныеАвторизации(ВидЭТП, УчетнаяЗапись)

	ДанныеАвторизации = НовыйДанныеАвторизации(ВидЭТП);
	
	РеквизитыУЗ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗапись, "Сервер");
	ЗаполнитьЗначенияСвойств(ДанныеАвторизации, РеквизитыУЗ);

	Если ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики
		Или ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели Тогда

		УстановитьПривилегированныйРежим(Истина);
		ВладелецЗаписиХранилища = ПрефиксыСервиса(ВидЭТП).НастройкиСервиса + XMLСтрока(УчетнаяЗапись);
		КлючиДоступа = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВладелецЗаписиХранилища, "КлючиДоступа");
		Если ТипЗнч(КлючиДоступа) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ДанныеАвторизации, КлючиДоступа);
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;

	Возврат ДанныеАвторизации;

КонецФункции

// Данные для прохождения авторизации в сервисе электронной торговой площадки
// 
// Параметры:
//  ПараметрыПолученияКлюча - Структура - параметры подключения:
//   * ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - вид ЭТП
//   * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - учетная запись
//   * Сервер - Строка - имя сервера 
//  ПринудительноОбновлятьКлючДоступа - Булево - указание необходимости принудительного обновления ключа доступа
//  
// Возвращаемое значение:
//  Структура - содержит свойства:
//  * КлючДоступа - Структура - описание свойств ключа доступа:
//   ** Сервер - Строка - Имя сервера, к которому предоставляется доступ
//   ** ТокенДоступа - Строка - токен
//   ** СрокДействияТокенаДоступа - Дата - дата окончания действия токена
//  * ТекстОшибки - Строка - Описание ошибки, возникшей при получении (обновлении) ключа доступа
//
Функция ПолучитьОбновитьКлючДоступа(ПараметрыПолученияКлюча, ПринудительноОбновлятьКлючДоступа)
	
	Результат = Новый Структура;
	Результат.Вставить("КлючДоступа", НовыйКлючДоступа(ПараметрыПолученияКлюча.ВидЭТП));
	Результат.Вставить("ТекстОшибки", "");
	
	ВладелецЗаписиХранилища = ПрефиксыСервиса(ПараметрыПолученияКлюча.ВидЭТП).КлючДоступа + ПараметрыПолученияКлюча.УчетнаяЗапись.УникальныйИдентификатор();
	
	УстановитьПривилегированныйРежим(Истина);
	СохраненныйКлючДоступа = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВладелецЗаписиХранилища, "КлючДоступа");
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТипЗнч(СохраненныйКлючДоступа) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Результат.КлючДоступа, СохраненныйКлючДоступа);
	КонецЕсли;
	
	Если Не СрокТокенаДоступаАктуален(Результат.КлючДоступа) ИЛИ ПринудительноОбновлятьКлючДоступа 
		Или Результат.КлючДоступа.Сервер <> ПараметрыПолученияКлюча.Сервер Тогда
		Если ПараметрыПолученияКлюча.ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики
			Или ПараметрыПолученияКлюча.ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели Тогда
			РезультатОбновления = ОбновитьКлючДоступаБидзаар(ПараметрыПолученияКлюча.ВидЭТП,
				ПараметрыПолученияКлюча.УчетнаяЗапись);
			Результат.КлючДоступа = РезультатОбновления.КлючДоступа;
			Результат.ТекстОшибки = РезультатОбновления.ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обновление ключа доступа для работы с ЭТП Бидзаар
// 
// Параметры:
//  ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок -
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - 
//  
// Возвращаемое значение:
//  Структура - содержит свойства:
//  * КлючДоступа - Структура - см. описание функции НовыйКлючДоступа
//  * ТекстОшибки - строка - описание ошибки, возникшей при получении (обновлении) ключа доступа
//
Функция ОбновитьКлючДоступаБидзаар(ВидЭТП, УчетнаяЗапись)

	Результат = Новый Структура;
	Результат.Вставить("КлючДоступа", НовыйКлючДоступа(ВидЭТП));
	Результат.Вставить("ТекстОшибки", "");
	
	//Получение ключей доступа
	ДанныеАвторизаци = ДанныеАвторизации(ВидЭТП, УчетнаяЗапись);
	
	Сервер = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАвторизаци, "Сервер", "");	// Строка
	Client_id = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАвторизаци, "client_id", "");
	Client_secret = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАвторизаци, "client_secret", "");

	Если Не ЗначениеЗаполнено(Client_id) Или Не ЗначениеЗаполнено(Client_secret) Тогда
		ТекстОшибки = СтрШаблон(НСтр(
			"ru = 'Не удалось выгрузить данные, введите %1 и %2 в настройках подключения организации к Бидзаар'"),
			"client_id", "client_secret");

		Результат.ТекстОшибки = ТекстОшибки;
		
		Возврат Результат;
	КонецЕсли;

	//Подготовка и вызов http-запроса
	ПараметрыЗапроса = Новый Структура;

	//Параметры, необходимые для генерации http-запроса
	ПараметрыЗапроса.Вставить("Сервер", Сервер);
	ПараметрыЗапроса.Вставить("client_id", Client_id);
	ПараметрыЗапроса.Вставить("client_secret", Client_secret);

	//Параметры, необходимые для генерации и выполнения http-запроса
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидЭТП", ВидЭТП);
	ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
	ПараметрыЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

	ЗапросСервиса = ЗапросСервисаПолучитьТокенДоступаБидзаар(ПараметрыЗапроса);

	ДатаПолученияТокена = ТекущаяДатаСеанса();	//Для расчета даты окончания срока действия 
	
	РезультатЗапроса = ВыполнитьЗапрос(ЗапросСервиса);

	Если РезультатЗапроса.КодСостояния = 200 Тогда
		ДанныеТокена = ОбщегоНазначения.JSONВЗначение(РезультатЗапроса.ТекстОтвета, "", Ложь);

		ТокенДоступа = "";
		СрокДействияСекунды = 0;
		
		Если ТипЗнч(ДанныеТокена) = Тип("Структура") Тогда
			ТокенДоступа = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеТокена, "access_token", "");	// Строка
			СрокДействияСекунды = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеТокена, "expires_in", 0);	// Число
		КонецЕсли;

		Если ЗначениеЗаполнено(ТокенДоступа) и ЗначениеЗаполнено(СрокДействияСекунды) Тогда 
			Результат.КлючДоступа.Сервер = Сервер;
			Результат.КлючДоступа.ТокенДоступа = ТокенДоступа;
			Результат.КлючДоступа.СрокДействияТокенаДоступа = ДатаПолученияТокена + СрокДействияСекунды;
			
			ВладелецЗаписиХранилища = ПрефиксыСервиса(ВидЭТП).КлючДоступа + УчетнаяЗапись.УникальныйИдентификатор();
			УстановитьПривилегированныйРежим(Истина);
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ВладелецЗаписиХранилища, Результат.КлючДоступа, "КлючДоступа");
			УстановитьПривилегированныйРежим(Ложь);
			
		Иначе
			Результат.ТекстОшибки = "Неверный формат ответа";
		КонецЕсли;

	Иначе
		Если РезультатЗапроса.КодСостояния = 0 Тогда
			Результат.ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		ИначеЕсли РезультатЗапроса.КодСостояния = 200 Тогда
			Результат.ТекстОшибки = "OK";
		ИначеЕсли РезультатЗапроса.КодСостояния = 301 Тогда
			Результат.ТекстОшибки = "Moved Permanently";
		ИначеЕсли РезультатЗапроса.КодСостояния = 400 Тогда
			Результат.ТекстОшибки = НСтр(
				"ru = 'Не удалось выгрузить данные, проверьте корректность настроек подключения'");
		ИначеЕсли РезультатЗапроса.КодСостояния = 401 Тогда
			Результат.ТекстОшибки = НСтр(
				"ru = 'Не удалось выгрузить данные, проверьте корректность настроек подключения'");
		ИначеЕсли РезультатЗапроса.КодСостояния = 403 Тогда
			Результат.ТекстОшибки = "Forbidden";
		ИначеЕсли РезультатЗапроса.КодСостояния = 404 Тогда
			Результат.ТекстОшибки = "Not Found";
		ИначеЕсли РезультатЗапроса.КодСостояния = 409 Тогда
			Результат.ТекстОшибки = "Conflict";
		ИначеЕсли РезультатЗапроса.КодСостояния = 500 Тогда
			Результат.ТекстОшибки = "Internal Server Error";
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Выполнение команды сервиса.
// Параметры:
//  ЗапросСервиса - Структура - параметры вызова или имя команды.
//
// Возвращаемое значение:
//  Структура - возвращаемые данные сервиса. Содержит свойства:
//     * КодСостояния - Число - код состояния (ответа) выполнения запроса HTTP-сервера, 
//                        см. http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html .
//     * ТекстОтвета - Строка - полученный ответ
//     * ДвоичныеДанныеОтвета - Неопределено, ДвоичныеДанные - полученный ответ
//     * ТекстОшибки  - Строка - описание ошибки при выполнении HTTP-запроса.
//     * Сервер - Строка - имя сервера торговой площадки
//     * ДатаВыполненияЗапроса - Дата - дата выполнения запроса
//
Функция ВыполнитьЗапрос(ЗапросСервиса) Экспорт

	Ответ = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	Ответ.Вставить("ТекстОтвета", ""); 
	Ответ.Вставить("ДвоичныеДанныеОтвета", Неопределено);
	Ответ.Вставить("Сервер", "");
	Ответ.Вставить("ДатаВыполненияЗапроса", ТекущаяДатаСеанса());
	
	Если Не ПравоРаботыССервисомБидзаар(Истина) Тогда
		Ответ.ТекстОшибки = НСтр("ru = 'Нарушение прав доступа.'");
		Возврат Ответ;
	КонецЕсли;
	
	ПараметрыПодключения = ПараметрыРаботыССервисомАвторизации(ЗапросСервиса);

	Если ЗапросСервиса.Свойство("Таймаут") И ЗапросСервиса.Таймаут <> 0 Тогда
		Таймаут = ЗапросСервиса.Таймаут;
	Иначе
		Таймаут = ПараметрыПодключения.Таймаут;
	КонецЕсли;

	Запрос = Новый HTTPЗапрос(ЗапросСервиса.Адрес);

	// Установка заголовков запроса.
	Если ЗапросСервиса.Свойство("Заголовки") Тогда
		Для Каждого ПараметрЗаголовка Из ЗапросСервиса.Заголовки Цикл
			Запрос.Заголовки.Вставить(ПараметрЗаголовка.Ключ, ПараметрЗаголовка.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ДанныеДляЗапроса = Неопределено;
	ЗапросСервиса.Свойство("Данные", ДанныеДляЗапроса);
	
	// Установка тела запроса.
	Если ЗначениеЗаполнено(ДанныеДляЗапроса) Тогда
		Если ТипЗнч(ДанныеДляЗапроса) = Тип("ДвоичныеДанные") Тогда
			Запрос.УстановитьТелоИзДвоичныхДанных(ДанныеДляЗапроса);
		ИначеЕсли ТипЗнч(ДанныеДляЗапроса) = Тип("Строка") Тогда
			Запрос.УстановитьТелоИзСтроки(ДанныеДляЗапроса);
		КонецЕсли;
	КонецЕсли;

	Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси(ПараметрыПодключения.Протокол);
	Если ПараметрыПодключения.Протокол = "https" Тогда
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение( , );
		Соединение = Новый HTTPСоединение(ПараметрыПодключения.Сервер, ПараметрыПодключения.Порт, , , Прокси, Таймаут,
			ЗащищенноеСоединение, Ложь);
	Иначе
		Соединение = Новый HTTPСоединение(ПараметрыПодключения.Сервер, ПараметрыПодключения.Порт);
	КонецЕсли;

	Если Не МетодHTTPДопустим(ЗапросСервиса.Метод) Тогда
		ШаблонОшибки = НСтр("ru = 'Указан недопустимый метод HTTP (%1)'", ОбщегоНазначения.КодОсновногоЯзыка());
		Ответ.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, ЗапросСервиса.Метод);
		Возврат Ответ;
	КонецЕсли;
	
	// Служебные данные для сообщений о возникших ошибках
	Ответ.Сервер = ПараметрыПодключения.Сервер;
	Ответ.ДатаВыполненияЗапроса = ТекущаяДатаСеанса();
	
	Попытка
		РезультатЗапроса = ВызватьHTTPМетод(Соединение, Запрос, ЗапросСервиса);

		Ответ.КодСостояния = РезультатЗапроса.КодСостояния;
		ТипСодержимогоТела = РезультатЗапроса.Заголовки.Получить("Content-Type");	// Строка
		Если НРег(ТипСодержимогоТела) = "application/octet-stream" Тогда
			Ответ.ДвоичныеДанныеОтвета = РезультатЗапроса.ПолучитьТелоКакДвоичныеДанные();
		Иначе
			Ответ.ТекстОтвета = РезультатЗапроса.ПолучитьТелоКакСтроку("UTF8");
		КонецЕсли;
	Исключение
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При отправке запроса на сервер %1 возникла ошибка: %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ПараметрыПодключения.Сервер, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		Ответ.ТекстОшибки = ТекстОшибки;
	КонецПопытки;

	Возврат Ответ;
	
КонецФункции

// Вызывает HTTP метод.
// 
// Параметры:
//  Соединение - HTTPСоединение - Соединение
//  ЗапросКСервису - HTTPЗапрос - Запрос к сервису
//  ПараметрыЗапроса - См. НовыеПараметрыЗапроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Результат вызова HTTP метода
Функция ВызватьHTTPМетод(Соединение, ЗапросКСервису, ПараметрыЗапроса)
	
	РежимОтладки = ОбщегоНазначения.РежимОтладки();
	
	Для ПопыткаПодключения = 1 По 3 Цикл
		
		Если ПопыткаПодключения = 2 Тогда
			Пауза(5, РежимОтладки);
		ИначеЕсли ПопыткаПодключения = 3 Тогда
			Пауза(20, РежимОтладки);
		КонецЕсли;
		
		Попытка
			Возврат Соединение.ВызватьHTTPМетод(ПараметрыЗапроса.Метод, ЗапросКСервису);
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Пауза.
// 
// Параметры:
//  Секунды - Число - Секунды
//  РежимОтладки - Неопределено, Булево - Режим отладки
Процедура Пауза(Знач Секунды = 1, РежимОтладки = Неопределено) Экспорт
	
	Если Секунды < 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимОтладки = Неопределено Тогда
		РежимОтладки = ОбщегоНазначения.РежимОтладки();
	КонецЕсли;
	
	Если РежимОтладки Тогда
		ОбщегоНазначенияБТС.Пауза(Секунды);
	Иначе
		ВызватьПаузу(Секунды * 1000);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеКонструкторы

// Описание запроса сервиса.
// 
// Возвращаемое значение:
//  Структура - данные для запроса. Содержит свойства:
//  * Данные - Строка, ДвоичныеДанные -
//	* ОбработкаРезультата - Строка, ТаблицаЗначений, Массив из Структура, Неопределено - данные обработки результата
Функция НовыйЗапросСервиса()

	ЗапросСервиса = Новый Структура;
	
	ЗапросСервиса.Вставить("Сервис", "");	// Имя сервиса
	ЗапросСервиса.Вставить("Наименование", ""); // Полное наименование метода.
	ЗапросСервиса.Вставить("Сервер", ""); // Сервер 
	ЗапросСервиса.Вставить("Адрес", ""); // Адрес URI метода.
	ЗапросСервиса.Вставить("Метод", ""); // Метод HTTP соединения, например POST. См. МетодыСоединения()
	ЗапросСервиса.Вставить("Права", "");
	ЗапросСервиса.Вставить("Данные", "");             // Двоичные данные или строка.
	ЗапросСервиса.Вставить("РазрешенныеСостояния", Новый Массив);
	ЗапросСервиса.Вставить("Ошибки", Новый Соответствие); // Соответствие ошибок, например: (404, "Не найдено").
	ЗапросСервиса.Вставить("БлокироватьСообщенияОбОшибках", Ложь); // Не выводить сообщения об ошибках.
	ЗапросСервиса.Вставить("ОбработкаРезультата", Неопределено);
	ЗапросСервиса.Вставить("Страница", 0);  // page
	ЗапросСервиса.Вставить("РазмерСтраницы", 0);  // size
	ЗапросСервиса.Вставить("ИдентификаторОрганизации", "");
	ЗапросСервиса.Вставить("ВременныйТокен", ""); // используется для выполнения запросов по токенам, не сохраненных в ИБ
	ЗапросСервиса.Вставить("Аутентификация", Ложь); // для некоторых методов, аутентификация может быть не нужна
	ЗапросСервиса.Вставить("ТипКонтента", "application/json");
	ЗапросСервиса.Вставить("Таймаут", 120);  // Длительность ожидания ответа.
	ЗапросСервиса.Вставить("Результат");        // Свойство возврата результата, например "path[0].cat".
	ЗапросСервиса.Вставить("ДополнительныеПараметры", Новый Структура); // Дополнительные параметры
	ЗапросСервиса.Вставить("Контент", ""); // Описание контента (передается в заголовке).
	ЗапросСервиса.Вставить("Детализация", ""); // Дополнительная информация для описания деталей запроса.
	ЗапросСервиса.Вставить("Заголовки", Новый Соответствие); // Дополнительная информация для описания деталей запроса.

	Возврат ЗапросСервиса;

КонецФункции

// Описание данных для прохождения авторизации
// 
// Параметры:
//  ВидЭТП - ПеречислениеССылка.ВидыЭлектронныхТорговыхПлощадок, Неопределено - Определяет список полей в возвращаемом значении
// 
// Возвращаемое значение:
//  Структура - описание данных. Состав меняется в зависимости от вида электронной площадки:
//	 * Сервер - Строка - Имя сервера. В Бидзаар один и тот же сервер отвечает за авторизацию и получение данных
//	 * ИменаКлючей - Строка - Имена полей, которые содержат инофрмацию для авторизации, получаемую в личном кабинете этп
//	 * KeyAPI - Строка - Ключ доступа к списку опубликованных товаров на торговой площадке
//	 * Client_id - Строка - Идентфикатор личного кабинета на этп
//	 * Client_secret - Строка - Ключ доступа к личному кабинету этп
//
Функция НовыйДанныеАвторизации(ВидЭТП)
	
	ДанныеАвторизации = Новый Структура;
	ДанныеАвторизации.Вставить("Сервер", "");
	ДанныеАвторизации.Вставить("ИменаКлючей", "");
	
	Если ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики Тогда
		ДанныеАвторизации.Вставить("KeyAPI", "");
		ДанныеАвторизации.ИменаКлючей = "KeyAPI";
	ИначеЕсли ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели Тогда
		ДанныеАвторизации.Вставить("Client_id", "");
		ДанныеАвторизации.Вставить("Client_secret", "");
		ДанныеАвторизации.ИменаКлючей = "Client_id, Client_secret";
	КонецЕсли;
	
	Возврат ДанныеАвторизации;
	
КонецФункции

// Описание ключ доступа, позволяющего вызывать функции сервисов ЭТП
// 
// Параметры:
//  ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - Вид ЭТП
// 
// Возвращаемое значение:
//  Структура - описание свойств ключа доступа:
//   * Сервер - Строка - Имя сервера, к которому предоставляется доступ
//   * ТокенДоступа - Строка - токен
//   * СрокДействияТокенаДоступа - Дата - дата окончания действия токена
// 
Функция НовыйКлючДоступа(ВидЭТП)
	
	КлючДоступа = Новый Структура;
	
	Если ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики
		Или ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели Тогда
		КлючДоступа.Вставить("Сервер", "");
		КлючДоступа.Вставить("ТокенДоступа", "");
		КлючДоступа.Вставить("СрокДействияТокенаДоступа", '00010101');
	КонецЕсли;
	
	Возврат КлючДоступа;
	
КонецФункции

// Описание события Бидзаар
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новый таблица событий бидзаар:
// * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок
// * ИдентификаторПроцедуры - Строка - Идентификатор процедуры
// * Событие - Число - описание события
// * Дата - Дата - Дата события
Функция НовыйТаблицаСобытийБидзаар()
	
	ТаблицаСобытий = Новый ТаблицаЗначений();
	ТаблицаСобытий.Колонки.Добавить("УчетнаяЗапись", Новый ОписаниеТипов("СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок"));
	ТаблицаСобытий.Колонки.Добавить("Организация", Метаданные.ОпределяемыеТипы.Организация.Тип);
	ТаблицаСобытий.Колонки.Добавить("ИдентификаторПроцедуры", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТаблицаСобытий.Колонки.Добавить("Событие", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаСобытий.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаСобытий.Колонки.Добавить("КоличествоПобедителей", Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаСобытий;
	
КонецФункции

 // Описание опубликованного файла Бидзаар.
// 
// Возвращаемое значение:
//  Структура - Новый описание опубликованного файла бидзаар:
// * id - Строка - Идентификатор файла на площадке Бидзаар
// * index - Число - номер по порядку
// * name - Строка - имя файла без расширения 
// * extension - Строка - расширение файла
// * length - Число - длина файла
Функция НовыйОписаниеОпубликованногоФайлаБидзаар()
	ОписаниеФайла = Новый Структура;
	
	ОписаниеФайла.Вставить("id","");
	ОписаниеФайла.Вставить("index",0);
	ОписаниеФайла.Вставить("name","");
	ОписаниеФайла.Вставить("extension","");
	ОписаниеФайла.Вставить("length", 0);
	ОписаниеФайла.Вставить("deletedDate", Неопределено);
	
	Возврат ОписаниеФайла;
КонецФункции

// Создает и возвращает пустую структуру описания файла сервиса с установленными значениями по умолчанию.
//
// Возвращаемое значение:
//   Структура:
//	 	* Имя - Строка - Имя файла
//		* Расширение - строка - расширение файла
//		* Данные - Неопределено, ДвоичныеДанные - представление данных файла в формате base64
Функция ОписаниеФайлаСервиса()
	
	ОписаниеФайлаСервиса = Новый Структура;
	
	ОписаниеФайлаСервиса.Вставить("Имя", "");
	ОписаниеФайлаСервиса.Вставить("Расширение", "");
	ОписаниеФайлаСервиса.Вставить("Данные", Неопределено);
	
	Возврат ОписаниеФайлаСервиса;
		
КонецФункции

// Возвращает структуру с результатом публикации файлов для маркетплейса.
//
// Возвращаемое значение:
//   Структура:
//     * ОписанияФайловСервиса - Массив из Структура - описания опубликованных файлов
Функция РезультатПубликацииФайловБидзаар()
	
	РезультатПубликации = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.НовыйРезультатМетода();
	РезультатПубликации.Вставить("ОписанияФайловСервиса", Новый Массив);	
	
	Возврат РезультатПубликации;
	
КонецФункции

// Создает структуру адреса доставки для выгрузки на Бидзаар с пустыми значениями.
//
// Возвращаемое значение:
//   Структура:
//     * country - Строка - страна
//     * region - Строка - регион
//     * area - Строка - район
//     * cityType - Строка - тип населенного пункта
//     * city - Строка - населенный пункт
//     * addressComment - Строка - комментарий к адресу
//     * building - Строка - здание/корпус
Функция ДанныеАдресаДляВыгрузкиБидзаар()

	АдресДоставки = Новый Структура;
	
	АдресДоставки.Вставить("country", "");
	АдресДоставки.Вставить("region", "");
	АдресДоставки.Вставить("area", "");
	АдресДоставки.Вставить("cityType", "");
	АдресДоставки.Вставить("city", "");
	АдресДоставки.Вставить("addressComment", "");
	АдресДоставки.Вставить("building", "");
	
	Возврат АдресДоставки;
	
КонецФункции

#КонецОбласти

#Область ФормированиеЗапросовКСервису

Функция ЗапросСервисаПолучитьТокенДоступаБидзаар(ПараметрыЗапроса)
	ЗапросСервиса = НовыйЗапросСервиса();

	ДополнительныеПараметры = Новый Структура;
	Если ПараметрыЗапроса.Свойство("ДополнительныеПараметры", ДополнительныеПараметры) Тогда
		Для Каждого ДополнительныйПараметр Из ПараметрыЗапроса.ДополнительныеПараметры Цикл
			ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
	КонецЕсли;

	ЗапросСервиса.Наименование = НСтр("ru = 'Получение токена доступа'");
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = "/auth/connect/token";
	ЗапросСервиса.Метод = "POST";
	ЗапросСервиса.Аутентификация = Истина;
	ЗапросСервиса.ОбработкаРезультата = Неопределено;

	ДанныеЗапроса = Новый массив;	//Массив из строка
	ДанныеЗапроса.Добавить("grant_type=client_credentials");
	ДанныеЗапроса.Добавить("client_id=" + ПараметрыЗапроса.Client_id);
	ДанныеЗапроса.Добавить("client_secret=" + ПараметрыЗапроса.Client_secret);

	ЗапросСервиса.Данные = СтрСоединить(ДанныеЗапроса, "&");

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("charset", "UTF-8");
	Заголовки.Вставить("accept", "*/*");
	Заголовки.Вставить("content-Type", "application/x-www-form-urlencoded");
	Заголовки.Вставить("content-Length", СтрДлина(ЗапросСервиса.Данные));

	ЗапросСервиса.Заголовки = Заголовки;

	Возврат ЗапросСервиса;

КонецФункции

// Формирует и возвращает запрос для публикации товаров и услуг на электронной торговой площадке Бидзаар.
//
// Параметры:
//   ПараметрыЗапроса - Структура - параметры запроса, содержащие настройки подключения и данные товаров
//   ЕстьДанныеДляОбработки - Булево - выходной параметр, признак наличия данных для обработки
//
// Возвращаемое значение:
//   Структура - см. НовыйЗапросСервиса
Функция ЗапросСервисаПубликацияТоваровИУслугБидзаар(ПараметрыЗапроса, ЕстьДанныеДляОбработки)

	ЗапросСервиса = НовыйЗапросСервиса();
	
	ДополнительныеПараметрыЗапроса = Новый Структура;
	Если ПараметрыЗапроса.Свойство("ДополнительныеПараметры", ДополнительныеПараметрыЗапроса) Тогда
		Для Каждого ДополнительныйПараметр Из ДополнительныеПараметрыЗапроса Цикл
			ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
	КонецЕсли;

	ЗапросСервиса.Наименование = НСтр("ru = 'Публикация товаров и услуг на ЭТП Бидзаар'");
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = "/api/goods/" + СокрЛП(ПараметрыЗапроса.KeyAPI);
	ЗапросСервиса.Метод = "PUT";
	ЗапросСервиса.Аутентификация = Ложь;
	ЗапросСервиса.ОбработкаРезультата = Неопределено;

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("charset", "UTF-8");
	Заголовки.Вставить("accept", "application/json");
	Заголовки.Вставить("content-type", "application/json");

	Результат = ЗаполнитьДанныеДляСервисаПубликацияТоваровИУслугБидзаар(ПараметрыЗапроса);

	ЗапросСервиса.Заголовки = Заголовки;

	ЗапросСервиса.Данные = ОбщегоНазначения.ЗначениеВJSON(Новый Структура("positions", Результат.ДанныеДляВыгрузки));
	ЗапросСервиса.ОбработкаРезультата = Результат.ОбработкаРезультата;

	Если ТипЗнч(Результат.ОбработкаРезультата) = Тип("Массив") Тогда
		ЕстьДанныеДляОбработки = Результат.ОбработкаРезультата.Количество() > 0;
	Иначе
		ЕстьДанныеДляОбработки = Ложь;
	КонецЕсли;

	Возврат ЗапросСервиса;

КонецФункции

// Подготовка данных для создания и отправки http-запроса относящегося к публикации запроса коммерческих предложений на ЭТП Бидзаар.
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//   * UserEmail - Строка - зарегистрированный в Бидзаар Email пользователя
//   * ТокенДоступа - строка - актуальный токен доступа
//   * Сервер - строка - адрес сервера
//   * ИдентификаторПроцедуры - строка - идентификатор процедуры
//   * ДополнительныеПараметры - структура - значения вспомогательных параметров
//   * ОтклонитьПредложения - булево - признак отклонения предложений
//   * АдресМетода - Строка - адрес метода
// Возвращаемое значение:
//  Структура - Запрос сервиса публикация запроса коммерческих предложений бидзаар:
// 
Функция ЗапросСервисаПубликацияЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапроса)

	ЗапросСервиса = НовыйЗапросСервиса();

	//Трансляция дополнительных параметров запроса в описание запроса
	ДополнительныеПараметрыЗапроса = Новый Структура;
	Если ПараметрыЗапроса.Свойство("ДополнительныеПараметры", ДополнительныеПараметрыЗапроса) Тогда
		Для Каждого ДополнительныйПараметр Из ДополнительныеПараметрыЗапроса Цикл
			ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
	КонецЕсли;

	//Данные для вызова http-запроса
	ЗапросСервиса.Наименование = НСтр("ru = 'Публикация запроса коммерческих предложений на ЭТП Бидзаар'");
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = "/api/connector/v" + ВерсияAPIБидзаар() + "/procedures/draft";
	ЗапросСервиса.Метод = "POST";
	ЗапросСервиса.Аутентификация = Ложь;

	//Формирование тела запроса и таблицы с данными, которые необходимо обработать после выполнения запроса 
	Результат = ЗаполнитьДанныеДляСервисаПубликацияЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапроса);
	ЗапросСервиса.Данные = ОбщегоНазначения.ЗначениеВJSON(Результат.ДанныеДляВыгрузки);

	//Заполнение заголовков http-запроса
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Bidzaar-Connector-User-Email", СокрЛП(ПараметрыЗапроса.UserEmail));
	Заголовки.Вставить("Authorization", "Bearer " + ПараметрыЗапроса.ТокенДоступа);
	
	Если ПараметрыЗапроса.ОтклонитьПредложения Тогда
		ДобавитьПараметрАдресаHTML(ПараметрыЗапроса.АдресМетода, "rollbackProposals", XMLСтрока(Истина));
	КонецЕсли;
	
	ЗапросСервиса.Заголовки = Заголовки;

	Возврат ЗапросСервиса;

КонецФункции

// Подготовка данных для создания и отправки http-запроса относящегося к обновлению запроса коммерческих предложений.
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//   * Сервер - Строка - имя сервера
//   * UserEmail - Строка - зарегистрированный в Бидзаар Email пользователя
//   * ТокенДоступа - строка - актуальный токен доступа
//   * ИдентификаторЗапросаКП - строка - идентификатор запроса коммерческих предложений в сервисе
//   * ДополнительныеПараметры - структура - значения вспомогательных параметров
//   * ОтклонитьПредложения - Булево - признак отклонения предложений
// 
// Возвращаемое значение:
//  Структура - Запрос сервиса публикация запроса коммерческих предложений бидзаар:
// 
Функция ЗапросСервисаОбновленияЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапроса)

	ЗапросСервиса = НовыйЗапросСервиса();

	//Трансляция дополнительных параметров запроса в описание запроса
	ДополнительныеПараметрыЗапроса = Новый Структура;
	Если ПараметрыЗапроса.Свойство("ДополнительныеПараметры", ДополнительныеПараметрыЗапроса) Тогда
		Для Каждого ДополнительныйПараметр Из ДополнительныеПараметрыЗапроса Цикл
			ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
	КонецЕсли;

	//Данные для вызова http-запроса
	ЗапросСервиса.Наименование = НСтр("ru = 'Обновление опубликованного запроса коммерческих предложений на ЭТП Бидзаар'");
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = СтрШаблон("/api/connector/v" + ВерсияAPIБидзаар() + "/procedures/%1", ПараметрыЗапроса.ИдентификаторЗапросаКП);
	ЗапросСервиса.Метод = "PATCH";
	ЗапросСервиса.Аутентификация = Ложь;

	//Формирование тела запроса и таблицы с данными, которые необходимо обработать после выполнения запроса 
	Результат = ЗаполнитьДанныеДляСервисаПубликацияЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапроса);
	ЗапросСервиса.Данные = ОбщегоНазначения.ЗначениеВJSON(Результат.ДанныеДляВыгрузки);

	//Заполнение заголовков http-запроса
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Bidzaar-Connector-User-Email", СокрЛП(ПараметрыЗапроса.UserEmail));
	Заголовки.Вставить("Authorization", "Bearer " + ПараметрыЗапроса.ТокенДоступа);

	Если ПараметрыЗапроса.ОтклонитьПредложения Тогда
		ДобавитьПараметрАдресаHTML(ЗапросСервиса.Адрес, "rollbackProposals", XMLСтрока(Истина));
	КонецЕсли;
	
	ЗапросСервиса.Заголовки = Заголовки;

	Возврат ЗапросСервиса;

КонецФункции

// Подготовка данных для создания и отправки http-запроса относящегося к публикации файлов на ЭТП Бидзаар.
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//   * UserEmail - Строка - зарегистрированный в Бидзаар Email пользователя
//   * ТокенДоступа - строка - актуальный токен доступа
//   * ДополнительныеПараметры - структура - значения вспомогательных параметров
// 
// Возвращаемое значение:
//  Структура - Запрос сервиса публикация запроса коммерческих предложений бидзаар:
//
Функция ЗапросСервисаПубликацияФайловБидзаар(ПараметрыЗапроса)
	ЗапросСервиса = НовыйЗапросСервиса();

	//Трансляция дополнительных параметров запроса в описание запроса
	ДополнительныеПараметрыЗапроса = Новый Структура;
	Если ПараметрыЗапроса.Свойство("ДополнительныеПараметры", ДополнительныеПараметрыЗапроса) Тогда
		Для Каждого ДополнительныйПараметр Из ДополнительныеПараметрыЗапроса Цикл
			ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
	КонецЕсли;

	//Данные для вызова http-запроса
	ЗапросСервиса.Наименование = НСтр("ru = 'Публикация файлов запроса коммерческих предложений на ЭТП Бидзаар'");
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = "/api/connector/v" + ВерсияAPIБидзаар() + "/files/upload";
	ЗапросСервиса.Метод = "POST";
	ЗапросСервиса.Аутентификация = Ложь;

	//Формирование тела запроса и таблицы с данными, которые необходимо обработать после выполнения запроса 
	Результат = ЗаполнитьДанныеДляСервисаПубликацияФайловБидзаар(ПараметрыЗапроса);
	ЗапросСервиса.Данные = Результат.ДанныеДляВыгрузки;

	//Заполнение заголовков http-запроса
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", СтрШаблон("multipart/form-data; boundary=%1", Результат.РазделительПараметров));
	Заголовки.Вставить("Content-Length", XMLСтрока(Результат.ДанныеДляВыгрузки.Размер()));
	Заголовки.Вставить("X-Bidzaar-Connector-User-Email", СокрЛП(ПараметрыЗапроса.UserEmail));
	Заголовки.Вставить("Authorization", "Bearer " + ПараметрыЗапроса.ТокенДоступа);

	ЗапросСервиса.Заголовки = Заголовки;

	Возврат ЗапросСервиса;
КонецФункции

// Подготовка данных для создания и отправки http-запроса относящегося к приглашеню участников.
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//   * UserEmail - Строка - зарегистрированный в Бидзаар Email пользователя
//   * ТокенДоступа - строка - актуальный токен доступа
//   * ИдентификаторЗапроса - строка - идентификатор запроса в сервисе
//   * ОписанияУчастников - массив из структура - см описание ЗаполнитьДанныеДляСервисаПриглашениеУчастниковБидзаар
//   * ДополнительныеПараметры - структура - значения вспомогательных параметров
// 
// Возвращаемое значение:
//  Структура - Запрос сервиса публикация запроса коммерческих предложений бидзаар:
//
Функция ЗапросСервисаПриглашениеУчастниковБидзаар(ПараметрыЗапроса)
	ЗапросСервиса = НовыйЗапросСервиса();

	//Трансляция дополнительных параметров запроса в описание запроса
	ДополнительныеПараметрыЗапроса = Новый Структура;
	Если ПараметрыЗапроса.Свойство("ДополнительныеПараметры", ДополнительныеПараметрыЗапроса) Тогда
		Для Каждого ДополнительныйПараметр Из ДополнительныеПараметрыЗапроса Цикл
			ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
	КонецЕсли;

	//Данные для вызова http-запроса
	ЗапросСервиса.Наименование = НСтр("ru = 'Приглашение участников ЭТП Бидзаар'");
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = "/api/connector/v" + ВерсияAPIБидзаар() + "/procedures/" + ПараметрыЗапроса.ИдентификаторЗапроса + "/participants/bytinemail";
	ЗапросСервиса.Метод = "POST";
	ЗапросСервиса.Аутентификация = Ложь;

	//Формирование тела запроса и таблицы с данными, которые необходимо обработать после выполнения запроса 
	Результат = ЗаполнитьДанныеДляСервисаПриглашениеУчастниковБидзаар(ПараметрыЗапроса);
	ЗапросСервиса.Данные = ОбщегоНазначения.ЗначениеВJSON(Результат.ДанныеДляВыгрузки);

	//Заполнение заголовков http-запроса
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Bidzaar-Connector-User-Email", СокрЛП(ПараметрыЗапроса.UserEmail));
	Заголовки.Вставить("Authorization", "Bearer " + ПараметрыЗапроса.ТокенДоступа);

	ЗапросСервиса.Заголовки = Заголовки;

	Возврат ЗапросСервиса;
КонецФункции

// Подготовка данных для создания и отправки http-запроса относящегося к получению файла
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//   * Сервер - Строка - Имя сервера торговой площадки
//   * UserEmail - Строка - зарегистрированный в Бидзаар Email пользователя
//   * ТокенДоступа - строка - актуальный токен доступа
//   * ИдентификаторФайла - строка - идентификатор файла в сервисе
//   * ДополнительныеПараметры - структура - значения вспомогательных параметров
// 
// Возвращаемое значение:
//  Структура - Запрос сервиса 'Получение файла'
//
Функция ЗапросСервисаПолучениеФайлаБидзаар(ПараметрыЗапроса)
	ЗапросСервиса = НовыйЗапросСервиса();

	//Трансляция дополнительных параметров запроса в описание запроса
	ДополнительныеПараметрыЗапроса = Новый Структура;
	Если ПараметрыЗапроса.Свойство("ДополнительныеПараметры", ДополнительныеПараметрыЗапроса) Тогда
		Для Каждого ДополнительныйПараметр Из ДополнительныеПараметрыЗапроса Цикл
			ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
	КонецЕсли;

	//Данные для вызова http-запроса
	ЗапросСервиса.Наименование = НСтр("ru = 'Получение файла Бидзаар'");
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = "/api/connector/v" + ВерсияAPIБидзаар() + "/files/" + ПараметрыЗапроса.ИдентификаторФайла;
	ЗапросСервиса.Метод = "GET";
	ЗапросСервиса.Аутентификация = Ложь;

	//Заполнение заголовков http-запроса
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("fileId", ПараметрыЗапроса.ИдентификаторФайла);
	Заголовки.Вставить("X-Bidzaar-Connector-User-Email", СокрЛП(ПараметрыЗапроса.UserEmail));
	Заголовки.Вставить("Authorization", "Bearer " + ПараметрыЗапроса.ТокенДоступа);

	ЗапросСервиса.Заголовки = Заголовки;

	Возврат ЗапросСервиса;
КонецФункции

Функция ЗаполнитьДанныеДляСервисаПубликацияТоваровИУслугБидзаар(ПараметрыЗапроса)

	ДанныеДляВыгрузки = Новый Массив; //массив из строка
	ОбработкаРезультата = Новый ТаблицаЗначений;
	
	Результат = Новый Структура("ДанныеДляВыгрузки, ОбработкаРезультата", ДанныеДляВыгрузки, ОбработкаРезультата);

	ВариантВыгрузки = -1;
	ПараметрыЗапроса.Свойство("ВариантВыгрузки", ВариантВыгрузки);

	Запрос = Новый Запрос;

	Если ВариантВыгрузки = -1 Тогда //Данные для проверки подключения
		
		Возврат Результат;

	ИначеЕсли ВариантВыгрузки = 2 Тогда //Данные по указанному в параметрах списку

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Список.Номенклатура,
		|	Список.Характеристика
		|ПОМЕСТИТЬ ВТ_Список
		|ИЗ
		|	&Список КАК Список
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1000
		|	&УчетнаяЗапись КАК УчетнаяЗапись,
		|	ВТ_Список.Номенклатура КАК Номенклатура,
		|	ВТ_Список.Характеристика КАК Характеристика,
		|	СтатусыПубликацииТоваровЭТП.ПредставлениеНоменклатуры КАК ПредставлениеНоменклатуры
		|ИЗ
		|	ВТ_Список КАК ВТ_Список
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПубликацииТоваровЭТП КАК СтатусыПубликацииТоваровЭТП
		|		ПО &УчетнаяЗапись = СтатусыПубликацииТоваровЭТП.УчетнаяЗапись
		|		И ВТ_Список.Номенклатура = СтатусыПубликацииТоваровЭТП.Номенклатура
		|		И ВТ_Список.Характеристика = СтатусыПубликацииТоваровЭТП.Характеристика
		|ГДЕ
		|	НЕ СтатусыПубликацииТоваровЭТП.ПредставлениеНоменклатуры ЕСТЬ NULL
		|	И СтатусыПубликацииТоваровЭТП.ДатаВыгрузки < &НачалоВыгрузки";

		Запрос.УстановитьПараметр("Список", ПараметрыЗапроса["Список"]);

	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	СтатусыПубликацииТоваровЭТП.УчетнаяЗапись КАК УчетнаяЗапись,
		|	СтатусыПубликацииТоваровЭТП.Номенклатура КАК Номенклатура,
		|	СтатусыПубликацииТоваровЭТП.Характеристика КАК Характеристика,
		|	СтатусыПубликацииТоваровЭТП.ПредставлениеНоменклатуры КАК ПредставлениеНоменклатуры
		|ИЗ
		|	РегистрСведений.СтатусыПубликацииТоваровЭТП КАК СтатусыПубликацииТоваровЭТП
		|ГДЕ
		|	СтатусыПубликацииТоваровЭТП.УчетнаяЗапись = &УчетнаяЗапись
		|	И ВЫБОР
		|		КОГДА &ВариантВыгрузки = 1
		|			ТОГДА СтатусыПубликацииТоваровЭТП.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовЭТП.КПубликации))
		|		ИНАЧЕ СтатусыПубликацииТоваровЭТП.ДатаВыгрузки < &НачалоВыгрузки
		|	КОНЕЦ";

		Запрос.УстановитьПараметр("ВариантВыгрузки", ВариантВыгрузки);

	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1000", Формат(ПараметрыЗапроса["ЛимитПозицийНаИтерацию"], "ЧГ="));

	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("УчетнаяЗапись", ПараметрыЗапроса["УчетнаяЗапись"]);
	Запрос.УстановитьПараметр("НачалоВыгрузки", ПараметрыЗапроса["НачалоВыгрузки"]);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	Пока ВыборкаДанных.Следующий() Цикл
		ДанныеДляВыгрузки.Добавить(ВыборкаДанных["ПредставлениеНоменклатуры"]);
	КонецЦикла;

	Результат.ОбработкаРезультата = РезультатЗапроса.Выгрузить();

	Возврат Результат;

КонецФункции

// Заполнить данные для сервиса публикация запроса коммерческих предложений бидзаар.
// 
// Параметры:
//  ПараметрыЗапроса - Структура - Параметры запроса. Содержит свойства:
//   *ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - содержит выгружаемые данные
//   *ОписанияФайловСервиса - массив из структура - данные ранее опубликованных файлов. см описание НовыйОписаниеОпубликованногоФайлаБидзаар()
// 
// Возвращаемое значение:
// Структура - содержит свойства:
//  *ДанныеДляВыгрузки - структура - данные в формате http-запроса
//  *ОбработкаРезультата - ТаблицаЗначений - данные 1С, подлежащие пост обработке после успешного выполения запроса
//  
Функция ЗаполнитьДанныеДляСервисаПубликацияЗапросаКоммерческихПредложенийБидзаар(ПараметрыЗапроса)

	ДанныеДляВыгрузки = Новый Структура;
	ОбработкаРезультата = Новый ТаблицаЗначений;

	Результат = Новый Структура("ДанныеДляВыгрузки, ОбработкаРезультата", ДанныеДляВыгрузки, ОбработкаРезультата);

	ЗапросКП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыЗапроса.ЗапросКоммерческихПредложений,
		"Валюта.Наименование, Валюта.Код, Номер, Дата, Наименование,
		|ДатаОкончанияРассмотрения, АдресДоставкиЗначенияПолей,
		|Менеджер, МенеджерEmail, МенеджерНомерТелефона, Налогообложение, ЦенаВключаетНДС,
		|УсловиеПоставкиТекст, УсловияОплатыТекст, ПрочаяДополнительнаяИнформацияТекст,
		|МожетОбеспечиватьсяЧастично, ПроведениеОпроса, ПредставлениеКИ, КлючевыеСлова");
	
	ЧастиОписаниия = Новый Массив;	//Массив из строка
	Если Не ПустаяСтрока(ЗапросКП.УсловиеПоставкиТекст) Тогда
		ЧастиОписаниия.Добавить("<b>" + НСтр("ru = 'Условия поставки:'") + "</b>");
		ЧастиОписаниия.Добавить(СокрЛП(ЗапросКП.УсловиеПоставкиТекст));
	КонецЕсли;
	
	Если Не ПустаяСтрока(ЗапросКП.УсловияОплатыТекст) Тогда
		ЧастиОписаниия.Добавить("<b>" + НСтр("ru = 'Условия оплаты:'") + "</b>");
		ЧастиОписаниия.Добавить(СокрЛП(ЗапросКП.УсловияОплатыТекст));
	КонецЕсли;
	
	Если Не ПустаяСтрока(ЗапросКП.ПрочаяДополнительнаяИнформацияТекст) Тогда
		ЧастиОписаниия.Добавить("<b>" + НСтр("ru = 'Прочее:'") + "</b>");
		ЧастиОписаниия.Добавить(СокрЛП(ЗапросКП.ПрочаяДополнительнаяИнформацияТекст));
	КонецЕсли;
	
	ДанныеДляВыгрузки.Вставить("status", 0);	// Черновик
	ДанныеДляВыгрузки.Вставить("tradingType", 2);	// Торги за единицу
	ДанныеДляВыгрузки.Вставить("specialCondition");	// Cпециальных условий нет
	ДанныеДляВыгрузки.Вставить("type", 1);	// Закупка
	ДанныеДляВыгрузки.Вставить("name", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2 от %3", ЗапросКП.Наименование,
		СокрЛП(ЗапросКП.Номер), Формат(ЗапросКП.Дата, "ДФ=dd.MM.yyyy;")));
	ДанныеДляВыгрузки.Вставить("description", СтрСоединить(ЧастиОписаниия, "<br/>"));
	ДанныеДляВыгрузки.Вставить("acceptanceEndDate", КонецДня(ЗапросКП.ДатаОкончанияРассмотрения));	// Дата окончания раунда приема предложений
	ДанныеДляВыгрузки.Вставить("openType", 0);	// Открытая (все поставщики видят процедуру)
	ДанныеДляВыгрузки.Вставить("otherParticipantsVisibility", 2);	// Участники видят предложения конкурентов без наименования
	ДанныеДляВыгрузки.Вставить("vatEnabled", ЗапросКП.Налогообложение И ЗапросКП.ЦенаВключаетНДС); // Цена включает НДС
	ДанныеДляВыгрузки.Вставить("alternativeProposals", 1);	// Максимум одно альтернативное предложение
	ДанныеДляВыгрузки.Вставить("currency", НаименованиеВалютыБидзаар(ЗапросКП.ВалютаНаименование,ЗапросКП.ВалютаКод));	// Наименование валюты. Формат ISO 4217
	ДанныеДляВыгрузки.Вставить("additionalCurrencies");	// Предложения только в основной валюте
	ДанныеДляВыгрузки.Вставить("prolongationTime", 15);	// Автопродление приема предложений - 15 минутах
	ДанныеДляВыгрузки.Вставить("acceptanceEndNotificationHours", 48);	// Напомнить об окончании срока рассмотрения за 48 часов
	ДанныеДляВыгрузки.Вставить("additionalAcceptanceEndNotificationHours", 0);	// Не информировать повторно об окончании срока рассмотрения
	ДанныеДляВыгрузки.Вставить("ownerVisibility", 0);	// Организатор видит предложения участников на этапе сбора
	ДанныеДляВыгрузки.Вставить("approximateDeadlineForSummingUp", 10);	// В течение 10 дней итоги должны быть подведены
	ДанныеДляВыгрузки.Вставить("contacts", ЗапросКП.ПредставлениеКИ);
	
	//Адреса доставки
	АдресаДоставки = Новый Массив; // Массив Из Структура
	АдресаДоставки.Добавить(ЗаполнитьДанныеАдресаДляВыгрузкиБидзаар(ЗапросКП.АдресДоставкиЗначенияПолей));
	ДанныеДляВыгрузки.Вставить("deliveryAddresses", АдресаДоставки);
	
	//теги для классификации запроса коммерческих предложений
	ДанныеДляВыгрузки.Вставить("tags", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.МассивКлючевыхСлов(ЗапросКП.КлючевыеСлова));
	ДанныеДляВыгрузки.Вставить("betUpDown", Истина);	//Разрешено и повышать и понижать цену
	ДанныеДляВыгрузки.Вставить("betStep", 1);	//Шаг изменения - 1 единица валюты
	ДанныеДляВыгрузки.Вставить("betStepType", ?(ЗапросКП.МожетОбеспечиватьсяЧастично = 1, 1, 0)); // В чем изменяется цена: 0 - процент, 1 - валюта
	ДанныеДляВыгрузки.Вставить("betReference", 0);	//Отсчет новой цены от своего предложения
	ДанныеДляВыгрузки.Вставить("betPrice", 0);
	ДанныеДляВыгрузки.Вставить("positionsEnabled", Истина);	//Спецификация по позициям

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПараметрыЗапроса.ЗапросКоммерческихПредложений);
	Запрос.УстановитьПараметр("ПустаяЕдиницаИзмерения", Метаданные.ОпределяемыеТипы.УпаковкаНоменклатурыБЭД.Тип.ПривестиЗначение(Неопределено));
	Запрос.УстановитьПараметр("НоменклатураЕдиницаИзмерения", Метаданные.ОпределяемыеТипы.УпаковкаНоменклатурыБЭД.Тип.ПривестиЗначение(Неопределено));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка КАК ГруппаТоваров,
	|	ТаблицаТоваров.ИдентификаторСтрокиЗапроса КАК НоменклатураИдентификатор,
	|	ТаблицаТоваров.НаименованиеСтрокой КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.ЕдиницаИзмерения = &ПустаяЕдиницаИзмерения
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(&НоменклатураЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ТаблицаТоваров.ЕдиницаИзмерения)
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.МаксимальнаяЦена КАК МаксимальнаяЦена
	|ИЗ
	|	Документ.ЗапросКоммерческихПредложенийПоставщиков.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	ГруппаТоваров";
	
	ИнтеграцияСЭлектроннымиТорговымиПлощадкамиПереопределяемый.ДополнитьТекстЗапросаЕдиницейИзмеренияНоменклатуры(
		Запрос.Текст,
		"&НоменклатураЕдиницаИзмерения",
		"ТаблицаТоваров");
	
	РезультатЗапроса = Запрос.Выполнить();

	ОписанияГруппТоваров = Новый Массив; // Массив Из Структура
	НомерГруппыТоваров = 1;

	ВыборкаГруппТоваров = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГруппТоваров.Следующий() Цикл

		ОписаниеГруппыТовара = Новый Структура;
		ОписаниеГруппыТовара.Вставить("originId", XMLСтрока(ВыборкаГруппТоваров["ГруппаТоваров"]));
		ОписаниеГруппыТовара.Вставить("index", НомерГруппыТоваров);
		ОписаниеГруппыТовара.Вставить("name", "Состав лота");

		Если ЗапросКП.МожетОбеспечиватьсяЧастично = 0 Тогда
			ОписаниеГруппыТовара.Вставить("deviationType", 2);	//В комм. предложении разрешена подача части позиций
		ИначеЕсли ЗапросКП.МожетОбеспечиватьсяЧастично = 1 Тогда
			ОписаниеГруппыТовара.Вставить("deviationType", 0);	//Все товары группы идут одним неделимым лотом
		Иначе
			ОписаниеГруппыТовара.Вставить("deviationType", 1);	//В комм. предложении разрешена подача части позиций с отклонением по кол-ву
		КонецЕсли;
		
		ОписаниеГруппыТовара.Вставить("betUpDown", Истина);	//Цену можно как повышать, так и понижать
		ОписаниеГруппыТовара.Вставить("betStep", 1);	//Шаг изменения - 1 единица валюты
		ОписаниеГруппыТовара.Вставить("betStepType", ?(ЗапросКП.МожетОбеспечиватьсяЧастично = 1, 1, 0)); // В чем изменяется цена: 0 - процент, 1 - валюта
		ОписаниеГруппыТовара.Вставить("betReference", 0);	//Отсчет новой цены от своего предложения
		ОписаниеГруппыТовара.Вставить("betPrice", 0);
		ОписаниеГруппыТовара.Вставить("additionalFields", Новый Массив);

		ОписанияТоваров = Новый Массив;	//массив из структура

		Выборка = ВыборкаГруппТоваров.Выбрать();
		Пока Выборка.Следующий() Цикл

			ОписаниеТовара = Новый Структура;
			ОписаниеТовара.Вставить("originId", Выборка["НоменклатураИдентификатор"]);
			ОписаниеТовара.Вставить("index", Выборка["НомерСтроки"]);
			ОписаниеТовара.Вставить("name", Выборка["НоменклатураНаименование"]);
			ОписаниеТовара.Вставить("description", Выборка["НоменклатураНаименование"]);
			ОписаниеТовара.Вставить("count", Выборка["Количество"]);
			ОписаниеТовара.Вставить("unit", Сред(Выборка["ЕдиницаИзмеренияНаименование"],1,12)); // Для данного поля ограничение по длине в 12 символов
			ОписаниеТовара.Вставить("price", Выборка["МаксимальнаяЦена"]);
			ОписаниеТовара.Вставить("betPrice", Выборка["МаксимальнаяЦена"]);
			ОписаниеТовара.Вставить("additionalFieldsValues");
			ОписаниеТовара.Вставить("files");

			ОписанияТоваров.Добавить(ОписаниеТовара);

		КонецЦикла;

		ОписаниеГруппыТовара.Вставить("positions", ОписанияТоваров);

		ОписанияГруппТоваров.Добавить(ОписаниеГруппыТовара);

		НомерГруппыТоваров = НомерГруппыТоваров + 1;

	КонецЦикла;

	ДанныеДляВыгрузки.Вставить("positionGroups", ОписанияГруппТоваров);

	// Документы запроса коммерческих приложений
	ПрисоединяемыеФайлы = Новый массив;	// массив из структура
	ДанныеДляВыгрузки.Вставить("commonFiles", ПрисоединяемыеФайлы);
	
	Если ПараметрыЗапроса.ОписанияФайловСервиса <> Неопределено Тогда
		Для Каждого ОписанияФайлаСервиса из ПараметрыЗапроса.ОписанияФайловСервиса Цикл
			ПрисоединяемыеФайлы.Добавить(ОписанияФайлаСервиса);
		КонецЦикла;
	КонецЕсли;

	ДанныеДляВыгрузки.Вставить("questionnaireEnabled", Ложь);
	
	// Вопросы
	ДеревоВопросов = ПолучитьВопросыОпроса(ЗапросКП.ПроведениеОпроса);
	Если ДеревоВопросов.Строки.Количество() > 0 Тогда
		
		ДанныеДляВыгрузки.Вставить("questionnaireEnabled", Истина);
		
		Разделы = Новый Массив;
		Для Каждого Раздел Из ДеревоВопросов.Строки Цикл
			ОписаниеРаздела = Новый Структура;
			ОписаниеРаздела.Вставить("originId", Раздел.ИдентификаторРаздела);
			ОписаниеРаздела.Вставить("text", Раздел.НаименованиеРаздела);
			ОписаниеРаздела.Вставить("items", Новый Массив);
			
			Для Каждого Вопрос Из Раздел.Строки Цикл
				ОписаниеВопроса = Новый Структура;
				ОписаниеВопроса.Вставить("originId", Вопрос.ИдентификаторВопроса);
				ОписаниеВопроса.Вставить("text", Вопрос.Вопрос);
				ОписаниеВопроса.Вставить("type", Вопрос.ТипОтвета);
				ОписаниеВопроса.Вставить("required", Вопрос.Обязательный);
				ОписаниеВопроса.Вставить("private", Не Вопрос.ОтветВиденВсем);
				ОписаниеВопроса.Вставить("files", Новый Массив);
				
				Если Вопрос.ВариантыОтветов.Количество() > 0 Тогда
					ОписаниеВопроса.Вставить("values", Новый Массив);
					Для Каждого ВариантОтвета Из Вопрос.ВариантыОтветов Цикл
						ОписаниеВопроса.values.Добавить(ВариантОтвета);
					КонецЦикла;
				КонецЕсли;
				
				ОписаниеРаздела.items.Добавить(ОписаниеВопроса);
			КонецЦикла;
			
			Разделы.Добавить(ОписаниеРаздела);
		КонецЦикла;
		
		ДанныеДляВыгрузки.Вставить("questionnaire", Разделы);
		
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Формирует структуру данных адреса для выгрузки на Бидзаар из контактной информации в формате JSON.
//
// Параметры:
//   АдресДоставкиЗначенияПолей - Строка - значения полей адреса в формате JSON
//
// Возвращаемое значение:
//   Структура - см. ДанныеАдресаДляВыгрузкиБидзаар
Функция ЗаполнитьДанныеАдресаДляВыгрузкиБидзаар(Знач АдресДоставкиЗначенияПолей)
	
	АдресДоставки = ДанныеАдресаДляВыгрузкиБидзаар();
	
	ДанныеАдресаДоставки = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(
		АдресДоставкиЗначенияПолей,
		Перечисления.ТипыКонтактнойИнформации.Адрес);

	ПолеСтрана = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАдресаДоставки, "country", ""); // Строка
	ПолеРегион = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАдресаДоставки, "areaValue", ""); // Строка
	Если ПустаяСтрока(ПолеРегион) Тогда
		ПолеРегион = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАдресаДоставки, "area", ""); // Строка		
	КонецЕсли;
	ПолеРайонВРегионе = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАдресаДоставки, "district", ""); // Строка
	ПолеТипРайонаВРегионе = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАдресаДоставки, "districtType", ""); // Строка
	ПолеРайонВРегионеСТипом = "";
	Если Не ПустаяСтрока(ПолеРайонВРегионе) И Не ПустаяСтрока(ПолеТипРайонаВРегионе) Тогда
		ПолеРайонВРегионеСТипом = СтрШаблон("%1 %2", ПолеТипРайонаВРегионе, ПолеРайонВРегионе);			
	ИначеЕсли Не ПустаяСтрока(ПолеРайонВРегионе) Тогда
		ПолеРайонВРегионеСТипом = ПолеРайонВРегионе;
	КонецЕсли;
	ПолеГород = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАдресаДоставки, "city", ""); // Строка
	ПолеТипГорода = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАдресаДоставки, "cityType", ""); // Строка
	ГородВ1С = "";
	Если Не ПустаяСтрока(ПолеТипГорода) И Не ПустаяСтрока(ПолеГород) Тогда
		ГородВ1С = СтрШаблон("%1 %2", ПолеТипГорода, ПолеГород);
	ИначеЕсли Не ПустаяСтрока(ПолеГород) Тогда
		ГородВ1С = ПолеГород;
	КонецЕсли;
	ПолеАдресДоставки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАдресаДоставки, "value", ""); // Строка
	ПолеКомментарийАдреса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАдресаДоставки, "comment", ""); // Строка
	
	АдресДоставки.country = ОбработатьЗначениеАдресаДляВыгрузкиБидзаар(ПолеСтрана, 50);
	АдресДоставки.region = ОбработатьЗначениеАдресаДляВыгрузкиБидзаар(ПолеРегион, 100);
	АдресДоставки.area = ОбработатьЗначениеАдресаДляВыгрузкиБидзаар(ПолеРайонВРегионеСТипом, 100);
	АдресДоставки.cityType = ОбработатьЗначениеАдресаДляВыгрузкиБидзаар(ПолеТипГорода, 50);
	АдресДоставки.city = ОбработатьЗначениеАдресаДляВыгрузкиБидзаар(ПолеГород, 50);
	АдресДоставки.addressComment = ОбработатьЗначениеАдресаДляВыгрузкиБидзаар(ПолеКомментарийАдреса, 200);
	
	// Удаляем те части адреса, которые выгружаются отдельными полями, из общего адреса
	МассивУдаляемыхЧастейАдреса = Новый Массив; // Массив из Строка
	МассивУдаляемыхЧастейАдреса.Добавить(ПолеСтрана);
	МассивУдаляемыхЧастейАдреса.Добавить(ПолеРегион);
	МассивУдаляемыхЧастейАдреса.Добавить(ПолеРайонВРегионеСТипом);
	МассивУдаляемыхЧастейАдреса.Добавить(ГородВ1С);
	ЧастиАдресов = СтрРазделить(ПолеАдресДоставки, ",", Ложь);
	// Убираем крайние пробелы в частях адреса
	Для Индекс = 0 По ЧастиАдресов.ВГраница() Цикл
		ЧастиАдресов[Индекс] = СокрЛП(ЧастиАдресов[Индекс]);
	КонецЦикла;
	Для Каждого УдаляемаяЧастьАдреса Из МассивУдаляемыхЧастейАдреса Цикл
		ИндексПоиска = ЧастиАдресов.Найти(УдаляемаяЧастьАдреса);
		Если ИндексПоиска <> Неопределено Тогда
			ЧастиАдресов.Удалить(ИндексПоиска);		
		КонецЕсли;	
	КонецЦикла;
	ПолеАдресДоставки = СтрСоединить(ЧастиАдресов, ", ");
	АдресДоставки.building = ОбработатьЗначениеАдресаДляВыгрузкиБидзаар(ПолеАдресДоставки, 200);
	
	Возврат АдресДоставки; 
	
КонецФункции

Функция ПолучитьВопросыОпроса(ПроведениеОпроса)
	
	Результат = Новый ДеревоЗначений;
	Результат.Колонки.Добавить("ИдентификаторРаздела", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(40)));
	Результат.Колонки.Добавить("НаименованиеРаздела", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1024)));
	Результат.Колонки.Добавить("ИдентификаторВопроса", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(40)));
	Результат.Колонки.Добавить("Вопрос", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(2048)));
	Результат.Колонки.Добавить("ТипОтвета", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("Обязательный", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ОтветВиденВсем", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ВариантыОтветов", Новый ОписаниеТипов("Массив"));
	
	ТипыОтветов = Новый Соответствие;
	ТипыОтветов.Вставить(Перечисления.ТипыОтветовНаВопрос.Булево, "boolean");
	ТипыОтветов.Вставить(Перечисления.ТипыОтветовНаВопрос.Число, "number");
	ТипыОтветов.Вставить(Перечисления.ТипыОтветовНаВопрос.Дата, "datetime");
	ТипыОтветов.Вставить(Перечисления.ТипыОтветовНаВопрос.Строка, "input");
	ТипыОтветов.Вставить(Перечисления.ТипыОтветовНаВопрос.Текст, "input");
	ТипыОтветов.Вставить(Перечисления.ТипыОтветовНаВопрос.ОдинВариантИз, "select");
	ТипыОтветов.Вставить(Перечисления.ТипыОтветовНаВопрос.НесколькоВариантовИз, "multiple");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НазначениеОпросов.ШаблонАнкеты КАК ШаблонАнкеты
	|ПОМЕСТИТЬ врШаблонАнкеты
	|ИЗ
	|	Документ.НазначениеОпросов КАК НазначениеОпросов
	|ГДЕ
	|	НазначениеОпросов.Ссылка = &ПроведениеОпроса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВопросыШаблонаАнкеты.Родитель) КАК ИдентификаторРаздела,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВопросыШаблонаАнкеты.Ссылка) КАК ИдентификаторВопроса,
	|	ПРЕДСТАВЛЕНИЕ(ВопросыШаблонаАнкеты.Родитель) КАК НаименованиеРаздела,
	|	ВопросыШаблонаАнкеты.Формулировка КАК Вопрос,
	|	ВопросыДляАнкетирования.ТипОтвета КАК ТипОтвета,
	|	ВопросыШаблонаАнкеты.Обязательный КАК Обязательный,
	|	ВопросыШаблонаАнкеты.Ссылка КАК ВопросСсылка,
	|	ВопросыДляАнкетирования.Ссылка КАК ЭлементарныйВопросСсылка
	|ПОМЕСТИТЬ врВопросы
	|ИЗ
	|	Справочник.ВопросыШаблонаАнкеты КАК ВопросыШаблонаАнкеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ВопросыДляАнкетирования КАК ВопросыДляАнкетирования
	|		ПО ВопросыШаблонаАнкеты.ЭлементарныйВопрос = ВопросыДляАнкетирования.Ссылка
	|ГДЕ
	|	ВопросыШаблонаАнкеты.Владелец В
	|			(ВЫБРАТЬ
	|				врШаблонАнкеты.ШаблонАнкеты
	|			ИЗ
	|				врШаблонАнкеты КАК врШаблонАнкеты)
	|	И ВопросыШаблонаАнкеты.ТипВопроса В (ЗНАЧЕНИЕ(Перечисление.ТипыВопросовШаблонаАнкеты.Простой), ЗНАЧЕНИЕ(Перечисление.ТипыВопросовШаблонаАнкеты.ВопросСУсловием))
	|	И ВопросыДляАнкетирования.Ссылка ЕСТЬ НЕ NULL
	|	И НЕ ВопросыШаблонаАнкеты.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	врВопросы.ИдентификаторРаздела КАК ИдентификаторРаздела,
	|	врВопросы.НаименованиеРаздела КАК НаименованиеРаздела,
	|	врВопросы.ИдентификаторВопроса КАК ИдентификаторВопроса,
	|	врВопросы.Вопрос КАК Вопрос,
	|	врВопросы.ТипОтвета КАК ТипОтвета,
	|	врВопросы.Обязательный КАК Обязательный,
	|	врВопросы.ВопросСсылка КАК ВопросСсылка,
	|	ВариантыОтветовАнкет.Наименование КАК ВариантОтвета
	|ИЗ
	|	врВопросы КАК врВопросы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОтветовАнкет КАК ВариантыОтветовАнкет
	|		ПО врВопросы.ЭлементарныйВопросСсылка = ВариантыОтветовАнкет.Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторРаздела,
	|	ВопросСсылка";
	
	Запрос.УстановитьПараметр("ПроведениеОпроса", ПроведениеОпроса);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекущийИдентификаторРаздела = Неопределено;
	ТекущийВопросСсылка = Неопределено;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИдентификаторРаздела = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
			Продолжить;
		КонецЕсли;
		Если Выборка.ИдентификаторРаздела <> ТекущийИдентификаторРаздела Тогда
			ТекущийИдентификаторРаздела = Выборка.ИдентификаторРаздела;
			ТекущийВопросСсылка = Неопределено;
			Раздел = Результат.Строки.Добавить();
			Раздел.ИдентификаторРаздела = Строка(Выборка.ИдентификаторРаздела);
			Раздел.НаименованиеРаздела = Строка(Выборка.НаименованиеРаздела);
		КонецЕсли;
		
		Если ТекущийВопросСсылка <> Выборка.ВопросСсылка Тогда
			ТекущийВопросСсылка = Выборка.ВопросСсылка;
			Вопрос = Раздел.Строки.Добавить();
			Вопрос.ИдентификаторВопроса = Выборка.ИдентификаторВопроса;
			Вопрос.Вопрос = Выборка.Вопрос;
			Вопрос.ТипОтвета = ТипыОтветов.Получить(Выборка.ТипОтвета);
			Вопрос.Обязательный = Выборка.Обязательный;
			Вопрос.ОтветВиденВсем = Ложь;
		КонецЕсли;
		
		Если Выборка.ВариантОтвета <> Null Тогда
			Вопрос.ВариантыОтветов.Добавить(Выборка.ВариантОтвета);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Заполнить данные для сервиса публикация документов бидзаар.
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//   *ОписанияФайлов - массив из структура - публикуемые файлы. Содержит свойства:
//    **Имя - строка - имя публикуемого файла без расширения
//    **Расширение - строка - расширение выгружаемого файла
//    **Данные - строка - двоичные данные файла в формате Base64 
// 
// Возвращаемое значение:
//  Структура - Заполнить данные для сервиса публикация документов бидзаар.Содержит свойства:
//   * ДанныеДляВыгрузки - ДвоичныеДанные - данные в формате form-data
//   * ОбработкаРезультата - ТаблицаЗначений - данные, которые необходимо обработать после выполнения запроса сервиса 
Функция ЗаполнитьДанныеДляСервисаПубликацияФайловБидзаар(ПараметрыЗапроса)
	
	ОбработкаРезультата = Новый ТаблицаЗначений;
	Разделитель = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");

	Результат = Новый Структура("ДанныеДляВыгрузки, ОбработкаРезультата, РазделительПараметров",
		Неопределено, ОбработкаРезультата, Разделитель);
	
	ДанныеFormData = Новый ПотокВПамяти;
	ЗаписьДанных = Новый ЗаписьДанных(ДанныеFormData);
	
	Для Каждого ОписаниеФайла Из ПараметрыЗапроса.ОписанияФайлов Цикл
		
		ДанныеФайлаFormData = СоздатьСообщение_Файл(ОписаниеФайла.Имя, ОписаниеФайла.Расширение, ОписаниеФайла.Данные);

		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
		ЗаписьДанных.Записать(ДанныеФайлаFormData);
		ЗаписьДанных.ЗаписатьСтроку("");
		
	КонецЦикла;
	
	ЗаписьДанных.ЗаписатьСтроку(СтрШаблон("--%1--", Разделитель));
	ЗаписьДанных.Закрыть();
	
	Результат.ДанныеДляВыгрузки = ДанныеFormData.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат Результат;
КонецФункции

Функция СоздатьСообщение_Файл(ИмяФайла, Расширение, ДвоичныеДанные)
	
	Поток = Новый ПотокВПамяти();
	ЗаписьДанных = Новый ЗаписьДанных(Поток);

	Если Расширение = "pdf" Тогда
		ТипСообщения =  "application/pdf";
	ИначеЕсли Расширение = "doc" Тогда
		ТипСообщения =  "application/msword";
	Иначе
		ТипСообщения =  "application/*";
	КонецЕсли;
	
	ПолноеИмяФайла = СтрШаблон("%1.%2", ИмяФайла, Расширение);
	
	ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""files""; filename=""" + ПолноеИмяФайла + """");
	ЗаписьДанных.ЗаписатьСтроку("Content-Type: " + ТипСообщения);
	ЗаписьДанных.ЗаписатьСтроку("");
	ЗаписьДанных.Записать(ДвоичныеДанные);
	ЗаписьДанных.Закрыть();

	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
КонецФункции

// Заполнить данные для сервиса публикация документов бидзаар.
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//   *ОписанияУчастников - массив из структура - данные приглашаемых участников. Содержит свойства:
//    **ИНН - строка - имя публикуемого файла без расширения
//    **email - строка - email контактного лица
//    **companyName - строка - наименование организации 
// 
// Возвращаемое значение:
//  Структура - данные для сервиса приглашения участников.Содержит свойства:
//   *ДанныеДляВыгрузки - Массив из структура - данные в формате htpp-запроса Бидзаар 
//   *ОбработкаРезультата - ТаблицаЗначений - данные, которые необходимо обработать после выполнения запроса сервиса 
Функция ЗаполнитьДанныеДляСервисаПриглашениеУчастниковБидзаар(ПараметрыЗапроса)
	
	ДанныеДляВыгрузки = Новый Массив;	//массив из структура
	ОбработкаРезультата = Новый ТаблицаЗначений;

	Результат = Новый Структура("ДанныеДляВыгрузки, ОбработкаРезультата", ДанныеДляВыгрузки, ОбработкаРезультата);

	Для Каждого ОписаниеУчастника Из ПараметрыЗапроса.ОписанияУчастников Цикл

		ОписаниеУчастникаСервиса = Новый Структура;
		ОписаниеУчастникаСервиса.Вставить("tin", ОписаниеУчастника.ИНН);
		ОписаниеУчастникаСервиса.Вставить("email", ОписаниеУчастника.email);
		ОписаниеУчастникаСервиса.Вставить("companyName", ОписаниеУчастника.Наименование);

		ДанныеДляВыгрузки.Добавить(ОписаниеУчастникаСервиса);
	КонецЦикла;
		
	Возврат Результат;
КонецФункции

// Подготовка данных для создания и отправки http-запроса относящегося к получению событий, произошедшими с документами на ЭТП Бидзаар
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//   * UserEmail - Строка - зарегистрированный в Бидзаар Email пользователя
//   * ТокенДоступа - строка - актуальный токен доступа
//   * ДополнительныеПараметры - структура - значения вспомогательных параметров
// 
// Возвращаемое значение:
//  Структура - Запрос сервиса публикация запроса коммерческих предложений бидзаар:
//
Функция ЗапросСервисаПолучениеСобытийБидзаар(ПараметрыЗапроса)

	ЗапросСервиса = НовыйЗапросСервиса();

	//Трансляция дополнительных параметров запроса в описание запроса
	ДополнительныеПараметрыЗапроса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса,
		"ДополнительныеПараметры", Новый Структура); // Структура
	Для Каждого ДополнительныйПараметр Из ДополнительныеПараметрыЗапроса Цикл
		ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
	КонецЦикла;

	//Данные для вызова http-запроса
	ЗапросСервиса.Наименование = НСтр("ru = 'Получение списка событий'");
	ДатаОбновления = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "ДатаОбновления", Дата(1, 1, 1)); // Дата
	ПараметрДата = ?(ДатаОбновления = Дата(1, 1, 1), "", "?dateFrom=" + Формат(ДатаОбновления, "ДФ=yyyy.MM.dd;"));
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = СтрШаблон("/api/connector/v" + ВерсияAPIБидзаар() + "/events/%1", ПараметрДата);
	ЗапросСервиса.Метод = "GET";
	ЗапросСервиса.Аутентификация = Истина;

	//Заполнение заголовков http-запроса
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Bidzaar-Connector-User-Email", СокрЛП(ПараметрыЗапроса.UserEmail));
	Заголовки.Вставить("Authorization", "Bearer " + ПараметрыЗапроса.ТокенДоступа);

	ЗапросСервиса.Заголовки = Заголовки;

	Возврат ЗапросСервиса;
	
КонецФункции

Функция ЗапросСервисаПолучениеИдентификаторовКоммерческихПредложенийБидзаар(ПараметрыЗапроса)
	
	ЗапросСервиса = НовыйЗапросСервиса();

	//Трансляция дополнительных параметров запроса в описание запроса
	ДополнительныеПараметрыЗапроса = Новый Структура;
	Если ПараметрыЗапроса.Свойство("ДополнительныеПараметры", ДополнительныеПараметрыЗапроса) Тогда
		Для Каждого ДополнительныйПараметр Из ДополнительныеПараметрыЗапроса Цикл
			ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
	КонецЕсли;

	//Данные для вызова http-запроса
	ЗапросСервиса.Наименование = НСтр("ru = 'Получение идентификаторов коммерческих предложений ЭТП Бидзаар'");
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = "/api/connector/v" + ВерсияAPIБидзаар() + "/procedures/" + ПараметрыЗапроса.ИдентификаторЗапросаКП + "/proposals-ids";
	ЗапросСервиса.Метод = "GET";
	ЗапросСервиса.Аутентификация = Истина;

	//Заполнение заголовков http-запроса
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Bidzaar-Connector-User-Email", СокрЛП(ПараметрыЗапроса.UserEmail));
	Заголовки.Вставить("Authorization", "Bearer " + ПараметрыЗапроса.ТокенДоступа);

	ЗапросСервиса.Заголовки = Заголовки;

	Возврат ЗапросСервиса;
	
КонецФункции

Функция ЗапросСервисаПолучениеДанныхКоммерческихПредложенийБидзаар(ПараметрыЗапроса)
	
	ЗапросСервиса = НовыйЗапросСервиса();

	//Трансляция дополнительных параметров запроса в описание запроса
	ДополнительныеПараметрыЗапроса = Новый Структура;
	Если ПараметрыЗапроса.Свойство("ДополнительныеПараметры", ДополнительныеПараметрыЗапроса) Тогда
		Для Каждого ДополнительныйПараметр Из ДополнительныеПараметрыЗапроса Цикл
			ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
	КонецЕсли;

	//Данные для вызова http-запроса
	ЗапросСервиса.Наименование = НСтр("ru = 'Получение данных коммерческих предложений ЭТП Бидзаар'");
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = СтрШаблон("/api/connector/v" + ВерсияAPIБидзаар() + "/procedures/%1/proposals",ПараметрыЗапроса.ИдентификаторЗапросаКП);
	ЗапросСервиса.Метод = "GET";
	ЗапросСервиса.Аутентификация = Истина;

	//Переменные http-запроса
	Если ПараметрыЗапроса["ИдентификаторыКП"].Количество() > 0 Тогда
		ЗапросСервиса.Адрес = ЗапросСервиса.Адрес + "?ids=" + СтрСоединить(ПараметрыЗапроса["ИдентификаторыКП"],"&ids=");
	КонецЕсли;

	//Заполнение заголовков http-запроса
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Bidzaar-Connector-User-Email", СокрЛП(ПараметрыЗапроса.UserEmail));
	Заголовки.Вставить("Authorization", "Bearer " + ПараметрыЗапроса.ТокенДоступа);

	ЗапросСервиса.Заголовки = Заголовки;

	Возврат ЗапросСервиса;
КонецФункции

// Запрос сервиса получение данных участников.
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//   * UserEmail - Строка - зарегистрированный в Бидзаар Email пользователя
//   * ТокенДоступа - строка - актуальный токен доступа
//   * Сервер - строка - адрес сервера
//   * ИдентификаторЗапросаКП - строка - идентификатор процедуры
//   * ДополнительныеПараметры - структура - значения вспомогательных параметров
// 
// Возвращаемое значение:
//  Структура - см. НовыйЗапросСервиса
Функция ЗапросСервисаПолучениеДанныхУчастниковПоЗапросуБидзаар(ПараметрыЗапроса)

	ЗапросСервиса = НовыйЗапросСервиса();

	//Трансляция дополнительных параметров запроса в описание запроса
	ДополнительныеПараметры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса,
		"ДополнительныеПараметры", Новый Структура); // Структура
	Для Каждого ДополнительныйПараметр Из ДополнительныеПараметры Цикл
		ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
	КонецЦикла;

	Если Не ДополнительныеПараметры.Свойство("РазделУчета") Тогда
		ДополнительныеПараметры.Вставить("РазделУчета", ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели());
	КонецЕсли;

	//Данные для вызова http-запроса
	ЗапросСервиса.Наименование = НСтр("ru = 'Получение идентификаторв коммерческих предложений ЭТП Бидзаар'");
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = "/api/connector/v" + ВерсияAPIБидзаар() + "/procedures/" + ПараметрыЗапроса.ИдентификаторЗапросаКП + "/participants";
	ЗапросСервиса.Метод = "GET";
	ЗапросСервиса.Аутентификация = Истина;

	//Заполнение заголовков http-запроса
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Bidzaar-Connector-User-Email", СокрЛП(ПараметрыЗапроса.UserEmail));
	Заголовки.Вставить("Authorization", "Bearer " + ПараметрыЗапроса.ТокенДоступа);

	ЗапросСервиса.Заголовки = Заголовки;

	Возврат ЗапросСервиса;

КонецФункции

// Запрос сервиса получения ключевых слов
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//   * UserEmail - Строка - зарегистрированный в Бидзаар Email пользователя
//   * ТокенДоступа - строка - актуальный токен доступа
//   * Сервер - строка - адрес сервера
//   * СтрокаПоиска - строка - строка поиска для фильтрации ключевых слов. Если не указана, возвращаются все ключевые слова
//   * МинимальноеКоличествоИспользованийТега - число - Минимальное количество использований тега для включения в результат
//   * НомерСтраницы - число - номер страницы для постраничной выборки (отсчет с нуля)
//   * КоличествоКлючевыхСловНаСтранице - число - количество ключевых слов на одной странице
//   * ДополнительныеПараметры - структура - значения вспомогательных параметров
// 
// Возвращаемое значение:
//  Структура - см. НовыйЗапросСервиса()
//
Функция ЗапросСервисаКлючевыеСловаБидзаар(ПараметрыЗапроса)

	ЗапросСервиса = НовыйЗапросСервиса();

	//Трансляция дополнительных параметров запроса в описание запроса
	ДополнительныеПараметры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса,
		"ДополнительныеПараметры", Новый Структура); // Структура
	Для Каждого ДополнительныйПараметр Из ДополнительныеПараметры Цикл
		ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
	КонецЦикла;
	
	//Данные для вызова http-запроса
	ЗапросСервиса.Наименование = НСтр("ru = 'Получение ключевых слов Бидзаар'");
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = "/api/connector/v" + ВерсияAPIБидзаар() + "/tags";
	
	СтрокаПоиска = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса,"СтрокаПоиска"); // Строка
	МинимальноеКоличествоИспользованийТега = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса,
		"МинимальноеКоличествоИспользованийТега"); // Число
	НомерСтраницы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса,"НомерСтраницы"); // Число
	КоличествоКлючевыхСловНаСтранице = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, 
		"КоличествоКлючевыхСловНаСтранице"); // Число
	
	МассивПараметров = Новый Массив; // Массив из строка
	Если СтрокаПоиска <> Неопределено Тогда
		МассивПараметров.Добавить("searchCriteria=" + КодироватьСтроку(СтрокаПоиска,
			 СпособКодированияСтроки.КодировкаURL));		
	КонецЕсли;
	Если МинимальноеКоличествоИспользованийТега <> Неопределено Тогда
		МассивПараметров.Добавить("usageCount=" + Формат(МинимальноеКоличествоИспользованийТега, "ЧН=0; ЧГ=;"));		
	КонецЕсли;
	Если НомерСтраницы <> Неопределено Тогда
		МассивПараметров.Добавить("page=" + Формат(НомерСтраницы,"ЧН=0; ЧГ=;"));		
	КонецЕсли;
	Если КоличествоКлючевыхСловНаСтранице <> Неопределено Тогда
		МассивПараметров.Добавить("size=" + Формат(КоличествоКлючевыхСловНаСтранице,"ЧН=0; ЧГ=;"));		
	КонецЕсли;
	
	Если МассивПараметров.Количество() Тогда
		ЗапросСервиса.Адрес = ЗапросСервиса.Адрес + "?" + СтрСоединить(МассивПараметров, "&");
	КонецЕсли;
	
	ЗапросСервиса.Метод = "GET";
	ЗапросСервиса.Аутентификация = Истина;
	
	//Заполнение заголовков http-запроса
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Bidzaar-Connector-User-Email", СокрЛП(ПараметрыЗапроса.UserEmail));
	Заголовки.Вставить("Authorization", "Bearer " + ПараметрыЗапроса.ТокенДоступа);

	ЗапросСервиса.Заголовки = Заголовки;

	Возврат ЗапросСервиса;

КонецФункции

// Запрос подбора ключевых слов для документа
// 
// Параметры:
//  ПараметрыЗапроса - структура - Параметры запроса. Содержит свойства:
//   * UserEmail - Строка - зарегистрированный в Бидзаар Email пользователя
//   * ТокенДоступа - строка - актуальный токен доступа
//   * Сервер - строка - адрес сервера
//   * ИдентификаторПроцедуры - строка - идентификатор процедуры
//   * ДополнительныеПараметры - структура - значения вспомогательных параметров
// 
// Возвращаемое значение:
//  Структура - см. НовыйЗапросСервиса()
//
Функция ЗапросСервисаПодбораКлючевыхСловБидзаар(ПараметрыЗапроса)

	ЗапросСервиса = НовыйЗапросСервиса();

	//Трансляция дополнительных параметров запроса в описание запроса
	ДополнительныеПараметры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса,
		"ДополнительныеПараметры", Новый Структура); // Структура
	Для Каждого ДополнительныйПараметр Из ДополнительныеПараметры Цикл
		ЗапросСервиса.ДополнительныеПараметры.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
	КонецЦикла;
	
	//Данные для вызова http-запроса
	ЗапросСервиса.Наименование = НСтр("ru = 'Подбор ключевых слов Бидзаар'");
	ЗапросСервиса.Сервер = ПараметрыЗапроса.Сервер;
	ЗапросСервиса.Адрес = СтрШаблон("/api/connector/v%1/tags/%2/predict-and-apply",
		ВерсияAPIБидзаар(),
		ПараметрыЗапроса.ИдентификаторПроцедуры);
	ЗапросСервиса.Метод = "POST";
	ЗапросСервиса.Аутентификация = Истина;
	
	//Заполнение заголовков http-запроса
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Bidzaar-Connector-User-Email", СокрЛП(ПараметрыЗапроса.UserEmail));
	Заголовки.Вставить("Authorization", "Bearer " + ПараметрыЗапроса.ТокенДоступа);

	ЗапросСервиса.Заголовки = Заголовки;

	Возврат ЗапросСервиса;

КонецФункции

// Возвращает текущую версию API сервиса "Бидзаар"
//
// Возвращаемое значение:
//  Строка - версия API
//
Функция ВерсияAPIБидзаар()
	Возврат "5.4";
КонецФункции

#КонецОбласти

#Область ОбработкаРезультатовЗапросовКСервису

// Обработатка данных, выгруженных на ЭТП Бидзаар
// 
// Параметры:
//  ОбработкаРезультата - ТаблицаЗначений, Массив из Структура - Обработка результата
// 
// Возвращаемое значение:
//  Число - количество опубликованных позиций
//
Функция ОбработатьРезультатЗапросаПубликацияТоваровИУслугБидзаар(ОбработкаРезультата)

	КоличествоОпубликованныхПозиций = 0;

	ДанныеДляИзменения = ОбработкаРезультата;

	ДатаВыгрузки = ТекущаяДатаСеанса();

	УстановитьПривилегированныйРежим(Истина);

	НачатьТранзакцию();

	Попытка

		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.СтатусыПубликацииТоваровЭТП");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировкиДанных.ИсточникДанных = ДанныеДляИзменения;
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("УчетнаяЗапись", "УчетнаяЗапись");
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
		БлокировкаДанных.Заблокировать();

		Для Каждого СтрокаДанных Из ДанныеДляИзменения Цикл
			Запись = РегистрыСведений.СтатусыПубликацииТоваровЭТП.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаДанных);
			Запись.ДатаВыгрузки = ДатаВыгрузки;
			Запись.Статус = Перечисления.СтатусыОбъектовЭТП.Выгружено;
			Запись.Записать();
			КоличествоОпубликованныхПозиций = КоличествоОпубликованныхПозиций + 1;
		КонецЦикла;

		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();

		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики),
			УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

	КонецПопытки;

	УстановитьПривилегированныйРежим(Ложь);

	Возврат КоличествоОпубликованныхПозиций;

КонецФункции

Процедура ИзменитьСостояниеПланаПубликации(ПланПубликации, РезультатПубликации, Параметры)
	
	СобытиеЖР = СобытиеЖурналаРегистрации(Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели);

	Если РезультатПубликации.ТекстОшибки = "" Тогда

		ПланПубликации.ИдентификаторСервиса   = РезультатПубликации.Идентификатор;
		ПланПубликации.КлючИдемпотентности    = "";
		ПланПубликации.ПредставлениеОшибки    = "";
		ПланПубликации.СостояниеСинхронизации = Перечисления.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Выполнена;
		
		Попытка
			ПланПубликации.Записать();
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецПопытки;

		РезультатПубликации.СостояниеДокумента.СостояниеСинхронизации = Перечисления.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Выполнена;

		ОбработчикиСобытийПереопределяемые = КоммерческиеПредложенияСлужебныйПовтИсп.ЗапросКоммерческихПредложенийОбработчикиСобытийПереопределяемые(
		Параметры.ЗапросКоммерческихПредложений);

		Если ОбработчикиСобытийПереопределяемые.ПослеВыполненияСинхронизации Тогда
			СостояниеДокумента = Новый Структура;
			СостояниеДокумента.Вставить("Документ", Параметры.ЗапросКоммерческихПредложений);
			СостояниеДокумента.Вставить("СостояниеСинхронизации",
				Перечисления.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Выполнена);

			ПолноеИмя = Параметры.ЗапросКоммерческихПредложений.Метаданные().ПолноеИмя();
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
			МенеджерОбъекта.ПослеВыполненияСинхронизации(СостояниеДокумента);
		КонецЕсли;

	Иначе
		ПланПубликации.СостояниеСинхронизации = Перечисления.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Ошибка;
		
		// Ошибка могла произойти при получении данных сервера и email
		// В таком случае они будут отсутствовать
		Если Параметры.Свойство("Сервер") И Параметры.Свойство("UserEmail") Тогда
			ПредставлениеОшибки = СтрШаблон("%1; %2; %3", Параметры.Сервер, Параметры.UserEmail, РезультатПубликации.ТекстОшибки);
		Иначе
			ПредставлениеОшибки = РезультатПубликации.ТекстОшибки;	
		КонецЕсли;
		
		ПланПубликации.ПредставлениеОшибки    = ПредставлениеОшибки;
		
		Попытка
			ПланПубликации.Записать();
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецПопытки;

		РезультатПубликации.СостояниеДокумента.СостояниеСинхронизации = Перечисления.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Ошибка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Права

// Проверяет наличие прав для работы с сервисом электронной торговой площадки
//
// Параметры:
//  ВыводитьСообщение - Булево - признак необходимости вывода сообщения о недостаточности прав.
// 
// Возвращаемое значение:
//  Булево - наличие права.
//
Функция ПравоРаботыССервисомБидзаар(ВыводитьСообщение = Ложь)

	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;

	ЕстьПраво = ПравоДоступа("Использование", Метаданные.Обработки.УправлениеВыгрузкамиВБидзаар);

	Возврат ЕстьПраво;

КонецФункции

#КонецОбласти

// Проверяет строку на допустимость использования в качестве метода HTTP согласно разделу 4 RFC 7231.
// Параметры:
//  Метод	 - Строка - Переданный метод HTTP.
// 
// Возвращаемое значение:
//  Булево - Признак допустимости метода HTTP.
//
Функция МетодHTTPДопустим(Метод)

	Методы = Новый Структура("DELETE, GET, POST, PUT");
	Возврат Методы.Свойство(ВРег(Метод)) <> Неопределено;

КонецФункции

Процедура ДобавитьПараметрАдресаHTML(Адрес, Имя, Знач Значение) Экспорт
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		//@skip-check invocation-parameter-type-intersect
		Значение = Формат(Значение, "ЧГ=");
	КонецЕсли;
	
	Адрес = Адрес + ?(СтрНайти(Адрес, "?") = 0, "?", "&") + Имя + "=" + Значение;
	
КонецПроцедуры

// Проверка актуальности токена 
// 
// Параметры:
//  КлючДоступа - Структура, Неопределено - Ключ доступа. Содержит свойства:
//  * СрокДействияТокенаДоступа - Дата - Дата-время окончания действия токена доступа
// 
// Возвращаемое значение:
//  Булево - Истина - срок токена доступа актуален
Функция СрокТокенаДоступаАктуален(КлючДоступа)
	
	Если Не ЗначениеЗаполнено(КлючДоступа) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если КлючДоступа.СрокДействияТокенаДоступа = '00010101' Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Результат = КлючДоступа.СрокДействияТокенаДоступа > ТекущаяДатаСеанса();
	
	Возврат Результат;
	
КонецФункции

// формирует план публикации запроса коммерческих предложений и переводит состояние документа в статус "Выполняется"
// 
// Параметры:
//  ЗапросКП - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - публикуемый документ
//  Организация - СправочникСсылка.Организации - организация публикуемого документа
// 
// Возвращаемое значение:
//  СправочникОбъект.ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений - План публикации запроса коммерческих предложений бидзаар
Функция ПланПубликацииЗапросаКоммерческихПредложенийБидзаар(ЗапросКП, Организация, ДействиеСинхронизации)
	
	// Определение текущего плана синхронизации.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.Ссылка КАК Ссылка,
	|	ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.СпособСинхронизации КАК СпособСинхронизации,
	|	ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.ДействиеСинхронизации КАК ДействиеСинхронизации,
	|	ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.ДокументВладелец.Дата КАК Дата,
	|	ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.ДокументВладелец.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.СостояниеСинхронизации = ЗНАЧЕНИЕ(Перечисление.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Требуется)
	|			ТОГДА 1
	|		КОГДА ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.СостояниеСинхронизации = ЗНАЧЕНИЕ(Перечисление.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Ошибка)
	|			ТОГДА 2
	|		КОГДА ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.СостояниеСинхронизации = ЗНАЧЕНИЕ(Перечисление.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Выполнена)
	|			ТОГДА 3
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК Порядок
	|ПОМЕСТИТЬ ПланСинхронизации
	|ИЗ
	|	Справочник.ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений КАК ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений
	|ГДЕ
	|	ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.ДокументВладелец = &ДокументВладелец
	|	И ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.СпособСинхронизации = ЗНАЧЕНИЕ(Перечисление.СпособыСинхронизацииЗапросовКоммерческихПредложений.Сервис)
	|	И (ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.ДействиеСинхронизации = ЗНАЧЕНИЕ(Перечисление.ДействияСинхронизацииЗапросовКоммерческихПредложений.Удалить)
	|	И ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.СостояниеСинхронизации = ЗНАЧЕНИЕ(Перечисление.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Выполнена)) = ЛОЖЬ
	|	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПланСинхронизации.Ссылка КАК Ссылка,
	|	ПланСинхронизации.СпособСинхронизации КАК СпособСинхронизации,
	|	ПланСинхронизации.ДействиеСинхронизации КАК ДействиеСинхронизации,
	|	ПланСинхронизации.Дата КАК Дата,
	|	ПланСинхронизации.Номер КАК Номер
	|ИЗ
	|	ПланСинхронизации КАК ПланСинхронизации
	|ГДЕ
	|	ПланСинхронизации.Порядок <> 99
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПланСинхронизации.Порядок";

	Запрос.УстановитьПараметр("ДокументВладелец", ЗапросКП);

	СобытиеЖР = СобытиеЖурналаРегистрации(Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели);

	СостояниеЗапросаКП = РегистрыСведений.СостоянияЗапросовКоммерческихПредложений.ТекущееСостояние(ЗапросКП);
	СостояниеЗапросаКП.Действие = НСтр("ru = 'Публикация запроса'");

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда

		ПланПубликации = Справочники.ОснованияЭлектронныхДокументовПоЗапросамКоммерческихПредложений.СоздатьЭлемент();
		ПланПубликации.ДокументВладелец = ЗапросКП;
		ПланПубликации.СпособСинхронизации = Перечисления.СпособыСинхронизацииЗапросовКоммерческихПредложений.Сервис;
		ПланПубликации.КлючИдемпотентности = Строка(Новый УникальныйИдентификатор);
		ПланПубликации.Организация = Организация;
		ПланПубликации.ДействиеСинхронизации = ДействиеСинхронизации;
		ПланПубликации.СостояниеСинхронизации = Перечисления.СостоянияСинхронизацииЗапросовКоммерческихПредложений.Выполняется;

		НачатьТранзакцию();
		Попытка
			ПланПубликации.Записать();
			РегистрыСведений.СостоянияЗапросовКоммерческихПредложений.ЗаписатьСтатус(ЗапросКП, СостояниеЗапросаКП,
				ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.ИмяСервисаБидзаар());
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			ПланПубликации = Неопределено;
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

			ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецПопытки;

	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		ПланПубликации = Выборка.Ссылка.ПолучитьОбъект();
		ПланПубликации.ДействиеСинхронизации = ДействиеСинхронизации;
		
		Попытка
			РегистрыСведений.СостоянияЗапросовКоммерческихПредложений.ЗаписатьСтатус(ЗапросКП, СостояниеЗапросаКП,
				ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.ИмяСервисаБидзаар());
		Исключение
			ПланПубликации = Неопределено;
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

			ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецПопытки;
		
	КонецЕсли;

	Возврат ПланПубликации;

КонецФункции

// Текст ошибки по коду ответа.
// 
// Параметры:
//  Результат - Структура, Число, Неопределено - Код или результат http-запроса
//  * ТекстОтвета - Строка - Текст ответа
// 
// Возвращаемое значение:
//  Строка - текстовое описание ошибки
Функция ТекстОшибкиПоКодуОтвета(Результат = Неопределено, ПараметрыЗапроса = Неопределено)
	
	ТекстОшибки = "";
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		КодОтвета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "КодСостояния"); // Число
		ТекстОтвета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ТекстОтвета", ""); // Строка
		Если Не ПустаяСтрока(ТекстОтвета) И КодОтвета <> 200 Тогда
			Попытка
				// В некоторых случаях сервис может вернуть произвольный ответ,
				// при попытке преобразования может происходить ошибка.
				ДанныеОтвета = ОбщегоНазначения.JSONВЗначение(ТекстОтвета);
			Исключение
				ДанныеОтвета = Неопределено;
			КонецПопытки;
			МассивОшибок = Новый Массив; // Массив из Строка
			Если ТипЗнч(ДанныеОтвета) = Тип("Соответствие") Тогда
				ОбработатьОшибкиСервиса(МассивОшибок, ДанныеОтвета);
				ДобавитьОшибкуПоДаннымСообщенияСервиса(МассивОшибок, ДанныеОтвета);
			КонецЕсли;
			Если МассивОшибок.Количество() > 0 Тогда
				Возврат СтрСоединить(МассивОшибок, Символы.ПС);
			КонецЕсли;
		КонецЕсли;
	Иначе
		КодОтвета = Результат;
		ТекстОтвета = "";
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыЗапроса) = Тип("Структура") Тогда
		ДополнительныеПараметры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса,
			"ДополнительныеПараметры", Новый Структура); // Структура
		РазделУчета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "РазделУчета", "");
	КонецЕсли;
	
	Если КодОтвета = 200 Тогда
		ТекстОшибки = "OK";
	ИначеЕсли КодОтвета = 301 Тогда
		ТекстОшибки = "Moved Permanently";
	ИначеЕсли КодОтвета = 400 Тогда
		ТекстОшибки = НСтр("ru = 'Проверьте корректность настроек подключения'");
	ИначеЕсли КодОтвета = 401 Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка авторизации, проверьте корректность настроек подключения'");
	ИначеЕсли КодОтвета = 403 Тогда
		ТекстОшибки = "Forbidden";
	ИначеЕсли КодОтвета = 404 Тогда
		ТекстОшибки = ?(ПустаяСтрока(ТекстОтвета), "Not Found", ТекстОтвета);
	ИначеЕсли КодОтвета = 409 Тогда
		ТекстОшибки = ?(ПустаяСтрока(ТекстОтвета), "Conflict", ТекстОтвета);
	ИначеЕсли КодОтвета = 500 Тогда
		ТекстОшибки = НСтр("ru = 'Внутренняя ошибка сервера'");
		Если РазделУчета = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.РазделУчетаПокупатели() Тогда
			ДополнительныйТекст = НСтр("ru = 'Возможно, указанный для менеджера email не зарегистрирован в сервисе'");
			ТекстОшибки = СтрШаблон("%1. %2", ТекстОшибки, ДополнительныйТекст);
		КонецЕсли;
	Иначе
		ТекстОшибки = НСтр("ru = 'Ответ сервиса не соотвествует формату'");
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

Процедура ОбработатьОшибкиСервиса(МассивОшибок, ДанныеОтвета)
	
	НаборОшибок = ДанныеОтвета.Получить("errors"); // Соответствие
	Если ТипЗнч(НаборОшибок) = Тип("Соответствие") Тогда
		Для каждого ТипОшибки Из НаборОшибок Цикл
			ТипОшибкиСтрокой = ТипОшибки.Ключ; // Строка
			Если ТипЗнч(ТипОшибки.Значение) = Тип("Массив") Тогда
				Для каждого Ошибка из ТипОшибки.Значение Цикл // Строка
					МассивОшибок.Добавить(ПредставлениеОшибкиСервиса(ТипОшибкиСтрокой, Ошибка));
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Ошибка = ДанныеОтвета.Получить("error"); // Строка
	Если ТипЗнч(Ошибка) = Тип("Строка") Тогда
		МассивОшибок.Добавить(ПредставлениеОшибкиСервиса("Ошибка", Ошибка));
	КонецЕсли;
		
КонецПроцедуры

// Представление ошибки сервиса
// 
// Параметры:
//  ТипОшибки - Строка
//  Ошибка - Строка
// 
// Возвращаемое значение:
//  Строка - текстовое представление ошибки
Функция ПредставлениеОшибкиСервиса(Знач ТипОшибки, Знач Ошибка)
	
	Если ТипОшибки = "Tags"
		И СтрНайти(Ошибка, "Tags already in stop list") > 0 Тогда
		
		ОшибочноеКлючевоеСлово = СокрЛП(СтрЗаменить(Ошибка,"Tags already in stop list",""));
		Ошибка = СтрШаблон(НСтр("ru = 'Ключевое слово %1 находится в списке запрещенных ключевых слов сервиса Бидзаар'"),
			ОшибочноеКлючевоеСлово);
				
	Иначе
		
		Ошибка = СтрШаблон("%1: %2", ТипОшибки, Ошибка);
	
	КонецЕсли;
	
	Возврат Ошибка;

КонецФункции

Процедура ДобавитьОшибкуПоДаннымСообщенияСервиса(МассивОшибок, ДанныеОтвета)
	
	СообщениеСервиса = ДанныеОтвета.Получить("message");
	КодСообщенияСервиса = ДанныеОтвета.Получить("code");
	УточнениеСообщенияСервиса = ДанныеОтвета.Получить("details");
	
	Если ЗначениеЗаполнено(СообщениеСервиса)
		И КодСообщенияСервиса = "Error.ConnectorCodeViolation"
		И ТипЗнч(УточнениеСообщенияСервиса) = Тип("Соответствие") Тогда
			
		Если УточнениеСообщенияСервиса.Получить("StatusFailResult") = """User""" Тогда
			ТекстОшибки = НСтр("ru = 'Указанный для менеджера email не зарегистрирован в сервисе'");
			МассивОшибок.Добавить(ТекстОшибки);
		Иначе
			ТекстНеидентифицированныхОшибок = УточнениеСообщенияСервиса.Получить("Errors");	// Строка
			Если СтрНайти(ТекстНеидентифицированныхОшибок, "QuestionnaireItemValidator") > 0 Тогда
				ТекстОшибки = НСтр("ru = 'Вопросы проведения опроса не прошли валидацию Бидзаар'");
				МассивОшибок.Добавить(ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Получить обновить данные авторизации и доступа бидзаар.
// 
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - учетная запись
//  МенеджерEmail - строка - email зарегистрированный на ЭТП
// 
// Возвращаемое значение:
//  Структура - Получить обновить данные авторизации и доступа Бидзаар:
// * client_id - Строка - 
// * client_secret - Строка - 
// * Сервер - Строка - 
// * ТокенДоступа - Строка - 
// * ТекстОшибки - Строка - 
Функция ПолучитьОбновитьДанныеАвторизацииИДоступаБидзаар(УчетнаяЗапись, МенеджерEmail)
	
	Результат = Новый Структура();
	Результат.Вставить("client_id", "");
	Результат.Вставить("client_secret", "");
	Результат.Вставить("Сервер", "");
	Результат.Вставить("ТокенДоступа", "");
	Результат.Вставить("ТекстОшибки", "");
	
	ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели;
	СобытиеЖР = СобытиеЖурналаРегистрации(ВидЭТП);
	
	РеквизитыУЗ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗапись, "Сервер");

	ДанныеАвторизаци = ДанныеАвторизации(ВидЭТП, УчетнаяЗапись); // Структура
	Результат.client_id = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАвторизаци, "client_id", ""); // Строка
	Результат.client_secret = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАвторизаци, "client_secret", ""); // Строка
	Результат.Сервер = ДанныеАвторизаци.Сервер;

	Если Не ЗначениеЗаполнено(Результат.client_id) Или Не ЗначениеЗаполнено(Результат.client_secret) Тогда
		ТекстОшибки = СтрШаблон(НСтр(
			"ru = 'Не удалось выгрузить данные, введите %1 и %2 в настройках подключения организации к Бидзаар'"),
			"client_id", "client_secret");

		Результат.ТекстОшибки = ТекстОшибки;

		Возврат Результат;

	КонецЕсли;
	
	ПараметрыПолученияКлюча = Новый Структура;
	ПараметрыПолученияКлюча.Вставить("ВидЭТП", ВидЭТП);
	ПараметрыПолученияКлюча.Вставить("УчетнаяЗапись", УчетнаяЗапись);
	ПараметрыПолученияКлюча.Вставить("Сервер", РеквизитыУЗ.Сервер);
	
	РезультатПолученияКлючаДоступа = ПолучитьОбновитьКлючДоступа(ПараметрыПолученияКлюча, Ложь);
	Если РезультатПолученияКлючаДоступа.ТекстОшибки <> "" Тогда

		Результат.ТекстОшибки = РезультатПолученияКлючаДоступа.ТекстОшибки;

		ЗаписьЖурналаРегистрации(СобытиеЖР, УровеньЖурналаРегистрации.Ошибка, , , РезультатПолученияКлючаДоступа.ТекстОшибки);
	Иначе
		Результат.ТокенДоступа = РезультатПолученияКлючаДоступа.КлючДоступа.ТокенДоступа;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Данные авторизации из ЗКП.
// 
// Параметры:
//  ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - Запрос коммерческих предложений
// 
// Возвращаемое значение:
//  Структура - Данные авторизации из ЗКП:
// * УчетнаяЗапись - Неопределено, СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - 
// * Организация - Неопределено, СправочникСсылка.Организации - 
// * Сервер - Строка - 
// * МенеджерEmail - Строка - 
// * ИдентификаторВСервисе - Строка - 
Функция ДанныеАвторизацииИзЗКП(ЗапросКоммерческихПредложений)
	
	Результат = Новый Структура;
	Результат.Вставить("УчетнаяЗапись", Неопределено);
	Результат.Вставить("Организация", Неопределено);
	Результат.Вставить("Сервер", "");
	Результат.Вставить("МенеджерEmail", "");
	Результат.Вставить("ИдентификаторВСервисе", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапросКоммерческихПредложенийПоставщиков.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ЗапросКоммерческихПредложенийПоставщиков.УчетнаяЗапись.Сервер КАК Сервер,
	|	ЗапросКоммерческихПредложенийПоставщиков.Организация КАК Организация,
	|	ЗапросКоммерческихПредложенийПоставщиков.МенеджерEmail КАК МенеджерEmail,
	|	ЗапросКоммерческихПредложенийПоставщиков.ИдентификаторВСервисе КАК ИдентификаторВСервисе
	|ИЗ
	|	Документ.ЗапросКоммерческихПредложенийПоставщиков КАК ЗапросКоммерческихПредложенийПоставщиков
	|ГДЕ
	|	ЗапросКоммерческихПредложенийПоставщиков.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗапросКоммерческихПредложений);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокПриглашаемыхУчастников(Параметры)

	Результат = Новый Массив;
	
	ЗапросОписанияУчастников = Новый Запрос;
	ЗапросОписанияУчастников.Текст =
	"ВЫБРАТЬ
	|	ПриглашаемыеУчастники.Контрагент КАК Контрагент,
	|	ПриглашаемыеУчастники.Контрагент.ИНН КАК ИНН,
	|	ПриглашаемыеУчастники.Контрагент.НаименованиеПолное КАК Наименование
	|ИЗ
	|	Документ.ЗапросКоммерческихПредложенийПоставщиков.СписокПолучателейЗапроса КАК ПриглашаемыеУчастники
	|ГДЕ
	|	ПриглашаемыеУчастники.Ссылка = &Ссылка";
	
	ЗапросОписанияУчастников.УстановитьПараметр("Ссылка", Параметры.ЗапросКоммерческихПредложений);
	
	РезультатЗапросаОписанияУчастников = ЗапросОписанияУчастников.Выполнить();
	
	Если РезультатЗапросаОписанияУчастников.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
		
	Выборка = РезультатЗапросаОписанияУчастников.Выбрать();
	Пока Выборка.Следующий() Цикл
			
		ОтборКИ = УправлениеКонтактнойИнформацией.ОтборКонтактнойИнформации();
		ОтборКИ.ТипыКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		ОтборКИ.Дата = Дата(1, 1, 1);
		КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформация(Выборка.Контрагент, ОтборКИ);

		СтрокаКИ = КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, "Тип");
		Если СтрокаКИ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеУчастника = Новый Структура;

		ОписаниеУчастника.Вставить("ИНН", Выборка.ИНН);
		ОписаниеУчастника.Вставить("email", СтрокаКИ.Представление);
		ОписаниеУчастника.Вставить("Наименование", Выборка.Наименование);
	
		Результат.Добавить(ОписаниеУчастника);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Регистрирует идентификаторы файлов, полученные от сервиса электронной торговой площадки, в информационной базе. 
// Выполняет сопоставление локальных файлов с файлами сервиса по имени и расширению.
//
// Параметры:
//   ОписанияФайлов - Массив из Структура - 
//   ОписанияФайловСервиса - Массив из см. НовыйОписаниеОпубликованногоФайлаБидзаар 
//
// Возвращаемое значение:
//   Массив из см. НовыйОписаниеОпубликованногоФайлаБидзаар
Функция ЗарегистрироватьИдентификаторыФайловВСервисе(ОписанияФайлов, ОписанияФайловСервиса)
	
	Результат = Новый Массив; // Массив из Структура
	
	Для Каждого ОписаниеФайла Из ОписанияФайлов Цикл
		Если ПустаяСтрока(ОписаниеФайла.ИдентификаторВСервисе) Тогда
			Для Каждого ОписаниеФайлаСервиса Из ОписанияФайловСервиса Цикл // Структура
				Если ОписаниеФайла.Имя = ОписаниеФайлаСервиса.name И ОписаниеФайла.Расширение = ОписаниеФайлаСервиса.extension Тогда
					
					НачатьТранзакцию();
					Попытка
						
						БлокировкаДанных = Новый БлокировкаДанных;
						ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы");
						ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ОписаниеФайла.Ссылка);
						ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
						
						БлокировкаДанных.Заблокировать();
							
						Результат.Добавить(ОписаниеФайлаСервиса);
						ФайлОбъект = ОписаниеФайла.Ссылка.ПолучитьОбъект(); // СправочникОбъект.ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы
						ФайлОбъект.ИдентификаторВСервисе = ОписаниеФайлаСервиса.id;
						ФайлОбъект.ДополнительныеСвойства.Вставить("РегистрацияОтветаИзСервиса", Истина);
						ФайлОбъект.Записать();
						ЗафиксироватьТранзакцию();
					Исключение
						ОтменитьТранзакцию();
						ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели),
							УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					КонецПопытки;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ОписаниеФайлаСервиса = НовыйОписаниеОпубликованногоФайлаБидзаар();
			ОписаниеФайлаСервиса.id = ОписаниеФайла.ИдентификаторВСервисе;
			ОписаниеФайлаСервиса.name = ОписаниеФайла.Имя;
			ОписаниеФайлаСервиса.extension = ОписаниеФайла.Расширение;
			ОписаниеФайлаСервиса.length = ОписаниеФайла.Размер;
			Если ОписаниеФайла.ПометкаУдаления Тогда
				ОписаниеФайлаСервиса.deletedDate = ТекущаяДатаСеанса();
			КонецЕсли;
			Результат.Добавить(ОписаниеФайлаСервиса);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

// Возвращает таблицу данных валют из общероссийского классификатора валют (ОКВ).
//
// Возвращаемое значение:
//  ТаблицаЗначений - имеет колонки:
//   * КодВалютыЦифровой  - Строка - Цифровой код валюты.
//   * КодВалютыБуквенный - Строка - Буквенный код валюты.
//   * Наименование       - Строка - Полное наименование валюты.
//
Функция ДанныеКлассификатораВалют()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеКлассификатора = Новый ТаблицаЗначений;
	ДанныеКлассификатора.Колонки.Добавить("КодВалютыЦифровой");
	ДанныеКлассификатора.Колонки.Добавить("КодВалютыБуквенный");
	ДанныеКлассификатора.Колонки.Добавить("Наименование");
	
	КлассификаторXML = Обработки.ЗагрузкаКурсовВалют.ПолучитьМакет("ОбщероссийскийКлассификаторВалют").ПолучитьТекст(); 
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	Для Каждого ЗаписьОКВ Из КлассификаторТаблица Цикл
		НоваяСтрока = ДанныеКлассификатора.Добавить();
		НоваяСтрока.КодВалютыЦифровой         = ЗаписьОКВ.Code;
		НоваяСтрока.КодВалютыБуквенный        = ЗаписьОКВ.CodeSymbol;
		НоваяСтрока.Наименование              = ЗаписьОКВ.Name;
	КонецЦикла;
	
	Возврат ДанныеКлассификатора;

КонецФункции

// Возвращает массив буквенных кодов валют, которые поддерживаются в сервисе "Бидзаар".
//
// Возвращаемое значение:
//  Массив из Строка 
//
Функция ПоддерживаемыеВалютыБидзаар()
	МассивПоддерживаемыхВалют = Новый Массив; //Массив из строка
	МассивПоддерживаемыхВалют.Добавить("RUB");
	МассивПоддерживаемыхВалют.Добавить("EUR");
	МассивПоддерживаемыхВалют.Добавить("USD");
	МассивПоддерживаемыхВалют.Добавить("BYN");
	МассивПоддерживаемыхВалют.Добавить("AMD");
	МассивПоддерживаемыхВалют.Добавить("AUD");
	МассивПоддерживаемыхВалют.Добавить("AZN");
	МассивПоддерживаемыхВалют.Добавить("BGN");
	МассивПоддерживаемыхВалют.Добавить("BRL");
	МассивПоддерживаемыхВалют.Добавить("CAD");
	МассивПоддерживаемыхВалют.Добавить("CHF");
	МассивПоддерживаемыхВалют.Добавить("CNY");
	МассивПоддерживаемыхВалют.Добавить("CZK");
	МассивПоддерживаемыхВалют.Добавить("DKK");
	МассивПоддерживаемыхВалют.Добавить("GBP");
	МассивПоддерживаемыхВалют.Добавить("HKD");
	МассивПоддерживаемыхВалют.Добавить("HUF");
	МассивПоддерживаемыхВалют.Добавить("INR");
	МассивПоддерживаемыхВалют.Добавить("JPY");
	МассивПоддерживаемыхВалют.Добавить("KGS");
	МассивПоддерживаемыхВалют.Добавить("KRW");
	МассивПоддерживаемыхВалют.Добавить("KZT");
	МассивПоддерживаемыхВалют.Добавить("MDL");
	МассивПоддерживаемыхВалют.Добавить("NOK");
	МассивПоддерживаемыхВалют.Добавить("PLN");
	МассивПоддерживаемыхВалют.Добавить("RON");
	МассивПоддерживаемыхВалют.Добавить("SEK");
	МассивПоддерживаемыхВалют.Добавить("SGD");
	МассивПоддерживаемыхВалют.Добавить("TJS");
	МассивПоддерживаемыхВалют.Добавить("TMT");
	МассивПоддерживаемыхВалют.Добавить("TRY");
	МассивПоддерживаемыхВалют.Добавить("UAH");
	МассивПоддерживаемыхВалют.Добавить("UZS");
	МассивПоддерживаемыхВалют.Добавить("XDR");
	МассивПоддерживаемыхВалют.Добавить("ZAR");
	
	Возврат МассивПоддерживаемыхВалют;	
КонецФункции

// Возвращает буквенный код валюты для использования в сервисе Бидзаар
//
// Параметры:
//  НаименованиеВалюты - Строка - буквенный код валюты
//  КодВалюты        - Строка - цифровой код валюты
//
// Возвращаемое значение:
//  Строка - буквенный код валюты для сервиса Бидзаар
//
Функция НаименованиеВалютыБидзаар(НаименованиеВалюты, КодВалюты)
	
	//Проверка валидности буквенного кода валюты в сервисе Бидзаар
	Если Не ПроверитьБуквенныйКодВалютыБидзаар(НаименованиеВалюты) Тогда
		//Получение буквенного кода валюты из классификатора по цифровому коду
		ДанныеВалютыПоКлассификатору = ДанныеВалютыПоКлассификатору(КодВалюты);
		Если ДанныеВалютыПоКлассификатору <> Неопределено Тогда
			Возврат ДанныеВалютыПоКлассификатору.КодВалютыБуквенный;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НаименованиеВалюты;
	
КонецФункции

// Подготавливает значение адреса для выгрузки на маркетплейс Бидзаар.
//
// Параметры:
//   Адрес - Строка - исходное значение адреса
//   ОграничениеПоДлине - Число - максимальная длина возвращаемого адреса (0 - без ограничения)
//
// Возвращаемое значение:
//   - Строка - подготовленный адрес
//   - Неопределено - если передана пустая строка
Функция ОбработатьЗначениеАдресаДляВыгрузкиБидзаар(Знач Адрес, Знач ОграничениеПоДлине = 0)
	
	// Если передать пустую строку, то сервис выдает ошибку. В таком случае нужно передавать null в сервис
	Если ПустаяСтрока(Адрес) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ОграничениеПоДлине <> 0 Тогда
		Адрес = Сред(Адрес, 1, ОграничениеПоДлине);	
	КонецЕсли;
	
	Возврат Адрес;
	
КонецФункции

#КонецОбласти