&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроверкаПройдена = Истина;
	
	Параметры.Свойство("НастройкаКонвертации", НастройкаКонвертации); 
	Параметры.Свойство("СписокРеквизитов", СписокРеквизитов);
	Параметры.Свойство("СписокРевизитовМетодаЗаполнить", СписокРевизитовМетодаЗаполнить);
	Параметры.Свойство("СписокРевизитовУказать", СписокРевизитовУказать);
	Параметры.Свойство("ТипДокументаЛогистика", ТипДокументаЛогистика);
	
	Если Параметры.Свойство("ТипДокумента1С") Тогда
		
		ТипДокумента1С = Параметры.ТипДокумента1С;
		
		Для каждого Стр Из СписокРеквизитов Цикл
			Элементы.Реквизит.СписокВыбора.Добавить(Стр.Значение, Стр.Значение);	
		КонецЦикла;
			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	УправлениеЭлементамиФормы();
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		Элементы.Реквизит.КнопкаСпискаВыбора = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Если Не ЗначениеЗаполнено(ТипАлгоритма) Тогда
		Сообщить("Тип алгоритма не заполнен");
		Возврат;
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(Реквизит) И ТипАлгоритма <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_АлгоритмыЗаполнения.ВыполнитьОбработчик") Тогда
		Сообщить("Реквизит не заполнен");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СпособРасчета) Тогда
		Сообщить("Способ расчета не заполнен");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВыражениеВычисления) 
		И Не ЗначениеЗаполнено(ВыражениеВычисленияСтрокаНеогр) 
		И (СпособРасчета <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист.НеЗаполнять") 
			И СпособРасчета <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист.Очистить")) Тогда
		Сообщить("Выражение вычисления не заполнен");
		Возврат;
	КонецЕсли;
	
	Если Не ПроверкаПройдена Тогда
		Сообщить("Проверка не пройдена");
		Возврат;
	КонецЕсли;
	
	ЗаполненныеДанные = Новый Структура;
	ЗаполненныеДанные.Вставить("ТипАлгоритма", ТипАлгоритма);
	ЗаполненныеДанные.Вставить("Реквизит", Реквизит);     
	ЗаполненныеДанные.Вставить("РеквизитТипЗначения", РеквизитТипЗначения);
	ЗаполненныеДанные.Вставить("СпособРасчета", СпособРасчета);
	ЗаполненныеДанные.Вставить("ВыражениеВычисления", ВыражениеВычисления); 
	ЗаполненныеДанные.Вставить("ВыражениеВычисленияУИД", ВыражениеВычисленияУИД);	
	ЗаполненныеДанные.Вставить("ВыражениеВычисленияТипЗначения", ВыражениеВычисленияТипЗначения);
	ЗаполненныеДанные.Вставить("ВыражениеВычисленияСтрокаНеогр", ВыражениеВычисленияСтрокаНеогр);
	
	ОповеститьОВыборе(ЗаполненныеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ГруппаПредупреждение.Видимость = Не ПроверкаПройдена;
	
	Если ТипАлгоритма = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_АлгоритмыЗаполнения.ВыполнитьОбработчик") Тогда
		Элементы.Реквизит.Доступность = Ложь;
		Реквизит = "";
		СпособРасчета = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист.ПроизвольныйКод");
		Элементы.СпособРасчета.Доступность = Ложь;
	Иначе
		Элементы.Реквизит.Доступность = Истина;
		Элементы.СпособРасчета.Доступность = Истина;
	КонецЕсли;
	
	Элементы.СпособРасчета.Доступность = ЗначениеЗаполнено(Реквизит) И ТипАлгоритма <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_АлгоритмыЗаполнения.ВыполнитьОбработчик");
	Элементы.ВыражениеВычисленияОбщее.Доступность = ЗначениеЗаполнено(Реквизит) Или ТипАлгоритма = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_АлгоритмыЗаполнения.ВыполнитьОбработчик");
	
КонецПроцедуры

&НаСервере
Процедура Проверить()
	
	ТекстПредупреждения = "";
	
	Если ЗначениеЗаполнено(Реквизит) И ЗначениеЗаполнено(ТипАлгоритма) Тогда
			
		Если ТипАлгоритма = Перечисления.КонтурЛогистика_АлгоритмыЗаполнения.МетодЗаполнить 
			 И СписокРевизитовМетодаЗаполнить.НайтиПоЗначению(Реквизит) <> Неопределено Тогда
			ТекстПредупреждения = ТекстПредупреждения + "В методе заполнить уже есть такой реквизит";
			ПроверкаПройдена = Ложь;
		ИначеЕсли ТипАлгоритма = Перечисления.КонтурЛогистика_АлгоритмыЗаполнения.УказатьРеквизит 
			 И СписокРевизитовУказать.НайтиПоЗначению(Реквизит) <> Неопределено Тогда
			ТекстПредупреждения = ТекстПредупреждения + "В указать уже есть такой реквизит";
			ПроверкаПройдена = Ложь;	
		КонецЕсли;			
				
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Реквизит) И Метаданные.Документы.Найти(ТипДокумента1С).Реквизиты.Найти(Реквизит) = Неопределено Тогда
		ТекстПредупреждения = ТекстПредупреждения + "В документе нет такого реквизита";
		ПроверкаПройдена = Ложь;	
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстПредупреждения) Тогда
		Элементы.ТексПредупреждения.Заголовок = "";
		ПроверкаПройдена = Истина;
	Иначе	
		Элементы.ТексПредупреждения.Заголовок = ТекстПредупреждения;
		ПроверкаПройдена = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьТипРеквизита()
	
	Если Метаданные.Документы.Найти(ТипДокумента1С).Реквизиты.Найти(Реквизит) <> Неопределено Тогда
		РеквизитТипЗначения = Метаданные.Документы.Найти(ТипДокумента1С).Реквизиты[Реквизит].Тип;
	КонецЕсли;
					
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПриИзменении(Элемент)
	
	Проверить();
	
	ОпределитьТипРеквизита();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеВычисленияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПродолжитьВыбор(Элемент);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработчикДокУчСист(ЗаполненныеДанные = Неопределено, ИмяЭлемента = Неопределено) Экспорт

	Если ЗначениеЗаполнено(ЗаполненныеДанные) Тогда
		
		СпособРасчета = ЗаполненныеДанные.СпособРасчета;
		ВыражениеВычисления = ЗаполненныеДанные.ВыражениеВычисления; 
		ВыражениеВычисленияУИД = ЗаполненныеДанные.ВыражениеВычисленияУИД;	
		ВыражениеВычисленияТипЗначения = ЗаполненныеДанные.ВыражениеВычисленияТипЗначения;
		ВыражениеВычисленияСтрокаНеогр = ЗаполненныеДанные.ВыражениеВычисленияСтрокаНеогр;
		
		Если СпособРасчета = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист.ПроизвольныйКод") Тогда
			ВыражениеВычисленияОбщее = ВыражениеВычисленияСтрокаНеогр;
		Иначе
			ВыражениеВычисленияОбщее = ВыражениеВычисления;	
		КонецЕсли;		
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипАлгоритмаПриИзменении(Элемент)
	
	Проверить();
	
	УправлениеЭлементамиФормы();
			
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеВычисленияОбщееНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Реквизит) И ТипАлгоритма <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_АлгоритмыЗаполнения.ВыполнитьОбработчик") Тогда
		Сообщить("Реквизит не заполнен");
		Возврат;
	КонецЕсли;
	
	ПродолжитьВыбор(Элемент);
	 
КонецПроцедуры
	
&НаКлиенте
Процедура ПродолжитьВыбор(Элемент)
	
	ПараметрыФормыНастройки = Новый Структура;
	ПараметрыФормыНастройки.Вставить("Таблица", "ЗаполнениеДокУчСис");
	ПараметрыФормыНастройки.Вставить("ИмяТЧ", "");
	ПараметрыФормыНастройки.Вставить("ИмяТЧИсходногоДокумента", "");
	ПараметрыФормыНастройки.Вставить("ТипАлгоритма", ТипАлгоритма);
	ПараметрыФормыНастройки.Вставить("ТипДокумента1С", ТипДокумента1С);
	ПараметрыФормыНастройки.Вставить("ТипДокументаЛогистика", ТипДокументаЛогистика);
	ПараметрыФормыНастройки.Вставить("СпособМаппинга", СпособРасчета);
	ПараметрыФормыНастройки.Вставить("Реквизит", Реквизит);
	ПараметрыФормыНастройки.Вставить("ТипЗначения", РеквизитТипЗначения);
	ПараметрыФормыНастройки.Вставить("ВыбранныйТипЗначения", ВыражениеВычисленияТипЗначения);
	ПараметрыФормыНастройки.Вставить("ВыражениеВычисленияУИД", ВыражениеВычисленияУИД);   
	ПараметрыФормыНастройки.Вставить("ВыражениеВычисления", ВыражениеВычисления);
	ПараметрыФормыНастройки.Вставить("НастройкаКонвертации", НастройкаКонвертации);
	ПараметрыФормыНастройки.Вставить("ВыражениеВычисленияСтрокаНеогр", ВыражениеВычисленияСтрокаНеогр);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_НастойкиКонвертацииОбратныйМаппинг_Помощник",
		ПараметрыФормыНастройки,
		ЭтаФорма,
		ЭтаФорма,
		"ОбработчикДокУчСист");
	
КонецПроцедуры
	
