
&После("ОбработкаПроведения")
Процедура АУ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.АУ_ПланФактБюджета.Записывать = Истина;
	
	СтатьиБюджета=ЭтотОбъект.АУ_СтатьиБюджета;
	
	Для Каждого ТекСтрокаСтатьиБюджета Из СтатьиБюджета Цикл
		
		Если ЗначениеЗаполнено(ТекСтрокаСтатьиБюджета.ДатаБюджета) Тогда
			ДатаБюджета=ТекСтрокаСтатьиБюджета.ДатаБюджета;
		ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.АУ_ДатаБюджета) Тогда
			ДатаБюджета=ЭтотОбъект.АУ_ДатаБюджета;
		ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ДатаПроведенияБанком) Тогда
			ДатаБюджета=ЭтотОбъект.ДатаПроведенияБанком;
		Иначе
			ДатаБюджета=ЭтотОбъект.Дата;
		КонецЕсли;
		
		Движение = Движения.АУ_ПланФактБюджета.Добавить();
		Движение.Период = НачалоМесяца(ДатаБюджета);
		Движение.Организация = ЭтотОбъект.Организация;
		Движение.СтатьяБюджета = ТекСтрокаСтатьиБюджета.СтатьяБюджета;
		
		Если ТекСтрокаСтатьиБюджета.СтатьяБюджета.Валютная Тогда
			
			Если ЭтотОбъект.АУ_ФактическийКурсВалюты<>0 Тогда
				Движение.СуммаФакт = ТекСтрокаСтатьиБюджета.Сумма*ЭтотОбъект.АУ_ФактическийКурсВалюты;
			ИначеЕсли ЭтотОбъект.УсловиеСделкиКонвертации=0 И ЭтотОбъект.КурсКонвертации<>0 Тогда
				Движение.СуммаФакт = -ТекСтрокаСтатьиБюджета.Сумма*ЭтотОбъект.КурсКонвертации;
			Иначе
				Движение.СуммаФакт = РаботаСКурсамиВалют.ПересчитатьВВалюту(-ТекСтрокаСтатьиБюджета.Сумма,ЭтотОбъект.Валюта,Константы.ВалютаРегламентированногоУчета.Получить(),?(ЗначениеЗаполнено(ЭтотОбъект.ДатаПроведенияБанком),ЭтотОбъект.ДатаПроведенияБанком,ЭтотОбъект.Дата));
			КонецЕсли;
			
		Иначе
			Движение.СуммаФакт=-ТекСтрокаСтатьиБюджета.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура АУ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.АУ_СтатьиБюджета.Количество()=0 И ЗначениеЗаполнено(ЭтотОбъект.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
		ЭтотОбъект.АУ_СтатьиБюджета.Загрузить(ЭтотОбъект.ЗаявкаНаРасходованиеДенежныхСредств.АУ_СтатьиБюджета.Выгрузить());
	КонецЕсли;
	
	МассивКодов=Новый Массив;
	КодыСтатей=ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ЭтотОбъект.АУ_СтатьиБюджета.ВыгрузитьКолонку("СтатьяБюджета"),"Код");
	Для каждого стрКод Из КодыСтатей Цикл
		Если ЗначениеЗаполнено(стрКод.Значение) Тогда
			МассивКодов.Добавить(стрКод.Значение);
		КонецЕсли;
	КонецЦикла;
	ЭтотОбъект.АУ_КодыСтатейБюджета=СтрСоединить(МассивКодов,", ");
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура АУ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
		
		Для каждого стрАналитика Из ЭтотОбъект.ЗаявкаНаРасходованиеДенежныхСредств.АУ_СтатьиБюджета Цикл
			
			НоваяСтрока = ЭтотОбъект.АУ_СтатьиБюджета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, стрАналитика);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
