#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет сообщение в очередь.
//
// Параметры:
//   ДвоичныеДанныеСообщения - ДвоичныеДанные - данные сообщения.
//   КонтрольОтправкиФайлов - см. ИнтеграцияС1СДокументооборотБазоваяФункциональность.КонтрольОтправкиФайлов
//   РеквизитыСообщения - см. РегистрыСведений.ОчередьСообщенийВ1СДокументооборот.РеквизитыСообщения
//
Процедура ДобавитьСообщение(ДвоичныеДанныеСообщения, КонтрольОтправкиФайлов, РеквизитыСообщения = Неопределено) Экспорт
	
	Если РеквизитыСообщения = Неопределено Тогда
		РеквизитыСообщения = РеквизитыСообщения();
	КонецЕсли;
	
	Менеджер = СоздатьМенеджерЗаписи();
	
	Менеджер.МоментВремени = РеквизитыСообщения.МоментВремени;
	Менеджер.Идентификатор = РеквизитыСообщения.Идентификатор;
	Менеджер.Данные = Новый ХранилищеЗначения(ДвоичныеДанныеСообщения, Новый СжатиеДанных(9));
	Менеджер.КонтрольОтправкиФайлов = Новый ХранилищеЗначения(КонтрольОтправкиФайлов);
	Менеджер.ДатаСоздания = ТекущаяДатаСеанса();
	Менеджер.КоличествоПопытокОтправки = РеквизитыСообщения.КоличествоПопытокОтправки;
	Менеджер.ТекстСообщенияОбОшибке = РеквизитыСообщения.ТекстСообщенияОбОшибке;
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры

// Конструктор структуры реквизитов сообщения.
//
// Возвращаемое значение:
//   Структура:
//     * МоментВремени - Число - текущая универсальная дата в миллисекундах.
//     * Идентификатор - УникальныйИдентификатор - идентификатор сообщения.
//     * КоличествоПопытокОтправки - Число - количество попыток отправки сообщения.
//     * ТекстСообщенияОбОшибке - Строка - текст сообщения об ошибке отправки сообщения.
//
Функция РеквизитыСообщения() Экспорт
	
	РеквизитыСообщения = Новый Структура;
	РеквизитыСообщения.Вставить("МоментВремени", ТекущаяУниверсальнаяДатаВМиллисекундах());
	РеквизитыСообщения.Вставить("Идентификатор", Новый УникальныйИдентификатор);
	РеквизитыСообщения.Вставить("КоличествоПопытокОтправки", 0);
	РеквизитыСообщения.Вставить("ТекстСообщенияОбОшибке", "");
	
	Возврат РеквизитыСообщения;
	
КонецФункции

#КонецОбласти

#КонецЕсли