
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	КодФормы = "Справочник_ХарактеристикиНоменклатуры_ФормаВыбора";
	
	Номенклатура          = Неопределено;
	ВладелецХарактеристик = Неопределено;
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		
		// Перенесем "стандартный" отбор по владельцу в свойство ПараметрВладелец
		Параметры.ПараметрВладелец = Параметры.Отбор.Владелец;
		Параметры.Отбор.Удалить("Владелец");
		
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрВладелец", ВладелецХарактеристик)
		И ЗначениеЗаполнено(ВладелецХарактеристик) Тогда
		
		МобильноеРабочееМестоКладовщика.УстановитьОтборПоВладельцуХарактеристик(ЭтаФорма);
		
	ИначеЕсли Параметры.Свойство("Номенклатура", Номенклатура) И ЗначениеЗаполнено(Номенклатура) Тогда
		
		Если МобильноеРабочееМестоКладовщика.ПроверитьИспользованиеХарактеристикИПолучитьВладельцаДляВыбора(Номенклатура, ВладелецХарактеристик) Тогда
			
			Если ВладелецХарактеристик = Неопределено Тогда
				
				ТекстИсключения = НСтр("ru = 'Для данной номенклатуры характеристики не заданы.'");
				ВызватьИсключение ТекстИсключения;
				
			Иначе
				
				МобильноеРабочееМестоКладовщика.УстановитьОтборПоВладельцуХарактеристик(ЭтаФорма);
				
			КонецЕсли;
			
		Иначе
			
			ТекстИсключения = НСтр("ru = 'Для данной номенклатуры отключено использование характеристик.'");
			ВызватьИсключение ТекстИсключения;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ВладелецХарактеристик) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
		
		ВидНоменклатуры = ВладелецХарактеристик;
		
	ИначеЕсли ТипЗнч(ВладелецХарактеристик) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		ВидНоменклатуры = МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(ВладелецХарактеристик, "ВидНоменклатуры");
		
	КонецЕсли;
	
	УстановитьОтборПоТипуНоменклатурыПоПараметрам();
	
	Если ЗначениеЗаполнено(Параметры.ВариантыРасчетаЦеныНабора) Тогда
		МобильноеРабочееМестоКладовщика.УстановитьПараметрДинамическогоСписка(Список, "ВариантыРасчетаЦеныНабора", Параметры.ВариантыРасчетаЦеныНабора, Истина);
		МобильноеРабочееМестоКладовщика.УстановитьПараметрДинамическогоСписка(Список, "Номенклатура", Номенклатура, Истина);
	КонецЕсли;
	
	ЕстьДоступныеОтборы                      = ДеревоОтборов.ПолучитьЭлементы().Количество() > 0;
	Элементы.ГруппаДеревоОтборов.Видимость   = ЕстьДоступныеОтборы;
	ИспользоватьФильтры                      = ЕстьДоступныеОтборы;
	
#Если НЕ МобильныйАвтономныйСервер Тогда
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// СтандартныеПодсистемы.БазоваяФункциональность
	МультиязычностьСервер.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ХарактеристикиНоменклатуры" И ЗначениеЗаполнено(Источник) Тогда
		
		Элементы.Список.ТекущаяСтрока = Источник;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоТипуНоменклатурыПоПараметрам()
	
	Номенклатура = Параметры.Номенклатура;
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	ТипНоменклатурыНабор = Перечисления.ТипыНоменклатуры.Набор; 
	Если НЕ МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(Номенклатура, "ТипНоменклатуры") = ТипНоменклатурыНабор Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеОтбора = Неопределено;
	Если НЕ Параметры.Отбор.Свойство("ТипНоменклатуры", ЗначениеОтбора) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеОтбора.Найти(ТипНоменклатурыНабор) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОграничиватьНаборыПоУслугам = ЗначениеОтбора.Найти(Перечисления.ТипыНоменклатуры.Услуга) <> Неопределено
		Или ЗначениеОтбора.Найти(Перечисления.ТипыНоменклатуры.Работа) <> Неопределено;
	ОграничиватьНаборыПоТоварам = ЗначениеОтбора.Найти(Перечисления.ТипыНоменклатуры.МногооборотнаяТара) <> Неопределено
		Или ЗначениеОтбора.НайтиПоЗначению(Перечисления.ТипыНоменклатуры.Товар) <> Неопределено;
		
	Если ОграничиватьНаборыПоУслугам = ОграничиватьНаборыПоТоварам Тогда
		Возврат;
	КонецЕсли;
	
	МобильноеРабочееМестоКладовщика.УстановитьПараметрДинамическогоСписка(Список, "Номенклатура", Номенклатура, Истина);
	
	МобильноеРабочееМестоКладовщикаКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"СодержитУслуги",
		ОграничиватьНаборыПоУслугам,
		ВидСравненияКомпоновкиДанных.Равно,,
		Истина);
		
	МобильноеРабочееМестоКладовщикаКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"СодержитТовары",
		ОграничиватьНаборыПоТоварам,
		ВидСравненияКомпоновкиДанных.Равно,,
		Истина);
		
КонецПроцедуры

#КонецОбласти
