#Область ПрограммныйИнтерфейс

#Область ПроцедурыИФункцииВыбораДокументаРасчетов

// Заполнение данных выбора объекта расчетов.
//  
// Параметры:
//		ДанныеВыбора - СписокЗначений из СправочникСсылка.ОбъектыРасчетов - Заполняемые данные выбора.
//		СтруктураОтбора - см. ВзаиморасчетыКлиентСервер.СтруктураОтбораДанныхВыбора
//		ВводПоСтроке - Булево - Признак того, что происходит ввод по строке.
//		ЭтоУИП - Булево - Уиникальный идентификатор платежа
//
Процедура ЗаполнитьДанныеВыбораОбъектаРасчетов(ДанныеВыбора, СтруктураОтбора, ВводПоСтроке = Истина, ЭтоУИП = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	УсловияЗапроса = Новый Массив;
	УсловияЗапроса.Добавить("ИСТИНА");
	УсловияЗапроса.Добавить("НЕ ОбъектыРасчетов.Служебный"); // @query-part
	
	Запрос.Текст = ТекстЗапросаВременныхТаблицДанныхВыбора();
	Запрос.УстановитьПараметр("УчитыватьФилиалы", СтруктураОтбора.УчитыватьФилиалы);
		
	Запрос.УстановитьПараметр("Организация", СтруктураОтбора.Организация);
	УсловияЗапроса.Добавить(
		"(ОбъектыРасчетов.Организация = &Организация
		|ИЛИ 
		|	НЕ &Организация В (ВЫБРАТЬ Т.ГоловнаяОрганизация ИЗ ВтГоловнаяОрганизация КАК Т)
		| 	И ОбъектыРасчетов.Договор В 
		|		(ВЫБРАТЬ 
		|			ВтЦентрализованныеДоговоры.Ссылка 
		|		ИЗ ВтЦентрализованныеДоговоры)
		|	И (ОбъектыРасчетов.Организация В (ВЫБРАТЬ Т.ГоловнаяОрганизация ИЗ ВтГоловнаяОрганизация КАК Т)
		|		ИЛИ ЕСТЬNULL(Договоры.РазрешаетсяПередачаОплатМеждуФилиалами, ЛОЖЬ))
		|ИЛИ 
		|	&Организация В (ВЫБРАТЬ Т.ГоловнаяОрганизация ИЗ ВтГоловнаяОрганизация КАК Т)
		|	И ОбъектыРасчетов.Организация.ГоловнаяОрганизация = &Организация
		|	И ОбъектыРасчетов.Организация.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию)");
	
	Если СтруктураОтбора.ВводОстатков Тогда
		
		Если СтруктураОтбора.ХозяйственнаяОперацияВводаОстатков = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПремийКлиентам") Тогда
			
			УсловияЗапроса.Добавить("(ВЫРАЗИТЬ(ОбъектыРасчетов.Объект КАК Документ.ПервичныйДокумент).ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.АктПремииКлиенту))");
			
		ИначеЕсли СтруктураОтбора.ХозяйственнаяОперацияВводаОстатков = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВводОстатковПремийПоставщиков") Тогда
			
			УсловияЗапроса.Добавить("(ВЫРАЗИТЬ(ОбъектыРасчетов.Объект КАК Документ.ПервичныйДокумент).ТипПервичногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.АктПремииПоставщика))");
			
		Иначе
			
			Запрос.УстановитьПараметр("ВыборАванса", СтруктураОтбора.ВыборАванса);
			УсловияЗапроса.Добавить("((ОбъектыРасчетов.ТипОбъектаРасчетов <> ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
				|		ИЛИ ОбъектыРасчетов.Объект ССЫЛКА Документ.ПервичныйДокумент
				|			И ВЫРАЗИТЬ(ОбъектыРасчетов.Объект КАК Документ.ПервичныйДокумент).ТипПервичногоДокумента <> ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.АктПремииКлиенту)
				|			И ВЫРАЗИТЬ(ОбъектыРасчетов.Объект КАК Документ.ПервичныйДокумент).ТипПервичногоДокумента <> ЗНАЧЕНИЕ(Перечисление.ТипыПервичныхДокументов.АктПремииПоставщика)
				|			И НЕ &ВыборАванса)
				|	И (ОбъектыРасчетов.ТипОбъектаРасчетов <> ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.ПлатежВозврат)
				|		ИЛИ (ОбъектыРасчетов.Объект ССЫЛКА Документ.ПервичныйДокумент
				|			ИЛИ ОбъектыРасчетов.Объект ССЫЛКА Справочник.ПодарочныеСертификаты
				|			ИЛИ ОбъектыРасчетов.Объект ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента)
				|			И &ВыборАванса))");
			
		КонецЕсли;
		
	Иначе
		УсловияЗапроса.Добавить("
			|(НЕ ОбъектыРасчетов.Объект ССЫЛКА Справочник.ПодарочныеСертификаты)");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураОтбора.ТипРасчетов) Тогда
		УсловияЗапроса.Добавить("ОбъектыРасчетов.ТипРасчетов = &ТипРасчетов");
		Запрос.УстановитьПараметр("ТипРасчетов", СтруктураОтбора.ТипРасчетов);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураОтбора.Контрагент) Тогда
		Если СтруктураОтбора.ВводОстатков Тогда
			УсловияЗапроса.Добавить("(ОбъектыРасчетов.Контрагент В (&Контрагент)
				|	ИЛИ ОбъектыРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Договор)
				|	И ЕСТЬNULL(Договоры.ДоговорСКомиссионером.ВестиРасчетыЧерезКонечныхПокупателей, ЛОЖЬ)
				|	И Договоры.Контрагент В(&Контрагент))");
			УсловияЗапроса.Добавить("НЕ (ОбъектыРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Договор)
				|	И ЕСТЬNULL(Договоры.ДоговорСКомиссионером.ВестиРасчетыЧерезКонечныхПокупателей, ЛОЖЬ)
				|	И Договоры.КомиссионерКонтрагент В(&Контрагент))");
		Иначе
			УсловияЗапроса.Добавить("ОбъектыРасчетов.Контрагент = &Контрагент");
		КонецЕсли;
		Запрос.УстановитьПараметр("Контрагент", СтруктураОтбора.Контрагент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураОтбора.Текст) Тогда
		Если ВводПоСтроке Тогда
			Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтруктураОтбора.Текст + "%");
			Если ЭтоУИП Тогда
				УсловияЗапроса.Добавить("ОбъектыРасчетов.ИдентификаторПлатежа ПОДОБНО &СтрокаПоиска");
			Иначе
				УсловияЗапроса.Добавить("ОбъектыРасчетов.Номер ПОДОБНО &СтрокаПоиска");
			КонецЕсли;
		Иначе
			Запрос.УстановитьПараметр("СтрокаПоиска", СтруктураОтбора.Текст);
			Если ЭтоУИП Тогда
				УсловияЗапроса.Добавить("ОбъектыРасчетов.ИдентификаторПлатежа В (&СтрокаПоиска)");
			Иначе
				УсловияЗапроса.Добавить("ОбъектыРасчетов.Номер В (&СтрокаПоиска)");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ТекстЗапросаВыбораОбъектаРасчетов(ВводПоСтроке);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДинамическиеУсловия", СтрСоединить(УсловияЗапроса, " И ")); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗначениеВыбора = СтруктураЗначениеВыбора();
		ЗаполнитьЗначенияСвойств(ЗначениеВыбора, Выборка);
		
		ДанныеВыбора.Добавить(
			Новый Структура("Значение, ПометкаУдаления", 
				ЗначениеВыбора, 
				Выборка.Состояние = 2 Или Выборка.ПометкаУдаления),
			Строка(Выборка.ОбъектРасчетов));
	КонецЦикла;
	
	Если ВводПоСтроке Тогда
		ДанныеВыбора.СортироватьПоПредставлению();
	КонецЕсли;
	
КонецПроцедуры

// Заполнение данных выбора основания платежа.
//
// Параметры:
//		ДанныеВыбора - СписокЗначений из ДокументСсылка - Заполняемые данные выбора.
//		СтруктураОтбора - см. ВзаиморасчетыКлиентСервер.СтруктураОтбораДанныхВыбора
//		ВводПоСтроке - Булево - Признак того, что происходит ввод по строке.
//		ЭтоУИП - Булево - Уиникальный идентификатор платежа
//
Процедура ЗаполнитьДанныеВыбораОснованияПлатежа(ДанныеВыбора, СтруктураОтбора, ВводПоСтроке = Истина, ЭтоУИП = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(СтруктураОтбора.Текст) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ИспользоватьДоговорыМеждуОрганизациями = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыМеждуОрганизациями");
	ЭтоРасчетыСКлиентом = СтруктураОтбора.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	
	Запрос.УстановитьПараметр("Организация", СтруктураОтбора.Организация);
	Запрос.УстановитьПараметр("УчитыватьФилиалы", СтруктураОтбора.УчитыватьФилиалы);
	
	СписокТиповДоговоров = ?(ЭтоРасчетыСКлиентом, 
	                         ВзаиморасчетыКлиентСервер.ТипыДоговоровСКлиентом(),
	                         ВзаиморасчетыКлиентСервер.ТипыДоговоровСПоставщиком());
	Запрос.УстановитьПараметр("ТипыДоговоров", СписокТиповДоговоров.ВыгрузитьЗначения());
	
	ТекстЗапросаВтМеждуОрганизациями = "";
	Если ЗначениеЗаполнено(СтруктураОтбора.Контрагент) Тогда
		Запрос.УстановитьПараметр("Контрагент", СтруктураОтбора.Контрагент);
		Если ИспользоватьДоговорыМеждуОрганизациями Тогда
			ТекстЗапросаВтМеждуОрганизациями = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Организации.Ссылка КАК Ссылка
				|ПОМЕСТИТЬ ВтОтборМеждуОрганизациями
				|ИЗ
				|	Справочник.Организации КАК Организации
				|ГДЕ
				|	Организации.Ссылка В (&Контрагент)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	Организации.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Организации КАК Организации
				|ГДЕ
				|	Организации.ГоловнаяОрганизация В (&Контрагент)
				|	И Организации.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию
				|;
				|";
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураОтбора.ТипыОснований.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ТипыОснований", СтруктураОтбора.ТипыОснований);
	КонецЕсли;
	
	Если ВводПоСтроке Тогда
		Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтруктураОтбора.Текст + "%");
	Иначе
		Запрос.УстановитьПараметр("СтрокаПоиска", СтруктураОтбора.Текст);
	КонецЕсли;
	
	ТекстЗапросаВыбораОснованияПлатежа = ТекстЗапросаВыбораОснованияПлатежаПоСтроке(ВводПоСтроке, СтруктураОтбора,
		ЭтоРасчетыСКлиентом, ЭтоУИП);
	
	Запрос.Текст = ТекстЗапросаВременныхТаблицДанныхВыбора() 
	               + ТекстЗапросаВтМеждуОрганизациями
	               + ТекстЗапросаВыбораОснованияПлатежа;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗначениеВыбора = СтруктураЗначениеВыбора();
		ЗаполнитьЗначенияСвойств(ЗначениеВыбора, Выборка);
		
		ДанныеВыбора.Добавить(
			Новый Структура("Значение, ПометкаУдаления", 
				ЗначениеВыбора, 
				Выборка.Состояние = 2),
			Строка(Выборка.ОснованиеПлатежа));
		
	КонецЦикла;
	
	Если ВводПоСтроке Тогда
		ДанныеВыбора.СортироватьПоПредставлению();
		Счетчик = ДанныеВыбора.Количество();
		Пока Счетчик > 10 Цикл
			Счетчик = Счетчик - 1;
			ДанныеВыбора.Удалить(Счетчик);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Заполнение данных выбора идентификатора платежа.
//
// Параметры:
//		ДанныеВыбора - СписокЗначений из СправочникСсылка.ОбъектыРасчетов - Заполняемые данные выбора.
//		СтруктураОтбора - см. ВзаиморасчетыКлиентСервер.СтруктураОтбораДанныхВыбора
//		ВводПоСтроке - Булево - Признак того, что происходит ввод по строке.
//
Процедура ЗаполнитьДанныеВыбораУИП(ДанныеВыбора, СтруктураОтбора, ВводПоСтроке = Истина) Экспорт
	
	ДанныеВыбораПоОбъектам = Новый СписокЗначений();
	ЗаполнитьДанныеВыбораОбъектаРасчетов(ДанныеВыбораПоОбъектам, СтруктураОтбора, ВводПоСтроке, Истина);
	НайденныеУИП = Новый Массив;
	
	Для Каждого ЭлементСписка Из ДанныеВыбораПоОбъектам Цикл
		Если НайденныеУИП.Найти(ЭлементСписка.Значение.Значение.ИдентификаторПлатежа) = Неопределено Тогда
			ДанныеВыбора.Добавить( 
				ЭлементСписка.Значение, 
				Строка(ЭлементСписка.Значение.Значение.ИдентификаторПлатежа) + " (" + Строка(ЭлементСписка.Значение.Значение.Контрагент)+ ")");
			НайденныеУИП.Добавить(ЭлементСписка.Значение.Значение.ИдентификаторПлатежа);
		КонецЕсли;
	КонецЦикла;
	
	ИскатьОснования = Ложь;
	Если ВводПоСтроке Тогда
		Если ДанныеВыбораПоОбъектам.Количество() < 10 Тогда
			ИскатьОснования = Истина;
		КонецЕсли;
	Иначе
		Если ТипЗнч(СтруктураОтбора.Текст) = Тип("Массив") Тогда
			Если НайденныеУИП.Количество() < СтруктураОтбора.Текст.Количество() Тогда
				ИскатьОснования = Истина;
			КонецЕсли;
		Иначе
			Если НайденныеУИП.Количество() = 0 Тогда
				ИскатьОснования = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИскатьОснования Тогда
		
		ДанныеВыбораПоОснованиям = Новый СписокЗначений();
		ЗаполнитьДанныеВыбораОснованияПлатежа(ДанныеВыбораПоОснованиям, СтруктураОтбора, ВводПоСтроке, Истина);
		
		Для Каждого ЭлементСписка Из ДанныеВыбораПоОснованиям Цикл
			Если НайденныеУИП.Найти(ЭлементСписка.Значение.Значение.ИдентификаторПлатежа) = Неопределено Тогда
				ДанныеВыбора.Добавить( 
					ЭлементСписка.Значение, 
					Строка(ЭлементСписка.Значение.Значение.ИдентификаторПлатежа) + " (" + Строка(ЭлементСписка.Значение.Значение.Контрагент)+ ")");
				НайденныеУИП.Добавить(ЭлементСписка.Значение.Значение.ИдентификаторПлатежа);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ВводПоСтроке Тогда
		ДанныеВыбора.СортироватьПоПредставлению();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииЗаполненияДокументов

// Устарела. Процедура заполнения табличной части "РасшифровкаПлатежа" по заказу клиента.
//
// Параметры:
//	ПараметрыЗаполнения - См. ВзаиморасчетыЗаполнениеРасшифровкиПлатежа.ПараметрыЗаполненияРасшифровкиПлатежаПоЗаказу.
//	РасшифровкаПлатежа - ТабличнаяЧасть, ТаблицаЗначений - Табличная часть документа, выгрузка колонок табличной части по документу.
//	СуммаКОплате - Число - Сумма к оплате, если известна.
//	Организация - СправочникСсылка.Организации - Организация, осуществляющая продажу.
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - вид операции платежного документа.
//
Процедура ЗаполнитьРасшифровкуПлатежаПоЗаказуКлиента(ПараметрыЗаполнения, РасшифровкаПлатежа, СуммаКОплате = 0, Организация = Неопределено, ХозяйственнаяОперация = Неопределено) Экспорт
	
	ВзаиморасчетыЗаполнениеРасшифровкиПлатежа.ЗаполнитьРасшифровкуПлатежаПоЗаказуКлиента(ПараметрыЗаполнения, РасшифровкаПлатежа, СуммаКОплате, Организация, ХозяйственнаяОперация)
	
КонецПроцедуры

// Устарела. Процедура заполнения табличной части "РасшифровкаПлатежа" по счету на оплату.
//
// Параметры:
//	СчетНаОплату - ДокументСсылка.СчетНаОплатуКлиенту - Документ - основание.
//	Организация - СправочникСсылка.Организации - Документ - основание.
//	ЗаказКлиента - ДокументСсылка.ЗаказКлиента - Заказ.
//	ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа поступления денежных средств.
//	РасшифровкаПлатежа - ТабличнаяЧасть - Табличная часть документа.
//
Процедура ЗаполнитьРасшифровкуПлатежаПоСчетуНаОплату(СчетНаОплату, Организация, ЗаказКлиента, ВалютаДокумента, РасшифровкаПлатежа) Экспорт
	
	ВзаиморасчетыЗаполнениеРасшифровкиПлатежа.ЗаполнитьРасшифровкуПлатежаПоСчетуНаОплату(СчетНаОплату, Организация, ЗаказКлиента, ВалютаДокумента, РасшифровкаПлатежа)
	
КонецПроцедуры

// Устарела. Процедура заполнения табличной части "РасшифровкаПлатежа" по возврату товаров от клиента.
//
// Параметры:
//	Объекты - ДокументСсылка, Массив из ДокументСсылка - Документ основание.
//	Организация - СправочникСсылка.Организации - Организация документа.
//	ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа поступления денежных средств.
//	СуммаДокумента - Число - Сумма документа - основания.
//	Партнер - СправочникСсылка.Партнеры - Партнер документа - основания.
//	РасшифровкаПлатежа - ТабличнаяЧасть - Табличная часть документа.
//
Процедура ЗаполнитьРасшифровкуПлатежаПоВозвратуТоваровОтКлиента(Объекты, Организация, ВалютаДокумента, СуммаДокумента, Партнер, РасшифровкаПлатежа) Экспорт
	
	ВзаиморасчетыЗаполнениеРасшифровкиПлатежа.ЗаполнитьРасшифровкуПлатежаПоВозвратуТоваровОтКлиента(Объекты, Организация, ВалютаДокумента, СуммаДокумента, Партнер, РасшифровкаПлатежа)
	
КонецПроцедуры

// Устарела. Процедура заполнения табличной части "РасшифровкаПлатежа" по заказу поставщику.
//
// Параметры:
//	ЗаказПоставщику - ДокументСсылка.ЗаказПоставщику - Документ - основание.
//	Договор - СправочникСсылка.ДоговорыКонтрагентов - Договор для заполнения.
//	ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа поступления денежных средств.
//	СуммаКОплате - Число - Сумма к оплате поставщику.
//	РасшифровкаПлатежа - ТабличнаяЧасть - Табличная часть документа.
//	ЖелательнаяДатаПлатежа - Дата - Дата платежа по графику.
//  Организация - СправочникСсылка.Организации - Организация, осуществляющая закупку.
//
Процедура ЗаполнитьРасшифровкуПлатежаПоЗаказуПоставщику(ЗаказПоставщику, Договор, ВалютаДокумента, Знач СуммаКОплате, РасшифровкаПлатежа, ЖелательнаяДатаПлатежа = Неопределено, Организация = Неопределено) Экспорт
	
	ВзаиморасчетыЗаполнениеРасшифровкиПлатежа.ЗаполнитьРасшифровкуПлатежаПоЗаказуПоставщику(ЗаказПоставщику, Договор, ВалютаДокумента, СуммаКОплате, РасшифровкаПлатежа, ЖелательнаяДатаПлатежа, Организация)
	
КонецПроцедуры

// Устарела. Процедура заполнения табличной части "РасшифровкаПлатежа" по возврату поставщику.
//
// Параметры:
//	Объекты - ДокументСсылка, Массив из ДокументСсылка - Документ основание.
//	Организация - СправочникСсылка.Организации - Организация документа.
//	ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа поступления денежных средств.
//	СуммаДокумента - Число - Сумма документа - основания.
//	Партнер - СправочникСсылка.Партнеры - Партнер документа - основания.
//	РасшифровкаПлатежа - ТабличнаяЧасть - Табличная часть документа.
//
Процедура ЗаполнитьРасшифровкуПлатежаПоВозвратуПоставщику(Объекты, Организация, ВалютаДокумента, СуммаДокумента, Партнер, РасшифровкаПлатежа) Экспорт
	
	ВзаиморасчетыЗаполнениеРасшифровкиПлатежа.ЗаполнитьРасшифровкуПлатежаПоВозвратуПоставщику(Объекты, Организация, ВалютаДокумента, СуммаДокумента, Партнер, РасшифровкаПлатежа)
	
КонецПроцедуры

// Устарела. Процедура заполнения табличной части "РасшифровкаПлатежа" по договору.
//
// Параметры:
//		Договор - СправочникСсылка.ДоговорыКонтрагентов - Договор для получения остатков.
//		ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
//		РасшифровкаПлатежа - ТаблицаЗначений - Таблица для заполнения.
//		Организация - СправочникСсылка.Организации - Необязательное, организация для получения остатков расчетов.
//
Процедура ЗаполнитьРасшифровкуПлатежаПоДоговоруСПоставщиком(Договор, ВалютаДокумента, РасшифровкаПлатежа, Организация) Экспорт
	
	ВзаиморасчетыЗаполнениеРасшифровкиПлатежа.ЗаполнитьРасшифровкуПлатежаПоДоговоруСПоставщиком(Договор, ВалютаДокумента, РасшифровкаПлатежа, Организация)
	
КонецПроцедуры

// Процедура получает результат запроса по остаткам расчетов с партнером.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация документа.
//	Контрагент - СправочникСсылка.Контрагенты - Контрагент, выбранный в документе.
//	ТипЗадолженности - ПеречислениеСсылка.ТипыЗадолженности - Тип задолженности.
//	ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами - Тип расчетов.
//	Дата - Дата - Дата документа.
//	Валюта - СправочникСсылка.Валюты - Валюта документа.
//	Задолженность - ТаблицаЗначений - Расшифровка платежа документа.
//
Процедура ЗаполнитьЗадолженностьПоОстаткам(Организация, Контрагент, ТипЗадолженности, ТипРасчетов, Дата, Валюта, Задолженность) Экспорт
	
	ТекстРасчетыСКлиентами = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
	|	РегистрАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	РасчетыСКлиентамиОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиОстатки.ОбъектРасчетов.Организация КАК Организация,
	|	РасчетыСКлиентамиОстатки.ОбъектРасчетов.Дата КАК Дата,
	|	РасчетыСКлиентамиОстатки.ОбъектРасчетов.Номер КАК Номер,
	|	РасчетыСКлиентамиОстатки.Валюта КАК ВалютаВзаиморасчетов,
	|	
	|	
	|	ВЫБОР КОГДА РасчетыСКлиентамиОстатки.СуммаОстаток < 0 ТОГДА
	|		-РасчетыСКлиентамиОстатки.СуммаОстаток
	|	ИНАЧЕ
	|		РасчетыСКлиентамиОстатки.СуммаОстаток
	|	КОНЕЦ КАК СуммаВзаиморасчетов,
	|	0 КАК Сумма
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(&Граница,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				РегистрАналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам
	|			ИЗ
	|				РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|			ГДЕ
	|				РегистрАналитикаУчетаПоПартнерам.Организация = &Организация
	|				И РегистрАналитикаУчетаПоПартнерам.Контрагент = &Контрагент
	|			)
	|		) КАК РасчетыСКлиентамиОстатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|	ПО 
	|		РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
	|
	|ГДЕ
	|	ВЫБОР КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
	|		И РасчетыСКлиентамиОстатки.СуммаОстаток >= 0
	|	ТОГДА
	|		ИСТИНА
	|	КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		И РасчетыСКлиентамиОстатки.СуммаОстаток <= 0
	|	ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ";
	
	ТекстРасчетыСПоставщиками = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
	|	РегистрАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов.Организация КАК Организация,
	|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов.Дата КАК Дата,
	|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов.Номер КАК Номер,
	|	РасчетыСПоставщикамиОстатки.Валюта КАК ВалютаВзаиморасчетов,
	|	
	|	
	|	ВЫБОР КОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток < 0 ТОГДА
	|		-РасчетыСПоставщикамиОстатки.СуммаОстаток
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиОстатки.СуммаОстаток
	|	КОНЕЦ КАК СуммаВзаиморасчетов,
	|	0 КАК Сумма
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(&Граница,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				РегистрАналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам
	|			ИЗ
	|				РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|			ГДЕ
	|				РегистрАналитикаУчетаПоПартнерам.Организация = &Организация
	|				И РегистрАналитикаУчетаПоПартнерам.Контрагент = &Контрагент
	|			)
	|		) КАК РасчетыСПоставщикамиОстатки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|	ПО 
	|		РасчетыСПоставщикамиОстатки.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
	|
	|ГДЕ
	|	ВЫБОР КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская) 
	|		И РасчетыСПоставщикамиОстатки.СуммаОстаток >= 0
	|	ТОГДА
	|		ИСТИНА
	|	КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
	|		И РасчетыСПоставщикамиОстатки.СуммаОстаток <= 0
	|	ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ
	|		ЛОЖЬ
	|	КОНЕЦ";
	
	ТекстЗапроса = "";
	
	Если Не ЗначениеЗаполнено(ТипРасчетов) Тогда
		
		ТекстЗапроса = ТекстРасчетыСКлиентами + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|" + ТекстРасчетыСПоставщиками;
		
	ИначеЕсли ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
		ТекстЗапроса = ТекстРасчетыСКлиентами;
	Иначе //РасчетыСПоставщиком
		ТекстЗапроса = ТекстРасчетыСПоставщиками;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	МоментВремени = КонецДня(Дата);
	Граница = Новый Граница(МоментВремени, ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Граница", Граница);
	Запрос.УстановитьПараметр("ТипЗадолженности", ТипЗадолженности);
	
	Задолженность.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Валюта)
		 И Валюта <> Выборка.ВалютаВзаиморасчетов Тогда
		
			Сумма = РаботаСКурсамиВалютУТ.ПересчитатьВВалюту(
			        	Выборка.СуммаВзаиморасчетов,
			        	ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Выборка.Организация),
			        	Выборка.ВалютаВзаиморасчетов,
			        	Валюта,
			        	МоментВремени,
			        	Выборка.ОбъектРасчетов);
		
		Иначе
			Сумма = Выборка.СуммаВзаиморасчетов;
		КонецЕсли;
		
		Если Сумма <> 0 Тогда
			НоваяСтрока = Задолженность.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Сумма = Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура получает результат запроса по остаткам расчетов с партнером по документам.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация документа.
//	Контрагент - СправочникСсылка.Контрагенты - Контрагент, выбранный в документе.
//	ТипЗадолженности - ПеречислениеСсылка.ТипыЗадолженности - Тип задолженности.
//	ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами - Тип расчетов.
//	Дата - Дата - Дата документа.
//	Валюта - СправочникСсылка.Валюты - Валюта документа.
//	Задолженность - ДанныеФормыКоллекция - Табличная часть документа.
//
Процедура ЗаполнитьЗадолженностьПоОстаткамВзаиморасчетов(Организация, Контрагент, ТипЗадолженности, ТипРасчетов, Дата, Валюта, Задолженность) Экспорт
	
	Задолженность.Очистить();
	
	ТекстВтАналитика = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВтОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ГоловнаяОрганизация = &Организация
	|	И Организации.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию
	|	И Организации.ОбособленноеПодразделение
	|	ИЛИ Организации.Ссылка = &Организация
	|;
	|ВЫБРАТЬ
	|	РегистрАналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам
	|ПОМЕСТИТЬ ВтАналитика
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОрганизации
	|			ПО ВтОрганизации.Ссылка = РегистрАналитикаУчетаПоПартнерам.Организация
	|ГДЕ
	|	РегистрАналитикаУчетаПоПартнерам.Контрагент = &Контрагент
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Если НЕ ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		
		ТекстРасчетыСКлиентами = 
		
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
		|	РегистрАналитикаУчетаПоПартнерам.Партнер     КАК Партнер,
		|	РегистрАналитикаУчетаПоПартнерам.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	РегистрАналитикаУчетаПоПартнерам.Организация КАК Организация,
		|	РасчетыСКлиентамиОстатки.ЗаказКлиента        КАК ОбъектРасчетов,
		|	РасчетыСКлиентамиОстатки.Валюта              КАК ВалютаВзаиморасчетов,
		|	РасчетыСКлиентамиОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	
		|	ВЫБОР КОГДА РасчетыСКлиентамиОстатки.ДолгОстаток + РасчетыСКлиентамиОстатки.ПредоплатаОстаток < 0 ТОГДА
		|		-(РасчетыСКлиентамиОстатки.ДолгОстаток + РасчетыСКлиентамиОстатки.ПредоплатаОстаток)
		|	ИНАЧЕ
		|		РасчетыСКлиентамиОстатки.ДолгОстаток + РасчетыСКлиентамиОстатки.ПредоплатаОстаток
		|	КОНЕЦ КАК СуммаВзаиморасчетов,
		|
		|	ВЫБОР КОГДА РасчетыСКлиентамиОстатки.ДолгРеглОстаток + РасчетыСКлиентамиОстатки.ПредоплатаРеглОстаток < 0 ТОГДА
		|		-(РасчетыСКлиентамиОстатки.ДолгРеглОстаток + РасчетыСКлиентамиОстатки.ПредоплатаРеглОстаток)
		|	ИНАЧЕ
		|		РасчетыСКлиентамиОстатки.ДолгРеглОстаток + РасчетыСКлиентамиОстатки.ПредоплатаРеглОстаток
		|	КОНЕЦ КАК СуммаРегл,
		|
		|	ВЫБОР КОГДА РасчетыСКлиентамиОстатки.ДолгУпрОстаток + РасчетыСКлиентамиОстатки.ПредоплатаУпрОстаток < 0 ТОГДА
		|		-(РасчетыСКлиентамиОстатки.ДолгУпрОстаток + РасчетыСКлиентамиОстатки.ПредоплатаУпрОстаток)
		|	ИНАЧЕ
		|		РасчетыСКлиентамиОстатки.ДолгУпрОстаток + РасчетыСКлиентамиОстатки.ПредоплатаУпрОстаток
		|	КОНЕЦ КАК СуммаУпр
		|
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(&Граница,
		|		АналитикаУчетаПоПартнерам В (
		|			ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)
		|		) КАК РасчетыСКлиентамиОстатки
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|		РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
		|	ПО 
		|		РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
		|
		|ГДЕ
		|	ВЫБОР КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		И (РасчетыСКлиентамиОстатки.ДолгОстаток > 0 ИЛИ РасчетыСКлиентамиОстатки.ПредоплатаОстаток > 0)
		|	ТОГДА
		|		ИСТИНА
		|	КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|		И (РасчетыСКлиентамиОстатки.ДолгОстаток < 0 ИЛИ РасчетыСКлиентамиОстатки.ПредоплатаОстаток < 0)
		|	ТОГДА
		|		ИСТИНА
		|	ИНАЧЕ
		|		ЛОЖЬ
		|	КОНЕЦ";
		
		ТекстРасчетыСПоставщиками = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
		|	РегистрАналитикаУчетаПоПартнерам.Партнер     КАК Партнер,
		|	РегистрАналитикаУчетаПоПартнерам.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	РегистрАналитикаУчетаПоПартнерам.Организация КАК Организация,
		|	РасчетыСПоставщикамиОстатки.ЗаказПоставщику  КАК ОбъектРасчетов,
		|	РасчетыСПоставщикамиОстатки.Валюта           КАК ВалютаВзаиморасчетов,
		|	РасчетыСПоставщикамиОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	
		|	ВЫБОР КОГДА РасчетыСПоставщикамиОстатки.ДолгОстаток + РасчетыСПоставщикамиОстатки.ПредоплатаОстаток < 0 ТОГДА
		|		-(РасчетыСПоставщикамиОстатки.ДолгОстаток + РасчетыСПоставщикамиОстатки.ПредоплатаОстаток)
		|	ИНАЧЕ
		|		РасчетыСПоставщикамиОстатки.ДолгОстаток + РасчетыСПоставщикамиОстатки.ПредоплатаОстаток
		|	КОНЕЦ КАК СуммаВзаиморасчетов,
		|	
		|	ВЫБОР КОГДА РасчетыСПоставщикамиОстатки.ДолгРеглОстаток + РасчетыСПоставщикамиОстатки.ПредоплатаРеглОстаток < 0 ТОГДА
		|		-(РасчетыСПоставщикамиОстатки.ДолгРеглОстаток + РасчетыСПоставщикамиОстатки.ПредоплатаРеглОстаток)
		|	ИНАЧЕ
		|		РасчетыСПоставщикамиОстатки.ДолгРеглОстаток + РасчетыСПоставщикамиОстатки.ПредоплатаРеглОстаток
		|	КОНЕЦ КАК СуммаРегл,
		|
		|	ВЫБОР КОГДА РасчетыСПоставщикамиОстатки.ДолгУпрОстаток + РасчетыСПоставщикамиОстатки.ПредоплатаУпрОстаток < 0 ТОГДА
		|		-(РасчетыСПоставщикамиОстатки.ДолгУпрОстаток + РасчетыСПоставщикамиОстатки.ПредоплатаУпрОстаток)
		|	ИНАЧЕ
		|		РасчетыСПоставщикамиОстатки.ДолгУпрОстаток + РасчетыСПоставщикамиОстатки.ПредоплатаУпрОстаток
		|	КОНЕЦ КАК СуммаУпр
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(&Граница,
		|		АналитикаУчетаПоПартнерам В (
		|			ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)
		|		) КАК РасчетыСПоставщикамиОстатки
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|		РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
		|	ПО 
		|		РасчетыСПоставщикамиОстатки.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
		|
		|ГДЕ
		|	ВЫБОР КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская) 
		|		И (РасчетыСПоставщикамиОстатки.ДолгОстаток > 0 ИЛИ РасчетыСПоставщикамиОстатки.ПредоплатаОстаток > 0)
		|	ТОГДА
		|		ИСТИНА
		|	КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|		И (РасчетыСПоставщикамиОстатки.ДолгОстаток < 0 ИЛИ РасчетыСПоставщикамиОстатки.ПредоплатаОстаток < 0)
		|	ТОГДА
		|		ИСТИНА
		|	ИНАЧЕ
		|		ЛОЖЬ
		|	КОНЕЦ";
		
		ТекстЗапроса = "";
		
		Если Не ЗначениеЗаполнено(ТипРасчетов) Тогда
			
			ТекстЗапроса = ТекстВтАналитика + ТекстРасчетыСКлиентами + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|" + ТекстРасчетыСПоставщиками;
			
		ИначеЕсли ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
			ТекстЗапроса = ТекстВтАналитика + ТекстРасчетыСКлиентами;
		Иначе
			ТекстЗапроса = ТекстВтАналитика + ТекстРасчетыСПоставщиками;
		КонецЕсли;
		
		Запрос = Новый Запрос(ТекстЗапроса);
		
		МоментВремени = КонецДня(Дата);
		Граница = Новый Граница(МоментВремени, ВидГраницы.Включая);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Граница", Граница);
		Запрос.УстановитьПараметр("ТипЗадолженности", ТипЗадолженности);
		
	Иначе
		
		ТекстРасчетыСКлиентами = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
			|	РегистрАналитикаУчетаПоПартнерам.Партнер     КАК Партнер,
			|	РегистрАналитикаУчетаПоПартнерам.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|	РегистрАналитикаУчетаПоПартнерам.Организация КАК Организация,
			|	РасчетыСКлиентамиОстатки.ОбъектРасчетов      КАК ОбъектРасчетов,
			|	РасчетыСКлиентамиОстатки.Валюта              КАК ВалютаВзаиморасчетов,
			|	
			|	РасчетыСКлиентамиОстатки.ДолгОстаток + РасчетыСКлиентамиОстатки.ПредоплатаОстаток КАК СуммаВзаиморасчетов,
			|	РасчетыСКлиентамиОстатки.ДолгРеглОстаток + РасчетыСКлиентамиОстатки.ПредоплатаРеглОстаток КАК СуммаРегл,
			|	РасчетыСКлиентамиОстатки.ДолгУпрОстаток + РасчетыСКлиентамиОстатки.ПредоплатаУпрОстаток КАК СуммаУпр
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&Граница,
			|		&Валюта
			|		И АналитикаУчетаПоПартнерам В (
			|			ВЫБРАТЬ
			|				ВтАналитика.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
			|			ИЗ
			|				ВтАналитика КАК ВтАналитика)
			|		) КАК РасчетыСКлиентамиОстатки
			|	ЛЕВОЕ СОЕДИНЕНИЕ 
			|		РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
			|	ПО
			|		РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
			|ГДЕ
			|	ВЫБОР КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
			|		И РасчетыСКлиентамиОстатки.ДолгОстаток > 0
			|	ТОГДА
			|		ИСТИНА
			|	КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|		И РасчетыСКлиентамиОстатки.ПредоплатаОстаток > 0
			|	ТОГДА
			|		ИСТИНА
			|	ИНАЧЕ
			|		ЛОЖЬ
			|	КОНЕЦ";
		
		ТекстРасчетыСПоставщиками = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
			|	РегистрАналитикаУчетаПоПартнерам.Партнер          КАК Партнер,
			|	РегистрАналитикаУчетаПоПартнерам.НаправлениеДеятельности КАК НаправлениеДеятельности,
			|	РегистрАналитикаУчетаПоПартнерам.Организация      КАК Организация,
			|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов   КАК ОбъектРасчетов,
			|	РасчетыСПоставщикамиОстатки.Валюта           КАК ВалютаВзаиморасчетов,
			|	
			|	РасчетыСПоставщикамиОстатки.ДолгОстаток + РасчетыСПоставщикамиОстатки.ПредоплатаОстаток КАК СуммаВзаиморасчетов,
			|	РасчетыСПоставщикамиОстатки.ДолгРеглОстаток + РасчетыСПоставщикамиОстатки.ПредоплатаРеглОстаток КАК СуммаРегл,
			|	РасчетыСПоставщикамиОстатки.ДолгУпрОстаток + РасчетыСПоставщикамиОстатки.ПредоплатаУпрОстаток КАК СуммаУпр
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(&Граница,
			|		&Валюта
			|		И АналитикаУчетаПоПартнерам В (
			|			ВЫБРАТЬ
			|				ВтАналитика.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
			|			ИЗ
			|				ВтАналитика КАК ВтАналитика)
			|		) КАК РасчетыСПоставщикамиОстатки
			|	ЛЕВОЕ СОЕДИНЕНИЕ 
			|		РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
			|	ПО
			|		РасчетыСПоставщикамиОстатки.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
			|ГДЕ
			|	ВЫБОР КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская) 
			|		И РасчетыСПоставщикамиОстатки.ПредоплатаОстаток > 0
			|	ТОГДА
			|		ИСТИНА
			|	КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
			|		И РасчетыСПоставщикамиОстатки.ДолгОстаток > 0
			|	ТОГДА
			|		ИСТИНА
			|	ИНАЧЕ
			|		ЛОЖЬ
			|	КОНЕЦ";
		
		Запрос     = Новый Запрос;
		
		МоментВремени = КонецДня(Дата);
		Граница = Новый Граница(МоментВремени, ВидГраницы.Включая);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Граница", Граница);
		Запрос.УстановитьПараметр("ТипЗадолженности", ТипЗадолженности);
		Запрос.УстановитьПараметр("Валюта", Валюта);
		
		Если Не ЗначениеЗаполнено(ТипРасчетов) Тогда
			ТекстЗапроса = ТекстВтАналитика + ТекстРасчетыСКлиентами + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|" + ТекстРасчетыСПоставщиками;
		ИначеЕсли ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
			ТекстЗапроса =  ТекстВтАналитика + ТекстРасчетыСКлиентами;
		Иначе
			ТекстЗапроса = ТекстВтАналитика + ТекстРасчетыСПоставщиками;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Валюта) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Валюта", "Валюта = &Валюта");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Валюта", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
	КонецЕсли;
	
	Остатки = Запрос.Выполнить().Выгрузить();
	Остатки.Свернуть("ТипРасчетов, Партнер, НаправлениеДеятельности,Организация, ОбъектРасчетов, ВалютаВзаиморасчетов","СуммаВзаиморасчетов, СуммаРегл, СуммаУпр");
	
	Для Каждого СтрокаОстатков Из Остатки Цикл
		
		НоваяСтрока = Задолженность.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатков);
		
	КонецЦикла;
	
КонецПроцедуры

// Устарела. Пересчитывает суммы расшифровки платежа в выбранную валюту.
//
// Параметры:
//		Объект - ДокументОбъект - Документ для пересчета суммы.
//		СуммаВсего - Число - Сумма документа.
//
Процедура ПересчитатьСуммыВВалютуРасшифровкаПлатежа(Объект, СуммаВсего) Экспорт
	
	ВзаиморасчетыЗаполнениеРасшифровкиПлатежа.ПересчитатьСуммыВВалютуРасшифровкаПлатежа(Объект, СуммаВсего);
	
КонецПроцедуры

// Функция определяет порядок оплаты в иностранной валюте.
//
// Параметры:
//  ВалютаОплаты - СправочникСсылка.Валюты - Необязательное, валюта предполагаемой оплаты.
//  Организация - СправочникСсылка.Организации - Необязательное, определяет валюту регламентированного учета.
//
// Возвращаемое значение:
//  Булево - оплата производится в иностранной валюте.
//
Функция ПолучитьОплатуВВалютеПоУмолчанию(Знач ВалютаОплаты = Неопределено, Знач Организация = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	Иначе
		ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВалютаОплаты) Тогда
		ВалютаОплаты = ВалютаРегламентированногоУчета;
	КонецЕсли;
	
	Если НЕ ВалютаОплаты = ВалютаРегламентированногоУчета Тогда
		ОплатаВВалюте = Истина;
	Иначе
		ОплатаВВалюте = Ложь;
	КонецЕсли;
	
	Возврат ОплатаВВалюте;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииФормированияДвиженийПоРасчетамСКонтрагентами

// Процедура заполняет сумму взаиморасчетов в табличной части "Расшифровка платежка"
// в документах движения денежных средств.
//
// Параметры:
//	Валюта - СправочникСсылка.Валюты - Валюта, указанная в документе.
//	Дата - Дата - Дата документа.
//	ТабличнаяЧасть - ТабличнаяЧасть - Табличная часть документа.
//	Организация - СправочникСсылка.Организации - Организация документа. Определяет базовую валюту получения курсов.
Процедура ЗаполнитьСуммуВзаиморасчетовВТабличнойЧасти(Валюта, Дата, ТабличнаяЧасть, Организация) Экспорт
	
	// Если табличная часть пустая или в табличной части заполнена сумма взаиморасчетов,
	// то выполнение процедуры не требуется.
	Если (ТабличнаяЧасть.Количество() = 0
	 ИЛИ ТабличнаяЧасть.Найти(0, "СуммаВзаиморасчетов") = Неопределено)
	 И ТабличнаяЧасть.Найти(Справочники.Валюты.ПустаяСсылка(), "ВалютаВзаиморасчетов") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ИсходнаяТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.СуммаВзаиморасчетов = 0
	|	ИЛИ ТаблицаДокумента.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.*,
	|	Таблица.Валюта КАК Валюта,
	|	Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		
	|	ВЫБОР КОГДА Таблица.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) ТОГДА
	|		Таблица.ОбъектРасчетов.Партнер
	|	ИНАЧЕ
	|		Таблица.Партнер
	|	КОНЕЦ КАК Партнер,
	|	
	|	ВЫБОР КОГДА Таблица.ВалютаВзаиморасчетов <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ТОГДА
	|		Таблица.ВалютаВзаиморасчетов
	|	ИНАЧЕ
	|		ВЫБОР КОГДА Таблица.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка) ТОГДА
	|			Таблица.ОбъектРасчетов.ВалютаВзаиморасчетов
	|		ИНАЧЕ
	|			&Валюта
	|		КОНЕЦ
	|	КОНЕЦ КАК ВалютаВзаиморасчетов
	|	
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	ИсходнаяТаблицаДокумента КАК Таблица
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсДоговора.Период КАК Период,
	|	КурсДоговора.Договор КАК Договор,
	|	КурсДоговора.КурсЧислитель КАК КурсЧислитель,
	|	КурсДоговора.КурсЗнаменатель КАК КурсЗнаменатель
	|ПОМЕСТИТЬ втКурсыДоговоров
	|ИЗ
	|	РегистрСведений.КурсыВалютРасчетовПоДоговорам.СрезПоследних(&Дата) КАК КурсДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА ОбъектыРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|				И ЕСТЬNULL(ОбъектыРасчетов.Договор.ВариантКурсаДоговора, ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|		ИНАЧЕ ЕСТЬNULL(ОбъектыРасчетов.Договор.ВариантКурсаДоговора, ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный))
	|	КОНЕЦ КАК ВариантКурсаДоговора,
	|	ОбъектыРасчетов.ТипОбъектаРасчетов КАК ТипОбъектаРасчетов,
	|	КурсыДокументов.КурсЧислительВалютыВзаиморасчетов КАК КурсЧислительВалютыВзаиморасчетов,
	|	КурсыДокументов.КурсЗнаменательВалютыВзаиморасчетов КАК КурсЗнаменательВалютыВзаиморасчетов,
	|	КурсыДокументов.КурсЧислительВалютыУправленческогоУчета КАК КурсЧислительВалютыУправленческогоУчета,
	|	КурсыДокументов.КурсЗнаменательВалютыУправленческогоУчета КАК КурсЗнаменательВалютыУправленческогоУчета,
	|	КурсыДокументов.КурсЧислительВалютыДокумента КАК КурсЧислительВалютыДокумента,
	|	КурсыДокументов.КурсЗнаменательВалютыДокумента КАК КурсЗнаменательВалютыДокумента,
	|	КурсыДокументов.ВалютаДокумента КАК ВалютаДокумента,
	|	ОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ОбъектыРасчетов.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	ОбъектыРасчетов.Дата КАК Дата,
	|	ЕСТЬNULL(КурсыДоговоров.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодКурсаДоговора,
	|	КурсыДоговоров.КурсЧислитель КАК КурсЧислительВалютыДоговора,
	|	КурсыДоговоров.КурсЗнаменатель КАК КурсЗнаменательВалютыДоговора
	|ПОМЕСТИТЬ ДанныеОбъектаРасчетов
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов 
	|		ПО ТаблицаДокумента.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВалютыИКурсыДокументов КАК КурсыДокументов
	|		ПО ОбъектыРасчетов.Объект = КурсыДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыДоговоров КАК КурсыДоговоров
	|		ПО ОбъектыРасчетов.Договор = КурсыДоговоров.Договор
	|ГДЕ 
	|	ТаблицаДокумента.СуммаВзаиморасчетов = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	КурсыВалют.ОбъектРасчетов КАК ОбъектРасчетов,
	|	КурсыВалют.ВалютаДокумента КАК Валюта,
	|	КурсыВалют.БазоваяВалюта КАК БазоваяВалюта,
	|	КурсыВалют.ДатаКурса КАК ДатаКурса,
	|	МАКСИМУМ(КурсыВалют.КурсЧислитель) КАК КурсЧислитель,
	|	МАКСИМУМ(КурсыВалют.КурсЗнаменатель) КАК КурсЗнаменатель
	|ПОМЕСТИТЬ ВтКурсыВалют
	|ИЗ (
	|	ВЫБРАТЬ 
	|		ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаДокумента КАК ВалютаДокумента,
	|		ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета КАК БазоваяВалюта,
	|		ДанныеОбъектаРасчетов.Дата КАК ДатаКурса,
	|		ДанныеОбъектаРасчетов.КурсЧислительВалютыДокумента КАК КурсЧислитель,
	|		ДанныеОбъектаРасчетов.КурсЗнаменательВалютыДокумента КАК КурсЗнаменатель
	|	ИЗ
	|		ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|	ГДЕ
	|		ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|		И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|		И ДанныеОбъектаРасчетов.ВалютаДокумента = &Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаДокумента КАК Валюта,
	|		ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета КАК БазоваяВалюта,
	|		ДанныеОбъектаРасчетов.Дата КАК ДатаКурса,
	|		ДанныеОбъектаРасчетов.КурсЧислительВалютыДокумента КАК КурсЧислитель,
	|		ДанныеОбъектаРасчетов.КурсЗнаменательВалютыДокумента КАК КурсЗнаменатель
	|	ИЗ
	|		ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|	ГДЕ
	|		ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|		И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|		И ДанныеОбъектаРасчетов.ВалютаДокумента В (ВЫБРАТЬ Т.ВалютаВзаиморасчетов ИЗ ТаблицаДокумента КАК Т)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаДокумента КАК Валюта,
	|		ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета КАК БазоваяВалюта,
	|		ДанныеОбъектаРасчетов.Дата КАК ДатаКурса,
	|		ДанныеОбъектаРасчетов.КурсЧислительВалютыДокумента КАК КурсЧислитель,
	|		ДанныеОбъектаРасчетов.КурсЗнаменательВалютыДокумента КАК КурсЗнаменатель
	|	ИЗ
	|		ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|	ГДЕ
	|		ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|		И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|		И ДанныеОбъектаРасчетов.ВалютаДокумента В (ВЫБРАТЬ Т.Валюта ИЗ ТаблицаДокумента КАК Т)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета,
	|		ДанныеОбъектаРасчетов.Дата,
	|		ДанныеОбъектаРасчетов.КурсЧислительВалютыВзаиморасчетов,
	|		ДанныеОбъектаРасчетов.КурсЗнаменательВалютыВзаиморасчетов
	|	ИЗ
	|		ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|	ГДЕ
	|		ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|		И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|		И ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов = &Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета,
	|		ДанныеОбъектаРасчетов.Дата,
	|		ДанныеОбъектаРасчетов.КурсЧислительВалютыВзаиморасчетов,
	|		ДанныеОбъектаРасчетов.КурсЗнаменательВалютыВзаиморасчетов
	|	ИЗ
	|		ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|	ГДЕ
	|		ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|		И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|		И ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов В (ВЫБРАТЬ Т.ВалютаВзаиморасчетов ИЗ ТаблицаДокумента КАК Т)
	|	
	|		ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|			ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета,
	|		ДанныеОбъектаРасчетов.Дата,
	|		ДанныеОбъектаРасчетов.КурсЧислительВалютыВзаиморасчетов,
	|		ДанныеОбъектаРасчетов.КурсЗнаменательВалютыВзаиморасчетов
	|		ИЗ
	|		ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|	ГДЕ
	|		ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|		И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|		И ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов В (ВЫБРАТЬ Т.Валюта ИЗ ТаблицаДокумента КАК Т)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|		&ВалютаУпр,
	|		ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета,
	|		ДанныеОбъектаРасчетов.Дата,
	|		ДанныеОбъектаРасчетов.КурсЧислительВалютыУправленческогоУчета,
	|		ДанныеОбъектаРасчетов.КурсЗнаменательВалютыУправленческогоУчета
	|	ИЗ
	|		ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|	ГДЕ
	|		ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|		И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|		И &ВалютаУпр = &Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|		&ВалютаУпр,
	|		ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета,
	|		ДанныеОбъектаРасчетов.Дата,
	|		ДанныеОбъектаРасчетов.КурсЧислительВалютыУправленческогоУчета,
	|		ДанныеОбъектаРасчетов.КурсЗнаменательВалютыУправленческогоУчета
	|	ИЗ
	|		ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|	ГДЕ
	|		ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|		И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|		И &ВалютаУпр В (ВЫБРАТЬ Т.ВалютаВзаиморасчетов ИЗ ТаблицаДокумента КАК Т)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|		&ВалютаУпр,
	|		ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета,
	|		ДанныеОбъектаРасчетов.Дата,
	|		ДанныеОбъектаРасчетов.КурсЧислительВалютыУправленческогоУчета,
	|		ДанныеОбъектаРасчетов.КурсЗнаменательВалютыУправленческогоУчета
	|	ИЗ
	|		ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|	ГДЕ
	|		ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|		И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|		И &ВалютаУпр В (ВЫБРАТЬ Т.Валюта ИЗ ТаблицаДокумента КАК Т)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета,
	|		ДанныеОбъектаРасчетов.ПериодКурсаДоговора,
	|		ДанныеОбъектаРасчетов.КурсЧислительВалютыДоговора,
	|		ДанныеОбъектаРасчетов.КурсЗнаменательВалютыДоговора
	|	ИЗ
	|		ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|	ГДЕ
	|		ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		И ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов = &Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета,
	|		ДанныеОбъектаРасчетов.ПериодКурсаДоговора,
	|		ДанныеОбъектаРасчетов.КурсЧислительВалютыДоговора,
	|		ДанныеОбъектаРасчетов.КурсЗнаменательВалютыДоговора
	|	ИЗ
	|		ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|	ГДЕ
	|		ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		И ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов В (ВЫБРАТЬ Т.Валюта ИЗ ТаблицаДокумента КАК Т)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОбъектаРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов,
	|		ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета,
	|		ДанныеОбъектаРасчетов.ПериодКурсаДоговора,
	|		ДанныеОбъектаРасчетов.КурсЧислительВалютыДоговора,
	|		ДанныеОбъектаРасчетов.КурсЗнаменательВалютыДоговора
	|	ИЗ
	|		ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|	ГДЕ
	|		ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|		И ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов В (ВЫБРАТЬ Т.ВалютаВзаиморасчетов ИЗ ТаблицаДокумента КАК Т)) КАК КурсыВалют
	|СГРУППИРОВАТЬ ПО
	|	КурсыВалют.ОбъектРасчетов,
	|	КурсыВалют.ВалютаДокумента,
	|	КурсыВалют.БазоваяВалюта,
	|	КурсыВалют.ДатаКурса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|	
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаДокумента.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ТаблицаДокумента.Партнер КАК Партнер,
	|
	|	ВЫБОР КОГДА ТаблицаДокумента.СуммаВзаиморасчетов = 0 И КурсыВалютМультивалютногоДокумента.КурсЧислитель ЕСТЬ NULL ТОГДА
	|		(ТаблицаДокумента.Сумма *
	|		ЕСТЬNULL(ВтКурсыВалютДокумента.КурсЧислитель, ЕСТЬNULL(КурсыВалютДокумента.КурсЧислитель, 1)) * 
	|		ЕСТЬNULL(ВтКурсыВалют.КурсЗнаменатель, ЕСТЬNULL(КурсыВалют.КурсЗнаменатель, 1))
	|		) / (
	|		ЕСТЬNULL(ВтКурсыВалют.КурсЧислитель, ЕСТЬNULL(КурсыВалют.КурсЧислитель, 1)) * 
	|		ЕСТЬNULL(ВтКурсыВалютДокумента.КурсЗнаменатель, ЕСТЬNULL(КурсыВалютДокумента.КурсЗнаменатель, 1))
	|		)
	|	КОГДА ТаблицаДокумента.СуммаВзаиморасчетов = 0 И НЕ КурсыВалютМультивалютногоДокумента.КурсЧислитель ЕСТЬ NULL ТОГДА
	|		(ТаблицаДокумента.Сумма *
	|		ЕСТЬNULL(ВтКурсыВалютМультивалютногоДокумента.КурсЧислитель, ЕСТЬNULL(КурсыВалютМультивалютногоДокумента.КурсЧислитель, 1)) * 
	|		ЕСТЬNULL(ВтКурсыВалют.КурсЗнаменатель, ЕСТЬNULL(КурсыВалют.КурсЗнаменатель, 1))
	|		) / (
	|		ЕСТЬNULL(ВтКурсыВалют.КурсЧислитель, ЕСТЬNULL(КурсыВалют.КурсЧислитель, 1)) * 
	|		ЕСТЬNULL(ВтКурсыВалютМультивалютногоДокумента.КурсЗнаменатель, ЕСТЬNULL(КурсыВалютМультивалютногоДокумента.КурсЗнаменатель, 1))
	|		)
	|	ИНАЧЕ
	|		ТаблицаДокумента.СуммаВзаиморасчетов
	|	КОНЕЦ КАК СуммаВзаиморасчетов
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|	
	|	// Определим курс валюты документа.
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтКурсыВалют КАК ВтКурсыВалютДокумента
	|	ПО ТаблицаДокумента.ОбъектРасчетов = ВтКурсыВалютДокумента.ОбъектРасчетов
	|		И ВтКурсыВалютДокумента.Валюта = &Валюта	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютДокумента
	|	ПО
	|		ИСТИНА
	|	
	|	// Определим курс валюты документа
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтКурсыВалют КАК ВтКурсыВалютМультивалютногоДокумента
	|	ПО ТаблицаДокумента.ОбъектРасчетов = ВтКурсыВалютМультивалютногоДокумента.ОбъектРасчетов
	|		И ТаблицаДокумента.Валюта = ВтКурсыВалютМультивалютногоДокумента.Валюта	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютМультивалютногоДокумента
	|	ПО
	|		ТаблицаДокумента.Валюта = КурсыВалютМультивалютногоДокумента.Валюта
	|		
	|	// Определим курс валюты взаиморасчетов.
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтКурсыВалют КАК ВтКурсыВалют
	|	ПО ТаблицаДокумента.ОбъектРасчетов = ВтКурсыВалют.ОбъектРасчетов
	|		И ТаблицаДокумента.ВалютаВзаиморасчетов = ВтКурсыВалют.Валюта	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалют
	|	ПО
	|		ТаблицаДокумента.ВалютаВзаиморасчетов = КурсыВалют.Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаДокумента.НомерСтроки
	|;
	|");
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация));
	Запрос.УстановитьПараметр("ВалютаУпр", ЗначениеНастроекПовтИсп.ВалютаУправленческогоУчета());
	
	ТаблицаДокумента = ТабличнаяЧасть.Выгрузить();
	Если ТаблицаДокумента.Колонки.Найти("Партнер") = Неопределено Тогда
		ТаблицаДокумента.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	КонецЕсли;
	Если ТаблицаДокумента.Колонки.Найти("Валюта") = Неопределено Тогда
		ТаблицаДокумента.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаДокумента", ТаблицаДокумента);
	
	// Получим таблицу документа с рассчитанной суммой взаиморасчетов.
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = ТабличнаяЧасть.Найти(Выборка.НомерСтроки, "НомерСтроки");
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка, ,"НомерСтроки");
		
	КонецЦикла;
	
КонецПроцедуры

// Устарела.
// Процедура заполняет сумму взаиморасчетов в шапке документа.
//
// Параметры:
//	ДокументОбъект - ДокументОбъект - Текущий документ
//	ИмяТЧ - Строка - Необязательный, имя табличной части для расчета суммы документа
//	СтруктураКурса - Структура - Необязательный, параметры курса документа:
//       * КурсЧислитель - Число - Курс числитель валюты.
//       * КурсЗнаменатель - Число - Курс знаменатель валюты.
//	Дата - Дата - Дата, на которую будет получен курс, если не задана структура курса.
// 
Процедура ЗаполнитьСуммуВзаиморасчетов(ДокументОбъект, ИмяТЧ = "", СтруктураКурса = Неопределено, Дата = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяТЧ) Тогда
		СуммаДокумента = ДокументОбъект[ИмяТЧ].Итог("Сумма");
		Если Не ДокументОбъект.ЦенаВключаетНДС Тогда
			СуммаДокумента = СуммаДокумента + ДокументОбъект[ИмяТЧ].Итог("СуммаНДС");
		КонецЕсли;
	Иначе
		СуммаДокумента = ДокументОбъект.СуммаДокумента;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ДокументОбъект.Дата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураКурса) И ТипЗнч(СтруктураКурса) = Тип("Структура") Тогда
		
		ВалютаРегУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДокументОбъект.Организация);
		
		Если  ДокументОбъект.Валюта = ВалютаРегУчета И НЕ ДокументОбъект.ВалютаВзаиморасчетов = ВалютаРегУчета Тогда
			КурсЧислительВалютыДокумента = 1;
			КурсЗнаменательВалютыДокумента = 1;
			КурсЧислительВалютыВзаиморасчетов = СтруктураКурса.КурсЧислитель;
			КурсЗнаменательВалютыВзаиморасчетов = СтруктураКурса.КурсЗнаменатель;
		Иначе
			КурсЧислительВалютыДокумента = СтруктураКурса.КурсЧислитель;
			КурсЗнаменательВалютыДокумента  = СтруктураКурса.КурсЗнаменатель;
			КурсЧислительВалютыВзаиморасчетов = 1;
			КурсЗнаменательВалютыВзаиморасчетов = 1;
		КонецЕсли;
		
		ПараметрыВалютыДок = Новый Структура("Валюта, КурсЧислитель, КурсЗнаменатель",
				ДокументОбъект.Валюта, КурсЧислительВалютыДокумента, КурсЗнаменательВалютыДокумента);
		ПараметрыВалютыВР  = Новый Структура("Валюта, КурсЧислитель, КурсЗнаменатель",
				ДокументОбъект.ВалютаВзаиморасчетов, КурсЧислительВалютыВзаиморасчетов, КурсЗнаменательВалютыВзаиморасчетов);
			
		ДокументОбъект.СуммаВзаиморасчетов = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(СуммаДокумента,
				ПараметрыВалютыДок,ПараметрыВалютыВР);
			
	Иначе
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	(&СуммаДокумента *
		|	ЕСТЬNULL(КурсыВалютДокумента.КурсЧислитель, 1) * 
		|	ЕСТЬNULL(КурсыВалют.КурсЗнаменатель, 1)
		|	) / (
		|	ЕСТЬNULL(КурсыВалют.КурсЧислитель, 1) * 
		|	ЕСТЬNULL(КурсыВалютДокумента.КурсЗнаменатель, 1)
		|	) КАК СуммаВзаиморасчетов
		|	
		|ИЗ	
		|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата,
		|		Валюта = &ВалютаДокумента И БазоваяВалюта = &БазоваяВалюта
		|	) КАК КурсыВалютДокумента
		|	
		|	// Определим курс валюты взаиморасчетов.
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, 
		|			Валюта = &ВалютаВзаиморасчетов И БазоваяВалюта = &БазоваяВалюта
		|	) КАК КурсыВалют ПО ИСТИНА
		|");
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ВалютаДокумента", ДокументОбъект.Валюта);
		Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ДокументОбъект.ВалютаВзаиморасчетов);
		Запрос.УстановитьПараметр("СуммаДокумента", СуммаДокумента);
		Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДокументОбъект.Организация));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если ДокументОбъект.СуммаВзаиморасчетов <> Выборка.СуммаВзаиморасчетов Тогда
				ДокументОбъект.СуммаВзаиморасчетов = Выборка.СуммаВзаиморасчетов;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Устарела.
// Процедура заполняет сумму взаиморасчетов в шапке документа.
//
// Параметры:
// ДокументОбъект - ДокументОбъект - Текущий документ
// ИмяТЧ - Строка - Необязательный, имя табличной части, где рассчитывается сумма взаиморасчетов
// СтруктураКурса - Структура - Необязательный, параметры курса документа:
//       * КурсЧислитель   - Число - Курс числитель валюты
//       * КурсЗнаменатель - Число - Курс знаменатель валюты
//
Процедура ЗаполнитьСуммуВзаиморасчетовВПоступлении(ДокументОбъект, ИмяТЧ = "Товары", СтруктураКурса = Неопределено) Экспорт
	
	Если ДокументОбъект[ИмяТЧ].НайтиСтроки(Новый Структура("СуммаВзаиморасчетов", 0)).Количество()=0 Тогда
		
		ДокументОбъект.СуммаВзаиморасчетов = ДокументОбъект[ИмяТЧ].Итог("СуммаВзаиморасчетов");
		
	Иначе
		
		СуммаДокумента = ДокументОбъект[ИмяТЧ].Итог("Сумма");
		Если Не ДокументОбъект.ЦенаВключаетНДС Тогда
			СуммаДокумента = СуммаДокумента + ДокументОбъект[ИмяТЧ].Итог("СуммаНДС");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураКурса) И ТипЗнч(СтруктураКурса) = Тип("Структура") Тогда
			
			ВалютаРегУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДокументОбъект.Организация);
			
			Если ДокументОбъект.Валюта = ВалютаРегУчета И НЕ ДокументОбъект.ВалютаВзаиморасчетов = ВалютаРегУчета Тогда
				КурсЧислительВалютыДокумента = 1;
				КурсЗнаменательВалютыДокумента = 1;
				КурсЧислительВалютыВзаиморасчетов = СтруктураКурса.КурсЧислитель;
				КурсЗнаменательВалютыВзаиморасчетов = СтруктураКурса.КурсЗнаменатель;
			Иначе
				КурсЧислительВалютыДокумента = СтруктураКурса.КурсЧислитель;
				КурсЗнаменательВалютыДокумента = СтруктураКурса.КурсЗнаменатель;
				КурсЧислительВалютыВзаиморасчетов = 1;
				КурсЗнаменательВалютыВзаиморасчетов = 1;
			КонецЕсли;
			
			ПараметрыВалютыДок = Новый Структура("Валюта, КурсЧислитель, КурсЗнаменатель",
				ДокументОбъект.Валюта, КурсЧислительВалютыДокумента, КурсЗнаменательВалютыДокумента);
			ПараметрыВалютыВР  = Новый Структура("Валюта, КурсЧислитель, КурсЗнаменатель",
				ДокументОбъект.ВалютаВзаиморасчетов, КурсЧислительВалютыВзаиморасчетов, КурсЗнаменательВалютыВзаиморасчетов);
			
			ДокументОбъект.СуммаВзаиморасчетов = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(СуммаДокумента,
				ПараметрыВалютыДок,ПараметрыВалютыВР);
			
		Иначе
			
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	(&СуммаДокумента *
			|	ЕСТЬNULL(КурсыВалютДокумента.КурсЧислитель, 1) * 
			|	ЕСТЬNULL(КурсыВалют.КурсЗнаменатель, 1)
			|	) / (
			|	ЕСТЬNULL(КурсыВалют.КурсЧислитель, 1) * 
			|	ЕСТЬNULL(КурсыВалютДокумента.КурсЗнаменатель, 1)
			|	) КАК СуммаВзаиморасчетов
			|	
			|ИЗ	
			|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата,
			|		Валюта = &ВалютаДокумента И БазоваяВалюта = &БазоваяВалюта
			|	) КАК КурсыВалютДокумента
			|	
			|	// Определим курс валюты взаиморасчетов.
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, 
			|			Валюта = &ВалютаВзаиморасчетов И БазоваяВалюта = &БазоваяВалюта
			|	) КАК КурсыВалют ПО ИСТИНА
			|");
			
			Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата);
			Запрос.УстановитьПараметр("ВалютаДокумента", ДокументОбъект.Валюта);
			Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ДокументОбъект.ВалютаВзаиморасчетов);
			Запрос.УстановитьПараметр("СуммаДокумента", СуммаДокумента);
			Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДокументОбъект.Организация));
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если ДокументОбъект.СуммаВзаиморасчетов <> Выборка.СуммаВзаиморасчетов Тогда
					ДокументОбъект.СуммаВзаиморасчетов = Выборка.СуммаВзаиморасчетов;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Устарела.
// Процедура заполняет сумму НДС взаиморасчетов в табличной части документа.
//
// Параметры:
//	Документ - ДокументОбъект - Текущий документ.
//	ИмяТабличнойЧасти - Строка - Имя табличной части документа для заполнения.
// 
Процедура ЗаполнитьСуммуНДСВзаиморасчетовВТабличнойЧасти(Документ, ИмяТабличнойЧасти) Экспорт
	
	ТабличнаяЧасть = Документ[ИмяТабличнойЧасти];
	
	ВалютаДокумента = Документ.Валюта;
	ВалютаЗаказа    = Документ.ВалютаВзаиморасчетов;
	
	Если ВалютаДокумента = ВалютаЗаказа Тогда
		
		Для Индекс = 0 По ТабличнаяЧасть.Количество()-1 Цикл
			Если Не ЗначениеЗаполнено(ТабличнаяЧасть[Индекс].СуммаНДСВзаиморасчетов)
			 ИЛИ ТабличнаяЧасть[Индекс].СуммаНДСВзаиморасчетов <> ТабличнаяЧасть[Индекс].СуммаНДС Тогда
				ТабличнаяЧасть[Индекс].СуммаНДСВзаиморасчетов = ТабличнаяЧасть[Индекс].СуммаНДС;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
	
		Для Каждого Строка Из ТабличнаяЧасть Цикл
			
			Строка.СуммаНДСВзаиморасчетов = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(Строка.СуммаВзаиморасчетов, Строка.СтавкаНДС);
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет сумму расшифровки платежа в соответствии с суммой документа.
//
// Параметры:
//		СуммаДокумента - Число - Сумма документа для заполнения.
//		РасшифровкаПлатежа - ТаблицаЗначений - Таблица для заполнения.
//		ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта по умолчанию.
//
Процедура ЗаполнитьСуммуРасшифровкиПлатежаПоСуммеДокумента(Знач СуммаДокумента, РасшифровкаПлатежа, ВалютаВзаиморасчетов = Неопределено) Экспорт
	
	СуммаРасшифровкиПлатежа = РасшифровкаПлатежа.Итог("Сумма");
	Если СуммаДокумента <> СуммаРасшифровкиПлатежа Тогда
		
		Если РасшифровкаПлатежа.Количество() = 0 Тогда
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			НоваяСтрока.Сумма = СуммаДокумента;
			Если НЕ ВалютаВзаиморасчетов = Неопределено Тогда
				НоваяСтрока.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
			КонецЕсли;
		Иначе
			
			Разница = СуммаДокумента - СуммаРасшифровкиПлатежа;
			МассивУдаляемыхСтрок = Новый Массив;
			
			// Корректируются суммы в строках с пустым заказом.
			Для Каждого СтрокаТаблицы Из РасшифровкаПлатежа Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.ОбъектРасчетов) Тогда
					СтрокаТаблицы.Сумма = Макс(СтрокаТаблицы.Сумма + Разница, 0);
					СтрокаТаблицы.СуммаВзаиморасчетов = 0;
					Разница = СуммаДокумента - РасшифровкаПлатежа.Итог("Сумма");
				КонецЕсли;
				
				Если СтрокаТаблицы.Сумма = 0 Тогда
					МассивУдаляемыхСтрок.Добавить(СтрокаТаблицы);
				КонецЕсли;
				
				Если Разница = 0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			// Уменьшаются суммы в строках с указанным заказом.
			Если Разница < 0 Тогда
				
				Для Каждого СтрокаТаблицы Из РасшифровкаПлатежа Цикл
					
					Если ЗначениеЗаполнено(СтрокаТаблицы.ОбъектРасчетов) Тогда
						СтрокаТаблицы.Сумма = Макс(СтрокаТаблицы.Сумма + Разница, 0);
						СтрокаТаблицы.СуммаВзаиморасчетов = 0;
						Разница = СуммаДокумента - РасшифровкаПлатежа.Итог("Сумма");
					КонецЕсли;
					
					Если СтрокаТаблицы.Сумма = 0 Тогда
						МассивУдаляемыхСтрок.Добавить(СтрокаТаблицы);
					КонецЕсли;
					
					Если Разница = 0 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			// Остаток нераспределенной суммы будет отнесен на новую строку.
			Если Разница <> 0 Тогда
				НоваяСтрока = РасшифровкаПлатежа.Добавить();
				НоваяСтрока.Сумма = Разница;
				Если НЕ ВалютаВзаиморасчетов = Неопределено Тогда
					НоваяСтрока.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
				КонецЕсли;
			КонецЕсли;
			
			// Строки с нулевой суммой будут удалены.
			Для Каждого СтрокаТаблицы Из МассивУдаляемыхСтрок Цикл
				РасшифровкаПлатежа.Удалить(СтрокаТаблицы);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет или очищает табличную часть расшифровка платежа накладной при расчетах по накладным.
//
// Параметры:
//	СуммаДокумента		- Число - Сумма текущего документа.
//	СуммаВзаиморасчетов - Число - Сумма взаиморасчетов документа.
//	РасшифровкаПлатежа	- ТаблицаЗначений - Расшифровка платежа накладной для заполнения:
//		* СуммаВзаиморасчетов	- Число - Сумма взаиморасчетов по строке.
//		* Сумма					- Число - Сумма в валюте документа.
//		* ОбъектРасчетов		- СправочникСсылка.ОбъектыРасчетов - Ссылки на объекты расчетов зачтенных платежи/самого документа.
//	ОбъектРасчетов		- СправочникСсылка.ОбъектыРасчетов - Ссылка на объект расчетов документа владельца расшифровки.
//
Процедура ЗаполнитьСуммыРасшифровкиНакладной(Знач СуммаДокумента, ЗНАЧ СуммаВзаиморасчетов, РасшифровкаПлатежа, ОбъектРасчетов) Экспорт
	
	Если СуммаДокумента = 0 ИЛИ СуммаВзаиморасчетов = 0 Тогда
		РасшифровкаПлатежа.Очистить();
		Возврат;
	КонецЕсли;
	
	ТребуетсяПерераспределениеСуммы = Ложь;
	СуммаРасшифровкиПлатежа = РасшифровкаПлатежа.Итог("СуммаВзаиморасчетов");
	НовыйКурсЧислительВзаиморасчетов = ?(СуммаДокумента = 0 ИЛИ СуммаВзаиморасчетов = 0, 0, СуммаДокумента / СуммаВзаиморасчетов);
	
	Если СуммаВзаиморасчетов <> СуммаРасшифровкиПлатежа Тогда
		
		Разница = СуммаВзаиморасчетов - СуммаРасшифровкиПлатежа;
		ТребуетсяПерераспределениеСуммы = Истина;
		
		Если Разница > 0 Тогда
			
			Для Сч = 0 По РасшифровкаПлатежа.Количество()-1 Цикл
				СтрокаРасшифровки = РасшифровкаПлатежа[Сч];
				Если СтрокаРасшифровки.ОбъектРасчетов = ОбъектРасчетов Тогда
					СтрокаРасшифровки.СуммаВзаиморасчетов = СтрокаРасшифровки.СуммаВзаиморасчетов + Разница;
					Разница = 0;
				КонецЕсли;
			КонецЦикла;
			
			Если Разница > 0 Тогда
				СтрокаРасшифровки = РасшифровкаПлатежа.Добавить();
				СтрокаРасшифровки.СуммаВзаиморасчетов = Разница;
				СтрокаРасшифровки.ОбъектРасчетов = ОбъектРасчетов;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Разница < 0 Тогда
			
			Для Сч = 0 По РасшифровкаПлатежа.Количество()-1 Цикл
				СтрокаРасшифровки = РасшифровкаПлатежа[Сч];
				Если СтрокаРасшифровки.ОбъектРасчетов = ОбъектРасчетов Тогда
					СуммаВзаиморасчетовДо = СтрокаРасшифровки.СуммаВзаиморасчетов;
					СтрокаРасшифровки.СуммаВзаиморасчетов = Макс(0,СтрокаРасшифровки.СуммаВзаиморасчетов + Разница);
					Разница = Разница + (СуммаВзаиморасчетовДо - СтрокаРасшифровки.СуммаВзаиморасчетов);
				КонецЕсли;
			КонецЦикла;
			
			Если Разница < 0 Тогда
			
				Для Сч = 0 По РасшифровкаПлатежа.Количество()-1 Цикл
					СтрокаРасшифровки = РасшифровкаПлатежа[Сч];
					Если СтрокаРасшифровки.ОбъектРасчетов <> ОбъектРасчетов Тогда
						СуммаВзаиморасчетовДо = СтрокаРасшифровки.СуммаВзаиморасчетов;
						СтрокаРасшифровки.СуммаВзаиморасчетов = Макс(0,СтрокаРасшифровки.СуммаВзаиморасчетов + Разница);
						Разница = Разница + (СуммаВзаиморасчетовДо - СтрокаРасшифровки.СуммаВзаиморасчетов);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СуммаРасшифровкиПлатежа = РасшифровкаПлатежа.Итог("Сумма");
	Если ТребуетсяПерераспределениеСуммы ИЛИ СуммаДокумента <> СуммаРасшифровкиПлатежа Тогда
		
		Если РасшифровкаПлатежа.Количество() = 1 Тогда
			РасшифровкаПлатежа[0].Сумма = СуммаДокумента;
		ИначеЕсли РасшифровкаПлатежа.Количество() > 1 Тогда
			
			НераспределеннаяСумма = СуммаДокумента;
			Для Сч = 0 По РасшифровкаПлатежа.Количество()-1 Цикл
				СтрокаРасшифровки = РасшифровкаПлатежа[Сч];
				Если Сч = РасшифровкаПлатежа.Количество()-1 Тогда
					СтрокаРасшифровки.Сумма = НераспределеннаяСумма;
				Иначе
					СтрокаРасшифровки.Сумма = СтрокаРасшифровки.СуммаВзаиморасчетов * НовыйКурсЧислительВзаиморасчетов;
					НераспределеннаяСумма = НераспределеннаяСумма - СтрокаРасшифровки.Сумма;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Сч = 0;
	Пока Сч < РасшифровкаПлатежа.Количество() Цикл
		
		Если РасшифровкаПлатежа[Сч].СуммаВзаиморасчетов = 0 Тогда
			РасшифровкаПлатежа.Удалить(Сч);
		Иначе
			Сч = Сч +1;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Проведение

// Устарела. Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ.
//  Свойства - См. ПроведениеДокументов.СвойстваДокумента.
//
// Возвращаемое значение:
//  См. ПроведениеДокументов.ПараметрыУчетногоМеханизма.
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Возврат ВзаиморасчетыПроведение.ПараметрыДляПроведенияДокумента(Документ, Свойства);
	
КонецФункции

// Устарела. Возвращает тексты запросов для сторнирования движений при исправлении документов
// 
// Параметры:
// 	МетаданныеДокумента - ОбъектМетаданныхДокумент - Метаданные документа, который проводится.
// 
// Возвращаемое значение:
// 	Соответствие Из КлючИЗначение - Содержит тексты запросов сторнирования, где:
// 		* Ключ - Строка - Полное имя регистра.
// 		* Значение - Строка - Текст запроса.
//
Функция ТекстыЗапросовСторнирования(МетаданныеДокумента) Экспорт
	
	Возврат ВзаиморасчетыПроведение.ТекстыЗапросовСторнирования(МетаданныеДокумента);
	
КонецФункции

// Устарела. Дополняет текст запроса механизма проверки даты запрета по таблице изменений.
// 
// Параметры:
// 	Запрос - Запрос - используется для установки параметров запроса.
// 
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение:
//		* Ключ - Строка - Имя временной таблицы изменений регистра.
//		* Значение - Строка - Текст запроса.
//	
Функция ТекстыЗапросовКонтрольДатыЗапретаПоТаблицеИзменений(Запрос) Экспорт

	Возврат ВзаиморасчетыПроведение.ТекстыЗапросовКонтрольДатыЗапретаПоТаблицеИзменений(Запрос);
	
КонецФункции

// Устарела. Процедура формирования движений по подчиненным регистрам взаиморасчетов.
//
// Параметры:
//   ТаблицыДляДвижений - Структура - таблицы данных документа
//   Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//   Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	ВзаиморасчетыПроведение.ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ)
	
КонецПроцедуры

// Устарела. Формирует тексты запросов для контроля изменений записанных движений регистров.
//
// Параметры:
//  Запрос - Запрос - запрос, хранящий параметры используемые в списке запросов
//  ТекстыЗапроса - СписокЗначений - список текстов запросов и их имен.
//  Документ - ДокументОбъект - записываемый документ.
//
Процедура ИнициализироватьДанныеКонтроляИзменений(Запрос, ТекстыЗапроса, Документ) Экспорт
	
	ВзаиморасчетыПроведение.ИнициализироватьДанныеКонтроляИзменений(Запрос, ТекстыЗапроса, Документ);
	
КонецПроцедуры

// Устарела. Выводит сообщения пользователю при наличии ошибок контроля изменений записанных движений регистров.
//
// Параметры:
//  РезультатыКонтроля - Структура - таблицы с результатами контроля изменений
//  Документ - ДокументОбъект - записываемый документ
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура СообщитьОРезультатахКонтроляИзменений(РезультатыКонтроля, Документ, Отказ) Экспорт
	
	ВзаиморасчетыПроведение.СообщитьОРезультатахКонтроляИзменений(РезультатыКонтроля, Документ, Отказ);
	
КонецПроцедуры

// Устарела. Возникает перед выполнением записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								используемый для хранения таблиц контроля изменений регистров.
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПередЗаписьюДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	ВзаиморасчетыПроведение.ПередЗаписьюДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ);
	
КонецПроцедуры

// Устарела. Возникает после выполнения записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								используемый для хранения таблиц контроля изменений регистров.
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПослеЗаписиДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	ВзаиморасчетыПроведение.ПослеЗаписиДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область РасчетДатПлатежа_ОфлайнРасчеты
// Устарела. В менеджер временных таблиц помещает таблицу "ТаблицаОстатковКлиентов",
// содержащую в себе даты платежа. Строится по регистру "Расчеты с клиентами по документам".
//
// Параметры:
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Текущий менеджер временных таблиц для помещения таблиц.
//		ДатаОстатков - Дата - Дата остатков.
//
Процедура РассчитатьДатыПлатежаКлиента(МенеджерВременныхТаблиц, ДатаОстатков) Экспорт
	Если ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоДокументам)
		И ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.РасчетыСКлиентами) 
		И НЕ ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам               КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов                          КАК ЗаказКлиента,
		|	Расчеты.Валюта                                  КАК Валюта,
		|	ВЫБОР КОГДА (Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток) > 0
		|		ТОГДА Расчеты.КОплатеОстаток
		|		ИНАЧЕ Расчеты.СуммаОстаток
		|	КОНЕЦ                                           КАК ДолгОстаток,
		|	ВЫБОР КОГДА (Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток) > 0
		|		ТОГДА Расчеты.КОплатеОстаток
		|		ИНАЧЕ Расчеты.СуммаОстаток
		|	КОНЕЦ                                           КАК ДолгОстатокНаКонецПериода,
		|	&ДатаОстатков                                   КАК ДатаПлатежа,
		|	ДОБАВИТЬКДАТЕ(&ДатаОстатков, СЕКУНДА, 1)        КАК Период,
		|	ИСТИНА                                          КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ТаблицаОстатковКлиентов
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(&Граница, ) КАК Расчеты
		|ГДЕ
		|	Расчеты.КОплатеОстаток > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Расчеты.АналитикаУчетаПоПартнерам               КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов                          КАК ЗаказКлиента,
		|	Расчеты.Валюта                                  КАК Валюта,
		|	ВЫБОР КОГДА Расчеты.КОплатеОстаток < 0
		|			ТОГДА Расчеты.СуммаОстаток
		|			ИНАЧЕ ВЫБОР КОГДА (Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток) > 0
		|					ТОГДА Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток
		|					ИНАЧЕ Расчеты.КОплатеОстаток
		|			КОНЕЦ
		|	КОНЕЦ                                           КАК ДолгОстаток,
		|	ВЫБОР КОГДА Расчеты.КОплатеОстаток < 0
		|			ТОГДА Расчеты.СуммаОстаток
		|			ИНАЧЕ ВЫБОР КОГДА (Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток) > 0
		|					ТОГДА Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток
		|					ИНАЧЕ Расчеты.КОплатеОстаток
		|			КОНЕЦ
		|	КОНЕЦ                                           КАК ДолгОстатокНаКонецПериода,
		|	&ДатаОстатков                                   КАК ДатаПлатежа,
		|	ДОБАВИТЬКДАТЕ(&ДатаОстатков, СЕКУНДА, 1)        КАК Период,
		|	ЛОЖЬ                                            КАК ПросроченнаяЗадолженность
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(&Граница, ) КАК Расчеты
		|ГДЕ
		|	Расчеты.КОплатеОстаток <= 0
		|;
		|/////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	1
		|ПОМЕСТИТЬ ТаблицаОтгрузокКлиентов
		|;
		|/////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	1
		|ПОМЕСТИТЬ ТаблицаПериодовКлиентов
		|");
		
		Параметры = Новый Массив(2);
		Параметры[0] = ДатаОстатков;
		Параметры[1] = ВидГраницы.Включая;
		Граница = Новый(Тип("Граница"),Параметры);
		
		Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
		Запрос.УстановитьПараметр("Граница", Граница);
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
 		Запрос.Текст = "
		|УНИЧТОЖИТЬ ТаблицаПериодовКлиентов
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОтгрузокКлиентов
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам                  КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов                             КАК ЗаказКлиента,
		|	Расчеты.Валюта                                     КАК Валюта,
		|	МАКСИМУМ(НАЧАЛОПЕРИОДА(Расчеты.ДатаПлатежа, День)) КАК ДатаПлатежа,
		|	МАКСИМУМ(Расчеты.Период)                           КАК Период,
		|	ТаблицаОстатков.ПросроченнаяЗадолженность          КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ТаблицаПериодовКлиентов
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковКлиентов КАК ТаблицаОстатков
		|		ПО Расчеты.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		|			И Расчеты.ОбъектРасчетов = ТаблицаОстатков.ЗаказКлиента
		|			И Расчеты.Валюта = ТаблицаОстатков.Валюта
		|			И ТаблицаОстатков.ДолгОстаток <> 0
		|ГДЕ
		|	Расчеты.Активность
		|	И Расчеты.Период <= &ДатаОстатков
		|	И Расчеты.Период < ТаблицаОстатков.Период
		|	И (Расчеты.КОплате <> 0 ИЛИ Расчеты.КОтгрузке <> 0)
		|	И ТаблицаОстатков.ПросроченнаяЗадолженность
		|
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов,
		|	Расчеты.Валюта,
		|	ТаблицаОстатков.ПросроченнаяЗадолженность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Расчеты.АналитикаУчетаПоПартнерам                  КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов                             КАК ЗаказКлиента,
		|	Расчеты.Валюта                                     КАК Валюта,
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(Расчеты.ДатаПлатежа, День))  КАК ДатаПлатежа,
		|	МИНИМУМ(Расчеты.Период)                            КАК Период,
		|	ТаблицаОстатков.ПросроченнаяЗадолженность          КАК ПросроченнаяЗадолженность
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковКлиентов КАК ТаблицаОстатков
		|		ПО Расчеты.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		|			И Расчеты.ОбъектРасчетов = ТаблицаОстатков.ЗаказКлиента
		|			И Расчеты.Валюта = ТаблицаОстатков.Валюта
		|			И ТаблицаОстатков.ДолгОстаток <> 0
		|ГДЕ
		|	(Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИЛИ (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И Расчеты.КОплате < 0))
		|	И Расчеты.Активность
		|	И Расчеты.Период > &ДатаОстатков
		|	И Расчеты.Период > ТаблицаОстатков.Период
		|	И (Расчеты.КОплате <> 0 ИЛИ Расчеты.КОтгрузке <> 0)
		|	И НЕ ТаблицаОстатков.ПросроченнаяЗадолженность
		|
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов,
		|	Расчеты.Валюта,
		|	ТаблицаОстатков.ПросроченнаяЗадолженность
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Периоды.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
		|	Периоды.ЗаказКлиента                          КАК ЗаказКлиента,
		|	Периоды.Валюта                                КАК Валюта,
		|	Периоды.Период                                КАК Период,
		|	НАЧАЛОПЕРИОДА(ВЫБОР КОГДА Периоды.ЗаказКлиента.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
		|		И Расчеты.Регистратор ССЫЛКА Документ.ГрафикИсполненияДоговора
		|		ТОГДА Расчеты.ДатаПлатежа
		|		КОГДА Расчеты.ДатаПлатежа = ДАТАВРЕМЯ(1,1,1)
		|		ТОГДА Расчеты.Период
		|		ИНАЧЕ Периоды.ДатаПлатежа
		|	КОНЕЦ, ДЕНЬ)                                  КАК ДатаПлатежа,
		|	СУММА(ВЫБОР КОГДА ЕСТЬNULL(Расчеты.КОплате, 0) < 0
		|			ТОГДА 0 - Расчеты.КОплате
		|			ИНАЧЕ ЕСТЬNULL(Расчеты.КОплате, 0)
		|	КОНЕЦ)                                        КАК Долг,
		|	Периоды.ПросроченнаяЗадолженность             КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ТаблицаОтгрузокКлиентов
		|ИЗ
		|	ТаблицаПериодовКлиентов КАК Периоды
		|		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК Расчеты
		|	ПО Периоды.АналитикаУчетаПоПартнерам   = Расчеты.АналитикаУчетаПоПартнерам
		|		И Периоды.ЗаказКлиента             = Расчеты.ОбъектРасчетов
		|		И Периоды.Валюта                   = Расчеты.Валюта
		|		И Расчеты.Активность
		|		И Расчеты.Период = Периоды.Период
		|		И (Расчеты.КОплате <> 0 ИЛИ Расчеты.КОтгрузке <> 0)
		|		И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ИЛИ (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И Расчеты.КОплате < 0))
		|СГРУППИРОВАТЬ ПО
		|	Периоды.АналитикаУчетаПоПартнерам,
		|	Периоды.ЗаказКлиента,
		|	Периоды.Валюта,
		|	Периоды.Период,
		|	НАЧАЛОПЕРИОДА(ВЫБОР КОГДА Периоды.ЗаказКлиента.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
		|		И Расчеты.Регистратор ССЫЛКА Документ.ГрафикИсполненияДоговора
		|		ТОГДА Расчеты.ДатаПлатежа
		|		КОГДА Расчеты.ДатаПлатежа = ДАТАВРЕМЯ(1,1,1)
		|		ТОГДА Расчеты.Период
		|		ИНАЧЕ Периоды.ДатаПлатежа
		|	КОНЕЦ, ДЕНЬ),
		|	Периоды.ПросроченнаяЗадолженность
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.АналитикаУчетаПоПартнерам                   КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ЗаказКлиента                                КАК ЗаказКлиента,
		|	Остатки.Валюта                                      КАК Валюта,
		|	ВЫБОР КОГДА Остатки.ДолгОстаток > ЕСТЬNULL(Отгрузки.Долг, 0)
		|			ТОГДА Остатки.ДолгОстаток - ЕСТЬNULL(Отгрузки.Долг, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ                                               КАК НовыйДолгОстаток,
		|	ВЫБОР КОГДА ЕСТЬNULL(Отгрузки.Долг, 0) = 0
		|		ТОГДА Остатки.ДолгОстатокНаКонецПериода
		|		ИНАЧЕ ВЫБОР КОГДА Остатки.ДолгОстаток > Отгрузки.Долг
		|			ТОГДА Отгрузки.Долг
		|			ИНАЧЕ Остатки.ДолгОстаток
		|		КОНЕЦ
		|	КОНЕЦ                                               КАК ДолгОстатокНаКонецПериода,
		|	Отгрузки.Период                                     КАК Период,
		|	ЕСТЬNULL(Отгрузки.ДатаПлатежа, Остатки.ДатаПлатежа) КАК ДатаПлатежа,
		|	Остатки.ПросроченнаяЗадолженность                   КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ НовыеОстаткиКлиентов
		|ИЗ
		|	ТаблицаОстатковКлиентов КАК Остатки
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтгрузокКлиентов КАК Отгрузки
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Отгрузки.АналитикаУчетаПоПартнерам
		|		И Остатки.ЗаказКлиента = Отгрузки.ЗаказКлиента
		|		И Остатки.Валюта  = Отгрузки.Валюта
		|		И Остатки.ПросроченнаяЗадолженность = Отгрузки.ПросроченнаяЗадолженность
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОстатковКлиентов
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.АналитикаУчетаПоПартнерам    КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ЗаказКлиента                 КАК ЗаказКлиента,
		|	Остатки.Валюта                       КАК Валюта,
		|	Остатки.Период                       КАК Период,
		|	Остатки.ДатаПлатежа                  КАК ДатаПлатежа,
		|	Остатки.НовыйДолгОстаток             КАК ДолгОстаток,
		|	Остатки.ДолгОстатокНаКонецПериода    КАК ДолгОстатокНаКонецПериода,
		|	Остатки.ПросроченнаяЗадолженность    КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ТаблицаОстатковКлиентов
		|ИЗ
		|	НовыеОстаткиКлиентов КАК Остатки
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаПоПартнерам,
		|	ЗаказКлиента,
		|	Валюта
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НовыеОстаткиКлиентов
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	1
		|ИЗ ТаблицаПериодовКлиентов
		|";
		
		Результат = Запрос.Выполнить();
		Счетчик = 0;
		МаксимальноеКоличествоИтераций = 1000;
		Пока Не Результат.Пустой() Цикл 
			Результат = Запрос.Выполнить();
			Счетчик = Счетчик + 1;
			Если Счетчик >= МаксимальноеКоличествоИтераций Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ЗаказКлиента                      КАК ЗаказКлиента,
		|	Расчеты.РасчетныйДокумент                 КАК РасчетныйДокумент,
		|	Расчеты.Валюта                            КАК Валюта,
		|	ТаблицаОстатков.ДатаПлатежа               КАК ДатаПлатежа,
		|	ТаблицаОстатков.ДолгОстатокНаКонецПериода КАК Долг
		|ПОМЕСТИТЬ ТаблицаОстатковКлиентовПоДокументам
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(&Граница, ) КАК Расчеты
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковКлиентов КАК ТаблицаОстатков
		|	ПО Расчеты.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		|		И Расчеты.ЗаказКлиента = ТаблицаОстатков.ЗаказКлиента
		|		И Расчеты.Валюта = ТаблицаОстатков.Валюта
		|ГДЕ
		|	Расчеты.ДолгОстаток > 0
		|;
		|//////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОстатковКлиентов
		|;
		|//////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ЗаказКлиента              КАК ЗаказКлиента,
		|	Расчеты.РасчетныйДокумент         КАК РасчетныйДокумент,
		|	Расчеты.Валюта                    КАК Валюта,
		|	Расчеты.ДатаПлатежа               КАК ДатаПлатежа,
		|	Расчеты.Долг                      КАК КОплате,
		|	Расчеты.Долг                      КАК ДолгОстаток
		|ПОМЕСТИТЬ ТаблицаОстатковКлиентов
		|ИЗ
		|	ТаблицаОстатковКлиентовПоДокументам КАК Расчеты
		|";
		Запрос.Выполнить();
	Иначе
		Запрос = Новый Запрос("
		 |ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) КАК АналитикаУчетаПоПартнерам,
		|	Неопределено                                                     КАК ЗаказКлиента,
		|	Неопределено                                                     КАК РасчетныйДокумент,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)                         КАК Валюта,
		|	ДАТАВРЕМЯ(1,1,1)                                                 КАК ДатаПлатежа,
		|	0                                                                КАК КОплате,
		|	0                                                                КАК ДолгОстаток
		|ПОМЕСТИТЬ ТаблицаОстатковКлиентов");
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();
	КонецЕсли;
КонецПроцедуры

// Устарела. В менеджер временных таблиц помещает таблицу "ТаблицаОстатковПоставщиков",
// содержащую в себе даты платежа. Строится по регистру "Расчеты с поставщиками по документам".
//
// Параметры:
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Текущий менеджер временных таблиц для помещения таблиц.
//		ДатаОстатков - Дата - Дата остатков.
//
Процедура РассчитатьДатыПлатежаПоставщика(МенеджерВременныхТаблиц, ДатаОстатков) Экспорт
	Если ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоДокументам)
		И ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.РасчетыСПоставщиками)
		И НЕ ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	Расчеты.АналитикаУчетаПоПартнерам        КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов                   КАК ЗаказПоставщику,
		|	Расчеты.Валюта                           КАК Валюта,
		|	-Расчеты.КОплатеОстаток                  КАК КОплатеОстаток,
		|	-Расчеты.КОплатеОстаток                  КАК КОплатеОстатокНаКонецПериода,
		|	&ДатаОстатков                            КАК ДатаПлатежа,
		|	ДОБАВИТЬКДАТЕ(&ДатаОстатков, СЕКУНДА, 1) КАК Период,
		|	ИСТИНА                                   КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ТаблицаОстатковПоставщиков
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(&Граница, ) КАК Расчеты
		|ГДЕ
		|	Расчеты.КОплатеОстаток < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Расчеты.АналитикаУчетаПоПартнерам               КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов                          КАК ЗаказПоставщику,
		|	Расчеты.Валюта                                  КАК Валюта,
		|	(Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток) КАК КОплатеОстаток,
		|	(Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток) КАК КОплатеОстатокНаКонецПериода,
		|	&ДатаОстатков                                   КАК ДатаПлатежа,
		|	ДОБАВИТЬКДАТЕ(&ДатаОстатков, СЕКУНДА, 1)        КАК Период,
		|	ЛОЖЬ                                            КАК ПросроченнаяЗадолженность
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(&Граница, ) КАК Расчеты
		|ГДЕ
		|	Расчеты.КОплатеОстаток >= 0 И Расчеты.СуммаОстаток <> 0
		|	И Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток > 0
		|;
		|/////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	1
		|ПОМЕСТИТЬ ТаблицаПоступленийПоставщиков
		|;
		|/////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	1
		|ПОМЕСТИТЬ ТаблицаПериодовПоставщиков
		|");
		
		Параметры = Новый Массив(2);
		Параметры[0] = ДатаОстатков;
		Параметры[1] = ВидГраницы.Включая;
		Граница = Новый(Тип("Граница"),Параметры);
		
		Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
		Запрос.УстановитьПараметр("Граница", Граница);
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|УНИЧТОЖИТЬ ТаблицаПериодовПоставщиков
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаПоступленийПоставщиков
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам                  КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов                             КАК ЗаказПоставщику,
		|	Расчеты.Валюта                                     КАК Валюта,
		|	МАКСИМУМ(НАЧАЛОПЕРИОДА(Расчеты.ДатаПлатежа, День)) КАК ДатаПлатежа,
		|	МАКСИМУМ(Расчеты.Период)                           КАК Период,
		|	ТаблицаОстатков.ПросроченнаяЗадолженность          КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ТаблицаПериодовПоставщиков
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковПоставщиков КАК ТаблицаОстатков
		|		ПО Расчеты.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		|			И Расчеты.ОбъектРасчетов = ТаблицаОстатков.ЗаказПоставщику
		|			И Расчеты.Валюта = ТаблицаОстатков.Валюта
		|			И ТаблицаОстатков.КОплатеОстаток <> 0
		|ГДЕ
		|	Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И Расчеты.Активность
		|	И Расчеты.Период <= &ДатаОстатков
		|	И Расчеты.Период < ТаблицаОстатков.Период
		|	И (Расчеты.КОплате <> 0 ИЛИ Расчеты.КПоступлению <> 0)
		|	И ТаблицаОстатков.ПросроченнаяЗадолженность
		|
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов,
		|	Расчеты.Валюта,
		|	ТаблицаОстатков.ПросроченнаяЗадолженность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Расчеты.АналитикаУчетаПоПартнерам                  КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов                             КАК ЗаказПоставщику,
		|	Расчеты.Валюта                                     КАК Валюта,
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(Расчеты.ДатаПлатежа, День))  КАК ДатаПлатежа,
		|	МАКСИМУМ(Расчеты.Период)                           КАК Период,
		|	ТаблицаОстатков.ПросроченнаяЗадолженность          КАК ПросроченнаяЗадолженность
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковПоставщиков КАК ТаблицаОстатков
		|		ПО Расчеты.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		|			И Расчеты.ОбъектРасчетов = ТаблицаОстатков.ЗаказПоставщику
		|			И Расчеты.Валюта = ТаблицаОстатков.Валюта
		|			И ТаблицаОстатков.КОплатеОстаток <> 0
		|ГДЕ
		|	Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И Расчеты.Активность
		|	И Расчеты.Период > &ДатаОстатков
		|	И Расчеты.Период > ТаблицаОстатков.Период
		|	И (Расчеты.КОплате <> 0 ИЛИ Расчеты.КПоступлению <> 0)
		|	И НЕ ТаблицаОстатков.ПросроченнаяЗадолженность
		|
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов,
		|	Расчеты.Валюта,
		|	ТаблицаОстатков.ПросроченнаяЗадолженность
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Периоды.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
		|	Периоды.ЗаказПоставщику                       КАК ЗаказПоставщику,
		|	Периоды.Валюта                                КАК Валюта,
		|	Периоды.Период                                КАК Период,
		|	ВЫБОР КОГДА Периоды.ЗаказПоставщику.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
		|		И Расчеты.Регистратор ССЫЛКА Документ.ГрафикИсполненияДоговора
		|		ТОГДА Расчеты.ДатаПлатежа
		|		КОГДА Расчеты.ДатаПлатежа = ДАТАВРЕМЯ(1,1,1)
		|		ТОГДА Расчеты.Период
		|		ИНАЧЕ Периоды.ДатаПлатежа
		|	КОНЕЦ                                         КАК ДатаПлатежа,
		|	СУММА(ВЫБОР КОГДА ЕСТЬNULL(Расчеты.КОплате, 0) < 0
		|			ТОГДА 0 - Расчеты.КОплате
		|			ИНАЧЕ ЕСТЬNULL(Расчеты.КОплате, 0)
		|	КОНЕЦ)                                        КАК КОплате,
		|	Периоды.ПросроченнаяЗадолженность             КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ТаблицаПоступленийПоставщиков
		|ИЗ
		|	ТаблицаПериодовПоставщиков КАК Периоды
		|		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
		|	ПО Периоды.АналитикаУчетаПоПартнерам   = Расчеты.АналитикаУчетаПоПартнерам
		|		И Периоды.ЗаказПоставщику          = Расчеты.ОбъектРасчетов
		|		И Периоды.Валюта                   = Расчеты.Валюта
		|		И Расчеты.Активность
		|		И Расчеты.Период = Периоды.Период
		|		И (Расчеты.КОплате <> 0 ИЛИ Расчеты.КПоступлению <> 0)
		|		И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|СГРУППИРОВАТЬ ПО
		|	Периоды.АналитикаУчетаПоПартнерам,
		|	Периоды.ЗаказПоставщику,
		|	Периоды.Валюта,
		|	Периоды.Период,
		|	ВЫБОР КОГДА Периоды.ЗаказПоставщику.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
		|		И Расчеты.Регистратор ССЫЛКА Документ.ГрафикИсполненияДоговора
		|		ТОГДА Расчеты.ДатаПлатежа
		|		КОГДА Расчеты.ДатаПлатежа = ДАТАВРЕМЯ(1,1,1)
		|		ТОГДА Расчеты.Период
		|		ИНАЧЕ Периоды.ДатаПлатежа
		|	КОНЕЦ,
		|	Периоды.ПросроченнаяЗадолженность
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ЗаказПоставщику                                КАК ЗаказПоставщику,
		|	Остатки.Валюта                                         КАК Валюта,
		|	ВЫБОР КОГДА Остатки.КОплатеОстаток > ЕСТЬNULL(Поступления.КОплате, 0)
		|			ТОГДА Остатки.КОплатеОстаток - ЕСТЬNULL(Поступления.КОплате, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ                                                  КАК НовыйКОплатеОстаток,
		|	ВЫБОР КОГДА ЕСТЬNULL(Поступления.КОплате, 0) = 0
		|		ТОГДА Остатки.КОплатеОстатокНаКонецПериода
		|		ИНАЧЕ ВЫБОР КОГДА Остатки.КОплатеОстатокНаКонецПериода > Поступления.КОплате
		|			ТОГДА Поступления.КОплате
		|			ИНАЧЕ Остатки.КОплатеОстатокНаКонецПериода
		|		КОНЕЦ
		|	КОНЕЦ                                                  КАК КОплатеОстатокНаКонецПериода,
		|	Поступления.Период                                     КАК Период,
		|	ЕСТЬNULL(Поступления.ДатаПлатежа, Остатки.ДатаПлатежа) КАК ДатаПлатежа,
		|	Остатки.ПросроченнаяЗадолженность                      КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ НовыеОстаткиПоставщиков
		|ИЗ
		|	ТаблицаОстатковПоставщиков КАК Остатки
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоступленийПоставщиков КАК Поступления
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Поступления.АналитикаУчетаПоПартнерам
		|		И Остатки.ЗаказПоставщику = Поступления.ЗаказПоставщику
		|		И Остатки.Валюта  = Поступления.Валюта
		|		И Остатки.ПросроченнаяЗадолженность = Поступления.ПросроченнаяЗадолженность
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОстатковПоставщиков
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.АналитикаУчетаПоПартнерам    КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ЗаказПоставщику              КАК ЗаказПоставщику,
		|	Остатки.Валюта                       КАК Валюта,
		|	Остатки.Период                       КАК Период,
		|	Остатки.ДатаПлатежа                  КАК ДатаПлатежа,
		|	Остатки.НовыйКОплатеОстаток          КАК КОплатеОстаток,
		|	Остатки.КОплатеОстатокНаКонецПериода КАК КОплатеОстатокНаКонецПериода,
		|	Остатки.ПросроченнаяЗадолженность    КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ТаблицаОстатковПоставщиков
		|ИЗ
		|	НовыеОстаткиПоставщиков КАК Остатки
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаПоПартнерам,
		|	ЗаказПоставщику,
		|	Валюта
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НовыеОстаткиПоставщиков
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	1
		|ИЗ ТаблицаПериодовПоставщиков
		|";
		
		Результат = Запрос.Выполнить();
		Счетчик = 0;
		МаксимальноеКоличествоИтераций = 1000;
		Пока Не Результат.Пустой() Цикл 
			Результат = Запрос.Выполнить();
			Счетчик = Счетчик + 1;
			Если Счетчик >= МаксимальноеКоличествоИтераций Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам            КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ЗаказПоставщику                      КАК ЗаказПоставщику,
		|	Расчеты.РасчетныйДокумент                    КАК РасчетныйДокумент,
		|	Расчеты.Валюта                               КАК Валюта,
		|	ТаблицаОстатков.ДатаПлатежа                  КАК ДатаПлатежа,
		|	ТаблицаОстатков.КОплатеОстатокНаКонецПериода КАК КОплате
		|ПОМЕСТИТЬ ТаблицаОстатковПоставщиковПоДокументам
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(&Граница, ) КАК Расчеты
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковПоставщиков КАК ТаблицаОстатков
		|	ПО Расчеты.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		|		И Расчеты.ЗаказПоставщику = ТаблицаОстатков.ЗаказПоставщику
		|		И Расчеты.Валюта = ТаблицаОстатков.Валюта
		|ГДЕ
		|	Расчеты.ДолгОстаток < 0
		|;
		|//////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОстатковПоставщиков
		|;
		|//////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ЗаказПоставщику           КАК ЗаказПоставщику,
		|	Расчеты.РасчетныйДокумент         КАК РасчетныйДокумент,
		|	Расчеты.Валюта                    КАК Валюта,
		|	Расчеты.ДатаПлатежа               КАК ДатаПлатежа,
		|	Расчеты.КОплате                   КАК КОплате,
		|	Расчеты.КОплате                   КАК ДолгОстаток
		|ПОМЕСТИТЬ ТаблицаОстатковПоставщиков
		|ИЗ
		|	ТаблицаОстатковПоставщиковПоДокументам КАК Расчеты
		|";
		Запрос.Выполнить();
	Иначе
		Запрос = Новый Запрос("
		 |ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) КАК АналитикаУчетаПоПартнерам,
		|	Неопределено                                                     КАК ЗаказПоставщику,
		|	Неопределено                                                     КАК РасчетныйДокумент,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)                         КАК Валюта,
		|	ДАТАВРЕМЯ(1,1,1)                                                 КАК ДатаПлатежа,
		|	0                                                                КАК КОплате,
		|	0                                                                КАК ДолгОстаток
		|ПОМЕСТИТЬ ТаблицаОстатковПоставщиков");
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();
	КонецЕсли;
КонецПроцедуры

// Устарела. В менеджер временных таблиц помещает таблицу содержащую в себе даты платежа.
// Строится по регистру "Расчеты с клиентами".
// Параметры:
//	ВременныеТаблицы - МенеджерВременныхТаблиц - Менеджер временных таблиц, в который будет помещен результат расчета.
//	ДатаОстатков - Дата - Период на который выполняется расчет дат платежа.
Процедура РассчитатьОперативныеДатыПлатежаКлиента(ВременныеТаблицы, ДатаОстатков) Экспорт
	Если ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.РасчетыСКлиентами) Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам        КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов                   КАК ЗаказКлиента,
		|	Расчеты.Валюта                           КАК Валюта,
		|	Расчеты.КОплатеОстаток                   КАК КОплатеОстаток,
		|	Расчеты.КОплатеОстаток                   КАК КОплатеОстатокНаКонецПериода,
		|	&ДатаОстатков                            КАК ДатаПлатежа,
		|	ДОБАВИТЬКДАТЕ(&ДатаОстатков, СЕКУНДА, 1) КАК Период
		|ПОМЕСТИТЬ ТаблицаОстатковКлиентовКОплате
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(&ДатаОстатков, ) КАК Расчеты
		|;
		|/////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	1
		|ПОМЕСТИТЬ ТаблицаПериодовКлиентовКОплате
		|");
		Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
		Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|УНИЧТОЖИТЬ ТаблицаПериодовКлиентовКОплате
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов                        КАК ЗаказКлиента,
		|	Расчеты.Валюта                                КАК Валюта,
		|	МАКСИМУМ(Расчеты.ДатаПлатежа)                 КАК ДатаПлатежа,
		|	МАКСИМУМ(НАЧАЛОПЕРИОДА(Расчеты.Период, День)) КАК Период
		|ПОМЕСТИТЬ ТаблицаПериодовКлиентовКОплате
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
		|		
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковКлиентовКОплате КАК ТаблицаОстатков
		|	ПО Расчеты.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		|		И Расчеты.ОбъектРасчетов = ТаблицаОстатков.ЗаказКлиента
		|		И Расчеты.Валюта = ТаблицаОстатков.Валюта
		|		И ТаблицаОстатков.КОплатеОстаток <> 0
		|ГДЕ
		|	Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И Расчеты.Активность
		|	И Расчеты.Период <= &ДатаОстатков
		|	И Расчеты.Период < ТаблицаОстатков.Период
		|	И Расчеты.КОплате <> 0
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов,
		|	Расчеты.Валюта
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Периоды.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
		|	Периоды.ЗаказКлиента                          КАК ЗаказКлиента,
		|	Периоды.Валюта                                КАК Валюта,
		|	Периоды.Период                                КАК Период,
		|	Периоды.ДатаПлатежа                           КАК ДатаПлатежа,
		|	СУММА(ЕСТЬNULL(Расчеты.КОплате, 0))      КАК КОплате
		|ПОМЕСТИТЬ ТаблицаОтгрузокКлиентовКОплате
		|ИЗ
		|	ТаблицаПериодовКлиентовКОплате КАК Периоды
		|		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК Расчеты
		|	ПО Периоды.АналитикаУчетаПоПартнерам   = Расчеты.АналитикаУчетаПоПартнерам
		|		И Периоды.ЗаказКлиента             = Расчеты.ОбъектРасчетов
		|		И Периоды.Валюта                   = Расчеты.Валюта
		|		И Периоды.ДатаПлатежа              = Расчеты.ДатаПлатежа
		|		И Расчеты.Активность
		|		И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|		И (Расчеты.Период МЕЖДУ Периоды.Период И КОНЕЦПЕРИОДА(Периоды.Период, ДЕНЬ))
		|СГРУППИРОВАТЬ ПО
		|	Периоды.АналитикаУчетаПоПартнерам,
		|	Периоды.ЗаказКлиента,
		|	Периоды.Валюта,
		|	Периоды.Период,
		|	Периоды.ДатаПлатежа
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ЗаказКлиента                      КАК ЗаказКлиента,
		|	Остатки.Валюта                            КАК Валюта,
		|	ВЫБОР КОГДА Остатки.КОплатеОстаток > ЕСТЬNULL(Отгрузки.КОплате, 0)
		|			ТОГДА Остатки.КОплатеОстаток - ЕСТЬNULL(Отгрузки.КОплате, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ                                     КАК НовыйКОплатеОстаток,
		|	Остатки.КОплатеОстатокНаКонецПериода КАК КОплатеОстатокНаКонецПериода,
		|	Отгрузки.Период                           КАК Период,
		|	ЕСТЬNULL(Отгрузки.ДатаПлатежа, Остатки.ДатаПлатежа) КАК ДатаПлатежа
		|ПОМЕСТИТЬ НовыеОстаткиКлиентовКОплате
		|ИЗ
		|	ТаблицаОстатковКлиентовКОплате КАК Остатки
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтгрузокКлиентовКОплате КАК Отгрузки
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Отгрузки.АналитикаУчетаПоПартнерам
		|		И Остатки.ЗаказКлиента = Отгрузки.ЗаказКлиента
		|		И Остатки.Валюта  = Отгрузки.Валюта
		|		И Остатки.КОплатеОстаток <> 0
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОстатковКлиентовКОплате
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОтгрузокКлиентовКОплате
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Остатки.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ЗаказКлиента                      КАК ЗаказКлиента,
		|	Остатки.ЗаказКлиента.Объект               КАК Объект,
		|	Остатки.Валюта                            КАК Валюта,
		|	Остатки.Период                            КАК Период,
		|	Остатки.ДатаПлатежа                       КАК ДатаПлатежа,
		|	Остатки.НовыйКОплатеОстаток          КАК КОплатеОстаток,
		|	Остатки.НовыйКОплатеОстаток          КАК КОплате,
		|	Остатки.КОплатеОстатокНаКонецПериода КАК КОплатеОстатокНаКонецПериода
		|ПОМЕСТИТЬ ТаблицаОстатковКлиентовКОплате
		|ИЗ
		|	НовыеОстаткиКлиентовКОплате КАК Остатки
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаПоПартнерам,
		|	ЗаказКлиента,
		|	Валюта
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НовыеОстаткиКлиентовКОплате
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	1
		|ИЗ ТаблицаПериодовКлиентовКОплате
		|";
		
		Результат = Запрос.Выполнить();
		Пока Не Результат.Пустой() Цикл 
			Результат = Запрос.Выполнить();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Устарела. В менеджер временных таблиц помещает таблицу содержащую в себе даты платежа.
// Строится по регистру "Расчеты с поставщиками".
// Параметры:
//	ВременныеТаблицы - МенеджерВременныхТаблиц - Менеджер временных таблиц, в который будет помещен результат расчета.
//	ДатаОстатков - Дата - Период на который выполняется расчет дат платежа.
Процедура РассчитатьОперативныеДатыПлатежаПоставщика(ВременныеТаблицы, ДатаОстатков) Экспорт
	Если ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.РасчетыСПоставщиками) Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам        КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов                   КАК ЗаказПоставщику,
		|	Расчеты.Валюта                           КАК Валюта,
		|	Расчеты.КОплатеОстаток                   КАК КОплатеОстаток,
		|	Расчеты.КОплатеОстаток                   КАК КОплатеОстатокНаКонецПериода,
		|	&ДатаОстатков                            КАК ДатаПлатежа,
		|	ДОБАВИТЬКДАТЕ(&ДатаОстатков, СЕКУНДА, 1) КАК Период
		|ПОМЕСТИТЬ ТаблицаОстатковПоставщиковКОплате
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(&ДатаОстатков, ) КАК Расчеты
		|;
		|/////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	1
		|ПОМЕСТИТЬ ТаблицаПериодовПоставщиковКОплате
		|");
		Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
		Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|УНИЧТОЖИТЬ ТаблицаПериодовПоставщиковКОплате
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов                        КАК ЗаказПоставщику,
		|	Расчеты.Валюта                                КАК Валюта,
		|	МАКСИМУМ(Расчеты.ДатаПлатежа)                 КАК ДатаПлатежа,
		|	МАКСИМУМ(НАЧАЛОПЕРИОДА(Расчеты.Период, День)) КАК Период
		|ПОМЕСТИТЬ ТаблицаПериодовПоставщиковКОплате
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
		|		
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковПоставщиковКОплате КАК ТаблицаОстатков
		|	ПО Расчеты.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		|		И Расчеты.ОбъектРасчетов = ТаблицаОстатков.ЗаказПоставщику
		|		И Расчеты.Валюта = ТаблицаОстатков.Валюта
		|		И ТаблицаОстатков.КОплатеОстаток <> 0
		|ГДЕ
		|	Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И Расчеты.Активность
		|	И Расчеты.Период <= &ДатаОстатков
		|	И Расчеты.Период < ТаблицаОстатков.Период
		|	И Расчеты.КОплате <> 0
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов,
		|	Расчеты.Валюта
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Периоды.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
		|	Периоды.ЗаказПоставщику                       КАК ЗаказПоставщику,
		|	Периоды.Валюта                                КАК Валюта,
		|	Периоды.Период                                КАК Период,
		|	Периоды.ДатаПлатежа                           КАК ДатаПлатежа,
		|	СУММА(ЕСТЬNULL(Расчеты.КОплате, 0))           КАК КОплате
		|ПОМЕСТИТЬ ТаблицаОтгрузокПоставщиковКОплате
		|ИЗ
		|	ТаблицаПериодовПоставщиковКОплате КАК Периоды
		|		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
		|	ПО Периоды.АналитикаУчетаПоПартнерам   = Расчеты.АналитикаУчетаПоПартнерам
		|		И Периоды.ЗаказПоставщику          = Расчеты.ОбъектРасчетов
		|		И Периоды.ДатаПлатежа              = Расчеты.ДатаПлатежа
		|		И Периоды.Валюта                   = Расчеты.Валюта
		|		И Расчеты.Активность
		|		И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|		И (Расчеты.Период МЕЖДУ Периоды.Период И КОНЕЦПЕРИОДА(Периоды.Период, ДЕНЬ))
		|СГРУППИРОВАТЬ ПО
		|	Периоды.АналитикаУчетаПоПартнерам,
		|	Периоды.ЗаказПоставщику,
		|	Периоды.Валюта,
		|	Периоды.Период,
		|	Периоды.ДатаПлатежа
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ЗаказПоставщику                   КАК ЗаказПоставщику,
		|	Остатки.Валюта                            КАК Валюта,
		|	ВЫБОР КОГДА Остатки.КОплатеОстаток > ЕСТЬNULL(Отгрузки.КОплате, 0)
		|			ТОГДА Остатки.КОплатеОстаток - ЕСТЬNULL(Отгрузки.КОплате, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ                                     КАК НовыйКОплатеОстаток,
		|	Остатки.КОплатеОстатокНаКонецПериода      КАК КОплатеОстатокНаКонецПериода,
		|	Отгрузки.Период                           КАК Период,
		|	ЕСТЬNULL(Отгрузки.ДатаПлатежа, Остатки.ДатаПлатежа) КАК ДатаПлатежа
		|ПОМЕСТИТЬ НовыеОстаткиПоставщиковКОплате
		|ИЗ
		|	ТаблицаОстатковПоставщиковКОплате КАК Остатки
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтгрузокПоставщиковКОплате КАК Отгрузки
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Отгрузки.АналитикаУчетаПоПартнерам
		|		И Остатки.ЗаказПоставщику = Отгрузки.ЗаказПоставщику
		|		И Остатки.Валюта  = Отгрузки.Валюта
		|		И Остатки.КОплатеОстаток <> 0
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОстатковПоставщиковКОплате
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОтгрузокПоставщиковКОплате
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ЗаказПоставщику                   КАК ЗаказПоставщику,
		|	Остатки.ЗаказПоставщику.Объект            КАК Объект,
		|	Остатки.Валюта                            КАК Валюта,
		|	Остатки.Период                            КАК Период,
		|	Остатки.ДатаПлатежа                       КАК ДатаПлатежа,
		|	Остатки.НовыйКОплатеОстаток          КАК КОплатеОстаток,
		|	Остатки.НовыйКОплатеОстаток          КАК КОплате,
		|	Остатки.КОплатеОстатокНаКонецПериода КАК КОплатеОстатокНаКонецПериода
		|ПОМЕСТИТЬ ТаблицаОстатковПоставщиковКОплате
		|ИЗ
		|	НовыеОстаткиПоставщиковКОплате КАК Остатки
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаПоПартнерам,
		|	ЗаказПоставщику,
		|	Валюта
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НовыеОстаткиПоставщиковКОплате
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	1
		|ИЗ ТаблицаПериодовПоставщиковКОплате
		|";
		
		Результат = Запрос.Выполнить();
		Пока Не Результат.Пустой() Цикл 
			Результат = Запрос.Выполнить();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПорядокРасчетов

// Устарела.
// Возвращает порядок расчетов по соглашению/договору, указанным в объекте.
//
// Параметры:
//	Объект - ДокументОбъект, Структура - Документ, по которому надо получить порядок расчетов.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.ПорядокРасчетов - Порядок расчетов по умолчанию.
//
Функция ПорядокРасчетовПоУмолчанию(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураОбъекта = Новый Структура("Соглашение, Договор");
	ЗаполнитьЗначенияСвойств(СтруктураОбъекта, Объект);
	
	Если ЗначениеЗаполнено(СтруктураОбъекта.Соглашение) Тогда
		РеквизитыСоглашения = ВзаиморасчетыСлужебный.РеквизитыСоглашения(СтруктураОбъекта.Соглашение);
		Если РеквизитыСоглашения.ИспользуютсяДоговорыКонтрагентов = Истина И ЗначениеЗаполнено(СтруктураОбъекта.Договор) Тогда
			ПорядокРасчетовПоДокументу = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураОбъекта.Договор, "ПорядокРасчетов");
		ИначеЕсли РеквизитыСоглашения.ИспользуютсяДоговорыКонтрагентов = Ложь Тогда
			ПорядокРасчетовПоДокументу = РеквизитыСоглашения.ПорядокРасчетов;
		Иначе
			ПорядокРасчетовПоДокументу = Перечисления.ПорядокРасчетов.ПоЗаказам;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(СтруктураОбъекта.Договор) Тогда
		ПорядокРасчетовПоДокументу = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураОбъекта.Договор, "ПорядокРасчетов");
	Иначе
		ПорядокРасчетовПоДокументу = Перечисления.ПорядокРасчетов.ПоЗаказам;
	КонецЕсли;
	
	Возврат ПорядокРасчетовПоДокументу;
	
КонецФункции

// Определяет какие порядки расчетов можно использовать в выбранном документе.
//
// Параметры:
//	ЗначениеВДокументе - ПеречислениеСсылка.ПорядокРасчетов - Порядок расчетов, выбранный в документе.
//	ЗначениеПоУмолчанию - ПеречислениеСсылка.ПорядокРасчетов - Порядок расчетов, определяемый по соглашению/договору документа.
//	ПоЗаказу - Булево - Документ введен по заказу.
//	ЭтоЗаказ - Булево - Это заказ.
//	ЗаказКакСчет - Булево - это заказ и включена ФО заказ как счет.
//
// Возвращаемое значение:
//	СписокЗначений - Список доступных порядков расчета.
//
Функция ДоступныеПорядкиРасчетовПоДокументу(ЗначениеВДокументе, ЗначениеПоУмолчанию, ПоЗаказу = Ложь, ЭтоЗаказ = Ложь, ЗаказКакСчет = Ложь) Экспорт
	
	ПорядкиРасчетов = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ЗначениеВДокументе) Тогда
		ПорядкиРасчетов.Добавить(ЗначениеВДокументе);
	КонецЕсли;
	
	Если НЕ ПоЗаказу Тогда
	
		Если ЗначениеПоУмолчанию = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
			ПорядкиРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов);
			ПорядкиРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоДоговорамНакладным);
		КонецЕсли;
		
		Если ЗначениеПоУмолчанию = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным Тогда
			ПорядкиРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоДоговорамНакладным);
		КонецЕсли;
		
		Если ЗначениеПоУмолчанию <> Перечисления.ПорядокРасчетов.ПоНакладным
				И (ПоЗаказу Или ЭтоЗаказ) Тогда
			ПорядкиРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоЗаказам);
			Если НЕ ЗаказКакСчет Тогда
				ПорядкиРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоЗаказамНакладным);
			КонецЕсли;
		КонецЕсли;
		
		ПорядкиРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоНакладным);
		
	КонецЕсли;
	МассивПорядков = ПорядкиРасчетов.ВыгрузитьЗначения();
	МассивПорядков = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПорядков);
	ПорядкиРасчетов.ЗагрузитьЗначения(МассивПорядков);
	
	Возврат ПорядкиРасчетов;
	
КонецФункции

// Возвращает порядок расчетов по переданным параметрам.
//
// Параметры:
//    ЭтоЗаказ - Булево - Истина, если это заказ.
//    Распоряжение - ДокументСсылка.ПервичныйДокумент,
//    	ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента,
//    	ДокументСсылка.ЗаказКлиента,
//    	ДокументСсылка.ОтгрузкаТоваровКлиенту - Необязательный, распоряжение, по которому введен документ.
//    Соглашение - СправочникСсылка.СоглашенияСКлиентами, СправочникСсылка.СоглашенияСПоставщиками - Необязательный, соглашение документа.
//    Договор - СправочникСсылка.ДоговорыКонтрагентов - Необязательный, договор документа.
//
// Возвращаемое значение:
//    ПеречислениеСсылка.ПорядокРасчетов - Порядок расчетов.
//
Функция ПорядокРасчетов(ЭтоЗаказ, Распоряжение = Неопределено, Соглашение = Неопределено, Договор = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Распоряжение)
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("ПорядокРасчетов", Распоряжение.Метаданные()) Тогда
		ПорядокРасчетовПоДокументу = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Распоряжение, "ПорядокРасчетов");
	ИначеЕсли ЗначениеЗаполнено(Соглашение) Тогда
		РеквизитыСоглашения = ВзаиморасчетыСлужебный.РеквизитыСоглашения(Соглашение);
		Если РеквизитыСоглашения.ИспользуютсяДоговорыКонтрагентов И ЗначениеЗаполнено(Договор) Тогда
			ПорядокРасчетовПоДокументу = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ПорядокРасчетов");
		ИначеЕсли РеквизитыСоглашения.ИспользуютсяДоговорыКонтрагентов = Ложь Тогда
			ПорядокРасчетовПоДокументу = РеквизитыСоглашения.ПорядокРасчетов;
		Иначе
			ПорядокРасчетовПоДокументу = Перечисления.ПорядокРасчетов.ПоЗаказам;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Договор) Тогда
		ПорядокРасчетовПоДокументу = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ПорядокРасчетов");
	ИначеЕсли ЭтоЗаказ Тогда
		ПорядокРасчетовПоДокументу = Перечисления.ПорядокРасчетов.ПоЗаказам;
	Иначе 
		ПорядокРасчетовПоДокументу = Перечисления.ПорядокРасчетов.ПоНакладным;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПорядокРасчетовПоДокументу;
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедуры

// Устарела. Заменяет документы расчетов при вызове отчетов по взаиморасчетов из реализации.
// Если реализация по заказу клиента - документом расчетов является заказ клиента.
//
// Параметры:
// Параметры - ДанныеФормыСтруктура - Параметры отчета.
//
Процедура ЗаменитьДокументыРасчетовСКлиентами(Параметры) Экспорт
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ЗаказКлиентаОтбор") Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ПараметрЗаказКлиента = Параметры.Отбор.ЗаказКлиентаОтбор;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
		|				ИЛИ ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным) ТОГДА
		|		ДанныеДокумента.Договор
		|	ИНАЧЕ
		|		ДанныеДокумента.Ссылка
		|	КОНЕЦ КАК ОбъектРасчетов
		|ПОМЕСТИТЬ ДанныеДокументов
		|ИЗ
		|	Документ.ЗаказКлиента КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&ЗаказКлиента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
		|			ИЛИ ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным) ТОГДА
		|		ДанныеДокумента.Договор
		|	ИНАЧЕ
		|		ДанныеДокумента.Ссылка
		|	КОНЕЦ КАК ОбъектРасчетов
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&ЗаказКлиента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов) ТОГДА
		|		ДанныеДокумента.Договор
		|	КОГДА ДанныеДокумента.РеализацияПоЗаказам И НЕ ТаблицаТовары.ЗаказКлиента ЕСТЬ NULL
		|		И НЕ ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным) ТОГДА
		|		ТаблицаТовары.ЗаказКлиента
		|	ИНАЧЕ
		|		ДанныеДокумента.Ссылка
		|	КОНЕЦ КАК ОбъектРасчетов
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
		|		ПО ТаблицаТовары.Ссылка = ДанныеДокумента.Ссылка
		|		И ДанныеДокумента.РеализацияПоЗаказам
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&ЗаказКлиента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов) ТОГДА
		|		ДанныеДокумента.Договор
		|	ИНАЧЕ
		|		ДанныеДокумента.Ссылка
		|	КОНЕЦ КАК ОбъектРасчетов
		|ИЗ
		|	Документ.РеализацияУслугПрочихАктивов КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&ЗаказКлиента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов) ТОГДА
		|		ДанныеДокумента.Договор
		|	КОГДА ДанныеДокумента.АктПоЗаказам И НЕ ТаблицаУслуги.ЗаказКлиента ЕСТЬ NULL
		|		И НЕ ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным) ТОГДА
		|		ТаблицаУслуги.ЗаказКлиента
		|	ИНАЧЕ
		|		ДанныеДокумента.Ссылка
		|	КОНЕЦ КАК ОбъектРасчетов
		|ИЗ
		|	Документ.АктВыполненныхРабот КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот.Услуги КАК ТаблицаУслуги
		|		ПО ТаблицаУслуги.Ссылка = ДанныеДокумента.Ссылка
		|		И ДанныеДокумента.АктПоЗаказам
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&ЗаказКлиента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов) ТОГДА
		|		ДанныеДокумента.Договор
		|	КОГДА ДанныеДокумента.ПродажаПоЗаказам
		|		И НЕ ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным) ТОГДА
		|		ТаблицаТовары.ЗаказКлиента
		|	ИНАЧЕ
		|		ДанныеДокумента.ДокументОснование
		|	КОНЕЦ КАК ОбъектРасчетов
		|ИЗ
		|	Документ.КорректировкаРеализации КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК ТаблицаТовары
		|		ПО ТаблицаТовары.Ссылка = ДанныеДокумента.Ссылка
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&ЗаказКлиента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов) ТОГДА
		|		ДанныеДокумента.Договор
		|	ИНАЧЕ
		|		ДанныеДокумента.Ссылка
		|	КОНЕЦ КАК ОбъектРасчетов
		|ИЗ
		|	Документ.ВыкупВозвратнойТарыКлиентом КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&ЗаказКлиента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов) ТОГДА
		|		ДанныеДокумента.Договор
		|	КОГДА ДанныеДокумента.ЗаявкаНаВозвратТоваровОтКлиента <> ЗНАЧЕНИЕ(Документ.ЗаявкаНаВозвратТоваровОтКлиента.ПустаяСсылка)
		|			И НЕ ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным) ТОГДА
		|		ДанныеДокумента.ЗаявкаНаВозвратТоваровОтКлиента
		|	ИНАЧЕ
		|		ДанныеДокумента.Ссылка
		|	КОНЕЦ КАК ОбъектРасчетов
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&ЗаказКлиента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК ДанныеРегистра
		|ГДЕ
		|	ДанныеРегистра.Регистратор В (&ЗаказКлиента)
		|	И ДанныеРегистра.ОбъектРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.ПлатежВозврат)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеДокументов.ОбъектРасчетов КАК ОбъектРасчетов
		|ИЗ
		|	ДанныеДокументов КАК ДанныеДокументов
		|");
		
		Запрос.УстановитьПараметр("ЗаказКлиента", ПараметрЗаказКлиента);
		
		МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектРасчетов");
		
		Если ТипЗнч(ПараметрЗаказКлиента) = Тип("Массив") Тогда
			Для Каждого ТекЭлемент Из ПараметрЗаказКлиента Цикл
				Если ТипЗнч(ТекЭлемент) <> Тип("ДокументСсылка.ЗаказКлиента")
				 И ТипЗнч(ТекЭлемент) <> Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента")
				 И ТипЗнч(ТекЭлемент) <> Тип("ДокументСсылка.РеализацияТоваровУслуг")
				 И ТипЗнч(ТекЭлемент) <> Тип("ДокументСсылка.РеализацияУслугПрочихАктивов")
				 И ТипЗнч(ТекЭлемент) <> Тип("ДокументСсылка.АктВыполненныхРабот")
				 И ТипЗнч(ТекЭлемент) <> Тип("ДокументСсылка.КорректировкаРеализации") Тогда
					МассивДокументов.Добавить(ТекЭлемент);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ПараметрЗаказКлиента) <> Тип("ДокументСсылка.ЗаказКлиента")
		 И ТипЗнч(ПараметрЗаказКлиента) <> Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента")
		 И ТипЗнч(ПараметрЗаказКлиента) <> Тип("ДокументСсылка.РеализацияТоваровУслуг")
		 И ТипЗнч(ПараметрЗаказКлиента) <> Тип("ДокументСсылка.РеализацияУслугПрочихАктивов")
		 И ТипЗнч(ПараметрЗаказКлиента) <> Тип("ДокументСсылка.АктВыполненныхРабот")
		 И ТипЗнч(ПараметрЗаказКлиента) <> Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		 	МассивДокументов.Добавить(ПараметрЗаказКлиента);
		КонецЕсли;
		
		Для Счетчик = 0 По МассивДокументов.Количество() - 1 Цикл
			Если Не ТипЗнч(МассивДокументов[Счетчик]) = Тип("СправочникСсылка.ОбъектыРасчетов") Тогда
				МассивДокументов[Счетчик] = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(МассивДокументов[Счетчик]);
			КонецЕсли;
		КонецЦикла;
		
		Параметры.Отбор.ЗаказКлиентаОтбор = МассивДокументов;
		
	КонецЕсли;
	
КонецПроцедуры

// Устарела. Заменяет документы расчетов при вызове отчетов по взаиморасчетов из поступления.
// Если поступление по заказу поставщику - документом расчетов является заказ поставщику.
//
// Параметры:
// Параметры - ДанныеФормыСтруктура - Параметры отчета.
//
Процедура ЗаменитьДокументыРасчетовСПоставщиками(Параметры) Экспорт
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ЗаказПоставщикуОтбор") Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ПараметрЗаказПоставщику = Параметры.Отбор.ЗаказПоставщикуОтбор;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)
		|			ИЛИ ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным) ТОГДА
		|		ДанныеДокумента.Договор
		|	ИНАЧЕ
		|		ДанныеДокумента.Ссылка
		|	КОНЕЦ КАК ОбъектРасчетов
		|ПОМЕСТИТЬ ДанныеДокументов
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&ЗаказПоставщику)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов) ТОГДА
		|		ДанныеДокумента.Договор
		|	КОГДА ДанныеДокумента.ПоступлениеПоЗаказам И НЕ ТаблицаТовары.ЗаказПоставщику ЕСТЬ NULL
		|		И НЕ ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным) ТОГДА
		|		ТаблицаТовары.ЗаказПоставщику
		|	ИНАЧЕ
		|		ДанныеДокумента.Ссылка
		|	КОНЕЦ КАК ОбъектРасчетов
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ТаблицаТовары
		|		ПО ТаблицаТовары.Ссылка = ДанныеДокумента.Ссылка
		|		И ДанныеДокумента.ПоступлениеПоЗаказам
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&ЗаказПоставщику)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА ДанныеДокумента.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов) ТОГДА
		|		ДанныеДокумента.Договор
		|	ИНАЧЕ
		|		ДанныеДокумента.Ссылка
		|	КОНЕЦ КАК ОбъектРасчетов
		|ИЗ
		|	Документ.ПриобретениеУслугПрочихАктивов КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&ЗаказПоставщику)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеРегистра.ОбъектРасчетов.Объект КАК ОбъектРасчетов
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками КАК ДанныеРегистра
		|ГДЕ
		|	ДанныеРегистра.Регистратор В (&ЗаказПоставщику)
		|	И ТИПЗНАЧЕНИЯ(ДанныеРегистра.ОбъектРасчетов.Объект) В (ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств),
		|												ТИП(Документ.СписаниеБезналичныхДенежныхСредств),
		|												ТИП(Документ.ПриходныйКассовыйОрдер),
		|												ТИП(Документ.РасходныйКассовыйОрдер),
		|												ТИП(Документ.ОперацияПоПлатежнойКарте),
		|												ТИП(Документ.ВводОстатков),
		|												ТИП(Документ.ВводОстатковВзаиморасчетов))
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеДокументов.ОбъектРасчетов КАК ОбъектРасчетов
		|ИЗ
		|	ДанныеДокументов КАК ДанныеДокументов
		|");
		
		Запрос.УстановитьПараметр("ЗаказПоставщику", ПараметрЗаказПоставщику);
		
		МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектРасчетов");
		
		Если ТипЗнч(ПараметрЗаказПоставщику) = Тип("Массив") Тогда
			Для Каждого ТекЭлемент Из ПараметрЗаказПоставщику Цикл
				Если ТипЗнч(ТекЭлемент) <> Тип("ДокументСсылка.ЗаказПоставщику")
				 И ТипЗнч(ТекЭлемент) <> Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
				 И ТипЗнч(ТекЭлемент) <> Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
					МассивДокументов.Добавить(ТекЭлемент);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ПараметрЗаказПоставщику) <> Тип("ДокументСсылка.ЗаказПоставщику")
		 И ТипЗнч(ПараметрЗаказПоставщику) <> Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
		 И ТипЗнч(ПараметрЗаказПоставщику) <> Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
		 	МассивДокументов.Добавить(ПараметрЗаказПоставщику);
		КонецЕсли;
		
		Для Счетчик = 0 По МассивДокументов.Количество() - 1 Цикл
			Если Не ТипЗнч(МассивДокументов[Счетчик]) = Тип("СправочникСсылка.ОбъектыРасчетов") Тогда
				МассивДокументов[Счетчик] = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(МассивДокументов[Счетчик]);
			КонецЕсли;
		КонецЦикла;
		
		Параметры.Отбор.ЗаказПоставщикуОтбор = МассивДокументов;
		
	КонецЕсли;
	
КонецПроцедуры

// Устарела. Возвращает результат проверки количества вариантов классификации при отключенной опции "ИспользоватьНесколькоКлассификацийЗадолженности".
//
// Параметры:
// Количество - Число - количество элементов в справочнике "ВариантыКлассификацииЗадолженности".
// Форма - ФормаКлиентскогоПриложения - форма, источник проверки.
//
// Возвращаемое значение:
// Булево - Ложь, если проверка пройдена, Истина, если проверка не пройдена, выдать сообщение об ошибке.
//
Функция ПроверкаИСообщениеВариантовКлассификацииЗадолженности(Количество, Форма) Экспорт
	Если Форма = Неопределено Тогда
		ПрефиксСообщения = НСтр("ru = 'Не удалось заполнить поле ""Вариант классификации задолженности"".'");
	Иначе
		ПрефиксСообщения = "";
	КонецЕсли;
	
	СтатусВозврата = Ложь;
	Если Количество > 1 Тогда
		СообщениеОбОшибке = ПрефиксСообщения + НСтр("ru = 'В информационной базе введено несколько вариантов классификации задолженности.'") 
			+ Символы.ПС + Символы.ПС
			+ НСтр("ru = 'Включите функциональную опцию ""Предприятие - Несколько вариантов классификации задолженности"".'");
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
		СтатусВозврата = Истина;
	ИначеЕсли Количество <> 1 Тогда
		СообщениеОбОшибке = ПрефиксСообщения + НСтр("ru = 'Возможно, в информационной базе не введено ни одного варианта классификации задолженности.'");
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
		СтатусВозврата = Истина;
	КонецЕсли;

	Возврат СтатусВозврата;
КонецФункции 

// Устарела. Формирует структуру отборов по партнеру и организации для контекстно вызываемых отчетов 
//   по расчетам с клиентом.
//
// Параметры:
//  МассивДокументов  - Массив - массив документов, которыми параметризуется отчет.
//  ИмяОтчета         - Строка - имя вызываемого отчета.
//  ИмяКоманды        - Строка - имя команды, при помощи которой вызывается отчет.вызываемого отчета.
//  Типы              - Массив - Массив типов параметра команды вызывающей отчет.
//
// Возвращаемое значение:
//   Структура   - сформированная структура отбора, где:
//      * Партнер - Массив из СправочникСсылка.Партнеры.
//      * Организация - Массив из СправочникСсылка.Организации.
//
Функция СтруктураОтборовОтчетовРасчетыСКлиентами(МассивДокументов, ИмяОтчета, ИмяКоманды, Типы = Неопределено) Экспорт
	
	СтруктураОтборов = Новый Структура;
	
	ШаблонЗапросаПоДокументам = "
	|ВЫБРАТЬ 
	|	Документ.Партнер,
	|	Документ.Организация
	|ПОМЕСТИТЬ ДокументыПартнерыОрганизации
	|ИЗ
	|	&ИмяТаблицы КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивДокументов)";
	
	ТекстОбъединить = "
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	ЭтоПервыйЗапросОбъединения = Истина;
	
	ТекстЗапроса = "";
	
	Коллекция = ?(ЗначениеЗаполнено(Типы), Типы, Метаданные.Отчеты[ИмяОтчета].Команды[ИмяКоманды].ТипПараметраКоманды.Типы());
	
	Для Каждого ТипПараметраКоманды Из Коллекция Цикл
		
		ОбъектМетаданныхДокумента = Метаданные.НайтиПоТипу(ТипПараметраКоманды);
		Если ПравоДоступа("Чтение", ОбъектМетаданныхДокумента) Тогда
			ИмяТаблицы = ОбъектМетаданныхДокумента.Имя;
			
			ТекстЗапросаПоДокументу = СтрЗаменить(ШаблонЗапросаПоДокументам, "&ИмяТаблицы", "Документ." + ИмяТаблицы);
			ТекстЗапросаПоДокументу = СтрЗаменить(ТекстЗапросаПоДокументу, 
			                                      "ПОМЕСТИТЬ ДокументыПартнерыОрганизации",
			                                      ?(НЕ ЭтоПервыйЗапросОбъединения,"", "ПОМЕСТИТЬ ДокументыПартнерыОрганизации"));
			
			ТекстЗапроса = ТекстЗапроса + ?(ЭтоПервыйЗапросОбъединения, "", ТекстОбъединить) + ТекстЗапросаПоДокументу;
			
			ЭтоПервыйЗапросОбъединения = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДокументыПартнерыОрганизации.Партнер
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПартнерыОрганизации КАК ДокументыПартнерыОрганизации
	|		ПО Партнеры.Ссылка = ДокументыПартнерыОрганизации.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДокументыПартнерыОрганизации.Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПартнерыОрганизации КАК ДокументыПартнерыОрганизации
	|		ПО Организации.Ссылка = ДокументыПартнерыОрганизации.Организация";
	
	
	Результат = Запрос.ВыполнитьПакет();
	
	СтруктураОтборов.Вставить("Партнер", Результат[0].Выгрузить().ВыгрузитьКолонку("Партнер"));
	СтруктураОтборов.Вставить("Организация", Результат[1].Выгрузить().ВыгрузитьКолонку("Организация"));
	
	Возврат СтруктураОтборов;
	
КонецФункции

// Определяется возможная сумма списания с текущего остатка - весь остаток или только часть остатка равная сумме списания.
// При этом уменьшается текущий остаток на сумму списания и сама сумма списания.
//
// Параметры:
//  СуммаОстатка - Число - Текущий остаток с которого необходимо списать сумму.
//  СуммаКСписанию - Число - Сумма которую необходимо списать.
//  ПоследняяЧасть - Булево - если истина, то списать весь остаток.
//
// Возвращаемое значение:
//  Число - сумма которую необходимо списать или весь остаток целиком в случае если он меньше заданной суммы или
//          ПоследняяЧасть = Истина.
//
Функция СписатьСумму(СуммаОстатка, СуммаКСписанию, ПоследняяЧасть = Ложь) Экспорт
	
	СуммаСписания = 0;
	КСписанию = Макс(СуммаКСписанию, -СуммаКСписанию);
	Знак = ?(КСписанию = 0, 1, СуммаКСписанию/КСписанию);
	
	Если СуммаОстатка >= КСписанию И НЕ ПоследняяЧасть Тогда
		СуммаСписания = КСписанию;
		СуммаОстатка = СуммаОстатка - СуммаСписания;
		КСписанию = 0;
	Иначе
		СуммаСписания = СуммаОстатка;
		КСписанию = КСписанию - СуммаСписания;
		СуммаОстатка = 0;
	КонецЕсли;
	
	СуммаКСписанию = Знак * КСписанию;
	
	Возврат СуммаСписания;
	
КонецФункции

// Определяется возможная сумма списания с текущего остатка одного показателя, 
// пропорционально уже списанной по другому показателю.
// При этом уменьшается текущий остаток.
//
// Параметры:
//	СуммаОстатка - Число - Текущий остаток с которого необходимо списать сумму.
//	СуммаСписано - Число - Сумма которая уже списана с другого показателя.
//	СуммаВсего - Число - Сумма по другому показателю до списания.
//
// Возвращаемое значение:
//	Число - сумма которую необходимо списать.
//
Функция СписатьСуммуПропорционально(СуммаОстатка, СуммаСписано, СуммаВсего) Экспорт
	
	СуммаКСписанию = 0;
	Если СуммаВсего > 0 Тогда
		СуммаКСписанию = Окр(СуммаОстатка * СуммаСписано / СуммаВсего, 2);
	КонецЕсли;
	
	Возврат СписатьСумму(СуммаОстатка, СуммаКСписанию);
	
КонецФункции

// Устарела. Функция - конструктор процедуры ВзаиморасчетыСервер.ЗаполнитьРасшифровкуПлатежаПоЗаказуКлиента.
//
// Возвращаемое значение:
//	Структура - Структура параметров:
//		* Партнер          - СправочникСсылка.Партнеры - Партнер документа-инициатора.
//		* Договор          - СправочникСсылка.ДоговорыКонтрагентов - Договор объекта расчетов.
//		* ЗаказКлиента     - ДокументСсылка.ЗаказКлиента - Объект расчетов.
//		* ВалютаДокумента  - СправочникСсылка.Валюты - Валюта документа поступления денежных средств.
//		* ОснованиеПлатежа - ДокументСсылка - Документ-основание.
//
Функция ПараметрыЗаполненияРасшифровкиПлатежаПоЗаказу() Экспорт
	
	Возврат ВзаиморасчетыЗаполнениеРасшифровкиПлатежа.ПараметрыЗаполненияРасшифровкиПлатежаПоЗаказу();
	
КонецФункции

// Устарела. Функция возвращает максимальную дату из временной таблицы, которая содержит перечень документов.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Содержит временную таблицу ТаблицаДанныхДокументов,
//														с перечнем документов одного типа.
// Возвращаемое значение:
// 	Дата - Максимальная дата в коллекци документов.
Функция ПолучитьМаксимальнуюДатуВКоллекцииДокументов(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(КоллекцияДокументов.Ссылка.Дата), НЕОПРЕДЕЛЕНО) КАК Период
	|ИЗ
	|	ТаблицаДанныхДокументов КАК КоллекцияДокументов
	|");
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		МаксимальнаяДата = Результат.Выгрузить()[0].Период;
		
		Если МаксимальнаяДата = Неопределено Тогда
			МаксимальнаяДата = ТекущаяДатаСеанса();
		КонецЕсли;
	Иначе
		МаксимальнаяДата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат МаксимальнаяДата;
КонецФункции

// Устарела. Процедура формирует записи в регистре сведений "Задания к распределению расчетов с клиентами",
// если текущий документ изменяет записи в регистре "Расчеты с клиентами".
// Параметры:
//	Документ - ДокументСсылка - Ссылка на документ-регистратор
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Содержит временную таблицу изменений.
Процедура ОтразитьЗаданияКРаспределениюРасчетовСКлиентами(Документ, МенеджерВременныхТаблиц) Экспорт
	
	Если Константы.НоваяАрхитектураВзаиморасчетов.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("ВзаиморасчетыСервер.ОтразитьЗаданияКРаспределениюРасчетовСКлиентами");
	
	ВременныеТаблицы = МенеджерВременныхТаблиц;
	
	Если (ВременныеТаблицы.Таблицы.Найти("РасчетыСКлиентамиИзменения") <> Неопределено
			ИЛИ ВременныеТаблицы.Таблицы.Найти("РасчетыСКлиентамиПоДокументамЗаданияКРасчетамСКлиентами") <> Неопределено)
		И ПланыОбмена.ГлавныйУзел() = Неопределено Тогда // есть изменения в оперативном регистре
		
		ШаблонВложенныйЗапрос = "
		|ВЫБРАТЬ
		|	Таблица.Месяц                        КАК Месяц,
		|	Таблица.АналитикаУчетаПоПартнерам    КАК АналитикаУчетаПоПартнерам,
		|	Ключи.Организация                    КАК Организация,
		|	Таблица.ОбъектРасчетов               КАК ОбъектРасчетов,
		|	Таблица.Документ                     КАК Документ
		|ИЗ
		|	&ТаблицаДанных КАК Таблица
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК Ключи
		|	ПО Ключи.Ссылка = Таблица.АналитикаУчетаПоПартнерам
		|";
		
		ШаблонТекстУничтожениеВТ = "
		|;
		|//////////////////////////////
		|УНИЧТОЖИТЬ &ТаблицаДанных
		|";
		
		ТекстУничтожениеВТ = "";
		ВложенныйЗапрос = "";
		КоличествоТаблиц = 0;
		
		Если ВременныеТаблицы.Таблицы.Найти("РасчетыСКлиентамиИзменения") <> Неопределено Тогда
			ВложенныйЗапрос = СтрЗаменить(ШаблонВложенныйЗапрос, "&ТаблицаДанных", "(" + ТестЗапросаРаспределениеРасчетовСКлиентами() + ")");
			ВложенныйЗапрос = СтрЗаменить(ВложенныйЗапрос, "Ключи.Организация", "Таблица.Организация");
			КоличествоТаблиц = КоличествоТаблиц + 1;
		КонецЕсли;
		
		Если ВременныеТаблицы.Таблицы.Найти("РасчетыСКлиентамиПоДокументамЗаданияКРасчетамСКлиентами") <> Неопределено Тогда
			Если КоличествоТаблиц = 0 Тогда
				ВложенныйЗапрос = СтрЗаменить(ШаблонВложенныйЗапрос, "&ТаблицаДанных", "РасчетыСКлиентамиПоДокументамЗаданияКРасчетамСКлиентами");
				ТекстУничтожениеВТ = СтрЗаменить(ШаблонТекстУничтожениеВТ, "&ТаблицаДанных", "РасчетыСКлиентамиПоДокументамЗаданияКРасчетамСКлиентами");
			Иначе
				ВложенныйЗапрос = ВложенныйЗапрос + "
					|ОБЪЕДИНИТЬ ВСЕ
					|"
					+ СтрЗаменить(ШаблонВложенныйЗапрос, "&ТаблицаДанных", "РасчетыСКлиентамиПоДокументамЗаданияКРасчетамСКлиентами");
				ТекстУничтожениеВТ = ТекстУничтожениеВТ + СтрЗаменить(ШаблонТекстУничтожениеВТ, "&ТаблицаДанных", "РасчетыСКлиентамиПоДокументамЗаданияКРасчетамСКлиентами");
			КонецЕсли;
			КоличествоТаблиц = КоличествоТаблиц + 1;
		КонецЕсли;
		
		Если КоличествоТаблиц = 1 Тогда
			ТекстЗапроса = ВложенныйЗапрос + ТекстУничтожениеВТ;
		Иначе
			ШаблонТекстаЗапроса = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.Месяц                        КАК Месяц,
			|	Таблица.АналитикаУчетаПоПартнерам    КАК АналитикаУчетаПоПартнерам,
			|	Таблица.Организация                  КАК Организация,
			|	Таблица.ОбъектРасчетов               КАК ОбъектРасчетов,
			|	Таблица.Документ                     КАК Документ
			|ИЗ
			|	(ВЫБРАТЬ &ВложенныйЗапрос
			|	) КАК Таблица
			|
			|";
			ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "ВЫБРАТЬ &ВложенныйЗапрос", ВложенныйЗапрос) + ТекстУничтожениеВТ;
		КонецЕсли;
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
		Запрос.УстановитьПараметр("НовыеРасчеты", ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов"));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.ЗаданияКРаспределениюРасчетовСКлиентами.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НаборЗаписей, Выборка);
			НаборЗаписей.НомерЗадания = Константы.НомерЗаданияКРаспределениюРасчетовСКлиентами.Получить();
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 1);
	
КонецПроцедуры

// Устарела. Процедура формирует записи в регистре сведений "Задания к распределению расчетов с поставщиками",
// если текущий документ изменяет записи в регистре "Расчеты с поставщиками".
//
// Параметры:
//  Документ - ДокументСсылка - Ссылка на документ-регистратор
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Содержит временную таблицу изменений.
//
Процедура ОтразитьЗаданияКРаспределениюРасчетовСПоставщиками(Документ, МенеджерВременныхТаблиц) Экспорт
	
	Если Константы.НоваяАрхитектураВзаиморасчетов.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("ВзаиморасчетыСервер.ОтразитьЗаданияКРаспределениюРасчетовСПоставщиками");

	ВременныеТаблицы = МенеджерВременныхТаблиц;
	
	Если (ВременныеТаблицы.Таблицы.Найти("РасчетыСПоставщикамиИзменения") <> Неопределено
			ИЛИ ВременныеТаблицы.Таблицы.Найти("РасчетыСПоставщикамиПоДокументамЗаданияКРасчетамСПоставщиками") <> Неопределено)
		И ПланыОбмена.ГлавныйУзел() = Неопределено Тогда // есть изменения в оперативном регистре
		
		ШаблонВложенныйЗапрос = "
		|ВЫБРАТЬ
		|	Таблица.Месяц                        КАК Месяц,
		|	Таблица.АналитикаУчетаПоПартнерам    КАК АналитикаУчетаПоПартнерам,
		|	Ключи.Организация                    КАК Организация,
		|	Таблица.ОбъектРасчетов               КАК ОбъектРасчетов,
		|	Таблица.Документ                     КАК Документ
		|ИЗ
		|	&ТаблицаДанных КАК Таблица
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК Ключи
		|	ПО Ключи.Ссылка = Таблица.АналитикаУчетаПоПартнерам
		|";
		
		ШаблонТекстУничтожениеВТ = "
		|;
		|//////////////////////////////
		|УНИЧТОЖИТЬ &ТаблицаДанных
		|";
		
		ТекстУничтожениеВТ = "";
		ВложенныйЗапрос = "";
		КоличествоТаблиц = 0;
		
		Если ВременныеТаблицы.Таблицы.Найти("РасчетыСПоставщикамиИзменения") <> Неопределено Тогда
			ВложенныйЗапрос = СтрЗаменить(ШаблонВложенныйЗапрос, "&ТаблицаДанных", "(" + ТестЗапросаРаспределениеРасчетовСПоставщиками() + ")");
			ВложенныйЗапрос = СтрЗаменить(ВложенныйЗапрос, "Ключи.Организация", "Таблица.Организация");
			КоличествоТаблиц = КоличествоТаблиц + 1;
		КонецЕсли;
		
		Если ВременныеТаблицы.Таблицы.Найти("РасчетыСПоставщикамиПоДокументамЗаданияКРасчетамСПоставщиками") <> Неопределено Тогда
			Если КоличествоТаблиц = 0 Тогда
				ВложенныйЗапрос = СтрЗаменить(ШаблонВложенныйЗапрос, "&ТаблицаДанных", "РасчетыСПоставщикамиПоДокументамЗаданияКРасчетамСПоставщиками");
				ТекстУничтожениеВТ = СтрЗаменить(ШаблонТекстУничтожениеВТ, "&ТаблицаДанных", "РасчетыСПоставщикамиПоДокументамЗаданияКРасчетамСПоставщиками");
			Иначе
				ВложенныйЗапрос = ВложенныйЗапрос + "
					|ОБЪЕДИНИТЬ ВСЕ
					|"
					+ СтрЗаменить(ШаблонВложенныйЗапрос, "&ТаблицаДанных", "РасчетыСПоставщикамиПоДокументамЗаданияКРасчетамСПоставщиками");
				ТекстУничтожениеВТ = ТекстУничтожениеВТ + СтрЗаменить(ШаблонТекстУничтожениеВТ, "&ТаблицаДанных", "РасчетыСПоставщикамиПоДокументамЗаданияКРасчетамСПоставщиками");
			КонецЕсли;
			КоличествоТаблиц = КоличествоТаблиц + 1;
		КонецЕсли;
		
		Если КоличествоТаблиц = 1 Тогда
			ТекстЗапроса = ВложенныйЗапрос + ТекстУничтожениеВТ;
		Иначе
			ШаблонТекстаЗапроса = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.Месяц                        КАК Месяц,
			|	Таблица.АналитикаУчетаПоПартнерам    КАК АналитикаУчетаПоПартнерам,
			|	Таблица.Организация                  КАК Организация,
			|	Таблица.ОбъектРасчетов               КАК ОбъектРасчетов,
			|	Таблица.Документ                     КАК Документ
			|ИЗ
			|	(ВЫБРАТЬ &ВложенныйЗапрос
			|	) КАК Таблица
			|
			|";
			ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "ВЫБРАТЬ &ВложенныйЗапрос", ВложенныйЗапрос) + ТекстУничтожениеВТ;
		КонецЕсли;
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
		Запрос.УстановитьПараметр("НовыеРасчеты", ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов"));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.ЗаданияКРаспределениюРасчетовСПоставщиками.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НаборЗаписей, Выборка);
			НаборЗаписей.НомерЗадания = Константы.НомерЗаданияКРаспределениюРасчетовСПоставщиками.Получить();
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 1);
	
КонецПроцедуры

// Устарела.
// Функция определяет, является ли переданная хозяйственная операция операцией интеркампани.
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция для проверки.
//
// Возвращаемое значение:
//	Булево - Истина, если является операцией интеркампани.
//
Функция ХозяйственнаяОперацияИнтеркампани(ХозяйственнаяОперация) Экспорт
	
	Если ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации") 
		ИЛИ ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию")
		ИЛИ ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию")
		ИЛИ ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Устарела.
// Функция определяет, является ли переданная хозяйственная операция операцией с клиентом.
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция для проверки.
//
// Возвращаемое значение:
//	Булево - Истина, если является операцией с клиентом.
//
Функция ХозяйственнаяОперацияСКлиентом(ХозяйственнаяОперация) Экспорт
	
	Если ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента") 
		ИЛИ ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Устарела.
// Функция определяет, является ли переданная хозяйственная операция операцией с поставщиком.
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция для проверки.
//
// Возвращаемое значение:
//	Булево - Истина, если является операцией с поставщиком.
//
Функция ХозяйственнаяОперацияСПоставщиком(ХозяйственнаяОперация) Экспорт
	
	Если ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОплатаПоставщику") 
		ИЛИ ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика") 
		ИЛИ ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПеречислениеТаможне") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Устарела.
// Функция определяет, является ли переданная хозяйственная операция операцией возврата денежных средств.
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция для проверки.
//
// Возвращаемое значение:
//	Булево - Истина, если является операцией возврата денежных средств.
//
Функция ХозяйственнаяОперацияВозвратДенежныхСредств(ХозяйственнаяОперация) Экспорт
	
	Если ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации")
		ИЛИ ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию")
		ИЛИ ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика")
		ИЛИ ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Получение списка контрагентов по сделкам для отправки приглашений.
//
// Параметры:
//  Организация			 - СправочникСсылка - ссылка на организацию, от которой производится приглашение.
//  РежимЗаполнения		 - Строка - режим заполнения контрагентов: "ЗаполнитьПоПоставкам", "ЗаполнитьПоЗакупкам", "ЗаполнитьПоВсемСделкам".
//  НачалоПериода		 - Дата - начало периода заполнения.
//  СписокКонтрагентов	 - ТаблицаЗначений - список контрагентов:
//    * Ссылка - СправочникСсылка - контрагент.
//    * ЭлектроннаяПочта - Строка - адрес электронной почты.
//
Процедура ПолучитьКонтрагентовПоСделкам(Организация, РежимЗаполнения, НачалоПериода, СписокКонтрагентов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаполнитьПоПоставкам",   РежимЗаполнения = "ЗаполнитьПоПоставкам");
	Запрос.УстановитьПараметр("ЗаполнитьПоЗакупкам",    РежимЗаполнения = "ЗаполнитьПоЗакупкам");
	Запрос.УстановитьПараметр("ЗаполнитьПоВсемСделкам", РежимЗаполнения = "ЗаполнитьПоВсемСделкам");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Организация",   Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		КлючиАналитикиУчетаПоПартнерам.Контрагент КАК Ссылка
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентами.Обороты(&НачалоПериода, , , ) КАК РасчетыСКлиентамиОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|	ГДЕ
	|		КлючиАналитикиУчетаПоПартнерам.Организация = &Организация
	|		И (&ЗаполнитьПоПоставкам
	|				ИЛИ &ЗаполнитьПоВсемСделкам)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		КлючиАналитикиУчетаПоПартнерам.Контрагент
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Обороты(&НачалоПериода, , , ) КАК РасчетыСПоставщикамиОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО РасчетыСПоставщикамиОбороты.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|	ГДЕ
	|		КлючиАналитикиУчетаПоПартнерам.Организация = &Организация
	|		И (&ЗаполнитьПоЗакупкам
	|				ИЛИ &ЗаполнитьПоВсемСделкам)) КАК Контрагенты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагенты.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
			НоваяСтрока = СписокКонтрагентов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
			ОбменСКонтрагентамиПереопределяемый.АдресЭлектроннойПочтыКонтрагента(
				Выборка.Ссылка, НоваяСтрока.ЭлектроннаяПочта);
			// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// ЭлектронноеВзаимодействие.ТорговыеПредложения
// Заполнение штрихкодов для выгрузки.
//
// Параметры:
//  Организации	 - Массив - Список организация, для которых производится выгрузка.
//  РежимПоставщика - Булево - Выгружать только данные по продажам.
//  РежимПокупателя - Булево - Выгружать только данные по покупкам.
//  Штрихкоды	 - ТаблицаЗначений - данные по штрихкодам, 
//                 см. ТорговыеПредложения.ОбновитьПодсказкиТорговыеПредложения:
//    * Штрихкод - Строка - штрихкод товара.
//    * Наименование - Строка - Наименование товара
//    * РежимПоставщика - Булево - признак использования штрихкода в продажах.
//    * РежимПокупателя - Булево - признак использования штрихкода в закупках.
//
Процедура ЗаполнитьШтрихкодыДляВыгрузки(Знач Организации, Знач РежимПоставщика, Знач РежимПокупателя, Штрихкоды) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Организация КАК Организация,
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Ссылка.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Номенклатура.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВтНоменклатура
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		КлючиАналитикиУчетаПоПартнерам.Организация КАК Организация,
	|		КлючиАналитикиУчетаНоменклатуры.Номенклатура КАК Ссылка,
	|		КлючиАналитикиУчетаНоменклатуры.Характеристика КАК Характеристика
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоПериода, , , ) КАК ВыручкаИСебестоимостьПродаж
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|	ГДЕ
	|		КлючиАналитикиУчетаПоПартнерам.Организация В(&Организации)
	|		И &РежимПоставщика
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Закупки.Организация,
	|		КлючиАналитикиУчетаНоменклатуры.Номенклатура,
	|		КлючиАналитикиУчетаНоменклатуры.Характеристика
	|	ИЗ
	|		РегистрНакопления.Закупки.Обороты(&НачалоПериода, , , ) КАК Закупки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО Закупки.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|	ГДЕ
	|		Закупки.Организация В(&Организации)
	|		И &РежимПокупателя) КАК Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10000
	|	ВтНоменклатура.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ВтНоменклатура.Номенклатура.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА ВтНоменклатура.Номенклатура.Наименование
	|		ИНАЧЕ ВтНоменклатура.Номенклатура.НаименованиеПолное
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ВтНоменклатура.Характеристика.Наименование ЕСТЬ NULL
	|				ИЛИ ВтНоменклатура.Характеристика.Наименование ПОДОБНО """"
	|			ТОГДА """"
	|		ИНАЧЕ "", "" + ВтНоменклатура.Характеристика.Наименование
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ВтНоменклатура.ЕдиницаИзмерения.Наименование ЕСТЬ NULL
	|				ИЛИ ВтНоменклатура.ЕдиницаИзмерения.Наименование ПОДОБНО """"
	|			ТОГДА """"
	|		ИНАЧЕ "" ("" + ВтНоменклатура.ЕдиницаИзмерения.Наименование + "")""
	|	КОНЕЦ КАК Наименование,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	&РежимПоставщика КАК РежимПоставщика,
	|	&РежимПокупателя КАК РежимПокупателя
	|ИЗ
	|	ВтНоменклатура КАК ВтНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО (ШтрихкодыНоменклатуры.Номенклатура = ВтНоменклатура.Номенклатура)
	|			И (ШтрихкодыНоменклатуры.Характеристика = ВтНоменклатура.Характеристика)
	|			И (ШтрихкодыНоменклатуры.Упаковка = ВтНоменклатура.ЕдиницаИзмерения
	|				ИЛИ ШтрихкодыНоменклатуры.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
	|ГДЕ
	|	ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 1, 1) <> ""2""";
	
	Запрос.УстановитьПараметр("Организации",     Организации);
	Запрос.УстановитьПараметр("НачалоПериода", 	 НачалоДня(ДобавитьМесяц(ТекущаяДатаСеанса(), -6)));
	Запрос.УстановитьПараметр("РежимПоставщика", РежимПоставщика);
	Запрос.УстановитьПараметр("РежимПокупателя", РежимПокупателя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Штрихкоды.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры
// Конец ЭлектронноеВзаимодействие.ТорговыеПредложения

// Устарела. Функция возвращает ссылку на объект расчетов переданной ссылки.
//
// Параметры:
//		ОбъектСсылка - ОпределяемыйТип.ОбъектРасчетов - Документ по которому нужно определить объект расчетов.
//
// Возвращаемое значение:
// 		ОпределяемыйТип.ОбъектРасчетов - Объект расчетов документа..
//
Функция ОбъектРасчетовПоСсылке(ОбъектСсылка) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектСсылка, "ПорядокРасчетов") Тогда 
		Порядок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "ПорядокРасчетов");
		Если Порядок = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
			Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") 
				ИЛИ ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
				Возврат ОбъектСсылка
			Иначе
				Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "Договор");
			КонецЕсли;
		ИначеЕсли Порядок = Перечисления.ПорядокРасчетов.ПоЗаказам 
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектСсылка, "ЗаказКлиента") Тогда
			Заказ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "ЗаказКлиента");
			Если ЗначениеЗаполнено(Заказ) Тогда
				Возврат Заказ;
			КонецЕсли;
		ИначеЕсли Порядок = Перечисления.ПорядокРасчетов.ПоЗаказам 
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектСсылка, "ЗаказПоставщику") Тогда
			Заказ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "ЗаказПоставщику");
			Если ЗначениеЗаполнено(Заказ) Тогда
				Возврат Заказ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбъектСсылка;
	
КонецФункции

// см. ОтчетыУТПереопределяемый.ДополнитьСоответствияРегистраторовОтчетаОДвижениях
//
Процедура ДополнитьСоответствияРегистраторовОтчетаОДвижениях(Документ, СоответствиеРегистров) Экспорт
	
	Если Документ.Метаданные().Движения.Содержит(Метаданные.РегистрыНакопления.РасчетыСКлиентами) Тогда
		СоответствиеРегистров.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам, "ДокументРегистратор");
		СоответствиеРегистров.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОплат, "ДокументРегистратор");
		СоответствиеРегистров.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОтгрузок, "ДокументРегистратор");
	КонецЕсли;
	
	Если Документ.Метаданные().Движения.Содержит(Метаданные.РегистрыНакопления.РасчетыСПоставщиками) Тогда
		СоответствиеРегистров.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам, "ДокументРегистратор");
		СоответствиеРегистров.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат, "ДокументРегистратор");
		СоответствиеРегистров.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланПоставок, "ДокументРегистратор");
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РасчетКурсовыхРазниц") Тогда
		СоответствиеРегистров.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам, "ДокументРегистратор");
		СоответствиеРегистров.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам, "ДокументРегистратор");
	КонецЕсли;
	
КонецПроцедуры

//++ Локализация

// Обработка обновления статуса Сверки взаиморасчетов (2.5.11) при записи регистра сведения Состояния по объектам учета ЭДО.
// Выполняется по подписке на событие ПриЗаписи.
// См. Подписку на событие ПриЗаписиСостоянияПоОбъектамУчетаЭДО.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.СостоянияПоОбъектамУчетаЭДО - Набор записей регистра сведений
//  Отказ - Булево - Признак отказа от записи
//  Замещение - Булево - Замещение
Процедура ОбновитьСтатусСверкиВзаиморасчетовПриЗаписиСостоянияПоОбъектамУчетаЭДОПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из Источник Цикл  
		Если ТипЗнч(Запись.СсылкаНаОбъект) = Тип("ДокументСсылка.СверкаВзаиморасчетов2_5_11") Тогда
			
			СостояниеЭДО = Запись.СостояниеЭДО;
			Статус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.СсылкаНаОбъект, "Статус");
			НовыйСтатус = "";
			
			Если (СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПередачаОператору
				Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеОператора)
				И Статус = Перечисления.СтатусыСверокВзаиморасчетов2_5_11.Создана Тогда
					
					НовыйСтатус = "НаСверке";
					
			ИначеЕсли (СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.Аннулирован
				Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования
				Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно
				Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаОтклонения
				Или СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ТребуетсяУточнение)
				И Не Статус = Перечисления.СтатусыСверокВзаиморасчетов2_5_11.Отклонена Тогда
					
					НовыйСтатус = "Отклонена";
					
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НовыйСтатус) Тогда
				МассивДокументов = Новый Массив;
				МассивДокументов.Добавить(Запись.СсылкаНаОбъект);
				ОбщегоНазначенияУТВызовСервера.УстановитьСтатусДокументов(МассивДокументов, НовыйСтатус);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//-- Локализация

// Возвращает текст запроса формирования временной таблицы оплаты партий.
//
// Параметры:
//  ИмяТаблицыВходныхДанные - Строка - Имя таблицы входных данных. Таблица должна содержать колонку Партия.
//  ИмяТаблицыОплат - Строка - Имя результирующей таблицы оплат
//
// Возвращаемое значение:
// 	Строка - Текст запроса, формирующий временную таблицу оплат партий. Таблица содержит колонки: Партия, ДокументОплаты, ДатаОплаты, СуммаОплаты.
// 			
Функция ТекстЗапросаТаблицыДанныхОплатыПартий(ИмяТаблицыВходныхДанные, ИмяТаблицыОплат) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщиками.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСПоставщиками.Регистратор КАК Партия
	|ПОМЕСТИТЬ ВтОтборРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|ГДЕ
	|	РасчетыСПоставщиками.Регистратор В
	|			(ВЫБРАТЬ
	|				Т.Партия
	|			ИЗ
	|				#ИмяТаблицыВходныхДанные КАК Т)
	|	И РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Организация В (&СписокОрганизаций)
	|	И РасчетыСПоставщиками.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоСрокам.РасчетныйДокумент   КАК РасчетныйДокумент,
	|	РасчетыПоСрокам.ОбъектРасчетов      КАК ОбъектРасчетов,
	|	РасчетыПоСрокам.ДокументРегистратор КАК ДокументОплаты,
	|	СУММА(&Оплачено)                    КАК Оплачено,
	|	0                                   КАК Зачтено
	|ПОМЕСТИТЬ ВтРасчетыПоСрокам
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	|ГДЕ
	|	(РасчетыПоСрокам.АналитикаУчетаПоПартнерам, 
	|	 РасчетыПоСрокам.ОбъектРасчетов, 
	|	 РасчетыПоСрокам.РасчетныйДокумент) В
	|			(ВЫБРАТЬ
	|				Т.АналитикаУчетаПоПартнерам,
	|				Т.ОбъектРасчетов,
	|				Т.Партия
	|			ИЗ
	|				ВтОтборРасчетов КАК Т)
	|	И РасчетыПоСрокам.Активность
	|	И РасчетыПоСрокам.Период <= &КонецМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокам.ДокументРегистратор,
	|	РасчетыПоСрокам.ОбъектРасчетов,
	|	РасчетыПоСрокам.РасчетныйДокумент
	|
	|ИМЕЮЩИЕ
	|	СУММА(&Оплачено) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыПоСрокам.РасчетныйДокумент    КАК РасчетныйДокумент,
	|	РасчетыПоСрокам.ОбъектРасчетов       КАК ОбъектРасчетов,
	|	РасчетыПоСрокамКор.РасчетныйДокумент КАК ДокументОплаты,
	|	СУММА(0)                             КАК Оплачено,
	|	СУММА(&Зачтено)                      КАК Зачтено
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокамКор
	|		ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = РасчетыПоСрокамКор.АналитикаУчетаПоПартнерам
	|			И РасчетыПоСрокам.Валюта = РасчетыПоСрокамКор.Валюта
	|			И РасчетыПоСрокам.НастройкаХозяйственнойОперации = РасчетыПоСрокамКор.НастройкаХозяйственнойОперации
	|			И РасчетыПоСрокам.ИдентификаторФинЗаписи = РасчетыПоСрокамКор.ИдентификаторФинЗаписи
	|			И РасчетыПоСрокам.РасчетныйДокумент <> РасчетыПоСрокамКор.РасчетныйДокумент
	|ГДЕ
	|	(РасчетыПоСрокам.АналитикаУчетаПоПартнерам, 
	|	 РасчетыПоСрокам.ОбъектРасчетов, 
	|	 РасчетыПоСрокам.РасчетныйДокумент) В
	|			(ВЫБРАТЬ
	|				Т.АналитикаУчетаПоПартнерам,
	|				Т.ОбъектРасчетов,
	|				Т.Партия
	|			ИЗ
	|				ВтОтборРасчетов КАК Т)
	|	И РасчетыПоСрокам.Активность
	|	И РасчетыПоСрокам.Период <= &КонецМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокам.РасчетныйДокумент,
	|	РасчетыПоСрокам.ОбъектРасчетов,
	|	РасчетыПоСрокамКор.РасчетныйДокумент
	|
	|ИМЕЮЩИЕ
	|	СУММА(&Зачтено) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыПоСрокам.РасчетныйДокумент    КАК РасчетныйДокумент,
	|	РасчетыПоСрокам.ОбъектРасчетов       КАК ОбъектРасчетов,
	|	РасчетыПоСрокамКор.ДокументРегистратор КАК ДокументОплаты,
	|	СУММА(0)                             КАК Оплачено,
	|	СУММА(&Зачтено)                      КАК Зачтено
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокамКор
	|		ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = РасчетыПоСрокамКор.АналитикаУчетаПоПартнерам
	|			И РасчетыПоСрокам.Валюта = РасчетыПоСрокамКор.Валюта
	|			И РасчетыПоСрокам.НастройкаХозяйственнойОперации = РасчетыПоСрокамКор.НастройкаХозяйственнойОперации
	|			И РасчетыПоСрокам.ИдентификаторФинЗаписи = РасчетыПоСрокамКор.ИдентификаторФинЗаписи
	|			И РасчетыПоСрокам.РасчетныйДокумент = РасчетыПоСрокамКор.РасчетныйДокумент
	|			И ТИПЗНАЧЕНИЯ(РасчетыПоСрокамКор.ДокументРегистратор) = ТИП(Документ.ВзаимозачетЗадолженности)
	|ГДЕ
	|	(РасчетыПоСрокам.АналитикаУчетаПоПартнерам, 
	|	 РасчетыПоСрокам.ОбъектРасчетов, 
	|	 РасчетыПоСрокам.РасчетныйДокумент) В
	|			(ВЫБРАТЬ
	|				Т.АналитикаУчетаПоПартнерам,
	|				Т.ОбъектРасчетов,
	|				Т.Партия
	|			ИЗ
	|				ВтОтборРасчетов КАК Т)
	|	И РасчетыПоСрокам.Активность
	|	И РасчетыПоСрокам.Период <= &КонецМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокам.РасчетныйДокумент,
	|	РасчетыПоСрокам.ОбъектРасчетов,
	|	РасчетыПоСрокамКор.ДокументРегистратор
	|
	|ИМЕЮЩИЕ
	|	СУММА(&Зачтено) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОплаты,
	|	ОбъектРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоСрокам.ДокументОплаты КАК ДокументОплаты,
	|	РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|	СУММА(ЕСТЬNULL(СуммыДокументовВВалютахУчета.СуммаБезНДСРегл, СуммыДокументовВВалютахУчетаСводно.СуммаБезНДСРегл)) КАК СуммаБезНДС,
	|	СУММА(ЕСТЬNULL(СуммыДокументовВВалютахУчета.СуммаНДСРегл, СуммыДокументовВВалютахУчетаСводно.СуммаНДСРегл)) КАК СуммаНДС
	|ПОМЕСТИТЬ ВтСуммыДокументовОплаты
	|ИЗ
	|	ВтРасчетыПоСрокам КАК РасчетыПоСрокам
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СуммыДокументовВВалютахУчета КАК СуммыДокументовВВалютахУчета
	|		ПО РасчетыПоСрокам.ДокументОплаты = СуммыДокументовВВалютахУчета.Регистратор
	|			И РасчетыПоСрокам.ОбъектРасчетов = СуммыДокументовВВалютахУчета.ОбъектРасчетов
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СуммыДокументовВВалютахУчета КАК СуммыДокументовВВалютахУчетаСводно
	|		ПО РасчетыПоСрокам.ДокументОплаты = СуммыДокументовВВалютахУчетаСводно.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокам.ДокументОплаты,
	|	РасчетыПоСрокам.ОбъектРасчетов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОплаты,
	|	ОбъектРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыПоСрокам.ДокументОплаты КАК ДокументОплаты,
	|	СУММА((РасчетыПоСрокам.Оплачено + РасчетыПоСрокам.Зачтено) 
	|		* ЕСТЬNULL(СуммыДокументовОплаты.СуммаБезНДС, 0)
	|		/ (ВЫБОР 
	|				КОГДА ЕСТЬNULL((СуммыДокументовОплаты.СуммаБезНДС + СуммыДокументовОплаты.СуммаНДС), 0) <> 0
	|					ТОГДА (СуммыДокументовОплаты.СуммаБезНДС + СуммыДокументовОплаты.СуммаНДС)
	|					ИНАЧЕ 1 
	|				КОНЕЦ)) КАК СуммаОплатыБезНДС
	|ПОМЕСТИТЬ ВтОплатыРасчетныхДокументов
	|ИЗ
	|	ВтРасчетыПоСрокам КАК РасчетыПоСрокам
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСуммыДокументовОплаты КАК СуммыДокументовОплаты
	|	ПО
	|		РасчетыПоСрокам.ДокументОплаты = СуммыДокументовОплаты.ДокументОплаты
	|		И РасчетыПоСрокам.ОбъектРасчетов = СуммыДокументовОплаты.ОбъектРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокам.РасчетныйДокумент,
	|	РасчетыПоСрокам.ДокументОплаты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтВходныеДанные.Партия КАК Партия,
	|	ЕСТЬNULL(ОплатыРасчетныхДокументов.ДокументОплаты, НЕОПРЕДЕЛЕНО) КАК ДокументОплаты,
	|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(РеестрДокументов.ДатаДокументаИБ, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплаты,
	|	ЕСТЬNULL(ОплатыРасчетныхДокументов.СуммаОплатыБезНДС, 0) КАК СуммаОплаты
	|ПОМЕСТИТЬ #ИмяТаблицыОплат
	|ИЗ
	|	#ИмяТаблицыВходныхДанные КАК ВтВходныеДанные
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОплатыРасчетныхДокументов КАК ОплатыРасчетныхДокументов
	|		ПО ВтВходныеДанные.Партия = ОплатыРасчетныхДокументов.РасчетныйДокумент
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ОплатыРасчетныхДокументов.ДокументОплаты = РеестрДокументов.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтОтборРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтРасчетыПоСрокам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтСуммыДокументовОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтОплатыРасчетныхДокументов
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяТаблицыВходныхДанные", ИмяТаблицыВходныхДанные);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяТаблицыОплат", ИмяТаблицыОплат);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Оплачено", ШаблонПоляОплаченоПоставщику());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Зачтено", ШаблонПоляЗачтеноПоставщиком());
	// Получаем данные в валюте:
	//  4 - взаиморасчетов
	//  2 - управленческого учета
	//  3 - регламентированного учета
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ДанныеОтчета", "3");
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область ФормированиеЗаданийКЗакрытиюМесяца

// Устарела. Дополняет текст запроса механизма формирования заданий закрытия месяца.
// 
// Параметры:
// 	Запрос - Запрос - используется для установки параметров запроса.
// 	ТекстЗапроса - Строка - строка с текстом запроса.
// 	ТекстЗапросаВременныхТаблиц - Строка - строка с текстом запроса временных таблиц.
// 	ИменаВременныхТаблиц - Строка - массив имен создаваемых временных таблиц для последующего уничтожения.
Процедура ДополнитьТекстЗапросаЗаданийКЗакрытиюМесяца(Запрос, ТекстЗапроса, ТекстЗапросаВременныхТаблиц, ИменаВременныхТаблиц) Экспорт
	
	ВзаиморасчетыЗакрытиеМесяца.ДополнитьТекстЗапросаЗаданийКЗакрытиюМесяца(Запрос, ТекстЗапроса, ТекстЗапросаВременныхТаблиц, ИменаВременныхТаблиц);
	
КонецПроцедуры

#КонецОбласти

#Область Модульность

#Область ОбщийПрограммныйИнтерфейс

// Возвращает структуру параметров механизма взаиморасчетов.
// Параметры описываются либо путем к данным объекта, либо фиксированным значением типа Булево, Строка и пр.
// Путь к данным может вести как в шапку документа ("Объект.Организация"), так и в табличную часть ("Объект.РасшифровкаПлатежа.Партнер").
// В одном документе может быть задано несколько структур параметров (пример - ОтчетКомиссионера).
// Для встраивания в документы рекомендуется использовать шаблон в конце метода.
//
// Возвращаемое значение:
// 	Структура - Структура параметров с ключами:
// 		* ЭлементыФормы - Структура - Имена элементов формы, используются для связи элемента с текущими параметрами:
// 			** ЗачетОплаты - Строка - Имя элемента, вызывающего помощник зачета оплат.
// 			** СуммаВзаиморасчетовТЧ - Строка - Имя элемента, отображающего колонку Сумма взаиморасчетов в основной табличной части.
// 			** ГиперссылкаРасшифровкаПлатежа - Строка - Имя элемента, отображающего сумму расшифровки платежа и открывающего ее редактирование.
// 			** РасшифровкаПлатежа - Строка - Имя элемента, отображающего табличную часть Расшифровка платежа на форме.
// 			** ПодборВРасшифровкуПлатежа - Строка - Имя кнопки, вызывающего подбор в расшифровку платежа.
// 			** НадписьВалюты - Строка - Имя гиперссылки, отображающей валюты и курс документа и вызывающего форму их редактирования.
// 			** НадписьЭтапы - Строка - Имя гиперссылки, отображающей график оплаты и открывающий форму редактирования правил оплаты.
// 			** НадписьРасчеты - Строка - Имя гиперссылки, отображающей состояние расчетов и открывающей отчет по взаиморасчетам.
// 			** ОграничениеЗадолженностиТекст - Строка - Имя гиперссылки, отображающей текст ограничения задолженности и открывающей соответствующий отчет.
// 			** ОграничениеЗадолженностиКартинка - Строка - Имя картинки, отображающей восклицательный знак при ограничении задолженности.
// 		* ЭтоЗаказ - Булево - Это документ - заказ, на основании которого будут вводиться накладные.
// 		* ЭтоСправочник - Булево - Это справочник (договоры или претензии).
// 		* ЭтоПродажаЗакупка - Булево - Это документ - накладная.
// 		* ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами - Тип взаиморасчетов.
// 		* ИзменяетПланОплаты - Булево - Уменьшает или увеличивает планы к оплате от клиента или поставщику.
// 		* ИзменяетПланОтгрузкиПоставки - Булево - Уменьшает или увеличивает план отгрузки или поставки.
// 		* МожетЯвлятьсяОбъектомРасчетов - Булево - Ложь, если объект расчетов создавать не нужно.
// 		
// 		* Дата - Строка - Путь к реквизиту объекта, содержащему дату документа.
// 		* ВалютаДокумента - Строка - Путь к реквизиту объекта, содержащему валюту документа.
// 		* СуммаДокумента - Строка - Путь к реквизиту объекта, содержащему сумму документа в валюте документа.
// 		* Организация - Строка- Путь к реквизиту объекта, содержащему организацию, от лица которой производится хозяйственная операция.
// 		* Партнер - Строка - Путь к реквизиту объекта, содержащему партнера, с которым возникают взаиморасчеты у организации.
// 		* Контрагент - Строка - Путь к реквизиту объекта, содержащему контрагента или организацию, с которой возникают взаиморасчеты у организации.
// 		
// 		* ВалютаВзаиморасчетов - Строка - Путь к реквизиту объекта, содержащему валюту, по который ведутся взаиморасчеты организации с контрагентом.
// 		* СуммаВзаиморасчетов - Строка - Путь к реквизиту объекта, содержащему общую сумму взаиморасчетов документа, без учета залога за тару.
// 		* СуммаНДСВзаиморасчетов - Строка - Путь к реквизиту объекта, содержащему сумму НДС в валюте взаиморасчетов.
// 		* СуммаВзаиморасчетовПоТаре - Строка - Путь к реквизиту объекта, содержащему общую сумму залога за тару.
// 		
// 		* Договор - Строка - Путь к реквизиту объекта, содержащему договор организации с контрагентом, в рамках которого возникают взаиморасчеты.
// 		* НаправлениеДеятельности - Строка - Путь к реквизиту объекта, содержащему направление деятельности организации, в рамках которой следует отражать взаиморасчеты.
// 		* ПорядокРасчетов - Строка - Путь к реквизиту объекта, содержащему порядок расчетов документа.
// 		* СуммаДокументаФорма - Строка - Путь к реквизиту формы, содержащему сумму документа с учетом залоговой тары.
// 		
// 		* ПутьКДаннымТЧ - Строка - Путь к реквизиту объекта, содержащему основную табличную часть документа.
// 		* ИмяРеквизитаТЧСуммаСНДС - Строка - Имя реквизита табличной части, содержащего сумму строки с ндс в валюте документа.
// 		* ИмяРеквизитаТЧЗаказ  - Строка - Имя реквизита табличной части, содержащего заказ, по которому производится отгрузка/поставка.
// 		
// 		* ПутьКДаннымТЧРасшифровкаПлатежа - Строка - Путь к реквизиту объекта, содержащему табличную часть "Расшифровка платежа" документа.
// 		* Соглашение - Строка - Путь к реквизиту объекта, содержащему соглашение с клиентом или поставщиком.
// 		* БанковскийСчетОрганизации - Строка - Путь к реквизиту объекта, содержащему банковский счет организации.
// 		* БанковскийСчетКонтрагента - Строка - Путь к реквизиту объекта, содержащему банковский счет контрагента.
// 		* Касса - Строка - Путь к реквизиту объекта, содержащему кассу.
// 		* ФормаОплаты - Строка - Путь к реквизиту объекта, содержащему форму оплаты.
// 		* ОплатаВВалюте - Строка - Путь к реквизиту объекта, содержащему признак "Оплата в валюте".
// 		* ИдентификаторПлатежа - Строка - Путь к реквизиту объекта, содержащему идентификатор платежа.
// 		* ГруппаФинансовогоУчета - Строка - Путь к реквизиту объекта, содержащему группу финансового учета расчетов.
// 		* ОбъектРасчетов - Строка - Пусть к реквизиту объекта или колонке ТЧ, хранящей ссылку /ссылки на справочник Объекты расчетов.
// 		* Ссылка - Строка - Пусть к реквизиту Ссылка, которая будет являться объектом расчетов при расчетах по накладным.
// 		* Подразделение - Строка - Путь к реквизиту объекта, содержащему подразделение.
// 		* Менеджер - Строка - Путь к реквизиту объекта, содержащему ответственного менеджера.
// 		* НомерВходящегоДокумента - Строка - Путь к реквизиту объекта, содержащему номер входящего документа.
// 		* ДатаВходящегоДокумента - Строка - Путь к реквизиту объекта, содержащему дату входящего документа.
// 		* НаименованиеПервичногоДокумента - Строка - Путь к реквизиту объекта, содержащему наименование первичного документа.
// 		
// 		* НакладнаяПоЗаказам - Строка - Путь к реквизиту объекта, содержащему признак того, что документ введен по заказу.
// 		* ЗаказОснование - Строка - Путь к реквизиту объекта, содержащему заказ, по которому введен документ.
// 		* ПартнерПрочиеОтношения - Булево - Истина, если подбирать следует только по партнерам с признаком "Прочие отношения".
// 		* ПодборДебиторскойЗадолженности - Булево - Истина, если подбирается дебиторская задолженность.
// 		* ПодборТолькоБезусловнойЗадолженности - Булево - Истина, если подбирается только фактическая задолженность.
// 		* ОплатаПоЗаявкам - Строка - Путь к флагу платежного документа по заявкам на расходование денежных средств.
// 		
// 		* КурсЧислитель - Строка - Путь к реквизиту объекта, содержащему курс-числитель валюты документа относительно валюты взаиморасчетов.
// 		* КурсЗнаменатель - Строка - Путь к реквизиту объекта, содержащему курс-знаменатель валюты документа относительно валюты взаиморасчетов.
// 		* ВалютыИКурсДокументаТолькоПросмотр - Булево - Истина, если в форме редактирования валют и курсов документа ничего нельзя менять.
// 		* ВалютаДокументаТолькоПросмотр - Булево - Истина, если в форме редактирования валют и курсов документа нельзя менять валюту документа.
// 		* ВалютаВзаиморасчетовТолькоПросмотр - Булево - Истина, если в форме редактирования валют и курсов документа  нельзя менять валюту взаиморасчетов.
// 		* НеПоказыватьРасчеты - Булево - Истина, если в форме редактирования валют и курсов документа нужно скрыть валюту и сумму взаиморасчетов.
// 		* НеПересчитыватьСуммуДокумента - Булево - Истина, если в форме редактирования валют и курсов документа не нужно предлагать пересчитывать сумму документа.
// 		
// 		* ПутьКДаннымТЧЭтапыОплаты - Строка - Путь к реквизиту объекта, содержащему табличную часть этапов графика оплаты.
// 		* ДатаПлатежа - Строка - Путь к реквизиту объекта, содержащему дату планового платежа по документу.
// 		* ГрафикОплаты - Строка - Путь к реквизиту объекта, содержащему шаблон графика оплаты документа.
// 		* ДатаСогласования - Строка - Путь к реквизиту объекта, содержащему дату, от которой следует считать этапы графика оплаты с отсчетом от даты согласования.
// 		* ДатаОтгрузки - Строка - Путь к реквизиту объекта, содержащему дату, от которой следует считать этапы графика оплаты с отсчетом от/до даты отгрузки и от даты перехода права собственности.
// 		
// 		* СуммаЗалогаЗаТаруФорма - Строка - Путь к реквизиту формы, содержащему сумму залога за тару в валюте документа.
// 		* ЭтапыОплатыТолькоПросмотр - Булево - Признак Только просмотр для открываемой формы редактирования правил оплаты.
// 		* ВозможнаНакладнаяПоНесколькимЗаказам - Булево - Истина, если накладная может быть введена по нескольким заказам.
// 		* ИсточникСуммТабличнаяЧасть - Булево - Истина, если объект предоставляет интерфейс ПоместитьСуммыПоЗаказамВоВременноеХранилище() для сложного расчета сумм документа
// 		
// 		* ДоговорКомиссионера - Строка - Путь к реквизиту объекта, содержащему договор с комиссионероом для определения реквизитов ГФУ, ПорядокРасчетов, ВалютаВзаиморасчетов, ОплатаВВалюте при учете продаж.
// 		* ВестиРасчетыЧерезКонечныхПокупателей - Булево - Признак, что взаиморасчеты по комиссионным продажам идут через конечного покупателя.
// 		* ДокументОснование - Строка - путь к основанию документа.
// 		* НазначениеПлатежа - Строка - путь к назначению платежа в объекте.
// 		* ТСП - Строка - путь к складу в объекте, используется для получения настройки подключения к СБП.
// 		* ДополнительнаяИнформация - Строка - путь к реквизиту с дополнительной информацией по документу, используется на странице онлайн-заказа.
// 		* ЭтоПереходПраваСобственности2_5 - Булево - Признак продажи с отложенным правом собственности 2.5.
// 		* ОбъектРасчетовСлужебный - Булево - Признак того, что объект расчетов является служебным, и не предназначен для интерактивного выбора.
//
Функция ПараметрыМеханизма() Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	//Имена элементов форм для текущего набора параметров
	ЭлементыФормы = Новый Структура();
	
	#Область ОбязательныеПараметры
	
	//Если все опции ложь, то это платеж или служебный документ.
	СтруктураПараметров.Вставить("ЭтоЗаказ",                         Ложь);
	СтруктураПараметров.Вставить("ЭтоСправочник",                    Ложь);
	СтруктураПараметров.Вставить("ЭтоПродажаЗакупка",                Ложь);
	
	//Определяет какой регистр двигают параметры, какие общие формы, перечисления и справочники использовать.
	СтруктураПараметров.Вставить("ТипРасчетов",                      Перечисления.ТипыРасчетовСПартнерами.ПустаяСсылка());
	СтруктураПараметров.Вставить("Организация",                      "Объект.Организация");
	
	// При определенных значениях реквизитов документа он может не изменять взаиморасчеты в части оплат или отгрузок.
	// Пример - Передача товара на комиссию.
	//
	// Если оба флага отрицательны, то скрывается гиперссылка "Расчеты", очищаются суммы взаиморасчеты и табличные части механизма.
	// При отрицательном значении будут скрыты кнопки ЗачетОплаты и ЭтапыОплаты, но можно будет менять валюты и курс.
	СтруктураПараметров.Вставить("ИзменяетПланОплаты",               Истина);
	СтруктураПараметров.Вставить("ИзменяетПланОтгрузкиПоставки",     Истина);
	
	//Отвечает за создание объекта расчетов, по умолчанию все объекты могут являться объектом расчетов.
	СтруктураПараметров.Вставить("МожетЯвлятьсяОбъектомРасчетов",    Истина);
	
	// Дата отражения документа в системе.
	// Используется для получения остатков просроченной задолженности для функции ограничения задолженности.
	// Используется для получения курсов валют документа. 
	// Используется для заполнения этапов оплаты и расшифровки платежа по умолчанию.
	СтруктураПараметров.Вставить("Дата",                             "Объект.Дата");
	// Системный номер объекта
	СтруктураПараметров.Вставить("Номер",                            "Объект.Номер");
	
	// Валюта и сумма операции. Обязательно путь к реквизитам объекта.
	СтруктураПараметров.Вставить("ВалютаДокумента",                  "Объект.Валюта");
	СтруктураПараметров.Вставить("СуммаДокумента",                   "Объект.СуммаДокумента");
	
	// Используются для генерации объектов расчетов и аналитики.
	СтруктураПараметров.Вставить("Партнер",                          "Объект.Партнер");
	СтруктураПараметров.Вставить("Контрагент",                       "Объект.Контрагент");
	
	//При изменении этих реквизитов объекта парамтеры механизма будут перекэшированы.
	СтруктураПараметров.Вставить("ВлияющиеРеквизиты",                "");
	
	#КонецОбласти
	
	#Область НеобязательныеПараметры
	
	// Отличные от валюты и суммы документа реквизиты. Если не заполнен, то для чтения будет взята валюта документа.
	СтруктураПараметров.Вставить("ВалютаВзаиморасчетов",             "");
	СтруктураПараметров.Вставить("СуммаВзаиморасчетов",              "");
	СтруктураПараметров.Вставить("СуммаНДСВзаиморасчетов",              "");
	СтруктураПараметров.Вставить("СуммаВзаиморасчетовПоТаре",        "");
	
	// Используется для генерации аналитики проведения и объекта расчетов, определения графика исполнения договора.
	СтруктураПараметров.Вставить("Договор",                          "Объект.Договор");
	// Используется для получения реквизитов ГФУ, ПорядокРасчетов, ВалютаВзаиморасчетов, ОплатаВВалюте при учете продаж конечным покупателям.
	СтруктураПараметров.Вставить("ДоговорКомиссионера",              "");
	СтруктураПараметров.Вставить("ВестиРасчетыЧерезКонечныхПокупателей", Ложь);
	
	// Используется для объекта расчетов.
	СтруктураПараметров.Вставить("НаправлениеДеятельности",          "Объект.НаправлениеДеятельности");
	
	// Порядок расчетов документа.
	СтруктураПараметров.Вставить("ПорядокРасчетов",                  "Объект.ПорядокРасчетов");
	СтруктураПараметров.Вставить("УсловныйПорядокРасчетов",          "");
	
	// Сумма всего с залоговой тарой. Путь к итоговому показателю формы (реквизиту).
	// Используется для отображения гиперссылок, редактирования и заполнения графика плановых оплат
	// редактирования расшифровки платежа и т.д.
	СтруктураПараметров.Вставить("СуммаДокументаФорма",              ""); 
	
	// Реквизит формы итоговых показателей, содержащий сумму залога за тару в валюте документа.
	// Используется в заполнении этапов графика оплаты.
	СтруктураПараметров.Вставить("СуммаЗалогаЗаТаруФорма",               "");
	
	// Табличная часть, по которой распределяется сумма взаиморасчетов, сумма залога за тару или разбивка накладной по заказам.
	// Используется для отображения гиперссылок, редактирования и заполнения графика плановых оплат
	// редактирования расшифровки платежа, если не заполнен параметр СуммаДокументаФорма.
	// В ТЧ заполняются объекты расчетов по заказам.
	СтруктураПараметров.Вставить("ПутьКДаннымТЧ",                    "");
	// Имя реквизита суммы с ндс табличной части.
	СтруктураПараметров.Вставить("ИмяРеквизитаТЧСуммаСНДС",          "СуммаСНДС");
	// Имя реквизита тч, содержащего заказ.
	СтруктураПараметров.Вставить("ИмяРеквизитаТЧЗаказ",              "");
	
	// Путь к табличной части Расшифровка платежа.
	// Используется в функция зачета оплат, распределения взаиморасчетов, распределения оплаты.
	СтруктураПараметров.Вставить("ПутьКДаннымТЧРасшифровкаПлатежа",  "");
	
	// Используется для заполнения значений по умолчанию, заполнения графика плановых оплат и даты платежа.
	СтруктураПараметров.Вставить("Соглашение",                       "Объект.Соглашение");
	
	// Используются для определения значения ОплатаВВалюте и в форме редактирования правил оплаты.
	СтруктураПараметров.Вставить("БанковскийСчетОрганизации",        "Объект.БанковскийСчетОрганизации");
	СтруктураПараметров.Вставить("БанковскийСчетКонтрагента",        "Объект.БанковскийСчетКонтрагента");
	СтруктураПараметров.Вставить("Касса",                            "Объект.Касса");
	СтруктураПараметров.Вставить("ФормаОплаты",                      "Объект.ФормаОплаты");
	СтруктураПараметров.Вставить("ОплатаВВалюте",                    "Объект.ОплатаВВалюте");
	// Используется в форме правил оплаты и для подбора в расшифровку платежа объектов расчетов.
	СтруктураПараметров.Вставить("ИдентификаторПлатежа",             "Объект.ИдентификаторПлатежа");
	СтруктураПараметров.Вставить("НалогообложениеНДС",               "Объект.НалогообложениеНДС");
	
	// Реквизиты для объекта расчетов, используются в проведении.
	СтруктураПараметров.Вставить("ГруппаФинансовогоУчета",           "Объект.ГруппаФинансовогоУчета");
	СтруктураПараметров.Вставить("Подразделение",                    "Объект.Подразделение");
	СтруктураПараметров.Вставить("Менеджер",                         "");
	СтруктураПараметров.Вставить("НомерВходящегоДокумента",          "");
	СтруктураПараметров.Вставить("ДатаВходящегоДокумента",           "");
	СтруктураПараметров.Вставить("НаименованиеПервичногоДокумента",  "");
		
	// Используется для определения объекта расчетов.
	СтруктураПараметров.Вставить("НакладнаяПоЗаказам",               "");
	
	// Заказ основание из шапки.
	// Используется при определении порядка расчетов по умолчанию и списка доступных порядков для выбора.
	// Используется для определения объекта расчетов.
	СтруктураПараметров.Вставить("ЗаказОснование",                   ""); 
	
	// Имя кнопки, открывающей помощник зачета оплат для текущего набора параметров.
	ЭлементыФормы.Вставить("ЗачетОплаты",                      "");
	// Имя элемента таблицы формы, отображающей сумму взаиморасчетов.
	// Используется для установки условного оформления.
	// Следует заполнить если документ поддерживает построчное ручное редактирование сумм взаиморасчетов.
	ЭлементыФормы.Вставить("СуммаВзаиморасчетовТЧ",            "");
	
	// Имя элемента формы содержащего группу финансового учета для отражения текущего набора параметров по БУ.
	ЭлементыФормы.Вставить("ГруппаФинансовогоУчета",           "");
	ЭлементыФормы.Вставить("НаправлениеДеятельности",          "");
	
	// Место хранения ссылки/ссылок на справочник Объекты расчетов. Может быть в шапке или в табличной части.
	СтруктураПараметров.Вставить("ОбъектРасчетов",             "");
	
	СтруктураПараметров.Вставить("Ссылка",                     "Объект.Ссылка");
	
	// Расчет сумм документа через алгоритм модуля объекта документа
	СтруктураПараметров.Вставить("ИсточникСуммТабличнаяЧасть", Ложь);
	
	#КонецОбласти
	
	#Область РедактированиеРасшифровкиПлатежа
	
	// Если расшифровка редактируется в общей форме, используется в Зачете возвратов товаров.
	ЭлементыФормы.Вставить("ГиперссылкаРасшифровкаПлатежа",    "");
	
	// Если расшифровка редактируется в документе.
	// Используется в распределении оплаты.
	СтруктураПараметров.Вставить("ПлатежиПо275ФЗ",             "");
	ЭлементыФормы.Вставить("РасшифровкаПлатежа",               "");
	ЭлементыФормы.Вставить("ПодборВРасшифровкуПлатежа",        "");
	
	// Настройки подбора и выбора в ТЧ Расшифровка платежа
	
	// Для подбора остатков расчетов по партнерам с типом расчетов Прочие отношения, без отбора по партнеру.
	СтруктураПараметров.Вставить("ПартнерПрочиеОтношения",               Ложь); 
	СтруктураПараметров.Вставить("ПодборДебиторскойЗадолженности",       Ложь);
	СтруктураПараметров.Вставить("ПодборТолькоБезусловнойЗадолженности", Ложь);
	СтруктураПараметров.Вставить("ОплатаПоЗаявкам",                      Ложь);
	
	#КонецОбласти
	
	#Область РедактированиеВалютИВалютныхСуммДокумента
	
	// Курс документа - одна пара для документа.
	// Используются для расчета суммы взаиморасчетов и в форме редактирования валют и курсов документа.
	СтруктураПараметров.Вставить("КурсЧислитель",                           "");
	СтруктураПараметров.Вставить("КурсЗнаменатель",                         "");
	
	// Имя гиперссылки, отображающей текущий курс взаиморасчетов документа и открывающей соответствующую форму.
	ЭлементыФормы.Вставить("НадписьВалюты",                    "");
	
	// Используется, когда в вызывающей форме не стоит флаг ТолькоПросмотр, но ограничить редактирование валют нужно.
	СтруктураПараметров.Вставить("ВалютыИКурсДокументаТолькоПросмотр", Ложь);
	
	// Используются в условии через ИЛИ с правом отклонения от условий продаж/закупок.
	СтруктураПараметров.Вставить("ВалютаДокументаТолькоПросмотр",      Ложь);
	СтруктураПараметров.Вставить("ВалютаВзаиморасчетовТолькоПросмотр", Ложь);
	// Используется для ограничения редактирования суммы в валюте документа на форме валют и курсов
	СтруктураПараметров.Вставить("СуммаДокументаТолькоПросмотр",       Ложь);
	
	// Если не следует показывать сумму и валюту взаиморасчетов исходя из данных документа.
	СтруктураПараметров.Вставить("НеПоказыватьРасчеты",                Ложь);
	// Если не требуется предлагать пересчет суммы документа.
	СтруктураПараметров.Вставить("НеПересчитыватьСуммуДокумента",      Ложь);
	
	#КонецОбласти
	
	#Область ГрафикПлановойОплатыИДатаПлатежа
	
	// Функция Этапы оплаты и дата платежа
	СтруктураПараметров.Вставить("ПутьКДаннымТЧЭтапыОплаты",           "");
	СтруктураПараметров.Вставить("ДатаПлатежа",                        "");
	СтруктураПараметров.Вставить("ГрафикОплаты",                       "");
	СтруктураПараметров.Вставить("ДатаСогласования",                   "");
	СтруктураПараметров.Вставить("ДатаОтгрузки",                       "Объект.Дата");
	СтруктураПараметров.Вставить("ДатаПоступления",                    "");
	СтруктураПараметров.Вставить("ДатаПереходаПраваСобственности",     "");
	СтруктураПараметров.Вставить("НетКонтроляПредоплаты",              Ложь);
	СтруктураПараметров.Вставить("ЕстьДатаПереходаПраваСобственности", Ложь);
	СтруктураПараметров.Вставить("ОтгружатьОднойДатой",                "");
	
	// Имя гиперссылки, отображающей текущие правила оплаты документа и открывающей форму Правила оплаты.
	ЭлементыФормы.Вставить("НадписьЭтапы",                     "");
	// Путь к реквизиту формы отображаемому в поле надписи -гиперссылке
	СтруктураПараметров.Вставить("НадписьЭтапыОплаты",                  "");
	// Поле ввода порядка оплаты
	ЭлементыФормы.Вставить("ПорядокРасчетов",                  "");
	
	// Если требуется ограничить редактирование плавил оплаты.
	СтруктураПараметров.Вставить("ЭтапыОплатыТолькоПросмотр",            Ложь);
	// Если истина и накладная по заказам то будет отображена расширенная форма графика оплаты, несмотря на функциональную опцию "Упрощенная форма оплаты".
	СтруктураПараметров.Вставить("ВозможнаНакладнаяПоНесколькимЗаказам", Ложь);
	// Скрывает Банковский счет, кассу, оплату в валюте и УИП в форме плавил оплаты, используется в самообслуживании.
	СтруктураПараметров.Вставить("НеУказыватьИсточникиОплаты", Ложь);
	// Позволяет указывать график оплаты при отсутствии движений по плану оплат.
	СтруктураПараметров.Вставить("ЗаказКакСчет", Ложь);
	СтруктураПараметров.Вставить("ЭтоПереходПраваСобственности2_5", Ложь);
	
	#КонецОбласти
	
	#Область СостояниеВзаиморасчетов
	
	ЭлементыФормы.Вставить("НадписьРасчеты",                   ""); // Имя гиперссылки, отображающей состояние расчетов и открывающей соответствующий отчет,
	
	#КонецОбласти
	
	#Область ОграниченияЗадолженностиПоДоговору
	
	ЭлементыФормы.Вставить("ОграничениеЗадолженностиТекст",    ""); // Гиперссылка отображающая состояние ограничения задолженности
	ЭлементыФормы.Вставить("ОграничениеЗадолженностиКартинка", ""); // Картинка отображающая запрет отгрузки
	
	#КонецОбласти
	
	СтруктураПараметров.Вставить("ИзменяетРасчетыСтрокой", "ИСТИНА");
	СтруктураПараметров.Вставить("ТолькоОстатки", Ложь);
	СтруктураПараметров.Вставить("ЭлементыФормы", ЭлементыФормы);
	СтруктураПараметров.Вставить("ОрганизацияДоговора", Справочники.Организации.ПустаяСсылка());
	СтруктураПараметров.Вставить("КонтрагентДоговора", Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДатаКурсаВалютыДокумента", "");
	СтруктураПараметров.Вставить("УдержатьВознаграждение", Ложь);
	СтруктураПараметров.Вставить("ВернутьМногооборотнуюТару", Ложь);
	СтруктураПараметров.Вставить("ТребуетсяЗалогЗаТару", Ложь);
	СтруктураПараметров.Вставить("ОперацияССамозанятым", Ложь);
	СтруктураПараметров.Вставить("УчитыватьФилиалы", Истина);
	СтруктураПараметров.Вставить("ОбъектРасчетовСлужебный", Ложь);
	
	СтруктураПараметров.Вставить("ДокументОснование", "");
	СтруктураПараметров.Вставить("НазначениеПлатежа", "");
	СтруктураПараметров.Вставить("ТСП", ""); // Торгово-сервисное предприятие для получения настройки подключения
	СтруктураПараметров.Вставить("ДополнительнаяИнформация", "");
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Дополняет структуру/ массив структур данными настроек ИБ, задает соответствие элементов формы индексам элементов массива параметров.
// 
// Параметры:
// 	Объект - ДокументОбъект, СправочникОбъект, ФормаКлиентскогоПриложения - Объект, по которому требуется дополнить параметры
// 	ПараметрыМеханизма - см. ПараметрыМеханизма
//
// Возвращаемое значение:
// 	Структура - Описание:
// * МассивПараметров - Массив из см. ПараметрыМеханизма - Включает массив структур параметров и общие данные.
//
Функция ДополненныеПараметрыМеханизма(Объект, ПараметрыМеханизма = Неопределено) Экспорт
	
	Если ТипЗнч(Объект) <> Тип("ФормаКлиентскогоПриложения") И ПараметрыМеханизма = Неопределено Тогда
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
		ПараметрыМеханизма = МенеджерОбъекта.ПараметрыВзаиморасчеты(Объект);
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыМеханизма) = Тип("Массив") Тогда
		МассивПараметров = ПараметрыМеханизма;
	Иначе
		МассивПараметров = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыМеханизма);
	КонецЕсли;
	
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		
		СтруктураПараметров.Вставить("ЗаданГрафикИсполнения", Ложь);
		СтруктураПараметров.Вставить("ГрафикИсполненияДоговора", Неопределено);
		СтруктураПараметров.Вставить("ВариантКурсаДоговора", Перечисления.ВариантыКурсаДоговора.Переменный);
		
		// Хранит даты отгрузки до начала редактирования табличной части заказа для определения изменений
		СтруктураПараметров.Вставить("ДатыОтгрузки", ВзаиморасчетыКлиентСервер.МассивДатОтгрузок(Объект, СтруктураПараметров));
		// Флаг взводится для заказов с несколькими датами отгрузки при изменении дат отгрузок
		СтруктураПараметров.Вставить("ИзменилосьНесколькоДатОтгрузки", Ложь);
		//Флаг указывает, что график оплат заполнен по умолчанию и не изменялся
		СтруктураПараметров.Вставить("ЕстьРучныеИзмененияГрафикаОплат", Ложь);
		
		// Параметры используются для расчета планового графика оплаты
		// Берется из соглашения или значения "графика оплаты"
		СтруктураПараметров.Вставить("Календарь", Справочники.ПроизводственныеКалендари.ПустаяСсылка());
		// Берется из соглашения
		СтруктураПараметров.Вставить("СрокПереходаПраваСобственности", 0);
		
		Если ЗначениеЗаполнено(СтруктураПараметров.Договор) Тогда
			Договор = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
			Если ЗначениеЗаполнено(Договор) Тогда
				УстановитьПривилегированныйРежим(Истина);
				Если ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
					РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ЗаданГрафикИсполнения, ГрафикИсполненияДоговора, Организация, ВариантКурсаДоговора, Контрагент");
					СтруктураПараметров.ЗаданГрафикИсполнения    = РеквизитыДоговора.ЗаданГрафикИсполнения;
					СтруктураПараметров.ГрафикИсполненияДоговора = РеквизитыДоговора.ГрафикИсполненияДоговора;
					СтруктураПараметров.ОрганизацияДоговора      = РеквизитыДоговора.Организация;
					СтруктураПараметров.КонтрагентДоговора       = РеквизитыДоговора.Контрагент;
					СтруктураПараметров.ВариантКурсаДоговора     = РеквизитыДоговора.ВариантКурсаДоговора;
				Иначе
					СтруктураПараметров.ВариантКурсаДоговора     = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВариантКурсаДоговора");
				КонецЕсли;
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
		КонецЕсли;
		
		ГрафикОплатыСоглашения = Справочники.ГрафикиОплаты.ПустаяСсылка();
		ГрафикОплаты = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ГрафикОплаты); // СправочникСсылка.ГрафикиОплаты
		Если ЗначениеЗаполнено(СтруктураПараметров.Соглашение) Тогда
			Соглашение = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Соглашение);
			Если ЗначениеЗаполнено(Соглашение) Тогда
				РеквизитыСоглашения = ВзаиморасчетыСлужебный.РеквизитыСоглашения(Соглашение);
				
				СтруктураПараметров.Календарь                      = РеквизитыСоглашения.Календарь;
				СтруктураПараметров.СрокПереходаПраваСобственности = РеквизитыСоглашения.СрокПереходаПраваСобственности;
				Если ТипЗнч(Соглашение) = Тип("СправочникСсылка.СоглашенияСКлиентами") И ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты") Тогда
					ГрафикОплатыСоглашения                         = РеквизитыСоглашения.ГрафикОплаты;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		// Календарь приоритетно берем из указанного графика оплаты, а не из графика соглашения.
		Если СтруктураПараметров.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом
			И ЗначениеЗаполнено(ГрафикОплаты) И ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты")
			И (ГрафикОплатыСоглашения <> ГрафикОплаты Или Не ЗначениеЗаполнено(СтруктураПараметров.Календарь)) Тогда
			УстановитьПривилегированныйРежим(Истина);
			СтруктураПараметров.Календарь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГрафикОплаты, "Календарь");
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
		
			МассивИспользуемыхЭлементовФормы = Новый Массив;
			Для Каждого Элемент Из СтруктураПараметров.ЭлементыФормы Цикл
				Если ЗначениеЗаполнено(Элемент.Значение) Тогда
					МассивИспользуемыхЭлементовФормы.Добавить(Элемент.Значение);
				КонецЕсли;
			КонецЦикла;
			СтруктураПараметров.Вставить("ИспользуемыеЭлементыФормы", МассивИспользуемыхЭлементовФормы);
			
			Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) Тогда
				ОбъектФормы = Объект.Объект; //ДокументОбъект
				МетаданныеОбъекта = ОбъектФормы.Ссылка.Метаданные();
				СтруктураПараметров.Вставить("ПараметрыВыбораРеквизитов", ЭтапыОплатыСервер.ПараметрыВыбораРеквизитовОплаты(МетаданныеОбъекта));
			КонецЕсли;
			
			СоответствиеИспользуемыхРеквизитов = Новый Соответствие;
			Для Каждого Элемент Из СтруктураПараметров Цикл
				Если ЗначениеЗаполнено(Элемент.Значение) Тогда
					Если СоответствиеИспользуемыхРеквизитов.Получить(Элемент.Значение) = Неопределено Тогда
						СоответствиеИспользуемыхРеквизитов.Вставить(Элемент.Значение, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Элемент.Ключ));
					Иначе
						СоответствиеИспользуемыхРеквизитов[Элемент.Значение].Добавить(Элемент.Ключ);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			СтруктураПараметров.Вставить("ИспользуемыеРеквизиты", СоответствиеИспользуемыхРеквизитов);
		
		КонецЕсли;
		
		СтруктураПараметров.Вставить("ИзменяетРасчеты", СтруктураПараметров.ИзменяетПланОплаты ИЛИ СтруктураПараметров.ИзменяетПланОтгрузкиПоставки);
		
		СтруктураПараметров.Вставить("ДокументРасчетовСКлиентами", СтруктураПараметров.ТипРасчетов = ПредопределенноеЗначение("Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом"));
		СтруктураПараметров.Вставить("ДокументРасчетовСПоставщиками", СтруктураПараметров.ТипРасчетов = ПредопределенноеЗначение("Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком"));
		
		СтруктураПараметров.Вставить("ЭтоПлатежИлиПрочийДокумент", НЕ СтруктураПараметров.ЭтоЗаказ И НЕ СтруктураПараметров.ЭтоСправочник И НЕ СтруктураПараметров.ЭтоПродажаЗакупка);
		
		СтруктураПараметров.Вставить("АдресЭтапыОплаты", "");
		СтруктураПараметров.Вставить("АдресСуммПоЗаказам", "");
		СтруктураПараметров.Вставить("АдресРасшифровкаПлатежа", "");
		СтруктураПараметров.Вставить("СуммаРасшифровкиПлатежа", 0);
		
		Если НЕ СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент Тогда
			ОбъектМетаданных = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, "Объект.Ссылка").Метаданные();
			СтруктураПараметров.Вставить("ПараметрыВыбораРеквизитов", ЭтапыОплатыСервер.ПараметрыВыбораРеквизитовОплаты(ОбъектМетаданных))
		КонецЕсли;
		
		СтруктураПараметров.Вставить("ОрганизацияВСтроках", СтрЧислоВхождений(СтруктураПараметров.Организация, ".") > 1
			И ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа)
			И СтрРазделить(СтруктураПараметров.Организация, ".")[1] = СтрРазделить(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа, ".")[1]);
		СтруктураПараметров.Вставить("КонтрагентВСтроках", СтрЧислоВхождений(СтруктураПараметров.Контрагент, ".") > 1
			И ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа)
			И СтрРазделить(СтруктураПараметров.Контрагент, ".")[1] = СтрРазделить(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа, ".")[1]);
		СтруктураПараметров.Вставить("ПартнерВСтроках", СтрЧислоВхождений(СтруктураПараметров.Партнер, ".") > 1
			И ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа)
			И СтрРазделить(СтруктураПараметров.Партнер, ".")[1] = СтрРазделить(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа, ".")[1]);
		СтруктураПараметров.Вставить("ВалютаВзаиморасчетовВСтроках", СтрЧислоВхождений(СтруктураПараметров.ВалютаВзаиморасчетов, ".") > 1
			И ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа)
			И СтрРазделить(СтруктураПараметров.ВалютаВзаиморасчетов, ".")[1] = СтрРазделить(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа, ".")[1]);
			
		Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ВалютаВзаиморасчетов) И ЗначениеЗаполнено(СтруктураПараметров.ВалютаДокумента) Тогда
			СтруктураПараметров.ВалютаВзаиморасчетов = СтруктураПараметров.ВалютаДокумента;
		КонецЕсли;
			
	КонецЦикла;
	
	СистемныеНастройки = Новый Структура();
	СистемныеНастройки.Вставить("ИспользоватьГрафикиОплаты",                                    ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты"));
	СистемныеНастройки.Вставить("ИспользоватьСоглашенияСКлиентами",                             ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	СистемныеНастройки.Вставить("ИспользоватьСоглашенияСПоставщиками",                          ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками"));
	СистемныеНастройки.Вставить("ИспользоватьДоговорыСКлиентами",                               ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"));
	СистемныеНастройки.Вставить("ИспользоватьДоговорыСПоставщиками",                            ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	СистемныеНастройки.Вставить("ИспользоватьДоговорыМеждуОрганизациями",                       ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыМеждуОрганизациями"));
	СистемныеНастройки.Вставить("ИспользоватьДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров", ПолучитьФункциональнуюОпцию("ИспользоватьДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров"));
	СистемныеНастройки.Вставить("ИспользоватьУпрощеннуюСхемуОплатыВЗакупках",                   ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюСхемуОплатыВЗакупках"));
	СистемныеНастройки.Вставить("ИспользоватьУпрощеннуюСхемуОплатыВПродажах",                   ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюСхемуОплатыВПродажах"));
	СистемныеНастройки.Вставить("ИспользоватьРеализациюПоНесколькимЗаказам",                    ПолучитьФункциональнуюОпцию("ИспользоватьРеализациюПоНесколькимЗаказам"));
	
	СистемныеНастройки.Вставить("НоваяАрхитектураВзаиморасчетов", ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов"));
	
	СистемныеНастройки.Вставить("ВалютаУправленческогоУчета", Константы.ВалютаУправленческогоУчета.Получить());
	
	ДополненныеПараметрыМеханизма = Новый Структура();
	ДополненныеПараметрыМеханизма.Вставить("МассивПараметров", МассивПараметров);
	ДополненныеПараметрыМеханизма.Вставить("СистемныеНастройки", СистемныеНастройки);
	ДополненныеПараметрыМеханизма.Вставить("ОповеститьОЗаполненииЭтапов", Ложь);
	ДополненныеПараметрыМеханизма.Вставить("ОповеститьОбИзмененииОбъектаРасчетов", Ложь);
	ДополненныеПараметрыМеханизма.Вставить("ИзмененныйОбъектРасчетов", Справочники.ОбъектыРасчетов.ПустаяСсылка());
	
	
	Возврат ДополненныеПараметрыМеханизма;
	
КонецФункции

#Область МодульОбъекта

//Выполняет первоначальное заполнение валют, порядка расчетов, оплата в валюте, этапов графика оплат, курса и кратности
//значениями по умолчанию, если значения еще не заполнены.
//
// Параметры:
// 	Объект - ДокументОбъект, СправочникОбъект - обрабатываемый объект.
// 	ДанныеЗаполнения - Структура, ДокументОбъект - ДанныеЗаполнения из обработки заполнения документа.
// 
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения) Экспорт
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	ПараметрыМеханизма = МенеджерОбъекта.ПараметрыВзаиморасчеты(Объект);
	
	ДополненныеПараметрыМеханизма = ДополненныеПараметрыМеханизма(Объект, ПараметрыМеханизма);
	
	Для Каждого СтруктураПараметров Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
		
		Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
		Если ЗначениеЗаполнено(Организация) Тогда
			ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
			И ДанныеЗаполнения.Свойство("Организация")
			И ЗначениеЗаполнено(ДанныеЗаполнения.Организация)
			И ТипЗнч(ДанныеЗаполнения.Организация) = Тип("СправочникСсылка.Организации") Тогда
			ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеЗаполнения.Организация);
		Иначе
			ВалютаРегламентированногоУчета = Неопределено;
		КонецЕсли;
		
		ОбработатьЗаполнить(Объект, СтруктураПараметров, ДанныеЗаполнения, "ВалютаДокумента", ВалютаРегламентированногоУчета);
		ОбработатьЗаполнить(Объект, СтруктураПараметров, ДанныеЗаполнения, "ВалютаВзаиморасчетов", ВалютаРегламентированногоУчета);
		ОбработатьЗаполнить(Объект, СтруктураПараметров, ДанныеЗаполнения, "ПорядокРасчетов", ВзаиморасчетыСлужебный.ПорядокРасчетовПоПараметрам(Объект, СтруктураПараметров));
		// Оплата в валюте:
		ОплатаВВалютеПоУмолчанию = ВзаиморасчетыСлужебный.ОплатаВВалютеПоУмолчанию(Объект, СтруктураПараметров);
		ОплатаВВалюте = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.ОплатаВВалюте);
		Если ОплатаВВалюте <> Неопределено Тогда
			ОплатаВВалюте.Данные[ОплатаВВалюте.Имя] = ОплатаВВалютеПоУмолчанию
		КонецЕсли;
		
		Если ДанныеЗаполнения <> Неопределено
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "ГруппаФинансовогоУчета")
			И Не ЗначениеЗаполнено(ДанныеЗаполнения.ГруппаФинансовогоУчета)
			И ЗначениеЗаполнено(СтруктураПараметров.ГруппаФинансовогоУчета) Тогда
			
			ГФУПоУмолчанию = ВзаиморасчетыСлужебный.ГФУПоУмолчанию(Объект, СтруктураПараметров, ДополненныеПараметрыМеханизма.СистемныеНастройки);
			ГФУДляПрисвоения = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.ГруппаФинансовогоУчета);
			
			Если ГФУДляПрисвоения <> Неопределено Тогда
				ГФУДляПрисвоения.Данные[ГФУДляПрисвоения.Имя] = ГФУПоУмолчанию;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДополненныеПараметрыМеханизма.МассивПараметров.Количество() > 0
		И ЗначениеЗаполнено(ДополненныеПараметрыМеханизма.МассивПараметров[0].КурсЧислитель)
		И ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ДополненныеПараметрыМеханизма.МассивПараметров[0].КурсЧислитель) = 0 Тогда
		ВзаиморасчетыСлужебный.ЗаполнитьКурсКратностьПоУмолчанию(Объект, ДополненныеПараметрыМеханизма);
	КонецЕсли;
	
КонецПроцедуры

//Выполняет очистку реквизитов при копировании документов.
//В продажах и закупках чистится расшифровка платежа, этапы графика оплат, суммы взаиморасчетов.
//
// Параметры:
// 	Объект - ДокументОбъект, СправочникОбъект - обрабатываемый объект.
// 
Процедура ПриКопировании(Объект) Экспорт
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	ПараметрыМеханизма = МенеджерОбъекта.ПараметрыВзаиморасчеты(Объект);
	
	ДополненныеПараметрыМеханизма = ДополненныеПараметрыМеханизма(Объект, ПараметрыМеханизма);
	Для Каждого СтруктураПараметров Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
		
		Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
			РасшифровкаПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа);
			Если СтруктураПараметров.ЭтоПродажаЗакупка Тогда
				РасшифровкаПлатежа.Очистить();
			Иначе
				МассивОбъектовРасчетов = РасшифровкаПлатежа.ВыгрузитьКолонку("ОбъектРасчетов");
				РеквизитыОбъектовРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивОбъектовРасчетов,"Объект");
				Для Каждого Стр Из РасшифровкаПлатежа Цикл
					Если ТипЗнч(РеквизитыОбъектовРасчетов[Стр.ОбъектРасчетов]) = ТипЗнч(Объект.Ссылка) Тогда
						Стр.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		РеквизитИдентификаторПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.ИдентификаторПлатежа);
		Если РеквизитИдентификаторПлатежа <> Неопределено Тогда
			РеквизитИдентификаторПлатежа.Данные[РеквизитИдентификаторПлатежа.Имя] = "";
		КонецЕсли;
		
		ВзаиморасчетыСлужебный.ОчиститьЭтапыГрафикаОплаты(Объект, СтруктураПараметров);
		ВзаиморасчетыСлужебный.ОчиститьСуммыВзаиморасчетовТЧ(Объект, СтруктураПараметров);
		ВзаиморасчетыСлужебный.ОчиститьОбъектРасчетов(Объект, СтруктураПараметров);
	КонецЦикла;
	
КонецПроцедуры

//Проверяет и заполняет необходимые данные механизма и документа:
//	Сумму взаиморасчетов документа;
//	Сумму взаиморасчетов в основных табличных частях документа;
//	Порядок расчетов;
//	Оплату в валюте;
//	Расшифровку платежа;
//	Этапы графика оплат.
//
// Параметры:
// 	Объект - ДокументОбъект, СправочникОбъект - обрабатываемый объект.
// 	Отказ - Булево - Флаг отказ из обработчика документа ПередЗаписью.
// 	РежимЗаписи - РежимЗаписиДокумента - Режим записи документа.
// 
Процедура ПередЗаписью(Объект, Отказ, ЗНАЧ РежимЗаписи = Неопределено) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект,"ДополнительныеСвойства")
		И Объект.ДополнительныеСвойства.Свойство("ДополненныеПараметрыВзаиморасчетов") Тогда
		ДополненныеПараметрыМеханизма = Объект.ДополнительныеСвойства.ДополненныеПараметрыВзаиморасчетов;
	Иначе
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
		ПараметрыМеханизма = МенеджерОбъекта.ПараметрыВзаиморасчеты(Объект);
		ДополненныеПараметрыМеханизма = ДополненныеПараметрыМеханизма(Объект, ПараметрыМеханизма);
	КонецЕсли;
	
	СистемныеНастройки = ДополненныеПараметрыМеханизма.СистемныеНастройки;
	
	Ссылка = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, "Объект.Ссылка");
	
	Если Объект.ЭтоНовый() Тогда
		СсылкаНового = Объект.ПолучитьСсылкуНового();
		Если Не ЗначениеЗаполнено(СсылкаНового) Тогда
			СсылкаНового = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка).ПолучитьСсылку();
			Объект.УстановитьСсылкуНового(СсылкаНового);
		КонецЕсли;
	ИначеЕсли Метаданные.ПодпискиНаСобытия.ПроверитьНомерДокументаПоДатеИОрганизации.Источник.СодержитТип(ТипЗнч(Объект)) Тогда
		ПрефиксацияОбъектовСобытия.ПроверитьНомерДокументаПоДатеИОрганизации(Объект, Отказ, РежимЗаписи, Неопределено);
		Если Не ЗначениеЗаполнено(Объект.Номер) Тогда
			Объект.УстановитьНовыйНомер()
		КонецЕсли;
		Объект.ДополнительныеСвойства.Вставить("ПроверенНомерДокументаПоДатеИОрганизации", Истина);
	КонецЕсли;
	
	Для Каждого СтруктураПараметров Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
		
		Если Объект.ЭтоНовый() Тогда
			СтруктураПараметров.Вставить("СсылкаНового", СсылкаНового);
		КонецЕсли;
		
		ПроверитьЗаполнитьРеквизит(Объект, СтруктураПараметров, "ПорядокРасчетов", ВзаиморасчетыСлужебный.ПорядокРасчетовПоПараметрам(Объект, СтруктураПараметров));
		ПроверитьЗаполнитьРеквизит(Объект, СтруктураПараметров, "ОплатаВВалюте", ВзаиморасчетыСлужебный.ОплатаВВалютеПоУмолчанию(Объект, СтруктураПараметров));
		
		ПроверитьЗаполнитьСуммуВзаиморасчетов(Объект, СтруктураПараметров, СистемныеНастройки);
		ПроверитьЗаполнитьСуммыВзаиморасчетовВТабличнойЧасти(Объект, СтруктураПараметров);
		
		Если СтруктураПараметров.ЭтоСправочник И СтруктураПараметров.Ссылка = СтруктураПараметров.Договор Тогда
			Если Не ЗначениеЗаполнено(Объект.ВариантКурсаДоговора) Тогда
				Объект.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.Переменный;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ СтруктураПараметров.Свойство("СуммыДокумента") И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
			Если СтруктураПараметров.Свойство("ИсточникСуммТабличнаяЧасть") И СтруктураПараметров.ИсточникСуммТабличнаяЧасть Тогда
				СтруктураПараметров.Вставить("СуммыДокумента", ВзаиморасчетыСлужебный.СуммыДокумента(Объект,СтруктураПараметров));
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ЭтапыОплатыСервер.ПроверитьЗаполнитьЭтапыГрафикаОплаты(Объект, ДополненныеПараметрыМеханизма);
		ЭтапыОплатыСервер.ПроверитьЗаполнениеЭтаповГрафикаОплаты(Объект, Отказ, ДополненныеПараметрыМеханизма);
	КонецЕсли;
	
	ОбъектыРасчетовСервер.ПроверитьОбъектыРасчетовПередЗаписью(Объект, ДополненныеПараметрыМеханизма.МассивПараметров, РежимЗаписи, Отказ);
	ЗаписатьКурсыИВалютыДокумента(Объект, ДополненныеПараметрыМеханизма.МассивПараметров, Отказ);
	
	Для Каждого СтруктураПараметров Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ Объект.Проведен Тогда
			ЗаполнитьВозможныеАвансыВНакладной(Объект, СтруктураПараметров);
		КонецЕсли;
		
		//Очистка кэша сумм
		Если СтруктураПараметров.Свойство("СуммыДокумента") Тогда
			СтруктураПараметров.Удалить("СуммыДокумента");
		КонецЕсли;
		
	КонецЦикла
	
КонецПроцедуры

// Перед записью на сервере.
// 
// Параметры:
//  Форма Форма
//  ТекущийОбъект Текущий объект
Процедура ПередЗаписьюНаСервере(Форма, ТекущийОбъект) Экспорт
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДополненныеПараметрыВзаиморасчетов", ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты"));
КонецПроцедуры

// При изменении даты согласования очищает этапы графика оплаты.
// 
// Параметры:
//  Объект - ДокументОбъект, СправочникОбъект - обрабатываемый объект.
Процедура ПриИзмененииДатыСогласования(Объект) Экспорт
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	ПараметрыМеханизма = МенеджерОбъекта.ПараметрыВзаиморасчеты(Объект);
	ДополненныеПараметрыМеханизма = ДополненныеПараметрыМеханизма(Объект, ПараметрыМеханизма);
	
	Для Каждого СтруктураПараметров Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
		
		ЭтапыГрафика = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
		
		ДатаСогласования = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаСогласования);
		ДатаЗаказа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
		
		Для Каждого СтрокаЭтапа Из ЭтапыГрафика Цикл
			Если СтрокаЭтапа.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыСогласования Тогда
				СтруктураПараметров = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
				СтруктураПараметров.ВариантОтсчета                 = СтрокаЭтапа.ВариантОтсчета;
				СтруктураПараметров.Формула                        = СтрокаЭтапа.Формула;
				СтруктураПараметров.Сдвиг                          = СтрокаЭтапа.Сдвиг;
				СтруктураПараметров.ДатаЗаказа                     = ДатаЗаказа;
				СтруктураПараметров.ДатаСогласования               = ДатаСогласования;
				СтруктураПараметров.ДатаОтгрузки                   = Дата(1,1,1);
				СтруктураПараметров.ДатаПоступления                = Дата(1,1,1);
				СтруктураПараметров.ДатаПереходаПраваСобственности = Дата(1,1,1);
				СтруктураПараметров.СрокПереходаПраваСобственности = 0;
				
				Если ЗначениеЗаполнено(СтруктураПараметров.Календарь)  Тогда
					СтрокаЭтапа.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(СтруктураПараметров);
				Иначе
					СтрокаЭтапа.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаБезКалендаря(СтруктураПараметров);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЭтапыОплатыКлиентСервер.СортироватьТаблицуЭтапов(ЭтапыГрафика);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область МодульФормы

// Устарела. Выполняет дополнение и кэширование параметров механизма в реквизит формы, обновляет тексты гиперссылок
//и устанавливает видимость команды "Зачет оплаты" для новых документов.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения, РасширениеУправляемойФормыДляДокумента, РасширениеФормыЭлементаСправочника - Форма документа/справочника.
// 
Процедура ФормаПриСозданииНаСервере(Форма) Экспорт
	
	ВзаиморасчетыРаботаСФормами.ФормаПриСозданииНаСервере(Форма);
	
КонецПроцедуры

// Устарела. Выполняет кэширование параметров механизма в реквизит формы, обновляет тексты гиперссылок
//и устанавливает видимость команды "Зачет оплаты" для существующих документов.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения, РасширениеУправляемойФормыДляДокумента, РасширениеФормыЭлементаСправочника - Форма документа/справочника.
// 
Процедура ФормаПриЧтенииНаСервере(Форма) Экспорт
	
	ВзаиморасчетыРаботаСФормами.ФормаПриЧтенииНаСервере(Форма);
	
КонецПроцедуры

// Устарела. Обновляет тексты гиперссылок после записи и устанавливает значения параметров механизма Взаиморасчеты по оповещению
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа/справочника.
// 	ДополнительныеСвойства - Структура - Дополнительные свойства записаннного объекта
// 
Процедура ФормаПослеЗаписиНаСервере(Форма, ДополнительныеСвойства = Неопределено) Экспорт
	
	ВзаиморасчетыРаботаСФормами.ФормаПослеЗаписиНаСервере(Форма, ДополнительныеСвойства);
	
КонецПроцедуры

// Устарела. Выполняет необходимые действия при изменении ключевых реквизитов документа/справочника.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа/справочника.
//	ИзмененныеРеквизиты - Массив из Строка - Перечень имен измененных реквизитов в терминах документа.
//						- Структура - Перечень имен измененных реквизитов в терминах документа, анализируются только ключи (имена реквизитов) структуры.
//						- Строка - Имя измененного реквизита.
// 	ЭтоИзмененияМеханизма - Булево - Флаг того, что вызов производит сам механизм.
// 
// Возвращаемое значение:
// 	Структура - Структура измененных реквизитов документа после обработки, где Ключ - Имя реквизита, Значение - значение реквизита до изменения.
//
Функция ФормаПриИзмененииРеквизитов(Форма, ИзмененныеРеквизиты, ЭтоИзмененияМеханизма = Ложь) Экспорт
	
	Возврат ВзаиморасчетыРаботаСФормами.ФормаПриИзмененииРеквизитов(Форма, ИзмененныеРеквизиты, ЭтоИзмененияМеханизма);
	
КонецФункции

// Устарела. Обновляет тексты гиперссылок, видимость команды "Зачет оплаты".
//Очищает все реквизиты взаиморасчетов, если документ более не изменяет взаиморасчеты.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа/справочника.
// 
Процедура ПриИзмененииПараметровМеханизма(Форма) Экспорт
	
	ВзаиморасчетыРаботаСФормами.ПриИзмененииПараметровМеханизма(Форма);
	
КонецПроцедуры

// Устарела. Используется для обработке оповещений, связанных с механизмами взаиморасчетов.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения
// 	 * Объект - ДанныеФормы
// 	  ** Ссылка - ДокументСсылка, СправочникСсылка
// 	ИмяСобытия - Строка - Имя события.
// 	Параметр - Произвольный - Параметр события.
Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр) Экспорт
	
	ВзаиморасчетыРаботаСФормами.ОбработкаОповещения(Форма, ИмяСобытия, Параметр);
	
КонецПроцедуры

// Функция - Курсы валют для пересчета
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения	 - Форма документа/справочника.
//  СтараяВалюта	 - СправочникСсылка.Валюты	 - валюта из которой нужно пересчитать
//  НоваяВалюта		 - СправочникСсылка.Валюты	 - валюта в которую нужно пересчитать
//  БазоваяВалюта	 - СправочникСсылка.Валюты	 - базовая валюта курсов
//  ДатаДокумента	 - Дата	 - дата получения курсов
// 
// Возвращаемое значение:
//  Структура:
//   *СтруктураКурсовСтаройВалюты - см. РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты
//   *СтруктураКурсовНовойВалюты - см. РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты
//
Функция КурсыВалютДляПересчета(Форма, СтараяВалюта, НоваяВалюта, БазоваяВалюта, ДатаДокумента) Экспорт
	
	ПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	Если ПараметрыМеханизма <> Неопределено Тогда
		СтруктураПараметров = ПараметрыМеханизма.МассивПараметров[0];
		Если ЗначениеЗаполнено(СтруктураПараметров.ВариантКурсаДоговора) 
			И СтруктураПараметров.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.УстановленныйВДоговоре 
			И СтараяВалюта = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаВзаиморасчетов) Тогда
			СтруктураКурсовСтаройВалюты = РегистрыСведений.КурсыВалютРасчетовПоДоговорам.ПолучитьЗначенияКурсаВалютыДоговора(
				ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Договор),
				ДатаДокумента);
			СтруктураКурсовСтаройВалюты.Вставить("Валюта", СтараяВалюта);
			СтруктураКурсовСтаройВалюты.Вставить("БазоваяВалюта", БазоваяВалюта);
		Иначе
			СтруктураКурсовСтаройВалюты = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(СтараяВалюта, ДатаДокумента, БазоваяВалюта);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураПараметров.ВариантКурсаДоговора) 
			И СтруктураПараметров.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.УстановленныйВДоговоре 
			И НоваяВалюта = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаВзаиморасчетов) Тогда
			СтруктураКурсовНовойВалюты = РегистрыСведений.КурсыВалютРасчетовПоДоговорам.ПолучитьЗначенияКурсаВалютыДоговора(
				ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Договор),
				ДатаДокумента);
			СтруктураКурсовНовойВалюты.Вставить("Валюта", НоваяВалюта);
			СтруктураКурсовНовойВалюты.Вставить("БазоваяВалюта", БазоваяВалюта);
		Иначе
			СтруктураКурсовНовойВалюты  = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(НоваяВалюта, ДатаДокумента, БазоваяВалюта);
		КонецЕсли;
	Иначе
		СтруктураКурсовСтаройВалюты = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(СтараяВалюта, ДатаДокумента, БазоваяВалюта);
		СтруктураКурсовНовойВалюты  = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(НоваяВалюта, ДатаДокумента, БазоваяВалюта);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("СтруктураКурсовСтаройВалюты", СтруктураКурсовСтаройВалюты);
	Результат.Вставить("СтруктураКурсовНовойВалюты", СтруктураКурсовНовойВалюты);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ЭтапыОплаты

// Устарела. Выполняет заполнение/очистку/перераспределение этапов графика оплат
//
// Параметры:
// 	Объект - ДокументОбъект, СправочникОбъект, ФормаКлиентскогоПриложения - обрабатываемый объект.
// 	ДополненныеПараметрыМеханизма - см. ВзаиморасчетыСервер.ДополненныеПараметрыМеханизма
// 	ТаблицаЭтаповГрафикаОплаты - ТаблицаЗначений - Выгрузка табличной части ЭтапыГрафикаОплаты
// 
Процедура ПроверитьЗаполнитьЭтапыГрафикаОплаты(Объект, ЗНАЧ ДополненныеПараметрыМеханизма = Неопределено, ТаблицаЭтаповГрафикаОплаты = Неопределено) Экспорт
	
	ЭтапыОплатыСервер.ПроверитьЗаполнитьЭтапыГрафикаОплаты(Объект, ДополненныеПараметрыМеханизма, ТаблицаЭтаповГрафикаОплаты);
	
КонецПроцедуры

// Устарела. Следует использовать см. ЭтапыОплатыСервер.ПоместитьЭтапыОплатыВоВременноеХранилище
Процедура ПоместитьЭтапыОплатыВоВременноеХранилище(Форма, ИмяЭлемента) Экспорт
	
	ЭтапыОплатыСервер.ПоместитьЭтапыОплатыВоВременноеХранилище(Форма, ИмяЭлемента);
	
КонецПроцедуры

// Устарела. Следует использовать см. ЭтапыОплатыСервер.ЗагрузитьЭтапыОплатыИзВременногоХранилища
Процедура ЗагрузитьЭтапыОплатыИзВременногоХранилища(Форма) Экспорт
	
	ЭтапыОплатыСервер.ЗагрузитьЭтапыОплатыИзВременногоХранилища(Форма);
	
КонецПроцедуры

// Устарела. Служебная процедура, заполняет текст гиперссылки правил оплаты 
// 
// Параметры:
//	Форма       - ФормаКлиентскогоПриложения - Договор, указанный в документе:
//	 * Элементы - ЭлементыФормы - элементы вызывающей формы
//	СтруктураПараметров - см. ВзаиморасчетыСервер.ПараметрыМеханизма
//	СистемныеНастройки  - Структура - Системные настройки из дополненных параметров, если уже получены.
//
Процедура ОбновитьТекстГиперссылкиЭтапыОплаты(Форма, СтруктураПараметров = Неопределено, СистемныеНастройки = Неопределено) Экспорт
	
	ВзаиморасчетыРаботаСФормами.ОбновитьТекстГиперссылкиЭтапыОплаты(Форма, СтруктураПараметров, СистемныеНастройки);
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты

// Устарела. Добавляет команду отчета "Ведомость расчетов с клиентами" в список команд.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
// 	- СтрокаТаблицыЗначений: см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 	- Неопределено - Если нет прав на просмотр отчета.
//
Функция ВедомостьРасчетовСКлиентами_ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	
	Возврат ВзаиморасчетыОтчеты.ВедомостьРасчетовСКлиентами_ДобавитьКомандуОтчета(КомандыОтчетов);
	
КонецФункции

// Устарела. Добавляет команду отчета "Ведомость расчетов между организациями" в список команд.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
// 	- СтрокаТаблицыЗначений: см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 	- Неопределено - Если нет прав на просмотр отчета.
//
Функция ВедомостьРасчетовМеждуОрганизациями_ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	
	Возврат ВзаиморасчетыОтчеты.ВедомостьРасчетовМеждуОрганизациями_ДобавитьКомандуОтчета(КомандыОтчетов);
	
КонецФункции

// Устарела. Добавляет команду отчета "Ведомость расчетов с партнерами" в список команд.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
// 	- СтрокаТаблицыЗначений: см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 	- Неопределено - Если нет прав на просмотр отчета.
//
Функция ВедомостьРасчетовСПартнерами_ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	
	Возврат ВзаиморасчетыОтчеты.ВедомостьРасчетовСПартнерами_ДобавитьКомандуОтчета(КомандыОтчетов);
	
КонецФункции

// Устарела. Добавляет команду отчета "Ведомость расчетов с поставщиками" в список команд.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
// 	- СтрокаТаблицыЗначений: см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 	- Неопределено - Если нет прав на просмотр отчета.
//
Функция ВедомостьРасчетовСПоставщиками_ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	
	Возврат ВзаиморасчетыОтчеты.ВедомостьРасчетовСПоставщиками_ДобавитьКомандуОтчета(КомандыОтчетов);
	
КонецФункции

// Устарела. Добавляет команду отчета "Задолженность клиентов" в стандартном виде в список команд.
// Отчет группируется по партнерам.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
// 	- СтрокаТаблицыЗначений: см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 	- Неопределено - Если нет прав на просмотр отчета.
//
Функция ЗадолженностьКлиентов_ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	Возврат ВзаиморасчетыОтчеты.ЗадолженностьКлиентов_ДобавитьКомандуОтчета(КомандыОтчетов);
КонецФункции

// Устарела. Добавляет команду отчета "Задолженность клиентов" в список команд. 
// Отчет группируется по объекту расчетов.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
// 	- СтрокаТаблицыЗначений: см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 	- Неопределено - Если нет прав на просмотр отчета.
//
Функция ЗадолженностьКлиентов_ДобавитьКомандуОтчетаПоДокументам(КомандыОтчетов) Экспорт
	Возврат ВзаиморасчетыОтчеты.ЗадолженностьКлиентов_ДобавитьКомандуОтчетаПоДокументам(КомандыОтчетов);
КонецФункции

// Устарела. Добавляет команду отчета "Карточка расчетов с клиентом" в список команд.
// Группировка по партнеру/контрагенту.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
// 	- СтрокаТаблицыЗначений: см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 	- Неопределено - Если нет прав на просмотр отчета.
//
Функция КарточкаРасчетовСКлиентом_ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	Возврат ВзаиморасчетыОтчеты.КарточкаРасчетовСКлиентом_ДобавитьКомандуОтчета(КомандыОтчетов);
КонецФункции

// Устарела. Добавляет команду отчета "Карточка расчетов с клиентом" в список команд.
// Группировка по объекту расчетов.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
// 	- СтрокаТаблицыЗначений: см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 	- Неопределено - Если нет прав на просмотр отчета.
//
Функция КарточкаРасчетовСКлиентом_ДобавитьКомандуОтчетаПоДокументам(КомандыОтчетов) Экспорт
	Возврат ВзаиморасчетыОтчеты.КарточкаРасчетовСКлиентом_ДобавитьКомандуОтчетаПоДокументам(КомандыОтчетов);
КонецФункции

// Устарела. Добавляет команду отчета "Задолженность поставщикам" в стандартном виде в список команд.
// Отчет группируется по партнерам.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
// 	- СтрокаТаблицыЗначений: см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 	- Неопределено - Если нет прав на просмотр отчета.
//
Функция ЗадолженностьПоставщикам_ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	Возврат ВзаиморасчетыОтчеты.ЗадолженностьПоставщикам_ДобавитьКомандуОтчета(КомандыОтчетов);
КонецФункции

// Устарела. Добавляет команду отчета "Задолженность поставщикам" в список команд. 
// Отчет группируется по объекту расчетов.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
// 	- СтрокаТаблицыЗначений: см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 	- Неопределено - Если нет прав на просмотр отчета.
//
Функция ЗадолженностьПоставщикам_ДобавитьКомандуОтчетаПоДокументам(КомандыОтчетов) Экспорт
	Возврат ВзаиморасчетыОтчеты.ЗадолженностьПоставщикам_ДобавитьКомандуОтчетаПоДокументам(КомандыОтчетов);
КонецФункции

// Устарела. Добавляет команду отчета "Карточка расчетов с поставщиком" в список команд.
// Группировка по партнеру/контрагенту.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
// 	- СтрокаТаблицыЗначений: см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 	- Неопределено - Если нет прав на просмотр отчета.
//
Функция КарточкаРасчетовСПоставщиком_ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	Возврат ВзаиморасчетыОтчеты.КарточкаРасчетовСПоставщиком_ДобавитьКомандуОтчета(КомандыОтчетов);
КонецФункции

// Устарела. Добавляет команду отчета "Карточка расчетов с поставщиком" в список команд.
// Группировка по объекту расчетов.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
// 	- СтрокаТаблицыЗначений: см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// 	- Неопределено - Если нет прав на просмотр отчета.
//
Функция КарточкаРасчетовСПоставщиком_ДобавитьКомандуОтчетаПоДокументам(КомандыОтчетов) Экспорт
	Возврат ВзаиморасчетыОтчеты.КарточкаРасчетовСПоставщиком_ДобавитьКомандуОтчетаПоДокументам(КомандыОтчетов);
КонецФункции

#КонецОбласти

#Область ЗачетОплатыРасшифровкаПлатежа

//Заполняет табличные части "Расшифровка платежа" остатками задолженности.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа/справочника.
// 	РасшифровкаПлатежа - ТаблицаЗначений - таблица для заполнения
// 
Процедура ЗаполнитьРасшифровкуПлатежаОстатками(Форма, РасшифровкаПлатежа) Экспорт
	
	ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	
	Для Каждого СтруктураПараметров Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
		
		Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Организация);
		Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Контрагент);
		Дата = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Дата);
		Валюта = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаДокумента);
		
		ТипЗадолженности = ?(СтруктураПараметров.ДокументРасчетовСКлиентами, Перечисления.ТипыЗадолженности.Дебиторская, Перечисления.ТипыЗадолженности.Кредиторская);
		
		ЗаполнитьЗадолженностьПоОстаткам(
			Организация, 
			Контрагент,
			ТипЗадолженности,
			Неопределено, //ТипРасчетов
			Дата,
			Валюта,
			РасшифровкаПлатежа);
		Если РасшифровкаПлатежа.Количество() = 0 Тогда
			РасшифровкаПлатежа.Добавить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Устарела. Помещает табличную часть Расшифровка платежа во временное хранилище и записывает ссылку на него в структуру параметров взаиморасчетов.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма документа/справочника.
// 	ИмяЭлемента - Строка - Имя элемента, по которому можно определить для какой структуры параметров взаиморасчетов помещается расшифровка.
//
Процедура ПоместитьРасшифровкуПлатежаВоВременноеХранилище(Форма, ИмяЭлемента = Неопределено) Экспорт
	
	ВзаиморасчетыРаботаСФормами.ПоместитьРасшифровкуПлатежаВоВременноеХранилище(Форма, ИмяЭлемента);
	
КонецПроцедуры

// Устарела. 
Процедура ЗагрузитьРасшифровкуПлатежаИзВременногоХранилища(Форма) Экспорт
	
	ВзаиморасчетыРаботаСФормами.ЗагрузитьРасшифровкуПлатежаИзВременногоХранилища(Форма);
	
КонецПроцедуры

// Устарела. 
Процедура ОбновитьРаспределеннуюСуммаРасшифровки(Форма) Экспорт
	
	ВзаиморасчетыРаботаСФормами.ОбновитьРаспределеннуюСуммаРасшифровки(Форма);
	
КонецПроцедуры

// Устарела. 
Процедура ЗаблокироватьОбъектыРасчетов(Форма) Экспорт
	
	ВзаиморасчетыРаботаСФормами.ЗаблокироватьОбъектыРасчетов(Форма) ;
	
КонецПроцедуры

#КонецОбласти

#Область ГиперссылкаРасчеты

// Устарела.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - 
Процедура ОбновитьТекстГиперссылкиСостояниеРасчетов(Форма) Экспорт
	
	ВзаиморасчетыРаботаСФормами.ОбновитьТекстГиперссылкиСостояниеРасчетов(Форма);
	
КонецПроцедуры

#Область СуммыВзаиморасчетов

// Процедура проверяет и заполняет суммы взаиморасчетов в табличной части объекта
// 
// Параметры:
//  Объект - ДокументОбъект, СправочникОбъект, ФормаКлиентскогоПриложения - Проверяемый объект
//  СтруктураПараметров - см. ПараметрыМеханизма
Процедура ПроверитьЗаполнитьСуммыВзаиморасчетовВТабличнойЧасти(Объект, СтруктураПараметров) Экспорт
	
	Если Не ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧ)
		Или Не ЗначениеЗаполнено(СтруктураПараметров.СуммаВзаиморасчетов)
		Или ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.СуммаВзаиморасчетов) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВзаиморасчетыКлиентСервер.ПроверитьОбязательныеПараметры(СтруктураПараметров,
		"ПутьКДаннымТЧ, КурсЧислитель, КурсЗнаменатель, СуммаВзаиморасчетов,
		| ВалютаДокумента, ВалютаВзаиморасчетов, ИмяРеквизитаТЧСуммаСНДС, Организация");
	
	ДанныеТЧ             = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧ); // ТабличнаяЧасть
	КурсЧислитель        = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.КурсЧислитель);
	КурсЗнаменатель      = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.КурсЗнаменатель);
	СуммаВзаиморасчетов  = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.СуммаВзаиморасчетов);
	ВалютаДокумента      = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаДокумента);
	ВалютаВзаиморасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаВзаиморасчетов);
	Организация          = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
	ИмяСуммаСНДС         = СтруктураПараметров.ИмяРеквизитаТЧСуммаСНДС;
	ВернутьМногооборотнуюТару = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВернутьМногооборотнуюТару,,Ложь);
	ТребуетсяЗалогЗаТару      = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ТребуетсяЗалогЗаТару,,Ложь);
	ЕстьНезалоговаяТара = ВернутьМногооборотнуюТару И НЕ ТребуетсяЗалогЗаТару;
	
	ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	
	Если ДанныеТЧ = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТЗ = ДанныеТЧ.Выгрузить();
	ЕстьСуммаВзаиморасчетов = ТЗ.Колонки.Найти("СуммаВзаиморасчетов") <> Неопределено;
	
	Если НЕ ЕстьСуммаВзаиморасчетов Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьСуммаНДСВзаиморасчетов = ТЗ.Колонки.Найти("СуммаНДСВзаиморасчетов") <> Неопределено;
	
	//Если в документе есть незалоговая тара, то сумму взаиморасчетов не распределяем на строки с тарой.
	МассивПропускаемойНоменклатуры = Новый Массив;
	Если ЕстьНезалоговаяТара Тогда
		МассивНоменклатуры = ТЗ.ВыгрузитьКолонку("Номенклатура");
		МассивНоменклатуры = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНоменклатуры);
		МассивРеквизитов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНоменклатуры,"ТипНоменклатуры");
		Для Каждого Номенклатура Из МассивНоменклатуры Цикл
			Если МассивРеквизитов[Номенклатура] = Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда
				МассивПропускаемойНоменклатуры.Добавить(Номенклатура);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("СуммаВзаиморасчетов", 0);
	
	СуммаВзаиморасчетовТЧПлюс  = 0;
	СуммаВзаиморасчетовТЧМинус = 0;
	СуммаПлюс                  = 0;
	СуммаМинус                 = 0;
	
	Для Каждого Стр Из ДанныеТЧ Цикл
		Если ЕстьНезалоговаяТара И МассивПропускаемойНоменклатуры.Найти(Стр.Номенклатура) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Стр[ИмяСуммаСНДС] > 0 Тогда
			СуммаПлюс = СуммаПлюс + Стр[ИмяСуммаСНДС];
			Если ЗначениеЗаполнено(Стр.СуммаВзаиморасчетов) Тогда
				СуммаВзаиморасчетовТЧПлюс = СуммаВзаиморасчетовТЧПлюс + Стр.СуммаВзаиморасчетов;
			КонецЕсли;
		Иначе
			СуммаМинус = СуммаМинус + Стр[ИмяСуммаСНДС];
			Если ЗначениеЗаполнено(Стр.СуммаВзаиморасчетов) Тогда
				СуммаВзаиморасчетовТЧМинус = СуммаВзаиморасчетовТЧМинус + Стр.СуммаВзаиморасчетов;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СуммаВзаиморасчетовПоТЧ = ДанныеТЧ.Итог("СуммаВзаиморасчетов");
	
	Если ДанныеТЧ.НайтиСтроки(СтруктураПоиска).Количество() = 0
		И СуммаВзаиморасчетов = СуммаВзаиморасчетовПоТЧ 
		И (НЕ ЕстьСуммаНДСВзаиморасчетов ИЛИ ДанныеТЧ.НайтиСтроки(Новый Структура("СуммаНДСВзаиморасчетов",0)).Количество() = 0) Тогда
		Возврат;
	ИначеЕсли СуммаПлюс = 0 
			И СуммаМинус = 0 Тогда
		ВзаиморасчетыСлужебный.ОчиститьСуммыВзаиморасчетовТЧ(Объект, СтруктураПараметров);
		Возврат;
	КонецЕсли;
	
	Если ВалютаДокумента = ВалютаВзаиморасчетов Тогда
		
		Для Индекс = 0 По ДанныеТЧ.Количество()-1 Цикл
			Если ЕстьНезалоговаяТара И МассивПропускаемойНоменклатуры.Найти(ДанныеТЧ[Индекс].Номенклатура) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ДанныеТЧ[Индекс].СуммаВзаиморасчетов)
			 ИЛИ ДанныеТЧ[Индекс].СуммаВзаиморасчетов <> ДанныеТЧ[Индекс][ИмяСуммаСНДС] Тогда
				ДанныеТЧ[Индекс].СуммаВзаиморасчетов = ДанныеТЧ[Индекс][ИмяСуммаСНДС];
				Если ЕстьСуммаНДСВзаиморасчетов Тогда
					ДанныеТЧ[Индекс].СуммаНДСВзаиморасчетов = ДанныеТЧ[Индекс].СуммаНДС;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		КоэффициентПересчета = КоэффициентПересчетаПоКурсу(ВалютаРегламентированногоУчета,
																		ВалютаДокумента,
																		ВалютаВзаиморасчетов,
																		КурсЧислитель,
																		КурсЗнаменатель); 
		
		// Сумму, которая должна быть распределена по табличной части,
		// 		получим из разности общей суммы взаиморасчетов
		// 		и итога по заполненным значениям колонки "СуммаВзаиморасчетов".
		Если СуммаМинус = 0 Тогда
			СуммаВзаиморасчетовКРаспределениюПлюс = СуммаВзаиморасчетов;
			СуммаВзаиморасчетовКРаспределениюМинус = 0;
		Иначе
			СуммаВзаиморасчетовКРаспределениюПлюс = Окр(СуммаПлюс*КоэффициентПересчета, 2) - СуммаВзаиморасчетовТЧПлюс;
			СуммаВзаиморасчетовКРаспределениюМинус = Окр(СуммаМинус*КоэффициентПересчета, 2) - СуммаВзаиморасчетовТЧМинус;
		КонецЕсли;
		
		//Распределяем положительное отклонение.
		МассивСумм = Новый Массив;
		Для Индекс = 0 По ДанныеТЧ.Количество()-1 Цикл
			Если ЕстьНезалоговаяТара И МассивПропускаемойНоменклатуры.Найти(ДанныеТЧ[Индекс].Номенклатура) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ДанныеТЧ[Индекс][ИмяСуммаСНДС] > 0 Тогда
				Если Не ЗначениеЗаполнено(ДанныеТЧ[Индекс].СуммаВзаиморасчетов) Тогда
					МассивСумм.Добавить(Окр(ДанныеТЧ[Индекс][ИмяСуммаСНДС] * КоэффициентПересчета, 2));
				Иначе
					СуммаВзаиморасчетовКРаспределениюПлюс = СуммаВзаиморасчетовКРаспределениюПлюс - ДанныеТЧ[Индекс].СуммаВзаиморасчетов;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		МассивСумм = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СуммаВзаиморасчетовКРаспределениюПлюс, МассивСумм);
		
		ИндексМассиваСумм = 0;
		Если МассивСумм <> Неопределено Тогда
			Для Индекс=0 По ДанныеТЧ.Количество()-1 Цикл
				Если ЕстьНезалоговаяТара И МассивПропускаемойНоменклатуры.Найти(ДанныеТЧ[Индекс].Номенклатура) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ДанныеТЧ[Индекс].СуммаВзаиморасчетов) И ДанныеТЧ[Индекс][ИмяСуммаСНДС] > 0 Тогда
					ДанныеТЧ[Индекс].СуммаВзаиморасчетов = МассивСумм[ИндексМассиваСумм];
					ИндексМассиваСумм = ИндексМассиваСумм + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//Распределяем отрицательное отклонение.
		МассивСумм = Новый Массив;
		Для Индекс = 0 По ДанныеТЧ.Количество()-1 Цикл
			Если ЕстьНезалоговаяТара И МассивПропускаемойНоменклатуры.Найти(ДанныеТЧ[Индекс].Номенклатура) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ДанныеТЧ[Индекс][ИмяСуммаСНДС] < 0 Тогда
				Если Не ЗначениеЗаполнено(ДанныеТЧ[Индекс].СуммаВзаиморасчетов) Тогда
					МассивСумм.Добавить(Окр(ДанныеТЧ[Индекс][ИмяСуммаСНДС] * КоэффициентПересчета, 2));
				Иначе
					СуммаВзаиморасчетовКРаспределениюМинус = СуммаВзаиморасчетовКРаспределениюМинус - ДанныеТЧ[Индекс].СуммаВзаиморасчетов;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		МассивСумм = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СуммаВзаиморасчетовКРаспределениюМинус, МассивСумм);
		
		ИндексМассиваСумм = 0;
		Если МассивСумм <> Неопределено Тогда
			Для Индекс=0 По ДанныеТЧ.Количество()-1 Цикл
				Если ЕстьНезалоговаяТара И МассивПропускаемойНоменклатуры.Найти(ДанныеТЧ[Индекс].Номенклатура) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ДанныеТЧ[Индекс].СуммаВзаиморасчетов) И ДанныеТЧ[Индекс][ИмяСуммаСНДС] < 0 Тогда
					ДанныеТЧ[Индекс].СуммаВзаиморасчетов = МассивСумм[ИндексМассиваСумм];
					ИндексМассиваСумм = ИндексМассиваСумм + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЕстьСуммаНДСВзаиморасчетов Тогда
			Для Индекс=0 По ДанныеТЧ.Количество()-1 Цикл
				Если ЕстьНезалоговаяТара И МассивПропускаемойНоменклатуры.Найти(ДанныеТЧ[Индекс].Номенклатура) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ДанныеТЧ[Индекс].СуммаНДСВзаиморасчетов = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ДанныеТЧ[Индекс].СуммаВзаиморасчетов, ДанныеТЧ[Индекс].СтавкаНДС);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Проведение

#Область РасчетыСКлиентами

// Устарела. Дополняет тексты запроса проведения документа текстами проведения графика исполнения договора  с клиентом по регистру Расчеты с клиентами.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПланыОплат - Строка - Текст запроса получения данных плановой оплаты документа.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов - договор.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты.
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыКлиентом - Вариант оплаты.
// 	     * КОплате - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма плановой оплаты.
// 	     * ИсключатьПриКонтроле - Булево - Флаг контроля суммы плановой оплаты при проведении.
// 	ТекстПланыОтгрузок - Строка - Текст запроса получения данных плановой отгрузки документа.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов - договор.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ДатаОтгрузки - Дата - Плановая дата оплаты.
// 	     * УвеличитьКОтгрузке - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма плановой отгрузки.
// 
Процедура ПроведениеГрафикаИсполненияДоговораСКлиентом(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат, ТекстПланыОтгрузок) Экспорт
	
	ВзаиморасчетыПроведениеКлиенты.ПроведениеГрафикаИсполненияДоговораСКлиентом(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат, ТекстПланыОтгрузок) 
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения заказа клиента по регистру Расчеты с клиентами.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПланыОплат - Строка - Текст запроса получения данных для отражения плана оплат.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты механизма]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты всего документа/этапа оплаты.
// 	     * ИсключатьПриКонтроле - Булево - Исключить ли проверку на наличие оплаты по данной строке движений.
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыКлиентом - Вариант оплаты этапа графика.
// 	     * КОплате - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов (с учетом залога за тару).
// 	     * СуммаОтклоненияМерныхТоваров - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма отклонения мерных товаров в валюте взаиморасчетов к оплате.
// 	ТекстПланыОтгрузок - Строка - Текст запроса получения данных документа для отражения плана отгрузки.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты документа]
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ДатаОтгрузки - Дата - Плановая дата отгрузки строки/документа.
// 	     * УвеличитьКОтгрузке - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к отгрузке в валюте взаиморасчетов (с учетом залога за тару).
// 	     * УвеличитьОтгружается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма увеличения Отгружается.
// 
Процедура ПроведениеЗаказаКлиента(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат = "", ТекстПланыОтгрузок = "") Экспорт
	
	ВзаиморасчетыПроведениеКлиенты.ПроведениеЗаказаКлиента(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат, ТекстПланыОтгрузок);
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения продажи и переноса расчетов по регистру Расчеты с клиентами.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПродажа - Строка - Текст запроса получения данных продажи и плановых дат ее погашения.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты продажи.
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыКлиентом - Вариант оплаты продажи.
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * НакладнаяПоЗаказам - Булево - Накладная введена по заказу(ам).
// 	     * СверхЗаказа - Булево - Это отгрузка сверх заказа.
// 	     * ЗаказПродажи - ДокументСсылка, Неопределено - Заказ, по которому происходит продажа.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте взаиморасчетов.
// 	     * СуммаВзаиморасчетовПоТаре - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма залога за тару в валюте взаиморасчетов.
// 	     * СвязанныйДокумент - ДокументСсылка.РеализацияТоваровУслуг,
// 	                           ДокументСсылка.РеализацияУслугПрочихАктивов - Связанный документ корректировки для определения курса отражения.
// 	ТекстПланОплат - Строка - Текст запроса получения данных увеличения планов оплат.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты.
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыКлиентом - Вариант оплаты плана оплаты.
// 	     * ИсключатьПриКонтроле - Булево - Исключить ли проверку на наличие оплаты по данной строке движений.
// 	     * НакладнаяПоЗаказам - Булево - Накладная введена по заказу(ам).
// 	     * СверхЗаказа - Булево - Это отгрузка сверх заказа.
// 	     * ЗаказПродажи - ДокументСсылка, Неопределено - Заказ, по которому происходит продажа.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * КОплате - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов.
// 	ТекстПереносАванса - Строка - Необязательный. Текст запроса получения данных зачтенных авансов.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов аванса.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция переноса или резервирования аванса.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	ТекстТовары - Строка - Текст запроса получения данных табличной части Товары - изменяет планы отгрузки и "отгружается".
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * НакладнаяПоЗаказам - Булево - Накладная введена по заказу(ам).
// 	     * ЗаказПродажи - ДокументСсылка, Неопределено - Заказ, по которому происходит продажа.
// 	     * СверхЗаказа - Булево - Это отгрузка сверх заказа.
// 	     * ДатаОтгрузки - Дата - Плановая дата отгрузки.
// 	     * УвеличитьКОтгрузке - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма увеличения плана к отгрузке в валюте взаиморасчетов.
// 	     * УменьшитьКОтгрузке - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма уменьшения плана к отгрузке в валюте взаиморасчетов.
// 	     * УвеличитьОтгружается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма увеличения "Отгружается".
// 	     * УменьшитьОтгружается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма, на которую следует уменьшить ресурс "Отгружается". 
// 	     Ресурс используется для контроля максимальной допустимой суммы задолженности. Т.е. если заказ уже увеличил Отгружается, то это значит, что отгрузка в процессе и сумма заказа войдет в сумму контролируемой задолженности.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма взаиморасчетов по строке товаров, по не будет уменьшен план отгрузки.
// 	     * ЗалогЗаТару - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма залога за тару.
//
Процедура ПроведениеПродажи(Запрос, ТекстыЗапроса, Регистры, ТекстПродажа = "", ТекстПланОплат = "", ТекстПереносАванса = "", ТекстТовары = "", ТекстОплата = "") Экспорт
	
	ВзаиморасчетыПроведениеКлиенты.ПроведениеПродажи(Запрос, ТекстыЗапроса, Регистры, ТекстПродажа, ТекстПланОплат, ТекстПереносАванса, ТекстТовары, ТекстОплата);
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения оплаты от клиента по регистру Расчеты с клиентами.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстОплата - Строка - Текст запроса получения данных оплаты.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * Организация - 
// 	     * Партнер -
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому производится платеж.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ДатаПогашения - Дата - Плановая дата погашения аванса
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма оплаты в валюте взаиморасчетов.
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * УвеличениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма увеличения "Оплачивается".
// 	     * УменьшениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма уменьшения "Оплачивается".
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * СчетНаОплату - ДокументСсылка.СчетНаОплатуКлиенту - Счет, по которому производится оплата.
// 	     * СвязанныйДокумент - ДокументСсылка.РеализацияТоваровУслуг,
// 	                           ДокументСсылка.РеализацияУслугПрочихАктивов - Связанный документ корректировки для определения курса отражения.
// 	     * ИдентификаторФинЗаписи - Строка - Строка со значением уникального идентификатора шапки или строки документа.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка хозяйственной операции документа.
// 	ВидОперацииДляСортировки - Строка - Вид операции строкой для сортировки распределения в пределах дня, если он отличается от значения по умолчанию.
//
Процедура ПроведениеОплатыОтКлиента(Запрос, ТекстыЗапроса, Регистры, ТекстОплата, ВидОперацииДляСортировки = "") Экспорт
	
	ВзаиморасчетыПроведениеКлиенты.ПроведениеОплатыОтКлиента(Запрос, ТекстыЗапроса, Регистры, ТекстОплата, ВидОперацииДляСортировки);
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения заявки на возврат ДС клиенту по регистру Расчеты с клиентами.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстВзаиморасчеты - Строка - Текст запроса получения данных документа.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому планируется платеж.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * Оплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма уменьшения "Оплачивается" (планирование возврата).
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС
// 
Процедура ПроведениеЗаявкиНаВозвратОплатыКлиенту(Запрос, ТекстыЗапроса, Регистры, ТекстВзаиморасчеты) Экспорт
	
	ВзаиморасчетыПроведениеКлиенты.ПроведениеЗаявкиНаВозвратОплатыКлиенту(Запрос, ТекстыЗапроса, Регистры, ТекстВзаиморасчеты);
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения возврата оплаты клиенту по регистру Расчеты с клиентами.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстЗадолженность - Строка - Текст запроса получения данных платежа.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте взаиморасчетов.
// 	     * СуммаУвеличениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма оплачивается.
// 	     * ИдентификаторФинЗаписи - Строка - Строка со значением уникального идентификатора шапки или строки документа.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка хозяйственной операции документа.
// 	ТекстПереносРасчетов - Строка - Текст запроса получения данных зачета возврата ДС клиенту на объекты расчетов расшифровки.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому возвращаются денежные средства.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	ТекстОплачивается - Строка - Текст запроса получения данных возврата, по которым необходимо уменьшить "Оплачивается".
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому следует уменьшить "Оплачивается", обычно объект расчетов расшифровки.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * Оплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма уменьшения "Оплачивается".
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ЗаявкаНаРасходованиеДенежныхСредств - ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств - Если возврат происходит по заявке.
// 
Процедура ПроведениеВозвратаОплатыКлиенту(Запрос, ТекстыЗапроса, Регистры, ТекстЗадолженность = "", ТекстПереносРасчетов = "", ТекстОплачивается = "") Экспорт
	
	ВзаиморасчетыПроведениеКлиенты.ПроведениеВозвратаОплатыКлиенту(Запрос, ТекстыЗапроса, Регистры, ТекстЗадолженность, ТекстПереносРасчетов, ТекстОплачивается);
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения возврата товаров(ценностей) от клиента по регистру Расчеты с клиентами.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстВозврат - Строка - Текст запроса получения данных документа возврата. Отражает сам возврат товаров.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * Организация - СправочникСсылка.Организации - Организация возврата товаров.
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата товаров.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хоз операция документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     [Реквизиты документа]
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте взаиморасчетов.
// 	     * КОплате - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте взаиморасчетов, на которую следует уменьшить план оплаты клиента.
// 	ТекстПереносРасчетов - Строка - Текст запроса получения данных расшифровки платежа. Отражает зачет возврата на другие объекты расчетов.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата товаров.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, на который делается зачет.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов объекта расчетов, на который производится перенос.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хоз операция документа.
// 	     [Реквизиты табличной части]
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма переноса в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма переноса в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
//
Процедура ПроведениеВозвратаТоваровОтКлиента(Запрос, ТекстыЗапроса, Регистры, ТекстВозврат, ТекстПереносРасчетов = "") Экспорт
	
	ВзаиморасчетыПроведениеКлиенты.ПроведениеВозвратаТоваровОтКлиента(Запрос, ТекстыЗапроса, Регистры, ТекстВозврат, ТекстПереносРасчетов);
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения заказа клиента по регистру Плановые оплаты клиентов.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПланыОплат - Строка - Текст запроса получения данных для отражения плана оплат.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты механизма]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты всего документа/этапа оплаты.
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыКлиентом - Вариант оплаты этапа графика.
// 	     * КОплате - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов (с учетом залога за тару).
// 
Процедура ПроведениеРасчетыСКлиентамиПланОплат(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат) Экспорт
	
	ВзаиморасчетыПроведениеКлиенты.ПроведениеРасчетыСКлиентамиПланОплат(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат)
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения заказа клиента по регистру Плановые оплаты клиентов.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПланыОтгрузок - Строка - Текст запроса получения данных для отражения плана отгрузок.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты механизма]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты всего документа/этапа оплаты.
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыКлиентом - Вариант оплаты этапа графика.
// 	     * КОплате - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов (с учетом залога за тару).
// 	ЭтоГрафикДоговора - Булево - Проводится график исполнения договора, иначе заказ
// 
Процедура ПроведениеРасчетыСКлиентамиПланОтгрузок(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОтгрузок, ЭтоГрафикДоговора = Ложь) Экспорт
	
	ВзаиморасчетыПроведениеКлиенты.ПроведениеРасчетыСКлиентамиПланОтгрузок(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОтгрузок, ЭтоГрафикДоговора);
	
КонецПроцедуры

#КонецОбласти

#Область ЗачетВстречнойЗадолженности

// Устарела. Дополняет тексты запроса проведения документа текстами проведения оплаты от клиента по регистру Расчеты с клиентами
// и регистру Расчеты с поставщиками. Расход по регистру расчеты с клиентами и приход по регистру расчеты с поставщиками
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстОбязательстваКлиента - Строка - Текст запроса получения данных оплаты.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому производится платеж.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма оплаты в валюте взаиморасчетов.
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * Оплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма увеличения "Оплачивается".
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * СчетНаОплату - ДокументСсылка.СчетНаОплатуКлиенту - Счет, по которому производится оплата.
// 	     * СвязанныйДокумент - ДокументСсылка.РеализацияТоваровУслуг,
// 	                           ДокументСсылка.РеализацияУслугПрочихАктивов - Связанный документ корректировки для определения курса отражения.
// 	     * ИдентификаторФинЗаписи - Строка - Строка со значением уникального идентификатора шапки или строки документа.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка хозяйственной операции документа.
// 	ТекстОбязательстваПоставщику - Строка - Текст запроса получения данных оплаты.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому производится платеж.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ИдентификаторФинЗаписи - Строка - Идентификатор финансового движения для организации двойной записи.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка отражения хозяйственной операции в фин. учете.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма платежа в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма платежа в валюте взаиморасчетов.
// 	     * УменьшениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к уменьшению "Оплачивается", например, при оплате по заявке.
// 	     * УвеличениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к увеличению "Оплачивается", например, когда платежка проведена в системе, но не подтверждена банком.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ЗаявкаНаРасходованиеДенежныхСредств - ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств - Заявка, по которой происходит оплата.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * ИдентификаторФинЗаписи - Строка - Строка со значением уникального идентификатора шапки или строки документа.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка хозяйственной операции документа.
//
Процедура ПроведениеЗачетаВстречнойЗадолженности(Запрос, ТекстыЗапроса, Регистры, ТекстОбязательстваКлиента, ТекстОбязательстваПоставщику) Экспорт
	
	ВзаиморасчетыПроведениеПоставщики.ПроведениеЗачетаВстречнойЗадолженности(Запрос, ТекстыЗапроса, Регистры, ТекстОбязательстваКлиента, ТекстОбязательстваПоставщику);
	
КонецПроцедуры

#КонецОбласти

#Область РасчетыСПоставщиками

// Устарела. Дополняет тексты запроса проведения документа текстами проведения графика исполнения договора с поставщиком
// по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПланыОплат - Строка - Текст запроса получения данных для отражения плана оплат поставщику.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов договор.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты механизма]
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты этапа.
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов. 
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыПоставщику - Вариант оплаты этапа графика.
// 	ТекстПланыПоставок - Строка - Текст запроса получения данных документа для отражения плана поставки.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты документа]
// 	     * ДатаПоступления - Дата - Плановая дата поставки строки/документа.
// 	     * УвеличитьКПоступлению - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к поступлению в валюте взаиморасчетов.
//
Процедура ПроведениеГрафикаИсполненияДоговораСПоставщиком(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат, ТекстПланыПоставок) Экспорт
	
	ВзаиморасчетыПроведениеПоставщики.ПроведениеГрафикаИсполненияДоговораСПоставщиком(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат, ТекстПланыПоставок);
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения заказа поставщику по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПланыОплат - Строка - Текст запроса получения данных для отражения плана оплат поставщику.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты механизма]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты всего документа/этапа оплаты.
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыПоставщику - Вариант оплаты этапа графика.
// 	     * КОплате - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов (с учетом залога за тару).
// 	ТекстПланыПоставок - Строка - Текст запроса получения данных документа для отражения плана отгрузки.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты документа]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ДатаПоступления - Дата - Плановая дата поставки строки/документа.
// 	     * УвеличитьКПоступлению - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к поступлению в валюте документа (с учетом залога за тару).
// 
Процедура ПроведениеЗаказаПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат = "", ТекстПланыПоставок = "") Экспорт
	
	ВзаиморасчетыПроведениеПоставщики.ПроведениеЗаказаПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат, ТекстПланыПоставок)
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения оплаты поставщику по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстОплата - Строка - Текст запроса получения данных оплаты.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому производится платеж.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ДатаПогашения - Дата - Плановая дата погашения аванса
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма платежа в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма платежа в валюте взаиморасчетов.
// 	     * УменьшениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к уменьшению "Оплачивается", например, при оплате по заявке.
// 	     * УвеличениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к увеличению "Оплачивается", например, когда платежка проведена в системе, но не подтверждена банком.
// 	     * СуммаУпр - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма платежа в валюте управленческого учета
// 	     * СуммаРегл - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма платежа в валюте регламентированного учета
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ЗаявкаНаРасходованиеДенежныхСредств - ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств - Заявка, по которой происходит оплата.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * ИдентификаторФинЗаписи - Строка - Строка со значением уникального идентификатора шапки или строки документа.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка хозяйственной операции документа.
// 	ВидОперацииДляСортировки - Строка - Вид операции строкой для сортировки распределения в пределах дня, если он отличается от значения по умолчанию.
Процедура ПроведениеОплатыПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстОплата, ВидОперацииДляСортировки = "") Экспорт
	
	ВзаиморасчетыПроведениеПоставщики.ПроведениеОплатыПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстОплата, ВидОперацииДляСортировки)
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения закупки по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстЗакупка - Строка - Текст запроса получения данных документа. Отражает саму закупку.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты всего документа/этапа оплаты.
// 	     * ЗаказЗакупки - ДокументСсылка - Заказ, по которому происходит закупка.
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма закупки в валюте документа (включая залог за тару).
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма закупки в валюте взаиморасчетов (включая залог за тару).
// 	     * ЗалогЗаТару - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма залога за тару в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * НакладнаяПоЗаказам - Булево - Накладная введена по заказу(ам).
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	ТекстПланОплат - Строка - Текст запроса получения данных документа плановой оплаты поставщику. Отражает увеличение плана оплаты поставщику.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты всего документа/этапа оплаты.
// 	     * НакладнаяПоЗаказам - Булево - Накладная введена по заказу(ам).
// 	     * СверхЗаказа - Булево - Это приобретение сверх заказа.
// 	     * ЗаказЗакупки - ДокументСсылка - Заказ, по которому происходит закупка.
// 	     * КОплате - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыПоставщику - Вариант оплаты этапа графика.
// 	ТекстПереносАванса - Строка - Текст запроса получения данных документа по зачтенным авансам.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов аванса.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция переноса или резервирования аванса.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	ТекстТовары - Строка - Текст запроса получения данных документа плановой поставки от поставщика. Отражает увеличение плана поставки поставщиком.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * НакладнаяПоЗаказам - Булево - Накладная введена по заказу(ам).
// 	     * СверхЗаказа - Булево - Это приобретение сверх заказа.
// 	     * ЗаказЗакупки - ДокументСсылка - Заказ, по которому происходит закупка.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма взаиморасчетов строки товаров, уменьшает план поставки.
// 	     * УвеличитьКПоступлению - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма увеличения плана поставки.
// 	     * УменьшитьКПоступлению - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма уменьшения плана поставки.
// 	ВидОперацииДляСортировки - Строка - Вид операции строкой для сортировки распределения в пределах дня,
// 	                                    если он отличается от значения по умолчанию.
//
Процедура ПроведениеЗакупки(Запрос, ТекстыЗапроса, Регистры, ТекстЗакупка, ТекстПланОплат, ТекстПереносАванса = "", ТекстТовары = "", ВидОперацииДляСортировки = "") Экспорт
	
	ВзаиморасчетыПроведениеПоставщики.ПроведениеЗакупки(Запрос, ТекстыЗапроса, Регистры, ТекстЗакупка, ТекстПланОплат, ТекстПереносАванса, ТекстТовары, ВидОперацииДляСортировки)
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения заявки на оплату поставщику по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстВзаиморасчеты - Строка - Текст запроса получения данных заявки.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому планируется платеж.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * УвеличениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма заявки в валюте взаиморасчетов к оплате.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
//
Процедура ПроведениеЗаявкиНаОплатуПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстВзаиморасчеты) Экспорт
	
	ВзаиморасчетыПроведениеПоставщики.ПроведениеЗаявкиНаОплатуПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстВзаиморасчеты);
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения возврата оплаты от поставщика по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстЗадолженность - Строка - Текст запроса получения данных возврата. Отражает сам возврат ДС.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ИдентификаторФинЗаписи - Строка - Идентификатор финансового движения для организации двойной записи.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка отражения хозяйственной операции в фин. учете.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ИдентификаторФинЗаписи - Строка - Строка со значением уникального идентификатора шапки или строки документа.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка хозяйственной операции документа.
// 	ТекстПереносРасчетов - Строка - Необязательный, текст запроса получения данных расшифровки платежа, на которую необходимо перенести возврат ДС.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, на который зачитывается возврат ДС.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому планируется платеж.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция переноса расчетов.
// 	     [Реквизиты табличной части]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма зачета в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма зачета в валюте взаиморасчетов.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
//
Процедура ПроведениеВозвратаОплатыОтПоставщика(Запрос, ТекстыЗапроса, Регистры, ТекстЗадолженность, ТекстПереносРасчетов = "") Экспорт
	
	ВзаиморасчетыПроведениеПоставщики.ПроведениеВозвратаОплатыОтПоставщика(Запрос, ТекстыЗапроса, Регистры, ТекстЗадолженность, ТекстПереносРасчетов);
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения возврата товаров поставщику по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстВозврат - Строка - Текст запроса получения данных документа.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * Организация - СправочникСсылка.Организации - Организация возврата товаров.
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ИдентификаторФинЗаписи - Строка - Идентификатор финансового движения для организации двойной записи.
// 	       В большинстве случаев поле определяется как ОбъектРасчетов.УникальныйИдентификатор, в особых случаях может иметь значение не связанное с объектом расчетов.
// 	     * НастройкаХозяйственнойОперации - Неопределено, СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка отражения хозяйственной операции в фин. учете.
// 	       В большинстве случаев поле имеет значение Неопределено, в особых случаях может быть указана ссылка на элемент справочника.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	ТекстПереносРасчетов - Строка - Текст запроса получения данных расшифровки платежа возврата, на которую происходит зачет возврата.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, на который происходит зачет возврата.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов объекта расчетов, на который происходит зачет возврата.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты табличной части]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
//
Процедура ПроведениеВозвратаТоваровПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстВозврат, ТекстПереносРасчетов = "") Экспорт
	
	ВзаиморасчетыПроведениеПоставщики.ПроведениеВозвратаТоваровПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстВозврат, ТекстПереносРасчетов);
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения заказа клиента по регистру Расчеты с клиентами.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПланыОплат - Строка - Текст запроса получения данных для отражения плана оплат.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты механизма]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты всего документа/этапа оплаты.
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыКлиентом - Вариант оплаты этапа графика.
// 	     * КОплате - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов (с учетом залога за тару).
// 
Процедура ПроведениеРасчетыСПоставщикамиПланОплат(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат) Экспорт
	
	ВзаиморасчетыПроведениеПоставщики.ПроведениеРасчетыСПоставщикамиПланОплат(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат);
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения заказа клиента по регистру Расчеты с клиентами.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПланыПоставок - Строка - Текст запроса получения данных для отражения плана оплат.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты механизма]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ДатаПогашения - Дата - Плановая дата поставки
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов (с учетом залога за тару).
// 	ЭтоГрафикДоговора - Булево - Проводится график исполнения договора, иначе заказ
//
Процедура ПроведениеРасчетыСПоставщикамиПланПоставок(Запрос, ТекстыЗапроса, Регистры, ТекстПланыПоставок, ЭтоГрафикДоговора = Ложь) Экспорт
	
	ВзаиморасчетыПроведениеПоставщики.ПроведениеРасчетыСПоставщикамиПланПоставок(Запрос, ТекстыЗапроса, Регистры, ТекстПланыПоставок, ЭтоГрафикДоговора)
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения возврата товаров поставщику по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстВозврат - Строка - Текст запроса получения данных документа.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * Организация - СправочникСсылка.Организации - Организация возврата товаров.
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ИдентификаторФинЗаписи - Строка - Идентификатор финансового движения для организации двойной записи.
// 	       В большинстве случаев поле определяется как ОбъектРасчетов.УникальныйИдентификатор, в особых случаях может иметь значение не связанное с объектом расчетов.
// 	     * НастройкаХозяйственнойОперации - Неопределено, СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка отражения хозяйственной операции в фин. учете.
// 	       В большинстве случаев поле имеет значение Неопределено, в особых случаях может быть указана ссылка на элемент справочника.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	ТекстПереносРасчетов - Строка - Текст запроса получения данных расшифровки платежа возврата, на которую происходит зачет возврата.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, на который происходит зачет возврата.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов объекта расчетов, на который происходит зачет возврата.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты табличной части]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
//
Процедура ПроведениеПереносаАвансаПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстПереносРасчетов = "") Экспорт
	
	ВзаиморасчетыПроведениеПоставщики.ПроведениеПереносаАвансаПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстПереносРасчетов);
	
КонецПроцедуры

// Устарела. Дополняет тексты запроса проведения документа текстами проведения возврата товаров поставщику по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстВозврат - Строка - Текст запроса получения данных документа.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * Организация - СправочникСсылка.Организации - Организация возврата товаров.
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ИдентификаторФинЗаписи - Строка - Идентификатор финансового движения для организации двойной записи.
// 	       В большинстве случаев поле определяется как ОбъектРасчетов.УникальныйИдентификатор, в особых случаях может иметь значение не связанное с объектом расчетов.
// 	     * НастройкаХозяйственнойОперации - Неопределено, СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка отражения хозяйственной операции в фин. учете.
// 	       В большинстве случаев поле имеет значение Неопределено, в особых случаях может быть указана ссылка на элемент справочника.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	ТекстПереносРасчетов - Строка - Текст запроса получения данных расшифровки платежа возврата, на которую происходит зачет возврата.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, на который происходит зачет возврата.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов объекта расчетов, на который происходит зачет возврата.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты табличной части]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
//
Процедура ПроведениеВозвратаПереносаАвансаПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстПереносРасчетов = "") Экспорт
	
	ВзаиморасчетыПроведениеПоставщики.ПроведениеВозвратаПереносаАвансаПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстПереносРасчетов);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ПоискОснованийИДокументовОплаты

// Устарела. Создает структуру параметров поиска оснований оплаты и документов оплаты
// 
// Параметры:
// 	РежимПоиска - Число - соответствие коду режима поиска:
// 		1 - Поиск документов оплаты; 
// 		2 - Поиск оснований (объектов) платежа.
// 
// Возвращаемое значение:
// 	Структура - содержит:
// 	* РежимПоиска - Число - соответствие коду режима поиска:
// 		1 - Поиск документов оплаты; 
// 		2 - Поиск оснований (объектов) платежа.
// 	* Организации - СправочникСсылка.Организации, Массив Из СправочникСсылка.Организации -
// 	* Документы   - Массив Из ДокументСсылка - документы, по которым производится поиск платежей.
// 	* НаДату      - Дата - для среза найденных документов на дату
// 	* ТолькоАвансы - Булево - Если "Истина", будут возвращены только авансовые платежи
// 	* ОграничитьТипыДокументовОплаты - Булево - Если "Истина", платежные документы будут ограничены возможными типами
// 	                                                входящих и исходящих документов оплат.
// 	* ОграничитьТипыОснованийОплаты  - Булево - Если "Истина", основания платежа будут ограничены возможными типами
// 	                                                входящих и исходящих документов.
// 	* ПараметрыОтбораПоТаблицеДокументов - Структура - Для отбора по временной таблице с документами, где:
//  	** ИмяПоля - Строка - Имя поля, в котором содержится документ
//  	** ИмяТаблицыОтбора - Строка - имя временной таблицы, где содержится документ
//
Функция ИнициализироватьПараметрыПоискаОснованийИДокументовОплаты(РежимПоиска = 1) Экспорт
	
	Возврат ВзаиморасчетыНДС.ИнициализироватьПараметрыПоискаОснованийИДокументовОплаты(РежимПоиска);
	
КонецФункции

// Устарела. Подготовить временную таблицу "РасчетыСКлиентами_ОснованияИДокументыОплаты"
// Создает временную таблицу с колонками:
// 	  Организация;
// 	  ДокументОплаты - платежный документ;
// 	  ОснованиеОплаты - оплачиваемый документ;
// 	  АналитикаУчетаПоПартнерам;
// 	  ОбъектРасчетов;
// 	  НаправлениеДеятельности;
// 	  Контрагент;
// 	  Договор;
// 	  СуммаОплаты;
// 	  СуммаОплатыУпр;
// 	  СуммаОплатыРегл.
// 
// Параметры:
// 	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
// 	ПараметрыПоиска         - см. ИнициализироватьПараметрыПоискаОснованийИДокументовОплаты
Процедура ПодготовитьВТ_РасчетыСКлиентами_ОснованияИДокументыОплаты(МенеджерВременныхТаблиц, ПараметрыПоиска) Экспорт
	
	ВзаиморасчетыНДС.ПодготовитьВТ_РасчетыСКлиентами_ОснованияИДокументыОплаты(МенеджерВременныхТаблиц, ПараметрыПоиска);
	
КонецПроцедуры

// Устарела. Подготовить временную таблицу "РасчетыСПоставщиками_ОснованияИДокументыОплаты"
// Создает временную таблицу с колонками:
// 	  Организация;
// 	  ДокументОплаты - платежный документ;
// 	  ОснованиеОплаты - оплачиваемый документ;
// 	  АналитикаУчетаПоПартнерам;
// 	  ОбъектРасчетов;
// 	  НаправлениеДеятельности;
// 	  Контрагент;
// 	  Договор;
// 	  СуммаОплаты;
// 	  СуммаОплатыУпр;
// 	  СуммаОплатыРегл.
// 
// Параметры:
// 	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
// 	ПараметрыПоиска         - см. ИнициализироватьПараметрыПоискаОснованийИДокументовОплаты
Процедура ПодготовитьВТ_РасчетыСПоставщиками_ОснованияИДокументыОплаты(МенеджерВременныхТаблиц, ПараметрыПоиска) Экспорт
	
	ВзаиморасчетыНДС.ПодготовитьВТ_РасчетыСПоставщиками_ОснованияИДокументыОплаты(МенеджерВременныхТаблиц, ПараметрыПоиска)
	
КонецПроцедуры

#КонецОбласти

#Область АвансыПоДаннымВзаиморасчетов

// Устарела. Создает структуру параметров для подготовки временных таблиц с расчетами
// 
// Параметры:
//  ИсходныеПараметры - Неопределено, Структура - произвольная структура с заполненными значениями
// 
// Возвращаемое значение:
// 	Структура - Описание:
//   * ДатаНачала                    - Дата -
//   * ДатаОкончания                 - Дата -
//   * Организации                   - Неопределено, СправочникСсылка.Организации, Массив из СправочникСсылка.Организации -
//   * РасчетныйДокумент             - Неопределено, ДокументСсылка - дополнительный фильтр по расчетному документу
//   * СоздатьПустуюТаблицу          - Булево - позволяет создать каркас временной таблицы без данных
//   * НоваяАрхитектураВзаиморасчетов - Булево - взаиморасчеты "онлайн"/"офлайн"
//   * ВключитьОтборПоОрганизациям - Булево - применять отбор по организации
//   * ПоляИндексовВручную           - Массив из Строка - возможность переопределения полей индексов результата
//   * УчестьРезервированиеАвансов   - Булево - если "Истина", зачтенные авансы,
//                                     которые ранее были зарезервированы, не попадут в выборку.
//   * ПараметрыОтбораПоРасчетномуДокументу - Структура - Для отбора по временной таблице с расчетными документами, где:
//   	** ИмяПоля - Строка - Имя поля, в котором содержится документ
//   	** ИмяТаблицыОтбора - Строка - имя временной таблицы, где содержится документ
//   * ПравилоОтбораАвансов          - ПеречислениеСсылка.ПорядокРегистрацииСчетовФактурНаАванс - правило отбора авансов.
//
Функция ИнициализироватьПараметрыПодготовкиРасчетовАвансов(ИсходныеПараметры = Неопределено) Экспорт
	
	Возврат ВзаиморасчетыНДС.ИнициализироватьПараметрыПодготовкиРасчетовАвансов(ИсходныеПараметры);
	
КонецФункции

#Область АвансыПолученные

// Устарела. Подготовить временную таблицу "РасчетыСКлиентами_Авансы"
// Создает временную таблицу с колонками:
// 	  РасчетныйДокумент;
// 	  ДокументРегистратор;
// 	  Организация;
// 	  АналитикаУчетаПоПартнерам;
// 	  ОбъектРасчетов;
// 	  НаправлениеДеятельности;
// 	  Контрагент;
// 	  Договор;
// 	  ДатаАванса;
// 	  ВалютаДокумента;
// 	  СуммаАвансаВал - сумма в валюте документа;
// 	  СуммаАванса;
// 	  СуммаАвансаУпр;
// 	  СуммаАвансаРегл.
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
//  ПараметрыРасчета        - см. ВзаиморасчетыНДС.ИнициализироватьПараметрыПодготовкиРасчетовАвансов
Процедура ПодготовитьВТ_РасчетыСКлиентами_Авансы(МенеджерВременныхТаблиц, ПараметрыРасчета) Экспорт
	
	ВзаиморасчетыНДС.ПодготовитьВТ_РасчетыСКлиентами_Авансы(МенеджерВременныхТаблиц, ПараметрыРасчета);
	
КонецПроцедуры

// Устарела. Подготовить временную таблицу "РасчетыСКлиентами_ПогашенияАвансов"
// Создает временную таблицу с колонками:
// 	  РасчетныйДокумент;
// 	  Организация;
// 	  АналитикаУчетаПоПартнерам;
// 	  ОбъектРасчетов;
// 	  ДокументРегистратор;
// 	  Контрагент;
// 	  Договор;
// 	  НаправлениеДеятельности;
// 	  ИсхКонтрагент - контрагент, по которому возник аванс;
// 	  ИсхДоговор    - договор, по которому возник аванс;
// 	  ИсхНаправлениеДеятельности - направление, по которому возник аванс;
// 	  КорАналитикаУчетаПоПартнерам;
// 	  ИсходнаяАналитикаУчетаПоПартнерам - аналитика, по которой образовался аванс;
// 	  КорОбъектРасчетов;
// 	  ИсходныйОбъектРасчетов - объект расчетов, по которому образовался аванс;
// 	  ДатаАванса;
// 	  ДатаПогашения;
// 	  СобытиеЗнак - Если погашение произошло по причине зачета аванса, тогда СобытиеЗнак >= 0,
// 	                Если погашение произошло по причине возврата/списания задолженности, тогда СобытиеЗнак < 0;
// 	  ВидСобытия - событие, в связи с которым произошло погашение аванса. Возможные события:
// 	         - Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности,
// 	         - Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту,
// 	         - Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиенту;
// 	  ВалютаДокумента;
// 	  СуммаПогашения;
// 	  СуммаПогашенияВал - сумма в валюте документа;
// 	  СуммаПогашенияУпр;
// 	  СуммаПогашенияРегл.
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
//  ПараметрыРасчета        - см. ВзаиморасчетыНДС.ИнициализироватьПараметрыПодготовкиРасчетовАвансов
Процедура ПодготовитьВТ_РасчетыСКлиентами_ПогашенияАвансов(МенеджерВременныхТаблиц, ПараметрыРасчета) Экспорт
	
	ВзаиморасчетыНДС.ПодготовитьВТ_РасчетыСКлиентами_ПогашенияАвансов(МенеджерВременныхТаблиц, ПараметрыРасчета);
	
КонецПроцедуры

// Устарела. Подготовить временную таблицу "РасчетыСКлиентами_Переносы"
// Создает временную таблицу с колонками:
// 	  Организация;
// 	  ДокументОплаты;
// 	  ДокументПереноса;
// 	  АналитикаУчетаПоПартнерам;
// 	  ОбъектРасчетов;
// 	  Контрагент;
// 	  НаправлениеДеятельности;  
// 	  Подразделение;
// 	  КорАналитикаУчетаПоПартнерам;
// 	  КорОбъектРасчетов;
// 	  КорКонтрагент;
// 	  КорНаправлениеДеятельности;  
// 	  КорПодразделение;
// 	  Период;
// 	  НастройкаХозяйственнойОперации
// 	  ИдентификаторФинЗаписи;
// 	  Валюта;
// 	  Предоплата;
// 	  ПредоплатаРегл;
// 	  ПредоплатаУпр.
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
//  ПараметрыРасчета        - см. ВзаиморасчетыНДС.ИнициализироватьПараметрыПодготовкиРасчетовАвансов
Процедура ПодготовитьВТ_РасчетыСКлиентами_ПереносыАвансов(МенеджерВременныхТаблиц, ПараметрыРасчета) Экспорт
		
	ВзаиморасчетыНДС.ПодготовитьВТ_РасчетыСКлиентами_ПереносыАвансов(МенеджерВременныхТаблиц, ПараметрыРасчета);
	
КонецПроцедуры

// Устарела. Подготовить временную таблицу "ПолученныеАвансыВРазрезеПогашенийИОстатков"
// Создает временную таблицу с колонками:
//   Организация;
//   НаправлениеДеятельности;
//   Контрагент;
//   Договор;
//   ИсхНаправлениеДеятельности - направление, по которому возник аванс;
//   ИсхКонтрагент - контрагент, по которому возник аванс;
//   ИсхДоговор    - договор, по которому возник аванс;
//   РасчетныйДокумент;
//   ИсходнаяАналитикаУчетаПоПартнерам - аналитика, по которой образовался аванс;
//   ИсходныйОбъектРасчетов - объект расчетов, по которому образовался аванс;
//   ДатаАванса;
//   ДатаПогашения - если пустая, значит это остаток;
//   ВалютаДокумента;
//   ДокументРегистратор;
//   СуммаВал - сумма в валюте документа;
//   СуммаУпр;
//   СуммаРегл;
//   Сумма.
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
//  ПараметрыРасчета        - см. ВзаиморасчетыНДС.ИнициализироватьПараметрыПодготовкиРасчетовАвансов
Процедура ПодготовитьВТ_ПолученныеАвансыВРазрезеПогашенийИОстатков(МенеджерВременныхТаблиц, ПараметрыРасчета) Экспорт
	
	ВзаиморасчетыНДС.ПодготовитьВТ_ПолученныеАвансыВРазрезеПогашенийИОстатков(МенеджерВременныхТаблиц, ПараметрыРасчета);
	
КонецПроцедуры

#КонецОбласти

#Область АвансыВыданные

// Устарела. Подготовить временную таблицу "РасчетыСПоставщиками_Авансы"
// Создает временную таблицу с колонками:
// 	  РасчетныйДокумент;
// 	  ДокументРегистратор;
// 	  Организация;
// 	  АналитикаУчетаПоПартнерам;
// 	  ОбъектРасчетов;
// 	  НаправлениеДеятельности;
// 	  Контрагент;
// 	  Договор;
// 	  ДатаАванса;
// 	  ВалютаДокумента;
// 	  СуммаАвансаВал - сумма в валюте документа;
// 	  СуммаАванса;
// 	  СуммаАвансаУпр;
// 	  СуммаАвансаРегл.
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
//  ПараметрыРасчета        - см. ВзаиморасчетыНДС.ИнициализироватьПараметрыПодготовкиРасчетовАвансов
Процедура ПодготовитьВТ_РасчетыСПоставщиками_Авансы(МенеджерВременныхТаблиц, ПараметрыРасчета) Экспорт
	
	ВзаиморасчетыНДС.ПодготовитьВТ_РасчетыСПоставщиками_Авансы(МенеджерВременныхТаблиц, ПараметрыРасчета);
	
КонецПроцедуры

// Устарела. Подготовить временную таблицу "РасчетыСПоставщиками_ПогашенияАвансов"
// Создает временную таблицу с колонками:
// 	  РасчетныйДокумент;
// 	  Организация;
// 	  АналитикаУчетаПоПартнерам;
// 	  ОбъектРасчетов;
// 	  ДокументРегистратор;
// 	  Контрагент;
// 	  Договор;
// 	  НаправлениеДеятельности;
// 	  ИсхКонтрагент - контрагент, по которому возник аванс;
// 	  ИсхДоговор    - договор, по которому возник аванс;
// 	  ИсхНаправлениеДеятельности - направление, по которому возник аванс;
// 	  КорАналитикаУчетаПоПартнерам;
// 	  ИсходнаяАналитикаУчетаПоПартнерам - аналитика, по которой образовался аванс;
// 	  КорОбъектРасчетов;
// 	  ИсходныйОбъектРасчетов - объект расчетов, по которому образовался аванс;
// 	  ДатаАванса;
// 	  ДатаПогашения;
// 	  СобытиеЗнак - Если погашение произошло по причине зачета аванса, тогда СобытиеЗнак >= 0,
// 	                Если погашение произошло по причине возврата/списания задолженности, тогда СобытиеЗнак < 0;
// 	  ВидСобытия - событие, в связи с которым произошло погашение аванса. Возможные события:
// 	         - Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика,
// 	         - Перечисление.ХозяйственныеОперации.ЗачетАвансаПоставщику;
// 	  ВалютаДокумента;
// 	  СуммаПогашения;
// 	  СуммаПогашенияВал - сумма в валюте документа;
// 	  СуммаПогашенияУпр;
// 	  СуммаПогашенияРегл.
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
//  ПараметрыРасчета        - см. ВзаиморасчетыНДС.ИнициализироватьПараметрыПодготовкиРасчетовАвансов
Процедура ПодготовитьВТ_РасчетыСПоставщиками_ПогашенияАвансов(МенеджерВременныхТаблиц, ПараметрыРасчета) Экспорт
	
	ВзаиморасчетыНДС.ПодготовитьВТ_РасчетыСПоставщиками_ПогашенияАвансов(МенеджерВременныхТаблиц, ПараметрыРасчета);
	
КонецПроцедуры

// Устарела. Подготовить временную таблицу "РасчетыСПоставщиками_ПереносыАвансов"
// Создает временную таблицу с колонками:
// 	  Организация;
// 	  ДокументОплаты;
// 	  ДокументПереноса;
// 	  АналитикаУчетаПоПартнерам;
// 	  ОбъектРасчетов;
// 	  Контрагент;
// 	  НаправлениеДеятельности;  
// 	  Подразделение;
// 	  КорАналитикаУчетаПоПартнерам;
// 	  КорОбъектРасчетов;
// 	  КорКонтрагент;
// 	  КорНаправлениеДеятельности;  
// 	  КорПодразделение;
// 	  Период;
// 	  НастройкаХозяйственнойОперации
// 	  ИдентификаторФинЗаписи;
// 	  Валюта;
// 	  Предоплата;
// 	  ПредоплатаРегл;
// 	  ПредоплатаУпр.
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
//  ПараметрыРасчета        - см. ВзаиморасчетыНДС.ИнициализироватьПараметрыПодготовкиРасчетовАвансов
Процедура ПодготовитьВТ_РасчетыСПоставщиками_ПереносыАвансов(МенеджерВременныхТаблиц, ПараметрыРасчета) Экспорт
	
	ВзаиморасчетыНДС.ПодготовитьВТ_РасчетыСПоставщиками_ПереносыАвансов(МенеджерВременныхТаблиц, ПараметрыРасчета)
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиЭтаповЗакрытияМесяца

// Устарела. Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - (См. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца)
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	ВзаиморасчетыЗакрытиеМесяца.ДобавитьЭтап_ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов(ТаблицаЭтапов,ТекущийРодитель);
КонецПроцедуры

// Устарела. 
// Параметры:
// 	ПараметрыОбработчика - см. Обработки.ОперацииЗакрытияМесяца.ИнициализироватьПараметрыОбработчикаЭтапа
Процедура Использование_ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов(ПараметрыОбработчика) Экспорт
	
	ВзаиморасчетыЗакрытиеМесяца.Использование_ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов(ПараметрыОбработчика);
	
КонецПроцедуры

// Устарела. 
// Параметры:
// 	ПараметрыОбработчика - см. Обработки.ОперацииЗакрытияМесяца.ИнициализироватьПараметрыОбработчикаЭтапа
Процедура Оформление_ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов(ПараметрыОбработчика) Экспорт
	
	ВзаиморасчетыЗакрытиеМесяца.Оформление_ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов(ПараметрыОбработчика);
	
КонецПроцедуры

// Устарела.
Процедура ОписаниеПроверок_ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов(ТаблицаПроверок) Экспорт
	
	ВзаиморасчетыЗакрытиеМесяца.ОписаниеПроверок_ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов(ТаблицаПроверок);
	
КонецПроцедуры

// Устарела.
Процедура ПроверкаОстатковВзаиморасчетов(ПараметрыПроверки) Экспорт
	
	ВзаиморасчетыЗакрытиеМесяца.ПроверкаОстатковВзаиморасчетов(ПараметрыПроверки);
	
КонецПроцедуры

// Устарела.
Процедура ПроверкаОстатковВзаиморасчетовРучнаяКорректировка(ПараметрыПроверки) Экспорт
	
	ВзаиморасчетыЗакрытиеМесяца.ПроверкаОстатковВзаиморасчетовРучнаяКорректировка(ПараметрыПроверки);
	
КонецПроцедуры

// Устарела.
Процедура ПроверкаРазвернутогоСальдо(ПараметрыПроверки) Экспорт 
	
	ВзаиморасчетыЗакрытиеМесяца.ПроверкаРазвернутогоСальдо(ПараметрыПроверки);
		
КонецПроцедуры

// Устарела.
Процедура ПроверкаРазвернутогоСальдоРучнаяКорректировка(ПараметрыПроверки) Экспорт 
	
	ВзаиморасчетыЗакрытиеМесяца.ПроверкаРазвернутогоСальдоРучнаяКорректировка(ПараметрыПроверки);
		
КонецПроцедуры

// Устарела.
Процедура Выполнить_ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов(ПараметрыОбработчика) Экспорт
	
	ВзаиморасчетыЗакрытиеМесяца.Выполнить_ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов(ПараметрыОбработчика);
	
КонецПроцедуры

#КонецОбласти

#Область Модульность

// Возвращает структуру состояния взаиморасчетов.
// 
// Параметры:
// 	Объект - ФормаКлиентскогоПриложения - Описание:
// * Объект - СправочникСсылка, ДокументСсылка - Объект формы.
// 	СтруктураПараметров - см. ВзаиморасчетыСервер.ПараметрыМеханизма
// Возвращаемое значение:
// 	см. СтруктураСостоянияРасчетов
//
Функция СостояниеВзаиморасчетов(Объект, СтруктураПараметров) Экспорт
	
	ПутьКДаннымСуммаВзаиморасчетов = ?(СтруктураПараметров.СуммаВзаиморасчетов="",СтруктураПараметров.СуммаДокумента,СтруктураПараметров.СуммаВзаиморасчетов);
	СуммаВзаиморасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПутьКДаннымСуммаВзаиморасчетов,,0);
	Организация         = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
	ТипРасчетов         = СтруктураПараметров.ТипРасчетов;
	ПорядокРасчетов     = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПорядокРасчетов);
	
	Если СтруктураПараметров.ЭтоЗаказ 
		И (ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам
			Или ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным)Тогда
		СсылкаНаЗаказ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Ссылка);
		Если Метаданные.РегистрыСведений.СостоянияЗаказовКлиентов.Измерения.Заказ.Тип.СодержитТип(ТипЗнч(СсылкаНаЗаказ))
			Или Метаданные.РегистрыСведений.СостоянияЗаказовПоставщикам.Измерения.Заказ.Тип.СодержитТип(ТипЗнч(СсылкаНаЗаказ)) Тогда
			Результат = СостояниеВзаиморасчетовЗаказа(СсылкаНаЗаказ, ТипРасчетов);
			Если Результат <> Неопределено Тогда
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбъектРасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ОбъектРасчетов);
	Если ТипЗнч(ОбъектРасчетов) = Тип("Массив") Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ОбъектРасчетов, ПредопределенноеЗначение("Справочник.ОбъектыРасчетов.ПустаяСсылка"));
		ОбъектРасчетов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ОбъектРасчетов);
		Если ОбъектРасчетов.Количество() = 1 Тогда
			ОбъектРасчетов = ОбъектРасчетов[0];
			СуммаВзаиморасчетов = 0;
		Иначе
			ОбъектРасчетов = Неопределено;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОбъектРасчетов) Тогда
		Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
			Договор = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
			ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(Договор, Организация, ТипРасчетов);
		ИначеЕсли ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам Тогда 
			ЗаказОснование = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование);
			ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(ЗаказОснование, Организация, ТипРасчетов);
		КонецЕсли;
	КонецЕсли;
	
	ЭтоДоговорСНакладными = СтруктураПараметров.ЭтоСправочник 
	                        И СтруктураПараметров.Ссылка = СтруктураПараметров.Договор
	                        И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным;
	ЭтоЗаказСНакладными   = СтруктураПараметров.ЭтоЗаказ
	                        И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
	
	Возврат СостояниеВзаиморасчетовОбъектаРасчетов(ОбъектРасчетов, СуммаВзаиморасчетов, ТипРасчетов, Организация, ЭтоЗаказСНакладными, ЭтоДоговорСНакладными);
	
КонецФункции

// Параметры:
// 	ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов.
// 	СуммаВзаиморасчетов - Число - сумма взаиморасчетов для расчета процента платежей и отгрузки.
// 	ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами - определяет по какому регистру смотреть состояние.
// 	Организация - СправочникСсылка.Организации - Организация по которой нужно смотреть состояние расчетов.
// 	ЭтоЗаказСНакладными - Булево - Признак, что объект расчетов - это заказ с детализацией расчетов ПоЗаказамНакладным
// 	ЭтоДоговорСНакладными - Булево - Признак, что объект расчетов - это договор с детализацией расчетов ПоДоговорамНакладным
// 	
// Возвращаемое значение:
// 	см. СтруктураСостоянияРасчетов
//
Функция СостояниеВзаиморасчетовОбъектаРасчетов(ОбъектРасчетов, СуммаВзаиморасчетов, ТипРасчетов, Организация = Неопределено, ЭтоЗаказСНакладными = Ложь, ЭтоДоговорСНакладными = Ложь) Экспорт
	
	СтруктураРасчетов = СтруктураСостоянияРасчетов();
	
	Если НЕ ЗначениеЗаполнено(ОбъектРасчетов)
		Или НЕ ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.РасчетыСКлиентами) 
			И ТипРасчетов = ПредопределенноеЗначение("Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом")
		Или НЕ ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.РасчетыСПоставщиками)
			И ТипРасчетов = ПредопределенноеЗначение("Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком") Тогда
		Возврат СтруктураРасчетов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СуммаПервоначальныхВзаиморасчетов", СуммаВзаиморасчетов);
	Запрос.УстановитьПараметр("ОбъектРасчетов", ОбъектРасчетов);
	Запрос.УстановитьПараметр("ДанныеОтчета", 4);
	
	МассивТекстов = Новый Массив;

	ТекстПервоначальныхВзаиморасчетов = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР КОГДА &СуммаПервоначальныхВзаиморасчетов = 0
		|		ТОГДА ВЫБОР КОГДА ОбъектыРасчетов.СуммаВзаиморасчетов = 0
		|						ТОГДА ОбъектыРасчетов.Сумма
		|					ИНАЧЕ ОбъектыРасчетов.СуммаВзаиморасчетов
		|				КОНЕЦ
		|		ИНАЧЕ &СуммаПервоначальныхВзаиморасчетов
		|	КОНЕЦ КАК Сумма
		|ПОМЕСТИТЬ ВтСуммаПервоначальныхВзаиморасчетов
		|ИЗ
		|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|ГДЕ
		|	ОбъектыРасчетов.Ссылка = &ОбъектРасчетов";
	МассивТекстов.Добавить(ТекстПервоначальныхВзаиморасчетов);
	
	Если ТипРасчетов = ПредопределенноеЗначение("Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом") 
		И ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.РасчетыСКлиентами) Тогда
		
		Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
			
			Если ЭтоЗаказСНакладными Тогда
				
				ТекстЗапроса = "
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетовНакладная,
					|	ОбъектыРасчетовЗаказ.Ссылка КАК ОбъектРасчетовЗаказ,
					|	ОбъектыРасчетовЗаказ.Объект КАК ЗаказКлиента,
					|	СУММА(ВЫБОР
					|			КОГДА ОбъектыРасчетов.СуммаВзаиморасчетов = 0
					|				ТОГДА ВЫБОР
					|					КОГДА ОбъектыРасчетов.Сумма = 0
					|						ТОГДА 0
					|					ИНАЧЕ РасчетыСКлиентамиОбороты.КОтгрузкеПриход / ОбъектыРасчетов.Сумма
					|				КОНЕЦ
					|			ИНАЧЕ РасчетыСКлиентамиОбороты.КОтгрузкеПриход / ОбъектыРасчетов.СуммаВзаиморасчетов
					|		КОНЕЦ) КАК ДоляЗаказа,
					|	МАКСИМУМ (ОбъектыРасчетовЗаказ.Сумма) КАК СуммаЗаказа
					|ПОМЕСТИТЬ ВтСвязьЗаказовНакладных
					|ИЗ
					|	РегистрНакопления.РасчетыСКлиентами.Обороты( , , Регистратор, ОбъектРасчетов = &ОбъектРасчетов) КАК РасчетыСКлиентамиОбороты
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетовЗаказ
					|		ПО РасчетыСКлиентамиОбороты.ОбъектРасчетов = ОбъектыРасчетовЗаказ.Ссылка
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|		ПО РасчетыСКлиентамиОбороты.Регистратор = ОбъектыРасчетов.Объект
					|			И НЕ ОбъектыРасчетов.ПометкаУдаления
					|
					|СГРУППИРОВАТЬ ПО
					|	ОбъектыРасчетов.Ссылка,
					|	ОбъектыРасчетовЗаказ.Ссылка,
					|	ОбъектыРасчетовЗаказ.Объект
					|";

				МассивТекстов.Добавить(ТекстЗапроса); 
				
				ТекстЗапроса = "
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЕСТЬNULL(СУММА(Расчеты.СуммаОплат), 0) КАК СуммаОплат,
					|	ЕСТЬNULL(СУММА(Расчеты.СуммаОтгрузок), 0) КАК СуммаОтгрузок,
					|	ЕСТЬNULL(СУММА(Расчеты.СуммаЗадолженности), 0) КАК СуммаЗадолженности,
					|	ЕСТЬNULL(МАКСИМУМ(Расчеты.СуммаПервоначальныхВзаиморасчетов), &СуммаПервоначальныхВзаиморасчетов) КАК СуммаПервоначальныхВзаиморасчетов
					|ПОМЕСТИТЬ ВтРасчеты
					|ИЗ (ВЫБРАТЬ
					|		&ШаблонПоляОплачено КАК СуммаОплат,
					|
					|		&ШаблонПоляОтгружено КАК СуммаОтгрузок,
					|
					|		ВЫБОР КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|			ТОГДА РасчетыПоСрокам.Долг
					|			ИНАЧЕ 0
					|		КОНЕЦ КАК СуммаЗадолженности,
					|
					|		ВЫБОР КОГДА &СуммаПервоначальныхВзаиморасчетов = 0
					|			ТОГДА ВЫБОР КОГДА ОбъектыРасчетов.СуммаВзаиморасчетов = 0
					|							ТОГДА ОбъектыРасчетов.Сумма
					|							ИНАЧЕ ОбъектыРасчетов.СуммаВзаиморасчетов
					|						КОНЕЦ
					|			ИНАЧЕ &СуммаПервоначальныхВзаиморасчетов
					|		КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|
					|	ИЗ
					|			РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
					|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|				ПО РасчетыПоСрокам.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
					|		ГДЕ
					|			ОбъектыРасчетов.Ссылка = &ОбъектРасчетов
					|			И РасчетыПоСрокам.АналитикаУчетаПоПартнерам.Организация = &Организация
					|			И РасчетыПоСрокам.Активность
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		(&ШаблонПоляОплачено) * ВтСвязьЗаказовНакладных.ДоляЗаказа КАК СуммаОплат,
					|		0 КАК СуммаОтгрузок,
					|		0 КАК СуммаЗадолженности,
					|		ВЫБОР КОГДА &СуммаПервоначальныхВзаиморасчетов = 0
					|			ТОГДА ВтСвязьЗаказовНакладных.СуммаЗаказа
					|			ИНАЧЕ &СуммаПервоначальныхВзаиморасчетов
					|		КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|	ИЗ
					|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСвязьЗаказовНакладных КАК ВтСвязьЗаказовНакладных
					|			ПО РасчетыПоСрокам.ОбъектРасчетов = ВтСвязьЗаказовНакладных.ОбъектРасчетовНакладная 
					|	ГДЕ
					|		РасчетыПоСрокам.ОбъектРасчетов В (ВЫБРАТЬ
					|							Т.ОбъектРасчетовНакладная
					|						ИЗ
					|							ВтСвязьЗаказовНакладных КАК Т)
					|		И РасчетыПоСрокам.АналитикаУчетаПоПартнерам.Организация = &Организация
					|		И РасчетыПоСрокам.Активность
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		ВЫБОР КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|			ТОГДА Расчеты.Оплачивается
					|			ИНАЧЕ -Расчеты.Оплачивается
					|		КОНЕЦ КАК СуммаОплат,
					|		0 КАК СуммаОтгрузок,
					|		0 КАК СуммаЗадолженности,
					|		ВЫБОР КОГДА &СуммаПервоначальныхВзаиморасчетов = 0
					|			ТОГДА ВЫБОР КОГДА ОбъектыРасчетов.СуммаВзаиморасчетов = 0
					|							ТОГДА ОбъектыРасчетов.Сумма
					|							ИНАЧЕ ОбъектыРасчетов.СуммаВзаиморасчетов
					|						КОНЕЦ
					|			ИНАЧЕ &СуммаПервоначальныхВзаиморасчетов
					|		КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|	ИЗ
					|		РегистрНакопления.РасчетыСКлиентами КАК Расчеты
					|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|				ПО Расчеты.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
					|		ГДЕ
					|			ОбъектыРасчетов.Ссылка = &ОбъектРасчетов
					|			И Расчеты.АналитикаУчетаПоПартнерам.Организация = &Организация
					|			И Расчеты.Активность
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		(ВЫБОР КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|			ТОГДА Расчеты.Оплачивается
					|			ИНАЧЕ -Расчеты.Оплачивается
					|		КОНЕЦ) * ВтСвязьЗаказовНакладных.ДоляЗаказа КАК СуммаОплат,
					|		0 КАК СуммаОтгрузок,
					|		0 КАК СуммаЗадолженности,
					|		ВЫБОР КОГДА &СуммаПервоначальныхВзаиморасчетов = 0
					|			ТОГДА ВтСвязьЗаказовНакладных.СуммаЗаказа
					|			ИНАЧЕ &СуммаПервоначальныхВзаиморасчетов
					|		КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|	ИЗ
					|		РегистрНакопления.РасчетыСКлиентами КАК Расчеты
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСвязьЗаказовНакладных КАК ВтСвязьЗаказовНакладных
					|			ПО Расчеты.ОбъектРасчетов = ВтСвязьЗаказовНакладных.ОбъектРасчетовНакладная 
					|	ГДЕ
					|		Расчеты.ОбъектРасчетов В (ВЫБРАТЬ
					|							Т.ОбъектРасчетовНакладная
					|						ИЗ
					|							ВтСвязьЗаказовНакладных КАК Т)
					|		И Расчеты.АналитикаУчетаПоПартнерам.Организация = &Организация
					|		И Расчеты.Активность
					|	) КАК Расчеты
					|";
				
			ИначеЕсли ЭтоДоговорСНакладными Тогда
				
				ТекстЗапроса = "
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЕСТЬNULL(СУММА(Расчеты.СуммаОплат),0) КАК СуммаОплат,
					|
					|	ЕСТЬNULL(СУММА(Расчеты.СуммаОтгрузок),0) КАК СуммаОтгрузок,
					|
					|	ЕСТЬNULL(СУММА(Расчеты.СуммаЗадолженности),0) КАК СуммаЗадолженности,
					|
					|	ВЫБОР КОГДА &СуммаПервоначальныхВзаиморасчетов = 0
					|		ТОГДА МАКСИМУМ(Расчеты.СуммаПервоначальныхВзаиморасчетов)
					|		ИНАЧЕ &СуммаПервоначальныхВзаиморасчетов
					|	КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|
					|ПОМЕСТИТЬ ВтРасчеты
					|ИЗ (ВЫБРАТЬ
					|		(&ШаблонПоляОплачено) КАК СуммаОплат,
					|	
					|		(&ШаблонПоляОтгружено) КАК СуммаОтгрузок,
					|	
					|		ВЫБОР КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(РасчетыПоСрокам.Долг, 0) КАК ЧИСЛО(31,2))
					|			ИНАЧЕ 0
					|		КОНЕЦ КАК СуммаЗадолженности,
					|	
					|		ВЫБОР КОГДА РасчетыПоСрокам.ОбъектРасчетов.СуммаВзаиморасчетов = 0
					|			ТОГДА РасчетыПоСрокам.ОбъектРасчетов.Сумма
					|			ИНАЧЕ РасчетыПоСрокам.ОбъектРасчетов.СуммаВзаиморасчетов
					|		КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|	ИЗ
					|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетовДоговора
					|		ПО РасчетыПоСрокам.ОбъектРасчетов = ОбъектыРасчетовДоговора.Ссылка
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|		ПО ОбъектыРасчетовДоговора.Договор = ОбъектыРасчетов.Договор
					|		И НЕ ОбъектыРасчетов.ПометкаУдаления
					|	ГДЕ
					|		ОбъектыРасчетов.Ссылка = &ОбъектРасчетов
					|		И РасчетыПоСрокам.Активность
					|		И РасчетыПоСрокам.АналитикаУчетаПоПартнерам.Организация = &Организация
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		ВЫБОР КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|			ТОГДА Расчеты.Оплачивается
					|			ИНАЧЕ -Расчеты.Оплачивается
					|		КОНЕЦ КАК СуммаОплат,
					|		0 КАК СуммаПоставок,
					|		0 КАК СуммаЗадолженности,
					|		ВЫБОР КОГДА Расчеты.ОбъектРасчетов.СуммаВзаиморасчетов = 0
					|			ТОГДА Расчеты.ОбъектРасчетов.Сумма
					|			ИНАЧЕ Расчеты.ОбъектРасчетов.СуммаВзаиморасчетов
					|		КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|	ИЗ
					|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетовДоговора
					|		ПО Расчеты.ОбъектРасчетов = ОбъектыРасчетовДоговора.Ссылка
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|		ПО ОбъектыРасчетовДоговора.Договор = ОбъектыРасчетов.Договор
					|		И НЕ ОбъектыРасчетов.ПометкаУдаления
					|	ГДЕ
					|		ОбъектыРасчетов.Ссылка = &ОбъектРасчетов
					|		И Расчеты.Активность
					|		И Расчеты.АналитикаУчетаПоПартнерам.Организация = &Организация
					|	) КАК Расчеты
					|";
				
			Иначе
				
				ТекстЗапроса = "
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЕСТЬNULL(СУММА(Расчеты.СуммаОплат),0) КАК СуммаОплат,
					|
					|	ЕСТЬNULL(СУММА(Расчеты.СуммаОтгрузок),0) КАК СуммаОтгрузок,
					|
					|	ЕСТЬNULL(СУММА(Расчеты.СуммаЗадолженности),0) КАК СуммаЗадолженности,
					|
					|	ВЫБОР КОГДА &СуммаПервоначальныхВзаиморасчетов = 0
					|		ТОГДА МАКСИМУМ(Расчеты.СуммаПервоначальныхВзаиморасчетов)
					|		ИНАЧЕ &СуммаПервоначальныхВзаиморасчетов
					|	КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|
					|ПОМЕСТИТЬ ВтРасчеты
					|ИЗ (ВЫБРАТЬ
					|		(&ШаблонПоляОплачено) КАК СуммаОплат,
					|	
					|		(&ШаблонПоляОтгружено) КАК СуммаОтгрузок,
					|	
					|		ВЫБОР КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|			ТОГДА РасчетыПоСрокам.Долг - РасчетыПоСрокам.Предоплата
					|			ИНАЧЕ РасчетыПоСрокам.Предоплата - РасчетыПоСрокам.Долг
					|		КОНЕЦ КАК СуммаЗадолженности,
					|	
					|		ВЫБОР КОГДА РасчетыПоСрокам.ОбъектРасчетов.СуммаВзаиморасчетов = 0
					|			ТОГДА РасчетыПоСрокам.ОбъектРасчетов.Сумма
					|			ИНАЧЕ РасчетыПоСрокам.ОбъектРасчетов.СуммаВзаиморасчетов
					|		КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|	
					|	ИЗ
					|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|			ПО РасчетыПоСрокам.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
					|	ГДЕ
					|		ОбъектыРасчетов.Ссылка = &ОбъектРасчетов
					|		И РасчетыПоСрокам.АналитикаУчетаПоПартнерам.Организация = &Организация
					|		И РасчетыПоСрокам.Активность
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		ВЫБОР КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|			ТОГДА Расчеты.Оплачивается
					|			ИНАЧЕ -Расчеты.Оплачивается
					|		КОНЕЦ КАК СуммаОплат,
					|		0 КАК СуммаОтгрузок,
					|		0 КАК СуммаЗадолженности,
					|		ВЫБОР КОГДА Расчеты.ОбъектРасчетов.СуммаВзаиморасчетов = 0
					|			ТОГДА Расчеты.ОбъектРасчетов.Сумма
					|			ИНАЧЕ Расчеты.ОбъектРасчетов.СуммаВзаиморасчетов
					|		КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|	
					|	ИЗ
					|		РегистрНакопления.РасчетыСКлиентами КАК Расчеты
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|			ПО Расчеты.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
					|	ГДЕ
					|		ОбъектыРасчетов.Ссылка = &ОбъектРасчетов
					|		И Расчеты.АналитикаУчетаПоПартнерам.Организация = &Организация
					|		И Расчеты.Активность
					|	) КАК Расчеты
					|";
				
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ШаблонПоляОплачено", СтрШаблон("%1 + %2", ШаблонПоляОплаченоКлиентом(), ШаблонПоляЗачтеноКлиенту())); 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ШаблонПоляОтгружено", ШаблонПоляОтгруженоКлиенту());
			
			МассивТекстов.Добавить(ТекстЗапроса);
			
		Иначе
			ТекстЗапроса = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЕСТЬNULL(СУММА(ВЫБОР КОГДА РасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
				|		ТОГДА 0
				|		ИНАЧЕ РасчетыОстаткиИОбороты.СуммаРасход
				|	КОНЕЦ),0) КАК СуммаОплат,
				|
				|	ЕСТЬNULL(СУММА(ВЫБОР КОГДА ЕСТЬNULL(РасчетыОстаткиИОбороты.СуммаПриход, 0) < 0
				|		ИЛИ РасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации 
				|		ТОГДА 0
				|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(РасчетыОстаткиИОбороты.СуммаПриход, 0) КАК ЧИСЛО(31,2))
				|	КОНЕЦ),0) КАК СуммаОтгрузок,
				|
				|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(РасчетыОстаткиИОбороты.СуммаПриход - РасчетыОстаткиИОбороты.СуммаРасход, 0) КАК ЧИСЛО(31,2))),0) КАК СуммаЗадолженности
				|
				|ПОМЕСТИТЬ ВтРасчеты
				|ИЗ
				|	РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(, , Регистратор, , ОбъектРасчетов = &ОбъектРасчетов) КАК РасчетыОстаткиИОбороты
				|ГДЕ
				|	РасчетыОстаткиИОбороты.АналитикаУчетаПоПартнерам.Организация = &Организация
				|";
			МассивТекстов.Добавить(ТекстЗапроса);
		КонецЕсли;
		
		ТекстЗапроса = "
			|ВЫБРАТЬ
			|	Расчеты.СуммаОплат         КАК СуммаОплат,
			|	Расчеты.СуммаОтгрузок      КАК СуммаОтгрузок,
			|	ВЫБОР КОГДА Расчеты.СуммаОплат = 0
			|		ИЛИ ВтСуммаПервоначальныхВзаиморасчетов.Сумма = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(Расчеты.СуммаОплат * 100 / ВтСуммаПервоначальныхВзаиморасчетов.Сумма КАК ЧИСЛО(20, 2))
			|	КОНЕЦ                      КАК ПроцентОплат,
			|	ВЫБОР КОГДА Расчеты.СуммаОтгрузок = 0
			|		ИЛИ ВтСуммаПервоначальныхВзаиморасчетов.Сумма = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(Расчеты.СуммаОтгрузок * 100 / ВтСуммаПервоначальныхВзаиморасчетов.Сумма КАК ЧИСЛО(20, 2))
			|	КОНЕЦ                      КАК ПроцентОтгрузок,
			|	Расчеты.СуммаЗадолженности КАК СуммаЗадолженности
			|ИЗ
			|	ВтСуммаПервоначальныхВзаиморасчетов КАК ВтСуммаПервоначальныхВзаиморасчетов
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРасчеты КАК Расчеты
			|		ПО (ИСТИНА)";
		МассивТекстов.Добавить(ТекстЗапроса);
		
	ИначеЕсли ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.РасчетыСПоставщиками) Тогда
		
		Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
			
			Если ЭтоЗаказСНакладными Тогда
				
				ТекстЗапроса = "
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетовНакладная,
					|	ОбъектыРасчетовЗаказ.Ссылка КАК ОбъектРасчетовЗаказ,
					|	ОбъектыРасчетовЗаказ.Объект КАК ЗаказПоставщику,
					|	СУММА(ВЫБОР
					|			КОГДА ОбъектыРасчетов.СуммаВзаиморасчетов = 0
					|				ТОГДА ВЫБОР
					|					КОГДА ОбъектыРасчетов.Сумма = 0
					|						ТОГДА 0
					|					ИНАЧЕ РасчетыСПоставщикамиОбороты.КПоступлениюРасход / ОбъектыРасчетов.Сумма
					|				КОНЕЦ
					|			ИНАЧЕ РасчетыСПоставщикамиОбороты.КПоступлениюРасход / ОбъектыРасчетов.СуммаВзаиморасчетов
					|		КОНЕЦ) КАК ДоляЗаказа,
					|	МАКСИМУМ (ОбъектыРасчетовЗаказ.Сумма) КАК СуммаЗаказа
					|ПОМЕСТИТЬ ВтСвязьЗаказовНакладных
					|ИЗ
					|	РегистрНакопления.РасчетыСПоставщиками.Обороты( , , Регистратор, ОбъектРасчетов = &ОбъектРасчетов) КАК РасчетыСПоставщикамиОбороты
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетовЗаказ
					|		ПО РасчетыСПоставщикамиОбороты.ОбъектРасчетов = ОбъектыРасчетовЗаказ.Ссылка
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|		ПО РасчетыСПоставщикамиОбороты.Регистратор = ОбъектыРасчетов.Объект
					|		И НЕ ОбъектыРасчетов.ПометкаУдаления
					|
					|СГРУППИРОВАТЬ ПО
					|	ОбъектыРасчетов.Ссылка,
					|	ОбъектыРасчетовЗаказ.Ссылка,
					|	ОбъектыРасчетовЗаказ.Объект
					|";
				
				МассивТекстов.Добавить(ТекстЗапроса); 
				
				ТекстЗапроса = "
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЕСТЬNULL(СУММА(Расчеты.СуммаОплат), 0) КАК СуммаОплат,
					|	ЕСТЬNULL(СУММА(Расчеты.СуммаПоставок), 0) КАК СуммаПоставок,
					|	ЕСТЬNULL(СУММА(Расчеты.СуммаЗадолженности), 0) КАК СуммаЗадолженности,
					|	ЕСТЬNULL(МАКСИМУМ(Расчеты.СуммаПервоначальныхВзаиморасчетов), &СуммаПервоначальныхВзаиморасчетов) КАК СуммаПервоначальныхВзаиморасчетов
					|ПОМЕСТИТЬ ВтРасчеты
					|ИЗ (ВЫБРАТЬ
					|		&ШаблонПоляОплачено КАК СуммаОплат,
					|
					|		&ШаблонПоляПоставлено КАК СуммаПоставок,
					|
					|		ВЫБОР КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|			ТОГДА РасчетыПоСрокам.Долг
					|			ИНАЧЕ 0
					|		КОНЕЦ КАК СуммаЗадолженности,
					|
					|		ВЫБОР КОГДА &СуммаПервоначальныхВзаиморасчетов = 0
					|			ТОГДА ВЫБОР КОГДА ОбъектыРасчетов.СуммаВзаиморасчетов = 0
					|							ТОГДА ОбъектыРасчетов.Сумма
					|							ИНАЧЕ ОбъектыРасчетов.СуммаВзаиморасчетов
					|						КОНЕЦ
					|			ИНАЧЕ &СуммаПервоначальныхВзаиморасчетов
					|		КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|
					|	ИЗ
					|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|			ПО РасчетыПоСрокам.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
					|	ГДЕ
					|		ОбъектыРасчетов.Ссылка = &ОбъектРасчетов
					|		И РасчетыПоСрокам.АналитикаУчетаПоПартнерам.Организация = &Организация
					|		И РасчетыПоСрокам.Активность
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		(&ШаблонПоляОплачено) * ВтСвязьЗаказовНакладных.ДоляЗаказа КАК СуммаОплат, 
					|		0 КАК СуммаОтгрузок,
					|		0 КАК СуммаЗадолженности,
					|		ВЫБОР КОГДА &СуммаПервоначальныхВзаиморасчетов = 0
					|			ТОГДА ВтСвязьЗаказовНакладных.СуммаЗаказа
					|			ИНАЧЕ &СуммаПервоначальныхВзаиморасчетов
					|		КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|	ИЗ
					|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСвязьЗаказовНакладных КАК ВтСвязьЗаказовНакладных
					|			ПО РасчетыПоСрокам.ОбъектРасчетов = ВтСвязьЗаказовНакладных.ОбъектРасчетовНакладная 
					|	ГДЕ
					|		РасчетыПоСрокам.ОбъектРасчетов В (ВЫБРАТЬ
					|							Т.ОбъектРасчетовНакладная
					|						ИЗ
					|							ВтСвязьЗаказовНакладных КАК Т)
					|		И РасчетыПоСрокам.АналитикаУчетаПоПартнерам.Организация = &Организация
					|		И РасчетыПоСрокам.Активность
					|	) КАК Расчеты
					|";
				
			ИначеЕсли ЭтоДоговорСНакладными Тогда
				
				ТекстЗапроса = "
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЕСТЬNULL(СУММА(&ШаблонПоляОплачено), 0) КАК СуммаОплат,
					|
					|	ЕСТЬNULL(СУММА(&ШаблонПоляПоставлено), 0) КАК СуммаПоставок,
					|
					|	ЕСТЬNULL(СУММА(ВЫБОР КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|			ТОГДА РасчетыПоСрокам.Долг
					|		ИНАЧЕ 0
					|	КОНЕЦ), 0) КАК СуммаЗадолженности,
					|
					|	ВЫБОР КОГДА &СуммаПервоначальныхВзаиморасчетов = 0
					|		ТОГДА МАКСИМУМ(ВЫБОР КОГДА РасчетыПоСрокам.ОбъектРасчетов.СуммаВзаиморасчетов = 0
					|							ТОГДА РасчетыПоСрокам.ОбъектРасчетов.Сумма
					|							ИНАЧЕ РасчетыПоСрокам.ОбъектРасчетов.СуммаВзаиморасчетов
					|						КОНЕЦ)
					|		ИНАЧЕ &СуммаПервоначальныхВзаиморасчетов
					|	КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|
					|ПОМЕСТИТЬ ВтРасчеты
					|ИЗ
					|РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
					|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетовДоговора
					|	ПО РасчетыПоСрокам.ОбъектРасчетов = ОбъектыРасчетовДоговора.Ссылка
					|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|	ПО ОбъектыРасчетовДоговора.Договор = ОбъектыРасчетов.Договор
					|	И НЕ ОбъектыРасчетов.ПометкаУдаления
					|ГДЕ
					|	ОбъектыРасчетов.Ссылка  	= &ОбъектРасчетов
					|	И РасчетыПоСрокам.Активность
					|	И РасчетыПоСрокам.АналитикаУчетаПоПартнерам.Организация = &Организация
					|";
				
			Иначе
				
				ТекстЗапроса = "
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЕСТЬNULL(СУММА(&ШаблонПоляОплачено), 0) КАК СуммаОплат,
					|
					|	ЕСТЬNULL(СУММА(&ШаблонПоляПоставлено), 0) КАК СуммаПоставок,
					|
					|	ЕСТЬNULL(СУММА(ВЫБОР КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|			ТОГДА РасчетыПоСрокам.Долг - РасчетыПоСрокам.Предоплата
					|		ИНАЧЕ РасчетыПоСрокам.Предоплата - РасчетыПоСрокам.Долг
					|	КОНЕЦ), 0) КАК СуммаЗадолженности,
					|
					|	ВЫБОР КОГДА &СуммаПервоначальныхВзаиморасчетов = 0
					|		ТОГДА МАКСИМУМ(ВЫБОР КОГДА РасчетыПоСрокам.ОбъектРасчетов.СуммаВзаиморасчетов = 0
					|							ТОГДА РасчетыПоСрокам.ОбъектРасчетов.Сумма
					|							ИНАЧЕ РасчетыПоСрокам.ОбъектРасчетов.СуммаВзаиморасчетов
					|						КОНЕЦ)
					|		ИНАЧЕ &СуммаПервоначальныхВзаиморасчетов
					|	КОНЕЦ КАК СуммаПервоначальныхВзаиморасчетов
					|
					|ПОМЕСТИТЬ ВтРасчеты
					|ИЗ
					|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|		ПО РасчетыПоСрокам.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
					|ГДЕ
					|	ОбъектыРасчетов.Ссылка = &ОбъектРасчетов
					|	И РасчетыПоСрокам.АналитикаУчетаПоПартнерам.Организация = &Организация
					|	И РасчетыПоСрокам.Активность
					|";
				
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ШаблонПоляОплачено", СтрШаблон("%1 + %2", ШаблонПоляОплаченоПоставщику(), ШаблонПоляЗачтеноПоставщиком())); 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ШаблонПоляПоставлено", ШаблонПоляПоставленоПоставщиком());
			МассивТекстов.Добавить(ТекстЗапроса);
			
		Иначе
			ТекстЗапроса = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЕСТЬNULL(СУММА(ВЫБОР КОГДА РасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.КорректировкаПриобретения
				|			ТОГДА 0
				|		ИНАЧЕ РасчетыОстаткиИОбороты.СуммаПриход
				|	КОНЕЦ), 0) КАК СуммаОплат,
				|
				|	ЕСТЬNULL(СУММА(ВЫБОР КОГДА РасчетыОстаткиИОбороты.СуммаРасход < 0
				|					ИЛИ РасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.КорректировкаПриобретения
				|			ТОГДА 0
				|		ИНАЧЕ РасчетыОстаткиИОбороты.СуммаРасход
				|	КОНЕЦ), 0) КАК СуммаПоставок,
				|
				|	ЕСТЬNULL(СУММА(РасчетыОстаткиИОбороты.СуммаРасход - РасчетыОстаткиИОбороты.СуммаПриход), 0) КАК СуммаЗадолженности
				|
				|ПОМЕСТИТЬ ВтРасчеты
				|ИЗ
				|	РегистрНакопления.РасчетыСПоставщиками.ОстаткиИОбороты(, , Регистратор, , ОбъектРасчетов = &ОбъектРасчетов) КАК РасчетыОстаткиИОбороты
				|ГДЕ
				|	РасчетыОстаткиИОбороты.АналитикаУчетаПоПартнерам.Организация = &Организация
				|";
			МассивТекстов.Добавить(ТекстЗапроса);
		КонецЕсли;
		
		ТекстЗапроса = "
			|ВЫБРАТЬ
			|	Расчеты.СуммаОплат         КАК СуммаОплат,
			|	Расчеты.СуммаПоставок      КАК СуммаПоставок,
			|	ВЫБОР КОГДА Расчеты.СуммаОплат = 0
			|		ИЛИ ВтСуммаПервоначальныхВзаиморасчетов.Сумма = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(Расчеты.СуммаОплат * 100 / ВтСуммаПервоначальныхВзаиморасчетов.Сумма КАК ЧИСЛО(20, 2))
			|	КОНЕЦ                      КАК ПроцентОплат,
			|	ВЫБОР КОГДА Расчеты.СуммаПоставок = 0
			|		ИЛИ ВтСуммаПервоначальныхВзаиморасчетов.Сумма = 0
			|			ТОГДА 0
			|		ИНАЧЕ ВЫРАЗИТЬ(Расчеты.СуммаПоставок* 100 / ВтСуммаПервоначальныхВзаиморасчетов.Сумма КАК ЧИСЛО(20, 2))
			|	КОНЕЦ                      КАК ПроцентПоставок,
			|	Расчеты.СуммаЗадолженности КАК СуммаЗадолженности
			|ИЗ
			|	ВтСуммаПервоначальныхВзаиморасчетов КАК ВтСуммаПервоначальныхВзаиморасчетов
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРасчеты КАК Расчеты
			|		ПО (ИСТИНА)";
		МассивТекстов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Запрос.Текст = СтрСоединить(МассивТекстов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРасчетов, Результат.Выгрузить()[0]);
	КонецЕсли;
	
	Возврат СтруктураРасчетов;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункцииДляВыбораДокументаРасчетов

// Текст запроса выбора основания платежа, УИП по номеру основания платежа / УИП для поиска.
// 
// Параметры:
//  ВводПоСтроке - Булево - Признак того, что происходит ввод по строке. Говорит о том, что нужно выбрать первые 10. 
//  	Поиск идет по части наименования/номер основания платежа, или части УИП.
//  СтруктураОтбора - см. ВзаиморасчетыКлиентСервер.СтруктураОтбораДанныхВыбора.
//  ЭтоРасчетыСКлиентом  - Булево - Флаг содержащий Истина,
//  	если "СтруктураОтбора.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом".
//  ЭтоУИП - Булево - Флаг, отвечающий за то, что текст запроса формируется для поиска основания платежа по номеру УИП.
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция ТекстЗапросаВыбораОснованияПлатежаПоСтроке(ВводПоСтроке, СтруктураОтбора, ЭтоРасчетыСКлиентом,
	ЭтоУИП)
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ //ПЕРВЫЕ 10
	|	РеестрДокументов.Ссылка КАК ОснованиеПлатежа,
	|	РеестрДокументов.Контрагент.Ключ КАК Контрагент,
	|	РеестрДокументов.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) = ТИП(Документ.СчетНаОплатуКлиенту)
	|		ТОГДА ВЫРАЗИТЬ(РеестрДокументов.Ссылка КАК Документ.СчетНаОплатуКлиенту).ИдентификаторПлатежа
	//++ Локализация
	|		КОГДА ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) = ТИП(Документ.СчетФактураВыданный)
	|		ТОГДА ВЫРАЗИТЬ(РеестрДокументов.Ссылка КАК Документ.СчетФактураВыданный).ИдентификаторПлатежа
	//-- Локализация
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИдентификаторПлатежа,
	|	ВЫБОР
	|		КОГДА РеестрДокументов.Проведен
	|		ТОГДА 1
	|		КОГДА РеестрДокументов.ПометкаУдаления
	|		ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Состояние
	|ИЗ
	|	РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|ПО
	|	РеестрДокументов.Договор = Договоры.Ссылка
	|ГДЕ
	|	(РеестрДокументов.Организация В (&Организация)
	|		ИЛИ НЕ &Организация В (ВЫБРАТЬ Т.ГоловнаяОрганизация ИЗ ВтГоловнаяОрганизация КАК Т)
	|		И РеестрДокументов.Договор В (ВЫБРАТЬ Т.Ссылка ИЗ ВтЦентрализованныеДоговоры КАК Т)
	|		И (РеестрДокументов.Организация В (ВЫБРАТЬ Т.ГоловнаяОрганизация ИЗ ВтГоловнаяОрганизация КАК Т)
	|			ИЛИ ЕСТЬNULL(Договоры.РазрешаетсяПередачаОплатМеждуФилиалами, ЛОЖЬ))
	|		ИЛИ РеестрДокументов.Организация.ГоловнаяОрганизация В (&Организация)
	|		И РеестрДокументов.Организация.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию)
	|
	|	И &ДинамическиеУсловияРеестр
	|";
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	Если ЭтоУИП Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ //ПЕРВЫЕ 10
		|	ОбъектыРасчетов.Объект КАК ОснованиеПлатежа,
		|	ОбъектыРасчетов.Контрагент КАК Контрагент,
		|	ОбъектыРасчетов.Договор КАК Договор,
		|	ОбъектыРасчетов.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
		|	ОбъектыРасчетов.Состояние КАК Состояние
		|ИЗ
		|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.ДоговорыКонтрагентов КАК Договоры
		|ПО
		|	ОбъектыРасчетов.Договор = Договоры.Ссылка
		|ГДЕ
		|	(ОбъектыРасчетов.Организация В (&Организация)
		|	ИЛИ НЕ &Организация В (ВЫБРАТЬ Т.ГоловнаяОрганизация ИЗ ВтГоловнаяОрганизация КАК Т)
		|		И ОбъектыРасчетов.Договор В (ВЫБРАТЬ Т.Ссылка ИЗ ВтЦентрализованныеДоговоры КАК Т)
		|		И (ОбъектыРасчетов.Организация В (ВЫБРАТЬ Т.ГоловнаяОрганизация ИЗ ВтГоловнаяОрганизация КАК Т)
		|			ИЛИ ЕСТЬNULL(Договоры.РазрешаетсяПередачаОплатМеждуФилиалами, ЛОЖЬ))
		|	ИЛИ ОбъектыРасчетов.Организация.ГоловнаяОрганизация В (&Организация)
		|		И ОбъектыРасчетов.Организация.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию)
		|
		|	И ОбъектыРасчетов.ИдентификаторПлатежа В (&СтрокаПоиска)
		|
		|	И &ДинамическиеУсловияОбъектыРасчетов
		|";
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ //ПЕРВЫЕ 10
	|	Договоры.Ссылка КАК ОснованиеПлатежа,
	|	Договоры.Контрагент КАК Контрагент,
	|	Договоры.Ссылка КАК Договор,
	|	Договоры.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	ВЫБОР
	|		КОГДА Договоры.ПометкаУдаления
	|		ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Состояние
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|ГДЕ
	|	(Договоры.Организация В (&Организация)
	|		ИЛИ НЕ &Организация В (ВЫБРАТЬ Т.ГоловнаяОрганизация ИЗ ВтГоловнаяОрганизация КАК Т)
	|			И Договоры.Ссылка В (ВЫБРАТЬ 
	|			                                 ВтЦентрализованныеДоговоры.Ссылка 
	|			                                 ИЗ ВтЦентрализованныеДоговоры)
	|			И (Договоры.Организация В (ВЫБРАТЬ Т.ГоловнаяОрганизация ИЗ ВтГоловнаяОрганизация КАК Т)
	|				ИЛИ Договоры.РазрешаетсяПередачаОплатМеждуФилиалами)
	|		ИЛИ Договоры.Организация.ГоловнаяОрганизация В (&Организация)
	|			И Договоры.Организация.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию)
	|	И Договоры.ТипДоговора В (&ТипыДоговоров)
	|
	|	И &ДинамическиеУсловияДоговорыКонтрагентов
	|";
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ИспользоватьДоговорыМеждуОрганизациями = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыМеждуОрганизациями");
	
	Если ИспользоватьДоговорыМеждуОрганизациями Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ //ПЕРВЫЕ 10
		|	Договоры.Ссылка КАК ОснованиеПлатежа,
		|	Договоры.ОрганизацияПолучатель КАК Контрагент,
		|	Договоры.Ссылка КАК Договор,
		|	Договоры.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
		|	ВЫБОР
		|		КОГДА Договоры.ПометкаУдаления
		|		ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Состояние
		|ИЗ
		|	Справочник.ДоговорыМеждуОрганизациями КАК Договоры
		|ГДЕ
		|	&ДинамическиеУсловияДоговорыМеждуОрганизациями
		|";
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());

	УсловияЗапросаРеестр = Новый Массив;
	УсловияЗапросаРеестр.Добавить("ИСТИНА");
	
	УсловияЗапросаОбъектыРасчетов = Новый Массив;
	УсловияЗапросаОбъектыРасчетов.Добавить("ИСТИНА");
	
	УсловияЗапросаДоговорыКонтрагентов = Новый Массив;
	УсловияЗапросаДоговорыКонтрагентов.Добавить("ИСТИНА");
	
	УсловияЗапросаДоговорыМеждуОрганизациями = Новый Массив;
	УсловияЗапросаДоговорыМеждуОрганизациями.Добавить("ИСТИНА");
		
	Если ЗначениеЗаполнено(СтруктураОтбора.Контрагент) Тогда
		
		УсловияЗапросаРеестр.Добавить("(РеестрДокументов.Контрагент.Ключ В (&Контрагент))");
		
		УсловияЗапросаДоговорыКонтрагентов.Добавить("(Договоры.Контрагент В (&Контрагент))");
		
		Если ЭтоУИП Тогда
			УсловияЗапросаОбъектыРасчетов.Добавить("(ОбъектыРасчетов.Контрагент В (&Контрагент))");
		КонецЕсли;
		
		Если ИспользоватьДоговорыМеждуОрганизациями Тогда
			
			УсловияЗапросаДоговорыМеждуОрганизациями.Добавить(?(ЭтоРасчетыСКлиентом,
				"Договоры.ОрганизацияПолучатель В (ВЫБРАТЬ Т.Ссылка ИЗ ВтОтборМеждуОрганизациями КАК Т)",
				"Договоры.Организация В (ВЫБРАТЬ Т.Ссылка ИЗ ВтОтборМеждуОрганизациями КАК Т)"));
		КонецЕсли;
	КонецЕсли;
		
	Если СтруктураОтбора.ТипыОснований.Количество() > 0 Тогда
		УсловияЗапросаРеестр.Добавить("ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) В (&ТипыОснований)");
	КонецЕсли;
	
	Если ЭтоУИП Тогда
		
		УсловияЗапросаРеестр.Добавить("
		|ВЫБОР
		|	КОГДА ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) = ТИП(Документ.СчетНаОплатуКлиенту)
		|	ТОГДА ВЫРАЗИТЬ(РеестрДокументов.Ссылка КАК Документ.СчетНаОплатуКлиенту).ИдентификаторПлатежа
		|		В (&СтрокаПоиска)
		//++ Локализация
		|	КОГДА ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) = ТИП(Документ.СчетФактураВыданный)
		|	ТОГДА ВЫРАЗИТЬ(РеестрДокументов.Ссылка КАК Документ.СчетФактураВыданный).ИдентификаторПлатежа
		|		В (&СтрокаПоиска)
		//-- Локализация
		|	ИНАЧЕ ЛОЖЬ
		|КОНЕЦ
		|");
		
		УсловияЗапросаДоговорыКонтрагентов.Добавить("Договоры.ИдентификаторПлатежа В (&СтрокаПоиска)");
		
		Если ИспользоватьДоговорыМеждуОрганизациями Тогда
			УсловияЗапросаДоговорыМеждуОрганизациями.Добавить("Договоры.ИдентификаторПлатежа В (&СтрокаПоиска)");
		КонецЕсли;
		
		УсловияЗапросаОбъектыРасчетов.Добавить(?(ЭтоРасчетыСКлиентом,
			"(ОбъектыРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом))",
			"(ОбъектыРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком))"));
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДинамическиеУсловияОбъектыРасчетов",
			СтрСоединить(УсловияЗапросаОбъектыРасчетов, " И "));
	Иначе
		УсловияЗапросаРеестр.Добавить("РеестрДокументов.НомерДокументаИБ В (&СтрокаПоиска)");
		УсловияЗапросаДоговорыКонтрагентов.Добавить("Договоры.Наименование В (&СтрокаПоиска)");
		
		Если ИспользоватьДоговорыМеждуОрганизациями Тогда
			УсловияЗапросаДоговорыМеждуОрганизациями.Добавить("Договоры.Наименование В (&СтрокаПоиска)");
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДинамическиеУсловияРеестр", СтрСоединить(УсловияЗапросаРеестр, " И "));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДинамическиеУсловияДоговорыКонтрагентов", 
		СтрСоединить(УсловияЗапросаДоговорыКонтрагентов, " И "));
	
	Если ИспользоватьДоговорыМеждуОрганизациями Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДинамическиеУсловияДоговорыМеждуОрганизациями",
			СтрСоединить(УсловияЗапросаДоговорыМеждуОрганизациями, " И "));
	КонецЕсли;
	
	Если ВводПоСтроке Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПЕРВЫЕ 10", "ПЕРВЫЕ 10"); //@Query-part-1 @Query-part-2
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "В (&СтрокаПоиска)", "ПОДОБНО &СтрокаПоиска");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращаемое значение:
// 	Строка
//
Функция ТекстЗапросаВременныхТаблицДанныхВыбора() Экспорт
	
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Филиалы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВтЦентрализованныеДоговоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.Филиалы КАК Филиалы
		|ГДЕ
		|	Филиалы.Организация = &Организация
		|	И &УчитыватьФилиалы
		|;
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ПОМЕСТИТЬ ВтГоловнаяОрганизация
		|ИЗ 
		|	Справочник.Организации КАК Организации
		|ГДЕ 
		|	Организации.Ссылка = &Организация
		|	И &УчитыватьФилиалы
		|;
		|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращаемое значение:
// 	Строка
//
Функция ТекстЗапросаВыбораОбъектаРасчетов(ВводПоСтроке) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыРасчетов.Объект                  КАК ОснованиеПлатежа,
	|	ОбъектыРасчетов.Ссылка                  КАК ОбъектРасчетов,
	|	ОбъектыРасчетов.Объект                  КАК Объект,
	|	ОбъектыРасчетов.Партнер                 КАК Партнер,
	|	ОбъектыРасчетов.Организация             КАК Организация,
	|	ОбъектыРасчетов.Контрагент              КАК Контрагент,
	|	ОбъектыРасчетов.Договор                 КАК Договор,
	|	ОбъектыРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОбъектыРасчетов.ВалютаВзаиморасчетов    КАК ВалютаВзаиморасчетов,
	|	ОбъектыРасчетов.ИдентификаторПлатежа    КАК ИдентификаторПлатежа,
	|	ОбъектыРасчетов.Номер                   КАК Номер,
	|	ОбъектыРасчетов.Дата                    КАК Дата,
	|	ОбъектыРасчетов.ДатаВходящегоДокумента  КАК ДатаВходящегоДокумента,
	|	ОбъектыРасчетов.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ОбъектыРасчетов.Сумма                   КАК СуммаЗаказа,
	|	0                                       КАК СуммаПлатежа,
	|	ОбъектыРасчетов.Валюта                  КАК Валюта,
	|	ОбъектыРасчетов.Состояние               КАК Состояние,
	|	ОбъектыРасчетов.ПометкаУдаления         КАК ПометкаУдаления,
	|	ЕСТЬNULL(Договоры.ЦентрализованныйДоговор, ЛОЖЬ) КАК ЦентрализованныйДоговор, 
	|	ЕСТЬNULL(Договоры.ДоговорСКомиссионером.ВестиРасчетыЧерезКонечныхПокупателей, ЛОЖЬ) КАК КомиссияЧерезКонечныхПокупателей,
	|	ЕСТЬNULL(Договоры.РазрешенаРаботаСДочернимиПартнерами, ЛОЖЬ) КАК РазрешенаРаботаСДочернимиПартнерами,
	|	ОбъектыРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО ОбъектыРасчетов.Договор = Договоры.Ссылка
	|ГДЕ &ДинамическиеУсловия
	|	И НЕ ОбъектыРасчетов.ПометкаУдаления
	|";
	
	Если ВводПоСтроке Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10"); //@Query-part-1 @Query-part-2
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает параметры, используемые при выборе документа расчетов с клиентами.
// Используется в общей форме "ВыборДокументаРасчетов" и в обработке получения данных выбора основания платежа.
// 
// Возвращаемое значение: 
// Структура :
//	* ВводПоСтроке - Булево - Признак получения данных выбора.
//	* ЭтоУИП - Булево - Поиск документа расчетов осуществляется по УИП.
//	* ОтборПоОрганизацииИКонтрагенту - Булево - Есть отбор по организации и контрагенту.
//	* ИсключитьРедактируемыйДокумент - Булево - Не включать документ из которого вызывается подбор в данные выбора.
//	* ЗапретитьДоговорыПоДокументам - Булево - Запретить договоры с порядком расчетов "по заказам/накладным".
//
Функция ПараметрыОтбораПриВыбореДокументаРасчетовСКлиентами() Экспорт 
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВводПоСтроке",                   Ложь);
	ПараметрыОтбора.Вставить("ЭтоУИП",                         Ложь);
	ПараметрыОтбора.Вставить("ОтборПоОрганизацииИКонтрагенту", Ложь);
	ПараметрыОтбора.Вставить("ИсключитьРедактируемыйДокумент", Ложь);
	ПараметрыОтбора.Вставить("ЗапретитьДоговорыПоДокументам",  Ложь);
	
	Возврат ПараметрыОтбора;
	
КонецФункции

// Структура выбранного значения.
// 
// Возвращаемое значение:
// Структура: 
// 	* ОснованиеПлатежа - ДокументСсылка, Неопределено
// 	* ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов
// 	* ДокументОснование - ДокументСсылка, Неопределено
// 	* Партнер - СправочникСсылка.Партнеры
// 	* Контрагент - СправочникСсылка.Контрагенты
// 	* ИдентификаторПлатежа - Строка
// 	* ВалютаВзаиморасчетов - СправочникСсылка.Валюты
// 	* ЭтоРасчетыСКлиентами - Булево
// 	* СуммаПлатежа - Число
// 	* СуммаЗаказа - Число
// 	* Договор - СправочникСсылка.ДоговорыКонтрагентов, СправочникСсылка.ДоговорыМеждуОрганизациями, Неопределено - Договор выбранного документа
// 	* Организация - СправочникСсылка.Организации
// 	* ДатаПогашения - Дата
// 	* ДатаПлатежа - Дата
// 	* Дата - Дата
// 	* ЦентрализованныйДоговор - Булево
// 	* КомиссияЧерезКонечныхПокупателей - Булево
// 	* РазрешенаРаботаСДочернимиПартнерами - Булево
// 	* Объект - ОпределяемыйТип.ОбъектРасчетов
// 	* НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности
// 	* СуммаВзаиморасчетов - Число
// 	* СтавкаНДС - СправочникСсылка.СтавкиНДС
// 	* СуммаНДС - Число
//  
Функция СтруктураЗначениеВыбора()
	
	ЗначениеВыбора = Новый Структура;
	
	ЗначениеВыбора.Вставить("ОснованиеПлатежа", Неопределено);
	ЗначениеВыбора.Вставить("ОбъектРасчетов", Справочники.ОбъектыРасчетов.ПустаяСсылка());
	ЗначениеВыбора.Вставить("ДокументОснование", Неопределено);
	ЗначениеВыбора.Вставить("Партнер", Справочники.Партнеры.ПустаяСсылка());
	ЗначениеВыбора.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	ЗначениеВыбора.Вставить("ИдентификаторПлатежа", "");
	ЗначениеВыбора.Вставить("ВалютаВзаиморасчетов", Справочники.Валюты.ПустаяСсылка());
	ЗначениеВыбора.Вставить("ЭтоРасчетыСКлиентами", Ложь);
	ЗначениеВыбора.Вставить("СуммаПлатежа", 0);
	ЗначениеВыбора.Вставить("СуммаЗаказа", 0);
	ЗначениеВыбора.Вставить("Договор", Неопределено);
	ЗначениеВыбора.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ЗначениеВыбора.Вставить("ДатаПогашения", Дата(1, 1, 1));
	ЗначениеВыбора.Вставить("ДатаПлатежа", Дата(1, 1, 1));
	ЗначениеВыбора.Вставить("Дата", Дата(1, 1, 1));
	ЗначениеВыбора.Вставить("Номер", "");
	ЗначениеВыбора.Вставить("ЦентрализованныйДоговор", Ложь);
	ЗначениеВыбора.Вставить("КомиссияЧерезКонечныхПокупателей", Ложь);
	ЗначениеВыбора.Вставить("РазрешенаРаботаСДочернимиПартнерами", Ложь);
	ЗначениеВыбора.Вставить("Объект", Неопределено);
	ЗначениеВыбора.Вставить("НаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());
	ЗначениеВыбора.Вставить("СуммаВзаиморасчетов", 0);
	ЗначениеВыбора.Вставить("СтавкаНДС", ПредопределенноеЗначение("Справочник.СтавкиНДС.ПустаяСсылка"));
	ЗначениеВыбора.Вставить("СуммаНДС", 0);
	
	Возврат ЗначениеВыбора;
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Возвращаемое значение:
// 	Строка - Текст предупреждения
Функция ТекстПредупрежденияЗаданияРаспределенияВзаиморасчетов() Экспорт
	
	ТекстПричины =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Имеются невыполненные задания отложенного распределения взаиморасчетов (регистр %1)'", ОбщегоНазначения.КодОсновногоЯзыка()),
					Метаданные.РегистрыСведений.ЗаданияКРаспределениюВзаиморасчетов.Синоним);
	
	Возврат ТекстПричины;
	
КонецФункции

Функция ТекстЗапросаПоОстаткамРасчетовСПоставщиками(ПоДатамПлатежей)
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
		|	ЛОЖЬ                                    КАК Выбран,
		|	0                                       КАК Сумма,
		|	ДАТАВРЕМЯ(1, 1, 1)                      КАК ДатаПогашения,
		|	&ВалютаДокумента                        КАК ВалютаДокумента,
		|	ОбъектыРасчетов.Дата                    КАК Дата,
		|	ОбъектыРасчетов.Номер                   КАК Номер,
		|	ОбъектыРасчетов.Ссылка                  КАК ОбъектРасчетов,
		|	ОбъектыРасчетов.ИдентификаторПлатежа    КАК ИдентификаторПлатежа,
		|	ДанныеРасчетов.ВалютаВзаиморасчетов    КАК ВалютаВзаиморасчетов,
		|	ДанныеРасчетов.Организация              КАК Организация,
		|	ДанныеРасчетов.Партнер                  КАК Партнер,
		|	ОбъектыРасчетов.Контрагент              КАК Контрагент,
		|	ОбъектыРасчетов.Договор                 КАК Договор,
		|	ОбъектыРасчетов.Объект                  КАК Объект,
		|	ОбъектыРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ОбъектыРасчетов.Подразделение           КАК Подразделение,
		|	ЕСТЬNULL(ЕСТЬNULL(ДоговорыКонтрагентов.ВариантКурсаДоговора, ДоговорыМеждуОрганизациями.ВариантКурсаДоговора), ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) КАК ВариантКурсаДоговора,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|						ТОГДА &СтатьяДвиженияДенежныхСредств
		|					ИНАЧЕ ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств
		|				КОНЕЦ
		|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
		|	КОНЕЦ                                   КАК СтатьяДвиженияДенежныхСредств,
		|	ЕСТЬNULL(ОбъектыРасчетов.Договор.ПлатежиПо275ФЗ, ЛОЖЬ) КАК ПлатежиПо275ФЗ,
		|	СУММА(ДанныеРасчетов.ДолгПартнера)      КАК ДолгПартнера,
		|	СУММА(ДанныеРасчетов.КОплате)           КАК КОплате,
		|	0                                       КАК Оплачивается,
		|	СУММА(ДанныеРасчетов.НашДолг)           КАК НашДолг,
		|	&ДатаПлатежа                            КАК ДатаПлатежа,
		|	ОбъектыРасчетов.ОперацияССамозанятым    КАК ОперацияССамозанятым
		|ИЗ
		|	(ВЫБРАТЬ
		|		РасчетыСПоставщиками.ОбъектРасчетов                        КАК ОбъектРасчетов,
		|		РасчетыСПоставщиками.Валюта                                КАК ВалютаВзаиморасчетов,
		|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Организация КАК Организация,
		|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Партнер     КАК Партнер,
		|		РасчетыСПоставщиками.ПредоплатаОстаток                     КАК ДолгПартнера,
		|		РасчетыСПоставщиками.КОплате                               КАК КОплате,
		|		0                                                          КАК Оплачивается,
		|		РасчетыСПоставщиками.ДолгОстаток                           КАК НашДолг,
		|		РасчетыСПоставщиками.ДатаПлановогоПогашения                КАК ДатаПлатежа
		|	ИЗ
		|		РасчетыСПоставщикамиПоСрокамОстатки КАК РасчетыСПоставщиками
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасчетыСПоставщиками.ОбъектРасчетов                        КАК ОбъектРасчетов,
		|		РасчетыСПоставщиками.Валюта                                КАК ВалютаВзаиморасчетов,
		|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Организация КАК Организация,
		|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Партнер     КАК Партнер,
		|		0                                                          КАК ДолгПартнера,
		|		РасчетыСПоставщиками.КОплатеОстаток                        КАК КОплате,
		|		0                                                          КАК Оплачивается,
		|		0                                                          КАК НашДолг,
		|		РасчетыСПоставщиками.ДатаПлановогоПогашения                КАК ДатаПлатежа
		|	ИЗ
		|		РасчетыСПоставщикамиПланОплатОстатки КАК РасчетыСПоставщиками
		|		) КАК ДанныеРасчетов
		| 			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|				ПО ОбъектыРасчетов.Договор = ДоговорыКонтрагентов.Ссылка
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыМеждуОрганизациями КАК ДоговорыМеждуОрганизациями
		|				ПО ОбъектыРасчетов.Договор = ДоговорыМеждуОрганизациями.Ссылка
		|			ПО ДанныеРасчетов.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
		|ГДЕ
		|	НЕ ОбъектыРасчетов.Объект ССЫЛКА Справочник.ПодарочныеСертификаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыРасчетов.Дата,
		|	ОбъектыРасчетов.Номер,
		|	ОбъектыРасчетов.Ссылка,
		|	ОбъектыРасчетов.ИдентификаторПлатежа,
		|	ДанныеРасчетов.ВалютаВзаиморасчетов,
		|	ДанныеРасчетов.Организация,
		|	ДанныеРасчетов.Партнер,
		|	ОбъектыРасчетов.Контрагент,
		|	ОбъектыРасчетов.Договор,
		|	ОбъектыРасчетов.Объект,
		|	ОбъектыРасчетов.НаправлениеДеятельности,
		|	ОбъектыРасчетов.Подразделение,
		|	ДанныеРасчетов.ДатаПлатежа,
		|	ЕСТЬNULL(ЕСТЬNULL(ДоговорыКонтрагентов.ВариантКурсаДоговора, ДоговорыМеждуОрганизациями.ВариантКурсаДоговора), ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|						ТОГДА &СтатьяДвиженияДенежныхСредств
		|					ИНАЧЕ ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств
		|				КОНЕЦ
		|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
		|	КОНЕЦ,
		|	ЕСТЬNULL(ОбъектыРасчетов.Договор.ПлатежиПо275ФЗ, ЛОЖЬ),
		|	ОбъектыРасчетов.ОперацияССамозанятым
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Контрагент,
		|	&ДатаПлатежа,
		|	Дата,
		|	Номер
		|;
		|
		|ВЫБРАТЬ
		|	РасчетыСПоставщиками.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасчетыСПоставщиками.Валюта КАК ВалютаВзаиморасчетов,
		|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Организация КАК Организация,
		|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
		|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
		|	-РасчетыСПоставщиками.ОплачиваетсяОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|			,
		|			НЕ &ДебиторскаяЗадолженность
		|			И НЕ &ТолькоБезусловнаяЗадолженность
		|			И НЕ &ПодборВОплатуПоЗаявкам
		|			И ОбъектРасчетов В
		|				(ВЫБРАТЬ
		|					ОбъектыРасчетов.ОбъектРасчетов
		|				ИЗ
		|					ОбъектыРасчетов КАК ОбъектыРасчетов)) КАК РасчетыСПоставщиками
		|ГДЕ
		|	РасчетыСПоставщиками.ОплачиваетсяОстаток < 0
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеРасчетов.ДатаПлатежа,", ?(ПоДатамПлатежей, "ДанныеРасчетов.ДатаПлатежа,", ""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаПлатежа", ?(ПоДатамПлатежей, "ДанныеРасчетов.ДатаПлатежа", "МИНИМУМ(ДанныеРасчетов.ДатаПлатежа)"));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПоОстаткамРасчетовСКлиентами(ПоДатамПлатежей)
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
		|	ЛОЖЬ                                    КАК Выбран,
		|	0                                       КАК Сумма,
		|	ДАТАВРЕМЯ(1, 1, 1)                      КАК ДатаПогашения,
		|	&ВалютаДокумента                        КАК ВалютаДокумента,
		|	ОбъектыРасчетов.Дата                    КАК Дата,
		|	ОбъектыРасчетов.Номер                   КАК Номер,
		|	ОбъектыРасчетов.Ссылка                  КАК ОбъектРасчетов,
		|	ОбъектыРасчетов.ИдентификаторПлатежа    КАК ИдентификаторПлатежа,
		|	ОбъектыРасчетов.ВалютаВзаиморасчетов    КАК ВалютаВзаиморасчетов,
		|	ДанныеРасчетов.Организация              КАК Организация,
		|	ДанныеРасчетов.Партнер                  КАК Партнер,
		|	ОбъектыРасчетов.Контрагент              КАК Контрагент,
		|	ОбъектыРасчетов.Договор                 КАК Договор,
		|	ОбъектыРасчетов.Объект                  КАК Объект,
		|	ОбъектыРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ОбъектыРасчетов.Подразделение           КАК Подразделение,
		|	ЕСТЬNULL(ЕСТЬNULL(ДоговорыКонтрагентов.ВариантКурсаДоговора, ДоговорыМеждуОрганизациями.ВариантКурсаДоговора), ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) КАК ВариантКурсаДоговора,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|						ТОГДА &СтатьяДвиженияДенежныхСредств
		|					ИНАЧЕ ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств
		|				КОНЕЦ
		|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
		|	КОНЕЦ                                   КАК СтатьяДвиженияДенежныхСредств,
		|	СУММА(ДанныеРасчетов.ДолгПартнера)      КАК ДолгПартнера,
		|	СУММА(ДанныеРасчетов.КОплате)           КАК КОплате,
		|	0                                       КАК Оплачивается,
		|	СУММА(ДанныеРасчетов.НашДолг)           КАК НашДолг,
		|	&ДатаПлатежа                            КАК ДатаПлатежа,
		|	ОбъектыРасчетов.ОперацияССамозанятым    КАК ОперацияССамозанятым
		|ИЗ
		|	(ВЫБРАТЬ
		|		РасчетыСКлиентами.ОбъектРасчетов                        КАК ОбъектРасчетов,
		|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация КАК Организация,
		|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Партнер     КАК Партнер,
		|		РасчетыСКлиентами.ДолгОстаток                           КАК ДолгПартнера,
		|		РасчетыСКлиентами.КОплате                               КАК КОплате,
		|		0                                                       КАК Оплачивается,
		|		РасчетыСКлиентами.ПредоплатаОстаток                     КАК НашДолг,
		|		РасчетыСКлиентами.ДатаПлановогоПогашения                КАК ДатаПлатежа
		|	ИЗ
		|		РасчетыСКлиентамиПоСрокамОстатки КАК РасчетыСКлиентами
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасчетыСКлиентами.ОбъектРасчетов                        КАК ОбъектРасчетов,
		|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация КАК Организация,
		|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Партнер     КАК Партнер,
		|		0                                                       КАК ДолгПартнера,
		|		РасчетыСКлиентами.КОплатеОстаток                        КАК КОплате,
		|		0                                                       КАК Оплачивается,
		|		0                                                       КАК НашДолг,
		|		РасчетыСКлиентами.ДатаПлановогоПогашения                КАК ДатаПлатежа
		|	ИЗ
		|		РасчетыСКлиентамиПланОплатОстатки КАК РасчетыСКлиентами
		|		) КАК ДанныеРасчетов
		| 			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|				ПО ОбъектыРасчетов.Договор = ДоговорыКонтрагентов.Ссылка
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыМеждуОрганизациями КАК ДоговорыМеждуОрганизациями
		|				ПО ОбъектыРасчетов.Договор = ДоговорыМеждуОрганизациями.Ссылка
		|			ПО ДанныеРасчетов.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
		|ГДЕ
		|	НЕ ОбъектыРасчетов.Объект ССЫЛКА Справочник.ПодарочныеСертификаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыРасчетов.Дата,
		|	ОбъектыРасчетов.Номер,
		|	ОбъектыРасчетов.Ссылка,
		|	ОбъектыРасчетов.ИдентификаторПлатежа,
		|	ОбъектыРасчетов.ВалютаВзаиморасчетов,
		|	ДанныеРасчетов.Организация,
		|	ДанныеРасчетов.Партнер,
		|	ОбъектыРасчетов.Контрагент,
		|	ОбъектыРасчетов.Договор,
		|	ОбъектыРасчетов.Объект,
		|	ОбъектыРасчетов.НаправлениеДеятельности,
		|	ОбъектыРасчетов.Подразделение,
		|	ДанныеРасчетов.ДатаПлатежа,
		|	ЕСТЬNULL(ЕСТЬNULL(ДоговорыКонтрагентов.ВариантКурсаДоговора, ДоговорыМеждуОрганизациями.ВариантКурсаДоговора), ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|						ТОГДА &СтатьяДвиженияДенежныхСредств
		|					ИНАЧЕ ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств
		|				КОНЕЦ
		|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
		|	КОНЕЦ,
		|	ОбъектыРасчетов.ОперацияССамозанятым
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Контрагент,
		|	&ДатаПлатежа,
		|	Дата,
		|	Номер
		|;
		|
		|ВЫБРАТЬ
		|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасчетыСКлиентами.Валюта КАК ВалютаВзаиморасчетов,
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация КАК Организация,
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
		|	РасчетыСКлиентами.ОплачиваетсяОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(
		|			,
		|			&ДебиторскаяЗадолженность
		|			И НЕ &ТолькоБезусловнаяЗадолженность
		|			И НЕ &ПодборВОплатуПоЗаявкам
		|			И ОбъектРасчетов В
		|				(ВЫБРАТЬ
		|					ОбъектыРасчетов.ОбъектРасчетов
		|				ИЗ
		|					ОбъектыРасчетов КАК ОбъектыРасчетов)) КАК РасчетыСКлиентами
		|ГДЕ
		|	РасчетыСКлиентами.ОплачиваетсяОстаток > 0
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеРасчетов.ДатаПлатежа,", ?(ПоДатамПлатежей, "ДанныеРасчетов.ДатаПлатежа,", ""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаПлатежа", ?(ПоДатамПлатежей, "ДанныеРасчетов.ДатаПлатежа", "МИНИМУМ(ДанныеРасчетов.ДатаПлатежа)"));
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Устарела.
Функция ТекстЗапросаПоОстаткамРасчетовСПоставщикамиОфлайн()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
	|	ВЫБОР КОГДА ТаблицаПлатежей.Сумма ЕСТЬ NULL ТОГДА
	|		ЛОЖЬ
	|	ИНАЧЕ
	|		ИСТИНА
	|	КОНЕЦ КАК Выбран,
	|	ЕСТЬNULL(ТаблицаПлатежей.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(ТаблицаПлатежей.ДатаПогашения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПогашения,
	|	ВЫБОР КОГДА &ВалютаДокумента <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		ТОГДА &ВалютаДокумента
	|		ИНАЧЕ ОбъектыРасчетов.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК ВалютаДокумента,
	|
	|	ОбъектыРасчетов.Дата КАК Дата,
	|	ОбъектыРасчетов.Номер КАК Номер,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
	|	"""" КАК ИдентификаторПлатежа,
	|	РасчетыСПоставщиками.Валюта КАК ВалютаВзаиморасчетов,
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ОбъектыРасчетов.Контрагент КАК Контрагент,
	|	ОбъектыРасчетов.Договор КАК Договор,
	|	ОбъектыРасчетов.Объект КАК Объект,
	|	ОбъектыРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОбъектыРасчетов.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(
	|		ЕСТЬNULL(
	|			ДоговорыКонтрагентов.ВариантКурсаДоговора, 
	|			ДоговорыМеждуОрганизациями.ВариантКурсаДоговора), 
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) КАК ВариантКурсаДоговора,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, 
	|			ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|		ТОГДА
	|			ВЫБОР
	|				КОГДА ЕСТЬNULL(ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств,
	|					ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|					ТОГДА &СтатьяДвиженияДенежныхСредств
	|				ИНАЧЕ ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств
	|			КОНЕЦ
	|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|	ЕСТЬNULL(ОбъектыРасчетов.Договор.ПлатежиПо275ФЗ, ЛОЖЬ) КАК ПлатежиПо275ФЗ,
	|	
	|	ВЫБОР КОГДА РасчетыСПоставщиками.СуммаОстаток > 0 ТОГДА
	|		РасчетыСПоставщиками.СуммаОстаток
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК ДолгПартнера,
	|
	|	ВЫБОР КОГДА РасчетыСПоставщиками.ОплачиваетсяОстаток - РасчетыСПоставщиками.КОплатеОстаток > 0
	|		И НЕ &ТолькоБезусловнаяЗадолженность
	|	ТОГДА
	|		РасчетыСПоставщиками.ОплачиваетсяОстаток - РасчетыСПоставщиками.КОплатеОстаток
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК КОплате,
	|
	|	0 КАК Оплачивается,
	|
	|	ВЫБОР КОГДА РасчетыСПоставщиками.СуммаОстаток < 0 ТОГДА
	|		-РасчетыСПоставщиками.СуммаОстаток
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК НашДолг,
	|
	|	ОбъектыРасчетов.ОперацияССамозанятым КАК ОперацияССамозанятым
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(, 
	|		ОбъектРасчетов В (
	|			ВЫБРАТЬ
	|				ОбъектыРасчетов.ОбъектРасчетов
	|			ИЗ
	|				ОбъектыРасчетов КАК ОбъектыРасчетов)
	|	) КАК РасчетыСПоставщиками
	|		
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ОбъектыРасчетов.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыМеждуОрганизациями КАК ДоговорыМеждуОрганизациями
	|		ПО ОбъектыРасчетов.Договор = ДоговорыМеждуОрганизациями.Ссылка
	|	ПО 
	|		РасчетыСПоставщиками.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаПлатежей КАК ТаблицаПлатежей
	|	ПО
	|		РасчетыСПоставщиками.ОбъектРасчетов = ТаблицаПлатежей.ОбъектРасчетов
	|		И (РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Партнер = ТаблицаПлатежей.Партнер
	|			ИЛИ ТаблицаПлатежей.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))
	|		И РасчетыСПоставщиками.Валюта = ТаблицаПлатежей.Валюта
	|
	|ГДЕ
	|	(&ДебиторскаяЗадолженность
	|	И РасчетыСПоставщиками.СуммаОстаток > 0)
	|	ИЛИ 
	|	(Не &ДебиторскаяЗадолженность
	|	И РасчетыСПоставщиками.ОплачиваетсяОстаток - РасчетыСПоставщиками.КОплатеОстаток > 0
	|	И НЕ &ТолькоБезусловнаяЗадолженность
	|	)
	|	ИЛИ 
	|	(Не &ДебиторскаяЗадолженность
	|	И РасчетыСПоставщиками.ОплачиваетсяОстаток - РасчетыСПоставщиками.СуммаОстаток > 0
	|	)
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Дата,
	|	Номер
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Устарела.
Функция ТекстЗапросаПоОстаткамРасчетовСКлиентамиОфлайн()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
	|	ВЫБОР КОГДА ТаблицаПлатежей.Сумма ЕСТЬ NULL ТОГДА
	|		ЛОЖЬ
	|	ИНАЧЕ
	|		ИСТИНА
	|	КОНЕЦ КАК Выбран,
	|	ЕСТЬNULL(ТаблицаПлатежей.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(ТаблицаПлатежей.ДатаПогашения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПогашения,
	|	ВЫБОР КОГДА &ВалютаДокумента <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		ТОГДА &ВалютаДокумента
	|		ИНАЧЕ ОбъектыРасчетов.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК ВалютаДокумента,
	|
	|	ОбъектыРасчетов.Дата КАК Дата,
	|	ОбъектыРасчетов.Номер КАК Номер,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
	|	ОбъектыРасчетов.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	ОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ОбъектыРасчетов.Контрагент КАК Контрагент,
	|	ОбъектыРасчетов.Договор КАК Договор,
	|	ОбъектыРасчетов.Объект КАК Объект,
	|	ОбъектыРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОбъектыРасчетов.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(
	|		ЕСТЬNULL(
	|			ДоговорыКонтрагентов.ВариантКурсаДоговора, 
	|			ДоговорыМеждуОрганизациями.ВариантКурсаДоговора), 
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) КАК ВариантКурсаДоговора,
	|	
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, 
	|			ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|		ТОГДА
	|			ВЫБОР
	|				КОГДА ЕСТЬNULL(ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств,
	|					ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|					ТОГДА &СтатьяДвиженияДенежныхСредств
	|				ИНАЧЕ ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств
	|			КОНЕЦ
	|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|	ВЫБОР КОГДА РасчетыСКлиентами.СуммаОстаток > 0 ТОГДА
	|		РасчетыСКлиентами.СуммаОстаток
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК ДолгПартнера,
	|	
	|	ВЫБОР КОГДА РасчетыСКлиентами.КОплатеОстаток - РасчетыСКлиентами.ОплачиваетсяОстаток > 0
	|		И НЕ &ТолькоБезусловнаяЗадолженность
	|	ТОГДА
	|		РасчетыСКлиентами.КОплатеОстаток - РасчетыСКлиентами.ОплачиваетсяОстаток
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК КОплате,
	|	
	|	0 КАК Оплачивается,
	|
	|	ВЫБОР КОГДА РасчетыСКлиентами.СуммаОстаток < 0 ТОГДА
	|		-РасчетыСКлиентами.СуммаОстаток
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК НашДолг,
	|
	|	ОбъектыРасчетов.ОперацияССамозанятым КАК ОперацияССамозанятым
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(, 
	|		ОбъектРасчетов В (
	|			ВЫБРАТЬ
	|				ОбъектыРасчетов.ОбъектРасчетов
	|			ИЗ
	|				ОбъектыРасчетов КАК ОбъектыРасчетов)
	|	) КАК РасчетыСКлиентами
	|		
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ОбъектыРасчетов.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыМеждуОрганизациями КАК ДоговорыМеждуОрганизациями
	|		ПО ОбъектыРасчетов.Договор = ДоговорыМеждуОрганизациями.Ссылка
	|	ПО 
	|		РасчетыСКлиентами.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаПлатежей КАК ТаблицаПлатежей
	|	ПО
	|		РасчетыСКлиентами.ОбъектРасчетов = ТаблицаПлатежей.ОбъектРасчетов
	|		И (РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Партнер = ТаблицаПлатежей.Партнер
	|			ИЛИ ТаблицаПлатежей.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))
	|		И РасчетыСКлиентами.Валюта = ТаблицаПлатежей.Валюта
	|
	|ГДЕ
	|	НЕ (ОбъектыРасчетов.Объект ССЫЛКА Справочник.ПодарочныеСертификаты)
	|	И ((Не &ДебиторскаяЗадолженность
	|		И РасчетыСКлиентами.СуммаОстаток < 0)
	|		ИЛИ 
	|		(&ДебиторскаяЗадолженность
	|		И РасчетыСКлиентами.КОплатеОстаток - РасчетыСКлиентами.ОплачиваетсяОстаток > 0
	|		И НЕ &ТолькоБезусловнаяЗадолженность
	|		)
	|		ИЛИ 
	|		(&ДебиторскаяЗадолженность
	|		И РасчетыСКлиентами.СуммаОстаток > 0
	|		))
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Дата,
	|	Номер
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Процедура заполняет таблицу остатков расчетов с партнером.
//
// Параметры:
//	Реквизиты - Структура:
//	 * Дата - Дата
//	 * Организация - СправочникСсылка.Организации
//	 * СуммаДокумента - Число
//	 * Валюта - СправочникСсылка.Валюты
//	 * Контрагент - СправочникСсылка.Контрагенты
//	 * Партнер - СправочникСсылка.Партнеры
//	 * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации
//	 * ПартнерПрочиеОтношения - Булево
//	 * УчитыватьФилиалы - Булево
//	 * ПодборДебиторскойЗадолженности - Булево
//	 * ПодборТолькоБезусловнойЗадолженности - Булево
//	 * ПодборВОплатуПоЗаявкам - Булево
//	 * ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами
//	 * ПоДатамПлатежей - Булево
//	АдресПлатежейВХранилище - Строка - Адрес во временном хранилище, в которое помещена табличная часть документа.
//	ТаблицаОстатковРасчетов - ТаблицаЗначений - Таблица с остатками расчетов.
//	ДополнительныеОтборы - Соответствие из КлючИЗначение:
//	 * Ключ - Строка - имя поля
//	 * Значение - Произвольный - значение отбора.
//
Процедура ЗаполнитьТаблицуОстатковРасчетов(Реквизиты, АдресПлатежейВХранилище, ТаблицаОстатковРасчетов, ДополнительныеОтборы = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВалютаДокумента", Реквизиты.Валюта);
	Запрос.УстановитьПараметр("Период", ?(Реквизиты.Дата <> '00010101',Реквизиты.Дата, ТекущаяДатаСеанса()));
	
	УчитыватьФилиалы = ?(Реквизиты.Свойство("УчитыватьФилиалы"), Реквизиты.УчитыватьФилиалы, Истина);
	НоваяАрхитектураВзаиморасчетов = ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
	
	Если УчитыватьФилиалы И ТипЗнч(Реквизиты.Организация) <> Тип("Массив") Тогда
		ГоловнаяОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизиты.Организация,"ГоловнаяОрганизация");
		Если ГоловнаяОрганизация = Реквизиты.Организация Тогда
			ГоловнаяОрганизация = Неопределено;
			ЭтоГоловнаяОрганизация = Истина;
		Иначе
			ЭтоГоловнаяОрганизация = Ложь;
		КонецЕсли;
	Иначе
		ЭтоГоловнаяОрганизация = Ложь;
		ГоловнаяОрганизация = Неопределено;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДебиторскаяЗадолженность", Реквизиты.ПодборДебиторскойЗадолженности);
	Запрос.УстановитьПараметр("ТолькоБезусловнаяЗадолженность", Реквизиты.ПодборТолькоБезусловнойЗадолженности);
	Запрос.УстановитьПараметр("ПодборВОплатуПоЗаявкам", Реквизиты.ПодборВОплатуПоЗаявкам);
	
	Если Реквизиты.Свойство("ХозяйственнаяОперация") Тогда
		СтатьяДвиженияДенежныхСредств =
			Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(
			Реквизиты.ХозяйственнаяОперация);
	Иначе
		СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	КонецЕсли;
	Запрос.УстановитьПараметр("СтатьяДвиженияДенежныхСредств", СтатьяДвиженияДенежныхСредств);
	
	ЗапросОбъектовРасчетов = Новый Запрос;
	ЗапросОбъектовРасчетов.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЗапросОбъектовРасчетов.УстановитьПараметр("Организация", Реквизиты.Организация);
	ЗапросОбъектовРасчетов.УстановитьПараметр("ЭтоГоловнаяОрганизация", ЭтоГоловнаяОрганизация);
	ЗапросОбъектовРасчетов.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	ЗапросОбъектовРасчетов.УстановитьПараметр("ПоВсемКонтрагентам", Не ЗначениеЗаполнено(Реквизиты.Контрагент));
	ЗапросОбъектовРасчетов.УстановитьПараметр("Контрагент", Реквизиты.Контрагент);
	ЗапросОбъектовРасчетов.УстановитьПараметр("ПоВсемПартнерам", Не ЗначениеЗаполнено(Реквизиты.Партнер));
	ЗапросОбъектовРасчетов.УстановитьПараметр("Партнер", Реквизиты.Партнер);
	ЗапросОбъектовРасчетов.УстановитьПараметр("ПартнерПрочиеОтношения", Реквизиты.ПартнерПрочиеОтношения);
	
	ЗапросОбъектовРасчетов.Текст = ТекстЗапросаОбъектовРасчетов();
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗапросОбъектовРасчетов.Выполнить();
	МенеджерВременныхТаблиц = ЗапросОбъектовРасчетов.МенеджерВременныхТаблиц;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	РасшифровкаПлатежа.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасшифровкаПлатежа.Партнер КАК Партнер,
	|	РасшифровкаПлатежа.ВалютаВзаиморасчетов КАК Валюта,
	|	РасшифровкаПлатежа.ДатаПогашения КАК ДатаПогашения,
	|	РасшифровкаПлатежа.Сумма КАК Сумма
	|
	|ПОМЕСТИТЬ ТаблицаПлатежей
	|ИЗ
	|	&РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.ОбъектРасчетов                                   КАК ОбъектРасчетов,
	|	ВалютыИКурсыДокументов.КурсЧислительВалютыВзаиморасчетов         КАК КурсЧислительВалютыВзаиморасчетов,
	|	ВалютыИКурсыДокументов.КурсЗнаменательВалютыВзаиморасчетов       КАК КурсЗнаменательВалютыВзаиморасчетов,
	|	ВалютыИКурсыДокументов.КурсЧислительВалютыУправленческогоУчета   КАК КурсЧислительВалютыУправленческогоУчета,
	|	ВалютыИКурсыДокументов.КурсЗнаменательВалютыУправленческогоУчета КАК КурсЗнаменательВалютыУправленческогоУчета,
	|	ВалютыИКурсыДокументов.КурсЧислительВалютыДокумента              КАК КурсЧислительВалютыДокумента,
	|	ВалютыИКурсыДокументов.КурсЗнаменательВалютыДокумента            КАК КурсЗнаменательВалютыДокумента,
	|	ВалютыИКурсыДокументов.ВалютаДокумента                           КАК ВалютаДокумента,
	|	ВалютыИКурсыДокументов.ВалютаВзаиморасчетов                      КАК ВалютаВзаиморасчетов,
	|	ОтносительныеКурсыВалютСрезПоследних.КурсЧислитель               КАК КурсЧислительПеременный,
	|	ОтносительныеКурсыВалютСрезПоследних.КурсЗнаменатель             КАК КурсЗнаменательПеременный
	|ИЗ
	|	ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВалютыИКурсыДокументов КАК ВалютыИКурсыДокументов
	|		ПО ОбъектыРасчетов.Объект = ВалютыИКурсыДокументов.Документ,
	|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
	|			&Период,
	|			Валюта = &ВалютаДокумента
	|				И БазоваяВалюта В
	|					(ВЫБРАТЬ
	|						Т.ВалютаРегламентированногоУчета
	|					ИЗ
	|						ОбъектыРасчетов КАК Т)) КАК ОтносительныеКурсыВалютСрезПоследних
	|
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ &ТекстЗапросаРасчеты
	|
	|";
	ПоДатамПлатежей = Ложь;
	Если Реквизиты.Свойство("ПоДатамПлатежей") Тогда
		ПоДатамПлатежей = Реквизиты.ПоДатамПлатежей;
	КонецЕсли;
	
	Если Реквизиты.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
		
		Если НоваяАрхитектураВзаиморасчетов Тогда
			
			ЗапросОстатков = Новый Запрос;
			ЗапросОстатков.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			ЗапросОстатков.Текст = ТекстЗапросаОстаткиПоРегистрамРасчетовСКлиентами();
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Реквизиты, "НаДатуВозникновения") Тогда
				
				ЗапросОстатков.Текст = СтрЗаменить(
					ЗапросОстатков.Текст,
					"&ИсключитьПоДатеВозникновения",
					"РасчетыСКлиентамиПоСрокам.ДатаВозникновения > &ДатаВозникновения");
				ЗапросОстатков.Текст = СтрЗаменить(
					ЗапросОстатков.Текст,
					"&ОтборПоДатеВозникновения",
					"ДатаВозникновения <= &ДатаВозникновения");
				ЗапросОстатков.УстановитьПараметр("ДатаВозникновения", Реквизиты.НаДатуВозникновения);
				
			Иначе
				
				ЗапросОстатков.Текст = СтрЗаменить(
					ЗапросОстатков.Текст,
					"&ИсключитьПоДатеВозникновения",
					"РасчетыСКлиентамиПоСрокам.ДатаВозникновения = Неопределено");
				ЗапросОстатков.Текст = СтрЗаменить(ЗапросОстатков.Текст, "И &ОтборПоДатеВозникновения", "");
				
			КонецЕсли;
			
			ЗапросОстатков.УстановитьПараметр("ДебиторскаяЗадолженность", Реквизиты.ПодборДебиторскойЗадолженности);
			ЗапросОстатков.УстановитьПараметр("ТолькоБезусловнаяЗадолженность", Реквизиты.ПодборТолькоБезусловнойЗадолженности);
			ЗапросОстатков.УстановитьПараметр("ПодборВОплатуПоЗаявкам", Реквизиты.ПодборВОплатуПоЗаявкам);
			
			ЗапросОстатков.Выполнить();
			МенеджерВременныхТаблиц = ЗапросОстатков.МенеджерВременныхТаблиц;
			
			ТекстЗапроса = СтрЗаменить(
				ТекстЗапроса,
				"ВЫБРАТЬ &ТекстЗапросаРасчеты",
				ТекстЗапросаПоОстаткамРасчетовСКлиентами(ПоДатамПлатежей));
			
		Иначе
			ТекстЗапроса = СтрЗаменить(
				ТекстЗапроса,
				"ВЫБРАТЬ &ТекстЗапросаРасчеты",
				ТекстЗапросаПоОстаткамРасчетовСКлиентамиОфлайн());
		КонецЕсли;
		
	Иначе
		
		Если НоваяАрхитектураВзаиморасчетов Тогда
			
			ЗапросОстатков = Новый Запрос;
			ЗапросОстатков.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			ЗапросОстатков.Текст = ТекстЗапросаОстаткиПоРегистрамРасчетовСПоставщиками();
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Реквизиты, "НаДатуВозникновения") Тогда
				
				ЗапросОстатков.Текст = СтрЗаменить(
					ЗапросОстатков.Текст,
					"&ИсключитьПоДатеВозникновения",
					"РасчетыСПоставщикамиПоСрокам.ДатаВозникновения > &ДатаВозникновения");
				ЗапросОстатков.Текст = СтрЗаменить(
					ЗапросОстатков.Текст,
					"&ОтборПоДатеВозникновения",
					"ДатаВозникновения <= &ДатаВозникновения");
				ЗапросОстатков.УстановитьПараметр("ДатаВозникновения", Реквизиты.НаДатуВозникновения);
				
			Иначе
				
				ЗапросОстатков.Текст = СтрЗаменить(
					ЗапросОстатков.Текст,
					"&ИсключитьПоДатеВозникновения",
					"РасчетыСПоставщикамиПоСрокам.ДатаВозникновения = Неопределено");
				ЗапросОстатков.Текст = СтрЗаменить(ЗапросОстатков.Текст, "И &ОтборПоДатеВозникновения", "");
				
			КонецЕсли;
			
			ЗапросОстатков.УстановитьПараметр("ДебиторскаяЗадолженность", Реквизиты.ПодборДебиторскойЗадолженности);
			ЗапросОстатков.УстановитьПараметр("ТолькоБезусловнаяЗадолженность", Реквизиты.ПодборТолькоБезусловнойЗадолженности);
			ЗапросОстатков.УстановитьПараметр("ПодборВОплатуПоЗаявкам", Реквизиты.ПодборВОплатуПоЗаявкам);
			
			ЗапросОстатков.Выполнить();
			МенеджерВременныхТаблиц = ЗапросОстатков.МенеджерВременныхТаблиц;
			
			ТекстЗапроса = СтрЗаменить(
				ТекстЗапроса,
				"ВЫБРАТЬ &ТекстЗапросаРасчеты",
				ТекстЗапросаПоОстаткамРасчетовСПоставщиками(ПоДатамПлатежей));
			
		Иначе
			ТекстЗапроса = СтрЗаменить(
				ТекстЗапроса,
				"ВЫБРАТЬ &ТекстЗапросаРасчеты",
				ТекстЗапросаПоОстаткамРасчетовСПоставщикамиОфлайн());
		КонецЕсли;
		
	КонецЕсли;
	
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	
	Если ЗначениеЗаполнено(АдресПлатежейВХранилище) Тогда
		РасшифровкаПлатежа = ПолучитьИзВременногоХранилища(АдресПлатежейВХранилище);
		Если РасшифровкаПлатежа.Колонки.Найти("Партнер") = Неопределено Тогда
			РасшифровкаПлатежа.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
			РасшифровкаПлатежа.ЗаполнитьЗначения(Реквизиты.Партнер, "Партнер");
			Если РасшифровкаПлатежа.Колонки.Найти("Поставщик") <> Неопределено Тогда
				Для Каждого СтрокаТаблицы Из РасшифровкаПлатежа Цикл
					СтрокаТаблицы.Партнер = СтрокаТаблицы.Поставщик;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		Если РасшифровкаПлатежа.Колонки.Найти("ДатаПогашения") = Неопределено Тогда
			РасшифровкаПлатежа.Колонки.Добавить("ДатаПогашения", Новый ОписаниеТипов("Дата"));
		КонецЕсли;
		Если РасшифровкаПлатежа.Колонки.Найти("СуммаВзаиморасчетов") = Неопределено Тогда
			РасшифровкаПлатежа.Колонки.Добавить("СуммаВзаиморасчетов", Новый ОписаниеТипов("Число"));
			Для Каждого СтрокаТаблицы Из РасшифровкаПлатежа Цикл
				СтрокаТаблицы.СуммаВзаиморасчетов = СтрокаТаблицы.Сумма;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Если ТаблицаОстатковРасчетов = Неопределено Тогда
			РасшифровкаПлатежа = Новый ТаблицаЗначений;
			РасшифровкаПлатежа.Колонки.Добавить("ОбъектРасчетов", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
			РасшифровкаПлатежа.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
			РасшифровкаПлатежа.Колонки.Добавить("ВалютаВзаиморасчетов", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
			РасшифровкаПлатежа.Колонки.Добавить("ДатаПогашения", Новый ОписаниеТипов("Дата"));
			РасшифровкаПлатежа.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
			РасшифровкаПлатежа.Колонки.Добавить("СуммаВзаиморасчетов", Новый ОписаниеТипов("Число"));
		Иначе
			РасшифровкаПлатежа = ТаблицаОстатковРасчетов.Выгрузить(,).СкопироватьКолонки();
		КонецЕсли;
	КонецЕсли;
	РасшифровкаПлатежа.Свернуть("ОбъектРасчетов, Партнер, ВалютаВзаиморасчетов, ДатаПогашения", "Сумма, СуммаВзаиморасчетов");
	
	Если РасшифровкаПлатежа.Количество() = 1 И Не ЗначениеЗаполнено(РасшифровкаПлатежа[0].ОбъектРасчетов) Тогда
		РасшифровкаПлатежа.Очистить();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("РасшифровкаПлатежа", РасшифровкаПлатежа);
	
	Если ДополнительныеОтборы <> Неопределено Тогда
		
		СхемаЗапросаОстатков = Новый СхемаЗапроса;
		СхемаЗапросаОстатков.УстановитьТекстЗапроса(Запрос.Текст);
		Оператор = СхемаЗапросаОстатков.ПакетЗапросов[2].Операторы[0];
		
		сч = 0;
		Для Каждого КлючИЗначение Из ДополнительныеОтборы Цикл
			Если ТипЗнч(КлючИЗначение.Значение) = Тип("Массив") Тогда
				Отбор = СтрШаблон("ЕСТЬNULL(ОбъектыРасчетов.%1, Неопределено) В (&Параметр%2)", КлючИЗначение.Ключ, Строка(сч));
			Иначе
				Отбор = "ЕСТЬNULL(ОбъектыРасчетов."+КлючИЗначение.Ключ+", Неопределено) = &Параметр"+Строка(сч);
			КонецЕсли;
			Запрос.УстановитьПараметр("Параметр"+Строка(сч), КлючИЗначение.Значение);
			Оператор.Отбор.Добавить(Отбор);
			сч= сч + 1;
		КонецЦикла;
		
		Запрос.Текст = СхемаЗапросаОстатков.ПолучитьТекстЗапроса();
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаОстатковРасчетовПредварительно = РезультатЗапроса[2].Выгрузить();
	
	Если НоваяАрхитектураВзаиморасчетов Тогда
		ТаблицаОстатковРасчетовПредварительно.Индексы.Добавить("ОбъектРасчетов, Партнер, ВалютаВзаиморасчетов");
		СтруктураОтбора = Новый Структура("ОбъектРасчетов, Партнер, ВалютаВзаиморасчетов");
		Если Не Реквизиты.ПодборТолькоБезусловнойЗадолженности
			И Не Реквизиты.ПодборВОплатуПоЗаявкам Тогда
			// Распределим Оплачивается. Так как в движениях по расчетам Оплачивается записывается без указания 
			// реквизита ДатаПлатежа - в запросе это сделать невозможно 
			ОстаткиОплачивается = РезультатЗапроса[3].Выгрузить();
			Для Каждого ОстатокОплачивается Из ОстаткиОплачивается Цикл
				ЗаполнитьЗначенияСвойств(СтруктураОтбора, ОстатокОплачивается);
				СтрокиОстатков = ОбщегоНазначенияУТ.НайтиСтрокиССохранениемПорядка(ТаблицаОстатковРасчетовПредварительно, СтруктураОтбора);
				Для Каждого СтрокаОстатка Из СтрокиОстатков Цикл
					Если ОстатокОплачивается.Сумма <= 0 Тогда
						Прервать;
					Иначе
						СуммаРаспределено = Мин(ОстатокОплачивается.Сумма, СтрокаОстатка.КОплате);
						СтрокаОстатка.Оплачивается = СуммаРаспределено;
						ОстатокОплачивается.Сумма = ОстатокОплачивается.Сумма - СуммаРаспределено;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		// Отметим Объекты расчетов которые уже есть в расшифровке платежа. 
		// Так как в расшифровке нет поля ДатаПлатежа - в запросе это сделать невозможно
		Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаРасшифровки);
			СтрокиОстатков = ОбщегоНазначенияУТ.НайтиСтрокиССохранениемПорядка(ТаблицаОстатковРасчетовПредварительно, СтруктураОтбора);
			ОстатокСуммыВзаиморасчетов = СтрокаРасшифровки.СуммаВзаиморасчетов;
			Если ОстатокСуммыВзаиморасчетов = 0 Тогда
				Если СтрокаРасшифровки.ВалютаВзаиморасчетов = Реквизиты.Валюта Тогда
					ОстатокСуммыВзаиморасчетов = СтрокаРасшифровки.Сумма;
				Иначе
					ОстатокСуммыВзаиморасчетов = РаботаСКурсамиВалютУТ.ПересчитатьВВалюту(
						СтрокаРасшифровки.Сумма,
						Справочники.Валюты.ПустаяСсылка(),
						Реквизиты.Валюта,
						СтрокаРасшифровки.ВалютаВзаиморасчетов,
						Реквизиты.Дата,
						СтрокаРасшифровки.ОбъектРасчетов);
				КонецЕсли;
			КонецЕсли;
			СуммыВзаиморасчетов = Новый Массив;
			Для Каждого СтрокаОстатка Из СтрокиОстатков Цикл
				ТекущаяСуммаВзаиморасчетов = 0;
				Если СтрокаОстатка.ДолгПартнера <> 0 И Реквизиты.ПодборДебиторскойЗадолженности Тогда
					ТекущаяСуммаВзаиморасчетов = Мин(СтрокаОстатка.ДолгПартнера, СтрокаОстатка.КОплате - СтрокаОстатка.Оплачивается, ОстатокСуммыВзаиморасчетов);
					СуммыВзаиморасчетов.Добавить(ТекущаяСуммаВзаиморасчетов);
				ИначеЕсли СтрокаОстатка.НашДолг <> 0  И НЕ Реквизиты.ПодборДебиторскойЗадолженности Тогда
					ТекущаяСуммаВзаиморасчетов = Мин(СтрокаОстатка.НашДолг,СтрокаОстатка.КОплате - СтрокаОстатка.Оплачивается, ОстатокСуммыВзаиморасчетов);
					СуммыВзаиморасчетов.Добавить(ТекущаяСуммаВзаиморасчетов);
				ИначеЕсли СтрокаОстатка.КОплате <> 0 Тогда
					ТекущаяСуммаВзаиморасчетов = Мин(СтрокаОстатка.КОплате - СтрокаОстатка.Оплачивается, ОстатокСуммыВзаиморасчетов);
					СуммыВзаиморасчетов.Добавить(ТекущаяСуммаВзаиморасчетов);
				КонецЕсли;
				ОстатокСуммыВзаиморасчетов = ОстатокСуммыВзаиморасчетов - ТекущаяСуммаВзаиморасчетов;
			КонецЦикла;
			РаспределеннаяСумма = ОбщегоНазначенияУТКлиентСервер.РаспределитьПропорционально(СтрокаРасшифровки.Сумма, СуммыВзаиморасчетов);
			Если РаспределеннаяСумма <> Неопределено Тогда
				Для Счетчик = 0 По СтрокиОстатков.Количество() - 1 Цикл
					СтрокиОстатков[Счетчик].Сумма = РаспределеннаяСумма[Счетчик];
					Если РаспределеннаяСумма[Счетчик] > 0 Тогда
						СтрокиОстатков[Счетчик].ДатаПогашения = СтрокаРасшифровки.ДатаПогашения;
						СтрокиОстатков[Счетчик].Выбран = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТаблицаОстатковРасчетов = Неопределено Тогда
		ТаблицаОстатковРасчетов = ТаблицаОстатковРасчетовПредварительно;
	Иначе
		ТаблицаОстатковРасчетов.Загрузить(ТаблицаОстатковРасчетовПредварительно);
	КонецЕсли;
	
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		СуммаКРаспределению = Реквизиты.СуммаДокумента;
	Иначе
		СуммаКРаспределению = 0;
	КонецЕсли;
	
	СоответствиеКурсовВалют = Новый Соответствие;
	
	ВыборкаФиксКурса = РезультатЗапроса[1].Выбрать();
	ВалютаУправленческогоУчета = ЗначениеНастроекПовтИсп.ВалютаУправленческогоУчета();
	Пока ВыборкаФиксКурса.Следующий() Цикл
		Если Реквизиты.Валюта = ВыборкаФиксКурса.ВалютаВзаиморасчетов Тогда
			КоэффициентПересчета = 1;
		ИначеЕсли Реквизиты.Валюта = ВыборкаФиксКурса.ВалютаДокумента Тогда
			КоэффициентПересчета = ВыборкаФиксКурса.КурсЧислительВалютыВзаиморасчетов * ВыборкаФиксКурса.КурсЗнаменательВалютыДокумента 
			                       / (ВыборкаФиксКурса.КурсЗнаменательВалютыВзаиморасчетов * ВыборкаФиксКурса.КурсЧислительВалютыДокумента)
		ИначеЕсли Реквизиты.Валюта = ВалютаУправленческогоУчета Тогда
			КоэффициентПересчета = ВыборкаФиксКурса.КурсЧислительВалютыВзаиморасчетов * ВыборкаФиксКурса.КурсЗнаменательВалютыУправленческогоУчета 
			                       / (ВыборкаФиксКурса.КурсЗнаменательВалютыВзаиморасчетов * ВыборкаФиксКурса.КурсЧислительВалютыУправленческогоУчета)
		Иначе
			КоэффициентПересчета = ВыборкаФиксКурса.КурсЧислительВалютыВзаиморасчетов * ВыборкаФиксКурса.КурсЗнаменательПеременный 
			                       / (ВыборкаФиксКурса.КурсЗнаменательВалютыВзаиморасчетов * ВыборкаФиксКурса.КурсЧислительПеременный)
		КонецЕсли;
		СоответствиеКурсовВалют.Вставить(ВыборкаФиксКурса.ОбъектРасчетов, КоэффициентПересчета);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ТаблицаОстатковРасчетов Цикл
		
		Если Не СтрокаТаблицы.Выбран Тогда
				
			Если СтрокаТаблицы.ДолгПартнера <> 0 И Реквизиты.ПодборДебиторскойЗадолженности Тогда
				Если Реквизиты.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
					СтрокаТаблицы.Сумма = Мин(СтрокаТаблицы.ДолгПартнера, СтрокаТаблицы.КОплате - СтрокаТаблицы.Оплачивается);
				Иначе
					СтрокаТаблицы.Сумма = СтрокаТаблицы.ДолгПартнера;
				КонецЕсли;
			ИначеЕсли СтрокаТаблицы.НашДолг <> 0  И НЕ Реквизиты.ПодборДебиторскойЗадолженности Тогда
				Если Реквизиты.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
					СтрокаТаблицы.Сумма = СтрокаТаблицы.НашДолг;
				Иначе
					СтрокаТаблицы.Сумма = Мин(СтрокаТаблицы.НашДолг,СтрокаТаблицы.КОплате - СтрокаТаблицы.Оплачивается);
				КонецЕсли;
			ИначеЕсли СтрокаТаблицы.КОплате <> 0 Тогда
				СтрокаТаблицы.Сумма = СтрокаТаблицы.КОплате - СтрокаТаблицы.Оплачивается;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Реквизиты.Валюта) И Реквизиты.Валюта <> СтрокаТаблицы.ВалютаВзаиморасчетов Тогда
				
				Если СтрокаТаблицы.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.УстановленныйВДоговоре Тогда
					Коэффициент = СоответствиеКурсовВалют.Получить(СтрокаТаблицы.Договор);
				ИначеЕсли СтрокаТаблицы.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки Тогда
					Коэффициент = СоответствиеКурсовВалют.Получить(СтрокаТаблицы.ОбъектРасчетов);
				Иначе
					Коэффициент = СоответствиеКурсовВалют.Получить(СтрокаТаблицы.ВалютаВзаиморасчетов);
				КонецЕсли;
				Если Коэффициент = Неопределено Тогда
					ПараметрыКурса = РаботаСКурсамиВалютУТ.ПараметрыВариантаКурсаДоговора();
					ЗаполнитьЗначенияСвойств(ПараметрыКурса, СтрокаТаблицы);
					Коэффициент = РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(
					              	СтрокаТаблицы.ВалютаВзаиморасчетов,
					              	Реквизиты.Валюта,
					              	?(Реквизиты.Дата <> '00010101',Реквизиты.Дата, ТекущаяДатаСеанса()),
					              	ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(СтрокаТаблицы.Организация),
					              	ПараметрыКурса);
					Если СтрокаТаблицы.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.УстановленныйВДоговоре Тогда
						СоответствиеКурсовВалют.Вставить(СтрокаТаблицы.Договор, Коэффициент);
					ИначеЕсли СтрокаТаблицы.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки Тогда
						СоответствиеКурсовВалют.Вставить(СтрокаТаблицы.ОбъектРасчетов, Коэффициент);
					Иначе
						СоответствиеКурсовВалют.Вставить(СтрокаТаблицы.ВалютаВзаиморасчетов, Коэффициент);
					КонецЕсли;
				КонецЕсли;
				
				СтрокаТаблицы.Сумма = СтрокаТаблицы.Сумма * Коэффициент;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СуммаКРаспределению > 0 
			И СтрокаТаблицы.Сумма - СтрокаТаблицы.Оплачивается > 0 Тогда
			
			СтрокаТаблицы.Выбран = Истина;
			Если СтрокаТаблицы.Оплачивается > 0 Тогда
				СтрокаТаблицы.Сумма = СтрокаТаблицы.Сумма - СтрокаТаблицы.Оплачивается;
			КонецЕсли;
			Если СтрокаТаблицы.Сумма > СуммаКРаспределению Тогда
				СтрокаТаблицы.Сумма = СуммаКРаспределению;
			КонецЕсли;
			СуммаКРаспределению = СуммаКРаспределению - СтрокаТаблицы.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Устарела. Функция формирует массив допустимых хозяйственных операций договора с контрагентом.
//
// Параметры:
//	ОперацияДокумента - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
//
// Возвращаемое значение:
//	Массив из ПеречислениеСсылка.ХозяйственныеОперации - Массив хозяйственных операций.
//
Функция ХозяйственнаяОперацияДоговора(ОперацияДокумента) Экспорт
	
	ХозяйственнаяОперацияДоговора = Новый Массив;
	Если ОперацияДокумента = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента
	 ИЛИ ОперацияДокумента = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
		
		ХозяйственнаяОперацияДоговора.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
		ХозяйственнаяОперацияДоговора.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
		
	ИначеЕсли ОперацияДокумента = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
	 ИЛИ ОперацияДокумента = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика Тогда
		
		ХозяйственнаяОперацияДоговора.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
		ХозяйственнаяОперацияДоговора.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
		ХозяйственнаяОперацияДоговора.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
		ХозяйственнаяОперацияДоговора.Добавить(Перечисления.ХозяйственныеОперации.ПриемНаКомиссию);
		
	КонецЕсли;
	
	Возврат ХозяйственнаяОперацияДоговора;
	
КонецФункции

// Устарела. Заполняет поля:
//	ПорядокОперации - используется для поиска движений до и после изменяемого документа, для сортировки документов к зачету оплат и накладных.
//	ПорядокЗачетаПоДатеПлатежа - используется для поиска движений до и после изменяемого документа при зачете документов по дате платежа.
// Параметры:
//  ТаблицаРасчеты - ТаблицаЗначений - таблица движений по регистру расчетов с обязательными колонками:
//   * АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам,
//   * Период - Дата,
//   * ДатаРегистратора - Дата,
//   * НомерРегистратора - Строка,
//   * Вид - Число
//  ТипДокумента - Тип - Тип документа регистратора
//  ПорядкиЗачетаОплатНакладныхДоговоров - Соответствие Из КлючИЗначение -где:
// 		* Ключ - СправочникСсылка.ДоговорыКонтрагентов,СправочникСсылка.ДоговорыМеждуОрганизациями - объект расчетов, для которого получены данные.
// 		* Значение - ПеречислениеСсылка.ПорядкиЗачетаОплатНакладных
Процедура ДобавитьЗаполнитьПорядокОперации(ТаблицаРасчеты, ТипДокумента, ПорядкиЗачетаОплатНакладныхДоговоров = Неопределено) Экспорт
	
	ВзаиморасчетыПроведение.ДобавитьЗаполнитьПорядокОперации(ТаблицаРасчеты, ТипДокумента, ПорядкиЗачетаОплатНакладныхДоговоров);
	
КонецПроцедуры

// Устарела.
Функция ТестЗапросаРаспределениеРасчетовСКлиентами()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Месяц КАК Месяц,
	|	Таблица.АналитикаУчетаПоПартнерам    КАК АналитикаУчетаПоПартнерам,
	|	Таблица.ОбъектРасчетов               КАК ОбъектРасчетов,
	|	ВЫБОР КОГДА &НовыеРасчеты
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Таблица.Документ
	|	КОНЕЦ								 КАК Документ,
	|	Таблица.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.ОперацииЗакрытияМесяца.ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов) КАК Операция
	|ИЗ РасчетыСКлиентамиИзменения КАК Таблица
	|ГДЕ
	|	Таблица.Сумма <> 0 ИЛИ Таблица.СуммаРегл <> 0 ИЛИ Таблица.СуммаУпр <> 0
	|";
	Возврат ТекстЗапроса
КонецФункции

// Устарела.
Функция ТестЗапросаРаспределениеРасчетовСПоставщиками()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Месяц КАК Месяц,
	|	Таблица.АналитикаУчетаПоПартнерам    КАК АналитикаУчетаПоПартнерам,
	|	Таблица.ОбъектРасчетов               КАК ОбъектРасчетов,
	|	ВЫБОР КОГДА &НовыеРасчеты
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Таблица.Документ
	|	КОНЕЦ								 КАК Документ,
	|	Таблица.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.ОперацииЗакрытияМесяца.ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов) КАК Операция
	|ИЗ РасчетыСПоставщикамиИзменения КАК Таблица
	|ГДЕ
	|	Таблица.Сумма <> 0 ИЛИ Таблица.СуммаРегл <> 0 ИЛИ Таблица.СуммаУпр <> 0
	|";
	Возврат ТекстЗапроса
КонецФункции

// Устарела.
Процедура ПроверитьЗаполнитьАналитикуУчетаПоПартнерам(ТаблицаДвижений) Экспорт
	
	ВзаиморасчетыПроведение.ПроверитьЗаполнитьАналитикуУчетаПоПартнерам(ТаблицаДвижений);
	
КонецПроцедуры

Процедура ВывестиПредупреждениеОбОбновлении(Макет) Экспорт
	
	Если НЕ ОбновлениеИнформационнойБазы.ОтложенноеОбновлениеЗавершено() Тогда
		
		ТаблицаПредупреждение = Новый ТабличныйДокумент;
		ОбластьПредупреждение = ТаблицаПредупреждение.Область(1,1,1,1);
		
		ТекстПредупреждения = НСтр("ru = 'Не завершено отложенное обновление информационной базы, данные в отчетах могут быть некорректными.'");
		ОбластьПредупреждение.Текст = ТекстПредупреждения;
		ОбластьПредупреждение.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
		
		Макет.ВставитьОбласть(ТаблицаПредупреждение.Область(1,1,1,1), Макет.Область(1,1,1,1), ТипСмещенияТабличногоДокумента.ПоВертикали);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиПредупреждениеОЗавершенииПоддержкиОфлайнРасчетов(Макет) Экспорт
	
	Если Константы.НоваяАрхитектураВзаиморасчетов.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПредупреждение = Новый ТабличныйДокумент;
	ОбластьПредупреждение = ТаблицаПредупреждение.Область(1,1,1,1);
	
	МассивСтрок = Новый Массив;
	Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
		ТекстПредупреждения = НСтр("ru = 'Внимание! Данный отчет больше не поддерживается и может содержать ошибки.
		|Необходимо выполнить переход на режим учета взаиморасчетов «онлайн». Обратитесь к администратору системы.'");
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Внимание! Данный отчет больше не поддерживается и может содержать ошибки. 
		|Необходимо выполнить переход на режим учета взаиморасчетов «онлайн».'");
	КонецЕсли;
	МассивСтрок.Добавить(ТекстПредупреждения);
	
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(НСтр("ru = 'Подробнее можно ознакомиться'") + " ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("здесь",,,,"https://its.1c.ru/lector/21056822"));
	МассивСтрок.Добавить(".");
	
	ОбластьПредупреждение.Текст = Новый ФорматированнаяСтрока(МассивСтрок);
	ОбластьПредупреждение.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
	Макет.ВставитьОбласть(ТаблицаПредупреждение.Область(1,1,1,1), Макет.Область(1,1,1,1), ТипСмещенияТабличногоДокумента.ПоВертикали);
	
КонецПроцедуры

// Соответствие объектов расчетов и курса валюта договора.
// 
// Параметры:
//  ОбъектыРасчетов - Массив из СправочникСсылка.ОбъектыРасчетов - Объекты расчетов для получения данных.
// 
// Возвращаемое значение:
// 	Соответствие Из КлючИЗначение - Содержит тексты запросов сторнирования, где:
// 		* Ключ - СправочникСсылка.ОбъектыРасчетов - объект расчетов, для которого получены данные.
// 		* Значение - Структура:
//      ** ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов данного объекта расчетов
//      ** ВариантКурсаДоговора - ПеречислениеСсылка.ВариантыКурсаДоговора - вариант курса договора для определения источника курса
//      ** ТипОбъектаРасчетов - ПеречислениеСсылка.ТипыОбъектовРасчетов - тип объекта расчетов 
//
Функция СоответствиеОбъектовРасчетовИПараметровДоговора(ОбъектыРасчетов) Экспорт 
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектыРасчетов", ОбъектыРасчетов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
	|	ЕСТЬNULL(ОбъектыРасчетов.Договор.ВариантКурсаДоговора, ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) КАК ВариантКурсаДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.РазрешенаРаботаСДочернимиПартнерами, ЛОЖЬ) КАК РазрешенаРаботаСДочернимиПартнерами,
	|	ОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ОбъектыРасчетов.Объект КАК Объект,
	|	ОбъектыРасчетов.ТипОбъектаРасчетов КАК ТипОбъектаРасчетов
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ОбъектыРасчетов.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ОбъектыРасчетов.Ссылка В(&ОбъектыРасчетов)";
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	Пока Выборка.Следующий() Цикл
		СтруктураВариантаКурсаВалюты = Новый Структура("ВалютаВзаиморасчетов, ВариантКурсаДоговора, ТипОбъектаРасчетов");
		СтруктураВариантаКурсаВалюты.Вставить("РазрешенаРаботаСДочернимиПартнерами");
		СтруктураВариантаКурсаВалюты.Вставить("Объект");
		ЗаполнитьЗначенияСвойств(СтруктураВариантаКурсаВалюты, Выборка);
		Результат[Выборка.ОбъектРасчетов] = СтруктураВариантаКурсаВалюты;
	КонецЦикла;
	Если ОбъектыРасчетов.Найти(Справочники.ОбъектыРасчетов.ПустаяСсылка()) <> Неопределено Тогда
		СтруктураВариантаКурсаВалюты = Новый Структура(
			"ВалютаВзаиморасчетов, ВариантКурсаДоговора, ТипОбъектаРасчетов, Объект, РазрешенаРаботаСДочернимиПартнерами",
			Справочники.Валюты.ПустаяСсылка(),
			Перечисления.ВариантыКурсаДоговора.Переменный,
			Перечисления.ТипыОбъектовРасчетов.ПустаяСсылка(),
			Неопределено,
			Ложь);
		Результат[Справочники.ОбъектыРасчетов.ПустаяСсылка()] = СтруктураВариантаКурсаВалюты;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьКурсыИВалютыДокумента(Объект, МассивПараметров, Отказ)
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		Если СтруктураПараметров.ЭтоПродажаЗакупка И СтруктураПараметров.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки Тогда
			
			Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
			ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
			ВалютаУправленческогоУчета = ЗначениеНастроекПовтИсп.ВалютаУправленческогоУчета();
			
			ВалютыДляЗапросаКурсов = Новый Массив;
			
			ДатаКурса = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
			Если ЗначениеЗаполнено(СтруктураПараметров.ДатаКурсаВалютыДокумента) 
				И ЗначениеЗаполнено(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаКурсаВалютыДокумента)) Тогда
				ДатаКурса = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаКурсаВалютыДокумента);
			ИначеЕсли СтруктураПараметров.ЕстьДатаПереходаПраваСобственности
				И ЗначениеЗаполнено(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаПереходаПраваСобственности)) Тогда
				ДатаКурса = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаПереходаПраваСобственности);
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Истина);
			МенеджерЗаписи = РегистрыСведений.ВалютыИКурсыДокументов.СоздатьМенеджерЗаписи();
			Если СтруктураПараметров.Свойство("СсылкаНового") Тогда
				МенеджерЗаписи.Документ                   = СтруктураПараметров.СсылкаНового;
			Иначе
				МенеджерЗаписи.Документ                   = Объект.Ссылка;
			КонецЕсли;
			МенеджерЗаписи.ВалютаВзаиморасчетов           = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаВзаиморасчетов);
			МенеджерЗаписи.ВалютаДокумента                = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаДокумента);
			МенеджерЗаписи.ВалютаРегламентированногоУчета = ВалютаРегламентированногоУчета;
			
			Если МенеджерЗаписи.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
				МенеджерЗаписи.КурсЧислительВалютыВзаиморасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.КурсЧислитель);
				МенеджерЗаписи.КурсЗнаменательВалютыВзаиморасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.КурсЗнаменатель);
				МенеджерЗаписи.КурсЧислительВалютыДокумента = 1;
				МенеджерЗаписи.КурсЗнаменательВалютыДокумента = 1;
			ИначеЕсли МенеджерЗаписи.ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета Тогда
				МенеджерЗаписи.КурсЧислительВалютыВзаиморасчетов = 1;
				МенеджерЗаписи.КурсЗнаменательВалютыВзаиморасчетов = 1;
				МенеджерЗаписи.КурсЧислительВалютыДокумента = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.КурсЧислитель);
				МенеджерЗаписи.КурсЗнаменательВалютыДокумента = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.КурсЗнаменатель);
			Иначе
				ВалютыДляЗапросаКурсов.Добавить(МенеджерЗаписи.ВалютаДокумента);
				ВалютыДляЗапросаКурсов.Добавить(МенеджерЗаписи.ВалютаВзаиморасчетов);
			КонецЕсли;
			
			Если ВалютаУправленческогоУчета = МенеджерЗаписи.ВалютаДокумента Тогда
				МенеджерЗаписи.КурсЧислительВалютыУправленческогоУчета = МенеджерЗаписи.КурсЧислительВалютыДокумента;
				МенеджерЗаписи.КурсЗнаменательВалютыУправленческогоУчета = МенеджерЗаписи.КурсЗнаменательВалютыДокумента;
			ИначеЕсли ВалютаУправленческогоУчета = МенеджерЗаписи.ВалютаВзаиморасчетов Тогда
				МенеджерЗаписи.КурсЧислительВалютыУправленческогоУчета = МенеджерЗаписи.КурсЧислительВалютыВзаиморасчетов;
				МенеджерЗаписи.КурсЗнаменательВалютыУправленческогоУчета = МенеджерЗаписи.КурсЗнаменательВалютыВзаиморасчетов;
			Иначе
				ВалютыДляЗапросаКурсов.Добавить(ВалютаУправленческогоУчета);
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("МассивВалют", ВалютыДляЗапросаКурсов);
			Запрос.УстановитьПараметр("БазоваяВалюта", ВалютаРегламентированногоУчета);
			Запрос.УстановитьПараметр("Период", ДатаКурса);
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОтносительныеКурсыВалютСрезПоследних.Валюта КАК Валюта,
				|	ОтносительныеКурсыВалютСрезПоследних.КурсЧислитель КАК КурсЧислитель,
				|	ОтносительныеКурсыВалютСрезПоследних.КурсЗнаменатель КАК КурсЗнаменатель
				|ИЗ
				|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
				|			&Период,
				|			БазоваяВалюта = &БазоваяВалюта
				|				И Валюта В (&МассивВалют)) КАК ОтносительныеКурсыВалютСрезПоследних";
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.Валюта = ВалютаУправленческогоУчета Тогда
					МенеджерЗаписи.КурсЧислительВалютыУправленческогоУчета = Выборка.КурсЧислитель;
					МенеджерЗаписи.КурсЗнаменательВалютыУправленческогоУчета = Выборка.КурсЗнаменатель;
				КонецЕсли;
				Если Выборка.Валюта = МенеджерЗаписи.ВалютаВзаиморасчетов Тогда
					МенеджерЗаписи.КурсЧислительВалютыВзаиморасчетов = Выборка.КурсЧислитель;
					МенеджерЗаписи.КурсЗнаменательВалютыВзаиморасчетов = Выборка.КурсЗнаменатель;
				КонецЕсли;
				Если Выборка.Валюта = МенеджерЗаписи.ВалютаДокумента Тогда
					МенеджерЗаписи.КурсЧислительВалютыДокумента = Выборка.КурсЧислитель;
					МенеджерЗаписи.КурсЗнаменательВалютыДокумента = Выборка.КурсЗнаменатель;
				КонецЕсли;
			КонецЦикла;
			
			МенеджерЗаписи.Записать(Истина);
			УстановитьПривилегированныйРежим(Ложь);
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Устарела. 
// Параметры:
//  Объект - СправочникОбъект.ДоговорыКонтрагентов, СправочникОбъект.ДоговорыМеждуОрганизациями - Объект для проверки заполнения
Процедура ПроверитьЗаполнитьВариантКурсаВалютыДоговора(Объект) Экспорт
	Если Не ЗначениеЗаполнено(Объект.ВариантКурсаДоговора) Тогда
		Объект.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.Переменный;
	КонецЕсли;
КонецПроцедуры

// Устарела. Находит Объекты расчетов накладных и заказа по ссылке на заказ
// 
// Параметры:
//  ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов накладная
//  ЭтоРасчетыСКлиентом - Булево - В каких расчетах искать
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ОбъектыРасчетов - Найденные объекты расчетов заказы
Функция ОбъектыРасчетовЗаказыПоНакладной(ОбъектРасчетов, ЭтоРасчетыСКлиентом) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектРасчетов", ОбъектРасчетов);
	Если ЭтоРасчетыСКлиентом Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетовЗаказ
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
			|		ПО РасчетыСКлиентами.ПродажаПоЗаказу = ОбъектыРасчетов.Объект
			|			И НЕ ОбъектыРасчетов.ПометкаУдаления
			|ГДЕ
			|	РасчетыСКлиентами.ОбъектРасчетов В (&ОбъектРасчетов)
			|	И РасчетыСКлиентами.Активность";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетовЗаказ
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
			|		ПО РасчетыСПоставщиками.ЗакупкаПоЗаказу = ОбъектыРасчетов.Объект
			|			И НЕ ОбъектыРасчетов.ПометкаУдаления
			|ГДЕ
			|	РасчетыСПоставщиками.ОбъектРасчетов В (&ОбъектРасчетов)
			|	И РасчетыСПоставщиками.Активность";
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ОбъектРасчетовЗаказ) Тогда
			Результат.Добавить(Выборка.ОбъектРасчетовЗаказ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Находит Объекты расчетов для отображения в отчете по переданным документам
// 
// Параметры:
//  ПараметрОтчета - ДокументСсылка, Массив из ДокументСсылка - Документ, из которого открывается контекстный отчет
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ОбъектыРасчетов, СправочникСсылка.ОбъектыРасчетов - Найденные объекты расчетов
Функция ПолучитьОбъектыРасчетовДляОтбораОтчета(ПараметрОтчета) Экспорт
	
	Результат = Справочники.ОбъектыРасчетов.ПустаяСсылка();
	
	Если ТипЗнч(ПараметрОтчета) = Тип("Массив") Тогда
		Если ПараметрОтчета.Количество() > 0 Тогда
			ПервыйЭлемент = ПараметрОтчета[0];
		Иначе
			Возврат Результат;
		КонецЕсли;
	Иначе
		ПервыйЭлемент = ПараметрОтчета;
	КонецЕсли;
	
	МетаданныеПоСсылке = ПервыйЭлемент.Метаданные();
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПервыйЭлемент);
	ПараметрыВзаиморасчеты = Менеджер.ПараметрыВзаиморасчеты();
	
	Если ТипЗнч(ПараметрыВзаиморасчеты) = Тип("Массив") Тогда
		МассивПараметров = ПараметрыВзаиморасчеты;
	Иначе
		МассивПараметров = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыВзаиморасчеты);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПараметрОтчета);
	
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		Если ЗначениеЗаполнено(СтруктураПараметров.ОбъектРасчетов) Тогда
			
			// Сформируем запрос по получению ОбъектаРасчетов и Порядка расчетов во временную таблицу
			ЧастиПути = СтрРазделить(СтруктураПараметров.ОбъектРасчетов, ".");
			Если ЧастиПути.Количество() = 2 Тогда
				ТекстЗапросаОбъектаРасчетов = "
					|ВЫБРАТЬ
					|	Таблица.Ссылка КАК Ссылка,
					|	Таблица.ИмяРеквизита КАК ОбъектРасчетов,
					|	&ПорядокРасчетов КАК ПорядокРасчетов
					|ПОМЕСТИТЬ ВтОбъектРасчетов
					|ИЗ
					|	&Таблица КАК Таблица
					|ГДЕ
					|	Таблица.Ссылка В (&Ссылка)";
				ТекстЗапросаОбъектаРасчетов = СтрЗаменить(ТекстЗапросаОбъектаРасчетов, "&Таблица", МетаданныеПоСсылке.ПолноеИмя());
				ТекстЗапросаОбъектаРасчетов = СтрЗаменить(ТекстЗапросаОбъектаРасчетов, "ИмяРеквизита", ЧастиПути[1]);
				ЗапросКТЧ = Ложь;
			Иначе
				ТекстЗапросаОбъектаРасчетов = "
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ТабличнаяЧасть.Ссылка КАК Ссылка,
					|	ТабличнаяЧасть.ИмяРеквизита КАК ОбъектРасчетов,
					|	&ПорядокРасчетов КАК ПорядокРасчетов
					|ПОМЕСТИТЬ ВтОбъектРасчетов
					|ИЗ
					|	&ТабличнаяЧасть КАК ТабличнаяЧасть
					|ГДЕ
					|	ТабличнаяЧасть.Ссылка В (&Ссылка)";
				ТекстЗапросаОбъектаРасчетов = СтрЗаменить(ТекстЗапросаОбъектаРасчетов, "&ТабличнаяЧасть", МетаданныеПоСсылке.ПолноеИмя() + "." + ЧастиПути[1]);
				ТекстЗапросаОбъектаРасчетов = СтрЗаменить(ТекстЗапросаОбъектаРасчетов, "ИмяРеквизита", ЧастиПути[2]);
				ЗапросКТЧ = Истина;
			КонецЕсли;
			
			Если ТипЗнч(СтруктураПараметров.ПорядокРасчетов) = Тип("ПеречислениеСсылка.ПорядокРасчетов") Тогда
				Запрос.УстановитьПараметр("ПорядокРасчетов", СтруктураПараметров.ПорядокРасчетов);
			Иначе
				ЧастиПути = СтрРазделить(СтруктураПараметров.ПорядокРасчетов, ".");
				ЧастиПути.Удалить(0);
				Если ЗапросКТЧ Тогда
					ЧастиПути.Вставить(0, "ТабличнаяЧасть.Ссылка");
				Иначе
					ЧастиПути.Вставить(0, "Таблица");
				КонецЕсли;
				ТекстЗапросаОбъектаРасчетов = СтрЗаменить(ТекстЗапросаОбъектаРасчетов, "&ПорядокРасчетов", СтрСоединить(ЧастиПути, "."));
			КонецЕсли;
			
			// Получаем объекты расчетов из временной таблицы и добавляем связанные объекты расчетов в зависимости от порядка расчетов
			ТекстЗапроса = "
				|ВЫБРАТЬ
				|	ВтОбъектРасчетов.ОбъектРасчетов КАК ОбъектРасчетов
				|ИЗ
				|	ВтОбъектРасчетов КАК ВтОбъектРасчетов 
				|ГДЕ
				|	ВтОбъектРасчетов.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
				|";
				
			Если СтруктураПараметров.ЭтоПродажаЗакупка Тогда
				ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + "
					|ВЫБРАТЬ
					|	ОбъектыРасчетовДоговор.Ссылка
					|ИЗ
					|	ВтОбъектРасчетов КАК ВтОбъектРасчетов
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетовДоговор
					|			ПО ОбъектыРасчетов.Договор = ОбъектыРасчетовДоговор.Объект
					|				И НЕ ОбъектыРасчетов.ПометкаУдаления
					|				И НЕ ОбъектыРасчетов.ТолькоОстатки
					|		ПО ВтОбъектРасчетов.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
					|ГДЕ
					|	ВтОбъектРасчетов.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	ОбъектыРасчетов.Ссылка
					|ИЗ
					|	ВтОбъектРасчетов КАК ВтОбъектРасчетов
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК Расчеты
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|			ПО (Расчеты.ПродажаПоЗаказу = ОбъектыРасчетов.Объект)
					|				И НЕ ОбъектыРасчетов.ПометкаУдаления
					|				И НЕ ОбъектыРасчетов.ТолькоОстатки
					|		ПО (ВтОбъектРасчетов.ОбъектРасчетов = Расчеты.ОбъектРасчетов)
					|ГДЕ
					|	ВтОбъектРасчетов.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
					|";
			ИначеЕсли СтруктураПараметров.ЭтоЗаказ Тогда
				
				Если СтруктураПараметров.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком Тогда
					
					ТекстЗапроса = ТекстЗапроса +
					ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() +
					"ВЫБРАТЬ
					|	ОбъектыРасчетов.Ссылка
					|ИЗ
					|	ВтОбъектРасчетов КАК ВтОбъектРасчетов
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Обороты(,, Регистратор, ЗаказПоставщику В
					|			(ВЫБРАТЬ
					|				Т.Ссылка
					|			ИЗ
					|				ВтОбъектРасчетов КАК Т)) КАК ЗаказыПоставщикамОбороты
					|		ПО ВтОбъектРасчетов.Ссылка = ЗаказыПоставщикамОбороты.ЗаказПоставщику
					|		И ВтОбъектРасчетов.Ссылка <> ЗаказыПоставщикамОбороты.Регистратор
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|		ПО ЗаказыПоставщикамОбороты.Регистратор = ОбъектыРасчетов.Объект
					|			И НЕ ОбъектыРасчетов.ПометкаУдаления
					|			И НЕ ОбъектыРасчетов.ТолькоОстатки
					|ГДЕ
					|	ВтОбъектРасчетов.ПорядокРасчетов В (ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным),
					|		ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным), ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным))";
					
				Иначе
					
					ПараметрыФормированияТаблицы = РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.НовыйПараметрыФормированияРазвернутойТаблицы();
					ПараметрыФормированияТаблицы.Периодичность = "Регистратор";
					ПараметрыФормированияТаблицы.ТекстУсловия =
						"Распоряжение В
						|		(ВЫБРАТЬ
						|			Т.Ссылка
						|		ИЗ
						|			ВтОбъектРасчетов КАК Т)";
					ПараметрыФормированияТаблицы.Группировка = "Регистратор, Распоряжение";
					ПараметрыФормированияТаблицы.Показатели = "Заказано, КОформлению, Оформлено, КОтгрузке, Отгружено";
					ПараметрыФормированияТаблицы.Ресурсы = "Количество";
					ПараметрыФормированияТаблицы.Индексы = ПараметрыФормированияТаблицы.Группировка;
					ПараметрыФормированияТаблицы.ИмяВременнойТаблицы = "ВТ_РаспоряженияНаОтгрузкуОборотыРазвернутая";
					
					ВТ_РаспоряженияНаОтгрузкуОборотыРазвернутая =
						РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.ТекстЗапросаРазвернутаяТаблица(
							ПараметрыФормированияТаблицы);
					
					ТекстЗапроса = ВТ_РаспоряженияНаОтгрузкуОборотыРазвернутая +
					ОбщегоНазначения.РазделительПакетаЗапросов() +
					ТекстЗапроса +
					ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() +
					"ВЫБРАТЬ
					|	ОбъектыРасчетов.Ссылка
					|ИЗ
					|	ВтОбъектРасчетов КАК ВтОбъектРасчетов
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РаспоряженияНаОтгрузкуОборотыРазвернутая КАК РаспоряженияОбороты
					|		ПО ВтОбъектРасчетов.Ссылка = РаспоряженияОбороты.Распоряжение
					|		И ВтОбъектРасчетов.Ссылка <> РаспоряженияОбороты.Регистратор
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|		ПО РаспоряженияОбороты.Регистратор = ОбъектыРасчетов.Объект
					|			И НЕ ОбъектыРасчетов.ПометкаУдаления
					|			И НЕ ОбъектыРасчетов.ТолькоОстатки
					|ГДЕ
					|	ВтОбъектРасчетов.ПорядокРасчетов В
					|		(ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным),
					|		ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным),
					|		ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным))";
					
				КонецЕсли
				
			КонецЕсли;
			
			Если СтруктураПараметров.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Метаданные.РегистрыНакопления.РасчетыСКлиентами.Имя, Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Имя);
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Метаданные.РегистрыНакопления.РасчетыСКлиентами.Реквизиты.ПродажаПоЗаказу.Имя, Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Реквизиты.ЗакупкаПоЗаказу.Имя);
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Метаданные.РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.Измерения.Распоряжение.Имя, Метаданные.РегистрыНакопления.ЗаказыПоставщикам.Измерения.ЗаказПоставщику.Имя);
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Метаданные.РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.Имя, Метаданные.РегистрыНакопления.ЗаказыПоставщикам.Имя);
			КонецЕсли;
			
			Запрос.Текст = ТекстЗапросаОбъектаРасчетов + ОбщегоНазначения.РазделительПакетаЗапросов() + ТекстЗапроса;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(Запрос.Текст) Тогда
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектРасчетов");
		Результат = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат);
		Если Результат.Количество() = 0 Тогда
			Результат = Справочники.ОбъектыРасчетов.ПустаяСсылка();
		ИначеЕсли Результат.Количество() = 1 Тогда
			Результат = Результат[0];
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Заказ		 - ДокументСсылка - ссылка на заказ
//  ТипРасчетов	 - ПеречислениеСсылка.ТипыРасчетовСПартнерами - Расчеты с клиентом или поставщиком
// 
// Возвращаемое значение: 
//  - Неопределено - если не найдена запись о состоянии заказа
//  - см. СтруктураСостоянияРасчетов
//
Функция СостояниеВзаиморасчетовЗаказа(Заказ, ТипРасчетов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Если ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостоянияЗаказовКлиентов.СуммаОплаты     КАК СуммаОплат,
			|	СостоянияЗаказовКлиентов.ПроцентОплаты   КАК ПроцентОплат,
			|	СостоянияЗаказовКлиентов.СуммаОтгрузки   КАК СуммаОтгрузок,
			|	СостоянияЗаказовКлиентов.ПроцентОтгрузки КАК ПроцентОтгрузок,
			|	СостоянияЗаказовКлиентов.СуммаДолга      КАК СуммаЗадолженности
			|ИЗ
			|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
			|ГДЕ
			|	СостоянияЗаказовКлиентов.Заказ = &Заказ";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостоянияЗаказовПоставщикам.СуммаОплаты        КАК СуммаОплат,
			|	СостоянияЗаказовПоставщикам.ПроцентОплаты      КАК ПроцентОплат,
			|	СостоянияЗаказовПоставщикам.СуммаПоступления   КАК СуммаПоставок,
			|	СостоянияЗаказовПоставщикам.ПроцентПоступления КАК ПроцентПоставок,
			|	СостоянияЗаказовПоставщикам.СуммаДолга         КАК СуммаЗадолженности
			|ИЗ
			|	РегистрСведений.СостоянияЗаказовПоставщикам КАК СостоянияЗаказовПоставщикам
			|ГДЕ
			|	СостоянияЗаказовПоставщикам.Заказ = &Заказ";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = СтруктураСостоянияРасчетов();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращаемое значение:
//   Структура:
//      * СуммаОплат - Число.
//      * ПроцентОплат - Число.
//      * СуммаОтгрузок - Число.
//      * ПроцентОтгрузок - Число.
//      * СуммаПоставок - Число.
//      * ПроцентПоставок - Число.
//      * СуммаЗадолженности - Число.
//
Функция СтруктураСостоянияРасчетов()
	
	СтруктураСостоянияРасчетов = Новый Структура;
	СтруктураСостоянияРасчетов.Вставить("СуммаОплат", 0 );
	СтруктураСостоянияРасчетов.Вставить("ПроцентОплат", 0 );
	СтруктураСостоянияРасчетов.Вставить("СуммаОтгрузок", 0 );
	СтруктураСостоянияРасчетов.Вставить("ПроцентОтгрузок", 0 );
	СтруктураСостоянияРасчетов.Вставить("СуммаПоставок", 0 );
	СтруктураСостоянияРасчетов.Вставить("ПроцентПоставок", 0 );
	СтруктураСостоянияРасчетов.Вставить("СуммаЗадолженности", 0 );
	
	Возврат СтруктураСостоянияРасчетов;
	
КонецФункции

// Устарела.
Функция ТекстЗапросаОбъектовРасчетов()

	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Филиалы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ЦентрализованныеДоговоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.Филиалы КАК Филиалы
	|ГДЕ
	|	Филиалы.Организация = &Организация
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
	|	ОбъектыРасчетов.Объект КАК Объект,
	|	ОбъектыРасчетов.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|ПОМЕСТИТЬ ОбъектыРасчетов
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|ГДЕ
	|	НЕ ОбъектыРасчетов.ПометкаУдаления
	|	И НЕ ОбъектыРасчетов.Служебный
	|	И (ОбъектыРасчетов.Организация В (&Организация) 
	|	ИЛИ НЕ &ЭтоГоловнаяОрганизация 
	|		И ОбъектыРасчетов.Договор В (ВЫБРАТЬ Ссылка ИЗ ЦентрализованныеДоговоры)
	|		И (ОбъектыРасчетов.Организация = &ГоловнаяОрганизация
	|			ИЛИ ОбъектыРасчетов.Договор.РазрешаетсяПередачаОплатМеждуФилиалами)
	|	ИЛИ &ЭтоГоловнаяОрганизация
	|		И ОбъектыРасчетов.Организация.ГоловнаяОрганизация В (&Организация)
	|		И ОбъектыРасчетов.Организация.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию)
	|	И (ОбъектыРасчетов.Партнер = &Партнер ИЛИ &ПоВсемПартнерам)
	|	И (ОбъектыРасчетов.Контрагент = &Контрагент ИЛИ &ПоВсемКонтрагентам)
	|	И (&ПартнерПрочиеОтношения И ОбъектыРасчетов.Партнер.ПрочиеОтношения
	|		ИЛИ НЕ &ПартнерПрочиеОтношения)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов
	|";

КонецФункции

Функция ТекстЗапросаОстаткиПоРегистрамРасчетовСКлиентами()

	Возврат 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСКлиентамиПоСрокам.ДокументРегистратор КАК ДокументРегистратор
	|ПОМЕСТИТЬ ИсключаемыеДокументыПоДатеВозникновения
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО РасчетыСКлиентамиПоСрокам.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов
	|ГДЕ
	|	РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И &ИсключитьПоДатеВозникновения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПланОплатОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиПланОплатОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПланОплатОбороты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	РасчетыСКлиентамиПланОплатОбороты.КОплатеПриход КАК КОплатеПриход
	|ПОМЕСТИТЬ ЗапланированнаяОплата
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОплат.Обороты(
	|			,
	|			,
	|			,
	|			&ДебиторскаяЗадолженность
	|				И НЕ &ТолькоБезусловнаяЗадолженность
	|				И ОбъектРасчетов В
	|					(ВЫБРАТЬ
	|						ОбъектыРасчетов.ОбъектРасчетов
	|					ИЗ
	|						ОбъектыРасчетов КАК ОбъектыРасчетов)
	|				И &ОтборПоДатеВозникновения) КАК РасчетыСКлиентамиПланОплатОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПланОплат.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПланОплат.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиПланОплат.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	СУММА(РасчетыСКлиентамиПланОплат.КОплате) КАК КОплатеРасход
	|ПОМЕСТИТЬ ПоступившаяОплатаПоПлануОплат
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОплат КАК РасчетыСКлиентамиПланОплат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (РасчетыСКлиентамиПланОплат.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов)
	|ГДЕ
	|	РасчетыСКлиентамиПланОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И &ДебиторскаяЗадолженность
	|	И НЕ &ТолькоБезусловнаяЗадолженность
	|	И НЕ РасчетыСКлиентамиПланОплат.ДокументРегистратор В
	|				(ВЫБРАТЬ
	|					ИсключаемыеДокументыПоДатеВозникновения.ДокументРегистратор
	|				ИЗ
	|					ИсключаемыеДокументыПоДатеВозникновения)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиПланОплат.АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПланОплат.ОбъектРасчетов,
	|	РасчетыСКлиентамиПланОплат.ДатаПлановогоПогашения
	|;
	|
	|///////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапланированнаяОплата.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ЗапланированнаяОплата.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ЗапланированнаяОплата.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	ЗапланированнаяОплата.КОплатеПриход - ЕСТЬNULL(ПоступившаяОплатаПоПлануОплат.КОплатеРасход, 0) КАК КОплатеОстаток
	|ПОМЕСТИТЬ РасчетыСКлиентамиПланОплатОстатки
	|ИЗ
	|	ЗапланированнаяОплата КАК ЗапланированнаяОплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоступившаяОплатаПоПлануОплат КАК ПоступившаяОплатаПоПлануОплат
	|		ПО ЗапланированнаяОплата.ОбъектРасчетов = ПоступившаяОплатаПоПлануОплат.ОбъектРасчетов
	|			И ЗапланированнаяОплата.АналитикаУчетаПоПартнерам = ПоступившаяОплатаПоПлануОплат.АналитикаУчетаПоПартнерам
	|			И ЗапланированнаяОплата.ДатаПлановогоПогашения = ПоступившаяОплатаПоПлануОплат.ДатаПлановогоПогашения
	|ГДЕ
	|	ЗапланированнаяОплата.КОплатеПриход - ЕСТЬNULL(ПоступившаяОплатаПоПлануОплат.КОплатеРасход, 0) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.ДолгОстаток КАК ДолгОстаток,
	|	ВЫБОР
	|		КОГДА &ТолькоБезусловнаяЗадолженность
	|			ТОГДА 0
	|		ИНАЧЕ РасчетыСКлиентами.ДолгОстаток
	|	КОНЕЦ КАК КОплате,
	|	РасчетыСКлиентами.ПредоплатаОстаток КАК ПредоплатаОстаток,
	|	РасчетыСКлиентами.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения
	|ПОМЕСТИТЬ РасчетыСКлиентамиПоСрокамОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			,
	|			ОбъектРасчетов В
	|					(ВЫБРАТЬ
	|						ОбъектыРасчетов.ОбъектРасчетов
	|					ИЗ
	|						ОбъектыРасчетов КАК ОбъектыРасчетов)
	|				И &ОтборПоДатеВозникновения) КАК РасчетыСКлиентами
	|ГДЕ
	|	(НЕ &ДебиторскаяЗадолженность
	|				И РасчетыСКлиентами.ПредоплатаОстаток > 0
	|			ИЛИ &ДебиторскаяЗадолженность
	|				И РасчетыСКлиентами.ДолгОстаток > 0)
	|";

КонецФункции

Функция ТекстЗапросаОстаткиПоРегистрамРасчетовСПоставщиками()

	Возврат 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСПоставщикамиПоСрокам.ДокументРегистратор КАК ДокументРегистратор
	|ПОМЕСТИТЬ ИсключаемыеДокументыПоДатеВозникновения
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов
	|ГДЕ
	|	РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И &ИсключитьПоДатеВозникновения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПланОплатОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСПоставщикамиПланОплатОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПланОплатОбороты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	РасчетыСПоставщикамиПланОплатОбороты.КОплатеПриход КАК КОплатеПриход,
	|	РасчетыСПоставщикамиПланОплатОбороты.Валюта КАК Валюта
	|ПОМЕСТИТЬ ЗапланированнаяОплата
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПланОплат.Обороты(
	|			,
	|			,
	|			,
	|			НЕ &ДебиторскаяЗадолженность
	|				И НЕ &ТолькоБезусловнаяЗадолженность
	|				И ОбъектРасчетов В
	|					(ВЫБРАТЬ
	|						ОбъектыРасчетов.ОбъектРасчетов
	|					ИЗ
	|						ОбъектыРасчетов КАК ОбъектыРасчетов)
	|				И &ОтборПоДатеВозникновения) КАК РасчетыСПоставщикамиПланОплатОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПланОплат.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПланОплат.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСПоставщикамиПланОплат.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	РасчетыСПоставщикамиПланОплат.Валюта КАК Валюта,
	|	СУММА(РасчетыСПоставщикамиПланОплат.КОплате) КАК КОплатеРасход
	|ПОМЕСТИТЬ ИсполненнаяОплатаПоПлануОплат
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПланОплат КАК РасчетыСПоставщикамиПланОплат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (РасчетыСПоставщикамиПланОплат.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов)
	|ГДЕ
	|	РасчетыСПоставщикамиПланОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НЕ &ДебиторскаяЗадолженность
	|	И НЕ &ТолькоБезусловнаяЗадолженность
	|	И НЕ РасчетыСПоставщикамиПланОплат.ДокументРегистратор В
	|				(ВЫБРАТЬ
	|					ИсключаемыеДокументыПоДатеВозникновения.ДокументРегистратор
	|				ИЗ
	|					ИсключаемыеДокументыПоДатеВозникновения)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиПланОплат.АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПланОплат.ОбъектРасчетов,
	|	РасчетыСПоставщикамиПланОплат.Валюта,
	|	РасчетыСПоставщикамиПланОплат.ДатаПлановогоПогашения
	|;
	|
	|///////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапланированнаяОплата.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ЗапланированнаяОплата.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ЗапланированнаяОплата.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	ЗапланированнаяОплата.Валюта КАК Валюта,
	|	ЗапланированнаяОплата.КОплатеПриход - ЕСТЬNULL(ИсполненнаяОплатаПоПлануОплат.КОплатеРасход, 0) КАК КОплатеОстаток
	|ПОМЕСТИТЬ РасчетыСПоставщикамиПланОплатОстатки
	|ИЗ
	|	ЗапланированнаяОплата КАК ЗапланированнаяОплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсполненнаяОплатаПоПлануОплат КАК ИсполненнаяОплатаПоПлануОплат
	|		ПО ЗапланированнаяОплата.ОбъектРасчетов = ИсполненнаяОплатаПоПлануОплат.ОбъектРасчетов
	|			И ЗапланированнаяОплата.АналитикаУчетаПоПартнерам = ИсполненнаяОплатаПоПлануОплат.АналитикаУчетаПоПартнерам
	|			И ЗапланированнаяОплата.Валюта = ИсполненнаяОплатаПоПлануОплат.Валюта
	|			И ЗапланированнаяОплата.ДатаПлановогоПогашения = ИсполненнаяОплатаПоПлануОплат.ДатаПлановогоПогашения
	|ГДЕ
	|	ЗапланированнаяОплата.КОплатеПриход - ЕСТЬNULL(ИсполненнаяОплатаПоПлануОплат.КОплатеРасход, 0) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПоставщиками.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщиками.ДолгОстаток КАК ДолгОстаток,
	|	ВЫБОР
	|		КОГДА &ТолькоБезусловнаяЗадолженность
	|			ТОГДА 0
	|		ИНАЧЕ РасчетыСПоставщиками.ДолгОстаток
	|	КОНЕЦ КАК КОплате,
	|	РасчетыСПоставщиками.ПредоплатаОстаток КАК ПредоплатаОстаток,
	|	РасчетыСПоставщиками.Валюта КАК Валюта,
	|	РасчетыСПоставщиками.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения
	|ПОМЕСТИТЬ РасчетыСПоставщикамиПоСрокамОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	|			,
	|			ОбъектРасчетов В
	|					(ВЫБРАТЬ
	|						ОбъектыРасчетов.ОбъектРасчетов
	|					ИЗ
	|						ОбъектыРасчетов КАК ОбъектыРасчетов)
	|				И &ОтборПоДатеВозникновения) КАК РасчетыСПоставщиками
	|ГДЕ
	|	(&ДебиторскаяЗадолженность
	|				И РасчетыСПоставщиками.ПредоплатаОстаток > 0
	|			ИЛИ НЕ &ДебиторскаяЗадолженность
	|				И РасчетыСПоставщиками.ДолгОстаток > 0)
	|";

КонецФункции

#КонецОбласти

#Область ШаблоныПолейДляОтчетов

// Устарела. Шаблон поля отгружено клиенту.
//
// Возвращаемое значение: 
//  Строка - текст шаблона
//
Функция ШаблонПоляОтгруженоКлиенту() Экспорт
	
	Возврат ВзаиморасчетыОтчеты.ШаблонПоляОтгружено();
	
КонецФункции

// Устарела. Шаблон поля зачтено клиенту.
//
// Возвращаемое значение: 
//  Строка - текст шаблона
//
Функция ШаблонПоляЗачтеноКлиенту() Экспорт
	
	Возврат ВзаиморасчетыОтчеты.ШаблонПоляЗачтено();
	
КонецФункции

// Устарела. Шаблон поля оплачено клиентом.
//
// Возвращаемое значение: 
//  Строка - текст шаблона
//
Функция ШаблонПоляОплаченоКлиентом() Экспорт
	
	Возврат ВзаиморасчетыОтчеты.ШаблонПоляОплачено();
	
КонецФункции

// Устарела. Шаблон поля поставлено поставщиком.
//
// Возвращаемое значение: 
//  Строка - текст шаблона
//
Функция ШаблонПоляПоставленоПоставщиком() Экспорт
	
	Возврат ВзаиморасчетыОтчеты.ШаблонПоляОтгружено();
	
КонецФункции

// Устарела. Шаблон поля Зачтено поставщиком.
//
// Возвращаемое значение: 
//  Строка - текст шаблона
//
Функция ШаблонПоляЗачтеноПоставщиком() Экспорт
	
	Возврат ВзаиморасчетыОтчеты.ШаблонПоляЗачтено();
	
КонецФункции

// Устарела. Шаблон поля оплачено поставщику.
//
// Возвращаемое значение: 
//  Строка - текст шаблона
//
Функция ШаблонПоляОплаченоПоставщику() Экспорт
	
	Возврат ВзаиморасчетыОтчеты.ШаблонПоляОплачено();
	
КонецФункции

// Устарела. Шаблон поля списание переоценка задолженности.
//
// Возвращаемое значение: 
//  Строка - текст шаблона
//
Функция ШаблонПоляСписаниеПереоценкаЗадолженности() Экспорт
	
	Возврат ВзаиморасчетыОтчеты.ШаблонПоляСписаниеПереоценка();
	
КонецФункции

// Устарела. 
// Параметры:
// 	ТекстЗапроса - Строка -
// 	НастройкиОтчета - НастройкиКомпоновкиДанных - 
// 	ВычисляемыеПоля - ВычисляемыеПоляСхемыКомпоновкиДанных -
// 	ИмяТаблицы - Строка -
Процедура ДобавитьОтборыВыбранныхПолейВЗапрос(ТекстЗапроса, НастройкиОтчета, ВычисляемыеПоля, ИмяТаблицы) Экспорт
	
	ВзаиморасчетыОтчеты.ДобавитьОтборыВыбранныхПолейВЗапрос(ТекстЗапроса, НастройкиОтчета, ВычисляемыеПоля, ИмяТаблицы);
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеЗаданийКЗакрытиюМесяцаСлужебные

#Область ТекстыЗапросовЗаданийКЗакрытиюМесяца

// Устарела. 
// Параметры:
//   Запрос - Запрос.
//
// Возвращаемое значение:
//   см. ЗакрытиеМесяцаСервер.ИнициализироватьСтруктуруТекстовЗапросов
//
Функция ТекстЗапросаРасчетыСКлиентами(Запрос) Экспорт
	
	Возврат ВзаиморасчетыЗакрытиеМесяца.ТекстЗапросаРасчетыСКлиентами(Запрос);
	
КонецФункции

// Устарела. 
// Параметры:
//   Запрос - Запрос.
//
// Возвращаемое значение:
//   см. ЗакрытиеМесяцаСервер.ИнициализироватьСтруктуруТекстовЗапросов
//
Функция ТекстЗапросаРасчетыСПоставщиками(Запрос) Экспорт
	
	Возврат ВзаиморасчетыЗакрытиеМесяца.ТекстЗапросаРасчетыСПоставщиками(Запрос);
	
КонецФункции

// Устарела. 
// Параметры:
//   Запрос - Запрос.
//
// Возвращаемое значение:
//   см. ЗакрытиеМесяцаСервер.ИнициализироватьСтруктуруТекстовЗапросов
//
Функция ТекстЗапросаСуммыДокументовВВалютахУчета(Запрос) Экспорт
	
	Возврат ВзаиморасчетыЗакрытиеМесяца.ТекстЗапросаСуммыДокументовВВалютахУчета(Запрос);
	
КонецФункции

// Устарела. 
// Параметры:
//   Запрос - Запрос.
//
// Возвращаемое значение:
//   см. ЗакрытиеМесяцаСервер.ИнициализироватьСтруктуруТекстовЗапросов
//
Функция ТекстЗапросаРасчетыСПоставщикамиПоСрокам(Запрос) Экспорт
	
	Возврат ВзаиморасчетыЗакрытиеМесяца.ТекстЗапросаРасчетыСПоставщикамиПоСрокам(Запрос);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Модульность

#Область Общее

Функция КоэффициентПересчетаПоКурсу(ВалютаРегламентированногоУчета, Валюта, ВалютаВзаиморасчетов, КурсЧислитель, КурсЗнаменатель)
		
	Если КурсЧислитель = 0 Или КурсЗнаменатель = 0 Тогда
		Возврат 0;
	ИначеЕсли Валюта = ВалютаВзаиморасчетов Тогда
		Возврат 1;
	ИначеЕсли НЕ ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета
			И Валюта = ВалютаРегламентированногоУчета Тогда
		Возврат КурсЗнаменатель / КурсЧислитель;
	Иначе
		Возврат КурсЧислитель / КурсЗнаменатель;
	КонецЕсли;
	
КонецФункции

// Параметры:
// 	Объект - СправочникОбъект, ДокументОбъект - Описание
// 	СтруктураПараметров - см. ВзаиморасчетыСервер.ПараметрыМеханизма
// 	СистемныеНастройки - Структура - Описание
Процедура ПроверитьЗаполнитьСуммуВзаиморасчетов(Объект, СтруктураПараметров, СистемныеНастройки) Экспорт
	
	Если Не ЗначениеЗаполнено(СтруктураПараметров.СуммаВзаиморасчетов)
		Или ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.СуммаВзаиморасчетов) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("СуммаВзаиморасчетов", 0);
	
	СуммаВзаиморасчетовРеквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.СуммаВзаиморасчетов);
	СуммаВзаиморасчетовПоТареРеквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.СуммаВзаиморасчетовПоТаре);
	
	КурсЧислитель        = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.КурсЧислитель);
	КурсЗнаменатель      = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.КурсЗнаменатель);
	ВалютаДокумента      = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаДокумента);
	ВалютаВзаиморасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаВзаиморасчетов);
	Организация          = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
	ВернутьМногооборотнуюТару = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВернутьМногооборотнуюТару,,Ложь);
	ТребуетсяЗалогЗаТару = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ТребуетсяЗалогЗаТару,,Ложь);
	
	ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
	
	КоэффициентПересчета = КоэффициентПересчетаПоКурсу(ВалютаРегламентированногоУчета,
																		ВалютаДокумента,
																		ВалютаВзаиморасчетов,
																		КурсЧислитель,
																		КурсЗнаменатель);
	
	СуммыДокумента = ВзаиморасчетыСлужебный.СуммыДокумента(Объект, СтруктураПараметров);
	СуммаДокумента = СуммыДокумента.СуммаДокумента;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧ) Тогда
		
		ТаблицаТовары = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧ).Выгрузить();
		
		Если ТаблицаТовары.Количество() = 0 ИЛИ НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТаблицаТовары[0], "СуммаВзаиморасчетов") Тогда
			СуммаВзаиморасчетовПоТаре = 0;
			СуммаВзаиморасчетов = СуммаДокумента;
		Иначе
			Если ВернутьМногооборотнуюТару И НЕ ТребуетсяЗалогЗаТару Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "
				|ВЫБРАТЬ
				|	Номенклатура КАК Номенклатура,
				|	СуммаВзаиморасчетов КАК СуммаВзаиморасчетов
				|ПОМЕСТИТЬ ВтТовары
				|ИЗ &ТаблицаТовары КАК ТаблицаТовары
				|;
				|ВЫБРАТЬ
				|	*
				|ИЗ ВтТовары КАК ТаблицаТовары
				|ГДЕ
				|	Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
				|";
				Запрос.УстановитьПараметр("ТаблицаТовары",ТаблицаТовары);
				ТаблицаТовары = Запрос.Выполнить().Выгрузить();
			КонецЕсли;
			
			Если ТаблицаТовары.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
				СуммаВзаиморасчетовПоТаре = Окр(СуммыДокумента.СуммаЗалогаЗаТару * КоэффициентПересчета, 2);
				СуммаВзаиморасчетов       = ВзаиморасчетыКлиентСервер.ИтогПоСуммамОдногоЗнака(ТаблицаТовары, "СуммаВзаиморасчетов");
			Иначе
				
				Если СтруктураПараметров.ИсточникСуммТабличнаяЧасть Тогда
					СуммаВзаиморасчетовПоТаре   = Окр(СуммыДокумента.СуммаЗалогаЗаТару * КоэффициентПересчета, 2);
				Иначе
					СуммаВзаиморасчетовПоТаре = 0;
				КонецЕсли;
					
				СуммаВзаиморасчетов         = Окр(СуммыДокумента.СуммаДокументаБезЗалога * КоэффициентПересчета, 2) + СуммаВзаиморасчетовПоТаре;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		СуммаВзаиморасчетов = Окр(СуммаДокумента * КоэффициентПересчета, 2);
		СуммаВзаиморасчетовПоТаре = 0;
		
	КонецЕсли;
	
	СуммаВзаиморасчетовРеквизит.Данные[СуммаВзаиморасчетовРеквизит.Имя] = СуммаВзаиморасчетов;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.СуммаНДСВзаиморасчетов) Тогда
		Реквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.СуммаНДСВзаиморасчетов);
		СтавкаНДС = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, "Объект.СтавкаНДС");
		Реквизит.Данные[Реквизит.Имя] = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СуммаВзаиморасчетов, СтавкаНДС);
	КонецЕсли;
	
	Если СуммаВзаиморасчетовПоТареРеквизит <> Неопределено Тогда
		СуммаВзаиморасчетовПоТареРеквизит.Данные[СуммаВзаиморасчетовПоТареРеквизит.Имя] = СуммаВзаиморасчетовПоТаре;
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("СуммыДокумента") Тогда
		СтруктураПараметров.СуммыДокумента.СуммаВзаиморасчетов = СуммаВзаиморасчетов;
		СтруктураПараметров.СуммыДокумента.СуммаВзаиморасчетовБезЗалога = СуммаВзаиморасчетов - СуммаВзаиморасчетовПоТаре;
		СтруктураПараметров.СуммыДокумента.СуммаВзаиморасчетовПоТаре = СуммаВзаиморасчетовПоТаре;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьЗаполнить(Объект, СтруктураПараметров, ДанныеЗаполнения, ИмяПараметра, ЗначениеПоУмолчанию)
	
	Если ЗначениеЗаполнено(СтруктураПараметров[ИмяПараметра]) 
		И ТипЗнч(СтруктураПараметров[ИмяПараметра]) = Тип("Строка")
		И СтрЧислоВхождений(СтруктураПараметров[ИмяПараметра], ".") = 1 Тогда
		Реквизит = СтрРазделить(СтруктураПараметров[ИмяПараметра],".")[1];
		
		РеквизитВДанных = Неопределено;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
			И ДанныеЗаполнения.Свойство(Реквизит) Тогда
			Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения[Реквизит]) Тогда
				ДанныеЗаполнения[Реквизит] = ЗначениеПоУмолчанию;
			Иначе
				РеквизитВДанных = ДанныеЗаполнения[Реквизит];
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(РеквизитВДанных) Тогда
			ПроверитьЗаполнитьРеквизит(Объект, СтруктураПараметров, ИмяПараметра, ЗначениеПоУмолчанию);
		Иначе
			ПроверитьЗаполнитьРеквизит(Объект, СтруктураПараметров, ИмяПараметра, РеквизитВДанных);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьРеквизит(Объект, СтруктураПараметров, ИмяРеквизита, ЗначениеПоУмолчанию)
	
	Если СтруктураПараметров[ИмяРеквизита] = "" 
		ИЛИ ТипЗнч(СтруктураПараметров[ИмяРеквизита]) <> Тип("Строка")
		ИЛИ СтрЧислоВхождений(СтруктураПараметров[ИмяРеквизита],".") <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	Реквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров[ИмяРеквизита]);
	Если Реквизит.Данные <> Неопределено
		И Не ЗначениеЗаполнено(Реквизит.Данные[Реквизит.Имя]) Тогда
		Реквизит.Данные[Реквизит.Имя] = ЗначениеПоУмолчанию; 
	КонецЕсли;
	
КонецПроцедуры

// Таблица сумм по заказам. Не должен вызываться, если СтруктураПараметров.ИсточникСуммТабличнаяЧасть = Ложь.
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура, ДокументОбъект - Форма или документ объект.
//  СтруктураПараметров - см. ВзаиморасчетыСервер.ПараметрыМеханизма
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
// 		* Заказ - ДокументСсылка - Заказ строки.
// 		* СверхЗаказа - Булево - Признак того, что строка отгружается сверх запланированного.
// 		* Дата - Дата - Дата документа.
// 		* ДатаСогласования - Дата - Дата согласования (для заказов).
// 		* ДатаОтгрузки - Дата - Дата плановой отгрузки.
// 		* СуммаПлатежа - Число - Сумма расчетов в валюте документа.
// 		* СуммаЗалогаЗаТару - Число - Сумма залога в валюте документа.
// 		* СуммаВзаиморасчетов - Число - Сумма взаиморасчетов по строке.
// 		* СуммаВзаиморасчетовПоТаре - Число - Сумма взаиморасчетов по таре по строке.
Функция ТаблицаСуммПоЗаказам(Объект, СтруктураПараметров) Экспорт
	
	ИмяТЧ = СтрРазделить(СтруктураПараметров.ПутьКДаннымТЧ, ".")[1];
	ЗаказШапки = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование);
	ЗаказШапки = ?(ЗаказШапки = Неопределено, Документы.ЗаказКлиента.ПустаяСсылка(),ЗаказШапки);
	Дата = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата,,Дата(1,1,1));
	ДатаСогласования = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаСогласования,,Дата(1,1,1));
	
	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
		Если Объект.Свойство("Ссылка") И ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Объект.Ссылка)) Тогда
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(
				ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, Объект.Ссылка));
		Иначе
			Менеджер = Обработки.ПомощникПродаж;
		КонецЕсли;
	Иначе
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Объект.Метаданные().ПолноеИмя());
	КонецЕсли;
	
	ЗначенияРеквизитов = Новый Структура;
	ТаблицаЗначений = Объект[ИмяТЧ].Выгрузить();
	ЗначенияРеквизитов.Вставить("ТаблицаЗначений", ТаблицаЗначений);
	ЗначенияРеквизитов.Вставить("Дата", Дата);
	ЗначенияРеквизитов.Вставить("ДатаСогласования", ДатаСогласования);
	ЗначенияРеквизитов.Вставить("ВернутьМногооборотнуюТару", ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВернутьМногооборотнуюТару,,Ложь));
	ЗначенияРеквизитов.Вставить("ТребуетсяЗалогЗаТару", ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ТребуетсяЗалогЗаТару,,Ложь));
	
	ЗначенияРеквизитов.Вставить("ЗаказШапки", ЗаказШапки);
	ЗначенияРеквизитов.Вставить("ПоЗаказам", ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.НакладнаяПоЗаказам,,Ложь));
	ЗначенияРеквизитов.Вставить("ЭтоПереходПраваСобственности2_5", СтруктураПараметров.ЭтоПереходПраваСобственности2_5);
	ЗначенияРеквизитов.Вставить("Ссылка", Объект.Ссылка);
	
	Возврат Менеджер.СуммыПоЗаказам(Объект.Ссылка, ЗначенияРеквизитов); 
		
КонецФункции

#КонецОбласти

#Область АвтоматическийЗачетАвансовМеждуОбъектамиРасчетов

//Вызывается из помощника продаж и при проведении документов.
Процедура ЗаполнитьВозможныеАвансыВНакладной(Объект, СтруктураПараметров) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа)
		ИЛИ НЕ СтруктураПараметров.ИзменяетРасчеты
		ИЛИ НЕ СтруктураПараметров.ЭтоПродажаЗакупка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект,"ДополнительныеСвойства")
		И Объект.ДополнительныеСвойства.Свойство("ЗачетОплаты") Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокРасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПорядокРасчетов);
	НакладнаяПоЗаказам = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.НакладнаяПоЗаказам,,Ложь);
	Договор = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
	РасшифровкаПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа);
	ЭтоРасчетыСКлиентами = СтруктураПараметров.ДокументРасчетовСКлиентами;
	НоваяАрхитектураВзаиморасчетов = ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
	ДатаНакладной = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
	СсылкаНаНакладную = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Ссылка);
	МаксимальнаяСуммаЗачета = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.СуммаВзаиморасчетов, , 0)
	                        + ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.СуммаВзаиморасчетовПоТаре, , 0);
	ОбъектРасчетовНакладная = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(
		СсылкаНаНакладную,
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация),
		?(ЭтоРасчетыСКлиентами, Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом, Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком));
	
	ЗачтенАванс = Ложь;
	Если НакладнаяПоЗаказам И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда
		
		Запрос = Новый Запрос;
		ТекстыЗапросов = Новый Массив;
		
		Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) Тогда
			ТаблицаЭтапыОплаты = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
			ТекстыЗапросов.Добавить("
			|ВЫБРАТЬ
			|	Таблица.СверхЗаказа КАК СверхЗаказа,
			|	Таблица.Заказ КАК Заказ,
			|	Таблица.ВариантОплаты КАК ВариантОплаты,
			|	Таблица.СуммаВзаиморасчетов + Таблица.СуммаВзаиморасчетовПоТаре КАК СуммаВНакладной
			|ПОМЕСТИТЬ ВтЭтапыОплаты
			|ИЗ &ТаблицаЭтапыОплаты КАК Таблица
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.СверхЗаказа КАК СверхЗаказа,
			|	Товары.Заказ КАК Заказ,
			|	СУММА(Товары.СуммаВНакладной) КАК СуммаВНакладной,
			|	СУММА(ВЫБОР КОГДА Товары.ВариантОплаты В (&ВариантыПредоплаты)
			|			ТОГДА Товары.СуммаВНакладной
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ТребуемаяПредоплата
			|ПОМЕСТИТЬ ВтТовары
			|ИЗ ВтЭтапыОплаты КАК Товары
			|СГРУППИРОВАТЬ ПО
			|	Товары.СверхЗаказа,
			|	Товары.Заказ
			|;");
			Запрос.УстановитьПараметр("ТаблицаЭтапыОплаты", ТаблицаЭтапыОплаты.Выгрузить());
			Заказ = ТаблицаЭтапыОплаты.ВыгрузитьКолонку("Заказ");
			ОбъектОснование = Заказ;
		Иначе
			Заказ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование);
			Сумма = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.СуммаВзаиморасчетов);
			ТекстыЗапросов.Добавить("
			|ВЫБРАТЬ
			|	ЛОЖЬ КАК СверхЗаказа,
			|	&Заказ КАК Заказ,
			|	&Сумма КАК СуммаВНакладной,
			|	0 КАК ТребуемаяПредоплата
			|ПОМЕСТИТЬ ВтТовары
			|;");
			Запрос.УстановитьПараметр("Заказ", Заказ);
			Запрос.УстановитьПараметр("Сумма", Сумма);
			ОбъектОснование = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование,,Неопределено);
		КонецЕсли;
		
		Если ТипЗнч(ОбъектОснование) <> Тип("Массив") Тогда
			ОбъектОснование = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектОснование);
		КонецЕсли;
		
		ТекстыЗапросов.Добавить("
		|ВЫБРАТЬ
		|	Товары.СверхЗаказа КАК СверхЗаказа,
		|	СУММА(Товары.СуммаВНакладной) КАК СуммаНакладной,
		|	СУММА(Товары.ТребуемаяПредоплата) КАК ТребуемаяПредоплата
		|ПОМЕСТИТЬ ВтСуммаНакладной
		|ИЗ ВтТовары КАК Товары
		|СГРУППИРОВАТЬ ПО
		|	Товары.СверхЗаказа
		|;");
		
		Если Не НоваяАрхитектураВзаиморасчетов Тогда
		ТекстыЗапросов.Добавить("
		|ВЫБРАТЬ
		|	Расчеты.ОбъектРасчетов        КАК ОбъектРасчетов,
		|	Расчеты.ОбъектРасчетов.Объект КАК Объект,
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И &ЭтоРасчетыСКлиентами
		|			ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ &ЭтоРасчетыСКлиентами
		|			ТОГДА Расчеты.Сумма
		|		ИНАЧЕ -Расчеты.Сумма
		|	КОНЕЦ)                        КАК ОстатокПредоплаты,
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.Регистратор В (&МассивОбъектов) 
		|			И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И &ЭтоРасчетыСКлиентами
		|				ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ &ЭтоРасчетыСКлиентами)
		|				ТОГДА КОплате
		|			ИНАЧЕ 0
		|	КОНЕЦ)                         КАК ПланОплатыВсего,
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.Регистратор В (&МассивОбъектов)
		|			И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И &ЭтоРасчетыСКлиентами
		|				И (Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения) 
		|					ИЛИ Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки))
		|				ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ &ЭтоРасчетыСКлиентами
		|					И (Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения)
		|						ИЛИ Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления))) 
		|					ТОГДА КОплате
		|			ИНАЧЕ 0
		|	КОНЕЦ)                         КАК ПланПредоплаты,
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И &ЭтоРасчетыСКлиентами
		|				ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ &ЭтоРасчетыСКлиентами
		|			ТОГДА Расчеты.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ)                         КАК ВсегоОплачено,
		|	0                              КАК ОплатаПоНакладной,
		|	ЕСТЬNULL(ВтСуммаНакладной.СуммаНакладной, 0) КАК СуммаНакладной,
		|	ЕСТЬNULL(ВтСуммаНакладнойСверхЗаказа.СуммаНакладной, 0) КАК СуммаНакладнойСверхЗаказа
		|ПОМЕСТИТЬ ВтРасчеты
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммаНакладной КАК ВтСуммаНакладной
		|			ПО НЕ ВтСуммаНакладной.СверхЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммаНакладной КАК ВтСуммаНакладнойСверхЗаказа
		|			ПО ВтСуммаНакладнойСверхЗаказа.СверхЗаказа
		|ГДЕ
		|	ОбъектРасчетов.Объект В (&МассивОбъектов)
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.ОбъектРасчетов,
		|	ВтСуммаНакладной.СуммаНакладной,
		|	ВтСуммаНакладнойСверхЗаказа.СуммаНакладной
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И &ЭтоРасчетыСКлиентами
		|			ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ &ЭтоРасчетыСКлиентами
		|			ТОГДА Расчеты.Сумма
		|		ИНАЧЕ -Расчеты.Сумма
		|	КОНЕЦ) > 0
		|	И 
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.Регистратор В (&МассивОбъектов)
		|			И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И &ЭтоРасчетыСКлиентами
		|				И (Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения) 
		|					ИЛИ Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки))
		|				ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ &ЭтоРасчетыСКлиентами
		|					И (Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения)
		|						ИЛИ Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления))) 
		|					ТОГДА КОплате
		|			ИНАЧЕ 0
		|	КОНЕЦ) > 0
		|	И 
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И &ЭтоРасчетыСКлиентами
		|				ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ &ЭтоРасчетыСКлиентами
		|			ТОГДА Расчеты.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ) > 0
		|;");
		Иначе
			ТекстыЗапросов.Добавить(ТекстЗапросаОстатковПредоплаты(ЭтоРасчетыСКлиентами));
			Запрос.УстановитьПараметр("ДатаНакладной", ДатаНакладной);
			Запрос.УстановитьПараметр("Объекты", ОбъектОснование);
			Запрос.УстановитьПараметр("ДокументыПлана", ОбъектОснование);
			Запрос.УстановитьПараметр("ДанныеОтчета", 4);
			Запрос.УстановитьПараметр("СсылкаНаНакладную", СсылкаНаНакладную);
		КонецЕсли;
		
		ТекстыЗапросов.Добавить("
		|ВЫБРАТЬ
		|	ВЫБОР 
		|		//На заказ пришло больше предоплаты
		|		КОГДА ВсегоОплачено >= ПланОплатыВсего ТОГДА
		|			ВЫБОР
		|				КОГДА ОстатокПредоплаты >= Товары.СуммаВНакладной + ТоварыСверхЗаказа.СуммаВНакладной
		|					ТОГДА ЕСТЬNULL(Товары.СуммаВНакладной, 0) + ЕСТЬNULL(ТоварыСверхЗаказа.СуммаВНакладной, 0)
		|				КОГДА ОстатокПредоплаты >= Товары.СуммаВНакладной
		|					ТОГДА ЕСТЬNULL(Товары.СуммаВНакладной, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		//На остатке есть требуемая предоплата для текущей накладной
		|		КОГДА ЕСТЬNULL(Товары.ТребуемаяПредоплата, 0) + ЕСТЬNULL(ТоварыСверхЗаказа.ТребуемаяПредоплата, 0) > 0 И ОстатокПредоплаты >= ЕСТЬNULL(Товары.ТребуемаяПредоплата, 0) + ЕСТЬNULL(ТоварыСверхЗаказа.ТребуемаяПредоплата, 0)
		|			ТОГДА ЕСТЬNULL(Товары.ТребуемаяПредоплата, 0) + ЕСТЬNULL(ТоварыСверхЗаказа.ТребуемаяПредоплата, 0)
		|		КОГДА ЕСТЬNULL(Товары.ТребуемаяПредоплата, 0) > 0 И ОстатокПредоплаты >= ЕСТЬNULL(Товары.ТребуемаяПредоплата, 0)
		|			ТОГДА ЕСТЬNULL(Товары.ТребуемаяПредоплата, 0)
		|		//Если требуемая предоплата не заполнена, рассчитаем сумму предоплаты по плановым оплатам
		|		КОГДА ОстатокПредоплаты >= ВЫРАЗИТЬ((ЕСТЬNULL(Товары.СуммаВНакладной, 0) + ЕСТЬNULL(ТоварыСверхЗаказа.СуммаВНакладной, 0)) * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|			ТОГДА ВЫРАЗИТЬ((ЕСТЬNULL(Товары.СуммаВНакладной, 0) + ЕСТЬNULL(ТоварыСверхЗаказа.СуммаВНакладной, 0)) * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|		КОГДА ОстатокПредоплаты >= ВЫРАЗИТЬ(ЕСТЬNULL(Товары.СуммаВНакладной, 0) * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Товары.СуммаВНакладной, 0) * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Сумма,
		|	Расчеты.ОплатаПоНакладной КАК ОплатаПоНакладной,
		|	ОбъектРасчетов КАК ОбъектРасчетов,
		|	ОбъектРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
		|ИЗ
		|	ВтРасчеты КАК Расчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТовары КАК Товары
		|			ПО Расчеты.Объект = Товары.Заказ
		|				И НЕ Товары.СверхЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТовары КАК ТоварыСверхЗаказа
		|			ПО Расчеты.Объект = ТоварыСверхЗаказа.Заказ
		|				И ТоварыСверхЗаказа.СверхЗаказа
		|ГДЕ
		|	ВЫБОР 
		|		//На заказ пришло больше предоплаты
		|		КОГДА ВсегоОплачено >= ПланОплатыВсего ТОГДА
		|			ВЫБОР
		|				КОГДА ОстатокПредоплаты >= Товары.СуммаВНакладной + ТоварыСверхЗаказа.СуммаВНакладной
		|					ТОГДА ЕСТЬNULL(Товары.СуммаВНакладной, 0) + ЕСТЬNULL(ТоварыСверхЗаказа.СуммаВНакладной, 0)
		|				КОГДА ОстатокПредоплаты >= Товары.СуммаВНакладной
		|					ТОГДА ЕСТЬNULL(Товары.СуммаВНакладной, 0)
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		//На остатке есть требуемая предоплата для текущей накладной
		|		КОГДА ЕСТЬNULL(Товары.ТребуемаяПредоплата, 0) + ЕСТЬNULL(ТоварыСверхЗаказа.ТребуемаяПредоплата, 0) > 0 И ОстатокПредоплаты >= ЕСТЬNULL(Товары.ТребуемаяПредоплата, 0) + ЕСТЬNULL(ТоварыСверхЗаказа.ТребуемаяПредоплата, 0)
		|			ТОГДА ЕСТЬNULL(Товары.ТребуемаяПредоплата, 0) + ЕСТЬNULL(ТоварыСверхЗаказа.ТребуемаяПредоплата, 0)
		|		КОГДА ЕСТЬNULL(Товары.ТребуемаяПредоплата, 0) > 0 И ОстатокПредоплаты >= ЕСТЬNULL(Товары.ТребуемаяПредоплата, 0)
		|			ТОГДА ЕСТЬNULL(Товары.ТребуемаяПредоплата, 0)
		|		//Если требуемая предоплата не заполнена, рассчитаем сумму предоплаты по плановым оплатам
		|		КОГДА ОстатокПредоплаты >= ВЫРАЗИТЬ((ЕСТЬNULL(Товары.СуммаВНакладной, 0) + ЕСТЬNULL(ТоварыСверхЗаказа.СуммаВНакладной, 0)) * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|			ТОГДА ВЫРАЗИТЬ((ЕСТЬNULL(Товары.СуммаВНакладной, 0) + ЕСТЬNULL(ТоварыСверхЗаказа.СуммаВНакладной, 0)) * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|		КОГДА ОстатокПредоплаты >= ВЫРАЗИТЬ(ЕСТЬNULL(Товары.СуммаВНакладной, 0) * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(Товары.СуммаВНакладной, 0) * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|		ИНАЧЕ 0
		|	КОНЕЦ > 0
		|");
		Запрос.УстановитьПараметр("МассивОбъектов", ОбъектОснование);
		Запрос.УстановитьПараметр("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
		ВариантыПредоплаты = Новый Массив;
		Если ЭтоРасчетыСКлиентами Тогда
			ВариантыПредоплаты.Добавить(Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения);
			ВариантыПредоплаты.Добавить(Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки);
		Иначе
			ВариантыПредоплаты.Добавить(Перечисления.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения);
			ВариантыПредоплаты.Добавить(Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВариантыПредоплаты", ВариантыПредоплаты);
		Запрос.Текст = СтрСоединить(ТекстыЗапросов);
		Если НЕ ЭтоРасчетыСКлиентами Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,".РасчетыСКлиентами",".РасчетыСПоставщиками");
		КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			МаксимальнаяСуммаЗачета = МаксимальнаяСуммаЗачета - Выборка.ОплатаПоНакладной;
		КонецЕсли;
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			Если МаксимальнаяСуммаЗачета <= 0 Тогда
				Продолжить;
			КонецЕсли;
			ЗачтенАванс = Истина;
			НовСтр = РасшифровкаПлатежа.Добавить();
			НовСтр.ОбъектРасчетов = Выборка.ОбъектРасчетов;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр,"ВалютаВзаиморасчетов") Тогда
				НовСтр.ВалютаВзаиморасчетов = Выборка.ВалютаВзаиморасчетов;
			КонецЕсли;
			НовСтр.СуммаВзаиморасчетов = Мин(Выборка.Сумма, МаксимальнаяСуммаЗачета);
			НовСтр.Сумма = Мин(Выборка.Сумма, МаксимальнаяСуммаЗачета);
			Уменьшить = НовСтр.СуммаВзаиморасчетов;
			Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
				Если Уменьшить > 0
					И (Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов)
						Или СтрокаРасшифровки.ОбъектРасчетов = ОбъектРасчетовНакладная) Тогда
					СтрокаРасшифровки.СуммаВзаиморасчетов = СтрокаРасшифровки.СуммаВзаиморасчетов - Мин(СтрокаРасшифровки.СуммаВзаиморасчетов, Уменьшить);
					СтрокаРасшифровки.Сумма = СтрокаРасшифровки.СуммаВзаиморасчетов;
					Уменьшить = Уменьшить - СтрокаРасшифровки.СуммаВзаиморасчетов;
				КонецЕсли;
			КонецЦикла;
			МаксимальнаяСуммаЗачета = МаксимальнаяСуммаЗачета - НовСтр.Сумма;
		КонецЦикла;
		Индекс = РасшифровкаПлатежа.Количество();
		Пока Индекс > 0 Цикл
			Индекс = Индекс - 1;
			Если РасшифровкаПлатежа[Индекс].СуммаВзаиморасчетов = 0 Тогда
				РасшифровкаПлатежа.Удалить(Индекс);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли НакладнаяПоЗаказам И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным И НЕ СтруктураПараметров.ЗаданГрафикИсполнения Тогда
			
		Если ТипЗнч(ОбъектОснование) <> Тип("Массив") Тогда
			ОбъектОснование = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектОснование);
		КонецЕсли;
		ОбъектОснование.Добавить(Договор);
		
		Запрос = Новый Запрос;
		ТекстыЗапросов = Новый Массив;
		
		Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) Тогда
			ТаблицаЭтапыОплаты = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
			ТекстыЗапросов.Добавить("
			|ВЫБРАТЬ
			|	Таблица.СверхЗаказа КАК СверхЗаказа,
			|	Таблица.ВариантОплаты КАК ВариантОплаты,
			|	Таблица.СуммаВзаиморасчетов + Таблица.СуммаВзаиморасчетовПоТаре КАК Сумма
			|ПОМЕСТИТЬ ВтЭтапыОплаты
			|ИЗ &ТаблицаЭтапыОплаты КАК Таблица
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.СверхЗаказа КАК СверхЗаказа,
			|	СУММА(Товары.Сумма) КАК Сумма,
			|	СУММА(ВЫБОР КОГДА Товары.ВариантОплаты В (&ВариантыПредоплаты)
			|			ТОГДА Товары.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ТребуемаяПредоплата
			|ПОМЕСТИТЬ ВтТовары
			|ИЗ ВтЭтапыОплаты КАК Товары
			|СГРУППИРОВАТЬ ПО
			|	Товары.СверхЗаказа
			|;");
			Запрос.УстановитьПараметр("ТаблицаЭтапыОплаты", ТаблицаЭтапыОплаты.Выгрузить());
			Заказ = ТаблицаЭтапыОплаты.ВыгрузитьКолонку("Заказ");
		Иначе
			Заказ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование);
			Сумма = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.СуммаВзаиморасчетов);
			ТекстыЗапросов.Добавить("
			|ВЫБРАТЬ
			|	ЛОЖЬ КАК СверхЗаказа,
			|	&Сумма КАК Сумма,
			|	0 КАК ТребуемаяПредоплата
			|ПОМЕСТИТЬ ВтТовары
			|;");
			Запрос.УстановитьПараметр("Сумма", Сумма);
		КонецЕсли;
		
		ТекстыЗапросов.Добавить("
		|ВЫБРАТЬ
		|	Товары.СверхЗаказа КАК СверхЗаказа,
		|	СУММА(Товары.Сумма) КАК СуммаНакладной,
		|	СУММА(Товары.ТребуемаяПредоплата) КАК ТребуемаяПредоплата
		|ПОМЕСТИТЬ ВтСуммаНакладной
		|ИЗ ВтТовары КАК Товары
		|СГРУППИРОВАТЬ ПО
		|	Товары.СверхЗаказа
		|;");
		
		Если Не НоваяАрхитектураВзаиморасчетов Тогда
		ТекстыЗапросов.Добавить("
		|ВЫБРАТЬ
		|	Расчеты.ОбъектРасчетов        КАК ОбъектРасчетов,
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И &ЭтоРасчетыСКлиентами
		|			ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ &ЭтоРасчетыСКлиентами
		|			ТОГДА Расчеты.Сумма
		|		ИНАЧЕ -Расчеты.Сумма
		|	КОНЕЦ)                        КАК ОстатокПредоплаты,
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.Регистратор В (&Заказ) 
		|			И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И &ЭтоРасчетыСКлиентами
		|				ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ &ЭтоРасчетыСКлиентами)
		|				ТОГДА КОплате
		|			ИНАЧЕ 0
		|	КОНЕЦ)                         КАК ПланОплатыВсего,
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.Регистратор В (&Заказ)
		|			И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И &ЭтоРасчетыСКлиентами
		|				И (Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения) 
		|					ИЛИ Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки))
		|				ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ &ЭтоРасчетыСКлиентами
		|					И (Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения)
		|						ИЛИ Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления))) 
		|					ТОГДА КОплате
		|			ИНАЧЕ 0
		|	КОНЕЦ)                         КАК ПланПредоплаты,
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И &ЭтоРасчетыСКлиентами
		|				ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ &ЭтоРасчетыСКлиентами
		|			ТОГДА Расчеты.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ)                         КАК ВсегоОплачено,
		|	0                              КАК ОплатаПоНакладной,
		|	ВтСуммаНакладной.СуммаНакладной КАК СуммаНакладной,
		|	ВтСуммаНакладнойСверхЗаказа.СуммаНакладной КАК СуммаНакладнойСверхЗаказа,
		|	ВтСуммаНакладной.ТребуемаяПредоплата КАК ТребуемаяПредоплата,
		|	ВтСуммаНакладнойСверхЗаказа.ТребуемаяПредоплата КАК ТребуемаяПредоплатаСверхЗаказа
		|ПОМЕСТИТЬ ВтРасчеты
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммаНакладной КАК ВтСуммаНакладной
		|			ПО НЕ ВтСуммаНакладной.СверхЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммаНакладной КАК ВтСуммаНакладнойСверхЗаказа
		|			ПО ВтСуммаНакладнойСверхЗаказа.СверхЗаказа
		|ГДЕ
		|	ОбъектРасчетов.Объект В (&МассивОбъектов)
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.ОбъектРасчетов,
		|	ВтСуммаНакладной.СуммаНакладной,
		|	ВтСуммаНакладнойСверхЗаказа.СуммаНакладной,
		|	ВтСуммаНакладной.ТребуемаяПредоплата,
		|	ВтСуммаНакладнойСверхЗаказа.ТребуемаяПредоплата
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И &ЭтоРасчетыСКлиентами
		|			ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ &ЭтоРасчетыСКлиентами
		|			ТОГДА Расчеты.Сумма
		|		ИНАЧЕ -Расчеты.Сумма
		|	КОНЕЦ) > 0
		|	И 
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.Регистратор В (&Заказ)
		|			И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И &ЭтоРасчетыСКлиентами
		|				И (Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения) 
		|					ИЛИ Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки))
		|				ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ &ЭтоРасчетыСКлиентами
		|					И (Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения)
		|						ИЛИ Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления))) 
		|					ТОГДА КОплате
		|			ИНАЧЕ 0
		|	КОНЕЦ) > 0
		|	И 
		|	СУММА(ВЫБОР 
		|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И &ЭтоРасчетыСКлиентами
		|				ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И НЕ &ЭтоРасчетыСКлиентами
		|			ТОГДА Расчеты.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ) > 0
		|;");
		Иначе
			ТекстыЗапросов.Добавить(ТекстЗапросаОстатковПредоплаты(ЭтоРасчетыСКлиентами));
			Запрос.УстановитьПараметр("ДатаНакладной", ДатаНакладной);
			Запрос.УстановитьПараметр("Объекты", Договор);
			Запрос.УстановитьПараметр("ДокументыПлана", Заказ);
			Запрос.УстановитьПараметр("ДанныеОтчета", 4);
			Запрос.УстановитьПараметр("СсылкаНаНакладную", СсылкаНаНакладную);
		КонецЕсли;
		
		ТекстыЗапросов.Добавить("
		|ВЫБРАТЬ
		|	ВЫБОР 
		|		//На заказ пришло больше предоплаты
		|		КОГДА ВсегоОплачено >= ПланОплатыВсего
		|			ТОГДА ВЫБОР
		|					КОГДА ВсегоОплачено * (СуммаНакладной + СуммаНакладнойСверхЗаказа) / ПланОплатыВсего > ПланОплатыВсего
		|						ТОГДА ВЫБОР
		|								КОГДА ПланОплатыВсего > СуммаНакладной
		|									И (СуммаНакладной + СуммаНакладнойСверхЗаказа) <= ОстатокПредоплаты
		|									ТОГДА (СуммаНакладной + СуммаНакладнойСверхЗаказа)
		|								КОГДА ПланОплатыВсего <= (СуммаНакладной + СуммаНакладнойСверхЗаказа)
		|									И ПланОплатыВсего <= ОстатокПредоплаты
		|									ТОГДА ПланОплатыВсего
		|								ИНАЧЕ ОстатокПредоплаты
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|								КОГДА ВсегоОплачено * (СуммаНакладной + СуммаНакладнойСверхЗаказа) / ПланОплатыВсего > (СуммаНакладной + СуммаНакладнойСверхЗаказа) 
		|									И (СуммаНакладной + СуммаНакладнойСверхЗаказа) <= ОстатокПредоплаты
		|									ТОГДА (СуммаНакладной + СуммаНакладнойСверхЗаказа)
		|								КОГДА ВсегоОплачено * (СуммаНакладной + СуммаНакладнойСверхЗаказа) / ПланОплатыВсего <= (СуммаНакладной + СуммаНакладнойСверхЗаказа) 
		|									И ПланОплатыВсего <= ОстатокПредоплаты
		|									ТОГДА ПланОплатыВсего
		|								ИНАЧЕ ОстатокПредоплаты
		|							КОНЕЦ
		|				КОНЕЦ 
		|		//На остатке есть требуемая предоплата для текущей накладной
		|		КОГДА ТребуемаяПредоплата + ТребуемаяПредоплатаСверхЗаказа > 0 И ОстатокПредоплаты >= ТребуемаяПредоплата + ТребуемаяПредоплатаСверхЗаказа
		|			ТОГДА ТребуемаяПредоплата + ТребуемаяПредоплатаСверхЗаказа
		|		КОГДА ТребуемаяПредоплата > 0 И ОстатокПредоплаты >= ТребуемаяПредоплата
		|			ТОГДА ТребуемаяПредоплата
		|		//Если требуемая предоплата не заполнена, рассчитаем сумму предоплаты по плановым оплатам
		|		КОГДА ОстатокПредоплаты >= ВЫРАЗИТЬ((СуммаНакладной + СуммаНакладнойСверхЗаказа) * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|			ТОГДА ВЫРАЗИТЬ((СуммаНакладной + СуммаНакладнойСверхЗаказа) * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|		КОГДА ОстатокПредоплаты >= ВЫРАЗИТЬ(СуммаНакладной * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|			ТОГДА ВЫРАЗИТЬ(СуммаНакладной * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Сумма,
		|	Расчеты.ОплатаПоНакладной КАК ОплатаПоНакладной,
		|	ОбъектРасчетов КАК ОбъектРасчетов,
		|	ОбъектРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
		|ИЗ
		|	ВтРасчеты КАК Расчеты
		|ГДЕ
		|	ВЫБОР 
		|		//На заказ пришло больше предоплаты
		|		КОГДА ВсегоОплачено >= ПланОплатыВсего
		|			ТОГДА ВЫБОР
		|					КОГДА ВсегоОплачено * (СуммаНакладной + СуммаНакладнойСверхЗаказа) / ПланОплатыВсего > ПланОплатыВсего
		|						ТОГДА ВЫБОР
		|								КОГДА ПланОплатыВсего > СуммаНакладной
		|									И (СуммаНакладной + СуммаНакладнойСверхЗаказа) <= ОстатокПредоплаты
		|									ТОГДА (СуммаНакладной + СуммаНакладнойСверхЗаказа)
		|								КОГДА ПланОплатыВсего <= (СуммаНакладной + СуммаНакладнойСверхЗаказа)
		|									И ПланОплатыВсего <= ОстатокПредоплаты
		|									ТОГДА ПланОплатыВсего
		|								ИНАЧЕ ОстатокПредоплаты
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|								КОГДА ВсегоОплачено * (СуммаНакладной + СуммаНакладнойСверхЗаказа) / ПланОплатыВсего > (СуммаНакладной + СуммаНакладнойСверхЗаказа) 
		|									И (СуммаНакладной + СуммаНакладнойСверхЗаказа) <= ОстатокПредоплаты
		|									ТОГДА (СуммаНакладной + СуммаНакладнойСверхЗаказа)
		|								КОГДА ВсегоОплачено * (СуммаНакладной + СуммаНакладнойСверхЗаказа) / ПланОплатыВсего <= (СуммаНакладной + СуммаНакладнойСверхЗаказа) 
		|									И ПланОплатыВсего <= ОстатокПредоплаты
		|									ТОГДА ПланОплатыВсего
		|								ИНАЧЕ ОстатокПредоплаты
		|							КОНЕЦ
		|				КОНЕЦ 
		|		//На остатке есть требуемая предоплата для текущей накладной
		|		КОГДА ТребуемаяПредоплата + ТребуемаяПредоплатаСверхЗаказа > 0 И ОстатокПредоплаты >= ТребуемаяПредоплата + ТребуемаяПредоплатаСверхЗаказа
		|			ТОГДА ТребуемаяПредоплата + ТребуемаяПредоплатаСверхЗаказа
		|		КОГДА ТребуемаяПредоплата > 0 И ОстатокПредоплаты >= ТребуемаяПредоплата
		|			ТОГДА ТребуемаяПредоплата
		|		//Если требуемая предоплата не заполнена, рассчитаем сумму предоплаты по плановым оплатам
		|		КОГДА ОстатокПредоплаты >= ВЫРАЗИТЬ((СуммаНакладной + СуммаНакладнойСверхЗаказа) * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|			ТОГДА ВЫРАЗИТЬ((СуммаНакладной + СуммаНакладнойСверхЗаказа) * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|		КОГДА ОстатокПредоплаты >= ВЫРАЗИТЬ(СуммаНакладной * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|			ТОГДА ВЫРАЗИТЬ(СуммаНакладной * ВЫРАЗИТЬ(ПланПредоплаты / ПланОплатыВсего КАК ЧИСЛО(31,10)) КАК ЧИСЛО(31,2))
		|		ИНАЧЕ 0
		|	КОНЕЦ > 0
		|");
		Запрос.УстановитьПараметр("МассивОбъектов", Договор);
		Запрос.УстановитьПараметр("Заказ", Заказ);
		Запрос.УстановитьПараметр("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
		ВариантыПредоплаты = Новый Массив;
		Если ЭтоРасчетыСКлиентами Тогда
			ВариантыПредоплаты.Добавить(Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения);
			ВариантыПредоплаты.Добавить(Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки);
		Иначе
			ВариантыПредоплаты.Добавить(Перечисления.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения);
			ВариантыПредоплаты.Добавить(Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВариантыПредоплаты", ВариантыПредоплаты);
		Запрос.Текст = СтрСоединить(ТекстыЗапросов);
		Если НЕ ЭтоРасчетыСКлиентами Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,".РасчетыСКлиентами",".РасчетыСПоставщиками");
		КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			МаксимальнаяСуммаЗачета = МаксимальнаяСуммаЗачета - Выборка.ОплатаПоНакладной;
		КонецЕсли;
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			Если МаксимальнаяСуммаЗачета <= 0 Тогда
				Продолжить;
			КонецЕсли;
			ЗачтенАванс = Истина;
			НовСтр = РасшифровкаПлатежа.Добавить();
			НовСтр.ОбъектРасчетов = Выборка.ОбъектРасчетов;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр,"ВалютаВзаиморасчетов") Тогда
				НовСтр.ВалютаВзаиморасчетов = Выборка.ВалютаВзаиморасчетов;
			КонецЕсли;
			НовСтр.СуммаВзаиморасчетов = Мин(Выборка.Сумма, МаксимальнаяСуммаЗачета);
			НовСтр.Сумма = Мин(Выборка.Сумма, МаксимальнаяСуммаЗачета);
			Уменьшить = НовСтр.СуммаВзаиморасчетов;
			Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
				Если Уменьшить > 0
					И (Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов)
						Или СтрокаРасшифровки.ОбъектРасчетов = ОбъектРасчетовНакладная) Тогда
					СтрокаРасшифровки.СуммаВзаиморасчетов = СтрокаРасшифровки.СуммаВзаиморасчетов - Мин(СтрокаРасшифровки.СуммаВзаиморасчетов, Уменьшить);
					СтрокаРасшифровки.Сумма = СтрокаРасшифровки.СуммаВзаиморасчетов;
					Уменьшить = Уменьшить - СтрокаРасшифровки.СуммаВзаиморасчетов;
				КонецЕсли;
			КонецЦикла;
			МаксимальнаяСуммаЗачета = МаксимальнаяСуммаЗачета - НовСтр.Сумма;
		КонецЦикла;
		Индекс = РасшифровкаПлатежа.Количество();
		Пока Индекс > 0 Цикл
			Индекс = Индекс - 1;
			Если РасшифровкаПлатежа[Индекс].СуммаВзаиморасчетов = 0 Тогда
				РасшифровкаПлатежа.Удалить(Индекс);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным И ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) Тогда
		
		ТЧЭтапыОплаты = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
		
		СуммаПредоплаты = 0;
		Для Каждого СтрокаЭтапаОплаты Из ТЧЭтапыОплаты Цикл
			Если СтрокаЭтапаОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения
				Или СтрокаЭтапаОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки
				Или СтрокаЭтапаОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения
				Или СтрокаЭтапаОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления Тогда
				СуммаПредоплаты = СуммаПредоплаты + СтрокаЭтапаОплаты.СуммаВзаиморасчетов;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаЭтапаОплаты, "СуммаВзаиморасчетовПоТаре") Тогда
					СуммаПредоплаты = СуммаПредоплаты + СтрокаЭтапаОплаты.СуммаВзаиморасчетовПоТаре;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Если Не НоваяАрхитектураВзаиморасчетов Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ВЫБОР
		|		КОГДА &ЭтоРасчетыСКлиентами
		|			ТОГДА -Расчеты.СуммаОстаток
		|		ИНАЧЕ Расчеты.СуммаОстаток
		|	КОНЕЦ КАК ОстатокПредоплаты
		|ПОМЕСТИТЬ ВтРасчеты
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(, ОбъектРасчетов.Объект = &Договор) КАК Расчеты
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Расчеты.ОстатокПредоплаты >= &СуммаПредоплаты
		|			ТОГДА &СуммаПредоплаты
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Сумма,
		|	0 КАК ОплатаПоНакладной,
		|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
		|	Расчеты.ОбъектРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
		|ИЗ
		|	ВтРасчеты КАК Расчеты
		|ГДЕ
		|	ВЫБОР
		|		КОГДА Расчеты.ОстатокПредоплаты >= &СуммаПредоплаты
		|			ТОГДА &СуммаПредоплаты
		|		ИНАЧЕ 0
		|	КОНЕЦ > 0";
		Иначе
			Запрос.Текст = "
				|ВЫБРАТЬ
				|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
				|	&СуммаПредоплаты КАК Сумма,
				|	ЕСТЬNULL(МАКСИМУМ(РасчетыПоНакладной.ПредоплатаОстаток), 0) КАК ОплатаПоНакладной,
				|	Расчеты.ОбъектРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
				|ИЗ
				|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(, ОбъектРасчетов.Объект = &Договор) КАК Расчеты
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(, ОбъектРасчетов.Объект = &СсылкаНаНакладную) КАК РасчетыПоНакладной
				|		ПО (ИСТИНА)
				|ГДЕ
				|	Расчеты.ДатаВозникновения <= &ДатаНакладной
				|
				|СГРУППИРОВАТЬ ПО
				|	Расчеты.ОбъектРасчетов,
				|	Расчеты.ОбъектРасчетов.ВалютаВзаиморасчетов
				|
				|ИМЕЮЩИЕ
				|	ВЫБОР
				|		КОГДА СУММА(Расчеты.ПредоплатаОстаток) >= &СуммаПредоплаты
				|			ТОГДА &СуммаПредоплаты
				|		ИНАЧЕ 0
				|	КОНЕЦ > 0
				|";
			Запрос.УстановитьПараметр("ДатаНакладной", ДатаНакладной);
		КонецЕсли;
		Запрос.УстановитьПараметр("Договор", Договор);
		Запрос.УстановитьПараметр("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
		Запрос.УстановитьПараметр("СуммаПредоплаты", СуммаПредоплаты);
		Запрос.УстановитьПараметр("СсылкаНаНакладную", СсылкаНаНакладную);
		Если НЕ ЭтоРасчетыСКлиентами Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,".РасчетыСКлиентами",".РасчетыСПоставщиками");
		КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			МаксимальнаяСуммаЗачета = МаксимальнаяСуммаЗачета - Выборка.ОплатаПоНакладной;
		КонецЕсли;
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			Если МаксимальнаяСуммаЗачета <= 0 Тогда
				Продолжить;
			КонецЕсли;
			ЗачтенАванс = Истина;
			НовСтр = РасшифровкаПлатежа.Добавить();
			НовСтр.ОбъектРасчетов = Выборка.ОбъектРасчетов;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр,"ВалютаВзаиморасчетов") Тогда
				НовСтр.ВалютаВзаиморасчетов = Выборка.ВалютаВзаиморасчетов;
			КонецЕсли;
			НовСтр.СуммаВзаиморасчетов = Мин(Выборка.Сумма, МаксимальнаяСуммаЗачета);
			НовСтр.Сумма = Мин(Выборка.Сумма, МаксимальнаяСуммаЗачета);
			Уменьшить = НовСтр.СуммаВзаиморасчетов;
			Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
				Если Уменьшить > 0
					И (Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов)
						Или СтрокаРасшифровки.ОбъектРасчетов = ОбъектРасчетовНакладная) Тогда
					СтрокаРасшифровки.СуммаВзаиморасчетов = СтрокаРасшифровки.СуммаВзаиморасчетов - Мин(СтрокаРасшифровки.СуммаВзаиморасчетов, Уменьшить);
					СтрокаРасшифровки.Сумма = СтрокаРасшифровки.СуммаВзаиморасчетов;
					Уменьшить = Уменьшить - СтрокаРасшифровки.СуммаВзаиморасчетов;
				КонецЕсли;
			КонецЦикла;
			МаксимальнаяСуммаЗачета = МаксимальнаяСуммаЗачета - НовСтр.Сумма;
		КонецЦикла;
		Индекс = РасшифровкаПлатежа.Количество();
		Пока Индекс > 0 Цикл
			Индекс = Индекс - 1;
			Если РасшифровкаПлатежа[Индекс].СуммаВзаиморасчетов = 0 Тогда
				РасшифровкаПлатежа.Удалить(Индекс);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗачтенАванс Тогда
		СуммыДокумента = ВзаиморасчетыСлужебный.СуммыДокумента(Объект, СтруктураПараметров);
		СуммаДокумента = СуммыДокумента.СуммаЗалогаЗаТару + СуммыДокумента.СуммаДокументаБезЗалога;
		СуммаВзаиморасчетов = СуммыДокумента.СуммаВзаиморасчетовБезЗалога + СуммыДокумента.СуммаВзаиморасчетовПоТаре;
		ВзаиморасчетыСервер.ЗаполнитьСуммыРасшифровкиНакладной(СуммаДокумента, СуммаВзаиморасчетов, РасшифровкаПлатежа, ОбъектРасчетовНакладная);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаОстатковПредоплаты(ЭтоРасчетыСКлиентами)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Расчеты.ОбъектРасчетов                                      КАК ОбъектРасчетов,
	|	Расчеты.ОбъектРасчетов.Объект                               КАК Объект,
	|	СУММА(Расчеты.ОстатокПредоплаты)                            КАК ОстатокПредоплаты,
	|	СУММА(Расчеты.ПланОплатыВсего)                              КАК ПланОплатыВсего,
	|	СУММА(Расчеты.ПланПредоплаты)                               КАК ПланПредоплаты,
	|	СУММА(Расчеты.ВсегоОплачено)                                КАК ВсегоОплачено,
	|	ЕСТЬNULL(МАКСИМУМ(РасчетыПоНакладной.ПредоплатаОстаток), 0) КАК ОплатаПоНакладной,
	|	ВтСуммаНакладной.СуммаНакладной                             КАК СуммаНакладной,
	|	ВтСуммаНакладной.ТребуемаяПредоплата                        КАК ТребуемаяПредоплата,
	|	ВтСуммаНакладнойСверхЗаказа.СуммаНакладной                  КАК СуммаНакладнойСверхЗаказа,
	|	ВтСуммаНакладнойСверхЗаказа.ТребуемаяПредоплата             КАК ТребуемаяПредоплатаСверхЗаказа
	|ПОМЕСТИТЬ ВтРасчеты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиПоСрокам.ОбъектРасчетов    КАК ОбъектРасчетов,
	|		ОстаткиПоСрокам.ПредоплатаОстаток КАК ОстатокПредоплаты,
	|		0                                 КАК ПланОплатыВсего,
	|		0                                 КАК ПланПредоплаты,
	|		0                                 КАК ВсегоОплачено
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(, ОбъектРасчетов.Объект В (&Объекты)) КАК ОстаткиПоСрокам
	|	ГДЕ
	|		ОстаткиПоСрокам.ДатаВозникновения <= &ДатаНакладной
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПланОплат.ОбъектРасчетов          КАК ОбъектРасчетов,
	|		0                                 КАК ОстатокПредоплаты,
	|		ПланОплат.КОплате                 КАК ПланОплатыВсего,
	|		ВЫБОР
	|			КОГДА ПланОплат.ВариантОплаты В (&ВариантыПредоплаты)
	|				ТОГДА ПланОплат.КОплате
	|			ИНАЧЕ 0
	|		КОНЕЦ                             КАК ПланПредоплаты,
	|		0                                 КАК ВсегоОплачено
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПланОплат КАК ПланОплат
	|	ГДЕ
	|		ПланОплат.Регистратор В(&ДокументыПлана)
	|		И ПланОплат.Активность
	|		И ПланОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоСрокам.ОбъектРасчетов    КАК ОбъектРасчетов,
	|		0                                 КАК ОстатокПредоплаты,
	|		0                                 КАК ПланОплатыВсего,
	|		0                                 КАК ПланПредоплаты,
	|		&ШаблонПоляОплачено               КАК ВсегоОплачено
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
	|	ГДЕ
	|		РасчетыПоСрокам.ОбъектРасчетов.Объект В (&Объекты)
	|		И РасчетыПоСрокам.ДатаВозникновения <= &ДатаНакладной
	|		И РасчетыПоСрокам.Активность) КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммаНакладной КАК ВтСуммаНакладной
	|		ПО НЕ ВтСуммаНакладной.СверхЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммаНакладной КАК ВтСуммаНакладнойСверхЗаказа
	|		ПО ВтСуммаНакладнойСверхЗаказа.СверхЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(, ОбъектРасчетов.Объект = &СсылкаНаНакладную) КАК РасчетыПоНакладной
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.ОбъектРасчетов,
	|	ВтСуммаНакладной.СуммаНакладной,
	|	ВтСуммаНакладнойСверхЗаказа.СуммаНакладной,
	|	ВтСуммаНакладной.ТребуемаяПредоплата,
	|	ВтСуммаНакладнойСверхЗаказа.ТребуемаяПредоплата
	|ИМЕЮЩИЕ 
	|	СУММА(Расчеты.ОстатокПредоплаты) > 0
	|	И СУММА(Расчеты.ПланПредоплаты) > 0
	|;";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ШаблонПоляОплачено", ?(ЭтоРасчетыСКлиентами, ШаблонПоляОплаченоКлиентом(), ШаблонПоляОплаченоПоставщику()));
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Проведение

// Устарела. Функция получает временные таблицы курсов валют и направлений деятельности.
// 
// Параметры:
//  ТекстЗапросаИсходнойТаблицы - Строка - Текст запроса с данными об объектах расчетов, валютах, датах курса
//  ЭтоОперацияОплаты - Булево - Значение по умолчанию Ложь, Истина для операций оплаты и возврата оплаты
// 
// Возвращаемое значение:
//  Строка - Текст запроса с созданными временными таблицами ВтКоэффициентыПересчетаВалют и ВтНаправленияДеятельности
Функция ПолучитьТаблицуКурсовВалютНаправленийДеятельности(ТекстЗапросаИсходнойТаблицы, ЭтоОперацияОплаты = Ложь) Экспорт
	
	Возврат ВзаиморасчетыПроведение.ПолучитьТаблицуКурсовВалютНаправленийДеятельности(ТекстЗапросаИсходнойТаблицы, ЭтоОперацияОплаты);
	
КонецФункции

// Устарела. Функция получает временную таблицу направлений деятельности.
// 
// Параметры:
//  ТекстЗапросаИсходнойТаблицы - Строка - Текст запроса с данными об объектах расчетов, валютах, датах курса
// 
// Возвращаемое значение:
//  Строка - Текст запроса с созданной временной таблицей ВтНаправленияДеятельности
Функция ПолучитьТаблицуНаправленийДеятельности(ТекстЗапросаИсходнойТаблицы) Экспорт
	
	Возврат ВзаиморасчетыПроведение.ПолучитьТаблицуНаправленийДеятельности(ТекстЗапросаИсходнойТаблицы);
	
КонецФункции

// Устарела. Текст вт переноса расчетов.
// 
// Параметры:
//  ИмяТаблицы - Строка - Имя таблицы
// 
// Возвращаемое значение:
//  Строка - Текст вт переноса расчетов
Функция ТекстВтПереносаРасчетов(ИмяТаблицы = "") Экспорт
	
	Возврат ВзаиморасчетыПроведение.ТекстВтПереносаРасчетов(ИмяТаблицы);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
