#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийБСП
// Обработка программных событий, возникающих в подсистемах БСП.
// Только для вызовов из библиотеки БСП в БТС.

// Определяет события, на которые подписана эта библиотека.
//
// Параметры:
//  Подписки - Структура - Ключами свойств структуры являются имена событий, на которые
//           подписана эта библиотека.
//
Процедура ПриОпределенииПодписокНаСобытияБСП(Подписки) Экспорт

    // БазоваяФункциональность
	Подписки.ПриДобавленииОбработчиковУстановкиПараметровСеанса = Истина;
	Подписки.ПриДобавленииИсключенийПоискаСсылок = Истина;
	Подписки.ПриОтправкеДанныхГлавному = Истина;
	Подписки.ПриОтправкеДанныхПодчиненному = Истина;
	Подписки.ПриПолученииДанныхОтГлавного = Истина;
	Подписки.ПриПолученииДанныхОтПодчиненного = Истина;
	Подписки.ПриВключенииРазделенияПоОбластямДанных = Истина;
	Подписки.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов = Истина;
	Подписки.ПриДобавленииПараметровРаботыКлиентаПриЗапуске = Истина;
	Подписки.ПриДобавленииПараметровРаботыКлиента = Истина;
	Подписки.ПриДобавленииПодсистем = Истина;

	// ГрупповоеИзменениеОбъектов
	Подписки.ПриОпределенииОбъектовСРедактируемымиРеквизитами = Истина;

	// ДополнительныеОтчетыИОбработки
	Подписки.ПриУстановкеРежимаПодключенияДополнительногоОтчетаИлиОбработкиВОбластиДанных = Истина;

	// ЗагрузкаДанныхИзФайла
	Подписки.ПриОпределенииСправочниковДляЗагрузкиДанных = Истина;

	// ИнтерфейсOData
	Подписки.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузкиOData = Истина;

	// Пользователи
	Подписки.ПриЗавершенииОбработкиПользователяИБ = Истина;

	// ПрофилиБезопасности
	Подписки.ПриПроверкеВозможностиНастройкиПрофилейБезопасности = Истина;
	Подписки.ПриЗапросеРазрешенийНаИспользованиеВнешнихРесурсов = Истина;
	Подписки.ПриЗапросеСозданияПрофиляБезопасности = Истина;
	Подписки.ПриЗапросеУдаленияПрофиляБезопасности = Истина;
	Подписки.ПриПодключенииВнешнегоМодуля = Истина;

	// РегламентныеЗадания
	Подписки.ПриОпределенииНастроекРегламентныхЗаданий = Истина;
	
	// УправлениеДоступом
	Подписки.ПриЗаполненииПоставляемыхПрофилейГруппДоступа = Истина;
	
	Подписки.ПриПолученииПриоритетаОбновления = Истина;
	
	Подписки.ПередЗапускомПрограммы = Истина;
	
КонецПроцедуры

#Область БазоваяФункциональность

// См. ОбщегоНазначенияПереопределяемый.ПередЗапускомПрограммы
Процедура ПередЗапускомПрограммы() Экспорт
	
	ПроверитьВозможностьЗапускаПрограммы();

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.РезервноеКопированиеОбластейДанных") Тогда
		МодульРезервноеКопированиеОбластейДанных = ОбщегоНазначения.ОбщийМодуль("РезервноеКопированиеОбластейДанных");
		МодульРезервноеКопированиеОбластейДанных.УстановитьФлагАктивностиПользователяВОбласти();
	КонецЕсли;
	
	РаботаВМоделиСервиса.УстановитьФлагАктивностиПользователяВОбласти();

КонецПроцедуры

// См. ПодсистемыКонфигурацииПереопределяемый.ПриДобавленииПодсистем
// 
// Параметры:
// 	МодулиПодсистем - Массив из Строка - имена модулей.
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт

	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБТС");

КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("МаркерыБезопасности", "ЭлектроннаяПодписьВМоделиСервиса.УстановкаПараметровСеанса");
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииИсключенийПоискаСсылок
Процедура ПриДобавленииИсключенийПоискаСсылок(ИсключенияПоискаСсылок) Экспорт

	ДополнительныеОтчетыИОбработкиВМоделиСервиса.ПриДобавленииИсключенийПоискаСсылок(ИсключенияПоискаСсылок);
	РасширенияВМоделиСервиса.ПриДобавленииИсключенийПоискаСсылок(ИсключенияПоискаСсылок);

КонецПроцедуры

// См. ПриОтправкеДанныхГлавному в синтаксис-помощнике
// 
// Параметры:
//  ЭлементДанных - Произвольный - объект базы данных
//  ОтправкаЭлемента - ОтправкаЭлементаДанных
//  Получатель - ПланОбменаСсылка
Процедура ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента, Получатель) Экспорт

	ДополнительныеОтчетыИОбработкиВАвтономномРежиме.ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента, Получатель);

КонецПроцедуры

// См. ПриОтправкеДанныхПодчиненному в синтаксис-помощнике
// 
// Параметры:
//  ЭлементДанных - Произвольный - объект базы данных
//  ОтправкаЭлемента - ОтправкаЭлементаДанных
//  СозданиеНачальногоОбраза - Булево
//  Получатель - ПланОбменаСсылка
Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза, Получатель) Экспорт

	ДополнительныеОтчетыИОбработкиВАвтономномРежиме.ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза, Получатель);

КонецПроцедуры

// См. ПриПолученииДанныхОтГлавного в синтаксис-помощнике
// 
// Параметры:
//  ЭлементДанных - Произвольный - объект базы данных
//  ПолучениеЭлемента - ПолучениеЭлементаДанных
//  ОтправкаНазад - Булево
//  Отправитель - ПланОбменаСсылка
Процедура ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель) Экспорт

	ДополнительныеОтчетыИОбработкиВАвтономномРежиме.ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель);

КонецПроцедуры

// См. ПриПолученииДанныхОтПодчиненного в синтаксис-помощнике
// 
// Параметры:
//  ЭлементДанных - Произвольный - объект базы данных
//  ПолучениеЭлемента - ПолучениеЭлементаДанных
//  ОтправкаНазад - Булево
//  Отправитель - ПланОбменаСсылка
Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель) Экспорт

	ДополнительныеОтчетыИОбработкиВАвтономномРежиме.ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель);

КонецПроцедуры

// См. РаботаВМоделиСервисаПереопределяемый.ПриВключенииРазделенияПоОбластямДанных
Процедура ПриВключенииРазделенияПоОбластямДанных() Экспорт

	ОчередьЗаданийСлужебный.ПриВключенииРазделенияПоОбластямДанных();
	ОчередьЗаданийСлужебныйРазделениеДанных.ПриВключенииРазделенияПоОбластямДанных();
	РаботаВМоделиСервиса.ПриВключенииРазделенияПоОбластямДанных();
	ТехнологияСервиса.ПриВключенииРазделенияПоОбластямДанных();
	РаботаВМоделиСервисаБТС.ПриВключенииРазделенияПоОбластямДанных();

КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов
// Параметры:
//  СтруктураПоддерживаемыхВерсий - Структура - в ключе указывается имя программного интерфейса,
//                                     а в значениях - массив строк с поддерживаемыми версиями этого интерфейса.
Процедура ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(Знач СтруктураПоддерживаемыхВерсий) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	КонецЕсли;

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	УдаленноеАдминистрированиеБТССлужебный.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	ЭлектроннаяПодписьВМоделиСервиса.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ПередачаДанных") Тогда
		МодульПередачаДанныхСлужебный = ОбщегоНазначения.ОбщийМодуль("ПередачаДанныхСлужебный");
		МодульПередачаДанныхСлужебный.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	КонецЕсли;

	ИнтерфейсыСообщенийВМоделиСервиса.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	ОбменСообщениямиВнутренний.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	РезервноеКопированиеОбластейДанных.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);

	МассивВерсий = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("1.0.0.1");
	СтруктураПоддерживаемыхВерсий.Вставить("ЗагрузкаДанныхВСуществующуюОбласть", МассивВерсий);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.СводныеПриложения") Тогда
		МодульСводныеПриложения = ОбщегоНазначения.ОбщийМодуль("СводныеПриложения");
		МодульСводныеПриложения.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	КонецЕсли;
	
	ВидыПриложенийСлужебный.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	
КонецПроцедуры

// См. СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске
// Параметры:
//   Параметры - Структура - имена и значения параметров работы клиента при запуске, которые необходимо задать.
Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт

	РаботаВМоделиСервиса.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОплатаСервиса") Тогда
		МодульОплатаСервиса = ОбщегоНазначения.ОбщийМодуль("ОплатаСервиса");
		МодульОплатаСервиса.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
	КонецЕсли;
	
	МиграцияПриложений.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
	ВыгрузкаЗагрузкаДанныхСлужебный.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
	ВидыПриложенийСлужебный.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
	
КонецПроцедуры

// См. СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента
// 
// Параметры:
//   Параметры - Структура - имена и значения параметров работы клиента при запуске, которые необходимо задать.
Процедура ПриДобавленииПараметровРаботыКлиента(Параметры) Экспорт

	ЭлектроннаяПодписьВМоделиСервиса.ПриДобавленииПараметровРаботыКлиента(Параметры);
	РаботаВМоделиСервиса.ПриДобавленииПараметровРаботыКлиента(Параметры);
	РезервноеКопированиеОбластейДанных.ПриДобавленииПараметровРаботыКлиента(Параметры);
	ВидыПриложенийСлужебный.ПриДобавленииПараметровРаботыКлиента(Параметры);

КонецПроцедуры

#КонецОбласти

#Область ГрупповоеИзменениеОбъектов

// См. ГрупповоеИзменениеОбъектовПереопределяемый.ПриОпределенииОбъектовСРедактируемымиРеквизитами
// 
// Параметры:
//  Объекты - Соответствие из КлючИЗначение
Процедура ПриОпределенииОбъектовСРедактируемымиРеквизитами(Объекты) Экспорт

	ОбменСообщениямиВнутренний.ПриОпределенииОбъектовСРедактируемымиРеквизитами(Объекты);

КонецПроцедуры

#КонецОбласти

#Область ДополнительныеОтчетыИОбработки

// Устарела.
Процедура ПриУстановкеРежимаПодключенияДополнительногоОтчетаИлиОбработкиВОбластиДанных(ПоставляемаяОбработка,
		РежимРаботы) Экспорт

	Возврат;

КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИзФайла

// См. ЗагрузкаДанныхИзФайлаПереопределяемый.ПриОпределенииСправочниковДляЗагрузкиДанных
// 
// Параметры:
//  ЗагружаемыеСправочники - ТаблицаЗначений
Процедура ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники) Экспорт

	ОчередьЗаданийСлужебный.ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники);
	РаботаВМоделиСервиса.ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОповещениеПользователейБТС") Тогда
		МодульОповещениеПользователейБТС = ОбщегоНазначения.ОбщийМодуль("ОповещениеПользователейБТС");
		МодульОповещениеПользователейБТС.ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсOData

// См. ИнтеграцияПодсистемБСП.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузкиOData
// 
// Параметры:
//  Типы - Массив из ОбъектМетаданных - объекты метаданных, исключаемые из выгрузки и загрузки.
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузкиOData(Типы) Экспорт
	
	ОписанияТипов = Новый Массив();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда

		МодульРаботаВБезопасномРежимеСлужебныйВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежимеСлужебныйВМоделиСервиса");
		МодульРаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);

		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		МодульРаботаВМоделиСервиса.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);

	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ЦентрКонтроляКачества") Тогда
		МодульИнцидентыЦККСервер = ОбщегоНазначения.ОбщийМодуль("ИнцидентыЦККСервер");
		МодульИнцидентыЦККСервер.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.УправлениеТарифами") Тогда
		МодульТарификация = ОбщегоНазначения.ОбщийМодуль("Тарификация");
		МодульТарификация.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ПроверкаИКорректировкаДанных") Тогда
		МодульПроверкаИКорректировкаДанных = ОбщегоНазначения.ОбщийМодуль("ПроверкаИКорректировкаДанных");
		МодульПроверкаИКорректировкаДанных.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.МиграцияПриложений") Тогда
		МодульМиграцияПриложений = ОбщегоНазначения.ОбщийМодуль("МиграцияПриложений");
		МодульМиграцияПриложений.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОчередьЗаданийВнешнийИнтерфейс") Тогда
		МодульОчередьЗаданийВнешнийИнтерфейс = ОбщегоНазначения.ОбщийМодуль("ОчередьЗаданийВнешнийИнтерфейс");
		МодульОчередьЗаданийВнешнийИнтерфейс.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнтеграцияОбъектовОбластейДанных") Тогда
		МодульИнтеграцияОбъектовОбластейДанных = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияОбъектовОбластейДанных");
		МодульИнтеграцияОбъектовОбластейДанных.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОбменСообщениями") Тогда
		МодульОбменСообщениямиВнутренний = ОбщегоНазначения.ОбщийМодуль("ОбменСообщениямиВнутренний");
		МодульОбменСообщениямиВнутренний.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОчередьЗаданий") Тогда
		МодульОчередьЗаданийСлужебныйРазделениеДанных = ОбщегоНазначения.ОбщийМодуль("ОчередьЗаданийСлужебныйРазделениеДанных");
		МодульОчередьЗаданийСлужебныйРазделениеДанных.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.РезервноеКопированиеОбластейДанных") Тогда
		МодульРезервноеКопированиеОбластейДанных = ОбщегоНазначения.ОбщийМодуль("РезервноеКопированиеОбластейДанных");
		МодульРезервноеКопированиеОбластейДанных.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ВыгрузкаЗагрузкаДанных") Тогда
		МодульВыгрузкаЗагрузкаДанныхПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ВыгрузкаЗагрузкаДанныхПереопределяемый");
		МодульВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ПоставляемыеДанные") Тогда
		МодульПоставляемыеДанные = ОбщегоНазначения.ОбщийМодуль("ПоставляемыеДанные");
		МодульПоставляемыеДанные.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.РасширенияВМоделиСервиса") Тогда
		МодульРасширенияВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РасширенияВМоделиСервиса");
		МодульРасширенияВМоделиСервиса.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ФайлыОбластейДанных") Тогда
		МодульФайлыОбластейДанных = ОбщегоНазначения.ОбщийМодуль("ФайлыОбластейДанных");
		МодульФайлыОбластейДанных.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОповещениеПользователейБТС") Тогда
		МодульОповещениеПользователейБТС = ОбщегоНазначения.ОбщийМодуль("ОповещениеПользователейБТС");
		МодульОповещениеПользователейБТС.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		Типы,
		ВыгрузкаЗагрузкаДанныхСлужебныйСобытия.ТипыИзОписанийТипов(ОписанияТипов));
	
КонецПроцедуры

#КонецОбласти

#Область Пользователи

// См. ПользователиСлужебныйВМоделиСервиса.ПриЗавершенииОбработкиПользователяИБ
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
Процедура ПриЗавершенииОбработкиПользователяИБ(Пользователь) Экспорт

	РаботаВМоделиСервисаПереопределяемый.УстановитьПраваПоУмолчанию(Пользователь);

КонецПроцедуры

#КонецОбласти

#Область ПрофилиБезопасности

// См. РаботаВБезопасномРежимеПереопределяемый.ПриПроверкеВозможностиНастройкиПрофилейБезопасности
Процедура ПриПроверкеВозможностиНастройкиПрофилейБезопасности(Отказ) Экспорт

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриПроверкеВозможностиНастройкиПрофилейБезопасности(Отказ);

КонецПроцедуры

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗапросеРазрешенийНаИспользованиеВнешнихРесурсов
Процедура ПриЗапросеРазрешенийНаИспользованиеВнешнихРесурсов(Знач ПрограммныйМодуль,
		Знач Владелец, Знач РежимЗамещения, Знач ДобавляемыеРазрешения,
		Знач УдаляемыеРазрешения, СтандартнаяОбработка, Результат) Экспорт

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриЗапросеРазрешенийНаИспользованиеВнешнихРесурсов(ПрограммныйМодуль, Владелец, РежимЗамещения, ДобавляемыеРазрешения, УдаляемыеРазрешения, СтандартнаяОбработка, Результат);

КонецПроцедуры

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗапросеСозданияПрофиляБезопасности
Процедура ПриЗапросеСозданияПрофиляБезопасности(Знач ПрограммныйМодуль,
		СтандартнаяОбработка, Результат) Экспорт

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриЗапросеСозданияПрофиляБезопасности(ПрограммныйМодуль, СтандартнаяОбработка, Результат);

КонецПроцедуры

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗапросеУдаленияПрофиляБезопасности
Процедура ПриЗапросеУдаленияПрофиляБезопасности(Знач ПрограммныйМодуль,
		СтандартнаяОбработка, Результат) Экспорт

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриЗапросеУдаленияПрофиляБезопасности(ПрограммныйМодуль, СтандартнаяОбработка, Результат);

КонецПроцедуры

// См. РаботаВБезопасномРежимеПереопределяемый.ПриПодключенииВнешнегоМодуля
Процедура ПриПодключенииВнешнегоМодуля(Знач ВнешнийМодуль,
		БезопасныйРежим) Экспорт

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриПодключенииВнешнегоМодуля(ВнешнийМодуль, БезопасныйРежим);

КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.МиграцияПриложений") Тогда
		МодульМиграцияПриложений = ОбщегоНазначения.ОбщийМодуль("МиграцияПриложений");
		МодульМиграцияПриложений.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.УправлениеТарифами") Тогда
		МодульТарификация = ОбщегоНазначения.ОбщийМодуль("Тарификация");
		МодульТарификация.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ЦентрКонтроляКачества") Тогда
		МодульИнцидентыЦККСервер = ОбщегоНазначения.ОбщийМодуль("ИнцидентыЦККСервер");
		МодульИнцидентыЦККСервер.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОповещениеПользователейБТС") Тогда
		МодульОповещениеПользователейБТС = ОбщегоНазначения.ОбщийМодуль("ОповещениеПользователейБТС");
		МодульОповещениеПользователейБТС.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеВерсииИБ

// См. ИнтеграцияПодсистемБСП.ПриПолученииПриоритетаОбновления.
Процедура ПриПолученииПриоритетаОбновления(Приоритет) Экспорт
	
	ПриоритетОбработкаДанных = "ОбработкаДанных";
	
	Если Приоритет = ПриоритетОбработкаДанных Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Константы.УстанавливатьПриоритетОбработкиДанныхВУказанномИнтервалеВремени.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеТиповВремя = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Время);
	ТекущееУниверсальноеВремя = ОписаниеТиповВремя.ПривестиЗначение(ТекущаяУниверсальнаяДата());
	
	НачалоИнтервалаВремениПриоритетаОбработкиДанных = Константы.НачалоИнтервалаВремениПриоритетаОбработкиДанных.Получить();
	ОкончаниеИнтервалаВремениПриоритетаОбработкиДанных = Константы.ОкончаниеИнтервалаВремениПриоритетаОбработкиДанных.Получить();
	
	Если ОкончаниеИнтервалаВремениПриоритетаОбработкиДанных > НачалоИнтервалаВремениПриоритетаОбработкиДанных Тогда
		Если ТекущееУниверсальноеВремя >= НачалоИнтервалаВремениПриоритетаОбработкиДанных 
			И ТекущееУниверсальноеВремя <= ОкончаниеИнтервалаВремениПриоритетаОбработкиДанных Тогда
			Приоритет = ПриоритетОбработкаДанных;
		КонецЕсли;
	Иначе
		Если ТекущееУниверсальноеВремя <= ОкончаниеИнтервалаВремениПриоритетаОбработкиДанных 
			Или ТекущееУниверсальноеВремя >= НачалоИнтервалаВремениПриоритетаОбработкиДанных Тогда
			Приоритет = ПриоритетОбработкаДанных;
		КонецЕсли;	 
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// События, на которые могут подписаться другие библиотеки.
// 
// Возвращаемое значение:
//  Структура - имена событий, на которые могут быть подписаны библиотеки:
// * ПриДобавленииОбработчиковОбновленияБТС - Булево 
// * ПриЗаполненииИсключенийОчисткиДанныхИБ - Булево 
// * ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке - Булево 
// * ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке - Булево 
// * ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке - Булево 
// * ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки - Булево 
// * ПриРегистрацииОбработчиковВыгрузкиДанных - Булево 
// * ПриРегистрацииОбработчиковЗагрузкиДанных - Булево 
// * ПередВыгрузкойДанных - Булево 
// * ПослеВыгрузкиДанных - Булево 
// * ПередЗагрузкойДанных - Булево 
// * ПослеЗагрузкиДанных - Булево 
// * ПриЗагрузкеПользователяИнформационнойБазы - Булево 
// * ПослеЗагрузкиПользователяИнформационнойБазы - Булево 
// * ПослеЗагрузкиПользователейИнформационнойБазы - Булево 
// * ПриЗаполненииТаблицыПараметровИБ - Булево 
// * ПриОпределенииПсевдонимаПользователя - Булево 
// * ПриОпределенииИсключенийНеразделенныхДанных - Булево 
// * ПриУстановкеЗначенийПараметровИБ - Булево 
// * ПриОбновленииПараметровТекущейОбластиДанных - Булево 
// * ПриОпределенииОбработчиковКаналовСообщений - Булево 
// * РегистрацияИнтерфейсовПринимаемыхСообщений - Булево 
// * РегистрацияИнтерфейсовОтправляемыхСообщений - Булево 
// * ПриОпределенииВерсииИнтерфейсаКорреспондента - Булево 
// * ПриПолученииСпискаШаблонов - Булево 
// * ПриОпределенииПсевдонимовОбработчиков - Булево 
// * ПриОпределенииОбработчиковОшибок - Булево 
// * ПриОпределенииИспользованияРегламентныхЗаданий - Булево 
// * ПриОпределенииОбработчиковПоставляемыхДанных - Булево 
// * ПриФормированииСпискаУслуг - Булево 
Функция СобытияБТС() Экспорт

	События = Новый Структура;

	// БазоваяФункциональность
	События.Вставить("ПриДобавленииОбработчиковОбновленияБТС", Ложь);
	События.Вставить("ПриЗаполненииИсключенийОчисткиДанныхИБ", Ложь);

	// ВыгрузкаЗагрузкаДанных
	События.Вставить("ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке", Ложь);
	События.Вставить("ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке", Ложь);
	События.Вставить("ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке", Ложь);
	События.Вставить("ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки", Ложь);
	События.Вставить("ПриРегистрацииОбработчиковВыгрузкиДанных", Ложь);
	События.Вставить("ПриРегистрацииОбработчиковЗагрузкиДанных", Ложь);
	События.Вставить("ПередВыгрузкойДанных", Ложь);
	События.Вставить("ПослеВыгрузкиДанных", Ложь);
	События.Вставить("ПередЗагрузкойДанных", Ложь);
	События.Вставить("ПослеЗагрузкиДанных", Ложь);
	События.Вставить("ПриЗагрузкеПользователяИнформационнойБазы", Ложь);
	События.Вставить("ПослеЗагрузкиПользователяИнформационнойБазы", Ложь);
	События.Вставить("ПослеЗагрузкиПользователейИнформационнойБазы", Ложь);

	// ТехнологияСервиса_БазоваяФункциональность
	События.Вставить("ПриЗаполненииТаблицыПараметровИБ", Ложь);
	События.Вставить("ПриОпределенииПсевдонимаПользователя", Ложь);
	События.Вставить("ПриОпределенииИсключенийНеразделенныхДанных", Ложь);
	События.Вставить("ПриУстановкеЗначенийПараметровИБ", Ложь);
	События.Вставить("ПриОбновленииПараметровТекущейОбластиДанных", Ложь);

	// ТехнологияСервиса_ОбменСообщениями
	События.Вставить("ПриОпределенииОбработчиковКаналовСообщений", Ложь);
	События.Вставить("РегистрацияИнтерфейсовПринимаемыхСообщений", Ложь);
	События.Вставить("РегистрацияИнтерфейсовОтправляемыхСообщений", Ложь);
	События.Вставить("ПриОпределенииВерсииИнтерфейсаКорреспондента", Ложь);

	// ТехнологияСервиса_ОчередьЗаданий
	События.Вставить("ПриПолученииСпискаШаблонов", Ложь);
	События.Вставить("ПриОпределенииПсевдонимовОбработчиков", Ложь);
	События.Вставить("ПриОпределенииОбработчиковОшибок", Ложь);
	События.Вставить("ПриОпределенииИспользованияРегламентныхЗаданий", Ложь);

	// ТехнологияСервиса_ПоставляемыеДанные
	События.Вставить("ПриОпределенииОбработчиковПоставляемыхДанных", Ложь);

	// ТехнологияСервиса_УправлениеТарифами
	События.Вставить("ПриФормированииСпискаУслуг", Ложь);

	Возврат События;

КонецФункции

#Область БазоваяФункциональность

// См. ОбновлениеИнформационнойБазыБТС.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновленияБТС(Обработчики) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриДобавленииОбработчиковОбновленияБТС Тогда
		МодульИнтеграцияБСП().ПриДобавленииОбработчиковОбновленияБТС(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриДобавленииОбработчиковОбновленияБТС Тогда
		МодульИнтеграцияБИП().ПриДобавленииОбработчиковОбновленияБТС(Обработчики);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриДобавленииОбработчиковОбновленияБТС Тогда
		МодульИнтеграцияПлюс().ПриДобавленииОбработчиковОбновленияБТС(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриДобавленииОбработчиковОбновленияБТС Тогда
		МодульИнтеграцияБЭД().ПриДобавленииОбработчиковОбновленияБТС(Обработчики);
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаВМоделиСервисаПереопределяемый.ПриЗаполненииИсключенийОчисткиДанныхИБ
Процедура ПриЗаполненииИсключенийОчисткиДанныхИБ(ИсключенияОчистки) Экспорт
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриЗаполненииИсключенийОчисткиДанныхИБ Тогда
		МодульИнтеграцияБСП().ПриЗаполненииИсключенийОчисткиДанныхИБ(ИсключенияОчистки);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриЗаполненииИсключенийОчисткиДанныхИБ Тогда
		МодульИнтеграцияБИП().ПриЗаполненииИсключенийОчисткиДанныхИБ(ИсключенияОчистки);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриЗаполненииИсключенийОчисткиДанныхИБ Тогда
		МодульИнтеграцияПлюс().ПриЗаполненииИсключенийОчисткиДанныхИБ(ИсключенияОчистки);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриЗаполненииИсключенийОчисткиДанныхИБ Тогда
		МодульИнтеграцияБЭД().ПриЗаполненииИсключенийОчисткиДанныхИБ(ИсключенияОчистки);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаЗагрузкаДанных

// Параметры:
//	Типы - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке.Типы
Процедура ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке(Типы) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке Тогда
		МодульИнтеграцияБСП().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке Тогда
		МодульИнтеграцияБИП().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке Тогда
		МодульИнтеграцияПлюс().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке(Типы);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке Тогда
		МодульИнтеграцияБЭД().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке(Типы);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Типы - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке.Типы
Процедура ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияБСП().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияБИП().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияПлюс().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияБЭД().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Типы - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке.Типы
Процедура ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияБСП().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияБИП().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияПлюс().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияБЭД().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Типы - Массив Из ОбъектМетаданных - исключаемые типы.
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт

	РаботаВМоделиСервиса.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	ОбменСообщениямиВнутренний.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	ОчередьЗаданийСлужебныйРазделениеДанных.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	РезервноеКопированиеОбластейДанных.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	РазмерПриложений.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки Тогда
		МодульИнтеграцияБСП().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки Тогда
		МодульИнтеграцияБИП().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки Тогда
		МодульИнтеграцияПлюс().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки Тогда
		МодульИнтеграцияБЭД().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//	ТаблицаОбработчиков - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриРегистрацииОбработчиковВыгрузкиДанных.ТаблицаОбработчиков
Процедура ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриРегистрацииОбработчиковВыгрузкиДанных Тогда
		МодульИнтеграцияБСП().ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриРегистрацииОбработчиковВыгрузкиДанных Тогда
		МодульИнтеграцияБИП().ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриРегистрацииОбработчиковВыгрузкиДанных Тогда
		МодульИнтеграцияПлюс().ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриРегистрацииОбработчиковВыгрузкиДанных Тогда
		МодульИнтеграцияБЭД().ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	ТаблицаОбработчиков - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриРегистрацииОбработчиковЗагрузкиДанных.ТаблицаОбработчиков
Процедура ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриРегистрацииОбработчиковЗагрузкиДанных Тогда
		МодульИнтеграцияБСП().ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриРегистрацииОбработчиковЗагрузкиДанных Тогда
		МодульИнтеграцияБИП().ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриРегистрацииОбработчиковЗагрузкиДанных Тогда
		МодульИнтеграцияПлюс().ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриРегистрацииОбработчиковЗагрузкиДанных Тогда
		МодульИнтеграцияБЭД().ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПередВыгрузкойДанных.Контейнер
Процедура ПередВыгрузкойДанных(Контейнер) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПередВыгрузкойДанных Тогда
		МодульИнтеграцияБСП().ПередВыгрузкойДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПередВыгрузкойДанных Тогда
		МодульИнтеграцияБИП().ПередВыгрузкойДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПередВыгрузкойДанных Тогда
		МодульИнтеграцияПлюс().ПередВыгрузкойДанных(Контейнер);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПередВыгрузкойДанных Тогда
		МодульИнтеграцияБЭД().ПередВыгрузкойДанных(Контейнер);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеВыгрузкиДанных.Контейнер
Процедура ПослеВыгрузкиДанных(Контейнер) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПослеВыгрузкиДанных Тогда
		МодульИнтеграцияБСП().ПослеВыгрузкиДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПослеВыгрузкиДанных Тогда
		МодульИнтеграцияБИП().ПослеВыгрузкиДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПослеВыгрузкиДанных Тогда
		МодульИнтеграцияПлюс().ПослеВыгрузкиДанных(Контейнер);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПослеВыгрузкиДанных Тогда
		МодульИнтеграцияБЭД().ПослеВыгрузкиДанных(Контейнер);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПередЗагрузкойДанных.Контейнер
Процедура ПередЗагрузкойДанных(Контейнер) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПередЗагрузкойДанных Тогда
		МодульИнтеграцияБСП().ПередЗагрузкойДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПередЗагрузкойДанных Тогда
		МодульИнтеграцияБИП().ПередЗагрузкойДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПередЗагрузкойДанных Тогда
		МодульИнтеграцияПлюс().ПередЗагрузкойДанных(Контейнер);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПередЗагрузкойДанных Тогда
		МодульИнтеграцияБЭД().ПередЗагрузкойДанных(Контейнер);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиДанных.Контейнер
Процедура ПослеЗагрузкиДанных(Контейнер) Экспорт

	РаботаВМоделиСервиса.ПослеЗагрузкиДанных(Контейнер);

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПослеЗагрузкиДанных Тогда
		МодульИнтеграцияБСП().ПослеЗагрузкиДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПослеЗагрузкиДанных Тогда
		МодульИнтеграцияБИП().ПослеЗагрузкиДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПослеЗагрузкиДанных Тогда
		МодульИнтеграцияПлюс().ПослеЗагрузкиДанных(Контейнер);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПослеЗагрузкиДанных Тогда
		МодульИнтеграцияБЭД().ПослеЗагрузкиДанных(Контейнер);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗагрузкеПользователяИнформационнойБазы.Контейнер
//	Сериализация - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗагрузкеПользователяИнформационнойБазы.Сериализация
//	ПользовательИБ - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗагрузкеПользователяИнформационнойБазы.ПользовательИБ
//	Отказ - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗагрузкеПользователяИнформационнойБазы.Отказ
Процедура ПриЗагрузкеПользователяИнформационнойБазы(Контейнер, Сериализация,
		ПользовательИБ, Отказ) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриЗагрузкеПользователяИнформационнойБазы Тогда
		МодульИнтеграцияБСП().ПриЗагрузкеПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ, Отказ);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриЗагрузкеПользователяИнформационнойБазы Тогда
		МодульИнтеграцияБИП().ПриЗагрузкеПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ, Отказ);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриЗагрузкеПользователяИнформационнойБазы Тогда
		МодульИнтеграцияПлюс().ПриЗагрузкеПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ, Отказ);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриЗагрузкеПользователяИнформационнойБазы Тогда
		МодульИнтеграцияБЭД().ПриЗагрузкеПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиПользователяИнформационнойБазы.Контейнер
//	Сериализация - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиПользователяИнформационнойБазы.Сериализация
//	ПользовательИБ - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиПользователяИнформационнойБазы.ПользовательИБ
Процедура ПослеЗагрузкиПользователяИнформационнойБазы(Контейнер, Сериализация,
		ПользовательИБ) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПослеЗагрузкиПользователяИнформационнойБазы Тогда
		МодульИнтеграцияБСП().ПослеЗагрузкиПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПослеЗагрузкиПользователяИнформационнойБазы Тогда
		МодульИнтеграцияБИП().ПослеЗагрузкиПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПослеЗагрузкиПользователяИнформационнойБазы Тогда
		МодульИнтеграцияПлюс().ПослеЗагрузкиПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПослеЗагрузкиПользователяИнформационнойБазы Тогда
		МодульИнтеграцияБЭД().ПослеЗагрузкиПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиПользователейИнформационнойБазы.Контейнер
Процедура ПослеЗагрузкиПользователейИнформационнойБазы(Контейнер) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПослеЗагрузкиПользователейИнформационнойБазы Тогда
		МодульИнтеграцияБСП().ПослеЗагрузкиПользователейИнформационнойБазы(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПослеЗагрузкиПользователейИнформационнойБазы Тогда
		МодульИнтеграцияБИП().ПослеЗагрузкиПользователейИнформационнойБазы(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПослеЗагрузкиПользователейИнформационнойБазы Тогда
		МодульИнтеграцияПлюс().ПослеЗагрузкиПользователейИнформационнойБазы(Контейнер);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПослеЗагрузкиПользователейИнформационнойБазы Тогда
		МодульИнтеграцияБЭД().ПослеЗагрузкиПользователейИнформационнойБазы(Контейнер);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаВМоделиСервиса_БазоваяФункциональностьВМоделиСервиса

// Параметры:
//	ТаблицаПараметров - см. РаботаВМоделиСервиса.ПараметрыИБ
Процедура ПриЗаполненииТаблицыПараметровИБ(Знач ТаблицаПараметров) Экспорт

	ДополнительныеОтчетыИОбработкиВМоделиСервиса.ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	РаботаВМоделиСервисаБТС.ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	РасширенияВМоделиСервиса.ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	ЭлектроннаяПодписьВМоделиСервиса.ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	РезервноеКопированиеОбластейДанных.ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриЗаполненииТаблицыПараметровИБ Тогда
		МодульИнтеграцияБСП().ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриЗаполненииТаблицыПараметровИБ Тогда
		МодульИнтеграцияБИП().ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриЗаполненииТаблицыПараметровИБ Тогда
		МодульИнтеграцияПлюс().ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриЗаполненииТаблицыПараметровИБ Тогда
		МодульИнтеграцияБЭД().ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	ИдентификаторПользователя - см. РаботаВМоделиСервиса.ПсевдонимПользователяИнформационнойБазы.ИдентификаторПользователя
//	Псевдоним - Строка - назначаемый псевдоним (возвращаемый параметр).
Процедура ПриОпределенииПсевдонимаПользователя(ИдентификаторПользователя, Псевдоним) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриОпределенииПсевдонимаПользователя Тогда
		МодульИнтеграцияБСП().ПриОпределенииПсевдонимаПользователя(ИдентификаторПользователя, Псевдоним);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриОпределенииПсевдонимаПользователя Тогда
		МодульИнтеграцияБИП().ПриОпределенииПсевдонимаПользователя(ИдентификаторПользователя, Псевдоним);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриОпределенииПсевдонимаПользователя Тогда
		МодульИнтеграцияПлюс().ПриОпределенииПсевдонимаПользователя(ИдентификаторПользователя, Псевдоним);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриОпределенииПсевдонимаПользователя Тогда
		МодульИнтеграцияБЭД().ПриОпределенииПсевдонимаПользователя(ИдентификаторПользователя, Псевдоним);
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаВМоделиСервиса.ПриОпределенииИсключенийНеразделенныхДанных
// 
// Параметры:
//	Исключения - Массив Из ОбъектМетаданных - исключения.
//
Процедура ПриОпределенииИсключенийНеразделенныхДанных(Исключения) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ЦентрКонтроляКачества") Тогда
		МодульИнцидентыЦККСервер = ОбщегоНазначения.ОбщийМодуль("ИнцидентыЦККСервер");
		МодульИнцидентыЦККСервер.ПриОпределенииИсключенийНеразделенныхДанных(Исключения);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриОпределенииИсключенийНеразделенныхДанных Тогда
		МодульИнтеграцияБСП().ПриОпределенииИсключенийНеразделенныхДанных(Исключения);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриОпределенииИсключенийНеразделенныхДанных Тогда
		МодульИнтеграцияБИП().ПриОпределенииИсключенийНеразделенныхДанных(Исключения);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриОпределенииИсключенийНеразделенныхДанных Тогда
		МодульИнтеграцияПлюс().ПриОпределенииИсключенийНеразделенныхДанных(Исключения);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриОпределенииИсключенийНеразделенныхДанных Тогда
		МодульИнтеграцияБЭД().ПриОпределенииИсключенийНеразделенныхДанных(Исключения);
	КонецЕсли;
		
	РаботаВМоделиСервиса.ПриОпределенииИсключенийНеразделенныхДанных(Исключения);

КонецПроцедуры

// См. РаботаВМоделиСервисаПереопределяемый.ПриУстановкеЗначенийПараметровИБ
Процедура ПриУстановкеЗначенийПараметровИБ(Знач ЗначенияПараметров) Экспорт

	ДополнительныеОтчетыИОбработкиВМоделиСервиса.ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	РасширенияВМоделиСервиса.ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	УдаленноеАдминистрированиеСлужебный.ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	ЭлектроннаяПодписьВМоделиСервиса.ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриУстановкеЗначенийПараметровИБ Тогда
		МодульИнтеграцияБСП().ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриУстановкеЗначенийПараметровИБ Тогда
		МодульИнтеграцияБИП().ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриУстановкеЗначенийПараметровИБ Тогда
		МодульИнтеграцияПлюс().ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриУстановкеЗначенийПараметровИБ Тогда
		МодульИнтеграцияБЭД().ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаВМоделиСервисаБТС.ОбновитьПараметрыТекущейОбластиДанных
Процедура ПриОбновленииПараметровТекущейОбластиДанных() Экспорт
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриОбновленииПараметровТекущейОбластиДанных Тогда
		МодульИнтеграцияБСП().ПриОбновленииПараметровТекущейОбластиДанных();
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриОбновленииПараметровТекущейОбластиДанных Тогда
		МодульИнтеграцияБИП().ПриОбновленииПараметровТекущейОбластиДанных();
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриОбновленииПараметровТекущейОбластиДанных Тогда
		МодульИнтеграцияПлюс().ПриОбновленииПараметровТекущейОбластиДанных();
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриОбновленииПараметровТекущейОбластиДанных Тогда
		МодульИнтеграцияБЭД().ПриОбновленииПараметровТекущейОбластиДанных();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаВМоделиСервиса_ОбменСообщениями

// См. ОбменСообщениямиПереопределяемый.ПолучитьОбработчикиКаналовСообщений
//
// Параметры:
//	Обработчики - см. ОбменСообщениямиПереопределяемый.ПолучитьОбработчикиКаналовСообщений.Обработчики
//
Процедура ПриОпределенииОбработчиковКаналовСообщений(Обработчики) Экспорт
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриОпределенииОбработчиковКаналовСообщений Тогда
		МодульИнтеграцияБСП().ПриОпределенииОбработчиковКаналовСообщений(Обработчики);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриОпределенииОбработчиковКаналовСообщений Тогда
		МодульИнтеграцияБИП().ПриОпределенииОбработчиковКаналовСообщений(Обработчики);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриОпределенииОбработчиковКаналовСообщений Тогда
		МодульИнтеграцияПлюс().ПриОпределенииОбработчиковКаналовСообщений(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриОпределенииОбработчиковКаналовСообщений Тогда
		МодульИнтеграцияБЭД().ПриОпределенииОбработчиковКаналовСообщений(Обработчики);
	КонецЕсли;

КонецПроцедуры

// См. ИнтерфейсыСообщенийВМоделиСервисаПереопределяемый.ЗаполнитьОбработчикиПринимаемыхСообщений
Процедура РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков) Экспорт

	ДополнительныеОтчетыИОбработкиВМоделиСервиса.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;
	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	РасширенияВМоделиСервиса.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	УдаленноеАдминистрированиеСлужебный.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.УправлениеТарифами") Тогда
		МодульТарификация = ОбщегоНазначения.ОбщийМодуль("Тарификация");
		МодульТарификация.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;
	РезервноеКопированиеОбластейДанных.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.СводныеПриложения") Тогда
		МодульСводныеПриложения = ОбщегоНазначения.ОбщийМодуль("СводныеПриложения");
		МодульСводныеПриложения.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОповещениеПользователейБТС") Тогда
		МодульОповещениеПользователейБТС = ОбщегоНазначения.ОбщийМодуль("ОповещениеПользователейБТС");
		МодульОповещениеПользователейБТС.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;
	
	ВидыПриложенийСлужебный.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().РегистрацияИнтерфейсовПринимаемыхСообщений Тогда
		МодульИнтеграцияБСП().РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().РегистрацияИнтерфейсовПринимаемыхСообщений Тогда
		МодульИнтеграцияБИП().РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().РегистрацияИнтерфейсовПринимаемыхСообщений Тогда
		МодульИнтеграцияПлюс().РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().РегистрацияИнтерфейсовПринимаемыхСообщений Тогда
		МодульИнтеграцияБЭД().РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;
		
КонецПроцедуры

// См. ИнтерфейсыСообщенийВМоделиСервисаПереопределяемый.ЗаполнитьОбработчикиОтправляемыхСообщений
Процедура РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков) Экспорт

	ДополнительныеОтчетыИОбработкиВМоделиСервиса.РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	РасширенияВМоделиСервиса.РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	УдаленноеАдминистрированиеСлужебный.РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.УправлениеТарифами") Тогда
		МодульТарификация = ОбщегоНазначения.ОбщийМодуль("Тарификация");
		МодульТарификация.РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	КонецЕсли;
	РезервноеКопированиеОбластейДанных.РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.СводныеПриложения") Тогда
		МодульСводныеПриложения = ОбщегоНазначения.ОбщийМодуль("СводныеПриложения");
		МодульСводныеПриложения.РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	КонецЕсли;
	
	ВидыПриложенийСлужебный.РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().РегистрацияИнтерфейсовОтправляемыхСообщений Тогда
		МодульИнтеграцияБСП().РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().РегистрацияИнтерфейсовОтправляемыхСообщений Тогда
		МодульИнтеграцияБИП().РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().РегистрацияИнтерфейсовОтправляемыхСообщений Тогда
		МодульИнтеграцияПлюс().РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().РегистрацияИнтерфейсовОтправляемыхСообщений Тогда
		МодульИнтеграцияБЭД().РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	КонецЕсли;
	
КонецПроцедуры

// См. ИнтерфейсыСообщенийВМоделиСервисаПереопределяемый.ПриОпределенииВерсииИнтерфейсаКорреспондента
Процедура ПриОпределенииВерсииИнтерфейсаКорреспондента(Знач ИнтерфейсСообщения,
		Знач ПараметрыПодключения, Знач ПредставлениеПолучателя, Результат) Экспорт

	ДополнительныеОтчетыИОбработкиВМоделиСервиса.ПриОпределенииВерсииИнтерфейсаКорреспондента(
			ИнтерфейсСообщения, ПараметрыПодключения, ПредставлениеПолучателя, Результат);

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриОпределенииВерсииИнтерфейсаКорреспондента Тогда
		МодульИнтеграцияБСП().ПриОпределенииВерсииИнтерфейсаКорреспондента(
			ИнтерфейсСообщения, ПараметрыПодключения, ПредставлениеПолучателя, Результат);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриОпределенииВерсииИнтерфейсаКорреспондента Тогда
		МодульИнтеграцияБИП().ПриОпределенииВерсииИнтерфейсаКорреспондента(
			ИнтерфейсСообщения,	ПараметрыПодключения, ПредставлениеПолучателя, Результат);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриОпределенииВерсииИнтерфейсаКорреспондента Тогда
		МодульИнтеграцияПлюс().ПриОпределенииВерсииИнтерфейсаКорреспондента(
			ИнтерфейсСообщения,	ПараметрыПодключения, ПредставлениеПолучателя, Результат);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриОпределенииВерсииИнтерфейсаКорреспондента Тогда
		МодульИнтеграцияБЭД().ПриОпределенииВерсииИнтерфейсаКорреспондента(
			ИнтерфейсСообщения, ПараметрыПодключения, ПредставлениеПолучателя, Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаВМоделиСервиса_ОчередьЗаданий

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриПолученииСпискаШаблонов Тогда
		МодульИнтеграцияБСП().ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриПолученииСпискаШаблонов Тогда
		МодульИнтеграцияБИП().ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриПолученииСпискаШаблонов Тогда
		МодульИнтеграцияПлюс().ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриПолученииСпискаШаблонов Тогда
		МодульИнтеграцияБЭД().ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	КонецЕсли;
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт

	ДополнительныеОтчетыИОбработкиВМоделиСервиса.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	РасширенияВМоделиСервиса.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.МиграцияПриложений") Тогда
		МодульМиграцияПриложений = ОбщегоНазначения.ОбщийМодуль("МиграцияПриложений");
		МодульМиграцияПриложений.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ПоставляемыеДанныеАбонентов") Тогда
		МодульПоставляемыеДанныеАбонентов = ОбщегоНазначения.ОбщийМодуль("ПоставляемыеДанныеАбонентов");
		МодульПоставляемыеДанныеАбонентов.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнтеграцияОбъектовОбластейДанных") Тогда
		МодульИнтеграцияОбъектовОбластейДанных = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияОбъектовОбластейДанных");
		МодульИнтеграцияОбъектовОбластейДанных.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.АсинхронноеПолучениеДанных") Тогда
		МодульАсинхронноеПолучениеДанных = ОбщегоНазначения.ОбщийМодуль("АсинхронноеПолучениеДанных");
		МодульАсинхронноеПолучениеДанных.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.АвтоматизацияПроцессов.РаспределенноеВыполнениеКоманд") Тогда
		МодульРаспределенноеВыполнениеКоманд = ОбщегоНазначения.ОбщийМодуль("РаспределенноеВыполнениеКоманд");
		МодульРаспределенноеВыполнениеКоманд.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;

	ПоставляемыеДанные.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	РаботаВМоделиСервиса.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	РезервноеКопированиеОбластейДанных.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.СводныеПриложения") Тогда
		МодульСводныеПриложения = ОбщегоНазначения.ОбщийМодуль("СводныеПриложения");
		МодульСводныеПриложения.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриОпределенииПсевдонимовОбработчиков Тогда
		МодульИнтеграцияБСП().ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриОпределенииПсевдонимовОбработчиков Тогда
		МодульИнтеграцияБИП().ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриОпределенииПсевдонимовОбработчиков Тогда
		МодульИнтеграцияПлюс().ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриОпределенииПсевдонимовОбработчиков Тогда
		МодульИнтеграцияБЭД().ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;

КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииОбработчиковОшибок
Процедура ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок) Экспорт

	РезервноеКопированиеОбластейДанных.ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок);

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриОпределенииОбработчиковОшибок Тогда
		МодульИнтеграцияБСП().ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриОпределенииОбработчиковОшибок Тогда
		МодульИнтеграцияБИП().ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриОпределенииОбработчиковОшибок Тогда
		МодульИнтеграцияПлюс().ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриОпределенииОбработчиковОшибок Тогда
		МодульИнтеграцияБЭД().ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок);
	КонецЕсли;
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииИспользованияРегламентныхЗаданий
// Параметры:
// 	ТаблицаИспользования - ТаблицаЗначений - описание:
//		* РегламентноеЗадание - Строка - имя регламентного задания.
//  	* Использование - Булево - признак использования.
//
Процедура ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования) Экспорт

	РаботаВМоделиСервиса.ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования);

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриОпределенииИспользованияРегламентныхЗаданий Тогда
		МодульИнтеграцияБСП().ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриОпределенииИспользованияРегламентныхЗаданий Тогда
		МодульИнтеграцияБИП().ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриОпределенииИспользованияРегламентныхЗаданий Тогда
		МодульИнтеграцияПлюс().ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриОпределенииИспользованияРегламентныхЗаданий Тогда
		МодульИнтеграцияБЭД().ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаВМоделиСервиса_ПоставляемыеДанные

// См. ПоставляемыеДанныеПереопределяемый.ПолучитьОбработчикиПоставляемыхДанных
Процедура ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);
	КонецЕсли;
	
	РасширенияВМоделиСервиса.ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);
	РаботаВМоделиСервиса.ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриОпределенииОбработчиковПоставляемыхДанных Тогда
		МодульИнтеграцияБСП().ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриОпределенииОбработчиковПоставляемыхДанных Тогда
		МодульИнтеграцияБИП().ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриОпределенииОбработчиковПоставляемыхДанных Тогда
		МодульИнтеграцияПлюс().ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриОпределенииОбработчиковПоставляемыхДанных Тогда
		МодульИнтеграцияБЭД().ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ТехнологияСервиса_УправлениеТарифами

Процедура ПриФормированииСпискаУслуг(ПоставщикиУслуг) Экспорт

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБСП().ПриФормированииСпискаУслуг Тогда
		МодульИнтеграцияБСП().ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБИП().ПриФормированииСпискаУслуг Тогда
		МодульИнтеграцияБИП().ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиПлюс().ПриФормированииСпискаУслуг Тогда
		МодульИнтеграцияПлюс().ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТСПовтИсп.ПодпискиБЭД().ПриФормированииСпискаУслуг Тогда
		МодульИнтеграцияБЭД().ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПереопределениеВызовов

#Область БазоваяФункциональность

// См. ОбщегоНазначения.ИспользованиеРазделителяСеанса
// 
// Возвращаемое значение:
//	Булево - признак использования.
Функция ИспользованиеРазделителяСеанса() Экспорт
	
	Возврат ОбщегоНазначения.РазделениеВключено() 
			И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();
	
КонецФункции

Процедура ЗаблокироватьИБ(Знач ПроверитьОтсутствиеДругихСеансов = Истина) Экспорт

	УстановитьМонопольныйРежим(Истина);

КонецПроцедуры

Процедура РазблокироватьИБ() Экспорт

	УстановитьМонопольныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#Область БазоваяФункциональностьВМоделиСервиса

// См. РаботаВМоделиСервиса.ЗаблокироватьТекущуюОбластьДанных
//
Процедура ЗаблокироватьТекущуюОбластьДанных(Знач ПроверитьОтсутствиеДругихСеансов = Ложь,
		Знач РазделяемаяБлокировка = Ложь) Экспорт

	УстановитьМонопольныйРежим(Истина);

КонецПроцедуры

// См. РаботаВМоделиСервиса.РазблокироватьТекущуюОбластьДанных
//
Процедура РазблокироватьТекущуюОбластьДанных() Экспорт

	УстановитьМонопольныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МодульИнтеграцияБСП()
	
	//@skip-check bsl-legacy-check-string-literal
	Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемБСП");
	
КонецФункции

Функция МодульИнтеграцияБИП()
	
	//@skip-check bsl-legacy-check-string-literal
	Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемБИП");
	
КонецФункции

Функция МодульИнтеграцияПлюс()
	
	//@skip-check bsl-legacy-check-string-literal
	Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемПлюс");
	
КонецФункции

Функция МодульИнтеграцияБЭД()
	
	//@skip-check bsl-legacy-check-string-literal
	Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемБЭД");
	
КонецФункции

Процедура ПроверитьВозможностьЗапускаПрограммы()
	
	ВыполнятьПроверкуБлокировки = Не ОбщегоНазначения.РазделениеВключено()
		Или ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();
	
	Если ВыполнятьПроверкуБлокировки И ПолучитьФункциональнуюОпцию("УстановленаМонопольнаяБлокировка") Тогда
		
		Задание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
		ВозможенЗапускПрограммы = Задание <> Неопределено
			И РаботаВМоделиСервиса.ИменаМетодовРазрешенныхКЗапуску().Найти(Задание.ИмяМетода) <> Неопределено;
		
		Если Не ВозможенЗапускПрограммы И ПолучитьСеансыИнформационнойБазы().Количество() = 1 Тогда
			РаботаВМоделиСервиса.СнятьМонопольнуюБлокировку(Истина);
			ВозможенЗапускПрограммы = Истина;
		КонецЕсли;
		
		Если Не ВозможенЗапускПрограммы Тогда
			ВызватьИсключение НСтр("ru = 'База данных заблокирована'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
