&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроверитьНастроенностьПочты();
	Контрагент = Параметры.Контрагент;
	Инициатор = Параметры.Инициатор;
	ПригласитьВЭДО = Параметры.Свойство("ПригласитьВЭДО");
	
	Если ПригласитьВЭДО Тогда
		Элементы.ДекорацияПригласитьВЭДО.Видимость = Истина;
		Элементы.ДекорацияПригласитьВЛогистику.Видимость = Ложь;
		Заголовок = "Ваш Контрагент еще не подключен к ЭДО";
	Иначе
		Элементы.ДекорацияПригласитьВЭДО.Видимость = Ложь;
		Элементы.ДекорацияПригласитьВЛогистику.Видимость = Истина;
	КонецЕсли;
	
	Если Контрагент.СвязанныеОбъекты.Количество() > 0 Тогда
		Основание = Контрагент.СвязанныеОбъекты[0].СвязанныйОбъект;
		Если ЗначениеЗаполнено(Основание) Тогда
			Попытка
				Выполнить("ЭлПочта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Основание, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента, ТекущаяДатаСеанса())");
			Исключение
				// не смогли достать почту автоматом
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Функция ТекстПриглашения()
	
	Возврат "" + Инициатор + " переходит на электронные перевозочные документы через Диадок.Логистика.
	|Вы сможете обмениваться электронными транспортными накладными, оформлять электронные путевые листы и другие документы.
	|	
	|Подключайтесь самостоятельно с сертификатом директора: https://support.kontur.ru/logistika/51865-avtoregistraciya_organizacij
	|Или отправив заявку https://kontur.ru/logistika#order или на эл. почту help.logistika@kontur.ru или по телефону +7 800 500 5978"
	
КонецФункции

&НаКлиенте
Процедура ПригласитьПоЭлПочте(Команда)
	
	УспешноОтправлено = ПригласитьПоЭлПочтеСервер();
	Если УспешноОтправлено Тогда 
		Состояние("Приглашение отправлено",,, БиблиотекаКартинок.КонтурЛогистика_Лого16);
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(
			"Когда партнер примет приглашение, вы сможете обмениваться с ним электронными перевозочными документами",,,
			ЭтаФорма,"ОбработчикЗакрытьФорму");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПригласитьПоЭлПочтеСервер()

	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = "Приглашение в Диадок.Логистика от " + Инициатор;
	Письмо.Тексты.Добавить(ТекстПриглашения());
	
	Если ЗначениеЗаполнено(ЭлПочта) Тогда
		Письмо.Получатели.Добавить(СокрЛП(ЭлПочта));
	КонецЕсли;
	
	ТекстОшибки = КонтурЛогистика_РаботаСПочтовымиСообщениями.ОтправитьПисьмо(Письмо);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Сообщить("Не удалось отправить на почту.
			|Ошибка: " + ТекстОшибки);
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура НастроитьПочту(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_НастройкаУчетнойЗаписиЭлектроннойПочты",, ЭтаФорма, ЭтаФорма,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму(Параметр1) Экспорт
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеНастройкиУчетнойЗаписиЭлектроннойПочты" Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
		ПроверитьНастроенностьПочты();
		ОбновитьВидимостьДоступность();
		
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНастроенностьПочты()
	
	НастройкиОтправкиПочтыЗаполнены = КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	
	Элементы.ЭлПочта.Видимость = НастройкиОтправкиПочтыЗаполнены;
	Элементы.ФормаПригласитьПоЭлПочте.Видимость = НастройкиОтправкиПочтыЗаполнены;
	Элементы.НастроитьПочту.Видимость = Ложь;
	
КонецПроцедуры