// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ИдентификаторЗаявки - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * Сертификат - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.Сертификат
//  * Доверенность - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.Доверенность
Функция СертификатыЗаявки(ИдентификаторЗаявки) Экспорт
	
	РезультатЗапроса = РезультатЗапросаСертификатовЗаявки(ИдентификаторЗаявки);
	
	//@skip-check constructor-function-return-section
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * Сертификат - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.Сертификат
//  * Доверенность - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.Доверенность
Функция ВыборкаСертификатовЗаявки(ИдентификаторЗаявки) Экспорт
	
	РезультатЗапроса = РезультатЗапросаСертификатовЗаявки(ИдентификаторЗаявки);
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки
// 
// Возвращаемое значение:
//  РезультатЗапроса
Функция РезультатЗапросаСертификатовЗаявки(ИдентификаторЗаявки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СертификатыЗаявокНаРегистрациюВЭДО.Сертификат,
		|	СертификатыЗаявокНаРегистрациюВЭДО.Доверенность
		|ИЗ
		|	РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО КАК СертификатыЗаявокНаРегистрациюВЭДО
		|ГДЕ
		|	СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки = &ИдентификаторЗаявки";
	
	Запрос.УстановитьПараметр("ИдентификаторЗаявки", ИдентификаторЗаявки);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - см. РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки
// 
// Возвращаемое значение:
//  Массив из Строка
Функция ОтпечаткиСертификатовЗаявки(ИдентификаторЗаявки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сертификаты.Отпечаток
		|ИЗ
		|	РегистрСведений.СертификатыЗаявокНаРегистрациюВЭДО КАК СертификатыЗаявокНаРегистрациюВЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК Сертификаты
		|		ПО СертификатыЗаявокНаРегистрациюВЭДО.Сертификат = Сертификаты.Ссылка
		|ГДЕ
		|	СертификатыЗаявокНаРегистрациюВЭДО.ИдентификаторЗаявки = &ИдентификаторЗаявки";
	
	Запрос.УстановитьПараметр("ИдентификаторЗаявки", ИдентификаторЗаявки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Отпечаток");
	
КонецФункции

// Параметры:
//  ИдентификаторЗаявки - Строка
Процедура Удалить(ИдентификаторЗаявки) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЗаявки.Установить(ИдентификаторЗаявки);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли