
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УточнениеТипаЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3");
	
	Если ПараметрКоманды.Количество() = 1 Тогда // через форму документа 
		
		ЗаполнитьТекущийДокументЛогистикаИзПредыдущегоТитула(ПараметрКоманды[0], ПараметрыВыполненияКоманды);
		
	Иначе // без открытия форм
		
		ЗаполнитьДокументыПакетно(Истина, ПараметрКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументыПакетно(Подтверждено = Истина, МассивДокументов) Экспорт
	
	ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3");
	
	Если Подтверждено = Истина ИЛИ Подтверждено = КодВозвратаДиалога.Да Тогда 
		
		// TODO реализовать многопоточный фоновый ввод документов  - см общ команду КонтурЛогистика_СоздатьЧерновик
		Если Истина Тогда // МассивДокументов.Количество() < 10 Тогда
			
			ЗаполнитьДокументыПакетноСервер(МассивДокументов, ТипЛогистика);
			Оповестить("КонтурЛогистика_ВвестиДокумент");
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыПакетноСервер(МассивДокументов, УточнениеТипаЛогистика = Неопределено)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ВвестиСледующиеТитулыПоПереданнымПакетно(МассивДокументов, УточнениеТипаЛогистика, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущийДокументЛогистикаИзПредыдущегоТитула(ДокументСсылка, Источник = Неопределено) Экспорт
	
	ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3");
	
	КонтурЛогистика_ОбработкаДокументовКлиент.ЗаполнитьТекущийДокументЛогистикаИзПредыдущегоТитула(ДокументСсылка, Источник);
	
КонецПроцедуры