// @strict-types
#Область ОбработчикиСобытий

// Код процедур и функций
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	//ТабДок = ПолучитьТабДокКоммерческоеПредложение(ПараметрКоманды);
	//ТабДок.ТолькоПросмотр = Истина;
	//ТабДок.ОтображатьСетку = Ложь;
	//ТабДок.ОтображатьЗаголовки = Ложь;
	//ТабДок.Показать(НСтр("ru = 'Коммерческое предложение'"));
	
	ПараметрыФормы = Новый Структура("Ссылка,СформироватьПриОткрытии",ПараметрКоманды,Истина);
	ОткрытьФорму("Отчет.КонтурЗакупки_КоммерческоеПредложение.Форма.ФормаОтчета", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТабДокКоммерческоеПредложение(Ссылка)
	
	ОСКД = Документы.КонтурЗакупки_ОбработкаЗакупки.ПолучитьМакет("КоммерческоеПредложение");

	Параметр = ОСКД.Параметры.Найти("Ссылка");
	Параметр.Значение = Ссылка;

	НастройкиОСКД = ОСКД.НастройкиПоУмолчанию;
	НастройкиОСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка", Ссылка);

	КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакетаОСКД.Выполнить(ОСКД, НастройкиОСКД);

	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет);

	ТабДок = Новый ТабличныйДокумент;

	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаОСКД.УстановитьДокумент(ТабДок);
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);

	Возврат ТабДок;
	
КонецФункции

#КонецОбласти