#Область ПрограммныйИнтерфейс

// Дополняет тексты запроса проведения документа текстами проведения графика исполнения договора с поставщиком
// по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПланыОплат - Строка - Текст запроса получения данных для отражения плана оплат поставщику.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов договор.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты механизма]
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты этапа.
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов. 
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыПоставщику - Вариант оплаты этапа графика.
// 	ТекстПланыПоставок - Строка - Текст запроса получения данных документа для отражения плана поставки.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты документа]
// 	     * ДатаПоступления - Дата - Плановая дата поставки строки/документа.
// 	     * УвеличитьКПоступлению - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к поступлению в валюте взаиморасчетов.
//
Процедура ПроведениеГрафикаИсполненияДоговораСПоставщиком(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат, ТекстПланыПоставок) Экспорт
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Операция = "ГрафикИсполненияПоставщик";
	ВидОперацииДляСортировки = "1";
	
	#Область ВременныеТаблицы
	
	ТекстыШаблоновВТ = Новый Структура();
	
	#КонецОбласти
	
	#Область Проведение
	
	МассивТекстов = Новый Массив;
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	
	ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеПланаОплатыПоставщику", ТекстПланыОплат);
	МассивТекстов.Добавить(УвеличитьПланОплатыПоставщику(Операция, ВидОперацииДляСортировки));
	
	ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеПланаПоставки", ТекстПланыПоставок);
	ТекстыШаблоновВТ.Вставить("ВтУвеличениеПланаПоставки", ТекстЗапросаВТУвеличениеПланаПоставки());
	МассивТекстов.Добавить(УвеличитьПланПоставкиОтПоставщика(Операция, ВидОперацииДляСортировки));
	
	ТекстРасчетыСПоставщиками = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыШаблоновОтражения = Новый Структура();
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСПоставщиками", ТекстРасчетыСПоставщиками);
	КонецЕсли;
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ИдентификаторНеиспользуемойФинЗаписи", ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи());
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента, ТекстыШаблоновВТ);
	
КонецПроцедуры

// Дополняет тексты запроса проведения документа текстами проведения заказа поставщику по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПланыОплат - Строка - Текст запроса получения данных для отражения плана оплат поставщику.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты механизма]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты всего документа/этапа оплаты.
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыПоставщику - Вариант оплаты этапа графика.
// 	     * КОплате - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов (с учетом залога за тару).
// 	ТекстПланыПоставок - Строка - Текст запроса получения данных документа для отражения плана отгрузки.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты документа]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ДатаПоступления - Дата - Плановая дата поставки строки/документа.
// 	     * УвеличитьКПоступлению - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к поступлению в валюте документа (с учетом залога за тару).
// 
Процедура ПроведениеЗаказаПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат = "", ТекстПланыПоставок = "") Экспорт
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекстПланыОплат = "" И ТекстПланыПоставок = "" Тогда
		Возврат;
	КонецЕсли;
	
	Операция = "ЗаказПоставщику";
	ВидОперацииДляСортировки = "1";
	
	#Область ВременныеТаблицы
	
	ТекстыШаблоновВТ = Новый Структура();
	
	#КонецОбласти
	
	#Область Проведение
	
	МассивТекстов = Новый Массив;
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	
	Если ЗначениеЗаполнено(ТекстПланыОплат) Тогда
		ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеПланаОплатыПоставщику", ТекстПланыОплат);
		МассивТекстов.Добавить(УвеличитьПланОплатыПоставщику(Операция, ВидОперацииДляСортировки));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстПланыПоставок) Тогда
		ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеПланаПоставки", ТекстПланыПоставок);
		ТекстыШаблоновВТ.Вставить("ВтУвеличениеПланаПоставки", ТекстЗапросаВТУвеличениеПланаПоставки());
		МассивТекстов.Добавить(УвеличитьПланПоставкиОтПоставщика(Операция, ВидОперацииДляСортировки));
	КонецЕсли;
	
	ТекстРасчетыСПоставщиками = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыШаблоновОтражения = Новый Структура();
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСПоставщиками", ТекстРасчетыСПоставщиками);
	КонецЕсли;
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ИдентификаторНеиспользуемойФинЗаписи", ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи());
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента, ТекстыШаблоновВТ);
	
КонецПроцедуры

// Дополняет тексты запроса проведения документа текстами проведения оплаты поставщику по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстОплата - Строка - Текст запроса получения данных оплаты.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому производится платеж.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ДатаПогашения - Дата - Плановая дата погашения аванса
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма платежа в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма платежа в валюте взаиморасчетов.
// 	     * УменьшениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к уменьшению "Оплачивается", например, при оплате по заявке.
// 	     * УвеличениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к увеличению "Оплачивается", например, когда платежка проведена в системе, но не подтверждена банком.
// 	     * СуммаУпр - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма платежа в валюте управленческого учета
// 	     * СуммаРегл - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма платежа в валюте регламентированного учета
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ЗаявкаНаРасходованиеДенежныхСредств - ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств - Заявка, по которой происходит оплата.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * ИдентификаторФинЗаписи - Строка - Строка со значением уникального идентификатора шапки или строки документа.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка хозяйственной операции документа.
// 	ВидОперацииДляСортировки - Строка - Вид операции строкой для сортировки распределения в пределах дня, если он отличается от значения по умолчанию.
Процедура ПроведениеОплатыПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстОплата, ВидОперацииДляСортировки = "") Экспорт
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекстОплата) Тогда
		Возврат;
	КонецЕсли;
	
	Операция = "ОплатаПоставщику";
	ВидОперацииДляСортировки = ?(ЗначениеЗаполнено(ВидОперацииДляСортировки),ВидОперацииДляСортировки,"4");
	
	#Область ВременныеТаблицы
	
	ТекстыШаблоновВТ = Новый Структура();
	
	//Перенос платежа по центральному договору
	ТекстыШаблоновВТ.Вставить("втПереносРасчетовПоставщик", ВзаиморасчетыПроведение.ТекстВтПереносаРасчетов("УвеличениеЗадолженностиПоставщика"));
	
	#КонецОбласти
	
	#Область Проведение
	
	МассивТекстов = Новый Массив;
	ТекстыЗапросовДанныхДокумента = Новый Структура();

	//Перенос платежа по центральному договору
	МассивТекстов.Добавить(ОтразитьПереносРасчетовСПоставщиком(Запрос, "ПереносПлатежаПоЦентрализованномуДоговору", ВидОперацииДляСортировки));
	
	ТекстыЗапросовДанныхДокумента.Вставить("УменьшениеПланаОплатыПоставщику", ТекстОплата);
	МассивТекстов.Добавить(УменьшитьПланОплатыПоставщику(Операция, ВидОперацииДляСортировки));
	
	ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеЗадолженностиПоставщика", ТекстОплата);
	МассивТекстов.Добавить(УвеличитьЗадолженностьПоставщика(Операция, ВидОперацииДляСортировки));
	
	ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеОплачиваетсяПоставщику", ТекстОплата);
	МассивТекстов.Добавить(УвеличитьОплачиваетсяПоставщику(Операция, ВидОперацииДляСортировки));
	
	ТекстыЗапросовДанныхДокумента.Вставить("УменьшениеОплачиваетсяПоставщику", ТекстОплата);
	МассивТекстов.Добавить(УменьшитьОплачиваетсяПоставщику(ВидОперацииДляСортировки));
	
	ТекстРасчетыСПоставщиками = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыШаблоновОтражения = Новый Структура();
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСПоставщиками", ТекстРасчетыСПоставщиками);
	КонецЕсли;
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ИдентификаторНеиспользуемойФинЗаписи", ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи());
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента, ТекстыШаблоновВТ);
	
КонецПроцедуры

// Дополняет тексты запроса проведения документа текстами проведения закупки по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстЗакупка - Строка - Текст запроса получения данных документа. Отражает саму закупку.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты всего документа/этапа оплаты.
// 	     * ЗаказЗакупки - ДокументСсылка - Заказ, по которому происходит закупка.
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма закупки в валюте документа (включая залог за тару).
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма закупки в валюте взаиморасчетов (включая залог за тару).
// 	     * ЗалогЗаТару - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма залога за тару в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * НакладнаяПоЗаказам - Булево - Накладная введена по заказу(ам).
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	ТекстПланОплат - Строка - Текст запроса получения данных документа плановой оплаты поставщику. Отражает увеличение плана оплаты поставщику.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты всего документа/этапа оплаты.
// 	     * НакладнаяПоЗаказам - Булево - Накладная введена по заказу(ам).
// 	     * СверхЗаказа - Булево - Это приобретение сверх заказа.
// 	     * ЗаказЗакупки - ДокументСсылка - Заказ, по которому происходит закупка.
// 	     * КОплате - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыПоставщику - Вариант оплаты этапа графика.
// 	ТекстПереносАванса - Строка - Текст запроса получения данных документа по зачтенным авансам.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов аванса.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция переноса или резервирования аванса.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	ТекстТовары - Строка - Текст запроса получения данных документа плановой поставки от поставщика. Отражает увеличение плана поставки поставщиком.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * НакладнаяПоЗаказам - Булево - Накладная введена по заказу(ам).
// 	     * СверхЗаказа - Булево - Это приобретение сверх заказа.
// 	     * ЗаказЗакупки - ДокументСсылка - Заказ, по которому происходит закупка.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма взаиморасчетов строки товаров, уменьшает план поставки.
// 	     * УвеличитьКПоступлению - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма увеличения плана поставки.
// 	     * УменьшитьКПоступлению - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма уменьшения плана поставки.
// 	ВидОперацииДляСортировки - Строка - Вид операции строкой для сортировки распределения в пределах дня,
// 	                                    если он отличается от значения по умолчанию.
//
Процедура ПроведениеЗакупки(Запрос, ТекстыЗапроса, Регистры, ТекстЗакупка, ТекстПланОплат, ТекстПереносАванса = "", ТекстТовары = "", ВидОперацииДляСортировки = "") Экспорт
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекстЗакупка = "" И ТекстПланОплат = "" И ТекстПереносАванса = "" И ТекстТовары = "" Тогда
		Возврат;
	КонецЕсли;
	
	Операция = "Закупка";
	ВидОперацииДляСортировки = ?(ЗначениеЗаполнено(ВидОперацииДляСортировки), ВидОперацииДляСортировки, "2");
	
	#Область ВременныеТаблицы
	
	ТекстыШаблоновВТ = Новый Структура();
	
	#КонецОбласти
	
	#Область Проведение
	
	МассивТекстов = Новый Массив;
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	
	// Зачет аванса
	Если ЗначениеЗаполнено(ТекстПереносАванса) Тогда
		ТекстыЗапросовДанныхДокумента.Вставить("ТаблицаРасшифровкаПлатежаПоставщик", ТекстПереносАванса);
		МассивТекстов.Добавить(ОтразитьПереносРасчетовСПоставщиком(Запрос, Операция, ВидОперацииДляСортировки)); //Перенос авансов по накладным
	КонецЕсли;
	
	// Перенос задолженности по центральному договору
	Если ЗначениеЗаполнено(ТекстЗакупка) Тогда
		МассивТекстов.Добавить(ТекстПереносЗадолженностиПоставщикаМеждуФилиалами(ВидОперацииДляСортировки));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстПланОплат) Тогда
		
		// Увеличение плана оплат
		ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеПланаОплатыПоставщику", ТекстПланОплат);
		МассивТекстов.Добавить(УвеличитьПланОплатыПоставщику(Операция,ВидОперацииДляСортировки));
		
		// Уменьшение плана оплаты по заказам
		ТекстыЗапросовДанныхДокумента.Вставить("УменьшениеПланаОплатыПоставщику", ТекстПланОплат);
		МассивТекстов.Добавить(УменьшитьПланОплатыПоставщику(Операция, ВидОперацииДляСортировки, ,ЗначениеЗаполнено(ТекстТовары)));
		
	КонецЕсли;
	
	// Увеличение задолженности поставщику
	Если ЗначениеЗаполнено(ТекстЗакупка) Тогда
		ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеНашейЗадолженностиПоставщику", ТекстЗакупка);
		МассивТекстов.Добавить(УвеличитьНашуЗадолженностьПоставщику(Операция, ВидОперацииДляСортировки));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстТовары) Тогда
		
		// Уменьшение плана поставки
		ТекстыЗапросовДанныхДокумента.Вставить("УменьшениеПланаПоставки", ТекстТовары);
		ТекстыШаблоновВТ.Вставить("ВтУменьшениеПланаПоставки", ТекстЗапросаВТУменьшениеПланаПоставки());
		МассивТекстов.Добавить(УменьшитьПланПоставкиОтПоставщика(ВидОперацииДляСортировки));
	
		// Увеличение плана поставки - сверх заказа
		ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеПланаПоставки", ТекстТовары);
		ТекстыШаблоновВТ.Вставить("ВтУвеличениеПланаПоставки", ТекстЗапросаВТУвеличениеПланаПоставки(Истина));
		МассивТекстов.Добавить(УвеличитьПланПоставкиОтПоставщика(Операция, ВидОперацииДляСортировки));
		
	КонецЕсли;
	
	ТекстРасчетыСПоставщиками = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыШаблоновОтражения = Новый Структура();
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСПоставщиками", ТекстРасчетыСПоставщиками);
	КонецЕсли;
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ИдентификаторНеиспользуемойФинЗаписи", ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи());
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента, ТекстыШаблоновВТ);
	
КонецПроцедуры

// Дополняет тексты запроса проведения документа текстами проведения заявки на оплату поставщику по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстВзаиморасчеты - Строка - Текст запроса получения данных заявки.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому планируется платеж.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * УвеличениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма заявки в валюте взаиморасчетов к оплате.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
//
Процедура ПроведениеЗаявкиНаОплатуПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстВзаиморасчеты) Экспорт
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекстВзаиморасчеты = "" Тогда
		Возврат;
	КонецЕсли;
	
	Операция = "ЗаявкаНаОплатуПоставщику";
	ВидОперацииДляСортировки = "1";
	#Область ВременныеТаблицы
	
	ТекстыШаблоновВТ = Новый Структура();
	
	#КонецОбласти
	
	#Область Проведение
	
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	
	ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеОплачиваетсяПоставщику", ТекстВзаиморасчеты);
	ТекстУвеличенияПланаОплаты = УвеличитьОплачиваетсяПоставщику(Операция,ВидОперацииДляСортировки);
	
	ТекстРасчетыСПоставщиками = ТекстУвеличенияПланаОплаты;
	
	ТекстыШаблоновОтражения = Новый Структура();
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСПоставщиками", ТекстРасчетыСПоставщиками);
	КонецЕсли;
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ИдентификаторНеиспользуемойФинЗаписи", ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи());
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента, ТекстыШаблоновВТ);
	
КонецПроцедуры

// Дополняет тексты запроса проведения документа текстами проведения возврата оплаты от поставщика по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстЗадолженность - Строка - Текст запроса получения данных возврата. Отражает сам возврат ДС.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ИдентификаторФинЗаписи - Строка - Идентификатор финансового движения для организации двойной записи.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка отражения хозяйственной операции в фин. учете.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ИдентификаторФинЗаписи - Строка - Строка со значением уникального идентификатора шапки или строки документа.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка хозяйственной операции документа.
// 	ТекстПереносРасчетов - Строка - Необязательный, текст запроса получения данных расшифровки платежа, на которую необходимо перенести возврат ДС.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, на который зачитывается возврат ДС.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому планируется платеж.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция переноса расчетов.
// 	     [Реквизиты табличной части]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма зачета в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма зачета в валюте взаиморасчетов.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
//
Процедура ПроведениеВозвратаОплатыОтПоставщика(Запрос, ТекстыЗапроса, Регистры, ТекстЗадолженность, ТекстПереносРасчетов = "") Экспорт
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекстЗадолженность = "" И ТекстПереносРасчетов = "" Тогда
		Возврат;
	КонецЕсли;
	
	Операция = "ВозвратОплатыОтПоставщика";
	ВидОперацииДляСортировки = "5";
	
	#Область ВременныеТаблицы
	
	ТекстыШаблоновВТ = Новый Структура();
	
	#КонецОбласти
	
	#Область Проведение
	
	МассивТекстов = Новый Массив;
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	
	Если ЗначениеЗаполнено(ТекстЗадолженность) Тогда
	
		ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеНашейЗадолженностиПоставщику", ТекстЗадолженность);
		МассивТекстов.Добавить(УвеличитьНашуЗадолженностьПоставщику(Операция, ВидОперацииДляСортировки));
		
		ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеПланаОплатыПоставщику", ТекстЗадолженность);
		МассивТекстов.Добавить(УвеличитьПланОплатыПоставщику(Операция, ВидОперацииДляСортировки));
	
	КонецЕсли;
	
	// Перенос аванса
	Если ЗначениеЗаполнено(ТекстПереносРасчетов) Тогда
		ТекстыЗапросовДанныхДокумента.Вставить("ТаблицаРасшифровкаПлатежаПоставщик", ТекстПереносРасчетов);
		МассивТекстов.Добавить(ОтразитьПереносРасчетовСПоставщиком(Запрос, Операция, ВидОперацииДляСортировки, "2"));
	КонецЕсли;
	
	ТекстРасчетыСПоставщиками = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыШаблоновОтражения = Новый Структура();
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСПоставщиками", ТекстРасчетыСПоставщиками);
	КонецЕсли;
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ИдентификаторНеиспользуемойФинЗаписи", ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи());
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента, ТекстыШаблоновВТ);
	
КонецПроцедуры

// Дополняет тексты запроса проведения документа текстами проведения возврата товаров поставщику по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстВозврат - Строка - Текст запроса получения данных документа.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * Организация - СправочникСсылка.Организации - Организация возврата товаров.
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ИдентификаторФинЗаписи - Строка - Идентификатор финансового движения для организации двойной записи.
// 	       В большинстве случаев поле определяется как ОбъектРасчетов.УникальныйИдентификатор, в особых случаях может иметь значение не связанное с объектом расчетов.
// 	     * НастройкаХозяйственнойОперации - Неопределено, СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка отражения хозяйственной операции в фин. учете.
// 	       В большинстве случаев поле имеет значение Неопределено, в особых случаях может быть указана ссылка на элемент справочника.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	ТекстПереносРасчетов - Строка - Текст запроса получения данных расшифровки платежа возврата, на которую происходит зачет возврата.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, на который происходит зачет возврата.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов объекта расчетов, на который происходит зачет возврата.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты табличной части]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
//
Процедура ПроведениеВозвратаТоваровПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстВозврат, ТекстПереносРасчетов = "") Экспорт
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Операция = "ВозвратТоваровПоставщику";
	ВидОперацииДляСортировки = "3";
	
	#Область ВременныеТаблицы
	
	ТекстыШаблоновВТ = Новый Структура();
	
	// Перенос задолженности по центральному договору
	ТекстыШаблоновВТ.Вставить("втПереносРасчетовПоставщик", ВзаиморасчетыПроведение.ТекстВтПереносаРасчетов("УвеличениеЗадолженностиПоставщика"));
	
	#КонецОбласти
	
	#Область Проведение
	
	МассивТекстов = Новый Массив;
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	
	МассивТекстов.Добавить(ОтразитьПереносРасчетовСПоставщиком(Запрос, "ПереносВозвратаТоваровПоЦентрализованномуДоговору", ВидОперацииДляСортировки, "1"));
	
	ТекстыЗапросовДанныхДокумента.Вставить("УменьшениеПланаОплатыПоставщику", ТекстВозврат);
	МассивТекстов.Добавить(УменьшитьПланОплатыПоставщику(Операция, ВидОперацииДляСортировки, "2"));
	
	ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеЗадолженностиПоставщика", ТекстВозврат);
	МассивТекстов.Добавить(УвеличитьЗадолженностьПоставщика(Операция, ВидОперацииДляСортировки, "2"));
	
	Если ЗначениеЗаполнено(ТекстПереносРасчетов) Тогда
		ТекстыЗапросовДанныхДокумента.Вставить("ТаблицаРасшифровкаПлатежаПоставщик", ТекстПереносРасчетов);
		МассивТекстов.Добавить(ОтразитьПереносРасчетовСПоставщиком(Запрос, Операция, ВидОперацииДляСортировки, "3"));
	КонецЕсли;
	
	ТекстРасчетыСПоставщиками = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыШаблоновОтражения = Новый Структура();
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСПоставщиками", ТекстРасчетыСПоставщиками);
	КонецЕсли;
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ИдентификаторНеиспользуемойФинЗаписи", ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи());
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента, ТекстыШаблоновВТ);
	
КонецПроцедуры

// Дополняет тексты запроса проведения документа текстами проведения заказа клиента по регистру Расчеты с клиентами.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПланыОплат - Строка - Текст запроса получения данных для отражения плана оплат.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты механизма]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ДатаПлатежа - Дата - Плановая дата оплаты всего документа/этапа оплаты.
// 	     * ВариантОплаты - ПеречислениеСсылка.ВариантыКонтроляОплатыКлиентом - Вариант оплаты этапа графика.
// 	     * КОплате - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов (с учетом залога за тару).
// 
Процедура ПроведениеРасчетыСПоставщикамиПланОплат(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат) Экспорт
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщикамиПланОплат", Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекстПланыОплат) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыШаблоновОтражения = Новый Структура();
	
	#Область ВременныеТаблицы
	
	ТекстыШаблоновВТ = Новый Структура();
	
	#КонецОбласти
	
	#Область ПроведениеРасчетыСПоставщикамиПланОплат
	
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеПланаОплатыПоставщику", ТекстПланыОплат);
	
	ТекстЗапроса ="ВЫБРАТЬ
		|	УвеличениеПланаОплатыПоставщику.ДатаРегистратора                    КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                              КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(Аналитика.КлючАналитики, Неопределено)                     КАК АналитикаУчетаПоПартнерам,
		|	УвеличениеПланаОплатыПоставщику.ОбъектРасчетов                      КАК ОбъектРасчетов,
		|	УвеличениеПланаОплатыПоставщику.ВалютаВзаиморасчетов                КАК Валюта,
		|	
		|	УвеличениеПланаОплатыПоставщику.КОплате                             КАК КОплате,
		|	
		|	УвеличениеПланаОплатыПоставщику.Ссылка                              КАК ДокументПлан,
		|	УвеличениеПланаОплатыПоставщику.ДатаПлатежа                         КАК ДатаПлановогоПогашения,
		|	УвеличениеПланаОплатыПоставщику.ДатаРегистратора                    КАК ДатаВозникновения,
		|	УвеличениеПланаОплатыПоставщику.ДатаРегистратора                    КАК ДатаРегистратора,
		|	УвеличениеПланаОплатыПоставщику.НомерРегистратора                   КАК НомерРегистратора,
		|	УвеличениеПланаОплатыПоставщику.ВариантОплаты                       КАК ВариантОплаты,
		|	1                                                                   КАК Вид,
		|	УвеличениеПланаОплатыПоставщику.Ссылка                              КАК ДокументРегистратор,
		|	
		|	УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Организация          КАК Организация,
		|	УвеличениеПланаОплатыПоставщику.Партнер                             КАК Партнер,
		|	УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Контрагент           КАК Контрагент,
		|	УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Договор              КАК Договор,
		|	НаправленияДеятельности.НаправлениеАналитики                        КАК НаправлениеДеятельности
		|ИЗ
		|	#УвеличениеПланаОплатыПоставщику КАК УвеличениеПланаОплатыПоставщику
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельности
		|			ПО УвеличениеПланаОплатыПоставщику.ОбъектРасчетов = НаправленияДеятельности.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
		|			ПО УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Организация = Аналитика.Организация
		|				И УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Контрагент = Аналитика.Контрагент
		|				И УвеличениеПланаОплатыПоставщику.Партнер = Аналитика.Партнер
		|				И УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Договор = Аналитика.Договор
		|				И НаправленияДеятельности.НаправлениеАналитики = Аналитика.НаправлениеДеятельности
		|";
	
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщикамиПланОплат", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСПоставщикамиПланОплат", ТекстЗапроса);
	КонецЕсли;
	
	#КонецОбласти
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента, ТекстыШаблоновВТ);
	
КонецПроцедуры

// Дополняет тексты запроса проведения документа текстами проведения заказа клиента по регистру Расчеты с клиентами.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстПланыПоставок - Строка - Текст запроса получения данных для отражения плана оплат.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов документа.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     [Реквизиты механизма]
// 	     * ПорядокРасчетов - ПеречислениеСсылка.ПорядокРасчетов - Порядок/детализация расчетов документа.
// 	     * ДатаПогашения - Дата - Плановая дата поставки
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к оплате в валюте взаиморасчетов (с учетом залога за тару).
// 	ЭтоГрафикДоговора - Булево - Проводится график исполнения договора, иначе заказ
//
Процедура ПроведениеРасчетыСПоставщикамиПланПоставок(Запрос, ТекстыЗапроса, Регистры, ТекстПланыПоставок, ЭтоГрафикДоговора = Ложь) Экспорт
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщикамиПланПоставок", Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекстПланыПоставок) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыШаблоновОтражения = Новый Структура();
	
	#Область ПроведениеРасчетыСПоставщикамиПланПоставок
	
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеПланаПоставки", ТекстПланыПоставок);
	
	Запрос.УстановитьПараметр("ЭтоГрафикДоговора",ЭтоГрафикДоговора);
	
	ТекстЗапроса ="ВЫБРАТЬ
		|	УвеличениеПланаПоставки.ДатаРегистратора                    КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                      КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(Аналитика.КлючАналитики, Неопределено)             КАК АналитикаУчетаПоПартнерам,
		|	УвеличениеПланаПоставки.ОбъектРасчетов                      КАК ОбъектРасчетов,
		|	УвеличениеПланаПоставки.ВалютаВзаиморасчетов                КАК Валюта,
		|	
		|	УвеличениеПланаПоставки.УвеличитьКПоступлению               КАК Сумма,
		|	
		|	УвеличениеПланаПоставки.Ссылка                              КАК ДокументПлан,
		|	УвеличениеПланаПоставки.ДатаПоступления                     КАК ДатаПлановогоПогашения,
		|	УвеличениеПланаПоставки.ДатаРегистратора                    КАК ДатаВозникновения,
		|	УвеличениеПланаПоставки.ДатаРегистратора                    КАК ДатаРегистратора,
		|	УвеличениеПланаПоставки.НомерРегистратора                   КАК НомерРегистратора,
		|	ЛОЖЬ                                                        КАК НераспределенныйАванс,
		|	1                                                           КАК Вид,
		|	УвеличениеПланаПоставки.Ссылка                              КАК ДокументРегистратор,
		|	
		|	ВЫБОР КОГДА ЕСТЬNULL(ДанныеДоговора.ЦентрализованныйДоговор, Ложь)
		|					ТОГДА УвеличениеПланаПоставки.Организация
		|					ИНАЧЕ УвеличениеПланаПоставки.ОбъектРасчетов.Организация
		|	КОНЕЦ                                                       КАК Организация,
		|	УвеличениеПланаПоставки.Партнер                             КАК Партнер,
		|	УвеличениеПланаПоставки.ОбъектРасчетов.Контрагент           КАК Контрагент,
		|	УвеличениеПланаПоставки.ОбъектРасчетов.Договор              КАК Договор,
		|	НаправленияДеятельности.НаправлениеАналитики                КАК НаправлениеДеятельности
		|ИЗ
		|	#УвеличениеПланаПоставки КАК УвеличениеПланаПоставки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельности
		|			ПО УвеличениеПланаПоставки.ОбъектРасчетов = НаправленияДеятельности.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка = УвеличениеПланаПоставки.ОбъектРасчетов.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
		|			ПО ВЫБОР КОГДА ЕСТЬNULL(ДанныеДоговора.ЦентрализованныйДоговор, Ложь)
		|					ТОГДА УвеличениеПланаПоставки.Организация
		|					ИНАЧЕ УвеличениеПланаПоставки.ОбъектРасчетов.Организация
		|				КОНЕЦ = Аналитика.Организация
		|				И УвеличениеПланаПоставки.ОбъектРасчетов.Контрагент = Аналитика.Контрагент
		|				И УвеличениеПланаПоставки.Партнер = Аналитика.Партнер
		|				И УвеличениеПланаПоставки.ОбъектРасчетов.Договор = Аналитика.Договор
		|				И НаправленияДеятельности.НаправлениеАналитики = Аналитика.НаправлениеДеятельности
		|ГДЕ
		|	УвеличениеПланаПоставки.УвеличитьКПоступлению <> 0
		|	И УвеличениеПланаПоставки.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)
		|	И (&ЭтоГрафикДоговора ИЛИ НЕ ЕСТЬNULL(ДанныеДоговора.ЗаданГрафикИсполнения, ЛОЖЬ))
		|";
	
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщикамиПланПоставок", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСПоставщикамиПланПоставок", ТекстЗапроса);
	КонецЕсли;
	
	#КонецОбласти
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента);
	
КонецПроцедуры

// Дополняет тексты запроса проведения документа текстами проведения возврата товаров поставщику по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстВозврат - Строка - Текст запроса получения данных документа.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * Организация - СправочникСсылка.Организации - Организация возврата товаров.
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ИдентификаторФинЗаписи - Строка - Идентификатор финансового движения для организации двойной записи.
// 	       В большинстве случаев поле определяется как ОбъектРасчетов.УникальныйИдентификатор, в особых случаях может иметь значение не связанное с объектом расчетов.
// 	     * НастройкаХозяйственнойОперации - Неопределено, СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка отражения хозяйственной операции в фин. учете.
// 	       В большинстве случаев поле имеет значение Неопределено, в особых случаях может быть указана ссылка на элемент справочника.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	ТекстПереносРасчетов - Строка - Текст запроса получения данных расшифровки платежа возврата, на которую происходит зачет возврата.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, на который происходит зачет возврата.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов объекта расчетов, на который происходит зачет возврата.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты табличной части]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
//
Процедура ПроведениеПереносаАвансаПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстПереносРасчетов = "") Экспорт
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Операция = "ПереносАвансаПоставщику";
	ВидОперацииДляСортировки = "4";
	
	#Область Проведение
	
	МассивТекстов = Новый Массив;
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	ТекстыЗапросовДанныхДокумента.Вставить("ТаблицаРасшифровкаПлатежаПоставщик", ТекстПереносРасчетов);
	МассивТекстов.Добавить(ОтразитьПереносРасчетовСПоставщиком(Запрос, Операция,ВидОперацииДляСортировки));
	
	ТекстРасчетыСПоставщиками = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыШаблоновОтражения = Новый Структура();
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСПоставщиками", ТекстРасчетыСПоставщиками);
	КонецЕсли;
	
	#КонецОбласти
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента);
	
КонецПроцедуры

// Дополняет тексты запроса проведения документа текстами проведения возврата товаров поставщику по регистру Расчеты с поставщиками.
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстВозврат - Строка - Текст запроса получения данных документа.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * Организация - СправочникСсылка.Организации - Организация возврата товаров.
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ИдентификаторФинЗаписи - Строка - Идентификатор финансового движения для организации двойной записи.
// 	       В большинстве случаев поле определяется как ОбъектРасчетов.УникальныйИдентификатор, в особых случаях может иметь значение не связанное с объектом расчетов.
// 	     * НастройкаХозяйственнойОперации - Неопределено, СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка отражения хозяйственной операции в фин. учете.
// 	       В большинстве случаев поле имеет значение Неопределено, в особых случаях может быть указана ссылка на элемент справочника.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма возврата в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	ТекстПереносРасчетов - Строка - Текст запроса получения данных расшифровки платежа возврата, на которую происходит зачет возврата.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     * ОбъектРасчетовИсточник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов возврата.
// 	     * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, на который происходит зачет возврата.
// 	     [Общие]
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов объекта расчетов, на который происходит зачет возврата.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты табличной части]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте взаиморасчетов.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
//
Процедура ПроведениеВозвратаПереносаАвансаПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстПереносРасчетов = "") Экспорт
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Операция = "ВозвратПереносаАвансаПоставщику";
	ВидОперацииДляСортировки = "5";
	#Область Проведение
	
	МассивТекстов = Новый Массив;
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	ТекстыЗапросовДанныхДокумента.Вставить("ТаблицаРасшифровкаПлатежаПоставщик", ТекстПереносРасчетов);
	МассивТекстов.Добавить(ОтразитьПереносРасчетовСПоставщиком(Запрос, Операция, ВидОперацииДляСортировки));
	
	ТекстРасчетыСПоставщиками = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыШаблоновОтражения = Новый Структура();
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСПоставщиками", ТекстРасчетыСПоставщиками);
	КонецЕсли;
	
	#КонецОбласти
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента);
	
КонецПроцедуры

// Дополняет тексты запроса проведения документа текстами проведения оплаты от клиента по регистру Расчеты с клиентами
// и регистру Расчеты с поставщиками. Расход по регистру расчеты с клиентами и приход по регистру расчеты с поставщиками
//
// Параметры:
// 	Запрос - Запрос - Запрос отражения документа.
// 	ТекстыЗапроса - СписокЗначений - Список текстов запроса отражения документа.
// 	Регистры - Неопределено, Структура, Строка - Список регистров для отражения.
// 	ТекстОбязательстваКлиента - Строка - Текст запроса получения данных оплаты.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому производится платеж.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     [Реквизиты документа]
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма оплаты в валюте взаиморасчетов.
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма расчетов в валюте документа.
// 	     * Оплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма увеличения "Оплачивается".
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * СчетНаОплату - ДокументСсылка.СчетНаОплатуКлиенту - Счет, по которому производится оплата.
// 	     * СвязанныйДокумент - ДокументСсылка.РеализацияТоваровУслуг,
// 	                           ДокументСсылка.РеализацияУслугПрочихАктивов - Связанный документ корректировки для определения курса отражения.
// 	     * ИдентификаторФинЗаписи - Строка - Строка со значением уникального идентификатора шапки или строки документа.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка хозяйственной операции документа.
// 	ТекстОбязательстваПоставщику - Строка - Текст запроса получения данных оплаты.
// 	     Запрос должен возвращать выборку полей:
// 	     * Ссылка - ДокументСсылка - Документ-регистратор операции.
// 	     [Общие]
// 	     * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов, по которому производится платеж.
// 	     * ДатаРегистратора - Дата - Дата и время документа регистратора.
// 	     * НомерРегистратора - Строка - Номер документа регистратора.
// 	     * ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов документа.
// 	     * ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
// 	     * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	     * ИдентификаторФинЗаписи - Строка - Идентификатор финансового движения для организации двойной записи.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка отражения хозяйственной операции в фин. учете.
// 	     [Реквизиты документа]
// 	     * Сумма - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма платежа в валюте документа.
// 	     * СуммаВзаиморасчетов - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма платежа в валюте взаиморасчетов.
// 	     * УменьшениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к уменьшению "Оплачивается", например, при оплате по заявке.
// 	     * УвеличениеОплачивается - ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака - Сумма к увеличению "Оплачивается", например, когда платежка проведена в системе, но не подтверждена банком.
// 	     * СтатьяДвиженияДенежныхСредств - СправочникСсылка.СтатьиДвиженияДенежныхСредств - Статья ДДС.
// 	     * ЗаявкаНаРасходованиеДенежныхСредств - ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств - Заявка, по которой происходит оплата.
// 	     * ФормаОплаты - ПеречислениеСсылка.ФормыОплаты - Форма оплаты документа.
// 	     * ДатаКурса - Дата - Дата, на которую следует взять курсы валют для расчета сумм в управленческом и регламентированном учете.
// 	     * ИдентификаторФинЗаписи - Строка - Строка со значением уникального идентификатора шапки или строки документа.
// 	     * НастройкаХозяйственнойОперации - СправочникСсылка.НастройкиХозяйственныхОпераций - Настройка хозяйственной операции документа.
//
Процедура ПроведениеЗачетаВстречнойЗадолженности(Запрос, ТекстыЗапроса, Регистры, ТекстОбязательстваКлиента, ТекстОбязательстваПоставщику) Экспорт
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСКлиентами", Регистры)
			И НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		Возврат;
	КонецЕсли;

	#Область РасчетыСКлиентами
	// Проведение по клиентам
	Операция = "ЗачетВстречныхОбязательствКлиента";
	ВидОперацииДляСортировки = "4";
	
	#Область ВременныеТаблицы
	
	ТекстыШаблоновВТ = Новый Структура();
	
	// Перенос платежа по центральному договору
	ТекстыШаблоновВТ.Вставить("втПереносРасчетовКлиент", ВзаиморасчетыПроведение.ТекстВтПереносаРасчетов("ТаблицаОплатаОтКлиента"));

	#КонецОбласти
	
	#Область Проведение
	
	МассивТекстов = Новый Массив;
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	
	ТекстыЗапросовДанныхДокумента.Вставить("УменьшениеПланаОплатыОтКлиента", ТекстОбязательстваКлиента);
	МассивТекстов.Добавить(ВзаиморасчетыПроведениеКлиенты.УменьшитьПланОплатыОтКлиента(Операция, ВидОперацииДляСортировки));
	
	ТекстыЗапросовДанныхДокумента.Вставить("ТаблицаОплатаОтКлиента", ТекстОбязательстваКлиента);
	МассивТекстов.Добавить(ВзаиморасчетыПроведениеКлиенты.УвеличитьНашуЗадолженностьКлиенту(Операция, ВидОперацииДляСортировки, "5"));
	
	ТекстРасчетыСКлиентами = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыШаблоновОтражения = Новый Структура();
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСКлиентами", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСКлиентами", ТекстРасчетыСКлиентами);
	КонецЕсли;
	
	#КонецОбласти
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента, ТекстыШаблоновВТ);
	
	#КонецОбласти
	
	#Область РасчетыСПоставщиками
	// Проведение по поставщикам
	Операция = "ЗачетОбязательствПоставщика";
	
	#Область ВременныеТаблицы
	
	ТекстыШаблоновВТ = Новый Структура();
	
	//Перенос платежа по центральному договору
	ТекстыШаблоновВТ.Вставить("втПереносРасчетовПоставщик", ВзаиморасчетыПроведение.ТекстВтПереносаРасчетов("УвеличениеЗадолженностиПоставщика"));

	#КонецОбласти
	
	#Область Проведение
	
	МассивТекстов = Новый Массив;
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	
	ТекстыЗапросовДанныхДокумента.Вставить("УменьшениеПланаОплатыПоставщику", ТекстОбязательстваПоставщику);
	МассивТекстов.Добавить(УменьшитьПланОплатыПоставщику(Операция, ВидОперацииДляСортировки));
	
	ТекстыЗапросовДанныхДокумента.Вставить("УвеличениеЗадолженностиПоставщика", ТекстОбязательстваПоставщику);
	МассивТекстов.Добавить(УвеличитьЗадолженностьПоставщика(Операция, ВидОперацииДляСортировки, "5"));
	
	ТекстРасчетыСПоставщиками = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстыШаблоновОтражения = Новый Структура();
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("РасчетыСПоставщиками", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("РасчетыСПоставщиками", ТекстРасчетыСПоставщиками);
	КонецЕсли;
	
	#КонецОбласти
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(Запрос, ТекстыЗапроса, ТекстыШаблоновОтражения, ТекстыЗапросовДанныхДокумента, ТекстыШаблоновВТ);
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ИдентификаторНеиспользуемойФинЗаписи", ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтразитьПереносРасчетовСПоставщиком(Запрос, Операция, ВидОперацииДляСортировки, ПорядокОперацииВПределахДокумента = "1")
	
	Если НЕ Запрос.Параметры.Свойство("ОбъектРасчетовАванс") Тогда
		ОбъектРасчетовАванс = Метаданные.ОпределяемыеТипы.ОбъектРасчетовАванс.Тип.Типы();
		Запрос.УстановитьПараметр("ОбъектРасчетовАванс", ОбъектРасчетовАванс);
	КонецЕсли;
	
	Если Операция = "Закупка" Тогда
		
		КредиторскаяЗадолженность = "ЛОЖЬ"; // что в источнике
		СторноИсточник = "ЛОЖЬ";
		СторноПриемник = "ЛОЖЬ";
		ЗаполнятьПриемникВИсточнике = "ИСТИНА";
		
		УсловиеОперации = "
		|	ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник <> ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовПриемник";
		
		ХозяйственнаяОперация = "ТаблицаРасшифровкаПлатежаПоставщик.ХозяйственнаяОперация";
		
		ФормаОплаты = "Неопределено";
		
		ОбъектРасчетовИсточникОрганизация = "ОбъектыРасчетовИсточники.Организация";
		ОбъектРасчетовПриемникОрганизация = "ОбъектыРасчетовПриемники.Организация";
	
		ОбъектРасчетовИсточникПартнер = "ОбъектыРасчетовИсточники.Партнер";
		ОбъектРасчетовПриемникПартнер = "ОбъектыРасчетовПриемники.Партнер";
		
		ВалютаВзаиморасчетовИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.ВалютаВзаиморасчетов";
		ВалютаВзаиморасчетовПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.ВалютаВзаиморасчетов";
		
		СуммаВзаиморасчетовИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		СуммаВзаиморасчетовПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		КОплатеИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		КОплатеПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		ДатаПлатежа = "ТаблицаРасшифровкаПлатежаПоставщик.ДатаРегистратора";
		
		ВариантОплаты = "ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления)";
		СтатьяДвиженияДенежныхСредств = "Неопределено";
	
		ИдентификаторФинЗаписи = "ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник.УникальныйИдентификатор";
		НастройкаХозяйственнойОперации = "ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПереносАванса)"; 
		
		ОперацияВзаиморасчетовИсточник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов)";
		ОперацияВзаиморасчетовПриемник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов)";
		
	ИначеЕсли Операция = "ПереносПлатежаПоЦентрализованномуДоговору" Тогда
		
		КредиторскаяЗадолженность = "ЛОЖЬ"; // что в источнике
		СторноИсточник = "ЛОЖЬ";
		СторноПриемник = "ЛОЖЬ";
		ЗаполнятьПриемникВИсточнике = "ИСТИНА";
		
		УсловиеОперации = "ТаблицаРасшифровкаПлатежаПоставщик.Организация <> ОбъектыРасчетовПриемники.Организация";
		
		ХозяйственнаяОперация = "ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносПлатежаМеждуФилиалами)";

		ФормаОплаты = "Неопределено";
		
		ОбъектРасчетовИсточникОрганизация = "ТаблицаРасшифровкаПлатежаПоставщик.Организация";
		ОбъектРасчетовПриемникОрганизация = "ОбъектыРасчетовПриемники.Организация";
		
		ОбъектРасчетовИсточникПартнер = "ТаблицаРасшифровкаПлатежаПоставщик.Партнер";
		ОбъектРасчетовПриемникПартнер = "ТаблицаРасшифровкаПлатежаПоставщик.Партнер";
		
		ВалютаВзаиморасчетовИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.ВалютаВзаиморасчетов";
		ВалютаВзаиморасчетовПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.ВалютаВзаиморасчетов";
		
		СуммаВзаиморасчетовИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		СуммаВзаиморасчетовПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		КОплатеИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		КОплатеПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		ДатаПлатежа = "ТаблицаРасшифровкаПлатежаПоставщик.ДатаРегистратора";
		ВариантОплаты = "ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки)";
		СтатьяДвиженияДенежныхСредств = "ТаблицаРасшифровкаПлатежаПоставщик.СтатьяДвиженияДенежныхСредств";
	
		ИдентификаторФинЗаписи = "ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник.УникальныйИдентификатор";
		НастройкаХозяйственнойОперации = "ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПереносПлатежаМеждуФилиалами)";
		
		ОперацияВзаиморасчетовИсточник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов)";
		ОперацияВзаиморасчетовПриемник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов)";
		ПорядокОперацииВПределахДокумента = "2";
		
	ИначеЕсли Операция = "ПереносВозвратаТоваровПоЦентрализованномуДоговору" Тогда
		
		КредиторскаяЗадолженность = "ЛОЖЬ"; // что в источнике
		СторноИсточник = "ЛОЖЬ";
		СторноПриемник = "ЛОЖЬ";
		ЗаполнятьПриемникВИсточнике = "ЛОЖЬ";
		
		УсловиеОперации = "ЕСТЬNULL(ДанныеДоговора.ЦентрализованныйДоговор, ЛОЖЬ)
		|	И ТаблицаРасшифровкаПлатежаПоставщик.Организация <> ОбъектыРасчетовПриемники.Организация";
		
		ХозяйственнаяОперация = "ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами)";

		ФормаОплаты = "Неопределено";
		
		ОбъектРасчетовИсточникОрганизация = "ТаблицаРасшифровкаПлатежаПоставщик.Организация";
		ОбъектРасчетовПриемникОрганизация = "ОбъектыРасчетовПриемники.Организация";
		
		ОбъектРасчетовИсточникПартнер = "ТаблицаРасшифровкаПлатежаПоставщик.Партнер";
		ОбъектРасчетовПриемникПартнер = "ТаблицаРасшифровкаПлатежаПоставщик.Партнер";
		
		ВалютаВзаиморасчетовИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.ВалютаВзаиморасчетов";
		ВалютаВзаиморасчетовПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.ВалютаВзаиморасчетов";
		
		СуммаВзаиморасчетовИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		СуммаВзаиморасчетовПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		КОплатеИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		КОплатеПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		ДатаПлатежа = "ТаблицаРасшифровкаПлатежаПоставщик.ДатаРегистратора";
		ВариантОплаты = "ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки)";
		СтатьяДвиженияДенежныхСредств = "ТаблицаРасшифровкаПлатежаПоставщик.СтатьяДвиженияДенежныхСредств";
	
		ИдентификаторФинЗаписи = "ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник.УникальныйИдентификатор";
		НастройкаХозяйственнойОперации = "ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПереносЗадолженностиМеждуФилиалами)";
		
		ОперацияВзаиморасчетовИсточник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов)";
		ОперацияВзаиморасчетовПриемник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов)";
		ПорядокОперацииВПределахДокумента = "2";
		
	ИначеЕсли Операция = "ВозвратОплатыОтПоставщика" Тогда
		
		КредиторскаяЗадолженность = "ЛОЖЬ";
		СторноИсточник = "ИСТИНА";
		СторноПриемник = "ЛОЖЬ";
		ЗаполнятьПриемникВИсточнике = "ИСТИНА";
		
		УсловиеОперации = "ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник <> ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовПриемник";
		
		ХозяйственнаяОперация = "ТаблицаРасшифровкаПлатежаПоставщик.ХозяйственнаяОперация";
		
		ФормаОплаты = "ТаблицаРасшифровкаПлатежаПоставщик.ФормаОплаты";
		
		ОбъектРасчетовИсточникОрганизация = "ОбъектыРасчетовИсточники.Организация";
		ОбъектРасчетовПриемникОрганизация = "ОбъектыРасчетовПриемники.Организация";
	
		//Возврат оплаты от дочернего партнера, должен пройти по дочернему партнеру, а не по головному
		ОбъектРасчетовИсточникПартнер = "ТаблицаРасшифровкаПлатежаПоставщик.Партнер";
		ОбъектРасчетовПриемникПартнер = "ТаблицаРасшифровкаПлатежаПоставщик.Партнер";
		
		ВалютаВзаиморасчетовИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.ВалютаВзаиморасчетов";
		ВалютаВзаиморасчетовПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.ВалютаВзаиморасчетов";
		
		СуммаВзаиморасчетовИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		СуммаВзаиморасчетовПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		КОплатеИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		КОплатеПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		ДатаПлатежа = "Неопределено";
		ВариантОплаты = "Неопределено";
		СтатьяДвиженияДенежныхСредств = "ТаблицаРасшифровкаПлатежаПоставщик.СтатьяДвиженияДенежныхСредств";
		
		//Для переноса нужно писать идентификаторы источники из объектов расчетов в расшифровке платежа.
		ИдентификаторФинЗаписи = "ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник.УникальныйИдентификатор";
		НастройкаХозяйственнойОперации = "ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПереносАванса)";
		
		ОперацияВзаиморасчетовИсточник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов)";
		ОперацияВзаиморасчетовПриемник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов)";
		
	ИначеЕсли Операция = "ВозвратТоваровПоставщику" Тогда
		
		КредиторскаяЗадолженность = "ЛОЖЬ";
		СторноИсточник = "ЛОЖЬ";
		СторноПриемник = "ЛОЖЬ";
		ЗаполнятьПриемникВИсточнике = "ЛОЖЬ";
		
		УсловиеОперации = "ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник <> ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовПриемник";
		
		ХозяйственнаяОперация = "ТаблицаРасшифровкаПлатежаПоставщик.ХозяйственнаяОперация";
		
		ФормаОплаты = "Неопределено";
		
		ОбъектРасчетовИсточникОрганизация = "ОбъектыРасчетовИсточники.Организация";
		ОбъектРасчетовПриемникОрганизация = "ОбъектыРасчетовПриемники.Организация";
	
		ОбъектРасчетовИсточникПартнер = "ОбъектыРасчетовИсточники.Партнер";
		ОбъектРасчетовПриемникПартнер = "ОбъектыРасчетовПриемники.Партнер";
		
		ВалютаВзаиморасчетовИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента";
		ВалютаВзаиморасчетовПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.ВалютаВзаиморасчетов";
		
		СуммаВзаиморасчетовИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.Сумма";
		СуммаВзаиморасчетовПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		КОплатеИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.Сумма";
		КОплатеПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		ДатаПлатежа = "Неопределено";
		ВариантОплаты = "Неопределено";
		СтатьяДвиженияДенежныхСредств = "Неопределено";
		
		ИдентификаторФинЗаписи = "ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовПриемник.УникальныйИдентификатор";
		НастройкаХозяйственнойОперации = "ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВзаимозачетЗадолженности)";
		
		ОперацияВзаиморасчетовИсточник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов)";
		ОперацияВзаиморасчетовПриемник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов)";
		
	ИначеЕсли Операция = "ПереносАвансаПоставщику" Тогда
		КредиторскаяЗадолженность = "ЛОЖЬ";
		СторноИсточник = "ЛОЖЬ";
		СторноПриемник = "ЛОЖЬ";
		ЗаполнятьПриемникВИсточнике = "ИСТИНА";
		
		УсловиеОперации = "ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник <> ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовПриемник";
		
		ХозяйственнаяОперация = "ТаблицаРасшифровкаПлатежаПоставщик.ХозяйственнаяОперация";
		
		ФормаОплаты = "ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)";
		
		ОбъектРасчетовИсточникОрганизация = "ОбъектыРасчетовИсточники.Организация";
		ОбъектРасчетовПриемникОрганизация = "ОбъектыРасчетовПриемники.Организация";
	
		ОбъектРасчетовИсточникПартнер = "ОбъектыРасчетовИсточники.Партнер";
		ОбъектРасчетовПриемникПартнер = "ОбъектыРасчетовПриемники.Партнер";
		
		ВалютаВзаиморасчетовИсточник = "ОбъектыРасчетовИсточники.ВалютаВзаиморасчетов";
		ВалютаВзаиморасчетовПриемник = "ОбъектыРасчетовПриемники.ВалютаВзаиморасчетов";
		
		СуммаВзаиморасчетовИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		СуммаВзаиморасчетовПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		КОплатеИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		КОплатеПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		ДатаПлатежа = "ТаблицаРасшифровкаПлатежаПоставщик.ДатаПлатежа";
		ВариантОплаты = "Неопределено";
		СтатьяДвиженияДенежныхСредств = "ТаблицаРасшифровкаПлатежаПоставщик.СтатьяДвиженияДенежныхСредств";
		
		ИдентификаторФинЗаписи = "ТаблицаРасшифровкаПлатежаПоставщик.ИдентификаторФинЗаписи";
		НастройкаХозяйственнойОперации = "ТаблицаРасшифровкаПлатежаПоставщик.НастройкаХозяйственнойОперации";
		
		ОперацияВзаиморасчетовИсточник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.Отгрузка)";
		ОперацияВзаиморасчетовПриемник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаЗадолженности)";
		
	ИначеЕсли Операция = "ВозвратПереносаАвансаПоставщику" Тогда
		КредиторскаяЗадолженность = "ЛОЖЬ";
		СторноИсточник = "ИСТИНА";
		СторноПриемник = "ИСТИНА";
		ЗаполнятьПриемникВИсточнике = "ИСТИНА";
		
		УсловиеОперации = "ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник <> ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовПриемник";
		
		ХозяйственнаяОперация = "ТаблицаРасшифровкаПлатежаПоставщик.ХозяйственнаяОперация";
		
		ФормаОплаты = "ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)";
		
		ОбъектРасчетовИсточникОрганизация = "ОбъектыРасчетовИсточники.Организация";
		ОбъектРасчетовПриемникОрганизация = "ОбъектыРасчетовПриемники.Организация";
	
		ОбъектРасчетовИсточникПартнер = "ОбъектыРасчетовИсточники.Партнер";
		ОбъектРасчетовПриемникПартнер = "ОбъектыРасчетовПриемники.Партнер";
		
		ВалютаВзаиморасчетовИсточник = "ОбъектыРасчетовИсточники.ВалютаВзаиморасчетов";
		ВалютаВзаиморасчетовПриемник = "ОбъектыРасчетовПриемники.ВалютаВзаиморасчетов";
		
		СуммаВзаиморасчетовИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		СуммаВзаиморасчетовПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		КОплатеИсточник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		КОплатеПриемник = "ТаблицаРасшифровкаПлатежаПоставщик.СуммаВзаиморасчетов";
		
		ДатаПлатежа = "ТаблицаРасшифровкаПлатежаПоставщик.ДатаПлатежа";
		ВариантОплаты = "Неопределено";
		СтатьяДвиженияДенежныхСредств = "ТаблицаРасшифровкаПлатежаПоставщик.СтатьяДвиженияДенежныхСредств";
		
		ИдентификаторФинЗаписи = "ТаблицаРасшифровкаПлатежаПоставщик.ИдентификаторФинЗаписи";
		НастройкаХозяйственнойОперации = "ТаблицаРасшифровкаПлатежаПоставщик.НастройкаХозяйственнойОперации";
		
		ОперацияВзаиморасчетовИсточник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаЗадолженности)";
		ОперацияВзаиморасчетовПриемник = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаНакладной)";
		
	КонецЕсли;
	
	#Область ТекстЗапроса
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаРасшифровкаПлатежаПоставщик.ДатаРегистратора       КАК Период,
		|	ВЫБОР
		|		КОГДА НЕ &СторноИсточник И &КредиторскаяЗадолженность
		|			ИЛИ &СторноИсточник И НЕ &КредиторскаяЗадолженность
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ                                                     КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(АналитикаИсточник.КлючАналитики, Неопределено)   КАК АналитикаУчетаПоПартнерам,
		|	ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник КАК ОбъектРасчетов,
		|	&ВалютаВзаиморасчетовИсточник                             КАК Валюта,
		|	
		|	&СуммаВзаиморасчетовИсточник *
		|		ВЫБОР КОГДА &СторноИсточник ТОГДА -1 ИНАЧЕ 1 КОНЕЦ    КАК Сумма,
		|	0                                                         КАК Оплачивается,
		|	&КОплатеИсточник *
		|		ВЫБОР КОГДА &СторноИсточник ТОГДА -1 ИНАЧЕ 1 КОНЕЦ    КАК КОплате,
		|	0                                                         КАК КПоступлению,
		|	
		|	&ХозяйственнаяОперация                                    КАК ХозяйственнаяОперация,
		|	&ФормаОплаты                                              КАК ФормаОплаты,
		|	Неопределено                                              КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	Неопределено                                              КАК ЗакупкаПоЗаказу,
		|	ТаблицаРасшифровкаПлатежаПоставщик.ДатаРегистратора       КАК ДатаРегистратора,
		|	&ДатаПлатежа                                              КАК ДатаПлатежа,
		|	
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетовИсточник = Коэффициенты.ВалютаРегламентированногоУчета
		|				ТОГДА &СуммаВзаиморасчетовИсточник
		|			КОГДА ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|				ТОГДА ТаблицаРасшифровкаПлатежаПоставщик.Сумма
		|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаРасшифровкаПлатежаПоставщик.Сумма * Коэффициенты.КоэффициентРегл КАК ЧИСЛО(31,2))
		|	КОНЕЦ *
		|		ВЫБОР КОГДА &СторноИсточник ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК СуммаРегл,
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетовИсточник = &ВалютаУправленческогоУчета
		|				ТОГДА &СуммаВзаиморасчетовИсточник
		|			КОГДА ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента = &ВалютаУправленческогоУчета
		|				ТОГДА ТаблицаРасшифровкаПлатежаПоставщик.Сумма
		|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаРасшифровкаПлатежаПоставщик.Сумма * Коэффициенты.КоэффициентУпр КАК ЧИСЛО(31,2))
		|	КОНЕЦ *
		|		ВЫБОР КОГДА &СторноИсточник ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК СуммаУпр,
		|
		|	0                                                         КАК ЗалогЗаТару,
		|	&СтатьяДвиженияДенежныхСредств                            КАК СтатьяДвиженияДенежныхСредств,
		|	Неопределено                                              КАК РасчетныйДокумент,
		|	Неопределено                                              КАК СвязанныйДокумент,
		|	&ВариантОплаты                                            КАК ВариантОплаты,
		|	ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента        КАК ВалютаДокумента,
		|	Неопределено                                              КАК КорОбъектРасчетов,
		|	Неопределено                                              КАК КорАналитикаУчетаПоПартнерам,
		|	
		|	&ОбъектРасчетовИсточникОрганизация                        КАК Организация,
		|	&ОбъектРасчетовИсточникПартнер                            КАК Партнер,
		|	ОбъектыРасчетовИсточники.Контрагент                       КАК Контрагент,
		|	ОбъектыРасчетовИсточники.Договор                          КАК Договор,
		|	НаправленияДеятельностиИсточник.НаправлениеАналитики      КАК НаправлениеДеятельности,
		|
		|	Неопределено                                              КАК КорПартнер,
		|	Неопределено                                              КАК КорОрганизация,
		|	Неопределено                                              КАК КорКонтрагент,
		|	Неопределено                                              КАК КорДоговор,
		|	Неопределено                                              КАК КорНаправлениеДеятельности,
		|	ТаблицаРасшифровкаПлатежаПоставщик.НомерРегистратора      КАК НомерРегистратора,
		|	&ИдентификаторФинЗаписи                                   КАК ИдентификаторФинЗаписи,
		|	&ВидОперацииДляСортировки                                 КАК ВидОперацииДляСортировки,
		|	&ПорядокОперацииВПределахДокументаИсточник                КАК ПорядокОперацииВПределахДокумента,
		|	&ОперацияВзаиморасчетовИсточник                           КАК ОперацияВзаиморасчетов,
		|	&НастройкаХозяйственнойОперации                           КАК НастройкаХозяйственнойОперации,
		|
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетовИсточник = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЧислительВалютыВзаиморасчетов
		|	КОНЕЦ                                                 КАК КурсЧислительВалютыВзаиморасчетов,
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетовИсточник = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЗнаменательВалютыВзаиморасчетов
		|	КОНЕЦ                                                 КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетовИсточник = &ВалютаУправленческогоУчета
		|		ИЛИ ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента = &ВалютаУправленческогоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЧислительВалютыУпр
		|	КОНЕЦ                                                 КАК КурсЧислительВалютыУпр,
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетовИсточник = &ВалютаУправленческогоУчета
		|		ИЛИ ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента = &ВалютаУправленческогоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЗнаменательВалютыУпр
		|	КОНЕЦ                                                 КАК КурсЗнаменательВалютыУпр,
		|
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА ЕСТЬNULL(АналитикаПриемник.КлючАналитики, Неопределено)
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                     КАК АналитикаУчетаПоПартнерамПриемник,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА ОбъектыРасчетовПриемники.Ссылка
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                     КАК ОбъектРасчетовПриемник,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА &ВалютаВзаиморасчетовПриемник
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                     КАК ВалютаПриемник,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА &ОбъектРасчетовПриемникПартнер
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                     КАК ПартнерПриемник,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА &ОбъектРасчетовПриемникОрганизация
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                     КАК ОрганизацияПриемник,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА ОбъектыРасчетовПриемники.Контрагент
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                     КАК КонтрагентПриемник,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА ОбъектыРасчетовПриемники.Договор
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                     КАК ДоговорПриемник,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА НаправленияДеятельностиПриемник.НаправлениеАналитики
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                     КАК НаправлениеДеятельностиПриемник,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА &СуммаВзаиморасчетовПриемник
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                     КАК СуммаПриемник,
		|	ЛОЖЬ                                                      КАК ПоДаннымОбъектаРасчетовИсточника
		|ИЗ
		|	#ТаблицаРасшифровкаПлатежаПоставщик КАК ТаблицаРасшифровкаПлатежаПоставщик
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетовИсточники
		|			ПО ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник = ОбъектыРасчетовИсточники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка = ОбъектыРасчетовИсточники.Договор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетовПриемники
		|			ПО ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовПриемник = ОбъектыРасчетовПриемники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговораПриемник
		|			ПО ДанныеДоговораПриемник.Ссылка = ОбъектыРасчетовПриемники.Договор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельностиИсточник
		|			ПО ОбъектыРасчетовИсточники.Ссылка = НаправленияДеятельностиИсточник.ОбъектРасчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельностиПриемник
		|			ПО ОбъектыРасчетовПриемники.Ссылка = НаправленияДеятельностиПриемник.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаИсточник
		|			ПО &ОбъектРасчетовИсточникОрганизация = АналитикаИсточник.Организация
		|				И ОбъектыРасчетовИсточники.Контрагент = АналитикаИсточник.Контрагент
		|				И &ОбъектРасчетовИсточникПартнер = АналитикаИсточник.Партнер
		|				И ОбъектыРасчетовИсточники.Договор = АналитикаИсточник.Договор
		|				И НаправленияДеятельностиИсточник.НаправлениеАналитики = АналитикаИсточник.НаправлениеДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПриемник
		|			ПО &ОбъектРасчетовПриемникОрганизация = АналитикаПриемник.Организация
		|				И ОбъектыРасчетовПриемники.Контрагент = АналитикаПриемник.Контрагент
		|				И &ОбъектРасчетовПриемникПартнер = АналитикаПриемник.Партнер
		|				И ОбъектыРасчетовПриемники.Договор = АналитикаПриемник.Договор
		|				И НаправленияДеятельностиПриемник.НаправлениеАналитики = АналитикаПриемник.НаправлениеДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаиморасчетыВтКоэффициентыПересчетаВалют КАК Коэффициенты
		|			ПО Коэффициенты.Ссылка = ТаблицаРасшифровкаПлатежаПоставщик.Ссылка
		|				И Коэффициенты.ОбъектРасчетов = ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник
		|				И Коэффициенты.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетовИсточник
		|				И Коэффициенты.ДатаКурса = ТаблицаРасшифровкаПлатежаПоставщик.ДатаКурса
		|ГДЕ
		|	&СуммаВзаиморасчетовИсточник > 0
		|	И &УсловиеОперации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаРасшифровкаПлатежаПоставщик.ДатаРегистратора              КАК Период,
		|	ВЫБОР
		|		КОГДА НЕ &СторноПриемник И &КредиторскаяЗадолженность
		|			ИЛИ &СторноПриемник И НЕ &КредиторскаяЗадолженность
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	КОНЕЦ                                                            КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(АналитикаПриемник.КлючАналитики, Неопределено)          КАК АналитикаУчетаПоПартнерам,
		|	ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовПриемник        КАК ОбъектРасчетов,
		|	&ВалютаВзаиморасчетовПриемник                                    КАК Валюта,
		|	
		|	&СуммаВзаиморасчетовПриемник *
		|		ВЫБОР КОГДА &СторноПриемник ТОГДА -1 ИНАЧЕ 1 КОНЕЦ           КАК Сумма,
		|	0                                                                КАК Оплачивается,
		|	&КОплатеПриемник *
		|		ВЫБОР КОГДА &СторноПриемник ТОГДА -1 ИНАЧЕ 1 КОНЕЦ           КАК КОплате,
		|	0                                                                КАК КПоступлению,
		|	
		|	&ХозяйственнаяОперация                                           КАК ХозяйственнаяОперация,
		|	&ФормаОплаты                                                     КАК ФормаОплаты,
		|	Неопределено                                                     КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	Неопределено                                                     КАК ЗакупкаПоЗаказу,
		|	ТаблицаРасшифровкаПлатежаПоставщик.ДатаРегистратора              КАК ДатаРегистратора,
		|	&ДатаПлатежа                                                     КАК ДатаПлатежа,
		|	
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетовПриемник = Коэффициенты.ВалютаРегламентированногоУчета
		|				ТОГДА &СуммаВзаиморасчетовПриемник
		|			КОГДА ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|				ТОГДА ТаблицаРасшифровкаПлатежаПоставщик.Сумма
		|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаРасшифровкаПлатежаПоставщик.Сумма * Коэффициенты.КоэффициентРегл КАК ЧИСЛО(31,2))
		|	КОНЕЦ*
		|		ВЫБОР КОГДА &СторноПриемник ТОГДА -1 ИНАЧЕ 1 КОНЕЦ           КАК СуммаРегл,
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетовПриемник = &ВалютаУправленческогоУчета
		|				ТОГДА &СуммаВзаиморасчетовПриемник
		|			КОГДА ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента = &ВалютаУправленческогоУчета
		|				ТОГДА ТаблицаРасшифровкаПлатежаПоставщик.Сумма
		|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаРасшифровкаПлатежаПоставщик.Сумма * Коэффициенты.КоэффициентУпр КАК ЧИСЛО(31,2))
		|	КОНЕЦ*
		|		ВЫБОР КОГДА &СторноПриемник ТОГДА -1 ИНАЧЕ 1 КОНЕЦ           КАК СуммаУпр,
		|
		|	0                                                                КАК ЗалогЗаТару,
		|	&СтатьяДвиженияДенежныхСредств                                   КАК СтатьяДвиженияДенежныхСредств,
		|	Неопределено                                                     КАК РасчетныйДокумент,
		|	Неопределено                                                     КАК СвязанныйДокумент,
		|	&ВариантОплаты                                                   КАК ВариантОплаты,
		|	ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента               КАК ВалютаДокумента,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА ОбъектыРасчетовИсточники.Ссылка
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                            КАК КорОбъектРасчетов,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА ЕСТЬNULL(АналитикаИсточник.КлючАналитики, Неопределено)
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                            КАК КорАналитикаУчетаПоПартнерам,
		|	
		|	&ОбъектРасчетовПриемникОрганизация                               КАК Организация,
		|	&ОбъектРасчетовПриемникПартнер                                   КАК Партнер,
		|	ОбъектыРасчетовПриемники.Контрагент                              КАК Контрагент,
		|	ОбъектыРасчетовПриемники.Договор                                 КАК Договор,
		|	НаправленияДеятельностиПриемник.НаправлениеАналитики             КАК НаправлениеДеятельности,
		|
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА &ОбъектРасчетовИсточникПартнер
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                            КАК КорПартнер,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА &ОбъектРасчетовИсточникОрганизация
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                            КАК КорОрганизация,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА ОбъектыРасчетовИсточники.Контрагент
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                            КАК КорКонтрагент,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА ОбъектыРасчетовИсточники.Договор
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                            КАК КорДоговор,
		|	ВЫБОР КОГДА &ЗаполнятьПриемникВИсточнике
		|		ТОГДА НаправленияДеятельностиИсточник.НаправлениеАналитики
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ                                                            КАК КорНаправлениеДеятельности,
		|
		|	ТаблицаРасшифровкаПлатежаПоставщик.НомерРегистратора             КАК НомерРегистратора,
		|	&ИдентификаторФинЗаписи                                          КАК ИдентификаторФинЗаписи,
		|	&ВидОперацииДляСортировки                                        КАК ВидОперацииДляСортировки,
		|	&ПорядокОперацииВПределахДокументаПриемник                       КАК ПорядокОперацииВПределахДокумента,
		|	&ОперацияВзаиморасчетовПриемник                                  КАК ОперацияВзаиморасчетов,
		|	&НастройкаХозяйственнойОперации                                  КАК НастройкаХозяйственнойОперации,
		|
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетовПриемник = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЧислительВалютыВзаиморасчетов
		|	КОНЕЦ                                                            КАК КурсЧислительВалютыВзаиморасчетов,
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетовПриемник = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЗнаменательВалютыВзаиморасчетов
		|	КОНЕЦ                                                            КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетовПриемник = &ВалютаУправленческогоУчета
		|		ИЛИ ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента = &ВалютаУправленческогоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЧислительВалютыУпр
		|	КОНЕЦ                                                            КАК КурсЧислительВалютыУпр,
		|	ВЫБОР КОГДА &ВалютаВзаиморасчетовПриемник = &ВалютаУправленческогоУчета
		|		ИЛИ ТаблицаРасшифровкаПлатежаПоставщик.ВалютаДокумента = &ВалютаУправленческогоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЗнаменательВалютыУпр
		|	КОНЕЦ                                                            КАК КурсЗнаменательВалютыУпр,
		|
		|	Неопределено                                                     КАК АналитикаУчетаПоПартнерамПриемник,
		|	Неопределено                                                     КАК ОбъектРасчетовПриемник,
		|	Неопределено                                                     КАК ВалютаПриемник,
		|	Неопределено                                                     КАК ПартнерПриемник,
		|	Неопределено                                                     КАК ОрганизацияПриемник,
		|	Неопределено                                                     КАК КонтрагентПриемник,
		|	Неопределено                                                     КАК ДоговорПриемник,
		|	Неопределено                                                     КАК НаправлениеДеятельностиПриемник,
		|	0                                                                КАК СуммаПриемник,
		|	&ЗаполнятьПриемникВИсточнике                                     КАК ПоДаннымОбъектаРасчетовИсточника
		|ИЗ
		|	#ТаблицаРасшифровкаПлатежаПоставщик КАК ТаблицаРасшифровкаПлатежаПоставщик
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетовИсточники
		|			ПО ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник = ОбъектыРасчетовИсточники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговораИсточник
		|			ПО ДанныеДоговораИсточник.Ссылка = ОбъектыРасчетовИсточники.Договор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетовПриемники
		|			ПО ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовПриемник = ОбъектыРасчетовПриемники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка = ОбъектыРасчетовПриемники.Договор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельностиИсточник
		|			ПО ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовИсточник = НаправленияДеятельностиИсточник.ОбъектРасчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельностиПриемник
		|			ПО ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовПриемник = НаправленияДеятельностиПриемник.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПриемник
		|			ПО &ОбъектРасчетовПриемникОрганизация = АналитикаПриемник.Организация
		|				И ОбъектыРасчетовПриемники.Контрагент = АналитикаПриемник.Контрагент
		|				И &ОбъектРасчетовПриемникПартнер = АналитикаПриемник.Партнер
		|				И ОбъектыРасчетовПриемники.Договор = АналитикаПриемник.Договор
		|				И НаправленияДеятельностиПриемник.НаправлениеАналитики = АналитикаПриемник.НаправлениеДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаИсточник
		|			ПО &ОбъектРасчетовИсточникОрганизация = АналитикаИсточник.Организация
		|				И ОбъектыРасчетовИсточники.Контрагент = АналитикаИсточник.Контрагент
		|				И &ОбъектРасчетовИсточникПартнер = АналитикаИсточник.Партнер
		|				И ОбъектыРасчетовИсточники.Договор = АналитикаИсточник.Договор
		|				И НаправленияДеятельностиИсточник.НаправлениеАналитики = АналитикаИсточник.НаправлениеДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаиморасчетыВтКоэффициентыПересчетаВалют КАК Коэффициенты
		|			ПО Коэффициенты.Ссылка = ТаблицаРасшифровкаПлатежаПоставщик.Ссылка
		|				И Коэффициенты.ОбъектРасчетов = ТаблицаРасшифровкаПлатежаПоставщик.ОбъектРасчетовПриемник
		|				И Коэффициенты.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетовПриемник
		|				И Коэффициенты.ДатаКурса = ТаблицаРасшифровкаПлатежаПоставщик.ДатаКурса
		|ГДЕ
		|	&СуммаВзаиморасчетовПриемник > 0
		|	И &УсловиеОперации
		|";
	#КонецОбласти
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеОперации",УсловиеОперации);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&КредиторскаяЗадолженность",       КредиторскаяЗадолженность);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СторноИсточник",                  СторноИсточник);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СторноПриемник",                  СторноПриемник);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&КОплатеИсточник",                 КОплатеИсточник);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ХозяйственнаяОперация",           ХозяйственнаяОперация);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ФормаОплаты",                     ФормаОплаты);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&КОплатеПриемник",                 КОплатеПриемник);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОбъектРасчетовИсточникОрганизация", ОбъектРасчетовИсточникОрганизация);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОбъектРасчетовПриемникОрганизация", ОбъектРасчетовПриемникОрганизация);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОбъектРасчетовИсточникПартнер",   ОбъектРасчетовИсточникПартнер);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОбъектРасчетовПриемникПартнер",   ОбъектРасчетовПриемникПартнер);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВалютаВзаиморасчетовИсточник",    ВалютаВзаиморасчетовИсточник);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВалютаВзаиморасчетовПриемник",    ВалютаВзаиморасчетовПриемник);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СуммаВзаиморасчетовИсточник",     СуммаВзаиморасчетовИсточник);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СуммаВзаиморасчетовПриемник",     СуммаВзаиморасчетовПриемник);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ДатаПлатежа",                     ДатаПлатежа);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВариантОплаты",                   ВариантОплаты);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СтатьяДвиженияДенежныхСредств",   СтатьяДвиженияДенежныхСредств);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЗаполнятьПриемникВИсточнике",     ЗаполнятьПриемникВИсточнике);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ИдентификаторФинЗаписи",          ИдентификаторФинЗаписи);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НастройкаХозяйственнойОперации",  НастройкаХозяйственнойОперации);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВидОперацииДляСортировки",  ВидОперацииДляСортировки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ПорядокОперацииВПределахДокументаИсточник", ПорядокОперацииВПределахДокумента);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ПорядокОперацииВПределахДокументаПриемник", Строка(Число(ПорядокОперацииВПределахДокумента)+1));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОперацияВзаиморасчетовИсточник",  ОперацияВзаиморасчетовИсточник);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОперацияВзаиморасчетовПриемник",  ОперацияВзаиморасчетовПриемник);
	
	Если Операция = "ПереносЗакупки" ИЛИ Операция = "ПереносПлатежаПоЦентрализованномуДоговору" ИЛИ Операция = "ПереносВозвратаТоваровПоЦентрализованномуДоговору" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#ТаблицаРасшифровкаПлатежа",  "втПереносРасчетов");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ТаблицаРасшифровкаПлатежа",  "ПереносРасчетов");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстПереносЗадолженностиПоставщикаМеждуФилиалами(ВидОперацииДляСортировки)
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	УвеличениеНашейЗадолженностиПоставщику.ДатаРегистратора          КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                           КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(АналитикаИсточник.КлючАналитики, Неопределено)          КАК АналитикаУчетаПоПартнерам,
		|	УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов            КАК ОбъектРасчетов,
		|	УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов      КАК Валюта,
		|	
		|	УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов       КАК Сумма,
		|	0                                                                КАК Оплачивается,
		|	0                                                                КАК КОплате,
		|	0                                                                КАК КПоступлению,
		|	
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами) КАК ХозяйственнаяОперация,
		|	Неопределено                                                     КАК ФормаОплаты,
		|	Неопределено                                                     КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	УвеличениеНашейЗадолженностиПоставщику.ЗаказЗакупки              КАК ЗакупкаПоЗаказу,
		|	УвеличениеНашейЗадолженностиПоставщику.ДатаРегистратора          КАК ДатаРегистратора,
		|	УвеличениеНашейЗадолженностиПоставщику.ДатаПлатежа               КАК ДатаПлатежа,
		|	
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = Коэффициенты.ВалютаРегламентированногоУчета
		|				ТОГДА УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов
		|			КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|				ТОГДА УвеличениеНашейЗадолженностиПоставщику.Сумма
		|			ИНАЧЕ ВЫРАЗИТЬ(УвеличениеНашейЗадолженностиПоставщику.Сумма * Коэффициенты.КоэффициентРегл КАК ЧИСЛО(31,2))
		|	КОНЕЦ КАК СуммаРегл,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|				ТОГДА УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов
		|			КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = &ВалютаУправленческогоУчета
		|				ТОГДА УвеличениеНашейЗадолженностиПоставщику.Сумма
		|			ИНАЧЕ ВЫРАЗИТЬ(УвеличениеНашейЗадолженностиПоставщику.Сумма * Коэффициенты.КоэффициентУпр КАК ЧИСЛО(31,2))
		|	КОНЕЦ КАК СуммаУпр,
		|
		|	0                                                       КАК ЗалогЗаТару,
		|	Неопределено                                            КАК СтатьяДвиженияДенежныхСредств,
		|	Неопределено                                            КАК РасчетныйДокумент,
		|	Неопределено                                            КАК СвязанныйДокумент,
		|	УвеличениеНашейЗадолженностиПоставщику.ВариантОплаты    КАК ВариантОплаты,
		|	УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента  КАК ВалютаДокумента,
		|	Неопределено                                            КАК КорОбъектРасчетов,
		|	Неопределено                                            КАК КорАналитикаУчетаПоПартнерам,
		|	
		|	УвеличениеНашейЗадолженностиПоставщику.Организация      КАК Организация,
		|	УвеличениеНашейЗадолженностиПоставщику.Партнер          КАК Партнер,
		|	ОбъектРасчетовЦД.Контрагент                             КАК Контрагент,
		|	ОбъектРасчетовЦД.Договор                                КАК Договор,
		|	НаправленияДеятельности.НаправлениеАналитики            КАК НаправлениеДеятельности,
		|
		|	Неопределено                                            КАК КорПартнер,
		|	Неопределено                                            КАК КорОрганизация,
		|	Неопределено                                            КАК КорКонтрагент,
		|	Неопределено                                            КАК КорДоговор,
		|	Неопределено                                            КАК КорНаправлениеДеятельности,
		|	УвеличениеНашейЗадолженностиПоставщику.НомерРегистратора КАК НомерРегистратора,
		|	ОбъектРасчетовЦД.УникальныйИдентификатор                КАК ИдентификаторФинЗаписи,
		|	&ВидОперацииДляСортировки                               КАК ВидОперацииДляСортировки,
		|	5                                                       КАК ПорядокОперацииВПределахДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов) КАК ОперацияВзаиморасчетов,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПереносЗадолженностиМеждуФилиалами) КАК НастройкаХозяйственнойОперации,
		|
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЧислительВалютыВзаиморасчетов
		|	КОНЕЦ                                                            КАК КурсЧислительВалютыВзаиморасчетов,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЗнаменательВалютыВзаиморасчетов
		|	КОНЕЦ                                                            КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|		ИЛИ УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = &ВалютаУправленческогоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЧислительВалютыУпр
		|	КОНЕЦ                                                            КАК КурсЧислительВалютыУпр,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|		ИЛИ УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = &ВалютаУправленческогоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЗнаменательВалютыУпр
		|	КОНЕЦ                                                            КАК КурсЗнаменательВалютыУпр,
		|
		|	ЕСТЬNULL(АналитикаПриемник.КлючАналитики, Неопределено) КАК АналитикаУчетаПоПартнерамПриемник,
		|	ОбъектРасчетовЦД.Ссылка                                 КАК ОбъектРасчетовПриемник,
		|	ОбъектРасчетовЦД.ВалютаВзаиморасчетов                   КАК ВалютаПриемник,
		|	УвеличениеНашейЗадолженностиПоставщику.Партнер          КАК ПартнерПриемник,
		|	ОбъектРасчетовЦД.Организация                            КАК ОрганизацияПриемник,
		|	ОбъектРасчетовЦД.Контрагент                             КАК КонтрагентПриемник,
		|	ОбъектРасчетовЦД.Договор                                КАК ДоговорПриемник,
		|	НаправленияДеятельности.НаправлениеАналитики            КАК НаправлениеДеятельностиПриемник,
		|	УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов КАК СуммаПриемник,
		|	ЛОЖЬ                                                    КАК ПоДаннымОбъектаРасчетовИсточника
		|ИЗ
		|	#УвеличениеНашейЗадолженностиПоставщику КАК УвеличениеНашейЗадолженностиПоставщику
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектРасчетовЦД
		|			ПО УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов = ОбъектРасчетовЦД.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка = ОбъектРасчетовЦД.Договор
		|				И ДанныеДоговора.ЦентрализованныйДоговор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельности
		|			ПО ОбъектРасчетовЦД.Ссылка = НаправленияДеятельности.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПриемник
		|			ПО ОбъектРасчетовЦД.Организация = АналитикаПриемник.Организация
		|				И ОбъектРасчетовЦД.Контрагент = АналитикаПриемник.Контрагент
		|				И УвеличениеНашейЗадолженностиПоставщику.Партнер = АналитикаПриемник.Партнер
		|				И ОбъектРасчетовЦД.Договор = АналитикаПриемник.Договор
		|				И НаправленияДеятельности.НаправлениеАналитики = АналитикаПриемник.НаправлениеДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаИсточник
		|			ПО УвеличениеНашейЗадолженностиПоставщику.Организация = АналитикаИсточник.Организация
		|				И ОбъектРасчетовЦД.Контрагент = АналитикаИсточник.Контрагент
		|				И УвеличениеНашейЗадолженностиПоставщику.Партнер = АналитикаИсточник.Партнер
		|				И ОбъектРасчетовЦД.Договор = АналитикаИсточник.Договор
		|				И НаправленияДеятельности.НаправлениеАналитики = АналитикаИсточник.НаправлениеДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаиморасчетыВтКоэффициентыПересчетаВалют КАК Коэффициенты
		|			ПО Коэффициенты.Ссылка = УвеличениеНашейЗадолженностиПоставщику.Ссылка
		|				И Коэффициенты.ОбъектРасчетов = УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов
		|				И Коэффициенты.ВалютаВзаиморасчетов = УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов
		|				И Коэффициенты.ДатаКурса = УвеличениеНашейЗадолженностиПоставщику.ДатаКурса
		|ГДЕ
		|	УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов > 0
		|	И УвеличениеНашейЗадолженностиПоставщику.Организация <> ОбъектРасчетовЦД.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УвеличениеНашейЗадолженностиПоставщику.ДатаРегистратора          КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                           КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(АналитикаПриемник.КлючАналитики, Неопределено)          КАК АналитикаУчетаПоПартнерам,
		|	УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов            КАК ОбъектРасчетов,
		|	УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов      КАК Валюта,
		|	
		|	УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов       КАК Сумма,
		|	0                                                                КАК Оплачивается,
		|	0                                                                КАК КОплате,
		
		|	0                                                                КАК КПоступлению,
		|	
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами) КАК ХозяйственнаяОперация,
		|	Неопределено                                                     КАК ФормаОплаты,
		|	Неопределено                                                     КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	УвеличениеНашейЗадолженностиПоставщику.ЗаказЗакупки              КАК ЗакупкаПоЗаказу,
		|	УвеличениеНашейЗадолженностиПоставщику.ДатаРегистратора          КАК ДатаРегистратора,
		|	УвеличениеНашейЗадолженностиПоставщику.ДатаПлатежа               КАК ДатаПлатежа,
		|	
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = Коэффициенты.ВалютаРегламентированногоУчета
		|				ТОГДА УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов
		|			КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|				ТОГДА УвеличениеНашейЗадолженностиПоставщику.Сумма
		|			ИНАЧЕ ВЫРАЗИТЬ(УвеличениеНашейЗадолженностиПоставщику.Сумма * Коэффициенты.КоэффициентРегл КАК ЧИСЛО(31,2))
		|	КОНЕЦ КАК СуммаРегл,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|				ТОГДА УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов
		|			КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = &ВалютаУправленческогоУчета
		|				ТОГДА УвеличениеНашейЗадолженностиПоставщику.Сумма
		|			ИНАЧЕ ВЫРАЗИТЬ(УвеличениеНашейЗадолженностиПоставщику.Сумма * Коэффициенты.КоэффициентУпр КАК ЧИСЛО(31,2))
		|	КОНЕЦ КАК СуммаУпр,
		|
		|	0                                                                КАК ЗалогЗаТару,
		|	Неопределено                                                     КАК СтатьяДвиженияДенежныхСредств,
		|	Неопределено                                                     КАК РасчетныйДокумент,
		|	Неопределено                                                     КАК СвязанныйДокумент,
		|	УвеличениеНашейЗадолженностиПоставщику.ВариантОплаты             КАК ВариантОплаты,
		|	УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента           КАК ВалютаДокумента,
		|	ОбъектРасчетовЦД.Ссылка                                          КАК КорОбъектРасчетов,
		|	ЕСТЬNULL(АналитикаИсточник.КлючАналитики, Неопределено)          КАК КорАналитикаУчетаПоПартнерам,
		|	
		|	ОбъектРасчетовЦД.Организация                                     КАК Организация,
		|	УвеличениеНашейЗадолженностиПоставщику.Партнер                   КАК Партнер,
		|	ОбъектРасчетовЦД.Контрагент                                      КАК Контрагент,
		|	ОбъектРасчетовЦД.Договор                                         КАК Договор,
		|	НаправленияДеятельности.НаправлениеАналитики                     КАК НаправлениеДеятельности,
		|
		|	УвеличениеНашейЗадолженностиПоставщику.Партнер                   КАК КорПартнер,
		|	УвеличениеНашейЗадолженностиПоставщику.Организация               КАК КорОрганизация,
		|	ОбъектРасчетовЦД.Контрагент                                      КАК КорКонтрагент,
		|	ОбъектРасчетовЦД.Договор                                         КАК КорДоговор,
		|	НаправленияДеятельности.НаправлениеАналитики                     КАК КорНаправлениеДеятельности,
		|
		|	УвеличениеНашейЗадолженностиПоставщику.НомерРегистратора         КАК НомерРегистратора,
		|	ОбъектРасчетовЦД.УникальныйИдентификатор                         КАК ИдентификаторФинЗаписи,
		|	&ВидОперацииДляСортировки                                        КАК ВидОперацииДляСортировки,
		|	5                                                                КАК ПорядокОперацииВПределахДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов) КАК ОперацияВзаиморасчетов,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПереносЗадолженностиМеждуФилиалами) КАК НастройкаХозяйственнойОперации,
		|
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЧислительВалютыВзаиморасчетов
		|	КОНЕЦ                                                            КАК КурсЧислительВалютыВзаиморасчетов,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЗнаменательВалютыВзаиморасчетов
		|	КОНЕЦ                                                            КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|		ИЛИ УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = &ВалютаУправленческогоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЧислительВалютыУпр
		|	КОНЕЦ                                                            КАК КурсЧислительВалютыУпр,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|		ИЛИ УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = &ВалютаУправленческогоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЗнаменательВалютыУпр
		|	КОНЕЦ                                                            КАК КурсЗнаменательВалютыУпр,
		|
		|	Неопределено                                                     КАК АналитикаУчетаПоПартнерамПриемник,
		|	Неопределено                                                     КАК ОбъектРасчетовПриемник,
		|	Неопределено                                                     КАК ВалютаПриемник,
		|	Неопределено                                                     КАК ПартнерПриемник,
		|	Неопределено                                                     КАК ОрганизацияПриемник,
		|	Неопределено                                                     КАК КонтрагентПриемник,
		|	Неопределено                                                     КАК ДоговорПриемник,
		|	Неопределено                                                     КАК НаправлениеДеятельностиПриемник,
		|	0                                                                КАК СуммаПриемник,
		|	ИСТИНА                                                           КАК ПоДаннымОбъектаРасчетовИсточника
		|ИЗ
		|	#УвеличениеНашейЗадолженностиПоставщику КАК УвеличениеНашейЗадолженностиПоставщику
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектРасчетовЦД
		|			ПО УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов = ОбъектРасчетовЦД.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка = ОбъектРасчетовЦД.Договор
		|				И ДанныеДоговора.ЦентрализованныйДоговор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельности
		|			ПО ОбъектРасчетовЦД.Ссылка = НаправленияДеятельности.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПриемник
		|			ПО ОбъектРасчетовЦД.Организация = АналитикаПриемник.Организация
		|				И ОбъектРасчетовЦД.Контрагент = АналитикаПриемник.Контрагент
		|				И УвеличениеНашейЗадолженностиПоставщику.Партнер = АналитикаПриемник.Партнер
		|				И ОбъектРасчетовЦД.Договор = АналитикаПриемник.Договор
		|				И НаправленияДеятельности.НаправлениеАналитики = АналитикаПриемник.НаправлениеДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаИсточник
		|			ПО УвеличениеНашейЗадолженностиПоставщику.Организация = АналитикаИсточник.Организация
		|				И ОбъектРасчетовЦД.Контрагент = АналитикаИсточник.Контрагент
		|				И УвеличениеНашейЗадолженностиПоставщику.Партнер = АналитикаИсточник.Партнер
		|				И ОбъектРасчетовЦД.Договор = АналитикаИсточник.Договор
		|				И НаправленияДеятельности.НаправлениеАналитики = АналитикаИсточник.НаправлениеДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаиморасчетыВтКоэффициентыПересчетаВалют КАК Коэффициенты
		|			ПО Коэффициенты.Ссылка = УвеличениеНашейЗадолженностиПоставщику.Ссылка
		|				И Коэффициенты.ОбъектРасчетов = УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов
		|				И Коэффициенты.ВалютаВзаиморасчетов = УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов
		|				И Коэффициенты.ДатаКурса = УвеличениеНашейЗадолженностиПоставщику.ДатаКурса
		|ГДЕ
		|	УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов > 0
		|	И УвеличениеНашейЗадолженностиПоставщику.Организация <> ОбъектРасчетовЦД.Организация
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидОперацииДляСортировки", ВидОперацииДляСортировки);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция УвеличитьПланОплатыПоставщику(Операция, ВидОперацииДляСортировки)
	
	Если Операция = "ГрафикИсполненияПоставщик" Тогда
		
		ЭтоЗаказ = "ЛОЖЬ";
		ЭтоНакладная = "ЛОЖЬ";
		Период = "КОНЕЦПЕРИОДА(УвеличениеПланаОплатыПоставщику.ДатаПлатежа, ДЕНЬ)";
		
		ПорядокРасчетов = "ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)";
		НакладнаяПоЗаказам = "ЛОЖЬ";
		ЗаказЗакупки = "Неопределено";
		СверхЗаказа = "ЛОЖЬ";
		КОплате = "УвеличениеПланаОплатыПоставщику.КОплате";
		
		СвязанныйДокумент = "Неопределено";
		ФормаОплаты = "Неопределено";
		СтатьяДвиженияДенежныхСредств = "Неопределено";
		ДатаПлатежа = "КОНЕЦПЕРИОДА(УвеличениеПланаОплатыПоставщику.ДатаПлатежа, ДЕНЬ)";
		ВариантОплаты = "УвеличениеПланаОплатыПоставщику.ВариантОплаты";
		ИдентификаторФинЗаписи = "&ИдентификаторНеиспользуемойФинЗаписи";
		НастройкаХозяйственнойОперации = "Неопределено";
		
	ИначеЕсли Операция = "ЗаказПоставщику" Тогда
		
		ЭтоЗаказ = "ИСТИНА";
		ЭтоНакладная = "ЛОЖЬ";
		Период = "КОНЕЦПЕРИОДА(УвеличениеПланаОплатыПоставщику.ДатаПлатежа, ДЕНЬ)";
				
		ПорядокРасчетов = "УвеличениеПланаОплатыПоставщику.ПорядокРасчетов";
		НакладнаяПоЗаказам = "ЛОЖЬ";
		ЗаказЗакупки = "Неопределено";
		СверхЗаказа = "ЛОЖЬ";
		
		КОплате = "УвеличениеПланаОплатыПоставщику.КОплате";
		
		СвязанныйДокумент = "Неопределено";
		ФормаОплаты = "УвеличениеПланаОплатыПоставщику.ФормаОплаты";
		СтатьяДвиженияДенежныхСредств = "Неопределено";
		ДатаПлатежа = "КОНЕЦПЕРИОДА(УвеличениеПланаОплатыПоставщику.ДатаПлатежа)";
		ВариантОплаты = "УвеличениеПланаОплатыПоставщику.ВариантОплаты";
		ИдентификаторФинЗаписи = "&ИдентификаторНеиспользуемойФинЗаписи";
		НастройкаХозяйственнойОперации = "Неопределено";
		
	ИначеЕсли Операция = "Закупка" Тогда
		
		ЭтоЗаказ = "ЛОЖЬ";
		ЭтоНакладная = "ИСТИНА";
		Период = "ВЫБОР КОГДА УвеличениеПланаОплатыПоставщику.КОплате < 0 ИЛИ УвеличениеПланаОплатыПоставщику.ДатаПлатежа < УвеличениеПланаОплатыПоставщику.ДатаРегистратора
				|		ТОГДА УвеличениеПланаОплатыПоставщику.ДатаРегистратора
				|	ИНАЧЕ КОНЕЦПЕРИОДА(УвеличениеПланаОплатыПоставщику.ДатаПлатежа, ДЕНЬ)
				|КОНЕЦ";
		ПорядокРасчетов = "УвеличениеПланаОплатыПоставщику.ПорядокРасчетов";
		НакладнаяПоЗаказам = "УвеличениеПланаОплатыПоставщику.НакладнаяПоЗаказам";
		ЗаказЗакупки = "УвеличениеПланаОплатыПоставщику.ЗаказЗакупки";
		СверхЗаказа = "УвеличениеПланаОплатыПоставщику.СверхЗаказа";
		
		КОплате = "УвеличениеПланаОплатыПоставщику.КОплате";
		
		СвязанныйДокумент = "УвеличениеПланаОплатыПоставщику.СвязанныйДокумент";
		ФормаОплаты = "УвеличениеПланаОплатыПоставщику.ФормаОплаты";
		СтатьяДвиженияДенежныхСредств = "Неопределено";

		ДатаПлатежа = "ВЫБОР КОГДА УвеличениеПланаОплатыПоставщику.КОплате < 0 
				|		ТОГДА ДАТАВРЕМЯ(1,1,1)
				|	ИНАЧЕ УвеличениеПланаОплатыПоставщику.ДатаПлатежа
				|КОНЕЦ";
		ВариантОплаты = "УвеличениеПланаОплатыПоставщику.ВариантОплаты";
		ИдентификаторФинЗаписи = "УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.УникальныйИдентификатор";
		НастройкаХозяйственнойОперации = "Неопределено";
		
	ИначеЕсли Операция = "ВозвратОплатыОтПоставщика" Тогда
		
		ЭтоЗаказ = "ЛОЖЬ";
		ЭтоНакладная = "ЛОЖЬ";
		Период = "УвеличениеПланаОплатыПоставщику.ДатаРегистратора";
		
		ПорядокРасчетов = "Неопределено";
		НакладнаяПоЗаказам = "ЛОЖЬ";
		ЗаказЗакупки = "Неопределено";
		СверхЗаказа = "ЛОЖЬ";
		
		КОплате = "УвеличениеПланаОплатыПоставщику.СуммаВзаиморасчетов";
		
		СвязанныйДокумент = "Неопределено";
		ФормаОплаты = "УвеличениеПланаОплатыПоставщику.ФормаОплаты";
		СтатьяДвиженияДенежныхСредств = "УвеличениеПланаОплатыПоставщику.СтатьяДвиженияДенежныхСредств";
		ДатаПлатежа = "ДАТАВРЕМЯ(1,1,1)";
		ВариантОплаты = "Неопределено";
		ИдентификаторФинЗаписи = "УвеличениеПланаОплатыПоставщику.ИдентификаторФинЗаписи";
		НастройкаХозяйственнойОперации = "УвеличениеПланаОплатыПоставщику.НастройкаХозяйственнойОперации";
		
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период                                                             КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                              КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(Аналитика.КлючАналитики, Неопределено)                     КАК АналитикаУчетаПоПартнерам,
		|	УвеличениеПланаОплатыПоставщику.ОбъектРасчетов                      КАК ОбъектРасчетов,
		|	УвеличениеПланаОплатыПоставщику.ВалютаВзаиморасчетов                КАК Валюта,
		|	
		|	0                                                                   КАК Сумма,
		|	0                                                                   КАК Оплачивается,
		|	&КОплате                                                            КАК КОплате,
		|	0                                                                   КАК КПоступлению,
		|	
		|	УвеличениеПланаОплатыПоставщику.ХозяйственнаяОперация               КАК ХозяйственнаяОперация,
		|	&ФормаОплаты                                                        КАК ФормаОплаты,
		|	Неопределено                                                        КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	&ЗаказЗакупки                                                       КАК ЗакупкаПоЗаказу,
		|	УвеличениеПланаОплатыПоставщику.ДатаРегистратора                    КАК ДатаРегистратора,
		|	&ДатаПлатежа                                                        КАК ДатаПлатежа,
		|	0                                                                   КАК СуммаРегл,
		|	0                                                                   КАК СуммаУпр,
		|	0                                                                   КАК ЗалогЗаТару,
		|	&СтатьяДвиженияДенежныхСредств                                      КАК СтатьяДвиженияДенежныхСредств,
		|	Неопределено                                                        КАК РасчетныйДокумент,
		|	//Порядок оплаты
		|	//Порядок зачета по дате платежа
		|	&СвязанныйДокумент                                                  КАК СвязанныйДокумент,
		|	
		|	&ВариантОплаты                                                      КАК ВариантОплаты,
		|	УвеличениеПланаОплатыПоставщику.ВалютаДокумента                     КАК ВалютаДокумента,
		|	Неопределено                                                        КАК КорОбъектРасчетов,
		|	Неопределено                                                        КАК КорАналитикаУчетаПоПартнерам,
		|	
		|	УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Организация          КАК Организация,
		|	УвеличениеПланаОплатыПоставщику.Партнер                             КАК Партнер,
		|	УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Контрагент           КАК Контрагент,
		|	УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Договор              КАК Договор,
		|	НаправленияДеятельности.НаправлениеАналитики                        КАК НаправлениеДеятельности,
		|	
		|	Неопределено                                                        КАК КорПартнер,
		|	Неопределено                                                        КАК КорОрганизация,
		|	Неопределено                                                        КАК КорКонтрагент,
		|	Неопределено                                                        КАК КорДоговор,
		|	Неопределено                                                        КАК КорНаправлениеДеятельности,
		|	УвеличениеПланаОплатыПоставщику.НомерРегистратора                   КАК НомерРегистратора,
		|	&ИдентификаторФинЗаписи                                             КАК ИдентификаторФинЗаписи,
		|	&ВидОперацииДляСортировки                                           КАК ВидОперацииДляСортировки,
		|	1                                                       КАК ПорядокОперацииВПределахДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПустаяСсылка)          КАК ОперацияВзаиморасчетов,
		|	&НастройкаХозяйственнойОперации                                     КАК НастройкаХозяйственнойОперации,
		|
		|	0                                                                   КАК КурсЧислительВалютыВзаиморасчетов,
		|	0                                                                   КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	0                                                                   КАК КурсЧислительВалютыУпр,
		|	0                                                                   КАК КурсЗнаменательВалютыУпр,
		|
		|	Неопределено                                                        КАК АналитикаУчетаПоПартнерамПриемник,
		|	Неопределено                                                        КАК ОбъектРасчетовПриемник,
		|	Неопределено                                                        КАК ВалютаПриемник,
		|	Неопределено                                                        КАК ПартнерПриемник,
		|	Неопределено                                                        КАК ОрганизацияПриемник,
		|	Неопределено                                                        КАК КонтрагентПриемник,
		|	Неопределено                                                        КАК ДоговорПриемник,
		|	Неопределено                                                        КАК НаправлениеДеятельностиПриемник,
		|	0                                                                   КАК СуммаПриемник,
		|	ЛОЖЬ                                                                КАК ПоДаннымОбъектаРасчетовИсточника
		|	
		|ИЗ
		|	#УвеличениеПланаОплатыПоставщику КАК УвеличениеПланаОплатыПоставщику
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельности
		|			ПО УвеличениеПланаОплатыПоставщику.ОбъектРасчетов = НаправленияДеятельности.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка = УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
		|				ПО УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Организация = Аналитика.Организация
		|					И УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Контрагент = Аналитика.Контрагент
		|					И УвеличениеПланаОплатыПоставщику.Партнер = Аналитика.Партнер
		|					И УвеличениеПланаОплатыПоставщику.ОбъектРасчетов.Договор = Аналитика.Договор
		|					И НаправленияДеятельности.НаправлениеАналитики = Аналитика.НаправлениеДеятельности
		|ГДЕ
		|	&КОплате <> 0
		|	//При расчетах по договору с графиком план оплаты не увеличивается
		|	И НЕ (&ЭтоЗаказ
		|			И ЕСТЬNULL(ДанныеДоговора.ЗаданГрафикИсполнения, ЛОЖЬ)
		|			И ЕСТЬNULL(ДанныеДоговора.ТипДоговора, ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ПустаяСсылка)) 
		|				В (ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомитентом),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.Импорт),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПереработчиком),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПереработчиком2_5))
		|			И &ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов))
		|	//Заказ с расчетами не по накладным
		|	И (&ЭтоЗаказ И &ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)
		|		//Сверх заказа или не по заказу
		|		ИЛИ &ЭтоНакладная
		|		//График исполнения договора, возврат оплаты
		|		ИЛИ НЕ (&ЭтоНакладная ИЛИ &ЭтоЗаказ)
		|		)
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ПорядокРасчетов",               ПорядокРасчетов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ФормаОплаты",                   ФормаОплаты);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЭтоЗаказ",                      ЭтоЗаказ);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЭтоНакладная",                  ЭтоНакладная);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НакладнаяПоЗаказам",            НакладнаяПоЗаказам);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЗаказЗакупки",                  ЗаказЗакупки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СверхЗаказа",                   СверхЗаказа);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&Период",                        Период);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&КОплате",                       КОплате);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СтатьяДвиженияДенежныхСредств", СтатьяДвиженияДенежныхСредств);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ДатаПлатежа",                   ДатаПлатежа);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВариантОплаты",                 ВариантОплаты);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СвязанныйДокумент",             СвязанныйДокумент);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ИдентификаторФинЗаписи",        ИдентификаторФинЗаписи);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НастройкаХозяйственнойОперации", НастройкаХозяйственнойОперации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВидОперацииДляСортировки",       ВидОперацииДляСортировки);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция УменьшитьПланОплатыПоставщику(Операция, ВидОперацииДляСортировки, ПорядокОперацииВПределахДокумента = "1", НакладнаяПоЗаказам = Ложь)
	
	Если Операция = "ОплатаПоставщику" ИЛИ Операция = "ЗачетОбязательствПоставщика" Тогда
		
		КОплате = "УменьшениеПланаОплатыПоставщику.СуммаВзаиморасчетов";
		ФормаОплаты = "УменьшениеПланаОплатыПоставщику.ФормаОплаты";
		ЗаявкаНаРасходованиеДенежныхСредств = "УменьшениеПланаОплатыПоставщику.ЗаявкаНаРасходованиеДенежныхСредств";
		СтатьяДвиженияДенежныхСредств = "УменьшениеПланаОплатыПоставщику.СтатьяДвиженияДенежныхСредств";
		СвязанныйДокумент = "УменьшениеПланаОплатыПоставщику.СвязанныйДокумент";
		ИдентификаторФинЗаписи = "УменьшениеПланаОплатыПоставщику.ИдентификаторФинЗаписи";
		НастройкаХозяйственнойОперации = "УменьшениеПланаОплатыПоставщику.НастройкаХозяйственнойОперации";
		ЗаказЗакупки = "Неопределено";
		ОбъектРасчетов = "УменьшениеПланаОплатыПоставщику.ОбъектРасчетов";
		УсловиеОперации = "ИСТИНА";
		Организация = "УменьшениеПланаОплатыПоставщику.Организация";
		ВариантОплаты = "Неопределено";
		
	ИначеЕсли Операция = "Закупка" Тогда
		
		КОплате = "УменьшениеПланаОплатыПоставщику.КОплате";
		ФормаОплаты = "Неопределено";
		ЗаявкаНаРасходованиеДенежныхСредств = "Неопределено";
		СтатьяДвиженияДенежныхСредств = "Неопределено";
		СвязанныйДокумент = "Неопределено";
		Если НакладнаяПоЗаказам Тогда
			ВариантОплаты = "УменьшениеПланаОплатыПоставщику.ВариантОплаты";
			ИдентификаторФинЗаписи = "ВЫБОР 
			|		КОГДА УменьшениеПланаОплатыПоставщику.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
			|			ТОГДА УменьшениеПланаОплатыПоставщику.ЗаказЗакупки.ОбъектРасчетов.УникальныйИдентификатор
			|		КОГДА УменьшениеПланаОплатыПоставщику.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
			|			ТОГДА ЕСТЬNULL(ДанныеДоговора.ОбъектРасчетов.УникальныйИдентификатор, """")
			|		ИНАЧЕ УменьшениеПланаОплатыПоставщику.ОбъектРасчетов.УникальныйИдентификатор
			|	КОНЕЦ";
			НастройкаХозяйственнойОперации = "Неопределено";
			ЗаказЗакупки = "УменьшениеПланаОплатыПоставщику.ЗаказЗакупки";
			ОбъектРасчетов = "ВЫБОР 
			|		КОГДА УменьшениеПланаОплатыПоставщику.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
			|			ТОГДА УменьшениеПланаОплатыПоставщику.ЗаказЗакупки.ОбъектРасчетов
			|		КОГДА УменьшениеПланаОплатыПоставщику.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
			|			ТОГДА ЕСТЬNULL(ДанныеДоговора.ОбъектРасчетов, Неопределено)
			|		ИНАЧЕ УменьшениеПланаОплатыПоставщику.ОбъектРасчетов
			|	КОНЕЦ";
			УсловиеОперации = "	(УменьшениеПланаОплатыПоставщику.НакладнаяПоЗаказам И НЕ УменьшениеПланаОплатыПоставщику.СверхЗаказа 
			|		ИЛИ ЕСТЬNULL(ДанныеДоговора.ЗаданГрафикИсполнения,ЛОЖЬ))
			|		И УменьшениеПланаОплатыПоставщику.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)";
			Организация = "ВЫБОР 
			|		КОГДА УменьшениеПланаОплатыПоставщику.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
			|			ТОГДА УменьшениеПланаОплатыПоставщику.ЗаказЗакупки.Организация
			|		КОГДА УменьшениеПланаОплатыПоставщику.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
			|			ТОГДА ЕСТЬNULL(ДанныеДоговора.Организация, Неопределено)
			|		ИНАЧЕ УменьшениеПланаОплатыПоставщику.ОбъектРасчетов.Организация
			|	КОНЕЦ";
		Иначе
			ВариантОплаты = "Неопределено";
			ИдентификаторФинЗаписи = "ВЫБОР 
			|		КОГДА УменьшениеПланаОплатыПоставщику.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
			|			ТОГДА ЕСТЬNULL(ДанныеДоговора.ОбъектРасчетов.УникальныйИдентификатор, """")
			|		ИНАЧЕ УменьшениеПланаОплатыПоставщику.ОбъектРасчетов.УникальныйИдентификатор
			|	КОНЕЦ";
			НастройкаХозяйственнойОперации = "Неопределено";
			ЗаказЗакупки = "Неопределено";
			ОбъектРасчетов = "ВЫБОР 
			|		КОГДА УменьшениеПланаОплатыПоставщику.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
			|			ТОГДА ЕСТЬNULL(ДанныеДоговора.ОбъектРасчетов, Неопределено)
			|		ИНАЧЕ УменьшениеПланаОплатыПоставщику.ОбъектРасчетов
			|	КОНЕЦ";
			УсловиеОперации = "ЕСТЬNULL(ДанныеДоговора.ЗаданГрафикИсполнения,ЛОЖЬ)
			|		И УменьшениеПланаОплатыПоставщику.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)
			|		И УменьшениеПланаОплатыПоставщику.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаЗадолженности)";
			Организация = "ВЫБОР 
			|		КОГДА УменьшениеПланаОплатыПоставщику.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
			|			ТОГДА ЕСТЬNULL(ДанныеДоговора.Организация, Неопределено)
			|		ИНАЧЕ УменьшениеПланаОплатыПоставщику.ОбъектРасчетов.Организация
			|	КОНЕЦ";
		КонецЕсли;
		
	ИначеЕсли Операция = "ВозвратТоваровПоставщику" Тогда
		
		КОплате = "УменьшениеПланаОплатыПоставщику.СуммаВзаиморасчетов";
		ФормаОплаты = "Неопределено";
		ЗаявкаНаРасходованиеДенежныхСредств = "Неопределено";
		СтатьяДвиженияДенежныхСредств = "Неопределено";
		СвязанныйДокумент = "Неопределено";
		ИдентификаторФинЗаписи = "УменьшениеПланаОплатыПоставщику.ИдентификаторФинЗаписи";
		НастройкаХозяйственнойОперации = "УменьшениеПланаОплатыПоставщику.НастройкаХозяйственнойОперации";
		ЗаказЗакупки = "Неопределено";
		ОбъектРасчетов = "УменьшениеПланаОплатыПоставщику.ОбъектРасчетов";
		УсловиеОперации = "ИСТИНА";
		Организация = "УменьшениеПланаОплатыПоставщику.Организация";
		ВариантОплаты = "Неопределено";
		
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	УменьшениеПланаОплатыПоставщику.ДатаРегистратора                    КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                              КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(Аналитика.КлючАналитики, Неопределено)                     КАК АналитикаУчетаПоПартнерам,
		|	&ОбъектРасчетов                                                     КАК ОбъектРасчетов,
		|	УменьшениеПланаОплатыПоставщику.ВалютаВзаиморасчетов                КАК Валюта,
		|	
		|	0                                                                   КАК Сумма,
		|	0                                                                   КАК Оплачивается,
		|	&КОплате                                                            КАК КОплате,
		|	0                                                                   КАК КПоступлению,
		|	
		|	УменьшениеПланаОплатыПоставщику.ХозяйственнаяОперация               КАК ХозяйственнаяОперация,
		|	&ФормаОплаты                                                        КАК ФормаОплаты,
		|	&ЗаявкаНаРасходованиеДенежныхСредств                                КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	&ЗаказЗакупки                                                       КАК ЗакупкаПоЗаказу,
		|	УменьшениеПланаОплатыПоставщику.ДатаРегистратора                    КАК ДатаРегистратора,
		|	ВЫБОР КОГДА &КОплате < 0
		|			ТОГДА НАЧАЛОПЕРИОДА(УменьшениеПланаОплатыПоставщику.ДатаРегистратора, ДЕНЬ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
		|	КОНЕЦ                                                               КАК ДатаПлатежа,
		|	0                                                                   КАК СуммаРегл,
		|	0                                                                   КАК СуммаУпр,
		|	0                                                                   КАК ЗалогЗаТару,
		|	&СтатьяДвиженияДенежныхСредств                                      КАК СтатьяДвиженияДенежныхСредств,
		|	Неопределено                                                        КАК РасчетныйДокумент,
		|	//Порядок оплаты
		|	//Порядок зачета по дате платежа
		|	&СвязанныйДокумент                                                  КАК СвязанныйДокумент,
		|	&ВариантОплаты                                                      КАК ВариантОплаты,
		|	УменьшениеПланаОплатыПоставщику.ВалютаДокумента                     КАК ВалютаДокумента,
		|	Неопределено                                                        КАК КорОбъектРасчетов,
		|	Неопределено                                                        КАК КорАналитикаУчетаПоПартнерам,
		|	
		|	&Организация                                                        КАК Организация,
		|	УменьшениеПланаОплатыПоставщику.Партнер                             КАК Партнер,
		|	УменьшениеПланаОплатыПоставщику.ОбъектРасчетов.Контрагент           КАК Контрагент,
		|	УменьшениеПланаОплатыПоставщику.ОбъектРасчетов.Договор              КАК Договор,
		|	НаправленияДеятельности.НаправлениеАналитики                        КАК НаправлениеДеятельности,
		|	
		|	Неопределено                                                        КАК КорПартнер,
		|	Неопределено                                                        КАК КорОрганизация,
		|	Неопределено                                                        КАК КорКонтрагент,
		|	Неопределено                                                        КАК КорДоговор,
		|	Неопределено                                                        КАК КорНаправлениеДеятельности,
		|	УменьшениеПланаОплатыПоставщику.НомерРегистратора                   КАК НомерРегистратора,
		|	&ИдентификаторФинЗаписи                                             КАК ИдентификаторФинЗаписи,
		|	&ВидОперацииДляСортировки                                           КАК ВидОперацииДляСортировки,
		|	&ПорядокОперацииВПределахДокумента                                  КАК ПорядокОперацииВПределахДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПустаяСсылка)          КАК ОперацияВзаиморасчетов,
		|	&НастройкаХозяйственнойОперации                                     КАК НастройкаХозяйственнойОперации,
		|
		|	0                                                                   КАК КурсЧислительВалютыВзаиморасчетов,
		|	0                                                                   КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	0                                                                   КАК КурсЧислительВалютыУпр,
		|	0                                                                   КАК КурсЗнаменательВалютыУпр,
		|
		|	Неопределено                                                        КАК АналитикаУчетаПоПартнерамПриемник,
		|	Неопределено                                                        КАК ОбъектРасчетовПриемник,
		|	Неопределено                                                        КАК ВалютаПриемник,
		|	Неопределено                                                        КАК ПартнерПриемник,
		|	Неопределено                                                        КАК ОрганизацияПриемник,
		|	Неопределено                                                        КАК КонтрагентПриемник,
		|	Неопределено                                                        КАК ДоговорПриемник,
		|	Неопределено                                                        КАК НаправлениеДеятельностиПриемник,
		|	0                                                                   КАК СуммаПриемник,
		|	ЛОЖЬ                                                                КАК ПоДаннымОбъектаРасчетовИсточника
		|ИЗ
		|	#УменьшениеПланаОплатыПоставщику КАК УменьшениеПланаОплатыПоставщику
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельности
		|			ПО УменьшениеПланаОплатыПоставщику.ОбъектРасчетов = НаправленияДеятельности.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка =  УменьшениеПланаОплатыПоставщику.ОбъектРасчетов.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
		|				ПО &Организация = Аналитика.Организация
		|					И УменьшениеПланаОплатыПоставщику.ОбъектРасчетов.Контрагент = Аналитика.Контрагент
		|					И УменьшениеПланаОплатыПоставщику.Партнер = Аналитика.Партнер
		|					И УменьшениеПланаОплатыПоставщику.ОбъектРасчетов.Договор = Аналитика.Договор
		|					И НаправленияДеятельности.НаправлениеАналитики = Аналитика.НаправлениеДеятельности
		|ГДЕ
		|	&КОплате <> 0 И &УсловиеОперации
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&КОплате",                             КОплате);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ФормаОплаты",                         ФормаОплаты);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЗаявкаНаРасходованиеДенежныхСредств", ЗаявкаНаРасходованиеДенежныхСредств);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СтатьяДвиженияДенежныхСредств",       СтатьяДвиженияДенежныхСредств);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СвязанныйДокумент",                   СвязанныйДокумент);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ИдентификаторФинЗаписи",              ИдентификаторФинЗаписи);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НастройкаХозяйственнойОперации",      НастройкаХозяйственнойОперации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВидОперацииДляСортировки",            ВидОперацииДляСортировки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ПорядокОперацииВПределахДокумента",   ПорядокОперацииВПределахДокумента);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОбъектРасчетов",                      ОбъектРасчетов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеОперации",                     УсловиеОперации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&Организация",                         Организация);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЗаказЗакупки",                        ЗаказЗакупки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВариантОплаты",                       ВариантОплаты);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция УвеличитьПланПоставкиОтПоставщика(Операция, ВидОперацииДляСортировки)
	
	Если Операция = "ГрафикИсполненияПоставщик" Тогда
		
		ЭтоЗаказ = "ЛОЖЬ";
		ЭтоНакладная = "ЛОЖЬ";
		ПорядокРасчетов = "ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)";
		
	ИначеЕсли Операция = "ЗаказПоставщику" Тогда
		
		ЭтоЗаказ = "ИСТИНА";
		ЭтоНакладная = "ЛОЖЬ";
		ПорядокРасчетов = "УвеличениеПланаПоставки.ПорядокРасчетов";
		
	ИначеЕсли Операция = "Закупка" Тогда
		
		ЭтоЗаказ = "ЛОЖЬ";
		ЭтоНакладная = "ИСТИНА";
		ПорядокРасчетов = "УвеличениеПланаПоставки.ПорядокРасчетов";
		
	КонецЕсли;
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	УвеличениеПланаПоставки.Период                           КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                   КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(Аналитика.КлючАналитики, Неопределено)          КАК АналитикаУчетаПоПартнерам,
		|	УвеличениеПланаПоставки.ОбъектРасчетов                   КАК ОбъектРасчетов,
		|	УвеличениеПланаПоставки.ВалютаВзаиморасчетов             КАК Валюта,
		|	
		|	0                                                        КАК Сумма,
		|	0                                                        КАК Оплачивается,
		|	0                                                        КАК КОплате,
		|	УвеличениеПланаПоставки.УвеличитьКПоступлению            КАК КПоступлению,
		|	
		|	УвеличениеПланаПоставки.ХозяйственнаяОперация            КАК ХозяйственнаяОперация,
		|	Неопределено                                             КАК ФормаОплаты,
		|	Неопределено                                             КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	УвеличениеПланаПоставки.ЗаказЗакупки                     КАК ЗакупкаПоЗаказу,
		|	УвеличениеПланаПоставки.ДатаРегистратора                 КАК ДатаРегистратора,
		|	ДАТАВРЕМЯ(1,1,1)                                         КАК ДатаПлатежа,
		|	0                                                        КАК СуммаРегл,
		|	0                                                        КАК СуммаУпр,
		|	0                                                        КАК ЗалогЗаТару,
		|	Неопределено                                             КАК СтатьяДвиженияДенежныхСредств,
		|	Неопределено                                             КАК РасчетныйДокумент,
		|	Неопределено                                             КАК СвязанныйДокумент,
		|	Неопределено                                             КАК ВариантОплаты,
		|	УвеличениеПланаПоставки.ВалютаДокумента                  КАК ВалютаДокумента,
		|	Неопределено                                             КАК КорОбъектРасчетов,
		|	Неопределено                                             КАК КорАналитикаУчетаПоПартнерам,
		|	
		|	УвеличениеПланаПоставки.Организация                      КАК Организация,
		|	УвеличениеПланаПоставки.Партнер                          КАК Партнер,
		|	УвеличениеПланаПоставки.Контрагент                       КАК Контрагент,
		|	УвеличениеПланаПоставки.Договор                          КАК Договор,
		|	НаправленияДеятельности.НаправлениеАналитики             КАК НаправлениеДеятельности,
		|	Неопределено                                             КАК КорПартнер,
		|	Неопределено                                             КАК КорОрганизация,
		|	Неопределено                                             КАК КорКонтрагент,
		|	Неопределено                                             КАК КорДоговор,
		|	Неопределено                                             КАК КорНаправлениеДеятельности,
		|	УвеличениеПланаПоставки.НомерРегистратора                КАК НомерРегистратора,
		|	&ИдентификаторНеиспользуемойФинЗаписи                    КАК ИдентификаторФинЗаписи,
		|	&ВидОперацииДляСортировки                                КАК ВидОперацииДляСортировки,
		|	1                                                        КАК ПорядокОперацииВПределахДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПустаяСсылка) КАК ОперацияВзаиморасчетов,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка) КАК НастройкаХозяйственнойОперации,
		|
		|	0                                                        КАК КурсЧислительВалютыВзаиморасчетов,
		|	0                                                        КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	0                                                        КАК КурсЧислительВалютыУпр,
		|	0                                                        КАК КурсЗнаменательВалютыУпр,
		|
		|	Неопределено                                             КАК АналитикаУчетаПоПартнерамПриемник,
		|	Неопределено                                             КАК ОбъектРасчетовПриемник,
		|	Неопределено                                             КАК ВалютаПриемник,
		|	Неопределено                                             КАК ПартнерПриемник,
		|	Неопределено                                             КАК ОрганизацияПриемник,
		|	Неопределено                                             КАК КонтрагентПриемник,
		|	Неопределено                                             КАК ДоговорПриемник,
		|	Неопределено                                             КАК НаправлениеДеятельностиПриемник,
		|	0                                                        КАК СуммаПриемник,
		|	ЛОЖЬ                                                     КАК ПоДаннымОбъектаРасчетовИсточника
		|ИЗ
		|	ВтУвеличениеПланаПоставки КАК УвеличениеПланаПоставки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельности
		|			ПО УвеличениеПланаПоставки.ОбъектРасчетов = НаправленияДеятельности.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
		|				ПО УвеличениеПланаПоставки.Организация = Аналитика.Организация
		|					И УвеличениеПланаПоставки.ОбъектРасчетов.Контрагент = Аналитика.Контрагент
		|					И УвеличениеПланаПоставки.Партнер = Аналитика.Партнер
		|					И УвеличениеПланаПоставки.Договор = Аналитика.Договор
		|					И НаправленияДеятельности.НаправлениеАналитики = Аналитика.НаправлениеДеятельности
		|ГДЕ
		|	НЕ ((&ЭтоЗаказ ИЛИ &ЭтоНакладная) 
		|		И УвеличениеПланаПоставки.ЗаданГрафикИсполнения 
		|		И &ПорядокРасчетов В (ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов), ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным))
		|		И НЕ УвеличениеПланаПоставки.СверхЗаказа)
		|	И (&ЭтоЗаказ 
		|			И &ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)
		|		ИЛИ &ЭтоНакладная
		|			И УвеличениеПланаПоставки.НакладнаяПоЗаказам
		|			И &ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)
		|			И УвеличениеПланаПоставки.СверхЗаказа
		|		ИЛИ НЕ (&ЭтоЗаказ ИЛИ &ЭтоНакладная))
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ПорядокРасчетов",               ПорядокРасчетов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЭтоЗаказ",                      ЭтоЗаказ);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЭтоНакладная",                  ЭтоНакладная);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВидОперацииДляСортировки",      ВидОперацииДляСортировки);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция УменьшитьПланПоставкиОтПоставщика(ВидОперацииДляСортировки)
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	УменьшениеПланаПоставки.ДатаРегистратора                 КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                   КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(Аналитика.КлючАналитики, Неопределено)          КАК АналитикаУчетаПоПартнерам,
		|	УменьшениеПланаПоставки.ОбъектРасчетов                   КАК ОбъектРасчетов,
		|	УменьшениеПланаПоставки.ВалютаВзаиморасчетов             КАК Валюта,
		|	
		|	0                                                        КАК Сумма,
		|	0                                                        КАК Оплачивается,
		|	0                                                        КАК КОплате,
		|	УменьшениеПланаПоставки.УменьшитьКПоступлению            КАК КПоступлению,
		|	
		|	УменьшениеПланаПоставки.ХозяйственнаяОперация            КАК ХозяйственнаяОперация,
		|	Неопределено                                             КАК ФормаОплаты,
		|	Неопределено                                             КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	УменьшениеПланаПоставки.ЗаказЗакупки                     КАК ЗакупкаПоЗаказу,
		|	УменьшениеПланаПоставки.ДатаРегистратора                 КАК ДатаРегистратора,
		|	ДАТАВРЕМЯ(1,1,1)                                         КАК ДатаПлатежа,
		|	0                                                        КАК СуммаРегл,
		|	0                                                        КАК СуммаУпр,
		|	0                                                        КАК ЗалогЗаТару,
		|	Неопределено                                             КАК СтатьяДвиженияДенежныхСредств,
		|	Неопределено                                             КАК РасчетныйДокумент,
		|	Неопределено                                             КАК СвязанныйДокумент,
		|	Неопределено                                             КАК ВариантОплаты,
		|	УменьшениеПланаПоставки.ВалютаДокумента                  КАК ВалютаДокумента,
		|	Неопределено                                             КАК КорОбъектРасчетов,
		|	Неопределено                                             КАК КорАналитикаУчетаПоПартнерам,
		|	
		|	УменьшениеПланаПоставки.Организация                      КАК Организация,
		|	УменьшениеПланаПоставки.Партнер                          КАК Партнер,
		|	УменьшениеПланаПоставки.ОбъектРасчетов.Контрагент        КАК Контрагент,
		|	УменьшениеПланаПоставки.ОбъектРасчетов.Договор           КАК Договор,
		|	НаправленияДеятельности.НаправлениеАналитики             КАК НаправлениеДеятельности,
		|	Неопределено                                             КАК КорПартнер,
		|	Неопределено                                             КАК КорОрганизация,
		|	Неопределено                                             КАК КорКонтрагент,
		|	Неопределено                                             КАК КорДоговор,
		|	Неопределено                                             КАК КорНаправлениеДеятельности,
		|	УменьшениеПланаПоставки.НомерРегистратора                КАК НомерРегистратора,
		|	&ИдентификаторНеиспользуемойФинЗаписи                    КАК ИдентификаторФинЗаписи,
		|	&ВидОперацииДляСортировки                                КАК ВидОперацииДляСортировки,
		|	1                                                        КАК ПорядокОперацииВПределахДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПустаяСсылка) КАК ОперацияВзаиморасчетов,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка) КАК НастройкаХозяйственнойОперации,
		|
		|	0                                                        КАК КурсЧислительВалютыВзаиморасчетов,
		|	0                                                        КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	0                                                        КАК КурсЧислительВалютыУпр,
		|	0                                                        КАК КурсЗнаменательВалютыУпр,
		|
		|	Неопределено                                             КАК АналитикаУчетаПоПартнерамПриемник,
		|	Неопределено                                             КАК ОбъектРасчетовПриемник,
		|	Неопределено                                             КАК ВалютаПриемник,
		|	Неопределено                                             КАК ПартнерПриемник,
		|	Неопределено                                             КАК ОрганизацияПриемник,
		|	Неопределено                                             КАК КонтрагентПриемник,
		|	Неопределено                                             КАК ДоговорПриемник,
		|	Неопределено                                             КАК НаправлениеДеятельностиПриемник,
		|	0                                                        КАК СуммаПриемник,
		|	ЛОЖЬ                                                     КАК ПоДаннымОбъектаРасчетовИсточника
		|ИЗ
		|	ВтУменьшениеПланаПоставки КАК УменьшениеПланаПоставки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельности
		|			ПО УменьшениеПланаПоставки.ОбъектРасчетов = НаправленияДеятельности.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
		|				ПО УменьшениеПланаПоставки.Организация = Аналитика.Организация
		|					И УменьшениеПланаПоставки.Контрагент = Аналитика.Контрагент
		|					И УменьшениеПланаПоставки.Партнер = Аналитика.Партнер
		|					И УменьшениеПланаПоставки.Договор = Аналитика.Договор
		|					И НаправленияДеятельности.НаправлениеАналитики = Аналитика.НаправлениеДеятельности
		|ГДЕ
		|	(УменьшениеПланаПоставки.ЗаданГрафикИсполнения 
		|		И УменьшениеПланаПоставки.ПорядокРасчетов В (ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов),
		|		                                             ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным))
		|	ИЛИ УменьшениеПланаПоставки.НакладнаяПоЗаказам 
		|		И (УменьшениеПланаПоставки.ПорядокРасчетов В (ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказам),
		|		                                              ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным))
		|			ИЛИ УменьшениеПланаПоставки.ПорядокРасчетов В (ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов),
		|			                                               ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным))
		|				И НЕ УменьшениеПланаПоставки.ЗаданГрафикИсполнения))
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидОперацииДляСортировки", ВидОперацииДляСортировки);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция УвеличитьЗадолженностьПоставщика(Операция, ВидОперацииДляСортировки, ПорядокОперацииВПределахДокумента = "1")
	
	Если Операция = "ОплатаПоставщику" ИЛИ Операция = "ЗачетОбязательствПоставщика" Тогда
		
		ФормаОплаты = "УвеличениеЗадолженностиПоставщика.ФормаОплаты";
		ЗаявкаНаРасходованиеДенежныхСредств = "УвеличениеЗадолженностиПоставщика.ЗаявкаНаРасходованиеДенежныхСредств";
		СтатьяДвиженияДенежныхСредств = "УвеличениеЗадолженностиПоставщика.СтатьяДвиженияДенежныхСредств";
		СвязанныйДокумент = "УвеличениеЗадолженностиПоставщика.СвязанныйДокумент";
		ИдентификаторФинЗаписи = "УвеличениеЗадолженностиПоставщика.ИдентификаторФинЗаписи";
		НастройкаХозяйственнойОперации = "УвеличениеЗадолженностиПоставщика.НастройкаХозяйственнойОперации";
		ОперацияВзаиморасчетов = "ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаЗадолженности)
		|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаНакладной)
		|	КОГДА УвеличениеЗадолженностиПоставщика.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
		|		ИЛИ УвеличениеЗадолженностиПоставщика.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.УдержаниеВознагражденияКомитентом)
		|		ИЛИ УвеличениеЗадолженностиПоставщика.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.УдержаниеВознагражденияКомиссионера)
		|		ИЛИ УвеличениеЗадолженностиПоставщика.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|		ИЛИ УвеличениеЗадолженностиПоставщика.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет)
		|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаЗадолженности)
		|	ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.Оплата)
		|КОНЕЦ";
		Если Операция = "ОплатаПоставщику" Тогда
			СуммаРегл = "УвеличениеЗадолженностиПоставщика.СуммаРегл";
			СуммаУпр = "УвеличениеЗадолженностиПоставщика.СуммаУпр";
			ДатаПлатежа = "ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.СуммаВзаиморасчетов < 0
			|			ТОГДА НАЧАЛОПЕРИОДА(УвеличениеЗадолженностиПоставщика.ДатаРегистратора, ДЕНЬ)
			|		ИНАЧЕ УвеличениеЗадолженностиПоставщика.ДатаПогашения
			|	КОНЕЦ";
		Иначе
			СуммаРегл = "0";
			СуммаУпр = "0";
			ДатаПлатежа = "ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.СуммаВзаиморасчетов < 0
			|			ТОГДА НАЧАЛОПЕРИОДА(УвеличениеЗадолженностиПоставщика.ДатаРегистратора, ДЕНЬ)
			|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
			|	КОНЕЦ";
		КонецЕсли;
		
	ИначеЕсли Операция = "ВозвратТоваровПоставщику" Тогда
		
		ФормаОплаты = "Неопределено";
		ЗаявкаНаРасходованиеДенежныхСредств = "Неопределено";
		СтатьяДвиженияДенежныхСредств = "Неопределено";
		СвязанныйДокумент = "Неопределено";
		ИдентификаторФинЗаписи = "УвеличениеЗадолженностиПоставщика.ИдентификаторФинЗаписи";
		НастройкаХозяйственнойОперации = "УвеличениеЗадолженностиПоставщика.НастройкаХозяйственнойОперации";
		ОперацияВзаиморасчетов = "ВЫБОР КОГДА
		|	УвеличениеЗадолженностиПоставщика.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноИспользованияБронированияПодотчетнымЛицом)
		|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаЗадолженности)
		|	ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаНакладной)
		|КОНЕЦ";
		СуммаРегл = "0";
		СуммаУпр = "0";
		ДатаПлатежа = "ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.СуммаВзаиморасчетов < 0
		|			ТОГДА НАЧАЛОПЕРИОДА(УвеличениеЗадолженностиПоставщика.ДатаРегистратора, ДЕНЬ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
		|	КОНЕЦ";
		
	ИначеЕсли Операция = "Закупка" Тогда
		
		ФормаОплаты = "Неопределено";
		ЗаявкаНаРасходованиеДенежныхСредств = "Неопределено";
		СтатьяДвиженияДенежныхСредств = "Неопределено";
		СвязанныйДокумент = "Неопределено";
		ИдентификаторФинЗаписи = "УвеличениеЗадолженностиПоставщика.ОбъектРасчетов.УникальныйИдентификатор";
		НастройкаХозяйственнойОперации = "Неопределено";
		ОперацияВзаиморасчетов = "ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.Отгрузка)";
		СуммаРегл = "0";
		СуммаУпр = "0";
		ДатаПлатежа = "ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.СуммаВзаиморасчетов < 0
		|			ТОГДА НАЧАЛОПЕРИОДА(УвеличениеЗадолженностиПоставщика.ДатаРегистратора, ДЕНЬ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
		|	КОНЕЦ";
		
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	УвеличениеЗадолженностиПоставщика.ДатаРегистратора                   КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                               КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(Аналитика.КлючАналитики, Неопределено)                      КАК АналитикаУчетаПоПартнерам,
		|	УвеличениеЗадолженностиПоставщика.ОбъектРасчетов                     КАК ОбъектРасчетов,
		|	УвеличениеЗадолженностиПоставщика.ВалютаВзаиморасчетов               КАК Валюта,
		|	
		|	УвеличениеЗадолженностиПоставщика.СуммаВзаиморасчетов                КАК Сумма,
		|	0                                                                    КАК Оплачивается,
		|	0                                                                    КАК КОплате,
		|	0                                                                    КАК КПоступлению,
		|	
		|	УвеличениеЗадолженностиПоставщика.ХозяйственнаяОперация              КАК ХозяйственнаяОперация,
		|	&ФормаОплаты                                                         КАК ФормаОплаты,
		|	&ЗаявкаНаРасходованиеДенежныхСредств                                 КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	Неопределено                                                         КАК ЗакупкаПоЗаказу,
		|	УвеличениеЗадолженностиПоставщика.ДатаРегистратора                   КАК ДатаРегистратора,
		|	&ДатаПлатежа                                                         КАК ДатаПлатежа,
		|	ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.ВалютаВзаиморасчетов = Коэффициенты.ВалютаРегламентированногоУчета
		|				ТОГДА УвеличениеЗадолженностиПоставщика.СуммаВзаиморасчетов
		|			КОГДА УвеличениеЗадолженностиПоставщика.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|				ТОГДА УвеличениеЗадолженностиПоставщика.Сумма
		|			ИНАЧЕ ВЫБОР КОГДА &СуммаРегл = 0 
		|						ТОГДА ВЫРАЗИТЬ(УвеличениеЗадолженностиПоставщика.Сумма * Коэффициенты.КоэффициентРегл КАК ЧИСЛО(31,2))
		|					ИНАЧЕ &СуммаРегл
		|				КОНЕЦ
		|	КОНЕЦ                                                                КАК СуммаРегл,
		|	ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|				ТОГДА УвеличениеЗадолженностиПоставщика.СуммаВзаиморасчетов
		|			КОГДА УвеличениеЗадолженностиПоставщика.ВалютаДокумента = &ВалютаУправленческогоУчета
		|				ТОГДА УвеличениеЗадолженностиПоставщика.Сумма
		|			ИНАЧЕ ВЫБОР КОГДА &СуммаУпр = 0 
		|						ТОГДА ВЫРАЗИТЬ(УвеличениеЗадолженностиПоставщика.Сумма * Коэффициенты.КоэффициентУпр КАК ЧИСЛО(31,2))
		|					ИНАЧЕ &СуммаУпр
		|				КОНЕЦ
		|	КОНЕЦ                                                               КАК СуммаУпр,
		|	0                                                                   КАК ЗалогЗаТару,
		|	&СтатьяДвиженияДенежныхСредств                                      КАК СтатьяДвиженияДенежныхСредств,
		|	Неопределено                                                        КАК РасчетныйДокумент,
		|	//Порядок оплаты
		|	//Порядок зачета по дате платежа
		|	&СвязанныйДокумент                                                  КАК СвязанныйДокумент,
		|	Неопределено                                                        КАК ВариантОплаты,
		|	УвеличениеЗадолженностиПоставщика.ВалютаДокумента                   КАК ВалютаДокумента,
		|	Неопределено                                                        КАК КорОбъектРасчетов,
		|	Неопределено                                                        КАК КорАналитикаУчетаПоПартнерам,
		|	
		|	ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.Организация <> УвеличениеЗадолженностиПоставщика.ОбъектРасчетов.Организация
		|		ТОГДА УвеличениеЗадолженностиПоставщика.Организация
		|		ИНАЧЕ УвеличениеЗадолженностиПоставщика.ОбъектРасчетов.Организация
		|	КОНЕЦ                                                               КАК Организация,
		|	УвеличениеЗадолженностиПоставщика.Партнер                           КАК Партнер,
		|	УвеличениеЗадолженностиПоставщика.ОбъектРасчетов.Контрагент         КАК Контрагент,
		|	УвеличениеЗадолженностиПоставщика.ОбъектРасчетов.Договор            КАК Договор,
		|	НаправленияДеятельности.НаправлениеАналитики                        КАК НаправлениеДеятельности,
		|	
		|	Неопределено                                                        КАК КорПартнер,
		|	Неопределено                                                        КАК КорОрганизация,
		|	Неопределено                                                        КАК КорКонтрагент,
		|	Неопределено                                                        КАК КорДоговор,
		|	Неопределено                                                        КАК КорНаправлениеДеятельности,
		|	УвеличениеЗадолженностиПоставщика.НомерРегистратора                 КАК НомерРегистратора,
		|	&ИдентификаторФинЗаписи                                             КАК ИдентификаторФинЗаписи,
		|	&ВидОперацииДляСортировки                                           КАК ВидОперацииДляСортировки,
		|	&ПорядокОперацииВПределахДокумента                                  КАК ПорядокОперацииВПределахДокумента,
		|	&ОперацияВзаиморасчетов                                             КАК ОперацияВзаиморасчетов,
		|	&НастройкаХозяйственнойОперации                                     КАК НастройкаХозяйственнойОперации,
		|
		|	ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.ВалютаВзаиморасчетов = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ УвеличениеЗадолженностиПоставщика.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ &СуммаРегл <> 0
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЧислительВалютыВзаиморасчетов
		|	КОНЕЦ                                                               КАК КурсЧислительВалютыВзаиморасчетов,
		|	ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.ВалютаВзаиморасчетов = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ УвеличениеЗадолженностиПоставщика.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ &СуммаРегл <> 0
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЗнаменательВалютыВзаиморасчетов
		|	КОНЕЦ                                                               КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|		ИЛИ УвеличениеЗадолженностиПоставщика.ВалютаДокумента = &ВалютаУправленческогоУчета
		|		ИЛИ &СуммаУпр <> 0
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЧислительВалютыУпр
		|	КОНЕЦ                                                               КАК КурсЧислительВалютыУпр,
		|	ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|		ИЛИ УвеличениеЗадолженностиПоставщика.ВалютаДокумента = &ВалютаУправленческогоУчета
		|		ИЛИ &СуммаУпр <> 0
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЗнаменательВалютыУпр
		|	КОНЕЦ                                                               КАК КурсЗнаменательВалютыУпр,
		|
		|	Неопределено                                                        КАК АналитикаУчетаПоПартнерамПриемник,
		|	Неопределено                                                        КАК ОбъектРасчетовПриемник,
		|	Неопределено                                                        КАК ВалютаПриемник,
		|	Неопределено                                                        КАК ПартнерПриемник,
		|	Неопределено                                                        КАК ОрганизацияПриемник,
		|	Неопределено                                                        КАК КонтрагентПриемник,
		|	Неопределено                                                        КАК ДоговорПриемник,
		|	Неопределено                                                        КАК НаправлениеДеятельностиПриемник,
		|	0                                                                   КАК СуммаПриемник,
		|	ЛОЖЬ                                                                КАК ПоДаннымОбъектаРасчетовИсточника
		|ИЗ
		|	#УвеличениеЗадолженностиПоставщика КАК УвеличениеЗадолженностиПоставщика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельности
		|			ПО УвеличениеЗадолженностиПоставщика.ОбъектРасчетов = НаправленияДеятельности.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка = УвеличениеЗадолженностиПоставщика.ОбъектРасчетов.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
		|				ПО ВЫБОР КОГДА УвеличениеЗадолженностиПоставщика.Организация <> УвеличениеЗадолженностиПоставщика.ОбъектРасчетов.Организация
		|							ТОГДА УвеличениеЗадолженностиПоставщика.Организация
		|							ИНАЧЕ УвеличениеЗадолженностиПоставщика.ОбъектРасчетов.Организация
		|					КОНЕЦ = Аналитика.Организация
		|					И УвеличениеЗадолженностиПоставщика.ОбъектРасчетов.Контрагент = Аналитика.Контрагент
		|					И УвеличениеЗадолженностиПоставщика.Партнер = Аналитика.Партнер
		|					И УвеличениеЗадолженностиПоставщика.ОбъектРасчетов.Договор = Аналитика.Договор
		|					И НаправленияДеятельности.НаправлениеАналитики = Аналитика.НаправлениеДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаиморасчетыВтКоэффициентыПересчетаВалют КАК Коэффициенты
		|			ПО Коэффициенты.Ссылка = УвеличениеЗадолженностиПоставщика.Ссылка
		|				И Коэффициенты.ОбъектРасчетов = УвеличениеЗадолженностиПоставщика.ОбъектРасчетов
		|				И Коэффициенты.ВалютаВзаиморасчетов = УвеличениеЗадолженностиПоставщика.ВалютаВзаиморасчетов
		|				И Коэффициенты.ДатаКурса = УвеличениеЗадолженностиПоставщика.ДатаКурса
		|ГДЕ
		|	УвеличениеЗадолженностиПоставщика.СуммаВзаиморасчетов <> 0
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ФормаОплаты",                         ФормаОплаты);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЗаявкаНаРасходованиеДенежныхСредств", ЗаявкаНаРасходованиеДенежныхСредств);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СтатьяДвиженияДенежныхСредств",       СтатьяДвиженияДенежныхСредств);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СвязанныйДокумент",                   СвязанныйДокумент);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ИдентификаторФинЗаписи",              ИдентификаторФинЗаписи);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НастройкаХозяйственнойОперации",      НастройкаХозяйственнойОперации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВидОперацииДляСортировки",            ВидОперацииДляСортировки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ПорядокОперацииВПределахДокумента",   ПорядокОперацииВПределахДокумента);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОперацияВзаиморасчетов",              ОперацияВзаиморасчетов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СуммаРегл",                           СуммаРегл);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СуммаУпр",                            СуммаУпр);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ДатаПлатежа",                         ДатаПлатежа);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция УвеличитьНашуЗадолженностьПоставщику(Операция, ВидОперацииДляСортировки)
	
	Если Операция = "Закупка" Тогда
		
		ЗаказЗакупки = "УвеличениеНашейЗадолженностиПоставщику.ЗаказЗакупки";
		ДатаПлатежа = "ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.Сумма < 0
						|		ТОГДА ДАТАВРЕМЯ(1,1,1)
						|	ИНАЧЕ УвеличениеНашейЗадолженностиПоставщику.ДатаПлатежа
						|КОНЕЦ";
		ЗалогЗаТару = "УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетовПоТаре";
		СтатьяДвиженияДенежныхСредств = "Неопределено";
		СвязанныйДокумент = "УвеличениеНашейЗадолженностиПоставщику.СвязанныйДокумент";
		ИдентификаторФинЗаписи = "УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов.УникальныйИдентификатор";
		НастройкаХозяйственнойОперации = "Неопределено";
		ХозяйственнаяОперация = "УвеличениеНашейЗадолженностиПоставщику.ХозяйственнаяОперация";
		ОперацияВзаиморасчетов = "ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом)
						|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаЗадолженности)
						|	КОГДА УвеличениеНашейЗадолженностиПоставщику.Сумма < 0
						|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаНакладной)
						|	ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.Отгрузка)
						|КОНЕЦ";
		ВариантОплаты = "УвеличениеНашейЗадолженностиПоставщику.ВариантОплаты";
		
	ИначеЕсли Операция = "ВозвратОплатыОтПоставщика" Тогда
		
		ЗаказЗакупки = "Неопределено";
		ДатаПлатежа = "НАЧАЛОПЕРИОДА(УвеличениеНашейЗадолженностиПоставщику.ДатаРегистратора, ДЕНЬ)";
		ЗалогЗаТару = "0";
		СтатьяДвиженияДенежныхСредств = "УвеличениеНашейЗадолженностиПоставщику.СтатьяДвиженияДенежныхСредств";
		СвязанныйДокумент = "Неопределено";
		ИдентификаторФинЗаписи = "УвеличениеНашейЗадолженностиПоставщику.ИдентификаторФинЗаписи";
		НастройкаХозяйственнойОперации = "УвеличениеНашейЗадолженностиПоставщику.НастройкаХозяйственнойОперации";
		ХозяйственнаяОперация = "УвеличениеНашейЗадолженностиПоставщику.ХозяйственнаяОперация";
		ОперацияВзаиморасчетов = "ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратБронированияПодотчетногоЛица)
						|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаЗадолженности)
						|	ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ВозвратДенежныхСредств)
						|КОНЕЦ";
		ВариантОплаты = "Неопределено";
		
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	УвеличениеНашейЗадолженностиПоставщику.ДатаРегистратора               КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                                КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(Аналитика.КлючАналитики, Неопределено)                       КАК АналитикаУчетаПоПартнерам,
		|	УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов                 КАК ОбъектРасчетов,
		|	УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов           КАК Валюта,
		|	
		|	(УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов)          КАК Сумма,
		|	0                                                                     КАК Оплачивается,
		|	0                                                                     КАК КОплате,
		|	0                                                                     КАК КПоступлению,
		|	
		|	&ХозяйственнаяОперация                                                КАК ХозяйственнаяОперация,
		|	УвеличениеНашейЗадолженностиПоставщику.ФормаОплаты                    КАК ФормаОплаты,
		|	Неопределено                                                          КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	&ЗаказЗакупки                                                         КАК ЗакупкаПоЗаказу,
		|	УвеличениеНашейЗадолженностиПоставщику.ДатаРегистратора               КАК ДатаРегистратора,
		|	&ДатаПлатежа                                                          КАК ДатаПлатежа,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = Коэффициенты.ВалютаРегламентированногоУчета
		|				ТОГДА УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов
		|			КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|				ТОГДА УвеличениеНашейЗадолженностиПоставщику.Сумма
		|			ИНАЧЕ ВЫРАЗИТЬ(УвеличениеНашейЗадолженностиПоставщику.Сумма * Коэффициенты.КоэффициентРегл КАК ЧИСЛО(31,2))
		|	КОНЕЦ                                                                 КАК СуммаРегл,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|				ТОГДА УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов
		|			КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = &ВалютаУправленческогоУчета
		|				ТОГДА УвеличениеНашейЗадолженностиПоставщику.Сумма
		|			ИНАЧЕ ВЫРАЗИТЬ(УвеличениеНашейЗадолженностиПоставщику.Сумма * Коэффициенты.КоэффициентУпр КАК ЧИСЛО(31,2))
		|	КОНЕЦ                                                                 КАК СуммаУпр,
		|	&ЗалогЗаТару                                                          КАК ЗалогЗаТару,
		|	&СтатьяДвиженияДенежныхСредств                                        КАК СтатьяДвиженияДенежныхСредств,
		|	Неопределено                                                          КАК РасчетныйДокумент,
		|	//Порядок оплаты
		|	//Порядок зачета по дате платежа
		|	&СвязанныйДокумент                                                    КАК СвязанныйДокумент,
		|	&ВариантОплаты                                                        КАК ВариантОплаты,
		|	УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента                КАК ВалютаДокумента,
		|	Неопределено                                                          КАК КорОбъектРасчетов,
		|	Неопределено                                                          КАК КорАналитикаУчетаПоПартнерам,
		|	
		|	ВЫБОР КОГДА ЕСТЬNULL(ДанныеДоговора.ЦентрализованныйДоговор, Ложь)
		|		ТОГДА УвеличениеНашейЗадолженностиПоставщику.Организация
		|		ИНАЧЕ УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов.Организация
		|	КОНЕЦ                                                                 КАК Организация,
		|	УвеличениеНашейЗадолженностиПоставщику.Партнер                        КАК Партнер,
		|	УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов.Контрагент      КАК Контрагент,
		|	УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов.Договор         КАК Договор,
		|	НаправленияДеятельности.НаправлениеАналитики                          КАК НаправлениеДеятельности,
		|	
		|	Неопределено                                                          КАК КорПартнер,
		|	Неопределено                                                          КАК КорОрганизация,
		|	Неопределено                                                          КАК КорКонтрагент,
		|	Неопределено                                                          КАК КорДоговор,
		|	Неопределено                                                          КАК КорНаправлениеДеятельности,
		|	УвеличениеНашейЗадолженностиПоставщику.НомерРегистратора              КАК НомерРегистратора,
		|	&ИдентификаторФинЗаписи                                               КАК ИдентификаторФинЗаписи,
		|	&ВидОперацииДляСортировки                                             КАК ВидОперацииДляСортировки,
		|	ВЫБОР 
		|		КОГДА &ОперацияВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.Отгрузка)
		|			ТОГДА 4
		|		ИНАЧЕ 1
		|	КОНЕЦ                                                                 КАК ПорядокОперацииВПределахДокумента,
		|	&ОперацияВзаиморасчетов                                               КАК ОперацияВзаиморасчетов,
		|	&НастройкаХозяйственнойОперации                                       КАК НастройкаХозяйственнойОперации,
		|
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЧислительВалютыВзаиморасчетов
		|	КОНЕЦ                                                            КАК КурсЧислительВалютыВзаиморасчетов,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = Коэффициенты.ВалютаРегламентированногоУчета
		|		ИЛИ УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = Коэффициенты.ВалютаРегламентированногоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЗнаменательВалютыВзаиморасчетов
		|	КОНЕЦ                                                            КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|		ИЛИ УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = &ВалютаУправленческогоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЧислительВалютыУпр
		|	КОНЕЦ                                                            КАК КурсЧислительВалютыУпр,
		|	ВЫБОР КОГДА УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|		ИЛИ УвеличениеНашейЗадолженностиПоставщику.ВалютаДокумента = &ВалютаУправленческогоУчета
		|			ТОГДА 0
		|		ИНАЧЕ Коэффициенты.КурсЗнаменательВалютыУпр
		|	КОНЕЦ                                                            КАК КурсЗнаменательВалютыУпр,
		|
		|	Неопределено                                                          КАК АналитикаУчетаПоПартнерамПриемник,
		|	Неопределено                                                          КАК ОбъектРасчетовПриемник,
		|	Неопределено                                                          КАК ВалютаПриемник,
		|	Неопределено                                                          КАК ПартнерПриемник,
		|	Неопределено                                                          КАК ОрганизацияПриемник,
		|	Неопределено                                                          КАК КонтрагентПриемник,
		|	Неопределено                                                          КАК ДоговорПриемник,
		|	Неопределено                                                          КАК НаправлениеДеятельностиПриемник,
		|	0                                                                     КАК СуммаПриемник,
		|	ЛОЖЬ                                                                  КАК ПоДаннымОбъектаРасчетовИсточника
		|ИЗ
		|	#УвеличениеНашейЗадолженностиПоставщику КАК УвеличениеНашейЗадолженностиПоставщику
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельности
		|			ПО УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов = НаправленияДеятельности.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка = УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
		|				ПО ВЫБОР КОГДА ЕСТЬNULL(ДанныеДоговора.ЦентрализованныйДоговор, Ложь)
		|							ТОГДА УвеличениеНашейЗадолженностиПоставщику.Организация
		|							ИНАЧЕ УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов.Организация
		|					КОНЕЦ = Аналитика.Организация
		|					И УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов.Контрагент = Аналитика.Контрагент
		|					И УвеличениеНашейЗадолженностиПоставщику.Партнер = Аналитика.Партнер
		|					И УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов.Договор = Аналитика.Договор
		|					И НаправленияДеятельности.НаправлениеАналитики = Аналитика.НаправлениеДеятельности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаиморасчетыВтКоэффициентыПересчетаВалют КАК Коэффициенты
		|			ПО Коэффициенты.Ссылка = УвеличениеНашейЗадолженностиПоставщику.Ссылка
		|				И Коэффициенты.ОбъектРасчетов = УвеличениеНашейЗадолженностиПоставщику.ОбъектРасчетов
		|				И Коэффициенты.ВалютаВзаиморасчетов = УвеличениеНашейЗадолженностиПоставщику.ВалютаВзаиморасчетов
		|				И Коэффициенты.ДатаКурса = УвеличениеНашейЗадолженностиПоставщику.ДатаКурса
		|ГДЕ
		|	УвеличениеНашейЗадолженностиПоставщику.СуммаВзаиморасчетов <> 0
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЗаказЗакупки",                   ЗаказЗакупки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ДатаПлатежа",                    ДатаПлатежа);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЗалогЗаТару",                    ЗалогЗаТару);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СтатьяДвиженияДенежныхСредств",  СтатьяДвиженияДенежныхСредств);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СвязанныйДокумент",              СвязанныйДокумент);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ИдентификаторФинЗаписи",         ИдентификаторФинЗаписи);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НастройкаХозяйственнойОперации", НастройкаХозяйственнойОперации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ХозяйственнаяОперация",          ХозяйственнаяОперация);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВидОперацииДляСортировки",       ВидОперацииДляСортировки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОперацияВзаиморасчетов",         ОперацияВзаиморасчетов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВариантОплаты",                  ВариантОплаты);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция УвеличитьОплачиваетсяПоставщику(Операция, ВидОперацииДляСортировки)
	
	Если Операция = "ЗаявкаНаОплатуПоставщику" Тогда
		ЗаявкаНаРасходованиеДенежныхСредств = "УвеличениеОплачиваетсяПоставщику.Ссылка";
	ИначеЕсли Операция = "ОплатаПоставщику" Тогда
		ЗаявкаНаРасходованиеДенежныхСредств = "УвеличениеОплачиваетсяПоставщику.ЗаявкаНаРасходованиеДенежныхСредств";
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	УвеличениеОплачиваетсяПоставщику.ДатаРегистратора                   КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                              КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(Аналитика.КлючАналитики, Неопределено)                     КАК АналитикаУчетаПоПартнерам,
		|	УвеличениеОплачиваетсяПоставщику.ОбъектРасчетов                     КАК ОбъектРасчетов,
		|	УвеличениеОплачиваетсяПоставщику.ВалютаВзаиморасчетов               КАК Валюта,
		|	
		|	0                                                                   КАК Сумма,
		|	(УвеличениеОплачиваетсяПоставщику.УвеличениеОплачивается)           КАК Оплачивается,
		|	0                                                                   КАК КОплате,
		|	0                                                                   КАК КПоступлению,
		|	
		|	УвеличениеОплачиваетсяПоставщику.ХозяйственнаяОперация              КАК ХозяйственнаяОперация,
		|	УвеличениеОплачиваетсяПоставщику.ФормаОплаты                        КАК ФормаОплаты,
		|	&ЗаявкаНаРасходованиеДенежныхСредств                                КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	Неопределено                                                        КАК ЗакупкаПоЗаказу,
		|	УвеличениеОплачиваетсяПоставщику.ДатаРегистратора                   КАК ДатаРегистратора,
		|	ДАТАВРЕМЯ(1,1,1)                                                    КАК ДатаПлатежа,
		|	0                                                                   КАК СуммаРегл,
		|	0                                                                   КАК СуммаУпр,
		|	0                                                                   КАК ЗалогЗаТару,
		|	УвеличениеОплачиваетсяПоставщику.СтатьяДвиженияДенежныхСредств      КАК СтатьяДвиженияДенежныхСредств,
		|	Неопределено                                                        КАК РасчетныйДокумент,
		|	//Порядок оплаты
		|	//Порядок зачета по дате платежа
		|	Неопределено                                                        КАК СвязанныйДокумент,
		|	Неопределено                                                        КАК ВариантОплаты,
		|	УвеличениеОплачиваетсяПоставщику.ВалютаДокумента                    КАК ВалютаДокумента,
		|	Неопределено                                                        КАК КорОбъектРасчетов,
		|	Неопределено                                                        КАК КорАналитикаУчетаПоПартнерам,
		|	
		|	УвеличениеОплачиваетсяПоставщику.ОбъектРасчетов.Организация         КАК Организация,
		|	УвеличениеОплачиваетсяПоставщику.Партнер                            КАК Партнер,
		|	УвеличениеОплачиваетсяПоставщику.ОбъектРасчетов.Контрагент          КАК Контрагент,
		|	УвеличениеОплачиваетсяПоставщику.ОбъектРасчетов.Договор             КАК Договор,
		|	НаправленияДеятельности.НаправлениеАналитики                        КАК НаправлениеДеятельности,
		|	
		|	Неопределено                                                        КАК КорПартнер,
		|	Неопределено                                                        КАК КорОрганизация,
		|	Неопределено                                                        КАК КорКонтрагент,
		|	Неопределено                                                        КАК КорДоговор,
		|	Неопределено                                                        КАК КорНаправлениеДеятельности,
		|	УвеличениеОплачиваетсяПоставщику.НомерРегистратора                  КАК НомерРегистратора,
		|	&ИдентификаторНеиспользуемойФинЗаписи                               КАК ИдентификаторФинЗаписи,
		|	&ВидОперацииДляСортировки                                           КАК ВидОперацииДляСортировки,
		|	1                                                                   КАК ПорядокОперацииВПределахДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПустаяСсылка)          КАК ОперацияВзаиморасчетов,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)    КАК НастройкаХозяйственнойОперации,
		|
		|	0                                                                   КАК КурсЧислительВалютыВзаиморасчетов,
		|	0                                                                   КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	0                                                                   КАК КурсЧислительВалютыУпр,
		|	0                                                                   КАК КурсЗнаменательВалютыУпр,
		|
		|	Неопределено                                                        КАК АналитикаУчетаПоПартнерамПриемник,
		|	Неопределено                                                        КАК ОбъектРасчетовПриемник,
		|	Неопределено                                                        КАК ВалютаПриемник,
		|	Неопределено                                                        КАК ПартнерПриемник,
		|	Неопределено                                                        КАК ОрганизацияПриемник,
		|	Неопределено                                                        КАК КонтрагентПриемник,
		|	Неопределено                                                        КАК ДоговорПриемник,
		|	Неопределено                                                        КАК НаправлениеДеятельностиПриемник,
		|	0                                                                   КАК СуммаПриемник,
		|	ЛОЖЬ                                                                КАК ПоДаннымОбъектаРасчетовИсточника
		|ИЗ
		|	#УвеличениеОплачиваетсяПоставщику КАК УвеличениеОплачиваетсяПоставщику
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельности
		|			ПО УвеличениеОплачиваетсяПоставщику.ОбъектРасчетов = НаправленияДеятельности.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка =  УвеличениеОплачиваетсяПоставщику.ОбъектРасчетов.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
		|				ПО УвеличениеОплачиваетсяПоставщику.ОбъектРасчетов.Организация = Аналитика.Организация
		|					И УвеличениеОплачиваетсяПоставщику.ОбъектРасчетов.Контрагент = Аналитика.Контрагент
		|					И УвеличениеОплачиваетсяПоставщику.Партнер = Аналитика.Партнер
		|					И УвеличениеОплачиваетсяПоставщику.ОбъектРасчетов.Договор = Аналитика.Договор
		|					И НаправленияДеятельности.НаправлениеАналитики = Аналитика.НаправлениеДеятельности
		|ГДЕ
		|	УвеличениеОплачиваетсяПоставщику.УвеличениеОплачивается > 0
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЗаявкаНаРасходованиеДенежныхСредств", ЗаявкаНаРасходованиеДенежныхСредств);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВидОперацииДляСортировки",            ВидОперацииДляСортировки);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция УменьшитьОплачиваетсяПоставщику(ВидОперацииДляСортировки)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	УменьшениеОплачиваетсяПоставщику.ДатаРегистратора                    КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                               КАК ВидДвижения,
		|	
		|	ЕСТЬNULL(Аналитика.КлючАналитики, Неопределено)                      КАК АналитикаУчетаПоПартнерам,
		|	УменьшениеОплачиваетсяПоставщику.ОбъектРасчетов                      КАК ОбъектРасчетов,
		|	УменьшениеОплачиваетсяПоставщику.ВалютаВзаиморасчетов                КАК Валюта,
		|	
		|	0                                                                    КАК Сумма,
		|	(УменьшениеОплачиваетсяПоставщику.УменьшениеОплачивается)            КАК Оплачивается,
		|	0                                                                    КАК КОплате,
		|	0                                                                    КАК КПоступлению,
		|	
		|	УменьшениеОплачиваетсяПоставщику.ХозяйственнаяОперация               КАК ХозяйственнаяОперация,
		|	УменьшениеОплачиваетсяПоставщику.ФормаОплаты                         КАК ФормаОплаты,
		|	УменьшениеОплачиваетсяПоставщику.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	Неопределено                                                         КАК ЗакупкаПоЗаказу,
		|	УменьшениеОплачиваетсяПоставщику.ДатаРегистратора                    КАК ДатаРегистратора,
		|	ДАТАВРЕМЯ(1,1,1)                                                     КАК ДатаПлатежа,
		|	0                                                                    КАК СуммаРегл,
		|	0                                                                    КАК СуммаУпр,
		|	0                                                                    КАК ЗалогЗаТару,
		|	УменьшениеОплачиваетсяПоставщику.СтатьяДвиженияДенежныхСредств       КАК СтатьяДвиженияДенежныхСредств,
		|	Неопределено                                                         КАК РасчетныйДокумент,
		|	//Порядок оплаты
		|	//Порядок зачета по дате платежа
		|	Неопределено                                                         КАК СвязанныйДокумент,
		|	Неопределено                                                         КАК ВариантОплаты,
		|	УменьшениеОплачиваетсяПоставщику.ВалютаДокумента                     КАК ВалютаДокумента,
		|	Неопределено                                                         КАК КорОбъектРасчетов,
		|	Неопределено                                                         КАК КорАналитикаУчетаПоПартнерам,
		|	
		|	УменьшениеОплачиваетсяПоставщику.ОбъектРасчетов.Организация          КАК Организация,
		|	УменьшениеОплачиваетсяПоставщику.Партнер                             КАК Партнер,
		|	УменьшениеОплачиваетсяПоставщику.ОбъектРасчетов.Контрагент           КАК Контрагент,
		|	УменьшениеОплачиваетсяПоставщику.ОбъектРасчетов.Договор              КАК Договор,
		|	НаправленияДеятельности.НаправлениеАналитики                         КАК НаправлениеДеятельности,
		|	
		|	Неопределено                                                         КАК КорПартнер,
		|	Неопределено                                                         КАК КорОрганизация,
		|	Неопределено                                                         КАК КорКонтрагент,
		|	Неопределено                                                         КАК КорДоговор,
		|	Неопределено                                                         КАК КорНаправлениеДеятельности,
		|	УменьшениеОплачиваетсяПоставщику.НомерРегистратора                   КАК НомерРегистратора,
		|	&ИдентификаторНеиспользуемойФинЗаписи                                КАК ИдентификаторФинЗаписи,
		|	&ВидОперацииДляСортировки                                            КАК ВидОперацииДляСортировки,
		|	1                                                                    КАК ПорядокОперацииВПределахДокумента,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПустаяСсылка)           КАК ОперацияВзаиморасчетов,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)     КАК НастройкаХозяйственнойОперации,
		|
		|	0                                                                    КАК КурсЧислительВалютыВзаиморасчетов,
		|	0                                                                    КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	0                                                                    КАК КурсЧислительВалютыУпр,
		|	0                                                                    КАК КурсЗнаменательВалютыУпр,
		|
		|	Неопределено                                                         КАК АналитикаУчетаПоПартнерамПриемник,
		|	Неопределено                                                         КАК ОбъектРасчетовПриемник,
		|	Неопределено                                                         КАК ВалютаПриемник,
		|	Неопределено                                                         КАК ПартнерПриемник,
		|	Неопределено                                                         КАК ОрганизацияПриемник,
		|	Неопределено                                                         КАК КонтрагентПриемник,
		|	Неопределено                                                         КАК ДоговорПриемник,
		|	Неопределено                                                         КАК НаправлениеДеятельностиПриемник,
		|	0                                                                    КАК СуммаПриемник,
		|	ЛОЖЬ                                                                 КАК ПоДаннымОбъектаРасчетовИсточника
		|ИЗ
		|	#УменьшениеОплачиваетсяПоставщику КАК УменьшениеОплачиваетсяПоставщику
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНаправленияДеятельности КАК НаправленияДеятельности
		|			ПО УменьшениеОплачиваетсяПоставщику.ОбъектРасчетов = НаправленияДеятельности.ОбъектРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка =  УменьшениеОплачиваетсяПоставщику.ОбъектРасчетов.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
		|				ПО УменьшениеОплачиваетсяПоставщику.ОбъектРасчетов.Организация = Аналитика.Организация
		|					И УменьшениеОплачиваетсяПоставщику.ОбъектРасчетов.Контрагент = Аналитика.Контрагент
		|					И УменьшениеОплачиваетсяПоставщику.Партнер = Аналитика.Партнер
		|					И УменьшениеОплачиваетсяПоставщику.ОбъектРасчетов.Договор = Аналитика.Договор
		|					И НаправленияДеятельности.НаправлениеАналитики = Аналитика.НаправлениеДеятельности
		|ГДЕ
		|	УменьшениеОплачиваетсяПоставщику.УменьшениеОплачивается > 0
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидОперацииДляСортировки", ВидОперацииДляСортировки);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТУменьшениеПланаПоставки()
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	УменьшениеПланаПоставки.ПорядокРасчетов                  КАК ПорядокРасчетов,
		|	УменьшениеПланаПоставки.НакладнаяПоЗаказам               КАК НакладнаяПоЗаказам,
		|	
		|	ВЫБОР
		|		КОГДА УменьшениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
		|			ТОГДА УменьшениеПланаПоставки.ЗаказЗакупки.ОбъектРасчетов
		|		КОГДА УменьшениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
		|			ТОГДА ОбъектРасчетовДоговор.Ссылка
		|		ИНАЧЕ УменьшениеПланаПоставки.ОбъектРасчетов
		|	КОНЕЦ                                                    КАК ОбъектРасчетов,
		|	УменьшениеПланаПоставки.ВалютаВзаиморасчетов             КАК ВалютаВзаиморасчетов,
		|	
		|	УменьшениеПланаПоставки.УменьшитьКПоступлению            КАК УменьшитьКПоступлению,
		|	
		|	УменьшениеПланаПоставки.ХозяйственнаяОперация            КАК ХозяйственнаяОперация,
		|	ВЫБОР КОГДА УменьшениеПланаПоставки.СверхЗаказа
		|			ТОГДА Неопределено 
		|			ИНАЧЕ УменьшениеПланаПоставки.ЗаказЗакупки
		|	КОНЕЦ                                                    КАК ЗаказЗакупки,
		|	УменьшениеПланаПоставки.ДатаРегистратора                 КАК ДатаРегистратора,
		|	УменьшениеПланаПоставки.ВалютаДокумента                  КАК ВалютаДокумента,
		|	
		|	ВЫБОР
		|		КОГДА УменьшениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
		|			ТОГДА УменьшениеПланаПоставки.ЗаказЗакупки.ОбъектРасчетов.Организация
		|		КОГДА УменьшениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
		|			ТОГДА ОбъектРасчетовДоговор.Организация
		|		КОГДА ЕСТЬNULL(ДанныеДоговора.ЗаданГрафикИсполнения, ЛОЖЬ)
		|			ТОГДА УменьшениеПланаПоставки.ОбъектРасчетов.Организация
		|		ИНАЧЕ УменьшениеПланаПоставки.Организация
		|	КОНЕЦ                                                    КАК Организация,
		|	ВЫБОР
		|		КОГДА УменьшениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
		|			ТОГДА УменьшениеПланаПоставки.ЗаказЗакупки.ОбъектРасчетов.Партнер
		|		ИНАЧЕ УменьшениеПланаПоставки.Партнер
		|	КОНЕЦ                                                    КАК Партнер,
		|	ВЫБОР
		|		КОГДА УменьшениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
		|			ТОГДА УменьшениеПланаПоставки.ЗаказЗакупки.ОбъектРасчетов.Контрагент
		|		КОГДА УменьшениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
		|			ТОГДА ОбъектРасчетовДоговор.Контрагент
		|		ИНАЧЕ УменьшениеПланаПоставки.ОбъектРасчетов.Контрагент
		|	КОНЕЦ                                                    КАК Контрагент,
		|	ВЫБОР
		|		КОГДА УменьшениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
		|			ТОГДА УменьшениеПланаПоставки.ЗаказЗакупки.ОбъектРасчетов.Договор
		|		КОГДА УменьшениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
		|			ТОГДА ОбъектРасчетовДоговор.Договор
		|		ИНАЧЕ УменьшениеПланаПоставки.ОбъектРасчетов.Договор
		|	КОНЕЦ                                                    КАК Договор,
		|	УменьшениеПланаПоставки.НомерРегистратора                КАК НомерРегистратора,
		|	ЕСТЬNULL(ДанныеДоговора.ЗаданГрафикИсполнения, ЛОЖЬ)     КАК ЗаданГрафикИсполнения
		|ПОМЕСТИТЬ ВтУменьшениеПланаПоставки
		|ИЗ
		|	#УменьшениеПланаПоставки КАК УменьшениеПланаПоставки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка = УменьшениеПланаПоставки.ОбъектРасчетов.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектРасчетовДоговор
		|			ПО УменьшениеПланаПоставки.ОбъектРасчетов.Договор = ОбъектРасчетовДоговор.Объект
		|				И ОбъектРасчетовДоговор.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
		|				И УменьшениеПланаПоставки.ОбъектРасчетов.Организация = ОбъектРасчетовДоговор.Организация
		|				И НЕ ОбъектРасчетовДоговор.ТолькоОстатки
		|				И НЕ ОбъектРасчетовДоговор.ПометкаУдаления
		|ГДЕ
		|	УменьшениеПланаПоставки.УменьшитьКПоступлению <> 0 
		|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТУвеличениеПланаПоставки(ЭтоЗакупка=Ложь)
	
	Если ЭтоЗакупка Тогда
		НакладнаяПоЗаказам = "УвеличениеПланаПоставки.НакладнаяПоЗаказам";
		СверхЗаказа = "УвеличениеПланаПоставки.СверхЗаказа";
		Период = "УвеличениеПланаПоставки.ДатаРегистратора";
		ЗаказЗакупки = "ВЫБОР КОГДА УвеличениеПланаПоставки.СверхЗаказа
						|		ТОГДА Неопределено
						|	ИНАЧЕ УвеличениеПланаПоставки.ЗаказЗакупки
						|КОНЕЦ";
		ОбъектРасчетовЗаказа = "УвеличениеПланаПоставки.ЗаказЗакупки.ОбъектРасчетов";
	Иначе
		НакладнаяПоЗаказам = "ЛОЖЬ";
		СверхЗаказа = "ЛОЖЬ";
		Период = "КОНЕЦПЕРИОДА(УвеличениеПланаПоставки.ДатаПоступления, ДЕНЬ)";
		ЗаказЗакупки = "НЕОПРЕДЕЛЕНО";
		ОбъектРасчетовЗаказа = "НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	УвеличениеПланаПоставки.ПорядокРасчетов                  КАК ПорядокРасчетов,
		|	&НакладнаяПоЗаказам                                      КАК НакладнаяПоЗаказам,
		|	&Период                                                  КАК Период,
		|	&СверхЗаказа                                             КАК СверхЗаказа,
		|	
		|	ВЫБОР
		|		КОГДА УвеличениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
		|			И ЕСТЬNULL(&ОбъектРасчетовЗаказа, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ОбъектРасчетовЗаказ.Ссылка
		|		КОГДА УвеличениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
		|			ТОГДА ОбъектРасчетовДоговор.Ссылка
		|		ИНАЧЕ УвеличениеПланаПоставки.ОбъектРасчетов
		|	КОНЕЦ                                                    КАК ОбъектРасчетов,
		|	УвеличениеПланаПоставки.ВалютаВзаиморасчетов             КАК ВалютаВзаиморасчетов,
		|	
		|	УвеличениеПланаПоставки.УвеличитьКПоступлению            КАК УвеличитьКПоступлению,
		|	
		|	УвеличениеПланаПоставки.ХозяйственнаяОперация            КАК ХозяйственнаяОперация,
		|	&ЗаказЗакупки                                            КАК ЗаказЗакупки,
		|	УвеличениеПланаПоставки.ДатаРегистратора                 КАК ДатаРегистратора,
		|	УвеличениеПланаПоставки.ВалютаДокумента                  КАК ВалютаДокумента,
		|	
		|	ВЫБОР
		|		КОГДА УвеличениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
		|			ТОГДА УвеличениеПланаПоставки.ОбъектРасчетов.Организация
		|		КОГДА УвеличениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
		|			ТОГДА ОбъектРасчетовДоговор.Организация
		|		КОГДА ЕСТЬNULL(ДанныеДоговора.ЗаданГрафикИсполнения, ЛОЖЬ)
		|			ТОГДА УвеличениеПланаПоставки.ОбъектРасчетов.Организация
		|		ИНАЧЕ УвеличениеПланаПоставки.Организация
		|	КОНЕЦ                                                    КАК Организация,
		|	ВЫБОР
		|		КОГДА УвеличениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным)
		|			ТОГДА УвеличениеПланаПоставки.ОбъектРасчетов.Партнер
		|		ИНАЧЕ УвеличениеПланаПоставки.Партнер
		|	КОНЕЦ                                                    КАК Партнер,
		|	ВЫБОР
		|		КОГДА УвеличениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
		|			ТОГДА ОбъектРасчетовДоговор.Контрагент
		|		ИНАЧЕ УвеличениеПланаПоставки.ОбъектРасчетов.Контрагент
		|	КОНЕЦ                                                    КАК Контрагент,
		|	ВЫБОР
		|		КОГДА УвеличениеПланаПоставки.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным)
		|			ТОГДА ОбъектРасчетовДоговор.Договор
		|		ИНАЧЕ УвеличениеПланаПоставки.ОбъектРасчетов.Договор
		|	КОНЕЦ                                                    КАК Договор,
		|	УвеличениеПланаПоставки.НомерРегистратора                КАК НомерРегистратора,
		|	ЕСТЬNULL(ДанныеДоговора.ЗаданГрафикИсполнения, ЛОЖЬ)     КАК ЗаданГрафикИсполнения
		|ПОМЕСТИТЬ ВтУвеличениеПланаПоставки
		|ИЗ
		|	#УвеличениеПланаПоставки КАК УвеличениеПланаПоставки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|			ПО ДанныеДоговора.Ссылка =  УвеличениеПланаПоставки.ОбъектРасчетов.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектРасчетовДоговор
		|			ПО УвеличениеПланаПоставки.ОбъектРасчетов.Договор = ОбъектРасчетовДоговор.Объект
		|				И ОбъектРасчетовДоговор.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
		|				И УвеличениеПланаПоставки.ОбъектРасчетов.Организация = ОбъектРасчетовДоговор.Организация
		|				И НЕ ОбъектРасчетовДоговор.ТолькоОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектРасчетовЗаказ
		|			ПО &ОбъектРасчетовЗаказа = ОбъектРасчетовЗаказ.Ссылка
		|				И НЕ ОбъектРасчетовЗаказ.ТолькоОстатки
		|ГДЕ
		|	УвеличениеПланаПоставки.УвеличитьКПоступлению <> 0
		|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&Период",               Период);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СверхЗаказа",          СверхЗаказа);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НакладнаяПоЗаказам",   НакладнаяПоЗаказам);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЗаказЗакупки",         ЗаказЗакупки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ОбъектРасчетовЗаказа", ОбъектРасчетовЗаказа);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти