#Область ПрограммныйИнтерфейс

// Реквизиты отправителя необходимые для отправки писем.
// 
// Возвращаемое значение:
//  Структура - реквизиты отправителя.
//
Функция РеквизитыОтправителя() Экспорт
	
	РеквизитыОтправителя = Новый Структура;
	РеквизитыОтправителя.Вставить("ИмяПользователяОтправителя", "Контур.Логистика");
	РеквизитыОтправителя.Вставить("АдресЭлектроннойПочты");
	РеквизитыОтправителя.Вставить("АдресСервераSMTP");
	РеквизитыОтправителя.Вставить("ПользовательSMTP");
	РеквизитыОтправителя.Вставить("ПортSMTP");
	РеквизитыОтправителя.Вставить("ПарольSMTP");
	
	ИспользоватьСистемнуюУчетнуюЗапись = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"ИспользоватьСистемнуюУчетнуюЗапись");
	
	Если ИспользоватьСистемнуюУчетнуюЗапись Тогда
		
		МодульРаботаСПочтовымиСообщениями = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("РаботаСПочтовымиСообщениями");
		Если МодульРаботаСПочтовымиСообщениями = Неопределено Тогда
			Возврат РеквизитыОтправителя;
		КонецЕсли;
		
		СистемнаяУчетнаяЗапись = МодульРаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		Если СистемнаяУчетнаяЗапись = Неопределено Тогда
			Возврат РеквизитыОтправителя;
		КонецЕсли;
		
		РеквизитыОтправителя.АдресЭлектроннойПочты = СистемнаяУчетнаяЗапись.АдресЭлектроннойПочты;
		РеквизитыОтправителя.АдресСервераSMTP = СистемнаяУчетнаяЗапись.СерверИсходящейПочты;
		РеквизитыОтправителя.ПользовательSMTP = СистемнаяУчетнаяЗапись.Пользователь;
		РеквизитыОтправителя.ПортSMTP = СистемнаяУчетнаяЗапись.ПортСервераИсходящейПочты;
		
	Иначе
		
		РеквизитыОтправителя.АдресЭлектроннойПочты = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("АдресЭлектроннойПочты");
		РеквизитыОтправителя.АдресСервераSMTP = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("АдресСервераSMTP");
		РеквизитыОтправителя.ПользовательSMTP = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ПользовательSMTP");
		РеквизитыОтправителя.ПортSMTP = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ПортSMTP");
		РеквизитыОтправителя.ПарольSMTP = КонтурЛогистика_ОбщегоНазначенияВызовСервера.ПолучитьПароль("ПарольЭлектроннойПочты", "Пароль");
		
	КонецЕсли;
	
	Возврат РеквизитыОтправителя;
	
КонецФункции

// Выполняет отправку письма.
//
// Параметры:
//  Письмо - ИнтернетПочтовоеСообщение - почтовое сообщение.
// 
// Возвращаемое значение:
//  ТекстОшибки - Строка - сообщение об ошибке в случае, когда удалось отправить не все письма.
//
Функция ОтправитьПисьмо(Письмо, РеквизитыОтправителя = Неопределено) Экспорт
	
	ИспользоватьСистемнуюУчетнуюЗапись = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"ИспользоватьСистемнуюУчетнуюЗапись");
	Если ИспользоватьСистемнуюУчетнуюЗапись Тогда
		ТекстОшибки = ОтправитьПисьмоУчетнаяСистема(Письмо);
	Иначе
		ТекстОшибки = ОтправитьПисьмоЛогистика(Письмо, РеквизитыОтправителя);
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

// Настройки отправки почты заполнены
// 
// Возвращаемое значение:
//  Булево - признак заполненности настроек.
//
Функция НастройкиОтправкиПочтыЗаполнены() Экспорт
	
	ИспользоватьСистемнуюУчетнуюЗапись = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"ИспользоватьСистемнуюУчетнуюЗапись");
	
	Если ИспользоватьСистемнуюУчетнуюЗапись Тогда
		
		МодульРаботаСПочтовымиСообщениями = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("РаботаСПочтовымиСообщениями");
		Если МодульРаботаСПочтовымиСообщениями = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СистемнаяУчетнаяЗапись = МодульРаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		Если СистемнаяУчетнаяЗапись = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ДляОтправки = Истина;
		
		Возврат МодульРаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(СистемнаяУчетнаяЗапись, ДляОтправки);
		
	Иначе
		
		РеквизитыОтправителя = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.НастройкиОтправкиПочты();
		
		Если Не ЗначениеЗаполнено(РеквизитыОтправителя.АдресЭлектроннойПочты)
			Или Не ЗначениеЗаполнено(РеквизитыОтправителя.АдресСервераSMTP)
			Или Не ЗначениеЗаполнено(РеквизитыОтправителя.ПользовательSMTP)
			Или Не ЗначениеЗаполнено(РеквизитыОтправителя.ПортSMTP)
			Или Не ЗначениеЗаполнено(РеквизитыОтправителя.ПарольSMTP) Тогда
			
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтправитьПисьмоЛогистика(Письмо, РеквизитыОтправителя = Неопределено)
	
	ТекстОшибки = Неопределено;
	
	Если РеквизитыОтправителя = Неопределено Тогда
		РеквизитыОтправителя = РеквизитыОтправителя();
	КонецЕсли;
	
	ПроверитьРеквизитыОтправителя(РеквизитыОтправителя);
	
	ПочтовыйПрофиль = НовыйПочтовыйПрофиль(РеквизитыОтправителя);
	
	Соединение = Новый ИнтернетПочта;
	Соединение.Подключиться(ПочтовыйПрофиль);
	
	Письмо.ИмяОтправителя = РеквизитыОтправителя.ИмяПользователяОтправителя;
	Письмо.Отправитель.ОтображаемоеИмя = РеквизитыОтправителя.ИмяПользователяОтправителя;
	Письмо.Отправитель.Адрес = РеквизитыОтправителя.АдресЭлектроннойПочты;
	
	Попытка
		Соединение.Послать(Письмо);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка сервиса при отправке на почту: " + Строка(РеквизитыОтправителя.АдресЭлектроннойПочты) + ".
			|" + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Попытка
		Соединение.Отключиться();
	Исключение
		// Не требуется
	КонецПопытки;
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция ОтправитьПисьмоУчетнаяСистема(Письмо)
	
	ТекстОшибки = Неопределено;
	
	МодульРаботаСПочтовымиСообщениями = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("РаботаСПочтовымиСообщениями");
	Если МодульРаботаСПочтовымиСообщениями = Неопределено Тогда
		Возврат "Не удалось найти модуль: РаботаСПочтовымиСообщениями";
	КонецЕсли;
	
	СистемнаяУчетнаяЗапись = МодульРаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	Если СистемнаяУчетнаяЗапись = Неопределено Тогда
		Возврат "Не удалось получить системную учетную запись";
	КонецЕсли;
	
	Попытка
		
		РезультатыОтправкиПисем = МодульРаботаСПочтовымиСообщениями.ОтправитьПисьмо(СистемнаяУчетнаяЗапись, Письмо);
		
		Если РезультатыОтправкиПисем.ОшибочныеПолучатели.Количество() <> 0 Тогда
			
			ТекстыОшибок = Новый Массив;
			Для Каждого ОшибочныйПолучатель Из РезультатыОтправкиПисем.ОшибочныеПолучатели Цикл
				ТекстыОшибок.Добавить(Строка(ОшибочныйПолучатель.Ключ) + ": " + ОшибочныйПолучатель.Значение);
			КонецЦикла;
			ТекстОшибки = "Отправка письма следующим получателям не выполнена:
				|" + КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(ТекстыОшибок, Символы.ПС);
			
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка сервиса при отправке на почту (системная учетная запись): "
			+ Строка(Письмо.Отправитель.Адрес) + ".
			|" + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		
	КонецПопытки;
	
	Возврат ТекстОшибки;
	
КонецФункции

Процедура ПроверитьРеквизитыОтправителя(РеквизитыОтправителя)
	
	Если Не ЗначениеЗаполнено(РеквизитыОтправителя.АдресЭлектроннойПочты) Тогда
		ВызватьИсключение "Не заполнен адрес электронной почты.";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыОтправителя.АдресСервераSMTP) Тогда
		ВызватьИсключение "Не заполнен адрес сервера SMTP.";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыОтправителя.ПользовательSMTP) Тогда
		ВызватьИсключение "Не заполнен пользователь SMTP.";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыОтправителя.ПортSMTP) Тогда
		ВызватьИсключение "Не заполнен порт SMTP.";
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйПочтовыйПрофиль(РеквизитыОтправителя)
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль;
	ПочтовыйПрофиль.Таймаут = 30;
	ПочтовыйПрофиль.АдресСервераSMTP = РеквизитыОтправителя.АдресСервераSMTP;
	ПочтовыйПрофиль.ТолькоЗащищеннаяАутентификацияSMTP = Истина;
	ПочтовыйПрофиль.ПортSMTP = РеквизитыОтправителя.ПортSMTP;
	ПочтовыйПрофиль.ПользовательSMTP = РеквизитыОтправителя.ПользовательSMTP;
	ПочтовыйПрофиль.ПарольSMTP = РеквизитыОтправителя.ПарольSMTP;
	ПочтовыйПрофиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	ПочтовыйПрофиль.ИспользоватьSSLSMTP = Истина;
	
	Возврат ПочтовыйПрофиль;
	
КонецФункции

#КонецОбласти