
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если не ЗначениеЗаполнено(ПараметрКоманды) Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("В выбранном документе-титуле не указана ЭТрН");
		Возврат;
	КонецЕсли;

	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(
					ПолучитьЭТрН(ПараметрКоманды));
					
КонецПроцедуры

&НаСервере
Функция ПолучитьЭТрН(ДокТитулИлиЭтрн)
	
	Если ТипЗнч(ДокТитулИлиЭтрн) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная") Тогда 
		Возврат	ДокТитулИлиЭтрн;
	Иначе
		Возврат	ДокТитулИлиЭтрн.ДокументЭТРН;
	КонецЕсли;

КонецФункции 
