#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьИнформациюОЛимитах(Команда)
	ПолучитьИнформациюОЛимитахНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьРезультатаФорма(ДанныеСоответствие)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьТабличнуюЧастьРезультата(ДанныеСоответствие);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИнформациюОЛимитахНаКлиентеФорма(ОписаниеРезультата = "")
	Результат = Истина;

	РезультатHTTPЗапроса = КонтурЗакупки_httpЗапросыКлиентСервер.http_ПолучитьИнформациюОЛимитах();
	Если РезультатHTTPЗапроса <> Неопределено Тогда
		Если Не РезультатHTTPЗапроса["data"] = Неопределено Тогда
			ДанныеСоответствие = РезультатHTTPЗапроса["data"];
			Если ТипЗнч(ДанныеСоответствие) = Тип("Массив") Тогда
				ЗаполнитьТабличнуюЧастьРезультатаФорма(ДанныеСоответствие);
			КонецЕсли;
		ИначеЕсли Не РезультатHTTPЗапроса["error"] = Неопределено И РезультатHTTPЗапроса["error"] = Истина Тогда
			Результат = Ложь;
			ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Ошибка:'") + " " + РезультатHTTPЗапроса["message"]
				+ Символы.ПС;
		КонецЕсли;
	Иначе
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Ошибка'") + Символы.ПС;
	КонецЕсли;

	Возврат Результат
КонецФункции

&НаКлиенте
Процедура ПолучитьИнформациюОЛимитахНаКлиенте()
	ОписаниеРезультата = "";
	Если Не ПолучитьИнформациюОЛимитахНаКлиентеФорма(ОписаниеРезультата) Тогда
		КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеРезультата);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти