#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() И НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда
		
		ОбщегоНазначения.СообщитьПользователю("У вас нет прав на создание вида номенклатуры. Обратитесь к администратору");
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Элемент = АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_НеИспользуется", "СтраницаОсновное",, 2, "Объект.АУ_НеИспользуется",,,"Наименование");
	ЭтаФорма.ТолькоПросмотр = НЕ Пользователи.РолиДоступны("ПолныеПрава");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
