
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.ФормироватьЗаявкиНаЗакупку Тогда
		Заголовок = НСтр("ru = 'Параметры создания заявки'");
		Элементы.РазбиватьЗаказыПоДатамЗаказа.Заголовок = НСтр("ru = 'по датам заявки'");
	Иначе
		Заголовок = НСтр("ru = 'Параметры создания заказа'");
	КонецЕсли;
	
	РазбиватьЗаказыПоДатамЗаказа = Параметры.РазбиватьЗаказыПоДатамЗаказа;
	РазбиватьЗаказыПоДатамПоставки = Параметры.РазбиватьЗаказыПоДатамПоставки;
	РазбиватьЗаказыПоНазначениям = Параметры.РазбиватьЗаказыПоНазначениям;
	РазбиватьЗаказыПоСкладам = Параметры.РазбиватьЗаказыПоСкладам;
	РазбиватьЗаказыПоСтрокамПланов = Параметры.РазбиватьЗаказыПоСтрокамПланов;
	
	Элементы.РазбиватьЗаказыПоНазначениям.Видимость = Параметры.ВидимостьНазначения;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПараметрыСозданияЗаказа = Новый Структура();
	ПараметрыСозданияЗаказа.Вставить("РазбиватьЗаказыПоДатамЗаказа", РазбиватьЗаказыПоДатамЗаказа);
	ПараметрыСозданияЗаказа.Вставить("РазбиватьЗаказыПоДатамПоставки", РазбиватьЗаказыПоДатамПоставки);
	ПараметрыСозданияЗаказа.Вставить("РазбиватьЗаказыПоНазначениям", РазбиватьЗаказыПоНазначениям);
	ПараметрыСозданияЗаказа.Вставить("РазбиватьЗаказыПоСкладам", РазбиватьЗаказыПоСкладам);
	ПараметрыСозданияЗаказа.Вставить("РазбиватьЗаказыПоСтрокамПланов", РазбиватьЗаказыПоСтрокамПланов);
	
	ОповеститьОВыборе(ПараметрыСозданияЗаказа);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
