// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТаблицаРегионов") Тогда
		Для Каждого РегионВыбран Из Параметры["ТаблицаРегионов"] Цикл
			НовСтр = ТаблицаРегионов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, РегионВыбран);
			НовСтр.ДействиеСоСтрокой = НСтр("ru = 'Удалить'");
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодборРегионаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ПодборРегионаОбработкаВыбораНаКлиенте(ВыбранноеЗначение);
	ТекущийЭлемент = Элементы.ПодборРегиона;
КонецПроцедуры
&НаКлиенте
Процедура ПодборРегионаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПодборРегионаИзменениеТекстаРедактированияНаКлиенте(Текст);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаРегионов

&НаКлиенте
Процедура РегионыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ТаблицаРегионовДействиеСоСтрокой Тогда
		УдаляемаяСтрока = ТаблицаРегионов.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
		ТаблицаРегионов.Удалить(УдаляемаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РегионыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтменить(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавить(Команда)
	Закрыть(ТаблицаРегионов);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчистить(Команда)
	ТаблицаРегионов.Очистить();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодборРегионаИзменениеТекстаРедактированияНаКлиенте(Название)
	РезультатHTTPЗапроса = КонтурЗакупки_httpЗапросыКлиентСервер.http_ПолучитьСписокРегионов(Название);
	Если Не РезультатHTTPЗапроса = Неопределено Тогда
		Элементы.ПодборРегиона.СписокВыбора.Очистить();

		Если Не РезультатHTTPЗапроса["data"] = Неопределено Тогда
			МассивРегионов = РезультатHTTPЗапроса["data"];
			Для Каждого ЭлементРегиона Из МассивРегионов Цикл
				Элементы.ПодборРегиона.СписокВыбора.Добавить(ЭлементРегиона["id"], ЭлементРегиона["label"]);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодборРегионаОбработкаВыбораНаКлиенте(ВыбранноеЗначение)
	ЭлементСЗ = Элементы.ПодборРегиона.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	Если Не ЭлементСЗ = Неопределено Тогда
		СтрукОтбор = Новый Структура("ИдентификаторРегиона", ЭлементСЗ.Значение);
		Если ТаблицаРегионов.НайтиСтроки(СтрукОтбор).Количество() = 0 Тогда
			НовСтрокаРегионов = ТаблицаРегионов.Добавить();
			НовСтрокаРегионов.Регион = ЭлементСЗ.Представление;
			НовСтрокаРегионов.ИдентификаторРегиона = ЭлементСЗ.Значение;
			НовСтрокаРегионов.ДействиеСоСтрокой = НСтр("ru = 'Удалить'");
		КонецЕсли;
	КонецЕсли;
	Элементы.ПодборРегиона.СписокВыбора.Очистить();
КонецПроцедуры

#КонецОбласти