
&НаКлиенте
Процедура СохранитьExcel(Команда)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	Результат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	ИмяФайла = СтрШаблон("Коммерческое предложение от %1.xlsx", Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
	
	ПолучитьФайл(АдресВоВременномХранилище,ИмяФайла, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// проверяю на наличие параметра при открытии и устанавливаю элемент польз. настроийки
	
	Если Параметры.Свойство("Ссылка") Тогда
		Для Каждого ЭлементНастройки Из  Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(ЭлементНастройки)= Тип("ЗначениеПараметраНастроекКомпоновкиДанных") 
				И ЭлементНастройки.Параметр= Новый ПараметрКомпоновкиДанных("Ссылка") Тогда
				ЭлементНастройки.Значение= Параметры.Ссылка;
				ЭлементНастройки.Использование= Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто);
КонецПроцедуры
