
// TODO Изменение статуса документа следует переписать с изменением статуса файла обмена по нему

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		ПараметрыВыполненияКоманды.Источник.РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ЗапроситьНовыйСтатус(ПараметрКоманды);

КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьНовыйСтатус(ПараметрКоманды)

	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьВводЗначения_КонтурЛогистика(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик"),
		"Выберите новый статус документа(ов)",
		,
		ЭтотОбъект,
		"ОбработчикВводаНовогоСтатуса",
		ПараметрКоманды);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВводаНовогоСтатуса(НовыйСтатус, МассивДокументов) Экспорт
	
	Если НовыйСтатус <> Неопределено И МассивДокументов.Количество() > 0 Тогда
		
		УстановитьНовыеСтатусыСервер(НовыйСтатус, МассивДокументов);
		
		Если ТипЗнч(МассивДокументов) = Тип("Массив")
			И МассивДокументов.Количество() > 0 Тогда
			
			Для Каждого ДокументСсылка Из МассивДокументов Цикл
				КонтурЛогистика_ОбщегоНазначенияКлиент.ОповеститьОбИзмененииДокумента(ДокументСсылка)			
			КонецЦикла;
			Оповестить("КонтурЛогистика_ОбновитьЗадачи");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНовыеСтатусыСервер(НовыйСтатус, МассивДокументов)
	
	Попытка
		
		Для Каждого Документ Из МассивДокументов Цикл
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Документ, НовыйСтатус, Истина, Ложь);
			
		КонецЦикла;
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось изменить статус документа по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры
