#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отбор = "НеДобавленные";	
		
	Команды.КомандаПоУмолчанию.Подсказка = "Команда выполняет действия с отмеченными строками:
		|  Добавить в организацию - отправить приглашение сотруднику по номеру телефона в сервис
		|  Проверить приглашение - проверить отправленное ранее приглашение
		|  Переотправить - заново отправить приглашение сотруднику";
	
	
	Организация = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ОрганизацияПоУмолчанию();
	Если ЗначениеЗаполнено(Организация) Тогда
		ЗаполнитьТаблицуСотрудники();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
	Элементы.Протокол.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ОбновитьФизическиеЛица" Тогда
		ЗаполнитьТаблицуСотрудники();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьТаблицуСотрудников(Команда)
	ЗаполнитьТаблицуСотрудники();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Если Отбор = "ПринялиПриглашение" Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Стр Из Сотрудники Цикл		
		
		Если Отбор = "Все" И (Стр.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение")
			Или Стр.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.Удалено")) Тогда
			Продолжить;
		КонецЕсли;
		
		Стр.Пометка = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого Стр Из Сотрудники Цикл
		Стр.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоУмолчанию(Команда)
	
	Если КомандаПоУмалчанию = "ДобавитьВОрганизацию" Тогда
		ВыполнитьКомандуДобавитьВОрганизацию();
	ИначеЕсли КомандаПоУмалчанию = "ПроверитьПриглашение" Тогда
		ВыполнитьКомандуПроверитьПриглашение();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуДобавитьВОрганизацию()
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Групповое добавление сотрудников", "Добавить в организацию", 
		"РегистрСведений.КонтурЛогистика_СервисФизическихЛиц.Форма.ФормаГрупповоеДобавлениеСотрудниковВОрганизацию");
	
	Элементы.Протокол.Видимость = Истина;
	
	ДобавитьВПротокол("=== Начало обработки ===");
		
	Для каждого Стр Из Сотрудники Цикл
		
		Если Не Стр.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ПредупрежденияСотрудника) Тогда
			ДобавитьВПротокол("У сотрудника " + Стр.Сотрудник + " " + Стр.ПредупрежденияСотрудника);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.Телефон) Тогда
			ДобавитьВПротокол("У сотрудника " + Стр.Сотрудник + " не заполнен телефон");
			Продолжить;
		КонецЕсли; 
		
		Результат = КонтурЛогистика_СервисФизическихЛицСервер.ОтправитьПриглашение(
			Стр.Организация, Стр.Сотрудник, Перечисления.КонтурЛогистика_СценарииПриглашенийФизическихЛиц.Водитель, Стр.Телефон, Стр.Статус, Стр.PersonId);
			
		Если Результат.ЕстьОшибка Тогда
			КонтурЛогистика_Метрика.ОбработатьОшибку("ГрупповоеДобавлениеСотрудников", Результат.ОписаниеОшибки, Стр.Сотрудник);
		КонецЕсли;
			
		Если Результат.ЕстьОшибка Тогда
			ДобавитьВПротокол("При отправление приглашения " + Стр.Сотрудник + " произошла ошибка: " + Результат.ОписаниеОшибки);
		Иначе
			ДобавитьВПротокол("Сотруднику " + Стр.Сотрудник + " отправлено приглашение для добавления в организацию");
		КонецЕсли;
			
	КонецЦикла;
	
	ДобавитьВПротокол("=== Окончание обработки ===");
	
	ЗаполнитьТаблицуСотрудники();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуПроверитьПриглашение()
	
	Элементы.Протокол.Видимость = Истина;
	
	ДобавитьВПротокол("=== Начало обработки ===");
		
	Для каждого Стр Из Сотрудники Цикл
		
		Если Не Стр.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ПриглашениеПринято = Ложь;
		
		Попытка
			
			КонтурЛогистика_СервисФизическихЛицСервер.ПроверитьПриглашение(
				Стр.Организация, Стр.Сотрудник, Перечисления.КонтурЛогистика_СценарииПриглашенийФизическихЛиц.Водитель, Стр.PersonId, ПриглашениеПринято);
			
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ДобавитьВПротокол(КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;
		
		Если ПриглашениеПринято Тогда
			ДобавитьВПротокол("Сотрудник " + Стр.Сотрудник + " принял приглашение");
		КонецЕсли;
		
	КонецЦикла;
	
	ДобавитьВПротокол("=== Окончание обработки ===");
	
	ЗаполнитьТаблицуСотрудники();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	
	ЗаполнитьТаблицуСотрудники();
	
	УправлениеЭлементамиФормы()
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("Ключ, ПерейтиНаФизическихЛиц", ТекущиеДанные.Сотрудник, Истина);
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПротоколНажатие(Элемент)
	
	Элементы.Протокол.Видимость = Не Элементы.Протокол.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиКД = Новый НастройкиКомпоновкиДанных;
	
	ДоступныеОрганизации = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ДоступныеОрганизацииДляСервисаФизЛиц();
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборСписка.ПравоеЗначение = ДоступныеОрганизации;
	ОтборСписка.Использование = Истина;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ФиксированныеНастройки", НастройкиКД);
	ПараметрыВыбора.Вставить("СкрытьОтбор");
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаВыбора", ПараметрыВыбора, ЭтаФорма, ЭтаФорма, "ОбработчикВыбораОрганизации");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьЗаголовокКомандыПоУмолчанию()
	
	Если Отбор = "Все" Тогда
		Элементы.ФормаДействиеПоУмолчанию.Заголовок = "Переотправить и проверить приглашение";
	ИначеЕсли Отбор = "НеДобавленные" Тогда
		Элементы.ФормаДействиеПоУмолчанию.Заголовок = "Добавить в организацию";
		КомандаПоУмалчанию = "ДобавитьВОрганизацию";
	ИначеЕсли Отбор = "НеПринятые" Тогда
		Элементы.ФормаДействиеПоУмолчанию.Заголовок = "Проверить приглашение";
		КомандаПоУмалчанию = "ПроверитьПриглашение";
	ИначеЕсли Отбор = "СОшибкой" Тогда
		Элементы.ФормаДействиеПоУмолчанию.Заголовок = "Переотправить";
		КомандаПоУмалчанию = "ДобавитьВОрганизацию";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	УстановитьЗаголовокКомандыПоУмолчанию();
	
	Элементы.СотрудникиОписаниеОшибки.Видимость = Отбор = "СОшибкой";
	Элементы.ФормаДействиеПоУмолчанию.Видимость = Отбор <> "ПринялиПриглашение" И Отбор <> "Все";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСотрудники()
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сотрудники.Очистить();
		Возврат;
	КонецЕсли;
	
	тз = РеквизитФормыВЗначение("Сотрудники");
	
	тз.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_Сотрудники.Ссылка КАК Сотрудник,
		|	КонтурЛогистика_Сотрудники.ТелефонОсновной КАК Телефон,
		|	КонтурЛогистика_СервисФизическихЛиц.Организация КАК Организация,
		|	КонтурЛогистика_СервисФизическихЛиц.PersonId КАК PersonId,
		|	КонтурЛогистика_СервисФизическихЛиц.UserId КАК UserId,
		|	КонтурЛогистика_СервисФизическихЛиц.InviteId КАК InviteId,
		|	КонтурЛогистика_СервисФизическихЛиц.IdentityDocumentId КАК IdentityDocumentId,
		|	КонтурЛогистика_СервисФизическихЛиц.ЕстьОшибка КАК ЕстьОшибка,
		|	КонтурЛогистика_СервисФизическихЛиц.ОписаниеОшибки КАК ОписаниеОшибки,
		|	ЕСТЬNULL(КонтурЛогистика_СервисФизическихЛиц.Статус, ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ПустаяСсылка)) КАК Статус,
		|	КонтурЛогистика_Сотрудники.Фамилия КАК Фамилия,
		|	КонтурЛогистика_Сотрудники.Имя КАК Имя,
		|	КонтурЛогистика_Сотрудники.Отчество КАК Отчество,
		|	КонтурЛогистика_Сотрудники.ВУСерия КАК ВУСерия,
		|	КонтурЛогистика_Сотрудники.ВУНомер КАК ВУНомер,
		|	КонтурЛогистика_Сотрудники.ВУДатаВыдачи КАК ВУДатаВыдачи
		|ИЗ
		|	Справочник.КонтурЛогистика_Сотрудники КАК КонтурЛогистика_Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК КонтурЛогистика_СервисФизическихЛиц
		|		ПО КонтурЛогистика_Сотрудники.Ссылка = КонтурЛогистика_СервисФизическихЛиц.Сотрудник
		|ГДЕ
		|	НЕ КонтурЛогистика_Сотрудники.ПометкаУдаления
		|	И КонтурЛогистика_Сотрудники.РольВодитель
		|	И КонтурЛогистика_СервисФизическихЛиц.Статус ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фамилия,
		|	Имя,
		|	Отчество";
	
	Если Отбор = "Все" Тогда
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_СервисФизическихЛиц.Статус ЕСТЬ NULL", "");
	ИначеЕсли Отбор = "НеПринятые" Тогда
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_СервисФизическихЛиц.Статус ЕСТЬ NULL", 
			"И КонтурЛогистика_СервисФизическихЛиц.Статус = &Статус");
		Запрос.УстановитьПараметр("Статус", Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение);
	ИначеЕсли Отбор = "ПринялиПриглашение" Тогда
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_СервисФизическихЛиц.Статус ЕСТЬ NULL", 
			"И КонтурЛогистика_СервисФизическихЛиц.Статус = &Статус");
		Запрос.УстановитьПараметр("Статус", Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение);
	ИначеЕсли Отбор = "СОшибкой" Тогда
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_СервисФизическихЛиц.Статус ЕСТЬ NULL", 
			"И КонтурЛогистика_СервисФизическихЛиц.ЕстьОшибка");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) И Отбор <> "НеДобавленные" Тогда
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_Сотрудники.РольВодитель", 
			"И КонтурЛогистика_Сотрудники.РольВодитель И КонтурЛогистика_СервисФизическихЛиц.Организация = &Организация ");
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = тз.Добавить();
		НоваяСтрока.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		НоваяСтрока.Телефон = ВыборкаДетальныеЗаписи.Телефон;
		НоваяСтрока.Организация = Организация;
		НоваяСтрока.Статус = ВыборкаДетальныеЗаписи.Статус;
		НоваяСтрока.PersonId = ВыборкаДетальныеЗаписи.PersonId;
		НоваяСтрока.UserId = ВыборкаДетальныеЗаписи.UserId;
		НоваяСтрока.InviteId = ВыборкаДетальныеЗаписи.InviteId;
		НоваяСтрока.IdentityDocumentId = ВыборкаДетальныеЗаписи.IdentityDocumentId;
		НоваяСтрока.ОписаниеОшибки = ВыборкаДетальныеЗаписи.ОписаниеОшибки;
		
		Предупреждения = Новый Массив;
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Фамилия) Тогда 
			Предупреждения.Добавить("фамилия");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Имя) Тогда 
			Предупреждения.Добавить("имя");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВУСерия) Тогда 
			Предупреждения.Добавить("серия ВУ");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВУНомер) Тогда 
			Предупреждения.Добавить("номер ВУ");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВУДатаВыдачи) Тогда 
			Предупреждения.Добавить("дата выдачи ВУ");
		КонецЕсли;
		
		Если Предупреждения.Количество() = 1 Тогда
			
			Если Предупреждения[0] = "имя" Тогда
				ПредупрежденияЗаголовок = "не заполнено";
			ИначеЕсли Предупреждения[0] = "номер ВУ" Тогда
				ПредупрежденияЗаголовок = "не заполнен";
			Иначе
				ПредупрежденияЗаголовок = "не заполнена";
			КонецЕсли;
			
			НоваяСтрока.ПредупрежденияСотрудника = ПредупрежденияЗаголовок + " " 
				+ КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(Предупреждения, ",");
				
		ИначеЕсли Предупреждения.Количество() > 1 Тогда
				
			НоваяСтрока.ПредупрежденияСотрудника = "не заполнены " 
				+ КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(Предупреждения, ", ");
				
		КонецЕсли;
						
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(тз, "Сотрудники");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораОрганизации(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ВыбранноеЗначение;
	
	ЗаполнитьТаблицуСотрудники();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьТаблицуСотрудники();
КонецПроцедуры

&НаСервере
Процедура ДобавитьВПротокол(ТекстСообщения)
	
	Протокол = Строка(ТекущаяДатаСеанса()) + " " + ТекстСообщения
		+ ?(Протокол = "", "", Символы.ПС) + Протокол;
	
КонецПроцедуры

#КонецОбласти