#Область ПрограммныйИнтерфейс

// Процедура - Ввести ЭТРН попробует ввести ТРН на этом основании
//
// Параметры:
//  Основание	 - Массив(ДокументСсылка) - Документ учетнйо системы на базе (или через связи которого) которого надо ввести ТРН
//  Параметры	 - Структура - Поля:
//		Форма -  где размещен обработчик оповещения (владелец, передайте саму форму)
//		ИмяОбработчикаОповещения - (не забудьте разместить экспортную клиентскую процедуру в форме с 2 параметрами)
//		ПараметрыОбработчика - произвольно - что хотите получить в своем обработчике
//		ИмяПродукта - вызывающего модуля ("EDI" / "Диадок" - строка)
//		Сущность - Ссылка на сущность вызывающего модуля (СправочникСсылка, ДокументСсылка, documentId - строка(если нет ссылки в базе)) 
Процедура ВвестиЭТРН(МассивОснований, Параметры) Экспорт
	
	ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1");
	
	ВвестиЭПДпоОснованиямEDI_ДД(МассивОснований, Параметры, ТипЛогистика);
	
КонецПроцедуры

// Процедура - Ввести ЗаказЗаявку попробует ввести ЗЗ на этом основании
//
// Параметры:
//  МассивОснований	 - Массив(ДокументСсылка) - Документ учетнйо системы на базе (или через связи которого) которого надо ввести ЗЗ
//  Параметры	 - Структура - Поля:
//		Форма -  где размещен обработчик оповещения (владелец, передайте саму форму)
//		ИмяОбработчикаОповещения - (не забудьте разместить экспортную клиентскую процедуру в форме с 2 параметрами)
//		ПараметрыОбработчика - произвольно - что хотите получить в своем обработчике
//		ИмяПродукта - вызывающего модуля ("EDI" / "Диадок" - строка)
//		Сущность - Ссылка на сущность вызывающего модуля (СправочникСсылка, ДокументСсылка, documentId - строка(если нет ссылки в базе)) 
Процедура ВвестиЗаказЗаявку(МассивОснований, Параметры) Экспорт
	
	ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1");
	
	ВвестиЭПДпоОснованиямEDI_ДД(МассивОснований, Параметры, ТипЛогистика);
	
КонецПроцедуры

// Процедура - Перевозочные нажатие - открывает форму связанных перевозочных документов
//
// Параметры:
//  Форма					 - из какой карточки вызываете - 
//  МассивИсходныхДокументов - массив исзодныйх документов учетной системы для работы 
//
Процедура ПеревозочныеНажатие(Форма, МассивИсходныхДокументов) Экспорт
	
	
	Если ПодсистемаНастроена() Тогда 
		
		Если Не УТекПользователяЕстьПраваКПодсистеме() Тогда
			
			ТекстПредупреждения = "Обратитесь к Администратору базы данных и попросите его добавить вам права к подсистеме ""Контур.Логистика""";
			КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения, "Требуется назначить права к подсистеме Контур.Логистика");
			Возврат;
			
		Иначе
		
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("МассивДокументовУчетнойСистемы", МассивИсходныхДокументов);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"ОбщаяФорма.КонтурЛогистика_СвязанныеЭПД",
				ПараметрыФормы,
				,
				Форма,
				"ОбработчикОповеститьОВыполненииКоманды"); // строго такое название обработчика в вашей форме!
				
		КонецЕсли;
		
	Иначе
		
		Если Не УТекПользователяЕстьПраваНастройкиПодсистемы() Тогда
			
			ТекстПредупреждения = "Подсистема Контур.Логистика не настроена и нет прав на настройку.
			|Попросите Администратора базы данных настроить её или дать вам права Администратора подсистемы";
			КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения, "Требуется настроить подсистему.");
			Возврат;
			
		Иначе
			
			ПараметрыОткрытияФормы = Новый Структура();
			ПараметрыОткрытияФормы.Вставить("НачальнаяСтраница", "ВводЛогинаПароля");
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма", 
			ПараметрыОткрытияФормы, 
			Форма,
			Форма, 
			"ОбработчикОповеститьОВыполненииКоманды"); // строго такое название обработчика в вашей форме!
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Открыть рабочий стол Модуля Логистика. 
//
//	Если он уже открыт, то активируем его. 
//	Если в нем отличается период то установим его и запустим обновление счетчиков.
//
// Параметры:
//  Период	 - СтандартныйПериод 
//
Процедура ОткрытьРабочийСтол(Период) Экспорт
	
	Если Не ПодсистемаНастроена() Тогда 
		
		Если Не УТекПользователяЕстьПраваНастройкиПодсистемы() Тогда 
			ТекстПредупреждения = "Подсистема Контур.Логистика не настроена и нет прав на настройку.
			|Попросите Администратора базы данных настроить её или дать вам права Администратора подсистемы";
			КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения, "Требуется настроить подсистему.");
			
			КонтурЛогистика_Метрика.ОбработатьОшибку("КонтурЛогистика_ИнтеграцияКонтурКлиент.ОткрытьРабочийСтол.ПодсистемаНеНастроенаИНетПрав", ТекстПредупреждения);
			
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не УТекПользователяЕстьПраваКПодсистеме() Тогда
		
		ТекстПредупреждения = "Обратитесь к Администратору базы данных и попросите его добавить вам права к подсистеме ""Контур.Логистика""";
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения, "Требуется назначить права к подсистеме Контур.Логистика");
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("КонтурЛогистика_ИнтеграцияКонтурКлиент.ОткрытьРабочийСтол.НетПрав", ТекстПредупреждения);
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Период) Тогда 
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.Последние7Дней);
	КонецЕсли;
	
	ОткрытыеОкна = ПолучитьОкна();
	
	Если ОткрытыеОкна <> Неопределено Тогда 
	
		Для Каждого текОкно Из ОткрытыеОкна Цикл 
			
			Если Лев(текОкно.Заголовок, 16) = "Контур.Логистика" Тогда
				
				Для Каждого Форма Из текОкно.Содержимое Цикл
					
					Если Форма.ИмяФормы = "Обработка.КонтурЛогистика_РабочийСтол.Форма.Форма" Тогда
						
						Если Форма.Период <> Период  Тогда 
							Форма.Период = Период;
							Форма.ОбновитьЗадачи();
						КонецЕсли;
						текОкно.Активизировать();
						Возврат;
						
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПараметрыРабочегоСтола = Новый Структура("Период", Период);
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Обработка.КонтурЛогистика_РабочийСтол.Форма.Форма",
		ПараметрыРабочегоСтола,,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

Функция ПодсистемаНастроена() Экспорт
	
	Возврат КонтурЛогистика_ИнтеграцияКонтурСервер.ПодсистемаНастроена();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УТекПользователяЕстьПраваКПодсистеме() Экспорт

	ЕстьПрава = КонтурЛогистика_ИнтеграцияКонтурСервер.УТекПользователяЕстьПраваКПодсистеме();
	Возврат ЕстьПрава;	

КонецФункции
Функция УТекПользователяЕстьПраваНастройкиПодсистемы() Экспорт

	ЕстьПрава = КонтурЛогистика_ИнтеграцияКонтурСервер.УТекПользователяЕстьПраваНастройкиПодсистемы();
	Возврат ЕстьПрава;	

КонецФункции

Процедура ВвестиЗаказЗаявкуПоОснованиямЭПД(МассивОснований, Параметры) Экспорт
	
	ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1");
	
	ВвестиЭПДпоОснованиямЭПД(МассивОснований, Параметры, ТипЛогистика);
	
КонецПроцедуры

Процедура ВвестиЭТРНПоОснованиямЭПД(МассивОснований, Параметры) Экспорт
	
	ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1");
	
	ВвестиЭПДпоОснованиямЭПД(МассивОснований, Параметры, ТипЛогистика);
	
КонецПроцедуры

Процедура ВвестиЭПДпоОснованиямEDI_ДД(МассивОснований, Параметры, ТипЛогистика) Экспорт

	МассивИстинныхОснованийЭПД = КонтурЛогистика_ИнтеграцияКонтурСервер.НайтиСоотвУчетныеДокументы(МассивОснований);
	ВвестиЭПДпоОснованиямЭПД(МассивИстинныхОснованийЭПД, Параметры, ТипЛогистика);

КонецПроцедуры

Процедура ВвестиЭПДпоОснованиямЭПД(МассивИстинныхОснованийЭПД, Параметры, ТипЛогистика) Экспорт
	
	Если МассивИстинныхОснованийЭПД.Количество() = 1 Тогда
		
		КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаПоДокументу1С(
			ТипЛогистика,
			МассивИстинныхОснованийЭПД[0],
			Параметры.Форма);

	Иначе
			
		КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументыПакетно(МассивИстинныхОснованийЭПД, Ложь, ТипЛогистика);
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Введено несколько документов-черновиков в соотвтетствии с настройками");
		
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти