&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

&НаКлиенте
Перем СтруктураДокумента1С Экспорт,
	СтруктураДокументаMS Экспорт,
	ТаблицаРеквизитовДополнительная Экспорт,
	пТабличныеЧасти Экспорт,
	пСвязиТабличныхЧастей Экспорт;	


&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("ТабличныеЧасти", 										_ЛокКонтекст.ЛокЯдро_ТаблицуЗначенийВМассивСтруктур(ПоместитьТЧВоВременноеХранилище("ТабличныеЧасти")));
	Результат.Вставить("СвязиТабличныхЧастей", 									_ЛокКонтекст.ЛокЯдро_ТаблицуЗначенийВМассивСтруктур(ПоместитьТЧВоВременноеХранилище("СвязиТабличныхЧастей")));
	Результат.Вставить("Обработчик_ПослеОбъединенияСтрокиТабличнойЧасти",  		Обработчик_ПослеОбъединенияСтрокиТабличнойЧасти);
	Результат.Вставить("Обработчик_ПослеОбъединенияТабличнойЧасти",        		Обработчик_ПослеОбъединенияТабличнойЧасти);
	Результат.Вставить("ВидОбработчика_ПослеОбъединенияСтрокиТабличнойЧасти",  	ВидОбработчика_ПослеОбъединенияСтрокиТабличнойЧасти);
	Результат.Вставить("ВидОбработчика_ПослеОбъединенияТабличнойЧасти",        	ВидОбработчика_ПослеОбъединенияТабличнойЧасти);

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если НЕ ОписаниеОповещенияОЗакрытии = Неопределено Тогда	
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии,Результат);
		КонецЕсли;
	#КонецЕсли
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если пТабличныеЧасти <> Неопределено Тогда
		
		Для Каждого ЭлементМассива Из пТабличныеЧасти Цикл
			Если ЭлементМассива.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ТабличныеЧасти.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ЭлементМассива);
			НоваяСтрока.ТабличнаяЧастьДокумента1ССтрокой = _ЛокКонтекст.ЛокЯдро_ЗначениеВСтрокуXML(ЭлементМассива.ТабличнаяЧастьДокумента1С);
			
			НоваяСтрока.ТабличнаяЧастьЕстьВМетаданных = ?(Лев(НоваяСтрока.НастройкаТЧСтрокой, 1) = "(", Ложь, СтруктураДокумента1С.ТабличныеЧасти.Свойство(НоваяСтрока.НастройкаТЧСтрокой));
			Если ЭлементМассива.Свойство("ВыгружатьСтрокиПоУсловиюФлаг") И ЭлементМассива.ВыгружатьСтрокиПоУсловиюФлаг = Истина Тогда
				НоваяСтрока.ВыгружатьСтрокиПоУсловию = "Включено";
			Иначе
				НоваяСтрока.ВыгружатьСтрокиПоУсловию = "Выключено";
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если пСвязиТабличныхЧастей <> Неопределено Тогда
		
		Для Каждого ЭлементМассива Из пСвязиТабличныхЧастей Цикл
			Если ЭлементМассива.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = СвязиТабличныхЧастей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ЭлементМассива);
			НоваяСтрока.УсловиеСравнения = "=";
		КонецЦикла;
		
	КонецЕсли;
	
	// Список вариантов обработчиков загрузки
	СписокВариантовОбработчиков.Добавить(0, "Без обработчика");
	СписокВариантовОбработчиков.Добавить(1, "Обработчик по умолчанию");
	СписокВариантовОбработчиков.Добавить(2, "Свой обработчик");
	СписокВариантовОбработчиков.Добавить(3, "Произвольный код");

	
	СписокТабличныхЧастей1С = ПолучитьСписокТабличныхЧастей1С();
	СписокТабличныхЧастейMS = ПолучитьСписокТабличныхЧастейMS();
	
	ЗаполнитьСписокВыбора(Элементы.ТабличныеЧастиТабличнаяЧастьДокументаMS,СписокТабличныхЧастейMS); 		
	ЗаполнитьСписокВыбора(Элементы.ТабличныеЧастиНастройкаТЧСтрокой,СписокТабличныхЧастей1С);
	
	ЗаполнитьСписокВыбора(Элементы.СвязиТабличныхЧастейГлавнаяТаблица,СписокТабличныхЧастей1С); 	
	ЗаполнитьСписокВыбора(Элементы.СвязиТабличныхЧастейПодчиненнаяТаблица,СписокТабличныхЧастей1С); 		
	ЗаполнитьСписокВыбора(Элементы.СвязиТабличныхЧастейТабличнаяЧастьДокументаMS,СписокТабличныхЧастейMS);
	
	ЗаполнитьСписокВыбора(Элементы.ВидОбработчика_ПослеОбъединенияТабличнойЧасти, СписокВариантовОбработчиков);
	ЗаполнитьСписокВыбора(Элементы.ВидОбработчика_ПослеОбъединенияСтрокиТабличнойЧасти, СписокВариантовОбработчиков);
	
	МассивИменРеквизитов = Новый Массив;
	МассивИменРеквизитов.Добавить("Обработчик_ПослеОбъединенияТабличнойЧасти");
	МассивИменРеквизитов.Добавить("Обработчик_ПослеОбъединенияСтрокиТабличнойЧасти");
	
	ОбработкаЗаполненныхОбработчиковВыгрузки(МассивИменРеквизитов);

	ЗаполнениеСоответствияВидовОбработчиковВыгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбработчика_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИмяЭлементаОбработки = Элемент.Имя;
	Обработчик_ИзменитьЗначение = ЭтаФорма[ИмяЭлементаОбработки] <> ВыбранноеЗначение;		
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбработчика_ОбработкаПриИзменении(Элемент)
	
	ИмяЭлементаОбработки	= Элемент.Имя;
	СтруктураОбработчика	= СтруктураВидовОбработчиков[ИмяЭлементаОбработки];
	ИмяОбработчика			= СтруктураОбработчика.Тип; 
	СтрокаОбработчика		= СтруктураОбработчика.Обработчик;
	
	Элементы[СтрокаОбработчика].СписокВыбора.Очистить();
	
	БезЗаполнения	= ЭтаФорма[ИмяЭлементаОбработки] = 0;
	ПоУмолчанию		= ЭтаФорма[ИмяЭлементаОбработки] = 1;
	СвойОбработчик	= ЭтаФорма[ИмяЭлементаОбработки] = 2;	
	ПроизвольныйКод	= ЭтаФорма[ИмяЭлементаОбработки] = 3;
	
	Если ПоУмолчанию Тогда 		
		
		// Формируем стандартное имя процедуры
		ТипОбработчика = СтрЗаменить(ИмяОбработчика, "ТабличнойЧасти", "ТЧ");
		ЭтаФорма[СтрокаОбработчика] = _ЛокКонтекст.ЛокЯдро_ПолучитьУниверсальноеИмяОбработчика(ТипОбработчика, ТипДокумента1С);
		
	ИначеЕсли СвойОбработчик Тогда
		
		// Оставляем пустое строковое поле для ручного ввода имени процедуры, если вид обработчика изменился
		Если Обработчик_ИзменитьЗначение Тогда
			ЭтаФорма[СтрокаОбработчика] = "";	
		КонецЕсли;
		
	ИначеЕсли ПроизвольныйКод Тогда
		
		// Очищаем строку обработчика и предоставляем возможность выбора из списка подходящих кодов, если вид обработчика изменился
		Если Обработчик_ИзменитьЗначение Тогда
			ЭтаФорма[СтрокаОбработчика] = "";	
			
			// В обычных формах подменяем поле ввода обработчика на поле выбора, т.к. иначе не выводится представление выбранного значения
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Элементы[СтрокаОбработчика].Видимость = Ложь;
				Элементы[СтрокаОбработчика + "Выбор"].Видимость = Истина;
				Элементы[СтрокаОбработчика + "Выбор"].СписокВыбора.Очистить();
				Элементы[СтрокаОбработчика + "Выбор"].ВыделенныйТекст = "";
			#КонецЕсли
			
			Элементы[СтрокаОбработчика].ВыделенныйТекст = "";					
		Иначе
			ТекЗначение = СписокПроизвольныхКодовОбработчиков.НайтиПоЗначению(ЭтаФорма[СтрокаОбработчика]);
			Если ТекЗначение <> Неопределено Тогда
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					Элементы[СтрокаОбработчика + "Выбор"].СписокВыбора.Добавить(ТекЗначение.Значение, ТекЗначение.Представление);
				#Иначе
					Элементы[СтрокаОбработчика].СписокВыбора.Добавить(ТекЗначение.Значение, ТекЗначение.Представление);
				#КонецЕсли
			КонецЕсли;                                                                                             			
		КонецЕсли;					
		
	ИначеЕсли БезЗаполнения Тогда
		
		ЭтаФорма[СтрокаОбработчика] = "";	
		
	КонецЕсли;
	
	ЭлементСтрокиОбработчика = Элементы[СтрокаОбработчика];
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		// Возвращаем видимость поля ввода обработчика, если выбран не произвольный код
		Если Не ПроизвольныйКод Тогда
			Элементы[СтрокаОбработчика].Видимость = Истина;
			Элементы[СтрокаОбработчика + "Выбор"].Видимость = Ложь;							
		Иначе
			ЭлементСтрокиОбработчика = Элементы[СтрокаОбработчика + "Выбор"];		
		КонецЕсли;                                                                                                                             		    		
	#КонецЕсли
	
	УстановкаОформленияСтрокиОбработчикаВыгрузки(ЭлементСтрокиОбработчика, ЭтаФорма[СтрокаОбработчика], ЭтаФорма[ИмяЭлементаОбработки]);
	
	Если Обработчик_ИзменитьЗначение Тогда
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ОбработкаНачалоВыбораОбработчикаВыгрузки(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяЭлементаОбработки	= Элемент.Имя;
	// В обычных формах заменяем имя поля выбора произвольного кода на имя поля ввода обработчика
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ИмяЭлементаОбработки = СтрЗаменить(ИмяЭлементаОбработки, "Выбор", "");
	#КонецЕсли      
	ИмяОбработчика 			= СтрЗаменить(ИмяЭлементаОбработки, "Обработчик_", "");
	СтрокаВидаОбработчика	= "ВидОбработчика_" + ИмяОбработчика;
		
	Если ЭтаФорма[СтрокаВидаОбработчика] = 3 Тогда
	
		ПредыдущееЗначение 		= ЭтаФорма[ИмяЭлементаОбработки];		
		СтандартнаяОбработка 	= Ложь;
		
		Обработчик_ОткрытиеФормыПроизвольногоКода(ИмяЭлементаОбработки, "ФормаСписка_ПроизвольныеКоды", ПредыдущееЗначение); 
				
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ОбработкаОткрытиеОбработчикаВыгрузки(Элемент, СтандартнаяОбработка)
		
	ИмяЭлементаОбработки	= Элемент.Имя;
	// В обычных формах заменяем имя поля выбора произвольного кода на имя поля ввода обработчика
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ИмяЭлементаОбработки = СтрЗаменить(ИмяЭлементаОбработки, "Выбор", "");
	#КонецЕсли      
	ИмяОбработчика 			= СтрЗаменить(ИмяЭлементаОбработки, "Обработчик_", "");
	СтрокаВидаОбработчика	= "ВидОбработчика_" + ИмяОбработчика;
	
	Если ЭтаФорма[СтрокаВидаОбработчика] = 3 Тогда
				
		СтандартнаяОбработка 	= Ложь;
		Если ПустаяСтрока(ЭтаФорма[ИмяЭлементаОбработки]) Тогда
			Возврат;
		КонецЕсли;
		
		Обработчик_ОткрытиеФормыПроизвольногоКода(ИмяЭлементаОбработки, "ФормаНастройки_ПроизвольныйКод", ЭтаФорма[ИмяЭлементаОбработки], Истина); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ОткрытиеФормыПроизвольногоКода(ИмяЭлементаОбработки, ИмяФормыПК, ТекущееЗначение, ЭтоФормаЭлемента = Ложь) 
	
	ЭтоОбработчикЗаполнения = Ложь;
	ДопКлючНастройки 		= "";
	ДопТипОбработки			= "";
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Форма_ПроизвольныеКоды = ПолучитьФорму("ОФ_" + ИмяФормыПК, ЭтаФорма);
	#Иначе
		Форма_ПроизвольныеКоды = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма." + ИмяФормыПК, , ЭтаФорма, ЭтаФорма);
		Форма_ПроизвольныеКоды.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	#КонецЕсли
	
	Форма_ПроизвольныеКоды._ЛокКонтекст 			= _ЛокКонтекст;
	ДопКлючНастройки								= ПолучитьКлючНастройкиОбработчикаВыгрузки(ИмяЭлементаОбработки);
	ДопТипОбработки									= СтрЗаменить(ДопКлючНастройки, "Выгрузка_", "");
	
	Форма_ПроизвольныеКоды.КлючНастройки 			= ДопКлючНастройки;			
	
	Форма_ПроизвольныеКоды.ТипИсходногоДокумента1С 	= ТипДокумента1С;
	Форма_ПроизвольныеКоды.ИмяТабличнойЧасти1С 		= ИмяТабличнойЧасти1С;
	
	//АдресТаблицыРеквизитов = ПолучитьАдресТаблицыРеквизитов();
	
	//Если КлючНастройки = "Выгрузка_ШапкаДокумента" Тогда
	//	Форма_ПроизвольныеКоды.ПравилаОбменаШапка 			= _ЛокКонтекст.ЛокЯдро_ТаблицуЗначенийВМассивСтруктур(АдресТаблицыРеквизитов);
	//	Форма_ПроизвольныеКоды.ПравилаОбменаТабличнаяЧасть 	= ТаблицаРеквизитовДополнительная;
	//ИначеЕсли КлючНастройки = "Выгрузка_ТабличнаяЧастьДокумента" Тогда
	//	Форма_ПроизвольныеКоды.ПравилаОбменаШапка 			= ТаблицаРеквизитовДополнительная;
	//	Форма_ПроизвольныеКоды.ПравилаОбменаТабличнаяЧасть 	= _ЛокКонтекст.ЛокЯдро_ТаблицуЗначенийВМассивСтруктур(АдресТаблицыРеквизитов);
	//КонецЕслИ;
	
	Если ЭтоФормаЭлемента Тогда
		Форма_ПроизвольныеКоды.ЭтоНоваяНастройка	= Ложь;				
		
		ТаблицаПроизвольныхКодов	= _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ПроизвольныеКоды", Истина);
		ДанныеПроизвольногоКода 	= _ЛокКонтекст.ЛокЯдро_НайтиСтруктуруВМассивеПоЭлементу(ТаблицаПроизвольныхКодов, "ID_ПроизвольногоКода", ТекущееЗначение);
		
		ЗаполнитьЗначенияСвойств(Форма_ПроизвольныеКоды, ДанныеПроизвольногоКода);
	КонецЕсли; 
	
	ДопПараметрыОповещения = Новый Структура("ПредыдущееЗначение, СтрокаОбработчика, ДопТипОбработки", 
		ТекущееЗначение, 
		ИмяЭлементаОбработки, 
		ДопТипОбработки);
	
	ОП = Новый ОписаниеОповещения("ФормаСписка_ПроизвольныеКодыОбработчиковЗакрытие", ЭтаФорма, ДопПараметрыОповещения);
	Форма_ПроизвольныеКоды.ОписаниеОповещенияОЗакрытии = ОП;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Форма_ПроизвольныеКоды.ОткрытьМодально();
	#Иначе
		Форма_ПроизвольныеКоды.Открыть();		
	#КонецЕсли 	

КонецПроцедуры

&НаКлиенте
Процедура ФормаСписка_ПроизвольныеКодыОбработчиковЗакрытие(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	ОбновитьСписокПроизвольныхКодов(ДопПараметры.ДопТипОбработки);
	// В обычных формах заменяем имя поля выбора произвольного кода на имя поля ввода обработчика
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ИмяПоляОбработчикаСобытия = ДопПараметры.СтрокаОбработчика + "Выбор";
	#Иначе
		ИмяПоляОбработчикаСобытия = ДопПараметры.СтрокаОбработчика;
	#КонецЕсли      	
	ИмяОбработчикаСобытия = ДопПараметры.СтрокаОбработчика;
	
	Элементы[ИмяПоляОбработчикаСобытия].СписокВыбора.Очистить();
	
	ЗаполнитьСписокВыбора(Элементы[ИмяПоляОбработчикаСобытия], СписокПроизвольныхКодовОбработчиков);	
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		НайденныйЭлементСписка = СписокПроизвольныхКодовОбработчиков.НайтиПоЗначению(ДопПараметры.ПредыдущееЗначение);		
	Иначе 
		НайденныйЭлементСписка = СписокПроизвольныхКодовОбработчиков.НайтиПоЗначению(ВыбранноеЗначение);		
	КонецЕсли;
	
	Если НайденныйЭлементСписка = Неопределено Тогда
		ЭтаФорма[ИмяОбработчикаСобытия] = Неопределено;		
	ИначеЕсли Элементы[ИмяПоляОбработчикаСобытия].СписокВыбора.НайтиПоЗначению(НайденныйЭлементСписка.Значение) = Неопределено Тогда
		ЭтаФорма[ИмяОбработчикаСобытия] = Неопределено;
	Иначе
		ЭтаФорма[ИмяОбработчикаСобытия] = НайденныйЭлементСписка.Значение;
	КонецЕсли;	
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьСписокТабличныхЧастей1С()
	
	СписокТЧ = Новый СписокЗначений;
	Для Каждого ЭлементТЧ Из СтруктураДокумента1С.ТабличныеЧасти Цикл
		СписокТЧ.Добавить(ЭлементТЧ.Значение.Имя, ЭлементТЧ.Значение.Синоним);
	КонецЦикла;
	Если СписокТЧ.НайтиПоЗначению("(Запрос)") = Неопределено Тогда
		СписокТЧ.Добавить("(Запрос)", "(Запрос)");
	КонецЕсли;
	
	СписокДополнительныхОбработчиков = _ЛокКонтекст.ЛокЯдро_ПолучитьСписокДополнительныхОбработчиковПолученияТЧ(ТипДокумента1С);
	Если СписокДополнительныхОбработчиков <> Неопределено Тогда
		Для Каждого КлючЗначение Из СписокДополнительныхОбработчиков Цикл
			Синоним = ?(КлючЗначение.Значение.Свойство("Синоним"),КлючЗначение.Значение.Синоним,КлючЗначение.Ключ);
			СписокТЧ.Добавить(КлючЗначение.Ключ,Синоним);	
		КонецЦикла;
	КонецЕсли;

	
	СписокТЧ.СортироватьПоПредставлению();
	
	Возврат СписокТЧ;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокТабличныхЧастейMS()
	
	СписокТЧ = Новый СписокЗначений;
	
	СписокТЧ.Добавить("СтрокиФакт");
	СписокТЧ.Добавить("СтрокиПлан");
	СписокТЧ.Добавить("СерииПлан");
	СписокТЧ.Добавить("СерииФакт");
	СписокТЧ.Добавить("СерийныеНомераПлан");
	СписокТЧ.Добавить("СерийныеНомераФакт");
		
	СписокДопТаблиц = _ЛокКонтекст.СтруктураМетаданных.ДокументыMS[ТипДокументаMS].ДополнительныеТаблицы;
	
	Для Каждого ДопТаблица Из СписокДопТаблиц Цикл		
		СписокТЧ.Добавить(ДопТаблица.Представление);		
	КонецЦикла;	
	
	Возврат СписокТЧ;
	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьСписокВыбора(Элемент, Список)
	
	Приемник = Элемент.СписокВыбора;
	Для Каждого Элем Из Список Цикл
		Приемник.Добавить(Элем.Значение, Элем.Представление);	
	КонецЦикла;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если Не ТипЗнч(Элемент) = Тип("ПолеВыбора") Тогда
			Элемент.РежимВыбораИзСписка = Истина;
			Элемент.КнопкаСпискаВыбора 	= Истина;
		КонецЕсли;		
	#Иначе
		Элемент.РежимВыбораИзСписка 	= Истина;
		Элемент.КнопкаВыпадающегоСписка = Истина;		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныеЧастиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
		
	НоваяСтрока = ТабличныеЧасти.Добавить();	
	НоваяСтрока.ТабличнаяЧастьДокументаMS = ТабличнаяЧастьДокументаMS;	
	
	НоваяСтрока.Настроить 					  = "Настроить";
	НоваяСтрока.ТабличнаяЧастьЕстьВМетаданных = Ложь;
	НоваяСтрока.ВыгружатьСтрокиПоУсловию 	  = "Выключено";
	
	Если Копирование Тогда
		ТекущаяСтрока = Элементы.ТабличныеЧасти.ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока, , "ТабличнаяЧастьДокументаMS, ТабличнаяЧастьДокумента1ССтрокой");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоваяСтрока.ТабличнаяЧастьДокумента1ССтрокой) Тогда
		ТабличнаяЧастьДокумента1С = _ЛокКонтекст.ЛокЯдро_ЗначениеИзСтрокиXML(НоваяСтрока.ТабличнаяЧастьДокумента1ССтрокой);
		НоваяСтрока.Настроить = ?(НоваяСтрока.ТабличнаяЧастьДокумента1С.Количество(), "Настроено", "Настроить");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныеЧастиНастройкаТЧСтрокойПриИзменении(Элемент)
		
	ТекущаяСтрока = Элементы.ТабличныеЧасти.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.ТабличнаяЧастьЕстьВМетаданных = ?(Лев(ТекущаяСтрока.НастройкаТЧСтрокой, 1) = "(", Ложь, СтруктураДокумента1С.ТабличныеЧасти.Свойство(ТекущаяСтрока.НастройкаТЧСтрокой));
	ТекущаяСтрока.ВыгружатьСтрокиПоУсловию		  = "Выключено";
	ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюФлаг 	  = Ложь;
	ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюСтрокой = "";	
		
КонецПроцедуры

&НаКлиенте
Процедура ФормаНастройки_ПравилаВыгрузкиПолейЗакрытие(РезультатРедактирования,ТекущаяСтрока) Экспорт
	
	Если РезультатРедактирования <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, РезультатРедактирования);
		ТекущаяСтрока.ТабличнаяЧастьДокумента1ССтрокой 	= _ЛокКонтекст.ЛокЯдро_ЗначениеВСтрокуXML(РезультатРедактирования.ТаблицаНастроек);		
		ТекущаяСтрока.Настроить							= "Настроено";
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаНастройки_УсловияВыгрузкиСтрокТЧЗакрытие(РезультатРедактирования, СтруктураПараметров) Экспорт
	
	Если РезультатРедактирования <> Неопределено Тогда
		ТекущаяСтрока 								  = СтруктураПараметров.ТекущаяСтрока;
		ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюФлаг 	  = РезультатРедактирования.УдалятьСтрокиПоУсловиюФлаг;
		ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюСтрокой = РезультатРедактирования.УдалятьСтрокиПоУсловиюСтрокой;
		
		Если РезультатРедактирования.УдалятьСтрокиПоУсловиюФлаг = Истина Тогда
			ТекущаяСтрока.ВыгружатьСтрокиПоУсловию = "Включено";
		Иначе
			ТекущаяСтрока.ВыгружатьСтрокиПоУсловию = "Выключено";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныеЧастиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		КолонкаИмя = Элемент.ТекущаяКолонка.Имя;
	#Иначе
		КолонкаИмя = Элемент.ТекущийЭлемент.Имя;	
	#КонецЕсли
	
	ИмяКолонкиНастройкаПолей  = ВРег(СокрЛП("ТабличныеЧастиНастроить"));
	ИмяКолонкиУсловияВыгрузки = ВРег(СокрЛП("ТабличныеЧастиВыгружатьСтрокиПоУсловию"));
	
	Если ВРег(СокрЛП(КолонкаИмя)) <> ИмяКолонкиНастройкаПолей
		И ВРег(СокрЛП(КолонкаИмя)) <> ИмяКолонкиУсловияВыгрузки Тогда		
		Возврат;			
	КонецЕсли; 
	
	ТекущаяСтрока = Элементы.ТабличныеЧасти.ТекущиеДанные;
	
	Если ВРег(СокрЛП(КолонкаИмя)) = ИмяКолонкиУсловияВыгрузки Тогда
		Если НЕ ТекущаяСтрока.ТабличнаяЧастьЕстьВМетаданных Тогда
			ТекстПредупреждения = НСтр("be = 'Наладка даступна толькі для таблічных частак з метададзеных канфігурацыі 1С'; en = 'Configuration is only available for table parts from the metadata of 1C configuration'; es = 'La configuración solo está disponible para partes tabulares de los metadatos de la configuración de 1C'; ka = 'დაყენება ხდება მხოლოდ 1C-ის კონფიგურაციის ცხრილის ნაწილებისთვის'; kk = 'Табелді бөліктердің метадеректерінен 1С конфигурациясына тек қосылу мүмкін'; ro = 'Configurarea este disponibilă doar pentru părțile tabelei din metadatele configurației 1C'; ru = 'Настройка доступна только для табличных частей из метаданных конфигурации 1С'; tr = 'Yapılandırma, 1C yapılandırma verilerinden sadece tablo bölümleri için kullanılabilir'; uk = 'Налаштування доступна лише для табличних частин з метаданих конфігурації 1С'; uz = 'Sozlash faqat 1С konfiguratsiyasining metadatalaridan jadval qismlari uchun mavjud'");
			ПоказатьПредупреждение(, ТекстПредупреждения); 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.НастройкаТЧСтрокой) Тогда
		ТекстПредупреждения = НСтр("be = 'Не абрана таблічная частка дакумента 1С'; en = 'No table part of 1C document selected'; es = 'No se ha seleccionado la parte de tabla del documento 1C'; ka = 'არ არის არჩეული 1C-ის ცხრილის ნაწილი'; kk = '1С документінің кестелі бөлімі таңдалмады'; ro = 'Nu a fost selectată partea tabulară a documentului 1C'; ru = 'Не выбрана табличная часть документа 1С'; tr = '1C belgesinin tablo kısmı seçilmedi'; uk = 'Не обрана таблична частина документа 1С'; uz = '1C hujjati jadvallar qismi tanlanmagan'");
		ПоказатьПредупреждение(, ТекстПредупреждения); 
		Возврат;
	КонецЕсли; 
	
	Если ВРег(СокрЛП(КолонкаИмя)) = ИмяКолонкиУсловияВыгрузки Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ = ПолучитьФорму("ОФ_ФормаНастройки_УсловияУдаленияСтрокТЧ", ЭтаФорма);
		#Иначе
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаНастройки_УсловияУдаленияСтрокТЧ",, ЭтаФорма, ЭтаФорма);
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		#КонецЕсли
		
		ФормаНастройки_УсловияВыгрузкиСтрокТЧ._ЛокКонтекст 		  = _ЛокКонтекст;
		ФормаНастройки_УсловияВыгрузкиСтрокТЧ.ТипДокумента1С 	  = ТипДокумента1С;
		ФормаНастройки_УсловияВыгрузкиСтрокТЧ.ИмяТабличнойЧасти1С = ТекущаяСтрока.НастройкаТЧСтрокой;
				
		ФормаНастройки_УсловияВыгрузкиСтрокТЧ.КомпоновщикНастроекСтрокой = ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюСтрокой;
		ФормаНастройки_УсловияВыгрузкиСтрокТЧ.УдалятьСтрокиПоУсловиюФлаг = ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюФлаг;
		
		ОП = Новый ОписаниеОповещения("ФормаНастройки_УсловияВыгрузкиСтрокТЧЗакрытие", ЭтаФорма, Новый Структура("ТекущаяСтрока", ТекущаяСтрока));
		ФормаНастройки_УсловияВыгрузкиСтрокТЧ.ОписаниеОповещенияОЗакрытии = ОП;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.Заголовок = 
				НСтр("be = 'Cleverence: Налада ўмовы выгрузкі радкоў'; en = 'Cleverence: Setting up conditions for unloading rows'; es = 'Cleverence: Configuración de condiciones de descarga de filas'; ka = 'Cleverence: სტრიქონების გამოტანის პარამეტრები'; kk = 'Cleverence: Строкаларды шығару мәртебесін орнату'; ro = 'Cleverence: Configurarea condițiilor de descărcare a rândurilor'; ru = 'Клеверенс: Настройка условия выгрузки строк'; tr = 'Cleverence: Satır dışa aktarımı koşulları ayarları'; uk = 'Cleverence: Налаштування умов вивантаження рядків'; uz = 'Cleverence: Qatorlarni yuklash shartlarini sozlash'");
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.ЭлементыФормы.ТекстПодсказки.Заголовок = 
				НСтр("be = 'Наладзіце ўмову выгрузкі радкоў таблічнай часткі. Будуць выгружаны толькі тыя радкі, якія задавальняюць зададзенай ўмове'; en = 'Configure the condition for unloading rows of the table part. Only rows that meet the specified condition will be unloaded'; es = 'Configure la condición para descargar filas de la parte de tabla. Solo se descargarán las filas que cumplan con la condición especificada'; ka = 'დაარეგულეთ სტრიქონების გამოტანის პირობა. გამოტანილი იქნება მხოლოდ ის სტრიქონები, რომლებიც აკმაყოფილებენ დაცნობილ პირობას'; kk = 'Кестелі бөлімнің жолдарын шығару шартын теңшеңіз. Белгіленген шартқа сай болатын тек жолдар шығарылады'; ro = 'Configurați condiția de descărcare a liniilor părții tabulare. Vor fi descărcate doar liniile care îndeplinesc condiția specificată'; ru = 'Настройте условие выгрузки строк табличной части. Будут выгружены только те строки, которые удовлетворяют заданному условию'; tr = 'Tablo kısmı satırlarının indirilme koşulunu ayarlayın. Belirtilen koşulu sağlayan satırlar yalnızca indirilecektir'; uk = 'Налаштуйте умову вивантаження рядків табличної частини. Будуть вивантажені тільки ті рядки, які задовольняють заданій умові'; uz = 'Jadvallar qatori qatorlarini yuklash sharti sozlang. Faqat berilgan shartni qondiradigan qatorlar yuklanadi'");	
				
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.ОткрытьМодально();
		#Иначе
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.Заголовок = 
				НСтр("be = 'Cleverence: Налада ўмовы выгрузкі радкоў'; en = 'Cleverence: Setting up conditions for unloading rows'; es = 'Cleverence: Configuración de condiciones de descarga de filas'; ka = 'Cleverence: სტრიქონების გამოტანის პარამეტრები'; kk = 'Cleverence: Строкаларды шығару мәртебесін орнату'; ro = 'Cleverence: Configurarea condițiilor de descărcare a rândurilor'; ru = 'Клеверенс: Настройка условия выгрузки строк'; tr = 'Cleverence: Satır dışa aktarımı koşulları ayarları'; uk = 'Cleverence: Налаштування умов вивантаження рядків'; uz = 'Cleverence: Qatorlarni yuklash shartlarini sozlash'");
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.Элементы.ТекстПодсказки.Заголовок = 
				НСтр("be = 'Наладзіце ўмову выгрузкі радкоў таблічнай часткі. Будуць выгружаны толькі тыя радкі, якія задавальняюць зададзенай ўмове'; en = 'Configure the condition for unloading rows of the table part. Only rows that meet the specified condition will be unloaded'; es = 'Configure la condición para descargar filas de la parte de tabla. Solo se descargarán las filas que cumplan con la condición especificada'; ka = 'დაარეგულეთ სტრიქონების გამოტანის პირობა. გამოტანილი იქნება მხოლოდ ის სტრიქონები, რომლებიც აკმაყოფილებენ დაცნობილ პირობას'; kk = 'Кестелі бөлімнің жолдарын шығару шартын теңшеңіз. Белгіленген шартқа сай болатын тек жолдар шығарылады'; ro = 'Configurați condiția de descărcare a liniilor părții tabulare. Vor fi descărcate doar liniile care îndeplinesc condiția specificată'; ru = 'Настройте условие выгрузки строк табличной части. Будут выгружены только те строки, которые удовлетворяют заданному условию'; tr = 'Tablo kısmı satırlarının indirilme koşulunu ayarlayın. Belirtilen koşulu sağlayan satırlar yalnızca indirilecektir'; uk = 'Налаштуйте умову вивантаження рядків табличної частини. Будуть вивантажені тільки ті рядки, які задовольняють заданій умові'; uz = 'Jadvallar qatori qatorlarini yuklash sharti sozlang. Faqat berilgan shartni qondiradigan qatorlar yuklanadi'");	
			
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.Открыть();
		#КонецЕсли
	
	Иначе
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаНастройки_ПравилаВыгрузкиПолей = ПолучитьФорму("ОФ_ФормаНастройки_ПравилаВыгрузкиПолей",ЭтаФорма);
		#Иначе
			ФормаНастройки_ПравилаВыгрузкиПолей = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаНастройки_ПравилаВыгрузкиПолей", , ЭтаФорма, ЭтаФорма);
			ФормаНастройки_ПравилаВыгрузкиПолей.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		#КонецЕсли
		
		ФормаНастройки_ПравилаВыгрузкиПолей._ЛокКонтекст = _ЛокКонтекст;
		ФормаНастройки_ПравилаВыгрузкиПолей.КлючНастройки = "Выгрузка_ТабличнаяЧастьДокумента";
		ФормаНастройки_ПравилаВыгрузкиПолей.ТипДокумента1С = ТипДокумента1С;
		ФормаНастройки_ПравилаВыгрузкиПолей.ТипДокументаMS = ТипДокументаMS;
		ФормаНастройки_ПравилаВыгрузкиПолей.ИмяТабличнойЧастиMS = ТабличнаяЧастьДокументаMS;
		ФормаНастройки_ПравилаВыгрузкиПолей.ИмяТабличнойЧасти1С = ТекущаяСтрока.НастройкаТЧСтрокой;
		ФормаНастройки_ПравилаВыгрузкиПолей.ТекстЗапросаВыгрузкиНаТСД        = ТекущаяСтрока.ТекстЗапросаВыгрузкиНаТСД;
		ФормаНастройки_ПравилаВыгрузкиПолей.ТекстКодаПолучениеПараметров     = ТекущаяСтрока.ТекстКодаПолучениеПараметров;
		
		ФормаНастройки_ПравилаВыгрузкиПолей.ВидОбработчика_ПередВыгрузкойСтрокиТабличнойЧасти 	= ТекущаяСтрока.ВидОбработчика_ПередВыгрузкойСтрокиТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.ВидОбработчика_ПередВыгрузкойТабличнойЧасти 		= ТекущаяСтрока.ВидОбработчика_ПередВыгрузкойТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.ВидОбработчика_ПослеВыгрузкиСтрокиТабличнойЧасти 	= ТекущаяСтрока.ВидОбработчика_ПослеВыгрузкиСтрокиТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.ВидОбработчика_ПослеВыгрузкиТабличнойЧасти 			= ТекущаяСтрока.ВидОбработчика_ПослеВыгрузкиТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.Обработчик_ПередВыгрузкойТабличнойЧасти 			= ТекущаяСтрока.Обработчик_ПередВыгрузкойТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.Обработчик_ПередВыгрузкойСтрокиТабличнойЧасти 		= ТекущаяСтрока.Обработчик_ПередВыгрузкойСтрокиТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.Обработчик_ПослеВыгрузкиСтрокиТабличнойЧасти		= ТекущаяСтрока.Обработчик_ПослеВыгрузкиСтрокиТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.Обработчик_ПослеВыгрузкиТабличнойЧасти 				= ТекущаяСтрока.Обработчик_ПослеВыгрузкиТабличнойЧасти;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ТабличнаяЧастьДокумента1ССтрокой) Тогда
			ФормаНастройки_ПравилаВыгрузкиПолей.ТаблицаРеквизитовИсходная	= _ЛокКонтекст.ЛокЯдро_ЗначениеИзСтрокиXML(ТекущаяСтрока.ТабличнаяЧастьДокумента1ССтрокой);
		КонецЕсли;	
		
		ФормаНастройки_ПравилаВыгрузкиПолей.ТаблицаРеквизитовДополнительная  = ТаблицаРеквизитовДополнительная;	
		ОП = Новый ОписаниеОповещения("ФормаНастройки_ПравилаВыгрузкиПолейЗакрытие",ЭтаФорма,ТекущаяСтрока);
		ФормаНастройки_ПравилаВыгрузкиПолей.ОписаниеОповещенияОЗакрытии = ОП;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаНастройки_ПравилаВыгрузкиПолей.ОткрытьМодально();	
		#Иначе
			ФормаНастройки_ПравилаВыгрузкиПолей.Открыть();
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязиТабличныхЧастейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
		
	НоваяСтрока = СвязиТабличныхЧастей.Добавить();	
	НоваяСтрока.ТабличнаяЧастьДокументаMS = ТабличнаяЧастьДокументаMS;	
	НоваяСтрока.УсловиеСравнения = "=";
	Если Копирование Тогда
		
		ТекущаяСтрока = Элементы.СвязиТабличныхЧастей.ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПолеПодчиненнойТаблицы()
	ТекущаяСтрока = Элементы.СвязиТабличныхЧастей.ТекущиеДанные;	
	СписокРеквизитов1С = Новый СписокЗначений;
	СписокДополнительныхОбработчиков = _ЛокКонтекст.ЛокЯдро_ПолучитьСписокДополнительныхОбработчиковПолученияТЧ(ТипДокумента1С);
	Если СписокДополнительныхОбработчиков <> Неопределено
		И ЗначениеЗаполнено(ТекущаяСтрока.ПодчиненнаяТаблица)
		И СписокДополнительныхОбработчиков.Получить(ТекущаяСтрока.ПодчиненнаяТаблица) <> Неопределено Тогда
		СписокРеквизитов1С = СписокДополнительныхОбработчиков[ТекущаяСтрока.ПодчиненнаяТаблица].СписокКолонок;
	КонецЕсли;
	
	Если СписокРеквизитов1С.Количество() = 0 Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.ПодчиненнаяТаблица) Тогда
			Если ТекущаяСтрока.ПодчиненнаяТаблица = "(Запрос)" Тогда
				ТЧЗапрос = ТабличныеЧасти.НайтиСтроки(Новый Структура("НастройкаТЧСтрокой","(Запрос)"));
				Если ТЧЗапрос.Количество() = 0 Тогда
					Сообщение = НСтр("be = 'Не атрымалася атрымаць спіс палёў па прычыне памылкі выканання запыту.'; en = 'Failed to retrieve a list of fields due to query execution error.'; es = 'No se pudieron obtener la lista de campos debido a un error en la ejecución de la consulta.'; ka = 'ველების სიას ვერ მიიღებს შეცდომის შესრულების მიზეზის გამო'; kk = 'Сұрау орындалу қатесіне қарағанда кестедегі кестелер тізімін алу мүмкін болмады.'; ro = 'Nu s-au putut obține lista de câmpuri din cauza unei erori în executarea interogării.'; ru = 'Не удалось получить список полей по причине ошибки выполнения запроса.'; tr = 'Sorgu çalıştırma hatası nedeniyle alan listesi alınamadı.'; uk = 'Не вдалося отримати список полів через помилку виконання запиту.'; uz = ""So'rovni bajarishda xato sababli maydonlar ro'yxatini olish muvaffaqiyatsiz tugadi.""");
					Сообщить(Сообщение); 
					СписокРеквизитов1С = Новый СписокЗначений;
				Иначе
					ТекстЗапросаВыгрузкиНаТСД = ТЧЗапрос[0].ТекстЗапросаВыгрузкиНаТСД;
					СписокРеквизитов1С = ЗаполнитьСписокПолейЗапроса(ТипДокумента1С, ТекстЗапросаВыгрузкиНаТСД);
				КонецЕсли;
			Иначе
				СписокРеквизитов1С = СтруктураДокумента1С.ТабличныеЧасти[ТекущаяСтрока.ПодчиненнаяТаблица].Реквизиты;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьСписокВыбора(Элементы.СвязиТабличныхЧастейПолеПодчиненнойТаблицыСиноним,СписокРеквизитов1С);
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокПолейЗапроса(ТипДокумента1С, ТекстЗапроса);
	
	СписокПолей = Новый СписокЗначений;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документы[ТипДокумента1С].ПустаяСсылка());
	
	ПараметрыЗапроса = Запрос.НайтиПараметры();
	Для каждого ПараметрЗапроса ИЗ ПараметрыЗапроса Цикл
		Если ПараметрЗапроса.Имя = "Ссылка" Тогда
			Продолжить;
		КонецЕсли;
		Запрос.УстановитьПараметр(ПараметрЗапроса.Имя, Ложь);
	КонецЦикла;
	
	Попытка
		Результат = Запрос.Выполнить().Выгрузить();
		Для Каждого Колонка из Результат.Колонки Цикл
			СписокПолей.Добавить(Колонка.Имя, Колонка.Имя);
		КонецЦикла;
	Исключение
		Сообщение = НСтр("be = 'Не атрымалася атрымаць спіс палёў па прычыне памылкі выканання запыту.'; en = 'Failed to retrieve a list of fields due to query execution error.'; es = 'No se pudieron obtener la lista de campos debido a un error en la ejecución de la consulta.'; ka = 'ველების სიას ვერ მიიღებს შეცდომის შესრულების მიზეზის გამო'; kk = 'Сұрау орындалу қатесіне қарағанда кестедегі кестелер тізімін алу мүмкін болмады.'; ro = 'Nu s-au putut obține lista de câmpuri din cauza unei erori în executarea interogării.'; ru = 'Не удалось получить список полей по причине ошибки выполнения запроса.'; tr = 'Sorgu çalıştırma hatası nedeniyle alan listesi alınamadı.'; uk = 'Не вдалося отримати список полів через помилку виконання запиту.'; uz = ""So'rovni bajarishda xato sababli maydonlar ro'yxatini olish muvaffaqiyatsiz tugadi.""");
		Сообщить(Сообщение); 
	КонецПопытки;
	
	Возврат СписокПолей;

КонецФункции

&НаКлиенте
Процедура ОбновитьСписокПолеГлавнойТаблицы()
	ТекущаяСтрока = Элементы.СвязиТабличныхЧастей.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ГлавнаяТаблица) Тогда
		
		СписокРеквизитов1С = Новый СписокЗначений;
		СписокДополнительныхОбработчиков = _ЛокКонтекст.ЛокЯдро_ПолучитьСписокДополнительныхОбработчиковПолученияТЧ(ТипДокумента1С);
		Если СписокДополнительныхОбработчиков <> Неопределено
			И ЗначениеЗаполнено(ТекущаяСтрока.ГлавнаяТаблица)
			И СписокДополнительныхОбработчиков.Получить(ТекущаяСтрока.ГлавнаяТаблица) <> Неопределено Тогда
			СписокРеквизитов1С = СписокДополнительныхОбработчиков[ТекущаяСтрока.ГлавнаяТаблица].СписокКолонок;
		КонецЕсли;
		
		Если СписокРеквизитов1С.Количество() = 0 Тогда
			Если ТекущаяСтрока.ГлавнаяТаблица = "(Запрос)" Тогда
				ТЧЗапрос = ТабличныеЧасти.НайтиСтроки(Новый Структура("НастройкаТЧСтрокой","(Запрос)"));
				Если ТЧЗапрос.Количество() = 0 Тогда
					Сообщение = НСтр("be = 'Не атрымалася атрымаць спіс палёў па прычыне памылкі выканання запыту.'; en = 'Failed to retrieve a list of fields due to query execution error.'; es = 'No se pudieron obtener la lista de campos debido a un error en la ejecución de la consulta.'; ka = 'ველების სიას ვერ მიიღებს შეცდომის შესრულების მიზეზის გამო'; kk = 'Сұрау орындалу қатесіне қарағанда кестедегі кестелер тізімін алу мүмкін болмады.'; ro = 'Nu s-au putut obține lista de câmpuri din cauza unei erori în executarea interogării.'; ru = 'Не удалось получить список полей по причине ошибки выполнения запроса.'; tr = 'Sorgu çalıştırma hatası nedeniyle alan listesi alınamadı.'; uk = 'Не вдалося отримати список полів через помилку виконання запиту.'; uz = ""So'rovni bajarishda xato sababli maydonlar ro'yxatini olish muvaffaqiyatsiz tugadi.""");
					Сообщить(Сообщение); 
					СписокРеквизитов1С = Новый СписокЗначений;
				Иначе
					ТекстЗапросаВыгрузкиНаТСД = ТЧЗапрос[0].ТекстЗапросаВыгрузкиНаТСД;
					СписокРеквизитов1С = ЗаполнитьСписокПолейЗапроса(ТипДокумента1С, ТекстЗапросаВыгрузкиНаТСД);
				КонецЕсли;
			Иначе
				СписокРеквизитов1С = СтруктураДокумента1С.ТабличныеЧасти[ТекущаяСтрока.ГлавнаяТаблица].Реквизиты;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьСписокВыбора(Элементы.СвязиТабличныхЧастейПолеГлавнойТаблицыСиноним,СписокРеквизитов1С);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязиТабличныхЧастейПередНачаломИзменения(Элемент, Отказ)
	ОбновитьСписокПолеГлавнойТаблицы();
	ОбновитьСписокПолеПодчиненнойТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура СвязиТабличныхЧастейГлавнаяТаблицаПриИзменении(Элемент)
	ОбновитьСписокПолеГлавнойТаблицы();
	ТекСтрока = Элементы.СвязиТабличныхЧастей.ТекущиеДанные;
	ТекСтрока.ПолеГлавнойТаблицы = Неопределено;
	ТекСтрока.ПолеГлавнойТаблицыСиноним = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура СвязиТабличныхЧастейПолеГлавнойТаблицыСинонимПриИзменении(Элемент)
	ТекСтрока = Элементы.СвязиТабличныхЧастей.ТекущиеДанные;
	СписокРеквизитов1С = Новый СписокЗначений;
	СписокДополнительныхОбработчиков = _ЛокКонтекст.ЛокЯдро_ПолучитьСписокДополнительныхОбработчиковПолученияТЧ(ТипДокумента1С);
	Если СписокДополнительныхОбработчиков <> Неопределено
		И ЗначениеЗаполнено(ТекСтрока.ГлавнаяТаблица)
		И СписокДополнительныхОбработчиков.Получить(ТекСтрока.ГлавнаяТаблица) <> Неопределено Тогда
		СписокРеквизитов1С = СписокДополнительныхОбработчиков[ТекСтрока.ГлавнаяТаблица].СписокКолонок;
	КонецЕсли;
	
	Если СписокРеквизитов1С.Количество() = 0 Тогда
		Если ТекСтрока.ГлавнаяТаблица = "(Запрос)" Тогда
			ТЧЗапрос = ТабличныеЧасти.НайтиСтроки(Новый Структура("НастройкаТЧСтрокой","(Запрос)"));
			Если ТЧЗапрос.Количество() = 0 Тогда
				Сообщение = НСтр("be = 'Не атрымалася атрымаць спіс палёў па прычыне памылкі выканання запыту.'; en = 'Failed to retrieve a list of fields due to query execution error.'; es = 'No se pudieron obtener la lista de campos debido a un error en la ejecución de la consulta.'; ka = 'ველების სიას ვერ მიიღებს შეცდომის შესრულების მიზეზის გამო'; kk = 'Сұрау орындалу қатесіне қарағанда кестедегі кестелер тізімін алу мүмкін болмады.'; ro = 'Nu s-au putut obține lista de câmpuri din cauza unei erori în executarea interogării.'; ru = 'Не удалось получить список полей по причине ошибки выполнения запроса.'; tr = 'Sorgu çalıştırma hatası nedeniyle alan listesi alınamadı.'; uk = 'Не вдалося отримати список полів через помилку виконання запиту.'; uz = ""So'rovni bajarishda xato sababli maydonlar ro'yxatini olish muvaffaqiyatsiz tugadi.""");
				Сообщить(Сообщение); 
				СписокРеквизитов1С = Новый СписокЗначений;
			Иначе
				ТекстЗапросаВыгрузкиНаТСД = ТЧЗапрос[0].ТекстЗапросаВыгрузкиНаТСД;
				СписокРеквизитов1С = ЗаполнитьСписокПолейЗапроса(ТипДокумента1С, ТекстЗапросаВыгрузкиНаТСД);
			КонецЕсли;
		Иначе
			СписокРеквизитов1С = СтруктураДокумента1С.ТабличныеЧасти[ТекСтрока.ГлавнаяТаблица].Реквизиты;
		КонецЕсли;
	КонецЕсли;
	НайденныйЭлементСписка = СписокРеквизитов1С.НайтиПоЗначению(ТекСтрока.ПолеГлавнойТаблицыСиноним);
	Если НайденныйЭлементСписка<>Неопределено Тогда	
		ТекСтрока.ПолеГлавнойТаблицы = ТекСтрока.ПолеГлавнойТаблицыСиноним;
		ТекСтрока.ПолеГлавнойТаблицыСиноним = НайденныйЭлементСписка.Представление;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязиТабличныхЧастейПолеПодчиненнойТаблицыСинонимПриИзменении(Элемент)
	ТекСтрока = Элементы.СвязиТабличныхЧастей.ТекущиеДанные;
	СписокРеквизитов1С = Новый СписокЗначений;
	СписокДополнительныхОбработчиков = _ЛокКонтекст.ЛокЯдро_ПолучитьСписокДополнительныхОбработчиковПолученияТЧ(ТипДокумента1С);
	Если СписокДополнительныхОбработчиков <> Неопределено
		И ЗначениеЗаполнено(ТекСтрока.ПодчиненнаяТаблица)
		И СписокДополнительныхОбработчиков.Получить(ТекСтрока.ПодчиненнаяТаблица) <> Неопределено Тогда
		СписокРеквизитов1С = СписокДополнительныхОбработчиков[ТекСтрока.ПодчиненнаяТаблица].СписокКолонок;
	КонецЕсли;
	
	Если СписокРеквизитов1С.Количество() = 0 Тогда
		Если ТекСтрока.ПодчиненнаяТаблица = "(Запрос)" Тогда
			ТЧЗапрос = ТабличныеЧасти.НайтиСтроки(Новый Структура("НастройкаТЧСтрокой","(Запрос)"));
			Если ТЧЗапрос.Количество() = 0 Тогда
				Сообщение = НСтр("be = 'Не атрымалася атрымаць спіс палёў па прычыне памылкі выканання запыту.'; en = 'Failed to retrieve a list of fields due to query execution error.'; es = 'No se pudieron obtener la lista de campos debido a un error en la ejecución de la consulta.'; ka = 'ველების სიას ვერ მიიღებს შეცდომის შესრულების მიზეზის გამო'; kk = 'Сұрау орындалу қатесіне қарағанда кестедегі кестелер тізімін алу мүмкін болмады.'; ro = 'Nu s-au putut obține lista de câmpuri din cauza unei erori în executarea interogării.'; ru = 'Не удалось получить список полей по причине ошибки выполнения запроса.'; tr = 'Sorgu çalıştırma hatası nedeniyle alan listesi alınamadı.'; uk = 'Не вдалося отримати список полів через помилку виконання запиту.'; uz = ""So'rovni bajarishda xato sababli maydonlar ro'yxatini olish muvaffaqiyatsiz tugadi.""");
				Сообщить(Сообщение); 
				СписокРеквизитов1С = Новый СписокЗначений;
			Иначе
				ТекстЗапросаВыгрузкиНаТСД = ТЧЗапрос[0].ТекстЗапросаВыгрузкиНаТСД;
				СписокРеквизитов1С = ЗаполнитьСписокПолейЗапроса(ТипДокумента1С, ТекстЗапросаВыгрузкиНаТСД);
			КонецЕсли;
		Иначе
			СписокРеквизитов1С = СтруктураДокумента1С.ТабличныеЧасти[ТекСтрока.ПодчиненнаяТаблица].Реквизиты;
		КонецЕсли;
	КонецЕсли;
	НайденныйЭлементСписка = СписокРеквизитов1С.НайтиПоЗначению(ТекСтрока.ПолеПодчиненнойТаблицыСиноним);
	Если НайденныйЭлементСписка<>Неопределено Тогда	
		ТекСтрока.ПолеПодчиненнойТаблицы = ТекСтрока.ПолеПодчиненнойТаблицыСиноним;
		ТекСтрока.ПолеПодчиненнойТаблицыСиноним = НайденныйЭлементСписка.Представление;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязиТабличныхЧастейПодчиненнаяТаблицаПриИзменении(Элемент)
	ОбновитьСписокПолеПодчиненнойТаблицы();
	ТекСтрока = Элементы.СвязиТабличныхЧастей.ТекущиеДанные;
	ТекСтрока.ПолеПодчиненнойТаблицы = Неопределено;
	ТекСтрока.ПолеПодчиненнойТаблицыСиноним = Неопределено;
КонецПроцедуры

&НаСервере
Функция ПоместитьТЧВоВременноеХранилище(ИмяТЧ)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		#Область НесовместимыйКодFresh
		ТЧ = Вычислить(ИмяТЧ);
		#КонецОбласти //НесовместимыйКодFresh
	#Иначе
		ТЧ = РеквизитФормыВЗначение(ИмяТЧ);
	#КонецЕсли
	Возврат ПоместитьВоВременноеХранилище(ТЧ,Новый УникальныйИдентификатор());
КонецФункции

&НаКлиенте
Процедура ОбработкаЗаполненныхОбработчиковВыгрузки(МассивИменРеквизитов)
	
	Для Каждого РеквизитОбработчика Из МассивИменРеквизитов Цикл
		
		РеквизитВидаОбработчика = СтрЗаменить(РеквизитОбработчика, "Обработчик", "ВидОбработчика");
		Если Не ПустаяСтрока(ЭтаФорма[РеквизитОбработчика]) Тогда
			Если Не ЗначениеЗаполнено(ЭтаФорма[РеквизитВидаОбработчика]) Тогда
				ЭтаФорма[РеквизитВидаОбработчика] = 2; // "Свой обработчик"
			КонецЕсли;
		Иначе
			ЭтаФорма[РеквизитВидаОбработчика] = 0; // "Без обработчика"
		КонецЕсли;
		
		Если ЭтаФорма[РеквизитВидаОбработчика] = 3 Тогда // "Произвольный код"
			
			// В обычных формах подменяем поле ввода обарботчика на поле выбора, т.к. иначе не выводится представление выбранного значения
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Элементы[РеквизитОбработчика].Видимость 			= Ложь;				
				Элементы[РеквизитОбработчика + "Выбор"].Видимость 	= Истина;					
				ЗаполнитьСписокВыбора(Элементы[РеквизитОбработчика + "Выбор"], СписокПроизвольныхКодовОбработчиков);
				УстановкаОформленияСтрокиОбработчикаВыгрузки(Элементы[РеквизитОбработчика + "Выбор"], ЭтаФорма[РеквизитОбработчика], ЭтаФорма[РеквизитВидаОбработчика]);
			#Иначе
				ЗаполнитьСписокВыбора(Элементы[РеквизитОбработчика], СписокПроизвольныхКодовОбработчиков);
				УстановкаОформленияСтрокиОбработчикаВыгрузки(Элементы[РеквизитОбработчика], ЭтаФорма[РеквизитОбработчика], ЭтаФорма[РеквизитВидаОбработчика]);
			#КонецЕсли
		Иначе 
			УстановкаОформленияСтрокиОбработчикаВыгрузки(Элементы[РеквизитОбработчика], ЭтаФорма[РеквизитОбработчика], ЭтаФорма[РеквизитВидаОбработчика]);
		КонецЕсли;		

		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Элементы[РеквизитВидаОбработчика].Значение = ЭтаФорма[РеквизитВидаОбработчика];
		#КонецЕсли
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОформленияСтрокиОбработчикаВыгрузки(ЭлементСтрокаОбработчика, ЗначениеСтрокаОбработчика, КодВидаОбработчика)
	
	БезЗаполнения	= КодВидаОбработчика = 0;
	ПоУмолчанию		= КодВидаОбработчика = 1;
	СвойОбработчик	= КодВидаОбработчика = 2;	
	ПроизвольныйКод	= КодВидаОбработчика = 3;

	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		ЭлементСтрокаОбработчика.РежимВыбораИзСписка	= ПроизвольныйКод;				
		ЭлементСтрокаОбработчика.КнопкаВыбора 			= ПроизвольныйКод;		    		
		ЭлементСтрокаОбработчика.КнопкаВыпадающегоСписка= Ложь;
	#Иначе
		ЭлементСтрокаОбработчика.Значение				= ЗначениеСтрокаОбработчика;
	#КонецЕсли                                          
	ЭлементСтрокаОбработчика.ТолькоПросмотр 			= ПоУмолчанию Или БезЗаполнения;     				
	ЭлементСтрокаОбработчика.ЦветТекста 				= ?(ПоУмолчанию, WebЦвета.Серый, Новый Цвет(51, 51, 51));
	ЭлементСтрокаОбработчика.Шрифт 						= Новый Шрифт(ЭлементСтрокаОбработчика.Шрифт,,,, ПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеСоответствияВидовОбработчиковВыгрузки()
	
	СтруктураВидовОбработчиков = Новый Структура;
	СтруктураВидовОбработчиков.Вставить(
		"ВидОбработчика_ПослеОбъединенияСтрокиТабличнойЧасти",
		Новый Структура("Обработчик, Тип", 
			"Обработчик_ПослеОбъединенияСтрокиТабличнойЧасти", 
			"ПослеОбъединенияСтрокиТабличнойЧасти"));
	СтруктураВидовОбработчиков.Вставить(
		"ВидОбработчика_ПослеОбъединенияТабличнойЧасти",
		Новый Структура("Обработчик, Тип",
			"Обработчик_ПослеОбъединенияТабличнойЧасти", 
			"ПослеОбъединенияТабличнойЧасти"));
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьСписокПроизвольныхКодов(ДопТипОбработки = "")
	
	Если КлючНастройки = "Выгрузка_ШапкаДокумента" Тогда
		Направление = "Выгрузка";
		ТипОбъекта = "Шапка";
	ИначеЕсли КлючНастройки = "Выгрузка_ТабличнаяЧастьДокумента" Тогда 
		Направление = "Выгрузка";
		ТипОбъекта = "ТабличнаяЧасть";
	КонецЕсли;
	
	// Формируем список произвольных кодов без обработчиков
	Отбор = Новый Структура("Направление,ТипОбъекта", Направление, ТипОбъекта);
	ЗаполнитьСписокПроизвольныхКодов("СписокПроизвольныхКодов", Отбор);
	
	// Формируем список произвольных кодов для обработчиков
	Отбор = Новый Структура("Направление,ТипОбъекта", Направление, ?(ПустаяСтрока(ДопТипОбработки), ПолучитьСписокТиповПроизвольныхКодовДляОбработчиков(), ДопТипОбработки));
	ЗаполнитьСписокПроизвольныхКодов("СписокПроизвольныхКодовОбработчиков", Отбор);	
	
КонецПроцедуры

&НаКлиенте 
Процедура ЗаполнитьСписокПроизвольныхКодов(ИмяСписка, Отбор)
		
	ЭтаФорма[ИмяСписка].Очистить();
	
	ТаблицаПроизвольныхКодов = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаЗначениеТабличнойНастройкиSMARTS("ПроизвольныеКоды", Отбор);
	
	Если ТаблицаПроизвольныхКодов <> Ложь И ТипЗнч(ТаблицаПроизвольныхКодов) = Тип("Массив") Тогда
		Для Каждого СтрокаТЗ Из ТаблицаПроизвольныхКодов Цикл
			Если СтрокаТЗ.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			ЭтаФорма[ИмяСписка].Добавить(СтрокаТЗ.ID_ПроизвольногоКода, СтрокаТЗ.Наименование);
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтаФорма[ИмяСписка].Количество() = 0 Тогда
		ЭтаФорма[ИмяСписка].Добавить("");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКлючНастройкиОбработчикаВыгрузки(ИмяЭлемента)
	
	ИмяКлючаНастройки = "";
	
	Если ИмяЭлемента = "Обработчик_ПослеОбъединенияТабличнойЧасти" Тогда
		ИмяКлючаНастройки = "Выгрузка_ПослеОбъединенияТЧ";
	ИначеЕсли ИмяЭлемента = "Обработчик_ПослеОбъединенияСтрокиТабличнойЧасти" Тогда
		ИмяКлючаНастройки = "Выгрузка_ПослеОбъединенияСтрокиТЧ";
	КонецЕсли;		
	
	Возврат ИмяКлючаНастройки;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокТиповПроизвольныхКодовДляОбработчиков()
	
	МассивТиповОбъектов = Новый Массив;
	МассивТиповОбъектов.Добавить("ПослеОбъединенияТЧ");
	МассивТиповОбъектов.Добавить("ПослеОбъединенияСтрокиТЧ");

	Возврат МассивТиповОбъектов;
	
КонецФункции

#КонецОбласти

#Если ТолстыйКлиентОбычноеПриложение Тогда
	Процедура ТабличныеЧастиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
		Если ДанныеСтроки.Настроить = "Настроено" Тогда
			ОформлениеСтроки.Ячейки.ТабличныеЧастиНастроить.ЦветТекста = WebЦвета.Зеленый;	
		Иначе	
			ОформлениеСтроки.Ячейки.ТабличныеЧастиНастроить.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
		
		Если ДанныеСтроки.ТабличнаяЧастьЕстьВМетаданных Тогда
			Если ДанныеСтроки.ВыгружатьСтрокиПоУсловию = "Включено" Тогда
				ОформлениеСтроки.Ячейки.ТабличныеЧастиВыгружатьСтрокиПоУсловию.ЦветТекста = WebЦвета.Зеленый;
			Иначе	
				ОформлениеСтроки.Ячейки.ТабличныеЧастиВыгружатьСтрокиПоУсловию.ЦветТекста = WebЦвета.Красный;
			КонецЕсли;
		Иначе
			ОформлениеСтроки.Ячейки.ТабличныеЧастиВыгружатьСтрокиПоУсловию.ЦветТекста = WebЦвета.СветлоСерый;
		КонецЕсли;
	КонецПроцедуры

	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = Новый Структура();
	Для каждого Элемент ИЗ ЭлементыФормы Цикл
		Элементы.Вставить(Элемент.Имя,Элемент);
		Если ТипЗнч(Элемент) = Тип("ТабличноеПоле") Тогда
			Для каждого Колонка ИЗ Элемент.Колонки Цикл
				Элементы.Вставить(Колонка.Имя,Колонка.ЭлементУправления);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Объект = ЭтотОбъект;
#КонецЕсли