#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтраницаТекущая = 1;
	Если Параметры.Свойство("ТаблицаПлощадок") Тогда
		Для Каждого ПлощадкаВыбран Из Параметры["ТаблицаПлощадок"] Цикл
			НовСтр = ПлощадкиВыбранные.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ПлощадкаВыбран);
			НовСтр.ДействиеСоСтрокой = НСтр("ru = 'Удалить'");
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НайтиПлощадкиНаКлиенте("");
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницаТекущаяПриИзменении(Элемент)
	СтраницаТекущая = Мин(Макс(СтраницаТекущая, 1), СтраницВсего);
	НайтиПлощадкиНаКлиенте(ПодборПлощадки, СтраницаТекущая);
КонецПроцедуры
&НаКлиенте
Процедура ПодборПлощадкиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
	СтандартнаяОбработка)
	НайтиПлощадкиНаКлиенте(Текст);
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыПлощадки

&НаКлиенте
Процедура ПлощадкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПеренестиСтрокуВПлощадкиВыбранные(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		УдалитьПоМассивуЗначенийИзПлощадкиВыбранные(ПараметрыПеретаскивания.Значение);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыПлощадкиВыбранные

&НаКлиенте
Процедура ПлощадкиВыбранныеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		ПеренестиМассивЗначенийВПлощадкиВыбранные(ПараметрыПеретаскивания.Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкиВыбранныеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкиВыбранныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ПлощадкиВыбранныеДействиеСоСтрокой Тогда
		УдалитьСтрокуИзПлощадокВыбранных(ВыбраннаяСтрока);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НавигацияПоСтраницамПервая(Команда)
	Если Не СтраницаТекущая = 1 Тогда
		СтраницаТекущая = 1;
		НайтиПлощадкиНаКлиенте(ПодборПлощадки, СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамСледующая(Команда)
	Если Не СтраницаТекущая = Мин(СтраницаТекущая + 1, СтраницВсего) Тогда
		СтраницаТекущая = Мин(СтраницаТекущая + 1, СтраницВсего);
		НайтиПлощадкиНаКлиенте(ПодборПлощадки, СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамПредыдущая(Команда)
	Если Не СтраницаТекущая = Макс(СтраницаТекущая - 1, 1) Тогда
		СтраницаТекущая = Макс(СтраницаТекущая - 1, 1);
		НайтиПлощадкиНаКлиенте(ПодборПлощадки, СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамПоследняя(Команда)
	Если Не СтраницаТекущая = СтраницВсего Тогда
		СтраницаТекущая = СтраницВсего;
		НайтиПлощадкиНаКлиенте(ПодборПлощадки, СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменить(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавить(Команда)
	Закрыть(ПлощадкиВыбранные);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиВВыбранные(Команда)
	ПеренестиСтрокиВПлощадкиВыбранные();
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьИзВыбранных(Команда)
	УдалитьСтрокиИзПлощадкиВыбранные();
КонецПроцедуры

&НаКлиенте
Процедура ПлощадкиВыбранныеОчистить(Команда)
	ПлощадкиВыбранные.Очистить();
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УдалитьСтрокиИзПлощадкиВыбранные()
	ВыделенныеСтроки = Элементы.ПлощадкиВыбранные.ВыделенныеСтроки;
	Для Инд = -ВыделенныеСтроки.ВГраница() По 0 Цикл
		УдалитьСтрокуИзПлощадокВыбранных(ВыделенныеСтроки[-Инд]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НайтиПлощадкиНаКлиенте(Название, СтраницаЗначение = 1)
	Площадки.Очистить();

	РезультатHTTPЗапроса = КонтурЗакупки_httpЗапросыКлиентСервер.http_ПолучитьСписокПлощадок(Название);
	Если Не РезультатHTTPЗапроса = Неопределено Тогда
		Если Не РезультатHTTPЗапроса["data"] = Неопределено Тогда
			СтруктураЗаказчиков = РезультатHTTPЗапроса["data"];
			ЗаписейВсего = СтруктураЗаказчиков["total"];    
			Элементы.ПлощадкиНаименование.Заголовок = СтрШаблон("Найдено площадок: %1", ЗаписейВсего);
			СтраницаТекущая = СтраницаЗначение;
			Если Не СтруктураЗаказчиков["electronicPlaces"] = Неопределено Тогда
				МассивПлощадок = СтруктураЗаказчиков["electronicPlaces"];
				Для Каждого ЭлементПлощадки Из МассивПлощадок Цикл
					Если Не ЭлементПлощадки["model"] = Неопределено Тогда
						МодельПлощадки = ЭлементПлощадки["model"];
						НовСтрока = Площадки.Добавить();
						НовСтрока.Площадка = МодельПлощадки["displayName"];
						НовСтрока.ИдентификаторПлощадки = МодельПлощадки["id"];
					КонецЕсли;
				КонецЦикла;
				ЗаписейНаСтраницу = Макс(МассивПлощадок.Количество(), 1, ЗаписейНаСтраницу);
			КонецЕсли;
			СтраницВсего = Цел(ЗаписейВсего / ЗаписейНаСтраницу) + ?((ЗаписейВсего % ЗаписейНаСтраницу) > 0, 1, 0);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ЗаголовокВыбранныхПлощадок()                                                   
	ЗаписейВсего = ПлощадкиВыбранные.Количество();
	Элементы.ПлощадкиВыбранныеНаименование.Заголовок = СтрШаблон("Выбрано площадок: %1", ЗаписейВсего);
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиСтрокиВПлощадкиВыбранные()
	ВыделенныеСтроки = Элементы.Площадки.ВыделенныеСтроки;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		ПеренестиСтрокуВПлощадкиВыбранные(ВыделеннаяСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиСтрокуВПлощадкиВыбранные(ИдентификаторВыделеннойСтроки)
	СтрокаПоИдентификатору = Площадки.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
	Если Не ПлощадкаЕстьВВыбранных(СтрокаПоИдентификатору) Тогда
		НовСтрока = ПлощадкиВыбранные.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаПоИдентификатору);
		НовСтрока.ДействиеСоСтрокой = НСтр("ru = 'Удалить'");   
		ЗаголовокВыбранныхПлощадок();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиМассивЗначенийВПлощадкиВыбранные(МассивЗначений)
	Для Каждого ЭлементМассива Из МассивЗначений Цикл
		Если Не ПлощадкаЕстьВВыбранных(ЭлементМассива) Тогда
			НовСтр = ПлощадкиВыбранные.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ЭлементМассива);
			НовСтр.ДействиеСоСтрокой = НСтр("ru = 'Удалить'");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПлощадкаЕстьВВыбранных(СтруктураПлощадка)
	СтруктураПоиск = Новый Структура("ИдентификаторПлощадки", СтруктураПлощадка.ИдентификаторПлощадки);
	ПлощадкаВВыбранных = ПлощадкиВыбранные.НайтиСтроки(СтруктураПоиск).Количество() > 0;

	Возврат ПлощадкаВВыбранных;
КонецФункции

&НаКлиенте
Процедура УдалитьСтрокуИзПлощадокВыбранных(ВыделеннаяСтрока)
	УдаляемаяСтрока = ПлощадкиВыбранные.НайтиПоИдентификатору(ВыделеннаяСтрока);
	ПлощадкиВыбранные.Удалить(УдаляемаяСтрока);  
	ЗаголовокВыбранныхПлощадок();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПоМассивуЗначенийИзПлощадкиВыбранные(МассивЗначений)
	Для Каждого ЭлементМассива Из МассивЗначений Цикл
		СтрукОтбор = Новый Структура("ИНН", ЭлементМассива.ИНН);
		НайденныеСтрокиПлощадкиВыбранные = ПлощадкиВыбранные.НайтиСтроки(СтрукОтбор);
		Для Каждого СтрокаНаУдаление Из НайденныеСтрокиПлощадкиВыбранные Цикл
			ПлощадкиВыбранные.Удалить(СтрокаНаУдаление);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти