
&Вместо("ЗаполнитьСловарьСопоставленияНоменклатурыБЭД")
Процедура АУ_ЗаполнитьСловарьСопоставленияНоменклатурыБЭД(Параметры)

	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);

	Попытка
	Порция = ОбновляемыеДанные.ВыгрузитьКолонку("СсылкаНаОбъект");
	ПараметрыОбновления = СопоставлениеНоменклатурыКонтрагентовСлужебный.НовыеПараметрыОбновленияСловаря();
	ПараметрыОбновления.ОтметитьВыполнениеОбработки = Истина;
	СопоставлениеНоменклатурыКонтрагентовСлужебный.ОбновитьПорциюСсылокСловаря(Порция, ПараметрыОбновления);

	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь,
	Метаданные.РегистрыСведений.СловарьСопоставленияНоменклатурыБЭД.ПолноеИмя());
Исключение
	Параметры.ОбработкаЗавершена = Истина;
	КонецПопытки;

КонецПроцедуры
