
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// BSLLS:UnusedLocalVariable-off

// Служебные АПИ
Перем СтдСтр, СтдОбщегоНазначения;

// Служебные
Перем _ВариантЗапуска, _МенеджерУведомленийДоступен;

// Двоичные данные внешней обработки или ссылка на элемент справочника доп. обработок
Перем _Обработка;

// Перечисления
Перем _ПеречислениеВариантыЗапуска;

// BSLLS:UnusedLocalVariable-on

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

 // Запускает выполнение метода обработки "ВыполнитьКоманду" в фоновом задании
//
// Параметры:
//  ПараметрыВыполненияКоманды - Структура - параметры для выполнения команды в фоне
//											(см. ПараметрыВыполненияКоманды())
// 
// Возвращаемое значение:
//  Структура - описание запущенного фонового задания (см. ОписаниеЗадания())
//
// BSLLS:NumberOfOptionalParams-off
Функция ВыполнитьКомандуВФоне(Знач ПараметрыВыполненияКоманды) Экспорт
// BSLLS:NumberOfOptionalParams-on

	Перем ОписаниеЗадания;
	
	Если НЕ Доступны() Тогда
		ТекстОшибки = НСтр("ru = 'Запуск фоновых заданий не доступен в текущем варианте использования библиотеки'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если _ВариантЗапуска = _ПеречислениеВариантыЗапуска.ПодсистемаДлительныеОперации Тогда
		
		ОписаниеЗадания = ЗапуститьВФонеЧерезПодсистемуДлительныеОперации(ПараметрыВыполненияКоманды);
	
	ИначеЕсли _ВариантЗапуска = _ПеречислениеВариантыЗапуска.ПодсистемаХраненияДиадок Тогда
		
		ОписаниеЗадания = ЗапуститьВФонеЧерезПодсистемуХраненияДиадок(ПараметрыВыполненияКоманды);
		
	ИначеЕсли _ВариантЗапуска = _ПеречислениеВариантыЗапуска.БСП Тогда
		
		ОписаниеЗадания = ЗапуститьВФонеЧерезБСП(ПараметрыВыполненияКоманды);
		
	Иначе
		
		ТекстОшибки = НСтр("ru = 'Указан некорректный вариант запуска фоновых заданий'");
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат ОписаниеЗадания;
	
КонецФункции

// Проверяет состояние фонового задания. Если фоновое задание завершено (успешно или по ошибке),
// то устанавливает признак ОписаниеЗадания.Завершено = Истина. В случае ошибки запуска или в 
// процессе выполнения фонового задания (не внутри выполняемой команды, а "снаружи" исполнения)
// заполняет текст ошибки в ОписаниеЗадания.ТекстОшибки.
// В случае, если передан параметр ОжидатьЗавершение = Истина, то ожидает завершение фонового 
// задания время (в секундах), указанное в параметре ВремяОжидания. Если значение ВремяОжидания
// установлено 0, то ждет до полного завершения задания.
//
// Параметры:
//  ОписаниеЗадания	 - Структура - описание операции (см. ОписаниеЗадания())
//  ОжидатьЗавершение	 - Булево - признак ожидания завершения фонового задания
//  ВремяОжидания		 - Число - число секунд ожидания, если ОжидатьЗавершение = Истина
//
// BSLLS:MagicNumber-off
Процедура ПроверитьСостояние(ОписаниеЗадания, ОжидатьЗавершение = Ложь, ВремяОжидания = 60) Экспорт
// BSLLS:MagicNumber-on

	Если ОписаниеЗадания.Завершено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторЗадания = ОписаниеЗадания.УникальныйИдентификатор;
	Задание = НайтиЗаданиеПоИдентификатору(ИдентификаторЗадания);
	
	Если ОжидатьЗавершение = Истина Тогда
		ПодождатьЗавершения(Задание, ВремяОжидания);
	КонецЕсли;
	
	Завершено = Истина;
	
	// BSLLS:IfElseIfEndsWithElse-off
	Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		
		Завершено = Ложь;
		
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		
		ТекстОшибки = НСтр("ru='Фоновое задание отменено администратором " + ИдентификаторЗадания + "'");
		ОписаниеЗадания.ТекстОшибки = ТекстОшибки;
		ОписаниеЗадания.ТекстОшибкиПолный = ТекстОшибки;
		
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		
		ОписаниеЗадания.ТекстОшибки = КраткоеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
		ОписаниеЗадания.ТекстОшибкиПолный = ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
		
	КонецЕсли;
	// BSLLS:IfElseIfEndsWithElse-on
	
	ОписаниеЗадания.Завершено = Завершено;
	
КонецПроцедуры

// Отправляет уведомление клиентскому сеансу, который запустил фоновое задание
// см. документацию по УведомленияКлиента
//
// Параметры:
//  Данные - Произвольный - отправляемые данные
//
Процедура ОтправитьУведомлениеКлиенту(Данные) Экспорт
	
	Если Не _МенеджерУведомленийДоступен Тогда
		
		ТекстОшибки = НСтр("ru='Менеджер уведомлений клиента недоступен в текущей версии платформы'");
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ТекущийСеансИнформационнойБазы = Вычислить("ПолучитьТекущийСеансИнформационнойБазы()");
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание <> Неопределено Тогда
		
		ПолучателиУведомления = ПараметрыВМассивЛок(ФоновоеЗадание.НомерРодительскогоСеанса);
		Ключ = ФоновоеЗадание.УникальныйИдентификатор;
		
		МенеджерУведомленийКлиента = МенеджерУведомленийКлиентаЛок();
		МенеджерУведомленийКлиента.ОтправитьУведомление(Ключ, Данные, ПолучателиУведомления);
		
	КонецЕсли;
	
КонецПроцедуры

// Подключает обработчик уведомлений клиента, который будет вызван при получении указанных уведомлений
// см. документацию по УведомленияКлиента
//
// Доступен только в толстом клиенте обычного приложения. Для подключения в управляемом приложении используйте
// одноименный клиентский метод в ДлительныеОперации.Формы.КлиентскиеВызовы
//
// Параметры:
//  Ключ	 			 - Строка - ключ уведомления
//  ОповещениеОЗавершении - Произвольный - описание оповещения, которое будет вызвано при отправке уведомления
//
Процедура ПодключитьОбработчикУведомлений(Ключ, ОповещениеОЗавершении) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Если Не _МенеджерУведомленийДоступен Тогда
			
			ТекстОшибки = НСтр("ru='Менеджер уведомлений клиента недоступен в текущей версии платформы'");
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
		МенеджерУведомленийКлиента = МенеджерУведомленийКлиентаЛок();
		МенеджерУведомленийКлиента.ПодключитьОбработчик(Ключ, ОповещениеОЗавершении);
		
	#Иначе
		
		ТекстОшибки = НСтр("ru='Обработчик уведомлений недоступен в текущем режиме'");
		ВызватьИсключение ТекстОшибки;
		
	#КонецЕсли
	
КонецПроцедуры

// Прерывает выполнение фонового задания
//
// Параметры:
//  ИдентификаторЗадания - УникальныйИдентификатор - уникальный идентификатор прерываемого ФЗ
//
Процедура ОтменитьВыполнение(ИдентификаторЗадания) Экспорт
	
	ФоновоеЗадание = Неопределено;
	
	Попытка
		ФоновоеЗадание = НайтиЗаданиеПоИдентификатору(ИдентификаторЗадания);
		Если ФоновоеЗадание <> Неопределено
			И ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			ФоновоеЗадание.Отменить();
		КонецЕсли;
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписатьОшибкуВЖурнал(ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

// Возвращает используемый вариант запуска фоновых заданий (через какие подсистемы/объекты запускаются)
// 
// Возвращаемое значение:
//  Строка - значение программного перечисления (см. ПеречислениеВариантыЗапуска())
//
Функция ВариантЗапуска() Экспорт
	Возврат _ВариантЗапуска;
КонецФункции

// Признак того, что запуск фоновых заданий возможен (есть необходимые объекты и/или подсистемы)
// Проверяет на заполненность варианта запуска (см. ВычислитьВариантЗапуска())
// 
// Возвращаемое значение:
//  Булево - Истина, если запуск фоновых доступен, иначе - Ложь
//
Функция Доступны() Экспорт
	
	Если _ВариантЗапуска = Неопределено Тогда
		_ВариантЗапуска = ВычислитьВариантЗапуска();
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(_ВариантЗапуска);
	
КонецФункции

// Добавляет обработку, команда которой будет вызываться в фоновом задании.
//
// Параметры:
//  ИсполняемаяОбработка - Строка, ДвоичныеДанные, Ссылка - имя обработки конфигурации, двоичные данные обработки
//                                                          или ссылка на справочника доп. обработок.
//
Процедура УстановитьИсполняемуюОбработку(Знач ИсполняемаяОбработка) Экспорт
	// BSLLS:UnusedLocalVariable-off
	_Обработка = ИсполняемаяОбработка;
	// BSLLS:UnusedLocalVariable-off
	_ВариантЗапуска = Неопределено;
	// BSLLS:UnusedLocalVariable-on
КонецПроцедуры

// Конструктор параметров выполнения ФЗ
//
// Параметры:
//  Идентификатор - УникальныйИдентификатор - уникальный идентификатор формы (или связанного с ней контекста)
//  КлючФоновогоЗадания - Строка - ключ фонового задания для контроля уникальности
// 
// Возвращаемое значение:
//  Структура - описание полей см. в ПараметрыВыполнения()
//
Функция НовыеПараметрыВыполнения(Знач Идентификатор, КлючФоновогоЗадания = Неопределено) Экспорт
	
	Если Идентификатор = Неопределено Тогда
		Идентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Результат = ПараметрыВыполнения();
	
	Результат.КлючФоновогоЗадания = КлючФоновогоЗадания;
	Результат.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Идентификатор);
	
	Возврат Результат;

КонецФункции

// Контракты

// Контракт с описанием длительной операции (ФЗ). Используется для контроля выполнения ФЗ, получения результата
// функциональностью длительных операций. Не требует изменений/заполнения.
// 
// Возвращаемое значение:
//  Структура - параметры для контроля работы ФЗ и получения результата
//		* Завершено - Булево - Истина, если фоновое задание завершено (успешно, аварийно), ложь - фоновое задание активно
//		* УникальныйИдентификатор - УникальныйИдентификатор - идентификатор фонового задания (присваивается при запуске)
//		* АдресРезультата - Строка - адрес временного хранилища с результатот метода, вызываемого через фоновое задание
//		* ТекстОшибки - Строка - содержит краткий текст ошибки в случаях,
//									когда фонового задание не удалось запустить или оно завершено аварийно
//		* ТекстОшибкиПолный - Строка - содержит полное описание ошибки в случаях,
//									когда фонового задание не удалось запустить или оно завершено аварийно
//		* ИмяМетода - Строка - имя метода обработки, вызываемого в фоновом задании
//		* Ключ - Строка - ключ фонового задания для контроля уникальности
//		* УведомлятьКлиент - Строка - признак использования функциональности платформы УведомленияКлиента
//
Функция ОписаниеЗадания() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Завершено", Ложь);
	Результат.Вставить("УникальныйИдентификатор", Неопределено);
	Результат.Вставить("АдресРезультата", "");
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ТекстОшибкиПолный", "");
	Результат.Вставить("ИмяМетода", "");
	Результат.Вставить("Ключ", "");
	Результат.Вставить("УведомлятьКлиент", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Контракт параметров, которые необходимы для запуска ФЗ, команды обработки
// 
// Возвращаемое значение:
//  Структура - параметры для запуска ФЗ, команды обработки
//    * РезультатВыполнения - Структура - оставлен для совместимости со старой логики команды
//    * АдресРезультата - Строка - адрес в хранилище, куда будет помещен результат выполнения команды
//    * ИдентификаторКоманды - Строка - идентификатор команды для ветвления логики внутри вызова метода
//    * КлючФоновогоЗадания - Строка - ключ фонового задания для контроля их уникальности в рамках вызываемого метода
//    * УведомлятьКлиент - Булево - признак использования функциональности платформы УведомленияКлиента
//
Функция ПараметрыВыполнения() Экспорт
	
	Результат = Новый Структура();
	
	Результат.Вставить("РезультатВыполнения", Новый Структура());
	Результат.Вставить("ИдентификаторФормы", "");
	Результат.Вставить("АдресРезультата", "");
	Результат.Вставить("ИдентификаторКоманды", "");
	Результат.Вставить("КлючФоновогоЗадания", "");
	Результат.Вставить("УведомлятьКлиент", Ложь);
	
	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Запускает фоновое задании, использую общий модуль расширения
// КонтурДиадокДлительныеОперации.ВыполнитьКоманду
//
// Параметры:
//  ПараметрыВыполненияКоманды - Структура - структура параметров выполнения ФЗ, заполняемая в вызывающем
//										коде (см. ПараметрыВыполненияКоманды())
// 
// Возвращаемое значение:
//  Структура - описание длительной операции (см. ОписаниеЗадания())
//
Функция ЗапуститьВФонеЧерезПодсистемуДлительныеОперации(ПараметрыВыполненияКоманды)
	
	ПараметрыОперации = ПараметрыВыполненияКоманды.ПараметрыКоманды.ПараметрыОперации;
	ПроверитьИЗаполнитьАдресРезультата(ПараметрыВыполненияКоманды, ПараметрыОперации.ИмяМетода);

	ПараметрыМетодаКоллекцией = ПараметрыВМассивЛок(
		ПараметрыВыполненияКоманды.ИдентификаторКоманды,
		ПараметрыВыполненияКоманды,
		ПараметрыВыполненияКоманды.АдресРезультата);
		
	НаименованиеЗадания = СформироватьНаименованиеЗадания(ПараметрыОперации.ИмяМетода);
	
	КлючЗадания = ПараметрыВыполненияКоманды.КлючФоновогоЗадания;
	
	ИмяМетодаРасширения = "КонтурДиадокДлительныеОперации.ВыполнитьКоманду";

	Задание = ФоновыеЗадания.Выполнить(ИмяМетодаРасширения, ПараметрыМетодаКоллекцией, , НаименованиеЗадания);
	
	Если ЗначениеЗаполнено(Задание.ИнформацияОбОшибке) Тогда
		ЗаписатьОшибкуВЖурнал(Задание.ИнформацияОбОшибке);
	КонецЕсли;
	
	Результат = СформироватьОписаниеЗадания(Задание, ПараметрыВыполненияКоманды, Задание.ИнформацияОбОшибке, КлючЗадания);
	Результат.ИмяМетода = ПараметрыОперации.ИмяМетода;
	
	Возврат Результат;

КонецФункции

// Запускает фоновое задании, использую общий модуль подсистемы хранения Диадок
//  Диадок_ФоновыеЗадания.ВыполнитьКоманду
//
// Параметры:
//  ПараметрыВыполненияКоманды - Структура - структура параметров выполнения ФЗ, заполняемая в вызывающем
//  							коде (см. ПараметрыВыполненияКоманды())
// 
// Возвращаемое значение:
//  Структура - описание длительной операции (см. ОписаниеЗадания())
//
Функция ЗапуститьВФонеЧерезПодсистемуХраненияДиадок(ПараметрыВыполненияКоманды)
	
	ПараметрыОперации = ПараметрыВыполненияКоманды.ПараметрыКоманды.ПараметрыОперации;
	ПроверитьИЗаполнитьАдресРезультата(ПараметрыВыполненияКоманды, ПараметрыОперации.ИмяМетода);
	
	ПараметрыМетодаКоллекцией = ПараметрыВМассивЛок(
		_Обработка,
		ПараметрыВыполненияКоманды,
		ПараметрыВыполненияКоманды.АдресРезультата);
	
	НаименованиеЗадания = СформироватьНаименованиеЗадания(ПараметрыОперации.ИмяМетода);
	
	КлючЗадания = ПараметрыВыполненияКоманды.КлючФоновогоЗадания;

	ИмяМетодаПодсистемы = "Диадок_ФоновыеЗадания.ВыполнитьКоманду";
	
	Задание = ФоновыеЗадания.Выполнить(ИмяМетодаПодсистемы, ПараметрыМетодаКоллекцией, , НаименованиеЗадания);
	
	Если ЗначениеЗаполнено(Задание.ИнформацияОбОшибке) Тогда
		ЗаписатьОшибкуВЖурнал(Задание.ИнформацияОбОшибке);
	КонецЕсли;

	Результат = СформироватьОписаниеЗадания(Задание, ПараметрыВыполненияКоманды, Задание.ИнформацияОбОшибке, КлючЗадания);
	Результат.ИмяМетода = ПараметрыОперации.ИмяМетода;

	Возврат Результат;

КонецФункции

// Запускает фоновое задании, использую функциональность БСП
//
// Параметры:
//  ПараметрыВыполненияКоманды - Структура - структура параметров выполнения ФЗ, заполняемая в вызывающем
//  							коде (см. ПараметрыВыполнения())
// 
// Возвращаемое значение:
//  Структура - описание длительной операции (см. ОписаниеЗадания())
//
Функция ЗапуститьВФонеЧерезБСП(ПараметрыВыполненияКоманды)
	
	ПараметрыВыполненияКоманды.Вставить("ДополнительнаяОбработкаСсылка", _Обработка);

	ПараметрыОперации = ПараметрыВыполненияКоманды.ПараметрыКоманды.ПараметрыОперации;
	
	НаименованиеЗадания = СформироватьНаименованиеЗадания(ПараметрыОперации.ИмяМетода);
	
	КлючЗадания = ПараметрыВыполненияКоманды.КлючФоновогоЗадания;
	
	ОбщийМодульДлительныеОперации = СтдОбщегоНазначения.ОбщийМодульЛок("ДлительныеОперации");
	
	ПроверитьИЗаполнитьАдресРезультата(ПараметрыВыполненияКоманды, ПараметрыОперации.ИмяМетода);
	
	ИдентификаторФормы = ПараметрыВыполненияКоманды.ИдентификаторФормы;
	ПараметрыВыполненияБСП = ОбщийМодульДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	
	ПараметрыВыполненияБСП.АдресРезультата = ПараметрыВыполненияКоманды.АдресРезультата;
	ПараметрыВыполненияБСП.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполненияБСП.ОжидатьЗавершение = 0;
	
	ПолныйПутьКМетодуКоманды = "ДополнительныеОтчетыИОбработки.ВыполнитьКоманду";
	
	Если ИспользоватьНовыеМетодыПрограммногоИнтерфейсаБСП() Тогда
		
		ОписаниеЗаданияБСП = ОбщийМодульДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполненияБСП,
			ПолныйПутьКМетодуКоманды,
			ПараметрыВыполненияКоманды);
		
	Иначе
	
		ОписаниеЗаданияБСП = ОбщийМодульДлительныеОперации.ВыполнитьВФоне(
			ПолныйПутьКМетодуКоманды,
			ПараметрыВыполненияКоманды,
			ПараметрыВыполненияБСП);
		
	КонецЕсли;
	
	Если ОписаниеЗаданияБСП.Статус = "Ошибка" Тогда
		ЗаписатьОшибкуВЖурнал(ОписаниеЗаданияБСП.ИнформацияОбОшибке);
	КонецЕсли;
	
	Задание = Неопределено;
	Если ОписаниеЗаданияБСП.Свойство("УникальныйИдентификатор") Тогда
		ЗаданиеИдентификатор = ОписаниеЗаданияБСП.УникальныйИдентификатор;
	ИначеЕсли ОписаниеЗаданияБСП.Свойство("ИдентификаторЗадания") Тогда
		ЗаданиеИдентификатор = ОписаниеЗаданияБСП.ИдентификаторЗадания;
	Иначе
		ТекстОшибки = НСтр("ru='Произошла ошибка при попытке получить идентификатор фонового задания
			|при выполнении метода %1 через Библиотеку стандартных подсистем'");
		ТекстОшибки = СтдСтр.СтрШаблонЛок(ТекстОшибки, ПараметрыОперации.ИмяМетода);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
		
	Если ОписаниеЗаданияБСП.Статус = "Ошибка" Тогда
		СостояниеФЗ = СостояниеФоновогоЗадания.ЗавершеноАварийно;
	ИначеЕсли ОписаниеЗаданияБСП.Статус = "Выполнено"
		Или Не ЗначениеЗаполнено(ЗаданиеИдентификатор) Тогда
		СостояниеФЗ = СостояниеФоновогоЗадания.Завершено;
	Иначе
		СостояниеФЗ = СостояниеФоновогоЗадания.Активно;
	КонецЕсли;
	
	Задание = Новый Структура;
	Задание.Вставить("Состояние", СостояниеФЗ);
	Задание.Вставить("УникальныйИдентификатор", ЗаданиеИдентификатор);

	Результат = СформироватьОписаниеЗадания(
		Задание,
		ПараметрыВыполненияКоманды,
		ОписаниеЗаданияБСП.ИнформацияОбОшибке,
		КлючЗадания);
	
	Результат.АдресРезультата = ОписаниеЗаданияБСП.АдресРезультата;
	Результат.ИмяМетода = ПараметрыОперации.ИмяМетода;
	
	Возврат Результат;
	
КонецФункции

Функция ПеречислениеВариантыЗапуска()
	
	Результат = СобратьПеречислениеСлужебный(
		"ПодсистемаДлительныеОперации, ПодсистемаХраненияДиадок, БСП");
	
	Результат = Новый ФиксированнаяСтруктура(Результат);
	
	Возврат Результат;
	
КонецФункции

// Вычисляет вариант запуска фоновых заданий
// Если в конфигурации есть подсистема длительных операций, то ФЗ будут запускаться через нее
// и в этом случае будет использоваться встроенная обработка (в расширении), режим запуска через подсистему.
// Если подсистемы нет, но есть подсистема хранения Диадок и "установлена" обработка (заполнена _Обработка),
// то режим запуска будет через подсистему хранения
// Если же и подсистемы хранения нет, но есть подходящая версия БСП и ссылка на справочник. доп. обработок
// с модулем (заполнена _Обработка), то вариант запуска будет БСП
// 
// Возвращаемое значение:
//  Строка - значение программного перечисления с вариантом запуска ФЗ (см. ПеречислениеВариантыЗапуска())
//
Функция ВычислитьВариантЗапуска()
	
	Перем Результат;
	
	ФайловыйРежимРаботы = ЭтоФайловыйРежимРаботы1СПредприятия();
	ДоступенЗапускФоновыхВТомЖеСеансе = СтдСтр.ВерсияПлатформыБольшеИлиРавна("8.3.3.641");
	
	Если ФайловыйРежимРаботы И НЕ ДоступенЗапускФоновыхВТомЖеСеансе Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ВозможенЗапускЧерезПодсистемуДлительныхОпераций() Тогда
		
		Результат = _ПеречислениеВариантыЗапуска.ПодсистемаДлительныеОперации;
	
	ИначеЕсли ВозможенЗапускЧерезПодсистемуХраненияДиадок() Тогда
		
		Результат = _ПеречислениеВариантыЗапуска.ПодсистемаХраненияДиадок;
		
	ИначеЕсли ВозможенЗапускЧерезБСП() Тогда 
		
		Результат = _ПеречислениеВариантыЗапуска.БСП;
		
	Иначе
		
		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйКлючОбработчикаУведомлений()
	
	Результат = "";
	Если ДоступенМенеджерУведомленийКлиента() Тогда
		Результат = "МодульДлительныхОпераций.ОбработчикСерверныхУведомленийСлужебный";
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура ПроверитьИЗаполнитьАдресРезультата(ПараметрыВыполнения, ИмяФункции)
	
	// BSLLS:IfElseIfEndsWithElse-off
	Если Не ЗначениеЗаполнено(ПараметрыВыполнения.АдресРезультата) Тогда
		
		Если Не ЗначениеЗаполнено(ПараметрыВыполнения.ИдентификаторФормы)
			Или ТипЗнч(ПараметрыВыполнения.ИдентификаторФормы) <> Тип("УникальныйИдентификатор") Тогда
		
			ШаблонТекстаОшибки = НСтр("ru = 'Не указан ни уникальный идентификатор формы в параметре %1,
				|ни адрес временного хранилища в параметре %2
				|функции %3.
				|Рекомендуется указать идентификатор формы или адрес.
				|Автоматически сформированный адрес содержит значение только до следующего
				|серверного вызова, что может приводить к неожиданным ошибкам.'");
			
			ТекстОшибки = СтдСтр.ПодставитьПараметрыВСтрокуЛок(
				ШаблонТекстаОшибки,
				"ПараметрыВыполнения.ИдентификаторФормы",
				"ПараметрыВыполнения.АдресРезультата",
				ИмяФункции);
				
			Попытка
				ВызватьИсключение ТекстОшибки;
			Исключение
				ЗаписатьОшибкуВЖурнал(ИнформацияОбОшибке());
			КонецПопытки;
				
		КонецЕсли;
		
		ПараметрыВыполнения.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено,
			ПараметрыВыполнения.ИдентификаторФормы);
		
	ИначеЕсли Не ЭтоАдресВременногоХранилища(ПараметрыВыполнения.АдресРезультата) Тогда
		
		ШаблонТекстаОшибки = НСтр("ru = 'Указан некорректный адрес временного хранилища в параметре %1
			|функции %2.'");
		
		ТекстОшибки = СтдСтр.ПодставитьПараметрыВСтроку(
			ШаблонТекстаОшибки,
			"ПараметрыВыполнения.АдресРезультата",
			ИмяФункции);
			
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	// BSLLS:IfElseIfEndsWithElse-on
	
КонецПроцедуры

Функция МенеджерУведомленийКлиентаЛок()

	Результат = Вычислить("УведомленияКлиента");
	Возврат Результат;
	
КонецФункции

Функция СформироватьОписаниеЗадания(Задание, ПараметрыКоманды, ИнформацияОбОшибке, КлючЗадания)
	
	Результат = ОписаниеЗадания();
	
	Результат.АдресРезультата = ПараметрыКоманды.АдресРезультата;
	
	Если ИнформацияОбОшибке <> Неопределено Тогда
		Результат.ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		Результат.ТекстОшибкиПолный = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецЕсли;

	Если Задание <> Неопределено Тогда
		Результат.Завершено = (Задание.Состояние <> СостояниеФоновогоЗадания.Активно);
		Результат.УникальныйИдентификатор = Задание.УникальныйИдентификатор;
		Результат.Ключ = КлючЗадания;
	КонецЕсли;
	
	Результат.УведомлятьКлиент = ПараметрыКоманды.УведомлятьКлиент;
	
	Возврат Результат;
	
КонецФункции

Процедура ПодождатьЗавершения(Задание, ВремяОжидания)
	
	Если СтдСтр.ВерсияПлатформыБольшеИлиРавна("8.3.13") Тогда
		
		Задание = Задание.ОжидатьЗавершенияВыполнения(ВремяОжидания);
		Пока Задание.Состояние = СостояниеФоновогоЗадания.Активно Цикл
			Задание = Задание.ОжидатьЗавершенияВыполнения(ВремяОжидания);
		КонецЦикла;
		
	Иначе
		
		Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Задание.ОжидатьЗавершения(ВремяОжидания);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьОшибкуВЖурнал(ТекстОшибки)
	
	ИмяСобытия = НСтр("ru = 'Диадок.Длительные операции'");
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
КонецПроцедуры

Функция НайтиЗаданиеПоИдентификатору(УникальныйИдентификатор)
	
	Результат = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификатор);
	
	Если Результат = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Фоновое задание не найдено по идентификатору %1'");
		ТекстОшибки = СтдСтр.СтрШаблонЛок(ТекстОшибки, УникальныйИдентификатор);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьНаименованиеЗадания(ИмяМетода)

	Результат = "Диадок.ФоновоеЗадание." + ИмяМетода;
	Возврат Результат;
	
КонецФункции

Функция ДоступенМенеджерУведомленийКлиента()
	
	Результат = СтдСтр.ВерсияПлатформыБольшеИлиРавна("8.3.26");
	Возврат Результат;
	
КонецФункции

Функция ЕстьПодсистемаКонтурДиадокДлительныеОперации()
	
	ИмяПодсистемы = "КонтурДиадок.КонтурДиадокБиблиотеки.КонтурДиадокДлительныеОперации";
	Результат = СтдОбщегоНазначения.ПодсистемаСуществуетЛок(ИмяПодсистемы);
	
	Возврат Результат;
		
КонецФункции

Функция ЕстьОбщийМодульДиадок_ФоновыеЗадания()

	ИмяМодуля = "Диадок_ФоновыеЗадания";
	Результат = (Метаданные.ОбщиеМодули.Найти(ИмяМодуля) <> Неопределено);
	Возврат Результат;

КонецФункции

Функция ЕстьОбщийМодульСтандартныеПодсистемыСервер()
	
	ИмяМодуля = "СтандартныеПодсистемыСервер";
	Результат = (Метаданные.ОбщиеМодули.Найти(ИмяМодуля) <> Неопределено);
	Возврат Результат;

КонецФункции

Функция ЕстьПодходящаяВерсияБСП()

	Результат = Ложь;
	
	МинимальнаяВерсияБСП = "2.3.7";
	ТекущаяВерсияБСП = ТекущаяВерсияБСП();
	
	Если СтдСтр.СравнитьВерсииЛок(ТекущаяВерсияБСП, МинимальнаяВерсияБСП) >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ИспользоватьНовыеМетодыПрограммногоИнтерфейсаБСП()
	
	Результат = Ложь;
	
	МинимальнаяВерсияБСП = "3.1.11.323";
	ТекущаяВерсияБСП = ТекущаяВерсияБСП();
	
	Если СтдСтр.СравнитьВерсииЛок(ТекущаяВерсияБСП, МинимальнаяВерсияБСП) >= 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВозможенЗапускЧерезБСП()
	
	// В файловом режиме работы 1С в БСП не запускается фоновое задание, если уже есть другие активные задания
	// По этой причине пока отказались от использования БСП в файловом режиме работы 1С
	
	Результат = Ложь;
		
	Если _Обработка <> Неопределено
		И НЕ ЭтоФайловыйРежимРаботы1СПредприятия() Тогда
		
		Если ЕстьПодходящаяВерсияБСП() Тогда
			
			ЭтоСсылкаНаСправочник = Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(_Обработка));
			Если ЭтоСсылкаНаСправочник Тогда
				Результат = (ВРег(_Обработка.Метаданные().Имя) = ВРег("ДополнительныеОтчетыИОбработки"));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекущаяВерсияБСП()
	
	Результат = "0.0.0";
	
	Если НЕ ЕстьОбщийМодульСтандартныеПодсистемыСервер() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		МенеджерОбъекта = СтдОбщегоНазначения.ОбщийМодульЛок("СтандартныеПодсистемыСервер");
		Результат = МенеджерОбъекта.ВерсияБиблиотеки();
	Исключение
		Результат = "0.0.0";
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ВозможенЗапускЧерезПодсистемуХраненияДиадок()
	
	Результат = _Обработка <> Неопределено
		И ЕстьОбщийМодульДиадок_ФоновыеЗадания();
		
	Возврат Результат;

КонецФункции

Функция ВозможенЗапускЧерезПодсистемуДлительныхОпераций()
	
	Результат = _Обработка = Неопределено
		И ЕстьПодсистемаКонтурДиадокДлительныеОперации();
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоФайловыйРежимРаботы1СПредприятия()
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	
	ДлинаИзвлекаемойПодстроки = 5;
	Результат = (ВРег(Лев(СтрокаСоединения, ДлинаИзвлекаемойПодстроки)) = "FILE=");
	
	Возврат Результат;
	
КонецФункции

// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MissingReturnedValueDescription-off

Функция ПараметрыВМассивЛок(П0, П1 = Null, П2 = Null, П3 = Null, П4 = Null)

// BSLLS:NumberOfOptionalParams-on
// BSLLS:MissingParameterDescription-on
// BSLLS:MissingReturnedValueDescription-off
	
	ЧислоПараметров = 5;
	Результат = Новый Массив(ЧислоПараметров);
	
	Результат[0] = П0;
	Результат[1] = П1;
	Результат[2] = П2;
	Результат[3] = П3;
	Результат[4] = П4;
	
	Для Сч = - Результат.ВГраница() По 0 Цикл
		
		Если Результат[ - Сч] = Null Тогда
			Результат.Удалить(- Сч);
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция ЭтоВнешняяОбработка()
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ИспользуемоеИмяФайла");
	ЗаполнитьЗначенияСвойств(ПараметрыПроверки, ЭтотОбъект);
	
	Возврат ПараметрыПроверки.ИспользуемоеИмяФайла <> Неопределено;
	
КонецФункции // ЭтоВнешняяОбработка

Функция СобратьПеречислениеСлужебный(Строка)
	
	Результат = Новый Структура(Строка);
	Для Каждого Эл Из Результат Цикл
		Результат[Эл.Ключ] = Эл.Ключ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Инициализация

Процедура __Инит__(Мета)
	
	ПрефиксТипа = "";
	Если ЭтоВнешняяОбработка() Тогда
		ПрефиксТипа = "External";
	КонецЕсли;
	
	// BSLLS:UnusedLocalVariable-off
	_Обработка = Неопределено;

	СтдСтр = Новый(ПрефиксТипа + "DataProcessorObject.КонтурДиадокСтдСтр");
	СтдОбщегоНазначения = Новый(ПрефиксТипа + "DataProcessorObject.КонтурДиадокСтдОбщегоНазначения");
	
	_ПеречислениеВариантыЗапуска = ПеречислениеВариантыЗапуска();
	_ВариантЗапуска = Неопределено;
	_МенеджерУведомленийДоступен = ДоступенМенеджерУведомленийКлиента();
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры // __Инит__

__Инит__(Метаданные());
