
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		ПараметрыВыполненияКоманды.Источник.РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	РезультатВыполнения = СформироватьФайлыОбменаПоДокументамСервер(ПараметрКоманды);
	
	Если НЕ РезультатВыполнения.Успешно Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьООшибкиВыполненияФункции(РезультатВыполнения);
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив")
		И ПараметрКоманды.Количество() > 0 Тогда
		
		Для Каждого ДокументСсылка Из ПараметрКоманды Цикл
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОповеститьОбИзмененииДокумента(ДокументСсылка);
		КонецЦикла;
		
		ОповеститьОбИзменении(ТипЗнч(ПараметрКоманды[0]));
		Оповестить("КонтурЛогистика_ОбновитьЗадачи", ПараметрКоманды);
		
		// показать сформированные файлы
		Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") И РезультатВыполнения.МассивФайловОбмена.Количество() > 0 Тогда
			
			СписокФайлов = Новый СписокЗначений;
			СписокФайлов.ЗагрузитьЗначения(РезультатВыполнения.МассивФайловОбмена);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ОтборСписокФайлов", СписокФайлов);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"Справочник.КонтурЛогистика_ФайлыОбмена.Форма.ФормаСписка",
				ПараметрыФормы,
				ПараметрыВыполненияКоманды.Источник);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьФайлыОбменаПоДокументамСервер(МассивДокументов)
		
	Возврат КонтурЛогистика_ОбработкаДокументовСервер.СформироватьФайлыОбменаПоМассивуДокументов(МассивДокументов);	
	
КонецФункции
