
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(
		ЭтотОбъект,
		МассивНепроверяемыхРеквизитов,
		Отказ);
		
	НоменклатураСервер.ПроверитьЗаполнениеСерий(
		ЭтотОбъект,
		НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаявкаНаКонтрольКачестваТоваров),
		Отказ,
		МассивНепроверяемыхРеквизитов);
		
	СкладыСервер.ПроверитьЗаполнениеПомещений(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	СкладыСервер.ПроверитьЗаполнениеЯчеек(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	
	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверки.ПроверитьКомплектностьТоварныхМест = Истина;
	ПараметрыПроверки.ПоляГруппировкиПроверкиКомплектности = "КонтролируемаяПартия,КачествоПодтверждено,Назначение,Склад,Помещение";
	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, ПараметрыПроверки);
	
	// Проверка заполнения упаковок номенклатуры на адресных складах
	ВыборкаСкладПомещение = КонтрольКачества.ВыборкаСкладПомещение(Товары.Выгрузить(,"Склад,Помещение"), Дата);
	Пока ВыборкаСкладПомещение.Следующий() Цикл
		ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияУпаковок();
		ПараметрыПроверки.ОтборПроверяемыхСтрок.Вставить("Склад", ВыборкаСкладПомещение.Склад);
		ПараметрыПроверки.ОтборПроверяемыхСтрок.Вставить("Помещение", ВыборкаСкладПомещение.Помещение);
		НоменклатураСервер.ПроверитьЗаполнениеУпаковок(
			ЭтотОбъект,
			МассивНепроверяемыхРеквизитов,
			Отказ,
			ПараметрыПроверки);
	КонецЦикла;
	
	Если МассивНепроверяемыхРеквизитов.Найти("Товары.Упаковка") = Неопределено Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Упаковка");
	КонецЕсли;
	
	Если Не ПланироватьРазблокировкуТоваров Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаПодтвержденияКачества");
	КонецЕсли;
	
	Если ПричинаБлокировкиТовара <> Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КонтролируемаяПартия");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	// Механизм "Контролируемые партии".
	// Заявка всегда делает движения по Товары на складах, поэтому партия нужна всегда.
	КлючевыеРеквизиты = КонтрольКачества.РеквизитыОпределенияНеобходимостиПартииВДокументе(Неопределено, Неопределено);
	КонтрольКачества.ЗаполнитьКонтролируемуюПартиюПередЗаписьюДокумента(ЭтотОбъект, КлючевыеРеквизиты);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
	// Механизм "Контролируемые партии".
	КонтрольКачества.СоздатьОбновитьКонтролируемуюПартиюПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;
	КонтролируемаяПартия = Справочники.КонтролируемыеПартии.ПустаяСсылка();
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		ЗаполнитьНаОснованииПриобретенияТоваровУслуг(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		ЗаполнитьНаОснованииПриобретенияТоваровУслуг(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровНаСклад") Тогда
		ЗаполнитьНаОснованииПоступленияТоваровНаСклад(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровОтКлиента") Тогда
		ЗаполнитьНаОснованииПоступленияТоваровОтКлиента(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровОтХранителя") Тогда
		ЗаполнитьНаОснованииПоступленияТоваровОтХранителя(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		ЗаполнитьНаОснованииВозвратаТоваровОтКлиента(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СборкаТоваров") Тогда
		ЗаполнитьНаОснованииСборкиТоваров(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") Тогда
		ЗаполнитьНаОснованииПриемкиТоваровНаХранение(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПрочееОприходованиеТоваров") Тогда
		ЗаполнитьНаОснованииПрочегоОприходованияТоваров(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ЗаполнитьНаОснованииПеремещенияТоваров(ДанныеЗаполнения);
	КонецЕсли;
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьНаОснованииПриобретенияТоваровУслуг(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПоступленияТоваровНаСклад(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПоступленияТоваровОтКлиента(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПоступленияТоваровОтХранителя(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииВозвратаТоваровОтКлиента(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииСборкиТоваров(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры
Процедура ЗаполнитьНаОснованииПриемкиТоваровНаХранение(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПрочегоОприходованияТоваров(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры


Процедура ЗаполнитьНаОснованииПеремещенияТоваров(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	ПланироватьРазблокировкуТоваров = Истина;
	Если Товары.Количество() = 0 Тогда
		Склад = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад);
	Иначе
		КонтрольКачества.ЗаполнитьОчиститьСкладПомещениеПоДаннымТабличнойЧастиДокумента(ЭтотОбъект);
	КонецЕсли;
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Ответственный, Подразделение);
	Автор = Пользователи.ТекущийПользователь();
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если Товары.Количество() > 0 Тогда
		ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаявкаНаКонтрольКачестваТоваров);
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли