#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Элементы.Найти("ОписанияОпасныхГрузовСинхронизироватьСоСправочникомУчетнойСистемы") <> Неопределено Тогда
		Элементы.ОписанияОпасныхГрузовСинхронизироватьСоСправочникомУчетнойСистемы.Видимость = ДоступностьКомандыСинхронизации();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	ДополнительныеПараметры = Новый Структура;
	Если Копирование Тогда
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Код", Элемент.ТекущиеДанные.Код);
		ЗначенияЗаполнения.Вставить("Наименование", Элемент.ТекущиеДанные.Наименование);
		ДополнительныеПараметры.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	
	ТекстВопроса = "Есть возможность подобрать опасный груз из классификатора.
		|Подобрать?";
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(
		ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, ЭтаФорма, "ВопросЗавершение", ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборИзКлассификатора(Команда)
	
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_ОписанияОпасныхГрузов.Форма.ДобавлениеЭлементовВКлассификатор";
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника,, ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ПодборИзКлассификатора(Неопределено);
	Иначе
		ИмяФормыСправочника = "Справочник.КонтурЛогистика_ОписанияОпасныхГрузов.ФормаОбъекта";
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(ИмяФормыСправочника, ДополнительныеПараметры, ЭтаФорма, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступностьКомандыСинхронизации()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СправочникМетаданные = Метаданные.НайтиПоПолномуИмени("Справочник.КлассификаторДОПОГЭПД");
	
	Если СправочникМетаданные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторДОПОГЭПД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторДОПОГЭПД КАК КлассификаторДОПОГЭПД
	|ГДЕ
	|	НЕ КлассификаторДОПОГЭПД.ПометкаУдаления";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти