
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ОтборДокумент) Тогда 
		ОтборДокумент = Параметры.ОтборДокумент;
	КонецЕсли;
	
	ОбновитьПараметрыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СписокГлавныйГруппаПодробно.Видимость = Ложь;
	
	ОбновитьКартинкиКомандПоказа();
	
КонецПроцедуры

&НаСервере
Процедура ОтборДокументПриИзмененииНаСервере()
	
	ОбновитьПараметрыДинамическогоСписка();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыДинамическогоСписка()
	
	Перем ДокументГлавный, ДокументТитул;
	
	Если ЗначениеЗаполнено(ОтборДокумент) Тогда 
		
		Если ТипЗнч(ОтборДокумент) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная") Тогда
			
			ДокументГлавный = ОтборДокумент;
			ДокументТитул = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПоследнийПоДатеТитулЭТРН(ДокументГлавный); 
			
		ИначеЕсли ТипЗнч(ОтборДокумент) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектронныйЗаказНаряд") Тогда
			
			ДокументГлавный = ОтборДокумент;
			ДокументТитул = Документы.КонтурЛогистика_ЭлектронныйЗаказНаряд.ПоследнийПоДатеТитул(ДокументГлавный);
			
		Иначе
			
			ДокументТитул = ОтборДокумент;
			ТипТитула = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(ДокументТитул);
			
			Если ЗначениеЗаполнено(ТипТитула) Тогда
				
				Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(ТипТитула) Тогда
					ДокументГлавный = ДокументТитул.ДокументЭТРН;
				ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ(ТипТитула)
					Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЗЗ(ТипТитула)
					Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоДФ(ТипТитула)
					Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЭР(ТипТитула) Тогда
					
					Если ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
						Или ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02
						Или ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
						Или ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка Тогда
						
						ДокументГлавный = ДокументТитул;
					Иначе
						ДокументГлавный = ДокументТитул.Титул1;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ДокументТитул = Неопределено;
		ДокументГлавный = Неопределено;
		
	КонецЕсли;
	
	СписокТитул.Параметры.УстановитьЗначениеПараметра("ДокументТитул", ДокументТитул);
	СписокГлавный.Параметры.УстановитьЗначениеПараметра("ДокументГлавный", ДокументГлавный);

КонецПроцедуры

&НаКлиенте
Процедура ОтборДокументПриИзменении(Элемент)
	
	ОтборДокументПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокГлавныйДопИнформацияПоказать(Команда)
	
	Элементы.СписокГлавныйГруппаПодробно.Видимость = Не Элементы.СписокГлавныйГруппаПодробно.Видимость;
	
	ОбновитьКартинкиКомандПоказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКартинкиКомандПоказа()
	
	КартинкаПоказать = БиблиотекаКартинок.КонтурЛогистика_Показать;
	КартинкаСкрыть = БиблиотекаКартинок.КонтурЛогистика_Скрыть;
	
	Если Элементы.СписокГлавныйГруппаПодробно.Видимость Тогда
		Элементы.СписокГлавныйДопИнформацияПоказать.Картинка = КартинкаСкрыть;
	Иначе
		Элементы.СписокГлавныйДопИнформацияПоказать.Картинка = КартинкаПоказать;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокГлавныйВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокГлавныйСостояние" Тогда
		ПоказатьЗначение(, Элементы.СписокГлавный.ТекущиеДанные.Состояние);
	ИначеЕсли Поле.Имя = "СписокГлавныйДокумент" Тогда
		ПоказатьЗначение(, Элементы.СписокГлавный.ТекущиеДанные.Документ);
	ИначеЕсли Поле.Имя = "СписокГлавныйФайлОбмена" Тогда
		ПоказатьЗначение(, Элементы.СписокГлавный.ТекущиеДанные.ФайлОбмена);
	КонецЕсли;
	
КонецПроцедуры
