// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборПоУчетнойЗаписи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры.Отбор, "УчетнаяЗаписьЦентраЭДО"); // СправочникСсылка.УчетныеЗаписиЦентровЭДО
	Если ЗначениеЗаполнено(ОтборПоУчетнойЗаписи) Тогда
		УчетнаяЗаписьЦентраЭДО = ОтборПоУчетнойЗаписи;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"УчетнаяЗаписьЦентраЭДО", "Видимость", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	ПараметрыПодключения = ИнтеграцияЦентраЭДОКлиент.НовыеПараметрыПодключенияЦентраЭДО();
	ПараметрыПодключения.НовоеПодключение = Ложь;
	
	Если ЗначениеЗаполнено(УчетнаяЗаписьЦентраЭДО) Тогда
		ПараметрыПодключения.УчетнаяЗапись = УчетнаяЗаписьЦентраЭДО;
	ИначеЕсли Копирование Тогда 
		ПараметрыПодключения.УчетнаяЗапись = ТекущиеДанные.УчетнаяЗаписьЦентраЭДО;
	КонецЕсли;
	
	Если Копирование Тогда
		ПараметрыПодключения.Логин = ТекущиеДанные.Логин;
	КонецЕсли;
	
	ИнтеграцияЦентраЭДОКлиент.ПодключитьЦентрЭДО(,ПараметрыПодключения);
	
КонецПроцедуры

#КонецОбласти
