#Область ПрограммныйИнтерфейс

// Добавить дней.
// 
// Параметры:
//  ДатаВремя - Дата - Дата время
//  КоличествоДней - Число - Количество дней
// 
// Возвращаемое значение:
//  Дата - Дата 
Функция ДобавитьДней(ДатаВремя, КоличествоДней) Экспорт

	Возврат ДатаВремя + 60 * 60 * 24 * КоличествоДней;

КонецФункции

// Новый описание типов число.
// 
// Параметры:
//  Длина - Число -  Длина
//  Точность - Число -  Точность
//  НеОтрицательное - Булево -  Не отрицательное
// 
// Возвращаемое значение:
//  ОписаниеТипов -  Новый описание типов число
Функция Новый_ОписаниеТиповЧисло(Длина = 15, Точность = 2, НеОтрицательное = Ложь) Экспорт
	Знак = ?(НеОтрицательное, ДопустимыйЗнак.Неотрицательный, ДопустимыйЗнак.Любой);
	Возврат Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(Длина, Точность, Знак));
КонецФункции

// Новый описание типов строка.
// 
// Параметры:
//  Длина - Неопределено -  Длина
// 
// Возвращаемое значение:
//  ОписаниеТипов -  Новый описание типов строка
Функция Новый_ОписаниеТиповСтрока(Длина = 0) Экспорт
	Возврат Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(Длина));
КонецФункции

// Новый описание типов дата.
// 
// Параметры:
//  ВключаяВремя - Булево -  Включая время
// 
// Возвращаемое значение:
//  ОписаниеТипов -  Новый описание типов дата
Функция Новый_ОписаниеТиповДата(ВключаяВремя = Истина) Экспорт
	Время = ?(ВключаяВремя, ЧастиДаты.ДатаВремя, ЧастиДаты.Дата);
	Возврат Новый ОписаниеТипов("Строка", , , , , Новый КвалификаторыДаты(Время));
КонецФункции

// Возвращает значение свойства структуры.
//
// Параметры:
//   Структура - Структура
//             - ФиксированнаяСтруктура - объект, из которого необходимо прочитать значение ключа.
//   Ключ - Строка - имя свойства структуры, для которого необходимо прочитать значение.
//   ЗначениеПоУмолчанию - Произвольный - возвращается когда в структуре нет значения по указанному
//                                        ключу.
//       Для скорости рекомендуется передавать только быстро вычисляемые значения (например примитивные типы),
//       а инициализацию более тяжелых значений выполнять после проверки полученного значения (только если это
//       требуется).
//
// Возвращаемое значение:
//   Произвольный - значение свойства структуры. ЗначениеПоУмолчанию если в структуре нет указанного свойства.
//
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если Структура = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Результат = ЗначениеПоУмолчанию;
	Если Структура.Свойство(Ключ, Результат) Тогда
		Возврат Результат;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецФункции

// Создает копию значения типа Структура
//
// Параметры:
//  СтруктураИсточник - Структура - копируемая структура.
// 
// Возвращаемое значение:
//  Структура - копия исходной структуры.
//
Функция СкопироватьСтруктуру(СтруктураИсточник) Экспорт
	
	СтруктураРезультат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураИсточник Цикл
		СтруктураРезультат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Возврат СтруктураРезультат;
	
КонецФункции

#КонецОбласти