&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтображатьДополнитильныеРекизитыУчСист") Тогда
		
		Элементы.ГруппаУстановка.Видимость = Параметры.ОтображатьДополнитильныеРекизитыУчСист;
		Элементы.УстановитьРасширение.Видимость = Параметры.ОтображатьДополнитильныеРекизитыУчСист;
		
		Элементы.СообщениеУдаление.Видимость = Не Параметры.ОтображатьДополнитильныеРекизитыУчСист;
				
		Элементы.ГруппаНоваяВерсия.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ДоступноНовоеОбновление") И Параметры.Свойство("НомерВерсии") Тогда
		
		Элементы.ГруппаУстановка.Видимость = Ложь;
		Элементы.УстановитьРасширение.Видимость = Истина;
		
		Элементы.СообщениеУдаление.Видимость = Ложь;
				
		Элементы.ГруппаНоваяВерсия.Видимость = Истина;
		Элементы.СообщениеНоваяВерсия.Заголовок = "Доступна новая версия " + Параметры.НомерВерсии;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасширение(Команда)
	Закрыть("УстановитьРасширение");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуДляНовойВерсии(Команда)
	КонтурЛогистика_ИнтеграцияДиадокКлиент.ПерейтиПоСсылке("https://support.kontur.ru/logistika-1s/53789-rasshirenie_s_dopolnitelnymi_rekvizitami");
КонецПроцедуры


