#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ДокументСсылка") Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьОтправкуВТелеграм = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
	ИспользоватьОтправкуНаПочту = НастройкиОтправкиПочтыЗаполнены();
	
	ПараметрыОтправки = КонтурЛогистика_Уведомления.ДанныеПоДокументу(Параметры.ДокументСсылка);
	
	Письмо = РегистрыСведений.КонтурЛогистика_ОчередьОтправкиQRКодов.СформироватьПисьмо(ПараметрыОтправки);
	
	kl_id = ПараметрыОтправки.kl_id;
	УИДМинтранса = ПараметрыОтправки.УИДМинтранса;
	Сотрудник1 = ПараметрыОтправки.Сотрудник1;
	Телефон1 = ПараметрыОтправки.Телефон1;
	АдресПочтыСотрудника1 = ПараметрыОтправки.АдресПочтыСотрудника1;
	Сотрудник2 = ПараметрыОтправки.Сотрудник2;
	Телефон2 = ПараметрыОтправки.Телефон2;
	АдресПочтыСотрудника2 = ПараметрыОтправки.АдресПочтыСотрудника2;
	ТемаПисьма = Письмо.Тема;
	
	АдресХранилищаПисьма = ПоместитьВоВременноеХранилище(Письмо, УникальныйИдентификатор);
	АдресХранилищаПараметровОтправки = ПоместитьВоВременноеХранилище(ПараметрыОтправки, УникальныйИдентификатор);
	
	ЭтоЭТрН = (КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(Параметры.ДокументСсылка)
		Или ТипЗнч(Параметры.ДокументСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная"));
	ЭтоЭПЛ = КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(Параметры.ДокументСсылка);
	ЭтоЭПЛ_5_02 = КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ_5_02(Параметры.ДокументСсылка);
	
	ОрганизацияДиадок = РегистрыСведений.КонтурЛогистика_ОчередьОтправкиQRКодов.АвторизованнаяОрганизацияПоДокументу(
		ПараметрыОтправки.Документ);
	
	Если Не ЗначениеЗаполнено(kl_id) Тогда
		kl_id = КонтурЛогистика_Уведомления.ИдентификаторДокументаЛогистикиИзФайлов(Параметры.ДокументСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыСервиса(ОрганизацияСсылка)
	
	Возврат КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(ОрганизацияСсылка);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаОтветСервиса.Видимость = ЗначениеЗаполнено(ТекстОтветаСервиса);
	
	ПараметрыСервиса = ПолучитьПараметрыСервиса(ОрганизацияДиадок);
	Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибка;
		Элементы.ФормаОтправить.Видимость = Ложь;
		Элементы.ФормаПовторить.Видимость = Ложь;
		Элементы.УИДМинтранс.Видимость = ЗначениеЗаполнено(УИДМинтранса);
		Элементы.kl_id.Видимость = ЗначениеЗаполнено(kl_id);
		Элементы.НадписьОшибка.Видимость = Ложь;
		Элементы.НадписьОшибкаKLID.Видимость = Ложь;
		
		Если ПараметрыСервиса.РежимАвторизации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow") Тогда
			Элементы.НадписьОшибкаАвторизации.Видимость = Истина;
			Элементы.НадписьОшибкаАпикей.Видимость = Ложь;
		Иначе
			Элементы.НадписьОшибкаАвторизации.Видимость = Ложь;
			Элементы.НадписьОшибкаАпикей.Видимость = Истина;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УИДМинтранса) Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибка;
		Элементы.ФормаОтправить.Видимость = Ложь;
		Элементы.ФормаПовторить.Видимость = Ложь;
		Элементы.УИДМинтранс.Видимость = ЗначениеЗаполнено(УИДМинтранса);
		Элементы.kl_id.Видимость = ЗначениеЗаполнено(kl_id);
		Элементы.НадписьОшибка.Видимость = Истина;
		Элементы.НадписьОшибкаАвторизации.Видимость = Ложь;
		Элементы.НадписьОшибкаАпикей.Видимость = Ложь;
		Элементы.НадписьОшибкаKLID.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ПолучитьQRКод();
	
	ОбновитьВидемостьДоступность();
	
	Если ИспользоватьОтправкуВТелеграм Тогда
		Если ЗначениеЗаполнено(Телефон1) Тогда
			ПроверитьРегистрациюТелефона1Телеграм();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Телефон2) Тогда
			ПроверитьРегистрациюТелефона2Телеграм();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_Сотрудники" Тогда
		
		Если Параметр = Сотрудник1 Тогда
			АдресПочтыСотрудника1 = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Сотрудник1, "АдресЭлектроннойПочты");
		КонецЕсли;
		
		Если Параметр = Сотрудник2 Тогда
			АдресПочтыСотрудника2 = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Сотрудник2, "АдресЭлектроннойПочты");
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзменениеОбщейНастройки"
		И Параметр = "ИспользоватьОтправкуВТелеграм" Тогда
		
		ИспользоватьОтправкуВТелеграм = ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
		ОбновитьВидемостьДоступность();
		
		Если ЗначениеЗаполнено(Телефон1) Тогда
			ПроверитьРегистрациюТелефона1Телеграм();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Телефон2) Тогда
			ПроверитьРегистрациюТелефона2Телеграм();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзменениеНастройкиУчетнойЗаписиЭлектроннойПочты" Тогда
		
		ИспользоватьОтправкуНаПочту = НастройкиОтправкиПочтыЗаполнены();
		ОбновитьВидемостьДоступность();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Водитель1ПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Сотрудник1) Тогда
		АдресПочтыСотрудника1 = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Сотрудник1, "АдресЭлектроннойПочты");
	КонецЕсли;
	
	ОбновитьВидемостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура Водитель2ПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Сотрудник2) Тогда
		АдресПочтыСотрудника2 = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Сотрудник2, "АдресЭлектроннойПочты");
	КонецЕсли;
	
	ОбновитьВидемостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура Сотрудник1Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаВыбора",,
		ЭтаФорма, ЭтаФорма, "ВыборСотрудника1");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСотрудника1(Результат, ДополнительныеПараметры) Экспорт
	
	Сотрудник1 = Результат;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗначенияРеквизитов = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
			Сотрудник1, "АдресЭлектроннойПочты, ТелефонОсновной");
		
		АдресПочтыСотрудника1 = ЗначенияРеквизитов.АдресЭлектроннойПочты;
		Телефон1 = ЗначенияРеквизитов.ТелефонОсновной;
	Иначе
		АдресПочтыСотрудника1 = "";
		Телефон1 = "";
	КонецЕсли;
	
	Если ИспользоватьОтправкуВТелеграм Тогда
		Если ЗначениеЗаполнено(Телефон1) Тогда
			ПроверитьРегистрациюТелефона1Телеграм();
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьВидемостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура Сотрудник2Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаВыбора",,
		ЭтаФорма, ЭтаФорма, "ВыборСотрудника2");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСотрудника2(Результат, ДополнительныеПараметры) Экспорт
	
	Сотрудник2 = Результат;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗначенияРеквизитов = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
			Сотрудник2, "АдресЭлектроннойПочты, ТелефонОсновной");
		
		АдресПочтыСотрудника2 = ЗначенияРеквизитов.АдресЭлектроннойПочты;
		Телефон2 = ЗначенияРеквизитов.ТелефонОсновной;
	Иначе
		АдресПочтыСотрудника2 = "";
	КонецЕсли;
	
	Если ИспользоватьОтправкуВТелеграм Тогда
		Если ЗначениеЗаполнено(Телефон2) Тогда
			ПроверитьРегистрациюТелефона2Телеграм();
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьВидемостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодключитьТелеграм1Нажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_QRКодБотаКаналаТелеграм",,
		ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодключитьТелеграм2Нажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_QRКодБотаКаналаТелеграм",,
		ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Телефон1ПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Телефон1) Тогда
		ПроверитьРегистрациюТелефона1Телеграм();
	Иначе
		ОбновитьВидимостьГруппыТелеграм();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Телефон2ПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Телефон2) Тогда
		ПроверитьРегистрациюТелефона2Телеграм();
	Иначе
		ОбновитьВидимостьГруппыТелеграм();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	
	Если ИспользоватьОтправкуВТелеграм Тогда
		ОтправитьВТелеграм = ЗначениеЗаполнено(Телефон1) Или ЗначениеЗаполнено(Телефон2);
	Иначе
		ОтправитьВТелеграм = Ложь;
	КонецЕсли;
	
	Если ИспользоватьОтправкуНаПочту Тогда
		ОтправитьНаПочту = ЗначениеЗаполнено(АдресПочтыСотрудника1) Или ЗначениеЗаполнено(АдресПочтыСотрудника2);
	Иначе
		ОтправитьНаПочту = Ложь;
	КонецЕсли;
	
	Если Не ОтправитьВТелеграм И Не ОтправитьНаПочту Тогда
		Сообщить("Не заполнены адреса и телефоны отправки");
		Возврат;
	КонецЕсли;
	
	Успех = ОтправитьПисьмаИСообщенияВТелеграм();
	
	Если Успех Тогда
		Закрыть();
		ПоказатьОповещениеПользователя("QR-код отправлен.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Повторить(Команда)
	
	ПолучитьQRКод();
	
	ОбновитьВидемостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Сотрудник1НеЗаполнен(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаВыбора",,
		ЭтаФорма, ЭтаФорма, "ВыборСотрудника1");
	
КонецПроцедуры

&НаКлиенте
Процедура Сотрудник2НеЗаполнен(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаВыбора",,
		ЭтаФорма, ЭтаФорма, "ВыборСотрудника2");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтправкуВТелеграм(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ПолучитьНастройкуПоИмениПредопределенного("ИспользоватьОтправкуВТелеграм"));
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_Настройки.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, ЭтаФорма,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтправкуНаПочту(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_НастройкаУчетнойЗаписиЭлектроннойПочты",, ЭтаФорма, ЭтаФорма,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидемостьДоступность()
	
	Если ЗначениеЗаполнено(Сотрудник1) Тогда
		Элементы.Сотрудник1.Видимость = Истина;
		Элементы.Сотрудник1НеЗаполнен.Видимость = Ложь;
	Иначе
		Элементы.Сотрудник1.Видимость = Ложь;
		Элементы.Сотрудник1НеЗаполнен.Видимость = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сотрудник2) Тогда
		Элементы.Сотрудник2.Видимость = Истина;
		Элементы.Сотрудник2НеЗаполнен.Видимость = Ложь;
	Иначе
		Элементы.Сотрудник2.Видимость = Ложь;
		Элементы.Сотрудник2НеЗаполнен.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ГруппаТелефон1.Видимость = ИспользоватьОтправкуВТелеграм;
	Элементы.ГруппаНастройкиТелеграм.Видимость = Не ИспользоватьОтправкуВТелеграм;
	Элементы.ГруппаТелефон2.Видимость = ИспользоватьОтправкуВТелеграм;
	Элементы.ДекорацияЗаглушкаТелефон.Видимость = Не ИспользоватьОтправкуВТелеграм;
	
	Элементы.АдресПочтыСотрудника1.Видимость = ИспользоватьОтправкуНаПочту;
	Элементы.ГруппаНастройкиПочты.Видимость = Не ИспользоватьОтправкуНаПочту;
	Элементы.АдресПочтыСотрудника2.Видимость = ИспользоватьОтправкуНаПочту;
	Элементы.ДекорацияЗаглушкаПочта.Видимость = Не ИспользоватьОтправкуНаПочту;
	
	Элементы.ГруппаСотрудник1.Видимость = (ИспользоватьОтправкуВТелеграм Или ИспользоватьОтправкуНаПочту);
	Элементы.ГруппаСотрудник2.Видимость = (ИспользоватьОтправкуВТелеграм Или ИспользоватьОтправкуНаПочту);
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибка
		И ЗначениеЗаполнено(УИДМинтранса) Тогда
		
		Элементы.ФормаПовторить.Видимость = Истина;
	Иначе
		Элементы.ФормаПовторить.Видимость = Ложь;
	КонецЕсли;
	
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьQRКод()
	
	ТекстОтветаСервиса = "";
	
	АдресХранилищаДвоичныхДанных = ПоместитьВоВременноеХранилище(, УникальныйИдентификатор);
	
	Если Не ЗначениеЗаполнено(kl_id) Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибка;
		Элементы.ФормаОтправить.Видимость = Ложь;
		Элементы.ФормаПовторить.Видимость = Ложь;
		Элементы.УИДМинтранс.Видимость = ЗначениеЗаполнено(УИДМинтранса);
		Элементы.kl_id.Видимость = ЗначениеЗаполнено(kl_id);
		Элементы.НадписьОшибка.Видимость = Ложь;
		Элементы.НадписьОшибкаАвторизации.Видимость = Ложь;
		Элементы.НадписьОшибкаАпикей.Видимость = Ложь;
		Элементы.НадписьОшибкаKLID.Видимость = Истина;
		Элементы.ГруппаОтветСервиса.Видимость = ЗначениеЗаполнено(ТекстОтветаСервиса);
		Возврат;
	КонецЕсли;
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("kl_id", kl_id);
	Если ЗначениеЗаполнено(ОрганизацияДиадок) Тогда
		ПараметрыФоновогоЗадания.Вставить("ОрганизацияДиадок", ОрганизацияДиадок);
	Иначе
		ПараметрыФоновогоЗадания.Вставить("ОрганизацияДиадок", Неопределено);
	КонецЕсли;
	
	Если ЭтоЭТрН Тогда
		ИмяМетода = "КонтурЛогистика_ДлительныеОперацииСервер.ПолучитьQRКодЭТрНGIFФайла";
	ИначеЕсли ЭтоЭПЛ Или ЭтоЭПЛ_5_02 Тогда
		ИмяМетода = "КонтурЛогистика_ДлительныеОперацииСервер.ПолучитьQRКодЭПЛGIFФайла";
	Иначе
		ВызватьИсключение "Не удалось определить тип документа";
	КонецЕсли;
	
	РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание(
		ИмяМетода, ПараметрыФоновогоЗадания,, "Получение QR-кода", АдресХранилищаДвоичныхДанных);
	
	Если РезультатЗапуска.Статус = "Выполняется" Тогда
		
		ИдентификаторЗадания = РезультатЗапуска.ИдентификаторЗадания;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОжидание;
		Элементы.ФормаОтправить.Видимость = Ложь;
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание", 0.1, Истина);
		
	ИначеЕсли РезультатЗапуска.Статус = "Выполнено" Тогда
		
		ОбработатьРезультатКлиент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтправитьПисьмаИСообщенияВТелеграм()
	
	УспехОтправкиНаПочту = Истина;
	УспехОтправкиВТелеграм = Истина;
	
	ДвоичныеДанныеQRКода = ПолучитьИзВременногоХранилища(АдресХранилищаДвоичныхДанных);
	
	Если ИспользоватьОтправкуНаПочту
		И (ЗначениеЗаполнено(АдресПочтыСотрудника1) Или ЗначениеЗаполнено(АдресПочтыСотрудника2)) Тогда
		
		УспехОтправкиНаПочту = ОтправитьПисьмо(ДвоичныеДанныеQRКода);
	КонецЕсли;
	
	Если ИспользоватьОтправкуВТелеграм
		И (ЗначениеЗаполнено(Телефон1) Или ЗначениеЗаполнено(Телефон2)) Тогда
		
		УспехОтправкиВТелеграм = ОтправитьВТелеграм(ДвоичныеДанныеQRКода);
	КонецЕсли;
	
	Возврат (УспехОтправкиНаПочту И УспехОтправкиВТелеграм);
	
КонецФункции

&НаСервере
Функция ОтправитьПисьмо(ДвоичныеДанныеQRКода)
	
	Письмо = ПолучитьИзВременногоХранилища(АдресХранилищаПисьма);
	Письмо.Получатели.Очистить();
	Если ЗначениеЗаполнено(АдресПочтыСотрудника1) Тогда
		Письмо.Получатели.Добавить(АдресПочтыСотрудника1);
	КонецЕсли;
	Если ЗначениеЗаполнено(АдресПочтыСотрудника2) Тогда
		Письмо.Получатели.Добавить(АдресПочтыСотрудника2);
	КонецЕсли;
	
	Вложение = Письмо.Вложения.Добавить(ДвоичныеДанныеQRКода, "QR");
	Вложение.Идентификатор = "QR";
	Вложение.СпособКодирования = СпособКодированияИнтернетПочтовогоВложения.MIME;
	Вложение.ТипСодержимого = "image/gif";
	
	ТекстОшибки = КонтурЛогистика_РаботаСПочтовымиСообщениями.ОтправитьПисьмо(Письмо);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Сообщить("Не удалось отправить на почту.
			|Ошибка: " + ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОтправитьВТелеграм(ДвоичныеДанныеQRКода)
	
	ПараметрыОтправки = ПолучитьИзВременногоХранилища(АдресХранилищаПараметровОтправки);
	
	Сообщения = РегистрыСведений.КонтурЛогистика_ОчередьОтправкиQRКодов.СформироватьСообщенияВТелеграм(
		ПараметрыОтправки, ДвоичныеДанныеQRКода);
	
	ЕстьОшибки = ОтправитьВТелеграмНаТелефон(Телефон1, Сообщения);
	
	ЕстьОшибки = (ОтправитьВТелеграмНаТелефон(Телефон2, Сообщения) Или ЕстьОшибки);
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Функция ОтправитьВТелеграмНаТелефон(Телефон, Сообщения)
	
	Если Не ЗначениеЗаполнено(Телефон) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = КонтурЛогистика_РаботаСТелеграм.ОтправитьСообщения(Телефон, Сообщения);
	
	Если Результат.ЕстьОшибки Тогда
		Сообщить("Не удалось отправить в Телеграм по номеру: " + Строка(Телефон) + "
			|Ошибка: " + Результат.ТекстОшибки);
		Возврат Истина;
	КонецЕсли;
	
	Если Не Результат.ТелефонЗарегестрирован Тогда
		Сообщить("Не удалось отправить в Телеграм по номеру: " + Строка(Телефон) + "
			|Ошибка: номер телефона не зарегестрирован в Телеграм боте");
		Возврат Истина;
	КонецЕсли;
	
	Если Не Результат.СообщениеОтправлено Тогда
		Сообщить("Не удалось отправить в Телеграм по номеру: " + Строка(Телефон));
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьФоновоеЗадание() Экспорт
	
	ЗаданиеАктивно = КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(ИдентификаторЗадания, Элементы.ДекорацияЛоадерТемп);
	
	Если ЗаданиеАктивно Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание", 2, Истина);
		
	Иначе
		
		ОбработатьРезультатКлиент();
		
	КонецЕсли;
	
	ОбновитьВидемостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатКлиент()
	
	ОбработатьРезультат();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультат()
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилищаДвоичныхДанных);
	
	// До вступления в силу ЭПЛ 5.02 формируем тестовый код со строкой "Тестовая перевозка ЭПЛ 5.02"
	Если ЭтоЭПЛ_5_02 И Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДействуетФорматЭПЛ502() Тогда
		
		Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ТестовыйQRКодДляЭПЛ502();			
		ПоместитьВоВременноеХранилище(Результат, АдресХранилищаДвоичныхДанных)
		
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("ДвоичныеДанные") Тогда
		
		Картинка = АдресХранилищаДвоичныхДанных;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаQRКод;
		Элементы.ФормаОтправить.Видимость = Истина;
		Элементы.ФормаПовторить.Видимость = Ложь;
		
	Иначе
		
		ТекстОтветаСервиса = Результат;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибка;
		Элементы.НадписьОшибка.Видимость = Истина;
		Элементы.НадписьОшибкаАвторизации.Видимость = Ложь;
		Элементы.НадписьОшибкаАпикей.Видимость = Ложь;
		Элементы.НадписьОшибкаKLID.Видимость = Ложь;
		Элементы.ФормаОтправить.Видимость = Ложь;
		Элементы.ФормаПовторить.Видимость = Истина;
		
	КонецЕсли;
	
	Элементы.ГруппаОтветСервиса.Видимость = ЗначениеЗаполнено(ТекстОтветаСервиса);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиОтправкиПочтыЗаполнены()
	
	Возврат КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
	
КонецФункции

&НаСервереБезКонтекста
Функция ИндексВодительПочта(Водитель)
	
	ИндексВодительПочта = 0;
	
	Если ЗначениеЗаполнено(Водитель) Тогда
		Если ЗначениеЗаполнено(Водитель.АдресЭлектроннойПочты) Тогда
			ИндексВодительПочта = 0;
		Иначе
			ИндексВодительПочта = 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИндексВодительПочта;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьГруппыТелеграм()
	
	// Телефон 1
	Элементы.ДекорацияИдетПроверкаТелеграм1.Видимость = Ложь;
	Элементы.ДекорацияРезультатУспехТелеграм1.Видимость = Ложь;
	Элементы.ДекорацияПодключитьТелеграм1.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Телефон1) Тогда
		Элементы.ГруппаПроверкаТелеграм1.Видимость = Истина;
		
		Если ИдетПроверкаТелефона1ВТелеграм Тогда
			Элементы.ДекорацияИдетПроверкаТелеграм1.Видимость = Истина;
		ИначеЕсли Телефон1ЗарегестрированВТелеграм Тогда
			Элементы.ДекорацияРезультатУспехТелеграм1.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПодключитьТелеграм1.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ГруппаПроверкаТелеграм1.Видимость = Ложь;
	КонецЕсли;
	
	// Телефон 2
	Элементы.ДекорацияИдетПроверкаТелеграм2.Видимость = Ложь;
	Элементы.ДекорацияРезультатУспехТелеграм2.Видимость = Ложь;
	Элементы.ДекорацияПодключитьТелеграм2.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Телефон2) Тогда
		Элементы.ГруппаПроверкаТелеграм2.Видимость = Истина;
		
		Если ИдетПроверкаТелефона2ВТелеграм Тогда
			Элементы.ДекорацияИдетПроверкаТелеграм2.Видимость = Истина;
		ИначеЕсли Телефон2ЗарегестрированВТелеграм Тогда
			Элементы.ДекорацияРезультатУспехТелеграм2.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПодключитьТелеграм2.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ГруппаПроверкаТелеграм2.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРегистрациюТелефона1Телеграм()
	
	ИдетПроверкаТелефона1ВТелеграм = Истина;
	ПодключитьОбработчикОжидания("ПроверитьРегистрациюТелефона1ТелеграмВФоне", 0.1, Истина);
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРегистрациюТелефона1ТелеграмВФоне()
	
	Телефон1ЗарегестрированВТелеграм = ПроверитьРегистрациюТелеграмНаСервере(Телефон1);
	ИдетПроверкаТелефона1ВТелеграм = Ложь;
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРегистрациюТелефона2Телеграм()
	
	ИдетПроверкаТелефона2ВТелеграм = Истина;
	ПодключитьОбработчикОжидания("ПроверитьРегистрациюТелефона2ТелеграмВФоне", 0.1, Истина);
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРегистрациюТелефона2ТелеграмВФоне()
	
	Телефон2ЗарегестрированВТелеграм = ПроверитьРегистрациюТелеграмНаСервере(Телефон2);
	ИдетПроверкаТелефона2ВТелеграм = Ложь;
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьРегистрациюТелеграмНаСервере(Телефон)
	
	Попытка
		ТелефонЗарегестрированВТелеграм = КонтурЛогистика_РаботаСТелеграм.ТелефонЗарегестрирован(Телефон);
	Исключение
		ТелефонЗарегестрированВТелеграм = Ложь;
	КонецПопытки;
	
	Возврат ТелефонЗарегестрированВТелеграм;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНастройкуПоИмениПредопределенного(ИмяПредопределенного)
	
	Возврат Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(ИмяПредопределенного);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеНастройки(ИмяПредопределенного)
	
	Возврат Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки(ИмяПредопределенного);
	
КонецФункции

#КонецОбласти