
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьНесколькоОрганизаций = СервисСверкиРасчетовПереопределяемый.ИспользоватьНесколькоОрганизаций(); 
	НастройкаОбсужденийДоступна      = СервисСверкиРасчетовПереопределяемый.НастройкаОбсужденийДоступна();
	
	СервисПодключен = ПолучитьФункциональнуюОпцию("ИспользуетсяСервисСверкиРасчетов");
	
	ОрганизацияПоУмолчанию = СервисСверкиРасчетовПереопределяемый.ОрганизацияПоУмолчанию();
	Организация            = ОрганизацияПоУмолчанию;
	РеквизитыОрганизацииДляПодключения = СервисСверкиРасчетовПереопределяемый.РеквизитыОрганизацииДляПодключения(Организация);
	
	НаименованиеОрганизации = РеквизитыОрганизацииДляПодключения.Наименование;
	ЭтоЮрЛицо = РеквизитыОрганизацииДляПодключения.ЭтоЮрЛицо;
	ЭтоПолныйИнтерфейс = СервисСверкиРасчетовПереопределяемый.ЭтоПолныйИнтерфейс();
	ОтобразитьРелевантныхКонтрагентовСервиса();
	
	Если СервисСверкиРасчетов.ЭтоИнтерфейсТакси() Тогда
		
		Элементы.ДекорацияКраткаяИнформацияОСервис.Ширина = 65;
		Элементы.ДекорацияПользовательскоеСоглашение.Ширина = 70;
		Элементы.ДекорацияНеобходимостьУведомлений.Ширина = 70;
		
	КонецЕсли;
	
	ИспользоватьВнешниеОповещенияПользователей = СервисСверкиРасчетовПереопределяемый.ИспользоватьВнешниеОповещенияПользователей();
	ВнешняяСистемаОповещенийВключена = СервисСверкиРасчетовПереопределяемый.ВнешняяСистемаОповещенийВключена();
	Элементы.КомментарийИспользоватьВнешниеОповещенияПользователей.Заголовок = СервисСверкиРасчетовПереопределяемый.ТекстПодсказкиВнешнейСистемыОповещений();
	ИспользоватьОповещенияСервисаСверки = СервисСверкиРасчетовПереопределяемый.ИспользоватьОповещенияСервисаСверки();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "БизнесСеть_РегистрацияОрганизаций" Тогда
		УправлениеФормой(ЭтотОбъект);
		СтатусыОрганизаций = СтатусыРегистрацииОрганизацийВСервисе(Ложь);
		Если СтатусыОрганизаций.КоличествоПодключенных = 0 Тогда
			ОтключитьСервисНаКлиенте();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ОбсужденияПодключены" Тогда 
		ОповещенияСверкиВключены = СервисСверкиРасчетовВызовСервера.ВключитьОповещениеСверки();
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы И Не ЭтотОбъект.ЭтоПолныйИнтерфейс Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияКраткаяИнформацияОСервисОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "open:Description" Тогда
		СтандартнаяОбработка = Ложь;
		СервисСверкиРасчетовКлиент.ОткрытьНавигационнуюСсылкуПодробнееОСервисе();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПользовательскоеСоглашениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "open:userAgreement" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("ОбщаяФорма.СервисСверкиРасчетовПользовательскоеСоглашение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНеУдалосьПодключитьОрганизацииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "СсылкаНаПодключенныеОрганизации" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("ОбщаяФорма.СервисСверкиРасчетовПодключенныеОрганизации");
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЗаявлениеНаПереключение" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьПечатнуюФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОрганизацияЗарегистрированаРанееОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "НастройкиИнтернетПоддержки" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыВыполненияКоманды = Новый Структура;
		ПараметрыВыполненияКоманды.Вставить("Окно", Неопределено);
		ПараметрыВыполненияКоманды.Вставить("Источник", ЭтотОбъект);
		НастройкиПрограммыБИПКлиент.ОткрытьНастройкиИнтернетПоддержкаИСервисы(ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКоличествоПодключенныхНажатие(Элемент)
	
	ОткрытьФорму("ОбщаяФорма.СервисСверкиРасчетовПодключенныеОрганизации");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНавигацияПоРасхождениямОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СервисСверкиРасчетовКлиент.ОбработатьПереходПользователяПоСсылкеСОтбормПоПериоду(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодключитьИнтернетПоддержку(Команда)
	
	ПодключитьИнтернетПоддержкуПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьСервис(Команда)

	РегистрацияОрганизацийВСервисеВФоне();
	ОтобразитьРелевантныхКонтрагентовСервиса();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСервис(Команда)
	
	ОтключитьСервисНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбсуждения(Команда)
	
	Если НЕ ОбсужденияПодключены Тогда
		МодульОбсужденияКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбсужденияКлиент");
		МодульОбсужденияКлиент.ПоказатьПодключение();
	Иначе 
		ОповещенияСверкиВключены = СервисСверкиРасчетовВызовСервера.ВключитьОповещениеСверки();
		Если ОповещенияСверкиВключены Тогда
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОбсуждения(Команда)
	
	ОповещенияСверкиВключены = НЕ СервисСверкиРасчетовВызовСервера.ВыключитьОповещениеСверки();
	Если НЕ ОповещенияСверкиВключены Тогда
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ОбсужденияПодключены     = СервисСверкиРасчетовВызовСервера.ОбсужденияПодключены();
	Форма.ОповещенияСверкиВключены = СервисСверкиРасчетовВызовСервера.ОповещенияСверкиВключены();
	
	// Интернет-поддержка
	ИнтернетПоддержкаПодключена = ИнтернетПоддержкаПодключена();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИнтернетПоддержка",
		"Видимость",
		Не ИнтернетПоддержкаПодключена);
	
	// Включение сервиса
	СтатусыОрганизаций = СтатусыРегистрацииОрганизацийВСервисе();
	НесколькоОрганизацийПодключены = Форма.ИспользоватьНесколькоОрганизаций И СтатусыОрганизаций.КоличествоПодключенных > 0;
	НесколькоОрганизацийНеПодключены = Форма.ИспользоватьНесколькоОрганизаций И СтатусыОрганизаций.КоличествоПодключенных = 0;
	ЕдинственнаяОрганизацияПодключена = Не Форма.ИспользоватьНесколькоОрганизаций И СтатусыОрганизаций.КоличествоПодключенных > 0;
	ЕдинственнаяОрганизацияНеПодключена = Не Форма.ИспользоватьНесколькоОрганизаций И СтатусыОрганизаций.КоличествоПодключенных = 0;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВключениеСервисаСверки",
		"Видимость",
		ИнтернетПоддержкаПодключена);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаПодключитьСервис",
		"Видимость",
		Не Форма.СервисПодключен);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОтключитьСервис",
		"Видимость",
		Форма.СервисПодключен);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"РезультатыСверки",
		"Видимость",
		Форма.СервисПодключен);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДекорацияНавигацияПоРасхождениямПростойИнтерфейс",
		"Видимость",
		Не Форма.ЭтоПолныйИнтерфейс);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДекорацияНавигацияПоРасхождениямПолныйИнтерфейс",
		"Видимость",
		Форма.ЭтоПолныйИнтерфейс);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДекорацияПодключенныеОрганизации",
		"Видимость",
		НесколькоОрганизацийПодключены); 
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДекорацияКоличествоПодключенных",
		"Видимость",
		НесколькоОрганизацийПодключены);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДекорацияОрганизацияПодключена",
		"Видимость",
		ЕдинственнаяОрганизацияПодключена);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДекорацияНеУдалосьПодключитьОрганизации",
		"Видимость",
		НесколькоОрганизацийНеПодключены);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДекорацияОрганизацияНеПодключена",
		"Видимость",
		ЕдинственнаяОрганизацияНеПодключена);
	
	Элементы.ДекорацияОрганизацияЗарегистрированаРанее.Видимость = Ложь;
	
	Если Форма.ИспользоватьНесколькоОрганизаций Тогда
		Элементы.ДекорацияКоличествоПодключенных.Заголовок = СтрШаблон(
			"%1 из %2",
			СтатусыОрганизаций.КоличествоПодключенных,
			СтатусыОрганизаций.Количество);
	Иначе
		Если СтатусыОрганизаций.КоличествоПодключенных > 0 Тогда
			Элементы.ДекорацияОрганизацияПодключена.Заголовок = 
				?(Форма.ЭтоЮрЛицо,
				СтрШаблон("Организация %1 подключена к сервису", Форма.НаименованиеОрганизации),
				СтрШаблон("%1 подключен к сервису", Форма.НаименованиеОрганизации)); 
		ИначеЕсли СтатусыОрганизаций.КоличествоПодключенных = 0
			И ОрганизацияЗарегистрированаПодИнымЛогиномИТС(Форма.ОрганизацияПоУмолчанию) Тогда
			Элементы.ДекорацияОрганизацияЗарегистрированаРанее.Видимость = Истина;
			Элементы.ДекорацияОрганизацияЗарегистрированаРанее.Заголовок = 
				"Обратитесь в службу поддержки по электронной почте sverka@1c.ru.";
			Элементы.ДекорацияОрганизацияНеПодключена.Заголовок =
				?(Форма.ЭтоЮрЛицо,
				СтрШаблон("Организация %1 уже зарегистрирована в сервисе под другой учетной записью пользователя ИТС.", Форма.НаименованиеОрганизации),
				СтрШаблон("%1 уже зарегистрирован в сервисе под другой учетной записью пользователя ИТС.", Форма.НаименованиеОрганизации));
				
		Иначе
			Элементы.ДекорацияОрганизацияНеПодключена.Заголовок =
				?(Форма.ЭтоЮрЛицо,
				СтрШаблон("Организация %1 не подключена к сервису.", Форма.НаименованиеОрганизации),
				СтрШаблон("%1 не подключен к сервису.", Форма.НаименованиеОрганизации));
		КонецЕсли;
	КонецЕсли;
	
	// Обсуждения
	МожноПодключитьОбсуждения = СервисСверкиРасчетовВызовСервера.МожноПодключитьОбсуждения()
		И ИнтернетПоддержкаПодключена;
		
	Элементы.ОбратитесьКАдминистратору.Видимость =
		МожноПодключитьОбсуждения
		И Не Форма.НастройкаОбсужденийДоступна
		И Не Форма.ОбсужденияПодключены;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УведомленияОРасхождениях",
		"Видимость",
		(МожноПодключитьОбсуждения ИЛИ Форма.ОбсужденияПодключены) И Форма.ИспользоватьОповещенияСервисаСверки);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УведомленияОРасхождениях",
		"Доступность",
		Форма.СервисПодключен
		Или Форма.ОповещенияСверкиВключены);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаПодключитьУведомления",
		"Видимость",
		Не Форма.ОповещенияСверкиВключены);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОтключитьУведомления",
		"Видимость",
		Форма.ОповещенияСверкиВключены);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПодключитьОбсуждения",
		"Видимость",
		Форма.НастройкаОбсужденийДоступна ИЛИ Форма.ОбсужденияПодключены И НЕ Форма.ОповещенияСверкиВключены);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОтключитьОбсуждения",
		"Видимость",
		Форма.НастройкаОбсужденийДоступна ИЛИ Форма.ОповещенияСверкиВключены);
	
	Элементы.ПодключенныеОрганизации.Видимость = Форма.СервисПодключен;
	
	КоличествоОрганизацийДляПовторногоПодключения = ОрганизацииДляПовторногоПодключения();
	
	Если КоличествоОрганизацийДляПовторногоПодключения = 1 И СтатусыОрганизаций.Количество = 1 Тогда 
		Элементы.ДекорацияОрганизацияНеПодключенаЗаявление.Видимость = Истина;
	ИначеЕсли КоличествоОрганизацийДляПовторногоПодключения >= 1 И СтатусыОрганизаций.Количество > 0 Тогда  
		Элементы.ЗаявлениеНаПереключение.Видимость = Истина;
		Элементы.ДекорацияОрганизацииНеПодключеныЗаявление.Видимость = Истина;
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИспользоватьВнешниеОповещенияПользователей",
		"Видимость",
		Форма.ИспользоватьВнешниеОповещенияПользователей И НЕ Форма.ВнешняяСистемаОповещенийВключена);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПодключитьОбсуждения",
		"Доступность",
		НЕ (Форма.ИспользоватьВнешниеОповещенияПользователей И НЕ Форма.ВнешняяСистемаОповещенийВключена));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнтернетПоддержкаПодключена()

	МодульИПП = ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователей");
	Возврат МодульИПП.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();

КонецФункции 

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуПользователей()

	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.БазоваяФункциональностьБИП") Тогда
		Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетПоддержкаПользователейКлиент");
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуЗавершение", ЭтотОбъект);
		Модуль.ПодключитьИнтернетПоддержкуПользователей(ОповещениеОЗакрытии, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатусыРегистрацииОрганизацийВСервисе(ТолькоДоступные = Истина)
	
	Возврат СервисСверкиРасчетов.СтатусыРегистрацииОрганизацийВСервисе(ТолькоДоступные);
	
КонецФункции

&НаСервереБезКонтекста
Функция ОрганизацияЗарегистрированаПодИнымЛогиномИТС(ОрганизацияПоУмолчанию)
	
	Возврат СервисСверкиРасчетов.ОрганизацияЗарегистрированаПодИнымЛогиномИТС(ОрганизацияПоУмолчанию);
	
КонецФункции

&НаСервереБезКонтекста
Функция ИспользуетсяСервисСверкиРасчетов()
	
	Возврат СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов();
	
КонецФункции

&НаКлиенте
Процедура ОтключитьСервисНаКлиенте()
	
	УстановитьПризнакПодключенияСервисаНаСервере(Ложь);
	
	ОповещенияСверкиВключены = НЕ СервисСверкиРасчетовВызовСервера.ВыключитьОповещениеСверки();
	
	Если ЭтотОбъект.ЭтоПолныйИнтерфейс Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакПодключенияСервисаНаСервере(СервисПодключен)
	
	УстановитьПризнакПодключенияСервиса(СервисПодключен, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПризнакПодключенияСервиса(СервисПодключен, Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.СервисПодключен = СервисПодключен;
	Константы.ИспользуетсяСервисСверкиРасчетов.Установить(СервисПодключен);
	Если Не Форма.СервисПодключен Тогда
		Элементы.РезультатыСверки.Видимость = Ложь;
		Элементы.ПодключенныеОрганизации.Видимость = Ложь;
		Элементы.ЗаявлениеНаПереключение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияОрганизацийВСервисеВФоне()

	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	РегистрацияОрганизацийВСервисе = ЗарегистрироватьОрганизацииВСервисеВФоне(УникальныйИдентификатор, АдресХранилища);
	Если РегистрацияОрганизацийВСервисе.Статус = "Выполнено" Тогда
		ПослеЗавершенияРегистрацииОрганизацийВСервисеВФоне(РегистрацияОрганизацийВСервисе);
		Возврат;
	КонецЕсли;
	
	Элементы.ПодключенныеОрганизации.Видимость = Ложь;
	Элементы.ГруппаОбновление.Видимость = Истина;
	Элементы.ЗаявлениеНаПереключение.Видимость = Ложь;
	
	Если ЭтотОбъект.ИспользоватьНесколькоОрганизаций Тогда
		ТекстОрганизация = НСтр("ru='организаций'");
	Иначе
		ТекстОрганизация = НСтр("ru='организации'");
	КонецЕсли;
	Элементы.НадписьОбновление.Заголовок = СтрШаблон(НСтр("ru='Регистрация %1 в сервисе...'"), ТекстОрганизация);
	
	ОповещениеОЗавершении   = Новый ОписаниеОповещения("ПослеЗавершенияРегистрацииОрганизацийВСервисеВФоне", ЭтотОбъект);
	ПараметрыОжидания       = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РегистрацияОрганизацийВСервисе, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияРегистрацииОрганизацийВСервисеВФоне(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Элементы.ГруппаОбновление.Видимость = Ложь;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус <> "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	ПослеЗавершенияРегистрацииОрганизацийВСервисеВФонеФрагмент(Результат);
	
	Элементы.ПодключенныеОрганизации.ЦветФона = Новый Цвет;
	
	Если Не УспешнаяРегистрацияОрганизаций Тогда
		Элементы.ПодключенныеОрганизации.ЦветФона = Новый Цвет(251, 212, 212);
		Элементы.РезультатыВключенияСервиса.ЦветФона = Новый Цвет;
		Возврат;
	КонецЕсли;
	
	УстановитьПризнакПодключенияСервисаНаСервере(Истина);
	
	Если ЭтотОбъект.ЭтоПолныйИнтерфейс Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
	ОбменССервисом = ОбменятьсяССервисомВФоне(УникальныйИдентификатор);
	
	Если ОбменССервисом.Статус = "Выполнено" Тогда
		ПослеЗавершенияОбменаССервисом(ОбменССервисом);
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаОбновление.Видимость = Истина;
	Элементы.НадписьОбновление.Заголовок = НСтр("ru='Сверка документов...'");
	
	ОповещениеОЗавершении   = Новый ОписаниеОповещения("ПослеЗавершенияОбменаССервисом", ЭтотОбъект);
	ПараметрыОжидания       = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ОбменССервисом, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗавершенияРегистрацииОрганизацийВСервисеВФонеФрагмент(Знач Результат)
	
	УспешнаяРегистрацияОрганизаций = Ложь;
	
	ТаблицаРезультатовРегистрации = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(ТаблицаРезультатовРегистрации) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоОшибокПодключения = 0;
	
	Для каждого СтрокаРегистрации Из ТаблицаРезультатовРегистрации Цикл
		Если ЗначениеЗаполнено(СтрокаРегистрации.ТекстОшибки) Тогда
			КоличествоОшибокПодключения = КоличествоОшибокПодключения + 1;
		КонецЕсли;
	КонецЦикла;
	
	СтатусыОрганизаций = СтатусыРегистрацииОрганизацийВСервисе(Ложь);
	УспешнаяРегистрацияОрганизаций = КоличествоОшибокПодключения < СтатусыОрганизаций.Количество;
	
	Элементы.ПодключенныеОрганизации.Видимость = Истина;
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗарегистрироватьОрганизацииВСервисеВФоне(УникальныйИдентификатор, АдресХранилища)
	
	НаименованиеЗадания = СтрШаблон("%1. Регистрация организаций в сервисе 1С:Бизнес-сеть", СервисСверкиРасчетов.ИмяСервиса());
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "СервисСверкиРасчетов.ЗарегистрироватьОрганизацииВСервисе", АдресХранилища);
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбменятьсяССервисомВФоне(УникальныйИдентификатор)
	
	НаименованиеЗадания = СтрШаблон("%1. Обмен с сервисом", СервисСверкиРасчетов.ИмяСервиса());
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания; 
	ПараметрыПроцедуры = Новый Структура("РегистрироватьДокументыПередОбменом", Ложь);
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "СервисСверкиРасчетов.ОбменятьсяССервисом");
	
КонецФункции

&НаКлиенте
Процедура ПослеЗавершенияОбменаССервисом(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Элементы.ГруппаОбновление.Видимость = Ложь;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус <> "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НаименованиеКонтрагентаДляБаннера(Контрагент)
	
	НаименованиеКонтрагента = Строка(Контрагент);
	// Ограничим длину наименования контрагента 20 символами, чтобы поместилось в баннер.
	НаименованиеКонтрагента = ?(СтрДлина(НаименованиеКонтрагента) > 20,
		СтрШаблон("%1...", Лев(НаименованиеКонтрагента, 18)),
		НаименованиеКонтрагента);
		
	Возврат НаименованиеКонтрагента;
	
КонецФункции

&НаСервере
Процедура ОтобразитьРелевантныхКонтрагентовСервиса()
	
	Элементы.РелевантныеКонтрагентыСервиса.Видимость = Не СервисПодключен;
	
	Если СервисПодключен Тогда
		Возврат;
	КонецЕсли;
	
	КэшДанныхОРелевантныхКонтрагентах = СервисСверкиРасчетов.КэшДанныхОРелевантныхКонтрагентах();
	Если Не ЗначениеЗаполнено(КэшДанныхОРелевантныхКонтрагентах) Тогда
		Элементы.РелевантныеКонтрагентыСервиса.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	КартинкаЛоготипаПомощника = СервисСверкиРасчетовПереопределяемый.КартинкаЛоготипаПомощника();
	Элементы.РелевантныеКонтрагентыСервиса.ЦветФона = СервисСверкиРасчетов.ЦветФонаБаннеровСервисаСверкиРасчетов();
	Если ЗначениеЗаполнено(КартинкаЛоготипаПомощника) Тогда
		Элементы.ДекорацияПомощник.Видимость  = Истина;
		Элементы.ДекорацияПомощник.Картинка   = БиблиотекаКартинок[КартинкаЛоготипаПомощника];
	Иначе
		Элементы.ДекорацияПомощник.Видимость  = Ложь;
	КонецЕсли;
	
	РелевантныеКонтрагенты = КэшДанныхОРелевантныхКонтрагентах.РелевантныеКонтрагенты;
	КоличествоПодключенныхКонтрагентов = КэшДанныхОРелевантныхКонтрагентах.КоличествоПодключенныхКонтрагентов;
	
	ФорматнаяСтрока = "Л = ru_RU; ЧДЦ=0";
	
	ПредметКонтрагент = "контрагент,контрагента,контрагентов,м,,,,0";
	ПрописьЧислаКонтрагент = ЧислоПрописью(КоличествоПодключенныхКонтрагентов, ФорматнаяСтрока, ПредметКонтрагент);
	ПрописьЧислаЕщеКонтрагенты = ЧислоПрописью(КоличествоПодключенныхКонтрагентов - 3, ФорматнаяСтрока, ПредметКонтрагент);

	ИндексПредметаКонтрагент = СтрНайти(ПрописьЧислаКонтрагент, "контрагент");
	ИндексПредметаЕщеКонтрагенты = СтрНайти(ПрописьЧислаЕщеКонтрагенты, "контрагент");
	НадписьКонтрагент = Строка(Сред(ПрописьЧислаКонтрагент, ИндексПредметаКонтрагент, СтрДлина(ПрописьЧислаКонтрагент)- ИндексПредметаКонтрагент - 3));
	
	Если НадписьКонтрагент = "контрагент" Тогда
		ТекстСтроки = СтрШаблон("%1 ваш %2 уже включил сервис", Строка(КоличествоПодключенныхКонтрагентов), НадписьКонтрагент);
	Иначе
		ТекстСтроки = СтрШаблон("%1 ваших %2 уже включили сервис", Строка(КоличествоПодключенныхКонтрагентов), НадписьКонтрагент);
	КонецЕсли;
	
	ТекстЗаголовка = Новый ФорматированнаяСтрока(ТекстСтроки, ШрифтыСтиля.СервисСверкиРасчетовКрупныйПолужирныйШрифт);
	
	КоличествоДокументовИтог = РелевантныеКонтрагенты.Итог("КоличествоДокументов");
	ОборотИтог = РелевантныеКонтрагенты.Итог("Оборот");
	
	ПредметДокумент = "документ,документа,документов,м,,,,0";
	ПрописьЧислаДокумент = ЧислоПрописью(КоличествоДокументовИтог, ФорматнаяСтрока, ПредметДокумент);
	ИндексПредметаДокумент = СтрНайти(ПрописьЧислаДокумент, "документ");
	
	ПредметРубль = "рубль,рубля,рублей,м,,,,0";
	ПрописьЧислаРубль = ЧислоПрописью(ОборотИтог, ФорматнаяСтрока, ПредметРубль);
	ИндексПредметаРубль = СтрНайти(ПрописьЧислаРубль, "рубл");
	
	Если Год(СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов()) = Год(ТекущаяДата()) Тогда
		ПериодСверкиДокументов = Формат(Год(СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов()), "ЧДЦ=0; ЧН=0; ЧГ=;");
	Иначе
		ПериодСверкиДокументов = СтрШаблон("%1-%2",
			Формат(Год(СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов()), "ЧДЦ=0; ЧН=0; ЧГ=;"),
			Формат(Год(ТекущаяДата()), "ЧДЦ=0; ЧН=0; ЧГ=;"));
	КонецЕсли;
	
	ТекстПодзаголовка = Новый ФорматированнаяСтрока(
		СтрШаблон("Можно сверить %1", Строка(КоличествоДокументовИтог)),
		" ",
		Строка(Сред(ПрописьЧислаДокумент, ИндексПредметаДокумент, СтрДлина(ПрописьЧислаДокумент)- ИндексПредметаДокумент - 3)),
		" ",
		СтрШаблон("за %1 год на сумму %2", ПериодСверкиДокументов, Строка(ОборотИтог)),
		" ",
		Строка(Сред(ПрописьЧислаРубль, ИндексПредметаРубль, СтрДлина(ПрописьЧислаРубль)- ИндексПредметаРубль - 3)));
		
	Элементы.ОбъемДокументов.Заголовок = Новый ФорматированнаяСтрока(
		ТекстЗаголовка,
		Символы.ПС,
		ТекстПодзаголовка);
		
	КонтрагентыСтрока = "";
	КоличествоДокументовСтрока = "";
	ОборотСтрока = "";
	КоличествоКонтрагентовЕще = 0;
	КоличествоДокументовЕще = 0;
	ОборотыЕще = 0;
	
	Для НомерСтроки = 0 По РелевантныеКонтрагенты.Количество() - 1 Цикл
		
		Если НомерСтроки < 3 Тогда
			Если ЗначениеЗаполнено(КонтрагентыСтрока) Тогда
				КонтрагентыСтрока = Новый ФорматированнаяСтрока(
					КонтрагентыСтрока,
					Символы.ПС,
					НаименованиеКонтрагентаДляБаннера(РелевантныеКонтрагенты[НомерСтроки].Контрагент));
				КоличествоДокументовСтрока = Новый ФорматированнаяСтрока(
					КоличествоДокументовСтрока,
					Символы.ПС,
					Строка(РелевантныеКонтрагенты[НомерСтроки].КоличествоДокументов));
				ОборотСтрока = Новый ФорматированнаяСтрока(
					ОборотСтрока,
					Символы.ПС,
					Строка(РелевантныеКонтрагенты[НомерСтроки].Оборот));
			Иначе
				КонтрагентыСтрока          = НаименованиеКонтрагентаДляБаннера(РелевантныеКонтрагенты[НомерСтроки].Контрагент);
				КоличествоДокументовСтрока = Строка(РелевантныеКонтрагенты[НомерСтроки].КоличествоДокументов);
				ОборотСтрока               = Строка(РелевантныеКонтрагенты[НомерСтроки].Оборот);
			КонецЕсли;
		Иначе
			КоличествоКонтрагентовЕще = КоличествоКонтрагентовЕще + 1;
			КоличествоДокументовЕще   = КоличествоДокументовЕще + РелевантныеКонтрагенты[НомерСтроки].КоличествоДокументов;
			ОборотыЕще                = ОборотыЕще + РелевантныеКонтрагенты[НомерСтроки].Оборот;
		КонецЕсли;
		
	КонецЦикла;

	Элементы.Контрагент.Заголовок = КонтрагентыСтрока;
	Элементы.КоличествоДокументов.Заголовок = КоличествоДокументовСтрока;
	Элементы.Обороты.Заголовок = ОборотСтрока;
	
	Элементы.КонтрагентЕще.Заголовок = СтрШаблон("и еще %1 %2",
		Строка(КоличествоПодключенныхКонтрагентов - 3),
		Сред(ПрописьЧислаЕщеКонтрагенты, ИндексПредметаЕщеКонтрагенты, СтрДлина(ПрописьЧислаЕщеКонтрагенты)- ИндексПредметаЕщеКонтрагенты - 3));
	Элементы.КоличествоДокументовЕще.Заголовок = Строка(КоличествоДокументовЕще);
	Элементы.ОборотыЕще.Заголовок = Строка(ОборотыЕще);
	
	Элементы.КонтрагентЕще.Видимость = ЗначениеЗаполнено(КоличествоКонтрагентовЕще);
	Элементы.КонтрагентОтступ.Видимость = ЗначениеЗаполнено(КоличествоКонтрагентовЕще);
	
	Элементы.КоличествоДокументовЕще.Видимость = ЗначениеЗаполнено(КоличествоКонтрагентовЕще);
	Элементы.КоличествоДокументовОтступ.Видимость = ЗначениеЗаполнено(КоличествоКонтрагентовЕще);
	
	Элементы.ОборотыЕще.Видимость = ЗначениеЗаполнено(КоличествоКонтрагентовЕще);
	Элементы.ОборотыОтступ.Видимость = ЗначениеЗаполнено(КоличествоКонтрагентовЕще);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастроитьОповещенияНажатие(Элемент)
	
	Если ИспользоватьВнешниеОповещенияПользователей Тогда
		СервисСверкиРасчетовКлиентПереопределяемый.ОткрытьФормуНастройкиОповещений();
	Иначе
		КлючГлобальнойНастройкиОповещений = СервисСверкиРасчетовВызовСервера.КлючГлобальнойНастройкиОповещений();
		Если КлючГлобальнойНастройкиОповещений <> Неопределено Тогда
			ОткрытьФорму("Справочник.СервисСверкиРасчетовНастройкиОповещенийПользователей.ФормаОбъекта", 
			Новый Структура("Ключ, ПерсональнаяНастройка", КлючГлобальнойНастройкиОповещений, Ложь));
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОрганизацияНеПодключенаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ЗаявлениеНаПереключение" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьПечатнуюФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОрганизацииДляПовторногоПодключения()
	
	Возврат СервисСверкиРасчетовПереключениеЛогинаИТС.ОрганизацииДляПовторногоПодключения().Количество();
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииПечати

&НаСервере
Функция ПечатнаяФормаЗаявленияОПереключенииЛогинаИТС()
	
	Возврат СервисСверкиРасчетовПереключениеЛогинаИТС.ПечатнаяФормаЗаявленияОПереключенииЛогинаИТС();
	
КонецФункции

&НаСервере
Функция ПараметрыОткрытияФормыПечатиДокументов()
	
	Возврат СервисСверкиРасчетовПереключениеЛогинаИТС.ПараметрыОткрытияФормыПечатиДокументов();
	
КонецФункции

&НаКлиенте
Функция ОткрытьПечатнуюФорму()
	
	ТабДокумент = ПечатнаяФормаЗаявленияОПереключенииЛогинаИТС();
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
	ПечатнаяФорма.СинонимМакета = "Заявление о переключении логина ИТС";
	ПечатнаяФорма.ТабличныйДокумент = ТабДокумент;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = "Заявление_о_переключении_логина_ИТС";
	
	ОбластиОбъектов = Новый СписокЗначений;
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	
	ПараметрыВывода = ПараметрыОткрытияФормыПечатиДокументов();
	
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати,ПараметрыВывода");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ПараметрыОткрытия.Вставить("ОбъектыПечати", ОбластиОбъектов);
	ПараметрыОткрытия.Вставить("ПараметрыПечати", Неопределено);
	ПараметрыОткрытия.Вставить("ПараметрыВывода", ПараметрыВывода);
	ПараметрыОткрытия.Вставить("ИменаМакетов", Новый Массив);

	Для Каждого ОписаниеПечатнойФормы Из КоллекцияПечатныхФорм Цикл
		ПараметрыОткрытия.ИменаМакетов.Добавить(ОписаниеПечатнойФормы.ИмяМакета);
	КонецЦикла;
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, Неопределено, КлючУникальности);
	
КонецФункции

#КонецОбласти
