////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы библиотеки интеграции с ГосИС.
// 
/////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Получение сведений о библиотеке (или конфигурации).

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииПодсистемы
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "БиблиотекаИнтеграцииГосИС";
	Описание.Версия = ОбщегоНазначенияИС.ВерсияБиблиотеки();
	Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
	
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	Описание.ТребуемыеПодсистемы.Добавить("БиблиотекаПодключаемогоОборудования");
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	//
	ОбъектМетаданных  = Метаданные.Справочники.ВидыПродукцииИС;
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = ВерсияОбработчиковОбновленияПереходаНаКонструкторНастроек(ОбъектМетаданных, "0");
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("8de5f289-c69c-4476-8548-8b3fa0b89f43");
	Обработчик.Процедура       = ИмяМетодаОбработчикаОбновления(ОбъектМетаданных);
	Обработчик.Комментарий     = НСтр("ru = 'Загрузка классификаторов механизма конструктора настроек видов продукции БГосИС'");
	Обработчик.ОбщиеДанные     = Истина;
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.ПроцедураЗаполненияДанныхОбновления = ИмяМетодаОбработчикаОбновления(ОбъектМетаданных, Истина);
	
	Если Не ЭтоРежимСервиса() Тогда
		ДобавитьЧитаемыйОбъект(Обработчик, Метаданные.Константы.НастройкиСканированияКодовМаркировкиИСМП);
		ДобавитьЧитаемыйОбъект(Обработчик, Метаданные.РегистрыСведений.УдалитьНастройкиУчетаМаркируемойПродукцииИСМП);
	КонецЕсли;
		
	ОбщегоНазначенияИСПереопределяемый.ПриОпределенииОбработчикаОбновленияДанных(Обработчик, ОбъектМетаданных);
	
	// Ключи видов продукции по номенклатуре
	ПустаяНоменклатура     = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Номенклатура");
	МетаданныеНоменклатуры = ПустаяНоменклатура.Метаданные();
	ОбъектМетаданных       = Метаданные.РегистрыСведений.ОписаниеНоменклатурыИС;
	
	Обработчик = ДобавитьОбработчикОбновленияПереходаНаКонструкторНастроек(
		Обработчики, ОбъектМетаданных, Новый УникальныйИдентификатор("f5513963-9136-4e6e-9ffe-49fa0e05e3f1"));
	
	Обработчик.Комментарий = НСтр("ru = 'Заполнение ключа видов продукции по номенклатуре при использовании механизма конструктора настроек БГосИС'");
	Обработчик.Процедура   = ИмяМетодаОбработчикаОбновления(МетаданныеНоменклатуры);
	Обработчик.ПроцедураЗаполненияДанныхОбновления = ИмяМетодаОбработчикаОбновления(МетаданныеНоменклатуры, Истина);
	Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
	
	ДобавитьЧитаемыйОбъект(Обработчик, МетаданныеНоменклатуры);
	ДобавитьБлокируемыйОбъект(Обработчик, МетаданныеНоменклатуры);
	ОбщегоНазначенияИСПереопределяемый.ПриОпределенииОбработчикаОбновленияДанных(Обработчик, МетаданныеНоменклатуры);
	
	// Ключи видов продукции по видам номенклатуры
	ТипыОписанияНоменклатуры = Метаданные.ОпределяемыеТипы.ИсточникОписанияНоменклатурыИС.Тип.Типы();
	Если ТипыОписанияНоменклатуры.Количество() > 1 Тогда
		
		Для Каждого ТипВидНоменклатуры Из ТипыОписанияНоменклатуры Цикл
			
			Если ТипВидНоменклатуры = ТипЗнч(ПустаяНоменклатура)
				Или Метаданные.ОпределяемыеТипы.НаборУпаковокНоменклатурыИС.Тип.СодержитТип(ТипВидНоменклатуры) Тогда
				Продолжить;
			КонецЕсли;
			
			МассивТипов = Новый Массив();
			МассивТипов.Добавить(ТипВидНоменклатуры);
			ОписаниеТипаВидНоменклатуры = Новый ОписаниеТипов(МассивТипов);
			МетаданныеВидаНоменклатуры  = ОписаниеТипаВидНоменклатуры.ПривестиЗначение(Неопределено).Метаданные();
			ОбъектМетаданных            = Метаданные.РегистрыСведений.ОписаниеНоменклатурыИС;
			
			Обработчик = ДобавитьОбработчикОбновленияПереходаНаКонструкторНастроек(
				Обработчики, ОбъектМетаданных, Новый УникальныйИдентификатор("b4be0eb7-e4b0-44b3-a248-dcb015fb7110"));
			
			Обработчик.Комментарий = НСтр("ru = 'Заполнение ключа видов продукции по виду номенклатуры при использовании механизма конструктора настроек БГосИС'");
			Обработчик.Процедура   = ИмяМетодаОбработчикаОбновления(МетаданныеВидаНоменклатуры);
			Обработчик.ПроцедураЗаполненияДанныхОбновления = ИмяМетодаОбработчикаОбновления(МетаданныеВидаНоменклатуры, Истина);
			Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
			
			ДобавитьЧитаемыйОбъект(Обработчик, МетаданныеВидаНоменклатуры);
			ДобавитьБлокируемыйОбъект(Обработчик, МетаданныеВидаНоменклатуры);
			ОбщегоНазначенияИСПереопределяемый.ПриОпределенииОбработчикаОбновленияДанных(Обработчик, МетаданныеВидаНоменклатуры);
			
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//
	РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС.ПриДобавленииОбработчиковОбновления(Обработчики);
	
	Если ОбщегоНазначенияИС.ТребуетсяПовторнаяЗагрузкаКлассификатораИзМакетаПослеОбновления() Тогда
		// Перезагрузка ранее загруженной версии классификатора (при добавлении новых элементов конструктора)
		ОбъектМетаданных  = Метаданные.Справочники.ВидыПродукцииИС;
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия          = ОбщегоНазначенияИС.ВерсияБиблиотеки();
		Обработчик.Идентификатор   = Новый УникальныйИдентификатор("0eb047f2-6095-4d71-b6c8-1a247efd9584");
		Обработчик.Процедура       = "Справочники.ВидыПродукцииИС.ОбработатьДанныеПриПовторнойЗагрузкеКлассификатора";
		Обработчик.Комментарий     = НСтр("ru = 'Повторная загрузка классификаторов механизма конструктора настроек видов продукции БГосИС'");
		Обработчик.ОбщиеДанные     = Истина;
		Обработчик.РежимВыполнения = "Оперативно";
	КонецЕсли;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПередОбновлениемИнформационнойБазы
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
	ВерсияКонфигурации = ОбновлениеИнформационнойБазы.ВерсияИБ(Метаданные.Имя);
	Если ВерсияКонфигурации <> "0.0.0.0" Тогда
		
		ИдентификаторБиблиотекаИнтеграцииГосИС = "БиблиотекаИнтеграцииГосИС";
		ВерсияБиблиотекаИнтеграцииГосИС = ОбновлениеИнформационнойБазы.ВерсияИБ(ИдентификаторБиблиотекаИнтеграцииГосИС);
		Если ВерсияБиблиотекаИнтеграцииГосИС = "0.0.0.0" Тогда
			
			ОбновлениеИнформационнойБазы.УстановитьВерсиюИБ("БиблиотекаИнтеграцииГосИС", "1.0.0.0", Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПослеОбновленияИнформационнойБазы
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриПодготовкеМакетаОписанияОбновлений
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура:
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Добавить читаемый объект.
// 
// Параметры:
//  Обработчик - СтрокаТаблицыЗначений: см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных
Процедура ДобавитьЧитаемыйОбъект(Обработчик, ОбъектМетаданных) Экспорт
	
	ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	
	Если ЗначениеЗаполнено(Обработчик.ЧитаемыеОбъекты) Тогда
		Обработчик.ЧитаемыеОбъекты = СтрШаблон("%1,%2", Обработчик.ЧитаемыеОбъекты, ПолноеИмяОбъекта);
	Иначе
		Обработчик.ЧитаемыеОбъекты = ПолноеИмяОбъекта;
	КонецЕсли;
	
КонецПроцедуры

// Добавить изменяемый объект.
// 
// Параметры:
//  Обработчик - СтрокаТаблицыЗначений: см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных
Процедура ДобавитьИзменяемыйОбъект(Обработчик, ОбъектМетаданных) Экспорт
	
	ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	
	Если ЗначениеЗаполнено(Обработчик.ИзменяемыеОбъекты) Тогда
		Обработчик.ИзменяемыеОбъекты = СтрШаблон("%1,%2", Обработчик.ИзменяемыеОбъекты, ПолноеИмяОбъекта);
	Иначе
		Обработчик.ИзменяемыеОбъекты = ПолноеИмяОбъекта;
	КонецЕсли;
	
КонецПроцедуры

// Добавить блокируемый объект.
// 
// Параметры:
//  Обработчик - СтрокаТаблицыЗначений: см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных
Процедура ДобавитьБлокируемыйОбъект(Обработчик, ОбъектМетаданных) Экспорт
	
	ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	
	Если ЗначениеЗаполнено(Обработчик.БлокируемыеОбъекты) Тогда
		Обработчик.БлокируемыеОбъекты = СтрШаблон("%1,%2", Обработчик.БлокируемыеОбъекты, ПолноеИмяОбъекта);
	Иначе
		Обработчик.БлокируемыеОбъекты = ПолноеИмяОбъекта;
	КонецЕсли;
	
КонецПроцедуры

// Добавить обработчик обновления перехода на конструктор настроек видов продукции.
// 
// Параметры:
//  Обработчики      - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//  ОбъектМетаданных - ОбъектМетаданных
//  Идентификатор    - УникальныйИдентификатор
// Возвращаемое значение:
//  СтрокаТаблицыЗначений - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
Функция ДобавитьОбработчикОбновленияПереходаНаКонструкторНастроек(Обработчики, ОбъектМетаданных, Идентификатор) Экспорт
	
	ПолноеИмя           = ОбъектМетаданных.ПолноеИмя();
	Версия              = ВерсияОбработчиковОбновленияПереходаНаКонструкторНастроек(ОбъектМетаданных);
	ОбъектыКонструктора = ПолныеИменаОбъектовКонструктораНастроекВидовПродукции();
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Идентификатор                       = Идентификатор;
	Обработчик.Версия                              = Версия;
	Обработчик.РежимВыполнения                     = "Отложенно";
	Обработчик.Процедура                           = ИмяМетодаОбработчикаОбновления(ОбъектМетаданных);
	Обработчик.ПроцедураЗаполненияДанныхОбновления = ИмяМетодаОбработчикаОбновления(ОбъектМетаданных, Истина);
	Обработчик.ПроцедураПроверки                   = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты                     = СтрШаблон("%1,%2", ОбъектыКонструктора, ПолноеИмя);
	Обработчик.ИзменяемыеОбъекты                   = ПолноеИмя;
	Обработчик.БлокируемыеОбъекты                  = ПолноеИмя;
	Обработчик.Многопоточный                       = Истина;
	Обработчик.Порядок                             = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
	
	Обработчик.Комментарий = СтрШаблон(
		НСтр("ru = 'Переход на конструктор настроек видов продукции БГосИС для объекта ""%1""'"),
		ОбъектМетаданных.Синоним);
	
	Возврат Обработчик;
	
КонецФункции

// Таблица для обработки номенклатуры при переходе на конструктор настроек.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - :
// * ИндексСтроки - Число - для использования в переопредении при заполнении таблицы
// * Номенклатура - ОпределяемыйТип.Номенклатура
// * ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - вид продукции (перечисление) по особенности учета
// * ЭтоПодакцизнаяПродукцияЕГАИС - Булево - Ложь, если алкогольная продукция (ЕГАИС) связана с немаркируемым
//                                            видом алкогольной продукции. Значение по-умолчанию: Истина
// * ЭтоМернаяЕдиницаИзмерения - Булево - Истина, если базовая единица измерения мерная (килограмм, литр, метр и т.д.)
// * ОКПД2 - Строка - ОКПД2 в карточке номенклатуры
// * КодТНВЭД - Булево - КодТНВЭД в карточке номенклатуры
Функция НоваяТаблицаДляОбработкиНоменклатурыПриПереходеНаКонструкторНастроек() Экспорт
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("ИндексСтроки",                 ОбщегоНазначения.ОписаниеТипаЧисло(8));
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура",                 Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	ТаблицаНоменклатуры.Колонки.Добавить("ВидПродукции",                 Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПродукцииИС"));
	ТаблицаНоменклатуры.Колонки.Добавить("ЭтоПодакцизнаяПродукцияЕГАИС", Новый ОписаниеТипов("Булево"));
	ТаблицаНоменклатуры.Колонки.Добавить("ЭтоМернаяЕдиницаИзмерения",    Новый ОписаниеТипов("Булево"));
	ТаблицаНоменклатуры.Колонки.Добавить("ОКПД2",                        ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаНоменклатуры.Колонки.Добавить("КодТНВЭД",                     ОбщегоНазначения.ОписаниеТипаСтрока(10));
	
	Возврат ТаблицаНоменклатуры;
	
КонецФункции

// Данные для обработки номенклатуры при переходе на конструктор настроек.
// 
// Параметры:
//  Номенклатура - Массив из ОпределяемыйТип.Номенклатура
// 
// Возвращаемое значение:
//  Структура - Данные для обработки номенклатуры при переходе на конструктор настроек:
// * ТаблицаНоменклатуры - см. НоваяТаблицаДляОбработкиНоменклатурыПриПереходеНаКонструкторНастроек
// * ОписаниеНоменклатуры - см. ОбщегоНазначенияИС.ОписаниеНоменклатуры
// * ДанныеКеша - Неопределено, Структура - для внутренного использования
Функция ДанныеДляОбработкиНоменклатурыПриПереходеНаКонструкторНастроек(Номенклатура) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТаблицаНоменклатуры",  НоваяТаблицаДляОбработкиНоменклатурыПриПереходеНаКонструкторНастроек());
	ВозвращаемоеЗначение.Вставить("ОписаниеНоменклатуры", ОбщегоНазначенияИС.ОписаниеНоменклатуры(Номенклатура));
	ВозвращаемоеЗначение.Вставить("ДанныеКеша",           Неопределено);
	
	ИндексСтроки = 0;
	Для Каждого ПозицияНоменклатуры Из Номенклатура Цикл
		
		НоваяСтрока = ВозвращаемоеЗначение.ТаблицаНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = ПозицияНоменклатуры;
		НоваяСтрока.ИндексСтроки  = ИндексСтроки;
		НоваяСтрока.ЭтоПодакцизнаяПродукцияЕГАИС = Истина;
		
		ИндексСтроки = ИндексСтроки + 1;
		
	КонецЦикла;
	
	ОбщегоНазначенияИСПереопределяемый.ПриЗаполненииТаблицыНоменклатурыДляПереходаНаКонструкторНастроекВидовПродукции(
		ВозвращаемоеЗначение.ТаблицаНоменклатуры);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Обработать строку таблицы номенклатуры при переходе на конструктор настроек.
// 
// Параметры:
//  СтрокаТаблицы - СтрокаТаблицыЗначений: см. НоваяТаблицаДляОбработкиНоменклатурыПриПереходеНаКонструкторНастроек
//  ДанныеДляОбработки - см. ДанныеДляОбработкиНоменклатурыПриПереходеНаКонструкторНастроек
// Возвращаемое значение:
//  Структура - Обработать строку таблицы номенклатуры при переходе на конструктор настроек:
// * ЕстьОшибки - Булево - наличие ошибки обработки строки
// * ТекстОшибки - Строка - описание ошибки обработки строки
Функция ОбработатьСтрокуТаблицыНоменклатурыПриПереходеНаКонструкторНастроек(СтрокаТаблицы, ДанныеДляОбработки) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",  Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки", "");
	
	ТекущееОписание = ДанныеДляОбработки.ОписаниеНоменклатуры[СтрокаТаблицы.Номенклатура];
	
	Если ЗначениеЗаполнено(ТекущееОписание.КлючВидовПродукции) Тогда
		Возврат ВозвращаемоеЗначение;
	ИначеЕсли Не ЗначениеЗаполнено(СтрокаТаблицы.ВидПродукции) Тогда
		ВозвращаемоеЗначение.ЕстьОшибки  = Истина;
		ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось определить вид продукции (перечисление) для номенклатуры ""%1"" при переходе на конструктор настроек видов продукции'"),
			СтрокаТаблицы.Номенклатура);
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ПоляБлокировки = Новый Структура();
	ПоляБлокировки.Вставить("Номенклатура", СтрокаТаблицы.Номенклатура);
	ОбщегоНазначенияИС.УстановитьУправляемуюБлокировку(Метаданные.Справочники.КлючиВидовПродукцииИС.ПолноеИмя());
	ОбщегоНазначенияИС.УстановитьУправляемуюБлокировку(
		Метаданные.РегистрыСведений.ОписаниеНоменклатурыИС.ПолноеИмя(), ПоляБлокировки);
	
	ЗаполнитьОписаниеНоменклатурыПриПереходеНаКонструкторНастроек(
		ТекущееОписание, СтрокаТаблицы, ДанныеДляОбработки.ДанныеКеша);
	
	Если ЗначениеЗаполнено(ТекущееОписание.КлючВидовПродукции) Тогда
		
		РегистрыСведений.ОписаниеНоменклатурыИС.УстановитьОписание(ТекущееОписание);
		
	Иначе
		
		ВозвращаемоеЗначение.ЕстьОшибки  = Истина;
		ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось определить ключ видов продукции для номенклатуры ""%1"" при переходе на конструктор настроек видов продукции'"),
			СтрокаТаблицы.Номенклатура);
	
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Заполнить описание номенклатуры при переходе на конструктор настроек.
// 
// Параметры:
//  ТекущееОписание - см. ОбщегоНазначенияИС.ИнициализироватьДанныеОписанияНоменклатуры
//  СтрокаТаблицы - СтрокаТаблицыЗначений - Строка таблицы: см. НоваяТаблицаДляОбработкиНоменклатурыПриПереходеНаКонструкторНастроек
//  ДанныеКеша - Неопределено, Структура - Данные кеша
//  МонопольнойДоступ - Булево - признак монопольного доступа к данным
Процедура ЗаполнитьОписаниеНоменклатурыПриПереходеНаКонструкторНастроек(ТекущееОписание, СтрокаТаблицы, ДанныеКеша, МонопольнойДоступ = Ложь) Экспорт
	
	Если СтрокаТаблицы.ВидПродукции = Перечисления.ВидыПродукцииИС.Алкогольная Тогда
		МаркируемаяПродукцияЕГАИС = СтрокаТаблицы.ЭтоПодакцизнаяПродукцияЕГАИС;
	Иначе
		МаркируемаяПродукцияЕГАИС = Неопределено;
	КонецЕсли;
	
	ДанныеДляУточнения = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ДанныеДляУточненияТоварнойГруппы();
	ДанныеДляУточнения.ТНВЭД = СтрокаТаблицы.КодТНВЭД;
	ДанныеДляУточнения.ОКПД2 = СтрокаТаблицы.ОКПД2;
	
	КлючВидовПродукции = Справочники.КлючиВидовПродукцииИС.КлючПоЗначениюПеречисления(
		СтрокаТаблицы.ВидПродукции,
		ДанныеКеша,
		МаркируемаяПродукцияЕГАИС,
		ДанныеДляУточнения,
		МонопольнойДоступ);
	
	Если ЗначениеЗаполнено(КлючВидовПродукции) Тогда
		
		ТекущееОписание.КлючВидовПродукции = КлючВидовПродукции;
		
		Если Не ЗначениеЗаполнено(ТекущееОписание.ПотребительскаяУпаковка)
			И Не ЗначениеЗаполнено(ТекущееОписание.ВариантЧастичногоВыбытия)
			И СтрокаТаблицы.ЭтоМернаяЕдиницаИзмерения
			И (СтрокаТаблицы.ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС
				Или СтрокаТаблицы.ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС
				Или СтрокаТаблицы.ВидПродукции = Перечисления.ВидыПродукцииИС.Пиво
				Или СтрокаТаблицы.ВидПродукции = Перечисления.ВидыПродукцииИС.БезалкогольноеПиво
				Или СтрокаТаблицы.ВидПродукции = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхПодконтрольныеВЕТИС
				Или СтрокаТаблицы.ВидПродукции = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхБезВЕТИС
				Или СтрокаТаблицы.ВидПродукции = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС
				Или СтрокаТаблицы.ВидПродукции = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхВлажныеБезВЕТИС
				Или СтрокаТаблицы.ВидПродукции = Перечисления.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС) Тогда
			
			ТекущееОписание.КоличествоВПотребительскойУпаковке = 0;
			ТекущееОписание.ВариантИспользованияЕдиницыХранения = Перечисления.ВариантыИспользованияЕдиницыХраненияИС.МернаяПродукцияТребуетУказанияЗначения;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Это режим сервиса.
// 
// Возвращаемое значение:
//  Булево - Это режим сервиса
Функция ЭтоРежимСервиса() Экспорт
	Возврат ОбщегоНазначения.РазделениеВключено();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьУчетныеДанныеДляПереходаНаКонструктор() Экспорт
	
	СписокЗапросов   = Новый СписокЗначений();
	ЗапросВсеДанные  = "";
	ЕстьНоменклатура = Ложь;
	ОбщегоНазначенияИСПереопределяемый.ПриОпределенииНаличияНоменклатурыДляПереходаНаКонструкторНастроекВидовПродукции(ЕстьНоменклатура);
	
	Если ЕстьНоменклатура Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДобавитьМетаданныеДляПроверкеНаличияДанныхВИнформационнойБазе(
		Метаданные.РегистрыСведений.ВскрытыеПотребительскиеУпаковкиИС,
		СписокЗапросов,
		ЗапросВсеДанные);
	
	Если ОбщегоНазначенияИС.ПодсистемаСуществует("ИСМП") Тогда
		
		МодульОбновлениеИнформационнойБазыИСМП = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ОбновлениеИнформационнойБазыИСМП");
		МетаданныеПодсистемы = МодульОбновлениеИнформационнойБазыИСМП.МетаданныеДляПереходаНаКонструкторНастроек();
		
		Для Каждого ОбъектМетаданных Из МетаданныеПодсистемы Цикл
			ДобавитьМетаданныеДляПроверкеНаличияДанныхВИнформационнойБазе(
				ОбъектМетаданных,
				СписокЗапросов,
				ЗапросВсеДанные)
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияИС.ПодсистемаСуществует("ЗЕНРО") Тогда
		
		МодульОбновлениеИнформационнойБазыЗЕРНО = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ОбновлениеИнформационнойБазыЗЕРНО");
		МетаданныеПодсистемы = МодульОбновлениеИнформационнойБазыЗЕРНО.МетаданныеДляПереходаНаКонструкторНастроек();
		
		Для Каждого ОбъектМетаданных Из МетаданныеПодсистемы Цикл
			ДобавитьМетаданныеДляПроверкеНаличияДанныхВИнформационнойБазе(
				ОбъектМетаданных,
				СписокЗапросов,
				ЗапросВсеДанные)
		КонецЦикла;
		
	КонецЕсли;
	
	СписокЗапросов.Добавить(
		ЗапросВсеДанные,
		"ВсеДанные");
	
	Запрос = Новый Запрос;
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	//@skip-check bsl-legacy-check-string-literal
	Возврат Не РезультатыЗапроса["ВсеДанные"].Пустой();
	
КонецФункции

Процедура ДобавитьМетаданныеДляПроверкеНаличияДанныхВИнформационнойБазе(ОбъектМетаданных, СписокЗапросов, ЗапросВсеДанные)
	
	ПолноеИмя           = ОбъектМетаданных.ПолноеИмя();
	ИмяВременнойТаблицы = СтрШаблон("ВТ_%1", СтрЗаменить(ПолноеИмя, ".", "_"));
	
	Если ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных)
		Или ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
		ИмяПоля = "Ссылка";
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрСведений(ОбъектМетаданных) Тогда
		Для Каждого Измерение Из ОбъектМетаданных.Измерения Цикл
			ИмяПоля = Измерение.Имя;
			Прервать;
		КонецЦикла;
		Если Не ЗначениеЗаполнено(ИмяПоля) Тогда
			Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
				ИмяПоля = Реквизит.Имя;
				Прервать;
			КонецЦикла;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ИмяПоля) Тогда
			Для Каждого Ресурс Из ОбъектМетаданных.Ресурсы Цикл
				ИмяПоля = Ресурс.Имя;
				Прервать;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = СтрШаблон(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.%3 КАК Поле
		|ПОМЕСТИТЬ %2
		|ИЗ
		|	%1 КАК Т",
		ПолноеИмя,
		ИмяВременнойТаблицы,
		ИмяПоля);
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	Если ЗначениеЗаполнено(ЗапросВсеДанные) Тогда
		ЗапросВсеДанные = ЗапросВсеДанные + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
	КонецЕсли;
	
	ЗапросВсеДанные = ЗапросВсеДанные + СтрШаблон(
		"ВЫБРАТЬ
		|	ВТ.Поле
		|ИЗ
		|	%1 КАК ВТ",
		ИмяВременнойТаблицы);
	
КонецПроцедуры

// Проверить обработку по таблице номенклатуры.
// 
// Параметры:
//  ТаблицаНоменклатуры - ТаблицаЗначений:
//  * Номенклатура - ОпределяемыйТип.Номенклатура
Процедура ПроверитьОбработатьТаблицуНоменклатурыПриПереходеНаКонструкторНастроек(ТаблицаНоменклатуры) Экспорт
	
	Если ТаблицаНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмя                 = ОбщегоНазначенияИСПовтИсп.ПолноеИмяМетаданныхНоменклатуры();
	ПараметрыСеансаИС         = ОбщегоНазначенияИС.ПараметрСеансаИС();
	ТребуетсяОбработкаТаблицы = ПараметрыСеансаИС.ТребуетсяОбработкаПриПереходеНаКонструктор.Получить(ПолноеИмя);
	
	Если ТребуетсяОбработкаТаблицы = Неопределено Тогда
		ТребуетсяОбработкаТаблицы = Не ОбновлениеИнформационнойБазы.ОбъектОбработан(ПолноеИмя).Обработан;
		УстановитьТребованиеОбработкиДанныхВПараметрСеанса(ПолноеИмя, ТребуетсяОбработкаТаблицы, ПараметрыСеансаИС);
	КонецЕсли;
	
	Если Не ТребуетсяОбработкаТаблицы Тогда
		Возврат;
	КонецЕсли;
	
	НоменклатураКОбработке = Новый Массив;
	
	Для Каждого СтрокаДанных Из ТаблицаНоменклатуры Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДанных.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Номенклатура = СтрокаДанных.Номенклатура;
		
		ОбъектОбработан = ПараметрыСеансаИС.ТребуетсяОбработкаПриПереходеНаКонструктор.Получить(Номенклатура);
		
		Если ОбъектОбработан = Неопределено Тогда
			
			ОбъектОбработан = ОбновлениеИнформационнойБазы.ОбъектОбработан(Номенклатура).Обработан;
			
			Если Не ОбъектОбработан Тогда
				НоменклатураКОбработке.Добавить(Номенклатура);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НоменклатураКОбработке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляОбработки = ДанныеДляОбработкиНоменклатурыПриПереходеНаКонструкторНастроек(НоменклатураКОбработке);
	
	Для Каждого СтрокаТаблицы Из ДанныеДляОбработки.ТаблицаНоменклатуры Цикл
		
		НачатьТранзакцию();
		
		ДанныеОбработаны = Истина;
		
		Попытка
			
			РезультатОбработки = ОбработатьСтрокуТаблицыНоменклатурыПриПереходеНаКонструкторНастроек(
				СтрокаТаблицы,
				ДанныеДляОбработки);
			
			Если РезультатОбработки.ЕстьОшибки Тогда
				ВызватьИсключение РезультатОбработки.ТекстОшибки;
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ДанныеОбработаны = Ложь;
			ТекстСообщенияЖР = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщения   = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				СтрокаТаблицы.Номенклатура.Метаданные(),,
				ТекстСообщенияЖР);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецПопытки;
		
		Если ДанныеОбработаны Тогда
			УстановитьТребованиеОбработкиДанныхВПараметрСеанса(Номенклатура, Истина, ПараметрыСеансаИС);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьТребованиеОбработкиДанныхВПараметрСеанса(Объект, Значение, ПараметрыСеансаИС)
	
	ТекущиеПараметрыСеанса = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыСеансаИС, Ложь);
	ТекущиеПараметрыСеанса.ТребуетсяОбработкаПриПереходеНаКонструктор[Объект] = Значение;
	ПараметрыСеансаИС = ОбщегоНазначения.СкопироватьРекурсивно(ТекущиеПараметрыСеанса, Истина);
	ПараметрыСеанса.ПараметрСеансаИС = ПараметрыСеансаИС;
	
КонецПроцедуры

// Кеш конвертаций вида продукции.
// 
// Возвращаемое значение:
//  Структура - Кеш конвертаций вида продукции:
// * ВидыПродукцииГИСМТ - Массив из СправочникСсылка.ВидыПродукцииИС - 
// * РезультаВидыПродукцииГИСМТ - Соответствие из КлючИЗначение - 
// * РезультаТоварныеГруппыГИСМТ - Соответствие из КлючИЗначение - 
// * ШаблоныПоТоварнымГруппам - Соответствие из КлючИЗначение - 
// * ПричиныВыбытия - Неопределено, Соответствие из КлючИЗначение - 
// * ПричиныСписаниеЧерезСУЗМех - Неопределено, Соответствие из КлючИЗначение - 
// * ПричиныСписаниеЧерезГИСМТ - Неопределено, Соответствие из КлючИЗначение - 
// * ВидыВозвратаВОборот - Неопределено, Соответствие из КлючИЗначение - 
Функция КешКонвертацийВидаПродукции() Экспорт
	
	ДанныеКеша = Новый Структура;
	ДанныеКеша.Вставить("ВидыПродукцииГИСМТ",          Новый Массив);
	ДанныеКеша.Вставить("РезультаВидыПродукцииГИСМТ",  Новый Соответствие());
	ДанныеКеша.Вставить("РезультаТоварныеГруппыГИСМТ", Новый Соответствие());
	ДанныеКеша.Вставить("ШаблоныПоТоварнымГруппам",    Новый Соответствие());
	ДанныеКеша.Вставить("ПричиныВыбытия",              Неопределено);
	ДанныеКеша.Вставить("ПричиныСписаниеЧерезСУЗМех",  Неопределено);
	ДанныеКеша.Вставить("ПричиныСписаниеЧерезГИСМТ",   Неопределено);
	
	ДанныеКеша.Вставить("ВидыВозвратаВОборот",         Неопределено);
	
	ДанныеКеша.ВидыПродукцииГИСМТ = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ"));
		
	Возврат ДанныеКеша;
	
КонецФункции

Функция ПолныеИменаОбъектовКонструктораНастроекВидовПродукции() Экспорт
	
	ОбъектыКлассификаторов = Новый Массив;
	ОбъектыКлассификаторов.Добавить("Справочник.ВидыПродукцииИС");
	ОбъектыКлассификаторов.Добавить("Справочник.ТоварныеГруппыГИСМТ");
	ОбъектыКлассификаторов.Добавить("Справочник.ШаблоныКодовМаркировкиСУЗ");
	ОбъектыКлассификаторов.Добавить("Справочник.ШаблоныРазбораКодовМаркировкиИСМП");
	ОбъектыКлассификаторов.Добавить("Справочник.ЭлементыКонструктораВидовПродукцииИС");
	ОбъектыКлассификаторов.Добавить("Справочник.МестаПримененияЭлементовКонструктораВидовПродукцииИС");
	ОбъектыКлассификаторов.Добавить("РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС");
	ОбъектыКлассификаторов.Добавить("РегистрСведений.МестаПримененияЭлементовКонструктораВидовПродукцииИС");
	ОбъектыКлассификаторов.Добавить("РегистрСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС");
	ОбъектыКлассификаторов.Добавить("РегистрСведений.ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС");
	
	Если ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС("ИСМП") Тогда
		ОбъектыКлассификаторов.Добавить("Справочник.ПричиныВыводаИзОборотаИСМП");
		ОбъектыКлассификаторов.Добавить("Справочник.ВидыВозвратаВОборотИСМП");
	КонецЕсли;
	
	Возврат СтрСоединить(ОбъектыКлассификаторов, ",");
	
КонецФункции

Функция ИмяМетодаОбработчикаОбновления(ОбъектМетаданных, ДляРегистрации = Ложь)
	
	ИмяБазовогоТипа = ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных);
	
	Если ДляРегистрации Тогда
		Результат = СтрШаблон(
			"%1.%2.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию",
			ИмяБазовогоТипа,
			ОбъектМетаданных.Имя);
	Иначе
		Результат = СтрШаблон(
			"%1.%2.ОбработатьДанныеДляПереходаНаНовуюВерсию",
			ИмяБазовогоТипа,
			ОбъектМетаданных.Имя);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Версия обработчиков обновления перехода на конструктор настроек.
// 
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных
//  НомерСборки - Строка - номер сборки
// 
// Возвращаемое значение:
//  Строка - Версия обработчиков обновления перехода на конструктор настроек
Функция ВерсияОбработчиковОбновленияПереходаНаКонструкторНастроек(ОбъектМетаданных, НомерСборки = "1") Экспорт
	
	ЧастьВерсии   = "0.1." + НомерСборки;
	НомерРедакции = ОбщегоНазначенияИС.РедакцияБиблиотеки();
	
	Если ОбщегоНазначенияИС.ПодсистемаСуществует("ИСМП")
		И Метаданные.Подсистемы.ГосИС.Подсистемы["ИСМП"].Подсистемы.БРМК.Состав.Содержит(ОбъектМетаданных)
		Или ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС("ИСМП")
			И Метаданные.Подсистемы.ГосИС.Подсистемы["ИСМП"].Подсистемы.Расширенная.Состав.Содержит(ОбъектМетаданных) Тогда
		МодульПодсистемы = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ОбновлениеИнформационнойБазыИСМП");
		НомерРедакции = МодульПодсистемы.РедакцияПодсистемы();
	ИначеЕсли ОбщегоНазначенияИС.ПодсистемаСуществует("ЗЕРНО")
		И Метаданные.Подсистемы.ГосИС.Подсистемы["ЗЕРНО"].Состав.Содержит(ОбъектМетаданных) Тогда
		МодульПодсистемы = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ОбновлениеИнформационнойБазыЗЕРНО");
		НомерРедакции = МодульПодсистемы.РедакцияПодсистемы();
	ИначеЕсли Не (Метаданные.Подсистемы.ГосИС.Подсистемы.БазоваяФункциональность.Подсистемы.БРМК.Состав.Содержит(ОбъектМетаданных)
		Или ОбщегоНазначенияИСКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС()
			И Метаданные.Подсистемы.ГосИС.Подсистемы.БазоваяФункциональность.Подсистемы.Расширенная.Состав.Содержит(ОбъектМетаданных)) Тогда
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Внутренняя ошибка. Не удалось определить принадлежность к подсистеме при добавлении обработчика обновления %1'"),
			Строка(ОбъектМетаданных.ПолноеИмя()));
		ЗаписьЖурналаРегистрации(
			"ОбновлениеИнформационнойБазыБГосИС",
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
	КонецЕсли;
	
	Возврат СтрШаблон("%1.%2", НомерРедакции, ЧастьВерсии);
	
КонецФункции

// Дополняет приоритеты выполнения данными других подсистем библиотеки.
//
// Параметры:
//  ПриоритетыВыполнения - См. ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика
Процедура ДополнитьПриоритетВыполненияОбработчикаОбновленияСправочникаШтрихкодыУпаковокТоваров(ПриоритетыВыполнения)Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЕГАИС") Тогда
		НоваяСтрока = ПриоритетыВыполнения.Добавить();
		НоваяСтрока.Процедура = "Документы.АктПостановкиНаБалансЕГАИС.ОбработатьДанныеДляПереходаНаНовуюВерсиюГенерацияАкцизныхМарок";
		НоваяСтрока.Порядок = "Любой";
		НоваяСтрока = ПриоритетыВыполнения.Добавить();
		НоваяСтрока.Процедура = "Документы.АктСписанияЕГАИС.ОбработатьДанныеДляПереходаНаНовуюВерсиюГенерацияАкцизныхМарок";
		НоваяСтрока.Порядок = "Любой";
		НоваяСтрока = ПриоритетыВыполнения.Добавить();
		НоваяСтрока.Процедура = "Документы.ЧекЕГАИС.ОбработатьДанныеДляПереходаНаНовуюВерсиюГенерацияАкцизныхМарок";
		НоваяСтрока.Порядок = "Любой";
		НоваяСтрока = ПриоритетыВыполнения.Добавить();
		НоваяСтрока.Процедура = "Документы.ЧекЕГАИСВозврат.ОбработатьДанныеДляПереходаНаНовуюВерсиюГенерацияАкцизныхМарок";
		НоваяСтрока.Порядок = "Любой";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
