#Область Приглашения

Функция ОтправитьПриглашение(Организация, Сотрудник, Сценарий, Телефон, Статус = Неопределено, PersonId = Неопределено) Экспорт
	
	Результат = РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.ОтправитьПриглашение(Организация, Сотрудник, Сценарий, Телефон, Статус, PersonId);
		
	Возврат Результат
	
КонецФункции

Процедура ПроверитьПриглашение(Организация, Сотрудник, СценарийПриглашения, PersonId, ПриглашениеПринято = Ложь) Экспорт
		
	РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.ПроверитьПриглашение(Организация, Сотрудник, СценарийПриглашения, PersonId, ПриглашениеПринято);
	
КонецПроцедуры

Процедура ПроверитьПриглашения(Организация) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_СервисФизическихЛиц.Сотрудник КАК Сотрудник,
		|	КонтурЛогистика_СервисФизическихЛиц.СценарийПриглашения КАК СценарийПриглашения,
		|	КонтурЛогистика_СервисФизическихЛиц.PersonId КАК PersonId
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК КонтурЛогистика_СервисФизическихЛиц
		|ГДЕ
		|	КонтурЛогистика_СервисФизическихЛиц.Организация = &Организация
		|	И КонтурЛогистика_СервисФизическихЛиц.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.ПроверитьПриглашение(
			Организация, ВыборкаДетальныеЗаписи.Сотрудник, ВыборкаДетальныеЗаписи.СценарийПриглашения, ВыборкаДетальныеЗаписи.PersonId);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПриглашениеПринято(Организация, Сотрудник, СценарийПриглашения, Знач Телефон = Неопределено) Экспорт
	
	Телефон = Прав(СокрЛП(Телефон), 10);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтурЛогистика_СервисФизическихЛиц.Статус КАК Статус,
		|	КонтурЛогистика_СервисФизическихЛиц.Телефон КАК Телефон
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК КонтурЛогистика_СервисФизическихЛиц
		|ГДЕ
		|	КонтурЛогистика_СервисФизическихЛиц.Сотрудник = &Сотрудник
		|	И КонтурЛогистика_СервисФизическихЛиц.Организация = &Организация
		|	И КонтурЛогистика_СервисФизическихЛиц.Телефон ПОДОБНО &Телефон
		|	И КонтурЛогистика_СервисФизическихЛиц.СценарийПриглашения = &СценарийПриглашения
		|	И КонтурЛогистика_СервисФизическихЛиц.Статус = &Статус";
	
	Если Не ЗначениеЗаполнено(Телефон) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_СервисФизическихЛиц.Телефон ПОДОБНО &Телефон", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Статус", Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение);
	Запрос.УстановитьПараметр("СценарийПриглашения", СценарийПриглашения);
	Запрос.УстановитьПараметр("Телефон", "%" + Телефон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

функция ЕстьНепринятыеПриглашения(Сотрудник = Неопределено, Организация = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтурЛогистика_СервисФизическихЛиц.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК КонтурЛогистика_СервисФизическихЛиц
		|ГДЕ
		|	КонтурЛогистика_СервисФизическихЛиц.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение)
		|	И КонтурЛогистика_СервисФизическихЛиц.Сотрудник = &Сотрудник
		|	И КонтурЛогистика_СервисФизическихЛиц.Организация = &Организация";
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_СервисФизическихЛиц.Сотрудник = &Сотрудник", "");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_СервисФизическихЛиц.Организация = &Организация", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Организация", Организация);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьПринятоеПриглашение(Сотрудник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтурЛогистика_СервисФизическихЛиц.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК КонтурЛогистика_СервисФизическихЛиц
		|ГДЕ
		|	КонтурЛогистика_СервисФизическихЛиц.Сотрудник = &Сотрудник		
		|	И КонтурЛогистика_СервисФизическихЛиц.СценарийПриглашения = &СценарийПриглашения
		|	И КонтурЛогистика_СервисФизическихЛиц.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Статус", Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение);
	Запрос.УстановитьПараметр("СценарийПриглашения", Перечисления.КонтурЛогистика_СценарииПриглашенийФизическихЛиц.Водитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьДаныеПередОтправкойПриглашения(Организация, Сотрудник, Сценарий, Телефон, ПереотправкаПриглашения = Ложь) Экспорт
	
	Если Не КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ДоступенСервисФизЛиц(Организация) Тогда
		Сообщить("Сервис не доступен в выбранной организации");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Телефон) Тогда
		Сообщить("Не заполнен телефон");
		Возврат Ложь;
	КонецЕсли;
		
	Если КонтурЛогистика_СервисФизическихЛицСервер.СотрудникЕстьВОрганизации(Сотрудник, Организация) И Не ПереотправкаПриглашения Тогда
		Сообщить("Сотрудник уже добавлен в выбранную организацию или отправлено приглашение");
		Возврат Ложь;
	КонецЕсли;
	
	Если КонтурЛогистика_СервисФизическихЛицСервер.ПриглашениеПринято(Организация, Сотрудник, Сценарий, Телефон) Тогда
		Сообщить("Приглашение уже принято по этому телефону");
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ОбменССервисом

Процедура ЗагрузитьДанныеСотрудниковИзСервиса(Организация, АдресПрогресса = Неопределено) Экспорт

	Запрос = КонтурЛогистика_КонвертацияСервер.БазовыйЗапросДляПоиска(Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВСотрудника);
	
	СписокФизическихЛицРС = СписокФизическихЛицИзРегистраСведений(Организация);
	
	СписокФизическихЛицАПИ = ПолныйСписокФизическихЛиц(Организация);
    КолвоФизЛицАПИ = СписокФизическихЛицАПИ.Количество();
	
	инд = 0;
	ПрогрессОбновленияСотрудников(инд, КолвоФизЛицАПИ, АдресПрогресса);
		 
	Для каждого ФизЛицо Из СписокФизическихЛицАПИ Цикл
		
		Если Не ЗначениеЗаполнено(ФизЛицо.userId) Или Не ЗначениеЗаполнено(ФизЛицо.ДанныеСотрудника.ВУИд) Тогда
			ПрогрессОбновленияСотрудников(инд, КолвоФизЛицАПИ, АдресПрогресса);
			Продолжить;
		КонецЕсли;
		
		// если в рег сведений сервиса физиков есть запись, то обновим сотрудника и обновим статус приглашения, если нужно	
		Запись = СписокФизическихЛицРС.Найти(ФизЛицо.id, "PersonId");
		Если Запись <> Неопределено И ЗначениеЗаполнено(Запись.Сотрудник) Тогда
			
			Результат = ПолучитьРасхождения(Запись);
			 
			Если Результат.ЕстьРасхождения Тогда
				СотрудникОб = Запись.Сотрудник.ПолучитьОбъект();
				ЗаполнитьСотрудникаДаннымиФизическогоЛица(СотрудникОб, ФизЛицо);
				СотрудникОб.Записать();
			КонецЕсли;
		
			Если Запись.Статус = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение Тогда
				ПринятьПриглашение(Организация, Запись.Сотрудник, ФизЛицо.userId);
			КонецЕсли;
			
			Запись.Обработан = Истина;
			
			ПрогрессОбновленияСотрудников(инд, КолвоФизЛицАПИ, АдресПрогресса, Запись.Сотрудник);
			
			Продолжить;
			
		КонецЕсли;
		
		Сотрудник = Неопределено;
		
		// найдем сотрудника по ключам поиска из менеджера модуля спр Сотрудники, если не находим, то создаем нового
		РеквизитыДляПоиска = РеквизитыДляПоиска(ФизЛицо);
		Результат = КонтурЛогистика_КонвертацияСервер.ДобавитьПараметрыВЗапросПоискаСправочникаЛогистики(
			Запрос, РеквизитыДляПоиска, Справочники.КонтурЛогистика_Сотрудники, Истина);
		
		Если ТипЗнч(Результат) = Тип("Строка") И Не ЗначениеЗаполнено(Результат) Тогда
			
			Сотрудник = СоздатьСотрудникаПофизЛицу(ФизЛицо);
			
		ИначеЕсли ТипЗнч(Результат) = Тип("СправочникСсылка.КонтурЛогистика_Сотрудники") И ЗначениеЗаполнено(Результат) Тогда
			
			Сотрудник = Результат;
			
			СотрудникОб = Сотрудник.ПолучитьОбъект();
			ЗаполнитьСотрудникаДаннымиФизическогоЛица(СотрудникОб, ФизЛицо);
			СотрудникОб.Записать();
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Сотрудник) Тогда
			
			Запись = РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.СоздатьМенеджерЗаписи();
			Запись.Сотрудник = Сотрудник;
			Запись.Организация = Организация;
			Запись.СценарийПриглашения = Перечисления.КонтурЛогистика_СценарииПриглашенийФизическихЛиц.Водитель;
			Запись.PersonId = ФизЛицо.id;
			Запись.UserId = ФизЛицо.userId;
			Запись.Телефон = Сотрудник.ТелефонОсновной;
			Запись.Статус = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение;
			ЗаполнитьЗначенияСвойств(Запись, ФизЛицо.ДанныеСотрудника);
			Запись.ТелефонСовпадает = Истина;
			
			Если ФизЛицо.ДанныеСотрудника.Свойство("ВУИд") Тогда
				Запись.IdentityDocumentId = ФизЛицо.ДанныеСотрудника.ВУИд;	
			КонецЕсли;
			
			Запись.Записать();
			
		КонецЕсли;
		
		ПрогрессОбновленияСотрудников(инд, КолвоФизЛицАПИ, АдресПрогресса, Сотрудник);
		
	КонецЦикла;
	
	Для каждого ФизЛицо Из СписокФизическихЛицРС Цикл
		
		Если ФизЛицо.Обработан Тогда
			Продолжить;
		КонецЕсли;
		
		Если ФизЛицо.Статус = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение 
			Или ФизЛицо.Статус = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение Тогда
			
			РеквизитыДляЗаписи = Новый Структура("Статус", Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.Удалено);
			ИзменитьЗапись(Организация, ФизЛицо.Сотрудник, РеквизитыДляЗаписи);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьДанныеСотрудникаИзСервиса(Сотрудник) Экспорт
	
	Отбор = Новый Структура("Сотрудник", Сотрудник);
	Выборка = РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.Выбрать(Отбор);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Статус <> Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение Тогда
			Продолжить;
		КонецЕсли;
		
		ЗагрузитьДанныеСотрудникаИзСервисаПоПриглашению(Выборка.Организация, Сотрудник, Выборка.PersonId, Выборка.Статус);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьДанныеСотрудникаИзСервисаПоПриглашению(Организация, Сотрудник, PersonId, Статус) Экспорт
	
	Результат = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛиц.ПолучитьФизическоеЛицо(Организация, PersonId);
	
	Если Результат.ФизЛицоУдалено Тогда
		РеквизитыДляЗаписи = Новый Структура("Статус", Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.Удалено);
	Иначе
	
		СотрудникОб = Сотрудник.ПолучитьОбъект();
		ЗаполнитьСотрудникаДаннымиФизическогоЛица(СотрудникОб, Результат.ФизЛицо);
		СотрудникОб.Записать();
		
		РеквизитыДляЗаписи = РеквизитыСотрудникаДляЗаписиРС(Сотрудник);
		
		Если Результат.ФизЛицо.ДанныеСотрудника.Свойство("ВУИд") И ЗначениеЗаполнено(Результат.ФизЛицо.ДанныеСотрудника.ВУИд) Тогда	
			РеквизитыДляЗаписи.Вставить("IdentityDocumentId", Результат.ФизЛицо.ДанныеСотрудника.ВУИд);
		КонецЕсли;
		
	КонецЕсли;
	
	ИзменитьЗапись(Организация, Сотрудник, РеквизитыДляЗаписи);
	
КонецПроцедуры

Процедура ВыгрузитьДанныеСотрудниковВСервис(Организация, АдресПрогресса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Сотрудник КАК Сотрудник,
		|	РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.PersonId КАК PersonId,
		|	РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.ВУДатаВыдачи КАК ВУДатаВыдачи,
		|	РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.ВУНомер КАК ВУНомер,
		|	РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.ВУСерия КАК ВУСерия,
		|	РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.IdentityDocumentId КАК IdentityDocumentId,
		|	ВЫБОР
		|		КОГДА РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение)
		|				И (РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Фамилия <> КонтурЛогистика_Сотрудники.Фамилия
		|					ИЛИ РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Имя <> КонтурЛогистика_Сотрудники.Имя
		|					ИЛИ РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Отчество <> КонтурЛогистика_Сотрудники.Отчество
		|					ИЛИ РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.ДатаРождения <> КонтурЛогистика_Сотрудники.ДатаРождения
		|					ИЛИ РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.ИНН <> КонтурЛогистика_Сотрудники.ИНН
		|					ИЛИ РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.СНИЛС <> КонтурЛогистика_Сотрудники.СНИЛС
		|					ИЛИ 
		|						ВЫБОР
		|							КОГДА РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение)
		|								ТОГДА ВЫБОР
		|										КОГДА ПОДСТРОКА(РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Сотрудник.ТелефонОсновной, 1, 1) = ""+""
		|												И ПОДСТРОКА(РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.ТелефонОсновной, 3, 20) <> ПОДСТРОКА(РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Сотрудник.ТелефонОсновной, 3, 20)
		|											ТОГДА ИСТИНА
		|										КОГДА (ПОДСТРОКА(РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Сотрудник.ТелефонОсновной, 1, 1) = ""7""
		|												ИЛИ ПОДСТРОКА(РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Сотрудник.ТелефонОсновной, 1, 1) = ""8"")
		|												И ПОДСТРОКА(РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.ТелефонОсновной, 3, 20) <> ПОДСТРОКА(РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Сотрудник.ТелефонОсновной, 2, 20)
		|											ТОГДА ИСТИНА
		|										ИНАЧЕ ЛОЖЬ
		|									КОНЕЦ
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ
		|					ИЛИ РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.АдресЭлектроннойПочты <> КонтурЛогистика_Сотрудники.АдресЭлектроннойПочты
		|					ИЛИ РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.ВУСерия <> КонтурЛогистика_Сотрудники.ВУСерия
		|					ИЛИ РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.ВУНомер <> КонтурЛогистика_Сотрудники.ВУНомер
		|					ИЛИ РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.ВУДатаВыдачи <> КонтурЛогистика_Сотрудники.ВУДатаВыдачи)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьРасхождения
		|ПОМЕСТИТЬ СотрудникиСПроверкойРасхождений
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК РегистрСведенийКонтурЛогистика_СервисФизическихЛиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_Сотрудники КАК КонтурЛогистика_Сотрудники
		|		ПО РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Сотрудник = КонтурЛогистика_Сотрудники.Ссылка
		|ГДЕ
		|	РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Организация = &Организация
		|	И РегистрСведенийКонтурЛогистика_СервисФизическихЛиц.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиСПроверкойРасхождений.Сотрудник КАК Сотрудник,
		|	СотрудникиСПроверкойРасхождений.PersonId КАК PersonId,
		|	СотрудникиСПроверкойРасхождений.ВУДатаВыдачи КАК ВУДатаВыдачи,
		|	СотрудникиСПроверкойРасхождений.ВУНомер КАК ВУНомер,
		|	СотрудникиСПроверкойРасхождений.ВУСерия КАК ВУСерия,
		|	СотрудникиСПроверкойРасхождений.IdentityDocumentId КАК IdentityDocumentId,
		|	СотрудникиСПроверкойРасхождений.ЕстьРасхождения КАК ЕстьРасхождения,
		|	СотрудникиСПроверкойРасхождений.Сотрудник.ВУДатаВыдачи КАК СотрудникВУДатаВыдачи,
		|	СотрудникиСПроверкойРасхождений.Сотрудник.ВУНомер КАК СотрудникВУНомер,
		|	СотрудникиСПроверкойРасхождений.Сотрудник.ВУСерия КАК СотрудникВУСерия
		|ИЗ
		|	СотрудникиСПроверкойРасхождений КАК СотрудникиСПроверкойРасхождений
		|ГДЕ
		|	СотрудникиСПроверкойРасхождений.ЕстьРасхождения";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	тзРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	КолвоФизЛиц = тзРезультатЗапроса.Количество();
	
	инд = 0;
	
	Для каждого Стр Из тзРезультатЗапроса Цикл
		
		ИдДокумента = "";
		Если Стр.ВУДатаВыдачи <= Стр.СотрудникВУДатаВыдачи
			ИЛИ (СокрЛП(Стр.ВУНомер) = СокрЛП(Стр.СотрудникВУНомер) 
				И СокрЛП(Стр.ВУСерия) = СокрЛП(Стр.СотрудникВУСерия)) Тогда
			ИдДокумента = Стр.IdentityDocumentId;
		КонецЕсли;
		
		Попытка
			
			ВыгрузитьДанныеСотрудникаВСервисПоПриглашению(
				Организация, Стр.Сотрудник, Стр.PersonId, ИдДокумента);
				
				ПрогрессОбновленияСотрудников(инд, КолвоФизЛиц, АдресПрогресса, Стр.Сотрудник);
			
		Исключение
			
			Сообщить(ОписаниеОшибки());
			
		КонецПопытки;
			
	КонецЦикла;
		
	
КонецПроцедуры

Процедура ВыгрузитьДанныеСотрудникаВСервис(Сотрудник) Экспорт
	
	Отбор = Новый Структура("Сотрудник", Сотрудник);
	Выборка = РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.Выбрать(Отбор);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Статус <> Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение Тогда
			Продолжить;
		КонецЕсли;
		
		ИдДокумента = ""; 
		Если СокрЛП(Выборка.ВУНомер) = СокрЛП(Сотрудник.ВУНомер) И СокрЛП(Выборка.ВУСерия) = СокрЛП(Сотрудник.ВУСерия) Тогда
			ИдДокумента = Выборка.IdentityDocumentId;
		КонецЕсли;
		
		ВыгрузитьДанныеСотрудникаВСервисПоПриглашению(Выборка.Организация, Сотрудник, Выборка.PersonId, ИдДокумента);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыгрузитьДанныеСотрудникаВСервисПоПриглашению(Организация, Сотрудник, PersonId, ИдДокумента = Неопределено) Экспорт
	
	КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛиц.ИзменитьФизическоеЛицо(Организация, Сотрудник, PersonId, , ИдДокумента);
	
	РеквизитыДляЗаписи = РеквизитыСотрудникаДляЗаписиРС(Сотрудник);
	ИзменитьЗапись(Организация, Сотрудник, РеквизитыДляЗаписи);
	
	ИзменитьТелефонВПриглашение(Сотрудник, Сотрудник.ТелефонОсновной, Истина);
	
КонецПроцедуры

Процедура ОбновитьФизическиеЛицаВсехСотрудников() Экспорт
	
	ДоступныеОрганизации = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ДоступныеОрганизацииДляСервисаФизЛиц();
	Для каждого Организация Из ДоступныеОрганизации Цикл
		
		СинхронизацияВыполнена = Истина;
		
		ДатаАктуальности = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗначениеНастройки(
			Организация, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийСервисаФизическихЛицДата);
	
		Если ДатаАктуальности = Неопределено Тогда
			ДатаАктуальности = Дата(1, 1, 1);
		КонецЕсли;
		
		Если ДатаАктуальности <> Дата(1, 1, 1) И НачалоДня(ДатаАктуальности) >= НачалоДня(ТекущаяДатаСеанса()) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ОбновитьФизическиеЛицаСотрудников(Организация);
		Исключение
			
			ТекстОшибки = "Ошибка при обновление сотрудников из сервиса. Ошибка: "
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
			Сообщить(ТекстОшибки);
			
			СинхронизацияВыполнена = Ложь;
			
			КонтурЛогистика_Метрика.ОбработатьОшибку("ОбновлятьФизическиеЛицаСотрудниковИзСервиса", ТекстОшибки, Организация);
			
		КонецПопытки;
		
		Сообщить("Обновление сотрудников " + Организация.Наименование + " выполнено");
		
		Если СинхронизацияВыполнена Тогда
			Справочники.КонтурЛогистика_ОрганизацииДиадок.УстановитьНастройку(Организация,
				Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийСервисаФизическихЛицДата, ТекущаяДатаСеанса()); 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьФизическиеЛицаСотрудников(Организация) Экспорт
	
	МассивДанных = МассивДанныхДляОбновленияФизЛицСотрудников(Организация);
	
	Для каждого Данные Из МассивДанных Цикл
		
		ПараметрыМетода = Новый Соответствие;
		ПараметрыМетода.Вставить("ids", Данные.МассивPersonId);
		
		СписокФизическихЛиц = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛиц.СписокФизическихЛиц(Организация, ПараметрыМетода);
		Для каждого ФизЛицо Из СписокФизическихЛиц Цикл
			
			Сотрудник = Данные.СоответствиеСотрудникФизЛицо.Получить(ФизЛицо.id);
			
			Если Не ЗначениеЗаполнено(Сотрудник) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеСотрудника = ФизЛицо.ДанныеСотрудника;
			РеквизитыДляЗаписи = РеквизитыСотрудникаДляЗаписиРС(ДанныеСотрудника);
			
			ИзменитьЗапись(Организация, Сотрудник, РеквизитыДляЗаписи, ФизЛицо.UserId);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьФизическиеЛицаСотрудника(Сотрудник) Экспорт
	
	Попытка
	
		Отбор = Новый Структура("Сотрудник", Сотрудник);
		Выборка = РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.Выбрать(Отбор);
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Статус = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение Тогда
				
				Результат = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛиц.ПолучитьФизическоеЛицо(Выборка.Организация, Выборка.PersonId);
				
				Если Результат.ФизЛицоУдалено Тогда
					РеквизитыДляЗаписи = Новый Структура("Статус", Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.Удалено);
				Иначе
					ДанныеСотрудника = Результат.ФизЛицо.ДанныеСотрудника;
					РеквизитыДляЗаписи = РеквизитыСотрудникаДляЗаписиРС(ДанныеСотрудника);
				КонецЕсли;
				
				ИзменитьЗапись(Выборка.Организация, Сотрудник, РеквизитыДляЗаписи);
				
			ИначеЕсли Выборка.Статус = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение Тогда
				
				РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.ПроверитьПриглашение(
					Выборка.Организация, Сотрудник, Выборка.СценарийПриглашения, Выборка.PersonId);
				
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьФизическоеЛицоСотрудника(Организация, Сотрудник, PersonId) Экспорт
	
	Попытка
	
		Результат = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛиц.ПолучитьФизическоеЛицо(Организация, PersonId);
		
		Если Результат.ФизЛицоУдалено Тогда
			РеквизитыДляЗаписи = Новый Структура("Статус", Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.Удалено);
		Иначе
			ДанныеСотрудника = Результат.ФизЛицо.ДанныеСотрудника;
			РеквизитыДляЗаписи = РеквизитыСотрудникаДляЗаписиРС(ДанныеСотрудника);
		КонецЕсли;
		
		ИзменитьЗапись(Организация, Сотрудник, РеквизитыДляЗаписи);
	
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Расхождения

Функция ЕстьРасхождения(Сотрудник, Организация = Неопределено) Экспорт
	
	Отбор = Новый Структура("Сотрудник", Сотрудник);
	Выборка = РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.Выбрать(Отбор);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Статус <> Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Организация) И Выборка.Организация <> Организация Тогда
			Продолжить;
		КонецЕсли;
	
		Результат = КонтурЛогистика_СервисФизическихЛицСервер.ПолучитьРасхождения(Выборка);
		
		Если Результат.ЕстьРасхождения Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьРасхожденияПоРеквизитам(Сотрудник, ПроверяемыеРеквизиты, Организация = Неопределено) Экспорт
	
	Отбор = Новый Структура("Сотрудник", Сотрудник);
	Выборка = РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.Выбрать(Отбор);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Статус <> Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Организация) И Выборка.Организация <> Организация Тогда
			Продолжить;
		КонецЕсли;
	
		Результат = КонтурЛогистика_СервисФизическихЛицСервер.ПолучитьРасхождения(Выборка);
		
		Для каждого Реквизит Из Результат.Реквизиты Цикл
			
			Если ЗначениеЗаполнено(ПроверяемыеРеквизиты) 
				И Найти(ПроверяемыеРеквизиты, Реквизит.Ключ)
				И Реквизит.Значение Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьРасхождения(Запись, ДанныеСотрудника = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Реквизиты", Новый Структура);
	Результат.Вставить("ЕстьРасхождения", Ложь);
	
	Реквизиты = КонтурЛогистика_СервисФизическихЛицКлиентСервер.ОбщиеРеквизитыСотрудникаИФизЛица();
	Для каждого Реквизит Из Реквизиты Цикл
		
		ИмяРеквизита = Реквизит.Ключ;
		ЗначениеРеквизитаСотрудника = ?(ДанныеСотрудника = Неопределено, Запись.Сотрудник[ИмяРеквизита], ДанныеСотрудника[ИмяРеквизита]);
		
		Если Не ЗначениеЗаполнено(Запись[ИмяРеквизита]) Или Не ЗначениеЗаполнено(ЗначениеРеквизитаСотрудника) Тогда
			Результат.Реквизиты.Вставить(ИмяРеквизита, Ложь);
			Продолжить;
		КонецЕсли;
		
		Если ИмяРеквизита = "ТелефонОсновной" Тогда
			Если Запись.ТелефонСовпадает Тогда
				Результат.Реквизиты.Вставить(ИмяРеквизита, Ложь);
			Иначе
				Результат.Реквизиты.Вставить(ИмяРеквизита, Истина);
				Результат.ЕстьРасхождения = Истина;
			КонецЕсли;
		ИначеЕсли Запись[ИмяРеквизита] <> ЗначениеРеквизитаСотрудника Тогда
			Результат.Реквизиты.Вставить(ИмяРеквизита, Истина);
			Результат.ЕстьРасхождения = Истина;
		Иначе
			Результат.Реквизиты.Вставить(ИмяРеквизита, Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Функция ПолныйСписокФизическихЛиц(Организация) Экспорт
	
	ПолныйСписокФизическихЛиц = Новый Массив;
	
	count = 100;
	skip = 0;
	КолвоФЛ = count;
		
	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("count", count);
	
	Пока КолвоФЛ = count Цикл
		
		ПараметрыЗапроса.Вставить("skip", skip);
		
		СписокФизическихЛицАПИ = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛиц.СписокФизическихЛиц(Организация, ПараметрыЗапроса);
		КолвоФЛ = СписокФизическихЛицАПИ.Количество();
		
		skip = skip + count;
		
		КонтурЛогистика_СтдКоллекцииКлиентСервер.ДополнитьМассивЛок(ПолныйСписокФизическихЛиц, СписокФизическихЛицАПИ);
	
	КонецЦикла;
	
	Возврат ПолныйСписокФизическихЛиц;
	
КонецФункции

Функция УдалитьФизическоеЛицо(Организация, Сотрудник, PersonId) Экспорт
	
	КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛиц.УдалитьФизическоеЛицо(Организация, PersonId);
	
	РеквизитыДляЗаписи = Новый Структура("Статус", Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.Удалено);
	ИзменитьЗапись(Организация, Сотрудник, РеквизитыДляЗаписи);
	
КонецФункции

Функция ЕстьОшибкиОбмена(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_СервисФизическихЛиц.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК КонтурЛогистика_СервисФизическихЛиц
		|ГДЕ
		|	КонтурЛогистика_СервисФизическихЛиц.ЕстьОшибка
		|	И КонтурЛогистика_СервисФизическихЛиц.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Статус", Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СотрудникЕстьВОрганизации(Сотрудник, Организация) Экспорт
	
	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение);
	Статусы.Добавить(Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение);
	Статусы.Добавить(Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.НеОтправленоПриглашение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_СервисФизическихЛиц.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК КонтурЛогистика_СервисФизическихЛиц
		|ГДЕ
		|	КонтурЛогистика_СервисФизическихЛиц.Сотрудник = &Сотрудник
		|	И КонтурЛогистика_СервисФизическихЛиц.Организация = &Организация
		|	И КонтурЛогистика_СервисФизическихЛиц.СценарийПриглашения = &СценарийПриглашения
		|	И КонтурЛогистика_СервисФизическихЛиц.PersonId <> """"
		|	И КонтурЛогистика_СервисФизическихЛиц.Статус В (&Статусы)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СценарийПриглашения", Перечисления.КонтурЛогистика_СценарииПриглашенийФизическихЛиц.Водитель);
	Запрос.УстановитьПараметр("Статусы", Статусы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ОрганизацииСНеактульнойДатойСинхронизации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =		
		"ВЫБРАТЬ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Организация
		|ПОМЕСТИТЬ ОрганизацияССервисомФЛ
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_НастройкиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|		ПО (КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок = КонтурЛогистика_ОрганизацииДиадок.Ссылка)
		|ГДЕ
		|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
		|	И КонтурЛогистика_НастройкиОрганизаций.Настройка = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey)
		|	И КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки <> НЕОПРЕДЕЛЕНО
		|	И КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки <> """"""""
		|	И КонтурЛогистика_ОрганизацииДиадок.Наш
		|	И КонтурЛогистика_ОрганизацииДиадок.DirectoryId <> """"""""
		|	И (КонтурЛогистика_ОрганизацииДиадок.Перевозчик
		|			ИЛИ КонтурЛогистика_ОрганизацииДиадок.Оформитель)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОрганизацияССервисомФЛ.Организация КАК Организация,
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки КАК ДАТА), ДЕНЬ), &ТекДата, ДЕНЬ) КАК КолвоДней
		|ИЗ
		|	ОрганизацияССервисомФЛ КАК ОрганизацияССервисомФЛ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_НастройкиОрганизаций
		|		ПО (КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок = ОрганизацияССервисомФЛ.Организация)
		|ГДЕ
		|	КонтурЛогистика_НастройкиОрганизаций.Настройка = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийСервисаФизическихЛицДата)
		|	И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки КАК ДАТА), ДЕНЬ), &ТекДата, ДЕНЬ) > 7
		|
		|УПОРЯДОЧИТЬ ПО
		|	КолвоДней УБЫВ";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДанныеЗаписиРегистраСведений(Организация, Сотрудник, СценарийПриглашения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК КонтурЛогистика_СервисФизическихЛиц
		|ГДЕ
		|	КонтурЛогистика_СервисФизическихЛиц.Сотрудник = &Сотрудник
		|	И КонтурЛогистика_СервисФизическихЛиц.Организация = &Организация
		|	И КонтурЛогистика_СервисФизическихЛиц.СценарийПриглашения = &СценарийПриглашения";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СценарийПриглашения", СценарийПриглашения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи;
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Процедура ИзменитьТелефонВПриглашение(Сотрудник, НовыйТелефон, ИзменитьПриСинхронизации = Ложь) Экспорт
	
	Статусы = Новый Массив;
	Если ИзменитьПриСинхронизации Тогда
		Статусы.Добавить(Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение);
	Иначе
		Статусы.Добавить(Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.НеСоздано);
		Статусы.Добавить(Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.НеОтправленоПриглашение);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_СервисФизическихЛиц.Сотрудник КАК Сотрудник,
		|	КонтурЛогистика_СервисФизическихЛиц.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК КонтурЛогистика_СервисФизическихЛиц
		|ГДЕ
		|   КонтурЛогистика_СервисФизическихЛиц.Сотрудник = &Сотрудник
		|	И КонтурЛогистика_СервисФизическихЛиц.Статус В (&Статусы)";
	
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 1 Тогда
		ИзменитьЗапись(РезультатЗапроса[0].Организация, Сотрудник, Новый Структура("Телефон", НовыйТелефон));
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПустуюЗапись(Организация, Сотрудник, СценарийПриглашения) Экспорт
	
	Запись = РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.СоздатьМенеджерЗаписи();
	Запись.Организация = Организация;
	Запись.Сотрудник = Сотрудник;
	Запись.СценарийПриглашения = СценарийПриглашения;
	Запись.Записать();
	
КонецПроцедуры

Процедура ИзменитьЗапись(Организация, Сотрудник, Реквизиты, UserId = Неопределено) Экспорт
	
	Запись = РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.СоздатьМенеджерЗаписи();
	Запись.Организация = Организация;
	Запись.Сотрудник = Сотрудник;
	Запись.СценарийПриглашения = Перечисления.КонтурЛогистика_СценарииПриглашенийФизическихЛиц.Водитель;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		
		Для каждого Реквизит Из Реквизиты Цикл
			 
			ИмяРеквизита = Реквизит.Ключ;
			Запись[ИмяРеквизита] = Реквизит.Значение;
			
			Если ИмяРеквизита = "ТелефонОсновной" Тогда
				Запись.ТелефонСовпадает = ТелефоныСовпадают(Сотрудник[ИмяРеквизита], Реквизит.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		Если Запись.Статус = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение И ЗначениеЗаполнено(UserId) Тогда
			Запись.Статус = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение;
			Запись.UserId = UserId;
		КонецЕсли;
		
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТелефоныСовпадают(Знач Телефон1, Знач Телефон2) Экспорт
	
	Телефон1Числа = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СтрокаИзЧисел(Телефон1);
	Телефон2Числа = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СтрокаИзЧисел(Телефон2);
	
	Если Лев(Телефон1Числа, 2) = "79" Тогда
		Телефон1Числа = "8" + Прав(Телефон1Числа, СтрДлина(Телефон1Числа) - 1);	
	КонецЕсли;
	Если Лев(Телефон2Числа, 2) = "79" Тогда
		Телефон2Числа = "8" + Прав(Телефон2Числа, СтрДлина(Телефон1Числа) - 1);	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Телефон1Числа) Или Не ЗначениеЗаполнено(Телефон2Числа) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Телефон1Числа = Телефон2Числа;
		
КонецФункции

Функция РеквизитыСотрудникаДляЗаписиРС(Сотрудник)
	
	Реквизиты = КонтурЛогистика_СервисФизическихЛицКлиентСервер.ОбщиеРеквизитыСотрудникаИФизЛица();
	Для каждого Реквизит Из Реквизиты Цикл
		
		ИмяРеквизита = Реквизит.Ключ;
		
		Реквизиты.Вставить(ИмяРеквизита, Сотрудник[ИмяРеквизита]);
		
	КонецЦикла;
	
	Возврат Реквизиты;
	
КонецФункции

Процедура ПринятьПриглашение(Организация, Сотрудник, UserId)
		
	Запись = РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.СоздатьМенеджерЗаписи();
	Запись.Организация = Организация;
	Запись.Сотрудник = Сотрудник;
	Запись.СценарийПриглашения = Перечисления.КонтурЛогистика_СценарииПриглашенийФизическихЛиц.Водитель;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Запись.UserId = UserId;
		Запись.Статус = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение;
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция СписокФизическихЛицИзРегистраСведений(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_СервисФизическихЛиц.PersonId КАК PersonId,
		|	КонтурЛогистика_СервисФизическихЛиц.Сотрудник КАК Сотрудник,
		|	КонтурЛогистика_СервисФизическихЛиц.Статус КАК Статус,
		|	КонтурЛогистика_СервисФизическихЛиц.Фамилия КАК Фамилия,
		|	КонтурЛогистика_СервисФизическихЛиц.Имя КАК Имя,
		|	КонтурЛогистика_СервисФизическихЛиц.Отчество КАК Отчество,
		|	КонтурЛогистика_СервисФизическихЛиц.ДатаРождения КАК ДатаРождения,
		|	КонтурЛогистика_СервисФизическихЛиц.ИНН КАК ИНН,
		|	КонтурЛогистика_СервисФизическихЛиц.СНИЛС КАК СНИЛС,
		|	КонтурЛогистика_СервисФизическихЛиц.ТелефонОсновной КАК ТелефонОсновной,
		|	КонтурЛогистика_СервисФизическихЛиц.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты,
		|	КонтурЛогистика_СервисФизическихЛиц.ВУДатаВыдачи КАК ВУДатаВыдачи,
		|	КонтурЛогистика_СервисФизическихЛиц.ВУНомер КАК ВУНомер,
		|	КонтурЛогистика_СервисФизическихЛиц.ВУСерия КАК ВУСерия,
		|	КонтурЛогистика_СервисФизическихЛиц.ТелефонСовпадает КАК ТелефонСовпадает,
		|	ЛОЖЬ КАК Обработан
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК КонтурЛогистика_СервисФизическихЛиц
		|ГДЕ
		|	КонтурЛогистика_СервисФизическихЛиц.Организация = &Организация
		|	И НЕ КонтурЛогистика_СервисФизическихЛиц.Сотрудник.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РеквизитыДляПоиска(ФизЛицо)

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Реквизит");
	Результат.Колонки.Добавить("Значение");
	
	Если ФизЛицо.ДанныеСотрудника.Свойство("ИНН") Тогда
		ДобавитьСтрокуВтзРеквизитыДляПоиска(Результат, "ИНН", ФизЛицо.ДанныеСотрудника.ИНН);
	КонецЕсли;
	Если ФизЛицо.ДанныеСотрудника.Свойство("СНИЛС") Тогда
		ДобавитьСтрокуВтзРеквизитыДляПоиска(Результат, "СНИЛС", ФизЛицо.ДанныеСотрудника.СНИЛС);
	КонецЕсли;
	
	Если ФизЛицо.ДанныеСотрудника.Свойство("Фамилия") Тогда
		ДобавитьСтрокуВтзРеквизитыДляПоиска(Результат, "Фамилия", ФизЛицо.ДанныеСотрудника.Фамилия);
	КонецЕсли;
	Если ФизЛицо.ДанныеСотрудника.Свойство("Имя") Тогда
		ДобавитьСтрокуВтзРеквизитыДляПоиска(Результат, "Имя", ФизЛицо.ДанныеСотрудника.Имя);
	КонецЕсли;
	Если ФизЛицо.ДанныеСотрудника.Свойство("Отчество") Тогда
		ДобавитьСтрокуВтзРеквизитыДляПоиска(Результат, "Отчество", ФизЛицо.ДанныеСотрудника.Отчество);
	КонецЕсли;
		
	Если ФизЛицо.ДанныеСотрудника.Свойство("ДатаРождения") Тогда
		ДобавитьСтрокуВтзРеквизитыДляПоиска(Результат, "ДатаРождения", ФизЛицо.ДанныеСотрудника.ДатаРождения);
	КонецЕсли;
	
	Если ФизЛицо.ДанныеСотрудника.Свойство("ВУНомер") Тогда
		ДобавитьСтрокуВтзРеквизитыДляПоиска(Результат, "ВУНомер", ФизЛицо.ДанныеСотрудника.ВУНомер);
	КонецЕсли;
	Если ФизЛицо.ДанныеСотрудника.Свойство("ВУСерия") Тогда
		ДобавитьСтрокуВтзРеквизитыДляПоиска(Результат, "ВУСерия", ФизЛицо.ДанныеСотрудника.ВУСерия);
	КонецЕсли;
	Если ФизЛицо.ДанныеСотрудника.Свойство("ВУДатаВыдачи") Тогда
		ДобавитьСтрокуВтзРеквизитыДляПоиска(Результат, "ВУДатаВыдачи", ФизЛицо.ДанныеСотрудника.ВУДатаВыдачи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуВтзРеквизитыДляПоиска(тз, Реквизит, Значение)
	
	НоваяСтрока = тз.Добавить();
	НоваяСтрока.Реквизит = Реквизит;
	НоваяСтрока.Значение = Значение;
	
КонецПроцедуры

Функция СоздатьСотрудникаПофизЛицу(ФизЛицо)
	
	Сотрудник = Справочники.КонтурЛогистика_Сотрудники.СоздатьЭлемент();
	ЗаполнитьСотрудникаДаннымиФизическогоЛица(Сотрудник, ФизЛицо, Истина);
	Сотрудник.Записать();
	
	Возврат Сотрудник.Ссылка;
	
Конецфункции

Процедура ЗаполнитьСотрудникаДаннымиФизическогоЛица(Сотрудник, ФизЛицо, НовыйСотрудник = Ложь)
	
	Реквизиты = КонтурЛогистика_СервисФизическихЛицКлиентСервер.ОбщиеРеквизитыСотрудникаИФизЛица();
	
	Для каждого Реквизит Из Реквизиты Цикл
		
		Если Не ЗначениеЗаполнено(ФизЛицо.ДанныеСотрудника[Реквизит.Ключ]) Тогда
			Продолжить;
		КонецЕсли;
		
		Сотрудник[Реквизит.Ключ] = ФизЛицо.ДанныеСотрудника[Реквизит.Ключ];
		
	КонецЦикла;
	
	Если НовыйСотрудник Тогда
		Сотрудник.ТелефонОсновной = ФизЛицо.ДанныеСотрудника.ТелефонОсновной;
		Сотрудник.АдресЭлектроннойПочты = ФизЛицо.ДанныеСотрудника.АдресЭлектроннойПочты;
	КонецЕсли;
		
	Сотрудник.РольВодитель = Истина;
	
КонецПроцедуры

Процедура ПрогрессОбновленияСотрудников(ПорядковыйНомер, Колво, Адрес, Сотрудник = Неопределено)

	ПорядковыйНомер = ПорядковыйНомер + 1;
	
	Если ЗначениеЗаполнено(Адрес) Тогда
		ПоместитьВоВременноеХранилище(Новый Структура("ПорядковыйНомер, Колво, Сотрудник", ПорядковыйНомер, Колво, Сотрудник), Адрес);
	КонецЕсли;
	
КонецПроцедуры

Функция МассивДанныхДляОбновленияФизЛицСотрудников(Организация)
	
	// соберем массив personId по 100 шт для метода СписокФизическихЛиц с параметром ids
	
	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение);
	Статусы.Добавить(Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение);
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ		
		|	КонтурЛогистика_СервисФизическихЛиц.PersonId КАК PersonId,
		|	КонтурЛогистика_СервисФизическихЛиц.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК КонтурЛогистика_СервисФизическихЛиц
		|ГДЕ
		|	КонтурЛогистика_СервисФизическихЛиц.Статус В (&Статусы)
		|	И КонтурЛогистика_СервисФизическихЛиц.Организация = &Организация		
		|";
	
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	инд = 0;	
	Данные = Новый Структура;
	Данные.Вставить("МассивPersonId", Новый Массив);
	Данные.Вставить("СоответствиеСотрудникФизЛицо", Новый Соответствие);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если инд = 100 Тогда
			
			Результат.Добавить(Данные);
			
			инд = 0;
			
			Данные = Новый Структура;
			Данные.Вставить("МассивPersonId", Новый Массив);
			Данные.Вставить("СоответствиеСотрудникФизЛицо", Новый Соответствие);
			
			Данные.МассивPersonId.Добавить(ВыборкаДетальныеЗаписи.PersonId);
			Данные.СоответствиеСотрудникФизЛицо.Вставить(ВыборкаДетальныеЗаписи.PersonId, ВыборкаДетальныеЗаписи.Сотрудник);
			
		Иначе	
			
			Данные.МассивPersonId.Добавить(ВыборкаДетальныеЗаписи.PersonId);
			Данные.СоответствиеСотрудникФизЛицо.Вставить(ВыборкаДетальныеЗаписи.PersonId, ВыборкаДетальныеЗаписи.Сотрудник);
			
		КонецЕсли;
		
		инд = инд + 1;
		
	КонецЦикла;
	
	Результат.Добавить(Данные);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти