////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интеграция с 1С:Документооборотом"
// Модуль ИнтеграцияС1СДокументооборотКлиентСервер: клиент, сервер
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает представление типа объекта XDTO Документооборота по имени типа.
// По умолчанию возвращает представление в единственном числе.
//
// Параметры:
//   ТипXDTO - Строка - имя типа объекта XDTO.
//   МножественноеЧисло - Булево - требуется вернуть представление во множественном числе.
//   ДляФормыВыбора - Булево - требуется вернуть представление для формы выбора, начинающееся с "Выбор ...".
//
// Возвращаемое значение:
//   Строка - представление типа объекта XDTO Документооборота по имени типа.
//
Функция ПредставлениеТипаОбъектаXDTO(ТипXDTO, МножественноеЧисло = Ложь, ДляФормыВыбора = Ложь) Экспорт
	
	ЕдинственноеЧисло = Не МножественноеЧисло И Не ДляФормыВыбора;
	
	ПредставленияТипов = Новый Соответствие;
	
	// Справочники.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Контрагент, Организация, Пользователь'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор стороны'");
	Иначе
		Представление = НСтр("ru = 'Контрагенты, Организации, Пользователи'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMParty", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Проект'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор проекта'");
	Иначе
		Представление = НСтр("ru = 'Проекты'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMProject", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Проектная задача'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор проектной задачи'");
	Иначе
		Представление = НСтр("ru = 'Проектные задачи'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMProjectTask", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Мероприятие'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор мероприятия'");
	Иначе
		Представление = НСтр("ru = 'Мероприятия'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMMeeting", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Тема обсуждения'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор темы обсуждений'");
	Иначе
		Представление = НСтр("ru = 'Темы обсуждений'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMDiscussionTopic", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Сообщение обсуждения'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор сообщения обсуждений'");
	Иначе
		Представление = НСтр("ru = 'Сообщения обсуждений'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMDiscussionMessage", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Файл'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор файла'");
	Иначе
		Представление = НСтр("ru = 'Файлы'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMFile", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Папка файлов'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор папки файлов'");
	Иначе
		Представление = НСтр("ru = 'Папки файлов'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMFileFolder", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Папка внутренних документов'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор папки внутренних документов'");
	Иначе
		Представление = НСтр("ru = 'Папки внутренних документов'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMInternalDocumentFolder", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Папка мероприятий'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор папки мероприятий'");
	Иначе
		Представление = НСтр("ru = 'Папки мероприятий'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMMeetingFolder", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Пользователь'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор пользователя'");
	Иначе
		Представление = НСтр("ru = 'Пользователи'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMUser", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Группа пользователей'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор группы пользователей'");
	Иначе
		Представление = НСтр("ru = 'Группы пользователей'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMUserGroup", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вопрос деятельности'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вопроса деятельности'");
	Иначе
		Представление = НСтр("ru = 'Вопросы деятельности'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMActivityMatter", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Валюта'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор валюты'");
	Иначе
		Представление = НСтр("ru = 'Валюты'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMCurrency", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Внутренний документ'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор внутреннего документа'");
	Иначе
		Представление = НСтр("ru = 'Внутренние документы'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMInternalDocument", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Входящий документ'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор входящего документа'");
	Иначе
		Представление = НСтр("ru = 'Входящие документы'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMIncomingDocument", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Исходящий документ'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор исходящего документа'");
	Иначе
		Представление = НСтр("ru = 'Исходящие документы'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMOutgoingDocument", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Организация'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор организации'");
	Иначе
		Представление = НСтр("ru = 'Организации'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMOrganization", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Контрагент'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор контрагента'");
	Иначе
		Представление = НСтр("ru = 'Контрагенты'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMCorrespondent", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Контактное лицо'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор контактного лица'");
	Иначе
		Представление = НСтр("ru = 'Контактные лица'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMContactPerson", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Гриф доступа'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор грифа доступа'");
	Иначе
		Представление = НСтр("ru = 'Грифы доступа'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMAccessLevel", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Способ доставки'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор способа доставки'");
	Иначе
		Представление = НСтр("ru = 'Способы доставки'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMDeliveryMethod", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Подразделение'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор подразделения'");
	Иначе
		Представление = НСтр("ru = 'Подразделения'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMSubdivision", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид внутреннего документа'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида внутренних документов'");
	Иначе
		Представление = НСтр("ru = 'Виды внутренних документов'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMInternalDocumentType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид входящего документа'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида входящих документов'");
	Иначе
		Представление = НСтр("ru = 'Виды входящих документов'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMIncomingDocumentType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид исходящего документа'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида исходящих документов'");
	Иначе
		Представление = НСтр("ru = 'Виды исходящих документов'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMOutgoingDocumentType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид мероприятия'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида мероприятия'");
	Иначе
		Представление = НСтр("ru = 'Виды мероприятий'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMMeetingType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид работ'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида работ'");
	Иначе
		Представление = НСтр("ru = 'Виды работ'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMWorkType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Тип связей'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор типа связей'");
	Иначе
		Представление = НСтр("ru = 'Типы связей'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMRelationType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Значение свойств объектов'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор значения свойств объектов'");
	Иначе
		Представление = НСтр("ru = 'Значения свойств объектов'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMObjectPropertyValue", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Физическое лицо'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор физического лица'");
	Иначе
		Представление = НСтр("ru = 'Физические лица'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMPrivatePerson", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Условие маршрутизации'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор условия маршрутизации'");
	Иначе
		Представление = НСтр("ru = 'Условия маршрутизации'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMRoutingCondition", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Личный адресат'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор личного адресата'");
	Иначе
		Представление = НСтр("ru = 'Личные адресаты'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMPersonalRecipient", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Группа личных адресатов'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор группы личных адресатов'");
	Иначе
		Представление = НСтр("ru = 'Группы личных адресатов'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMPersonalRecipientGroup", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Роль исполнителя'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор роли исполнителей'");
	Иначе
		Представление = НСтр("ru = 'Роли исполнителей'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessExecutorRole", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Статья движения денежных средств'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор статьи движения денежных средств'");
	Иначе
		Представление = НСтр("ru = 'Статьи движения денежных средств'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMCashFlowItem", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Единица измерения'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор единицы измерения'");
	Иначе
		Представление = НСтр("ru = 'Единицы измерения'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMMeasurementUnit", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Товар, услуга'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор номенклатуры'");
	Иначе
		Представление = НСтр("ru = 'Товары и услуги'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMProduct", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Ставка НДС'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор ставки НДС'");
	Иначе
		Представление = НСтр("ru = 'Ставки НДС'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMVATRateUniversal", Представление);
	
	// Письма электронной почты.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Входящее письмо'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор входящего письма'");
	Иначе
		Представление = НСтр("ru = 'Входящие письма'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMIncomingEMail", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Исходящее письмо'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор исходящего письма'");
	Иначе
		Представление = НСтр("ru = 'Исходящие письма'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMOutgoingEMail", Представление);
	
	// Рабочие отчеты.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Ежедневный отчет'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор ежедневного отчета'");
	Иначе
		Представление = НСтр("ru = 'Ежедневные отчеты'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMDailyReport", Представление);
	
	// Фактические трудозатраты.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Фактические трудозатраты'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор фактических трудозатрат'");
	Иначе
		Представление = НСтр("ru = 'Фактические трудозатраты'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMActualWork", Представление);
	
	// Используемые перечисления.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Тип ответа'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор типа ответа'");
	Иначе
		Представление = НСтр("ru = 'Типы ответа'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMEMailAnswerType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид вопросов выполнения задач'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида вопросов выполнения задач'");
	Иначе
		Представление = НСтр("ru = 'Виды вопросов выполнения задач'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMIssueType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Порядок продления'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор порядка продления'");
	Иначе
		Представление = НСтр("ru = 'Порядки продления'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMProlongationProcedure", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Состояние документа'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор состояния документа'");
	Иначе
		Представление = НСтр("ru = 'Состояния документов'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMDocumentStatus", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Состояние мероприятия'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор состояния мероприятия'");
	Иначе
		Представление = НСтр("ru = 'Состояния мероприятий'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMMeetingStatus", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Состояние протокола мероприятия'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор состояния протокола мероприятия'");
	Иначе
		Представление = НСтр("ru = 'Состояния протоколов мероприятий'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMMeetingMinutesItemStatus", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Юридическое\физическое лицо'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор юр\физ лица'");
	Иначе
		Представление = НСтр("ru = 'Юридическое\физическое лица'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMLegalPrivatePerson", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Ставка НДС'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор ставки НДС'");
	Иначе
		Представление = НСтр("ru = 'Ставки НДС'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMVATRate", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вариант подписания'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор варианта подписания'");
	Иначе
		Представление = НСтр("ru = 'Варианты подписания'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMSignatureOption", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Тип контактной информации'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор типа контактной информации'");
	Иначе
		Представление = НСтр("ru = 'Типы контактной информации'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMContactInformationType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Категория дел'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор категории дел'");
	Иначе
		Представление = НСтр("ru = 'Категории дел'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMCategoriesOfCases", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'День недели'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор дня недели'");
	Иначе
		Представление = НСтр("ru = 'Дни недели'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMDaysOfTheWeek", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вид дня'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор вида дня'");
	Иначе
		Представление = НСтр("ru = 'Виды дней'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMKindsOfDays", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Политика учета рабочего времени'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор политики учета рабочего времени'");
	Иначе
		Представление = НСтр("ru = 'Политики учета рабочего времени'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMTimeTrackingPolicy", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Тип ответа'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор типа ответа'");
	Иначе
		Представление = НСтр("ru = 'Типы ответа'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMIncomingEMailAnswerType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Состояние приглашения'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор состояния приглашения'");
	Иначе
		Представление = НСтр("ru = 'Состояния приглашения'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMInvitationStatus", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Результат приглашения'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор результата приглашения'");
	Иначе
		Представление = НСтр("ru = 'Результаты приглашения'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMInvitationResult", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Общий результат приглашения'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор общего результата приглашения'");
	Иначе
		Представление = НСтр("ru = 'Общие результаты приглашения'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMGeneralInvitationResult", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Результат согласования'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор результата согласования'");
	Иначе
		Представление = НСтр("ru = 'Результаты согласования'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMApprovalResult", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Результат утверждения'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор результата утверждения'");
	Иначе
		Представление = НСтр("ru = 'Результаты утверждения'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMConfirmationResult", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Результат регистрации'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор результата регистрации'");
	Иначе
		Представление = НСтр("ru = 'Результаты регистрации'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMRegistrationResult", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Дополнительный реквизит / сведение'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор дополнительного реквизита'");
	Иначе
		Представление = НСтр("ru = 'Дополнительные реквизиты и сведения'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMAdditionalProperty", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Способ указания времени'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор способа указания времени'");
	Иначе
		Представление = НСтр("ru = 'Способы указания времени'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMTimeInputMethod", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вариант маршрутизации задач'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор варианта маршрутизации задач'");
	Иначе
		Представление = НСтр("ru = 'Варианты маршрутизации задач'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMApprovalType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Порядок выполнения задач'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор порядка выполнения задач'");
	Иначе
		Представление = НСтр("ru = 'Порядок выполнения задач'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMTaskExecutionOrder", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Порядок согласования'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор порядка согласования'");
	Иначе
		Представление = НСтр("ru = 'Порядок согласования'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMApprovalOrder", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Важность писем'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор важности писем'");
	Иначе
		Представление = НСтр("ru = 'Важность писем'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMEMailImportance", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Состояние бизнес-процесса'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор бизнес-процесса'");
	Иначе
		Представление = НСтр("ru = 'Состояния бизнес-процессов'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessState", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вариант маршрутизации задач'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор варианта маршрутизации задач'");
	Иначе
		Представление = НСтр("ru = 'Варианты маршрутизации задач'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessRoutingType", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Условие рассмотрения предшественников этапа'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор условия рассмотрения предшественников этапа'");
	Иначе
		Представление = НСтр("ru = 'Условия рассмотрения предшественников этапа'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMPredecessorsStageConsiderationCondition", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вариант важности задачи'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор варианта важности задачи'");
	Иначе
		Представление = НСтр("ru = 'Варианты важности задачи'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessTaskImportance", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Вариант важности задачи'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор варианта важности задачи'");
	Иначе
		Представление = НСтр("ru = 'Варианты важности задачи'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessImportance", Представление);
	
	// Типизированные задачи.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Задача исполнителя'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор задачи исполнителя'");
	Иначе
		Представление = НСтр("ru = 'Задачи исполнителей'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessTask", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessOrderTaskCheckup", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessApprovalTaskApproval", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessApprovalTaskCheckup", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessConfirmationTaskConfirmation", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessConfirmationTaskCheckup", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessRegistrationTaskRegistration", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessRegistrationTaskCheckup", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessPerfomanceTaskCheckup", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessConsiderationTaskAcquaint", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessIssuesSolutionTaskQuestion", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessIssuesSolutionTaskAnswer", Представление);
	
	// Шаблоны бизнес-процессов.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Шаблон %1'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор шаблона %1'");
	Иначе
		Представление = НСтр("ru = 'Шаблоны %1'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessOrderTemplate", СтрШаблон(Представление, НСтр("ru='поручения'")));
	ПредставленияТипов.Вставить("DMBusinessProcessConsiderationTemplate", СтрШаблон(Представление, НСтр("ru='рассмотрения'")));
	ПредставленияТипов.Вставить("DMBusinessProcessRegistrationTemplate", СтрШаблон(Представление, НСтр("ru='регистрации'")));
	ПредставленияТипов.Вставить("DMBusinessProcessApprovalTemplate", СтрШаблон(Представление, НСтр("ru='согласования'")));
	ПредставленияТипов.Вставить("DMBusinessProcessConfirmationTemplate", СтрШаблон(Представление, НСтр("ru='утверждения'")));
	ПредставленияТипов.Вставить("DMBusinessProcessPerformanceTemplate", СтрШаблон(Представление, НСтр("ru='исполнения'")));
	ПредставленияТипов.Вставить("DMBusinessProcessAcquaintanceTemplate", СтрШаблон(Представление, НСтр("ru='ознакомления'")));
	ПредставленияТипов.Вставить("DMCompoundBusinessProcessTemplate", СтрШаблон(Представление, НСтр("ru='составных бизнес процессов'")));
	
	// Бизнес-процессы.
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Поручение'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор поручения'");
	Иначе
		Представление = НСтр("ru = 'Поручения'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessOrder", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Рассмотрение'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор рассмотрения'");
	Иначе
		Представление = НСтр("ru = 'Рассмотрения'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessConsideration", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Регистрация'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор регистрации'");
	Иначе
		Представление = НСтр("ru = 'Регистрации'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessRegistration", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Согласование'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор согласования'");
	Иначе
		Представление = НСтр("ru = 'Согласования'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessApproval", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessApproval_1.2.1.11", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Утверждение'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор утверждения'");
	Иначе
		Представление = НСтр("ru = 'Утверждения'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessConfirmation", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Исполнение'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор исполнения'");
	Иначе
		Представление = НСтр("ru = 'Исполнения'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessPerformance", Представление);
	ПредставленияТипов.Вставить("DMBusinessProcessPerformance_1.2.1.11", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Ознакомление'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор ознакомления'");
	Иначе
		Представление = НСтр("ru = 'Ознакомления'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessAcquaintance", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Решение вопросов выполнения задач'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор решения вопросов выполнения задач'");
	Иначе
		Представление = НСтр("ru = 'Решения вопросов выполнения задач'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessIssuesSolution", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Обработка внутреннего документа'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор обработки внутреннего документа'");
	Иначе
		Представление = НСтр("ru = 'Обработки внутреннего документа'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessInternalDocumentProcessing", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Обработка входящего документа'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор обработки входящего документа'");
	Иначе
		Представление = НСтр("ru = 'Обработки входящего документа'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessIncomingDocumentProcessing", Представление);
	
	Если ЕдинственноеЧисло Тогда
		Представление = НСтр("ru = 'Обработка исходящего документа'");
	ИначеЕсли ДляФормыВыбора Тогда
		Представление = НСтр("ru = 'Выбор обработки исходящего документа'");
	Иначе
		Представление = НСтр("ru = 'Обработки исходящего документа'");
	КонецЕсли;
	ПредставленияТипов.Вставить("DMBusinessProcessOutgoingDocumentProcessing", Представление);
	
	ПредставлениеТипа = ПредставленияТипов.Получить(ТипXDTO);
	
	Если ЗначениеЗаполнено(ПредставлениеТипа) Тогда
		Возврат ПредставлениеТипа;
	Иначе
		Возврат ТипXDTO;
	КонецЕсли;
	
КонецФункции

// Преобразует длительность интервала времени в строку вида час:мин.
//
// Параметры:
//   Длительность - Число - длительность интервала времени в секундах.
//   ПредставлениеНуля - Строка - представление интервала нулевой длительности.
//
// Возвращаемое значение:
//   Строка - представление интервала в виде час:мин.
//
Функция ЧислоВСтроку(Длительность, ПредставлениеНуля = "'") Экспорт
	
	Если Длительность = 0 Тогда
		Возврат ПредставлениеНуля;
	КонецЕсли;
	
	Час = Цел(Длительность / 3600);
	Мин = (Длительность - Час*3600) / 60;
	
	Возврат Формат(Час, "ЧЦ=2; ЧН=; ЧВН=; ЧГ=") + ":" + Формат(Мин, "ЧЦ=2; ЧН=; ЧВН=; ЧГ=");
	
КонецФункции

// Преобразует строку вида час:мин в длительность интервала времени.
//
// Параметры:
//   ДлительностьСтр - Строка - представление интервала времени в виде строки час:мин.
//
// Возвращаемое значение:
//   Число - длительность интервала времени в секундах.
//
Функция ЧислоИзСтроки(ДлительностьСтр) Экспорт
	
	Если Не ЗначениеЗаполнено(ДлительностьСтр) Тогда
		Возврат 0;
	КонецЕсли;
	
	Поз = Найти(ДлительностьСтр, ":");
	Если Поз = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Час = Лев(ДлительностьСтр, Поз-1);
	Мин = Сред(ДлительностьСтр, Поз+1);
	
	Возврат Число(Час) * 3600 + Число(Мин) * 60;
	
КонецФункции

// Выполняет проверку строки на соответствие представлению интервала времени в виде час:мин.
//
// Параметры:
//   ДлительностьСтр - Строка - проверяемая строка.
//
// Возвращаемое значение:
//   Булево - Истина, если переданная строка соответствует виду час:мин, и Ложь в противном случае.
//
Функция ПроверитьФормат(ДлительностьСтр) Экспорт
	
	Поз = Найти(ДлительностьСтр, ":");
	Если Поз = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЧасСтр = Лев(ДлительностьСтр, Поз-1);
	МинСтр = Сред(ДлительностьСтр, Поз+1);
	
	Если Не ЗначениеЗаполнено(ЧасСтр) Тогда
		ЧасСтр = "00";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(МинСтр) Тогда
		МинСтр = "00";
	КонецЕсли;
	
	Час = Число(ЧасСтр);
	Мин = Число(МинСтр);
	Если (Час >= 24) Или (Мин >= 60) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Час < 10 Тогда
		ЧасСтр = "0" + Час;
	КонецЕсли;
	Если Мин < 10 Тогда
		МинСтр = "0" + Мин;
	КонецЕсли;
	
	ДлительностьСтр = ЧасСтр + ":" + МинСтр;
	
	Возврат Истина;
	
КонецФункции

// Возвращает строку представления проекта и проектной задачи для одного поля.
//
// Параметры:
//   Проект - ЛюбаяСсылка, Строка - ссылка или строка представления проекта.
//   ПроектнаяЗадача - ЛюбаяСсылка, Строка - ссылка или строка представления проектной задачи.
//
// Возвращаемое значение:
//   Строка
//
Функция ПредставлениеПроектаЗадачи(Проект, ПроектнаяЗадача) Экспорт
	
	ПредставлениеПроектаЗадачи = "";
	
	Если ЗначениеЗаполнено(ПроектнаяЗадача) Тогда
		
		ПредставлениеПроектаЗадачи = Строка(Проект) + " (" + Строка(ПроектнаяЗадача) + ")";
		
	ИначеЕсли ЗначениеЗаполнено(Проект) Тогда
		
		ПредставлениеПроектаЗадачи = Строка(Проект);
		
	КонецЕсли;
	
	Возврат ПредставлениеПроектаЗадачи;
	
КонецФункции

// Добавляет к Строке Разделитель и ДобавляемоеЗначение в случае, если Строка и
// ДобавляемоеЗначение не пустые. Если Строка пустая или ДобавляемоеЗначение
// не заполнено - то добавляет к Строке ДобавляемоеЗначение.
//
// Параметры:
//   ИсходнаяСтрока - Строка - Модифицируется в процедуре.
//   Разделитель - Строка - Разделитель.
//   ДобавляемоеЗначение - Строка - Добавляемое значение.
//
Процедура ДобавитьЗначениеКСтрокеЧерезРазделитель(ИсходнаяСтрока, Разделитель, ДобавляемоеЗначение) Экспорт
	
	Если ПустаяСтрока(ИсходнаяСтрока) Тогда
		ИсходнаяСтрока = Строка(ДобавляемоеЗначение);
	ИначеЕсли Не ПустаяСтрока(ДобавляемоеЗначение) Тогда
		ИсходнаяСтрока = Строка(ИсходнаяСтрока) + Разделитель + ДобавляемоеЗначение;
	КонецЕсли;
	
КонецПроцедуры

// Получает картинку предмета из библиотеки согласно его роли.
//
// Параметры:
//   РольПредмета - Строка - роль предмета.
//
// Возвращаемое значение:
//   Картинка - картинка из библиотеки.
//
Функция КартинкаПоРолиПредмета(РольПредмета) Экспорт
	
	Если РольПредмета = "Заполняемый" Тогда //@NON-NLS-1
		Возврат БиблиотекаКартинок.ПредметЗаполняемый16;
	ИначеЕсли РольПредмета = "Вспомогательный" Тогда //@NON-NLS-1
		Возврат БиблиотекаКартинок.ПредметВспомогательный16;
	Иначе
		Возврат БиблиотекаКартинок.ПредметОсновной16;
	КонецЕсли;
	
КонецФункции

// Получает номер картинки предмета в коллекции согласно его роли.
//
// Параметры:
//   РольПредмета - Строка - роль предмета.
//
// Возвращаемое значение:
//   Число - номер картинки из КоллекцияРолиПредметов
//
Функция НомерКартинкиПоРолиПредмета(РольПредмета) Экспорт
	
	Если РольПредмета = "Заполняемый" Тогда //@NON-NLS-1
		Возврат 5;
	ИначеЕсли РольПредмета = "Вспомогательный" Тогда //@NON-NLS-1
		Возврат 3;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

// Проверяет, является ли справочником тип объекта ДО.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//
// Возвращаемое значение:
//   Булево - истина, если тип соответствует справочнику ДО.
//
Функция ЭтоСправочник(Тип) Экспорт
	
	Возврат Тип = "DMCorrespondent"
		Или Тип = "DMCurrency"
		Или Тип = "DMOrganization"
		Или Тип = "DMFile"
		Или Тип = "DMProject"
		Или Тип = "DMSubdivision";
	
КонецФункции

// Проверяет, является ли документом в прикладном смысле тип объекта ДО.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//
// Возвращаемое значение:
//   Булево - истина, если тип соответствует документу ДО (в прикладном смысле).
//
Функция ЭтоДокумент(Тип) Экспорт
	
	Возврат Тип = "DMInternalDocument"
		Или Тип = "DMIncomingDocument"
		Или Тип = "DMOutgoingDocument";
	
КонецФункции

// Проверяет, является ли тип объекта ДО бизнес-процессом.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//
// Возвращаемое значение:
//   Булево - истина, если тип соответствует бизнес-процессу ДО.
//
Функция ЭтоБизнесПроцесс(Тип) Экспорт
	
	// Проверка родительского типа средствами фабрики слишком медленна.
	Возврат Тип = "DMBusinessProcess"
		Или Тип = "DMBusinessProcessAcquaintance"
		Или Тип = "DMBusinessProcessApproval"
		Или Тип = "DMBusinessProcessApproval_1.2.1.11"
		Или Тип = "DMBusinessProcessConfirmation"
		Или Тип = "DMBusinessProcessConsideration"
		Или Тип = "DMBusinessProcessInvitation"
		Или Тип = "DMBusinessProcessIssuesSolution"
		Или Тип = "DMBusinessProcessOrder"
		Или Тип = "DMBusinessProcessPerformance"
		Или Тип = "DMBusinessProcessPerformance_1.2.1.11"
		Или Тип = "DMBusinessProcessRegistration"
		Или Тип = "DMBusinessProcessIncomingDocumentProcessing"
		Или Тип = "DMBusinessProcessInternalDocumentProcessing"
		Или Тип = "DMBusinessProcessOutgoingDocumentProcessing"
		Или Тип = "DMComplexBusinessProcess";
	
КонецФункции

// Проверяет, является ли тип объекта ДО задачей бизнес-процесса.
//
// Параметры:
//   Тип - Строка - имя типа XDTO.
//
// Возвращаемое значение:
//   Булево - истина, если тип соответствует задаче ДО.
//
Функция ЭтоЗадачаБизнесПроцесса(Тип) Экспорт
	
	// Проверка родительского типа средствами фабрики слишком медленна.
	Возврат Тип = "DMBusinessProcessTask"
		Или Тип = "DMBusinessProcessApprovalTaskApproval"
		Или Тип = "DMBusinessProcessApprovalTaskCheckup"
		Или Тип = "DMBusinessProcessConfirmationTaskCheckup"
		Или Тип = "DMBusinessProcessConfirmationTaskConfirmation"
		Или Тип = "DMBusinessProcessConsiderationTaskAcquaint"
		Или Тип = "DMBusinessProcessInvitationTaskAcquaint"
		Или Тип = "DMBusinessProcessInvitationTaskInvitation"
		Или Тип = "DMBusinessProcessInvitationTaskNotify"
		Или Тип = "DMBusinessProcessIssuesSolutionTaskAnswer"
		Или Тип = "DMBusinessProcessIssuesSolutionTaskQuestion"
		Или Тип = "DMBusinessProcessOrderTaskCheckup"
		Или Тип = "DMBusinessProcessPerfomanceTaskCheckup"
		Или Тип = "DMBusinessProcessRegistrationTaskCheckup"
		Или Тип = "DMBusinessProcessRegistrationTaskRegistration";
	
КонецФункции

// Получает строковое представление срока действия по значениям реквизитов формы.
//
// Параметры:
//   ДатаНачала - Дата - дата начала действия.
//   Бессрочный - Булево - Истина, если документ бессрочный.
//   ДатаОкончания - Дата - дата окончания действия.
//   ПорядокПродленияID - Строка - порядок продления.
//   ПорядокПродления - Строка - описание порядка продления.
//
// Возвращаемое значение:
//   Строка - представление срока действия.
//
Функция ПредставлениеСрокаДействияДокумента(ДатаНачала, Бессрочный, ДатаОкончания,  ПорядокПродленияID,
		ПорядокПродления) Экспорт
	
	Результат = "";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'с %1'"),
			Формат(ДатаНачала, "ДЛФ=D"));
	КонецЕсли;
	
	Если Бессрочный = Истина Тогда
		Результат = СтрШаблон(НСтр("ru = '%1, бессрочный'"),
			Результат);
	ИначеЕсли ЗначениеЗаполнено(ДатаОкончания) Тогда
		Результат = СтрШаблон(НСтр("ru = '%1 по %2'"),
			Результат,
			Формат(ДатаОкончания, "ДЛФ=D"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПорядокПродленияID) Тогда
		Если ПорядокПродленияID = "НеПродлевается" Тогда //@NON-NLS-1
			ДобавитьЗначениеКСтрокеЧерезРазделитель(
				Результат,
				Символы.ПС,
					НСтр("ru = 'Не продлевается'"));
		ИначеЕсли ПорядокПродленияID = "ДопускаетПродление" Тогда //@NON-NLS-1
			ДобавитьЗначениеКСтрокеЧерезРазделитель(
				Результат,
				Символы.ПС,
					НСтр("ru = 'Допускает продление'"));
		Иначе
			ДобавитьЗначениеКСтрокеЧерезРазделитель(
				Результат,
				Символы.ПС,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Продлевается %1'"),
					НРег(ПорядокПродления)));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает HTML-представление документа для показа в карточке по объекту XDTO.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма обработки ИнтеграцияС1СДокументооборот с данными документа.
//
// Возвращаемое значение:
//   Строка - HTML-представление документа.
//
Функция ПолучитьОбзорДокумента(Форма) Экспорт
	
	HTMLЗаголовок =
		"<html>
		|<head>
		|<style type=""text/css"">
		|	body {
		|		overflow:    auto;
		|		margin-top:  6px;
		|		margin-left: 10px;
		|		margin-bottom: 0px;
		|		font-family: Arial, sans-serif;
		|		font-size:   10pt;}
		|	table {
		|		width:       100%;
		|		font-family: Arial, sans-serif;
		|		font-size:   10pt;}
		|	td {vertical-align: top;}
		| 	a:link {
		|		color: #006699; text-decoration: none;}
		|	a:visited {
		|		color: #006699; text-decoration: none;}
		|	a:hover {
		|		color: #006699; text-decoration: underline;}
		|	p {
		|		margin-top: 7px;}
		|</style>
		|<body>";
	
	HTMLЗавершение = "</body></html>";
	HTMLТекст = HTMLЗаголовок;
	
	HTMLТекст = HTMLТекст + "<table>";
	HTMLТекст = HTMLТекст + "<tr>";
	
	Если Форма.Тип = "DMIncomingDocument" Тогда
		
		HTMLТекст = HTMLТекст + "<td width=""40%"" align=center >";
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'От кого:'"), "");
		HTMLТекст = HTMLТекст + "<p>";
		ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Отправитель,
			Форма.ОтправительID, Форма.ОтправительТип);
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + ВРег(Форма.ВидДокумента);
		HTMLТекст = HTMLТекст + "<p>";
		
		Если ЗначениеЗаполнено(Форма.НомерОтправителя) И ЗначениеЗаполнено(Форма.ДатаОтправителя) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "",
				Формат(Форма.ДатаОтправителя, "ДЛФ=D") + " № " + Форма.НомерОтправителя);
		Иначе
			ДобавитьРеквизитКHTML(HTMLТекст, "__________ №__________", "");
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "<td>";
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "<td width=""40%"">";
		
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Кому:'"), "");
		HTMLТекст = HTMLТекст + "<p>";
		ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Организация);
		Если ЗначениеЗаполнено(Форма.Адресат) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Адресат);
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Подразделение) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подразделение:'"), Форма.Подразделение);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.ДатаРегистрации) И ЗначениеЗаполнено(Форма.РегистрационныйНомер) Тогда
			
			HTMLТекст = HTMLТекст + "<p>";
			ДобавитьРеквизитКHTML(HTMLТекст, "",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Рег. № %1 от %2'"),
					Форма.РегистрационныйНомер, Формат(Форма.ДатаРегистрации, "ДЛФ=D")));
			
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "</tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""3"">";
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<B>%1</B>",
			Форма.Наименование);
		
		Если ЗначениеЗаполнено(Форма.Описание) Или ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.Описание) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "", СтрЗаменить(Форма.Описание, Символы.ПС, "<br>"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Срок исполнения:'"),
				Формат(Форма.СрокИсполнения, "ДЛФ=D"),,,
				?(Форма.СостояниеИсполнениеID <> "Исполнен" И Форма.СрокИсполнения < НачалоДня(ТекущаяДата()),
					"B22222",
					"")); //@NON-NLS-3
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<p>";
		
		Если Форма.Сумма <> 0 Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Сумма:'"),
				Формат(Форма.Сумма, "ЧДЦ=2; ЧН=0") + " " + Форма.Валюта);
		КонецЕсли;
		
		ДобавитьДополнительныеСвойства(HTMLТекст, Форма);
		
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		Если ЗначениеЗаполнено(Форма.Подписал) Тогда
			
			HTMLТекст = HTMLТекст + "<tr>";
			HTMLТекст = HTMLТекст + "<td colspan=""3"">";
			
			HTMLТекст = HTMLТекст + "<p>";
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:'"), Форма.Подписал);
			
			HTMLТекст = HTMLТекст + "</td></tr>";
			
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"">";
		Если ЗначениеЗаполнено(Форма.Ответственный)
			Или ЗначениеЗаполнено(Форма.Подразделение) Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Ответственный) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Ответственный:'"), Форма.Ответственный);
		КонецЕсли;
		HTMLТекст = HTMLТекст + "</tr>";
		
	ИначеЕсли Форма.Тип = "DMInternalDocument" Тогда
		
		HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"">";
		
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 № %2 от %3'"),
			ВРег(Форма.ВидДокумента),
			?(ЗначениеЗаполнено(Форма.РегистрационныйНомер), Форма.РегистрационныйНомер, "_____"),
			?(ЗначениеЗаполнено(Форма.ДатаРегистрации), Формат(Форма.ДатаРегистрации, "ДЛФ=D"), "_____"));
		
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"" >";
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<B>%1</B>",
			Форма.Наименование);
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"" >";
		
		Если ЗначениеЗаполнено(Форма.Описание) Или ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.Описание) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "", СтрЗаменить(Форма.Описание, Символы.ПС, "<br>"));
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Тогда
			ДобавитьРеквизитКHTML(
				HTMLТекст,
				НСтр("ru = 'Срок исполнения:'"),
				Формат(Форма.СрокИсполнения, "ДЛФ=D"),,,
				?(Форма.СостояниеИсполнениеID <> "Исполнен" И Форма.СрокИсполнения < НачалоДня(ТекущаяДата()),
					"B22222",
					"")); //@NON-NLS-3
		КонецЕсли;
		
		Если Форма.Сумма <> 0 Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Сумма:'"),
				Формат(Форма.Сумма, "ЧДЦ=2; ЧН=0") + " " + Форма.Валюта);
			
			Если Форма.ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.ВнутреннийДокумент"
					И Форма.УчитыватьНДС Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Сумма НДС:'"),
					Формат(Форма.СуммаНДС, "ЧДЦ=2; ЧН=0") + " " + Форма.Валюта);
			КонецЕсли;
			
			Если Форма.ВестиУчетТоваровИУслуг И Форма.Товары.Количество() > 0 Тогда
				КоличествоПозиций = Форма.Товары.Количество();
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Товары и услуги:'"),
					Формат(КоличествоПозиций, "ЧГ=") + " "
						+ ПользователиСлужебныйКлиентСервер.ПредметЦелогоЧисла(
							КоличествоПозиций,
							"",
							НСтр("ru = 'позиция,позиции,позиций,,,,,,0'")));
			КонецЕсли;
			
			Если Форма.ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.ВнутреннийДокумент"
					И Форма.ВестиУчетПоСтатьямДДС Тогда
				СтатьиДДС = Форма.СтатьиДДС;
				КоличествоСтатей = СтатьиДДС.Количество();
				Если КоличествоСтатей = 1 Тогда
					ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Статья ДДС:'"),
						СтатьиДДС[0].СтатьяДДС);
				ИначеЕсли КоличествоСтатей > 1 Тогда
					ДобавитьПодписьКHTML(HTMLТекст, НСтр("ru = 'Статьи ДДС:'"));
					Разделитель = "";
					Для Каждого Строка Из СтатьиДДС Цикл
						HTMLТекст = HTMLТекст + Разделитель;
						ДобавитьЗначениеКHTML(HTMLТекст, Строка.СтатьяДДС, "");
						Разделитель = "; ";
					КонецЦикла;
					HTMLТекст = HTMLТекст + "<br>";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ДобавитьПредставлениеСрокаДействия(HTMLТекст, Форма);
		ДобавитьДополнительныеСвойства(HTMLТекст, Форма);
		
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		Если Форма.ВестиУчетПоКонтрагентам
				И (ЗначениеЗаполнено(Форма.Контрагент)
					Или Форма.Контрагенты.Количество()
					Или Форма.ЯвляетсяЗаявкойНаОплату) Тогда
			HTMLТекст = HTMLТекст + "<tr>";
			
			HTMLТекст = HTMLТекст + "<td width=""70%"">";
			HTMLТекст = HTMLТекст + "<p>";
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Наша организация:'"), "");
			HTMLТекст = HTMLТекст + "<p>";
			ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Организация);
			
			Если ЗначениеЗаполнено(Форма.Подписал) Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:'"), Форма.Подписал);
			КонецЕсли;
			HTMLТекст = HTMLТекст + "</td>";
			
			ИспользоватьТерминКорреспонденты = Ложь;
			
			Если Не Форма.НесколькоКонтрагентов Тогда
				Если ЗначениеЗаполнено(Форма.Контрагент) Тогда
					HTMLТекст = HTMLТекст + "<td>";
					HTMLТекст = HTMLТекст + "<p>";
					
					Если ИспользоватьТерминКорреспонденты Тогда
						ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Корреспондент:'"), "");
					Иначе
						ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контрагент:'"), "");
					КонецЕсли;
					
					HTMLТекст = HTMLТекст + "<p>";
					
					ДобавитьРеквизитКHTML(HTMLТекст, "",
						Форма.Контрагент,
						Форма.КонтрагентID,
						Форма.КонтрагентТип);
					
					Если ЗначениеЗаполнено(Форма.ПодписалОтКонтрагента) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:'"), Форма.ПодписалОтКонтрагента);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Форма.КонтактноеЛицо) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контакт:'"), Форма.КонтактноеЛицо);
					КонецЕсли;
					
					HTMLТекст = HTMLТекст + "</td></tr>";
				КонецЕсли;
			Иначе
				HTMLТекст = HTMLТекст + "<td>";
				HTMLТекст = HTMLТекст + "<p>";
				
				Количество = 0;
				Для Каждого СтрокаКонтрагент Из Форма.Контрагенты Цикл
					Если ЗначениеЗаполнено(СтрокаКонтрагент.КонтрагентID) Тогда
						Количество = Количество + 1;
					КонецЕсли;
				КонецЦикла;
				
				Если Количество = 1 Тогда
					ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контрагент:'"), "");
				Иначе
					ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контрагенты:'"), "");
				КонецЕсли;
				
				HTMLТекст = HTMLТекст + "<p>";
				
				Для Каждого СтрокаКонтрагент Из Форма.Контрагенты Цикл
					Если ЗначениеЗаполнено(СтрокаКонтрагент.КонтрагентID) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст, "",
							СтрокаКонтрагент.Контрагент,
							СтрокаКонтрагент.КонтрагентID,
							СтрокаКонтрагент.КонтрагентТип);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаКонтрагент.ПодписалОтКонтрагента) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст,
							НСтр("ru = 'Подписал:'"),
							СтрокаКонтрагент.ПодписалОтКонтрагента);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаКонтрагент.КонтактноеЛицо) Тогда
						ДобавитьРеквизитКHTML(HTMLТекст,
							НСтр("ru = 'Контакт:'"),
							СтрокаКонтрагент.КонтактноеЛицо);
					КонецЕсли;
					
					HTMLТекст = HTMLТекст + "<p>";
				КонецЦикла;
				
				// Удаление лишнего отступа
				HTMLТекст = Лев(HTMLТекст, СтрДлина(HTMLТекст) - 3);
			КонецЕсли;
			HTMLТекст = HTMLТекст + "</tr>";
		Иначе
			ДобавитьСтороны(HTMLТекст, Форма);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"">";
		
		Если ЗначениеЗаполнено(Форма.Ответственный)
				Или ЗначениеЗаполнено(Форма.Подразделение)
				Или ЗначениеЗаполнено(Форма.Подготовил) Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Подготовил) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подготовил:'"), Форма.Подготовил);
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Подразделение) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подразделение:'"), Форма.Подразделение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Ответственный) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Ответственный:'"), Форма.Ответственный);
		КонецЕсли;
		HTMLТекст = HTMLТекст + "</tr>";
		
	ИначеЕсли Форма.Тип = "DMOutgoingDocument" Тогда
		
		HTMLТекст = HTMLТекст + "<td width=""40%"" align=center >";
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'От кого:'"), "");
		HTMLТекст = HTMLТекст + "<p>";
		ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Организация);
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + ВРег(Форма.ВидДокумента);
		HTMLТекст = HTMLТекст + "<p>";
		
		Если ЗначениеЗаполнено(Форма.ДатаРегистрации) И ЗначениеЗаполнено(Форма.РегистрационныйНомер) Тогда
			
			ДобавитьРеквизитКHTML(HTMLТекст, "",
				Формат(Форма.ДатаРегистрации, "ДЛФ=D") + " № " +  Форма.РегистрационныйНомер);
			
		Иначе
			
			ДобавитьРеквизитКHTML(HTMLТекст, "__________ №__________", "");
			
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "<td>";
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "<td width=""40%"">";
		
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Кому:'"), "");
		HTMLТекст = HTMLТекст + "<p>";
		ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Получатель,
			Форма.ПолучательID, Форма.ПолучательТип);
		Если ЗначениеЗаполнено(Форма.Адресат) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "", Форма.Адресат);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "</td>";
		HTMLТекст = HTMLТекст + "</tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""3"">";
		
		HTMLТекст = HTMLТекст + "<p>";
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<B>%1</B>",
			Форма.Наименование);
		
		Если ЗначениеЗаполнено(Форма.Описание) Или ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.Описание) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, "",
				СтрЗаменить(Форма.Описание, Символы.ПС, "<br>"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.СрокИсполнения) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Срок ответа:'"),
				Формат(Форма.СрокИсполнения, "ДЛФ=D"));
		КонецЕсли;
		
		Если Форма.Сумма <> 0 Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Сумма:'"),
				Формат(Форма.Сумма, "ЧДЦ=2; ЧН=0") + " " + Форма.Валюта);
		КонецЕсли;
		
		ДобавитьДополнительныеСвойства(HTMLТекст, Форма);
		
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""3"">";
		Если ЗначениеЗаполнено(Форма.Подписал) Или ЗначениеЗаполнено(Форма.Подготовил)
				Или ЗначениеЗаполнено(Форма.Подразделение) Тогда
			
			Если ЗначениеЗаполнено(Форма.СрокИсполнения) Или Форма.Сумма <> 0 Тогда
				HTMLТекст = HTMLТекст + "<p>";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Форма.Подписал) Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:'"), Форма.Подписал);
			КонецЕсли;
			Если ЗначениеЗаполнено(Форма.Подготовил) Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подготовил:'"), Форма.Подготовил);
			КонецЕсли;
			Если ЗначениеЗаполнено(Форма.Подразделение) Тогда
				ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подразделение:'"), Форма.Подразделение);
			КонецЕсли;
			
		КонецЕсли;
		HTMLТекст = HTMLТекст + "</td></tr>";
		
		HTMLТекст = HTMLТекст + "<tr>";
		HTMLТекст = HTMLТекст + "<td colspan=""2"">";
		Если ЗначениеЗаполнено(Форма.Ответственный) Тогда
			HTMLТекст = HTMLТекст + "<p>";
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Ответственный) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Ответственный:'"), Форма.Ответственный);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "</tr>";
		
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "<br>";
	
	HTMLТекст = HTMLТекст + "<tr>";
	HTMLТекст = HTMLТекст + "<td colspan=""3"">";
	
	HTMLТекст = HTMLТекст + "<p>";
	
	Если Форма.Тип = "DMInternalDocument" И ЗначениеЗаполнено(Форма.Папка) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Папка:'"), Форма.Папка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.ГрифДоступа) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Гриф:'"), Форма.ГрифДоступа);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.ВопросДеятельности) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Вопрос:'"), Форма.ВопросДеятельности);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.Проект) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Проект:'"), Форма.Проект);
	КонецЕсли;
	
	ДобавитьПредставлениеСостояний(HTMLТекст, Форма);
	
	Если ЗначениеЗаполнено(Форма.Комментарий) Тогда
		ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Комментарий:'"), Форма.Комментарий);
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "</td></tr>";
	
	HTMLТекст = HTMLТекст + "</table>";
	
	HTMLТекст = HTMLТекст + HTMLЗавершение;
	
	Возврат HTMLТекст;
	
КонецФункции

// Формирует текстовое представление состава документа.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения -  форма обработки ИнтеграцияС1СДокументооборот с данными документа.
//
// Возвращаемое значение:
//   Строка - текстовое представление состава документа.
//
Функция ПолучитьСтрокуСоставДокумента(Форма) Экспорт
	
	СтрокаСостав = ?(Форма.КоличествоЛистов > 0, СтрШаблон(
		НСтр("ru = 'листов %1,'") + " ", Форма.КоличествоЛистов), "");
			
	СтрокаСостав = СтрокаСостав + ?(Форма.КоличествоПриложений > 0, СтрШаблон(
		НСтр("ru = 'приложений %1,'") + " ", Форма.КоличествоПриложений), "");
			
	СтрокаСостав = СтрокаСостав + ?(Форма.ЛистовВПриложениях > 0, СтрШаблон(
		НСтр("ru = 'листов в приложениях %1,'") + " ", Форма.ЛистовВПриложениях), "");
			
	СтрокаСостав = СтрокаСостав + ?(Форма.КоличествоЭкземпляров > 0, СтрШаблон(
		НСтр("ru = 'экземпляров %1,'") + " ", Форма.КоличествоЭкземпляров), "");
			
	СтрокаСостав = ВРег(Лев(СтрокаСостав,1)) + Прав(СтрокаСостав, СтрДлина(СтрокаСостав) - 1);
	
	Если Прав(СтрокаСостав, 2) = ", " Тогда
		СтрокаСостав = Лев(СтрокаСостав, СтрДлина(СтрокаСостав) - 2);
	КонецЕсли;
	
	Возврат СтрокаСостав;
	
КонецФункции

// Строковое описание разности дат в днях с учетом склонений
//
// Параметры:
//   Дата1 - Дата - первая дата.
//   Дата2 - Дата - вторая дата.
//   ИспользоватьДатуИВремяВСрокахЗадач - Булево - признак использования даты в сроках задач.
//
// Возвращаемое значение:
//   Строка - текстовое представление разности дат.
//
Функция РазностьДатВДнях(Дата1, Дата2, ИспользоватьДатуИВремяВСрокахЗадач = Истина) Экспорт
	
	Если ИспользоватьДатуИВремяВСрокахЗадач Тогда
		ЧислоЧасов = Окр((Дата1 - Дата2) / (60*60));
		ЧислоДней = Окр(ЧислоЧасов / 24);
		ЧислоЧасов = ЧислоЧасов - ЧислоДней * 24;
	Иначе
		ЧислоЧасов = 0;
		ЧислоДней = (НачалоДня(Дата1) - НачалоДня(Дата2)) / (60*60*24);
	КонецЕсли;
		
	Если ЧислоЧасов < 0 Тогда
		ЧислоДней = ЧислоДней - 1;
		ЧислоЧасов = ЧислоЧасов + 24;
	КонецЕсли;
	ПодписьДней = ПолучитьПодписьДней(ЧислоДней);
	ПодписьЧасов = ПолучитьПодписьЧасов(ЧислоЧасов);
	
	Если ИспользоватьДатуИВремяВСрокахЗадач Тогда
		Если ЧислоДней > 0 И ЧислоЧасов > 0 Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 %2 и %3 %4'"),
				Строка(ЧислоДней),
				ПодписьДней,
				Строка(ЧислоЧасов),
				ПодписьЧасов);
		ИначеЕсли ЧислоДней > 0 Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 %2",
				Строка(ЧислоДней),
				ПодписьДней);
		ИначеЕсли ЧислоЧасов > 0 Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 %2",
				Строка(ЧислоЧасов),
				ПодписьЧасов);
		Иначе
			Возврат НСтр("ru = 'Менее 1 часа'");
		КонецЕсли;
	Иначе
		Если ЧислоДней > 0 Тогда
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 %2",
				Строка(ЧислоДней),
				ПодписьДней);
		Иначе
			Возврат НСтр("ru = 'Менее 1 дня'");
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет подпись к HTML-представлению объекта.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Подпись - Строка - текст подписи.
//
Процедура ДобавитьПодписьКHTML(HTMLТекст, Подпись)
	
	Если ЗначениеЗаполнено(Подпись) Тогда
		HTMLТекст = HTMLТекст + "<FONT color=#413003>";
		HTMLТекст = HTMLТекст + Подпись + " ";
		HTMLТекст = HTMLТекст + "</FONT>";
	КонецЕсли;
	
КонецПроцедуры

// Добавляет значение к HTML-представлению, оформляя его как ссылку при необходимости.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Представление - Строка - добавляемое значение.
//   Идентификатор - Строка - идентификатор добавляемого значения.
//   Тип - Строка - тип добавляемого значения.
//
Процедура ДобавитьЗначениеКHTML(HTMLТекст, Представление, Идентификатор = Неопределено, Тип = Неопределено, Цвет = "")
	
	Если ЗначениеЗаполнено(Идентификатор) И ЗначениеЗаполнено(Тип) Тогда
		HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<A href=dmil:%1>%2</A>",
			Тип + ":" + Идентификатор,
			Представление);
	Иначе
		Если ЗначениеЗаполнено(Цвет) Тогда
			HTMLТекст = HTMLТекст + "<FONT color=#"+Цвет+">";
			HTMLТекст = HTMLТекст + Представление;
			HTMLТекст = HTMLТекст + "</FONT>";
		Иначе
			HTMLТекст = HTMLТекст + Представление;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Добавляет реквизит (подпись и значение) к HTML-представлению объекта
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Подпись - Строка - подпись реквизита.
//   Представление - Строка - добавляемое значение.
//   Идентификатор - Строка - идентификатор добавляемого значения.
//   Тип - Строка - тип добавляемого значения.
//
Процедура ДобавитьРеквизитКHTML(HTMLТекст, Подпись, Представление, Идентификатор = Неопределено, Тип = Неопределено,
		Цвет = "")
	
	ДобавитьПодписьКHTML(HTMLТекст, Подпись);
	ДобавитьЗначениеКHTML(HTMLТекст, Представление, Идентификатор, Тип, Цвет);
	HTMLТекст = HTMLТекст + "<br>";
	
КонецПроцедуры

// Добавляет представление состояний документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДобавитьПредставлениеСостояний(HTMLТекст, Форма)
	
	ПредставлениеМассив = Новый Массив;
	Последовательность = Новый Структура;
	Последовательность.Вставить("СостояниеСогласование");
	Последовательность.Вставить("СостояниеУтверждение");
	Последовательность.Вставить("СостояниеРегистрация");
	Последовательность.Вставить("СостояниеРассмотрение");
	Если Форма.Тип = "DMInternalDocument" Тогда
		Последовательность.Вставить("СостояниеПодписание");
	КонецЕсли;
	Последовательность.Вставить("СостояниеИсполнение");
	Для Каждого ТипСостояния Из Последовательность Цикл
		Состояние = Форма[ТипСостояния.Ключ];
		Если ЗначениеЗаполнено(Состояние) Тогда
			ПредставлениеМассив.Добавить(Состояние);
		КонецЕсли;
	КонецЦикла;
	
	КоличествоСостояний = ПредставлениеМассив.Количество();
	Если КоличествоСостояний > 1 Тогда
		Для Индекс = 0 По КоличествоСостояний - 1 Цикл
			Если ПредставлениеМассив[Индекс] = "Проект" Тогда
				ПредставлениеМассив.Удалить(Индекс);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Представление = СтрСоединить(ПредставлениеМассив, ", ");
	
	// Старые версии сервиса дают только одно состояние.
	Представление = ?(Представление = "", Форма.Состояние, Представление);
	Если Представление = "" Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьПодписьКHTML(HTMLТекст, НСтр("ru = 'Состояние:'"));
	HTMLТекст = HTMLТекст
		+ ?(Форма.ДоступенФункционалКОРП,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<A href=dmil:%1:%2:%3>%4</A>",
				Форма.Тип, Форма.ID, "status",
				Представление),
			Представление)
		+ "<br>";
	
КонецПроцедуры

// Добавляет представление срока действия документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДобавитьПредставлениеСрокаДействия(HTMLТекст, Форма)
	
	Представление = ПредставлениеСрокаДействияДокумента(
		Форма.ДатаНачалаДействия, Форма.Бессрочный, Форма.ДатаОкончанияДействия,
		Форма.ПорядокПродленияID, Форма.ПорядокПродления);
	Если Представление = "" Тогда
		Возврат;
	КонецЕсли;
		
	ДобавитьПодписьКHTML(HTMLТекст, НСтр("ru = 'Срок действия:'"));
	HTMLТекст = HTMLТекст + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<A href=dmil:%1:%2:%3>%4</A>",
		Форма.Тип, Форма.ID, "term",
		Представление)
		+ "<br>";
		
КонецПроцедуры

// Добавляет дополнительные свойства документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДобавитьДополнительныеСвойства(HTMLТекст, Форма)
	
	Для Каждого СтрокаСвойства Из Форма.Свойства Цикл
		Если ЗначениеЗаполнено(СтрокаСвойства.Значение) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст,
				СтрокаСвойства.Свойство + ":",
				СтрокаСвойства.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет стороны документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДобавитьСтороны(HTMLТекст, Форма)
	
	Если Не Форма.ВестиУчетСторон И Форма.Стороны.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиОрганизации = Новый Массив;
	СтрокиКонтрагенты = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Форма.Стороны Цикл
		Если СтрокаТаблицы.СторонаТип = "DMOrganization"
				Или ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИмяТипаXDTO(
					СтрокаТаблицы.СторонаТип) = "DMOrganization" Тогда
			СтрокиОрганизации.Добавить(СтрокаТаблицы);
		Иначе
			СтрокиКонтрагенты.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Если Не СтрокиКонтрагенты.Количество() Тогда
		ИндексПоследнего = СтрокиОрганизации.ВГраница();
		Для Счетчик = 1 По ИндексПоследнего Цикл
			СтрокиКонтрагенты.Добавить(СтрокиОрганизации[Счетчик]);
		КонецЦикла;
		Для Счетчик = 0 По ИндексПоследнего - 1 Цикл
			СтрокиОрганизации.Удалить(ИндексПоследнего - Счетчик);
		КонецЦикла;
	КонецЕсли;
	
	HTMLТекст = HTMLТекст + "<tr>";
	HTMLТекст = HTMLТекст + "<td colspan=""2"" align=""center"">";
	HTMLТекст = HTMLТекст + "<p>";
	ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'СТОРОНЫ'"), "");
	HTMLТекст = HTMLТекст + "</td></tr>";

	HTMLТекст = HTMLТекст + "<tr>";
	HTMLТекст = HTMLТекст + "<td width=""70%"">";
	
	ДобавитьОписаниеСтороны(HTMLТекст, СтрокиОрганизации);
	ДобавитьОписаниеСтороны(HTMLТекст, СтрокиКонтрагенты);
	
	HTMLТекст = HTMLТекст + "</td></tr>";
	
КонецПроцедуры

// Добавляет стороны документа к его HTML-представлению.
//
// Параметры:
//   HTMLТекст - Строка - обрабатываемый текст.
//   Сторона - Массив из СтрокаТаблицыЗначений - строки таблицы "Стороны" с формы внутреннего документа.
//
Процедура ДобавитьОписаниеСтороны(HTMLТекст, Сторона)
	
	Для Каждого ОписаниеСтороны Из Сторона Цикл
		
		Если ЗначениеЗаполнено(ОписаниеСтороны.Наименование) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, СокрЛП(ОписаниеСтороны.Наименование) + ":", "");
		КонецЕсли;
		ДобавитьРеквизитКHTML(HTMLТекст, "", ОписаниеСтороны.Сторона);
		
		Если ОписаниеСтороны.Подписан Тогда
			Подписант = ОписаниеСтороны.Подписал;
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Подписал:'"), Подписант);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеСтороны.КонтактноеЛицо) Тогда
			ДобавитьРеквизитКHTML(HTMLТекст, НСтр("ru = 'Контакт:'"), ОписаниеСтороны.КонтактноеЛицо);
		КонецЕсли;
		
		HTMLТекст = HTMLТекст + "<p>";
	КонецЦикла;
	
	HTMLТекст = HTMLТекст + "</td><td>";
	
КонецПроцедуры

// Подпись к количеству дней по склонениям
//
Функция ПолучитьПодписьДней(ЧислоДней)
	
	Если ЧислоДней > 10 И ЧислоДней < 20 Тогда
		Подпись = НСтр("ru = 'дней'");
	Иначе
		ПоследниеДвеЦифры = ЧислоДней - Цел(ЧислоДней / 100) * 100;
		ПоследняяЦифра = ЧислоДней - Цел(ЧислоДней / 10) * 10;
		
		Если ПоследняяЦифра = 0 Тогда
			Подпись = НСтр("ru = 'дней'");
		ИначеЕсли ПоследниеДвеЦифры > 10 И ПоследниеДвеЦифры < 20 Тогда
			Подпись = НСтр("ru = 'дней'");
		ИначеЕсли ПоследниеДвеЦифры < 10 Или ПоследниеДвеЦифры > 20 Тогда
			Если ПоследняяЦифра = 1 Тогда
				Подпись = НСтр("ru = 'день'");
			ИначеЕсли ПоследняяЦифра < 5 Тогда
				Подпись = НСтр("ru = 'дня'");
			Иначе
				Подпись = НСтр("ru = 'дней'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Подпись;
	
КонецФункции

// Подпись к количеству часов по склонениям
//
Функция ПолучитьПодписьЧасов(ЧислоЧасов)
	
	Если ЧислоЧасов > 10 И ЧислоЧасов < 20 Тогда
		Подпись = НСтр("ru = 'часов'");
	Иначе
		Срок = ЧислоЧасов - Цел(ЧислоЧасов / 10) * 10;
		Если Срок = 0 Тогда
			Подпись = НСтр("ru = 'часов'");
		ИначеЕсли Срок = 1 Тогда
			Подпись = НСтр("ru = 'час'");
		ИначеЕсли Срок < 5 Тогда
			Подпись = НСтр("ru = 'часа'");
		Иначе
			Подпись = НСтр("ru = 'часов'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Подпись;
	
КонецФункции

#КонецОбласти