#Область ПрограммныйИнтерфейс

// Возвращает признак наличия сервиса 1С Номенклатура
// Возвращаемое значение:
//  Булево- есть подсистема
Функция ЕстьПодсистемаРаботаСНоменклатурой() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ИмяФункциональнойОпции = "ИспользоватьСервисРаботаСНоменклатурой";
	ЕстьФункциональнаяОпция = Метаданные.ФункциональныеОпции.Найти(ИмяФункциональнойОпции) <> Неопределено;
	
	СервисИспользуется = Ложь;
	
	Если ЕстьФункциональнаяОпция Тогда
		СервисИспользуется = ПолучитьФункциональнуюОпцию(ИмяФункциональнойОпции);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СервисИспользуется;
	
КонецФункции

// Возвращает общий модуль РаботаСНоменклатурой
// Возвращаемое значение:
//  ОбщийМодуль - есть подсистема
Функция МодульРаботаСНоменклатурой() Экспорт
	
	Возврат ОбщегоНазначения.ОбщийМодуль("РаботаСНоменклатурой");
	
КонецФункции

// Возвращает признак доступности сервиса 1С Номенклатура
// Параметры:
//  ЕстьПодсистемаРаботаСНоменклатурой - Булево - см. ЕстьПодсистемаРаботаСНоменклатурой().
// Возвращаемое значение:
//  Булево- сервис доступен
Функция СервисДоступен(ЕстьПодсистемаРаботаСНоменклатурой) Экспорт
	
	Если ЕстьПодсистемаРаботаСНоменклатурой Тогда
		
		ОбщийМодульИнтернетПоддержкаПользователей = ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователей");
		
		Результат = МодульРаботаСНоменклатурой().ДоступнаФункциональностьПодсистемы()
			И ОбщийМодульИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Устанавливает условное оформление для поля "Количество".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой нужно установить условное оформление.
//  ИмяТабличнойЧасти - Строка - полный путь к таблице значений с реквизитами 1С Номенклатура.
Процедура УстановитьУсловноеОформлениеПолей1СНоменклатура(
	Форма, ИмяТабличнойЧасти = "ПодобраннаяМаркируемаяПродукция") Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ПолеНоменклатураСервиса = ЭлементыФормы[СтрШаблон("%1%2", ИмяТабличнойЧасти, "НоменклатураСервиса")].Имя;
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ПолеНоменклатураСервиса);
	
	ГруппаОтбора =  Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.%2", ИмяТабличнойЧасти, "НоменклатураНайденаВСервисе"));
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.%2", ИмяТабличнойЧасти,"ПоискВСервисеВыполнен"));
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<номенклатура не найдена>'"));
	
	////////////////////////////////////////////////////////////////////////////////
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ПолеНоменклатураСервиса);
	
	ГруппаОтбора =  Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.%2", ИмяТабличнойЧасти,"ПоискВСервисеВыполнен"));
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.%2", ИмяТабличнойЧасти,"НоменклатураНайденаВСервисе"));
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<поиск не производился>'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет данные приемника найденными данными сопоставления
//
// Параметры:
//  ИсточникДанных - СтрокаТаблицыЗначений Из См. ИдентификаторыПредставлениеНоменклатурыИХарактеристикПоСсылкам
//  ПриемникДанных - СтрокаТаблицыЗначений
Процедура ЗаполнитьСтрокуСопоставления1СНоменклатура(ИсточникДанных, ПриемникДанных) Экспорт
	
	Если Не ЗначениеЗаполнено(ИсточникДанных.ИдентификаторНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	ПриемникДанных.ИдентификаторНоменклатуры     = ИсточникДанных.ИдентификаторНоменклатуры;
	ПриемникДанных.ИдентификаторХарактеристики   = ИсточникДанных.ИдентификаторХарактеристики;
	ПриемникДанных.НоменклатураСервиса           = ИсточникДанных.ПредставлениеНоменклатурыСервиса;
	ПриемникДанных.НоменклатураНайденаВСервисе   = Истина;
	Если ИсточникДанных.СтатусСопоставления = СтатусСопоставленияРаботаСНоменклатуройСопоставлено() Тогда
		ПриемникДанных.КартинкаНоменклатураСервисаСопоставлена = 1;
	КонецЕсли;
	
КонецПроцедуры

// Поиск сопоставленной 1С Номенклатура по входящим ссылкам Номенклатура и Характеристика
// и заполнение данных в таблице переданной формы.
// 
// Параметры:
//  НоменклатураИХарактеристики	 - ТаблицаЗначений - См. НоваяТаблицаПоискаСопоставленияНоменклатуры.
//                               - Структура:
//                                 * Номенклатура - ОпределяемыйТип.Номенклатура
//                                 * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры
//                               - Массив из Структура, ДанныеФормыЭлементКоллекции.
//  Форма - ФормаКлиентскогоПриложения.
//  ПараметрыЗаполнения - См. НовыеПараметрыЗаполненияТаблицыСопоставленнойНомеклатуройСервиса.
Процедура ЗаполнитьСопоставление1СНоменклатураПоСсылкамВТаблице(НоменклатураИХарактеристики, Форма, ПараметрыЗаполнения) Экспорт
	
	ИдентификаторыПредставлениеНоменклатуры = ИдентификаторыПредставлениеНоменклатурыИХарактеристикПоСсылкам(НоменклатураИХарактеристики);
	Если ИдентификаторыПредставлениеНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаполнения.ИмяТаблицы) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика");
	
	ТаблицаПродукции = Форма[ПараметрыЗаполнения.ИмяТаблицы];
	
	Для Каждого ЭлементКоллекции Из ИдентификаторыПредставлениеНоменклатуры Цикл
		
		Если Не ЗначениеЗаполнено(ЭлементКоллекции.ИдентификаторНоменклатуры) Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, ЭлементКоллекции);
		
		СтрокиПродукции = ТаблицаПродукции.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаПриемник Из СтрокиПродукции Цикл
			
			Если ЗначениеЗаполнено(СтрокаПриемник.ИдентификаторНоменклатуры) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьСтрокуСопоставления1СНоменклатура(ЭлементКоллекции, СтрокаПриемник);
			
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

// Инициализирует параметры заполнения для ЗаполнитьСопоставление1СНоменклатураПоСсылкамВТаблице.
//
// Возвращаемое значение:
//  Структура:
//  * ИмяТаблицы - Строка - имя таблицы, в которой нужно заполнить реквизиты поиска 1С Номенклатура.
Функция НовыеПараметрыЗаполненияТаблицыСопоставленнойНомеклатуройСервиса() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяТаблицы", "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает представление и идентификаторы номенклатуры и характеристик по ссылкам на них.
//  Если по связке номенклатура + характеристика соответствие не найдено, происходит поиск
//  только по номенклатуре. Если соответствия не найдены - исходные ссылки в результате будут отсутствовать.
//  (За основу взята функция РаботаСНоменклатурой.ИдентификаторыНоменклатурыИХарактеристикПоСсылкам
//  Отличия: получение всех записей из регистра без отбора по статусу "Сопоставлено").
//
// Параметры:
//  СсылкиНаОбъекты	 - ТаблицаЗначений - См. НоваяТаблицаПоискаСопоставленияНоменклатуры.
//                   - Структура:
//                     * Номенклатура - ОпределяемыйТип.Номенклатура
//                     * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры
//                   - Массив из Структура, ДанныеФормыЭлементКоллекции.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Описание:
//  * Номенклатура - ОпределяемыйТип.Номенклатура - Номенклатура.
//  * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - Характеристика.
//  * ИдентификаторНоменклатуры - Строка - идентификатор в сервисе.
//  * ИдентификаторХарактеристики - Строка - идентификатор в сервисе.
//  * СтатусСопоставления- ПеречислениеСсылка.СтатусыСопоставленияРаботаСНоменклатурой
//  * ПредставлениеНоменклатурыСервиса - Строка
//
Функция ИдентификаторыПредставлениеНоменклатурыИХарактеристикПоСсылкам(Знач СсылкиНаОбъекты) Экспорт

	НоменклатураИХарактеристики = Неопределено;
	
	Если ТипЗнч(СсылкиНаОбъекты) = Тип("ТаблицаЗначений") Тогда	
		НоменклатураИХарактеристики = СсылкиНаОбъекты;
	Иначе
		
		НоменклатураИХарактеристики = НоваяТаблицаПоискаСопоставленияНоменклатуры();
		
		Если ТипЗнч(СсылкиНаОбъекты) = Тип("Массив") Тогда
			СсылкиДляПоиска = СсылкиНаОбъекты;
 		Иначе
			СсылкиДляПоиска = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкиНаОбъекты);
		КонецЕсли;
		
		Для Каждого ЭлементКоллекции Из СсылкиДляПоиска Цикл
			ЗаполнитьЗначенияСвойств(НоменклатураИХарактеристики.Добавить(), ЭлементКоллекции);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	НоменклатураИХарактеристики.Номенклатура КАК Номенклатура,
	|	НоменклатураИХарактеристики.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ СсылкиНаОбъекты
	|ИЗ
	|	&НоменклатураИХарактеристики КАК НоменклатураИХарактеристики
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаОбъекты.Номенклатура КАК Номенклатура,
	|	СсылкиНаОбъекты.Характеристика КАК Характеристика,
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторНоменклатурыСервиса КАК ИдентификаторНоменклатуры,
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторХарактеристикиСервиса КАК ИдентификаторХарактеристики,
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.СтатусСопоставления КАК СтатусСопоставления,
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.ПредставлениеНоменклатурыСервиса КАК ПредставлениеНоменклатурыСервиса
	|ПОМЕСТИТЬ НоменклатураИХарактеристики
	|ИЗ
	|	СсылкиНаОбъекты КАК СсылкиНаОбъекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыРаботаСНоменклатурой КАК СоответствиеНоменклатурыРаботаСНоменклатурой
	|		ПО СсылкиНаОбъекты.Номенклатура = СоответствиеНоменклатурыРаботаСНоменклатурой.Номенклатура
	|			И СсылкиНаОбъекты.Характеристика = СоответствиеНоменклатурыРаботаСНоменклатурой.Характеристика
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// Сопоставлено только по номенклатуре
	|ВЫБРАТЬ
	|	НоменклатураИХарактеристики.Номенклатура КАК Номенклатура,
	|	НоменклатураИХарактеристики.Характеристика КАК Характеристика,
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторНоменклатурыСервиса КАК ИдентификаторНоменклатуры,
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторХарактеристикиСервиса КАК ИдентификаторХарактеристики,
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.СтатусСопоставления КАК СтатусСопоставления,
	|	СоответствиеНоменклатурыРаботаСНоменклатурой.ПредставлениеНоменклатурыСервиса КАК ПредставлениеНоменклатурыСервиса
	|ИЗ
	|	НоменклатураИХарактеристики КАК НоменклатураИХарактеристики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыРаботаСНоменклатурой КАК СоответствиеНоменклатурыРаботаСНоменклатурой
	|		ПО НоменклатураИХарактеристики.Номенклатура = СоответствиеНоменклатурыРаботаСНоменклатурой.Номенклатура
	|			И (СоответствиеНоменклатурыРаботаСНоменклатурой.Характеристика = &ПустаяХарактеристика)
	|ГДЕ
	|	НоменклатураИХарактеристики.ИдентификаторНоменклатуры ЕСТЬ NULL
	|	И НоменклатураИХарактеристики.Характеристика <> &ПустаяХарактеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Сопоставлено по номенклатуре + характеристике
	|ВЫБРАТЬ
	|	НоменклатураИХарактеристики.Номенклатура,
	|	НоменклатураИХарактеристики.Характеристика,
	|	НоменклатураИХарактеристики.ИдентификаторНоменклатуры,
	|	НоменклатураИХарактеристики.ИдентификаторХарактеристики,
	|	НоменклатураИХарактеристики.СтатусСопоставления КАК СтатусСопоставления,
	|	НоменклатураИХарактеристики.ПредставлениеНоменклатурыСервиса КАК ПредставлениеНоменклатурыСервиса
	|ИЗ
	|	НоменклатураИХарактеристики КАК НоменклатураИХарактеристики
	|ГДЕ
	|	НЕ НоменклатураИХарактеристики.ИдентификаторНоменклатуры ЕСТЬ NULL
	|";	
		
	Запрос.УстановитьПараметр("НоменклатураИХарактеристики", НоменклатураИХарактеристики);
	Запрос.УстановитьПараметр("ПустаяХарактеристика", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ХарактеристикаНоменклатуры"));
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусСопоставленияРаботаСНоменклатуройСопоставлено()
	
	Возврат Перечисления["СтатусыСопоставленияРаботаСНоменклатурой"]["Сопоставлено"];
	
КонецФункции

Функция НоваяТаблицаПоискаСопоставленияНоменклатуры()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура", Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	Результат.Колонки.Добавить("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	Результат.Колонки.Добавить("GTIN", Метаданные.ОпределяемыеТипы.GTIN.Тип);
	Результат.Колонки.Добавить("СтрокаИсточник", Новый ОписаниеТипов("СтрокаТаблицыЗначений"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
