
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ЗаполнитьСписокСетей", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокСетей()

	ЗаполнитьСписокСетейСервер();	

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокСетейСервер()

	РезультатПолученияСписка = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьСтруктуруДанныхТорговойСети("list");	
	
	СписокСетей.Загрузить(РезультатПолученияСписка.Сети);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сети.Код КАК Код,
	               |	Сети.GLN КАК GLN,
	               |	Сети.Наименование КАК Наименование,
	               |	Сети.ДатаОбновления КАК ДатаОбновления
	               |ПОМЕСТИТЬ ВТ_СетиPartin
	               |ИЗ
	               |	&Сети КАК Сети
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СетиPartin.GLN КАК GLN,
	               |	ВТ_СетиPartin.Наименование КАК Наименование,
	               |	ВТ_СетиPartin.Код КАК Код,
	               |	ВТ_СетиPartin.ДатаОбновления КАК ДатаОбновления,
	               |	СУММА(ВЫБОР
	               |			КОГДА КонтурЛогистика_ПартнерыОрганизацииДиадок.Организация ЕСТЬ NULL
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоОрганизаций,
	               |	ЕСТЬNULL(КонтурЛогистика_ПартнерыОрганизацииДиадок.Ссылка, ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Партнеры.ПустаяСсылка)) КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА КонтурЛогистика_ПартнерыОрганизацииДиадок.Организация ЕСТЬ NULL
	               |			ТОГДА ""Добавить""
	               |		ИНАЧЕ ""Открыть""
	               |	КОНЕЦ КАК Действие
	               |ИЗ
	               |	ВТ_СетиPartin КАК ВТ_СетиPartin
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_Партнеры.ОрганизацииДиадок КАК КонтурЛогистика_ПартнерыОрганизацииДиадок
	               |		ПО ВТ_СетиPartin.Код = КонтурЛогистика_ПартнерыОрганизацииДиадок.Ссылка.КодПартнераКонтур
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_СетиPartin.GLN,
	               |	ВТ_СетиPartin.Наименование,
	               |	ВТ_СетиPartin.Код,
	               |	ВТ_СетиPartin.ДатаОбновления,
	               |	ЕСТЬNULL(КонтурЛогистика_ПартнерыОрганизацииДиадок.Ссылка, ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Партнеры.ПустаяСсылка)),
	               |	ВЫБОР
	               |		КОГДА КонтурЛогистика_ПартнерыОрганизацииДиадок.Организация ЕСТЬ NULL
	               |			ТОГДА ""Добавить""
	               |		ИНАЧЕ ""Открыть""
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КоличествоОрганизаций УБЫВ,
	               |	Наименование";
	
	Запрос.УстановитьПараметр("Сети", СписокСетей.Выгрузить());
	
	Результат = Запрос.Выполнить();
	СписокСетей.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработчикОбновитьСписокСетей(Параметр1, Параметр2) Экспорт 

 	ЗаполнитьСписокСетей();	

КонецПроцедуры 

&НаКлиенте
Процедура СписокСетейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура СписокСетейПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура СписокСетейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КодПартнераКонтур", ТекущиеДанные.Код); 
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда 
			ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка); 
		Иначе
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("КодПартнераКонтур", ТекущиеДанные.Код);
			ДанныеЗаполнения.Вставить("Наименование", ТекущиеДанные.Наименование);
			ДанныеЗаполнения.Вставить("ДатаОбновления", ТекущиеДанные.ДатаОбновления);
			ПараметрыФормы.Вставить("Основание", ДанныеЗаполнения); 
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда 
			Состояние("Загружаем данные партнера...",,"Потребуется некоторое время", БиблиотекаКартинок.КонтурЛогистика_Загрузить);
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_Партнеры.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОбновитьСписокСетей", ПараметрыФормы); 
		
	КонецЕсли;
	
КонецПроцедуры

