// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПустаяСтрока(Параметры.ЗаголовокФормы) Тогда
		Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;
	
	Перевозчик = Параметры.Перевозчик;
	ТочкаДоставки = Параметры.ТочкаДоставки;
	ЗонаДоставки = Параметры.ЗонаДоставки;
	
	Получатель = Параметры.Получатель;
	ТочкаПолучателя = Параметры.ТочкаПолучателя;
	ЗонаПолучателя = Параметры.ЗонаПолучателя;
	
	ВыбратьТолькоПолучателя = Параметры.ВыбратьТолькоПолучателя;
	
	Если Параметры.ВыбратьТолькоПеревозчика Тогда
		
		Элементы.Получатель.Видимость = Ложь;
		Элементы.ТочкаПолучателя.Видимость = Ложь;
		Элементы.ЗонаПолучателя.Видимость = Ложь;
		
	ИначеЕсли Параметры.ВыбратьТолькоПолучателя Тогда
		
		Элементы.Перевозчик.Видимость = Ложь;
		Элементы.ТочкаДоставки.Видимость = Ложь;
		Элементы.ЗонаДоставки.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ВыбратьТолькоПолучателя Тогда
		
		НеПроверяемыеРеквизиты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Перевозчик");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
		
	КонецЕсли;
	
	Если Перевозчик = Получатель Тогда
		
		ТекстСообщения = НСтр("ru = 'Совпадают данные получателя и перевозчика, оформление доставки невозможно.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	
	Если Перевозчик.Пустая() Тогда
		
		ТочкаДоставки = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
		ЗонаДоставки = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	Иначе
		
		ПеревозчикПриИзмененииСервер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкаДоставкиПриИзменении(Элемент)
	
	Если ТочкаДоставки.Пустая() Тогда
		
		ЗонаДоставки = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	Иначе
		
		ЗонаДоставки = ЗонаТочкиДоставки(ТочкаДоставки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкаПолучателяПриИзменении(Элемент)
	
	Если ТочкаПолучателя.Пустая() Тогда
		
		ЗонаПолучателя = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	Иначе
		
		ЗонаПолучателя = ЗонаТочкиДоставки(ТочкаПолучателя);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("Перевозчик", Перевозчик);
	Результат.Вставить("ТочкаДоставки", ТочкаДоставки);
	Результат.Вставить("ЗонаДоставки", ЗонаДоставки);
	
	Результат.Вставить("Получатель", Получатель);
	Результат.Вставить("ТочкаПолучателя", ТочкаПолучателя);
	Результат.Вставить("ЗонаПолучателя", ЗонаПолучателя);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗонаТочкиДоставки(Знач Точка)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Точка, "ЗонаДоставки");
	
КонецФункции

#Область ОбработчикиСобытийЭлементовШапкиФормыВспомогательные

&НаСервере
Процедура ПеревозчикПриИзмененииСервер()
	
	ДанныеТочки = Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(Перевозчик);
	ТочкаДоставки = ДанныеТочки.ТочкаДоставки;
	ЗонаДоставки = ДанныеТочки.ЗонаДоставки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти