
//&НаКлиенте
Перем Ядро Экспорт;

//**************************************
//{		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

// Сведения о внешней обработке совместимые со стандартной подсистемой ДополнительныеОтчетыИОбработки
//
// Возвращаемое значение:
//  Структура - содержит свойства:
//   * Версия          - Строка - версия обработки;
//   * Наименование    - Строка - представление для администратора (наименование элемента справочника),
//                                берется синоним объекта метаданных внешней обработки;
//   * Информация      - Строка - краткая информация о внешней обработке,
//                                берется комментарий объекта метаданных внешней обработки;
//   * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме:
//                                 Игнорируется привилегированный режим
//                                 Запрещены внешние по отношению к платформе «1С:Предприятия» действия:
//                                  COM;
//                                  загрузка внешних компонент;
//                                  запуск внешних приложений и команд операционной системы;
//                                  доступ к файловой системе, кроме временных файлов;
//                                  доступ к Интернету.
//   * Вид             - Строка - содержит значение "ДополнительнаяОбработка";
//   * Команды         - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой:
//      ** Идентификатор        - Строка- внутреннее имя команды;
//      ** Представление        - Строка- пользовательское представление команды;
//      ** Использование        - Строка- тип команды:
//                                         "ВызовКлиентскогоМетода",
//                                         "ВызовСерверногоМетода";
//      ** Модификатор          - Строка- дополнительная классификация команды;
//      ** ПоказыватьОповещение - Булево- если Истина, то при запуске команды выводится оповещение "Команда выполняется...";
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БезопасныйРежим", Ложь);
	Результат.Вставить("Наименование"	, Метаданные().Синоним);
	Результат.Вставить("Информация"		, Метаданные().Комментарий);
	Результат.Вставить("Версия"			, ВерсияОбработки());
	Результат.Вставить("Команды"		, Новый ТаблицаЗначений);
	Результат.Вставить("Вид"			, "ДополнительнаяОбработка");
	
	Возврат Результат;
	
КонецФункции

// Версия обработки в стандартном формате
//
// Возвращаемое значение:
//  Строка - версия в формате РР.ВВ.ФФ.СС, где:
//   * РР - номер редакции    - в рамках одной редакции гарантируется обратная совместимость;
//   * ВВ - номер версии      - новая функциональность (или несколько);
//   * ФФ - номер исправления - исправление ошибки;
//   * СС - номер сборки      - сквозная нумерация обновляется автоматически;
Функция ВерсияОбработки()
	
	Версия = "0.4.0";
	
	Результат = Версия + "." + НомерСборки();
	
	Возврат Результат;
	
КонецФункции

// Сквозной номер сборки, обновляется автоматически
//
Функция НомерСборки()
	
	Возврат "3";
	
КонецФункции

//}		СВЕДЕНИЯ О ВНЕШНЕЙ ОБРАБОТКЕ

//**********************************************
//{		ИНТЕРФЕЙС

Функция ТребуетсяПлагин() Экспорт
	
	Если ИспользоватьВнешнийHTTP()
		Или ИспользоватьВнешнююКриптографию() Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПараметрыHTTPЗапроса() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Метод");
	Результат.Вставить("АдресМетода");
	Результат.Вставить("ТелоЗапроса");
	Результат.Вставить("Параметры"					, Новый Структура);
	Результат.Вставить("Заголовки"					, Новый Соответствие);
	Результат.Вставить("ДопустимыеКодыОтвета"		, Новый Массив);
	Результат.Вставить("ТелоОтветаКакДвоичныеДанные", Ложь);
	
	Результат.Метод = "GET";
	
	Результат.Заголовки.Вставить("Accept"		, "application/json");
	Результат.Заголовки.Вставить("Content-Type"	, "application/json;charset=utf-8");
	Результат.Заголовки.Вставить("User-Agent"	, КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеUserAgent());
	//Результат.Заголовки.Вставить("Cache-Control", "max-age=0");
	
	Результат.ДопустимыеКодыОтвета.Добавить(200);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса) Экспорт
	
	Попытка
		
		Если ИспользоватьВнешнийHTTP() Тогда
			
			Результат = ВыполнитьHTTPЗапрос_COM(ПараметрыСервиса, ПараметрыЗапроса);
			
		Иначе
			
			Результат = ВыполнитьHTTPЗапрос_Native(ПараметрыСервиса, ПараметрыЗапроса);
			
		КонецЕсли;
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ОбработатьОшибкуHTTP(ПараметрыСервиса, ПараметрыЗапроса, ТекстОшибки);
		
		Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоHTTPЗапросОтправкиТитула(ПараметрыЗапроса) Тогда
			Результат = Новый Структура;
			Результат.Вставить("ТипОшибки", Перечисления.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаСоединения);
			Результат.Вставить("ОписаниеОшибки", "Ошибка при отправке документов");
			Результат.Вставить("ПодробноеОписаниеОшибки", ТекстОшибки);
			Возврат Результат;			
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Если НЕ Результат.КодОтветаДопустимый Тогда
		
		КодОтвета = Результат.КодОтвета;
		ТелоОтвета = НРег(Результат.ТелоОтвета);
		
		Если ЭтоОшибкаАвторизации(КодОтвета, ТелоОтвета) Тогда
			
			ОчиститьКонтекстСеанса();
			
			ТекстОшибки = НСтр("ru = 'Прошло слишком много времени с последней авторизации.
					|Для продолжения работы необходимо перезапустить модуль Диадока.'");
			
		ИначеЕсли ЭтоОшибкаОрганизацияНеНайдена(КодОтвета, ТелоОтвета) Тогда

			ТекстОшибки = НСтр("ru = 'Организация не найдена в Диадоке (или найдено более 1 организации) по ИНН.
				|Убедитесь что в ИНН нет ошибки.
				|Пригласите контрагента в Диадок в веб-интерфейсе.
				|
				| (" + ТелоОтвета + ")'");

		Иначе
			
			СтрокаОшибки = НСтр(
					"ru = 'Ошибка HTTP запроса
					|Код ошибки: %1
					|%2'");
			
			ТекстОшибки = Общее_ПодставитьПараметрыВСтроку(СтрокаОшибки, Результат.КодОтвета, Результат.ТелоОтвета);
			
		КонецЕсли;
		
		ОбработатьОшибкуHTTP(ПараметрыСервиса, ПараметрыЗапроса, ТекстОшибки);
		
		Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоHTTPЗапросОтправкиТитула(ПараметрыЗапроса) Тогда
			Результат.Вставить("ТипОшибки", Перечисления.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаСервиса);
			Результат.Вставить("ОписаниеОшибки", "Ошибка при отправке документов");
			Результат.Вставить("ПодробноеОписаниеОшибки", ТекстОшибки);
			Возврат Результат;			
		КонецЕсли;
		
		ВызватьИсключение ТекстОшибки;
				
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Удаление токена из контекста сеанса.
//
// Параметры:
//  Токен - Строка - Токен, по которому нужно очистить контекст сеанса.
//
Процедура ОчиститьКонтекстСеанса()
	
	Ядро.ОчиститьКонтекстИКэшСеанса();
	
КонецПроцедуры

// Проверяет ответ HTTP-запроса на предмет наличия ошибки авторизации по токену.
//
// Параметры:
//  КодОтвета  - Число - Код ответа HTTP-сервиса.
//  ТелоОтвета - Строка - Текстовый ответ HTTP-сервиса.
//
// Возвращаемое значение:
//   Булево - Результат проверки ошибки авторизации.
//     * Истина - Произошла ошибка авторизации.
//     * Ложь   - Авторизация прошла учпешно.
//
Функция ЭтоОшибкаАвторизации(КодОтвета, ТелоОтвета)
	
	Результат = КодОтвета = 401
				И ТелоОтвета = "invalid auth token";
									
	Возврат Результат

КонецФункции

Функция ЭтоОшибкаОрганизацияНеНайдена(КодОтвета, ТелоОтвета)
	
	Результат = КодОтвета = 404
				И Найти(ТелоОтвета, "no organization found") <> 0;
									
	Возврат Результат

КонецФункции

//&НаКлиенте
Функция ПолучитьСписокЛокальныхСертификатов() Экспорт
	
	ПараметрыПоиска		 = ПараметрыПоискаСертификатов();
	СвойстваСертификата	 = ВсеСвойстваСертификата();
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		ПараметрыПоиска.Вставить("ЕстьЗакрытыйКлюч", Истина);
		СписокСертификатов = Плагин_ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата);
	Иначе
		СписокСертификатов = ПолучитьСписокСертификатов_Native(ПараметрыПоиска, СвойстваСертификата);
	КонецЕсли;
	
	Результат = КонтурЛогистика_КриптографияКлиентСервер.ПолучитьСписокЛокальныхСертификатов_ПодготовитьРезультат(СписокСертификатов);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПолучитьСертификат(ОтпечатокСертификата) Экспорт
	
	ПараметрыПоиска		 = ПараметрыПоискаСертификатов();
	СвойстваСертификата	 = ВсеСвойстваСертификата(Истина);
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		ПараметрыПоиска.Вставить("Отпечаток", ОтпечатокСертификата);
		Результат = Плагин_ПолучитьДанныеСертификата(ПараметрыПоиска, СвойстваСертификата);
	Иначе
		Результат = ПолучитьДанныеСертификата(ОтпечатокСертификата, ПараметрыПоиска, СвойстваСертификата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера = Неопределено, ФайлОбмена = Неопределено, ВернутьОшибку = Ложь) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		Результат = Плагин_ПодписатьКонтент(ДвоичныеДанные, ОтпечатокСертификата, ФайлОбмена, ВернутьОшибку);
	Иначе
		Результат = ПодписатьКонтент(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		Результат = Плагин_ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи);
	Иначе
		Результат = ПроверитьПодпись_Native(ДвоичныеДанные, ДвоичныеДанныеПодписи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		Результат = Плагин_ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи);
	Иначе
		Результат = ПолучитьСертификатИзПодписи_Native(ДвоичныеДанныеПодписи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ЗашифроватьДанные(ДвоичныеДанные, МассивСертификатов) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		Результат = Плагин_ЗашифроватьКонтент(ДвоичныеДанные, МассивСертификатов);
	Иначе 
		Результат = ЗашифроватьКонтент(ДвоичныеДанные, МассивСертификатов);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция РасшифроватьДанные(ЗашифрованныеДвоичныеДанные, ПарольКонтейнера = Неопределено) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		Результат = Плагин_РасшифроватьКонтент(ЗашифрованныеДвоичныеДанные);
	Иначе
		Результат = РасшифроватьКонтент(ЗашифрованныеДвоичныеДанные, ПарольКонтейнера);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция РассчитатьХэш(ДвоичныеДанныеИмяФайла, НаименованиеХешФункции) Экспорт
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		Результат = Плагин_РассчитатьХэш(ДвоичныеДанныеИмяФайла, НаименованиеХешФункции);
	Иначе
		Результат = РассчитатьХэш_Native(ДвоичныеДанныеИмяФайла, НаименованиеХешФункции);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Запускает диагностику сетевого ресурса.
// В модели сервиса возвращается только описание ошибки.
//
// Параметры:
//  URL 			 - Строка 		- адрес URL ресурса, диагностику которого надо выполнить.
//  НастройкиПрокси  - Структура 	- состав см. Модуль_API.НовыйНастройкиПрокси.
//  ЗаписыватьОшибку - Булево 		- признак необходимости записи ошибок в журнал регистрации.
//
// Возвращаемое значение:
//  Структура:
//    *  ОписаниеОшибки    - Строка - краткое описание ошибки.
//    *  ЖурналДиагностики - Строка - подробный журнал диагностики с техническими подробностями.
//
// Пример:
//	// Диагностика сервиса диадок.
//	Результат = ДиагностикаСоединения("https://diadoc-api.kontur.ru");
//	
//	ОписаниеОшибки    = Результат.ОписаниеОшибки;
//	ЖурналДиагностики = Результат.ЖурналДиагностики;
//
//&НаКлиенте
Функция ДиагностикаСоединения(URL, НастройкиПрокси = Неопределено, ЗаписыватьОшибку = Истина) Экспорт
	
	Описание = Новый Массив;
	
	ШаблонСтрокиЖурнала = НСтр("ru = 'При обращении по URL: %1'"); 
	СтрокаЖурнала = Общее_ПодставитьПараметрыВСтроку(ШаблонСтрокиЖурнала, URL);
	Описание.Добавить(СтрокаЖурнала);
	
	ПредставлениеМестаДиагностики = ПредставлениеМестаДиагностики();
	Описание.Добавить(ПредставлениеМестаДиагностики);
	
	Журнал = Новый Массив;
	
	СтрокаЖурнала = НСтр("ru = 'Журнал диагностики:
		          			   |Выполняется проверка доступности сервера.
		           			   |Описание диагностируемой ошибки см. в следующем сообщении журнала.'");
	Журнал.Добавить(СтрокаЖурнала);
	Журнал.Добавить();
	
	СтруктураСсылки = Ядро.URL_Структура(URL);
	
	СостояниеНастроекПрокси = СостояниеНастроекПрокси(НастройкиПрокси, СтруктураСсылки.Схема);
	СоединениеЧерезПрокси 	= СостояниеНастроекПрокси.СоединениеЧерезПрокси;
	
	Журнал.Добавить(СостояниеНастроекПрокси.Представление);
	
	Если СоединениеЧерезПрокси И Не СостояниеНастроекПрокси.ИспользуютсяСистемныеНастройкиПрокси Тогда 
		
		СтрокаЖурнала = НСтр("ru = 'Диагностика соединения не выполнена, т.к. настроен прокси-сервер.
			           			   |Обратитесь к администратору.'");
		
		Описание.Добавить(СтрокаЖурнала);
		
	Иначе 
		
		АдресСервераРесурса = СтруктураСсылки.Хост;
		АдресСервераКонтрольнойПроверки = "1c.com";
		
		РезультатДоступностиРесурса = ПроверитьДоступностьСервера(АдресСервераРесурса);
		
		Журнал.Добавить();
		Журнал.Добавить("1) " + РезультатДоступностиРесурса.ЖурналДиагностики);
		
		Если РезультатДоступностиРесурса.Доступен Тогда 
			
			ШаблонСтрокиЖурнала = НСтр("ru = 'Выполнено обращение к ресурсу на сервере %1.'");
			
			СтрокаЖурнала = Общее_ПодставитьПараметрыВСтроку(
				ШаблонСтрокиЖурнала,
				АдресСервераРесурса);
				
			Описание.Добавить(СтрокаЖурнала);
			
		Иначе 
			
			РезультатКонтрольнойПроверки = ПроверитьДоступностьСервера(АдресСервераКонтрольнойПроверки);
			
			Журнал.Добавить("2) " + РезультатКонтрольнойПроверки.ЖурналДиагностики);
			
			Если Не РезультатКонтрольнойПроверки.Доступен Тогда
				
				СтрокаЖурнала = 
				    НСтр("ru = 'Отсутствует доступ в сеть интернет по причине:
					           |- компьютер не подключен к интернету;
					           |- неполадки у интернет-провайдера;
					           |- подключение к интернету блокирует межсетевой экран, 
					           |  антивирусная программа или другое программное обеспечение.'");
							   
				Описание.Добавить(СтрокаЖурнала);

			Иначе 
				
				ШаблонСтрокиЖурнала = НСтр("ru = 'Сервер %1 не доступен по причине:
					           				|- неполадки у интернет-провайдера;
					          				|- подключение к серверу блокирует межсетевой экран, 
					           				|  антивирусная программа или другое программное обеспечение;
					           				|- сервер отключен или на техническом обслуживании.'");
											
				СтрокаЖурнала = Общее_ПодставитьПараметрыВСтроку(
					ШаблонСтрокиЖурнала,
					АдресСервераРесурса);
					
				Описание.Добавить(СтрокаЖурнала);
				
				ЖурналТрассировки = ЖурналТрассировкиМаршрутаСервера(АдресСервераРесурса);
				Журнал.Добавить("3) " + ЖурналТрассировки);
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеОшибки = СоединитьСтроку(Описание, Символы.ПС);
	
	Журнал.Вставить(0);
	Журнал.Вставить(0, ОписаниеОшибки);
	
	ЖурналДиагностики = СоединитьСтроку(Журнал, Символы.ПС);
	
	Если ЗаписыватьОшибку Тогда
		Ядро.Ошибка_Обработать("Диагностика соединения", ЖурналДиагностики);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	Результат.Вставить("ЖурналДиагностики", ЖурналДиагностики);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйПрокси(НастройкиПрокси) Экспорт
	
	Возврат НовыйИнтернетПрокси(НастройкиПрокси);
	
КонецФункции

//}		ИНТЕРФЕЙС


//**************************************
//{		ПЛАГИН

//&НаКлиенте
Функция Плагин_ВыполнитьHTTPЗапрос(Метод, АдресРесурса, ПараметрыЗапроса)
	
	Результат = Модуль_Плагин().ВыполнитьHTTPЗапрос(Метод, АдресРесурса, ПараметрыЗапроса);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция Плагин_ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата) Экспорт
	
	Результат = Модуль_Плагин().ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция Плагин_ПолучитьДанныеСертификата(ПараметрыПоиска, СвойстваСертификата)
	
	Результат = Модуль_Плагин().ПолучитьДанныеСертификата(ПараметрыПоиска, СвойстваСертификата);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция Плагин_ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи)
	
	Результат = Модуль_Плагин().ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция Плагин_ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи)
	
	СвойстваСертификата = ВсеСвойстваСертификата(Истина, Ложь);
	
	Результат = Модуль_Плагин().ПолучитьСертификатИзПодписи(ДвоичныеДанныеПодписи, СвойстваСертификата);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция Плагин_ПодписатьКонтент(ДвоичныеДанные, ОтпечатокСертификата, ФайлОбмена = Неопределено, ВернутьОшибку = Ложь)
	
	Сертификат = Новый Структура;
	Сертификат.Вставить("Отпечаток"				, ОтпечатокСертификата);
	Сертификат.Вставить("ТипХранилища"			, "ПерсональныеСертификаты");
	Сертификат.Вставить("РасположениеХранилища"	, "ДанныеПользователяОС");
	
	Результат = Модуль_Плагин().ПодписатьКонтент(ДвоичныеДанные, Сертификат, , ФайлОбмена, ВернутьОшибку);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция Плагин_ЗашифроватьКонтент(ДвоичныеДанные, МассивСертификатов)
	
	Сертификаты = Новый Массив;
	
	Для Каждого ДвоичныеДанныеСертификата Из МассивСертификатов Цикл
		Сертификаты.Добавить(Новый Структура("ДвоичныеДанные", ДвоичныеДанныеСертификата));
	КонецЦикла;
	
	Результат = Модуль_Плагин().ЗашифроватьКонтент(ДвоичныеДанные, Сертификаты);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция Плагин_РасшифроватьКонтент(ЗашифрованныеДвоичныеДанные)
	
	Результат = Модуль_Плагин().РасшифроватьКонтент(ЗашифрованныеДвоичныеДанные);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция Плагин_ПреобразоватьКонтент(Контент, НовыйКонтент, Кодировка = "utf-8")
	
	Результат = Модуль_Плагин().ПреобразоватьКонтент(Контент, НовыйКонтент, Кодировка);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция Плагин_РассчитатьХэш(ДвоичныеДанныеИмяФайла, НаименованиеХешФункции)
	
	Результат = 0;
	
	Попытка
		
		Если ТипЗнч(ДвоичныеДанныеИмяФайла) = Тип("ДвоичныеДанные") Тогда
			Контент = ДвоичныеДанныеИмяФайла;
		Иначе
			Контент = Новый Структура("file", ДвоичныеДанныеИмяФайла);
		КонецЕсли;
		
		ТипНовогоКонтента = Новый Структура("hex");
		
		МодульПлагин = Модуль_Плагин();
		ХэшСумма = МодульПлагин.РассчитатьХэш(Контент, ТипНовогоКонтента, , НаименованиеХешФункции);
		
		Результат = ВРег(ХэшСумма);
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		
		СобытиеЖР = "Диадок. Рассчитать хэш";
		КомментарийЖР = КраткоеПредставлениеОшибки(Ошибка);
		
		ЗаписьЖурналаРегистрации(
			СобытиеЖР,
			УровеньЖурналаРегистрации.Ошибка,
			Неопределено,
			ТипЗнч(ДвоичныеДанныеИмяФайла),
			КомментарийЖР
		);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

//}		ПЛАГИН


//**********************************************
//{		HTTP

// Определяет какой транспорт нужно использовать
// в зависимости от версии приложения.
//
// Возвращаемое значение:
//   Булево - Истина, если приложение старше 8.3.6.
//
//&НаКлиенте
Функция ИспользоватьВнешнийHTTP()
	
	Если НЕ ПриложениеСтаршеВерсии("8.3.6") Тогда
		
		// В версии "8.3.6" HTTPЗапрос получил необходимый нам параметр ИспользоватьBOM.
		
		Результат = Ложь;
		
	Иначе
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает объект HTTP cоединение по адресу вэб сервиса.
//
// Параметры:
//  ПараметрыСервиса - Структура - см. функцию ядра ПараметрыСервиса().
//
// Возвращаемое значение:
//   HTTPСоединение - если ИспользоватьВнешнийHTTP() = Ложь;
//   COMОбъект      - если ИспользоватьВнешнийHTTP() = Истина;
//
//&НаКлиенте
Функция HTTPСоединение(ПараметрыСервиса)
	
	Результат = Неопределено;
	
	АдресВебСервиса				 = ПараметрыСервиса.АдресВебСервиса;
	ИспользоватьНовоеСоединение	 = ПараметрыСервиса.ИспользоватьНовоеСоединение;
	
	Если ИспользоватьНовоеСоединение Тогда
		Кэш_Поместить("HTTPСоединения", Неопределено);
	КонецЕсли;
	
	HTTPСоединения = Кэш_Прочитать("HTTPСоединения");
	
	Если HTTPСоединения = Неопределено Тогда
		HTTPСоединения = Новый Соответствие;
		Кэш_Поместить("HTTPСоединения", HTTPСоединения);
	КонецЕсли;
	
	Результат = HTTPСоединения.Получить(АдресВебСервиса);
	
	Если Результат = Неопределено Тогда
		
		Если ИспользоватьВнешнийHTTP() Тогда
			
			Результат = ПолучитьCOMОбъект("", "WinHttp.WinHttpRequest.5.1");
			УстановитьПараметрыПрокси_COM(ПараметрыСервиса, Результат);
			
		Иначе
			
			Прокси		 = НовыйИнтернетПрокси(ПараметрыСервиса.НастройкиПрокси);
			Результат	 = НовоеHTTPСоединение(ПараметрыСервиса, Прокси);
		
		КонецЕсли;
		
		Если НЕ ИспользоватьНовоеСоединение Тогда
			HTTPСоединения.Вставить(АдресВебСервиса, Результат);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Процедура ОбработатьОшибкуHTTP(ПараметрыСервиса, ПараметрыЗапроса, ТекстОшибки)
	
	Метод			 = ПараметрыЗапроса.Метод;
	АдресМетода		 = ПараметрыЗапроса.АдресМетода;
	АдресВебСервиса	 = ПараметрыСервиса.АдресВебСервиса;
	ДопИнформация	 = Новый Массив;
	
	ВидОперации = Общее_ПодставитьПараметрыВСтроку(НСтр(
	"ru = 'HTTP запрос в сервис %1'"), АдресВебСервиса);
	
	ДопИнформация.Добавить(Общее_ПодставитьПараметрыВСтроку(НСтр(
	"ru = 'Метод: %1'"), Метод));
	
	ДопИнформация.Добавить(Общее_ПодставитьПараметрыВСтроку(НСтр(
	"ru = 'Адрес метода: https:// %1%2'"), АдресВебСервиса, АдресМетода));
	
	Если ИспользоватьВнешнийHTTP() Тогда
		ДопИнформация.Добавить("Использован внешний HTTP транспорт");
	КонецЕсли;
	
	Ядро.Ошибка_Обработать(ВидОперации, ТекстОшибки, ДопИнформация);
	
КонецПроцедуры

//&НаКлиенте
Функция ВыполнитьHTTPЗапрос_Native(ПараметрыСервиса, ПараметрыЗапроса)
	
	ДопустимыеКодыОтвета		 = ПараметрыЗапроса.ДопустимыеКодыОтвета;
	ТелоОтветаКакДвоичныеДанные	 = ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные;
	
	Ответ = ОтправитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	КодОтвета			 = Ответ.КодСостояния;
	ЗаголовкиОтвета		 = Ответ.Заголовки;
	КодОтветаДопустимый	 = ДопустимыеКодыОтвета.Найти(КодОтвета) <> Неопределено;
	
	Если ТелоОтветаКакДвоичныеДанные И КодОтветаДопустимый Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакДвоичныеДанные();
	Иначе
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КодОтвета"			, КодОтвета);
	Результат.Вставить("ТелоОтвета"			, ТелоОтвета);
	Результат.Вставить("Заголовки"			, ЗаголовкиОтвета);
	Результат.Вставить("КодОтветаДопустимый", КодОтветаДопустимый);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ВыполнитьHTTPЗапрос_Plugin(ПараметрыСервиса, ПараметрыЗапроса)
	
	ДопустимыеКодыОтвета		 = ПараметрыЗапроса.ДопустимыеКодыОтвета;
	ТелоОтветаКакДвоичныеДанные	 = ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные;
	
	Ответ = ОтправитьHTTPЗапрос_Plugin(ПараметрыСервиса, ПараметрыЗапроса);
	
	КодОтвета			 = Число(Ответ.КодСостояния);
	ЗаголовкиОтвета		 = Ответ.Заголовки;
	КодОтветаДопустимый	 = ДопустимыеКодыОтвета.Найти(КодОтвета) <> Неопределено;
	
	Если ТелоОтветаКакДвоичныеДанные Тогда
		
		Если КодОтветаДопустимый Тогда
			ТелоОтвета = Ответ.ТелоОтвета;
		Иначе
			ТелоОтвета = Плагин_ПреобразоватьКонтент(Ответ.ТелоОтвета, Новый Структура("Строка"));
		КонецЕсли;
		
	Иначе
		
		ТелоОтвета = Ответ.ТелоОтвета;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КодОтвета"			, КодОтвета);
	Результат.Вставить("ТелоОтвета"			, ТелоОтвета);
	Результат.Вставить("Заголовки"			, ЗаголовкиОтвета);
	Результат.Вставить("КодОтветаДопустимый", КодОтветаДопустимый);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ВыполнитьHTTPЗапрос_COM(ПараметрыСервиса, ПараметрыЗапроса)
	
	ДопустимыеКодыОтвета		 = ПараметрыЗапроса.ДопустимыеКодыОтвета;
	ТелоОтветаКакДвоичныеДанные	 = ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные;
	
	Соединение = ОтправитьHTTPЗапрос_COM(ПараметрыСервиса, ПараметрыЗапроса);
	
	КодОтвета			 = Число(Соединение.Status);
	ЗаголовкиОтвета		 = ЗаголовкиHTTPОтвета_COM(Соединение);
	КодОтветаДопустимый	 = ДопустимыеКодыОтвета.Найти(КодОтвета) <> Неопределено;
	
	Если ТелоОтветаКакДвоичныеДанные И КодОтветаДопустимый Тогда
		
		Если Соединение.responseBody = Неопределено Тогда
			ТелоОтвета = Неопределено;
		Иначе
			ТелоОтвета = ДвоичныеДанныеHTTPОтвета_COM(Соединение);
		КонецЕсли;
		
	Иначе
		
		ТелоОтвета = Соединение.ResponseText;
		
		Если НЕ ЗначениеЗаполнено(ТелоОтвета) И НЕ КодОтветаДопустимый Тогда
			ТелоОтвета = Соединение.StatusText;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КодОтвета"			, КодОтвета);
	Результат.Вставить("ТелоОтвета"			, ТелоОтвета);
	Результат.Вставить("Заголовки"			, ЗаголовкиОтвета);
	Результат.Вставить("КодОтветаДопустимый", КодОтветаДопустимый);
	
	Возврат Результат;
	
КонецФункции

// Вычисляет адрес ресурса по имени метода API и его параметрам.
//
//&НаКлиенте
Функция АдресРесурсаHTTP(ИмяМетода, Параметры = Неопределено)
	
	ПараметрыСтрокой = "";
	
	Если ЗначениеЗаполнено(Параметры) Тогда
		
		Если Найти(ИмяМетода, "?") = 0 Тогда
			Разделитель = "?";
		Иначе
			Разделитель = "&";
		КонецЕсли;
		
		Для Каждого Параметр Из Параметры Цикл
			// Метод Общее_ПодставитьПараметрыВСтроку использовать нельзя, в параметрах может быть %n
			ПараметрыСтрокой = ПараметрыСтрокой + Разделитель + Параметр.Ключ + "=" + Параметр.Значение;
			Разделитель = "&";
		КонецЦикла;
		
	КонецЕсли;
	
	Результат = ИмяМетода + ПараметрыСтрокой;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ОтправитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса)
	
	Метод		 = ПараметрыЗапроса.Метод;
	АдресМетода	 = ПараметрыЗапроса.АдресМетода;
	ТелоЗапроса	 = ПараметрыЗапроса.ТелоЗапроса;
	Параметры	 = ПараметрыЗапроса.Параметры;
	Заголовки	 = ПараметрыЗапроса.Заголовки;
	
	Соединение	 = HTTPСоединение(ПараметрыСервиса);
	АдресРесурса = АдресРесурсаHTTP(АдресМетода, Параметры);
	HTTPЗапрос	 = НовыйHTTPЗапрос(АдресРесурса, Заголовки);
	
	Если Метод = "GET" Тогда
		
		Результат = Соединение.Получить(HTTPЗапрос);
		
	ИначеЕсли Метод = "POST" Тогда
		
		Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
			
			Если ТипЗнч(ТелоЗапроса) = Тип("Строка") Тогда
				
				HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8,
				ПредопределенноеЗначение("ИспользованиеByteOrderMark.НеИспользовать"));
				
			Иначе
				
				HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ОтправитьHTTPЗапрос_Plugin(ПараметрыСервиса, ПараметрыЗапроса)
	
	Метод			 = ПараметрыЗапроса.Метод;
	АдресМетода		 = ПараметрыЗапроса.АдресМетода;
	ТелоЗапроса		 = ПараметрыЗапроса.ТелоЗапроса;
	Параметры		 = ПараметрыЗапроса.Параметры;
	Заголовки		 = ПараметрыЗапроса.Заголовки;
	
	Схема	 = ПараметрыСервиса.Схема;
	Порт	 = ПараметрыСервиса.Порт;
	
	СтрокаЗапроса	 = Схема + "://" + ПараметрыСервиса.АдресВебСервиса +
					   ?(ЗначениеЗаполнено(Порт), ":" + Формат(Порт, "ЧГ=0"), "") + АдресМетода;
	
	ПараметрыЗапросаДляПлагина = Новый Структура;
	
	Если ЗначениеЗаполнено(Параметры) Тогда
		ПараметрыЗапросаДляПлагина.Вставить("Параметры", Параметры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		ПараметрыЗапросаДляПлагина.Вставить("Заголовки", Заголовки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		ПараметрыЗапросаДляПлагина.Вставить("ТелоЗапроса", ТелоЗапроса);
	КонецЕсли;
	
	Если ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные Тогда
		ПараметрыЗапросаДляПлагина.Вставить("ТелоОтвета", Новый Структура("ДвоичныеДанные"));
	Иначе
		ПараметрыЗапросаДляПлагина.Вставить("ТелоОтвета", Новый Структура("Строка"));
	КонецЕсли;
	
	Результат = Плагин_ВыполнитьHTTPЗапрос(Метод, СтрокаЗапроса, ПараметрыЗапросаДляПлагина);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ОтправитьHTTPЗапрос_COM(ПараметрыСервиса, ПараметрыЗапроса)
	
	Метод		 = ПараметрыЗапроса.Метод;
	АдресМетода	 = ПараметрыЗапроса.АдресМетода;
	ТелоЗапроса	 = ПараметрыЗапроса.ТелоЗапроса;
	Параметры	 = ПараметрыЗапроса.Параметры;
	Заголовки	 = ПараметрыЗапроса.Заголовки;
	
	Схема	 = ПараметрыСервиса.Схема;
	Порт	 = ПараметрыСервиса.Порт;
	
	Соединение		 = HTTPСоединение(ПараметрыСервиса);
	АдресРесурса	 = АдресРесурсаHTTP(АдресМетода, Параметры);
	РежимПрокси		 = ПараметрыСервиса.НастройкиПрокси.РежимПрокси;
	СтрокаЗапроса	 = Схема + "://" + ПараметрыСервиса.АдресВебСервиса +
					   ?(ЗначениеЗаполнено(Порт), ":" + Формат(Порт, "ЧГ=0"), "") + АдресРесурса;
	
	Соединение.Open(Метод, СтрокаЗапроса, 0);
	
	Если РежимПрокси = "UseProxy" Тогда
		ВыполнитьАвторизациюНаПрокси_COM(ПараметрыСервиса, Соединение);
	КонецЕсли;
	
	Для Каждого Элемент Из Заголовки Цикл
		Соединение.SetRequestHeader(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Если ТипЗнч(ТелоЗапроса) = Тип("ДвоичныеДанные") Тогда
		Соединение.Send(Base64Строка(ТелоЗапроса));
	Иначе 
		Соединение.Send(ТелоЗапроса);
	КонецЕсли;
	
	Возврат Соединение;
	
КонецФункции

//&НаКлиенте
Функция ЗаголовкиHTTPОтвета_COM(Соединение)
	
	Результат = Новый Соответствие;
	
	ЗаголовкиСтрокой = Соединение.GetAllResponseHeaders();
	МассивЗаголовков = РазделитьСтроку(ЗаголовкиСтрокой, Символы.ПС, Ложь);
	
	Для Каждого ЗаголовокСтрокой Из МассивЗаголовков Цикл
		
		ЧастиЗаголовка = РазделитьСтроку(ЗаголовокСтрокой, ":");
		
		Ключ	 = ЧастиЗаголовка[0];
		Значение = ЧастиЗаголовка[1];
		
		Результат.Вставить(Ключ, Значение);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ДвоичныеДанныеHTTPОтвета_COM(Соединение)
	
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	
	Попытка
		Поток = Новый COMОбъект("ADODB.Stream");
	Исключение
		ОписаниеОшибки = "Не удалось инициализировать COM-объект ""ADODB.Stream""";
		ВызватьИсключение ОписаниеОшибки;
	КонецПопытки;
	
	Поток.Type = 1;  //Бинарный
	Поток.Mode = 3; 
	Поток.Open();
	Поток.Write(Соединение.responseBody);
	Поток.SaveToFile(ИмяФайлаОтвета);
	Поток.Close();	
	
	Результат = Новый ДвоичныеДанные(ИмяФайлаОтвета);
	
	УдалитьФайлы(ИмяФайлаОтвета);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Процедура УстановитьПараметрыПрокси_COM(ПараметрыСервиса, Соединение)
	
	// Значения констант: https://msdn.microsoft.com/en-us/library/windows/desktop/aa384059(v=vs.85).aspx
	
	НастройкиПрокси	 = ПараметрыСервиса.НастройкиПрокси;
	РежимПрокси		 = НастройкиПрокси.РежимПрокси;
	
	Если РежимПрокси = "NoProxy" Тогда
		
		Соединение.SetProxy(1, "");  // HTTPREQUEST_PROXYSETTING_DIRECT = 1
		
	ИначеЕсли РежимПрокси = "UseDefaultProxy" Тогда
		
		Соединение.SetProxy(0, "");  // HTTPREQUEST_PROXYSETTING_PRECONFIG = 0
		
	ИначеЕсли РежимПрокси = "UseProxy" Тогда
		
		АдресПроксиСервера	= НастройкиПрокси.АдресПроксиСервера;
		Порт				= НастройкиПрокси.ПортПроксиСервера;
		
		Если Не ЗначениеЗаполнено(АдресПроксиСервера) Тогда
			ВызватьИсключение "Заполните настройки прокси";
		КонецЕсли;
		
		ProxyServer = АдресПроксиСервера + ":" + Формат(Порт, "ЧГ=0");
		
		Соединение.SetProxy(2, ProxyServer);  // HTTPREQUEST_PROXYSETTING_PROXY = 2
			
		// Логин и пароль необходимо указать после установки соединения - т.е. после вызова метода Open
		// Это вынесено в отдельный метод - ВыполнитьАвторизациюНаПрокси_COM
		
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
Процедура ВыполнитьАвторизациюНаПрокси_COM(ПараметрыСервиса, Соединение)
	
	// Значения констант: https://msdn.microsoft.com/en-us/library/windows/desktop/aa384058(v=vs.85).aspx
	
	НастройкиПрокси = ПараметрыСервиса.НастройкиПрокси;
	
	Логин	 = НастройкиПрокси.ЛогинПроксиСервера;
	Пароль	 = НастройкиПрокси.ПарольПроксиСервера;
	
	Если ЗначениеЗаполнено(Логин) Тогда
		Соединение.SetCredentials(Логин, Пароль, 1);  // HTTPREQUEST_SETCREDENTIALS_FOR_PROXY = 1
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
Функция НовыйИнтернетПрокси(НастройкиПрокси)
	
	РежимПрокси	= НастройкиПрокси.РежимПрокси;
	
	Если РежимПрокси = "UseProxy" Тогда
		
		Результат = Новый ИнтернетПрокси;
		
		АдресПроксиСервера	= НастройкиПрокси.АдресПроксиСервера;
		Порт				= НастройкиПрокси.ПортПроксиСервера;
		Логин				= НастройкиПрокси.ЛогинПроксиСервера;
		Пароль				= НастройкиПрокси.ПарольПроксиСервера;
		
		Если Не ЗначениеЗаполнено(АдресПроксиСервера) Тогда
			ВызватьИсключение "Заполните настройки прокси";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Логин) Тогда
			
			Результат.Установить("http"	, АдресПроксиСервера, Порт, Логин, Пароль, Ложь);
			Результат.Установить("https", АдресПроксиСервера, Порт, Логин, Пароль, Ложь);
			
		Иначе
			
			Результат.Установить("http"	, АдресПроксиСервера, Порт);
			Результат.Установить("https", АдресПроксиСервера, Порт);
			
		КонецЕсли;
		
	ИначеЕсли РежимПрокси = "UseDefaultProxy" Тогда
		
		Результат = Новый ИнтернетПрокси(Истина);
		// Будет использован прокси по умолчанию:
		// либо из файла inetcfg.xml, если он расположен на данной машине, либо из настроек Internet Explorer.
		// Пример файла inetcfg.xml можно найти в официальной документации:
		// https://its.1c.ru/db/v8doc#content:26:1:issogl1_3.13.inetcfg.xml
		
	Иначе
		
		Результат = Новый ИнтернетПрокси(Ложь);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция НовоеHTTPСоединение(ПараметрыСервиса, Прокси)
	
	АдресВебСервиса = ПараметрыСервиса.АдресВебСервиса;
	
	Схема				 = ПараметрыСервиса.Схема;
	Порт				 = ПараметрыСервиса.Порт;
	ИмяПользователя		 = Неопределено;
	Пароль				 = Неопределено;
	Таймаут 			 = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ТаймаутHTTP");
	ЗащищенноеСоединение = ЗащищенноеСоединениеOpenSSL();
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить(АдресВебСервиса);
	ПараметрыКонструктора.Добавить(Порт);
	ПараметрыКонструктора.Добавить(ИмяПользователя);
	ПараметрыКонструктора.Добавить(Пароль);
	ПараметрыКонструктора.Добавить(Прокси);
	ПараметрыКонструктора.Добавить(Таймаут);
	
	Если Схема = "https" Тогда
		ПараметрыКонструктора.Добавить(ЗащищенноеСоединение);
	КонецЕсли;
	
	Результат = Новый("HTTPСоединение", ПараметрыКонструктора);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция НовыйHTTPЗапрос(АдресРесурса, Заголовки)
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить(АдресРесурса);
	ПараметрыКонструктора.Добавить(Заголовки);
	
	Результат = Новый("HTTPЗапрос", ПараметрыКонструктора);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ЗащищенноеСоединениеOpenSSL()
	
	Результат = Новый("ЗащищенноеСоединениеOpenSSL");
	
	Возврат Результат;
	
КонецФункции

//}		HTTP


//**********************************************
//{		КРИПТОГРАФИЯ

//&НаКлиенте
// модифицирована
Функция ИспользоватьВнешнююКриптографию()
	
	// DD1C-424 Используем пока только внешнюю криптографию,
	// из-за отсутствия функциональности ввода пароля от ключевого контейнера в 1С.
	//Возврат Истина;
	//
	//Если ПриложениеСтаршеВерсии("8.3") Тогда
	//	Результат = Истина;
	//Иначе
	//	Результат = Ложь;
	//КонецЕсли;
	//
	//Возврат Результат;
	
	Возврат Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьКриптографию1С");
	
КонецФункции

//&НаКлиенте
Функция ВсеСвойстваСертификата(ДобавитьДвоичныеДанные = Ложь, ДобавитьЗакрытыйКлюч = Истина)
	
	Результат = Новый Структура("СерийныйНомер, Издатель, Субъект, ДатаНачала, ДатаОкончания, АлгоритмКлюча");
	
	Если ДобавитьДвоичныеДанные = Истина Тогда
		Результат.Вставить("ДвоичныеДанные");
	КонецЕсли;
	
	Если ДобавитьЗакрытыйКлюч = Истина Тогда
		Результат.Вставить("ЕстьЗакрытыйКлюч");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПолучитьСписокСертификатов_Native(ПараметрыПоиска, СвойстваСертификата)
	
	ХранилищеСертификатовКриптографии = ПолучитьХранилищеСертификатов(ПараметрыПоиска);
	
	Если ПараметрыПоиска.Свойство("Отпечаток") Тогда
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(ПараметрыПоиска.Отпечаток);
		Возврат РазобратьОтвет_ПолучитьСписокСертификатов(СертификатКриптографии, ПараметрыПоиска, СвойстваСертификата);
	КонецЕсли;
	
	Если ПараметрыПоиска.Свойство("СерийныйНомер") Тогда
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоСерийномуНомеру(Base64Значение(ПараметрыПоиска.СерийныйНомер));
		Возврат РазобратьОтвет_ПолучитьСписокСертификатов(СертификатКриптографии, ПараметрыПоиска, СвойстваСертификата);
	КонецЕсли;
	
	СертификатыКриптографии = ХранилищеСертификатовКриптографии.ПолучитьВсе();
	Возврат РазобратьОтвет_ПолучитьСписокСертификатов(СертификатыКриптографии, ПараметрыПоиска, СвойстваСертификата);
	
КонецФункции

//&НаКлиенте
Функция ПолучитьСписокЛокальныхСертификатов_ПодготовитьРезультат(СписокСертификатов)
	
	Результат = Новый Массив;
	
	Для Каждого Серт Из СписокСертификатов Цикл
		
		Если Не ЭтоВалидныйСертификат(Серт) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеСертификата = Новый Структура("Наименование, ДатаВыдачи, СрокДействия, ОтпечатокСертификата, Организация, Издатель, Контур, Инн, Кпп, ВДиадоке, Ошибка");
		
		ОписаниеСертификата.ДатаВыдачи			 = Серт.ДатаНачала;
		ОписаниеСертификата.СрокДействия		 = Серт.ДатаОкончания;
		ОписаниеСертификата.ОтпечатокСертификата = Серт.Отпечаток;
		
		Если Серт.Субъект.Свойство("SN") И Серт.Субъект.Свойство("G") Тогда // в старых форматах сертификатов этих полей может не быть
			ОписаниеСертификата.Наименование = Серт.Субъект.SN + " " + Серт.Субъект.G;
		Иначе
			ОписаниеСертификата.Наименование = Серт.Субъект.CN;
		КонецЕсли;
		
		ОписаниеСертификата.Издатель	 = Серт.Издатель.CN;
		ОписаниеСертификата.Организация	 = ?(Серт.Субъект.Свойство("O"), Серт.Субъект.O, "");
		
		Если Серт.Субъект.Свойство("ИННЮЛ") Тогда
			ИНН = Серт.Субъект.ИННЮЛ;
		ИначеЕсли Серт.Субъект.Свойство("ИНН") Тогда
			ИНН = Серт.Субъект.ИНН;
		Иначе
			ИНН = "";
		КонецЕсли;
		
		// обрезаем лидирующие нули
		Если Лев(ИНН, 2) = "00" Тогда 
			ИНН = Сред(ИНН, 3);
		КонецЕсли;
		
		ОписаниеСертификата.ИНН = ИНН;
		
		// здесь КПП так просто не вытащить, он вроде присутствует в хитром поле:
		// _1_2_840_113549_1_9_2	"6699000000-669901001-012522310804"	Строка
		// _1_2_840_113549_1_9_2	"6699000000-669901001-005809723989"	Строка
		
		// еще один вариант - раскладывать в массив строк и брать вторую
		
		Если Серт.Субъект.Свойство("СНИЛС") Тогда
			СНИЛС = Серт.Субъект.СНИЛС;
		Иначе
			СНИЛС = "";
		КонецЕсли;
		
		Для Каждого ЭлементСтруктуры Из Серт.Субъект Цикл
			
			Если Найти(ЭлементСтруктуры.Значение, "-0" + СНИЛС) > 0
				И СтрДлина(ЭлементСтруктуры.Значение) >= 10 + 1 + 9 + 1 + СтрДлина(СНИЛС) + 1 Тогда
				// 6699000000-669901001-005809723989
				// 10        1    9    1   СНИЛС+"0"
				КПП = ЭлементСтруктуры.Значение;
				
				КПП = Сред(КПП, 12);							// 6699000000-669901001-005809723989  -> 669901001-005809723989
				КПП = СтрЗаменить(КПП, "0" + СНИЛС, "");	// 669901001-005809723989  -> -005809723989
				КПП = СтрЗаменить(КПП, "-", "");				// -005809723989 -> 005809723989
				Если СтрДлина(КПП) = 9 Тогда
					ОписаниеСертификата.КПП = КПП;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОписаниеСертификата.КПП) Тогда
				ЭлементыКПП = РазделитьСтроку(ЭлементСтруктуры.Значение, "-");
				Если ЭлементыКПП.Количество() > 1 Тогда
					ОписаниеСертификата.КПП = ЭлементыКПП[1];
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		ОписаниеСертификата.Контур = Истина;
		
		Если ОписаниеСертификата.СрокДействия < НачалоДня(ТекущаяДата()) Тогда
			
			ОписаниеСертификата.Вставить("Ошибка"	, "Срок действия сертификата истек");
			ОписаниеСертификата.Вставить("ВДиадоке"	, Ложь);
			// кажется, что их лучше вообще не показывать
			
		Иначе
			
			ОписаниеСертификата.Вставить("ВДиадоке", Истина);
			
		КонецЕсли;
		
		Если ОписаниеСертификата.ВДиадоке Тогда
			Результат.Добавить(ОписаниеСертификата);  // добавляем только валидные сертификаты
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция РазобратьОтвет_ПолучитьСписокСертификатов(Ответ, ПараметрыПоиска, СвойстваСертификата)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(Ответ) Тогда
		
		Если ТипЗнч(Ответ) = Тип("Массив") Тогда
			
			Для Каждого СертификатКриптографии Из Ответ Цикл
				
				Результат.Добавить(КонтурЛогистика_КриптографияКлиентСервер.Новый_ОписаниеСертификата(СертификатКриптографии, СвойстваСертификата));
				
				Если СвойствоСтруктуры(ПараметрыПоиска, "ТолькоПервый") = Истина Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			Результат.Добавить(КонтурЛогистика_КриптографияКлиентСервер.Новый_ОписаниеСертификата(Ответ, СвойстваСертификата));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПолучитьДанныеСертификата(ОтпечатокСертификата, ПараметрыПоиска, СвойстваСертификата)
	
	ХранилищеСертификатовКриптографии = ПолучитьХранилищеСертификатов(ПараметрыПоиска);
	
	Если ТипЗнч(ОтпечатокСертификата) = Тип("ДвоичныеДанные") Тогда
		
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(ОтпечатокСертификата);
		
	Иначе
		
		СертификатыКриптографии	 = ХранилищеСертификатовКриптографии.ПолучитьВсе();
		СертификатКриптографии	 = НайтиСертификатВМассивеПоОтпечатку(СертификатыКриптографии, ОтпечатокСертификата);
		
	КонецЕсли;
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии, СвойстваСертификата);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПодписатьКонтент(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера)
	
	ТипыМодулей = ТипыМодулейКриптографии(ОтпечатокСертификата);
	
	Для Каждого ТипМодуля Из ТипыМодулей Цикл
		
		МенеджерКриптографии = ИнициализироватьМенеджерКриптографии(ПарольКонтейнера, ТипМодуля);
		
		Попытка
			Результат = ПодписатьКонтентЧерезМенеджерКриптографии(МенеджерКриптографии, ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера);
			Прервать;
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			Если ТипыМодулей.Найти(ТипМодуля) = ТипыМодулей.ВГраница() Тогда
				ВызватьИсключение;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗапомнитьПодходящийТипМодуляКриптографии(ТипМодуля, ОтпечатокСертификата);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПодписатьКонтентЧерезМенеджерКриптографии(МенеджерКриптографии, ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера)
	
	ПараметрыПоиска		 = ПараметрыПоискаСертификатов();
	СвойстваСертификата	 = ВсеСвойстваСертификата(Истина);
	
	Сертификат				 = ПолучитьДанныеСертификата(ОтпечатокСертификата, ПараметрыПоиска, СвойстваСертификата);
	СертификатКриптографии	 = Новый СертификатКриптографии(Сертификат.ДвоичныеДанные);
	
	Результат = МенеджерКриптографии.Подписать(ДвоичныеДанные, СертификатКриптографии);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ЗашифроватьКонтент(ДвоичныеДанные, МассивСертификатов)
	
	СертификатыКриптографии = Новый Массив;
	
	Для Каждого ДвоичныеДанныеСертификата Из МассивСертификатов Цикл 
		СертификатыКриптографии.Добавить(Новый СертификатКриптографии(ДвоичныеДанныеСертификата));
	КонецЦикла;
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии();
	
	Результат = МенеджерКриптографии.Зашифровать(ДвоичныеДанные, СертификатыКриптографии);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция РасшифроватьКонтент(ЗашифрованныеДвоичныеДанные, ПарольКонтейнера)
	
	ТипыМодулей = ТипыМодулейКриптографии();
	
	Для Каждого ТипМодуля Из ТипыМодулей Цикл
		
		МенеджерКриптографии = ИнициализироватьМенеджерКриптографии(ПарольКонтейнера, ТипМодуля);
		
		Попытка
			Результат = МенеджерКриптографии.Расшифровать(ЗашифрованныеДвоичныеДанные);
			Прервать;
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			Если ТипыМодулей.Найти(ТипМодуля) = ТипыМодулей.ВГраница() Тогда
				ВызватьИсключение;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗапомнитьПодходящийТипМодуляКриптографии(ТипМодуля);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПроверитьПодпись_Native(ДвоичныеДанные, ДвоичныеДанныеПодписи)
	
	СертификатКриптографии = Неопределено;
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии();
	МенеджерКриптографии.ПроверитьПодпись(ДвоичныеДанные, ДвоичныеДанныеПодписи, СертификатКриптографии);
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии, ВсеСвойстваСертификата(Истина));
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПолучитьСертификатИзПодписи_Native(ДвоичныеДанныеПодписи)
	
	МенеджерКриптографии	 = ИнициализироватьМенеджерКриптографии();
	СертификатыКриптографии	 = МенеджерКриптографии.ПолучитьСертификатыИзПодписи(ДвоичныеДанныеПодписи);
	
	СертификатКриптографии = Неопределено;
	
	Если ЗначениеЗаполнено(СертификатыКриптографии) Тогда
		
		Если СертификатыКриптографии.Количество() = 1 Тогда
			СертификатКриптографии = СертификатыКриптографии[0];	
		Иначе
			
			Для каждого Сертификат Из СертификатыКриптографии Цикл
				
				Если Не Сертификат.Субъект.Свойство("SN") Тогда
					Продолжить;
				Иначе
					СертификатКриптографии = Сертификат;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если СертификатКриптографии = Неопределено Тогда
				СертификатКриптографии = СертификатыКриптографии[0];		
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии, ВсеСвойстваСертификата(Истина));
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ЭтоВалидныйСертификат(ДанныеСертификата)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДанныеСертификата) = Тип("Структура")
		
		И ДанныеСертификата.Свойство("Субъект") И ТипЗнч(ДанныеСертификата.Субъект) = Тип("Структура")
		И ДанныеСертификата.Субъект.Свойство("CN")
		И (ДанныеСертификата.Субъект.Свойство("ИНН") ИЛИ ДанныеСертификата.Субъект.Свойство("ИННЮЛ"))
		
		И ДанныеСертификата.Свойство("Издатель") И ТипЗнч(ДанныеСертификата.Издатель) = Тип("Структура")
		И ДанныеСертификата.Издатель.Свойство("CN") 
		
	Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ИнициализироватьМенеджерКриптографии(ПарольКонтейнера = Неопределено, ТипМодуляКриптографии = Неопределено)
	
	Если ТипМодуляКриптографии = Неопределено Тогда
		
		ТипМодуляКриптографии = ПодходящийТипМодуляКриптографии();
		
		Если Не ЗначениеЗаполнено(ТипМодуляКриптографии) Тогда
			ТипМодуляКриптографии = ТипыМодулейКриптографии().Получить(0);
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("");
	ПараметрыКонструктора.Добавить("");
	ПараметрыКонструктора.Добавить(ТипМодуляКриптографии);
	
	МенеджерКриптографии = Новый("МенеджерКриптографии", ПараметрыКонструктора);
	
	УстановитьПарольДоступаКЗакрытомуКлючу(МенеджерКриптографии, ПарольКонтейнера);
	
	Возврат МенеджерКриптографии;
	
КонецФункции

//&НаКлиенте
Функция НачатьИнициализациюМенеджераКриптографии(Знач ОписаниеОповещения)
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("");
	ПараметрыКонструктора.Добавить("");
	ПараметрыКонструктора.Добавить(75);
	
	МенеджерКриптографии = Новый("МенеджерКриптографии", ПараметрыКонструктора);
	
	МенеджерКриптографии.НачатьИнициализацию(ОписаниеОповещения, "", "", 75);
	
КонецФункции

//&НаКлиенте
Процедура УстановитьПарольДоступаКЗакрытомуКлючу(МенеджерКриптографии, ПарольКонтейнера)
	
	Если ЗначениеЗаполнено(ПарольКонтейнера) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольКонтейнера;
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
Процедура ЗапомнитьПодходящийТипМодуляКриптографии(ТипМодуляКриптографии, ОтпечатокСертификата = "")
	
	ПодходящиеТипы = Кэш_Прочитать("ПодходящиеТипыМодулейКриптографии");
	
	Если ПодходящиеТипы = Неопределено Тогда
		ПодходящиеТипы = Новый Соответствие;
		Кэш_Поместить("ПодходящиеТипыМодулейКриптографии", ПодходящиеТипы);
	КонецЕсли;
	
	ПодходящиеТипы.Вставить(ОтпечатокСертификата, ТипМодуляКриптографии);
	
КонецПроцедуры

//&НаКлиенте
Функция ПодходящийТипМодуляКриптографии(ОтпечатокСертификата = "")
	
	Результат = Неопределено;
	
	ПодходящиеТипы = Кэш_Прочитать("ПодходящиеТипыМодулейКриптографии");
	
	Если ЗначениеЗаполнено(ПодходящиеТипы) Тогда
		Результат = ПодходящиеТипы[ОтпечатокСертификата];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ТипыМодулейКриптографии(ОтпечатокСертификата = "")
	
	Результат = Новый Массив;
	Результат.Добавить(80);
	Результат.Добавить(75);
	
	ПодходящийТипМодуля = ПодходящийТипМодуляКриптографии(ОтпечатокСертификата);
	
	Если ЗначениеЗаполнено(ПодходящийТипМодуля) Тогда
		
		ИндексПодходящего = Результат.Найти(ПодходящийТипМодуля);
		
		Если ИндексПодходящего > 0 Тогда
			
			// Переместим подходящий модуль в начало массива
			Результат.Удалить(ИндексПодходящего);
			Результат.Вставить(0, ПодходящийТипМодуля);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПолучитьХранилищеСертификатов(ПараметрыПоиска)
	
	МенеджерКриптографии	 = ИнициализироватьМенеджерКриптографии();
	
	ТипХранилища			 = СвойствоСтруктуры(ПараметрыПоиска, "ТипХранилища");
	РасположениеХранилища	 = СвойствоСтруктуры(ПараметрыПоиска, "РасположениеХранилища");
	
	Возврат МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилища, РасположениеХранилища);
	
КонецФункции

//&НаКлиенте
Функция Новый_ОписаниеСертификата(СертификатКриптографии, СвойстваСертификата)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Отпечаток", HexСтрокаИзДвоичныхДанных(СертификатКриптографии.Отпечаток));
	
	Если СвойстваСертификата.Свойство("СерийныйНомер") Тогда
		Результат.Вставить("СерийныйНомер", HexСтрокаИзДвоичныхДанных(СертификатКриптографии.СерийныйНомер));
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("Издатель") Тогда
		Результат.Вставить("Издатель", Новый Структура(СертификатКриптографии.Издатель));
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("Субъект") Тогда
		
		Результат.Вставить("Субъект", Новый Структура(СертификатКриптографии.Субъект));
		
		Если СертификатКриптографии.Субъект.Свойство("OGRN")Тогда
			Результат.Субъект.Вставить("ОГРН", СертификатКриптографии.Субъект.OGRN);
		ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_1") Тогда
			Результат.Субъект.Вставить("ОГРН", СертификатКриптографии.Субъект.OID1_2_643_100_1);
		КонецЕсли;
		
		Если СертификатКриптографии.Субъект.Свойство("SNILS") Тогда
			Результат.Субъект.Вставить("СНИЛС", СертификатКриптографии.Субъект.SNILS);
		ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_3") Тогда
			Результат.Субъект.Вставить("СНИЛС", СертификатКриптографии.Субъект.OID1_2_643_100_3);
		КонецЕсли;
		
		Если СертификатКриптографии.Субъект.Свойство("INN") Тогда
			Результат.Субъект.Вставить("ИНН", СертификатКриптографии.Субъект.INN);
		ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_3_131_1_1")Тогда
			Результат.Субъект.Вставить("ИНН", СертификатКриптографии.Субъект.OID1_2_643_3_131_1_1);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("ДвоичныеДанные") Тогда
		Результат.Вставить("ДвоичныеДанные", СертификатКриптографии.Выгрузить());
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("ДатаНачала") Тогда
		Результат.Вставить("ДатаНачала", СертификатКриптографии.ДатаНачала);
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("ДатаОкончания") Тогда
		Результат.Вставить("ДатаОкончания", СертификатКриптографии.ДатаОкончания);
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("РасширенныеСвойства") Тогда
		Результат.Вставить("РасширенныеСвойства", Новый Структура(СертификатКриптографии.РасширенныеСвойства));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПараметрыПоискаСертификатов()
	
	Результат = Новый Структура;
	
	Если ИспользоватьВнешнююКриптографию() Тогда
		
		Результат.Вставить("ТипХранилища",			"ПерсональныеСертификаты");
		Результат.Вставить("РасположениеХранилища",	"ДанныеПользователяОС");
		
	Иначе
		
		Результат.Вставить("ТипХранилища",			ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
		Результат.Вставить("РасположениеХранилища",	РасположениеХранилищаСертификатовКриптографии.ДанныеПользователяОС);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Процедура ВыполнитьОбработкуОповещенияПереопределенная(ОписаниеОповещения, Результат)
	
	Если ЭтоСтруктура(ОписаниеОповещения) Тогда
		
		Если ЗначениеЗаполнено(ОписаниеОповещения.ДополнительныеПараметры) Тогда 
			Выполнить("ОписаниеОповещения.Модуль.ОписаниеОповещения.ИмяПроцедуры(Результат, ОписаниеОповещения.ДополнительныеПараметры)");
		//Иначе
		//	Выполнить("ОписаниеОповещения.Модуль.ОписаниеОповещения.ИмяПроцедуры(Результат)");
		КонецЕсли;
		
	Иначе
		Выполнить("ВыполнитьОбработкуОповещения(ОписаниеОповещения, Результат)");
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
Функция НайтиСертификатВМассивеПоОтпечатку(МассивСертификатов, ОтпечатокСертификата)
	
	Результат = Неопределено;
	
	Для Каждого Сертификат Из МассивСертификатов Цикл
		
		ТекущийОтпечаток = HexСтрокаИзДвоичныхДанных(Сертификат.Отпечаток);
		
		Если ВРег(ТекущийОтпечаток) = ВРег(ОтпечатокСертификата) Тогда
			
			Результат = Сертификат;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//}		КРИПТОГРАФИЯ

//**********************************************
//{		ХЕШИРОВАНИЕ

//&НаКлиенте
Функция РассчитатьХэш_Native(ДвоичныеДанныеИмяФайла, НаименованиеХешФункции)
	
	Результат = 0;
	
	ТипХешФункции		 = ТипХешФункцииПоНаименованию(НаименованиеХешФункции);
	ХешированиеДанных	 = НовоеХешированиеДанных(ТипХешФункции);
	
	Если ТипЗнч(ДвоичныеДанныеИмяФайла) = Тип("ДвоичныеДанные") Тогда
		
		ХешированиеДанных.Добавить(ДвоичныеДанныеИмяФайла);
		
	Иначе
		
		ХешированиеДанных.ДобавитьФайл(ДвоичныеДанныеИмяФайла);
		
	КонецЕсли;
	
	ХешСумма = ХешированиеДанных.ХешСумма;
	
	Если ТипЗнч(ХешСумма) = Тип("ДвоичныеДанные") Тогда
		
		ХешСумма = HexСтрокаИзДвоичныхДанных(Результат);
		
	КонецЕсли;
	
	Результат = ВРег(ХешСумма);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция НовоеХешированиеДанных(ТипХешФункции)
	
	ПараметрыКонструктора = Новый Массив(1);
	ПараметрыКонструктора.Установить(0, ТипХешФункции);
	
	Результат = Новый ("ХешированиеДанных", ПараметрыКонструктора);
	
	Возврат Результат;
	
КонецФункции

Функция ТипХешФункцииПоНаименованию(НаименованиеХешФункции)
	
	ТипыХешФункции = Новый Соответствие;
	ТипыХешФункции.Вставить("CRC32"	, "ХешФункция.CRC32");
	ТипыХешФункции.Вставить("MD5"	, "ХешФункция.MD5");
	ТипыХешФункции.Вставить("SHA1"	, "ХешФункция.SHA1");
	ТипыХешФункции.Вставить("SHA256", "ХешФункция.SHA256");
	
	ТипХешФункцииСтрокой = ТипыХешФункции.Получить(НаименованиеХешФункции);
	
	Результат = Вычислить(ТипХешФункцииСтрокой);
	
	Возврат Результат;
	
КонецФункции

//}		ХЕШИРОВАНИЕ



//**********************************************
//{		КЭШИРОВАНИЕ

Функция Кэш_Прочитать(ИмяЗначения)
	
	Если Ядро <> Неопределено Тогда
		Результат = Ядро.Кэш_Прочитать(ИмяЗначения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура Кэш_Поместить(ИмяЗначения, Значение)
	
	Если Ядро <> Неопределено Тогда
		Ядро.Кэш_Поместить(ИмяЗначения, Значение);
	КонецЕсли;
	
КонецПроцедуры

//}		КЭШИРОВАНИЕ


//**********************************************
//{		ОБЩЕГО НАЗНАЧЕНИЯ

//&НаКлиенте
Функция Модуль_Плагин()
	
	Результат = Ядро.Модуль_Плагин(ЭтотОбъект);
	
	Возврат Результат;
	
КонецФункции

// Сравнивает текущую версию приложения с указанной версией.
// 
// Параметры:
//  Версия - Строка - номер версии, с которой нужно сравнить текущую версию приложения.
//
// Возвращаемое значение:
//   Булево - Истина, если текущая версия приложения старше чем версия параметра.
//            Например, 8.2 старше чем 8.3.
//
//&НаКлиенте
Функция ПриложениеСтаршеВерсии(Версия)
	
	Результаты = Кэш_Прочитать("РезультатыФункции_ПриложениеСтаршеВерсии");
	
	Если Результаты = Неопределено Тогда
		Результаты = Новый Соответствие;
	КонецЕсли;
	
	Результат = Результаты[Версия];
	
	Если Результат = Неопределено Тогда
		
		СисИнфо = Новый СистемнаяИнформация;
		
		Результат = СравнитьВерсии(СисИнфо.ВерсияПриложения, Версия) = "ПерваяМеньше";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает строку: "Равны" / "ПерваяБольше" / "ПерваяМеньше".
// Версии типа "1.0.1b" сравнивать нельзя.
//
//&НаКлиенте
Функция СравнитьВерсии(Знач ПерваяВерсия, Знач ВтораяВерсия, Разделитель = ".")
	
	Результат = "Равны";  // ПерваяБольше / ПерваяМеньше
	
	Пока НЕ ПустаяСтрока(ПерваяВерсия) ИЛИ НЕ ПустаяСтрока(ВтораяВерсия) Цикл
		
		Поз = Найти(ПерваяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерПервойВерсии = Число(Лев(ПерваяВерсия, Поз - 1));
			ПерваяВерсия = Сред(ПерваяВерсия, Поз + 1);
		Иначе
			НомерПервойВерсии = ?(ПустаяСтрока(ПерваяВерсия), 0, Число(ПерваяВерсия));
			ПерваяВерсия = "";
		КонецЕсли;
		
		Поз = Найти(ВтораяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерВторойВерсии = Число(Лев(ВтораяВерсия, Поз - 1));
			ВтораяВерсия = Сред(ВтораяВерсия, Поз + 1);
		Иначе
			НомерВторойВерсии = ?(ПустаяСтрока(ВтораяВерсия), 0, Число(ВтораяВерсия));
			ВтораяВерсия = "";
		КонецЕсли;
		
		Если НомерПервойВерсии > НомерВторойВерсии Тогда
			
			Результат = "ПерваяБольше";
			Прервать;
			
		ИначеЕсли НомерПервойВерсии < НомерВторойВерсии Тогда
			
			Результат = "ПерваяМеньше";
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
// 
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Имя ключа структуры,
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в структуре нет указанного свойства.
// 
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем Значение;
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ЭтоСтруктура(Структура) И ЗначениеЗаполнено(Ключ) Тогда
		
		Если Структура.Свойство(Ключ, Значение) Тогда
			Результат = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение структурой или фиксированной структурой.
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить.
// 
// Возвращаемое значение:
//   Булево - Истина, если переданое значение является структрой или фиксированной структурой.
//
//&НаКлиенте
Функция ЭтоСтруктура(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если Значение = Неопределено Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		
		Результат = Истина;
		
	ИначеЕсли НЕ ПриложениеСтаршеВерсии("8.2") И ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Разделяет строку на части по указанным символам-разделителям.
// По аналогии с глобальным методом СтрРазделить, добавленным в платформу версии 8.3.6.
//
// Параметры:
//  Строка         - Строка - разделяемая строка;
//  Разделитель    - Строка - строка символов, каждый из которых является индивидуальным разделителем;
//  ВключатьПустые - Булево - Ложь, если пустые части строки включать в результат не нужно.
// 
// Возвращаемое значение:
//  Массив - массив со строками, которые получились в результате разделения исходной строки.
//
//&НаКлиенте
Функция РазделитьСтроку(Знач Строка, Разделитель = ",", ВключатьПустые = Истина)
	
	Результат = Новый Массив;
	
	МассивРазделителей = Новый Массив;
	
	Для Сч = 1 По СтрДлина(Разделитель) Цикл
		СимволРазделителя = Сред(Разделитель, Сч, 1);
		МассивРазделителей.Добавить(СимволРазделителя);
	КонецЦикла;
	
	Пока Истина Цикл
		
		Поз = 0;
		
		Для Каждого СимволРазделителя Из МассивРазделителей Цикл
			
			Поз = Найти(Строка, СимволРазделителя);
			
			Если Поз > 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Поз = 0 Тогда
			Подстрока	 = СокрЛП(Строка);
			Строка		 = "";
		Иначе
			Подстрока	 = СокрЛП(Лев(Строка, Поз - 1));
			Строка		 = Сред(Строка, Поз + 1);
		КонецЕсли;
		
		Если ВключатьПустые ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать; // Нет разделителя, за которым могла бы быть следующая часть строки.
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Соединяет массив переданных строк в одну строку с указанным разделителем.
// По аналогии с глобальным методом СтрСоединить, добавленным в платформу версии 8.3.6.
// 
// Параметры:
//  Строки - Произвольный - значение тип которого нужно определить.
//  Разделитель - ФиксированныйМассив; Массив - значение тип которого нужно определить.
//
// Возвращаемое значение:
//   Строка - строка, содержащая соединенные исходные строки с разделителем между ними.
//
//&НаКлиенте
Функция СоединитьСтроку(Строки, Разделитель = "") Экспорт
	
	// Аналог: ЭДО_Служебные_МассивВСтроку
	// Отличия:
	// По умолчанию Разделитель = "", раньше Разделитель = Символы.ПС;
	// В параметр "Строки" не поддерживает тип "Строка".
	
	Результат		 = "";
	ТекРазделитель	 = "";
	
	Если ЗначениеЗаполнено(Строки) Тогда
		
		Для Каждого Строка Из Строки Цикл
			
			Если ЗначениеЗаполнено(Строка) Тогда
				Результат		 = Результат + ТекРазделитель + Строка;
				ТекРазделитель	 = Разделитель;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку, максимальное число параметров - 5.
//
// Параметры:
//  ШаблонСтроки - Строка - шаблон строки с параметрами;
//  Параметр<n>  - Строка - подставляемый параметр.
//
// Возвращаемое значение:
//   Строка - строка с подставленными параметрами.
//
//&НаКлиенте
Функция Общее_ПодставитьПараметрыВСтроку(ШаблонСтроки,
								   Параметр1,
								   Параметр2 = Неопределено,
								   Параметр3 = Неопределено,
								   Параметр4 = Неопределено,
								   Параметр5 = Неопределено)
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	
	Возврат Результат;
	
КонецФункции

// Преобразует двоичные данные в строку формата Base 16 (Hex).
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - двоичные данные, из которых нужно получить строку.
//
// Возвращаемое значение:
//   Строка - Hex строка.
//
//&НаКлиенте
Функция HexСтрокаИзДвоичныхДанных(ДвоичныеДанные)
	
	Если ПриложениеСтаршеВерсии("8.3.10") Тогда
		
		Результат = ВРег(СтрЗаменить(Строка(ДвоичныеДанные), " ", ""));
		
	Иначе
		
		Результат = Вычислить("ПолучитьHexСтрокуИзДвоичныхДанных(ДвоичныеДанные)");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Строковое представление объекта ИнтернетПрокси.
//
// Параметры:
//  Прокси 		- ИнтернетПрокси	- объект ИнтернетПрокси.
//  Протокол 	- Строка			- имя протокола (напр. "http" или "https").
//
// Возвращаемое значение:
//   Строка - строковое представление ИнтернетПрокси.
//
//&НаКлиенте
Функция ПредставлениеИнтернетПрокси(Прокси, Протокол = Неопределено)
	
	Журнал = Новый Массив;
	
	Если ЗначениеЗаполнено(Протокол) Тогда
		
		СтрокаЖурнала = ПредставлениеАдресаПроксиПоИмениПротокола(Прокси, Протокол);
		Журнал.Добавить(СтрокаЖурнала);
		
	Иначе
		
		ПредставлениеАдреса = ПредставлениеАдресаПроксиПоИмениПротокола(Прокси);
		Журнал.Добавить(ПредставлениеАдреса);
		
		ПредставлениеАдреса = ПредставлениеАдресаПроксиПоИмениПротокола(Прокси, "http");
		Журнал.Добавить(ПредставлениеАдреса);

		ПредставлениеАдреса = ПредставлениеАдресаПроксиПоИмениПротокола(Прокси, "https");
		Журнал.Добавить(ПредставлениеАдреса);

		ПредставлениеАдреса = ПредставлениеАдресаПроксиПоИмениПротокола(Прокси, "ftp");
		Журнал.Добавить(ПредставлениеАдреса);
		
	КонецЕсли;
	
	НастройкиАвторизации = НастройкиАвторизацииИнтернетПрокси(Прокси, "");
	
	Если НастройкиАвторизации.ИспользоватьАутентификациюОС Тогда 
		
		СтрокаЖурнала = НСтр("ru = 'Используется аутентификация операционной системы'");
		
	Иначе 
		
		Пользователь = НастройкиАвторизации.Пользователь;
		Пароль 		 = НастройкиАвторизации.Пароль;
		
		Если ПустаяСтрока(Пароль) Тогда
			СостояниеПароля = НСтр("ru = '<не указан>'");
		Иначе
			СостояниеПароля = НСтр("ru = '********'");
		КонецЕсли;
		
		СтрокаЖурнала = НСтр("ru = 'Используется аутентификация по имени пользователя и паролю'");
		Журнал.Добавить(СтрокаЖурнала);
		
		ШаблонСтрокиЖурнала = НСтр("ru = 'Пользователь: %1
			           					 |Пароль: %2'");
										 
		СтрокаЖурнала = Общее_ПодставитьПараметрыВСтроку(
			ШаблонСтрокиЖурнала,
			Пользователь,
			СостояниеПароля);
			
	КонецЕсли;
	
	Журнал.Добавить(СтрокаЖурнала);
	
	Если Прокси.НеИспользоватьПроксиДляЛокальныхАдресов Тогда 
		
		СтрокаЖурнала = НСтр("ru = 'Не использовать прокси для локальных адресов'");
		Журнал.Добавить(СтрокаЖурнала);
		
	КонецЕсли;
	
	Если Прокси.НеИспользоватьПроксиДляАдресов.Количество() > 0 Тогда 
		
		СтрокаЖурнала = НСтр("ru = 'Не использовать для следующих адресов:'"); 
		Журнал.Добавить(СтрокаЖурнала);
		
		Для Каждого ИсключаемыйАдрес Из Прокси.НеИспользоватьПроксиДляАдресов Цикл
			Журнал.Добавить(ИсключаемыйАдрес);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СоединитьСтроку(Журнал, Символы.ПС);
	
КонецФункции

// Возвращает строковое представление сервера и порта прокси для указанного протокола.
//
// Параметры:
//  Прокси 		- ИнтернетПрокси	- объект ИнтернетПрокси.
//  Протокол 	- Строка			- имя протокола (напр. "http" или "https").
//
// Возвращаемое значение:
//   Строка - строковое представление сервера и порта.
//
// Пример:
//	// для протокола http
//	Результат = ПредставлениеАдресаПрокси(ИнтернетПрокси, "http");
//	
//	возвращаемая строка "HTTP: kontur.proxy.ru:8080"
//
//&НаКлиенте
Функция ПредставлениеАдресаПроксиПоИмениПротокола(Прокси, Протокол = Неопределено)

	Если ЗначениеЗаполнено(Протокол) Тогда
		Сервер 	= Прокси.Сервер(Протокол);
		Порт 	= Прокси.Порт(Протокол);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сервер) Тогда
		Сервер 	= Прокси.Сервер();
		Порт 	= Прокси.Порт();
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Сервер)
		И Не ЗначениеЗаполнено(Порт) Тогда
		Порт = ПортПоУмолчанию(Протокол);
	КонецЕсли;
		
	ПортСтрокой = Формат(Порт, "ЧГ=");
	
	Если Протокол = Неопределено Тогда
		ПредставлениеПротокола = "Адрес";
	Иначе
		ПредставлениеПротокола = ВРег(Протокол);
	КонецЕсли;
	
	ШаблонСтроки = НСтр("ru = '%1: %2:%3'");
	
	Результат = Общее_ПодставитьПараметрыВСтроку(
		ШаблонСтроки,
		ПредставлениеПротокола,
		Сервер,
		ПортСтрокой);
		
	Возврат Результат;
	
КонецФункции

// Возвращает настройки авторизации объекта ИнтернетПрокси.
// Функция является "оберткой" для старых платформ.
//
// Параметры:
//  Прокси 		- ИнтернетПрокси	- объект ИнтернетПрокси.
//  Протокол 	- Строка			- имя протокола (напр. "http" или "https").
//
// Возвращаемое значение:
//   Структура - настройки авторизации ИнтернетПрокси.
//
//&НаКлиенте
Функция НастройкиАвторизацииИнтернетПрокси(Прокси, Протокол = Неопределено)
	
	Результат = Новый Структура;
	
	Если ПриложениеСтаршеВерсии("8.3.7") Тогда
		ИспользоватьАутентификациюОС = Истина;
	Иначе
		ИспользоватьАутентификациюОС = Вычислить("Прокси.ИспользоватьАутентификациюОС(Протокол)");
	КонецЕсли;
		
	Результат.Вставить("ИспользоватьАутентификациюОС", ИспользоватьАутентификациюОС);
	
	Если ПриложениеСтаршеВерсии("8.3.6") Тогда
		Пользователь 	= "";
		Пароль 			= "";
	Иначе
		Пользователь 	= Вычислить("Прокси.Пользователь(Протокол)");
		Пароль 			= Вычислить("Прокси.Пароль(Протокол)");
	КонецЕсли;
	
	Результат.Вставить("Пользователь", Пользователь);
	Результат.Вставить("Пароль", Пароль);
	
	Возврат Результат;
	
КонецФункции

// Возвращает Истина, если текущий сеанс выполняется на сервере, работающем под управлением ОС Windows.
//
// Возвращаемое значение:
//  Булево - Истина, если сервер работает под управлением ОС Windows.
//
//&НаКлиенте
Функция ЭтоWindowsСервер()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
		Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
КонецФункции

// Возвращает Истина, если текущий сеанс выполняется на сервере, работающем под управлением ОС Linux.
//
// Возвращаемое значение:
//  Булево - Истина, если сервер работает под управлением ОС Linux.
//
//&НаКлиенте
Функция ЭтоLinuxСервер()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 
		Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
КонецФункции

//}		ОБЩЕГО НАЗНАЧЕНИЯ


//**********************************************
//{		ДИАГНОСТИКА СОЕДИНЕНИЯ СЛУЖЕБНЫЕ

// Возвращает структуру с описанием состояния настроек прокси
//
// Параметры:
//  НастройкиПрокси - Структура - состав см. Модуль_API.НовыйНастройкиПрокси.
//  Протокол 		- Строка 	- имя протокола (напр. "http" или "https").
//
// Возвращаемое значение:
//  Структура - описание состояния настроек прокси
//   * СоединениеЧерезПрокси	 			- Булево - признак использования прокси. Истина - прокси используется.
//   * Представление 						- Строка - строковое представление настроек прокси.
//   * ИспользуютсяСистемныеНастройкиПрокси	- Булево - признак использования системных настроек прокси.
//
//&НаКлиенте
Функция СостояниеНастроекПрокси(НастройкиПрокси = Неопределено, Знач Протокол = Неопределено)
	
	Если НастройкиПрокси = Неопределено Тогда
		НастройкиПрокси	= Ядро.ОбщиеНастройки_НастройкиПрокси();
	КонецЕсли;
	
	РежимыПрокси = Ядро.АПИ_РежимыИспользованияПрокси();
	
	Прокси = НовыйИнтернетПрокси(НастройкиПрокси);
	
	Журнал = Новый Массив;
	
	Если НастройкиПрокси = Неопределено Тогда 
		СтрокаЖурнала = НСтр("ru = 'Параметры прокси-сервера в ИБ не указаны (используются системные настройки прокси).'"); 
	ИначеЕсли НастройкиПрокси.РежимПрокси = РежимыПрокси.БезПрокси Тогда
		СтрокаЖурнала = НСтр("ru = 'Параметры прокси-сервера в ИБ: Не использовать прокси-сервер.'");
	ИначеЕсли НастройкиПрокси.РежимПрокси = РежимыПрокси.ИспользоватьСистемныеНастройки Тогда
		СтрокаЖурнала = НСтр("ru = 'Параметры прокси-сервера в ИБ: Использовать системные настройки прокси-сервера.'");
	Иначе
		СтрокаЖурнала = НСтр("ru = 'Параметры прокси-сервера в ИБ: Использовать другие настройки прокси-сервера.'");
	КонецЕсли;
	
	Журнал.Добавить(СтрокаЖурнала);
	
	СоединениеЧерезПрокси = Не ПустаяСтрока(Прокси.Сервер(Протокол)) Или Не ПустаяСтрока(Прокси.Сервер());
	
	Если СоединениеЧерезПрокси Тогда 
		
		СтрокаЖурнала = НСтр("ru = 'Соединение выполняется через прокси-сервер:'");
		Журнал.Добавить(СтрокаЖурнала);
		
		ПредставлениеПрокси = ПредставлениеИнтернетПрокси(Прокси, Протокол);
		Журнал.Добавить(ПредставлениеПрокси);
		
	КонецЕсли;
	
	ИспользуютсяСистемныеНастройкиПрокси = (НастройкиПрокси.РежимПрокси = РежимыПрокси.ИспользоватьСистемныеНастройки);
	
	ЖурналСтрокой = СоединитьСтроку(Журнал, Символы.ПС);
	
	Результат = Новый Структура;
	Результат.Вставить("СоединениеЧерезПрокси"				 , СоединениеЧерезПрокси);
	Результат.Вставить("Представление"						 , ЖурналСтрокой);
	Результат.Вставить("ИспользуютсяСистемныеНастройкиПрокси", ИспользуютсяСистемныеНастройкиПрокси);
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция ПредставлениеМестаДиагностики()
	
	#Если ВебКлиент Тогда
		ИмяКомпьютера = "Веб-клиент";	
	#Иначе
		ИмяКомпьютера = ИмяКомпьютера();
	#КонецЕсли
	
	Если Ядро.ОбщийКонтекстКлиентСервер.ФайловыйРежимРаботы Тогда
		
		ШаблонСтроки = НСтр("ru = 'Подключение проводится из файловой информационной базы на компьютере <%1>.'");
		
		Результат = Общее_ПодставитьПараметрыВСтроку(
			ШаблонСтроки,
			ИмяКомпьютера);
			
		Возврат Результат;
		
	Иначе
		
		ШаблонСтроки = НСтр("ru = 'Подключение проводится на сервере 1С:Предприятие <%1>.'");
		
		Результат = Общее_ПодставитьПараметрыВСтроку(
			ШаблонСтроки,
			ИмяКомпьютера);
			
		Возврат Результат; 
		
	КонецЕсли;
	
КонецФункции

//&НаКлиенте
Функция ПроверитьДоступностьСервера(АдресСервера)
	
	ПараметрыЗапускаПрограммы = ПараметрыЗапускаПрограммы();
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;
	ПараметрыЗапускаПрограммы.ПолучитьПотокОшибок = Истина;
	ПараметрыЗапускаПрограммы.КодировкаИсполнения = "OEM";
	
	Если ЭтоWindowsСервер() Тогда
		ШаблонКоманды = "ping %1 -n 4 -w 1000";
	Иначе
		ШаблонКоманды = "ping -c 4 -W 1 %1";
	КонецЕсли;
	
	СтрокаКоманды = Общее_ПодставитьПараметрыВСтроку(ШаблонКоманды, АдресСервера);
	
	Результат = ЗапуститьПрограмму(СтрокаКоманды, ПараметрыЗапускаПрограммы);
	
	// Разные операционные системы могут выводить ошибки в разные потоки:
	// - для Windows все всегда в потоке вывода;
	// - для Debian или RHEL ошибки падают в поток ошибок.
	ЖурналДоступности = Результат.ПотокВывода + Результат.ПотокОшибок;
	
	Если ЭтоWindowsСервер() Тогда
		Доступен = Найти(ЖурналДоступности, "Destination host unreachable") = 0 // Не локализуется.
			И (Найти(ЖурналДоступности, "(0% loss)") > 0 // Не локализуется.
			Или Найти(ЖурналДоступности, "(25% loss)") > 0); // Не локализуется.
	Иначе 
		Доступен = Найти(ЖурналДоступности, "Destination Host Unreachable") = 0 // Не локализуется.
			И (Найти(ЖурналДоступности, "(0% packet loss)") > 0 // Не локализуется.
			Или Найти(ЖурналДоступности, "(25% packet loss)") > 0); // Не локализуется.
	КонецЕсли;
	
	Журнал = Новый Массив;
	
	Если Доступен Тогда
		
		ШаблонСтрокиЖурнала = НСтр("ru = 'Удаленный сервер %1 доступен:'");
		
		СтрокаЖурнала = Общее_ПодставитьПараметрыВСтроку(
			ШаблонСтрокиЖурнала, 
			АдресСервера);
			
	Иначе
		
		ШаблонСтрокиЖурнала = НСтр("ru = 'Удаленный сервер %1 не доступен:'");
		
		СтрокаЖурнала = Общее_ПодставитьПараметрыВСтроку(
			ШаблонСтрокиЖурнала, 
			АдресСервера);
			
	КонецЕсли;
	
	Журнал.Добавить(СтрокаЖурнала);
	
	Журнал.Добавить("> " + СтрокаКоманды);
	Журнал.Добавить(ЖурналДоступности);
	
	ЖурналСтрокой = СоединитьСтроку(Журнал, Символы.ПС);
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("Доступен"			, Доступен);
	РезультатПроверки.Вставить("ЖурналДиагностики"	, ЖурналСтрокой); 
	
	Возврат РезультатПроверки;
	
КонецФункции

//&НаКлиенте
Функция ЖурналТрассировкиМаршрутаСервера(АдресСервера)
	
	ПараметрыЗапускаПрограммы = ПараметрыЗапускаПрограммы();
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;
	ПараметрыЗапускаПрограммы.ПолучитьПотокОшибок = Истина;
	ПараметрыЗапускаПрограммы.КодировкаИсполнения = "OEM";
	
	Если ЭтоWindowsСервер() Тогда
		ШаблонКоманды = "tracert -w 100 -h 15 %1";
	Иначе 
		// Если вдруг пакет traceroute не установлен - в потоке вывода будет ошибка.
		// Т.к. результат все равно не разбирается, на поток вывода можно не обращать внимания.
		// По нему администратор поймет что ему надо доставить.
		ШаблонКоманды = "traceroute -w 100 -m 100 %1";
	КонецЕсли;
	
	СтрокаКоманды = Общее_ПодставитьПараметрыВСтроку(ШаблонКоманды, АдресСервера);
	
	Результат = ЗапуститьПрограмму(СтрокаКоманды, ПараметрыЗапускаПрограммы);
	
	Журнал = Новый Массив;
	
	ШаблонСтрокиЖурнала = НСтр("ru = 'Трассировка маршрута к удаленному серверу %1:'");
	СтрокаЖурнала 		= Общее_ПодставитьПараметрыВСтроку(
		ШаблонСтрокиЖурнала,
		АдресСервера);
		
	Журнал.Добавить(СтрокаЖурнала);
	Журнал.Добавить("> " + СтрокаКоманды);
	Журнал.Добавить(Результат.ПотокВывода);
	Журнал.Добавить(Результат.ПотокОшибок);
	
	Возврат СоединитьСтроку(Журнал, Символы.ПС);
	
КонецФункции

//&НаКлиенте
Функция ПортПоУмолчанию(Протокол)
	
	ПортыПоУмолчанию = Новый Соответствие;
	ПортыПоУмолчанию.Вставить("http", 80);
	ПортыПоУмолчанию.Вставить("https", 443);
	ПортыПоУмолчанию.Вставить("ftp", 21);
	ПортыПоУмолчанию.Вставить("ftps", 990);
	
	Возврат ПортыПоУмолчанию[НРег(Протокол)];
	
КонецФункции

//}		ДИАГНОСТИКА СОЕДИНЕНИЯ СЛУЖЕБНЫЕ


//**********************************************
//{		ФАЙЛОВАЯ СИСТЕМА

// Запускает внешнюю программу на исполнение (например, *.exe, *bat), 
// или системную команду (например, ping, tracert или traceroute, обращаться к rac-клиенту),
// Позволяет также получать код возврата и значения потоков вывода (stdout) и ошибок (stderr)
//
// При запуске внешней программы в пакетном режиме поток вывода и поток ошибок может возвращаться на не ожидаемом языке. 
// Для того чтобы передать внешней программе язык, на котором ожидается результат следует:
// - указать язык в параметре запуска этой программы (если такой параметр предусмотрен). 
//   Например, в пакетном режиме платформы 1С:Предприятие предусмотрен ключ "/L en";
// - в других случаях явно установить кодировку исполнения пакетной команды.
//   См. свойство КодировкаИсполнения возвращаемого значения ПараметрыЗапускаПрограммы. 
//
// Параметры:
//  КомандаЗапуска - Строка - командная строка для запуска программы.
//                 - Массив - первый элемент массива, путь к исполняемому приложению, 
//                            остальные элементы массива - это передаваемые параметры,
//                            массив соответствует тому, который получит вызываемая программа в argv.
//  ПараметрыЗапускаПрограммы - см. ПараметрыЗапускаПрограммы
//
// Возвращаемое значение:
//  Структура:
//    * КодВозврата - Число  - код возврата программы;
//    * ПотокВывода - Строка - результат работы программы, направленный в поток stdout;
//    * ПотокОшибок - Строка - ошибки исполнения программы, направленные в поток stderr.
//
// Пример:
//	// Простой запуск
//	ЗапуститьПрограмму("calc");
//	
//	// Запуск с ожиданием завершения
//	ПараметрыЗапускаПрограммы = ПараметрыЗапускаПрограммы();
//	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
//	ЗапуститьПрограмму("C:\Program Files\1cv8\common\1cestart.exe", ПараметрыЗапускаПрограммы);
//	
//	// Запуск с ожиданием завершения и получением потока вывода
//	ПараметрыЗапускаПрограммы = ПараметрыЗапускаПрограммы();
//	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
//	ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;
//	Результат = ЗапуститьПрограмму("ping 127.0.0.1 -n 5", ПараметрыЗапускаПрограммы);
//	Сообщить(Результат.ПотокВывода);
//
//	// Запуск с ожиданием завершения и получением потока вывода и с конкатенацией команды запуска
//	ПараметрыЗапускаПрограммы = ПараметрыЗапускаПрограммы();
//	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
//	ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;
//	КомандаЗапуска = Новый Массив;
//	КомандаЗапуска.Добавить("ping");
//	КомандаЗапуска.Добавить("127.0.0.1");
//	КомандаЗапуска.Добавить("-n");
//	КомандаЗапуска.Добавить(5);
//	Результат = ЗапуститьПрограмму(КомандаЗапуска, ПараметрыЗапускаПрограммы);
//	Сообщить(Результат.ПотокВывода);
//
//&НаКлиенте
Функция ЗапуститьПрограмму(Знач КомандаЗапуска, ПараметрыЗапускаПрограммы = Неопределено) 
	
	#Если Не ВебКлиент Тогда
		
		// АПК:534-выкл методы безопасного запуска обеспечиваются этой функцией
		
		СтрокаКоманды = БезопаснаяСтрокаКоманды(КомандаЗапуска);
		
		Если ПараметрыЗапускаПрограммы = Неопределено Тогда 
			ПараметрыЗапускаПрограммы = ПараметрыЗапускаПрограммы();
		КонецЕсли;
		
		ТекущийКаталог 		= ПараметрыЗапускаПрограммы.ТекущийКаталог;
		ДождатьсяЗавершения = ПараметрыЗапускаПрограммы.ДождатьсяЗавершения;
		ПолучитьПотокВывода = ПараметрыЗапускаПрограммы.ПолучитьПотокВывода;
		ПолучитьПотокОшибок = ПараметрыЗапускаПрограммы.ПолучитьПотокОшибок;
		КодировкаПотоков 	= ПараметрыЗапускаПрограммы.КодировкаПотоков;
		КодировкаИсполнения = ПараметрыЗапускаПрограммы.КодировкаИсполнения;
		
		ПроверитьТекущийКаталог(СтрокаКоманды, ТекущийКаталог);
		
		ДобавитьПотокВывода = (ДождатьсяЗавершения И ПолучитьПотокВывода);
		ДобавитьПотокОшибок = (ДождатьсяЗавершения И ПолучитьПотокОшибок);
		
		Если ДобавитьПотокВывода Тогда 
			// BSLLS:MissingTemporaryFileDeletion-off
			ИмяФайлаПотокаВывода = ПолучитьИмяВременногоФайла("stdout.tmp");
			// BSLLS:MissingTemporaryFileDeletion-on
			СтрокаКоманды = СтрокаКоманды + " > """ + ИмяФайлаПотокаВывода + """";
		КонецЕсли;
		
		Если ДобавитьПотокОшибок Тогда 
			// BSLLS:MissingTemporaryFileDeletion-off
			ИмяФайлаПотокаОшибок = ПолучитьИмяВременногоФайла("stderr.tmp");
			// BSLLS:MissingTemporaryFileDeletion-on
			СтрокаКоманды = СтрокаКоманды + " 2>""" + ИмяФайлаПотокаОшибок + """";
		КонецЕсли;
		
		КодВозврата = ВыполнитьЗапускВнешнегоПриложения(СтрокаКоманды, ПараметрыЗапускаПрограммы);
		
		ПотокВывода = "";
		ПотокОшибок = "";
		
		Если КодировкаПотоков = Неопределено Тогда 
			КодировкаПотоков = КодировкаСтандартныхПотоков();
		КонецЕсли;
		
		Если ДобавитьПотокВывода Тогда
			ПотокВывода = ПрочитатьТекстовыйФайлЕслиСуществует(ИмяФайлаПотокаВывода, КодировкаПотоков);
			УдалитьВременныйФайл(ИмяФайлаПотокаВывода);
		КонецЕсли;
		
		Если ДобавитьПотокОшибок Тогда 
			ПотокОшибок = ПрочитатьТекстовыйФайлЕслиСуществует(ИмяФайлаПотокаОшибок, КодировкаПотоков);
			УдалитьВременныйФайл(ИмяФайлаПотокаОшибок);
		КонецЕсли;
		
		Результат = Новый Структура;
		Результат.Вставить("КодВозврата", КодВозврата);
		Результат.Вставить("ПотокВывода", ПотокВывода);
		Результат.Вставить("ПотокОшибок", ПотокОшибок);
		
		Возврат Результат;
		
		// АПК:534-вкл
		
	#КонецЕсли
	
КонецФункции

// Конструктор параметров для ЗапуститьПрограмму.
//
// Возвращаемое значение:
//  Структура:
//    * ТекущийКаталог - Строка - задает текущий каталог запускаемого приложения.
//    * ДождатьсяЗавершения - Булево - Ложь - дожидаться завершения запущенного приложения 
//         перед продолжением работы.
//    * ПолучитьПотокВывода - Булево - Ложь - результат, направленный в поток stdout,
//         если не указан ДождатьсяЗавершения - игнорируется.
//    * ПолучитьПотокОшибок - Булево - Ложь - ошибки, направленные в поток stderr,
//         если не указан ДождатьсяЗавершения - игнорируется.
//    * КодировкаПотоков - КодировкаТекста
//                       - Строка - кодировка, используемая для чтения stdout и stderr.
//         По умолчанию используется для Windows OEM (cp437), остальные КодировкаТекста.Системная.
//    * КодировкаИсполнения - Строка
//                          - Число - кодировка, устанавливаемая в Windows с помощью команды chcp,
//             возможные значения: "OEM", "CP866", "UTF8" или номер кодовой страницы.
//         В Linux устанавливается переменной окружения "LANGUAGE" для конкретной команды,
//             возможные значения можно определить выполнив команду "locale -a", например "ru_RU.UTF-8".
//         В MacOS игнорируется.
//
//&НаКлиенте
Функция ПараметрыЗапускаПрограммы()
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекущийКаталог", "");
	Параметры.Вставить("ДождатьсяЗавершения", Ложь);
	Параметры.Вставить("ПолучитьПотокВывода", Ложь);
	Параметры.Вставить("ПолучитьПотокОшибок", Ложь);
	Параметры.Вставить("КодировкаПотоков", Неопределено);
	Параметры.Вставить("КодировкаИсполнения", Неопределено);
	
	Возврат Параметры;
	
КонецФункции

//&НаКлиенте
Функция ВыполнитьЗапускВнешнегоПриложения(СтрокаКоманды, ПараметрыЗапускаПрограммы)
	
	ТекущийКаталог 		= ПараметрыЗапускаПрограммы.ТекущийКаталог;
	ДождатьсяЗавершения = ПараметрыЗапускаПрограммы.ДождатьсяЗавершения;
	КодировкаИсполнения = ПараметрыЗапускаПрограммы.КодировкаИсполнения;
	
	КодВозврата = Неопределено;
	
	Если ЭтоWindowsСервер() Тогда
		
		КодВозврата = ЗапуститьПриложениеВWindows(СтрокаКоманды, ПараметрыЗапускаПрограммы);
		
	Иначе
		
		Если ЭтоLinuxСервер() И ЗначениеЗаполнено(КодировкаИсполнения) Тогда
			СтрокаКоманды = "LANGUAGE=" + КодировкаИсполнения + " " + СтрокаКоманды;
		КонецЕсли;
		
		ЗапуститьПриложение(СтрокаКоманды, ТекущийКаталог, ДождатьсяЗавершения, КодВозврата);
		
	КонецЕсли;

	Возврат КодВозврата;
	
КонецФункции

//&НаКлиенте
Функция ЗапуститьПриложениеВWindows(СтрокаКоманды, ПараметрыЗапускаПрограммы)
	
	#Если Не ВебКлиент Тогда
		
		Перем КодВозврата;
		
		ТекущийКаталог 		= ПараметрыЗапускаПрограммы.ТекущийКаталог;
		ДождатьсяЗавершения = ПараметрыЗапускаПрограммы.ДождатьсяЗавершения;
		КодировкаИсполнения = ПараметрыЗапускаПрограммы.КодировкаИсполнения;
		КодировкаПотоков 	= ПараметрыЗапускаПрограммы.КодировкаПотоков;
		
		// BSLLS:MissingTemporaryFileDeletion-off
		ИмяФайлаКоманды 	= ПолучитьИмяВременногоФайла("run.bat");
		// BSLLS:MissingTemporaryFileDeletion-on
		
		ФайловыйРежимРаботы = Ядро.ОбщийКонтекстКлиентСервер.ФайловыйРежимРаботы;
		
		ТекстовыйДокумент = НовыйФайлЗапускаКомандыWindows(СтрокаКоманды, ТекущийКаталог, ДождатьсяЗавершения, КодировкаИсполнения);
		ТекстовыйДокумент.Записать(ИмяФайлаКоманды, КодировкаПотоков);
		
		Если ФайловыйРежимРаботы Тогда
			
			Оболочка 	= Новый COMОбъект("Wscript.Shell");
			КодВозврата = Оболочка.Run(ИмяФайлаКоманды, 0, ДождатьсяЗавершения);
			Оболочка 	= Неопределено;
			
		Иначе 
			
			ЗапуститьПриложение(ИмяФайлаКоманды,, ДождатьсяЗавершения, КодВозврата);
			
		КонецЕсли;
		
		Если ДождатьсяЗавершения Тогда
			УдалитьВременныйФайл(ИмяФайлаКоманды);
		КонецЕсли;
		
		Возврат КодВозврата;
		
	#КонецЕсли
	
КонецФункции

//&НаКлиенте
Функция БезопаснаяСтрокаКоманды(КомандаЗапуска)
	
	Результат = "";
	
	Если ТипЗнч(КомандаЗапуска) = Тип("Строка") Тогда 
		
		Если СодержитНебезопасныеДействия(КомандаЗапуска) Тогда 
			
			ШаблонОшибки = НСтр("ru = 'Не удалось запустить программу
				           			  |по причине:
				           			  |Недопустимая строка команды
				           			  |%1
				           			  |по причине:
				           			  |Строка команды не должна содержать символы: ""$"", ""`"", ""|"", "";"", ""&"".'");
									  
			ТекстОшибки  = Общее_ПодставитьПараметрыВСтроку(ШаблонОшибки, КомандаЗапуска);
			
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
		Результат = КомандаЗапуска;
		
	ИначеЕсли ТипЗнч(КомандаЗапуска) = Тип("Массив") Тогда
		
		Если КомандаЗапуска.Количество() > 0 Тогда 
			
			Если СодержитНебезопасныеДействия(КомандаЗапуска[0]) Тогда
				
				ШаблонОшибки = НСтр("ru = 'Не удалось запустить программу
				           				  |по причине:
				           				  |Недопустимая команда или путь к исполняемому файлу
				          				  |%1
				         				  |по причине:
				         				  |Команда не должна содержать символы: ""$"", ""`"", ""|"", "";"", ""&"".'");
						   
				ТекстОшибки  = Общее_ПодставитьПараметрыВСтроку(ШаблонОшибки, КомандаЗапуска[0]);
			
				ВызватьИсключение ТекстОшибки;

			КонецЕсли;
			
			Результат = МассивВСтрокуКоманды(КомандаЗапуска);
			
		Иначе
			ТекстОшибки = НСтр("ru = 'Ожидалось, что первый элемент массива КомандаЗапуска будет командой или путем к исполняемому файлу.'");
			ВызватьИсключение ТекстОшибки;
				
		КонецЕсли;
		
	Иначе 
		ТекстОшибки = НСтр("ru = 'Ожидалось, что значение КомандаЗапуска будет <Строка> или <Массив>'");
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция СодержитНебезопасныеДействия(Знач СтрокаКоманды)
	
	Возврат Найти(СтрокаКоманды, "$") <> 0
		Или Найти(СтрокаКоманды, "`") <> 0
		Или Найти(СтрокаКоманды, "|") <> 0
		Или Найти(СтрокаКоманды, ";") <> 0
		Или Найти(СтрокаКоманды, "&") <> 0;
	
КонецФункции

//&НаКлиенте
Функция МассивВСтрокуКоманды(КомандаЗапуска)
	
	Результат = Новый Массив;
	
	НужныКавычки = Ложь;
	
	Для Каждого Аргумент Из КомандаЗапуска Цикл
		
		Если Результат.Количество() > 0 Тогда 
			Результат.Добавить(" ");
		КонецЕсли;
		
		НужныКавычки = НеобходимоДобавитьКавычкиКСтрокеКоманды(Аргумент);		
		
		Если НужныКавычки Тогда 
			Результат.Добавить("""");
		КонецЕсли;
		
		АргументСКавычками = СтрЗаменить(Аргумент, """", """""");
		Результат.Добавить(АргументСКавычками);
		
		Если НужныКавычки Тогда 
			Результат.Добавить("""");
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаКоманды = СоединитьСтроку(Результат); 
	
	Возврат СтрокаКоманды;
	
КонецФункции

//&НаКлиенте
Функция НеобходимоДобавитьКавычкиКСтрокеКоманды(СтрокаКоманды)
	
	Результат = Ложь;
	
	Если СтрокаКоманды = Неопределено Тогда
		
		Результат = Истина;
		
	Иначе
		
		СпецСимволы = " &()[]{}^=;!'`+,~$|" + Символы.Таб;
		
		Результат = (ПустаяСтрока(СтрокаКоманды) Или СтрокаСодержитСимволы(СтрокаКоманды, СпецСимволы));
			
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция СтрокаСодержитСимволы(ИсходнаяСтрока, СтрокаСимволов)
	
	Результат = Ложь;
	
	МассивСимволов = РазделитьСтроку(СтрокаСимволов);
	
	Для Каждого Символ Из МассивСимволов Цикл
		
		Результат = Найти(ИсходнаяСтрока, Символ) > 0;
		
		Если Результат Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции

// Удаляет временный файл.
// Если временный файл не может быть удален (например, он занят каким-то процессом),
// то в журнал регистрации записывается соответствующее предупреждение, а процедура завершается.
//
// Для совместного использования с методом ПолучитьИмяВременногоФайла, 
// после окончания работы с временным файлом.
//
// Параметры:
//   Путь - Строка - полный путь к временному файлу.
//
//&НаКлиенте
Процедура УдалитьВременныйФайл(Знач Путь)
	
	Если ЭтоИмяВременногоФайла(Путь) Тогда
		
		ШаблонСтрокиОшибки = НСтр("ru = 'Неверное значение параметра Путь в Модуль_Ядро.УдалитьВременныйФайл:
				       					|Файл не является временным ""%1""'");
										
		СтрокаОшибки = Общее_ПодставитьПараметрыВСтроку(
			ШаблонСтрокиОшибки, 
			Путь);
		
		ВызватьИсключение СтрокаОшибки;
		
	КонецЕсли;
	
	УдалитьВременныеФайлы(Путь);
	
КонецПроцедуры

//&НаКлиенте
Процедура УдалитьВременныеФайлы(Знач Путь)
	
	Попытка
		
		УдалитьФайлы(Путь);
		
	Исключение
		
		ШаблонОшибки 	= НСтр("ru = 'Не удалось удалить временный файл ""%1"" по причине:
								|%2'");
		ОписаниеОшибки 	= ОписаниеОшибки();
		ТекстОшибки 	= Общее_ПодставитьПараметрыВСтроку(ШаблонОшибки, Путь, ОписаниеОшибки);
			
		Ядро.Ошибка_Обработать(ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

//&НаКлиенте
Функция ЭтоИмяВременногоФайла(Путь)
	
	// Ожидается, что Путь получен методом ПолучитьИмяВременногоФайла().
	// Перед проверкой разворачиваем слэши в одну сторону.
	ПутьКФайлу 			= СтрЗаменить(Путь, "/", "\");
	ВременныйКаталог 	= КаталогВременныхФайлов();
	ПутьККаталогу 		= СтрЗаменить(ВременныйКаталог, "/", "\");
	
	ФайлВКаталоге = Найти(ПутьКФайлу, ПутьККаталогу) <> 1;
	
	Возврат ФайлВКаталоге;
	
КонецФункции

//&НаКлиенте
Процедура ПроверитьТекущийКаталог(СтрокаКоманды, ТекущийКаталог)
	
	Если Не ПустаяСтрока(ТекущийКаталог) Тогда 
		
		ФайлИнфо = Новый Файл(ТекущийКаталог);
		
		Если Не ФайлИнфо.Существует() Тогда 
			
			ШаблонТекстаОшибки = НСтр("ru = 'Не удалось запустить программу
				           					|%1
				           					|по причине:
				           					|Не существует каталог, указанный как ТекущийКаталог
				           					|%2'");
											
			ТекстОшибки = Общее_ПодставитьПараметрыВСтроку(
				ШаблонТекстаОшибки,
				СтрокаКоманды,
				ТекущийКаталог);
			
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
		Если Не ФайлИнфо.ЭтоКаталог() Тогда 
			
			ШаблонТекстаОшибки = НСтр("ru = 'Не удалось запустить программу
				           					|%1
				           					|по причине:
				           					|ТекущийКаталог не является каталогом %2'");
											
			ТекстОшибки = Общее_ПодставитьПараметрыВСтроку(
				ШаблонТекстаОшибки,
				СтрокаКоманды,
				ТекущийКаталог);
			
			ВызватьИсключение ТекстОшибки;

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает кодировку стандартных поток вывода и ошибок, используемую в текущей ОС.
//
// Возвращаемое значение:
//  КодировкаТекста - кодировка стандартных потоков вывода и ошибок.
//
//&НаКлиенте
Функция КодировкаСтандартныхПотоков()
	
	Если ЭтоWindowsСервер() Тогда
		Кодировка = КодировкаТекста.OEM;
	Иначе
		Кодировка = КодировкаТекста.Системная;
	КонецЕсли;
	
	Возврат Кодировка;
	
КонецФункции

//&НаКлиенте
Функция ПрочитатьТекстовыйФайлЕслиСуществует(Путь, Кодировка)
	
	Результат = Неопределено;
	
	ФайлИнфо = Новый Файл(Путь);
	
	Если ФайлИнфо.Существует() Тогда 
		
		ЧтениеПотокаОшибок = Новый ЧтениеТекста(Путь, Кодировка);
		Результат = ЧтениеПотокаОшибок.Прочитать();
		ЧтениеПотокаОшибок.Закрыть();
		
	КонецЕсли;
	
	Если Результат = Неопределено Тогда 
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//&НаКлиенте
Функция НовыйФайлЗапускаКомандыWindows(СтрокаКоманды, ТекущийКаталог, ДождатьсяЗавершения, КодировкаИсполнения)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.ДобавитьСтроку("@echo off");
	
	Если ЗначениеЗаполнено(КодировкаИсполнения) Тогда 
		
		Если КодировкаИсполнения = "OEM" Тогда
			КодировкаИсполнения = 437;
		ИначеЕсли КодировкаИсполнения = "CP866" Тогда
			КодировкаИсполнения = 866;
		ИначеЕсли КодировкаИсполнения = "UTF8" Тогда
			КодировкаИсполнения = 65001;
		Иначе
			КодировкаИсполнения = "";
		КонецЕсли;
		                                             
		Если ЗначениеЗаполнено(КодировкаИсполнения) Тогда
			КомандаИзмененияКодировки = "chcp " + Формат(КодировкаИсполнения, "ЧГ=");
			ТекстовыйДокумент.ДобавитьСтроку(КомандаИзмененияКодировки);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекущийКаталог) Тогда 
		КомандаПереходаВКаталог = "cd /D """ + ТекущийКаталог + """";
		ТекстовыйДокумент.ДобавитьСтроку(КомандаПереходаВКаталог);
	КонецЕсли;
	
	КомандаНаИсполнение = "cmd /S /C "" " + СтрокаКоманды + " """;
	ТекстовыйДокумент.ДобавитьСтроку(КомандаНаИсполнение);
	
	Возврат ТекстовыйДокумент;
	
КонецФункции

//}		ФАЙЛОВАЯ СИСТЕМА


//{		Логистика

Ядро = КонтурЛогистика_ИнтеграцияДиадокСерверПовтИсп.Ядро();

//}		Логистика
