#Область ПрограммныйИнтерфейс

// Получить префикс продукта.
// 
// Возвращаемое значение:
//  Строка -  Получить префикс продукта
Функция ПолучитьПрефиксПродукта() Экспорт
	Возврат "КонтурЗакупки";
КонецФункции

// Получить название продукта.
// 
// Возвращаемое значение:
//  Строка -  Получить название продукта
Функция ПолучитьНазваниеПродукта() Экспорт
	Возврат "Zakupki";
КонецФункции

// Получить ключ расширения.
// 
// Возвращаемое значение:
//  Строка -  Получить ключ расширения
Функция ПолучитьКлючРасширения() Экспорт
	Возврат "КонтурЗакупки";
КонецФункции

// Получить версию продукта.
// 
// Возвращаемое значение:
//  Строка - Версия
Функция ПолучитьВерсиюПродукта() Экспорт
	//XXX изменить версию при обновлении
	Версия = "1.0.1.19";
	КлючРасширения = ПолучитьКлючРасширения();
	Если Не КонтурЗакупки_СлужебныеВызовСервера.ПодсистемаЭтоРасширение(КлючРасширения) Тогда
		СтруктураВерсия = КонтурЗакупки_ОбновлениеВызовСервера.ПолучитьТекущуюВерсиюРасширения(КлючРасширения);
		Версия = СтруктураВерсия.Версия;
	КонецЕсли;
	Возврат Версия;
КонецФункции

// Получить параметры HTTPЗапроса.
// 
// Возвращаемое значение:
//  см. КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьСтруктуруПараметровHTTPЗапроса
Функция ПолучитьПараметрыHTTPЗапроса() Экспорт

	ПараметрыHTTPЗапроса	= КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьСтруктуруПараметровHTTPЗапроса();

	ПараметрыHTTPЗапроса.Вставить("АдресСервера", "api-zakupki.kontur.ru");
	ПараметрыHTTPЗапроса.Вставить("ПортСервера", 443);
	ПараметрыHTTPЗапроса.Вставить("ЗащищенноеСоединение", Истина);

	Возврат ПараметрыHTTPЗапроса;

КонецФункции

// Получить client name.
// 
// Возвращаемое значение:
//  Строка -  Получить client name
Функция ПолучитьClientName() Экспорт
	Возврат "Client";
КонецФункции

// Получить client ID.
// 
// Возвращаемое значение:
//  Строка - Получить client ID
Функция ПолучитьClientID() Экспорт
	ИдентификаторКлиента = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ClientID", "");
	Если ПустаяСтрока(ИдентификаторКлиента) Тогда
		ИдентификаторКлиента = Строка(Новый УникальныйИдентификатор);
		КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("ClientID", ИдентификаторКлиента);
	КонецЕсли;

	Возврат ИдентификаторКлиента;
КонецФункции

// Получить структуру клиента для метрики
// 
// Возвращаемое значение:
//  Структура - Получить структуру клиента:
// * ClientID - Строка - Идентификатор клиента
// * ClientName - Строка - Имя клиента
// * ClientVersion - Строка - Версия клиента
// * moduleName - Строка - Наименование модкля
Функция ПолучитьСтруктуруКлиентаДляМетрики() Экспорт

	КлючРасширения = ПолучитьКлючРасширения();

	СтруктураКлиента = Новый Структура;
	СтруктураКлиента.Вставить("ClientID", ПолучитьClientID());
	СтруктураКлиента.Вставить("ClientName", ПолучитьClientName());
	СтруктураКлиента.Вставить("ClientVersion", КонтурЗакупки_СлужебныеВызовСервера.НомерВерсииРасширения(
		КлючРасширения));
	СтруктураКлиента.Вставить("moduleName", ПолучитьНазваниеПродукта());

	Возврат СтруктураКлиента;

КонецФункции

#КонецОбласти