#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формат обмена не менее v3.
// 
// Параметры:
//  ФорматОбмена  - ПеречислениеСсылка.ФорматыОбменаЕГАИС - Формат обмена
// 
// Возвращаемое значение:
//  Булево - Формат обмена не менее v3
Функция ФорматОбменаНеМенееV3(ФорматОбмена) Экспорт
	
	Если ЗначениеЗаполнено(ФорматОбмена)
		И ФорматОбмена <> V1
		И ФорматОбмена <> V2 Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Формат обмена не менее v4.
// 
// Параметры:
//  ФорматОбмена  - ПеречислениеСсылка.ФорматыОбменаЕГАИС - Формат обмена
// 
// Возвращаемое значение:
//  Булево - Формат обмена не менее v4
Функция ФорматОбменаНеМенееV4(ФорматОбмена) Экспорт
	
	Если ЗначениеЗаполнено(ФорматОбмена)
		И ФорматОбмена <> V1
		И ФорматОбмена <> V2
		И ФорматОбмена <> V3 Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецЕсли