&НаКлиенте
Процедура ВыбратьСертификат(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		 "ОбщаяФорма.КонтурЛогистика_ВыборСертификата",
		 ,
		 ЭтаФорма,
		 ЭтаФорма,
		 "ОбработчикВыборСертификата");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыборСертификата(ДанныеСертификата, ДопПараметры = Неопределено) Экспорт

	Если ДанныеСертификата <> Неопределено Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Справочник.КонтурЛогистика_СертификатыЭлектроннойПодписи.Форма.ФормаЭлемента",
			ДанныеСертификата,
			ЭтаФорма,
			ЭтаФорма);
		
	КонецЕсли;
		
КонецПроцедуры	 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборПериод = "Все";
	УстановитьОтбор();
	
	УстановитьПараметрДинамическогоСписка(ЭтаФорма.Список, "ТекДата", ТекущаяДатаСеанса(), Истина);
	КонтурЛогистика_ОнбордингСервер.ПриСозданииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	ПодключитьОбработчикОжидания("ОткрытьОнбординг", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОнбординг()
	
	КонтурЛогистика_ОнбордингКлиент.ПриОткрытииФормы(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Процедура УстановитьПараметрДинамическогоСписка(Список, ИмяПараметра, Значение, Использование = Истина) Экспорт
	
	ЗначениеПараметраКомпоновкиДанных = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	Если ЗначениеПараметраКомпоновкиДанных <> Неопределено Тогда
		Если Использование И ЗначениеПараметраКомпоновкиДанных.Значение <> Значение Тогда
			ЗначениеПараметраКомпоновкиДанных.Значение = Значение;
		КонецЕсли;
		Если ЗначениеПараметраКомпоновкиДанных.Использование <> Использование Тогда
			ЗначениеПараметраКомпоновкиДанных.Использование = Использование;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	
	Список.Отбор.Элементы.Очистить();
		
	Если ОтборПериод = "Действующие" Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СрокДействия",
			ТекущаяДатаСеанса(), ВидСравненияКомпоновкиДанных.Больше, , Истина);
			
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления",
			Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры