Функция ОбщиеРеквизитыСотрудникаИФизЛица() Экспорт
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Фамилия");
	Реквизиты.Вставить("Имя");
	Реквизиты.Вставить("Отчество");
	Реквизиты.Вставить("ДатаРождения");
	Реквизиты.Вставить("ИНН");
	Реквизиты.Вставить("СНИЛС");
	Реквизиты.Вставить("ТелефонОсновной");
	Реквизиты.Вставить("АдресЭлектроннойПочты");
	Реквизиты.Вставить("ВУДатаВыдачи");
	Реквизиты.Вставить("ВУНомер");
	Реквизиты.Вставить("ВУСерия");
	
	Возврат Реквизиты;
	
КонецФункции

Функция ТелефонВалидный(Знач НомерТелефона) Экспорт
	
	НомерТелефона = СокрЛП(НомерТелефона);
	
	Если Лев(НомерТелефона, 2) <> "+7" И Лев(НомерТелефона, 1) <> "7" И Лев(НомерТелефона, 1) <> "8" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрДлина(НомерТелефона) = 11 
		И (Лев(НомерТелефона, 1) = "7" Или Лев(НомерТелефона, 1) = "8")
		И КонтурЛогистика_СтдСтрКлиентСервер.ТолькоЦифрыВСтрокеЛок(НомерТелефона) Тогда
		Возврат Истина;
	ИначеЕсли СтрДлина(НомерТелефона) = 12 
		И Лев(НомерТелефона, 1) = "+"
		И Сред(НомерТелефона, 2, 1) = "7"
		И КонтурЛогистика_СтдСтрКлиентСервер.ТолькоЦифрыВСтрокеЛок(Прав(НомерТелефона, 11)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции