
#Область ПрограммныйИнтерфейс

Функция ФильтрОтбораУведомлений() Экспорт
	
	ИННИРолиНашихОрганизаций = Справочники.КонтурЛогистика_ОрганизацииДиадок.ИННИРолиНашихОрганизаций();
	
	Фильтр = Новый Структура;
	
	// Обязательные
	//   Идентификатор базы 1С
	Фильтр.Вставить("client_id", Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("СлужебныйИдентификаторБазыДанных"));
	//   Версия модуля
	Фильтр.Вставить("version", КонтурЛогистика_ОбновлениеВерсииМодуля.ТекущаяВерсияПодсистемыКонтурЛогистика());
	
	// Не обязательные
	//   Версия конфигурации
	Фильтр.Вставить("conf_version", Метаданные.Версия);
	//   Имя конфигурации
	Фильтр.Вставить("conf_name", Метаданные.Имя);
	//   Версия платформы
	ИнформацияОСистеме = Новый СистемнаяИнформация;
	Фильтр.Вставить("platform_version", ИнформацияОСистеме.ВерсияПриложения);
	
	// Только Логистика
	//   ИНН
	ИНННаши = ИННИРолиНашихОрганизаций.ВыгрузитьКолонку("ИНН");
	Если ЗначениеЗаполнено(ИНННаши) Тогда
		Фильтр.Вставить("inn", ИНННаши);
	КонецЕсли;
	
	//   Роль
	РолиНаши = Новый Массив;
	Для Каждого ТекущаяСтрока Из ИННИРолиНашихОрганизаций Цикл
		Если ТекущаяСтрока.Грузоотправитель Тогда
			РолиНаши.Добавить("Грузоотправитель");
		КонецЕсли;
		Если ТекущаяСтрока.Перевозчик Тогда
			РолиНаши.Добавить("Перевозчик");
		КонецЕсли;
		Если ТекущаяСтрока.Грузополучатель Тогда
			РолиНаши.Добавить("Грузополучатель");
		КонецЕсли;
		Если ТекущаяСтрока.Медик Тогда
			РолиНаши.Добавить("Медик");
		КонецЕсли;
		Если ТекущаяСтрока.ТехОсмотр Тогда
			РолиНаши.Добавить("Техник");
		КонецЕсли;
	КонецЦикла;
	РолиНаши = КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.СвернутьМассивЛок(РолиНаши);
	Если ЗначениеЗаполнено(РолиНаши) Тогда
		Фильтр.Вставить("role", РолиНаши);
	КонецЕсли;
	
	//   Тип документа
	ТипыДокументов = Новый Массив;
	Если Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользуетсяТРН") Тогда
		ТипыДокументов.Добавить("ЭТрН");
	КонецЕсли;
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ИспользуетсяПутевойЛист() Тогда
		ТипыДокументов.Добавить("ЭПЛ");
	КонецЕсли;
	Если Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользуетсяЗаказЗаявка") Тогда
		ТипыДокументов.Добавить("Заказ-заявка");
	КонецЕсли;
	Если Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользуетсяЭкспедиторскаяРасписка") Тогда
		ТипыДокументов.Добавить("Экспедиторские расписки");
	КонецЕсли;
	Если Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользуетсяЗаказНаряд") Тогда
		ТипыДокументов.Добавить("Заказ-наряды");
	КонецЕсли;
	Если ЗначениеЗаполнено(ТипыДокументов) Тогда
		Фильтр.Вставить("type_document", ТипыДокументов);
	КонецЕсли;
	
	//   Поставка
	Поставка = ?(КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодсистемаКакРасширение(), "Расширение", "Подсистема");
	Фильтр.Вставить("delivery", Поставка);
	
	Возврат Фильтр;
	
КонецФункции

Функция ТребуетсяОбновление_НоваяВерсияУАТ_QR_МП_УАТ() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяКонфигурации1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	Если НЕ (ИмяКонфигурации1С = "УАТ_ПРОФ"
			 ИЛИ ИмяКонфигурации1С = "ТЛЭ"
			 ИЛИ ИмяКонфигурации1С = "ERP_УАТ") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ОтборРасширения = Новый Структура;
	ОтборРасширения.Вставить("Имя", "РасширениеКонтурЛогистика_QR_МП_УАТ_33");
		
	НайденныеРасширения = РасширенияКонфигурации.Получить(ОтборРасширения);
	
	Если НайденныеРасширения.Количество() > 0 Тогда
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПередаватьQRВМПВодительУАТ") Тогда
			
			Возврат НоваяВерсияУАТ_QR_МП_УАТ(ИмяКонфигурации1С);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция НоваяВерсияУАТ_QR_МП_УАТ(ИмяКонфигурации1С) Экспорт
	
	ВерсияКонфигурации	= Метаданные.Версия;
	Если ИмяКонфигурации1С = "УАТ_ПРОФ"
		И Лев(ВерсияКонфигурации, 3) = "2.2" И Сред(ВерсияКонфигурации, 5, 2) > "33" Тогда
		Возврат Истина;
	ИначеЕсли ИмяКонфигурации1С = "ТЛЭ"
		И Лев(ВерсияКонфигурации, 3) = "1.1" И Сред(ВерсияКонфигурации, 5, 2) > "33" Тогда
		Возврат Истина;
	ИначеЕсли ИмяКонфигурации1С = "ERP_УАТ" Тогда
		
		ОбщийМодуль_уатОбновлениеИнформационнойБазы = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("уатОбновлениеИнформационнойБазы");
		
		Если ОбщийМодуль_уатОбновлениеИнформационнойБазы <> Неопределено Тогда
			
			ОписаниеПодсистемыУАТ = Новый Структура("Имя, Версия, РежимВыполненияОтложенныхОбработчиков,
				|ИдентификаторИнтернетПоддержки, ТребуемыеПодсистемы", "", "", "", "", Новый Массив);
			ОбщийМодуль_уатОбновлениеИнформационнойБазы.ПриДобавленииПодсистемы(ОписаниеПодсистемыУАТ);
			ВерсияКонфигурации = ОписаниеПодсистемыУАТ.Версия;		
			Если Лев(ВерсияКонфигурации, 3) = "2.5" И Сред(ВерсияКонфигурации, 5, 2) > "18" Тогда
				Возврат Истина;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СтараяВерсияУАТ_QR_МП_УАТ(ИмяКонфигурации1С) Экспорт
	
	ВерсияКонфигурации	= Метаданные.Версия;
	Если ИмяКонфигурации1С = "УАТ_ПРОФ"
		И Лев(ВерсияКонфигурации, 3) = "2.2" И Сред(ВерсияКонфигурации, 5, 2) > "32" Тогда
		Возврат Ложь;
	ИначеЕсли ИмяКонфигурации1С = "ТЛЭ"
		И Лев(ВерсияКонфигурации, 3) = "1.1" И Сред(ВерсияКонфигурации, 5, 2) > "32" Тогда
		Возврат Ложь;
	ИначеЕсли ИмяКонфигурации1С = "ERP_УАТ" Тогда
		
		ОбщийМодуль_уатОбновлениеИнформационнойБазы = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("уатОбновлениеИнформационнойБазы");
		
		Если ОбщийМодуль_уатОбновлениеИнформационнойБазы <> Неопределено Тогда
			
			ОписаниеПодсистемыУАТ = Новый Структура("Имя, Версия, РежимВыполненияОтложенныхОбработчиков,
				|ИдентификаторИнтернетПоддержки, ТребуемыеПодсистемы", "", "", "", "", Новый Массив);
			ОбщийМодуль_уатОбновлениеИнформационнойБазы.ПриДобавленииПодсистемы(ОписаниеПодсистемыУАТ);
			ВерсияКонфигурации = ОписаниеПодсистемыУАТ.Версия;		
			Если Лев(ВерсияКонфигурации, 3) = "2.5" И Сред(ВерсияКонфигурации, 5, 2) > "17" Тогда
				Возврат Ложь;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти