#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьОписаниеКлючейПоиска() Экспорт
	
	// Поиск договора осуществляется по:
	// 1. Организация + Контрагент + Номер договора + Дата договора
	// 2. Организация + Номер договора + Дата договора
	// 3. Организация + Идентификатор файла документа
	
	ШаблонСтрокиПоиска = " И КонтурЛогистика_Справочник.%1 = &%1";
	
	КлючиПоиска = Новый Массив;
	
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска,
		"Организация,Контрагент,НомерДокумента,ДатаДокумента", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска,
		"Организация,НомерДокумента,ДатаДокумента", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска,
		"Организация,ИдДок", ШаблонСтрокиПоиска);
	
	Возврат КлючиПоиска;
	
КонецФункции

Функция ТекстОшибкиНеЗаполненыКлючевыеРеквизиты() Экспорт
	
	ТекстОшибки = "Ошибка при поиске Договора. Не заполнен один из ключевых реквизитов:
		|1. Организация + Контрагент + Номер договора + Дата договора
		|2. Организация + Номер договора + Дата договора
		|3. Организация + Идентификатор файла документа";
	
	Возврат ТекстОшибки;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Найти(Данные.Наименование, Данные.НомерДокумента) > 0 Тогда
		Представление = СокрЛП(Данные.Наименование);
	Иначе
		Представление = СокрЛП(Данные.Наименование) + " №" + Данные.НомерДокумента + " от " + Формат(Данные.ДатаДокумента, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Определяем состав необходмых полей
	Поля.Добавить("НомерДокумента");
	Поля.Добавить("ДатаДокумента");
	Поля.Добавить("Наименование");
	
КонецПроцедуры

Функция НайтиДоговорПоНомерДатаКонтрагентИНН(НомерДокумента, ДатаДокумента, КонтрагентИНН = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерДокумента", НомерДокумента);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("КонтрагентИНН", КонтрагентИНН);
	Запрос.УстановитьПараметр("ЗаполненКонтрагентИНН", ЗначениеЗаполнено(КонтрагентИНН));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_Договоры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_Договоры КАК КонтурЛогистика_Договоры
	|ГДЕ
	|	НЕ КонтурЛогистика_Договоры.ПометкаУдаления
	|	И КонтурЛогистика_Договоры.НомерДокумента = &НомерДокумента
	|	И КонтурЛогистика_Договоры.ДатаДокумента = &ДатаДокумента
	|	И ВЫБОР
	|			КОГДА &ЗаполненКонтрагентИНН
	|				ТОГДА КонтурЛогистика_Договоры.КонтрагентИНН = &КонтрагентИНН
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
