#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОбщиеКоманды.ОбменСLamoda");
	
	ОчиститьСообщения();
	
	ПараметрыФормы = ИнтеграцияСМаркетплейсамиСИКлиент.НовыеПараметрыФормыСервисаМаркетплейсы();
	ПараметрыФормы.ИмяФормы = "Обработка.УправлениеПродажамиНаМаркетплейсах.Форма.ВыгрузкаТоварногоКаталога";
	ПараметрыФормы.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсLamoda");
	ПараметрыФормы.РежимОткрытияОкнаФормы = РежимОткрытияОкнаФормы.Независимый;
	
	ИнтеграцияСМаркетплейсамиСИКлиент.ОткрытьФормуСервисаМаркетплейсы(ПараметрыФормы);
КонецПроцедуры

#КонецОбласти