#Область ПрограммныйИнтерфейс

Процедура ПриЗакрытииФормыПроверкиИПодбораВФормеРМК(Форма, Результат) Экспорт
	
	РезультатПроверки = ПолучитьИзВременногоХранилища(Результат);
	ДеревоМаркируемойПродукции = РезультатПроверки.ДеревоМаркируемойПродукции;
	
	Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК" Тогда
		
		ПараметрыЗаполнения = АкцизныеМаркиЕГАИС.ПараметрыЗаполненияТоваровИАкцизныхМарок(Форма, Ложь);
		ПараметрыЗаполнения.ЕстьКоличествоАкцизныхМарок    = Ложь;
		ПараметрыЗаполнения.ЕстьСправка2                   = Ложь;
		ПараметрыЗаполнения.ПараметрыУказанияСерий         = Форма.ПараметрыУказанияСерий;
		ПараметрыЗаполнения.ИмяКолонкиАлкогольнаяПродукция = "НоменклатураЕГАИС";
		
		Менеджер = ОбщегоНазначенияИС.МенеджерОбъектаПоПолномуИмени(Форма.ИмяФормы);
		Менеджер.ЗаполнитьТоварыИАкцизныеМаркиПриЗакрытииФормыПроверкиИПодбора(Форма.Объект, ДеревоМаркируемойПродукции, ПараметрыЗаполнения);
		
		Форма.ОбработатьСтрокиТЧ(
			ПараметрыЗаполнения.ДобавленныеСтроки,
			ПараметрыЗаполнения.ИзмененныеСтроки);
		
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Форма.Объект,НоменклатураСервер.ПараметрыУказанияСерий(Форма.Объект, Документы.ЧекККМ));
	
	Иначе
		
		ДобавитьМаркиИзДереваВЧекВозврата(Форма, ДеревоМаркируемойПродукции);
		
	КонецЕсли;
	
	ПроверкаИПодборПродукцииИС.ЗаполнитьКешШтрихкодовУпаковок(Форма, ПроверкаИПодборПродукцииИСМПУТ.НастройкиИсточникаКешаЧека());
	ПроверкаИПодборПродукцииИС.ПрименитьКешШтрихкодовУпаковок(Форма, ПроверкаИПодборПродукцииИСМПУТ.НастройкиИсточникаКешаЧека());
	ШтрихкодированиеИС.ОбновитьКэшМаркируемойПродукции(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьМаркиИзДереваВЧекВозврата(Форма, ДеревоМаркируемойПродукции)
	
	Для Каждого ДанныеМарки Из ДеревоМаркируемойПродукции.Строки Цикл
		Если ДанныеМарки.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар Тогда
			НоваяСтрокаМарка = Форма.Объект.АкцизныеМарки.Добавить();
			НоваяСтрокаМарка.АкцизнаяМарка = ДанныеМарки.ШтрихкодУпаковки;
			НоваяСтрокаМарка.Справка2 = ДанныеМарки.Справка2;
		Иначе
			ДобавитьМаркиИзДереваВЧекВозврата(Форма, ДанныеМарки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти