// @strict-types
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновить счетчики.
// 
// Параметры:
//  СтруктураСчетчики - Структура - Счетчики
//  Пользователь - СправочникСсылка.Пользователи - Пользователь
//  РольПользователя - ОбъектМетаданныхРоль - Роль пользователя
Процедура ОбновитьСчетчики(Знач СтруктураСчетчики, Знач Пользователь, Знач РольПользователя) Экспорт

	СтруктураСчетчики.Вставить("СчетчикЗадачОбработкаЗакупок", ПолучитьСчетчикОбработкиЗакупок(Пользователь,
		РольПользователя));
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить счетчики обработки закупок.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь
//  РольПользователя - ОбъектМетаданныхРоль - Роль пользователя
// 
// Возвращаемое значение:
//  Строка -  Получить счетчики обработки закупок
Функция ПолучитьСчетчикОбработкиЗакупок(Пользователь, РольПользователя)
	ПредставлениеКоличества = "-";
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(КонтурЗакупки_ОбработкаЗакупки.Ссылка) КАК КоличествоФильтр,
	|	0 как КоличествоВсего
	|ПОМЕСТИТЬ ВТ_СчетчикДокументов
	|ИЗ
	|	Документ.КонтурЗакупки_ОбработкаЗакупки КАК КонтурЗакупки_ОбработкаЗакупки
	|ГДЕ
	|	НЕ КонтурЗакупки_ОбработкаЗакупки.ПометкаУдаления
	|	И КонтурЗакупки_ОбработкаЗакупки.СтатусОбработкиЗакупки В (&МассивСтатусов)
	|	И КонтурЗакупки_ОбработкаЗакупки.Пользователь = &Пользователь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	КОЛИЧЕСТВО(КонтурЗакупки_ОбработкаЗакупки.Ссылка)
	|ИЗ
	|	Документ.КонтурЗакупки_ОбработкаЗакупки КАК КонтурЗакупки_ОбработкаЗакупки
	|ГДЕ
	|	НЕ КонтурЗакупки_ОбработкаЗакупки.ПометкаУдаления
	|	И КонтурЗакупки_ОбработкаЗакупки.СтатусОбработкиЗакупки В (&МассивСтатусов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_СчетчикДокументов.КоличествоФильтр) КАК КоличествоФильтр,
	|	СУММА(ВТ_СчетчикДокументов.КоличествоВсего) КАК КоличествоВсего
	|ИЗ
	|	ВТ_СчетчикДокументов КАК ВТ_СчетчикДокументов";

	МассивСтатусов = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.ПолучитьМассивСтатусовОбработкиПоРоли(
		РольПользователя);

	Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//@skip-check property-return-type
		ПредставлениеКоличества = Строка(Выборка.КоличествоФильтр) + "/" + Строка(Выборка.КоличествоВсего);
	КонецЕсли;

	Возврат ПредставлениеКоличества
КонецФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли