
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ЛимитыБДР

// Цель закупки, заполняемая при отключенной функциональной опции лимитов БДР.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ЦелиЗакупки - Цель закупки по умолчанию
Функция ЦельЗакупкиПоУмолчанию() Экспорт
	Возврат ПредопределенноеЗначение("Перечисление.ЦелиЗакупки.ОсновнаяДеятельность");
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПакетнаяОбработкаТабличнойЧасти

// Формирует структуру действий для обработки табличной части при изменении количества упаковок.
// 
// Параметры:
//  ЦенаВключаетНДС - Булево - Одноименный реквизит объекта.
// 
// Возвращаемое значение:
//  Структура - Действия при изменении количества:
// * ПересчитатьКоличествоЕдиниц - Неопределено - Свойство, подключающее действие пересчета упаковок в единицы.
//
// * ПересчитатьСумму - Неопределено - Свойство, подключающее действие пересчета суммы.
// * ПересчитатьСуммуНДС - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ.
// * ПересчитатьСуммуСНДС - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ.
Функция ДействияПриИзмененииКоличества(ЦенаВключаетНДС) Экспорт
	
	Действия = Новый Структура;
	Действия.Вставить("ПересчитатьКоличествоЕдиниц", Неопределено);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияПересчетаСуммы(ЦенаВключаетНДС), Истина);
	
	//@skip-check constructor-function-return-section -- При дополнении структуры не распознаются свойства.
	Возврат Действия;
	
КонецФункции

// Формирует структуру действий для заполнения вида цены и зависимых свойств.
// 
// Параметры:
//  Объект -  
//  - ДанныеФормыСтруктура:
//  	* Дата - Дата
//  	* Организация - СправочникСсылка.Организации
//  	* ЦенаВключаетНДС - Булево
//  	* Валюта - СправочникСсылка.Валюты
//  - ДокументОбъект.ЗаявкаНаЗакупку 
// 
// Возвращаемое значение:
//  Структура - Действия заполнения цены:
// * ЗаполнитьУсловияЗакупок - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ.
//
// * ПересчитатьСумму - Неопределено - Свойство, подключающее действие пересчета суммы.
// * ПересчитатьСуммуНДС - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ.
// * ПересчитатьСуммуСНДС - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ.
Функция ДействияЗаполненияВидаЦены(Объект) Экспорт

	Действия = Новый Структура;
	
	ПараметрыЗаполнения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект);
	ПараметрыЗаполнения.ИспользоватьСоглашениеИзТаблицы = Истина;
	ПараметрыЗаполнения.ЦенаВключаетНДС = Объект.ЦенаВключаетНДС;
	Действия.Вставить("ЗаполнитьУсловияЗакупок", ПараметрыЗаполнения);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС), Истина);
	
	//@skip-check constructor-function-return-section -- При дополнении структуры не распознаются свойства.
	Возврат Действия;
		
КонецФункции

// Формирует структуру действий для заполнения цены и зависимых свойств.
// 
// Параметры:
//  Объект -  
//  - ДанныеФормыСтруктура:
//  	* Дата - Дата
//  	* Организация - СправочникСсылка.Организации
//  	* ЦенаВключаетНДС - Булево
//  	* Валюта - СправочникСсылка.Валюты
//  - ДокументОбъект.ЗаявкаНаЗакупку
// 
// Возвращаемое значение:
//  Структура - Действия заполнения цены:
// * ЗаполнитьЦенуЗакупки - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ.
//
// * ПересчитатьСумму - Неопределено - Свойство, подключающее действие пересчета суммы.
// * ПересчитатьСуммуНДС - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ.
// * ПересчитатьСуммуСНДС - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ.
Функция ДействияЗаполненияЦены(Объект) Экспорт

	Действия = Новый Структура;
	
	ПараметрыЗаполнения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект);
	ПараметрыЗаполнения.ИспользоватьСоглашениеИзТаблицы = Истина;
	ПараметрыЗаполнения.ЦенаВключаетНДС = Объект.ЦенаВключаетНДС;
	Действия.Вставить("ЗаполнитьЦенуЗакупки", ПараметрыЗаполнения);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС), Истина);
	
	//@skip-check constructor-function-return-section -- При дополнении структуры не распознаются свойства.
	Возврат Действия;
	
КонецФункции

// Формирует структуру с действиями для заполнения налогообложения НДС на основе хозяйственной операции.
// Пересчитывает ставку и сумму НДС.
//
// Параметры:
//  Объект -  
//  - ДанныеФормыСтруктура:
//  	* Дата - Дата
//  	* Ссылка - ДокументСсылка.ЗаявкаНаЗакупку
//  	* Организация - СправочникСсылка.Организации
//  	* ЦенаВключаетНДС - Булево
//   УказаннаяСтавкаНДС - См. ДействияЗаполненияСтавкиНДС.УказаннаяСтавкаНДС
//
// Возвращаемое значение:
//   Структура:
//   * ЗаполнитьНалогообложениеНДСЗакупки - см. УчетНДСУПКлиентСервер.ПараметрыЗаполненияНалогообложенияНДСЗакупки
Функция ДействияЗаполненияНалогообложенияНДС(Объект, УказаннаяСтавкаНДС = Неопределено) Экспорт
	
	Действия = Новый Структура;
	
	// Налогообложение НДС рассчитывается по хоз. операции. Реквизит отсутствует в заявке на закупку,
	//    Поэтому сначала рассчитывается реквизит формы, а затем заполняется налогообложение.
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияЗаполненияХозяйственнойОперации());
	
	ПараметрыЗаполнения = УчетНДСУПКлиентСервер.ПараметрыПакетногоЗаполненияНалогообложенияНДСЗакупки();
	ПараметрыЗаполнения.Дата = Объект.Дата;
	ПараметрыЗаполнения.Документ = Объект.Ссылка;
	Действия.Вставить("ЗаполнитьНалогообложениеНДСЗакупки", ПараметрыЗаполнения);
	
	// Пересчет суммы НДС при изменении ставки.
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
		Действия,
		ДействияКорректировкиСтавкиНДС(Объект, УказаннаяСтавкаНДС),
		Истина);
	
	Возврат Действия;
	
КонецФункции

// Формирует структуру действий для заполнения реквизита формы "ХозяйственнаяОперация" табличной части. 
//
// Возвращаемое значение:
//   Структура:
//    * ЗаполнитьОперациюПоСоглашениюДоговору - См. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияОперацииПоСоглашениюДоговору.
Функция ДействияЗаполненияХозяйственнойОперации() Экспорт
	
	Действия = Новый Структура;
	
	ПараметрыЗаполнения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияОперацииПоСоглашениюДоговору();
	ПараметрыЗаполнения.ЗначениеПоУмолчанию = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика");
	Действия.Вставить("ЗаполнитьОперациюПоСоглашениюДоговору", ПараметрыЗаполнения);
	
	Возврат Действия;
	
КонецФункции

// Формирует структуру действий для ставки НДС и зависимых свойств.
// 
// Параметры:
//  Объект -  
//  - ДанныеФормыСтруктура:
//  	* Дата - Дата
//  	* Организация - СправочникСсылка.Организации
//  	* ЦенаВключаетНДС - Булево
//  - ДокументОбъект.ЗаявкаНаЗакупку
//  УказаннаяСтавкаНДС - Неопределено, СправочникСсылка.СтавкиНДС - Ставка НДС, указанная в документе
//
// Возвращаемое значение:
//  Структура - Действия заполнения цены:
// * ЗаполнитьСтавкуНДС - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС.
//
// * ПересчитатьСумму - Неопределено - Свойство, подключающее действие пересчета суммы.
// * ПересчитатьСуммуНДС - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ.
// * ПересчитатьСуммуСНДС - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ.
Функция ДействияЗаполненияСтавкиНДС(Объект, УказаннаяСтавкаНДС = Неопределено) Экспорт
	
	Действия = Новый Структура;
	
	ПараметрыЗаполнения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект);
	ПараметрыЗаполнения.УказаннаяСтавкаНДС = УказаннаяСтавкаНДС;
	ПараметрыЗаполнения.НалогообложениеНДСВТабличнойЧасти = Истина;
	Действия.Вставить("ЗаполнитьСтавкуНДС", ПараметрыЗаполнения);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия, ДействияПересчетаСуммы(Объект.ЦенаВключаетНДС, Ложь), Истина);
	
	//@skip-check constructor-function-return-section -- При дополнении структуры не распознаются свойства.
	Возврат Действия;
	
КонецФункции

// Формирует структуру действий для ставки НДС и зависимых свойств.
// 
// Параметры:
//  Объект -  
//  - ДанныеФормыСтруктура:
//  	* Дата - Дата
//  	* Организация - СправочникСсылка.Организации
//  	* ЦенаВключаетНДС - Булево
//  - ДокументОбъект.ЗаявкаНаЗакупку
//	УказаннаяСтавкаНДС - Неопределено, СправочникСсылка.СтавкиНДС - Ставка НДС, указанная в документе
// Возвращаемое значение:
//  Структура - Действия заполнения цены:
// * СкорректироватьСтавкуНДС - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС.
Функция ДействияКорректировкиСтавкиНДС(Объект, УказаннаяСтавкаНДС = Неопределено) Экспорт
	
	Действия = Новый Структура;
	
	ПараметрыЗаполнения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект);
	ПараметрыЗаполнения.УказаннаяСтавкаНДС = УказаннаяСтавкаНДС;
	ПараметрыЗаполнения.НалогообложениеНДСВТабличнойЧасти = Истина;
	ПараметрыЗаполнения.ИнициализацияВходящегоДокумента = Истина;
	Действия.Вставить("СкорректироватьСтавкуНДС", ПараметрыЗаполнения);
	
	Возврат Действия;
	
КонецФункции

// Формирует структуру действий для обработки табличной части для расчета сумм
// 
// Параметры:
//  ЦенаВключаетНДС - Булево - Одноименный реквизит объекта.
//  ПересчитатьСумму - Булево - Включает / отключает расчет суммы. Указывается "Ложь", например, в случаях:
//		а) Изменяется сумма и необходимо рассчитать НДС и сумму с НДС.
//		б) Корректируется НДС.
//  ПересчитатьСуммуНДС - Булево - Включает / отключает расчет НДС. Указывается "Ложь", если корректируется сумма НДС.
// 
// Возвращаемое значение:
//  Структура - Действия пересчета суммы:
// * ПересчитатьСумму - Неопределено - Свойство, подключающее действие пересчета суммы.
// * ПересчитатьСуммуНДС - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ
// * ПересчитатьСуммуСНДС - см. ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ
Функция ДействияПересчетаСуммы(ЦенаВключаетНДС, ПересчитатьСумму = Истина, ПересчитатьСуммуНДС = Истина) Экспорт
	
	ИмитацияОбъекта = Новый Структура;
	ИмитацияОбъекта.Вставить("ЦенаВключаетНДС", ЦенаВключаетНДС);
	ПараметрыПересчета = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ИмитацияОбъекта);
	
	Действия = Новый Структура;
	Если ПересчитатьСумму Тогда
		Действия.Вставить("ПересчитатьСумму", Неопределено);
	КонецЕсли;
	
	Если ПересчитатьСуммуНДС Тогда
		Действия.Вставить("ПересчитатьСуммуНДС", ПараметрыПересчета);
	КонецЕсли;
	
	Действия.Вставить("ПересчитатьСуммуСНДС", ПараметрыПересчета);
	
	Возврат Действия;
	
КонецФункции

#КонецОбласти

#КонецОбласти