&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;		
#КонецЕсли

#Область ОбработчикиФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Устанавливаем период по умолчанию в 1 день (со вчерашнего по сегодняшний)
	НачалоПериода 	= НачалоДня(НачалоДня(ТекущаяДата()) - 1);
	КонецПериода	= НачалоПериода + 86400;

	// Загружаем доступные типы документов Клеверенс
	Для Каждого ДанныеДокумента Из _ЛокКонтекст.СтруктураМетаданных.ДокументыMS Цикл
		Элементы.Тип.СписокВыбора.Добавить(ДанныеДокумента.Ключ, ДанныеДокумента.Значение.Синоним);
	КонецЦикла;
	Элементы.Тип.СписокВыбора.СортироватьПоПредставлению();
	
	// Загружаем доступные типы документов 1С
	Для Каждого ДанныеДокумента Из _ЛокКонтекст.СтруктураМетаданных.Документы1С Цикл
		Элементы.ИмяДокумента.СписокВыбора.Добавить(ДанныеДокумента.Ключ, ДанныеДокумента.Значение.Синоним);		
	КонецЦикла;
	Элементы.ИмяДокумента.СписокВыбора.СортироватьПоПредставлению();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	УстановкаСнятиеФлагаЗагрузкиВсехДокументовMS(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	УстановкаСнятиеФлагаЗагрузкиВсехДокументовMS(Истина);

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМеханизмы

&НаКлиенте
Процедура УстановкаСнятиеФлагаЗагрузкиВсехДокументовMS(ЗначениеФлага)
	
	Для Каждого СтрокаДокумента Из ДокументыMS Цикл		
		Если СтрокаДокумента.Загружать = ЗначениеФлага Тогда
			Продолжить;	
		КонецЕсли;
		СтрокаДокумента.Загружать = ЗначениеФлага;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДокументы(Команда)

	Если (НачалоПериода > КонецПериода) Тогда
		Сообщение = НСтр("be = 'Уведзены некарэктны перыяд адбору'; en = 'Incorrect selection period entered!'; es = '¡Se ha ingresado un período de selección incorrecto!'; ka = 'არასწორი გაფილტრვის პერიოდი შეყვანილია!'; kk = 'Введен некорректный период отбора - Таңдау уақыты дұрыс емес енгізілді'; ro = 'Perioada de selecție introdusă este incorectă!'; ru = 'Введен некорректный период отбора!'; tr = 'Geçersiz seçici dönemi girildi!'; uk = 'Введений некоректний період відбору!'; uz = ""Noto'g'ri tanlov davri kiritildi!""");
		Сообщить(Сообщение); 
		Возврат;
	КонецЕсли;
	
	ДокументыMS.Очистить();
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("PeriodFrom", НачалоДня(НачалоПериода));
	ПараметрыЗапроса.Вставить("PeriodTo", 	?(ЗначениеЗаполнено(КонецПериода), КонецДня(КонецПериода), КонецПериода));	
	
	ФильтрыЗапроса = Новый Структура;
	Если Не ПустаяСтрока(ИмяДокумента) Тогда
		ФильтрыЗапроса.Вставить("name", 	СокрЛП(ИмяДокумента));	
	КонецЕсли;
	Если Не ПустаяСтрока(УИД) Тогда
		ФильтрыЗапроса.Вставить("id", 		СокрЛП(УИД));	
	КонецЕсли;
	Если Не ПустаяСтрока(ИДУстройства) Тогда
		ФильтрыЗапроса.Вставить("deviceId", СокрЛП(ИДУстройства));	
	КонецЕсли;
	Если Не ПустаяСтрока(ИмяФайла) Тогда
		ФильтрыЗапроса.Вставить("fileName", СокрЛП(ИмяФайла));	
	КонецЕсли;
	Если Не ПустаяСтрока(Тип) Тогда
		ФильтрыЗапроса.Вставить("documentTypeName", 	СокрЛП(Тип));	
	КонецЕсли;
	
	СписокДокументов = _ЛокКонтекст.ЛокЯдро_ПолучениеАрхивныхДокументовSMARTS(ПараметрыЗапроса, ФильтрыЗапроса, ТипБазы);
	
	Если СписокДокументов <> Неопределено 
		И ТипЗнч(СписокДокументов) = Тип("Массив")
		И СписокДокументов.Количество() > 0 Тогда
		
		Для Каждого СтруктураДокумента Из СписокДокументов Цикл
			
			НоваяСтрока = ДокументыMS.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДокумента);
			
			Для Каждого ДанныеДокумента Из _ЛокКонтекст.СтруктураМетаданных.Документы1С Цикл
				Если _ЛокКонтекст.ЛокЯдро_СтрНайти(НоваяСтрока.Синоним, ДанныеДокумента.Значение.Синоним) > 0 Тогда					
					НоваяСтрока.Тип1С = ДанныеДокумента.Значение.Синоним;                                              
					Прервать;					
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьДокументы(Команда)
	
	МассивДокументовКВыгрузке 	= Новый Массив;
	МассивСтрокТаблицы			= Новый Массив;
	
	Для Каждого СтрокаДокументовMS Из ДокументыMS Цикл
		
		Если Не СтрокаДокументовMS.Загружать Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДокумента = Новый Структура("УИД,ИмяФайла,ИДУстройства,Тип"); 
		ЗаполнитьЗначенияСвойств(СтруктураДокумента, СтрокаДокументовMS);
		МассивДокументовКВыгрузке.Добавить(СтруктураДокумента);
		МассивСтрокТаблицы.Добавить(СтрокаДокументовMS);
		
	КонецЦикла;
	
	Если Не МассивДокументовКВыгрузке.Количество() Тогда             		
		Сообщение = НСтр("be = 'Адсутнічаюць выбраныя дакументы да аднаўлення'; en = 'No selected documents for recovery'; es = 'No hay documentos seleccionados para restaurar'; ka = 'არჩეული დოკუმენტები არ არის აღდგენილი'; kk = 'Қалпына келтіру үшін таңдалған документтер жоқ'; ro = 'Nu sunt documente selectate pentru restaurare'; ru = 'Отсутствуют выбранные документы к восстановлению'; tr = 'Kurtarılacak belgeler seçilmedi'; uk = 'Відсутні обрані документи для відновлення'; uz = 'Qaytarish uchun tanlangan hujjatlar mavjud emas'");
		Сообщить(Сообщение); 
		Возврат;		
	КонецЕсли;
	
	Результат = _ЛокКонтекст.ЛокЯдро_ВосстановитьДокументыSMARTS(МассивДокументовКВыгрузке, ТипБазы);
	Если Результат Тогда
		Для Каждого ВосстановленнаяСтрока Из МассивСтрокТаблицы Цикл
			ДокументыMS.Удалить(ВосстановленнаяСтрока);
		КонецЦикла;		
		Закрыть(Истина);
	Иначе
		Сообщение = НСтр("be = 'Не ўдалося адправіць запыт на аднаўленне (гл. журнал рэгістрацыі)'; en = 'Failed to send recovery request (see registration log)'; es = 'No se pudo enviar la solicitud de recuperación (consulte el registro de eventos)'; ka = 'აღწერილი მოთხოვნა ვერ გაიგზავნება (ნახეთ რეგისტრაციის ჟურნალში)'; kk = 'Қалпына келтіру сұрауын жіберу мүмкін емес (ЖР жазуын көріңіз)'; ro = 'Nu s-a putut trimite cererea de recuperare (consultați jurnalul de înregistrare)'; ru = 'Не удалось отправить запрос на восстановление (см. журнал регистрации)'; tr = 'Kurtarma isteği gönderilemedi (günlük kaydına bakın)'; uk = 'Не вдалося відправити запит на відновлення (див. журнал реєстрації)'; uz = 'Тиклаш учун сўров юбориш мумкин эмас (рўйхатдан ўтиш журналини кўринг)'");
		Сообщить(Сообщение); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть(Ложь);
	
КонецПроцедуры

#КонецОбласти