#Область ПрограммныйИнтерфейс

&ИзменениеИКонтроль("ПечатьТТН")
Функция АУ_ПечатьТТН(ОписаниеКоманды)

	#Вставка
	Для каждого стрОбъектПечати Из ОписаниеКоманды.ОбъектыПечати Цикл
		Если ТипЗнч(стрОбъектПечати) = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда
			АУ_ОбщиеПроцедурыИФункцииВызовСервера.ПоместитьВБуфер(ОписаниеКоманды.ОбъектыПечати);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	#КонецВставки
	
	ОчиститьСообщения();
	ЭтоПечатьОдногоДокумента = ОписаниеКоманды.ОбъектыПечати.Количество() = 1;

	РезультатыПроверки = УправлениеПечатьюУТВызовСервераЛокализация.ПроверитьДокументыОснования(ОписаниеКоманды.ОбъектыПечати);

	ОписаниеКоманды.ОбъектыПечати = 
	ОбщегоНазначенияКлиентСервер.РазностьМассивов(ОписаниеКоманды.ОбъектыПечати,
	РезультатыПроверки.ОбъектыПоКоторымСоздаватьТранспортныеНакладныеНельзя);
	ОписаниеКоманды.ОбъектыПечати = 
	ОбщегоНазначенияКлиентСервер.РазностьМассивов(ОписаниеКоманды.ОбъектыПечати,
	РезультатыПроверки.ОбъектыПоКоторымМожноИНужноСоздатьТранспортныеНакладные);

	Если ОписаниеКоманды.ОбъектыПечати.Количество() = 0
		И (Не ОписаниеКоманды.ДополнительныеПараметры.ИнтерактивноеДобавление
		Или РезультатыПроверки.ОбъектыПоКоторымМожноИНужноСоздатьТранспортныеНакладные.Количество() = 0) Тогда

		Если ЭтоПечатьОдногоДокумента Тогда
			ТекстСообщения = НСтр("ru = 'Нельзя напечатать транспортные накладные и ТТН по данному документу.'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Нет документов, по которым можно напечатать транспортные накладные или ТТН.'");
		КонецЕсли;

		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;

	Если РезультатыПроверки.ОбъектыПоКоторымМожноИНужноСоздатьТранспортныеНакладные.Количество() > 0 Тогда

		СписокЗначенийКнопок = Новый СписокЗначений;

		Если ЭтоПечатьОдногоДокумента Тогда
			ЗаголовокВопроса = НСтр("ru = 'По документу не создана транспортная накладная.'");
		Иначе
			ЗаголовокВопроса = НСтр("ru = 'Для некоторых распоряжений не созданы транспортные накладные.'");
		КонецЕсли;

		Если ОписаниеКоманды.ДополнительныеПараметры.ИнтерактивноеДобавление Тогда
			СписокЗначенийКнопок.Добавить("СоздатьИНапечатать", НСтр("ru = 'Создать и вывести на печать'"));
		КонецЕсли;

		Если ОписаниеКоманды.ОбъектыПечати.Количество() > 0 Тогда
			СписокЗначенийКнопок.Добавить("НапечататьСуществующие", НСтр("ru = 'Напечатать уже созданные'"));
		КонецЕсли;

		СписокЗначенийКнопок.Добавить("Отмена", НСтр("ru = 'Отмена'"));

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("РезультатыПроверки", РезультатыПроверки);
		ДополнительныеПараметры.Вставить("ОписаниеКоманды", ОписаниеКоманды);

		ОповещениеОЗавершении = Новый ОписаниеОповещения("НеСозданыТранспортныеНакладныеЗавершение", 
		ТранспортнаяНакладнаяКлиент,
		ДополнительныеПараметры);

		ПоказатьВопрос(ОповещениеОЗавершении,
		ЗаголовокВопроса, 
		СписокЗначенийКнопок);

	Иначе

		ВыполнитьКомандуПечатиПечатьТТН(Неопределено, ОписаниеКоманды);

	КонецЕсли;	

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
