&НаСервере
Перем ДоступныеТипыДанных;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Область СовместимыйКодFresh
	//Сообщить("В базе, размещенной во fresh, запрещено создание произвольных запросов");
	//Возврат;
	#КонецОбласти //СовместимыйКодFresh
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	Результат = Новый Структура;	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Результат.Вставить("ТекстЗапроса", Элементы.ТекстЗапроса.ПолучитьТекст());
	#Иначе
		Результат.Вставить("ТекстЗапроса", ТекстЗапроса);
	#КонецЕсли
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте 
Процедура Конструктор(Команда) 
	Конструктор = Новый КонструкторЗапроса;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТекстЗапросаКонструктор = Элементы.ТекстЗапроса.ПолучитьТекст();		
	#Иначе
		ТекстЗапросаКонструктор = ТекстЗапроса;		
	#КонецЕсли
	Если ТекстЗапросаКонструктор <> "" Тогда
		Конструктор.Текст = ТекстЗапросаКонструктор;
	КонецЕсли;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если Конструктор.ОткрытьМодально() Тогда
			Элементы.ТекстЗапроса.УстановитьТекст(Конструктор.Текст);
		КонецЕсли;	
	#Иначе	
		Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторЗапросаЗавершение", ЭтаФорма);
		Конструктор.Показать(Оповещение);
	#КонецЕсли	
КонецПроцедуры 

&НаКлиенте 
Процедура ОткрытьКонструкторЗапросаЗавершение(Текст, ДополнительныеПараметры) Экспорт
	Если НЕ Текст = Неопределено Тогда
		ТекстЗапроса = Текст; 		
	КонецЕсли; 
КонецПроцедуры

#Если ТолстыйКлиентОбычноеПриложение Тогда
	Процедура ПриОткрытии()
				
		Элементы.ТекстЗапроса.УстановитьТекст(ТекстЗапроса);
		
	КонецПроцедуры

	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	Объект = ЭтотОбъект;
#КонецЕсли