
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТочноеСовпадение = Ложь;
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
	Если ПараметрыСервиса.АвторизацияВыполнена Тогда
		
		ОбновитьОрганизации(ПараметрКоманды);
		
	Иначе
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(
			"Ни у одной из наших организаций не заполнена авторизация в Логистике");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОрганизации(ОрганизацииДиадок)
	
	Для Каждого ОрганизацияДиадок Из ОрганизацииДиадок Цикл 
		
		Попытка
			
			ОрганизацияДиадокОбъект = ОрганизацияДиадок.ПолучитьОбъект();
			ОрганизацияДиадокОбъект.СинхронизироватьИзСервисаЛогистика();
			
		Исключение
			
			Сообщить("Не удалось обновить данные из сервиса по причине: " + ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры