#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	#Область СлужебныйПрограммныйИнтерфейс
	Процедура ЗаполнениеСправочника() Экспорт
		ТабДок = ПолучитьМакет(Метаданные.Справочники.КонтурЗакупки_ОтраслиОбновленные.Макеты.Отрасли);
		Для Инд = 2 По ТабДок.ВысотаТаблицы Цикл
			Область = ТабДок.ПолучитьОбласть(Инд, 1, Инд, 1);
			КодРодителя = СокрЛП(Область.ТекущаяОбласть.Текст);

			Область = ТабДок.ПолучитьОбласть(Инд, 2, Инд, 2);
			Код = СокрЛП(Область.ТекущаяОбласть.Текст);

			Область = ТабДок.ПолучитьОбласть(Инд, 3, Инд, 3);
			Наименование = СокрЛП(Область.ТекущаяОбласть.Текст);

			ЭлементПоКоду = НайтиПоКоду(Код);
			Записывать = Ложь;

			РодительПоКоду = ПустаяСсылка();
			Если Не ПустаяСтрока(КодРодителя) Тогда
				РодительПоКоду = НайтиПоКоду(КодРодителя);
			КонецЕсли;
			Если ЗначениеЗаполнено(ЭлементПоКоду) Тогда
				ЭлементОбъект = ЭлементПоКоду.ПолучитьОбъект();
			Иначе
				Если ПустаяСтрока(КодРодителя) Тогда
					ЭлементОбъект = СоздатьГруппу();
				Иначе
					ЭлементОбъект = СоздатьЭлемент();
				КонецЕсли;
				ЭлементОбъект.Код = Число(Код);
				Записывать = Истина;
			КонецЕсли;

			Если Не ЭлементОбъект.Наименование = Наименование Тогда
				ЭлементОбъект.Наименование = Наименование;
				Записывать = Истина;
			КонецЕсли;

			Если Не ЭлементОбъект.Родитель = РодительПоКоду Тогда
				ЭлементОбъект.Родитель	 = РодительПоКоду;
				Записывать = Истина;
			КонецЕсли;

			Если Записывать Тогда
				Попытка
					ЭлементОбъект.Записать();
				Исключение
					ПрефиксПродукта = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьПрефиксПродукта();
					КонтурЗакупки_СлужебныеВызовСервера.ДобавитьЛог(ПрефиксПродукта, ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецПроцедуры
	#КонецОбласти
#КонецЕсли