// @strict-types
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "НаименованиеОбъектаЗакупки,
													|ЖНВЛП,
													|ОбоснованиеУказанияСведений,
													|ТорговоеНаименованиеПрепарата");

	ТЗВариантыПоставки = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыВариантыПоставки);
	Если ЗначениеЗаполнено(ТЗВариантыПоставки) И ТипЗнч(ТЗВариантыПоставки) = Тип("ТаблицаЗначений") Тогда
		ВариантыПоставки.Загрузить(ТЗВариантыПоставки);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти