
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = СформироватьНастройкиНаСервере(ПараметрКоманды);
	ТабДок.Показать("Текущие значения настроек конвертации документов");
	
КонецПроцедуры

&НаСервере
Функция СформироватьНастройкиНаСервере(МассивНастроек)
	
	ТабДок = Новый ТабличныйДокумент;
	
	ИмяКонфигурацииДляНКД = "КЛ";
	
	Макет = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьМакет(ИмяКонфигурацииДляНКД);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьМакета);
	
	Для Каждого СтрокаНастроек Из МассивНастроек Цикл 
	
		// заполнение настроек ключевых путей идентификации
		ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, ОписаниеНастройкиКлючевыхПутей("ПутьОрганизация", СтрокаНастроек.ПутьОрганизация));
		ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, ОписаниеНастройкиКлючевыхПутей("ПутьКонтрагент", СтрокаНастроек.ПутьКонтрагент));
		ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, ОписаниеНастройкиКлючевыхПутей("ПутьГрузоотправитель", СтрокаНастроек.ПутьГрузоотправитель));
		ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, ОписаниеНастройкиКлючевыхПутей("ПутьПеревозчик", СтрокаНастроек.ПутьПеревозчик));
		ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, ОписаниеНастройкиКлючевыхПутей("ПутьГрузополучатель", СтрокаНастроек.ПутьГрузополучатель));
		ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, ОписаниеНастройкиКлючевыхПутей("ПутьКоллекцияТабЧастьТовары", СтрокаНастроек.ПутьКоллекцияТабЧастьТовары));
		ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, ОписаниеНастройкиКлючевыхПутей("ПутьКоллекцияТабЧастьТоварыИмяРеквизитаТЧ", СтрокаНастроек.ПутьКоллекцияТабЧастьТоварыИмяРеквизитаТЧ));
		ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, ОписаниеНастройкиКлючевыхПутей("ИмяТабЧастьТовары", СтрокаНастроек.ИмяТабЧастьТовары));
		
		// заполнение настроек из ТЧ ПравилаКонвертацииГлавногоДокумента	
		Для Каждого Правило Из СтрокаНастроек.ПравилаКонвертацииГлавногоДокумента Цикл 
			ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, Правило, "ПравилаКонвертацииГлавногоДокумента");
		КонецЦикла;	
		
		// заполнение настроек из ТЧ ПравилаКонвертацииТитулаРеквизиты
		Для Каждого Правило Из СтрокаНастроек.ПравилаКонвертацииТитулаРеквизиты Цикл 
			ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, Правило, "ПравилаКонвертацииТитулаРеквизиты");
		КонецЦикла;
		
		// заполнение настроек из ТЧ ПравилаКонвертацииТитулаТабЧастьТовары
		Для Каждого Правило Из СтрокаНастроек.ПравилаКонвертацииТитулаТабЧастьТовары Цикл 
			ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, Правило, "ПравилаКонвертацииТитулаТабЧастьТовары");
		КонецЦикла;
		
		// заполнение переменных
		Для Каждого Переменная Из СтрокаНастроек.Переменные Цикл 
			ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, Переменная, "Переменные");
		КонецЦикла;
		
		// заполнение настроек из ТЧ ПравилаКонвертацииТитулаТабЧастьПроизвольная
		Для Каждого Правило Из СтрокаНастроек.ПравилаКонвертацииТитулаТабЧастьПроизвольная Цикл 
			ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, Правило, "ПравилаКонвертацииТитулаТабЧастьПроизвольная");
		КонецЦикла;
		
	КонецЦикла;

	Возврат ТабДок;
	
КонецФункции

&НаСервере
Процедура ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, ДанныеДляЗаполнения, ТабЧасть = "")
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШаблонСтроки");
	
	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ОписаниеОсновныхРеквизитов(СтрокаНастроек));
	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеДляЗаполнения);	
	
	ОбластьМакета.Параметры.ТабЧасть = ТабЧасть;
	
	ОбластьМакета.Параметры.ТипДокументаЛогистика 		= ПолучитьИмяЭлементаПеречисленияПоЗначению_(ОбластьМакета.Параметры.ТипДокументаЛогистика);	
	ОбластьМакета.Параметры.СпособМаппинга 				= ПолучитьИмяЭлементаПеречисленияПоЗначению_(ОбластьМакета.Параметры.СпособМаппинга);
	ОбластьМакета.Параметры.СпособКонвертацииЗначения 	= ПолучитьИмяЭлементаПеречисленияПоЗначению_(ОбластьМакета.Параметры.СпособКонвертацииЗначения);
	
	Если ЗначениеЗаполнено(ОбластьМакета.Параметры.СпособМаппинга) 
		И ДанныеДляЗаполнения.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ФиксированноеЗначение Тогда  
		Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоТипСсылка(ТипЗнч(ДанныеДляЗаполнения.ВыражениеВычисления)) Тогда 
			ОбластьМакета.Параметры.ВыражениеВычисления = ПреобразованноеЗначениеФиксированногоЗначения(ДанныеДляЗаполнения.ВыражениеВычисления); 
		ИначеЕсли ТипЗнч(ДанныеДляЗаполнения.ВыражениеВычисления) = Тип("Дата") Тогда 
			ОбластьМакета.Параметры.ВыражениеВычисления = Формат(ДанныеДляЗаполнения.ВыражениеВычисления, "ггггММддЧЧммсс"); 	
		КонецЕсли;
	КонецЕсли;	
	
	Если Не ТабЧасть = "" 
		И Не ЗначениеЗаполнено(ОбластьМакета.Параметры.ВыражениеВычисления) 
		И ЗначениеЗаполнено(ДанныеДляЗаполнения.ВыражениеВычисленияСтрокаНеогр) Тогда 
		ОбластьМакета.Параметры.ВыражениеВычисления = ДанныеДляЗаполнения.ВыражениеВычисленияСтрокаНеогр;	
	КонецЕсли;	
	
	Если ТабЧасть = "Переменные" Тогда 
		ОбластьМакета.Параметры.РеквизитТитула 				= ДанныеДляЗаполнения.Имя;
		ОбластьМакета.Параметры.РеквизитТитулаТипЗначения 	= ДанныеДляЗаполнения.ИмяТипЗначения;
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьМакета);
	
КонецПроцедуры

&НаСервере
Функция ОписаниеНастройкиКлючевыхПутей(РеквизитТитула, ВыражениеВычисления)
	
	Структура = Новый Структура;
	
	Структура.Вставить("РеквизитТитула", 		РеквизитТитула);
	Структура.Вставить("ВыражениеВычисления", 	ВыражениеВычисления);
	
	Возврат Структура;
	
КонецФункции	

&НаСервере
Функция ОписаниеОсновныхРеквизитов(СтрокаНастроек)
	
	Структура = Новый Структура;
		
	Структура.Вставить("Конфигурация", 			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеНастройки("ИмяКонфигурации1С"));
	Структура.Вставить("ТипДокументаЛогистика", СтрокаНастроек.ТипДокументаЛогистика);
	Структура.Вставить("ТипДокумента1С", 		СтрокаНастроек.ТипДокумента1С);
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяЭлементаПеречисленияПоЗначению_(Знач ПеречислениеСсылка)
	
	Если Не ЗначениеЗаполнено(ПеречислениеСсылка) Тогда 
		Возврат "";
	КонецЕсли;	
	
	ИмяМетаданных = ПеречислениеСсылка.Метаданные().Имя;
	НазваниеМенеджера = "ПеречислениеМенеджер." + ИмяМетаданных;    
	Менеджер = Новый (НазваниеМенеджера); 
	Имя = ПеречислениеСсылка.Метаданные().ЗначенияПеречисления[Менеджер.Индекс(ПеречислениеСсылка)].Имя;
	
	Возврат Имя;
	
КонецФункции

&НаСервере
Функция ПреобразованноеЗначениеФиксированногоЗначения(ФиксЗначение)
	
	ОМ 			= ФиксЗначение.Метаданные();
	ПолноеИмяОМ = ОМ.ПолноеИмя();
	
	Если Найти(ПолноеИмяОМ, "Перечисление") > 0 Тогда
		
		Шаблон = "%1.%2";  
		
		ИмяПеречисления 			= ОМ.Имя;
		ИндексЗначенияПеречисления 	= Перечисления[ИмяПеречисления].Индекс(ФиксЗначение);
		ИмяЗначенияПеречисления 	= Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	
		Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(Шаблон,
					СтрЗаменить(ПолноеИмяОМ, "Перечисление", "Перечисления"),
					ИмяЗначенияПеречисления);
		
	ИначеЕсли Найти(ПолноеИмяОМ, "Справочник") > 0 Тогда
		
		Шаблон = "%1.НайтиПоКоду(""%2"")";
		
		Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(Шаблон,
					СтрЗаменить(ПолноеИмяОМ, "Справочник", "Справочники"),
					ФиксЗначение.Код);  
		
	Иначе
		
		ВызватьИсключение "Не могу обработать фиксированное значение: " + ФиксЗначение;
		
	КонецЕсли;	
		
КонецФункции
