#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьСделку(Команда)
	ИдентификаторКоманды = "СоздатьСделку";
	СозданныеОбъекты = Неопределено;
	ОбъектыНазначенияМассив = Новый Массив;
	Если ТипЗнч(ОбработкаЗакупки) = Тип("ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки") Тогда
		ОбъектыНазначенияМассив.Добавить(ОбработкаЗакупки);
		ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив, СозданныеОбъекты);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив, СозданныеОбъекты) Экспорт
	Для Каждого Элемент Из ОбъектыНазначенияМассив Цикл
				
		//Получая форму объекта создаваемого документа, мы уже создаем этот объект
		ФормаОбъекта = ОткрытьФорму("Справочник.СделкиСКлиентами.ФормаОбъекта");
				
		//Далее мы получаем объект только, что созданной формы и помещаем её в переменную
		//В объекте содержатся все реквизиты (элементы) формы
		ДанныеФормы = ФормаОбъекта.Объект;
				
		//Мы помещаем объект формы в переменную,
		//так как должны передать её в процедуру на сервере,
		//где нельзя изменять объект формы, зато можно править переменную содержащую его
		//@skip-check query-in-loop
		ЗаполнитьОбъектСделкаНаСервере(Элемент, ДанныеФормы);
				
		//После выполнения процедуры на сервере мы получаем изменную переменную ДанныеФормы,
		//которую необходимо передать в уже созданную нами форму
		КопироватьДанныеФормы(ДанныеФормы, ФормаОбъекта.Объект);
				
		//Открываем результат выполнения обработки
		ФормаОбъекта.Открыть();
	КонецЦикла;
			
//ЭтаФорма.Закрыть();
КонецПроцедуры

// Заполнить объект сделка на сервере.
// 
// Параметры:
//  ЗакупкаСсылка - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Закупка ссылка
//  СделкаОбъект - СправочникОбъект.СделкиСКлиентами - Сделка объект
&НаСервереБезКонтекста
Процедура ЗаполнитьОбъектСделкаНаСервере(ЗакупкаСсылка, СделкаОбъект)
	Партнер = Неопределено;

	ОрганизаторНаименование = ЗакупкаСсылка.ОрганизаторНаименование;
	ОрганизаторИНН = ЗакупкаСсылка.ОрганизаторИНН;
	ОрганизаторКПП = ЗакупкаСсылка.ОрганизаторКПП;
	Если ПустаяСтрока(ОрганизаторНаименование) И ЗакупкаСсылка.Заказчики.Количество() > 0 Тогда

		ОрганизаторНаименование = ЗакупкаСсылка.Заказчики[0].Заказчики_ОрганизацияНаименование;
		ОрганизаторИНН = ЗакупкаСсылка.Заказчики[0].ОрганизацияИНН;
		ОрганизаторКПП = ЗакупкаСсылка.Заказчики[0].ОрганизацияКПП;
	КонецЕсли;

	Контрагент = ПолучитьКонтрагента(ОрганизаторИНН, ОрганизаторКПП);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Партнер = Контрагент.Партнер;
	КонецЕсли;

	Если Истина Тогда
		СтруктураПартнера = Новый Структура;
		СтруктураПартнера.Вставить("Комментарий", НСтр("ru = '#Создан автоматически из закупки'"));

		СтруктураПартнера.Вставить("НаименованиеПолное", ОрганизаторНаименование);
		СтруктураПартнера.Вставить("Наименование", ОрганизаторНаименование);
		СтруктураПартнера.Вставить("ДатаРегистрации", ТекущаяДатаСеанса());
		СтруктураПартнера.Вставить("ПрочиеОтношения", Истина);
		СтруктураПартнера.Вставить("ЮрФизЛицо", Перечисления.КомпанияЧастноеЛицо.Компания);

		СтруктураКонтактнаяИнформацияПартнера = Новый Структура;
		Если Не ПустаяСтрока(ЗакупкаСсылка.КонтактныеДанныеТелефон) Тогда
			СтруктураКонтактнаяИнформацияПартнера.Вставить("ТелефонКонтактногоЛица",
				ЗакупкаСсылка.КонтактныеДанныеТелефон);
		КонецЕсли;
		Если Не ПустаяСтрока(ЗакупкаСсылка.КонтактныеДанныеЭлектроннаяПочта) Тогда
			СтруктураКонтактнаяИнформацияПартнера.Вставить("EmailКонтактногоЛица",
				ЗакупкаСсылка.КонтактныеДанныеЭлектроннаяПочта);
		КонецЕсли;
		Если Не ПустаяСтрока(ЗакупкаСсылка.КонтактныеДанныеИмя) Тогда
			СтруктураКонтактнаяИнформацияПартнера.Вставить("КонтактноеЛицо", ЗакупкаСсылка.КонтактныеДанныеИмя);
		КонецЕсли;
		СтруктураПартнера.Вставить("КонтактнаяИнформация", СтруктураКонтактнаяИнформацияПартнера);

		Партнер = НайтиСоздатьПартнераНаСервере(СтруктураПартнера);
	КонецЕсли;

	СделкаОбъект.Партнер = Партнер;
	СделкаОбъект.Статус = Перечисления.СтатусыСделок.ВРаботе;
	СделкаОбъект.Комментарий = СтрШаблон(
		НСтр("ru = '#Создано автоматически на основании закупки %1 от %2'"), ЗакупкаСсылка.НомерЗакупки, Формат(
			ЗакупкаСсылка.ДатаСозданияЗакупки, "ДЛФ=DDT"));
	СделкаОбъект.Наименование = ЗакупкаСсылка.ИмяОписаниеЗакупки;
	СделкаОбъект.ВалютаПервичногоСпроса = ПолучитьВалютуПоСимвКоду(?(Не ПустаяСтрока(ЗакупкаСсылка.Валюта),
		ЗакупкаСсылка.Валюта, "RUB"));
	ЗаполнитьПервичныйСпрос(ЗакупкаСсылка, СделкаОбъект);

КонецПроцедуры

// Заполнить первичный спрос.
// 
// Параметры:
//  ЗакупкаСсылка - ДокументСсылка.КонтурЗакупки_ОбработкаЗакупки - Закупка ссылка
//  СделкаОбъект - СправочникОбъект.СделкиСКлиентами - Сделка объект
&НаСервереБезКонтекста
Процедура ЗаполнитьПервичныйСпрос(ЗакупкаСсылка, СделкаОбъект)
	// ТекстовоеОписание
	// Сумма
	// ПроцентУдовлетворения
	// Комментарий
	// ПричинаНеудовлетворения
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.НаименованиеОбъектаЗакупки = """"
	|			ТОГДА КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.НаименованиеОбъектаЗакупки
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Код ЕСТЬ NULL
	|					ТОГДА КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Расшифровка
	|				ИНАЧЕ """"
	|			КОНЕЦ + ВЫБОР
	|				КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУКод ЕСТЬ NULL
	|					ТОГДА КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУРасшифровка
	|				ИНАЧЕ """"
	|			КОНЕЦ + ВЫБОР
	|				КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Код ЕСТЬ NULL
	|					ТОГДА КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Расшифровка
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ТекстовоеОписание,
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.ОбщаяСтоимостьОбъекта КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Код ЕСТЬ NULL
	|			ТОГДА ""ОКПД2 "" + КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Код + "" "" + КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Расшифровка + "" | ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУКод ЕСТЬ NULL
	|			ТОГДА ""КТРУ "" + КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУКод + "" "" + КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУРасшифровка + "" | ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Код ЕСТЬ NULL
	|			ТОГДА ""ОКВЭД2 "" + КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Код + "" "" + КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Расшифровка
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комментарий
	|ИЗ
	|	Документ.КонтурЗакупки_Закупка.ОбъектыЗакупки КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЗакупки_Закупка.КодыОКПД2 КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2
	|		ПО КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ключ_ОбъектыЗакупки = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.Ключ
	|			И КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ссылка = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЗакупки_Закупка.КодыКТРУ КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ
	|		ПО КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ключ_ОбъектыЗакупки = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.Ключ
	|			И КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ссылка = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЗакупки_Закупка.КодыОКВЭД2 КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2
	|		ПО КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ключ_ОбъектыЗакупки = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.Ключ
	|			И КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ссылка = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.Ссылка
	|ГДЕ
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ЗакупкаСсылка);

	СделкаОбъект.ПервичныйСпрос.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуПоСимвКоду(СимвКод)
	ВозвратВалюта = Справочники.Валюты.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Валюты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Наименование = &Наименование";

	Запрос.УстановитьПараметр("Наименование", СимвКод);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвратВалюта = Выборка.Ссылка;
	КонецЕсли;

	Возврат ВозвратВалюта;

КонецФункции

&НаСервереБезКонтекста
Функция НайтиСоздатьПартнераНаСервере(СтруктураПартнера)
		// обрежем, наименование, что бы искать по полному и не создать дубликат
	ВозвратПартнер = ПолучитьПартнера(Лев(СтруктураПартнера.НаименованиеПолное, 250));
	Если ЗначениеЗаполнено(ВозвратПартнер) Тогда
		НовПартнер = ВозвратПартнер.ПолучитьОбъект();
	Иначе
		НовПартнер = Справочники.Партнеры.СоздатьЭлемент();
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(НовПартнер, СтруктураПартнера);

	Попытка
		НовПартнер.Записать();
		ВозвратПартнер = НовПартнер.Ссылка;
	Исключение
	КонецПопытки;
	СтруктураКИ = СтруктураПартнера.КонтактнаяИнформация;

	Если ЗначениеЗаполнено(ВозвратПартнер) И СтруктураКИ.Количество() > 0 Тогда
		НовоеКЛ = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
		НовоеКЛ.Владелец = ВозвратПартнер;

		Если СтруктураКИ.Свойство("КонтактноеЛицо") Тогда
			НовоеКЛ.Наименование = СтруктураПартнера.КонтактнаяИнформация["КонтактноеЛицо"];
		Иначе
			НовоеКЛ.Наименование = "Не указано";
		КонецЕсли;

		Если СтруктураКИ.Свойство("ТелефонКонтактногоЛица") Тогда
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(НовоеКЛ, СтруктураКИ["ТелефонКонтактногоЛица"],
				Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);
		КонецЕсли;

		Если СтруктураКИ.Свойство("EmailКонтактногоЛица") Тогда
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(НовоеКЛ, СтруктураКИ["EmailКонтактногоЛица"],
				Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица);
		КонецЕсли;

		НовоеКЛ.Записать();
	КонецЕсли;

	Возврат ВозвратПартнер;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКонтрагента(ИНН, КПП)
	ВозвратКонтрагент = Справочники.Контрагенты.ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И Контрагенты.КПП = &КПП";
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвратКонтрагент = Выборка.Ссылка;
	КонецЕсли;

	Возврат ВозвратКонтрагент;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПартнера(НаименованиеПолное)
	ВозвратПартнер = Справочники.Партнеры.ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Партнеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.НаименованиеПолное = &НаименованиеПолное";
	Запрос.УстановитьПараметр("НаименованиеПолное", НаименованиеПолное);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвратПартнер = Выборка.Ссылка;
	КонецЕсли;

	Возврат ВозвратПартнер;
КонецФункции
#КонецОбласти