#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область СтандартныеПодсистемы

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОбработатьДанныеДляПереходаНаНовуюВерсиюНачальноеЗаполнение");
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбработкаЗавершена = Ложь;
	
	НачатьТранзакцию();
	Попытка
		
		ДанныеКлассификатора = ПолучитьМакет("ДанныеКлассификатора").ПолучитьТекст();
		
		ДанныеКэша = СервисНастроекЭДО.ОбработкаРезультатаКлассификаторПолномочий_МЧД003(ДанныеКлассификатора);
		Если ДанныеКэша <> Неопределено Тогда
			МашиночитаемыеДоверенности.ОбновитьКлассификаторПолномочий_МЧД003(ДанныеКэша);
		КонецЕсли;
		
		ОбработкаЗавершена = Истина;
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ТекстСообщения = НСтр("ru = 'Не удалось заполнить классификатор полномочий (МЧД 003) по причине:'") + Символы.ПС 
			+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
	КонецПопытки;
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсиюНачальноеЗаполнение(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьЗаписи
		|ИЗ
		|	Справочник.КлассификаторПолномочийМЧД003 КАК КлассификаторПолномочийМЧД003";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Читает таблицу упрощенных настроек правила проверки полномочий.
// 
// Параметры:
//  ЭлементКлассификатора - СправочникСсылка.КлассификаторПолномочийМЧД003
// 
// Возвращаемое значение:
//  ТаблицаЗначений - если настройки присутствуют, то содержит колонки:
//  * ИмяПоляДанных     - Строка
//  * НачальноеЗначение - Булево
//                      - Число
//  * КонечноеЗначение  - Булево
//                      - Число
//  * Список            - ХранилищеЗначения
Функция ТаблицаНастроекОтбора(ЭлементКлассификатора) Экспорт
	
	Результат = Новый ТаблицаЗначений();
	
	Если ЗначениеЗаполнено(ЭлементКлассификатора) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КлассификаторПолномочий.ИмяПоляДанных,
			|	КлассификаторПолномочий.НачальноеЗначение,
			|	КлассификаторПолномочий.КонечноеЗначение,
			|	КлассификаторПолномочий.Список
			|ИЗ
			|	Справочник.КлассификаторПолномочийМЧД003.НастройкиПроверки КАК КлассификаторПолномочий
			|ГДЕ
			|	КлассификаторПолномочий.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементКлассификатора);
		Результат = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Найти полномочие по коду.
// 
// Параметры:
//  КодКлассификатора - Строка
// 
// Возвращаемое значение:
//  СправочникСсылка.КлассификаторПолномочийМЧД003 - ссылка на элемент справочника
Функция НайтиПолномочиеПоКоду(КодКлассификатора) Экспорт
	
	Если ЗначениеЗаполнено(КодКлассификатора) Тогда
		
		Возврат НайтиПоРеквизиту("КодКлассификатора", КодКлассификатора);
		
	Иначе
		
		Возврат ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция КодПолномочия_KLASS_2_0_SIGN_ELECTRONIC_DOCUMENTS() Экспорт
	
	Возврат "KLASS_2.0_SIGN_ELECTRONIC_DOCUMENTS";
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция КодПолномочия_KLASS_2_0_SIGN_DIG_DOC()
	
	Возврат "KLASS_2.0_SIGN_DIG_DOC";
	
КонецФункции

// Возвращает данные полномочия KLASS_2_0_SIGN_ELECTRONIC_DOCUMENTS.
// 
// Возвращаемое значение:
//  Структура:
// * КодКлассификатора - Строка
// * Мнемоника - Строка
// * Полномочие - Строка
// * ОписаниеПолномочия - Строка
// * КонтекстПолномочия - Строка
//
Функция ПолучитьДанныеПолномочия_KLASS_2_0_SIGN_ELECTRONIC_DOCUMENTS() Экспорт 
	
	КодКлассификатора = КодПолномочия_KLASS_2_0_SIGN_ELECTRONIC_DOCUMENTS();
	
	Результат = Новый Структура;
	Результат.Вставить("КодКлассификатора", "");
	Результат.Вставить("Мнемоника", "");
	Результат.Вставить("Полномочие", "");
	Результат.Вставить("ОписаниеПолномочия", "");
	Результат.Вставить("КонтекстПолномочия", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КлассификаторПолномочийМЧД003.КодКлассификатора КАК КодКлассификатора,
	|	КлассификаторПолномочийМЧД003.Мнемоника КАК Мнемоника,
	|	КлассификаторПолномочийМЧД003.Полномочие КАК Полномочие,
	|	КлассификаторПолномочийМЧД003.ОписаниеПолномочия КАК ОписаниеПолномочия,
	|	КлассификаторПолномочийМЧД003.КонтекстПолномочия КАК КонтекстПолномочия
	|ИЗ
	|	Справочник.КлассификаторПолномочийМЧД003 КАК КлассификаторПолномочийМЧД003
	|ГДЕ
	|	КлассификаторПолномочийМЧД003.КодКлассификатора = &КодКлассификатора";
	
	Запрос.УстановитьПараметр("КодКлассификатора", КодКлассификатора);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает данные поддерживаемых ограничений из классификатора.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - код ограничения.
//   * Значение - Строка - наименование ограничения.
//
Функция ПолучитьДанныеПоддерживаемыхОграниченийИзКлассификатора() Экспорт
	
	КодыКлассификатора = ПоддерживаемыеКодыОграничений();
	
	Результат = Новый Соответствие;
	
	КлассификаторОграничений = РегистрыСведений.КлассификаторыОграниченийМЧД.КлассификаторОграничений();
	
	Для Каждого Элемент Из КодыКлассификатора Цикл 
		
		НайденноеОграничение = КлассификаторОграничений.Найти(Элемент, "Код");
		
		Если НайденноеОграничение <> Неопределено Тогда
			ЗначенияРеквизитов = Новый Структура;
			ЗначенияРеквизитов.Вставить("КодОграничения", НайденноеОграничение.Код);
			ЗначенияРеквизитов.Вставить("НаименованиеОграничения", НайденноеОграничение.Наименование);
		КонецЕсли;
		
		Результат.Вставить(Элемент, ЗначенияРеквизитов);
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Возвращает список кодов поддерживаемых ограничений
// 
// Возвращаемое значение:
//  Массив Из Строка
Функция ПоддерживаемыеКодыОграничений() Экспорт

	Результат = Новый Массив;
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипДокумента());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияЛимитПоСумме());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипСуммы());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипВалюты());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияКонтрагент());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияФилиалКонтрагента());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияВидДокументаЭДО());
	
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияВидОбязательств());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТовары());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияРаботы());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияУслуги());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТерритория());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияОрганВласти());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияОбъект());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипОбъекта());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияХарактеристикаУслугиРаботыТовара());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияСертификатЭППредставителя());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияФилиалДоверителя());
	
	Возврат Результат;
	
КонецФункции

// Возвращает список кодов ограничений поддерживаемых правилами проверки доверенностей.
// 
// Возвращаемое значение:
//  Массив Из Строка
Функция ПоддерживаемыеКодыОграниченийВПравилахПроверки() Экспорт

	Результат = Новый Массив;
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипДокумента());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияЛимитПоСумме());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипСуммы());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипВалюты());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияКонтрагент());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияФилиалКонтрагента());
	Результат.Добавить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияВидДокументаЭДО());
	
	Возврат Результат;
	
КонецФункции

// Возвращает данные ограничения "Вид документа ЭДО".
// 
// Возвращаемое значение:
//  Структура:
// * КодОграничения - Строка
// * НаименованиеОграничения - Строка
Функция ОграничениеВидДокументаЭДО() Экспорт
	
 	Результат = Новый Структура;
	Результат.Вставить("КодОграничения", МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияВидДокументаЭДО());
	Результат.Вставить("НаименованиеОграничения", НСтр("ru = 'Вид документа ЭДО'"));
	
	Возврат Результат;
	
КонецФункции

// Проверяет, находится ли код указанного полномочия в списке полномочий, поддерживающих ограничения
// 
// Параметры:
//  КодКлассификатора - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоПолномочиеИспользуетОграничения(КодКлассификатора) Экспорт
	
	Результат = Ложь;
	
	СписокПолномочийСОграничениями = ПолучитьСписокПолномочийСОграничениями();
	Если СписокПолномочийСОграничениями.Найти(КодКлассификатора) <> Неопределено Тогда 
		Результат = Истина;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Возвращает список кодов полномочий, поддерживающих ограничения.
// 
// Возвращаемое значение:
//  Массив из Строка
Функция ПолучитьСписокПолномочийСОграничениями() Экспорт

	Результат = Новый Массив;
	Результат.Добавить(КодПолномочия_KLASS_2_0_SIGN_ELECTRONIC_DOCUMENTS());
	Результат.Добавить(КодПолномочия_KLASS_2_0_SIGN_DIG_DOC());
	
	Возврат Результат;
	
КонецФункции

// Контекст полномочий по кодам.
// 
// Параметры:
//  КодыПолномочий - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из Строка
Функция КонтекстПолномочийПоКодам(КодыПолномочий) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КлассификаторПолномочийМЧД003.КодКлассификатора КАК КодКлассификатора,
		|	КлассификаторПолномочийМЧД003.КонтекстПолномочия КАК КонтекстПолномочия
		|ИЗ
		|	Справочник.КлассификаторПолномочийМЧД003 КАК КлассификаторПолномочийМЧД003
		|ГДЕ
		|	КлассификаторПолномочийМЧД003.КодКлассификатора В (&КодыПолномочий)";
	
	Запрос.УстановитьПараметр("КодыПолномочий", КодыПолномочий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Соответствие;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Вставить(ВыборкаДетальныеЗаписи.КодКлассификатора, ВыборкаДетальныеЗаписи.КонтекстПолномочия);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#КонецЕсли