Функция ОпределяемыеТипыДляНастроекКонвертации() Экспорт 
	
	ОпределяемыеТипы = Новый Массив;
	
	ОпределяемыеТипы.Добавить("КонтурЛогистика_Договор");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_Контрагент");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_Организация");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_ОрганизацияКонтрагент");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_ОрганизацияКонтрагентПартнер");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_Перевозчик");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_Подразделение");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_ПунктМаршрутаУчетнойСистемы");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_ТранспортноеСредство");
	ОпределяемыеТипы.Добавить("КонтурЛогистика_ФизическиеЛица");
			
	Возврат ОпределяемыеТипы;
	
КонецФункции

Функция ИменаКонвертируемыхСправочниковЛогистика() Экспорт 
	
	Имена = Новый Массив;
	
	Имена.Добавить("КонтурЛогистика_ГорючеСмазочныеМатериалы");
	Имена.Добавить("КонтурЛогистика_Договоры");
	Имена.Добавить("КонтурЛогистика_Лицензии");
	Имена.Добавить("КонтурЛогистика_ОрганизацииДиадок");
	Имена.Добавить("КонтурЛогистика_ПодразделенияДиадок");
	Имена.Добавить("КонтурЛогистика_ПунктыМаршрута");
	Имена.Добавить("КонтурЛогистика_Сотрудники");
	Имена.Добавить("КонтурЛогистика_ТранспортныеСредства");
	
	Возврат Имена;
	
КонецФункции

Процедура ЗаполнитьПравилаКонвертации(ПравилаКонвертации, ТипСправочникаЛогистика, ТипСправочникаИлиДокументаУС, ТипДокументаОснования = Неопределено, РеквизитТитула = Неопределено) Экспорт 
		
	ПравилаКонвертации.Очистить();
	
	ОписанияРеквизитовСправочника = ПолучитьТаблицуОписанияРеквизитовСправочника(ТипСправочникаЛогистика);
		
	Для Каждого ОписаниеРеквизита Из ОписанияРеквизитовСправочника Цикл 
		
		ПравилоКонвертации = ПравилаКонвертации.Добавить();
		
		ПравилоКонвертации.РеквизитСправочникаЛогистика 				= ОписаниеРеквизита.Имя;
		ПравилоКонвертации.РеквизитСправочникаЛогистикаПредставление 	= ?(ЗначениеЗаполнено(ОписаниеРеквизита.Синоним), ОписаниеРеквизита.Синоним, ОписаниеРеквизита.Имя);

		Настройка = ПолучитьНастройкуПоУмолчаниюДляПоля(ТипСправочникаЛогистика, 
			ТипСправочникаИлиДокументаУС, 
			ОписаниеРеквизита.Имя, 
			ТипДокументаОснования, 
			РеквизитТитула);
		
		Если Настройка = Неопределено Тогда
			
			Настройка = ПолучитьНастройкуДляПоля("РеквизитСправочникаЛогистика", ОписаниеРеквизита.Тип);			
						
		КонецЕсли;	
		
		ЗаполнитьЗначенияСвойств(ПравилоКонвертации, Настройка);
		
		Если Не ЗначениеЗаполнено(ПравилоКонвертации.РеквизитСправочникаЛогистикаКомментарий) Тогда 
			
			ПравилоКонвертации.РеквизитСправочникаЛогистикаКомментарий 	= ОписаниеРеквизита.Комментарий;
			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(ПравилоКонвертации.Картинка) Тогда 
			
			ПравилоКонвертации.Картинка = 3;
			
		КонецЕсли;
		
	КонецЦикла;		
	
	ПравилаКонвертации.Сортировать("Картинка, РеквизитСправочникаЛогистикаПредставление");
	
КонецПроцедуры				

Функция ТаблицаНастроекКонвертацииСправочников(ТипСправочникаЛогистика = Неопределено, 
												ТипСправочникаИлиДокументаУС = Неопределено, 
												ТипДокументаОснования = Неопределено, 
												РеквизитТитула = Неопределено,
												ИмяМакета = Неопределено,
												ИмяКонфигурации = Неопределено) Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТаблицуНастроекКонвертацииСправочниковПоУмолчанию(ТипСправочникаЛогистика, 
																													ТипСправочникаИлиДокументаУС, 
																													ТипДокументаОснования, 
																													РеквизитТитула,
																													ИмяМакета,
																													ИмяКонфигурации);
	
КонецФункции

Функция ПолучитьТаблицуНастроекКонвертацииСправочниковПоУмолчанию(ТипСправочникаЛогистика = Неопределено, 
																ТипСправочникаИлиДокументаУС = Неопределено, 
																ТипДокументаОснования = Неопределено, 
																РеквизитТитула = Неопределено, 
																ИмяМакета = Неопределено,
																ИмяКонфигурации = Неопределено) Экспорт

	ПравилаКонвертации = Новый ТаблицаЗначений;
	ПравилаКонвертации.Колонки.Добавить("ТипСправочникаЛогистика");
	ПравилаКонвертации.Колонки.Добавить("ТипСправочникаИлиДокументаУС");
	ПравилаКонвертации.Колонки.Добавить("ТипДокументаОснования");
	ПравилаКонвертации.Колонки.Добавить("РеквизитТитула");
	
	РеквизитыТЗ = Метаданные.Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ТабличныеЧасти.ПравилаКонвертации.Реквизиты;
	
	Для Каждого Реквизит Из РеквизитыТЗ Цикл 
		ПравилаКонвертации.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;	
	
	// разделение общего макета на макеты по конфигурациям
	ИмяКонфигурацииДляНКС = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ИмяКонфигурацииДляНастроекКонвертации(ИмяКонфигурации);
	
	Если ИмяКонфигурацииДляНКС = Неопределено Тогда 
		Возврат ПравилаКонвертации;
	КонецЕсли;
	
	ИзвлеченныеОбласти = Новый Массив;
	
	Если ИмяМакета = "ЗначенияПоУмолчаниюДляДополнений" Тогда 
		Макет = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ПолучитьМакет(ИмяМакета);
		Попытка 
			ИзвлеченныеОбласти.Добавить(Макет.ПолучитьОбласть(ИмяКонфигурации));
		Исключение
			Возврат ПравилаКонвертации;
		КонецПопытки;	
	Иначе		
		Попытка
			ИзвлеченныеОбласти = ИзвлечьОбластиИзМакетов(ИмяКонфигурацииДляНКС);
		Исключение
			Возврат ПравилаКонвертации;
		КонецПопытки;	
	КонецЕсли;   
	
	Для Каждого Область Из ИзвлеченныеОбласти Цикл
	
		Для Сч = 1 По Область.ВысотаТаблицы Цикл
			
			ТипСправочникаЛогистикаИзМакета			= ПолучитьТекстЯчейкиОбласти(Область, Сч, 2);
			ТипСправочникаИлиДокументаУСИзМакета	= ПолучитьТекстЯчейкиОбласти(Область, Сч, 3);
			ТипДокументаОснованияИзМакета			= ПолучитьТекстЯчейкиОбласти(Область, Сч, 4);
			РеквизитТитулаИзМакета					= ПолучитьТекстЯчейкиОбласти(Область, Сч, 5);
			
			Если Не ТипСправочникаЛогистика = Неопределено И Не ТипСправочникаИлиДокументаУС = Неопределено Тогда 
				
				Если Не ИмяКонфигурацииДляНКС = ПолучитьТекстЯчейкиОбласти(Область, Сч, 1) 
					Или Не ТипСправочникаЛогистика = ТипСправочникаЛогистикаИзМакета
					Или Не ТипСправочникаИлиДокументаУС = ТипСправочникаИлиДокументаУСИзМакета
					Тогда
					Продолжить;
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(ТипДокументаОснования) И Не ТипДокументаОснования = ТипДокументаОснованияИзМакета Тогда 
					Продолжить;	
				КонецЕсли;
				
				Если ЗначениеЗаполнено(РеквизитТитула) И Не Строка(РеквизитТитула) = РеквизитТитулаИзМакета Тогда 
					Продолжить;	
				КонецЕсли;
				
			КонецЕсли;
		
			НовоеПравило = ПравилаКонвертации.Добавить();
			
			НовоеПравило.ТипСправочникаЛогистика		= ТипСправочникаЛогистикаИзМакета;
			НовоеПравило.ТипСправочникаИлиДокументаУС	= ТипСправочникаИлиДокументаУСИзМакета;
			НовоеПравило.ТипДокументаОснования			= ТипДокументаОснованияИзМакета;
			НовоеПравило.РеквизитТитула					= РеквизитТитулаИзМакета;
			
			ИмяРеквизита = ПолучитьТекстЯчейкиОбласти(Область, Сч, 7); 
			
			НовоеПравило.РеквизитСправочникаЛогистика				= ИмяРеквизита;
			НовоеПравило.РеквизитСправочникаЛогистикаПредставление	= ПредставлениеПоИмениРеквизитаОбъектаМетеданных(ТипСправочникаЛогистикаИзМакета, ИмяРеквизита);
			НовоеПравило.РеквизитСправочникаЛогистикаТипЗначения	= ПолучитьТекстЯчейкиОбласти(Область, Сч, 8);
			НовоеПравило.РеквизитСправочникаЛогистикаКомментарий	= ПолучитьТекстЯчейкиОбласти(Область, Сч, 9);
			
			НовоеПравило.Картинка					= ПолучитьТекстЯчейкиОбласти(Область, Сч, 6);;

			НовоеПравило.КлючДопСвойстваРеквизита	= ПолучитьТекстЯчейкиОбласти(Область, Сч, 12);
			
			НовоеПравило.СпособМаппинга				= ЗначениеПеречисленияПоСтроке(Перечисления.КонтурЛогистика_СпособыМаппингаПоля, 
														ПолучитьТекстЯчейкиОбласти(Область, Сч, 10));
														
			НовоеПравило.СпособКонвертацииЗначения	= ЗначениеПеречисленияПоСтроке(Перечисления.КонтурЛогистика_СпособыКонвертации, 
														ПолучитьТекстЯчейкиОбласти(Область, Сч, 13));													
			Если НовоеПравило.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение Тогда 
				НовоеПравило.ВыражениеВычисленияСтрокаНеогр = ПолучитьТекстЯчейкиОбласти(Область, Сч, 11);
			Иначе
				НовоеПравило.ВыражениеВычисления			= ПолучитьТекстЯчейкиОбласти(Область, Сч, 11);
			КонецЕсли;
					
		КонецЦикла;
		
	КонецЦикла;
	
	Если ТипСправочникаЛогистика = "КонтурЛогистика_Сотрудники" Тогда
		НовоеПравило = ПравилаКонвертации.Добавить();
		НовоеПравило.РеквизитСправочникаЛогистика = "МожетПодписывать";
		НовоеПравило.РеквизитСправочникаЛогистикаПредставление = "Может подписывать";
		НовоеПравило.РеквизитСправочникаЛогистикаТипЗначения = "Булево";
		НовоеПравило.РеквизитСправочникаЛогистикаКомментарий = "По умолчанию равно истина";
		НовоеПравило.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять;
		НовоеПравило.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.БезДопОбработки;
		НовоеПравило.Картинка = 3;
		
		НовоеПравило = ПравилаКонвертации.Добавить();
		НовоеПравило.РеквизитСправочникаЛогистика = "МожетПередаватьНаПодпись";
		НовоеПравило.РеквизитСправочникаЛогистикаПредставление = "Может передавать на подпись";
		НовоеПравило.РеквизитСправочникаЛогистикаТипЗначения = "Булево";
		НовоеПравило.РеквизитСправочникаЛогистикаКомментарий = "По умолчанию равно ложь";
		НовоеПравило.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять;
		НовоеПравило.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.БезДопОбработки;
		НовоеПравило.Картинка = 3;
	КонецЕсли;
	
	Возврат ПравилаКонвертации;
	
КонецФункции

Функция ИзвлечьОбластиИзМакетов(ИмяКонфигурацииДляНКС) Экспорт
	
	ИзвлеченныеОбласти = Новый Массив;
	
	Если ИмяКонфигурацииДляНКС = "УФ_УТ" Тогда
		
		Макет = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ПолучитьМакет(ИмяКонфигурацииДляНКС);
		ИзвлеченныеОбласти.Добавить(Макет.ПолучитьОбласть(ИмяКонфигурацииДляНКС));
		
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой") Тогда
		
			Макет = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ПолучитьМакет("УФ_УТ_ГО_РТУ");
			ИзвлеченныеОбласти.Добавить(Макет.ПолучитьОбласть(ИмяКонфигурацииДляНКС));	
			
		ИначеЕсли НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками") Тогда
			
			Макет = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ПолучитьМакет("УФ_УТ_ГО_ТН");
			ИзвлеченныеОбласти.Добавить(Макет.ПолучитьОбласть(ИмяКонфигурацииДляНКС));
			
		Иначе
			
			Макет = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ПолучитьМакет("УФ_УТ_ГО_ТН_ЗнП");
			ИзвлеченныеОбласти.Добавить(Макет.ПолучитьОбласть(ИмяКонфигурацииДляНКС));
			
		КонецЕсли;
		
	Иначе
		
		Макет = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ПолучитьМакет(ИмяКонфигурацииДляНКС);
		ИзвлеченныеОбласти.Добавить(Макет.ПолучитьОбласть(ИмяКонфигурацииДляНКС));
		
	КонецЕсли;
	
	Возврат ИзвлеченныеОбласти;
		
КонецФункции

Функция ОписаниеСтандартныхРеквизитовСправочника(ИмяСправочника) Экспорт 
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьОписаниеРеквизитовСправочника(ИмяСправочника);		
	
КонецФункции

Функция ПолучитьТаблицуОписанияРеквизитовСправочника(ИмяСправочника) Экспорт 
	
	ТаблицаОписаниеРеквизитов = Новый ТаблицаЗначений;
	
	ТаблицаОписаниеРеквизитов.Колонки.Добавить("Имя", 			КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(100));
	ТаблицаОписаниеРеквизитов.Колонки.Добавить("Синоним", 		КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(200));
	ТаблицаОписаниеРеквизитов.Колонки.Добавить("Комментарий", 	КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(1000));
	ТаблицаОписаниеРеквизитов.Колонки.Добавить("Тип", 			КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(200));
		
	Для Каждого ОписаниеРеквизита Из Метаданные.Справочники[ИмяСправочника].Реквизиты Цикл 
		
		ЗаполнитьЗначенияСвойств(ТаблицаОписаниеРеквизитов.Добавить(), ОписаниеРеквизита);
		
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из Метаданные.Справочники[ИмяСправочника].СтандартныеРеквизиты Цикл 
		
		Если ОписаниеРеквизита.Имя = "Код" Или ОписаниеРеквизита.Имя = "Наименование" Тогда 
			
			ЗаполнитьЗначенияСвойств(ТаблицаОписаниеРеквизитов.Добавить(), ОписаниеРеквизита);
						
		КонецЕсли;
		
		Если ОписаниеРеквизита.Имя = "Владелец" И ИмяСправочника = "КонтурЛогистика_Лицензии" Тогда
			
			ЗаполнитьЗначенияСвойств(ТаблицаОписаниеРеквизитов.Добавить(), ОписаниеРеквизита);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаОписаниеРеквизитов.Сортировать("Синоним");
	
	Возврат ТаблицаОписаниеРеквизитов;
	
КонецФункции

Функция ПолучитьНастройкуПоУмолчаниюДляПоля(ТипСправочникаЛогистика, ТипСправочникаИлиДокументаУС, ИмяПоля, ТипДокументаОснования = Неопределено, РеквизитТитула = Неопределено) Экспорт 

	Настройка = Неопределено;
	
	ТаблицаНастроек = ТаблицаНастроекКонвертацииСправочников(ТипСправочникаЛогистика, ТипСправочникаИлиДокументаУС, ТипДокументаОснования, РеквизитТитула);
	
	Если ТаблицаНастроек.Количество() Тогда 
		
		НайденнаяНастройка = ТаблицаНастроек.НайтиСтроки(Новый Структура("РеквизитСправочникаЛогистика", ИмяПоля));
		
		Если НайденнаяНастройка.Количество() Тогда 
			
			Настройка = КонтурЛогистика_ОбщегоНазначенияСервер.СтрокаТаблицыЗначенийВСтруктуру_(НайденнаяНастройка[0]);
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	Возврат Настройка;

КонецФункции 

Функция ПолучитьНастройкуДляПоля(ИмяПоля, ТипЗначения = Неопределено) Экспорт 
	
	Настройка = Новый Структура;
	
	Если ЗначениеЗаполнено(ТипЗначения) Тогда
		Настройка.Вставить(ИмяПоля + "ТипЗначения", 	ТипЗначения);
	Иначе
		Настройка.Вставить(ИмяПоля + "ТипЗначения", 	"");
	КонецЕсли;
	
	Настройка.Вставить("СпособКонвертацииЗначения", ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыКонвертации.БезДопОбработки"));
	Настройка.Вставить("СпособМаппинга", 			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять"));
		
	Возврат Настройка;
	
КонецФункции

Функция ЗначениеПеречисленияПоСтроке(ПеречислениеМенеджер, ЗначениеСтрока) Экспорт 
	
	ЗначениеПеречисления = "";
	
	Если ЗначениеЗаполнено(ЗначениеСтрока) Тогда 
		
		ЗначениеПеречисления = ПеречислениеМенеджер[ЗначениеСтрока];
		
	КонецЕсли;	
	
	Возврат ЗначениеПеречисления;
	
КонецФункции

Функция ПредставлениеПоИмениРеквизитаОбъектаМетеданных(ИмяОбъектаМетаданных, ИмяРеквизита)
	
	Коллекции = Новый Массив;
	
	// он стандартный?
	СтандартныеРеквизиты = Метаданные.Справочники[ИмяОбъектаМетаданных].СтандартныеРеквизиты;
	Для Каждого СтандартныйРеквизит Из СтандартныеРеквизиты Цикл 
		
		Если СтандартныйРеквизит.Имя = ИмяРеквизита Тогда 
			Если ЗначениеЗаполнено(СтандартныйРеквизит.Синоним) Тогда
				Представление = СтандартныйРеквизит.Синоним;
			Иначе //Если не заполнен или нет синонима
				Представление = СтандартныйРеквизит.Имя;
			КонецЕсли;
			
			Возврат Представление;
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		
		Представление = Метаданные.Справочники[ИмяОбъектаМетаданных]["Реквизиты"][ИмяРеквизита].Синоним;
		
	Исключение
		
		Представление = "";
		
	КонецПопытки;
	
	
	Возврат Представление;
	
КонецФункции	

Функция ПолучитьТекстЯчейкиОбласти(Область, Строка, Колонка)
	
	Возврат Строка(Область.ПолучитьОбласть("R" + Формат(Строка, "ЧГ=0") + "C" + Формат(Колонка, "ЧГ=0")).ТекущаяОбласть.Текст);
	
КонецФункции

Функция ПолучитьНастройкуКонвертации(ТипСправочникаИлиДокументаУС, ТипСправочникаЛогистика, РеквизитТитула, ТолькоСОбновлениемРеквизитов = Ложь, ТолькоСРеквизитомТитула = Ложь) Экспорт 
	
	НастройкаКонвертации = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников
	|ГДЕ
	|	НЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаИлиДокументаУС = &ТипСправочникаИлиДокументаУС
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаЛогистика = &ТипСправочникаЛогистика
	|	И (КонтурЛогистика_НастройкиКонвертацииСправочников.РеквизитТитула = &РеквизитТитула
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииСправочников.РеквизитТитула = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников.ПустаяСсылка))
	|	И &ОбновлятьРеквизитыИзУчетнойСистемы
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.РеквизитТитула УБЫВ";
	
	Запрос.УстановитьПараметр("ТипСправочникаИлиДокументаУС", ТипСправочникаИлиДокументаУС);
	Запрос.УстановитьПараметр("ТипСправочникаЛогистика", ТипСправочникаЛогистика);
	
	ИмяПеречисления = ?(РеквизитТитула = "МестоВыгрузки", "МестоДоставки", РеквизитТитула);
	
	Если ЗначениеЗаполнено(ИмяПеречисления) Тогда
		Попытка
			ЗначениеПеречисленияРеквизитТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников." + ИмяПеречисления);
		Исключение
			ЗначениеПеречисленияРеквизитТитула = Неопределено;
		КонецПопытки;
	Иначе
		ЗначениеПеречисленияРеквизитТитула = Неопределено;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("РеквизитТитула", ЗначениеПеречисленияРеквизитТитула);

	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
		"&ОбновлятьРеквизитыИзУчетнойСистемы", 
		?(ТолькоСОбновлениемРеквизитов, "КонтурЛогистика_НастройкиКонвертацииСправочников.ОбновлятьРеквизитыИзУчетнойСистемы", "ИСТИНА"));
		
	Если ТолькоСРеквизитомТитула Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"КонтурЛогистика_НастройкиКонвертацииСправочников.РеквизитТитула = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников.ПустаяСсылка)", 
			"Ложь");
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда  	
		
		НастройкаКонвертации = Выборка.Ссылка;
		
	КонецЕсли;	
	
	Возврат НастройкаКонвертации;
	
КонецФункции	

Функция ПолучитьВсеНастройкиКонвертации() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.Ссылка КАК Ссылка,
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаЛогистика КАК ТипСправочникаЛогистика
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников
	|ГДЕ
	|	НЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Функция ПолучитьНастройкиКонвертацииПоТипуСправочникаЛогистики(ТипСправочникаЛогистика) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников
	|ГДЕ
	|	НЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаЛогистика = &ТипСправочникаЛогистика";
	
	Запрос.УстановитьПараметр("ТипСправочникаЛогистика", ТипСправочникаЛогистика); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
		
КонецФункции

Функция ПолучитьНастройкиКонвертацииСОбновлениемРеквизитов(ТипСправочникаИлиДокументаУС, ТипСправочникаЛогистика) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников
	|ГДЕ
	|	НЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаИлиДокументаУС = &ТипСправочникаИлиДокументаУС
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаЛогистика = &ТипСправочникаЛогистика
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.ОбновлятьРеквизитыИзУчетнойСистемы";
	
	Запрос.УстановитьПараметр("ТипСправочникаИлиДокументаУС", ТипСправочникаИлиДокументаУС);
	Запрос.УстановитьПараметр("ТипСправочникаЛогистика", ТипСправочникаЛогистика);
				
	НастройкиКонвертации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат НастройкиКонвертации;
	
КонецФункции

Функция ЗаполнитьАвтоматическиДляТекущейКонфигурации() Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	ТаблицаНастроек = ТаблицаНастроекКонвертацииСправочников();
	
	ВариантыНастроек = ТаблицаНастроек.Скопировать(, "ТипСправочникаЛогистика, ТипСправочникаИлиДокументаУС, ТипДокументаОснования, РеквизитТитула");
	ВариантыНастроек.Свернуть("ТипСправочникаЛогистика, ТипСправочникаИлиДокументаУС, ТипДокументаОснования, РеквизитТитула");
		
	Если ЗначениеЗаполнено(ВариантыНастроек) Тогда 
	
		Для Каждого ВариантНастройки Из ВариантыНастроек Цикл 
		
			КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
			
			Попытка
				
				// Создадим новую настройку конвертации
				ИмяПеречисления = ?(ВариантНастройки.РеквизитТитула = "МестоВыгрузки", "МестоДоставки",
					ВариантНастройки.РеквизитТитула);
				
				НоваяНастройка = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НоваяНастройка, ВариантНастройки);
				
				Если ЗначениеЗаполнено(ИмяПеречисления) Тогда
					НоваяНастройка.РеквизитТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников." + ИмяПеречисления);
				Иначе
					НоваяНастройка.РеквизитТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников.ПустаяСсылка");
				КонецЕсли;
				
				НоваяНастройка.Наименование = "Конвертация из " + НоваяНастройка.ТипСправочникаИлиДокументаУС + 
				" в " + НоваяНастройка.ТипСправочникаЛогистика +
				?(ЗначениеЗаполнено(НоваяНастройка.РеквизитТитула), " реквизит " + НоваяНастройка.РеквизитТитула, "");
				
				Отбор = Новый Структура;
				Отбор.Вставить("ТипСправочникаИлиДокументаУС", 	ВариантНастройки.ТипСправочникаИлиДокументаУС);
				Отбор.Вставить("ТипСправочникаЛогистика", 		ВариантНастройки.ТипСправочникаЛогистика);
				Отбор.Вставить("ТипДокументаОснования", 		ВариантНастройки.ТипДокументаОснования);
				Отбор.Вставить("РеквизитТитула", 				ВариантНастройки.РеквизитТитула);
				
				НайденныеПравила = ТаблицаНастроек.НайтиСтроки(Отбор);
				
				Для Каждого Правило Из НайденныеПравила Цикл 
					
					Если Правило.РеквизитСправочникаЛогистика = "Код" 
						Или Правило.РеквизитСправочникаЛогистика = "Наименование" Тогда 
						Продолжить;
					КонецЕсли;
					
					НовоеПравило = НоваяНастройка.ПравилаКонвертации.Добавить();
					ЗаполнитьЗначенияСвойств(НовоеПравило, Правило);
					
					ОбработатьФиксированноеЗначение(НовоеПравило, Правило);
					
				КонецЦикла;
				
				НоваяНастройка.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
				
				НоваяНастройка.Записать();
				
				// включим автоконвертацию
				ИмяПредопределенного = "Автоконвертация_" + ВариантНастройки.ТипСправочникаЛогистика;
				Справочники.КонтурЛогистика_Настройки.УстановитьНастройку(ИмяПредопределенного, Истина);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				Результат.Успешно = Ложь;
				Результат.ОписаниеОшибки = "Не удалось заполнить настройки конвертации справочников для текущей конфигурации. Создайте их вручную.";
				
			КонецПопытки;
			
		КонецЦикла;	
	
		Результат.Успешно = Истина;
		
	Иначе
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Для текущей конфигурации настройки конвертации справочников по умолчанию не найдены. Создайте их вручную."
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьФиксированноеЗначение(Знач НовоеПравило, Знач Правило)
		
	Перем ВычисленноеЗначение;
	
	КолонкаТипЗначения 	= "РеквизитСправочникаЛогистикаТипЗначения";
	
	Если Правило.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ФиксированноеЗначение Тогда 
			
		Если Правило[КолонкаТипЗначения] = "Число" Тогда 
			ВычисленноеЗначение = Число(Правило.ВыражениеВычисления);
		ИначеЕсли Правило[КолонкаТипЗначения] = "Строка" Тогда
			ВычисленноеЗначение = Строка(Правило.ВыражениеВычисления);            
		ИначеЕсли Правило[КолонкаТипЗначения] = "Булево" Тогда
			ВычисленноеЗначение = Булево(Правило.ВыражениеВычисления);
		ИначеЕсли Правило[КолонкаТипЗначения] = "Дата" Тогда	
			ВычисленноеЗначение = Дата(Правило.ВыражениеВычисления);
		Иначе  
			
			Попытка
				Параметры = Новый Структура;
				Параметры.Вставить("Правило", Правило);
				
				ВычисленноеЗначение = КонтурЛогистика_ОбщегоНазначенияСервер.ВычислитьЗначениеВБезопасномРежиме(
					Правило.ВыражениеВычисления, Параметры);
			Исключение 
				Сообщить("Проблема с установкой правила конвертации: " + Правило.РеквизитСправочникаЛогистика + " - " + ОписаниеОшибки()); 
			КонецПопытки;  
			
		КонецЕсли;
		
		НовоеПравило.ВыражениеВычисления = ВычисленноеЗначение;

	КонецЕсли
	
КонецПроцедуры

Функция ЗаполнитьТекущуюНастройкуЗначениямиПоУмолчанию(НастройкаКонвСправОбъект, ИмяМакета = Неопределено, ИмяКонфигурации = Неопределено, ЭтоНовый = Истина) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	ТаблицаДефолтныхНастроек = ПолучитьТаблицуОписанияРеквизитовСправочника(НастройкаКонвСправОбъект.ТипСправочникаЛогистика);
	
	ТаблицаНастроек = ТаблицаНастроекКонвертацииСправочников(НастройкаКонвСправОбъект.ТипСправочникаЛогистика,
															НастройкаКонвСправОбъект.ТипСправочникаИлиДокументаУС,
															НастройкаКонвСправОбъект.ТипДокументаОснования,
															Строка(НастройкаКонвСправОбъект.РеквизитТитула),
															ИмяМакета,
															ИмяКонфигурации);
	
	ВариантыНастроек = ТаблицаНастроек.Скопировать(, "ТипСправочникаЛогистика, ТипСправочникаИлиДокументаУС, ТипДокументаОснования, РеквизитТитула");
	ВариантыНастроек.Свернуть("ТипСправочникаЛогистика, ТипСправочникаИлиДокументаУС, ТипДокументаОснования, РеквизитТитула");
	
	Если ВариантыНастроек.Количество() = 0 Тогда
		
		Результат.ОписаниеОшибки = "В макете не найдена дефолтная настройка конвертации по: ТипСправочникаЛогистика, ТипСправочникаИлиДокументаУС, ТипДокументаОснования, РеквизитТитула";
		Результат.Успешно = Ложь;
		
	Иначе
		
		Если ЭтоНовый Тогда
		
			ВариантНастройки = ВариантыНастроек[0];	
			ЗаполнитьЗначенияСвойств(НастройкаКонвСправОбъект, ВариантНастройки);
			
			ИмяПеречисления = ?(ВариантНастройки.РеквизитТитула = "МестоВыгрузки", "МестоДоставки", ВариантНастройки.РеквизитТитула);
			
			НастройкаКонвСправОбъект.Наименование = "Конвертация из " + НастройкаКонвСправОбъект.ТипСправочникаИлиДокументаУС + " в " + НастройкаКонвСправОбъект.ТипСправочникаЛогистика;
			Если ЗначениеЗаполнено(ИмяПеречисления) Тогда
				НастройкаКонвСправОбъект.РеквизитТитула = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников." + ИмяПеречисления);
			КонецЕсли;
			
			НастройкаКонвСправОбъект.ПравилаКонвертации.Очистить();
			
			Для Каждого Правило Из ТаблицаНастроек Цикл 
				
				Если Правило.РеквизитСправочникаЛогистика = "Код" 
					Или Правило.РеквизитСправочникаЛогистика = "Наименование" Тогда 
					Продолжить;
				КонецЕсли;
				
				НовоеПравило = НастройкаКонвСправОбъект.ПравилаКонвертации.Добавить();	
				ЗаполнитьЗначенияСвойств(НовоеПравило, Правило);
				
				Если Не ЗначениеЗаполнено(НовоеПравило.РеквизитСправочникаЛогистикаКомментарий) Тогда 
					
					НайденнаяСтркаСКомментариемДефолта = ТаблицаДефолтныхНастроек.Найти(НовоеПравило.РеквизитСправочникаЛогистика, "Имя");
					Если НайденнаяСтркаСКомментариемДефолта <> Неопределено
						И ЗначениеЗаполнено(НайденнаяСтркаСКомментариемДефолта.Комментарий) Тогда 
						НовоеПравило.РеквизитСправочникаЛогистикаКомментарий = НайденнаяСтркаСКомментариемДефолта.Комментарий;
					КонецЕсли;
					
				КонецЕсли;
				
				ОбработатьФиксированноеЗначение(НовоеПравило, Правило);
				
			КонецЦикла;	
			
			Результат.Успешно = Истина;
			
		Иначе
			
			Для Каждого Правило Из ТаблицаНастроек Цикл
			
				НайденныеПравила = НастройкаКонвСправОбъект.ПравилаКонвертации.НайтиСтроки(Новый Структура("РеквизитСправочникаЛогистика", Правило.РеквизитСправочникаЛогистика));
				Если НайденныеПравила.Количество() Тогда 
						
					НовоеПравило = НайденныеПравила[0];
					ЗаполнитьЗначенияСвойств(НовоеПравило, Правило);
						
				КонецЕсли;
					
			КонецЦикла;
				
			Результат.Успешно = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция УдалитьВсеНастройки() Экспорт 
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
	
		Выборка = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.Выбрать();
		Пока Выборка.Следующий() Цикл 
			
			Если Не Выборка.ПометкаУдаления Тогда 
								
				НастройкаОбъект = Выборка.ПолучитьОбъект();
				НастройкаОбъект.УстановитьПометкуУдаления(Истина);
				
			КонецЕсли;	
			
		КонецЦикла;	
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Не удалось удалить настройки конвертации справочников.";	
		
	КонецПопытки;

	Возврат Результат;
	
КонецФункции
	
Функция НастройкиВыполнены() Экспорт 
	
	НастроекВключено = 0 +
	+ Число(Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("Автоконвертация_КонтурЛогистика_Договоры"))
	+ Число(Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("Автоконвертация_КонтурЛогистика_Лицензии"))
	+ Число(Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("Автоконвертация_КонтурЛогистика_ОрганизацииДиадок"))
	+ Число(Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("Автоконвертация_КонтурЛогистика_ПодразделенияДиадок"))
	+ Число(Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("Автоконвертация_КонтурЛогистика_ПунктыМаршрута"))
	+ Число(Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("Автоконвертация_КонтурЛогистика_Сотрудники"))
	+ Число(Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("Автоконвертация_КонтурЛогистика_ТранспортныеСредства"));
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаЛогистика) КАК Количество
	               |ИЗ
	               |	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников
	               |ГДЕ
	               |	НЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Количество >= НастроекВключено;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции 
