
&НаКлиенте
Перем _ЯдроНаКлиенте;

&НаКлиенте
Перем _Платформа;

&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _МодульСМВ;


&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	Возврат ЭтаФорма;
КонецФункции

&НаКлиенте
Процедура ИнициализироватьМодуль(Модуль_ЯдроНаКлиенте, Модуль_Платформа) Экспорт
	
	_ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте;
	_Платформа = Модуль_Платформа;
	
КонецПроцедуры

&НаКлиенте
Функция  Модуль_ЯдроНаКлиенте() Экспорт
	
	Возврат _ЯдроНаКлиенте;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеРаботыМодуля() Экспорт
	
	_ЯдроНаКлиенте = Неопределено;
	_Платформа = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуТитулаДокумента(ПараметрыФормы, ФормаВладелец, ОписаниеОповещения = Неопределено) Экспорт
	
	Если ПараметрыФормы.ВидПакетаID = ИдентификаторПакетаЭТрН() Тогда
		
		ДокументыОснования = Новый Массив;
		Если ПараметрыФормы.Свойство("Документ") Тогда
			ДокументыОснования.Добавить(ПараметрыФормы.Документ);
		ИначеЕсли ПараметрыФормы.Свойство("ДокументыОснования") Тогда
			ДокументыОснования = ПараметрыФормы.ДокументыОснования;	
		КонецЕсли;
				
		ПараметрыФормыРедактированияЭТрН = Новый Структура;
		ПараметрыФормыРедактированияЭТрН.Вставить("ДокументыОснования", ДокументыОснования);
		ПараметрыФормыРедактированияЭТрН.Вставить("ОбщийКонтекстКлиентСервер", ФормаВладелец.Объект.ОбщийКонтекстКлиентСервер);
 		ПараметрыФормыРедактированияЭТрН.Вставить("СтрокаСписка", ПараметрыФормы.СтрокаСписка);
		Если ПараметрыФормы.Свойство("Сценарий") Тогда
 			ПараметрыФормыРедактированияЭТрН.Вставить("Сценарий", ПараметрыФормы.Сценарий);
		КонецЕсли;

		ОткрытьФормуРедактированияЭТрН(ПараметрыФормыРедактированияЭТрН, ФормаВладелец, ОписаниеОповещения);
		
	ИначеЕсли ПараметрыФормы.ВидПакетаID = ИдентификаторПакетаЗаказЗаявка() Тогда
		
		ДокументыОснования = Новый Массив;
		Если ПараметрыФормы.Свойство("Документ") Тогда
			ДокументыОснования.Добавить(ПараметрыФормы.Документ);
		ИначеЕсли ПараметрыФормы.Свойство("ДокументыОснования") Тогда
			ДокументыОснования = ПараметрыФормы.ДокументыОснования;	
		КонецЕсли;
				
		ПараметрыФормыРедактированияЭЗЗ = Новый Структура;
		ПараметрыФормыРедактированияЭЗЗ.Вставить("ДокументыОснования", ДокументыОснования);
		ПараметрыФормыРедактированияЭЗЗ.Вставить("ОбщийКонтекстКлиентСервер", ФормаВладелец.Объект.ОбщийКонтекстКлиентСервер);
 		ПараметрыФормыРедактированияЭЗЗ.Вставить("СтрокаСписка", ПараметрыФормы.СтрокаСписка);

		ОткрытьФормуРедактированияЭЗЗ(ПараметрыФормыРедактированияЭЗЗ, ФормаВладелец, ОписаниеОповещения);
		
	ИначеЕсли ПараметрыФормы.ВидПакетаID = ИдентификаторПакетаЭПЭ() Тогда
		
		ДокументыОснования = Новый Массив;
		Если ПараметрыФормы.Свойство("Документ") Тогда
			ДокументыОснования.Добавить(ПараметрыФормы.Документ);
		ИначеЕсли ПараметрыФормы.Свойство("ДокументыОснования") Тогда
			ДокументыОснования = ПараметрыФормы.ДокументыОснования;	
		КонецЕсли;
				
		ПараметрыФормыРедактированияЭПЭ = Новый Структура;
		ПараметрыФормыРедактированияЭПЭ.Вставить("ДокументыОснования", ДокументыОснования);
		ПараметрыФормыРедактированияЭПЭ.Вставить("ОбщийКонтекстКлиентСервер", ФормаВладелец.Объект.ОбщийКонтекстКлиентСервер);
 		ПараметрыФормыРедактированияЭПЭ.Вставить("СтрокаСписка", ПараметрыФормы.СтрокаСписка);

		ОткрытьФормуРедактированияЭПЭ(ПараметрыФормыРедактированияЭПЭ, ФормаВладелец, ОписаниеОповещения);

	Иначе
		
		ВызватьИсключение "При открытии формы титула перевозочного документа не укзан ВидПакетаID.";

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЭТрН_Титул3(ПараметрыФормы, ФормаВладелец, ОписаниеОповещения) Экспорт
	
	ИмяФормыДляОткрытия = "ФормаЭТрН_Титул3";
	
	ПараметрыФормы.Вставить("ОбщийКонтекстКлиентСервер", ФормаВладелец.Объект.ОбщийКонтекстКлиентСервер);
	
	ФормаОбработки = ПолучитьФормуОбработки(ИмяФормыДляОткрытия, ПараметрыФормы, ФормаВладелец);
	ФормаОбработки.ИнициализироватьФорму(ЭтаФорма, _Платформа);
	ФормаОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаОбработки.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	
	ФормаОбработки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияЭТрН(ПараметрыФормы, ФормаВладелец, ОписаниеОповещения) Экспорт
	
 	ИмяФормыДляОткрытия = "ФормаТрН";

	ФормаОбработки = ПолучитьФормуОбработки(ИмяФормыДляОткрытия, ПараметрыФормы, ФормаВладелец);
	ФормаОбработки.ИнициализироватьФорму(ЭтаФорма, _Платформа);
	ФормаОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаОбработки.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	
	ФормаОбработки.Открыть();
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияЭЗЗ(ПараметрыФормы, ФормаВладелец, ОписаниеОповещения) Экспорт
	
 	ИмяФормыДляОткрытия = "ФормаЗЗ";

	ФормаОбработки = ПолучитьФормуОбработки(ИмяФормыДляОткрытия, ПараметрыФормы, ФормаВладелец);
	ФормаОбработки.ИнициализироватьФорму(ЭтаФорма, _Платформа);
	ФормаОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаОбработки.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	
	ФормаОбработки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияЭПЭ(ПараметрыФормы, ФормаВладелец, ОписаниеОповещения) Экспорт
	
 	ИмяФормыДляОткрытия = "ФормаПЭ";

	ФормаОбработки = ПолучитьФормуОбработки(ИмяФормыДляОткрытия, ПараметрыФормы, ФормаВладелец);
	ФормаОбработки.ИнициализироватьФорму(ЭтаФорма, _Платформа);
	ФормаОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаОбработки.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	
	ФормаОбработки.Открыть();
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораДокументов(ПараметрыФормы, ФормаВладелец, ОписаниеОповещения) Экспорт
		
	ИмяФормыДляОткрытия = "ФормаПодбораДокументов"; 
	
	ПараметрыФормыПодбораДокументов = Новый Структура;
	
	Если ПараметрыФормы.Свойство("ОтборПоКонтрагенту") Тогда
		ПараметрыФормыПодбораДокументов.Вставить("ОтборПоКонтрагенту", ПараметрыФормы.ОтборПоКонтрагенту);
	КонецЕсли;
	Если ПараметрыФормы.Свойство("ОтборПоОрганизации") Тогда
		ПараметрыФормыПодбораДокументов.Вставить("ОтборПоОрганизации", ПараметрыФормы.ОтборПоОрганизации);
	КонецЕсли;
	Если ПараметрыФормы.Свойство("ДокументыОснования") Тогда
		ПараметрыФормыПодбораДокументов.Вставить("ДокументыОснования", ПараметрыФормы.ДокументыОснования);
	КонецЕсли;
	Если ПараметрыФормы.Свойство("РежимПодбораИзЭТрН") Тогда
		ПараметрыФормыПодбораДокументов.Вставить("РежимПодбораИзЭТрН", ПараметрыФормы.РежимПодбораИзЭТрН);
	КонецЕсли;
	Если ПараметрыФормы.Свойство("РежимПодбораИзЗЗ") Тогда
		ПараметрыФормыПодбораДокументов.Вставить("РежимПодбораИзЗЗ", ПараметрыФормы.РежимПодбораИзЗЗ);
	КонецЕсли;
	Если ПараметрыФормы.Свойство("РежимПодбораИзЭПЭ") Тогда
		ПараметрыФормыПодбораДокументов.Вставить("РежимПодбораИзЭПЭ", ПараметрыФормы.РежимПодбораИзЭПЭ);
	КонецЕсли;
	Если ПараметрыФормы.Свойство("Период") Тогда
		ПараметрыФормыПодбораДокументов.Вставить("Период", ПараметрыФормы.Период);
	КонецЕсли;
	Если ПараметрыФормы.Свойство("СтрокаСписка") Тогда
		ПараметрыФормыПодбораДокументов.Вставить("СтрокаСписка", ПараметрыФормы.СтрокаСписка);
	КонецЕсли;
	Если ФормаВладелец.Объект.Свойство("ОбщийКонтекстКлиентСервер") Тогда
		ПараметрыФормыПодбораДокументов.Вставить("ОбщийКонтекстКлиентСервер", ФормаВладелец.Объект.ОбщийКонтекстКлиентСервер);
	КонецЕсли;

	ФормаОбработки = ПолучитьФормуОбработки(ИмяФормыДляОткрытия, ПараметрыФормыПодбораДокументов, ФормаВладелец);
	ФормаОбработки.ИнициализироватьФорму(ЭтаФорма, _Платформа);
	ФормаОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаОбработки.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	
	ФормаОбработки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораНастройкиДокументов(ПараметрыФормы, ФормаВладелец, ОписаниеОповещения) Экспорт
		
	ИмяФормыДляОткрытия = "ФормаНастройкиПодбораДокументов";

	ФормаОбработки = ПолучитьФормуОбработки(ИмяФормыДляОткрытия, ПараметрыФормы, ФормаВладелец);
	ФормаОбработки.ИнициализироватьФорму(ЭтаФорма);
	ФормаОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаОбработки.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	
	ФормаОбработки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСценария(ПараметрыФормы, ФормаВладелец, ОписаниеОповещения) Экспорт
	
 	ИмяФормыДляОткрытия = "ФормаВыбораСценария";
	
	ПараметрыФормы.Вставить("ТекущийСценарий", СценарийПоУмолчанию());

	ФормаОбработки = ПолучитьФормуОбработки(ИмяФормыДляОткрытия, ПараметрыФормы, ФормаВладелец);
	ФормаОбработки.ИнициализироватьФорму(ЭтаФорма);
	ФормаОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаОбработки.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	
	ФормаОбработки.Открыть();
		
КонецПроцедуры

&НаСервере
Функция СценарийПоУмолчанию()

	МодульОбъекта = ОбработкаОбъект();
	СценарийПоУмолчанию = МодульОбъекта.ВосстановитьНастройки("Сценарий").Настройки;
    Возврат ?(СценарийПоУмолчанию = Неопределено, МодульОбъекта.СценарийПростаяОтгрузка(), СценарийПоУмолчанию);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуПоИмени(ИмяФормыДляОткрытия, ПараметрыФормы, ФормаВладелец, ОписаниеОповещения) Экспорт
		
	ФормаОбработки = ПолучитьФормуОбработки(ИмяФормыДляОткрытия, ПараметрыФормы, ФормаВладелец);
	ФормаОбработки.ИнициализироватьФорму(ЭтаФорма);
	ФормаОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаОбработки.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	
	ФормаОбработки.Открыть();

КонецПроцедуры

&НаКлиенте
Функция ПолучитьФормуОбработки(ИмяФормыДляОткрытия, ПараметрыФормы, ФормаВладелец)
	
	ПолноеИмяОткрываемойФормы = ПолноеИмяОткрываемойФормы(ИмяФормыДляОткрытия);
	
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ФормаОбработки = ПолучитьФорму(ПолноеИмяОткрываемойФормы, ПараметрыФормы, ФормаВладелец);
	
	Возврат ФормаОбработки;
	
КонецФункции

&НаКлиенте
Функция ПолноеИмяОткрываемойФормы(ИмяФормыДляОткрытия)
	
	ПолноеИмяТекущейФормы = ЭтаФорма.ИмяФормы;
	КраткоеИмяТекущейФормы = "КлиентскиеВызовы";
	
	Результат = СтрЗаменить(ПолноеИмяТекущейФормы, КраткоеИмяТекущейФормы, ИмяФормыДляОткрытия);
	
	Возврат Результат;

КонецФункции

// Выполняет обработку события модуля объекта, в котором требуется использовать серверный контекст Ядра
//
// Параметры:
//  ИмяСобытия	 - Строка		- Имя события модуля объекта
//  Параметры	 - Структура	- Параметры для обработчика события
// 
// Возвращаемое значение:
//  Произвольный - Результат выполнения метода модуля объекта, который является обработчиком для события
//
&НаКлиенте
Функция ОбработатьСобытие(ИмяСобытия, Параметры) Экспорт
	
	Результат = _ЯдроНаКлиенте.ПеревозочныеДокументы_ОбработатьСобытие(ИмяСобытия, Параметры);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИдентификаторПакетаЭТрН() Экспорт
	
	Возврат "ID_Перевозочные_ЭТрН";
	
КонецФункции

&НаКлиенте
Функция ИдентификаторПакетаЗаказЗаявка() Экспорт
	
	Возврат "ID_Перевозочные_ЗаказЗаявка";
	
КонецФункции 

&НаКлиенте
Функция ИдентификаторПакетаЭПЭ() Экспорт
	
	Возврат "ID_Перевозочные_ЭПЭ";
	
КонецФункции


&НаКлиенте
Процедура ОткрытьПредложениеСопоставления(ОписаниеЗакрытияФормы, ТипУчастника) Экспорт
	
	_Платформа.ПоказатьПредупреждениеВыбранныйУчастникЛогистическогоЭДОНеСопоставлен(
		ТипУчастника,
		ОписаниеЗакрытияФормы
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСопоставление(Организация, Контрагент, ОписаниеЗакрытияФормы) Экспорт
	
	_Платформа.ПоказатьФормуСопоставленияКонтрагента(
		Контрагент,
		Организация,
		ОписаниеЗакрытияФормы
	);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСопоставлениеСОрганизациейДиадок(СопоставляемыйУчастникЭДО, ОповещенияПослеСопоставления) Экспорт
	
	СписокОрганизаций = СписокОрганизацийДляСопоставления();
	СписокПустой = СписокОрганизаций.Количество() = 0;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СопоставляемыйУчастникЭДО", СопоставляемыйУчастникЭДО);
	ДополнительныеПараметры.Вставить("ОповещенияПослеСопоставления", ОповещенияПослеСопоставления);
	
	ОповещениеПослеВыбораОрганизацииДиадок = _Платформа.НовыйОписаниеОповещения(
		"СопоставлениеСОрганизациейДиадок",
		ЭтаФорма,
		ДополнительныеПараметры
	);
	
	Если СписокПустой Тогда
		
		_Платформа.ВыполнитьОбработкуОповещенияЛок(ОповещенияПослеСопоставления, КодВозвратаДиалога.Да);
		
	ИначеЕсли СписокОрганизаций.Количество() = 1 Тогда
		
		ВыбранныйЭлемент = СписокОрганизаций[0];
		_Платформа.ВыполнитьОбработкуОповещенияЛок(ОповещениеПослеВыбораОрганизацииДиадок, ВыбранныйЭлемент);
		
	Иначе
		
		ЗаголовокВыбораОрганизации = НСтр("ru = 'Выберите организацию Диадок'");
		_Платформа.ПоказатьВыборЭлемента(СписокОрганизаций, ОповещениеПослеВыбораОрганизацииДиадок, ЗаголовокВыбораОрганизации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуСИнформациейОМодулеЛогистики() Экспорт
	
	АдресСИнформацией = "https://kontur.ru/lp/logistika-diadoc-modul1c";
	
	// BSLLS:UsingSynchronousCalls-off
	ЗапуститьПриложение(АдресСИнформацией);
	// BSLLS:UsingSynchronousCalls-on
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Модуль = ОбработкаОбъект();
	ПутьКФормам = Модуль.Метаданные().ПолноеИмя() + ".Форма.";

КонецПроцедуры

//{ Служебные процедуры и функции

&Наклиенте
Функция СписокОрганизацийДляСопоставления()
	
	ДобавитьНеоплаченные = Ложь;
	Ядро = Модуль_ЯдроНаКлиенте();
	Результат = Ядро.Организации_СписокОрганизацийДляВыбора(ДобавитьНеоплаченные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СопоставлениеСОрганизациейДиадок(ОрганизацияДиадок, ДополнительныеПараметры) Экспорт
	
	Если ОрганизацияДиадок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	ОрганизацияДиадокBoxId = ОрганизацияДиадок.Значение;
	ОрганизацияДиадок = Ядро.Организации_ЗаполненныеРеквизитыПоBoxId(ОрганизацияДиадокBoxId);
	
	СопоставляемыеОрганизации = Новый Массив;
	
	Если ЗначениеЗаполнено(ОрганизацияДиадок.СвязанныйСправочник1) Тогда
		
		СопоставленныеОрганизации = Ядро.Организации_СопоставленныеВ1СПоBoxId(ОрганизацияДиадокBoxId);
		
		Для Счетчик = 0 По СопоставленныеОрганизации.ВГраница() Цикл
			СопоставляемыеОрганизации.Добавить(СопоставленныеОрганизации[Счетчик]);
		КонецЦикла;
		
	КонецЕсли;
	
	Если СопоставляемыеОрганизации.Найти(ДополнительныеПараметры.СопоставляемыйУчастникЭДО) = Неопределено Тогда
		СопоставляемыеОрганизации.Добавить(ДополнительныеПараметры.СопоставляемыйУчастникЭДО);
	Иначе
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("СвязанныеСправочники", СопоставляемыеОрганизации);
	
	Ядро.Организации_ОбновлениеРеквизитов(ОрганизацияДиадок, СтруктураРеквизитов);
	
	_Платформа.ВыполнитьОбработкуОповещенияЛок(
		ДополнительныеПараметры.ОповещенияПослеСопоставления,
		КодВозвратаДиалога.Да
	);
	
КонецПроцедуры

//} Служебные процедуры и функции


&НаКлиенте
Процедура Метрика_ДобавитьПоведение_НажатиеКнопки(
	НаименованиеФормы,
	ДействиеМетрики,
	ПредставлениеМетрики = "") Экспорт
	
	НазваниеМетки = "";
	КатегорияМетрики = Метрика_НазваниеКатегории().Перевозочные;
	
	_ЯдроНаКлиенте.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НаименованиеФормы,
		КатегорияМетрики,
		ДействиеМетрики,
		НазваниеМетки,
		ПредставлениеМетрики
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ПоКонтексту(ДействиеМетрики, ДопПеременные = Неопределено, Представление = "", ЛокальныйTraceId = "") Экспорт
	
	КатегорияМетрики = Метрика_НазваниеКатегории().Перевозочные;
	
	_ЯдроНаКлиенте.Метрика_ДобавитьСтатистику_ПоКонтексту(
		КатегорияМетрики,
		ДействиеМетрики,
		,
		ДопПеременные,
		Представление,
		ЛокальныйTraceId
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Метрика_ДобавитьСтатистику_ДляОрганизации(BoxId,
													ДействиеМетрики,
													ДопПеременные = Неопределено,
													ПредставлениеМетрики = "",
													TraceId = "") Экспорт
	
	КатегорияМетрики = Метрика_НазваниеКатегории().Перевозочные;
	
	_ЯдроНаКлиенте.Метрика_ДобавитьСтатистику_ДляОрганизации(
		BoxId,
		КатегорияМетрики,
		ДействиеМетрики,
		,
		ДопПеременные,
		ПредставлениеМетрики,
		TraceId
	);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеДействий() Экспорт
	
	Результат = _ЯдроНаКлиенте.Метрика_НазваниеДействий();
	
	Возврат Результат;
	
Конецфункции

&НаКлиенте
Функция Метрика_НазваниеКатегории() Экспорт
	
	Результат = _ЯдроНаКлиенте.Метрика_НазваниеКатегории();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Метрика_КлючИдентификатораПеревозочногоДокумента() Экспорт
	
	Возврат "Id перевозочного документа";
	
КонецФункции

&НаКлиенте
Функция Метрика_КлючОшибки() Экспорт
	
	Возврат "Ошибки";
	
КонецФункции

&НаКлиенте
Функция Метрика_КлючКоличествоОшибокДо() Экспорт
	
	Возврат "Количество ошибок до";
	
КонецФункции

&НаКлиенте
Функция Метрика_КлючКоличествоОшибокПосле() Экспорт
	
	Возврат "Количество ошибок после";
	
КонецФункции

&НаКлиенте
Функция Метрика_КлючОшибкиПосле() Экспорт
	
	Возврат "Ошибки после";
	
КонецФункции

&НаКлиенте
Функция Метрика_КлючBoxIDГО() Экспорт
	
	Возврат "BoxID ГО";
	
КонецФункции

&НаКлиенте
Функция Метрика_КлючBoxIDГП() Экспорт
	
	Возврат "BoxID ГП";
	
КонецФункции

&НаКлиенте
Функция Метрика_КлючBoxIDПРВ() Экспорт
	
	Возврат "BoxID ПРВ";
	
КонецФункции

&НаКлиенте
Функция Контракт_СтруктураУчастника(Участник, ЭтоГрузоотправитель) Экспорт

	СтруктураУчастника = Новый Структура();
	СтруктураУчастника.Вставить("Участник", Участник);
	СтруктураУчастника.Вставить("ЭтоГрузоотправитель", ЭтоГрузоотправитель);
	СтруктураУчастника.Вставить("Идентификатор", "");
	
	Возврат СтруктураУчастника;
	
КонецФункции
