////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Универсальные механизмы библиотек интеграции с государственными информационными системами:
//  * ЕГАИС,
//  * ГИСМ,
//  * ВетИС,
//  * ИСМП
// Состав модуля:
//
//  * Функции работы с прикладными документами (вывод привязки библиотечных документов, оповещений итп).
//  * Общие функции проведения документов.
//  * Общие функции для работы с протоколом обмена (Присоединенные файлы)
//  * Функции общего назначения.
//

#Область ПрограммныйИнтерфейс

// Возвращает таблицу значений на основании массива структур
// 
// Параметры:
//	МассивСтруктур - Массив Из Структура - Массив структур, которые будут преобразованы в таблиц значений.
//										   Свойства структуры первого элемента массива определяют состав колонок результирующей таблицы.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица значений, созданная из массива структур.
// 
Функция МассивВТаблицуЗначений(МассивСтруктур) Экспорт
	Таблица = Новый ТаблицаЗначений;
	// Создадим колонки по первой структуре массива
	Если ТипЗнч(МассивСтруктур) = Тип("Массив")
		И МассивСтруктур.Количество() <> 0 Тогда
		ПерваяСтруктура = МассивСтруктур[0];
		Для Каждого Свойство Из ПерваяСтруктура Цикл 
			Таблица.Колонки.Добавить(Свойство.Ключ, ОписаниеТиповПоТипу(ТипЗнч(Свойство.Значение)));
		КонецЦикла;
		
		Для Каждого Структура Из МассивСтруктур Цикл 
			НоваяСтрока = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Структура);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

// Возвращает массив/список значений пустых значений составного типа, включая Неопределено
// 
// Параметры:
// 	ВходящееОписаниеТипа - ОписаниеТипов - Описание типов метаданного для получения типов.
// 	ВозвращатьСписокЗначений - Булево - Выбор возвращаемого значения Масси или СписокЗначений.
// Возвращаемое значение:
// 	Массив, СписокЗначений - коллекция пустых значений составного типа.
//
Функция МассивПустыхЗначенийСоставногоТипа(ВходящееОписаниеТипа, ВозвращатьСписокЗначений=Ложь) Экспорт
	
	МассивТипов = Новый Массив;
	
	Для Каждого ЭлементТип Из ВходящееОписаниеТипа.Типы() Цикл
		МассивТиповПоЭлементу = Новый Массив;
		МассивТиповПоЭлементу.Добавить(ЭлементТип);
		ОписаниеТипаПоЭлементу = Новый ОписаниеТипов(МассивТиповПоЭлементу);
		МассивТипов.Добавить(ОписаниеТипаПоЭлементу.ПривестиЗначение(Неопределено));
	КонецЦикла;
	
	Если МассивТипов.Найти(Неопределено) = Неопределено Тогда
		МассивТипов.Добавить(Неопределено);
	КонецЕсли;
	
	Если ВозвращатьСписокЗначений Тогда
		СписокЗначенийИтог = Новый СписокЗначений;
		СписокЗначенийИтог.ЗагрузитьЗначения(МассивТипов);
		Возврат СписокЗначенийИтог;
	Иначе
		Возврат МассивТипов;
	КонецЕсли;
	
КонецФункции

// Рассчитать хеш для строки
// 
// Параметры:
//  СтрокаДляРасчетаХеша - Строка - Строка для расчета хеша
// Возвращаемое значение:
//  Строка - Описание
Функция ХешированиеДанныхSHA256(СтрокаДляРасчетаХеша, ФорматBase64 = Истина) Экспорт
	
	ХешированиеДанныхОбъект = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешированиеДанныхОбъект.Добавить(СтрокаДляРасчетаХеша);
	
	Если ФорматBase64 Тогда
		Возврат Base64Строка(ХешированиеДанныхОбъект.ХешСумма);
	Иначе
		Возврат ХешированиеДанныхОбъект.ХешСумма;
	КонецЕсли;
	
КонецФункции

#Область ОбменСИспользованиемЭДО

// Получает структуру настроек обмена через ЭДО, извлекая из константы НастройкиОбменаГосИС.
// 
// Возвращаемое значение:
//  ТаблицаЗначений, Неопределено - Настройки обмена.
//
Функция НастройкиОбменаГосИС() Экспорт
	
	ХранилищеЗначения = Константы.НастройкиОбменаГосИС.Получить();
	
	Если ХранилищеЗначения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиОбмена = ХранилищеЗначения.Получить();
	
	Возврат НастройкиОбмена;
	
КонецФункции

Функция СертификатыОрганизаций() Экспорт
	
	СертификатыОрганизаций = Новый ТаблицаЗначений();
	СертификатыОрганизаций.Колонки.Добавить("Организация", Метаданные.ОпределяемыеТипы.Организация.Тип);
	
	НастройкиОбменаГосИС = НастройкиОбменаГосИС();
	
	Если НастройкиОбменаГосИС = Неопределено Тогда
		Возврат СертификатыОрганизаций;
	КонецЕсли;
	
	Для Каждого Строка Из НастройкиОбменаГосИС Цикл
		ЗаполнитьЗначенияСвойств(СертификатыОрганизаций.Добавить(), Строка);
	КонецЦикла;
	
	Возврат СертификатыОрганизаций;

КонецФункции

#КонецОбласти

#Область РаботаСЗапросами

Функция РазделительЗапросовВПакете() Экспорт
	
	Разделитель = ";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат Разделитель;
	
КонецФункции
	
#КонецОбласти

#Область ФормыДокументовОснований

// Параметры вывода гиперссылок на документы ИС в форме документа-основания.
//
// Параметры:
//  ИменаПодсистем           - Строка - имена подсистем (через запятую), на объекты которых нужны гиперссылки
//  ИмяЭлементаДляРазмещения - Строка - имя реквизита формы, для размещения гиперссылок
// 
// Возвращаемое значение:
//  Структура - согласно параметрам
//
Функция ПараметрыИнтеграцииВФорме(ИменаПодсистем = "", ИмяЭлементаДляРазмещения = "") Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИменаПодсистем",           ИменаПодсистем);
	Результат.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
	Возврат Результат;
	
КонецФункции

Функция ИмяЭлементаДляРазмещения() Экспорт
	
	Возврат "ГруппаИнтеграция";
	
КонецФункции

// Процедура - При создании на сервере в форме документа основания
//
// Параметры:
//  Форма               - ФормаКлиентскогоПриложения     - форма прикладного объекта для встраивания библиотечной гиперссылки
//  Объект              - ДанныеФормыСтруктура - данные прикладного объекта
//  ПараметрыИнтеграции - См. ПараметрыИнтеграцииВФорме
//
Процедура ПриСозданииНаСервереВФормеДокументаОснования(Форма, Объект, Знач ПараметрыИнтеграции) Экспорт
	
	ИнтегрируемыеПодсистемы = Новый Структура;
	Реквизиты = Новый Массив;
	
	Для Каждого КлючИЗначение Из Новый Структура(ПараметрыИнтеграции.ИменаПодсистем) Цикл
		
		// Проверим использование подсистемы.
		ИмяПодсистемы = КлючИЗначение.Ключ;
		
		ИспользованиеПодсистемы = Ложь;
		Если ОбщегоНазначенияИС.ПодсистемаСуществует(ИмяПодсистемы) Тогда
			
			МодульИнтеграции = ОбщийМодуль(ИмяПодсистемы);
			ИспользованиеПодсистемы = МодульИнтеграции.ИспользуетсяИнтеграцияВФормеДокументаОснования(Форма, Объект);
			
		КонецЕсли;
		
		Если НЕ ИспользованиеПодсистемы Тогда
			Продолжить;
		КонецЕсли;
		
		ИнтегрируемыеПодсистемы.Вставить(ИмяПодсистемы);
		
		// Добавим реквизит формы для подсистемы.
		Реквизиты.Добавить(Новый РеквизитФормы(
			ИнтеграцияИСКлиентСервер.ИмяПоляИнтеграцииВФормеДокументаОснования(ИмяПодсистемы),
			Новый ОписаниеТипов("ФорматированнаяСтрока")));
		
	КонецЦикла;
	
	Если ИнтегрируемыеПодсистемы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Добавим служебный реквизит описания всех используемых подсистем.
	Реквизиты.Добавить(Новый РеквизитФормы(
		ИнтеграцияИСКлиентСервер.ИмяПоляОписанияИнтеграцийВФормеДокументаОснования(),
		Новый ОписаниеТипов()));
	
	// Создадим реквизиты формы.
	Форма.ИзменитьРеквизиты(Реквизиты);
	
	Форма[ИнтеграцияИСКлиентСервер.ИмяПоляОписанияИнтеграцийВФормеДокументаОснования()] =
		Новый ФиксированнаяСтруктура(ИнтегрируемыеПодсистемы);
		
	ЭлементРодитель = Форма.Элементы.Найти(ПараметрыИнтеграции.ИмяЭлементаДляРазмещения);
	Если ЭлементРодитель <> Неопределено Тогда
		Для Каждого КлючИЗначение Из ИнтегрируемыеПодсистемы Цикл
			
			ИмяПодсистемы = КлючИЗначение.Ключ;
			
			// Создадим элемент формы для подсистемы.
			ПолеНадписи = Форма.Элементы.Добавить(
				ИнтеграцияИСКлиентСервер.ИмяПоляИнтеграцииВФормеДокументаОснования(ИмяПодсистемы),
				Тип("ПолеФормы"),
				ЭлементРодитель);
			
			ПолеНадписи.Вид                     = ВидПоляФормы.ПолеНадписи;
			ПолеНадписи.ПутьКДанным             = ИнтеграцияИСКлиентСервер.ИмяПоляИнтеграцииВФормеДокументаОснования(ИмяПодсистемы);
			ПолеНадписи.ПоложениеЗаголовка      = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеНадписи.АвтоМаксимальнаяШирина  = Ложь;
			ПолеНадписи.АвтоМаксимальнаяВысота  = Ложь;
			ПолеНадписи.МаксимальнаяВысота      = 2;
			
			ПолеНадписи.УстановитьДействие(
				"ОбработкаНавигационнойСсылки",
				"Подключаемый_ПолеИнтеграцииИСОбработкаНавигационнойСсылки");
			
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьПолеИнтеграцииВФормеДокументаОснования(Форма, Объект);
	
КонецПроцедуры

Процедура ОбновитьПолеИнтеграцииВФормеДокументаОснования(Форма, Объект, ДополнительныеПараметры = Неопределено)
	
	ИнтегрируемыеПодсистемы = ИнтеграцияИСКлиентСервер.ИнтегрируемыеПодсистемыВФормеДокументаОснования(Форма);
	
	Если НЕ ЗначениеЗаполнено(ИнтегрируемыеПодсистемы) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("ИмяПодсистемы") Тогда
		ИмяПодсистемыИзПараметров = ДополнительныеПараметры.ИмяПодсистемы;
	Иначе
		ИмяПодсистемыИзПараметров = Неопределено;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из ИнтегрируемыеПодсистемы Цикл
		
		ИмяПодсистемы = КлючИЗначение.Ключ;
		
		Если ЗначениеЗаполнено(ИмяПодсистемыИзПараметров) И ИмяПодсистемыИзПараметров <> ИмяПодсистемы Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоляФормы = ИнтеграцияИСКлиентСервер.ИмяПоляИнтеграцииВФормеДокументаОснования(ИмяПодсистемы);
		
		Если Форма.Элементы.Найти(ИмяПоляФормы) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Получим текст надписи на форме.
		ТекстНадписи = "<Удалить>";
		
		Форма[ИмяПоляФормы] = ТекстНадписи;
		Форма.Элементы[ИмяПоляФормы].Видимость = ЗначениеЗаполнено(ТекстНадписи);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ФормыДокументовИС

Процедура ПослеЗаписиНаСервереВФормеОбъектаДокументаИС(Форма, Объект, ИмяПодсистемы, ПараметрыЗаписи) Экспорт
	
	Если Объект.ДополнительныеСвойства.Свойство("ПредыдущийДокументОснование") Тогда
		
		// Заполняется в подписках РассчитатьСтатусОформления[]ПередЗаписьюДокумента
		ПараметрыЗаписи.Вставить(
			"ПредыдущийДокументОснование",
			Объект.ДополнительныеСвойства.ПредыдущийДокументОснование);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьВидимостьДокументаОснования(Форма) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Элементы, "ДокументОснование") Тогда
		Возврат;
	КонецЕсли;
	
	МассивИмен = СтрРазделить(Форма.ИмяФормы, ".");
	
	ЭтоФормаДокумента = Ложь;
	
	Пока МассивИмен.Количество() > 2 Цикл
		ЭтоФормаДокумента = ЭтоФормаДокумента ИЛИ МассивИмен[МассивИмен.ВГраница()] = "ФормаДокумента";
		МассивИмен.Удалить(МассивИмен.ВГраница());
	КонецЦикла;
	
	Если Не ЭтоФормаДокумента Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяМетаданных = СтрСоединить(МассивИмен, ".");
	ЭлементМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданных);
	
	Если ЭлементМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Реквизит = ЭлементМетаданных.Реквизиты.Найти("ДокументОснование");
	
	Если Реквизит = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТип Из Реквизит.Тип.Типы() Цикл
		Если Метаданные.НайтиПоТипу(СтрокаТип) <> Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Форма.Элементы.ДокументОснование.Видимость = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Элементы, "ТоварыПерезаполнитьПоОснованию") Тогда
		Форма.Элементы.ТоварыПерезаполнитьПоОснованию.Видимость = Ложь;
	КонецЕсли;
	
	Реквизит = Новый РеквизитФормы("НетМетаданныхОснования", Новый ОписаниеТипов("Булево"));
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить(Реквизит);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	Форма.НетМетаданныхОснования = Истина;
	
КонецПроцедуры

// Процедура определяет использование транспортных средств
//
//  Возвращаемое значение:
//	 Булево - Признак использования транспортных средств.
Функция УказываетсяТранспортноеСредство() Экспорт
	
	МассивТипов = Метаданные.ОпределяемыеТипы.ТранспортныеСредстваИС.Тип.Типы();
	
	Для Каждого Тип Из МассивТипов Цикл
		Если Не ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
			Продолжить;
		КонецЕсли;
		
		МетаданныеПоТипу = Метаданные.НайтиПоТипу(Тип);
		ИспользуютсяФункциональныеОпции = Ложь;
		ФункционалДоступенПоПоФункциональнойОпции = Ложь;
		
		Для Каждого Опция Из Метаданные.ФункциональныеОпции Цикл
			Если Опция.Состав.Найти(МетаданныеПоТипу)<>Неопределено Тогда
				//@skip-check empty-except-statement
				Попытка
					ФункционалДоступенПоПоФункциональнойОпции = ПолучитьФункциональнуюОпцию(Опция.Имя);
					ИспользуютсяФункциональныеОпции = Истина;
				Исключение
					// Опции с параметрами не поддерживаются
				КонецПопытки;
				Если ФункционалДоступенПоПоФункциональнойОпции = Истина Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ИспользуютсяФункциональныеОпции Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ДокументыИС

// Функция возвращает оформленные документы по документу-основанию
//   * в документе должен быть реквизит "ДокументОснование".
//   * допустимый тип документа определяется из регистра статусов.
// Параметры:
//  ДокументОснование					 - ДокументСсылка   - значение реквизита "ДокументОснование".
//  МетаданныеРегистраСтатусовДокументов - ОбъектМетаданных - используемый регистр статусов документов
//  ИмяИзмеренияДокумент                 - Строка           - используемое измерение регистра статусов документов
//  Фильтр                               - Строка           - фильтр регистра (при необходимости)
// Возвращаемое значение:
//  Структура - описание документов, где:
//   * Ключ - Строка - [ИмяДокумента], имя метаданных оформленного документа
//   * Значение - Массив Из Структура - массив структур с полями:
//     ** Ссылка - ДокументСсылка - ссылка на оформленный документ
//     ** Дата   - Дата           - дата документа
//     ** Статус - Произвольный   - статус документа по регистру
//
Функция ДокументыИСПоДокументуОснованию(ДокументОснование, МетаданныеРегистраСтатусовДокументов, 
		ИмяИзмеренияДокумент = "Документ", Фильтр = "") Экспорт
	
	ДокументыИС = Новый Структура;
	
	ИмяРегистра = МетаданныеРегистраСтатусовДокументов.Имя;
	МассивТекстов = Новый Массив;
	
	ШаблонВыборки =
	"ВЫБРАТЬ
	|	""%1""									КАК ИмяДокумента,
	|	Таблица.Ссылка							КАК Ссылка,
	|	Таблица.Дата							КАК Дата,
	|	ЕСТЬNULL(Статусы.Статус, НЕОПРЕДЕЛЕНО) 	КАК Статус
	|ИЗ
	|	Документ.%1 КАК Таблица
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.%2 КАК Статусы
	|		ПО Статусы.%3 = Таблица.Ссылка
	|ГДЕ
	|	Таблица.ДокументОснование = &ДокументОснование
	|	И НЕ Таблица.ПометкаУдаления
	|	%4";
	
	ШаблонОбъединения = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	Для Каждого ТипДокумента Из МетаданныеРегистраСтатусовДокументов.Измерения[ИмяИзмеренияДокумент].Тип.Типы() Цикл
		
		МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипДокумента);
		
		Если Не Метаданные.Документы.Содержит(МетаданныеДокумента) Тогда
			Продолжить;
		ИначеЕсли РеквизитДокументОснованиеДокументаИС(МетаданныеДокумента) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументыИС.Вставить(МетаданныеДокумента.Имя, Новый Массив);
		МассивТекстов.Добавить(СтрШаблон(ШаблонВыборки, МетаданныеДокумента.Имя, ИмяРегистра, ИмяИзмеренияДокумент, Фильтр));
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат ДокументыИС;
	ИначеЕсли ДокументыИС.Количество() = 0 Тогда 
		Возврат ДокументыИС;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(МассивТекстов,ШаблонОбъединения);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		
		ОписаниеДокумента = Новый Структура("Ссылка, Дата, Статус");
		ЗаполнитьЗначенияСвойств(ОписаниеДокумента, Выборка);
		
		ДокументыИС[Выборка.ИмяДокумента].Добавить(ОписаниеДокумента);
		
	КонецЦикла;
	
	Возврат ДокументыИС;
	
КонецФункции

#КонецОбласти

#Область МетаданныеИС

// Возвращает описание типов из указанного ссылочного типа по полному имени метаданных
//
// Параметры:
//   ПолноеИмя - Строка - полное имя объекта для получения ссылочного типа
//
// Возвращаемое значение:
//   ОписаниеТипов
Функция ОписаниеТиповПоПолномуИмени(ПолноеИмя) Экспорт
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗнч(МенеджерОбъекта.ПустаяСсылка()));
	Возврат Новый ОписаниеТипов(МассивТипов);
	
КонецФункции

// Возвращает описание типов по переданному типу
// 
// Параметры:
//	Тип - Тип - Тип значения
//
// Возвращаемое значение:
//	ОписаниеТипов - созданное на основании переданного типа описание типов.
//
Функция ОписаниеТиповПоТипу(Тип) Экспорт
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип);
	
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	
	Возврат ОписаниеТипов;
	
КонецФункции

Функция РеквизитДокументОснованиеДокументаИС(МетаданныеДокумента) Экспорт
	
	Возврат МетаданныеДокумента.Реквизиты.Найти("ДокументОснование");
	
КонецФункции

// Формирует массив пустых значений определяемого типа.
// 
// Возвращаемое значение:
//  Массив - Пустые значения определяемого типа.
//
Функция НезаполненныеЗначенияОпределяемогоТипа(ОпределяемыйТипИлиИмяТипа) Экспорт
	
	Если ТипЗнч(ОпределяемыйТипИлиИмяТипа) = Тип("Строка") Тогда
		ОпределяемыйТип = Метаданные.ОпределяемыеТипы[ОпределяемыйТипИлиИмяТипа];
	Иначе
		ОпределяемыйТип = ОпределяемыйТипИлиИмяТипа;
	КонецЕсли;
	
	МассивПустыхЗначений = Новый Массив;
	Для Каждого ТипЗначения Из ОпределяемыйТип.Тип.Типы() Цикл
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗначения);
		ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
		МассивПустыхЗначений.Добавить(ОписаниеТипа.ПривестиЗначение());
	КонецЦикла;
	
	Если МассивПустыхЗначений.Количество() > 1 Тогда
		МассивПустыхЗначений.Добавить(Неопределено);
	КонецЕсли;
	
	Возврат МассивПустыхЗначений;

КонецФункции

Функция ОбщийМодуль(КраткоеИмяПодсистемы)
	
	ИмяМодуля = ОбщегоНазначенияИСКлиентСервер.МодульСервер(КраткоеИмяПодсистемы);
	Возврат ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
КонецФункции

// Позволяет определить есть ли среди реквизитов табличной части объекта реквизит с переданным именем.
//
// Параметры:
//  ИмяРеквизита - Строка - Строковое имя искомого реквизита.
//  МетаданныеОбъекта - ОбъектМетаданных - описание метаданных объекта, среди реквизитов которого производится поиск.
//  ИмяТабЧасти  - Строка - Строковое имя табличной части объекта, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Булево - Истина, нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитТабЧастиОбъекта(ИмяРеквизита, МетаданныеОбъекта, ИмяТабЧасти) Экспорт

	ТабЧасть = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТабЧасти);

	Если ТабЧасть = Неопределено Тогда // нет такой таб. части
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ТабЧасть.Реквизиты.Найти(ИмяРеквизита) <> Неопределено;
	
КонецФункции

#КонецОбласти

#Область ПодготовкаИЗаписьДвиженийДокумента

// Расчет статусов оформления для документов-оснований выполняется вне транзакции записи.
// Если записываемый объект не является документом-основанием, расчет по текущему документу будет выполнен сразу.
// 
// Возвращаемое значение:
//  Булево - расчет статусов оформления вынесен из подписок записи документов
Функция РасчетСтатусовОформленияВыполняетсяВнеТранзакцииЗаписи() Экспорт
	
	РасчетОтдельно = Ложь;
	ИнтеграцияИСПереопределяемый.НастроитьСпособРасчетаСтатусовОформления(РасчетОтдельно);
	Возврат РасчетОтдельно;
	
КонецФункции

// Определяет необходимость подготовить таблицу для формирования движений
//
// Параметры:
//  ИмяРегистра - Строка - имя регистра. Например "ТоварыНаСкладах"
//  Регистры    - Строка, Структура - список регистров, разделенных запятой, или структура, в ключах которой - имена регистров
//              - Неопределено - то всегда возвращается ИСТИНА
// 
// Возвращаемое значение:
//  Булево - Истина, если требуется инициализировать указанную таблицу
//
Функция ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Экспорт

	Если ЗначениеЗаполнено(Регистры) Тогда
		
		Если ТипЗнч(Регистры) = Тип("Строка") Тогда
			МассивРегистров = Новый Структура(Регистры);
		Иначе
			МассивРегистров = Регистры;
		КонецЕсли;
		
		Если НЕ МассивРегистров.Свойство(ИмяРегистра) Тогда
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Истина;

КонецФункции

// Процедура инициализирует общие структуры, используемые при проведении документов.
// Вызывается из модуля документов при проведении.
//
Процедура ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойства, РежимПроведения = Неопределено) Экспорт

	// В структуре "ДополнительныеСвойства" создаются свойства с ключами "ТаблицыДляДвижений", "ДляПроведения".

	// "ТаблицыДляДвижений" - структура, которая будет содержать таблицы значений с данными для выполнения движений.
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);

	// "ДляПроведения" - структура, содержащая свойства и реквизиты документа, необходимые для проведения.
	ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
	
	// Структура, содержащая ключ с именем "МенеджерВременныхТаблиц", в значении которого хранится менеджер временных таблиц.
	// Содержит для каждой временной таблицы ключ (имя временной таблицы) и значение (признак наличия записей во временной таблице).
	ДополнительныеСвойства.ДляПроведения.Вставить("СтруктураВременныеТаблицы", Новый Структура("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц));
	ДополнительныеСвойства.ДляПроведения.Вставить("РежимПроведения",           РежимПроведения);
	ДополнительныеСвойства.ДляПроведения.Вставить("МетаданныеДокумента",       ДокументСсылка.Метаданные());
	ДополнительныеСвойства.ДляПроведения.Вставить("Ссылка",                    ДокументСсылка);
	
КонецПроцедуры

// Процедура компонует текст запроса, выполняет запрос и выгружает результаты запроса в таблицы
// 
// Параметры:
//  Запрос - Запрос - запрос, параметры которого предварительно установлены.
//  ТекстыЗапроса - СписокЗначений из Строка - в списке перечислены тексты запросов и их имена.
//  Таблицы - Структура - структура в которую будут помещены полученные таблицы для движений.
//  ДобавитьРазделитель - Булево - Истина, если нужно добавить разделитель ";" между запросами.
//  ДобавлятьСловоТаблица - Булево - Истина, если к имени таблицы движений нужно в начало добавить слово "Таблица"
//  ТолькоОтмеченные - Булево - Только отмеченные регистры
Процедура ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, Таблицы, ДобавитьРазделитель = Ложь, ДобавлятьСловоТаблица = Истина, ТолькоОтмеченные=Ложь) Экспорт
	
	ТаблицыЗапроса = ВыгрузитьРезультатыЗапроса(Запрос, ТекстыЗапроса,, ДобавитьРазделитель);
	
	// Помещение результатов запроса в таблицы
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл

		ИмяТаблицы = ТекстЗапроса.Представление;

		Если Не ПустаяСтрока(ИмяТаблицы) И (Не ТолькоОтмеченные Или ТекстЗапроса.Пометка) Тогда

			Если ДобавлятьСловоТаблица Тогда
				// Таблицы для проведения должны начинаться с "Таблица"
				Если НЕ СтрНачинаетсяС(ИмяТаблицы, "Таблица") Тогда
					ИмяТаблицы = "Таблица" + ИмяТаблицы;
				КонецЕсли;
			КонецЕсли;
			
			Таблицы.Вставить(ИмяТаблицы, ТаблицыЗапроса[ТекстЗапроса.Представление]);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Формирует пакет запросов и возвращает результат каждого запроса
// 
// Параметры:
//  Запрос - Запрос - запрос, параметры которого предварительно установлены.
//  ТекстыЗапроса - СписокЗначений из Строка - в списке перечислены тексты запросов и их имена.
//  ОбходРезультата - ОбходРезультатаЗапроса - вариант обхода результата запроса.
//  ДобавитьРазделитель - Булево - Добавить разделитель
// 
// Возвращаемое значение:
//  Структура -- структура в которую помещены полученные таблицы
Функция ВыгрузитьРезультатыЗапроса(Запрос, ТекстыЗапроса, ОбходРезультата = Неопределено, ДобавитьРазделитель = Ложь)

	Таблицы = Новый Структура;
	
	Если ТекстыЗапроса.Количество() = 0 Тогда
		Возврат Таблицы;
	КонецЕсли;
	
	// Инициализация варианта обхода результата запроса.
	Если ОбходРезультата = Неопределено Тогда
		ОбходРезультата = ОбходРезультатаЗапроса.Прямой;
	КонецЕсли;
	
	МассивТекстаЗапроса = Новый Массив;
	
	// Формирование текст запроса.
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		Если ЗначениеЗаполнено(ТекстЗапроса.Представление) Тогда
			МассивТекстаЗапроса.Добавить("// " + ТекстЗапроса.Представление);
		КонецЕсли; 
		МассивТекстаЗапроса.Добавить(ТекстЗапроса.Значение);
		Если ДобавитьРазделитель Тогда
			МассивТекстаЗапроса.Добавить("
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|");
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = СтрСоединить(МассивТекстаЗапроса, Символы.ПС);
	
	// Выполнение запроса.
	Результат = Запрос.ВыполнитьПакет();

	// Помещение результатов запроса в таблицы
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл

		ИмяТаблицы = ТекстЗапроса.Представление;

		Если Не ПустаяСтрока(ИмяТаблицы) Тогда

			Индекс = ТекстыЗапроса.Индекс(ТекстЗапроса);
			Таблицы.Вставить(ИмяТаблицы, Результат[Индекс].Выгрузить(ОбходРезультата));

		КонецЕсли;

	КонецЦикла;

	Возврат Таблицы;
	
КонецФункции

// Процедура выполняет подготовку наборов записей документа к записи движений.
// 1. Очищает наборы записей от "старых записей" (ситуация возможна только в толстом клиенте)
// 2. Взводит флаг записи у наборов, по которым документ имеет движения
// Вызывается из модуля документов при проведении.
//
Процедура ПодготовитьНаборыЗаписейКРегистрацииДвижений(Объект, ЭтоНовый = Ложь) Экспорт
	Перем ЭтоНовыйДокумент, МетаданныеДвижения;
	
	Для Каждого НаборЗаписей Из Объект.Движения Цикл

		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;

	КонецЦикла;
	
	Если НЕ Объект.ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовыйДокумент) Тогда
		ЭтоНовыйДокумент = ЭтоНовый;
	КонецЕсли;
	
	Если НЕ ЭтоНовыйДокумент Тогда

		Если Объект.ДополнительныеСвойства.Свойство("ДляПроведения")
		 И Объект.ДополнительныеСвойства.ДляПроведения.Свойство("МетаданныеДокумента") Тогда
			МетаданныеДвижения = Объект.ДополнительныеСвойства.ДляПроведения.МетаданныеДокумента.Движения;
		Иначе
			МетаданныеДвижения = Объект.Метаданные().Движения;
		КонецЕсли;
		
		МассивИменРегистров = ПолучитьИспользуемыеРегистры(Объект.Ссылка, МетаданныеДвижения);

		Для Каждого ИмяРегистра Из МассивИменРегистров Цикл
			Объект.Движения[ИмяРегистра].Записывать = Истина;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

// Функция формирует массив имен регистров, по которым документ имеет движения.
// Вызывается при подготовке записей к регистрации движений.
//
Функция ПолучитьИспользуемыеРегистры(Регистратор, Движения, МассивИсключаемыхРегистров = Неопределено)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Результат = Новый Массив;
	МаксимумТаблицВЗапросе = 256;

	СчетчикТаблиц   = 0;
	СчетчикДвижений = 0;

	ВсегоДвижений = Движения.Количество();
	МассивТекстаЗапроса = Новый Массив;
	
	Разделитель = 
	"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	Для Каждого Движение Из Движения Цикл

		СчетчикДвижений = СчетчикДвижений + 1;

		ПропуститьРегистр = МассивИсключаемыхРегистров <> Неопределено
							И МассивИсключаемыхРегистров.Найти(Движение.Имя) <> Неопределено;

		Если Не ПропуститьРегистр Тогда

			СчетчикТаблиц = СчетчикТаблиц + 1;

			МассивТекстаЗапроса.Добавить(
			"
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|""" + Движение.Имя + """ КАК ИмяРегистра
			|
			|ИЗ " + Движение.ПолноеИмя() + "
			|
			|ГДЕ Регистратор = &Регистратор
			|");

		КонецЕсли;

		Если СчетчикТаблиц = МаксимумТаблицВЗапросе Или СчетчикДвижений = ВсегоДвижений Тогда

			Запрос.Текст = СтрСоединить(МассивТекстаЗапроса, Разделитель);
			МассивТекстаЗапроса.Очистить();
			
			СчетчикТаблиц = 0;

			Если Результат.Количество() = 0 Тогда

				Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяРегистра");

			Иначе

				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Результат.Добавить(Выборка.ИмяРегистра);
				КонецЦикла;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Процедура записывает движения документа. Дополнительно происходит копирование параметров
// в модули наборов записей для выполнения регистрации изменений в движениях.
// Процедура вызывается из модуля документов при проведении.
//
Процедура ЗаписатьНаборыЗаписей(Объект) Экспорт
	Перем РегистрыДляКонтроля, РассчитыватьИзменения;
	
	Для Каждого Движение Из Объект.Движения Цикл
		
		Движение.ДополнительныеСвойства.Вставить("ЭтоНовый", Объект.ДополнительныеСвойства.ЭтоНовый);
		Движение.ДополнительныеСвойства.Вставить("РежимЗаписи", Объект.ДополнительныеСвойства.РежимЗаписи);
		Движение.ДополнительныеСвойства.Вставить("ДатаРегистратора", Объект.Дата);
		
		Движение.ДополнительныеСвойства.Вставить("ДляПроведения", 
			Новый Структура("СтруктураВременныеТаблицы",
				// Структура для передачи данных в модули наборов записей.
				Объект.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы));
		
	КонецЦикла;
	
	// Регистры, для которых будут рассчитаны таблицы изменений движений.
	Если Объект.ДополнительныеСвойства.ДляПроведения.Свойство("РегистрыДляКонтроля", РегистрыДляКонтроля) Тогда
		
		// Установка флага регистрации изменений в наборе записей.
		Если НЕ Объект.ДополнительныеСвойства.Свойство("РассчитыватьИзменения", РассчитыватьИзменения) Тогда
			РассчитыватьИзменения = Истина;
		КонецЕсли;
		
		Для Каждого НаборЗаписей Из РегистрыДляКонтроля Цикл
			Если НаборЗаписей.Записывать Тогда
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("РассчитыватьИзменения", РассчитыватьИзменения);
				
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;
	
	Объект.Движения.Записать();
	
КонецПроцедуры

// Выполняет закрытие менеджера временных таблиц в структуре дополнительных свойств документа, используемых 
// при проведении.
//
// Параметры:
//	ДополнительныеСвойства - Структура - структура с дополнительными свойствами документа, используемыми
//		при проведении.
//
Процедура ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства) Экспорт

	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();

КонецПроцедуры

#КонецОбласти

#Область ПрисоединенныеФайлы

// Добавить запись в протокол обмена.
//
// Параметры:
//   Протокол              - ОбъектМетаданныхСправочник - протокол обмена
//   ТекстСообщенияXML     - Строка                     - Текст сообщения XML.
//   Реквизиты - Структура                              - Значения реквизитов сообщения, с обязательными полями:
//    * Документ       - Произвольный - документ по которому ведется протокол обмена,
//    * ВладелецФайлов - Произвольный - элемент по которому ведется обмен с ГосИС.
//   ПроверятьХешБезСсылки - Булево                     - Признак проверки хеша без ссылки.
//   ЗаписатьПринудительно - Булево                     - Признак записи сообщения без поиска по хешу.
// Возвращаемое значение:
//   Структура - Структура со свойствами:
//    * НовоеСообщение - Булево - Это новое сообщение.
//    * Ссылка - СправочникСсылка - Ссылка на присоединенный файл (СправочникСсылка[Протокол.Имя]).
//    * Документ - ДокументСсылка
//    * ДокументОснование - ДокументСсылка
//
Функция ДобавитьЗаписьВПротоколОбмена(Протокол, ТекстСообщенияXML, Реквизиты, ПроверятьХешБезСсылки, ЗаписатьПринудительно = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗаписатьПринудительно Тогда
		
		ХешированиеДанныхОбъект = Новый ХешированиеДанных(ХешФункция.SHA256);
		ХешированиеДанныхОбъект.Добавить(ТекстСообщенияXML);
		ХешСуммаBase64 = Base64Строка(ХешированиеДанныхОбъект.ХешСумма);
		
		Если ПроверятьХешБезСсылки Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Протокол.Ссылка КАК Ссылка,
			|	Протокол.Документ КАК Документ
			|ИЗ
			|	&Протокол КАК Протокол
			|ГДЕ
			|	Протокол.ХешСумма = &ХешСумма
			|	И Протокол.Документ ССЫЛКА &ИмяТаблицы");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Протокол",   Протокол.ПолноеИмя());
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", Реквизиты.Документ.Метаданные().ПолноеИмя());
			Запрос.УстановитьПараметр("ХешСумма", ХешСуммаBase64);
			
		Иначе
			
			СообщениеОснование = Справочники[Протокол.Имя].ПустаяСсылка();
			Если Реквизиты.Свойство("СообщениеОснование") Тогда
				СообщениеОснование = Реквизиты.СообщениеОснование;
			КонецЕсли;
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Протокол.Ссылка КАК Ссылка,
			|	Протокол.Документ КАК Документ
			|ИЗ
			|	&Протокол КАК Протокол
			|ГДЕ
			|	Протокол.Документ = &Документ
			|	И Протокол.СообщениеОснование = &СообщениеОснование
			|	И Протокол.ХешСумма = &ХешСумма");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Протокол",   Протокол.ПолноеИмя());
			Запрос.УстановитьПараметр("Документ",           Реквизиты.Документ);
			Запрос.УстановитьПараметр("ХешСумма",           ХешСуммаBase64);
			Запрос.УстановитьПараметр("СообщениеОснование", СообщениеОснование);
			
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
	КонецЕсли;
	
	ДокументОснование = Неопределено;
	
	Если Выборка <> Неопределено
		И Выборка.Следующий() Тогда
		
		НовоеСообщение = Ложь;
		
		Ссылка   = Выборка.Ссылка;
		Документ = Выборка.Документ;
		
		Если ЗначениеЗаполнено(Выборка.Документ)
			И Выборка.Документ.Метаданные().Реквизиты.Найти("ДокументОснование") <> Неопределено Тогда
			ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Документ, "ДокументОснование");
		КонецЕсли;
		
	Иначе
		
		НовоеСообщение = Истина;
		ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(ТекстСообщенияXML, КодировкаТекста.UTF8);
		АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ПараметрыФайла = Новый Структура();
		ПараметрыФайла.Вставить("Автор",              Пользователи.АвторизованныйПользователь());
		ПараметрыФайла.Вставить("ВладелецФайлов",     Реквизиты.ВладелецФайлов);
		ПараметрыФайла.Вставить("ИмяБезРасширения",   Строка(Новый УникальныйИдентификатор));
		ПараметрыФайла.Вставить("РасширениеБезТочки", "xml");
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное");
		
		ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(
			ПараметрыФайла,
			АдресФайлаВоВременномХранилище,,,
			Справочники[Протокол.Имя].ПолучитьСсылку());
		
		ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
		ПрисоединенныйФайлОбъект.ХешСумма = ХешСуммаBase64;
		
		ЗаполнитьЗначенияСвойств(ПрисоединенныйФайлОбъект, Реквизиты);
		
		ПрисоединенныйФайлОбъект.Записать();
		
		Ссылка   = ПрисоединенныйФайлОбъект.Ссылка;
		Документ = ПрисоединенныйФайлОбъект.Документ;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("НовоеСообщение",    НовоеСообщение);
	ВозвращаемоеЗначение.Вставить("Ссылка",            Ссылка);
	ВозвращаемоеЗначение.Вставить("Документ",          Документ);
	ВозвращаемоеЗначение.Вставить("ДокументОснование", ДокументОснование);
	
	//@skip-check constructor-function-return-section
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Вызывает исключение при открытии формы протокола обмена с незаполненным параметром "Документ"
//  (форма предназначается для просмотра протокола обмена по конкретному объекту).
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма протокола обмена
//  ИмяПоляДокумент - Строка
//  ИмяРеквизита - Строка
//
Процедура ОтработатьВходящийДокументПротоколаОбмена(Форма, ИмяПоляДокумент = "Документ", ИмяРеквизита = "Документ") Экспорт
	
	Если ЗначениеЗаполнено(Форма.Параметры[ИмяПоляДокумент]) Тогда
		Форма[ИмяРеквизита] = Форма.Параметры[ИмяПоляДокумент];
	Иначе
		ВызватьИсключение НСтр("ru = 'Протокол обмена может быть открыт только в контексте документа.'");
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает типовое условное оформление протокола обмена
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - форма протокола обмена
//
Процедура УстановитьУсловноеОформлениеПротоколаОбмена(Форма) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	Элементы = Форма.Элементы;
	
	УсловноеОформление.Элементы.Очистить();
	
#Область ДеревоЗачеркнутый
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоФайловПредставление.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоФайлов.УсловноеОформление");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "УсловноеОформлениеЗачеркнутый";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,,,,Истина));
	
#КонецОбласти

#Область ДеревоСерый

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоФайловПредставление.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоФайлов.УсловноеОформление");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "УсловноеОформлениеСерый";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	
#КонецОбласти

#Область ДеревоЖирный

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоФайловПредставление.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоФайлов.УсловноеОформление");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "УсловноеОформлениеЖирный";

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	
#КонецОбласти

#Область ДеревоОтказ
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоФайловПредставление.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоФайлов.УсловноеОформление");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "УсловноеОформлениеОшибка";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СтатусОбработкиОшибкаПередачиГосИС);
	
#КонецОбласти

#Область ДатаНеПередана
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(Форма, "ДеревоФайлов.Дата", Элементы.ДеревоФайловДата.Имя);
	
	// Представление даты "<не передано>"
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоФайловДата");
	
	ПредставлениеЭлемента = НСтр("ru = 'Представление даты ""<не передано>""'");
	ЭлементУсловногоОформления.Представление = ПредставлениеЭлемента;
	
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФайлов.Дата");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = '00010101';
	ЭлементОтбораДанных.Использование = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не передано>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	
#КонецОбласти

КонецПроцедуры

// Возвращает индекс картинки запроса в коллекции "ПротоколОбменаИС"
//
// Параметры:
//  СтрокаПоследовательности - Произвольный - коллекция с типом запроса (входящий, исходящий)
//  НеВыполнен				 - Булево - серые стрелки (по умолчанию Ложь)
// 
// Возвращаемое значение:
//  Число - индекс соответствующей картинки запроса
//
Функция ИндексКартинкиЗапроса(СтрокаПоследовательности, НеВыполнен = Ложь) Экспорт
	
	ИндексКартинки = 0;
	
	Смещение = 0;
	Если НеВыполнен Тогда
		Смещение = 6;
	КонецЕсли;
	
	Если СтрокаПоследовательности = Неопределено Тогда
	ИначеЕсли СтрокаПоследовательности.ТипСообщения = Перечисления.ТипыЗапросовИС.Исходящий Тогда
		ИндексКартинки = 1 + Смещение;
	ИначеЕсли СтрокаПоследовательности.ТипСообщения = Перечисления.ТипыЗапросовИС.Входящий Тогда
		ИндексКартинки = 2 + Смещение;
	КонецЕсли;
	
	Возврат ИндексКартинки;

КонецФункции

#КонецОбласти

#Область СправочникиИКлассификаторы

// Тип измеряемой величины по коду классификатора.
// 
// Параметры:
//  КодКлассификатора - Строка - код классификатора
// 
// Возвращаемое значение:
//  Строка, Неопределено - тип измеряемой величины по коду классификатора
Функция ТипИзмеряемойВеличиныПоКодуКлассификатора(КодКлассификатора) Экспорт
	
	ТипыПоКоду = Новый Соответствие;
	
	ТипыПоКоду.Вставить("160", "Вес");
	ТипыПоКоду.Вставить("161", "Вес");
	ТипыПоКоду.Вставить("162", "Вес");
	ТипыПоКоду.Вставить("163", "Вес");
	ТипыПоКоду.Вставить("164", "Вес");
	ТипыПоКоду.Вставить("166", "Вес");
	ТипыПоКоду.Вставить("168", "Вес");
	ТипыПоКоду.Вставить("170", "Вес");
	ТипыПоКоду.Вставить("173", "Вес");
	ТипыПоКоду.Вставить("181", "Вес");
	ТипыПоКоду.Вставить("185", "Вес");
	ТипыПоКоду.Вставить("206", "Вес");
	
	ТипыПоКоду.Вставить("110", "Объем");
	ТипыПоКоду.Вставить("111", "Объем");
	ТипыПоКоду.Вставить("112", "Объем");
	ТипыПоКоду.Вставить("113", "Объем");
	ТипыПоКоду.Вставить("118", "Объем");
	ТипыПоКоду.Вставить("122", "Объем");
	ТипыПоКоду.Вставить("126", "Объем");
	ТипыПоКоду.Вставить("131", "Объем");
	ТипыПоКоду.Вставить("132", "Объем");
	ТипыПоКоду.Вставить("133", "Объем");
	ТипыПоКоду.Вставить("159", "Объем");

	Возврат ТипыПоКоду[КодКлассификатора];
	
КонецФункции

// Дополняет список странами ЕАЭС
// 
// Параметры:
//  СписокСтран - СписокЗначений из СправочникСсылка.СтраныМира - текущий список стран
//  ВключатьКодВПредставление - Булево - Включает в представление код страны.
Процедура ДополнитьСписокСтранЕАЭС(СписокСтран, ВключатьКодВПредставление = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтраныМира.Ссылка                КАК Ссылка,
		|	СтраныМира.Код                   КАК Код,
		|	Представление(СтраныМира.Ссылка) КАК Представление
		|ИЗ
		|	Справочник.СтраныМира КАК СтраныМира
		|ГДЕ
		|	СтраныМира.УчастникЕАЭС
		|	И НЕ СтраныМира.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СписокСтран.НайтиПоЗначению(ВыборкаДетальныеЗаписи.Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ВключатьКодВПредставление Тогда
			Представление = СтрШаблон("%1 - %2", ВыборкаДетальныеЗаписи.Код, ВыборкаДетальныеЗаписи.Представление);
		Иначе
			Представление = ВыборкаДетальныеЗаписи.Представление;
		КонецЕсли;
		СписокСтран.Добавить(ВыборкаДетальныеЗаписи.Ссылка, Представление);
	КонецЦикла;
	
КонецПроцедуры

// Переопределяется список и настройки классификаторов обновления которых необходимо
// загружать из сервиса классификаторов. Для получения идентификатора необходимо
// перевести наименование объекта метаданных, данные которого планируется обновлять,
// на английский язык. При переводе рекомендуется использовать профессиональные
// программы перевода текста, либо воспользоваться услугами переводчика, т.к. при
// обнаружении смысловых ошибок в идентификаторе потребуется заводить новый классификатор
// и изменять код конфигурации.
//
// Параметры:
//  Классификаторы  - Массив из Структура - содержит настройки загрузки классификаторов.
//                    Состав настроек см. функцию РаботаСКлассификаторами.ОписаниеКлассификатора.
//
// Пример:
//	Описатель = РаботаСКлассификаторами.ОписаниеКлассификатора();
//	Описатель.Наименование               = НСтр("ru = 'Ставки рефинансирования'");
//	Описатель.Идентификатор              = "CentralBankRefinancingRate";
//	Описатель.ОбновлятьАвтоматически     = Истина;
//	Описатель.ОбщиеДанные                = Истина;
//	Описатель.СохранятьФайлВКэш          = Ложь;
//	Описатель.ОбработкаРазделенныхДанных = Ложь;
//	Классификаторы.Добавить(Описатель);
//
//@skip-warning
Процедура ПриДобавленииКлассификаторов(Классификаторы) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Переопределяются номер версии классификатора, который уже загружен в информационную базу.
// При начале использовании подсистемы "РаботаСКлассификаторами" или при подключении нового
// классификатора к сервису, неизвестно какой номер версии классификатора загружен в ИБ,
// поэтому при очередной итерации обновления данных из сервиса данные будут загружены повторно.
// Чтобы избежать повторной загрузки, необходимо указать задать начальный номер версии.
// Метод будет вызван при попытке загрузить версию классификатора, у которого установлена
// версия равная 0.
//
// Параметры:
//  Идентификатор        - Строка - идентификатор классификатора в сервисе классификаторов.
//                         Определяется в процедуре ПриДобавленииКлассификаторов.
//  НачальныйНомерВерсии - Число - номер версии загруженного классификатора.
//
// Пример:
//	Если Идентификатор = "CentralBankRefinancingRate" Тогда
//		НачальныйНомерВерсии = РегистрыСведений.СтавкиРефинансирования.НомерЗагруженнойВерсии();
//	КонецЕсли;
//
//@skip-warning
Процедура ПриОпределенииНачальногоНомераВерсииКлассификатора(Идентификатор, НачальныйНомерВерсии) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Переопределяются алгоритмы обработки файла загруженного
// из сервиса классификаторов. После обработки файла нельзя удалять
// временного хранилища, т.к. при необходимости он будет сохранен в
// кэше для последующего использования.
//
// Параметры:
//  Идентификатор           - Строка - идентификатор классификатора в сервисе классификаторов.
//                            Определяется в процедуре ПриДобавленииКлассификаторов.
//  Версия                  - Число - номер загруженной версии;
//  Адрес                   - Строка - адрес двоичных данных файла обновления во
//                            временном хранилище;
//  Обработан               - Булево - если Ложь, при обработке файла обновления были ошибки
//                            и его необходимо загрузить повторно;
//  ДополнительныеПараметры - Структура - содержит дополнительные параметры обработки.
//                            Необходимо использовать для передачи значений в переопределяемый
//                            метод РаботаСКлассификаторамиВМоделиСервисаПереопределяемый.ПриОбработкеОбластиДанных
//                            и метод ИнтеграцияПодсистемБИП.ПриОбработкеОбластиДанных..
// Пример:
//	Если Идентификатор = "CentralBankRefinancingRate" Тогда
//		Обработан = РегистрыСведений.СтавкиРефинансирования.ОбновитьДанныеРегистраИзФайла(Адрес, ДополнительныеПараметры);
//	КонецЕсли;
//
//@skip-warning
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

// см. РаботаСКлассификаторамиВМоделиСервисаПереопределяемый.ПриОпределенииИдентификаторовКлассификаторов
Процедура ПриОпределенииИдентификаторовКлассификаторовВМоделиСервиса(Идентификаторы) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаНоменклатуры

// Получает настройки параметров номенклатуры из описания номенклатуры и настроек частичного выбытия.
//
// Параметры:
//   Номенклатура - ОпределяемыйТип.Номенклатура, Неопределено -
//
// Возвращаемое значение:
//  Структура из КлючИЗначение
//   * ОписаниеНоменклатурыИС - см. ОбщегоНазначенияИС.ИнициализироватьДанныеОписанияНоменклатуры
//   * НастройкиЧастичногоВыбытияПродукцииИС - ТаблицаЗначений
//
Функция ДанныеНастроекПараметровНоменклатуры(Номенклатура = Неопределено) Экспорт
	
	ДанныеНастроек = Новый Структура;
	
	НастройкиЧастичногоВыбытия = РегистрыСведений.НастройкиЧастичногоВыбытияПродукцииИС.СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ДанныеНастроек.Вставить("ОписаниеНоменклатурыИС", ОбщегоНазначенияИС.ОписаниеНоменклатуры(Номенклатура)[Номенклатура]);
		НастройкиЧастичногоВыбытия.Отбор.Номенклатура.Установить(Номенклатура);
		НастройкиЧастичногоВыбытия.Прочитать();
	Иначе
		ДанныеНастроек.Вставить("ОписаниеНоменклатурыИС", ОбщегоНазначенияИС.ИнициализироватьДанныеОписанияНоменклатуры());
	КонецЕсли;
	
	ДанныеНастроек.Вставить("НастройкиЧастичногоВыбытияПродукцииИС", НастройкиЧастичногоВыбытия.Выгрузить());
	
	Возврат ДанныеНастроек;
	
КонецФункции

#КонецОбласти

#Область НастройкаИнтеграцииСФГИС

// Инициализирует данные формы и настраивает элементы формы, необходимые для установки ключа видов продукции.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения.
//
Процедура ИнициализироватьНастройкиФормыДляУстановкиКлючаВидовПродукции(Форма) Экспорт
	
	Форма.Элементы.ВидПродукцииГИСМТ.КнопкаОчистки = Истина;
	Форма.Элементы.ВидПродукцииГИСМТ.КнопкаОткрытия = Ложь;
	Форма.Элементы.ВидПродукцииГИСМТ.КнопкаСоздания = Ложь;
	Форма.Элементы.ВидПродукцииГИСМТ.ПодсказкаВвода = НСтр("ru = 'не используется'");
	
	Форма.Элементы.ВидПродукцииФГИС.КнопкаОчистки = Истина;
	Форма.Элементы.ВидПродукцииФГИС.КнопкаОткрытия = Ложь;
	Форма.Элементы.ВидПродукцииФГИС.КнопкаСоздания = Ложь;
	Форма.Элементы.ВидПродукцииФГИС.ПодсказкаВвода = НСтр("ru = 'не используется'");
	
	Форма.Элементы.ВидыПродукцииФГИС.Заголовок = НСтр("ru = 'Интеграция с ФГИС'");
	
	ИспользуетсяГИСМТ = Ложь;
	ИспользуетсяФГИС = Ложь;
	
	СуффиксПодсистемыМаркировки = КонструкторИСОбщегоНазначенияКлиентСервер.СуффиксПодсистемыМаркировкиДляКлючаВидовПродукции();
	
	Для Каждого Суффикс Из КонструкторИСОбщегоНазначенияКлиентСервер.СуффиксыВидовПродукцииСПредставлением() Цикл
		ПодсистемаИспользуется = ОбщегоНазначенияИС.ПодсистемаИспользуется(Суффикс.Значение);
		Форма["ИспользуетсяПодсистема"+Суффикс.Значение] = ПодсистемаИспользуется;
		Если Суффикс.Значение = СуффиксПодсистемыМаркировки Тогда
			ИспользуетсяГИСМТ = ПодсистемаИспользуется;
			Форма.Элементы.ВидПродукцииГИСМТ.Заголовок = Суффикс.Представление;
		ИначеЕсли ПодсистемаИспользуется Тогда
			ИспользуетсяФГИС = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Форма.Элементы.ВидПродукцииГИСМТ.Видимость = ИспользуетсяГИСМТ;
	Форма.Элементы.ГруппаИнтеграцияФГИС.Видимость = ИспользуетсяФГИС;
	
	ИспользуетсяГосИС = ИспользуетсяГИСМТ Или ИспользуетсяФГИС;
	Форма.Элементы.ГруппаИнтеграцияГосИС.Видимость = ИспользуетсяГосИС;
	Если Форма.Элементы.Найти("ГруппаНастройкиГосИС") <> Неопределено Тогда
		Форма.Элементы.ГруппаНастройкиГосИС.Видимость = ИспользуетсяГосИС;
	КонецЕсли;
	
	ИнтеграцияИСКлиентСервер.НастроитьЭлементыФормыИнтеграцииСФГИС(Форма);
	
КонецПроцедуры

// Заполняет данные формы и настраивает элементы формы по ключу видов продукции.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения.
//
Процедура ЗаполнитьДанныеПоКлючуВидовПродукции(Форма) Экспорт
	
	ЗаполнитьЗначенияСвойств(Форма,
		Справочники.КлючиВидовПродукцииИС.ПолучитьПоляКлюча(Форма.КлючВидовПродукции));
	
	Если ЗначениеЗаполнено(Форма.ДанныеПодсистемФГИС.ИмяПодсистемы) Тогда
		Форма.ВидПродукцииФГИС = Форма["ВидПродукции"+Форма.ДанныеПодсистемФГИС.ИмяПодсистемы];
		Форма.ФлагФГИС = ЗначениеЗаполнено(Форма.ВидПродукцииФГИС);
	КонецЕсли;
	
	ИнтеграцияИСКлиентСервер.НастроитьЭлементыФормыИнтеграцииСФГИСПоВидамПродукцииКлюча(Форма);
	
КонецПроцедуры

// Получает значение ключа видов продукции по указанным видам продукции.
//
// Параметры:
//   ВидыПродукцииКлюча - Структура - виды продукции для получения ключа.
//
// Возвращаемое значение:
//  СправочникСсылка.КлючиВидовПродукцииИС - значение ключа.
//
Функция ПолучитьКлючВидовПродукции(ВидыПродукцииКлюча) Экспорт
	
	ПоляКлюча = Новый Структура(СтрСоединить(КонструкторИСОбщегоНазначенияКлиентСервер.ИменаПолейКлючаВидовПродукции(), ","));
	ЗаполнитьЗначенияСвойств(ПоляКлюча, ВидыПродукцииКлюча);
	Возврат Справочники.КлючиВидовПродукцииИС.ПолучитьКлюч(ПоляКлюча);
	
КонецФункции

#КонецОбласти

// Возвращает вид продукции по номенклатуре из первой строки.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект - документ ГосИС:
// * Товары - ТабличнаяЧасть - табличная часть документа:
// ** Номенклатура - ОпределяемыйТип.Номенклатура - номенклатура в строке документа
//  ИмяПодсистемы - Неопределено, Строка - имя подсистемы
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыПродукцииИС - вид продукции
Функция ВидПродукцииПоТабличнойЧасти(ДокументОбъект, ИмяПодсистемы = Неопределено) Экспорт
	
	Результат = Справочники.ВидыПродукцииИС.ПустаяСсылка();

	Если ДокументОбъект.Товары.Количество() Тогда
		
		Номенклатура = ДокументОбъект.Товары[0].Номенклатура;
		ОписаниеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(Номенклатура)[Номенклатура];
		Если ЗначениеЗаполнено(ОписаниеНоменклатуры.КлючВидовПродукции) Тогда
			ВидыПродукции = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииКлюча(ОписаниеНоменклатуры.КлючВидовПродукции, ИмяПодсистемы);
			Для Каждого ВидПродукции Из ВидыПродукции Цикл
				Возврат ВидПродукции;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Возвращает структуру параметров заполнения табличной части.
// 
// Параметры:
//  ВходноеЗначение - Массив Из СправочникСсылка.ВидыПродукцииИС, СправочникСсылка.ВидыПродукцииИС - виды продукции, которые поддерживает документ.
// Возвращаемое значение:
//  Структура - 
Функция ПараметрыЗаполненияТабличнойЧастиТовары(ВходноеЗначение) Экспорт
	
	Если ТипЗнч(ВходноеЗначение) = Тип("СправочникСсылка.ВидыПродукцииИС") Тогда
		ВидыПродукции = Новый Массив();
		ВидыПродукции.Добавить(ВходноеЗначение);
	Иначе
		ВидыПродукции = ВходноеЗначение;
	КонецЕсли;
	
	ПараметрыЗаполнения = БазовыеПараметрыОбработкиТабличнойЧастиТовары(ВидыПродукции);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЕГАИС") Тогда
		
		Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоМаркируемаяПродукцияЕГАИС(ВидыПродукции) Тогда
			МодульШтрихкодированиеЕГАИС = ОбщегоНазначения.ОбщийМодуль("ШтрихкодированиеЕГАИС");
			МодульШтрихкодированиеЕГАИС.ДополнитьПараметрыЗаполненияТабличнойЧастиТовары(ПараметрыЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		
		Если ШтрихкодированиеОбщегоНазначенияИС.ПрисутствуетПродукцияИСМП(ВидыПродукции)
			Или ШтрихкодированиеОбщегоНазначенияИС.ПрисутствуетТабачнаяПродукция(ВидыПродукции) Тогда
			
			МодульШтрихкодированиеИСМПКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ШтрихкодированиеИСМПКлиентСервер");
			МодульШтрихкодированиеИСМПКлиентСервер.ДополнитьПараметрыЗаполненияТабличнойЧастиТовары(ПараметрыЗаполнения);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат ПараметрыЗаполнения;
	
КонецФункции

//Возвращает поля поиска строки табличной части по номенклутаре, характеристикике, опционально серии.
//
//Параметры:
//   ЕстьСерии - Булево - наличие колонки "Серия" в табличной части.
//   ЕстьGTIN - Булево - наличие колонки "GTIN" в табличной части.
//   СпецификаМаркировкаМолочнойПродукции - Булево - специфика в табличной части маркировки
//      (молочная продукция с/без ВетИС - срок годности с/без идентификатора ВетИС, соответственно).
//
//Возвращаемое значение:
//   Структура - поля поиска:
// * Номенклатура - ОпределяемыйТип.Номенклатура - Пустоне значение номенклатуры.
// * Характеристика  - ОпределяемыйТип.ХарактеристикаНоменклатуры - Пустое значение характеристики.
// * Серия - ОпределяемыйТип.СерияНоменклатуры - Пустое значение серии. Может отсутствовать.
// * GTIN  - ОпределяемыйТип.GTIN - Пустое значение GTIN. Может отсутствовать.
// * ИдентификаторПроисхожденияВЕТИС - ОпределяемыйТип.ИдентификаторПроисхожденияВЕТИС - пустое значение идентификатора. Может отсутствовать.
// * СрокГодности - Дата - пустое значение срока годности. Может отсутствовать.
Функция ПоляПоискаМаркируемойПродукции(ЕстьСерии = Истина, ЕстьGTIN = Ложь, СпецификаМаркировкаМолочнойПродукции = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура",   ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Номенклатура"));
	Результат.Вставить("Характеристика", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ХарактеристикаНоменклатуры"));
	
	Если ЕстьСерии Тогда
		Результат.Вставить("Серия", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры"));
	КонецЕсли;
	
	Если ЕстьGTIN Тогда
		Результат.Вставить("GTIN", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("GTIN"));
	КонецЕсли;
	
	Если СпецификаМаркировкаМолочнойПродукции Тогда
		Результат.Вставить("ИдентификаторПроисхожденияВЕТИС", ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ИдентификаторПроисхожденияВЕТИС"));
		Результат.Вставить("СрокГодности", '00010101');
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

// Рег задания настроены.
// 
// Параметры:
//  РезультатЗапроса - РезультатЗапроса - Результат запроса
//  ИдентификаторПроблемы - Строка - Идентификатор проблемы
//  ВсеЗадания - Булево - Все задания
// 
// Возвращаемое значение:
//  Булево - Рег задания настроены
Функция РегЗаданияНастроены(РезультатЗапроса, ИдентификаторПроблемы, ВсеЗадания = Истина) Экспорт
	
	РезультатПроверки = Неопределено;
	
	Выборка = РезультатЗапроса[ИдентификаторПроблемы].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.РегламентноеЗадание) Тогда 
			Если ВсеЗадания И РезультатПроверки = Истина Тогда
				РезультатПроверки = Ложь;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		Задание = РегламентныеЗаданияСервер.Задание(Выборка.РегламентноеЗадание);
		УстановитьПривилегированныйРежим(Ложь);
		ТекВключено = Задание <> Неопределено И Задание.Использование = Истина;
		
		РезультатПроверки = (ТекВключено Или РезультатПроверки = Истина И Не ВсеЗадания)
			Или (ТекВключено И ВсеЗадания И РезультатПроверки = Истина);
	КонецЦикла;
	
	Возврат РезультатПроверки = Истина;
	
КонецФункции

#Область МаркируемаяПродукция

// Определяет ведение учета маркируемой продукции.
//
// Возвращаемое значение:
//  Булево - учет маркируемой продукции ведется
Функция ИспользуетсяМаркируемаяПродукция() Экспорт
	
	Результат = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЕГАИС") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияЕГАИС");
		Результат = Результат Или Модуль.ИспользуетсяМаркируемаяПродукция();
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияИСМП");
		Результат = Результат Или Модуль.ИспользуетсяМаркируемаяПродукция();
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Заполнить служебные реквизиты в коллекции.
//  Используется в случае необходимости заполнения признака "Маркируемая продукция"
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма в которой происходит заполнение
//  Таблица - ДанныеФормыКоллекция -Таблица  в которой происходит заполнение
Процедура ЗаполнитьСлужебныеРеквизитыВКоллекции(Форма, Таблица) Экспорт
	
	ИнтеграцияИСПереопределяемый.ЗаполнитьСлужебныеРеквизитыВКоллекции(
		Форма, Таблица, ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Форма));
	
КонецПроцедуры

#КонецОбласти

#Область ОрганизацииИКонтрагенты

// Получает список доступных для интеркампани организаций.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Организации интеркампани:
// * Организация - ОпределяемыйТип.Организация - Ссылка на организацию.
// * Подразделение  - ОпределяемыйТип.Подразделение - Ссылка на подразделение.
// * Представление - Строка - Представление.
// * ИНН - Строка - ИНН организации.
// * КПП - Строка - КПП организации.
Функция ОрганизацииИнтеркампани() Экспорт
	
	ОрганизацииИнтеркампани = Новый ТаблицаЗначений;
	ОрганизацииИнтеркампани.Колонки.Добавить("Организация",   Метаданные.ОпределяемыеТипы.Организация.Тип);
	ОрганизацииИнтеркампани.Колонки.Добавить("Подразделение", Метаданные.ОпределяемыеТипы.Подразделение.Тип);
	ОрганизацииИнтеркампани.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ОрганизацииИнтеркампани.Колонки.Добавить("ИНН",           Новый ОписаниеТипов("Строка"));
	ОрганизацииИнтеркампани.Колонки.Добавить("КПП",           Новый ОписаниеТипов("Строка"));
	
	ИнтеграцияИСПереопределяемый.ПриОпределенииОрганизацийИнтеркампани(ОрганизацииИнтеркампани);
	
	Возврат ОрганизацииИнтеркампани;
	
КонецФункции

#КонецОбласти

#Область Прочее

// Возвращает пароль к сертификату, если доступен текущему пользователю.
// При вызове в привилегированном режиме текущий пользователь не учитывается.
//
// Параметры:
//  Сертификат - Неопределено - вернуть пароли ко всем сертификатам, доступным текущему пользователю.
//             - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - вернуть пароль
//                 к указанному сертификату.
//              
// Возвращаемое значение:
//  Неопределено - пароль для указанного сертификата не указан.
//  Строка       - пароль для указанного сертификата.
//  Соответствие - все заданные пароли, доступные текущему пользователю
//                 в виде ключ - сертификат и значение - пароль.
//
Функция ПарольКСертификату(Сертификат = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Данные = Константы.КонтекстРаботыИС.Получить().Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	РольДляПроверки = Неопределено;
	Если Метаданные.Роли.Найти("ДобавлениеИзменениеЭлектронныхПодписейИШифрование") <> Неопределено Тогда
		РольДляПроверки = "ДобавлениеИзменениеЭлектронныхПодписейИШифрование";
	ИначеЕсли Метаданные.Роли.Найти("ДобавлениеИзменениеСертификатовКлючейЭлектроннойПодписиИШифрования") <> Неопределено Тогда
		РольДляПроверки = "ДобавлениеИзменениеСертификатовКлючейЭлектроннойПодписиИШифрования";
	Иначе
		ВызватьИсключение НСтр("ru = 'Не определена роль для добавления и (или) изменения электронных подписей'");
	КонецЕсли;
	
	Если Не Пользователи.РолиДоступны(РольДляПроверки) Тогда
		Если Сертификат <> Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Если Сертификат <> Неопределено Тогда
		Если ТипЗнч(Данные) <> Тип("Соответствие") Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Свойства = Данные.Получить(Сертификат);
		
		Если ТипЗнч(Свойства) = Тип("Структура")
		   И Свойства.Свойство("Пароль")
		   И ТипЗнч(Свойства.Пароль) = Тип("Строка")
		   И Свойства.Свойство("Пользователь")
		   И ТипЗнч(Свойства.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			
		   Если Свойства.Пользователь = Пользователи.ТекущийПользователь()
			   ИЛИ Свойства.Пользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
				
				Возврат Свойства.Пароль;
			КонецЕсли;
		КонецЕсли;
		
		Возврат Неопределено;
	КонецЕсли;
	
	ПаролиСертификатов = Новый Соответствие;
	
	Если ТипЗнч(Данные) <> Тип("Соответствие") Тогда
		Возврат ПаролиСертификатов;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из Данные Цикл
		Свойства = КлючИЗначение.Значение;
		
		Если ТипЗнч(Свойства) = Тип("Структура")
		   И Свойства.Свойство("Пароль")
		   И ТипЗнч(Свойства.Пароль) = Тип("Строка")
		   И Свойства.Свойство("Пользователь")
		   И ТипЗнч(Свойства.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			
		   Если Свойства.Пользователь = Пользователи.ТекущийПользователь()
			   ИЛИ Свойства.Пользователь = Справочники.Пользователи.ПустаяСсылка()
			 Или ПривилегированныйРежим() Тогда
				ПаролиСертификатов.Вставить(КлючИЗначение.Ключ, Свойства.Пароль);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПаролиСертификатов;
	
КонецФункции

#КонецОбласти

#Область РегламентноеЗадание

// см. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	Возврат;
КонецПроцедуры

// см. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт
	Возврат;
КонецПроцедуры

// см. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСЧасовымиПоясами

// Формирует представление даты с часовым поясом.
//
// Параметры:
//  Дата                 - Дата - дата/время, для которой нужно вывести представление.
//  ЧасовойПояс          - Строка - идентификатор часового пояса.
//  ЧасовойПоясСМинутами - Булево
//  Разделитель          - Строка
//  РазделительЧасовогоПоясаСМинутами - Строка
// 
// Возвращаемое значение:
//  Строка - представление даты с часовым поясом.
//
Функция ДатаСЧасовымПоясом(Дата, Знач ЧасовойПояс = Неопределено, ЧасовойПоясСМинутами = Истина, Разделитель = Неопределено, РазделительЧасовогоПоясаСМинутами = ":") Экспорт
	
	Если ЧасовойПояс = Неопределено Тогда
		ЧасовойПояс = ЧасовойПоясСеанса();
	КонецЕсли;
	
	Смещение = (Дата - УниверсальноеВремя(Дата, ЧасовойПояс)) / 3600;
	Если Смещение > 0 Тогда
		Результат = Формат(Дата, "ДФ=yyyy-MM-ddTЧЧ:мм:сс") + "+" + Формат(+Смещение, "ЧЦ=2; ЧН=; ЧВН=") + ?(ЧасовойПоясСМинутами, РазделительЧасовогоПоясаСМинутами + "00", "");
	Иначе
		Результат = Формат(Дата, "ДФ=yyyy-MM-ddTЧЧ:мм:сс") + "-" + Формат(-Смещение, "ЧЦ=2; ЧН=; ЧВН=") + ?(ЧасовойПоясСМинутами, РазделительЧасовогоПоясаСМинутами + "00", "");
	КонецЕсли;
	
	Если Разделитель <> Неопределено Тогда
		Результат = СтрЗаменить(Результат, "T", Разделитель);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует представление даты с часовым поясом.
//
// Параметры:
//  Дата        - Дата   - дата, для которой нужно вывести представление.
//  ЧасовойПояс - Строка - идентификатор часового пояса.
// 
// Возвращаемое значение:
//  Строка - представление даты с часовым поясом.
//
Функция ДатаСЧасовымПоясомЦРПТ(Дата, Знач ЧасовойПояс = Неопределено) Экспорт
	
	Если ЧасовойПояс = Неопределено Тогда
		ЧасовойПояс = ЧасовойПоясСеанса();
	КонецЕсли;
	
	Смещение = (Дата - УниверсальноеВремя(Дата, ЧасовойПояс)) / 3600;
	Если Смещение > 0 Тогда
		Результат = Формат(Дата, "ДФ=dd.MM.yyyyTЧЧ:мм:сс") + "+" + Формат(+Смещение, "ЧЦ=2; ЧН=; ЧВН=");
	Иначе
		Результат = Формат(Дата, "ДФ=dd.MM.yyyyTЧЧ:мм:сс") + "-" + Формат(-Смещение, "ЧЦ=2; ЧН=; ЧВН=");
	КонецЕсли;
	
	Результат = СтрЗаменить(Результат, "T", " ");
	
	Возврат Результат;
	
КонецФункции

// Формирует представление даты в формате Coordinated Universal Time
//
// Параметры:
//  Дата - Дата - дата/время, представление которой необходимо получить.
//  ЧасовойПояс - Строка - идентификатор часового пояса.
//
// Возвращаемое значение:
//  Строка - представление даты в формате Coordinated Universal Time(UTC).
//
Функция ДатаUTC(Знач Дата, ЧасовойПояс = Неопределено) Экспорт
	
	Если ЧасовойПояс <> Неопределено Тогда
		Дата = УниверсальноеВремя(Дата, ЧасовойПояс);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Дата) Тогда
		Результат = Формат(Дата, "ДФ=yyyy-MM-ddTЧЧ:мм:сс") + ".000Z";
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДатаСАТУРН(Знач Дата, ЧасовойПояс = Неопределено) Экспорт
	
	Если ЧасовойПояс <> Неопределено Тогда
		Дата = УниверсальноеВремя(Дата, ЧасовойПояс);
	КонецЕсли;
	
	Результат = Формат(Дата, "ДФ=yyyy-MM-ddTЧЧ:мм");
	
	Возврат Результат;
	
КонецФункции

Функция ДатаСАТУРН_ISO8601(Знач Дата) Экспорт
	
	Попытка
		Результат = XMLЗначение(Тип("Дата"), Дата);
	Исключение
		Возврат Дата(1, 1, 1);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Возвращает временную дату, которая будет в дальнейшем преобразована в дату с часовым поясом.
//
// Параметры:
//  Дата - Дата - Дата для преобразования.
// 
// Возвращаемое значение:
//  Дата - Временная дата
//
Функция ВременнаяДата(Дата) Экспорт
	
	Возврат ДобавитьМесяц(Дата, -12 * 1000);
	
КонецФункции

// Устанавливает в ОбъектXDTO вместо даты со смещением временную дату. В дальнейшем временная дата будет заменена датой
// со смещением в результирующем ХМL. Тем самым обходится ограничение ОбъектXDTO, который не позволяет устанавливать в
// свойство дату со смещением.
//
// Параметры:
//  ОбъектXDTO            - ОбъектXDTO - в свойство данного объекта помещается дата.
//  ИмяСвойства           - Строка     - имя свойства, в которое устанавливается дата.
//  Дата                  - Дата       - дата/время, которая устанавливается в свойство.
//  ХранилищеВременныхДат - Соответствие из КлючИЗначение - в нем хранится соответствие временных дат и дат со смещением.
//
Процедура УстановитьДатуСЧасовымПоясом(ОбъектXDTO, ИмяСвойства, Дата, ХранилищеВременныхДат) Экспорт
	
	ДатаСЧасовымПоясом = ДатаСЧасовымПоясом(Дата);
	
	ВременнаяДатаUTC = ДатаUTC(ВременнаяДата(Дата));
	
	ОбъектXDTO[ИмяСвойства] = ВременнаяДатаUTC;
	ЛексическоеЗначениеВременнойДаты = ОбъектXDTO.ПолучитьXDTO(ИмяСвойства).ЛексическоеЗначение;
	
	ХранилищеВременныхДат.Вставить(ЛексическоеЗначениеВременнойДаты, ДатаСЧасовымПоясом);
	
КонецПроцедуры

// Заменяет временные даты в тексте сообщения в формате XML на даты со смещением, согласно соответствию.
//
// Параметры:
//  ХранилищеВременныхДат - Соответствие из КлючИЗначение - хранит временные даты, которые нужно заменить на даты со смещением
//  ТекстСообщенияXML     - Строка - текст сообщения, в котором выполняется замена.
// 
// Возвращаемое значение:
//  Строка - ТекстСообщенияXML, в котором выполнена замена.
//
Функция ПреобразоватьВременныеДаты(ХранилищеВременныхДат, Знач ТекстСообщенияXML) Экспорт
	
	Текст = ТекстСообщенияXML;
	
	Для Каждого КлючИЗначение Из ХранилищеВременныхДат Цикл
		
		ВременнаяДата = КлючИЗначение.Ключ;
		Дата = КлючИЗначение.Значение;
		
		Текст = СтрЗаменить(Текст, ВременнаяДата, Дата);
		
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляПечати

// Функция раскладывает переданный массив ссылок в соответствие по типам этих ссылок.
//
//	Параметры:
//		МассивСсылок - Массив из ЛюбаяСсылка - массив ссылок на объекты информационной базы
//  Возвращаемое значение:
//		Соответствие из КлючИЗначение:
//			Ключ - полное имя типа ссылки
//	        Значение - массив ссылок этого типа.
//
Функция СоответствиеМассивовПоТипамОбъектов(МассивСсылок) Экспорт
	
	СоответствиеТипов = Новый Соответствие;
	
	Для Каждого Объект Из МассивСсылок Цикл
		
		ТипОбъекта = Объект.Метаданные().ПолноеИмя();
		ТекущийТипОбъекта = СоответствиеТипов.Получить(ТипОбъекта);
		
		Если ТекущийТипОбъекта = Неопределено Тогда
			СоответствиеТипов.Вставить(ТипОбъекта, Новый Массив);
			ТекущийТипОбъекта = СоответствиеТипов.Получить(ТипОбъекта);
		КонецЕсли;
		ТекущийТипОбъекта.Добавить(Объект);
		
	КонецЦикла;
	
	Возврат СоответствиеТипов;
	
КонецФункции

#КонецОбласти

#Область ОбщиеПредставления

// Иницициализирует таблицу для расчета содержимого упаковки
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица для расчета содержимого упаковки:
//   * Номенклатура   - ОпределяемыйТип.Номенклатура, Строка               - номенклатура
//   * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры, Строка - характеристика,
//   * Серия          - ОпределяемыйТип.СерияНоменклатуры, Строка          - серия,
//   * Количество     - Число                                              - Количество.
Функция ИнициализироватьСодержимоеУпаковки() Экспорт
	
	ТипСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(200);
	
	СодержимоеУпаковки = Новый ТаблицаЗначений;
	СодержимоеУпаковки.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов(ТипСтрока, Метаданные.ОпределяемыеТипы.Номенклатура.Тип.Типы()));
	СодержимоеУпаковки.Колонки.Добавить("Характеристика", Новый ОписаниеТипов(ТипСтрока, Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип.Типы()));
	СодержимоеУпаковки.Колонки.Добавить("Серия",          Новый ОписаниеТипов(ТипСтрока, Метаданные.ОпределяемыеТипы.СерияНоменклатуры.Тип.Типы()));
	СодержимоеУпаковки.Колонки.Добавить("Количество",     Новый ОписаниеТипов("Число"));
	
	Возврат СодержимоеУпаковки;
	
КонецФункции

// Возвращает строку, состоящую из различных частей наименований номенклатуры, входящей в состав упаковки
//
// Параметры:
//  Таблица - См. ИнициализироватьСодержимоеУпаковки.
//
// Возвращаемое значение:
//  Строка - строка, состоящая из различных наименований переданной номенклатуры.
Функция ПредставлениеСоставаУпаковки(Таблица) Экспорт
	
	Таблица.Сортировать("Количество УБЫВ, Номенклатура ВОЗР, Характеристика ВОЗР, Серия ВОЗР");
	
	ДеревоЧастейНаименований = Новый ДеревоЗначений();
	
	Для Каждого ЭлементДанных Из Таблица Цикл
		
		ПредставлениеНоменклатуры = ОбщегоНазначенияИС.ПредставлениеНоменклатуры(
			ЭлементДанных.Номенклатура, ЭлементДанных.Характеристика);
		
		ЧастиНаименования = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ПредставлениеНоменклатуры);
		
		НомерТекущейЧасти  = 1;
		СтрокиТекущейЧасти = ДеревоЧастейНаименований.Строки;
		
		Для Каждого ЧастьНаименования Из ЧастиНаименования Цикл
			
			ИмяТекущейКолонки = "ЧастьНаименования" + НомерТекущейЧасти;
			
			Если ДеревоЧастейНаименований.Колонки.Найти(ИмяТекущейКолонки) = Неопределено Тогда
				ДеревоЧастейНаименований.Колонки.Добавить(ИмяТекущейКолонки, ОбщегоНазначения.ОписаниеТипаСтрока(100));
			КонецЕсли;
			
			СтрокаЧастиНаименования = СтрокиТекущейЧасти.Найти(СокрЛП(ЧастьНаименования), ИмяТекущейКолонки, Ложь);
			
			Если СтрокаЧастиНаименования = Неопределено Тогда
				СтрокаЧастиНаименования = СтрокиТекущейЧасти.Добавить();
				СтрокаЧастиНаименования[ИмяТекущейКолонки] = СокрЛП(ЧастьНаименования);
			КонецЕсли;
			
			НомерТекущейЧасти  = НомерТекущейЧасти + 1;
			СтрокиТекущейЧасти = СтрокаЧастиНаименования.Строки;
			
		КонецЦикла;
		
	КонецЦикла;
	
	СтрокаСоставаУпаковки = "";
	ОграничительСостава   = 7;
	
	Если ДеревоЧастейНаименований.Строки.Количество() > 0 Тогда
		СоставитьСтрокуСоставаУпаковки(СтрокаСоставаУпаковки, ДеревоЧастейНаименований.Строки, ОграничительСостава);
	КонецЕсли;
	
	Если Прав(СтрокаСоставаУпаковки, 1) = "," Тогда
		СтрокаСоставаУпаковки = Сред(СтрокаСоставаУпаковки, 1, СтрДлина(СтрокаСоставаУпаковки) - 1);
	КонецЕсли;
	
	Возврат СтрокаСоставаУпаковки;
	
КонецФункции

#КонецОбласти

#Область БСП

// (См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту)
//
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Если НастройкиФормы.ИмяФормы = "Обработка.ГенерацияШтрихкодовУпаковок.Форма.Форма" Тогда
		Обработки.ГенерацияШтрихкодовУпаковок.ПриОпределенииКомандПодключенныхКОбъекту(Команды);
	ИначеЕсли СтрНачинаетсяС(НастройкиФормы.ИмяФормы, "Справочник.ШтрихкодыУпаковокТоваров.Форма") Тогда
		Справочники.ШтрихкодыУпаковокТоваров.ПриОпределенииКомандПодключенныхКОбъекту(Команды);
	КонецЕсли;
	
КонецПроцедуры

// (См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту)
//
Процедура ПриОпределенииОбъектовСЗаблокированнымиРеквизитами(Объекты) Экспорт
	
	Объекты.Вставить(
		Метаданные.Справочники.ШтрихкодыУпаковокТоваров.ПолноеИмя(),
		"ПолучитьБлокируемыеРеквизитыОбъекта");
	
КонецПроцедуры

Процедура ПодключитьВерсионирование(Форма) Экспорт
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(Форма);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

// Возвращает признак того, что файлы должны храниться в томах на диске.
//
// Возвращаемое значение:
//  Булево - Истина, если указано хранить файлы в томах на диске, иначе - Ложь.
//
Функция ХранитьФайлыВТомахНаДиске() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СпособХраненияФайлов = Константы.СпособХраненияФайлов.Получить();
	Возврат СпособХраненияФайлов = "ВТомахНаДиске";
	
КонецФункции

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати.
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Справочники.ШтрихкодыУпаковокТоваров);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ВетИС") Тогда
		СписокОбъектов.Добавить(Справочники["ВетеринарноСопроводительныйДокументВЕТИС"]);
		СписокОбъектов.Добавить(Документы["ВходящаяТранспортнаяОперацияВЕТИС"]);
		СписокОбъектов.Добавить(Документы["ИнвентаризацияПродукцииВЕТИС"]);
		СписокОбъектов.Добавить(Документы["ИсходящаяТранспортнаяОперацияВЕТИС"]);
		СписокОбъектов.Добавить(Документы["ЗапросСкладскогоЖурналаВЕТИС"]);
		СписокОбъектов.Добавить(Документы["ПроизводственнаяОперацияВЕТИС"]);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ГИСМ") Тогда
		СписокОбъектов.Добавить(Документы["ПеремаркировкаТоваровГИСМ"]);
		СписокОбъектов.Добавить(Документы["МаркировкаТоваровГИСМ"]);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЕГАИС") Тогда
		СписокОбъектов.Добавить(Документы["АктПостановкиНаБалансЕГАИС"]);
		СписокОбъектов.Добавить(Документы["АктСписанияЕГАИС"]);
		СписокОбъектов.Добавить(Документы["ВозвратИзРегистра2ЕГАИС"]);
		СписокОбъектов.Добавить(Документы["ЗапросАкцизныхМарокЕГАИС"]);
		СписокОбъектов.Добавить(Документы["ТранспортнаяНакладнаяЕГАИС"]);
		СписокОбъектов.Добавить(Документы["ОстаткиЕГАИС"]);
		СписокОбъектов.Добавить(Документы["ОтчетЕГАИС"]);
		СписокОбъектов.Добавить(Документы["ПередачаВРегистр2ЕГАИС"]);
		СписокОбъектов.Добавить(Документы["ЧекЕГАИС"]);
		СписокОбъектов.Добавить(Документы["ЧекЕГАИСВозврат"]);
		СписокОбъектов.Добавить(Документы["ТТНИсходящаяЕГАИС"]);
		СписокОбъектов.Добавить(Документы["ТТНВходящаяЕГАИС"]);
		СписокОбъектов.Добавить(Обработки["ПечатьРазделаБСправкиТТН"]);
		СписокОбъектов.Добавить(Документы["ТранспортнаяНакладнаяЕГАИС"]);
		СписокОбъектов.Добавить(Документы["УведомлениеОПланируемомИмпортеЕГАИС"]);
		СписокОбъектов.Добавить(Документы["ОтчетОбИмпортеЕГАИС"]);
		СписокОбъектов.Добавить(Документы["ОтчетОПроизводствеЕГАИС"]);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		СписокОбъектов.Добавить(Документы["МаркировкаТоваровИСМП"]);
		СписокОбъектов.Добавить(Документы["ОтгрузкаТоваровИСМП"]);
		СписокОбъектов.Добавить(Документы["ПриемкаТоваровИСМП"]);
		СписокОбъектов.Добавить(Документы["ВыводИзОборотаИСМП"]);
		СписокОбъектов.Добавить(Документы["ВозвратВОборотИСМП"]);
		СписокОбъектов.Добавить(Документы["ЗаказНаЭмиссиюКодовМаркировкиСУЗ"]);
		СписокОбъектов.Добавить(Документы["ПеремаркировкаТоваровИСМП"]);
		СписокОбъектов.Добавить(Документы["СписаниеКодовМаркировкиИСМП"]);
		СписокОбъектов.Добавить(Документы["УточнениеСведенийОКодахМаркировкиИСМП"]);
		СписокОбъектов.Добавить(Документы["ОтчетИСМП"]);
		СписокОбъектов.Добавить(Документы["ПеремещениеМеждуМОДИСМП"]);
		СписокОбъектов.Добавить(Документы["РазрешениеНаОтгрузкуИСМП"]);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЗЕРНО") Тогда
		СписокОбъектов.Добавить(Документы["ФормированиеПартийЗЕРНО"]);
		СписокОбъектов.Добавить(Документы["ОформлениеСДИЗЗЕРНО"]);
		СписокОбъектов.Добавить(Документы["ВнесениеСведенийОСобранномУрожаеЗЕРНО"]);
		СписокОбъектов.Добавить(Документы["СписаниеПартийЗЕРНО"]);
		СписокОбъектов.Добавить(Документы["ПогашениеСДИЗЗЕРНО"]);
		СписокОбъектов.Добавить(Документы["ФормированиеПартийИзДругихПартийЗЕРНО"]);
		СписокОбъектов.Добавить(Документы["ФормированиеПартийПриПроизводствеЗЕРНО"]);
		СписокОбъектов.Добавить(Документы["ЗапросОстатковПартийЗЕРНО"]);
		СписокОбъектов.Добавить(Справочники["СДИЗЗЕРНО"]);
		СписокОбъектов.Добавить(Справочники["ДоговорыХраненияПартийЗЕРНО"]);
		СписокОбъектов.Добавить(Справочники["РеестрМестФормированияПартийЗЕРНО"]);
		СписокОбъектов.Добавить(Справочники["РезультатыИсследованийЗЕРНО"]);
		СписокОбъектов.Добавить(Справочники["АктыОтбораПробЗЕРНО"]);
		СписокОбъектов.Добавить(Справочники["РеестрПартийЗЕРНО"]);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.САТУРН") Тогда
		СписокОбъектов.Добавить(Документы["АктИнвентаризацииСАТУРН"]);
		СписокОбъектов.Добавить(Документы["АктПримененияСАТУРН"]);
		СписокОбъектов.Добавить(Документы["ЗапросОстатковПартийСАТУРН"]);
		СписокОбъектов.Добавить(Документы["ИмпортПродукцииСАТУРН"]);
		СписокОбъектов.Добавить(Документы["НакладнаяСАТУРН"]);
		СписокОбъектов.Добавить(Документы["ПланПримененияСАТУРН"]);
		СписокОбъектов.Добавить(Документы["ПроизводственнаяОперацияСАТУРН"]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьОбъектыСКомандамиОтчетов(Объекты) Экспорт
	
	Объекты.Добавить(Метаданные.Справочники.ШтрихкодыУпаковокТоваров);
	мДокументы = Метаданные.Документы;
	мСправочники = Метаданные.Справочники;
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЕГАИС") Тогда
		Объекты.Добавить(мДокументы["АктПостановкиНаБалансЕГАИС"]);
		Объекты.Добавить(мДокументы["АктСписанияЕГАИС"]);
		Объекты.Добавить(мДокументы["ЗапросАкцизныхМарокЕГАИС"]);
		Объекты.Добавить(мДокументы["ВозвратИзРегистра2ЕГАИС"]);
		Объекты.Добавить(мДокументы["ОстаткиЕГАИС"]);
		Объекты.Добавить(мДокументы["ПередачаВРегистр2ЕГАИС"]);
		Объекты.Добавить(мДокументы["ТТНВходящаяЕГАИС"]);
		Объекты.Добавить(мДокументы["ТТНИсходящаяЕГАИС"]);
		Объекты.Добавить(мДокументы["ЧекЕГАИС"]);
		Объекты.Добавить(мДокументы["ЧекЕГАИСВозврат"]);
		Объекты.Добавить(мДокументы["ОтчетЕГАИС"]);
		Объекты.Добавить(мДокументы["ТранспортнаяНакладнаяЕГАИС"]);
		Объекты.Добавить(мДокументы["УведомлениеОПланируемомИмпортеЕГАИС"]);
		Объекты.Добавить(мДокументы["ОтчетОбИмпортеЕГАИС"]);
		Объекты.Добавить(мДокументы["ОтчетОПроизводствеЕГАИС"]);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ВетИС") Тогда
		Объекты.Добавить(мДокументы["ВходящаяТранспортнаяОперацияВЕТИС"]);
		Объекты.Добавить(мДокументы["ИсходящаяТранспортнаяОперацияВЕТИС"]);
		Объекты.Добавить(мДокументы["ЗапросСкладскогоЖурналаВЕТИС"]);
		Объекты.Добавить(мДокументы["ИнвентаризацияПродукцииВЕТИС"]);
		Объекты.Добавить(мДокументы["ПроизводственнаяОперацияВЕТИС"]);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		Объекты.Добавить(мДокументы["МаркировкаТоваровИСМП"]);
		Объекты.Добавить(мДокументы["ВыводИзОборотаИСМП"]);
		Объекты.Добавить(мДокументы["ВозвратВОборотИСМП"]);
		Объекты.Добавить(мДокументы["ЗаказНаЭмиссиюКодовМаркировкиСУЗ"]);
		Объекты.Добавить(мДокументы["ПеремаркировкаТоваровИСМП"]);
		Объекты.Добавить(мДокументы["СписаниеКодовМаркировкиИСМП"]);
		Объекты.Добавить(мДокументы["ОтгрузкаТоваровИСМП"]);
		Объекты.Добавить(мДокументы["ПриемкаТоваровИСМП"]);
		Объекты.Добавить(мДокументы["УточнениеСведенийОКодахМаркировкиИСМП"]);
		Объекты.Добавить(мДокументы["ОтчетИСМП"]);
		Объекты.Добавить(мДокументы["ПеремещениеМеждуМОДИСМП"]);
		Объекты.Добавить(мДокументы["РазрешениеНаОтгрузкуИСМП"]);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЗЕРНО") Тогда
		Объекты.Добавить(мДокументы["ФормированиеПартийЗЕРНО"]);
		Объекты.Добавить(мДокументы["ОформлениеСДИЗЗЕРНО"]);
		Объекты.Добавить(мДокументы["ВнесениеСведенийОСобранномУрожаеЗЕРНО"]);
		Объекты.Добавить(мДокументы["СписаниеПартийЗЕРНО"]);
		Объекты.Добавить(мДокументы["ПогашениеСДИЗЗЕРНО"]);
		Объекты.Добавить(мДокументы["ФормированиеПартийИзДругихПартийЗЕРНО"]);
		Объекты.Добавить(мДокументы["ЗапросОстатковПартийЗЕРНО"]);
		Объекты.Добавить(мДокументы["ФормированиеПартийПриПроизводствеЗЕРНО"]);
		Объекты.Добавить(мСправочники["ДоговорыХраненияПартийЗЕРНО"]);
		Объекты.Добавить(мСправочники["РеестрМестФормированияПартийЗЕРНО"]);
		Объекты.Добавить(мСправочники["СДИЗЗЕРНО"]);
		Объекты.Добавить(мСправочники["РезультатыИсследованийЗЕРНО"]);
		Объекты.Добавить(мСправочники["АктыОтбораПробЗЕРНО"]);
		Объекты.Добавить(мСправочники["РеестрПартийЗЕРНО"]);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.САТУРН") Тогда
		Объекты.Добавить(мДокументы["АктИнвентаризацииСАТУРН"]);
		Объекты.Добавить(мДокументы["АктПримененияСАТУРН"]);
		Объекты.Добавить(мДокументы["ИмпортПродукцииСАТУРН"]);
		Объекты.Добавить(мДокументы["НакладнаяСАТУРН"]);
		Объекты.Добавить(мДокументы["ПланПримененияСАТУРН"]);
		Объекты.Добавить(мДокументы["ПроизводственнаяОперацияСАТУРН"]);
		Объекты.Добавить(мДокументы["ЗапросОстатковПартийСАТУРН"]);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ГИСМ") Тогда
		Объекты.Добавить(мДокументы["ЗаявкаНаВыпускКиЗГИСМ"]);
		Объекты.Добавить(мДокументы["МаркировкаТоваровГИСМ"]);
		Объекты.Добавить(мДокументы["ПеремаркировкаТоваровГИСМ"]);
		Объекты.Добавить(мДокументы["УведомлениеОбИмпортеМаркированныхТоваровГИСМ"]);
		Объекты.Добавить(мДокументы["УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"]);
		Объекты.Добавить(мДокументы["УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"]);
		Объекты.Добавить(мДокументы["УведомлениеОПоступленииМаркированныхТоваровГИСМ"]);
		Объекты.Добавить(мДокументы["УведомлениеОСписанииКиЗГИСМ"]);
	КонецЕсли;

КонецПроцедуры

Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЕГАИС") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОтчетыЕГАИС");
		Модуль.НастроитьВариантыОтчетов(Настройки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ВЕТИС") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияВЕТИС");
		Модуль.НастроитьВариантыОтчетов(Настройки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОтчетыИСМП");
		Модуль.НастроитьВариантыОтчетов(Настройки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЗЕРНО") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияЗЕРНО");
		Модуль.НастроитьВариантыОтчетов(Настройки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.САТУРН") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияСАТУРН");
		Модуль.НастроитьВариантыОтчетов(Настройки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ДатыЗапретаИзмененияИзменениеЗапрещено(ПроверяемыйДокумент) Экспорт

	ВозвращаемоеЗначение = Ложь;

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ДатыЗапретаИзменения") Тогда

		МодульДатыЗапретаИзменения                 = ОбщегоНазначения.ОбщийМодуль("ДатыЗапретаИзменения");
		МодульДатыЗапретаИзмененияПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ДатыЗапретаИзмененияПереопределяемый");

		// Обход ошибки БСП, когда форма может вызываться для объектов подключенных и не подключенных к подсистеме
		ИсточникиДанных = Новый ТаблицаЗначений;
		ИсточникиДанных.Колонки.Добавить("Таблица",     Новый ОписаниеТипов("Строка"));
		ИсточникиДанных.Колонки.Добавить("ПолеДаты",    Новый ОписаниеТипов("Строка"));
		ИсточникиДанных.Колонки.Добавить("Раздел",      Новый ОписаниеТипов("Строка"));
		ИсточникиДанных.Колонки.Добавить("ПолеОбъекта", Новый ОписаниеТипов("Строка"));
		ИсточникиДанных.Индексы.Добавить("Таблица");
		УстановитьПривилегированныйРежим(Истина);
		МодульДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
		УстановитьПривилегированныйРежим(Ложь);
		
		МетаданныеОбъекта = ПроверяемыйДокумент.Метаданные();
		ПолноеИмя = МетаданныеОбъекта.ПолноеИмя();

		Если ИсточникиДанных.Найти(ПолноеИмя, "Таблица") <> Неопределено
			И МодульДатыЗапретаИзменения.ИзменениеЗапрещено(ПолноеИмя, ПроверяемыйДокумент) Тогда
			ВозвращаемоеЗначение = Истина;
		КонецЕсли;

	КонецЕсли;

	Возврат ВозвращаемоеЗначение;

КонецФункции

#Область ФункцииИспользующиеПереопределение

#Область Номенклатура

Функция ПравоРегистрацииШтрихкодовНоменклатуры() Экспорт
	
	ПравоДоступа = Ложь;
	ИнтеграцияИСПереопределяемый.ПравоРегистрацииШтрихкодовНоменклатуры(ПравоДоступа);
	Возврат ПравоДоступа;
	
КонецФункции

#Область ХарактеристикиНоменклатуры

Функция ПризнакИспользованияХарактеристик(Номенклатура) Экспорт
	
	Используются = Ложь;
	ОбщегоНазначенияИСПереопределяемый.ИспользованиеХарактеристик(Используются, Номенклатура);
	Возврат Используются;
	
КонецФункции

#КонецОбласти

#Область Описаниеноменклатуры

#Область СерииНоменклатуры

// Признак использования серий.
// 
// Параметры:
//  Номенклатура - ОпределяемыйТип.Номенклатура
// 
// Возвращаемое значение:
//  Булево - Признак использования серий
Функция ПризнакИспользованияСерий(Номенклатура) Экспорт
	
	Используются = Ложь;
	ОбщегоНазначенияИСПереопределяемый.ИспользованиеСерий(Используются, Номенклатура);
	Возврат Используются;
	
КонецФункции

// Упрощенная интеграция БЭД.
// 
// Возвращаемое значение:
//  Булево - Упрощенная интеграция БЭД
Функция УпрощеннаяИнтеграцияБЭД() Экспорт
	
	Использовать = Ложь;
	ИнтеграцияИСПереопределяемый.ПриОпределенииИспользованияУпрощеннойИнтеграцииБЭД(Использовать);
	Возврат Использовать;
	
КонецФункции

// Создавать номенклатуру по GTIN.
// 
// Возвращаемое значение:
//  Булево - Создавать номенклатуру по GTIN
Функция СоздаватьНоменклатуруПоGTIN() Экспорт
	
	Создавать = Ложь;
	ИнтеграцияИСПереопределяемый.ПриОпределенииАвтоматическогоСозданияНоменклатурыПоGTIN(Создавать);
	Возврат Создавать;
	
КонецФункции

// Возвращает параметры указания серий для товаров, указанных в объекте.
//
// Параметры:
//	Объект   - ДанныеФормыСтруктура - Объект, для формы которого нужно сформировать параметры указания серий.
//	Менеджер - Произвольный - Менеджер объекта, для формы которого нужно сформировать параметры указания серий.
//
// Возвращаемое значение:
//	Произвольный - параметры, уточняющие особенности указания серий в каждом объекте
//
Функция ПараметрыУказанияСерийФормыОбъекта(Объект, Менеджер) Экспорт
	
	Параметры = Неопределено;
	ИнтеграцияИСПереопределяемый.ЗаполнитьПараметрыУказанияСерийФормыОбъекта(Параметры, Объект, Менеджер);
	Возврат Параметры;
	
КонецФункции

// Имена реквизитов, от значений которых зависят параметры указания серий.
//
// Параметры:
//  ТипОбъекта      - ОбъектМетаданных - Тип объекта коллекции объектов метаданных.
// Возвращаемое значение:
//	Строка - Имена реквизитов, перечисленные через запятую.
//
Функция ИменаРеквизитовДляЗаполненияПараметровУказанияСерий(ТипОбъекта) Экспорт
	
	ИменаРеквизитов = "";
	ИнтеграцияИСПереопределяемый.ЗаполнитьИменаРеквизитовДляЗаполненияПараметровУказанияСерий(ИменаРеквизитов, ТипОбъекта);
	Возврат ИменаРеквизитов;
	
КонецФункции

//Возвращает параметры указания серий для товаров, указанных в объекте.
//
//Параметры:
//   ТипОбъекта - ОбъектМетаданных - Тип объекта коллекции объектов метаданных.
//   Объект     - Структура        - Структура значений реквизитов объекта, необходимых для заполнения параметров указания серий.
//
// Возвращаемое значение:
//  Произвольный - (См. ИнтеграцияИСПереопределяемый.ЗаполнитьПараметрыУказанияСерий) - особенности указания серий.
//
Функция ПараметрыУказанияСерий(ТипОбъекта, Объект) Экспорт
	
	Параметры = Неопределено;
	ИнтеграцияИСПереопределяемый.ЗаполнитьПараметрыУказанияСерий(Параметры, ТипОбъекта, Объект);
	Возврат Параметры;
	
КонецФункции

// Возвращает текст запроса заполнения статусов указания серий для товаров, указанных в документе.
//
// Параметры:
//   ТипОбъекта             - ОбъектМетаданных - Тип документа коллекции объектов метаданных.
//   ПараметрыУказанияСерий - см. ПараметрыУказанияСерий.
//
// Возвращаемое значение:
//   Строка - Текст запроса заполнения статусов указания серий для товаров, указанных в объекте.
//
Функция ТекстЗапросаЗаполненияСтатусовУказанияСерий(ТипОбъекта, ПараметрыУказанияСерий) Экспорт
	
	ТекстЗапроса = "";
	ИнтеграцияИСПереопределяемый.ЗаполнитьТекстЗапросаЗаполненияСтатусовУказанияСерий(
		ТекстЗапроса,
		ТипОбъекта,
		ПараметрыУказанияСерий);
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает текст запроса для проверки заполнения серий
//
// Параметры:
//   ТипОбъекта             - ОбъектМетаданных - Тип документа коллекции объектов метаданных.
//   ПараметрыУказанияСерий - см. ПараметрыУказанияСерий
//
// Возвращаемое значение:
//   Строка - текст запроса.
//
Функция ТекстЗапросаПроверкиЗаполненияСерий(ТипОбъекта, ПараметрыУказанияСерий) Экспорт
	
	ТекстЗапроса = "";
	ИнтеграцияИСПереопределяемый.ЗаполнитьТекстЗапросаПроверкиЗаполненияСерий(
		ТекстЗапроса,
		ТипОбъекта,
		ПараметрыУказанияСерий);
	Возврат ТекстЗапроса;

КонецФункции

// Определяет необходимость обязательного указания серии для маркируемой продукции.
// 
// Параметры:
//  Товар - Структура - данные строки номенклатуры. Содержит обязательные поля:
//   * Номенклатура   - ОпределяемыйТип.Номенклатура               - номенклатура,
//   * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - характеристика.
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
// Возвращаемое значение:
//  Булево - Истина, если серия обязательно должна быть заполнена.
Функция СерияДолжнаБытьУказана(Товар, ПараметрыСканирования) Экспорт
	
	Если ПараметрыСканирования.ДополнительныеПараметры.Свойство("ДанныеУточнения")
		И ПараметрыСканирования.ДополнительныеПараметры.ДанныеУточнения.Свойство("Серия") Тогда
		Возврат ЗначениеЗаполнено(ПараметрыСканирования.ДополнительныеПараметры.ДанныеУточнения.Серия);
	КонецЕсли;
	
	СерияДолжнаБытьУказана = Ложь;
	
	Операция = Неопределено;
	Если ШтрихкодированиеОбщегоНазначенияИС.ДопустимаПродукцияИСМП(ПараметрыСканирования)
		Или ШтрихкодированиеОбщегоНазначенияИС.ДопустимаТабачнаяПродукция(ПараметрыСканирования) Тогда
		Операция = ПараметрыСканирования.ВидОперацииИСМП;
	ИначеЕсли КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоМаркируемаяПродукцияЕГАИС(ПараметрыСканирования.ДопустимыеВидыПродукции) Тогда
		Операция = ПараметрыСканирования.Операция;
	КонецЕсли;
	
	ПараметрыУказанияСерий = ПараметрыСканирования.ПараметрыУказанияСерий;
	
	ДанныеДляРасчетаСерии  = Новый Структура;
	ДанныеДляРасчетаСерии.Вставить("Склад",          ПараметрыСканирования.Склад);
	ДанныеДляРасчетаСерии.Вставить("Операция",       Операция);
	ДанныеДляРасчетаСерии.Вставить("Номенклатура",   Товар.Номенклатура);
	ДанныеДляРасчетаСерии.Вставить("Характеристика", Товар.Характеристика);
	
	ОбщегоНазначенияИСПереопределяемый.ПриОпределенииНеобходимостиВыбораСерии(
		ДанныеДляРасчетаСерии, ПараметрыУказанияСерий, Неопределено, СерияДолжнаБытьУказана, ПараметрыСканирования.КэшированныеЗначения);
	
	Возврат СерияДолжнаБытьУказана;
	
КонецФункции

Функция РезультатГенерацииИЗаполненияСерий() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаполнениеЗавершено",  Ложь);
	Результат.Вставить("СписокОшибок",         Неопределено);
	Результат.Вставить("Серии",                Новый Массив);
	Возврат Результат;
	
КонецФункции

// Сгенерировать серии.
// 
// Параметры:
//  Объект - ДокументОбъект - Объект для генерации серий,
//         - Неопределено - режим генерации серий по параметрам указания серий и таблице товаров
//  Товары - ТабличнаяЧасть, ДанныеФормыКоллекция - таблица товаров, для которой необходимо заполнить серии
//  ВыделенныеСтроки - Массив Из СтрокаТабличнойЧасти, Неопределено - Выделенные строки
//  ПараметрыУказанияСерий - Произвольный - Параметры указания серий
// 
// Возвращаемое значение:
//  Структура - результат генерации серий:
// * ЗаполнениеЗавершено - Булево - признак успешного заполнения
// * СписокОшибок - Неопределено - ошибки в процессе заполнения
// * Серии - Массив Из Структура - результат построчного заполнения серий, если не используется объект для заполнения с колонкой:
//   ** Серия - ОпределяемыйТип.СерияНоменклатуры - сгенерированная серия
Функция СгенерироватьСерии(Объект, Товары, ВыделенныеСтроки, ПараметрыУказанияСерий) Экспорт
	
	РезультатЗаполненияСерий = РезультатГенерацииИЗаполненияСерий();
	
	ИнтеграцияИСПереопределяемый.ПриГенерацииСерий(
		Объект,
		Товары,
		ВыделенныеСтроки,
		ПараметрыУказанияСерий,
		РезультатЗаполненияСерий);
		
	Возврат РезультатЗаполненияСерий;
	
КонецФункции

#КонецОбласти

#Область ВидыНоменклатуры

Функция ВидыНоменклатурыИспользуются() Экспорт
	
	Используются = Ложь;
	ИнтеграцияИСПереопределяемый.ИспользованиеВидовНоменклатуры(Используются);
	Возврат Используются;
	
КонецФункции

#КонецОбласти

#Область УпаковкиНоменклатуры

Функция УпаковкиИспользуются() Экспорт
	
	Используются = Ложь;
	ИнтеграцияИСПереопределяемый.ИспользованиеУпаковок(Используются, Неопределено);
	Возврат Используются;
	
КонецФункции

Функция ПризнакИспользованияУпаковок(Номенклатура) Экспорт
	
	Используются = Ложь;
	ИнтеграцияИСПереопределяемый.ИспользованиеУпаковок(Используются, Номенклатура);
	Возврат Используются;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ОрганизацииКонтрагенты

// Определяет контрагента по ИНН и КПП
//
// Параметры:
//  ИНН  - Строка - ИНН контрагента.
//  КПП  - Строка - КПП контрагента.
//
// Возвращаемое значение:
//   ОпределяемыйТип.КонтрагентГосИС, ОпределяемыйТип.ОрганизацияКонтрагентГосИС, Неопределено  - Найденный контрагент или Неопределено, если поиск завершился неудачей.
//
Функция КонтрагентПоИННКПП(ИНН, КПП) Экспорт
	
	Контрагент = Неопределено;
	ИнтеграцияИСПереопределяемый.ЗаполнитьКонтрагентаПоИННКПП(Контрагент, ИНН, КПП);
	Возврат Контрагент;
	
КонецФункции

// Возвращает строковое представление руководителя организации.
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентГосИС - ссылка на собственную организацию или контрагента,
//  ДатаСведений - Дата - дата, на которую требуется получить информацию.
//
// Возвращаемое значение:
//  Структура - данные руководителя:
//   * Руководитель - Строка - ФИО руководителя,
//   * Должность - Строка - должность руководителя.
//
Функция ДанныеРуководителяОрганизации(Организация, ДатаСведений = Неопределено) Экспорт
	
	ПредставлениеРуководителя = Новый Структура("Руководитель, Должность", "", "");
	ИнтеграцияИСПереопределяемый.ОпределитьДанныеРуководителяОрганизации(ПредставлениеРуководителя,Организация,ДатаСведений);
	Возврат ПредставлениеРуководителя;
	
КонецФункции

// Возвращает ссылку на организацию прикладного объекта (документа)
//   Используется в библиотеке для определяемых типов "Основание[Документ]".
//
// Параметры:
//   Объект - Произвольный - объект конфигурации из которого требуется получить организацию
//
// Возвращаемое значение:
//   Неопределено                - отсутствует,
//   ОпределяемыйТип.Организация - ссылка на организацию.
//
Функция ОрганизацияИзПрикладногоОбъекта(Объект) Экспорт
	
	Организация = Неопределено;
	ИнтеграцияИСПереопределяемый.ПриОпределенииОрганизацииИзПрикладногоОбъекта(Организация, Объект);
	Возврат Организация;
	
КонецФункции

#КонецОбласти

Функция ПредставлениеОбъекта(ПараметрОбъект) Экспорт
	
	Представление = НСтр("ru = '<Не задано>'");
	ИнтеграцияИСПереопределяемый.УстановитьПредставлениеОбъекта(Представление, ПараметрОбъект);
	Возврат Представление;
	
КонецФункции

#КонецОбласти

// Возвращает количество строк в дереве значений с учетом их вложенности
// 
// Параметры:
//  ДеревоЗначений - ДеревоЗначений - Дерево значений, в котором требуется определить количество строк
// Возвращаемое значение:
//  Число - количество строк
// 	
Функция КоличествоСтрокДереваЗначений(ДеревоЗначений) Экспорт
	
	СтрокиДерева    = ДеревоЗначений.Строки;
	КоличествоСтрок = СтрокиДерева.Количество();
	
	Для Каждого ПодчиненнаяСтрока Из СтрокиДерева Цикл
		КоличествоСтрок = КоличествоСтрок + КоличествоСтрокДереваЗначений(ПодчиненнаяСтрока);
	КонецЦикла;
	
	Возврат КоличествоСтрок;
	
КонецФункции

// Возвращает признак вхождения переданного объекта метаданных в переданную подсистему
//
// Параметры:
//   ПолноеИмяИлиМетаданныеПодсистемы - Строка           - полное имя подсистемы с учетом родительских подсистем через "."
//                                    - ОбъектМетаданных - сама подсистема
//   ОбъектМетаданных                 - ОбъектМетаданных - объект метаданных для которого определяется принадлежность к подсистеме
//
// Возвращаемое значение:
//   Булево - признак вхождения объекта метаданных в подсистему
//
Функция СодержитсяВПодсистеме(ПолноеИмяИлиМетаданныеПодсистемы, ОбъектМетаданных) Экспорт
	
	Если ТипЗнч(ПолноеИмяИлиМетаданныеПодсистемы) = Тип("Строка") Тогда
		
		ИменаПодсистем = СтрРазделить(ПолноеИмяИлиМетаданныеПодсистемы, ".");
		Если ИменаПодсистем.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		МетаданныеПодсистемы = Метаданные;
		
		Для Каждого ИмяПодсистемы Из ИменаПодсистем Цикл
			МетаданныеПодсистемы = МетаданныеПодсистемы.Подсистемы[ИмяПодсистемы];
		КонецЦикла;
		
	Иначе
		
		МетаданныеПодсистемы = ПолноеИмяИлиМетаданныеПодсистемы;
		
	КонецЕсли;
	
	Если МетаданныеПодсистемы.Состав.Содержит(ОбъектМетаданных) Тогда
		Возврат Истина;
	КонецЕсли;

	Для Каждого ПодчиненнаяПодсистема Из МетаданныеПодсистемы.Подсистемы Цикл
		Если СодержитсяВПодсистеме(ПодчиненнаяПодсистема, ОбъектМетаданных) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#Область РаботаСФормойСпискаДокументов

// Устанавливает отбор в списке по указанному значению для нужной колонки
// с учетом переданной структуры быстрого отбора.
//
// Параметры:
//  Список - ТаблицаФормы - динамический список, для которого требуется установить отбор
//  ИмяКолонки - Строка - Имя колонки, по которой устанавливается отбор
//  Значение - Произвольный - устанавливаемое значение отбора
//  СтруктураБыстрогоОтбораРасширенная - Неопределено, Структура - ключи и значения отбора
//  Использование - Неопределено, Булево - Признак использования элемента отбора
//  ВидСравнения - Неопределено, ВидСравненияКомпоновкиДанных - вид сравнения, устанавливаемый для элемента отбора
//  ПриводитьЗначениеКЧислу - Булево - Признак приведения значения к числу.
//
Процедура ОтборПоЗначениюСпискаПриСозданииНаСервере(Список, ИмяКолонки, Значение, Знач СтруктураБыстрогоОтбораРасширенная,
			Использование = Неопределено, ВидСравнения = Неопределено, ПриводитьЗначениеКЧислу = Ложь) Экспорт
	
	Если СтруктураБыстрогоОтбораРасширенная <> Неопределено Тогда
		
		Если СтруктураБыстрогоОтбораРасширенная.Количество() = 2
			И СтруктураБыстрогоОтбораРасширенная.Свойство("ИмяПоля")
			И СтруктураБыстрогоОтбораРасширенная.Свойство("Настройки") Тогда
			СтруктураБыстрогоОтбора = СтруктураБыстрогоОтбораРасширенная.Настройки;
			ИмяКолонкиДляПоиска = СтруктураБыстрогоОтбораРасширенная.ИмяПоля;
		Иначе
			СтруктураБыстрогоОтбора = СтруктураБыстрогоОтбораРасширенная;
			ИмяКолонкиДляПоиска = ИмяКолонки;
		КонецЕсли;
		
		Если СтруктураБыстрогоОтбора <> Неопределено
			И СтруктураБыстрогоОтбора.Свойство(ИмяКолонкиДляПоиска) Тогда
			
			ЗначениеОтбора = СтруктураБыстрогоОтбора[ИмяКолонкиДляПоиска];
			Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
				
				Если ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") Тогда
					Значение.ЗагрузитьЗначения(ЗначениеОтбора.ВыгрузитьЗначения());
				ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
					Значение.ЗагрузитьЗначения(ЗначениеОтбора);
				Иначе
					Значение.Очистить();
					Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
						Значение.Добавить(ЗначениеОтбора);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				
				Значение = ЗначениеОтбора;
				
			КонецЕсли;
			
			Если ПриводитьЗначениеКЧислу Тогда
				Значение = ?(ЗначениеЗаполнено(Значение), Число(Значение), Значение);
			КонецЕсли;
			
			Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
				ИспользованиеЭлементаОтбора = ?(Использование = Неопределено, Значение.Количество() > 0, Использование);
			Иначе
				ИспользованиеЭлементаОтбора = ?(Использование = Неопределено, ЗначениеЗаполнено(Значение), Использование);
			КонецЕсли;
			
			Если Список <> Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, ИмяКолонки, Значение, ВидСравнения,,ИспользованиеЭлементаОтбора);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает настройки оформления формы списка документов ГосИС
//
// Возвращаемое значение:
//   Структура - Описание:
// * ЭлементыСтраницы    - Строка           - реквизиты формы - страницы (изменить тип если нет страниц к оформлению)
// * Списки              - Строка           - реквизиты формы - динамические списки документов (через запятую)
// * КОформлению         - Строка           - реквизиты формы - динамические списки к оформлению (через запятую)
// * ТипыКОформлению     - Неопределено     - списки к оформлению безусловно не используются
//                       - ОбъектМетаданных - определяемый тип, документы, для которых используются списки к оформлению
// * ЭлементыКОформлению - Строка           - элементы формы, связанные со списками к оформлению (скрыть если не используются)
// * ТипыКОбмену         - Неопределено     - команда "Выполнить обмен" недоступна
//                       - ОбъектМетаданных - определяемый тип, документы, при праве изменения которых доступна команда "Выполнить обмен"
// * ЭлементыКОбмену     - Строка           - элементы формы реализующие команду "Выполнить обмен" (через запятую)
//
Функция НастройкиФормыСпискаДокументов() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЭлементыСтраницы",    "Страницы");
	Результат.Вставить("Списки",              "Список");
	Результат.Вставить("КОформлению",         "СписокКОформлению");
	Результат.Вставить("ТипыКОформлению",     Неопределено);
	Результат.Вставить("ЭлементыКОформлению", "СтраницаКОформлению");
	Результат.Вставить("ТипыКОбмену",         Неопределено);
	Результат.Вставить("ЭлементыКОбмену",     "СписокВыполнитьОбмен");
	
	Возврат Результат;
	
КонецФункции

// Обработчик одноименного события в формах списков справочников ГосИС
//
// Параметры:
//   Форма     - ФормаКлиентскогоПриложения - источник события
//
Процедура ПриСозданииНаСервереФормыСпискаСправочников(Форма) Экспорт
	
	ОбщегоНазначенияИСКлиентСервер.НастроитьОтборПоОрганизации(Форма, Форма.Организации, "Отбор");
	
КонецПроцедуры

// Обработчик одноименного события в формах списков документов ГосИС
//
// Параметры:
//   Форма     - ФормаКлиентскогоПриложения - источник события
//   Настройки - См. НастройкиФормыСпискаДокументов
//
Процедура ПриСозданииНаСервереФормыСпискаДокументов(Форма, Настройки) Экспорт
	
	ИмяДокумента = ОбщегоНазначенияИСКлиентСервер.ИмяОбъектаИзИмениФормы(Форма, Ложь);
	ИспользоватьСпискиКОформлению = Настройки.ТипыКОформлению <> Неопределено
		И Настройки.ТипыКОформлению.Тип.СодержитТип(Тип("ДокументСсылка." + ИмяДокумента));
	
	УстановитьНавигационнуюСсылкуФормыСпискаДокументов(Форма, ИмяДокумента);
	
	МетаРеквизитОснование      = РеквизитДокументОснованиеДокументаИС(Метаданные.Документы[ИмяДокумента]);
	ТипыДокументаОснования     = МетаРеквизитОснование.Тип.Типы();
	СтрокиСоединенияДокументов = Новый Массив;
	СтрокиОтбораДокументов     = Новый Массив;
	ДокументИмеетОснования       = Ложь;
	
	// Подготовим строки соединения и отбора по доступным документам-основаниям.
	Для Каждого ТипОснования Из ТипыДокументаОснования Цикл
		
		МетаданныеОснования = Метаданные.НайтиПоТипу(ТипОснования);
		
		Если МетаданныеОснования = Неопределено Тогда
			Продолжить;
		ИначеЕсли Не Метаданные.Документы.Содержит(МетаданныеОснования) Тогда
			Продолжить;
		Иначе
			ДокументИмеетОснования = Истина;
		КонецЕсли;
		
		Если НЕ ПравоДоступа("Чтение", МетаданныеОснования) Тогда
			Продолжить;
		КонецЕсли;
		
		// Добавим соединение с документом-основанием для RLS.
		СтрокиСоединенияДокументов.Добавить("	ЛЕВОЕ СОЕДИНЕНИЕ Документ." + МетаданныеОснования.Имя + " КАК ДоступКДокументу" + МетаданныеОснования.Имя + "
			|		ПО Таблица.ДокументОснование = ДоступКДокументу" + МетаданныеОснования.Имя + ".Ссылка");
		
		СтрокиОтбораДокументов.Добавить("ДоступКДокументу" + МетаданныеОснования.Имя + ".Ссылка ЕСТЬ НЕ NULL");
		
	КонецЦикла;
	
	Если Не ДокументИмеетОснования Тогда
		
		// Документ не имеет основания
		ТекстСоединения               = "";
		ТекстОтбора                   = " ИЛИ ИСТИНА";
		ТекстОтбораКОформлению        = " И ЛОЖЬ";
		ИспользоватьСпискиКОформлению = Ложь;
		
	ИначеЕсли СтрокиОтбораДокументов.Количество() = 0 Тогда
		
		// Нет ни одного доступного документа-основания.
		ТекстСоединения               = "";
		ТекстОтбора                   = "";
		ТекстОтбораКОформлению        = " И ЛОЖЬ";
		ИспользоватьСпискиКОформлению = Ложь;
		
	Иначе
		
		ТекстСоединения         = СтрСоединить(СтрокиСоединенияДокументов, Символы.ПС);
		ТекстОтбора             = " ИЛИ " + СтрСоединить(СтрокиОтбораДокументов, Символы.ПС + " ИЛИ ");
		ТекстОтбораКОформлению  = " И ЛОЖЬ ИЛИ " + СтрСоединить(СтрокиОтбораДокументов, Символы.ПС + " ИЛИ ");
		
	КонецЕсли;
	
	ИменаВсехСписков                    = Новый Массив;
	СоответствеиИменСписковКОфоррмлению = Новый Соответствие;
	
	Если ЗначениеЗаполнено(Настройки.Списки) Тогда
		ИменаВсехСписков.Добавить(Настройки.Списки);
	КонецЕсли;
	
	СпискиКОформлению = Новый Структура(Настройки.КОформлению);
	
	Если ЗначениеЗаполнено(Настройки.КОформлению) И ИспользоватьСпискиКОформлению Тогда
		ИменаВсехСписков.Добавить(Настройки.КОформлению);
		Для Каждого ИмяСписка Из СпискиКОформлению Цикл
			СоответствеиИменСписковКОфоррмлению.Вставить(СокрЛП(ИмяСписка.Ключ), Истина);
		КонецЦикла;
	КонецЕсли;
	
	ИменаВсехСписков = СтрСоединить(ИменаВсехСписков, ",");
	
	//Выполним общие действия для всех динамических список формы.
	
	Для Каждого ИмяСписка Из Новый Структура(ИменаВсехСписков) Цикл
		
		Список = Форма[ИмяСписка.Ключ];
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Список,
			"ПустойДокументОснование",
			МассивПустыхЗначенийСоставногоТипа(МетаРеквизитОснование.Тип));
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Список,
			"БезОтбораПоОрганизации",
			Истина);
		
		Список.ТекстЗапроса = СтрЗаменить(
			Список.ТекстЗапроса,
			"//%СоединениеСОснованиями%",
			?(СпискиКОформлению.Свойство(ИмяСписка.Ключ),
				СтрЗаменить(ТекстСоединения, ".ДокументОснование", ".Основание"),
				ТекстСоединения));
		
		Если СоответствеиИменСписковКОфоррмлению.Получить(ИмяСписка.Ключ) = Неопределено Тогда
			Список.ТекстЗапроса = СтрЗаменить(
				Список.ТекстЗапроса, "//%ОтборПоДоступнымОснованиям%", ТекстОтбора);
		Иначе
			Список.ТекстЗапроса = СтрЗаменить(
				Список.ТекстЗапроса, "//%ОтборПоДоступнымОснованиям%", ТекстОтбораКОформлению);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ИспользоватьСпискиКОформлению Тогда
		
		Для Каждого ИмяСписка Из СпискиКОформлению Цикл
			
			Список = Форма[ИмяСписка.Ключ];
			Список.ОсновнаяТаблица = Неопределено;
			Список.ТекстЗапроса = 
			"ВЫБРАТЬ
			|Неопределено КАК Документ,
			|Неопределено КАК Ответственный,
			|Неопределено КАК СтатусОформления
			|ГДЕ ЛОЖЬ"
			
		КонецЦикла;
		
		Для Каждого ИмяЭлемента Из СтрРазделить(Настройки.ЭлементыКОформлению, ",", Ложь) Цикл
			
			Форма.Элементы[ИмяЭлемента].Видимость = Ложь;
			
		КонецЦикла;
		
		Для Каждого ИмяЭлемента Из СтрРазделить(Настройки.ЭлементыСтраницы, ",", Ложь) Цикл
			
			Форма.Элементы[ИмяЭлемента].ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
			
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьВидимостьКомандыВыполнитьОбмен(Форма, Настройки.ТипыКОбмену, Настройки.ЭлементыКОбмену);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Организации") Тогда
		ОбщегоНазначенияИСКлиентСервер.НастроитьОтборПоОрганизации(Форма, Форма.Организации, "Отбор");
	КонецЕсли;
	
	УстановитьВидимостьОтветственный(Форма, ИспользоватьСпискиКОформлению);
	
КонецПроцедуры

Процедура УстановитьВидимостьОтветственный(Форма, ИспользоватьСпискиКОформлению,
	ИмяЭлементаОтборОтветственный = "СтраницаОформленоОтборОтветственный") Экспорт
	
	УпрощеннаяИнтеграцияБЭД = УпрощеннаяИнтеграцияБЭД();
	Если УпрощеннаяИнтеграцияБЭД Тогда
		
		Если Форма.Элементы.Найти("Ответственный") <> Неопределено Тогда
			Форма.Элементы["Ответственный"].Видимость = Ложь;
		КонецЕсли;
		
		Если Форма.Элементы.Найти(ИмяЭлементаОтборОтветственный) <> Неопределено Тогда
			Форма.Элементы[ИмяЭлементаОтборОтветственный].Видимость = Ложь;
		КонецЕсли;
		
		Если ИспользоватьСпискиКОформлению Тогда
			Если Форма.Элементы.Найти("СтраницаКОформлениюОтборОтветственный") <> Неопределено Тогда
				Форма.Элементы["СтраницаКОформлениюОтборОтветственный"].Видимость = Ложь;
				Форма.Элементы["СписокКОформлениюОтветственный"].Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНавигационнуюСсылкуФормыСпискаДокументов(Форма, ИмяДокумента = "") Экспорт
	
	Если ИмяДокумента = "" Тогда
		ИмяДокумента = ОбщегоНазначенияИСКлиентСервер.ИмяОбъектаИзИмениФормы(Форма, Ложь);
	КонецЕсли;
	Форма.АвтоНавигационнаяСсылка = Ложь;
	Форма.НавигационнаяСсылка = "e1cib/data/Документ." + ИмяДокумента + ".Форма.ФормаСпискаДокументов";
	
КонецПроцедуры

#КонецОбласти

#Область КодыТНВЭДиОКПД2

// Определяет текст запроса получения информации по кодам ТНВЭД.
// 
// Параметры:
//  ТекстЗапроса - Строка.
Процедура ОпределитьТекстЗапросаСопоставлениеКодовТНВЭД(ТекстЗапроса) Экспорт
	
	ИнтеграцияИСПереопределяемый.ПриОпределенииТекстаЗапросаСопоставлениеКодовТНВЭД(ТекстЗапроса);
	
КонецПроцедуры

// Определяет текст запроса получения информации по кодам ОКПД2.
// 
// Параметры:
//  ТекстЗапроса - Строка.
Процедура ОпределитьТекстЗапросаСопоставлениеКодовОКПД2(ТекстЗапроса) Экспорт
	
	ИнтеграцияИСПереопределяемый.ПриОпределенииТекстаЗапросаСопоставлениеКодовОКПД2(ТекстЗапроса);
	
КонецПроцедуры

// Формирует текст запроса, возвращающий номенклатуру, для которой не заполнен или не верно заполнен вид маркируемой продукции.
// Вид маркируемой продукции определятся по ТН ВЭД и ОКПД2 номенклатуры.
// 
// Параметры:
//  ОтборПоТНВЭДиОКПД2 - Булево.
//  ТаблицаНоменклатуры - ТаблицаЗначений
//   *Номенклатура - ОпределяемыйТип.Номенклатура.
// 
// Возвращаемое значение:
//  Строка - Текст запроса.
Функция ТекстЗапросаТНВЭДиОКПД2Номенклатуры(ОтборПоТНВЭДиОКПД2 = Истина, ТаблицаНоменклатуры = Неопределено) Экспорт
	
	ИспользоватьОтборНоменклатуры = ТаблицаНоменклатуры <> Неопределено;
	
	Если ИспользоватьОтборНоменклатуры Тогда
		ИмяТаблицыНоменклатуры = "НоменклатураВременная";
	Иначе
		ИмяТаблицыНоменклатуры = "Номенклатура";
	КонецЕсли;
	
	ТекстЗапросаНоменклатуры = СтрШаблон(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО КАК Ссылка,
	|	"""" КАК ТНВЭД,
	|	"""" КАК ОКПД2
	|ПОМЕСТИТЬ %1",
	ИмяТаблицыНоменклатуры);
	
	ИнтеграцияИСПереопределяемый.ПриОпределенииТекстаЗапросаТНВЭДиОКПД2Номенклатуры(
		ТекстЗапросаНоменклатуры,
		ИмяТаблицыНоменклатуры,
		ИспользоватьОтборНоменклатуры);
	
	Если ИспользоватьОтборНоменклатуры Тогда
		Если ОтборПоТНВЭДиОКПД2 Тогда
			ТипСоединенияТаблиц = "ВНУТРЕННЕЕ";
		Иначе
			ТипСоединенияТаблиц = "ЛЕВОЕ";
		КонецЕсли;
		
		ТекстЗапросаНоменклатуры = СтрШаблон(
		"ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Номенклатура КАК Ссылка
		|ПОМЕСТИТЬ ТаблицаОтбораНоменклатуры
		|ИЗ
		|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|;
		|%1
		|;
		|ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(СправочникНоменклатура.ТНВЭД, """") КАК ТНВЭД,
		|	ЕСТЬNULL(СправочникНоменклатура.ОКПД2, """") КАК ОКПД2
		|ПОМЕСТИТЬ Номенклатура
		|ИЗ
		|	ТаблицаОтбораНоменклатуры КАК ТаблицаНоменклатуры
		|	%2 СОЕДИНЕНИЕ %3 КАК СправочникНоменклатура
		|	ПО ТаблицаНоменклатуры.Ссылка = СправочникНоменклатура.Ссылка
		|;
		|УНИЧТОЖИТЬ %3",
		ТекстЗапросаНоменклатуры,
		ТипСоединенияТаблиц,
		ИмяТаблицыНоменклатуры);
	КонецЕсли;
	
	Если ОтборПоТНВЭДиОКПД2 Тогда
		ТекстЗапросаНоменклатурыДляИсключения =
		"ВЫБРАТЬ
		|	СправочникНоменклатура.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ НоменклатураДляИсключения
		|ИЗ
		|	Номенклатура КАК СправочникНоменклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТНВЭДПОВидамПродукцииИС КАК КодыТНВЭД
		|	ПО СправочникНоменклатура.ТНВЭД = КодыТНВЭД.Код
		|		И СправочникНоменклатура.ТНВЭД <> """"
		|		И КодыТНВЭД.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОКПД2ПОВидамПродукцииИС КАК КодыОКПД2
		|	ПО СправочникНоменклатура.ОКПД2 = КодыОКПД2.Код
		|		И СправочникНоменклатура.ОКПД2 <> """"
		|		И КодыОКПД2.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатуры
		|	ПО СправочникНоменклатура.Ссылка = ОписаниеНоменклатуры.Номенклатура
		|ГДЕ
		|	КодыТНВЭД.Ссылка ЕСТЬ NULL И КодыОКПД2.Ссылка ЕСТЬ NULL
		|	ИЛИ (ОписаниеНоменклатуры.КлючВидовПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиВидовПродукцииИС.ПустаяСсылка)
		|		И (ОписаниеНоменклатуры.КлючВидовПродукции.ВидПродукцииГИСМТ = КодыТНВЭД.ВидПродукции
		|		ИЛИ ОписаниеНоменклатуры.КлючВидовПродукции.ВидПродукцииГИСМТ = КодыОКПД2.ВидПродукции))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Исключения.Номенклатура
		|ИЗ
		|	РегистрСведений.ИсключенияДляНастройкиНоменклатурыПоТНВЭДиОКПД2ИС КАК Исключения";
	Иначе
		ТекстЗапросаНоменклатурыДляИсключения =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	НЕОПРЕДЕЛЕНО КАК Ссылка
		|ПОМЕСТИТЬ НоменклатураДляИсключения";
	КонецЕсли;
	
	ИменаПолейКлюча = Новый Массив;
	Для Каждого ИмяПоляКлюча Из КонструкторИСОбщегоНазначенияКлиентСервер.ИменаПолейКлючаВидовПродукции() Цикл
		ИменаПолейКлюча.Добавить(СтрШаблон(
			"ОписаниеНоменклатуры.КлючВидовПродукции.%1 КАК Текущий%1",
			ИмяПоляКлюча));
	КонецЦикла;
	
	Возврат СтрШаблон(
	"%1
	|;
	|%2
	|;
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	КодыТНВЭД.Ссылка КАК ТНВЭД,
	|	КодыТНВЭД.ВидПродукции КАК ВидПродукцииПоТНВЭД,
	|	КодыОКПД2.Ссылка КАК ОКПД2,
	|	КодыОКПД2.ВидПродукции КАК ВидПродукцииПоОКПД2,
	|	НЕ СоответствиеТНВЭДиОКПД2.ТНВЭД ЕСТЬ NULL КАК ТНВЭДСоответствуетОКПД2,
	|	ОписаниеНоменклатуры.КлючВидовПродукции КАК ТекущийКлючВидовПродукции,
	|	%3
	|ИЗ
	|	Номенклатура КАК СправочникНоменклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураДляИсключения КАК НоменклатураДляИсключения
	|	ПО СправочникНоменклатура.Ссылка = НоменклатураДляИсключения.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТНВЭДПОВидамПродукцииИС КАК КодыТНВЭД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ВидыПродукцииТНВЭД
	|		ПО КодыТНВЭД.ВидПродукции = ВидыПродукцииТНВЭД.ВидПродукции
	|		И НЕ ВидыПродукцииТНВЭД.ПометкаУдаления
	|	ПО СправочникНоменклатура.ТНВЭД = КодыТНВЭД.Код
	|		И СправочникНоменклатура.ТНВЭД <> """"
	|		И КодыТНВЭД.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОКПД2ПОВидамПродукцииИС КАК КодыОКПД2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ВидыПродукцииОКПД2
	|		ПО КодыОКПД2.ВидПродукции = ВидыПродукцииОКПД2.ВидПродукции
	|		И НЕ ВидыПродукцииОКПД2.ПометкаУдаления
	|	ПО СправочникНоменклатура.ОКПД2 = КодыОКПД2.Код
	|		И СправочникНоменклатура.ОКПД2 <> """"
	|		И КодыОКПД2.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеТНВЭДиОКПД2ИС КАК СоответствиеТНВЭДиОКПД2
	|	ПО СоответствиеТНВЭДиОКПД2.ТНВЭД = КодыТНВЭД.Ссылка
	|		И СоответствиеТНВЭДиОКПД2.ОКПД2 = КодыОКПД2.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатуры
	|	ПО СправочникНоменклатура.Ссылка = ОписаниеНоменклатуры.Номенклатура
	|ГДЕ
	|	НоменклатураДляИсключения.Ссылка ЕСТЬ NULL
	|УПОРЯДОЧИТЬ
	|	ПО Номенклатура",
	ТекстЗапросаНоменклатуры,
	ТекстЗапросаНоменклатурыДляИсключения,
	СтрСоединить(ИменаПолейКлюча, ","));
	
КонецФункции

#КонецОбласти

// Определяет включено ли ведение учета продукции, подлежащей маркированию.
// Возвращаемое значение:
//  Булево - Истина, если учет ведется.
Функция УчитываемыеВидыМаркируемойПродукции() Экспорт
	
	ВидыПродукции = Новый Массив;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЕГАИС") Тогда
		МодульОбщегоНазначенияЕГАИСВызовСервера = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ОбщегоНазначенияЕГАИСВызовСервера");
		ВидыПродукцииЕГАИС = МодульОбщегоНазначенияЕГАИСВызовСервера.УчитываемыеВидыМаркируемойПродукции();
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыПродукции, ВидыПродукцииЕГАИС);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСерверПовтИсп");
		ВидыПродукцииИСМП = ОбщийМодуль.УчитываемыеВидыМаркируемойПродукции();
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыПродукции, ВидыПродукцииИСМП);
	КонецЕсли;
	
	Возврат ВидыПродукции;
	
КонецФункции

// Заполняет указанную контактную информацию.
// 
// Параметры:
//  Адрес  - Строка - адрес во внутреннем формате JSON или в XML, соответствующем XDTO-пакету Адрес.
//  Данные - Структура - содержит имена данных, которые необходимо заполнить из строки Адрес.
//  ДополнительныеПараметры - См. РаботаСАдресами.СведенияОбАдресе.ДополнительныеПараметры 
Процедура ДанныеИзСтрокиКонтактнойИнформации(Адрес, Данные, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ПустаяСтрока(Адрес) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(Адрес);
	СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(ДанныеКИ, ДополнительныеПараметры);
	
	ЗаполнитьЗначенияСвойств(Данные, СведенияОбАдресе);
	
КонецПроцедуры

Функция ЗначенияРеквизитовТранспортногоСредства(ТранспортноеСредство) Экспорт
	
	РеквизитыТранспортногоСредства = Новый Структура;
	РеквизитыТранспортногоСредства.Вставить("НомерТранспортногоСредства");
	РеквизитыТранспортногоСредства.Вставить("НомерАвтомобильногоКонтейнера");
	
	ИнтеграцияИСПереопределяемый.ПриОпределенииРеквизитовТранспортногоСредства(РеквизитыТранспортногоСредства, ТранспортноеСредство);
	Возврат РеквизитыТранспортногоСредства;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Дополнить параметры элементов конструктора расширенной версии БГосИС
// 
// Параметры:
//  Результат - см. Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементовКонструктора
Процедура ДополнитьПараметрыЭлементовКонструктора(Результат) Экспорт
	
	//
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПричиныПеремаркировкиКодовМаркировки,
		Тип("ПеречислениеСсылка.ПричиныПеремаркировкиТоваровИСМП"));
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляНоменклатураВТабличнойЧасти);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеБезУчетаНоменклатуры);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеВвезенПослеДатыОбязательнойМаркировки);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеПриобретенПроизведенПослеДатыОбязательнойМаркировки);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляПриобретенПроизведенПослеДатыОбязательнойМаркировки);	
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеПроизводственныйОбъектИдентификатор);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеОжидаемаяДатаНачалаПроизводства);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляПроизводственныйОбъектИдентификатор);
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(Результат, ПараметризуемыеЭлементы,
		Тип("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляGTIN);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляКонтрагент);
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат, ПараметризуемыеЭлементы,
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"),
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"),
		Тип("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	
	//
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляПроизводственныйОбъектАдресСтрокой,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"),
		Тип("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"),
		Тип("ПеречислениеСсылка.СпособыПолученияИзготовленныхКИЗГИСМ"));
	
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.СпособВводаВОборотПриПеремаркировке,
		Тип("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	
	//
	СвязьЭлементаСправочникаИЗначенияЗначенияПеречисленияШаблоныКодовМаркировки = Справочники.ЭлементыКонструктораВидовПродукцииИС.СвязьЭлементаСправочникаИЗначенияЗначенияПеречисленияШаблоныКодовМаркировки;
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,СвязьЭлементаСправочникаИЗначенияЗначенияПеречисленияШаблоныКодовМаркировки,
		Тип("ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ"));
	Результат[СвязьЭлементаСправочникаИЗначенияЗначенияПеречисленияШаблоныКодовМаркировки].ПоВсемВидамПродукции = Истина;
	Результат[СвязьЭлементаСправочникаИЗначенияЗначенияПеречисленияШаблоныКодовМаркировки].ИспользоватьАтрибуты = Истина;
	Результат[СвязьЭлементаСправочникаИЗначенияЗначенияПеречисленияШаблоныКодовМаркировки].Атрибуты.Вставить(
		"Шаблон", Новый ОписаниеТипов("СправочникСсылка.ШаблоныКодовМаркировкиСУЗ"));
	
	//
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляИдентификаторПроизводственнойЛинии,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"),
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"),
		Тип("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеИдентификаторГосударственногоКонтракта);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеЦена);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляЦена);
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат, ПараметризуемыеЭлементы,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"),
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"),
		Тип("СправочникСсылка.ВидыВозвратаВОборотИСМП"));
	
	//
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеПредставлениеАдресаПроизводственногоОбъекта,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"),
		Тип("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ВОтчетеОСписанииИспользоватьНеполныйКод);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.СписаниеЧерезГИСМТОбщийДокумент);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.СписаниеЧерезСУЗ);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.СписаниеЧерезГИСМТ);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.СписаниеЧерезСУЗМех);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.УведомлениеОбОтгрузкеНаЭкспорт);
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат, ПараметризуемыеЭлементы,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"));
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПричиныВыводаИзОборотаПоштучно);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПричиныВыводаИзОборотаОСУ);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеОписаниеПричины);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеАдрес);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляАдрес);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеКПП);
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат, ПараметризуемыеЭлементы,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"));
	
	//
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеКонтрагент,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"),
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"));
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеВидВозврата);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ВидВозвратаВОборотТовараПриобретавшегосяНеДляПродажи);
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат, ПараметризуемыеЭлементы,
		Тип("СправочникСсылка.ВидыВозвратаВОборотИСМП"));

	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляКодФИАС);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляПроизводственныйОбъект);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеКодФИАС);
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат, ПараметризуемыеЭлементы,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"));
	
	//
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеСпособВводаВОборот,
		Тип("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеВладелецGTIN);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеСпособВводаВОборот);
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат, ПараметризуемыеЭлементы,
		Тип("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеВидПервичногоДокумента);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляВидПервичногоДокумента);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеНомерДатаПервичногоДокумента);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляНомерДатаПервичногоДокумента);
	
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат, ПараметризуемыеЭлементы,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"),
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"),
		Тип("СправочникСсылка.ВидыВозвратаВОборотИСМП"));
	
	//
	ПараметризуемыеЭлементы = Новый Массив;
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеСтранаНазначения);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеТаможеннаяДекларация);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеПроизводственныйОбъект);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляСтранаНазначения);
	ПараметризуемыеЭлементы.Добавить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляТаможеннаяДекларация);
	
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат, ПараметризуемыеЭлементы,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"),
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"));
	
	//
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеОплачен,
		Тип("СправочникСсылка.ВидыВозвратаВОборотИСМП"));
	
	//
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеИдентификаторПроизводственнойЛинии,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"),
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"),
		Тип("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	
	//
	Если ОбщегоНазначенияИС.ПодсистемаСуществует("ЗЕРНО") Тогда
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
			Результат,
			Справочники.ЭлементыКонструктораВидовПродукцииИС.РазделыУчетаЗЕРНО,
			Тип("ПеречислениеСсылка." + "РазделыУчетаЗЕРНО"));
	КонецЕсли;
	
	//
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ЧастичноеВыбытиеПриВыводеИзОборота,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"));
	
	//
	СырьеПоддерживаетКодОКЕИ = Справочники.ЭлементыКонструктораВидовПродукцииИС.СырьеПоддерживаетКодОКЕИ;
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		СырьеПоддерживаетКодОКЕИ,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"),
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"));
	Результат[СырьеПоддерживаетКодОКЕИ].ИспользоватьАтрибуты = Истина;
	Результат[СырьеПоддерживаетКодОКЕИ].Атрибуты.Вставить(
		"КодыОКЕИ", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	
	//
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ИдентификаторТипаСырья,
		ОбщегоНазначения.ОписаниеТипаСтрока(3));
	
	//
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПрефиксИдентификационногоКодаСырья,
		ОбщегоНазначения.ОписаниеТипаСтрока(3));
		
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеКонтрагентНерезидент,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"),
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"));
		
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеСтранаЕЭАС,
		Тип("СправочникСсылка.ПричиныВыводаИзОборотаИСМП"),
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"));
	
	Справочники.ЭлементыКонструктораВидовПродукцииИС.ДобавитьПараметризуемыеЭлементы(
		Результат,
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолеСтранаПроисхождения,
		Тип("ПеречислениеСсылка.ВидыОперацийИСМП"));
		
КонецПроцедуры

Процедура ПеренестиДеревоРекурсивно(ДеревоИсточник, ДеревоПриемник, ОчищатьПриемник = Истина) Экспорт
	
	Если ОчищатьПриемник Тогда 
		ДеревоПриемник.ПолучитьЭлементы().Очистить();
	КонецЕсли;
	
	Для Каждого Элемент Из ДеревоИсточник.ПолучитьЭлементы() Цикл
		
		НовыйЭлемент = ДеревоПриемник.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элемент);
		ПеренестиДеревоРекурсивно(Элемент,НовыйЭлемент,Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает видимость команды "Выполнить обмен" в формах документов, протокола и панели обмена.
//
Процедура УстановитьВидимостьКомандыВыполнитьОбмен(Форма, ТипыДляОбмена, ИменаЭлементов) Экспорт
	
	Если ТипыДляОбмена=Неопределено Или НЕ ОбщегоНазначенияИС.ПравоОпределяемогоТипа(ТипыДляОбмена, "Изменение") Тогда
		Для Каждого ЭлементФормы Из СтрРазделить(ИменаЭлементов, ",", Ложь) Цикл
			Кнопка = Форма.Элементы.Найти(ЭлементФормы);
			Если Кнопка <> Неопределено Тогда
				Кнопка.Видимость = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоставитьСтрокуСоставаУпаковки(СтрокаСостава, СтрокиТекущейЧасти, Знач ОграничительСостава, Уровень = 1)
	
	ЭтоПоследнийУровень = Не Уровень = 1;
	ОграничительСостава = Цел(ОграничительСостава / СтрокиТекущейЧасти.Количество());
	
	Для Каждого СтрокаЧастиНаименования Из СтрокиТекущейЧасти Цикл
		
		Если Не ПустаяСтрока(СтрокаСостава) Тогда
			Если Уровень = 1 Тогда
				Если Прав(СтрокаСостава, 1) = "," Тогда
					СтрокаСостава = Сред(СтрокаСостава, 1, СтрДлина(СтрокаСостава) - 1);
				КонецЕсли;
				СтрокаСостава = СтрокаСостава + ";";
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаЧастиНаименования["ЧастьНаименования" + Уровень]) Тогда
			СтрокаСостава = СтрШаблон("%1 %2", СтрокаСостава, СтрокаЧастиНаименования["ЧастьНаименования" + Уровень]);
		КонецЕсли;
		
		СтрокиСледующейЧасти = СтрокаЧастиНаименования.Строки;
		
		Если СтрокиСледующейЧасти.Количество() > 0
			И Цел(ОграничительСостава / СтрокиСледующейЧасти.Количество()) > 0 Тогда
			СоставитьСтрокуСоставаУпаковки(СтрокаСостава, СтрокиСледующейЧасти, ОграничительСостава, Уровень + 1);
			ЭтоПоследнийУровень = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтоПоследнийУровень Тогда
		СтрокаСостава = СтрокаСостава + ",";
	КонецЕсли;
	
КонецПроцедуры

Функция БазовыеПараметрыОбработкиТабличнойЧастиТовары(ВидыПродукции = Неопределено)
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ВидыПродукцииИС",                Новый Массив);
	ПараметрыЗаполнения.Вставить("ЗаполнитьАртикул",               Ложь);
	ПараметрыЗаполнения.Вставить("ЗаполнитьКод",                   Ложь);
	ПараметрыЗаполнения.Вставить("ЗаполнитьЕдиницуИзмерения",      Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнитьТипНоменклатуры",       Истина);
	ПараметрыЗаполнения.Вставить("ОбработатьУпаковки",             Истина);
	ПараметрыЗаполнения.Вставить("ПересчитатьКоличествоЕдиниц",    Истина);
	ПараметрыЗаполнения.Вставить("ПересчитатьКоличествоУпаковок",  Истина);
	ПараметрыЗаполнения.Вставить("ПересчитатьСумму",               Ложь);
	ПараметрыЗаполнения.Вставить("ПересчитатьЦенуПоСумме",         Ложь);
	ПараметрыЗаполнения.Вставить("ПроверитьСериюРассчитатьСтатус", Ложь);
	ПараметрыЗаполнения.Вставить("ШтрихкодыВТЧ",                   Ложь);
	ПараметрыЗаполнения.Вставить("МаркируемаяПродукцияВТЧ",        Ложь);
	ПараметрыЗаполнения.Вставить("ЗаполнитьКодТНВЭД",              Ложь);
	ПараметрыЗаполнения.Вставить("ЗаполнитьСтавкуНДС",             Ложь);
	
	Если ВидыПродукции <> Неопределено Тогда
		ПараметрыЗаполнения.ВидыПродукцииИС = ВидыПродукции;
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Возвращает признак возможности использования обработки ПанельАдминистрированияБСП.
// 
// Возвращаемое значение:
//  Булево - признак возможности использования текущим пользователем обработки ПанельАдминистрированияБСП.
//
Функция ПравоДоступаПанельАдминистрированиеБСП() Экспорт
	
	Возврат ПравоДоступа("Использование", Метаданные.Обработки.ПанельАдминистрированияБСП);
	
КонецФункции

// Получает таблицу настроенных упаковок для номенклатуры
// 
// Параметры:
//  Номенклатура - ОпределяемыйТип.Номенклатура
//               - Массив из ОпределяемыйТип.Номенклатура
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. НоваяТаблицаУпаковокНоменклатуры
Функция УпаковкиНоменклатуры(Номенклатура) Экспорт
	
	ВозвращаемоеЗначение = НоваяТаблицаУпаковокНоменклатуры();
	
	ИнтеграцияИСПереопределяемый.ПриЗаполнениУпаковокНоменклатуры(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Номенклатура),
		ВозвращаемоеЗначение);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Создает пустую таблицу упаковок номенклатуры.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица упаковок номенклатуры:
// * Номенклатура                       - ОпределяемыйТип.Номенклатура
// * Упаковка                           - ОпределяемыйТип.Упаковка
// * Коэффициент                        - Число - количество базовых единиц в упаковке
// * ЯвляетсяПотребительской            - Булево - упаковая является базовой для номенклатуры
// * ЯвляетсяУпаковкойЧастичногоВыбытия - Булево - упаковка является упаковкой частичного выбытия для номенклатуры
Функция НоваяТаблицаУпаковокНоменклатуры()
	
	ВозвращаемоеЗначение = Новый ТаблицаЗначений();
	ВозвращаемоеЗначение.Колонки.Добавить("Номенклатура",                       Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	ВозвращаемоеЗначение.Колонки.Добавить("Упаковка",                           Метаданные.ОпределяемыеТипы.Упаковка.Тип);
	ВозвращаемоеЗначение.Колонки.Добавить("Коэффициент",                        ОбщегоНазначения.ОписаниеТипаЧисло(22, 8));
	ВозвращаемоеЗначение.Колонки.Добавить("ПредставлениеУпаковки",              ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ВозвращаемоеЗначение.Колонки.Добавить("ЯвляетсяПотребительской",            Новый ОписаниеТипов("Булево"));
	ВозвращаемоеЗначение.Колонки.Добавить("ЯвляетсяУпаковкойЧастичногоВыбытия", Новый ОписаниеТипов("Булево"));
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#Область РаботаСКлассификаторами

// Проблемы классификаторов в панели обмена.
// 
// Параметры:
//  РасширенноеОписаниеТребуетсяЗагрузка - Булево - Расширенное описание требуется загрузка
// 
// Возвращаемое значение:
//  Структура - Проблемы классификаторов в панели обмена:
// * ДоступноОбновлениеОписание 
// * ДоступноОбновлениеТекстПодсказки 
// * ЭтоКритичнаяПроблема - Булево - 
// * ИнтерактивнаяЗагрузкаДоступна - Булево - 
Функция ПроблемыКлассификаторовВПанелиОбмена(РасширенноеОписаниеТребуетсяЗагрузка = Ложь) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ДоступноОбновлениеОписание");
	ВозвращаемоеЗначение.Вставить("ДоступноОбновлениеТекстПодсказки");
	ВозвращаемоеЗначение.Вставить("ЭтоКритичнаяПроблема", Ложь);
	ВозвращаемоеЗначение.Вставить(
		"ИнтерактивнаяЗагрузкаДоступна",
		РаботаСКлассификаторами.ИнтерактивнаяЗагрузкаКлассификаторовДоступна());
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ИдентификаторыКлассификаторов  = ОбщегоНазначенияИС.ИдентификаторыКлассификаторов();
	
	РазделениеВключено             = ОбщегоНазначения.РазделениеВключено();
	ИдентификаторыДляЗагрузки      = Новый Массив();
	ВидыКлассификаторовКОбновлению = Новый Массив();
	
	Для Каждого КлючИЗначение Из ИдентификаторыКлассификаторов Цикл
		ИдентификаторыДляЗагрузки.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	ДанныеПодсказки = Новый Массив;
	
	Если РазделениеВключено Тогда
		ТекстыЗапроса  = Новый СписокЗначений;
		
		Для каждого КлючИЗначение Из ИдентификаторыКлассификаторов Цикл
			ТекстЗапроса = ТекстЗапросаПроверкиНеобходимостиЗагрузкиКлассификатора(КлючИЗначение.Ключ);
			
			Если ТекстЗапроса <> "" Тогда
				ТекстыЗапроса.Добавить(ТекстЗапроса, КлючИЗначение.Ключ);
			КонецЕсли;
			
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Истина);
		
		ПроверкаЗагрузки  = Новый Запрос;
		РезультатыЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(ПроверкаЗагрузки, ТекстыЗапроса);
		
		ДоступныеКлассификаторыДляЗагрузки = Новый Массив();
		
		Для каждого КлючИЗначение Из ИдентификаторыКлассификаторов Цикл
			ВыборкаПоКлассификатору = РезультатыЗапроса[КлючИЗначение.Ключ].Выбрать();
			
			Если Не ВыборкаПоКлассификатору.Количество() Тогда
				ДоступныеКлассификаторыДляЗагрузки.Добавить(КлючИЗначение.Значение.Наименование);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДоступныеКлассификаторыДляЗагрузки.Количество() Тогда
			
			ВозвращаемоеЗначение.ДоступноОбновлениеОписание = НСтр("ru = 'Требуется загрузить классификаторы'");
			ДанныеПодсказки.Добавить(СтрСоединить(ДоступныеКлассификаторыДляЗагрузки, ", "));
			ДанныеПодсказки.Добавить(Символы.ПС);
			ДанныеПодсказки.Добавить(НСтр("ru = 'Обратитесь к администратору сервиса.'"));
			
			ВозвращаемоеЗначение.ЭтоКритичнаяПроблема = Истина;
			
		КонецЕсли;
		
	Иначе
		
		УстановитьПривилегированныйРежим(Истина);
		ДоступныеОбновления = РаботаСКлассификаторами.ДоступныеОбновленияКлассификаторов(ИдентификаторыДляЗагрузки);

		ДоступныеКлассификаторыДляОбновления = Новый Массив();
		ДоступныеКлассификаторыДляЗагрузки   = Новый Массив();

		Если ЗначениеЗаполнено(ДоступныеОбновления.КодОшибки)
			И ДоступныеОбновления.КодОшибки <> "ОбновлениеНеТребуется" Тогда
			
			ВозвращаемоеЗначение.ДоступноОбновлениеОписание = НСтр("ru = 'Не удалось проверить актуальность классификаторов через Интернет-поддержку'");
			ДанныеПодсказки.Добавить(ДоступныеОбновления.СообщениеОбОшибке);
			
		Иначе
			
			Для Каждого СтрокаТаблицы Из ДоступныеОбновления.ДоступныеВерсии Цикл
				ТекущаяВерсия = РаботаСКлассификаторами.ВерсияКлассификатора(СтрокаТаблицы.Идентификатор);
				Если ЗначениеЗаполнено(ТекущаяВерсия) Тогда
					ДоступныеКлассификаторыДляОбновления.Добавить(СтрокаТаблицы.Наименование);
				Иначе
					ДоступныеКлассификаторыДляЗагрузки.Добавить(СтрокаТаблицы.Наименование);
				КонецЕсли;
				ВидыКлассификаторовКОбновлению.Добавить(ИдентификаторыКлассификаторов[СтрокаТаблицы.Идентификатор].ВидКлассификатора);
			КонецЦикла;
			
		КонецЕсли;
	
		Если ДоступныеКлассификаторыДляОбновления.Количество()
			Или ДоступныеКлассификаторыДляЗагрузки.Количество() Тогда
			
			ВозвращаемоеЗначение.ДоступноОбновлениеОписание = НСтр("ru = 'Доступны обновления классификаторов'");
			
			Если ДоступныеКлассификаторыДляЗагрузки.Количество() Тогда
				ДанныеПодсказки.Добавить(НСтр("ru = 'Требуется загрузить классификаторы:'"));
				ДанныеПодсказки.Добавить(" ");
				ДанныеПодсказки.Добавить(СтрСоединить(ДоступныеКлассификаторыДляЗагрузки, ", "));
				ВозвращаемоеЗначение.ЭтоКритичнаяПроблема = Истина;
			КонецЕсли;
			
			Если ДоступныеКлассификаторыДляОбновления.Количество() Тогда
				Если ДоступныеКлассификаторыДляЗагрузки.Количество() Тогда
					ДанныеПодсказки.Добавить(Символы.ПС);
				КонецЕсли;
				ДанныеПодсказки.Добавить(НСтр("ru = 'Требуется обновить классификаторы:'"));
				ДанныеПодсказки.Добавить(" ");
				ДанныеПодсказки.Добавить(СтрСоединить(ДоступныеКлассификаторыДляОбновления, ", "));
			КонецЕсли;
			
			Если Не ВозвращаемоеЗначение.ИнтерактивнаяЗагрузкаДоступна Тогда
				ДанныеПодсказки.Добавить(Символы.ПС);
				ДанныеПодсказки.Добавить(НСтр("ru='У Вас недостачно прав для выполнения данной операции, обратитесь к администратору.'"));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение.ДоступноОбновлениеТекстПодсказки = Новый ФорматированнаяСтрока(ДанныеПодсказки);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ТекстЗапросаПроверкиНеобходимостиЗагрузкиКлассификатора(Классификатор)
	
	ТекстЗапроса = ОбщегоНазначенияИС.ТекстЗапросаПроверкиНеобходимостиЗагрузкиКлассификаторовИС(Классификатор);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

// Функция возвращает признак, что документ может быть создан как корректировочный при ошибках оформления
// 
// Параметры:
//  МетаданныеДокумента - ОбъектМетаданных - метаданные объекта, который надо определить
// 
// Возвращаемое значение:
//  Булево - Истина, если может быть оформлен корректирующий документ по ошибкам оформления
Функция ДокументПоддерживаетКорректировку(МетаданныеДокумента) Экспорт
	
	МассивМетаданных = Новый Массив;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЗЕРНО") Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияЗЕРНО");
		Модуль.ДополнитьСписокДокументовПоддерживающихКорректировку(МассивМетаданных);
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСМП");
		Модуль.ДополнитьСписокДокументовПоддерживающихКорректировку(МассивМетаданных);
		
	КонецЕсли;
	
	Возврат МассивМетаданных.Найти(МетаданныеДокумента) <> Неопределено;
	
КонецФункции

// Функция возвращает заголовок документа, поддерживающего корректировку.
// 
// Параметры:
//  СсылкаНаДокумент         - ДокументСсылка - ссылка на любой документ, поддерживающий корректировку
//  КорректировочныйДокумент - Булево - признак, что документ является корректировочным
//  НомерДокумента           - Строка, Число - номер документа
//  ДатаДокумента            - Дата - дата документа
// 
// Возвращаемое значение:
//  Строка - заголовок-представление документа в зависимости от переданных параметров
Функция ЗаголовокДокументаПоддерживающегоКорректировку(СсылкаНаДокумент, КорректировочныйДокумент, НомерДокумента, ДатаДокумента) Экспорт
	
	ФорматПредставленияДокумента         = НСтр("ru = '%1 %2 от %3'");
	ФорматПредставленияНовогоДокумента   = НСтр("ru = '%1 (создание)'");
	
	Если СсылкаНаДокумент = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ПредставленияДокумента = ПредставлениеДокументаПоддерживающегоКорректировку(СсылкаНаДокумент.Метаданные());
	
	Если КорректировочныйДокумент Тогда
		НаименованиеДокумента = ПредставленияДокумента.Корректировочный;
	Иначе
		НаименованиеДокумента = ПредставленияДокумента.Основной;
	КонецЕсли;
	
	Если СсылкаНаДокумент.Пустая() Тогда
		Представление = СтрШаблон(ФорматПредставленияНовогоДокумента, НаименованиеДокумента);
	Иначе
		Представление = СтрШаблон(ФорматПредставленияДокумента, НаименованиеДокумента, НомерДокумента, ДатаДокумента);
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Функция формирует представление конкретного документа, поддерживающего корректировку.
// 
// Параметры:
//  МетаданныеДокумента - ОбъектМетаданных - метаданные документа, поддерживающего корректировку
// 
// Возвращаемое значение:
//  Структура - Представление документа поддерживающего корректировку:
//   * Основной - Строка - шаблон основного представления документа
//   * Корректировочный - Строка - шаблон представления корректировочного документа
Функция ПредставлениеДокументаПоддерживающегоКорректировку(МетаданныеДокумента) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура("Основной, Корректировочный", "", "");
	
	ПредставлениеНаименований = ПредставленияДокументовПоддерживающихКорректировку().Получить(МетаданныеДокумента);
	
	Если Не ПредставлениеНаименований = Неопределено Тогда
		
		ВозвращаемоеЗначение.Основной         = ПредставлениеНаименований.Основной;
		ВозвращаемоеЗначение.Корректировочный = ПредставлениеНаименований.Корректировочный;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Функция формирует представления всех документов, поддерживающих корректировку.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - ОбъектМетаданных - метаданные документа, поддерживающего корректировку
//   * Значение - Структура из КлючИЗначение:
//     ** Основной - Строка - шаблон основного представления документа
//     ** Корректировочный - Строка - шаблон представления корректировочного документа
Функция ПредставленияДокументовПоддерживающихКорректировку()
	
	СоответствиеПредставлений = Новый Соответствие();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ЗЕРНО") Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияЗЕРНО");
		Модуль.ДополнитьПредставленияДокументовПоддерживающихКорректировку(СоответствиеПредставлений);
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСМП");
		Модуль.ДополнитьПредставленияДокументовПоддерживающихКорректировку(СоответствиеПредставлений);
		
	КонецЕсли;
	
	Возврат СоответствиеПредставлений;
	
КонецФункции

#КонецОбласти
