////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с номенклатурой".
// ОбщийМодуль.РаботаСНоменклатуройКлиентУТ.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ФормаПоискНоменклатурыПоШтрихкоду

// См. РаботаСНоменклатуройКлиентПереопределяемый.ПоискНоменклатурыПоШтрихкодуПриОткрытии.
Процедура ПоискНоменклатурыПоШтрихкодуПриОткрытии(Форма) Экспорт
	
	#Если Не ВебКлиент Тогда
	Сигнал();
	#КонецЕсли
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, Форма, "СканерШтрихкода");
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ПоискНоменклатурыПоШтрихкодуПриЗакрытии.
Процедура ПоискНоменклатурыПоШтрихкодуПриЗакрытии(Форма, ЗавершениеРаботы) Экспорт
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, Форма);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ПоискНоменклатурыПоШтрихкодуОбработкаОповещения.
Процедура ПоискНоменклатурыПоШтрихкодуОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ШтрихКоды) Экспорт
	
	// ПодключаемоеОборудование
	Если Форма.ВводДоступен()
		И Источник = "ПодключаемоеОборудование" Тогда
		
		Если ИмяСобытия = "ScanData"
			И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			
			ОбработатьШтрихкоды(Форма, МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр));
			
		КонецЕсли;
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ПоискНоменклатурыПоШтрихкодуОбработкаВыбора.
Процедура ПоискНоменклатурыПоШтрихкодуОбработкаВыбора(Форма, ВыбранноеЗначение, ИсточникВыбора) Экспорт
	//++ Локализация
	Если Форма.ЕстьАлкогольнаяПродукция Тогда
		
		СобытияФормИСКлиентПереопределяемый.ОбработкаВыбораНоменклатуры(
			Новый ОписаниеОповещения("ПриВыбореНоменклатуры", ЭтотОбъект, Форма), ВыбранноеЗначение, ИсточникВыбора);
			
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

// Процедура, вызываемая при изменении поля Номенклатура формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - форма поиска номенклатуры по штрихкоду.
//  Элемент	 - ПолеФормы - изменяемое поле формы.
//
Процедура ПоискНоменклатурыПоШтрихкодуНоменклатураПриИзменении(Форма, Элемент) Экспорт
	
	ТекущиеДанные = Форма.Элементы.ШтрихкодыНоменклатуры.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу",	ТекущиеДанные.Характеристика);
	СтруктураДействий.Вставить("ПроверитьСериюПоВладельцу",				ТекущиеДанные.Серия);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу",	ТекущиеДанные.Упаковка);
	СтруктураДействий.Вставить("ПроверитьРегистрациюШтрихкода",			ТекущиеДанные.Зарегистрирован);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, Неопределено);
	
КонецПроцедуры

// Процедура, вызываемая при создании в поле Номенклатура формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма из обработчика события которой происходит вызов процедуры.
//  Элемент				 - ПолеФормы - элемент формы.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ПоискНоменклатурыПоШтрихкодуНоменклатураСоздание(Форма, Элемент, СтандартнаяОбработка) Экспорт
	//++ Локализация
	ТекущиеДанные = Форма.Элементы.ШтрихкодыНоменклатуры.ТекущиеДанные;
	
	Если Форма.ЕстьАлкогольнаяПродукция
		И ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.АлкогольнаяПродукция) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СобытияФормЕГАИСКлиент.ПриСозданииНоменклатуры(Элемент, ТекущиеДанные, СтандартнаяОбработка)
		
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

// Процедура, вызываемая при начале выбора в поле Номенклатура формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма из обработчика события которой происходит вызов процедуры.
//  Элемент				 - ПолеФормы - элемент формы.
//  ДанныеВыбора		 - СписокЗначений - данные выбора..
//  СтандартнаяОбработка - Булево -  признак стандартной обработки.
//
Процедура ПоискНоменклатурыПоШтрихкодуНоменклатураНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	//++ Локализация
	ТекущиеДанные = Форма.Элементы.ШтрихкодыНоменклатуры.ТекущиеДанные;
	
	Если Форма.ЕстьАлкогольнаяПродукция
		И ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.АлкогольнаяПродукция) Тогда
		
		СобытияФормИСКлиентПереопределяемый.ПриНачалеВыбораНоменклатуры(
			Форма, КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииЕГАИС(), СтандартнаяОбработка,,
			ИнтеграцияЕГАИСВызовСервера.РеквизитыАлкогольнойПродукцииДляСозданияНоменклатуры(ТекущиеДанные.АлкогольнаяПродукция));
		
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

// Процедура, вызываемая при изменении поля Характеристика формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма поиска номенклатуры по штрихкоду.
//	Элемент - ПолеФормы - изменяемое поле формы.
//
Процедура ПоискНоменклатурыПоШтрихкодуХарактеристикаПриИзменении(Форма, Элемент) Экспорт
	
	ТекущиеДанные = Форма.Элементы.ШтрихкодыНоменклатуры.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьРегистрациюШтрихкода", ТекущиеДанные.Зарегистрирован);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, Неопределено);
	
КонецПроцедуры

// Процедура, вызываемая при изменении элемента подключаемой команды формы ПоискНоменклатурыПоШтрихкоду.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма из обработчика события которой происходит вызов процедуры.
//	Элемент - ПолеФормы - элемент формы.
//
Процедура ПоискНоменклатурыПоШтрихкодуПриИзменении(Форма, Элемент) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Элементы.Упаковка.Имя = Элемент.Имя
		Или Элементы.Серия.Имя = Элемент.Имя Тогда
		
		ТекущиеДанные = Форма.Элементы.ШтрихкодыНоменклатуры.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПроверитьРегистрациюШтрихкода", ТекущиеДанные.Зарегистрирован);
			
			ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, Неопределено);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// См. РаботаСНоменклатуройКлиентПереопределяемый.СоздатьНоменклатуруИнтерактивно.
Процедура СоздатьНоменклатуруИнтерактивно(ПараметрыФормы, ОписаниеОповещенияОЗакрытии) Экспорт 
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы,,,,, ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.СоздатьВидНоменклатурыИнтерактивно.
Процедура СоздатьВидНоменклатурыИнтерактивно(ПараметрыФормы, ОписаниеОповещенияОЗакрытии) Экспорт 
	
	ОткрытьФорму("Справочник.ВидыНоменклатуры.Форма.ФормаЭлемента", 
		ПараметрыФормы, , , , , ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуДополнительногоЗначения.
Процедура ОткрытьФормуДополнительногоЗначения(ПараметрыФормы, Форма) Экспорт
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Владелец",     ПараметрыФормы.РеквизитСсылка);
	ЗначенияЗаполнения.Вставить("Наименование", ПараметрыФормы.Наименование);
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.Форма.ФормаЭлемента", ПараметрыФормы, Форма);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуДополнительногоРеквизита.
Процедура ОткрытьФормуДополнительногоРеквизита(ПараметрыФормы, Форма) Экспорт
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Форма.ФормаЭлемента", ПараметрыФормы, Форма);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуНоменклатуры.
Процедура ОткрытьФормуНоменклатуры(НоменклатураСсылка, Форма) Экспорт
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", Новый Структура("Ключ", НоменклатураСсылка), Форма);
	
КонецПроцедуры
	
// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуВидаНоменклатуры.
Процедура ОткрытьФормуВидаНоменклатуры(ВидНоменклатурыСсылка, Форма) Экспорт
	
	ОткрытьФорму("Справочник.ВидыНоменклатуры.Форма.ФормаЭлемента", Новый Структура("Ключ", ВидНоменклатурыСсылка), Форма);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуСпискаВидаНоменклатуры.
Процедура ОткрытьФормуСпискаВидаНоменклатуры(ВидНоменклатурыСсылка, Форма, ОписаниеОповещенияОЗакрытии) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", ВидНоменклатурыСсылка));
	
	ОткрытьФорму("Справочник.ВидыНоменклатуры.Форма.ФормаСписка", ПараметрыФормы, Форма,,,,ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуСпискаНоменклатуры.
Процедура ОткрытьФормуСпискаНоменклатуры(НоменклатураСсылка, Форма) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", НоменклатураСсылка));
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаСписка", ПараметрыФормы, Форма);
	
КонецПроцедуры

// Обработчик оповещения выбора номенлатуры.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - выбранное значение.
//  ДополнительныеПараметры - ФормаКлиентскогоПриложения - форма из обработчика события которой происходит вызов процедуры.
//
Процедура ПриВыбореНоменклатуры(Номенклатура, ДополнительныеПараметры) Экспорт
	
	Перем КэшированныеЗначения;
	
	Если Номенклатура = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ДополнительныеПараметры.Элементы.ШтрихкодыНоменклатуры.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Номенклатура = Номенклатура;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу",	ТекущиеДанные.Характеристика);
	СтруктураДействий.Вставить("ПроверитьСериюПоВладельцу",				ТекущиеДанные.Серия);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу",	ТекущиеДанные.Упаковка);
	СтруктураДействий.Вставить("ПроверитьРегистрациюШтрихкода",			ТекущиеДанные.Зарегистрирован);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуВыбораНоменклатуры.
Процедура ОткрытьФормуВыбораНоменклатуры(ПараметрыФормы, 
	Владелец = Неопределено,
	ОписаниеОповещенияОЗакрытии = Неопределено, 
	РежимОткрытияОкнаФормы = Неопределено) Экспорт
	
	КлючУникальности = Новый УникальныйИдентификатор;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Владелец, "УникальныйИдентификатор") Тогда
		КлючУникальности = Владелец.УникальныйИдентификатор;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораГруппИЭлементов", 
		ПараметрыФормы, Владелец, КлючУникальности,,,ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуВыбораНоменклатуры.
Процедура ОткрытьФормуПодбораНоменклатурыСХарактеристиками(Владелец = Неопределено,
			ОписаниеОповещенияОЗакрытии = Неопределено, РежимОткрытияОкнаФормы = Неопределено) Экспорт
	
	КлючУникальности = Новый УникальныйИдентификатор;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Владелец, "УникальныйИдентификатор") Тогда
		КлючУникальности = Владелец.УникальныйИдентификатор;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВозвращатьМногооборотнуюТару",            Ложь);
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры",                 НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре(Истина));
	ПараметрыФормы.Вставить("РежимПодбораБезКоличественныхПараметров", Истина);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров",       Истина);
	ПараметрыФормы.Вставить("РежимПодбораБезСоглашенийСКлиентами",     Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуВидЦены",                  Истина);
	ПараметрыФормы.Вставить("СкрыватьКомандуЦеныНоменклатуры",         Истина);
	ПараметрыФормы.Вставить("СкрыватьКомандуОстаткиНаСкладах",         Истина);
	ПараметрыФормы.Вставить("СкрыватьКнопкуЗапрашиватьКоличество",     Истина);
	ПараметрыФормы.Вставить("СкрыватьРучныеСкидки",                    Истина);
	ПараметрыФормы.Вставить("ОстаткиПоВсемСкладам",                    Истина);
	ПараметрыФормы.Вставить("ПодборВариантовОбеспечения",              Ложь);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки",                Ложь);
	ПараметрыФормы.Вставить("НеРазбиватьНаборыПоКомплектующим",        Истина);
	ПараметрыФормы.Вставить("Заголовок",                               НСтр("ru = 'Выберите номенклатуру для выгрузки'"));
	ПараметрыФормы.Вставить("ЗаголовокКнопкиПеренести",                НСтр("ru = 'Перенести в выгрузку'"));
	ПараметрыФормы.Вставить("Дата",                                    ОбщегоНазначенияКлиент.ДатаСеанса());
	ПараметрыФормы.Вставить("Документ",                                ПредопределенноеЗначение("Документ.УстановкаЦенНоменклатуры.ПустаяСсылка"));
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма",
		ПараметрыФормы, Владелец, КлючУникальности,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы);
	
КонецПроцедуры

//++ Локализация

// См. РаботаСНоменклатуройКлиентПереопределяемый.ПоказатьНезаполненныеДанныеНоменклатуры.
Процедура ПоказатьНезаполненныеДанныеНоменклатуры(НоменклатураСсылка, НезаполненныеРеквизиты, Форма, ОписаниеОповещения) Экспорт
	
	ФормаЭлемента = ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", Новый Структура("Ключ", НоменклатураСсылка), Форма, 
		НоменклатураСсылка,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ОчиститьСообщения();
	
	Если НезаполненныеРеквизиты.Количество() = 1 И НезаполненныеРеквизиты[0] = "Штрихкоды" Тогда
		ПараметрыОткрытия = Новый Структура("Отбор", Новый Структура("Номенклатура", НоменклатураСсылка));
		ФормаШтрихкоды = ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.ФормаСписка", ПараметрыОткрытия,,, ФормаЭлемента.Окно,);
		ТекстСообщения = НСтр("ru = 'Номенклатура не имеет ни одного штрихкода'");
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Поле = "Список";
		СообщениеПользователю.Текст = ТекстСообщения;
		СообщениеПользователю.ИдентификаторНазначения = ФормаШтрихкоды.УникальныйИдентификатор;
		СообщениеПользователю.Сообщить();
	Иначе 
		СоответствиеЭлементовФормы = Новый Структура;
		СоответствиеЭлементовФормы.Вставить("Наименование",     "Объект.Наименование");
		СоответствиеЭлементовФормы.Вставить("ЕдиницаИзмерения", "Объект.ЕдиницаИзмерения");
		СоответствиеЭлементовФормы.Вставить("СтавкаНДС",        "Объект.СтавкаНДС");
		СоответствиеЭлементовФормы.Вставить("Артикул",          "Объект.Артикул");
		
		Если НезаполненныеРеквизиты.Найти("СтавкаНДС") <> Неопределено Тогда 
			ФормаЭлемента.Элементы["СворачиваемаяГруппаОсновныеПараметрыУчета"].Видимость = Истина;
		КонецЕсли;
		
		Если НезаполненныеРеквизиты.Найти("ЕдиницаИзмерения") <> Неопределено Тогда 
			ФормаЭлемента.Элементы["СворачиваемаяГруппаЕдиницыИзмерения"].Видимость = Истина;
		КонецЕсли;
		
		НетШтрихкода = Ложь;
		Для каждого Реквизит Из НезаполненныеРеквизиты Цикл
			Если СоответствиеЭлементовФормы.Свойство(Реквизит) Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Не заполнено значение реквизита ""%1""'"), Реквизит);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, СоответствиеЭлементовФормы[Реквизит]);
			ИначеЕсли Реквизит = "Штрихкоды" Тогда
				НетШтрихкода = Истина;
			КонецЕсли;
		КонецЦикла;
		Если НетШтрихкода = Истина Тогда
			ТекстСообщения = НСтр("ru = 'Номенклатура не имеет ни одного штрихкода'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//-- Локализация

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьШтрихкоды(Форма, ДанныеШтрихкодов)
	
	ОчиститьСообщения();
	
	ОтборСтрок						= Новый Структура("Штрихкод");
	ШтрихкодыНоменклатуры			= Форма.ШтрихкодыНоменклатуры;
	КоличествоНевалидныхШтрихкодов	= 0;
	НеизвестныеШтрихкоды			= Новый Массив;
	КоличествоПоШтрихкодам			= Новый Соответствие();
	КэшированныеЗначения			= ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	ЗаполняемыеСвойства				= "Номенклатура, Характеристика, Серия, Упаковка, ХарактеристикиИспользуются, 
										|СерииИспользуются";
	
	Для Каждого ДанныеШтрихкода Из ДанныеШтрихкодов Цикл
		ЗаполнитьЗначенияСвойств(ОтборСтрок, ДанныеШтрихкода);
		НайденныеСтроки = ШтрихкодыНоменклатуры.НайтиСтроки(ОтборСтрок);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].Количество = НайденныеСтроки[0].Количество + ДанныеШтрихкода.Количество;
		Иначе
			Если Не ШтрихкодированиеНоменклатурыКлиент.ШтрихкодыВалидны(ДанныеШтрихкода, Ложь) Тогда
				КоличествоНевалидныхШтрихкодов = КоличествоНевалидныхШтрихкодов + 1;
				
				Продолжить;
			КонецЕсли;
			
			ТекущийШтрихкод = ВРег(СокрЛП(ДанныеШтрихкода.Штрихкод));
			
			НеизвестныеШтрихкоды.Добавить(ТекущийШтрихкод);
			
			ДанныеОКоличестве = КоличествоПоШтрихкодам.Получить(ТекущийШтрихкод);
			
			Если ДанныеОКоличестве = Неопределено Тогда
				КоличествоПоШтрихкодам.Вставить(ТекущийШтрихкод, ДанныеШтрихкода.Количество);
			Иначе
				ДанныеОКоличестве.Количество = ДанныеОКоличестве.Количество + ДанныеШтрихкода.Количество;
				
				КоличествоПоШтрихкодам.Вставить(ТекущийШтрихкод, ДанныеОКоличестве);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
		НеизвестныеШтрихкоды = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НеизвестныеШтрихкоды);
		РаботаСНоменклатуройВызовСервераУТ.ПолучитьДанныеПоШтрихкодам(КэшированныеЗначения, НеизвестныеШтрихкоды);
	КонецЕсли;
	
	Для Каждого Штрихкод Из НеизвестныеШтрихкоды Цикл
		ДанныеШтрихкода	= КэшированныеЗначения.Штрихкоды.Получить(Штрихкод);
		Количество		= КоличествоПоШтрихкодам.Получить(Штрихкод);
		
		НоваяСтрока = ШтрихкодыНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеШтрихкода, ЗаполняемыеСвойства);
		
		Если ДанныеШтрихкода = Неопределено Тогда
			НоваяСтрока.Зарегистрирован = Истина;
		ИначеЕсли ДанныеШтрихкода.НеизвестныйШтрихкод Тогда
			НоваяСтрока.Зарегистрирован = Ложь;
		ИначеЕсли Не ДанныеШтрихкода.ШтрихкодНоменклатуры Тогда
			НоваяСтрока.Зарегистрирован = Ложь;
		Иначе
			НоваяСтрока.Зарегистрирован = Истина;
		КонецЕсли;
		
		НоваяСтрока.Штрихкод					= Штрихкод;
		НоваяСтрока.Количество					= Количество;
		НоваяСтрока.ПоискВСервисеНеПроизводился	= Истина;
	КонецЦикла;
	
	Если КоличествоНевалидныхШтрихкодов > 0 Тогда
		ТекстОповещения = ?(КоличествоНевалидныхШтрихкодов = 1,
							НСтр("ru = 'Ошибка чтения штрихкода.'"),
							НСтр("ru = 'Ошибка чтения штрихкодов.'"));
		ПояснениеОповещения = НСтр("ru = 'Эта форма не предназначена для работы с кодами маркировки.'");
		
		ПоказатьОповещениеПользователя(ТекстОповещения, , ПояснениеОповещения, БиблиотекаКартинок.Предупреждение32);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти