///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем".
// ОбщийМодуль.НастройкиПлатежныхСистемКлиентСобытия.
// 
// Обработчики событий, возникающих при работе с платежными системами:
//  - выбор строки на форме общих настроек;
//  - обработка оповещения;
//  - копирование настройки;
//  - обработка нажатия кнопки команды на форме.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается при выборе строки в общем списке настроек подключения к платежным системам.
//  Если необходимо обработать более сложную логику, то можно установить значение Истина для параметра
//  ПараметрыВыбора.ТребуетсяДополнительнаяОбработка. В этом случае обработка выбора будет прервана, а вместо нее будет 
//  вызвана процедура НастройкиПлатежныхСистемКлиентСобытия.ПриДополнительнойОбработкеВыбораНастройки.
//  Если для дополнительной обработки требуются какие-то параметры, то они могут быть указаны в параметре
//  ПараметрыВыбора.ПараметрыДополнительнойОбработки.
//  Пример вызова дополнительной обработки можно посмотреть в подсистеме СБП:
//   СистемаБыстрыхПлатежейКлиент.ПриОбработкеВыбораНастройки.
// 
// Параметры:
//  ПараметрыВыбора - см. НастройкиПлатежныхСистемКлиент.НовыйПараметрыОбработкиВыбораНастройки.
//  
Процедура ПриОбработкеВыбораНастройки(ПараметрыВыбора) Экспорт

	Если ПараметрыВыбора.ИмяПодсистемы = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыСБП() Тогда
		
		МодульСистемаБыстрыхПлатежейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СистемаБыстрыхПлатежейКлиент");
		МодульСистемаБыстрыхПлатежейКлиент.ПриОбработкеВыбораНастройки(ПараметрыВыбора);

	ИначеЕсли ПараметрыВыбора.ИмяПодсистемы = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыИнтернетЭквайринг() Тогда
		
		МодульИнтернетЭквайрингКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетЭквайрингКлиент");
		МодульИнтернетЭквайрингКлиент.ПриОбработкеВыбораНастройки(ПараметрыВыбора);
	
	ИначеЕсли ПараметрыВыбора.ИмяПодсистемы = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыОзонПэй()
		Или ПараметрыВыбора.ИмяПодсистемы = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыЯндексПэй() Тогда
		
		МодульПлатежныеСистемыКлиентСобытия = ОбщегоНазначенияКлиент.ОбщийМодуль("ПлатежныеСистемыКлиентСобытия");
		МодульПлатежныеСистемыКлиентСобытия.ПриОбработкеВыбораНастройки(ПараметрыВыбора);
	
	Иначе
		
		ПараметрыВыбора.Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается в случае необходимости дополнительной обработки выбора значения.
//  Чтобы продолжить процесс обработки выбора значения после выполнения дополнительных действий
//  необходимо вызвать процедуру, описанную в параметре ОбработкаЗавершения.
//  В качестве результата в нее должно быть передано обработанное значение параметра ПараметрыВыбора;
// 
// Параметры:
//  ПараметрыВыбора - см. НастройкиПлатежныхСистемКлиент.НовыйПараметрыОбработкиВыбораНастройки.
//  ОбработкаЗавершения - ОписаниеОповещения - описание оповещения.
Процедура ПриДополнительнойОбработкеВыбораНастройки(ПараметрыВыбора, ОбработкаЗавершения) Экспорт
	
	Если ПараметрыВыбора.ИмяПодсистемы = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыСБП() Тогда
		
		МодульСистемаБыстрыхПлатежейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СистемаБыстрыхПлатежейКлиент");
		МодульСистемаБыстрыхПлатежейКлиент.ПриДополнительнойОбработкеВыбораНастройки(
			ПараметрыВыбора,
			ОбработкаЗавершения);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при выполнении команды Изменить контекстного меню общей формы настроек платежных систем.
// 
// Параметры:
//  ПараметрыВыбора - см. НастройкиПлатежныхСистемКлиент.НовыйПараметрыОбработкиВыбораНастройкиДляИзменения.
//
Процедура ПриОбработкеВыбораНастройкиДляИзменения(ПараметрыВыбора) Экспорт
		
	Если ПараметрыВыбора.ИмяПодсистемы = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыСБП() Тогда
		
		МодульСистемаБыстрыхПлатежейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СистемаБыстрыхПлатежейКлиент");
		МодульСистемаБыстрыхПлатежейКлиент.ПриОбработкеВыбораНастройкиДляИзменения(ПараметрыВыбора);
		
	ИначеЕсли ПараметрыВыбора.ИмяПодсистемы = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыИнтернетЭквайринг() Тогда
		
		МодульИнтернетЭквайрингКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетЭквайрингКлиент");
		МодульИнтернетЭквайрингКлиент.ПриОбработкеВыбораНастройкиДляИзменения(ПараметрыВыбора);
	
	ИначеЕсли ПараметрыВыбора.ИмяПодсистемы = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыОзонПэй()
		Или ПараметрыВыбора.ИмяПодсистемы = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыЯндексПэй() Тогда
		
		МодульПлатежныеСистемыКлиентСобытия = ОбщегоНазначенияКлиент.ОбщийМодуль("ПлатежныеСистемыКлиентСобытия");
		МодульПлатежныеСистемыКлиентСобытия.ПриОбработкеВыбораНастройкиДляИзменения(ПараметрыВыбора);
		
	Иначе
		
		ПараметрыВыбора.Отказ = Истина;
		
	КонецЕсли;

КонецПроцедуры

// Вызывается при срабатывании события ОбработкаОповещения общей формы настроек платежных систем.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма настроек.
//  ОбновитьСписок - Булево - необходимо установить в Истина, если при наступлении события требуется обновить дерево.
//  ИмяСобытия - Строка- Имя события. Может быть использовано для идентификации сообщений принимающими их формами.
//  Параметр - Произвольный - Параметр сообщения. Могут быть переданы любые необходимые данные.
//  Источник - Произвольный - Источник события. Например, в качестве источника может быть указана другая форма.
//
Процедура ПриОбработкеОповещения(
		Форма,
		ОбновитьСписок,
		ИмяСобытия,
		Параметр,
		Источник) Экспорт

	Если ИмяСобытия = "БИПСменаУчастникаСБП"
		И Форма.КешПараметров.ВидимостьПодсистемВСписке.Получить(НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыСБП()) Тогда
		ОбновитьСписок = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при выполнении команды из подменю ГруппаДополнительно.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма настроек.
//  Команда - КомандаФормы - выполняемая команда.
//  
Процедура ПриВыполненииКомандыДополнительно(Форма, Команда) Экспорт
	
	Если Не НастройкиПлатежныхСистемКлиент.КомандаДоступна(Форма, Команда) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Форма.Элементы.Список.ТекущиеДанные;
	ТекущаяПодсистема = ТекущиеДанные.Подсистема;
	
	Если Команда.Имя = "ОткрытьШаблоныНазначения" Тогда
		
		Если ТекущиеДанные.ЭтоГруппа Тогда
			ПоказатьПредупреждение(
				Неопределено,
				НСтр("ru = 'Работа с шаблонами назначения недоступна для группы.'"));
			Возврат;
		КонецЕсли;
		
		НастройкиПлатежныхСистемКлиент.ОткрытьНастройкуШаблоновНазначения(
			ТекущиеДанные.Ссылка,
			Форма);

	ИначеЕсли Команда.Имя = "ОткрытьКассовыеСсылки" Тогда
		
		Если ТекущаяПодсистема = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыСБП() Тогда
		
			МодульСистемаБыстрыхПлатежейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СистемаБыстрыхПлатежейКлиент");
			МодульСистемаБыстрыхПлатежейКлиент.ОткрытьКассовыеСсылкиКоманда(Форма.Элементы.Список.ТекущиеДанные);
			
		ИначеЕсли ТекущаяПодсистема = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыЯндексПэй() Тогда
			
			МодульЯндексПэйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЯндексПэйКлиент");
			МодульЯндексПэйКлиент.ОткрытьКассовыеСсылки(Форма.Элементы.Список.ТекущиеДанные);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при нажатии кнопки копирования настройки.
// 
// Параметры:
//  ТекущиеДанные - Неопределено, Произвольный - выбранная строка или структура, с ее описанием.
//  ОписаниеОповещения - ОписаниеОповещения - описание оповещения метода, который должно быть вызвано после закрытия
//    формы создания новой настройки.
//  НеПредлагатьПодключениеКОнлайнЗаказам - Булево - если в мастере создания новой настройки подключения к платежной
//       системе есть возможность выполнить ее привязку к настройке Онлайн-заказов, то она не будет использоваться,
//       если данный параметр установлен в Истину.
//
Процедура ПриКопированииНастройки(
		ТекущиеДанные,
		ОписаниеОповещения,
		НеПредлагатьПодключениеКОнлайнЗаказам = Ложь) Экспорт
	
	Если ТекущиеДанные.Подсистема = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыСБП() Тогда
		
		МодульСистемаБыстрыхПлатежейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СистемаБыстрыхПлатежейКлиент");
		МодульСистемаБыстрыхПлатежейКлиент.СкопироватьНастройку(
			ТекущиеДанные,
			ОписаниеОповещения);
		
	ИначеЕсли ТекущиеДанные.Подсистема = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыИнтернетЭквайринг() Тогда
		
		МодульИнтернетЭквайрингКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетЭквайрингКлиент");
		МодульИнтернетЭквайрингКлиент.СкопироватьНастройку(
			ТекущиеДанные,
			ОписаниеОповещения,
			НеПредлагатьПодключениеКОнлайнЗаказам);
			
	ИначеЕсли ТекущиеДанные.Подсистема = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыОзонПэй()
		Или ТекущиеДанные.Подсистема = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыЯндексПэй() Тогда
		
		МодульНастройкиПлатежныхСистемКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("НастройкиПлатежныхСистемКлиент");
		
		ПараметрыПодключения = МодульНастройкиПлатежныхСистемКлиент.НовыйПараметрыПодключения();
		ПараметрыПодключения.НастройкаДляКопирования = ТекущиеДанные.Ссылка;
		ПараметрыПодключения.НеПредлагатьПодключениеКОнлайнЗаказам = НеПредлагатьПодключениеКОнлайнЗаказам;
		
		МодульНастройкиПлатежныхСистемКлиент.ПодключитьПлатежнуюСистему(
			ТекущиеДанные.Подсистема,
			ПараметрыПодключения);
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму мастера настройки подключения к платежной системе.
// 
// Параметры:
//  ПлатежнаяСистема - Строка - платежная система, для которой необходимо выполнить настройку подключения.
//    Может принимать значения "СистемаБыстрыхПлатежей", "ИнтернетЭквайринг", "ОзонПэй".
//  ПараметрыПодключения - см. НастройкиПлатежныхСистемКлиент.НовыйПараметрыПодключения.
//  ПараметрыФормы - см.НастройкиПлатежныхСистемКлиентСлужебный.НовыйПараметрыФормыМастераПлатежнойСистемы
//
Процедура ПриПодключенииПлатежнойСистемы(ПлатежнаяСистема, ПараметрыПодключения, ПараметрыФормы) Экспорт

	Если ПлатежнаяСистема = "СистемаБыстрыхПлатежей" Тогда
		
		МодульСистемаБыстрыхПлатежейКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("СистемаБыстрыхПлатежейКлиентСервер");
		МодульСистемаБыстрыхПлатежейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СистемаБыстрыхПлатежейКлиент");
		
		НастройкиПодключения = Новый Структура;
		НастройкиПодключения.Вставить(
			"БИК",
			ПараметрыПодключения.БИК);
		НастройкиПодключения.Вставить(
			"НастройкаПодключения",
			Неопределено);
		НастройкиПодключения.Вставить(
			"ДополнительныеПараметры",
			ПараметрыПодключения.ДополнительныеПараметры);
		НастройкиПодключения.Вставить(
			"ОтборУчастников",
			ПараметрыПодключения.ОтборУчастников);
		НастройкиПодключения.Вставить(
			"ОтображатьОписаниеСервиса",
			ПараметрыПодключения.ОтображатьОписаниеСервиса);
		НастройкиПодключения.Вставить(
			"РежимРаботы",
			?(
				ЗначениеЗаполнено(ПараметрыФормы.РежимРаботы),
				ПараметрыФормы.РежимРаботы,
				МодульСистемаБыстрыхПлатежейКлиентСервер.ИдентификаторОперацииСозданиеНастройки()));
		НастройкиПодключения.Вставить(
			"ВариантНастройки",
			ПараметрыПодключения.ВариантНастройки);
		
		МодульСистемаБыстрыхПлатежейКлиент.СлужебнаяПодключитьСистемуБыстрыхПлатежей(
			НастройкиПодключения,
			ПараметрыПодключения.ОписаниеОповещения);
		
	ИначеЕсли ПлатежнаяСистема = "ИнтернетЭквайринг" Тогда
		
		НастройкиПодключения = Новый Структура;
		НастройкиПодключения.Вставить(
			"БИК",
			ПараметрыПодключения.БИК);
		НастройкиПодключения.Вставить(
			"НастройкаДляКопирования",
			Неопределено);
		НастройкиПодключения.Вставить(
			"РежимРаботы",
			ПараметрыФормы.РежимРаботы);
		НастройкиПодключения.Вставить(
			"ДополнительныеПараметры",
			ПараметрыПодключения.ДополнительныеПараметры);
		НастройкиПодключения.Вставить(
			"НеПредлагатьПодключениеКОнлайнЗаказам",
			ПараметрыПодключения.НеПредлагатьПодключениеКОнлайнЗаказам);
		
		МодульИнтернетЭквайрингКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетЭквайрингКлиент");
		
		МодульИнтернетЭквайрингКлиент.ПодключитьИнтернетЭквайрингСлужебный(
			НастройкиПодключения,
			ПараметрыПодключения.ОписаниеОповещения);
	
	ИначеЕсли ПлатежнаяСистема = "ОзонПэй"
		Или ПлатежнаяСистема = "ЯндексПэй" Тогда

		ИмяПлатежнойСистемы = "Перечисление.ПлатежныеСервисы." + ПлатежнаяСистема;

		НастройкиПодключения = Новый Структура;
		
		НастройкиПодключения.Вставить(
			"ПлатежнаяСистема",
			ПредопределенноеЗначение(ИмяПлатежнойСистемы));
		НастройкиПодключения.Вставить(
			"ОтображатьОписаниеСервиса",
			ПараметрыПодключения.ОтображатьОписаниеСервиса);
		НастройкиПодключения.Вставить(
			"РежимРаботы",
			ПараметрыФормы.РежимРаботы);
		НастройкиПодключения.Вставить(
			"НастройкаДляКопирования",
			ПараметрыПодключения.НастройкаДляКопирования);
		НастройкиПодключения.Вставить(
			"НеПредлагатьПодключениеКОнлайнЗаказам",
			ПараметрыПодключения.НеПредлагатьПодключениеКОнлайнЗаказам);

		МодульПлатежныеСистемыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПлатежныеСистемыКлиент");
		МодульПлатежныеСистемыКлиент.ПодключитьПлатежнуюСистемуСлужебный(
			НастройкиПодключения,
			ПараметрыПодключения.ОписаниеОповещения,
			ПараметрыПодключения.ДополнительныеПараметры);
		
	Иначе
		ВызватьИсключение НСтр("ru = 'Указана недопустимая платежная система'");
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при обработке навигационных ссылок в форме мастера создания нового подключения к платежной системе.
// 
// Параметры:
//  НавигационнаяСсылкаФорматированнойСтроки - Строка - значение гиперссылки форматированной строки.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//  ДополнительныеПараметры - Неопределено, Произвольный - любая дополнительная информация, необходимая для обработки
//    навигационной ссылки.
//
Процедура ПриОбработкеНавигационнойСсылки(
	Знач НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка,
	ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "action:openPortal" Тогда
		СтандартнаяОбработка = Ложь;
		ИнтернетПоддержкаПользователейКлиент.ОткрытьСтраницуИнтегрированногоСайта(
			ИнтернетПоддержкаПользователейКлиентСервер.URLСтраницыСервисаLogin(
				,
				ИнтернетПоддержкаПользователейКлиент.НастройкиСоединенияССерверами()),
			"",
			Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
