&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

&НаКлиенте
Перем ТаблицаРеквизитовДополнительная Экспорт,
	ТабличныеЧасти Экспорт,
	СвязиТабличныхЧастей Экспорт,
	НесколькоТабличныхЧастей,
	ТабличнаяЧастьДокументаMSПредыдущееЗначение,
	НастройкаТЧСтрокойПредыдущееЗначение,
	ПредставленияТабЧастейMS;

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	Результат = Новый Структура;
	Результат.Вставить("ТабличныеЧасти", 		ТабличныеЧасти);	
	Результат.Вставить("СвязиТабличныхЧастей", 	СвязиТабличныхЧастей);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если НЕ ОписаниеОповещенияОЗакрытии = Неопределено Тогда	
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии,Результат);
		КонецЕсли;
	#КонецЕсли

	Закрыть(Результат);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийЯзык = ТекущийЯзык();
	КодЯзыка = ?(ТипЗнч(ТекущийЯзык) = Тип("Строка"), ТекущийЯзык, ТекущийЯзык.КодЯзыка);
	ПредставленияТабЧастейMS = Новый СписокЗначений;
	ПредставленияТабЧастейMS.Добавить("СтрокиПлан", ?(КодЯзыка = "ru", "Строки план", "Declared items"));
	ПредставленияТабЧастейMS.Добавить("СтрокиФакт", ?(КодЯзыка = "ru", "Строки факт", "Current items"));
	ПредставленияТабЧастейMS.Добавить("СерииПлан", ?(КодЯзыка = "ru", "Серии план", "Declared series"));
	ПредставленияТабЧастейMS.Добавить("СерииФакт", ?(КодЯзыка = "ru", "Серии факт", "Current series"));
	ПредставленияТабЧастейMS.Добавить("СерийныеНомераПлан", ?(КодЯзыка = "ru", "Серийные номера план", "Declared serial numbers"));
	ПредставленияТабЧастейMS.Добавить("СерийныеНомераФакт", ?(КодЯзыка = "ru", "Серийные номера факт", "Current serial numbers"));
	
	НесколькоТабличныхЧастей = НСтр("be = 'Некалькі таблічных частак'; en = 'Several table parts'; es = 'Varios partes de tablas'; ka = 'რამდენიმე ცხრილის ნაწილი'; kk = 'Бірнеше кестелік бөліктер'; ro = 'Mai multe părți de tabel'; ru = 'Несколько табличных частей'; tr = 'Birden fazla tablo bölümü'; uk = 'Декілька табличних частин'; uz = 'Bir nechta jadval qismi'");
		
	ЗаполнитьСписокВыбора(Элементы.ОтображаемыеТабличныеЧастиНастройкаТЧСтрокой.СписокВыбора,ПолучитьСписокТабличныхЧастей1С());		
	ЗаполнитьСписокВыбора(Элементы.ОтображаемыеТабличныеЧастиТабличнаяЧастьДокументаMS.СписокВыбора,ПолучитьСписокВыбораТабличныхЧастейMS());
	
	ЗаполнитьОтображаемыеТабличныеЧасти();
	ОбновитьСтруктуруТабличныхЧастей();
	ОбновитьПредставленияВТабличнойЧасти();
	
	//Клеверенс Автотестирование. Текст проверки должен быть последним!
	Если АвтоТестОткрытияФормы и ОписаниеОповещенияОЗакрытии <> Неопределено Тогда
		РезОткрытия = Новый Структура;
		РезОткрытия.Вставить("ВремяЗакрытия",ТекущаяУниверсальнаяДатаВМиллисекундах());
		#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
			РезОткрытия.Вставить("ИмяФормы",ЭтаФорма.ИмяФормы);
		#Иначе	
			РезОткрытия.Вставить("ИмяФормы",ЭтаФорма.Заголовок);
		#КонецЕсли
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, РезОткрытия);
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбора(Приемник,Список)
	Для Каждого Элем Из Список Цикл
		Приемник.Добавить(Элем.Значение,Элем.Представление);	
	КонецЦикла;
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПредставлениеТабличнойЧастиДокументаMS(ТабличнаяЧастьДокументаMS)
	
	ЭлементПредставления = ПредставленияТабЧастейMS.НайтиПоЗначению(ТабличнаяЧастьДокументаMS);
	Возврат ?(ЭлементПредставления = Неопределено, ТабличнаяЧастьДокументаMS, ЭлементПредставления.Представление);
	
КонецФункции

&НаКлиенте
Функция ТабличнаяЧастьДокументаMSПоПредставлению(ПредставлениеТабличнойЧастиДокументаMS)
	
	Для каждого ЭлементСЗ Из ПредставленияТабЧастейMS Цикл
		Если ЭлементСЗ.Представление = ПредставлениеТабличнойЧастиДокументаMS Тогда
			Возврат ЭлементСЗ.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПредставлениеТабличнойЧастиДокументаMS;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПредставленияВТабличнойЧасти()
	
	Для каждого Строка Из ОтображаемыеТабличныеЧасти Цикл
		ЭлементПредставления = ПредставленияТабЧастейMS.НайтиПоЗначению(Строка.ТабличнаяЧастьДокументаMS);
		Строка.ТабличнаяЧастьДокументаMSПредставление = ПредставлениеТабличнойЧастиДокументаMS(Строка.ТабличнаяЧастьДокументаMS);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокТабличныхЧастей1С()
	
	СписокТЧ = Новый СписокЗначений;
	Для Каждого ЭлементТЧ Из СтруктураДокумента1С.ТабличныеЧасти Цикл
		СписокТЧ.Добавить(ЭлементТЧ.Значение.Имя, ЭлементТЧ.Значение.Синоним);
	КонецЦикла;
	Если СписокТЧ.НайтиПоЗначению("(Запрос)") = Неопределено Тогда
		СписокТЧ.Добавить("(Запрос)", "(Запрос)");
	КонецЕсли;
	Если СписокТЧ.НайтиПоЗначению("(" + НесколькоТабличныхЧастей + ")") = Неопределено Тогда
		СписокТЧ.Добавить("(" + НесколькоТабличныхЧастей + ")", "(" + НесколькоТабличныхЧастей + ")");
	КонецЕсли;
	
	СписокДополнительныхОбработчиков = _ЛокКонтекст.ЛокЯдро_ПолучитьСписокДополнительныхОбработчиковПолученияТЧ(ТипДокумента1С);
	Если СписокДополнительныхОбработчиков <> Неопределено Тогда
		Для Каждого КлючЗначение Из СписокДополнительныхОбработчиков Цикл
			Синоним = ?(КлючЗначение.Значение.Свойство("Синоним"),КлючЗначение.Значение.Синоним,КлючЗначение.Ключ);
			СписокТЧ.Добавить(КлючЗначение.Ключ,Синоним);	
		КонецЦикла;
	КонецЕсли;
	
	СписокТЧ.СортироватьПоПредставлению();
	
	Возврат СписокТЧ;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокТабличныхЧастейMS()
	
	СписокТЧ = Новый СписокЗначений;
	
	СписокТЧ.Добавить(ПредставлениеТабличнойЧастиДокументаMS("СтрокиПлан"));
	СписокТЧ.Добавить(ПредставлениеТабличнойЧастиДокументаMS("СтрокиФакт"));
	СписокТЧ.Добавить(ПредставлениеТабличнойЧастиДокументаMS("СерииПлан"));
	СписокТЧ.Добавить(ПредставлениеТабличнойЧастиДокументаMS("СерииФакт"));
	СписокТЧ.Добавить(ПредставлениеТабличнойЧастиДокументаMS("СерийныеНомераПлан"));
	СписокТЧ.Добавить(ПредставлениеТабличнойЧастиДокументаMS("СерийныеНомераФакт"));
		
	СписокДопТаблиц = _ЛокКонтекст.СтруктураМетаданных.ДокументыMS[ТипДокументаMS].ДополнительныеТаблицы;
	
	Для Каждого ДопТаблица Из СписокДопТаблиц Цикл		
		СписокТЧ.Добавить(ДопТаблица.Представление);		
	КонецЦикла;	
	
	Возврат СписокТЧ;
	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьОтображаемыеТабличныеЧасти()
	
	СписокТабличныхЧастей1С = Элементы.ОтображаемыеТабличныеЧастиНастройкаТЧСтрокой.СписокВыбора;
	ТЧДокументаMS = Новый Массив;
	Если ТабличныеЧасти = Неопределено Тогда
		ТабличныеЧасти = Новый Массив;
	КонецЕсли;
	Для каждого Строка Из ТабличныеЧасти Цикл
		Если Строка.Свойство("ЭтоТаблицаЗначений")
			ИЛИ ТЧДокументаMS.Найти(Строка.ТабличнаяЧастьДокументаMS) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТЧДокументаMS.Добавить(Строка.ТабличнаяЧастьДокументаMS);
	КонецЦикла;
	
	Для Каждого ТабличнаяЧастьДокументаMS Из ТЧДокументаMS Цикл
		НайдСтроки = Новый Массив;
		Для Каждого СтрокаПоиска Из ТабличныеЧасти Цикл
			Если НЕ СтрокаПоиска.Свойство("ЭтоТаблицаЗначений")
				И СтрокаПоиска.ТабличнаяЧастьДокументаMS = ТабличнаяЧастьДокументаMS Тогда
				НайдСтроки.Добавить(СтрокаПоиска);
			КонецЕсли	
		КонецЦикла;
		Если НайдСтроки.Количество() = 1 Тогда
			НайдСтрока = НайдСтроки[0];
			НоваяСтрока = ОтображаемыеТабличныеЧасти.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайдСтрока);
			Если НайдСтрока.ТабличнаяЧастьДокумента1С<>Неопределено
				И НайдСтрока.ТабличнаяЧастьДокумента1С.Количество() Тогда
				НоваяСтрока.Настроить = НСтр("be = 'Наладжана'; en = 'Configured'; es = 'Configurado'; ka = 'დაკარგულია'; kk = 'Орнатылған'; ro = 'Configurat'; ru = 'Настроено'; tr = 'Ayarlandı'; uk = 'Налаштовано'; uz = 'Sozlandi'");
			Иначе
				НоваяСтрока.Настроить = НСтр("be = 'Наладзіць'; en = 'Configure'; es = 'Configurar'; ka = 'კონფიგურაცია'; kk = 'Орнату'; ro = 'Configurați'; ru = 'Настроить'; tr = 'Ayarla'; uk = 'Налаштувати'; uz = 'Sozlash'");
			КонецЕсли;
			
			НоваяСтрока.ТабличнаяЧастьЕстьВМетаданных = ?(Лев(НоваяСтрока.НастройкаТЧСтрокой, 1) = "(" ИЛИ ПустаяСтрока(НоваяСтрока.НастройкаТЧСтрокой),
				Ложь, СтруктураДокумента1С.ТабличныеЧасти.Свойство(НоваяСтрока.НастройкаТЧСтрокой));
			Если НайдСтрока.Свойство("ВыгружатьСтрокиПоУсловиюФлаг") И НайдСтрока.ВыгружатьСтрокиПоУсловиюФлаг = Истина Тогда
				НоваяСтрока.ВыгружатьСтрокиПоУсловию = НСтр("be = 'Уключана'; en = 'Enabled'; es = 'Activado'; ka = 'ჩართულია'; kk = 'Қосылған'; ro = 'Activat'; ru = 'Включено'; tr = 'Açık'; uk = 'Увімкнено'; uz = 'Йўқ'");
			Иначе
				НоваяСтрока.ВыгружатьСтрокиПоУсловию = НСтр("be = 'Выключана'; en = 'Turned off'; es = 'Apagado'; ka = 'გამორთული'; kk = 'Өшірілді'; ro = 'Dezactivat'; ru = 'Выключено'; tr = 'Kapatıldı'; uk = 'Вимкнено'; uz = ""O'chirilgan""");
			КонецЕсли;
		Иначе
			НастройкаТЧСтрокой = "(" + НесколькоТабличныхЧастей + ": ";
			Для каждого НайдСтрока Из НайдСтроки Цикл
				НастройкаТЧСтрокой = НастройкаТЧСтрокой + НайдСтрока.НастройкаТЧСтрокой + ", ";														
			КонецЦикла; 
			НастройкаТЧСтрокой = Лев(НастройкаТЧСтрокой, СтрДлина(НастройкаТЧСтрокой) - 2) + ")";			
			НоваяСтрока = ОтображаемыеТабличныеЧасти.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайдСтрока);
			НоваяСтрока.НастройкаТЧСтрокой = НастройкаТЧСтрокой;
			Если СписокТабличныхЧастей1С.НайтиПоЗначению(НастройкаТЧСтрокой) = Неопределено Тогда
				СписокТабличныхЧастей1С.Добавить(НастройкаТЧСтрокой, НастройкаТЧСтрокой);
			КонецЕсли;
			флНастроено = Ложь;
			Для каждого НайдСтрока Из НайдСтроки Цикл
				Если НайдСтрока.Свойство("ТабличнаяЧастьДокумента1С")
				 	И ТипЗнч(НайдСтрока.ТабличнаяЧастьДокумента1С) = Тип("Массив")
				 	И НайдСтрока.ТабличнаяЧастьДокумента1С.Количество() Тогда
					флНастроено = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			Если флНастроено Тогда
				НоваяСтрока.Настроить = НСтр("be = 'Наладжана'; en = 'Configured'; es = 'Configurado'; ka = 'დაკარგულია'; kk = 'Орнатылған'; ro = 'Configurat'; ru = 'Настроено'; tr = 'Ayarlandı'; uk = 'Налаштовано'; uz = 'Sozlandi'");
			Иначе
				НоваяСтрока.Настроить = НСтр("be = 'Наладзіць'; en = 'Configure'; es = 'Configurar'; ka = 'კონფიგურაცია'; kk = 'Орнату'; ro = 'Configurați'; ru = 'Настроить'; tr = 'Ayarla'; uk = 'Налаштувати'; uz = 'Sozlash'");
			КонецЕсли;
			
			НоваяСтрока.ТабличнаяЧастьЕстьВМетаданных = Ложь;
			НоваяСтрока.ВыгружатьСтрокиПоУсловию 	  = НСтр("be = 'Выключана'; en = 'Turned off'; es = 'Apagado'; ka = 'გამორთული'; kk = 'Өшірілді'; ro = 'Dezactivat'; ru = 'Выключено'; tr = 'Kapatıldı'; uk = 'Вимкнено'; uz = ""O'chirilgan""");
		КонецЕсли;
	КонецЦикла; 		
	
	СписокТабличныхЧастей1С.СортироватьПоПредставлению();
	
КонецПроцедуры	

&НаКлиенте
Функция ПолучитьСписокВыбораТабличныхЧастейMS()
	
	СписокТабличныхЧастейMS = ПолучитьСписокТабличныхЧастейMS();
	
	Для Каждого Строка Из ОтображаемыеТабличныеЧасти Цикл
		НайденныйЭлемент = СписокТабличныхЧастейMS.НайтиПоЗначению(Строка.ТабличнаяЧастьДокументаMSПредставление);
		Если НайденныйЭлемент <> Неопределено Тогда
			СписокТабличныхЧастейMS.Удалить(НайденныйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокТабличныхЧастейMS;
	
КонецФункции

&НаКлиенте
Процедура УдалитьСтрокиПодчиненныхТабличныхЧастей(ТабличнаяЧастьДокументаMS)
	
	Икс = ТабличныеЧасти.Количество();
	Пока Икс > 0 Цикл
		Икс = Икс - 1;
		Если ТабличныеЧасти[икс].Свойство("ТабличнаяЧастьДокументаMS") и ТабличныеЧасти[икс].ТабличнаяЧастьДокументаMS = ТабличнаяЧастьДокументаMS Тогда
			ТабличныеЧасти.Удалить(Икс);	
		КонецЕсли;
	КонецЦикла;

	Если СвязиТабличныхЧастей <> Неопределено Тогда
		Икс = СвязиТабличныхЧастей.Количество();
		Пока Икс > 1 Цикл
			Икс = Икс - 1;
			Если СвязиТабличныхЧастей[икс].ТабличнаяЧастьДокументаMS = ТабличнаяЧастьДокументаMS Тогда
				СвязиТабличныхЧастей.Удалить(Икс);	
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВладельцаПодчиненныхТабличныхЧастей(ТабличнаяЧастьДокументаMSПредыдущееЗначение, ТабличнаяЧастьДокументаMS);

	Для Каждого ЭлементМассива Из ТабличныеЧасти Цикл
		Если ЭлементМассива.Свойство("ЭтоТаблицаЗначений") 
			ИЛИ ЭлементМассива.ТабличнаяЧастьДокументаMS <> ТабличнаяЧастьДокументаMSПредыдущееЗначение Тогда
			Продолжить;
		КонецЕсли;
		ЭлементМассива.ТабличнаяЧастьДокументаMS = ТабличнаяЧастьДокументаMS;
	КонецЦикла;
 
	Если СвязиТабличныхЧастей <> Неопределено Тогда
		Для Каждого ЭлементМассива Из СвязиТабличныхЧастей Цикл
			Если ЭлементМассива.Свойство("ЭтоТаблицаЗначений") 
				ИЛИ ЭлементМассива.ТабличнаяЧастьДокументаMS <> ТабличнаяЧастьДокументаMSПредыдущееЗначение Тогда
				Продолжить;
			КонецЕсли;
			ЭлементМассива.ТабличнаяЧастьДокументаMS = ТабличнаяЧастьДокументаMS;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруТабличнойЧасти()
	
	НоваяСтруктура = Новый Структура;
	НоваяСтруктура.Вставить("ТабличнаяЧастьДокументаMS");
	НоваяСтруктура.Вставить("НастройкаТЧСтрокой");
	НоваяСтруктура.Вставить("Настроить");
	НоваяСтруктура.Вставить("ТабличнаяЧастьДокумента1С");
	НоваяСтруктура.Вставить("ТекстЗапросаВыгрузкиНаТСД");
	НоваяСтруктура.Вставить("ТекстКодаПолучениеПараметров");
	НоваяСтруктура.Вставить("Обработчик_ПередВыгрузкойТабличнойЧасти");
	НоваяСтруктура.Вставить("Обработчик_ПередВыгрузкойСтрокиТабличнойЧасти");
	НоваяСтруктура.Вставить("Обработчик_ПослеВыгрузкиСтрокиТабличнойЧасти");
	НоваяСтруктура.Вставить("Обработчик_ПослеВыгрузкиТабличнойЧасти");
	НоваяСтруктура.Вставить("Обработчик_ПослеОбъединенияСтрокиТабличнойЧасти");
	НоваяСтруктура.Вставить("Обработчик_ПослеОбъединенияТабличнойЧасти");
	НоваяСтруктура.Вставить("ВидОбработчика_ПередВыгрузкойСтрокиТабличнойЧасти");
	НоваяСтруктура.Вставить("ВидОбработчика_ПередВыгрузкойТабличнойЧасти");
	НоваяСтруктура.Вставить("ВидОбработчика_ПослеВыгрузкиСтрокиТабличнойЧасти");
	НоваяСтруктура.Вставить("ВидОбработчика_ПослеВыгрузкиТабличнойЧасти");
	НоваяСтруктура.Вставить("ВидОбработчика_ПослеОбъединенияСтрокиТабличнойЧасти");
	НоваяСтруктура.Вставить("ВидОбработчика_ПослеОбъединенияТабличнойЧасти");
	НоваяСтруктура.Вставить("ВыгружатьСтрокиПоУсловиюФлаг");
	НоваяСтруктура.Вставить("ВыгружатьСтрокиПоУсловиюСтрокой");

	Возврат НоваяСтруктура;
	
КонецФункции

&НаКлиенте 
Процедура ОбновитьСтруктуруТабличныхЧастей()
	
	КолонкиТабличныхЧастей = ПолучитьСтруктуруТабличнойЧасти();
	
	Для Каждого Элемент Из ТабличныеЧасти Цикл
		
		Если Элемент.Свойство("ЭтоТаблицаЗначений") И Элемент.ЭтоТаблицаЗначений Тогда			
			Для Каждого Колонка Из КолонкиТабличныхЧастей Цикл
				Если _ЛокКонтекст.ЛокЯдро_СтрНайти(Элемент.КолонкиТаблицыЗначений, Колонка.Ключ) = 0 Тогда
					Элемент.КолонкиТаблицыЗначений = Элемент.КолонкиТаблицыЗначений + "," + Колонка.Ключ;
				КонецЕсли;				
			КонецЦикла;                      						
			Продолжить;	
		КонецЕсли;
		
		Для Каждого Колонка Из КолонкиТабличныхЧастей Цикл
			Если Не Элемент.Свойство(Колонка.Ключ) Тогда
				Элемент.Вставить(Колонка.Ключ);
			КонецЕсли;				
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОтображаемыеТабличныеЧастиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	Для каждого Строка Из ОтображаемыеТабличныеЧасти Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ТабличнаяЧастьДокументаMS) Тогда							
			ТекстПредупреждения = НСтр("be = 'Перад даданнем новай радкі трэба запоўніць таблічныя часткі Cleverence ў існуючых радках'; en = 'Before adding a new row, fill in Cleverence table parts for existing rows'; es = 'Antes de agregar una nueva fila, es necesario completar las partes de tabla de Cleverence en las filas existentes'; ka = 'ახალი სტრიქონის დამატებამდე უნდა შევავსოთ Cleverence-ის ცხრილები არსებული სტრიქონებისთვის'; kk = 'Жаңа жолды қосу алдында Cleverence тізімдік бөлімдерін толтыру керек'; ro = 'Înainte de adăugarea unui nou rând, trebuie să completați părțile tabelei Cleverence la rândurile existente'; ru = 'Перед добавлением новой строки нужно заполнить табличные части Клеверенс у существующих строк'; tr = 'Yeni satır eklemeden önce mevcut satırlarda Cleverence tablo kısımlarını doldurun'; uk = 'Перед додаванням нового рядка потрібно заповнити табличні частини Cleverence у існуючих рядках'; uz = 'Янги қатор қўшишдан олдин, мавжуд Cleverence қаторларини тўлиқ тўлдириш керак'");
			ПоказатьПредупреждение(, ТекстПредупреждения); 
			Возврат;
		КонецЕсли; 			
	КонецЦикла; 
	
	НоваяСтрока = ОтображаемыеТабличныеЧасти.Добавить();
	НоваяСтрока.Настроить 					  = НСтр("be = 'Наладзіць'; en = 'Configure'; es = 'Configurar'; ka = 'კონფიგურაცია'; kk = 'Орнату'; ro = 'Configurați'; ru = 'Настроить'; tr = 'Ayarla'; uk = 'Налаштувати'; uz = 'Sozlash'");
	НоваяСтрока.ТабличнаяЧастьЕстьВМетаданных = Ложь;
	НоваяСтрока.ВыгружатьСтрокиПоУсловию 	  = НСтр("be = 'Выключана'; en = 'Turned off'; es = 'Apagado'; ka = 'გამორთული'; kk = 'Өшірілді'; ro = 'Dezactivat'; ru = 'Выключено'; tr = 'Kapatıldı'; uk = 'Вимкнено'; uz = ""O'chirilgan""");
	
	Если Копирование Тогда
		
		ТекущаяСтрока = Элементы.ОтображаемыеТабличныеЧасти.ТекущиеДанные;	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока, , "ТабличнаяЧастьДокументаMS,ТабличнаяЧастьДокументаMSПредставление");		
		
		//НайдСтроки = ТабличныеЧасти.НайтиСтроки(Новый Структура("ТабличнаяЧастьДокументаMS", ТекущаяСтрока.ТабличнаяЧастьДокументаMS));	
		Икс = 1;ВсегоКоличество = ТабличныеЧасти.Количество();
		Пока Икс < ВсегоКоличество Цикл
			СтрокаПоиска = ТабличныеЧасти[Икс];
			Если СтрокаПоиска.ТабличнаяЧастьДокументаMS = ТекущаяСтрока.ТабличнаяЧастьДокументаMS Тогда									
				СтрокаТЧ = _ЛокКонтекст.ЛокЯдро_СкопироватьСтруктуру(СтрокаПоиска);
				СтрокаТЧ.НастройкаТЧСтрокой = "";
				ТабличныеЧасти.Добавить(СтрокаТЧ);
			КонецЕсли;
			Икс = Икс + 1;
		КонецЦикла;
		
		Если СвязиТабличныхЧастей <> Неопределено Тогда
			Икс = 1;ВсегоКоличество = СвязиТабличныхЧастей.Количество();
			Пока Икс < ВсегоКоличество Цикл
				СтрокаПоиска = СвязиТабличныхЧастей[Икс];
				Если СтрокаПоиска.ТабличнаяЧастьДокументаMS = ТекущаяСтрока.ТабличнаяЧастьДокументаMS Тогда									
					СтрокаТЧ = _ЛокКонтекст.ЛокЯдро_СкопироватьСтруктуру(СтрокаПоиска);
					СтрокаТЧ.ТабличнаяЧастьДокументаMS = "";
					СвязиТабличныхЧастей.Добавить(СтрокаТЧ);
				КонецЕсли;
				Икс = Икс + 1;
			КонецЦикла;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображаемыеТабличныеЧастиПередНачаломИзменения(Элемент, Отказ)

	ТекущаяСтрока = Элементы.ОтображаемыеТабличныеЧасти.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ОтображаемыеТабличныеЧастиТабличнаяЧастьДокументаMS.СписокВыбора.Очистить();
	ТабличнаяЧастьДокументаMSПредыдущееЗначение = ТекущаяСтрока.ТабличнаяЧастьДокументаMS;
	
	Элементы.ОтображаемыеТабличныеЧастиТабличнаяЧастьДокументаMS.СписокВыбора.Добавить(ПредставлениеТабличнойЧастиДокументаMS(ТабличнаяЧастьДокументаMSПредыдущееЗначение));
	ЗаполнитьСписокВыбора(Элементы.ОтображаемыеТабличныеЧастиТабличнаяЧастьДокументаMS.СписокВыбора, ПолучитьСписокВыбораТабличныхЧастейMS());
	
	НастройкаТЧСтрокойПредыдущееЗначение		= ТекущаяСтрока.НастройкаТЧСтрокой;
КонецПроцедуры

&НаКлиенте
Процедура ОтображаемыеТабличныеЧастиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	
	ТекущаяСтрока = Элементы.ОтображаемыеТабличныеЧасти.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	УдалитьСтрокиПодчиненныхТабличныхЧастей(ТекущаяСтрока.ТабличнаяЧастьДокументаMS);
	
	ОтображаемыеТабличныеЧасти.Удалить(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ОтображаемыеТабличныеЧастиТабличнаяЧастьДокументаMSПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ОтображаемыеТабличныеЧасти.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.ТабличнаяЧастьДокументаMS = ТабличнаяЧастьДокументаMSПоПредставлению(ТекущаяСтрока.ТабличнаяЧастьДокументаMSПредставление);
	
	Если ТабличнаяЧастьДокументаMSПредыдущееЗначение = ТекущаяСтрока.ТабличнаяЧастьДокументаMS Тогда
		Возврат;			
	КонецЕсли;	
	
	ИзменитьВладельцаПодчиненныхТабличныхЧастей(ТабличнаяЧастьДокументаMSПредыдущееЗначение, ТекущаяСтрока.ТабличнаяЧастьДокументаMS);
	
	ТабличнаяЧастьДокументаMSПредыдущееЗначение = ТекущаяСтрока.ТабличнаяЧастьДокументаMS;
КонецПроцедуры

&НаКлиенте
Процедура ОтображаемыеТабличныеЧастиНастройкаТЧСтрокойПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОтображаемыеТабличныеЧасти.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НастройкаТЧСтрокойПредыдущееЗначение = ТекущаяСтрока.НастройкаТЧСтрокой Тогда
		Возврат;			
	КонецЕсли;	
	
	УдалитьСтрокиПодчиненныхТабличныхЧастей(ТекущаяСтрока.ТабличнаяЧастьДокументаMS);
	
	ТекущаяСтрока.ТабличнаяЧастьЕстьВМетаданных = ?(Лев(ТекущаяСтрока.НастройкаТЧСтрокой, 1) = "(" ИЛИ ПустаяСтрока(ТекущаяСтрока.НастройкаТЧСтрокой),
		Ложь, СтруктураДокумента1С.ТабличныеЧасти.Свойство(ТекущаяСтрока.НастройкаТЧСтрокой));
	ТекущаяСтрока.ВыгружатьСтрокиПоУсловию		  = НСтр("be = 'Выключана'; en = 'Turned off'; es = 'Apagado'; ka = 'გამორთული'; kk = 'Өшірілді'; ro = 'Dezactivat'; ru = 'Выключено'; tr = 'Kapatıldı'; uk = 'Вимкнено'; uz = ""O'chirilgan""");
	ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюФлаг 	  = Ложь;
	ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюСтрокой = "";
	
	Если НЕ Найти(ВРег(СокрЛП(ТекущаяСтрока.НастройкаТЧСтрокой)), ВРег(СокрЛП(НесколькоТабличныхЧастей))) Тогда
		НоваяСтруктура = ПолучитьСтруктуруТабличнойЧасти();
		ЗаполнитьЗначенияСвойств(НоваяСтруктура, ТекущаяСтрока);
		НоваяСтруктура.Настроить 					 = НСтр("be = 'Наладзіць'; en = 'Configure'; es = 'Configurar'; ka = 'კონფიგურაცია'; kk = 'Орнату'; ro = 'Configurați'; ru = 'Настроить'; tr = 'Ayarla'; uk = 'Налаштувати'; uz = 'Sozlash'");
		НоваяСтруктура.ТабличнаяЧастьДокумента1С 	 = Неопределено;
		НоваяСтруктура.ТекстЗапросаВыгрузкиНаТСД 	 = Неопределено;
		НоваяСтруктура.ТекстКодаПолучениеПараметров  = Неопределено;
		
		ТабличныеЧасти.Добавить(НоваяСтруктура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображаемыеТабличныеЧастиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		КолонкаИмя = Элемент.ТекущаяКолонка.Имя;
	#Иначе
		КолонкаИмя = Элемент.ТекущийЭлемент.Имя;	
	#КонецЕсли
	
	ИмяКолонкиНастройкаПолей  = ВРег(СокрЛП("ОтображаемыеТабличныеЧастиНастроить"));
	ИмяКолонкиУсловияВыгрузки = ВРег(СокрЛП("ОтображаемыеТабличныеЧастиВыгружатьСтрокиПоУсловию"));
	
	Если ВРег(СокрЛП(КолонкаИмя)) <> ИмяКолонкиНастройкаПолей
		И ВРег(СокрЛП(КолонкаИмя)) <> ИмяКолонкиУсловияВыгрузки Тогда
		Возврат;			
	КонецЕсли; 
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВРег(СокрЛП(КолонкаИмя)) = ИмяКолонкиУсловияВыгрузки Тогда
		Если НЕ ТекущаяСтрока.ТабличнаяЧастьЕстьВМетаданных Тогда
			ТекстПредупреждения = НСтр("be = 'Наладка даступна толькі для таблічных частак з метададзеных канфігурацыі 1С'; en = 'Configuration is only available for table parts from the metadata of 1C configuration'; es = 'La configuración solo está disponible para partes tabulares de los metadatos de la configuración de 1C'; ka = 'დაყენება ხდება მხოლოდ 1C-ის კონფიგურაციის ცხრილის ნაწილებისთვის'; kk = 'Табелді бөліктердің метадеректерінен 1С конфигурациясына тек қосылу мүмкін'; ro = 'Configurarea este disponibilă doar pentru părțile tabelei din metadatele configurației 1C'; ru = 'Настройка доступна только для табличных частей из метаданных конфигурации 1С'; tr = 'Yapılandırma, 1C yapılandırma verilerinden sadece tablo bölümleri için kullanılabilir'; uk = 'Налаштування доступна лише для табличних частин з метаданих конфігурації 1С'; uz = 'Sozlash faqat 1С konfiguratsiyasining metadatalaridan jadval qismlari uchun mavjud'");
			ПоказатьПредупреждение(, ТекстПредупреждения); 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ТабличнаяЧастьДокументаMS) Тогда
		ТекстПредупреждения = НСтр("be = 'Не абрана таблічная частка дакумента Cleverence'; en = 'No table part of Cleverence document selected'; es = 'No se ha seleccionado la parte de tabla del documento Cleverence'; ka = 'არ არის არჩეული Cleverence-ის ცხრილის ნაწილი'; kk = 'Cleverence документінің кестелі бөлімі таңдалмады'; ro = 'Nu a fost selectată partea tabulară a documentului Cleverence'; ru = 'Не выбрана табличная часть документа Клеверенс'; tr = 'Cleverence belgesinin tablo kısmı seçilmedi'; uk = 'Не обрана таблична частина документа Cleverence'; uz = 'Cleverence hujjati jadvallar qismi tanlanmagan'");
		ПоказатьПредупреждение(, ТекстПредупреждения); 
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущаяСтрока.НастройкаТЧСтрокой) Тогда
		ТекстПредупреждения = НСтр("be = 'Не абрана таблічная частка дакумента 1С'; en = 'No table part of 1C document selected'; es = 'No se ha seleccionado la parte de tabla del documento 1C'; ka = 'არ არის არჩეული 1C-ის ცხრილის ნაწილი'; kk = '1С документінің кестелі бөлімі таңдалмады'; ro = 'Nu a fost selectată partea tabulară a documentului 1C'; ru = 'Не выбрана табличная часть документа 1С'; tr = '1C belgesinin tablo kısmı seçilmedi'; uk = 'Не обрана таблична частина документа 1С'; uz = '1C hujjati jadvallar qismi tanlanmagan'");
		ПоказатьПредупреждение(, ТекстПредупреждения); 
		Возврат;	
	КонецЕсли; 
	
	Если ВРег(СокрЛП(КолонкаИмя)) = ИмяКолонкиУсловияВыгрузки Тогда
		
		НайдСтрока = _ЛокКонтекст.ЛокЯдро_НайтиСтруктуруВМассивеПоЭлементу(ТабличныеЧасти, "ТабличнаяЧастьДокументаMS", ТекущаяСтрока.ТабличнаяЧастьДокументаMS);
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ = ПолучитьФорму("ОФ_ФормаНастройки_УсловияУдаленияСтрокТЧ", ЭтаФорма);
		#Иначе
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаНастройки_УсловияУдаленияСтрокТЧ",, ЭтаФорма, ЭтаФорма);
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		#КонецЕсли
		
		ФормаНастройки_УсловияВыгрузкиСтрокТЧ._ЛокКонтекст 		  = _ЛокКонтекст;
		ФормаНастройки_УсловияВыгрузкиСтрокТЧ.ТипДокумента1С 	  = ТипДокумента1С;
		ФормаНастройки_УсловияВыгрузкиСтрокТЧ.ИмяТабличнойЧасти1С = ТекущаяСтрока.НастройкаТЧСтрокой;
				
		ФормаНастройки_УсловияВыгрузкиСтрокТЧ.КомпоновщикНастроекСтрокой = ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюСтрокой;
		ФормаНастройки_УсловияВыгрузкиСтрокТЧ.УдалятьСтрокиПоУсловиюФлаг = ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюФлаг;
		
		ОП = Новый ОписаниеОповещения("ФормаНастройки_УсловияВыгрузкиСтрокТЧЗакрытие", ЭтаФорма, Новый Структура("НайдСтрока, ТекущаяСтрока", НайдСтрока, ТекущаяСтрока));
		ФормаНастройки_УсловияВыгрузкиСтрокТЧ.ОписаниеОповещенияОЗакрытии = ОП;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.Заголовок = 
				НСтр("be = 'Cleverence: Налада ўмовы выгрузкі радкоў'; en = 'Cleverence: Setting up conditions for unloading rows'; es = 'Cleverence: Configuración de condiciones de descarga de filas'; ka = 'Cleverence: სტრიქონების გამოტანის პარამეტრები'; kk = 'Cleverence: Строкаларды шығару мәртебесін орнату'; ro = 'Cleverence: Configurarea condițiilor de descărcare a rândurilor'; ru = 'Клеверенс: Настройка условия выгрузки строк'; tr = 'Cleverence: Satır dışa aktarımı koşulları ayarları'; uk = 'Cleverence: Налаштування умов вивантаження рядків'; uz = 'Cleverence: Qatorlarni yuklash shartlarini sozlash'");
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.ЭлементыФормы.ТекстПодсказки.Заголовок = 
				НСтр("be = 'Наладзіце ўмову выгрузкі радкоў таблічнай часткі. Будуць выгружаны толькі тыя радкі, якія задавальняюць зададзенай ўмове'; en = 'Configure the condition for unloading rows of the table part. Only rows that meet the specified condition will be unloaded'; es = 'Configure la condición para descargar filas de la parte de tabla. Solo se descargarán las filas que cumplan con la condición especificada'; ka = 'დაარეგულეთ სტრიქონების გამოტანის პირობა. გამოტანილი იქნება მხოლოდ ის სტრიქონები, რომლებიც აკმაყოფილებენ დაცნობილ პირობას'; kk = 'Кестелі бөлімнің жолдарын шығару шартын теңшеңіз. Белгіленген шартқа сай болатын тек жолдар шығарылады'; ro = 'Configurați condiția de descărcare a liniilor părții tabulare. Vor fi descărcate doar liniile care îndeplinesc condiția specificată'; ru = 'Настройте условие выгрузки строк табличной части. Будут выгружены только те строки, которые удовлетворяют заданному условию'; tr = 'Tablo kısmı satırlarının indirilme koşulunu ayarlayın. Belirtilen koşulu sağlayan satırlar yalnızca indirilecektir'; uk = 'Налаштуйте умову вивантаження рядків табличної частини. Будуть вивантажені тільки ті рядки, які задовольняють заданій умові'; uz = 'Jadvallar qatori qatorlarini yuklash sharti sozlang. Faqat berilgan shartni qondiradigan qatorlar yuklanadi'");	
				
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.ОткрытьМодально();
		#Иначе
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.Заголовок = 
				НСтр("be = 'Cleverence: Налада ўмовы выгрузкі радкоў'; en = 'Cleverence: Setting up conditions for unloading rows'; es = 'Cleverence: Configuración de condiciones de descarga de filas'; ka = 'Cleverence: სტრიქონების გამოტანის პარამეტრები'; kk = 'Cleverence: Строкаларды шығару мәртебесін орнату'; ro = 'Cleverence: Configurarea condițiilor de descărcare a rândurilor'; ru = 'Клеверенс: Настройка условия выгрузки строк'; tr = 'Cleverence: Satır dışa aktarımı koşulları ayarları'; uk = 'Cleverence: Налаштування умов вивантаження рядків'; uz = 'Cleverence: Qatorlarni yuklash shartlarini sozlash'");
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.Элементы.ТекстПодсказки.Заголовок = 
				НСтр("be = 'Наладзіце ўмову выгрузкі радкоў таблічнай часткі. Будуць выгружаны толькі тыя радкі, якія задавальняюць зададзенай ўмове'; en = 'Configure the condition for unloading rows of the table part. Only rows that meet the specified condition will be unloaded'; es = 'Configure la condición para descargar filas de la parte de tabla. Solo se descargarán las filas que cumplan con la condición especificada'; ka = 'დაარეგულეთ სტრიქონების გამოტანის პირობა. გამოტანილი იქნება მხოლოდ ის სტრიქონები, რომლებიც აკმაყოფილებენ დაცნობილ პირობას'; kk = 'Кестелі бөлімнің жолдарын шығару шартын теңшеңіз. Белгіленген шартқа сай болатын тек жолдар шығарылады'; ro = 'Configurați condiția de descărcare a liniilor părții tabulare. Vor fi descărcate doar liniile care îndeplinesc condiția specificată'; ru = 'Настройте условие выгрузки строк табличной части. Будут выгружены только те строки, которые удовлетворяют заданному условию'; tr = 'Tablo kısmı satırlarının indirilme koşulunu ayarlayın. Belirtilen koşulu sağlayan satırlar yalnızca indirilecektir'; uk = 'Налаштуйте умову вивантаження рядків табличної частини. Будуть вивантажені тільки ті рядки, які задовольняють заданій умові'; uz = 'Jadvallar qatori qatorlarini yuklash sharti sozlang. Faqat berilgan shartni qondiradigan qatorlar yuklanadi'");	
			
			ФормаНастройки_УсловияВыгрузкиСтрокТЧ.Открыть();
		#КонецЕсли
		
	ИначеЕсли Найти(ВРег(СокрЛП(ТекущаяСтрока.НастройкаТЧСтрокой)), ВРег(СокрЛП(НесколькоТабличныхЧастей))) Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаНастройки_СвязиВыгрузкиТЧ = ПолучитьФорму("ОФ_ФормаНастройки_СвязиВыгрузкиТЧ", ЭтаФорма);
		#Иначе
			ФормаНастройки_СвязиВыгрузкиТЧ = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаНастройки_СвязиВыгрузкиТЧ", , ЭтаФорма, ЭтаФорма);
			ФормаНастройки_СвязиВыгрузкиТЧ.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		#КонецЕсли
		ФормаНастройки_СвязиВыгрузкиТЧ._ЛокКонтекст 				= _ЛокКонтекст;		
		ФормаНастройки_СвязиВыгрузкиТЧ.ТипДокумента1С 				= ТипДокумента1С;
		ФормаНастройки_СвязиВыгрузкиТЧ.ТипДокументаMS 				= ТипДокументаMS;
		ФормаНастройки_СвязиВыгрузкиТЧ.СтруктураДокумента1С        	= СтруктураДокумента1С;
		ФормаНастройки_СвязиВыгрузкиТЧ.СтруктураДокументаMS        	= СтруктураДокументаMS;				
		ФормаНастройки_СвязиВыгрузкиТЧ.ТабличнаяЧастьДокументаMS  	= ТекущаяСтрока.ТабличнаяЧастьДокументаMS;		
		ФормаНастройки_СвязиВыгрузкиТЧ.пТабличныеЧасти 				= _ЛокКонтекст.ЛокЯдро_СкопироватьМассив(ТабличныеЧасти,Новый Структура("ТабличнаяЧастьДокументаMS", ТекущаяСтрока.ТабличнаяЧастьДокументаMS));
		ФормаНастройки_СвязиВыгрузкиТЧ.пСвязиТабличныхЧастей 		= _ЛокКонтекст.ЛокЯдро_СкопироватьМассив(СвязиТабличныхЧастей,Новый Структура("ТабличнаяЧастьДокументаMS", ТекущаяСтрока.ТабличнаяЧастьДокументаMS));
		ФормаНастройки_СвязиВыгрузкиТЧ.КлючНастройки 				= "Выгрузка_ТабличнаяЧастьДокумента";
		ФормаНастройки_СвязиВыгрузкиТЧ.ИмяТабличнойЧасти1С 			= ТекущаяСтрока.НастройкаТЧСтрокой;
		
		НайдСтрока = _ЛокКонтекст.ЛокЯдро_НайтиСтруктуруВМассивеПоЭлементу(ТабличныеЧасти,"ТабличнаяЧастьДокументаMS",ТекущаяСтрока.ТабличнаяЧастьДокументаMS);
		ФормаНастройки_СвязиВыгрузкиТЧ.Обработчик_ПослеОбъединенияСтрокиТабличнойЧасти		
			= ?(НайдСтрока <> Неопределено И НайдСтрока.Свойство("Обработчик_ПослеОбъединенияСтрокиТабличнойЧасти"), НайдСтрока.Обработчик_ПослеОбъединенияСтрокиТабличнойЧасти, Неопределено);
		ФормаНастройки_СвязиВыгрузкиТЧ.Обработчик_ПослеОбъединенияТабличнойЧасти 			
			= ?(НайдСтрока <> Неопределено И НайдСтрока.Свойство("Обработчик_ПослеОбъединенияТабличнойЧасти"), НайдСтрока.Обработчик_ПослеОбъединенияТабличнойЧасти, Неопределено);
		ФормаНастройки_СвязиВыгрузкиТЧ.ВидОбработчика_ПослеОбъединенияСтрокиТабличнойЧасти	
			= ?(НайдСтрока <> Неопределено И НайдСтрока.Свойство("ВидОбработчика_ПослеОбъединенияСтрокиТабличнойЧасти"), НайдСтрока.ВидОбработчика_ПослеОбъединенияСтрокиТабличнойЧасти, Неопределено);
		ФормаНастройки_СвязиВыгрузкиТЧ.ВидОбработчика_ПослеОбъединенияТабличнойЧасти 		
			= ?(НайдСтрока <> Неопределено И НайдСтрока.Свойство("ВидОбработчика_ПослеОбъединенияТабличнойЧасти"), НайдСтрока.ВидОбработчика_ПослеОбъединенияТабличнойЧасти, Неопределено);
		
		ОП = Новый ОписаниеОповещения("ФормаНастройки_СвязиВыгрузкиТЧЗакрытие",ЭтаФорма,Новый Структура("ТекущаяСтрока",ТекущаяСтрока));
		ФормаНастройки_СвязиВыгрузкиТЧ.ОписаниеОповещенияОЗакрытии = ОП;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаНастройки_СвязиВыгрузкиТЧ.ОткрытьМодально();
		#Иначе
			ФормаНастройки_СвязиВыгрузкиТЧ.Открыть();
		#КонецЕсли
				
	Иначе					
		
		НайдСтрока = _ЛокКонтекст.ЛокЯдро_НайтиСтруктуруВМассивеПоЭлементу(ТабличныеЧасти,"ТабличнаяЧастьДокументаMS",ТекущаяСтрока.ТабличнаяЧастьДокументаMS);
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаНастройки_ПравилаВыгрузкиПолей = ПолучитьФорму("ОФ_ФормаНастройки_ПравилаВыгрузкиПолей", ЭтаФорма);
		#Иначе
			ФормаНастройки_ПравилаВыгрузкиПолей = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаНастройки_ПравилаВыгрузкиПолей", , ЭтаФорма, ЭтаФорма);
			ФормаНастройки_ПравилаВыгрузкиПолей.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		#КонецЕсли
		
		ФормаНастройки_ПравилаВыгрузкиПолей._ЛокКонтекст 		= _ЛокКонтекст;
		ФормаНастройки_ПравилаВыгрузкиПолей.КлючНастройки 		= "Выгрузка_ТабличнаяЧастьДокумента";
		ФормаНастройки_ПравилаВыгрузкиПолей.ТипДокумента1С 		= ТипДокумента1С;
		ФормаНастройки_ПравилаВыгрузкиПолей.ТипДокументаMS 		= ТипДокументаMS;
		ФормаНастройки_ПравилаВыгрузкиПолей.ИмяТабличнойЧастиMS = ТекущаяСтрока.ТабличнаяЧастьДокументаMS;
		ФормаНастройки_ПравилаВыгрузкиПолей.ИмяТабличнойЧасти1С = ТекущаяСтрока.НастройкаТЧСтрокой;
		
		Если НайдСтрока <> Неопределено Тогда
			ФормаНастройки_ПравилаВыгрузкиПолей.ТекстЗапросаВыгрузкиНаТСД       = НайдСтрока.ТекстЗапросаВыгрузкиНаТСД;
			НайдСтрока.Свойство("ТекстКодаПолучениеПараметров",ФормаНастройки_ПравилаВыгрузкиПолей.ТекстКодаПолучениеПараметров);
			Если ТипЗнч(НайдСтрока.ТабличнаяЧастьДокумента1С) = Тип("Массив") Тогда
				ФормаНастройки_ПравилаВыгрузкиПолей.ТаблицаРеквизитовИсходная	= _ЛокКонтекст.ЛокЯдро_СкопироватьМассив(НайдСтрока.ТабличнаяЧастьДокумента1С);
			КонецЕсли;
		КонецЕсли;	
		
		ФормаНастройки_ПравилаВыгрузкиПолей.ТаблицаРеквизитовДополнительная 					= ТаблицаРеквизитовДополнительная;	
		ФормаНастройки_ПравилаВыгрузкиПолей.ВидОбработчика_ПередВыгрузкойСтрокиТабличнойЧасти 	= НайдСтрока.ВидОбработчика_ПередВыгрузкойСтрокиТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.ВидОбработчика_ПередВыгрузкойТабличнойЧасти 		= НайдСтрока.ВидОбработчика_ПередВыгрузкойТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.ВидОбработчика_ПослеВыгрузкиСтрокиТабличнойЧасти 	= НайдСтрока.ВидОбработчика_ПослеВыгрузкиСтрокиТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.ВидОбработчика_ПослеВыгрузкиТабличнойЧасти 			= НайдСтрока.ВидОбработчика_ПослеВыгрузкиТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.Обработчик_ПередВыгрузкойТабличнойЧасти 			= НайдСтрока.Обработчик_ПередВыгрузкойТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.Обработчик_ПередВыгрузкойСтрокиТабличнойЧасти 		= НайдСтрока.Обработчик_ПередВыгрузкойСтрокиТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.Обработчик_ПослеВыгрузкиСтрокиТабличнойЧасти		= НайдСтрока.Обработчик_ПослеВыгрузкиСтрокиТабличнойЧасти;
		ФормаНастройки_ПравилаВыгрузкиПолей.Обработчик_ПослеВыгрузкиТабличнойЧасти 				= НайдСтрока.Обработчик_ПослеВыгрузкиТабличнойЧасти;
		
		ОП = Новый ОписаниеОповещения("ФормаНастройки_ПравилаВыгрузкиПолейЗакрытие",ЭтаФорма,Новый Структура("НайдСтрока,ТекущаяСтрока",НайдСтрока,ТекущаяСтрока));
		ФормаНастройки_ПравилаВыгрузкиПолей.ОписаниеОповещенияОЗакрытии = ОП;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаНастройки_ПравилаВыгрузкиПолей.ОткрытьМодально();
		#Иначе
			ФормаНастройки_ПравилаВыгрузкиПолей.Открыть();
		#КонецЕсли
		
	КонецЕсли;	  	

КонецПроцедуры

&НаКлиенте
Процедура ФормаНастройки_ПравилаВыгрузкиПолейЗакрытие(РезультатРедактирования,СтруктураПараметров) Экспорт
	
	Если РезультатРедактирования <> Неопределено Тогда
		ТекущаяСтрока = СтруктураПараметров.ТекущаяСтрока;
		
		Если СтруктураПараметров.НайдСтрока = Неопределено Тогда
			НоваяСтруктура = ПолучитьСтруктуруТабличнойЧасти();
			ЗаполнитьЗначенияСвойств(НоваяСтруктура, ТекущаяСтрока);
			НоваяСтруктура.Настроить = "Настроить";
			НоваяСтруктура.ТабличнаяЧастьДокумента1С = Неопределено;
			НоваяСтруктура.ТекстЗапросаВыгрузкиНаТСД = Неопределено;
			НоваяСтруктура.ТекстКодаПолучениеПараметров = Неопределено;
			
			ТабличныеЧасти.Добавить(НоваяСтруктура);
			НайдСтрока = Новый Структура;
		Иначе
			ТабличнаяЧастьДокументаMS = СтруктураПараметров.НайдСтрока.ТабличнаяЧастьДокументаMS;
			Для Каждого ЭлементМассива Из ТабличныеЧасти Цикл
				Если ЭлементМассива.Свойство("ЭтоТаблицаЗначений")
					ИЛИ НЕ ЭлементМассива.Свойство("ТабличнаяЧастьДокументаMS")
					ИЛИ ЭлементМассива.ТабличнаяЧастьДокументаMS <> ТабличнаяЧастьДокументаMS Тогда
					Продолжить;
				КонецЕсли;
				НайдСтрока = ЭлементМассива;
				Прервать;
			КонецЦикла;
		КонецЕсли;	
				
		НайдСтрока.Вставить("ТабличнаяЧастьДокумента1С",							РезультатРедактирования.ТаблицаНастроек);		
		НайдСтрока.Вставить("ТекстЗапросаВыгрузкиНаТСД",							РезультатРедактирования.ТекстЗапросаВыгрузкиНаТСД);		
		НайдСтрока.Вставить("ТекстКодаПолучениеПараметров",							РезультатРедактирования.ТекстКодаПолучениеПараметров);				
		НайдСтрока.Вставить("ВидОбработчика_ПередВыгрузкойСтрокиТабличнойЧасти",	РезультатРедактирования.ВидОбработчика_ПередВыгрузкойСтрокиТабличнойЧасти);
		НайдСтрока.Вставить("ВидОбработчика_ПередВыгрузкойТабличнойЧасти",			РезультатРедактирования.ВидОбработчика_ПередВыгрузкойТабличнойЧасти);
		НайдСтрока.Вставить("ВидОбработчика_ПослеВыгрузкиСтрокиТабличнойЧасти",		РезультатРедактирования.ВидОбработчика_ПослеВыгрузкиСтрокиТабличнойЧасти);
		НайдСтрока.Вставить("ВидОбработчика_ПослеВыгрузкиТабличнойЧасти",			РезультатРедактирования.ВидОбработчика_ПослеВыгрузкиТабличнойЧасти);
		НайдСтрока.Вставить("ВидОбработчика_ПослеОбъединенияСтрокиТабличнойЧасти",	Неопределено);
		НайдСтрока.Вставить("ВидОбработчика_ПослеОбъединенияТабличнойЧасти",		Неопределено);
		НайдСтрока.Вставить("Обработчик_ПередВыгрузкойТабличнойЧасти",				РезультатРедактирования.Обработчик_ПередВыгрузкойТабличнойЧасти);
		НайдСтрока.Вставить("Обработчик_ПередВыгрузкойСтрокиТабличнойЧасти",		РезультатРедактирования.Обработчик_ПередВыгрузкойСтрокиТабличнойЧасти);
		НайдСтрока.Вставить("Обработчик_ПослеВыгрузкиСтрокиТабличнойЧасти",			РезультатРедактирования.Обработчик_ПослеВыгрузкиСтрокиТабличнойЧасти);
		НайдСтрока.Вставить("Обработчик_ПослеВыгрузкиТабличнойЧасти",				РезультатРедактирования.Обработчик_ПослеВыгрузкиТабличнойЧасти);		
		НайдСтрока.Вставить("Обработчик_ПослеОбъединенияСтрокиТабличнойЧасти",		Неопределено);
		НайдСтрока.Вставить("Обработчик_ПослеОбъединенияТабличнойЧасти",			Неопределено);		
		НайдСтрока.Вставить("Настроить",											"Настроено");
		
		ТекущаяСтрока.Настроить	= НСтр("be = 'Наладжана'; en = 'Configured'; es = 'Configurado'; ka = 'დაკარგულია'; kk = 'Орнатылған'; ro = 'Configurat'; ru = 'Настроено'; tr = 'Ayarlandı'; uk = 'Налаштовано'; uz = 'Sozlandi'");   		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаНастройки_СвязиВыгрузкиТЧЗакрытие(РезультатРедактирования,СтруктураПараметров) Экспорт
	
	Если РезультатРедактирования <> Неопределено Тогда
		
		ТекущаяСтрока = СтруктураПараметров.ТекущаяСтрока;
		УдалитьСтрокиПодчиненныхТабличныхЧастей(ТекущаяСтрока.ТабличнаяЧастьДокументаMS);
		
		НастройкаТЧСтрокой = "(" + НесколькоТабличныхЧастей + ": ";			
		
		КоличествоТабличныхЧастей = 0;
		
		Для каждого Строка Из РезультатРедактирования.ТабличныеЧасти Цикл
			Если Строка.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ПолучитьСтруктуруТабличнойЧасти();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.ТабличнаяЧастьДокумента1С = _ЛокКонтекст.ЛокЯдро_ЗначениеИзСтрокиXML(Строка.ТабличнаяЧастьДокумента1ССтрокой);
										
			ТабличныеЧасти.Добавить(НоваяСтрока);					
			НастройкаТЧСтрокой = НастройкаТЧСтрокой + Строка.НастройкаТЧСтрокой + ", ";
			
			КоличествоТабличныхЧастей = КоличествоТабличныхЧастей + 1;
		КонецЦикла; 
		
		НастройкаТЧСтрокой = Лев(НастройкаТЧСтрокой, СтрДлина(НастройкаТЧСтрокой) - 2) + ")";						
		
		Если КоличествоТабличныхЧастей = 1 Тогда 
			Для каждого Строка Из РезультатРедактирования.ТабличныеЧасти Цикл
				Если Строка.Свойство("ЭтоТаблицаЗначений") Тогда
					Продолжить;
				КонецЕсли;
				
				НастройкаТЧСтрокой = Строка.НастройкаТЧСтрокой;
			КонецЦикла;
		КонецЕсли; 	
		
		ТекущаяСтрока.НастройкаТЧСтрокой 	= НастройкаТЧСтрокой; 					
		ТекущаяСтрока.Настроить				= НСтр("be = 'Наладжана'; en = 'Configured'; es = 'Configurado'; ka = 'დაკარგულია'; kk = 'Орнатылған'; ro = 'Configurat'; ru = 'Настроено'; tr = 'Ayarlandı'; uk = 'Налаштовано'; uz = 'Sozlandi'");
		
		Для Каждого ТекущаяТабличнаяЧасть Из ТабличныеЧасти Цикл
			Если ТекущаяТабличнаяЧасть.Свойство("ЭтоТаблицаЗначений")
				ИЛИ НЕ ТекущаяТабличнаяЧасть.Свойство("ТабличнаяЧастьДокументаMS")
				ИЛИ ТекущаяТабличнаяЧасть.ТабличнаяЧастьДокументаMS <> "СтрокиПлан" Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущаяТабличнаяЧасть.Вставить("ВидОбработчика_ПослеОбъединенияСтрокиТабличнойЧасти",	РезультатРедактирования.ВидОбработчика_ПослеОбъединенияСтрокиТабличнойЧасти);
			ТекущаяТабличнаяЧасть.Вставить("ВидОбработчика_ПослеОбъединенияТабличнойЧасти",			РезультатРедактирования.ВидОбработчика_ПослеОбъединенияТабличнойЧасти);
			ТекущаяТабличнаяЧасть.Вставить("Обработчик_ПослеОбъединенияСтрокиТабличнойЧасти",		РезультатРедактирования.Обработчик_ПослеОбъединенияСтрокиТабличнойЧасти);
			ТекущаяТабличнаяЧасть.Вставить("Обработчик_ПослеОбъединенияТабличнойЧасти",				РезультатРедактирования.Обработчик_ПослеОбъединенияТабличнойЧасти);	
			
		КонецЦикла; 		
		
		Если СвязиТабличныхЧастей = Неопределено Тогда
			СвязиТабличныхЧастей = РезультатРедактирования.СвязиТабличныхЧастей;
		Иначе
			Для каждого Строка Из РезультатРедактирования.СвязиТабличныхЧастей Цикл
				Если Строка.Свойство("ЭтоТаблицаЗначений") Тогда
					Продолжить;
				КонецЕсли;
				СвязиТабличныхЧастей.Добавить(Строка);
			КонецЦикла; 			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаНастройки_УсловияВыгрузкиСтрокТЧЗакрытие(РезультатРедактирования, СтруктураПараметров) Экспорт
	
	Если РезультатРедактирования <> Неопределено Тогда
		ТекущаяСтрока 								  = СтруктураПараметров.ТекущаяСтрока;
		ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюФлаг 	  = РезультатРедактирования.УдалятьСтрокиПоУсловиюФлаг;
		ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюСтрокой = РезультатРедактирования.УдалятьСтрокиПоУсловиюСтрокой;
		
		Если РезультатРедактирования.УдалятьСтрокиПоУсловиюФлаг = Истина Тогда
			ТекущаяСтрока.ВыгружатьСтрокиПоУсловию = НСтр("be = 'Уключана'; en = 'Enabled'; es = 'Activado'; ka = 'ჩართულია'; kk = 'Қосылған'; ro = 'Activat'; ru = 'Включено'; tr = 'Açık'; uk = 'Увімкнено'; uz = 'Йўқ'");
		Иначе
			ТекущаяСтрока.ВыгружатьСтрокиПоУсловию = НСтр("be = 'Выключана'; en = 'Turned off'; es = 'Apagado'; ka = 'გამორთული'; kk = 'Өшірілді'; ro = 'Dezactivat'; ru = 'Выключено'; tr = 'Kapatıldı'; uk = 'Вимкнено'; uz = ""O'chirilgan""");
		КонецЕсли;
		
		Если СтруктураПараметров.НайдСтрока = Неопределено Тогда
			НоваяСтруктура = ПолучитьСтруктуруТабличнойЧасти();
			ЗаполнитьЗначенияСвойств(НоваяСтруктура, ТекущаяСтрока);
			НоваяСтруктура.Настроить					= "Настроить";
			НоваяСтруктура.ТабличнаяЧастьДокумента1С 	= Неопределено;
			НоваяСтруктура.ТекстЗапросаВыгрузкиНаТСД 	= Неопределено;
			НоваяСтруктура.ТекстКодаПолучениеПараметров = Неопределено;
			
			ТабличныеЧасти.Добавить(НоваяСтруктура);
			НайдСтрока = Новый Структура;
		Иначе
			ТабличнаяЧастьДокументаMS = СтруктураПараметров.НайдСтрока.ТабличнаяЧастьДокументаMS;
			Для Каждого ЭлементМассива Из ТабличныеЧасти Цикл
				Если ЭлементМассива.Свойство("ЭтоТаблицаЗначений")
					ИЛИ НЕ ЭлементМассива.Свойство("ТабличнаяЧастьДокументаMS")
					ИЛИ ЭлементМассива.ТабличнаяЧастьДокументаMS <> ТабличнаяЧастьДокументаMS Тогда
					Продолжить;
				КонецЕсли;
				НайдСтрока = ЭлементМассива;
				Прервать;
			КонецЦикла;
		КонецЕсли;
		
		НайдСтрока.Вставить("ВыгружатьСтрокиПоУсловиюФлаг",	   ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюФлаг);
		НайдСтрока.Вставить("ВыгружатьСтрокиПоУсловиюСтрокой", ТекущаяСтрока.ВыгружатьСтрокиПоУсловиюСтрокой);
	КонецЕсли;
	
КонецПроцедуры

#Если ТолстыйКлиентОбычноеПриложение Тогда
	
	Процедура ОтображаемыеТабличныеЧастиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
		Если ДанныеСтроки.Настроить = НСтр("be = 'Наладжана'; en = 'Configured'; es = 'Configurado'; ka = 'დაკარგულია'; kk = 'Орнатылған'; ro = 'Configurat'; ru = 'Настроено'; tr = 'Ayarlandı'; uk = 'Налаштовано'; uz = 'Sozlandi'") 
		Тогда
			ОформлениеСтроки.Ячейки.ОтображаемыеТабличныеЧастиНастроить.ЦветТекста = WebЦвета.Зеленый;	
		Иначе	
			ОформлениеСтроки.Ячейки.ОтображаемыеТабличныеЧастиНастроить.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
		
		Если ДанныеСтроки.ТабличнаяЧастьЕстьВМетаданных Тогда
			Если ДанныеСтроки.ВыгружатьСтрокиПоУсловию = НСтр("be = 'Уключана'; en = 'Enabled'; es = 'Activado'; ka = 'ჩართულია'; kk = 'Қосылған'; ro = 'Activat'; ru = 'Включено'; tr = 'Açık'; uk = 'Увімкнено'; uz = 'Йўқ'") 
			Тогда
				ОформлениеСтроки.Ячейки.ОтображаемыеТабличныеЧастиВыгружатьСтрокиПоУсловию.ЦветТекста = WebЦвета.Зеленый;
			Иначе	
				ОформлениеСтроки.Ячейки.ОтображаемыеТабличныеЧастиВыгружатьСтрокиПоУсловию.ЦветТекста = WebЦвета.Красный;
			КонецЕсли;
		Иначе
			ОформлениеСтроки.Ячейки.ОтображаемыеТабличныеЧастиВыгружатьСтрокиПоУсловию.ЦветТекста = WebЦвета.СветлоСерый;
		КонецЕсли;
	КонецПроцедуры

	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = Новый Структура();
	Для каждого Элемент ИЗ ЭлементыФормы Цикл
		Элементы.Вставить(Элемент.Имя,Элемент);
		Если ТипЗнч(Элемент) = Тип("ТабличноеПоле") Тогда
			Для каждого Колонка ИЗ Элемент.Колонки Цикл
				Элементы.Вставить(Колонка.Имя,Колонка.ЭлементУправления);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Объект = ЭтотОбъект;
	
#КонецЕсли