#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	//СтандартнаяОбработка = Ложь;
	
	//1. Получение схемы компоновки данных
	//ОсновнаяСхемаКД = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных1");
	//
	//2. Получение настроек компоновки данных
	//НастройкиКД = КомпоновщикНастроек.ПолучитьНастройки();
	//
	//3. Получение макета компоновки данных
	//КомпоновщикМакетаКД = Новый КомпоновщикМакетаКомпоновкиДанных;    
	//МакетКомпоновкиКД = КомпоновщикМакетаКД.Выполнить(ОсновнаяСхемаКД, НастройкиКД, ДанныеРасшифровки);
	//
	//4. Компоновка данных
	//ПроцессорКД = новый ПроцессорКомпоновкиДанных;
	//ПроцессорКД.Инициализировать(МакетКомпоновкиКД, , ДанныеРасшифровки);
	//
	//5. Вывод результата компоновки в результат.
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//ПроцессорВывода.Вывести(ПроцессорКД);
	
КонецПроцедуры  

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция СформироватьОтчет() Экспорт
	
	РезультатФормирования = КонтурЗакупки_СтруктурыКлиентСервер.ИнициализироватьРезультатФункции();
	
	ДанныеОтчета = ДанныеДляПостроенияОтчета();
	
	Если ДанныеОтчета.Строки.Количество() = 0 Тогда    
		
		РезультатФормирования.message = НСтр("ru = 'Нет данных для формирования отчета по результатам закупки.'");				
		РезультатФормирования.error   = Истина;
				
		Возврат РезультатФормирования;
				
	КонецЕсли;
	
	РезультатФормирования.data = СформироватьТабличныйДокумент(ДанныеОтчета);
	
	Возврат РезультатФормирования;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СформироватьТабличныйДокумент(ДанныеОтчета)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.НачатьАвтогруппировкуСтрок();
	
	ОбластиОтчета = ПолучитьОбластиОтчета();
		
	Для Каждого СтрокаШапка Из ДанныеОтчета.Строки Цикл
		
		// Шапка отчета.
		ОбластьЗакупка = ОбластиОтчета.Закупка;
		ОбластьЗакупка.Параметры.Заполнить(СтрокаШапка);
		ТабДокумент.Вывести(ОбластьЗакупка);
		
		Для Каждого СтрокаПервогоУровня Из СтрокаШапка.Строки Цикл
			
			НомерПоПорядку = СтрокаПервогоУровня.СистемныеПоляНомерПоПорядкуВГруппировке;
			
			Если СтрокаПервогоУровня.ЭтоКонтракт = Истина Тогда				
				ОбластьШапка  = ОбластиОтчета.КонтрактыШапка;
				ОбластьСтроки = ОбластиОтчета.КонтрактыСтроки;								
			ИначеЕсли СтрокаПервогоУровня.ЭтоПроект = Истина Тогда			
				ОбластьШапка  = ОбластиОтчета.ПроектыШапка;
				ОбластьСтроки = ОбластиОтчета.ПроектыСтроки;				
			Иначе				
				ОбластьШапка  = ОбластиОтчета.ПротоколыШапка;
				ОбластьСтроки = ОбластиОтчета.ПротоколыСтроки;				
			КонецЕсли; 
			
			Если НомерПоПорядку = 1 Тогда
				ТабДокумент.Вывести(ОбластьШапка, 1, "ПервыйУровень");			
			КонецЕсли;
			
			ОбластьСтроки.Параметры.Заполнить(СтрокаПервогоУровня);			
			ТабДокумент.Вывести(ОбластьСтроки, 1, "ПервыйУровень");
						
			Для Каждого СтрокаВторогоУровня Из СтрокаПервогоУровня.Строки Цикл	
				
				НомерПоПорядку = СтрокаВторогоУровня.СистемныеПоляНомерПоПорядкуВГруппировке;
				
				Если СтрокаВторогоУровня.ЭтоОбъектЗакупки = Истина Тогда
					ОбластьШапка  = ОбластиОтчета.ОбъектыЗакупкиШапка;
					ОбластьСтроки = ОбластиОтчета.ОбъектыЗакупкиСтроки;
				ИначеЕсли СтрокаВторогоУровня.ЭтоПоставщик = Истина Тогда
                	ОбластьШапка  = ОбластиОтчета.ПоставщикиШапка;
					ОбластьСтроки = ОбластиОтчета.ПоставщикиСтроки;
				ИначеЕсли СтрокаВторогоУровня.ЭтоДокументКонтракта = Истина Тогда
                	ОбластьШапка  = ОбластиОтчета.ДокументыКонтрактаШапка;
					ОбластьСтроки = ОбластиОтчета.ДокументыКонтрактаСтроки;
				ИначеЕсли СтрокаВторогоУровня.ЭтоДокументПроекта = Истина Тогда
                	ОбластьШапка  = ОбластиОтчета.ДокументыПроектаШапка;
					ОбластьСтроки = ОбластиОтчета.ДокументыПроектаСтроки;
				ИначеЕсли СтрокаВторогоУровня.ЭтоУчастник = Истина Тогда
                	ОбластьШапка  = ОбластиОтчета.УчастникиШапка;
					ОбластьСтроки = ОбластиОтчета.УчастникиСтроки;
				Иначе
                	ОбластьШапка  = ОбластиОтчета.ДокументыПротоколаШапка;
					ОбластьСтроки = ОбластиОтчета.ДокументыПротоколаСтроки;
				КонецЕсли; 
								
				Если НомерПоПорядку = 1 Тогда
					ТабДокумент.Вывести(ОбластьШапка, 2, "ВторойУровень");			
				КонецЕсли; 
				
				ОбластьСтроки.Параметры.Заполнить(СтрокаВторогоУровня);
				ТабДокумент.Вывести(ОбластьСтроки, 2, "ВторойУровень");
				
				Если СтрокаВторогоУровня.УчастникПричинаНесоответствияЗаполнена = Истина Тогда 
					ОбластьПричина = ОбластиОтчета.ПричинаНесоответствия; 
					ОбластьПричина.Параметры.Заполнить(СтрокаВторогоУровня);
					ТабДокумент.Вывести(ОбластьПричина, 2, "ВторойУровень");		
				КонецЕсли;
				
				Если СтрокаВторогоУровня.Строки.Количество() > 0 Тогда
					
					Для Каждого СтрокаТретьегоУровня Из СтрокаВторогоУровня.Строки Цикл
						
						Если СтрокаТретьегоУровня.ЭтоКодОКВЭД2 = Истина Тогда
							ОбластьСтроки = ОбластиОтчета.КодыОКВЭД2; 
						ИначеЕсли СтрокаТретьегоУровня.ЭтоКодОКПД2 = Истина Тогда
							ОбластьСтроки = ОбластиОтчета.КодыОКПД2; 
						Иначе
							ОбластьСтроки = ОбластиОтчета.КодыКТРУ; 
						КонецЕсли;
						
						ОбластьСтроки.Параметры.Заполнить(СтрокаТретьегоУровня);
						ТабДокумент.Вывести(ОбластьСтроки, 2, "ВторойУровень");
						
					КонецЦикла; // Третий уровень
					
				КонецЕсли;
				
			КонецЦикла; // Второй уровень 
			
			ТабДокумент.Вывести(ОбластиОтчета.ПустаяСтрока, 2, "ВторойУровень");
			
		КонецЦикла; // Первый уровень
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла; // Шапка
	
	ТабДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьОбластиОтчета()
	
	ОбластиОтчета = Новый Структура();
	
	МакетОтчета = ПолучитьМакет("МакетРезультатЗакупки");
	
	ОбластиОтчета.Вставить("Закупка", 			МакетОтчета.ПолучитьОбласть("Закупка"));
	ОбластиОтчета.Вставить("КонтрактыШапка", 	МакетОтчета.ПолучитьОбласть("КонтрактыШапка"));
	ОбластиОтчета.Вставить("КонтрактыСтроки", 	МакетОтчета.ПолучитьОбласть("КонтрактыСтроки"));
	ОбластиОтчета.Вставить("ПроектыШапка", 		МакетОтчета.ПолучитьОбласть("ПроектыШапка"));
	ОбластиОтчета.Вставить("ПроектыСтроки", 	МакетОтчета.ПолучитьОбласть("ПроектыСтроки"));
	ОбластиОтчета.Вставить("ПротоколыШапка", 	МакетОтчета.ПолучитьОбласть("ПротоколыШапка"));
	ОбластиОтчета.Вставить("ПротоколыСтроки", 	МакетОтчета.ПолучитьОбласть("ПротоколыСтроки"));
	
	ОбластиОтчета.Вставить("ОбъектыЗакупкиШапка", 		МакетОтчета.ПолучитьОбласть("ОбъектыЗакупкиШапка"));
	ОбластиОтчета.Вставить("ОбъектыЗакупкиСтроки", 		МакетОтчета.ПолучитьОбласть("ОбъектыЗакупкиСтроки"));
	ОбластиОтчета.Вставить("ПоставщикиШапка", 			МакетОтчета.ПолучитьОбласть("ПоставщикиШапка"));
	ОбластиОтчета.Вставить("ПоставщикиСтроки",		 	МакетОтчета.ПолучитьОбласть("ПоставщикиСтроки"));
	ОбластиОтчета.Вставить("УчастникиШапка", 			МакетОтчета.ПолучитьОбласть("УчастникиШапка"));
	ОбластиОтчета.Вставить("УчастникиСтроки", 			МакетОтчета.ПолучитьОбласть("УчастникиСтроки"));
	ОбластиОтчета.Вставить("ДокументыКонтрактаШапка",	МакетОтчета.ПолучитьОбласть("ДокументыКонтрактаШапка"));
	ОбластиОтчета.Вставить("ДокументыКонтрактаСтроки", 	МакетОтчета.ПолучитьОбласть("ДокументыКонтрактаСтроки"));
	ОбластиОтчета.Вставить("ДокументыПроектаШапка", 	МакетОтчета.ПолучитьОбласть("ДокументыПроектаШапка"));
	ОбластиОтчета.Вставить("ДокументыПроектаСтроки", 	МакетОтчета.ПолучитьОбласть("ДокументыПроектаСтроки"));
	ОбластиОтчета.Вставить("ДокументыПротоколаШапка", 	МакетОтчета.ПолучитьОбласть("ДокументыПротоколаШапка"));
	ОбластиОтчета.Вставить("ДокументыПротоколаСтроки", 	МакетОтчета.ПолучитьОбласть("ДокументыПротоколаСтроки"));
	
	ОбластиОтчета.Вставить("КодыОКВЭД2", МакетОтчета.ПолучитьОбласть("КодыОКВЭД2"));
	ОбластиОтчета.Вставить("КодыОКПД2",  МакетОтчета.ПолучитьОбласть("КодыОКПД2"));
	ОбластиОтчета.Вставить("КодыКТРУ", 	 МакетОтчета.ПолучитьОбласть("КодыКТРУ"));
	
	ОбластиОтчета.Вставить("ПричинаНесоответствия", МакетОтчета.ПолучитьОбласть("ПричинаНесоответствия"));
	ОбластиОтчета.Вставить("ПустаяСтрока",			МакетОтчета.ПолучитьОбласть("ПустаяСтрока"));
	
	Возврат ОбластиОтчета;
	
КонецФункции

Функция ДанныеДляПостроенияОтчета() 
	
	//1. Получение схемы компоновки данных
	ОсновнаяСхемаКД = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//2. Получение настроек компоновки данных
	НастройкиКД = КомпоновщикНастроек.ПолучитьНастройки();
	
	//3. Получение макета компоновки данных
	КомпоновщикМакетаКД = Новый КомпоновщикМакетаКомпоновкиДанных;    
	МакетКомпоновкиКД = КомпоновщикМакетаКД.Выполнить(ОсновнаяСхемаКД, НастройкиКД, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	//4. Компоновка данных
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(МакетКомпоновкиКД);
	
	//5. Вывод результата компоновки в результат.
	ДЗ = Новый ДеревоЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДЗ);
	ПроцессорВывода.Вывести(ПроцессорКД);

	Возврат ДЗ;
	
КонецФункции 

#КонецОбласти

#КонецЕсли