#Область ПрограммныйИнтерфейс

// Функция - конструктор процедуры ВзаиморасчетыЗаполнениеРасшифровкиПлатежа.ЗаполнитьРасшифровкуПлатежаПоЗаказуКлиента.
//
// Возвращаемое значение:
//	Структура - Структура параметров:
//		* Партнер          - СправочникСсылка.Партнеры - Партнер документа-инициатора.
//		* Договор          - СправочникСсылка.ДоговорыКонтрагентов - Договор объекта расчетов.
//		* ЗаказКлиента     - ДокументСсылка.ЗаказКлиента - Объект расчетов.
//		* ВалютаДокумента  - СправочникСсылка.Валюты - Валюта документа поступления денежных средств.
//		* ОснованиеПлатежа - ДокументСсылка - Документ-основание.
//
Функция ПараметрыЗаполненияРасшифровкиПлатежаПоЗаказу() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Партнер");
	Параметры.Вставить("Договор");
	Параметры.Вставить("ЗаказКлиента");
	Параметры.Вставить("ВалютаДокумента");
	Параметры.Вставить("ОснованиеПлатежа");
	Параметры.Вставить("СтатьяДвиженияДенежныхСредств");
	
	Возврат Параметры;
КонецФункции

// Процедура заполнения табличной части "РасшифровкаПлатежа" по заказу клиента.
//
// Параметры:
//	ПараметрыЗаполнения - См. ВзаиморасчетыЗаполнениеРасшифровкиПлатежа.ПараметрыЗаполненияРасшифровкиПлатежаПоЗаказу.
//	РасшифровкаПлатежа - ТабличнаяЧасть, ТаблицаЗначений - Табличная часть документа, выгрузка колонок табличной части по документу.
//	СуммаКОплате - Число - Сумма к оплате, если известна.
//	Организация - СправочникСсылка.Организации - Организация, осуществляющая продажу.
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - вид операции платежного документа.
//
Процедура ЗаполнитьРасшифровкуПлатежаПоЗаказуКлиента(ПараметрыЗаполнения, РасшифровкаПлатежа, СуммаКОплате = 0, Организация = Неопределено, ХозяйственнаяОперация = Неопределено) Экспорт
	
	ЗаказКлиента     = ПараметрыЗаполнения.ЗаказКлиента;
	Договор          = ПараметрыЗаполнения.Договор;
	ВалютаДокумента  = ПараметрыЗаполнения.ВалютаДокумента;
	Партнер          = ПараметрыЗаполнения.Партнер;
	ОснованиеПлатежа = ПараметрыЗаполнения.ОснованиеПлатежа;
	СтатьяДвиженияДенежныхСредств = ПараметрыЗаполнения.СтатьяДвиженияДенежныхСредств;

	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(ВалютаДокумента) Тогда
		
		ЭтоЗаказИлиЗаявка = ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента")
			Или ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента")
			Или (ТипЗнч(ЗаказКлиента) = Тип("Массив") 
				И (ТипЗнч(ЗаказКлиента[0]) = Тип("ДокументСсылка.ЗаказКлиента")
				Или ТипЗнч(ЗаказКлиента[0]) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента")));
		
		ЭтоЗаказ = ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента")
			ИЛИ ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента")
			ИЛИ ТипЗнч(ЗаказКлиента) = Тип("Массив");
			
		ИменаРеквизитов = "ПорядокРасчетов";
		ИменаРеквизитов = ИменаРеквизитов + ?(ЭтоЗаказИлиЗаявка, ",ЭтоЗаказКакСчет","");
		
		Если ТипЗнч(ЗаказКлиента) = Тип("Массив") Тогда
			СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаказКлиента[0], ИменаРеквизитов);
		Иначе
			СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаказКлиента, ИменаРеквизитов);
		КонецЕсли;
		
		ИспользоватьРасширенныеВозможностиЗаказаКлиента = ?(ЭтоЗаказИлиЗаявка,
			Не СтруктураРеквизитов.ЭтоЗаказКакСчет,
			ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента"));
		ПорядокРасчетов = СтруктураРеквизитов.ПорядокРасчетов;
		
		КолонкиТаблицыРасшифровкиПлатежа = Неопределено;
		
		Если ТипЗнч(РасшифровкаПлатежа) = Тип("ТаблицаЗначений") Тогда
			КолонкиТаблицыРасшифровкиПлатежа = РасшифровкаПлатежа.Колонки;
		Иначе
			КолонкиТаблицыРасшифровкиПлатежа = Метаданные.НайтиПоТипу(ТипЗнч(РасшифровкаПлатежа)).Реквизиты;
		КонецЕсли;
		
		Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
			ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным 
				И (ЭтоЗаказ ИЛИ ТипЗнч(ЗаказКлиента) = Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
			
			Если НЕ Константы.НоваяАрхитектураВзаиморасчетов.Получить() Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	РасчетыСКлиентами.ДатаПлатежа КАК Период,
			|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
			|	РасчетыСКлиентами.Валюта КАК Валюта,
			|	РасчетыСКлиентами.КОплате КАК КОплате,
			|	ДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ОбъектыРасчетов.Объект КАК Объект,
			|	ОбъектыРасчетов.Организация КАК Организация
			|ПОМЕСТИТЬ ВтРасчетыСКлиентами
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|			ПО ОбъектыРасчетов.Объект = ДоговорыКонтрагентов.Ссылка
			|		ПО РасчетыСКлиентами.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
			|			И НЕ ОбъектыРасчетов.ПометкаУдаления
			|ГДЕ
			|	РасчетыСКлиентами.Активность
			|	И РасчетыСКлиентами.Регистратор В(&ЗаказКлиента)
			|	И РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|	И РасчетыСКлиентами.КОплате > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыСКлиентами.Период КАК Период,
			|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
			|	РасчетыСКлиентами.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	Аналитика.Партнер КАК Партнер,
			|	РасчетыСКлиентами.Валюта КАК Валюта,
			|	РасчетыСКлиентами.Объект КАК Объект,
			|	РасчетыСКлиентами.Организация КАК Организация,
			|	СУММА(РасчетыСКлиентами.КОплате) КАК СуммаПоГрафику
			|ПОМЕСТИТЬ ТаблицаКОплате
			|ИЗ
			|	ВтРасчетыСКлиентами КАК РасчетыСКлиентами
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
			|		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
			|			И (&Организация = Аналитика.Организация
			|				ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыСКлиентами.Период,
			|	РасчетыСКлиентами.ОбъектРасчетов,
			|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
			|	РасчетыСКлиентами.Валюта,
			|	Аналитика.Партнер,
			|	РасчетыСКлиентами.СтатьяДвиженияДенежныхСредств,
			|	РасчетыСКлиентами.Объект,
			|	РасчетыСКлиентами.Организация
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ТекущаяДата,
			|	Аналитика.КлючАналитики,
			|	ОбъектыРасчетов.Ссылка,
			|	ДанныеДоговора.СтатьяДвиженияДенежныхСредств,
			|	ДанныеДоговора.Партнер,
			|	ДанныеДоговора.ВалютаВзаиморасчетов,
			|	ОбъектыРасчетов.Объект,
			|	ОбъектыРасчетов.Организация,
			|	0
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
			|		ПО ДанныеДоговора.Партнер = Аналитика.Партнер
			|			И ДанныеДоговора.Контрагент = Аналитика.Контрагент
			|			И ДанныеДоговора.Организация = Аналитика.Организация
			|			И ДанныеДоговора.Ссылка = Аналитика.Договор
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
			|			ПО ДанныеДоговора.Ссылка = ОбъектыРасчетов.Объект
			|				И НЕ ОбъектыРасчетов.ПометкаУдаления
			|ГДЕ
			|	ДанныеДоговора.Ссылка В(&ЗаказКлиента)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаКОплате.Партнер КАК Партнер,
			|	ТаблицаКОплате.Организация КАК Организация,
			|	ТаблицаКОплате.ОбъектРасчетов КАК ОбъектРасчетов,
			|	ТаблицаКОплате.Валюта КАК ВалютаВзаиморасчетов,
			|	ТаблицаКОплате.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ТаблицаКОплате.Объект КАК ОснованиеПлатежа
			|ИЗ
			|	ТаблицаКОплате КАК ТаблицаКОплате
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МИНИМУМ(ТаблицаКОплате.Период) КАК Период,
			|	ТаблицаКОплате.Объект КАК ОснованиеПлатежа,
			|	ТаблицаКОплате.ОбъектРасчетов КАК ОбъектРасчетов,
			|	ТаблицаКОплате.Организация КАК Организация,
			|	ТаблицаКОплате.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ТаблицаКОплате.Партнер КАК Партнер,
			|	ТаблицаКОплате.Валюта КАК ВалютаВзаиморасчетов,
			|	ВЫБОР
			|		КОГДА СУММА(ТаблицаКОплате.СуммаПоГрафику) > 0
			|				И СУММА(ТаблицаКОплате.СуммаПоГрафику) <= МАКСИМУМ(РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток)
			|			ТОГДА СУММА(ТаблицаКОплате.СуммаПоГрафику)
			|		ИНАЧЕ МАКСИМУМ(РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток)
			|	КОНЕЦ КАК СуммаПоГрафику,
			|	СУММА(0) КАК СуммаОплаты
			|ИЗ
			|	ТаблицаКОплате КАК ТаблицаКОплате
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки(
			|				,
			|				(АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта) В
			|					(ВЫБРАТЬ
			|						ТаблицаКОплате.АналитикаУчетаПоПартнерам,
			|						ТаблицаКОплате.ОбъектРасчетов,
			|						ТаблицаКОплате.Валюта
			|					ИЗ
			|						ТаблицаКОплате)) КАК РасчетыСКлиентамиОстатки
			|		ПО ТаблицаКОплате.АналитикаУчетаПоПартнерам = РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам
			|			И ТаблицаКОплате.ОбъектРасчетов = РасчетыСКлиентамиОстатки.ОбъектРасчетов
			|			И ТаблицаКОплате.Валюта = РасчетыСКлиентамиОстатки.Валюта
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаКОплате.ОбъектРасчетов,
			|	ТаблицаКОплате.СтатьяДвиженияДенежныхСредств,
			|	ТаблицаКОплате.Партнер,
			|	ТаблицаКОплате.Валюта,
			|	ТаблицаКОплате.Объект,
			|	ТаблицаКОплате.Организация
			|ИТОГИ ПО
			|	ОснованиеПлатежа";
			Иначе
				ТекстЗапроса = 
				"ВЫБРАТЬ
				|	РаспоряженияНаОтгрузку.Регистратор КАК Объект
				|ПОМЕСТИТЬ ВтОбъекты
				|ИЗ
				|	РегистрНакопления.РаспоряженияНаОтгрузкуИВозврат КАК РаспоряженияНаОтгрузку
				|ГДЕ
				|	РаспоряженияНаОтгрузку.Распоряжение В(&ЗаказКлиента)
				|	И РаспоряженияНаОтгрузку.Активность
				|	И РаспоряженияНаОтгрузку.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.Оформлено)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	&Договор
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
				|	ОбъектыРасчетов.ФормаОплаты КАК ФормаОплаты,
				|	ОбъектыРасчетов.Договор КАК Договор,
				|	ОбъектыРасчетов.Соглашение КАК Соглашение,
				|	ОбъектыРасчетов.Объект КАК Объект,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
				|			ТОГДА ВЫРАЗИТЬ(ОбъектыРасчетов.Соглашение КАК Справочник.СоглашенияСКлиентами).СтатьяДвиженияДенежныхСредств
				|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
				|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
				|	ОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
				|	ОбъектыРасчетов.Партнер КАК Партнер,
				|	ОбъектыРасчетов.Организация КАК Организация
				|ПОМЕСТИТЬ ВТОбъектыРасчетов
				|ИЗ
				|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
				|ГДЕ
				|	ОбъектыРасчетов.Объект В
				|			(ВЫБРАТЬ
				|				Т.Объект
				|			ИЗ
				|				ВтОбъекты КАК Т)
				|	И НЕ ОбъектыРасчетов.ПометкаУдаления
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
				|	ОбъектыРасчетов.ФормаОплаты КАК ФормаОплаты,
				|	ОбъектыРасчетов.Договор КАК Договор,
				|	ОбъектыРасчетов.Соглашение КАК Соглашение,
				|	ОбъектыРасчетов.Объект КАК Объект,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
				|			ТОГДА ВЫРАЗИТЬ(ОбъектыРасчетов.Соглашение КАК Справочник.СоглашенияСКлиентами).СтатьяДвиженияДенежныхСредств
				|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
				|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
				|	ОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
				|	ОбъектыРасчетов.Партнер КАК Партнер,
				|	ОбъектыРасчетов.Организация КАК Организация
				|ИЗ
				|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
				|ГДЕ
				|	ОбъектыРасчетов.Объект В (&ЗаказКлиента)
				|	И НЕ ОбъектыРасчетов.ПометкаУдаления
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ОбъектРасчетов
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ГрафикИсполненияДоговора.Ссылка КАК ДокументПлан
				|ПОМЕСТИТЬ ВтДокументыПлана
				|ИЗ
				|	Документ.ГрафикИсполненияДоговора КАК ГрафикИсполненияДоговора
				|ГДЕ
				|	ГрафикИсполненияДоговора.Договор = &Договор
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	РеестрДокументов.Ссылка
				|ИЗ
				|	РегистрСведений.РеестрДокументов КАК РеестрДокументов
				|ГДЕ
				|	РеестрДокументов.Ссылка В(&ЗаказКлиента)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТОбъектыРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
				|	ВТОбъектыРасчетов.Объект КАК ОснованиеПлатежа,
				|	ВТОбъектыРасчетов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
				|	ВТОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
				|	ВТОбъектыРасчетов.Партнер КАК Партнер,
				|	ВТОбъектыРасчетов.Организация КАК Организация
				|ИЗ
				|	ВТОбъектыРасчетов КАК ВТОбъектыРасчетов
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ОбъектыРасчетов.Объект КАК ОснованиеПлатежа,
				|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
				|	Аналитика.Организация КАК Организация,
				|	Аналитика.Партнер КАК Партнер,
				|	ОбъектыРасчетов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
				|	РасчетыСКлиентами.ДатаПлановогоПогашения КАК Период,
				|	РасчетыСКлиентами.Валюта КАК ВалютаВзаиморасчетов,
				|	ОбъектыРасчетов.ФормаОплаты КАК ФормаОплаты,
				|	РасчетыСКлиентами.КОплатеОстаток КАК СуммаПоГрафику,
				|	ЕСТЬNULL(РасчетыСКлиентамиОбороты.ОплачиваетсяОборот, 0) КАК СуммаОплаты
				|ИЗ
				|	РегистрНакопления.РасчетыСКлиентамиПланОплат.Остатки(
				|			,
				|			ОбъектРасчетов В
				|					(ВЫБРАТЬ
				|						ВтОбъектыРасчетов.ОбъектРасчетов
				|					ИЗ
				|						ВтОбъектыРасчетов)
				|				И (ТИПЗНАЧЕНИЯ(&ЗаказКлиента) = ТИП(Справочник.ДоговорыКонтрагентов)
				|					ИЛИ ДокументПлан В
				|						(ВЫБРАТЬ
				|							Т.ДокументПлан
				|						ИЗ
				|							ВтДокументыПлана КАК Т))) КАК РасчетыСКлиентами
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
				|		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
				|			И (&Организация = Аналитика.Организация
				|				ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыРасчетов КАК ОбъектыРасчетов
				|		ПО РасчетыСКлиентами.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Обороты(, , Период, ОбъектРасчетов В (ВЫБРАТЬ ОбъектРасчетов ИЗ ВтОбъектыРасчетов)) КАК РасчетыСКлиентамиОбороты
				|			ПО (РасчетыСКлиентамиОбороты.ОбъектРасчетов = РасчетыСКлиентами.ОбъектРасчетов)
				|				И (РасчетыСКлиентамиОбороты.Валюта = РасчетыСКлиентами.Валюта)
				|				И (РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ОбъектыРасчетов.Объект,
				|	РасчетыСКлиентами.ОбъектРасчетов,
				|	Аналитика.Организация,
				|	Аналитика.Партнер,
				|	ОбъектыРасчетов.СтатьяДвиженияДенежныхСредств,
				|	РасчетыСКлиентами.ДатаПлановогоПогашения,
				|	РасчетыСКлиентами.Валюта,
				|	ОбъектыРасчетов.ФормаОплаты,
				|	РасчетыСКлиентами.ДолгОстаток,
				|	ЕСТЬNULL(РасчетыСКлиентамиОбороты.ОплачиваетсяОборот, 0) КАК СуммаОплаты
				|ИЗ
				|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
				|			,
				|			ОбъектРасчетов В
				|				(ВЫБРАТЬ
				|					ВтОбъектыРасчетов.ОбъектРасчетов
				|				ИЗ
				|					ВтОбъектыРасчетов)) КАК РасчетыСКлиентами
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
				|		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
				|			И (&Организация = Аналитика.Организация
				|				ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыРасчетов КАК ОбъектыРасчетов
				|		ПО РасчетыСКлиентами.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Обороты(, , Период, ОбъектРасчетов В (ВЫБРАТЬ ОбъектРасчетов ИЗ ВтОбъектыРасчетов)) КАК РасчетыСКлиентамиОбороты
				|			ПО (РасчетыСКлиентамиОбороты.ОбъектРасчетов = РасчетыСКлиентами.ОбъектРасчетов)
				|				И (РасчетыСКлиентамиОбороты.Валюта = РасчетыСКлиентами.Валюта)
				|				И (РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам)
				|
				|УПОРЯДОЧИТЬ ПО
				|	РасчетыСКлиентами.ДатаПлановогоПогашения
				|ИТОГИ ПО
				|	ОбъектРасчетов"
			КонецЕсли;
			
		ИначеЕсли НЕ ИспользоватьРасширенныеВозможностиЗаказаКлиента
			И ЭтоЗаказ
			И ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным Тогда
			
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
			|	ОбъектыРасчетов.Организация КАК Организация,
			|	ОбъектыРасчетов.Партнер КАК Партнер,
			|	ОбъектыРасчетов.Объект КАК Объект,
			|	ОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
			|			ТОГДА ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств
			|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
			|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств
			|ПОМЕСТИТЬ ВТОбъектыРасчетов
			|ИЗ 
			|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
			|ГДЕ
			|	ОбъектыРасчетов.Объект В (&ЗаказКлиента)
			|	И НЕ ОбъектыРасчетов.ПометкаУдаления
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТОбъектыРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
			|	ВТОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
			|	ВТОбъектыРасчетов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ВТОбъектыРасчетов.Партнер КАК Партнер,
			|	ВТОбъектыРасчетов.Организация КАК Организация,
			|	ВТОбъектыРасчетов.Объект КАК ОснованиеПлатежа
			|ИЗ
			|	ВТОбъектыРасчетов КАК ВТОбъектыРасчетов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Заказ.Ссылка КАК ОснованиеПлатежа,
			|	ОбъектыРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
			|	ОбъектыРасчетов.Организация КАК Организация,
			|	ОбъектыРасчетов.Партнер КАК Партнер,
			|	Заказ.Соглашение КАК Соглашение,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(Заказ.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
			|			ТОГДА ВЫРАЗИТЬ(Заказ.Соглашение КАК Справочник.СоглашенияСКлиентами).СтатьяДвиженияДенежныхСредств
			|		ИНАЧЕ Заказ.Договор.СтатьяДвиженияДенежныхСредств
			|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
			|	ЭтапыОплатыЗаказа.ДатаПлатежа КАК Период,
			|	Заказ.Валюта КАК ВалютаВзаиморасчетов,
			|	Заказ.ФормаОплаты КАК ФормаОплаты,
			|	ЭтапыОплатыЗаказа.НомерСтроки КАК НомерСтроки,
			|	ЭтапыОплатыЗаказа.СуммаПлатежа + ЭтапыОплатыЗаказа.СуммаЗалогаЗаТару КАК СуммаПоГрафику,
			|	ЕСТЬNULL(РасчетыСКлиентамиОбороты.СуммаРасход, 0) КАК СуммаОплаты
			|ИЗ
			|	Документ.ЗаказКлиента КАК Заказ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЭтапыОплатыЗаказа
			|		ПО Заказ.Ссылка = ЭтапыОплатыЗаказа.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбъектыРасчетов КАК ОбъектыРасчетов
			|		ПО ОбъектыРасчетов.Объект = Заказ.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Обороты(, , , ОбъектРасчетов В (ВЫБРАТЬ ОбъектРасчетов ИЗ ВТОбъектыРасчетов)) КАК РасчетыСКлиентамиОбороты
			|		ПО ОбъектыРасчетов.ОбъектРасчетов = РасчетыСКлиентамиОбороты.ОбъектРасчетов
			|ГДЕ
			|	Заказ.Ссылка В(&ЗаказКлиента)
			|	И Заказ.ЭтоЗаказКакСчет
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаявкаНаВозвратТоваровОтКлиента.Ссылка,
			|	ОбъектыРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
			|	ОбъектыРасчетов.Организация КАК Организация,
			|	Аналитика.Партнер,
			|	ЗаявкаНаВозвратТоваровОтКлиента.Соглашение,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ЗаявкаНаВозвратТоваровОтКлиента.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
			|			ТОГДА ВЫРАЗИТЬ(ЗаявкаНаВозвратТоваровОтКлиента.Соглашение КАК Справочник.СоглашенияСКлиентами).СтатьяДвиженияДенежныхСредств
			|		ИНАЧЕ ЗаявкаНаВозвратТоваровОтКлиента.Договор.СтатьяДвиженияДенежныхСредств
			|	КОНЕЦ,
			|	ЗаявкаНаВозвратТоваровОтКлиентаЭтапыГрафикаОплаты.ДатаПлатежа,
			|	ЗаявкаНаВозвратТоваровОтКлиента.Валюта,
			|	ЗаявкаНаВозвратТоваровОтКлиента.ФормаОплаты,
			|	ЗаявкаНаВозвратТоваровОтКлиентаЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки,
			|	ЗаявкаНаВозвратТоваровОтКлиентаЭтапыГрафикаОплаты.СуммаПлатежа + ЗаявкаНаВозвратТоваровОтКлиентаЭтапыГрафикаОплаты.СуммаЗалогаЗаТару,
			|	ЕСТЬNULL(РасчетыСКлиентамиОбороты.СуммаРасход, 0)
			|ИЗ
			|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЭтапыГрафикаОплаты КАК ЗаявкаНаВозвратТоваровОтКлиентаЭтапыГрафикаОплаты
			|		ПО ЗаявкаНаВозвратТоваровОтКлиента.Ссылка = ЗаявкаНаВозвратТоваровОтКлиентаЭтапыГрафикаОплаты.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
			|		ПО ЗаявкаНаВозвратТоваровОтКлиента.Партнер = Аналитика.Партнер
			|			И ЗаявкаНаВозвратТоваровОтКлиента.Контрагент = Аналитика.Контрагент
			|			И ЗаявкаНаВозвратТоваровОтКлиента.Организация = Аналитика.Организация
			|			И ЗаявкаНаВозвратТоваровОтКлиента.Договор = Аналитика.Договор
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбъектыРасчетов КАК ОбъектыРасчетов
			|		ПО ОбъектыРасчетов.Объект = ЗаявкаНаВозвратТоваровОтКлиента.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Обороты(, , , ОбъектРасчетов В (ВЫБРАТЬ Объект ИЗ ВТОбъектыРасчетов)) КАК РасчетыСКлиентамиОбороты
			|		ПО ОбъектыРасчетов.ОбъектРасчетов = РасчетыСКлиентамиОбороты.ОбъектРасчетов
			|ГДЕ
			|	ЗаявкаНаВозвратТоваровОтКлиента.Ссылка В(&ЗаказКлиента)
			|	И ЗаявкаНаВозвратТоваровОтКлиента.ЭтоЗаказКакСчет
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки
			|ИТОГИ ПО
			|	ОснованиеПлатежа";
		Иначе
				
			Если НЕ Константы.НоваяАрхитектураВзаиморасчетов.Получить() Тогда
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
			|	ОбъектыРасчетов.Организация КАК Организация,
			|	ОбъектыРасчетов.Партнер КАК Партнер,
			|	ОбъектыРасчетов.Договор КАК Договор,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
			|			ТОГДА ВЫРАЗИТЬ(ОбъектыРасчетов.Соглашение КАК Справочник.СоглашенияСКлиентами).СтатьяДвиженияДенежныхСредств
			|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
			|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
			|	ОбъектыРасчетов.Объект КАК Объект,
			|	ОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
			|ПОМЕСТИТЬ ВТОбъектыРасчетов
			|ИЗ 
			|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
			|ГДЕ
			|	ОбъектыРасчетов.Объект В (&ЗаказКлиента)
			|	И НЕ ОбъектыРасчетов.ПометкаУдаления
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТОбъектыРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
			|	ВТОбъектыРасчетов.Организация КАК Организация,
			|	ВТОбъектыРасчетов.Партнер КАК Партнер,
			|	ВТОбъектыРасчетов.Договор КАК Договор,
			|	ВТОбъектыРасчетов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ВТОбъектыРасчетов.Объект КАК ОснованиеПлатежа,
			|	ВТОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
			|ИЗ
			|	ВТОбъектыРасчетов КАК ВТОбъектыРасчетов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОбъектыРасчетов.Объект КАК ОснованиеПлатежа,
			|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
			|	ОбъектыРасчетов.Организация КАК Организация,
			|	Аналитика.Партнер КАК Партнер,
			|	ОбъектыРасчетов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	РасчетыСКлиентами.ДатаПлатежа КАК Период,
			|	РасчетыСКлиентами.Валюта КАК ВалютаВзаиморасчетов,
			|	РасчетыСКлиентами.ФормаОплаты КАК ФормаОплаты,
			|	РасчетыСКлиентами.КОплате КАК СуммаПоГрафику,
			|	ЕСТЬNULL(РасчетыСКлиентамиОбороты.КОплатеРасход, 0) + ЕСТЬNULL(РасчетыСКлиентамиОбороты.ОплачиваетсяОборот, 0) КАК СуммаОплаты
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Обороты(, , Период, ) КАК РасчетыСКлиентамиОбороты
			|		ПО РасчетыСКлиентами.ОбъектРасчетов = РасчетыСКлиентамиОбороты.ОбъектРасчетов
			|			И РасчетыСКлиентами.Валюта = РасчетыСКлиентамиОбороты.Валюта
			|			И РасчетыСКлиентами.АналитикаУчетаПоПартнерам = РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
			|		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
			|			И (&Организация = Аналитика.Организация
			|				ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыРасчетов КАК ОбъектыРасчетов
			|		ПО РасчетыСКлиентами.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов
			|ГДЕ
			|	РасчетыСКлиентами.Активность
			|	И РасчетыСКлиентами.ОбъектРасчетов В(ВЫБРАТЬ ОбъектРасчетов ИЗ ВТОбъектыРасчетов)
			|	И РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|	И РасчетыСКлиентами.КОплате > 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	РасчетыСКлиентами.ДатаПлатежа,
			|	РасчетыСКлиентами.НомерСтроки
			|ИТОГИ ПО
			|	ОснованиеПлатежа";
			Иначе
			ТекстЗапроса = "
				|ВЫБРАТЬ
				|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
				|	ОбъектыРасчетов.ФормаОплаты КАК ФормаОплаты,
				|	ОбъектыРасчетов.Договор КАК Договор,
				|	ОбъектыРасчетов.Соглашение КАК Соглашение,
				|	ОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
				|	ОбъектыРасчетов.Объект КАК Объект,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
				|			ТОГДА ОбъектыРасчетов.Соглашение.СтатьяДвиженияДенежныхСредств
				|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
				|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
				|	ОбъектыРасчетов.Партнер КАК Партнер,
				|	ОбъектыРасчетов.Организация КАК Организация
				|ПОМЕСТИТЬ ВТОбъектыРасчетов
				|ИЗ 
				|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
				|ГДЕ
				|	ОбъектыРасчетов.Объект В (&ЗаказКлиента)
				|	И НЕ ОбъектыРасчетов.ПометкаУдаления
				|ИНДЕКСИРОВАТЬ ПО 
				|	ОбъектРасчетов
				|;
				|ВЫБРАТЬ
				|	ВложенныйЗапрос.ОбъектРасчетов            КАК ОбъектРасчетов,
				|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|	ВложенныйЗапрос.Период                    КАК Период,
				|	ВложенныйЗапрос.ВалютаВзаиморасчетов      КАК ВалютаВзаиморасчетов,
				|	СУММА(ВложенныйЗапрос.СуммаПоГрафику)     КАК СуммаПоГрафику
				|ПОМЕСТИТЬ ОстаткиКОплате
				|ИЗ (ВЫБРАТЬ
				|		РасчетыСКлиентами.ОбъектРасчетов            КАК ОбъектРасчетов,
				|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|		РасчетыСКлиентами.ДатаПлановогоПогашения    КАК Период,
				|		РасчетыСКлиентами.Валюта                    КАК ВалютаВзаиморасчетов,
				|		РасчетыСКлиентами.КОплатеОстаток            КАК СуммаПоГрафику
				|	ИЗ
				|		РегистрНакопления.РасчетыСКлиентамиПланОплат.Остатки(,ОбъектРасчетов В (ВЫБРАТЬ ОбъектРасчетов ИЗ ВтОбъектыРасчетов)) КАК РасчетыСКлиентами
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		РасчетыСКлиентами.ОбъектРасчетов            КАК ОбъектРасчетов,
				|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|		РасчетыСКлиентами.ДатаПлановогоПогашения    КАК Период,
				|		РасчетыСКлиентами.Валюта                    КАК ВалютаВзаиморасчетов,
				|		РасчетыСКлиентами.ДолгОстаток               КАК СуммаПоГрафику
				|	ИЗ
				|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(,ОбъектРасчетов В (ВЫБРАТЬ ОбъектРасчетов ИЗ ВтОбъектыРасчетов)) КАК РасчетыСКлиентами
				|	) КАК ВложенныйЗапрос
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.ОбъектРасчетов,
				|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
				|	ВложенныйЗапрос.Период,
				|	ВложенныйЗапрос.ВалютаВзаиморасчетов 
				|ИМЕЮЩИЕ 
				|	СУММА(ВложенныйЗапрос.СуммаПоГрафику) > 0 
				|;
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТОбъектыРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
				|	ВТОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
				|	ВТОбъектыРасчетов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
				|	ВТОбъектыРасчетов.Партнер КАК Партнер,
				|	ВТОбъектыРасчетов.Организация КАК Организация,
				|	ВТОбъектыРасчетов.Объект КАК ОснованиеПлатежа
				|ИЗ
				|	ВТОбъектыРасчетов КАК ВТОбъектыРасчетов
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РасчетыСКлиентами.ОбъектРасчетов            КАК ОбъектРасчетов,
				|	РасчетыСКлиентами.Период                    КАК Период,
				|	РасчетыСКлиентами.ВалютаВзаиморасчетов      КАК ВалютаВзаиморасчетов,
				|	РасчетыСКлиентами.СуммаПоГрафику            КАК СуммаПоГрафику,
				|
				|	ОбъектыРасчетов.Объект                      КАК ОснованиеПлатежа,
				|	ОбъектыРасчетов.ФормаОплаты                 КАК ФормаОплаты,
				|	ОбъектыРасчетов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
				|
				|	Аналитика.Организация                       КАК Организация,
				|	Аналитика.Партнер                           КАК Партнер,
				|	ЕСТЬNULL(РасчетыСКлиентамиОбороты.ОплачиваетсяОборот, 0) КАК СуммаОплаты
				|ИЗ
				|	ОстаткиКОплате КАК РасчетыСКлиентами
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
				|			ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
				|				И (&Организация = Аналитика.Организация
				|					ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыРасчетов КАК ОбъектыРасчетов
				|			ПО РасчетыСКлиентами.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Обороты(, , Период, ОбъектРасчетов В (ВЫБРАТЬ ОбъектРасчетов ИЗ ВтОбъектыРасчетов)) КАК РасчетыСКлиентамиОбороты
				|			ПО (РасчетыСКлиентамиОбороты.ОбъектРасчетов = РасчетыСКлиентами.ОбъектРасчетов)
				|				И (РасчетыСКлиентамиОбороты.Валюта = РасчетыСКлиентами.ВалютаВзаиморасчетов)
				|				И (РасчетыСКлиентамиОбороты.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам)
				|УПОРЯДОЧИТЬ ПО
				|	Период
				|ИТОГИ ПО
				|	ОбъектРасчетов";
			КонецЕсли;
			
		КонецЕсли;
		
		Запрос = Новый Запрос(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
		Запрос.УстановитьПараметр("ПоДоговорам", ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
												ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным);
		Запрос.УстановитьПараметр("Договор", Договор);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Если ХозяйственнаяОперация = Неопределено Тогда 
			СтатьяДДСПоХО = Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
		Иначе
			СтатьяДДСПоХО = Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(ХозяйственнаяОперация);
		КонецЕсли;
		
		Запросы = Запрос.ВыполнитьПакет();
		ВыборкаПоЗаказам = Запросы[Запросы.ВГраница()].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоЗаказам.Следующий() Цикл
			
			СуммаПоГрафикуВсего = 0;
			УчтеноСуммаОплаты = 0;
		
			Выборка = ВыборкаПоЗаказам.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				СуммаОплаты = ?(Выборка.СуммаОплаты < 0, 0, Выборка.СуммаОплаты);
				// Найдем первый неоплаченный этап.
				Если (Выборка.СуммаПоГрафику + СуммаПоГрафикуВсего) > СуммаОплаты Тогда
					
					НоваяСтрока = РасшифровкаПлатежа.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					
					Если КолонкиТаблицыРасшифровкиПлатежа.Найти("ОснованиеПлатежа") <> Неопределено Тогда
						
						НоваяСтрока.ОснованиеПлатежа = ОснованиеПлатежа;
						
						Если Не ЗначениеЗаполнено(НоваяСтрока.ОснованиеПлатежа) Тогда
							НоваяСтрока.ОснованиеПлатежа = Выборка.ОснованиеПлатежа;
						КонецЕсли;
					
					КонецЕсли;
					
					Если КолонкиТаблицыРасшифровкиПлатежа.Найти("Организация") <> Неопределено Тогда
						НоваяСтрока.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.ОбъектРасчетов, "Организация");
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(НоваяСтрока.СтатьяДвиженияДенежныхСредств) Тогда
						НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяДДСПоХО;
					Иначе
						
						Если ХозяйственнаяОперация <> Неопределено Тогда
							НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяДДСПоХО;
						КонецЕсли;
						
					КонецЕсли;
					
					НоваяСтрока.СуммаВзаиморасчетов = Выборка.СуммаПоГрафику + СуммаПоГрафикуВсего - (СуммаОплаты + УчтеноСуммаОплаты);
					
					Если СуммаКОплате <> 0 Тогда
						НоваяСтрока.СуммаВзаиморасчетов = Мин(НоваяСтрока.СуммаВзаиморасчетов, СуммаКОплате);
						СуммаКОплате = СуммаКОплате - НоваяСтрока.СуммаВзаиморасчетов;
						УчтеноСуммаОплаты = УчтеноСуммаОплаты + НоваяСтрока.СуммаВзаиморасчетов;
						СуммаПоГрафикуВсего = СуммаПоГрафикуВсего + Выборка.СуммаПоГрафику;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Договор) Тогда
						ДоговорРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВестиРасчетыЧерезКонечныхПокупателей, Партнер");
					КонецЕсли;
					
					Если ТипЗнч(ОснованиеПлатежа) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
						И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОснованиеПлатежа, "ХозяйственнаяОперация") = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера
						И ЗначениеЗаполнено(Договор) И ДоговорРеквизиты.ВестиРасчетыЧерезКонечныхПокупателей Тогда
						НоваяСтрока.ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(Договор,
							Организация,
							Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
						НоваяСтрока.Партнер = ДоговорРеквизиты.Партнер;
					КонецЕсли;
					
					НоваяСтрока.Сумма = РаботаСКурсамиВалютУТ.ПересчитатьВВалюту(
					                    	НоваяСтрока.СуммаВзаиморасчетов,
					                    	ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Выборка.Организация),
					                    	Выборка.ВалютаВзаиморасчетов,
					                    	ВалютаДокумента,
					                    	ТекущаяДатаСеанса(),
					                    	НоваяСтрока.ОбъектРасчетов);
					
					Если СуммаКОплате = 0 Тогда
						Прервать;
					КонецЕсли;
					
				Иначе
					
					Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда 
						
						НоваяСтрока = РасшифровкаПлатежа.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
						
						Если Не ЗначениеЗаполнено(НоваяСтрока.СтатьяДвиженияДенежныхСредств) Тогда
							НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяДДСПоХО;
						КонецЕсли;
						
						Если КолонкиТаблицыРасшифровкиПлатежа.Найти("Организация") <> Неопределено Тогда
							НоваяСтрока.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.ОбъектРасчетов, "Организация");
						КонецЕсли;
						
						НоваяСтрока.СуммаВзаиморасчетов = Выборка.СуммаПоГрафику;
						НоваяСтрока.Сумма = РаботаСКурсамиВалютУТ.ПересчитатьВВалюту(
						                    	НоваяСтрока.СуммаВзаиморасчетов,
						                    	ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(
						                    		?(КолонкиТаблицыРасшифровкиПлатежа.Найти("Организация") <> Неопределено, НоваяСтрока.Организация, Выборка.Организация)),
						                    	Выборка.ВалютаВзаиморасчетов,
						                    	ВалютаДокумента,
						                    	ТекущаяДатаСеанса(),
						                    	Выборка.ОбъектРасчетов);
					Иначе
						СуммаПоГрафикуВсего = СуммаПоГрафикуВсего + Выборка.СуммаПоГрафику;
					КонецЕсли;

				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если РасшифровкаПлатежа.Количество() = 0 Тогда
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			
			НоваяСтрока.Партнер = Партнер;
			НоваяСтрока.ВалютаВзаиморасчетов = ВалютаДокумента;
			НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
			
			ОбъектыРасчетов = Запросы[Запросы.ВГраница() - 1].Выгрузить();
			
			Если ЗначениеЗаполнено(Договор)
				И (ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
				ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным) Тогда
				
				Если КолонкиТаблицыРасшифровкиПлатежа.Найти("ОснованиеПлатежа") <> Неопределено Тогда
					НоваяСтрока.ОснованиеПлатежа = Договор;
				КонецЕсли;
				
				ДанныеОбъектаРасчетов = ОбъектыРасчетов.Найти(Договор, "ОснованиеПлатежа");
				
				Если ДанныеОбъектаРасчетов <> Неопределено Тогда
					
					НоваяСтрока.ОбъектРасчетов = ДанныеОбъектаРасчетов.ОбъектРасчетов;
					НоваяСтрока.ВалютаВзаиморасчетов = ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов;
					
					Если Не ЗначениеЗаполнено(НоваяСтрока.СтатьяДвиженияДенежныхСредств) Тогда
						НоваяСтрока.СтатьяДвиженияДенежныхСредств = ДанныеОбъектаРасчетов.СтатьяДвиженияДенежныхСредств;
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(НоваяСтрока.Партнер) Тогда
						НоваяСтрока.Партнер = ДанныеОбъектаРасчетов.Партнер;
					КонецЕсли;
					
					Если КолонкиТаблицыРасшифровкиПлатежа.Найти("Организация") <> Неопределено Тогда
						НоваяСтрока.Организация = ДанныеОбъектаРасчетов.Организация;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Если КолонкиТаблицыРасшифровкиПлатежа.Найти("ОснованиеПлатежа") <> Неопределено Тогда
					НоваяСтрока.ОснованиеПлатежа = ОснованиеПлатежа;
				КонецЕсли;
				
				Если ОбъектыРасчетов.Количество() > 0 Тогда
					
					НоваяСтрока.ОбъектРасчетов = ОбъектыРасчетов[0].ОбъектРасчетов;
					НоваяСтрока.ВалютаВзаиморасчетов = ОбъектыРасчетов[0].ВалютаВзаиморасчетов;
					
					Если КолонкиТаблицыРасшифровкиПлатежа.Найти("ОснованиеПлатежа") <> Неопределено
						И Не ЗначениеЗаполнено(НоваяСтрока.ОснованиеПлатежа) Тогда
						НоваяСтрока.ОснованиеПлатежа = ОбъектыРасчетов[0].ОснованиеПлатежа;
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(НоваяСтрока.СтатьяДвиженияДенежныхСредств) Тогда
						НоваяСтрока.СтатьяДвиженияДенежныхСредств = ОбъектыРасчетов[0].СтатьяДвиженияДенежныхСредств;
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(НоваяСтрока.Партнер) Тогда
						НоваяСтрока.Партнер = ОбъектыРасчетов[0].Партнер;
					КонецЕсли;
					
					Если КолонкиТаблицыРасшифровкиПлатежа.Найти("Организация") <> Неопределено Тогда
						НоваяСтрока.Организация = ОбъектыРасчетов[0].Организация;
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.СтатьяДвиженияДенежныхСредств) Тогда
				НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяДДСПоХО;
			КонецЕсли;
			
			Если КолонкиТаблицыРасшифровкиПлатежа.Найти("Организация") <> Неопределено 
				И Не ЗначениеЗаполнено(НоваяСтрока.Организация) Тогда
				НоваяСтрока.Организация = Организация;
			КонецЕсли;
			
		Иначе
			
			КолонкиГруппировки = "ОбъектРасчетов, СтатьяДвиженияДенежныхСредств, Партнер, ВалютаВзаиморасчетов, ДатаПогашения";
			
			Если КолонкиТаблицыРасшифровкиПлатежа.Найти("ОснованиеПлатежа") <> Неопределено Тогда
				КолонкиГруппировки = КолонкиГруппировки + ", ОснованиеПлатежа";
			КонецЕсли;
			
			Если КолонкиТаблицыРасшифровкиПлатежа.Найти("Организация") <> Неопределено Тогда
				КолонкиГруппировки = КолонкиГруппировки + ", Организация";
			КонецЕсли;
			
			РасшифровкаПлатежа.Свернуть(КолонкиГруппировки, "Сумма, СуммаВзаиморасчетов");
			
		КонецЕсли;
		
		ДенежныеСредстваСервер.ЗаполнитьНДСВРасшифровке(РасшифровкаПлатежа,
			ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(Организация, ТекущаяДатаСеанса(), ВалютаДокумента, РасшифровкаПлатежа.ВыгрузитьКолонку("ОбъектРасчетов"), Истина));
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполнения табличной части "РасшифровкаПлатежа" по счету на оплату.
//
// Параметры:
//	СчетНаОплату - ДокументСсылка.СчетНаОплатуКлиенту - Документ - основание.
//	Организация - СправочникСсылка.Организации - Документ - основание.
//	ЗаказКлиента - ДокументСсылка.ЗаказКлиента - Заказ.
//	ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа поступления денежных средств.
//	РасшифровкаПлатежа - ТабличнаяЧасть - Табличная часть документа.
//
Процедура ЗаполнитьРасшифровкуПлатежаПоСчетуНаОплату(СчетНаОплату, Организация, ЗаказКлиента, ВалютаДокумента, РасшифровкаПлатежа) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(ЗаказКлиента);
	
	// Заполнение табличной части "Расшифровка платежа"
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	РасчетыСКлиентами.СчетНаОплату,
	|	СУММА(
	|		ВЫБОР КОГДА РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
	|			РасчетыСКлиентами.Сумма
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|		) КАК СуммаОплаты
	|ПОМЕСТИТЬ ВтРасчетыПоСчету
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|ГДЕ
	|	РасчетыСКлиентами.Активность
	|	И РасчетыСКлиентами.СчетНаОплату = &СчетНаОплату
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентами.СчетНаОплату
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетНаОплату
	|;
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Расчеты.КОплатеОстаток - Расчеты.ОплачиваетсяОстаток), 0) КАК СуммаВзаиморасчетов
	|ПОМЕСТИТЬ ВтРасчеты
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСКлиентами.КОплатеОстаток      КАК КОплатеОстаток,
	|		0                                     КАК ОплачиваетсяОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПланОплат.Остатки(,ОбъектРасчетов = &ОбъектРасчетов) КАК РасчетыСКлиентами
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентами.ДолгОстаток         КАК КОплатеОстаток,
	|		0                                     КАК ОплачиваетсяОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(,ОбъектРасчетов = &ОбъектРасчетов) КАК РасчетыСКлиентами
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0                                     КАК КОплатеОстаток,
	|		РасчетыСКлиентами.ОплачиваетсяОстаток КАК ОплачиваетсяОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентами.Остатки(,ОбъектРасчетов = &ОбъектРасчетов) КАК РасчетыСКлиентами) КАК Расчеты
	|;
	|
	|ВЫБРАТЬ
	|	СчетНаОплатуКлиенту.Ссылка КАК ОснованиеПлатежа,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
	|	ОбъектыРасчетов.Организация КАК Организация,
	|	СчетНаОплатуКлиенту.ДокументОснование.Партнер КАК Партнер,
	|	СчетНаОплатуКлиенту.ДокументОснование.Соглашение КАК Соглашение,
	|	
	|	ВЫБОР КОГДА СчетНаОплатуКлиенту.Договор.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов) ТОГДА
	|		СчетНаОплатуКлиенту.Договор.СтатьяДвиженияДенежныхСредств
	|	ИНАЧЕ
	|		ВЫБОР КОГДА ЕСТЬNULL(СчетНаОплатуКлиенту.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) ТОГДА
	|			ВЫРАЗИТЬ(СчетНаОплатуКлиенту.ДокументОснование.Соглашение КАК Справочник.СоглашенияСКлиентами).СтатьяДвиженияДенежныхСредств
	|		ИНАЧЕ
	|			СчетНаОплатуКлиенту.Договор.СтатьяДвиженияДенежныхСредств
	|		КОНЕЦ
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	
	|	ЕСТЬNULL(ОбъектыРасчетов.ВалютаВзаиморасчетов,
	|		ЕСТЬNULL(
	|			СчетНаОплатуКлиенту.ДокументОснование.ВалютаВзаиморасчетов, 
	|			СчетНаОплатуКлиенту.ДокументОснование.Валюта)
	|	) КАК ВалютаВзаиморасчетов,
	|	СчетНаОплатуКлиенту.Валюта КАК ВалютаСчета,
	|
	|	СчетНаОплатуКлиенту.СуммаДокумента КАК СуммаСчета,
	|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.СуммаВзаиморасчетов, 0) КАК СуммаВзаиморасчетов,
	|	ЕСТЬNULL(РасчетыСКлиентами.СуммаОплаты, 0) КАК СуммаОплатыПоСчету,
	|
	|	СчетНаОплатуКлиенту.ДокументОснование ССЫЛКА Справочник.ДоговорыКонтрагентов
	|		ИЛИ ЕСТЬNULL(СчетНаОплатуКлиенту.Договор.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов), ЛОЖЬ) КАК ОплатаПоДоговору
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтРасчетыПоСчету КАК РасчетыСКлиентами
	|	ПО
	|		СчетНаОплатуКлиенту.Ссылка = РасчетыСКлиентами.СчетНаОплату
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтРасчеты КАК РасчетыСКлиентамиОстатки
	|	ПО
	|		ИСТИНА
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ВЫБОР КОГДА СчетНаОплатуКлиенту.Договор.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов) 
	|			ТОГДА СчетНаОплатуКлиенту.Договор
	|			ИНАЧЕ СчетНаОплатуКлиенту.ДокументОснование
	|		КОНЕЦ = ОбъектыРасчетов.Объект
	|		И ОбъектыРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|		И НЕ ОбъектыРасчетов.ПометкаУдаления
	|		
	|ГДЕ
	|	СчетНаОплатуКлиенту.Ссылка = &СчетНаОплату
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СчетНаОплату", СчетНаОплату);
	Запрос.УстановитьПараметр("ОбъектРасчетов", ОбъектРасчетов);
	
	СтатьяДДСПоХО = Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если Не ЗначениеЗаполнено(НоваяСтрока.СтатьяДвиженияДенежныхСредств) Тогда
			НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяДДСПоХО;
		КонецЕсли;
		
		// Счет может быть выставлен не в валюте взаииморасчетов,
		// поэтому нужно пересчитать его сумму в валюту взаиморасчетов,
		// чтобы сравнить с оплатами по счету и остатками расчетов
		СуммаСчетаВВалютеВзаиморасчетов = Выборка.СуммаСчета;
		Если Выборка.ВалютаСчета <> Выборка.ВалютаВзаиморасчетов Тогда
			СуммаСчетаВВалютеВзаиморасчетов = РаботаСКурсамиВалютУТ.ПересчитатьВВалюту(
			                                  	Выборка.СуммаСчета,
			                                  	ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Выборка.Организация),
			                                  	Выборка.ВалютаСчета,
			                                  	Выборка.ВалютаВзаиморасчетов,
			                                  	ТекущаяДатаСеанса(),
			                                  	ОбъектРасчетов);
		КонецЕсли;
		Если Выборка.ОплатаПоДоговору Тогда
			СуммаВзаиморасчетов = СуммаСчетаВВалютеВзаиморасчетов - Выборка.СуммаОплатыПоСчету;
		ИначеЕсли Выборка.СуммаВзаиморасчетов < СуммаСчетаВВалютеВзаиморасчетов Тогда
			СуммаВзаиморасчетов = Выборка.СуммаВзаиморасчетов;
		ИначеЕсли СуммаСчетаВВалютеВзаиморасчетов > Выборка.СуммаОплатыПоСчету Тогда
			СуммаВзаиморасчетов = СуммаСчетаВВалютеВзаиморасчетов - Выборка.СуммаОплатыПоСчету;
		Иначе
			СуммаВзаиморасчетов = 0;
		КонецЕсли;
		НоваяСтрока.СуммаВзаиморасчетов = СуммаВзаиморасчетов;
		
		Если СуммаВзаиморасчетов = СуммаСчетаВВалютеВзаиморасчетов
			И ВалютаДокумента = Выборка.ВалютаСчета Тогда
			НоваяСтрока.Сумма = Выборка.СуммаСчета;
		ИначеЕсли ВалютаДокумента = Выборка.ВалютаВзаиморасчетов Тогда
			НоваяСтрока.Сумма = СуммаВзаиморасчетов;
		Иначе
			НоваяСтрока.Сумма = РаботаСКурсамиВалютУТ.ПересчитатьВВалюту(
			                    	СуммаВзаиморасчетов,
			                    	ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Выборка.Организация),
			                    	Выборка.ВалютаВзаиморасчетов,
			                    	ВалютаДокумента,
			                    	ТекущаяДатаСеанса(),
			                    	ОбъектРасчетов);
		КонецЕсли;
	КонецЕсли;
	
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.СчетНаОплату = СчетНаОплату;
	КонецЕсли;
	
	ДенежныеСредстваСервер.ЗаполнитьНДСВРасшифровке(РасшифровкаПлатежа,
		ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(Организация, ТекущаяДатаСеанса(), ВалютаДокумента, ОбъектРасчетов, Истина));
	
КонецПроцедуры

// Процедура заполнения табличной части "РасшифровкаПлатежа" по возврату товаров от клиента.
//
// Параметры:
//	Объекты - ДокументСсылка, Массив из ДокументСсылка - Документ основание.
//	Организация - СправочникСсылка.Организации - Организация документа.
//	ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа поступления денежных средств.
//	СуммаДокумента - Число - Сумма документа - основания.
//	Партнер - СправочникСсылка.Партнеры - Партнер документа - основания.
//	РасшифровкаПлатежа - ТабличнаяЧасть - Табличная часть документа.
//
Процедура ЗаполнитьРасшифровкуПлатежаПоВозвратуТоваровОтКлиента(Объекты, Организация, ВалютаДокумента, СуммаДокумента, Партнер, РасшифровкаПлатежа) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ВалютаДокумента) Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ОбъектыРасчетов.Объект КАК Объект,
		|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
		|	ОбъектыРасчетов.Организация КАК Организация
		|ПОМЕСТИТЬ ВТОбъектыРасчетов
		|ИЗ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|ГДЕ
		|	ОбъектыРасчетов.Объект В (&Объекты)
		|	И НЕ ОбъектыРасчетов.ПометкаУдаления
		|;
		|ВЫБРАТЬ
		|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ОбъектыРасчетов.Организация КАК Организация,
		|	РасчетыСКлиентами.Валюта КАК ВалютаВзаиморасчетов,
		|	(-РасчетыСКлиентами.КОплатеОстаток) КАК СуммаВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(,
		|		ОбъектРасчетов В (ВЫБРАТЬ ОбъектРасчетов ИЗ ВТОбъектыРасчетов)
		|	) КАК РасчетыСКлиентами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыРасчетов КАК ОбъектыРасчетов
		|		ПО РасчетыСКлиентами.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов
		|ГДЕ
		|	РасчетыСКлиентами.КОплатеОстаток < 0
		|УПОРЯДОЧИТЬ ПО
		|	ВЫБОР КОГДА ОбъектыРасчетов.Объект ССЫЛКА Документ.ВозвратТоваровОтКлиента ТОГДА
		|		1
		|	ИНАЧЕ
		|		2
		|	КОНЕЦ
		|");
		
		Запрос.УстановитьПараметр("Объекты", Объекты);
		
		СтатьяДДСПоХО = Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(
			Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Партнер = Партнер;
			НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяДДСПоХО;
			
			Сумма = РаботаСКурсамиВалютУТ.ПересчитатьВВалюту(
			        	НоваяСтрока.СуммаВзаиморасчетов,
			        	ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Выборка.Организация),
			        	Выборка.ВалютаВзаиморасчетов,
			        	ВалютаДокумента,
			        	ТекущаяДатаСеанса(),
			        	Выборка.ОбъектРасчетов);
			
			Если Сумма <= СуммаДокумента Тогда
				НоваяСтрока.Сумма = Сумма;
			Иначе
				НоваяСтрока.Сумма = СуммаДокумента;
				НоваяСтрока.СуммаВзаиморасчетов = 0;
			КонецЕсли;
		Иначе
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			НоваяСтрока.Партнер = Партнер;
			НоваяСтрока.Сумма = СуммаДокумента;
		КонецЕсли;
		
		ДенежныеСредстваСервер.ЗаполнитьНДСВРасшифровке(РасшифровкаПлатежа,
			ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(Организация, ТекущаяДатаСеанса(), ВалютаДокумента, РасшифровкаПлатежа.ВыгрузитьКолонку("ОбъектРасчетов"), Ложь));
	КонецЕсли;
КонецПроцедуры

// Процедура заполнения табличной части "РасшифровкаПлатежа" по заказу поставщику.
//
// Параметры:
//	ЗаказПоставщику - ДокументСсылка.ЗаказПоставщику - Документ - основание.
//	Договор - СправочникСсылка.ДоговорыКонтрагентов - Договор для заполнения.
//	ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа поступления денежных средств.
//	СуммаКОплате - Число - Сумма к оплате поставщику.
//	РасшифровкаПлатежа - ТабличнаяЧасть - Табличная часть документа.
//	ЖелательнаяДатаПлатежа - Дата - Дата платежа по графику.
//  Организация - СправочникСсылка.Организации - Организация, осуществляющая закупку.
//
Процедура ЗаполнитьРасшифровкуПлатежаПоЗаказуПоставщику(ЗаказПоставщику, Договор, ВалютаДокумента, Знач СуммаКОплате, РасшифровкаПлатежа, ЖелательнаяДатаПлатежа = Неопределено, Организация = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ВалютаДокумента) Тогда
		
		Если ТипЗнч(ЗаказПоставщику) = Тип("Массив") Тогда
			ПорядокРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказПоставщику[0], "ПорядокРасчетов");
		Иначе
			ПорядокРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказПоставщику, "ПорядокРасчетов");
		КонецЕсли;
		
		Если (ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
			ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным)
			И ТипЗнч(ЗаказПоставщику) <> Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			Если НЕ Константы.НоваяАрхитектураВзаиморасчетов.Получить() Тогда
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА РасчетыСПоставщиками.ДатаПлатежа < &ТекущаяДата
			|			ТОГДА &ТекущаяДата
			|		ИНАЧЕ РасчетыСПоставщиками.ДатаПлатежа
			|	КОНЕЦ                                          КАК Период,
			|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСПоставщиками.ОбъектРасчетов            КАК ОбъектРасчетов,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(РасчетыСПоставщиками.ОбъектРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
			|			ТОГДА ВЫРАЗИТЬ(РасчетыСПоставщиками.ОбъектРасчетов.Соглашение КАК Справочник.СоглашенияСПоставщиками).СтатьяДвиженияДенежныхСредств
			|		ИНАЧЕ РасчетыСПоставщиками.ОбъектРасчетов.Договор.СтатьяДвиженияДенежныхСредств
			|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
			|	Аналитика.Партнер							   КАК Партнер,
			|	РасчетыСПоставщиками.Валюта					   КАК Валюта,
			|	СУММА(РасчетыСПоставщиками.КОплате)			   КАК СуммаПоГрафику
			|ПОМЕСТИТЬ ТаблицаКОплате
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
			|		ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
			|		И (&Организация = Аналитика.Организация
			|			ИЛИ &Организация = Неопределено)
			|ГДЕ
			|	РасчетыСПоставщиками.Активность
			|	И РасчетыСПоставщиками.Регистратор В (&ЗаказПоставщику)
			|	И (РасчетыСПоставщиками.ОбъектРасчетов.ТипОбъектаРасчетов <> ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Договор)
			|		ИЛИ &ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамНакладным))
			|	И РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	И РасчетыСПоставщиками.КОплате > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ВЫБОР
			|		КОГДА РасчетыСПоставщиками.ДатаПлатежа < &ТекущаяДата
			|			ТОГДА &ТекущаяДата
			|		ИНАЧЕ РасчетыСПоставщиками.ДатаПлатежа
			|	КОНЕЦ,
			|	РасчетыСПоставщиками.ОбъектРасчетов,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(РасчетыСПоставщиками.ОбъектРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
			|			ТОГДА ВЫРАЗИТЬ(РасчетыСПоставщиками.ОбъектРасчетов.Соглашение КАК Справочник.СоглашенияСПоставщиками).СтатьяДвиженияДенежныхСредств
			|		ИНАЧЕ РасчетыСПоставщиками.ОбъектРасчетов.Договор.СтатьяДвиженияДенежныхСредств
			|	КОНЕЦ,
			|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам,
			|	РасчетыСПоставщиками.Валюта,
			|	Аналитика.Партнер
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ТекущаяДата КАК Период,
			|	Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
			|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
			|	ДанныеДоговора.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ДанныеДоговора.Партнер КАК Партнер,
			|	ДанныеДоговора.ВалютаВзаиморасчетов КАК Валюта,
			|	0 КАК СуммаПоГрафику
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
			|		ПО ДанныеДоговора.Партнер = Аналитика.Партнер
			|			И ДанныеДоговора.Контрагент = Аналитика.Контрагент
			|			И ДанныеДоговора.Организация = Аналитика.Организация
			|			И ДанныеДоговора.Ссылка = Аналитика.Договор
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
			|			ПО ДанныеДоговора.Ссылка = ОбъектыРасчетов.Объект
			|				И НЕ ОбъектыРасчетов.ПометкаУдаления
			|ГДЕ
			|	ДанныеДоговора.Ссылка В (&ЗаказПоставщику)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МИНИМУМ(ТаблицаКОплате.Период) КАК Период,
			|	ТаблицаКОплате.ОбъектРасчетов  КАК ОбъектРасчетов,
			|	ТаблицаКОплате.ОбъектРасчетов.Организация  КАК Организация,
			|	ТаблицаКОплате.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ТаблицаКОплате.Партнер		   КАК Партнер,
			|	ТаблицаКОплате.Валюта		   КАК ВалютаВзаиморасчетов,
			|
			|	ВЫБОР
			|		КОГДА СУММА(ТаблицаКОплате.СуммаПоГрафику) > 0 И СУММА(ТаблицаКОплате.СуммаПоГрафику) <=
			|				МАКСИМУМ(РасчетыСПоставщикамиОстатки.ОплачиваетсяОстаток-РасчетыСПоставщикамиОстатки.КОплатеОстаток)
			|			ТОГДА СУММА(ТаблицаКОплате.СуммаПоГрафику)
			|		ИНАЧЕ МАКСИМУМ(РасчетыСПоставщикамиОстатки.ОплачиваетсяОстаток-РасчетыСПоставщикамиОстатки.КОплатеОстаток)
			|	КОНЕЦ КАК СуммаПоГрафику,
			|	СУММА(0) КАК СуммаОплаты
			|
			|ИЗ
			|	ТаблицаКОплате КАК ТаблицаКОплате
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Остатки(
			|				,
			|				(АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта) В
			|					(ВЫБРАТЬ
			|						ТаблицаКОплате.АналитикаУчетаПоПартнерам,
			|						ТаблицаКОплате.ОбъектРасчетов,
			|						ТаблицаКОплате.Валюта
			|					ИЗ
			|						ТаблицаКОплате)) КАК РасчетыСПоставщикамиОстатки
			|		ПО ТаблицаКОплате.АналитикаУчетаПоПартнерам = РасчетыСПоставщикамиОстатки.АналитикаУчетаПоПартнерам
			|			И ТаблицаКОплате.ОбъектРасчетов = РасчетыСПоставщикамиОстатки.ОбъектРасчетов
			|			И ТаблицаКОплате.Валюта = РасчетыСПоставщикамиОстатки.Валюта
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаКОплате.ОбъектРасчетов,
			|	ТаблицаКОплате.СтатьяДвиженияДенежныхСредств,
			|	ТаблицаКОплате.Партнер,
			|	ТаблицаКОплате.Валюта
			|
			|ИТОГИ ПО
			|	ТаблицаКОплате.ОбъектРасчетов
			|";
			Иначе
				ТекстЗапроса = 
				"ВЫБРАТЬ
				|	ЗаказыПоставщикам.Регистратор КАК Объект
				|ПОМЕСТИТЬ ВтОбъекты
				|ИЗ
				|	РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам
				|ГДЕ
				|	ЗаказыПоставщикам.ЗаказПоставщику В(&ЗаказПоставщику)
				|	И ЗаказыПоставщикам.Активность
				|	И ЗаказыПоставщикам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	&Договор
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
				|	ОбъектыРасчетов.ФормаОплаты КАК ФормаОплаты,
				|	ОбъектыРасчетов.Договор КАК Договор,
				|	ОбъектыРасчетов.Соглашение КАК Соглашение
				|ПОМЕСТИТЬ ВТОбъектыРасчетов
				|ИЗ
				|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
				|ГДЕ
				|	ОбъектыРасчетов.Объект В
				|			(ВЫБРАТЬ
				|				Т.Объект
				|			ИЗ
				|				ВтОбъекты КАК Т)
				|	И НЕ ОбъектыРасчетов.ПометкаУдаления
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
				|	ОбъектыРасчетов.ФормаОплаты КАК ФормаОплаты,
				|	ОбъектыРасчетов.Договор КАК Договор,
				|	ОбъектыРасчетов.Соглашение КАК Соглашение
				|ИЗ
				|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
				|ГДЕ
				|	ОбъектыРасчетов.Объект В (&ЗаказПоставщику)
				|	И НЕ ОбъектыРасчетов.ПометкаУдаления
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ОбъектРасчетов
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ГрафикИсполненияДоговора.Ссылка КАК ДокументПлан
				|ПОМЕСТИТЬ ВтДокументыПлана
				|ИЗ
				|	Документ.ГрафикИсполненияДоговора КАК ГрафикИсполненияДоговора
				|ГДЕ
				|	ГрафикИсполненияДоговора.Договор = &Договор
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	РеестрДокументов.Ссылка
				|ИЗ
				|	РегистрСведений.РеестрДокументов КАК РеестрДокументов
				|ГДЕ
				|	РеестрДокументов.Ссылка В(&ЗаказПоставщику)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РасчетыСПоставщикамиОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|	РасчетыСПоставщикамиОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
				|	РасчетыСПоставщикамиОбороты.Валюта КАК Валюта,
				|	-РасчетыСПоставщикамиОбороты.ОплачиваетсяОборот КАК СуммаОплаты
				|ПОМЕСТИТЬ ПодготовленоКОплате
				|ИЗ
				|	РегистрНакопления.РасчетыСПоставщиками.Обороты(
				|			,
				|			,
				|			Период,
				|			ОбъектРасчетов В
				|				(ВЫБРАТЬ
				|					ВтОбъектыРасчетов.ОбъектРасчетов
				|				ИЗ
				|					ВтОбъектыРасчетов)) КАК РасчетыСПоставщикамиОбороты
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РасчетыСПоставщиками.ОбъектРасчетов            КАК ОбъектРасчетов,
				|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|	Аналитика.Партнер                              КАК Партнер,
				|	Аналитика.Организация                          КАК Организация,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
				|			ТОГДА ВЫРАЗИТЬ(ОбъектыРасчетов.Соглашение КАК Справочник.СоглашенияСПоставщиками).СтатьяДвиженияДенежныхСредств
				|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
				|	КОНЕЦ                                          КАК СтатьяДвиженияДенежныхСредств,
				|	ВЫБОР
				|		КОГДА РасчетыСПоставщиками.ДатаПлановогоПогашения < &ТекущаяДата
				|			ТОГДА &ТекущаяДата
				|		ИНАЧЕ РасчетыСПоставщиками.ДатаПлановогоПогашения
				|	КОНЕЦ                                          КАК Период,
				|	РасчетыСПоставщиками.Валюта                    КАК ВалютаВзаиморасчетов,
				|	ОбъектыРасчетов.ФормаОплаты                    КАК ФормаОплаты,
				|	РасчетыСПоставщиками.КОплатеОстаток            КАК СуммаПоГрафику
				|ПОМЕСТИТЬ ОстаткиКОплате
				|ИЗ
				|	РегистрНакопления.РасчетыСПоставщикамиПланОплат.Остатки(
				|			,
				|			ОбъектРасчетов В
				|					(ВЫБРАТЬ
				|						ОбъектРасчетов 
				|					ИЗ 
				|						ВтОбъектыРасчетов)
				|				И ДокументПлан В
				|						(ВЫБРАТЬ
				|							Т.ДокументПлан
				|						ИЗ
				|							ВтДокументыПлана КАК Т)) КАК РасчетыСПоставщиками
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
				|			ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
				|				И (&Организация = Аналитика.Организация
				|					ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
				|			ПО РасчетыСПоставщиками.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	РасчетыСПоставщиками.ОбъектРасчетов            КАК ОбъектРасчетов,
				|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|	Аналитика.Партнер                              КАК Партнер,
				|	Аналитика.Организация                          КАК Организация,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
				|			ТОГДА ВЫРАЗИТЬ(ОбъектыРасчетов.Соглашение КАК Справочник.СоглашенияСПоставщиками).СтатьяДвиженияДенежныхСредств
				|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
				|	КОНЕЦ                                          КАК СтатьяДвиженияДенежныхСредств,
				|	ВЫБОР
				|		КОГДА РасчетыСПоставщиками.ДатаПлановогоПогашения < &ТекущаяДата
				|			ТОГДА &ТекущаяДата
				|		ИНАЧЕ РасчетыСПоставщиками.ДатаПлановогоПогашения
				|	КОНЕЦ                                          КАК Период,
				|	РасчетыСПоставщиками.Валюта                    КАК ВалютаВзаиморасчетов,
				|	ОбъектыРасчетов.ФормаОплаты                    КАК ФормаОплаты,
				|	РасчетыСПоставщиками.ДолгОстаток               КАК СуммаПоГрафику
				|ИЗ
				|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(,ОбъектРасчетов В (ВЫБРАТЬ ОбъектРасчетов ИЗ ВтОбъектыРасчетов)) КАК РасчетыСПоставщиками
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
				|			ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
				|				И (&Организация = Аналитика.Организация
				|					ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
				|			ПО РасчетыСПоставщиками.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВложенныйЗапрос.ОбъектРасчетов КАК ОбъектРасчетов,
				|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|	ВложенныйЗапрос.Партнер КАК Партнер,
				|	ВложенныйЗапрос.Организация КАК Организация,
				|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
				|	ВложенныйЗапрос.Период КАК Период,
				|	ВложенныйЗапрос.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
				|	ВложенныйЗапрос.ФормаОплаты КАК ФормаОплаты,
				|	ВложенныйЗапрос.СуммаПоГрафику КАК СуммаПоГрафику,
				|	ЕСТЬNULL(ПодготовленоКОплате.СуммаОплаты, 0) КАК СуммаОплаты
				|ИЗ
				|	(ВЫБРАТЬ
				|		ОстаткиКОплате.ОбъектРасчетов КАК ОбъектРасчетов,
				|		ОстаткиКОплате.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|		ОстаткиКОплате.Партнер КАК Партнер,
				|		ОстаткиКОплате.Организация КАК Организация,
				|		ОстаткиКОплате.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
				|		ОстаткиКОплате.Период КАК Период,
				|		ОстаткиКОплате.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
				|		ОстаткиКОплате.ФормаОплаты КАК ФормаОплаты,
				|		СУММА(ОстаткиКОплате.СуммаПоГрафику) КАК СуммаПоГрафику
				|	ИЗ
				|		ОстаткиКОплате КАК ОстаткиКОплате
				|	
				|	СГРУППИРОВАТЬ ПО
				|		ОстаткиКОплате.ОбъектРасчетов,
				|		ОстаткиКОплате.АналитикаУчетаПоПартнерам,
				|		ОстаткиКОплате.Партнер,
				|		ОстаткиКОплате.Организация,
				|		ОстаткиКОплате.СтатьяДвиженияДенежныхСредств,
				|		ОстаткиКОплате.Период,
				|		ОстаткиКОплате.ВалютаВзаиморасчетов,
				|		ОстаткиКОплате.ФормаОплаты) КАК ВложенныйЗапрос
				|		ЛЕВОЕ СОЕДИНЕНИЕ ПодготовленоКОплате КАК ПодготовленоКОплате
				|		ПО (ВложенныйЗапрос.ОбъектРасчетов = ПодготовленоКОплате.ОбъектРасчетов
				|				И ВложенныйЗапрос.АналитикаУчетаПоПартнерам = ПодготовленоКОплате.АналитикаУчетаПоПартнерам
				|				И ВложенныйЗапрос.ВалютаВзаиморасчетов = ПодготовленоКОплате.Валюта)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Период
				|ИТОГИ ПО
				|	ОбъектРасчетов
				|";
			КонецЕсли;
			
		Иначе
			
			Если НЕ Константы.НоваяАрхитектураВзаиморасчетов.Получить() Тогда
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
			|	ОбъектыРасчетов.Объект КАК Объект,
			|	ВЫБОР
			|		КОГДА
			|			ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств,ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
			|			ТОГДА ВЫРАЗИТЬ(ОбъектыРасчетов.Соглашение КАК Справочник.СоглашенияСПоставщиками).СтатьяДвиженияДенежныхСредств
			|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
			|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств
			|ПОМЕСТИТЬ ВТОбъектыРасчетов
			|ИЗ 
			|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
			|ГДЕ
			|	ОбъектыРасчетов.Объект В (&ЗаказПоставщику)
			|	И НЕ ОбъектыРасчетов.ПометкаУдаления
			|; 
			|ВЫБРАТЬ
			|	РасчетыСПоставщиками.ОбъектРасчетов КАК ОбъектРасчетов,
			|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	Аналитика.Партнер КАК Партнер,
			|	ОбъектыРасчетов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ВЫБОР
			|		КОГДА РасчетыСПоставщиками.ДатаПлатежа < &ТекущаяДата
			|			ТОГДА &ТекущаяДата
			|		ИНАЧЕ РасчетыСПоставщиками.ДатаПлатежа
			|	КОНЕЦ КАК Период,
			|	РасчетыСПоставщиками.Валюта КАК ВалютаВзаиморасчетов,
			|	РасчетыСПоставщиками.ФормаОплаты КАК ФормаОплаты,
			|	СУММА(РасчетыСПоставщиками.КОплате) КАК СуммаПоГрафику
			|ПОМЕСТИТЬ ЭтапыОплаты
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
			|		ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
			|			И (&Организация = Аналитика.Организация
			|				ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыРасчетов КАК ОбъектыРасчетов
			|			ПО РасчетыСПоставщиками.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов
			|ГДЕ
			|	РасчетыСПоставщиками.Активность
			|	И РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	И РасчетыСПоставщиками.КОплате > 0
			|СГРУППИРОВАТЬ ПО
			|	РасчетыСПоставщиками.ОбъектРасчетов,
			|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам,
			|	Аналитика.Партнер,
			|	ВЫБОР
			|		КОГДА РасчетыСПоставщиками.ДатаПлатежа < &ТекущаяДата
			|			ТОГДА &ТекущаяДата
			|		ИНАЧЕ РасчетыСПоставщиками.ДатаПлатежа
			|	КОНЕЦ,
			|	РасчетыСПоставщиками.Валюта,
			|	РасчетыСПоставщиками.ФормаОплаты,
			|	ОбъектыРасчетов.СтатьяДвиженияДенежныхСредств
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЭтапыОплаты.ОбъектРасчетов КАК ОбъектРасчетов,
			|	ЭтапыОплаты.ОбъектРасчетов.Организация КАК Организация,
			|	ЭтапыОплаты.Партнер,
			|	ЭтапыОплаты.СтатьяДвиженияДенежныхСредств,
			|	ЭтапыОплаты.Период,
			|	ЭтапыОплаты.ВалютаВзаиморасчетов,
			|	ЭтапыОплаты.ФормаОплаты,
			|	ЭтапыОплаты.СуммаПоГрафику,
			|	СУММА(ЕСТЬNULL(РасчетыСПоставщикамиОбороты.КОплатеПриход, 0) -
			|		ЕСТЬNULL(РасчетыСПоставщикамиОбороты.ОплачиваетсяОборот, 0)) КАК СуммаОплаты
			|ИЗ
			|	ЭтапыОплаты КАК ЭтапыОплаты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Обороты(, , Период, ) КАК РасчетыСПоставщикамиОбороты
			|		ПО (РасчетыСПоставщикамиОбороты.ОбъектРасчетов = ЭтапыОплаты.ОбъектРасчетов)
			|			И (РасчетыСПоставщикамиОбороты.Валюта = ЭтапыОплаты.ВалютаВзаиморасчетов)
			|			И (РасчетыСПоставщикамиОбороты.АналитикаУчетаПоПартнерам = ЭтапыОплаты.АналитикаУчетаПоПартнерам)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЭтапыОплаты.ОбъектРасчетов,
			|	ЭтапыОплаты.Партнер,
			|	ЭтапыОплаты.СтатьяДвиженияДенежныхСредств,
			|	ЭтапыОплаты.Период,
			|	ЭтапыОплаты.ВалютаВзаиморасчетов,
			|	ЭтапыОплаты.ФормаОплаты,
			|	ЭтапыОплаты.СуммаПоГрафику
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЭтапыОплаты.Период
			|ИТОГИ ПО
			|	ОбъектРасчетов";
			Иначе
			ТекстЗапроса = "
				|ВЫБРАТЬ
				|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
				|	ОбъектыРасчетов.ФормаОплаты КАК ФормаОплаты,
				|	ОбъектыРасчетов.Договор КАК Договор,
				|	ОбъектыРасчетов.Соглашение КАК Соглашение
				|ПОМЕСТИТЬ ВТОбъектыРасчетов
				|ИЗ 
				|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
				|ГДЕ
				|	ОбъектыРасчетов.Объект В (&ЗаказПоставщику)
				|	И НЕ ОбъектыРасчетов.ПометкаУдаления
				|ИНДЕКСИРОВАТЬ ПО 
				|	ОбъектРасчетов
				|; 
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РасчетыСПоставщикамиОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|	РасчетыСПоставщикамиОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
				|	РасчетыСПоставщикамиОбороты.Валюта КАК Валюта,
				|	-РасчетыСПоставщикамиОбороты.ОплачиваетсяОборот КАК СуммаОплаты
				|ПОМЕСТИТЬ ПодготовленоКОплате
				|ИЗ
				|	РегистрНакопления.РасчетыСПоставщиками.Обороты(
				|			,
				|			,
				|			Период,
				|			ОбъектРасчетов В
				|				(ВЫБРАТЬ
				|					ВтОбъектыРасчетов.ОбъектРасчетов
				|				ИЗ
				|					ВтОбъектыРасчетов)) КАК РасчетыСПоставщикамиОбороты
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РасчетыСПоставщиками.ОбъектРасчетов            КАК ОбъектРасчетов,
				|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|	Аналитика.Партнер                              КАК Партнер,
				|	Аналитика.Организация                          КАК Организация,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
				|			ТОГДА ВЫРАЗИТЬ(ОбъектыРасчетов.Соглашение КАК Справочник.СоглашенияСПоставщиками).СтатьяДвиженияДенежныхСредств
				|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
				|	КОНЕЦ                                          КАК СтатьяДвиженияДенежныхСредств,
				|	ВЫБОР
				|		КОГДА РасчетыСПоставщиками.ДатаПлановогоПогашения < &ТекущаяДата
				|			ТОГДА &ТекущаяДата
				|		ИНАЧЕ РасчетыСПоставщиками.ДатаПлановогоПогашения
				|	КОНЕЦ                                          КАК Период,
				|	РасчетыСПоставщиками.Валюта                    КАК ВалютаВзаиморасчетов,
				|	ОбъектыРасчетов.ФормаОплаты                    КАК ФормаОплаты,
				|	РасчетыСПоставщиками.КОплатеОстаток            КАК СуммаПоГрафику
				|ПОМЕСТИТЬ ОстаткиКОплате
				|ИЗ
				|	РегистрНакопления.РасчетыСПоставщикамиПланОплат.Остатки(,ОбъектРасчетов В (ВЫБРАТЬ ОбъектРасчетов ИЗ ВтОбъектыРасчетов)) КАК РасчетыСПоставщиками
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
				|			ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
				|				И (&Организация = Аналитика.Организация
				|					ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
				|			ПО РасчетыСПоставщиками.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	РасчетыСПоставщиками.ОбъектРасчетов            КАК ОбъектРасчетов,
				|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|	Аналитика.Партнер                              КАК Партнер,
				|	Аналитика.Организация                          КАК Организация,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
				|			ТОГДА ВЫРАЗИТЬ(ОбъектыРасчетов.Соглашение КАК Справочник.СоглашенияСПоставщиками).СтатьяДвиженияДенежныхСредств
				|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
				|	КОНЕЦ                                          КАК СтатьяДвиженияДенежныхСредств,
				|	ВЫБОР
				|		КОГДА РасчетыСПоставщиками.ДатаПлановогоПогашения < &ТекущаяДата
				|			ТОГДА &ТекущаяДата
				|		ИНАЧЕ РасчетыСПоставщиками.ДатаПлановогоПогашения
				|	КОНЕЦ                                          КАК Период,
				|	РасчетыСПоставщиками.Валюта                    КАК ВалютаВзаиморасчетов,
				|	ОбъектыРасчетов.ФормаОплаты                    КАК ФормаОплаты,
				|	РасчетыСПоставщиками.ДолгОстаток               КАК СуммаПоГрафику
				|ИЗ
				|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(,ОбъектРасчетов В (ВЫБРАТЬ ОбъектРасчетов ИЗ ВтОбъектыРасчетов)) КАК РасчетыСПоставщиками
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
				|			ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
				|				И (&Организация = Аналитика.Организация
				|					ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
				|			ПО РасчетыСПоставщиками.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВложенныйЗапрос.ОбъектРасчетов КАК ОбъектРасчетов,
				|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|	ВложенныйЗапрос.Партнер КАК Партнер,
				|	ВложенныйЗапрос.Организация КАК Организация,
				|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
				|	ВложенныйЗапрос.Период КАК Период,
				|	ВложенныйЗапрос.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
				|	ВложенныйЗапрос.ФормаОплаты КАК ФормаОплаты,
				|	ВложенныйЗапрос.СуммаПоГрафику КАК СуммаПоГрафику,
				|	ЕСТЬNULL(ПодготовленоКОплате.СуммаОплаты, 0) КАК СуммаОплаты
				|ИЗ
				|	(ВЫБРАТЬ
				|		ОстаткиКОплате.ОбъектРасчетов КАК ОбъектРасчетов,
				|		ОстаткиКОплате.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
				|		ОстаткиКОплате.Партнер КАК Партнер,
				|		ОстаткиКОплате.Организация КАК Организация,
				|		ОстаткиКОплате.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
				|		ОстаткиКОплате.Период КАК Период,
				|		ОстаткиКОплате.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
				|		ОстаткиКОплате.ФормаОплаты КАК ФормаОплаты,
				|		СУММА(ОстаткиКОплате.СуммаПоГрафику) КАК СуммаПоГрафику
				|	ИЗ
				|		ОстаткиКОплате КАК ОстаткиКОплате
				|	
				|	СГРУППИРОВАТЬ ПО
				|		ОстаткиКОплате.ОбъектРасчетов,
				|		ОстаткиКОплате.АналитикаУчетаПоПартнерам,
				|		ОстаткиКОплате.Партнер,
				|		ОстаткиКОплате.Организация,
				|		ОстаткиКОплате.СтатьяДвиженияДенежныхСредств,
				|		ОстаткиКОплате.Период,
				|		ОстаткиКОплате.ВалютаВзаиморасчетов,
				|		ОстаткиКОплате.ФормаОплаты) КАК ВложенныйЗапрос
				|		ЛЕВОЕ СОЕДИНЕНИЕ ПодготовленоКОплате КАК ПодготовленоКОплате
				|		ПО (ВложенныйЗапрос.ОбъектРасчетов = ПодготовленоКОплате.ОбъектРасчетов
				|				И ВложенныйЗапрос.АналитикаУчетаПоПартнерам = ПодготовленоКОплате.АналитикаУчетаПоПартнерам
				|				И ВложенныйЗапрос.ВалютаВзаиморасчетов = ПодготовленоКОплате.Валюта)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Период
				|ИТОГИ ПО
				|	ОбъектРасчетов
				|";
			КонецЕсли;
			
		КонецЕсли;
		
		Запрос = Новый Запрос(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("ПорядокРасчетов",ПорядокРасчетов);
		Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Договор", Договор);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		
		СтатьяДДСПоХО = Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
		СуммаКРаспределению = СуммаКОплате;
		
		ВыборкаПоЗаказам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоЗаказам.Следующий() Цикл
			
			СуммаПоГрафикуВсего = 0;
			УчтеноСуммаОплаты = 0;
			
			Выборка = ВыборкаПоЗаказам.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если (СуммаКРаспределению <> 0 И СуммаКОплате = 0) 
					ИЛИ (СуммаКРаспределению = 0
					И Выборка.Период > ТекущаяДатаСеанса()
					И РасшифровкаПлатежа.Количество() <> 0) Тогда
					Прервать;
				КонецЕсли;
					
				СуммаОплаты = ?(Выборка.СуммаОплаты < 0, 0, Выборка.СуммаОплаты);
				// Найдем первый неоплаченный этап.
				Если (Выборка.СуммаПоГрафику + СуммаПоГрафикуВсего) > СуммаОплаты
				 ИЛИ СуммаКОплате <> 0 Тогда
					
					НоваяСтрока = РасшифровкаПлатежа.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					Если Не ЗначениеЗаполнено(НоваяСтрока.СтатьяДвиженияДенежныхСредств) Тогда
						НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяДДСПоХО;
					КонецЕсли;
					НоваяСтрока.СуммаВзаиморасчетов = Выборка.СуммаПоГрафику + СуммаПоГрафикуВсего - (СуммаОплаты + УчтеноСуммаОплаты);
					Если СуммаКОплате <> 0 Тогда
						НоваяСтрока.СуммаВзаиморасчетов = Мин(НоваяСтрока.СуммаВзаиморасчетов, СуммаКОплате);
						СуммаКОплате = СуммаКОплате - НоваяСтрока.СуммаВзаиморасчетов;
						УчтеноСуммаОплаты = УчтеноСуммаОплаты + НоваяСтрока.СуммаВзаиморасчетов;
						СуммаПоГрафикуВсего = СуммаПоГрафикуВсего + Выборка.СуммаПоГрафику;
					КонецЕсли;
					
					НоваяСтрока.Сумма = РаботаСКурсамиВалютУТ.ПересчитатьВВалюту(
					                    	НоваяСтрока.СуммаВзаиморасчетов,
					                    	ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Выборка.Организация),
					                    	Выборка.ВалютаВзаиморасчетов,
					                    	ВалютаДокумента,
					                    	ТекущаяДатаСеанса(),
					                    	Выборка.ОбъектРасчетов);
					
					Если ЗначениеЗаполнено(ЖелательнаяДатаПлатежа) Тогда
						ЖелательнаяДатаПлатежа = Мин(ЖелательнаяДатаПлатежа, Выборка.Период);
					Иначе
						ЖелательнаяДатаПлатежа = Выборка.Период;
					КонецЕсли;
					
					Если НоваяСтрока.СуммаВзаиморасчетов = 0 И НоваяСтрока.Сумма = 0 Тогда
						РасшифровкаПлатежа.Удалить(НоваяСтрока);
					КонецЕсли;
					
				Иначе
					
					СуммаПоГрафикуВсего = СуммаПоГрафикуВсего + Выборка.СуммаПоГрафику;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
	
		Если РасшифровкаПлатежа.Количество() = 0 Тогда
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			Если ЗначениеЗаполнено(Договор)
				И (ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
				ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным) Тогда
				
				НоваяСтрока.ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(
					Договор,, Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
				УстановитьПривилегированныйРежим(Истина);
				РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					Договор, "Партнер, СтатьяДвиженияДенежныхСредств, ВалютаВзаиморасчетов");
				УстановитьПривилегированныйРежим(Ложь);
				НоваяСтрока.Партнер = РеквизитыДоговора.Партнер;
				НоваяСтрока.СтатьяДвиженияДенежныхСредств = РеквизитыДоговора.СтатьяДвиженияДенежныхСредств;
				Если Не ЗначениеЗаполнено(НоваяСтрока.СтатьяДвиженияДенежныхСредств) Тогда
					НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяДДСПоХО;
				КонецЕсли;
				НоваяСтрока.ВалютаВзаиморасчетов = РеквизитыДоговора.ВалютаВзаиморасчетов;
				
			ИначеЕсли ТипЗнч(ЗаказПоставщику) <> Тип("Массив") Тогда
				
				НоваяСтрока.ОбъектРасчетов	= ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(ЗаказПоставщику,,Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
				Если ЗначениеЗаполнено(НоваяСтрока.ОбъектРасчетов) Тогда
					РеквизитыОбъектаРасчетов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.ОбъектРасчетов, "Партнер, ВалютаВзаиморасчетов");
					ЗаполнитьЗначенияСвойств(НоваяСтрока, РеквизитыОбъектаРасчетов);
				Иначе
					НоваяСтрока.Партнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказПоставщику, "Партнер");
				КонецЕсли;
				Если ЗначениеЗаполнено(Договор) Тогда
					НоваяСтрока.СтатьяДвиженияДенежныхСредств = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "СтатьяДвиженияДенежныхСредств");
				КонецЕсли;
				Если Не ЗначениеЗаполнено(НоваяСтрока.СтатьяДвиженияДенежныхСредств) Тогда
					НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяДДСПоХО;
				КонецЕсли;
			КонецЕсли;
		
		Иначе
			РасшифровкаПлатежа.Свернуть("ОбъектРасчетов, Партнер, СтатьяДвиженияДенежныхСредств, ВалютаВзаиморасчетов", "Сумма, СуммаВзаиморасчетов");
		КонецЕсли;
		
		ДенежныеСредстваСервер.ЗаполнитьНДСВРасшифровке(РасшифровкаПлатежа,
			ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(Организация, ТекущаяДатаСеанса(), ВалютаДокумента, РасшифровкаПлатежа.ВыгрузитьКолонку("ОбъектРасчетов"), Ложь));
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполнения табличной части "РасшифровкаПлатежа" по возврату поставщику.
//
// Параметры:
//	Объекты - ДокументСсылка, Массив из ДокументСсылка - Документ основание.
//	Организация - СправочникСсылка.Организации - Организация документа.
//	ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа поступления денежных средств.
//	СуммаДокумента - Число - Сумма документа - основания.
//	Партнер - СправочникСсылка.Партнеры - Партнер документа - основания.
//	РасшифровкаПлатежа - ТабличнаяЧасть - Табличная часть документа.
//
Процедура ЗаполнитьРасшифровкуПлатежаПоВозвратуПоставщику(Объекты, Организация, ВалютаДокумента, СуммаДокумента, Партнер, РасшифровкаПлатежа) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ВалютаДокумента) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ОбъектыРасчетов.Объект КАК Объект,
		|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
		|	ОбъектыРасчетов.Организация КАК Организация,
		|	ОбъектыРасчетов.Договор КАК Договор,
		|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Справочник.ДоговорыКонтрагентов)
		|			ТОГДА ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
		|		КОГДА
		|			ЕСТЬNULL(ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) = 
		|				ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|			ТОГДА ВЫРАЗИТЬ(ОбъектыРасчетов.Соглашение КАК Справочник.СоглашенияСПоставщиками).СтатьяДвиженияДенежныхСредств
		|		ИНАЧЕ ОбъектыРасчетов.Договор.СтатьяДвиженияДенежныхСредств
		|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств
		|ПОМЕСТИТЬ ВТОбъектыРасчетов
		|ИЗ
		|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|ГДЕ
		|	ОбъектыРасчетов.Объект В (&Объекты)
		|	И НЕ ОбъектыРасчетов.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъектыРасчетов.Объект КАК ОснованиеПлатежа,
		|	РасчетыСПоставщиками.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ОбъектыРасчетов.Организация КАК Организация,
		|	ОбъектыРасчетов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	РасчетыСПоставщиками.Валюта КАК ВалютаВзаиморасчетов,
		|	РасчетыСПоставщиками.КОплатеОстаток КАК СуммаВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(,
		|		ОбъектРасчетов В (ВЫБРАТЬ ОбъектРасчетов ИЗ ВТОбъектыРасчетов)
		|	) КАК РасчетыСПоставщиками
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыРасчетов КАК ОбъектыРасчетов
		|		ПО ОбъектыРасчетов.ОбъектРасчетов = РасчетыСПоставщиками.ОбъектРасчетов
		|ГДЕ
		|	РасчетыСПоставщиками.КОплатеОстаток > 0
		|");
		
		Запрос.УстановитьПараметр("Объекты", Объекты);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Партнер = Партнер;
			
			Сумма = РаботаСКурсамиВалютУТ.ПересчитатьВВалюту(
			        	НоваяСтрока.СуммаВзаиморасчетов,
			        	ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Выборка.Организация),
			        	Выборка.ВалютаВзаиморасчетов,
			        	ВалютаДокумента,
			        	ТекущаяДатаСеанса(),
			        	Выборка.ОбъектРасчетов);
			
			Если Сумма <= СуммаДокумента Тогда
				НоваяСтрока.Сумма = Сумма;
			Иначе
				НоваяСтрока.Сумма = СуммаДокумента;
				НоваяСтрока.СуммаВзаиморасчетов = 0;
			КонецЕсли;
		КонецЕсли;
		
		ДенежныеСредстваСервер.ЗаполнитьНДСВРасшифровке(РасшифровкаПлатежа,
			ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(Организация, ТекущаяДатаСеанса(), ВалютаДокумента, РасшифровкаПлатежа.ВыгрузитьКолонку("ОбъектРасчетов"), Истина));
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполнения табличной части "РасшифровкаПлатежа" по договору.
//
// Параметры:
//		Договор - СправочникСсылка.ДоговорыКонтрагентов - Договор для получения остатков.
//		ВалютаДокумента - СправочникСсылка.Валюты - Валюта документа.
//		РасшифровкаПлатежа - ТаблицаЗначений - Таблица для заполнения.
//		Организация - СправочникСсылка.Организации - Необязательное, организация для получения остатков расчетов.
//
Процедура ЗаполнитьРасшифровкуПлатежаПоДоговоруСПоставщиком(Договор, ВалютаДокумента, РасшифровкаПлатежа, Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ВалютаДокумента) Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ОбъектыРасчетов.Ссылка, ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)) КАК ОбъектРасчетов,
		|	ЕСТЬNULL(Аналитика.Партнер, ДанныеДоговора.Партнер) КАК Партнер,
		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.Валюта, ДанныеДоговора.ВалютаВзаиморасчетов) КАК ВалютаВзаиморасчетов,
		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.ОплачиваетсяОстаток - РасчетыСПоставщикамиОстатки.КОплатеОстаток, 0) КАК СуммаВзаиморасчетов
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|	ПО
		|		ОбъектыРасчетов.Объект = &Договор
		|		И ОбъектыРасчетов.Организация = &Организация
		|		И НЕ ОбъектыРасчетов.ПометкаУдаления
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрНакопления.РасчетыСПоставщиками.Остатки(, ОбъектРасчетов.Объект = &Договор) КАК РасчетыСПоставщикамиОстатки
		|	ПО
		|		ИСТИНА
		|		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
		|		ПО РасчетыСПоставщикамиОстатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|			И (&Организация = Аналитика.Организация
		|				ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
		|ГДЕ
		|	ДанныеДоговора.Ссылка = &Договор
		|");
		
		Запрос.УстановитьПараметр("Договор", Договор);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		СтатьяДДСПоХО = Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(
			Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.СтатьяДвиженияДенежныхСредств = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "СтатьяДвиженияДенежныхСредств");
		Если Не ЗначениеЗаполнено(НоваяСтрока.СтатьяДвиженияДенежныхСредств) Тогда
			НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяДДСПоХО;
		КонецЕсли;
		
		НоваяСтрока.Сумма = РаботаСКурсамиВалютУТ.ПересчитатьВВалюту(
		                    	НоваяСтрока.СуммаВзаиморасчетов,
		                    	ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация),
		                    	Выборка.ВалютаВзаиморасчетов,
		                    	ВалютаДокумента,
		                    	ТекущаяДатаСеанса(),
		                    	Выборка.ОбъектРасчетов);
		
		ДенежныеСредстваСервер.ЗаполнитьНДСВРасшифровке(РасшифровкаПлатежа,
			ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(Организация, ТекущаяДатаСеанса(), ВалютаДокумента, РасшифровкаПлатежа.ВыгрузитьКолонку("ОбъектРасчетов"), Ложь));
	КонецЕсли;
	
КонецПроцедуры

// Пересчитывает суммы расшифровки платежа в выбранную валюту.
//
// Параметры:
//		Объект - ДокументОбъект - Документ для пересчета суммы.
//		СуммаВсего - Число - Сумма документа.
//
Процедура ПересчитатьСуммыВВалютуРасшифровкаПлатежа(Объект, СуммаВсего) Экспорт
	
	СуммаДокумента = СуммаВсего;
	ИтогСумма = Объект.РасшифровкаПлатежа.Итог("Сумма");
	
	// Пересчитаем суммы в табличной части документа.
	Если ИтогСумма <> 0 Тогда
		
		Для Каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			
			Сумма = Окр(СуммаДокумента * СтрокаТаблицы.Сумма / ИтогСумма, 2, 1);
			ИтогСумма = ИтогСумма - СтрокаТаблицы.Сумма;
			СуммаДокумента = СуммаДокумента - Сумма;
			СтрокаТаблицы.Сумма = Сумма;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ОбъектРасчетов) Тогда
				Если СтрокаТаблицы.ВалютаВзаиморасчетов = Объект.Валюта Тогда
					СтрокаТаблицы.СуммаВзаиморасчетов = 0;
				КонецЕсли;
			Иначе
				СтрокаТаблицы.ВалютаВзаиморасчетов = Неопределено;
				СтрокаТаблицы.СуммаВзаиморасчетов = 0;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти