
// @strict-types
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборСписка();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьОтборПоРолям();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПоПользователюПриИзменении(Элемент)
	УстановитьОтборСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусуОбработкиЗакупкиПриИзменении(Элемент)
	УстановитьОтборСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоАвторуПриИзменении(Элемент)
	УстановитьОтборСписка();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИмяПоля = Поле.Имя;
	
	Если СтрНайти(ИмяПоля, "ДокументОснованияСсылкаНаЗакупку") > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ИмяКолонки = СтрЗаменить(ИмяПоля, "ДокументОснованияСсылкаНаЗакупку", "ДокументОснования.СсылкаНаЗакупку");
		АдресСсылки = ТекущиеДанные[ИмяКолонки];
		Если ЗначениеЗаполнено(АдресСсылки) Тогда
			НачатьЗапускПриложения(Новый ОписаниеОповещения, АдресСсылки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОтборПоРолям()
	МассивСтатусов = Новый Массив;
	ОтборПоПользователю = ПараметрыСеанса.ТекущийПользователь;
	МассивСтатусов = Перечисления.КонтурЗакупки_СтатусыОбработкиЗакупки.ПолучитьМассивСтатусовОбработкиПоРоли(
			КонтурЗакупки_ЛокализацияУТ11_РаботаСЗакупкамиСервер.ПолучитьРольПользователя());

	Для Каждого ЭлементСтатуса Из МассивСтатусов Цикл
		//@skip-check typed-value-adding-to-untyped-collection
		ОтборПоСтатусуОбработкиЗакупки.Добавить(ЭлементСтатуса, Строка(ЭлементСтатуса));
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура УстановитьОтборСписка()
	Список.Отбор.Элементы.Очистить();

	Если ЗначениеЗаполнено(ОтборПоСтатусуОбработкиЗакупки) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусОбработкиЗакупки");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;

		ЭлементОтбора.ПравоеЗначение = ОтборПоСтатусуОбработкиЗакупки;
	КонецЕсли;

	Если ЗначениеЗаполнено(ОтборПоПользователю) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пользователь");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;

		ЭлементОтбора.ПравоеЗначение = ОтборПоПользователю;
	КонецЕсли;

	Если ЗначениеЗаполнено(ОтборПоАвтору) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Автор");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;

		ЭлементОтбора.ПравоеЗначение = ОтборПоАвтору;
	КонецЕсли;

	//@skip-check property-return-type
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти