Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаТрН(Данные, Представление, СтандартнаяОбработка, "2");
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("ДокументЭТРН");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфГО");
	МассивКлючевых.Добавить("ВрИнфГО");
	
	МассивКлючевых.Добавить("ДатФайлИнфГО");
	МассивКлючевых.Добавить("ВрФайлИнфГО");
	МассивКлючевых.Добавить("ИдФайлИнфГО");
	МассивКлючевых.Добавить("НомИспрГО");
	МассивКлючевых.Добавить("ДатаИспрГО");
	МассивКлючевых.Добавить("ЭПГО");
	
	МассивКлючевых.Добавить("ВодительСтрока");
	МассивКлючевых.Добавить("ЗамечанияВодителя");
	
	Возврат МассивКлючевых;
	
КонецФункции

// Функция - Проверить документф
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиПредыдущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ДокументОбъектИлиСсылка.ДокументЭТРН, ТаблицаОшибок);
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		// TODO понять какие сценарии проверки входящего документа
		
	Иначе
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
	   	
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ПроверитьИнфПол(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		Если Не ДокументОбъектИлиСсылка.ЕстьОтказВПодписи Тогда
			
			ПроверитьОтметки(ДокументОбъектИлиСсылка, ТаблицаОшибок);
			
		КонецЕсли;
		
		Если ДокументОбъектИлиСсылка.ЕстьЗамечанияПеревозчика Тогда
			
			ПроверитьЗамечания(ДокументОбъектИлиСсылка, ТаблицаОшибок);
			
		КонецЕсли;
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ДокументЭТРН = Объект.ДокументЭТРН;
	
	Если Не ЗначениеЗаполнено(ДокументЭТРН) Тогда
		
		ТекстОшибки = "Титул не привязан к Документу электронной транспортной накладной";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		ОбязательныеРеквизитыТРН = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МассивОбязательныхРеквизитов();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыТРН Цикл
			Если Не ЗначениеЗаполнено(ДокументЭТРН[ОбязательныйРевизит])  Тогда
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной транспортной накладной";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(Объект.ДокументЭТРН.УИД) Тогда
			ТекстОшибки = "Еще не загружен УИД транспортной накладной. Попробуйте выполнить обмен и ввести титул заново.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
				"УИД_ТрН", КатегорияПредупреждение, ТекстОшибки, "Выполнить обмен");
		КонецЕсли;
		
		РеквизитыЭТРН = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
			ДокументЭТРН, "ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку, ПогрузкуОсуществляет, Грузоотправитель");
		Если РеквизитыЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку И ЗначениеЗаполнено(РеквизитыЭТРН.ПогрузкуОсуществляет) Тогда
			ИстинныйГрузоотправитель = РеквизитыЭТРН.ПогрузкуОсуществляет;
		Иначе
			ИстинныйГрузоотправитель = РеквизитыЭТРН.Грузоотправитель;
		КонецЕсли;
		
		Если Не ИстинныйГрузоотправитель.Наш Тогда
			Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПроверитьКлючевыеРеквизитыЭтРН(ДокументЭТРН, ТаблицаОшибок,, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЭПГО)  Тогда
		
		ТекстОшибки = "Не получена подпись грузоотправителя";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ЭПГО", КатегорияОшибка, ТекстОшибки, "Выполнить обмен");
	КонецЕсли;
	
	Если Объект.ЕстьОтказВПодписи И Не ЗначениеЗаполнено(Объект.ПричинаОтказаВПодписи) Тогда 
		
		ТекстОшибки = "Не указана причина отказа в подписи";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ПричинаОтказаВПодписи", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;	
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ТрН_Титул3.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	// Провдение документа основания
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
	
КонецПроцедуры

Процедура ПроверитьИнфПол(Знач Объект, ТаблицаОшибок)
	
	МассивПроверок = Новый Массив;
	МассивПроверок.Добавить("ИнфПол");
	МассивПроверок.Добавить("ОтметкиИнфПол");
	МассивПроверок.Добавить("ЗамечанияИнфПол");
	
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьИнфПол(Объект, МассивПроверок, ТаблицаОшибок);	
	
КонецПроцедуры	

Процедура ПроверитьОтметки(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка 		= Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ИмяТЧ = "ОтметкиПеревозчика";
	
	Для Каждого Отметка Из Объект.ОтметкиПеревозчика Цикл 
		
		ТекущийНомерСтроки = Отметка.НомерСтроки;
		
		Если Не ЗначениеЗаполнено(Отметка.ДатаИВремяОтметки) Тогда
			
			ТекстОшибки = "Укажите Дату отметки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ДатаИВремяОтметки", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Отметка.ОписаниеОбстоятельств) Тогда
			
			ТекстОшибки = "Укажите Описание обстоятельств отметки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОписаниеОбстоятельств", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать описание обстоятельств");
			
		КонецЕсли;
		
		НайденныеШтрафы = Объект.Штрафы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", Отметка.ИдентификаторСтроки)); 
		Для Каждого Штраф Из НайденныеШтрафы Цикл 
			
			Если Не ЗначениеЗаполнено(Штраф.ИтогРазмШтрРФ) Тогда 
				
				ТекстОшибки = "Укажите Размер штрафа для Отметки №" + ТекущийНомерСтроки;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Штрафы", Штраф.НомерСтроки, 
					"ИтогРазмШтрРФ", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать размер штрафа");
				
			КонецЕсли;	
			
		КонецЦикла;
		
		НайденныеАкты = Объект.Акты.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", Отметка.ИдентификаторСтроки)); 
		Для Каждого Акт Из НайденныеАкты Цикл 
						
			Если Не ЗначениеЗаполнено(Акт.АктИдДок) 
				И Не ЗначениеЗаполнено(Акт.АктНаименование) 
				И Не ЗначениеЗаполнено(Акт.АктДата) 
				И Не ЗначениеЗаполнено(Акт.СтороныСоставители) 
				И Не ЗначениеЗаполнено(Акт.ДополнительныйСоставитель) Тогда 
				
				ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей Акта для Отметки №" + ТекущийНомерСтроки;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование акта");
								
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(Акт.АктИдДок) 
				И (ЗначениеЗаполнено(Акт.АктНаименование)
				Или ЗначениеЗаполнено(Акт.АктНомер) 
				Или ЗначениеЗаполнено(Акт.АктДата)
				Или ЗначениеЗаполнено(Акт.АктДопСведДок)
				Или ЗначениеЗаполнено(Акт.СтороныСоставители) 
				Или ЗначениеЗаполнено(Акт.ДополнительныйСоставитель)) Тогда	
					
				Если Не ЗначениеЗаполнено(Акт.АктНаименование) Тогда 
					
					ТекстОшибки = "Укажите Наименование акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование акта");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Акт.АктДата) Тогда 
					
					ТекстОшибки = "Укажите Дату акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктДата", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату акта");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Акт.СтороныСоставители) 
					И Не ЗначениеЗаполнено(Акт.ДополнительныйСоставитель) Тогда 
					
					ТекстОшибки = "Укажите Стороны составители или Доп.составителя акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"СтороныСоставители", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать стороны составители акта");
					
				КонецЕсли;
					
			КонецЕсли;
					
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ПроверитьЗамечания(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка 		= Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
				
	Если Не ЗначениеЗаполнено(Объект.ЗамДатВрПриб) 
		И Не ЗначениеЗаполнено(Объект.ЗамДатВрПриб) 
		И Не ЗначениеЗаполнено(Объект.ЗамДатВрУбыт)
		И Не ЗначениеЗаполнено(Объект.ЗамДатВрПосПрием)
		И Не ЗначениеЗаполнено(Объект.ЗамСостГруз)
		И Не ЗначениеЗаполнено(Объект.ЗамМасс)
		И Не ЗначениеЗаполнено(Объект.ЗамКолМест)
		И Не ЗначениеЗаполнено(Объект.ЗамПогрРаб) Тогда
		
		ТекстОшибки = "Укажите хотя бы одно замечание перевозчика";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ЗамДатВрПриб", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;

КонецПроцедуры
		
Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ТрН_Титул2.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

#КонецЕсли