#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ссылка) И НомИспрГО <> 0 Тогда
		// Пометим на удаление предыдущий титул
		ФалыйДляУдаления = Новый Массив;
		
		Титулы2 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитулыГлавногоПоТипу(
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2, ДокументЭТРН);
		Для Каждого ТекущийТитул Из Титулы2 Цикл
			ФайлТитула = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ТекущийТитул);
			
			Если ЗначениеЗаполнено(ФайлТитула) Тогда
				ФалыйДляУдаления.Добавить(ФайлТитула);
			КонецЕсли;
		КонецЦикла;
		
		КонтурЛогистика_ОбработкаДокументовСервер.УдалитьФайлыИСвязныеОбъекты(ФалыйДляУдаления);
	КонецЕсли;
	
	// Уведомления об отказе
	Если Не Отказ
		И ЕстьОтказВПодписи
		И Не УведомлениеОбОтказеОтправлено Тогда
		
		УведомлениеОбОтказеОтправлено = КонтурЛогистика_Уведомления.ОтправитьУведомленияОбОтказеИлиЧастичнойПриемкеТрН(ЭтотОбъект);
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ТрН_Титул2_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		// TODO
		//ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		//ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;
		
		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);
		
		// Сброс особенностей
		НомерДатаИсправленияТ1 = КонтурЛогистика_ОбработкаДокументовСервер.НомерДатаИсправленияПоИмениФайла(ИдФайлИнфГО);
		Если НомИспрГО >= НомерДатаИсправленияТ1.НомИспр Тогда
			Особенность = Перечисления.КонтурЛогистика_ТипыОсобенностейДокументооборота.ПустаяСсылка();
			РегистрыСведений.КонтурЛогистика_ОсобенностиДокументооборота.УстановитьОсобенность(ДокументЭТРН, Особенность);
		КонецЕсли;
		
	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ТрН_Титул2_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументЭТРН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлу(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументЭТРН) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти Документ ЭТРН, создание не выполнено");
		
	Иначе
		
		ДокументЭТРН = НайденныйДокументЭТРН;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		Если Найти(XDTO.ИдФайл, "DP_UVUTOCH") = 0 Тогда 
			
			ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
			
		Иначе
			
			ЗаполнитьРеквизитыТитулаИзXDTOОтказ(XDTO);
			
		КонецЕсли;
		
		// Комментарий - нет в формате минтранса // TODO есть в Диадоке - научиться доставать из ДД 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ 		= КС.XDTO_Вычислить(XDTO, "Документ");
	СодИнфПрвПрием 	= КС.XDTO_Вычислить(XDTO, "Документ.СодИнфПрвПрием");
	ОтметПрв 		= КС.XDTO_Вычислить(СодИнфПрвПрием, "ОтметПрвПрием");
	
	ДатИнфПрвПрием 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатИнфПрвПрием"));
	ВрИнфПрвПрием 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрИнфПрвПрием"));
	
	ДатФайлИнфГО 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфГО.ДатФайлИнфГО"));
	ВрФайлИнфГО 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфГО.ВрФайлИнфГО"));
	ИдФайлИнфГО 	= КС.XDTO_Вычислить(Документ, "ИдИнфГО.ИдФайлИнфГО");
	
	Если ЗначениеЗаполнено(ИдФайлИнфГО) Тогда
		НомерДатаИсправления = КонтурЛогистика_ОбработкаДокументовСервер.НомерДатаИсправленияПоИмениФайла(ИдФайлИнфГО);
		НомИспрГО = НомерДатаИсправления.НомИспр;
		ДатаИспрГО = НомерДатаИсправления.ДатаИспр;
	КонецЕсли;
	
	ЭПГО = КС.XDTO_Вычислить(Документ, "ИдИнфГО.ЭП");
	
	СтатПодп_raw = КС.XDTO_Вычислить(Документ, "Подписант.СтатПодп");
	СтатПодп = Перечисления.КонтурЛогистика_СтатусыПодписанта.ЗначениеИзXDTO(СтатПодп_raw);
	
	Должность = КС.XDTO_Вычислить(Документ, "Подписант.Должн");
	Фамилия = КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Фамилия");
	Имя = КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Имя");
	Отчество = КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Отчество");
	
	ЕстьЗамечанияПеревозчика = КонтурЛогистика_ОбработкаДокументовСервер.ЕстьЗамечанияПеревозчикаXDTO(СодИнфПрвПрием);
	ЕстьОтметкиПеревозчика	 = КонтурЛогистика_ОбработкаДокументовСервер.ЕстьОтметкиПеревозчикаXDTO(ОтметПрв);
	
	Если ЕстьЗамечанияПеревозчика Тогда 
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьЗамечанияПеревозчикаXDTO(СодИнфПрвПрием, ЭтотОбъект, Истина);
	КонецЕсли;
	
	Если ЕстьОтметкиПеревозчика Тогда 
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьОтметкиПеревозчикаXDTO(ОтметПрв, ЭтотОбъект);
	КонецЕсли;
	
	КонтурЛогистика_КонструкторыXDTO.ЗаполнитьИнфПолИзXDTO(СодИнфПрвПрием, ЭтотОбъект, "ИнфПол");
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTOОтказ(Знач XDTO)
	
	ЕстьОтказВПодписи = Истина;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ = КС.XDTO_Вычислить(XDTO, "Документ");
	
	// Данные Подписанта
	XDTO_Подписант 		= КС.XDTO_Вычислить(Документ, "Подписант");
	
	Должность 	= КС.XDTO_Вычислить(XDTO_Подписант, "Должн");
	Фамилия 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Фамилия");
	Имя 		= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Имя");
	Отчество 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Отчество");
		
	ТекстУведомления 		= КонтурЛогистика_КонструкторыXDTO.XDTO_Вычислить(XDTO, "Документ.СвУведУточ.ТекстУведУточ");	
	ПричинаОтказаВПодписи 	= ?(Не ТипЗнч(ТекстУведомления) = Тип("ОбъектXDTO"), ТекстУведомления, ""); 
	
КонецПроцедуры

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	НайденныйДокУчСист = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДокументУчетнойСистемыДляСледующегоТитула(ПредыдущийТитул);
	
	Если ЗначениеЗаполнено(НайденныйДокУчСист) Тогда 
		ДокументОснование = НайденныйДокУчСист;
	КонецЕсли;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
							ДанныеЗаполнения.ТипЛогистика);
	
	ДокументЭТРН = ПредыдущийТитул.ДокументЭТРН;
	
	ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		
		ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации);

	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул, Знач ВходящийФайлТитула1 = Неопределено) Экспорт
	
	Перем ДвоичныеДанныеПодписи, ФайлТитула1, ФайлТитула2, ГлавныйДокумент;
	
	ГлавныйДокумент = ПредыдущийТитул.ДокументЭТРН;
	
	ФайлТитула2 = Справочники.КонтурЛогистика_ФайлыОбмена.НайтиПервыйФайлТитулаПоГлавномуДокументу(
		ГлавныйДокумент, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2);
		
	// Уже есть т2 и это исправление
	Если ВходящийФайлТитула1 <> Неопределено Тогда
		
		ФайлТитула1 = ВходящийФайлТитула1;
		
	ИначеЕсли ФайлТитула2 = Справочники.КонтурЛогистика_ФайлыОбмена.ПустаяСсылка() И ПредыдущийТитул.НомИспр <> 0 Тогда 
		
		ФайлТитула1 = Справочники.КонтурЛогистика_ФайлыОбмена.НайтиПервыйФайлТитулаПоГлавномуДокументу(
			ГлавныйДокумент, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1);
		
	Иначе
		
		ФайлТитула1 = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ПредыдущийТитул);
		
	КонецЕсли;
	
	ИдФайлИнфГО 	= СтрЗаменить(ФайлТитула1.ИмяФайла, ".xml", "");
	ДатФайлИнфГО 	= ПредыдущийТитул.ДатИнфГО;
	ВрФайлИнфГО  	= ПредыдущийТитул.ВрИнфГО;
	НомИспрГО		= ПредыдущийТитул.НомИспр;
	ДатаИспрГО		= ПредыдущийТитул.ДатаИспр;
	
	ДвоичныеДанныеПодписи = ФайлТитула1.Подпись.Получить();
	ЭПГО = Base64Строка(ДвоичныеДанныеПодписи);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ДокументЭТРН.Перевозчик,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации) Экспорт

	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		//Заполнить ЭтотТитул
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ТрН_Титул2.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ДатИнфПрвПрием = ТекущаяДатаСеанса();
		ВрИнфПрвПрием = ТекущаяДатаСеанса();
		
		// формируем текст xml
		Если Не ЕстьОтказВПодписи Тогда 
			РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфПрвПрием, ВрИнфПрвПрием);
		Иначе
			РезультатФормированияТекста = СформироватьТекстФайлаУведомленияОбУточнении(ДатИнфПрвПрием, ВрИнфПрвПрием);
		КонецЕсли;
		
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфПрвПрием и ВрИнфПрвПрием
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 2;
	
	Формат = "5.01";
	ТипДокументооборота = "__etrnTitle";
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	Если ДокументЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку И ЗначениеЗаполнено(ДокументЭТРН.ПогрузкуОсуществляет) Тогда 
		ИстинныйГрузоотправитель = ДокументЭТРН.ПогрузкуОсуществляет;
	Иначе
		ИстинныйГрузоотправитель = ДокументЭТРН.Грузоотправитель;
	КонецЕсли;
	
	ДополнительныеПолучателиФайлаОбмена = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДопПолучателейФайла(ДокументЭТРН);
	
	Если ДополнительныеПолучателиФайлаОбмена.Количество() > 0 Тогда 
		W = 1;
	Иначе
		W = 0;
	КонецЕсли;
	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайлаОбмена); 	
		
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаТРН(НомерТитула, 
												ИстинныйГрузоотправитель,
												ДокументЭТРН.Перевозчик,
												ДокументЭТРН.Грузополучатель,
												GUID,
												W); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументЭТРН.Перевозчик, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_Подписант(НомерТитула, , Формат, ПодписантСтруктура);
	КС.XDTO_Подписант_СформироватьСведенияМЧД(НомерТитула, XDTO_Подписант, ПодписантСтруктура, Результат);
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, , Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	XDTO_СодИнфПрвПрием = КС.XDTO_СодИнфПрвПрием(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодИнфПрвПрием", XDTO_СодИнфПрвПрием);
	
	XDTO_ИдИнфГО 		= КС.XDTO_ИдИнфГО(НомерТитула, Формат, Ссылка, ТипДокументооборота);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфГО", XDTO_ИдИнфГО);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТекстФайлаУведомленияОбУточнении(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 2;
	Формат = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ФорматОбменаУведомленийОбУточнении();
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");

	XDTO_Файл = КС.XDTO_ФайлОбменаУведомлений(Ссылка, ДокументЭТРН, Формат);
	
	// подписант
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументЭТРН.Перевозчик, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	XDTO_Подписант 		= КС.XDTO_ПодписантУведомления( , , ПодписантСтруктура, Неопределено);
	XDTO_Файл.Документ.Подписант = XDTO_Подписант;
	Результат.Вставить("ИдентификаторМЧД",	ПодписантСтруктура.МЧД);
	
	GUID = Строка(Новый УникальныйИдентификатор);
			
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаУведомлений(ДокументЭТРН.Грузоотправитель, ДокументЭТРН.Перевозчик, GUID); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
																	
	КС.УдалитьПустыеСвойстваXDTO(XDTO_Файл);
													
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли