&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура КлассПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	ПоказатьГруппуКласса7 = Объект.Класс = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_КлассыОпасностиГрузов.Класс7");
	Элементы.ГруппаДляКласса7.Видимость = ПоказатьГруппуКласса7;
	
	ПоказатьГруппуКласса2 = Объект.Класс = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_КлассыОпасностиГрузов.Класс2");
	Элементы.ГруппаДляКласса2.Видимость = ПоказатьГруппуКласса2;
	
	ПоказатьГруппуКласса1 = Объект.Класс = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_КлассыОпасностиГрузов.Класс1");
	Элементы.ГруппаДляКласса1.Видимость = ПоказатьГруппуКласса1;
	
КонецПроцедуры
