
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаЗЗ(Данные, Представление, СтандартнаяОбработка, "1");
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		// TODO понять какие сценарии проверки входящего документа
		
	ИначеЕсли Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		И Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан Тогда  
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ПроверитьТабЧастьТовары(ДокументОбъектИлиСсылка, ТаблицаОшибок, ТекСтатусТитула);
		
		ПроверитьМаршрут(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		// TODO - доделать валидатор
		//
		//ПроверитьОтметки(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		//ПроверитьИнфПол(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьДружбуКонтрагентов(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьОтправителя(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
	ИначеЕсли ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена Тогда 
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиДругихСторон(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Объект.Грузоотправитель);
	
	Если Не ПараметрыСервиса.АвторизацияВыполнена И ЗначениеЗаполнено(Объект.Грузоотправитель) Тогда
		
		ОстатокУИДов = РегистрыСведений.КонтурЛогистика_УИДыГИС.ОсталосьСвободныхУИДов(Объект.Грузоотправитель);
		Если ОстатокУИДов = 0 Тогда
			
			ТекстОшибки = "Не осталось свободных УИД в пуле. Получите новые.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"УИД_Зак", КатегорияОшибка, ТекстОшибки, "Получить УИДы");
			
		КонецЕсли;
		
		Если ОстатокУИДов > 0 И Не ЗначениеЗаполнено(Объект.УИД_Зак) Тогда 
			ТекстОшибки = "УИД будет взят из пула (при записи)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"УИД_Зак", КатегорияПредупреждение, ТекстОшибки, "Взять сейчас");
		КонецЕсли;
		
	КонецЕсли;
	
	ОбязательныеРеквизитыЗЗ = Документы.КонтурЛогистика_ЗЗ_Титул1.МассивОбязательныхРеквизитов();
		
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЗЗ_Титул1.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Телефоны ГО и ПВ
	Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефонЗаполнен(Объект.Грузоотправитель) Тогда 
		
		ТекстОшибки = "Укажите Телефон Грузоотправителя";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"Грузоотправитель.Телефон", КатегорияОшибка, ТекстОшибки, "Указать");
			
	КонецЕсли;
	
	Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефонЗаполнен(Объект.Перевозчик) Тогда 
		
		ТекстОшибки = "Укажите Телефон Перевозчика";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"Перевозчик.Телефон", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	// ОрганизацияСоставитель 
	Если ЗначениеЗаполнено(Объект.Составитель) И Объект.Составитель <> Объект.Грузоотправитель Тогда 
		
		Если НЕ Объект.Составитель = Объект.Грузоотправитель Тогда
			
			Если Не ЗначениеЗаполнено(Объект.ОснДовОргСост) Тогда
			
				ТекстОшибки = "Укажите договор-основание полномочий составителя файла обмена";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ОснДовОргСост", КатегорияОшибка, ТекстОшибки, "Указать");
				
			Иначе 
				
				Если Не ЗначениеЗаполнено(Объект.ОснДовОргСост.Организация) Тогда
					
					ТекстОшибки = "Укажите организацию, к которой относится договор составителя Заказа (заявки)";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"ОснДовОргСост.Организация", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;	
				
				Если Не ЗначениеЗаполнено(Объект.ОснДовОргСост.Контрагент) Тогда
					
					ТекстОшибки = "Укажите контрагента, с которым у организации заключен договор составителя Заказа (заявки)";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"ОснДовОргСост.Контрагент", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.ПрвзПищПрод) И Не ЗначениеЗаполнено(Объект.ПредСрПрвз) Тогда
		
		ТекстОшибки = "Укажите предельные сроки перевозки";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ПредСрПрвз", КатегорияПредупреждение, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Объект.Функция = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ФункцииЗаказаЗаявки.Заявка")
		И НЕ ЗначениеЗаполнено(Объект.ДогОргПрвз) Тогда
		
		ТекстОшибки = "Укажите договор об организации перевозки груза";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДогОргПрвз", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьМаршрут(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ИмяТЧ = "АдрПункт";
	
	// Пункт(ы) погрузки
	Если Объект.АдрПункт.Количество() = 0 Тогда 
			
			ТекстОшибки = "Укажите маршрут";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"АдрПункт", КатегорияОшибка, ТекстОшибки, "Указать");
	Иначе
		
		Для Каждого СтрокаМаршрута Из Объект.АдрПункт Цикл 
			
			ТекущийНомерСтроки = СтрокаМаршрута.НомерСтроки;
			
			Если Не ЗначениеЗаполнено(СтрокаМаршрута.ПунктМаршрута) Тогда 
				ТекстОшибки = "Укажите пункт маршрута";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
					"ПунктМаршрута", КатегорияОшибка, ТекстОшибки, "Указать");
				
			ИначеЕсли Не СтрокаМаршрута.Погрузка И Не СтрокаМаршрута.Выгрузка Тогда
					ТекстОшибки = "Укажите у пункта маршрута признак погрузка или выгрузка";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
						"Выгрузка", КатегорияОшибка, ТекстОшибки, "Указать");
			Иначе	
				Если СтрокаМаршрута.Погрузка
					И Не ЗначениеЗаполнено(СтрокаМаршрута.ПунктМаршрута.Собственник) Тогда
					ТекстОшибки = "Укажите собственника пункта маршрута в его карточке";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
						"ПунктМаршрута.Собственник", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаМаршрута.ПредВрОпер) 
				И Не ЗначениеЗаполнено(СтрокаМаршрута.ДатВрОпер) Тогда 
				ТекстОшибки = "Укажите время начала операции (т.к. указана предельная длительность)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
					"ДатВрОпер", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьТабЧастьТовары(Знач Объект, ТаблицаОшибок, ТекСтатусДокумента = Неопределено)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ИмяТЧ = "Товары";
	
	Если Не ЗначениеЗаполнено(Объект.Товары) Тогда 
		
		ТекстОшибки = "Добавьте груз в табличную часть ""Грузы (Товары)""";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"", КатегорияОшибка, ТекстОшибки, "Добавить груз");
		
	ИначеЕсли Объект.Товары.НайтиСтроки(Новый Структура("Учитывать", Истина)).Количество() = 0 Тогда
		
		ТекстОшибки = "Нет ни одного учитываемого груза в табличной части ""Грузы (Товары)""";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"", КатегорияОшибка, ТекстОшибки, "Добавить груз");
		
	Иначе	
		
		ИтогоОбъем 			= 0;
		ИтогоМассаБрутто 	= 0;
		
		Для Каждого СтрокаТовара Из Объект.Товары Цикл
			                                                                      
			Если Не СтрокаТовара.Учитывать Тогда 
				Продолжить;
			КонецЕсли;
			
			ТекущийНомерСтроки = СтрокаТовара.НомерСтроки;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.КоличествоМест) Тогда
				ТекстОшибки = "Укажите Количество мест по грузу";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"КоличествоМест", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать кол-во мест");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.ОтгрузочноеНаименование) Тогда
				ТекстОшибки = "Укажите Отгрузочное наименование";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать отгрузочное наименование");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.СостояниеГруза) Тогда
				ТекстОшибки = "Укажите Состояние груза";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"СостояниеГруза", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать состояние груза");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.ВидТары) Тогда
				ТекстОшибки = "Укажите Вид тары";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ВидТары", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать вид тары");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.МассаПлановаяБруттоКг) Тогда
				ТекстОшибки = "Укажите Массу (брутто) груза";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"МассаПлановаяБруттоКг", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать массу брутто");
			Иначе
				ИтогоМассаБрутто = ИтогоМассаБрутто + СтрокаТовара.МассаПлановаяБруттоКг;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.ОбъемКубМ) Тогда
				ТекстОшибки = "Укажите объем груза";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОбъемКубМ", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать объем");
			Иначе
				ИтогоОбъем = ИтогоОбъем + СтрокаТовара.ОбъемКубМ;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.Высота)
				ИЛИ НЕ ЗначениеЗаполнено(СтрокаТовара.Длина)
				ИЛИ НЕ ЗначениеЗаполнено(СтрокаТовара.Ширина)
				Тогда
				ТекстОшибки = "Укажите габариты груза (Д, Ш, В)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"Высота", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать");
			КонецЕсли;
			
			// ПроверитьСвязанныеОпасныеГрузы(Объект, СтрокаТовара, ТаблицаОшибок);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Объект.ТСВместим) 
			И ИтогоОбъем > 0
			И ИтогоОбъем > Объект.ТСВместим Тогда
			
			ТекстОшибки = "Общий объем по таб. части Грузы (" + ИтогоОбъем + " куб.м.) превышает запрошенную вместимость ТС (" + Объект.ТСВместим + " куб.м.)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТСВместим", КатегорияПредупреждение, ТекстОшибки, "Исправить");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ТСГрузопод) 
			И ИтогоМассаБрутто > 0
			И ИтогоМассаБрутто/1000 > Объект.ТСГрузопод Тогда  // кг-тонны
			
			ТекстОшибки = "Общая масса Брутто по таб. части Грузы (" + ИтогоМассаБрутто + " кг.) превышает запрошенную грузоподъемность ТС (" + Объект.ТСГрузопод + " т.)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТСГрузопод", КатегорияПредупреждение, ТекстОшибки, "Исправить");
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ДогОргПрвз");
	МассивОбязательных.Добавить("Составитель");
	МассивОбязательных.Добавить("ОснДовОргСост");
	МассивОбязательных.Добавить("УказанияВОтношенииНормПеревозки");
	МассивОбязательных.Добавить("ПредСрПрвз");
	МассивОбязательных.Добавить("ПрвзПищПрод");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ОпасныеГрузыМассивСтруктур");
	МассивОбязательных.Добавить("ТоварыПунктыПогрузкиВыгрузкиМассивСтруктур");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("Грузоотправитель");
	МассивОбязательных.Добавить("Перевозчик");
	МассивОбязательных.Добавить("ДатаЗак");
	МассивОбязательных.Добавить("ТСТип");
	МассивОбязательных.Добавить("ТСГрузопод");
	МассивОбязательных.Добавить("ТСВместим");
	МассивОбязательных.Добавить("ПунктПод");
	МассивОбязательных.Добавить("ДатВрПод");
	МассивОбязательных.Добавить("Функция");
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ОтгрузочноеНаименование");
	МассивОбязательных.Добавить("СостояниеГруза");
	МассивОбязательных.Добавить("ВидТары");
	МассивОбязательных.Добавить("КоличествоМест");
	МассивОбязательных.Добавить("МетодОпределенияМассы");
	МассивОбязательных.Добавить("Объем");
	МассивОбязательных.Добавить("МассаПлановаяБруттоКг");
	МассивОбязательных.Добавить("Высота");
	МассивОбязательных.Добавить("Длина");
	МассивОбязательных.Добавить("Ширина");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ПромПунктМршМассивСтруктур",
		"Промежуточные пункты",
		"Заполняется в случае необходимости определения маршрута перевозки, обязанности доставки порожнего контейнера или предоставленного грузоотправителем перевозчику оборудования для крепления груза", 
		"МассивСтруктур(см. таблицу ПромПунктМрш)",
		2));
		
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"СвЛицГОМассивСтруктур",
		"Уполномоченные лица",
		"Сведения о лице (лицах), уполномоченном (ых) грузоотправителем на заполнение и подписание Заказа (заявки) или погрузку груза в транспортное средство,
		|заполнение и подписание транспортной накладной или осуществление платежей по договору перевозки",
		"МассивСтруктур(см. таблицу СвЛицГО)",
		2));
		
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"АдрПунктМассивСтруктур",
		"Адреса пунктов погрузки и выгрузки",
		"Адреса пунктов погрузки и выгрузки",
		"МассивСтруктур(см. таблицу АдрПункт)",
		1));
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ДополнительныеПолучателиФайлаМассивСтруктур",
		"Дополнительные получатели файла",
		"Указываются дополнительные получатели файла",
		"МассивСтруктур(см. таблицу ДополнительныеПолучателиФайла)",
		2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ОпасныеГрузыМассивСтруктур", 
		"Опасные грузы", 
		"Сведения об опасных грузах ДОПОГ", 
		"МассивСтруктур(см. спр.КонтурЛогистика_ОписанияОпасныхГрузов)", 
		2));
		
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ТоварыПунктыПогрузкиВыгрузкиМассивСтруктур", 
		"Пункты погрузки и выгрузки", 
		"необязательное распределение товаров по пунктам погрузки-выгрузки", 
		"МассивСтруктур(см. таблицу ТоварыПунктыПогрузкиВыгрузки)", 
		2));	
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_Зак");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфГО");
	МассивКлючевых.Добавить("ВрИнфГО");
	
	МассивКлючевых.Добавить("ПартнерГрузоотправитель");
	МассивКлючевых.Добавить("ПартнерПеревозчик");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ЗЗ_Титул1.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

Функция ПолучитьСледующийПоЦепочкеТипТитулаЗЗ(ДокЗЗТ1Ссылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокЗЗТ1Ссылка) Тогда 
		ВызватьИсключение "Не заполнен Документ - не могу определить титул";
	КонецЕсли;
	
	Если ТипЗнч(ДокЗЗТ1Ссылка) = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1") Тогда  
		Возврат Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2;
	Иначе
		Возврат Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеДляПечатиЭЗЗ(МассивДокументовЭЗЗ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул1.Ссылка КАК Титул1,
	|	МАКСИМУМ(ЕСТЬNULL(КонтурЛогистика_ЗЗ_Титул2.Ссылка, ЗНАЧЕНИЕ(Документ.КонтурЛогистика_ЗЗ_Титул2.ПустаяСсылка))) КАК
	|		Титул2
	|ПОМЕСТИТЬ ВТ_ЭЗЗ
	|ИЗ
	|	Документ.КонтурЛогистика_ЗЗ_Титул1 КАК КонтурЛогистика_ЗЗ_Титул1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул2 КАК КонтурЛогистика_ЗЗ_Титул2
	|		ПО КонтурЛогистика_ЗЗ_Титул2.Титул1 = КонтурЛогистика_ЗЗ_Титул1.Ссылка
	|		И НЕ КонтурЛогистика_ЗЗ_Титул2.ПометкаУдаления
	|ГДЕ
	|	КонтурЛогистика_ЗЗ_Титул1.Ссылка В (&МассивДокументовЭЗЗ)
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ЗЗ_Титул1.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул1,
	|	ВТ_ЭЗЗ.Титул1.Функция,
	|	ВТ_ЭЗЗ.Титул1.Грузоотправитель,
	|	ВТ_ЭЗЗ.Титул1.Перевозчик,
	|	ВТ_ЭЗЗ.Титул1.Составитель,
	|	ВТ_ЭЗЗ.Титул1.ОснДовОргСост,
	|	ВТ_ЭЗЗ.Титул1.ДогОргПрвз,
	|	ВТ_ЭЗЗ.Титул1.НомЗак,
	|	ВТ_ЭЗЗ.Титул1.ДатаЗак,
	|	ВТ_ЭЗЗ.Титул1.УказанияВОтношенииНормПеревозки,
	|	ВТ_ЭЗЗ.Титул1.ПредСрПрвз,
	|	ВТ_ЭЗЗ.Титул1.ПрвзПищПрод,
	|	ВТ_ЭЗЗ.Титул1.ИныеУслв,
	|	ВТ_ЭЗЗ.Титул1.КонПунктМрш,
	|	ВТ_ЭЗЗ.Титул1.ПунктПод,
	|	ВТ_ЭЗЗ.Титул1.ДатВрПод,
	|	ВТ_ЭЗЗ.Титул1.ПредВрПод,
	|	ВТ_ЭЗЗ.Титул1.ТСТип,
	|	ВТ_ЭЗЗ.Титул1.ТСГрузопод,
	|	ВТ_ЭЗЗ.Титул1.ТСВместим,
	|	ВТ_ЭЗЗ.Титул1.ТСТипПогр,
	|	ВТ_ЭЗЗ.Титул1.ТСТипКуз,
	|	ВТ_ЭЗЗ.Титул1.ТСДрПарам,
	|	ВТ_ЭЗЗ.Титул1.ТемператураНеНиже,
	|	ВТ_ЭЗЗ.Титул1.ТемператураНеВыше,
	|	ВТ_ЭЗЗ.Титул1.ВлажностьНеНиже,
	|	ВТ_ЭЗЗ.Титул1.ВлажностьНеВыше,
	|	ВТ_ЭЗЗ.Титул2,
	|	ЕСТЬNULL(ВТ_ЭЗЗ.Титул2.Составитель, ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)) КАК
	|		Титул2Составитель,
	|	ЕСТЬNULL(ВТ_ЭЗЗ.Титул2.ОснДовОргСост, ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Договоры.ПустаяСсылка)) КАК
	|		Титул2ОснДовОргСост,
	|	ЕСТЬNULL(ВТ_ЭЗЗ.Титул2.ЕстьОтказВПодписи, ЛОЖЬ) КАК Титул2ЕстьОтказВПодписи,
	|	ЕСТЬNULL(ВТ_ЭЗЗ.Титул2.ПричинаОтказаВПодписи, """") КАК Титул2ПричинаОтказаВПодписи,
	|	ЕСТЬNULL(ВТ_ЭЗЗ.Титул2.СвЛицОргПрвз, ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Сотрудники.ПустаяСсылка)) КАК
	|		Титул2СвЛицОргПрвз,
	|	ЕСТЬNULL(ВТ_ЭЗЗ.Титул2.СвЛицПрв, ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)) КАК
	|		Титул2СвЛицПрв,
	|	ЕСТЬNULL(ВТ_ЭЗЗ.Титул2.ТранспортноеСредство,
	|		ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ТранспортныеСредства.ПустаяСсылка)) КАК Титул2ТранспортноеСредство,
	|	ЕСТЬNULL(ВТ_ЭЗЗ.Титул2.СтТовБезНДС, 0) КАК Титул2СтоимостьБезНДС,
	|	ЕСТЬNULL(ВТ_ЭЗЗ.Титул2.НалСт, ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.КонтурЛогистика_СтавкиНДС.ПустаяСсылка)) КАК Титул2НалСт,
	|	ЕСТЬNULL(ВТ_ЭЗЗ.Титул2.СтТовУчНал, 0) КАК Титул2СтоимостьСНДС,
	|	ЕСТЬNULL(ВТ_ЭЗЗ.Титул2.Расчет, """") КАК Титул2Расчет,
	|	ВТ_ЭЗЗ.Титул1.УИД_Зак
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул1СвЛицГО.Ссылка КАК Титул1,
	|	КонтурЛогистика_ЗЗ_Титул1СвЛицГО.Полномочие,
	|	КонтурЛогистика_ЗЗ_Титул1СвЛицГО.Участник,
	|	КонтурЛогистика_ЗЗ_Титул1СвЛицГО.ДокументНаименование,
	|	КонтурЛогистика_ЗЗ_Титул1СвЛицГО.ДокументНомер,
	|	КонтурЛогистика_ЗЗ_Титул1СвЛицГО.ДокументДата
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул1.СвЛицГО КАК КонтурЛогистика_ЗЗ_Титул1СвЛицГО
	|		ПО ВТ_ЭЗЗ.Титул1 = КонтурЛогистика_ЗЗ_Титул1СвЛицГО.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул1АдрПункт.Ссылка КАК Титул1,
	|	КонтурЛогистика_ЗЗ_Титул1АдрПункт.НомерСтроки,
	|	КонтурЛогистика_ЗЗ_Титул1АдрПункт.Погрузка,
	|	КонтурЛогистика_ЗЗ_Титул1АдрПункт.Выгрузка,
	|	КонтурЛогистика_ЗЗ_Титул1АдрПункт.ДатВрОпер,
	|	КонтурЛогистика_ЗЗ_Титул1АдрПункт.ПунктМаршрута,
	|	КонтурЛогистика_ЗЗ_Титул1АдрПункт.ПредВрОпер,
	|	КонтурЛогистика_ЗЗ_Титул1АдрПункт.ПунктМаршрута.Собственник.ИНН КАК ИННСобственника
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул1.АдрПункт КАК КонтурЛогистика_ЗЗ_Титул1АдрПункт
	|		ПО ВТ_ЭЗЗ.Титул1 = КонтурЛогистика_ЗЗ_Титул1АдрПункт.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул1ПромПунктМрш.Ссылка КАК Титул1,
	|	КонтурЛогистика_ЗЗ_Титул1ПромПунктМрш.ПромПунктМрш
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул1.ПромПунктМрш КАК КонтурЛогистика_ЗЗ_Титул1ПромПунктМрш
	|		ПО ВТ_ЭЗЗ.Титул1 = КонтурЛогистика_ЗЗ_Титул1ПромПунктМрш.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул1Товары.Ссылка КАК Титул1,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.ОтгрузочноеНаименование,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.СостояниеГруза,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.ВидТары.Наименование КАК ВидТары,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.КоличествоМест,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.ОбъемКубМ,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.Высота,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.Длина,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.Ширина,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.РаспрГр,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.ДелГр,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.МассаПлановаяБруттоКг,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.МассаПлановаяНеттоКг,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.МетодОпределенияМассы,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.МасТар,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.КоличествоПаллет,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.ДопИнформация,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.ИдентификаторСтроки,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.УчВодПогрГр,
	|	КонтурЛогистика_ЗЗ_Титул1Товары.ПрГрКонт
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул1.Товары КАК КонтурЛогистика_ЗЗ_Титул1Товары
	|		ПО ВТ_ЭЗЗ.Титул1 = КонтурЛогистика_ЗЗ_Титул1Товары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.Ссылка КАК Титул1,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ИдентификаторСтрокиТоваров КАК ИдентификаторСтроки,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.НомерООН КАК тНомерООН,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.НадлежащееОтгрузочноеНаименование КАК тНадлежащееОтгрузочноеНаименование,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ТехническоеНаименование КАК тТехническоеНаименование,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.Описание КАК тОписание,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.Класс КАК тКласс,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.КлассификационныйКод КАК тКлассификационныйКод,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ГруппаУпаковки КАК тГруппаУпаковки,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ЗнакОпасности КАК тЗнакОпасности,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.КодОграниченияТуннели КАК тКодОграниченияТуннели,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.Радионуклиды КАК тРадионуклиды,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеФизХимФормы КАК тОписаниеФизХимФормы,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.МаксАктивностьРадиации КАК тМаксАктивностьРадиации,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.КатегорияУпаковки КАК тКатегорияУпаковки,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ТранспортныйИндекс КАК тТранспортныйИндекс,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ИндексБезопасности КАК тИндексБезопасности,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОпознавательныйЗнакСертификатов КАК тОпознавательныйЗнакСертификатов,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ПолнаяАктивностьГруза КАК тПолнаяАктивностьГруза,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОбМасНетВзрСод КАК тОбМасНетВзрСод,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОбМасНетВзрСодВсех КАК тОбМасНетВзрСодВсех,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ПроцСмеси КАК тПроцСмеси,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ДатаИстеченияВремениУдержания КАК тДатаИстеченияВремениУдержания,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.КонтрольнаяТемпература КАК тКонтрольнаяТемпература,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.АварийнаяТемпература КАК тАварийнаяТемпература,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.НомерООН КАК оНомерООН,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.НадлежащееОтгрузочноеНаименование КАК
	|		оНадлежащееОтгрузочноеНаименование,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.ТехническоеНаименование КАК оТехническоеНаименование,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.Описание КАК оОписание,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.Класс КАК оКласс,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.КлассификационныйКод КАК оКлассификационныйКод,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.ГруппаУпаковки КАК оГруппаУпаковки,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.ЗнакОпасности КАК оЗнакОпасности,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.КодОграниченияТуннели КАК оКодОграниченияТуннели,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.Радионуклиды КАК оРадионуклиды,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.ОписаниеФизХимФормы КАК оОписаниеФизХимФормы,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.МаксАктивностьРадиации КАК оМаксАктивностьРадиации,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.КатегорияУпаковки КАК оКатегорияУпаковки,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.ТранспортныйИндекс КАК оТранспортныйИндекс,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.ИндексБезопасности КАК оИндексБезопасности,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.ОпознавательныйЗнакСертификатов КАК
	|		оОпознавательныйЗнакСертификатов,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.ПолнаяАктивностьГруза КАК оПолнаяАктивностьГруза,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.ОбМасНетВзрСод КАК оОбМасНетВзрСод,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.ОбМасНетВзрСодВсех КАК оОбМасНетВзрСодВсех,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.ПроцСмеси КАК оПроцСмеси,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.ДатаИстеченияВремениУдержания КАК
	|		оДатаИстеченияВремениУдержания,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.КонтрольнаяТемпература КАК оКонтрольнаяТемпература,
	|	КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.ОписаниеОпасногоГруза.АварийнаяТемпература КАК оАварийнаяТемпература
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул1.ОпасныеГрузы КАК КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы
	|		ПО ВТ_ЭЗЗ.Титул1 = КонтурЛогистика_ЗЗ_Титул1ОпасныеГрузы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул1ИнфПол.Ссылка КАК Титул1,
	|	КонтурЛогистика_ЗЗ_Титул1ИнфПол.Идентиф,
	|	КонтурЛогистика_ЗЗ_Титул1ИнфПол.Значение
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул1.ИнфПол КАК КонтурЛогистика_ЗЗ_Титул1ИнфПол
	|		ПО ВТ_ЭЗЗ.Титул1 = КонтурЛогистика_ЗЗ_Титул1ИнфПол.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул2Водители.Ссылка.Титул1 КАК Титул1,
	|	КонтурЛогистика_ЗЗ_Титул2Водители.СвВодит
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул2.Водители КАК КонтурЛогистика_ЗЗ_Титул2Водители
	|		ПО ВТ_ЭЗЗ.Титул2 = КонтурЛогистика_ЗЗ_Титул2Водители.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул2Прицепы.Ссылка.Титул1 КАК Титул1,
	|	КонтурЛогистика_ЗЗ_Титул2Прицепы.Прицеп
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул2.Прицепы КАК КонтурЛогистика_ЗЗ_Титул2Прицепы
	|		ПО ВТ_ЭЗЗ.Титул2 = КонтурЛогистика_ЗЗ_Титул2Прицепы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул2СпецУсловияДвижения.Ссылка.Титул1 КАК Титул1,
	|	КонтурЛогистика_ЗЗ_Титул2СпецУсловияДвижения.НомСР,
	|	КонтурЛогистика_ЗЗ_Титул2СпецУсловияДвижения.ДатаСР,
	|	КонтурЛогистика_ЗЗ_Титул2СпецУсловияДвижения.СрокСР,
	|	КонтурЛогистика_ЗЗ_Титул2СпецУсловияДвижения.СведМрш_МршТекст,
	|	КонтурЛогистика_ЗЗ_Титул2СпецУсловияДвижения.ВидСР,
	|	КонтурЛогистика_ЗЗ_Титул2СпецУсловияДвижения.НаимОИВ,
	|	КонтурЛогистика_ЗЗ_Титул2СпецУсловияДвижения.ИдСР
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул2.СпецУсловияДвижения КАК
	|			КонтурЛогистика_ЗЗ_Титул2СпецУсловияДвижения
	|		ПО ВТ_ЭЗЗ.Титул2 = КонтурЛогистика_ЗЗ_Титул2СпецУсловияДвижения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул2ИнфПол.Ссылка.Титул1 КАК Титул1,
	|	КонтурЛогистика_ЗЗ_Титул2ИнфПол.Идентиф,
	|	КонтурЛогистика_ЗЗ_Титул2ИнфПол.Значение
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул2.ИнфПол КАК КонтурЛогистика_ЗЗ_Титул2ИнфПол
	|		ПО ВТ_ЭЗЗ.Титул2 = КонтурЛогистика_ЗЗ_Титул2ИнфПол.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул1,
	|	КонтурЛогистика_ФайлыОбмена.Ссылка КАК ФайлОбмена,
	|	ВЫБОР
	|		КОГДА
	|			КонтурЛогистика_ФайлыОбмена.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1)
	|			ТОГДА 1
	|		КОГДА
	|			КонтурЛогистика_ФайлыОбмена.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2)
	|			ТОГДА 2
	|	КОНЕЦ КАК НомерТитула,
	|	КонтурЛогистика_ФайлыОбмена.КомуВыданСертификат,
	|	КонтурЛогистика_ФайлыОбмена.Сертификат,
	|	КонтурЛогистика_ФайлыОбмена.ДатаВремяФормирования КАК ДатаВремяФормирования,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ВодительДатаСобытия
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ФайлыОбмена КАК КонтурЛогистика_ФайлыОбмена
	|		ПО ВТ_ЭЗЗ.Титул1 = КонтурЛогистика_ФайлыОбмена.ГлавныйДокумент
	|		И НЕ КонтурЛогистика_ФайлыОбмена.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТитула,
	|	ДатаВремяФормирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул1.Грузоотправитель КАК ОрганизацияДиадок
	|ПОМЕСТИТЬ ВТ_Организации
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул1.Перевозчик
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул1.Составитель
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|ГДЕ
	|	ВТ_ЭЗЗ.Титул1.Составитель <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул1СвЛицГО.Участник
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул1.СвЛицГО КАК КонтурЛогистика_ЗЗ_Титул1СвЛицГО
	|		ПО ВТ_ЭЗЗ.Титул1 = КонтурЛогистика_ЗЗ_Титул1СвЛицГО.Ссылка
	|ГДЕ
	|	КонтурЛогистика_ЗЗ_Титул1СвЛицГО.Участник ССЫЛКА Справочник.КонтурЛогистика_ОрганизацииДиадок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул2.Составитель
	|ИЗ
	|	Документ.КонтурЛогистика_ЗЗ_Титул2 КАК КонтурЛогистика_ЗЗ_Титул2
	|ГДЕ
	|	КонтурЛогистика_ЗЗ_Титул2.Составитель <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Организация,
	|	КонтурЛогистика_ОрганизацииДиадок.НаименованиеОрганизацииПолное КАК ПолноеНаименование,
	|	КонтурЛогистика_ОрганизацииДиадок.ТелефонОсновной,
	|	КонтурЛогистика_ОрганизацииДиадок.ИНН,
	|	КонтурЛогистика_ОрганизацииДиадок.КПП,
	|	КонтурЛогистика_ОрганизацииДиадок.АдресПредставление КАК ЮридическийАдрес,
	|	КонтурЛогистика_ОрганизацииДиадок.ТипЛица
	|ИЗ
	|	ВТ_Организации КАК ВТ_Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|		ПО ВТ_Организации.ОрганизацияДиадок = КонтурЛогистика_ОрганизацииДиадок.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул1СвЛицГО.Участник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул1.СвЛицГО КАК КонтурЛогистика_ЗЗ_Титул1СвЛицГО
	|		ПО ВТ_ЭЗЗ.Титул1 = КонтурЛогистика_ЗЗ_Титул1СвЛицГО.Ссылка
	|ГДЕ
	|	КонтурЛогистика_ЗЗ_Титул1СвЛицГО.Участник ССЫЛКА Справочник.КонтурЛогистика_Сотрудники
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул2.СвЛицОргПрвз
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул2Водители.СвВодит
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул2.Водители КАК КонтурЛогистика_ЗЗ_Титул2Водители
	|		ПО ВТ_ЭЗЗ.Титул2 = КонтурЛогистика_ЗЗ_Титул2Водители.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_Сотрудники.Ссылка КАК Сотрудник,
	|	КонтурЛогистика_Сотрудники.Фамилия + "" "" + КонтурЛогистика_Сотрудники.Имя + "" "" +
	|		КонтурЛогистика_Сотрудники.Отчество КАК ФИО,
	|	КонтурЛогистика_Сотрудники.Должность,
	|	КонтурЛогистика_Сотрудники.ИНН,
	|	КонтурЛогистика_Сотрудники.ОснованиеПолномочий КАК ОДолжОб,
	|	КонтурЛогистика_Сотрудники.ОснованиеПолномочийДоговор КАК ОснПогрГр,
	|	КонтурЛогистика_Сотрудники.ТелефонЗапасной,
	|	КонтурЛогистика_Сотрудники.ТелефонОсновной,
	|	КонтурЛогистика_Сотрудники.Фамилия,
	|	КонтурЛогистика_Сотрудники.Имя,
	|	КонтурЛогистика_Сотрудники.Отчество,
	|	КонтурЛогистика_Сотрудники.ВУДатаВыдачи,
	|	КонтурЛогистика_Сотрудники.ВУНомер,
	|	КонтурЛогистика_Сотрудники.ВУСерия,
	|	""ВУ: "" + КонтурЛогистика_Сотрудники.ВУСерия + "" "" + КонтурЛогистика_Сотрудники.ВУНомер КАК ВУВодителя
	|ИЗ
	|	Справочник.КонтурЛогистика_Сотрудники КАК КонтурЛогистика_Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ПО КонтурЛогистика_Сотрудники.Ссылка = ВТ_Сотрудники.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул2.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ ВТ_ТранспортныеСредства
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|ГДЕ
	|	ВТ_ЭЗЗ.Титул2.ТранспортноеСредство <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ТранспортныеСредства.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул2Прицепы.Прицеп
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул2.Прицепы КАК КонтурЛогистика_ЗЗ_Титул2Прицепы
	|		ПО ВТ_ЭЗЗ.Титул2 = КонтурЛогистика_ЗЗ_Титул2Прицепы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТранспортныеСредства.Ссылка КАК ТранспортноеСредство,
	|	КонтурЛогистика_ТранспортныеСредства.РегНомер,
	|	КонтурЛогистика_ТранспортныеСредства.ТипТС,
	|	КонтурЛогистика_ТранспортныеСредства.МаркаТС,
	|	КонтурЛогистика_ТранспортныеСредства.МодельТС,
	|	КонтурЛогистика_ТранспортныеСредства.ВместимостьКубМ,
	|	КонтурЛогистика_ТранспортныеСредства.ГрузоподъемностьТонн,
	|	КонтурЛогистика_ТранспортныеСредства.ВидВладения,
	|	КонтурЛогистика_ТранспортныеСредства.ДоговорАрендаЛизинг
	|ИЗ
	|	Справочник.КонтурЛогистика_ТранспортныеСредства КАК КонтурЛогистика_ТранспортныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТранспортныеСредства КАК ВТ_ТранспортныеСредства
	|		ПО КонтурЛогистика_ТранспортныеСредства.Ссылка = ВТ_ТранспортныеСредства.ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул1.ДогОргПрвз КАК Договор
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|ГДЕ
	|	ВТ_ЭЗЗ.Титул1.ДогОргПрвз <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Договоры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул1.ОснДовОргСост
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|ГДЕ
	|	ВТ_ЭЗЗ.Титул1.ОснДовОргСост <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Договоры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул2.ОснДовОргСост
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|ГДЕ
	|	ВТ_ЭЗЗ.Титул2.ОснДовОргСост <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Договоры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТранспортныеСредства.ТранспортноеСредство.ДоговорАрендаЛизинг
	|ИЗ
	|	ВТ_ТранспортныеСредства КАК ВТ_ТранспортныеСредства
	|ГДЕ
	|	ВТ_ТранспортныеСредства.ТранспортноеСредство.ДоговорАрендаЛизинг <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Договоры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_Договоры.Ссылка КАК Договор,
	|	КонтурЛогистика_Договоры.Наименование,
	|	КонтурЛогистика_Договоры.НомерДокумента,
	|	КонтурЛогистика_Договоры.ДатаДокумента
	|ИЗ
	|	Справочник.КонтурЛогистика_Договоры КАК КонтурЛогистика_Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Договоры КАК ВТ_Договоры
	|		ПО КонтурЛогистика_Договоры.Ссылка = ВТ_Договоры.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул1.ПунктПод КАК ПунктМаршрута
	|ПОМЕСТИТЬ ВТ_ПунктыМаршрута
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗЗ_Титул1АдрПункт.ПунктМаршрута
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЗЗ_Титул1.АдрПункт КАК КонтурЛогистика_ЗЗ_Титул1АдрПункт
	|		ПО ВТ_ЭЗЗ.Титул1 = КонтурЛогистика_ЗЗ_Титул1АдрПункт.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПунктыМаршрута.Ссылка КАК ПунктМаршрута,
	|	КонтурЛогистика_ПунктыМаршрута.АдресИндекс,
	|	КонтурЛогистика_ПунктыМаршрута.АдресКодРегион,
	|	КонтурЛогистика_ПунктыМаршрута.АдресИнфАдрес,
	|	КонтурЛогистика_ПунктыМаршрута.АдресИнфКодСтраны,
	|	КонтурЛогистика_ПунктыМаршрута.АдресГород,
	|	КонтурЛогистика_ПунктыМаршрута.АдресНаселПункт,
	|	КонтурЛогистика_ПунктыМаршрута.АдресУлица,
	|	КонтурЛогистика_ПунктыМаршрута.АдресРайон,
	|	КонтурЛогистика_ПунктыМаршрута.АдресДом,
	|	КонтурЛогистика_ПунктыМаршрута.АдресКорпус,
	|	КонтурЛогистика_ПунктыМаршрута.АдресКварт,
	|	КонтурЛогистика_ПунктыМаршрута.Собственник.ИНН
	|ИЗ
	|	Справочник.КонтурЛогистика_ПунктыМаршрута КАК КонтурЛогистика_ПунктыМаршрута
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПунктыМаршрута КАК ВТ_ПунктыМаршрута
	|		ПО КонтурЛогистика_ПунктыМаршрута.Ссылка = ВТ_ПунктыМаршрута.ПунктМаршрута
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул1,
	|	ВТ_ЭЗЗ.Титул1.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЭЗЗ.Титул2.Титул1,
	|	ВТ_ЭЗЗ.Титул2.ДокументОснование
	|ИЗ
	|	ВТ_ЭЗЗ КАК ВТ_ЭЗЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ТранспортныеСредства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Договоры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПунктыМаршрута";
	
	Запрос.УстановитьПараметр("МассивДокументовЭЗЗ", МассивДокументовЭЗЗ);
			
	Пакеты = Запрос.ВыполнитьПакет();
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Шапка", Пакеты[1].Выбрать());
	ДанныеПечати.Вставить("СвЛицГО", Пакеты[2].Выгрузить());
	ДанныеПечати.Вставить("АдрПункт", Пакеты[3].Выгрузить());
	ДанныеПечати.Вставить("ПромПункт", Пакеты[4].Выгрузить());
	ДанныеПечати.Вставить("Товары", Пакеты[5].Выгрузить());
	ДанныеПечати.Вставить("ОпасныеГрузы", Пакеты[6].Выгрузить());
	ДанныеПечати.Вставить("ИнфПолТ1", Пакеты[7].Выгрузить());
	ДанныеПечати.Вставить("Водители", Пакеты[8].Выгрузить());
	ДанныеПечати.Вставить("Прицепы", Пакеты[9].Выгрузить());
	ДанныеПечати.Вставить("СпецРазрешения", Пакеты[10].Выгрузить());
	ДанныеПечати.Вставить("ИнфПолТ2", Пакеты[11].Выгрузить());
	ДанныеПечати.Вставить("ДанныеПодписания", Пакеты[12].Выгрузить());
	ДанныеПечати.Вставить("ВыборкаОрганизации", Пакеты[14].Выбрать());
	ДанныеПечати.Вставить("ДанныеСотрудников", Пакеты[16].Выгрузить());
	ДанныеПечати.Вставить("ДанныеТС", Пакеты[18].Выгрузить());
	ДанныеПечати.Вставить("ДанныеДоговоров", Пакеты[20].Выгрузить());
	ДанныеПечати.Вставить("ДанныеПунктов", Пакеты[22].Выгрузить());
	ДанныеПечати.Вставить("ДокументыОснования", Пакеты[23].Выгрузить());
	
	Возврат ДанныеПечати;
	
КонецФункции
	

#КонецЕсли