///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ОнлайнЗаказы".
// ОбщийМодуль.ОнлайнЗаказыСлужебный.
//
// Серверные процедуры настройки и выполнения обмена данными с онлайн-заказами:
//  - настройка использования подключения к онлайн-заказам;
//  - проверка доступности функциональности на основании ролей пользователя;
//  - инициализация параметров подключения;
//  - обработчики интеграции с Библиотекой стандартных подсистем;
//  - обработчики интеграции с Библиотекой технологии сервиса;
//  - подготовка и обработка ответов сервиса;
//  - обработка ошибок сервиса;
//  - формирование и настройка шаблонов сообщений;
//  - алгоритмы настройки формы "Интернет-поддержка и сервисы".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ИнтеграцияСБиблиотекойСтандартныхПодсистем

#Область БСПБазоваяФункциональность

// Интеграция с подсистемой СтандартныеПодсистемы.БазоваяФункциональность.
//
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	
	НовыеРазрешения = Новый Массив;
	МодульРаботаВБезопасномРежиме = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
	
	Разрешение = МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTPS",
		ОнлайнЗаказыКлиентСервер.ХостСервисаОбменаДанными(),
		443,
		НСтр("ru = 'Сервис онлайн-заказов'"));
	НовыеРазрешения.Добавить(Разрешение);
	
	ЗапросыРазрешений.Добавить(МодульРаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(НовыеРазрешения));
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
//
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("АктивироватьЗаказСПодготовкойВложений", Истина);
	Методы.Вставить("АктуализироватьURLShare", Истина);
	Методы.Вставить("ВключитьНастройкуПодключения", Истина);
	Методы.Вставить("ДеактивироватьЗаказ", Истина);
	Методы.Вставить("ЗагрузкаСтатусовОнлайнЗаказов", Истина);
	Методы.Вставить("НоваяНастройкаПодключения", Истина);
	Методы.Вставить("НовыйЗаказ", Истина);
	Методы.Вставить("ОбновитьЗаказСВложениями", Истина);
	Методы.Вставить("ОбновитьНастройку", Истина);
	Методы.Вставить("ОбновитьНастройкуСОтзывомТокенов", Истина);
	Методы.Вставить("ОбновитьНастройкуСРевизиейТокенов", Истина);
	Методы.Вставить("ОбновитьПризнакиИспользованияНастроекОплатФискализации");
	Методы.Вставить("ОбновлениеНастроекПодключения", Истина);
	Методы.Вставить("ОтозватьНеиспользуемыеТокеныНастройкиПодключения", Истина);
	Методы.Вставить("ОтправитьВложения", Истина);
	Методы.Вставить("ПривязатьНастройкуПлатежнойСистемы", Истина);
	Методы.Вставить("СтатусЗаказа", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область БСППодключаемыеКоманды

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.
//
Процедура ПриОпределенииКомандПодключенныхКОбъекту(
		НастройкиФормы,
		Источники,
		ПодключенныеОтчетыИОбработки,
		Команды) Экспорт
	
	Если Не ОнлайнЗаказыДоступны() Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиПодключаемыхКоманд = НастройкиПодключаемыхКоманд();
	
	ТипыОбъектов = Новый Массив;
	Для Каждого ПолноеИмя Из НастройкиПодключаемыхКоманд.ИменаОснованийЗаказа Цикл
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
		ТипыОбъектов.Добавить(ТипЗнч(Менеджер.ПустаяСсылка()));
	КонецЦикла;
	Если Не ЗначениеЗаполнено(ТипыОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ТипПараметра = Новый ОписаниеТипов(ТипыОбъектов);
	
	ПараметрыКоманды = НастройкиПодключаемыхКоманд.ПараметрыКоманды;
	
	Команда = Команды.Добавить();
	Если ЗначениеЗаполнено(ПараметрыКоманды.Вид) Тогда
		Команда.Вид = ПараметрыКоманды.Вид;
	Иначе
		Команда.Вид = "ОнлайнЗаказы";
	КонецЕсли;
	Команда.Идентификатор = "ОнлайнЗаказы";
	Если ЗначениеЗаполнено(ПараметрыКоманды.Представление) Тогда
		Команда.Представление = ПараметрыКоманды.Представление;
	Иначе
		Команда.Представление = НСтр("ru = 'Онлайн-заказ'");
	КонецЕсли;
	Команда.Важность = "Обычное";
	Команда.Порядок = 52;
	Команда.ОтображениеКнопки = ОтображениеКнопки.Картинка;
	Если ЗначениеЗаполнено(ПараметрыКоманды.Картинка) Тогда
		Команда.Картинка = ПараметрыКоманды.Картинка;
	Иначе
		Команда.Картинка = БиблиотекаКартинок.ЛоготипОнлайнЗаказы;
	КонецЕсли;
	Команда.ТипПараметра = ТипПараметра;
	Команда.Назначение = ПараметрыКоманды.Назначение;
	Команда.ИзменяетВыбранныеОбъекты = Ложь;
	Команда.МножественныйВыбор = Ложь;
	Команда.РежимЗаписи = "Записывать";
	Команда.Обработчик = "ОнлайнЗаказыКлиент.Подключаемый_ОткрытьФормуURLЗаказа";
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд.
//
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	Вид = ВидыПодключаемыхКоманд.Добавить();
	Вид.Имя = "ОнлайнЗаказы";
	Вид.ИмяПодменю = "ПодменюОнлайнЗаказы";
	Вид.Заголовок = НСтр("ru = 'Онлайн-заказ'");
	Вид.Картинка = БиблиотекаКартинок.ЛоготипОнлайнЗаказы;
	Вид.Отображение = ОтображениеКнопки.Картинка;
	Вид.ВидГруппыФормы = ВидГруппыФормы.Подменю;
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииСоставаНастроекПодключаемыхОбъектов.
//
Процедура ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса) Экспорт
	
	Настройка = НастройкиПрограммногоИнтерфейса.Добавить();
	Настройка.Ключ = "ДобавитьКомандыОнлайнЗаказы";
	Настройка.ОписаниеТипов = Новый ОписаниеТипов("Булево");
	Настройка.ВидыПодключаемыхОбъектов = "Отчет, Обработка";
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "2.8.4.25";
	Обработчик.Процедура           = "ОнлайнЗаказыСлужебный.ОбновитьПризнакиИспользованияНастроекОплатФискализации";
	Обработчик.ОбщиеДанные         = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.Комментарий         = НСтр("ru='Установка признака использования оплат в настройках подключения'");
	Обработчик.РежимВыполнения     = "Отложенно";
	Обработчик.БлокируемыеОбъекты  = "Справочник.НастройкиПодключенияКОнлайнЗаказам.ФормаЭлемента";
	Обработчик.ПроцедураПроверки   = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Идентификатор       = Новый УникальныйИдентификатор("c9f2d6e8-a1cf-4040-a225-01b1c41557c0");
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
//
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Справочник.НастройкиПодключенияКОнлайнЗаказам.Чтение.Организации
	|Справочник.НастройкиПодключенияКОнлайнЗаказам.Изменение.Организации
	|РегистрСведений.ИдентификаторыОнлайнЗаказов.Чтение.Организации
	|РегистрСведений.ИдентификаторыОнлайнЗаказов.Изменение.Организации
	|";
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.НастройкиПодключенияКОнлайнЗаказам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ИдентификаторыОнлайнЗаказов, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ТехнологияСервисаОчередьЗаданий

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(
		Метаданные.РегламентныеЗадания.ЗагрузкаСтатусовОнлайнЗаказов.ИмяМетода);
	
КонецПроцедуры

#КонецОбласти

#Область БазоваяФункциональностьБИП

// Вызывается при изменении логина и пароля пользователя ИПП в
// информационной базе из всех контекстов использования библиотеки.
//
Процедура ПриИзмененииДанныхАутентификации(Логин) Экспорт
	
	Если ЗначениеЗаполнено(Логин) Тогда
		Если Справочники.НастройкиПодключенияКОнлайнЗаказам.ЕстьНастройкиПодключения() Тогда
			ДобавитьЗаданиеЗагрузкаСтатусовЗаказов();
		КонецЕсли;
	Иначе
		УдалитьЗаданияЗагрузкаСтатусовЗаказов();
	КонецЕсли;
	
КонецПроцедуры

// Заполняет описание используемых в подсистеме хостов сервисов Интернет-поддержки.
//
// Параметры:
//  ХостыСервисовИнтернетПоддержки - Соответствие - хост и название используемого сервиса.
//
Процедура ПриЗаполненииХостовСервисовИнтернетПоддержки(
		ХостыСервисовИнтернетПоддержки) Экспорт
	
	ХостыСервисовИнтернетПоддержки.Вставить(
		ОнлайнЗаказыКлиентСервер.ХостСервисаОбменаДанными(),
		НСтр("ru = 'Онлайн-заказы'"));
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиПрограммы

// Возвращает параметры окружения панели администрирования БИП.
//
// Возвращаемое значение:
//  Структура:
//    * ОнлайнЗаказыДоступны - Булево
//    * НастройкаОнлайнЗаказовДоступна - Булево
//
Функция ПараметрыОкруженияФормыИнтернетПоддержкаИСервисы() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ОнлайнЗаказыДоступны", ОнлайнЗаказы.ОнлайнЗаказыДоступны());
	Результат.Вставить("НастройкаОнлайнЗаказовДоступна", ОнлайнЗаказы.НастройкаОнлайнЗаказовДоступна());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НастройкиПодключения

// Возвращает признак существования настроек подключения, в которых указана переданная настройка подключения.
//
// Параметры:
//  НастройкаОплаты - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей,
//    СправочникСсылка.НастройкиПодключенияКИнтернетЭквайрингу,
//    СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - искомая настройка подключения.
//
// Возвращаемое значение:
//  Булево - признак наличия настроек.
//
Функция СуществуютНастройкиПоНастройкеОплаты(НастройкаОплаты) Экспорт
	
	Возврат Справочники.НастройкиПодключенияКОнлайнЗаказам.СуществуютНастройкиПоНастройкеОплаты(
		НастройкаОплаты);
	
КонецФункции

// Определяет перечень введенных настроек онлайн-заказов по переданной настройке оплаты и организации.
//
// Параметры:
//  НастройкаОплаты - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей,
//    СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей - настройка подключения к платежной системе.
//  Организация - ОпределяемыйТип.Организация, Неопределено - Организация по которой выполняется запрос,
//    Неопределено если отбор по организации не нужен.
//  БезОшибокСинхронизации - Булево - В случае Истина будут отобраны настройки без ошибок в синхронизации,
//    в случае Ложь отбор не накладывается.
//
// Возвращаемое значение:
//  Массив Из Справочник.НастройкиПодключенияКОнлайнЗаказам - перечень настроек.
//
Функция НастройкиПодключенияПоНастройкеОплаты(НастройкаОплаты, Организация, БезОшибокСинхронизации) Экспорт
	
	Возврат Справочники.НастройкиПодключенияКОнлайнЗаказам.НастройкиПодключенияПоНастройкеОплаты(
		НастройкаОплаты,
		Организация,
		БезОшибокСинхронизации);
		
КонецФункции

// Возвращает признак существования настроек онлайн-заказов с заполненными зависимыми настройками.
//
// Возвращаемое значение:
//  Булево - признак заполненности зависимых настроек (способов оплат, облачная касса).
//
Функция ЕстьЗаполненныеЗависимыеНастройки() Экспорт
	
	Возврат Справочники.НастройкиПодключенияКОнлайнЗаказам.ЕстьЗаполненныеЗависимыеНастройки();
	
КонецФункции

// Выполняет привязку настройки подключение к платежным система к настройке подключения к Онлайн-заказам.
// Если у настройки Онлайн-заказов уже используется настройка подключения такого же типа, то она будет заменена.
// 
// Параметры:
//  НастройкаОнлайнЗаказов - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - настройка подключения к
//    Онлайн-заказам, к которой нужно добавить новую настройку подключения.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей,
//    СправочникСсылка.НастройкиПодключенияКИнтернетЭквайрингу,
//    СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к платежной системе, которую
//      нужно добавить в настройку подключения к Онлайн-заказам.
//  ПлатежныйСервис - Строка - идентификатор платежного сервиса. Доступные значения определены в методе
//                             СпособОплатыПоИдентификатору.
//                  - ПеречислениеСсылка.ПлатежныеСервисы - для подсистемы ПлатежныеСервисы.
//                  - Неопределено - платежный сервис будет определен на основе параметра НастройкаПодключения.
//  
// Возвращаемое значение:
//  См. НовыйРезультатОперации.
//
Функция ПривязатьНастройкуПлатежнойСистемы(
		НастройкаОнлайнЗаказов,
		НастройкаПодключения,
		ПлатежныйСервис = Неопределено) Экспорт
	
	Результат = НовыйРезультатОперации();
		
	Если Не ЗначениеЗаполнено(НастройкаОнлайнЗаказов) Тогда
		Результат.КодОшибки = КодОшибкиНеверныйФорматЗапроса();
		Результат.СообщениеОбОшибке = НСтр("ru = 'Не указана настройка подключения к Онлайн-заказам.'");
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Результат.КодОшибки = КодОшибкиНеверныйФорматЗапроса();
		Результат.СообщениеОбОшибке = НСтр("ru = 'Не указана настройка подключения к платежной системе.'");
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	СпособОплаты = СпособОплатыПоНастройке(ПлатежныйСервис, НастройкаПодключения);
	
	Если Не ЗначениеЗаполнено(СпособОплаты) Тогда
		Результат.КодОшибки = КодОшибкиНеверныйФорматЗапроса();
		Результат.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось определить способ оплаты:
				|Настройка подключения - %1
				|Платежный сервис - %2'"),
			НастройкаПодключения,
			ПлатежныйСервис);
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиПодключенияКОнлайнЗаказам");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", НастройкаОнлайнЗаказов);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		НастройкаОнлайнЗаказовОбъект = НастройкаОнлайнЗаказов.ПолучитьОбъект();
		НастройкаОнлайнЗаказовОбъект.Заблокировать();
		НастройкаОнлайнЗаказовОбъект.Используется = Истина;
		
		Отбор = Новый Структура;
		Отбор.Вставить("СпособОплаты", СпособОплаты);
		
		УдаленнаяНастройкаОплаты = Новый Структура;
		
		НайденныеЗначения = НастройкаОнлайнЗаказовОбъект.НастройкиОплаты.НайтиСтроки(Отбор);
		
		Для Каждого НайденноеЗначение Из НайденныеЗначения Цикл
			УдаленнаяНастройкаОплаты.Вставить("СпособОплаты", НайденноеЗначение.СпособОплаты);
			УдаленнаяНастройкаОплаты.Вставить("НастройкаПодключения", НайденноеЗначение.НастройкаПодключения);
			НастройкаОнлайнЗаказовОбъект.НастройкиОплаты.Удалить(НайденноеЗначение);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(УдаленнаяНастройкаОплаты) Тогда
			РезультатОтзыва = ОтозватьТокенНастройкиПодключения(
				ИдентификаторВидаТокенаПриемОплат(),
				УдаленнаяНастройкаОплаты.НастройкаПодключения,
				УдаленнаяНастройкаОплаты.СпособОплаты);
				
			Если ЗначениеЗаполнено(РезультатОтзыва.КодОшибки) Тогда
				ВызватьИсключение НСтр("ru = 'Не удалось отозвать существующий токен.'");
			КонецЕсли;
		КонецЕсли;
		
		НастройкаОплаты = НастройкаОнлайнЗаказовОбъект.НастройкиОплаты.Добавить();
		НастройкаОплаты.СпособОплаты = СпособОплаты;
		НастройкаОплаты.НастройкаПодключения = НастройкаПодключения;
		
		НастройкаОнлайнЗаказовОбъект.Записать();
		
		РезультатОбновления = ОбновитьНастройку(НастройкаОнлайнЗаказов);
		
		Если ЗначениеЗаполнено(РезультатОбновления.КодОшибки) Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось обновить настройку в сервисе.'");
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.КодОшибки = КодОшибкиНеизвестнаяОшибка();
		Результат.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка привязки настроек:
					|%1'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		Возврат Результат;
		
	КонецПопытки;
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#Область ШаблоныСообщений

// См. ШаблоныСообщенийПереопределяемый.ПриПодготовкеШаблонаСообщения.
//
Процедура ПриПодготовкеШаблонаСообщения(
		Реквизиты,
		Вложения,
		НазначениеШаблона,
		ДополнительныеПараметры) Экспорт
	
	Если ПустаяСтрока(НазначениеШаблона) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоДокументОнлайнЗаказов(НазначениеШаблона) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтправкиСообщений = НовыйПараметрыОтправкиСообщений();
	ПриОпределенииПараметровОтправкиСообщений(ПараметрыОтправкиСообщений);
	
	НовыйРеквизит = Реквизиты.Добавить();
	НовыйРеквизит.Имя = "ПредставлениеСсылкиОнлайнЗаказа";
	НовыйРеквизит.Представление = НСтр("ru = 'Ссылка на онлайн-заказ'");
	
	НовыйРеквизит = Реквизиты.Добавить();
	НовыйРеквизит.Имя = "СуммаОнлайнЗаказа";
	НовыйРеквизит.Представление = НСтр("ru = 'Сумма онлайн-заказа'");
	
КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриФормированииСообщения.
//
Процедура ПриФормированииСообщения(
		Сообщение,
		НазначениеШаблона,
		ПредметСообщения,
		ПараметрыШаблона) Экспорт
	
	Если ПустаяСтрока(НазначениеШаблона) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоДокументОнлайнЗаказов(НазначениеШаблона) Тогда
		Возврат;
	КонецЕсли;
	
	Если Сообщение.ЗначенияРеквизитов["СуммаОнлайнЗаказа"] = Неопределено
		И Сообщение.ЗначенияРеквизитов["ПредставлениеСсылкиОнлайнЗаказа"] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСообщения = ДанныеЗаполненияШаблона(
		ПредметСообщения,
		Сообщение);
	
	Если Сообщение.ЗначенияРеквизитов["СуммаОнлайнЗаказа"] <> Неопределено
			И ПараметрыСообщения.СуммаОнлайнЗаказа <> Неопределено Тогда
		Сообщение.ЗначенияРеквизитов["СуммаОнлайнЗаказа"] = ПараметрыСообщения.СуммаОнлайнЗаказа;
	КонецЕсли;
	
	Если ПараметрыСообщения.ПредставлениеСсылкиОнлайнЗаказа <> Неопределено Тогда
		ЗаполнитьПредставлениеСсылки(
			Сообщение,
			ПараметрыШаблона,
			ПараметрыСообщения.ПредставлениеСсылкиОнлайнЗаказа);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтатусыФискализации

// Возвращает статус фискализации "Выполнена".
//
// Возвращаемое значение:
//  Строка - статус.
//
Функция СтатусФискализацииВыполнена() Экспорт
	
	Возврат "Выполнена";
	
КонецФункции

// Возвращает статус фискализации "Выполняется".
//
// Возвращаемое значение:
//  Строка - статус.
//
Функция СтатусФискализацииВыполняется() Экспорт
	
	Возврат "Выполняется";
	
КонецФункции

// Возвращает статус фискализации "Ошибка".
//
// Возвращаемое значение:
//  Строка - статус.
//
Функция СтатусФискализацииОшибка() Экспорт
	
	Возврат "Ошибка";
	
КонецФункции

// Возвращает статус фискализации "ИнициализацияЗапроса".
//
// Возвращаемое значение:
//  Строка - статус.
//
Функция СтатусФискализацииИнициализация() Экспорт
	
	Возврат "Инициализация";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КодыОшибок

// Возвращает код ошибки "ОшибкаДанныхАутентификации".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиДанныеАутентификацииНеЗаполнены() Экспорт
	
	Возврат "ДанныеАутентификацииНеЗаполнены";
	
КонецФункции

#КонецОбласти

#Область ИдентификаторыОпераций

// Возвращает идентификатор операции обновления настройки.
//
// Возвращаемое значение:
//  Строка - идентификатор операции.
//
Функция ИдентификаторОперацииОбновленияНастройки() Экспорт
	
	Возврат "ОбновлениеНастройки";
	
КонецФункции

#КонецОбласти

#Область ИдентификаторыСпособовОплат

// Возвращает идентификатор способа оплаты СБП(b2b).
//
// Возвращаемое значение:
//  Строка - идентификатор операции.
//
Функция ИдентификаторВариантаСБПB2B() Экспорт
	
	Возврат "B2B";
	
КонецФункции

#КонецОбласти

#Область СтатусыОпераций

// Возвращает статус заказа "COMPLETED".
//
// Возвращаемое значение:
//  Строка - код состояния.
//
Функция СтатусЗаказаОплачен() Экспорт
	
	Возврат "COMPLETED";
	
КонецФункции

#КонецОбласти

#Область УправлениеДоступом

// Проверяет права на создание/обновление онлайн-заказов,
// в случае отсутствия прав, вызывается исключение.
//
Процедура СлужебнаяОнлайнЗаказыДоступны()
	
	Если Не ОнлайнЗаказыДоступны() Тогда
		ВызватьИсключение НСтр("ru = 'Нарушение прав доступа. Пользователю запрещена работа с онлайн-заказами.'");
	КонецЕсли;
	
КонецПроцедуры

// Определяет доступность создания/обновления онлайн-заказов
// на основании прав доступа пользователя.
//
// Возвращаемое значение:
//  Булево - если Истина, создание/обновление заказов доступно.
//
Функция ОнлайнЗаказыДоступны() Экспорт
	
	Возврат ПравоДоступа("Чтение", Метаданные.Справочники.НастройкиПодключенияКОнлайнЗаказам)
		И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ИдентификаторыОнлайнЗаказов)
		И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПечатныеФормыОнлайнЗаказов)
		И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ФайлыОнлайнЗаказов);
	
КонецФункции

// Проверяет права на создание/обновление онлайн-заказов
//
// Возвращаемое значение:
//  Булево - если Истина, создание/обновление заказов доступно.
//
Функция НастройкаОнлайнЗаказовДоступна() Экспорт
	
	Возврат ПравоДоступа("Изменение", Метаданные.Справочники.НастройкиПодключенияКОнлайнЗаказам)
		И ПравоДоступа("Добавление", Метаданные.Справочники.НастройкиПодключенияКОнлайнЗаказам);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиРегламентныхЗаданий

// Создает регламентное задание "ЗагрузкаСтатусовОнлайнЗаказов".
//
Процедура ДобавитьЗаданиеЗагрузкаСтатусовЗаказов() Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗагрузкаСтатусовОнлайнЗаказов);
	ЗаданияОбновления = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	
	Если ЗаданияОбновления.Количество() = 0 Тогда
		
		Расписание = Новый РасписаниеРегламентногоЗадания;
		Расписание.ПериодПовтораВТечениеДня = 60 * 60 * 3; // Попытка получения статуса выполняется каждые 3 часа.
		Расписание.ПериодПовтораДней = 1;
		
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Использование", Истина);
		ПараметрыЗадания.Вставить("Метаданные",    Метаданные.РегламентныеЗадания.ЗагрузкаСтатусовОнлайнЗаказов);
		ПараметрыЗадания.Вставить("Расписание",    Расписание);
		ПараметрыЗадания.Вставить("Наименование",  НСтр("ru = 'Загрузка статусов онлайн-заказов'"));
		
		Попытка
			РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
		Исключение
			ИнформацияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписатьИнформациюВЖурналРегистрации(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не удалось создать регламентное задание Загрузка статусов онлайн-заказов по причине:
							|%1'"),
						ИнформацияОбОшибке),
					Истина);
			ВызватьИсключение ИнформацияОбОшибке;
		КонецПопытки;
		
		ЗаписатьИнформациюВЖурналРегистрации(
			НСтр("ru = 'Создано регламентное задание Загрузка статусов онлайн-заказов.'"),
			Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Удаляет все задания "ЗагрузкаСтатусовОнлайнЗаказов".
//
Процедура УдалитьЗаданияЗагрузкаСтатусовЗаказов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗагрузкаСтатусовОнлайнЗаказов);
		Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
		Если Задания.Количество() <> 0 Тогда
			Для каждого Задание Из Задания Цикл
				РегламентныеЗаданияСервер.УдалитьЗадание(Задание);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик регламентного задания "ЗагрузкаСтатусовОнлайнЗаказов".
//
Процедура ЗагрузкаСтатусовОнлайнЗаказов() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ЗагрузкаСтатусовОнлайнЗаказов);
	
	ОбработанныеОперации = АктуализироватьСтатусыЗаказов();
	
	Если ОбработанныеОперации.Количество() <> 0 Тогда
		ЗаписатьИнформациюВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Загружены статусы %1 онлайн-заказов.'"),
				ОбработанныеОперации.Количество()),
				Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// Возвращает полные имена объектов метаданных, которые могут выступать в качестве оснований заказа.
//
// Возвращаемое значение:
//  Структура - настройки подключаемых команд:
//   * ИменаОснованийЗаказа - Массив Из Строка - имена объектов метаданных оснований заказа.
//   * ПараметрыКоманды - Структура - параметры подключаемой команды:
//     ** Представление - Строка - представление команды в форме.
//     ** Картинка - Картинка - Картинка команды.
//
Функция НастройкиПодключаемыхКоманд()
	
	ИменаОснованийЗаказа = Новый Массив;
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Вид", "");
	ПараметрыКоманды.Вставить("Назначение", "ДляОбъекта");
	ПараметрыКоманды.Вставить("Представление", "");
	ПараметрыКоманды.Вставить("Картинка", Неопределено);
	
	ИнтеграцияПодсистемБИП.ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа, ПараметрыКоманды);
	ОнлайнЗаказыПереопределяемый.ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа, ПараметрыКоманды);
	
	Результат = Новый Структура;
	Результат.Вставить("ИменаОснованийЗаказа", ИменаОснованийЗаказа);
	Результат.Вставить("ПараметрыКоманды", ПараметрыКоманды);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработкаЗапросовСервиса

// Формирует настройки подключения для выполнения запросов.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - настройка выполнения операции.
//    настройка выполнения операции.
//
// Возвращаемое значение:
//  Неопределено - Настройки не найдены.
//  Структура - Содержит параметры настройки:
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    настройка подключения к сервису;
//    * ПредставлениеОрганизации - Строка - Представление организации на странице заказа;
//    * Используется - Булево - Признак использования настройки подключения;
//    * НастройкаОблачнойКассы - СправочникСсылка.НастройкиПодключенияКОблачнымКассам -
//      настройка подключения к облачной кассе.
//    * НастройкиОплат - Соответствие Из КлючИЗначение - Содержит данные по способам оплат:
//      ** Ключ - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов - Допустимый способ оплаты заказа;
//      ** Значение - Произвольный - Настройка подключения по способу оплаты.
//    * НастройкиПриемаОплатПоРеквизитам - Структура - настройки приема оплат от физ. лиц:
//      ** ИспользуетсяПриемОплатОтФизЛиц - Булево - настроен прием оплат от физ. лиц;
//      ** ИспользуетсяПриемОплатОтЮрЛиц - Булево - настроен прием оплат от юр. лиц.
//
Функция ПараметрыНастройки(НастройкаПодключения) Экспорт
	
	Возврат Справочники.НастройкиПодключенияКОнлайнЗаказам.ПараметрыНастройки(НастройкаПодключения);
	
КонецФункции

// Восстанавливает значение даты из JSON, если значение не равно Неопределено.
//
// Параметры:
//  Свойство - Строка - имя свойства;
//  Значение - Строка, Неопределено - значение свойства;
//  ДополнительныеПараметры - Структура, Неопределено - параметры восстановления.
//
// Возвращаемое значение:
//  Дата, Неопределено - результат восстановления.
//
Функция ВосстановитьДатуJSON(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	Если Значение <> Неопределено Тогда
		// Свойства с датами необходимо обрабатывать и хранить в формате UTC.
		Результат = ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
		Возврат Результат;
	Иначе
		Возврат Значение;
	КонецЕсли;
	
КонецФункции

// Определяет URL для вызова сервиса Онлайн-заказов.
//
// Параметры:
//  Операция - Строка - путь к ресурсу;
//
// Возвращаемое значение:
//  Строка - URL операции.
//
Функция URLОперацииСервиса(
	Операция,
	БезАвторизации = Ложь) Экспорт
	
	Возврат "https://"
		+ ОнлайнЗаказыКлиентСервер.ХостСервисаОбменаДанными()
		+ "/pm/api/isl/"
		+ ?(
			БезАвторизации,
			"permit-all",
			"authorized")
		+ Операция;
	
КонецФункции

// Определяет URL для вызова сервиса Онлайн-заказов в части работы с файлами.
//
// Параметры:
//  Операция - Строка - путь к ресурсу;
//
// Возвращаемое значение:
//  Строка - URL операции.
//
Функция URLОперацииСервисаПоРаботеСФайлами(Операция) Экспорт
	
	Возврат "https://"
		+ ОнлайнЗаказыКлиентСервер.ХостСервисаОбменаДанными()
		+ "/pm/file-content-api/isl/authorized"
		+ Операция;
	
КонецФункции

// Создает структуру настроек подключения к сервису ОФД.
//
// Возвращаемое значение:
//  Структура - настройки подключения:
//   *НастройкиПроксиСервера - Структура - параметры прокси сервера.
//
Функция ИнициализироватьПараметрыПодключения() Экспорт
	
	Возврат ИнтернетПоддержкаПользователейСлужебныйПовтИсп.ИнициализироватьПараметрыПодключения();
	
КонецФункции

// Возвращает представление статуса заказа по переданному идентификатору из сервиса,
// исключение если переданное значение неизвестно.
//
// Параметры:
//  ИдентификаторСтатуса - Строка - статус заказа переданный из сервиса;
//
// Возвращаемое значение:
//  Строка - идентификатор статуса заказа.
//
Функция ПредставлениеСтатусаЗаказа(ИдентификаторСтатуса)
	
	Если ИдентификаторСтатуса = ОнлайнЗаказыКлиентСервер.СтатусЗаказаВыполняется()
		Или ИдентификаторСтатуса = ОнлайнЗаказыКлиентСервер.СтатусЗаказаВыполняетсяОплата() Тогда
		Возврат "Выполняется";
	ИначеЕсли ИдентификаторСтатуса = ОнлайнЗаказыКлиентСервер.СтатусЗаказаНеАктивен() Тогда
		Возврат "Неактивен";
	ИначеЕсли ИдентификаторСтатуса = ОнлайнЗаказыКлиентСервер.СтатусЗаказаИстекСрокЖизни() Тогда
		Возврат "ИстекСрокЖизни";
	ИначеЕсли ИдентификаторСтатуса = СтатусЗаказаОплачен() Тогда
		Возврат "Оплачен";
	Иначе
		ПредставлениеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Передан неизвестный статус заказа %1'"),
				ИдентификаторСтатуса);
				
		ЗаписатьИнформациюВЖурналРегистрации(
			ПредставлениеОшибки,
			Истина);
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось обработать ответ сервиса. %1 Подробности в журнале регистрации.'"),
			ПредставлениеОшибки);
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область ОбработкаОшибок

// Определяет по коду состояния и коду ошибки сервиса тип ошибки для потребителей.
//
// Параметры:
//  КодСостояния - Число - код состояния ответа сервиса;
//
// Возвращаемое значение:
//  Строка - код ошибки сервиса.
//
Функция ПереопределитьКодОшибкиСервиса(КодСостояния) Экспорт
	
	Если КодСостояния = 200 Тогда
		Возврат "";
	ИначеЕсли КодСостояния = 400
		Или КодСостояния = 404
		Или КодСостояния = 422 Тогда
		Возврат КодОшибкиНеверныйФорматЗапроса();
	ИначеЕсли КодСостояния = 401 Тогда
		Возврат КодОшибкиНеверныйЛогинИлиПароль();
	ИначеЕсли КодСостояния = 403 Тогда
		Возврат КодОшибкиОтсутствуетДоступКСервису();
	ИначеЕсли КодСостояния = 409 Тогда
		Возврат ОнлайнЗаказыКлиентСервер.КодОшибкиНедопустимыйСтатус();
	ИначеЕсли КодСостояния = 429 Тогда
		Возврат "ПревышеноКоличествоПопыток";
	ИначеЕсли КодСостояния = 503 Тогда
		Возврат "СервисВременноНеДоступен";
	ИначеЕсли КодСостояния = 500
		Или КодСостояния = 501
		Или КодСостояния = 502
		Или КодСостояния > 503 Тогда
		Возврат "ОшибкаСервиса";
	ИначеЕсли КодСостояния <= 0 Тогда
		Возврат КодОшибкиОшибкаПодключения();
	Иначе
		Возврат КодОшибкиНеизвестнаяОшибка();
	КонецЕсли;
	
КонецФункции

// Определяет по коду ошибки сообщение пользователю.
//
// Параметры:
//  КодСостояния - Число - код ответа сервиса.
//  КодОшибки - Строка - ошибка сервиса см. функцию ПереопределитьКодОшибкиСервиса.
//  СодержимоеОтвета - Строка, Структура - содержимое ответа сервиса.
//  ИдентификаторОперации - Строка - Идентификатор выполняемой операции.
//
// Возвращаемое значение:
//  Строка - сообщение пользователю.
//
Функция ПереопределитьСообщениеПользователю(
	КодСостояния,
	КодОшибки,
	СодержимоеОтвета = "",
	ИдентификаторОперации = "") Экспорт
	
	Если КодСостояния = -1 Тогда
		Возврат ОбщегоНазначения.ЗапрещенДоступКИнтернетСервисамТекстСообщения();
	ИначеЕсли КодСостояния = -2 Тогда
		Возврат ИнтернетПоддержкаПользователей.ЗапрещенДоступКИнтернетПоддержкеТекст();
	КонецЕсли;
	
	КодОшибкиСервиса = "";
	Если ЗначениеЗаполнено(СодержимоеОтвета) Тогда
		КодОшибкиСервиса = ОпределитьКодОшибкиСервиса(СодержимоеОтвета);
	КонецЕсли;
	
	Если КодОшибки = КодОшибкиНеверныйФорматЗапроса()
		И КодОшибкиСервиса = "BAD_REQUEST" Тогда
		Возврат НСтр("ru = 'Неверный набор параметров или формат запроса к сервису.'");
	ИначеЕсли КодОшибки = КодОшибкиНеверныйФорматЗапроса()
		И КодОшибкиСервиса = "BAD_PAYMENT_GATEWAY_B2B_TOKEN_CHECK" Тогда
		Возврат НСтр("ru = 'Не удалось проверить корректность токена B2B.'");
	ИначеЕсли КодОшибки = КодОшибкиНеверныйФорматЗапроса()
		И КодОшибкиСервиса = "BAD_PAYMENT_GATEWAY_C2B_TOKEN_CHECK" Тогда
		Возврат НСтр("ru = 'Не удалось проверить корректность токена C2B.'");
	ИначеЕсли КодОшибки = КодОшибкиНеверныйФорматЗапроса()
		И КодОшибкиСервиса = "BAD_CLOUD_SALES_REGISTER_TOKEN_CHECK" Тогда
		Возврат НСтр("ru = 'Не удалось проверить корректность токена облачной кассы.'");
	ИначеЕсли КодОшибки = КодОшибкиНеверныйФорматЗапроса()
		И КодОшибкиСервиса = "FISCALIZATION_UNAVAILABLE" Тогда
		Возврат НСтр("ru = 'По указанной настройке облачной кассы фискализация невозможна.'");
	ИначеЕсли КодОшибки = КодОшибкиНеверныйФорматЗапроса()
		И КодОшибкиСервиса = "UNPROCESSABLE" Тогда
		Возврат НСтр("ru = 'Нарушение бизнес-логики.'");
	ИначеЕсли КодОшибки = КодОшибкиНеверныйФорматЗапроса()
		И КодОшибкиСервиса = "NOT_FOUND" Тогда
		Возврат НСтр("ru = 'Объект не найден.'");
	КонецЕсли;
	
	Если КодОшибки = ОнлайнЗаказыКлиентСервер.КодОшибкиНедопустимыйСтатус()
		И КодОшибкиСервиса = "ILLEGAL_ORDER_STATUS" Тогда
		Возврат НСтр("ru = 'Недопустимый статус заказа.'");
	КонецЕсли;
	
	Если КодОшибки = КодОшибкиНеверныйЛогинИлиПароль() Тогда
		Возврат НСтр("ru = 'Ошибка авторизации. Обратитесь к администратору.'");
	КонецЕсли;
	
	Если КодОшибки = "ОшибкаПодключения" Тогда
		Возврат НСтр("ru = 'Не удалось подключиться к сервису.'");
	КонецЕсли;
	
	Если КодОшибки = "ПревышеноКоличествоПопыток"
		И КодОшибкиСервиса = "TOO_MANY_REQUESTS" Тогда
		Возврат НСтр("ru = 'Превышено количество попыток обращения к сервису ОФД с не верными данными авторизации.'")
			+ " "
			+ НСтр("ru = 'Проверьте правильность данных авторизации и повторите попытку через 30 минут.'");
	КонецЕсли;
	
	Если КодОшибки = "ОшибкаСервиса" Тогда
		Возврат НСтр("ru = 'Возникла неизвестная ошибка при подключении к сервису. Повторите попытку позже.'");
	КонецЕсли;
	
	Если КодОшибки = "ОтсутствуетДоступКСервису"
		И КодОшибкиСервиса = "ACCESS_DENIED"
		И ИдентификаторОперации = ИдентификаторОперацииОбновленияНастройки() Тогда
		Возврат НСтр("ru = 'Невозможно обновить данные в сервисе. Настройка связана с другим пользователем интернет-поддержки.'");
	ИначеЕсли КодОшибки = "ОтсутствуетДоступКСервису"
		И КодОшибкиСервиса = "ACCESS_DENIED" Тогда
		Возврат НСтр("ru = 'Ошибка доступа.'");
	ИначеЕсли КодОшибки = "ОтсутствуетДоступКСервису"
		И КодОшибкиСервиса = "PAYMENT_GATEWAY_C2B_TOKEN_OWNER_MISMATCH" Тогда
		Возврат НСтр("ru = 'Не удалось проверить корректность токена C2B. Токен принадлежит другому пользователю интернет-поддержки.'");
	ИначеЕсли КодОшибки = "ОтсутствуетДоступКСервису"
		И КодОшибкиСервиса = "PAYMENT_GATEWAY_B2B_TOKEN_OWNER_MISMATCH" Тогда
		Возврат НСтр("ru = 'Не удалось проверить корректность токена B2B. Токен принадлежит другому пользователю интернет-поддержки.'");
	КонецЕсли;
	
	Возврат НСтр("ru = 'Неизвестная ошибка.'");
	
КонецФункции

// Производит чтение кода ошибки сервиса из тела ответа.
//
// Параметры:
//  ТелоJSON - Строка - тело ответа сервиса.
//
// Возвращаемое значение:
//  Строка - код ошибки сервиса.
//
Функция ОпределитьКодОшибкиСервиса(ТелоJSON)
	
	// Ответ сервиса:
	//
	//  {
	//  "type": "string",
	//  "title": "string",
	//  "status": "string",
	//  "detail": "string",
	//  "instance": "string"
	// }
	
	// Определение ошибки выполняется через попытку, т.к. в случае ошибки сервиса
	// есть вероятность получить не формализованное сообщение.
	Попытка
		ЧтениеОтвета = Новый ЧтениеJSON;
		ЧтениеОтвета.УстановитьСтроку(ТелоJSON);
		Результат = ПрочитатьJSON(ЧтениеОтвета);
		Возврат Результат.type;
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции

// Производит чтение статуса заказа в сервисе в случае ошибки ILLEGAL_ORDER_STATUS из тела ответа.
//
// Параметры:
//  ТелоJSON - Строка - тело ответа сервиса.
//
// Возвращаемое значение:
//  Строка - код ошибки сервиса.
//
Функция ОпределитьСтатусЗаказаВСервисе(ТелоJSON) Экспорт
	
	// Ответ сервиса:
	//
	//  {
	//  "type": "string",
	//  "title": "string",
	//  "status": "string",
	//  "detail": "string",
	//  "instance": "string"
	// }
	
	// Определение ошибки выполняется через попытку, т.к. в случае ошибки сервиса
	// есть вероятность получить не формализованное сообщение.
	Попытка
		ЧтениеОтвета = Новый ЧтениеJSON;
		ЧтениеОтвета.УстановитьСтроку(ТелоJSON);
		Результат = ПрочитатьJSON(ЧтениеОтвета);
		Возврат Результат.data.orderStatus;
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции

// Добавляет запись в журнал регистрации.
//
// Параметры:
//  СообщениеОбОшибке - Строка - комментарий к записи журнала регистрации;
//  Ошибка - Булево - если истина будет установлен уровень журнала регистрации "Ошибка".
//
Процедура ЗаписатьИнформациюВЖурналРегистрации(
		СообщениеОбОшибке,
		Ошибка = Истина) Экспорт
	
	УровеньЖР = ?(Ошибка,
		УровеньЖурналаРегистрации.Ошибка,
		УровеньЖурналаРегистрации.Информация);
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурналаРегистрации(),
		УровеньЖР,
		,
		,
		Лев(СообщениеОбОшибке, 5120));
	
КонецПроцедуры

#КонецОбласти

#Область КодыОшибок

// Возвращает код ошибки "ОшибкаПодключения".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиОшибкаПодключения() Экспорт
	
	Возврат "ОшибкаПодключения";
	
КонецФункции

// Возвращает код ошибки "НеизвестнаяОшибка".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиНеизвестнаяОшибка() Экспорт
	
	Возврат "НеизвестнаяОшибка";
	
КонецФункции

// Возвращает код ошибки "НеверныйФорматЗапроса".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиНеверныйФорматЗапроса() Экспорт
	
	Возврат "НеверныйФорматЗапроса";
	
КонецФункции

// Возвращает код ошибки "ИдентификаторНеНайден".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиИдентификаторНеНайден()
	
	Возврат "ИдентификаторНеНайден";
	
КонецФункции

// Возвращает код ошибки "УжеОплачен".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиУжеОплачен() Экспорт
	
	Возврат "УжеОплачен";
	
КонецФункции

// Возвращает код ошибки "НеверныйЛогинИлиПароль".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиНеверныйЛогинИлиПароль() Экспорт
	
	Возврат "НеверныйЛогинИлиПароль";
	
КонецФункции

// Возвращает код ошибки "ОтсутствуетДоступКСервису".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиОтсутствуетДоступКСервису() Экспорт
	
	Возврат "ОтсутствуетДоступКСервису";
	
КонецФункции

#КонецОбласти

#Область НастройкаПодключения

//См. Справочники.НастройкиПодключенияКОнлайнЗаказам.НоваяНастройкаПодключения
//
Функция НоваяНастройкаПодключения(
		Организация,
		НастройкиОплат,
		НастройкаОблачнойКассы = Неопределено) Экспорт
	
	Если Не НастройкаОнлайнЗаказовДоступна() Тогда
		ВызватьИсключение НСтр("ru = 'Нарушение прав доступа. Пользователю запрещено создание настроек подключения Онлайн-заказов.
			|Обратитесь к администратору.'");
	КонецЕсли;
	
	Возврат Справочники.НастройкиПодключенияКОнлайнЗаказам.НоваяНастройкаПодключения(
		Организация,
		НастройкиОплат,
		НастройкаОблачнойКассы);
	
КонецФункции

//См. Справочники.НастройкиПодключенияКОнлайнЗаказам.ВключитьНастройку
//
Функция ВключитьНастройкуПодключения(НастройкаПодключения) Экспорт
	
	Если Не НастройкаОнлайнЗаказовДоступна() Тогда
		ВызватьИсключение НСтр("ru = 'Нарушение прав доступа. Пользователю запрещено изменение настроек подключения Онлайн-заказов.
			|Обратитесь к администратору.'");
	КонецЕсли;
	
	Возврат Справочники.НастройкиПодключенияКОнлайнЗаказам.ВключитьНастройку(
		НастройкаПодключения);
	
КонецФункции

// Выполняет обновление настройки подключения онлайн-заказов.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - настройка выполнения операции.
//  НастроитьВнешнийВид - Булево - признак обновления внешнего вида страницы в сервисе.
//  РезультатОбработки - Структура - Результат обработки изменения использования настройки оплаты.
//
// Возвращаемое значение:
//  Структура - результат обновления настройки страницы онлайн-заказов:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - получение URL заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "НеверныйЛогинИлиПароль" - некорректный логин/пароль ИПП;
//        - "СервисВременноНеДоступен" - временная недоступность сервиса;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ОбновитьНастройку(
	НастройкаПодключения,
	НастроитьВнешнийВид = Ложь,
	РезультатОбработки = Неопределено) Экспорт
	
	РезультатОперации = НовыйРезультатОперации();
	
	ПараметрыОперации = ПараметрыОперацииОбновленияНастройки(
		НастройкаПодключения,
		НастроитьВнешнийВид,
		РезультатОбработки);
	
	ПроверитьНастройкиСтраницы(ПараметрыОперации.НастройкиСтраницы);
	
	РезультатОбновления = ОнлайнЗаказыСервис.ОбновлениеНастройки(ПараметрыОперации);
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатОбновления);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Справочники.НастройкиПодключенияКОнлайнЗаказам.УстановитьОшибкуСинхронизации(
			НастройкаПодключения,
			Истина);
		Возврат РезультатОперации;
	КонецЕсли;
	
	РезультатОбновленияФайла = ОбновлениеФайлаСтраницы(
		ПараметрыОперации);
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатОбновленияФайла);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Справочники.НастройкиПодключенияКОнлайнЗаказам.УстановитьОшибкуСинхронизации(
			НастройкаПодключения,
			Истина);
	Иначе
		Справочники.НастройкиПодключенияКОнлайнЗаказам.УстановитьОшибкуСинхронизации(
			НастройкаПодключения,
			Ложь);
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

// Выполняет отзыв неиспользуемых токенов подсистемы и обновление настройки подключения онлайн-заказов.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - настройка выполнения операции.
//  НастроитьВнешнийВид - Булево - признак обновления внешнего вида страницы в сервисе.
//  РезультатОбработки - Структура - Результат обработки изменения использования настройки оплаты.
//
// Возвращаемое значение:
//  Структура - результат обновления настройки страницы онлайн-заказов:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - получение URL заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "НеверныйЛогинИлиПароль" - некорректный логин/пароль ИПП;
//        - "СервисВременноНеДоступен" - временная недоступность сервиса;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ОбновитьНастройкуСОтзывомТокенов(
	НастройкаПодключения,
	НеиспользуемыеНастройки,
	НастроитьВнешнийВид = Ложь,
	РезультатОбработки = Неопределено) Экспорт
	
	РезультатОперации = НовыйРезультатОперации();
	
	РезультатОтзываТокенов = ОтозватьНеиспользуемыеТокеныНастройкиПодключения(НеиспользуемыеНастройки);
	
	Если ЗначениеЗаполнено(РезультатОтзываТокенов.КодОшибки) Тогда
		Справочники.НастройкиПодключенияКОнлайнЗаказам.УстановитьОшибкуСинхронизации(
			НастройкаПодключения,
			Истина);
		Возврат РезультатОперации;
	КонецЕсли;
	
	Возврат ОбновитьНастройку(
		НастройкаПодключения,
		НастроитьВнешнийВид,
		РезультатОбработки);
	
КонецФункции

// Выполняет ревизию токенов подсистемы и обновление настройки подключения онлайн-заказов.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - настройка выполнения операции.
//  НастроитьВнешнийВид - Булево - признак обновления внешнего вида страницы в сервисе.
//  РезультатОбработки - Структура - Результат обработки изменения использования настройки оплаты.
//
// Возвращаемое значение:
//  Структура - результат обновления настройки страницы онлайн-заказов:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - получение URL заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "НеверныйЛогинИлиПароль" - некорректный логин/пароль ИПП;
//        - "СервисВременноНеДоступен" - временная недоступность сервиса;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ОбновитьНастройкуСРевизиейТокенов(
	НастройкаПодключения,
	НастроитьВнешнийВид = Ложь,
	РезультатОбработки = Неопределено) Экспорт
	
	РезультатОперации = НовыйРезультатОперации();
	
	РезультатРевизииТокенов = ПровестиРевизиюТокеновСервиса();
	
	Если ЗначениеЗаполнено(РезультатРевизииТокенов.КодОшибки) Тогда
		Справочники.НастройкиПодключенияКОнлайнЗаказам.УстановитьОшибкуСинхронизации(
			НастройкаПодключения,
			Истина);
		Возврат РезультатОперации;
	КонецЕсли;
	
	Возврат ОбновитьНастройку(
		НастройкаПодключения,
		НастроитьВнешнийВид,
		РезультатОбработки);
	
КонецФункции

// Выполняет обновление настроек подключения к онлайн-заказам.
// Параметры:
//  НастройкиПодключения - Массив Из СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам
//
// Возвращаемое значение:
//  Структура - результат обновления настройки страницы онлайн-заказов:
//    * НеобработанныеНастройки - Массив Из СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//      содержит перечень настроек по которым не удалось выполнить обновление настроек в сервисе.
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - получение URL заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "НеверныйЛогинИлиПароль" - некорректный логин/пароль ИПП;
//        - "СервисВременноНеДоступен" - временная недоступность сервиса;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ОбновлениеНастроекПодключения(НастройкиПодключения) Экспорт
	
	РезультатОперации = НовыйРезультатОперации();
	РезультатОперации.Вставить("НеобработанныеНастройки", Новый Массив);
	НеобработанныеНастройки = Новый Массив;
	
	Для Каждого НастройкаПодключения Из НастройкиПодключения Цикл
		
		ПараметрыОперации = ПараметрыОперацииОбновленияНастройки(НастройкаПодключения, Ложь, Неопределено);
		Если Не ПустаяСтрока(ПараметрыОперации.КодОшибки) Тогда
			ЗаполнитьЗначенияСвойств(
				РезультатОперации,
				ПараметрыОперации,
				"КодОшибки, СообщениеОбОшибке, ИнформацияОбОшибке");
			НеобработанныеНастройки.Добавить(НастройкаПодключения);
			Справочники.НастройкиПодключенияКОнлайнЗаказам.УстановитьОшибкуСинхронизации(
				НастройкаПодключения,
				Истина);
			Продолжить;
		КонецЕсли;
		
		РезультатВыполнения = ОнлайнЗаказыСервис.ОбновлениеНастройки(ПараметрыОперации);
		
		Если Не ПустаяСтрока(РезультатВыполнения.КодОшибки) Тогда
			ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатВыполнения);
			НеобработанныеНастройки.Добавить(НастройкаПодключения);
			Справочники.НастройкиПодключенияКОнлайнЗаказам.УстановитьОшибкуСинхронизации(
				НастройкаПодключения,
				Истина);
		Иначе
			Справочники.НастройкиПодключенияКОнлайнЗаказам.УстановитьОшибкуСинхронизации(
				НастройкаПодключения,
				Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатОперации.НеобработанныеНастройки = НеобработанныеНастройки;
	
	Возврат РезультатОперации;
	
КонецФункции

// Выполняет формирование настроек подключения онлайн-заказов для передачи в сервис.
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - настройка подключения,
//    для которой формируются параметры.
//  НастроитьВнешнийВид - Булево - признак создания новой настройки в сервисе.
//  РезультатОбработки - Структура - Результат обработки изменения использования настройки подключения
//    (оплаты или облачной кассы).
//
// Возвращаемое значение:
//  Структура - результат обновления настройки страницы онлайн-заказов:
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - настройка подключения,
//      обновляемая в сервисе;
//    * НастройкиСтраницы - Структура, Неопределено - содержит настройки внешнего вида страницы онлайн-заказов.
//      Неопределено - если не новая настройка.
//    * ТокенСПБc2b - Строка - Токен подключения, используемый для оплаты СБП c2b;
//    * ТокенСПБb2b - Строка - Токен подключения, используемый для оплаты СБП b2b;
//    * ТокенИнтернетЭквайринг - Строка - Токен подключения, используемый для оплаты по карте;
//    * ТокенОзонПэй - Строка - Токен подключения, используемый для оплаты через Озон Пэй;
//    * ТокенОблачнаяКасса - Строка - Токен подключения облачной кассы;
//    * КодОшибки - Строка - строковый код возникшей ошибки;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ПараметрыОперацииОбновленияНастройки(
	НастройкаПодключения,
	НастроитьВнешнийВид,
	РезультатОбработки)
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("НастройкаПодключения", НастройкаПодключения);
	ПараметрыОперации.Вставить("НастройкиСтраницы", Неопределено);
	ПараметрыОперации.Вставить("ТокенСПБc2b", "");
	ПараметрыОперации.Вставить("ТокенСПБb2b", "");
	ПараметрыОперации.Вставить("ТокенИнтернетЭквайринг", "");
	ПараметрыОперации.Вставить("ТокенОзонПэй", "");
	ПараметрыОперации.Вставить("ТокенОблачнаяКасса", "");
	ПараметрыОперации.Вставить("КодОшибки ", "");
	ПараметрыОперации.Вставить("СообщениеОбОшибке ", "");
	ПараметрыОперации.Вставить("ИнформацияОбОшибке ", "");
	
	ЗначенияРеквизитовОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		НастройкаПодключения,
		"Используется,НастройкаПодключенияКОблачнойКассе,Организация");
	
	Если НастроитьВнешнийВид Тогда
		
		НастройкиСтраницы = НовыйНастройкиСтраницы();
		
		ИнтеграцияПодсистемБИП.ПриНастройкеВнешнегоВида(
			ЗначенияРеквизитовОбъекта.Организация,
			НастройкиСтраницы);
		ОнлайнЗаказыПереопределяемый.ПриНастройкеВнешнегоВида(
			ЗначенияРеквизитовОбъекта.Организация,
			НастройкиСтраницы);
		
		ПараметрыОперации.НастройкиСтраницы = НастройкиСтраницы;
		
	КонецЕсли;
	
	// Для неиспользуемой настройки обнуляем токены, нет необходимости их получать.
	Если Не ЗначенияРеквизитовОбъекта.Используется Тогда
		Возврат ПараметрыОперации;
	КонецЕсли;
	
	НастройкиОплат = Справочники.НастройкиПодключенияКОнлайнЗаказам.ИспользуемыеНастройкиОплат(НастройкаПодключения);
	
	Для Каждого НастройкаОплаты Из НастройкиОплат Цикл
		
		ЗаполнитьТокен(
			ПараметрыОперации,
			РезультатОбработки,
			ИдентификаторВидаТокенаПриемОплат(),
			НастройкаОплаты.Значение,
			НастройкаОплаты.Ключ);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ЗначенияРеквизитовОбъекта.НастройкаПодключенияКОблачнойКассе) Тогда
		ЗаполнитьТокен(
			ПараметрыОперации,
			РезультатОбработки,
			ИдентификаторВидаТокенаОблачнаяКасса(),
			ЗначенияРеквизитовОбъекта.НастройкаПодключенияКОблачнойКассе,
			Перечисления.СпособыОплатыОнлайнЗаказов.ПустаяСсылка());
	КонецЕсли;
	
	Возврат ПараметрыОперации;
	
КонецФункции

// Выполняет заполнение токена.
// Параметры:
//  ПараметрыОперации - Структура - результат обновления настройки страницы онлайн-заказов:
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - настройка подключения,
//      обновляемая в сервисе;
//    * ТокенСПБc2b - Строка - Токен подключения, используемый для оплаты СБП c2b;
//    * ТокенСПБb2b - Строка - Токен подключения, используемый для оплаты СБП b2b;
//    * ТокенИнтернетЭквайринг - Строка - Токен подключения, используемый для оплаты по карте;
//    * ТокенОзонПэй - Строка - Токен подключения, используемый для оплаты через Озон Пэй;
//    * ТокенОблачнаяКасса - Строка - Токен подключения облачной кассы;
//    * КодОшибки - Строка - строковый код возникшей ошибки;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//  РезультатОбработки - Структура - Результат обработки изменения использования настройки подключения
//    (оплаты или облачной кассы).
//  ВидТокена - Строка - Вид получаемого токена.
//  НастройкаПодключения - Произвольный - настройка подключения для которой выполняется получение токена.
//  СпособОплаты - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов - способ оплаты для которого выполняется получение токена.
//
Процедура ЗаполнитьТокен(
	ПараметрыОперации,
	РезультатОбработки,
	ВидТокена,
	НастройкаПодключения,
	СпособОплаты)
	
	РезультатОперации = НовыйРезультатОперации();
	РезультатОперации.Вставить("Токен", Неопределено);
	
	Если РезультатОбработки <> Неопределено
		И НастройкаПодключения = РезультатОбработки.НастройкаПодключения Тогда
		
		РезультатОперации.Токен = РезультатОбработки.Токен;
		
	Иначе
		ОнлайнЗаказыСобытия.ПриПолученииТокена(
			РезультатОперации,
			ВидТокена,
			НастройкаПодключения,
			СпособОплаты);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(
			ПараметрыОперации,
			РезультатОперации,
			"КодОшибки, СообщениеОбОшибке, ИнформацияОбОшибке");
		Возврат;
	ИначеЕсли РезультатОперации.Токен = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидТокена = ИдентификаторВидаТокенаОблачнаяКасса() Тогда
		ПараметрыОперации.ТокенОблачнаяКасса = РезультатОперации.Токен;
	ИначеЕсли СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.СБПc2b Тогда
		ПараметрыОперации.ТокенСПБc2b = РезультатОперации.Токен;
	ИначеЕсли СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.СБПb2b Тогда
		ПараметрыОперации.ТокенСПБb2b = РезультатОперации.Токен;
	ИначеЕсли СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.Эквайринг Тогда
		ПараметрыОперации.ТокенИнтернетЭквайринг = РезультатОперации.Токен;
	ИначеЕсли СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.ОзонПэй Тогда
		ПараметрыОперации.ТокенОзонПэй = РезультатОперации.Токен;
	КонецЕсли;
	
КонецПроцедуры

// Выполняет получение URL для перехода к настройке внешнего вида страницы онлайн-заказов.
// Параметры:
// НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
// настройка выполнения операции.
//
// Возвращаемое значение:
//  Структура - результат получения URL:
//    * URLНастройкиПодключения - Строка - URL для перехода к настройке внешнего вида страницы онлайн-заказов.
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - получение URL заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "НеверныйЛогинИлиПароль" - некорректный логин/пароль ИПП;
//        - "СервисВременноНеДоступен" - временная недоступность сервиса;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция URLНастройкиПодключения(НастройкаПодключения) Экспорт
	
	Возврат ОнлайнЗаказыСервис.URLНастройкиПодключения(НастройкаПодключения);
	
КонецФункции

// Выполняет отзыв токена по переданному способу и настройке подключения.
//
// Параметры:
//  ВидТокена - Строка - вид токена.
//  НастройкаПодключения - Произвольный - настройка подключения способа оплаты,
//    по которой осуществляется отзыв токена.
//  СпособОплаты - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов - Способ оплаты для которого получается токен.
//
// Возвращаемое значение:
//  см. ОнлайнЗаказыСлужебный.НовыйРезультатОперации
//
Функция ОтозватьТокенНастройкиПодключения(ВидТокена, НастройкаПодключения, СпособОплаты)
	
	РезультатОперации = НовыйРезультатОперации();
	ОнлайнЗаказыСобытия.ПриОтключенииТокена(
		РезультатОперации,
		ВидТокена,
		НастройкаПодключения,
		СпособОплаты);
	
	Возврат РезультатОперации;
	
КонецФункции

// Выполняет создание/получение токена данных оплат по переданному способу и настройке подключения.
//
// Параметры:
//  НеиспользуемыеНастройки - Массив Из Соответствие - неиспользуемые настройки:
//    * Ключ - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов - Способ оплаты для которого получается токен;
//    * Значение - Произвольный - настройки подключения способа оплаты, по которой осуществляется отзыв токена.
//
// Возвращаемое значение:
//  см. ОнлайнЗаказыСлужебный.НовыйРезультатОперации
//
Функция ОтозватьНеиспользуемыеТокеныНастройкиПодключения(НеиспользуемыеНастройки) Экспорт
	
	РезультатОперации = НовыйРезультатОперации();
	
	Для Каждого НастройкиПоВидуТокена Из НеиспользуемыеНастройки Цикл
		
		Для Каждого НеиспользуемаяНастройка Из НастройкиПоВидуТокена.Значение Цикл
			
			РезультатОтзыва = НовыйРезультатОперации();
			ОнлайнЗаказыСобытия.ПриОтключенииТокена(
				РезультатОтзыва,
				НастройкиПоВидуТокена.Ключ,
				НеиспользуемаяНастройка.Значение,
				НеиспользуемаяНастройка.Ключ);
			
			Если ЗначениеЗаполнено(РезультатОтзыва.СообщениеОбОшибке) Тогда
				РезультатОперации.КодОшибки = "ОшибкаОтзываТокенов";
				РезультатОперации.СообщениеОбОшибке
					= НСтр("ru = 'Возникли ошибки при отзыве токенов. Подробности в журнале регистрации.'");
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат РезультатОперации;
	
КонецФункции

Функция ПровестиРевизиюТокеновСервиса()
	
	РезультатОперации = НовыйРезультатОперации();
	
	ОнлайнЗаказыСобытия.ПриРевизииТокенов(
		РезультатОперации,
		Справочники.НастройкиПодключенияКОнлайнЗаказам.ИспользуемыеНастройки());
		
	Возврат РезультатОперации;
	
КонецФункции

// Формирует новое описание настроек страницы онлайн-заказов
//
// Возвращаемое значение:
//  Структура - описание настроек страницы:
//    * ЦветФона - Строка - цвет фона страницы в формате HEX.
//    * ЦветПлашки - Строка - цвет плашки на странице в формате HEX.
//    * ЦветШрифта - Строка - цвет шрифтов на странице в формате HEX.
//    * ПоказыватьСостав - Булево - признак отображения товарного наполнения на странице заказа.
//    * КонтактнаяИнформация - Структура - содержит контактную информацию предприятия:
//      ** Адрес - Строка - адрес предприятия, отображаемый на странице заказа.
//      ** ВремяРаботы - Строка - время работы предприятия, отображаемое на странице заказа.
//      ** ЭлектроннаяПочта - Массив из Строка - перечень электронной почты предприятия, отображаемый на странице заказа.
//      ** НомераТелефонов - Массив из Строка - перечень номеров телефонов предприятия, отображаемый на странице заказа.
//      ** АдресВКонтакте - Строка - адрес ВКонтакте, отображаемый на странице заказа.
//      ** АдресВТелеграме - Строка - адрес в Телеграме, отображаемый на странице заказа.
//      ** АдресВMAX - Строка - адрес в MAX, отображаемый на странице заказа.
//    * Логотип - Структура - данные логотипа
//      ** ДанныеФайла - ДвоичныеДанные - содержит данные логотипа;
//      ** Расширение - Строка - расширение логотипа;
//
Функция НовыйНастройкиСтраницы()
	
	Результат = Новый Структура;
	
	Логотип = Новый Структура;
	Логотип.Вставить("Расширение", "");
	Логотип.Вставить("ДанныеФайла", Неопределено);
	
	КонтактнаяИнформация = Новый Структура;
	КонтактнаяИнформация.Вставить("Адрес", "");
	КонтактнаяИнформация.Вставить("ВремяРаботы", "");
	КонтактнаяИнформация.Вставить("ЭлектроннаяПочта", "");
	КонтактнаяИнформация.Вставить("НомераТелефонов", "");
	КонтактнаяИнформация.Вставить("АдресВКонтакте", "");
	КонтактнаяИнформация.Вставить("АдресВТелеграме", "");
	КонтактнаяИнформация.Вставить("АдресВMAX", "");
	
	Результат.Вставить("ЦветФона", "");
	Результат.Вставить("ЦветПлашки", "");
	Результат.Вставить("ЦветШрифта", "");
	Результат.Вставить("ПоказыватьСостав", Истина);
	Результат.Вставить("КонтактнаяИнформация", КонтактнаяИнформация);
	Результат.Вставить("Логотип", Логотип);
	
	Возврат Результат;
	
КонецФункции

// Выполняет анализ заполненности контактной информации в переданных настройках страницы онлайн-заказов
//
// Параметры:
//  НастройкиСтраницы - Структура - настройки контактной информации страницы:
//    * Адрес - Строка - адрес предприятия, отображаемый на странице заказа.
//    * ВремяРаботы - Строка - время работы предприятия, отображаемое на странице заказа.
//    * ЭлектроннаяПочта - Массив из Строка - перечень электронной почты предприятия, отображаемый на странице заказа.
//    * НомераТелефонов - Массив из Строка - перечень номеров телефонов предприятия, отображаемый на странице заказа.
//    * АдресВКонтакте - Строка - адрес ВКонтакте, отображаемый на странице заказа.
//    * АдресВТелеграме - Строка - адрес ВТелеграме, отображаемый на странице заказа.
//
// Возвращаемое значение:
//  Булево - признак заполненности контактных данных.
//
Функция КонтактныеДанныеСтраницыЗаполнены(НастройкиСтраницы) Экспорт
	
	Если НастройкиСтраницы = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПустаяСтрока(НастройкиСтраницы.Адрес)
		Или Не ПустаяСтрока(НастройкиСтраницы.ВремяРаботы)
		Или Не ПустаяСтрока(НастройкиСтраницы.АдресВКонтакте)
		Или Не ПустаяСтрока(НастройкиСтраницы.АдресВТелеграме) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиСтраницы.ЭлектроннаяПочта)
		Или ЗначениеЗаполнено(НастройкиСтраницы.НомераТелефонов) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Выполняет обновление файла страницы онлайн-заказов.
// Параметры:
//  ПараметрыОперации - Структура - параметры операции
//  ТипФайла - Строка - Идентификатор типа файла
//
// Возвращаемое значение:
//  Структура - результат обновления настройки страницы онлайн-заказов:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - получение URL заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "НеверныйЛогинИлиПароль" - некорректный логин/пароль ИПП;
//        - "СервисВременноНеДоступен" - временная недоступность сервиса;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ОбновлениеФайлаСтраницы(ПараметрыОперации, ТипФайла = "logo")
	
	РезультатОперации = НовыйРезультатОперации();
	
	НастройкиСтраницы = ПараметрыОперации.НастройкиСтраницы;
	
	Если НастройкиСтраницы = Неопределено
		Или Не ЗначениеЗаполнено(НастройкиСтраницы.Логотип.ДанныеФайла) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	ПараметрыОперацииОбновленияФайла = Новый Структура;
	ПараметрыОперацииОбновленияФайла.Вставить(
		"НастройкаПодключения",
		ПараметрыОперации.НастройкаПодключения);
	ПараметрыОперацииОбновленияФайла.Вставить(
		"ДанныеФайла",
		НастройкиСтраницы.Логотип.ДанныеФайла);
	ПараметрыОперацииОбновленияФайла.Вставить(
		"РасширениеФайла",
		НастройкиСтраницы.Логотип.Расширение);
	ПараметрыОперацииОбновленияФайла.Вставить(
		"ТипФайла",
		ТипФайла);
	
	Возврат ОнлайнЗаказыСервис.ОбновлениеФайлаСтраницы(
		ПараметрыОперацииОбновленияФайла);
	
КонецФункции

// Производит валидацию параметров обновления страницы.
//
// Параметры:
//  НастройкиСтраницы - Структура - настройки страницы.
//
Процедура ПроверитьНастройкиСтраницы(НастройкиСтраницы)
	
	Если НастройкиСтраницы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектроннаяПочтаКОтправке = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		НастройкиСтраницы.КонтактнаяИнформация.ЭлектроннаяПочта,
		",");
	
	Для Каждого ЭлектроннаяПочта Из ЭлектроннаяПочтаКОтправке Цикл
		
		Если Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(
			СокрЛП(ЭлектроннаяПочта)) Тогда
			
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Передан невалидный email - %1.'"),
				ЭлектроннаяПочта);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует параметры выбора настройки подключения по способу оплаты.
//
// Параметры:
//  СпособОплаты - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов - Способ оплаты для которого выбирается настройка.
//
// Возвращаемое значение:
//  ФиксированныйМассив - парметры выбора настройки
//
Функция ПараметрыВыбораОплаты(СпособОплаты) Экспорт
	
	ПараметрыВыбораОплаты = Новый Массив;
	ОнлайнЗаказыСобытия.ПриЗаполненииПараметровВыбораНастройкиОплаты(
		ПараметрыВыбораОплаты,
		СпособОплаты);
	Возврат Новый ФиксированныйМассив(ПараметрыВыбораОплаты);
	
КонецФункции

#КонецОбласти

#Область ИдентификаторыВидовТокена

// Возвращает идентификатор вида токена для приема оплат.
//
// Возвращаемое значение:
//  Строка - идентификатор вида токена.
//
Функция ИдентификаторВидаТокенаПриемОплат() Экспорт
	
	Возврат "ПриемОплат";
	
КонецФункции

// Возвращает идентификатор вида токена для облачной кассы.
//
// Возвращаемое значение:
//  Строка - идентификатор вида токена.
//
Функция ИдентификаторВидаТокенаОблачнаяКасса() Экспорт
	
	Возврат "ОблачнаяКасса";
	
КонецФункции

#КонецОбласти

#Область ПодготовкаСсылки

// Возвращает/создает URL онлайн-заказа.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//   являющийся основанием для заказа.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    настройка выполнения операции.
//
// Возвращаемое значение:
//  Структура - результат создания ссылки заказа:
//    * URLЗаказа - Строка - ссылка на онлайн-заказ.
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - получение URL заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "НеверныйЛогинИлиПароль" - некорректный логин/пароль ИПП;
//        - "СервисВременноНеДоступен" - временная недоступность сервиса;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция URLЗаказа(
		ДокументЗаказа,
		НастройкаПодключения) Экспорт
	
	СлужебнаяОнлайнЗаказыДоступны();
	
	РезультатОперации = НовыйРезультатОперации();
	РезультатОперации.Вставить("URLЗаказа", "");
	
	// Подготовка параметров настройки подключения.
	ПараметрыНастройки = ПараметрыНастройки(НастройкаПодключения);
	
	// Проверка общих параметров подключения.
	ПроверитьОбщиеНастройкиПодключения(
		ДокументЗаказа,
		НастройкаПодключения,
		ПараметрыНастройки,
		Истина,
		РезультатОперации);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	ПараметрыСсылки = РегистрыСведений.ИдентификаторыОнлайнЗаказов.ПараметрыСсылкиПоДокументуЗаказа(
		ДокументЗаказа);
	
	Если ЗначениеЗаполнено(ПараметрыСсылки.URLЗаказа) Тогда
		РезультатОперации.URLЗаказа = ПараметрыСсылки.URLЗаказа;
	Иначе
		РезультатСозданияЗаказа = НовыйЗаказ(
			ДокументЗаказа,
			НастройкаПодключения,
			ВложенияПользователяПоУмолчанию(ДокументЗаказа));
		ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатСозданияЗаказа);
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

// Создает новый онлайн-заказ.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//   являющийся основанием для заказа.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    настройка выполнения операции.
//  ДанныеВложений - Структура - см.ОнлайнЗаказыКлиентСервер.НовыйДанныеВложений
//
// Возвращаемое значение:
//  Структура - результат создания ссылки онлайн-заказа:
//    * URLЗаказа - Строка - Ссылка на онлайн-заказ;
//    * СтатусЗаказа - Строка - Текущий статус онлайн-заказа;
//    * СуммаЗаказа - Число - Сумма онлайн-заказа;
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "УжеОплачен" - документ уже оплачен;
//        - "ОтсутствуетДоступКСервису" - у пользователя нет доступа к сервису;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//        - "ИнтеграцияНеИспользуется" - использование отключено в настройках;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора;
//    * ОшибкиВалидацииЗаказа - см. ОшибкиВалидацииЗаказа.
//    * НеобходимоАктуализироватьURLShare - Булево - признак необходимости актуализации URL Share.
//
Функция НовыйЗаказ(
		ДокументЗаказа,
		НастройкаПодключения,
		ДанныеВложений) Экспорт
	
	СлужебнаяОнлайнЗаказыДоступны();
	
	РезультатОперации = НовыйРезультатДанныеЗаказа();
	РезультатОперации.Вставить("ОшибкиВалидацииЗаказа", Новый Массив);
	РезультатОперации.Вставить("НеобходимоАктуализироватьURLShare", Ложь);
	
	// Подготовка параметров настройки подключения.
	ПараметрыНастройки = ПараметрыНастройки(НастройкаПодключения);
	
	// Проверка общих параметров подключения.
	ПроверитьОбщиеНастройкиПодключения(
		ДокументЗаказа,
		НастройкаПодключения,
		ПараметрыНастройки,
		Истина,
		РезультатОперации);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	ДанныеЗаказа = ДанныеЗаказаНаОплатуПоДокументу(
		РезультатОперации,
		ДокументЗаказа,
		ПараметрыНастройки,
		АктуальнаяВерсияКонтрольнойСуммы(),
		Неопределено);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	РезультатОперации.ОшибкиВалидацииЗаказа = ОшибкиВалидацииЗаказа(ДанныеЗаказа);
	
	Если ЗначениеЗаполнено(РезультатОперации.ОшибкиВалидацииЗаказа) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	ИдентификаторЗаказа = РегистрыСведений.ИдентификаторыОнлайнЗаказов.НовыйИдентификаторЗаказа(
		ДокументЗаказа,
		НастройкаПодключения);
	
	ДанныеЗаказа.Вставить("ИдентификаторЗаказа", ИдентификаторЗаказа);
	
	НастройкиОплаты = НастройкиОплаты(
		ПараметрыНастройки.НастройкиОплат,
		ПараметрыНастройки.НастройкиПриемаОплатПоРеквизитам,
		ДанныеЗаказа.ПараметрыОплат,
		ДанныеЗаказа.ОбщиеПараметрыЗаказа.ТипКонтрагента);
	
	Если ДанныеЗаказа.КонтрольнаяСумма = Неопределено Тогда
		ДанныеЗаказа.КонтрольнаяСумма = РассчитатьКонтрольнуюСумму(
			ДанныеЗаказа,
			НастройкиОплаты,
			АктуальнаяВерсияКонтрольнойСуммы());
	КонецЕсли;
	
	// Создание нового заказа на оплату.
	РезультатВызова = ОнлайнЗаказыСервис.СформироватьЗаказ(
		ДанныеЗаказа,
		НастройкаПодключения,
		НастройкиОплаты);
		
	ЗаполнитьЗначенияСвойств(
		РезультатОперации,
		РезультатВызова);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьДанныеЗаказа(
		ДокументЗаказа,
		ДанныеЗаказа,
		РезультатОперации.URLЗаказа,
		НастройкаПодключения,
		РезультатОперации.СтатусЗаказа);
	
	Если ДанныеВложений.ПечатныеФормы.Количество() = 0
		И ДанныеВложений.ПрисоединенныеФайлы.Количество() = 0 Тогда
		
		РезультатАктивации = АктивироватьЗаказ(
			ДокументЗаказа,
			НастройкаПодключения,
			Новый Соответствие);
			
		ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатАктивации);
		
	Иначе
		
		ПараметрыОперации = Новый Структура;
		ПараметрыОперации.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);
		ПараметрыОперации.Вставить("ДокументЗаказа", ДокументЗаказа);
		ПараметрыОперации.Вставить("ПечатныеФормы", ДанныеВложений.ПечатныеФормы);
		ПараметрыОперации.Вставить("ПрисоединенныеФайлы", ДанныеВложений.ПрисоединенныеФайлы);
		
		РезультатОтправки = ОтправитьВложения(ПараметрыОперации);
		
		Если ЗначениеЗаполнено(РезультатОтправки.КодОшибки) Тогда
			РезультатОперации.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибка();
			РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьСтатусЗаказа(
				ПараметрыОперации.ДокументЗаказа,
				РезультатОперации.СтатусЗаказа,
				Неопределено,
				Неопределено,
				Ложь);
		Иначе
			ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатОтправки);
		КонецЕсли;
		
	КонецЕсли;
	
	РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьДанныеЗаказа(
		ДокументЗаказа,
		ДанныеЗаказа,
		РезультатОперации.URLЗаказа,
		НастройкаПодключения,
		РезультатОперации.СтатусЗаказа);
	
	Возврат РезультатОперации;
	
КонецФункции

// Обновляет заказ на оплату.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//   являющийся основанием для заказа.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    настройка выполнения операции.
//
// Возвращаемое значение:
//  Структура - результат создания ссылки онлайн-заказа:
//    * URLЗаказа - Строка - Ссылка на онлайн-заказ;
//    * СтатусЗаказа - Строка - Текущий статус онлайн-заказа;
//    * СуммаЗаказа - Число - Сумма онлайн-заказа;
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "УжеОплачен" - документ уже оплачен;
//        - "ОтсутствуетДоступКСервису" - у пользователя нет доступа к сервису;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//        - "ИнтеграцияНеИспользуется" - использование отключено в настройках;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ОбновитьЗаказ(
		ДокументЗаказа,
		НастройкаПодключения)
	
	СлужебнаяОнлайнЗаказыДоступны();
	
	РезультатОперации = НовыйРезультатДанныеЗаказа();
	РезультатОперации.Вставить("ОшибкиВалидацииЗаказа", Новый Массив);
	
	// Подготовка параметров настройки подключения.
	ПараметрыНастройки = ПараметрыНастройки(НастройкаПодключения);
	
	// Проверка общих параметров подключения.
	ПроверитьОбщиеНастройкиПодключения(
		ДокументЗаказа,
		НастройкаПодключения,
		ПараметрыНастройки,
		Истина,
		РезультатОперации);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	ДанныеЗаказа = ДанныеЗаказаНаОплатуПоДокументу(
		РезультатОперации,
		ДокументЗаказа,
		ПараметрыНастройки,
		АктуальнаяВерсияКонтрольнойСуммы(),
		Неопределено);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	РезультатОперации.ОшибкиВалидацииЗаказа = ОшибкиВалидацииЗаказа(ДанныеЗаказа);
	
	Если ЗначениеЗаполнено(РезультатОперации.ОшибкиВалидацииЗаказа) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	ПараметрыСсылки = РегистрыСведений.ИдентификаторыОнлайнЗаказов.ПараметрыСсылкиПоДокументуЗаказа(
		ДокументЗаказа);
	
	Если Не ЗначениеЗаполнено(ПараметрыСсылки.СтатусЗаказа) Тогда
		Возврат НовыйЗаказ(
			ДокументЗаказа,
			НастройкаПодключения,
			ВложенияПользователяПоУмолчанию(ДокументЗаказа));
	КонецЕсли;
	
	ДанныеЗаказа.Вставить("ИдентификаторЗаказа", ПараметрыСсылки.ИдентификаторЗаказа);
	
	НастройкиОплаты = НастройкиОплаты(
		ПараметрыНастройки.НастройкиОплат,
		ПараметрыНастройки.НастройкиПриемаОплатПоРеквизитам,
		ДанныеЗаказа.ПараметрыОплат,
		ДанныеЗаказа.ОбщиеПараметрыЗаказа.ТипКонтрагента);
	
	Если ДанныеЗаказа.КонтрольнаяСумма = Неопределено Тогда
		ДанныеЗаказа.КонтрольнаяСумма = РассчитатьКонтрольнуюСумму(
			ДанныеЗаказа,
			НастройкиОплаты,
			АктуальнаяВерсияКонтрольнойСуммы());
	КонецЕсли;
	
	РезультатДеактивации = ДеактивироватьЗаказ(ДокументЗаказа);
	
	Если ЗначениеЗаполнено(РезультатДеактивации.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатДеактивации);
		Возврат РезультатОперации;
	КонецЕсли;
	
	// Обновление заказа на оплату.
	РезультатВызова = ОнлайнЗаказыСервис.СформироватьЗаказ(
		ДанныеЗаказа,
		НастройкаПодключения,
		НастройкиОплаты);
		
	ЗаполнитьЗначенияСвойств(
		РезультатОперации,
		РезультатВызова);
	
	РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьДанныеЗаказа(
		ДокументЗаказа,
		ДанныеЗаказа,
		РезультатОперации.URLЗаказа,
		НастройкаПодключения,
		РезультатВызова.СтатусЗаказа);
	
	Возврат РезультатОперации;
	
КонецФункции

// Обновляет заказ на оплату вместе с вложениями.
//
// Параметры:
//   ПараметрыОперации - Структура - параметры операции:
//     * ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//       являющийся основанием для заказа.
//     * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//       настройка выполнения операции.
//
// Возвращаемое значение:
//  Структура - результат создания ссылки онлайн-заказа:
//    * URLЗаказа - Строка - Ссылка на онлайн-заказ;
//    * СтатусЗаказа - Строка - Текущий статус онлайн-заказа;
//    * СуммаЗаказа - Число - Сумма онлайн-заказа;
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "УжеОплачен" - документ уже оплачен;
//        - "ОтсутствуетДоступКСервису" - у пользователя нет доступа к сервису;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//        - "ИнтеграцияНеИспользуется" - использование отключено в настройках;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * НеобходимоАктуализироватьURLShare - Булево - признак необходимости актуализации URL Share.
//
Функция ОбновитьЗаказСВложениями(ПараметрыОперации) Экспорт
	
	СлужебнаяОнлайнЗаказыДоступны();
	
	РезультатОперации = НовыйРезультатДанныеЗаказа();
	РезультатОперации.Вставить("НеобходимоАктуализироватьURLShare", Ложь);
	
	РезультатОбновления = ОбновитьЗаказ(
		ПараметрыОперации.ДокументЗаказа,
		ПараметрыОперации.НастройкаПодключения);
		
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатОбновления);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		
		РезультатОперации.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибка();
		
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьСтатусЗаказа(
			ПараметрыОперации.ДокументЗаказа,
			РезультатОперации.СтатусЗаказа,
			Неопределено,
			Неопределено,
			Ложь);
			
		Возврат РезультатОперации;
		
	КонецЕсли;
	
	РезультатОтправки = ОтправитьВложения(ПараметрыОперации);
	
	Если ЗначениеЗаполнено(РезультатОтправки.КодОшибки) Тогда
		
		РезультатОперации.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибка();
		
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьСтатусЗаказа(
			ПараметрыОперации.ДокументЗаказа,
			РезультатОперации.СтатусЗаказа,
			Неопределено,
			Неопределено,
			Ложь);
			
	Иначе
		
		ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатОтправки);
		
	КонецЕсли;
	
	РезультатОперации.НеобходимоАктуализироватьURLShare =
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.НеобходимаАктуализацияURLShare(
			ПараметрыОперации.ДокументЗаказа);
	
	Возврат РезультатОперации;
	
КонецФункции

// Выполняет проверку статуса заказа в сервисе.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//   являющийся основанием для заказа.
//
// Возвращаемое значение:
//  Структура - результат создания онлайн-заказа:
//    * URLЗаказа - Строка - URL онлайн-заказа.
//    * СуммаЗаказа - Число - Сумма онлайн-заказа.
//    * НеобходимоАктуализировать - Булево - признак необходимости актуализации заказа.
//    * СтатусЗаказа - Строка - текущее состояние ссылки заказа. Возможные значения:
//        - "READY" - заказ активен и доступен к оплате покупателем;
//        - "EXPIRED" - истек срок жизни заказа;
//        - "INACTIVE" - заказ отменен пользователем или истек срок жизни заказа;
//        - "PAYMENT_SESSION_IN_PROGRESS" - начат процесс оплаты покупателем;
//        - "COMPLETED" - покупатель оплатил заказ;
//        - "ERROR" - неконсистентное состояние заказа, рекомендуется выполнить полное обновление;
//        - "SERVICE_ERROR" - не удалось выполнить проверку оплаты из-за ошибки сервиса;
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом:
//        - <Пустая строка> - получение статуса заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "НеверныйЛогинИлиПароль" - некорректный логин/пароль ИПП;
//        - "СервисВременноНеДоступен" - временная недоступность сервиса;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция СтатусЗаказа(ДокументЗаказа) Экспорт
	
	СлужебнаяОнлайнЗаказыДоступны();
	
	РезультатОперации = НовыйРезультатСтатусЗаказа();
	ПараметрыЗаказа = ПараметрыЗаказа(ДокументЗаказа);
	
	Если ПараметрыЗаказа = Неопределено
		Или ПустаяСтрока(ПараметрыЗаказа.ИдентификаторЗаказа) Тогда
		РезультатОперации.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибка();
		РезультатОперации.СообщениеОбОшибке = НСтр("ru = 'Идентификатор заказа по документу не обнаружен.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Идентификатор заказа по документу не обнаружен.'");
		Возврат РезультатОперации;
	КонецЕсли;
	
	Если ПараметрыЗаказа.СтатусЗаказа = СтатусЗаказаОплачен()
		Или ПараметрыЗаказа.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибка() Тогда
		РезультатОперации.СтатусЗаказа = ПараметрыЗаказа.СтатусЗаказа;
		РезультатОперации.СуммаЗаказа = ПараметрыЗаказа.СуммаОплаты;
	ИначеЕсли ПараметрыЗаказа.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаВыполняется()
		Или ПараметрыЗаказа.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаНеАктивен() Тогда
		РезультатОперации = АктуализироватьСтатусЗаказа(ПараметрыЗаказа);
	Иначе
		РезультатОперации.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибкаСервиса();
		РезультатОперации.СообщениеОбОшибке = НСтр("ru = 'Неизвестный статус операции.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Неизвестный статус операции.'");
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

// Актуализирует статус онлайн-заказа в сервисе.
//
// Параметры:
//  ПараметрыЗаказа - Структура - параметры заказа.
//
//
// Возвращаемое значение:
//  Структура - результат создания ссылки онлайн-заказа:
//    * URLЗаказа - Строка - Ссылка на онлайн-заказ;
//    * СтатусЗаказа - Строка - Текущий статус онлайн-заказа;
//    * СуммаЗаказа - Число - Сумма онлайн-заказа;
//    * НеобходимоАктуализировать - Булево - признак необходимости обновления данных в сервисе;
//    * ОшибкиВалидацииЗаказа - Массив из Строка - перечень ошибок валидации онлайн-заказа;
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "НедопустимыйСтатус" - онлайн-заказ находится в недопустимом статусе для выполнения операции;
//        - "ОтсутствуетДоступКСервису" - у пользователя нет доступа к сервису;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//        - "ИнтеграцияНеИспользуется" - использование отключено в настройках;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция АктуализироватьСтатусЗаказа(ПараметрыЗаказа)
	
	СлужебнаяОнлайнЗаказыДоступны();
	
	РезультатОперации = НовыйРезультатСтатусЗаказа();
	РезультатОперации.Вставить("ОшибкиВалидацииЗаказа", Новый Массив);
	
	ИдентификаторыЗаказов = Новый Массив;
	ИдентификаторыЗаказов.Добавить(ПараметрыЗаказа.ИдентификаторЗаказа);
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("НастройкаПодключения", ПараметрыЗаказа.НастройкаПодключения);
	ПараметрыОперации.Вставить("ИдентификаторыЗаказов", ИдентификаторыЗаказов);
	
	РезультатПолучения = ОнлайнЗаказыСервис.ПолучениеИнформацииПоЗаказам(ПараметрыОперации);
	
	Если ЗначениеЗаполнено(РезультатПолучения.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(
			РезультатОперации,
			РезультатПолучения,
			"КодОшибки, СообщениеОбОшибке, ИнформацияОбОшибке");
		РезультатОперации.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибка();
		Возврат РезультатОперации;
	КонецЕсли;
	
	Для Каждого ДанныеЗаказа Из РезультатПолучения.ДанныеЗаказов Цикл
		
		Если ДанныеЗаказа.ИдентификаторЗаказа <> ПараметрыЗаказа.ИдентификаторЗаказа Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатОперации.СтатусЗаказа = ДанныеЗаказа.Статус;
		РезультатОперации.СуммаЗаказа  = ДанныеЗаказа.СуммаЗаказа;
		РезультатОперации.URLЗаказа    = ПараметрыЗаказа.URLЗаказа;
		
		ПараметрыОплаты          = Новый Соответствие;
		ПараметрыНастройкиОплаты = Новый Структура;
		
		Если ДанныеЗаказа.Статус = СтатусЗаказаОплачен() Тогда
			
			ОнлайнЗаказыСобытия.ПриЗаполненииПараметровОплаты(
				ДанныеЗаказа,
				ПараметрыОплаты,
				ПараметрыНастройкиОплаты,
				ПараметрыЗаказа.НастройкаПодключения);
			
			ОнлайнЗаказыСобытия.ПриЗаписиДанныхОплаты(
				ПараметрыЗаказа.ДокументЗаказа,
				ДанныеЗаказа.СпособОплаты,
				ПараметрыОплаты,
				ПараметрыНастройкиОплаты);
			
		КонецЕсли;
		
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьСтатусЗаказа(
			ПараметрыЗаказа.ДокументЗаказа,
			ДанныеЗаказа.Статус,
			НовыйДанныеОплаты(ДанныеЗаказа.СпособОплаты, ДанныеЗаказа.СуммаЗаказа),
			НовыйДанныеФискализации(ДанныеЗаказа.ПараметрыФискализации),
			Ложь);
		
		Если ДанныеЗаказа.Статус = ОнлайнЗаказыКлиентСервер.СтатусЗаказаВыполняется() Тогда
			
			ПараметрыНастройки = ПараметрыНастройки(ПараметрыЗаказа.НастройкаПодключения);
			
			ЗаказНаОплату = ДанныеЗаказаНаОплатуПоДокументу(
				РезультатОперации,
				ПараметрыЗаказа.ДокументЗаказа,
				ПараметрыНастройки,
				ДанныеЗаказа.ВерсияКонтрольнойСуммы,
				Неопределено);
			
			Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
				Возврат РезультатОперации;
			КонецЕсли;
			
			НастройкиОплаты = НастройкиОплаты(
				ПараметрыНастройки.НастройкиОплат,
				ПараметрыНастройки.НастройкиПриемаОплатПоРеквизитам,
				ЗаказНаОплату.ПараметрыОплат,
				ЗаказНаОплату.ОбщиеПараметрыЗаказа.ТипКонтрагента);
				
			Если ЗаказНаОплату.КонтрольнаяСумма = Неопределено Тогда
				Если ДанныеЗаказа.ВерсияКонтрольнойСуммы = "2"
					И Не ЗначениеЗаполнено(ПараметрыНастройки.НастройкаОблачнойКассы) Тогда
					ЗаказНаОплату.КонтрольнаяСумма = РассчитатьКонтрольнуюСумму(
						ЗаказНаОплату,
						НастройкиОплаты,
						"2");
				Иначе
					ЗаказНаОплату.КонтрольнаяСумма = РассчитатьКонтрольнуюСумму(
						ЗаказНаОплату,
						НастройкиОплаты,
						АктуальнаяВерсияКонтрольнойСуммы());
				КонецЕсли;
			КонецЕсли;
			
			Если ЗаказНаОплату.КонтрольнаяСумма.Значение <> ДанныеЗаказа.КонтрольнаяСумма Тогда
				РезультатОперации.НеобходимоАктуализировать = Истина;
			КонецЕсли;
			
			РезультатОперации.НеобходимоАктуализироватьURLShare =
				РегистрыСведений.ИдентификаторыОнлайнЗаказов.НеобходимаАктуализацияURLShare(
					ПараметрыЗаказа.ДокументЗаказа);
			
			РезультатОперации.ОшибкиВалидацииЗаказа = ОшибкиВалидацииЗаказа(ЗаказНаОплату);
			
		ИначеЕсли ДанныеЗаказа.Статус = ОнлайнЗаказыКлиентСервер.СтатусЗаказаИстекСрокЖизни()
				Или ДанныеЗаказа.Статус = СтатусЗаказаОплачен() Тогда
			
			ПриЗагрузкеСтатусаЗаказа(
				ПараметрыЗаказа.ДокументЗаказа,
				ПараметрыОплаты,
				ДанныеЗаказа.ПараметрыФискализации,
				ДанныеЗаказа.Статус,
				"",
				Новый Массив);
			
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
	Если ПустаяСтрока(РезультатОперации.СтатусЗаказа) Тогда
		
		РезультатОперации.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибкаСервиса();
		РезультатОперации.КодОшибки          = КодОшибкиНеизвестнаяОшибка();
		РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Сервис не вернул данные по заказу.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Сервис не вернул данные по заказу.'");
		
		// Сервис не вернул данные по идентификатору заказа, увеличиваем количество попыток.
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.УвеличитьКоличествоПопытокЗапросаСтатуса(
			ПараметрыЗаказа.ДокументЗаказа);
		
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

// Производит валидацию общих параметров оплаты.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//    являющийся основанием для заказа.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - настройка выполнения операции;
//  ПараметрыНастройки - см. ОнлайнЗаказыСлужебный.ПараметрыНастройки
//  ПроверятьИспользованиеНастройки - Булево - Признак проверки использования настройки,
//    Ложь если неиспользуемые настройки допустимы.
//  РезультатОперации  - Структура - результат проверки:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Процедура ПроверитьОбщиеНастройкиПодключения(
		ДокументЗаказа,
		НастройкаПодключения,
		ПараметрыНастройки,
		ПроверятьИспользованиеНастройки,
		РезультатОперации) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументЗаказа) Тогда
		
		РезультатОперации.КодОшибки          = КодОшибкиНеверныйФорматЗапроса();
		РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Документ для выполнения операции не определен. Обратитесь к администратору.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Для выполнения операции необходимо записать документ.'");
		
		ЗаписатьИнформациюВЖурналРегистрации(
			Строка(РезультатОперации.ИнформацияОбОшибке),
			Истина);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыНастройки) Тогда
		
		РезультатОперации.КодОшибки          = КодОшибкиНеверныйФорматЗапроса();
		РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Не удалось определить параметры онлайн-заказов. Обратитесь к администратору.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Не удалось определить параметры онлайн-заказов.'");
		
		ЗаписатьИнформациюВЖурналРегистрации(
			Строка(РезультатОперации.ИнформацияОбОшибке),
			Истина);
		
	ИначеЕсли ПроверятьИспользованиеНастройки И Не ПараметрыНастройки.Используется Тогда
		
		РезультатОперации.КодОшибки          = КодОшибкиНеверныйФорматЗапроса();
		РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Выбрана неиспользуемая настройка онлайн-заказов.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Выбрана неиспользуемая настройка онлайн-заказов.'");
		
		ЗаписатьИнформациюВЖурналРегистрации(
			Строка(РезультатОперации.ИнформацияОбОшибке),
			Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет параметры и доступность функциональности создания заказа на основании переданного документа.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ, по данным которого
//    будет создан новый заказ.
//
// Возвращаемое значение:
//  Структура - результат заполнения параметров:
//    * СозданиеЗаказаДоступно - Булево - признак доступности создания нового заказа.
//    * СообщениеОбОшибке - Строка - текст сообщения ошибки для пользователя.
//    * Организация - ОпределяемыйТип.Организация - организация основания онлайн-заказа.
//    * ИспользуемыеНастройкиПодключения - Массив из СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - перечень
//        настроек допустимых для создания нового заказа по документу.
//    * ОтключенныеНастройкиПодключения - Массив из СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - перечень
//        отключенных настроек.
//    * НастройкаОнлайнЗаказовДоступна - Булево - признак доступности настройки Онлайн-заказов.
//
Функция ПриОпределенииПараметровСозданияЗаказа(ДокументЗаказа) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СозданиеЗаказаДоступно", Истина);
	Результат.Вставить("СообщениеОбОшибке", "");
	Результат.Вставить("Организация", Неопределено);
	
	ИнтеграцияПодсистемБИП.ПриОпределенииПараметровСозданияЗаказа(
		ДокументЗаказа,
		Результат);
	ОнлайнЗаказыПереопределяемый.ПриОпределенииПараметровСозданияЗаказа(
		ДокументЗаказа,
		Результат);
	
	Если Не ЗначениеЗаполнено(Результат.Организация) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнена организация по данным основания заказа.'");
	КонецЕсли;
	
	НастройкиОрганизации = Справочники.НастройкиПодключенияКОнлайнЗаказам.НастройкиОрганизации(
		Результат.Организация);
	
	Результат.Вставить(
		"ИспользуемыеНастройкиПодключения",
		НастройкиОрганизации.ИспользуемыеНастройки);
	
	Результат.Вставить(
		"ОтключенныеНастройкиПодключения",
		НастройкиОрганизации.ОтключенныеНастройки);
	
	Результат.Вставить(
		"НастройкаОнлайнЗаказовДоступна",
		НастройкаОнлайнЗаказовДоступна());
	
	Результат.Вставить(
		"ПользовательскоеСоглашениеПринято",
		Справочники.НастройкиПодключенияКОнлайнЗаказам.ЕстьНастройкиПодключения());
	
	Если Не ОбщегоНазначения.РазрешенДоступКИнтернетСервисам() Тогда
		Результат.СообщениеОбОшибке =
			ОбщегоНазначения.ЗапрещенДоступКИнтернетСервисамТекстСообщения();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает список использованных для создания заказа настроек подключения по документу.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ, по данным которого
//    необходимо получить список настроек.
//
// Возвращаемое значение:
//  СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам, Неопределено -
//  используемая в документе, настройка онлайн-заказов.
//
Функция НастройкаПодключенияПоДокументуЗаказа(ДокументЗаказа) Экспорт
	
	Возврат РегистрыСведений.ИдентификаторыОнлайнЗаказов.НастройкаПодключенияПоДокументуЗаказа(
		ДокументЗаказа);
	
КонецФункции

// Получает данные для определения статуса выполнения онлайн-заказа.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ основание заказа
//  по которому нужно получить статус;
//
// Возвращаемое значение:
//  Структура, Неопределено - параметры заказа, Неопределено, если данные по заказу не найдены.
//
Функция ПараметрыЗаказа(ДокументЗаказа)
	
	Возврат РегистрыСведений.ИдентификаторыОнлайнЗаказов.ПараметрыЗаказа(
		ДокументЗаказа);
	
КонецФункции

// Создает описание результат создания заказа на оплату.
//
// Возвращаемое значение:
//  Структура - результат выполнения операции:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция НовыйРезультатОперации() Экспорт
	
	РезультатОперации = Новый Структура;
	РезультатОперации.Вставить("КодОшибки", "");
	РезультатОперации.Вставить("СообщениеОбОшибке", "");
	РезультатОперации.Вставить("ИнформацияОбОшибке", "");
	
	Возврат РезультатОперации;
	
КонецФункции

// Создает описание результат создания заказа на оплату.
//
// Возвращаемое значение:
//  Структура - результат создания заказа на оплату:
//    * URLЗаказа - Строка - ссылка на заказ в сервисе;
//    * СтатусЗаказа - Строка - текущее состояние  заказа. Возможные значения:
//      - "READY" - заказ активен и доступен к оплате покупателем;
//      - "EXPIRED" - истек срок жизни заказа;
//      - "INACTIVE" - заказ отменен пользователем или истек срок жизни заказа;
//      - "PAYMENT_SESSION_IN_PROGRESS" - начат процесс оплаты покупателем;
//      - "COMPLETED" - покупатель оплатил заказ;
//      - "ERROR" - неконсистентное состояние заказа, рекомендуется выполнить полное обновление;
//      - "SERVICE_ERROR" - не удалось выполнить проверку оплаты из-за ошибки сервиса;
//    * СуммаЗаказа - Число - сумма заказа в сервисе;
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция НовыйРезультатДанныеЗаказа() Экспорт
	
	РезультатОперации = НовыйРезультатОперации();
	РезультатОперации.Вставить("URLЗаказа",    "");
	РезультатОперации.Вставить("СтатусЗаказа", "");
	РезультатОперации.Вставить("СуммаЗаказа",  0);
	
	Возврат РезультатОперации;
	
КонецФункции

// Создает описание результат статуса заказа.
//
// Возвращаемое значение:
//  Структура - результат операции получения статуса заказа:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора;
//    * URLЗаказа - Строка - ссылка на заказ в сервисе;
//    * СтатусЗаказа - Строка - текущее состояние  заказа. Возможные значения:
//      - "READY" - заказ активен и доступен к оплате покупателем;
//      - "EXPIRED" - истек срок жизни заказа;
//      - "INACTIVE" - заказ отменен пользователем или истек срок жизни заказа;
//      - "PAYMENT_SESSION_IN_PROGRESS" - начат процесс оплаты покупателем;
//      - "COMPLETED" - покупатель оплатил заказ;
//      - "ERROR" - неконсистентное состояние заказа, рекомендуется выполнить полное обновление;
//      - "SERVICE_ERROR" - не удалось выполнить проверку оплаты из-за ошибки сервиса;
//    * СуммаЗаказа - Число - сумма заказа в сервисе;
//    * НеобходимоАктуализировать - Булево - признак необходимости актуализации заказа в сервисе;
//    * НеобходимоАктуализироватьURLShare - Булево - признак необходимости актуализации URL Share.
//
Функция НовыйРезультатСтатусЗаказа() Экспорт
	
	РезультатОперации = НовыйРезультатОперации();
	РезультатОперации.Вставить("URLЗаказа",                         "");
	РезультатОперации.Вставить("СтатусЗаказа",                      "");
	РезультатОперации.Вставить("СуммаЗаказа",                       0);
	РезультатОперации.Вставить("НеобходимоАктуализировать",         Ложь);
	РезультатОперации.Вставить("НеобходимоАктуализироватьURLShare", Ложь);
	
	Возврат РезультатОперации;
	
КонецФункции

// Формирует новое описание колонки товаров онлайн-заказа.
//
// Возвращаемое значение:
//  Структура - содержит описание онлайн-заказа:
//    * Идентификатор - Строка - уникальный идентификатор колонки.
//    * Представление - Строка - представление колонки пользователю (шапка табличной части).
//    * ПорядокОтображения - Число - Порядок отображения колонок пользователю, упорядочивание по возрастанию.
//    * Видимость - Булево - признак видимости колонки пользователю.
//
Функция НоваяКолонкаТовары() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор",      "");
	Результат.Вставить("Представление",      "");
	Результат.Вставить("ПорядокОтображения", 0);
	Результат.Вставить("Видимость",          Истина);
	
	Возврат Результат
	
КонецФункции

// Определяет представление основания заказа для отображения пользователю на форме отправки ссылки
// и на странице онлайн-заказа
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ основание заказа,
//  для которого необходимо определить представление.
//
// Возвращаемое значение:
//  Структура - Содержит описание представлений основания заказа:
//    * ПредставлениеОснования - Структура - Содержит описание представлений основания заказа:
//      ** РезультатСклонения - Структура - Содержит данные склонения представления по падежам:
//        *** ИменительныйПадеж - Строка - Представления основания в именительном падеже
//        *** РодительныйПадеж - Строка - Представление Основания в родительном падеже
//        *** ДательныйПадеж - Строка - Представление Основания в дательном падеже
//        *** ВинительныйПадеж - Строка - Представление Основания в винительном падеже
//        *** ТворительныйПадеж - Строка - Представление Основания в творительном падеже
//        *** ПредложныйПадеж - Строка - Представление Основания в винительном падеже
//   * ДанныеОснования - Структура - Содержит описание данных заказа:
//     ** НомерЗаказа - Строка - номер заказа
//
Функция ОписаниеОснования(ДокументЗаказа) Экспорт
	
	ПредставлениеОснования = НовоеОписаниеПредставленияОснования();
	ДанныеОснования = НовыеДанныеОснованияЗаказа();
	
	ИнтеграцияПодсистемБИП.ПриОпределенииПредставленияОснованияЗаказа(
		ДокументЗаказа,
		ПредставлениеОснования,
		ДанныеОснования);
	
	ОнлайнЗаказыПереопределяемый.ПриОпределенииПредставленияОснованияЗаказа(
		ДокументЗаказа,
		ПредставлениеОснования,
		ДанныеОснования);
	
	ПроверитьПредставлениеЗаказа(ПредставлениеОснования);
	
	Результат = Новый Структура;
	Результат.Вставить("ПредставлениеОснования", ПредставлениеОснования);
	Результат.Вставить("ДанныеОснования", ДанныеОснования);
	
	Возврат Результат;
	
КонецФункции

// Выполняет проверку представления основания по падежам.
// 
// Параметры:
//   ПредставлениеОснования - см. НовоеОписаниеПредставленияОснования
//
Процедура ПроверитьПредставлениеЗаказа(ПредставлениеОснования)
	
	ЕстьЗаполненныеПадежи = Ложь;
	ЕстьПустыеПадежи = Ложь;
	
	Для Каждого Падеж Из ПредставлениеОснования.РезультатСклонения Цикл
		Если ПустаяСтрока(Падеж.Значение) Тогда
			ЕстьПустыеПадежи = Истина;
		Иначе
			ЕстьЗаполненныеПадежи = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьЗаполненныеПадежи И ЕстьПустыеПадежи Тогда
		ВызватьИсключение НСтр("ru = 'Обнаружено частичное заполнение результатов склонения в описании представления документа.'");
	ИначеЕсли ЕстьПустыеПадежи Тогда
		ЗаполнитьПредставлениеДокументаПоУмолчанию(ПредставлениеОснования);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет заполнения падежей представления основания данными по умолчанию.
// Параметры:
//   ПредставлениеОснования - см. НовоеОписаниеПредставленияОснования
//
Процедура ЗаполнитьПредставлениеДокументаПоУмолчанию(ПредставлениеОснования)
	
	РезультатСклонения = ПредставлениеОснования.РезультатСклонения;
	РезультатСклонения.ИменительныйПадеж = НСтр("ru = 'заказ'");
	РезультатСклонения.РодительныйПадеж = НСтр("ru = 'заказа'");
	РезультатСклонения.ДательныйПадеж = НСтр("ru = 'заказу'");
	РезультатСклонения.ВинительныйПадеж = НСтр("ru = 'заказ'");
	РезультатСклонения.ТворительныйПадеж = НСтр("ru = 'заказом'");
	РезультатСклонения.ПредложныйПадеж = НСтр("ru = 'заказе'");
	
КонецПроцедуры

// Формирует новое описание таблицы товаров онлайн-заказа.
//
// Параметры:
//  ОписаниеПредставленияТоваров - см. НовоеОписаниеПредставленияТоваров.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит описание таблицы товаров с перечнем обязательных колонок.
//
Функция НовыйОписаниеТаблицыТовары(ОписаниеПредставленияТоваров)
	
	Товары = Новый ТаблицаЗначений;
	
	ОписаниеЧисла = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2, ДопустимыйЗнак.Неотрицательный);
	
	Товары.Колонки.Добавить("ИдентификаторТовара", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Товары.Колонки.Добавить("Наименование",        ОбщегоНазначения.ОписаниеТипаСтрока(200));
	Товары.Колонки.Добавить("СуммаСоСкидкой",      ОписаниеЧисла);
	Товары.Колонки.Добавить("Скидка",              ОписаниеЧисла);
	Товары.Колонки.Добавить("СуммаНДС",            ОписаниеЧисла);
	Товары.Колонки.Добавить(
		"Количество",
		ОбщегоНазначения.ОписаниеТипаЧисло(15, 3, ДопустимыйЗнак.Неотрицательный));
	
	Для Каждого ОписаниеРеквизита Из ОписаниеПредставленияТоваров Цикл
		
		Если Товары.Колонки.Найти(ОписаниеРеквизита.Идентификатор) = Неопределено Тогда
			Товары.Колонки.Добавить(ОписаниеРеквизита.Идентификатор);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Товары;
	
КонецФункции

// Формирует новое описание товара для покупателя.
//
// Возвращаемое значение:
//  Структура - содержит описание онлайн-заказа:
//    * Идентификатор - Строка - уникальный идентификатор предмета расчета.
//    * ДанныеТовара - Массив Из Структура - описывает данные товара отображаемые пользователю.
//
Функция НовоеОписаниеПредставленияТоваров()
	
	КолонкаИдентификаторТовара = НоваяКолонкаТовары();
	КолонкаИдентификаторТовара.Представление = НСтр("ru = 'Идентификатор товара'");
	КолонкаИдентификаторТовара.Идентификатор = "ИдентификаторТовара";
	КолонкаИдентификаторТовара.Видимость = Ложь;
	КолонкаИдентификаторТовара.ПорядокОтображения = 0;
	
	КолонкаНаименование = НоваяКолонкаТовары();
	КолонкаНаименование.Представление = НСтр("ru = 'Наименование'");
	КолонкаНаименование.Идентификатор = "Наименование";
	КолонкаНаименование.ПорядокОтображения = 1;
	
	КолонкаКоличество = НоваяКолонкаТовары();
	КолонкаКоличество.Представление = НСтр("ru = 'Количество'");
	КолонкаКоличество.Идентификатор = "Количество";
	КолонкаКоличество.ПорядокОтображения = 2;
	
	КолонкаСуммаСоСкидкой = НоваяКолонкаТовары();
	КолонкаСуммаСоСкидкой.Представление = НСтр("ru = 'Сумма со скидкой'");
	КолонкаСуммаСоСкидкой.Идентификатор = "СуммаСоСкидкой";
	КолонкаСуммаСоСкидкой.ПорядокОтображения = 3;
	
	КолонкаСкидка = НоваяКолонкаТовары();
	КолонкаСкидка.Представление = НСтр("ru = 'Скидка'");
	КолонкаСкидка.Идентификатор = "Скидка";
	КолонкаСкидка.ПорядокОтображения = 4;
	
	КолонкаСуммаНДС = НоваяКолонкаТовары();
	КолонкаСуммаНДС.Представление = НСтр("ru = 'Сумма НДС'");
	КолонкаСуммаНДС.Идентификатор = "СуммаНДС";
	КолонкаСуммаНДС.ПорядокОтображения = 5;
	
	ВизуализацияТоваров = Новый Массив;
	ВизуализацияТоваров.Добавить(КолонкаИдентификаторТовара);
	ВизуализацияТоваров.Добавить(КолонкаНаименование);
	ВизуализацияТоваров.Добавить(КолонкаКоличество);
	ВизуализацияТоваров.Добавить(КолонкаСуммаСоСкидкой);
	ВизуализацияТоваров.Добавить(КолонкаСкидка);
	ВизуализацияТоваров.Добавить(КолонкаСуммаНДС);
	
	Возврат ВизуализацияТоваров;
	
КонецФункции

// Формирует описание представлений основания заказа:
//
// Возвращаемое значение:
//  Структура - Содержит описание представлений основания заказа:
//    * РезультатСклонения - Структура - Содержит данные склонения представления по падежам:
//      ** ИменительныйПадеж - Строка - Представления основания в именительном падеже
//      ** РодительныйПадеж - Строка - Представление Основания в родительном падеже
//      ** ДательныйПадеж - Строка - Представление Основания в дательном падеже
//      ** ВинительныйПадеж - Строка - Представление Основания в винительном падеже
//      ** ТворительныйПадеж - Строка - Представление Основания в творительном падеже
//      ** ПредложныйПадеж - Строка - Представление Основания в винительном падеже
//
Функция НовоеОписаниеПредставленияОснования()
	
	Результат = Новый Структура;
	
	РезультатСклонения = Новый Структура;
	РезультатСклонения.Вставить("ИменительныйПадеж", "");
	РезультатСклонения.Вставить("РодительныйПадеж", "");
	РезультатСклонения.Вставить("ДательныйПадеж", "");
	РезультатСклонения.Вставить("ВинительныйПадеж", "");
	РезультатСклонения.Вставить("ТворительныйПадеж", "");
	РезультатСклонения.Вставить("ПредложныйПадеж", "");
	
	Результат.Вставить("РезультатСклонения", РезультатСклонения);
	
	Возврат Результат;
	
КонецФункции

// Формирует описание данных основания заказа:
//
// Возвращаемое значение:
//  Структура - Содержит описание представлений основания заказа:
//    * НомерЗаказа - Строка - номер заказа.
//
Функция НовыеДанныеОснованияЗаказа()
	
	Результат = Новый Структура;
	Результат.Вставить("НомерЗаказа", "");
	
	Возврат Результат;
	
КонецФункции

// Формирует новое описание параметров оплат онлайн-заказа.
//
// Возвращаемое значение:
//  Структура - содержит описание параметров оплат онлайн-заказа:
//    * СБП - Структура, Неопределено - Содержит описание параметров оплаты СБП по вариантам сценария,
//         Неопределено, если подсистема не внедрена:
//      **c2b - Структура, Неопределено - Содержит описание параметров оплаты СБП сценарию c2b,
//             Неопределено, если подсистема не внедрена, сценарий не используется
//              или не выбрана настройка подключения:
//        *** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//            настройка подключения к СБП, выбранная для онлайн-заказов.
//        *** НазначениеПлатежа - Строка - информация о платеже, которая будет отображена пользователю
//            в момент сканирования QR-кода в мобильном приложении. Рекомендуется
//            делать строку не длинной и включать информацию об организации, которая
//            является получателем денежных средств, например: Оплата СБП 524,00 RUB ООО Ромашка
//            Если строка не заполнена, будет передано стандартное представление
//            назначения: Оплата СБП {ЗаказНаОплату.ВизуализацияЗаказа.Представление}.
//            Длина строки не должна превышать 140 символов, в противном случае будет
//            обрезана принудительно. Система быстрых платежей имеет дополнительные требования
//            к символам и их кодировке. Возможна передача следующих значений:
//              - символы латинского алфавита (A-Z и a-z) с десятичными кодами из диапазонов
//              [065-090] и [097-122] в кодировке UTF-8;
//              - символы русского алфавита (А-Я и а-я) с десятичными кодами из диапазона
//              [1040-1103] в кодировке UTF-8;
//              - цифры 0-9 с десятичными кодами из диапазона [048-057] в кодировке UTF-8;
//              - специальные символы с десятичными кодами из диапазонов [032-047], [058-064],
//              [091-096], [123-126] в кодировке UTF-8;
//              - символ "№" под номером 8470 в кодировке UTF-8.
//        *** ШаблоныНазначения - см. НастройкиПлатежныхСистемСлужебный.НовыйШаблоныНазначений.
//      ** b2b - Структура, Неопределено - Параметры оплат b2b,
//             Неопределено, если подсистема не внедрена, сценарий не используется
//              или не выбрана настройка подключения:
//        *** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//            настройка подключения к СБП, выбранная для онлайн-заказов.
//        *** ИдентификаторПлатежа - Строка - уникальный Идентификатор Платежа, назначаемый Получателем.
//        *** РасчетныйСчет - Строка - расчетный счет получателя платежа.
//        *** ОблагаетсяНДС - Булево - Признак обложения операции НДС.
//        *** СуммаНДС - Число - Сумма НДС операции.
//        *** ШаблоныНазначения - см. НастройкиПлатежныхСистемСлужебный.НовыйШаблоныНазначений.
//        *** НазначениеПлатежа - Строка - Назначение платежа.
//    * ПоРеквизитам - см. НовыйПараметрыОплатыПоРеквизитам.
//    * ИнтернетЭквайринг - Структура, Неопределено - Параметры оплат через Интернет-эквайринг,
//        Неопределено, если подсистема не внедрена, сценарий не используется
//        или не выбрана настройка подключения.
//      ** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКИнтернетЭквайрингу -
//           настройка подключения к интернет-эквайрингу, выбранная для онлайн-заказов.
//      ** ШаблоныНазначения - см. НастройкиПлатежныхСистемСлужебный.НовыйШаблоныНазначений.
//      ** НазначениеПлатежа - Строка - Назначение платежа.
//    * ОзонПэй - Структура, Неопределено - Параметры оплат через Озон Пэй,
//        Неопределено, если подсистема не внедрена, сценарий не используется
//        или не выбрана настройка подключения
//      ** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам -
//           настройка подключения к Озон Пэй, выбранная для онлайн-заказов.
//      ** ШаблоныНазначения - см. НастройкиПлатежныхСистемСлужебный.НовыйШаблоныНазначений.
//      ** НазначениеПлатежа - Строка - Назначение платежа.
//
Функция ПараметрыОплатЗаказа(ДокументЗаказа, НастройкиОплат)
	
	ПараметрыОплат = Новый Структура;
	ПараметрыОплат.Вставить("СБП", Неопределено);
	ПараметрыОплат.Вставить("ПоРеквизитам", НовыйПараметрыОплатыПоРеквизитам());
	ПараметрыОплат.Вставить("ИнтернетЭквайринг", Неопределено);
	ПараметрыОплат.Вставить("ОзонПэй", Неопределено);
	
	ОнлайнЗаказыСобытия.ПриФормированииПараметровОплат(ДокументЗаказа, ПараметрыОплат, НастройкиОплат);
	
	Возврат ПараметрыОплат;
	
КонецФункции

// Формирует новое описание параметров оплаты по реквизитам онлайн-заказов.
//
// Возвращаемое значение:
//  Структура - содержит описание параметров оплаты:
//    * ДанныеQR - Строка - форматная строка согласно "Унифицированному формату электронных банковских сообщений"
//      для ее отображения в виде QR-кода.
//    * Представление - Строка - представление реквизитов для оплаты покупателем.
//
Функция НовыйПараметрыОплатыПоРеквизитам()
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеQR",      "");
	Результат.Вставить("Представление", "");
	
	Возврат Результат;
	
КонецФункции

// Формирует новое описание параметров визуализации табличной части товаров/услуг онлайн-заказа.
//
// Возвращаемое значение:
//  ТаблицаЗначений - содержит описание параметров визуализации товаров/услуг онлайн-заказа.
//
Функция ОписаниеНастроекВизуализации(ОписаниеПредставленияТоваров)
	
	НастройкиВизуализации = Новый ТаблицаЗначений;
	
	НастройкиВизуализации.Колонки.Добавить("ПорядокОтображения", ОбщегоНазначения.ОписаниеТипаЧисло(2));
	НастройкиВизуализации.Колонки.Добавить("Идентификатор",      ОбщегоНазначения.ОписаниеТипаСтрока(50));
	НастройкиВизуализации.Колонки.Добавить("Представление",      ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	Для Каждого ОписаниеСвойства Из ОписаниеПредставленияТоваров Цикл
		
		Если ОписаниеСвойства.Видимость = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяНастройка = НастройкиВизуализации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяНастройка, ОписаниеСвойства);
		
	КонецЦикла;
	
	НастройкиВизуализации.Сортировать("ПорядокОтображения");
	
	Возврат НастройкиВизуализации;
	
КонецФункции

// Формирует и выполняете первичное заполнение описания онлайн-заказа.
// Параметры:
//  РезультатОперации - Структура - результат подготовки см.
//    ОнлайнЗаказыСлужебный.НовыйРезультатДанныеЗаказа.
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//   являющийся основанием для заказа.
//  ПараметрыНастройки - Структура - параметры настройки подключения
//    см. ОнлайнЗаказыСлужебный.ПараметрыНастройки;
//
// Возвращаемое значение:
//  Структура - см. НовыйОписаниеЗаказаНаОплату.
//  Неопределено - В случае возникновения ошибки.
//
Функция СформироватьОписаниеЗаказаНаОплату(
	РезультатОперации,
	ДокументЗаказа,
	ПараметрыНастройки)
	
	ОписаниеПредставленияТоваров = НовоеОписаниеПредставленияТоваров();
	
	ИнтеграцияПодсистемБИП.ПриНастройкеТаблицыТоваров(
		ДокументЗаказа,
		ОписаниеПредставленияТоваров);
	
	ОнлайнЗаказыПереопределяемый.ПриНастройкеТаблицыТоваров(
		ДокументЗаказа,
		ОписаниеПредставленияТоваров);
	
	ЗаказНаОплату = НовыйОписаниеЗаказаНаОплату(
		ДокументЗаказа,
		ОписаниеПредставленияТоваров,
		ПараметрыНастройки);
	
	ИнтеграцияПодсистемБИП.ПриФормированииЗаказаНаОплату(
		ДокументЗаказа,
		ЗаказНаОплату);
	
	ОнлайнЗаказыПереопределяемый.ПриФормированииЗаказаНаОплату(
		ДокументЗаказа,
		ЗаказНаОплату);
	
	Если ЗаказНаОплату.ПараметрыОплат.СБП <> Неопределено
		И ЗаказНаОплату.ПараметрыОплат.СБП.c2b <> Неопределено Тогда
		ЗаказНаОплату.ПараметрыОплат.СБП.c2b.Удалить("ШаблоныНазначения");
	КонецЕсли;
	
	Если ЗаказНаОплату.ПараметрыОплат.СБП <> Неопределено
		И ЗаказНаОплату.ПараметрыОплат.СБП.b2b <> Неопределено Тогда
		ЗаказНаОплату.ПараметрыОплат.СБП.b2b.Удалить("ШаблоныНазначения");
	КонецЕсли;
	
	Если ЗаказНаОплату.ПараметрыОплат.ИнтернетЭквайринг <> Неопределено Тогда
		ЗаказНаОплату.ПараметрыОплат.ИнтернетЭквайринг.Удалить("ШаблоныНазначения");
	КонецЕсли;
	
	// Валидация данных заказа на оплату и настроек.
	ПроверитьЗаказНаОплату(
		ЗаказНаОплату,
		ПараметрыНастройки,
		РезультатОперации);
		
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаказНаОплату.Вставить(
		"НастройкиВизуализации",
		ОписаниеНастроекВизуализации(ОписаниеПредставленияТоваров));
		
	ЗаказНаОплату.ОбщиеПараметрыЗаказа.Вставить("Валюта", "RUB");
	
	ОписаниеОснования = ОписаниеОснования(ДокументЗаказа);
	
	ЗаказНаОплату.Вставить(
		"ПредставлениеОснованияЗаказа",
		ОписаниеОснования.ПредставлениеОснования.РезультатСклонения.ИменительныйПадеж);
	
	Возврат ЗаказНаОплату;
	
КонецФункции

// Формирует и заполняет новое описание онлайн-заказа. При передаче данных в сервис
// проверяется заполнение всех свойств заказа.
// Параметры:
//  РезультатОперации - Структура - результат подготовки см.
//    ОнлайнЗаказыСлужебный.НовыйРезультатДанныеЗаказа.
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//   являющийся основанием для заказа.
//  ПараметрыНастройки - Структура - параметры настройки подключения
//    см. ОнлайнЗаказыСлужебный.ПараметрыНастройки;
//  ВерсияКонтрольнойСуммы - Число - Версия расчета контрольной суммы заказа;
//  ЗаказНаОплату - Неопределено, Структура - содержит описание онлайн-заказа.
//
// Возвращаемое значение:
//  Структура - см. НовыйОписаниеЗаказаНаОплату.
//  Неопределено - в случае возникновения ошибки.
//
Функция ДанныеЗаказаНаОплатуПоДокументу(
		РезультатОперации,
		ДокументЗаказа,
		ПараметрыНастройки,
		ВерсияКонтрольнойСуммы,
		ЗаказНаОплату)
	
	Если ЗаказНаОплату = Неопределено Тогда
		
		ЗаказНаОплату = СформироватьОписаниеЗаказаНаОплату(
			РезультатОперации,
			ДокументЗаказа,
			ПараметрыНастройки);
		
		Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаказНаОплату.Вставить("КонтрольнаяСумма", Неопределено);
	
	Если ВерсияКонтрольнойСуммы = "1" Тогда
		ЗаказНаОплату.КонтрольнаяСумма = РассчитатьКонтрольнуюСумму(
			ЗаказНаОплату,
			Неопределено,
			ВерсияКонтрольнойСуммы);
	КонецЕсли;
	
	Если ЗаказНаОплату.ПараметрыОплат.СБП <> Неопределено
		И ЗаказНаОплату.ПараметрыОплат.СБП.c2b <> Неопределено Тогда
		
		Если ПустаяСтрока(ЗаказНаОплату.ПараметрыОплат.СБП.c2b.НазначениеПлатежа) Тогда
			ЗаказНаОплату.ПараметрыОплат.СБП.c2b.НазначениеПлатежа = ЗаказНаОплату.ВизуализацияЗаказа.Представление;
		КонецЕсли;
		
		ОнлайнЗаказыСобытия.ПриПодготовкеНазначенияПлатежа(
			ЗаказНаОплату.ПараметрыОплат.СБП.c2b.НазначениеПлатежа,
			Перечисления.СпособыОплатыОнлайнЗаказов.СБПc2b);
		
	КонецЕсли;
	
	Если ЗаказНаОплату.ПараметрыОплат.СБП <> Неопределено
		И ЗаказНаОплату.ПараметрыОплат.СБП.b2b <> Неопределено Тогда
		
		Если ПустаяСтрока(ЗаказНаОплату.ПараметрыОплат.СБП.b2b.НазначениеПлатежа) Тогда
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.НазначениеПлатежа = ЗаказНаОплату.ВизуализацияЗаказа.Представление;
		КонецЕсли;
		
		ОнлайнЗаказыСобытия.ПриПодготовкеНазначенияПлатежа(
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.НазначениеПлатежа,
			Перечисления.СпособыОплатыОнлайнЗаказов.СБПb2b);
		
	КонецЕсли;
	
	Если ЗаказНаОплату.ПараметрыОплат.ИнтернетЭквайринг <> Неопределено Тогда
		
		Если ПустаяСтрока(ЗаказНаОплату.ПараметрыОплат.ИнтернетЭквайринг.НазначениеПлатежа) Тогда
			ЗаказНаОплату.ПараметрыОплат.ИнтернетЭквайринг.НазначениеПлатежа = ЗаказНаОплату.ВизуализацияЗаказа.Представление;
		КонецЕсли;
		
		ОнлайнЗаказыСобытия.ПриПодготовкеНазначенияПлатежа(
			ЗаказНаОплату.ПараметрыОплат.ИнтернетЭквайринг.НазначениеПлатежа,
			Перечисления.СпособыОплатыОнлайнЗаказов.Эквайринг);
		
	КонецЕсли;
	
	Возврат ЗаказНаОплату;
	
КонецФункции

// Производит валидацию параметров онлайн-заказа.
//
// Параметры:
//  ЗаказНаОплату - Структура - данные заказа.
//  ПараметрыНастройки - Структура - параметры настройки подключения
//    см. ОнлайнЗаказыСлужебный.ПараметрыНастройки;
//  РезультатОперации  - Структура - результат проверки заказа:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//    *СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    *ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора;
//
Процедура ПроверитьЗаказНаОплату(
		ЗаказНаОплату,
		ПараметрыНастройки,
		РезультатОперации)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОблачныеКассы")
		И ЗначениеЗаполнено(ПараметрыНастройки.НастройкаОблачнойКассы) Тогда
		
		Если Не ПараметрыФискализацииЗаполнены(ЗаказНаОплату.ПараметрыФискализации) Тогда
			
			ЗаписатьИнформациюВЖурналРегистрации(
				НСтр("ru = 'При проверке онлайн-заказа возникли ошибки.
					|Не заполнены данные чека.'"),
				Истина);
			
			ВызватьИсключение(НСтр("ru = 'Не заполнены параметры фискализации онлайн-заказа'"));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаказНаОплату.ОбщиеПараметрыЗаказа.СрокЖизни) Тогда
		
		РезультатОперации.КодОшибки = КодОшибкиНеверныйФорматЗапроса();
		РезультатОперации.СообщениеОбОшибке =
			НСтр("ru = 'Некорректно заполнен срок жизни заказа. Обратитесь к администратору.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'При проверке онлайн-заказа возникли ошибки.'");
		
		ЗаписатьИнформациюВЖурналРегистрации(
			Строка(РезультатОперации.ИнформацияОбОшибке),
			Истина);
		
	КонецЕсли;
	
	Если ЗаказНаОплату.ОбщиеПараметрыЗаказа.ТипКонтрагента <> "ФизическоеЛицо"
		И ЗаказНаОплату.ОбщиеПараметрыЗаказа.ТипКонтрагента <> "ЮридическоеЛицо"
		И ЗаказНаОплату.ОбщиеПараметрыЗаказа.ТипКонтрагента <> "ФизическоеЛицоДоступенВыбор"
		И ЗаказНаОплату.ОбщиеПараметрыЗаказа.ТипКонтрагента <> "ЮридическоеЛицоДоступенВыбор" Тогда
		
		ЗаписатьИнформациюВЖурналРегистрации(
			НСтр("ru = 'При проверке онлайн-заказа возникли ошибки.
				|Некорректно заполнен тип контрагента.'"),
			Истина);
		
		ВызватьИсключение(НСтр("ru = 'Некорректно заполнен тип контрагента'"));
		
	КонецЕсли;
	
	Если ПустаяСтрока(ЗаказНаОплату.ПараметрыОплат.ПоРеквизитам.ДанныеQR)
		Или ПустаяСтрока(ЗаказНаОплату.ПараметрыОплат.ПоРеквизитам.Представление) Тогда
		ВызватьИсключение(НСтр("ru = 'Не заполнены данные оплаты по реквизитам.'"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаказНаОплату.ВизуализацияЗаказа.Представление)
		Или Не ЗначениеЗаполнено(ЗаказНаОплату.ВизуализацияЗаказа.ПоставщикЗаголовок)
		Или Не ЗначениеЗаполнено(ЗаказНаОплату.ВизуализацияЗаказа.ПоставщикПредставление)
		Или Не ЗначениеЗаполнено(ЗаказНаОплату.ВизуализацияЗаказа.ПокупательЗаголовок)
		Или Не ЗначениеЗаполнено(ЗаказНаОплату.ВизуализацияЗаказа.ПокупательПредставление) Тогда
		
		РезультатОперации.КодОшибки = КодОшибкиНеверныйФорматЗапроса();
		РезультатОперации.СообщениеОбОшибке =
			НСтр("ru = 'Некорректно заполнены данные представления заказа.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'При проверке онлайн-заказа возникли ошибки.'");
		
		ЗаписатьИнформациюВЖурналРегистрации(
			Строка(РезультатОперации.ИнформацияОбОшибке),
			Истина);
		
	КонецЕсли;
	
	Для Каждого Товар Из ЗаказНаОплату.Товары Цикл
		Если Не ЗначениеЗаполнено(Товар.ИдентификаторТовара)
			Или Не ЗначениеЗаполнено(Товар.Количество) Тогда
			
			РезультатОперации.КодОшибки = КодОшибкиНеверныйФорматЗапроса();
			РезультатОперации.СообщениеОбОшибке
				= НСтр("ru = 'Некорректно заполнены данные товара.'");
			РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'При проверке онлайн-заказа возникли ошибки.'");
			
			ЗаписатьИнформациюВЖурналРегистрации(
				Строка(РезультатОперации.ИнформацияОбОшибке),
				Истина);
			
		КонецЕсли;
	КонецЦикла;
	
	РезультатПроверки = НовыйРезультатОперации();
	
	ОнлайнЗаказыСобытия.ПриПроверкеПараметровОплат(
		ЗаказНаОплату.ПараметрыОплат,
		РезультатПроверки);
	
	Если ЗначениеЗаполнено(РезультатПроверки.КодОшибки) Тогда
		
		ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатПроверки);
		
		ЗаписатьИнформациюВЖурналРегистрации(
			Строка(РезультатОперации.ИнформацияОбОшибке),
			Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет проверку параметров фискализации.
//
// Параметры:
//  ПараметрыФискализации - Структура - данные фискализации заказа.
//
// Возвращаемое значение:
//  Булево - результат проверки заполненности параметров фискализации:
//
Функция ПараметрыФискализацииЗаполнены(ПараметрыФискализации)
	
	Если Не ЗначениеЗаполнено(ПараметрыФискализации) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыФискализации.ДанныеЧека) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Формирует новое описание онлайн-заказа. При создании заказа
// проверяется заполнение всех свойств.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//    являющийся основанием для заказа.
//  ОписаниеПредставленияТоваров - см. НовоеОписаниеПредставленияТоваров.
//  ПараметрыНастройки - см. ПараметрыНастройки.
//
// Возвращаемое значение:
//  Структура - содержит описание онлайн-заказа:
//    * ОбщиеПараметрыЗаказа - Структура - описывает общие параметры заказа:
//      ** ТипКонтрагента - Строка - тип контрагента онлайн-заказа.
//      ** СрокЖизни - Дата - содержит значение срока жизни заказа,
//         по наступлению указанного времени заказ будет аннулирован.
//    * ВизуализацияЗаказа - Структура - содержит описание шапки заказа на его странице:
//       ** Представление - Строка - представление заказа на странице.
//       ** ДополнительнаяИнформация - Строка - дополнительная информация о заказе.
//       ** ПоставщикПредставление - Строка - содержит данные поставщика отображаемые на странице заказа.
//       ** ПоставщикЗаголовок - Строка - представление поставщика (пример: Поставщик, Исполнитель, Продавец).
//       ** ПокупательПредставление - Строка - содержит данные покупателя отображаемые на странице заказа.
//       ** ПокупательЗаголовок - Строка - представление покупателя (пример: Покупатель, Клиент).
//    * Товары - ТаблицаЗначений - Содержит данные товарного наполнения заказа.
//        Состав колонок определяется в методе ОнлайнЗаказыПереопределяемый.ПриНастройкеТаблицыТоваров
//    * ПараметрыОплат - см. ПараметрыОплатЗаказа.
//    * ПараметрыФискализации - Структура, Неопределено - параметры фискализации:
//       ** ДанныеЧека - Структура - данные чека.
//
Функция НовыйОписаниеЗаказаНаОплату(
	ДокументЗаказа,
	ОписаниеПредставленияТоваров,
	ПараметрыНастройки)
	
	ОбщиеПараметрыЗаказа = Новый Структура;
	ОбщиеПараметрыЗаказа.Вставить("СрокЖизни", Дата(1, 1, 1));
	ОбщиеПараметрыЗаказа.Вставить("ТипКонтрагента", "");
	
	ВизуализацияЗаказа = Новый Структура;
	ВизуализацияЗаказа.Вставить("Представление", "");
	ВизуализацияЗаказа.Вставить("ПоставщикПредставление",   "");
	ВизуализацияЗаказа.Вставить("ПоставщикЗаголовок",       "");
	ВизуализацияЗаказа.Вставить("ПокупательПредставление",  "");
	ВизуализацияЗаказа.Вставить("ПокупательЗаголовок",      "");
	ВизуализацияЗаказа.Вставить("ДополнительнаяИнформация", "");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОблачныеКассы")
		И ЗначениеЗаполнено(ПараметрыНастройки.НастройкаОблачнойКассы) Тогда
		ПараметрыФискализации = Новый Структура;
		ПараметрыФискализации.Вставить("НастройкаПодключения", ПараметрыНастройки.НастройкаОблачнойКассы);
		ПараметрыФискализации.Вставить("ДанныеЧека", Новый Структура);
	Иначе
		ПараметрыФискализации = Неопределено;
	КонецЕсли;
	
	ЗаказНаОплату = Новый Структура;
	ЗаказНаОплату.Вставить("ОбщиеПараметрыЗаказа", ОбщиеПараметрыЗаказа);
	ЗаказНаОплату.Вставить("ВизуализацияЗаказа", ВизуализацияЗаказа);
	ЗаказНаОплату.Вставить(
		"Товары",
		НовыйОписаниеТаблицыТовары(
			ОписаниеПредставленияТоваров));
	ЗаказНаОплату.Вставить(
		"ПараметрыОплат",
		ПараметрыОплатЗаказа(
			ДокументЗаказа,
			ПараметрыНастройки.НастройкиОплат));
	ЗаказНаОплату.Вставить("ПараметрыФискализации", ПараметрыФискализации);
	
	Возврат ЗаказНаОплату;
	
КонецФункции

// Выполняет расчет контрольной суммы для онлайн-заказа.
//
// Параметры:
//  ЗаказНаОплату - Структура - данные заказа;
//  НастройкиОплат  - Структура - настройки оплат онлайн-заказа;
//  ВерсияКонтрольнойСуммы - Строка - версия расчета контрольной суммы.
//
// Возвращаемое значение:
//  Структура - содержит описание контрольной суммы онлайн-заказа:
//    * Значение - Строка - Контрольная сумма онлайн-заказа
//    * ВерсияРасчета - Строка - версия расчета контрольной суммы
//
Функция РассчитатьКонтрольнуюСумму(ЗаказНаОплату, НастройкиОплат, ВерсияКонтрольнойСуммы)
	
	Если ВерсияКонтрольнойСуммы = "1" Тогда
		ДанныеЗаказаСтрокой = ДанныеЗаказаСтрокойПерваяВерсия(ЗаказНаОплату);
	ИначеЕсли ВерсияКонтрольнойСуммы = "2" Тогда
		ДанныеЗаказаСтрокой = ДанныеЗаказаСтрокойВтораяВерсия(ЗаказНаОплату, НастройкиОплат);
	ИначеЕсли ВерсияКонтрольнойСуммы = АктуальнаяВерсияКонтрольнойСуммы() Тогда
		ДанныеЗаказаСтрокой = ДанныеЗаказаСтрокойАктуальнаяВерсия(ЗаказНаОплату, НастройкиОплат);
	КонецЕсли;
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешированиеДанных.Добавить(ДанныеЗаказаСтрокой);
	ХешСумма = СтрЗаменить(Строка(ХешированиеДанных.ХешСумма), " ", "");
	
	Результат = Новый Структура;
	Результат.Вставить("Значение",      ХешСумма);
	Результат.Вставить("ВерсияРасчета", ВерсияКонтрольнойСуммы);
	
	Возврат Результат;
	
КонецФункции

// Выполняет расчет контрольной суммы по первой версии для онлайн-заказа.
//
// Параметры:
//  ЗаказНаОплату - Структура - данные заказа.
//
// Возвращаемое значение:
//  Строка - Контрольная сумма онлайн-заказа
//
Функция ДанныеЗаказаСтрокойПерваяВерсия(ЗаказНаОплату)
	
	ДанныеЗаказа = Новый Структура;
	
	Для Каждого ЭлементЗаказаНаОплату Из ЗаказНаОплату Цикл
		Если ТипЗнч(ЭлементЗаказаНаОплату.Значение) = Тип("ТаблицаЗначений") Тогда
			ДанныеЗаказа.Вставить(
				ЭлементЗаказаНаОплату.Ключ,
				ОбщегоНазначения.ТаблицаЗначенийВМассив(ЭлементЗаказаНаОплату.Значение));
		Иначе
			ДанныеЗаказа.Вставить(
				ЭлементЗаказаНаОплату.Ключ,
				ЭлементЗаказаНаОплату.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеДляЗаписи = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеЗаказа);
	
	ДанныеДляЗаписи.ОбщиеПараметрыЗаказа.Удалить("ТипКонтрагента");
	ДанныеДляЗаписи.ОбщиеПараметрыЗаказа.Удалить("Валюта");
	ДанныеДляЗаписи.ПараметрыОплат.Удалить("ПоРеквизитам");
	ДанныеДляЗаписи.Удалить("ПредставлениеОснованияЗаказа");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJSON, ДанныеДляЗаписи);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Выполняет расчет контрольной суммы по первой версии для онлайн-заказа.
//
// Параметры:
//  ЗаказНаОплату - Структура - данные заказа.
//  НастройкиОплаты - Структура - настройки оплат онлайн-заказа.
//
// Возвращаемое значение:
//  Строка - Контрольная сумма онлайн-заказа
//
Функция ДанныеЗаказаСтрокойВтораяВерсия(ЗаказНаОплату, НастройкиОплаты)
	
	ДанныеДляЗаписи = ОбщегоНазначения.СкопироватьРекурсивно(ЗаказНаОплату);
	ДанныеДляЗаписи.ПараметрыФискализации = Неопределено;
	
	ЗаписьДанныхСообщения = Новый ЗаписьJSON;
	ЗаписьДанныхСообщения.УстановитьСтроку();
	
	ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
	
	ЗаписатьПараметрыЗаказа(
		ЗаписьДанныхСообщения,
		ДанныеДляЗаписи,
		НастройкиОплаты);
	
	ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	
	Возврат ЗаписьДанныхСообщения.Закрыть();
	
КонецФункции

// Выполняет расчет контрольной суммы для онлайн-заказа.
//
// Параметры:
//  ЗаказНаОплату - Структура - данные заказа;
//  НастройкиОплаты - Структура - настройки оплат онлайн-заказа.
//
// Возвращаемое значение:
//  Строка - Контрольная сумма онлайн-заказа
//
Функция ДанныеЗаказаСтрокойАктуальнаяВерсия(ЗаказНаОплату, НастройкиОплаты)
	
	ЗаписьДанныхСообщения = Новый ЗаписьJSON;
	ЗаписьДанныхСообщения.УстановитьСтроку();
	
	ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
	
	ЗаписатьПараметрыЗаказа(
		ЗаписьДанныхСообщения,
		ЗаказНаОплату,
		НастройкиОплаты);
	
	ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	
	Возврат ЗаписьДанныхСообщения.Закрыть();
	
КонецФункции

// Добавляет в запись JSON параметры онлайн-заказа.
//
// Параметры:
//  ЗаписьДанныхСообщения  - ЗаписьJSON - запись, в которую необходимо
//    добавить данные аутентификации.
//  ДанныеЗаказа - Структура - данные онлайн-заказа см. ОнлайнЗаказыСлужебный.ДанныеЗаказаНаОплатуПоДокументу
//  НастройкиОплаты - Структура - настройки оплат онлайн-заказа.
//
Процедура ЗаписатьПараметрыЗаказа(
	ЗаписьДанныхСообщения,
	ДанныеЗаказа,
	НастройкиОплаты) Экспорт
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("activate");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(Ложь);
	
	Если ДанныеЗаказа.ОбщиеПараметрыЗаказа.ТипКонтрагента = "ФизическоеЛицо" Тогда
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("buyerType");
		ЗаписьДанныхСообщения.ЗаписатьЗначение("PRIVATE_PERSON");
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("allowBuyerTypeChoice");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Ложь);
	ИначеЕсли ДанныеЗаказа.ОбщиеПараметрыЗаказа.ТипКонтрагента = "ЮридическоеЛицо" Тогда
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("buyerType");
		ЗаписьДанныхСообщения.ЗаписатьЗначение("LEGAL_ENTITY");
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("allowBuyerTypeChoice");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Ложь);
	ИначеЕсли ДанныеЗаказа.ОбщиеПараметрыЗаказа.ТипКонтрагента = "ФизическоеЛицоДоступенВыбор" Тогда
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("buyerType");
		ЗаписьДанныхСообщения.ЗаписатьЗначение("PRIVATE_PERSON");
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("allowBuyerTypeChoice");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Истина);
	ИначеЕсли ДанныеЗаказа.ОбщиеПараметрыЗаказа.ТипКонтрагента = "ЮридическоеЛицоДоступенВыбор" Тогда
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("buyerType");
		ЗаписьДанныхСообщения.ЗаписатьЗначение("LEGAL_ENTITY");
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("allowBuyerTypeChoice");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Истина);
	Иначе
		ВызватьИсключение НСтр("ru = 'Не передан тип контрагента, обработка прервана.'");
	КонецЕсли;
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("expirationTimestamp");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(
		ЗаписатьДатуJSON(
			ДанныеЗаказа.ОбщиеПараметрыЗаказа.СрокЖизни,
			ФорматДатыJSON.ISO,
			ВариантЗаписиДатыJSON.УниверсальнаяДата));
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("currency");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ДанныеЗаказа.ОбщиеПараметрыЗаказа.Валюта);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("reasonObjectRepresentation");
	ПредставлениеОснованияЗаказа = СокрЛП(ДанныеЗаказа.ПредставлениеОснованияЗаказа);
	Если Врег(ПредставлениеОснованияЗаказа) = ПредставлениеОснованияЗаказа Тогда
		ЗаписьДанныхСообщения.ЗаписатьЗначение(ПредставлениеОснованияЗаказа);
	Иначе
		ЗаписьДанныхСообщения.ЗаписатьЗначение(
			ВРег(Лев(ПредставлениеОснованияЗаказа,1)) + Сред(ПредставлениеОснованияЗаказа, 2));
	КонецЕсли;
	
	// Данные товаров
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("items");
	
	ЗаписьДанныхСообщения.ЗаписатьНачалоМассива();
	
	Для Каждого Товар Из ДанныеЗаказа.Товары Цикл
		
		ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("nomenclatureId");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Товар.ИдентификаторТовара);
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("title");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Товар.Наименование);
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("quantity");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Товар.Количество);
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("discount");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Товар.Скидка);
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("discountedAmount");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Товар.СуммаСоСкидкой);
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("vat");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Товар.СуммаНДС);
		
		ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	ЗаписьДанныхСообщения.ЗаписатьКонецМассива();
	
	// Параметры оплаты СБП
	Если НастройкиОплаты.СБП <> Неопределено Тогда
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("sbpPaymentParams");
		
		ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("paymentPurpose");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(НастройкиОплаты.СБП.НазначениеПлатежа);
		
		Если НастройкиОплаты.СБП.ВариантСБП = ИдентификаторВариантаСБПB2B() Тогда
			
			ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("b2bAccount");
			ЗаписьДанныхСообщения.ЗаписатьЗначение(НастройкиОплаты.СБП.РасчетныйСчет);
			
			ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("b2bTakeTax");
			ЗаписьДанныхСообщения.ЗаписатьЗначение(НастройкиОплаты.СБП.ОблагаетсяНДС);
			
			ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("b2bTotalTaxAmount");
			ЗаписьДанныхСообщения.ЗаписатьЗначение(НастройкиОплаты.СБП.СуммаНДС);
			
			ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("b2bUip");
			ЗаписьДанныхСообщения.ЗаписатьЗначение(НастройкиОплаты.СБП.ИдентификаторПлатежа);
			
		КонецЕсли;
		
		ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
		
	КонецЕсли;
	
	// Параметры оплаты по реквизитам
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("requisitesPaymentParams");
	
	ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("qrData");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(НастройкиОплаты.ПоРеквизитам.ДанныеQR);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("qrRepresentation");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(НастройкиОплаты.ПоРеквизитам.Представление);
	
	ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	
	// Параметры оплаты через Интернет-эквайринг
	Если НастройкиОплаты.ИнтернетЭквайринг <> Неопределено Тогда
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("acquiringPaymentParams");
		
		ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("paymentPurpose");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(НастройкиОплаты.ИнтернетЭквайринг.НазначениеПлатежа);
		
		ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
		
	КонецЕсли;
	
	// Параметры фискализации
	Если ЗначениеЗаполнено(ДанныеЗаказа.ПараметрыФискализации) Тогда
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("fiscalizationRequest");
		ЗаписатьJSON(ЗаписьДанныхСообщения, ДанныеЗаказа.ПараметрыФискализации.ДанныеЧека);
	КонецЕсли;
	
	// Визуализация заказа
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("visualization");
	
	ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("title");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ДанныеЗаказа.ВизуализацияЗаказа.Представление);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("comment");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ДанныеЗаказа.ВизуализацияЗаказа.ДополнительнаяИнформация);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("supplierFieldTitle");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ДанныеЗаказа.ВизуализацияЗаказа.ПоставщикЗаголовок);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("supplierFieldValue");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ДанныеЗаказа.ВизуализацияЗаказа.ПоставщикПредставление);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("customerFieldTitle");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ДанныеЗаказа.ВизуализацияЗаказа.ПокупательЗаголовок);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("customerFieldValue");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ДанныеЗаказа.ВизуализацияЗаказа.ПокупательПредставление);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("itemColumns");
	
	ЗаписьДанныхСообщения.ЗаписатьНачалоМассива();
	
	Для Каждого НастройкаВизуализации Из ДанныеЗаказа.НастройкиВизуализации Цикл
		
		ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("title");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(НастройкаВизуализации.Представление);
		
		ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	ЗаписьДанныхСообщения.ЗаписатьКонецМассива();
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("itemRows");
	
	ЗаписьДанныхСообщения.ЗаписатьНачалоМассива();
	
	Для Каждого Товар Из ДанныеЗаказа.Товары Цикл
		
		ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("nomenclatureId");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Товар.ИдентификаторТовара);
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("cells");
		
		ЗаписьДанныхСообщения.ЗаписатьНачалоМассива();
		
		Для Каждого НастройкаВизуализации Из ДанныеЗаказа.НастройкиВизуализации Цикл
			
			ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
			
			ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("value");
			ЗаписьДанныхСообщения.ЗаписатьЗначение(Товар[НастройкаВизуализации.Идентификатор]);
			
			ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
			
		КонецЦикла;
		
		ЗаписьДанныхСообщения.ЗаписатьКонецМассива();
		
		ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	ЗаписьДанныхСообщения.ЗаписатьКонецМассива();
	ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	
КонецПроцедуры

// Создает новые параметры оплаты заказа для сервиса.
//
// Параметры:
//  НастройкиОплатПодключения - Соответствие Из КлючИЗначение - Содержит данные используемых настроек в разрезе
//    способов оплат:
//    * Ключ - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов - способ оплаты
//    * Значение - Произвольный - Используемая настройка подключения, для данного способа оплаты.
//  НастройкиПриемаОплатПоРеквизитам - Структура - настройки приема оплат от физ. лиц:
//    * ИспользуетсяПриемОплатОтФизЛиц - Булево - настроен прием оплат от физ. лиц;
//    * ИспользуетсяПриемОплатОтЮрЛиц - Булево - настроен прием оплат от юр. лиц.
//  ПараметрыОплатЗаказа - Структура - Содержит параметры оплат заказа
//    см. ОнлайнЗаказыСлужебный.ДанныеЗаказаНаОплатуПоДокументу.ПараметрыОплат.
//  ТипКонтрагента - Строка - "ФизическоеЛицо", "ЮридическоеЛицо", "ФизическоеЛицоДоступенВыбор",
//  "ЮридическоеЛицоДоступенВыбор".
//
// Возвращаемое значение:
//  Структура - Содержит параметры оплат для сервиса:
//    * СБП - Структура, Неопределено - Параметры оплаты СБП,
//        Неопределено в случае если настройка для оплат через СБП не выбрана.
//    * ПоРеквизитам - Структура, Неопределено - Параметры оплаты по реквизитам.
//    * ИнтернетЭквайринг - Структура, Неопределено - Параметры оплаты через Интернет-эквайринг,
//        Неопределено в случае если настройка для оплат через Интернет-эквайринг не выбрана.
//    * ОзонПэй - Структура, Неопределено - Параметры оплаты через Озон Пэй,
//        Неопределено в случае если настройка для оплат через Озон Пэй не выбрана.
// 
Функция НастройкиОплаты(
	НастройкиОплатПодключения,
	НастройкиПриемаОплатПоРеквизитам,
	ПараметрыОплатЗаказа,
	ТипКонтрагента)
	
	НастройкиОплатСервиса = Новый Структура;
	НастройкиОплатСервиса.Вставить("СБП", Неопределено);
	НастройкиОплатСервиса.Вставить("ПоРеквизитам", Неопределено);
	НастройкиОплатСервиса.Вставить("ИнтернетЭквайринг", Неопределено);
	НастройкиОплатСервиса.Вставить("ОзонПэй", Неопределено);
	
	НастройкиОплатСервиса.ПоРеквизитам = ПараметрыОплатЗаказа.ПоРеквизитам;
	
	Если ДоступныОплатыФизЛиц(ТипКонтрагента) Тогда
		ОнлайнЗаказыСобытия.ПриЗаполненииНастроекОплатыФизическихЛиц(
			НастройкиОплатПодключения,
			ПараметрыОплатЗаказа,
			НастройкиОплатСервиса);
	КонецЕсли;
	
	Если ДоступныОплатыЮрЛиц(ТипКонтрагента) Тогда
		ОнлайнЗаказыСобытия.ПриЗаполненииНастроекОплатыЮридическихЛиц(
			НастройкиОплатПодключения,
			ПараметрыОплатЗаказа,
			НастройкиОплатСервиса);
	КонецЕсли;
	
	Возврат НастройкиОплатСервиса;
	
КонецФункции

// Определяет доступность видов оплат физических лиц по типу контрагента.
//
// Параметры:
//  ТипКонтрагента - Строка - "ФизическоеЛицо" или "ЮридическоеЛицо", "ФизическоеЛицоДоступенВыбор",
//  "ЮридическоеЛицоДоступенВыбор".
//
// Возвращаемое значение:
//  Булево - Признак доступности видов оплат физических лиц
//
Функция ДоступныОплатыФизЛиц(ТипКонтрагента)
	
	Если ТипКонтрагента = "ФизическоеЛицо"
		Или ТипКонтрагента = "ФизическоеЛицоДоступенВыбор"
		Или ТипКонтрагента = "ЮридическоеЛицоДоступенВыбор" Тогда
		
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Определяет доступность видов оплат юридических лиц по типу контрагента.
//
// Параметры:
//  ТипКонтрагента - Строка - "ФизическоеЛицо", "ЮридическоеЛицо", "ФизическоеЛицоДоступенВыбор",
//  "ЮридическоеЛицоДоступенВыбор".
//
// Возвращаемое значение:
//  Булево - Признак доступности видов оплат юридических лиц
//
Функция ДоступныОплатыЮрЛиц(ТипКонтрагента)
	
	Если ТипКонтрагента = "ЮридическоеЛицо"
		Или ТипКонтрагента = "ФизическоеЛицоДоступенВыбор"
		Или ТипКонтрагента = "ЮридическоеЛицоДоступенВыбор" Тогда
		
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Возвращает ошибки данных заполнения онлайн-заказа.
//
// Параметры:
//  ДанныеЗаказа - Структура - данные онлайн-заказа см. ОнлайнЗаказыСлужебный.ДанныеЗаказаНаОплатуПоДокументу
//
// Возвращаемое значение:
//  Массив из Строка - перечень ошибок данных для создания/обновления онлайн-заказа
//
Функция ОшибкиВалидацииЗаказа(ДанныеЗаказа)
	
	ОшибкиВалидации = Новый Массив;
	
	Если ДанныеЗаказа.ОбщиеПараметрыЗаказа.СрокЖизни <= ТекущаяДатаСеанса() Тогда
		ОшибкиВалидации.Добавить(НСтр("ru = 'Срок жизни заказа меньше текущей даты.'"));
	КонецЕсли;
	
	Если ДанныеЗаказа.Товары.Количество() = 0 Тогда
		ОшибкиВалидации.Добавить(НСтр("ru = 'Заказ не содержит строк с товарами.'"));
	КонецЕсли;
	
	Если ДанныеЗаказа.Товары.Итог("СуммаСоСкидкой") <= 0 Тогда
		ОшибкиВалидации.Добавить(НСтр("ru = 'Сумма заказа должна быть больше ноля.'"));
	КонецЕсли;
	
	Возврат ОшибкиВалидации;
	
КонецФункции

#КонецОбласти

#Область ДанныеЗаказов

// Выполняет загрузку статусов онлайн-заказов, по которым было
// отложено получение результата.
//
// Параметры:
//  ДокументыЗаказов - Массив Из ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документы в информационной базе,
//   являющиеся основанием для заказа.
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - данные онлайн-заказов:
//    * Ключ - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ основание онлайн-заказа.
//    * Значение - Структура, Неопределено - Данные онлайн-заказа, Неопределено в случае, если онлайн-заказ не был создан:
//      ** СтатусЗаказа - Строка - Статус онлайн-заказа, может принимать следующие значения:
//        - "Выполняется" - подтверждение оплаты не получено;
//        - "Отменен" - онлайн-заказ отменен;
//        - "Выполнен" - онлайн-заказ оплачен;
//        - "Ошибка" - не удалось выполнить проверку оплаты из-за ошибки;
//      ** ПараметрыЗаказа - Структура - дополнительные данные по заказу:
//        *** URLЗаказа - Строка - URL онлайн-заказа;
//        *** СпособОплаты - Строка - Идентификатор способа оплаты, пустая если СтатусЗаказа <> "Выполнен".
//            Может принимать следующие значения: "СБПc2b", "СБПb2b", "Наличные", "ПоРеквизитам", "Эквайринг",
//            "ОзонПэй", "Прочее".
//        *** СуммаОплаты - Число - Сумма оплаты онлайн-заказа, пустая если СтатусЗаказа <> "Выполнен".
//
Функция ДанныеЗаказов(ДокументыЗаказов) Экспорт
	
	ДанныеЗаказов = Новый Соответствие;
	
	ДанныеКеша = РегистрыСведений.ИдентификаторыОнлайнЗаказов.ДанныеЗаказов(ДокументыЗаказов);
	
	Для Каждого ДокументЗаказа Из ДокументыЗаказов Цикл
		
		ДанныеКешаПоДокументу = ДанныеКеша.Получить(ДокументЗаказа);
		
		Если ДанныеКешаПоДокументу = Неопределено Тогда
			ДанныеЗаказов.Вставить(ДокументЗаказа, Неопределено);
		Иначе
			
			ПараметрыЗаказа = Новый Структура;
			ПараметрыЗаказа.Вставить("URLЗаказа", ДанныеКешаПоДокументу.URLЗаказа);
			ПараметрыЗаказа.Вставить(
				"СпособОплаты",
				ИдентификаторПоСпособуОплаты(ДанныеКешаПоДокументу.СпособОплаты));
			ПараметрыЗаказа.Вставить("СуммаОплаты", ДанныеКешаПоДокументу.СуммаОплаты);
			
			ДанныеЗаказа = Новый Структура;
			ДанныеЗаказа.Вставить("ПараметрыЗаказа", ПараметрыЗаказа);
			ДанныеЗаказа.Вставить(
				"СтатусЗаказа",
				ИдентификаторСтатусаЗаказа(ДанныеКешаПоДокументу.СтатусЗаказа));
			
			ДанныеЗаказов.Вставить(ДокументЗаказа, ДанныеЗаказа);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеЗаказов;
	
КонецФункции

// Возвращает публичные данные онлайн-заказа по переданному URL.
//
// Параметры:
//  URLЗаказа - Строка - ссылка на онлайн-заказ.
//
// Возвращаемое значение:
//  Структура - результат получения данных онлайн-заказа:
//    * ПараметрыShare - Структура - Параметры онлайн-заказа в сервисе Share:
//      ** URL - Строка - URL документа онлайн-заказа в сервисе Share, пустая строка в случае если документ не создан;
//      ** ИнформацияОбОшибке - Устарело. Следует использовать ИнформацияОбОшибке верхнего уровня.
//    * ПараметрыОплат - Структура - Содержит описание видов оплат с их параметрами:
//      ** ПоРеквизитам - Структура, Неопределено - Содержит описание реквизитов для оплаты.
//         Неопределено в случае если данные оплат по реквизитам не переданы или отключены в настройке оплат:
//        *** ДанныеQR - Строка - Содержит реквизиты оплаты в формате УФЭБС.
//        *** Представление - Строка - Представление реквизитов оплат в текстовом виде.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ПубличныеДанныеЗаказа(URLЗаказа) Экспорт
	
	ПубличныеДанныеЗаказа = НовыйОписаниеПубличныхДанныхЗаказа();
	
	Если Не ОнлайнЗаказыКлиентСервер.ЭтоURLСервиса(URLЗаказа) Тогда
		Возврат ПубличныеДанныеЗаказа;
	КонецЕсли;
	
	ИдентификаторЗаказа = ИдентификаторЗаказаИзURL(URLЗаказа);
	
	Если ПустаяСтрока(ИдентификаторЗаказа) Тогда
		Возврат ПубличныеДанныеЗаказа;
	КонецЕсли;
	
	ИдентификаторыЗаказов = Новый Массив;
	ИдентификаторыЗаказов.Добавить(ИдентификаторЗаказа);
	
	РезультатВызова = ПубличныеДанныеЗаказов(ИдентификаторыЗаказов);
	
	Если ЗначениеЗаполнено(РезультатВызова.ИнформацияОбОшибке) Тогда
		ПубличныеДанныеЗаказа.ИнформацияОбОшибке = РезультатВызова.ИнформацияОбОшибке;
		ПубличныеДанныеЗаказа.ПараметрыShare.URL = РезультатВызова.ИнформацияОбОшибке;
		Возврат ПубличныеДанныеЗаказа;
	КонецЕсли;
	
	ДанныеЗаказа = РезультатВызова.ДанныеЗаказов.Получить(ИдентификаторЗаказа);
	
	Если ДанныеЗаказа <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(
			ПубличныеДанныеЗаказа,
			ДанныеЗаказа);
	КонецЕсли;
	
	Возврат ПубличныеДанныеЗаказа;
	
КонецФункции

// Возвращает публичные данные онлайн-заказов по их идентификаторам.
//
// Параметры:
//  ИдентификаторыЗаказов - Массив Из Строка - идентификаторы онлайн-заказов.
//
// Возвращаемое значение:
//  Структура - результат получения данных онлайн-заказа:
//    * ДанныеЗаказов - Соответствие - Содержит публичные данные онлайн-заказов:
//      ** Ключ - Строка - Идентификатор онлайн-заказа
//      ** Значение - Структура - Содержит публичные данные онлайн-заказа
//        *** URL - Строка - URL документа онлайн-заказа в сервисе Share, пустая строка в случае если документ не создан;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ПубличныеДанныеЗаказов(ИдентификаторыЗаказов)
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ИдентификаторыЗаказов", ИдентификаторыЗаказов);
	
	Возврат ОнлайнЗаказыСервис.ПолучениеПубличнойИнформацииПоЗаказам(ПараметрыОперации);
	
КонецФункции

Функция ИдентификаторПоСпособуОплаты(СпособОплаты)
	
	Если СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.СБПc2b Тогда
		Возврат "СБПc2b";
	ИначеЕсли СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.СБПb2b Тогда
		Возврат "СБПb2b";
	ИначеЕсли СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.Наличные Тогда
		Возврат "Наличные";
	ИначеЕсли СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.ПоРеквизитам Тогда
		Возврат "ПоРеквизитам";
	ИначеЕсли СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.Эквайринг Тогда
		Возврат "Эквайринг";
	ИначеЕсли СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.ОзонПэй Тогда
		Возврат "ОзонПэй";
	Иначе
		Возврат "Прочее";
	КонецЕсли
	
КонецФункции

Функция ИдентификаторСтатусаЗаказа(СтатусЗаказа)
	
	Если СтатусЗаказа = СтатусЗаказаОплачен() Тогда
		Возврат "Выполнен";
	ИначеЕсли СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаВыполняется()
		Или СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаВыполняетсяОплата()
		Или СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаНеАктивен() Тогда
		Возврат "Выполняется";
	ИначеЕсли СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаИстекСрокЖизни() Тогда
		Возврат "Отменен";
	ИначеЕсли СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибка()
		Или СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибкаСервиса() Тогда
		Возврат "Ошибка";
	КонецЕсли
	
КонецФункции

// Получает ссылку на перечисление СпособыОплатыОнлайнЗаказов по строковому идентификатору. Если значение входного
//   параметра не входит в список допустимых, то будет вызвано исключение.
// 
// Параметры:
//  ИдентификаторСпособаОплаты - Строка - строковое представление, по которому нужно получить ссылку. Допустимые
//    значения: "СБПc2b", "СБПb2b", "ИнтернетЭквайринг", "ОзонПэй".
//  
//  Возвращаемое значение:
//    ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов - найденная ссылка.
//
Функция СпособОплатыПоИдентификатору(ИдентификаторСпособаОплаты) Экспорт
	
	Если ИдентификаторСпособаОплаты = "СБПc2b" Тогда
		Возврат Перечисления.СпособыОплатыОнлайнЗаказов.СБПc2b;
	ИначеЕсли ИдентификаторСпособаОплаты = "СБПb2b" Тогда
		Возврат Перечисления.СпособыОплатыОнлайнЗаказов.СБПb2b;
	ИначеЕсли ИдентификаторСпособаОплаты = "ИнтернетЭквайринг" Тогда
		Возврат Перечисления.СпособыОплатыОнлайнЗаказов.Эквайринг;
	ИначеЕсли ИдентификаторСпособаОплаты = "ОзонПэй" Тогда
		Возврат Перечисления.СпособыОплатыОнлайнЗаказов.ОзонПэй;
	КонецЕсли;
	
	ВызватьИсключение (НСтр("ru = 'Передан неизвестный идентификатор способа оплаты.'"));
	
КонецФункции

// Формирует новое описание публичных данных онлайн-заказа.
//
// Возвращаемое значение:
//  Структура - публичные данные онлайн-заказа:
//    * ПараметрыShare - Структура - Параметры онлайн-заказа в сервисе Share:
//      ** URL - Строка - URL документа онлайн-заказа в сервисе Share, пустая строка в случае если документ не создан;
//      ** ИнформацияОбОшибке - Устарело. Следует использовать ИнформацияОбОшибке верхнего уровня.
//    * ПараметрыОплат - Структура - Содержит описание видов оплат с их параметрами:
//      ** ПоРеквизитам - Структура, Неопределено - Содержит описание реквизитов для оплаты.
//         Неопределено в случае если данные оплат по реквизитам не переданы или отключены в настройке оплат:
//        *** ДанныеQR - Строка - Содержит реквизиты оплаты в формате УФЭБС.
//        *** Представление - Строка - Представление реквизитов оплат в текстовом виде.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция НовыйОписаниеПубличныхДанныхЗаказа() Экспорт
	
	ПубличныеДанныеЗаказа = Новый Структура;
	
	ПараметрыShare = Новый Структура;
	ПараметрыShare.Вставить("URL", "");
	ПараметрыShare.Вставить("ИнформацияОбОшибке", "");
	
	ПараметрыОплатПоРеквизитам = Новый Структура;
	ПараметрыОплатПоРеквизитам.Вставить("ДанныеQR", "");
	ПараметрыОплатПоРеквизитам.Вставить("Представление", "");
	
	ПараметрыОплат = Новый Структура;
	ПараметрыОплат.Вставить("ПоРеквизитам", ПараметрыОплатПоРеквизитам);
	
	ПубличныеДанныеЗаказа.Вставить("ПараметрыShare", ПараметрыShare);
	ПубличныеДанныеЗаказа.Вставить("ПараметрыОплат", ПараметрыОплат);
	ПубличныеДанныеЗаказа.Вставить("ИнформацияОбОшибке", "");
	
	Возврат ПубличныеДанныеЗаказа;
	
КонецФункции

Функция ИдентификаторЗаказаИзURL(Знач URLЗаказа)
	
	URLЗаказа = СокрЛП(URLЗаказа);
	
	ПозицияСимвола = Макс(
		СтрНайти(URLЗаказа, "/", НаправлениеПоиска.СКонца),
		СтрНайти(URLЗаказа, "=", НаправлениеПоиска.СКонца));
	
	Если ПозицияСимвола > 0 Тогда
		
		Возврат Сред(
			URLЗаказа,
			ПозицияСимвола + 1,
			СтрДлина(URLЗаказа) - ПозицияСимвола);
		
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПечатныеФормыЗаказа

Функция ПечатныеФормыЗаказа(ДокументЗаказа) Экспорт
	
	ПечатныеФормы = НовыйОписаниеТаблицыПечатныхФорм();
	ИнтеграцияПодсистемБИП.ПриОпределенииПечатныхФормЗаказа(ДокументЗаказа, ПечатныеФормы);
	ОнлайнЗаказыПереопределяемый.ПриОпределенииПечатныхФормЗаказа(ДокументЗаказа, ПечатныеФормы);
	
	Возврат ПечатныеФормы;
	
КонецФункции

Функция НовыйОписаниеТаблицыПечатныхФорм()
	
	ПечатныеФормы = Новый ТаблицаЗначений;
	
	ПечатныеФормы.Колонки.Добавить(
		"Идентификатор",
		Новый ОписаниеТипов(
			"Строка",
			,
			,
			,
			Новый КвалификаторыСтроки(50)));
	ПечатныеФормы.Колонки.Добавить(
		"Представление",
		Новый ОписаниеТипов(
			"Строка",
			,
			,
			,
			Новый КвалификаторыСтроки(100)));
			
	ПечатныеФормы.Колонки.Добавить(
		"ФорматСохранения",
		Новый ОписаниеТипов("ТипФайлаТабличногоДокумента"));
			
	ПечатныеФормы.Колонки.Добавить(
		"ИмяФайлаВТранслите",
		Новый ОписаниеТипов("Булево"));
		
	ПечатныеФормы.Колонки.Добавить(
		"ПодписьИПечать",
		Новый ОписаниеТипов("Булево"));
	
	Возврат ПечатныеФормы;
	
КонецФункции

#КонецОбласти

#Область ОтправкаВложений

Функция ЗапрещенныеРасширенияФайла() Экспорт

	Возврат ".exe;.application;.msi;.msp;.pif;.com;.scr;.msc;.cpl;.gadget;.jar;.hta;.bat;.cmd;.vb;.vbs;.vbe;.ws;.wsf;
	|.wsc;.wsh;.js;.jse;.ps1;.ps1xml;.ps2;.ps2xml;.psc1;.psc2;.msh;.msh1;.msh2;.mshxml;.msh1xml;.msh2xml;.scf;.inf;
	|.lnk;.reg;.dll;";

КонецФункции

Функция ОтправитьВложения(ПараметрыОперации) Экспорт
	
	РезультатОперации = НовыйРезультатДанныеЗаказа();
	РезультатОперации.Вставить("НеобходимоАктуализироватьURLShare", Ложь);
	
	ПараметрыСсылки = РегистрыСведений.ИдентификаторыОнлайнЗаказов.ПараметрыСсылкиПоДокументуЗаказа(
		ПараметрыОперации.ДокументЗаказа);
	
	Если Не ЗначениеЗаполнено(ПараметрыСсылки.ИдентификаторЗаказа) Тогда
		
		РезультатОперации.КодОшибки = КодОшибкиНеверныйФорматЗапроса();
		РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Не обнаружен идентификатор заказа.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Не обнаружен идентификатор заказа.'");
		
		Возврат РезультатОперации;
		
	ИначеЕсли ПараметрыСсылки.СтатусЗаказа = СтатусЗаказаОплачен() Тогда
		
		РезультатОперации.КодОшибки = КодОшибкиУжеОплачен();
		РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Заказ уже оплачен, редактирование невозможно.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Заказ уже оплачен, редактирование невозможно.''");
		
		Возврат РезультатОперации;
		
	КонецЕсли;
	
	ПараметрыОперации.Вставить("ИдентификаторЗаказа", ПараметрыСсылки.ИдентификаторЗаказа);
	
	Если ПараметрыСсылки.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаВыполняется() Тогда
		
		РезультатДеактивации = ДеактивироватьЗаказ(ПараметрыОперации.ДокументЗаказа);
		
		Если ЗначениеЗаполнено(РезультатДеактивации.КодОшибки) Тогда
			ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатДеактивации);
			Возврат РезультатОперации;
		КонецЕсли;
		
	ИначеЕсли ПараметрыСсылки.СтатусЗаказа <> ОнлайнЗаказыКлиентСервер.СтатусЗаказаНеАктивен() Тогда
		
		ЗаполнитьЗначенияСвойств(РезультатОперации, ПараметрыСсылки);
		Возврат РезультатОперации;
		
	КонецЕсли;
	
	ДанныеВложений = ПодготовитьДанныеВложений(ПараметрыОперации);
	ПараметрыОперации.Вставить("ДанныеВложений", ДанныеВложений);
	
	РезультатОтправки = ОнлайнЗаказыСервис.ОтправкаВложений(
		ПараметрыОперации);
		
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатОтправки);
	
	Если Не ПустаяСтрока(РезультатОтправки.КодОшибки) Тогда
		
		РезультатОперации.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибка();
		
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьСтатусЗаказа(
			ПараметрыОперации.ДокументЗаказа,
			РезультатОперации.СтатусЗаказа,
			Неопределено,
			Неопределено,
			Ложь);
		
		Возврат РезультатОперации;
		
	КонецЕсли;
	
	РезультатОперации.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаВыполняется();
	
	РегистрыСведений.ПечатныеФормыОнлайнЗаказов.ЗаписатьПечатныеФормыЗаказа(
		ПараметрыОперации.ДокументЗаказа,
		ПараметрыОперации.ПечатныеФормы);
		
	РегистрыСведений.ФайлыОнлайнЗаказов.ЗаписатьФайлы(
		ПараметрыОперации.ДокументЗаказа,
		ПараметрыОперации.ПрисоединенныеФайлы,
		ДанныеВложений);
	
	РезультатАктивации = АктивироватьЗаказ(
		ПараметрыОперации.ДокументЗаказа,
		ПараметрыСсылки.НастройкаПодключения,
		ДанныеВложений);
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатАктивации);
	
	Возврат РезультатОперации;
	
КонецФункции

Функция ПодготовитьДанныеВложений(ПараметрыОперации)
	
	Вложения = Новый Соответствие;
	ПодготовитьПечатныеФормыКОтправке(
		ПараметрыОперации,
		Вложения);
	ПодготовитьПрисоединенныеФайлыКОтправке(
		ПараметрыОперации,
		Вложения);
	
	Возврат Вложения;
	
КонецФункции

Процедура ПодготовитьПечатныеФормыКОтправке(ПараметрыОперации, Вложения)
	
	Если Не ЗначениеЗаполнено(ПараметрыОперации.ПечатныеФормы) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПечатныхФорм = ДанныеПечатныхФорм(
		ПараметрыОперации.ДокументЗаказа,
		ПараметрыОперации.ПечатныеФормы);
	
	Для Каждого ПечатнаяФорма Из ПараметрыОперации.ПечатныеФормы Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Идентификатор", ПечатнаяФорма.Идентификатор);
		
		НайденныеСтроки = ДанныеПечатныхФорм.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() <> 1 Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось подготовить печатные формы к отправке вложений.
				|Неоднозначные данные для формы ""%1"".'"),
				ПечатнаяФорма.Представление);
		Иначе
			ФайлПечатнойФормы = НайденныеСтроки[0];
		КонецЕсли;
		
		Вложение = НовыйОписаниеВложения();
		Вложение.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(
			ФайлПечатнойФормы.ДвоичныеДанные,
			ПараметрыОперации.УникальныйИдентификатор);
		Вложение.ХешСумма      = ФайлПечатнойФормы.ХешСумма;
		Вложение.ИмяФайла      = ФайлПечатнойФормы.ИмяФайла;
		Вложение.Расширение    = ФайлПечатнойФормы.Расширение;
		Вложение.Представление = ПечатнаяФорма.Представление;
		Вложение.Идентификатор = ПечатнаяФорма.Идентификатор;
		
		Вложения.Вставить(ПечатнаяФорма.Идентификатор, Вложение);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодготовитьПрисоединенныеФайлыКОтправке(ПараметрыОперации, Вложения)
	
	Если Не ЗначениеЗаполнено(ПараметрыОперации.ПрисоединенныеФайлы)
		Или Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		Возврат;
	КонецЕсли;
	
	СохраненныеДанные = РегистрыСведений.ФайлыОнлайнЗаказов.ФайлыЗаказа(
		ПараметрыОперации.ДокументЗаказа);
	
	МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
	
	Для Каждого ПрисоединенныйФайл Из ПараметрыОперации.ПрисоединенныеФайлы Цикл
		
		Вложение = НовыйОписаниеВложения();
		ДанныеФайла = МодульРаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл);
		СохраненныеДанныеФайла = СохраненныеДанные.Получить(ПрисоединенныйФайл);
		
		Если СохраненныеДанныеФайла = Неопределено
			Или СохраненныеДанныеФайла.ДатаМодификации <> ДанныеФайла.ДатаМодификацииУниверсальная
			Или СохраненныеДанныеФайла.Размер <> ДанныеФайла.Размер Тогда
			
			ДвоичныеДанныеФайла = МодульРаботаСФайлами.ДвоичныеДанныеФайла(ПрисоединенныйФайл);
			
			ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
			ХешированиеДанных.Добавить(ДвоичныеДанныеФайла);
			ХешСумма = СтрЗаменить(Строка(ХешированиеДанных.ХешСумма), " ", "");
			
			Вложение = НовыйОписаниеВложения();
			Вложение.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(
				ДвоичныеДанныеФайла,
				ПараметрыОперации.УникальныйИдентификатор);
			Вложение.ХешСумма        = ХешСумма;
			Вложение.ДатаМодификации = ДанныеФайла.ДатаМодификацииУниверсальная;
			Вложение.Размер          = ДанныеФайла.Размер;
			
		Иначе
			ЗаполнитьЗначенияСвойств(
				Вложение,
				СохраненныеДанныеФайла);
		КонецЕсли;
		
		Вложение.ИмяФайла      = ДанныеФайла.ИмяФайла;
		Вложение.Расширение    = НРег(ДанныеФайла.Расширение);
		Вложение.Идентификатор = Строка(ПрисоединенныйФайл.УникальныйИдентификатор());
		Вложение.Представление = ДанныеФайла.Наименование;
		
		Вложения.Вставить(Вложение.Идентификатор, Вложение);
		
	КонецЦикла;
	
КонецПроцедуры

Функция НовыйОписаниеВложения()
	
	ОписаниеВложения = Новый Структура;
	ОписаниеВложения.Вставить("Идентификатор",             "");
	ОписаниеВложения.Вставить("Представление",             "");
	ОписаниеВложения.Вставить("ИмяФайла",                  "");
	ОписаниеВложения.Вставить("Расширение",                "");
	ОписаниеВложения.Вставить("АдресВоВременномХранилище", "");
	ОписаниеВложения.Вставить("ХешСумма",                  "");
	ОписаниеВложения.Вставить("ДатаМодификации",           Дата(1, 1, 1));
	ОписаниеВложения.Вставить("Размер",                    0);
	
	Возврат ОписаниеВложения;
	
КонецФункции

Функция ДанныеПечатныхФорм(ДокументЗаказа, ВыбранныеПечатныеФормы)
	
	ДанныеПечатныхФорм = НовыйОписаниеТаблицыДанныеПечатныхФорм();
	
	КомандыПечатиОбъекта = ОнлайнЗаказы.КомандыПечатиОбъектаДоступныеДляВложений(
		ДокументЗаказа.Метаданные());
		
	ОбъектПечати = Новый Массив;
	ОбъектПечати.Добавить(ДокументЗаказа);
	
	Для Каждого ВыбраннаяПечатнаяФорма Из ВыбранныеПечатныеФормы Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("УникальныйИдентификатор", ВыбраннаяПечатнаяФорма.Идентификатор);
		
		НайденныеСтроки = КомандыПечатиОбъекта.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() <> 1 Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось однозначно определить печатную форму по ее идентификатору ""%1"".'"),
				ВыбраннаяПечатнаяФорма.Идентификатор);
			Продолжить;
		Иначе
			КомандаПечати = НайденныеСтроки[0];
		КонецЕсли;
		
		РасширениеMXL = НРег(Строка(ТипФайлаТабличногоДокумента["MXL"]));
		
		ФорматыСохранения = Новый Массив;
		ФорматыСохранения.Добавить(ТипФайлаТабличногоДокумента["MXL"]);
		
		Если ВыбраннаяПечатнаяФорма.ФорматСохранения <> ТипФайлаТабличногоДокумента["MXL"]
			И ВыбраннаяПечатнаяФорма.ФорматСохранения <> ТипФайлаТабличногоДокумента["MXL7"] Тогда
			
			РасширениеПечатнойФормы = НРег(Строка(ВыбраннаяПечатнаяФорма.ФорматСохранения));
			ФорматыСохранения.Добавить(ВыбраннаяПечатнаяФорма.ФорматСохранения);
			
		Иначе
			РасширениеПечатнойФормы = РасширениеMXL;
		КонецЕсли;
		
		НастройкиСохранения = УправлениеПечатью.НастройкиСохранения();
		НастройкиСохранения.ФорматыСохранения = ФорматыСохранения;
		НастройкиСохранения.УпаковатьВАрхив = Ложь;
		НастройкиСохранения.ПереводитьИменаФайловВТранслит = ВыбраннаяПечатнаяФорма.ИмяФайлаВТранслите;
		НастройкиСохранения.ПодписьИПечать = ВыбраннаяПечатнаяФорма.ПодписьИПечать;
		
		ПечатныеФормы = УправлениеПечатью.НапечататьВФайл(
			КомандаПечати,
			ОбъектПечати,
			НастройкиСохранения);
		
		ДанныеПечатнойФормы = НовыйОписаниеДанныеПечатнойФормы();
		ДанныеПечатнойФормы.Идентификатор = ВыбраннаяПечатнаяФорма.Идентификатор;
		ДанныеПечатнойФормы.Расширение = НРег(ВыбраннаяПечатнаяФорма.ФорматСохранения);
		
		Для Каждого ПечатнаяФорма Из ПечатныеФормы Цикл
			Если СтрНайти(ПечатнаяФорма.ИмяФайла, РасширениеПечатнойФормы) > 0 Тогда
				ДанныеПечатнойФормы.ДвоичныеДанные = ПечатнаяФорма.ДвоичныеДанные;
				ДанныеПечатнойФормы.ИмяФайла       = ПечатнаяФорма.ИмяФайла;
			КонецЕсли;
			Если СтрНайти(ПечатнаяФорма.ИмяФайла, РасширениеMXL) > 0 Тогда
				ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
				ХешированиеДанных.Добавить(ПечатнаяФорма.ДвоичныеДанные);
				ДанныеПечатнойФормы.ХешСумма = СтрЗаменить(Строка(ХешированиеДанных.ХешСумма), " ", "");
			КонецЕсли;
		КонецЦикла;
		
		НовыеДанныеПечатнойФормы = ДанныеПечатныхФорм.Добавить();
		ЗаполнитьЗначенияСвойств(
			НовыеДанныеПечатнойФормы,
			ДанныеПечатнойФормы);
		
	КонецЦикла;
	
	Возврат ДанныеПечатныхФорм;
	
КонецФункции

Функция НовыйОписаниеТаблицыДанныеПечатныхФорм()
	
	ФайлыПечатныхФорм = Новый ТаблицаЗначений;
	
	ФайлыПечатныхФорм.Колонки.Добавить(
		"Идентификатор",
		Новый ОписаниеТипов(
			"Строка",
			,
			,
			,
			Новый КвалификаторыСтроки(50)));
	ФайлыПечатныхФорм.Колонки.Добавить(
		"ИмяФайла",
		Новый ОписаниеТипов(
			"Строка",
			,
			,
			,
			Новый КвалификаторыСтроки(100)));
	ФайлыПечатныхФорм.Колонки.Добавить(
		"Расширение",
		Новый ОписаниеТипов(
			"Строка",
			,
			,
			,
			Новый КвалификаторыСтроки(20)));
	ФайлыПечатныхФорм.Колонки.Добавить(
		"ХешСумма",
		Новый ОписаниеТипов(
			"Строка",
			,
			,
			,
			Новый КвалификаторыСтроки(64)));
	ФайлыПечатныхФорм.Колонки.Добавить("ДвоичныеДанные", Неопределено);
	
	Возврат ФайлыПечатныхФорм;
	
КонецФункции

Функция НовыйОписаниеДанныеПечатнойФормы()
	
	ДанныеПечатнойФормы = Новый Структура;
	
	ДанныеПечатнойФормы.Вставить("Идентификатор",  "");
	ДанныеПечатнойФормы.Вставить("ДвоичныеДанные", Неопределено);
	ДанныеПечатнойФормы.Вставить("ИмяФайла",       "");
	ДанныеПечатнойФормы.Вставить("Расширение",     "");
	ДанныеПечатнойФормы.Вставить("ХешСумма",       "");
	
	Возврат ДанныеПечатнойФормы;
	
КонецФункции

Функция ВложенияПользователяПоУмолчанию(ДокументЗаказа)
	
	ДанныеВложений = ОнлайнЗаказыКлиентСервер.НовыйДанныеВложений();
	
	ВложенияПоУмолчанию = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ОтправкаURLОнлайнЗаказов",
		"ОтправкаURLОнлайнЗаказов_ВложенияПоУмолчанию",
		Новый Структура,
		,
		ИмяПользователя());
	
	Если Не ЗначениеЗаполнено(ВложенияПоУмолчанию) Тогда
		Возврат ДанныеВложений;
	КонецЕсли;
	
	Если ВложенияПоУмолчанию.ИдентификаторыПечатныхФорм.Количество() = 0 Тогда
		Возврат ДанныеВложений;
	КонецЕсли;
	
	ИдентификаторыПечатныхФорм = Новый Массив;
	ПечатныеФормыПоУмолчанию = Новый Массив;
	ПечатныеФормыЗаказа = ПечатныеФормыЗаказа(ДокументЗаказа);
	ЗапрещенныеРасширенияФайла = ЗапрещенныеРасширенияФайла();
	
	Для Каждого ПечатнаяФормаЗаказа Из ПечатныеФормыЗаказа Цикл
		
		Если СтрНайти(ЗапрещенныеРасширенияФайла, НРег(ПечатнаяФормаЗаказа.ФорматСохранения)) <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВложенияПоУмолчанию.ИдентификаторыПечатныхФорм.Найти(ПечатнаяФормаЗаказа.Идентификатор) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИдентификаторыПечатныхФорм.Найти(ПечатнаяФормаЗаказа.Идентификатор) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПечатнаяФорма = Новый Структура;
		ПечатнаяФорма.Вставить("Идентификатор",      ПечатнаяФормаЗаказа.Идентификатор);
		ПечатнаяФорма.Вставить("Представление",      ПечатнаяФормаЗаказа.Представление);
		ПечатнаяФорма.Вставить("ФорматСохранения",   ПечатнаяФормаЗаказа.ФорматСохранения);
		ПечатнаяФорма.Вставить("ИмяФайлаВТранслите", ПечатнаяФормаЗаказа.ИмяФайлаВТранслите);
		ПечатнаяФорма.Вставить("ПодписьИПечать",     ПечатнаяФормаЗаказа.ПодписьИПечать);
		
		ПечатныеФормыПоУмолчанию.Добавить(ПечатнаяФорма);
		ИдентификаторыПечатныхФорм.Добавить(ПечатнаяФормаЗаказа.Идентификатор);
		
	КонецЦикла;
	
	ДанныеВложений.ПечатныеФормы = ПечатныеФормыПоУмолчанию;
	
	Возврат ДанныеВложений;
	
КонецФункции

#КонецОбласти

#Область ОтправкаURLShare

Функция ПараметрыОперацииURLShare(
	ДокументЗаказа,
	ЗаказНаОплату,
	НастройкаПодключения,
	ПараметрыСсылки,
	ДанныеВложений)
	
	ПараметрыОперации = НовыйПараметрыОперацииURLShare();
	ПараметрыОперации.ИдентификаторЗаказа = ПараметрыСсылки.ИдентификаторЗаказа;
	ПараметрыОперации.НастройкаПодключения = НастройкаПодключения;
	
	ПараметрыЗаказа = ПараметрыЗаказаURLShare(ЗаказНаОплату, ПараметрыСсылки);
	
	Вложения = ВложенияURLShare(ДанныеВложений);
	
	ИнтеграцияПодсистемБИП.ПриАктивацииЗаказа(
		ДокументЗаказа,
		Вложения,
		ПараметрыЗаказа);
	ОнлайнЗаказыПереопределяемый.ПриАктивацииЗаказа(
		ДокументЗаказа,
		Вложения,
		ПараметрыЗаказа);
	
	РегистрыСведений.ИдентификаторыОнлайнЗаказов.УстановитьОтложенноеПолучениеURLShare(
		ДокументЗаказа,
		ПараметрыЗаказа.СервисShare.ОшибкаПолученияURL);
	
	ПараметрыОперации.URLShare = ПараметрыЗаказа.СервисShare.URLДокумента;
	
	Возврат ПараметрыОперации;
	
КонецФункции

Функция НовыйПараметрыОперацииURLShare()
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторЗаказа", "");
	Результат.Вставить("URLShare", "");
	Результат.Вставить(
		"НастройкаПодключения",
		Справочники.НастройкиПодключенияКОнлайнЗаказам.ПустаяСсылка());
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыЗаказаURLShare(ЗаказНаОплату, ПараметрыСсылки)
	
	ПараметрыShare = Новый Структура;
	ПараметрыShare.Вставить("ОшибкаПолученияURL", Ложь);
	ПараметрыShare.Вставить("URLДокумента", "");
	
	Результат = Новый Структура;
	Результат.Вставить("СрокЖизни", ПараметрыСсылки.СрокЖизни);
	Результат.Вставить("ТипКонтрагента", ЗаказНаОплату.ОбщиеПараметрыЗаказа.ТипКонтрагента);
	Результат.Вставить("СервисShare", ПараметрыShare);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйВложениеURLShare()
	
	Результат = Новый Структура;
	Результат.Вставить("ДвоичныеДанные", Неопределено);
	Результат.Вставить("ИмяФайла", "");
	Результат.Вставить("Расширение", "");
	Результат.Вставить("Представление", "");
	
	Возврат Результат;
	
КонецФункции

Функция ВложенияURLShare(ДанныеВложений)
	
	Вложения = Новый Массив;
	
	Для Каждого ДанныеВложения Из ДанныеВложений Цикл
		
		Вложение = НовыйВложениеURLShare();
		Вложение.ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеВложения.Значение.АдресВоВременномХранилище);
		Вложение.ИмяФайла = ДанныеВложения.Значение.ИмяФайла;
		Вложение.Расширение = ДанныеВложения.Значение.Расширение;
		Вложение.Представление = ДанныеВложения.Значение.Представление;
		
		Вложения.Добавить(Вложение);
		
	КонецЦикла;
	
	Возврат Вложения;
	
КонецФункции

#КонецОбласти

#Область ДеактивацияURLShare

Процедура ДеактивироватьURLShare(ДокументЗаказа, URLShare)
	
	ПараметрыЗаказа = Новый Структура;
	ПараметрыЗаказа.Вставить("URLShare", URLShare);
	
	ИнтеграцияПодсистемБИП.ПриДеактивацииЗаказа(
		ДокументЗаказа,
		ПараметрыЗаказа);
	ОнлайнЗаказыПереопределяемый.ПриДеактивацииЗаказа(
		ДокументЗаказа,
		ПараметрыЗаказа);
	
КонецПроцедуры

#КонецОбласти

#Область ОтложенноеПолучениеСтатусов

// Выполняет загрузку статусов онлайн-заказов, по которым было
// отложено получение результата.
//
// Возвращаемое значение:
//  Массив из ОпределяемыйТип.ДокументОнлайнЗаказаБИП - перечень обработанных документов.
//
Функция АктуализироватьСтатусыЗаказов() Экспорт
	
	СлужебнаяОнлайнЗаказыДоступны();
	
	ОбработанныеЗаказы = Новый Массив;
	ДанныеЗаказов = ДанныеЗаказовДляПолученияСтатуса(ОбработанныеЗаказы);
	
	Если ДанныеЗаказов.Количество() = 0 Тогда
		Возврат ОбработанныеЗаказы;
	КонецЕсли;
	
	Для Каждого ЗаказыПоНастройке Из ДанныеЗаказов Цикл
		
		ИдентификаторыЗаказов = Новый Массив;
		
		Для Каждого ИдентификаторЗаказа Из ЗаказыПоНастройке.Значение Цикл
			ИдентификаторыЗаказов.Добавить(ИдентификаторЗаказа.Ключ);
			Если ИдентификаторыЗаказов.Количество() = 100 Тогда
				
				АктуализироватьСтатусыПорцииЗаказов(
					ИдентификаторыЗаказов,
					ЗаказыПоНастройке,
					ОбработанныеЗаказы);
					
				ИдентификаторыЗаказов.Очистить();
				
			КонецЕсли;
		КонецЦикла;
		
		Если ИдентификаторыЗаказов.Количество() > 0 Тогда
			АктуализироватьСтатусыПорцииЗаказов(
				ИдентификаторыЗаказов,
				ЗаказыПоНастройке,
				ОбработанныеЗаказы);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбработанныеЗаказы;
	
КонецФункции

// Выполняет актуализацию статусов порции заказов.
//
// Параметры:
//  ИдентификаторыЗаказов - Массив Из Строка - порция идентификаторов онлайн-заказов
//    по которым будет выполняться запрос статусов в сервисе;
//  ЗаказыПоНастройке - Соответствие Из КлючИЗначение - перечень настроек и документов по которым необходимо
//     выполнить получение статуса:
//    * Ключ - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - настройка онлайн-заказов.
//    * Значение - Соответствие Из КлючИЗначение - данные заказов, по которым необходимо загрузить статус.
//  ОбработанныеЗаказы - Массив из ОпределяемыйТип.ДокументОнлайнЗаказаБИП - данные обработанных документов.
//
Процедура АктуализироватьСтатусыПорцииЗаказов(
	ИдентификаторыЗаказов,
	ЗаказыПоНастройке,
	ОбработанныеЗаказы)
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("НастройкаПодключения",  ЗаказыПоНастройке.Ключ);
	ПараметрыОперации.Вставить("ИдентификаторыЗаказов", ИдентификаторыЗаказов);
	
	РезультатПолучения = ОнлайнЗаказыСервис.ПолучениеИнформацииПоЗаказам(ПараметрыОперации);
	
	// Ошибка запроса увеличим количество попыток запроса для всех документов заказа.
	Если ЗначениеЗаполнено(РезультатПолучения.КодОшибки) Тогда
		
		Для Каждого ИдентификаторЗаказа Из ЗаказыПоНастройке.Значение Цикл
			РегистрыСведений.ИдентификаторыОнлайнЗаказов.УвеличитьКоличествоПопытокЗапросаСтатуса(
				ИдентификаторЗаказа.Значение);
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	ИдентификаторыДанныхСервиса = Новый Массив;
	
	Для Каждого ДанныеЗаказа Из РезультатПолучения.ДанныеЗаказов Цикл
		
		ДокументЗаказа = ЗаказыПоНастройке.Значение.Получить(
			ДанныеЗаказа.ИдентификаторЗаказа);
		ИдентификаторыДанныхСервиса.Добавить(
			ДанныеЗаказа.ИдентификаторЗаказа);
		
		ПараметрыОплаты = Новый Соответствие;
		ПараметрыНастройкиОплаты = Новый Структура;
		
		Если ДанныеЗаказа.Статус = СтатусЗаказаОплачен() Тогда
			
			ОнлайнЗаказыСобытия.ПриЗаполненииПараметровОплаты(
				ДанныеЗаказа,
				ПараметрыОплаты,
				ПараметрыНастройкиОплаты,
				ЗаказыПоНастройке.Ключ);
			
			ОнлайнЗаказыСобытия.ПриЗаписиДанныхОплаты(
				ДокументЗаказа,
				ДанныеЗаказа.СпособОплаты,
				ПараметрыОплаты,
				ПараметрыНастройкиОплаты);
			
		КонецЕсли;
		
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьСтатусЗаказа(
			ДокументЗаказа,
			ДанныеЗаказа.Статус,
			НовыйДанныеОплаты(ДанныеЗаказа.СпособОплаты, ДанныеЗаказа.СуммаЗаказа),
			НовыйДанныеФискализации(ДанныеЗаказа.ПараметрыФискализации),
			Ложь);
		
		Если ДанныеЗаказа.Статус = ОнлайнЗаказыКлиентСервер.СтатусЗаказаИстекСрокЖизни()
			Или ДанныеЗаказа.Статус = СтатусЗаказаОплачен() Тогда
			ПриЗагрузкеСтатусаЗаказа(
				ДокументЗаказа,
				ПараметрыОплаты,
				ДанныеЗаказа.ПараметрыФискализации,
				ДанныеЗаказа.Статус,
				"",
				ОбработанныеЗаказы);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ИдентификаторЗаказа Из ИдентификаторыЗаказов Цикл
		
		Если ИдентификаторыДанныхСервиса.Найти(ИдентификаторЗаказа) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Сервис не вернул данные по идентификатору заказа, увеличиваем количество попыток.
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.УвеличитьКоличествоПопытокЗапросаСтатуса(
			ЗаказыПоНастройке.Значение.Получить(ИдентификаторЗаказа));
		
	КонецЦикла;
	
КонецПроцедуры

// Определяет заказы по котором необходимо выполнить получение статуса.
//
// Параметры:
//  ОбработанныеЗаказы - Массив из ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//   являющийся основанием для заказа.
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - перечень настроек и документов по которым необходимо выполнить получение статуса:
//    * Ключ - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - настройка создания заказа.
//    * Значение - Соответствие Из КлючИЗначение - данные заказов, по которым необходимо загрузить статус.
//
Функция ДанныеЗаказовДляПолученияСтатуса(ОбработанныеЗаказы)
	
	ОтложенныеЗаказы = РегистрыСведений.ИдентификаторыОнлайнЗаказов.ОтложенныеЗаказы();
	
	ДанныеОтложенныхЗаказов = Новый Соответствие;
	
	Для Каждого КлючЗначение Из ОтложенныеЗаказы Цикл
		
		ИдентификаторыДляОбработки = Новый Соответствие;
		
		Для Каждого ОтложенныйЗаказ Из КлючЗначение.Значение Цикл
			
			// Если заказ уже в терминальном статусе, выполнять запрос
			// не имеет смысла, необходимо выполнить обработку в прикладной
			// логике и перейти к следующей.
			Если ОтложенныйЗаказ.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаИстекСрокЖизни()
				Или ОтложенныйЗаказ.СтатусЗаказа = СтатусЗаказаОплачен() Тогда
				ПриЗагрузкеСтатусаЗаказа(
					ОтложенныйЗаказ.ДокументЗаказа,
					ОтложенныйЗаказ.ПараметрыОплаты,
					ОтложенныйЗаказ.ПараметрыФискализации,
					ОтложенныйЗаказ.СтатусЗаказа,
					"",
					ОбработанныеЗаказы);
				Продолжить;
			Иначе
				ИдентификаторыДляОбработки.Вставить(
					ОтложенныйЗаказ.ИдентификаторЗаказа,
					ОтложенныйЗаказ.ДокументЗаказа);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ИдентификаторыДляОбработки.Количество() > 0 Тогда
			ДанныеОтложенныхЗаказов.Вставить(КлючЗначение.Ключ, ИдентификаторыДляОбработки);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеОтложенныхЗаказов;
	
КонецФункции

// Определяет алгоритм обработки операций, статус которых был получен регламентным заданием.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ, который отражает
//    операцию в информационной базе;
//  ПараметрыОплаты - Соответствие Из КлючИЗначение - Содержит данные оплат по способам:
//    * Ключ - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов - способ оплаты
//    * Значение - Структура - Параметры оплат, сформированные в методе
//      ОнлайнЗаказыСобытия.ПриЗаполненииПараметровОплаты.
//  ДанныеФискализации - Структура, Неопределено - данные фискализации:
//    * СтатусОперации - Строка - статус операции;
//    * ОписаниеСтатусаОперации - Строка - описание статуса;
//  СтатусЗаказаСервис - Строка - текущее состояние заказа по данным сервиса. Для проверки статуса,
//    необходимо использовать функции программного интерфейса общего модуля
//    ОнлайнЗаказыКлиентСервер. Возможные значения:
//      - "Отменен" - онлайн-заказ отменен;
//      - "Оплачен" - онлайн-заказ оплачен;
//      - "Ошибка" - не удалось выполнить проверку статуса заказа из-за ошибки.
//  СообщениеОбОшибке - Строка - сообщение пользователю. Заполняется в случае ошибки;
//  ОбработанныеЗаказы - Массив из ОпределяемыйТип.ДокументОнлайнЗаказаБИП - данные обработанных документов.
//
Процедура ПриЗагрузкеСтатусаЗаказа(
		ДокументЗаказа,
		ПараметрыОплаты,
		ДанныеФискализации,
		СтатусЗаказаСервис,
		СообщениеОбОшибке,
		ОбработанныеЗаказы)
	
	Если СтатусЗаказаСервис <> СтатусЗаказаОплачен()
		И СтатусЗаказаСервис <> ОнлайнЗаказыКлиентСервер.СтатусЗаказаИстекСрокЖизни() Тогда
		
		ЗаписатьИнформациюВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Передан не валидный статус операции %1 в отложенную обработку.'"),
				СтатусЗаказаСервис),
			Истина);
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.УстановитьОтложенноеПолучениеСтатуса(
			ДокументЗаказа,
			Ложь);
		
	КонецЕсли;
	
	ПараметрыФискализации = ПараметрыФискализации(ДанныеФискализации);
	
	Попытка
		
		Обработан = Ложь;
		
		ИнтеграцияПодсистемБИП.ПриЗагрузкеСтатусаЗаказа(
			ДокументЗаказа,
			ПредставлениеСтатусаЗаказа(СтатусЗаказаСервис),
			ПараметрыОплаты,
			ПараметрыФискализации,
			Обработан);
		ОнлайнЗаказыПереопределяемый.ПриЗагрузкеСтатусаЗаказа(
			ДокументЗаказа,
			ПредставлениеСтатусаЗаказа(СтатусЗаказаСервис),
			ПараметрыОплаты,
			ПараметрыФискализации,
			Обработан);
		
		Если Обработан = Истина Тогда
			ЗафиксироватьОбработкуЗаказа(
				ДокументЗаказа,
				ОбработанныеЗаказы,
				ПараметрыФискализации,
				ДанныеФискализации);
		КонецЕсли;
		
	Исключение
		
		Если ТранзакцияАктивна() Тогда
			
			ОтменаТранзакции = Ложь;
			Пока ТранзакцияАктивна() Цикл
				ОтменитьТранзакцию(); // АПК:325 Отмена незакрытых транзакций.
				ОтменаТранзакции = Истина;
			КонецЦикла;
			
			Если ОтменаТранзакции Тогда
				ЗаписатьИнформациюВЖурналРегистрации(
					НСтр("ru = 'По завершении выполнения обработчика ПриЗагрузкеСтатусаЗаказ не была закрыта транзакция.'"),
					Истина);
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаписатьИнформациюВЖурналРегистрации(
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			Истина);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗафиксироватьОбработкуЗаказа(
	ДокументЗаказа,
	ОбработанныеЗаказы,
	ПараметрыФискализации,
	ДанныеФискализации)
	
	НачатьТранзакцию();
	
	Попытка
		
		ОбработатьФискализацию(ДокументЗаказа, ПараметрыФискализации, ДанныеФискализации);
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.УстановитьОтложенноеПолучениеСтатуса(
			ДокументЗаказа,
			Ложь);
		ОбработанныеЗаказы.Добавить(ДокументЗаказа);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При фиксации обработки онлайн-заказа возникли ошибки:
				|%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ЗаписатьИнформациюВЖурналРегистрации(
			ТекстИсключения,
			Истина);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеОнлайнЗаказом

// Выполняет подготовку вложений и активирует онлайн-заказ.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//   являющийся основанием для заказа.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    настройка выполнения операции.
//
// Возвращаемое значение:
//  Структура - результат создания ссылки онлайн-заказа:
//    * URLЗаказа - Строка - Ссылка на онлайн-заказ;
//    * СтатусЗаказа - Строка - Текущий статус онлайн-заказа;
//    * СуммаЗаказа - Число - Сумма онлайн-заказа;
//    * НеобходимоАктуализировать - Булево - признак необходимости обновления данных в сервисе;
//    * ОшибкиВалидацииЗаказа - Массив из Строка - перечень ошибок валидации онлайн-заказа;
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "УжеОплачен" - документ уже оплачен;
//        - "НедопустимыйСтатус" - онлайн-заказ находится в недопустимом статусе для выполнения операции;
//        - "ОтсутствуетДоступКСервису" - у пользователя нет доступа к сервису;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//        - "ИнтеграцияНеИспользуется" - использование отключено в настройках;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция АктивироватьЗаказСПодготовкойВложений(
	ДокументЗаказа,
	НастройкаПодключения,
	ПараметрыОперации) Экспорт
	
	ДанныеВложений = ПодготовитьДанныеВложений(ПараметрыОперации);
	
	Возврат АктивироватьЗаказ(
		ДокументЗаказа,
		НастройкаПодключения,
		ДанныеВложений);
	
КонецФункции

// Активирует онлайн-заказ.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//   являющийся основанием для заказа.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    настройка выполнения операции.
//  ДанныеВложений - см. ПодготовитьДанныеВложений.
//
// Возвращаемое значение:
//  Структура - результат создания ссылки онлайн-заказа:
//    * URLЗаказа - Строка - Ссылка на онлайн-заказ;
//    * СтатусЗаказа - Строка - Текущий статус онлайн-заказа;
//    * СуммаЗаказа - Число - Сумма онлайн-заказа;
//    * НеобходимоАктуализировать - Булево - признак необходимости обновления данных в сервисе;
//    * ОшибкиВалидацииЗаказа - Массив из Строка - перечень ошибок валидации онлайн-заказа;
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "УжеОплачен" - документ уже оплачен;
//        - "НедопустимыйСтатус" - онлайн-заказ находится в недопустимом статусе для выполнения операции;
//        - "ОтсутствуетДоступКСервису" - у пользователя нет доступа к сервису;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//        - "ИнтеграцияНеИспользуется" - использование отключено в настройках;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * НеобходимоАктуализироватьURLShare - Булево - признак необходимости актуализации URL Share.
//
Функция АктивироватьЗаказ(
	ДокументЗаказа,
	НастройкаПодключения,
	ДанныеВложений) Экспорт
	
	СлужебнаяОнлайнЗаказыДоступны();
	
	РезультатОперации = НовыйРезультатСтатусЗаказа();
	РезультатОперации.Вставить("ОшибкиВалидацииЗаказа", Новый Массив);
	
	ПараметрыСсылки = РегистрыСведений.ИдентификаторыОнлайнЗаказов.ПараметрыСсылкиПоДокументуЗаказа(
		ДокументЗаказа);
	
	Если Не ЗначениеЗаполнено(ПараметрыСсылки.ИдентификаторЗаказа) Тогда
		РезультатОперации.КодОшибки = КодОшибкиИдентификаторНеНайден();
		РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Не обнаружен идентификатор заказа.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Не обнаружен идентификатор заказа.'");
	ИначеЕсли ПараметрыСсылки.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаИстекСрокЖизни() Тогда
		РезультатОперации.СтатусЗаказа = ПараметрыСсылки.СтатусЗаказа;
		РезультатОперации.КодОшибки = ОнлайнЗаказыКлиентСервер.КодОшибкиНедопустимыйСтатус();
		РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'У заказа истек срок жизни, активация невозможна.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'У заказа истек срок жизни, активация невозможна.'");
	ИначеЕсли ПараметрыСсылки.СтатусЗаказа = СтатусЗаказаОплачен() Тогда
		РезультатОперации.СтатусЗаказа = ПараметрыСсылки.СтатусЗаказа;
		РезультатОперации.КодОшибки = КодОшибкиУжеОплачен();
		РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Заказ уже оплачен, активация не требуется.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Заказ уже оплачен, активация не требуется.'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	// Подготовка параметров настройки подключения.
	ПараметрыНастройки = ПараметрыНастройки(
		ПараметрыСсылки.НастройкаПодключения);
	
	// Проверка общих параметров подключения.
	ПроверитьОбщиеНастройкиПодключения(
		ДокументЗаказа,
		ПараметрыСсылки.НастройкаПодключения,
		ПараметрыНастройки,
		Истина,
		РезультатОперации);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	ЗаказНаОплату = СформироватьОписаниеЗаказаНаОплату(
		РезультатОперации,
		ДокументЗаказа,
		ПараметрыНастройки);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	ПараметрыОперацииURLShare = ПараметрыОперацииURLShare(
		ДокументЗаказа,
		ЗаказНаОплату,
		НастройкаПодключения,
		ПараметрыСсылки,
		ДанныеВложений);
	
	РезультатУстановкиСсылкиShare = ОнлайнЗаказыСервис.УстановитьСсылкуShare(
		ПараметрыОперацииURLShare);
	
	РезультатАктивации = ОнлайнЗаказыСервис.АктивироватьЗаказ(ПараметрыСсылки.ИдентификаторЗаказа);
	
	Если ЗначениеЗаполнено(РезультатАктивации.КодОшибки) Тогда
		
		ЗаполнитьЗначенияСвойств(
			РезультатОперации,
			РезультатАктивации,
			"КодОшибки, СообщениеОбОшибке, ИнформацияОбОшибке");
		
		Если РезультатАктивации.КодОшибки = ОнлайнЗаказыКлиентСервер.КодОшибкиНедопустимыйСтатус() Тогда
			РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьСтатусЗаказа(
				ДокументЗаказа,
				РезультатАктивации.СтатусЗаказаВСервисе,
				Неопределено,
				Неопределено,
				Ложь);
			РезультатОперации.СтатусЗаказа = РезультатАктивации.СтатусЗаказаВСервисе;
		Иначе
			РезультатОперации.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибка();
		КонецЕсли;
		
		Возврат РезультатОперации;
		
	КонецЕсли;
	
	ЗаказНаОплату = ДанныеЗаказаНаОплатуПоДокументу(
		РезультатОперации,
		ДокументЗаказа,
		ПараметрыНастройки(НастройкаПодключения),
		РезультатАктивации.КонтрольнаяСумма,
		ЗаказНаОплату);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатАктивации);
	
	РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьСтатусЗаказа(
		ДокументЗаказа,
		РезультатОперации.СтатусЗаказа,
		Неопределено,
		Неопределено,
		Ложь);
	
	НастройкиОплаты = НастройкиОплаты(
		ПараметрыНастройки.НастройкиОплат,
		ПараметрыНастройки.НастройкиПриемаОплатПоРеквизитам,
		ЗаказНаОплату.ПараметрыОплат,
		ЗаказНаОплату.ОбщиеПараметрыЗаказа.ТипКонтрагента);
	
	Если ЗаказНаОплату.КонтрольнаяСумма = Неопределено Тогда
		ЗаказНаОплату.КонтрольнаяСумма = РассчитатьКонтрольнуюСумму(
			ЗаказНаОплату,
			НастройкиОплаты,
			АктуальнаяВерсияКонтрольнойСуммы());
	КонецЕсли;
	
	Если ЗаказНаОплату.КонтрольнаяСумма.Значение <> РезультатАктивации.КонтрольнаяСумма Тогда
		РезультатОперации.НеобходимоАктуализировать = Истина;
	КонецЕсли;
	
	РезультатОперации.НеобходимоАктуализироватьURLShare =
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.НеобходимаАктуализацияURLShare(ДокументЗаказа);
	
	РезультатОперации.ОшибкиВалидацииЗаказа = ОшибкиВалидацииЗаказа(ЗаказНаОплату);
	
	Возврат РезультатОперации;
	
КонецФункции

// Деактивирует онлайн-заказ.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//   являющийся основанием для заказа.
//
// Возвращаемое значение:
//  Структура - результат создания ссылки онлайн-заказа:
//    * URLЗаказа - Строка - Ссылка на онлайн-заказ;
//    * СтатусЗаказа - Строка - Текущий статус онлайн-заказа;
//    * СуммаЗаказа - Число - Сумма онлайн-заказа;
//    * НеобходимоАктуализировать - Булево - признак необходимости обновления данных в сервисе;
//    * ОшибкиВалидацииЗаказа - Массив из Строка - перечень ошибок валидации онлайн-заказа;
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "УжеОплачен" - документ уже оплачен;
//        - "НедопустимыйСтатус" - онлайн-заказ находится в недопустимом статусе для выполнения операции;
//        - "ОтсутствуетДоступКСервису" - у пользователя нет доступа к сервису;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//        - "ИнтеграцияНеИспользуется" - использование отключено в настройках;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ДеактивироватьЗаказ(ДокументЗаказа) Экспорт
	
	СлужебнаяОнлайнЗаказыДоступны();
	
	РезультатОперации = НовыйРезультатОперации();
	РезультатОперации.Вставить("СтатусЗаказа", "");
	РезультатОперации.Вставить("URLЗаказа",    "");
	
	ПараметрыСсылки = РегистрыСведений.ИдентификаторыОнлайнЗаказов.ПараметрыСсылкиПоДокументуЗаказа(
		ДокументЗаказа);
		
	Если Не ЗначениеЗаполнено(ПараметрыСсылки.ИдентификаторЗаказа) Тогда
		РезультатОперации.КодОшибки = КодОшибкиНеверныйФорматЗапроса();
		РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Не обнаружен идентификатор заказа.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Не обнаружен идентификатор заказа.'");
	ИначеЕсли ПараметрыСсылки.СтатусЗаказа = СтатусЗаказаОплачен() Тогда
		РезультатОперации.СтатусЗаказа = ПараметрыСсылки.СтатусЗаказа;
		РезультатОперации.КодОшибки = КодОшибкиУжеОплачен();
		РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Заказ уже оплачен, деактивация невозможна.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Заказ уже оплачен, деактивация невозможна.'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	// Подготовка параметров настройки подключения.
	ПараметрыНастройки = ПараметрыНастройки(
		ПараметрыСсылки.НастройкаПодключения);
	
	// Проверка общих параметров подключения.
	ПроверитьОбщиеНастройкиПодключения(
		ДокументЗаказа,
		ПараметрыСсылки.НастройкаПодключения,
		ПараметрыНастройки,
		Ложь,
		РезультатОперации);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	РезультатДеактивации = ОнлайнЗаказыСервис.ДеактивироватьЗаказ(ПараметрыСсылки.ИдентификаторЗаказа);
	
	Если ЗначениеЗаполнено(РезультатДеактивации.КодОшибки) Тогда
		
		ЗаполнитьЗначенияСвойств(
			РезультатОперации,
			РезультатДеактивации,
			"КодОшибки, СообщениеОбОшибке, ИнформацияОбОшибке");
		
		Если РезультатДеактивации.КодОшибки = ОнлайнЗаказыКлиентСервер.КодОшибкиНедопустимыйСтатус() Тогда
			
			РезультатОперации.СтатусЗаказа = РезультатДеактивации.СтатусЗаказаВСервисе;
			
			Если РезультатОперации.СтатусЗаказа = СтатусЗаказаОплачен()
				Или РезультатОперации.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаВыполняетсяОплата() Тогда
				ПараметрыЗаказа = ПараметрыЗаказа(ДокументЗаказа);
				РезультатПолученияСтатуса = АктуализироватьСтатусЗаказа(ПараметрыЗаказа);
				РезультатОперации.URLЗаказа = РезультатПолученияСтатуса.URLЗаказа;
			Иначе
				РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьСтатусЗаказа(
					ДокументЗаказа,
					РезультатОперации.СтатусЗаказа,
					Неопределено,
					Неопределено,
					Ложь);
			КонецЕсли;
			
		Иначе
			РезультатОперации.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаОшибка();
			
			РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьСтатусЗаказа(
				ДокументЗаказа,
				РезультатОперации.СтатусЗаказа,
				Неопределено,
				Неопределено,
				Ложь);
			
		КонецЕсли;
	Иначе
		
		ЗаполнитьЗначенияСвойств(
			РезультатОперации,
			РезультатДеактивации);
		
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьСтатусЗаказа(
			ДокументЗаказа,
			РезультатОперации.СтатусЗаказа,
			Неопределено,
			Неопределено,
			Ложь);
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(РезультатДеактивации.URLShare) Тогда
		ДеактивироватьURLShare(
			ДокументЗаказа,
			РезультатДеактивации.URLShare);
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

Функция УстановитьСтатусОплачен(
	ДокументЗаказа,
	ПараметрыОплаты) Экспорт
	
	СлужебнаяОнлайнЗаказыДоступны();
	
	СпособОплаты = СпособОплатыПоПредставлению(ПараметрыОплаты.СпособОплаты);
	
	РезультатОперации = НовыйРезультатСтатусЗаказа();
	
	ПараметрыСсылки = РегистрыСведений.ИдентификаторыОнлайнЗаказов.ПараметрыСсылкиПоДокументуЗаказа(
		ДокументЗаказа);
	
	Если Не ЗначениеЗаполнено(ПараметрыСсылки.ИдентификаторЗаказа) Тогда
		РезультатОперации.КодОшибки = КодОшибкиИдентификаторНеНайден();
		РезультатОперации.СообщениеОбОшибке = НСтр("ru = 'Не обнаружен идентификатор заказа.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Не обнаружен идентификатор заказа.'");
	ИначеЕсли ПараметрыСсылки.СтатусЗаказа = СтатусЗаказаОплачен()
		И СпособОплаты <> ПараметрыСсылки.СпособОплаты Тогда
		РезультатОперации.СтатусЗаказа = ПараметрыСсылки.СтатусЗаказа;
		РезультатОперации.КодОшибки = КодОшибкиУжеОплачен();
		РезультатОперации.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Заказ уже оплачен другим способом оплаты - %1.'"),
			ПараметрыСсылки.СпособОплаты);
		РезультатОперации.ИнформацияОбОшибке = РезультатОперации.СообщениеОбОшибке;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	// Подготовка параметров настройки подключения.
	ПараметрыНастройки = ПараметрыНастройки(ПараметрыСсылки.НастройкаПодключения);
	
	// Проверка общих параметров подключения.
	ПроверитьОбщиеНастройкиПодключения(
		ДокументЗаказа,
		ПараметрыСсылки.НастройкаПодключения,
		ПараметрыНастройки,
		Ложь,
		РезультатОперации);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	ДанныеЗаказа = ДанныеЗаказаНаОплатуПоДокументу(
		РезультатОперации,
		ДокументЗаказа,
		ПараметрыНастройки,
		АктуальнаяВерсияКонтрольнойСуммы(),
		Неопределено);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	НастройкиОплаты = НастройкиОплаты(
		ПараметрыНастройки.НастройкиОплат,
		ПараметрыНастройки.НастройкиПриемаОплатПоРеквизитам,
		ДанныеЗаказа.ПараметрыОплат,
		ДанныеЗаказа.ОбщиеПараметрыЗаказа.ТипКонтрагента);
	
	Если ДанныеЗаказа.КонтрольнаяСумма = Неопределено Тогда
		ДанныеЗаказа.КонтрольнаяСумма = РассчитатьКонтрольнуюСумму(
			ДанныеЗаказа,
			НастройкиОплаты,
			АктуальнаяВерсияКонтрольнойСуммы());
	КонецЕсли;
	
	РезультатУстановкиСтатуса = ОнлайнЗаказыСервис.УстановитьСтатусОплачен(
		ДанныеЗаказа,
		ПараметрыСсылки,
		СпособОплаты);
	
	Если Не РезультатУстановкиСтатуса.ХешАктуален Тогда
		
		ДанныеЗаказа.Вставить("ИдентификаторЗаказа", ПараметрыСсылки.ИдентификаторЗаказа);
		
		РезультатДеактивации = ДеактивироватьЗаказ(ДокументЗаказа);
	
		Если ЗначениеЗаполнено(РезультатДеактивации.КодОшибки) Тогда
			
			РезультатОперации.КодОшибки = КодОшибкиНеверныйФорматЗапроса();
			РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Заказ изменен. Ошибка при попытке деактивации заказа в сервисе.'");
			РезультатОперации.ИнформацияОбОшибке = РезультатДеактивации.ИнформацияОбОшибке;
			
			Возврат РезультатОперации;
			
		КонецЕсли;
		
		РезультатОбновления = ОнлайнЗаказыСервис.СформироватьЗаказ(
			ДанныеЗаказа,
			ПараметрыСсылки.НастройкаПодключения,
			НастройкиОплаты);
		
		Если ЗначениеЗаполнено(РезультатОбновления.КодОшибки) Тогда
			
			РезультатОперации.КодОшибки = КодОшибкиНеверныйФорматЗапроса();
			РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Заказ изменен. Ошибка при попытке обновления заказа в сервисе.'");
			РезультатОперации.ИнформацияОбОшибке = РезультатОбновления.ИнформацияОбОшибке;
			
			Возврат РезультатОперации;
			
		КонецЕсли;
		
		РезультатУстановкиСтатуса = ОнлайнЗаказыСервис.УстановитьСтатусОплачен(
			ДанныеЗаказа,
			ПараметрыСсылки,
			СпособОплаты);
	
	КонецЕсли;
	
	Если ПустаяСтрока(РезультатУстановкиСтатуса.КодОшибки) Тогда
		РегистрыСведений.ИдентификаторыОнлайнЗаказов.ЗаписатьСтатусЗаказа(
			ДокументЗаказа,
			СтатусЗаказаОплачен(),
			НовыйДанныеОплаты(СпособОплаты, РезультатУстановкиСтатуса.СуммаЗаказа),
			Неопределено,
			Истина);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатУстановкиСтатуса);
	
	Возврат РезультатОперации;
	
КонецФункции

Функция АктуализироватьURLShare(
	ДокументЗаказа,
	НастройкаПодключения,
	ПараметрыОперации) Экспорт
	
	РезультатОперации = НовыйРезультатСтатусЗаказа();
	РезультатОперации.Вставить("ОшибкиВалидацииЗаказа", Новый Массив);
	
	РезультатДеактивации = ДеактивироватьЗаказ(ДокументЗаказа);
	
	Если ЗначениеЗаполнено(РезультатДеактивации.КодОшибки) Тогда
		
		ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатДеактивации);
		
		Возврат РезультатОперации;
		
	КонецЕсли;
	
	Возврат АктивироватьЗаказСПодготовкойВложений(
		ДокументЗаказа,
		НастройкаПодключения,
		ПараметрыОперации)
	
КонецФункции

Функция СпособОплатыПоПредставлению(ИдентификаторСпособаОплаты)
	
	Если ИдентификаторСпособаОплаты = "Наличные" Тогда
		Возврат Перечисления.СпособыОплатыОнлайнЗаказов.Наличные;
	ИначеЕсли ИдентификаторСпособаОплаты = "Эквайринг" Тогда
		Возврат Перечисления.СпособыОплатыОнлайнЗаказов.Эквайринг;
	ИначеЕсли ИдентификаторСпособаОплаты = "ПоРеквизитам" Тогда
		Возврат Перечисления.СпособыОплатыОнлайнЗаказов.ПоРеквизитам;
	ИначеЕсли ИдентификаторСпособаОплаты = "ОзонПэй" Тогда
		Возврат Перечисления.СпособыОплатыОнлайнЗаказов.ОзонПэй;
	ИначеЕсли ИдентификаторСпособаОплаты = "Прочее" Тогда
		Возврат Перечисления.СпособыОплатыОнлайнЗаказов.Прочее;
	Иначе
		ПредставлениеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Передан неизвестный идентификатор статуса способа оплаты %1'"),
				ИдентификаторСпособаОплаты);
		ЗаписатьИнформациюВЖурналРегистрации(
			ПредставлениеОшибки,
			Истина);
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось установить статус онлайн-заказа. Подробности в журнале регистрации.'"),
			ПредставлениеОшибки);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ШаблоныСообщений

// Возвращает описание настроек использования подсистемы ШаблоныСообщений.
//
// Возвращаемое значение:
//  Структура - содержит описание настроек использования подсистемы ШаблоныСообщений:
//   * Существует - Булево - признак существования подсистемы ШаблоныСообщений в составе конфигурации;
//   * Используется - Булево - признак включения функциональной опции использования шаблонов сообщений.
//
Функция НастройкиШаблоновСообщений() Экспорт
	
	Настройки = Новый Структура;
	
	ЕстьШаблоныСообщений = ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ШаблоныСообщений");
	ИспользуютсяШаблоныСообщений = Ложь;
	Если ЕстьШаблоныСообщений Тогда
		МодульШаблоныСообщений = ОбщегоНазначения.ОбщийМодуль("ШаблоныСообщений");
		ИспользуютсяШаблоныСообщений = МодульШаблоныСообщений.ИспользуютсяШаблоныСообщений();
	КонецЕсли;
	
	Настройки.Вставить("Существует", ЕстьШаблоныСообщений);
	Настройки.Вставить("Используется", ИспользуютсяШаблоныСообщений);
	
	Возврат Настройки;
	
КонецФункции

// Возвращает признак использования шаблонов для онлайн-заказов.
//
// Возвращаемое значение:
//  Булево - признак использования шаблонов, Истина - шаблоны используются для онлайн-заказов.
//
Функция ИспользоватьШаблоныСообщений() Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ШаблоныСообщений") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьОтправкаSMS = ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОтправкаSMS");
	ЕстьОтправкаПисем = ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями");
	
	Если Не ЕстьОтправкаSMS И Не ЕстьОтправкаПисем Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИспользоватьШаблоныСообщений = Ложь;
	ИнтеграцияПодсистемБИП.ПриПроверкеИспользованияШаблоновСообщенийОнлайнЗаказов(
		ИспользоватьШаблоныСообщений);
	ОнлайнЗаказыПереопределяемый.ПриПроверкеИспользованияШаблоновСообщенийОнлайнЗаказов(
		ИспользоватьШаблоныСообщений);
	
	Возврат ИспользоватьШаблоныСообщений;
	
КонецФункции

// Возвращает признак создания всех описанных шаблонов.
//
// Возвращаемое значение:
//  Булево - Истина, если все описанные шаблоны созданы.
//
Функция ВсеШаблоныСозданы() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ВсеШаблоны", Истина);
	Результат.Вставить("Письмо", Истина);
	Результат.Вставить("SMS", Истина);
	
	Шаблоны = Новый Массив;
	ШаблоныПоТипу = ШаблоныСообщенийДокументовОперации();
	
	ПредопределенныеШаблоныСообщений = Новый Массив;
	ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам(
		ПредопределенныеШаблоныСообщений);
	
	Для Каждого Шаблон Из ПредопределенныеШаблоныСообщений Цикл
		
		ДанныеШаблона = Новый Структура;
		ДанныеШаблона.Вставить("ПолноеИмяТипаНазначения", Шаблон.ПолноеИмяТипаНазначения);
		ДанныеШаблона.Вставить("ТипШаблона", Шаблон.ТипШаблона);
		
		СозданныйШаблон = НайтиПредопределенныйШаблонСообщений(
			ДанныеШаблона,
			ШаблоныПоТипу);
		
		Если СозданныйШаблон.Пустая() Тогда
			
			ПодсистемаСМС = ОбщегоНазначения.ПодсистемаСуществует(
				"СтандартныеПодсистемы.ОтправкаSMS");
			ПодсистемаПочта = ОбщегоНазначения.ПодсистемаСуществует(
				"СтандартныеПодсистемы.РаботаСПочтовымиСообщениями");
			
			Если (Шаблон.ТипШаблона = "SMS" И ПодсистемаСМС)
				Или (Шаблон.ТипШаблона = "Письмо" И ПодсистемаПочта) Тогда
				Результат.ВсеШаблоны = Ложь;
			КонецЕсли;
			
			Результат[Шаблон.ТипШаблона] = Ложь;
			
		Иначе
			Шаблоны.Добавить(СозданныйШаблон);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.Вставить("Шаблоны", Шаблоны);
	
	Возврат Результат;
	
КонецФункции

// Возвращает соответствие, содержащее сохраненные предопределенные шаблоны сообщений подсистемы по типу отправки.
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - определения шаблонов:
//    * Ключ - Строка - признак принадлежности шаблонов для отправки посредством письма или СМС.
//    * Значение - Соответствие Из КлючИЗначение - настройки шаблонов:
//       ** Ключ - Строка - содержит полное имя типа назначения шаблона;
//       ** Значение - УникальныйИдентификатор - представление ссылки на элемент справочника ШаблоныСообщений.
//
Функция ШаблоныСообщенийДокументовОперации() Экспорт
	
	ШаблоныПоТипу = Константы.ПредопределенныеШаблоныСообщенийОнлайнЗаказов.Получить().Получить();
	
	Если ШаблоныПоТипу = Неопределено Тогда
		ШаблоныПоТипу = Новый Соответствие;
		ШаблоныПоТипу.Вставить("Письмо", Новый Соответствие);
		ШаблоныПоТипу.Вставить("SMS", Новый Соответствие);
	КонецЕсли;
	
	Возврат ШаблоныПоТипу;
	
КонецФункции

// Записывает соответствие предопределенных шаблонов подсистемы в соответствующую константу.
//
// Параметры:
//  ШаблоныСообщенийПоТипу - Соответствие Из КлючИЗначение - описание предопределенных шаблонов подсистемы:
//    * Ключ - Строка - признак принадлежности шаблонов для отправки посредством письма или СМС.
//    * Значение - Соответствие Из КлючИЗначение - настройки шаблонов:
//       ** Ключ - Строка - содержит полное имя типа назначения шаблона;
//       ** Значение - УникальныйИдентификатор - представление ссылки на элемент справочника ШаблоныСообщений.
//
Процедура УстановитьСоответствиеШаблоновДокументамОперации(
		ШаблоныСообщенийПоТипу)
	
	Константы.ПредопределенныеШаблоныСообщенийОнлайнЗаказов.Установить(
		Новый ХранилищеЗначения(ШаблоныСообщенийПоТипу));
	
КонецПроцедуры

// Создает предопределенные шаблоны сообщений после проверки существования соответствующих подсистем.
//
// Возвращаемое значение:
// См. СоздатьПредопределенныеШаблоныСообщений.
//
Функция СоздатьПредопределенныеШаблоныСообщенийПроверкаПодсистем() Экспорт
	
	ЕстьОтправкаSMS = ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОтправкаSMS");
	ЕстьОтправкаПисем = ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями");
	
	Возврат СоздатьПредопределенныеШаблоныСообщений(ЕстьОтправкаПисем, ЕстьОтправкаSMS);
	
КонецФункции

// Создает предопределенные шаблоны сообщений после проверки существования соответствующих подсистем.
//
// Параметры:
//  СоздатьШаблоныПисем - Булево - признак создания шаблонов сообщений для электронной почты.
//  СоздатьШаблоныСМС - Булево - признак создания шаблонов сообщений СМС.
//
// Возвращаемое значение:
//  Массив Из СправочникСсылка.ШаблоныСообщений - Массив созданных предопределенных шаблонов,
//    элементами массива являются ссылки на справочник ШаблоныСообщений.
//
Функция СоздатьПредопределенныеШаблоныСообщений(
		СоздатьШаблоныПисем,
		СоздатьШаблоныСМС) Экспорт
	
	МассивСозданныхШаблонов = Новый Массив;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ШаблоныСообщений") Тогда
		Возврат МассивСозданныхШаблонов;
	КонецЕсли;
	
	МодульШаблоныСообщений = ОбщегоНазначения.ОбщийМодуль("ШаблоныСообщений");
	
	МассивПредопределенныхШаблоновСообщений = Новый Массив;
	ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам(МассивПредопределенныхШаблоновСообщений);
	
	Если Не МассивПредопределенныхШаблоновСообщений.Количество() Тогда
		Возврат МассивСозданныхШаблонов;
	КонецЕсли;
	
	ШаблоныСообщенийПоТипу = ШаблоныСообщенийДокументовОперации();
	
	Для Каждого Шаблон Из МассивПредопределенныхШаблоновСообщений Цикл 
		
		Если Не Шаблон.Свойство("ТипШаблона") Тогда // АПК:1416 Поддержка обратной совместимости.
			Продолжить;
		ИначеЕсли Врег(Шаблон.ТипШаблона) <> Врег("SMS") И Врег(Шаблон.ТипШаблона) <> Врег("Письмо") Тогда
			Продолжить;
		ИначеЕсли Не СоздатьШаблоныПисем И Врег(Шаблон.ТипШаблона) = Врег("Письмо") Тогда
			Продолжить;
		ИначеЕсли Не СоздатьШаблоныСМС И Врег(Шаблон.ТипШаблона) = Врег("SMS") Тогда
			Продолжить;
		КонецЕсли;
		
		ШаблонСообщенийСсылка = НайтиПредопределенныйШаблонСообщений(Шаблон,
			ШаблоныСообщенийПоТипу);
		
		Если ШаблонСообщенийСсылка.Пустая() Тогда
			
			ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Шаблон.ПолноеИмяТипаНазначения);
			Если ОбъектМетаданных = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			Если Не ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(ОбъектМетаданных) Тогда 
				Продолжить;
			КонецЕсли;
			
			ПараметрыШаблона = МодульШаблоныСообщений.ОписаниеПараметровШаблона();
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
				ПараметрыШаблона,
				Шаблон,
				Истина);
			
			ШаблонСообщенийСсылка = МодульШаблоныСообщений.СоздатьШаблон(
				Шаблон.Наименование,
				ПараметрыШаблона);
			
			МассивСозданныхШаблонов.Добавить(ШаблонСообщенийСсылка);
			
		КонецЕсли;
		
		ШаблоныСообщенийПоТипу[Шаблон.ТипШаблона].Вставить(
			Шаблон.ПолноеИмяТипаНазначения,
			ШаблонСообщенийСсылка.УникальныйИдентификатор());
		
	КонецЦикла;
	
	УстановитьСоответствиеШаблоновДокументамОперации(
		ШаблоныСообщенийПоТипу);
	
	Возврат МассивСозданныхШаблонов;
	
КонецФункции

// Возвращает перечень предопределенных шаблонов сообщений подсистемы, структурированный по типам назначения.
//
// Возвращаемое значение:
//  Структура - перечень предопределенных шаблонов сообщений подсистемы, структурированный по типам назначения:
//   * Ключ - Строка - тип назначения шаблона, может принимать значения - Письмо, SMS.
//   * Значение - Массив из СправочникСсылка.ШаблоныСообщений - перечень предопределенных шаблонов подсистемы по типу.
//
Функция ШаблоныСообщенийПоТипам() Экспорт
	
	ШаблоныЭлектронныхПисем    = Новый Массив;
	ШаблоныSMS                 = Новый Массив;
	ШаблоныСообщенийДокументов = ШаблоныСообщенийДокументовОперации();
	
	ПредопределенныеШаблоныСообщений = Новый Массив;
	ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам(
		ПредопределенныеШаблоныСообщений);
	
	Для Каждого Шаблон Из ПредопределенныеШаблоныСообщений Цикл
		
		ДанныеШаблона = Новый Структура;
		ДанныеШаблона.Вставить("ПолноеИмяТипаНазначения", Шаблон.ПолноеИмяТипаНазначения);
		ДанныеШаблона.Вставить("ТипШаблона", Шаблон.ТипШаблона);
		
		СозданныйШаблон = НайтиПредопределенныйШаблонСообщений(ДанныеШаблона, ШаблоныСообщенийДокументов);
		Если СозданныйШаблон.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		Если Шаблон.ТипШаблона = "Письмо" Тогда
			ШаблоныЭлектронныхПисем.Добавить(СозданныйШаблон);
		ИначеЕсли Шаблон.ТипШаблона = "SMS" Тогда
			ШаблоныSMS.Добавить(СозданныйШаблон);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("Письмо", ШаблоныЭлектронныхПисем);
	Результат.Вставить("SMS",    ШаблоныSMS);
	
	Возврат Результат;
	
КонецФункции

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам
//
Процедура ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам(
		ПредопределенныеШаблоныСообщений)
	
	ИнтеграцияПодсистемБИП.ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам(
		ПредопределенныеШаблоныСообщений);
	ОнлайнЗаказыПереопределяемый.ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам(
		ПредопределенныеШаблоныСообщений);
	
КонецПроцедуры

// Возвращает ссылку на элемент справочника ШаблоныСообщений по переданным параметрам.
//
// Параметры:
//  Шаблон - Структура - описание искомого шаблона:
//    * ПолноеИмяТипаНазначения - Строка - содержит полное имя типа назначения шаблона;
//    * ТипШаблона - Строка - признак принадлежности шаблонов для отправки посредством письма или СМС.
//  ШаблоныСообщенийПоТипу - Соответствие Из КлючИЗначение - описание предопределенных шаблонов подсистемы:
//    * Ключ - Строка - признак принадлежности шаблонов для отправки посредством письма или СМС.
//    * Значение - Соответствие Из КлючИЗначение - настройки шаблонов:
//       ** Ключ    - Строка - содержит полное имя типа назначения шаблона;
//       ** Значение - УникальныйИдентификатор - представление ссылки на элемент справочника ШаблоныСообщений.
//
// Возвращаемое значение:
//  СправочникСсылка.ШаблоныСообщений - результат поиска, 
//    пустая ссылка, если по данной структуре шаблон не найден.
//
Функция НайтиПредопределенныйШаблонСообщений(
		Шаблон,
		ШаблоныСообщенийПоТипу)
	
	МенеджерШаблоновСообщений = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Справочник.ШаблоныСообщений");
	
	ШаблонСсылка = МенеджерШаблоновСообщений.ПустаяСсылка();
	
	ИдентификаторШаблона =
		ШаблоныСообщенийПоТипу[Шаблон.ТипШаблона].Получить(Шаблон.ПолноеИмяТипаНазначения);
		
	Если Не ТипЗнч(ИдентификаторШаблона) = Тип("УникальныйИдентификатор") Тогда
		Возврат ШаблонСсылка;
	КонецЕсли;
	
	НайденныйШаблон = МенеджерШаблоновСообщений.ПолучитьСсылку(ИдентификаторШаблона);
	Если НайденныйШаблон.Пустая() Тогда
		Возврат ШаблонСсылка;
	КонецЕсли;
	
	ДанныеШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		НайденныйШаблон,
		"ПометкаУдаления, ПолноеИмяТипаПараметраВводаНаОсновании, ПредназначенДляЭлектронныхПисем");
	
	Если ДанныеШаблона.ПометкаУдаления = Неопределено Тогда
		Возврат ШаблонСсылка;
	ИначеЕсли ДанныеШаблона.ПометкаУдаления Тогда 
		Возврат ШаблонСсылка;
	ИначеЕсли Не ДанныеШаблона.ПолноеИмяТипаПараметраВводаНаОсновании = Шаблон.ПолноеИмяТипаНазначения Тогда
		Возврат ШаблонСсылка;
	КонецЕсли;
	
	ШаблонСсылка = НайденныйШаблон;
	
	Возврат ШаблонСсылка;
	
КонецФункции

// Включает функциональные опции необходимые для работы с шаблонами сообщений.
//
Процедура УстановитьИспользованиеШаблоновСообщенийПроверкаПодсистем() Экспорт
	
	ИнтернетПоддержкаПользователей.УстановитьИспользованиеSMS();
	ИнтернетПоддержкаПользователей.УстановитьИспользованиеЭлектроннойПочты();
	ИнтернетПоддержкаПользователей.УстановитьОтправкуПисемВФорматеHTML();
	ИнтернетПоддержкаПользователей.УстановитьИспользованиеШаблоновСообщений();
	
КонецПроцедуры

// Проверяет является ли объект основанием онлайн-заказов.
//
// Параметры:
//  Объект - ЛюбаяСсылка, Строка - ссылка на объект или полное имя объекта метаданных для проверки.
//
// Возвращаемое значение:
//  Булево - Истина, если объект является основанием онлайн-заказов, иначе Ложь.
//
Функция ЭтоДокументОнлайнЗаказов(Знач Объект)
	
	ПолноеИмя = Неопределено;
	
	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		
		ПолноеИмя = Объект;
		
	Иначе
		
		МетаданныеОбъекта = Объект.Метаданные();
		ПолноеИмя = МетаданныеОбъекта.ПолноеИмя();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПолноеИмя) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НастройкиПодключаемыхКоманд = НастройкиПодключаемыхКоманд();
	ИменаДокументов = НастройкиПодключаемыхКоманд.ИменаОснованийЗаказа;
	
	Возврат (ИменаДокументов.Найти(ПолноеИмя) <> Неопределено);
	
КонецФункции

// Создает описание параметров отправки сообщений.
//
// Возвращаемое значение:
//  Структура - описание параметров отправки сообщений:
//    * ПараметрыОтправкиПисем - Структура - описание отправки электронных писем:
//       ** ОтправлятьПисьмаВФорматеHTML - Булево, Неопределено - признак отправки электронных писем в формате HTML.
//
Функция НовыйПараметрыОтправкиСообщений()
	
	ПараметрыОтправкиСообщений = Новый Структура;
	
	ПараметрыОтправкиПисем = Новый Структура;
	ПараметрыОтправкиПисем.Вставить("ОтправлятьПисьмаВФорматеHTML", Неопределено);
	
	ПараметрыОтправкиСообщений.Вставить("ПараметрыОтправкиПисем", ПараметрыОтправкиПисем);
	
	Возврат ПараметрыОтправкиСообщений;
	
КонецФункции

// Возвращает признак отправки писем с использованием шаблонов СБП в формате HTML.
//
// Возвращаемое значение:
//  Булево - признак отправки писем с использованием шаблонов СБП в формате HTML.
//
Функция ОтправлятьПисьмаВФорматеHTML(
		ПараметрыОтправкиСообщений)
	
	Попытка
		ОтправлятьПисьмаВФорматеHTML = ПараметрыОтправкиСообщений.ПараметрыОтправкиПисем.ОтправлятьПисьмаВФорматеHTML;
	Исключение
		ВызватьИсключение НСтр("ru = 'Нарушение структуры параметров отправки сообщений в переопределяемом методе
			|ОнлайнЗаказыПереопределяемый.ПриОпределенииПараметровОтправкиСообщений'");
	КонецПопытки;
	
	Если ОтправлятьПисьмаВФорматеHTML = Неопределено Тогда
		Возврат ИнтернетПоддержкаПользователей.ОтправлятьПисьмаВФорматеHTML();
	Иначе
		Возврат ОтправлятьПисьмаВФорматеHTML;
	КонецЕсли;
	
КонецФункции

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииПараметровОтправкиСообщений.
//
Процедура ПриОпределенииПараметровОтправкиСообщений(
		ПараметрыОтправкиСообщений)
	
	ИнтеграцияПодсистемБИП.ПриОпределенииПараметровОтправкиСообщенийОнлайнЗаказов(
		ПараметрыОтправкиСообщений);
	ОнлайнЗаказыПереопределяемый.ПриОпределенииПараметровОтправкиСообщений(
		ПараметрыОтправкиСообщений);
	
КонецПроцедуры

// Формирует данные для заполнения шаблона сообщения.
//
// Параметры:
//  ПредметСообщения - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ, по данным которого
//    необходимо сформировать сообщение;
//  Сообщение - Структура - сообщение для отправки.
//
// Возвращаемое значение:
//  Структура - данные для заполнения.
//
Функция ДанныеЗаполненияШаблона(
		ПредметСообщения,
		Сообщение)
	
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("ПредставлениеСсылкиОнлайнЗаказа", Неопределено);
	ПараметрыСообщения.Вставить("СуммаОнлайнЗаказа", Неопределено);
	
	// АПК:1416-выкл Обработка различных сценариев отправки.
	// АПК:1415-выкл Обработка различных сценариев отправки.
	
	Если Сообщение.ДополнительныеПараметры.Свойство("ПараметрыСообщения")
		И ЗначениеЗаполнено(Сообщение.ДополнительныеПараметры.ПараметрыСообщения) Тогда
		Сообщение.ДополнительныеПараметры.ПараметрыСообщения.Свойство(
			"ПредставлениеСсылкиОнлайнЗаказа",
			ПараметрыСообщения.ПредставлениеСсылкиОнлайнЗаказа);
		Сообщение.ДополнительныеПараметры.ПараметрыСообщения.Свойство(
			"СуммаОнлайнЗаказа",
			ПараметрыСообщения.СуммаОнлайнЗаказа);
	Иначе
		Сообщение.ДополнительныеПараметры.Свойство(
			"ПредставлениеСсылкиОнлайнЗаказа",
			ПараметрыСообщения.ПредставлениеСсылкиОнлайнЗаказа);
		Сообщение.ДополнительныеПараметры.Свойство(
			"СуммаОнлайнЗаказа",
			ПараметрыСообщения.СуммаОнлайнЗаказа);
	КонецЕсли;
	
	// АПК:1416-вкл
	// АПК:1415-вкл
	
	Если Не ЗначениеЗаполнено(ПараметрыСообщения.ПредставлениеСсылкиОнлайнЗаказа) Тогда
		
		ПараметрыСсылки = РегистрыСведений.ИдентификаторыОнлайнЗаказов.ПараметрыСсылкиПоДокументуЗаказа(
			ПредметСообщения);
		
		Если ЗначениеЗаполнено(ПараметрыСсылки.НастройкаПодключения) Тогда
			
			НастройкаПодключения = ПараметрыСсылки.НастройкаПодключения;
			
		Иначе
			
			ПараметрыЗаказа = ПриОпределенииПараметровСозданияЗаказа(ПредметСообщения);
			
			Если Не ПараметрыЗаказа.СозданиеЗаказаДоступно Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Недостаточно прав для создания нового онлайн-заказа.'"));
					Возврат ПараметрыСообщения;
			ИначеЕсли Не ЗначениеЗаполнено(ПараметрыЗаказа.ИспользуемыеНастройкиПодключения) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Не удалось определить настройку подключения к онлайн-заказам.'"));
					Возврат ПараметрыСообщения;
			КонецЕсли;
			
			НастройкаПодключения = ПараметрыЗаказа.ИспользуемыеНастройкиПодключения[0];
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыСсылки.ИдентификаторЗаказа)
			И ЗначениеЗаполнено(ПараметрыСсылки.URLЗаказа) Тогда
			РезультатОперации = СтатусЗаказа(ПредметСообщения);
		Иначе
			РезультатОперации = НовыйЗаказ(
				ПредметСообщения,
				НастройкаПодключения,
				ВложенияПользователяПоУмолчанию(ПредметСообщения));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Не удалось получить данные онлайн-заказа.'"));
					Возврат ПараметрыСообщения;
		КонецЕсли;
		
		ПараметрыСообщения.ПредставлениеСсылкиОнлайнЗаказа = РезультатОперации.URLЗаказа;
		ПараметрыСообщения.СуммаОнлайнЗаказа = РезультатОперации.СуммаЗаказа;
		
	КонецЕсли;
	
	Возврат ПараметрыСообщения;
	
КонецФункции

// Заполнение представление ссылки в шаблоне сообщения.
//
// Параметры:
//  Сообщение - Структура - сообщение для отправки;
//  ПараметрыШаблона - Структура- параметры сообщения;
//  ПредставлениеСсылкиОнлайнЗаказа - Строка - ссылка на заказ для заполнения в сообщении.
//
Процедура ЗаполнитьПредставлениеСсылки(
		Сообщение,
		ПараметрыШаблона,
		ПредставлениеСсылкиОнлайнЗаказа)
	
	ПараметрыОтправкиСообщений = НовыйПараметрыОтправкиСообщений();
	ПриОпределенииПараметровОтправкиСообщений(ПараметрыОтправкиСообщений);
	
	Если ПараметрыШаблона.ТипШаблона = "Письмо"
		И ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML
		И ОтправлятьПисьмаВФорматеHTML(ПараметрыОтправкиСообщений) Тогда
		
		Если Сообщение.ЗначенияРеквизитов["ПредставлениеСсылкиОнлайнЗаказа"] <> Неопределено Тогда
			Сообщение.ЗначенияРеквизитов["ПредставлениеСсылкиОнлайнЗаказа"]
				= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '<p>Заказ доступен по ссылке: <a href=""%1"">%1</a></p>'"),
					ПредставлениеСсылкиОнлайнЗаказа);
		КонецЕсли;
		
	Иначе
		Сообщение.ЗначенияРеквизитов["ПредставлениеСсылкиОнлайнЗаказа"] = ?(
			ПараметрыШаблона.ТипШаблона = "SMS",
			ПредставлениеСсылкиОнлайнЗаказа,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Заказ доступен по ссылке:
					|%1'"),
			ПредставлениеСсылкиОнлайнЗаказа));
	КонецЕсли;
	
КонецПроцедуры

// Выполняет операцию обновления настроек страниц онлайн-заказов.
//
// Параметры:
//   ИдентификаторФормы - УникальныйИдентификатор - уникальный идентификатор формы, во временное хранилище которой
//     необходимо поместить результат выполнения процедуры.
//  НастройкаОплаты - Произвольный -  - настройки подключения способа оплаты,
//   по которой необходимо выбрать настройки онлайн-заказов для цели их обновления в сервисе.
//
// Возвращаемое значение:
//  Структура: 
//   * Статус               - Строка - "Выполняется", если задание еще не завершилось;
//                                     "Выполнено", если задание было успешно выполнено;
//                                     "Ошибка", если задание завершено с ошибкой;
//                                     "Отменено", если задание отменено пользователем или администратором.
//   * ИдентификаторЗадания - УникальныйИдентификатор - если Статус = "Выполняется", то содержит 
//                                     идентификатор запущенного фонового задания.
//                          - Неопределено - если Статус <> "Выполняется" и фоновое задание не запускалось.
//   * АдресРезультата       - Строка - адрес временного хранилища, в которое будет
//                                      помещен результат работы функции.
//   * КраткоеПредставлениеОшибки   - Строка - краткая информация об исключении, если Статус = "Ошибка".
//   * ПодробноеПредставлениеОшибки - Строка - подробная информация об исключении, если Статус = "Ошибка".
//   * Сообщения - ФиксированныйМассив - если Статус <> "Выполняется", то массив объектов СообщениеПользователю,
//                                      которые были сформированы в фоновом задании.
//
Функция ОбновитьНастройкиСтраницЗапускЗадания(
		ИдентификаторФормы,
		НастройкаОплаты) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление настроек страниц в сервисе.'");
	
	НастройкиСтраниц = Справочники.НастройкиПодключенияКОнлайнЗаказам.НастройкиПодключенияПоНастройкеОплаты(
		НастройкаОплаты,
		Неопределено,
		Ложь);
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ОнлайнЗаказыСлужебный.ОбновлениеНастроекПодключения",
		НастройкиСтраниц);
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти

#Область ФискализацияОнлайнЗаказов

Функция НовыйДанныеФискализации(ПараметрыФискализации)
	
	Возврат Новый Структура(
		"ПараметрыФискализации",
		ПараметрыФискализации);
	
КонецФункции

Функция ПараметрыФискализации(ДанныеФискализации)
	
	Если ДанныеФискализации <> Неопределено Тогда
		ПараметрыФискализации = Новый Структура;
		ПараметрыФискализации.Вставить("ДокументОперации", Неопределено);
		ПараметрыФискализации.Вставить(
			"НастройкаПодключения",
			НастройкаОблачнойКассы(ДанныеФискализации.НастройкаПодключения));
		ПараметрыФискализации.Вставить("СтатусОперации", ДанныеФискализации.СтатусОперации);
		ПараметрыФискализации.Вставить("ОписаниеСтатусаОперации", ДанныеФискализации.ОписаниеСтатусаОперации);
	Иначе
		ПараметрыФискализации = Неопределено;
	КонецЕсли;
	
	Возврат ПараметрыФискализации;
	
КонецФункции

Процедура ОбработатьФискализацию(ДокументЗаказа, ПараметрыФискализации, ДанныеФискализации)
	
	Если ДанныеФискализации = Неопределено
		Или ДанныеФискализации.СтатусОперации = СтатусФискализацииОшибка() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЧека = РегистрыСведений.ИдентификаторыОнлайнЗаказов.ДанныеЧека(
		ДокументЗаказа);
	ПараметрыФискализации.Вставить("ДанныеЧека", ДанныеЧека);
	
	ИнтеграцияПодсистемБИП.ПриЗаписиДанныхФискализацииЗаказа(
		ПараметрыФискализации);
	ОнлайнЗаказыПереопределяемый.ПриЗаписиДанныхФискализацииЗаказа(
		ПараметрыФискализации);
	
	ОнлайнЗаказыСобытия.ПриЗаписиДанныхФискализации(ПараметрыФискализации, ДанныеФискализации);
	
КонецПроцедуры

Функция НастройкаОблачнойКассы(НастройкаПодключения) Экспорт
	
	Возврат Справочники.НастройкиПодключенияКОнлайнЗаказам.НастройкаОблачнойКассы(НастройкаПодключения);
	
КонецФункции

#КонецОбласти

#Область ПрочиеСлужебныеПроцедурыФункции

// Возвращает имя события для журнала регистрации, которое используется
// для записи событий загрузки данных из внешних систем.
//
// Возвращаемое значение:
//  Строка - имя события.
//
Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Онлайн-заказы'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

// Возвращает актуальную версию контрольной суммы используемую в случае обновления/создания онлайн-заказа.
//
// Возвращаемое значение:
//  Строка - номер актуальной версии.
//
Функция АктуальнаяВерсияКонтрольнойСуммы()
	
	Возврат "3";
	
КонецФункции

Функция НовыйДанныеОплаты(СпособОплаты, СуммаЗаказа)
	
	Возврат Новый Структура(
		"СпособОплаты, СуммаОплаты",
		СпособОплаты,
		СуммаЗаказа);
	
КонецФункции

// Определяет способ оплаты по указанной настройке подключения или платежному сервису.
// Если параметр ПлатежныйСервис заполнен, то способ оплаты определяется по нему. Если нет, то по параметру
// НастройкаПодключения.
// 
// Параметры:
//  ПлатежныйСервис - Строка - идентификатор платежного сервиса. Доступные значения определены в методе
//                             СпособОплатыПоИдентификатору.
//                  - ПеречислениеСсылка.ПлатежныеСервисы - для подсистемы ПлатежныеСервисы.
//                  - Неопределено - платежный сервис будет определен на основе параметра НастройкаПодключения.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей,
//    СправочникСсылка.НастройкиПодключенияКИнтернетЭквайрингу,
//    СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к платежной системе, которую
//      нужно добавить в настройку подключения к Онлайн-заказам.
//  
// Возвращаемое значение:
//  Неопределено - не удалось определить способ оплаты.
//  ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов - способ оплаты для указанной настройки или платежного сервиса.
//
Функция СпособОплатыПоНастройке(ПлатежныйСервис, НастройкаПодключения)
	
	СпособОплаты = Неопределено;
	
	Если Не ЗначениеЗаполнено(ПлатежныйСервис) Тогда
		// Определяем по настройке подключения
		Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ИнтернетЭквайринг") Тогда
			МодульИнтернетЭквайрингСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнтернетЭквайрингСлужебный");
			Если МодульИнтернетЭквайрингСлужебный.ЭтоНастройкаПодключения(НастройкаПодключения) Тогда
				Возврат Перечисления.СпособыОплатыОнлайнЗаказов.Эквайринг;
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП") Тогда
			МодульСистемаБыстрыхПлатежейСлужебный = ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежейСлужебный");
			Если МодульСистемаБыстрыхПлатежейСлужебный.ЭтоНастройкаПодключения(НастройкаПодключения) Тогда
				ВариантНастройки = МодульСистемаБыстрыхПлатежейСлужебный.ИдентификаторВариантаНастройкиПоСсылке(НастройкаПодключения);
				Если ВариантНастройки = "b2b" Тогда
					Возврат Перечисления.СпособыОплатыОнлайнЗаказов.СБПb2b;
				ИначеЕсли ВариантНастройки = "c2b" Тогда
					Возврат Перечисления.СпособыОплатыОнлайнЗаказов.СБПb2b;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.БазоваяФункциональностьПлатежныхСистем") Тогда
			МодульПлатежныеСистемыСлужебный = ОбщегоНазначения.ОбщийМодуль("ПлатежныеСистемыСлужебный");
			Если МодульПлатежныеСистемыСлужебный.ЭтоНастройкаПодключения(НастройкаПодключения)
				И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
				ИдентификаторПлатежнойСистемы = МодульПлатежныеСистемыСлужебный.ИдентификаторПлатежнойСистемыПоНастройке(
					НастройкаПодключения);
				МодульНастройкиПлатежныхСистемКлиентСервер = ОбщегоНазначения.ОбщийМодуль("НастройкиПлатежныхСистемКлиентСервер");
				Если ИдентификаторПлатежнойСистемы = МодульНастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыОзонПэй() Тогда
					Возврат Перечисления.СпособыОплатыОнлайнЗаказов.ОзонПэй;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли ТипЗнч(ПлатежныйСервис) = Тип("Строка") Тогда
	
		Попытка
			СпособОплаты = СпособОплатыПоИдентификатору(ПлатежныйСервис);
		Исключение
			СпособОплаты = Неопределено;
		КонецПопытки;
	
	Иначе
		
		// Проверяем по перечислению ПлатежныеСервисы
		Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.БазоваяФункциональностьПлатежныхСистем") Тогда
			МодульПлатежныеСистемыСлужебный = ОбщегоНазначения.ОбщийМодуль("ПлатежныеСистемыСлужебный");
			Если МодульПлатежныеСистемыСлужебный.ЭтоНастройкаПодключения(НастройкаПодключения)
				И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
				ИдентификаторПлатежнойСистемы = МодульПлатежныеСистемыСлужебный.ИдентификаторПлатежногоСервиса(ПлатежныйСервис);
				МодульНастройкиПлатежныхСистемКлиентСервер = ОбщегоНазначения.ОбщийМодуль("НастройкиПлатежныхСистемКлиентСервер");
				Если ИдентификаторПлатежнойСистемы = МодульНастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыОзонПэй() Тогда
					Возврат Перечисления.СпособыОплатыОнлайнЗаказов.ОзонПэй;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат СпособОплаты;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Заполняет новые реквизиты справочника "НастройкиПодключенияКОнлайнЗаказам"
// при переходе на версию 2.8.4.
//
// Параметры:
//  Параметры - Структура - параметры обновления.
//
Процедура ОбновитьПризнакиИспользованияНастроекОплатФискализации(Параметры) Экспорт
	
	Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("Справочник.НастройкиПодключенияКОнлайнЗаказам");
		Блокировка.Заблокировать();
		
		ТекстЗапроса = Новый Массив;
		
		ТекстЗапроса.Добавить(
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТ_НастройкиОнлайнЗаказов
			|ИЗ
			|	Справочник.НастройкиПодключенияКОнлайнЗаказам.НастройкиОплаты КАК НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты
			|ГДЕ
			|	НЕ НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Используется");
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОблачныеКассы") Тогда
			ТекстЗапроса.Добавить(
				"
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	НастройкиПодключенияКОнлайнЗаказам.Ссылка
				|ИЗ
				|	Справочник.НастройкиПодключенияКОнлайнЗаказам КАК НастройкиПодключенияКОнлайнЗаказам
				|ГДЕ
				|	НЕ НастройкиПодключенияКОнлайнЗаказам.НастройкаПодключенияКОблачнойКассе.Ссылка ЕСТЬ NULL");
		КонецЕсли;
		
		ТекстЗапроса.Добавить(
			";
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВТ_НастройкиОнлайнЗаказов.Ссылка КАК Ссылка
			|ИЗ
			|	ВТ_НастройкиОнлайнЗаказов КАК ВТ_НастройкиОнлайнЗаказов");
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстЗапроса, Символы.ПС);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НастройкаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			НастройкаОбъект.Заблокировать();
			
			Для Каждого НастройкаОплаты Из НастройкаОбъект.НастройкиОплаты Цикл
				НастройкаОплаты.Используется = Истина;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(
				НастройкаОбъект,
				Ложь,
				Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
