#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборСостояние = "Активные";
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере_ФормаСписка(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборДинСписка();
	
	ПериодОбновления = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПериодОбновленияФорм");	
	
	ПодключитьОбработчикОжидания("ОбновитьСписок", ПериодОбновления, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	
	УстановитьОтборДинСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодПриИзменении(Элемент)
	
	ВключитьОтбор();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборДинСписка()
	
	Список.Отбор.Элементы.Очистить(); 
	
	Если  ОтборСостояние <> "Все" Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		ЭлементОтбора.ПравоеЗначение = Ложь;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусДокументооборота");
		ЭлементОтбора.Использование = Истина;
		
		Если ОтборСостояние = "Активные" Тогда
			
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = МассивАктивныхСтатусов();
			
		ИначеЕсли ОтборСостояние = "Медосмотр до" Тогда
			
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = МассивСтатусовМедосмотрДо();
			
		ИначеЕсли ОтборСостояние = "Техосмотр" Тогда
			
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = МассивСтатусовТехосмотр();		
			
		ИначеЕсли ОтборСостояние = "В пути" Тогда
			
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = МассивСтатусовВПути();
			
		ИначеЕсли ОтборСостояние = "Медосмотр после" Тогда
			
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = МассивСтатусовМедосмотрПосле();
			
		ИначеЕсли ОтборСостояние = "Завершенные" Тогда
			
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = МассивСтатусовЗавершен();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МассивСтатусовЗавершен()
	
	МассивСтатусов = Новый Массив;
		
	МассивСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-completed"));
	МассивСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-changeover"));
	МассивСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-rejected-techInspection"));
	МассивСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-rejected-cheсkup"));
	
	Возврат МассивСтатусов;
	
КонецФункции

&НаСервереБезКонтекста
Функция МассивСтатусовВПути()
	
	МассивСтатусов = Новый Массив;
		
	МассивСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-on-the-way"));
	
	Возврат МассивСтатусов;
	
КонецФункции

&НаСервереБезКонтекста
Функция МассивСтатусовОдометрДо()
	
	МассивСтатусов = Новый Массив;
		
	МассивСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-odometerBefore"));
	
	Возврат МассивСтатусов;
	
КонецФункции

&НаСервереБезКонтекста
Функция МассивСтатусовТехосмотр()
	
	МассивСтатусов = Новый Массив;
		
	МассивСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-techInspection"));
	МассивСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-techOrChekupBefore"));
	
	Возврат МассивСтатусов;
	
КонецФункции

&НаСервереБезКонтекста
Функция МассивСтатусовМедосмотрДо()
	
	МассивСтатусов = Новый Массив;
		
	МассивСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-techOrChekupBefore"));
	МассивСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-checkupBefore2ndDriver"));
	МассивСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-checkupBefore"));
	
	Возврат МассивСтатусов;
	
КонецФункции

&НаСервереБезКонтекста
Функция МассивСтатусовМедосмотрПосле()
	
	МассивСтатусов = Новый Массив;
		
	МассивСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-checkupAfter"));
	
	Возврат МассивСтатусов;
	
КонецФункции

&НаСервереБезКонтекста
Функция МассивАктивныхСтатусов()
	
	МассивАктивныхСтатусов = Новый Массив;
		
	МассивАктивныхСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-techOrChekupBefore"));
	МассивАктивныхСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-techInspection"));
	МассивАктивныхСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-odometerBefore"));
	МассивАктивныхСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-checkupBefore2ndDriver"));
	МассивАктивныхСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-checkupBefore"));
	МассивАктивныхСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-wait-checkupAfter"));
	МассивАктивныхСтатусов.Добавить(НайтиСостояниеДОПоКоду("pl-on-the-way"));

	Возврат МассивАктивныхСтатусов;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиСостояниеДОПоКоду(КодАнгл, ОтвСторона = Неопределено)
	Возврат Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду(КодАнгл, ОтвСторона)
КонецФункции	

&НаКлиенте
Процедура ВключитьОтбор()
	
	Если ПустойПериод() Тогда
		
		УдалитьЭлементОтбора("ДатаПЛ");
		
	Иначе
					
		УдалитьЭлементОтбора("ДатаПЛ");
		
		Если ОтборПериод.ДатаНачала <> Дата(1, 1, 1) Тогда
			
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаПЛ");
			ЭлементОтбора.ПравоеЗначение = ОтборПериод.ДатаНачала;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			
		КонецЕсли;
		
		Если ОтборПериод.ДатаОкончания <> Дата(1, 1, 1) Тогда
			
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаПЛ");
			ЭлементОтбора.ПравоеЗначение = ОтборПериод.ДатаОкончания;
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПустойПериод()
	
	Возврат ОтборПериод.ДатаНачала = Дата(1, 1, 1) И ОтборПериод.ДатаОкончания = Дата(1, 1, 1);
	
КонецФункции

&НаКлиенте
Процедура УдалитьЭлементОтбора(ИмяЭлемента)
	
	МассивУдаляемыхЭлементов = Новый Массив;
	
	Для каждого ЭлементОтбор Из Список.Отбор.Элементы Цикл
		Если Строка(ЭлементОтбор.ЛевоеЗначение) = ИмяЭлемента Тогда
			МассивУдаляемыхЭлементов.Добавить(ЭлементОтбор);				
		КонецЕсли;
	КонецЦикла;
	
	Для каждого УдЭлемент Из МассивУдаляемыхЭлементов Цикл
		Список.Отбор.Элементы.Удалить(УдЭлемент);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок()
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти
