#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		Данные = ЗначениеИзСтрокиВнутр(Константы.ш_ПараметрыПодключенияКШине.Получить());
		Данные.Свойство("Адрес", Адрес);
		Данные.Свойство("Порт", Порт);
		Данные.Свойство("ИмяПользователя", ИмяПользователя);
		Данные.Свойство("ИмяПользователяСистемы", ИмяПользователяСистемы);
		Данные.Свойство("Пароль", Пароль);
		Данные.Свойство("ПарольПользователяСистемы", ПарольПользователяСистемы);
		Данные.Свойство("ИД", ИД);
		Данные.Свойство("КоличествоОтправляемыхПакетовЗаРаз", КоличествоОтправляемыхПакетовЗаРаз);
		Данные.Свойство("МаксимальноеКоличествоОбработкиПакетовИзШины", МаксимальноеКоличествоОбработкиПакетовИзШины);
		
		Если НЕ Данные.Свойство("СтрокаПодключения", СтрокаПодключения) Тогда
			СтрокаПодключения = ш_РаботаСшинойДанныхСервер.ПолучитьСтрокуПодключения();
		КонецЕсли;
		
		Данные.Свойство("УдалятьОтработанныеПакеты", УдалятьОтработанныеПакеты);
		Данные.Свойство("КоличествоДнейХраненияОтработанныхПакетов", КоличествоДнейХраненияОтработанныхПакетов);
		
	Исключение
	КонецПопытки;
	
	УстановитьВидимостьДоступность();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти


#Область КомандыИСобытияЭлементов

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Данные = Новый Структура;
	Данные.Вставить("Адрес", Адрес);
	Данные.Вставить("Порт", Порт);
	Данные.Вставить("ИмяПользователя", ИмяПользователя);
	Данные.Вставить("ИмяПользователяСистемы", ИмяПользователяСистемы);
	Данные.Вставить("Пароль", Пароль);
	Данные.Вставить("ПарольПользователяСистемы", ПарольПользователяСистемы);
	Данные.Вставить("ИД", ИД);
	Данные.Вставить("КоличествоОтправляемыхПакетовЗаРаз", КоличествоОтправляемыхПакетовЗаРаз);
	Данные.Вставить("МаксимальноеКоличествоОбработкиПакетовИзШины", МаксимальноеКоличествоОбработкиПакетовИзШины);
	Данные.Вставить("СтрокаПодключения", СтрокаПодключения);
	Данные.Вставить("УдалятьОтработанныеПакеты", УдалятьОтработанныеПакеты);
	Данные.Вставить("КоличествоДнейХраненияОтработанныхПакетов", КоличествоДнейХраненияОтработанныхПакетов);
	
	Константы.ш_ПараметрыПодключенияКШине.Установить(ЗначениеВСтрокуВнутр(Данные));
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтроку(Команда)
	
	СтрокаПодключения = ш_РаботаСшинойДанныхСервер.ПолучитьСтрокуПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалятьОтработанныеПакетыПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.КоличествоДнейХраненияОтработанныхПакетов.Видимость = УдалятьОтработанныеПакеты;
	
КонецПроцедуры

#КонецОбласти





