#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриСозданииЧтенииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипКодаМаркировкиПриИзменении(Элемент)
	
	Объект.Наименование = Объект.ТипКодаМаркировки;
	
	УстановитьДоступностьИспользованияПоУмолчанию(ЭтотОбъект);
	
	Если Не Элементы.ИспользоватьПоУмолчанию.Видимость
		И Объект.ИспользоватьПоУмолчанию Тогда
		Объект.ИспользоватьПоУмолчанию = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	УстановитьДоступностьИспользованияПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьИспользованияПоУмолчанию(Форма)
	
	Форма.Элементы.ИспользоватьПоУмолчанию.Видимость =
		Форма.Объект.ТипКодаМаркировки = ПредопределенноеЗначение("Перечисление.ТипыКодовМаркировкиИСМП.ЕдиницаТовара")
		Или Форма.Объект.ТипКодаМаркировки = ПредопределенноеЗначение("Перечисление.ТипыКодовМаркировкиИСМП.Комплект");
	
КонецПроцедуры

#КонецОбласти
