Функция ЗначениеДляXDTO(Ссылка) Экспорт
	
	Если Ссылка= Заказ Тогда 
		Результат = "Заказ";
	ИначеЕсли Ссылка= Заявка Тогда 
		Результат = "Заявка";
	Иначе
		
		ВызватьИсключение "Для заполнения в xml передано неверное значение Функции заказа (заявки): " + Ссылка;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(Строка) Экспорт
	
	Если Строка= "Заказ" Тогда 
		Результат = Заказ;
	ИначеЕсли Строка= "Заявка" Тогда 
		Результат = Заявка;
	Иначе
		
		Результат = ПустаяСсылка();
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

