Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаЗН(Данные, Представление, СтандартнаяОбработка, "1");

КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ПорядОсущ");
	МассивОбязательных.Добавить("МаршрутДатВрПодТС");
	МассивОбязательных.Добавить("ТСТип");
	МассивОбязательных.Добавить("ТСМарка");
	МассивОбязательных.Добавить("ТСГрузопод");
	МассивОбязательных.Добавить("ТСВместим");
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ОтгрузочноеНаименование");
	МассивОбязательных.Добавить("СостояниеГруза");
	МассивОбязательных.Добавить("СпособУпаковки");
	МассивОбязательных.Добавить("ВидТары");
	МассивОбязательных.Добавить("ОбъемКубМ");
	МассивОбязательных.Добавить("КоличествоМест");
	МассивОбязательных.Добавить("МассаПлановаяБруттоКг");
	МассивОбязательных.Добавить("Высота");
	МассивОбязательных.Добавить("Длина");
	МассивОбязательных.Добавить("Ширина");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("КонтейнерыМассив");
	МассивОбязательных.Добавить("ОпасныеГрузыМассивСтруктур");
	
	Возврат МассивОбязательных;
	
КонецФункции

// какие поля могут быть высчитаны из базовых
Функция МассивБазовыхСоответствийРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ОтгрузочноеНаименование");
	МассивОбязательных.Добавить("СостояниеГруза");
	МассивОбязательных.Добавить("КодТНВЭД");
	МассивОбязательных.Добавить("КоличествоМест");
	МассивОбязательных.Добавить("МассаПлановаяБруттоКг");
	МассивОбязательных.Добавить("ОбъемКубМ");
	МассивОбязательных.Добавить("МассаПлановаяНеттоКг");
	МассивОбязательных.Добавить("КоличествоПаллет");
	МассивОбязательных.Добавить("ДопИнформация");
	МассивОбязательных.Добавить("ОбъявленнаяЦенность");
	МассивОбязательных.Добавить("ОбъявленнаяЦенностьВалюта");
	МассивОбязательных.Добавить("СпособУпаковки");
	МассивОбязательных.Добавить("ВидТары");
	МассивОбязательных.Добавить("Плотность");
	МассивОбязательных.Добавить("УчетГрузаВГИС");
	МассивОбязательных.Добавить("ЗначениеМаркировки");
	МассивОбязательных.Добавить("ОписаниеОпасногоГруза");
	МассивОбязательных.Добавить("Высота");
	МассивОбязательных.Добавить("Длина");
	МассивОбязательных.Добавить("Ширина");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"СопроводительныеДокументыМассивСтруктур",
		"Сопроводительные документы",
		"Указываются сопроводительные документы",
		"МассивСтруктур(см. таблицу СопроводительныеДокументы)",
		2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("МаркировкиМассив", "Маркировки", "Маркировка(и) товара", "МассивСтрок или Строка", 3));
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("КонтейнерыМассив", "Контейнеры", "Идент. номера контейнеров", "МассивСтрок или Строка", 2));
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("ОпасныеГрузыМассивСтруктур", "Опасные грузы", "Сведения об опасных грузах ДОПОГ", "МассивСтруктур(см. спр.КонтурЛогистика_ОписанияОпасныхГрузов)", 2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_ЗН");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("ДокументЗН");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфФт");
	МассивКлючевых.Добавить("ВрИнфФт");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

// Конец Обязательные манифесты

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда 
		
		// TODO понять какие сценарии проверки входящего документа
		
	ИначеЕсли Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		И Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан Тогда  
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ПроверитьТабЧастьТовары(ДокументОбъектИлиСсылка, ТаблицаОшибок, ТекСтатусТитула);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;

	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ГлавныйДокумент = Объект.ДокументЗН;
	
	Если НЕ ЗначениеЗаполнено(ГлавныйДокумент)  Тогда
		
		ТекстОшибки = "Титул не привязан к Документу Заказ-Наряд";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЗН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе    
		
		МассивОрганзаций = Новый Массив;
		МассивОрганзаций.Добавить(ГлавныйДокумент.Фрахтователь);
		МассивОрганзаций.Добавить(ГлавныйДокумент.Фрахтовщик);
		
		ОбязательныеРеквизитыГлавного = Документы.КонтурЛогистика_ЭлектронныйЗаказНаряд.МассивОбязательныхРеквизитов();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыГлавного Цикл
			Если НЕ ЗначениеЗаполнено(ГлавныйДокумент[ОбязательныйРевизит])  Тогда
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектронныйЗаказНаряд.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной транспортной накладной";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		Документы.КонтурЛогистика_ЭлектронныйЗаказНаряд.ПроверитьКлючевыеРеквизиты(ГлавныйДокумент, ТаблицаОшибок);

	КонецЕсли;
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(ГлавныйДокумент.Фрахтователь);
	
	Если Не ПараметрыСервиса.АвторизацияВыполнена И ЗначениеЗаполнено(ГлавныйДокумент.Фрахтователь) Тогда
	
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("БратьУИДИзПулаДляЗН") Тогда 
			Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
				
				Если Не ЗначениеЗаполнено(Объект.УИД_ЗН) Тогда 
					ТекстОшибки = "Не указан УИД из пула";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"УИД_ЗН", КатегорияОшибка, ТекстОшибки, "Взять из пула");
				КонецЕсли;
				
			Иначе
				
				ОстатокУИДов = РегистрыСведений.КонтурЛогистика_УИДыГИС.ОсталосьСвободныхУИДов(ГлавныйДокумент.Фрахтователь);
				Если ОстатокУИДов = 0 Тогда
					
					ТекстОшибки = "Не осталось свободных УИД в пуле. Получите новые или отключите использование пула.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"УИД_ЗН", КатегорияОшибка, ТекстОшибки, "Получить УИДы");
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ТрН_Титул1.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
		
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьТабЧастьТовары(Знач Объект, ТаблицаОшибок, ТекСтатусДокумента = Неопределено)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ИмяТЧ = "Товары";
	
	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		
		Если Не СтрокаТовара.Учитывать Тогда 
			Продолжить;
		КонецЕсли;
		
		ТекущийНомерСтроки = СтрокаТовара.НомерСтроки;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.КоличествоМест) Тогда
			ТекстОшибки = "Укажите Количество мест по грузу";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"КоличествоМест", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать кол-во мест");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.ОтгрузочноеНаименование) Тогда
			ТекстОшибки = "Укажите Отгрузочное наименование";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать отгрузочное наименование");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.СостояниеГруза) Тогда
			ТекстОшибки = "Укажите Состояние груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"СостояниеГруза", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать состояние груза");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.СпособУпаковки) Тогда
			ТекстОшибки = "Укажите Способ упаковки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"СпособУпаковки", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать способ упаковки");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.ВидТары) Тогда
			ТекстОшибки = "Укажите Вид тары";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ВидТары", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать вид тары");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.МассаПлановаяБруттоКг) Тогда
			ТекстОшибки = "Укажите Массу (брутто) груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"МассаПлановаяБруттоКг", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать массу брутто");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.ОбъемКубМ) Тогда
			ТекстОшибки = "Укажите Объем груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОбъемКубМ", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать объем");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Высота) Тогда
			ТекстОшибки = "Укажите Объем груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"Высота", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать Высота");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Длина) Тогда
			ТекстОшибки = "Укажите Объем груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"Длина", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать Длина");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Ширина) Тогда
			ТекстОшибки = "Укажите Объем груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"Ширина", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать Ширина");
		КонецЕсли;
		
		ПроверитьСвязанныеОпасныеГрузы(Объект, СтрокаТовара, ТаблицаОшибок);
		
	КонецЦикла;

КонецПроцедуры

Функция ПроверитьСвязанныеОпасныеГрузы(Знач Объект, Знач СтрокаТовара, ТаблицаОшибок)
	
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ТекущийНомерСтроки = СтрокаТовара.НомерСтроки;
	ИмяТЧ = "Товары"; // ошибки будем складывать к товарам

	СвязанныеСтрокиОГ = Объект.ОпасныеГрузы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиТоваров", СтрокаТовара.ИдентификаторСтроки));
	Для Каждого СтрокаОГ Из СвязанныеСтрокиОГ Цикл 
		
		Если ЗначениеЗаполнено(СтрокаОГ.ОписаниеОпасногоГруза) Тогда 
			Источник = СтрокаОГ.ОписаниеОпасногоГруза;
		Иначе
			Источник = СтрокаОГ;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.НомерООН) Тогда
			ТекстОшибки = "Укажите Номер ООН опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.НадлежащееОтгрузочноеНаименование) Тогда
			ТекстОшибки = "Укажите Надлежащее отгрузочное наименование опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.Класс) Тогда
			ТекстОшибки = "Укажите Класс опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.КлассификационныйКод) Тогда
			ТекстОшибки = "Укажите Классификационный код опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.ГруппаУпаковки) Тогда
			ТекстОшибки = "Укажите Группу упаковки опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.ЗнакОпасности) Тогда
			ТекстОшибки = "Укажите Знак опасности опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.КодОграниченияТуннели) Тогда
			ТекстОшибки = "Укажите Код ограничения проезда через туннели опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если Источник.Класс = Перечисления.КонтурЛогистика_КлассыОпасностиГрузов.Класс1 Тогда
			
			Если НЕ ЗначениеЗаполнено(Источник.ОбМасНетВзрСод) Тогда
				ТекстОшибки = "Укажите Общая масса нетто взрывчатого содержимого в килограммах для каждого вещества или изделия, имеющего отдельный номер ООН (т.к. класс = 1)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Источник.ОбМасНетВзрСодВсех) Тогда
				ТекстОшибки = "Укажите Общая масса нетто взрывчатого содержимого в килограммах для всех веществ и изделий, которых касается сопроводительная ведомость (т.к. класс = 1)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ЗН_Титул1.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

#КонецЕсли