#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПрочитатьУстановитьПараметры();
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Изменен")
		И Параметры.ЗначенияЗаполнения.Изменен Тогда
		Элементы.Изменен.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("ЭлементКонструктора")
		И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ЭлементКонструктора) Тогда
		Элементы.ЭлементКонструктора.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭлементКонструктораПриИзменении(Элемент)
	
	ПрочитатьУстановитьПараметры();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьУстановитьПараметры()
	
	ПараметрыЭлемента = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементаКонструктора(Запись.ЭлементКонструктора);
	
	Элементы.Значение.ОграничениеТипа = ПараметрыЭлемента.ТипЗначения;
	
	Если ПараметрыЭлемента.Параметризуется
		И ПараметрыЭлемента.ТипЗначения.Типы().Найти(Тип("Дата")) <> Неопределено
		И ПараметрыЭлемента.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
		Элементы.Значение.Формат = "ДФ=dd.MM.yyyy;";
		Элементы.Значение.ФорматРедактирования = "ДФ=dd.MM.yyyy;";
	КонецЕсли;
	
	Элементы.Значение.Доступность = ПараметрыЭлемента.Параметризуется;
	
	Если Не ПараметрыЭлемента.Параметризуется Тогда
		Запись.Значение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти