#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗапросМетодаИнтерфейсаСОбработкой(ПараметрыОбработки) Экспорт

	Если Не ЭлектроннаяПодпись.ИспользоватьЭлектронныеПодписи()
		И Не ПараметрыОбработки.ПроверкаПоТокенуРозничнойПродажи
		И Не ПараметрыОбработки.НеТребуетсяАвторизацияПоКлючуСессии Тогда
		ПараметрыОбработки.ЕстьОшибки  = Истина;
		ПараметрыОбработки.ТекстОшибки = НСтр("ru = 'Подсистема электронной подписи отключена.'");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОрганизациюПараметровОбработкиПоКлючуСессии(ПараметрыОбработки);
	
	Если Не ЗначениеЗаполнено(ПараметрыОбработки.Организация)
		И ПараметрыОбработки.ОрганизацияПоСертификатам = Неопределено Тогда
		ПараметрыОбработки.ОрганизацияПоСертификатам = Истина;
		Возврат;
	КонецЕсли;
	
	ТребуетсяОбновлениеКлючаСессии        = Ложь;
	ТребуетсяОбновлениеКлючаСессииРозница = Ложь;
	ТекстОшибки                           = Неопределено;
	ДанныеДляОбработки                    = Неопределено;
	
	ДоступныеМетодыИнтерфейса = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ДоступныеМетодыИнтерфейса();
	
	Если ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ЕмкостьУпаковкиПоGTIN Тогда
		
		ТаблицаНоменклатуры = Новый ТаблицаЗначений();
		ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура",   Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
		ТаблицаНоменклатуры.Колонки.Добавить("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
		
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = ПараметрыОбработки.Параметры.Номенклатура;
		МассивGTIN = Новый Массив();
		ШтрихкодированиеОбщегоНазначенияИС.ЗаполнитьПроверяемыеGTIN(ТаблицаНоменклатуры, МассивGTIN, Новый Соответствие(),, Ложь);
		
		Если МассивGTIN.Количество() = 0 Тогда
			
			ТекстОшибки = НСтр("ru = 'Не найдено GTIN для получения емкости упаковки по данным ГИС МТ.'");
			
		Иначе
			
			Результат = ИнтерфейсИСМПОбщегоНазначения.ДанныеПродукцииПоШтрихкодуEAN(
				МассивGTIN,
				ПараметрыОбработки.Организация);
			
			ТребуетсяОбновлениеКлючаСессии = Результат.ТребуетсяОбновлениеКлючаСессии;
			ТекстОшибки                    = Результат.ТекстОшибки;
			ДанныеДляОбработки             = Результат.ДанныеПродукцииПоШтрихкодуEAN;
			
		КонецЕсли;
	
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.МестаОсуществленияДеятельности Тогда
		
		Результат = ИнтерфейсИСМПОбщегоНазначения.МестаОсуществленияДеятельности(ПараметрыОбработки.Организация, ПараметрыОбработки.ВидПродукции);
		
		ТребуетсяОбновлениеКлючаСессии = Результат.ТребуетсяОбновлениеКлючаСессии;
		ТекстОшибки                    = Результат.ТекстОшибки;
		ДанныеДляОбработки             = Результат.МестаОсуществленияДеятельности;
		
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.СписокМестОсуществленияДеятельности Тогда
		
		Результат = ИнтерфейсИСМПОбщегоНазначения.СписокМестОсуществленияДеятельности(ПараметрыОбработки.Организация, ПараметрыОбработки.Параметры);
		
		ТребуетсяОбновлениеКлючаСессии = Результат.ТребуетсяОбновлениеКлючаСессии;
		ТекстОшибки                    = Результат.ТекстОшибки;
		ДанныеДляОбработки             = Результат.МестаОсуществленияДеятельности;
		
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.РегистрацияМестОсуществленияДеятельностиГИСМТ Тогда
		
		Результат = ИнтерфейсИСМПОбщегоНазначения.РегистрацияСпискаМестОсуществленияДеятельностиГИСМТ(ПараметрыОбработки.Организация,
			ПараметрыОбработки.Параметры);
		
		ТребуетсяОбновлениеКлючаСессии = Результат.ТребуетсяОбновлениеКлючаСессии;
		ТекстОшибки                    = Результат.ТекстОшибки;
		ДанныеДляОбработки 			   = Результат.МестаОсуществленияДеятельности;
	
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.УдалениеМестаОсуществленияДеятельностиГИСМТ Тогда
		
		Результат = ИнтерфейсИСМПОбщегоНазначения.УдалениеМестаОсуществленияДеятельностиГИСМТ(ПараметрыОбработки.Организация,
			ПараметрыОбработки.Параметры);
		
		ТребуетсяОбновлениеКлючаСессии = Результат.ТребуетсяОбновлениеКлючаСессии;
		ТекстОшибки                    = Результат.ТекстОшибки;
		ДанныеДляОбработки             = Неопределено;
	
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.АктуализацияСпискаМестОсуществленияДеятельности Тогда
		
		Результат = ИнтерфейсИСМПОбщегоНазначения.АктуализацияСпискаМестОсуществленияДеятельности(ПараметрыОбработки.Организация,
			ПараметрыОбработки.Параметры);
		
		ТребуетсяОбновлениеКлючаСессии = Результат.ТребуетсяОбновлениеКлючаСессии;
		ТекстОшибки                    = Результат.ТекстОшибки;
		ДанныеДляОбработки             = Результат.МестаОсуществленияДеятельности;
		
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.АктуализацияCDNПлощадок Тогда
		
		ОбновлятьБезПроверкиДатыОбновления = Ложь;
		ИспользуетсяТСПИоТДляРР            = Ложь;
		
		Если ТипЗнч(ПараметрыОбработки.Параметры) = Тип("Структура") Тогда
			
			Если ПараметрыОбработки.Параметры.Свойство("ОбновлятьБезПроверкиДатыОбновления") Тогда
				ОбновлятьБезПроверкиДатыОбновления = ПараметрыОбработки.Параметры.ОбновлятьБезПроверкиДатыОбновления;
			КонецЕсли;
			
			НомерФискальногоНакопителя = "";
			ККТ                        = Неопределено;
			
			Если ПараметрыОбработки.Параметры.Свойство("НомерФискальногоНакопителя") Тогда
				НомерФискальногоНакопителя = ПараметрыОбработки.Параметры.НомерФискальногоНакопителя;
			КонецЕсли;
			
			Если ПараметрыОбработки.Параметры.Свойство("ККТ") Тогда
				ККТ = ПараметрыОбработки.Параметры.ККТ;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ККТ) Или ЗначениеЗаполнено(НомерФискальногоНакопителя) Тогда
				ИспользуетсяТСПИоТДляРР = ИнтеграцияТСПИоТ.ПоПодключаемомуОборудованиюНастроеноПодключениеТСПИоТ(ККТ, НомерФискальногоНакопителя);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИспользуетсяТСПИоТДляРР Тогда
			ПараметрыОбработки.ВыполнениеВФоне = Ложь;
			Возврат;
		КонецЕсли;
		
		РезультатОбновления = ОбщегоНазначенияИСМПВызовСервера.ЗапуститьОбновлениеCDNПлощадок(ПараметрыОбработки.Организация, ПараметрыОбработки.УникальныйИдентификатор, ОбновлятьБезПроверкиДатыОбновления);
		
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ИнициализацияКонфигурацииЛокальногоМодуляЧЗ Тогда
		
		РезультатНастройкиЛМЧЗ = ОбщегоНазначенияИСМПВызовСервера.ИнициализироватьКонфигурациюЛокальногоМодуляЧЗ(
			ПараметрыОбработки.Параметры.Организация,
			ПараметрыОбработки.Параметры.ПараметрыУстановки,
			ПараметрыОбработки.УникальныйИдентификатор);
			
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ОбновлениеСтатусаЛокальногоМодуляЧЗ Тогда
		
		РезультатНастройкиЛМЧЗ = ОбщегоНазначенияИСМПВызовСервера.ЗапроситьСтатусЛокальногоМодуляЧЗ(
			ПараметрыОбработки.Параметры.Организация,
			ПараметрыОбработки.Параметры.ПараметрыУстановки,
			ПараметрыОбработки.УникальныйИдентификатор);
			
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.СменаПароляАдминистрированияЛокальногоМодуляЧЗ Тогда
		
		РезультатНастройкиЛМЧЗ = ОбщегоНазначенияИСМПВызовСервера.ИзменитьПарольАдминистратораЛокальногоМодуляЧЗ(
			ПараметрыОбработки.Параметры.Организация,
			ПараметрыОбработки.Параметры.ПараметрыУстановки,
			ПараметрыОбработки.Параметры.НовыйПароль,
			ПараметрыОбработки.УникальныйИдентификатор);
			
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.НастройкаСпискаТоварныхГрупп Тогда
		
		РезультатНастройкиЛМЧЗ = ОбщегоНазначенияИСМПВызовСервера.НастроитьТоварныеГруппыЛокальногоМодуляЧЗ(
			ПараметрыОбработки.Параметры.Организация,
			ПараметрыОбработки.Параметры.ПараметрыУстановки,
			ПараметрыОбработки.Параметры.ПараметрыНастройкиТоварныхГрупп,
			ПараметрыОбработки.УникальныйИдентификатор);
			
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ПолучениеКонфигурацииЛокальногоМодуляЧЗ Тогда
		
		РезультатНастройкиЛМЧЗ = ОбщегоНазначенияИСМПВызовСервера.ПолучитьКонфигурациюЛокальногоМодуляЧЗ(
			ПараметрыОбработки.Параметры.Организация,
			ПараметрыОбработки.Параметры.ПараметрыУстановки,
			ПараметрыОбработки.УникальныйИдентификатор);
	
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ТоварныеГруппыПоОрганизации Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ПараметрыОбработки.УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Товарные группы по организации'");
		
		ПараметрыФоновогоЗадания = Новый Структура;
		ПараметрыФоновогоЗадания.Вставить("Организация",                      ПараметрыОбработки.Организация);
		ПараметрыФоновогоЗадания.Вставить("ПараметрыЛогированияЗапросовИСМП", ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП);
		
		Если ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
			МодульИнтеграцияИСПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
			МодульИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		КонецЕсли;
		
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
			"ОбщегоНазначенияИСМП.ТоварныеГруппыПоОрганизацииДлительнаяОперация",
			ПараметрыФоновогоЗадания, ПараметрыВыполнения);
			
	ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ПолучениеДанныхНастройкиТСПИоТ Тогда
		
		РезультатНастроекТСПИоТ = ОбщегоНазначенияИСМПВызовСервера.ПолучитьДанныеНастройкиТСПИоТ(
			ПараметрыОбработки.Параметры.ПараметрыПодключения,
			ПараметрыОбработки.УникальныйИдентификатор);
		
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Внутренняя ошибка. Не описан метод интерфейса с запросом ключа авторизации %1'"),
			ПараметрыОбработки.ИмяОбработчика);
	КонецЕсли;
	
	Если ТребуетсяОбновлениеКлючаСессии Тогда
		
		ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессии = Истина;
		
	ИначеЕсли ТребуетсяОбновлениеКлючаСессииРозница Тогда
		
		ПараметрыОбработки.ТребуетсяОбновлениеКлючаСессииРозница = Истина;
	
	ИначеЕсли ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ПараметрыОбработки.ЕстьОшибки  = Истина;
		ПараметрыОбработки.ТекстОшибки = ТекстОшибки;
		
	Иначе
		
		Если ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ЕмкостьУпаковкиПоGTIN Тогда
			ПараметрыОбработки.Результат = ОбработкаРезультатаЕмкостьУпаковкиПоGTIN(ДанныеДляОбработки);
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.МестаОсуществленияДеятельности
			Или ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.СписокМестОсуществленияДеятельности 
			Или ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.АктуализацияСпискаМестОсуществленияДеятельности Тогда
			ПараметрыОбработки.Результат = ОбработкаМестаОсуществленияДеятельности(ДанныеДляОбработки);
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.АктуализацияCDNПлощадок Тогда
			ПараметрыОбработки.ДлительнаяОперация = РезультатОбновления;
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ТоварныеГруппыПоОрганизации Тогда
			ПараметрыОбработки.ДлительнаяОперация = ДлительнаяОперация;
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ИнициализацияКонфигурацииЛокальногоМодуляЧЗ
			Или ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ОбновлениеСтатусаЛокальногоМодуляЧЗ
			Или ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.СменаПароляАдминистрированияЛокальногоМодуляЧЗ
			Или ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.НастройкаСпискаТоварныхГрупп
			Или ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ПолучениеКонфигурацииЛокальногоМодуляЧЗ Тогда
			ПараметрыОбработки.ДлительнаяОперация = РезультатНастройкиЛМЧЗ;
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.ПолучениеДанныхНастройкиТСПИоТ Тогда
			ПараметрыОбработки.ДлительнаяОперация = РезультатНастроекТСПИоТ;
		ИначеЕсли ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.РегистрацияМестОсуществленияДеятельностиГИСМТ
			Или ПараметрыОбработки.ИмяОбработчика = ДоступныеМетодыИнтерфейса.УдалениеМестаОсуществленияДеятельностиГИСМТ Тогда
			ПараметрыОбработки.Результат = ДанныеДляОбработки;
		Иначе 
			ВызватьИсключение НСтр("ru = 'Внутренняя ошибка. Не описан метод интерфейса с запросом ключа авторизации (после авторизации).'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОрганизациюПараметровОбработкиПоКлючуСессии(ПараметрыОбработки) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыОбработки.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОбработки.ПроверкаПоТокенуРозничнойПродажи Тогда
		ПараметрыЗапроса = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессииИСМПРозница();
	Иначе
		ПараметрыЗапроса = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессии();
	КонецЕсли;
	
	ДанныеКлючаСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПолучитьСохраненныеДанныеКлючаСессии(ПараметрыЗапроса.ИмяПараметраСеанса);
	ОрганизацииСИстекшимКлючем = Новый ТаблицаЗначений();
	ОрганизацииСИстекшимКлючем.Колонки.Добавить("Организация");
	ОрганизацииСИстекшимКлючем.Колонки.Добавить("ДействуетДо");
	
	Если ДанныеКлючаСессии <> Неопределено Тогда
		Для Каждого КлючИЗначение Из ДанныеКлючаСессии Цикл
			Организация          = КлючИЗначение.Ключ;
			ПараметрыКлючаСессии = КлючИЗначение.Значение;
			ЭтоРозничныйТокен    = 
				(ПараметрыЗапроса.ИмяПараметраСеанса = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ИмяДанныхКлючаСессии(Перечисления.ТипыТокеновАвторизации.ИСМПРозница));
				
			Если ЭтоРозничныйТокен
				И ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ДатаДействияТокенаИСМПРозница() > ТекущаяДатаСеанса() Тогда
					ПараметрыОбработки.Организация = Организация;
				Возврат;
			ИначеЕсли Не ЭтоРозничныйТокен И ПараметрыКлючаСессии.ДействуетДо > ТекущаяДатаСеанса() Тогда
				ПараметрыОбработки.Организация = Организация;
				Возврат;
			Иначе
				НоваяСтрока = ОрганизацииСИстекшимКлючем.Добавить();
				НоваяСтрока.Организация = Организация;
				НоваяСтрока.ДействуетДо = ПараметрыКлючаСессии.ДействуетДо;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СертификатыДляПодписания = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
	
	Если СертификатыДляПодписания <> Неопределено
		И СертификатыДляПодписания.Сертификаты.Количество() Тогда
		ПараметрыОбработки.Организация = СертификатыДляПодписания.Сертификаты[0].Организация;
		Возврат;
	КонецЕсли;
	
	Если ОрганизацииСИстекшимКлючем.Количество() Тогда
		ОрганизацииСИстекшимКлючем.Сортировать("ДействуетДо убыв");
		ПараметрыОбработки.Организация = ОрганизацииСИстекшимКлючем[0].Организация;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработкаРезультатаЕмкостьУпаковкиПоGTIN(ИсходныеДанные)
	
	Результат     = Новый Соответствие();
	ОписаниеЧисло = Новый ОписаниеТипов("Число");
	Для Каждого КлючИЗначение Из ИсходныеДанные Цикл
		
		GTIN                 = КлючИЗначение.Ключ;
		ДанныеОписанияТовара = КлючИЗначение.Значение;
		ЕмкостьУпаковки      = ОписаниеЧисло.ПривестиЗначение(ДанныеОписанияТовара.ЕмкостьУпаковки);
		Если Не ЗначениеЗаполнено(ЕмкостьУпаковки) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Вставить(GTIN, ЕмкостьУпаковки);
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОбработкаМестаОсуществленияДеятельности(ИсходныеДанные)
	
	ВозвращаемоеЗначение = Новый Массив();
	КешДобавленных       = Новый Соответствие();
	
	Для Каждого СтрокаДанных Из ИсходныеДанные Цикл
		
		Если Не СтрокаДанных.Свойство("ИдентификаторМОД") И КешДобавленных[СтрокаДанных.КодФИАС] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаДанных = Новый Структура();
		НоваяСтрокаДанных.Вставить("КодФИАС",             СтрокаДанных.КодФИАС);
		НоваяСтрокаДанных.Вставить("ДанныеАдреса",        "");
		НоваяСтрокаДанных.Вставить("ПредставлениеАдреса", "");
		НоваяСтрокаДанных.Вставить("ИНН",                 СтрокаДанных.ИНН);
		НоваяСтрокаДанных.Вставить("КПП",                 СтрокаДанных.КПП);
		НоваяСтрокаДанных.Вставить("ТоварныеГруппы",      СтрокаДанных.ТоварныеГруппы);
		НоваяСтрокаДанных.Вставить("ИдентификаторМОД",    "");
		
		Если СтрокаДанных.Свойство("ИдентификаторМОД") Тогда
			НоваяСтрокаДанных.ИдентификаторМОД = СтрокаДанных.ИдентификаторМОД;
		КонецЕсли;
		
		Если СтрокаДанных.КодФИАС <> Неопределено Тогда
			НоваяСтрокаДанных.ДанныеАдреса = РаботаСАдресами.АдресПоИдентификатору(СтрокаДанных.КодФИАС);

			Если НоваяСтрокаДанных.ДанныеАдреса <> Неопределено Тогда
				НоваяСтрокаДанных.ПредставлениеАдреса = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(
					НоваяСтрокаДанных.ДанныеАдреса);
			КонецЕсли;

		КонецЕсли;
		
		ВозвращаемоеЗначение.Добавить(НоваяСтрокаДанных);
		
		Если НоваяСтрокаДанных.КодФИАС <> Неопределено Тогда
			КешДобавленных[СтрокаДанных.КодФИАС] = НоваяСтрокаДанных;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает массив доступных видов продукции по ТН ВЭД и ОКПД2.
//
// Параметры:
//  ДанныеДляУточнения   - см. ОбщегоНазначенияИСМПКлиентСервер.ДанныеДляУточненияВидовПродукцииПоТНВЭДиОКПД2.
//  ПоВсемВидамПродукции - Булево - Истина - искать по всем видам продукции, иначе, только среди используемых.
//  
// Возвращаемое значение:
//  Массив из СправочникСсылка.ВидыПродукцииИС - доступные виды продукции.
Функция ВидыПродукцииПоДаннымУточнения(ДанныеДляУточнения, ПоВсемВидамПродукции = Истина) Экспорт
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(ДанныеДляУточнения.ТНВЭД) Тогда
		ОтборПоТНВЭД = СокрЛП(ДанныеДляУточнения.ТНВЭД) + "%";
	Иначе
		ОтборПоТНВЭД = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляУточнения.ГруппаТНВЭД) Тогда
		ОтборПоГруппеТНВЭД = СокрЛП(ДанныеДляУточнения.ГруппаТНВЭД) + "%";
	Иначе
		ОтборПоГруппеТНВЭД = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляУточнения.ОКПД2) Тогда
		ОтборПоОКПД2 = СокрЛП(ДанныеДляУточнения.ОКПД2) + "%";
	Иначе
		ОтборПоОКПД2 = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляУточнения.ГруппаОКПД2) Тогда
		ОтборПоГруппеОКПД2 = СокрЛП(ДанныеДляУточнения.ГруппаОКПД2) + "%";
	Иначе
		ОтборПоГруппеОКПД2 = "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТНВЭД",                ОтборПоТНВЭД);
	Запрос.УстановитьПараметр("ЕстьТНВЭД",            ЗначениеЗаполнено(ДанныеДляУточнения.ТНВЭД));
	Запрос.УстановитьПараметр("ГруппаТНВЭД",          ОтборПоГруппеТНВЭД);
	Запрос.УстановитьПараметр("ЕстьГруппаТНВЭД",      ЗначениеЗаполнено(ДанныеДляУточнения.ГруппаТНВЭД));
	Запрос.УстановитьПараметр("ОКПД2",                ОтборПоОКПД2);
	Запрос.УстановитьПараметр("ЕстьОКПД2",            ЗначениеЗаполнено(ДанныеДляУточнения.ОКПД2));
	Запрос.УстановитьПараметр("ГруппаОКПД2",          ОтборПоГруппеОКПД2);
	Запрос.УстановитьПараметр("ЕстьГруппаОКПД2",      ЗначениеЗаполнено(ДанныеДляУточнения.ГруппаОКПД2));
	Запрос.УстановитьПараметр("ПоВсемВидамПродукции", ПоВсемВидамПродукции);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	1 КАК Приоритет,
	|	ТНВЭДПоВидамПродукцииИС.ВидПродукции КАК ВидПродукции
	|ПОМЕСТИТЬ ТНВЭД
	|ИЗ
	|	Справочник.ТНВЭДПоВидамПродукцииИС КАК ТНВЭДПоВидамПродукцииИС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ВидыПродукции
	|	ПО ТНВЭДПоВидамПродукцииИС.ВидПродукции = ВидыПродукции.ВидПродукции
	|	И НЕ ВидыПродукции.ПометкаУдаления
	|ГДЕ
	|	&ЕстьТНВЭД И ТНВЭДПоВидамПродукцииИС.Код ПОДОБНО &ТНВЭД
	|	И ТНВЭДПоВидамПродукцииИС.Код = ТНВЭДПоВидамПродукцииИС.КодЧЗ
	|	И ТНВЭДПоВидамПродукцииИС.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)
	|	И (&ПоВсемВидамПродукции ИЛИ НЕ ВидыПродукции.ВидПродукции ЕСТЬ NULL)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	2 КАК Приоритет,
	|	ТНВЭДПоВидамПродукцииИС.ВидПродукции КАК ВидПродукции
	|ИЗ
	|	Справочник.ТНВЭДПоВидамПродукцииИС КАК ТНВЭДПоВидамПродукцииИС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ВидыПродукции
	|	ПО ТНВЭДПоВидамПродукцииИС.ВидПродукции = ВидыПродукции.ВидПродукции
	|	И НЕ ВидыПродукции.ПометкаУдаления
	|ГДЕ
	|	&ЕстьТНВЭД И ТНВЭДПоВидамПродукцииИС.Код ПОДОБНО &ТНВЭД
	|	И ТНВЭДПоВидамПродукцииИС.Код <> ТНВЭДПоВидамПродукцииИС.КодЧЗ
	|	И ТНВЭДПоВидамПродукцииИС.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)
	|	И (&ПоВсемВидамПродукции ИЛИ НЕ ВидыПродукции.ВидПродукции ЕСТЬ NULL)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	1 КАК Приоритет,
	|	ТНВЭДПоВидамПродукцииИС.ВидПродукции КАК ВидПродукции
	|ПОМЕСТИТЬ ГруппаТНВЭД
	|ИЗ
	|	Справочник.ТНВЭДПоВидамПродукцииИС КАК ТНВЭДПоВидамПродукцииИС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ВидыПродукции
	|	ПО ТНВЭДПоВидамПродукцииИС.ВидПродукции = ВидыПродукции.ВидПродукции
	|	И НЕ ВидыПродукции.ПометкаУдаления
	|ГДЕ
	|	&ЕстьГруппаТНВЭД И ТНВЭДПоВидамПродукцииИС.Код ПОДОБНО &ГруппаТНВЭД
	|	И ТНВЭДПоВидамПродукцииИС.Код = ТНВЭДПоВидамПродукцииИС.КодЧЗ
	|	И ТНВЭДПоВидамПродукцииИС.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)
	|	И (&ПоВсемВидамПродукции ИЛИ НЕ ВидыПродукции.ВидПродукции ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	2 КАК Приоритет,
	|	ТНВЭДПоВидамПродукцииИС.ВидПродукции КАК ВидПродукции
	|ИЗ
	|	Справочник.ТНВЭДПоВидамПродукцииИС КАК ТНВЭДПоВидамПродукцииИС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ВидыПродукции
	|	ПО ТНВЭДПоВидамПродукцииИС.ВидПродукции = ВидыПродукции.ВидПродукции
	|	И НЕ ВидыПродукции.ПометкаУдаления
	|ГДЕ
	|	&ЕстьГруппаТНВЭД И ТНВЭДПоВидамПродукцииИС.Код ПОДОБНО &ГруппаТНВЭД
	|	И ТНВЭДПоВидамПродукцииИС.Код <> ТНВЭДПоВидамПродукцииИС.КодЧЗ
	|	И ТНВЭДПоВидамПродукцииИС.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)
	|	И (&ПоВсемВидамПродукции ИЛИ НЕ ВидыПродукции.ВидПродукции ЕСТЬ NULL)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	1 КАК Приоритет,
	|	ОКПД2ПоВидамПродукцииИС.ВидПродукции КАК ВидПродукции
	|ПОМЕСТИТЬ ОКПД2
	|ИЗ
	|	Справочник.ОКПД2ПоВидамПродукцииИС КАК ОКПД2ПоВидамПродукцииИС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ВидыПродукции
	|	ПО ОКПД2ПоВидамПродукцииИС.ВидПродукции = ВидыПродукции.ВидПродукции
	|	И НЕ ВидыПродукции.ПометкаУдаления
	|ГДЕ
	|	&ЕстьОКПД2 И ОКПД2ПоВидамПродукцииИС.Код ПОДОБНО &ОКПД2
	|	И ОКПД2ПоВидамПродукцииИС.Код = ОКПД2ПоВидамПродукцииИС.КодЧЗ
	|	И ОКПД2ПоВидамПродукцииИС.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)
	|	И (&ПоВсемВидамПродукции ИЛИ НЕ ВидыПродукции.ВидПродукции ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	2 КАК Приоритет,
	|	ОКПД2ПоВидамПродукцииИС.ВидПродукции КАК ВидПродукции
	|ИЗ
	|	Справочник.ОКПД2ПоВидамПродукцииИС КАК ОКПД2ПоВидамПродукцииИС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ВидыПродукции
	|	ПО ОКПД2ПоВидамПродукцииИС.ВидПродукции = ВидыПродукции.ВидПродукции
	|	И НЕ ВидыПродукции.ПометкаУдаления
	|ГДЕ
	|	&ЕстьОКПД2 И ОКПД2ПоВидамПродукцииИС.Код ПОДОБНО &ОКПД2
	|	И ОКПД2ПоВидамПродукцииИС.Код <> ОКПД2ПоВидамПродукцииИС.КодЧЗ
	|	И ОКПД2ПоВидамПродукцииИС.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)
	|	И (&ПоВсемВидамПродукции ИЛИ НЕ ВидыПродукции.ВидПродукции ЕСТЬ NULL)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	1 КАК Приоритет,
	|	ОКПД2ПоВидамПродукцииИС.ВидПродукции КАК ВидПродукции
	|ПОМЕСТИТЬ ГруппаОКПД2
	|ИЗ
	|	Справочник.ОКПД2ПоВидамПродукцииИС КАК ОКПД2ПоВидамПродукцииИС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ВидыПродукции
	|	ПО ОКПД2ПоВидамПродукцииИС.ВидПродукции = ВидыПродукции.ВидПродукции
	|	И НЕ ВидыПродукции.ПометкаУдаления
	|
	|ГДЕ
	|	&ЕстьГруппаОКПД2 И ОКПД2ПоВидамПродукцииИС.Код ПОДОБНО &ГруппаОКПД2
	|	И ОКПД2ПоВидамПродукцииИС.Код = ОКПД2ПоВидамПродукцииИС.КодЧЗ
	|	И ОКПД2ПоВидамПродукцииИС.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)
	|	И (&ПоВсемВидамПродукции ИЛИ НЕ ВидыПродукции.ВидПродукции ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	2 КАК Приоритет,
	|	ОКПД2ПоВидамПродукцииИС.ВидПродукции КАК ВидПродукции
	|ИЗ
	|	Справочник.ОКПД2ПоВидамПродукцииИС КАК ОКПД2ПоВидамПродукцииИС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ВидыПродукции
	|	ПО ОКПД2ПоВидамПродукцииИС.ВидПродукции = ВидыПродукции.ВидПродукции
	|	И НЕ ВидыПродукции.ПометкаУдаления
	|ГДЕ
	|	&ЕстьГруппаОКПД2 И ОКПД2ПоВидамПродукцииИС.Код ПОДОБНО &ГруппаОКПД2
	|	И ОКПД2ПоВидамПродукцииИС.Код <> ОКПД2ПоВидамПродукцииИС.КодЧЗ
	|	И ОКПД2ПоВидамПродукцииИС.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)
	|	И (&ПоВсемВидамПродукции ИЛИ НЕ ВидыПродукции.ВидПродукции ЕСТЬ NULL)
	|;
	|ВЫБРАТЬ
	|	Таблица.ВидПродукции КАК ВидПродукции
	|ИЗ
	|	ТНВЭД КАК Таблица
	|ГДЕ
	|	Таблица.Приоритет В
	|	(ВЫБРАТЬ МИНИМУМ(Таблица.Приоритет) КАК Приоритет ИЗ ТНВЭД КАК Таблица)
	|;
	|ВЫБРАТЬ
	|	Таблица.ВидПродукции КАК ВидПродукции
	|ИЗ
	|	ГруппаТНВЭД КАК Таблица
	|ГДЕ
	|	Таблица.Приоритет В
	|	(ВЫБРАТЬ МИНИМУМ(Таблица.Приоритет) КАК Приоритет ИЗ ГруппаТНВЭД КАК Таблица)
	|;
	|ВЫБРАТЬ
	|	Таблица.ВидПродукции КАК ВидПродукции
	|ИЗ
	|	ОКПД2 КАК Таблица
	|ГДЕ
	|	Таблица.Приоритет В
	|	(ВЫБРАТЬ МИНИМУМ(Таблица.Приоритет) КАК Приоритет ИЗ ОКПД2 КАК Таблица)
	|;
	|ВЫБРАТЬ
	|	Таблица.ВидПродукции КАК ВидПродукции
	|ИЗ
	|	ГруппаОКПД2 КАК Таблица
	|ГДЕ
	|	Таблица.Приоритет В
	|	(ВЫБРАТЬ МИНИМУМ(Таблица.Приоритет) КАК Приоритет ИЗ ГруппаОКПД2 КАК Таблица)
	|";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ВГраница = ПакетЗапросов.ВГраница();
	
	ВидыПродукцииПоТНВЭД       = ПакетЗапросов[ВГраница - 3].Выгрузить().ВыгрузитьКолонку("ВидПродукции");
	ВидыПродукцииПоГруппеТНВЭД = ПакетЗапросов[ВГраница - 2].Выгрузить().ВыгрузитьКолонку("ВидПродукции");
	ВидыПродукцииПоОКПД2       = ПакетЗапросов[ВГраница - 1].Выгрузить().ВыгрузитьКолонку("ВидПродукции");
	ВидыПродукцииПоГруппеОКПД2 = ПакетЗапросов[ВГраница].Выгрузить().ВыгрузитьКолонку("ВидПродукции");
	
	Если ВидыПродукцииПоТНВЭД.Количество() = 1 Тогда
		Результат = ВидыПродукцииПоТНВЭД;
	ИначеЕсли ВидыПродукцииПоГруппеТНВЭД.Количество() = 1 Тогда
		Результат = ВидыПродукцииПоГруппеТНВЭД;
	ИначеЕсли ВидыПродукцииПоОКПД2.Количество() = 1 Тогда
		Результат = ВидыПродукцииПоОКПД2;
	ИначеЕсли ВидыПродукцииПоГруппеОКПД2.Количество() = 1 Тогда
		Результат = ВидыПродукцииПоГруппеОКПД2;
	Иначе
		Если ВидыПродукцииПоТНВЭД.Количество() = 0 Тогда
			ВидыПродукцииПоТНВЭД = ВидыПродукцииПоГруппеТНВЭД;
		КонецЕсли;
		Если ВидыПродукцииПоОКПД2.Количество() = 0 Тогда
			ВидыПродукцииПоОКПД2 = ВидыПродукцииПоГруппеОКПД2;
		КонецЕсли;
		Если ВидыПродукцииПоТНВЭД.Количество() > 0
			И ВидыПродукцииПоОКПД2.Количество() > 0 Тогда
			Для Каждого ВидПродукции Из ВидыПродукцииПоОКПД2 Цикл
				Если ВидыПродукцииПоТНВЭД.Найти(ВидПродукции) <> Неопределено Тогда
					Результат.Добавить(ВидПродукции);
				КонецЕсли;
			КонецЦикла;
			Если Результат.Количество() = 0 Тогда
				Результат = ВидыПродукцииПоТНВЭД;
				Для Каждого ВидПродукции Из ВидыПродукцииПоОКПД2 Цикл
					Если Результат.Найти(ВидПродукции) <> Неопределено Тогда
						Результат.Добавить(ВидПродукции);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли ВидыПродукцииПоТНВЭД.Количество() > 0 Тогда
			Результат = ВидыПродукцииПоТНВЭД;
		Иначе
			Результат = ВидыПродукцииПоОКПД2;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти