
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеСертификата = Параметры.ДанныеСертификата;
	
	ДатаВыдачи 				= ДанныеСертификата.ДатаВыдачи;
	ОтпечатокСертификата 	= ДанныеСертификата.ОтпечатокСертификата;
	ПЗК 					= ДанныеСертификата.ПЗК;
	Представление 			= ДанныеСертификата.Представление;
	СертификатИстекает 		= ДанныеСертификата.СрокДействия;
	СертификатНаСервере 	= ДанныеСертификата.СертификатНаСервере;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПароль(Команда)
	
	Закрыть(ПЗК);
	
КонецПроцедуры
