#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СформироватьНайтиПодчиненныйДокумент(ДокументОсновной, НастройкаСвязи) Экспорт
	
	Перем ДокументПодчиненный;
	
	ДанныеНастройкиСвязи = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
		НастройкаСвязи, "ТипДокументаПодчиненный, ПоискПодчиненного, ПоискаПодчиненногоВыражениеВычисления,
		|ВводитьНаОсновании, НастройкиКонвертацииПодчиненного,
		|РасчетОснованияЗаполнения_Расчитывать, РасчетОснованияЗаполнения_СпособМаппинга, РасчетОснованияЗаполнения_ВыражениеВычисления");
	
	// Выполним поиск уже существующего
	Если ДанныеНастройкиСвязи.ПоискПодчиненного Тогда
		ДокументПодчиненный = РезультатВычисленияВыражения(ДокументОсновной, ДанныеНастройкиСвязи.ПоискаПодчиненногоВыражениеВычисления);
		
		Если ЗначениеЗаполнено(ДокументПодчиненный) Тогда
			Возврат ДокументПодчиненный;
		КонецЕсли;
	КонецЕсли;
	
	// Введем на основании новый документ
	Если ДанныеНастройкиСвязи.ВводитьНаОсновании Тогда
		
		// Документ основание для заполнения
		Если ДанныеНастройкиСвязи.РасчетОснованияЗаполнения_Расчитывать Тогда
			ДокументОснованиеДляЗаполнения = ВычислитьДокументОснование(ДокументОсновной, ДанныеНастройкиСвязи);
		Иначе
			ДокументОснованиеДляЗаполнения = ДокументОсновной;
		КонецЕсли;
		
		ДокументыОснованиеДляЗаполнения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОснованиеДляЗаполнения);
		
		// Формируем новый документ
		Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоДокументПодсистемы(ДокументОснованиеДляЗаполнения) Тогда
			РезультатВвода = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиСледующиеТитулыПоПереданнымПакетно(
				ДокументыОснованиеДляЗаполнения, ДанныеНастройкиСвязи.ТипДокументаПодчиненный, Ложь, Новый Массив);
		Иначе
			РезультатВвода = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументыПакетно(
				ДокументыОснованиеДляЗаполнения, Ложь, ДанныеНастройкиСвязи.ТипДокументаПодчиненный);
		КонецЕсли;
		
		// Не удалось сформировать
		Если РезультатВвода.ВведенныеДокументы.Количество() = 0 Тогда
			Возврат ДокументПодчиненный;
		Иначе
			ДокументПодчиненный = РезультатВвода.ВведенныеДокументы[0];
		КонецЕсли;
		
		// Заполним из НКД
		Если ДанныеНастройкиСвязи.РасчетОснованияЗаполнения_Расчитывать
			И ЗначениеЗаполнено(ДанныеНастройкиСвязи.НастройкиКонвертацииПодчиненного) Тогда
			
			ДокументПодчиненныйОбъект = ДокументПодчиненный.ПолучитьОбъект();
			
			КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
				ДокументПодчиненныйОбъект, ДанныеНастройкиСвязи.НастройкиКонвертацииПодчиненного, ДокументОсновной,, Истина);
			
			ДокументПодчиненныйОбъект.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДокументПодчиненный;
	
КонецФункции

Функция НастройкиСвязиДокументов(ТипДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСвязейДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиСвязейДокументов КАК КонтурЛогистика_НастройкиСвязейДокументов
	|ГДЕ
	|	КонтурЛогистика_НастройкиСвязейДокументов.ТипДокументаОсновной = &ТипДокумента
	|	И НЕ КонтурЛогистика_НастройкиСвязейДокументов.ПометкаУдаления
	|	И (КонтурЛогистика_НастройкиСвязейДокументов.ПоискПодчиненного
	|			ИЛИ КонтурЛогистика_НастройкиСвязейДокументов.ВводитьНаОсновании)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция НастройкиСвязиДокументовПодчиненных(ТипДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСвязейДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиСвязейДокументов КАК КонтурЛогистика_НастройкиСвязейДокументов
	|ГДЕ
	|	КонтурЛогистика_НастройкиСвязейДокументов.ТипДокументаПодчиненный = &ТипДокумента
	|	И НЕ КонтурЛогистика_НастройкиСвязейДокументов.ПометкаУдаления
	|	И (КонтурЛогистика_НастройкиСвязейДокументов.ПоискПодчиненного
	|			ИЛИ КонтурЛогистика_НастройкиСвязейДокументов.ВводитьНаОсновании)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция НужноСоздатьСвязь(ДокументОсновной, НастройкаСвязи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НастройкаСвязи.ПометкаУдаления Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ГлавныйДокумент = КонтурЛогистика_ОбработкаДокументовСервер.ОпределитьГлавныйДокументПоТитулу(ДокументОсновной);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГлавныйДокумент", ГлавныйДокумент);
	Запрос.УстановитьПараметр("ДокументОсновной", ДокументОсновной);
	Запрос.УстановитьПараметр("НастройкаСвязи", НастройкаСвязи);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыТитулов.Ссылка КАК Ссылка,
	|	КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус КАК Статус
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиСвязейДокументов.ОтборСтатусыТитулов КАК КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыТитулов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних(, Документ = &ДокументОсновной) КАК КонтурЛогистика_СтатусыТитуловСрезПоследних
	|		ПО КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыТитулов.Статус = КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус
	|ГДЕ
	|	КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыТитулов.Ссылка = &НастройкаСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыТитулов.НомерСтроки КАК КоличествоСтрок
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиСвязейДокументов.ОтборСтатусыТитулов КАК КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыТитулов
	|ГДЕ
	|	КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыТитулов.Ссылка = &НастройкаСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыДокументооборота.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние КАК Состояние
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиСвязейДокументов.ОтборСтатусыДокументооборота КАК КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыДокументооборота
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_ДвижениеДокументооборота.СрезПоследних(, Документ = &ГлавныйДокумент) КАК КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних
	|		ПО КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыДокументооборота.Статус = КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние
	|ГДЕ
	|	КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыДокументооборота.Ссылка = &НастройкаСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыДокументооборота.НомерСтроки КАК КоличествоСтрок
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиСвязейДокументов.ОтборСтатусыДокументооборота КАК КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыДокументооборота
	|ГДЕ
	|	КонтурЛогистика_НастройкиСвязейДокументовОтборСтатусыДокументооборота.Ссылка = &НастройкаСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСвязейДокументов.ОтборВыражениеВычисления КАК ОтборВыражениеВычисления
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиСвязейДокументов КАК КонтурЛогистика_НастройкиСвязейДокументов
	|ГДЕ
	|	КонтурЛогистика_НастройкиСвязейДокументов.Ссылка = &НастройкаСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСвязейДокументов.ОтборПутьККонтрагенту КАК ОтборПутьККонтрагенту,
	|	КонтурЛогистика_НастройкиСвязейДокументовОтборКонтрагенты.Контрагент КАК Контрагент
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиСвязейДокументов.ОтборКонтрагенты КАК КонтурЛогистика_НастройкиСвязейДокументовОтборКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_НастройкиСвязейДокументов КАК КонтурЛогистика_НастройкиСвязейДокументов
	|		ПО КонтурЛогистика_НастройкиСвязейДокументовОтборКонтрагенты.Ссылка = КонтурЛогистика_НастройкиСвязейДокументов.Ссылка
	|ГДЕ
	|	КонтурЛогистика_НастройкиСвязейДокументов.Ссылка = &НастройкаСвязи
	|	И КонтурЛогистика_НастройкиСвязейДокументов.ОтборПутьККонтрагенту <> """"
	|ИТОГИ ПО
	|	ОтборПутьККонтрагенту";
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Проверим статусы титулов
	Выборка = Результат[1].Выбрать();
	Если Выборка.Следующий() Тогда	// Иначе нет отбора по статусам
		
		ОтборСтатусТитулаПрошел = (Не Результат[0].Пустой());
		Если Не ОтборСтатусТитулаПрошел Тогда
			// Есть отбор по статусам, но ни один не верен
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверим статусы документооборота
	Выборка = Результат[3].Выбрать();
	Если Выборка.Следующий() Тогда	// Иначе нет отбора по статусам
		
		ОтборСтатусДокументооборотаПрошел = (Не Результат[2].Пустой());
		Если Не ОтборСтатусДокументооборотаПрошел Тогда
			// Есть отбор по статусам, но ни один не верен
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверим дополнительное условие
	Выборка = Результат[4].Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ОтборВыражениеВычисления) Тогда
		
		НужноСоздатьСвязь = РезультатВычисленияВыражения(ДокументОсновной, Выборка.ОтборВыражениеВычисления);
		Если Не НужноСоздатьСвязь Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверим контрагентов
	ВыборкаПоПути = Результат[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоПути.Следующий() Цикл
		
		ЗначениеКонтрагентаДокумента = Вычислить("ДокументОсновной." + ВыборкаПоПути.ОтборПутьККонтрагенту);
		
		Выборка = ВыборкаПоПути.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Контрагент = ЗначениеКонтрагентаДокумента Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Ложь;
		
	КонецЦикла;
	
	// Если не сработол ни один отбор, то создаем
	Возврат Истина;
	
КонецФункции

Функция ЕстьНастройкиПоискПодчиненного() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСвязейДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиСвязейДокументов КАК КонтурЛогистика_НастройкиСвязейДокументов
	|ГДЕ
	|	НЕ КонтурЛогистика_НастройкиСвязейДокументов.ПометкаУдаления
	|	И КонтурЛогистика_НастройкиСвязейДокументов.ПоискПодчиненного";
	
	Возврат (Не Запрос.Выполнить().Пустой());
	
КонецФункции

Функция ЕстьНастройкиВводитьНаОсновании() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСвязейДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиСвязейДокументов КАК КонтурЛогистика_НастройкиСвязейДокументов
	|ГДЕ
	|	НЕ КонтурЛогистика_НастройкиСвязейДокументов.ПометкаУдаления
	|	И КонтурЛогистика_НастройкиСвязейДокументов.ВводитьНаОсновании";
	
	Возврат (Не Запрос.Выполнить().Пустой());
	
КонецФункции

Функция СвязиДокументовПоТитулам() Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиСвязейДокументов.Ссылка КАК НастройкаСвязи,
	|	КонтурЛогистика_НастройкиСвязейДокументов.ТипДокументаОсновной КАК ТипДокументаОсновной,
	|	КонтурЛогистика_НастройкиСвязейДокументов.ТипДокументаПодчиненный КАК ТипДокументаПодчиненный
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиСвязейДокументов КАК КонтурЛогистика_НастройкиСвязейДокументов
	|ГДЕ
	|	НЕ КонтурЛогистика_НастройкиСвязейДокументов.ПометкаУдаления
	|	И (КонтурЛогистика_НастройкиСвязейДокументов.ВводитьНаОсновании
	|			ИЛИ КонтурЛогистика_НастройкиСвязейДокументов.ПоискПодчиненного)
	|ИТОГИ ПО
	|	ТипДокументаОсновной";
	
	ВыборкаПоТипу = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоТипу.Следующий() Цикл
		
		НаборНастроек = Новый Массив;
		
		Выборка = ВыборкаПоТипу.Выбрать();
		Пока Выборка.Следующий() Цикл
			ИмяТипаДокументаОсновной = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(
				Выборка.ТипДокументаОсновной);
			ИмяТипаДокументаПодчиненный = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(
				Выборка.ТипДокументаПодчиненный);
			
			ТекущаяНастройка = Новый Структура;
			ТекущаяНастройка.Вставить("ТипДокументаОсновной", Выборка.ТипДокументаОсновной);
			ТекущаяНастройка.Вставить("ТипДокументаПодчиненный", Выборка.ТипДокументаПодчиненный);
			ТекущаяНастройка.Вставить("ИмяТипаДокументаОсновной", ИмяТипаДокументаОсновной);
			ТекущаяНастройка.Вставить("ИмяТипаДокументаПодчиненный", ИмяТипаДокументаПодчиненный);
			ТекущаяНастройка.Вставить("Задач", 0);
			ТекущаяНастройка.Вставить("Ошибок", 0);
			ТекущаяНастройка.Вставить("Настроено", Истина);
			ТекущаяНастройка.Вставить("ОшибкаЗапроса", Ложь);
			
			НаборНастроек.Добавить(ТекущаяНастройка);
		КонецЦикла;
		
		Результат.Вставить(ВыборкаПоТипу.ТипДокументаОсновной, НаборНастроек);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатВычисленияВыражения(ДокументОсновной, ВыражениеВычисления, ТихийРежим = Истина)
	
	Перем ВычисленноеЗначение, РезультатВычисления;
	
	Попытка
		
		Параметры = Новый Структура;
		Параметры.Вставить("ДокументОсновной", ДокументОсновной);
		
		ВычисленноеЗначение = КонтурЛогистика_ОбщегоНазначенияСервер.ВычислитьЗначениеВБезопасномРежиме(
			ВыражениеВычисления, Параметры);
		
	Исключение
		
		// Для тестирования будем отображать ошибку
		Если Не ТихийРежим Тогда
			ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат ВычисленноеЗначение;
	
КонецФункции

Функция ВычислитьДокументОснование(ДокументОсновной, ДанныеНастройкиСвязи)
	
	ДокументОснование = Неопределено;
	
	ВыражениеВычисления = СокрЛП(ДанныеНастройкиСвязи.РасчетОснованияЗаполнения_ВыражениеВычисления);
	
	МаппингВычислитьВыражение = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение;
	Если ДанныеНастройкиСвязи.РасчетОснованияЗаполнения_СпособМаппинга = МаппингВычислитьВыражение Тогда
		
		Параметры = Новый Структура;
		Параметры.Вставить("ДокументОсновной", ДокументОсновной);
		Параметры.Вставить("ДанныеНастройкиСвязи", ДанныеНастройкиСвязи);
		
		ДокументОснование = КонтурЛогистика_ОбщегоНазначенияСервер.ВычислитьЗначениеВБезопасномРежиме(
			ВыражениеВычисления, Параметры);
		
	Иначе
		
		// Реквизиты могут быть составными через точку
		ТекущийРеквизит = ДокументОсновной;
		ЧастиВыраженияВычисления = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(ВыражениеВычисления, ".");
		
		Для Каждого РасчетныйРеквизит Из ЧастиВыраженияВычисления Цикл
			
			ИндексКвадратнойСкобкиОткрытия = Найти(РасчетныйРеквизит, "[");
			ИндексКвадратнойСкобкиЗакрытия = Найти(РасчетныйРеквизит, "]");
			Если ИндексКвадратнойСкобкиОткрытия = 0 Или ИндексКвадратнойСкобкиЗакрытия = 0 Тогда
				ТекущийРеквизит = ТекущийРеквизит[РасчетныйРеквизит];
			Иначе
				// Наличие конкретного элемента. Наример: ДокументыОснования[0]
				ИмяРеквизита = Лев(РасчетныйРеквизит, ИндексКвадратнойСкобкиОткрытия - 1);
				ИндексСтроки = Сред(РасчетныйРеквизит, ИндексКвадратнойСкобкиОткрытия + 1,
					СтрДлина(РасчетныйРеквизит) - ИндексКвадратнойСкобкиЗакрытия + 1);
				
				ТекущийРеквизит = ТекущийРеквизит[ИмяРеквизита][Число(ИндексСтроки)];
			КонецЕсли;
			
		КонецЦикла;
		
		ДокументОснование = ТекущийРеквизит;
		
	КонецЕсли;
	
	Возврат ДокументОснование;
	
КонецФункции

#КонецОбласти

#КонецЕсли