
#Область ПрограммныйИнтерфейс

#Область РазрешительныйРежимРозничныхПродаж

// Получить сокращенную информацию по КМ с крипточастью.
// 
// Параметры:
//  ДанныеПроверкиКМ - Массив Из СтрокаТабличнойЧасти: см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки - Коллекция строк таблицы
//  Организация - ОпределяемыйТип.Организация - Организация
//  ИдентификаторФискальногоНакопителя - Строка - идентификатор фискального накопителя
//  ЭтоОперацияПробития - Булево - флаг устанавливается, если процедура вызывается длительной операцией при пробитии
// 
// Возвращаемое значение:
//  Структура - Получить информацию по КМ от ККТ:
//  * АварийныйРежим - Булево - Истина, если действует аварийный режим или в ходе проверки он был объявлен
//  * ТребуетсяОбновлениеКлючаСессии - Булево - признак необходимости обновления ключа сессии
//  * ТребуетсяОбновлениеCDNПлощадок - Булево - признак необходимости обновления списка CDN-площадок
//  * ОтсутствуютCDNПлощадки - Булево - возвращает признак отсутствия CDN площадок, запросы не были отправлены
//  * РезультатыОтправкиЗапросов - Массив из см. ИнтерфейсМОТПСлужебный.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON
//  * СтатусыКодовМаркировкиГИСМТ - Соответствие Из КлючИЗначение - Статусы кодов маркировки:
//		** Ключ - СтрокаТабличнойЧасти: см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки - Код маркировки.
//		** Значение - см. ПараметрыКодаМаркировкиМОТП
//  * КодыМаркировкиБезДанныхГИСМТ - Соответствие Из КлючИЗначение - Статусы кодов маркировки:
//		** Ключ - СтрокаТабличнойЧасти: см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки - Код маркировки.
//		** Значение - Булево - Истина, если можно продавать товар в отсутствие ответа ГИС МТ - например, истек таймер на ожидание ответа,
//			или получены ошибки 500 по молочной продукции из Беларуси
//			Если от ГИС МТ был получен ответ - он пишется в СтатусыКодовМаркировкиГИСМТ, и опираться следует на полученные от него данные
//  * ТекстОшибки - Строка - текст ошибки, полученной от ГИС МТ
// 		Общий текст ошибки, ошибки запросов по всем кодам
Функция СокращеннаяИнформацияПоКМПриРозничнойПродаже(ДанныеПроверкиКМ, Организация, ИдентификаторФискальногоНакопителя, ЭтоОперацияПробития = Ложь) Экспорт
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессииИСМПРозница(Организация));
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                  Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии",  КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеCDNПлощадок",  Ложь);
	ВозвращаемоеЗначение.Вставить("ОтсутствуютCDNПлощадки",          Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатыОтправкиЗапросов",      Новый Массив);
	ВозвращаемоеЗначение.Вставить("СтатусыКодовМаркировкиГИСМТ",     Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("КодыМаркировкиБезДанныхГИСМТ",    Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                     "");
	
	МассивКМ                  = Новый Массив;
	СоответствиеПолногоКодаКМ = Новый Соответствие();
	МассивПлощадокКБлокировке = Новый Массив;
	
	Для Каждого СтрокаДанныхПроверкиКМ Из ДанныеПроверкиКМ Цикл
		
		ПолныйКодКМ = СтрокаДанныхПроверкиКМ.ПолныйКодМаркировки;
		
		Если Не ЗначениеЗаполнено(ПолныйКодКМ) Тогда
			Продолжить;
		КонецЕсли;
		
		КодМаркировкиНаПроверку = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.Base64ВШтрихкод(ПолныйКодКМ);
		МассивКМ.Добавить(КодМаркировкиНаПроверку);
		
		СоответствиеПолногоКодаКМ.Вставить(КодМаркировкиНаПроверку, СтрокаДанныхПроверкиКМ);
		
	КонецЦикла;
	
	Если МассивКМ.Количество() = 0 Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ВозвращаемоеЗначение.АварийныйРежим = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ДействуетАварийныйРежимДляРозничныхПродаж();
	
	Если ВозвращаемоеЗначение.АварийныйРежим Тогда
		
		// на срок действия аварийного режима разрешена продажа без разрешительного режима
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	НастройкиСканирования = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.НастройкиСканированияКодовМаркировки();
	РежимыКонтроля        = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.РежимыКонтроляСредствамиККТ();
	
	ЛогироватьУспешныеПроверки = (НастройкиСканирования.РежимКонтроляСредствамиККТ = РежимыКонтроля.ПередПробитиемЧека)
		И ОбщегоНазначенияИСМППовтИсп.ХранитьУспешныеОперацииПриПроверкеКМ()
		И Не ЭтоОперацияПробития;
	
	СтруктураДополнительныхПараметров = Новый Структура();
	СтруктураДополнительныхПараметров.Вставить("Организация",                Организация);
	СтруктураДополнительныхПараметров.Вставить("ИННОрганизации",             "");
	СтруктураДополнительныхПараметров.Вставить("НомерФН",                    ИдентификаторФискальногоНакопителя);
	СтруктураДополнительныхПараметров.Вставить("КешОрганизаций",             Новый Соответствие());
	СтруктураДополнительныхПараметров.Вставить("ЛогироватьУспешныеПроверки", ЛогироватьУспешныеПроверки);
	
	СтруктураДополнительныхПараметров.ИННОрганизации = РаботаСКонтрагентамиИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(Организация).ИНН;
	СтруктураДополнительныхПараметров.КешОрганизаций.Вставить(Организация, СтруктураДополнительныхПараметров.ИННОрганизации);
	
	ДанныеCDNПлощадок = ОбщегоНазначенияИСМП.СортированнаяТаблицаCDNПлощадок();
	ВозвращаемоеЗначение.ТребуетсяОбновлениеCDNПлощадок = ДанныеCDNПлощадок.ТребуетсяОбновлениеПлощадок;
	
	Если ДанныеCDNПлощадок.ТаблицаПлощадок.Количество() = 0 Тогда
		
		// если список площадок отсутствует вовсе - вернуть ошибку
		ВозвращаемоеЗначение.ОтсутствуютCDNПлощадки = Истина;
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	КешСоединений = Новый Соответствие();
	
	Для Каждого КодМаркировки Из МассивКМ Цикл
		
		ДанныеШтрихкода = СоответствиеПолногоКодаКМ.Получить(КодМаркировки);
		
		РезультатОбработкиКМ = ОбработатьКодМаркировкиНаCDNПлощадках(КодМаркировки,
			ДанныеШтрихкода,
			ДанныеCDNПлощадок.ТаблицаПлощадок,
			КлючСессии,
			МассивПлощадокКБлокировке,
			СтруктураДополнительныхПараметров,
			КешСоединений);
		
		ВозвращаемоеЗначение.АварийныйРежим                 = РезультатОбработкиКМ.АварийныйРежим;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатОбработкиКМ.ТребуетсяОбновлениеКлючаСессии;
		
		Для Каждого РезультатОтправкиЗапросаНаПлощадку Из РезультатОбработкиКМ.РезультатыОтправкиЗапросов Цикл
			ВозвращаемоеЗначение.РезультатыОтправкиЗапросов.Добавить(РезультатОтправкиЗапросаНаПлощадку);
		КонецЦикла;
		
		ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки
			+ ?(ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки), Символы.ПС, "")
			+ РезультатОбработкиКМ.ТекстОшибки;
		
		Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
			
			// если была получена ошибка 401 хотя бы по одному КМ - прервать обработку,
			// необходимо обновление ключа сессии
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
		Если ВозвращаемоеЗначение.АварийныйРежим Тогда
			
			// если был получен код 203 хотя бы по одному КМ - прервать обработку,
			// действует аварийный режим
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
		Если Не РезультатОбработкиКМ.ПараметрыКодаМаркировки = Неопределено Тогда
			
			// по КМ был получен ответ из ГИС МТ
			ВозвращаемоеЗначение.СтатусыКодовМаркировкиГИСМТ.Вставить(ДанныеШтрихкода, РезультатОбработкиКМ.ПараметрыКодаМаркировки);
			
		КонецЕсли;
		
		Если РезультатОбработкиКМ.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ Тогда
			
			// продажа разрешена по таймауту или как молочка из Беларуси
			ВозвращаемоеЗначение.КодыМаркировкиБезДанныхГИСМТ.Вставить(ДанныеШтрихкода, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивПлощадокКБлокировке.Количество() > 0 Тогда
		
		ОбщегоНазначенияИСМП.ЗаблокироватьСписокПлощадок(МассивПлощадокКБлокировке);
		
		// все блокировки перенесены в регистр, надо убрать заблокированные площадки из массива Параметра сеанса
		ПлощадкиСОшибкамиОбмена       = ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП.Получить();
		
		Для Каждого ПлощадкаСОшибками Из ПлощадкиСОшибкамиОбмена.ОшибкиПлощадки Цикл
			
			Если МассивПлощадокКБлокировке.Найти(ПлощадкаСОшибками.Ключ) <> Неопределено Тогда
				ПлощадкиСОшибкамиОбмена.ОшибкиПлощадки.Удалить(ПлощадкаСОшибками.Ключ);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ПлощадкаСТаймаутами Из ПлощадкиСОшибкамиОбмена.НетОтветаПоПлощадке Цикл
			
			Если МассивПлощадокКБлокировке.Найти(ПлощадкаСТаймаутами.Ключ) <> Неопределено Тогда
				ПлощадкиСОшибкамиОбмена.НетОтветаПоПлощадке.Удалить(ПлощадкаСТаймаутами.Ключ);
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП = Новый ХранилищеЗначения(ПлощадкиСОшибкамиОбмена);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;

КонецФункции

// Актуализация списка CDN-площадок для обращения в ГИС МТ методом розничной продажи.
//  При своевременной актуализации списка гарантируется максимально быстрое получение идентификаторов
//  разрешительного режима для ускорения розничной продажи.
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация - Организация
// 
// Возвращаемое значение:
//  Структура - результат обновления площадок:
// * ТребуетсяОбновлениеКлючаСессииРозница - Булево - признак необходимости обновления ключа сессии
// * РезультатОтправкиЗапроса - (См. ОбщегоНазначенияИСМП.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON).
// * СписокПлощадок - Соответствие Из КлючИЗначение - полученные CDN-площадки:
//		** Ключ - Строка - Адрес площадки.
//		** Значение - (см. ЗамерыСкоростиCDNПлощадок)
// * ТекстОшибки - Строка - текст ошибки, полученной от ГИС МТ
Функция АктуализацияСпискаCDNПлощадок(Организация) Экспорт
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессииИСМПРозница(Организация));
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",              Неопределено);
	ВозвращаемоеЗначение.Вставить("СписокПлощадок",                        Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           "");
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("X-API-KEY",      КлючСессии);
	
	URLЗапроса = "api/v4/true-api/cdn/info";
	
	ПараметрыЗапросов         = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыОтправкиHTTPЗапросов(, Истина, Истина);
	
	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(
		URLЗапроса,
		,
		КлючСессии,
		"GET",
		ПараметрыЗапросов,
		ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	КоличествоЗапросовПоОднойПлощадкеДляУсредненияРезультата = 3;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, Истина);
			КодОтвета       = ДанныеОбработки.Получить("code") <> 0;
			
			Если КодОтвета <> 0 Тогда
				
				ШаблонОтвета = НСтр("ru = 'Получен неверный запрос. Код ответа - %1: %2'");
				ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(ШаблонОтвета, КодОтвета, ДанныеОбработки.Получить("description"));
				
				Возврат ВозвращаемоеЗначение;
				
			КонецЕсли;
			
			СписокПлощадок = ДанныеОбработки.Получить("hosts");
			
			ЗаголовокHTTP.Вставить("Connection", "close");
			
			Для Каждого Площадка Из СписокПлощадок Цикл
				
				АдресПлощадки = Площадка.Получить("host");
				URLЗапроса    = "api/v4/true-api/cdn/health/check";
				
				СтруктураАдреса = РегистрыСведений.СостоянияCDNПлощадокИСМП.РазобратьАдресПлощадкиНаСерверИПорт(АдресПлощадки);
				
				ПараметрыЗапросов = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыОтправкиHTTPЗапросов(, Истина);
				ПараметрыЗапросов.Сервер                           = СтруктураАдреса.Сервер;
				ПараметрыЗапросов.Порт                             = СтруктураАдреса.Порт;
				ПараметрыЗапросов.ИспользоватьЗащищенноеСоединение = СтруктураАдреса.ЗащищенноеСоединение;
				
				ЗамерыПоПлощадке               = Новый Массив();
				
				Для Индекс = 1 По КоличествоЗапросовПоОднойПлощадкеДляУсредненияРезультата Цикл
					
					НачалоЗамеровУниверсальнаяДата = ТекущаяУниверсальнаяДатаВМиллисекундах();
					
					РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(
						URLЗапроса,
						,
						КлючСессии,
						"GET",
						ПараметрыЗапросов,
						ЗаголовокHTTP);
					
					РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
					
					Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
						
						Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
							
							ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, Истина);
							СреднееВремяОбработкиКМ = 0;
							
							Если ДанныеОбработки.Получить("avgTimeMs") <> Неопределено Тогда
								СреднееВремяОбработкиКМ = ДанныеОбработки.Получить("avgTimeMs");
							КонецЕсли;
							
							ЗамерПоПлощадке = Новый Структура("НачалоЗамера, КонецЗамера, СреднееВремяОбработкиКМ",
								НачалоЗамеровУниверсальнаяДата,
								ТекущаяУниверсальнаяДатаВМиллисекундах(),
								СреднееВремяОбработкиКМ);
								
							ЗамерыПоПлощадке.Добавить(ЗамерПоПлощадке);
							
						Иначе
							
							Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
								
								ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = Истина;
								Возврат ВозвращаемоеЗначение;
								
							КонецЕсли;
							
							ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
								АдресПлощадки + "/" + URLЗапроса,
								РезультатОтправкиЗапроса);
							// вернулась ошибка в ответе по площадке
							// такую площадку записываем как временно не отвечающую, переходим к следующей
							Прервать;
							
						КонецЕсли;
						
					Иначе
						
						ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки
							+ ?(ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки), Символы.ПС + Символы.ПС, "")
							+ ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
								АдресПлощадки + "/" + URLЗапроса,
								РезультатОтправкиЗапроса);
						// не получен ответ от площадки
						// такую площадку записываем как временно не отвечающую, переходим к следующей
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				ОбщееВремяПроверкиКМ = 0;
				ОбщееВремяОтвета     = 0;
				
				Для Каждого ЗамерВремени Из ЗамерыПоПлощадке Цикл
					
					ОбщееВремяПроверкиКМ = ОбщееВремяПроверкиКМ + ЗамерВремени.СреднееВремяОбработкиКМ;
					ОбщееВремяОтвета     = ОбщееВремяОтвета + (ЗамерВремени.КонецЗамера - ЗамерВремени.НачалоЗамера);
					
				КонецЦикла;
				
				СтруктураЗамеров = ЗамерыСкоростиCDNПлощадок();
				
				Если ЗамерыПоПлощадке.Количество() = 0 Тогда
					
					// ответа от площадок не получено, площадка получает минимальный рейтинг в списке
					СтруктураЗамеров.СреднееВремяПроверкиКМ = -1;
					СтруктураЗамеров.СреднееВремяОтвета     = -1;
					
				Иначе
					
					СтруктураЗамеров.СреднееВремяПроверкиКМ = ОбщееВремяПроверкиКМ / КоличествоЗапросовПоОднойПлощадкеДляУсредненияРезультата;
					СтруктураЗамеров.СреднееВремяОтвета     = ОбщееВремяОтвета / КоличествоЗапросовПоОднойПлощадкеДляУсредненияРезультата;
					
				КонецЕсли;
				
				ВозвращаемоеЗначение.СписокПлощадок.Вставить(АдресПлощадки, СтруктураЗамеров);
				
			КонецЦикла;
			
		Иначе
			
			Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
				
				ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = Истина;
				
			КонецЕсли;
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
			
			ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = Истина;
			
		КонецЕсли;
		
		// не получен список площадок, таймаут или иные проблемы
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

// Получить данные продукции по штрихкоду EAN.
// 
// Параметры:
// 	Значение - Массив Из Строка, Строка - GTIN для которых необходимо получить представление и прочие данные.
// 	Организация   - ОпределяемыйТип.Организация - Организация.
// Возвращаемое значение:
// 	Структура - Описание:
// 	* ТребуетсяОбновлениеКлючаСессии - Булево - Признак необходимости обновления ключа сессии.
// 	* РезультатОтправкиЗапроса - Неопределено,
// 	                             См. ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON() - результат отправки запроса.
// 	* ДанныеПродукцииПоШтрихкодуEAN - Неопределено - Если при получении данных возникла ошибка.
// 	                                - Соответствие Из КлючИЗначение - Соответствие штрихкода EAN и данных продукции из сервиса ИС МОТП:
// 	 ** Ключ     - Строка - Штрихкод EAN.
// 	 ** Значение - см. ИнтерфейсИСМПОбщегоНазначения.ИнициализироватьДанныеПродукции
// 	* ТекстОшибки - Строка - Текст ошибки.
//  * СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийИСМП
Функция ДанныеПродукцииПоШтрихкодуEAN(Значение, Организация = Неопределено) Экспорт
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("ДанныеПродукцииПоШтрихкодуEAN",  Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Перечисления.СтатусыОбработкиСообщенийИСМП.ПустаяСсылка());
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ТелоЗапроса             = Новый Структура("gtins", Новый Массив);
	ИсходныеЗначенияЗапроса = Новый Соответствие;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		
		GTIN = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.GTINПоШтрихкодуEAN(Значение);
		ИсходныеЗначенияЗапроса.Вставить(GTIN, Значение);
		
		ТелоЗапроса.gtins.Добавить(GTIN);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Для Каждого ШтрихкодEAN Из Значение Цикл
			GTIN = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.GTINПоШтрихкодуEAN(ШтрихкодEAN);
			ИсходныеЗначенияЗапроса.Вставить(GTIN, ШтрихкодEAN);
			ТелоЗапроса.gtins.Добавить(GTIN);
		КонецЦикла;
		
	Иначе
		ВызватьИсключение НСтр("ru = 'Внутренняя ошибка'");
	КонецЕсли;
	
	ПараметрыОтправкиHTTPЗапросов = ОбщегоНазначенияИСМПКлиентСервер.ПараметрыОтправкиHTTPЗапросов("", Истина);
	
	URLЗапроса = "api/v4/true-api/product/info";
	
	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(
		URLЗапроса, ТелоЗапроса, КлючСессии,
		"POST", ПараметрыОтправкиHTTPЗапросов);
		
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ДанныеПродукцииПоШтрихкодуEAN = Новый Соответствие;
				
				Для Каждого ЭлементДанных Из ДанныеОбработки.results Цикл
					
					ДанныеПродукции = ИнициализироватьДанныеПродукции(ЭлементДанных);
					
					КлючРезультата = ИсходныеЗначенияЗапроса.Получить(ДанныеПродукции.GTIN);
					Если КлючРезультата = Неопределено Тогда
						КлючРезультата = РазборКодаМаркировкиИССлужебныйКлиентСервер.ШтрихкодEANИзGTIN(ДанныеПродукции.GTIN)
					КонецЕсли;
					
					ДанныеПродукцииПоШтрихкодуEAN.Вставить(КлючРезультата, ДанныеПродукции);
					
				КонецЦикла;
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
			Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
				ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			КонецЕсли;
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
			
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
	ИначеЕсли РезультатОтправкиЗапроса.КодСостояния <> 404 Тогда
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение.ДанныеПродукцииПоШтрихкодуEAN = ДанныеПродукцииПоШтрихкодуEAN;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Получить места осуществления деятельности.
// 
// Параметры:
// 	Организация   - ОпределяемыйТип.Организация - Организация.
// 	ВидПродукции  - СправочникСсылка.ВидыПродукцииИС - Вид продукции.
// Возвращаемое значение:
// 	Структура - Описание:
// 	* ТребуетсяОбновлениеКлючаСессии - Булево - Признак необходимости обновления ключа сессии.
// 	* РезультатОтправкиЗапроса - см. ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON
// 	* МестаОсуществленияДеятельности - Неопределено - Если при получении данных возникла ошибка.
// 	                                - Соответствие Из КлючИЗначение:
// 	 ** Ключ     - Строка - КодФИАС
// 	 ** Значение - Строка - Код ФИАС
// 	* ТекстОшибки - Строка - Текст ошибки.
Функция МестаОсуществленияДеятельности(Организация, ВидПродукции) Экспорт
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("МестаОсуществленияДеятельности", Новый Массив());
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ТелоЗапроса                   = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов = ОбщегоНазначенияИСМПКлиентСервер.ПараметрыОтправкиHTTPЗапросов("", Истина);
	
	ТелоЗапроса.Вставить("pg", Новый Массив());
	ТелоЗапроса.pg.Добавить(ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппа(ВидПродукции));
	
	URLЗапроса = "api/v3/true-api/mods/info";
	
	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(
		URLЗапроса, ТелоЗапроса, КлючСессии,
		"POST", ПараметрыОтправкиHTTPЗапросов);
		
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				Для Каждого ЭлементДанных Из ДанныеОбработки.mods Цикл
					
					Если ЭлементДанных.isBlocked Тогда
						Продолжить;
					КонецЕсли;
					
					КодФИАС = Неопределено;
					ЭлементДанных.Свойство("fiasId", КодФИАС);
					
					Если ЗначениеЗаполнено(КодФИАС) Тогда
						
						СтрокаРезультат = Новый Структура();
						СтрокаРезультат.Вставить("КодФИАС", КодФИАС);
						
						ВозвращаемоеЗначение.МестаОсуществленияДеятельности.Добавить(СтрокаРезультат);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
			Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
				ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
	ИначеЕсли РезультатОтправкиЗапроса.КодСостояния <> 404 Тогда
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Метод предназначен для получения статуса блокировки участника оборота товаров, его мест
// осуществления деятельности (МОД) и данных по блокировке в ЕГАИС.
// 
// Параметры:
// 	Организация   - ОпределяемыйТип.Организация - Организация
// 	ПараметрыОтбора - Структура из КлючИЗначение:
// 		* ИННУчастника    - Массив Из Строка, Строка    - необязательный отбор по ИНН участника оборота
// 		* КППУчастника    - Строка                      - необязательный отбор по КПП участника оборота
// 		* КодФИАС         - Строка                      - необязательный отбор по коду ФИАС конкретного проверяемого МОДа
// 		* ВидыПродукции   - Массив из СправочникСсылка.ВидыПродукцииИС
// 		* ПолныйСписокМОД - Булево                      - Истина, возвращается полный список МОД, полученный из сервиса. 
// 			Ложь, будет возвращен список МОД, которые доступны только всем товарным группам указанным в ВидыПродукции
// Возвращаемое значение:
// 	Структура:
// 	* ТребуетсяОбновлениеКлючаСессии - Булево - Признак необходимости обновления ключа сессии.
// 	* РезультатОтправкиЗапроса - Неопределено,
// 	                             См. ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON() - результат.
// 	* МестаОсуществленияДеятельности - Неопределено - Если при получении данных возникла ошибка.
// 	                                 - Массив Из Структура: 
// 	 ** КодФИАС     - Строка - КодФИАС.
// 	 ** Адрес       - Строка - представление адреса
// 	 ** ПредставлениеВидыПродукции - Строка - представление строкой списка ТГ МОДа
// 	* ТекстОшибки - Строка - Текст ошибки.
Функция СписокМестОсуществленияДеятельности(Организация, ПараметрыОтбора = Неопределено) Экспорт
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("МестаОсуществленияДеятельности", Новый Массив());
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ПараметрыЗапроса        = Новый Массив();
	МассивИдентификаторовТГ = Новый Массив;
	ДоступныеУказаннымТГ    = Истина;
	
	Если ПараметрыОтбора <> Неопределено Тогда
		
		Если ПараметрыОтбора.Свойство("ИННУчастника") Тогда
			Если ТипЗнч(ПараметрыОтбора.ИННУчастника) = Тип("Массив") Тогда
				Для каждого СтрокаИНН Из ПараметрыОтбора.ИННУчастника Цикл
					ПараметрыЗапроса.Добавить(СтрШаблон("inns=%1", СтрокаИНН));
				КонецЦикла;
			Иначе
				Если ЗначениеЗаполнено(ПараметрыОтбора.ИННУчастника) Тогда
					ПараметрыЗапроса.Добавить(СтрШаблон("inns=%1", ПараметрыОтбора.ИННУчастника));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("КППУчастника") И ЗначениеЗаполнено(ПараметрыОтбора.КППУчастника) Тогда
			ПараметрыЗапроса.Добавить(СтрШаблон("kpp=%1", ПараметрыОтбора.КППУчастника));
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("КодФИАС") И ЗначениеЗаполнено(ПараметрыОтбора.КодФИАС) Тогда
			ПараметрыЗапроса.Добавить(СтрШаблон("fiasId=%1", ПараметрыОтбора.КодФИАС));
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("ВидыПродукции") И ТипЗнч(ПараметрыОтбора.ВидыПродукции) = Тип("Массив") И ПараметрыОтбора.ВидыПродукции.Количество() Тогда
			
			Для Каждого ВидПродукцииОтбора Из ПараметрыОтбора.ВидыПродукции Цикл
				
				ИдентификаторТГ = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппа(ВидПродукцииОтбора);
				Если МассивИдентификаторовТГ.Найти(ИдентификаторТГ) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				МассивИдентификаторовТГ.Добавить(ИдентификаторТГ);
				
			КонецЦикла;
			
			Для Каждого ИдентификаторТГ Из МассивИдентификаторовТГ Цикл
				ПараметрыЗапроса.Добавить(СтрШаблон("productGroups=%1", ИдентификаторТГ));
			КонецЦикла;
			
		ИначеЕсли ПараметрыОтбора.Свойство("ТоварнаяГруппа") И ЗначениеЗаполнено(ПараметрыОтбора.ТоварнаяГруппа) Тогда
			ИдентификаторТГ = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппа(ПараметрыОтбора.ТоварнаяГруппа);
			ПараметрыЗапроса.Добавить(СтрШаблон("productGroups=%1", ИдентификаторТГ));
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("ПолныйСписокМОД") Тогда
			ДоступныеУказаннымТГ = Не ПараметрыОтбора.ПолныйСписокМОД;
		КонецЕсли;
		
	КонецЕсли;
	
	URLЗапроса = СтрШаблон("api/v3/true-api/mods/list%1",
		ПараметрыЗапроса(ПараметрыЗапроса));
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(
		URLЗапроса,
		КлючСессии,
		ОбщегоНазначенияИСМПКлиентСервер.ПараметрыОтправкиHTTPЗапросов("", Истина));
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, Истина);
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				СписокМестОсуществленияДеятельности = ДанныеОбработки.Получить("result");
				Если СписокМестОсуществленияДеятельности <> Неопределено Тогда
					
					Для Каждого ЭлементДанных Из СписокМестОсуществленияДеятельности Цикл
						
						Если ЭлементДанных.Получить("isBlockedEgais") = Истина Тогда
							Продолжить;
						КонецЕсли;
						
						Если ЗначениеЗаполнено(ЭлементДанных.Получить("fiasId")) Или ЗначениеЗаполнено(ЭлементДанных.Получить("address")) Тогда
							
							МассивВидовПродукции = Новый Массив;
							ВидыПродукцииМОД     = ЭлементДанных.Получить("productGroups");
							
							Если ВидыПродукцииМОД <> Неопределено Тогда
								
								Для Каждого ПредставлениеВидаПродукцииГИСМТ Из ВидыПродукцииМОД Цикл
									
									ВидПродукции = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппа(ПредставлениеВидаПродукцииГИСМТ);
									Если МассивВидовПродукции.Найти(ВидПродукции) <> Неопределено Тогда
										Продолжить;
									КонецЕсли;
									МассивВидовПродукции.Добавить(ВидПродукции);
									
								КонецЦикла;
								
								Если МассивИдентификаторовТГ.Количество() И ДоступныеУказаннымТГ Тогда
									
									Если ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивИдентификаторовТГ, ВидыПродукцииМОД).Количество() > 0 Тогда
										// отбор по нескольким видам продукций, но данный МОД поддерживает не все из них
										Продолжить;
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;
							
							СтрокаРезультат = Новый Структура();
							СтрокаРезультат.Вставить("КодФИАС",                    ЭлементДанных.Получить("fiasId"));
							СтрокаРезультат.Вставить("Адрес",                      ЭлементДанных.Получить("address"));
							СтрокаРезультат.Вставить("ПредставлениеВидыПродукции", СтрСоединить(МассивВидовПродукции, ", "));
							СтрокаРезультат.Вставить("ИНН",                        ЭлементДанных.Получить("inn"));
							СтрокаРезультат.Вставить("КПП",                        ЭлементДанных.Получить("kpp"));
							СтрокаРезультат.Вставить("ТоварныеГруппы",             ВидыПродукцииМОД);
							
							ВозвращаемоеЗначение.МестаОсуществленияДеятельности.Добавить(СтрокаРезультат);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
			Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
				ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
	ИначеЕсли РезультатОтправкиЗапроса.КодСостояния <> 404 Тогда
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает массив ключей данных кода маркировки для вычисления хеша кэша.
// Исключаемые ключи: cis, requestedCis, sgtin.
// 
// Возвращаемое значение:
//  Массив Из Строка - ключи в фиксированном порядке.
//
Функция КлючиХешаПараметровКодаМаркировкиМОТП() Экспорт
	
	Ключи = Новый Массив;
	Ключи.Добавить("tnVedEaes");
	Ключи.Добавить("tnVedEaesGroup");
	Ключи.Добавить("batchNumber");
	Ключи.Добавить("partyNumber");
	Ключи.Добавить("productGroup");
	Ключи.Добавить("groupIds");
	Ключи.Добавить("status");
	Ключи.Добавить("statusEx");
	Ключи.Добавить("valid");
	Ключи.Добавить("found");
	Ключи.Добавить("verified");
	Ключи.Добавить("utilised");
	Ключи.Добавить("realizable");
	Ключи.Добавить("sold");
	Ключи.Добавить("packageType");
	Ключи.Добавить("generalPackageType");
	Ключи.Добавить("ownerInn");
	Ключи.Добавить("isOwner");
	Ключи.Добавить("isTracking");
	Ключи.Добавить("gtin");
	Ключи.Добавить("lastDocId");
	Ключи.Добавить("producerInn");
	Ключи.Добавить("productName");
	Ключи.Добавить("producerName");
	Ключи.Добавить("prVetDocument");
	Ключи.Добавить("grayZone");
	Ключи.Добавить("innerUnitCount");
	Ключи.Добавить("maxRetailPrice");
	Ключи.Добавить("mrp");
	Ключи.Добавить("expirationDate");
	Ключи.Добавить("expireDate");
	Ключи.Добавить("emissionDate");
	Ключи.Добавить("emissionType");
	Ключи.Добавить("producedDate");
	Ключи.Добавить("productionDate");
	Ключи.Добавить("introducedDate");
	Ключи.Добавить("applicationDate");
	Ключи.Добавить("connectDate");
	Ключи.Добавить("partialSaleInfo");
	Ключи.Добавить("parent");
	Ключи.Добавить("isBlocked");
	Ключи.Добавить("ogvs");
	Ключи.Добавить("certDoc");
	Ключи.Добавить("certDocRequirementDetails");
	//Ключи.Добавить("child");
	
	Возврат Ключи;
	
КонецФункции

// Возвращает параметры кода маркировки из данных ГИС МТ.
// Выполняет разбор кода маркировки и заполнение параметров, используя кеш для оптимизации
// повторного разбора одинаковых кодов.
//
// Параметры:
// 	ЭлементДанных - Соответствие, КлючИЗначение, Структура, Неопределено - Данные ГИС МТ.
// 	ВидПродукции  - СправочникСсылка.ВидыПродукцииИС, Неопределено - Вид продукции.
// 	ДополнительныеПараметры - Структура - Дополнительные параметры:
// 		* НастройкиРазбора - см. РазборКодаМаркировкиИССлужебный.НастройкиРазбораКодаМаркировки.
// 		* Организация - ОпределяемыйТип.Организация.
// 		* КешОрганизаций - Соответствие из КлючИЗначение - Кеш для получения ИНН организаций-владельцев кода.
// 	Эталон - Структура, Неопределено - Кэш данных кода маркировки для оптимизации повторного разбора:
// 		* Источник - Соответствие, Структура - Исходные данные кода маркировки.
// 		* Результат - см. ИнициализироватьПараметрыКодаМаркировкиМОТП - Результат предыдущего разбора.
// 		* КлючиСравнения - Массив из Строка - Ключи для сравнения данных (см. КлючиХешаПараметровКодаМаркировкиМОТП).
//
// Возвращаемое значение:
// 	Структура - см. ИнициализироватьПараметрыКодаМаркировкиМОТП.
Функция ПараметрыКодаМаркировкиМОТП(ЭлементДанных = Неопределено, ВидПродукции = Неопределено, ДополнительныеПараметры = Неопределено, Эталон = Неопределено) Экспорт
	
	ТипЭлементаДанных = ТипЗнч(ЭлементДанных);
	Если ТипЭлементаДанных = Тип("Соответствие") Тогда
		ИсточникДанных = ЭлементДанных;
	ИначеЕсли ТипЭлементаДанных = Тип("КлючИЗначение") Тогда
		ИсточникДанных = ЭлементДанных.Значение;
	ИначеЕсли ТипЭлементаДанных = Тип("Структура") Тогда
		ИсточникДанных = Новый Соответствие();
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ИсточникДанных, ЭлементДанных);
	КонецЕсли;
	
	Если ИсточникДанных <> Неопределено Тогда
		ВложенныеЭлементы = ИсточникДанных["child"];
	КонецЕсли;
	
	Если Эталон <> Неопределено
		И Эталон.Результат <> Неопределено
		И ВложенныеЭлементы <> Неопределено
		И ВложенныеЭлементы.Количество() = 0 Тогда
		
		Если Эталон.Свойство("КлючиСравнения")
			И Эталон.КлючиСравнения <> Неопределено Тогда
			КлючиСравнения = Эталон.КлючиСравнения;
		Иначе
			КлючиСравнения = КлючиХешаПараметровКодаМаркировкиМОТП();
		КонецЕсли;
		
		Если ДанныеКодаМаркировкиСовпадают(ИсточникДанных, Эталон.Источник, КлючиСравнения) Тогда
			ПараметрыКодаМаркировки = ИнициализироватьПараметрыКодаМаркировкиМОТП();
			ЗаполнитьЗначенияСвойств(ПараметрыКодаМаркировки, Эталон.Результат);
			Возврат ПараметрыКодаМаркировки;
		Иначе
			Эталон = Неопределено; // Свойства некоторых элементов отличаются, нет смысла копировать эталон
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыКодаМаркировки = ИнициализироватьПараметрыКодаМаркировкиМОТП();
	
	Если ЭлементДанных = Неопределено Тогда
		Возврат ПараметрыКодаМаркировки;
	КонецЕсли;
	
	ПараметрыКодаМаркировки.КодТНВЭД    = ИсточникДанных["tnVedEaes"];
	ПараметрыКодаМаркировки.ГруппаТНВЭД = ИсточникДанных["tnVedEaesGroup"];
	
	ДанныеДляУточнения = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ДанныеДляУточненияТоварнойГруппы();
	ДанныеДляУточнения.ВидПродукции = ВидПродукции;
	ДанныеДляУточнения.ТНВЭД        = ПараметрыКодаМаркировки.КодТНВЭД;
	ДанныеДляУточнения.ГруппаТНВЭД  = ПараметрыКодаМаркировки.ГруппаТНВЭД;
	
	Значение = ИсточникДанных["batchNumber"];
	Если ЗначениеЗаполнено(Значение) Тогда
		ПараметрыКодаМаркировки.НомерПартии = Значение;
	Иначе
		ПараметрыКодаМаркировки.НомерПартии = ИсточникДанных["partyNumber"];
	КонецЕсли;
	
	Значение = ИсточникДанных["productGroup"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ИмяТоварнойГруппы = Значение;
		ПараметрыКодаМаркировки.ВидПродукции = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ТоварнаяГруппа(Значение, ДанныеДляУточнения);
	Иначе
		
		Значение = ИсточникДанных["groupIds"];
		
		Если Значение <> Неопределено И Значение.Количество() Тогда
			ПараметрыКодаМаркировки.ВидПродукции = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаЧислом(
				Значение[0], ДанныеДляУточнения);
			ПараметрыКодаМаркировки.ИмяТоварнойГруппы = КонструкторИСМПОбщегоНазначенияКлиентСервер.ИмяТоварнойГруппы(ПараметрыКодаМаркировки.ВидПродукции);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыКодаМаркировки.ВидПродукции)
		И ИсточникДанных["gtin"] <> Неопределено Тогда
		
		МассивGTIN = Новый Массив;
		МассивGTIN.Добавить(ИсточникДанных["gtin"]);
		
		Если ДополнительныеПараметры.Свойство("Организация") Тогда
			Организация = ДополнительныеПараметры.Организация;
		Иначе
			Организация = Неопределено;
		КонецЕсли;
		
		Результат = ДанныеПродукцииПоШтрихкодуEAN(МассивGTIN, Организация);
		
		Если Не Результат.ТребуетсяОбновлениеКлючаСессии
			И Не ЗначениеЗаполнено(Результат.ТекстОшибки)
			И Результат.ДанныеПродукцииПоШтрихкодуEAN <> Неопределено Тогда
			ДанныеПоGTIN = Результат.ДанныеПродукцииПоШтрихкодуEAN[ИсточникДанных["gtin"]];
			Если ДанныеПоGTIN <> Неопределено Тогда
				ДанныеДляУточнения.ОКПД2 = ДанныеПоGTIN.ОКПД2;
				ВидыПродукции = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ТоварнаяГруппа(Значение, ДанныеДляУточнения);
				Если ВидыПродукции.Количество() = 1 Тогда
					ПараметрыКодаМаркировки.ВидПродукции = ВидыПродукции[0];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ВидПродукцииДляРазбораКода = ВидПродукции;
	Если ЗначениеЗаполнено(ПараметрыКодаМаркировки.ВидПродукции) Тогда
		ВидПродукцииДляРазбораКода = ПараметрыКодаМаркировки.ВидПродукции;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидПродукцииДляРазбораКода) Тогда
		ВызватьИсключение НСтр("ru = 'Вид продукции определить не удалось'");
	КонецЕсли;
	
	Статус = ИсточникДанных["status"];
	Если Статус <> Неопределено Тогда
	
		Если ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(ВидПродукцииДляРазбораКода) Тогда
			
			ПараметрыКодаМаркировки.Статус = СтатусКодаМаркировкиМОТП(Статус);
			
			Если ЗначениеЗаполнено(ИсточникДанных["statusEx"]) Тогда
				ПараметрыКодаМаркировки.ОсобоеСостояние = СтатусКодаМаркировкиМОТП(ИсточникДанных["statusEx"]);
			КонецЕсли;
			
		Иначе
			
			ПараметрыКодаМаркировки.Статус          = СтатусКодаМаркировкиИСМП(Статус);
			
			Если ЗначениеЗаполнено(ИсточникДанных["statusEx"]) Тогда
				ПараметрыКодаМаркировки.ОсобоеСостояние = СтатусКодаМаркировкиИСМП(ИсточникДанных["statusEx"]);
			КонецЕсли;
			
		КонецЕсли;
	
	Иначе
		
		СтруктураДанныхСтатуса = Новый Структура();
		СтруктураДанныхСтатуса.Вставить("Валидность",                    Ложь);
		СтруктураДанныхСтатуса.Вставить("Наличие",                       Ложь);
		СтруктураДанныхСтатуса.Вставить("УспешнаяПроверкаКриптоподписи", Ложь);
		СтруктураДанныхСтатуса.Вставить("Нанесен",                       Ложь);
		СтруктураДанныхСтатуса.Вставить("ВозможностьРеализации",         Ложь);
		СтруктураДанныхСтатуса.Вставить("Продано",                       Ложь);
		
		Валидность                    = ИсточникДанных["valid"];
		Наличие                       = ИсточникДанных["found"];
		УспешнаяПроверкаКриптоподписи = ИсточникДанных["verified"];
		Нанесен                       = ИсточникДанных["utilised"];
		ВозможностьРеализации         = ИсточникДанных["realizable"];
		Продано                       = ИсточникДанных["sold"];
		
		Если Валидность <> Неопределено Тогда
			СтруктураДанныхСтатуса.Валидность = Валидность;
		КонецЕсли;
		
		Если Наличие <> Неопределено Тогда
			СтруктураДанныхСтатуса.Наличие = Наличие;
		КонецЕсли;
		
		Если УспешнаяПроверкаКриптоподписи <> Неопределено Тогда
			СтруктураДанныхСтатуса.УспешнаяПроверкаКриптоподписи = УспешнаяПроверкаКриптоподписи;
		КонецЕсли;
		
		Если Нанесен <> Неопределено Тогда
			СтруктураДанныхСтатуса.Нанесен = Нанесен;
		КонецЕсли;
		
		Если ВозможностьРеализации <> Неопределено Тогда
			СтруктураДанныхСтатуса.ВозможностьРеализации = ВозможностьРеализации;
		КонецЕсли;
		
		Если Продано <> Неопределено Тогда
			СтруктураДанныхСтатуса.Продано = Продано;
		КонецЕсли;
		
		ПараметрыКодаМаркировки.Статус = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.СтатусКодаМаркировкиПоДаннымГИСМТ(СтруктураДанныхСтатуса, ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(ВидПродукцииДляРазбораКода));
		
	КонецЕсли;
	
	Значение    = ИсточникДанных["packageType"];
	ЗначениеДоп = ИсточникДанных["generalPackageType"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ВидУпаковки = ВидУпаковки(Значение, ВидПродукцииДляРазбораКода, ЗначениеДоп);
	КонецЕсли;
	
	Значение = ИсточникДанных["ownerInn"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ИННВладельца = Значение;
	Иначе
		
		Значение = ИсточникДанных["isOwner"];
		Если Значение <> Неопределено И (Значение Или ИсточникДанных["isTracking"] = Ложь) Тогда
			
			Если ДополнительныеПараметры.Свойство("Организация") Тогда
				
				Организация    = ДополнительныеПараметры.Организация;
				ИННОрганизации = Неопределено;
				
				Если ДополнительныеПараметры.Свойство("КешОрганизаций") Тогда
					ИННОрганизации = ДополнительныеПараметры.КешОрганизаций.Получить(Организация);
				КонецЕсли;
				
				Если ИННОрганизации = Неопределено Тогда
					ИННОрганизации = РаботаСКонтрагентамиИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(Организация).ИНН;
				КонецЕсли;
				
				ПараметрыКодаМаркировки.ИННВладельца = ИННОрганизации;
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Значение = ИсточникДанных["gtin"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.GTIN = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["lastDocId"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ИдентификаторДокумента = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["producerInn"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ИННПроизводителя = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["productName"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ПредставлениеНоменклатуры = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["producerName"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.НаименованиеПроизводителя = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["prVetDocument"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ИдентификаторПроизводственногоВСД = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["grayZone"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ВСеройЗоне = Значение;
	Иначе
		ПараметрыКодаМаркировки.ВСеройЗоне = Ложь;
	КонецЕсли;
	
	Значение = ИсточникДанных["innerUnitCount"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.КоличествоВПотребительскойУпаковке = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["maxRetailPrice"];
	Если Значение <> Неопределено Тогда
		
		ПараметрыКодаМаркировки.МРЦ = Значение;
		ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПривестиЗначениеМРЦ(ПараметрыКодаМаркировки);
		
	Иначе
		
		Значение = ИсточникДанных["mrp"];
		Если Значение <> Неопределено Тогда
			
			ПараметрыКодаМаркировки.МРЦ = Значение;
			ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПривестиЗначениеМРЦ(ПараметрыКодаМаркировки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Значение = ИсточникДанных["expirationDate"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ГоденДо = ОбщегоНазначенияИС.ДатаИзСтроки(Значение);
	Иначе
		Значение = ИсточникДанных["expireDate"];
		Если Значение <> Неопределено Тогда
			ПараметрыКодаМаркировки.ГоденДо = ОбщегоНазначенияИС.ДатаИзСтроки(Значение);
		КонецЕсли;
	КонецЕсли;
	
	Значение = ИсточникДанных["emissionDate"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ДатаЭмиссии = ОбщегоНазначенияИС.ДатаИзСтроки(Значение);
	КонецЕсли;
	
	Значение = ИсточникДанных["emissionType"];
	Если Значение <> Неопределено И ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
		
		//@skip-check wrong-string-literal-content
		Модуль = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтерфейсИСМПСлужебный");
		ПараметрыКодаМаркировки.СпособВводаВОборот = Модуль.СпособВыпускаВОборот(Значение);
		
	КонецЕсли;
	
	Значение = ИсточникДанных["producedDate"];
	Если Значение <> Неопределено Тогда
		
		ПараметрыКодаМаркировки.ДатаПроизводства = ОбщегоНазначенияИС.ДатаИзСтроки(Значение);
		
	Иначе
		
		Значение = ИсточникДанных["productionDate"];
		Если Значение <> Неопределено Тогда
			
			ПараметрыКодаМаркировки.ДатаПроизводства = ОбщегоНазначенияИС.ДатаИзСтроки(Значение);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Значение = ИсточникДанных["introducedDate"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ДатаВводаВОборот = ОбщегоНазначенияИС.ДатаИзСтроки(Значение);
	КонецЕсли;
	
	Значение = ИсточникДанных["applicationDate"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ДатаНанесения = ОбщегоНазначенияИС.ДатаИзСтроки(Значение);
	КонецЕсли;
	
	Значение = ИсточникДанных["connectDate"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ДатаПодключения = ОбщегоНазначенияИС.ДатаИзСтроки(Значение);
	КонецЕсли;
	
	Значение = КонструкторИСМПОбщегоНазначенияКлиентСервер.КоэффициентПересчетаКоличестваЧастичногоВыбытияДляРазрешительногоРежима(ПараметрыКодаМаркировки.ВидПродукции);
	Если ТипЗнч(Значение) = Тип("Массив")
		И Значение.Количество()
		И ЗначениеЗаполнено(Значение[0]) Тогда
		КоэффициентПересчета = Значение[0];
	Иначе
		КоэффициентПересчета = 1;
	КонецЕсли;
	
	ДанныеЧастичногоВыбытия = ИсточникДанных["partialSaleInfo"];
	
	Если ДанныеЧастичногоВыбытия <> Неопределено Тогда
		
		ПараметрыКодаМаркировки.ЕмкостьПотребительскойУпаковки = ДанныеЧастичногоВыбытия["innerUnitCount"] * КоэффициентПересчета;
		ПараметрыКодаМаркировки.ЧастичноеВыбытиеВыведено       = ДанныеЧастичногоВыбытия["soldUnitCount"] * КоэффициентПересчета;
		ПараметрыКодаМаркировки.ЧастичноеВыбытиеОстатокГИСМТ   = ДанныеЧастичногоВыбытия["rest"] * КоэффициентПересчета;
		КорректностьОстатка                                    = ДанныеЧастичногоВыбытия["correctRest"];
		
		Если КорректностьОстатка <> Неопределено Тогда
			ПараметрыКодаМаркировки.ЧастичноеВыбытиеНеКорректно = Не (КорректностьОстатка);
		КонецЕсли;
		
	Иначе
		
		ДанныеЧастичногоВыбытия = Новый Структура();
		ДанныеЧастичногоВыбытия.Вставить("ЕмкостьПотребительскойУпаковки", 0);
		ДанныеЧастичногоВыбытия.Вставить("ЧастичноеВыбытиеВыведено",       0);
		ДанныеЧастичногоВыбытия.Вставить("ЧастичноеВыбытиеОстатокГИСМТ",   0);
		ДанныеЧастичногоВыбытия.Вставить("ЕстьДанныеЧастичногоВыбытия",    Ложь);
			
		Если ИсточникДанных["innerUnitCount"] <> Неопределено Тогда
			
			ДанныеЧастичногоВыбытия.ЕмкостьПотребительскойУпаковки = ИсточникДанных["innerUnitCount"];
			ДанныеЧастичногоВыбытия.ЕстьДанныеЧастичногоВыбытия    = Истина;
			
		КонецЕсли;
		
		Если ИсточникДанных["soldUnitCount"] <> Неопределено Тогда
			
			ДанныеЧастичногоВыбытия.ЧастичноеВыбытиеВыведено       = ИсточникДанных["soldUnitCount"];
			ДанныеЧастичногоВыбытия.ЕстьДанныеЧастичногоВыбытия    = Истина;
			
		КонецЕсли;
		
		Если ДанныеЧастичногоВыбытия.ЕстьДанныеЧастичногоВыбытия Тогда
			
			ПараметрыКодаМаркировки.ЕмкостьПотребительскойУпаковки = ДанныеЧастичногоВыбытия.ЕмкостьПотребительскойУпаковки * КоэффициентПересчета;
			ПараметрыКодаМаркировки.ЧастичноеВыбытиеВыведено       = ДанныеЧастичногоВыбытия.ЧастичноеВыбытиеВыведено * КоэффициентПересчета;
			ДанныеЧастичногоВыбытия.ЧастичноеВыбытиеОстатокГИСМТ   = ПараметрыКодаМаркировки.ЕмкостьПотребительскойУпаковки - ПараметрыКодаМаркировки.ЧастичноеВыбытиеВыведено;
			ПараметрыКодаМаркировки.ЧастичноеВыбытиеОстатокГИСМТ   = ДанныеЧастичногоВыбытия.ЧастичноеВыбытиеОстатокГИСМТ;
			КорректностьОстатка                                    = ПараметрыКодаМаркировки.ЧастичноеВыбытиеОстатокГИСМТ > 0;
			Если КорректностьОстатка <> Неопределено Тогда
				ПараметрыКодаМаркировки.ЧастичноеВыбытиеНеКорректно = Не (КорректностьОстатка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИсточникДанных["parent"] <> Неопределено Тогда
		ПараметрыКодаМаркировки.РодительскаяУпаковка = ИсточникДанных["parent"];
	КонецЕсли;
	
	ПараметрыКодаМаркировки.СписокОрганизацийБлокировкиКМ = Новый Массив;
	
	Если ИсточникДанных["isBlocked"] <> Неопределено Тогда
		
		ПараметрыКодаМаркировки.ПродажаЗаблокирована = ИсточникДанных["isBlocked"];
		
		Значение = ИсточникДанных["ogvs"];
		
		Если Значение <> Неопределено Тогда
			ПараметрыКодаМаркировки.СписокОрганизацийБлокировкиКМ = Значение;
		КонецЕсли;
		
	ИначеЕсли ИсточникДанных["ogvs"] <> Неопределено Тогда
		
		ПараметрыКодаМаркировки.СписокОрганизацийБлокировкиКМ = ИсточникДанных["ogvs"];
		ПараметрыКодаМаркировки.ПродажаЗаблокирована          = ПараметрыКодаМаркировки.СписокОрганизацийБлокировкиКМ.Количество();
		
	Иначе
		ПараметрыКодаМаркировки.ПродажаЗаблокирована = Ложь;
	КонецЕсли;
	
	Если ПараметрыКодаМаркировки.ПродажаЗаблокирована Тогда
		
		ПараметрыКодаМаркировки.ОсобоеСостояние = Перечисления.СтатусыКодовМаркировкиИСМП.ЗаблокированОГВ;
		
	КонецЕсли;
	
	Если ВложенныеЭлементы <> Неопределено
		И ВложенныеЭлементы.Количество() > 0 Тогда
		
		Если ДополнительныеПараметры.Свойство("НастройкиРазбора")
			И Не ДополнительныеПараметры.НастройкиРазбора = Неопределено Тогда
			НастройкиРазбораКодаМаркировки = ДополнительныеПараметры.НастройкиРазбора;
		Иначе
			ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
			ПользовательскиеПараметрыРазбораКодаМаркировки.ПроверятьАлфавитЭлементов = Ложь;
			
			НастройкиРазбораКодаМаркировки = Новый Структура;
			НастройкиРазбораКодаМаркировки.Вставить("Кеш",              РазборКодаМаркировкиИССлужебныйКлиентСервер.ИнициализироватьНастройкиИспользующиеРезультатыПредыдущихРазборов());
			НастройкиРазбораКодаМаркировки.Вставить("Общие",            РазборКодаМаркировкиИССлужебныйПовтИсп.НастройкиРазбораКодаМаркировки(, Ложь));
			НастройкиРазбораКодаМаркировки.Вставить("Пользовательские", ПользовательскиеПараметрыРазбораКодаМаркировки);

		КонецЕсли;
		
		ПараметрыКодаМаркировки.ВложенныеУпаковки = Новый Соответствие();
		Для Каждого ВложенныйКодМаркировки Из ВложенныеЭлементы Цикл
			
			СтрокаКодаМаркировки = ШтрихкодированиеОбщегоНазначенияИС.НоваяСтруктураОбработкиШтрихкодаУпрощенныйРазбор(
				ВложенныйКодМаркировки, ВидПродукцииДляРазбораКода, НастройкиРазбораКодаМаркировки);
			
			Если ПараметрыКодаМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
				И Не ЗначениеЗаполнено(СтрокаКодаМаркировки.ВидУпаковки)
				И РазборКодаМаркировкиИССлужебныйКлиентСервер.ВидУпаковкиСоответствуетРазбору(
					ВидПродукции,
					Перечисления.ВидыУпаковокИС.Потребительская,
					СтрокаКодаМаркировки.ДанныеРазбора) Тогда
				СтрокаКодаМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская;
			КонецЕсли;
			
			Если ПараметрыКодаМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор
				И Не ЗначениеЗаполнено(СтрокаКодаМаркировки.ВидУпаковки)
				И РазборКодаМаркировкиИССлужебныйКлиентСервер.ВидУпаковкиСоответствуетРазбору(
					ВидПродукции,
					Перечисления.ВидыУпаковокИС.Потребительская,
					СтрокаКодаМаркировки.ДанныеРазбора) Тогда
				СтрокаКодаМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская;
			КонецЕсли;
			
			СтрокаКодаМаркировки.Вставить("РодительскаяУпаковка", ИсточникДанных["cis"]);
			ШтрихкодированиеОбщегоНазначенияМОТП.РассчитатьХэшСуммуНормализации(
				СтрокаКодаМаркировки,
				СтрокаКодаМаркировки.ДанныеРазбора);
			
			ПараметрыКодаМаркировки.ВложенныеУпаковки.Вставить(
				ВложенныйКодМаркировки,
				СтрокаКодаМаркировки);
			
		КонецЦикла;
		
	ИначеЕсли ПараметрыКодаМаркировки.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Потребительская Тогда
		ПараметрыКодаМаркировки.ВложенныеУпаковки = Новый Соответствие;
	КонецЕсли;
	
	Если ИсточникДанных["certDoc"] <> Неопределено Тогда
		
		ЕстьДокументацияВЗеленомСтатусе     = Ложь;
		ЕстьДокументацияВЖелтомСтатусе      = Ложь;
		ЕстьДокументацияВКрасномСтатусе     = Ложь;
		ЕстьДокументацияВНеизвестномСтатусе = Ложь;
		
		Для Каждого СтрокаДокументовСертификации Из ИсточникДанных["certDoc"] Цикл
			
			Если СтрокаДокументовСертификации = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаДокументовСертификации["type"] = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрокаРазрешительнойДокументации = ШтрихкодированиеОбщегоНазначенияИСМП.ИнициализацияОписанияРазрешительногоДокумента();
			
			НоваяСтрокаРазрешительнойДокументации.ВидДокументаСертификации   = ВидДокументаСертификации(СтрокаДокументовСертификации["type"]);
			НоваяСтрокаРазрешительнойДокументации.ГруппаСтатуса              = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ГруппаСтатусовРазрешительныхДокументов(СтрокаДокументовСертификации["statusGroup"]);
			НоваяСтрокаРазрешительнойДокументации.ДатаДокументаСертификации  = ОбщегоНазначенияИС.СтрокаВДату(СтрокаДокументовСертификации["date"]);
			НоваяСтрокаРазрешительнойДокументации.НомерДокументаСертификации = СтрокаДокументовСертификации["number"];
			НоваяСтрокаРазрешительнойДокументации.ОбоснованиеОтсутствияРД    = СтрокаДокументовСертификации["isRequired"];
			
			ПараметрыКодаМаркировки.ДанныеРазрешительнойДокументации.РазрешительныеДокументы.Добавить(НоваяСтрокаРазрешительнойДокументации);
			
			Если НоваяСтрокаРазрешительнойДокументации.ГруппаСтатуса = Перечисления.ГруппыСтатусовРазрешительныхДокументовИСМП.ЗеленыйСтатус Тогда
				ЕстьДокументацияВЗеленомСтатусе = Истина;
			ИначеЕсли НоваяСтрокаРазрешительнойДокументации.ГруппаСтатуса = Перечисления.ГруппыСтатусовРазрешительныхДокументовИСМП.ЖелтыйСтатус Тогда
				ЕстьДокументацияВЖелтомСтатусе = Истина;
			ИначеЕсли НоваяСтрокаРазрешительнойДокументации.ГруппаСтатуса = Перечисления.ГруппыСтатусовРазрешительныхДокументовИСМП.КрасныйСтатус Тогда
				ЕстьДокументацияВКрасномСтатусе = Истина;
			ИначеЕсли ЗначениеЗаполнено(НоваяСтрокаРазрешительнойДокументации.ГруппаСтатуса) Тогда
				ЕстьДокументацияВНеизвестномСтатусе = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьДокументацияВЗеленомСтатусе Тогда
			ПараметрыКодаМаркировки.ДанныеРазрешительнойДокументации.ОбщаяГруппаСтатуса = Перечисления.ГруппыСтатусовРазрешительныхДокументовИСМП.ЗеленыйСтатус;
		ИначеЕсли ЕстьДокументацияВЖелтомСтатусе Тогда
			ПараметрыКодаМаркировки.ДанныеРазрешительнойДокументации.ОбщаяГруппаСтатуса = Перечисления.ГруппыСтатусовРазрешительныхДокументовИСМП.ЖелтыйСтатус;
		ИначеЕсли ПараметрыКодаМаркировки.ДанныеРазрешительнойДокументации.РазрешительныеДокументы.Количество() = 0 Тогда
			ПараметрыКодаМаркировки.ДанныеРазрешительнойДокументации.ОбщаяГруппаСтатуса = Перечисления.ГруппыСтатусовРазрешительныхДокументовИСМП.ПустаяСсылка();
		ИначеЕсли Не ЕстьДокументацияВЖелтомСтатусе
			И Не ЕстьДокументацияВЗеленомСтатусе
			И Не ЕстьДокументацияВКрасномСтатусе
			И Не ЕстьДокументацияВНеизвестномСтатусе Тогда
			// статусы документации не указаны
			ПараметрыКодаМаркировки.ДанныеРазрешительнойДокументации.ОбщаяГруппаСтатуса = Перечисления.ГруппыСтатусовРазрешительныхДокументовИСМП.ПустаяСсылка();
		ИначеЕсли ЕстьДокументацияВКрасномСтатусе И Не ЕстьДокументацияВНеизвестномСтатусе Тогда
			ПараметрыКодаМаркировки.ДанныеРазрешительнойДокументации.ОбщаяГруппаСтатуса = Перечисления.ГруппыСтатусовРазрешительныхДокументовИСМП.КрасныйСтатус;
		Иначе
			ПараметрыКодаМаркировки.ДанныеРазрешительнойДокументации.ОбщаяГруппаСтатуса = Перечисления.ГруппыСтатусовРазрешительныхДокументовИСМП.НеизвестныйСтатус;
		КонецЕсли;
		
	Иначе
		
		Если ИсточникДанных["certDocRequirementDetails"] <> Неопределено Тогда
			ПараметрыКодаМаркировки.ДанныеРазрешительнойДокументации.ОбщаяГруппаСтатуса = Перечисления.ГруппыСтатусовРазрешительныхДокументовИСМП.НеизвестныйСтатус;
		Иначе
			ПараметрыКодаМаркировки.ДанныеРазрешительнойДокументации.ОбщаяГруппаСтатуса = Перечисления.ГруппыСтатусовРазрешительныхДокументовИСМП.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Эталон <> Неопределено Тогда
		Эталон.Источник  = ИсточникДанных;
		Эталон.Результат = ПараметрыКодаМаркировки;
	КонецЕсли;
	
	Возврат ПараметрыКодаМаркировки;
	
КонецФункции

Функция ИнициализироватьПараметрыКодаМаркировкиМОТП() Экспорт
	
	ПараметрыКодаМаркировки = Новый Структура;
	ПараметрыКодаМаркировки.Вставить("РезультатРазбора");
	
	ПараметрыКодаМаркировки.Вставить("Статус");
	ПараметрыКодаМаркировки.Вставить("ОсобоеСостояние");
	
	ПараметрыКодаМаркировки.Вставить("ИННВладельца");
	ПараметрыКодаМаркировки.Вставить("НаименованиеВладельца");
	ПараметрыКодаМаркировки.Вставить("НаименованиеПроизводителя");
	ПараметрыКодаМаркировки.Вставить("ИННПроизводителя");
	ПараметрыКодаМаркировки.Вставить("GTIN");
	ПараметрыКодаМаркировки.Вставить("ПредставлениеНоменклатуры");
	
	ПараметрыКодаМаркировки.Вставить("ИдентификаторДокумента");
	
	ПараметрыКодаМаркировки.Вставить("ДатаЭмиссии",      '00010101');
	ПараметрыКодаМаркировки.Вставить("ДатаПроизводства", '00010101');
	ПараметрыКодаМаркировки.Вставить("ДатаНанесения",    '00010101');
	ПараметрыКодаМаркировки.Вставить("ДатаВводаВОборот", '00010101');
	ПараметрыКодаМаркировки.Вставить("ГоденДо",          '00010101');
	ПараметрыКодаМаркировки.Вставить("ДатаПодключения",  '00010101');
	
	ПараметрыКодаМаркировки.Вставить("РодительскаяУпаковка");
	ПараметрыКодаМаркировки.Вставить("ВложенныеУпаковки");
	ПараметрыКодаМаркировки.Вставить("ВидУпаковки");
	ПараметрыКодаМаркировки.Вставить("ВидПродукции");
	ПараметрыКодаМаркировки.Вставить("СпособВводаВОборот");
	ПараметрыКодаМаркировки.Вставить("ИмяТоварнойГруппы");
	ПараметрыКодаМаркировки.Вставить("НомерПартии");
	ПараметрыКодаМаркировки.Вставить("КодТНВЭД");
	ПараметрыКодаМаркировки.Вставить("ГруппаТНВЭД");
	ПараметрыКодаМаркировки.Вставить("ИдентификаторПроизводственногоВСД");
	
	ПараметрыКодаМаркировки.Вставить("МРЦ");
	ПараметрыКодаМаркировки.Вставить("МинимальнаяРозничнаяЦена");
	ПараметрыКодаМаркировки.Вставить("ДанныеРазрешительнойДокументации", ШтрихкодированиеОбщегоНазначенияИСМП.ИнициализацияДанныхРазрешительнойДокументации());
	
	ПараметрыКодаМаркировки.Вставить("ЕмкостьПотребительскойУпаковки");
	ПараметрыКодаМаркировки.Вставить("ЧастичноеВыбытиеВыведено");
	ПараметрыКодаМаркировки.Вставить("ЧастичноеВыбытиеОстатокГИСМТ");
	ПараметрыКодаМаркировки.Вставить("ЧастичноеВыбытиеНеКорректно");
	
	ПараметрыКодаМаркировки.Вставить("ПродажаЗаблокирована");
	ПараметрыКодаМаркировки.Вставить("СписокОрганизацийБлокировкиКМ");
	ПараметрыКодаМаркировки.Вставить("ВСеройЗоне");
	ПараметрыКодаМаркировки.Вставить("КоличествоВПотребительскойУпаковке");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимИдентификаторЗапросаГИСМТ");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимДатаЗапросаГИСМТ");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимИдентификаторЭкземпляраПО");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимВерсияБазы");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимАдресСервера");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимТелоЗапросаJSON");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимТелоОтветаJSON");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимКодОтвета");
	
	Возврат ПараметрыКодаМаркировки;
	
КонецФункции

// Преобразовывает текстовое представление статуса кода маркировки ИСМП в значение перечисления и наоборот.
//
// Параметры:
//  ЗначениеПоиска - ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП, Строка - значение для перекодировки
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП, Строка - статус кода маркировки.
Функция СтатусКодаМаркировкиИСМП(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = Неопределено Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("Строка") Тогда
		
		ЗначениеПоиска = ВРег(ЗначениеПоиска);
		Если ЗначениеПоиска = "EMITTED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Эмитирован;
		ИначеЕсли ЗначениеПоиска = "APPLIED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Нанесен;
		ИначеЕсли ЗначениеПоиска = "INTRODUCED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот;
		ИначеЕсли ЗначениеПоиска = "RETIRED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота;
		ИначеЕсли ЗначениеПоиска = "DISAGGREGATED" Или ЗначениеПоиска = "DISAGGREGATION" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Разагрегирован;
		ИначеЕсли ЗначениеПоиска = "WRITTEN_OFF" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Списан;
			
		// Расширенные статусы
		ИначеЕсли ЗначениеПоиска = "RESERVED_NOT_USED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен;
		ИначеЕсли ЗначениеПоиска = "INTRODUCED_RETURNED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате;
		ИначеЕсли ЗначениеПоиска = "EXPORTED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Экспортирован;
		ИначеЕсли ЗначениеПоиска = "WAIT_REMARK" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПовторнойМаркировки;
		ИначеЕсли ЗначениеПоиска = "WAIT_SHIPMENT" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетДоставки;
		ИначеЕсли ЗначениеПоиска = "WAIT_TRANSFER_TO_OWNER" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику;
		ИначеЕсли ЗначениеПоиска = "EMPTY" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен;
		
		ИначеЕсли ЗначениеПоиска = "REMARK_RETIRED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриПеремаркировке;
		ИначеЕсли ЗначениеПоиска = "LOAN_RETIRED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПоДоговоруРассрочки;
		ИначеЕсли ЗначениеПоиска = "RETIRED_CANCELLATION" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаВРезультатеСписания;
		ИначеЕсли ЗначениеПоиска = "RETIRED_EEC_EXPORT" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЭкспортированВСтраныЕАЭС;
		ИначеЕсли ЗначениеПоиска = "RETIRED_BEYOND_EEC_EXPORT" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЭкспортированЗаПределыСтранЕАЭС;
		ИначеЕсли ЗначениеПоиска = "RETIRED_RETURN" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаВозвращенФизическомуЛицу;
		ИначеЕсли ЗначениеПоиска = "RETIRED_DAMAGE_LOSS" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриУтратеИлиПовреждении;
		ИначеЕсли ЗначениеПоиска = "RETIRED_DESTRUCTION" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриУничтожении;
		ИначеЕсли ЗначениеПоиска = "RETIRED_CONFISCATION" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаКонфискация;
		ИначеЕсли ЗначениеПоиска = "RETIRED_LIQUIDATION" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЛиквидацияПредприятия;
		ИначеЕсли ЗначениеПоиска = "RETIRED_ENTERPRISE_USE" Или ЗначениеПоиска = "RETIRED_NO_RETAIL_USE" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаИспользованДляСобственныхНуждПредприятия;
		ИначеЕсли ЗначениеПоиска = "RETIRED_DONATION" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаБезвозмезднаяПередача;
		ИначеЕсли ЗначениеПоиска = "RETIRED_STATE_ENTERPRISE" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриобретенГосударственнымПредприятием;
		ИначеЕсли ЗначениеПоиска = "RETIRED_REMOTE_SALE" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриДистанционнойПродаже;
		
		ИначеЕсли ЗначениеПоиска = "FTS_RESPOND_NOT_OK" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОтрицательноеРешениеФТС;
		ИначеЕсли ЗначениеПоиска = "FTS_RESPOND_WAITING" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПодтверждениеФТС;
		ИначеЕсли ЗначениеПоиска = "FTS_CONTROL" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.НаКонтролеФТС;
		ИначеЕсли ЗначениеПоиска = "IN_GRAY_ZONE" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.НаходитсяВСеройЗоне;
		ИначеЕсли ЗначениеПоиска = "NON_INDIVIDUAL" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.НеИндивидуализирован;
		ИначеЕсли ЗначениеПоиска = "INDIVIDUAL" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Индивидуализирован;
		ИначеЕсли ЗначениеПоиска = "CONNECT_TAP" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ПодключенКОборудованиюРозлива;
		ИначеЕсли ЗначениеПоиска = "PRIM_RESPONSE_WAITING" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетОтветОтВЕТИС;
		ИначеЕсли ЗначениеПоиска = "LOST_INVENTORY" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОтсутствуетПоИтогуИнвентаризации;
		ИначеЕсли ЗначениеПоиска = "MOVING_BY_UD" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПеремещенияМеждуМОД;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Эмитирован Тогда
			Возврат "EMITTED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Нанесен Тогда
			Возврат "APPLIED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот Тогда
			Возврат "INTRODUCED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота Тогда
			Возврат "RETIRED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Разагрегирован Тогда
			Возврат "DISAGGREGATED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Списан Тогда
			Возврат "WRITTEN_OFF";
		
		// Расширенные статусы
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен Тогда
			Возврат "RESERVED_NOT_USED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате Тогда
			Возврат "INTRODUCED_RETURNED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Экспортирован Тогда
			Возврат "EXPORTED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПовторнойМаркировки Тогда
			Возврат "WAIT_REMARK";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетДоставки Тогда
			Возврат "WAIT_SHIPMENT";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику Тогда
			Возврат "WAIT_TRANSFER_TO_OWNER";
		
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриПеремаркировке Тогда
			Возврат "REMARK_RETIRED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПоДоговоруРассрочки Тогда
			Возврат "LOAN_RETIRED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаВРезультатеСписания Тогда
			Возврат "RETIRED_CANCELLATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаРозничнаяПродажа Тогда
			Возврат "RETIRED_RETAIL";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЭкспортированВСтраныЕАЭС Тогда
			Возврат "RETIRED_EEC_EXPORT";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЭкспортированЗаПределыСтранЕАЭС Тогда
			Возврат "RETIRED_BEYOND_EEC_EXPORT";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаВозвращенФизическомуЛицу Тогда
			Возврат "RETIRED_RETURN";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриУтратеИлиПовреждении Тогда
			Возврат "RETIRED_DAMAGE_LOSS";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриУничтожении Тогда
			Возврат "RETIRED_DESTRUCTION";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаКонфискация Тогда
			Возврат "RETIRED_CONFISCATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЛиквидацияПредприятия Тогда
			Возврат "RETIRED_LIQUIDATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаИспользованДляСобственныхНуждПредприятия Тогда
			Возврат "RETIRED_ENTERPRISE_USE";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаБезвозмезднаяПередача Тогда
			Возврат "RETIRED_DONATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриобретенГосударственнымПредприятием Тогда
			Возврат "RETIRED_STATE_ENTERPRISE";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриДистанционнойПродаже Тогда
			Возврат "RETIRED_REMOTE_SALE";
		
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОтрицательноеРешениеФТС Тогда
			Возврат "FTS_RESPOND_NOT_OK";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПодтверждениеФТС Тогда
			Возврат "FTS_RESPOND_WAITING";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.НаКонтролеФТС Тогда
			Возврат "FTS_CONTROL";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.НаходитсяВСеройЗоне Тогда
			Возврат "IN_GRAY_ZONE";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.НеИндивидуализирован Тогда
			Возврат "NON_INDIVIDUAL";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Индивидуализирован Тогда
			Возврат "INDIVIDUAL";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ПодключенКОборудованиюРозлива Тогда
			Возврат "CONNECT_TAP";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетОтветОтВЕТИС Тогда
			Возврат "PRIM_RESPONSE_WAITING";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОтсутствуетПоИтогуИнвентаризации Тогда
			Возврат "LOST_INVENTORY";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПеремещенияМеждуМОД Тогда
			Возврат "MOVING_BY_UD";
		КонецЕсли;
		
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус кода маркировки: %1'"),
			ЗначениеПоиска);
	
КонецФункции

// Преобразовывает текстовое представление вида упаковки в значение перечисления.
//
// Параметры:
//  ЗначениеПоиска - Строка - значение для перекодировки
//  ВидПродукции   - СправочникСсылка.ВидыПродукцииИС  - Вид продукции.
//  ЗначениеПоискаДополнительное - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыУпаковокИС - вид упаковки.
//
Функция ВидУпаковки(Знач ЗначениеПоиска, ВидПродукции, ЗначениеПоискаДополнительное = Неопределено) Экспорт
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("Строка") Тогда
		
		ЗначениеПоиска = ВРег(ЗначениеПоиска);
		
		Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияМОТП(ВидПродукции) Тогда
			
			Если ЗначениеПоиска = "UNIT" Тогда
				Возврат Перечисления.ВидыУпаковокИС.Потребительская;
			ИначеЕсли ЗначениеПоиска = "GROUP" Или ЗначениеПоискаДополнительное = "GROUP" Тогда
				Возврат Перечисления.ВидыУпаковокИС.Групповая;
			ИначеЕсли ЗначениеПоиска = "SET" Или ЗначениеПоискаДополнительное = "SET" Или ЗначениеПоиска = "PRODUCT_SET" Тогда
				Возврат Перечисления.ВидыУпаковокИС.Набор;
			ИначеЕсли ЗначениеПоиска = "LEVEL1" Тогда
				Возврат Перечисления.ВидыУпаковокИС.Групповая;
			ИначеЕсли СтрНайти(ЗначениеПоиска, "LEVEL") > 0 Тогда
				Возврат Перечисления.ВидыУпаковокИС.Логистическая;
			ИначеЕсли ЗначениеПоиска = "BOX" Тогда
				Возврат Перечисления.ВидыУпаковокИС.Логистическая;
			КонецЕсли;
			
			ВызватьИсключение
				СтрШаблон(
					НСтр("ru = 'Неизвестный вид упаковки: %1'"),
					ЗначениеПоиска);
			
		КонецЕсли;
		
		Если ЗначениеПоиска = "UNIT" Тогда
			Возврат Перечисления.ВидыУпаковокИС.Потребительская;
		ИначеЕсли ЗначениеПоиска = "GROUP" Или ЗначениеПоискаДополнительное = "GROUP" Тогда
			Возврат Перечисления.ВидыУпаковокИС.Групповая;
		ИначеЕсли ЗначениеПоиска = "SET" Или ЗначениеПоискаДополнительное = "SET" Или ЗначениеПоиска = "PRODUCT_SET" Тогда
			Возврат Перечисления.ВидыУпаковокИС.Набор;
		ИначеЕсли СтрНайти(ЗначениеПоиска, "LEVEL") > 0 Тогда
			Возврат Перечисления.ВидыУпаковокИС.Логистическая;
		ИначеЕсли ЗначениеПоиска = "BUNDLE" Или ЗначениеПоиска = "KIT"Тогда
			Возврат Перечисления.ВидыУпаковокИС.Потребительская;
		ИначеЕсли ЗначениеПоиска = "ATK" Тогда
			Возврат Перечисления.ВидыУпаковокИС.АгрегированныйТаможенныйКод;
		ИначеЕсли ЗначениеПоиска = "BOX" Тогда
			Возврат Перечисления.ВидыУпаковокИС.Логистическая;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеПоиска = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			Возврат "UNIT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыУпаковокИС.Групповая Тогда
			Возврат "GROUP";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыУпаковокИС.Набор Тогда
			Возврат "SET";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыУпаковокИС.АгрегированныйТаможенныйКод Тогда
			Возврат "АТК";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыУпаковокИС.Логистическая Тогда
			Возврат "BOX";
		КонецЕсли;
		
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный вид упаковки: %1'"),
			ЗначениеПоиска);

КонецФункции

// Преобразовывает текстовое представление статуса кода маркировки МОТП в значение перечисления.
//
// Параметры:
//  ЗначениеПоиска - Строка - значение для перекодировки
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП - статус кода маркировки.
//
Функция СтатусКодаМаркировкиМОТП(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = Неопределено Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен;
	КонецЕсли;
	
	ЗначениеПоиска = ВРег(ЗначениеПоиска);
	
	Если ЗначениеПоиска = "EMITTED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Эмитирован;
	ИначеЕсли ЗначениеПоиска = "APPLIED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Нанесен;
	ИначеЕсли ЗначениеПоиска = "APPLIED_PAID" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.НанесенОплачен;
	ИначеЕсли ЗначениеПоиска = "APPLIED_NOT_PAID" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.НанесенНеОплачен;
	ИначеЕсли ЗначениеПоиска = "INTRODUCED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот;
	ИначеЕсли ЗначениеПоиска = "RECYCLED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Утилизирован;
	ИначеЕсли ЗначениеПоиска = "RETIRED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота;
	ИначеЕсли ЗначениеПоиска = "RESERVED_NOT_USED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен;
	ИначеЕсли ЗначениеПоиска = "WRITTEN_OFF" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Списан;
	ИначеЕсли ЗначениеПоиска = "WITHDRAWN" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Продан;
	ИначеЕсли ЗначениеПоиска = "INTRODUCED_RETURNED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен;
	ИначеЕсли ЗначениеПоиска = "DISAGGREGATED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Разагрегирован;
	ИначеЕсли ЗначениеПоиска = "WAIT_SHIPMENT" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетДоставки;
	ИначеЕсли ЗначениеПоиска = "EXPORTED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Экспортирован;
	ИначеЕсли ЗначениеПоиска = "LOAN_RETIRED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПоДоговоруРассрочки;
	ИначеЕсли ЗначениеПоиска = "REMARK_RETIRED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриПеремаркировке;
	ИначеЕсли ЗначениеПоиска = "UNDEFINED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен;
	ИначеЕсли ЗначениеПоиска = "EMPTY" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен;
	ИначеЕсли ЗначениеПоиска = "ELIMINATED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.НеИспользован;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус кода маркировки: %1'"),
			ЗначениеПоиска);
	
КонецФункции

// Перекодирует вид документа сертификации для обмена с ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.ВидыДокументовОбязательнойСертификацииИС - значение для перекодировки.
//
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.ВидыДокументовОбязательнойСертификацииИС - Результат перекодирования.
Функция ВидДокументаСертификации(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = "CONFORMITY_DECLARATION" Тогда
		Результат = Перечисления.ВидыДокументовОбязательнойСертификацииИС.ДекларацияСоответствия;
	ИначеЕсли ЗначениеПоиска = "CONFORMITY_CERTIFICATE" Тогда
		Результат = Перечисления.ВидыДокументовОбязательнойСертификацииИС.СертификатСоответствия;
	ИначеЕсли ЗначениеПоиска = "CONFORMITY_CERTIFICATE_OR_DECLARATION" Тогда
		Результат = Перечисления.ВидыДокументовОбязательнойСертификацииИС.СертификатИлиДекларацияСоответствия;
	ИначеЕсли ЗначениеПоиска = "STATE_REGISTRATION_CERTIFICATE" Тогда
		Результат = Перечисления.ВидыДокументовОбязательнойСертификацииИС.СвидетельствоОГосударственнойРегистрации;
	ИначеЕсли ЗначениеПоиска = "REGISTRATION_VET_CERTIFICATE" Тогда
		Результат = Перечисления.ВидыДокументовОбязательнойСертификацииИС.ВетеринарныйСертификат;
	ИначеЕсли ЗначениеПоиска = "REGISTRATION_CERTIFICATE" Тогда
		Результат = Перечисления.ВидыДокументовОбязательнойСертификацииИС.РегистрационноеУдостоверение;
	
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыДокументовОбязательнойСертификацииИС.ДекларацияСоответствия Тогда
		Результат = "CONFORMITY_DECLARATION";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыДокументовОбязательнойСертификацииИС.СертификатСоответствия Тогда
		Результат = "CONFORMITY_CERTIFICATE";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыДокументовОбязательнойСертификацииИС.СертификатИлиДекларацияСоответствия Тогда
		Результат = "CONFORMITY_CERTIFICATE_OR_DECLARATION";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыДокументовОбязательнойСертификацииИС.СвидетельствоОГосударственнойРегистрации Тогда
		Результат = "STATE_REGISTRATION_CERTIFICATE";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыДокументовОбязательнойСертификацииИС.ВетеринарныйСертификат Тогда
		Результат = "REGISTRATION_VET_CERTIFICATE";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыДокументовОбязательнойСертификацииИС.РегистрационноеУдостоверение Тогда
		Результат = "REGISTRATION_CERTIFICATE";
	Иначе
		ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный вид документа сертификации: %1'"),
			ЗначениеПоиска);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Инициализировать структуру данных продукции.
//
// Возвращаемое значение:
//  Структура - Реквизиты продукции:
//   * Идентификатор             - Строка - Идентификатор продукции.
//   * Наименование              - Строка - Наименование продукции.
//   * НаименованиеПолное        - Строка - Наименование продукции.
//   * GTIN                      - Строка - GTIN.
//   * ТорговаяМарка             - Строка - Торговая марка.
//   * ТипУпаковки               - Строка - Тип упаковки.
//   * КоличествоПотребительскихУпаковок - Строка - Количество вложенных единиц.
//   * Модель                    - Строка - Модель производителя.
//   * ДатаПубликации            - Дата   - Дата публикации.
//   * ИННПроизводителя          - Строка - ИНН производителя (импортера).
//   * СтранаПроизводства        - Строка - Страна производства.
//   * ТипПродукции              - Строка - Вид обуви (код).
//   * ТипПродукцииНаименование  - Строка - Вид обуви (наименование).
//   * Цвет              - Строка - Цвет.
//   * Размер            - Строка - Размер.
//   * МатериалВерха     - Строка - Материал верха.
//   * МатериалНиза      - Строка - Материал низа.
//   * МатериалПодкладки - Строка - Материал подкладки.
Функция ИнициализироватьДанныеПродукции(ДанныеОбработки = Неопределено) Экспорт
	
	Если ДанныеОбработки = Неопределено Тогда
		
		ДанныеПродукции = Новый Структура;
		ДанныеПродукции.Вставить("Идентификатор");
		ДанныеПродукции.Вставить("Наименование");
		ДанныеПродукции.Вставить("НаименованиеПолное");
		ДанныеПродукции.Вставить("ВидПродукции");
		ДанныеПродукции.Вставить("ТоварнаяГруппаЧислом");
		ДанныеПродукции.Вставить("GTIN");
		ДанныеПродукции.Вставить("GTINПотребительскойУпаковки");
		ДанныеПродукции.Вставить("ТорговаяМарка");
		ДанныеПродукции.Вставить("ТипУпаковки");
		ДанныеПродукции.Вставить("ХарактеристикаУпаковки");
		ДанныеПродукции.Вставить("КоличествоПотребительскихУпаковок");
		
		ДанныеПродукции.Вставить("Модель");
		ДанныеПродукции.Вставить("ДатаПубликации");
		ДанныеПродукции.Вставить("ИННПроизводителя");
		ДанныеПродукции.Вставить("СтранаПроизводства");
		
		ДанныеПродукции.Вставить("ТипПродукции");
		ДанныеПродукции.Вставить("ТипПродукцииНаименование");
		ДанныеПродукции.Вставить("Цвет");
		ДанныеПродукции.Вставить("Размер");
		ДанныеПродукции.Вставить("МатериалВерха");
		ДанныеПродукции.Вставить("МатериалНиза");
		ДанныеПродукции.Вставить("МатериалПодкладки");
		ДанныеПродукции.Вставить("ТНВЭД");
		ДанныеПродукции.Вставить("ГруппаТНВЭД");
		ДанныеПродукции.Вставить("ОКПД2");
		ДанныеПродукции.Вставить("ГруппаОКПД2");
		ДанныеПродукции.Вставить("ЕмкостьУпаковки");
		ДанныеПродукции.Вставить("ТоварСПеременнымВесом");
		ДанныеПродукции.Вставить("ВесВГраммах");
		ДанныеПродукции.Вставить("ОбъемВМиллитрах");
		ДанныеПродукции.Вставить("БазоваяЕдиницаИзмерения");
		ДанныеПродукции.Вставить("КодАлкогольнойПродукции");
		
	Иначе
		
		ДанныеПродукции = ИнициализироватьДанныеПродукции();
		
		ПодлежитВетеринарномуКонтролю = Неопределено;
		
		Если ТипЗнч(ДанныеОбработки) = Тип("Структура") Тогда
			
			ДанныеОбработки.Свойство("id",                ДанныеПродукции.Идентификатор);
			ДанныеОбработки.Свойство("name",              ДанныеПродукции.Наименование);
			ДанныеОбработки.Свойство("name",              ДанныеПродукции.НаименованиеПолное);
			ДанныеОбработки.Свойство("gtin",              ДанныеПродукции.GTIN);
			ДанныеОбработки.Свойство("brand",             ДанныеПродукции.ТорговаяМарка);
			ДанныеОбработки.Свойство("packageType",       ДанныеПродукции.ТипУпаковки);
			ДанныеОбработки.Свойство("innerUnitCount",    ДанныеПродукции.КоличествоПотребительскихУпаковок);
			ДанныеОбработки.Свойство("model",             ДанныеПродукции.Модель);
			ДанныеОбработки.Свойство("inn",               ДанныеПродукции.ИННПроизводителя);
			ДанныеОбработки.Свойство("country",           ДанныеПродукции.СтранаПроизводства);
			ДанныеОбработки.Свойство("productType",       ДанныеПродукции.ТипПродукции);
			ДанныеОбработки.Свойство("productTypeDesc",   ДанныеПродукции.ТипПродукцииНаименование);
			ДанныеОбработки.Свойство("color",             ДанныеПродукции.Цвет);
			ДанныеОбработки.Свойство("productSize",       ДанныеПродукции.Размер);
			ДанныеОбработки.Свойство("materialUpper",     ДанныеПродукции.МатериалВерха);
			ДанныеОбработки.Свойство("materialDown",      ДанныеПродукции.МатериалНиза);
			ДанныеОбработки.Свойство("materialLining",    ДанныеПродукции.МатериалПодкладки);
			ДанныеОбработки.Свойство("quantityInPack",    ДанныеПродукции.ЕмкостьУпаковки);
			ДанныеОбработки.Свойство("isVarQuantity",     ДанныеПродукции.ТоварСПеременнымВесом);
			ДанныеОбработки.Свойство("coreWeight",        ДанныеПродукции.ВесВГраммах);
			ДанныеОбработки.Свойство("coreVolume",        ДанныеПродукции.ОбъемВМиллитрах);
			ДанныеОбработки.Свойство("basicUnit",         ДанныеПродукции.БазоваяЕдиницаИзмерения);
			ДанныеОбработки.Свойство("okpd2Group",        ДанныеПродукции.ОКПД2);
			ДанныеОбработки.Свойство("mainGtin",          ДанныеПродукции.GTINПотребительскойУпаковки);
			ДанныеОбработки.Свойство("productGroupId",    ДанныеПродукции.ТоварнаяГруппаЧислом);
			ДанныеОбработки.Свойство("egais",             ДанныеПродукции.КодАлкогольнойПродукции);
			ДанныеОбработки.Свойство("packageCharacteristic", ДанныеПродукции.ХарактеристикаУпаковки);
			
			Если ДанныеОбработки.Свойство("tnVedCode10") Тогда
				ДанныеПродукции.ТНВЭД = ДанныеОбработки.tnVedCode10;
			КонецЕсли;
			Если ДанныеОбработки.Свойство("tnVedCode") Тогда
				ДанныеПродукции.ГруппаТНВЭД = ДанныеОбработки.tnVedCode;
			ИначеЕсли ДанныеОбработки.Свойство("tnved") Тогда
				ДанныеПродукции.ГруппаТНВЭД = ДанныеОбработки.tnved;
			КонецЕсли;
			
			Если ДанныеОбработки.Свойство("okpd2Code") Тогда
				ДанныеПродукции.ОКПД2 = ДанныеОбработки.okpd2Code;
			КонецЕсли;
			Если ДанныеОбработки.Свойство("okpd2Group") Тогда
				ДанныеПродукции.ГруппаОКПД2 = ДанныеОбработки.okpd2Group;
			КонецЕсли;
			
			Если ДанныеОбработки.Свойство("publicationDate") Тогда
				Если Прав(ДанныеОбработки.publicationDate, 1) = "Z" Тогда
					ДанныеПродукции.ДатаПубликации = ПрочитатьДатуJSON(
						ДанныеОбработки.publicationDate, ФорматДатыJSON.ISO);
				Иначе
					ДанныеПродукции.ДатаПубликации = ОбщегоНазначенияИСКлиентСервер.ДатаИзСтрокиUNIX(ДанныеОбработки.publicationDate);
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеОбработки.Свойство("veterinaryControl") Тогда
				ПодлежитВетеринарномуКонтролю = Истина;
				Если ТипЗнч(ДанныеОбработки.veterinaryControl) = Тип("Булево") Тогда
					ПодлежитВетеринарномуКонтролю = ДанныеОбработки.veterinaryControl;
				ИначеЕсли СтрНайти(ВРЕГ(ДанныеОбработки.veterinaryControl), ВРЕГ("НЕТ")) <> 0 Тогда
					ПодлежитВетеринарномуКонтролю = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеОбработки.Свойство("isSet")
				И ДанныеОбработки.isSet = Истина Тогда
				ДанныеПродукции.ТипУпаковки = Перечисления.ВидыУпаковокИС.Набор;
			ИначеЕсли ДанныеОбработки.Свойство("level") Тогда
				Если ДанныеОбработки.level = "inner-pack" Тогда
					ДанныеПродукции.ТипУпаковки = Перечисления.ВидыУпаковокИС.Групповая;
				ИначеЕсли ДанныеОбработки.level = "trade-unit" Тогда
					ДанныеПродукции.ТипУпаковки = Перечисления.ВидыУпаковокИС.Потребительская;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ДанныеПродукции.Идентификатор                     = ДанныеОбработки["id"];
			ДанныеПродукции.Наименование                      = ДанныеОбработки["name"];
			ДанныеПродукции.НаименованиеПолное                = ДанныеОбработки["name"];
			ДанныеПродукции.GTIN                              = ДанныеОбработки["gtin"];
			ДанныеПродукции.ТорговаяМарка                     = ДанныеОбработки["brand"];
			ДанныеПродукции.ТипУпаковки                       = ДанныеОбработки["packageType"];
			ДанныеПродукции.ХарактеристикаУпаковки            = ДанныеОбработки["packageCharacteristic"];
			ДанныеПродукции.КоличествоПотребительскихУпаковок = ДанныеОбработки["innerUnitCount"];
			ДанныеПродукции.Модель                            = ДанныеОбработки["model"];
			ДанныеПродукции.ИННПроизводителя                  = ДанныеОбработки["inn"];
			ДанныеПродукции.СтранаПроизводства                = ДанныеОбработки["country"];
			ДанныеПродукции.ТипПродукции                      = ДанныеОбработки["productType"];
			ДанныеПродукции.ТипПродукцииНаименование          = ДанныеОбработки["productTypeDesc"];
			ДанныеПродукции.Цвет                              = ДанныеОбработки["color"];
			ДанныеПродукции.Размер                            = ДанныеОбработки["productSize"];
			ДанныеПродукции.МатериалВерха                     = ДанныеОбработки["materialUpper"];
			ДанныеПродукции.МатериалНиза                      = ДанныеОбработки["materialDown"];
			ДанныеПродукции.МатериалПодкладки                 = ДанныеОбработки["materialLining"];
			ДанныеПродукции.ЕмкостьУпаковки                   = ДанныеОбработки["quantityInPack"];
			ДанныеПродукции.ТоварСПеременнымВесом             = ДанныеОбработки["isVarQuantity"];
			ДанныеПродукции.ВесВГраммах                       = ДанныеОбработки["coreWeight"];
			ДанныеПродукции.ОбъемВМиллитрах                   = ДанныеОбработки["coreVolume"];
			ДанныеПродукции.БазоваяЕдиницаИзмерения           = ДанныеОбработки["basicUnit"];
			ДанныеПродукции.ОКПД2                             = ДанныеОбработки["okpd2Group"];
			ДанныеПродукции.GTINПотребительскойУпаковки       = ДанныеОбработки["mainGtin"];
			ДанныеПродукции.ТоварнаяГруппаЧислом              = ДанныеОбработки["productGroupId"];
			ДанныеПродукции.КодАлкогольнойПродукции           = ДанныеОбработки["egais"];
			
			Если ДанныеОбработки["tnVedCode10"] <> Неопределено Тогда
				ДанныеПродукции.ТНВЭД = ДанныеОбработки["tnVedCode10"];
			КонецЕсли;
			Если ДанныеОбработки["tnVedCode"] <> Неопределено Тогда
				ДанныеПродукции.ГруппаТНВЭД = ДанныеОбработки["tnVedCode"];
			ИначеЕсли ДанныеОбработки["tnved"] <> Неопределено Тогда
				ДанныеПродукции.ГруппаТНВЭД = ДанныеОбработки["tnved"];
			КонецЕсли;
			
			Если ДанныеОбработки["okpd2Code"] <> Неопределено Тогда
				ДанныеПродукции.ОКПД2 = ДанныеОбработки["okpd2Code"];
			КонецЕсли;
			Если ДанныеОбработки["okpd2Group"] <> Неопределено Тогда
				ДанныеПродукции.ГруппаОКПД2 = ДанныеОбработки["okpd2Group"];
			КонецЕсли;
			
			Если ДанныеОбработки["publicationDate"] <> Неопределено Тогда
				ДанныеПродукции.ДатаПубликации = ОбщегоНазначенияИСКлиентСервер.ДатаИзСтрокиUNIX(ДанныеОбработки["publicationDate"]);
			КонецЕсли;
			
			Если ДанныеОбработки["veterinaryControl"] <> Неопределено Тогда
				ПодлежитВетеринарномуКонтролю = Истина;
				Если ТипЗнч(ДанныеОбработки["veterinaryControl"]) = Тип("Булево") Тогда
					ПодлежитВетеринарномуКонтролю = ДанныеОбработки["veterinaryControl"];
				ИначеЕсли СтрНайти(ВРЕГ(ДанныеОбработки["veterinaryControl"]), ВРЕГ("НЕТ")) <> 0 Тогда
					ПодлежитВетеринарномуКонтролю = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеОбработки["isSet"] <> Неопределено
				И ДанныеОбработки["isSet"] = Истина Тогда
				ДанныеПродукции.ТипУпаковки = Перечисления.ВидыУпаковокИС.Набор;
			ИначеЕсли ДанныеОбработки["level"] <> Неопределено Тогда
				Если ДанныеОбработки["level"] = "inner-pack" Тогда
					ДанныеПродукции.ТипУпаковки = Перечисления.ВидыУпаковокИС.Групповая;
				ИначеЕсли ДанныеОбработки["level"] = "trade-unit" Тогда
					ДанныеПродукции.ТипУпаковки = Перечисления.ВидыУпаковокИС.Потребительская;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеПродукции.Вставить("ПодлежитВетеринарномуКонтролю", ПодлежитВетеринарномуКонтролю);
		
		Если ЗначениеЗаполнено(ДанныеПродукции.ТоварнаяГруппаЧислом) Тогда
			
			ДанныеДляУточненияТоварнойГруппы = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ДанныеДляУточненияТоварнойГруппы();
			ЗаполнитьЗначенияСвойств(ДанныеДляУточненияТоварнойГруппы, ДанныеПродукции);
			
			ВидПродукции = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаЧислом(
				ДанныеПродукции.ТоварнаяГруппаЧислом, ДанныеДляУточненияТоварнойГруппы);
			
			Если Не ЗначениеЗаполнено(ВидПродукции) Тогда
				
				ВидыПродукцииПоДаннымУточнения = ИнтерфейсИСМПОбщегоНазначенияВызовСервера.ВидыПродукцииПоДаннымУточнения(
					ДанныеДляУточненияТоварнойГруппы);
				ВидыПродукцииПоддерживающиеПодключениеКОборудованиюРозлива =
					КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоддерживающиеПодключениеКОборудованиюРозлива();
				ВидыПродукцииПодконтрольныеВЕТИС = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииИСМПВЕТИС();
				
				Для Каждого ВидПродукцииПоДаннымУточнения Из ВидыПродукцииПоДаннымУточнения Цикл
					
					Если ПодлежитВетеринарномуКонтролю = Неопределено Тогда
						ВидПродукции = ВидПродукцииПоДаннымУточнения;
						Если Строка(ДанныеПродукции.ТоварнаяГруппаЧислом) = "15" // beer
							И (СтрНайти(ВРег(ДанныеПродукции.ХарактеристикаУпаковки), "КЕГ") > 0
								Или СтрНайти(ВРег(ДанныеПродукции.ХарактеристикаУпаковки), "УПАКОВКА СПЕЦИАЛИЗИРОВАННАЯ") > 0)
							И ВидыПродукцииПоддерживающиеПодключениеКОборудованиюРозлива.Количество() > 0
							И ВидыПродукцииПоддерживающиеПодключениеКОборудованиюРозлива.Найти(ВидПродукции) = Неопределено Тогда
							ВидПродукции = ВидыПродукцииПоддерживающиеПодключениеКОборудованиюРозлива[0];
						КонецЕсли;
						Прервать;
					Иначе
						Если ПодлежитВетеринарномуКонтролю
							И ВидыПродукцииПодконтрольныеВЕТИС.Найти(ВидПродукцииПоДаннымУточнения) <> Неопределено Тогда
							ВидПродукции = ВидПродукцииПоДаннымУточнения;
							Прервать;
						ИначеЕсли Не ПодлежитВетеринарномуКонтролю
							И ВидыПродукцииПодконтрольныеВЕТИС.Найти(ВидПродукцииПоДаннымУточнения) = Неопределено Тогда
							ВидПродукции = ВидПродукцииПоДаннымУточнения;
							Прервать;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			ДанныеПродукции.ВидПродукции = ВидПродукции;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеПродукции.ТоварСПеременнымВесом = Неопределено Тогда
		ДанныеПродукции.ТоварСПеременнымВесом = Ложь;
	КонецЕсли;
	
	Возврат ДанныеПродукции;
	
КонецФункции

// Получить документ по идентификатору.
// 
// Параметры:
// 	Идентификатор - Строка                              - Идентификатор документа.
// 	Организация   - ОпределяемыйТип.Организация         - Организация
// 	ВидПродукции  - СправочникСсылка.ВидыПродукцииИС    - Вид продукции.
// 	Операция      - ПеречислениеСсылка.ВидыОперацийИСМП - Вид операции.
// Возвращаемое значение:
// 	Структура - Описание:
// 	* ТребуетсяОбновлениеКлючаСессии - Булево - Признак необходимости обновления ключа сессии.
// 	* РезультатОтправкиЗапроса       - см. ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON.
// 	* ДанныеДокумента - Структура - Данные документа.
// 	                  - Неопределено - Если при получении данных возникла ошибка.
// 	* ТекстОшибки - Строка - Текст ошибки.
Функция СтатусОбработкиДокументаПоИдентификатору(Идентификатор, Организация = Неопределено, ВидПродукции = Неопределено, Операция = Неопределено) Экспорт
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента);
	ВозвращаемоеЗначение.Вставить("Статус",                         Перечисления.СтатусыДокументовИСМП.ПустаяСсылка());
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Перечисления.СтатусыОбработкиСообщенийИСМП.ПустаяСсылка());
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Массив;
	Если ЗначениеЗаполнено(ВидПродукции) Тогда
		ПараметрыЗапроса.Добавить(
			СтрШаблон(
				"pg=%1",
				ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппа(ВидПродукции)));
	КонецЕсли;
	
	ВидыПродукцииПоТоварнойГруппе = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоТоварнойГруппе(ВидПродукции);
	ЭтоСырьеГИСМТ = КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ВидыПродукцииПоТоварнойГруппе);
	
	ЗаголовкиHTTP = Неопределено;
	Если ЭтоСырьеГИСМТ Тогда
		URLЗапроса = СтрШаблон(
			"api/v3/true-api/sim/documents/%1%2",
			Идентификатор,
			ПараметрыЗапроса(ПараметрыЗапроса));
		ЗаголовкиHTTP = Новый Соответствие();
		ЗаголовкиHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
		ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
		ЗаголовкиHTTP.Вставить("Accept", "application/json");
		ЗаголовкиHTTP.Вставить("X-Request-Id",   Строка(Новый УникальныйИдентификатор()));
		Если КлючСессии <> Неопределено Тогда
			ЗаголовкиHTTP.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
		КонецЕсли;
	Иначе
		Если Операция = Перечисления.ВидыОперацийИСМП.АТКСоздание Тогда
			ПараметрыЗапроса.Добавить("body=true");
		КонецЕсли;
		
		URLЗапроса = СтрШаблон(
			"api/v4/true-api/doc/%1/info%2",
			Идентификатор,
			ПараметрыЗапроса(ПараметрыЗапроса));
	КонецЕсли;
	
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(
		URLЗапроса,
		КлючСессии,
		ОбщегоНазначенияИСМПКлиентСервер.ПараметрыОтправкиHTTPЗапросов("", Истина),
		ЗаголовкиHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, Истина);
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				Если ЭтоСырьеГИСМТ Тогда
					ДанныеОбработки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеОбработки);
				КонецЕсли;
				
				// ТАПИ v4 возвращает массив, содержащий результат получения данных по id документа.
				Для Каждого ЭлементДанных Из ДанныеОбработки Цикл
					
					Статус = СтатусДокумента(ЭлементДанных["status"]);
					
					Если Статус = Перечисления.СтатусыДокументовИСМП.ЕстьОшибки 
						Или Статус = Перечисления.СтатусыДокументовИСМП.Ошибка Тогда
						
						СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
						
						Если ЭлементДанных["errors"] <> Неопределено И ЭлементДанных["errors"].Количество() Тогда
							Если ЭтоСырьеГИСМТ Тогда
								ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
									"%1: %2",
									ЭлементДанных["errors"][0]["errorCode"],
									ЭлементДанных["errors"][0]["localizedMessage"]);
							Иначе
								ВозвращаемоеЗначение.ТекстОшибки = СтрСоединить(ЭлементДанных["errors"], Символы.ПС);
							КонецЕсли;
							
						ИначеЕсли ЭлементДанных["commonErrors"] <> Неопределено
							И ЭлементДанных["commonErrors"].Количество() Тогда
							ТекстыОшибок = Новый Массив;
							Для Каждого СтрокаОшибки Из ЭлементДанных["commonErrors"] Цикл
								Если ЗначениеЗаполнено(СтрокаОшибки["errorCode"]) Тогда
									ТекстыОшибок.Добавить(
										СтрШаблон("%1. %2",
										СтрокаОшибки["errorCode"],
										СтрокаОшибки["errorMessage"]));
								Иначе
									ТекстыОшибок.Добавить(СтрокаОшибки["errorMessage"]);
								КонецЕсли;
							КонецЦикла;
							ВозвращаемоеЗначение.ТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);
						Иначе
							ВозвращаемоеЗначение.ТекстОшибки = НСтр("ru = '<Описание ошибки отсутствует>'");
						КонецЕсли;
					
					ИначеЕсли Статус = Перечисления.СтатусыДокументовИСМП.Обрабатывается
						Или Статус = Перечисления.СтатусыДокументовИСМП.ОжидаетПродолженияПроцессингаДокумента Тогда
						СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
					ИначеЕсли Статус = Перечисления.СтатусыДокументовИСМП.Проверен
						Или Статус = Перечисления.СтатусыДокументовИСМП.Принят Тогда
						СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
					ИначеЕсли Статус = Перечисления.СтатусыДокументовИСМП.ОжидаетсяПодтверждениеПоступления Тогда
						СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОжидаетПодтверждения;
					ИначеЕсли Статус = Перечисления.СтатусыДокументовИСМП.ОжидаетРегистрациюУчастникаГИСМТ Тогда
						СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОжидаетРегистрациюУчастникаГИСМТ;
					ИначеЕсли Статус = Перечисления.СтатусыДокументовИСМП.Отменен Тогда
						СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаАннулирована;
					КонецЕсли;
					
					ВозвращаемоеЗначение.Статус          = Статус;
					ВозвращаемоеЗначение.СтатусОбработки = СтатусОбработки;
				
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
			Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
				ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Регистрация списка мест осуществления деятельности ГИСМТ.
// 
// Параметры:
//  Организация Организация
//  ПараметрыЗапроса Параметры запроса
// 
// Возвращаемое значение:
//  Структура - Регистрация списка мест осуществления деятельности ГИСМТ:
// * ТребуетсяОбновлениеКлючаСессии - Булево - 
// * РезультатОтправкиЗапроса - Неопределено - 
// * МестаОсуществленияДеятельности - Массив - 
// * ТекстОшибки - Строка - 
Функция РегистрацияСпискаМестОсуществленияДеятельностиГИСМТ(Организация, ПараметрыЗапроса) Экспорт
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));

	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса", Неопределено);
	ВозвращаемоеЗначение.Вставить("МестаОсуществленияДеятельности", Новый Массив);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки", "");

	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;

	URLЗапроса                    = "api/v3/true-api/mods/add";
	ТелоЗапроса                   = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов = ОбщегоНазначенияИСМПКлиентСервер.ПараметрыОтправкиHTTPЗапросов("", Истина);
	СписокМОДКРегистрации         = Новый Массив;

	Для Каждого РегистрируемыйМОД Из ПараметрыЗапроса.СписокМОД Цикл
		ТелоЗапросаМОД = Новый Структура;
		ТелоЗапросаМОД.Вставить("fiasId", РегистрируемыйМОД.КодФИАС);
		
		Если ЗначениеЗаполнено(РегистрируемыйМОД.КПП) Тогда
			ТелоЗапросаМОД.Вставить("kpp", РегистрируемыйМОД.КПП);
		КонецЕсли;

		МассивИменТоварныхГрупп = Новый Массив;
		Для Каждого ТоварнаяГруппа Из РегистрируемыйМОД.ТоварныеГруппы Цикл
			МассивИменТоварныхГрупп.Добавить(ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппа(ТоварнаяГруппа));
		КонецЦикла;
		ТелоЗапросаМОД.Вставить("productGroup", МассивИменТоварныхГрупп);

		СписокМОДКРегистрации.Добавить(ТелоЗапросаМОД);

	КонецЦикла;

	ТелоЗапроса.Вставить("mods", СписокМОДКРегистрации);

	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(
		URLЗапроса, ТелоЗапроса, КлючСессии, "POST", ПараметрыОтправкиHTTPЗапросов);

	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(
		РезультатЗапроса);

	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;

	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда

		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(
				РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);

			Если ДанныеОбработки = Неопределено Тогда
				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса, РезультатОтправкиЗапроса);

			Иначе

				Для Каждого ЭлементДанных Из ДанныеОбработки.results Цикл
					СтруктураОтвета = Новый Структура;
					СтруктураОтвета.Вставить("ОписаниеРезультата", ЭлементДанных.groupDescription);
					СтруктураОтвета.Вставить("КодРезультата",      ЭлементДанных.code);
					СтруктураОтвета.Вставить("Количество",         ЭлементДанных.count);
					СтруктураОтвета.Вставить("СписокМОД",          Новый Массив);

					Если ЭлементДанных.code = 400 Тогда
						СтруктураОтвета.СписокМОД = ЭлементДанных.modList;
					КонецЕсли;

					ВозвращаемоеЗначение.МестаОсуществленияДеятельности.Добавить(СтруктураОтвета);

				КонецЦикла;

			КонецЕсли;

		Иначе
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса, РезультатОтправкиЗапроса);

			Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
				ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			КонецЕсли;

			Возврат ВозвращаемоеЗначение;

		КонецЕсли;

	ИначеЕсли РезультатОтправкиЗапроса.КодСостояния <> 404 Тогда
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса, РезультатОтправкиЗапроса);

	КонецЕсли;

	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Удаление места осуществления деятельности ГИСМТ.
// 
// Параметры:
//  Организация Организация
//  ПараметрыЗапроса Параметры запроса
// 
// Возвращаемое значение:
//  Структура - Регистрация списка мест осуществления деятельности ГИСМТ:
// * ТребуетсяОбновлениеКлючаСессии - Булево - 
// * РезультатОтправкиЗапроса - Неопределено - 
// * ТекстОшибки - Строка - 
Функция УдалениеМестаОсуществленияДеятельностиГИСМТ(Организация, ПараметрыЗапроса) Экспорт
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;	
	
	URLЗапроса                    = "api/v3/true-api/mod";
	ТелоЗапроса                   = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов = ОбщегоНазначенияИСМПКлиентСервер.ПараметрыОтправкиHTTPЗапросов("", Истина);
	
	ТелоЗапроса.Вставить("productGroup", ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппа(ПараметрыЗапроса.ТоварнаяГруппа));
	ТелоЗапроса.Вставить("fiasId",       ПараметрыЗапроса.КодФИАС);	
	ТелоЗапроса.Вставить("kpp",          ПараметрыЗапроса.КПП);	
	
	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(URLЗапроса, ТелоЗапроса, КлючСессии, "DELETE",
		ПараметрыОтправкиHTTPЗапросов);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.КодСостояния <> 200 Тогда
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса, РезультатОтправкиЗапроса);
		
		Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
			ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
		КонецЕсли;
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает актуализированный список мест осуществления деятельности для организации из сервиса ИСМП.
//
// Параметры:
//   Организация - см. Справочник.Организации - организация, для которой запрашиваются МОД
//   ПараметрыЗапроса - см. ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаСпискаМестОсуществленияДеятельности
//                  - параметры запроса, включают товарные группы для фильтрации
//
// Возвращаемое значение:
//   Структура - структура с результатами запроса:
//       * ТребуетсяОбновлениеКлючаСессии - Булево - Истина, если требуется обновление ключа сессии
//       * РезультатОтправкиЗапроса - Произвольный, Неопределено - результат отправки запроса
//       * ТекстОшибки - Строка - текст ошибки при выполнении запроса
//       * МестаОсуществленияДеятельности - Массив из см. КонструкторИСМПОбщегоНазначенияКлиентСервер.МестоОсуществленияДеятельности
Функция АктуализацияСпискаМестОсуществленияДеятельности(Организация, ПараметрыЗапроса) Экспорт
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("МестаОсуществленияДеятельности", Новый Массив);
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ТоварныеГруппыСырье     = Новый Массив;
	ТоварныеГруппыИСМП      = Новый Массив;
	
	ТребуетсяЗапросМОДСырье = Ложь;
	ТребуетсяЗапросМОД      = Ложь;
	
	ТоварныеГруппыОтбор = ПараметрыЗапроса.ТоварныеГруппы;
	
	Если ТоварныеГруппыОтбор.Количество() Тогда
		Для Каждого ТоварнаяГруппа Из ТоварныеГруппыОтбор Цикл
			Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ТоварнаяГруппа) Тогда
				ТоварныеГруппыСырье.Добавить(ТоварнаяГруппа);
			Иначе
				ТоварныеГруппыИСМП.Добавить(ТоварнаяГруппа);
			КонецЕсли;
		КонецЦикла;

		ТребуетсяЗапросМОД = ТоварныеГруппыИСМП.Количество();

	Иначе
		ТребуетсяЗапросМОД = Истина;

		Для Каждого ВидПродукции Из ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции() Цикл
			Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ВидПродукции) Тогда
				ТоварнаяГруппа = КонструкторИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаПоВидуПродукции(ВидПродукции);
				Если ТоварныеГруппыСырье.Найти(ТоварнаяГруппа) = Неопределено Тогда
					ТоварныеГруппыСырье.Добавить(ТоварнаяГруппа);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;
	
	ТребуетсяЗапросМОДСырье = ТоварныеГруппыСырье.Количество();
	
	Если ТребуетсяЗапросМОД Тогда
		Если ТоварныеГруппыИСМП.Количество() Тогда
			ВидыПродукции = Новый Массив;

			Для Каждого СтрокаТоварнойГруппы Из ТоварныеГруппыИСМП Цикл
				ВидыПродукцииПоТоварнойГруппе = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоТоварнойГруппе(
					СтрокаТоварнойГруппы);

				Для Каждого ВидПродукции Из ВидыПродукцииПоТоварнойГруппе Цикл
					Если ВидыПродукции.Найти(ВидПродукции) = Неопределено Тогда
						ВидыПродукции.Добавить(ВидПродукции);
					КонецЕсли;
				КонецЦикла;

			КонецЦикла;
			
			ПараметрыЗапроса.Вставить("ВидыПродукции", ВидыПродукции);

		КонецЕсли;
		
		Результат = СписокМестОсуществленияДеятельности(Организация, ПараметрыЗапроса);
		
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) 
			Или Результат.ТребуетсяОбновлениеКлючаСессии
			Или Результат.МестаОсуществленияДеятельности.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, Результат, "ТребуетсяОбновлениеКлючаСессии, ТекстОшибки");
		Иначе
			ВозвращаемоеЗначение.МестаОсуществленияДеятельности = Результат.МестаОсуществленияДеятельности;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТребуетсяЗапросМОДСырье Тогда
		ПараметрыЗапроса.ТоварныеГруппы = ТоварныеГруппыСырье;
		
		Результат = ИнтеграцияИСМПСлужебный.СписокМестОсуществленияДеятельностиСырье(Организация, ПараметрыЗапроса);
		
		Если ЗначениеЗаполнено(Результат.ТекстОшибки) 
			Или Результат.ТребуетсяОбновлениеКлючаСессии
			Или Результат.МестаОсуществленияДеятельности.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, Результат, "ТребуетсяОбновлениеКлючаСессии, ТекстОшибки");
		Иначе
			Для каждого МОДИзСервиса Из Результат.МестаОсуществленияДеятельности Цикл
				ВозвращаемоеЗначение.МестаОсуществленияДеятельности.Добавить(МОДИзСервиса);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#Область ПроверкиОрганизацийКонтрагентов

// Запросить статус регистрации участника и товарные группы.
//
// Параметры:
//  Организация - ОпределяемыйТип.Организация - Организация.
//  ИНН - Строка - ИНН
//
// Возвращаемое значение:
//  Структура - Запросить статус регистрации участника и товарные группы:
// * ТребуетсяОбновлениеКлючаСессии - Булево -
// * РезультатОтправкиЗапроса - Неопределено -
// * Статус - Неопределено -
// * ТоварныеГруппы - Массив из СправочникСсылка.ТоварныеГруппыГИСМТ
// * ПодконтрольностьВЕТИС - Соответствие из КлючИЗначение:
// 		** Ключ - СправочникСсылка.ТоварныеГруппыГИСМТ
// 		** Значение - Булево - Признак наличия подконтрольных объектов по данным ФГИС «ВетИС»
// * ТекстОшибки - Строка -
// * ОшибкаСервиса - Булево -
Функция ЗапроситьСтатусРегистрацииУчастникаИТоварныеГруппы(Организация, ИНН) Экспорт

	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ОбщегоНазначенияИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));

	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Статус",                         Неопределено);
	ВозвращаемоеЗначение.Вставить("ТоварныеГруппы",                 Новый Массив);
	ВозвращаемоеЗначение.Вставить("ПодконтрольностьВЕТИС",          Новый Соответствие());
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	ВозвращаемоеЗначение.Вставить("ОшибкаСервиса",                  Ложь);

	Если ПустаяСтрока(ИНН) Тогда
		ВозвращаемоеЗначение.ТекстОшибки = НСтр("ru = 'Не заполнен ИНН'");
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;

	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;

	URLЗапроса = СтрШаблон(
		"api/v3/true-api/participants/%1",
		ИНН);
	РезультатЗапроса = ОбщегоНазначенияИСМП.ПолучитьДанныеИзСервиса(URLЗапроса, КлючСессии, ОбщегоНазначенияИСМПКлиентСервер.ПараметрыОтправкиHTTPЗапросов(""));

	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);

	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;

	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда

		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда

			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);

			Если ДанныеОбработки = Неопределено Тогда

				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);

			Иначе
				
				Если ДанныеОбработки.Свойство("productGroupInfo") Тогда
					
					Для Каждого ДанныеПоТоварнойГруппе Из ДанныеОбработки.productGroupInfo Цикл
						Если ДанныеПоТоварнойГруппе.Свойство("isControllability") Тогда
							ВозвращаемоеЗначение.ПодконтрольностьВЕТИС.Вставить(ДанныеПоТоварнойГруппе.productGroup, ДанныеПоТоварнойГруппе.isControllability);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
				Если ДанныеОбработки.Свойство("productGroups") Тогда
					ВозвращаемоеЗначение.ТоварныеГруппы = ДанныеОбработки.productGroups;
				КонецЕсли;

				ВозвращаемоеЗначение.Статус         = ДанныеОбработки.status;

			КонецЕсли;

		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 404 Тогда

			// {"error_message":"УОТ не найден"}

			ДанныеОбработки = ОбменДаннымиИСМПКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON);

			Если ДанныеОбработки = Неопределено Тогда

				ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);

			Иначе

				ВозвращаемоеЗначение.ТекстОшибки = ДанныеОбработки.error_message;

			КонецЕсли;

		Иначе

			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);

			Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
				ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			КонецЕсли;

			ВозвращаемоеЗначение.ОшибкаСервиса = Истина;

			Возврат ВозвращаемоеЗначение;

		КонецЕсли;

	Иначе

		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);

	КонецЕсли;

	Возврат ВозвращаемоеЗначение;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сравнивает два набора данных кода маркировки по заданным ключам.
//
// Параметры:
//  Данные1        - Соответствие, Структура - Первый набор данных.
//  Данные2        - Соответствие, Структура - Второй набор данных.
//  КлючиСравнения - Массив из Строка       - Ключи для сравнения.
//
// Возвращаемое значение:
//  Булево - Истина, если данные совпадают.
//
Функция ДанныеКодаМаркировкиСовпадают(Данные1, Данные2, КлючиСравнения)
	
	Для Каждого Ключ Из КлючиСравнения Цикл
		
		Значение1 = Данные1[Ключ];
		Значение2 = Данные2[Ключ];
		
		Если Значение1 = Неопределено И Значение2 = Неопределено Тогда
			Продолжить;
		ИначеЕсли Значение1 = Неопределено Или Значение2 = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ТипЗначения = ТипЗнч(Значение1);
		Если ТипЗначения <> ТипЗнч(Значение2) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ТипЗначения = Тип("Соответствие")
			Или ТипЗначения = Тип("Структура")
			Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
			
			Если Не ДанныеКодаМаркировкиСовпадают(Значение1, Значение2, КлючиСравнения) Тогда
				Возврат Ложь;
			КонецЕсли;
			
		ИначеЕсли ТипЗначения = Тип("Массив")
			Или ТипЗначения = Тип("ФиксированныйМассив") Тогда
			
			Если Значение1.Количество() <> Значение2.Количество() Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Индекс = 0 По Значение1.ВГраница() Цикл
				Если Не ДанныеКодаМаркировкиСовпадают(Значение1[Индекс], Значение2[Индекс], КлючиСравнения) Тогда
					Возврат Ложь;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли Значение1 <> Значение2 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция СоздатьДокументПоСообщению(Организация, Операция, ВидПродукции, ТекстСообщения, Подпись, ПараметрыЗапросаИсходящегоСообщения, ТекстДополнительногоСообщения = "", ДополнительнаяПодпись = "") Экспорт
	
	ПараметрыЗапроса = Новый Массив;
	
	Если ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(ВидПродукции)
		И (Операция = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки
			Или Операция = Перечисления.ВидыОперацийИСМП.УдалитьСписаниеВведенныхВОборотКодовМаркировки
			Или Операция = Перечисления.ВидыОперацийИСМП.АгрегацияСоздание
			Или Операция = Перечисления.ВидыОперацийИСМП.АгрегацияИзменение
			Или Операция = Перечисления.ВидыОперацийИСМП.АгрегацияУдаление) Тогда
		
		Если Операция = Перечисления.ВидыОперацийИСМП.АгрегацияСоздание
			Или Операция = Перечисления.ВидыОперацийИСМП.АгрегацияИзменение
			Или Операция = Перечисления.ВидыОперацийИСМП.АгрегацияУдаление Тогда
			URLЗапроса = "api/v3/true-api/documents/aggregation/create";
		Иначе
			URLЗапроса = "api/v3/true-api/documents/dropped-out/create";
		КонецЕсли;
		
		ПолеФормы = Новый Структура;
		ПолеФормы.Вставить("ИмяПоля",  "xmlFile");
		ПолеФормы.Вставить("ИмяФайла", "data.xml");
		ПолеФормы.Вставить("Тип",      "application/xml");
		ПолеФормы.Вставить("Тело",     ТекстСообщения);
		
		ПоляФормы = Новый Массив;
		ПоляФормы.Добавить(ПолеФормы);
		
		ДанныеПреобразования = ОбменДаннымиИСКлиентСервер.ДвоичныеДанныеPOSTЗапросаКакФорма(ПоляФормы);
		ТелоЗапроса = ДанныеПреобразования.ДвоичныеДанные;
		Размер      = ДанныеПреобразования.Размер;
		
		ЗаголовкиHTTP = Новый Соответствие;
		ЗаголовкиHTTP.Вставить("Content-Type",   "multipart/form-data; boundary=" + ДанныеПреобразования.Разделитель);
		ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
		ЗаголовкиHTTP.Вставить("Content-Lenght", Формат(Размер, "ЧН=0; ЧГ=0;"));
		
		Если Подпись <> Неопределено Тогда
			ЗаголовкиHTTP.Вставить("X-Signature", ОбщегоНазначенияИСКлиентСервер.ДвоичныеДанныеBase64(Подпись));
		КонецЕсли;
		
		ПараметрыСозданияДокумента = НовыеПараметрыСозданияДокумента();
		ПараметрыСозданияДокумента.URLЗапроса       = URLЗапроса;
		ПараметрыСозданияДокумента.ТелоЗапроса      = ТелоЗапроса;
		ПараметрыСозданияДокумента.Организация      = Организация;
		ПараметрыСозданияДокумента.Операция         = Операция;
		ПараметрыСозданияДокумента.ЗаголовкиHTTP    = ЗаголовкиHTTP;
		ПараметрыСозданияДокумента.ПараметрыЗапроса = ОбщегоНазначенияИСМПКлиентСервер.ПараметрыОтправкиHTTPЗапросов("", Истина);
		
		Возврат СоздатьДокумент(ПараметрыСозданияДокумента);
		
	ИначеЕсли Операция = Перечисления.ВидыОперацийИСМП.СогласиеОПредоставлениеИнформацииПодписание
		Или Операция = Перечисления.ВидыОперацийИСМП.СогласиеОПредоставлениеИнформацииПодписаниеАннулирования Тогда
		
		МодульСогласиеОПредоставленииИнформацииГИСМТ = ОбщегоНазначения.ОбщийМодуль("СогласиеОПредоставленииИнформацииГИСМТ");

		Возврат МодульСогласиеОПредоставленииИнформацииГИСМТ.ПодписатьДокументСогласияИлиДокументАнулированияОПредоставленииИнформации(
			Организация, Операция, Подпись, ПараметрыЗапросаИсходящегоСообщения);
		
	Иначе
		
		ТребуетсяПередачаВКодировке1251 = (Операция = Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОД
			Или Операция = Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОДПредварительнаяОтгрузка
			Или Операция = Перечисления.ВидыОперацийИСМП.РазрешениеНаОтгрузку);
		
		ДокументBase64 = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ШтрихкодВBase64(ТекстСообщения, ТребуетсяПередачаВКодировке1251);
		
		ОбъемноСортовойУчет = Ложь;
		Если ПараметрыЗапросаИсходящегоСообщения <> Неопределено
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
			ПараметрыЗапросаИсходящегоСообщения, "ОбъемноСортовойУчет") Тогда
			ОбъемноСортовойУчет = ПараметрыЗапросаИсходящегоСообщения.ОбъемноСортовойУчет;
		КонецЕсли;
		
		ТипДокумента = "MANUAL";
		Если ПараметрыЗапросаИсходящегоСообщения <> Неопределено
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
			ПараметрыЗапросаИсходящегоСообщения, "ТипДокумента") Тогда
			ТипДокумента = ПараметрыЗапросаИсходящегоСообщения.ТипДокумента;
		КонецЕсли;
		
		ЭтоСырьеГИСМТ = КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ВидПродукции);
		ТелоЗапроса = Новый Структура;
		ТелоЗапроса.Вставить("type", ВидОперации(Операция, ВидПродукции, ОбъемноСортовойУчет));
		Если Операция = Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОД 
			И ПараметрыЗапросаИсходящегоСообщения <> Неопределено 
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
				ПараметрыЗапросаИсходящегоСообщения, "ТекстДополнительногоСообщения")
			Тогда
			
			ТелоЗапроса.Вставить("document_format",         ТипДокумента);
			ТелоЗапроса.Вставить("second_product_document", ДокументBase64);
			ТелоЗапроса.Вставить("second_signature",        ОбщегоНазначенияИСКлиентСервер.ДвоичныеДанныеBase64(Подпись));
			ТелоЗапроса.Вставить(
				"signature",
				ОбщегоНазначенияИСКлиентСервер.ДвоичныеДанныеBase64(
					ОбщегоНазначенияИСМПСлужебный.ПодписьИзСвойствПодписи(
						ПараметрыЗапросаИсходящегоСообщения.СвойстваДополнительнойПодписи)));
			ТелоЗапроса.Вставить("product_document",
				ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ШтрихкодВBase64(
					ПараметрыЗапросаИсходящегоСообщения.ТекстДополнительногоСообщения,
					ТребуетсяПередачаВКодировке1251));
			
		ИначеЕсли ЭтоСырьеГИСМТ Тогда
			
			ТелоЗапроса.Вставить("productDocument", ДокументBase64);
			ТелоЗапроса.Вставить("signature",       ОбщегоНазначенияИСКлиентСервер.ДвоичныеДанныеBase64(Подпись));
			ТелоЗапроса.Вставить("documentFormat",  ТипДокумента);
			
		Иначе
			
			ТелоЗапроса.Вставить("product_document", ДокументBase64);
			ТелоЗапроса.Вставить("signature",        ОбщегоНазначенияИСКлиентСервер.ДвоичныеДанныеBase64(Подпись));
			ТелоЗапроса.Вставить("document_format",  ТипДокумента);
			
		КонецЕсли;
		
		ПараметрыЗапроса = Новый Массив;
		Если ЗначениеЗаполнено(ВидПродукции) Тогда
			ПараметрыЗапроса.Добавить(
				СтрШаблон(
					"pg=%1",
					ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппа(ВидПродукции)));
		КонецЕсли;
		
		ОсновнойШаблон = "api/v3/true-api/%1/documents/create%2";
		
		Если ЭтоСырьеГИСМТ Тогда
			URLЗапроса = СтрШаблон(
				ОсновнойШаблон,
				"sim",
				ПараметрыЗапроса(ПараметрыЗапроса));
		Иначе
			URLЗапроса = СтрШаблон(
				ОсновнойШаблон,
				"lk",
				ПараметрыЗапроса(ПараметрыЗапроса));
		КонецЕсли;
		
		ПараметрыСозданияДокумента = НовыеПараметрыСозданияДокумента();
		ПараметрыСозданияДокумента.URLЗапроса       = URLЗапроса;
		ПараметрыСозданияДокумента.ТелоЗапроса      = ТелоЗапроса;
		ПараметрыСозданияДокумента.Организация      = Организация;
		ПараметрыСозданияДокумента.Операция         = Операция;
		ПараметрыСозданияДокумента.ПараметрыЗапроса = ОбщегоНазначенияИСМПКлиентСервер.ПараметрыОтправкиHTTPЗапросов("", Истина);
		
		Возврат СоздатьДокумент(ПараметрыСозданияДокумента);
		
	КонецЕсли;
	
КонецФункции

// Создает документ в ИС МП.
// 
// Параметры:
// 	Параметры - Структура - Описание:
// * URLЗапроса    - Строка - адрес на сервере.
// * ТелоЗапроса   - Структура - Данные тела запроса.
// * Организация   - ОпределяемыйТип.Организация - Организация.
// * Операция      - ПеречислениеСсылка.ВидыОперацийИСМП - Вид операции.
// * ВидПродукции  - СправочникСсылка.ВидыПродукцииИС  - Вид продукции.
// * ЗаголовкиHTTP - Соответствие из КлючИЗначение, Неопределено - Заголовки HTTP запроса.
// Возвращаемое значение:
// 	Структура - Описание:
// * ТекстОшибки - Строка -
// * ИдентификаторЗаявки - Неопределено -
// * СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийИСМП -
// * РезультатОтправкиЗапроса - См. ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON
// * ТребуетсяОбновлениеКлючаСессии - Булево - Признак необходимости обновления ключа сессии.
Функция СоздатьДокумент(Параметры)
	
	URLЗапроса          = Параметры.URLЗапроса;
	ТелоЗапроса         = Параметры.ТелоЗапроса;
	Организация         = Параметры.Организация;
	Операция            = Параметры.Операция;
	ЗаголовкиHTTP       = Параметры.ЗаголовкиHTTP;
	ПараметрыЗапроса    = Параметры.ПараметрыЗапроса;
	
	КлючСессии = ИнтерфейсАвторизацииИСМПСлужебный.ПроверитьОбновитьКлючСессии(
		ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
	
	Если ЗаголовкиHTTP <> Неопределено Тогда
		ЗаголовкиHTTP.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
	КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",       Неопределено);
	ВозвращаемоеЗначение.Вставить("Операция",                       Операция);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",                Перечисления.СтатусыОбработкиСообщенийИСМП.ПустаяСсылка());
	ВозвращаемоеЗначение.Вставить("ИдентификаторЗаявки",            Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    "");
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(
		URLЗапроса,
		ТелоЗапроса,
		КлючСессии,
		"POST",
		ПараметрыЗапроса,
		ЗаголовкиHTTP);
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(
		РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200
			Или РезультатОтправкиЗапроса.КодСостояния = 201 Тогда
			
			ИдентификаторЗаявки = РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
			
			Если РезультатОтправкиЗапроса.Объект <> Неопределено Тогда
				Если РезультатОтправкиЗапроса.Объект.Свойство("id") Тогда
					ИдентификаторЗаявки = РезультатОтправкиЗапроса.Объект.id;
				ИначеЕсли РезультатОтправкиЗапроса.Объект.Свойство("documentId") Тогда
					ИдентификаторЗаявки = РезультатОтправкиЗапроса.Объект.documentId;
				КонецЕсли;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ИдентификаторЗаявки)
				Или Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторЗаявки)
					И Не (Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаЕАЭССПризнаниемКИ
					      Или Операция = Перечисления.ВидыОперацийИСМП.ОтгрузкаВЕАЭСПриОСУ
					      Или Операция = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭСПриОСУ
					      Или Операция = Перечисления.ВидыОперацийИСМП.ПриемкаОтклонен
						  Или Операция = Перечисления.ВидыОперацийИСМП.СведенияОКодахИдентификацииДляВводаВОборот
						  Или Операция = Перечисления.ВидыОперацийИСМП.СведенияОРазрешительнойДокументацииДляВводаВОборот
						  Или Операция = Перечисления.ВидыОперацийИСМП.ОтчетОПеревзвешивании
						  Или Операция = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМ
						  Или Операция = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодности
						  Или Операция = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодностиВСД
						  Или Операция = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМФактическийВес
						  Или Операция = Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОДПредварительнаяОтгрузка
						  Или Операция = Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОД
						  Или Операция = Перечисления.ВидыОперацийИСМП.РазрешениеНаОтгрузку
						  Или Операция = Перечисления.ВидыОперацийИСМП.РазрешениеНаОтгрузкуАннулирование) Тогда
				
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
				ВозвращаемоеЗначение.ТекстОшибки     = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
					URLЗапроса,
					РезультатОтправкиЗапроса);
				
			Иначе
				
				ВозвращаемоеЗначение.СтатусОбработки     = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята;
				ВозвращаемоеЗначение.ИдентификаторЗаявки = ИдентификаторЗаявки;
				
			КонецЕсли;
			
		Иначе
			
			ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
			ВозвращаемоеЗначение.ТекстОшибки     = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
			Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
				ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			ИначеЕсли СтрНайти(ВозвращаемоеЗначение.ТекстОшибки, НСтр("ru = 'Некорректный тип документа: FIXATION_CANCEL'")) > 0 Тогда
				ВозвращаемоеЗначение.ТекстОшибки = НСтр(
					"ru = 'Отмена разрешения на отгрузку еще не поддерживается ФГИС ""Честный Знак"".
					      |Для отмены разрешения на отгрузку необходимо обратиться в поддержку ФГИС ""Честный Знак"".
					      |После отмены поддержкой ФГИС ""Честный Знак"" выполните команду Еще - Архивировать документ'");
			КонецЕсли;
			
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
		ВозвращаемоеЗначение.ТекстОшибки     = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция НовыеПараметрыСозданияДокумента()
	
	ПараметрыСозданияДокумента = Новый Структура();
	
	ПараметрыСозданияДокумента.Вставить("URLЗапроса");
	ПараметрыСозданияДокумента.Вставить("ТелоЗапроса");
	ПараметрыСозданияДокумента.Вставить("Организация");
	ПараметрыСозданияДокумента.Вставить("Операция");
	ПараметрыСозданияДокумента.Вставить("ЗаголовкиHTTP");
	ПараметрыСозданияДокумента.Вставить("ПараметрыЗапроса");
	
	Возврат ПараметрыСозданияДокумента;
	
КонецФункции

Функция ЗамерыСкоростиCDNПлощадок()
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("СреднееВремяПроверкиКМ", 0);
	СтруктураВозврата.Вставить("СреднееВремяОтвета",     0);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПараметрыОтправкиЗапросовНаCDNПлощадку()
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("URLЗапроса",           "");
	СтруктураПараметров.Вставить("ТелоЗапросаJSON",      "");
	СтруктураПараметров.Вставить("КлючСессии",           Неопределено);
	СтруктураПараметров.Вставить("ПараметрыЗапроса",     Неопределено);
	СтруктураПараметров.Вставить("ПараметрыЗапросов",    Неопределено);
	СтруктураПараметров.Вставить("ЗаголовокHTTP",        Неопределено);
	СтруктураПараметров.Вставить("АдресПлощадки",        "");
	СтруктураПараметров.Вставить("Сервер",               "");
	СтруктураПараметров.Вставить("Порт",                 0);
	СтруктураПараметров.Вставить("ЗащищенноеСоединение", Ложь);
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ОбработатьКодМаркировкиНаCDNПлощадках(КодМаркировки, ДанныеШтрихкода, ТаблицаCDNПлощадок, КлючСессии, МассивПлощадокКБлокировке, СтруктураДополнительныхПараметров, КешСоединений = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                         Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии",         Ложь);
	ВозвращаемоеЗначение.Вставить("ПараметрыКодаМаркировки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ПродажаРазрешенаВОтсутствиеОтветаГИСМТ", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатыОтправкиЗапросов",             Новый Массив);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                            "");
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("X-API-KEY",      КлючСессии);

	URLЗапроса = "api/v4/true-api/codes/check";
	
	МассивКодовМаркировкиДляОтправки = Новый Массив;
	МассивКодовМаркировкиДляОтправки.Добавить(КодМаркировки);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("codes",             МассивКодовМаркировкиДляОтправки);
	ПараметрыЗапроса.Вставить("inn",               СтруктураДополнительныхПараметров.ИННОрганизации);
	ПараметрыЗапроса.Вставить("fiscalDriveNumber", СтруктураДополнительныхПараметров.НомерФН);
	
	ПараметрыЗапросов         = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыОтправкиHTTPЗапросов(, Истина);
	
	ТелоЗапросаJSON = ОбменДаннымиИСМПКлиентСервер.ОбъектВТекстJSON(ПараметрыЗапроса, Истина);
	
	ОтправленЗапрос                      = Ложь;
	ПолученОтвет                         = Ложь;
	ВремяОжиданияОтветаГИСМТ             = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ВремяОтветаCDNПлощадокПриПробитииЧека();
	ТаймерНачалоЗапросаВМиллисекундах    = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТаймерОкончаниеЗапросаВМиллисекундах = ТаймерНачалоЗапросаВМиллисекундах + ВремяОжиданияОтветаГИСМТ * 1000;
	
	ЗапросыДляЛогирования = Новый Массив();
	
	Для Каждого СтрокаПлощадок Из ТаблицаCDNПлощадок Цикл
		
		// если площадка уже в списке к блокировке, и мы уже выполнили формальный запрос, не надо к ней обращаться
		Если МассивПлощадокКБлокировке.Найти(СтрокаПлощадок.АдресПлощадки) <> Неопределено И ОтправленЗапрос Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТаймерОкончаниеЗапросаВМиллисекундах < ТекущаяУниверсальнаяДатаВМиллисекундах() Тогда
			
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
			Прервать;
			
		КонецЕсли;
		
		Если Не СтрокаПлощадок.ПлощадкаДоступна И ОтправленЗапрос Тогда
			
			// либо все площадки доступные уже перебрали, и остались недоступные,
			// либо все были недоступные, но мы уже отправили один обязательный запрос, можно продавать
			// переход к следующему КМ, по нему тоже надо отправить хотя бы один запрос
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
			Прервать;
			
		КонецЕсли;
		
		ПараметрыЗапросов.ИспользоватьЗащищенноеСоединение = СтрокаПлощадок.ЗащищенноеСоединение;
		ПараметрыЗапросов.Порт                             = СтрокаПлощадок.Порт;
		ПараметрыЗапросов.Сервер                           = СтрокаПлощадок.Сервер;
		
		ДанныеДляОтправкиЗапросаНаПлощадку = ПараметрыОтправкиЗапросовНаCDNПлощадку();
		ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса           = URLЗапроса;
		ДанныеДляОтправкиЗапросаНаПлощадку.ЗаголовокHTTP        = ЗаголовокHTTP;
		ДанныеДляОтправкиЗапросаНаПлощадку.КлючСессии           = КлючСессии;
		ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапроса     = ПараметрыЗапроса;
		ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапросов    = ПараметрыЗапросов;
		ДанныеДляОтправкиЗапросаНаПлощадку.ТелоЗапросаJSON      = ТелоЗапросаJSON;
		ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки        = СтрокаПлощадок.АдресПлощадки;
		ДанныеДляОтправкиЗапросаНаПлощадку.Сервер               = СтрокаПлощадок.Сервер;
		ДанныеДляОтправкиЗапросаНаПлощадку.Порт                 = СтрокаПлощадок.Порт;
		ДанныеДляОтправкиЗапросаНаПлощадку.ЗащищенноеСоединение = СтрокаПлощадок.ЗащищенноеСоединение;
		
		// таймаут на запрос соответствует оставшемуся времени на получение ответа от площадок
		ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапросов.Таймаут = (ТаймерОкончаниеЗапросаВМиллисекундах - ТекущаяУниверсальнаяДатаВМиллисекундах()) / 1000;
		
		РезультатОтправкиНаПлощадку = ОтправитьЗапросПоКодуМаркировкиНаПлощадку(ДанныеДляОтправкиЗапросаНаПлощадку,
			МассивПлощадокКБлокировке,
			ДанныеШтрихкода,
			СтруктураДополнительныхПараметров,
			КешСоединений);
			
		ОтправленЗапрос             = Истина;
		
		ВозвращаемоеЗначение.АварийныйРежим                 = РезультатОтправкиНаПлощадку.АварийныйРежим;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатОтправкиНаПлощадку.ТребуетсяОбновлениеКлючаСессии;
		
		ВозвращаемоеЗначение.РезультатыОтправкиЗапросов.Добавить(РезультатОтправкиНаПлощадку.РезультатОтправкиЗапроса);
		
		ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки
			+ ?(ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки), Символы.ПС, "")
			+ РезультатОтправкиНаПлощадку.ТекстОшибки;
			
		Для Каждого Запрос Из РезультатОтправкиНаПлощадку.ЗапросыДляЛогирования Цикл
			ЗапросыДляЛогирования.Добавить(Запрос);
		КонецЦикла;
		
		Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
			
			ШтрихкодированиеОбщегоНазначенияИСМП.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
			
			// если была получена ошибка 401 хотя бы по одной площадке - прервать обработку,
			// необходимо обновление ключа сессии
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
		Если ВозвращаемоеЗначение.АварийныйРежим Тогда
			
			ШтрихкодированиеОбщегоНазначенияИСМП.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
			
			// если был получен код 203 хотя бы по одной площадке - прервать обработку,
			// действует аварийный режим
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
		Если Не РезультатОтправкиНаПлощадку.ПараметрыКодаМаркировки = Неопределено Тогда
			
			// по КМ по площадке был получен ответ из ГИС МТ
			ВозвращаемоеЗначение.ПараметрыКодаМаркировки = РезультатОтправкиНаПлощадку.ПараметрыКодаМаркировки;
			
		КонецЕсли;
		
		Если РезультатОтправкиНаПлощадку.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ Тогда
			
			// продажа разрешена как молочка из Беларуси
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
			
		КонецЕсли;
		
		Если Не ПолученОтвет Тогда
			ПолученОтвет = РезультатОтправкиНаПлощадку.ПолученОтветОтГИСМТ;
		КонецЕсли;
		
		Если РезультатОтправкиНаПлощадку.ПерейтиКСледующейПлощадке Тогда
			Продолжить;
		КонецЕсли;
		
		Если РезультатОтправкиНаПлощадку.ПерейтиКСледующемуКМ Тогда
			Прервать;
		КонецЕсли;
		
		Если ПолученОтвет Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОтправленЗапрос И Не ПолученОтвет Тогда
		ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
	КонецЕсли;
	
	ШтрихкодированиеОбщегоНазначенияИСМП.ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
	
	Возврат ВозвращаемоеЗначение;

КонецФункции

Функция ОтправитьЗапросПоКодуМаркировкиНаПлощадку(ДанныеДляОтправкиЗапросаНаПлощадку, МассивПлощадокКБлокировке, ДанныеШтрихкода, СтруктураДополнительныхПараметров, КешСоединений = Неопределено, КешПроверкиПродукцииИзБеларуси = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                         Ложь);
	ВозвращаемоеЗначение.Вставить("ПерейтиКСледующейПлощадке",              Ложь);
	ВозвращаемоеЗначение.Вставить("ПерейтиКСледующемуКМ",                   Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии",         Ложь);
	ВозвращаемоеЗначение.Вставить("ПараметрыКодаМаркировки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ПродажаРазрешенаВОтсутствиеОтветаГИСМТ", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",               Неопределено);
	ВозвращаемоеЗначение.Вставить("ЗапросыДляЛогирования",                  Новый Массив);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                            "");
	ВозвращаемоеЗначение.Вставить("ПолученОтветОтГИСМТ",                    Ложь);
	
	Если КешСоединений = Неопределено Тогда
		Соединение = Неопределено;
	Иначе
		Соединение = КешСоединений.Получить(ДанныеДляОтправкиЗапросаНаПлощадку);
	КонецЕсли;
	
	РезультатЗапроса = ОбменДаннымиИСМПКлиентСервер.ОтправитьДанныеВСервис(
		ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса,
		ДанныеДляОтправкиЗапросаНаПлощадку.ТелоЗапросаJSON,
		ДанныеДляОтправкиЗапросаНаПлощадку.КлючСессии,
		"POST",
		ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапросов,
		ДанныеДляОтправкиЗапросаНаПлощадку.ЗаголовокHTTP,
		,
		Соединение);
	
	Если Не Соединение = Неопределено Тогда
		КешСоединений.Вставить(ДанныеДляОтправкиЗапросаНаПлощадку, Соединение);
	КонецЕсли;
	
	АдресСервера = ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки;
	
	РезультатОтправкиЗапроса = ОбменДаннымиИСМПКлиентСервер.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	ПлощадкиСОшибкамиОбмена = ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП.Получить();
	
	Если ПлощадкиСОшибкамиОбмена = Неопределено Тогда
		
		ПлощадкиСОшибкамиОбмена = Новый Структура();
		ПлощадкиСОшибкамиОбмена.Вставить("ОшибкиПлощадки",      Новый Соответствие);
		ПлощадкиСОшибкамиОбмена.Вставить("НетОтветаПоПлощадке", Новый Соответствие);
		
	ИначеЕсли ТипЗнч(ПлощадкиСОшибкамиОбмена) = Тип("Массив") Тогда
		
		// обратная совместимость - до изменения методических рекомендаций 15.11.2024 в площадках с ошибками обмена
		// был массив с площадками первых ошибок 500
		ТекущийСписок = ОбщегоНазначения.СкопироватьРекурсивно(ПлощадкиСОшибкамиОбмена);
		
		ПлощадкиСОшибкамиОбмена = Новый Структура();
		ПлощадкиСОшибкамиОбмена.Вставить("ОшибкиПлощадки",      Новый Соответствие);
		ПлощадкиСОшибкамиОбмена.Вставить("НетОтветаПоПлощадке", Новый Соответствие);
		
		Для Каждого ТекущаяОшибочнаяПлощадка Из ТекущийСписок Цикл
			ПлощадкиСОшибкамиОбмена.ОшибкиПлощадки.Вставить(ТекущаяОшибочнаяПлощадка, 1);
		КонецЦикла;
		
	КонецЕсли;
	
	МаксимальноеКоличествоОшибокПоПлощадкеДляБлокировки    = 2;
	МаксимальноеКоличествоТаймаутовПоПлощадкеДляБлокировки = 3;
	
	Если Не РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		// ответ не получен, либо таймаут, либо иные проблемы, продолжить в рамках исходного таймера проход по площадкам
		ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке = Истина;
		
		КоличествоТаймаутовПоПлощадке = ПлощадкиСОшибкамиОбмена.НетОтветаПоПлощадке.Получить(ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки);
		
		Если КоличествоТаймаутовПоПлощадке = Неопределено Тогда
			
			// первый таймаут по площадке
			КоличествоТаймаутовПоПлощадке = 1;
			ПлощадкиСОшибкамиОбмена.НетОтветаПоПлощадке.Вставить(ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки, КоличествоТаймаутовПоПлощадке);
			
		Иначе
			
			// повторное получение таймаута по площадке
			КоличествоТаймаутовПоПлощадке = КоличествоТаймаутовПоПлощадке + 1;
			ПлощадкиСОшибкамиОбмена.НетОтветаПоПлощадке.Вставить(ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки, КоличествоТаймаутовПоПлощадке);
			
			Если КоличествоТаймаутовПоПлощадке >= МаксимальноеКоличествоТаймаутовПоПлощадкеДляБлокировки Тогда
				МассивПлощадокКБлокировке.Добавить(ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки);
			КонецЕсли;
			
		КонецЕсли;
		
		ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП = Новый ХранилищеЗначения(ПлощадкиСОшибкамиОбмена);
		
		ПараметрыЗаписиВЛог = ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера, "Таймаут", ДанныеШтрихкода, РезультатОтправкиЗапроса.ТекстОшибки, РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку());
		ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	Если Не РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
		
		ПараметрыЗаписиВЛог = ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера, Формат(РезультатЗапроса.HTTPОтвет.КодСостояния, "ЧГ=0;"), ДанныеШтрихкода, РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку());
		ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
		
		Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
			
			// если нет ключа сессии, остальные коды можно не проверять
			ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			Возврат ВозвращаемоеЗначение;
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 429
			Или Лев(Строка(РезультатОтправкиЗапроса.КодСостояния), 1) = "5" Тогда
			
			Если ТипЗнч(РезультатОтправкиЗапроса.Объект) = Тип("Структура")
				И РезультатОтправкиЗапроса.Объект.Свойство("code")
				И РезультатОтправкиЗапроса.Объект.code = 5000 Тогда
				
				// получение первого ответа 500 по коду товаров из Беларуси
				Если КешПроверкиПродукцииИзБеларуси  = Неопределено Тогда
					
					КешПроверкиПродукцииИзБеларуси = Новый Массив;
					КешПроверкиПродукцииИзБеларуси.Добавить(ДанныеШтрихкода);
				
					РезультатОтправкиНаПлощадку = ОтправитьЗапросПоКодуМаркировкиНаПлощадку(ДанныеДляОтправкиЗапросаНаПлощадку, МассивПлощадокКБлокировке, ДанныеШтрихкода, СтруктураДополнительныхПараметров, КешСоединений, КешПроверкиПродукцииИзБеларуси);
					
					ВозвращаемоеЗначение.АварийныйРежим                 = РезультатОтправкиНаПлощадку.АварийныйРежим;
					ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатОтправкиНаПлощадку.ТребуетсяОбновлениеКлючаСессии;
					
					Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
						Возврат ВозвращаемоеЗначение;
					КонецЕсли;
					
					Если ВозвращаемоеЗначение.АварийныйРежим Тогда
						Возврат ВозвращаемоеЗначение;
					КонецЕсли;
					
					// если повторный запрос по молочке вернул ответ, то он будет действующим
					ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = РезультатОтправкиНаПлощадку.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ;
					ВозвращаемоеЗначение.ПараметрыКодаМаркировки                = РезультатОтправкиНаПлощадку.ПараметрыКодаМаркировки;
					
					ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке = РезультатОтправкиНаПлощадку.ПерейтиКСледующейПлощадке;
					ВозвращаемоеЗначение.ПерейтиКСледующемуКМ      = РезультатОтправкиНаПлощадку.ПерейтиКСледующемуКМ;
					ВозвращаемоеЗначение.ПолученОтветОтГИСМТ       = РезультатОтправкиНаПлощадку.ПолученОтветОтГИСМТ;
					
				Иначе
					
					// получение повторной ошибки 500 по молочке из Беларуси,
					// разрешить продажу
					Если КешПроверкиПродукцииИзБеларуси.Найти(ДанныеШтрихкода) <> Неопределено Тогда
						
						ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
						ВозвращаемоеЗначение.ПерейтиКСледующемуКМ                   = Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Возврат ВозвращаемоеЗначение;
				
			Иначе
			
				// если ошибки обмена, запомнить ошибку и перейти к следующей площадке
				КоличествоОшибокПоПлощадке = ПлощадкиСОшибкамиОбмена.ОшибкиПлощадки.Получить(ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки);
		
				Если КоличествоОшибокПоПлощадке = Неопределено Тогда
					
					// первая ошибка 5хх или 429 по площадке
					КоличествоОшибокПоПлощадке = 1;
					ПлощадкиСОшибкамиОбмена.ОшибкиПлощадки.Вставить(ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки, КоличествоОшибокПоПлощадке);
					
					ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП = Новый ХранилищеЗначения(ПлощадкиСОшибкамиОбмена);
					
					РезультатОтправкиНаПлощадку = ОтправитьЗапросПоКодуМаркировкиНаПлощадку(ДанныеДляОтправкиЗапросаНаПлощадку, МассивПлощадокКБлокировке, ДанныеШтрихкода, СтруктураДополнительныхПараметров, КешСоединений);
					
					ВозвращаемоеЗначение.АварийныйРежим                 = РезультатОтправкиНаПлощадку.АварийныйРежим;
					ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатОтправкиНаПлощадку.ТребуетсяОбновлениеКлючаСессии;
					ВозвращаемоеЗначение.ЗапросыДляЛогирования          = РезультатОтправкиНаПлощадку.ЗапросыДляЛогирования;
					
					Если РезультатОтправкиНаПлощадку.ТребуетсяОбновлениеКлючаСессии Тогда
						Возврат ВозвращаемоеЗначение;
					КонецЕсли;
					
					Если ВозвращаемоеЗначение.АварийныйРежим Тогда
						Возврат ВозвращаемоеЗначение;
					КонецЕсли;
					
					ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = РезультатОтправкиНаПлощадку.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ;
					ВозвращаемоеЗначение.ПараметрыКодаМаркировки                = РезультатОтправкиНаПлощадку.ПараметрыКодаМаркировки;
					
					ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке = РезультатОтправкиНаПлощадку.ПерейтиКСледующейПлощадке;
					ВозвращаемоеЗначение.ПерейтиКСледующемуКМ      = РезультатОтправкиНаПлощадку.ПерейтиКСледующемуКМ;
					ВозвращаемоеЗначение.ПолученОтветОтГИСМТ       = РезультатОтправкиНаПлощадку.ПолученОтветОтГИСМТ;
					
				Иначе
					
					// повторное получение ошибок по площадке
					КоличествоОшибокПоПлощадке = КоличествоОшибокПоПлощадке + 1;
					ПлощадкиСОшибкамиОбмена.ОшибкиПлощадки.Вставить(ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки, КоличествоОшибокПоПлощадке);
					
					Если КоличествоОшибокПоПлощадке >= МаксимальноеКоличествоОшибокПоПлощадкеДляБлокировки Тогда
						МассивПлощадокКБлокировке.Добавить(ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки);
					КонецЕсли;
					
					ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП = Новый ХранилищеЗначения(ПлощадкиСОшибкамиОбмена);
					
					ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
					ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке              = Истина;
					
				КонецЕсли;
				
				Возврат ВозвращаемоеЗначение;
				
			КонецЕсли;
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.АварийныйРежимКодОтветаСервисаГИСМТ() Тогда
			
			// если аварийный режим, остальные коды можно не проверять
			ОбщегоНазначенияИСМП.ВключитьАварийныйРежимРазрешительнойСистемы();
			
			ВозвращаемоеЗначение.АварийныйРежим                         = Истина;
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
			ВозвращаемоеЗначение.ПерейтиКСледующемуКМ                   = Истина;
			
			Возврат ВозвращаемоеЗначение;
			
		Иначе
			
			ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
				ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса,
				РезультатОтправкиЗапроса);
				
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеОбработки = ОбщегоНазначенияИСКлиентСервер.ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, Истина);
	
	Если ДанныеОбработки = Неопределено Тогда
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбщегоНазначенияИСКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(
			ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса,
			РезультатОтправкиЗапроса);
			
		ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке = Истина;
		Возврат ВозвращаемоеЗначение;
		
	Иначе
		
		ДанныеПоКодамМаркировки = ДанныеОбработки.Получить("codes");
		Если ТипЗнч(ДанныеПоКодамМаркировки) = Тип("Массив") Тогда
			
			Для Каждого ЭлементДанных Из ДанныеПоКодамМаркировки Цикл
				
				КодОшибки         = ЭлементДанных["errorCode"];
				СообщениеОбОшибке = ЭлементДанных["message"];
				ТекстОшибки       = "";
				
				Если ЗначениеЗаполнено(КодОшибки) Тогда
					
					ТекстОшибки = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ТекстОшибкиРазрешительногоРежимаПоКодуОшибкиГИСМТ(КодОшибки, СообщениеОбОшибке);
					
					Если ЗначениеЗаполнено(ТекстОшибки) Тогда
						
						ДанныеШтрихкода.ТекстОшибки               = ТекстОшибки;
						ДанныеШтрихкода.КонтролиРазрешительногоРежима.Добавить(ТекстОшибки);
						
					КонецЕсли;
					
					ВозвращаемоеЗначение.ПерейтиКСледующемуКМ = Истина;
					ВозвращаемоеЗначение.ПолученОтветОтГИСМТ  = Истина;
					
				Иначе
					
					ВидПродукцииПоДаннымШтрихкода = КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииПоПодсистеме(ДанныеШтрихкода.ВидПродукции, "ГИСМТ");
					
					ПараметрыКодаМаркировки = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыКодаМаркировкиПоДаннымРазрешительногоРежима(ЭлементДанных, ВидПродукцииПоДаннымШтрихкода, СтруктураДополнительныхПараметров);
					ТекстОшибки = "";
					
					Если Не ЗначениеЗаполнено(ДанныеШтрихкода.ВидПродукции)
						И ЗначениеЗаполнено(ПараметрыКодаМаркировки.ВидПродукции) Тогда
						ДанныеШтрихкода.ВидПродукции = ПараметрыКодаМаркировки.ВидПродукции;
					КонецЕсли;
					
					Если ЭлементДанных["valid"] = Ложь Тогда
						
						ТекстОшибки = НСтр("ru = 'Структура данных кода маркировки некорректна.'");
						
					ИначеЕсли ЭлементДанных["verified"] = Ложь Тогда
						
						ТекстОшибки = НСтр("ru = 'Проверка крипто-подписи кода маркировки в ГИС МТ завершилась с ошибкой.'");
						
					ИначеЕсли ЭлементДанных["found"] = Ложь Тогда
						
						ТекстОшибки = НСтр("ru = 'Код маркировки не найден в ГИС МТ.'");
						
					ИначеЕсли СообщениеОбОшибке <> Неопределено Тогда
						
						ШаблонПодсказки   = НСтр("ru = 'Неклассифицированная ошибка отправки запроса по КМ в ГИС МТ.
						|Описание из сервиса: %1.'");
						
						ТекстОшибки = СтрШаблон(ШаблонПодсказки, СтрЗаменить(СообщениеОбОшибке, Символ(29), ""));
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ТекстОшибки) Тогда
						
						ДанныеШтрихкода.ТекстОшибки = ТекстОшибки;
						ДанныеШтрихкода.КонтролиРазрешительногоРежима.Добавить(ТекстОшибки);
						
					КонецЕсли;
					
					РазрешительныйРежимДатаЗапросаГИСМТ = ДанныеОбработки.Получить("reqTimestamp");
					ПараметрыКодаМаркировки.РазрешительныйРежимДатаЗапросаГИСМТ          = Формат(РазрешительныйРежимДатаЗапросаГИСМТ, "ЧГ=;"); 
					
					ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЗапросаГИСМТ = ДанныеОбработки.Получить("reqId");
					ПараметрыКодаМаркировки.РазрешительныйРежимАдресСервера              = АдресСервера;
					ПараметрыКодаМаркировки.РазрешительныйРежимТелоЗапросаJSON           = РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку();
					ПараметрыКодаМаркировки.РазрешительныйРежимТелоОтветаJSON            = РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
					ПараметрыКодаМаркировки.РазрешительныйРежимКодОтвета                 = Формат(РезультатЗапроса.HTTPОтвет.КодСостояния, "ЧГ=0;");
					
					ВозвращаемоеЗначение.ПараметрыКодаМаркировки = ПараметрыКодаМаркировки;
					ВозвращаемоеЗначение.ПерейтиКСледующемуКМ    = Истина;
					ВозвращаемоеЗначение.ПолученОтветОтГИСМТ     = Истина;
					
					Если СтруктураДополнительныхПараметров.ЛогироватьУспешныеПроверки Тогда
						
						ПараметрыЗаписиВЛог = ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера,
							РезультатОтправкиЗапроса.КодСостояния, ДанныеШтрихкода, ПараметрыКодаМаркировки.РазрешительныйРежимТелоОтветаJSON, 
							ПараметрыКодаМаркировки.РазрешительныйРежимТелоЗапросаJSON, ПараметрыКодаМаркировки.РазрешительныйРежимДатаЗапросаГИСМТ,
							ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЗапросаГИСМТ);
						
						ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
					
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Формирует дополнение строки параметров URL.
// 
// Параметры:
// 	ПараметрыЗапроса - Массив из Строка, Неопределено - Данные параметров запроса
// Возвращаемое значение:
// 	Строка - Срока дополнения.
Функция ПараметрыЗапроса(ПараметрыЗапроса = Неопределено) Экспорт
	
	Если ПараметрыЗапроса <> Неопределено
		И ПараметрыЗапроса.Количество() > 0 Тогда
		Возврат "?" + СтрСоединить(ПараметрыЗапроса, "&");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера, КодОшибки, ДанныеШтрихкода, ТекстОтвета, ТекстЗапроса, ДатаПолученияЗапроса = Неопределено, ИдентификаторЗапросаРазрешения = "")
	
	ПараметрыЗаписиВЛог = ШтрихкодированиеОбщегоНазначенияИСМП.ПараметрыЗаписиОперацииПроверкиКМ();
	
	Если ДатаПолученияЗапроса = Неопределено Тогда
		ДатаПолученияЗапроса = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	ПараметрыЗаписиВЛог.АдресСервераЗапросаРазрешения  = АдресСервера;
	ПараметрыЗаписиВЛог.ИдентификаторЗапросаРазрешения = ИдентификаторЗапросаРазрешения;
	ПараметрыЗаписиВЛог.ВремяЗапросаРазрешения         = ДатаПолученияЗапроса;
	ПараметрыЗаписиВЛог.ЗапросРазрешенияПродажиКМ      = Истина;
	ПараметрыЗаписиВЛог.КодОтветаРазрешения            = КодОшибки;
	ПараметрыЗаписиВЛог.КонтрольнаяМарка               = ДанныеШтрихкода.ПолныйКодМаркировки;
	ПараметрыЗаписиВЛог.НормализованныйШтрихкод        = ДанныеШтрихкода.НормализованныйШтрихкод;
	ПараметрыЗаписиВЛог.Наименование                   = ДанныеШтрихкода.ПредставлениеНоменклатуры;
	ПараметрыЗаписиВЛог.РезультатЗапросаРазрешения     = ТекстОтвета;
	ПараметрыЗаписиВЛог.ТекстЗапросаРазрешения         = ТекстЗапроса;
	
	Возврат ПараметрыЗаписиВЛог;
	
КонецФункции

// Преобразовывает текстовое представление статуса документа в значение перечисления и наоборот.
//
// Параметры:
//  ЗначениеПоиска - ПеречислениеСсылка.СтатусыДокументовИСМП, Строка - значение для перекодировки
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыДокументовИСМП, Строка - статус документа.
Функция СтатусДокумента(Знач ЗначениеПоиска) Экспорт
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("Строка") Тогда
		ЗначениеПоиска = ВРег(ЗначениеПоиска);
		Если ЗначениеПоиска = "CHECKED_OK" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.Проверен;
		ИначеЕсли ЗначениеПоиска = "CHECKED_NOT_OK" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.ЕстьОшибки;
		ИначеЕсли ЗначениеПоиска = "IN_PROGRESS" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.Обрабатывается;
		ИначеЕсли ЗначениеПоиска = "PROCESSING_ERROR" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.Ошибка;
		ИначеЕсли ЗначениеПоиска = "UNDEFINED" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.Неопределен;
		ИначеЕсли ЗначениеПоиска = "WAIT_ACCEPTANCE" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.ОжидаетсяПодтверждениеПоступления;
		ИначеЕсли ЗначениеПоиска = "WAIT_PARTICIPANT_REGISTRATION" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.ОжидаетРегистрациюУчастникаГИСМТ;
		ИначеЕсли ЗначениеПоиска = "CANCELLED" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.Отменен;
		ИначеЕсли ЗначениеПоиска = "ACCEPTED" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.Принят;
		ИначеЕсли ЗначениеПоиска = "WAIT_FOR_CONTINUATION" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.ОжидаетПродолженияПроцессингаДокумента;
		ИначеЕсли ЗначениеПоиска = "PARSE_ERROR" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.Ошибка;
		ИначеЕсли ЗначениеПоиска = "REVERSED" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.Сторнирован;
		ИначеЕсли ЗначениеПоиска = "FAILED" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.Ошибка;
		ИначеЕсли ЗначениеПоиска = "SUCCESS" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.Проверен;
		ИначеЕсли ЗначениеПоиска = "PARTIALLY" Тогда
			Возврат Перечисления.СтатусыДокументовИСМП.ОбработанЧастично;
		КонецЕсли;
	Иначе
		Если ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Проверен Тогда
			Возврат "CHECKED_OK";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.ЕстьОшибки Тогда
			Возврат "CHECKED_NOT_OK";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Обрабатывается Тогда
			Возврат "IN_PROGRESS";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Ошибка Тогда
			Возврат "PROCESSING_ERROR";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Неопределен Тогда
			Возврат "UNDEFINED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.ОжидаетсяПодтверждениеПоступления Тогда
			Возврат "WAIT_ACCEPTANCE";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.ОжидаетРегистрациюУчастникаГИСМТ Тогда
			Возврат "WAIT_PARTICIPANT_REGISTRATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Отменен Тогда
			Возврат "CANCELLED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Принят Тогда
			Возврат "ACCEPTED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.ОжидаетПродолженияПроцессингаДокумента Тогда
			Возврат "WAIT_FOR_CONTINUATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Сторнирован Тогда
			Возврат "REVERSED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Ошибка Тогда
			Возврат "FAILED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.Проверен Тогда
			Возврат "SUCCESS";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыДокументовИСМП.ОбработанЧастично Тогда
			Возврат "PARTIALLY";
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус документа: %1'"),
			ЗначениеПоиска);
	
КонецФункции

// Преобразовывает текстовое представление типа документа в значение перечисления и наоборот.
//
// Параметры:
//  ЗначениеПоиска      - ПеречислениеСсылка.ВидыОперацийИСМП, Строка - значение для перекодировки.
//	ВидПродукции        - Неопределено, СправочникСсылка.ВидыПродукцииИС - Вид продукции.
//	ОбъемноСортовойУчет - Булево - Признак объемно-сортового учета.
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыОперацийИСМП, Строка - Тип документа.
Функция ВидОперации(Знач ЗначениеПоиска, ВидПродукции = Неопределено, ОбъемноСортовойУчет = Ложь) Экспорт
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("Строка") Тогда
		ЗначениеПоиска = ВРег(ЗначениеПоиска);
		Если ЗначениеПоиска = "LP_INTRODUCE_GOODS" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФ;
		ИначеЕсли ЗначениеПоиска = "LP_GOODS_IMPORT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС;
		ИначеЕсли ЗначениеПоиска = "LP_FTS_INTRODUCE" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТС;
		ИначеЕсли ЗначениеПоиска = "FURS_FTS_INTRODUCE" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТСМех;
		ИначеЕсли ЗначениеПоиска = "LK_CONTRACT_COMMISSIONING" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговору;
		ИначеЕсли ЗначениеПоиска = "LK_INDI_COMMISSIONING" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотПолучениеПродукцииОтФизическихЛиц;
		ИначеЕсли ЗначениеПоиска = "LP_INTRODUCE_OST" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков;
		ИначеЕсли ЗначениеПоиска = "CROSSBORDER" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля;
		ИначеЕсли ЗначениеПоиска = "LP_SHIP_GOODS" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "LP_SHIP_GOODS_CROSSBORDER" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "EAS_CROSSBORDER" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "EAS_GTIN_CROSSBORDER_ACCEPTANCE" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "LP_SHIP_RECEIPT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "LP_CANCEL_SHIPMENT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "LP_CANCEL_SHIPMENT_CROSSBORDER" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "LP_ACCEPT_GOODS" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "LK_REMARK" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.Перемаркировка;
		ИначеЕсли ЗначениеПоиска = "LK_KM_CANCELLATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.СписаниеЧерезГИСМТ;
		ИначеЕсли ЗначениеПоиска = "LK_APPLIED_KM_CANCELLATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.УдалитьСписаниеВведенныхВОборотКодовМаркировки;
		ИначеЕсли ЗначениеПоиска = "AGGREGATION_DOCUMENT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АгрегацияСоздание;
		ИначеЕсли ЗначениеПоиска = "SETS_AGGREGATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АгрегацияСозданиеНабора;
		ИначеЕсли ЗначениеПоиска = "DISAGGREGATION_DOCUMENT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АгрегацияУдаление;
		ИначеЕсли ЗначениеПоиска = "REAGGREGATION_DOCUMENT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АгрегацияИзменение;
		ИначеЕсли ЗначениеПоиска = "OST_DESCRIPTION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировкиЗапросGTINНаОстатки;
		ИначеЕсли ЗначениеПоиска = "LK_RECEIPT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВыводИзОборота;
		ИначеЕсли ЗначениеПоиска = "LP_RETURN" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВозвратВОборот;
		ИначеЕсли ЗначениеПоиска = "ATK_AGGREGATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АТКСоздание;
		ИначеЕсли ЗначениеПоиска = "ATK_TRANSFORMATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АТКИзменение;
		ИначеЕсли ЗначениеПоиска = "ATK_DISAGGREGATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АТКУдаление;
		ИначеЕсли ЗначениеПоиска = "LK_GTIN_RECEIPT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВыводИзОборота;
		ИначеЕсли ЗначениеПоиска = "LK_GTIN_RECEIPT_CANCEL" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПриОСУАннулирование;
		ИначеЕсли ЗначениеПоиска = "LK_INDIVIDUALIZATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ИндивидуализацияКИЗ;
		ИначеЕсли ЗначениеПоиска = "CIRCULATION_INFORMATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.СведенияОКодахИдентификацииДляВводаВОборот;
		ИначеЕсли ЗначениеПоиска = "CIRCULATION_INFORMATION_2" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.СведенияОРазрешительнойДокументацииДляВводаВОборот;
		ИначеЕсли ЗначениеПоиска = "REPORT_REWEIGHING" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ОтчетОПеревзвешивании;
		ИначеЕсли ЗначениеПоиска = "CIS_INFORMATION_CHANGE" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМ;
		ИначеЕсли ЗначениеПоиска = "CONNECT_TAP" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВскрытиеПотребительскойУпаковки;
		ИначеЕсли ЗначениеПоиска = "WRITE_OFF" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.СписаниеЧерезГИСМТОбщийДокумент;
		ИначеЕсли ЗначениеПоиска = "FIXATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОДПредварительнаяОтгрузка;
		ИначеЕсли ЗначениеПоиска = "UNIVERSAL_TRANSFER_DOCUMENT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОД;
		ИначеЕсли ЗначениеПоиска = "UNIVERSAL_TRANSFER_DOCUMENT_FIX" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОДИсправление;
		ИначеЕсли ЗначениеПоиска = "FIXATION_CANCEL" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОДОтменаПредварительнойОтгрузки;
		ИначеЕсли ЗначениеПоиска = "CIS_NOTICE" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.УведомлениеОбОтгрузкеНаЭкспорт;
		ИначеЕсли ЗначениеПоиска = "ACCOUNTING" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		КонецЕсли;
	Иначе
		Если ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФ Тогда
			Возврат "LP_INTRODUCE_GOODS";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС Тогда
			Возврат "LP_GOODS_IMPORT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТС Тогда
			Возврат "LP_FTS_INTRODUCE";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТСМех Тогда
			Возврат "FURS_FTS_INTRODUCE";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговору
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика Тогда
			Возврат "LK_CONTRACT_COMMISSIONING";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотПолучениеПродукцииОтФизическихЛиц Тогда
			Возврат "LK_INDI_COMMISSIONING";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков Тогда
			Возврат "LP_INTRODUCE_OST";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля Тогда
			Возврат "CROSSBORDER";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ИндивидуализацияКИЗ Тогда
			Возврат "LK_INDIVIDUALIZATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаПродажа
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаКомиссия
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаАгент Тогда
			Возврат "LP_SHIP_GOODS";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаБезвозмезднаяПередача
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаДляСобственныхНуждПокупателя
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаПриобретениеГосПредприятием Тогда
			Возврат "LP_SHIP_RECEIPT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаЕАЭССПризнаниемКИ Тогда
			Возврат "EAS_CROSSBORDER_EXPORT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаВЕАЭСПриОСУ Тогда
			Возврат "EAS_GTIN_CROSSBORDER_EXPORT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаТрансграничнаяТорговля Тогда
			Возврат "LP_SHIP_GOODS_CROSSBORDER";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаАннулирование Тогда
			Возврат "LP_CANCEL_SHIPMENT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаТрансграничнаяТорговляАннулирование Тогда
			Возврат "LP_CANCEL_SHIPMENT_CROSSBORDER";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭСПриОСУ Тогда
			Возврат "EAS_GTIN_CROSSBORDER_ACCEPTANCE";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаПродажа
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаТрансграничнаяТорговля
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаКомиссия
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаБезвозмезднаяПередача
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаАгент
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭССПризнаниемКМ Тогда
			Возврат "LP_ACCEPT_GOODS";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаОтклонен Тогда
			
			Если ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС() Тогда
				МодульКонструкторИСМПКлиентСервер = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("КонструкторИСМПКлиентСервер");
				ИмяОперации = МодульКонструкторИСМПКлиентСервер.ИмяОперацииГИСМТ(ВидПродукции, ЗначениеПоиска);
			КонецЕсли;
			Если ЗначениеЗаполнено(ИмяОперации) Тогда
				Возврат ИмяОперации;
			Иначе
				Возврат "LP_ACCEPT_GOODS";
			КонецЕсли;
			
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.Перемаркировка Тогда
			Возврат "LK_REMARK";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.УдалитьСписаниеЭмитированныхКодовМаркировкиПриПоступлении
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.СписаниеЧерезСУЗМех
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.СписаниеЧерезГИСМТ Тогда
			Возврат "LK_KM_CANCELLATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.УдалитьСписаниеВведенныхВОборотКодовМаркировки Тогда
			Возврат "LK_APPLIED_KM_CANCELLATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АгрегацияСоздание Тогда
			Возврат "AGGREGATION_DOCUMENT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АгрегацияСозданиеНабора Тогда
			Возврат "SETS_AGGREGATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АгрегацияУдаление Тогда
			Возврат "DISAGGREGATION_DOCUMENT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АгрегацияИзменение Тогда
			Возврат "REAGGREGATION_DOCUMENT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировкиЗапросGTINНаОстатки Тогда
			Возврат "OST_DESCRIPTION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков Тогда
			Возврат "LP_INTRODUCE_OST";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборота  Тогда
			Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ВидПродукции) Тогда
				Возврат "WRITE_OFF";
			ИначеЕсли ОбъемноСортовойУчет Тогда
				Возврат "LK_GTIN_RECEIPT";
			Иначе
				Возврат "LK_RECEIPT";
			КонецЕсли;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПриОСУАннулирование Тогда
			Возврат "LK_GTIN_RECEIPT_CANCEL";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВозвратВОборот Тогда
			Возврат "LP_RETURN";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АТКСоздание Тогда
			Возврат "ATK_AGGREGATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АТКИзменение Тогда
			Возврат "ATK_TRANSFORMATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АТКУдаление Тогда
			Возврат "ATK_DISAGGREGATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.СведенияОКодахИдентификацииДляВводаВОборот Тогда
			Возврат "CIRCULATION_INFORMATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.СведенияОРазрешительнойДокументацииДляВводаВОборот Тогда
			Возврат "CIRCULATION_INFORMATION_2";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтчетОПеревзвешивании Тогда
			Возврат "REPORT_REWEIGHING";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМ
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодности
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодностиВСД
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМФактическийВес Тогда
			Возврат "CIS_INFORMATION_CHANGE";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВскрытиеПотребительскойУпаковки Тогда
			Возврат "CONNECT_TAP";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.УдалитьСписаниеКодовВыбывшихДоОбязательностиМаркировки
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.СписаниеЧерезГИСМТОбщийДокумент Тогда
			Возврат "WRITE_OFF";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОДПредварительнаяОтгрузка
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.РазрешениеНаОтгрузку Тогда
			Возврат "FIXATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОД Тогда
			Возврат "UNIVERSAL_TRANSFER_DOCUMENT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОДИсправление Тогда
			Возврат "UNIVERSAL_TRANSFER_DOCUMENT_FIX";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПеремещениеМеждуМОДОтменаПредварительнойОтгрузки
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.РазрешениеНаОтгрузкуАннулирование Тогда
			Возврат "FIXATION_CANCEL";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.УведомлениеОбОтгрузкеНаЭкспорт
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтменаУведомленияОбОтгрузкеНаЭкспорт Тогда
			Возврат "CIS_NOTICE";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотСырьяОстатки
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотСырьяПолучениеТовараВнеЕАЭС
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотСырьяПолучениеТовараИзЕАЭС
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотСырьяПроизводствоРФ Тогда
			Возврат "ACCOUNTING";
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный вид операции: %1'"),
			ЗначениеПоиска);
	
КонецФункции

#КонецОбласти
