
&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _КлиентскиеВызовы;

&НаКлиенте
Перем _Платформа;

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		Модуль_Ядро = Модуль_Ядро();
		_ОбработкаОбъект.ИнициализироватьМодуль(Модуль_Ядро); 
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ОбщийКонтекстКлиентСервер") Тогда
		ОбщийКонтекстКлиентСервер = Параметры.ОбщийКонтекстКлиентСервер;
	КонецЕсли;
	Если Параметры.Свойство("СтрокаСписка") Тогда
		СтрокаСписка = Параметры.СтрокаСписка;
	КонецЕсли;
	
	ИнициализироватьПараметры();
	ИнициализироватьСписокДокументов();
	ВидимостьПоРежимуПодбора();
		
КонецПроцедуры

&НаСервере
Процедура ВидимостьПоРежимуПодбора()
	
	Если РежимПодбораИзЭТрН Тогда
		
		Элементы.ОтборРежимПодбора.Видимость = Ложь;
		
		Элементы.ВыполнитьСозданиеЭТрН.Видимость = Истина;
		Элементы.ВыполнитьСозданиеЭТрН.Заголовок = "Перенести в ЭТрН";
		Элементы.ВыполнитьСозданиеЭТрНДляКаждогоДокумента.Видимость = Ложь;

		Элементы.ВыполнитьСозданиеЗаказаЗаявки.Видимость = Ложь;
		Элементы.ВыполнитьСозданиеЗаказЗаявкиДляКаждогоДокумента.Видимость = Ложь;

		Элементы.ВыполнитьСозданиеЭПЭ.Видимость = Ложь;
		Элементы.ВыполнитьСозданиеЭПЭДляКаждогоДокумента.Видимость = Ложь;
		
	ИначеЕсли РежимПодбораИзЗЗ Тогда
		
		Элементы.ОтборРежимПодбора.Видимость = Ложь;
		
		Элементы.ВыполнитьСозданиеЭТрН.Видимость = Ложь;
		Элементы.ВыполнитьСозданиеЭТрНДляКаждогоДокумента.Видимость = Ложь;

		Элементы.ВыполнитьСозданиеЗаказаЗаявки.Видимость = Истина;
		Элементы.ВыполнитьСозданиеЗаказаЗаявки.Заголовок = "Перенести в Заказ-Заявку";
		Элементы.ВыполнитьСозданиеЗаказЗаявкиДляКаждогоДокумента.Видимость = Ложь;
		
		Элементы.ВыполнитьСозданиеЭПЭ.Видимость = Ложь;
		Элементы.ВыполнитьСозданиеЭПЭДляКаждогоДокумента.Видимость = Ложь;
		
	ИначеЕсли РежимПодбораИзЭПЭ Тогда
		
		Элементы.ОтборРежимПодбора.Видимость = Ложь;
		
		Элементы.ВыполнитьСозданиеЭТрН.Видимость = Ложь;
		Элементы.ВыполнитьСозданиеЭТрНДляКаждогоДокумента.Видимость = Ложь;

		Элементы.ВыполнитьСозданиеЗаказаЗаявки.Видимость = Ложь;
		Элементы.ВыполнитьСозданиеЗаказЗаявкиДляКаждогоДокумента.Видимость = Ложь;

		Элементы.ВыполнитьСозданиеЭПЭ.Видимость = Истина;
		Элементы.ВыполнитьСозданиеЭПЭ.Заголовок = "Перенести в ЭПЭ";
		Элементы.ВыполнитьСозданиеЭПЭДляКаждогоДокумента.Видимость = Истина;
		
	ИначеЕсли ОтборРежимПодбора = "ЭТрН" Тогда
		
		Элементы.ВыполнитьСозданиеЭТрН.Видимость = Истина;
		Элементы.ВыполнитьСозданиеЭТрНДляКаждогоДокумента.Видимость = Истина;
		
		Элементы.ВыполнитьСозданиеЗаказаЗаявки.Видимость = Ложь;
		Элементы.ВыполнитьСозданиеЗаказЗаявкиДляКаждогоДокумента.Видимость = Ложь;
		
		Элементы.ВыполнитьСозданиеЭПЭ.Видимость = Ложь;
		Элементы.ВыполнитьСозданиеЭПЭДляКаждогоДокумента.Видимость = Ложь;
		
	ИначеЕсли ОтборРежимПодбора = "ЭЗЗ" Тогда
		
		Элементы.ВыполнитьСозданиеЭТрН.Видимость = Ложь;
		Элементы.ВыполнитьСозданиеЭТрНДляКаждогоДокумента.Видимость = Ложь;
		
		Элементы.ВыполнитьСозданиеЗаказаЗаявки.Видимость = Истина;
 		Элементы.ВыполнитьСозданиеЗаказЗаявкиДляКаждогоДокумента.Видимость = Истина;

		Элементы.ВыполнитьСозданиеЭПЭ.Видимость = Ложь;
		Элементы.ВыполнитьСозданиеЭПЭДляКаждогоДокумента.Видимость = Ложь;

	ИначеЕсли ОтборРежимПодбора = "ЭПЭ" Тогда
		
		Элементы.ВыполнитьСозданиеЭТрН.Видимость = Ложь;
		Элементы.ВыполнитьСозданиеЭТрНДляКаждогоДокумента.Видимость = Ложь;
		
		Элементы.ВыполнитьСозданиеЗаказаЗаявки.Видимость = Ложь;
		Элементы.ВыполнитьСозданиеЗаказЗаявкиДляКаждогоДокумента.Видимость = Ложь;
		
		Элементы.ВыполнитьСозданиеЭПЭ.Видимость = Истина;
		Элементы.ВыполнитьСозданиеЭПЭДляКаждогоДокумента.Видимость = Истина;

	ИначеЕсли ОтборРежимПодбора = "" Тогда
		
		Элементы.ВыполнитьСозданиеЭТрН.Видимость = Истина;
		Элементы.ВыполнитьСозданиеЭТрНДляКаждогоДокумента.Видимость = Истина;
		
		Элементы.ВыполнитьСозданиеЗаказаЗаявки.Видимость = Истина;
 		Элементы.ВыполнитьСозданиеЗаказЗаявкиДляКаждогоДокумента.Видимость = Истина;

		Элементы.ВыполнитьСозданиеЭПЭ.Видимость = Истина;
 		Элементы.ВыполнитьСозданиеЭПЭДляКаждогоДокумента.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьФорму(ФормаКлиентскиеВызовы, Модуль_Платформа) Экспорт
	
	_КлиентскиеВызовы = ФормаКлиентскиеВызовы;
	_Платформа = Модуль_Платформа;
	
КонецПроцедуры

&НаСервере
Функция Модуль_Ядро() Экспорт
	
	Результат = Неопределено;
	
	АдресОбработкиЯдра = СвойствоСтруктуры(ОбщийКонтекстКлиентСервер, "АдресОбработкиЯдра");
	
	Если ЗначениеЗаполнено(АдресОбработкиЯдра) Тогда
		Результат = ХранилищеОбработки_Прочитать(АдресОбработкиЯдра);
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_Платформа() Экспорт
	Возврат _Платформа;
КонецФункции

// Возвращает объект обработки из временного хранилища
//
// Параметры:
//  АдресОбработки - Строка - адрес обработки во временном хранилище
// 
// Возвращаемое значение:
//  ОбработкаОбъект - если обект обработки все еще загружен в память
//  Неопределено    - если объект обработки уже уничтожен
//
&НаСервере
Функция ХранилищеОбработки_Прочитать(АдресОбработки)
	
	СтруктураОбработки = ПолучитьИзВременногоХранилища(АдресОбработки);
	
	Результат = СвойствоСтруктуры(СтруктураОбработки, "ОбработкаОбъект");
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
// 
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Имя ключа структуры,
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в структуре нет указанного свойства.
// 
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
&НаСервере
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем Значение;
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ЭтоСтруктура(Структура) И ЗначениеЗаполнено(Ключ) Тогда
		
		Если Структура.Свойство(Ключ, Значение) Тогда
			Результат = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение структурой или фиксированной структурой.
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить.
// 
// Возвращаемое значение:
//   Булево - Истина, если переданое значение является структрой или фиксированной структурой.
//
&НаСервере
Функция ЭтоСтруктура(Значение)
	
	Результат = Ложь;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура")
		Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтрСоединитьЛок(Строки, Разделитель = "")
	
	// Аналог: ЭДО_Служебные_МассивВСтроку
	// Отличия:
	// По умолчанию Разделитель = "", раньше Разделитель = Символы.ПС;
	// В параметр "Строки" не поддерживает тип "Строка".
	
	Результат		 = "";
	ТекРазделитель	 = "";
	
	Если ЗначениеЗаполнено(Строки) Тогда
		
		Для Каждого Строка Из Строки Цикл
			
			Если ЗначениеЗаполнено(Строка) Тогда
				Результат		 = Результат + ТекРазделитель + Строка;
				ТекРазделитель	 = Разделитель;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтрШаблонЛок(ШаблонСтроки, Параметр1
	, Параметр2 = Неопределено
	, Параметр3 = Неопределено
	, Параметр4 = Неопределено
	, Параметр5 = Неопределено
	, Параметр6 = Неопределено) Экспорт
	
	Результат = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	Результат = СтрЗаменить(Результат	, "%2", Параметр2);
	Результат = СтрЗаменить(Результат	, "%3", Параметр3);
	Результат = СтрЗаменить(Результат	, "%4", Параметр4);
	Результат = СтрЗаменить(Результат	, "%5", Параметр5);
	Результат = СтрЗаменить(Результат	, "%6", Параметр6);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьСозданиеЭТрН(Команда)
	
	ДокументыОснования = ДокументыКОбработке(Истина, Ложь, Ложь);
	Если ДокументыОснования.Количество() > 0 Тогда

		ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().СоздатьОдинЭТРН;
		Метрика_ПриВыполненииСозданияПеревозочныхДокументов(ДействиеМетрики, ДокументыОснования);
		
		Результат = Новый Структура;
		Результат.Вставить("ВидПакетаID", _КлиентскиеВызовы.ИдентификаторПакетаЭТрН()); 
		Результат.Вставить("ДокументыОснования", ДокументыОснования);
		ОповеститьОВыборе(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСозданиеЭТрНДляКаждогоДокумента(Команда)
	
	// поддержка только 1 сценария: Простая отгрузка, экспедитор агент. Отгрузка со своего склада, 
	// мы подписываем документы остальные включим после поддержки диадок.апи.
	ТекущийСценарий = Новый Структура;
	ТекущийСценарий.Вставить("КтоЗаказываетПеревозку", "Мы");
	ТекущийСценарий.Вставить("МестоФактическойПогрузки", "НашСклад");
	ТекущийСценарий.Вставить("РольЭкспедитора", "ТолькоСопровождает");
	ДополнительныеПараметры = Новый Структура;
	ПеревозочныеДокументы_ПослеВыбораСценария(ТекущийСценарий, ДополнительныеПараметры); 
	
	// поддержка всех сценариев
	//Модуль_Платформа = Модуль_Платформа();
	//ДополнительныеПараметры = Новый Структура;
	//ОповещениеПослеЗакрытия = Новый ОписаниеОповещения("ПеревозочныеДокументы_ПослеВыбораСценария", ЭтаФорма, ДополнительныеПараметры);
	//ПараметрыФормы = Новый Структура;
	//Модуль_Платформа.ПеревозочныеДокументы_ОткрытьФормуВыбораСценария(ПараметрыФормы, ЭтаФорма, ОповещениеПослеЗакрытия); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозочныеДокументы_ПослеВыбораСценария(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда

		Модуль_Платформа = Модуль_Платформа();

		ТекущийСценарий = Результат;
		
		ДокументыОснования = ДокументыКОбработке(Истина, Ложь, Ложь);
		Если ДокументыОснования.Количество() > 0 Тогда
			
			ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().СоздатьНесколькоЭТРН;
			Метрика_ПриВыполненииСозданияПеревозочныхДокументов(ДействиеМетрики, ДокументыОснования);
			
			ВыполнитьСозданиеТрНДляКаждогоДокументаНаСервере(ДокументыОснования, ТекущийСценарий);
			
			ЭтаФорма.Закрыть(Истина);
			
		КонецЕсли;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСозданиеТрНДляКаждогоДокументаНаСервере(ДокументыОснования, ТекущийСценарий)
	
	ОбработкаОбъект().СоздатьТрНДляКаждогоДокумента(ДокументыОснования, ТекущийСценарий);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСозданиеЗаказЗаявкиДляКаждогоДокумента(Команда)
	
	ДокументыОснования = ДокументыКОбработке(Ложь, Истина, Ложь);
	Если ДокументыОснования.Количество() > 0 Тогда
		
		ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().СоздатьНесколькоЗЗ;
		Метрика_ПриВыполненииСозданияПеревозочныхДокументов(ДействиеМетрики, ДокументыОснования);
		
		ВыполнитьСозданиеЗаказЗаявкиДляКаждогоДокументаНаСервере(ДокументыОснования);
		
		ЭтаФорма.Закрыть(Истина);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьСозданиеЗаказЗаявкиДляКаждогоДокументаНаСервере(ДокументыОснования)
	
	ОбработкаОбъект().СоздатьЗЗДляКаждогоДокумента(ДокументыОснования);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСозданиеЭПЭ(Команда)
	
	ДокументыОснования = ДокументыКОбработке(Ложь, Ложь, Истина);
	Если ДокументыОснования.Количество() > 0 Тогда

		ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().СоздатьОдинЭПЭ;
		Метрика_ПриВыполненииСозданияПеревозочныхДокументов(ДействиеМетрики, ДокументыОснования);
		
		Результат = Новый Структура;
		Результат.Вставить("ВидПакетаID", _КлиентскиеВызовы.ИдентификаторПакетаЭПЭ()); 
		Результат.Вставить("ДокументыОснования", ДокументыОснования);
		ОповеститьОВыборе(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСозданиеЭПЭДляКаждогоДокумента(Команда)
	
	ДокументыОснования = ДокументыКОбработке(Ложь, Ложь, Истина);
	Если ДокументыОснования.Количество() > 0 Тогда
		
		ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().СоздатьНесколькоЭПЭ;
		Метрика_ПриВыполненииСозданияПеревозочныхДокументов(ДействиеМетрики, ДокументыОснования);
		
		ВыполнитьСозданиеЭПЭДляКаждогоДокументаНаСервере(ДокументыОснования);
		
		ЭтаФорма.Закрыть(Истина);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьСозданиеЭПЭДляКаждогоДокументаНаСервере(ДокументыОснования)
	
	ОбработкаОбъект().СоздатьПЭДляКаждогоДокумента(ДокументыОснования);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
 	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораПериода", ЭтаФорма);
 	Диалог = Новый ДиалогРедактированияСтандартногоПериода;  
    Диалог.Период = Период;
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПериода(РезультатВыбораПериода, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбораПериода <> Неопределено Тогда
		
		Период = РезультатВыбораПериода;
		
		УстановитьПараметрыСпискаДокументов();
		
		УстановитьЗаголовокКнопкиПериода();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьЗаголовокКнопкиПериода()
	
	Элементы.ВыбратьПериод.Заголовок = ЗаголовокКнопкиВыбораПериода();
	
КонецПроцедуры

&НаКлиенте
Функция ЗаголовокКнопкиВыбораПериода()
	
	ТекстРежимОтбораПоПериоду = "по дате документа";
	
	Результат = СтруктураПериода().Представление + " " + "(" + ТекстРежимОтбораПоПериоду + ")";
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтруктураПериода()
	
	ДатаНачала		 = Период.ДатаНачала;
	ДатаОкончания	 = Период.ДатаОкончания;
	
	Если ДатаОкончания < ДатаНачала Тогда
		ДатаОкончания = '00010101';
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = КонецДня(ДатаОкончания);
	КонецЕсли;
	
	Представление = ПредставлениеПериода(ДатаНачала, ДатаОкончания);
	
	Если НЕ ЗначениеЗаполнено(Представление) Тогда
		Представление = "<период не установлен>";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = КонецДня('39990101');
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаНачала",	ДатаНачала);
	Результат.Вставить("ДатаОкончания",	ДатаОкончания);
	Результат.Вставить("Представление",	Представление);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьСозданиеЗаказаЗаявки(Команда)
	
	ДокументыОснования = ДокументыКОбработке(Ложь, Истина, Ложь);
	Если ДокументыОснования.Количество() > 0 Тогда
		
		ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().СоздатьОдинЗЗ;
		Метрика_ПриВыполненииСозданияПеревозочныхДокументов(ДействиеМетрики, ДокументыОснования);
		
		Результат = Новый Структура;
		Результат.Вставить("ВидПакетаID", _КлиентскиеВызовы.ИдентификаторПакетаЗаказЗаявка()); 
		Результат.Вставить("ДокументыОснования", ДокументыОснования);
		ОповеститьОВыборе(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодбора(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Метрика_НаименованиеФормы", Метрика_НаименованиеФормы());
	
	ДополнительныеПараметры = Новый Структура;
	
	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеЗакрытияНастройкиПодбора", ЭтаФорма, ДополнительныеПараметры);
	
	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаНастройкиПодбораДокументов", ПараметрыФормы, ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаСервере
Функция ИмяОбработки()
	
	Возврат РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя();
	
КонецФункции

&НаКлиенте
Процедура Оповещение_ПослеЗакрытияНастройкиПодбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	ИнициализироватьСписокДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;                                                  
	ВыбраннаяСтрока = Элемент.ТекущиеДанные;
	
	Если ВыбраннаяСтрока <> Неопределено Тогда
		
		Если Поле.Имя = "СписокДокументовСсылка"
			И ЗначениеЗаполнено(ВыбраннаяСтрока.Ссылка) Тогда
			
			ОткрытьВыбранныйДокумент();
						
		Иначе
			
 		   ДобавитьВыбранныйДокумент();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыбранныйДокумент()
		
	ВыделенныеСтроки = Элементы.СписокДокументов.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 0 Тогда
		Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
			ТекущиеДанные = Элементы.СписокДокументов.ДанныеСтроки(ИдентификаторСтроки);
			
			Если ТекущиеДанные <> Неопределено Тогда 
				ВыбранныйДокумент = ТекущиеДанные.Ссылка;
				ЕстьЭТрН = ТекущиеДанные.ЕстьЭТрН;
				ЕстьЭЗЗ = ТекущиеДанные.ЕстьЭЗЗ;
				ЕстьЭПЭ = ТекущиеДанные.ЕстьЭПЭ;
				
				Поиск = Новый Структура;
				Поиск.Вставить("Документ", ВыбранныйДокумент);
				Если СписокВыбранныхДокументов.НайтиСтроки(Поиск).Количество() = 0 Тогда
					НоваяСтрока = СписокВыбранныхДокументов.Добавить();                                   
					НоваяСтрока.Документ = ВыбранныйДокумент; 
					НоваяСтрока.ЕстьЭТрН = ЕстьЭТрН; 
					НоваяСтрока.ЕстьЭЗЗ = ЕстьЭЗЗ; 
					НоваяСтрока.ЕстьЭПЭ = ЕстьЭПЭ; 
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДокументыКОбработке(ЭтоЭТрН, ЭтоЭЗЗ, ЭтоЭПЭ)

	ДокументыОснования = Новый Массив;
	ОформленныеДокументы = Новый Массив;
	
	Если СписокВыбранныхДокументов.Количество() = 0 Тогда
		
		ВыделенныеСтроки = Элементы.СписокДокументов.ВыделенныеСтроки;
		Если ВыделенныеСтроки.Количество() > 0 Тогда
			Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
				ТекущиеДанные = Элементы.СписокДокументов.ДанныеСтроки(ИдентификаторСтроки);
				
				Если ТекущиеДанные <> Неопределено Тогда 
					ВыбранныйДокумент = ТекущиеДанные.Ссылка;
					ЕстьЭТрН = ТекущиеДанные.ЕстьЭТрН;
					ЕстьЭЗЗ = ТекущиеДанные.ЕстьЭЗЗ;
					ЕстьЭПЭ = ТекущиеДанные.ЕстьЭПЭ;
					Если ЭтоЭТрН И Не ЕстьЭТрН Тогда
						ДокументыОснования.Добавить(ВыбранныйДокумент);
					ИначеЕсли ЭтоЭТрН И ЕстьЭТрН Тогда
						ОформленныеДокументы.Добавить(ВыбранныйДокумент);
					ИначеЕсли ЭтоЭЗЗ И Не ЕстьЭЗЗ Тогда
						ДокументыОснования.Добавить(ВыбранныйДокумент);
					ИначеЕсли ЭтоЭЗЗ И ЕстьЭЗЗ Тогда
						ОформленныеДокументы.Добавить(ВыбранныйДокумент);
					ИначеЕсли ЭтоЭПЭ И Не ЕстьЭПЭ Тогда
						ДокументыОснования.Добавить(ВыбранныйДокумент);
					ИначеЕсли ЭтоЭПЭ И ЕстьЭПЭ Тогда
						ОформленныеДокументы.Добавить(ВыбранныйДокумент);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		Для Каждого СтрокаДокумент Из СписокВыбранныхДокументов Цикл
			Если ЭтоЭТрН И Не СтрокаДокумент.ЕстьЭТрН Тогда
				ДокументыОснования.Добавить(СтрокаДокумент.Документ);
			ИначеЕсли ЭтоЭТрН И СтрокаДокумент.ЕстьЭТрН Тогда
				ОформленныеДокументы.Добавить(СтрокаДокумент.Документ);
			ИначеЕсли ЭтоЭЗЗ И Не СтрокаДокумент.ЕстьЭЗЗ Тогда
				ДокументыОснования.Добавить(СтрокаДокумент.Документ);
			ИначеЕсли ЭтоЭЗЗ И СтрокаДокумент.ЕстьЭЗЗ Тогда
				ОформленныеДокументы.Добавить(СтрокаДокумент.Документ);
			ИначеЕсли ЭтоЭПЭ И Не СтрокаДокумент.ЕстьЭПЭ Тогда
				ДокументыОснования.Добавить(СтрокаДокумент.Документ);
			ИначеЕсли ЭтоЭПЭ И СтрокаДокумент.ЕстьЭПЭ Тогда
				ОформленныеДокументы.Добавить(СтрокаДокумент.Документ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 
	
	Если ОформленныеДокументы.Количество() > 0 Тогда
		
		ПредставлениеДокумента = "перевозочный документ";
		Если ЭтоЭТрН Тогда
			ПредставлениеДокумента = "транспортная накладная";
		ИначеЕсли ЭтоЭЗЗ Тогда
			ПредставлениеДокумента = "заказ-заявка";
		ИначеЕсли ЭтоЭПЭ Тогда
			ПредставлениеДокумента = "поручение экспедитору";
		КонецЕсли;
		
		СтрокаОформленныхДокументов = СтрСоединитьЛок(ОформленныеДокументы, "; ");
		ТекстПредупреждения = СтрШаблонЛок(
			"На документы: %1%2%3 уже оформлен %4, уберите их из списка к офомлению!",
			Символы.ПС,
			СтрокаОформленныхДокументов,
			Символы.ПС,
			ПредставлениеДокумента
		);
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		
		Возврат Новый Массив;
		
	ИначеЕсли ДокументыОснования.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(Неопределено, "Необходимо выбрать хотя бы один документ!");

	КонецЕсли;
	
	Возврат ДокументыОснования;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьВыбранныйДокумент()
	
	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		ВыбранныйДокумент = ТекущиеДанные.Ссылка;
		Платформа = Модуль_Платформа();
		Платформа.ПоказатьЗначениеЛок(ВыбранныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьПараметры()

	Если Параметры.Свойство("Период") Тогда
		Период = Параметры.Период;
	КонецЕсли;
	Если Параметры.Свойство("ОтборПоОрганизации") И ЗначениеЗаполнено(Параметры.ОтборПоОрганизации) Тогда
		ОтборОрганизация = Параметры.ОтборПоОрганизации;
	Иначе
    	ОтборОрганизация = Справочники["Организации"].ПустаяСсылка();
	КонецЕсли;
	Если Параметры.Свойство("ОтборПоКонтрагенту") И ЗначениеЗаполнено(Параметры.ОтборПоКонтрагенту)  Тогда
		ОтборКонтрагент = Параметры.ОтборПоКонтрагенту;
	Иначе
    	ОтборКонтрагент = Справочники["Контрагенты"].ПустаяСсылка();
	КонецЕсли;
	
	Если Параметры.Свойство("ДокументыОснования") Тогда
		Для Каждого ДокументОснования Из Параметры.ДокументыОснования Цикл
			НоваяСтрока = СписокВыбранныхДокументов.Добавить();
			НоваяСтрока.Документ = ДокументОснования;
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("РежимПодбораИзЭТрН") Тогда
		РежимПодбораИзЭТрН = Параметры.РежимПодбораИзЭТрН;
	КонецЕсли;	
	Если Параметры.Свойство("РежимПодбораИзЗЗ") Тогда
		РежимПодбораИзЗЗ = Параметры.РежимПодбораИзЗЗ;
	КонецЕсли;	
	Если Параметры.Свойство("РежимПодбораИзЭПЭ") Тогда
		РежимПодбораИзЭПЭ = Параметры.РежимПодбораИзЭПЭ;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСписокДокументов()
	
	Элементы.НастройкиПодбора.ЦветФона = Новый Цвет();

	ОбработкаОбъект = ОбработкаОбъект();
	Элементы.ОтборТипДокумента.СписокВыбора.Очистить();
	
	НастройкиПодбораПоСКД = ВосстановитьНастройки("ПодборПоСКД").Настройки;
	Если НастройкиПодбораПоСКД = Неопределено Тогда
		НастройкиПодбораПоСКД = ОбработкаОбъект.НастройкиПодбораПоСКДПоУмолчанию();
	ИначеЕсли ТипЗнч(НастройкиПодбораПоСКД) = Тип("Массив") И НастройкиПодбораПоСКД.Количество() = 0 Тогда
		НастройкиПодбораПоСКД = ОбработкаОбъект.НастройкиПодбораПоСКДПоУмолчанию();
	КонецЕсли;
	
	Если НастройкиПодбораПоСКД <> Неопределено Тогда

		НовыйСКД = ОбработкаОбъект.ИнициализироватьСКД(НастройкиПодбораПоСКД);
		ТекстЗапроса = "";
		Если НовыйСКД <> Неопределено Тогда
			
			Для Каждого Набор Из НовыйСКД.НаборыДанных.ОбъединениеНаборов.Элементы Цикл
				ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", Набор.Запрос, " ОБЪЕДИНИТЬ " + СтрЗаменить(Набор.Запрос, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ВЫБРАТЬ"));	
			КонецЦикла;
			
		КонецЕсли; 
		
		СписокДокументов.ТекстЗапроса = ТекстЗапроса; 
		
		// Отборы
		СписокДокументов.Отбор.Элементы.Очистить();
		
		НастройкиСКД = НовыйСКД.НастройкиПоУмолчанию;  
		ГруппаОтбораВерхняя = СписокДокументов.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораВерхняя.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;  
		
		Для Каждого СтруктураНастройкиСКД Из НастройкиПодбораПоСКД Цикл
			ИдентификаторНастройки = СтруктураНастройкиСКД.ИдентификаторНастройки;
			НастройкаСКД = СтруктураНастройкиСКД.НастройкаСКД;
			Элементы.ОтборТипДокумента.СписокВыбора.Добавить(СтруктураНастройкиСКД.МетаданныеДокумента, СтруктураНастройкиСКД.МетаданныеДокументаПредставление);
			Если НастройкаСКД <> Неопределено И ЕстьАктивныеОтборыСКД(НастройкаСКД) Тогда
				Элементы.НастройкиПодбора.ЦветФона = WebЦвета.Золотой;
				ГруппаОтбора = ГруппаОтбораВерхняя.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
				
				ЭлементыОтбора = НастройкаСКД.Отбор.Элементы;
				ОбработкаОбъект.ДобавитьОтборыСхемыКомпоновкиРекурсивно(ГруппаОтбора, ЭлементыОтбора); 
				
				ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИдентификаторНастройки");
				ЭлементОтбора.ПравоеЗначение = СокрЛП(ИдентификаторНастройки); 
				
			Иначе
				ЭлементОтбора = ГруппаОтбораВерхняя.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИдентификаторНастройки");
				ЭлементОтбора.ПравоеЗначение = СокрЛП(ИдентификаторНастройки);
			КонецЕсли;
		КонецЦикла; 
		
		УстановитьПараметрыСпискаДокументов();
		Элементы.СписокДокументов.Обновить();
		  
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЕстьАктивныеОтборыСКД(НастройкаСКД)
	
	ЕстьАктивныеОтборы = Ложь;
	 Для Каждого СтрокаОтбора Из НастройкаСКД.Отбор.Элементы Цикл
		 Если СтрокаОтбора.Использование Тогда
			 ЕстьАктивныеОтборы = Истина;
		 КонецЕсли;
	 КонецЦикла;
	 
	 Возврат ЕстьАктивныеОтборы;
	 
КонецФункции

&НаСервере
Процедура УстановитьПараметрыСпискаДокументов()
	
	ОбработкаОбъект = ОбработкаОбъект();

	СписокДокументов.Параметры.УстановитьЗначениеПараметра("НачалоПериода", НачалоДня(Период.ДатаНачала));
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("КонецПериода", КонецДня(Период.ДатаОкончания));
	Свойство_ИдентификаторТрН = ОбработкаОбъект.ПолучитьСведениеПоИмени(ОбработкаОбъект.КлючИдентификатораТрН());
	Свойство_ИдентификаторЗЗ = ОбработкаОбъект.ПолучитьСведениеПоИмени(ОбработкаОбъект.КлючИдентификатораЗЗ());
	Свойство_ИдентификаторПЭ = ОбработкаОбъект.ПолучитьСведениеПоИмени(ОбработкаОбъект.КлючИдентификатораПЭ());
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Свойство_ИдентификаторТрН", Свойство_ИдентификаторТрН);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Свойство_ИдентификаторЗЗ", Свойство_ИдентификаторЗЗ);
 	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Свойство_ИдентификаторПЭ", Свойство_ИдентификаторПЭ);

	УстановитьПользовательскийОтбор("Организация", ОтборОрганизация);
	УстановитьПользовательскийОтбор("Контрагент", ОтборКонтрагент);
	УстановитьПользовательскийОтбор("ТипДокумента", ОтборТипДокумента);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПользовательскийОтбор(ИмяОтбора, ЗначениеОтбора, ВидСравнения = Неопределено)
	
	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;

	ЭлементыОтбора = СписокДокументов.Отбор.Элементы;
	ОтборУстановлен = Ложь;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		ТипЗначенияОтбора = ТипЗнч(ЭлементОтбора); 
		Если ТипЗначенияОтбора = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если СокрЛП(ЭлементОтбора.ЛевоеЗначение) = ИмяОтбора Тогда
				ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора; 
				ЭлементОтбора.ВидСравнения = ВидСравнения;
				Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
					ЭлементОтбора.Использование = Истина;       
				Иначе
					ЭлементОтбора.Использование = Ложь;
				КонецЕсли; 
				ОтборУстановлен = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ОтборУстановлен Тогда
		ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОтбора);
		ЭлементОтбора.ВидСравнения = ВидСравнения;
		ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
		Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
			ЭлементОтбора.Использование = Истина;       
		Иначе
			ЭлементОтбора.Использование = Ложь;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	УстановитьПараметрыСпискаДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	УстановитьПараметрыСпискаДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаПриИзменении(Элемент)
	УстановитьПараметрыСпискаДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ОтборДокументовПоРежимуПодбора()

	УстановитьПользовательскийОтбор("РежимПодбора", ТипыДокументов(ОтборРежимПодбора), ВидСравненияКомпоновкиДанных.НеВСписке);

КонецПроцедуры

&НаКлиенте
Функция ТипыДокументов(ОтборРежимПодбора)
	
	ТипыДокументов = Новый Массив;
	Если ОтборРежимПодбора = "ЭТрН" Тогда
		ТипыДокументов = Новый Массив;
		ТипыДокументов.Добавить("Документ.СчетНаОплатуПокупателю");
		ТипыДокументов.Добавить("Документ.ЗаказПокупателя");
	ИначеЕсли ОтборРежимПодбора = "ЭЗЗ" Тогда
		ТипыДокументов = Новый Массив;
		ТипыДокументов.Добавить("Документ.РеализацияТоваровУслуг");
		ТипыДокументов.Добавить("Документ.РасходнаяНакладная");
	ИначеЕсли ОтборРежимПодбора = "ЭПЭ" Тогда
		ТипыДокументов = Новый Массив;
		ТипыДокументов.Добавить("Документ.РеализацияТоваровУслуг");
		ТипыДокументов.Добавить("Документ.РасходнаяНакладная");
	Иначе
		ТипыДокументов = Неопределено;
	КонецЕсли;
	
	Возврат ТипыДокументов;

КонецФункции

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	УстановитьПараметрыСпискаДокументов();
КонецПроцедуры

&НаСервере
Функция НастройкаСКД(МетаданныеДокумента)
	
	Возврат ВосстановитьНастройки(МетаданныеДокумента).Настройки;
	
КонецФункции

&НаСервере
Функция ВосстановитьНастройки(ИмяНастрйки) Экспорт
	
	МодульОбъекта = ОбработкаОбъект();
	Возврат МодульОбъекта.ВосстановитьНастройки(ИмяНастрйки);
		
КонецФункции 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьЗаголовокКнопкиПериода();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбранныхДокументовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтборРежимПодбораПриИзменении(Элемент)

	ВидимостьПоРежимуПодбора();
	ОтборДокументовПоРежимуПодбора();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокумент(Команда)

	ДобавитьВыбранныйДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)

	ОткрытьВыбранныйДокумент();

КонецПроцедуры

&НаКлиенте
Процедура Метрика_ПриВыполненииСозданияПеревозочныхДокументов(ДействиеМетрики, ВыбранныеДокументы)
	
	НаименованиеФормы = Метрика_НаименованиеФормы();
	
	ДопПеременные = Метрика_СгруппироватьВыбранныеДокументыПоТипам(ВыбранныеДокументы);
	
	_КлиентскиеВызовы.Метрика_ДобавитьПоведение_НажатиеКнопки(
		НаименованиеФормы,
		ДействиеМетрики
	);
	
КонецПроцедуры

&НаКлиенте
функция Метрика_НаименованиеФормы()
	Возврат "Подбор документов";
КонецФункции

&НаСервереБезКонтекста
Функция Метрика_СгруппироватьВыбранныеДокументыПоТипам(ВыбранныеДокументы)
	
	Результат = Новый Соответствие;
	
	Для Счетчик = 0 По ВыбранныеДокументы.ВГраница() Цикл
		
		ТипДокумента = ВыбранныеДокументы[Счетчик].Метаданные().Имя;
		
		КоличествоДокументовТипа = Результат.Получить(ТипДокумента);
		КоличествоДокументовТипа = ?(КоличествоДокументовТипа = Неопределено, 0, КоличествоДокументовТипа);
		
		Результат.Вставить(ТипДокумента, КоличествоДокументовТипа + 1);
		
	КонецЦикла;
	
	Возврат Результат;
	
Конецфункции


