
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", Организация);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Грузоотправитель = Организация.Грузоотправитель;
		Перевозчик = Организация.Перевозчик;
		Грузополучатель = Организация.Грузополучатель;
		
		Оформитель = Организация.Оформитель;
		Медик = Организация.Медик;
		ТехОсмотр = Организация.ТехОсмотр;
		Одометр = Организация.Одометр;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Закрыть();
	КонецЕсли;
	
	Элементы.ТехОсмотр.Видимость = Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДействуетФорматЭПЛ502();
	Элементы.Одометр.Видимость = Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДействуетФорматЭПЛ502();
			
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность
		И Не ЗакрытиеФормыПодтверждено
		И Не ЗавершениеРаботы Тогда
		
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ВопросСохраненияКодаЗавершение", ЭтаФорма);
		ТекстВопроса = "Данные были изменения. Сохранить изменения?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохраненияКодаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗакрытиеФормыПодтверждено = Истина;
		
		ЗаписатьИзменения();
		
		Закрыть(Организация);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		ЗакрытиеФормыПодтверждено = Истина;
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗакрытиеФормыПодтверждено = Истина;
	
	ЗаписатьИзменения();
	
	Закрыть(Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗакрытиеФормыПодтверждено = Истина;
	
	ЗаписатьИзменения();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьИзменения()
	
	Для Счет = 1 По 10 Цикл
		
		КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
		
		Попытка
			
			ЗаблокироватьДанныеДляРедактирования(Организация);
			
			ОрганизацияОбъект = Организация.ПолучитьОбъект();
			
			ОрганизацияОбъект.Грузоотправитель = Грузоотправитель;
			ОрганизацияОбъект.Перевозчик = Перевозчик;
			ОрганизацияОбъект.Грузополучатель = Грузополучатель;
			
			ОрганизацияОбъект.Оформитель = Оформитель;
			ОрганизацияОбъект.Медик = Медик;
			ОрганизацияОбъект.ТехОсмотр = ТехОсмотр;
			ОрганизацияОбъект.Одометр = Одометр;
			
			ОрганизацияОбъект.Записать();
			
			РазблокироватьДанныеДляРедактирования(Организация);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			КонтурЛогистика_ОбщегоНазначенияСервер.Пауза(1);
			
			Продолжить;
			
		КонецПопытки;
		
		Прервать;
		
	КонецЦикла;
	
	// Общепродуктовая метрика настройки организации
	// (сейчас считаем что настройка = выбрана роль у нашей организации и есть соответствие)
	Если Организация.Наш
		И Организация.СвязанныеОбъекты.Количество() > 0
		И (Грузоотправитель Или Перевозчик Или Грузополучатель
			Или Оформитель Или Медик Или ТехОсмотр Или Одометр) Тогда
		
		КонтурЛогистика_Метрика.Общепродуктовая_ОтправитьВыполнениеНастройки(Организация, "СтартовыйПомощник");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти