&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ОтборНаш) Тогда 
		
		ОтборНаш = Параметры.ОтборНаш;
		
	Иначе
		ОтборНаш = "Все";	
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ОтборОтправлениеПрибытие) Тогда 
		
		ОтборОтправлениеПрибытие = Параметры.ОтборОтправлениеПрибытие;
		
	Иначе
		ОтборОтправлениеПрибытие = "Все";	
	КонецЕсли;

	Параметры.Свойство("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);
	
	Если ЗначениеЗаполнено(ОбъектУчетнойСистемы) Тогда
		
		СуществующееСопоставление = КонтурЛогистика_КонвертацияСервер.КонвертироватьОбъектУчетнойСистемы_В_ОбъектЛогистика(ОбъектУчетнойСистемы, "ПунктМаршрута");
		
		Элементы.СуществующееСопоставление.Видимость = ЗначениеЗаполнено(СуществующееСопоставление);
		
		Элементы.ГруппаСвязанныйОбъект.Видимость = Истина;
		Элементы.ОбъектУчетнойСистемы.ТолькоПросмотр = Истина;
		ОбъектУчетнойСистемыУстановитьСвязь = Истина;
		Элементы.Список.МножественныйВыбор = Ложь;
		Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере_ФормаВыбора(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНашПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтправлениеПрибытиеПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинСписка()

	Список.Отбор.Элементы.Очистить();
	
	Если  ОтборНаш = "Наши" ИЛИ ОтборНаш = "Сторонние" Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наш");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Истина;
		
		Если ОтборНаш = "Наши" Тогда
			ЭлементОтбора.ПравоеЗначение = Истина;
		Иначе
			ЭлементОтбора.ПравоеЗначение = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если  ОтборОтправлениеПрибытие = "ТолькоОтправление" ИЛИ ОтборОтправлениеПрибытие = "ТолькоПрибытие" Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ОтборОтправлениеПрибытие = "ТолькоОтправление" Тогда 
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отправление");
		Иначе
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Прибытие");
		КонецЕсли;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Истина;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	

КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда = Неопределено)
	
	Если ЗначениеЗаполнено(ОбъектУчетнойСистемы) Тогда
		
		Если ЗначениеЗаполнено(СуществующееСопоставление) Тогда
			                 
			ТекстВопроса = Строка(ОбъектУчетнойСистемы) +" уже сопоставлен с " + Строка(СуществующееСопоставление)+". Создать еще одно сопоставление?";
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить("Создать");	
			Кнопки.Добавить("Отменить");
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(ТекстВопроса, Кнопки, , , ЭтаФорма, "ОбработчикВопросаПоСопоставлению");
			
		Иначе	
			
			Если ОбъектУчетнойСистемыУстановитьСвязь = Истина Тогда 
				УстановитьСвязьСОбъектом();
			КонецЕсли;
			
			ЗакрытьФормуВыборомЗначения();
			
		КонецЕсли;
		
	Иначе
		
		ЗакрытьФормуВыборомЗначения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВопросаПоСопоставлению(ПараметрОбработчика, ДополнительныеПараметры) Экспорт
	
	Если ПараметрОбработчика = "Создать" Тогда
		
		Если ОбъектУчетнойСистемыУстановитьСвязь = Истина Тогда 
			УстановитьСвязьСОбъектом();
		КонецЕсли;
		
		ЗакрытьФормуВыборомЗначения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ОбъектУчетнойСистемы) Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
	Выбрать(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуВыборомЗначения()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	ВыбранноеЗначение = ТекДанные.Ссылка;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ОповеститьОВыборе(ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйПунктМаршрута(Команда)
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ОбъектУчетнойСистемыСсылка", ОбъектУчетнойСистемы);
	
	ПараметрыФормы 		= Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
		
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_ПунктыМаршрута.ФормаОбъекта",
			ПараметрыФормы,
			,
			ЭтаФорма,
			"ОбработчикСозданиеОбъекта");
			
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвязьСОбъектом()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Не могу определить выбранную строку");
		Возврат;
		
	КонецЕсли;
	
	УстановитьСвязьСервер(ТекДанные.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязьСервер(ПунктМаршрута_Ссылка)

	Если ПунктМаршрута_Ссылка.ПометкаУдаления Тогда
		ВызватьИсключение "Невозможно создать сопоставление т.к. Пункт маршрута помечен на удаление. Выберите другой Пункт маршрута или снимите пометку удаления.";	
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыСервер.УстановитьСвязьОбъектовЛогистикаУчСист(ПунктМаршрута_Ссылка, ОбъектУчетнойСистемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСозданиеОбъекта(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт

	// проверить что создали новое и связали с объектом и закрыть эту форму
	СозданныйЭлемент = СозданныйПунктМаршрута(ОбъектУчетнойСистемы);
	Если ЗначениеЗаполнено(СозданныйЭлемент) Тогда 
		ОповеститьОВыборе(СозданныйЭлемент);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СозданныйПунктМаршрута(ОбъектУчСист = Неопределено)
	
	Если ЗначениеЗаполнено(ОбъектУчСист) Тогда 
		
		СуществующееСопоставление = КонтурЛогистика_КонвертацияСервер.КонвертироватьОбъектУчетнойСистемы_В_ОбъектЛогистика(ОбъектУчСист, "ПунктМаршрута");
		Если ЗначениеЗаполнено(СуществующееСопоставление) Тогда 
			Возврат СуществующееСопоставление;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
	
