#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("АУ_ПропускОбратнойЗаписи") Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл

		Если Не ЗначениеЗаполнено(ЗаписьНабора.ВидНоменклатуры)
			Или Не ЗначениеЗаполнено(ЗаписьНабора.ПарныйВидНоменклатуры) Тогда
			Продолжить;
		КонецЕсли;

		Если ЗаписьНабора.ВидНоменклатуры = ЗаписьНабора.ПарныйВидНоменклатуры Тогда
			Продолжить;
		КонецЕсли;

		НаборОбратный = РегистрыСведений.АУ_СоответствиеВидовНоменклатурыМаркировки.СоздатьНаборЗаписей();
		НаборОбратный.Отбор.ВидНоменклатуры.Установить(ЗаписьНабора.ПарныйВидНоменклатуры);
		НаборОбратный.ДополнительныеСвойства.Вставить("АУ_ПропускОбратнойЗаписи", Истина);

		СтрокаОбратная = НаборОбратный.Добавить();
		СтрокаОбратная.ВидНоменклатуры = ЗаписьНабора.ПарныйВидНоменклатуры;
		СтрокаОбратная.ПарныйВидНоменклатуры = ЗаписьНабора.ВидНоменклатуры;

		НаборОбратный.Записать();

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
