&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЗагрузитьТаблицуСкладовНаСервере(АдресСкладов);  
	ЗагрузитьГруппыПользователейНаСервере(АдресГруппыПользователей);          
	ЗагрузитьТаблицуИдентификаторов(АдресИдентификаторов);	
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ПодборПользователей1С(Команда)

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСлужебная_ПодборПользователей1С = ПолучитьФорму("ОФ_ФормаСлужебная_ПодборПользователей1С", ЭтаФорма);
	#Иначе
		ФормаСлужебная_ПодборПользователей1С = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСлужебная_ПодборПользователей1С", , ЭтаФорма);	
	#КонецЕсли
	
	ФормаСлужебная_ПодборПользователей1С.ЗакрыватьПриЗакрытииВладельца 	= Истина;
	ФормаСлужебная_ПодборПользователей1С._ЛокКонтекст 					= _ЛокКонтекст;	
	ФормаСлужебная_ПодборПользователей1С.СозданныеПользователиИмпорта	= СформироватьСписокУжеИмпортированныхПользователей();
	
	ОП = Новый ОписаниеОповещения("ФормаСлужебная_ПодборПользователей1СЗакрытие", ЭтаФорма);
	ФормаСлужебная_ПодборПользователей1С.ОписаниеОповещенияОЗакрытии = ОП;
	
	ФормаСлужебная_ПодборПользователей1С.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Не ТаблицаПользователейMS.Количество() Тогда
		Сообщение = НСтр("be = 'Табліца імпарту карыстальнікаў не запоўнена.'; en = 'User import table is not filled.'; es = 'La tabla de importación de usuarios no está completa.'; ka = 'მომხმარებების იმპორტის ცხრილი არ არის შევსებული.'; kk = '1С-тен пайдаланушыларды імпорттау тізімі толтырылмаған.'; ro = 'Tabelul de import al utilizatorilor nu este completat.'; ru = 'Таблица импорта пользователей не заполнена.'; tr = 'Kullanıcı içe aktarma tablosu doldurulmamış.'; uk = 'Таблиця імпорту користувачів не заповнена.'; uz = ""Foydalanuvchilarni import qilish jadvali to'ldirilmagan.""");
		Сообщить(Сообщение); 
		Возврат;
	КонецЕсли;	
	
	Если Не ПроверкаЗаполненияПолей() Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ТаблицаСохраненаВФайл Тогда
		Сообщение = НСтр("be = 'Дадзеныя аўтарызацыі новых карыстальнікаў Cleverence неабходна раней захаваць.'; en = 'Authorization data for new Cleverence users must be saved in advance.'; es = 'Es necesario guardar previamente los datos de autorización de los nuevos usuarios de Cleverence.'; ka = 'Cleverence-ს ახალი მომხმარებლების ავტორიზაციის მონაცემები უნდა წინასწარ შეინახოთ.'; kk = 'Cleverence жаңа пайдаланушылардың авторлық деректерін алдын ала сақтау керек'; ro = 'Datele de autentificare ale noilor utilizatori Cleverence trebuie salvate în prealabil.'; ru = 'Данные авторизации новых пользователей Клеверенс необходимо предварительно сохранить.'; tr = 'Yeni Cleverence kullanıcılarının kimlik bilgileri önceden kaydedilmelidir.'; uk = 'Дані авторизації нових користувачів Cleverence необхідно передбачально зберегти.'; uz = ""Cleverence yangi foydalanuvchilarining autentifikatsiya ma'lumotlarini oldin saqlashingiz kerak.""");
		Сообщить(Сообщение); 
		Возврат;
	КонецЕсли;
			
	ПовторноеСозданиеПользователя = Ложь;           
	ТекстВопроса = НСтр("be = 'Наступныя карыстальнікі ўжо былі створаны раней:'; en = 'The following users have already been created earlier:'; es = 'Los siguientes usuarios ya han sido creados anteriormente:'; ka = 'შემდეგი მომხმარებელი უკვე წარმოებულია წინ:'; kk = 'Келесі пайдаланушылар алдында құрылған:'; ro = 'Următorii utilizatori au fost deja creați anterior:'; ru = 'Следующие пользователи уже были созданы ранее:'; tr = 'Aşağıdaki kullanıcılar zaten önceden oluşturulmuştur:'; uk = 'Наступні користувачі вже були створені раніше:'; uz = 'Кейинги фойдаланувчилар аввалдан яратилган:  '");
	Для Каждого СтрокаПользователя Из ТаблицаПользователейMS Цикл	
		Если СписокИдентификаторов.НайтиПоЗначению(СтрокаПользователя.Ид) <> Неопределено Тогда
			ТекстВопроса = ТекстВопроса + Символы.ПС + "	- " + СтрокаПользователя.Имя;
			ПовторноеСозданиеПользователя = Истина;
		КонецЕсли;
	КонецЦикла;   
	Если ПовторноеСозданиеПользователя Тогда
		ТекстВопроса = ТекстВопроса + Символы.ПС 
				+ НСтр("be = 'Перазапісаць?'; en = 'Overwrite?'; es = '¿Sobrescribir?'; ka = 'გადადება?'; kk = 'Қайта жазу керек пе?'; ro = 'Suprascrieți?'; ru = 'Перезаписать?'; tr = 'Üzerine yazılsın mı?'; uk = 'Перезаписати?'; uz = 'Ўзгартириш?'");
		ОповещениеЗаписатьИЗакрыть = Новый ОписаниеОповещения("ЗаписатьИЗакрытьЗавершение", ЭтаФорма);
		ПоказатьВопрос(ОповещениеЗаписатьИЗакрыть, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , _ЛокКонтекст.ЛокЯдро_ТекстВнимание()); 
	Иначе     
		ЗаписатьИЗакрытьЗавершение(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГенерацияШтрихкодов(Команда)                                    
	
	Если Не ТаблицаПользователейMS.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСлужебная_ВводЗначенийЗаполнения = ПолучитьФорму("ОФ_ФормаСлужебная_ВводЗначенийЗаполнения", ЭтаФорма);
	#Иначе
		ФормаСлужебная_ВводЗначенийЗаполнения = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСлужебная_ВводЗначенийЗаполнения", , ЭтаФорма);	
		ФормаСлужебная_ВводЗначенийЗаполнения.РежимОткрытияОкна 		= РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;	
	#КонецЕсли
	
	ФормаСлужебная_ВводЗначенийЗаполнения.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаСлужебная_ВводЗначенийЗаполнения._ЛокКонтекст 					= _ЛокКонтекст;		
	ФормаСлужебная_ВводЗначенийЗаполнения.Заголовок						= НСтр("be = 'Генерацыя штрыхкода'; en = 'Barcode generation'; es = 'Generación de código de barras'; ka = 'შტრიხკოდის გენერაცია'; kk = 'Штрихкодты жасау'; ro = 'Generare cod de bare'; ru = 'Генерация штрихкода'; tr = 'Barkod oluştur'; uk = 'Генерація штрихкоду'; uz = 'Shtrixkodni generatsiya qilish'");
	ФормаСлужебная_ВводЗначенийЗаполнения.ГенерацияПароля 				= Истина;	
	ФормаСлужебная_ВводЗначенийЗаполнения.МаксЧислоСимволов 			= 20;	
		
	ОП = Новый ОписаниеОповещения("ФормаСлужебная_ВводЗначенийЗаполненияЗакрытие", ЭтаФорма, "ГенерацияШтрихкода");
	ФормаСлужебная_ВводЗначенийЗаполнения.ОписаниеОповещенияОЗакрытии = ОП;
	
	ФормаСлужебная_ВводЗначенийЗаполнения.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГруппу(Команда)
	
	Если Не Элементы.ТаблицаПользователейMS.ВыделенныеСтроки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСлужебная_ВводЗначенийЗаполнения = ПолучитьФорму("ОФ_ФормаСлужебная_ВводЗначенийЗаполнения", ЭтаФорма);
	#Иначе
		ФормаСлужебная_ВводЗначенийЗаполнения = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСлужебная_ВводЗначенийЗаполнения", , ЭтаФорма);	
		ФормаСлужебная_ВводЗначенийЗаполнения.РежимОткрытияОкна 		= РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;	
	#КонецЕсли
	
	ФормаСлужебная_ВводЗначенийЗаполнения.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаСлужебная_ВводЗначенийЗаполнения._ЛокКонтекст 					= _ЛокКонтекст;		
	ФормаСлужебная_ВводЗначенийЗаполнения.Заголовок						= НСтр("be = 'Запаўненне групы'; en = 'Fill group'; es = 'Rellenar grupo'; ka = 'ჯგუფის შევსება'; kk = 'Топты толтыру'; ro = 'Completarea grupului'; ru = 'Заполнение группы'; tr = 'Grubu doldur'; uk = 'Заповнення групи'; uz = ""Guruhni to'ldirish""");
	ФормаСлужебная_ВводЗначенийЗаполнения.ГенерацияПароля 				= Ложь;			
	ФормаСлужебная_ВводЗначенийЗаполнения.АдресХранилища 				= ВыгрузитьТаблицуГруппПользователейНаСервере();
	
	ОП = Новый ОписаниеОповещения("ФормаСлужебная_ВводЗначенийЗаполненияЗакрытие", ЭтаФорма);
	ФормаСлужебная_ВводЗначенийЗаполнения.ОписаниеОповещенияОЗакрытии = ОП;
	
	ФормаСлужебная_ВводЗначенийЗаполнения.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ГенерацияПаролей(Команда)	
	
	Если Не ТаблицаПользователейMS.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСлужебная_ВводЗначенийЗаполнения = ПолучитьФорму("ОФ_ФормаСлужебная_ВводЗначенийЗаполнения", ЭтаФорма);
	#Иначе
		ФормаСлужебная_ВводЗначенийЗаполнения = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСлужебная_ВводЗначенийЗаполнения", , ЭтаФорма);	
		ФормаСлужебная_ВводЗначенийЗаполнения.РежимОткрытияОкна 		= РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;	
	#КонецЕсли
	
	ФормаСлужебная_ВводЗначенийЗаполнения.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаСлужебная_ВводЗначенийЗаполнения._ЛокКонтекст 					= _ЛокКонтекст;		
	ФормаСлужебная_ВводЗначенийЗаполнения.Заголовок						= НСтр("be = 'Генерацыя пароля'; en = 'Password generation'; es = 'Generación de contraseña'; ka = 'პაროლის გენერაცია'; kk = 'Парольді жасау'; ro = 'Generare parolă'; ru = 'Генерация пароля'; tr = 'Parola oluştur'; uk = 'Генерація пароля'; uz = 'Parolni generatsiya qilish'");
	ФормаСлужебная_ВводЗначенийЗаполнения.ГенерацияПароля 				= Истина;	   
	ФормаСлужебная_ВводЗначенийЗаполнения.МаксЧислоСимволов 			= 9;	
		
	ОП = Новый ОписаниеОповещения("ФормаСлужебная_ВводЗначенийЗаполненияЗакрытие", ЭтаФорма, "ГенерацияПароля");
	ФормаСлужебная_ВводЗначенийЗаполнения.ОписаниеОповещенияОЗакрытии = ОП;
	
	ФормаСлужебная_ВводЗначенийЗаполнения.Открыть();
			
КонецПроцедуры
   
&НаКлиенте
Процедура ТаблицаПользователейMSИдСкладовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСлужебная_ВводЗначенийЗаполнения = ПолучитьФорму("ОФ_ФормаСлужебная_ВводЗначенийЗаполнения", ЭтаФорма);
	#Иначе
		ФормаСлужебная_ВводЗначенийЗаполнения = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСлужебная_ВводЗначенийЗаполнения", , ЭтаФорма);	
		ФормаСлужебная_ВводЗначенийЗаполнения.РежимОткрытияОкна 		= РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;	
	#КонецЕсли
	
	ФормаСлужебная_ВводЗначенийЗаполнения.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаСлужебная_ВводЗначенийЗаполнения._ЛокКонтекст 					= _ЛокКонтекст;		
	ФормаСлужебная_ВводЗначенийЗаполнения.Заголовок						= НСтр("be = 'Выбар складаў'; en = 'Warehouse selection'; es = 'Selección de almacenes'; ka = 'საწყობების არჩევა'; kk = 'Қойымдарды таңдаңыз'; ro = 'Alegerea depozitelor'; ru = 'Выбор складов'; tr = 'Depoları seçin'; uk = 'Вибір складів'; uz = 'Omborlarni tanlash'");
	ФормаСлужебная_ВводЗначенийЗаполнения.ГенерацияПароля 				= Ложь;	
	ФормаСлужебная_ВводЗначенийЗаполнения.ПодборСкладов 				= Истина;	
	ФормаСлужебная_ВводЗначенийЗаполнения.АдресХранилища 				= ВыгрузитьТаблицуСкладовНаСервере();
	
	ТекДанные = Элементы.ТаблицаПользователейMS.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ФормаСлужебная_ВводЗначенийЗаполнения.ИдСкладовПользователя 		= ТекДанные.ИдСкладов;			
	Иначе
		Возврат;
	КонецЕсли;
	
	ОП = Новый ОписаниеОповещения("ФормаСлужебная_ВводЗначенийЗаполненияЗакрытие", ЭтаФорма, "ПодборСкладов");
	ФормаСлужебная_ВводЗначенийЗаполнения.ОписаниеОповещенияОЗакрытии = ОП;
	
	ФормаСлужебная_ВводЗначенийЗаполнения.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	Если Не ТаблицаПользователейMS.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ФормированиеТабличногоДокументаЧерезПостроитель(ТабДок);
	ЗаголовокТД = НСтр("be = 'Сфармаваныя ідэнтыфікацыйныя дадзеныя новых карыстальнікаў Cleverence'; en = 'Generated identification data for new Cleverence users'; es = 'Datos de identificación generados para nuevos usuarios de Cleverence'; ka = 'Cleverence-ის ახალი მომხმარებელების იდენტიფიკაციური მონაცემები'; kk = 'Cleverence жаңа пайдаланушылардың анықтамалық деректері құрылды'; ro = 'Datele de identificare generate pentru noii utilizatori Cleverence'; ru = 'Сформированные идентификационные данные новых пользователей Клеверенс'; tr = 'Cleverence yeni kullanıcıların kimlik bilgileri oluşturuldu'; uk = 'Сформовані ідентифікаційні дані нових користувачів Cleverence'; uz = ""Cleverence yangi foydalanuvchilar identifikatsiya ma'lumotlari shakllantirildi""");
	ТабДок.Показать(ЗаголовокТД);
	
	ТаблицаСохраненаВФайл = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КопированиеШтрихкодовВПароли(Команда)
	Для Каждого СтрокаПользователя Из ТаблицаПользователейMS Цикл 
		СтрокаПользователя.Пароль = СтрокаПользователя.Штрихкод;			
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура КопированиеПаролейВШтрихкоды(Команда)
	Для Каждого СтрокаПользователя Из ТаблицаПользователейMS Цикл
		СтрокаПользователя.Штрихкод = СтрокаПользователя.Пароль;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ФормаСлужебная_ПодборПользователей1СЗакрытие(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура")
		И РезультатВыбора.Свойство("Пользователи") Тогда
		Для Каждого КлючЗначение Из РезультатВыбора.Пользователи Цикл
			СозданиеСтрокиПользователяТаблицыИмпорта(КлючЗначение.Значение);		
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаСлужебная_ВводЗначенийЗаполненияЗакрытие(ВыбранноеЗначение, ПризнакДействия) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;		
	
	Если ПризнакДействия = "ГенерацияПароля" Тогда                                                    	
		Для Каждого СтрокаПользователя Из ТаблицаПользователейMS Цикл 
			#Если ВебКлиент Тогда
				СтрокаПользователя.Пароль = СгенерироватьПарольПользователяНаСервере(ВыбранноеЗначение, ТаблицаПользователейMS.Индекс(СтрокаПользователя));
			#Иначе
				СтрокаПользователя.Пароль = СгенерироватьПарольПользователя(ВыбранноеЗначение, ТаблицаПользователейMS.Индекс(СтрокаПользователя));			
			#КонецЕсли
		КонецЦикла; 
	ИначеЕсли ПризнакДействия = "ГенерацияШтрихкода" Тогда		
		Для Каждого СтрокаПользователя Из ТаблицаПользователейMS Цикл
			#Если ВебКлиент Тогда
				СтрокаПользователя.Штрихкод = СгенерироватьПарольПользователяНаСервере(ВыбранноеЗначение, ТаблицаПользователейMS.Индекс(СтрокаПользователя), Истина);
			#Иначе
				СтрокаПользователя.Штрихкод = СгенерироватьПарольПользователя(ВыбранноеЗначение, ТаблицаПользователейMS.Индекс(СтрокаПользователя), Истина);
			#КонецЕсли
		КонецЦикла;
	ИначеЕсли ПризнакДействия = "ПодборСкладов" Тогда                           
		ТекДанные = Элементы.ТаблицаПользователейMS.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			ТекДанные.ИдСкладов = ВыбранноеЗначение;
		КонецЕсли;
	Иначе
		Для Каждого ВыделеннаяСтрока Из Элементы.ТаблицаПользователейMS.ВыделенныеСтроки Цикл
			#Если ТолстыйКлиентОбычноеПриложение Тогда                                      
				ВыделеннаяСтрока.ИдГруппы 	= ВыбранноеЗначение.Ид;
				ВыделеннаяСтрока.ИмяГруппы 	= ВыбранноеЗначение.Имя;
			#Иначе
				ТаблицаПользователейMS[ВыделеннаяСтрока].ИдГруппы 	= ВыбранноеЗначение.Ид;
				ТаблицаПользователейMS[ВыделеннаяСтрока].ИмяГруппы 	= ВыбранноеЗначение.Имя;
			#КонецЕсли
		КонецЦикла;                                                                        		                                                                                   	
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
Процедура ЗаписатьИЗакрытьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрокКУдалению 	= Новый Массив;                                                
	ЕстьОшибки 				= Ложь;
	
	Для Каждого СтрокаПользователя Из ТаблицаПользователейMS Цикл	
	
		ПараметрыПользователя = Новый Соответствие;
		ПараметрыПользователя.Вставить("id", 			СтрокаПользователя.Ид);
		ПараметрыПользователя.Вставить("name", 			СтрокаПользователя.Имя);		
		ПараметрыПользователя.Вставить("description", 	СтрокаПользователя.Описание);		
		ПараметрыПользователя.Вставить("password", 		СтрокаПользователя.Пароль);			
		ПараметрыПользователя.Вставить("barcode", 		СтрокаПользователя.Штрихкод);		
		ПараметрыПользователя.Вставить("groupId", 		СтрокаПользователя.ИдГруппы);		
		ПараметрыПользователя.Вставить("groupName", 	СтрокаПользователя.ИмяГруппы);		
		ПараметрыПользователя.Вставить("warehouseIds",  СтрокаПользователя.ИдСкладов.ВыгрузитьЗначения());				
				
		// Склады для кома-режима                       
		СтрокаПользователя.ИдСкладов.ЗаполнитьПометки(Истина);
		ПараметрыПользователя.Вставить("allWarehouses", СтрокаПользователя.ИдСкладов);		
				
		ЗагрузкаПользователя = _ЛокКонтекст.ЛокЯдро_ЗагрузитьПользователейВSMARTS(ПараметрыПользователя);                                
		Если ЗагрузкаПользователя <> Неопределено И Не ЗагрузкаПользователя.Результат Тогда
			ЕстьОшибки = Истина;
			Сообщение = НСтр("be = 'Не атрымалася стварыць новага карыстальніка ""%1"". Прычына: %2. Падрабязнасці ў часопісе рэгістрацыі'; en = 'Failed to create a new user ""%1"". Reason: %2. Details in the registration log'; es = 'No se pudo crear un nuevo usuario ""%1"". Razón: %2. Consulte el registro para más detalles'; ka = '""%1"" ახალი მომხმარებელის შექმნა ვერ ხერხდება. მიზეზი: %2. დეტალები ნახეთ რეგისტრაციის ჟურნალში'; kk = '""%1"" жаңа пайдаланушы жасау мүмкін болмады. Себеп: %2. Толық ақпарат жүріс журналында'; ro = 'Nu s-a putut crea un nou utilizator ""%1"". Motivul: %2. Detalii în jurnalul de înregistrare'; ru = 'Не удалось создать нового пользователя ""%1"". Причина: %2. Подробности в журнале регистрации'; tr = '""%1"" kullanıcısı oluşturulamadı. Sebep: %2. Detaylar kayıt defterinde'; uk = 'Не вдалося створити нового користувача ""%1"". Причина: %2. Деталі в журналі реєстрації'; uz = '""%1"" yangi foydalanuvchini yaratish muvaffaqiyatsiz tugadi. Sabab: %2. Tafsilotlar ro''yxatga olish jurnalida'");
			Сообщение = _ЛокКонтекст.ЛокЯдро_СтрШаблон(Сообщение, СтрокаПользователя.Имя, ЗагрузкаПользователя.ТекстОшибки);
			Сообщить(Сообщение); 
		Иначе
			МассивСтрокКУдалению.Добавить(СтрокаПользователя);			
		КонецЕсли;                                               
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Для Каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
			ТаблицаПользователейMS.Удалить(СтрокаКУдалению);
		КонецЦикла;		
	Иначе
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Если НЕ ОписаниеОповещенияОЗакрытии = Неопределено Тогда	
				ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии);
			КонецЕсли;
		#КонецЕсли

		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   

#Область ВспомогательныеПроцедурыФункции

// Загрузка таблиц с данными при инициализации формы
&НаСервере
Процедура ЗагрузитьТаблицуСкладовНаСервере(Адрес)
	
	пТаблицаСкладовMS = ПолучитьИзВременногоХранилища(Адрес);
	Если пТаблицаСкладовMS <> Неопределено Тогда
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			СкладыВспомогательные = пТаблицаСкладовMS.Скопировать();
		#Иначе                                                 
			СкладыВспомогательные.Загрузить(пТаблицаСкладовMS);
		#КонецЕсли		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьГруппыПользователейНаСервере(Адрес)

	ГруппыПользователейMS = ПолучитьИзВременногоХранилища(Адрес);
	Если ГруппыПользователейMS <> Неопределено Тогда  
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ТаблицаГруппMS = ГруппыПользователейMS.Скопировать();
		#Иначе                                                 
			ТаблицаГруппMS.Загрузить(ГруппыПользователейMS);
		#КонецЕсли                                          	
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьТаблицуИдентификаторов(Адрес)
	
	МассивИд = ПолучитьИзВременногоХранилища(Адрес);
	СписокИдентификаторов.ЗагрузитьЗначения(МассивИд);
	
КонецПроцедуры

// Помещение таблиц с данными во временное хранилище для передачи в последующие формы
&НаСервере
Функция ВыгрузитьТаблицуСкладовНаСервере()
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		Возврат ПоместитьВоВременноеХранилище(СкладыВспомогательные.Выгрузить(), УникальныйИдентификатор);
	#Иначе                                                                                                      
		Возврат ПоместитьВоВременноеХранилище(СкладыВспомогательные, Новый УникальныйИдентификатор);
	#КонецЕсли
	
КонецФункции

&НаСервере
Функция ВыгрузитьТаблицуГруппПользователейНаСервере()
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		Возврат ПоместитьВоВременноеХранилище(ТаблицаГруппMS.Выгрузить(), УникальныйИдентификатор);
	#Иначе                                                                                                      
		Возврат ПоместитьВоВременноеХранилище(ТаблицаГруппMS, Новый УникальныйИдентификатор);
	#КонецЕсли	
	
КонецФункции

// Служебные процедуры
&НаКлиенте
Функция СгенерироватьПарольПользователя(ЧисловСимволовПароля, Индекс, ЭтоШК = Ложь)
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах() + Индекс);		
	
	Пароль = "";                          
	
	Если ЭтоШК Тогда
		ИспользуемыеСимволы = "01243456789";
	Иначе
		ИспользуемыеСимволы = "01243456789qwertyuiopasdfghjklzxcvbnm";
	КонецЕсли;
	
	КоличествоИспользуемыхСимволов = СтрДлина(ИспользуемыеСимволы);
	Пока СтрДлина(Пароль) < ЧисловСимволовПароля Цикл
		НовыйСимвол = Сред(ИспользуемыеСимволы, (ГСЧ.СлучайноеЧисло(1, КоличествоИспользуемыхСимволов)), 1);
		Пароль = Пароль + НовыйСимвол;
	КонецЦикла;                      
	
	Возврат Пароль;
	
КонецФункции         

&НаСервереБезКонтекста
Функция СгенерироватьПарольПользователяНаСервере(ЧисловСимволовПароля, Индекс, ЭтоШК = Ложь)
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах() + Индекс);		
	
	Пароль = "";                          
	
	Если ЭтоШК Тогда
		ИспользуемыеСимволы = "01243456789";
	Иначе
		ИспользуемыеСимволы = "01243456789qwertyuiopasdfghjklzxcvbnm";
	КонецЕсли;
	
	КоличествоИспользуемыхСимволов = СтрДлина(ИспользуемыеСимволы);
	Пока СтрДлина(Пароль) < ЧисловСимволовПароля Цикл
		НовыйСимвол = Сред(ИспользуемыеСимволы, (ГСЧ.СлучайноеЧисло(1, КоличествоИспользуемыхСимволов)), 1);
		Пароль = Пароль + НовыйСимвол;
	КонецЦикла;                      
	
	Возврат Пароль;
	
КонецФункции

&НаСервере
Функция СформироватьСписокУжеИмпортированныхПользователей()
	
	СписокДобавленныхПользователей = Новый СписокЗначений;
	
	Для Каждого СтрокаТаблицыПользователей Из ТаблицаПользователейMS Цикл
		Если Не ПустаяСтрока(СтрокаТаблицыПользователей.Ид) Тогда			
			СписокДобавленныхПользователей.Добавить(Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТаблицыПользователей.Ид)));			
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокДобавленныхПользователей;
	
КонецФункции 

&НаСервере
Процедура СозданиеСтрокиПользователяТаблицыИмпорта(Пользователь)
	
	СозданныеСтроки = ТаблицаПользователейMS.НайтиСтроки(Новый Структура("Ид", XMLСтрока(Пользователь)));
	Если СозданныеСтроки.Количество() Тогда
		ЗаполняемаяСтрокаТаблицы = СозданныеСтроки[0];
	Иначе
		ЗаполняемаяСтрокаТаблицы = ТаблицаПользователейMS.Добавить();	
	КонецЕсли;         
	
	ЗаполняемаяСтрокаТаблицы.Ид  = XMLСтрока(Пользователь);
	ЗаполняемаяСтрокаТаблицы.Имя = Пользователь.Наименование;
	
	ГруппаПоУмолчанию = ТаблицаГруппMS.НайтиСтроки(Новый Структура("Ид", ИмяГруппы));
	
	ИдСклада = Новый СписокЗначений; 
	
	СкладПоУмолчанию	= СкладыВспомогательные.НайтиСтроки(Новый Структура("Ид", "1"));
	Если СкладПоУмолчанию.Количество() = 0 Тогда
		СкладПоУмолчанию = СкладыВспомогательные.НайтиСтроки(Новый Структура("Ид", "main"));		
	КонецЕсли;
	
	Если СкладПоУмолчанию.Количество() Тогда
		ИдСклада.Добавить(СкладПоУмолчанию[0].Ид, СкладПоУмолчанию[0].Имя);
	КонецЕсли;
	
	ЗаполняемаяСтрокаТаблицы.ИдГруппы 	= ?(ГруппаПоУмолчанию.Количество(), ГруппаПоУмолчанию[0].Ид, "");
	ЗаполняемаяСтрокаТаблицы.ИмяГруппы 	= ?(ГруппаПоУмолчанию.Количество(), ГруппаПоУмолчанию[0].Имя, "");			
	ЗаполняемаяСтрокаТаблицы.ИдСкладов 	= ИдСклада;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполненияПолей()
	
	Отказ = Ложь;
		
	Для Каждого СтрокаПользователя Из ТаблицаПользователейMS Цикл
		Если ПустаяСтрока(СтрокаПользователя.Ид) Тогда
			Сообщение = НСтр("be = 'Радок %1 поле ""ID"" не запоўнена'; en = 'Row %1 field ""ID"" is not filled'; es = 'La fila %1 del campo ""ID"" no está completa'; ka = '%1 სტრიქონი ""ID"" არ არის შევსებული'; kk = '%1 өрісі ""ID"" толтырылмаған'; ro = 'Rândul %1 câmpul ""ID"" nu este completat'; ru = 'Строка %1 поле ""ID"" не заполнено'; tr = '%1 satır ""ID"" alanı doldurulmamış'; uk = 'Рядок %1 поле ""ID"" не заповнено'; uz = '%1 qator ""ID"" maydoni to''ldirilmagan'");
			Сообщение = _ЛокКонтекст.ЛокЯдро_СтрШаблон(Сообщение, ТаблицаПользователейMS.Индекс(СтрокаПользователя) + 1);
			Сообщить(Сообщение); 			
			Отказ = Истина;
		КонецЕсли;                                      			
		Если ПустаяСтрока(СтрокаПользователя.Имя) Тогда 
			Сообщение = НСтр("be = 'Радок %1 поле ""Карыстальнік"" не запоўнена'; en = 'Row %1 field ""User"" is not filled'; es = 'La fila %1 del campo ""Usuario"" no está completa'; ka = '%1 სტრიქონი ""მომხმარებელი"" არ არის შევსებული'; kk = '%1 өрісі ""Пайдаланушы"" толтырылмаған'; ro = 'Rândul %1 câmpul ""Utilizator"" nu este completat'; ru = 'Строка %1 поле ""Пользователь"" не заполнено'; tr = '%1 satır ""Kullanıcı"" alanı doldurulmamış'; uk = 'Рядок %1 поле ""Користувач"" не заповнено'; uz = '%1 qator ""Foydalanuvchi"" maydoni to''ldirilmagan'");
			Сообщение = _ЛокКонтекст.ЛокЯдро_СтрШаблон(Сообщение, ТаблицаПользователейMS.Индекс(СтрокаПользователя) + 1);
			Сообщить(Сообщение); 			
			Отказ = Истина;
		КонецЕсли;
		Если ПустаяСтрока(СтрокаПользователя.ИмяГруппы) Тогда
			Сообщение = НСтр("be = 'Радок %1 поле ""Імя групы"" не запоўнена'; en = 'Row %1 field ""Group Name"" is not filled'; es = 'La fila %1 del campo ""Nombre del grupo"" no está completa'; ka = '%1 სტრიქონი ""ჯგუფის სახელი"" არ არის შევსებული'; kk = '%1 өрісі ""Топ аты"" толтырылмаған'; ro = 'Rândul %1 câmpul ""Numele grupului"" nu este completat'; ru = 'Строка %1 поле ""Имя группы"" не заполнено'; tr = '%1 satır ""Grup Adı"" alanı doldurulmamış'; uk = 'Рядок %1 поле ""Ім''я групи"" не заповнено'; uz = '%1 qator ""Guruh nomi"" maydoni to''ldirilmagan'");
			Сообщение = _ЛокКонтекст.ЛокЯдро_СтрШаблон(Сообщение, ТаблицаПользователейMS.Индекс(СтрокаПользователя) + 1);
			Сообщить(Сообщение); 
			Отказ = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаПользователя.ИдСкладов) Тогда
			Сообщение = НСтр("be = 'Радок %1 карыстальніку не ўстаноўлены ні адзін склад'; en = 'Row %1 user has no warehouse assigned'; es = 'Al usuario de la fila %1 no se le ha asignado ningún almacén'; ka = '%1 მომხმარებელს არ აქვს არცერთი საწყო'; kk = '%1 пайдаланушыға ешқандай ақпарат анықталмаған'; ro = 'Rândul %1 utilizatorului nu i s-a atribuit niciun depozit'; ru = 'Строка %1 пользователю не установлен ни один склад'; tr = '%1 kullanıcı için depo belirlenmemiş'; uk = 'Рядок %1 користувачу не встановлено жодного складу'; uz = '%1 foydalanuvchiga hech qanday ombor belgilanmagan'");
			Сообщение = _ЛокКонтекст.ЛокЯдро_СтрШаблон(Сообщение, ТаблицаПользователейMS.Индекс(СтрокаПользователя) + 1);
			Сообщить(Сообщение); 
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Не Отказ;	
	
КонецФункции         

&НаСервере
Процедура ФормированиеТабличногоДокументаЧерезПостроитель(ТабДок)
	
	Построитель = Новый ПостроительОтчета;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Построитель.ИсточникДанных 	= Новый ОписаниеИсточникаДанных(ТаблицаПользователейMS.Скопировать(, "Имя,Пароль,Штрихкод"));    
	#Иначе
    	Построитель.ИсточникДанных 	= Новый ОписаниеИсточникаДанных(ТаблицаПользователейMS.Выгрузить(, "Имя,Пароль,Штрихкод"));    
	#КонецЕсли
    Построитель.Выполнить();
    Построитель.Вывести(ТабДок);   	

КонецПроцедуры

#КонецОбласти

#Если ТолстыйКлиентОбычноеПриложение Тогда
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	Объект = ЭтотОбъект;
#КонецЕсли
