&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Не важно под какой организацией получаем данные
	ТочноеСовпадение = Ложь;
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
	Если ПараметрыСервиса.АвторизацияВыполнена Тогда
		Элементы.ЕстьВСервисеЛогистика.Видимость = Истина;
	Иначе
		Элементы.ЕстьВСервисеЛогистика.Видимость = Ложь;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере_ФормаСписка(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтборОбменЛогистическимиСообщениями = "Все";
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтборОбменЛогистическимиСообщениямиПриИзменении(Элемент)
	
	УстановитьОтборДинСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинСписка()

	Список.Отбор.Элементы.Очистить();
	
	Если ОтборОбменЛогистическимиСообщениями = "Наши" Тогда 
	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= Истина;  
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Наш");
		ЭлементОтбора.ПравоеЗначение 	= истина;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзДиадока(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаВыбораПоИННКПП",
	Новый Структура("РежимПоиска", Истина)	, ЭтаФорма, ЭтаФорма, "ОбработчикОбновить",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ОбновитьОрганизации" Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт 

	Элементы.Список.Обновить();

КонецПроцедуры



