#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МЧД = Параметры.Ключ;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачатьОбновлениеСтатуса();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПовторитьОбновлениеСтатуса(Команда)
	НачатьОбновлениеСтатуса();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьОбновлениеСтатуса()
	
	УправлениеФормойВыполнение();
	
	КоличествоПопытокОбновленияСтатуса = МаксимальноеКоличествоПопытокОбновленияСтатуса();
	
	ОтложенноеОбновлениеСтатусаИзРеестраФНС();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложенноеОбновлениеСтатусаИзРеестраФНС()
	ПодключитьОбработчикОжидания("ОбновитьСтатусИзРеестраФНС", 1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусИзРеестраФНС()
	
	КоличествоПопытокОбновленияСтатуса = КоличествоПопытокОбновленияСтатуса - 1;
	
	ДлительнаяОперация = НачатьОбновлениеСтатусаИзРеестраФНС(МЧД, УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииОбновленияСтатусаИзРеестраФНС", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);

КонецПроцедуры

// Параметры:
//  Доверенность - СправочникСсылка.МЧД003
//  ИдентификаторФормы - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
&НаСервереБезКонтекста
Функция НачатьОбновлениеСтатусаИзРеестраФНС(Знач Доверенность, Знач ИдентификаторФормы)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"МашиночитаемыеДоверенности.ОбновитьСтатусМЧДИзРеестраФНС", Доверенность);
	
КонецФункции

// Параметры:
//  ДлительнаяОперация - см. ДлительныеОперации.ВыполнитьФункцию
//  ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ПриЗавершенииОбновленияСтатусаИзРеестраФНС(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	СтатусОбновлен = Ложь;
	ТребуетсяНовыйЗапросСтатуса = Ложь;
	
	Если ДлительнаяОперация <> Неопределено И ДлительнаяОперация.Статус <> "Ошибка" Тогда
		
		Результат = ОбщегоНазначенияБЭДВызовСервера.ПолучитьИУдалитьИзВременногоХранилища(
			ДлительнаяОперация.АдресРезультата); // См. МашиночитаемыеДоверенности.ОбновитьСтатусМЧДИзРеестраФНС
		
		Если Результат <> Неопределено И Не ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			Если Результат.СтатусВРеестреФНС = Неопределено Тогда
				ТребуетсяНовыйЗапросСтатуса = КоличествоПопытокОбновленияСтатуса > 0;
			Иначе
				СтатусОбновлен = Истина;
			КонецЕсли
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяНовыйЗапросСтатуса Тогда
		ОтложенноеОбновлениеСтатусаИзРеестраФНС();
		Возврат;
	КонецЕсли;
	
	Если СтатусОбновлен Тогда
		УправлениеФормойВыполнено();
	Иначе
		УправлениеФормойОшибка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойВыполнение()
	
	Элементы.ГруппаВыполнение.Видимость = Истина;
	Элементы.ГруппаВыполнено.Видимость = Ложь;
	Элементы.ГруппаОшибка.Видимость = Ложь;
	
	УправлениеФормойВидимостьКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойВыполнено()
	
	Элементы.ГруппаВыполнение.Видимость = Ложь;
	Элементы.ГруппаВыполнено.Видимость = Истина;
	Элементы.ГруппаОшибка.Видимость = Ложь;
	
	УправлениеФормойВидимостьКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойОшибка()
	
	Элементы.ГруппаВыполнение.Видимость = Ложь;
	Элементы.ГруппаВыполнено.Видимость = Ложь;
	Элементы.ГруппаОшибка.Видимость = Истина;
	
	УправлениеФормойВидимостьКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойВидимостьКнопок()
	
	Элементы.Отмена.Видимость = Элементы.ГруппаВыполнение.Видимость ИЛИ Элементы.ГруппаОшибка.Видимость;
	Элементы.ОК.Видимость = Элементы.ГруппаВыполнено.Видимость;
	Элементы.Повторить.Видимость = Элементы.ГруппаОшибка.Видимость;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МаксимальноеКоличествоПопытокОбновленияСтатуса()
	Возврат 3;
КонецФункции

#КонецОбласти
