
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ДанныеПротокола);
	Элементы.Статус.ВыбиратьТип = Ложь; // Типизируется значением из документа и более тип не должен изменяться
	АвторДокумента = Параметры.АвторДокумента; // Параметр выбора статуса
	Заголовок = Параметры.Заголовок;
	
	Если Параметры.ЭтоНоваяЗапись Тогда
		
		// Заполнятся только при сохранении, не нагружаем форму:
		Элементы.Дата.Видимость  = Ложь;
		Элементы.Автор.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Не Параметры.ИзменятьСтатус Тогда
		
		Если Параметры.ЭтоНоваяЗапись Тогда
			Элементы.Статус.Видимость = Ложь;
		Иначе
			Элементы.Статус.Вид = ВидПоляФормы.ПолеНадписи;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Параметры.РазрешитьРедактирование Тогда
		ТолькоПросмотр = Истина;
		Элементы.ФормаГруппаКнопокРедактирование.Видимость = Ложь;
		Элементы.ФормаГруппаКнопокПросмотр.Видимость = Истина;
		Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	ОбработатьИзменениеСтатуса();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если ЭтоКонечныйСтатусДокумента Тогда
		НепроверяемыеРеквизиты.Добавить("Исполнитель");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	ОбработатьИзменениеСтатуса();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
		
	ВозвращаемоеЗначение = РаботаСПротоколомДокументаКлиентСервер.ИзменяемыеСвойстваПротокола();
	ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, ЭтотОбъект);
	Закрыть(ВозвращаемоеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьИзменениеСтатуса()
	
	ЭтоКонечныйСтатусДокумента = РаботаСПротоколомДокумента.ЭтоКонечныйСтатусДокумента(Статус);
	Элементы.Исполнитель.Доступность = Не ЭтоКонечныйСтатусДокумента;
	Элементы.Исполнитель.АвтоОтметкаНезаполненного = Не ЭтоКонечныйСтатусДокумента;
	
	Если ЭтоКонечныйСтатусДокумента Тогда
		Исполнитель = Неопределено;
		Элементы.Исполнитель.ПодсказкаВвода = НСтр("ru = '<не перенаправляется>'");
		Элементы.Комментарий.ПодсказкаВвода = НСтр("ru = 'Можно указать комментарий к закрытию документа'");
		Элементы.Исполнитель.ОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.Исполнитель.ПодсказкаВвода = Неопределено;
		Элементы.Комментарий.ПодсказкаВвода = НСтр("ru = 'Можно указать комментарий к перенаправлению документа'");
	КонецЕсли;
	
	Если ТолькоПросмотр Тогда
		Элементы.Комментарий.ПодсказкаВвода = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

