////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции для онбординга:
// - для запуска онбординга на формах;
// - для получения таргетированной ссылки для формы;
// - для настройки открытия онбординга для конкретного пользователя
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Запускает онбординг в переданной форме, если он существует
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ПриОткрытииФормы(Форма) Экспорт
	
	Принудительно = Ложь;
	ЗапуститьОнбординг(Форма, Принудительно);

КонецПроцедуры // ПриОткрытииФормы

// Возвращает Истина, если пользователь открывал указанный онбординг.
//
// Параметры:
//  ИдентификаторОнбординга - Строка - см. КонтурЛогистика_ОнбродингКлиентСервер.ТипыОнбординга()
//
// Возвращаемое значение:
//   Булево - пользователь открывал указанный онбординг
//   
Функция ТекПользовательОткрывалОнбординг(ИдентификаторОнбординга) Экспорт
	
	Возврат КонтурЛогистика_ОнбордингСервер.ТекПользовательОткрывалОнбординг(ИдентификаторОнбординга);
		
КонецФункции // ТекПользовательОткрывалОнбординг

// Записывает в хранилище общих настроек, факт открытия указанного онбординга текущим пользователем
//
// Параметры:
//  ИдентификаторОнбординга - Строка - см. КонтурЛогистика_ОнбродингКлиентСервер.ТипыОнбординга()
//
Процедура ТекПользовательОткрылОнбординг(ИдентификаторОнбординга) Экспорт
	
	КонтурЛогистика_ОнбордингСервер.ТекПользовательОткрылОнбординг(ИдентификаторОнбординга);
		
КонецПроцедуры // ТекПользовательОткрылОнбординг

// Открывает онбординг, или запускает таргетированную ссылку, если не нашли нужный онбординг.
// Если указан параметр Принудительно, то пользователь сам инициировал запуск онбординга
// на указанной форме. Если мы не смогли найти нужный онбординг, то попытаемся найти 
// таргетированную ссылку и открыть ее.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//	Принудительно - Булево - Пльзователь сам инициировал запуск онбординга - Истина по умолчанию
//
Процедура ЗапуститьОнбординг(Форма, Принудительно = Истина) Экспорт
	
	
	ИмяФормы = Форма.ИмяФормы;
	
	ИдентификаторОнбординга = ИдентификаторОнбордингаДляФормы(ИмяФормы);
	
	Если ИдентификаторОнбординга = Неопределено Тогда
		
		Если Принудительно Тогда
			ОткрытьТаргетированнуюСсылку(ИмяФормы);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если Принудительно Или НЕ КонтурЛогистика_ОнбордингСервер.ТекПользовательОткрывалОнбординг(ИдентификаторОнбординга) Тогда
		
		МиниТур = КонтурЛогистика_ОбновлениеСервер.ПолучитьОнбординг(ИдентификаторОнбординга);
		
		Если МиниТур = Неопределено Тогда
			
			Если Принудительно Тогда
				ОткрытьТаргетированнуюСсылку(ИмяФормы);
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
			
		ОткрытьФормуОнбординга(Форма, МиниТур, ИдентификаторОнбординга);
		
		Если Не Принудительно Тогда
			ОтправитьМетрикуАвтоматическогоОткрытияОнбординга(ИмяФормы, ИдентификаторОнбординга);
		Иначе
			ОтправитьМетрикуОткрытияОнбординга(ИмяФормы, ИдентификаторОнбординга);
		КонецЕсли;
		
		ТекПользовательОткрылОнбординг(ИдентификаторОнбординга);
		
	КонецЕсли;
	
КонецПроцедуры // ЗапуститьОнбординг

// Получает таргетированную ссылку для указанной формы из сервиса обновлений и открывает ее,
// если не получил, то открывает справку
//
// Параметры:
//  ИмяФормы - Имя формы
//
Процедура ОткрытьТаргетированнуюСсылку(ИмяФормы) Экспорт
	
	ТаргетированнаяСсылка = ТаргетированнаяСсылка(ИмяФормы);
	
	Если ТаргетированнаяСсылка = Неопределено Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(КонтурЛогистика_ОнбродингКлиентСервер.СсылкаСправка());
	Иначе	
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(ТаргетированнаяСсылка);
	КонецЕсли;
	
	ОтправитьМетрикуЗапросОнбординга(ИмяФормы);
	
КонецПроцедуры // ОткрытьТаргетированнуюСсылку

// Возвращает таргетированную ссылку из сервиса обновлений для указанной формы
//
// Параметры:
//  ИмяФормы - Имя формы
//
// Возвращаемое значение:
//   Строка - Навигационная ссылка - если не смогли найти, возвращает Неопределно
// 
Функция ТаргетированнаяСсылка(ИмяФормы) Экспорт
	
	МассивСсылок = КонтурЛогистика_ОбновлениеСервер.ПолучитьОнбординг(КонтурЛогистика_ОнбродингКлиентСервер.ТипыОнбординга().Неопределено);
	
	Если ТипЗнч(МассивСсылок) = Тип("Массив") И МассивСсылок.Количество() <> 0 Тогда 
		
		СоответствиеТаргетированныхСсылок = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьЗначение(МассивСсылок[0], Истина);
		
		Возврат СоответствиеТаргетированныхСсылок[ИмяФормы];
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ТаргетированнаяСсылка

// Открывает форму онбординга
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма с которой открывается онбординг 
//  МиниТур - Массив - Массив с текстом html шагов онбординга
//  ИдентификаторОнбординга - Строка - Идентифкиатор онбординга
//
Процедура ОткрытьФормуОнбординга(Форма, МиниТур, ИдентификаторОнбординга) Экспорт
	
	ПараметрыОткрытияФормы = Новый Структура();
	ПараметрыОткрытияФормы.Вставить("МиниТур", МиниТур);
	ПараметрыОткрытияФормы.Вставить("ИдентификаторОнбординга", ИдентификаторОнбординга);
	ПараметрыОткрытияФормы.Вставить("ИмяФормыВладельца", Форма.ИмяФормы);
	
	ОткрытьФорму("Обработка.КонтурЛогистика_Онбординг.Форма.Форма", ПараметрыОткрытияФормы, Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // ОткрытьФормуОнбординга

// Отправляет метрику о запросе онбординга на указанной форме
//
// Параметры:
//  ИмяФормы - Имя формы - Имя формы с которой открывается онбординг 
//
Процедура ОтправитьМетрикуЗапросОнбординга(ИмяФормы) Экспорт
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Онбординг", "Запрос онбординга", 
	ИмяФормы,, Ложь);
	
КонецПроцедуры // ОтправитьМетрикуЗапросОнбординга

// Отправляет метрику об интерактивном открытие онбординга на указанной форме
//
// Параметры:
//  ИмяФормы - Имя формы - Имя формы с которой открывается онбординг 
//  ИдентификаторОнбординга - Строка - Идентифкиатор онбординга
//
Процедура ОтправитьМетрикуОткрытияОнбординга(ИмяФормы, ИдентификаторОнбординга) Экспорт
	
	ДопИнформация = Новый Структура;
	ДопИнформация.Вставить("ИдентификаторОнбординга", ИдентификаторОнбординга);
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Онбординг", "Открытие онбординга", 
	"Обработка.КонтурЛогистика_Онбординг.Форма.Форма", ИмяФормы, Ложь, ДопИнформация);
	
КонецПроцедуры // ОтправитьМетрикуОткрытияОнбординга

// Отправляет метрику об автоматическом открытие онбординга на указанной форме
//
// Параметры:
//  ИмяФормы - Имя формы - Имя формы с которой открывается онбординг 
//  ИдентификаторОнбординга - Строка - Идентифкиатор онбординга
//
Процедура ОтправитьМетрикуАвтоматическогоОткрытияОнбординга(ИмяФормы, ИдентификаторОнбординга) Экспорт
	
	ДопИнформация = Новый Структура;
	ДопИнформация.Вставить("ИдентификаторОнбординга", ИдентификаторОнбординга);
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Онбординг", "Вызвать онбординг", 
	ИмяФормы,, Ложь, ДопИнформация);
	
КонецПроцедуры // ОтправитьМетрикуАвтоматическогоОткрытияОнбординга

// Возвращает идентификатор онбординга, если для указанной формы онбординг существует
//
// Параметры:
//  ИмяФормы - Имя формы
//
// Возвращаемое значение:
//   Строка - Тип онбординга - см. КонтурЛогистика_ОнбродингКлиентСервер.ТипыОнбординга()
// 
Функция ИдентификаторОнбордингаДляФормы(ИмяФормы) Экспорт
	
	Если ОнбордингПриПервомЗапускеАдминистратором(ИмяФормы) Тогда
		
		Возврат КонтурЛогистика_ОнбродингКлиентСервер.ТипыОнбординга().ПервыйЗапускАдмин;
		
	ИначеЕсли ОнбордингПриПервомЗапускеДляЭТрНЗЗ(ИмяФормы) Тогда
		
		Возврат КонтурЛогистика_ОнбродингКлиентСервер.ТипыОнбординга().ПервыйЗапускЭТрНЗЗ; 
		
	ИначеЕсли ОнбордингПриПервомЗапускеДляЭПЛ(ИмяФормы) Тогда
		
		Возврат КонтурЛогистика_ОнбродингКлиентСервер.ТипыОнбординга().ПервыйЗапускЭПЛ; 
		
	ИначеЕсли ОнбордингНастройкиКонвертацииДокументов(ИмяФормы) Тогда
		
		Возврат КонтурЛогистика_ОнбродингКлиентСервер.ТипыОнбординга().ОткрытиеНастроекКонвертацииДокументов;
		
	ИначеЕсли ОнбордингНастройкиКонвертацииСправочников(ИмяФормы) Тогда
		
		Возврат КонтурЛогистика_ОнбродингКлиентСервер.ТипыОнбординга().ОткрытиеНастроекКонвертацииСправочников;
		
	ИначеЕсли ОнбордингНастройкиПодписания(ИмяФормы) Тогда
		
		Возврат КонтурЛогистика_ОнбродингКлиентСервер.ТипыОнбординга().ОткрытиеНастроекПодписания;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции // ИдентификаторОнбордингаДляФормы

// Возвращает Истина, если для переданной формы есть онбординг по условиям:
// - Открыта форма Рабочий стол
// - Текущий пользователь администратор
// - Стартовый помощник пройден 
//
// Параметры:
//  ИмяФормы - Имя формы
//
// Возвращаемое значение:
//   Булево - Истина если условия соблюдены
// 
Функция ОнбордингПриПервомЗапускеАдминистратором(ИмяФормы) Экспорт
	
	Если ИмяФормы = ИмяФормыРабочийСтол()
		И КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор() Тогда		
		
		Результат = КонтурЛогистика_ОбщегоНазначенияСервер.НеобходимыеНастройкиДляРаботыПодсистемыЗаполнены();
		
		Если НЕ ЗначениеЗаполнено(Результат.ТекСтраницаПомошника) Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ОнбордингПриПервомЗапускеАдминистратором

// Возвращает Истина, если для переданной формы есть онбординг по условиям:
// - Открыта форма Рабочий стол
// - Текущий пользователь не администратор
// - Используется ЭТрН или Заказ заявка 
//
// Параметры:
//  ИмяФормы - Имя формы
//
// Возвращаемое значение:
//   Булево - Истина если условия соблюдены
//
Функция ОнбордингПриПервомЗапускеДляЭТрНЗЗ(ИмяФормы)
	
	Если ИмяФормы = ИмяФормыРабочийСтол()
		И НЕ КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		И (КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяТРН")
		Или КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЗаказЗаявка")) Тогда
		
		Возврат Истина;

	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ОнбордингПриПервомЗапускеДляЭТрНЗЗ

// Возвращает Истина, если для переданной формы есть онбординг по условиям:
// - Открыта форма Рабочий стол
// - Текущий пользователь не администратор
// - Не используется ЭТрН и не используется Заказ заявка
// - Используется путевой лист
//
// Параметры:
//  ИмяФормы - Имя формы
//
// Возвращаемое значение:
//   Булево - Истина если условия соблюдены
//
Функция ОнбордингПриПервомЗапускеДляЭПЛ(ИмяФормы)
	
	Если ИмяФормы = ИмяФормыРабочийСтол()
		И НЕ КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		И НЕ (КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяТРН")
		Или КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяЗаказЗаявка"))
		И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист") Тогда
		
		Возврат Истина;

	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ОнбордингПриПервомЗапускеДляЭПЛ

// Возвращает Истина, если для переданной формы есть онбординг по условиям:
// - Открыта форма настройки конвертации документов
//
// Параметры:
//  ИмяФормы - Имя формы
//
// Возвращаемое значение:
//   Булево - Истина если условия соблюдены
//
Функция ОнбордингНастройкиКонвертацииДокументов(ИмяФормы)
	
	Если ИмяФормы = ИмяФормыНастройкиКонвертацииДокументов() Тогда
		
		Возврат Истина;

	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ОнбордингНастройкиКонвертацииДокументов

// Возвращает Истина, если для переданной формы есть онбординг по условиям:
// - Открыта форма настройки конвертации справочников
//
// Параметры:
//  ИмяФормы - Имя формы
//
// Возвращаемое значение:
//   Булево - Истина если условия соблюдены
//
Функция ОнбордингНастройкиКонвертацииСправочников(ИмяФормы)
	
	Если ИмяФормы = ИмяФормыНастройкиКонвертацииСправочников() Тогда
		
		Возврат Истина;

	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ОнбордингНастройкиКонвертацииСправочников

// Возвращает Истина, если для переданной формы есть онбординг по условиям:
// - Открыта форма настройки подписания
//		или открыта форма настройки сертификатов
//		или открыта форма мчд
//
// Параметры:
//  ИмяФормы - Имя формы
//
// Возвращаемое значение:
//   Булево - Истина если условия соблюдены
//
Функция ОнбордингНастройкиПодписания(ИмяФормы)
	
	Если ИмяФормы = ИмяФормыНастройкиПодписания()
		Или ИмяФормы = ИмяФормыНастройкиСертификаты()
		Или ИмяФормы = ИмяФормыМЧД() Тогда
		
		Возврат Истина;

	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ОнбордингНастройкиПодписания

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяФормыРабочийСтол()
	
	Возврат "Обработка.КонтурЛогистика_РабочийСтол.Форма.Форма";
	
КонецФункции // ИмяФормыРабочийСтол

Функция ИмяФормыНастройкиКонвертацииДокументов() 
	
	Возврат "Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.Форма.ФормаСписка";
	
КонецФункции // ИмяФормыНастройкиКонвертацииДокументов

Функция ИмяФормыНастройкиКонвертацииСправочников() 
	
	Возврат "Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаСписка";
	
КонецФункции // ИмяФормыНастройкиКонвертацииСправочников

Функция ИмяФормыНастройкиПодписания() 
	
	Возврат "РегистрСведений.КонтурЛогистика_НастройкиПодписания.Форма.ФормаСписка";
	
КонецФункции // ИмяФормыНастройкиПодписания

Функция ИмяФормыНастройкиСертификаты() 
	
	Возврат "Справочник.КонтурЛогистика_СертификатыЭлектроннойПодписи.Форма.ФормаСписка";
	
КонецФункции // ИмяФормыНастройкиСертификаты

Функция ИмяФормыМЧД() 
	
	Возврат "Справочник.КонтурЛогистика_МЧД.Форма.ФормаСписка";
	
КонецФункции // ИмяФормыМЧД

#КонецОбласти

