Функция ПолучитьТаблицуСтилейXSL() Экспорт
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьТаблицуСтилейXSL();
КонецФункции

Функция ИспользуютсяХарактеристики() Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ИспользуютсяХарактеристики();
	
КонецФункции

Функция ЗначениеНастройки(ИмяНастройки, Партнер = Неопределено) Экспорт

	Возврат	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(ИмяНастройки, Партнер);

КонецФункции 

Функция ПустаяХарактеристика() Экспорт
	
	ИмяСпрХарактеристик = ЗначениеНастройки("ИмяСправочникаХарактеристика");
	
	Если ЗначениеЗаполнено(ИмяСпрХарактеристик) Тогда 
		Результат = ПредопределенноеЗначение("Справочник." + ИмяСпрХарактеристик + ".ПустаяСсылка");
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОпределитьКонфигурацию() Экспорт

	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();	

КонецФункции

Функция ПолучитьИмяСправочникаСущности(ИмяСущности) Экспорт

	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьИмяСправочникаСущности(ИмяСущности);

КонецФункции 

Функция ПолучитьСписокПринтеров() Экспорт
	
	мПринтеры = Новый СписокЗначений;
	
	Попытка
		КОМОбъект =  Новый COMОбъект ("WScript.Network");
		Принтеры =  КОМОбъект.EnumPrinterConnections();
		Сч = 0;
		Пока Сч < Принтеры.Count()-1 Цикл
			ИмяПринтераВСеансе = Принтеры.Item(Сч+1);
			мПринтеры.Добавить(ИмяПринтераВСеансе);
			Сч = Сч + 1;
		КонецЦикла;
	Исключение
		Возврат Неопределено;
		// TODO предусмотреть для linux
		// ТекстДокумента = новый ТекстовыйДокумент; 
		// ВременныйТексДокумент = ПолучитьИмяВременногоФайла();
		// КомандаСистемы("lpstat -p -d > " + ВременныйТексДокумент);
		// Sleep(2);   //не нужен?
		// ТекстДокумента.Прочитать(ВременныйТексДокумент);
		// ИзвлеченныйТекст = ТекстДокумента.ПолучитьТекст(); 
		//
		// УдалитьФайлы(ВременныйТексДокумент);
	КонецПопытки;
	
	Возврат мПринтеры;

КонецФункции	

Функция ЛюбаяНашаОрганизация() Экспорт

	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЛюбаяНашаОрганизация();

КонецФункции 

Процедура ПроверитьРежимТестирования() Экспорт
	
	РежимТестирования = ЭтоРежимТестирования();
	
	Если РежимТестирования Тогда
		// Установим блокироку если проходит тестирование
		КонтурЛогистика_ОбщегоНазначенияСервер.УстановитьНастройку(
			"ПараметрыБлокировки_РаботаСВнешнимиРесурсамиЗаблокирована", Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоРежимТестирования() Экспорт
	
	Результат = Неопределено;
	
	Попытка
		ИмяТипа = "ТестируемоеПриложение";
		Результат = Тип(ИмяТипа);
	Исключение
		НичегоНеДелакм = Истина;
	КонецПопытки;
	
	РежимТестирования = (Результат <> Неопределено);
	
	Возврат РежимТестирования;
	
КонецФункции

Функция ТребуетсяОбновление_НоваяВерсияУАТ_QR_МП_УАТ() Экспорт  
	
	Возврат КонтурЛогистика_ОбновлениеСерверПовтИсп.ТребуетсяОбновление_НоваяВерсияУАТ_QR_МП_УАТ();
	
КонецФункции

// Центр поддержки

Функция ПолучитьСервисЦентраПоддержки() Экспорт 

	ЦП_Сервис = ПолучитьФорму("Обработка.КонтурЛогистика_ЦентрПоддержки.Форма.МодульОбъектаКлиент");
	
	ИспользоватьТестовыйСерверЦП = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверЦентраПоддержки");
	ЦП_Сервис.Инит("logist-1c",,, ИспользоватьТестовыйСерверЦП);
	
	Возврат ЦП_Сервис;
	
КонецФункции