&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредельныйРазмерТекстаДляHTML = 500000;
	РежимПростойТекстФайлаXML 		= СтрДлина(ТекстФайлаXML) > ПредельныйРазмерТекстаДляHTML; 
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.ЗначениеКопирования) Тогда
		ТекстФайлаXML = ЭтаФорма.Параметры.ЗначениеКопирования.ТекстXML.Получить();	
		ТекстФайлаXMLПриИзмененииНаСервере();
	Иначе
		ЗаполнитьТекстыФайловИзХранилищаИРасширение();
	КонецЕсли;
	
	УправлениеВидимостью(Этаформа);
	ОтображениеГруппыТехПоля(ЭтаФорма);
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УправлениеОтображениемПредупреждениеШапка();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеОтображениемПредупреждениеШапка()
	
	РазличныеУИДВCustomData = Справочники.КонтурЛогистика_ФайлыОбмена.РазличныеУИДВCustomDataФайла(Объект.Ссылка);
	Элементы.ГруппаПредупреждениеШапка.Видимость = РазличныеУИДВCustomData;
	
	Если РазличныеУИДВCustomData Тогда
		Элементы.ОписаниеПредупрежденияШапка.Заголовок = "В таблице CustomData записаны несколько различных УИД. Возможна ошибка при отправке титула. Обратитесть в тех поддержку";
	Иначе
		Элементы.ОписаниеПредупрежденияШапка.Заголовок = "";
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьТекстФайлаXMLHTML();
	
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьДополнительныеДанные();
	
	ПодписьЗаполнена = ТипЗнч(ТекущийОбъект.Подпись.Получить()) = Тип("ДвоичныеДанные");
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПослеОбработкиOuterDocflows" Тогда 
		ЭтаФорма.Прочитать();
		ОтображениеГруппыТехПоля(ЭтаФорма);
	КонецЕсли;
	Если ИмяСобытия = "ПослеПодписанияНаВебклиенте" Тогда
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ТекстXML = Новый ХранилищеЗначения(ТекстФайлаXML, Новый СжатиеДанных(9));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокФормы()

	Заголовок = "Файл № " + Объект.Код + " " + Объект.ТипДокумента + ", " + Объект.Состояние;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстыФайловИзХранилищаИРасширение() Экспорт
	
	текОбъект = РеквизитФормыВЗначение("Объект");
	
	ТекстФайлаXML 		= текОбъект.ТекстXML.Получить();
	
	Для Сч = 0 По текОбъект.OuterDocflows.Количество() - 1 Цикл 
		
		Объект.OuterDocflows[Сч].ТекстОтвета = текОбъект.OuterDocflows[Сч].Текст.Получить();
		
		Если Объект.OuterDocflows[Сч].DocflowNamedId = "KlMt" Тогда 
			Объект.OuterDocflows[Сч].Расширение = "JSON";
		ИначеЕсли Объект.OuterDocflows[Сч].DocflowNamedId = "KlDriverConfirm" Тогда
			Объект.OuterDocflows[Сч].Расширение = "XML";
		Иначе
			Объект.OuterDocflows[Сч].Расширение = "---";
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекстФайлаXMLHTML() Экспорт
	
	Если РежимПростойТекстФайлаXML = Ложь 
		И СтрДлина(ТекстФайлаXML) <= ПредельныйРазмерТекстаДляHTML Тогда
		
		ТекстФайлаXMLHTML = КонтурЛогистика_ОбщегоНазначенияКлиент.ПреобразоватьXMLвHTML(ТекстФайлаXML);
		
	Иначе
		
		РежимПростойТекстФайлаXML = Истина;
		ТекстФайлаXMLHTML = "";
		
	КонецЕсли;
	
	Элементы.ТекстФайлаXML.Видимость = РежимПростойТекстФайлаXML;
	Элементы.ТекстФайлаXMLHTML.Видимость = Не РежимПростойТекстФайлаXML;
	
КонецПроцедуры

// Обработчики элементов формы

&НаКлиенте
Процедура ТекстФайлаXMLПриИзменении(Элемент)
	
	ТекстФайлаXMLПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТекстФайлаXMLПриИзмененииНаСервере()
	
	текОбъект = РеквизитФормыВЗначение("Объект");
	
	текОбъект.ТекстXML = Новый ХранилищеЗначения(ТекстФайлаXML, Новый СжатиеДанных(9));
	
	ЗначениеВРеквизитФормы(текОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	Элементы.ТекстФайлаXML.Видимость 			= РежимПростойТекстФайлаXML;
	
	Элементы.ТекстФайлаXMLHTML.Видимость 		= НЕ РежимПростойТекстФайлаXML;    
	
	Элементы.ГруппаОшибки.Видимость = ЗначениеЗаполнено(Объект.ОписаниеОшибок);
	Элементы.ГруппаПредупреждение.Видимость = ЗначениеЗаполнено(Объект.ОписаниеПредупреждения);
	
	Если Объект.ПодписьВерна И ЗначениеЗаполнено(Объект.Отпечаток) Тогда
		Элементы.СтраницаДанныеПодписи.Картинка = БиблиотекаКартинок.КонтурЛогистика_ПодписатьИОтправить;
		Элементы.СтраницаДанныеПодписи.Заголовок = "Подписан";
		Элементы.ГруппаДанныеПодписи.Видимость = Истина;
	ИначеЕсли Не Объект.ПодписьВерна И ЗначениеЗаполнено(Объект.Отпечаток) Тогда
		Элементы.СтраницаДанныеПодписи.Картинка = БиблиотекаКартинок.КонтурЛогистика_ИсправитьОшибки;
		Элементы.СтраницаДанныеПодписи.Заголовок = "Подпись не верна";
		Элементы.ГруппаДанныеПодписи.Видимость = Истина;
	Иначе
		Элементы.СтраницаДанныеПодписи.Картинка = Новый Картинка;
		Элементы.ГруппаДанныеПодписи.Видимость = Ложь;
		Если ПодписьЗаполнена Тогда
			Элементы.СтраницаДанныеПодписи.Заголовок = "Подпись не распознана";
		Иначе
			Элементы.СтраницаДанныеПодписи.Заголовок = "Подпись не вычитана";
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ФормаСправочникКонтурЛогистика_ФайлыОбменаПодписать.Доступность = НЕ Объект.ПодписьВерна;
	Элементы.ФормаСправочникКонтурЛогистика_ФайлыОбменаПроверитьПодпись.Доступность = Объект.ПодписьВерна;
	
	Если (ЗначениеЗаполнено(Объект.MessageID)
		Или ЗначениеЗаполнено(Объект.kl_id)) И Объект.Состояние = Перечисления.КонтурЛогистика_СосотоянияФайловОбмена.Получен Тогда
		
		Элементы.СтраницаОтправка.Картинка = БиблиотекаКартинок.КонтурЛогистика_Загрузить;
		Элементы.СтраницаОтправка.Заголовок = "Получен";
		
	ИначеЕсли (ЗначениеЗаполнено(Объект.MessageID) 
		Или ЗначениеЗаполнено(Объект.kl_id)) И Объект.Состояние = Перечисления.КонтурЛогистика_СосотоянияФайловОбмена.Отправлен Тогда
		
		Элементы.СтраницаОтправка.Картинка = БиблиотекаКартинок.КонтурЛогистика_Отправить;
		Элементы.СтраницаОтправка.Заголовок = "Отправлен";
		
	Иначе
		
		Элементы.СтраницаОтправка.Картинка = Новый Картинка;
		Элементы.СтраницаОтправка.Заголовок = "Не отправлен";
		
	КонецЕсли;
	
	Элементы.ФормаСправочникКонтурЛогистика_ФайлыОбменаОтправить.Доступность = НЕ ЗначениеЗаполнено(Объект.ДатаЭДО);
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОткрытьвВебДиадок.Доступность = ЗначениеЗаполнено(Объект.MessageID) И ЗначениеЗаполнено(Объект.DocumentId);
	
	ЕстьМЧД = ЗначениеЗаполнено(Объект.ИдентификаторМЧД);
	
	Если ЕстьМЧД Тогда
		Элементы.ГруппаМЧД.Заголовок = "Машиночитаемая доверенность";
	Иначе
		Элементы.ГруппаМЧД.Заголовок = "Без доверенности";
		Элементы.ИдентификаторМЧД.Видимость = Ложь;
	КонецЕсли;
	
	// Вторая подпись
	ЕстьВтораяПодпись = ЗначениеЗаполнено(ВторойОтпечаток);
	Если ЕстьВтораяПодпись Тогда
		ЕстьВтораяМЧД = ЗначениеЗаполнено(ВторойИдентификаторМЧД);
		Если ЕстьВтораяМЧД Тогда
			Элементы.ГруппаВтораяМЧД.Заголовок = "Машиночитаемая доверенность";
		Иначе
			Элементы.ГруппаВтораяМЧД.Заголовок = "Без доверенности";
			Элементы.ВторойИдентификаторМЧД.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ГруппаДанныеВторойПодписи.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПростойТекстПриИзменении(Элемент)
	
	РежимПростойТекстЗапросОтветПриИзменении("ТекстФайлаXML");	

КонецПроцедуры

&НаКлиенте
Процедура РежимПростойТекстФайлаXMLПриИзменении(Элемент)
	
	РежимПростойТекстЗапросОтветПриИзменении("ТекстФайлаXMLОтвета");	
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПростойТекстЗапросОтветПриИзменении(ИмяРеквизита)
	
	РеквизитРежим = ЭтаФорма["РежимПростой" + ИмяРеквизита];// РежимПростойТекстФайлаXML
	РеквизитТекст = ЭтаФорма[ИмяРеквизита];
	
	Если РеквизитРежим Тогда // простой текст
		
		ТекстHTML = "";
		УстановитьВидимостьДоступностьЭлементов();
		
	Иначе
		
		Если СтрДлина(РеквизитТекст) > ПредельныйРазмерТекстаДляHTML Тогда
			
			ТекстВопроса = "Преобразование в HTML может занять от нескольких секунд до нескольких десятков секунд (слишком большой текст). Продолжить?";
			КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЭтаФорма, 
							"ОбработчикРежимПростойТекст", ИмяРеквизита);
		Иначе
			
			ОбработчикРежимПростойТекст(КодВозвратаДиалога.Да, ИмяРеквизита);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРежимПростойТекст(Ответ, ИмяРеквизита) Экспорт
	
	РеквизитРежим = ЭтаФорма["РежимПростой" + ИмяРеквизита];// РежимПростойТекстФайлаXML
	РеквизитТекст = ЭтаФорма[ИмяРеквизита];
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ИмяРеквизитаXMLHTML = СтрЗаменить(ИмяРеквизита, "XML", "XMLHTML");
		ЭтаФорма[ИмяРеквизитаXMLHTML] = КонтурЛогистика_ОбщегоНазначенияКлиент.ПреобразоватьXMLвHTML(РеквизитТекст);
	Иначе
		РеквизитРежим = НЕ РеквизитРежим;
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементов();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправительШаблонаПриИзменении(Элемент)
	
	УправлениеВидимостью(ЭтаФорма);

КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(Форма)
	
	Если ЗначениеЗаполнено(Форма.Объект.ОтправительШаблона) Тогда
		
		Форма.Элементы.ФормаСправочникКонтурЛогистика_ФайлыОбменаОтправить.Заголовок = "Отправить шаблон";
		Форма.Элементы.СтраницаДанныеПодписи.Видимость = Ложь;
		Форма.Элементы.ГруппаТребуетсяПодпись.Видимость = Ложь;
		Форма.Элементы.ФормаСправочникКонтурЛогистика_ФайлыОбменаПодписать.Видимость = Ложь;
		
	Иначе
		
		Форма.Элементы.ФормаСправочникКонтурЛогистика_ФайлыОбменаОтправить.Заголовок = "Отправить";
		Форма.Элементы.СтраницаДанныеПодписи.Видимость = Истина;
		Форма.Элементы.ГруппаТребуетсяПодпись.Видимость = Истина;
		Форма.Элементы.ФормаСправочникКонтурЛогистика_ФайлыОбменаПодписать.Видимость = Истина;
		
	КонецЕсли;
	
	Если Форма.Объект.Состояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СосотоянияФайловОбмена.Получен") Тогда
		Форма.Элементы.ГруппаТребуетсяПодпись.Видимость = Ложь;
	КонецЕсли;
	
	Если Форма.Объект.КаналТранспорта = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_КаналыТранспорта.API_КонтурЛогистика") Тогда
		Форма.Элементы.Составитель.Видимость = Истина;
		Форма.Элементы.ОтправительШаблона.Видимость = Ложь;
		Форма.Элементы.ШаблонОснование.Видимость = Ложь;
	Иначе
		Форма.Элементы.Составитель.Видимость = Ложь;
		Если ЗначениеЗаполнено(Форма.Объект.ШаблонОснование) Тогда
			Форма.Элементы.ОтправительШаблона.Видимость = Ложь;
			Форма.Элементы.ШаблонОснование.Видимость = Истина;
		Иначе
			Форма.Элементы.ОтправительШаблона.Видимость = Истина;
			Форма.Элементы.ШаблонОснование.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Форма.Элементы.ДекорацияТестовыйДокумент.Видимость = (Форма.Объект.ТестовыйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура OuterDocflowsВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "OuterDocflowsТекстОтвета" Тогда 
		СтандартнаяОбработка = Ложь;
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Элемент.ТекущиеДанные.ТекстОтвета);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура OuterDocflowsОбработанПриИзменении(Элемент)
	
	ОтображениеГруппыТехПоля(ЭтаФорма);  
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтображениеГруппыТехПоля(Форма)
	
	нСтроки = Форма.Объект.OuterDocflows.НайтиСтроки(Новый Структура("Обработан", Ложь));
	Если нСтроки.Количество() Тогда 
		Форма.Элементы.СтраницаТехПоля.Заголовок = "Технологические поля - не обработан OuterDocflows";
		Форма.Элементы.СтраницаТехПоля.Картинка = БиблиотекаКартинок.КонтурЛогистика_ВосклицаниеКрасное;
	Иначе
		Форма.Элементы.СтраницаТехПоля.Заголовок = "Технологические поля";
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура КаналТранспортаПриИзменении(Элемент)
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеДанные()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ФайлыОбменаСогласующиеПодписи.Подпись КАК Подпись,
	|	КонтурЛогистика_ФайлыОбменаСогласующиеПодписи.Отпечаток КАК Отпечаток,
	|	КонтурЛогистика_ФайлыОбменаСогласующиеПодписи.КомуВыданСертификат КАК КомуВыданСертификат,
	|	КонтурЛогистика_ФайлыОбменаСогласующиеПодписи.СертификатНаСервере КАК СертификатНаСервере,
	|	КонтурЛогистика_ФайлыОбменаСогласующиеПодписи.СтатусПроверкиСертификата КАК СтатусПроверкиСертификата,
	|	КонтурЛогистика_ФайлыОбменаСогласующиеПодписи.ИдентификаторМЧД КАК ИдентификаторМЧД,
	|	КонтурЛогистика_ФайлыОбменаСогласующиеПодписи.СтатусПроверкиМЧДПоТитулу КАК СтатусПроверкиМЧДПоТитулу,
	|	КонтурЛогистика_ФайлыОбменаСогласующиеПодписи.ОшибкиПроверкиМЧД КАК ОшибкиПроверкиМЧД
	|ИЗ
	|	Справочник.КонтурЛогистика_ФайлыОбмена.СогласующиеПодписи КАК КонтурЛогистика_ФайлыОбменаСогласующиеПодписи
	|ГДЕ
	|	КонтурЛогистика_ФайлыОбменаСогласующиеПодписи.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ВторойИдентификаторМЧД = Выборка.ИдентификаторМЧД;
		ВторойКомуВыданСертификат = Выборка.КомуВыданСертификат;
		ВторойОтпечаток = Выборка.Отпечаток;
		ВторойСертификатНаСервере = Выборка.СертификатНаСервере;
		ВторойСтатусПроверкиМЧДПоТитулу = Выборка.СтатусПроверкиМЧДПоТитулу;
		
	КонецЕсли;
	
КонецПроцедуры