
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Возврат при получении формы для анализа.
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИспользуетсяДоставка25 = ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка25();
	
	Ордер = Параметры.Ордер;
	ОтгрузкаПоЗаданиюНаПеревозку = Параметры.ОтгрузкаПоЗаданиюНаПеревозку;
	Если ИспользуетсяДоставка25 Тогда
		Рейс = Параметры.ЗаданиеНаПеревозку;
	Иначе
		ЗаданиеНаПеревозку = Параметры.ЗаданиеНаПеревозку;
	КонецЕсли;
	
	Элементы.ЗаданиеНаПеревозку.Видимость = Не ИспользуетсяДоставка25;
	
	ВариантЗавершенияПроверкиОрдера = "УстановитьСтатусПроверен";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаданиеНаПеревозкуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Ордер", Ордер);
	
	ОткрытьФорму("Документ.РасходныйОрдерНаТовары.Форма.ФормаВыбораЗаданияНаПеревозку",
		ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если ВариантЗавершенияПроверкиОрдера = "УстановитьСтатусКОтгрузке"
		И ОтгрузкаПоЗаданиюНаПеревозку
		И Не ЗначениеЗаполнено(ЗаданиеНаПеревозку)
		И Не ИспользуетсяДоставка25 Тогда
		
		ТекстСообщения = НСтр("ru = 'Не выбрано задание на перевозку.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Неопределено, "ЗаданиеНаПеревозку");
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ВариантЗавершенияПроверкиОрдера", ВариантЗавершенияПроверкиОрдера);
	ПараметрыОповещения.Вставить("БольшеНеСпрашивать", БольшеНеСпрашивать);
	Если ИспользуетсяДоставка25 Тогда
		ПараметрыОповещения.Вставить("ЗаданиеНаПеревозку", Рейс);
	Иначе
		ПараметрыОповещения.Вставить("ЗаданиеНаПеревозку", ЗаданиеНаПеревозку);
	КонецЕсли;
	
	Оповестить("УстановленВариантЗавершенияПроверкиОрдера", ПараметрыОповещения, ЭтаФорма.ИмяФормы);
	
	Закрыть(КодВозвратаДиалога.ОК);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента      = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаданиеНаПеревозку.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВариантЗавершенияПроверкиОрдера");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "УстановитьСтатусКОтгрузке";
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОтгрузкаПоЗаданиюНаПеревозку");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаданиеНаПеревозку");
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
КонецПроцедуры

#КонецОбласти
