#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура АУ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтраницаСтатьиБюджета = АУ_СозданиеЭлементовФормы.СоздатьСтраница(
		ЭтаФорма,
		"АУ_СтраницаСтатьиБюджета",
		"ГруппаСтраницы",
		НСтр("ru = 'Статьи бюджета'"),
		1);
	
	АУ_СозданиеЭлементовФормы.СоздатьТаблицаФормы(
		ЭтаФорма,
		"АУ_СтатьиБюджета",
		СтраницаСтатьиБюджета,
		"Объект.АУ_СтатьиБюджета",
		Новый Структура("СтатьяБюджета,Сумма", НСтр("ru = 'Статья бюджета'"), НСтр("ru = 'Сумма'")));
	
	Элементы.АУ_СтатьиБюджета.УстановитьДействие("ПриНачалеРедактирования", "ПриНачалеРедактированияСтатейБюджета");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПриНачалеРедактированияСтатейБюджета(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элемент.ТекущиеДанные.Сумма = Объект.СуммаДокумента - Объект.АУ_СтатьиБюджета.Итог("Сумма");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
