
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Параметры.Документ;
	
	Если ТипЗнч(Документ) = Тип("СправочникСсылка.ЕГАИСПрисоединенныеФайлы") Тогда
		//@skip-warning
		ОписаниеОшибки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Описание");
	Иначе
		ОписаниеОшибки = ОбменДаннымиЕГАИСВызовСервера.ТекстОшибкиИзПротокола(Параметры.Документ);
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
