
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ТолькоИзменение Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ИдентификаторЭДО", "ТолькоПросмотр", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ИдентификаторЭДООткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.ОткрытьФормуУчетнойЗаписиЭДО(Запись.ИдентификаторЭДО);
КонецПроцедуры
#КонецОбласти

