#Область ПрограммныйИнтерфейс

&ИзменениеИКонтроль("ВариантОбеспеченияИФлагОбособленноПоУмолчанию")
Функция АУ_ВариантОбеспеченияИФлагОбособленноПоУмолчанию1(ЗаполнятьОбособленно)

	КОбеспечению   = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению");
	НеОбеспечивать = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется");

	Результат = Новый Структура();
	#Удаление
	Результат.Вставить("Товар",  Новый Структура("ВариантОбеспечения,Обособленно", КОбеспечению,   Ложь));
	Результат.Вставить("Тара",   Новый Структура("ВариантОбеспечения,Обособленно", КОбеспечению,   Ложь));
	#КонецУдаления
	#Вставка
	//++ШЛАН
	Результат.Вставить("Товар",  Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать,   Ложь));
	Результат.Вставить("Тара",   Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать,   Ложь));
	//--ШЛАН
	#КонецВставки
	Результат.Вставить("Работа", Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать, Ложь));
	Результат.Вставить("Услуга", Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать, Ложь));

	Если ЗаполнятьОбособленно Тогда

		Результат.Товар.Обособленно         = Истина;
		Результат.Работа.Обособленно        = Истина;
		Результат.Работа.ВариантОбеспечения = КОбеспечению;

	КонецЕсли;
	
	#Вставка
	//++ШЛАН
	Результат.Товар.Обособленно         = Истина;
	//--ШЛАН
	#КонецВставки

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
