///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПлатежныеСистемы.БазоваяФункциональностьПлатежныхСистем".
// ОбщийМодуль.ПлатежныеСистемыКлиент.
//
// Клиентские процедуры настройки подключения к платежным системам:
//  - открытие формы создания новой настройки параметров подключения;
//  - переход в журнал регистрации для просмотра логов подсистемы.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ПлатежныеСистемы

// Открывает форму создания новой настройки подключения к платежной системе.
//
// Параметры:
//  ПараметрыПодключения - Структура - параметры открытия формы:
//    * ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - идентификатор подключаемой платежной системы.
//    * ОтображатьОписаниеСервиса - Булево - признак отображения страницы описания сервиса.
//        Значение по умолчанию: Ложь.
//    * НастройкаДляКопирования - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка, будет создана
//                                  копированием существующей.
//                              - Неопределено - будет создана с нуля.
//    * НеПредлагатьПодключениеКОнлайнЗаказам - Булево - если в мастере создания новой настройки подключения к 
//       платежной системе есть возможность выполнить ее привязку к настройке Онлайн-заказов, то она не будет
//       использоваться, если данный параметр установлен в Истину.
//  ОповещениеОЗакрытии - Неопределено - оповещение о закрытии формы подключения не требуется. Значение по умолчанию.
//                      - ОписаниеОповещения - оповещение, которое необходимо вызвать после завершения настройки
//    подключения:
//      РезультатЗакрытия - Булево - Истина, если выполнена настройка подключения к платежной системе.
//      ДополнительныеПараметры - Произвольный - произвольные данные, переданные в описании оповещения.
//  ДополнительныеПараметры - Произвольный - дополнительные параметры подключения.
//    Значение будет передано в одноименный параметр переопределяемых методов:
//      см. ПлатежныеСистемыПереопределяемый.ПриНастройкеЭлементовФормыПодключения
//      см. ПлатежныеСистемыПереопределяемый.ПриЗаполненииФормыНастройкиПодключения
//
Процедура ПодключитьПлатежнуюСистемуСлужебный(
		ПараметрыПодключения,
		ОповещениеОЗакрытии = Неопределено,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПлатежнаяСистема", ПараметрыПодключения.ПлатежнаяСистема);
	ПараметрыФормы.Вставить("РежимРаботы", ПараметрыПодключения.РежимРаботы);
	ПараметрыФормы.Вставить("ОтображатьОписаниеСервиса", ПараметрыПодключения.ОтображатьОписаниеСервиса);
	ПараметрыФормы.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ПараметрыФормы.Вставить("НастройкаДляКопирования", ПараметрыПодключения.НастройкаДляКопирования);
	ПараметрыФормы.Вставить(
		"НеПредлагатьПодключениеКОнлайнЗаказам",
		ПараметрыПодключения.НеПредлагатьПодключениеКОнлайнЗаказам);
	
	ОткрытьФорму(
		"Обработка.ПодключениеКПлатежнымСистемам.Форма.Форма",
		ПараметрыФормы,
		,
		,
		,
		,
		ОповещениеОЗакрытии);
	
КонецПроцедуры

// Вызывает открытие формы кассовых ссылок из формы настройки подключения к платежным системам.
//
// Параметры:
//  ПараметрыНастройки - Структура - содержит в себе описание настроек подключения:
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - Ссылка на
//       элемент справочника, для которого необходимо открыть форму настройки кассовых ссылок.
//    * ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система настройки.
//  ОповещениеПослеЗакрытияФормыКассовыхСсылок - ОписаниеОповещения - оповещение о закрытии формы кассовых ссылок.
//
Процедура ПриНастройкеКассовыхСсылок(
		ПараметрыНастройки,
		ОповещениеПослеЗакрытияФормыКассовыхСсылок) Экспорт
	
	ПараметрыОплаты = НастройкиПлатежныхСистемВызовСервера.ПараметрыОплатыПоНастройке(
		ПараметрыНастройки.НастройкаПодключения);

	ИнтеграцияПодсистемБИПКлиент.ПриНастройкеКассовыхСсылокПлатежныхСистем(
		ПараметрыНастройки,
		ПараметрыОплаты,
		ОповещениеПослеЗакрытияФормыКассовыхСсылок);
	
	ПлатежныеСистемыКлиентПереопределяемый.ПриНастройкеКассовыхСсылок(
		ПараметрыНастройки,
		ПараметрыОплаты,
		ОповещениеПослеЗакрытияФормыКассовыхСсылок);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЖурналРегистрации

// Открывает форму журнала регистрации с отбором по событию
// см. ПлатежныеСистемыКлиентСервер.ИмяСобытияЖурналаРегистрации.
//
Процедура ОткрытьЖурналРегистрации() Экспорт
	
	Отбор = Новый Структура();
	Отбор.Вставить(
		"СобытиеЖурналаРегистрации",
		ПлатежныеСистемыКлиентСервер.ИмяСобытияЖурналаРегистрации(
			ОбщегоНазначенияКлиент.КодОсновногоЯзыка()));
	
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(Отбор);
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти