#Область ПрограммныйИнтерфейс

// Допустимые виды продукции, которые можно указать в документе импорта или производства ЕГАИС.
// 
// Параметры:
//  Сырье - Булево - для табличной части Сырья
// 
// Возвращаемое значение:
//  Массив Из СправочникСсылка.ВидыПродукцииИС - Допустимые виды продукции импорта производства
Функция ДопустимыеВидыПродукцииИмпортаПроизводства(Сырье = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииИСМПЕГАИС());
	Если Сырье Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииЕГАИС());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
