//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
	 ИЛИ НЕ ПроведениеДокументов.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойстваМВТ = ДополнительныеСвойства.МенеджерВременныхТаблиц; // МенеджерВременныхТаблиц
	
	Если ДополнительныеСвойстваМВТ.Таблицы.Найти("ДвиженияДоставкаПередЗаписью") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойстваДокумента = ДополнительныеСвойства.СвойстваДокумента; // См. ПроведениеДокументов.СвойстваДокумента
	
	Регистраторы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДополнительныеСвойства, "Регистраторы", Новый Массив); // Массив Из ДокументСсылка
	
	Если ЗначениеЗаполнено(Отбор.Регистратор.Значение) Тогда
		
		// Отмена проведения
		Регистраторы.Добавить(Отбор.Регистратор.Значение);
		
	КонецЕсли;
	
	Регистраторы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Регистраторы);  // Массив Из ДокументСсылка
	
	Запрос = Новый Запрос;
	ТекстЗапроса = ТекстЗапросаПередЗаписью();
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);
	Запрос.УстановитьПараметр("ЭтоНовый", ДополнительныеСвойстваДокумента.ЭтоНовый);
	Запрос.УстановитьПараметр("ОбменДанными", ОбменДанными.Загрузка);
	РассчитыватьИзменения = ПроведениеДокументов.РассчитыватьИзменения(ДополнительныеСвойства);
	Запрос.УстановитьПараметр("РассчитыватьИзменения", РассчитыватьИзменения);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойстваМВТ;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
	 ИЛИ НЕ ПроведениеДокументов.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	ФиксироватьИзмененияПослеЗаписи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДополнительныеСвойства, "ФиксироватьИзмененияПослеЗаписи", Истина);
	
	Если ФиксироватьИзмененияПослеЗаписи Тогда
		
		СформироватьТаблицуИзменений();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПередЗаписью()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таблица.Организация КАК Организация,
	|	Таблица.ТипДоставки КАК ТипДоставки,
	|	Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
	|	Таблица.СпособДоставки КАК СпособДоставки,
	|	Таблица.Отправитель КАК Отправитель,
	|	Таблица.ТочкаОтправителя КАК ТочкаОтправителя,
	|	Таблица.ЗонаОтправителя КАК ЗонаОтправителя,
	|	Таблица.Получатель КАК Получатель,
	|	Таблица.ТочкаПолучателя КАК ТочкаПолучателя,
	|	Таблица.ЗонаПолучателя КАК ЗонаПолучателя,
	|	Таблица.ДокументПланирования КАК ДокументПланирования,
	|	Таблица.Распоряжение КАК Распоряжение,
	|	Таблица.Рейс КАК Рейс,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Серия КАК Серия,
	|	Таблица.КодСтроки КАК КодСтроки,
	|	Таблица.Плечо КАК Плечо,
	|	Таблица.Перевозчик КАК Перевозчик,
	|	Таблица.Упаковка КАК Упаковка,
	|	Таблица.КДоставке КАК КДоставке,
	|	Таблица.КРейсу КАК КРейсу,
	|	Таблица.ВРейсе КАК ВРейсе,
	|	Таблица.ВПути КАК ВПути,
	|	Таблица.Доставлено КАК Доставлено,
	|	Таблица.Отменено КАК Отменено,
	|	Таблица.КСборке КАК КСборке,
	|	Таблица.ЗапланированаСборка КАК ЗапланированаСборка,
	|	Таблица.Собирается КАК Собирается,
	|	Таблица.Собрано КАК Собрано
	|ПОМЕСТИТЬ ДвиженияДоставкаПередЗаписью
	|ИЗ
	|	РегистрНакопления.Доставка КАК Таблица
	|ГДЕ
	|	Таблица.Регистратор В (&Регистраторы)
	|	И НЕ &ЭтоНовый
	|	И НЕ &ОбменДанными
	|	И &РассчитыватьИзменения";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаИзмененияПослеЗаписи()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.Организация КАК Организация,
	|	ТаблицаИзменений.ТипДоставки КАК ТипДоставки,
	|	ТаблицаИзменений.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ТаблицаИзменений.СпособДоставки КАК СпособДоставки,
	|	ТаблицаИзменений.Отправитель КАК Отправитель,
	|	ТаблицаИзменений.ТочкаОтправителя КАК ТочкаОтправителя,
	|	ТаблицаИзменений.ЗонаОтправителя КАК ЗонаОтправителя,
	|	ТаблицаИзменений.Получатель КАК Получатель,
	|	ТаблицаИзменений.ТочкаПолучателя КАК ТочкаПолучателя,
	|	ТаблицаИзменений.ЗонаПолучателя КАК ЗонаПолучателя,
	|	ТаблицаИзменений.ДокументПланирования КАК ДокументПланирования,
	|	ТаблицаИзменений.Распоряжение КАК Распоряжение,
	|	ТаблицаИзменений.Рейс КАК Рейс,
	|	ТаблицаИзменений.Номенклатура КАК Номенклатура,
	|	ТаблицаИзменений.Характеристика КАК Характеристика,
	|	ТаблицаИзменений.Серия КАК Серия,
	|	ТаблицаИзменений.КодСтроки КАК КодСтроки,
	|	ТаблицаИзменений.Плечо КАК Плечо,
	|	ТаблицаИзменений.Перевозчик КАК Перевозчик,
	|	ТаблицаИзменений.Упаковка КАК Упаковка,
	|	СУММА(ТаблицаИзменений.КДоставке) КАК КДоставкеИзменение,
	|	СУММА(ТаблицаИзменений.КРейсу) КАК КРейсуИзменение,
	|	СУММА(ТаблицаИзменений.ВРейсе) КАК ВРейсеИзменение,
	|	СУММА(ТаблицаИзменений.ВПути) КАК ВПутиИзменение,
	|	СУММА(ТаблицаИзменений.Доставлено) КАК ДоставленоИзменение,
	|	СУММА(ТаблицаИзменений.Отменено) КАК ОтмененоИзменение,
	|	СУММА(ТаблицаИзменений.КСборке) КАК КСборкеИзменение,
	|	СУММА(ТаблицаИзменений.ЗапланированаСборка) КАК ЗапланированаСборкаИзменение,
	|	СУММА(ТаблицаИзменений.Собирается) КАК СобираетсяИзменение,
	|	СУММА(ТаблицаИзменений.Собрано) КАК СобраноИзменение
	|ПОМЕСТИТЬ ДвиженияДоставкаИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Организация КАК Организация,
	|		Таблица.ТипДоставки КАК ТипДоставки,
	|		Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
	|		Таблица.СпособДоставки КАК СпособДоставки,
	|		Таблица.Отправитель КАК Отправитель,
	|		Таблица.ТочкаОтправителя КАК ТочкаОтправителя,
	|		Таблица.ЗонаОтправителя КАК ЗонаОтправителя,
	|		Таблица.Получатель КАК Получатель,
	|		Таблица.ТочкаПолучателя КАК ТочкаПолучателя,
	|		Таблица.ЗонаПолучателя КАК ЗонаПолучателя,
	|		Таблица.ДокументПланирования КАК ДокументПланирования,
	|		Таблица.Распоряжение КАК Распоряжение,
	|		Таблица.Рейс КАК Рейс,
	|		Таблица.Номенклатура КАК Номенклатура,
	|		Таблица.Характеристика КАК Характеристика,
	|		Таблица.Серия КАК Серия,
	|		Таблица.КодСтроки КАК КодСтроки,
	|		Таблица.Плечо КАК Плечо,
	|		Таблица.Перевозчик КАК Перевозчик,
	|		Таблица.Упаковка КАК Упаковка,
	|		-1 * Таблица.КДоставке КАК КДоставке,
	|		-1 * Таблица.КРейсу КАК КРейсу,
	|		-1 * Таблица.ВРейсе КАК ВРейсе,
	|		-1 * Таблица.ВПути КАК ВПути,
	|		-1 * Таблица.Доставлено КАК Доставлено,
	|		-1 * Таблица.Отменено КАК Отменено,
	|		-1 * Таблица.КСборке КАК КСборке,
	|		-1 * Таблица.ЗапланированаСборка КАК ЗапланированаСборка,
	|		-1 * Таблица.Собирается КАК Собирается,
	|		-1 * Таблица.Собрано КАК Собрано
	|	ИЗ
	|		ДвиженияДоставкаПередЗаписью КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Организация,
	|		Таблица.ТипДоставки,
	|		Таблица.ДатаОтгрузки,
	|		Таблица.СпособДоставки,
	|		Таблица.Отправитель,
	|		Таблица.ТочкаОтправителя,
	|		Таблица.ЗонаОтправителя,
	|		Таблица.Получатель,
	|		Таблица.ТочкаПолучателя,
	|		Таблица.ЗонаПолучателя,
	|		Таблица.ДокументПланирования,
	|		Таблица.Распоряжение,
	|		Таблица.Рейс,
	|		Таблица.Номенклатура,
	|		Таблица.Характеристика,
	|		Таблица.Серия,
	|		Таблица.КодСтроки,
	|		Таблица.Плечо,
	|		Таблица.Перевозчик,
	|		Таблица.Упаковка,
	|		Таблица.КДоставке,
	|		Таблица.КРейсу,
	|		Таблица.ВРейсе,
	|		Таблица.ВПути,
	|		Таблица.Доставлено,
	|		Таблица.Отменено,
	|		Таблица.КСборке,
	|		Таблица.ЗапланированаСборка,
	|		Таблица.Собирается,
	|		Таблица.Собрано
	|	ИЗ
	|		РегистрНакопления.Доставка КАК Таблица
	|	ГДЕ
	|		Таблица.Регистратор В (&Регистраторы)) КАК ТаблицаИзменений
	|ГДЕ
	|	НЕ &ОбменДанными
	|	И &РассчитыватьИзменения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.ТипДоставки,
	|	ТаблицаИзменений.ДатаОтгрузки,
	|	ТаблицаИзменений.СпособДоставки,
	|	ТаблицаИзменений.Отправитель,
	|	ТаблицаИзменений.ТочкаОтправителя,
	|	ТаблицаИзменений.ЗонаОтправителя,
	|	ТаблицаИзменений.Получатель,
	|	ТаблицаИзменений.ТочкаПолучателя,
	|	ТаблицаИзменений.ЗонаПолучателя,
	|	ТаблицаИзменений.ДокументПланирования,
	|	ТаблицаИзменений.Распоряжение,
	|	ТаблицаИзменений.Рейс,
	|	ТаблицаИзменений.Номенклатура,
	|	ТаблицаИзменений.Характеристика,
	|	ТаблицаИзменений.Серия,
	|	ТаблицаИзменений.КодСтроки,
	|	ТаблицаИзменений.Плечо,
	|	ТаблицаИзменений.Перевозчик,
	|	ТаблицаИзменений.Упаковка
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ТаблицаИзменений.КДоставке) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.КРейсу) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.ВРейсе) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.ВПути) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.Доставлено) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.Отменено) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.КСборке) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.ЗапланированаСборка) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.Собирается) <> 0
	|		ИЛИ СУММА(ТаблицаИзменений.Собрано) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(
	|		ВЫБОР
	|			КОГДА ДвиженияДоставкаИзменение.КДоставкеИзменение <> 0
	|					ИЛИ ДвиженияДоставкаИзменение.КРейсуИзменение <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ), ЛОЖЬ) КАК ЕстьИзмененияКДоставкеКРейсу,
	|	ЕСТЬNULL(МАКСИМУМ(
	|		ВЫБОР
	|			КОГДА ДвиженияДоставкаИзменение.ВРейсеИзменение <> 0
	|					ИЛИ ДвиженияДоставкаИзменение.КРейсуИзменение <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ), ЛОЖЬ) КАК ЕстьИзмененияКРейсуВРейсе,
	|	ЕСТЬNULL(МАКСИМУМ(
	|		ВЫБОР
	|			КОГДА ДвиженияДоставкаИзменение.КСборкеИзменение <> 0
	|					ИЛИ ДвиженияДоставкаИзменение.ВПутиИзменение <> 0
	|					ИЛИ ДвиженияДоставкаИзменение.ДоставленоИзменение <> 0
	|					ИЛИ ДвиженияДоставкаИзменение.ЗапланированаСборкаИзменение <> 0
	|					ИЛИ ДвиженияДоставкаИзменение.СобираетсяИзменение <> 0
	|					ИЛИ ДвиженияДоставкаИзменение.СобраноИзменение <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ), ЛОЖЬ) КАК ЕстьИзмененияСборки
	|ИЗ
	|	ДвиженияДоставкаИзменение КАК ДвиженияДоставкаИзменение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДвиженияДоставкаПередЗаписью
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЕстьИзмененияМерныхТоваров()
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьИзмененияМерныхТоваров
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВЫРАЗИТЬ(ДвиженияДоставкаИзменение.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|	ИЗ
	|		ДвиженияДоставкаИзменение КАК ДвиженияДоставкаИзменение) КАК НоменклатураИзменений
	|ГДЕ
	|	НоменклатураИзменений.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В(&МерныеТипыЕдиницИзмерений)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура СформироватьТаблицуИзменений()
	
	Регистраторы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДополнительныеСвойства, "Регистраторы", Новый Массив); // Массив Из ДокументСсылка
	
	ДополнительныеСвойстваМВТ = ДополнительныеСвойства.МенеджерВременныхТаблиц; // МенеджерВременныхТаблиц
	
	Если ЗначениеЗаполнено(Отбор.Регистратор.Значение) Тогда
		
		// Отмена проведения
		Регистраторы.Добавить(Отбор.Регистратор.Значение);
		
	КонецЕсли;
	
	Регистраторы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Регистраторы);  // Массив Из ДокументСсылка
	
	Запрос = Новый Запрос;
	ТекстЗапроса = ТекстЗапросаИзмененияПослеЗаписи();
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);
	Запрос.УстановитьПараметр("ОбменДанными", ОбменДанными.Загрузка);
	РассчитыватьИзменения = ПроведениеДокументов.РассчитыватьИзменения(ДополнительныеСвойства);
	Запрос.УстановитьПараметр("РассчитыватьИзменения", РассчитыватьИзменения);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойстваМВТ;
	
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаИзменение = Результат[Результат.ВГраница() - 2].Выбрать();
	ЕстьИзменения = (ВыборкаИзменение.Следующий() И ВыборкаИзменение.Количество > 0);
	
	ПараметрыТаблицыКонтроля = ДоставкаТоваров.НовыеПараметрыТаблицыКонтроляДоставки();
	ВыборкаФлаги = Результат[Результат.ВГраница() - 1].Выбрать();
	Если ВыборкаФлаги.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыТаблицыКонтроля, ВыборкаФлаги);
	КонецЕсли;
	
	Если ЕстьИзменения
		И ПолучитьФункциональнуюОпцию("ИспользоватьДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров") Тогда
		
		ТекстЗапроса = ТекстЗапросаЕстьИзмененияМерныхТоваров();
		Запрос.Текст = ТекстЗапроса;
		МерныеТипыЕдиницИзмерений = Справочники.УпаковкиЕдиницыИзмерения.МерныеТипыЕдиницИзмерений();
		Запрос.УстановитьПараметр("МерныеТипыЕдиницИзмерений", МерныеТипыЕдиницИзмерений);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыТаблицыКонтроля, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	ПроведениеДокументов.ЗарегистрироватьТаблицуКонтроля(
		ДополнительныеСвойства,
		"ДвиженияДоставкаИзменение",
		ЕстьИзменения,
		ПараметрыТаблицыКонтроля);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
