#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Создать обновить документ.
// 
// Параметры:
//  ДанныеДокументаСоответствие - Неопределено, Структура - Данные документа соответствие
//  ДокЗакупкиОбъект - Неопределено, ДокументОбъект.КонтурЗакупки_Закупка - Объект имеющегося документа для обновления
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Документ создан/обновлён
Функция СоздатьОбновитьДокумент(ДанныеДокументаСоответствие, ДокЗакупкиОбъект = Неопределено, ОписаниеРезультата = "") Экспорт
	Результат = Истина;

	Если Результат Тогда
		Если ПустаяСтрока(ИдентификаторЗакупки) Тогда
			ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Не заполнен ID закупки'") + Символы.ПС;
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если Результат Тогда
		Если ДокЗакупкиОбъект = Неопределено Тогда

			ДокументПоИД = Документы.КонтурЗакупки_Закупка.НайтиПоРеквизиту("ИдентификаторЗакупки",
				ИдентификаторЗакупки);

			Если ЗначениеЗаполнено(ДокументПоИД) Тогда
				ДокЗакупкиОбъект = ДокументПоИД.ПолучитьОбъект();

			Иначе
				ДокЗакупкиОбъект = Документы.КонтурЗакупки_Закупка.СоздатьДокумент();
				ДокЗакупкиОбъект.Дата = ТекущаяДатаСеанса();
				ДокЗакупкиОбъект.УстановитьНовыйНомер();
				ДокЗакупкиОбъект.ИдентификаторЗакупки = ДанныеДокументаСоответствие["Id"];

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Результат Тогда

		ЗагрузитьШапку(ДокЗакупкиОбъект, ДанныеДокументаСоответствие);
		ЗагрузитьТабличнуюЧасть(ДокЗакупкиОбъект, ДанныеДокументаСоответствие);
		ЗагрузитьТабличнуюЧастьДокументы(ДокЗакупкиОбъект, ДанныеДокументаСоответствие);

	КонецЕсли;

	Если Результат Тогда

		Попытка
			ДокЗакупкиОбъект.Записать();
		Исключение
			ОписаниеРезультата = ОписаниеРезультата + СтрШаблон(
			НСтр("ru = 'Ошибка записи документа: %1'"), ОписаниеОшибки()) + Символы.ПС;
		КонецПопытки;

	КонецЕсли;

	Если Результат Тогда

		Запись = РегистрыСведений.КонтурЗакупки_ЗакупкиJSON.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДатаСеанса();
		Запись.Закупка = ДокЗакупкиОбъект.Ссылка;
		Запись.СтрокаJSON = КонтурЗакупки_СлужебныеВызовСервера.ПреобразоватьВJSON(ДанныеДокументаСоответствие);
		Запись.Записать();
			
		// обновление в регистре сведений сохраненных результатов поиска
		Запись = РегистрыСведений.КонтурЗакупки_СохраненныеРезультатыПоиска.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторЗакупки = ДанныеДокументаСоответствие["Id"];
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Загружен = Истина;
			Запись.СсылкаНаЗагруженный = ДокЗакупкиОбъект.Ссылка;
			Запись.Записать();
		КонецЕсли;

	КонецЕсли;
	Возврат Результат;
КонецФункции

// Получить данные закупки.
// 
// Параметры:
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Получить данные закупки
Функция ПолучитьДанныеЗакупки(ДокЗакупкиОбъект = Неопределено, ОписаниеРезультата = "") Экспорт
	Результат = Истина;
	РезультатHTTPЗапроса = КонтурЗакупки_httpЗапросыКлиентСервер.http_ПолучитьДанныеЗакупки(ИдентификаторЗакупки);
	Если Не РезультатHTTPЗапроса = Неопределено Тогда
		Если Не РезультатHTTPЗапроса["data"] = Неопределено Тогда
			ДанныеДокументаСоответствие = РезультатHTTPЗапроса["data"];
			Результат = СоздатьОбновитьДокумент(ДанныеДокументаСоответствие, ДокЗакупкиОбъект, ОписаниеРезультата);
		ИначеЕсли Не РезультатHTTPЗапроса["error"] = Неопределено И РезультатHTTPЗапроса["error"] = Истина Тогда
			Результат = Ложь;
			ОписаниеРезультата = ОписаниеРезультата + СтрШаблон(
			НСтр("ru = 'Ошибка: %1'"), РезультатHTTPЗапроса["message"]) + Символы.ПС;
		КонецЕсли;
	Иначе
		Результат = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Ошибка'") + Символы.ПС;
	КонецЕсли;

	Возврат Результат
КонецФункции

// Функция выполняет получение результатов закупки.
//
// Параметры:
//  ДокументЗакупки		 - ДокументОбъект.КонтурЗакупки_Закупка. Документ закупки. 
//  ОписаниеРезультата	 - Строка. Строка результата 
// 
// Возвращаемое значение:
//   Булево. Признак получения результатов закупки. 
//
Функция ПолучитьРезультатыЗакупки(ДокументЗакупки, ОписаниеРезультата = "") Экспорт

	Результат = Истина;
		
	РезультатHTTPЗапроса = КонтурЗакупки_httpЗапросыКлиентСервер.http_ПолучитьРезультатЗакупки(ИдентификаторЗакупки);
	
	Если РезультатHTTPЗапроса = Неопределено Тогда 
		
		Результат 		   = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Ошибка'") + Символы.ПС; 
				
	Иначе  
		
		ЕстьОшибка = РезультатHTTPЗапроса["error"];
		
		Если ЕстьОшибка Тогда 
			
			Результат 	 = Ложь;
			ШаблонОшибки = НСтр("ru = 'Ошибка: %1'");
			ТекстОшибки  = РезультатHTTPЗапроса["message"];	
			
			ОписаниеРезультата = ОписаниеРезультата + СтрШаблон(ШаблонОшибки, ТекстОшибки) + Символы.ПС;
			
		Иначе
			
			ДанныеРезультатаЗакупки = РезультатHTTPЗапроса["data"];
			
			Результат = ЗагрузитьРезультатЗакупки(ДанныеРезультатаЗакупки, ДокументЗакупки, ОписаниеРезультата)
			
		КонецЕсли;
				
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Функция создает элемент справочника "КонтурЗакупки_РезультатыЗакупки".
//
// Параметры:
//  ДанныеРезультатаЗакупки - Неопределено, Соответствие.Данные результата закупки.
//  ДокументЗакупки		 	- ДокументОбъект.КонтурЗакупки_Закупка. Документ закупки. 
//  ОписаниеРезультата	 	- Строка. Строка результата. 
//
Функция ЗагрузитьРезультатЗакупки(ДанныеРезультатаЗакупки, ДокументЗакупки, ОписаниеРезультата = "") Экспорт
	
 	Результат = Истина;
		
	ЭлементСправочника = Справочники.КонтурЗакупки_РезультатыЗакупок.СоздатьЭлемент();
	
	ЭлементСправочника.ДатаЗагрузки = ТекущаяДатаСеанса();
	ЭлементСправочника.Наименование = ИдентификаторЗакупки;
	ЭлементСправочника.Закупка 		= ДокументЗакупки;
	ЭлементСправочника.ВебСсылка 	= ДанныеРезультатаЗакупки["Link"];
			
	МассивКонтрактов = ДанныеРезультатаЗакупки["Contracts"]; 		
	Если МассивКонтрактов <> Неопределено 
		И МассивКонтрактов.Количество() > 0 Тогда
		
		ЗаполнитьДанныеПоКонтрактамРезультатЗакупки(ЭлементСправочника, МассивКонтрактов);
		
	КонецЕсли;
		
	МассивПроектов = ДанныеРезультатаЗакупки["ContractProjects"]; 	
	Если МассивПроектов <> Неопределено 
		И МассивПроектов.Количество() > 0 Тогда
		
		ЗаполнитьДанныеПоПроектамРезультатЗакупки(ЭлементСправочника, МассивПроектов);
		
	КонецЕсли;
	
	МассивПротоколов  = ДанныеРезультатаЗакупки["Protocols"]; 		
	Если МассивПротоколов <> Неопределено 
		И МассивПротоколов.Количество() > 0 Тогда 
		
		ЗаполнитьДанныеПоПротоколамРезультатЗакупки(ЭлементСправочника, МассивПротоколов);
		
	КонецЕсли;
					
	Попытка	
		ЭлементСправочника.Записать();		
	Исключение
		Результат 			= Ложь;
		ОписаниеРезультата 	= ОписаниеРезультата + ОписаниеОшибки();	
	КонецПопытки;
		
	Возврат Результат;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗаполнитьСтрокуДокументы(НовСтрокаТаблицыДокументы, ЭлементДокумент)

	НовСтрокаТаблицыДокументы.ИмяФайла = ЭлементДокумент["FileName"];
	НовСтрокаТаблицыДокументы.СсылкаНаФайл = ЭлементДокумент["Url"];

КонецПроцедуры

Процедура ЗаполнитьСтрокуЛот(НовСтрокаТаблицыЛоты, ЭлементЛот)

	НовСтрокаТаблицыЛоты.НаименованиеЛота = ЭлементЛот["Title"];
	НовСтрокаТаблицыЛоты.ПричинаНесостоявшейсяЗакупки = ЭлементЛот["AbandonedReason"];
	
	TenderRequirements = ЭлементЛот["TenderRequirements"];
	
	Если TenderRequirements <> Неопределено Тогда
		
		ТребованияЛота = TenderRequirements["Requirements"];
		Если ТребованияЛота <> Неопределено Тогда
			
			МассивТребований = Новый Массив;
			НомерПоПорядку = 1;
			Для Каждого ЭлементТребования Из ТребованияЛота Цикл
				
				ИмяТребования = ЭлементТребования["Name"];
				КонтентТребования = ЭлементТребования["Content"];
				СоставТребования = ЭлементТребования["AddRequirements"];
				
				Если Не ЗначениеЗаполнено(КонтентТребования) И Не ЗначениеЗаполнено(СоставТребования) Тогда
					Требование = СтрШаблон("%1. %2", НомерПоПорядку, ИмяТребования);
				ИначеЕсли ЗначениеЗаполнено(КонтентТребования) Тогда
					Требование = СтрШаблон("%1. %2: %3", НомерПоПорядку, ИмяТребования, КонтентТребования);
				ИначеЕсли ЗначениеЗаполнено(СоставТребования) Тогда
					Требование = СтрШаблон("%1. %2", НомерПоПорядку, ИмяТребования);
					Для Каждого СтрокаСостава Из СоставТребования Цикл
						СтрокаСоставаПредставление = Символы.Таб + СтрШаблон("%1" + Символы.ПС + Символы.Таб + Символы.Таб + "%2", СтрокаСостава["Name"], СтрокаСостава["Content"]);
						Требование = Требование + Символы.ПС + СтрокаСоставаПредставление;
					КонецЦикла;
				КонецЕсли;
				
				МассивТребований.Добавить(Требование);
				
				НомерПоПорядку = НомерПоПорядку + 1;
				
			КонецЦикла;
			
			СтрокаТребования = СтрСоединить(МассивТребований, Символы.ПС);
			НовСтрокаТаблицыЛоты.Требования = СтрокаТребования;
			
		КонецЕсли;
		
		ОграниченияЛота = TenderRequirements["Restrictions"];
		Если ОграниченияЛота <> Неопределено Тогда
			
			МассивОграничений = Новый Массив;
			НомерПоПорядку = 1;
			Для Каждого ЭлементОграничения Из ОграниченияЛота Цикл
				
				ИмяОграничения = ЭлементОграничения["Name"];
				КонтентОграничения = ЭлементОграничения["Content"];
				СоставОграничения = ЭлементОграничения["AddRestrictions"];
				
				Если Не ЗначениеЗаполнено(КонтентОграничения) И Не ЗначениеЗаполнено(СоставОграничения) Тогда
					Ограничение = СтрШаблон("%1. %2", НомерПоПорядку, ИмяОграничения);
				ИначеЕсли ЗначениеЗаполнено(КонтентОграничения) Тогда
					Ограничение = СтрШаблон("%1. %2: %3", НомерПоПорядку, ИмяОграничения, КонтентОграничения);
				ИначеЕсли ЗначениеЗаполнено(СоставОграничения) Тогда
					Ограничение = СтрШаблон("%1. %2", НомерПоПорядку, ИмяОграничения);
					Для Каждого СтрокаСостава Из СоставОграничения Цикл
						
						ИмяДопОграничения = "Требование";
						Если СтрокаСостава["RequirementTypes"] <> Неопределено Тогда
							ИмяДопОграничения = СтрокаСостава["RequirementTypes"][0];
						КонецЕсли;
						
						ОписаниеДопОграничения = "";
						Если СтрокаСостава["NpaName"] <> Неопределено Тогда
							ОписаниеДопОграничения = СтрокаСостава["NpaName"];
						КонецЕсли;
						
						СтрокаСоставаПредставление = Символы.Таб + СтрШаблон("%1" + Символы.ПС + Символы.Таб + Символы.Таб + "%2", ИмяДопОграничения, ОписаниеДопОграничения);
						Ограничение = Ограничение + Символы.ПС + СтрокаСоставаПредставление;
					КонецЦикла;
				КонецЕсли;
				
				МассивОграничений.Добавить(Ограничение);
				
				НомерПоПорядку = НомерПоПорядку + 1;
				
			КонецЦикла;
			
			СтрокаОграничений = СтрСоединить(МассивОграничений, Символы.ПС);
			НовСтрокаТаблицыЛоты.Ограничения = СтрокаОграничений;
			
		КонецЕсли;
		
		ПреимуществаЛота = TenderRequirements["Privileges"];
		
		Если ПреимуществаЛота <> Неопределено Тогда
			
			МассивПреимуществ = Новый Массив;
			НомерПоПорядку = 1;
			
			Для Каждого ЭлементПреимущества Из ПреимуществаЛота Цикл
				ПредставлениеПреимущества = СтрШаблон("%1. %2", НомерПоПорядку, ЭлементПреимущества);
				МассивПреимуществ.Добавить(ПредставлениеПреимущества);
				НомерПоПорядку = НомерПоПорядку + 1;
			КонецЦикла;
			
			СтрокаПреимущества = СтрСоединить(МассивПреимуществ, Символы.ПС);
			НовСтрокаТаблицыЛоты.Преимущества = СтрокаПреимущества;
			
		КонецЕсли;
		
	КонецЕсли;

	ЦенаЛота = ЭлементЛот["Price"];
	Если Не ЦенаЛота = Неопределено Тогда
		НовСтрокаТаблицыЛоты.ЦенаЛотаСумма = ЦенаЛота["Amount"];
		НовСтрокаТаблицыЛоты.ЦенаЛотаСуммаВРублях = ЦенаЛота["RubPrice"];
		НовСтрокаТаблицыЛоты.ЦенаЛотаВалюта = ЦенаЛота["CurrencyCode"];
		НовСтрокаТаблицыЛоты.ЦенаЛотаНДС = ЦенаЛота["Nds"];
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьМестаПоставки(ДокЗакупкиОбъект, Ключ_Заказчики, МассивСтрокМестаПоставки)
	Для Каждого МестоПоставки Из МассивСтрокМестаПоставки Цикл
		НовСтрМестаПоставки	= ДокЗакупкиОбъект.МестаПоставки.Добавить();
		НовСтрМестаПоставки.Ключ_Заказчики = Ключ_Заказчики;
		НовСтрМестаПоставки.МестаПоставки_МестоПоставки = МестоПоставки;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьСтрокуЗаказчик(ДокЗакупкиОбъект, НовСтрокаТаблицыЗаказчики, ЭлементЗаказчик)

	Организация = ЭлементЗаказчик["Organization"];
	Если Не Организация = Неопределено Тогда

		НовСтрокаТаблицыЗаказчики.ОрганизацияИНН = Организация["Inn"];
		НовСтрокаТаблицыЗаказчики.ОрганизацияКПП = Организация["Kpp"];
		НовСтрокаТаблицыЗаказчики.ОрганизацияНаименование = Организация["Name"];

	КонецЕсли;

	Требования = ЭлементЗаказчик["CustomerRequirements"];
	Если Не Требования = Неопределено Тогда

		НовСтрокаТаблицыЗаказчики.МестоПоставки = Требования["DelieryPlace"];
		НовСтрокаТаблицыЗаказчики.РазмерОбеспеченияЗаявки = Требования["ApplicationGuarantee"];
		НовСтрокаТаблицыЗаказчики.ИнформацияОБанковскомКазначейскомСопровождение = Требования["SupportContractRequirement"];
		НовСтрокаТаблицыЗаказчики.ТипСопровожденияКонтракта = Требования["TypeSupportContract"];

		Гарантия = Требования["ContractGuarantee"];
		Если Не Гарантия = Неопределено И Не ТипЗнч(Гарантия) = Тип("Строка") Тогда
			НовСтрокаТаблицыЗаказчики.РазмерОбеспеченияИсполненияКонтрактаСумма = Гарантия["Amount"];
			НовСтрокаТаблицыЗаказчики.РазмерОбеспеченияИсполненияКонтрактаПроцент = Гарантия["Part"];
		КонецЕсли;

		Гарантия = Требования["ServiceGuarantee"];
		Если Не Гарантия = Неопределено И Не ТипЗнч(Гарантия) = Тип("Строка") Тогда
			НовСтрокаТаблицыЗаказчики.РазмерОбеспеченияПоОбслуживаниюСумма = Гарантия["Amount"];
			НовСтрокаТаблицыЗаказчики.РазмерОбеспеченияПоОбслуживаниюПроцент = Гарантия["Part"];
		КонецЕсли;

		Гарантия = Требования["DeliveryGuarantee"];
		Если Не Гарантия = Неопределено И Не ТипЗнч(Гарантия) = Тип("Строка") Тогда
			НовСтрокаТаблицыЗаказчики.РазмерОбеспеченияПоПоставкеСумма = Гарантия["Amount"];
			НовСтрокаТаблицыЗаказчики.РазмерОбеспеченияПоПоставкеПроцент = Гарантия["Part"];
		КонецЕсли;

		МассивМестаПоставки	= Требования["DeliveryPlaces"];

		Если Не МассивМестаПоставки = Неопределено И ТипЗнч(МассивМестаПоставки) = Тип("Массив") Тогда
			ЗаполнитьМестаПоставки(ДокЗакупкиОбъект, НовСтрокаТаблицыЗаказчики.Ключ_Заказчики, МассивМестаПоставки);
		КонецЕсли;
		НовСтрокаТаблицыЗаказчики.РазмерОбеспеченияГарантийныхОбязательств = Требования["ProvisionWarranty"];
		НовСтрокаТаблицыЗаказчики.АвансВПроцентах = Требования["AdvancePayment"];

	КонецЕсли;

	НовСтрокаТаблицыЗаказчики.НачалоСрокаИсполненияКонтракта = ЭлементЗаказчик["StartContractDate"];
	НовСтрокаТаблицыЗаказчики.КонецСрокаИсполненияКонтракта = ЭлементЗаказчик["EndContractDate"];

КонецПроцедуры

Процедура ЗаполнитьХарактеристики(ДокЗакупкиОбъект, МассивХарактеристик, Ключ_ОбъектыЗакупки)
	Для Каждого Характеристика Из МассивХарактеристик Цикл
		МассивЗначенийХарактеристик = Характеристика["Values"];
		Если Не МассивЗначенийХарактеристик = Неопределено И ТипЗнч(МассивЗначенийХарактеристик) = Тип("Массив")
			И МассивЗначенийХарактеристик.Количество() > 0 Тогда
			Для Каждого ЗначениеХарактеристики Из МассивЗначенийХарактеристик Цикл

				НовСтрокаХарактеристики = ДокЗакупкиОбъект.Характеристики.Добавить();
				НовСтрокаХарактеристики.Ключ_ОбъектыЗакупки = Ключ_ОбъектыЗакупки;
				НовСтрокаХарактеристики.НаименованиеХарактеристики = Характеристика["Name"];
				НовСтрокаХарактеристики.ИнструкцияПоЗаполнению = Характеристика["FillingInstruction"];

				НовСтрокаХарактеристики.ЗначениеХарактеристики = ЗначениеХарактеристики["Value"];
				НовСтрокаХарактеристики.ЕдиницаИзмеренияХарактеристики = ЗначениеХарактеристики["Okei"];

			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьСтрокуЛекарство(ДокЗакупкиОбъект, НовСтрокаТаблицыОбъектыЗакупки, ОбъектЛекарство,
	Ключ_ОбъектыЗакупки)
	НовСтрокаТаблицыОбъектыЗакупки.ТорговоеНаименованиеПрепарата = ОбъектЛекарство["TradeName"];
	НовСтрокаТаблицыОбъектыЗакупки.ЖНВЛП = ОбъектЛекарство["IsZNVLP"];
	НовСтрокаТаблицыОбъектыЗакупки.ОбоснованиеУказанияСведений = ОбъектЛекарство["SpecifyDrugPackageReason"];

	МассивВариановПоставки = ОбъектЛекарство["DrugDeliveryOptions"];
	Если Не МассивВариановПоставки = Неопределено И ТипЗнч(МассивВариановПоставки) = Тип("Массив")
		И МассивВариановПоставки.Количество() > 0 Тогда
		НовСтрокаТаблицыОбъектыЗакупки.ЕстьЛС = Истина;
		ЗаполнитьВариантыПоставки(ДокЗакупкиОбъект, Ключ_ОбъектыЗакупки, МассивВариановПоставки);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьВариантыПоставки(ДокЗакупкиОбъект, Ключ_ОбъектыЗакупки, МассивВариановПоставки)
	Для Каждого ВариантПоставки Из МассивВариановПоставки Цикл
		Ключ_ВариантПоставки = Новый УникальныйИдентификатор;

		НовСтрВариантаПоставки	= ДокЗакупкиОбъект.ВариантыПоставки.Добавить();
		НовСтрВариантаПоставки.Ключ_ОбъектыЗакупки = Ключ_ОбъектыЗакупки;
		НовСтрВариантаПоставки.Ключ_ВариантПоставки = Ключ_ВариантПоставки;
		НовСтрВариантаПоставки.ОсновнойВариантПоставки = ВариантПоставки["IsBasic"];
		НовСтрВариантаПоставки.ЛекарственнаяФорма = ВариантПоставки["MedicamentalFormName"];
		НовСтрВариантаПоставки.Дозировка = ВариантПоставки["DosageGRLSValue"];
		НовСтрВариантаПоставки.Количество = ВариантПоставки["Quantity"];
		НовСтрВариантаПоставки.ЕдиницаИзмерения = ВариантПоставки["Okei"];
		НовСтрВариантаПоставки.ЦенаЗаЕдиницу = ВариантПоставки["ItemPrice"];
		НовСтрВариантаПоставки.КоличествоЕдиницВПервичнойУпаковке = ВариантПоставки["PackagingQuantity"];
		НовСтрВариантаПоставки.КоличествоЕдиницВПотребительскойУпаковке = ВариантПоставки["SummaryPackagingQuantity"];
		НовСтрВариантаПоставки.ПредельноОтпускнаяЦенаЗаЕд = ВариантПоставки["LimitPrice"];

		МассивОКПД2 = ВариантПоставки["Okpd2s"];
		Если Не МассивОКПД2 = Неопределено И ТипЗнч(МассивОКПД2) = Тип("Массив") И МассивОКПД2.Количество() > 0 Тогда
			СтруктураПредставление = ЗагрузитьСтрокиОКПД2(ДокЗакупкиОбъект, МассивОКПД2, Ключ_ВариантПоставки);
			ЗаполнитьЗначенияСвойств(НовСтрВариантаПоставки, СтруктураПредставление);
		КонецЕсли;

		МассивКТРУ = ВариантПоставки["Ktrus"];
		Если Не МассивКТРУ = Неопределено И ТипЗнч(МассивКТРУ) = Тип("Массив") И МассивКТРУ.Количество() > 0 Тогда
			СтруктураПредставление = ЗагрузитьСтрокиКТРУ(ДокЗакупкиОбъект, МассивКТРУ, Ключ_ВариантПоставки);
			ЗаполнитьЗначенияСвойств(НовСтрВариантаПоставки, СтруктураПредставление);
		КонецЕсли;

	КонецЦикла;
КонецПроцедуры
Процедура ЗаполнитьСтрокуОбъектыЗакупки(НовСтрокаТаблицыОбъектыЗакупки, ЭлементОбъектЗакупки)

	НовСтрокаТаблицыОбъектыЗакупки.НаименованиеОбъектаЗакупки = ЭлементОбъектЗакупки["Name"];
	НовСтрокаТаблицыОбъектыЗакупки.Количество = ЭлементОбъектЗакупки["Quantity"];
	НовСтрокаТаблицыОбъектыЗакупки.ЕдиницаИзмерения = ЭлементОбъектЗакупки["Okei"];
	НовСтрокаТаблицыОбъектыЗакупки.СтоимостьЗаЕдиницуОбъекта = ЭлементОбъектЗакупки["ItemPrice"];
	НовСтрокаТаблицыОбъектыЗакупки.ОбщаяСтоимостьОбъекта = ЭлементОбъектЗакупки["PositionPrice"];

КонецПроцедуры

Процедура ЗагрузитьТабличнуюЧасть(ДокЗакупкиОбъект, ДанныеДокументаСоответствие)

	ДокЗакупкиОбъект.Лоты.Очистить();
	ДокЗакупкиОбъект.Заказчики.Очистить();
	ДокЗакупкиОбъект.ОбъектыЗакупки.Очистить();
	ДокЗакупкиОбъект.КодыКТРУ.Очистить();
	ДокЗакупкиОбъект.КодыОКВЭД2.Очистить();
	ДокЗакупкиОбъект.КодыОКПД2.Очистить();
	ДокЗакупкиОбъект.МестаПоставки.Очистить();
	ДокЗакупкиОбъект.СовместныеОбъектыЗакупки.Очистить();

	ДокЗакупкиОбъект.ВариантыПоставки.Очистить();
	ДокЗакупкиОбъект.Характеристики.Очистить();

	МассивЛоты = ДанныеДокументаСоответствие["Lots"];

	Если Не МассивЛоты = Неопределено И ТипЗнч(МассивЛоты) = Тип("Массив") И МассивЛоты.Количество() > 0 Тогда
		Для Каждого ЭлементЛот Из МассивЛоты Цикл

			Ключ_Лоты = Новый УникальныйИдентификатор;
			НовСтрокаТаблицыЛоты = ДокЗакупкиОбъект.Лоты.Добавить();
			НовСтрокаТаблицыЛоты.Ключ_Лоты = Ключ_Лоты;
			ЗаполнитьСтрокуЛот(НовСтрокаТаблицыЛоты, ЭлементЛот);

			МассивОКПД2 = ЭлементЛот["Okdp2s"];
			Если Не МассивОКПД2 = Неопределено И ТипЗнч(МассивОКПД2) = Тип("Массив") И МассивОКПД2.Количество() > 0 Тогда
				СтруктураПредставление = ЗагрузитьСтрокиОКПД2(ДокЗакупкиОбъект, МассивОКПД2, Ключ_Лоты);
				ЗаполнитьЗначенияСвойств(НовСтрокаТаблицыЛоты, СтруктураПредставление);
			КонецЕсли;

			МассивОКВЭД2 = ЭлементЛот["Okved2s"];
			Если Не МассивОКВЭД2 = Неопределено И ТипЗнч(МассивОКВЭД2) = Тип("Массив") И МассивОКВЭД2.Количество() > 0 Тогда
				СтруктураПредставление = ЗагрузитьСтрокиОКВЭД2(ДокЗакупкиОбъект, МассивОКВЭД2, Ключ_Лоты);
				ЗаполнитьЗначенияСвойств(НовСтрокаТаблицыЛоты, СтруктураПредставление);
			КонецЕсли;

			МассивОбъектыЗакупки = ЭлементЛот["JointObjects"];
			Если Не МассивОбъектыЗакупки = Неопределено И ТипЗнч(МассивОбъектыЗакупки) = Тип("Массив")
				И МассивОбъектыЗакупки.Количество() > 0 Тогда
				ЗагрузитьОбъектыЗакупки(ДокЗакупкиОбъект, "СовместныеОбъектыЗакупки", МассивОбъектыЗакупки, Ключ_Лоты);
			КонецЕсли;

			МассивЗаказчики = ЭлементЛот["Customers"];
			Если Не МассивЗаказчики = Неопределено И ТипЗнч(МассивЗаказчики) = Тип("Массив")
				И МассивЗаказчики.Количество() > 0 Тогда
				ЗагрузитьЗаказчиков(ДокЗакупкиОбъект, МассивЗаказчики, Ключ_Лоты);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьЗаказчиков(ДокЗакупкиОбъект, МассивЗаказчики, Ключ_Лоты)
	Для Каждого ЭлементЗаказчик Из МассивЗаказчики Цикл

		Ключ_Заказчики = Новый УникальныйИдентификатор;

		НовСтрокаТаблицыЗаказчики = ДокЗакупкиОбъект.Заказчики.Добавить();
		НовСтрокаТаблицыЗаказчики.Ключ_Лоты = Ключ_Лоты;
		НовСтрокаТаблицыЗаказчики.Ключ_Заказчики = Ключ_Заказчики;
		ЗаполнитьСтрокуЗаказчик(ДокЗакупкиОбъект, НовСтрокаТаблицыЗаказчики, ЭлементЗаказчик);

		МассивОбъектыЗакупки = ЭлементЗаказчик["Objects"];
		Если Не МассивОбъектыЗакупки = Неопределено И ТипЗнч(МассивОбъектыЗакупки) = Тип("Массив")
			И МассивОбъектыЗакупки.Количество() > 0 Тогда
			ЗагрузитьОбъектыЗакупки(ДокЗакупкиОбъект, "ОбъектыЗакупки", МассивОбъектыЗакупки, Ключ_Заказчики);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьОбъектыЗакупки(ДокЗакупкиОбъект, НазваниеТабличнойЧасти, МассивОбъектыЗакупки, Ключ)
	Для Каждого ЭлементОбъектЗакупки Из МассивОбъектыЗакупки Цикл

		Ключ_ОбъектыЗакупки = Новый УникальныйИдентификатор;

		НовСтрокаТаблицы = ДокЗакупкиОбъект[НазваниеТабличнойЧасти].Добавить();
		НовСтрокаТаблицы.Ключ = Ключ;
		НовСтрокаТаблицы.Ключ_ОбъектыЗакупки = Ключ_ОбъектыЗакупки;
		ЗаполнитьСтрокуОбъектыЗакупки(НовСтрокаТаблицы, ЭлементОбъектЗакупки);

		ОбъектЛекарство = ЭлементОбъектЗакупки["DrugInfo"];
		Если Не ОбъектЛекарство = Неопределено Тогда
			ЗаполнитьСтрокуЛекарство(ДокЗакупкиОбъект, НовСтрокаТаблицы, ОбъектЛекарство, Ключ_ОбъектыЗакупки);
		КонецЕсли;

		МассивОКПД2 = ЭлементОбъектЗакупки["Okpd2s"];
		Если Не МассивОКПД2 = Неопределено И ТипЗнч(МассивОКПД2) = Тип("Массив") И МассивОКПД2.Количество() > 0 Тогда
			СтруктураПредставление = ЗагрузитьСтрокиОКПД2(ДокЗакупкиОбъект, МассивОКПД2, Ключ_ОбъектыЗакупки);
			ЗаполнитьЗначенияСвойств(НовСтрокаТаблицы, СтруктураПредставление);
		КонецЕсли;

		МассивОКВЭД2 = ЭлементОбъектЗакупки["Okved2s"];
		Если Не МассивОКВЭД2 = Неопределено И ТипЗнч(МассивОКВЭД2) = Тип("Массив") И МассивОКВЭД2.Количество() > 0 Тогда
			СтруктураПредставление = ЗагрузитьСтрокиОКВЭД2(ДокЗакупкиОбъект, МассивОКВЭД2, Ключ_ОбъектыЗакупки);
			ЗаполнитьЗначенияСвойств(НовСтрокаТаблицы, СтруктураПредставление);
		КонецЕсли;

		МассивКТРУ = ЭлементОбъектЗакупки["Ktrus"];
		Если Не МассивКТРУ = Неопределено И ТипЗнч(МассивКТРУ) = Тип("Массив") И МассивКТРУ.Количество() > 0 Тогда
			СтруктураПредставление = ЗагрузитьСтрокиКТРУ(ДокЗакупкиОбъект, МассивКТРУ, Ключ_ОбъектыЗакупки);
			ЗаполнитьЗначенияСвойств(НовСтрокаТаблицы, СтруктураПредставление);
		КонецЕсли;

		МассивХарактеристик = ЭлементОбъектЗакупки["Characteristics"];
		Если Не МассивХарактеристик = Неопределено И ТипЗнч(МассивХарактеристик) = Тип("Массив")
			И МассивХарактеристик.Количество() > 0 Тогда
			ЗаполнитьХарактеристики(ДокЗакупкиОбъект, МассивХарактеристик, Ключ_ОбъектыЗакупки);
			НовСтрокаТаблицы.ЕстьХарактеристики = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Загрузить строки КТРУ.
// 
// Параметры:
//  ДокЗакупкиОбъект - Неопределено, ДокументОбъект.КонтурЗакупки_Закупка - Док закупки объект
//  МассивКТРУ - Массив из Структура - Массив КТРУ
//  Ключ - УникальныйИдентификатор - Ключ
// 
// Возвращаемое значение:
//  Структура - Загрузить строки КТРУ:
// * КТРУКод - Строка - 
// * КТРУРасшифровка - Строка - 
Функция ЗагрузитьСтрокиКТРУ(ДокЗакупкиОбъект, МассивКТРУ, Ключ)
	СтруктураПредставление = Новый Структура;
	СтруктураПредставление.Вставить("КТРУКод", "");
	СтруктураПредставление.Вставить("КТРУРасшифровка", "");
	ЕстьСтрока = Ложь;
	Для Каждого ЭлементКТРУ Из МассивКТРУ Цикл
		НовСтрокаКТРУ = ДокЗакупкиОбъект.КодыКТРУ.Добавить();
		НовСтрокаКТРУ.Ключ = Ключ;
		НовСтрокаКТРУ.КТРУКод = ЭлементКТРУ["Code"];
		НовСтрокаКТРУ.КТРУРасшифровка = ЭлементКТРУ["Name"];

		СтруктураПредставление.КТРУКод = СтруктураПредставление.КТРУКод + ?(ЕстьСтрока, ";", "") + НовСтрокаКТРУ.КТРУКод;
		СтруктураПредставление.КТРУРасшифровка = СтруктураПредставление.КТРУРасшифровка + ?(ЕстьСтрока, ";", "")
			+ НовСтрокаКТРУ.КТРУРасшифровка;
		ЕстьСтрока = Истина;
	КонецЦикла;

	Возврат СтруктураПредставление;
КонецФункции

// Загрузить строки ОКВЭД2.
// 
// Параметры:
//  ДокЗакупкиОбъект - Неопределено, ДокументОбъект.КонтурЗакупки_Закупка - Док закупки объект
//  МассивОКВЭД2 - Массив из Структура - Массив ОКВЭД2
//  Ключ - УникальныйИдентификатор - Ключ
// 
// Возвращаемое значение:
//  Структура - Загрузить строки ОКВЭД2:
// * ОКВЭД2Код - Строка - 
// * ОКВЭД2Расшифровка - Строка - 
Функция ЗагрузитьСтрокиОКВЭД2(ДокЗакупкиОбъект, МассивОКВЭД2, Ключ)
	СтруктураПредставление = Новый Структура;
	СтруктураПредставление.Вставить("ОКВЭД2Код", "");
	СтруктураПредставление.Вставить("ОКВЭД2Расшифровка", "");
	ЕстьСтрока = Ложь;
	Для Каждого ЭлементОКВЭД2 Из МассивОКВЭД2 Цикл
		НовСтрокаОКВЭД2 = ДокЗакупкиОбъект.КодыОКВЭД2.Добавить();
		НовСтрокаОКВЭД2.Ключ = Ключ;
		НовСтрокаОКВЭД2.ОКВЭД2Код = ЭлементОКВЭД2["Code"];
		НовСтрокаОКВЭД2.ОКВЭД2Расшифровка = ЭлементОКВЭД2["Name"];

		СтруктураПредставление.ОКВЭД2Код = СтруктураПредставление.ОКВЭД2Код + ?(ЕстьСтрока, ";", "")
			+ НовСтрокаОКВЭД2.ОКВЭД2Код;
		СтруктураПредставление.ОКВЭД2Расшифровка = СтруктураПредставление.ОКВЭД2Расшифровка + ?(ЕстьСтрока, ";", "")
			+ НовСтрокаОКВЭД2.ОКВЭД2Расшифровка;
		ЕстьСтрока = Истина;
	КонецЦикла;

	Возврат СтруктураПредставление;
КонецФункции

// Загрузить строки ОКПД2.
// 
// Параметры:
//  ДокЗакупкиОбъект - Неопределено, ДокументОбъект.КонтурЗакупки_Закупка - Док закупки объект
//  МассивОКПД2 - Массив из Структура - Массив ОКПД2
//  Ключ - УникальныйИдентификатор - Ключ
// 
// Возвращаемое значение:
//  Структура - Загрузить строки ОКПД2:
// * ОКПД2Код - Строка - 
// * ОКПД2Расшифровка - Строка - 
Функция ЗагрузитьСтрокиОКПД2(ДокЗакупкиОбъект, МассивОКПД2, Ключ)
	СтруктураПредставление = Новый Структура;
	СтруктураПредставление.Вставить("ОКПД2Код", "");
	СтруктураПредставление.Вставить("ОКПД2Расшифровка", "");
	ЕстьСтрока = Ложь;
	Для Каждого ЭлементОКПД2 Из МассивОКПД2 Цикл
		НовСтрокаОКПД2 = ДокЗакупкиОбъект.КодыОКПД2.Добавить();
		НовСтрокаОКПД2.Ключ = Ключ;
		НовСтрокаОКПД2.ОКПД2Код = ЭлементОКПД2["Code"];
		НовСтрокаОКПД2.ОКПД2Расшифровка = ЭлементОКПД2["Name"];

		СтруктураПредставление.ОКПД2Код = СтруктураПредставление.ОКПД2Код + ?(ЕстьСтрока, ";", "")
			+ НовСтрокаОКПД2.ОКПД2Код;
		СтруктураПредставление.ОКПД2Расшифровка = СтруктураПредставление.ОКПД2Расшифровка + ?(ЕстьСтрока, ";", "")
			+ НовСтрокаОКПД2.ОКПД2Расшифровка;
		ЕстьСтрока = Истина;
	КонецЦикла;

	Возврат СтруктураПредставление;
КонецФункции

Процедура ЗагрузитьТабличнуюЧастьДокументы(ДокЗакупкиОбъект, ДанныеДокументаСоответствие)

	ДокЗакупкиОбъект.ДокументыЗакупки.Очистить();

	МассивДокументы = ДанныеДокументаСоответствие["Docs"];

	Если Не МассивДокументы = Неопределено И ТипЗнч(МассивДокументы) = Тип("Массив") И МассивДокументы.Количество() > 0 Тогда
		Для Каждого ЭлементДокумент Из МассивДокументы Цикл

			НовСтрокаТаблицыДокументы = ДокЗакупкиОбъект.ДокументыЗакупки.Добавить();
			ЗаполнитьСтрокуДокументы(НовСтрокаТаблицыДокументы, ЭлементДокумент);

		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ЗагрузитьШапку(ДокЗакупкиОбъект, ДанныеДокументаСоответствие)

	ДокЗакупкиОбъект.ИКЗ.Очистить();

	ДокЗакупкиОбъект.НомерЗакупки = ДанныеДокументаСоответствие["NotificationNumber"];
	ДокЗакупкиОбъект.ИмяОписаниеЗакупки = ДанныеДокументаСоответствие["Title"];
	ДокЗакупкиОбъект.ДатаСозданияЗакупки = КонтурЗакупки_СлужебныеВызовСервера.ПолучитьДатуВремяИзСтроки(
			ДанныеДокументаСоответствие["PublicationDateTimeUTC"], "GMT+3");
	ДокЗакупкиОбъект.ДатаОкончанияПодачиЗаявок = КонтурЗакупки_СлужебныеВызовСервера.ПолучитьДатуВремяИзСтроки(
			ДанныеДокументаСоответствие["ApplicationDeadline"], "GMT+3");
	ДокЗакупкиОбъект.ДатаПодведенияИтогов = КонтурЗакупки_СлужебныеВызовСервера.ПолучитьДатуВремяИзСтроки(
			ДанныеДокументаСоответствие["CommissionDeadline"], "GMT+3");

	Контакт = ДанныеДокументаСоответствие["ContactPerson"];
	Если Не Контакт = Неопределено Тогда

		ДокЗакупкиОбъект.КонтактныеДанныеИмя = Контакт["Name"];
		ДокЗакупкиОбъект.КонтактныеДанныеЭлектроннаяПочта = Контакт["Email"];
		ДокЗакупкиОбъект.КонтактныеДанныеТелефон = Контакт["Phone"];
	КонецЕсли;

	ДокЗакупкиОбъект.ДатаПоследнегоИзмененияЗакупки = КонтурЗакупки_СлужебныеВызовСервера.ПолучитьДатуВремяИзСтроки(
			ДанныеДокументаСоответствие["UpdatedDatetime"], "GMT+3");

	СуммыДокумента = ДанныеДокументаСоответствие["InitialSum"];
	Если Не СуммыДокумента = Неопределено Тогда
		ДокЗакупкиОбъект.НМЦЗакупки = СуммыДокумента["Price"];
		ДокЗакупкиОбъект.Валюта = СуммыДокумента["Currency"];
	КонецЕсли;

	ДокЗакупкиОбъект.ТипЗакупки = ДанныеДокументаСоответствие["NotificationType"];
	ДокЗакупкиОбъект.ПризнакЗакупкаДляСМП = ДанныеДокументаСоответствие["SMP"];
	ДокЗакупкиОбъект.СпособОтбора = ДанныеДокументаСоответствие["NotificationPlacingWay"];
	ДокЗакупкиОбъект.ДатаПроведенияАукциона = КонтурЗакупки_СлужебныеВызовСервера.ПолучитьДатуВремяИзСтроки(
			ДанныеДокументаСоответствие["AuctionDateTime"], "GMT+3");
	ДокЗакупкиОбъект.СсылкаНаЗакупкуНаЭТП = ДанныеДокументаСоответствие["EtpLink"];
	ДокЗакупкиОбъект.СсылкаНаЗакупкуНаЕИС = ДанныеДокументаСоответствие["EisLink"];
	ДокЗакупкиОбъект.СсылкаНаЗакупкуНаКЗ = ДанныеДокументаСоответствие["Link"];

	Организатор = ДанныеДокументаСоответствие["Organizer"];
	Если Не Организатор = Неопределено Тогда
		ДокЗакупкиОбъект.ОрганизаторНаименование = Организатор["FullName"];
		ДокЗакупкиОбъект.ОрганизаторИНН = Организатор["Inn"];
		ДокЗакупкиОбъект.ОрганизаторКПП = Организатор["Kpp"];
	Иначе
		// нет организатора. Берем 1-го заказчика
		МассивЛоты = ДанныеДокументаСоответствие["Lots"];

		Если Не МассивЛоты = Неопределено И ТипЗнч(МассивЛоты) = Тип("Массив") И МассивЛоты.Количество() > 0 Тогда
			ЭлементЛот = МассивЛоты[0];
			МассивЗаказчики = ЭлементЛот["Customers"];
			Если Не МассивЗаказчики = Неопределено И ТипЗнч(МассивЗаказчики) = Тип("Массив")
				И МассивЗаказчики.Количество() > 0 Тогда
				ЭлементЗаказчик = МассивЗаказчики[0];

				Организация = ЭлементЗаказчик["Organization"];
				Если Не Организация = Неопределено Тогда
					ДокЗакупкиОбъект.ОрганизаторНаименование = Организация["Name"];
					ДокЗакупкиОбъект.ОрганизаторИНН = Организация["Inn"];
					ДокЗакупкиОбъект.ОрганизаторКПП = Организация["Kpp"];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	МассивИКЗ = ДанныеДокументаСоответствие["IkzCodes"];
	Если Не МассивИКЗ = Неопределено И ТипЗнч(МассивИКЗ) = Тип("Массив") И МассивИКЗ.Количество() > 0 Тогда
		Для Каждого ЭлементИКЗ Из МассивИКЗ Цикл
			НовСтрокаИКЗ = ДокЗакупкиОбъект.ИКЗ.Добавить();
			НовСтрокаИКЗ.ИКЗ = ЭлементИКЗ;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьДанныеПоКонтрактамРезультатЗакупки(ЭлементСправочника, МассивКонтрактов) 
	
	КлючСвязиКонтракт = 0;
	
	Для Каждого ЭлементКонтракт Из МассивКонтрактов Цикл
		
		КлючСвязиКонтракт = КлючСвязиКонтракт + 1;		
		
		СтрокаКонтракт = ДобавитьСтрокуКонтрактаРезультатЗакупки(ЭлементСправочника, ЭлементКонтракт, КлючСвязиКонтракт);
			
		МассивОбъектыЗакупки = ЭлементКонтракт["Products"];		
		Если МассивОбъектыЗакупки <> Неопределено 
			И МассивОбъектыЗакупки.Количество() > 0 Тогда
			
			ЗаполнитьДанныеПоОбъектамРезультатЗакупки(ЭлементСправочника, МассивОбъектыЗакупки, КлючСвязиКонтракт);
			
		КонецЕсли;		
		
		МассивПоставщиков = ЭлементКонтракт["Supplier"];
		Если МассивПоставщиков <> Неопределено 
			И МассивПоставщиков.Количество() > 0 Тогда
			
			ЗаполнитьДанныеПоПоставщикамРезультатЗакупки(ЭлементСправочника, МассивПоставщиков, КлючСвязиКонтракт);
			
		КонецЕсли;
		
		МассивДокументов = ЭлементКонтракт["Docs"];
				
		Если МассивДокументов <> Неопределено 
			И МассивДокументов.Количество() > 0 Тогда
			
			ЗаполнитьДанныеПоДокументамРезультатЗакупки(ЭлементСправочника, МассивДокументов, КлючСвязиКонтракт, "Контракт");	
				
		КонецЕсли;
						
	КонецЦикла;	
	
	ЭлементСправочника.Контракты.Сортировать("Номер, Дата");
	
КонецПроцедуры 

Процедура ЗаполнитьДанныеПоПроектамРезультатЗакупки(ЭлементСправочника, МассивПроектов)
	
	КлючСвязиПроект = 0;
	Для Каждого ЭлементПроект Из МассивПроектов Цикл
		
		КлючСвязиПроект = КлючСвязиПроект + 1;
				
		СтрокаПроект = ДобавитьСтрокуПроектаРезультатЗакупки(ЭлементСправочника, ЭлементПроект, КлючСвязиПроект);
				
		МассивДокументов = ЭлементПроект["Docs"];
		Если МассивДокументов <> Неопределено 
			И МассивДокументов.Количество() > 0 Тогда 
			
			ЗаполнитьДанныеПоДокументамРезультатЗакупки(ЭлементСправочника, МассивДокументов, КлючСвязиПроект, "Проект");
				
		КонецЕсли;
				
	КонецЦикла;
	
	ЭлементСправочника.Проекты.Сортировать("Номер, Дата");
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоПротоколамРезультатЗакупки(ЭлементСправочника, МассивПротоколов)
	
	КлючСвязиПротокол = 0;	
	Для Каждого ЭлементПротокол Из МассивПротоколов Цикл
		
		КлючСвязиПротокол = КлючСвязиПротокол + 1;
		
		СтрокаПротокол = ДобавитьСтрокуПротоколаРезультатЗакупки(ЭлементСправочника, ЭлементПротокол, КлючСвязиПротокол);
				
		МассивУчастников = ЭлементПротокол["Participants"];
		Если МассивУчастников <> Неопределено 
			И МассивУчастников.Количество() > 0 Тогда 
			
			ЗаполнитьДанныеПоУчастникамРезультатЗакупки(ЭлементСправочника, МассивУчастников, КлючСвязиПротокол);
			
		КонецЕсли;
				
		МассивДокументов = ЭлементПротокол["Docs"];	
		Если МассивДокументов <> Неопределено 
			И МассивДокументов.Количество() > 0 Тогда
			
			ЗаполнитьДанныеПоДокументамРезультатЗакупки(ЭлементСправочника,МассивДокументов, КлючСвязиПротокол, "Протокол");
			
		КонецЕсли;
	
	КонецЦикла; 
	
	ЭлементСправочника.Протоколы.Сортировать("Номер, Дата");
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоОбъектамРезультатЗакупки(ЭлементСправочника, МассивОбъектыЗакупки, КлючСвязи)

	КлючСвязиОбъектЗакупки = 0; 
	Для Каждого ЭлементОбъектаЗакупки Из МассивОбъектыЗакупки Цикл
		
		КлючСвязиОбъектЗакупки 	= КлючСвязиОбъектЗакупки + 1;			
		
		КлючиСвязи = Новый Структура("КлючСвязиКонтракт, КлючСвязиОбъектЗакупки", КлючСвязи, КлючСвязиОбъектЗакупки);				
		СтрокаОбъектЗакупки = ДобавитьСтрокуОбъектаРезультатЗакупки(ЭлементСправочника, ЭлементОбъектаЗакупки, КлючиСвязи);
					
		МассивОКВЭД2 = ЭлементОбъектаЗакупки["Okved2s"];	
		Если МассивОКВЭД2 <> Неопределено 
			И МассивОКВЭД2.Количество() > 0 Тогда			
			ЗагрузитьСтрокиОКВЭД2(ЭлементСправочника, МассивОКВЭД2, КлючСвязиОбъектЗакупки);		
		КонецЕсли;
		
		МассивОКПД2 = ЭлементОбъектаЗакупки["Okpd2s"];		
		Если МассивОКПД2 <> Неопределено  
			И МассивОКПД2.Количество() > 0 Тогда			
			ЗагрузитьСтрокиОКПД2(ЭлементСправочника, МассивОКПД2, КлючСвязиОбъектЗакупки);		
		КонецЕсли;
		
		МассивКТРУ = ЭлементОбъектаЗакупки["Ktrus"];	
		Если МассивКТРУ <> Неопределено 
			И МассивКТРУ.Количество() > 0 Тогда
			ЗагрузитьСтрокиКТРУ(ЭлементСправочника, МассивКТРУ, КлючСвязиОбъектЗакупки);			
		КонецЕсли; 
				
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнитьДанныеПоПоставщикамРезультатЗакупки(ЭлементСправочника, МассивПоставщиков, КлючСвязи)

	Для Каждого ЭлементПоставщик Из МассивПоставщиков Цикл
		
		СтрокаПоставщик = ЭлементСправочника.Поставщики.Добавить();
				
		СтрокаПоставщик.Поставщик 		  = ЭлементПоставщик["Name"];
		СтрокаПоставщик.Адрес 			  = ЭлементПоставщик["Address"];
		СтрокаПоставщик.ИНН 			  = ЭлементПоставщик["Inn"];
		СтрокаПоставщик.КПП				  = ЭлементПоставщик["Kpp"];
		СтрокаПоставщик.Телефон 		  = ЭлементПоставщик["Phone"];
		СтрокаПоставщик.ЭлектроннаяПочта  = ЭлементПоставщик["Email"];
		СтрокаПоставщик.КлючСвязиКонтракт = КлючСвязи;
		
	КонецЦикла;	
	
КонецПроцедуры  

Процедура ЗаполнитьДанныеПоДокументамРезультатЗакупки(ЭлементСправочника, МассивДокументов, КлючСвязи, Имя)
	
	Для Каждого ЭлементДокумент Из МассивДокументов Цикл
		
		СтрокаДокумент = ЭлементСправочника.Документы.Добавить();
				
		СтрокаДокумент.Владелец 	= Имя;
		СтрокаДокумент.ИмяФайла 	= ЭлементДокумент["FileName"];
		СтрокаДокумент.СсылкаНаФайл = ЭлементДокумент["Url"];
		СтрокаДокумент.КлючСвязи 	= КлючСвязи;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоУчастникамРезультатЗакупки(ЭлементСправочника, МассивУчастников, КлючСвязи)
	
	Для Каждого ЭлементУчастник Из МассивУчастников Цикл
		
		СтрокаУчастник = ЭлементСправочника.Участники.Добавить();
				
		ДатаВФорматеJSON = ЭлементУчастник["ApplicationDate"];
		
		ДатаЗаявки = КонтурЗакупки_СлужебныеВызовСервера.ПолучитьДатуВремяИзСтроки(ДатаВФорматеJSON, "GMT+3");
		
		СтрокаУчастник.Участник 			 = ЭлементУчастник["Name"];
		СтрокаУчастник.ИНН 					 = ЭлементУчастник["Inn"];
		СтрокаУчастник.КПП 					 = ЭлементУчастник["Kpp"];
		СтрокаУчастник.НомерЗаявки 			 = ЭлементУчастник["ApplicationNumber"];
		СтрокаУчастник.ДатаЗаявки 			 = ДатаЗаявки; 
		СтрокаУчастник.ПредложеннаяЦена 	 = ЭлементУчастник["ApplicationPrice"];
		СтрокаУчастник.ВозможныйУчастник 	 = ЭлементУчастник["FoundFromDocuments"];
		СтрокаУчастник.ЯвляетсяПоставщиком 	 = ЭлементУчастник["IsContractSigned"];
		СтрокаУчастник.ЯвляетсяПобедителем 	 = ЭлементУчастник["IsWinner"];
		СтрокаУчастник.РезультатРассмотрения = ЭлементУчастник["ReviewResult"];
		СтрокаУчастник.ПричинаНесоответствия = ЭлементУчастник["NonAdmittedReason"];
		СтрокаУчастник.КлючСвязиПротокол 	 = КлючСвязи;
		
	КонецЦикла;  
	
	ЭлементСправочника.Участники.Сортировать("НомерЗаявки, ДатаЗаявки");
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоОрганизацииРезультатЗакупки(ДанныеОрганизации, СтрокаТЧ, ИмяРеквизитаТЧ)
	
	СтрокаТЧ[ИмяРеквизитаТЧ] 		 = ДанныеОрганизации["Name"];
	СтрокаТЧ[ИмяРеквизитаТЧ + "ИНН"] = ДанныеОрганизации["Inn"];
	СтрокаТЧ[ИмяРеквизитаТЧ + "КПП"] = ДанныеОрганизации["Kpp"];
		
КонецПроцедуры

Функция ДобавитьСтрокуКонтрактаРезультатЗакупки(ЭлементСправочника, ДанныеКонтракта, КлючСвязи)
	
	СтрокаКонтракт = ЭлементСправочника.Контракты.Добавить();	
	
	ДатаВФорматеJSON = ДанныеКонтракта["ContractSignDate"];
	
	СтрокаКонтракт.Номер 			 = ДанныеКонтракта["ContractNumber"];
	СтрокаКонтракт.Дата 			 = КонтурЗакупки_СлужебныеВызовСервера.ПолучитьДатуВремяИзСтроки(ДатаВФорматеJSON, "GMT+3");
	СтрокаКонтракт.Этап 			 = ДанныеКонтракта["ContractStage"];
	СтрокаКонтракт.Тип 				 = ДанныеКонтракта["ContractType"];
	СтрокаКонтракт.Валюта			 = ДанныеКонтракта["Currency"];
	СтрокаКонтракт.ВебСсылкаЕИС		 = ДанныеКонтракта["EisContractLink"];
	СтрокаКонтракт.ФинальнаяЦена	 = ДанныеКонтракта["FinalPrice"];
	СтрокаКонтракт.КлючСвязиКонтракт = КлючСвязи;
	
	ДанныеЗаказчика = ДанныеКонтракта["Customer"];	
	Если ДанныеЗаказчика <> Неопределено Тогда					
		ЗаполнитьДанныеПоОрганизацииРезультатЗакупки(ДанныеЗаказчика, СтрокаКонтракт, "Заказчик");					
	КонецЕсли;
	
	Возврат СтрокаКонтракт;	
	
КонецФункции

Функция ДобавитьСтрокуПроектаРезультатЗакупки(ЭлементСправочника, ДанныеПроекта, КлючСвязи)
	
	СтрокаПроект = ЭлементСправочника.Проекты.Добавить();	
	
	ДатаВФорматеJSON = ДанныеПроекта["ProjectPublishDate"];
	
	СтрокаПроект.Тип 			 = ДанныеПроекта["ProjectType"];
	СтрокаПроект.Номер 			 = ДанныеПроекта["ProjectNumber"];
	СтрокаПроект.Дата 			 = КонтурЗакупки_СлужебныеВызовСервера.ПолучитьДатуВремяИзСтроки(ДатаВФорматеJSON, "GMT+3");  
	СтрокаПроект.Валюта 		 = ДанныеПроекта["Currency"];
	СтрокаПроект.ВебСсылкаЭТП 	 = ДанныеПроекта["EisProjectLink"];	
	СтрокаПроект.ЦенаПоПроекту 	 = ДанныеПроекта["ProjectPrice"];
	СтрокаПроект.КлючСвязиПроект = КлючСвязи;
	
	ЗаказчикПроекта = ДанныеПроекта["Customer"];	
	Если ЗаказчикПроекта <> Неопределено Тогда			
		ЗаполнитьДанныеПоОрганизацииРезультатЗакупки(ЗаказчикПроекта, СтрокаПроект, "Заказчик"); 			
	КонецЕсли;
	
	ПоставщикПроекта = ДанныеПроекта["Supplier"];	
	Если ПоставщикПроекта <> Неопределено Тогда		
		ЗаполнитьДанныеПоОрганизацииРезультатЗакупки(ПоставщикПроекта, СтрокаПроект, "Поставщик"); 		
	КонецЕсли;
	
	Возврат СтрокаПроект;
	
КонецФункции

Функция ДобавитьСтрокуПротоколаРезультатЗакупки(ЭлементСправочника, ДанныеПротокола, КлючСвязи)
	
	СтрокаПротокол = ЭлементСправочника.Протоколы.Добавить();
	
	ДатаВФорматеJSON = ДанныеПротокола["ProtocolPublishDate"];
	
	СтрокаПротокол.Номер 			 = ДанныеПротокола["ProtocolNumber"];
	СтрокаПротокол.Дата 			 = КонтурЗакупки_СлужебныеВызовСервера.ПолучитьДатуВремяИзСтроки(ДатаВФорматеJSON, "GMT+3");
	СтрокаПротокол.Тип 				 = ДанныеПротокола["ProtocolType"];
	СтрокаПротокол.РасшифровкаТипа 	 = ДанныеПротокола["ProtocolTypeName"];  
	СтрокаПротокол.ПричинаОтклонения = ДанныеПротокола["AbandonedReason"];
	СтрокаПротокол.ВебСсылкаЕИС 	 = ДанныеПротокола["EisProtocolLink"];
	СтрокаПротокол.ВебСсылкаЭТП 	 = ДанныеПротокола["EtpProtocolLink"]; 
	СтрокаПротокол.КлючСвязиПротокол = КлючСвязи;
	
	Возврат СтрокаПротокол;
	
КонецФункции

Функция ДобавитьСтрокуОбъектаРезультатЗакупки(ЭлементСправочника, ДанныеОбъектаЗакупки, КлючиСвязи)
	
	СтрокаОбъектЗакупки = ЭлементСправочника.ОбъектыЗакупки.Добавить();	
	
	СтрокаОбъектЗакупки.Наименование 	  		= ДанныеОбъектаЗакупки["Name"]; 
	СтрокаОбъектЗакупки.ЕдиницаИзмерения  		= ДанныеОбъектаЗакупки["Okei"];
	СтрокаОбъектЗакупки.Количество 		  		= ДанныеОбъектаЗакупки["Quantity"];
	СтрокаОбъектЗакупки.КлючСвязиКонтракт 		= КлючиСвязи.КлючСвязиКонтракт;
	СтрокаОбъектЗакупки.КлючСвязиОбъектЗакупки  = КлючиСвязи.КлючСвязиОбъектЗакупки;
	
	ЦенаОбъектаЗакупки = ДанныеОбъектаЗакупки["Price"];	
	Если ЦенаОбъектаЗакупки <> Неопределено Тогда			
		СтрокаОбъектЗакупки.ОбщаяСтоимость = ЦенаОбъектаЗакупки["PositionPrice"];
		СтрокаОбъектЗакупки.ЦенаЗаЕдиницу  = ЦенаОбъектаЗакупки["ItemPrice"];		
	КонецЕсли;

	Возврат СтрокаОбъектЗакупки;
	
КонецФункции 

#КонецОбласти

#КонецЕсли