// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Метки") Тогда
		Метки.Загрузить(Параметры.Метки.Выгрузить());
		ЗаполнитьТаблицуМеток();
		УстиновитьФлагиТаблицыМеток(Метки.Выгрузить( , "Метка"));
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаМеток

&НаКлиенте
Процедура ТаблицаМетокФлагПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ТаблицаМеток.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда

		СтрокаТаблицы = ТаблицаМеток.НайтиПоИдентификатору(ИДТекущейСтроки);
		МассиивМеток = Новый Массив; // Массив из СправочникСсылка.КонтурЗакупки_Метки
		МассиивМеток.Добавить(СтрокаТаблицы.Метка);
		Если СтрокаТаблицы.Флаг Тогда
			ДобавитьМеткуВТабличнуюЧасть(МассиивМеток);
		Иначе
			УдалитьМеткуИзТабличнойЧасти(МассиивМеток);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМетокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(Метки);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	МассивМеток = Новый Массив; // Массив из СправочникСсылка.КонтурЗакупки_Метки
	Для Каждого СтрокаМетки Из ТаблицаМеток Цикл
		СтрокаМетки.Флаг = Ложь;
		МассивМеток.Добавить(СтрокаМетки.Метка);
	КонецЦикла;
	УдалитьМеткуИзТабличнойЧасти(МассивМеток);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	МассивМеток = Новый Массив; // Массив из СправочникСсылка.КонтурЗакупки_Метки
	Для Каждого СтрокаМетки Из ТаблицаМеток Цикл
		Если Не СтрокаМетки.ПометкаУдаления Тогда
			СтрокаМетки.Флаг = Истина;;
			МассивМеток.Добавить(СтрокаМетки.Метка);
		КонецЕсли;
	КонецЦикла;
	ДобавитьМеткуВТабличнуюЧасть(МассивМеток);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавить Метка в табличную часть.
// 
// Параметры:
//  МассивМеток - Массив из СправочникСсылка.КонтурЗакупки_Метки - Массив меток
&НаКлиенте
Процедура ДобавитьМеткуВТабличнуюЧасть(Знач МассивМеток)
	Для Каждого Метка Из МассивМеток Цикл
		ОтборПоМетке = Новый Структура("Метка", Метка);
		МассивСтрок = Метки.НайтиСтроки(ОтборПоМетке);
		Если МассивСтрок.Количество() = 0 Тогда
			НовСтр = Метки.Добавить();
			НовСтр.Метка = Метка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Удалить метку из табличной части.
// 
// Параметры:
//  МассивМеток - Массив из СправочникСсылка.КонтурЗакупки_Метки - Массив меток
&НаКлиенте
Процедура УдалитьМеткуИзТабличнойЧасти(Знач МассивМеток)
	Для Каждого Метка Из МассивМеток Цикл
		ОтборПоМетке = Новый Структура("Метка", Метка);
		МассивСтрок = Метки.НайтиСтроки(ОтборПоМетке);
		Для Каждого СтрокаНаУдаление Из МассивСтрок Цикл
			Метки.Удалить(СтрокаНаУдаление);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуМеток()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЗакупки_Метки.Ссылка КАК Метка,
	|	КонтурЗакупки_Метки.Код КАК Код,
	|	КонтурЗакупки_Метки.ПометкаУдаления
	|ИЗ
	|	Справочник.КонтурЗакупки_Метки КАК КонтурЗакупки_Метки";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаМеток.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстиновитьФлагиТаблицыМеток(МассивВыбраныхМеток)
	Для Каждого СтрокаМеток Из ТаблицаМеток Цикл
		Если МассивВыбраныхМеток.Найти(СтрокаМеток.Метка) = Неопределено Тогда
			СтрокаМеток.Флаг = Ложь;
		Иначе
			СтрокаМеток.Флаг = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти