
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле <> Элементы.ИдентификаторОбъекта Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные.ТипДанных <> ПредопределенноеЗначение("Перечисление.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторДокумента", ТекущиеДанные.ИдентификаторОбъекта);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.МеткиВремениДанныхДокументовЭДО.ФормаСписка",
		ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
