#Область ПрограммныйИнтерфейс

// Возвращает доступные виды возврата для указанного вида продукции
//
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.КлючиВидовПродукцииИС,
//                               СправочникСсылка.ВидыПродукцииИС,
//                               Массив из СправочникСсылка.ВидыПродукцииИС - Виды продукции,
//                               СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа
//
// Возвращаемое значение:
//  Массив - доступные виды возврата
Функция ДоступныеВидыВозврата(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеВидВозврата"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ЭлементыКонструктораВидовПродукции

Функция ВозвратВОборотТовараПриобретавшегосяНеДляПродажи(ВидПродукцииТоварнаяГруппа, ВидВозврата) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидВозвратаВОборотТовараПриобретавшегосяНеДляПродажи"),
		ВидПродукцииТоварнаяГруппа,
		ВидВозврата);
	
КонецФункции

Функция ДоступноПолеВидПервичногоДокумента(ВидПродукцииТоварнаяГруппа, ВидВозвратаВОборот) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеВидПервичногоДокумента"),
		ВидПродукцииТоварнаяГруппа,
		ВидВозвратаВОборот);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляВидПервичногоДокумента(ВидПродукцииТоварнаяГруппа, ВидВозвратаВОборот) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляВидПервичногоДокумента"),
		ВидПродукцииТоварнаяГруппа,
		ВидВозвратаВОборот);
	
КонецФункции

Функция ДоступноПолеОплачен(ВидПродукцииТоварнаяГруппа, ВидВозврата) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеОплачен"),
		ВидПродукцииТоварнаяГруппа,
		ВидВозврата);
	
КонецФункции

#КонецОбласти

#КонецОбласти