
&После("ОбработкаПроведения")
Процедура АУ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.АУ_ПланФактБюджета.Записывать = Истина;
	
	Для Каждого ТекСтрокаСтатьиБюджета Из ЭтотОбъект.АУ_СтатьиБюджета Цикл
		
		Движение = Движения.АУ_ПланФактБюджета.Добавить();
		
		Если ЗначениеЗаполнено(ТекСтрокаСтатьиБюджета.ДатаБюджета) Тогда
			ДатаБюджета=ТекСтрокаСтатьиБюджета.ДатаБюджета;
		ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.АУ_ДатаБюджета) Тогда
			ДатаБюджета=ЭтотОбъект.АУ_ДатаБюджета;
		ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ДатаПроведенияБанком) Тогда
			ДатаБюджета=ЭтотОбъект.ДатаПроведенияБанком;
		Иначе
			ДатаБюджета=ЭтотОбъект.Дата;
		КонецЕсли;
		
		Движение.Период = НачалоМесяца(ДатаБюджета);
		Движение.Организация = ЭтотОбъект.Организация;
		Движение.СтатьяБюджета = ТекСтрокаСтатьиБюджета.СтатьяБюджета;
		
		Если ТекСтрокаСтатьиБюджета.СтатьяБюджета.Валютная Тогда
			
			Если ЭтотОбъект.АУ_ФактическийКурсВалюты<>0 Тогда
				Движение.СуммаФакт = ТекСтрокаСтатьиБюджета.Сумма*ЭтотОбъект.АУ_ФактическийКурсВалюты;
			ИначеЕсли ЭтотОбъект.КурсКонвертации<>0 Тогда
				Движение.СуммаФакт = ТекСтрокаСтатьиБюджета.Сумма*ЭтотОбъект.КурсКонвертации;
			Иначе
				Движение.СуммаФакт = РаботаСКурсамиВалют.ПересчитатьВВалюту(ТекСтрокаСтатьиБюджета.Сумма,ЭтотОбъект.Валюта,Константы.ВалютаРегламентированногоУчета.Получить(),?(ЗначениеЗаполнено(ЭтотОбъект.ДатаПроведенияБанком),ЭтотОбъект.ДатаПроведенияБанком,ЭтотОбъект.Дата));
			КонецЕсли;
			
		Иначе
			Движение.СуммаФакт=ТекСтрокаСтатьиБюджета.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура АУ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.КонвертацияВалюты Тогда
		
	ИначеЕсли ЭтотОбъект.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика Тогда
		
	ИначеЕсли ЭтотОбъект.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда
		
		//Если ЭтотОбъект.АУ_СтатьиБюджета.Количество()=0 Тогда
		//	
		//	НоваяСтрока=ЭтотОбъект.АУ_СтатьиБюджета.Добавить();
		//	НоваяСтрока.СтатьяБюджета=АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("СтатьяБюджетаВыручка");
		//	НоваяСтрока.Сумма=ЭтотОбъект.СуммаДокумента;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
	МассивКодов=Новый Массив;
	КодыСтатей=ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ЭтотОбъект.АУ_СтатьиБюджета.ВыгрузитьКолонку("СтатьяБюджета"),"Код");
	Для каждого стрКод Из КодыСтатей Цикл
		Если ЗначениеЗаполнено(стрКод.Значение) Тогда
			МассивКодов.Добавить(стрКод.Значение);
		КонецЕсли;
	КонецЦикла;
	ЭтотОбъект.АУ_КодыСтатейБюджета=СтрСоединить(МассивКодов,", ");
	
КонецПроцедуры
