&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _КлиентскиеВызовы;

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьФорму(ФормаКлиентскиеВызовы) Экспорт
	
	_КлиентскиеВызовы = ФормаКлиентскиеВызовы;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("ДанныеДляВыбора") И ЗначениеЗаполнено(Параметры.ДанныеДляВыбора) Тогда
		Если ТипЗнч(Параметры.ДанныеДляВыбора) = Тип("СписокЗначений") Тогда
			Для Каждого ЭлементСписка Из Параметры.ДанныеДляВыбора Цикл
				НоваяСтрока = ДанныеДляВыбора.Добавить();
				НоваяСтрока.Значение = ЭлементСписка.Значение;
				НоваяСтрока.Представление = ЭлементСписка.Представление;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтображатьПредставление") Тогда
		Элементы.ДанныеДляВыбораПредставление.Видимость = Параметры.ОтображатьПредставление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = ДанныеДляВыбора.НайтиПоИдентификатору(ВыбраннаяСтрока); 

	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("Значение", ТекущиеДанные.Значение);
	РезультатВыбора.Вставить("Представление", ТекущиеДанные.Представление);
	
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры

