
&После("ПередВыполнениемОбменов")
Процедура АУ_ПередВыполнениемОбменов(УзелИнформационнойБазы, Отказ)
	
	Если ТипЗнч(УзелИнформационнойБазы) = Тип("ПланОбменаСсылка.СинхронизацияДанныхЧерезУниверсальныйФормат") Тогда
		
		МассивУдаляемых = Новый Массив;
		
		Выборка = ПланыОбмена.ВыбратьИзменения(УзелИнформационнойБазы, УзелИнформационнойБазы.НомерОтправленного + 1);
		Пока Выборка.Следующий() Цикл
			
			ТекущийОбъект = Выборка.Получить();
			Если ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.СчетФактураПолученный") Тогда
				
				Если ТекущийОбъект.ДокументыОснования.Количество() = 0 Тогда
					МассивУдаляемых.Добавить(ТекущийОбъект);
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.СборкаТоваров") Тогда
				
				Если НЕ ТекущийОбъект.Проведен Тогда
					МассивУдаляемых.Добавить(ТекущийОбъект);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивУдаляемых.Количество() > 0 Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелИнформационнойБазы, МассивУдаляемых);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
