Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаТрН(Данные, Представление, СтандартнаяОбработка, "3");
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов(Знач ЭтоОтказВПриемке = Ложь) Экспорт
	
	МассивОбязательных = Новый Массив();
	
	МассивОбязательных.Добавить("ЗаявДатВрПриб");
	МассивОбязательных.Добавить("ФДатВрПриб");
	МассивОбязательных.Добавить("ФДатВрУбыт");
	МассивОбязательных.Добавить("МестоВыгрузки");	
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	// если полный отказ то необязательны
	Если Не ЭтоОтказВПриемке Тогда 
		МассивОбязательных.Добавить("КоличествоМестПринято");
		МассивОбязательных.Добавить("ОбщееСостояние");
		МассивОбязательных.Добавить("МассаБруттоКг");
	КонецЕсли;
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ОтгрузочноеНаименование");
	МассивОбязательных.Добавить("СостояниеГруза");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	//МассивОбязательных.Добавить("Прицеп");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	//МассивДополнительных.Добавить(ДопРеквизитСтруктура("МаркировкиМассив", "Маркировки", "Маркировка(и) товара", "МассивСтрок или Строка", 3));
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	//МассивДополнительных.Добавить(ДопРеквизитСтруктура("МаркировкиМассив", "Маркировки", "Маркировка(и) товара", "МассивСтрок или Строка", 3));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("ДокументЭТРН");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфГП");
	МассивКлючевых.Добавить("ВрИнфГП");
	
	МассивКлючевых.Добавить("ИдФайлИнфПрвПрием");
	МассивКлючевых.Добавить("ДатФайлПрвПрием");
	МассивКлючевых.Добавить("ВрФайлПрвПрием");
	МассивКлючевых.Добавить("ЭППВ");
	
	МассивКлючевых.Добавить("НомИспр");
	МассивКлючевых.Добавить("ДатаИспр");
	
	МассивКлючевых.Добавить("ЭтоПриемВозврата");
	
	Возврат МассивКлючевых;
	
КонецФункции

// какие поля могут быть высчитаны из базовых
Функция МассивБазовыхСоответствийРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	//МассивОбязательных.Добавить("Прицеп");
	Возврат МассивОбязательных;
	
КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

// Конец Обязательные манифесты

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ТребуемоеДействие = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	ЭтоОтправкаЧерновика = (ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ОтправитьЧерновик
		Или (ПараметрыФормированияФайлов <> Неопределено
			И ПараметрыФормированияФайлов.Свойство("ТребуетсяПодпись")
			И Не ПараметрыФормированияФайлов.ТребуетсяПодпись
			И Не ПараметрыФормированияФайлов.Свойство("ПередатьНаПодписание")));
	ЭтоПередачаНаПодписание = (ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание
		Или (ПараметрыФормированияФайлов <> Неопределено
			И ПараметрыФормированияФайлов.Свойство("ТребуетсяПодпись")
			И Не ПараметрыФормированияФайлов.ТребуетсяПодпись
			И ПараметрыФормированияФайлов.Свойство("ПередатьНаПодписание")));
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиПредыдущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ДокументОбъектИлиСсылка.ДокументЭТРН, ТаблицаОшибок);
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		КрайнийФайл = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ДокументОбъектИлиСсылка.Ссылка);
		Если КрайнийФайл <> Неопределено И Не КрайнийФайл.ПодписьВерна Тогда
			
			ВыполнитьВалидации(ДокументОбъектИлиСсылка, ТаблицаОшибок, ТекСтатусТитула, ЭтоОтправкаЧерновика, ПараметрыФормированияФайлов);
			
		КонецЕсли;
		
	Иначе
		
		ВыполнитьВалидации(ДокументОбъектИлиСсылка, ТаблицаОшибок, ТекСтатусТитула, ЭтоОтправкаЧерновика, ПараметрыФормированияФайлов);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьВалидации(Знач ДокументОбъектИлиСсылка, Знач ТаблицаОшибок, Знач ТекСтатусТитула, Знач ЭтоОтправкаЧерновика, Знач ПараметрыФормированияФайлов)
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3, ТаблицаОшибок);
	
	ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок, ТекСтатусТитула, ЭтоОтправкаЧерновика);
	
	ПроверитьТабЧастьТовары(ДокументОбъектИлиСсылка, ТаблицаОшибок, ТекСтатусТитула, ЭтоОтправкаЧерновика);
	
	ЭтоОбработкаВходящего = (ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки);
	
	Если Не ЭтоОбработкаВходящего И Не ЭтоОтправкаЧерновика Тогда
		ПроверитьОтметки(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		ПроверитьИнфПол(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок, ТекСтатусТитула, ЭтоОтправкаЧерновика)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ЭтоОбработкаВходящего = (ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки);
	Если ЭтоОбработкаВходящего Или ЭтоОтправкаЧерновика Тогда
		КатегорияОшибка = КатегорияПредупреждение;
	КонецЕсли;
	
	ДокументЭТРН = Объект.ДокументЭТРН;
	
	Если Не ЗначениеЗаполнено(ДокументЭТРН)  Тогда
		
		ТекстОшибки = "Титул не привязан к Документу электронной транспортной накладной";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ДокументЭТРН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		Если ЭтоОтправкаЧерновика Тогда
			
			ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(ДокументЭТРН.Грузополучатель);
			Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
				ТекстОшибки = "У отправителя черновика (" + ДокументЭТРН.Грузополучатель + ") нет авторизации в сервисе Логистика";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
					"Составитель", КатегорияОшибка, ТекстОшибки, "Указать");
			КонецЕсли;
			
		КонецЕсли;
		
		ПроверитьСценарийГПравенПВ(ДокументЭТРН, КатегорияОшибка, ТаблицаОшибок);
		
		Если Объект.ОтказВПриемке И не ЗначениеЗаполнено(СокрЛП(Объект.ПричОтк)) Тогда 
			
			ТекстОшибки = "Укажите причину отказа от приемки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ПричОтк", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		ОбязательныеРеквизитыТРН = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МассивОбязательныхРеквизитов();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыТРН Цикл
			Если НЕ ЗначениеЗаполнено(ДокументЭТРН[ОбязательныйРевизит])  Тогда
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной транспортной накладной";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		РеквизитыЭТРН = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
			ДокументЭТРН, "ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку, ПогрузкуОсуществляет, Грузоотправитель, Перевозчик");
		Если РеквизитыЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку И ЗначениеЗаполнено(РеквизитыЭТРН.ПогрузкуОсуществляет) Тогда
			ИстинныйГрузоотправитель = РеквизитыЭТРН.ПогрузкуОсуществляет;
		Иначе
			ИстинныйГрузоотправитель = РеквизитыЭТРН.Грузоотправитель;
		КонецЕсли;
		
		Если Не ИстинныйГрузоотправитель.Наш И Не РеквизитыЭТРН.Перевозчик.Наш Тогда
			Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПроверитьКлючевыеРеквизитыЭтРН(ДокументЭТРН, ТаблицаОшибок,, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов(Объект.ОтказВПриемке) Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ТрН_Титул3.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.КоличествоМестПринято > 9999 Тогда 
		
		ТекстОшибки = "Длина в поле ""Количество мест"" превышает 4.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"КоличествоМест", КатегорияОшибка, ТекстОшибки, "Исправить");
		
	КонецЕсли;
	
	// отправляем или по ТЧ Товары (нет документаУС или настройка) или по ТЧ ТоварыСоответствиеСтрокТоваров (если есть документУС + настройка)
	Если ЗначениеЗаполнено(Объект.ДокументОснование) 
		И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т3ТоварыУчитыватьУчетныйДокумент") Тогда
		
		ИтогПоОтправляемойТЧ 		= Объект.ТоварыСоответствиеСтрокТоваров.Итог("КоличествоМест");
		ИтогМассаПоОтправляемойТЧ 	= Объект.ТоварыСоответствиеСтрокТоваров.Итог("МассаБруттоКг");
		
		ИтогПоТоварамТ1 		= Объект.Товары.Итог("КоличествоМест");
		ИтогМассаПоТоварамТ1 	= Объект.Товары.Итог("МассаБруттоКг");
		
		Если ИтогПоОтправляемойТЧ <> ИтогПоТоварамТ1 И Не Объект.ОтказВПриемке Тогда 
			ТекстОшибки = "Количество Мест из грузов титула 1 отличается от итога по отправляемой таб. части грузов";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"КоличествоМест", КатегорияПредупреждение, ТекстОшибки, "Проверить");
		КонецЕсли;
		
		Если ИтогМассаПоОтправляемойТЧ <> ИтогМассаПоТоварамТ1 И Не Объект.ОтказВПриемке  Тогда 
			ТекстОшибки = "Масса Брутто из грузов титула 1 отличается от итога по отправляемой таб. части грузов";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"МассаБруттоКг", КатегорияПредупреждение, ТекстОшибки, "Проверить");
		КонецЕсли;
		
	Иначе
		
		ИтогПоОтправляемойТЧ 		= Объект.Товары.Итог("КоличествоМест");
		ИтогМассаПоОтправляемойТЧ 	= Объект.Товары.Итог("МассаБруттоКг");
		
	КонецЕсли;
	
	Если Объект.РазбиватьГрузыПоСтрокам и Не Объект.ОтказВПриемке Тогда
		
		КатегорияОшибкиИтогов = КатегорияОшибка;
		ТекстУточнения = "отправляемой ";
		
	Иначе
		
		КатегорияОшибкиИтогов = КатегорияПредупреждение;
		ТекстУточнения = "";
		
	КонецЕсли;
	
	Если ИтогПоОтправляемойТЧ <> 0 И Объект.КоличествоМестПринято <> ИтогПоОтправляемойТЧ Тогда
		
		ТекстОшибки = "Количество Мест в шапке документа отличается от итога по " + ТекстУточнения + "таб. части грузов";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"КоличествоМест", КатегорияОшибкиИтогов, ТекстОшибки, "Проверить");
	КонецЕсли;
	
	Если ИтогМассаПоОтправляемойТЧ <> 0 И Объект.МассаБруттоКг <> ИтогМассаПоОтправляемойТЧ Тогда 
		ТекстОшибки = "Масса Брутто в шапке документа отличается от итога по " + ТекстУточнения + "таб. части грузов";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"МассаБруттоКг", КатегорияОшибкиИтогов, ТекстОшибки, "Проверить");
	КонецЕсли;
	
	Если Объект.ПринятьЧастично Тогда 
		ТекстОшибки = "Частичная приемка. Подразумевается отказ от части доставленного груза.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ПринятьЧастично", КатегорияПредупреждение, ТекстОшибки, "Обратить внимание");
	КонецЕсли;
	
	Если Объект.ОтказВПриемке Тогда 
		ТекстОшибки = "Полный отказ в приемке.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ОтказВПриемке", КатегорияПредупреждение, ТекстОшибки, "Обратить внимание");
	КонецЕсли;
	
	// Провдение документа основания
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьСценарийГПравенПВ(Знач ДокументЭТРН, Знач КатегорияОшибка, Знач ТаблицаОшибок) Экспорт
	
	Перем НастроенноеПодразделениеОтпр, НастроенноеПодразделениеПолуч, ТекстОшибки;
	
	Если ЗначениеЗаполнено(ДокументЭТРН.Грузополучатель)
		И ЗначениеЗаполнено(ДокументЭТРН.Перевозчик)
		И ДокументЭТРН.Грузополучатель = ДокументЭТРН.Перевозчик Тогда 
		
		НастроенноеПодразделениеОтпр = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(
		ДокументЭТРН.Грузополучатель,
		Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеОтправительПутевогоЛиста);
		Если Не ЗначениеЗаполнено(НастроенноеПодразделениеОтпр) Тогда 
			ТекстОшибки = "У Грузополучателя не указано Подразделение-отправитель по умолчанию в настройках";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.Грузополучатель", КатегорияОшибка, ТекстОшибки, "Указать");
		КонецЕсли;
		
		НастроенноеПодразделениеПолуч = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(
		ДокументЭТРН.Перевозчик,
		Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеПолучательПутевогоЛиста);
		Если Не ЗначениеЗаполнено(НастроенноеПодразделениеПолуч) Тогда 
			ТекстОшибки = "У Перевозчик не указано Подразделение-получатель по умолчанию в настройках";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.Перевозчик", КатегорияОшибка, ТекстОшибки, "Указать");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НастроенноеПодразделениеОтпр) И ЗначениеЗаполнено(НастроенноеПодразделениеПолуч) 
			И НастроенноеПодразделениеОтпр = НастроенноеПодразделениеПолуч Тогда 
			ТекстОшибки = "У Грузополучателя Подразделение-отправитель по умолчанию в настройках совпадает с Подразделением-получателем";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.Грузополучатель", КатегорияОшибка, ТекстОшибки, "Указать");
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьИнфПол(Знач Объект, ТаблицаОшибок)
	
	МассивПроверок = Новый Массив;
	МассивПроверок.Добавить("ИнфПол");
	МассивПроверок.Добавить("ОтметкиИнфПол");
	
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьИнфПол(Объект, МассивПроверок, ТаблицаОшибок);	
	
КонецПроцедуры	

Процедура ПроверитьОтметки(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка 		= Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ИмяТЧ = "ОтметкиГрузополучателя";
	
	Для Каждого Отметка Из Объект.ОтметкиГрузополучателя Цикл 
		
		ТекущийНомерСтроки = Отметка.НомерСтроки;
		
		Если Не ЗначениеЗаполнено(Отметка.ДатаИВремяОтметки) Тогда
			
			ТекстОшибки = "Укажите Дату отметки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ДатаИВремяОтметки", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Отметка.ОписаниеОбстоятельств) Тогда
			
			ТекстОшибки = "Укажите Описание обстоятельств отметки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОписаниеОбстоятельств", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать описание обстоятельств");
			
		КонецЕсли;
		
		НайденныеШтрафы = Объект.Штрафы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", Отметка.ИдентификаторСтроки)); 
		Для Каждого Штраф Из НайденныеШтрафы Цикл 
			
			Если Не ЗначениеЗаполнено(Штраф.ИтогРазмШтрРФ) Тогда 
				
				ТекстОшибки = "Укажите Размер штрафа для Отметки №" + ТекущийНомерСтроки;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Штрафы", Штраф.НомерСтроки, 
					"ИтогРазмШтрРФ", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать размер штрафа");
				
			КонецЕсли;	
			
		КонецЦикла;
		
		НайденныеАкты = Объект.Акты.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", Отметка.ИдентификаторСтроки)); 
		Для Каждого Акт Из НайденныеАкты Цикл 
						
			Если Не ЗначениеЗаполнено(Акт.АктИдДок) 
				И Не ЗначениеЗаполнено(Акт.АктНаименование) 
				И Не ЗначениеЗаполнено(Акт.АктДата) 
				И Не ЗначениеЗаполнено(Акт.СтороныСоставители) 
				И Не ЗначениеЗаполнено(Акт.ДополнительныйСоставитель) Тогда 
				
				ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей Акта для Отметки №" + ТекущийНомерСтроки;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование акта");
								
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(Акт.АктИдДок) 
				И (ЗначениеЗаполнено(Акт.АктНаименование)
				Или ЗначениеЗаполнено(Акт.АктНомер) 
				Или ЗначениеЗаполнено(Акт.АктДата)
				Или ЗначениеЗаполнено(Акт.АктДопСведДок)
				Или ЗначениеЗаполнено(Акт.СтороныСоставители) 
				Или ЗначениеЗаполнено(Акт.ДополнительныйСоставитель)) Тогда	
					
				Если Не ЗначениеЗаполнено(Акт.АктНаименование) Тогда 
					
					ТекстОшибки = "Укажите Наименование акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование акта");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Акт.АктДата) Тогда 
					
					ТекстОшибки = "Укажите Дату акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктДата", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату акта");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Акт.СтороныСоставители) 
					И Не ЗначениеЗаполнено(Акт.ДополнительныйСоставитель) Тогда 
					
					ТекстОшибки = "Укажите Стороны составители или Доп.составителя акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"СтороныСоставители", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать стороны составители акта");
					
				КонецЕсли;
					
			КонецЕсли;
					
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры	

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ТрН_Титул3.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

Процедура ПроверитьТабЧастьТовары(Знач Объект, ТаблицаОшибок, ТекСтатусТитула, ЭтоОтправкаЧерновика)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ИмяТЧ = "Товары";
	
	ЭтоОбработкаВходящего = ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки;
	Если ЭтоОбработкаВходящего Или ЭтоОтправкаЧерновика Тогда
		КатегорияОшибка = КатегорияПредупреждение;
	КонецЕсли;
	
	Если Объект.РазбиватьГрузыПоСтрокам Тогда  // включена ли отправка табличной части?
		
		Если Не ЗначениеЗаполнено(Объект.Товары) 
			И Не ЗначениеЗаполнено(Объект.ТоварыСоответствиеСтрокТоваров)
			И Не Объект.ОтказВПриемке Тогда
			
			ТекстОшибки = "Добавьте груз в табличную часть ""Товары по данным отправителя"" ИЛИ ""Сопоставление товаров""";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"", КатегорияОшибка, ТекстОшибки, "Добавить груз");
			
		Иначе
			
			Для Каждого СтрокаТовара Из Объект.Товары Цикл
				
				Если Не СтрокаТовара.Учитывать Тогда 
					Продолжить;
				КонецЕсли;
				
				ТекущийНомерСтроки = СтрокаТовара.НомерСтроки;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТовара.ОтгрузочноеНаименование) Тогда
					ТекстОшибки = "Укажите Отгрузочное наименование";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
					"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать отгрузочное наименование");
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаТовара.СостояниеГруза) Тогда
					ТекстОшибки = "Укажите Состояние груза";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
					"СостояниеГруза", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать состояние груза");
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СопоставитьТоварыАвтоматическиПоДокументам(МассивДокументовСсылокТ3) Экспорт
	
	Для Каждого ДокументСсылка Из МассивДокументовСсылокТ3 Цикл
		
		// обойдем товары отправителя и им в соответствие поставим строки товаров получателя
		// Сейчас действуем по ключу - совпадение Номенклатуры
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.СопоставитьТоварыАвтоматически();
		ДокументОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли