#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	РазбиватьГрузыПоСтрокам = Истина;
	ПринятьЧастично 		= Ложь;
	ОтказВПриемке 			= Ложь;
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);

	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ТрН_Титул3_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// по документу уже есть Т7 и Т3?
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		
		НайденныйТ7 =  КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7, ДокументЭТРН);
		НайденныйТ3 =  КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3, ДокументЭТРН);
		
		ЭтоПриемВозврата = ЗначениеЗаполнено(НайденныйТ7) И ЗначениеЗаполнено(НайденныйТ3) И (Лев(ИдФайлИнфПрвПрием, 13) = "ON_TRNPEREADR");
		
	КонецЕсли;
	
	// Уведомления об отказе
	Если Не Отказ
		И (ОтказВПриемке Или ПринятьЧастично)
		И Не УведомлениеОбОтказеЧастичнойПриемкеОтправлено Тогда
		
		УведомлениеОбОтказеЧастичнойПриемкеОтправлено =
			КонтурЛогистика_Уведомления.ОтправитьУведомленияОбОтказеИлиЧастичнойПриемкеТрН(ЭтотОбъект);
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ТрН_Титул3_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДата();
	
КонецПроцедуры

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументЭТРН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлу(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументЭТРН) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти Документ ЭТРН, создание не выполнено");
		
	Иначе
		
		ДокументЭТРН = НайденныйДокументЭТРН;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		СодИнфГП 	= XDTO.Документ.СодИнфГП;
		ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
		
		ЗаполнитьТоварыИзXDTO(СодИнфГП);
		
		// по документу уже есть Т7 и Т3?
		НайденныйТ7 =  КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7, ДокументЭТРН);
		НайденныйТ3 =  КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3, ДокументЭТРН);
		
		ЭтоПриемВозврата = ЗначениеЗаполнено(НайденныйТ7) И ЗначениеЗаполнено(НайденныйТ3);
		
		Если ЗначениеЗаполнено(НайденныйТ7) Тогда 
			Если ЗначениеЗаполнено(НайденныйТ7.НовГрузПол) Тогда
				Грузополучатель = НайденныйТ7.НовГрузПол;
			Иначе
				Если ДокументЭТРН.МестоПогрузки = ДокументЭТРН.ВозвратМесто
					Или ДокументЭТРН.МестоПогрузки = ДокументЭТРН.ПереадресовкаИсходноеМестоДоставки Тогда
					Грузополучатель = ДокументЭТРН.Грузоотправитель;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Комментарий - нет в формате минтранса // TODO есть в Диадоке - научиться доставать из ДД 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	КС = КонтурЛогистика_КонструкторыXDTO;

	СодИнфГП 	= КС.XDTO_Вычислить(XDTO, "Документ.СодИнфГП");
	
	ДатИнфГП 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO, "Документ.ДатИнфГП"));
	ВрИнфГП 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(XDTO, "Документ.ВрИнфГП"));
	
	XDTO_ИдИнфПрвПрием		= КС.XDTO_Вычислить(XDTO, "Документ.ИдИнфПрвПрием");
	ИдФайлИнфПрвПрием			= КС.XDTO_Вычислить(XDTO_ИдИнфПрвПрием, "ИдФайлИнфПрвПрием");
	ДатФайлПрвПрием				= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO_ИдИнфПрвПрием, "ДатФайлПрвПрием"));
	ВрФайлПрвПрием				= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(XDTO_ИдИнфПрвПрием, "ВрФайлПрвПрием"));
	ЭППВ						= КС.XDTO_Вычислить(XDTO_ИдИнфПрвПрием, "ЭП");
	
	ПричОтк 					= КС.XDTO_Вычислить(СодИнфГП, "ПричОтк");
	Если ЗначениеЗаполнено(ПричОтк) Тогда 
		
		ОтказВПриемке = Истина;
		
	Иначе
		
		СодОпПр 				= КС.XDTO_Вычислить(СодИнфГП, "СодОпПр");
		Если СодОпПр = "Частичная выгрузка" Тогда 
			ПринятьЧастично = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПричОтк) Тогда 
		ОтказВПриемке = Истина;
	КонецЕсли;
	
	НомИспр						= КС.XDTO_Вычислить(СодИнфГП, "ИспрТрН.НомИспр");
	ДатаИспр					= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(СодИнфГП, "ИспрТрН.ДатаИспр"));
	
	// ПриемГрузГП - Сведения о приеме груза грузополучателем от перевозчика
	ЗаполнитьПриемГрузГП(СодИнфГП);
	
	// ОтметГП
	ЗаполнитьОтметкиГП(СодИнфГП); // втч Штрафы, Акты
	
	// ИнфПол общие у документа
	КонтурЛогистика_КонструкторыXDTO.ЗаполнитьИнфПолИзXDTO(СодИнфГП, ЭтотОбъект, "ИнфПол");
		
	// Подписант - для полученных титул3 не заполняем
	
КонецПроцедуры

Процедура ЗаполнитьПриемГрузГП(Знач СодИнфГП)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ПриемГрузГП = КС.XDTO_Вычислить(СодИнфГП, "ПриемГрузГП");
	
	Если ПриемГрузГП <> Неопределено Тогда 
		
		ЗаявДатВрПриб_raw	= КС.XDTO_Вычислить(ПриемГрузГП, "ЗаявДатВрПриб");
		ЗаявДатВрПриб		= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ЗаявДатВрПриб_raw);
		
		ФДатВрПриб_raw		= КС.XDTO_Вычислить(ПриемГрузГП, "ФДатВрПриб");
		ФДатВрПриб			= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ФДатВрПриб_raw);
		
		ФДатВрУбыт_raw			= КС.XDTO_Вычислить(ПриемГрузГП, "ФДатВрУбыт");
		ФДатВрУбыт				= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ФДатВрУбыт_raw);
		
		МетодОпределенияМассы_raw  	= КС.XDTO_Вычислить(ПриемГрузГП, "МетОпрМасс");
		МетодОпределенияМассы		= Перечисления.КонтурЛогистика_МетодыОпределенияМассы.ЗначениеИзXDTO(МетодОпределенияМассы_raw);
		
		КоличествоМестПринято       = КС.XDTO_ВычислитьЧисло(ПриемГрузГП, "КолМестПриемЧ");				
		
		ОбщееСостояние				= КС.XDTO_Вычислить(ПриемГрузГП, "ОбщСвСост");
		
		МассаБруттоКг             	= КС.XDTO_ВычислитьЧисло(ПриемГрузГП, "МасБрутЗначПрием");
		МассаНеттоКг             	= КС.XDTO_ВычислитьЧисло(ПриемГрузГП, "МасНетЗначПрием");
		Объем             			= КС.XDTO_ВычислитьЧисло(ПриемГрузГП, "Объем");
		
		МестоВыгрузки  				= КС.Конвертировать_АдресПользТип_вПунктМаршрутаЛогистика(КС.XDTO_Вычислить(ПриемГрузГП, "АдрВыгруз"));
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьОтметкиГП(Знач СодИнфГП)
	
	ОтметкиГрузополучателя.Очистить();
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	XDTO_ОтметГП				= КС.XDTO_ВычислитьМассивXDTO(КС.XDTO_Вычислить(СодИнфГП, "ОтметГП"));
	
	Для Каждого XDTO_ОтметкаГП Из XDTO_ОтметГП Цикл 
		
		НоваяСтрокаОтметкиГрузополучателя = ОтметкиГрузополучателя.Добавить();
		
		КС.ЗаполнитьСтрокуОтметкиИзXDTO(XDTO_ОтметкаГП, НоваяСтрокаОтметкиГрузополучателя, ЭтотОбъект);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТоварыИзXDTO(Знач СодИнфГП)
	
	Товары.Очистить();
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	СвПринПоНаим_Массив 					= КС.XDTO_ВычислитьМассивXDTO(КС.XDTO_Вычислить(СодИнфГП, "ПриемГрузГП.СвПринПоНаим"));
	
	Если СвПринПоНаим_Массив.Количество() > 0 Тогда 
		РазбиватьГрузыПоСтрокам = Истина;
	Иначе
		РазбиватьГрузыПоСтрокам = Ложь;
	КонецЕсли;
	
	Для Каждого СвПринПоНаим Из СвПринПоНаим_Массив Цикл 
		
		НоваяСтрокаТовара = Товары.Добавить();
		НоваяСтрокаТовара.Учитывать = Истина;
		НоваяСтрокаТовара.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		НоваяСтрокаТовара.ОтгрузочноеНаименование 	= КС.XDTO_Вычислить(СвПринПоНаим, "НаимГруз");
		НоваяСтрокаТовара.СостояниеГруза 			= КС.XDTO_Вычислить(СвПринПоНаим, "СостГруз");
		НоваяСтрокаТовара.Плотность 				= КС.XDTO_Вычислить(СвПринПоНаим, "Плотн");
		НоваяСтрокаТовара.ОбъемКубМ  				= КС.XDTO_Вычислить(СвПринПоНаим, "Объем");
		НоваяСтрокаТовара.КоличествоМест  			= КС.XDTO_Вычислить(СвПринПоНаим, "КолМест");
		НоваяСтрокаТовара.МассаБруттоКг  			= КС.XDTO_Вычислить(СвПринПоНаим, "МасГруз.МасБрутЗнач");
		НоваяСтрокаТовара.МассаНеттоКг  			= КС.XDTO_Вычислить(СвПринПоНаим, "МасГруз.МасНетЗнач");
		НоваяСтрокаТовара.КоличествоПаллет  		= КС.XDTO_Вычислить(СвПринПоНаим, "МасГруз.КолПалл");
	
		ЗаполнитьМаркировкиИзXDTO(НоваяСтрокаТовара, СвПринПоНаим);

	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьМаркировкиИзXDTO(Знач НоваяСтрокаТовара, Знач СвПринПоНаим)
	
	Перем МаркировкаЗначение, МассивМаркировок, НоваяСтрокаМаркировки, стрМаркировки_raw;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	стрМаркировки_Массив = КС.XDTO_ВычислитьМассивXDTO(КС.XDTO_Вычислить(СвПринПоНаим, "ПерМарк"));
	
	Для Каждого МаркировкаЗначение Из стрМаркировки_Массив Цикл
		
		НоваяСтрокаМаркировки = Маркировки.Добавить();
		НоваяСтрокаМаркировки.ИдентификаторСтрокиТоваров = НоваяСтрокаТовара.ИдентификаторСтроки;
		НоваяСтрокаМаркировки.ЗначениеМаркировки = МаркировкаЗначение;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			Если ЗначениеЗаполнено(Грузополучатель) Тогда 
				ОрганизацияПодписанта = Грузополучатель;
			Иначе
				ОрганизацияПодписанта = ДокументЭТРН.Грузополучатель;
			КонецЕсли;
			
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ОрганизацияПодписанта,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	Если ДанныеЗаполнения.Свойство("СпецСценарий") Тогда
		
		СпецСценарий = ДанныеЗаполнения.СпецСценарий;
		
	ИначеЕсли ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул7") Тогда
		
		СпецСценарий = Перечисления.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул3ПослеТитула7;
		
	Иначе
		
		СпецСценарий = Неопределено;
		
	КонецЕсли;
	
	НайденныйДокУчСист = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДокументУчетнойСистемыДляСледующегоТитула(ПредыдущийТитул, СпецСценарий);
	
	Если ЗначениеЗаполнено(НайденныйДокУчСист) Тогда 
		ДокументОснование = НайденныйДокУчСист;
	КонецЕсли;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		ДанныеЗаполнения.ТипЛогистика,, СпецСценарий);
	
	ДокументЭТРН = ПредыдущийТитул.ДокументЭТРН;
	
	//ДатИнфГП - определим в момент формирвоания файла
	//ВрИнфГП - определим в момент формирвоания файла
	
	ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
	
	
	МетодОпределенияМассы = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("МетодОпределенияМассы");
	
	// по документу уже есть Т7 и Т3?
		
	НайденныйТ7 =  КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7, ДокументЭТРН);
	НайденныйТ3 =  КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3, ДокументЭТРН);
		
	ЭтоПриемВозврата = ЗначениеЗаполнено(НайденныйТ7) И ЗначениеЗаполнено(НайденныйТ3);
	
	Маркировки.Очистить();
	ОтметкиГрузополучателя.Очистить();
	Акты.Очистить();
	Штрафы.Очистить();
	ИнфПол.Очистить();
	ОтметкиИнфПол.Очистить();
	
	// Ищем титул1 - оттуда нужны товары и некоторые итоговые реквизиты
	Титул1 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, ДокументЭТРН);
	
	ВТитуле1Товар1 	  = Титул1.Товары.Количество() = 1;
	// Это возвратный Т3 и в предыдущем Т3 товары построчно, либо свернуто, но в исходном Т1 одна строка
	ЗаполнитьСВычетом = ЭтоПриемВозврата И Не НайденныйТ3.ОтказВПриемке
						И (НайденныйТ3.РазбиватьГрузыПоСтрокам ИЛИ ВТитуле1Товар1);
						
	Если ЗначениеЗаполнено(Титул1) Тогда
		
		КоличествоМестПринято 	= Титул1.КоличествоМест;
		МассаБруттоКг 			= Титул1.МассаБруттоКг;
		МестоВыгрузки 			= Титул1.ДокументЭТРН.МестоДоставки;
					
		Товары.Очистить();
		Маркировки.Очистить();
		
		ТЗ_ТоварыВременная = НайденныйТ3.Товары.Выгрузить();
		
		Для Каждого СтрокаТовара Из Титул1.Товары Цикл
			
			Если Не ЗаполнитьСВычетом Тогда
				
				НоваяСтрокаТоваров = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров, СтрокаТовара);
				НоваяСтрокаТоваров.МассаБруттоКг = СтрокаТовара.МассаПлановаяБруттоКг;
				НоваяСтрокаТоваров.МассаНеттоКг = СтрокаТовара.МассаПлановаяНеттоКг;
			
			Иначе
				
				ЗаполнитьТоварСВычетом(ТЗ_ТоварыВременная, СтрокаТовара);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаМаркировки Из Титул1.Маркировки Цикл
			
			НоваяСтрокаМаркировки = Маркировки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаМаркировки, СтрокаМаркировки);
			
		КонецЦикла;
		
		// Сворачиваем товары
		ТЗ_ТоварыВременная = Товары.Выгрузить();
		Если КонтурЛогистика_ОбработкаДокументовСервер.НужноСворачиватьТовары(
				ТЗ_ТоварыВременная,
				ДокументЭТРН.ПартнерГрузоотправитель,
				НастройкаКонвертации.СворачиватьТабЧастьТовары) Тогда
				
			ТЗ_ТоварыВременная = КонтурЛогистика_КонвертацияСервер.СвернутьТовары(ТЗ_ТоварыВременная, ЭтотОбъект, НастройкаКонвертации);
			Товары.Загрузить(ТЗ_ТоварыВременная);
			
		КонецЕсли;
				
	КонецЕсли;
		                                                   	
	// Из Документа учетной системы
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		
		ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации);

	КонецЕсли;
	
	АвторасчетИтогов(НастройкаКонвертации);
	
	Если ЭтоПриемВозврата И (Не НайденныйТ3.РазбиватьГрузыПоСтрокам Или НайденныйТ3.Товары.Количество() = 0) Тогда
		
		РазбиватьГрузыПоСтрокам = Ложь;
			
		КоличествоМестПринято = Титул1.КоличествоМест - НайденныйТ3.КоличествоМестПринято;
		МассаБруттоКг = Титул1.МассаБруттоКг - НайденныйТ3.МассаБруттоКг;
								
	КонецЕсли;
	
	// Ищем титул7 - оттуда нужна новая плановая дата под выгрузку
	Если ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул7") Тогда 
		Титул7 = ПредыдущийТитул;
	Иначе	
		Титул7 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7, ДокументЭТРН);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Титул7) Тогда 
		ЗаявДатВрПриб = Титул7.ДатВрНовВыгрПА;
		МестоВыгрузки = Титул7.АдрВыгруз;
			
		Если ЗначениеЗаполнено(Титул7.НовГрузПол) Тогда  
			Грузополучатель = Титул7.НовГрузПол;
		Иначе
			Если ДокументЭТРН.МестоПогрузки = ДокументЭТРН.ВозвратМесто
				Или ДокументЭТРН.МестоПогрузки = ДокументЭТРН.ПереадресовкаИсходноеМестоДоставки Тогда
					Грузополучатель = ДокументЭТРН.Грузоотправитель;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ОтборПоНаименованиюСостоянию(СтрокаТовара)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОтгрузочноеНаименование", СтрокаТовара.ОтгрузочноеНаименование);
	Отбор.Вставить("СостояниеГруза",		  СтрокаТовара.СостояниеГруза);
	Отбор.Вставить("Учитывать",				  Истина);
	
	Возврат Отбор;
	
КонецФункции

Функция ОписаниеПринято()
	
	Принято = Новый Структура;
	Принято.Вставить("Количество",		 0);
	Принято.Вставить("КоличествоМест", 	 0);
	Принято.Вставить("МассаБруттоКг", 	 0);
	Принято.Вставить("МассаНеттоКг", 	 0);
	Принято.Вставить("КоличествоПаллет", 0);
	
	Возврат Принято;
	
КонецФункции

Процедура ЗаполнитьТоварСВычетом(ТЗ_ТоварыВременная, СтрокаТовараТ1)
		
	Отбор   = ОтборПоНаименованиюСостоянию(СтрокаТовараТ1);	
	Принято = ОписаниеПринято();
	
	НайденныеСтроки = ТЗ_ТоварыВременная.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(Принято, НайденныеСтроки[0]);
		ТЗ_ТоварыВременная.Удалить(НайденныеСтроки[0]);
	КонецЕсли;
	
	Если СтрокаТовараТ1.КоличествоМест > Принято.КоличествоМест Тогда
		
		НоваяСтрокаТоваров = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров, СтрокаТовараТ1);
		НоваяСтрокаТоваров.Количество	 	= СтрокаТовараТ1.Количество 		   - Принято.Количество;
		НоваяСтрокаТоваров.КоличествоМест	= СтрокаТовараТ1.КоличествоМест	  	   - Принято.КоличествоМест;
		НоваяСтрокаТоваров.МассаБруттоКг 	= СтрокаТовараТ1.МассаПлановаяБруттоКг - Принято.МассаБруттоКг;
		НоваяСтрокаТоваров.МассаНеттоКг  	= СтрокаТовараТ1.МассаПлановаяНеттоКг  - Принято.МассаНеттоКг;
		НоваяСтрокаТоваров.КоличествоПаллет = СтрокаТовараТ1.КоличествоПаллет      - Принято.КоличествоПаллет;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СконвертироватьСтрокуТоваровУчетнойСистемывЛогистика(НомерСтроки) Экспорт
	
	СтрокаТоваров = ТоварыДокументаУчетнойСистемы.Найти(НомерСтроки, "НомерСтроки");
	
	// сформировать расширенную (с упаковками) строку товаров
	ТЗ_ТоварыВременная = ТоварыДокументаУчетнойСистемы.ВыгрузитьКолонки(); 
	
	СтрокаТоваровВременная = ТЗ_ТоварыВременная.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТоваровВременная, СтрокаТоваров);
	
	КонтурЛогистика_КонвертацияСервер.КонвертироватьТовары1сВЛогистику(ТЗ_ТоварыВременная, ЭтотОбъект);
	
	// положить расширенную строку товаров обратно в ТоварыДокумента1С
	ЗаполнитьЗначенияСвойств(СтрокаТоваров, СтрокаТоваровВременная);
	
КонецПроцедуры

Процедура АвторасчетИтогов(НастройкаКонвертации = Неопределено) Экспорт
	
	Перем КоличествоМест, ОбъемКубМ;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т3АвтоитогКоличествоМест") Тогда
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т3ТоварыУчитыватьУчетныйДокумент") И ЗначениеЗаполнено(ДокументОснование) Тогда
			КоличествоМест = ТоварыСоответствиеСтрокТоваров.Итог("КоличествоМест");
		Иначе
			КоличествоМест = Товары.Итог("КоличествоМест");
		КонецЕсли;
		
		КоличествоМестПринято = КоличествоМест;
		
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т3АвтоитогМассаБрутто") Тогда 
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т3ТоварыУчитыватьУчетныйДокумент") И ЗначениеЗаполнено(ДокументОснование) Тогда
			МассаБруттоКг = ТоварыСоответствиеСтрокТоваров.Итог("МассаБруттоКг");
		Иначе
			МассаБруттоКг = Товары.Итог("МассаБруттоКг");
		КонецЕсли;
		
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т3АвтоитогМассаБрутто") Тогда 
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т3ТоварыУчитыватьУчетныйДокумент") И ЗначениеЗаполнено(ДокументОснование) Тогда
			МассаНеттоКг = ТоварыСоответствиеСтрокТоваров.Итог("МассаНеттоКг");
		Иначе
			МассаНеттоКг = Товары.Итог("МассаНеттоКг");
		КонецЕсли;
		
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т3АвтоитогОбъем") Тогда 
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т3ТоварыУчитыватьУчетныйДокумент") И ЗначениеЗаполнено(ДокументОснование) Тогда
			ОбъемКубМ = ТоварыСоответствиеСтрокТоваров.Итог("ОбъемКубМ");
		Иначе
			ОбъемКубМ = Товары.Итог("ОбъемКубМ");
		КонецЕсли;
		
		Объем = ОбъемКубМ;
		
	КонецЕсли;

	Если Не ЭтоПриемВозврата Тогда
		
		// авторасчет флажка частичной приемки
		НайденныйТ1 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, ЭтотОбъект.ДокументЭТРН);
		
		Если ЗначениеЗаполнено(НайденныйТ1) Тогда 
			
			Если КоличествоМестПринято < НайденныйТ1.КоличествоМест Тогда
				
				ПринятьЧастично = Истина;
				
			ИначеЕсли КоличествоМестПринято = 1 
				И НайденныйТ1.МассаБруттоКг <> 0 
				И МассаБруттоКг <> 0
				И МассаБруттоКг < НайденныйТ1.МассаБруттоКг Тогда
				
				ПринятьЧастично = Истина;
				
			ИначеЕсли КоличествоМестПринято = 1
				И Объем <> 0
				И НайденныйТ1.Товары.Итог("ОбъемКубМ") <> 0
				И Объем < НайденныйТ1.Товары.Итог("ОбъемКубМ") Тогда
				
				ПринятьЧастично = Истина;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда
				
				ПравилоКонвертацииПринятьЧастично = НастройкаКонвертации.ПравилаКонвертацииТитулаРеквизиты.Найти("ПринятьЧастично", "РеквизитТитула");
				Если ПравилоКонвертацииПринятьЧастично <> Неопределено И ПравилоКонвертацииПринятьЧастично.СпособМаппинга <> Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять Тогда
					
					Переменные = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьПеременные(ЭтотОбъект, ДокументОснование, НастройкаКонвертации, "");
					
					РезультатВычисления = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьРеквизитОснования(ДокументОснование, ПравилоКонвертацииПринятьЧастично, НастройкаКонвертации, ЭтотОбъект, Ложь, Переменные);
					Если РезультатВычисления.Успешно Тогда
						ПринятьЧастично = РезультатВычисления.Значение;	
					КонецЕсли;
										
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул) Экспорт
	
	ПервоначальнаВерсияТитула = ПредыдущийТитул;
	
	Если ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул2") Тогда 
	
		// ищем первую версию Титула 2 - но её теоретически можно найти без связанного файла - обработаем это
		НайденнаяПервоначальнаВерсияТ2 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПервоначальнуюВерсиюТ2(ПредыдущийТитул);
		Если НайденнаяПервоначальнаВерсияТ2 <> Неопределено Тогда
			
			ФайлТитула = Справочники.КонтурЛогистика_ФайлыОбмена.ПервыйНеошибочныйФайлДокумента(НайденнаяПервоначальнаВерсияТ2);
			Если ФайлТитула = Неопределено Тогда 
				ФайлТитула = Справочники.КонтурЛогистика_ФайлыОбмена.ПервыйНеошибочныйФайлДокумента(ПервоначальнаВерсияТитула);
			КонецЕсли;
			
		Иначе
			
			ФайлТитула = Справочники.КонтурЛогистика_ФайлыОбмена.ПервыйНеошибочныйФайлДокумента(ПервоначальнаВерсияТитула);
			
		КонецЕсли;
		
		Если ФайлТитула = Неопределено Тогда 
			ВызватьИсключение "Не найден файл обмена по версии титула: " + ПервоначальнаВерсияТитула;
		КонецЕсли;
		
		ДатФайлПрвПрием 	= ПервоначальнаВерсияТитула.ДатИнфПрвПрием;
		ВрФайлПрвПрием  	= ПервоначальнаВерсияТитула.ВрИнфПрвПрием;
		
	ИначеЕсли ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул7") Тогда 
		
		ФайлТитула = Справочники.КонтурЛогистика_ФайлыОбмена.ПервыйНеошибочныйФайлДокумента(ПредыдущийТитул);
		
		ДатФайлПрвПрием 	= ПервоначальнаВерсияТитула.ДатФайлПрвПрием;
		ВрФайлПрвПрием  	= ПервоначальнаВерсияТитула.ВрФайлПрвПрием;
		
	Иначе
		
		ВызватьИсключение "Для Титула 3 не поддерживается заполнение на основании предыдущего Титула: " + ПредыдущийТитул;
		
	КонецЕсли;	
	
	ИдФайлИнфПрвПрием 	= СтрЗаменить(ФайлТитула.ИмяФайла, ".xml", "");
	
	ДвоичныеДанныеПодписи 	= ФайлТитула.Подпись.Получить();
	ЭППВ 					= Base64Строка(ДвоичныеДанныеПодписи);
	
КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации) Экспорт

	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		//Заполнить ЭтотТитул
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда 
		ЗаполнитьТоварыПоУчетномуДокументу(НастройкаКонвертации);
	Иначе
		АвторасчетИтогов(НастройкаКонвертации);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьТоварыПоУчетномуДокументу(НастройкаКонвертации) Экспорт

	Если ЗначениеЗаполнено(ДокументОснование) Тогда 
		
		// заполнить ТоварыДокументаУчетнойСистемы
		
		//TODO отрефачить дублирвоание в модулях объектов Т1 и Т3 
		ТЗ_ТоварыВременная = ЗаполнитьТабЧастьТоварыПоДокументуУчетнойСистемы(НастройкаКонвертации);
	
		КонтурЛогистика_КонвертацияСервер.СгенерироватьИдентификаторыСтрок(ТЗ_ТоварыВременная);
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьИПрименятьБазовыеСоответствия") Тогда 
			КонтурЛогистика_КонвертацияСервер.КонвертироватьТовары1сВЛогистику(ТЗ_ТоварыВременная, ЭтотОбъект);
		КонецЕсли;
		
		ТоварыДокументаУчетнойСистемы.Загрузить(ТЗ_ТоварыВременная);
		
		СопоставитьТоварыАвтоматически();
		
		АвторасчетИтогов(НастройкаКонвертации);
		
	КонецЕсли;

КонецПроцедуры

Функция ЗаполнитьТабЧастьТоварыПоДокументуУчетнойСистемы(НастройкаКонвертации)
	
	ТоварыДокументаУчетнойСистемы.Очистить();
			
	ТЗ_ТоварыВременная = ТоварыДокументаУчетнойСистемы.Выгрузить(); 
	
	КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ЗаполнитьТабЧастьТоварыПоДокументуУчетнойСистемы(ТЗ_ТоварыВременная, НастройкаКонвертации, ЭтотОбъект);
	
	Возврат ТЗ_ТоварыВременная;
	
КонецФункции

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ТрН_Титул3.ПроверитьДокумент(Ссылка,,, ПараметрыФайлаРеквизиты);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	ДатИнфГП = ТекущаяДатаСеанса();
	ВрИнфГП = ТекущаяДатаСеанса();
	
	Попытка
		
		Если ПараметрыФайлаРеквизиты <> Неопределено
			И ТипЗнч(ПараметрыФайлаРеквизиты) = Тип("Структура")
			И (ПараметрыФайлаРеквизиты.Свойство("ПередатьНаПодписание")
				Или ПараметрыФайлаРеквизиты.Свойство("ПередатьНаСогласованиеВодителю")) Тогда
			
			ЗаполнятьПодписанта = Ложь;
		Иначе
			ЗаполнятьПодписанта = Истина;
		КонецЕсли;
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфГП, ВрИнфГП, ЗаполнятьПодписанта);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфГП и ВрИнфГП
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования, ЗаполнятьПодписанта)
	
	НомерТитула = 3;
	Формат = "5.01";
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	ДополнительныеПолучателиФайлаОбмена = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДопПолучателейФайла(ДокументЭТРН);
	
	Если ДополнительныеПолучателиФайлаОбмена.Количество() > 0 Тогда 
		W = 1;
	Иначе
		W = 0;
	КонецЕсли;
	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайлаОбмена); 	
	
	Если ЗначениеЗаполнено(Грузополучатель) Тогда 
		текГП = Грузополучатель;
	Иначе
		текГП = ДокументЭТРН.Грузополучатель;
	КонецЕсли;
	
	Если ДокументЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку И ЗначениеЗаполнено(ДокументЭТРН.ПогрузкуОсуществляет) Тогда 
		ИстинныйГрузоотправитель = ДокументЭТРН.ПогрузкуОсуществляет;
	Иначе
		ИстинныйГрузоотправитель = ДокументЭТРН.Грузоотправитель;
	КонецЕсли;
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаТРН(НомерТитула, 
												ИстинныйГрузоотправитель,
												ДокументЭТРН.Перевозчик,
												текГП,
												GUID,
												W);
												
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		текГП, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	Если ЗаполнятьПодписанта Тогда
		XDTO_Подписант = КС.XDTO_Подписант(НомерТитула, , Формат, ПодписантСтруктура);
	Иначе
		XDTO_Подписант = Неопределено;
	КонецЕсли;
	
	КС.XDTO_Подписант_СформироватьСведенияМЧД(НомерТитула, XDTO_Подписант, ПодписантСтруктура, Результат);
	
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, , Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	КС.XDTO_Установить(XDTO_Файл.Документ, "НаимЭконСубСост", текГП.НаименованиеОрганизацииПолное);
	
	XDTO_СодИнфГП = КС.XDTO_СодИнфГП(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодИнфГП", XDTO_СодИнфГП);
	
	XDTO_ИдИнфПрвПрием = КС.XDTO_ИдИнфПрвПрием(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфПрвПрием", XDTO_ИдИнфПрвПрием);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция СопоставитьТоварыАвтоматически() Экспорт
	
	ТоварыСоответствиеСтрокТоваров.Очистить();
	
	ТоварыДокументаУчетнойСистемыКопия = ТоварыДокументаУчетнойСистемы.Выгрузить();
	ТоварыДокументаУчетнойСистемыКопия.Колонки.Добавить("Распределено", Новый ОписаниеТипов("Число",
																		Новый КвалификаторыЧисла(0, 0, ДопустимыйЗнак.Неотрицательный)));
	Для Каждого СтрокаТоваровТ1 Из Товары Цикл
		
		Если СтрокаТоваровТ1.Учитывать = Ложь Тогда 
			Продолжить;
		КонецЕсли;
		
		
		// поиск
		ПодходящиеСтрокиПолучателя = НайтиПодходящиеСтрокиПолучателя(СтрокаТоваровТ1, ТоварыДокументаУчетнойСистемыКопия);
		
		// распределение // TODO - требуется реализовать "Ведущий" количественный показатель.
		
		Если ПодходящиеСтрокиПолучателя = Неопределено ИЛИ ПодходящиеСтрокиПолучателя.Количество() = 0 Тогда
			
			НоваяСтрокаРаспределения = ДобавитьСтрокуОтправителя(СтрокаТоваровТ1);
			
		Иначе
			
			ОстатокТекущейСтрокиТ1 = СтрокаТоваровТ1.КоличествоМест;
			
			Для Каждого ПодходящаяСтрока Из ПодходящиеСтрокиПолучателя Цикл 
				
				Если ПодходящаяСтрока.КоличествоМест <= ПодходящаяСтрока.Распределено Тогда 
					Продолжить; // в строке уч док больше нет доступного объема
				КонецЕсли;
				
				Если ОстатокТекущейСтрокиТ1 = 0 Тогда 
					Прервать;
				Иначе
					
					НоваяСтрокаРаспределения = ДобавитьСтрокуОтправителя(СтрокаТоваровТ1);
					
					Распределяем = Мин(ПодходящаяСтрока.КоличествоМест - ПодходящаяСтрока.Распределено, ОстатокТекущейСтрокиТ1);
					ПодходящаяСтрока.Распределено = ПодходящаяСтрока.Распределено + Распределяем;
					ОстатокТекущейСтрокиТ1 = ОстатокТекущейСтрокиТ1 - Распределяем;
					
					НоваяСтрокаРаспределения.КоличествоМест = Распределяем;
					НоваяСтрокаРаспределения.ИдентификаторСтрокиТоваровПолучателя = ПодходящаяСтрока.ИдентификаторСтроки;
					НоваяСтрокаРаспределения.НомерСтрокиПолучателя = ПодходящаяСтрока.НомерСтроки;
					
					Доля = Распределяем / НоваяСтрокаРаспределения.КоличествоМестОтправителя;
					
					Если Доля = 1 Тогда
						НоваяСтрокаРаспределения.ОбъемКубМ 			= ПодходящаяСтрока.ОбъемКубМ;
						НоваяСтрокаРаспределения.МассаБруттоКг 		= ПодходящаяСтрока.МассаБруттоКг;
						НоваяСтрокаРаспределения.МассаНеттоКг 		= ПодходящаяСтрока.МассаНеттоКг;
						НоваяСтрокаРаспределения.КоличествоПаллет 	= ПодходящаяСтрока.КоличествоПаллет;
					Иначе
						НоваяСтрокаРаспределения.ОбъемКубМ 			= НоваяСтрокаРаспределения.ОбъемКубМОтправителя * Доля;
						НоваяСтрокаРаспределения.МассаБруттоКг 		= НоваяСтрокаРаспределения.МассаБруттоКгОтправителя * Доля;
						НоваяСтрокаРаспределения.МассаНеттоКг 		= НоваяСтрокаРаспределения.МассаНеттоКгОтправителя * Доля;
						НоваяСтрокаРаспределения.КоличествоПаллет 	= НоваяСтрокаРаспределения.КоличествоПаллетОтправителя * Доля;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// теперь обойдем строкидокУчСист и если что-то недораспределено - положим отдельными строками
	
	Для Каждого СтрокаТоваровУчДок Из ТоварыДокументаУчетнойСистемыКопия Цикл 
		
		Если СтрокаТоваровУчДок.Распределено < СтрокаТоваровУчДок.КоличествоМест Тогда 
			
			НоваяСтрокаРаспределения = ТоварыСоответствиеСтрокТоваров.Добавить();
			НоваяСтрокаРаспределения.ИдентификаторСтрокиТоваровОтправителя = "";
			НоваяСтрокаРаспределения.НомерСтрокиОтправителя = 0;
			НоваяСтрокаРаспределения.ИдентификаторСтрокиТоваровПолучателя 	= СтрокаТоваровУчДок.ИдентификаторСтроки;
			НоваяСтрокаРаспределения.НомерСтрокиПолучателя 					= СтрокаТоваровУчДок.НомерСтроки;
			
			Распределяем = СтрокаТоваровУчДок.КоличествоМест - СтрокаТоваровУчДок.Распределено;
			НоваяСтрокаРаспределения.КоличествоМест = Распределяем;
			Доля = Распределяем / СтрокаТоваровУчДок.КоличествоМест;
			
			НоваяСтрокаРаспределения.ОбъемКубМ 			= СтрокаТоваровУчДок.ОбъемКубМ * Доля;
			НоваяСтрокаРаспределения.МассаБруттоКг 		= СтрокаТоваровУчДок.МассаБруттоКг * Доля;
			НоваяСтрокаРаспределения.МассаНеттоКг 		= СтрокаТоваровУчДок.МассаНеттоКг * Доля;
			НоваяСтрокаРаспределения.КоличествоПаллет 	= СтрокаТоваровУчДок.КоличествоПаллет * Доля;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ДобавитьСтрокуОтправителя(Знач СтрокаТоваровТ1)
	
	Перем НоваяСтрокаРаспределения;
	
	НоваяСтрокаРаспределения = ТоварыСоответствиеСтрокТоваров.Добавить();
	НоваяСтрокаРаспределения.ИдентификаторСтрокиТоваровОтправителя = СтрокаТоваровТ1.ИдентификаторСтроки;
	НоваяСтрокаРаспределения.НомерСтрокиОтправителя = СтрокаТоваровТ1.НомерСтроки;
	НоваяСтрокаРаспределения.ОбъемКубМОтправителя = СтрокаТоваровТ1.ОбъемКубМ;
	НоваяСтрокаРаспределения.КоличествоМестОтправителя = СтрокаТоваровТ1.КоличествоМест;
	НоваяСтрокаРаспределения.МассаБруттоКгОтправителя = СтрокаТоваровТ1.МассаБруттоКг;
	НоваяСтрокаРаспределения.МассаНеттоКгОтправителя = СтрокаТоваровТ1.МассаНеттоКг;
	НоваяСтрокаРаспределения.КоличествоПаллетОтправителя = СтрокаТоваровТ1.КоличествоПаллет;
	Возврат НоваяСтрокаРаспределения;

КонецФункции

Функция НайтиПодходящиеСтрокиПолучателя(Знач СтрокаТоваровТ1, Знач ТоварыДокументаУчетнойСистемы)
	
	Перем ПодходящиеСтрокиПолучателя, СтруктураПоискаПоТоварамПолучателя;
	
	СпособСопоставления = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т3СпособСопоставленияТоваров", ДокументЭТРН.ПартнерГрузоотправитель);
	// В будущем, при усложнении сценария, СпособСопоставления может стать реквизитом ОрганизацииДиадок
	// также в будущем при появлении входящих соответствий товаров, роль номенклатуры будет расти - входящие соответствия позволят четче сравнивать по номенклатуре
	ОчередностьПоиска = Перечисления.КонтурЛогистика_СпособыСопоставленияТоваровТитул3.ОчередностьПоиска(СпособСопоставления);
	
	Для Каждого ОчередьПоиска Из ОчередностьПоиска Цикл
		
		Если ОчередьПоиска = "Номенклатура" Тогда
			
			СтруктураПоискаПоТоварамПолучателя = Новый Структура;
			СтруктураПоискаПоТоварамПолучателя.Вставить("Номенклатура", 			СтрокаТоваровТ1.Номенклатура);
			СтруктураПоискаПоТоварамПолучателя.Вставить("УпаковкаЕдиницаИзмерения",	СтрокаТоваровТ1.УпаковкаЕдиницаИзмерения);
			
			ПодходящиеСтрокиПолучателя = ТоварыДокументаУчетнойСистемы.НайтиСтроки(СтруктураПоискаПоТоварамПолучателя);
			
			Если ПодходящиеСтрокиПолучателя.Количество() > 0 Тогда 
				Возврат ПодходящиеСтрокиПолучателя;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОчередьПоиска = "Наименование" Тогда
			
			СтруктураПоискаПоТоварамПолучателя = Новый Структура;
			СтруктураПоискаПоТоварамПолучателя.Вставить("ОтгрузочноеНаименование",	СтрокаТоваровТ1.ОтгрузочноеНаименование);
			
			ПодходящиеСтрокиПолучателя = ТоварыДокументаУчетнойСистемы.НайтиСтроки(СтруктураПоискаПоТоварамПолучателя);
			
			Если ПодходящиеСтрокиПолучателя.Количество() > 0 Тогда 
				Возврат ПодходящиеСтрокиПолучателя;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОчередьПоиска = "Маркировка" Тогда
			
			СтрокиМаркировкиОтправителя = Маркировки.НайтиСтроки(Новый Структура("ИдентификаторСтрокиТоваров", СтрокаТоваровТ1.ИдентификаторСтроки));
			
			Для Каждого СтрокаМаркировкиОтправителя Из СтрокиМаркировкиОтправителя Цикл
				
				Если СокрЛП(СтрокаМаркировкиОтправителя.ЗначениеМаркировки) <> "" 
					И СтрокаМаркировкиОтправителя.ЗначениеМаркировки <> "Отсутствует" Тогда 
					
					СтруктураПоискаПоТоварамПолучателя = Новый Структура;
					СтруктураПоискаПоТоварамПолучателя.Вставить("Маркировка",		СтрокаМаркировкиОтправителя.ЗначениеМаркировки);
					
					ПодходящиеСтрокиПолучателя = ТоварыДокументаУчетнойСистемы.НайтиСтроки(СтруктураПоискаПоТоварамПолучателя);
					
					Если ПодходящиеСтрокиПолучателя.Количество() > 0 Тогда 
						Возврат ПодходящиеСтрокиПолучателя;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПодходящиеСтрокиПолучателя;
	
КонецФункции

#КонецЕсли