#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим пустые строки из ОстаткиТоплива
	УдалитьПустыеСтрокиИзТаблицТоплива();
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ПЛ_Титул3_5_02_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		КонтурЛогистика_ОбработкаДокументовСервер.ДополнитьДополнительныхПолучателейИзГлавногоДокумента(ЭтотОбъект, Титул1);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);

	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ПЛ_Титул3_5_02_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти

#Область ЗаполнитьИзФайлаОбмена

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументТ1 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлуПЛ(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументТ1) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти исходный документ Титул1 путевого листа, создание не выполнено");
		
	Иначе
		
		Титул1 = НайденныйДокументТ1;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ = КС.XDTO_Вычислить(XDTO, "Документ");
	СодИнфВыпуск = КС.XDTO_Вычислить(XDTO, "Документ.СодИнфВыпуск");
	
	ДатИнфВыпуск 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатИнфВыпуск"));
	ВрИнфВыпуск 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрИнфВыпуск"));
		
	ДатФайлИнфСоб 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфСоб.ДатФайлИнфСоб"));
	ВрФайлИнфСоб 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфСоб.ВрФайлИнфСоб"));
	ИдФайлИнфСоб 	= КС.XDTO_Вычислить(Документ, "ИдИнфСоб.ИдФайлИнфСоб");
	ЭПСоб 			= КС.XDTO_Вычислить(Документ, "ИдИнфСоб.ЭП");
	
	ДатВрКонтТехСост_raw = КС.XDTO_Вычислить(СодИнфВыпуск, "ДатВрКонтТехСост");
	ДатВрКонтТехСост = КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДатВрКонтТехСост_raw);
	
	ДатВрВыпНаЛин_raw = КС.XDTO_Вычислить(СодИнфВыпуск, "ДатВрВыпНаЛин");
	ДатВрВыпНаЛин = КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДатВрВыпНаЛин_raw);
	
	ОтметКонтТехСост = КС.XDTO_Вычислить(СодИнфВыпуск, "СвКонтТехСост");
	Если ОтметКонтТехСост = "2" Тогда	// выпуск на линию не разрешен
		ЕстьОтказВПодписи = Истина;
	КонецЕсли;
		
	ТипПодпис_raw = КС.XDTO_Вычислить(Документ, "ПодпИнфВыпуск.ТипПодпис");
	ТипПодпис = Перечисления.КонтурЛогистика_ТипыПодписи.ЗначениеИзXDTO(ТипПодпис_raw);
	
	Фамилия = КС.XDTO_Вычислить(Документ, "ПодпИнфВыпуск.ФИО.Фамилия");
	Имя = КС.XDTO_Вычислить(Документ, "ПодпИнфВыпуск.ФИО.Имя");
	Отчество = КС.XDTO_Вычислить(Документ, "ПодпИнфВыпуск.ФИО.Отчество");
	
	ДопСведенияОПодписанте = КС.XDTO_Вычислить(Документ, "ПодпИнфВыпуск.ДопСведПодп");
	
	СвОтвЛиц_XDTO = КС.XDTO_Вычислить(СодИнфВыпуск, "СвОтвЛиц");
	Если СвОтвЛиц_XDTO <> Неопределено Тогда
		ТехРаботник = КС.Конвертировать_СведОтвЛицоТип_вСотрудникаЛогистика(СвОтвЛиц_XDTO);
	КонецЕсли;
	
	СвТСВыпуск = КС.XDTO_Вычислить(СодИнфВыпуск, "СвТСВыпуск");
	
	Если СвТСВыпуск <> Неопределено Тогда
	
		ДтВрНачРабГрф_raw = КС.XDTO_Вычислить(СвТСВыпуск, "ДтВрНачРабГрф");
		ДтВрНачРабГрф = КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДтВрНачРабГрф_raw);
		
		ДтВрКонРабГрф_raw = КС.XDTO_Вычислить(СвТСВыпуск, "ДтВрКонРабГрф");
		ДтВрКонРабГрф = КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДтВрКонРабГрф_raw);
		
		ПоказанияОдометра = КС.XDTO_Вычислить(СвТСВыпуск, "ОдомВыпуск");
		
		// Остатки топлива
		КС.Конвертировать_ТоплТип_вТЧТопливоЛогистика(СвТСВыпуск, "СвТоплВыезд", ЭтотОбъект, "ОстаткиТоплива");
				
		// ИнфПол
		КС.ЗаполнитьИнфПолИзXDTOсИдФайл(СвТСВыпуск, ЭтотОбъект, "ИнфПол");
		
	КонецЕсли;
		
	КС.ЗаполнитьДополнительныхПолучателей(XDTO, ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти

#Область ЗаполнитьПоПредыдущемуТитулу

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	Если ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1_5_02") Тогда 
		Титул1 	= ПредыдущийТитул;
	Иначе
		Титул1 	= ПредыдущийТитул.Титул1;
	КонецЕсли;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02);
	
	// поиск документа учетной системы
	Если ЗначениеЗаполнено(НастройкаКонвертации.ТипДокумента1С) Тогда
		
		НайденныйДокУчСист = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДокументУчетнойСистемыПоТипуЛогистика(
			Титул1, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02);
		
		Если ЗначениеЗаполнено(НайденныйДокУчСист) Тогда
			ДокументОснование = НайденныйДокУчСист;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатВрКонтТехСост) Тогда
		ДатВрКонтТехСост = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатВрВыпНаЛин) Тогда
		ДатВрВыпНаЛин = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ПроверкаЗаполнения") Тогда
		ЭПСоб = "<для проверки заполнения>";
	Иначе
		ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации);
	КонецЕсли;
	
	// Данные из рабочего места
	Если ДанныеЗаполнения.Свойство("ТехРаботник") И ЗначениеЗаполнено(ДанныеЗаполнения.ТехРаботник) Тогда
		ТехРаботник = ДанныеЗаполнения.ТехРаботник;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("Должность") И ЗначениеЗаполнено(ДанныеЗаполнения.Должность) Тогда
		Должность = ДанныеЗаполнения.Должность;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ДатВрКонтТехСост") И ЗначениеЗаполнено(ДанныеЗаполнения.ДатВрКонтТехСост) Тогда
		ДатВрКонтТехСост = ДанныеЗаполнения.ДатВрКонтТехСост;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ДатВрВыпНаЛин") И ЗначениеЗаполнено(ДанныеЗаполнения.ДатВрВыпНаЛин) Тогда
		ДатВрВыпНаЛин = ДанныеЗаполнения.ДатВрВыпНаЛин;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ПоказанияОдометра") И ЗначениеЗаполнено(ДанныеЗаполнения.ПоказанияОдометра) Тогда
		ПоказанияОдометра = ДанныеЗаполнения.ПоказанияОдометра;
	КонецЕсли;
	
	// Данные сквозного сценария (из титула 1)
	Если Титул1.ФормироватьТ3Сразу Тогда
		ТехРаботник = Титул1.ДанныеТ3ТехРаботник;
		Должность = Титул1.ДанныеТ3Должность;
		ДатВрКонтТехСост = Титул1.ДанныеТ3ДатВрКонтТехСост;
		ДатВрВыпНаЛин = Титул1.ДанныеТ3ДатВрВыпНаЛин;
		ПоказанияОдометра = Титул1.ДанныеТ3ПоказанияОдометра;
		ПользовательПодписант = Титул1.ДанныеТ3ПользовательПодписант;
		ПараметрНастроекПодписания = Титул1.ДанныеТ3ПараметрНастроекПодписания;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул) Экспорт
	
	Перем ДвоичныеДанныеПодписи, ФайлТитула1;
	
	Если ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1_5_02") Тогда 
		ДокТ1 = ПредыдущийТитул;
	Иначе
		ДокТ1 = ПредыдущийТитул.Титул1;
	КонецЕсли;
	
	ФайлТитула1 = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ДокТ1);
	
	Если Не ЗначениеЗаполнено(ФайлТитула1) Тогда 
		ВызватьИсключение "Не найден файл обмена Титулом 1 Путевого листа - невозможно создать Титул 3: " + ПредыдущийТитул;
	КонецЕсли;
	
	ИдФайлИнфСоб 	= СтрЗаменить(ФайлТитула1.ИмяФайла, ".xml", "");
	ДатФайлИнфСоб 	= ДокТ1.ДатИнфСоб;
	ВрФайлИнфСоб  	= ДокТ1.ВрИнфСоб;
	
	ДвоичныеДанныеПодписи 	= ФайлТитула1.Подпись.Получить();
	ЭПСоб 					= Base64Строка(ДвоичныеДанныеПодписи);

КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации) Экспорт

	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		//Заполнить ЭтотТитул
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ГенерацияXML

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ПЛ_Титул3_5_02.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ДатИнфВыпуск = ТекущаяДатаСеанса();
		ВрИнфВыпуск = ТекущаяДатаСеанса();
		
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфВыпуск, ВрИнфВыпуск);
		
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфТехСост и ВрИнфТехСост
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 3;
	Формат = "5.02";
	ТипДокументооборота = "__PL";
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула, Формат, ТипДокументооборота);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	Если ДополнительныеПолучателиФайла.Количество() > 0 Тогда 
		W = 1;
	Иначе
		W = 0;
	КонецЕсли;
	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайла); 	
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаПЛ_5_02(НомерТитула, 
												Титул1.ЛицоОформившееПЛ,
												Титул1.ОрганизацияМедик,
												GUID,
												W); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
												
	ОрганизацияПодписанта = Титул1.ЛицоОформившееПЛ;
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ОрганизацияПодписанта, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_ПодпИнф(НомерТитула, ТипДокументооборота, Формат, ПодписантСтруктура);
	Если ЗначениеЗаполнено(ПодписантСтруктура.МЧД) И ПодписантСтруктура.СпосПодтПолном = "3" Тогда 
		Результат.Вставить("ИдентификаторМЧД",	ПодписантСтруктура.МЧД);
	КонецЕсли;
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, ТипДокументооборота, Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
		
	XDTO_ИдИнфСоб 		= КС.XDTO_ПЛ_ИдИнфСоб(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфСоб", XDTO_ИдИнфСоб);
	
	XDTO_СодИнфВыпуск = КС.XDTO_ПЛ_СодИнфВыпуск(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодИнфВыпуск", XDTO_СодИнфВыпуск);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ОрганизацияПодписанта = Титул1.ЛицоОформившееПЛ;
			
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ОрганизацияПодписанта,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
				
	Исключение
		
		КонтурЛогистика_Метрика.Метрика_Отправить_Предупреждение("КонтурЛогистика_ЗаполнитьРеквизитыПоПользователю", 
			"ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьПустыеСтрокиИзТаблицТоплива()
	
	НаименованияСтолбцов = Новый Структура("Топливо, КоличествоТоплива, КоличествоЧасовРаботыСВключеннымОтопителем, КоличествоЧасовРаботыОборудования",
		Справочники.КонтурЛогистика_ГорючеСмазочныеМатериалы.ПустаяСсылка(), 0, 0, 0);  
		
	ПустыеСтроки = ОстаткиТоплива.НайтиСтроки(НаименованияСтолбцов);  
	Для Каждого Строка Из ПустыеСтроки Цикл  
		ОстаткиТоплива.Удалить(Строка);  
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти

#КонецЕсли