
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИндексПрямойОбмен = ПолучитьИндексПоВидуОбмена(Параметры.ПрямойОбмен);
	ЗаполняемыеСвойства = "БумажнаяДоверенностьДата, БумажнаяДоверенностьНомер, Доверенность, ЕстьБумажнаяДоверенность";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ЗаполняемыеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
    ПрямойОбмен = ПолучитьВидОбменаПоИндексу(ИндексПрямойОбмен);
	
	Структура = Новый Структура;
	Структура.Вставить("БумажнаяДоверенностьДата", БумажнаяДоверенностьДата);
	Структура.Вставить("БумажнаяДоверенностьНомер", БумажнаяДоверенностьНомер);
	Структура.Вставить("Доверенность", Доверенность);
	Структура.Вставить("ПрямойОбмен", ПрямойОбмен);
	Структура.Вставить("ЕстьБумажнаяДоверенность", ЕстьБумажнаяДоверенность);
	
	ОповеститьОВыборе(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьВидОбменаПоИндексу(Индекс)

	Если Индекс = 1 Тогда
		ПрямойОбмен = Истина;
		
	ИначеЕсли Индекс = 0 Тогда
		ПрямойОбмен = Ложь;
		
	КонецЕсли;

	Возврат ПрямойОбмен;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИндексПоВидуОбмена(ПрямойОбмен)

	Если ПрямойОбмен Тогда
		Индекс = 1;
	Иначе		
		Индекс = 0;
	КонецЕсли;

	Возврат Индекс;
	
КонецФункции

#КонецОбласти