// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования)
		Или Не ЗначениеЗаполнено(Запись.УникальныйИдентификатор) Тогда
		Запись.УникальныйИдентификатор = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	УстановитьЗначениеКодОграниченияПоТипуОбъектаСопоставления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСопоставленияПриИзменении(Элемент)
	УстановитьЗначениеКодОграниченияПоТипуОбъектаСопоставления();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОграниченияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораОграничения();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОграниченияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеЗначенияОграниченияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.КодОграничения) Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("КодОграничения", Запись.КодОграничения);
		ПараметрыОткрытия.Вставить("ИмяЭлемента", Элемент.Имя);
		ПараметрыОткрытия.Вставить("ОтмеченныеЭлементы", Новый Массив);
		ПараметрыОткрытия.Вставить("ДоступнаОтметкаНесколькихЗначений", Ложь);
		
		ОткрытьФормуВыбораЗначенияОграничения(ПараметрыОткрытия); 
		
	Иначе 
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбрано ограничение'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеЗначенияОграниченияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеЗначенияОграниченияПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Запись.НаименованиеЗначенияОграничения) Тогда
		Запись.КодЗначенияОграничения = "";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗначениеКодОграниченияПоТипуОбъектаСопоставления();
	
	ОбъектСопоставления = Запись.ОбъектСопоставления;
	
	КлассификаторОграничений = РегистрыСведений.КлассификаторыОграниченийМЧД.КлассификаторОграничений();
	
	Если ЗначениеЗаполнено(ОбъектСопоставления) Тогда 
		
		Элементы.НаименованиеОграничения.ТолькоПросмотр = Истина;
		
		Если ТипЗнч(ОбъектСопоставления) = Тип("СправочникСсылка.ВидыДокументовЭДО") Тогда
			
			Ограничение = 
				КлассификаторОграничений.Найти(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипДокумента(), 
				"Код");
				
			Если Ограничение <> Неопределено Тогда
				Запись.КодОграничения = Ограничение.Код;
				Запись.НаименованиеОграничения = Ограничение.Наименование;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораОграничения() 
	
	ОткрытьФорму("РегистрСведений.КлассификаторыОграниченийМЧД.Форма.ВыборОграниченияПолномочий",, 
		ЭтотОбъект,,,, Новый ОписаниеОповещения("ПослеВыбораОграничения", ЭтотОбъект),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОграничения(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда 
		
		Если Запись.КодОграничения <> Результат.Код Тогда
			
			Модифицированность = Истина;
			Запись.КодОграничения = Результат.Код;
			Запись.НаименованиеОграничения = Результат.Наименование;
			Запись.КодЗначенияОграничения = "";
			Запись.НаименованиеЗначенияОграничения = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораЗначенияОграничения(ПараметрыОткрытия)

	ОткрытьФорму("РегистрСведений.КлассификаторыОграниченийМЧД.Форма.ВыборЗначенияОграниченияПолномочия",
		ПараметрыОткрытия, ЭтотОбъект,,,, 
			Новый ОписаниеОповещения("ПослеВыбораЗначенияОграничений", ЭтотОбъект, ПараметрыОткрытия),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗначенияОграничений(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		
		Если Результат.Количество() = 1 Тогда
			
		ВыбранноеЗначение = Результат[0];
			
		Если Запись.КодОграничения <> ВыбранноеЗначение.Код Тогда
			
			Модифицированность = Истина;
			Запись.КодЗначенияОграничения = ВыбранноеЗначение.Код;
			Запись.НаименованиеЗначенияОграничения = ВыбранноеЗначение.Наименование;
			
		КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
