
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоУказанным(Команда)
	ТекстВопроса = СтрШаблон(НСтр("ru = 'По данным первичных движений будут перезаполнены регистры: %1
	|
	|Задания к переотражению в БУ, МФУ, НДС и к закрытию месяца созданы не будут. Продолжить?'"),
		ИменаРегистров());
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоУказаннымЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУказаннымЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьСообщения();
		Сообщить(НСтр("ru = 'Начало операции:'") + " " + ТекущаяДата());
		ЗаполнитьПоУказаннымНаСервере();
		Сообщить(НСтр("ru = 'Операция выполнена успешно:'") + " " + ТекущаяДата());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьСообщения();
	Сообщить(НСтр("ru = 'Начало операции:'") + " " + ТекущаяДата());
	ОчиститьНаСервере();
	Сообщить(НСтр("ru = 'Операция выполнена успешно:'") + " " + ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсё(Команда)
	ТекстВопроса = СтрШаблон(НСтр("ru = 'По данным первичных движений будут перезаполнены регистры: %1
	|
	|Задания к переотражению в БУ, МФУ, НДС и к закрытию месяца созданы не будут. Продолжить?'"),
		ИменаРегистров());
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьВсёЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсёЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьСообщения();
		Сообщить(НСтр("ru = 'Начало операции:'") + " " + ТекущаяДата());
		ЗаполнитьВсёСервер();
		Сообщить(НСтр("ru = 'Операция выполнена успешно:'") + " " + ТекущаяДата());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановые(Команда)
	ТекстВопроса = СтрШаблон(НСтр("ru = 'По данным первичных движений будут перезаполнены регистры: %1
	|
	|Продолжить?'"),
		ИменаРегистров(Истина));
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПлановыеЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановыеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПлановыеНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АналитикаРасчетовПоСрокамДляПересчета(Команда)
	
	ОткрытьФорму("Обработка.ЗаполнениеРегистровВзаиморасчетов.Форма.ФормаАналитикаДляПересчета");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоУказаннымНаСервере(Порядок = "")
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам",КлючАналитикиУчетаПоПартнерам);
	Запрос.УстановитьПараметр("ОбъектРасчетов",ОбъектРасчетов);
	Запрос.УстановитьПараметр("ДатаНачалаПересчета",ДатаНачалаПересчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Расчеты.Валюта         КАК Валюта,
	|	&ДатаНачалаПересчета   КАК ДатаНачалаПересчета,
	|	ДАТАВРЕМЯ(3999,1,1)    КАК ПериодКонтроляИзмененийИСозданияЗаданий
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	ИСТИНА
	|	И Расчеты.ОбъектРасчетов = &ОбъектРасчетов
	|	И Расчеты.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Расчеты.Валюта         КАК Валюта,
	|	&ДатаНачалаПересчета   КАК ДатаНачалаПересчета,
	|	ДАТАВРЕМЯ(3999,1,1)    КАК ПериодКонтроляИзмененийИСозданияЗаданий
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	ИСТИНА
	|	И Расчеты.ОбъектРасчетов = &ОбъектРасчетов
	|	И Расчеты.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Расчеты.Валюта         КАК Валюта,
	|	&ДатаНачалаПересчета   КАК ДатаНачалаПересчета,
	|	ДАТАВРЕМЯ(3999,1,1)    КАК ПериодКонтроляИзмененийИСозданияЗаданий
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|ГДЕ
	|	ИСТИНА
	|	И Расчеты.ОбъектРасчетов = &ОбъектРасчетов
	|	И Расчеты.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Расчеты.Валюта         КАК Валюта,
	|	&ДатаНачалаПересчета   КАК ДатаНачалаПересчета,
	|	ДАТАВРЕМЯ(3999,1,1)    КАК ПериодКонтроляИзмененийИСозданияЗаданий
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
	|ГДЕ
	|	ИСТИНА
	|	И Расчеты.ОбъектРасчетов = &ОбъектРасчетов
	|	И Расчеты.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам";
	
	Если НЕ ЗначениеЗаполнено(ОбъектРасчетов) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Расчеты.ОбъектРасчетов = &ОбъектРасчетов","ИСТИНА");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КлючАналитикиУчетаПоПартнерам) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Расчеты.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам","ИСТИНА");
	КонецЕсли;
	
	ТаблицаОбъектов = Запрос.Выполнить().Выгрузить();
		
	Если Не ЗначениеЗаполнено(ДатаНачалаПересчета) Тогда
		ВзаиморасчетыСлужебный.ОчиститьРегистрыВзаиморасчетовИУдалитьСлужебныеРегистраторы(
			?(ЗначениеЗаполнено(ОбъектРасчетов), ОбъектРасчетов, Неопределено),
			?(ЗначениеЗаполнено(КлючАналитикиУчетаПоПартнерам),КлючАналитикиУчетаПоПартнерам, Неопределено));
	КонецЕсли;
	
	ОсновныеПараметры = ОперативныеВзаиморасчетыСервер.ПараметрыРаспределенияРасчетов();
	ОсновныеПараметры.ДополнитьРаспределитьПриемники = Истина;
	
	Для Каждого СтрокаТаблицы Из ТаблицаОбъектов Цикл
		
		Если СтрокаТаблицы.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
			
			//Принудительная очистка регистров по срокам
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Регистр.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Регистр
			|ГДЕ
			|	Регистр.Регистратор ССЫЛКА Документ.КорректировкаРегистров
			|	И ВЫРАЗИТЬ(Регистр.Регистратор КАК Документ.КорректировкаРегистров).Операция <> ЗНАЧЕНИЕ(Перечисление.ОперацииКорректировкиРегистров.РучнаяКорректировка)
			|	И Регистр.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
			|	И Регистр.ОбъектРасчетов = &ОбъектРасчетов
			|";
			Запрос.УстановитьПараметр("ОбъектРасчетов",ОбъектРасчетов);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ДокументОбъект = Выборка.Регистратор.ПолучитьОбъект();
				ДвиженияРасчетыСКлиентами = ДокументОбъект.Движения.РасчетыСКлиентамиПоСрокам;
				ДвиженияРасчетыСКлиентами.Прочитать();
				ИндексСтроки = 0;
				Пока ИндексСтроки < ДвиженияРасчетыСКлиентами.Количество() Цикл
					Если ДвиженияРасчетыСКлиентами[ИндексСтроки].АналитикаУчетаПоПартнерам = КлючАналитикиУчетаПоПартнерам
						И ДвиженияРасчетыСКлиентами[ИндексСтроки].ОбъектРасчетов = ОбъектРасчетов Тогда
						ДвиженияРасчетыСКлиентами.Удалить(ИндексСтроки);
					Иначе
						ИндексСтроки = ИндексСтроки + 1;
					КонецЕсли;
				КонецЦикла;
				ДвиженияРасчетыСКлиентами.Записать();
			КонецЦикла;
			
		Иначе
			
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Регистр.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Регистр
			|ГДЕ
			|	Регистр.Регистратор ССЫЛКА Документ.КорректировкаРегистров
			|	И ВЫРАЗИТЬ(Регистр.Регистратор КАК Документ.КорректировкаРегистров).Операция <> ЗНАЧЕНИЕ(Перечисление.ОперацииКорректировкиРегистров.РучнаяКорректировка)
			|	И Регистр.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
			|	И Регистр.ОбъектРасчетов = &ОбъектРасчетов
			|";
			Запрос.УстановитьПараметр("ОбъектРасчетов",ОбъектРасчетов);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ДокументОбъект = Выборка.Регистратор.ПолучитьОбъект();
				
				ДвиженияРасчетыСПоставщиками = ДокументОбъект.Движения.РасчетыСПоставщикамиПоСрокам;
				ДвиженияРасчетыСПоставщиками.Прочитать();
				сч = 0;
				Пока сч < ДвиженияРасчетыСПоставщиками.Количество() Цикл
					Если ДвиженияРасчетыСПоставщиками[сч].АналитикаУчетаПоПартнерам = КлючАналитикиУчетаПоПартнерам
						И ДвиженияРасчетыСПоставщиками[сч].ОбъектРасчетов = ОбъектРасчетов Тогда
						ДвиженияРасчетыСПоставщиками.Удалить(сч);
					Иначе
						сч = сч + 1;
					КонецЕсли;
				КонецЦикла;
				ДвиженияРасчетыСПоставщиками.Записать();
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	ОперативныеВзаиморасчетыСервер.ЗаполнитьОперативныеВзаиморасчетыПоТаблице(ОсновныеПараметры, ТаблицаОбъектов);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	ВзаиморасчетыСлужебный.ОчиститьРегистрыВзаиморасчетов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсёСервер()
	ВзаиморасчетыСлужебный.ЗаполнитьПоВсемРасчетам();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановыеНаСервере()
	
	ВзаиморасчетыСлужебный.ЗаполнитьПоВсемРасчетам(Истина);
	
КонецПроцедуры

&НаСервере
Функция ИменаРегистров(ТолькоПлановые = Ложь)
	Если НЕ ТолькоПлановые Тогда
		Возврат 
			СтрШаблон("
			|	%1
			|	%2
			|	%3
			|	%4
			|	%5
			|	%6",
			Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Синоним,
			Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОплат.Синоним,
			Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОтгрузок.Синоним,
			Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.Синоним,
			Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат.Синоним,
			Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланПоставок.Синоним
			);
	Иначе
		Возврат 
			СтрШаблон("
			|	%1
			|	%2
			|	%3
			|	%4",
			Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОплат.Синоним,
			Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОтгрузок.Синоним,
			Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат.Синоним,
			Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланПоставок.Синоним
			);
	КонецЕсли;
КонецФункции

#КонецОбласти

