
&Вместо("ДоступныеВерсииУниверсальногоФормата")
Процедура АУ_ДоступныеВерсииУниверсальногоФормата(ВерсииФормата)
	
	ВерсииФормата.Вставить("1.7", МенеджерОбменаЧерезУниверсальныйФормат);
	ВерсииФормата.Вставить("1.8", МенеджерОбменаЧерезУниверсальныйФормат);
	ВерсииФормата.Вставить("1.10", МенеджерОбменаЧерезУниверсальныйФормат);
	ВерсииФормата.Вставить("1.11", МенеджерОбменаЧерезУниверсальныйФормат);
	ВерсииФормата.Вставить("1.12", МенеджерОбменаЧерезУниверсальныйФормат);
	ВерсииФормата.Вставить("1.15", МенеджерОбменаЧерезУниверсальныйФормат);
	ВерсииФормата.Вставить("1.16", МенеджерОбменаЧерезУниверсальныйФормат);
	ВерсииФормата.Вставить("1.17", МенеджерОбменаЧерезУниверсальныйФормат);
	ВерсииФормата.Вставить("1.19", МенеджерОбменаЧерезУниверсальныйФормат);
	ВерсииФормата.Вставить("1.20", МенеджерОбменаЧерезУниверсальныйФормат);
	ВерсииФормата.Вставить("1.22", МенеджерОбменаЧерезУниверсальныйФормат);
	
КонецПроцедуры
