#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(ЭтаФорма, "АУ_Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_НомерСчета", Элементы.Список,, 1, "Список.Ссылка.АУ_НомерСчета");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_Программа", Элементы.Список,, 1, "Список.Ссылка.АУ_Программа");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_Объект", Элементы.Список,, 1, "Список.Ссылка.АУ_Объект");
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_ИзменитьДатуПлатежа", "Установить дату платежа", "АУ_ИзменитьДатуПлатежа");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ИзменитьДатуПлатежа", Элементы.Список.КонтекстноеМеню,, "АУ_ИзменитьДатуПлатежа", 1);
	АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычнаяБезОтображения(ЭтаФорма, "АУ_Подвал", ЭтаФорма, 3);
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_Сумма", "АУ_Подвал", "Сумма строк", 1, "АУ_Сумма", Новый Структура("ТолькоПросмотр", Истина));
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытия

&НаКлиенте
Процедура АУ_ИзменитьДатуПлатежа(Команда)
	
	МассивДокументов = Новый Массив;
	Для каждого стр Из Элементы.Список.ВыделенныеСтроки Цикл
		МассивДокументов.Добавить(стр);
	КонецЦикла;
	
	ОткрытьФорму("Обработка.АУ_ЗагрузкаДанныхВДокументы.Форма.ИзменениеДатыПлатежаЗРДС", Новый Структура("МассивДокументов",МассивДокументов), ЭтаФорма, Новый УникальныйИдентификатор,,,Новый ОписаниеОповещения("ЗавершениеИзменениеДатыПлатежаЗРДС", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеИзменениеДатыПлатежаЗРДС(Значение,ДопПараметры) Экспорт
	
	Сообщить("Даты платежа изменены !");
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_СписокПриАктивизацииСтрокиПосле(Элемент)
	
	ПосчитатьСуммуВыделенныхСтрок();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ПосчитатьСуммуВыделенныхСтрок()
	
	ЭтаФорма.АУ_Сумма = 0;
	
	Для каждого стр Из Элементы.Список.ВыделенныеСтроки Цикл
		ЭтаФорма.АУ_Сумма = ЭтаФорма.АУ_Сумма + стр.Ссылка.СуммаДокумента;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти