
#Область ПрограммныйИнтерфейс

// Обновляет статусы и информацию о разрешении продажи товаров
// 
// Параметры:
//  Объект - ДокументОбъект.ЧекККМ - Документ, из которой происходит вызов процедуры:
//  	* Товары - ТаблицаЗначений - Товары документа
Процедура ОбновитьСтатусыИРазрешеннияТоваров(Объект) Экспорт
	
	//++ Локализация
	ИспользуетсяВетеринарныйСертификат = ВедетсяУчетВидовПродукцииПоВетеринарнымСертификатам();
	Если Не ИспользуетсяВетеринарныйСертификат Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ПродаетсяПоРазрешению
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В (&СписокТоваров)
	|		И Номенклатура.ПродаетсяПоРазрешению";
	Запрос.УстановитьПараметр("СписокТоваров", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	
	СтатусРазрешенийТоваров = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		
		Если КонструкторИСМПКлиентСервер.ВидПродукцииИспользуетВетеринарныйСертификат(СтрокаТовары.ВидПродукцииИС) Тогда
			
			ПараметрыОтбора = Новый Структура("Номенклатура", СтрокаТовары.Номенклатура);
			СтатусРазрешенияТовара = СтатусРазрешенийТоваров.НайтиСтроки(ПараметрыОтбора);
			
			Если СтатусРазрешенияТовара.Количество() = 0 Тогда
				СтрокаТовары.ПродаетсяПоРазрешению = Ложь;
				СтрокаТовары.РеквизитыРазрешенияНаПродажу = "";
				Продолжить;
			КонецЕсли;
			
			СтрокаТовары.ПродаетсяПоРазрешению = Истина;
			
			Если Не ЗначениеЗаполнено(СтрокаТовары.ИдентификаторСтроки) Тогда
				СтрокаТовары.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			
			СтрокиРазрешенияНаПродажу = Объект.РазрешенияНаПродажу.НайтиСтроки(
				Новый Структура("ИдентификаторСтроки", СтрокаТовары.ИдентификаторСтроки));
			
			Если СтрокиРазрешенияНаПродажу.Количество() <> 0 Тогда
				Если ЗначениеЗаполнено(СтрокиРазрешенияНаПродажу[0].ТипДокумента) Тогда
					СтрокаТовары.РеквизитыРазрешенияНаПродажу = "" + СтрокиРазрешенияНаПродажу[0].ТипДокумента
						+ " №" + СтрокиРазрешенияНаПродажу[0].НомерДокумента + " от "
						+ Формат(СтрокиРазрешенияНаПродажу[0].ДатаДокумента, "ДФ=dd.MM.yyyy");
				КонецЕсли;
			Иначе
				СтрокаТовары.РеквизитыРазрешенияНаПродажу = "<Не указано разрешение>";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	//-- Локализация
	
КонецПроцедуры

// Обновляет статус и информацию о разрешении продажи товара в текущей строке
// 
// Параметры:
//  ТекущаяСтрока - ДанныеФормыКоллекция - Обрабатываемая строка
//  Объект - ДокументОбъект.ЧекККМ - Документ, из которой происходит вызов процедуры:
//  	* Товары - ТаблицаЗначений - Товары документа
Процедура ОбновитьСтатусИРазрешенниеНаПродажу(ТекущаяСтрока, Объект) Экспорт
	
	//++ Локализация
	ИспользуетсяВетеринарныйСертификат = ВедетсяУчетВидовПродукцииПоВетеринарнымСертификатам();
	Если Не ИспользуетсяВетеринарныйСертификат Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ПродаетсяПоРазрешению
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|		И Номенклатура.ПродаетсяПоРазрешению";
	Запрос.УстановитьПараметр("Номенклатура", ТекущаяСтрока.Номенклатура);
	
	СтатусРазрешенийТоваров = Запрос.Выполнить().Выгрузить();
		
	Если КонструкторИСМПКлиентСервер.ВидПродукцииИспользуетВетеринарныйСертификат(ТекущаяСтрока.ВидПродукцииИС) Тогда
		
		ПараметрыОтбора = Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура);
		СтатусРазрешенияТовара = СтатусРазрешенийТоваров.НайтиСтроки(ПараметрыОтбора);
		
		Если СтатусРазрешенияТовара.Количество() = 0 Тогда
			ТекущаяСтрока.ПродаетсяПоРазрешению = Ложь;
			ТекущаяСтрока.РеквизитыРазрешенияНаПродажу = "";
			Возврат;
		КонецЕсли;
		
		ТекущаяСтрока.ПродаетсяПоРазрешению = Истина;
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторСтроки) Тогда
			ТекущаяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
		
		СтрокиРазрешенияНаПродажу = Объект.РазрешенияНаПродажу.НайтиСтроки(
			Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки));
		
		Если СтрокиРазрешенияНаПродажу.Количество() <> 0 Тогда
			Если ЗначениеЗаполнено(СтрокиРазрешенияНаПродажу[0].ТипДокумента) Тогда
				ТекущаяСтрока.РеквизитыРазрешенияНаПродажу = "" + СтрокиРазрешенияНаПродажу[0].ТипДокумента
					+ " №" + СтрокиРазрешенияНаПродажу[0].НомерДокумента + " от "
					+ Формат(СтрокиРазрешенияНаПродажу[0].ДатаДокумента, "ДФ=dd.MM.yyyy");
			КонецЕсли;
		Иначе
			ТекущаяСтрока.РеквизитыРазрешенияНаПродажу = "<Не указано разрешение>";
		КонецЕсли;
		
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Удаляет разрешения на продажу без связанных товаров
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма РМК
Процедура УдалитьРазрешенияНаПродажуБезСвязанныхТоваров(Форма) Экспорт
	
	//++ Локализация
	ИспользуетсяВетеринарныйСертификат = ВедетсяУчетВидовПродукцииПоВетеринарнымСертификатам();
	Если Не ИспользуетсяВетеринарныйСертификат Тогда
		Возврат;
	КонецЕсли;
	
	РазрешенияНаПродажуКУдалению = Новый Массив;
		
	Для Каждого СтрокаРазрешенияНаПродажу Из Форма.Объект.РазрешенияНаПродажу Цикл
		
		ПараметрыПоиска = Новый Структура("ИдентификаторСтроки", СтрокаРазрешенияНаПродажу.ИдентификаторСтроки);
		СтрокиТовары = Форма.Объект.Товары.НайтиСтроки(ПараметрыПоиска);
		
		Если СтрокиТовары.Количество() = 0
			ИЛИ Не СтрокиТовары[0].ПродаетсяПоРазрешению Тогда
			РазрешенияНаПродажуКУдалению.Добавить(СтрокаРазрешенияНаПродажу);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из РазрешенияНаПродажуКУдалению Цикл
		Форма.Объект.РазрешенияНаПродажу.Удалить(СтрокаКУдалению);
	КонецЦикла;
	//-- Локализация
	
КонецПроцедуры

// Удаляет разрешение на продажу, если в текущей строке для товара оно не требуется
// 
// Параметры:
//  ТекущаяСтрока - ДанныеФормыКоллекция - Обрабатываемая строка
//  Форма - ФормаКлиентскогоПриложения - Форма РМК
Процедура УдалитьРазрешениеНаПродажуБезСвязанногоТовара(ТекущаяСтрока, Форма) Экспорт
	
	//++ Локализация
	ИспользуетсяВетеринарныйСертификат = ВедетсяУчетВидовПродукцииПоВетеринарнымСертификатам();
	
	Если ИспользуетсяВетеринарныйСертификат
		И Не ТекущаяСтрока.ПродаетсяПоРазрешению Тогда
		
		ПараметрыПоиска = Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки);
		СтрокиРазрешенияНаПродажу = Форма.Объект.РазрешенияНаПродажу.НайтиСтроки(ПараметрыПоиска);
		
		Если СтрокиРазрешенияНаПродажу.Количество() > 0 Тогда
			Форма.Объект.РазрешенияНаПродажу.Удалить(СтрокиРазрешенияНаПродажу[0]);
		КонецЕсли;
		
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Установить условное оформление.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - 
Процедура УстановитьУсловноеОформление(Форма) Экспорт

//++ Локализация

#Область РозничнаяПродажаТабачнойПродукцииТолькоПоМРЦ
	
	ИмяТаблицы = РозничныеПродажиКлиентСерверЛокализация.ТаблицаТоваровПоФормеМРЦ(Форма.ИмяФормы);
	
	//
	
	СписокВидовПродукцииСМРЦ = Новый СписокЗначений;
	СписокВидовПродукцииСМРЦ.ЗагрузитьЗначения(КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииКоторымДоступноПолеМРЦ());
	
	ИменаРеквизитовТаблицы = Новый Массив;
	ИменаРеквизитовТаблицы.Добавить("СуммаРучнойСкидки");
	ИменаРеквизитовТаблицы.Добавить("ПроцентРучнойСкидки");
	
	Элемент = Форма.УсловноеОформление.Элементы.Добавить();

	Для каждого Элем Из ИменаРеквизитовТаблицы Цикл
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(
			Форма.Элементы[ИмяТаблицы+Элем].Имя);
	КонецЦикла;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(
		РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаИспользоватьРозничныеПродажиТабачнойПродукцииТолькоПоМРЦ());
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект."+ИмяТаблицы+".ВидПродукцииИС");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокВидовПродукцииСМРЦ;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК" Тогда
		
		ИменаРеквизитовТаблицы = Новый Массив;
		ИменаРеквизитовТаблицы.Добавить("Номенклатура");
		ИменаРеквизитовТаблицы.Добавить("Характеристика");
		ИменаРеквизитовТаблицы.Добавить("Серия");
		ИменаРеквизитовТаблицы.Добавить("КоличествоУпаковок");
		
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		
		Для каждого Элем Из ИменаРеквизитовТаблицы Цикл
			ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(
				Форма.Элементы[ИмяТаблицы+Элем].Имя);
		КонецЦикла;
		
		ИмяРеквизитаУстановленаМРЦ = РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаУстановленаМРЦ();
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект."+ИмяТаблицы+"." + ИмяРеквизитаУстановленаМРЦ);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		
	КонецЕсли;
	
#КонецОбласти 

//-- Локализация

КонецПроцедуры

// Установить доступность использования розничных продаж локализация.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ИспользоватьРозничныеПродажи - Булево - Использовать розничные продажи
Процедура УстановитьДоступностьИспользованияРозничныхПродажЛокализация(Форма, ИспользоватьРозничныеПродажи) Экспорт
	
	//++ Локализация
	Элементы = Форма.Элементы;
	
	Элементы.ОпределятьПринадлежностьТовараИСтавкуНДСПриПодборе.Доступность = ИспользоватьРозничныеПродажи;
	Элементы.ОплатаЭлектроннымиСертификатамиФСС.Доступность = ИспользоватьРозничныеПродажи;
	Элементы.АдресСервисаНСПК.Доступность = ИспользоватьРозничныеПродажи;
	Элементы.КлючДоступаНСПК.Доступность = ИспользоватьРозничныеПродажи;
	Элементы.ПроксиСерверНСПК.Доступность = ИспользоватьРозничныеПродажи;
	Элементы.ПроксиПортНСПК.Доступность = ИспользоватьРозничныеПродажи;
	Элементы.ПроксиПользовательНСПК.Доступность = ИспользоватьРозничныеПродажи;
	Элементы.ПроксиПарольНСПК.Доступность = ИспользоватьРозничныеПродажи;
	Элементы.ИспользоватьКорневыеСертификатыНСПК.Доступность = ИспользоватьРозничныеПродажи;
	Элементы.ДатаРозничнойПродажиТабачнойПродукцииТолькоПоМРЦ.Доступность = ИспользоватьРозничныеПродажи;
	//-- Локализация
	
КонецПроцедуры

#Область ФискальныеОперации

//++ Локализация

// Возвращает товары и штрихкоды товаров для ИСМП
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка - Документ ссылка
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц
// 
// Возвращаемое значение:
//  Структура - Получить товары и штрихкоды для ИСМП:
// * Товары - ТаблицаЗначений - 
// * Штрихкоды - Массив Из Структура - 
Функция ПолучитьТоварыИШтрихкодыДляИСМП(ДокументСсылка, МенеджерВременныхТаблиц) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковок.ШтрихкодУпаковки               КАК ШтрихкодУпаковки,
	|	ШтрихкодыУпаковок.ЧастичноеВыбытиеВариантУчета   КАК ЧастичноеВыбытиеВариантУчета,
	|	ШтрихкодыУпаковок.ЧастичноеВыбытиеНоменклатура   КАК ЧастичноеВыбытиеНоменклатура,
	|	ШтрихкодыУпаковок.ЧастичноеВыбытиеХарактеристика КАК ЧастичноеВыбытиеХарактеристика,
	|	ШтрихкодыУпаковок.ЧастичноеВыбытиеКоличество     КАК ЧастичноеВыбытиеКоличество,
	|	&ИдентификаторЗапросаГИСМТ                       КАК РазрешительныйРежимИдентификаторЗапросаГИСМТ,
	|	&ДатаПолученияЗапросаГИСМТ                       КАК РазрешительныйРежимДатаЗапросаГИСМТ,
	|	&ИдентификаторЭкземпляраПОГИСМТ                  КАК РазрешительныйРежимИдентификаторЭкземпляраПО,
	|	&ВерсияБазыГИСМТ                                 КАК РазрешительныйРежимВерсияБазы,
	|	&МинимальнаяРозничнаяЦена                        КАК МинимальнаяРозничнаяЦена
	|ИЗ
	|	ТаблицаАкцизныеМарки КАК ШтрихкодыУпаковок";
	
	МассивУпаковок                  = Новый Массив();
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИдентификаторЗапросаГИСМТ",      "ШтрихкодыУпаковок.РазрешительныйРежимИдентификаторЗапросаГИСМТ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаПолученияЗапросаГИСМТ",      "ШтрихкодыУпаковок.РазрешительныйРежимДатаЗапросаГИСМТ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИдентификаторЭкземпляраПОГИСМТ", "ШтрихкодыУпаковок.РазрешительныйРежимИдентификаторЭкземпляраПО");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВерсияБазыГИСМТ",                "ШтрихкодыУпаковок.РазрешительныйРежимВерсияБазы");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&МинимальнаяРозничнаяЦена",       "ШтрихкодыУпаковок.РазрешительныйРежимМинимальнаяРозничнаяЦена");
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИдентификаторЗапросаГИСМТ",      "");
	Запрос.УстановитьПараметр("ДатаПолученияЗапросаГИСМТ",      "");
	Запрос.УстановитьПараметр("ИдентификаторЭкземпляраПОГИСМТ", "");
	Запрос.УстановитьПараметр("ВерсияБазыГИСМТ",                "");
	Запрос.УстановитьПараметр("МинимальнаяРозничнаяЦена",       "");
	
	ВыборкаИзРезультатаПоШтрихкодам = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИзРезультатаПоШтрихкодам.Следующий() Цикл
		
		НовыйЭлемент = ШтрихкодированиеИС.НовыйЭлементКоллекцииУпаковокДляРаспределенияПоТоварам();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ВыборкаИзРезультатаПоШтрихкодам);
		
		МассивУпаковок.Добавить(НовыйЭлемент);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Серии.НомерСтроки КАК НомерСтроки,
	|	Серии.СерияТаблицыСерий КАК СерияТаблицыСерий,
	|	Серии.КоличествоУпаковок КАК Количество,
	|	Серии.Номенклатура КАК Номенклатура,
	|	Серии.Характеристика КАК Характеристика
	|ИЗ
	|	Серии КАК Серии";
	
	ТаблицаСерий = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Серия КАК СерияТаблицыТоваров,
	|	Товары.СтатусУказанияСерий,
	|	ОписаниеНоменклатурыИС.КлючВидовПродукции КАК ВидПродукцииИС,
	|	Товары.Упаковка,
	|	Товары.Количество,
	|	Товары.КоличествоУпаковок,
	|	Товары.Цена,
	|	Товары.СуммаСкидки КАК СуммаСкидки,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.СуммаСНДС КАК СуммаСНДС,
	|	Товары.Сумма КАК Сумма
	|ИЗ
	|	Товары КАК Товары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|	ПО Товары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
	|	И (ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
	|		ИЛИ ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииЕГАИС <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка))";
	
	ТаблицаТовары = Запрос.Выполнить().Выгрузить();
	
	ПоляИзмерения = Новый Массив;
	ПоляИзмерения.Добавить("Номенклатура");
	ПоляИзмерения.Добавить("Характеристика");
	
	ПоляДетализации = Новый Массив;
	ПоляДетализации.Добавить("СерияТаблицыСерий");
	
	ПоляСумм = Новый Массив;
	ПоляСумм.Добавить("СуммаСкидки");
	ПоляСумм.Добавить("СуммаНДС");
	ПоляСумм.Добавить("СуммаСНДС");
	ПоляСумм.Добавить("Сумма");
	ПоляСумм.Добавить("Количество");
	
	ТаблицаРезультатРаспределения = РаспределитьДанныеПоТаблицам(ТаблицаТовары, ТаблицаСерий, ПоляИзмерения, ПоляДетализации, ПоляСумм, "Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаРезультатРаспределения.НомерСтроки КАК НомерСтроки,
	|	ТаблицаРезультатРаспределения.Номенклатура КАК Номенклатура,
	|	ТаблицаРезультатРаспределения.Характеристика КАК Характеристика,
	|	ТаблицаРезультатРаспределения.СерияТаблицыТоваров КАК СерияТаблицыТоваров,
	|	ТаблицаРезультатРаспределения.СерияТаблицыСерий КАК СерияТаблицыСерий,
	|	ТаблицаРезультатРаспределения.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ТаблицаРезультатРаспределения.ВидПродукцииИС КАК ВидПродукцииИС,
	|	ТаблицаРезультатРаспределения.Упаковка КАК Упаковка,
	|	ТаблицаРезультатРаспределения.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаРезультатРаспределения.Количество КАК Количество,
	|	ТаблицаРезультатРаспределения.Цена КАК Цена,
	|	ТаблицаРезультатРаспределения.СуммаСкидки КАК СуммаСкидки,
	|	ТаблицаРезультатРаспределения.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаРезультатРаспределения.СуммаНДС КАК СуммаНДС,
	|	ТаблицаРезультатРаспределения.СуммаСНДС КАК СуммаСНДС,
	|	ТаблицаРезультатРаспределения.Сумма КАК Сумма
	|ПОМЕСТИТЬ ТаблицаРезультатРаспределения
	|ИЗ
	|	&ТаблицаРезультатРаспределения КАК ТаблицаРезультатРаспределения
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРезультатРаспределения.НомерСтроки,
	|	ТаблицаРезультатРаспределения.Номенклатура,
	|	ТаблицаРезультатРаспределения.Характеристика,
	|	ТаблицаРезультатРаспределения.СерияТаблицыТоваров,
	|	ТаблицаРезультатРаспределения.СерияТаблицыСерий,
	|	ТаблицаРезультатРаспределения.СтатусУказанияСерий,
	|	ТаблицаРезультатРаспределения.ВидПродукцииИС,
	|	ТаблицаРезультатРаспределения.Упаковка,
	|	ТаблицаРезультатРаспределения.КоличествоУпаковок,
	|	ТаблицаРезультатРаспределения.Цена,
	|	ТаблицаРезультатРаспределения.СуммаСкидки,
	|	ТаблицаРезультатРаспределения.СтавкаНДС,
	|	ТаблицаРезультатРаспределения.СтавкаНДС.Ставка КАК СтавкаНДСЧислом,
	|	ТаблицаРезультатРаспределения.СуммаНДС,
	|	ТаблицаРезультатРаспределения.СуммаСНДС,
	|	ТаблицаРезультатРаспределения.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТаблицаРезультатРаспределения.СерияТаблицыСерий = НЕОПРЕДЕЛЕНО
	|			ТОГДА ТаблицаРезультатРаспределения.СерияТаблицыТоваров
	|		ИНАЧЕ ТаблицаРезультатРаспределения.СерияТаблицыСерий
	|	КОНЕЦ КАК Серия,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ТаблицаРезультатРаспределения.СерияТаблицыСерий = НЕОПРЕДЕЛЕНО
	|					ТОГДА ТаблицаРезультатРаспределения.СерияТаблицыТоваров
	|				ИНАЧЕ ТаблицаРезультатРаспределения.СерияТаблицыСерий
	|			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ УчитыватьСерии,
	|	ТаблицаРезультатРаспределения.Количество КАК Количество,
	|	ТаблицаРезультатРаспределения.НомерСтроки КАК ИндексИсходнойСтроки
	|ИЗ
	|	ТаблицаРезультатРаспределения КАК ТаблицаРезультатРаспределения";
	Запрос.УстановитьПараметр("ТаблицаРезультатРаспределения", ТаблицаРезультатРаспределения);
	
	Товары = Запрос.Выполнить().Выгрузить();
	
	Возврат Новый Структура("Товары, Штрихкоды", Товары, МассивУпаковок);
	
КонецФункции

// Получить данные для передачи МОТП сведений о розничной продаже
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - Документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные о продажах
//
Функция ДанныеДляИСМП(ДокументСсылка, МенеджерВременныхТаблиц) Экспорт
	
	ДанныеДокумента = ПолучитьТоварыИШтрихкодыДляИСМП(ДокументСсылка, МенеджерВременныхТаблиц);
	
	Товары = ДанныеДокумента.Товары;
	Штрихкоды = ДанныеДокумента.Штрихкоды;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМ")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМВозврат")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМКоррекции") Тогда
		
		ДокументСтруктурой = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Склад,Статус,Дата");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ДокументСтруктурой = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Склад,ХозяйственнаяОперация,Статус,Дата");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ДокументСтруктурой = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Склад,Дата,ДокументОснование");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		
		ДокументСтруктурой = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Склад,Дата,ХозяйственнаяОперация");
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Некорректно встроен механизм распределения серий по товаром для расчета данных ИСМП: %1'"), 
				ОписаниеОшибки());
	КонецЕсли;
	
	ПолноеИмя = ДокументСсылка.Метаданные().ПолноеИмя();
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	
	ПараметрыУказанияСерий = МенеджерОбъекта.ПараметрыУказанияСерий(ДокументСтруктурой);
	
	ТоварыРазобранные =
		РаспределитьШтрихкодыПоТаблицеТоваров(
			ДокументСсылка,
			Штрихкоды,
			ПараметрыУказанияСерий,
			Товары);
	
	Возврат ТоварыРазобранные;
	
КонецФункции

// Распределить штрихкоды по таблице товаров.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка - Документ ссылка
//  МассивУпаковок - Массив ИЗ см. ШтрихкодированиеИС.НовыйЭлементКоллекцииУпаковокДляРаспределенияПоТоварам - Массив
//  штрихкодов упаковок для распределения.
//  ПараметрыУказанияСерий - Структура - см. НоменклатураКлиентСервер.ПараметрыУказанияСерий - Параметры указания серий
//  Товары - ТаблицаЗначений - Товары
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Распределить штрихкоды по таблице товаров
Функция РаспределитьШтрихкодыПоТаблицеТоваров(ДокументСсылка, МассивУпаковок, ПараметрыУказанияСерий, Товары) Экспорт
	
	ДанныеРаспределения = ДанныеРаспределенияШтрихкодовУпаковокПоТоварам(
		ДокументСсылка, МассивУпаковок, ПараметрыУказанияСерий, Товары, Истина);
	
	Если ДанныеРаспределения.ЕстьОшибки Тогда
		ВызватьИсключение СтрСоединить(ДанныеРаспределения.Ошибки, Символы.ПС);
	КонецЕсли;
	
	ТекстОшибки = "";
	Для Каждого РаспределеннаяСтрока Из ДанныеРаспределения.РаспределенныеСтроки Цикл
		Для Каждого СтрокаЗначения Из РаспределеннаяСтрока.Значение Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаЗначения, "ТекстОшибки")
				И СтрокаЗначения.ТекстОшибки <> Неопределено И СтрокаЗначения.ТекстОшибки <> "" Тогда
				ТекстОшибки = ТекстОшибки + СтрокаЗначения.ТекстОшибки + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ТекстОшибки <> Неопределено И ТекстОшибки <> "" Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	СтавкаНДСБезНДС = Справочники.СтавкиНДС.БезНДС;
	СтавкаНДС0 = УчетНДСЛокализация.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС0);
	
	ТоварыРазобранные = НоваяТаблицаРаспределенныхТоваровПоШтрихкодам(Товары.СкопироватьКолонки());
	ОписанияНоменклатурыСЧастичнымВыбытием = Новый Соответствие;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		КоэффциентУпаковкиДокумента = СтрокаТовары.КоличествоУпаковок / СтрокаТовары.Количество;
		
		РаспределениеПоСтроке = ДанныеРаспределения.РаспределенныеСтроки.Получить(СтрокаТовары);
		
		Если РаспределениеПоСтроке = Неопределено
			ИЛИ (НЕ ИнтеграцияГИСМ.ПодсистемаНеИспользуется()
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "ВидПродукцииИС")
				И КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияМЕХ(СтрокаТовары.ВидПродукцииИС)) Тогда
			
			СтрокаТоварыРазобранные = ТоварыРазобранные.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТоварыРазобранные, СтрокаТовары);
			Продолжить;
		КонецЕсли;
		
		пКоличествоУпаковок = СтрокаТовары.КоличествоУпаковок;
		пСуммаСкидки        = СтрокаТовары.СуммаСкидки;
		пСуммаНДС           = СтрокаТовары.СуммаНДС;
		пСуммаСНДС          = СтрокаТовары.СуммаСНДС;
		
		ОтклонениеСуммыСкидки = 0;
		ОтклонениеСуммыНДС = 0;
		ОтклонениеСуммыСНДС = 0;
		
		Для Каждого СтрокаРаспределения Из РаспределениеПоСтроке Цикл
			
			Если СтрокаТовары.КоличествоУпаковок = 0 Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаТоварыРазобранные = ТоварыРазобранные.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТоварыРазобранные, СтрокаТовары);
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаРаспределения, "ТекстОшибки") Тогда
				СтрокаТоварыРазобранные.ТекстОшибки = СтрокаРаспределения.ТекстОшибки;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТоварыРазобранные.ТекстОшибки) Тогда
				СтрокаТовары.Количество = СтрокаТовары.Количество - СтрокаРаспределения.Количество;
				Продолжить;
			КонецЕсли;
			
			СтрокаТоварыРазобранные.Количество = 1;
			СтрокаТоварыРазобранные.КоличествоУпаковок = СтрокаТоварыРазобранные.Количество
			                                             * КоэффциентУпаковкиДокумента;
			
			ТребуетсяПересчетИзУпаковкиВБазовуюЕдиницуИзмерения = Ложь;
			КоэффициентПересчетаУпаковки = КоэффциентУпаковкиДокумента;
				
			Если ЗначениеЗаполнено(СтрокаРаспределения.Штрихкод) Тогда
				
				Если СтрокаРаспределения.ЧастичноеВыбытие Тогда
					
					ОписаниеНоменклатуры = ОписаниеНоменклатуры(
						СтрокаТовары.Номенклатура,
						ОписанияНоменклатурыСЧастичнымВыбытием);
					
					СтрокаТоварыРазобранные.Упаковка = ОписаниеНоменклатуры.УпаковкаЧастичногоВыбытия;
					
					КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(
							СтрокаТоварыРазобранные.Упаковка,
							СтрокаТоварыРазобранные.Номенклатура);
					КоэффициентПересчетаУпаковки = 1 / КоэффициентУпаковки;
							
					СтрокаТоварыРазобранные.Количество = Мин(СтрокаРаспределения.Количество, СтрокаТовары.Количество);
					СтрокаТоварыРазобранные.КоличествоУпаковок = СтрокаТоварыРазобранные.Количество
					                                             * КоэффициентПересчетаУпаковки;
					
					СтрокаТоварыРазобранные.ДополнениеКНаименованиюТовара = СтруктураНаименованияТовара(
						СтрокаТовары,
						СтрокаРаспределения);
					
				ИначеЕсли СтрокаРаспределения.Количество <> 1 Тогда
					
					СтрокаТоварыРазобранные.Количество         = СтрокаРаспределения.Количество;
					СтрокаТоварыРазобранные.КоличествоУпаковок = СтрокаРаспределения.Количество
					                                             * КоэффициентПересчетаУпаковки;
					
					СтрокаТоварыРазобранные.ДополнениеКНаименованиюТовара = СтруктураНаименованияТовара(
						СтрокаТовары,
						СтрокаРаспределения);
					
				ИначеЕсли СтрокаРаспределения.ВидУпаковки <> Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет Тогда
					
					СтрокаТоварыРазобранные.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
					СтрокаТоварыРазобранные.Количество = СтрокаРаспределения.Количество;
					
					ВДокументеПродажаУпаковки = ЗначениеЗаполнено(СтрокаТовары.Упаковка);
					Если ВДокументеПродажаУпаковки Тогда
						ТребуетсяПересчетИзУпаковкиВБазовуюЕдиницуИзмерения = Истина;
					Иначе
						СтрокаТоварыРазобранные.КоличествоУпаковок = СтрокаРаспределения.Количество;
						КоэффициентПересчетаУпаковки = 1;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			СуммаСкидки = СтрокаТовары.СуммаСкидки;
			СуммаСкидкиЭталон = СуммаСкидки;
			СуммаНДС    = СтрокаТовары.СуммаНДС;
			СуммаСНДС   = СтрокаТовары.СуммаСНДС;
			СуммаСНДСЭталон = СуммаСНДС;
			Если Не СтрокаТовары.Количество = СтрокаТоварыРазобранные.Количество Тогда
				СуммаСкидкиЭталон = пСуммаСкидки  / пКоличествоУпаковок * СтрокаТоварыРазобранные.КоличествоУпаковок;
				СуммаСНДСЭталон   = пСуммаСНДС    / пКоличествоУпаковок * СтрокаТоварыРазобранные.КоличествоУпаковок;
				СуммаСкидки       = Окр(СуммаСкидкиЭталон, 2);
				СуммаНДС          = Окр(пСуммаНДС / пКоличествоУпаковок * СтрокаТоварыРазобранные.КоличествоУпаковок, 2);
				СуммаСНДС         = Окр(СуммаСНДСЭталон, 2);
			КонецЕсли;
			
			СтрокаТоварыРазобранные.КоэффициентПересчетаУпаковки = КоэффициентПересчетаУпаковки;
			
			СтрокаТоварыРазобранные.СуммаСкидки = СуммаСкидки;
			СтрокаТоварыРазобранные.СуммаНДС    = СуммаНДС;
			СтрокаТоварыРазобранные.СуммаСНДС   = СуммаСНДС;
			СтрокаТоварыРазобранные.Штрихкод    = СтрокаРаспределения.Штрихкод;
			СтрокаТоварыРазобранные.РезультатРаспределения = СтрокаРаспределения;
			
			Если Не (СтрокаТоварыРазобранные.СуммаСНДС = СуммаСНДСЭталон) Тогда
				ОтклонениеСуммыСНДСПоСтроке = СтрокаТоварыРазобранные.СуммаСНДС - СуммаСНДСЭталон;
				Если ОтклонениеСуммыСНДС + ОтклонениеСуммыСНДСПоСтроке >= 0.01 Тогда
					СтрокаТоварыРазобранные.СуммаСНДС = СтрокаТоварыРазобранные.СуммаСНДС - 0.01;
					ОтклонениеСуммыСНДС = ОтклонениеСуммыСНДС + ОтклонениеСуммыСНДСПоСтроке - 0.01;
				ИначеЕсли ОтклонениеСуммыСНДС + ОтклонениеСуммыСНДСПоСтроке <= -0.01 Тогда
					СтрокаТоварыРазобранные.СуммаСНДС = СтрокаТоварыРазобранные.СуммаСНДС + 0.01;
					ОтклонениеСуммыСНДС = ОтклонениеСуммыСНДС + ОтклонениеСуммыСНДСПоСтроке + 0.01;
				Иначе
					ОтклонениеСуммыСНДС = ОтклонениеСуммыСНДС + ОтклонениеСуммыСНДСПоСтроке;
				КонецЕсли;
			КонецЕсли;

			Если Не (СтрокаТоварыРазобранные.СуммаСкидки = СуммаСкидкиЭталон) Тогда
				ОтклонениеСуммыСкидкиПоСтроке = СтрокаТоварыРазобранные.СуммаСкидки - СуммаСкидкиЭталон;
				Если ОтклонениеСуммыСкидки + ОтклонениеСуммыСкидкиПоСтроке >= 0.01 Тогда
					СтрокаТоварыРазобранные.СуммаСкидки = СтрокаТоварыРазобранные.СуммаСкидки - 0.01;
					ОтклонениеСуммыСкидки = ОтклонениеСуммыСкидки + ОтклонениеСуммыСкидкиПоСтроке - 0.01;
				ИначеЕсли ОтклонениеСуммыСкидки + ОтклонениеСуммыСкидкиПоСтроке <= -0.01 Тогда
					СтрокаТоварыРазобранные.СуммаСкидки = СтрокаТоварыРазобранные.СуммаСкидки + 0.01;
					ОтклонениеСуммыСкидки = ОтклонениеСуммыСкидки + ОтклонениеСуммыСкидкиПоСтроке + 0.01;
				Иначе
					ОтклонениеСуммыСкидки = ОтклонениеСуммыСкидки + ОтклонениеСуммыСкидкиПоСтроке;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ (СтрокаТоварыРазобранные.СтавкаНДС = СтавкаНДСБезНДС
				ИЛИ СтрокаТоварыРазобранные.СтавкаНДС = СтавкаНДС0
				ИЛИ СтрокаТоварыРазобранные.СуммаНДС = СтрокаТовары.СуммаНДС) Тогда
				
				ОтклонениеСуммыНДСПоСтроке = ОтклонениеСуммыНДС(СтрокаТоварыРазобранные);
				Если ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке >= 0.01 Тогда
					СтрокаТоварыРазобранные.СуммаНДС = СтрокаТоварыРазобранные.СуммаНДС - 0.01;
					ОтклонениеСуммыНДС = ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке - 0.01;
				ИначеЕсли ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке <= -0.01 Тогда
					СтрокаТоварыРазобранные.СуммаНДС = СтрокаТоварыРазобранные.СуммаНДС + 0.01;
					ОтклонениеСуммыНДС = ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке + 0.01;
				Иначе
					ОтклонениеСуммыНДС = ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке;
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаТовары.Упаковка = СтрокаТоварыРазобранные.Упаковка Тогда
				Цена = СтрокаТовары.Цена;
			Иначе
				Цена = Окр((СтрокаТоварыРазобранные.СуммаСНДС + СтрокаТоварыРазобранные.СуммаСкидки) / СтрокаТоварыРазобранные.КоличествоУпаковок, 2);
			КонецЕсли;
			
			СтрокаТоварыРазобранные.Цена    = Цена;
			СтрокаТовары.Количество         = СтрокаТовары.Количество - СтрокаТоварыРазобранные.Количество;
			СтрокаТовары.КоличествоУпаковок = СтрокаТовары.КоличествоУпаковок
			                                  - СтрокаТоварыРазобранные.Количество * КоэффциентУпаковкиДокумента;
			СтрокаТовары.СуммаСкидки        = СтрокаТовары.СуммаСкидки - СтрокаТоварыРазобранные.СуммаСкидки;
			СтрокаТовары.СуммаНДС           = СтрокаТовары.СуммаНДС - СтрокаТоварыРазобранные.СуммаНДС;
			СтрокаТовары.СуммаСНДС          = СтрокаТовары.СуммаСНДС - СтрокаТоварыРазобранные.СуммаСНДС;
			
			СтрокаТоварыРазобранные.ТребуетсяПересчетИзУпаковкиВБазовуюЕдиницуИзмерения
			                        = ТребуетсяПересчетИзУпаковкиВБазовуюЕдиницуИзмерения;
			Если ТребуетсяПересчетИзУпаковкиВБазовуюЕдиницуИзмерения Тогда
				СтрокаТоварыРазобранные.Цена = Окр((СтрокаТоварыРазобранные.СуммаСНДС + СтрокаТоварыРазобранные.СуммаСкидки) / СтрокаТоварыРазобранные.КоэффициентПересчетаУпаковки, 2);
				СтрокаТоварыРазобранные.КоличествоУпаковок = СтрокаТоварыРазобранные.Количество;
				СтрокаТоварыРазобранные.КоэффициентПересчетаУпаковки = 1;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаТовары.Количество > 0 Тогда
			СтрокаТоварыРазобранные = ТоварыРазобранные.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТоварыРазобранные, СтрокаТовары);
			
			СтрокаТоварыРазобранные.Цена = Окр((СтрокаТоварыРазобранные.СуммаСНДС + СтрокаТоварыРазобранные.СуммаСкидки) / СтрокаТоварыРазобранные.КоличествоУпаковок, 2);
			
			ОтклонениеСуммыНДСПоСтроке = ОтклонениеСуммыНДС(СтрокаТоварыРазобранные);
			Если ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке >= 0.01 Тогда
				СтрокаТоварыРазобранные.СуммаНДС = СтрокаТоварыРазобранные.СуммаНДС - 0.01;
			ИначеЕсли ОтклонениеСуммыНДС + ОтклонениеСуммыНДСПоСтроке <= -0.01 Тогда
				СтрокаТоварыРазобранные.СуммаНДС = СтрокаТоварыРазобранные.СуммаНДС + 0.01;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТоварыРазобранные;

КонецФункции

// Данные распределения штрихкодов упаковок по товарам.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка - Документ для получения данных распределения
//  МассивУпаковок - Массив ИЗ см. ШтрихкодированиеИС.НовыйЭлементКоллекцииУпаковокДляРаспределенияПоТоварам - Массив
//  штрихкодов упаковок для распределения.
//  ПараметрыУказанияСерий - Структура - см. НоменклатураКлиентСервер.ПараметрыУказанияСерий - Параметры указания серий
//  Товары - ТаблицаЗначений - Товары для распределения по штрихкодам упаковок
//  ЭтоПробитиеЧека - Булево - Истина, если выполняется пробитие чека на ККТ.
// 
// Возвращаемое значение:
//  см. ШтрихкодированиеИСМП.РаспределениеШтрихкодовУпаковокПоТоварам
Функция ДанныеРаспределенияШтрихкодовУпаковокПоТоварам(
	ДокументСсылка,
	МассивУпаковок,
	ПараметрыУказанияСерий,
	Товары,
	ЭтоПробитиеЧека = Ложь) Экспорт
	
	ДопустимыТоварыБезМарок = РозничныеПродажиЛокализация.ДопустимыТоварыБезМарокВДокументе(ДокументСсылка);
	
	ПараметрыРаспределения = ШтрихкодированиеИСМП.НовыеПараметрыРаспределенияШтрихкодовУпаковок();
	ПараметрыРаспределения.ДокументСсылка          = ДокументСсылка;
	ПараметрыРаспределения.ПараметрыУказанияСерий  = ПараметрыУказанияСерий;
	ПараметрыРаспределения.ДопустимыТоварыБезМарок = ДопустимыТоварыБезМарок;
	ПараметрыРаспределения.ЭтоПробитиеЧека         = ЭтоПробитиеЧека;
	
	ДанныеРаспределения = ШтрихкодированиеИС.РаспределениеШтрихкодовУпаковокПоТоварам(
		ПараметрыРаспределения,
		Товары,
		МассивУпаковок);
	
	Возврат ДанныеРаспределения;

КонецФункции

// Функция получает данные для формирования печатной формы КМ-6.
// 
// Параметры:
//	ПараметрыПечати	- Структура - Дополнительные настройки печати
//  МассивОбъектов - Массив Из ДокументСсылка - Ссылки на документы
//  
// Возвращаемое значение:
// 	Структура:
//		* РезультатЗапроса - РезультатЗапроса - Содержит информацию для заполнения печатной формы
Функция ПолучитьДанныеДляПечатнойФормыКМ6(ПараметрыПечати, МассивОбъектов) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	// МассивОбъектов содержит документы одного вида.	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ТЧТовары.Сумма), 0) КАК СуммаПродаж,
	|	ЕСТЬNULL(СУММА(ТЧТовары.СуммаНДС), 0) КАК СуммаПродажНДС,
	|	0 КАК СуммаПродажОтчет,
	|	0 КАК СуммаПродажОтчетНДС,
	|	0 КАК СуммаВозвратов,
	|	0 КАК СуммаВозвратовНДС,
	|	0 КАК СуммаПродажПодарочныхСертификатов,
	|	0 КАК СуммаВозвратовПодарочныхСертификатов,	
	|	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка,
	|	ОтчетОРозничныхПродажах.Ссылка КАК ОтчетОРозничныхПродажах	
	|ПОМЕСТИТЬ ПродажиИВозвраты
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ТЧТовары
	|		ПО (ТЧТовары.Ссылка.КассоваяСмена = ОтчетОРозничныхПродажах.КассоваяСмена)
	|			И (ТЧТовары.Ссылка.Проведен)
	|			И (ТЧТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит))
	|ГДЕ
	|	ОтчетОРозничныхПродажах.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРозничныхПродажах.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ТЧТовары.Сумма), 0) КАК СуммаПродаж,
	|	ЕСТЬNULL(СУММА(ТЧТовары.СуммаНДС), 0) КАК СуммаПродажНДС,
	|	0 КАК СуммаПродажОтчет,
	|	0 КАК СуммаПродажОтчетНДС,
	|	0 КАК СуммаВозвратов,
	|	0 КАК СуммаВозвратовНДС,
	|	0 КАК СуммаПродажПодарочныхСертификатов,
	|	0 КАК СуммаВозвратовПодарочныхСертификатов,
	|	ОтчетОРозничныхВозвратах.Ссылка КАК Ссылка,
	|	ОтчетОРозничныхПродажах.Ссылка КАК ОтчетОРозничныхПродажах	
	|ИЗ
	|	Документ.ОтчетОРозничныхВозвратах КАК ОтчетОРозничныхВозвратах
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах 
	|	ПО ОтчетОРозничныхПродажах.КассоваяСмена = ОтчетОРозничныхВозвратах.КассоваяСмена
	|		И ОтчетОРозничныхПродажах.НалогообложениеНДС = ОтчетОРозничныхВозвратах.НалогообложениеНДС	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ТЧТовары
	|		ПО (ТЧТовары.Ссылка.КассоваяСмена = ОтчетОРозничныхПродажах.КассоваяСмена)
	|			И (ТЧТовары.Ссылка.Проведен)
	|			И (ТЧТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит))
	|ГДЕ
	|	ОтчетОРозничныхВозвратах.Ссылка В(&МассивОбъектов)
	|	И ОтчетОРозничныхПродажах.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРозничныхПродажах.Ссылка,
	|	ОтчетОРозничныхВозвратах.Ссылка
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(ТЧТоварыОтчет.Сумма), 0),
	|	ЕСТЬNULL(СУММА(ТЧТоварыОтчет.СуммаНДС), 0),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка,
	|	ОтчетОРозничныхПродажах.Ссылка КАК ОтчетОРозничныхПродажах	
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах.Товары КАК ТЧТоварыОтчет
	|		ПО (ТЧТоварыОтчет.Ссылка = ОтчетОРозничныхПродажах.Ссылка)
	|ГДЕ
	|	ОтчетОРозничныхПродажах.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРозничныхПродажах.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(ТЧТоварыОтчет.Сумма), 0),
	|	ЕСТЬNULL(СУММА(ТЧТоварыОтчет.СуммаНДС), 0),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ОтчетОРозничныхВозвратах.Ссылка КАК Ссылка,
	|	ОтчетОРозничныхПродажах.Ссылка КАК ОтчетОРозничныхПродажах
	|ИЗ
	|	Документ.ОтчетОРозничныхВозвратах КАК ОтчетОРозничныхВозвратах
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах 
	|	ПО ОтчетОРозничныхПродажах.КассоваяСмена = ОтчетОРозничныхВозвратах.КассоваяСмена
	|		И ОтчетОРозничныхПродажах.НалогообложениеНДС = ОтчетОРозничныхВозвратах.НалогообложениеНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах.Товары КАК ТЧТоварыОтчет
	|	ПО (ТЧТоварыОтчет.Ссылка = ОтчетОРозничныхПродажах.Ссылка)
	|ГДЕ
	|	ОтчетОРозничныхВозвратах.Ссылка В(&МассивОбъектов)
	|	И ОтчетОРозничныхПродажах.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРозничныхПродажах.Ссылка,
	|	ОтчетОРозничныхВозвратах.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(ТЧТовары.Сумма), 0),
	|	ЕСТЬNULL(СУММА(ТЧТовары.СуммаНДС), 0),
	|	0,
	|	0,
	|	ОтчетОРозничныхПродажах.Ссылка,
	|	ОтчетОРозничныхПродажах.Ссылка КАК ОтчетОРозничныхПродажах	
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.Товары КАК ТЧТовары
	|		ПО (ТЧТовары.Ссылка.КассоваяСмена = ОтчетОРозничныхПродажах.КассоваяСмена)
	|			И (ТЧТовары.Ссылка.Проведен)
	|			И (ТЧТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит))
	|ГДЕ
	|	ОтчетОРозничныхПродажах.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРозничныхПродажах.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(ТЧТовары.Сумма), 0),
	|	ЕСТЬNULL(СУММА(ТЧТовары.СуммаНДС), 0),
	|	0,
	|	0,
	|	ОтчетОРозничныхВозвратах.Ссылка КАК Ссылка,
	|	ОтчетОРозничныхПродажах.Ссылка КАК ОтчетОРозничныхПродажах	
	|ИЗ
	|	Документ.ОтчетОРозничныхВозвратах КАК ОтчетОРозничныхВозвратах
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах 
	|	ПО ОтчетОРозничныхПродажах.КассоваяСмена = ОтчетОРозничныхВозвратах.КассоваяСмена
	|		И ОтчетОРозничныхПродажах.НалогообложениеНДС = ОтчетОРозничныхВозвратах.НалогообложениеНДС	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.Товары КАК ТЧТовары
	|	ПО (ТЧТовары.Ссылка.КассоваяСмена = ОтчетОРозничныхПродажах.КассоваяСмена)
	|		И (ТЧТовары.Ссылка.Проведен)
	|		И (ТЧТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит))
	|ГДЕ
	|	ОтчетОРозничныхВозвратах.Ссылка В(&МассивОбъектов)
	|	И ОтчетОРозничныхПродажах.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРозничныхПродажах.Ссылка,
	|	ОтчетОРозничныхВозвратах.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(ТЧПодарочныеСертификаты.Сумма), 0),
	|	0,	
	|	ОтчетОРозничныхПродажах.Ссылка,
	|	ОтчетОРозничныхПродажах.Ссылка КАК ОтчетОРозничныхПродажах
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияПодарочныхСертификатов.ПодарочныеСертификаты КАК ТЧПодарочныеСертификаты
	|		ПО (ТЧПодарочныеСертификаты.Ссылка.КассоваяСмена = ОтчетОРозничныхПродажах.КассоваяСмена)
	|			И (ТЧПодарочныеСертификаты.Ссылка.Проведен)
	|			И (ТЧПодарочныеСертификаты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит))
	|ГДЕ
	|	ОтчетОРозничныхПродажах.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРозничныхПродажах.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(ТЧПодарочныеСертификаты.Сумма), 0),
	|	0,
	|	ОтчетОРозничныхВозвратах.Ссылка КАК Ссылка,
	|	ОтчетОРозничныхПродажах.Ссылка КАК ОтчетОРозничныхПродажах	
	|ИЗ
	|	Документ.ОтчетОРозничныхВозвратах КАК ОтчетОРозничныхВозвратах
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах 
	|	ПО ОтчетОРозничныхПродажах.КассоваяСмена = ОтчетОРозничныхВозвратах.КассоваяСмена
	|		И ОтчетОРозничныхПродажах.НалогообложениеНДС = ОтчетОРозничныхВозвратах.НалогообложениеНДС		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияПодарочныхСертификатов.ПодарочныеСертификаты КАК ТЧПодарочныеСертификаты
	|		ПО (ТЧПодарочныеСертификаты.Ссылка.КассоваяСмена = ОтчетОРозничныхПродажах.КассоваяСмена)
	|			И (ТЧПодарочныеСертификаты.Ссылка.Проведен)
	|			И (ТЧПодарочныеСертификаты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит))
	|ГДЕ
	|	ОтчетОРозничныхВозвратах.Ссылка В(&МассивОбъектов)
	|	И ОтчетОРозничныхПродажах.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРозничныхПродажах.Ссылка,
	|	ОтчетОРозничныхВозвратах.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(ТЧПодарочныеСертификаты.Сумма), 0),
	|	ОтчетОРозничныхПродажах.Ссылка,
	|	ОтчетОРозничныхПродажах.Ссылка КАК ОтчетОРозничныхПродажах	
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратПодарочныхСертификатов.ПодарочныеСертификаты КАК ТЧПодарочныеСертификаты
	|		ПО (ТЧПодарочныеСертификаты.Ссылка.КассоваяСмена = ОтчетОРозничныхПродажах.КассоваяСмена)
	|			И (ТЧПодарочныеСертификаты.Ссылка.Проведен)
	|			И (ТЧПодарочныеСертификаты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит))
	|ГДЕ
	|	ОтчетОРозничныхПродажах.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРозничныхПродажах.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(ТЧПодарочныеСертификаты.Сумма), 0),
	|	ОтчетОРозничныхВозвратах.Ссылка КАК Ссылка,
	|	ОтчетОРозничныхПродажах.Ссылка КАК ОтчетОРозничныхПродажах	
	|ИЗ
	|	Документ.ОтчетОРозничныхВозвратах КАК ОтчетОРозничныхВозвратах
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах 
	|	ПО ОтчетОРозничныхПродажах.КассоваяСмена = ОтчетОРозничныхВозвратах.КассоваяСмена
	|		И ОтчетОРозничныхПродажах.НалогообложениеНДС = ОтчетОРозничныхВозвратах.НалогообложениеНДС	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратПодарочныхСертификатов.ПодарочныеСертификаты КАК ТЧПодарочныеСертификаты
	|		ПО (ТЧПодарочныеСертификаты.Ссылка.КассоваяСмена = ОтчетОРозничныхПродажах.КассоваяСмена)
	|			И (ТЧПодарочныеСертификаты.Ссылка.Проведен)
	|			И (ТЧПодарочныеСертификаты.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит))
	|ГДЕ
	|	ОтчетОРозничныхВозвратах.Ссылка В(&МассивОбъектов)
	|	И ОтчетОРозничныхПродажах.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОРозничныхПродажах.Ссылка,
	|	ОтчетОРозничныхВозвратах.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиИВозвраты.Ссылка КАК Ссылка,
	|	ПродажиИВозвраты.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах,
	|	СУММА(ПродажиИВозвраты.СуммаПродаж) КАК СуммаПродаж,
	|	СУММА(ПродажиИВозвраты.СуммаПродажНДС) КАК СуммаПродажНДС,
	|	СУММА(ПродажиИВозвраты.СуммаПродажОтчет) КАК СуммаПродажОтчет,
	|	СУММА(ПродажиИВозвраты.СуммаПродажОтчетНДС) КАК СуммаПродажОтчетНДС,
	|	СУММА(ПродажиИВозвраты.СуммаВозвратов) КАК СуммаВозвратов,
	|	СУММА(ПродажиИВозвраты.СуммаВозвратовНДС) КАК СуммаВозвратовНДС,
	|	СУММА(ПродажиИВозвраты.СуммаПродажПодарочныхСертификатов) КАК СуммаПродажПодарочныхСертификатов,
	|	СУММА(ПродажиИВозвраты.СуммаВозвратовПодарочныхСертификатов) КАК СуммаВозвратовПодарочныхСертификатов
	|ПОМЕСТИТЬ ПродажиВозвратыСгруппировано
	|ИЗ
	|	ПродажиИВозвраты КАК ПродажиИВозвраты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиИВозвраты.Ссылка,
	|	ПродажиИВозвраты.ОтчетОРозничныхПродажах	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах КАК Ссылка,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.Дата КАК ДатаДокумента,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.Номер КАК НомерДокумента,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.Валюта КАК Валюта,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.КассаККМ КАК КассаККМ,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.КассаККМ.ТипКассы КАК ТипКассы,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.КассаККМ.Представление КАК ККМПредставление,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.КассаККМ.СерийныйНомер КАК СерийныйНомер,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.КассаККМ.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.Организация КАК Организация,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.Организация.Префикс КАК Префикс,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.Ответственный.ФизическоеЛицо КАК Ответственный,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.КассоваяСмена КАК КассоваяСмена,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.КассоваяСмена.НачалоКассовойСмены КАК НачалоСмены,
	|	ПродажиВозвратыСгруппировано.ОтчетОРозничныхПродажах.КассоваяСмена.ОкончаниеКассовойСмены КАК ОкончаниеСмены,
	|	ПродажиВозвратыСгруппировано.СуммаПродаж КАК СуммаПродаж,
	|	ПродажиВозвратыСгруппировано.СуммаПродажНДС КАК СуммаПродажНДС,
	|	ПродажиВозвратыСгруппировано.СуммаПродажОтчет КАК СуммаПродажОтчет,
	|	ПродажиВозвратыСгруппировано.СуммаПродажОтчетНДС КАК СуммаПродажОтчетНДС,
	|	ПродажиВозвратыСгруппировано.СуммаВозвратов КАК СуммаВозвратов,
	|	ПродажиВозвратыСгруппировано.СуммаВозвратовНДС КАК СуммаВозвратовНДС,
	|	ПродажиВозвратыСгруппировано.СуммаПродажПодарочныхСертификатов КАК СуммаПродажПодарочныхСертификатов,
	|	ПродажиВозвратыСгруппировано.СуммаВозвратовПодарочныхСертификатов КАК СуммаВозвратовПодарочныхСертификатов
	|ИЗ
	|	ПродажиВозвратыСгруппировано КАК ПродажиВозвратыСгруппировано
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО ПродажиВозвратыСгруппировано.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураДанныхДляПечати = Новый Структура("РезультатЗапроса", РезультатЗапроса);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции	

// Функция получает данные для формирования печатной формы КМ-3.
// 
// Параметры:
//  ПараметрыПечати	- Структура - Дополнительные настройки печати
//  МассивОбъектов - Массив Из ДокументСсылка - Ссылки на документы
// 
// Возвращаемое значение:
// 	Структура:
//		* РезультатЗапроса - Массив Из РезультатЗапроса - Содержит информацию для заполнения печатной формы
Функция ПолучитьДанныеДляПечатнойФормыКМ3(ПараметрыПечати, МассивОбъектов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// МассивОбъектов содержит документы одного вида.	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Номер КАК Номер,
	|	Док.Дата КАК ДатаДокумента,
	|	Док.КассаККМ КАК КассаККМ,
	|	Док.КассаККМ.ТипКассы КАК ТипКассы,
	|	Док.КассаККМ.Представление КАК Покупатель,
	|	Док.Ответственный.ФизическоеЛицо КАК КассирККМ,
	|	Док.Валюта КАК Валюта,
	|	Док.Организация КАК Организация,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	Док.Организация.Представление КАК Поставщик,
	|	Док.КассаККМ.СерийныйНомер КАК СерийныйНомерККМ,
	|	Док.КассаККМ.РегистрационныйНомер КАК РегистрационныйНомерККМ,
	|	Док.КассаККМ.Наименование КАК ПредставлениеККМ
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО Док.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	Док.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Номер КАК Номер,
	|	Док.Дата КАК ДатаДокумента,
	|	Док.КассаККМ КАК КассаККМ,
	|	Док.КассаККМ.ТипКассы КАК ТипКассы,
	|	Док.КассаККМ.Представление КАК Покупатель,
	|	Док.Ответственный.ФизическоеЛицо КАК КассирККМ,
	|	Док.Валюта КАК Валюта,
	|	Док.Организация КАК Организация,
	|	ТаблицаОтветственныеЛица.РуководительНаименование КАК Руководитель,
	|	ТаблицаОтветственныеЛица.РуководительДолжность КАК ДолжностьРуководителя,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	Док.Организация.Представление КАК Поставщик,
	|	Док.КассаККМ.СерийныйНомер КАК СерийныйНомерККМ,
	|	Док.КассаККМ.РегистрационныйНомер КАК РегистрационныйНомерККМ,
	|	Док.КассаККМ.Наименование КАК ПредставлениеККМ
	|ИЗ
	|	Документ.ОтчетОРозничныхВозвратах КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО Док.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	Док.Ссылка В(&МассивОбъектов)	
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокОтчетОРозничныхПродажах.Ссылка КАК Документ,
	|	ФискальныеОперации.НомерЧекаККМ КАК НомерЧека,
	|	ДокЧек.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ДокОтчетОРозничныхПродажах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат КАК ДокЧек
	|		ПО ДокОтчетОРозничныхПродажах.КассоваяСмена = ДокЧек.КассоваяСмена
	|			И (ДокЧек.Проведен)
	|			И (ДокЧек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит))
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|		ПО ФискальныеОперации.ДокументОснование = ДокЧек.ЧекККМ
	|ГДЕ
	|	ДокОтчетОРозничныхПродажах.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокОтчетОРозничныхПродажах.Ссылка КАК Документ,
	|	ФискальныеОперации.НомерЧекаККМ КАК НомерЧека,
	|	ДокЧек.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ДокОтчетОРозничныхПродажах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратПодарочныхСертификатов КАК ДокЧек
	|		ПО ДокОтчетОРозничныхПродажах.КассоваяСмена = ДокЧек.КассоваяСмена
	|			И (ДокЧек.Проведен)
	|			И (ДокЧек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит))
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|		ПО ФискальныеОперации.ДокументОснование = ДокЧек.РеализацияПодарочныхСертификатов
	|ГДЕ
	|	ДокОтчетОРозничныхПродажах.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокОтчетОРозничныхВозвратах.Ссылка КАК Документ,
	|	ФискальныеОперации.НомерЧекаККМ КАК НомерЧека,
	|	ДокЧек.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ОтчетОРозничныхВозвратах КАК ДокОтчетОРозничныхВозвратах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат КАК ДокЧек
	|		ПО ДокОтчетОРозничныхВозвратах.КассоваяСмена = ДокЧек.КассоваяСмена
	|			И (ДокЧек.Проведен)
	|			И (ДокЧек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит))
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|		ПО ФискальныеОперации.ДокументОснование = ДокЧек.ЧекККМ
	|ГДЕ
	|	ДокОтчетОРозничныхВозвратах.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокОтчетОРозничныхВозвратах.Ссылка КАК Документ,
	|	ФискальныеОперации.НомерЧекаККМ КАК НомерЧека,
	|	ДокЧек.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ОтчетОРозничныхВозвратах КАК ДокОтчетОРозничныхВозвратах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратПодарочныхСертификатов КАК ДокЧек
	|		ПО ДокОтчетОРозничныхВозвратах.КассоваяСмена = ДокЧек.КассоваяСмена
	|			И (ДокЧек.Проведен)
	|			И (ДокЧек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит))
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|		ПО ФискальныеОперации.ДокументОснование = ДокЧек.РеализацияПодарочныхСертификатов
	|ГДЕ
	|	ДокОтчетОРозничныхВозвратах.Ссылка В(&МассивОбъектов)
	|УПОРЯДОЧИТЬ ПО
	|	Документ
	|ИТОГИ ПО
	|	Документ";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхДляПечати = Новый Структура("РезультатЗапроса", РезультатЗапроса);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

// Определяет по документу закупки, применяет ли организация Патент
// 
// Параметры:
//  ДокументЗакупки - ДокументСсылка - Документ закупки
// 
// Возвращаемое значение:
//  Булево - Документ закупки по Патенту
Функция ДокументЗакупкиПоПатенту(ДокументЗакупки) Экспорт
	
	ДокументЗакупкиПоПатенту = Ложь;
	
	Если ТипЗнч(ДокументЗакупки) = Тип("ДокументСсылка.ЗаказПоставщику")
		ИЛИ ТипЗнч(ДокументЗакупки) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
		ИЛИ ТипЗнч(ДокументЗакупки) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
		
		ЗакупкаПодДеятельность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументЗакупки, "ЗакупкаПодДеятельность");
		Если ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаПоПатенту Тогда
			ДокументЗакупкиПоПатенту = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокументЗакупкиПоПатенту;
	
КонецФункции

// Возвращает заводской номер ФН
// 
// Параметры:
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Идентификатор устройства
// 
// Возвращаемое значение:
//  Строка - номер ФН
Функция ЗаводскойНомерФискальногоНакопителя(ИдентификаторУстройства) Экспорт
	
	ЗаводскойНомерФН = "";

	Если ОбщегоНазначенияБПО.ИспользуетсяЧекопечатающиеУстройства() Тогда
		МодульОборудованиеЧекопечатающиеУстройства = ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройства");
		ПараметрыРегистрации = МодульОборудованиеЧекопечатающиеУстройства.ПараметрыРегистрацииУстройства(ИдентификаторУстройства);
		Если ПараметрыРегистрации.Свойство("ЗаводскойНомерФН") И ЗначениеЗаполнено(ПараметрыРегистрации.ЗаводскойНомерФН) Тогда
			ЗаводскойНомерФН = ПараметрыРегистрации.ЗаводскойНомерФН;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗаводскойНомерФН;
	
КонецФункции

// По переданному источнику данных вычисляет ключи видов продукции ИС для товарных позиций.
// 
// Параметры:
//  ИсточникТоварныхПозиций - ДокументСсылка.РеализацияТоваровУслуг, ДокументОбъект.РеализацияТоваровУслуг, ДокументСсылка.ЧекККМ, ДокументОбъект.ЧекККМ, Массив Из СправочникСсылка.Номенклатура - Источник откуда необходимо получить товарые позиции.
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//    *Ключ - СправочникСсылка.Номенклатура -
//    *Значение - СправочникСсылка.КлючиВидовПродукцииИС - Ключи видов продукции.
//
Функция КлючиВидовПродукцииИСТоварныхПозицийДокументаПродажи(ИсточникТоварныхПозиций) Экспорт
	
	ВидыПродукцииИС = Новый Соответствие;
	Запрос = Неопределено;
	Если ТипЗнч(ИсточникТоварныхПозиций) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции, ЗНАЧЕНИЕ(Справочник.КлючиВидовПродукцииИС.ПустаяСсылка)) КАК
		|		ВидПродукцииИС
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО Товары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|	И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ ОписаниеНоменклатурыИС.КлючВидовПродукции = ЗНАЧЕНИЕ(Справочник.КлючиВидовПродукцииИС.ПустаяСсылка)";
		Запрос.УстановитьПараметр("Ссылка", ИсточникТоварныхПозиций);
	
	ИначеЕсли ТипЗнч(ИсточникТоварныхПозиций) = Тип("ДокументСсылка.ЧекККМ") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции, ЗНАЧЕНИЕ(Справочник.КлючиВидовПродукцииИС.ПустаяСсылка)) КАК
		|		ВидПродукцииИС
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО Товары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|	И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ ОписаниеНоменклатурыИС.КлючВидовПродукции = ЗНАЧЕНИЕ(Справочник.КлючиВидовПродукцииИС.ПустаяСсылка)";
		Запрос.УстановитьПараметр("Ссылка", ИсточникТоварныхПозиций);
	
	ИначеЕсли ТипЗнч(ИсточникТоварныхПозиций) = Тип("ДокументОбъект.РеализацияТоваровУслуг") 
			Или ТипЗнч(ИсточникТоварныхПозиций) = Тип("ДокументОбъект.ЧекККМ") Тогда
			
		ТаблицаТоварыДляПроверки = ИсточникТоварныхПозиций.Товары.ВыгрузитьКолонки("Номенклатура");
		ТаблицаТоварыДляПроверки.Свернуть("Номенклатура");
		ТоварыДляПроверки = ТаблицаТоварыДляПроверки.ВыгрузитьКолонку("Номенклатура");

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОписаниеНоменклатурыИС.Номенклатура КАК Номенклатура,
		|	ОписаниеНоменклатурыИС.КлючВидовПродукции КАК ВидПродукцииИС
		|ИЗ
		|	РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|ГДЕ
		|	ОписаниеНоменклатурыИС.Номенклатура В (&Номенклатура)";
		Запрос.УстановитьПараметр("Номенклатура", ТоварыДляПроверки);
		
	ИначеЕсли ТипЗнч(ИсточникТоварныхПозиций) = Тип("Массив") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОписаниеНоменклатурыИС.Номенклатура КАК Номенклатура,
		|	ОписаниеНоменклатурыИС.КлючВидовПродукции КАК ВидПродукцииИС
		|ИЗ
		|	РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|ГДЕ
		|	ОписаниеНоменклатурыИС.Номенклатура В (&Номенклатура)";
		Запрос.УстановитьПараметр("Номенклатура", ИсточникТоварныхПозиций);
		
	КонецЕсли;
	
	Если Не Запрос = Неопределено Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ВидыПродукцииИС.Вставить(Выборка.Номенклатура, Выборка.ВидПродукцииИС);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ВидыПродукцииИС;
КонецФункции

// Обработчик ПриИзмененииЭлемента
// Параметры:
//	Форма - ФормаКлиентскогоПриложения
//	Элемент - ЭлементыФормы
//	ДополнительныеПараметры - Структура
Процедура ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры = Неопределено) Экспорт

#Область РозничнаяПродажаТабачнойПродукцииТолькоПоМРЦ

	КонтрольныеЭлементы = Новый Массив();
	КонтрольныеЭлементы.Добавить("Дата");
	КонтрольныеЭлементы.Добавить("Контрагент");
	КонтрольныеФормы = РозничныеПродажиКлиентСерверЛокализация.ФормыСоВстроеннымМеханизмомМРЦ();
	
	Если КонтрольныеЭлементы.Найти(Элемент) <> Неопределено
		И КонтрольныеФормы.Найти(Форма.ИмяФормы) <> Неопределено Тогда
		
		ИмяКонтрольногоРеквизита = РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаИспользоватьРозничныеПродажиТабачнойПродукцииТолькоПоМРЦ();
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяКонтрольногоРеквизита) Тогда
			ТекДата = Форма.Объект.Дата;
			ТекКонтрагент = Форма.Объект.Контрагент;	// СправочникСсылка.Контрагенты
			ТекЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекКонтрагент, "ЮрФизЛицо");
			
			Форма[ИмяКонтрольногоРеквизита] = КонтролироватьЦенуПродажиТабачнойПродукции(?(ЗначениеЗаполнено(ТекДата),ТекДата, ТекущаяДатаСеанса()))
				И ТекЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо");
		КонецЕсли;
		
	КонецЕсли;
	
#КонецОбласти
	
КонецПроцедуры

//-- Локализация

// Проверяет, допустимы ли в документе товары
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка - Документ для проверки
// 
// Возвращаемое значение:
//  Булево - Допустимы товары без марок в документе
Функция ДопустимыТоварыБезМарокВДокументе(ДокументСсылка) Экспорт
	
	ДопустимыТоварыБезМарокДляДокумента = Ложь;
	
	//++ Локализация
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента")
		ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		
		ДопустимыТоварыБезМарокДляДокумента = Истина;
	КонецЕсли;
	//-- Локализация
	
	Возврат ДопустимыТоварыБезМарокДляДокумента;
	
КонецФункции

// Текст запроса для получения документов по распоряжению (заказу клиента)
// 
// Возвращаемое значение:
//  Строка - Текст запроса документы по распоряжению
Функция ТекстЗапросаДокументыПоРаспоряжению() Экспорт
	
	//@skip-check bsl-ql-hub
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов
	|ПОМЕСТИТЬ ВТОбъектыРасчетов
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|ГДЕ
	|	ОбъектыРасчетов.Объект = &ОбъектРасчетов
	|	И НЕ ОбъектыРасчетов.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Дата КАК Дата
	|ПОМЕСТИТЬ ВТДокументыПоРаспоряжению
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.ЗаказКлиента = &Распоряжение
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ПриходныйКассовыйОрдер.Ссылка.Дата
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдер
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ПриходныйКассовыйОрдер.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов
	|			И (ПриходныйКассовыйОрдер.Ссылка.Проведен)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОперацияПоПлатежнойКарте.Ссылка,
	|	ОперацияПоПлатежнойКарте.Ссылка.Дата
	|ИЗ
	|	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКарте
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ОперацияПоПлатежнойКарте.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов
	|			И (ОперацияПоПлатежнойКарте.Ссылка.Проведен)
	//++ Локализация
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОперацияПоЯндексКассе.Ссылка,
	|	ОперацияПоЯндексКассе.Ссылка.Дата
	|ИЗ
	|	Документ.ОперацияПоЯндексКассе КАК ОперацияПоЯндексКассе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ОперацияПоЯндексКассе.ОбъектРасчетов = ОбъектыРасчетов.ОбъектРасчетов
	|			И (ОперацияПоЯндексКассе.Ссылка.Проведен)
	//-- Локализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПоРаспоряжению.Ссылка КАК Ссылка,
	|	ДокументыПоРаспоряжению.Дата КАК Дата,
	|	НАЧАЛОПЕРИОДА(ДокументыПоРаспоряжению.Дата, ДЕНЬ) КАК ДатаДень
	|ИЗ
	|	ВТДокументыПоРаспоряжению КАК ДокументыПоРаспоряжению
	//++ Локализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьЧековККТ КАК ОчередьЧековККТ
	|		ПО ДокументыПоРаспоряжению.Ссылка = ОчередьЧековККТ.ДокументОснование
	|ГДЕ
	|	ОчередьЧековККТ.ДокументОснование ЕСТЬ NULL
	//-- Локализация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументыПоРаспоряжению.Дата УБЫВ
	|ИТОГИ ПО
	|	ДатаДень";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает систему налогообложения организации на дату
// 
// Параметры:
// 	Организация - СправочникСсылка.Организации - Организация, для которой определяется система налогообложения
// 	Дата - Дата - Дата, на которую определяется система налогообложения
// Возвращаемое значение:
// 	ПеречислениеСсылка.ТипыСистемНалогообложенияККТ - Система налогообложения для параметров фискальных чеков
Функция СистемаНалогообложенияФискальнойОперации(Организация, Дата = Неопределено) Экспорт
	
	Если ТипЗнч(Организация) <> Тип("СправочникСсылка.Организации")
		ИЛИ НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Т.СистемаНалогообложения КАК СистемаНалогообложения,
	|	&ПараметрДляПодстановки КАК ОбъектНалогообложенияУСН
	|ИЗ
	|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&ТекущаяДата, Организация = &Организация) КАК Т
	|";
//++ Локализация
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПараметрДляПодстановки", "ЕСТЬNULL(Т2.ОбъектНалогообложенияУСН, НЕОПРЕДЕЛЕНО)");
	ТекстЗапроса = ТекстЗапроса + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаУСН.СрезПоследних(&ТекущаяДата, Организация = &Организация) КАК Т2
	|		ПО Т.Организация = Т2.Организация
	|";
//-- Локализация

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПараметрДляПодстановки", Неопределено);
	
	Если Дата = Неопределено Тогда
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Иначе
		Запрос.УстановитьПараметр("ТекущаяДата", Дата);
	КонецЕсли;
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Организация,
		"ГоловнаяОрганизация, ОбособленноеПодразделение");
		
	Если РеквизитыОрганизации.ОбособленноеПодразделение = Истина Тогда
		Запрос.УстановитьПараметр("Организация", РеквизитыОрганизации.ГоловнаяОрганизация);
	Иначе
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	ДанныеСистемыНалогообложения = Запрос.Выполнить().Выбрать();
	ДанныеСистемыНалогообложения.Следующий();
	
	СистемаНалогообложения = Неопределено;
	
	Если ДанныеСистемыНалогообложения.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда
		
		СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;

//++ Локализация		
	ИначеЕсли ДанныеСистемыНалогообложения.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
		
		Если ДанныеСистемыНалогообложения.ОбъектНалогообложенияУСН = Перечисления.ОбъектыНалогообложенияПоУСН.Доходы Тогда
			
			СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
			
		ИначеЕсли ДанныеСистемыНалогообложения.ОбъектНалогообложенияУСН = Перечисления.ОбъектыНалогообложенияПоУСН.ДоходыМинусРасходы Тогда
			
			СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход;
			
		КонецЕсли;
//-- Локализация
		
	КонецЕсли;
	
	Возврат СистемаНалогообложения;
	
КонецФункции

// Определяет, является ли номенклатура алкогольной продукцией, имеющая уникальный идентификатор (маркируовку)
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Проверяемая номенклатура
// 
// Возвращаемое значение:
//  Булево - Истина, если номенклатура является алкогольной продукцией, имеющая уникальный идентификатор (маркируовку)
Функция АлкогольнаяПродукцияЕГАИСМаркируемая(Номенклатура) Экспорт
	
	//++ Локализация
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.ВидАлкогольнойПродукции КАК ВидПродукции,
	|	Номенклатура.ВидАлкогольнойПродукции.Маркируемый КАК ВидПродукцииМаркируемый
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И Номенклатура.ВидАлкогольнойПродукции.Маркируемый = ИСТИНА";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	//-- Локализация
	
	//@skip-check bsl-legacy-check-method-for-statements-after-return
	Возврат Ложь;

КонецФункции

// Возвращает возможность печатать отдельный слип чек эквайринговой операции.
// Если Истина, то предполагается, что слип-чек эквайрингового терминала выводится отдельно и
// фискальный чек не содержит данные эквайринговой операции.
// 
// Возвращаемое значение:
// 	Булево
Функция ПечататьОтдельныйСлипЧекЭквайринговойОперации() Экспорт

	Результат = Ложь;
	
	//++ Локализация
	
	Результат = ПолучитьФункциональнуюОпцию("ПечататьОтдельныйСлипЧекЭквайринговойОперации");
	
	//-- Локализация
	
	Возврат Результат;

КонецФункции

// Проверяет, разрешена ли в документе продажа подарочного сертификата в зависимости
// от хозяйственной операции документа.
// 
// Параметры:
//  ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция, по которой проверяется
//  	разрешена ли продажа подарочного сертификата в документе.
// 
// Возвращаемое значение:
//  Булево - Разрешена продажа подарочного сертификата в документе
Функция РазрешенаПродажаПодарочногоСертификатаВДокументе(ХозяйственнаяОперация) Экспорт
	
	РазрешенаПродажаПодарочногоСертификатаВДокументе = Ложь;
	
	//++ Локализация
	
	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов")
		И ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты")
		И (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента
			ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту) Тогда
		
		РазрешенаПродажаПодарочногоСертификатаВДокументе = Истина;
	КонецЕсли;
	//-- Локализация
	
	Возврат РазрешенаПродажаПодарочногоСертификатаВДокументе;
	
КонецФункции

// Записывает объект формы
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма клиентского приложения:
//  * Объект - ДокументОбъект - Основной реквизит формы документа
//  ПараметрыФискализации - Структура -
//  ПараметрыЗаписи - Структура -
//  УспешноЗаписанДокумент - Булево - признак успешной записи документа
Процедура ЗаписатьФискальнуюОперацию(Форма, ПараметрыФискализации, ПараметрыЗаписи, УспешноЗаписанДокумент) Экспорт
	
	//++ Локализация
	Если Не УспешноЗаписанДокумент Тогда
		Возврат;
	КонецЕсли;
		
	Объект = Форма.Объект;
	Если (ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ")) Тогда
		ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Форма);
		ОбщегоНазначенияИС.СписатьОстатокПоВскрытымПотребительскимУпаковкам(Объект, ПараметрыСканирования);
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Проверяет данные маркированных товаров документа перед выполнением фискальной операции
//
// Параметры:
//  Объект - ДокументОбъект - Объект проверяемого документа
//  ДополнительныеПараметры - Структура Из КлючИЗначение - Произвольная структура для передачи данных из клиентского контекста
//
// Возвращаемое значение:
//  Булево - 
//
Функция ПроверкаДанныхМаркированногоТовараДокумента(Объект, ДополнительныеПараметры = Неопределено) Экспорт
	Результат = Истина;
	//++ Локализация

	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Результат = ПроверкаДанныхМаркированногоТовараДокументаКорректировкаРеализации(Объект, ДополнительныеПараметры);
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМКоррекции") Тогда
		Результат = ПроверкаДанныхМаркированногоТовараДокументаЧекККМКоррекции(Объект, ДополнительныеПараметры);
	КонецЕсли;
	
	//-- Локализация
	Возврат Результат;
КонецФункции

#КонецОбласти

//++ Локализация

#Область РозничнаяПродажаТабачнойПродукцииТолькоПоМРЦ

// Обновляет реквизиты формы, при необходимости добавляет их. 
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - список форм в методе РозничныеПродажиКлиентСерверЛокализация.ФормыСоВстроеннымМеханизмомМРЦ()
Процедура ОбновитьПризнакПродажиТабачнойПродукцииТолькоПоМРЦ(Форма) Экспорт
	
	ИзменитьФормуПродажаТабачнойПродукцииТолькоПоМРЦ(Форма);
	
КонецПроцедуры

// Признак вида продукции МРЦ
// Параметры:
//	Форма - ФормаКлиентскогоПриложения
//	СтрокаТЧ - СтрокаТабличнойЧасти:
//	*ВидПродукцииИС - СправочникСсылка.ВидыПродукцииИС
// Возвращаемое значение:
//	Булево
Функция ВСтрокеВидПродукцииСМРЦ(Форма, СтрокаТЧ) Экспорт
	
	Результат = Ложь;
	
	Если ТипЗнч(Форма) <> Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если РозничныеПродажиКлиентСерверЛокализация.ФормыСоВстроеннымМеханизмомМРЦ().Найти(Форма.ИмяФормы) <> Неопределено
		И РозничныеПродажиКлиентСерверЛокализация.РозничныеПродажиТабачнойПродукцииТолькоПоМРЦ(Форма) Тогда
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Отключение скидки для товара с МРЦ
// Параметры:
//	НоваяСтрока - СтрокаТабличнойЧасти
// Товар - см. СкидкиНаценкиСервер.ПрименитьЗначениеСкидкиКТовару.Товар
// ПараметрыРасчета - Структура:
//	*Объект - ДанныеФормыСтруктура:
//	**Контрагент - СправочникСсылка.Контрагенты
Процедура ПрименитьЗначениеСкидкиКТовару(НоваяСтрока, Товар, ПараметрыРасчета) Экспорт

	ТипВызывающегоОбъект = ТипЗнч(ПараметрыРасчета.Объект.Ссылка);
	Если ТипыОбъектовДляОчисткиСкидкиПоМРЦ().Найти(ТипВызывающегоОбъект) = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если КонтролироватьЦенуПродажиТабачнойПродукции(ПараметрыРасчета.Объект.Дата)
		И (ТипЗнч(ПараметрыРасчета.Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ")
			ИЛИ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыРасчета.Объект, "Контрагент")
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыРасчета.Объект.Контрагент,"ЮрФизЛицо") = 
						ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо")) Тогда
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Товар, "ВидПродукцииИС") Тогда
			Если КонструкторИСМПОбщегоНазначенияКлиентСервер.ДоступноПолеМРЦ(Товар.ВидПродукцииИС) Тогда
				НоваяСтрока.Действует = Ложь;
			КонецЕсли;
		Иначе
			ТекНоменклатура = Товар.Номенклатура;	// СправочникСсылка.Номенклатура
			ОписаниеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(ТекНоменклатура)[ТекНоменклатура];
			Если КонструкторИСМПОбщегоНазначенияКлиентСервер.ДоступноПолеМРЦ(ОписаниеНоменклатуры.КлючВидовПродукции) Тогда
				НоваяСтрока.Действует = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Определяет по дате документа, нужно ли в документе контролировать цену продажи табачной продукции по МРЦ
// 
// Параметры:
//	ДатаДокумента - Дата - Дата документа для определения, нужно ли в нем контролировать цену продажи табачной продукции
//	по РМЦ для.
// 
// Возвращаемое значение:
//  Булево - Контролировать МРЦДля табачной продукции локализация
Функция КонтролироватьЦенуПродажиТабачнойПродукции(ДатаДокумента) Экспорт
	
	КонтролироватьЦенуПродажиТабачнойПродукции = Ложь;
	
	ДатаКонтроля = ПолучитьФункциональнуюОпцию("ДатаРозничнойПродажиТабачнойПродукцииТолькоПоМРЦ");
	
	Если ЗначениеЗаполнено(ДатаКонтроля)
		И ДатаКонтроля <= ДатаДокумента Тогда
		
		КонтролироватьЦенуПродажиТабачнойПродукции = Истина;
	КонецЕсли;
	
	Возврат КонтролироватьЦенуПродажиТабачнойПродукции;
	
КонецФункции

// Определяет, нужно ли для переданного вида продукции ИС контролировать цену продажи по МРЦ
// 
// Параметры:
//  ВидПродукцииИС - СправочникСсылка.ВидыПродукцииИС - Вид продукции ИС
// 
// Возвращаемое значение:
//  Булево - Контролировать цену продажи по МРЦ для вида продукции ИС
Функция КонтролироватьЦенуПродажиПоМРЦДляВидаПродукцииИС(ВидПродукцииИС) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ДоступноПолеМРЦ(ВидПродукцииИС);
	
КонецФункции

// Проверить в РМК корректность цены продажи м МРЦ для  табачной продукции.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма:
//	* Объект - ДокументОбъект.ЧекККМ, ДокументОбъект.РеализацияТоваровУслуг - Чек ККМ, Реализация товаров и услуг
//  ИмяТаблицыШтрихкодовУпаковок - Строка - Имя таблицы штрихкодов упаковок документа
//  КонтрольПоТекущейДате - Булево - Требуется контроль по текущей дате, вместо даты документа
//  УдалитьНекорректныеШтрихкодыУпаковок - Булево - Удалять из документа некорректные штрихкоды упаковок, если Истина
// 
// Возвращаемое значение:
//  Булево - Истина, нет ошибок в цене продажи и МРЦ
Функция ПроверитьКорректностьЦеныПродажиИМРЦТабачнойПродукции(Форма, ИмяТаблицыШтрихкодовУпаковок,
	КонтрольПоТекущейДате = Ложь, УдалитьНекорректныеШтрихкодыУпаковок = Ложь) Экспорт
	
	РезультатПроверки = Истина;
	
	ИмяРеквизитаФормыКонтроляПродажиПоМРЦ = РозничныеПродажиКлиентСерверЛокализация
		.ИмяРеквизитаИспользоватьРозничныеПродажиТабачнойПродукцииТолькоПоМРЦ();
	
	Если Форма.Объект.Товары.Количество() = 0 Тогда
		Возврат РезультатПроверки;
	ИначеЕсли КонтрольПоТекущейДате И Не КонтролироватьЦенуПродажиТабачнойПродукции(ТекущаяДатаСеанса()) Тогда
		Возврат РезультатПроверки;
	ИначеЕсли Не КонтрольПоТекущейДате
		И Не (ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаФормыКонтроляПродажиПоМРЦ)
			И Форма[ИмяРеквизитаФормыКонтроляПродажиПоМРЦ]) Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Форма);
	
	ИмяКолонкиШтрихкодаУпаковки = РозничныеПродажиКлиентСерверЛокализация.РеквизитШтрихкодаПоТаблицеШтрихкодов(
		ИмяТаблицыШтрихкодовУпаковок);
	ШтрихкодыУпаковок = Форма.Объект[ИмяТаблицыШтрихкодовУпаковок].Выгрузить().ВыгрузитьКолонку(ИмяКолонкиШтрихкодаУпаковки);
	
	ИмяТаблицыТоваров = РозничныеПродажиКлиентСерверЛокализация.ТаблицаТоваровПоФормеМРЦ(Форма.ИмяФормы);
	РезультатПроверкиСкидок = ПроверитьИсправитьНаличиеСкидокОплатБонуснымиБаллами(Форма, ИмяТаблицыТоваров, , Истина);
	
	РезультатПроверкиМинимальнойЦены = ПроверитьШтрихкодыУпаковокНаМинимальнуюЦену(
		Форма,
		ШтрихкодыУпаковок,
		ПараметрыСканирования,
		Истина,
		УдалитьНекорректныеШтрихкодыУпаковок);
	
	ШтрихкодыУпаковок = Форма.Объект[ИмяТаблицыШтрихкодовУпаковок].Выгрузить().ВыгрузитьКолонку(ИмяКолонкиШтрихкодаУпаковки);
	ШтрихкодыУпаковокСМРЦ = ПолучитьШтрихкодыУпаковокСМРЦ(ШтрихкодыУпаковок, ПараметрыСканирования, Истина);
	
	РезультатПроверкиРозничнойЦены = ПроверитьКорректностьРозничнойЦеныПоМРЦ(
		Форма.Объект[ИмяТаблицыТоваров].Выгрузить(),
		ШтрихкодыУпаковокСМРЦ,
		Форма.Объект.ЦенаВключаетНДС);
		
	РезультатПроверки = РезультатПроверкиСкидок И РезультатПроверкиМинимальнойЦены И РезультатПроверкиРозничнойЦены;
	
	ИмяРеквизитаЕстьОшибкаВЦенеПоМРЦ = РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаЕстьОшибкаВЦенеПоМРЦ();
	Если Не РезультатПроверки
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаЕстьОшибкаВЦенеПоМРЦ) Тогда
		Форма[ИмяРеквизитаЕстьОшибкаВЦенеПоМРЦ] = Истина;
	КонецЕсли;
	
	Если РезультатПроверки Тогда
		// Дополнительно установить флаг МРЦ для товаров с корректной ценой
		Для Каждого СтрокаТовары Из Форма.Объект.Товары Цикл
			
			Если КонструкторИСМПОбщегоНазначенияКлиентСервер.ДоступноПолеМРЦ(СтрокаТовары.ВидПродукцииИС) Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяРеквизитаУстановленаМРЦ = РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаУстановленаМРЦ();
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, ИмяРеквизитаУстановленаМРЦ)
				И ЗначениеЗаполнено(СтрокаТовары.Цена) Тогда
				СтрокаТовары[ИмяРеквизитаУстановленаМРЦ] = Истина;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	КлючеваяОперацияИмя = "МРЦ.ПроверкаКорректностиМРЦТабличнойЧасти";
	ОписаниеЛога = Новый Структура;
	ОписаниеЛога.Вставить("Документ", Строка(Форма.Объект.Ссылка));
	ОписаниеЛога.Вставить("Метод", "ПроверитьКорректностьЦеныПродажиИМРЦТабачнойПродукции");
	ОписаниеЛога.Вставить("Результат", РезультатПроверки);
	ОценкаПроизводительности.ЗакончитьЗамерВремени(КлючеваяОперацияИмя, 
		НачалоЗамера,
		ШтрихкодыУпаковокСМРЦ.Количество(), 
		ЗаписатьЗначениеJSON(ОписаниеЛога));
	
	Возврат РезультатПроверки;
	
КонецФункции

// Товары документа реализации с видами продукции ИС.
// 
// Параметры:
//  ДокументРеализации - ДокументСсылка.РеализацияТоваровУслуг - Документ реализации
//  ОтборПоВидуПродукцииИС - Массив Из ПеречислениеСсылка.ВидыПродукцииИС - Необязательный параметр
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Товары документа реализации с видами продукции ИС:
//	* НомерСтроки - Число - Номер строки
//	* Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
//	* Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - Характеристика
//	* Серия - СправочникСсылка.СерииНоменклатуры - Серия
//	* Цена - Число - Цена
//	* ВидПродукцииИС - СправочникСсылка.ВидыПродукцииИС - Вид продукции ИС
//	* Количество - Число - Количество
//	* СуммаАвтоматическойСкидки - Число - Сумма автоматической скидки
//	* ПроцентАвтоматическойСкидки - Число - Процент автоматической скидки
//	* СуммаРучнойСкидки - Число - Сумма ручной скидки
//	* ПроцентРучнойСкидки - Число - Процент ручной скидки
//	* СуммаБонусныхБалловКСписанию - Число - Сумма бонусных баллов к списанию
//	* СуммаБонусныхБалловКСписаниюВВалюте - Число - Сумма бонусных баллов к списанию в валюте
Функция ТоварыДокументаРеализацииСВидамиПродукцииИС(ДокументРеализации, ОтборПоВидуПродукцииИС = Неопределено) Экспорт
	
	Запрос = Новый Запрос;

	ТекстыЗапроса = Новый Массив;
	ТекстыЗапроса.Добавить(ПолучитьТекстЗапросаТоварыПоРеализацииТоваровУслугСВидамиПродукцииИСПоСсылке());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТоварыДокумента.НомерСтроки,
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Цена,
	|	ТоварыДокумента.ВидПродукцииИС,
	|	ТоварыДокумента.Количество,
	|	ТоварыДокумента.СуммаАвтоматическойСкидки,
	|	ТоварыДокумента.ПроцентАвтоматическойСкидки,
	|	ТоварыДокумента.СуммаРучнойСкидки,
	|	ТоварыДокумента.ПроцентРучнойСкидки,
	|	ТоварыДокумента.СуммаБонусныхБалловКСписанию,
	|	ТоварыДокумента.СуммаБонусныхБалловКСписаниюВВалюте,
	|	ТоварыДокумента.СуммаСНДС
	|ИЗ
	|	ТоварыДокумента КАК ТоварыДокумента
	|ГДЕ
	|	&ОтборПоВидуПродукцииИС
	|";	
	УсловиеОтбораПоВидуПродукцииИС = "ИСТИНА";
	Если ТипЗнч(ОтборПоВидуПродукцииИС) = Тип("Массив") И ОтборПоВидуПродукцииИС.Количество() Тогда
		УсловиеОтбораПоВидуПродукцииИС = "ТоварыДокумента.ВидПродукцииИС В (&ОтборПоВидуПродукцииИС)";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоВидуПродукцииИС", УсловиеОтбораПоВидуПродукцииИС);
		Запрос.УстановитьПараметр("ОтборПоВидуПродукцииИС", ОтборПоВидуПродукцииИС); 
	КонецЕсли;
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументРеализации);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Проверить и исправить наличие скидок и оплат бонусными баллами.
// 
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка.РеализацияТоваровУслуг, ДокументОбъект.РеализацияТоваровУслуг -
//  	Форма или документ для проверки.
//  ИмяТаблицыТоваров - Строка - Имя таблицы товаров документа
//  ОчиститьСкидкиОплатуБонуснымиБаллами - Булево - Истина, очищаются скидки и оплаты бонусными баллами по товарам с МРЦ
//  СообщитьОбОшибках - Булево - Истина, сообщать об ошибках
// 
// Возвращаемое значение:
//  Булево - Реузльтат проверки наличия скидок оплат бонусными баллами
Функция ПроверитьИсправитьНаличиеСкидокОплатБонуснымиБаллами(Контекст, ИмяТаблицыТоваров, ОчиститьСкидкиОплатуБонуснымиБаллами = Ложь,
	СообщитьОбОшибках = Ложь) Экспорт
	
	РезультатПроверки = Истина;
	ОбрабатываемыеСтроки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("ВидыПродукцииИС", КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииКоторымДоступноПолеМРЦ());
	
	ТекстыЗапроса = Новый Массив;
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ТекстЗапроса = ПолучитьТекстЗапросаТоварыПоРеализацииТоваровУслугСВидамиПродукцииИСПоСсылке();
		ТекстыЗапроса.Добавить(ТекстЗапроса);
		Запрос.УстановитьПараметр("ДокументСсылка", Контекст);
		
	ИначеЕсли ТипЗнч(Контекст) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		ТекстЗапроса = ПолучитьТекстЗапросаТоварыПоРеализацииТоваровУслугСВидамиПродукцииИСПоОбъекту();
		ТекстыЗапроса.Добавить(ТекстЗапроса);
		Запрос.УстановитьПараметр("ТоварыДокумента", Контекст[ИмяТаблицыТоваров].Выгрузить());
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТоварыДокумента.НомерСтроки,
		|	ТоварыДокумента.Номенклатура,
		|	ТоварыДокумента.Характеристика,
		|	ТоварыДокумента.Серия,
		|	ТоварыДокумента.Цена,
		|	ТоварыДокумента.ВидПродукцииИС,
		|	ТоварыДокумента.Количество,
		|	ТоварыДокумента.СуммаАвтоматическойСкидки,
		|	ТоварыДокумента.ПроцентАвтоматическойСкидки,
		|	ТоварыДокумента.СуммаРучнойСкидки,
		|	ТоварыДокумента.ПроцентРучнойСкидки,
		|	ТоварыДокумента.СуммаБонусныхБалловКСписанию,
		|	ТоварыДокумента.СуммаБонусныхБалловКСписаниюВВалюте
		|ПОМЕСТИТЬ ТоварыДокумента
		|ИЗ
		|	&ТоварыДокумента КАК ТоварыДокумента
		|";
		ТекстыЗапроса.Добавить(ТекстЗапроса);
		Запрос.УстановитьПараметр("ТоварыДокумента", Контекст.Объект[ИмяТаблицыТоваров].Выгрузить());
		
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТоварыДокумента.НомерСтроки,
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Номенклатура.Наименование,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Характеристика.Наименование,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Серия.Наименование,
	|	ТоварыДокумента.Цена,
	|	ТоварыДокумента.ВидПродукцииИС,
	|	ТоварыДокумента.Количество,
	|	ТоварыДокумента.СуммаАвтоматическойСкидки,
	|	ТоварыДокумента.ПроцентАвтоматическойСкидки,
	|	ТоварыДокумента.СуммаРучнойСкидки,
	|	ТоварыДокумента.ПроцентРучнойСкидки,
	|	ТоварыДокумента.СуммаБонусныхБалловКСписанию,
	|	ТоварыДокумента.СуммаБонусныхБалловКСписаниюВВалюте
	|ИЗ
	|	ТоварыДокумента КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.ВидПродукцииИС.ВидПродукцииГИСМТ В (&ВидыПродукцииИС)
	|	И ТоварыДокумента.Цена > 0
	|	И (ТоварыДокумента.СуммаАвтоматическойСкидки <> 0
	|		ИЛИ ТоварыДокумента.ПроцентАвтоматическойСкидки <> 0
	|		ИЛИ ТоварыДокумента.СуммаРучнойСкидки <> 0
	|		ИЛИ ТоварыДокумента.ПроцентРучнойСкидки <> 0
	|		ИЛИ ТоварыДокумента.СуммаБонусныхБалловКСписанию <> 0
	|		ИЛИ ТоварыДокумента.СуммаБонусныхБалловКСписаниюВВалюте <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос.Текст = ТекстЗапроса;
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		РезультатПроверки = Ложь;
		
		Если ОчиститьСкидкиОплатуБонуснымиБаллами
			И ТипЗнч(Контекст) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			Если ТипЗнч(Контекст) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
				СтрокаТЧДокумента = Контекст[ИмяТаблицыТоваров][ВыборкаЗапроса.НомерСтроки-1];
			Иначе
				СтрокаТЧДокумента = Контекст.Объект[ИмяТаблицыТоваров][ВыборкаЗапроса.НомерСтроки-1];
			КонецЕсли;
			
			СтрокаТЧДокумента.ПроцентАвтоматическойСкидки = 0;
			СтрокаТЧДокумента.СуммаАвтоматическойСкидки = 0;
			СтрокаТЧДокумента.ПроцентРучнойСкидки = 0;
			СтрокаТЧДокумента.СуммаРучнойСкидки = 0;
			СтрокаТЧДокумента.СуммаБонусныхБалловКСписанию = 0;
			СтрокаТЧДокумента.СуммаБонусныхБалловКСписаниюВВалюте = 0;
			
			ОбрабатываемыеСтроки.Добавить(СтрокаТЧДокумента);
			
		КонецЕсли;
		
		Если СообщитьОбОшибках Тогда
			
			НаименованиеТовара = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
				ВыборкаЗапроса.НоменклатураНаименование,
				ВыборкаЗапроса.ХарактеристикаНаименование,,
				ВыборкаЗапроса.СерияНаименование);
			
			Если ОчиститьСкидкиОплатуБонуснымиБаллами
				И ТипЗнч(Контекст) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				Шаблон = Нстр("ru = 'В строке №%1 для товара ""%2"" отменена:'");
			Иначе
				Шаблон = Нстр("ru = 'В строке №%1 для товара ""%2"" есть:'");
			КонецЕсли;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				Шаблон,
				ВыборкаЗапроса.НомерСтроки,
				НаименованиеТовара);
			
			Если ЗначениеЗаполнено(ВыборкаЗапроса.СуммаАвтоматическойСкидки) Тогда
				Шаблон = Нстр("ru = 'автоматическая скидка ""%1%"";'");
				
				ТекстСообщения = ТекстСообщения + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					Шаблон,
					ВыборкаЗапроса.ПроцентАвтоматическойСкидки);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаЗапроса.СуммаРучнойСкидки) Тогда
				Шаблон = Нстр("ru = 'ручная скидка ""%1%"";'");
				
				ТекстСообщения = ТекстСообщения + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					Шаблон,
					ВыборкаЗапроса.ПроцентРучнойСкидки);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаЗапроса.СуммаБонусныхБалловКСписанию) Тогда
				Шаблон = Нстр("ru = 'оплата бонусными баллами ""%1"";'");
				
				ТекстСообщения = ТекстСообщения + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					Шаблон,
					ВыборкаЗапроса.СуммаБонусныхБалловКСписаниюВВалюте);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаЗапроса.СуммаАвтоматическойСкидки)
				Или ЗначениеЗаполнено(ВыборкаЗапроса.СуммаРучнойСкидки)
				Или ЗначениеЗаполнено(ВыборкаЗапроса.СуммаБонусныхБалловКСписанию) Тогда
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ОчиститьСкидкиОплатуБонуснымиБаллами И Не СообщитьОбОшибках Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОчиститьСкидкиОплатуБонуснымиБаллами
		И ТипЗнч(Контекст) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Если ТипЗнч(Контекст) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
			ДокументОбъект = Контекст;
			ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента";
		Иначе
			ДокументОбъект = Контекст.Объект;
			ИмяФормы = Контекст.ИмяФормы;
		КонецЕсли;
		
		СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
		
		ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДокументОбъект.Организация);
		ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		Если Не ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК" Тогда
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		КонецЕсли;
		
		Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
			СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
			
			ПараметрыЗаполненияСуммыНДСРеглУпр = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСуммыНДСРеглУпр(
				ДокументОбъект.Валюта,
				ВалютаРегламентированногоУчета,
				ВалютаУправленческогоУчета);
			СтруктураДействий.Вставить("УстановитьСуммуНДСРеглУпр", ПараметрыЗаполненияСуммыНДСРеглУпр);
		КонецЕсли;
		
		Если Не ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК"
			И Не ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК"
			И Не ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
			ЗависимыеРеквизиты = Новый Структура(
				"БезВозвратнойТары",
				"Сумма,СуммаНДС,СуммаСНДС,СуммаАвтоматическойСкидки,СуммаРучнойСкидки,СуммаБонусныхБалловКСписаниюВВалюте");
			СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты);
		КонецЕсли;
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
			ОбрабатываемыеСтроки,
			СтруктураДействий,
			ДокументОбъект[ИмяТаблицыТоваров]);
	
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

// Возвращает таблицу товаров с КМ и МРЦ по списку переданных КМ в метод.
// 
// Параметры:
//  ШтрихкодыУпаковок - Массив Из СправочникСсылка.ШтрихкодыУпаковокТоваров - Штрихкоды упаковок
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.БазовыеПараметрыСканирования
//  БезШтрихкодовУпаковок - Булево - Признак сворачивания таблицы до товаров и значений МРЦ
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить штрихкоды упаковок СМРЦ:
// * Номенклатура - СправочникСсылка.Номенклатура - 
// * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - 
// * Серия - СправочникСсылка.СерииНоменклатуры - 
// * МРЦ - Число - 
// * ВидПродукцииИС - СправочникСсылка.КлючиВидовПродукцииИС - 
// * ШтрихкодУпаковки - СправочникСсылка.ШтрихкодыУпаковокТоваров - Без колонки, если параметр БезШтрихкодовУпаковок = Истина
// * Количество - Число - 
Функция ПолучитьШтрихкодыУпаковокСМРЦ(ШтрихкодыУпаковок, ПараметрыСканирования, БезШтрихкодовУпаковок = Ложь) Экспорт
	
	НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ШтрихкодыУпаковокСМРЦ = Новый ТаблицаЗначений();
	ШтрихкодыУпаковокСМРЦ.Колонки.Добавить(
		"Номенклатура",
		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ШтрихкодыУпаковокСМРЦ.Колонки.Добавить(
		"Характеристика",
		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ШтрихкодыУпаковокСМРЦ.Колонки.Добавить(
		"Серия",
		Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ШтрихкодыУпаковокСМРЦ.Колонки.Добавить(
		"МРЦ",
		РаботаСКурсамиВалют.ОписаниеТипаДенежногоПоля());
	ТипыВидовПродукции = Новый Массив;
	ТипыВидовПродукции.Добавить(Тип("СправочникСсылка.ВидыПродукцииИС"));
	ТипыВидовПродукции.Добавить(Тип("СправочникСсылка.КлючиВидовПродукцииИС"));
	ШтрихкодыУпаковокСМРЦ.Колонки.Добавить("ВидПродукцииИС", Новый ОписаниеТипов(ТипыВидовПродукции));
	ШтрихкодыУпаковокСМРЦ.Колонки.Добавить(
		"ШтрихкодУпаковки",
		Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
	ШтрихкодыУпаковокСМРЦ.Колонки.Добавить(
		"Количество",
		РаботаСКурсамиВалют.ОписаниеТипаДенежногоПоля());
	
	ВложенныеШтрихкодыУпаковок = ШтрихкодированиеИС.ВложенныеШтрихкодыУпаковок(
		ШтрихкодыУпаковок,
		ПараметрыСканирования);
	
	КлючеваяОперацияИмя = "МРЦ.ПолучитьШтрихкодыУпаковокСМРЦ";
	ВесЗамера = ШтрихкодыУпаковок.Количество();
	ОписаниеЛога = Новый Структура;
	ОписаниеЛога.Вставить("Метод", "ПолучитьШтрихкодыУпаковокСМРЦ");
	ОписаниеЛога.Вставить("КоличествоМаркированныхТоваров", ВложенныеШтрихкодыУпаковок.МаркированныеТовары.Количество());
	
	Если ВложенныеШтрихкодыУпаковок.МаркированныеТовары.Количество() = 0 Тогда
		ОписаниеЛога.Вставить("Точка", 1);
		ОценкаПроизводительности.ЗакончитьЗамерВремени(КлючеваяОперацияИмя, 
			НачалоЗамера,
			ВесЗамера, 
			ЗаписатьЗначениеJSON(ОписаниеЛога));
		Возврат ШтрихкодыУпаковокСМРЦ;
	КонецЕсли;
	
	Для Каждого СтрокаМаркированныеТовары Из ВложенныеШтрихкодыУпаковок.МаркированныеТовары Цикл
		Если Не КонструкторИСМПОбщегоНазначенияКлиентСервер.ДоступноПолеМРЦ(СтрокаМаркированныеТовары.ВидПродукции)
			Или СтрокаМаркированныеТовары.СтрокаДерева = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ = ШтрихкодыУпаковокСМРЦ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаМаркированныеТовары);
		
		СтрокаТЧ.ВидПродукцииИС = СтрокаМаркированныеТовары.ВидПродукции;
		СтрокаТЧ.Количество     = СтрокаМаркированныеТовары.Количество;
		СтрокаТЧ.МРЦ = Окр(СтрокаМаркированныеТовары.СтрокаДерева.МРЦ / СтрокаМаркированныеТовары.Количество, 2);
	КонецЦикла;
	
	Если БезШтрихкодовУпаковок Тогда
		ШтрихкодыУпаковокСМРЦ.Свернуть("Номенклатура, Характеристика, Серия, МРЦ, ВидПродукцииИС", "Количество");
	Иначе
		ШтрихкодыУпаковокСМРЦ.Свернуть("Номенклатура, Характеристика, Серия, МРЦ, ВидПродукцииИС, ШтрихкодУпаковки", "Количество");
	КонецЕсли;
	
	ОписаниеЛога.Вставить("Точка", 3);
	ОценкаПроизводительности.ЗакончитьЗамерВремени(КлючеваяОперацияИмя, 
		НачалоЗамера,
		ВесЗамера, 
		ЗаписатьЗначениеJSON(ОписаниеЛога));
	
	Возврат ШтрихкодыУпаковокСМРЦ;
	
КонецФункции

// Проверить штрихкоды упаковок на минимальную цену.
// 
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка.РеализацияТоваровУслуг - Форма или документ для проверки
//  ШтрихкодыУпаковок - Массив Из СправочникСсылка.ШтрихкодыУпаковокТоваров - Штрихкоды упаковок
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.БазовыеПараметрыСканирования
//  СообщитьОбОшибках - Булево - Сообщать об ошибках, если Истина
//  УдалитьНекорректныеШтрихкодыУпаковок - Булево - Удалять из документа некорректные штрихкоды упаковок, если Истина
// 
// Возвращаемое значение:
//  Булево - Истина, если нет КМ с МРЦ, не прошедшую сверку с ЕМРЦ
Функция ПроверитьШтрихкодыУпаковокНаМинимальнуюЦену(Контекст, ШтрихкодыУпаковок, ПараметрыСканирования,
	СообщитьОбОшибках = Ложь, УдалитьНекорректныеШтрихкодыУпаковок = Ложь) Экспорт
	
	РезультатПроверки = Истина;
	
	НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ТаблицаШтрихкодыУпаковок = Новый ТаблицаЗначений;
	ТаблицаШтрихкодыУпаковок.Колонки.Добавить("Штрихкод");
	Для Каждого СтрокаШтрихкодовУпаковок Из ШтрихкодыУпаковок Цикл
		НоваяСтрока = ТаблицаШтрихкодыУпаковок.Добавить();
		НоваяСтрока.Штрихкод = СтрокаШтрихкодовУпаковок;
	КонецЦикла;
	
	РезультатыПроверкиПоТабачнойПродукции = ОбщегоНазначенияИС.МинимальныеЦеныПодакцизныхТоваров(
		ПараметрыСканирования,,
		ТаблицаШтрихкодыУпаковок).РезультатыПроверкиПоТабачнойПродукции;
	
	ТабачнаяПродукцияКУдалениюКМ = Новый Массив;
	
	Для Каждого СтрокаРезультатаПроверкиМинимальныхЦен Из РезультатыПроверкиПоТабачнойПродукции Цикл
		
		Если Не СтрокаРезультатаПроверкиМинимальныхЦен.НарушениеМРЦ Тогда
			Продолжить;
		КонецЕсли;
		
		КоэффициентПересчетаИзУпаковки
			= СтрокаРезультатаПроверкиМинимальныхЦен.МинимальнаяРозничнаяЦенаУпаковки
			/ СтрокаРезультатаПроверкиМинимальныхЦен.МинимальнаяРозничнаяЦена;
		КоэффициентПересчетаИзУпаковки = Окр(КоэффициентПересчетаИзУпаковки, 0);
		
		НаименованиеТовара = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			Строка(СтрокаРезультатаПроверкиМинимальныхЦен.Номенклатура),
			Строка(СтрокаРезультатаПроверкиМинимальныхЦен.Характеристика),,
			Строка(СтрокаРезультатаПроверкиМинимальныхЦен.Серия));
		
		Если СообщитьОбОшибках Тогда
			
			Шаблон = Нстр("ru = 'Для ""%1"" подобран КМ ""%2"" со значением МРЦ ""%3"" меньше ЕМРЦ ""%4"".%5'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				Шаблон,
				НаименованиеТовара,
				СтрокаРезультатаПроверкиМинимальныхЦен.КодМаркировки,
				СтрокаРезультатаПроверкиМинимальныхЦен.МРЦ / КоэффициентПересчетаИзУпаковки,
				СтрокаРезультатаПроверкиМинимальныхЦен.МинимальнаяРозничнаяЦена,
				" " + ?(УдалитьНекорректныеШтрихкодыУпаковок, Нстр("ru = 'КМ по товару удалены.'"), ""));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
		Если УдалитьНекорректныеШтрихкодыУпаковок
			И ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
			
			Если ТабачнаяПродукцияКУдалениюКМ.Найти(СтрокаРезультатаПроверкиМинимальныхЦен.Номенклатура) = Неопределено Тогда
				ТабачнаяПродукцияКУдалениюКМ.Добавить(СтрокаРезультатаПроверкиМинимальныхЦен.Номенклатура);
			КонецЕсли;
			
		КонецЕсли;
		
		РезультатПроверки = Ложь;
		
	КонецЦикла;
	
	Если УдалитьНекорректныеШтрихкодыУпаковок И ТабачнаяПродукцияКУдалениюКМ.Количество() > 0 Тогда
		
		ИмяТаблицыШтрихкодовУпаковок = РозничныеПродажиКлиентСерверЛокализация.ТаблицаШтрихкодовПоФормеМРЦ(
			Контекст.ИмяФормы);
		ТаблицаШтрихкодовУпаковок = Контекст.Объект[ИмяТаблицыШтрихкодовУпаковок]; // ТаблицаЗначений
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(&ИмяКолонкиШтрихкодаУпаковки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ ШтрихкодыУпаковок
		|ИЗ
		|	&ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
		|ГДЕ
		|	ШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура В (&НоменклатураОтбора)";
		Запрос.УстановитьПараметр("ШтрихкодыУпаковок", ТаблицаШтрихкодовУпаковок.Выгрузить());
		Запрос.УстановитьПараметр("НоменклатураОтбора", ТабачнаяПродукцияКУдалениюКМ);
		
		ИмяКолонкиШтрихкодаУпаковки = РозничныеПродажиКлиентСерверЛокализация.РеквизитШтрихкодаПоТаблицеШтрихкодов(
			ИмяТаблицыШтрихкодовУпаковок);
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ИмяКолонкиШтрихкодаУпаковки", "ШтрихкодыУпаковок." + ИмяКолонкиШтрихкодаУпаковки);
		
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			СтрокиШтрихкодовКУдалению = ТаблицаШтрихкодовУпаковок.НайтиСтроки(Новый Структура(
				ИмяКолонкиШтрихкодаУпаковки,
				ВыборкаЗапроса.ШтрихкодУпаковки));
			
			Для Каждого СтрокаШтрихкодаКУдалению Из СтрокиШтрихкодовКУдалению Цикл
				ТаблицаШтрихкодовУпаковок.Удалить(СтрокаШтрихкодаКУдалению);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	КлючеваяОперацияИмя = "МРЦ.ПроверкаШК";
	ОписаниеЛога = Новый Структура;
	ОписаниеЛога.Вставить("Метод", "ПроверитьШтрихкодыУпаковокНаМинимальнуюЦену");
	ОписаниеЛога.Вставить("КоличествоКМсМРЦ", ТаблицаШтрихкодыУпаковок.Количество());
	ОценкаПроизводительности.ЗакончитьЗамерВремени(КлючеваяОперацияИмя, 
		НачалоЗамера,, 
		ЗаписатьЗначениеJSON(ОписаниеЛога));
	
	Возврат РезультатПроверки;
	
КонецФункции

// Проверить корректность розничной цены в РМК по МРЦ подобранных КМ.
// 
// Параметры:
//  ТоварыДокумента - ТаблицаЗначений - Товары документа
//  ШтрихкодыУпаковокСМРЦ - ТаблицаЗначений - Штрихкоды упаковок СМРЦ:
// * Номенклатура - СправочникСсылка.Номенклатура - 
// * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - 
// * Серия - СправочникСсылка.СерииНоменклатуры - 
// * МРЦ - Число - 
// * ВидПродукцииИС - СправочникСсылка.КлючиВидовПродукцииИС - 
// * ШтрихкодУпаковки - СправочникСсылка.ШтрихкодыУпаковокТоваров - 
// * Количество - Число - Количество
//  ЦенаВключаетНДС - Булево - Цена включает НДС
//  СообщитьОбОшибках - Булево - Сообщить об ошибках
// 
// Возвращаемое значение:
//  Булево - Истина, если розничные цены соответствуют МРЦ
Функция ПроверитьКорректностьРозничнойЦеныПоМРЦ(ТоварыДокумента, ШтрихкодыУпаковокСМРЦ, ЦенаВключаетНДС = Истина,
	СообщитьОбОшибках = Истина) Экспорт
	
	РезультатПроверки = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыДокумента.НомерСтроки,
	|	ВЫРАЗИТЬ(ТоварыДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТоварыДокумента.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(ТоварыДокумента.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	|	ВЫРАЗИТЬ(ТоварыДокумента.Цена КАК ЧИСЛО(31, 2)) КАК Цена,
	|	ВЫРАЗИТЬ(&СуммаСНДС КАК ЧИСЛО(31, 2)) КАК Сумма,
	|	ВЫРАЗИТЬ(ТоварыДокумента.ВидПродукцииИС КАК Справочник.КлючиВидовПродукцииИС) КАК ВидПродукцииИС,
	|	ВЫРАЗИТЬ(ТоварыДокумента.Количество КАК ЧИСЛО(31, 3)) КАК Количество
	|ПОМЕСТИТЬ ТоварыДокумента
	|ИЗ
	|	&ТоварыДокумента КАК ТоварыДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ТоварыДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА &ЦенаВключаетНДС
	|			ТОГДА ТоварыДокумента.Цена
	|		КОГДА ТоварыДокумента.Количество = 0
	|			ТОГДА ТоварыДокумента.Сумма
	|		ИНАЧЕ ТоварыДокумента.Сумма / ТоварыДокумента.Количество
	|	КОНЕЦ КАК ЧИСЛО(31, 2)) КАК Цена,
	|	ТоварыДокумента.ВидПродукцииИС,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыДокументаСМРЦ
	|ИЗ
	|	ТоварыДокумента КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.ВидПродукцииИС.ВидПродукцииГИСМТ В (&ВидыПродукцииИС)
	|	И ТоварыДокумента.Цена > 0
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА &ЦенаВключаетНДС
	|			ТОГДА ТоварыДокумента.Цена
	|		КОГДА ТоварыДокумента.Количество = 0
	|			ТОГДА ТоварыДокумента.Сумма
	|		ИНАЧЕ ТоварыДокумента.Сумма / ТоварыДокумента.Количество
	|	КОНЕЦ КАК ЧИСЛО(31, 2)),
	|	ТоварыДокумента.ВидПродукцииИС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ШтрихкодыУпаковокСМРЦ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ШтрихкодыУпаковокСМРЦ.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(ШтрихкодыУпаковокСМРЦ.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	|	ВЫРАЗИТЬ(ШтрихкодыУпаковокСМРЦ.МРЦ КАК ЧИСЛО(31, 2)) КАК МРЦ,
	|	ВЫРАЗИТЬ(ШтрихкодыУпаковокСМРЦ.ВидПродукцииИС КАК Справочник.КлючиВидовПродукцииИС) КАК ВидПродукцииИС,
	|	ВЫРАЗИТЬ(ШтрихкодыУпаковокСМРЦ.Количество КАК ЧИСЛО(31, 3)) КАК Количество
	|ПОМЕСТИТЬ ШтрихкодыУпаковокСМРЦ
	|ИЗ
	|	&ШтрихкодыУпаковокСМРЦ КАК ШтрихкодыУпаковокСМРЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	МРЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокСМРЦ.Номенклатура,
	|	ШтрихкодыУпаковокСМРЦ.Характеристика,
	|	ШтрихкодыУпаковокСМРЦ.Серия,
	|	ШтрихкодыУпаковокСМРЦ.МРЦ КАК МРЦ
	|ИЗ
	|	ШтрихкодыУпаковокСМРЦ КАК ШтрихкодыУпаковокСМРЦ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыДокументаСМРЦ КАК ТоварыДокументаСМРЦ
	|		ПО ШтрихкодыУпаковокСМРЦ.Номенклатура = ТоварыДокументаСМРЦ.Номенклатура
	|		И ШтрихкодыУпаковокСМРЦ.Характеристика = ТоварыДокументаСМРЦ.Характеристика
	|		И ШтрихкодыУпаковокСМРЦ.Серия = ТоварыДокументаСМРЦ.Серия
	|		И ШтрихкодыУпаковокСМРЦ.МРЦ = ТоварыДокументаСМРЦ.Цена
	|ГДЕ
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Количество, 0) - ЕСТЬNULL(ШтрихкодыУпаковокСМРЦ.Количество, 0) < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДокументаСМРЦ.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Номенклатура, ШтрихкодыУпаковокСМРЦ.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Номенклатура.Наименование, ШтрихкодыУпаковокСМРЦ.Номенклатура.Наименование) КАК НоменклатураНаименование,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Характеристика, ШтрихкодыУпаковокСМРЦ.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Характеристика.Наименование, ШтрихкодыУпаковокСМРЦ.Характеристика.Наименование) КАК ХарактеристикаНаименование,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Серия, ШтрихкодыУпаковокСМРЦ.Серия) КАК Серия,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Серия.Наименование, ШтрихкодыУпаковокСМРЦ.Серия.Наименование) КАК СерияНаименование,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Цена, ШтрихкодыУпаковокСМРЦ.МРЦ) КАК ЦенаМРЦ,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.ВидПродукцииИС, ШтрихкодыУпаковокСМРЦ.ВидПродукцииИС) КАК ВидПродукцииИС,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Количество, ШтрихкодыУпаковокСМРЦ.Количество) КАК Количество,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Количество, 0) - ЕСТЬNULL(ШтрихкодыУпаковокСМРЦ.Количество, 0) КАК Расхождение
	|ИЗ
	|	ТоварыДокументаСМРЦ КАК ТоварыДокументаСМРЦ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ШтрихкодыУпаковокСМРЦ КАК ШтрихкодыУпаковокСМРЦ
	|		ПО ШтрихкодыУпаковокСМРЦ.Номенклатура = ТоварыДокументаСМРЦ.Номенклатура
	|		И ШтрихкодыУпаковокСМРЦ.Характеристика = ТоварыДокументаСМРЦ.Характеристика
	|		И ШтрихкодыУпаковокСМРЦ.Серия = ТоварыДокументаСМРЦ.Серия
	|		И ШтрихкодыУпаковокСМРЦ.МРЦ = ТоварыДокументаСМРЦ.Цена
	|ГДЕ
	|	НЕ ЕСТЬNULL(ТоварыДокументаСМРЦ.Количество, 0) - ЕСТЬNULL(ШтрихкодыУпаковокСМРЦ.Количество, 0) = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("ТоварыДокумента", ТоварыДокумента);
	Запрос.УстановитьПараметр("ШтрихкодыУпаковокСМРЦ", ШтрихкодыУпаковокСМРЦ);
	Запрос.УстановитьПараметр("ВидыПродукцииИС", КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииКоторымДоступноПолеМРЦ());
	Запрос.УстановитьПараметр("ЦенаВключаетНДС", ЦенаВключаетНДС);
	
	Если ТоварыДокумента.Колонки.Найти("СуммаСНДС") = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаСНДС", "ТоварыДокумента.Сумма");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СуммаСНДС", "ТоварыДокумента.СуммаСНДС");
	КонецЕсли;
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ТаблицаЛишнихЗначенийМРЦПоТоварам = ПакетЗапросов[3].Выгрузить();
	ТаблицаЛишнихЗначенийМРЦПоТоварам.Индексы.Добавить("Номенклатура, Характеристика, Серия");
	
	ВыборкаЗапроса = ПакетЗапросов[4].Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		Если ВыборкаЗапроса.Расхождение < 0 Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатПроверки = Ложь;
		
		Если Не СообщитьОбОшибках Тогда
			Прервать;
		КонецЕсли;
		
		Если ВыборкаЗапроса.НомерСтроки = NULL Тогда
			Продолжить;
		КонецЕсли;
		
		НаименованиеТовара = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаЗапроса.НоменклатураНаименование,
			ВыборкаЗапроса.ХарактеристикаНаименование,,
			ВыборкаЗапроса.СерияНаименование);
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура",   ВыборкаЗапроса.Номенклатура);
		СтруктураОтбора.Вставить("Характеристика", ВыборкаЗапроса.Характеристика);
		СтруктураОтбора.Вставить("Серия",          ВыборкаЗапроса.Серия);
		МассивЛишнихМРЦПоТовару = ТаблицаЛишнихЗначенийМРЦПоТоварам.НайтиСтроки(СтруктураОтбора);
		
		ЗначенияМРЦПоТовару = "";
		Для Каждого СтрокаМассиваЛишнихМРЦПоТовару Из МассивЛишнихМРЦПоТовару Цикл
			ЗначенияМРЦПоТовару = ЗначенияМРЦПоТовару + СтрокаМассиваЛишнихМРЦПоТовару.МРЦ + "; ";
		КонецЦикла;
		ЗначенияМРЦПоТовару = Лев(ЗначенияМРЦПоТовару, СтрДлина(ЗначенияМРЦПоТовару)-2);
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура",   ВыборкаЗапроса.Номенклатура);
		СтруктураОтбора.Вставить("Характеристика", ВыборкаЗапроса.Характеристика);
		СтруктураОтбора.Вставить("Серия",          ВыборкаЗапроса.Серия);
		СтруктураОтбора.Вставить("Цена",          ВыборкаЗапроса.ЦенаМРЦ);
		МассивТоваровСНекорректнойЦеной = ТоварыДокумента.НайтиСтроки(СтруктураОтбора);
		
		НомерСтроки = "№";
		Для Каждого СтрокаТовараСНекорректнойЦеной Из МассивТоваровСНекорректнойЦеной Цикл
			НомерСтроки = НомерСтроки + СтрокаТовараСНекорректнойЦеной.НомерСтроки + "; №";
		КонецЦикла;
		НомерСтроки = Лев(НомерСтроки, СтрДлина(НомерСтроки)-3);
		
		Шаблон = Нстр("ru = '%1 %2 для ""%3"" цена продажи ""%4"" не соответствует МРЦ (%5) в подобранных КМ'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Шаблон,
			?(МассивТоваровСНекорректнойЦеной.Количество() = 1, "В строке", "В строках"),
			НомерСтроки,
			НаименованиеТовара,
			ВыборкаЗапроса.ЦенаМРЦ,
			ЗначенияМРЦПоТовару);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции

// Привести цены продажи к МРЦ из подобранных КМ
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ШтрихкодыУпаковокСМРЦ - ТаблицаЗначений - Штрихкоды упаковок СМРЦ
Процедура ПривестиЦеныПродажиКМРЦ(Форма, ШтрихкодыУпаковокСМРЦ) Экспорт
	
	ТоварыДокумента = Форма.Объект.Товары.Выгрузить(); // ТаблицаЗначений
	ТоварыДокумента.Индексы.Добавить("Номенклатура, Характеристика, Серия");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыДокумента.НомерСтроки,
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Цена,
	|	ТоварыДокумента.ВидПродукцииИС,
	|	ТоварыДокумента.Количество
	|ПОМЕСТИТЬ ТоварыДокумента
	|ИЗ
	|	&ТоварыДокумента КАК ТоварыДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыДокументаУникальные
	|ИЗ
	|	ТоварыДокумента КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.ВидПродукцииИС.ВидПродукцииГИСМТ В (&ВидыПродукцииИС)
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ТоварыДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Цена,
	|	ТоварыДокумента.ВидПродукцииИС,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыДокументаСМРЦ
	|ИЗ
	|	ТоварыДокумента КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.ВидПродукцииИС.ВидПродукцииГИСМТ В (&ВидыПродукцииИС)
	|	И ТоварыДокумента.Цена > 0
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Цена,
	|	ТоварыДокумента.ВидПродукцииИС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокСМРЦ.Номенклатура,
	|	ШтрихкодыУпаковокСМРЦ.Характеристика,
	|	ШтрихкодыУпаковокСМРЦ.Серия,
	|	ШтрихкодыУпаковокСМРЦ.МРЦ,
	|	ШтрихкодыУпаковокСМРЦ.ВидПродукцииИС,
	|	ШтрихкодыУпаковокСМРЦ.Количество
	|ПОМЕСТИТЬ ШтрихкодыУпаковокСМРЦ
	|ИЗ
	|	&ШтрихкодыУпаковокСМРЦ КАК ШтрихкодыУпаковокСМРЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	МРЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Номенклатура, ШтрихкодыУпаковокСМРЦ.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Характеристика, ШтрихкодыУпаковокСМРЦ.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Серия, ШтрихкодыУпаковокСМРЦ.Серия) КАК Серия
	|ПОМЕСТИТЬ ТоварыСРасхождениемЦен
	|ИЗ
	|	ТоварыДокументаСМРЦ КАК ТоварыДокументаСМРЦ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ШтрихкодыУпаковокСМРЦ КАК ШтрихкодыУпаковокСМРЦ
	|		ПО ШтрихкодыУпаковокСМРЦ.Номенклатура = ТоварыДокументаСМРЦ.Номенклатура
	|		И ШтрихкодыУпаковокСМРЦ.Характеристика = ТоварыДокументаСМРЦ.Характеристика
	|		И ШтрихкодыУпаковокСМРЦ.Серия = ТоварыДокументаСМРЦ.Серия
	|		И ШтрихкодыУпаковокСМРЦ.МРЦ = ТоварыДокументаСМРЦ.Цена
	|ГДЕ
	|	НЕ ЕСТЬNULL(ТоварыДокументаСМРЦ.Количество, 0) - ЕСТЬNULL(ШтрихкодыУпаковокСМРЦ.Количество, 0) = 0
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Номенклатура, ШтрихкодыУпаковокСМРЦ.Номенклатура),
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Характеристика, ШтрихкодыУпаковокСМРЦ.Характеристика),
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Серия, ШтрихкодыУпаковокСМРЦ.Серия)
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////|
	|ВЫБРАТЬ
	|	ТоварыДокументаУникальные.Номенклатура,
	|	ТоварыДокументаУникальные.Характеристика,
	|	ТоварыДокументаУникальные.Серия,
	|	ТоварыДокументаУникальные.Количество
	|ИЗ
	|	ТоварыДокументаУникальные КАК ТоварыДокументаУникальные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСРасхождениемЦен КАК ТоварыСРасхождениемЦен
	|		ПО ТоварыДокументаУникальные.Номенклатура = ТоварыСРасхождениемЦен.Номенклатура
	|			И ТоварыДокументаУникальные.Характеристика = ТоварыСРасхождениемЦен.Характеристика
	|			И ТоварыДокументаУникальные.Серия = ТоварыСРасхождениемЦен.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокСМРЦ.Номенклатура,
	|	ШтрихкодыУпаковокСМРЦ.Характеристика,
	|	ШтрихкодыУпаковокСМРЦ.Серия,
	|	ШтрихкодыУпаковокСМРЦ.МРЦ,
	|	ШтрихкодыУпаковокСМРЦ.Количество
	|ИЗ
	|	ШтрихкодыУпаковокСМРЦ КАК ШтрихкодыУпаковокСМРЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСРасхождениемЦен КАК ТоварыСРасхождениемЦен
	|		ПО ШтрихкодыУпаковокСМРЦ.Номенклатура = ТоварыСРасхождениемЦен.Номенклатура
	|			И ШтрихкодыУпаковокСМРЦ.Характеристика = ТоварыСРасхождениемЦен.Характеристика
	|			И ШтрихкодыУпаковокСМРЦ.Серия = ТоварыСРасхождениемЦен.Серия
	|;";
	Запрос.УстановитьПараметр("ТоварыДокумента", ТоварыДокумента);
	Запрос.УстановитьПараметр("ШтрихкодыУпаковокСМРЦ", ШтрихкодыУпаковокСМРЦ);
	Запрос.УстановитьПараметр("ВидыПродукцииИС", КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииКоторымДоступноПолеМРЦ());
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ТоварыДокументаУникальные = ПакетЗапросов[5].Выгрузить();
	ТоварыДокументаУникальные.Индексы.Добавить("Номенклатура, Характеристика, Серия");
	
	ШтрихкодыУпаковокСМРЦ = ПакетЗапросов[6].Выгрузить();
	ШтрихкодыУпаковокСМРЦ.Индексы.Добавить("Номенклатура, Характеристика, Серия");
	
	НачальнаяСтрокаСТоваром = Неопределено;
	ТекущийНомерСтрокиСТоваром = 0;
	КоличествоОстатокКРаспределению = 0;
	
	МассивИзмененныхСтрок = Новый Массив;
	
	Для Каждого СтрокаТоварыДокументаУникальные Из ТоварыДокументаУникальные Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура",   СтрокаТоварыДокументаУникальные.Номенклатура);
		СтруктураОтбора.Вставить("Характеристика", СтрокаТоварыДокументаУникальные.Характеристика);
		СтруктураОтбора.Вставить("Серия",          СтрокаТоварыДокументаУникальные.Серия);
		МассивСтрокПоТовару = ТоварыДокумента.НайтиСтроки(СтруктураОтбора);
		
		НачальнаяСтрокаСТоваром = МассивСтрокПоТовару[0];
		ТекущийНомерСтрокиСТоваром = НачальнаяСтрокаСТоваром.НомерСтроки;
		КоличествоОстатокКРаспределению = СтрокаТоварыДокументаУникальные.Количество;
		
		КоличествоСтрок = МассивСтрокПоТовару.Количество();
		Для а = 1 По КоличествоСтрок Цикл
			СтрокаКУдалению = МассивСтрокПоТовару[КоличествоСтрок-а];
			Форма.Объект.Товары.Удалить(СтрокаКУдалению.НомерСтроки-1);
		КонецЦикла;
		
		Для Каждого СтрокаШтрихкодыУпаковокСМРЦ Из ШтрихкодыУпаковокСМРЦ Цикл
			
			СтрокаТЧ = Форма.Объект.Товары.Вставить(ТекущийНомерСтрокиСТоваром-1);
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, НачальнаяСтрокаСТоваром);
			
			СтрокаТЧ.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
			СтрокаТЧ.Количество = СтрокаШтрихкодыУпаковокСМРЦ.Количество;
			СтрокаТЧ.КоличествоУпаковок = СтрокаШтрихкодыУпаковокСМРЦ.Количество;
			СтрокаТЧ.Цена = СтрокаШтрихкодыУпаковокСМРЦ.МРЦ;
			
			МассивИзмененныхСтрок.Добавить(СтрокаТЧ);
			
			ТекущийНомерСтрокиСТоваром = ТекущийНомерСтрокиСТоваром + 1;
			КоличествоОстатокКРаспределению = КоличествоОстатокКРаспределению - СтрокаТЧ.Количество;
			
		КонецЦикла;
		
		Если КоличествоОстатокКРаспределению > 0 Тогда
			
			СтрокаТЧ = Форма.Объект.Товары.Вставить(НачальнаяСтрокаСТоваром.НомерСтроки-1);
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, НачальнаяСтрокаСТоваром);
			
			СтрокаТЧ.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
			СтрокаТЧ.Количество = КоличествоОстатокКРаспределению;
			СтрокаТЧ.КоличествоУпаковок = КоличествоОстатокКРаспределению;
			СтрокаТЧ.Цена = 0;
			
			МассивИзмененныхСтрок.Добавить(СтрокаТЧ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивИзмененныхСтрок.Количество() > 0 Тогда
		
		СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Форма.Объект);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму");
		Если Не Форма.ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК" Тогда
			СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
		КонецЕсли;
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		Если Не Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК"
			И Не Форма.ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК" Тогда
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		КонецЕсли;
		
		Если Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
			СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
			
			ПараметрыЗаполненияСуммыНДСРеглУпр = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСуммыНДСРеглУпр(
				Форма.Объект.Валюта,
				Форма.ВалютаРегламентированногоУчета,
				Форма.ВалютаУправленческогоУчета);
			СтруктураДействий.Вставить("УстановитьСуммуНДСРеглУпр", ПараметрыЗаполненияСуммыНДСРеглУпр);
		КонецЕсли;
		
		Если Не Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК"
			И Не Форма.ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК" Тогда
			ЗависимыеРеквизиты = Новый Структура(
				"БезВозвратнойТары",
				"Сумма,СуммаНДС,СуммаСНДС,СуммаАвтоматическойСкидки,СуммаРучнойСкидки,СуммаБонусныхБалловКСписаниюВВалюте");
			СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты);
		КонецЕсли;
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
			МассивИзмененныхСтрок,
			СтруктураДействий,
			Форма.Объект.Товары);
	
	КонецЕсли;
	
	// Дополнительно установить флаг МРЦ для товаров с корректной ценой
	Для Каждого СтрокаТовары Из Форма.Объект.Товары Цикл
		
		Если Не КонструкторИСМПОбщегоНазначенияКлиентСервер.ДоступноПолеМРЦ(СтрокаТовары.ВидПродукцииИС) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизитаУстановленаМРЦ = РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаУстановленаМРЦ();
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, ИмяРеквизитаУстановленаМРЦ)
			И ЗначениеЗаполнено(СтрокаТовары.Цена) Тогда
			СтрокаТовары[ИмяРеквизитаУстановленаМРЦ] = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Привести цены продажи к МРЦ из подобранных КМ после закрытия формы подбора и проверки 
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект.РеализацияТоваровУслуг - Документ, в котором исправляются цены
//  ТоварыСМРЦ - ТаблицаЗначений - Товары с МРЦ из подобранных КМ
Процедура ПривестиЦеныВДокументеКМРЦ(ДокументОбъект, ТоварыСМРЦ) Экспорт
	
	ДатаДокумента = ДокументОбъект.Дата;
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не КонтролироватьЦенуПродажиТабачнойПродукции(ДатаДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	ОписанияGTIN = РегистрыСведений.ОписаниеGTINИС.ПолучитьОписание(ТоварыСМРЦ.ВыгрузитьКолонку("GTIN"));
	
	Для Каждого СтрокаТоваровСМРЦ Из ТоварыСМРЦ Цикл
		
		ОписаниеGTIN = ОписанияGTIN[СтрокаТоваровСМРЦ.GTIN];
		Если ОписаниеGTIN = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОписаниеGTIN.КоличествоПотребительскихУпаковок = 0
			Или ОписаниеGTIN.КоличествоПотребительскихУпаковок = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТоваровСМРЦ.МРЦ = Окр(СтрокаТоваровСМРЦ.МРЦ / ОписаниеGTIN.КоличествоПотребительскихУпаковок, 2);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(Товары.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(Товары.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	|	ВЫРАЗИТЬ(Товары.Количество КАК ЧИСЛО(31, 3)) КАК Количество,
	|	ВЫРАЗИТЬ(Товары.Цена КАК ЧИСЛО(31, 2)) КАК Цена,
	|	ВЫРАЗИТЬ(Товары.СтавкаНДС КАК Справочник.СтавкиНДС) КАК СтавкаНДС
	|ПОМЕСТИТЬ ТоварыПредварительно
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	СУММА(Товары.Количество) КАК Количество,
	|	Товары.Цена
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	ТоварыПредварительно КАК Товары
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	ВЫБОР
	|		КОГДА Товары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьСерия
	|ПОМЕСТИТЬ ТоварыСерии
	|ИЗ
	|	Товары КАК Товары
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	ВЫБОР
	|		КОГДА Товары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////3
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Подобрано.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(Подобрано.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(Подобрано.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	|	ВЫРАЗИТЬ(Подобрано.КоличествоПодобрано КАК ЧИСЛО(31, 3)) КАК Количество,
	|	ВЫРАЗИТЬ(Подобрано.МРЦ КАК ЧИСЛО(31, 2)) КАК МРЦ
	|ПОМЕСТИТЬ ПодобраноПредварительно
	|ИЗ
	|	&Подобрано КАК Подобрано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////3
	|ВЫБРАТЬ
	|	Подобрано.Номенклатура,
	|	Подобрано.Характеристика,
	|	ВЫБОР
	|		КОГДА ТоварыСерии.ЕстьСерия = ИСТИНА
	|			ТОГДА Подобрано.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Серия,
	|	СУММА(Подобрано.Количество) КАК Количество,
	|	Подобрано.МРЦ
	|ПОМЕСТИТЬ Подобрано
	|ИЗ
	|	ПодобраноПредварительно КАК Подобрано
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСерии КАК ТоварыСерии
	|		ПО Подобрано.Номенклатура = ТоварыСерии.Номенклатура
	|			И Подобрано.Характеристика = ТоварыСерии.Характеристика
	|ГДЕ
	|	Подобрано.МРЦ > 0
	|СГРУППИРОВАТЬ ПО
	|	Подобрано.Номенклатура,
	|	Подобрано.Характеристика,
	|	ВЫБОР
	|		КОГДА ТоварыСерии.ЕстьСерия = ИСТИНА
	|			ТОГДА Подобрано.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	Подобрано.МРЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////4
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Количество,
	|	Товары.Цена,
	|	0 КАК МРЦ
	|ПОМЕСТИТЬ МаркируемыеТовары
	|ИЗ
	|	Товары КАК Товары
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Подобрано.Номенклатура,
	|	Подобрано.Характеристика,
	|	Подобрано.Серия,
	|	-Подобрано.Количество,
	|	0 КАК Цена,
	|	Подобрано.МРЦ
	|ИЗ
	|	Подобрано КАК Подобрано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////5
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.СтавкаНДС,
	|	ЕСТЬNULL(СтавкиНДС.Ставка, 0) КАК Ставка
	|ИЗ
	|	ТоварыПредварительно КАК Товары
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|	ПО Товары.СтавкаНДС = СтавкиНДС.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////6
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	СУММА(Товары.Количество) КАК Недостача,
	|	Товары.Цена,
	|	Товары.МРЦ
	|ПОМЕСТИТЬ РезультатСверкиЦеныСМРЦ
	|ИЗ
	|	МаркируемыеТовары КАК Товары
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Цена,
	|	Товары.МРЦ
	|ИМЕЮЩИЕ
	|	СУММА(Товары.Количество) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////5
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Недостача,
	|	Товары.Цена
	|ИЗ
	|	РезультатСверкиЦеныСМРЦ КАК Товары
	|ГДЕ
	|	Товары.Недостача > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////5
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	-Товары.Недостача КАК Недостача,
	|	Товары.МРЦ
	|ИЗ
	|	РезультатСверкиЦеныСМРЦ КАК Товары
	|ГДЕ
	|	Товары.Недостача < 0
	|";
	Запрос.УстановитьПараметр("Товары", ДокументОбъект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Подобрано", ТоварыСМРЦ);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	Количество = ПакетЗапросов.ВГраница();
	
	РасхожденияТовары = ПакетЗапросов[Количество-1].Выгрузить();
	
	РасхожденияПодобрано = ПакетЗапросов[Количество].Выгрузить();
	РасхожденияПодобрано.Индексы.Добавить("Номенклатура, Характеристика, Серия");
	
	Если РасхожденияТовары.Количество() = 0
		И РасхожденияПодобрано.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтавкиНДССоЗначениями = ПакетЗапросов[Количество-3].Выгрузить();
	
	СтруктураОтбораТовары = Новый Структура;
	СтруктураОтбораТовары.Вставить("Номенклатура");
	СтруктураОтбораТовары.Вставить("Характеристика");
	СтруктураОтбораТовары.Вставить("Серия");
	СтруктураОтбораТовары.Вставить("Цена");
	
	СтруктураОтбораПодобрано = Новый Структура;
	СтруктураОтбораПодобрано.Вставить("Номенклатура");
	СтруктураОтбораПодобрано.Вставить("Характеристика");
	СтруктураОтбораПодобрано.Вставить("Серия");
	
	МассивПересчетаСуммовыхПоказателей = Новый Массив;
	
	Для Каждого СтрокаРасхожденияТовары Из РасхожденияТовары Цикл
		
		КоличествоРасхождения = СтрокаРасхожденияТовары.Недостача;
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбораТовары, СтрокаРасхожденияТовары);
		СтрокиТоварыДокумента = ДокументОбъект.Товары.НайтиСтроки(СтруктураОтбораТовары);
		КоличествоСтрокТоваровДокумента = СтрокиТоварыДокумента.Количество();
		
		Для ТекущийНомерСтрокиТоваровДокумента = 1 По КоличествоСтрокТоваровДокумента Цикл
			
			Если КоличествоРасхождения = 0 Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаТоварыДокумента = СтрокиТоварыДокумента[КоличествоСтрокТоваровДокумента-ТекущийНомерСтрокиТоваровДокумента];
			КоличествоВДокументе = СтрокаТоварыДокумента.Количество;
			
			ЗаполнитьЗначенияСвойств(СтруктураОтбораПодобрано, СтрокаРасхожденияТовары);
			СтрокиПодобрано = РасхожденияПодобрано.НайтиСтроки(СтруктураОтбораПодобрано);
			КоличествоСтрокПодобрано = СтрокиПодобрано.Количество();
			
			ЗначениеСтавкиНДС = 0;
			Если Не ДокументОбъект.ЦенаВключаетНДС Тогда
				СтрокаСтавкаНДССоЗначением = СтавкиНДССоЗначениями.Найти(
					СтрокаТоварыДокумента.СтавкаНДС, "СтавкаНДС");
				Если СтрокаСтавкаНДССоЗначением <> Неопределено Тогда
					ЗначениеСтавкиНДС = СтрокаСтавкаНДССоЗначением.Ставка;
				КонецЕсли;
			КонецЕсли;
			
			Для ТекущийНомерСтрокиПодобрано = 1 По КоличествоСтрокПодобрано Цикл
				
				Если КоличествоРасхождения = 0
					Или КоличествоВДокументе = 0 Тогда
					Прервать;
				КонецЕсли;
				
				СтрокаПодобрано = СтрокиПодобрано[КоличествоСтрокПодобрано-ТекущийНомерСтрокиПодобрано];
				КоличествоПодобрано = СтрокаПодобрано.Недостача;
				
				КоличествоКОбработке = 0;
				Если КоличествоРасхождения >= КоличествоВДокументе Тогда
					КоличествоКОбработке = Мин(КоличествоВДокументе, КоличествоПодобрано);
				Иначе
					КоличествоКОбработке = Мин(КоличествоРасхождения, КоличествоПодобрано);
				КонецЕсли;
				
				Если КоличествоВДокументе > КоличествоКОбработке Тогда
					
					СтрокаТоварыДокументаКопия = ДокументОбъект.Товары.Вставить(СтрокаТоварыДокумента.НомерСтроки);
					СтрокаТоварыДокумента.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
					СтрокаТоварыДокумента.Количество = СтрокаТоварыДокумента.Количество - КоличествоКОбработке;
					СтрокаТоварыДокумента.КоличествоУпаковок = СтрокаТоварыДокумента.Количество;
					
					ЗаполнитьЗначенияСвойств(СтрокаТоварыДокументаКопия, СтрокаТоварыДокумента);
					СтрокаТоварыДокументаКопия.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
					СтрокаТоварыДокументаКопия.Количество = КоличествоКОбработке;
					СтрокаТоварыДокументаКопия.КоличествоУпаковок = КоличествоКОбработке;
					СтрокаТоварыДокументаКопия.ВидЦены = Неопределено;
					СтрокаТоварыДокументаКопия.Цена = СтрокаПодобрано.МРЦ;
					СтрокаТоварыДокументаКопия.СуммаРучнойСкидки = 0;
					СтрокаТоварыДокументаКопия.СуммаАвтоматическойСкидки = 0;
					СтрокаТоварыДокументаКопия.ПроцентРучнойСкидки = 0;
					СтрокаТоварыДокументаКопия.ПроцентАвтоматическойСкидки = 0;
					СтрокаТоварыДокументаКопия.СуммаБонусныхБалловКСписанию = 0;
					СтрокаТоварыДокументаКопия.СуммаБонусныхБалловКСписаниюВВалюте = 0;
					
					Если Не ДокументОбъект.ЦенаВключаетНДС Тогда
						СтрокаТоварыДокументаКопия.Цена = СтрокаТоварыДокументаКопия.Цена * 100 / (100 + ЗначениеСтавкиНДС);
					КонецЕсли;
					
					МассивПересчетаСуммовыхПоказателей.Добавить(СтрокаТоварыДокументаКопия);
					
				Иначе
					
					СтрокаТоварыДокумента.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
					СтрокаТоварыДокумента.КоличествоУпаковок = СтрокаТоварыДокумента.Количество;
					СтрокаТоварыДокумента.ВидЦены = Неопределено;
					СтрокаТоварыДокумента.Цена = СтрокаПодобрано.МРЦ;
					СтрокаТоварыДокумента.СуммаРучнойСкидки                   = 0;
					СтрокаТоварыДокумента.СуммаАвтоматическойСкидки           = 0;
					СтрокаТоварыДокумента.ПроцентРучнойСкидки                 = 0;
					СтрокаТоварыДокумента.ПроцентАвтоматическойСкидки         = 0;
					СтрокаТоварыДокумента.СуммаБонусныхБалловКСписанию        = 0;
					СтрокаТоварыДокумента.СуммаБонусныхБалловКСписаниюВВалюте = 0;
					
					Если Не ДокументОбъект.ЦенаВключаетНДС Тогда
						СтрокаТоварыДокумента.Цена = СтрокаТоварыДокумента.Цена * 100 / (100 + ЗначениеСтавкиНДС);
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаПодобрано.Недостача = СтрокаПодобрано.Недостача - КоличествоКОбработке;
				Если СтрокаПодобрано.Недостача = 0 Тогда
					РасхожденияПодобрано.Удалить(СтрокаПодобрано);
				КонецЕсли;
				
				КоличествоРасхождения = КоличествоРасхождения - КоличествоКОбработке;
				КоличествоВДокументе = КоличествоВДокументе - КоличествоКОбработке;
				
				МассивПересчетаСуммовыхПоказателей.Добавить(СтрокаТоварыДокумента);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если МассивПересчетаСуммовыхПоказателей.Количество() > 0 Тогда
		
		ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДокументОбъект.Организация);
		ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
		
		СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
		
		ПараметрыЗаполненияСуммыНДСРеглУпр = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСуммыНДСРеглУпр(
			ДокументОбъект.Валюта,
			ВалютаРегламентированногоУчета,
			ВалютаУправленческогоУчета);
		СтруктураДействий.Вставить("УстановитьСуммуНДСРеглУпр", ПараметрыЗаполненияСуммыНДСРеглУпр);
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
			МассивПересчетаСуммовыхПоказателей,
			СтруктураДействий,
			ДокументОбъект.Товары);
	
	КонецЕсли;
	
КонецПроцедуры

// Удалить штрихкоды упаковок по товарам с некорректной ценой по РМЦ
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ШтрихкодыУпаковокСМРЦ - ТаблицаЗначений - Штрихкоды упаковок СМРЦ
Процедура УдалитьШтрихкодыУпаковокПоТоварамСНекорректнойЦеной(Форма, ШтрихкодыУпаковокСМРЦ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыДокумента.НомерСтроки,
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Цена,
	|	ТоварыДокумента.ВидПродукцииИС,
	|	ТоварыДокумента.Количество
	|ПОМЕСТИТЬ ТоварыДокумента
	|ИЗ
	|	&ТоварыДокумента КАК ТоварыДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокДокумента.НомерСтроки,
	|	ШтрихкодыУпаковокДокумента.АкцизнаяМарка КАК ШтрихкодУпаковки
	|ПОМЕСТИТЬ ШтрихкодыУпаковокДокумента
	|ИЗ
	|	&ШтрихкодыУпаковокДокумента КАК ШтрихкодыУпаковокДокумента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ШтрихкодУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ТоварыДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Цена,
	|	ТоварыДокумента.ВидПродукцииИС,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыДокументаСМРЦ
	|ИЗ
	|	ТоварыДокумента КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.ВидПродукцииИС.ВидПродукцииГИСМТ В (&ВидыПродукцииИС)
	|	И ТоварыДокумента.Цена > 0
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Цена,
	|	ТоварыДокумента.ВидПродукцииИС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокСМРЦ.Номенклатура,
	|	ШтрихкодыУпаковокСМРЦ.Характеристика,
	|	ШтрихкодыУпаковокСМРЦ.Серия,
	|	ШтрихкодыУпаковокСМРЦ.МРЦ,
	|	ШтрихкодыУпаковокСМРЦ.ВидПродукцииИС,
	|	ШтрихкодыУпаковокСМРЦ.ШтрихкодУпаковки,
	|	ШтрихкодыУпаковокСМРЦ.Количество
	|ПОМЕСТИТЬ ШтрихкодыУпаковокСМРЦ
	|ИЗ
	|	&ШтрихкодыУпаковокСМРЦ КАК ШтрихкодыУпаковокСМРЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	МРЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Номенклатура, ШтрихкодыУпаковокСМРЦ.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Характеристика, ШтрихкодыУпаковокСМРЦ.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Серия, ШтрихкодыУпаковокСМРЦ.Серия) КАК Серия
	|ПОМЕСТИТЬ ТоварыСРасхождениемЦен
	|ИЗ
	|	ТоварыДокументаСМРЦ КАК ТоварыДокументаСМРЦ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ШтрихкодыУпаковокСМРЦ КАК ШтрихкодыУпаковокСМРЦ
	|		ПО ШтрихкодыУпаковокСМРЦ.Номенклатура = ТоварыДокументаСМРЦ.Номенклатура
	|		И ШтрихкодыУпаковокСМРЦ.Характеристика = ТоварыДокументаСМРЦ.Характеристика
	|		И ШтрихкодыУпаковокСМРЦ.Серия = ТоварыДокументаСМРЦ.Серия
	|		И ШтрихкодыУпаковокСМРЦ.МРЦ = ТоварыДокументаСМРЦ.Цена
	|ГДЕ
	|	НЕ ЕСТЬNULL(ТоварыДокументаСМРЦ.Количество, 0) - ЕСТЬNULL(ШтрихкодыУпаковокСМРЦ.Количество, 0) = 0
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Номенклатура, ШтрихкодыУпаковокСМРЦ.Номенклатура),
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Характеристика, ШтрихкодыУпаковокСМРЦ.Характеристика),
	|	ЕСТЬNULL(ТоварыДокументаСМРЦ.Серия, ШтрихкодыУпаковокСМРЦ.Серия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокСМРЦ.Номенклатура,
	|	ШтрихкодыУпаковокСМРЦ.Характеристика,
	|	ШтрихкодыУпаковокСМРЦ.Серия,
	|	ШтрихкодыУпаковокСМРЦ.МРЦ,
	|	ШтрихкодыУпаковокСМРЦ.ВидПродукцииИС,
	|	ШтрихкодыУпаковокСМРЦ.ШтрихкодУпаковки,
	|	ШтрихкодыУпаковокСМРЦ.Количество
	|ПОМЕСТИТЬ ШтрихкодыУпаковокКУдалению
	|ИЗ
	|	ШтрихкодыУпаковокСМРЦ КАК ШтрихкодыУпаковокСМРЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСРасхождениемЦен КАК ТоварыСРасхождениемЦен
	|		ПО ШтрихкодыУпаковокСМРЦ.Номенклатура = ТоварыСРасхождениемЦен.Номенклатура
	|			И ШтрихкодыУпаковокСМРЦ.Характеристика = ТоварыСРасхождениемЦен.Характеристика
	|			И ШтрихкодыУпаковокСМРЦ.Серия = ТоварыСРасхождениемЦен.Серия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ШтрихкодУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодыУпаковокДокумента.ШтрихкодУпаковки
	|ИЗ
	|	ШтрихкодыУпаковокДокумента КАК ШтрихкодыУпаковокДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ПО ШтрихкодыУпаковокДокумента.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ШтрихкодыУпаковокКУдалению)";
	Запрос.УстановитьПараметр("ТоварыДокумента", Форма.Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("ШтрихкодыУпаковокДокумента", Форма.Объект.АкцизныеМарки.Выгрузить());
	Запрос.УстановитьПараметр("ШтрихкодыУпаковокСМРЦ", ШтрихкодыУпаковокСМРЦ);
	Запрос.УстановитьПараметр("ВидыПродукцииИС", КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииКоторымДоступноПолеМРЦ());
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		СтрокиШтрихкодовКУдалению = Форма.Объект.АкцизныеМарки.НайтиСтроки(Новый Структура(
			"АкцизнаяМарка",
			ВыборкаЗапроса.ШтрихкодУпаковки));
		
		Для Каждого СтрокаШтрихкодаКУдалению Из СтрокиШтрихкодовКУдалению Цикл
			Форма.Объект.АкцизныеМарки.Удалить(СтрокаШтрихкодаКУдалению);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОплатаЭСФСС

// Установить функциональную опцию оплаты ЭС ФСС в реквизите формы.
// 
// Параметры:
//  Форма - см. Документ.ЧекККМ.Форма.ФормаДокументаРМК,Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК
Процедура УстановитьФункциональнуюОпциюОплатаЭСФСС(Форма) Экспорт
	
	Форма.ИспользоватьОплатуЭСФСС = ПолучитьФункциональнуюОпцию("ОплатаЭлектроннымиСертификатамиФСС");
	
КонецПроцедуры

// Настроить видимость элементов оплаты ЭС ФСС на форме панели администрирования УТ "Продажи"
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура ПанельАдминистрированияУТПродажиНастроитьВидимостьЭлементовОплатыЭСФСС(Форма) Экспорт
	
	Форма.Элементы.ГруппаПараметрыПодключенияНСПК.Видимость =
		ПолучитьФункциональнуюОпцию("ОплатаЭлектроннымиСертификатамиФСС");
	
КонецПроцедуры

// Заполнить основные параметры подключения к НСПК
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура ПанельАдминистрированияУТПродажиЗаполнитьПараметрыПодключенияНСПК(Форма) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ОплатаЭлектроннымиСертификатамиФСС") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщиеПараметрыПодключенияНСПК = ЭлектронныеСертификатыНСПКУТ.ОбщиеПараметрыПодключенияНСПК();
	Форма.АдресСервисаНСПК = ОбщиеПараметрыПодключенияНСПК.АдресСервисаНСПК;
	Форма.КлючДоступаНСПК = ОбщиеПараметрыПодключенияНСПК.КлючДоступаНСПК;
	
	Форма.ПроксиСерверНСПК = ОбщиеПараметрыПодключенияНСПК.ПараметрыПроксиНСПК.Сервер;
	Форма.ПроксиПортНСПК = ОбщиеПараметрыПодключенияНСПК.ПараметрыПроксиНСПК.Порт;
	Форма.ПроксиПользовательНСПК = ОбщиеПараметрыПодключенияНСПК.ПараметрыПроксиНСПК.Пользователь;
	Форма.ПроксиПарольНСПК = ОбщиеПараметрыПодключенияНСПК.ПараметрыПроксиНСПК.Пароль;
	
	ВерсияКомпонентыНСПК = ЭлектронныеСертификатыНСПК.ВерсияВК();
	Форма.Элементы.ГруппаПараметрыПодключенияНСПК.Заголовок = СтрШаблон(
		НСтр("ru = 'Настройки подключения к сервису НСПК (компонента v. %1)'"), ВерсияКомпонентыНСПК);
	
КонецПроцедуры

// Записать параметры подключения к НСПК для "Кассы ККМ" 
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ТекущийОбъект - СправочникОбъект.КассыККМ - Касса ККМ
Процедура КассаККМЗаписатьПараметрыПодключенияОрганизацииНСПК(Форма, ТекущийОбъект) Экспорт
	
	Если НЕ (ПолучитьФункциональнуюОпцию("ОплатаЭлектроннымиСертификатамиФСС")
		И Форма.Объект.ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор) Тогда
		
		Возврат;
	КонецЕсли;
	
	КлючОрганизацииНСПК = "";
	Если Не ПустаяСтрока(Форма.КлючОрганизацииНСПК) Тогда 
		КлючОрганизацииНСПК = Форма.КлючОрганизацииНСПК;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СтароеЗначениеПараметровПодключения = ЭлектронныеСертификатыНСПКУТ.ПараметрыПодключенияОрганизацииНСПК(Форма.Объект.Владелец);
	Если КлючОрганизацииНСПК <> СтароеЗначениеПараметровПодключения.КлючОрганизацииНСПК Тогда
		ОрганизацияОбъект = Форма.Объект.Владелец.ПолучитьОбъект(); // СправочникОбъект.Организации
		ОрганизацияОбъект.КлючОрганизацииНСПК = КлючОрганизацииНСПК;
		Попытка
			ОрганизацияОбъект.Записать();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ШаблонТекстаОшибки = НСтр("ru = 'Не удалось записать данные о ключе организации %1 для подключения к НСПК по кассе ККМ %2 по причине:
			|%3'");
			ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, Форма.Объект.Владелец, Форма.Объект.Ссылка, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ВызватьИсключение ТекстОШибки;
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает сумму оплаты электронными сертификатам ФСС по документу
// 
// Параметры:
//  ОплатыПлатежнойКартой - ТаблицаЗначений - Оплаты платежной картой:
//  * ВидОплаты - ПеречислениеСсылка.ТипыПлатежнойСистемыККТ -
//  * Сумма - Число - 
// 
// Возвращаемое значение:
//  Число - сумма оплаты электронными сертификатами ФСС по документу
Функция СуммаОплатыЭСФССПоДокументу(ОплатыПлатежнойКартой) Экспорт
	
	СуммаОплатыЭСФСС = 0;
	
	Для Каждого СтрокаТЗ Из ОплатыПлатежнойКартой Цикл
		
		Если СтрокаТЗ.ВидОплаты = Перечисления.ТипыПлатежнойСистемыККТ.СертификатНСПК Тогда
			СуммаОплатыЭСФСС = СуммаОплатыЭСФСС + СтрокаТЗ.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СуммаОплатыЭСФСС;
	
КонецФункции

// Возвращает сумму оплаты СБП по документу
// 
// Параметры:
//  ОплатыПлатежнойКартой - ТаблицаЗначений - Оплаты платежной картой:
//  * ВидОплаты - ПеречислениеСсылка.ТипыПлатежнойСистемыККТ -
//  * Сумма - Число - 
//  * СтатусОплатыСБП - ПеречислениеСсылка.ТипыСтатусовОплатыСБП - 
//  ТолькоОплатаВыполнена - Булево - Истина - Выполнена
// 
// Возвращаемое значение:
//  Число - сумма оплаты СБП по документу
Функция СуммаОплатыСБППоДокументу(ОплатыПлатежнойКартой, ТолькоОплатаВыполнена = Ложь) Экспорт
	
	СуммаОплатыСБП = 0;
	
	Для Каждого СтрокаТЗ Из ОплатыПлатежнойКартой Цикл
		
		Если СтрокаТЗ.ВидОплаты = Перечисления.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей Тогда
			
			Если ТолькоОплатаВыполнена И СтрокаТЗ.СтатусОплатыСБП = Перечисления.ТипыСтатусовОплатыСБП.Выполнена
				ИЛИ Не ТолькоОплатаВыполнена Тогда
				
				СуммаОплатыСБП = СуммаОплатыСБП + СтрокаТЗ.Сумма;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СуммаОплатыСБП;
	
КонецФункции

#КонецОбласти

#Область ОплатаСБП

// Установить признак возможности использования оплаты СБП на формах РМК.
// 
// Параметры:
//  Форма - см. Документ.ЧекККМ.Форма.ФормаДокументаРМК,
//  			Документ.ЧекККМВозврат.ФормаДокументаРМК,
//  			Документ.РеализацияПодарочныхСертификатов.Форма.ФормаДокументаРМК,
//				Документ.ВозвратПодарочныхСертификатов.Форма.ФормаДокументаРМК .
Процедура УстановитьВозможностьИспользованиеОплатыСБПНаФормахРМК(Форма) Экспорт
	
	Форма.ИспользоватьОплатуСБП = ДляОрганизацииНастроеноПодключениеСБП(
		Форма.Объект.Организация,
		Форма.Объект.КассаККМ);
	
КонецПроцедуры

// Проверяет наличие настроек интеграции с СБП для организации.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации
//  КассаККМ - СправочникСсылка.КассыККМ
//
// Возвращаемое значение:
//  Булево - 
//
Функция ДляОрганизацииНастроеноПодключениеСБП(Организация, КассаККМ) Экспорт

	Результат = Ложь;
	Если Справочники.НастройкиРМК.СписокДоговоровИПодключенийСБП(Организация, КассаККМ).Количество() > 0 Тогда
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Получить из платежной системы идентификатор оплаты в платежной системе.
// 
// Параметры:
//  ПараметрыПроцедуры - Структура - Параметры процедуры
//  АдресРезультата - Строка - Адрес результата
Процедура ИдентификаторОплатыВПлатежнойСистеме(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ПередВыполнениемОперацииВПлатежнойСистеме(ПараметрыПроцедуры.ДокументОплаты);
	
	РезультатОперации = ПереводыСБПc2b.ДинамическаяСсылка(
		ПараметрыПроцедуры.ДокументОплаты,
		ПараметрыПроцедуры.НастройкаПодключения,
		ПараметрыПроцедуры);
	
	Если ТипЗнч(РезультатОперации) = Тип("Структура") Тогда
		РезультатОперации.Вставить("ДокументОплаты", ПараметрыПроцедуры.ДокументОплаты);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОперации, АдресРезультата);
	
КонецПроцедуры

// Получить статус оплаты в платежной системе.
// 
// Параметры:
//  ПараметрыПроцедуры - Структура - Параметры процедуры
//  АдресРезультата - Строка - Адрес результата
Процедура СтатусОплатыВПлатежнойСистеме(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ПередВыполнениемОперацииВПлатежнойСистеме(ПараметрыПроцедуры.ДокументОплаты);
	
	РезультатОперации = ПереводыСБПc2b.СтатусОплаты(
		ПараметрыПроцедуры.ДокументОплаты,
		Неопределено);
	
	Если ТипЗнч(РезультатОперации) = Тип("Структура") Тогда
		РезультатОперации.Вставить("СуммаОперации", СуммаОперации(ПараметрыПроцедуры.ДокументОплаты));
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОперации, АдресРезультата);
	
КонецПроцедуры

// Выполнить возврат оплаты в платежной системе
// 
// Параметры:
//  ПараметрыПроцедуры - Структура - Параметры процедуры
//  АдресРезультата - Строка - Адрес результата
Процедура ВыполнитьВозвратОплаты(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ПередВыполнениемОперацииВПлатежнойСистеме(ПараметрыПроцедуры.ДокументВозврата);
	
	ОбъектОплаты = ?(ЗначениеЗаполнено(ПараметрыПроцедуры.ИдентификаторОплаты),
			ПараметрыПроцедуры.ИдентификаторОплаты,
			ПараметрыПроцедуры.ДокументОплаты);
	
	РезультатОперации = ПереводыСБПc2b.ВозвратОплаты(
		ПараметрыПроцедуры.ДокументВозврата,
		ОбъектОплаты,
		ПараметрыПроцедуры.НастройкаПодключения,
		ПараметрыПроцедуры.БанкКлиента,
		ПараметрыПроцедуры);
	
	Если ТипЗнч(РезультатОперации) = Тип("Структура") Тогда
		РезультатОперации.Вставить("ДокументВозврата", ПараметрыПроцедуры.ДокументВозврата);
	КонецЕсли;
		
	ПоместитьВоВременноеХранилище(РезультатОперации, АдресРезультата);
	
КонецПроцедуры

// Получить статус возврата оплаты в платежной системе.
// 
// Параметры:
//  ПараметрыПроцедуры - Структура - Параметры процедуры
//  АдресРезультата - Строка - Адрес результата
Процедура СтатусВозвратаОплатыВПлатежнойСистеме(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ПередВыполнениемОперацииВПлатежнойСистеме(ПараметрыПроцедуры.ДокументВозврата);
	
	РезультатОперации = ПереводыСБПc2b.СтатусВозврата(
		ПараметрыПроцедуры.ДокументВозврата,
		Неопределено);
	
	Если ТипЗнч(РезультатОперации) = Тип("Структура") Тогда
		РезультатОперации.Вставить("СуммаОперации", СуммаОперации(ПараметрыПроцедуры.ДокументВозврата));
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОперации, АдресРезультата);
	
КонецПроцедуры

// Подтверждает возврат оплаты и возвращает результат подтверждения
// 
// Параметры:
//  ДокументВозврата - ДокументСсылка - Документ возврата
// 
// Возвращаемое значение:
//  см. ПереводыСБПc2b.ПодтвердитьВозврат
Функция ПодтвердитьВозвратОплаты(ДокументВозврата) Экспорт
	
	ПередВыполнениемОперацииВПлатежнойСистеме(ДокументВозврата);
	
	Возврат ПереводыСБПc2b.ПодтвердитьВозврат(
		ДокументВозврата,
		Неопределено);
	
КонецФункции

// Активирует кассовую ссылку для приема оплаты
// 
// Параметры:
//  ПараметрыПроцедуры - Структура:
//  	*ДокументОплаты - см. ПереводыСБПc2b.АктивироватьКассовуюСсылку.ДокументОперации 
//  	*ДанныеСсылки - см. ПереводыСБПc2b.АктивироватьКассовуюСсылку.ДанныеСсылки 
//  	*ТорговаяТочка - см. ПереводыСБПc2b.АктивироватьКассовуюСсылку.НастройкаПодключения 
//  АдресРезультата - Строка - Адрес результата
Процедура АктивироватьКассовуюСсылку(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ПередВыполнениемОперацииВПлатежнойСистеме(ПараметрыПроцедуры.ДокументОплаты);
	
	РезультатОперации = ПереводыСБПc2b.АктивироватьКассовуюСсылку(
		ПараметрыПроцедуры.ДокументОплаты,
		ПараметрыПроцедуры.ДанныеСсылки,
		ПараметрыПроцедуры.ТорговаяТочка,
		ПараметрыПроцедуры);
		
	Если ТипЗнч(РезультатОперации) = Тип("Структура") Тогда
		РезультатОперации.Вставить("ДокументОплаты", ПараметрыПроцедуры.ДокументОплаты);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОперации, АдресРезультата);
	
КонецПроцедуры

// Деактивирует кассовую ссылку, оплата по ней становится невозможной
// 
// Параметры:
//  ПараметрыПроцедуры - Структура:
//  	*ДанныеСсылки - см. ПереводыСБПc2b.ДеактивироватьКассовуюСсылку.ДанныеСсылки 
//  	*ТорговаяТочка - см. ПереводыСБПc2b.ДеактивироватьКассовуюСсылку.НастройкаПодключения 
//  АдресРезультата - Строка - Адрес результата
Процедура ДеактивироватьКассовуюСсылку(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ПередВыполнениемОперацииВПлатежнойСистеме(ПараметрыПроцедуры.ДокументОплаты);
	
	РезультатОперации = ПереводыСБПc2b.ДеактивироватьКассовуюСсылку(
		ПараметрыПроцедуры.ДанныеСсылки,
		ПараметрыПроцедуры.ТорговаяТочка);
		
	Если ТипЗнч(РезультатОперации) = Тип("Структура") Тогда
		РезультатОперации.Вставить("ДокументОплаты", ПараметрыПроцедуры.ДокументОплаты);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатОперации, АдресРезультата);
	
КонецПроцедуры

// Определяет настройку подключения к платежной системе по договору подключения.
// 
// Параметры:
//  ДоговорПодключения - СправочникСсылка.ДоговорыЭквайринга - Договор подключения к платежной системе
//  Магазин - СправочникСсылка.Склады - Магазин подключения к платежной ссылке
// 
// Возвращаемое значение:
//  СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей - Настройка подключения к платежной системе
Функция НастройкаПодключения(ДоговорПодключения, Магазин) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор,
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Магазин,
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграцииСПлатежнымиСистемамиУТ
	|ГДЕ
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор = &ДоговорПодключения
	|	И НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция.Используется";
	Запрос.УстановитьПараметр("ДоговорПодключения", ДоговорПодключения);

	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ИнтеграцияОбщая = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Магазин) Тогда
			Если ЗначениеЗаполнено(Выборка.Магазин) Тогда
				Если Выборка.Магазин = Магазин
					Или Магазин.ПринадлежитЭлементу(Выборка.Магазин) Тогда
					Возврат Выборка.Интеграция;
				КонецЕсли;
			Иначе
				ИнтеграцияОбщая = Выборка.Интеграция;
			КонецЕсли;
		Иначе
			Возврат Выборка.Интеграция;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИнтеграцияОбщая;
	
КонецФункции

// Настройки подключения к платежной системе по договору подключения.
// 
// Параметры:
//  ДоговорПодключения - СправочникСсылка.ДоговорыЭквайринга - Договор подключения к платежной системе
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Настройка подключения к платежной системе:
//	* Договор - СправочникСсылка.ДоговорыЭквайринга - 
//	* Магазин - СправочникСсылка.Склады - 
//	* НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
Функция НастройкиПодключения(ДоговорПодключения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор,
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Магазин,
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция КАК НастройкаПодключения
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграцииСПлатежнымиСистемамиУТ
	|ГДЕ
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор = &ДоговорПодключения";
	Запрос.УстановитьПараметр("ДоговорПодключения", ДоговорПодключения);

	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Определяет договор подключения к платежной системе по настройке подключения.
// 
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей - Настройка подключения к платежной системе
//  ТолькоДействующийДоговор - Булево - Подбирать только действующий договор.
// 
// Возвращаемое значение:
//  СправочникСсылка.ДоговорыЭквайринга - договор подключения к платежной системе
//
Функция ДоговорПодключения(НастройкаПодключения, ТолькоДействующийДоговор = Ложь) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор,
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграцииСПлатежнымиСистемамиУТ
	|ГДЕ
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция = &НастройкаПодключения
	|	И (&ВсеДоговора 
	|		ИЛИ НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует))";
	
	Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	Запрос.УстановитьПараметр("ВсеДоговора", Не ТолькоДействующийДоговор);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);

	Если Выборка.Следующий() Тогда
		Результат =  Выборка.Договор;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Определяет сумму, по который была выполнена последняя операции в платежной системе.
// Метод следует использовать для отложенного получения статуса выполнения операции.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииСБП - документ оплаты или возврата,
//      по которому были выполнены операции в платежных системах.
//
// Возвращаемое значение:
//  Число - Сумма последней операции с платежной системой
Функция СуммаОперации(ДокументОперации) Экспорт
	
	СуммаОплаты = 0;
	
	ДанныеОперацииПоДокументу = ПереводыСБПc2b.ОперацииПоДокументу(ДокументОперации);
	Если Не ДанныеОперацииПоДокументу.ДанныеОпераций.Количество() Тогда
		СуммаОплаты = ДанныеОперацииПоДокументу.Сумма;
	КонецЕсли;
	
	Возврат СуммаОплаты;
	
КонецФункции

// Заполнение массива шаблонов сообщений по типам документов.
// 
// Параметры:
//  Шаблоны - Массив Из Структура - Шаблоны
//
Процедура ПриОпределенииПредопределенныхШаблоновСообщенийСБППоТипам(Шаблоны) Экспорт
	
	ДобавитьШаблонЗаказКлиента(Шаблоны);
	ДобавитьШаблонСчетНаОплатуКлиенту(Шаблоны);
	ДобавитьШаблонАктВыполненныхРабот(Шаблоны);
	ДобавитьШаблонРеализацияТоваровУслуг(Шаблоны);
	ДобавитьШаблонРеализацияУслугПрочихАктивов(Шаблоны);
	
КонецПроцедуры

// См. СистемаБыстрыхПлатежейПереопределяемый.ПриОпределенииНастроекПодключения.
//
Процедура ПриОпределенииНастроекПодключенияСБП(Настройки) Экспорт
	
	// Подключение шаблонов назначения платежей для типов документов
	Для Каждого ОписаниеПараметров Из ТипыДокументовИспользующиеШаблоныНазначенияСБП() Цикл
		НовыйШаблон = Настройки.c2b.ШаблоныНазначений.Добавить();
		НовыйШаблон.ОбъектМетаданных = ОписаниеПараметров.Значение.Имя;
		НовыйШаблон.Идентификатор = ОписаниеПараметров.Значение.Имя;
		НовыйШаблон.Наименование = ОписаниеПараметров.Значение.Синоним;
		
		НовыйШаблонПараметры = НовыйШаблон.Параметры; // Массив
		Для Каждого ПараметрШаблона Из ПараметрыШаблонаНазначенияСБППоТипуДокумента(ОписаниеПараметров.Ключ) Цикл
			ОписаниеПараметра = Новый Структура("Наименование, Идентификатор");
			ЗаполнитьЗначенияСвойств(ОписаниеПараметра, ПараметрШаблона);
			НовыйШаблонПараметры.Добавить(ОписаниеПараметра);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область БиблиотекаПодключаемогоОборудования

// Управление видимостью элементов формы админиистрирования настроек работы с подключаемым оборудованием.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
//
Процедура УправлениеВидимостьюЭлементовНастроекЖурналовОперацийБПО(Форма) Экспорт
	
	Форма.Элементы.ГруппаОперацииОчередьЧеков.Видимость = Истина;
	Форма.Элементы.ГруппаОперацииПроверкиКМ.Видимость = Истина;
	
КонецПроцедуры

// Обрабатывает результат подтверждения возраста покупателя через мессенджер Макс.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
//  Результат - см. МенеджерОборудованияКлиент.ТипРезультатаПроверкиВозрастаВМакс
//  ДополнительныеПараметры - Структура из КлючИЗначение
//
Процедура ОбработатьРезультатПодтвержденияВозрастаПокупателяЧерезМакс(Форма, Результат, ДополнительныеПараметры) Экспорт

	ТипыРезультатаПроверки = ДополнительныеПараметры.ТипРезультатаПроверкиВозрастаВМакс;
	ИмяРеквизитаСостояниеПроверки = РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаСостояниеПроверкиВозрастаПокупателя();
	Если Результат.Результат = ТипыРезультатаПроверки.ВозрастПодтвержден Тогда
		Форма[ИмяРеквизитаСостояниеПроверки] = 3;
	ИначеЕсли Результат.Результат = ТипыРезультатаПроверки.ПозватьСотрудника Тогда
		Форма[ИмяРеквизитаСостояниеПроверки] = 5;
	ИначеЕсли Результат.Результат = ТипыРезультатаПроверки.Отмена Тогда
		Форма[ИмяРеквизитаСостояниеПроверки] = 4;
	ИначеЕсли Результат.Результат = ТипыРезультатаПроверки.Ошибка Тогда
		Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(Результат.ОписаниеОшибки);
		КонецЕсли;
		Форма[ИмяРеквизитаСостояниеПроверки] = 5;
	КонецЕсли;
	
	ОбновитьНастройкиФормыДляПроверкиВозрастаПокупателя(Форма);
КонецПроцедуры

#КонецОбласти

//-- Локализация

#Область КомиссионерВЧеке

// Возвращает перечень запросов (в виде списка) для составления пакетного запроса. 
// Последний запрос в списке фактически является результирующим. Состав полей последнего запроса:
//	   Номенклатура - СправочникСсылка.Номенклатура
//	   Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//	   Серия - СправочникСсылка.СерииНоменклатуры
//	   Комитент - СправочникСсылка.Организации,СправочникСсылка.Контрагенты.
//
// Параметры:
//	Организация - СправочникСсылка.Организации
//	Склад - СправочникСсылка.Склады
//	ИмяТаблицыКлючей - Строка - Имя ВТ, в которой будут переданы строки с ключами данных, пустая строка - для обмена(все товары). Обязательные колонки:
//	 *Номенклатура - СправочникСсылка.Номенклатура
//	 *Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//	 *Серия - СправочникСсылка.СерииНоменклатуры
//	СуффиксИменВТ - Строка - Окончание имен всех ВТ пакета, для исключения конфликтов имен в общем пакете
//	
// Возвращаемое значение:
//	Структура - Структура со свойствами:
//	*ПараметрыЗапроса - Структура - Структура со свойствами:
//	 **Ключ - Строка
//	*ПакетЗапросов - СписокЗначений из ЭлементСпискаЗначений:
//	 **Представление - Строка - Имя временной таблицы, создаваемой в запросе
//	 **Значение - Строка - Текст единичного запроса
//
Функция ЗапросДанныхКомитентовПоТоварам(Знач Организация, Знач Склад, Знач ИмяТаблицыКлючей = "", Знач СуффиксИменВТ = "") Экспорт
	
	ИспользоватьКомиссию = Истина;
	//++ Локализация
	ИспользоватьКомиссию = ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриЗакупках");
	//-- Локализация
	ИспользоватьИнтеркампани = 
		ИспользоватьКомиссию И ПолучитьФункциональнуюОпцию("ИспользоватьПередачиТоваровМеждуОрганизациями");
	ЭтоЗапросОбмена = ПустаяСтрока(ИмяТаблицыКлючей);
	Если НЕ ИспользоватьКомиссию И НЕ ЭтоЗапросОбмена Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
		|	НЕОПРЕДЕЛЕНО КАК Комитент
		|ПОМЕСТИТЬ ДанныеОстатковВключаяКомитентов_ПодменныйСуффикс
		|ГДЕ
		|	ЛОЖЬ";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_ПодменныйСуффикс", СокрЛП(СуффиксИменВТ));
		
		ЗапросыПакета = Новый СписокЗначений;
		ЗапросыПакета.Добавить(ТекстЗапроса, "ДанныеОстатковВключаяКомитентов"+СокрЛП(СуффиксИменВТ)); 
		Результат = Новый Структура("ПараметрыЗапроса, ПакетЗапросов", Новый Структура, ЗапросыПакета);
		
		Возврат Результат;
		
	КонецЕсли; 
	
	СуффикИменПоУмолчанию = "ДанныеКомитентовПоТоварам";
	СуффиксИмен = ?(ПустаяСтрока(СуффиксИменВТ), СуффикИменПоУмолчанию, СуффиксИменВТ);
	
	ПараметрыЗапросаИсходные = Новый Структура();
	
	ПараметрыЗапросаИсходные.Вставить("ОтборОрганизацияПродавец_ПодменныйСуффикс", Организация);
	ПараметрыЗапросаИсходные.Вставить("ОтборМестоХраненияПродавца_ПодменныйСуффикс", Склад);
	ПараметрыЗапросаИсходные.Вставить("НижняяДатаОткрытыхСмен_ПодменныйСуффикс", ТекущаяДатаСеанса()-60*60*24*2);
	
	СпособыПередачиТоваров = Новый Массив;
	СпособыПередачиТоваров.Добавить(Перечисления.СпособыПередачиТоваров.Продажа);
	//++ Локализация
	Если ИспользоватьКомиссию Тогда
		СпособыПередачиТоваров.Добавить(Перечисления.СпособыПередачиТоваров.ПередачаНаКомиссию);
	КонецЕсли;
	//-- Локализация
	ПараметрыЗапросаИсходные.Вставить("СпособыПередачиТоваров_ПодменныйСуффикс", СпособыПередачиТоваров);
	
	ОтборТипыЗапасов = Новый Массив;
	ОтборТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.Товар);
	//++ Локализация
	Если ИспользоватьКомиссию Тогда
		ОтборТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.КомиссионныйТовар);
	КонецЕсли;
	//-- Локализация
	ОтборТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажи);
	ПараметрыЗапросаИсходные.Вставить("ОтборТипыЗапасов_ПодменныйСуффикс", ОтборТипыЗапасов);
	
		ПараметрыЗапросаИсходные.Вставить("УсловиеИсключенияЗапроса_Интеркампани_ПодменныйСуффикс", ИспользоватьИнтеркампани);
	
	ЗапросыПакета = Новый СписокЗначений;
	ПараметрыЗапросаФинальные = Новый Структура;
	
	ПодменыИмен = Новый СписокЗначений();
	ПодменыИмен.Добавить("#КоллекцияТовары", ИмяТаблицыКлючей);
	Для Каждого Элем Из ПараметрыЗапросаИсходные Цикл
		НовоеИмяКлюча = СтрЗаменить(Элем.Ключ, "_ПодменныйСуффикс", СуффиксИмен);
		ПодменыИмен.Добавить(Элем.Ключ, НовоеИмяКлюча);
		ПараметрыЗапросаФинальные.Вставить(НовоеИмяКлюча,Элем.Значение);
	КонецЦикла;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияПродавец КАК ОрганизацияПродавец,
	|	НастройкаПередачиТоваровМеждуОрганизациями.СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияВладелец КАК ОрганизацияВладелец,
	|	НастройкаПередачиТоваровМеждуОрганизациями.ТипЗапасов КАК ТипЗапасовВладельца
	|ПОМЕСТИТЬ НастройкиПередачи_ПодменныйСуффикс
	|ИЗ
	|	РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями КАК НастройкаПередачиТоваровМеждуОрганизациями
	|ГДЕ
	|	НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияПродавец = &ОтборОрганизацияПродавец_ПодменныйСуффикс
	|	И НастройкаПередачиТоваровМеждуОрганизациями.СпособПередачиТоваров В(&СпособыПередачиТоваров_ПодменныйСуффикс)
	|	И &УсловиеИсключенияЗапроса_Интеркампани_ПодменныйСуффикс
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОрганизацияВладелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьЗаписи
	|ПОМЕСТИТЬ ЕстьНастройкиПередачи_ПодменныйСуффикс
	|ИЗ
	|	НастройкиПередачи_ПодменныйСуффикс КАК НастройкиПередачи
	|ГДЕ
	|	&УсловиеИсключенияЗапроса_Интеркампани_ПодменныйСуффикс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокЧек.Ссылка КАК Ссылка,
	|	ДокЧек.Организация КАК Организация,
	|	NULL КАК СвязьСторно
	|ПОМЕСТИТЬ ЧекиОткрытыхСмен_ПодменныйСуффикс
	|ИЗ
	|	Документ.ЧекККМ КАК ДокЧек
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК ДокСмена
	|	ПО ДокЧек.КассоваяСмена = ДокСмена.Ссылка
	|ГДЕ
	|	ДокЧек.Склад = &ОтборМестоХраненияПродавца_ПодменныйСуффикс
	|	И ДокЧек.Организация = &ОтборОрганизацияПродавец_ПодменныйСуффикс
	|	И ДокЧек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И ДокСмена.ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|	И ДокЧек.Дата > &НижняяДатаОткрытыхСмен_ПодменныйСуффикс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокЧек.Ссылка КАК Чек,
	|	ДокЧек.Организация КАК Организация,
	|	NULL
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ДокЧек
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК ДокСмена
	|	ПО ДокЧек.КассоваяСмена = ДокСмена.Ссылка
	|ГДЕ
	|	ДокЧек.Склад = &ОтборМестоХраненияПродавца_ПодменныйСуффикс
	|	И ДокЧек.Организация = &ОтборОрганизацияПродавец_ПодменныйСуффикс
	|	И ДокЧек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И ДокСмена.ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|	И ДокЧек.Дата > &НижняяДатаОткрытыхСмен_ПодменныйСуффикс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ДокЧек.ЧекККМ КАК Чек,
	|	ДокЧек.Организация КАК Организация,
	|	ДокЧек.Ссылка
	|ИЗ
	|	Документ.ЧекККМКоррекции КАК ДокЧек
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК ДокСмена
	|	ПО ДокЧек.КассоваяСмена = ДокСмена.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ЧекСторнируемый
	|	ПО ДокЧек.ЧекККМ = ЧекСторнируемый.Ссылка
	|ГДЕ
	|	ДокЧек.Склад = &ОтборМестоХраненияПродавца_ПодменныйСуффикс
	|	И ДокЧек.Организация = &ОтборОрганизацияПродавец_ПодменныйСуффикс
	|	И ДокЧек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И ДокСмена.ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|	И ДокЧек.Дата > &НижняяДатаОткрытыхСмен_ПодменныйСуффикс
	|	И ЧекСторнируемый.Склад = &ОтборМестоХраненияПродавца_ПодменныйСуффикс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокЧек.Ссылка КАК Чек,
	|	ДокЧек.Организация КАК Организация,
	|	ДокЧек.ЧекККМ
	|ИЗ
	|	Документ.ЧекККМКоррекции КАК ДокЧек
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК ДокСмена
	|	ПО ДокЧек.КассоваяСмена = ДокСмена.Ссылка
	|ГДЕ
	|	ДокЧек.Склад = &ОтборМестоХраненияПродавца_ПодменныйСуффикс
	|	И ДокЧек.Организация = &ОтборОрганизацияПродавец_ПодменныйСуффикс
	|	И ДокЧек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И ДокСмена.ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|	И ДокЧек.Дата > &НижняяДатаОткрытыхСмен_ПодменныйСуффикс
	|
	|ИНДЕКСИРОВАТЬ ПО 
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Чек.Ссылка КАК Чек,
	|	Чек.СвязьСторно КАК СвязьСторно,
	|	Чек.Организация КАК Организация,
	|	ЧекТовары.Номенклатура КАК Номенклатура,
	|	ЧекТовары.Характеристика КАК Характеристика,
	|	ЧекТовары.Серия КАК Серия,
	|	ЧекТовары.Комитент КАК КомитентЧека,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЧекТовары.Комитент) = ТИП(Справочник.Контрагенты)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	КОНЕЦ КАК ТипЗапаса,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЧекТовары.Комитент) = ТИП(Справочник.Организации)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПриоритетПоТипуЗапасаТовара,
	|	ВЫБОР
	|		КОГДА Чек.СвязьСторно ЕСТЬ NULL
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ * ЧекТовары.Количество КАК Количество
	|ПОМЕСТИТЬ ДанныеОткрытыхСмен_ПодменныйСуффикс
	|ИЗ
	|	ЧекиОткрытыхСмен_ПодменныйСуффикс КАК Чек
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ЧекТовары
	|		ПО Чек.Ссылка = ЧекТовары.Ссылка
	|ГДЕ
	|	&УсловиеПодмены_ОтборЧековПоСоставу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Чек.Ссылка,
	|	Чек.СвязьСторно,
	|	Чек.Организация,
	|	ЧекТовары.Номенклатура,
	|	ЧекТовары.Характеристика,
	|	ЧекТовары.Серия,
	|	ЧекТовары.Комитент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЧекТовары.Комитент) = ТИП(Справочник.Контрагенты)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЧекТовары.Комитент) = ТИП(Справочник.Организации)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ЧекТовары.Количество
	|ИЗ
	|	ЧекиОткрытыхСмен_ПодменныйСуффикс КАК Чек
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.Товары КАК ЧекТовары
	|		ПО Чек.Ссылка = ЧекТовары.Ссылка
	|ГДЕ
	|	&УсловиеПодмены_ОтборЧековПоСоставу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Чек.Ссылка,
	|	Чек.СвязьСторно,
	|	Чек.Организация,
	|	ЧекТовары.Номенклатура,
	|	ЧекТовары.Характеристика,
	|	ЧекТовары.Серия,
	|	ЧекТовары.Комитент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЧекТовары.Комитент) = ТИП(Справочник.Контрагенты)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЧекТовары.Комитент) = ТИП(Справочник.Организации)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ЧекТовары.Количество * -1
	|ИЗ
	|	ЧекиОткрытыхСмен_ПодменныйСуффикс КАК Чек
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМКоррекции.Товары КАК ЧекТовары
	|		ПО Чек.Ссылка = ЧекТовары.Ссылка
	|ГДЕ
	|	&УсловиеПодмены_ОтборЧековПоСоставу
	|
	|ИНДЕКСИРОВАТЬ ПО 
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ВидыЗапасов.Ссылка КАК Ссылка,
	|	ВидыЗапасов.ТипЗапасов КАК ТипЗапасов
	|ПОМЕСТИТЬ ОтборВидыЗапасов_ПодменныйСуффикс
	|ИЗ
	|	Справочник.ВидыЗапасов КАК ВидыЗапасов
	|ГДЕ 
	|	ВидыЗапасов.ТипЗапасов В (&ОтборТипыЗапасов_ПодменныйСуффикс)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	НастройкиПередачи.ОрганизацияПродавец КАК ОрганизацияПродавец,
	|	НастройкиПередачи.СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	НастройкиПередачи.ОрганизацияВладелец КАК ОрганизацияВладелец,
	|	НастройкиПередачи.ТипЗапасовВладельца КАК ТипЗапасовВладельца,
	|	ВидыЗапасов.Ссылка КАК ВидЗапасовВладельца
	|ПОМЕСТИТЬ НастройкиПередачиДополненныеВидамиЗапасов_ПодменныйСуффикс
	|ИЗ
	|	ОтборВидыЗапасов_ПодменныйСуффикс КАК ВидыЗапасов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиПередачи_ПодменныйСуффикс КАК НастройкиПередачи
	|	ПО ВидыЗапасов.ТипЗапасов = НастройкиПередачи.ТипЗапасовВладельца
	|ГДЕ
	|	&УсловиеИсключенияЗапроса_Интеркампани_ПодменныйСуффикс
	|
	|ИНДЕКСИРОВАТЬ ПО 
	|	ВидЗапасовВладельца,
	|	ОрганизацияВладелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ТоварыОрганизацийОстатки.Организация КАК Организация,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТоварыОрганизацийОстатки.ВидЗапасов КАК ВидЗапасов,
	|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОтаткиОрганизацийВладельцев_ПодменныйСуффикс
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			,
	|			Организация В
	|					(ВЫБРАТЬ
	|						НастройкиПередачи.ОрганизацияВладелец
	|					ИЗ
	|						НастройкиПередачи_ПодменныйСуффикс КАК НастройкиПередачи)
	|				И АналитикаУчетаНоменклатуры В
	|					(ВЫБРАТЬ
	|						КлючиАналитикиУчетаНоменклатуры.КлючАналитики
	|					ИЗ
	|						РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|					ГДЕ
	|						КлючиАналитикиУчетаНоменклатуры.МестоХранения = &ОтборМестоХраненияПродавца_ПодменныйСуффикс
	|						И &УсловиеПодмены_ОтборПоКоллекцииТоваров)
	|				И ВидЗапасов В (ВЫБРАТЬ Ссылка ИЗ ОтборВидыЗапасов_ПодменныйСуффикс)) КАК ТоварыОрганизацийОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЕстьНастройкиПередачи_ПодменныйСуффикс КАК ЕстьНастройкиПередачи
	|		ПО ЕстьНастройкиПередачи.ЕстьЗаписи
	|ГДЕ
	|	&УсловиеИсключенияЗапроса_Интеркампани_ПодменныйСуффикс
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЗапасов,
	|	Организация 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Остаток"" КАК Чек,
	|	""Собственный"" КАК ДопИнфо,
	|	ТоварыОрганизацийОстатки.Организация КАК Организация,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаНоменклатура,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК АналитикаХарактеристика,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Серия КАК АналитикаСерия,
	|	ТоварыОрганизацийОстатки.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	ВЫБОР 
	|		КОГДА ТоварыОрганизацийОстатки.ВидЗапасов.ТипЗапасов = 
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА 3
	|		ИНАЧЕ 1
	|	КОНЕЦ ПриоритетПоТипуЗапасаТовара,
	|	ТоварыОрганизацийОстатки.ВидЗапасов.Контрагент КАК Комитент,
	|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ДанныеПоВидамЗапасовДоСвертки_ПодменныйСуффикс
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			,
	|			Организация = &ОтборОрганизацияПродавец_ПодменныйСуффикс
	|				И АналитикаУчетаНоменклатуры В
	|					(ВЫБРАТЬ
	|						КлючиАналитикиУчетаНоменклатуры.КлючАналитики
	|					ИЗ
	|						РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|					ГДЕ
	|						КлючиАналитикиУчетаНоменклатуры.МестоХранения = &ОтборМестоХраненияПродавца_ПодменныйСуффикс
	|						И &УсловиеПодмены_ОтборПоКоллекцииТоваров)
	|				И ВидЗапасов В (ВЫБРАТЬ Ссылка ИЗ ОтборВидыЗапасов_ПодменныйСуффикс)) КАК ТоварыОрганизацийОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Остаток"",
	|	""Интеркампани"",
	|	ТоварыОрганизацийОстатки.Организация,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Серия,
	|	ВЫБОР
	|		КОГДА НастройкиПередачи.СпособПередачиТоваров = ЗНАЧЕНИЕ(Перечисление.СпособыПередачиТоваров.Продажа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	КОНЕЦ,
	|	2,
	|	ВЫБОР 
	|		КОГДА НастройкиПередачи.СпособПередачиТоваров = ЗНАЧЕНИЕ(Перечисление.СпособыПередачиТоваров.Продажа) 
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|		ИНАЧЕ НастройкиПередачи.ОрганизацияВладелец 
	|	КОНЕЦ,
	|	ТоварыОрганизацийОстатки.КоличествоОстаток
	|ИЗ
	|	ОтаткиОрганизацийВладельцев_ПодменныйСуффикс КАК ТоварыОрганизацийОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиПередачиДополненныеВидамиЗапасов_ПодменныйСуффикс КАК НастройкиПередачи
	|		ПО ТоварыОрганизацийОстатки.Организация = НастройкиПередачи.ОрганизацияВладелец
	|			И ТоварыОрганизацийОстатки.ВидЗапасов = НастройкиПередачи.ВидЗапасовВладельца
	|ГДЕ
	|	&УсловиеИсключенияЗапроса_Интеркампани_ПодменныйСуффикс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОткрытыхСмен.Чек,
	|	ДанныеОткрытыхСмен.СвязьСторно,
	|	ДанныеОткрытыхСмен.Организация,
	|	ДанныеОткрытыхСмен.Номенклатура,
	|	ДанныеОткрытыхСмен.Характеристика,
	|	ДанныеОткрытыхСмен.Серия,
	|	ДанныеОткрытыхСмен.ТипЗапаса,
	|	ДанныеОткрытыхСмен.ПриоритетПоТипуЗапасаТовара,
	|	ДанныеОткрытыхСмен.КомитентЧека,
	|	ДанныеОткрытыхСмен.Количество
	|ИЗ
	|	ДанныеОткрытыхСмен_ПодменныйСуффикс КАК ДанныеОткрытыхСмен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаНоменклатура,
	|	АналитикаХарактеристика,
	|	АналитикаСерия
	|	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоВидамЗапасов.Организация КАК Организация,
	|	ДанныеПоВидамЗапасов.АналитикаНоменклатура КАК АналитикаНоменклатура,
	|	ДанныеПоВидамЗапасов.АналитикаХарактеристика КАК АналитикаХарактеристика,
	|	ДанныеПоВидамЗапасов.АналитикаСерия КАК АналитикаСерия,
	|	ДанныеПоВидамЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	ДанныеПоВидамЗапасов.ПриоритетПоТипуЗапасаТовара КАК ПриоритетПоТипуЗапасаТовара,
	|	ДанныеПоВидамЗапасов.Комитент КАК Комитент,
	|	СУММА(ДанныеПоВидамЗапасов.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ДанныеПоВидамЗапасов_ПодменныйСуффикс
	|ИЗ
	|	ДанныеПоВидамЗапасовДоСвертки_ПодменныйСуффикс КАК ДанныеПоВидамЗапасов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоВидамЗапасов.Организация,
	|	ДанныеПоВидамЗапасов.АналитикаНоменклатура,
	|	ДанныеПоВидамЗапасов.АналитикаХарактеристика,
	|	ДанныеПоВидамЗапасов.АналитикаСерия,
	|	ДанныеПоВидамЗапасов.ТипЗапасов,
	|	ДанныеПоВидамЗапасов.ПриоритетПоТипуЗапасаТовара,
	|	ДанныеПоВидамЗапасов.Комитент
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеПоВидамЗапасов.КоличествоОстаток) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаНоменклатура,
	|	АналитикаХарактеристика,
	|	АналитикаСерия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоВидамЗапасов.АналитикаНоменклатура КАК Номенклатура,
	|	ДанныеПоВидамЗапасов.АналитикаХарактеристика КАК Характеристика,
	|	ДанныеПоВидамЗапасов.АналитикаСерия КАК Серия,
	|	МИНИМУМ(ДанныеПоВидамЗапасов.ПриоритетПоТипуЗапасаТовара) КАК ПриоритетПоТипуЗапасаТовара
	|ПОМЕСТИТЬ ОтборПоПриоритету_ПодменныйСуффикс
	|	ИЗ
	|		ДанныеПоВидамЗапасов_ПодменныйСуффикс КАК ДанныеПоВидамЗапасов
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоВидамЗапасов.АналитикаНоменклатура,
	|	ДанныеПоВидамЗапасов.АналитикаХарактеристика,
	|	ДанныеПоВидамЗапасов.АналитикаСерия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоВидамЗапасов.АналитикаНоменклатура КАК Номенклатура,
	|	ДанныеПоВидамЗапасов.АналитикаХарактеристика КАК Характеристика,
	|	ДанныеПоВидамЗапасов.АналитикаСерия КАК Серия,
	|	ДанныеПоВидамЗапасов.ПриоритетПоТипуЗапасаТовара КАК ПриоритетПоТипуЗапасаТовара,
	|	Максимум(ДанныеПоВидамЗапасов.КоличествоОстаток) КАК КоличествоОстаток
	|	
	|ПОМЕСТИТЬ ОтборПоПриоритетуКоличеству_ПодменныйСуффикс
	|
	|ИЗ
	|	ДанныеПоВидамЗапасов_ПодменныйСуффикс КАК ДанныеПоВидамЗапасов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборПоПриоритету_ПодменныйСуффикс КАК ОтборПоПриоритету
	|	ПО ДанныеПоВидамЗапасов.АналитикаНоменклатура = ОтборПоПриоритету.Номенклатура
	|	И ДанныеПоВидамЗапасов.АналитикаХарактеристика = ОтборПоПриоритету.Характеристика
	|	И ДанныеПоВидамЗапасов.АналитикаСерия = ОтборПоПриоритету.Серия
	|	И ДанныеПоВидамЗапасов.ПриоритетПоТипуЗапасаТовара = ОтборПоПриоритету.ПриоритетПоТипуЗапасаТовара
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоВидамЗапасов.АналитикаНоменклатура,
	|	ДанныеПоВидамЗапасов.АналитикаХарактеристика,
	|	ДанныеПоВидамЗапасов.АналитикаСерия,
	|	ДанныеПоВидамЗапасов.ПриоритетПоТипуЗапасаТовара
	|
	|ИНДЕКСИРОВАТЬ ПО 
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоВидамЗапасов.АналитикаНоменклатура КАК Номенклатура,
	|	ДанныеПоВидамЗапасов.АналитикаХарактеристика КАК Характеристика,
	|	ДанныеПоВидамЗапасов.АналитикаСерия КАК Серия,
	|	МАКСИМУМ(ДанныеПоВидамЗапасов.Комитент) КАК Комитент
	|ПОМЕСТИТЬ ДанныеОстатковВключаяКомитентов_ПодменныйСуффикс
	|
	|ИЗ
	|	ДанныеПоВидамЗапасов_ПодменныйСуффикс КАК ДанныеПоВидамЗапасов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборПоПриоритетуКоличеству_ПодменныйСуффикс КАК ОтборПоПриоритету
	|	ПО ДанныеПоВидамЗапасов.АналитикаНоменклатура = ОтборПоПриоритету.Номенклатура
	|	И ДанныеПоВидамЗапасов.АналитикаХарактеристика = ОтборПоПриоритету.Характеристика
	|	И ДанныеПоВидамЗапасов.АналитикаСерия = ОтборПоПриоритету.Серия
	|	И ДанныеПоВидамЗапасов.ПриоритетПоТипуЗапасаТовара = ОтборПоПриоритету.ПриоритетПоТипуЗапасаТовара
	|	И ДанныеПоВидамЗапасов.КоличествоОстаток = ОтборПоПриоритету.КоличествоОстаток
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоВидамЗапасов.АналитикаНоменклатура,
	|	ДанныеПоВидамЗапасов.АналитикаХарактеристика,
	|	ДанныеПоВидамЗапасов.АналитикаСерия
	|ИНДЕКСИРОВАТЬ ПО 
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|";
	
	УсловиеПодмены = "&УсловиеПодмены_ОтборПоКоллекцииТоваров";
	Если ЭтоЗапросОбмена Тогда
		ЗначениеПодмены = "ИСТИНА";
	Иначе
		ЗначениеПодмены = "(КлючиАналитикиУчетаНоменклатуры.Номенклатура, КлючиАналитикиУчетаНоменклатуры.Характеристика, КлючиАналитикиУчетаНоменклатуры.Серия) 
							|		В (ВЫБРАТЬ Номенклатура, Характеристика, Серия ИЗ  #КоллекцияТовары)";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, УсловиеПодмены, ЗначениеПодмены);
	
	УсловиеПодмены = "&УсловиеПодмены_ОтборЧековПоСоставу";
	Если ЭтоЗапросОбмена Тогда
		ЗначениеПодмены = "ИСТИНА";
	Иначе
		ЗначениеПодмены = "	(ЧекТовары.Номенклатура, ЧекТовары.Характеристика, ЧекТовары.Серия) В
					|			(ВЫБРАТЬ
					|				КоллекцияТовары.Номенклатура,
					|				КоллекцияТовары.Характеристика,
					|				КоллекцияТовары.Серия
					|			ИЗ
					|				#КоллекцияТовары КАК КоллекцияТовары)";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, УсловиеПодмены, ЗначениеПодмены);
	
	ЗапросыПакета = РазбитьПакетныйЗапрос(ТекстЗапроса);

	УдаляемыеЗапросыПакета = Новый Массив;
	КорректируемыеЗапросыПакета = Новый Массив;
	Если НЕ ИспользоватьИнтеркампани Тогда
		УдаляемыеЗапросыПакета.Добавить("НастройкиПередачи_ПодменныйСуффикс");
		УдаляемыеЗапросыПакета.Добавить("ЕстьНастройкиПередачи_ПодменныйСуффикс");
		УдаляемыеЗапросыПакета.Добавить("ОтаткиОрганизацийВладельцев_ПодменныйСуффикс");
		УдаляемыеЗапросыПакета.Добавить("НастройкиПередачиДополненныеВидамиЗапасов_ПодменныйСуффикс");
		КорректируемыеЗапросыПакета.Добавить("ДанныеПоВидамЗапасовДоСвертки_ПодменныйСуффикс");
	КонецЕсли;
	
	РазмерПакета = ЗапросыПакета.Количество();
	Для СчИндексЗапроса = 1 по РазмерПакета Цикл
		ЭлементСписка = ЗапросыПакета.Получить(РазмерПакета - СчИндексЗапроса);
		Если УдаляемыеЗапросыПакета.Найти(ЭлементСписка.Представление) <> Неопределено Тогда
			ЗапросыПакета.Удалить(ЭлементСписка);
		ИначеЕсли КорректируемыеЗапросыПакета.Найти(ЭлементСписка.Представление) <> Неопределено Тогда
			РазделительЛитерал = "ОБЪЕДИНИТЬ ВСЕ";
			ЧастиОбъединения = 
				СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЭлементСписка.Значение, РазделительЛитерал);
			КолвоЧастей = ЧастиОбъединения.Количество();
			ЕстьКоррекция = Ложь;
			Для СчИндексЧасти = 1 по КолвоЧастей-2 Цикл
				ЭлементОбъединения = ЧастиОбъединения[КолвоЧастей-1-СчИндексЧасти];
				Если НЕ ИспользоватьИнтеркампани 
					И СтрНайти(ЭлементОбъединения, "УсловиеИсключенияЗапроса_Интеркампани_ПодменныйСуффикс") Тогда
					ЧастиОбъединения.Удалить(КолвоЧастей-1-СчИндексЧасти);
					ЕстьКоррекция = Истина;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьКоррекция Тогда
				ЭлементСписка.Значение = СтрСоединить(ЧастиОбъединения, РазделительЛитерал);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлемЗапрос Из ЗапросыПакета Цикл
		ПодменыИмен.Добавить(ЭлемЗапрос.Представление, СтрЗаменить(ЭлемЗапрос.Представление, "_ПодменныйСуффикс", СуффиксИмен));
		Для Каждого ЭлемПодмена Из ПодменыИмен Цикл
			ЭлемЗапрос.Значение = СтрЗаменить(ЭлемЗапрос.Значение, ЭлемПодмена.Значение, ЭлемПодмена.Представление);
			ЭлемЗапрос.Представление = СтрЗаменить(ЭлемЗапрос.Представление, ЭлемПодмена.Значение, ЭлемПодмена.Представление);
		КонецЦикла;
	КонецЦикла;
	
	Результат = Новый Структура("ПараметрыЗапроса, ПакетЗапросов", ПараметрыЗапросаФинальные, ЗапросыПакета);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПолучениеВнешнихКомпонент

// Заполнить описание настраиваемых регламентных заданий.
// 
// Параметры:
//  ОписаниеНастраиваемыхРегламентныхЗаданий - Структура - Описание настраиваемых регламентных заданий
Процедура ЗаполнитьОписаниеНастраиваемыхРегламентныхЗаданий(ОписаниеНастраиваемыхРегламентныхЗаданий) Экспорт
	
	//++ Локализация
	Если ТипЗнч(ОписаниеНастраиваемыхРегламентныхЗаданий) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеНастраиваемыхРегламентныхЗаданий.Вставить("ОчисткаИсторииОперацийПроверкиКМ", 
			Новый Структура("ИмяМетаданныхРегламентногоЗадания, МетаданныеДляПроверкиПравДоступаНаИзменение",
					Метаданные.РегламентныеЗадания.ОчисткаИсторииОперацийПроверкиКМ.Имя, Новый СписокЗначений));
	
	ОписаниеНастраиваемыхРегламентныхЗаданий.Вставить("ОчисткаИсторииОперацийОчередиЧеков", 
			Новый Структура("ИмяМетаданныхРегламентногоЗадания, МетаданныеДляПроверкиПравДоступаНаИзменение",
					Метаданные.РегламентныеЗадания.ОчисткаИсторииОперацийОчередиЧеков.Имя, Новый СписокЗначений));
	
	ОписаниеНастраиваемыхРегламентныхЗаданий.Вставить("ОбновленияВнешнихКомпонент", 
			Новый Структура("ИмяМетаданныхРегламентногоЗадания, МетаданныеДляПроверкиПравДоступаНаИзменение",
					Метаданные.РегламентныеЗадания.ОбновлениеВнешнихКомпонент.Имя, Новый СписокЗначений));
	//-- Локализация
	
КонецПроцедуры

// Устанавливает видимость разделов интернет поддержки на форме
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура УстановитьВидимостьРазделов(Форма) Экспорт
	
	//++ Локализация
	
	// ИнтернетПоддержкаПользователей.ПолучениеВнешнихКомпонент
	Если ОбщегоНазначенияБПО.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПолучениеВнешнихКомпонент") Тогда
		МодульПолучениеВнешнихКомпонент = ОбщегоНазначенияБПО.ОбщийМодуль("ПолучениеВнешнихКомпонент");
		Форма.Элементы.ГруппаВнешниеКомпоненты.Видимость = МодульПолучениеВнешнихКомпонент.ДоступнаЗагрузкаВнешнихКомпонент();
	Иначе
		Форма.Элементы.ГруппаВнешниеКомпоненты.Видимость = Ложь;
	КонецЕсли;
	// Конец ИнтернетПоддержкаПользователей.ПолучениеВнешнихКомпонент
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

// Получает платежную ссылку по переданному документу, преобразует ее в изображение QR кода СБП
// и устанавливает значение параметра QRКодКартинка. В случае успеха возвращает Истину.
// 
// Параметры:
//  ДанныеПечати - Структура:
//    *Организация - СправочникСсылка.Организации
//    *Ссылка - ДокументСсылка
//  QRКодКартинка - Картинка
//  Размер - Число
//  
// Возвращаемое значение:
//  Булево - 
//
Функция ВывестиQRКод(ДанныеПечати, QRКодКартинка, Размер) Экспорт
	
	Результат = Ложь;
	
//++ Локализация
	
	Если ПереводыСБПc2b.ПереводыСБПДоступны() Тогда
		
		ДанныеПлатежнойСсылки = РегистрыСведений.ИдентификаторыОперацийСБПc2b.ДанныеПлатежнойСсылки(ДанныеПечати.Ссылка);
		Если Не ДанныеПлатежнойСсылки = Неопределено Тогда
			
			ДанныеQRКода = СистемаБыстрыхПлатежей.ИзображениеQRКодаСБП(ДанныеПлатежнойСсылки.ПлатежнаяСсылка, Размер, 0);
			Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
				QRКодКартинка = Новый Картинка(ДанныеQRКода);
				Результат = Истина;
			Иначе
				Шаблон = Нстр("ru = 'Не удалось сформировать QR-код СБП для документа %1.
					|Технические подробности см. в журнале регистрации.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ДанныеПечати.Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
//-- Локализация

	Возврат Результат;
КонецФункции

// Управление видимостью элементов формы админиистрирования настроек работы с подключаемым оборудованием
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
//
Процедура ПанельАдминистрированияУТНастройкиРМКИОборудованияНастроитьВидимостьЭлементов(Форма) Экспорт
	//++ Локализация
	УправлениеВидимостьюЭлементовНастроекЖурналовОперацийБПО(Форма);
	//-- Локализация
КонецПроцедуры

// Описание обработчиков строк коллекции:
// 
// Параметры:
//  ОбработчикиСтрок - СписокЗначений из Строка - Содержит в себе соответствие действия над строкой и метода.
//
Процедура ПриДобавленииОбработчиковСтрокКоллекции(ОбработчикиСтрок) Экспорт
	
	//++ Локализация
	ОбработчикиСтрок.Добавить("ЗаполнитьСобственникаТовараИСтавкуНДСПриУСНКомитентов",
		"ПакетнаяОбработкаТабличнойЧастиСерверЛокализация.ЗаполнитьСобственникаТовараИСтавкуНДСПриУСНКомитентовВСтрокеТЧ");
	//-- Локализация
	
КонецПроцедуры

// Разделяет строки переданной таблицы на те, в которых нужно заполнить цену и те, в которых цену заполнять не нужно. 
// Используется для разделения действий пакетной обработки табличных частей в розничных документах.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - 
//  ИсходныеСтроки - ДокументТабличнаяЧасть.ЧекККМ.Товары, ДокументТабличнаяЧасть.ЧекККМВозврат.Товары - 
//  СтрокиДляРазныхТиповДействий - Структура:
//		*НеТребуетсяЗаполнитьЦену - Массив Из ДокументТабличнаяЧастьСтрока.ЧекККМ.Товары, ДокументТабличнаяЧастьСтрока.ЧекККМВозврат.Товары -
//		*ТребуетсяЗаполнитьЦену - Массив Из ДокументТабличнаяЧастьСтрока.ЧекККМ.Товары, ДокументТабличнаяЧастьСтрока.ЧекККМВозврат.Товары -
//
Процедура РазделитьМассивСтрокДляРазныхТиповПакетнойОбработки(Форма, ИсходныеСтроки, СтрокиДляРазныхТиповДействий) Экспорт

	//++ Локализация
	Если РозничныеПродажиКлиентСерверЛокализация.РозничныеПродажиТабачнойПродукцииТолькоПоМРЦ(Форма) Тогда
		СтрокиДляРазныхТиповДействий.ТребуетсяЗаполнитьЦену.Очистить();
		Для Каждого ИсходнаяСтрока Из ИсходныеСтроки Цикл
			Если ИсходнаяСтрока[РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаУстановленаМРЦ()] = Истина Тогда
				СтрокиДляРазныхТиповДействий.НеТребуетсяЗаполнитьЦену.Добавить(ИсходнаяСтрока);
			Иначе	
				СтрокиДляРазныхТиповДействий.ТребуетсяЗаполнитьЦену.Добавить(ИсходнаяСтрока);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация

// Проверяет, есть ли колонка в таблице
// 
// Параметры:
//  Таблица - ТаблицаЗначений - Таблица, в которой проверяется наличие колонки
//  ИмяКолонки - Строка - Имя искомой колонки
// 
// Возвращаемое значение:
//  Булево - Есть колонка в таблице
Функция ЕстьКолонкаВТаблице(Таблица, ИмяКолонки)
	
	Возврат ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Таблица, ИмяКолонки);
	
КонецФункции

// Новая таблица распределенных товаров по штрихкодам.
// 
// Параметры:
//  ТаблицаСОбщимиКолонками - ТаблицаЗначений - Таблица с общими колонками
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица для распределения товаров по штрихкодам, если нужно (маркированный товар)
Функция НоваяТаблицаРаспределенныхТоваровПоШтрихкодам(ТаблицаСОбщимиКолонками)
	
	Если Не ЕстьКолонкаВТаблице(ТаблицаСОбщимиКолонками, "Штрихкод") Тогда
		ТаблицаСОбщимиКолонками.Колонки.Добавить("Штрихкод");
	КонецЕсли;
	Если Не ЕстьКолонкаВТаблице(ТаблицаСОбщимиКолонками, "ТекстОшибки") Тогда
		ТаблицаСОбщимиКолонками.Колонки.Добавить("ТекстОшибки");
	КонецЕсли;
	Если Не ЕстьКолонкаВТаблице(ТаблицаСОбщимиКолонками, "КоэффициентПересчетаУпаковки") Тогда
		ТаблицаСОбщимиКолонками.Колонки.Добавить("КоэффициентПересчетаУпаковки");
	КонецЕсли;
	Если Не ЕстьКолонкаВТаблице(ТаблицаСОбщимиКолонками, "РезультатРаспределения") Тогда
		ТаблицаСОбщимиКолонками.Колонки.Добавить("РезультатРаспределения");
	КонецЕсли;
	Если Не ЕстьКолонкаВТаблице(ТаблицаСОбщимиКолонками, "ТребуетсяПересчетИзУпаковкиВБазовуюЕдиницуИзмерения") Тогда
		ТаблицаСОбщимиКолонками.Колонки.Добавить("ТребуетсяПересчетИзУпаковкиВБазовуюЕдиницуИзмерения");
	КонецЕсли;
	Если Не ЕстьКолонкаВТаблице(ТаблицаСОбщимиКолонками, "ДополнениеКНаименованиюТовара") Тогда
		ТаблицаСОбщимиКолонками.Колонки.Добавить("ДополнениеКНаименованиюТовара");
	КонецЕсли;
	
	Возврат ТаблицаСОбщимиКолонками;
	
КонецФункции

Функция ОписаниеНоменклатуры(Номенклатура, ОписанияНоменклатурыСЧастичнымВыбытием)
	
	ОписаниеНоменклатуры = ОписанияНоменклатурыСЧастичнымВыбытием.Получить(Номенклатура);
	Если ОписаниеНоменклатуры = Неопределено Тогда
		СоответствиеОписаниеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(Номенклатура);
		ОписаниеНоменклатуры = СоответствиеОписаниеНоменклатуры[Номенклатура];
		
		ОписанияНоменклатурыСЧастичнымВыбытием.Вставить(Номенклатура, ОписаниеНоменклатуры);
	КонецЕсли;
	
	Возврат ОписаниеНоменклатуры;
	
КонецФункции

// Структура наименования товара для маркированного товара
// 
// Параметры:
//  СтрокаТовары - СтрокаТаблицыЗначений - Строка таблицы товаров документа реализации:
//  *Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения - Упаковка документа реализации
//  *Цена - Число - Цена единицы товара из документа реализации
//  СтрокаРаспределения - СтрокаТаблицыЗначений - Строка таблицы распределения товаров по штрихкода упаковки:
//  *Количество - Число - Количество товара в базовой единице измерения
//  *ЧастичноеВыбытиеКоличество - Число - Количество товара в единице измерения частичного выбытия
// 
// Возвращаемое значение:
//  Структура - Структура наименования товара:
// * Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения - Упаковка документа реализации
// * Количество - Число - Количество товара в базовой единице измерения
// * КоличествоУпаковок - Число - Количество товара в единице измерения частичного выбытия
// * Цена - Число - Цена единицы товара из документа реализации
Функция СтруктураНаименованияТовара(СтрокаТовары, СтрокаРаспределения)
	
	СтруктураНаименованияТовара = Новый Структура;
	СтруктураНаименованияТовара.Вставить("Упаковка",           СтрокаТовары.Упаковка);
	СтруктураНаименованияТовара.Вставить("Количество",         СтрокаРаспределения.Количество);
	СтруктураНаименованияТовара.Вставить("КоличествоУпаковок", СтрокаРаспределения.ЧастичноеВыбытиеКоличество);
	СтруктураНаименованияТовара.Вставить("Цена",               СтрокаТовары.Цена);
	
	Возврат СтруктураНаименованияТовара;
	
КонецФункции

Функция ОтклонениеСуммыНДС(СтрокаТоварыРазобранные)
	
	СуммаСНДС = СтрокаТоварыРазобранные.СуммаСНДС;
	СтавкаНДСЧислом = СтрокаТоварыРазобранные.СтавкаНДСЧислом;
	
	СуммаНДСЭталон = СуммаСНДС / (100 + СтавкаНДСЧислом) * СтавкаНДСЧислом;
	ОтклонениеВСуммеНДС = СтрокаТоварыРазобранные.СуммаНДС - СуммаНДСЭталон;
	
	Возврат ОтклонениеВСуммеНДС;
	
КонецФункции

Функция СтруктураТаблицаРезультатРаспределения(ТаблицаОсновная, ТаблицаДополнительная, ПоляДетализации)
	
	ТаблицаРезультатРаспределения = ТаблицаОсновная.СкопироватьКолонки();
	
	Для Каждого СтрокаДетализации Из ПоляДетализации Цикл
		
		КолонкаДетализации = ТаблицаДополнительная.Колонки.Найти(СтрокаДетализации);
		
		Если КолонкаДетализации <> Неопределено Тогда
			ТаблицаРезультатРаспределения.Колонки.Добавить(КолонкаДетализации.Имя, КолонкаДетализации.ТипЗначения);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультатРаспределения;
	
КонецФункции

Функция РаспределитьДанныеПоТаблицам(ТаблицаОсновная, ТаблицаДополнительная, ПоляИзмерения, ПоляДетализации, ПоляСумм, ПолеРасчетаБазы)
	
	ТаблицаРезультатРаспределения = СтруктураТаблицаРезультатРаспределения(ТаблицаОсновная, ТаблицаДополнительная, ПоляДетализации);
	
	// 
	Для Каждого СтрокаТаблицыОсновная Из ТаблицаОсновная Цикл
		
		СтруктураОтбора = Новый Структура;
		Для Каждого ПолеИзмерения Из ПоляИзмерения Цикл
			СтруктураОтбора.Вставить(ПолеИзмерения, СтрокаТаблицыОсновная[ПолеИзмерения]);
		КонецЦикла;
		
		МассивСтрокДляДобавленияВТаблицуРаспределения = ТаблицаДополнительная.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрокДляДобавленияВТаблицуРаспределения.Количество() = 0 Тогда
			СтрокаТаблицыРезультатРаспределения = ТаблицаРезультатРаспределения.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРезультатРаспределения, СтрокаТаблицыОсновная);
			
			Продолжить;
		КонецЕсли;
		
		Для каждого СтрокаДляДобавленияВТаблицуРаспределения из МассивСтрокДляДобавленияВТаблицуРаспределения Цикл
			
			Если СтрокаТаблицыОсновная[ПолеРасчетаБазы] = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаДляДобавленияВТаблицуРаспределения[ПолеРасчетаБазы] = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицыРезультатРаспределения = ТаблицаРезультатРаспределения.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРезультатРаспределения, СтрокаТаблицыОсновная);
			
			Для Каждого ПолеДетализации Из ПоляДетализации Цикл
				СтрокаТаблицыРезультатРаспределения[ПолеДетализации] = СтрокаДляДобавленияВТаблицуРаспределения[ПолеДетализации];
			КонецЦикла;
			
			Если СтрокаДляДобавленияВТаблицуРаспределения[ПолеРасчетаБазы] < СтрокаТаблицыОсновная[ПолеРасчетаБазы] Тогда
				
				СтрокаТаблицыРезультатРаспределения[ПолеРасчетаБазы] = СтрокаДляДобавленияВТаблицуРаспределения[ПолеРасчетаБазы];
				
				Для Каждого ПолеСуммы Из ПоляСумм Цикл
					Если ПолеСуммы = ПолеРасчетаБазы Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаТаблицыРезультатРаспределения[ПолеСуммы] = СтрокаТаблицыОсновная[ПолеСуммы] / СтрокаТаблицыОсновная[ПолеРасчетаБазы] * СтрокаТаблицыРезультатРаспределения[ПолеРасчетаБазы];
				КонецЦикла;
				
			КонецЕсли;
			
			СтрокаТаблицыОсновная[ПолеРасчетаБазы] = СтрокаТаблицыОсновная[ПолеРасчетаБазы] - СтрокаТаблицыРезультатРаспределения[ПолеРасчетаБазы];
			Для Каждого ПолеСуммы Из ПоляСумм Цикл
				Если ПолеСуммы = ПолеРасчетаБазы Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаТаблицыОсновная[ПолеСуммы] = СтрокаТаблицыОсновная[ПолеСуммы] - СтрокаТаблицыРезультатРаспределения[ПолеСуммы];
			КонецЦикла;
			
			СтрокаДляДобавленияВТаблицуРаспределения[ПолеРасчетаБазы] = СтрокаДляДобавленияВТаблицуРаспределения[ПолеРасчетаБазы] - СтрокаТаблицыРезультатРаспределения[ПолеРасчетаБазы];
		
		КонецЦикла;
		
		Если СтрокаТаблицыОсновная[ПолеРасчетаБазы] > 0 Тогда
			СтрокаТаблицыРезультатРаспределения = ТаблицаРезультатРаспределения.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРезультатРаспределения, СтрокаТаблицыОсновная);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультатРаспределения;
	
КонецФункции

Процедура ПередВыполнениемОперацииВПлатежнойСистеме(ДокументОперации)
	
	Если Не ЗначениеЗаполнено(ДокументОперации)
		Или Не Метаданные.ОпределяемыеТипы.ДокументОперацииСБП.Тип.СодержитТип(ТипЗнч(ДокументОперации)) Тогда
		
		ВызватьИсключение НСтр("ru = 'Операция в платежной системе для документа не поддерживается.'");
	КонецЕсли;
	
КонецПроцедуры

// Добавить шаблоны email и sms для документа "Заказ клиента"
// 
// Параметры:
//  Шаблоны - Массив Из Структура - Шаблоны
Процедура ДобавитьШаблонЗаказКлиента(Шаблоны)
	
	Шаблон = Новый Структура();
	Шаблон.Вставить("ТипШаблона", "Письмо");
	Шаблон.Вставить("ПолноеИмяТипаНазначения", "Документ.ЗаказКлиента");
	Шаблон.Вставить("Наименование", "Реквизиты для оплаты через СБП (Заказ клиента) (почта)");
	Шаблон.Вставить("Тема", "Реквизиты для оплаты: [ЗаказКлиента.Номер] от [ЗаказКлиента.Дата{ДЛФ='dd.MM.yyyy'}] на сумму [ЗаказКлиента.СуммаДокумента] руб.");
	ТекстШаблона = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<html>
		|<head>
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
		|<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
		|<meta name=""format-detection"" content=""telephone=no"" />
		|<style type=""text/css"">
		|body{margin:0;padding:8px;overflow:auto;width:100%;height:100%;}
		|p{line-height:1.15;margin:0;}
		|ol,ul{margin-top:0;margin-bottom:0;}
		|img{border:none;}
		|</style>
		|</head>
		|<body>
		|<p>%1</p>
		|<p></p>
		|<p><strong>Покупатель:</strong> %2<br>
		|<strong>Счет:</strong> %3 от %4 <br>
		|<strong>К оплате:</strong> %5</p>
		|<p></p>
		|<p>%6</p>
		|<p></p>
		|<p>%7</p>
		|<p>%8</p>
		|</body>
		|</html>",
		"Благодарим за заказ и просим оплатить.",
		"[ЗаказКлиента.ПартнерНаименование]",
		"[ЗаказКлиента.Номер]",
		"[ЗаказКлиента.Дата{ДЛФ='dd.MM.yyyy'}]",
		"[ЗаказКлиента.СуммаДокумента] руб.",
		"Для оплаты отсканируйте QR-код в Вашем мобильном банковском приложении
		| или перейдите по ссылке для  выбора приложения банка.",
		"[ЗаказКлиента.ПредставлениеСсылкиСБПQRКод]",
		"[ЗаказКлиента.ПредставлениеСсылкиСБП]");
	
	ТекстШаблона = СтрЗаменить(ТекстШаблона, Символы.ПС, "");
	Шаблон.Вставить("Текст", ТекстШаблона);
	Шаблоны.Добавить(Шаблон);

	// Демо: Реквизиты для оплаты, смс
	Шаблон = Новый Структура();
	Шаблон.Вставить("ТипШаблона", "SMS");
	Шаблон.Вставить("ПолноеИмяТипаНазначения", "Документ.ЗаказКлиента");
	Шаблон.Вставить("Наименование", НСтр("ru = 'Реквизиты для оплаты через СБП (Заказ клиента) (смс)'"));
	Шаблон.Вставить("Тема", "Реквизиты для оплаты: [ЗаказКлиента.Номер] от [ЗаказКлиента.Дата{ДЛФ='dd.MM.yyyy'}] на сумму [ЗаказКлиента.СуммаДокумента] руб.");
	ТекстШаблона = 
		"Благодарим за заказ и просим оплатить.
		|
		|Сумма заказа: [ЗаказКлиента.СуммаДокумента] руб.
		|
		|Заказ можно оплатить, перейдя по ссылке [ЗаказКлиента.ПредставлениеСсылкиСБП]";
	
	Шаблон.Вставить("Текст", ТекстШаблона);
	Шаблоны.Добавить(Шаблон);
	
КонецПроцедуры

// Добавить шаблоны email и sms для документа "Счет на оплату клиенту"
// 
// Параметры:
//  Шаблоны - Массив Из Структура - Шаблоны
Процедура ДобавитьШаблонСчетНаОплатуКлиенту(Шаблоны)
	
	Шаблон = Новый Структура();
	Шаблон.Вставить("ТипШаблона", "Письмо");
	Шаблон.Вставить("ПолноеИмяТипаНазначения", "Документ.СчетНаОплатуКлиенту");
	Шаблон.Вставить("Наименование", "Реквизиты для оплаты через СБП (Счет на оплату) (почта)");
	Шаблон.Вставить("Тема", "Реквизиты для оплаты: [СчетНаОплатуКлиенту.Номер] от [СчетНаОплатуКлиенту.Дата{ДЛФ='dd.MM.yyyy'}] на сумму [СчетНаОплатуКлиенту.СуммаДокумента] руб.");
	ТекстШаблона = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<html>
		|<head>
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
		|<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
		|<meta name=""format-detection"" content=""telephone=no"" />
		|<style type=""text/css"">
		|body{margin:0;padding:8px;overflow:auto;width:100%;height:100%;}
		|p{line-height:1.15;margin:0;}
		|ol,ul{margin-top:0;margin-bottom:0;}
		|img{border:none;}
		|</style>
		|</head>
		|<body>
		|<p>%1</p>
		|<p></p>
		|<p><strong>Покупатель:</strong> %2<br>
		|<strong>Счет:</strong> %3 от %4 <br>
		|<strong>К оплате:</strong> %5</p>
		|<p></p>
		|<p>%6</p>
		|<p></p>
		|<p>%7</p>
		|<p>%8</p>
		|</body>
		|</html>",
		"Благодарим за заказ и просим оплатить.",
		"[СчетНаОплатуКлиенту.ПартнерНаименование]",
		"[СчетНаОплатуКлиенту.Номер]",
		"[СчетНаОплатуКлиенту.Дата{ДЛФ='dd.MM.yyyy'}]",
		"[СчетНаОплатуКлиенту.СуммаДокумента] руб.",
		"Для оплаты отсканируйте QR-код в Вашем мобильном банковском приложении
		| или перейдите по ссылке для  выбора приложения банка.",
		"[СчетНаОплатуКлиенту.ПредставлениеСсылкиСБПQRКод]",
		"[СчетНаОплатуКлиенту.ПредставлениеСсылкиСБП]");
		
	ТекстШаблона = СтрЗаменить(ТекстШаблона, Символы.ПС, "");
	Шаблон.Вставить("Текст", ТекстШаблона);
	Шаблоны.Добавить(Шаблон);

	// Демо: Реквизиты для оплаты, смс
	Шаблон = Новый Структура();
	Шаблон.Вставить("ТипШаблона", "SMS");
	Шаблон.Вставить("ПолноеИмяТипаНазначения", "Документ.СчетНаОплатуКлиенту");
	Шаблон.Вставить("Наименование", НСтр("ru = 'Реквизиты для оплаты через СБП (Счет на оплату) (смс)'"));
	Шаблон.Вставить("Тема", "Реквизиты для оплаты: [СчетНаОплатуКлиенту.Номер] от [СчетНаОплатуКлиенту.Дата{ДЛФ='dd.MM.yyyy'}] на сумму [СчетНаОплатуКлиенту.СуммаДокумента] руб.");
	ТекстШаблона = 
		"Благодарим за заказ и просим оплатить.
		|
		|Сумма заказа: [СчетНаОплатуКлиенту.СуммаДокумента] руб.
		|
		|Заказ можно оплатить, перейдя по ссылке [СчетНаОплатуКлиенту.ПредставлениеСсылкиСБП]";
		
	Шаблон.Вставить("Текст", ТекстШаблона);
	Шаблоны.Добавить(Шаблон);
	
КонецПроцедуры

// Добавить шаблоны email и sms для документа "Акт выполненных работ"
// 
// Параметры:
//  Шаблоны - Массив Из Структура - Шаблоны
Процедура ДобавитьШаблонАктВыполненныхРабот(Шаблоны)
	
	Шаблон = Новый Структура();
	Шаблон.Вставить("ТипШаблона", "Письмо");
	Шаблон.Вставить("ПолноеИмяТипаНазначения", "Документ.АктВыполненныхРабот");
	Шаблон.Вставить("Наименование", НСтр("ru = 'Реквизиты для оплаты через СБП (Акт выполненных работ) (почта)'"));
	Шаблон.Вставить("Тема", "Реквизиты для оплаты: [АктВыполненныхРабот.Номер] от [АктВыполненныхРабот.Дата{ДЛФ='dd.MM.yyyy'}] на сумму [АктВыполненныхРабот.СуммаДокумента] руб.");
	ТекстШаблона = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<html>
		|<head>
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
		|<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
		|<meta name=""format-detection"" content=""telephone=no"" />
		|<style type=""text/css"">
		|body{margin:0;padding:8px;overflow:auto;width:100%;height:100%;}
		|p{line-height:1.15;margin:0;}
		|ol,ul{margin-top:0;margin-bottom:0;}
		|img{border:none;}
		|</style>
		|</head>
		|<body>
		|<p>%1</p>
		|<p></p>
		|<p><strong>Покупатель:</strong> %2<br>
		|<strong>Счет:</strong> %3 от %4 <br>
		|<strong>К оплате:</strong> %5</p>
		|<p></p>
		|<p>%6</p>
		|<p></p>
		|<p>%7</p>
		|<p>%8</p>
		|</body>
		|</html>",
		"Благодарим за заказ и просим оплатить.",
		"[АктВыполненныхРабот.ПартнерНаименование]",
		"[АктВыполненныхРабот.Номер]",
		"[АктВыполненныхРабот.Дата{ДЛФ='dd.MM.yyyy'}]",
		"[АктВыполненныхРабот.СуммаДокумента] руб.",
		"Для оплаты отсканируйте QR-код в Вашем мобильном банковском приложении
		| или перейдите по ссылке для  выбора приложения банка.",
		"[АктВыполненныхРабот.ПредставлениеСсылкиСБПQRКод]",
		"[АктВыполненныхРабот.ПредставлениеСсылкиСБП]");
		
	ТекстШаблона = СтрЗаменить(ТекстШаблона, Символы.ПС, "");
	Шаблон.Вставить("Текст", ТекстШаблона);
	Шаблоны.Добавить(Шаблон);

	// Демо: Реквизиты для оплаты, смс
	Шаблон = Новый Структура();
	Шаблон.Вставить("ТипШаблона", "SMS");
	Шаблон.Вставить("ПолноеИмяТипаНазначения", "Документ.АктВыполненныхРабот");
	Шаблон.Вставить("Наименование", НСтр("ru = 'Реквизиты для оплаты через СБП (Акт выполненных работ) (смс)'"));
	Шаблон.Вставить("Тема", "Реквизиты для оплаты: [АктВыполненныхРабот.Номер] от [АктВыполненныхРабот.Дата{ДЛФ='dd.MM.yyyy'}] на сумму [АктВыполненныхРабот.СуммаДокумента] руб.");
	ТекстШаблона = 
		"Благодарим за заказ и просим оплатить.
		|
		|Сумма заказа: [АктВыполненныхРабот.СуммаДокумента] руб.
		|
		|Заказ можно оплатить, перейдя по ссылке [АктВыполненныхРабот.ПредставлениеСсылкиСБП]";
		
	Шаблон.Вставить("Текст", ТекстШаблона);
	Шаблоны.Добавить(Шаблон);
	
КонецПроцедуры

// Добавить шаблоны email и sms для документа "Реализация товаров и услуг"
// 
// Параметры:
//  Шаблоны - Массив Из Структура - Шаблоны
Процедура ДобавитьШаблонРеализацияТоваровУслуг(Шаблоны)
	
	Шаблон = Новый Структура();
	Шаблон.Вставить("ТипШаблона", "Письмо");
	Шаблон.Вставить("ПолноеИмяТипаНазначения", "Документ.РеализацияТоваровУслуг");
	Шаблон.Вставить("Наименование", "Реквизиты для оплаты через СБП (Реализация товаров и услуг) (почта)");
	Шаблон.Вставить("Тема", "Реквизиты для оплаты: [РеализацияТоваровУслуг.Номер] от [РеализацияТоваровУслуг.Дата{ДЛФ=dd.MM.yyyy}] на сумму [РеализацияТоваровУслуг.СуммаДокумента] руб.");
	ТекстШаблона = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<html>
		|<head>
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
		|<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
		|<meta name=""format-detection"" content=""telephone=no"" />
		|<style type=""text/css"">
		|body{margin:0;padding:8px;overflow:auto;width:100%;height:100%;}
		|p{line-height:1.15;margin:0;}
		|ol,ul{margin-top:0;margin-bottom:0;}
		|img{border:none;}
		|</style>
		|</head>
		|<body>
		|<p>%1</p>
		|<p></p>
		|<p><strong>Покупатель:</strong> %2<br>
		|<strong>Счет:</strong> %3 от %4 <br>
		|<strong>К оплате:</strong> %5</p>
		|<p></p>
		|<p>%6</p>
		|<p>%7</p>
		|<p>%8</p>
		|</body>
		|</html>",
		"Благодарим за заказ и просим оплатить.",
		"[РеализацияТоваровУслуг.ПартнерНаименование]",
		"[РеализацияТоваровУслуг.Номер]",
		"[РеализацияТоваровУслуг.Дата{ДЛФ='dd.MM.yyyy'}]",
		"[РеализацияТоваровУслуг.СуммаДокумента] руб.",
		"Для оплаты отсканируйте QR-код в Вашем мобильном банковском приложении или перейдите по ссылке для выбора приложения банка.",
		"[РеализацияТоваровУслуг.ПредставлениеСсылкиСБПQRКод]",
		"[РеализацияТоваровУслуг.ПредставлениеСсылкиСБП]");
		
	ТекстШаблона = СтрЗаменить(ТекстШаблона, Символы.ПС, "");
	Шаблон.Вставить("Текст", ТекстШаблона);
	Шаблоны.Добавить(Шаблон);

	// Демо: Реквизиты для оплаты, смс
	Шаблон = Новый Структура();
	Шаблон.Вставить("ТипШаблона", "SMS");
	Шаблон.Вставить("ПолноеИмяТипаНазначения", "Документ.РеализацияТоваровУслуг");
	Шаблон.Вставить("Наименование", "Реквизиты для оплаты через СБП (Реализация товаров и услуг) (смс)");
	Шаблон.Вставить("Тема", "Реквизиты для оплаты: [РеализацияТоваровУслуг.Номер] от [РеализацияТоваровУслуг.Дата{ДЛФ=dd.MM.yyyy}] на сумму [РеализацияТоваровУслуг.СуммаДокумента] руб.");
	ТекстШаблона = 
		"Благодарим за заказ и просим оплатить.
		|
		|Реквизиты для оплаты: [РеализацияТоваровУслуг.СуммаДокумента] руб.
		|
		|Заказ можно оплатить, перейдя по ссылке [РеализацияТоваровУслуг.ПредставлениеСсылкиСБП]";
		
	Шаблон.Вставить("Текст", ТекстШаблона);
	Шаблоны.Добавить(Шаблон);
	
КонецПроцедуры

// Добавить шаблоны email и sms для документа "Реализация услуг и прочих активов"
// 
// Параметры:
//  Шаблоны - Массив Из Структура - Шаблоны
Процедура ДобавитьШаблонРеализацияУслугПрочихАктивов(Шаблоны)
	
	Шаблон = Новый Структура();
	Шаблон.Вставить("ТипШаблона", "Письмо");
	Шаблон.Вставить("ПолноеИмяТипаНазначения", "Документ.РеализацияУслугПрочихАктивов");
	Шаблон.Вставить("Наименование", "Реквизиты для оплаты через СБП (Реализация услуг и прочих активов) (почта)");
	Шаблон.Вставить("Тема", "Реквизиты для оплаты: [РеализацияУслугПрочихАктивов.Номер] от [РеализацияУслугПрочихАктивов.Дата{ДЛФ=dd.MM.yyyy}] на сумму [РеализацияУслугПрочихАктивов.СуммаДокумента] руб.");
	ТекстШаблона = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<html>
		|<head>
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
		|<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
		|<meta name=""format-detection"" content=""telephone=no"" />
		|<style type=""text/css"">
		|body{margin:0;padding:8px;overflow:auto;width:100%;height:100%;}
		|p{line-height:1.15;margin:0;}
		|ol,ul{margin-top:0;margin-bottom:0;}
		|img{border:none;}
		|</style>
		|</head>
		|<body>
		|<p>%1</p>
		|<p></p>
		|<p><strong>Покупатель:</strong> %2<br>
		|<strong>Счет:</strong> %3 от %4 <br>
		|<strong>К оплате:</strong> %5</p>
		|<p></p>
		|<p>%6</p>
		|<p></p>
		|<p>%7</p>
		|<p>%8</p>
		|</body>
		|</html>",
		"Благодарим за заказ и просим оплатить.",
		"[РеализацияУслугПрочихАктивов.ПартнерНаименование]",
		"[РеализацияУслугПрочихАктивов.Номер]",
		"[РеализацияУслугПрочихАктивов.Дата{ДЛФ='dd.MM.yyyy'}]",
		"[РеализацияУслугПрочихАктивов.СуммаДокумента] руб.",
		"Для оплаты отсканируйте QR-код в Вашем мобильном банковском приложении
		| или перейдите по ссылке для  выбора приложения банка.",
		"[РеализацияУслугПрочихАктивов.ПредставлениеСсылкиСБПQRКод]",
		"[РеализацияУслугПрочихАктивов.ПредставлениеСсылкиСБП]");
		
	ТекстШаблона = СтрЗаменить(ТекстШаблона, Символы.ПС, "");
	Шаблон.Вставить("Текст", ТекстШаблона);
	Шаблоны.Добавить(Шаблон);

	// Демо: Реквизиты для оплаты, смс
	Шаблон = Новый Структура();
	Шаблон.Вставить("ТипШаблона", "SMS");
	Шаблон.Вставить("ПолноеИмяТипаНазначения", "Документ.РеализацияУслугПрочихАктивов");
	Шаблон.Вставить("Наименование", "Реквизиты для оплаты через СБП (Реализация услуг и прочих активов) (смс)");
	Шаблон.Вставить("Тема", "Реквизиты для оплаты: [РеализацияУслугПрочихАктивов.Номер] от [РеализацияУслугПрочихАктивов.Дата{ДЛФ=dd.MM.yyyy}] на сумму [РеализацияУслугПрочихАктивов.СуммаДокумента] руб.");
	ТекстШаблона = 
		"Благодарим за заказ и просим оплатить.
		|
		|Сумма заказа: [РеализацияУслугПрочихАктивов.СуммаДокумента] руб.
		|
		|Заказ можно оплатить, перейдя по ссылке [РеализацияУслугПрочихАктивов.ПредставлениеСсылкиСБП]";
		
	Шаблон.Вставить("Текст", ТекстШаблона);
	Шаблоны.Добавить(Шаблон);
	
КонецПроцедуры

// Ведется учет видов продукции по ветеринарным сертификатам.
// 
// Возвращаемое значение:
//  Булево - Ведется учет видов продукции по ветеринарным сертификатам
Функция ВедетсяУчетВидовПродукцииПоВетеринарнымСертификатам() Экспорт
	Возврат РозничныеПродажиКлиентСерверЛокализация.ВедетсяУчетВидовПродукцииПоВетеринарнымСертификатам();
КонецФункции

// Описание типов документов, которые исопльзуют шаблоны назначений СБП.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - Ключ - Тип документа, Значение - см. ДобавитьОписаниеТипаДокументаИспользующегоШаблоныНазначенияСБП
//
Функция ТипыДокументовИспользующиеШаблоныНазначенияСБП()
	Описания  = Новый Соответствие();
	
	ДобавитьОписаниеТипаДокументаИспользующегоШаблоныНазначенияСБП(Описания, 
		Тип("ДокументСсылка.ЧекККМ"), Метаданные.Документы.ЧекККМ);
	ДобавитьОписаниеТипаДокументаИспользующегоШаблоныНазначенияСБП(Описания, 
		Тип("ДокументСсылка.РеализацияПодарочныхСертификатов"), Метаданные.Документы.РеализацияПодарочныхСертификатов);
	ДобавитьОписаниеТипаДокументаИспользующегоШаблоныНазначенияСБП(Описания, 
		Тип("ДокументСсылка.ЗаказКлиента"), Метаданные.Документы.ЗаказКлиента);
	ДобавитьОписаниеТипаДокументаИспользующегоШаблоныНазначенияСБП(Описания, 
		Тип("ДокументСсылка.РеализацияТоваровУслуг"), Метаданные.Документы.РеализацияТоваровУслуг);
	ДобавитьОписаниеТипаДокументаИспользующегоШаблоныНазначенияСБП(Описания, 
		Тип("ДокументСсылка.АктВыполненныхРабот"), Метаданные.Документы.АктВыполненныхРабот);
	ДобавитьОписаниеТипаДокументаИспользующегоШаблоныНазначенияСБП(Описания, 
		Тип("ДокументСсылка.РеализацияУслугПрочихАктивов"), Метаданные.Документы.РеализацияУслугПрочихАктивов);
	ДобавитьОписаниеТипаДокументаИспользующегоШаблоныНазначенияСБП(Описания, 
		Тип("ДокументСсылка.ЗаказКлиента"), Метаданные.Документы.ЗаказКлиента);
	ДобавитьОписаниеТипаДокументаИспользующегоШаблоныНазначенияСБП(Описания, 
		Тип("ДокументСсылка.СчетНаОплатуКлиенту"), Метаданные.Документы.СчетНаОплатуКлиенту);

	Возврат Описания;
КонецФункции

// Описание параметров шаблонов назначений СБП по типам документов.
// 
// Параметры:
//  ТипДокумента - Тип - ДокументСсылка
//  
// Возвращаемое значение:
//   Массив из см. ДобавитьОписаниеПараметраШаблонаНазначенияСБП
//
Функция ПараметрыШаблонаНазначенияСБППоТипуДокумента(ТипДокумента)
	
	ПараметрыШаблона = Новый Массив();
	
	Если ТипДокумента = Тип("ДокументСсылка.ЧекККМ") Тогда
		
		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ДатаОплаты]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Дата оплаты'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЧекККМ.СтандартныеРеквизиты.Дата.Имя;
		ОписаниеПараметра.Формат = "ДФ=dd.MM.yyyy";
		
		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Валюта]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Валюта'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЧекККМ.Реквизиты.Валюта.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеПолное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Полное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЧекККМ.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеПолное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеСокращенное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сокращенное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЧекККМ.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеСокращенное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Склад]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Наименование склада'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЧекККМ.Реквизиты.Склад.Имя + "." +
										Метаданные.Справочники.Склады.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[СуммаОплаты]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сумма оплаты'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЧекККМ.Реквизиты.СуммаДокумента.Имя;
		ОписаниеПараметра.Формат = "Л=ru_RU; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0;";
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияПодарочныхСертификатов") Тогда

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ДатаОплаты]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Дата оплаты'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияПодарочныхСертификатов.СтандартныеРеквизиты.Дата.Имя;
		ОписаниеПараметра.Формат = "ДФ=dd.MM.yyyy";
		
		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Валюта]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Валюта'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияПодарочныхСертификатов.Реквизиты.Валюта.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеПолное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Полное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияПодарочныхСертификатов.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеПолное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеСокращенное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сокращенное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияПодарочныхСертификатов.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеСокращенное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[СуммаОплаты]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сумма оплаты'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияПодарочныхСертификатов.Реквизиты.СуммаДокумента.Имя;
		ОписаниеПараметра.Формат = "Л=ru_RU; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0;";

	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказКлиента") Тогда

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Дата]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Дата заказа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.СтандартныеРеквизиты.Дата.Имя;
		ОписаниеПараметра.Формат = "ДФ=dd.MM.yyyy";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Номер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Номер заказа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.СтандартныеРеквизиты.Номер.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ДатаЗаказаПоДаннымКлиента]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Дата заказа по данным клиента'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.Реквизиты.ДатаПоДаннымКлиента.Имя;
		ОписаниеПараметра.Формат = "ДФ=dd.MM.yyyy";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[НомерЗаказаПоДаннымКлиента]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Номер заказа по данным клиента'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.Реквизиты.НомерПоДаннымКлиента.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Валюта]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Валюта'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.Реквизиты.Валюта.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеПолное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Полное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеПолное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеСокращенное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сокращенное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеСокращенное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Склад]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Наименование склада'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.Реквизиты.Склад.Имя + "." +
										Метаданные.Справочники.Склады.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Договор]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Договор'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.Реквизиты.Договор.Имя + "." +
										Метаданные.Справочники.ДоговорыКонтрагентов.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[СуммаДокумента]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сумма документа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.Реквизиты.СуммаДокумента.Имя;
		ОписаниеПараметра.Формат = "Л=ru_RU; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0;";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[СуммаПредоплатыДоОтгрузки]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сумма предоплаты до отгрузки'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.Реквизиты.СуммаПредоплатыДоОтгрузки.Имя;
		ОписаниеПараметра.Формат = "Л=ru_RU; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0;";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[НазначениеПлатежа]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Назначение платежа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.Реквизиты.НазначениеПлатежа.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Менеджер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Менеджер'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.ЗаказКлиента.Реквизиты.Менеджер.Имя + "." +
										Метаданные.Справочники.Пользователи.СтандартныеРеквизиты.Наименование.Имя;

	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Дата]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Дата'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.СтандартныеРеквизиты.Дата.Имя;
		ОписаниеПараметра.Формат = "ДФ=dd.MM.yyyy";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Номер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Номер'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.СтандартныеРеквизиты.Номер.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Валюта]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Валюта'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.Валюта.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеПолное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Полное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеПолное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеСокращенное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сокращенное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеСокращенное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Склад]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Наименование склада'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.Склад.Имя + "." +
										Метаданные.Справочники.Склады.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Договор]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Договор'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.Договор.Имя + "." +
										Метаданные.Справочники.ДоговорыКонтрагентов.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[СуммаДокумента]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сумма документа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.СуммаДокумента.Имя;
		ОписаниеПараметра.Формат = "Л=ru_RU; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0;";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Менеджер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Менеджер'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.Менеджер.Имя + "." +
										Метаданные.Справочники.Пользователи.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[СуммаВзаиморасчетов]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сумма взаиморасчетов'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.СуммаВзаиморасчетов.Имя;
		ОписаниеПараметра.Формат = "Л=ru_RU; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0;";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ВалютаВзаиморасчетов]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Валюта взаиморасчетов'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.ВалютаВзаиморасчетов.Имя + "." +
										Метаданные.Справочники.Валюты.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Основание]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Основание'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.Основание.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОснованиеДата]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Дата документа основания'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.ОснованиеДата.Имя;
		ОписаниеПараметра.Формат = "ДФ=dd.MM.yyyy";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОснованиеНомер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Номер документа основания'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.ОснованиеНомер.Имя;

	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Дата]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Дата'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.СтандартныеРеквизиты.Дата.Имя;
		ОписаниеПараметра.Формат = "ДФ=dd.MM.yyyy";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Номер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Номер'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.СтандартныеРеквизиты.Номер.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Валюта]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Валюта'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.Реквизиты.Валюта.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеПолное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Полное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеПолное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеСокращенное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сокращенное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеСокращенное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Договор]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Договор'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.Реквизиты.Договор.Имя + "." +
										Метаданные.Справочники.ДоговорыКонтрагентов.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[СуммаДокумента]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сумма документа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.Реквизиты.СуммаДокумента.Имя;
		ОписаниеПараметра.Формат = "Л=ru_RU; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0;";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Менеджер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Менеджер'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.Реквизиты.Менеджер.Имя + "." +
										Метаданные.Справочники.Пользователи.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[СуммаВзаиморасчетов]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сумма взаиморасчетов'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.Реквизиты.СуммаВзаиморасчетов.Имя;
		ОписаниеПараметра.Формат = "Л=ru_RU; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0;";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ВалютаВзаиморасчетов]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Валюта взаиморасчетов'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.Реквизиты.ВалютаВзаиморасчетов.Имя + "." +
										Метаданные.Справочники.Валюты.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Основание]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Основание'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.Реквизиты.Основание.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОснованиеДата]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Дата документа основания'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.Реквизиты.ОснованиеДата.Имя;
		ОписаниеПараметра.Формат = "ДФ=dd.MM.yyyy";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОснованиеНомер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Номер документа основания'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.АктВыполненныхРабот.Реквизиты.ОснованиеНомер.Имя;

	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Дата]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Дата'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.СтандартныеРеквизиты.Дата.Имя;
		ОписаниеПараметра.Формат = "ДФ=dd.MM.yyyy";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Номер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Номер'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.СтандартныеРеквизиты.Номер.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Валюта]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Валюта'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.Реквизиты.Валюта.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеПолное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Полное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеПолное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеСокращенное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сокращенное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеСокращенное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Договор]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Договор'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.Реквизиты.Договор.Имя + "." +
										Метаданные.Справочники.ДоговорыКонтрагентов.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[СуммаДокумента]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сумма документа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.Реквизиты.СуммаДокумента.Имя;
		ОписаниеПараметра.Формат = "Л=ru_RU; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0;";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Менеджер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Менеджер'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.Реквизиты.Менеджер.Имя + "." +
										Метаданные.Справочники.Пользователи.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[СуммаВзаиморасчетов]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сумма взаиморасчетов'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.Реквизиты.СуммаВзаиморасчетов.Имя;
		ОписаниеПараметра.Формат = "Л=ru_RU; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0;";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ВалютаВзаиморасчетов]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Валюта взаиморасчетов'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.Реквизиты.ВалютаВзаиморасчетов.Имя + "." +
										Метаданные.Справочники.Валюты.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Основание]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Основание'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.Реквизиты.Основание.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОснованиеДата]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Дата документа основания'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.Реквизиты.ОснованиеДата.Имя;
		ОписаниеПараметра.Формат = "ДФ=dd.MM.yyyy";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОснованиеНомер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Номер документа основания'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.РеализацияУслугПрочихАктивов.Реквизиты.ОснованиеНомер.Имя;

	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СчетНаОплатуКлиенту") Тогда

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Дата]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Дата'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.СчетНаОплатуКлиенту.СтандартныеРеквизиты.Дата.Имя;
		ОписаниеПараметра.Формат = "ДФ=dd.MM.yyyy";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Номер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Номер'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.СчетНаОплатуКлиенту.СтандартныеРеквизиты.Номер.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Валюта]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Валюта'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.СчетНаОплатуКлиенту.Реквизиты.Валюта.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеПолное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Полное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.СчетНаОплатуКлиенту.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеПолное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[ОрганизацияНаименованиеСокращенное]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сокращенное наименование организации'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.СчетНаОплатуКлиенту.Реквизиты.Организация.Имя + "." +
										Метаданные.Справочники.Организации.Реквизиты.НаименованиеСокращенное.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Договор]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Договор'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.СчетНаОплатуКлиенту.Реквизиты.Договор.Имя + "." +
										Метаданные.Справочники.ДоговорыКонтрагентов.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[СуммаДокумента]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Сумма документа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.СчетНаОплатуКлиенту.Реквизиты.СуммаДокумента.Имя;
		ОписаниеПараметра.Формат = "Л=ru_RU; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0;";

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[Менеджер]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Менеджер'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.СчетНаОплатуКлиенту.Реквизиты.Менеджер.Имя + "." +
										Метаданные.Справочники.Пользователи.СтандартныеРеквизиты.Наименование.Имя;

		ОписаниеПараметра = ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона);
		ОписаниеПараметра.Идентификатор = "[НазначениеПлатежа]";
		ОписаниеПараметра.Наименование = НСтр("ru = 'Назначение платежа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОписаниеПараметра.ПутьКДанным = Метаданные.Документы.СчетНаОплатуКлиенту.Реквизиты.НазначениеПлатежа.Имя;

	КонецЕсли;
	
	Возврат ПараметрыШаблона;
КонецФункции

// Описание параметра щаблона назначения СБП.
// Параметры:
//  ПараметрыШаблона - Массив из см. ДобавитьОписаниеПараметраШаблонаНазначенияСБП
//  
// Возвращаемое значение:
//  Структура:
//	 * Идентификатор - Строка - Идентификатор параметра, должен быть заключен в []
//	 * Наименование - Строка - Представление параметра
//	 * ПутьКДанным - Строка - Имя реквизита объекта метаданных, можно использовать обращение через одну ".".
//	 * Формат - Строка - Строка описывающая формат, к которому нужно привести значение, используется для типов Дата и Число
//
Функция ДобавитьОписаниеПараметраШаблонаНазначенияСБП(ПараметрыШаблона)
	ОписаниеПараметра = Новый Структура;
	ОписаниеПараметра.Вставить("Идентификатор", "");
	ОписаниеПараметра.Вставить("Наименование", "");
	ОписаниеПараметра.Вставить("ПутьКДанным", "");
	ОписаниеПараметра.Вставить("Формат", "");
	
	ПараметрыШаблона.Добавить(ОписаниеПараметра);
	Возврат ОписаниеПараметра;
КонецФункции


// Добавляет в коллекцию описаний типов документов, подключенных к механизму Шаблоны назначений СБП новое описание.
// Параметры:
//  ОписанияТиповДокументов - Соответствие из КлючИЗначение - Ключ - тип документа, значение - см. ДобавитьОписаниеТипаДокументаИспользующегоШаблоныНазначенияСБП
//  ТипДокумента - Тип - 
//  ОбъектМетаданных - ОбъектМетаданныхДокумент -
//  
// Возвращаемое значение:
//  Структура:
//	 * Имя - Строка
//	 * Синоним - Строка
//
Функция ДобавитьОписаниеТипаДокументаИспользующегоШаблоныНазначенияСБП(ОписанияТиповДокументов, ТипДокумента, ОбъектМетаданных)
	ОписаниеТипаДокумента = Новый Структура;
	ОписаниеТипаДокумента.Вставить("Имя", ОбъектМетаданных.Имя);
	ОписаниеТипаДокумента.Вставить("Синоним", ОбъектМетаданных.Синоним);
	
	ОписанияТиповДокументов.Вставить(ТипДокумента, ОписаниеТипаДокумента);
	Возврат ОписаниеТипаДокумента;
КонецФункции

// Заполняет назначение платежа заказа на оплату по шаблону назначения.
// Параметры:
//  ДокументОплаты - ДокументСсылка
//	ЗаказНаОплату - см. ПереводыСБПc2bПереопределяемый.ПриФормированииЗаказаНаОплатуСБП
//  
Процедура ЗаполнитьНазначениеПлатежаПоШаблонуНазначенияСБП(ДокументОплаты, ЗаказНаОплату) Экспорт
	
	ТипыПодключенныхДокументов = ТипыДокументовИспользующиеШаблоныНазначенияСБП();
	ОписаниеТипаДокумента = ТипыПодключенныхДокументов[ТипЗнч(ДокументОплаты)]; // см. ДобавитьОписаниеТипаДокументаИспользующегоШаблоныНазначенияСБП
	Если ОписаниеТипаДокумента <> Неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Идентификатор", ОписаниеТипаДокумента.Имя);
		НайденныеСтроки = ЗаказНаОплату.ШаблоныНазначений.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ШаблонНазначения = НайденныеСтроки[0];
			ТекстНазначенияПлатежа = ШаблонНазначения.НазначениеПлатежа;
			
			ПараметрыШаблона = ПараметрыШаблонаНазначенияСБППоТипуДокумента(ТипЗнч(ДокументОплаты));
			Если ПараметрыШаблона.Количество() Тогда
				МассивРеквизитов = Новый Массив;
				Для Каждого ПараметрШаблона Из ПараметрыШаблона Цикл
					Если ЗначениеЗаполнено(ПараметрШаблона.ПутьКДанным) Тогда
						МассивРеквизитов.Добавить(ПараметрШаблона.ПутьКДанным);
					КонецЕсли;
				КонецЦикла;
				
				ЗначенияПараметровШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОплаты, МассивРеквизитов, Истина);
				Для Каждого ПараметрШаблона Из ПараметрыШаблона Цикл
					ПутьКДанным = СтрЗаменить(ПараметрШаблона.ПутьКДанным, ".", "");
					Если ЗначениеЗаполнено(ПутьКДанным) Тогда
						ЗначениеПараметра = Неопределено;
						Если ЗначенияПараметровШаблона.Свойство(ПутьКДанным, ЗначениеПараметра) И ЗначениеПараметра <> Неопределено Тогда
							Если ЗначениеЗаполнено(ПараметрШаблона.Формат) Тогда
								ЗначениеПараметраСтрокой = Формат(ЗначениеПараметра, ПараметрШаблона.Формат);
							Иначе
								ЗначениеПараметраСтрокой = Формат(ЗначениеПараметра);
							КонецЕсли;
							ТекстНазначенияПлатежа = СтрЗаменить(ТекстНазначенияПлатежа, ПараметрШаблона.Идентификатор, ЗначениеПараметраСтрокой);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ЗаказНаОплату.НазначениеПлатежа = ТекстНазначенияПлатежа;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область РозничнаяПродажаМаркированнойПродукции

#Область РозничнаяПродажаТабачнойПродукцииТолькоПоМРЦ

Функция ТипыОбъектовДляОчисткиСкидкиПоМРЦ()

	Результат = Новый Массив;
	Результат.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	Результат.Добавить(Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента"));
	Результат.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	Результат.Добавить(Тип("ДокументСсылка.ЧекККМ"));
	
	Возврат Результат;

КонецФункции

// Параметры:
//	Форма - ФормаКлиентскогоПриложения - список форм в методе РозничныеПродажиКлиентСерверЛокализация.ФормыСоВстроеннымМеханизмомМРЦ()
Процедура ИзменитьФормуПродажаТабачнойПродукцииТолькоПоМРЦ(Форма)
	
	Если РозничныеПродажиКлиентСерверЛокализация.ФормыСоВстроеннымМеханизмомМРЦ().Найти(Форма.ИмяФормы) <> Неопределено Тогда
		
		КонтрольныйРеквизит = РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаИспользоватьРозничныеПродажиТабачнойПродукцииТолькоПоМРЦ();
		// Добавление реквизита
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, КонтрольныйРеквизит) Тогда
			
			ДобавляемыеРеквизиты = Новый Массив;
			НовРеквизит = Новый РеквизитФормы(КонтрольныйРеквизит, Новый ОписаниеТипов("Булево"));
			ДобавляемыеРеквизиты.Добавить(НовРеквизит);
			
			Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК"
				Или Форма.ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК"
				Или Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
				
				ИмяТЧ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.%1", 
					РозничныеПродажиКлиентСерверЛокализация.ТаблицаТоваровПоФормеМРЦ(Форма.ИмяФормы));
				ИмяНовогоРеквизитаФормы = РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаУстановленаМРЦ();
				НовКолонка = Новый РеквизитФормы(ИмяНовогоРеквизитаФормы, Новый ОписаниеТипов("Булево"), 
					ИмяТЧ, НСтр("ru = 'Установлена МРЦ'"));
				ДобавляемыеРеквизиты.Добавить(НовКолонка);
				
				ИмяНовогоРеквизитаФормы = РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаЕстьОшибкаВЦенеПоМРЦ();
				НовРеквизит = Новый РеквизитФормы(ИмяНовогоРеквизитаФормы, Новый ОписаниеТипов("Булево"));
				ДобавляемыеРеквизиты.Добавить(НовРеквизит);
				
			КонецЕсли;
			
			Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		КонецЕсли;
		
		// Заполнение реквизита
		КонтрольноеЗначение = Ложь;
		Если Форма.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма"
			Или Форма.ИмяФормы = "Справочник.БонусныеПрограммыЛояльности.Форма.ОплатаБонуснымиБаллами" Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Параметры, КонтрольныйРеквизит) Тогда
				КонтрольноеЗначение = Форма.Параметры[КонтрольныйРеквизит];
			КонецЕсли;
		ИначеЕсли Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК"
			ИЛИ Форма.ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК" Тогда
			КонтрольноеЗначение = КонтролироватьЦенуПродажиТабачнойПродукции(ТекущаяДатаСеанса());
		Иначе
			ТекДата = ?(ЗначениеЗаполнено(Форма.Объект.Дата),Форма.Объект.Дата, ТекущаяДатаСеанса());
			ТекКонтрагент = Форма.Объект.Контрагент;	// СправочникСсылка.Контрагенты
			ТекЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекКонтрагент, "ЮрФизЛицо");
			КонтрольноеЗначение = КонтролироватьЦенуПродажиТабачнойПродукции(ТекДата)
				И ТекЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо");
		КонецЕсли;
		
		Форма[КонтрольныйРеквизит] = КонтрольноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

// Получить текст запроса товары по реализации товаров услуг с видами продукции ИС по ссылке
// 
// Возвращаемое значение:
//  Строка - Текст запроса получения товаров по реализации товаров услуг с указанием вида продукции ИС
Функция ПолучитьТекстЗапросаТоварыПоРеализацииТоваровУслугСВидамиПродукцииИСПоСсылке()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТоварыДокумента.НомерСтроки,
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Цена,
	|	ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции, ЗНАЧЕНИЕ(Справочник.КлючиВидовПродукцииИС.ПустаяСсылка)) ВидПродукцииИС,
	|	ТоварыДокумента.Количество,
	|	ТоварыДокумента.СуммаАвтоматическойСкидки,
	|	ТоварыДокумента.ПроцентАвтоматическойСкидки,
	|	ТоварыДокумента.СуммаРучнойСкидки,
	|	ТоварыДокумента.ПроцентРучнойСкидки,
	|	ТоварыДокумента.СуммаБонусныхБалловКСписанию,
	|	ТоварыДокумента.СуммаБонусныхБалловКСписаниюВВалюте,
	|	ТоварыДокумента.СуммаСНДС
	|ПОМЕСТИТЬ ТоварыДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТоварыДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|	ПО ТоварыДокумента.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументСсылка
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Получить текст запроса товары по реализации товаров услуг с видами продукции ИС по объекту
// 
// Возвращаемое значение:
//  Строка - Текст запроса получения товаров по реализации товаров услуг с указанием вида продукции ИС
Функция ПолучитьТекстЗапросаТоварыПоРеализацииТоваровУслугСВидамиПродукцииИСПоОбъекту()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТоварыДокумента.НомерСтроки,
	|	ВЫРАЗИТЬ(ТоварыДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Цена,
	|	ТоварыДокумента.Количество,
	|	ТоварыДокумента.СуммаАвтоматическойСкидки,
	|	ТоварыДокумента.ПроцентАвтоматическойСкидки,
	|	ТоварыДокумента.СуммаРучнойСкидки,
	|	ТоварыДокумента.ПроцентРучнойСкидки,
	|	ТоварыДокумента.СуммаБонусныхБалловКСписанию,
	|	ТоварыДокумента.СуммаБонусныхБалловКСписаниюВВалюте
	|ПОМЕСТИТЬ ТоварыДокументаБезВидаПродукцииИС
	|ИЗ
	|	&ТоварыДокумента КАК ТоварыДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДокумента.НомерСтроки,
	|	ТоварыДокумента.Номенклатура,
	|	ТоварыДокумента.Характеристика,
	|	ТоварыДокумента.Серия,
	|	ТоварыДокумента.Цена,
	|	ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции, ЗНАЧЕНИЕ(Справочник.КлючиВидовПродукцииИС.ПустаяСсылка)) КАК ВидПродукцииИС,
	|	ТоварыДокумента.Количество,
	|	ТоварыДокумента.СуммаАвтоматическойСкидки,
	|	ТоварыДокумента.ПроцентАвтоматическойСкидки,
	|	ТоварыДокумента.СуммаРучнойСкидки,
	|	ТоварыДокумента.ПроцентРучнойСкидки,
	|	ТоварыДокумента.СуммаБонусныхБалловКСписанию,
	|	ТоварыДокумента.СуммаБонусныхБалловКСписаниюВВалюте
	|ПОМЕСТИТЬ ТоварыДокумента
	|ИЗ
	|	ТоварыДокументаБезВидаПродукцииИС КАК ТоварыДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|	ПО ТоварыДокумента.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ПроверкаВозрастаПокупателя

Процедура НастроитьФормуДляПодтвержденияВозрастаПокупателя(Форма, ТекущийОбъект = Неопределено) Экспорт
	
	Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК" 
		Или Форма.ИмяФормы = "Обработка.ПредпросмотрЧека.Форма.Форма" 
			И (ТипЗнч(Форма.ДокументСсылка) = Тип("ДокументСсылка.АктВыполненныхРабот")
				Или ТипЗнч(Форма.ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				Или ТипЗнч(Форма.ДокументСсылка) = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов")) Тогда
		
		// Реквизит для хранения состояния функциональной опции
		ИмяКонтрольногоРеквизита = 
			РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаИспользоватьПодтверждениеВозрастаЧерезМакс();
		
		// Реквизит для контроля необходимости отображения состояния проверки возраста покупателя
		ИмяРеквизитаЕстьТоварыТребующиеПодтвержденияВозраста = 
			РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаЕстьТоварыТребующиеПодтвержденияВозрастаПокупателя();
		// Реквизит для хранения состояния проверки возраста покупателя
		ИмяРеквизитаСостояниеПроверкиВозраста = 
			РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаСостояниеПроверкиВозрастаПокупателя();

		ФормаБылаНастроена = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяКонтрольногоРеквизита);
		// Добавление реквизитов, элементов формы 
		Если Не ФормаБылаНастроена Тогда
			ДобавляемыеРеквизиты = Новый Массив;
			
			// Добавляем реквизит для хранения состояния функциональной опции
			НовРеквизит = Новый РеквизитФормы(ИмяКонтрольногоРеквизита, Новый ОписаниеТипов("Булево"));
			ДобавляемыеРеквизиты.Добавить(НовРеквизит);
			
			// Добавляем реквизит для контроля необходимости отображения состояния проверки возраста покупателя
			НовРеквизит = Новый РеквизитФормы(ИмяРеквизитаЕстьТоварыТребующиеПодтвержденияВозраста, Новый ОписаниеТипов("Булево"));
			ДобавляемыеРеквизиты.Добавить(НовРеквизит);
			
			// Добавляем реквизит для хранения состояния проверки возраста покупателя
			НовРеквизит = Новый РеквизитФормы(ИмяРеквизитаСостояниеПроверкиВозраста,
											Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
			ДобавляемыеРеквизиты.Добавить(НовРеквизит);
		
			// Добавляем декорацию для отображения состояния проверки возраста покупателя
			ИмяЭлементаФормыСостояниеПроверкиВозрастаПокупателя = 
				РозничныеПродажиКлиентСерверЛокализация.ИмяЭлементаФормыСостояниеПроверкиВозрастаПокупателя(Форма.ИмяФормы);
			ЭлементФормыСостояниеПроверки = Форма.Элементы.Найти(ИмяЭлементаФормыСостояниеПроверкиВозрастаПокупателя);
			Если ЭлементФормыСостояниеПроверки = Неопределено Тогда
				// На подключенной форме должна присутствовать эта группа элементов
				ИмяГруппыСостояниеПроверкиВозрастаПокупателя = "ЛокализацияГруппаСостояниеПроверкиВозрастаПокупателя";
				ГруппаСостояниеПроверкиВозрастаПокупателя = Форма.Элементы[ИмяГруппыСостояниеПроверкиВозрастаПокупателя];
				ЭлементФормыСостояниеПроверки = Форма.Элементы.Добавить(ИмяЭлементаФормыСостояниеПроверкиВозрастаПокупателя, 
														Тип("ДекорацияФормы"), 
														ГруппаСостояниеПроверкиВозрастаПокупателя); // ДекорацияФормы
				ЭлементФормыСостояниеПроверки.Вид = ВидДекорацииФормы.Надпись;
			КонецЕсли;
			ЭлементФормыСостояниеПроверки.УстановитьДействие("ОбработкаНавигационнойСсылки", 
											РозничныеПродажиКлиентСерверЛокализация.ИмяОбработчикаНавигационнойСсылкиЭлементаФормыСостояниеПроверкиВозрастаПокупателя());
		
			// Добавляем команду подтверждения возраста через Макс
			ИмяКомандыПодтверждениеВозрастаПокупателя = 
				РозничныеПродажиКлиентСерверЛокализация.ИмяКомандыПодтверждениеВозрастаПокупателяЧерезМакс();
			ФормаКоманды = Форма.Команды; // КомандыФормы
			НоваяКоманда = ФормаКоманды.Добавить(ИмяКомандыПодтверждениеВозрастаПокупателя);
			НоваяКоманда.Действие = 
				РозничныеПродажиКлиентСерверЛокализация.ИмяДействияПодтверждениеВозрастаПокупателяЧерезМакс();
			НоваяКоманда.Заголовок = НСтр("ru = 'Подтверждение возраста'");
			НоваяКоманда.Картинка = БиблиотекаКартинок.ЛоготипМаксБПО;
			
			// Добавляем кнопку для подтверждения возраста через Макс
			ИмяКнопкиПодтверждениеВозрастаПокупателяЧерезМакс = РозничныеПродажиКлиентСерверЛокализация.ИмяКнопкиПодтверждениеВозрастаПокупателяЧерезМакс();
			Если Форма.Элементы.Найти(ИмяКнопкиПодтверждениеВозрастаПокупателяЧерезМакс) = Неопределено Тогда
				// На подключенной форме должна присутствовать эта группа элементов					
				ИмяГруппыЛокализованныхКоманд = "ЛокализацияГруппаКоманд";
				ГруппаЛокализованныхКоманд = Форма.Элементы[ИмяГруппыЛокализованныхКоманд];
				
				Кнопка = Форма.Элементы.Добавить(ИмяКнопкиПодтверждениеВозрастаПокупателяЧерезМакс, 
												Тип("КнопкаФормы"), 
												ГруппаЛокализованныхКоманд);
												
				Кнопка.ИмяКоманды = ИмяКомандыПодтверждениеВозрастаПокупателя;
				Кнопка.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
			КонецЕсли;
			
			Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		КонецЕсли;
		
		// Инициализация значений
		Если Не ФормаБылаНастроена Или ТекущийОбъект <> Неопределено И ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
			Форма[ИмяРеквизитаСостояниеПроверкиВозраста] = 0;
			Форма[ИмяРеквизитаЕстьТоварыТребующиеПодтвержденияВозраста] = Ложь;
			
			КлючиВидовПродукцииИСНоменклатуры = Новый Соответствие;
			Если Форма.ИмяФормы = "Обработка.ПредпросмотрЧека.Форма.Форма"
				И ТипЗнч(Форма.ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				КлючиВидовПродукцииИСНоменклатуры = КлючиВидовПродукцииИСТоварныхПозицийДокументаПродажи(Форма.ДокументСсылка);
			ИначеЕсли Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК" Тогда
				ФормаОбъект = Форма.Объект; // ДокументОбъект
				Если ЗначениеЗаполнено(ФормаОбъект.Ссылка) Тогда
					КлючиВидовПродукцииИСНоменклатуры = КлючиВидовПродукцииИСТоварныхПозицийДокументаПродажи(ФормаОбъект.Ссылка);
				КонецЕсли;
			КонецЕсли;
			Если КлючиВидовПродукцииИСНоменклатуры.Количество() Тогда
				КлючиВидовПродукцииИСДляПроверки = Новый Массив;
				Для Каждого КлючВидаПродукции Из КлючиВидовПродукцииИСНоменклатуры Цикл
					Если КлючиВидовПродукцииИСДляПроверки.Найти(КлючВидаПродукции.Значение) = Неопределено Тогда
						Для Каждого ВидПродукции Из КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииКлюча(КлючВидаПродукции.Значение) Цикл
							Если КлючиВидовПродукцииИСДляПроверки.Найти(ВидПродукции) = Неопределено Тогда
								КлючиВидовПродукцииИСДляПроверки.Добавить(ВидПродукции);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				Форма[ИмяРеквизитаЕстьТоварыТребующиеПодтвержденияВозраста] = КонструкторИСОбщегоНазначенияКлиентСервер.ПроверятьВозраст(КлючиВидовПродукцииИСДляПроверки);
			КонецЕсли;

			Если ПолучитьФункциональнуюОпцию(ИмяКонтрольногоРеквизита) Тогда
				Форма[ИмяКонтрольногоРеквизита] = Истина;
			КонецЕсли;
			ОбновитьНастройкиФормыДляПроверкиВозрастаПокупателя(Форма);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьНастройкиФормыДляПроверкиВозрастаПокупателя(Форма) Экспорт
	
	ИмяРеквизитаЕстьТоварыТребующиеПодтвержденияВозрастаПокупателя = 
			РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаЕстьТоварыТребующиеПодтвержденияВозрастаПокупателя();
	ИмяРеквизитаСостояниеПроверкиВозрастаПокупателя = РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаСостояниеПроверкиВозрастаПокупателя();
	ВидимостьКнопкиПодтверждениеВозрастаПоУмолчанию = 
		ПолучитьФункциональнуюОпцию(РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаИспользоватьПодтверждениеВозрастаЧерезМакс());
	ДоступностьКнопкиПодтверждениеВозрастаПоУмолчанию = ВидимостьКнопкиПодтверждениеВозрастаПоУмолчанию;
	Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК" И Форма.Объект.Товары.Количество() = 0 Тогда
		ДоступностьКнопкиПодтверждениеВозрастаПоУмолчанию = Ложь;
	КонецЕсли;
	КодСостоянияПроверки = Форма[ИмяРеквизитаСостояниеПроверкиВозрастаПокупателя];
	Если КодСостоянияПроверки = 0 Тогда
		Если Форма[ИмяРеквизитаЕстьТоварыТребующиеПодтвержденияВозрастаПокупателя] = Истина Тогда
			Если Форма[РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаИспользоватьПодтверждениеВозрастаЧерезМакс()] = Истина Тогда
				КодСостоянияПроверки = 2;
			Иначе
				КодСостоянияПроверки = 1;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли (КодСостоянияПроверки = 1 Или КодСостоянияПроверки = 2
			Или ДоступностьКнопкиПодтверждениеВозрастаПоУмолчанию = Ложь)
			И Форма[ИмяРеквизитаЕстьТоварыТребующиеПодтвержденияВозрастаПокупателя] = Ложь Тогда
		КодСостоянияПроверки = 0;
	КонецЕсли;
	Если КодСостоянияПроверки <> Форма[ИмяРеквизитаСостояниеПроверкиВозрастаПокупателя] Тогда
		Форма[ИмяРеквизитаСостояниеПроверкиВозрастаПокупателя] = КодСостоянияПроверки;
	КонецЕсли;
	
	ОформитьЭлементФормыСостояниеПроверкиВозрастаПокупателя(Форма);

	КнопкаПодтверждениеВозраста = Форма.Элементы[РозничныеПродажиКлиентСерверЛокализация.ИмяКнопкиПодтверждениеВозрастаПокупателяЧерезМакс()];
	КнопкаПодтверждениеВозраста.Видимость = ВидимостьКнопкиПодтверждениеВозрастаПоУмолчанию; 
	КнопкаПодтверждениеВозраста.Доступность = ДоступностьКнопкиПодтверждениеВозрастаПоУмолчанию;
	
КонецПроцедуры

// Оформление декорации состояние проверки возраста покупателя.
// Если используется поле ввода, то на форме должен быть объявлен одноименный реквизит для хранения данных,
// связанный с этим элементом формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
//
Процедура ОформитьЭлементФормыСостояниеПроверкиВозрастаПокупателя(Форма) Экспорт
	
	ИмяЭлементаФормы = 
		РозничныеПродажиКлиентСерверЛокализация.ИмяЭлементаФормыСостояниеПроверкиВозрастаПокупателя(Форма.ИмяФормы);
	ЭлементФормы = Форма.Элементы[ИмяЭлементаФормы]; // ДекорацияФормы, ПолеФормы
	ЭлементФормы.Видимость = Ложь;
	
	ЗаголовокДекорации = Новый ФорматированнаяСтрока(
								НСтр("ru = 'Подтверждение возраста не требуется'"),
								ШрифтыСтиля.ЖирныйШрифт,
								ЦветаСтиля.ГиперссылкаЦвет);
	
	//  КодСостояния - Число - 0 проверка не требуется
	//                         1 проверка требуется, не включен механизм проверки
	//                         2 проверка требуется, включен механизм проверки
	//                         3 проверка прошла успешно, возраст подтвержден
	//                         4 проверка не пройдена, возраст не подтвержден
	//                         5 проверка не пройдена, произошла ошибка
	КодСостояния = Форма[РозничныеПродажиКлиентСерверЛокализация.ИмяРеквизитаСостояниеПроверкиВозрастаПокупателя()];
	Если КодСостояния = 1 Тогда
		ЭлементФормы.Видимость = Истина;
		ЗаголовокДекорации = Новый ФорматированнаяСтрока(
									НСтр("ru = 'Требуется подтверждение возраста'"),
									ШрифтыСтиля.ЖирныйШрифт,
									WebЦвета.Красный);
	ИначеЕсли КодСостояния = 2 Тогда
		ЭлементФормы.Видимость = Истина;
		ЗаголовокДекорации = Новый ФорматированнаяСтрока(
									НСтр("ru = 'Требуется подтверждение возраста'"),
									ШрифтыСтиля.ЖирныйШрифт,
									WebЦвета.Красный,
									,
									РозничныеПродажиКлиентСерверЛокализация.ИмяДействияПодтверждениеВозрастаПокупателяЧерезМакс());
	ИначеЕсли КодСостояния = 3 Тогда
		ЭлементФормы.Видимость = Истина;
		ЗаголовокДекорации = Новый ФорматированнаяСтрока(
									НСтр("ru = 'Возраст покупателя подтвержден'"),
									ШрифтыСтиля.ОбычныйШрифтТекста,
									WebЦвета.НейтральноСиний);
	ИначеЕсли КодСостояния = 4 Тогда
		ЭлементФормы.Видимость = Истина;
		ЗаголовокДекорации = Новый ФорматированнаяСтрока(
									НСтр("ru = 'Возраст покупателя не подтвержден'"),
									ШрифтыСтиля.ЖирныйШрифт,
									WebЦвета.Красный);
	ИначеЕсли КодСостояния = 5 Тогда
		ЭлементФормы.Видимость = Истина;
		ЗаголовокДекорации = Новый ФорматированнаяСтрока(
									НСтр("ru = 'Ошибка при подтверждении возраста, повторить операцию'"),
									ШрифтыСтиля.ЖирныйШрифт,
									WebЦвета.Коричневый,
									,
									РозничныеПродажиКлиентСерверЛокализация.ИмяДействияПодтверждениеВозрастаПокупателяЧерезМакс());
	КонецЕсли;
	
	Если ТипЗнч(ЭлементФормы) = Тип("ДекорацияФормы") Тогда
		ЭлементФормы.Заголовок = ЗаголовокДекорации;
	ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") Тогда
		Форма[ИмяЭлементаФормы] = ЗаголовокДекорации;
	Иначе
		ЭлементФормы.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// Функция проверяет, что ИНН комитента, указанный для номенклатурной позиции в строке таблицы присутствует среди ИНН 
// поставщиков комиссионного товара, указанных в данных фискального чека продажи.
// Возвращает Истина, если ИНН во всех строках присутствуют в данных фискального чека продажи, иначе - Ложь.
//
// Параметры:
//	ТаблицаДляПроверки - ТаблицаЗначений - Таблица значений с данными для проверки. Колонки:
//	  *Номенклатура - СправочникСсылка.Номенклатура - 
//	  *Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - 
//	  *Серия - СправочникСсылка.СерииНоменклатуры - 
//	  *Комитент - СправочникСсылка.Организации, СправочникСсылка.Контрагенты, Неопределено - 
//	  *ИННКомитента - Строка -
//	ДанныеИсходнойФискальнойОперации - см. ОборудованиеЧекопечатающиеУстройства.ДанныеФискальнойОперации
//
// Возвращаемое значение:
//	Булево
//
Функция ИННКомитентаВТаблицеСоответствуетИсходному(ТаблицаДляПроверки, ДанныеИсходнойФискальнойОперации) Экспорт
	РезультатПроверки = Истина;
	Если ТаблицаДляПроверки.Количество() = 0 Тогда
		Возврат РезультатПроверки;
	КонецЕсли;

	ДанныеЧекаXML = Неопределено;
	Если ТипЗнч(ДанныеИсходнойФискальнойОперации.ДанныеXML) = Тип("ХранилищеЗначения") Тогда
		ДанныеЧекаXML = ДанныеИсходнойФискальнойОперации.ДанныеXML.Получить();
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеЧекаXML) Тогда
		
		// Обрабатываем данные о маркировке, нам нужны данные только о поставщиках маркированных товаров
		ДанныеЧека = ОборудованиеЧекопечатающиеУстройства.ЗагрузитьДанныеФискализацииИзXML(ДанныеЧекаXML, Истина);
		ДанныеПоставщиковМаркированныхТоваровИзЧека = Новый Соответствие;
		ЕстьМаркированныеТовары = Ложь;
		// Свойство обязательное
		Для Каждого ПозицияЧека Из ДанныеЧека.ПозицииЧека Цикл
			Если ПозицияЧека.Свойство("ПризнакАгентаПоПредметуРасчета") 
				И ПозицияЧека.ПризнакАгентаПоПредметуРасчета = Перечисления.ПризнакиАгента.Комиссионер
				И ПозицияЧека.Свойство("КонтрольнаяМарка") 
				И ЗначениеЗаполнено(ПозицияЧека.КонтрольнаяМарка) Тогда
				ЕстьМаркированныеТовары = Истина;
				// Свойство обязательное, если не указано, то ККТ не пробьет чек.
				Если ЗначениеЗаполнено(ПозицияЧека.ДанныеПоставщика.ИНН) Тогда
					ДанныеПоставщиковМаркированныхТоваровИзЧека.Вставить(ПозицияЧека.ДанныеПоставщика.ИНН, ПозицияЧека.ДанныеПоставщика.Наименование); 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ДанныеПоставщиковМаркированныхТоваровИзЧека.Количество() Тогда
			Для Каждого СтрокаДляПроверки Из ТаблицаДляПроверки Цикл
				Если ДанныеПоставщиковМаркированныхТоваровИзЧека.Получить(СтрокаДляПроверки.ИННКомитента) = Неопределено Тогда
					СтрокиПозиции = Новый Массив;
					СтрокиПозиции.Добавить(Строка(СтрокаДляПроверки.Номенклатура));
					Если ЗначениеЗаполнено(СтрокаДляПроверки.Характеристика) Тогда
						СтрокиПозиции.Вставить(Строка(СтрокаДляПроверки.Характеристика));
					КонецЕсли;
					Если ЗначениеЗаполнено(СтрокаДляПроверки.Серия) Тогда
						СтрокиПозиции.Вставить("Серия №:" + Строка(СтрокаДляПроверки.Серия));
					КонецЕсли;
					ПредставлениеПозиции = СтрСоединить(СтрокиПозиции, "/");
					ШаблонТекстаОшибки = НСтр("ru = 'Для маркированного товара ""%1"" ИНН %2 комитента %3 отличается от указанного в документе-основании.'");
					ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ПредставлениеПозиции, СтрокаДляПроверки.ИННКомитента, СтрокаДляПроверки.Комитент);
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
					РезультатПроверки = Ложь;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ЕстьМаркированныеТовары Тогда
			// Сообщение выводится информационно
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не найдено данных о владельцах маркированного товара в XML чека продажи. Проверка не выполнялась.'"));
			РезультатПроверки = Истина;
		КонецЕсли;
	Иначе
		// Сообщение выводится информационно
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось получить данные о владельцах маркированного товара для проверки из XML чека продажи. Проверка не выполнялась.'"));
		РезультатПроверки = Истина;
	КонецЕсли;
	
	Возврат РезультатПроверки;
КонецФункции

// Проверяет данные маркированных товаров документа перед выполнением фискальной операции
//
// Параметры:
//  Объект - ДокументОбъект.КорректировкаРеализации - Объект документа КорректировкаРеализации
//  ДополнительныеПараметры - Структура Из КлючИЗначение - Произвольная структура для передачи данных из клиентского контекста
//
// Возвращаемое значение:
//  Булево - 
//
Функция ПроверкаДанныхМаркированногоТовараДокументаКорректировкаРеализации(Объект, ДополнительныеПараметры = Неопределено)
	Результат = Истина;
	
	ДанныеФискальногоЧекаРТУ = ФормированиеФискальныхЧековСервер.ДанныеПробитогоФискальногоЧекаПоДокументу(Объект.ДокументОснование);
	Если ДанныеФискальногоЧекаРТУ = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не КорректировкаРеализацииЛокализация.ДокументСодержитМаркированныйТовар(Объект.Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не (ЗначениеЗаполнено(Объект.ДокументОснование)
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг")) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Операция коррекции маркированной продукции на ККТ не поддерживается.'"));
		
		Результат = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРасхождений.Номенклатура КАК Номенклатура,
	|	ТаблицаРасхождений.Характеристика КАК Характеристика,
	|	ТаблицаРасхождений.Серия КАК Серия,
	|	СУММА(ТаблицаРасхождений.Количество) КАК КоличествоИзменение,
	|	МАКСИМУМ(ТаблицаРасхождений.КоличествоПродано) КАК КоличествоПродано,
	|	МАКСИМУМ(ТаблицаРасхождений.НомерСтроки) КАК НомерСтроки,
	|	МАКСИМУМ(ТаблицаРасхождений.ЭтоРеализация) КАК ЭтоРеализация,
	|	МАКСИМУМ(ТаблицаРасхождений.ЭтоКорректировка) КАК ЭтоКорректировка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыРеализацияТоваровУслуг.Номенклатура КАК Номенклатура,
	|		ТоварыРеализацияТоваровУслуг.Характеристика КАК Характеристика,
	|		ТоварыРеализацияТоваровУслуг.Серия КАК Серия,
	|		ТоварыРеализацияТоваровУслуг.Количество КАК Количество,
	|		ТоварыРеализацияТоваровУслуг.Количество КАК КоличествоПродано,
	|		ТоварыРеализацияТоваровУслуг.НомерСтроки КАК НомерСтроки,
	|		1 КАК ЭтоРеализация,
	|		0 КАК ЭтоКорректировка
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК ТоварыРеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|		ПО ТоварыРеализацияТоваровУслуг.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
	|		И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
	|	ГДЕ
	|		ТоварыРеализацияТоваровУслуг.Ссылка = &ДокументОснование
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКорректировкаРеализации.Номенклатура,
	|		ТоварыКорректировкаРеализации.Характеристика,
	|		ТоварыКорректировкаРеализации.Серия,
	|		-ТоварыКорректировкаРеализации.Количество,
	|		0,
	|		ТоварыКорректировкаРеализации.НомерСтроки,
	|		0,
	|		1
	|	ИЗ
	|		Документ.КорректировкаРеализации.Товары КАК ТоварыКорректировкаРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|		ПО ТоварыКорректировкаРеализации.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
	|		И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
	|	ГДЕ
	|		ТоварыКорректировкаРеализации.Ссылка = &Ссылка) КАК ТаблицаРасхождений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасхождений.Номенклатура,
	|	ТаблицаРасхождений.Характеристика,
	|	ТаблицаРасхождений.Серия
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаРасхождений.Количество) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокКорректировки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ШтрихкодыУпаковокКорректировки.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокКорректировки.ШтрихкодУпаковки.Характеристика КАК Характеристика,
	|	ШтрихкодыУпаковокКорректировки.ШтрихкодУпаковки.Серия КАК Серия
	|ИЗ
	|	Документ.КорректировкаРеализации.ШтрихкодыУпаковок КАК ШтрихкодыУпаковокКорректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК ШтрихкодыУпаковокРеализации
	|		ПО (ШтрихкодыУпаковокРеализации.Ссылка = &ДокументОснование)
	|			И ШтрихкодыУпаковокКорректировки.ШтрихкодУпаковки = ШтрихкодыУпаковокРеализации.ШтрихкодУпаковки
	|ГДЕ
	|	ШтрихкодыУпаковокКорректировки.Ссылка = &Ссылка
	|	И ШтрихкодыУпаковокРеализации.ШтрихкодУпаковки ЕСТЬ NULL
	|ИТОГИ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	ШтрихкодУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыЗапасов.Номенклатура КАК Номенклатура,
	|	ВидыЗапасов.Характеристика КАК Характеристика,
	|	ВидыЗапасов.Серия КАК Серия,
	|	ВидыЗапасов.Комитент КАК Комитент,
	|	ВидыЗапасов.ИННКомитента КАК ИННКомитента
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВидыЗапасовКорректировкаВыручки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		ВидыЗапасовКорректировкаВыручки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|		ВидыЗапасовКорректировкаВыручки.АналитикаУчетаНоменклатуры.Серия КАК Серия,
	|		ВидыЗапасовКорректировкаВыручки.ВидЗапасов.Контрагент КАК Комитент,
	|		ВЫБОР
	|			КОГДА ВидыЗапасовКорректировкаВыручки.ВидЗапасов.Контрагент = НЕОПРЕДЕЛЕНО
	|				ТОГДА """"
	|			ИНАЧЕ ВидыЗапасовКорректировкаВыручки.ВидЗапасов.Контрагент.ИНН
	|		КОНЕЦ КАК ИННКомитента
	|	ИЗ
	|		Документ.КорректировкаРеализации.ВидыЗапасовКорректировкаВыручки КАК ВидыЗапасовКорректировкаВыручки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|		ПО ВидыЗапасовКорректировкаВыручки.АналитикаУчетаНоменклатуры.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
	|		И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
	|	ГДЕ
	|		ВидыЗапасовКорректировкаВыручки.Ссылка = &Ссылка
	|		И ВидыЗапасовКорректировкаВыручки.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Номенклатура,
	|		ВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Характеристика,
	|		ВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Серия,
	|		ВидыЗапасовСписание.ВидЗапасов.Контрагент,
	|		ВЫБОР
	|			КОГДА ВидыЗапасовСписание.ВидЗапасов.Контрагент = НЕОПРЕДЕЛЕНО
	|				ТОГДА """"
	|			ИНАЧЕ ВидыЗапасовСписание.ВидЗапасов.Контрагент.ИНН
	|		КОНЕЦ
	|	ИЗ
	|		Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК ВидыЗапасовСписание
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|		ПО ВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
	|		И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
	|	ГДЕ
	|		ВидыЗапасовСписание.Ссылка = &Ссылка
	|		И ВидыЗапасовСписание.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)) КАК ВидыЗапасов";

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	РезультатПроверкиТоваров = РезультатыЗапроса[0];
	РезультатПроверкиКМ = РезультатыЗапроса[1];
	РезультатДляПроверкиИННКомитента = РезультатыЗапроса[2];
	
	Если Не РезультатПроверкиТоваров.Пустой() Тогда
		Результат = Ложь;
		ВыборкаРасхождений = РезультатПроверкиТоваров.Выбрать();
		Пока ВыборкаРасхождений.Следующий() Цикл
			СтрокиПозиции = Новый Массив;
			СтрокиПозиции.Добавить(Строка(ВыборкаРасхождений.Номенклатура));
			Если ЗначениеЗаполнено(ВыборкаРасхождений.Характеристика) Тогда
				СтрокиПозиции.Добавить(Строка(ВыборкаРасхождений.Номенклатура));
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаРасхождений.Серия) Тогда
				СтрокиПозиции.Добавить("Серия №:" + Строка(ВыборкаРасхождений.Серия));
			КонецЕсли;
			ПредставлениеПозиции = СтрСоединить(СтрокиПозиции, "/");
			Если ВыборкаРасхождений.ЭтоРеализация = 0 Тогда
				ШаблонТекстаОшибки = НСтр("ru = 'В стр. №%1 указан маркированный товар ""%2"", отсутствующий в документе-основании.'");
				ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ВыборкаРасхождений.НомерСтроки, ПредставлениеПозиции);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			ИначеЕсли ВыборкаРасхождений.ЭтоКорректировка = 0 Тогда
				ШаблонТекстаОшибки = НСтр("ru = 'Удален маркированный товар ""%1"", присутствующий в документе-основании.'");
				ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ПредставлениеПозиции);  
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			ИначеЕсли ВыборкаРасхождений.КоличествоИзменение <> 0 Тогда
				ШаблонТекстаОшибки = НСтр("ru = 'Изменено количество маркированного товара ""%1"" с %2 на %3'");
				ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, 
										ПредставлениеПозиции, 
										Строка(ВыборкаРасхождений.КоличествоПродано), 
										Строка(ВыборкаРасхождений.КоличествоПродано - ВыборкаРасхождений.КоличествоИзменение));
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не РезультатПроверкиКМ.Пустой() Тогда
		Результат = Ложь;
		ВыборкаПоНоменклатуре = РезультатПроверкиКМ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоНоменклатуре.Следующий() Цикл
			ВыборкаПоХарактеристике = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоХарактеристике.Следующий() Цикл
				ВыборкаПоСерии = ВыборкаПоХарактеристике.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоСерии.Следующий() Цикл
					МассивПредставленийКМ = Новый Массив;
					ВыборкаПоКМ = ВыборкаПоСерии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПоКМ.Следующий()Цикл
						МассивПредставленийКМ.Добавить(Строка(ВыборкаПоКМ.ШтрихкодУпаковки));
					КонецЦикла;
					Если МассивПредставленийКМ.Количество() Тогда
						СтрокиПозиции = Новый Массив;
						СтрокиПозиции.Добавить(Строка(ВыборкаПоСерии.Номенклатура));
						Если ЗначениеЗаполнено(ВыборкаПоСерии.Характеристика) Тогда
							СтрокиПозиции.Добавить(Строка(ВыборкаПоСерии.Характеристика));
						КонецЕсли;
						Если ЗначениеЗаполнено(ВыборкаПоСерии.Серия) Тогда
							СтрокиПозиции.Добавить("Серия №:" + Строка(ВыборкаПоСерии.Серия));
						КонецЕсли;
						ПредставлениеПозиции = СтрСоединить(СтрокиПозиции, "/");
						ШаблонТекстаОшибки = НСтр("ru = 'Для маркированного товара ""%1"" присутствуют коды маркировки, которых нет в документе-основании:'");
						МассивПредставленийКМ.Вставить(0, СтрШаблон(ШаблонТекстаОшибки, ПредставлениеПозиции));
						ТекстОшибки = СтрСоединить(МассивПредставленийКМ, Символы.ПС);
						ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если Не РезультатДляПроверкиИННКомитента.Пустой() Тогда
		Результат = ИННКомитентаВТаблицеСоответствуетИсходному(РезультатДляПроверкиИННКомитента.Выгрузить(), ДанныеФискальногоЧекаРТУ) И Результат;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Проверяет данные маркированных товаров документа перед выполнением фискальной операции
//
// Параметры:
//  Объект - ДокументОбъект.ЧекККМКоррекции - Объект документа ЧекККМКоррекции
//  ДополнительныеПараметры - Структура Из КлючИЗначение - Произвольная структура для передачи данных из клиентского контекста
//
// Возвращаемое значение:
//  Булево - 
//
Функция ПроверкаДанныхМаркированногоТовараДокументаЧекККМКоррекции(Объект, ДополнительныеПараметры = Неопределено)
	Результат = Истина;
	
	ДанныеФискальногоЧекаККМ = ФормированиеФискальныхЧековСервер.ДанныеПробитогоФискальногоЧекаПоДокументу(Объект.ЧекККМ);
	Если ДанныеФискальногоЧекаККМ = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Комитент КАК Комитент
	|ПОМЕСТИТЬ ТоварыИсходнаяТаблица
	|ИЗ
	|	&ТаблицаТовары КАК Товары
	|ГДЕ
	|	Товары.Комитент <> НЕОПРЕДЕЛЕНО
	|	И Товары.Комитент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И Товары.Комитент <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Комитент КАК Комитент,
	|	Товары.Комитент.ИНН КАК ИННКомитента
	|ИЗ
	|	ТоварыИсходнаяТаблица КАК Товары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|	ПО Товары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
	|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)";

	Запрос.УстановитьПараметр("ТаблицаТовары", Объект.Товары.Выгрузить());
	
	РезультатДляПроверкиИННКомитента = Запрос.Выполнить();
	Если Не РезультатДляПроверкиИННКомитента.Пустой() Тогда
		Результат = ИННКомитентаВТаблицеСоответствуетИсходному(РезультатДляПроверкиИННКомитента.Выгрузить(), ДанныеФискальногоЧекаККМ);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

//-- Локализация

#Область КомиссионерВЧеке

// Представляет входящий текст пакетного запроса как список значений, где текст атомарного запроса это значении элемента,
// а имя создаваемой таблицы - это представление элемента списка. 
// Параметры:
//	ТекстПакетногоЗапроса - Строка - 	граничные условия декомпозиции пакетного запроса:
//			1) Разделитель запросов ";" размещается на отдельной строке.
// 			2) имя создаваемой таблицы размещается на отдельной строке вместе с ключевым литералом "ПОМЕСТИТЬ".
//
// Возвращаемое значение:
// СписокЗначений из Строка. 
// 	*значение - это текст атомарного запроса, 
// 	*представление - имя создаваемой временной таблицы этим запросом
Функция РазбитьПакетныйЗапрос(Знач ТекстПакетногоЗапроса)
	
	ТекстПакета = СокрЛП(ТекстПакетногоЗапроса);
	СписокЗапросов = Новый СписокЗначений;
	
	ТекЗапрос = "";
	ИмяНовойВТ = "";
	
	Для СчСтроки = 1 По СтрЧислоСтрок(ТекстПакета) Цикл
		
		ТекСтрока = СтрПолучитьСтроку(ТекстПакета, СчСтроки);
		СтрокаСодержимое = СокрЛП(ТекСтрока);
		
		Если СтрНачинаетсяС(СтрокаСодержимое, ";") Тогда
			// это разделитель запросов
			Если НЕ ПустаяСтрока(ТекЗапрос) Тогда
				СписокЗапросов.Добавить(ТекЗапрос, ИмяНовойВТ);
				ТекЗапрос = "";
				ИмяНовойВТ = "";
			КонецЕсли;
			
			Продолжить;
			
		ИначеЕсли СтрНачинаетсяС(ВРег(СтрокаСодержимое), "ПОМЕСТИТЬ") Тогда
			// это имя ВТ
			ИмяНовойВТ = СокрЛП(Сред(СтрокаСодержимое, 10));
		КонецЕсли;
		ТекЗапрос = ТекЗапрос + Символы.ПС + ТекСтрока;
	КонецЦикла;
	Если НЕ ПустаяСтрока(ТекЗапрос) Тогда
		СписокЗапросов.Добавить(ТекЗапрос, ИмяНовойВТ);
	КонецЕсли;
	
	Возврат СписокЗапросов;
КонецФункции

#КонецОбласти

#КонецОбласти