////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции общего назначения:
// Требования:
// - Минимальная версия платформы 8.3.6, 
// - Тонкий клент
//  
////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////// ОписаниеПеременных

// Интерфейсы

Перем
_Транспорт,
_Json,
_ТестовоеОкружение,
_ТопикПродукта;

///////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////// Интерфейс
  

Процедура Инит(ТопикПродукта = "", 
		Транспорт = Неопределено, 
		Json = Неопределено,
		ТестовоеОкружение = Ложь) Экспорт
	
	Если Транспорт = Неопределено Тогда 
		_Транспорт = ЭтотОбъект;
	Иначе
		_Транспорт = Транспорт;
	КонецЕсли;
	
	Если Json = Неопределено Тогда 
		_Json = ЭтотОбъект;
	Иначе
		_Json = Json;
	КонецЕсли;
	
	_ТестовоеОкружение = ТестовоеОкружение;
	_ТопикПродукта = ТопикПродукта;
	
КонецПроцедуры

// Метод открывает Центр поддержки в браузере
//
// Параметры:
//	ПараметрыСессии - Структура - Контракт из метода "МодельПараметрыСессии"
//
// Возвращаемое значение:
//	- СессияId - Строка
//

Функция ОткрытьЦентрПоддержки(ПараметрыСессии = Неопределено) Экспорт
	
	Ресурс = "";
	
	Попытка
		СессияId = СоздатьСессию(); 
	Исключение
		_ОповеститьПользователя("Ошибка создания сессии", ОписаниеОшибки());
	КонецПопытки; 
	
	Если СессияId <> Неопределено Тогда 
		Попытка
			УстановитьСостояние(СессияId, ПараметрыСессии);
		Исключение
			_ОповеститьПользователя("Ошибка установки параметров Центра поддержки", ОписаниеОшибки());
		КонецПопытки;
		Ресурс = Ресурс + "#" + _ТопикПродукта + "?mpass_session_id=" + СессияId; 
	КонецЕсли;
	
	ЗапуститьПриложение("https://" + _Настройки().Транспорт.ЦП + Ресурс);
	
	Возврат СессияId;
	
КонецФункции

// Передача параметров в Центр поддержки
//
// Параметры:
//	СессияId 		- Строка - id сессия для установки параметров
//	ПараметрыСессии - Структура - Описан в методе "ОткрытьЦентрПоддержки"
//

Процедура УстановитьСостояние(СессияId, ПараметрыСессии) Экспорт
	
	Если ТипЗнч(ПараметрыСессии) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = _HttpЗапросУстановкаСостояния(СессияId, ПараметрыСессии);
	Ответ = _Транспорт.ЦП_ОтправитьЗапрос(Запрос);
	
	Если _НегативноеСостояние(Ответ) Тогда
		ВызватьИсключение "Не удалось установить параметры Центра поддержки, код: " + Ответ.КодСостояния + " " 
			+ _ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело);
	КонецЕсли;
	
КонецПроцедуры

// Описывает модель параметров для передачи в Центр поддержки
//
// Возвращаемое значение:
// - Результат - Структура - Контракт модели

Функция МодельПараметрыСессии() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ДополнительныеПараметры", Новый Соответствие);
	Результат.Вставить("ИНН");
	Результат.Вставить("КПП");
	Результат.Вставить("Организация");
	Результат.Вставить("Логин");
	Результат.Вставить("Телефон");    
	Результат.Вставить("ИмяПользователя");
	Результат.Вставить("Файлы", Новый Массив);
	
	Возврат Результат;
	
КонецФункции


Функция МодельФайла() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяФайла");
	Результат.Вставить("Данные");
	
	Возврат Результат;
	
КонецФункции


Функция РезультатЗапроса() Экспорт
	
	Возврат _РезультатЗапросаКлиентСервер();
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////   

/////////////////////////////////////////////////////////////////////////////// ИнтерфейсКастомизации


Функция ЦП_ОтправитьЗапрос(Запрос) Экспорт

	Возврат _ОтправитьЗапрос(Запрос);
	
КонецФункции


Функция ЦП_ЗаписатьJson(Значение) Экспорт

	Возврат _ЗаписатьJson(Значение);
	
КонецФункции


Функция ЦП_ПрочитатьJson(Значение) Экспорт  

	Возврат _ПрочитатьJson(Значение);
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////// 

/////////////////////////////////////////////////////////////////////////////// ОбработчикиСобытийФормы   


Процедура ПриОткрытии(Отказ)
	Отказ = Истина;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////// Сессия  


Функция СоздатьСессию() Экспорт
	
	Результат = Неопределено;	
	Запрос = _HttpЗапросСессия();
	
	Ответ = _Транспорт.ЦП_ОтправитьЗапрос(Запрос);
	
	Если _НегативноеСостояние(Ответ) Тогда
		ВызватьИсключение "Не удалось создать сессию: " + Ответ.КодСостояния + " "
			+ _ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело);
	КонецЕсли;
	
	Результат = ПолучитьЗначениеПоКлючу(_Json.ЦП_ПрочитатьJson(_ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело)), "id");
	Возврат Результат
	
КонецФункции


Функция _СформироватьПараметрыСессииДляЗапроса(ПараметрыСессии)
	
	Результат = Новый Соответствие;
	
	Для Каждого Элемент Из ПараметрыСессии Цикл
		
		Если НЕ ЗначениеЗаполнено(Элемент.Значение) Тогда
			
			Продолжить;
			
		ИначеЕсли Элемент.Ключ = "ДополнительныеПараметры" Тогда
			
			ПараметрыПродукта = _СформироватьДополнительныеПараметры(Элемент.Значение, _ТопикПродукта);
			_ОбъединитьСтруктуры(Результат, ПараметрыПродукта);
			
		ИначеЕсли Элемент.Ключ = "Файлы" Тогда
			
			Попытка
				Ссылка = _ЗагрузитьФайлыПолучитьСсылку(Элемент.Значение, _ТопикПродукта);
				Результат.Вставить("scope/csi/attachment", Ссылка);
			Исключение
				ЗаписьЖурналаРегистрацииНаСервере(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
			КонецПопытки;
						
		Иначе
			
			Значение = Элемент.Значение;
			Если ТипЗнч(Элемент.Значение) = Тип("Число") Тогда
				
				Значение = СтрЗаменить(Элемент.Значение, Символы.НПП, "");
				
			КонецЕсли;
			
			Результат.Вставить(_ИмяПараметраСервиса(Элемент.Ключ), Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Функция _ИмяПараметраСервиса(Ключ)
	
	Если Ключ = "ИНН" Тогда
		Результат = "base/inn";
	ИначеЕсли Ключ = "КПП" Тогда
		Результат = "base/kpp";
	ИначеЕсли Ключ = "Организация" Тогда
		Результат = "base/orgname";
	ИначеЕсли Ключ = "Логин" Тогда
		Результат = "base/login";
	ИначеЕсли Ключ = "Телефон" Тогда
		Результат = "base/contactPhone";    
	ИначеЕсли Ключ = "ИмяПользователя" Тогда
		Результат = "base/realname";
	Иначе
		Результат = Ключ; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////// СистемнаяИнформация


Функция _ИнитСистемнаяИнформация() 
	
	Результат = Новый Структура;
	СисИнфо = "";
	КонфИнфо = "";
	СистемнаяИнформация = _СистемнаяИнформация();
	
	СвойстваСистемы = Новый Массив;
	СвойстваСистемы.Добавить("client_platform");
	СвойстваСистемы.Добавить("client_type");
	СвойстваСистемы.Добавить("client_version");
	
	СвойстваКонфигурации = Новый Массив;
	СвойстваКонфигурации.Добавить("configuration_version");
	СвойстваКонфигурации.Добавить("configuration_compmode");
	
	Для Каждого Свойство Из СвойстваСистемы Цикл
		Если _СвойствоОпределено(СистемнаяИнформация, Свойство) Тогда
			СисИнфо = СисИнфо + " " + Свойство + ": " + СистемнаяИнформация[Свойство] + ", ";	
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Свойство Из СвойстваКонфигурации Цикл
		Если _СвойствоОпределено(СистемнаяИнформация, Свойство) Тогда
			КонфИнфо = КонфИнфо + " " + Свойство + ": " + СистемнаяИнформация[Свойство] + ", ";	
		КонецЕсли;	
	КонецЦикла;
	
	Результат.Вставить("system_info", СисИнфо);
	Результат.Вставить("conf_info", КонфИнфо);
	Результат.Вставить("configuration_name", СистемнаяИнформация["configuration_name"]);
	
	Возврат Результат;
	
КонецФункции


Функция _СистемнаяИнформация() 
	
	Возврат _ОбъединитьСтруктуры(_СистемнаяИнформацияНаКлиенте(), _СистемнаяИнформацияНаСервере());
	
КонецФункции


Функция _СистемнаяИнформацияНаКлиенте() 
	
	КонтекстДанные = Новый Структура;
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	// Клиент
	
	Информация = Новый Структура;
	Информация.Вставить("client_id"		 , Строка(СистемнаяИнформация.ИдентификаторКлиента));
	Информация.Вставить("client_name"	 , ИмяКомпьютера());
	Информация.Вставить("client_type"	 , _ТипКлиента());
	Информация.Вставить("client_platform", Строка(СистемнаяИнформация.ТипПлатформы));
	Информация.Вставить("client_version" , Строка(СистемнаяИнформация.ВерсияПриложения));
	Информация.Вставить("client_cntmode" , _РежимСоединения());
		
	Возврат Информация; 
	
КонецФункции


Функция _ТипКлиента()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Результат = "ordinary";		
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Тогда
		Результат = "thick";	
	#ИначеЕсли ТонкийКлиент Тогда
		Результат = "thin";
	#ИначеЕсли ВебКлиент Тогда
		Результат = "web";
	#ИначеЕсли МобильныйКлиент ИЛИ МобильноеПриложениеКлиент Тогда
		Результат = "mobClient";	
	#Иначе
		Возврат Неопределено;	
	#КонецЕсли
	
	Если Найти(Строка(СистемнаяИнформация.ТипПлатформы), "64") Тогда
		Результат = Результат + "64";	
	Иначе
		Результат = Результат + "32";	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция _РежимСоединения()
	
	СтрокаСоединения = НРег(СтрокаСоединенияИнформационнойБазы());
	
	Разделитель = Найти(СтрокаСоединения, "=");
	Если Разделитель <> 0 Тогда
		Режим = Лев(СтрокаСоединения, Разделитель - 1);
	Иначе
		Режим = Неопределено;
	КонецЕсли;
	
	Возврат Режим;
	
КонецФункции


Функция _СистемнаяИнформацияНаСервере() 

	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Информация = Новый Структура;
	Информация.Вставить("configuration_version" , Строка(Метаданные.Версия));
	Информация.Вставить("configuration_compmode", Строка(Метаданные.РежимСовместимости));
	Информация.Вставить("configuration_name"	, Строка(Метаданные.Имя));
	Информация.Вставить("configuration_version" , Строка(Метаданные.Версия));	
	Информация.Вставить("configuration_changed" , КонфигурацияИзменена());
	
	Информация.Вставить("server_platform", Строка(СистемнаяИнформация.ТипПлатформы));
	Информация.Вставить("server_name"	 , ИмяКомпьютера());
	
	Информация.Вставить("session_locale", _ТекущийКодЛокализации());
	Информация.Вставить("session_tz"	, ЧасовойПоясСеанса());
	Информация.Вставить("session_id"	, _ИдентификаторСеанса());
	
	Возврат Информация; 
	
КонецФункции


Функция _ТекущийКодЛокализации() 

	КодЛокализации = ТекущийКодЛокализации();
	Если Найти(КодЛокализации, "_") = 0 Тогда
		КодЛокализации = НРег(КодЛокализации) + "_" + ВРег(КодЛокализации);	
	КонецЕсли;
	
	Возврат КодЛокализации; 
	
КонецФункции


Функция _ИдентификаторСеанса() 

	Адрес = НРег(ПоместитьВоВременноеХранилище(Неопределено));	
	Разделитель = НРег("seanceId=");
	Позиция = Найти(Адрес, Разделитель);
	Длина = 36;
	
	Если Разделитель <> 0 Тогда
		Идентификатор = Сред(Адрес, Позиция + СтрДлина(Разделитель), Длина);
	Иначе
		Идентификатор = Неопределено;
	КонецЕсли;
	
	Возврат Идентификатор; 
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////// HTTP


Функция _ОтправитьЗапрос(Запрос) Экспорт
	
	Результат = _РезультатЗапросаКлиентСервер();
	Соединение = _НовыйЗащищенноеСоединение(Запрос.Хост);	
	HttpЗапрос = _НовыйHTTPЗапрос(Запрос);
	
	Ответ = Соединение.ВызватьHTTPМетод(Запрос.Метод, HttpЗапрос);	
	
	Результат.КодСостояния = Ответ.КодСостояния;
	Результат.Тело = Ответ.ПолучитьТелоКакДвоичныеДанные();
	
	Возврат Результат;
	
КонецФункции


Функция _НовыйЗащищенноеСоединение(Сервер)
	
	ЗащищенноеСоединение = Новый("ЗащищенноеСоединениеOpenSSL");
	Таймаут = 30;
	Соединение = Новый HTTPСоединение(Сервер,,,,, Таймаут, ЗащищенноеСоединение);
	
	Возврат Соединение;
	
КонецФункции


Функция _НовыйHTTPЗапрос(Запрос)
	
	Результат = Новый HTTPЗапрос(Запрос.Ресурс, Запрос.Заголовки);
	
	Если ТипЗнч(Запрос.Тело) = Тип("ДвоичныеДанные") Тогда
		Результат.УстановитьТелоИзДвоичныхДанных(Запрос.Тело);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция _Запрос()
	
	Результат = Новый Структура;
	Результат.Вставить("Хост");
	Результат.Вставить("Ресурс");
	Результат.Вставить("Тело");
	Результат.Вставить("Метод");
	Результат.Вставить("Заголовки");
	
	Возврат Результат;
	
КонецФункции


Функция _НегативноеСостояние(HTTPОтвет) Экспорт

	КодПеренаправление = 300;	
	Возврат HTTPОтвет.КодСостояния >= КодПеренаправление;

КонецФункции


Функция _РезультатЗапросаКлиентСервер() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодСостояния");
	Результат.Вставить("Тело");
	
	Возврат Результат;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////// JSON


Функция _ЗаписатьJson(Значение) Экспорт
	
	// BSLLS:Typo-off
	НастройкиСериализации = Вычислить("Новый НастройкиСериализацииJSON");
	НастройкиСериализации.ВариантЗаписиДаты		 = Вычислить("ВариантЗаписиДатыJSON.УниверсальнаяДата");	
	НастройкиСериализации.ФорматСериализацииДаты = Вычислить("ФорматДатыJSON.ISO");
	НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
		
	ЗаписьJSON = Вычислить("Новый ЗаписьJSON");
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Значение, НастройкиСериализации);	
	// BSLLS:Typo-on
	
	Возврат ЗаписьJSON.Закрыть();	
	
КонецФункции


Функция _ПрочитатьJson(Значение) Экспорт
		
	ЧтениеJSON = Вычислить("Новый ЧтениеJSON");
	ЧтениеJSON.УстановитьСтроку(Значение);	
	Результат = Вычислить("ПрочитатьJSON(ЧтениеJSON, Истина)");
	
	Возврат Результат;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////// Настройки


Функция _Настройки()
	
	Настройки = Новый Структура;
	Настройки.Вставить("Транспорт", _НастройкиТранспорта(_ТестовоеОкружение));
	
	Возврат Настройки;
	
КонецФункции


Функция _НастройкиТранспорта(ТестовоеОкружение)
		
	Настройки = Новый Структура;
	Настройки.Вставить("ЦП", _СерверЦп(ТестовоеОкружение));
	Настройки.Вставить("MSPASS", _СерверMSPASS(ТестовоеОкружение));
	
	Возврат Настройки;
	
КонецФункции


Функция _СерверMSPASS(ТестовоеОкружение)
		
	Если ТестовоеОкружение Тогда
		Результат = "api.testkontur.ru";
	Иначе
		Результат = "api.kontur.ru"; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция _СерверЦп(ТестовоеОкружение)
		
	Если ТестовоеОкружение Тогда
		Результат = "konturru-feature-95460-cp-2.ws.testkontur.ru/support";
	Иначе
		Результат = "kontur.ru/support";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////// ЗапросыВСервис


Функция _HttpЗапросСессия()
	 
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("id", Строка(Новый УникальныйИдентификатор));
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/json");
	
	Результат = _Запрос();
	Результат.Хост = _Настройки().Транспорт.MSPASS;
	Результат.Ресурс = "/csi/multipass/v1/sessions";
	Результат.Тело = _ПолучитьДвоичныеДанныеИзСтроки(_Json.ЦП_ЗаписатьJson(ПараметрыЗапроса));
	Результат.Метод = "POST";
	Результат.Заголовки = Заголовки;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	 
КонецФункции
 

Функция _HttpЗапросУстановкаСостояния(СессияId, ПараметрыСессии)
	 
	Ресурс = "/csi/multipass/v1/sessions/{sessionId}/states/{stateType}";
	Ресурс = СтрЗаменить(Ресурс, "{sessionId}", СессияId);
	Ресурс = СтрЗаменить(Ресурс, "{stateType}", "external-params");
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/json");	
	
	ПараметрыСессии.ДополнительныеПараметры = _ОбъединитьСтруктуры(ПараметрыСессии.ДополнительныеПараметры, 
		_ИнитСистемнаяИнформация());
		
	ТелоСтрокой = _Json.ЦП_ЗаписатьJson(_СформироватьПараметрыСессииДляЗапроса(ПараметрыСессии));
	
	Результат = _Запрос();
	Результат.Хост = _Настройки().Транспорт.MSPASS;
	Результат.Ресурс = Ресурс;
	Результат.Тело = _ПолучитьДвоичныеДанныеИзСтроки(ТелоСтрокой);
	Результат.Метод = "PUT";
	Результат.Заголовки = Заголовки;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	 
КонецФункции


Функция _HttpЗапросЗагрузкаФайлов(Файлы, Топик_)
	
	Разделитель = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	ПодготовленныеФайлы = _ПодготовитьФайлы(Файлы);
	
	Ресурс = "/csi/attachments/v1/upload?integrationId={integrationId}";
	Ресурс = СтрЗаменить(Ресурс, "{integrationId}", Топик_);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);	
		
	Запрос = _Запрос();
	Запрос.Хост = _Настройки().Транспорт.MSPASS;
	Запрос.Ресурс = Ресурс;
	Запрос.Тело = ЗакодироватьФайлы(ПодготовленныеФайлы, Разделитель);
	Запрос.Метод = "POST";
	Запрос.Заголовки = Заголовки;
	
	Возврат Новый ФиксированнаяСтруктура(Запрос);
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////// Служебные


Функция _СвойствоОпределено(Структура, Ключ, Приемник = Неопределено, ЗначениеПоУмолчанию = Неопределено)
	
	Перем Значение, Результат;
	
	Результат = Структура.Свойство(Ключ, Значение) И Значение <> Неопределено;
	
	Если Результат Тогда
		Приемник = Значение;
	Иначе
		Приемник = ЗначениеПоУмолчанию;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Процедура _ОповеститьПользователя(Заголовок_, Описание)
	
	Попытка
		Выполнить("ПоказатьОповещениеПользователя(Заголовок_,, Описание,, СтатусОповещенияПользователя.Важное)");
	Исключение
		Выполнить("ПоказатьОповещениеПользователя(Заголовок_,, Описание)");
	КонецПопытки;
	
КонецПроцедуры


Функция _ЗагрузитьФайлыПолучитьСсылку(Файлы, Топик)
	
	Если ТипЗнч(Файлы) <> Тип("Массив") Или Файлы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Неопределено;
	Запрос = _HttpЗапросЗагрузкаФайлов(Файлы, Топик);	
	Ответ = _Транспорт.ЦП_ОтправитьЗапрос(Запрос);
	
	Если  _НегативноеСостояние(Ответ) Тогда
		
		ВызватьИсключение "Ошибка, код: " + Ответ.КодСостояния + " " 
			+ _ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело);
		
	КонецЕсли;
	
	ДанныеОтвета = _Json.ЦП_ПрочитатьJson(_ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело));
	Результат = ПолучитьЗначениеПоКлючу(ДанныеОтвета, "attachmentLink");
	
	Возврат Результат;
	
КонецФункции


Функция _ПодготовитьФайлы(Файлы)
		
	Результат = Новый Массив;
	
	Для Каждого Элемент Из Файлы Цикл
		
		Файл = Новый Структура;
		Файл.Вставить("Имя", "files");
		Файл.Вставить("Данные", Элемент.Данные);
		Файл.Вставить("ИмяФайла", Элемент.ИмяФайла);
		Файл.Вставить("Тип", "multipart/form-data");
		
		Результат.Добавить(Файл);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Функция _ОбъединитьСтруктуры(Структура1 = Неопределено, Структура2 = Неопределено) Экспорт
	
	// BSLLS:Typo-off
	МутабельныеТипы = Новый Массив;
	МутабельныеТипы.Добавить(Тип("Структура"));
	МутабельныеТипы.Добавить(Тип("Соответствие"));
	
	ИммутабельныеТипы = Новый Массив;
	ИммутабельныеТипы.Добавить(Тип("ФиксированнаяСтруктура"));
	ИммутабельныеТипы.Добавить(Тип("ФиксированноеСоответствие"));
	
	Тип1 = МутабельныеТипы.Найти(ТипЗнч(Структура1)) <> Неопределено;
	Тип2 = МутабельныеТипы.Найти(ТипЗнч(Структура2)) <> Неопределено 
		ИЛИ ИммутабельныеТипы.Найти(ТипЗнч(Структура2)) <> Неопределено;
	// BSLLS:Typo-on
	
	Если Не Тип1 И Не Тип2 Тогда
		Результат = Новый Структура;	
	ИначеЕсли Тип1 И НЕ Тип2 Тогда
		Результат = Структура1; 
	ИначеЕсли НЕ Тип1 И Тип2 Тогда
		Результат = Структура2;
	Иначе
		Для Каждого Элемент Из Структура2 Цикл
			Структура1.Вставить(Элемент.Ключ, Элемент.Значение);	
		КонецЦикла;
		Результат = Структура1;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// TODO Совместимость методов работы с ДД с веб-версией


Функция _ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные, Кодировка = "utf-8")
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	ДвоичныеДанные.Записать(ИмяВременногоФайла);	
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяВременногоФайла, Кодировка);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ТекстовыйДокумент.ПолучитьТекст();	
	
КонецФункции


Функция _ПолучитьДвоичныеДанныеИзСтроки(Строка, КодировкаТекста_ = "utf-8", ЗаписатьBOM = Ложь)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	Если ЗаписатьBOM Тогда
		ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста_);	
	Иначе	
		ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста.ANSI);	
	КонецЕсли;
	ЗаписьТекста.Закрыть();
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста_,, Истина, Символы.ПС);
	ЗаписьТекста.Записать(Строка);
	ЗаписьТекста.Закрыть();
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ДвоичныеДанные;
	
КонецФункции


Функция _СоединитьДвоичныеДанные(МассивДвоичныхДанных) Экспорт
	
	// Аналог СоединитьДвоичныеДанные для 8.2
	
	МассивИменДвоичныхДанных = Новый Массив;
	
	Для Каждого Элемент Из МассивДвоичныхДанных Цикл
			
		// BSLLS:MissingTemporaryFileDeletion-off
		// Диагностика не находит удаления		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();	
		// BSLLS:MissingTemporaryFileDeletion-on	
		МассивИменДвоичныхДанных.Добавить(ИмяВременногоФайла);
		
		Элемент.Записать(ИмяВременногоФайла);		
		
	КонецЦикла;
	
	ИмяВременногоФайлаРезультат = ПолучитьИмяВременногоФайла();
	
	ОбъединитьФайлы(МассивИменДвоичныхДанных, ИмяВременногоФайлаРезультат);	
	
	ДвоичныеДанныеСоединенные = Новый ДвоичныеДанные(ИмяВременногоФайлаРезультат);
	
	// Удаление файлов
	
	УдалитьФайлы(ИмяВременногоФайлаРезультат);	
	Для Каждого ИмяВременногоФайла Из МассивИменДвоичныхДанных Цикл
		УдалитьФайлы(ИмяВременногоФайла);	
	КонецЦикла;
	
	Возврат ДвоичныеДанныеСоединенные;
	
КонецФункции


Функция ЗакодироватьФайлы(Файлы, Разделитель)
	
	МассивЧастей = Новый Массив;
	РазделительСтрок = Символы.ВК + Символы.ПС;
	
	Для Каждого Файл Из Файлы Цикл
		
		Часть = СоздатьПолеФормы(Файл);
		
		МассивЧастей.Добавить(_ПолучитьДвоичныеДанныеИзСтроки("--" + Разделитель + РазделительСтрок));
		МассивЧастей.Добавить(_ПолучитьДвоичныеДанныеИзСтроки(ЗаголовкиВСтроку(Часть.Заголовки)));
		МассивЧастей.Добавить(Часть.Данные);
		МассивЧастей.Добавить(_ПолучитьДвоичныеДанныеИзСтроки(РазделительСтрок));
		
	КонецЦикла;
	
	МассивЧастей.Добавить(_ПолучитьДвоичныеДанныеИзСтроки("--" + Разделитель + "--" + РазделительСтрок));	

	Возврат _СоединитьДвоичныеДанные(МассивЧастей);
	
КонецФункции


Функция СоздатьПолеФормы(ИсходныеПараметры)
	
	Поле = Новый Структура("Имя,ИмяФайла,Данные,Тип,Заголовки");
	Поле.Имя = ИсходныеПараметры.Имя;
	Поле.Данные = ИсходныеПараметры.Данные;
	
	Поле.Тип = ПолучитьЗначениеПоКлючу(ИсходныеПараметры, "Тип");
	Поле.Заголовки = ПолучитьЗначениеПоКлючу(ИсходныеПараметры, "Заголовки", Новый Соответствие);
	Поле.ИмяФайла = ПолучитьЗначениеПоКлючу(ИсходныеПараметры, "ИмяФайла");
	
	Ключ = "Content-Disposition";
	Если ПолучитьЗначениеЗаголовка("content-disposition", Поле.Заголовки, Ключ) = Ложь Тогда
		Поле.Заголовки.Вставить("Content-Disposition", "form-data");
	КонецЕсли;
	
	Части = Новый Массив;
	Части.Добавить(Поле.Заголовки[Ключ]);
	Части.Добавить(СтрЗаменить("name=""%1""", "%1", Поле.Имя));
	Если ЗначениеЗаполнено(Поле.ИмяФайла) Тогда
		Части.Добавить(СтрЗаменить("filename=""%1""", "%1", Поле.ИмяФайла));
	КонецЕсли;
	
	Поле.Заголовки[Ключ] = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(Части, "; ");
	Поле.Заголовки["Content-Type"] = Поле.Тип;
	
	Возврат Поле;
	
КонецФункции


Функция ПолучитьЗначениеПоКлючу(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство(Ключ) Тогда
		Значение = Структура[Ключ];
	ИначеЕсли ТипЗнч(Структура) = Тип("Соответствие") И Структура.Получить(Ключ) <> Неопределено Тогда
		Значение = Структура.Получить(Ключ);
	Иначе
		Значение = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции


Функция ПолучитьЗначениеЗаголовка(Заголовок_, ВсеЗаголовки, Ключ = Неопределено)
	
	Для Каждого ОчереднойЗаголовок Из ВсеЗаголовки Цикл
		Если НРег(ОчереднойЗаголовок.Ключ) = НРег(Заголовок_) Тогда
			Ключ = ОчереднойЗаголовок.Ключ;
			Возврат ОчереднойЗаголовок.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции


Функция ЗаголовкиВСтроку(Заголовки)
	
	РазделительСтрок = Символы.ВК + Символы.ПС;
	Строки = Новый Массив;
	
	СортированныеЗаголовки = "Content-Disposition,Content-Type,Content-Location";
	Для Каждого Ключ Из КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(СортированныеЗаголовки, ",") Цикл
		Значение = ПолучитьЗначениеЗаголовка(Ключ, Заголовки);
		Если Значение <> Ложь И ЗначениеЗаполнено(Значение) Тогда
			Строки.Добавить(Ключ + ": " + Значение);
		КонецЕсли;
	КонецЦикла;
	
	Ключи = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(ВРег(СортированныеЗаголовки), ",");
	Для Каждого Заголовок_ Из Заголовки Цикл
		Если Ключи.Найти(ВРег(Заголовок_.Ключ)) = Неопределено Тогда
			Строки.Добавить(Заголовок_.Ключ + ": " + Заголовок_.Значение);
		КонецЕсли;
	КонецЦикла;
	Строки.Добавить(РазделительСтрок);
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(Строки, РазделительСтрок);
	
КонецФункции


Функция _СформироватьДополнительныеПараметры(ДополнительныеПараметры, Топик)
	
	Результат = Новый Соответствие;
	Для Каждого Элемент Из ДополнительныеПараметры Цикл
		Результат.Вставить("scope/" + Топик + "/" + Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Процедура ЗаписьЖурналаРегистрацииНаСервере(ПодробноеПредставлениеОшибки)
	
	ЗаписьЖурналаРегистрации("ЦентрПоддержки", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////