
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма = ПараметрыВыполненияКоманды.Источник;
	
	ЛогистическаяСущность = ПараметрКоманды;
	
	ТекДанные = Форма.Элементы.СвязанныеОбъекты.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		УИД = "";
		ТипЗначенияУИД = "";
	Иначе
		УИД = ТекДанные.УИД;
		ТипЗначенияУИД = ТекДанные.ТипЗначенияУИД;
	КонецЕсли;
	
	УчетнаяСущность = Неопределено;
	НастройкиКонвертации = ОбработкаКомандыНаСервере(ЛогистическаяСущность, УИД, ТипЗначенияУИД, УчетнаяСущность);	
	
	Если НастройкиКонвертации.Количество() > 1 Тогда 
					
		СпНастройкиКонвертации = Новый СписокЗначений;
		Для каждого Настройка Из НастройкиКонвертации Цикл
			СпНастройкиКонвертации.Добавить(Настройка, ПредставлениеНастройкиКонвертации(Настройка));			
		КонецЦикла;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ЛогистическаяСущность", ЛогистическаяСущность);
		ДополнительныеПараметры.Вставить("УчетнаяСущность", УчетнаяСущность);
		
		ОписаниеОповещения = КонтурЛогистика_СтдОбщегоНазначенияКлиент.ОписаниеОповещения("ОбработчикВыбораНастройкиКонвертации", ЭтотОбъект, ДополнительныеПараметры);
		КонтурЛогистика_СтдДиалогиКлиент.ПоказатьВыборЭлементаСпискаЗначений(СпНастройкиКонвертации, ОписаниеОповещения, "Выберите настройку конвертации");
		
	КонецЕсли;
	
	Форма.Прочитать();
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеНастройкиКонвертации(Настройка)
	 
	Представление = ?(ЗначениеЗаполнено(Настройка.РеквизитТитула), "(" + Настройка.РеквизитТитула + ") ", "") + Настройка.Наименование;
	
	Возврат Представление;
	
Конецфункции

&НаСервере
Функция ОбработкаКомандыНаСервере(ЛогистическаяСущность, УИД, ТипЗначенияУИД, УчетнаяСущность)
	
	НастройкиКонвертации = Новый Массив;
	
	СвязанныеОбъекты = ЛогистическаяСущность.СвязанныеОбъекты;
	
	Если СвязанныеОбъекты.Количество() = 1 Тогда 
		
		УчетнаяСущность = СвязанныеОбъекты[0].СвязанныйОбъект;
		
		Если ЗначениеЗаполнено(УИД) И ЗначениеЗаполнено(ТипЗначенияУИД) Тогда
			УчетнаяСущность = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьСсылкуПоУИД(УИД, ТипЗначенияУИД);
		КонецЕсли;
		
		Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоТипСсылка(ТипЗнч(УчетнаяСущность)) Или ТипЗнч(УчетнаяСущность) = Тип("Строка") Тогда 
			
			НастройкиКонвертации = ПолучитьНастройкуКонвертации(ЛогистическаяСущность, УчетнаяСущность);
						
			Если НастройкиКонвертации.Количество() = 0 Тогда 
				
				Сообщить("" + ЛогистическаяСущность + " не обновлен из связного объекта. Не найдена настройка конвертации с включеным флагом ""Обновлять реквизиты из учетной системы"".");
				
			ИначеЕсли НастройкиКонвертации.Количество() = 1 Тогда
				
				НастройкаКонвертации = НастройкиКонвертации[0];
				Синхронизировать(НастройкаКонвертации, ЛогистическаяСущность, УчетнаяСущность);
				
			Иначе
				
				Возврат НастройкиКонвертации;
				
			КонецЕсли;	
	
		Иначе
			
			Сообщить("Связный объект не ссылка и не строка. Обновление запрещено.");
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат НастройкиКонвертации;
	
КонецФункции	

&НаКлиенте
Процедура ОбработчикВыбораНастройкиКонвертации(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Синхронизировать(ВыбранноеЗначение.Значение, ДополнительныеПараметры.ЛогистическаяСущность, ДополнительныеПараметры.УчетнаяСущность);
	
КонецПроцедуры

&НаСервере
Процедура Синхронизировать(НастройкаКонвертации, ЛогистическаяСущность, УчетнаяСущность)
	
	РезультатСинхронизации = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_СинхронизироватьРеквизитыУчетнойИЛогистическойСущностей(УчетнаяСущность, ЛогистическаяСущность, НастройкаКонвертации);	
				
	Если РезультатСинхронизации.Успешно Тогда					
		Сообщить("" + ЛогистическаяСущность + " обновлен из связного объекта.");					
	Иначе					
		Сообщить("" + ЛогистическаяСущность + " не обновлен из связного объекта.");					
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкуКонвертации(ЛогистическаяСущность, УчетнаяСущность)
	
	Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоТипСсылка(ТипЗнч(УчетнаяСущность)) Тогда
		ТипСправочникаИлиДокументаУС 	= УчетнаяСущность.Метаданные().Имя;
	Иначе
		ТипСправочникаИлиДокументаУС 	= Строка(ТипЗнч(УчетнаяСущность));
	КонецЕсли;
	
	ТипСправочникаЛогистика 		= ЛогистическаяСущность.Метаданные().Имя;	
	РеквизитТитула                 	= Перечисления.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников.ПустаяСсылка();
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ПолучитьНастройкиКонвертацииСОбновлениемРеквизитов(ТипСправочникаИлиДокументаУС, 
				ТипСправочникаЛогистика);		
	
КонецФункции	
			
			