#Область ПрограммныйИнтерфейс

// Инициализирует структуру для уточнения данных по ТН ВЭД и ОКПД2.
//
// Возвращаемое значение:
//  Структура из КлючИЗначение:
//   * ТНВЭД        - Строка - код ТН ВЭД,
//   * ГруппаТНВЭД  - Строка - код группы ТН ВЭД,
//   * ОКПД2        - Строка - код ОКПД2,
//   * ГруппаОКПД2  - Строка - код группы ОКПД2.
Функция ДанныеДляУточненияВидовПродукцииПоТНВЭДиОКПД2() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ТНВЭД",        "");
	Результат.Вставить("ГруппаТНВЭД",  "");
	Результат.Вставить("ОКПД2",        "");
	Результат.Вставить("ГруппаОКПД2",  "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Имя подсистемы.
// 
// Возвращаемое значение:
//  Строка - Имя подсистемы
Функция ИмяПодсистемы() Экспорт
	
	Возврат "ИСМП";
	
КонецФункции

Функция ЭтоРасширеннаяВерсияГосИС() Экспорт
	
	Возврат ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС();
	
КонецФункции

Функция ДатаНачалаКонтроляКодовМаркировкиМОТП() Экспорт
	
	Возврат '20200701';
	
КонецФункции

// Проверка, подлежит ли продукция обязательной онлайн-проверке перед розничной продажей, по параметрам сканирования.
// 
// Параметры:
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования
// 
// Возвращаемое значение:
//  Булево - Продукция подлежит обязательной онлайн проверке перед розничной продажей
Функция ИспользуетсяОнлайнПроверкаПередРозничнойПродажей(ПараметрыСканирования) Экспорт
	
	Если Не ПараметрыСканирования.ТребуетсяПроверкаСредствамиККТ
		И Не ПараметрыСканирования.ЭтоОблачнаяККТИСМП Тогда
		Возврат Ложь;
	КонецЕсли;
	ВидОперации = ПараметрыСканирования.ВидОперацииИСМП;
	Если ЗначениеЗаполнено(ВидОперации)
		И ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа") Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Каждого ВидПродукции Из ПараметрыСканирования.ДопустимыеВидыПродукции Цикл
		Если ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ПродукцияПодлежитОбязательнойОнлайнПроверкеПередРозничнойПродажей(
			ВидПродукции, ВидОперации) Тогда
				Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Инициализировать структуру параметров запроса в ИС МОТП (ИС МП) для получения ключа сессии.
// 
// Параметры:
// 	Организация - ОпределяемыйТип.Организация, Неопределено - Организация.
// Возвращаемое значение:
// 	См. ИнтерфейсАвторизацииИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии
//
Функция ПараметрыЗапросаКлючаСессии(Организация = Неопределено) Экспорт
	
	Возврат ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация);
	
КонецФункции

// Возвращает параметры для отправки HTTP запросов МОТП.
// 
// Параметры:
// 	Поддомен - Строка - Имя поддомена
// 	ИспользоватьTrueAPI - Булево - Использовать true-api
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * ИспользоватьЗащищенноеСоединение - Булево - Признак использования SSL.
// * Таймаут - Число - Таймаут соединения.
// * Порт - Число - Порт соединения.
// * Сервер - Строка - Адрес сервера.
// * ПредставлениеСервиса - Строка - Представления сервиса.
//
Функция ПараметрыОтправкиHTTPЗапросов(Поддомен = "api", ИспользоватьTrueAPI = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(Поддомен) Тогда
		АдресСервера = СтрШаблон("%1.%2", Поддомен, АдресСервера(ИспользоватьTrueAPI));
	Иначе
		АдресСервера = АдресСервера(ИспользоватьTrueAPI);
	КонецЕсли;
	
	ПараметрыОтправкиHTTPЗапросов = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов.Вставить("Сервер",                           АдресСервера);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Порт",                             443);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Таймаут",                          60);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ИспользоватьЗащищенноеСоединение", Истина);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ПредставлениеСервиса",             НСтр("ru = 'ГИС МТ'"));
	
	Возврат ПараметрыОтправкиHTTPЗапросов;
	
КонецФункции

// Конструктор параметров подключения локального модуля ЧЗ - адрес подключения, данные авторизации
// 
// Возвращаемое значение:
//  Структура - Параметры подключения локального модуля ЧЗ:
// * Сервер - Строка - адрес сервера
// * ЗащищенноеСоединение - Булево - Истина, если используется протокол https://, и Ложь, если http://
// * Порт - Число - порт службы отправки запросов. По умолчанию 5995
// * Логин - Строка - логин администратора, заданный при установке
// * Пароль - Строка - пароль администратора, заданный при установке
// * ФорматОбмена - ПеречислениеСсылка.ВерсииФорматаОбменаЛокальногоМодуляИСМП - формат обмена с ЛМ ЧЗ
Функция ПараметрыПодключенияЛокальногоМодуляЧЗ() Экспорт
	
	ПараметрыУстановки = Новый Структура();
	ПараметрыУстановки.Вставить("Сервер",               "");
	ПараметрыУстановки.Вставить("ЗащищенноеСоединение", Ложь);
	ПараметрыУстановки.Вставить("Порт",                 5995);
	ПараметрыУстановки.Вставить("Логин",                "");
	ПараметрыУстановки.Вставить("Пароль",               "");
	ПараметрыУстановки.Вставить("ФорматОбмена",         ПредопределенноеЗначение("Перечисление.ВерсииФорматаОбменаЛокальногоМодуляИСМП.ПустаяСсылка"));
	
	Возврат ПараметрыУстановки;
	
КонецФункции

// Конструктор параметров подключения ТС ПИоТ - адрес подключения
// 
// Возвращаемое значение:
//  Структура - Параметры подключения ТС ПИоТ:
// * ПодключаемоеОборудование - Неопределено, СправочникСсылка.ПодключаемоеОборудование - ссылка на ККТ
// * ВнутреннийТСПИоТ - Булево - Истина, если используется настройка подключения к внутреннему ТС ПИоТ 1С
// * ТСПИоТ - Неопределено, СправочникСсылка.ТСПИоТ - ссылка на ТС ПИоТ
// * Сервер - Строка - адрес сервера
// * ЗащищенноеСоединение - Булево - Истина, если используется протокол https://, и Ложь, если http://
// * Порт - Число - порт службы отправки запросов. По умолчанию 443
// * АдресПодключения - Строка - адрес подключения
// * ОбменНаСервере - Булево - Истина, если настроен обмен на сервере
// * ИсключитьПроверкуКорневыхСертификатов - Булево - Истина, если необходимо исключить проверку корневых сертификатов. 
//		Исключение требуется только для отладочных работ на тестовых стендах.
Функция ПараметрыПодключенияТСПИоТ() Экспорт
	
	ПараметрыПодключения = Новый Структура();
	ПараметрыПодключения.Вставить("ПодключаемоеОборудование",              Неопределено);
	ПараметрыПодключения.Вставить("ТСПИоТ",                                Неопределено);
	ПараметрыПодключения.Вставить("ВнутреннийТСПИоТ",                      Ложь);
	ПараметрыПодключения.Вставить("Сервер",                                "");
	ПараметрыПодключения.Вставить("ЗащищенноеСоединение",                  Истина);
	ПараметрыПодключения.Вставить("Порт",                                  443);
	ПараметрыПодключения.Вставить("ОбменНаСервере",                        Ложь);
	ПараметрыПодключения.Вставить("АдресПодключения",                      "");
	ПараметрыПодключения.Вставить("ИсключитьПроверкуКорневыхСертификатов", Ложь);
	
	Возврат ПараметрыПодключения;
	
КонецФункции

// Возвращает адрес сервера ИС МОТП.
// 
// Параметры:
// 	ИспользоватьTrueAPI - Булево - Использовать true-api
// Возвращаемое значение:
// 	Строка - адрес сервера ИС МОТП.
//
Функция АдресСервера(ИспользоватьTrueAPI = Ложь) Экспорт
	
	РежимРаботыСТестовымКонтуромИСМП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.РежимРаботыСТестовымКонтуромИСМП();
	
	Если РежимРаботыСТестовымКонтуромИСМП Тогда
		Возврат "markirovka.sandbox.crptech.ru";
	Иначе
		Возврат "markirovka.crpt.ru";
	КонецЕсли;
	
КонецФункции

Функция ИменаПараметровРаботыКлиента() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить(
		"ВерсияБПОПоддерживаетПроверкуКМЕдинымМетодом",
		"ИнтеграцияИСМП_ВерсияБПОПоддерживаетПроверкуКМСредствамиККТЕдинымМетодом");
	ВозвращаемоеЗначение.Вставить(
		"ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ",
		"ИнтеграцияИСМП_ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ");
	ВозвращаемоеЗначение.Вставить(
		"ПараметрыЛогированияЗапросов",
		"ИнтеграцияИСМП_ПараметрыЛогированияЗапросовНаКлиенте");
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Структура дат раздельного контроля по виду маркируемой продукции
// 
// Возвращаемое значение:
//  Структура:
// * ВидПродукции - СправочникСсылка.ВидыПродукцииИС - вид маркируемой продукции
// * ДатаКонтрольПроизводства - Дата - Обязательность нанесения кода маркировки 
// 		на потребительскую упаковку и подачи в систему маркировки сведения 
// 		о вводе в оборот
// * ДатаКонтрольВыводИзОборота - Дата - Обязательность передачи сведений 
// 		в систему цифровой маркировки о выводе из оборота по прочим причинам 
// 		(не являющимся продажей в розницу)
// * ДатаРозницаУведомительныйРежим - Дата - Уведомительный режим - обязательность 
// 		сканирования кодов на кассе при продаже маркированной продукции 
// 		и передачи сведений о продажах в систему маркировки с использованием онлайн-касс
// * ДатаРозницаРазрешительныйРежим - Дата - Разрешительный режим - обязательность 
// 		онлайн проверки кодов маркировки при розничной продаже
// * ДатаРозницаЛокальныйРазрешительныйРежим - Дата - Локальный разрешительный режим
// 		с применением ЛМ ЧЗ - обязательность локальной проверки кодов маркировки
// 		при розничной продаже
// * ДатаОптКонтрольПоштучно - Дата - Обязательность передачи сведений об обороте 
// 		маркированных товаров в поэкземплярном учете
// * ДатаОптКонтрольОСУ - Дата - Обязательность передачи сведений об обороте 
// 		маркированных товаров (возможно применение объемно-сортового учета)
// * ДатаЗапретПродажиНемаркированныхОстатков - Дата - Запрет на оборот немаркированных остатков товаров
// * ДатаПрослеживаемостьПеремещенияМеждуМОД - Дата - Обязательность прослеживаемости перемещения между
// 		местами осуществления деятельности
// * ДатаКонтроляРазрешительныхДокументов - Дата - Контроль разрешительных документов при обороте маркируемой продукции.
Функция ИнициализироватьНастройкуДатРаздельногоКонтроля() Экспорт
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ВидПродукции",                             ПредопределенноеЗначение("Справочник.ВидыПродукцииИС.ПустаяСсылка"));
	СтруктураВозврата.Вставить("ДатаКонтрольПроизводства",                 Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаКонтрольВыводИзОборота",               Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаРозницаУведомительныйРежим",           Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаРозницаРазрешительныйРежим",           Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаРозницаЛокальныйРазрешительныйРежим",  Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаОптКонтрольПоштучно",                  Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаОптКонтрольОСУ",                       Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаЗапретПродажиНемаркированныхОстатков", Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаПрослеживаемостьПеремещенияМеждуМОД",  Дата(1, 1, 1));
	СтруктураВозврата.Вставить("ДатаКонтроляРазрешительныхДокументов",     Дата(1, 1, 1));
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Возвращает значение параметра ЗапрашиватьДанныеСервисаИСМП. Если оно установлено как ПоУмолчанию, то Истина
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ОтключитьПоВидуПродукцииВидуОперации - Булево - признак необходимости исключения запросов по настройкам исключений контролей
//  ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП - Неопределено, Булево -
// Возвращаемое значение:
//  Булево - значение ЗапрашиватьДанныеСервисаИСМП
Функция ЗначениеПараметраСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, ОтключитьПоВидуПродукцииВидуОперации = Ложь, ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП = Неопределено) Экспорт
	
	Значение = Ложь;
	
	Если ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП = Неопределено Тогда
		ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
			ПараметрыСканирования, "ЗапрашиватьДанныеСервисаИСМП");
	КонецЕсли;
	Если Не ЕстьСвойствоПараметраСканированияЗапрашиватьДанныеСервисаИСМП Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП) = Тип("Строка") Тогда
		
		Если ВРег(ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП) = "ПОУМОЛЧАНИЮ" Тогда
			Значение = Не ОтключитьПоВидуПродукцииВидуОперации;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП) = Тип("Булево") Тогда
		
		Значение = ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Устанавливает значение параметра ЗапрашиватьДанныеСервисаИСМП. 
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  Значение - Булево, Строка - если устанавливается строка "ПоУмолчанию", то значение берется в соответствие с ФО ЗапрашиватьДанныеСервисаИСМП
//    если требуется поведение, отличное от ФО, то оно устанавливается напрямую значением типа Булево
Процедура УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Значение = "ПоУмолчанию") Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыСканирования, "ЗапрашиватьДанныеСервисаИСМП") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП = Значение;
	
КонецПроцедуры

// Возвращает значение параметра ЗапрашиватьДанныеНеизвестныхУпаковокИСМП. Если оно установлено как ПоУмолчанию, то значение берется из
//  ФО ЗапрашиватьДанныеСервисаИСМП
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ОтключитьПоВидуПродукцииВидуОперации - Булево - признак необходимости исключения запросов по настройкам исключений контролей
// 
// Возвращаемое значение:
//  Булево - значение ЗапрашиватьДанныеНеизвестныхУпаковокИСМП
Функция ЗначениеПараметраСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, ОтключитьПоВидуПродукцииВидуОперации = Ложь) Экспорт
	
	Значение = Ложь;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыСканирования, "ЗапрашиватьДанныеНеизвестныхУпаковокИСМП") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП) = Тип("Строка") Тогда
		
		Если ВРег(ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП) = "ПОУМОЛЧАНИЮ" Тогда
			Значение = Не ОтключитьПоВидуПродукцииВидуОперации;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП) = Тип("Булево") Тогда
		
		Значение = ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Устанавливает значение параметра ЗапрашиватьДанныеНеизвестныхУпаковокИСМП. 
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  Значение - Булево, Строка - если устанавливается строка "ПоУмолчанию", то значение берется в соответствие с ФО ЗапрашиватьДанныеСервисаИСМП
//    если требуется поведение, отличное от ФО, то оно устанавливается напрямую значением типа Булево
Процедура УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, Значение = "ПоУмолчанию") Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыСканирования, "ЗапрашиватьДанныеНеизвестныхУпаковокИСМП") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП = Значение;
	
КонецПроцедуры

Процедура УстновитьОтборПоОрганизацииИПустомуЗначению(Форма) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Форма.Список, "Организация");
	ПредставлениеГруппы = "Отбор с пустой организацией";
	Отбор = Форма.Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	ГруппаОтборов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Отбор,, ПредставлениеГруппы);
	Если ГруппаОтборов.Количество() Тогда
		ГруппаОтборов = ГруппаОтборов[0];
	Иначе
		ГруппаОтборов = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			Отбор, ПредставлениеГруппы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	КонецЕсли;
	Если Форма.Организации.Количество() Тогда
		ГруппаОтборов.Использование = Истина;
		ГруппаОтборов.Элементы.Очистить();
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтборов,
			"Организация",
			ВидСравненияКомпоновкиДанных.ВСписке,
			Форма.Организации);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтборов,
			"Организация",
			ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Иначе
		ГруппаОтборов.Использование = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#Область РазрешительныйРежим

// Представление статуса Локального модуля "Честный знак" по данным системы
// 
// Параметры:
//  СтатусСистемы - Строка - статус, полученный из ЛМ ЧЗ по 
// 
// Возвращаемое значение:
//  Строка - читаемое представление статуса
Функция СтатусЛокальногоМодуляЧестныйЗнак(СтатусСистемы) Экспорт
	
	ПредставлениеСтатуса = "";
	
	Если ВРег(СтатусСистемы) = СтатусЛокальногоМодуляЧестныйЗнакНеНастроено() Тогда
		ПредставлениеСтатуса = "не настроено";
	ИначеЕсли ВРег(СтатусСистемы) = СтатусЛокальногоМодуляЧестныйЗнакИнициализация() Тогда
		ПредставлениеСтатуса = "инициализация";
	ИначеЕсли ВРег(СтатусСистемы) = СтатусЛокальногоМодуляЧестныйЗнакГотово() Тогда
		ПредставлениеСтатуса = "готово к использованию";
	ИначеЕсли ВРег(СтатусСистемы) = СтатусЛокальногоМодуляЧестныйЗнакОшибкиСинхронизации() Тогда
		ПредставлениеСтатуса = "ошибка синхронизации";
	ИначеЕсли Не ЗначениеЗаполнено(СтатусСистемы) Тогда
		ПредставлениеСтатуса = "неопределено";
	Иначе
		ПредставлениеСтатуса = СтатусСистемы;
	КонецЕсли;
	
	Возврат ПредставлениеСтатуса;
	
КонецФункции

// Статус локального модуля честный знак: Ошибка синхронизации.
// 
// Возвращаемое значение:
//  Строка - Статус локального модуля честный знак ошибки синхронизации
Функция СтатусЛокальногоМодуляЧестныйЗнакОшибкиСинхронизации() Экспорт
	Возврат "SYNC_ERROR";
КонецФункции

// Статус локального модуля честный знак: Не настроено.
// 
// Возвращаемое значение:
//  Строка - Статус локального модуля честный знак ошибки синхронизации
Функция СтатусЛокальногоМодуляЧестныйЗнакНеНастроено() Экспорт
	Возврат "NOT_CONFIGURED";
КонецФункции

// Статус локального модуля честный знак: Инициализация.
// 
// Возвращаемое значение:
//  Строка - Статус локального модуля честный знак ошибки синхронизации
Функция СтатусЛокальногоМодуляЧестныйЗнакИнициализация() Экспорт
	Возврат "INITIALIZATION";
КонецФункции

// Статус локального модуля честный знак: Готово к использованию.
// 
// Возвращаемое значение:
//  Строка - Статус локального модуля честный знак ошибки синхронизации
Функция СтатусЛокальногоМодуляЧестныйЗнакГотово() Экспорт
	Возврат "READY";
КонецФункции

#КонецОбласти

#КонецОбласти