
&ИзменениеИКонтроль("ДобавитьПРО_Документ_ЗаказПоставщику")
Процедура АУ_ДобавитьПРО_Документ_ЗаказПоставщику(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();

	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ЗаказПоставщику";

	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ЗаказПоставщику";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;

	УстановитьОтборы(НовоеПравило, 
	ОтборПоСвойствамПланаОбмена_16(),
	#Удаление
	ОтборПоСвойствамОбъекта_4());
	#КонецУдаления
	#Вставка
	"");
	#КонецВставки
КонецПроцедуры
