#Область КД_2_0
//правила - двоичные данные
Функция ВыгрузитьДанныеПоПравиламОбмена20(Узел, Правила) Экспорт
	
	//Текст=Новый ТекстовыйДокумент;
	//Текст.ДобавитьСтроку(Правила);
	ВремФайлПравила = ПолучитьИмяВременногоФайла("xml");
	Правила.Записать(ВремФайлПравила);
	//Текст.Записать(ВремФайлПравила);
	
	ВремФайлДанных = ПолучитьИмяВременногоФайла("xml");
	
	Обработка=Обработки.УниверсальныйОбменДаннымиXML.Создать();
    Обработка.РежимОбмена="Выгрузка";
    Обработка.ИмяФайлаПравилОбмена = ВремФайлПравила;
    Обработка.ЗагружатьДанныеВРежимеОбмена = Истина;
    Обработка.ЗаписыватьРегистрыНаборамиЗаписей = Истина;
    Обработка.ЗапоминатьЗагруженныеОбъекты = Истина;
    Обработка.ИспользоватьОтборПоДатеДляВсехОбъектов = Ложь;
    Обработка.ВыгружатьТолькоРазрешенные = Истина;
    Обработка.ИмяФайлаОбмена = ВремФайлДанных;
    
    Обработка.ЗагрузитьПравилаОбмена();
	
	Если НЕ Узел.НеИспользоватьПланОбмена Тогда
		Обработка.ТипУдаленияРегистрацииИзмененийДляУзловОбменаПослеВыгрузки = 1; // 0 - не снимать регистрацию, 1 - снимать регистрацию
		УстановитьУзелОбменаУСтрокДерева(Обработка.ТаблицаПравилВыгрузки.Строки, Узел);
	Иначе
		Обработка.ТипУдаленияРегистрацииИзмененийДляУзловОбменаПослеВыгрузки = 0; // 0 - не снимать регистрацию, 1 - снимать регистрацию
	КонецЕсли;
	
    Обработка.ВыполнитьВыгрузку();
	
	Текст=Новый ТекстовыйДокумент;
	Текст.Прочитать(ВремФайлДанных);
	
	УдалитьФайлы(ВремФайлПравила);
	УдалитьФайлы(ВремФайлДанных);
	
	Если Узел.ВыгружатьСообщенияБезДанных ИЛИ Обработка.мСчетчикВыгруженныхОбъектов > 0 Тогда
		Возврат Текст.ПолучитьТекст();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗагрузитьДанныеПоПравиламОбмена20(Данные) Экспорт
	
	Текст=Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(Данные);
	ВремФайлДанных = ПолучитьИмяВременногоФайла("xml");
	Текст.Записать(ВремФайлДанных);
	
	ОбработкаОбмена = Обработки.УниверсальныйОбменДаннымиXML.Создать();
    ОбработкаОбмена.ИмяФайлаОбмена = ВремФайлДанных;
    ОбработкаОбмена.РежимОбмена = "Загрузка";
    ОбработкаОбмена.ОткрытьФайлЗагрузки(Истина);
    ОбработкаОбмена.АрхивироватьФайл = Ложь;
	ОбработкаОбмена.ЗагружатьДанныеВРежимеОбмена=Истина;
	ОбработкаОбмена.ЗаписыватьРегистрыНаборамиЗаписей=Истина;
    ОбработкаОбмена.ВыполнитьЗагрузку();
    ОбработкаОбмена = Неопределено;
	
	УдалитьФайлы(ВремФайлДанных);
	
КонецПроцедуры

Процедура УстановитьУзелОбменаУСтрокДерева(Дерево, УзелОбмена)
	
	Для Каждого Строка Из Дерево Цикл
		Если Строка.ЭтоГруппа Тогда
			УстановитьУзелОбменаУСтрокДерева(Строка.Строки, УзелОбмена);
		Иначе
			Строка.СсылкаНаУзелОбмена = УзелОбмена;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область КД_3_1

Процедура ЗагрузитьДанныеКД3(Данные) Экспорт
	
	Обработка = Обработки.ВыгрузкаЗагрузкаEnterpriseData.Создать();
	Обработка.ЗагрузкаСообщения(Новый Структура("ТекстXML", Данные), Неопределено);
	
	Обработка = Неопределено;
	
КонецПроцедуры

Функция ВыгрузитьДанныеКД3(МассивДанных) Экспорт
	
	Обработка = Обработки.ВыгрузкаЗагрузкаEnterpriseData.Создать();
	Для каждого стрОбъект Из МассивДанных Цикл
		Обработка.СписокДополнениеКВыгрузке.Добавить(стрОбъект);
	КонецЦикла;
	
	АдресДанных = Обработка.РезультатВыгрузкиВXML(Новый Структура("МестоВыгрузки,ЭтоФоновоеЗадание", 1, Ложь));
	
	Обработка = Неопределено;
	
	Возврат ПолучитьИзВременногоХранилища(АдресДанных);
	
КонецФункции

#КонецОбласти