#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаКлиенте
Перем ДатыНачалаРаботыСМаркируемойПродукцией;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоРасширеннаяВерсияГосИС = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС();
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.РежимОткрытия = "ТоварныеГруппы" Тогда
		УпрощеннаяИнтеграцияБЭД = Истина;
	ИначеЕсли ЭтоРасширеннаяВерсияГосИС Тогда
		МодульИнтеграцияИС = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИС");
		УпрощеннаяИнтеграцияБЭД = МодульИнтеграцияИС.УпрощеннаяИнтеграцияБЭД();
	КонецЕсли;
	
	ЦветГиперссылки = ЦветаСтиля.ЦветГиперссылкиГосИС;
	
	ЗаполнитьМаркируемуюПродукцию();
	
	Если ЭтоРасширеннаяВерсияГосИС Тогда
		МодульПанельАдминистрированияИСМП = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ПанельАдминистрированияИСМП");
		МодульПанельАдминистрированияИСМП.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	
	ПараметрыАварийногоРежима = ПолучитьПараметрыАварийногоРежима();
	
	СодержимоеКонстанты = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.НастройкиСканированияКодовМаркировки();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СодержимоеКонстанты);
	
	СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницу.ЗагрузитьЗначения(
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииОбязательнойОнлайнПроверкиПередРозничнойПродажей());
	
	УстановитьСоответствиеИспользованияРегламентныхЗаданийКонстантам();
	НастроитьЭлементыФормыНаСервере();
	// Обновление состояния элементов
	НастроитьФормуПриИзменииЭлементовУправления();
	УстановитьДоступность();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПредставлениеАварийногоРежима();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьИнтерфейсПрограммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИСМП_СинхронизированыТоварныеГруппы" Тогда
		ЗаполнитьМаркируемуюПродукцию();
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЕдиницаИзмеренияКилограммИСПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияЛитрИСПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтоматическуюОтправкуПолучениеДанныхИСМППриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьФоновуюПроверкуДокументовГИСМТПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтоматическуюПроверкуГИСМТПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалятьКодыМаркировкиИзПулаПриИзменении(Элемент)
	
	Если НЕ УдалятьКодыМаркировкиИзПула Тогда
		НаборКонстант.СрокХраненияИспользованныхКодовМаркировки = 0;
	КонецЕсли;
	
	Подключаемый_ПриИзмененииРеквизита(Элементы.СрокХраненияИспользованныхКодовМаркировки, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СрокХраненияИспользованныхКодовМаркировкиПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтоматическоеУдалениеНеиспользованныхКодовМаркировкиПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТокенФорматаUUIDИСМППриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыСТестовымКонтуромИСМППриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАварийногоРежимаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработкаНавигационнойСсылкиАварийногоРежима(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьАварийныйРежимНажатие(Элемент)
	
	ПослеЗакрытияФормы   = Новый ОписаниеОповещения("ПослеОбработкиФормыУточненияАварийногоРежима", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.АварийныйРежимИСМП", 
		Новый Структура("АварийныйРежимВключен, АварийныйРежимДо", ПараметрыАварийногоРежима.Включено, МестноеВремя(ПараметрыАварийногоРежима.ДатаОкончания)),
		,,,,
		ПослеЗакрытияФормы,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьСтатусыКодовМаркировкиПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьВладельцевКодовМаркировкиПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодбиратьКодыМаркировкиВскрытыхПотребительскихУпаковокПоFIFOПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимКонтроляСредствамиККТПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИгнорироватьРезультатыПроверкиСредствамиККТПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПропускатьПроверкуСредствамиККТЕслиВыполненКонтрольСтатусовПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьСтатусыКодовМаркировкиУправлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьНастройкуЭлементаКонструктора(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьВладельцевКодовМаркировкиУправлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьНастройкуЭлементаКонструктора(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыИгнорированияПроверкиККТНастройкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьНастройкуЭлементаКонструктора(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧастотаОбновленияCDNПлощадокПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяБлокировкиCDNПлощадокПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОтветаCDNПлощадокПриПробитииЧекаПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияИдентификатораРазрешительногоРежимаПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТПОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТППриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗапрашиватьКоличествоМерногоТовараПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьСтандартнуюВложенностьПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьАлфавитКодовМаркировкиПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТППриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТППриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьСтруктуруКодовМаркировкиПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПропускатьСтрокиСОшибкамиПриЗагрузкеИзТСДПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СлужебныйШтрихкодПечатиУпаковкиПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьМРЦПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтоматическуюЗагрузкуСведенийОбОтклоненияхИСМППриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМаркируемаяПродукция

&НаКлиенте
Процедура МаркируемаяПродукцияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияИСВызовСервера.КлассификаторНастроекВидовПродукцийЗагружен() Тогда
		ОткрытьФормуВыбораВидаПродукцииПриДобавлении();
	Иначе
		
		ЗагрузкаКлассификатораНастроекЗавершение = Новый ОписаниеОповещения(
			"ЗагрузкаКлассификатораНастроекЗавершение", ЭтотОбъект);
		
		ДлительнаяОперация = НачатьЗагрузкуКлассификатораНастроекВидовПродукции();
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения             = НСтр("ru='Выполняется загрузка классификатора настроек видов продукции.'");
		ПараметрыОжидания.ВыводитьСообщения          = Истина;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ДлительнаяОперация,
			ЗагрузкаКлассификатораНастроекЗавершение,
			ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ПараметрыЗаписи = АдминистрированиеИСМПКлиентСервер.ПараметрыЗаписиМаркируемойПродукции();
	ПараметрыЗаписи.ЗаписыватьВидПродукции = Истина;
	
	Для Каждого Строка Из Элемент.ВыделенныеСтроки Цикл
		ТекущиеДанные = МаркируемаяПродукция.НайтиПоИдентификатору(Строка);
		Если ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДанных = АдминистрированиеИСМПКлиентСервер.СтрокаДанныхЗаписиМаркируемойПродукции();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, ТекущиеДанные);
		СтрокаДанных.ВидПродукцииВерхнегоУровня = Истина;
		СтрокаДанных.УдалениеДанных = Истина;
		ПараметрыЗаписи.Данные.Добавить(СтрокаДанных);
		Для Каждого ТекущиеДанные Из ТекущиеДанные.ПолучитьЭлементы() Цикл
			СтрокаДанных = АдминистрированиеИСМПКлиентСервер.СтрокаДанныхЗаписиМаркируемойПродукции();
			ЗаполнитьЗначенияСвойств(СтрокаДанных, ТекущиеДанные);
			СтрокаДанных.УдалениеДанных = Истина;
			ПараметрыЗаписи.Данные.Добавить(СтрокаДанных);
		КонецЦикла;
	КонецЦикла;
	
	Если ПараметрыЗаписи.Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗаписи = ЗаписатьДанныеМаркируемойПродукции(ПараметрыЗаписи);
	
	Если ЗначениеЗаполнено(РезультатЗаписи) Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗаписи);
	Иначе
		ЗаполнитьМаркируемуюПродукцию();
		ПослеРедактированияСпискаМаркируемойПродукции();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДатыНачалаРаботыСМаркируемойПродукцией = Неопределено Тогда
		ДатыНачалаРаботыСМаркируемойПродукцией = Новый Структура;
	КонецЕсли;
	
	Для Каждого Имя Из КонструкторИСМПОбщегоНазначенияКлиентСервер.ИменаДатНачалаРаботыСМаркируемойПродукцией() Цикл
		ДатыНачалаРаботыСМаркируемойПродукцией.Вставить(Имя, ТекущиеДанные[Имя]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияДатаНачалаПроизводстваПриИзменении(Элемент)
	МаркируемаяПродукцияДатаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияДатаНачалаОформленияУПДОСУПриИзменении(Элемент)
	МаркируемаяПродукцияДатаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияДатаНачалаОформленияУПДПоштучноПриИзменении(Элемент)
	МаркируемаяПродукцияДатаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияДатаНачалаРозничныхПродажПриИзменении(Элемент)
	МаркируемаяПродукцияДатаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияДатаНачалаРазрешительногоРежимаПриИзменении(Элемент)
	МаркируемаяПродукцияДатаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияДатаНачалаИспользованияЛокальногоМодуляПриИзменении(Элемент)
	МаркируемаяПродукцияДатаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияДатаНачалаВыводаИзОборотаПриИзменении(Элемент)
	МаркируемаяПродукцияДатаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияДатаНачалаЗапретаПродажБезМарокПриИзменении(Элемент)
	МаркируемаяПродукцияДатаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияДатаНачалаПрослеживаемостиПеремещенияМеждуМОДПриИзменении(Элемент)
	МаркируемаяПродукцияДатаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияДатаНачалаКонтроляРазрешительныхДокументовПриИзменении(Элемент)
	МаркируемаяПродукцияДатаПриИзменении(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаСертификатовДляАвтоматическогоОбменаИС(Команда)
	
	ОткрытьФорму("ОбщаяФорма.НастройкаСертификатовДляАвтоматическогоОбменаИС",,ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтправкуПолучениеИСМП(Команда)
	
	Если Не РедактированиеАвтоматическойОтправкиДанных Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьРасписаниеОтправкиПолученияИСМП", ЭтотОбъект);
	
	ОткрытьНастройкуРасписанияОбмена(ОписаниеОповещения, РасписаниеОтправкиПолученияИСМП);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЗагрузкуСведенийОбОтклонениях(Команда)
	
	Если Не РедактированиеАвтоматическойОтправкиДанных Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьРасписаниеЗагрузкиСведенийОбОтклоненияхИСМП", ЭтотОбъект);
	
	ОткрытьНастройкуРасписанияОбмена(ОписаниеОповещения, РасписаниеЗагрузкиСведенийОбОтклонениях);

КонецПроцедуры

&НаКлиенте
Процедура НастроитьОчисткуПулаКодовМаркировкиИСМП(Команда)
	
	Если Не РедактированиеСрокаХранения Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьРасписаниеОчисткиПулаКодовМаркировкиИСМП", ЭтотОбъект);
	
	ОткрытьНастройкуРасписанияОбмена(ОписаниеОповещения, РасписаниеОчисткиПулаКодовИСМП);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПроверкуСтатусовДокументовГИСМТ(Команда)
		
	Если Не РедактированиеАвтоматическойОтправкиДанных Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьРасписаниеПроверкаДокументовВГИСМТ", ЭтотОбъект);
	
	ОткрытьНастройкуРасписанияОбмена(ОписаниеОповещения, РасписаниеПроверкаСтатусовДокументовВГИСМТ);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьАвтоматическоеУдалениеНеиспользованныхКодовМаркировки(Команда)
	
	Если Не РедактированиеАвтоматическогоУдаленияНеиспользованныхКодовМаркировки Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьРасписаниеАвтоматическогоУдаленияНеиспользованныхКодовМаркировки", ЭтотОбъект);
	
	ОткрытьНастройкуРасписанияОбмена(ОписаниеОповещения, РасписаниеАвтоматическогоУдаленияНеиспользованныхКодовМаркировки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТокеныАвторизацииИСМП(Команда)
	
	ОткрытьФормуПросмотраИАктуализацииТокеновАвторизации(ПредопределенноеЗначение("Перечисление.ТипыТокеновАвторизации.ИСМП"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТокеныАвторизацииСУЗ(Команда)
	
	ОткрытьФормуПросмотраИАктуализацииТокеновАвторизации(ПредопределенноеЗначение("Перечисление.ТипыТокеновАвторизации.СУЗ"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТокеныАвторизацииРозница(Команда)
	
	ОткрытьФормуПросмотраИАктуализацииТокеновАвторизации(ПредопределенноеЗначение("Перечисление.ТипыТокеновАвторизации.ИСМПРозница"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокCDNПлощадок(Команда)
	
	ОткрытьФорму("РегистрСведений.СостоянияCDNПлощадокИСМП.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКассыНеПередающиеДанныеВИСМП(Команда)
	
	ОткрытьФорму("РегистрСведений.КассыНеПередающиеДанныеВИСМП.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключенияКСУЗ(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиОбменаСУЗ.ФормаСписка", , ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПулКодовМаркировкиСУЗ(Команда)
	
	ОткрытьФорму("РегистрСведений.ПулКодовМаркировкиСУЗ.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСервисПровайдерыСУЗ(Команда)
	
	ОткрытьФорму("Справочник.СервисПровайдерыСУЗ.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктивныеЗаказыСУЗ(Команда)
	
	ОткрытьФорму("Обработка.АктивныеЗаказыСУЗ.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиЭлектроннойПодписиИШифрования(Команда)
	
	ОткрытьФорму("ОбщаяФорма.НастройкиЭлектроннойПодписиИШифрования", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМашиночитаемыеДоверенности(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСКонтрагентами.МашиночитаемыеДоверенности") Тогда
		МЧДКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("МашиночитаемыеДоверенностиКлиент");
		МЧДКлиент.ОткрытьОбщуюФормуСписковМЧД();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодключенияКЛокальномуМодулюРазрешительногоРежима(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиПодключенияЛокальныхМодулейИСМП.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодключенияТСПИоТ(Команда)
	
	Если ИнтеграцияТСПИоТКлиент.ИспользуетсяВерсияБПОСПроверкойЧерезТСПИоТ() Тогда
		ОткрытьФорму("Справочник.ТСПИоТ.Форма.ФормаСписка", , ЭтотОбъект);
	Иначе
		ОткрытьФорму("РегистрСведений.НастройкиПодключенияТСПИоТ.Форма.ФормаСписка", , ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКодыТНВЭД(Команда)
	
	ОткрытьФорму("РегистрСведений.КодыТНВЭДИСМП.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуНоменклатурыПоТНВЭДиОКПД2(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ОтборПоТНВЭДиОКПД2", Истина);
	ОткрытьФорму("ОбщаяФорма.НастройкаИнтеграцииНоменклатурыИС", ПараметрыОткрытияФормы,, "ОтборПоТНВЭДиОКПД2");
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияТоварныхГрупп(Команда)
	
	ВыполнитьСинхронизацияТоварныхГрупп();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКодыОКПД2(Команда)
	
	ОткрытьФорму("РегистрСведений.КодыОКПД2ИСМП.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлассификаторСырьяГИСМТ(Команда)
	ОткрытьФорму("Справочник.КлассификаторСырьяГИСМТ.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокМОД(Команда)
	
	ОткрытьФорму("РегистрСведений.МестаОсуществленияДеятельностиИСМП.Форма.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// отображение пустых дат контролей и действующих дат
	СоответствиеНастроекДатИЭлементовФормы = Новый Соответствие;
	СоответствиеНастроекДатИЭлементовФормы.Вставить("МаркируемаяПродукция.ДатаНачалаПроизводства",
		Элементы.МаркируемаяПродукцияДатаНачалаПроизводства.Имя);
	СоответствиеНастроекДатИЭлементовФормы.Вставить("МаркируемаяПродукция.ДатаНачалаВыводаИзОборота",
		Элементы.МаркируемаяПродукцияДатаНачалаВыводаИзОборота.Имя);
	СоответствиеНастроекДатИЭлементовФормы.Вставить("МаркируемаяПродукция.ДатаНачалаЗапретаПродажБезМарок",
		Элементы.МаркируемаяПродукцияДатаНачалаЗапретаПродажБезМарок.Имя);
	СоответствиеНастроекДатИЭлементовФормы.Вставить("МаркируемаяПродукция.ДатаНачалаОформленияУПДОСУ",
		Элементы.МаркируемаяПродукцияДатаНачалаОформленияУПДОСУ.Имя);
	СоответствиеНастроекДатИЭлементовФормы.Вставить("МаркируемаяПродукция.ДатаНачалаОформленияУПДПоштучно",
		Элементы.МаркируемаяПродукцияДатаНачалаОформленияУПДПоштучно.Имя);
	СоответствиеНастроекДатИЭлементовФормы.Вставить("МаркируемаяПродукция.ДатаНачалаРазрешительногоРежима",
		Элементы.МаркируемаяПродукцияДатаНачалаРазрешительногоРежима.Имя);
	СоответствиеНастроекДатИЭлементовФормы.Вставить("МаркируемаяПродукция.ДатаНачалаРозничныхПродаж",
		Элементы.МаркируемаяПродукцияДатаНачалаРозничныхПродаж.Имя);
	СоответствиеНастроекДатИЭлементовФормы.Вставить("МаркируемаяПродукция.ДатаНачалаИспользованияЛокальногоМодуля",
		Элементы.МаркируемаяПродукцияДатаНачалаИспользованияЛокальногоМодуля.Имя);
	СоответствиеНастроекДатИЭлементовФормы.Вставить("МаркируемаяПродукция.ДатаНачалаПрослеживаемостиПеремещенияМеждуМОД",
		Элементы.МаркируемаяПродукцияДатаНачалаПрослеживаемостиПеремещенияМеждуМОД.Имя);
	СоответствиеНастроекДатИЭлементовФормы.Вставить("МаркируемаяПродукция.ДатаНачалаКонтроляРазрешительныхДокументов",
		Элементы.МаркируемаяПродукцияДатаНачалаКонтроляРазрешительныхДокументов.Имя);
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	
	Для Каждого КлючИЗначение Из СоответствиеНастроекДатИЭлементовФормы Цикл
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(КлючИЗначение.Значение);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(КлючИЗначение.Ключ);
		ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru = 'нет данных'"));
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(КлючИЗначение.Значение);
		
		ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(КлючИЗначение.Ключ);
		ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ОтборЭлемента.ПравоеЗначение = ТекущаяДата;
		
		ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(КлючИЗначение.Ключ);
		ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.Заполнено;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'действует'"));
		
	КонецЦикла;
	
	Если ЭтоРасширеннаяВерсияГосИС Тогда
		МодульПанельАдминистрированияИСМП = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ПанельАдминистрированияИСМП");
		МодульПанельАдминистрированияИСМП.УстановитьУсловноеОформление(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасписаниеОтправкиПолученияИСМП(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеОтправкиПолученияИСМП = РасписаниеЗадания;
	
	ИзменитьРасписаниеЗадания("ОтправкаПолучениеДанныхИСМП", РасписаниеОтправкиПолученияИСМП);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасписаниеПроверкаДокументовВГИСМТ(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеПроверкаСтатусовДокументовВГИСМТ = РасписаниеЗадания;
	
	ИзменитьРасписаниеЗадания("ПроверкаСтатусовДокументовВГИСМТ", РасписаниеПроверкаСтатусовДокументовВГИСМТ);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасписаниеЗагрузкиСведенийОбОтклоненияхИСМП(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеЗагрузкиСведенийОбОтклонениях = РасписаниеЗадания;
	
	ИзменитьРасписаниеЗадания("ЗагрузкаСведенийОбОтклоненияхИСМП", РасписаниеЗагрузкиСведенийОбОтклонениях);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасписаниеОчисткиПулаКодовМаркировкиИСМП(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеОчисткиПулаКодовИСМП = РасписаниеЗадания;
	
	ИзменитьРасписаниеЗадания("ОчисткаПулаКодовМаркировкиИСМП", РасписаниеОчисткиПулаКодовИСМП);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасписаниеАвтоматическогоУдаленияНеиспользованныхКодовМаркировки(РасписаниеЗадания, ДополнительныеПараметры) Экспорт
	
	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеАвтоматическогоУдаленияНеиспользованныхКодовМаркировки = РасписаниеЗадания;
	
	ИзменитьРасписаниеЗадания("УдалениеНеиспользованныхКодовМаркировкиИСМП",
		РасписаниеАвтоматическогоУдаленияНеиспользованныхКодовМаркировки);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьИспользованиеЗадания(ИмяЗадания, Использование)
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Метаданные", ИмяЗадания);
	РегЗадание = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыОтбора)[0];

	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Использование", Истина И Использование);
	РегламентныеЗаданияСервер.ИзменитьЗадание(РегЗадание.УникальныйИдентификатор, ПараметрыЗадания);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Метаданные", ИмяЗадания);
	РегЗадание = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыОтбора)[0];
	
	Элемент = Элементы[ИмяЗадания];
	УстановитьТекстНадписиРегламентнойНастройки(РегЗадание, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРасписаниеЗадания(ИмяЗадания, РасписаниеРегламентногоЗадания)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Метаданные", ИмяЗадания);
	РегЗадание = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыОтбора)[0];

	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Расписание", РасписаниеРегламентногоЗадания);
	РегламентныеЗаданияСервер.ИзменитьЗадание(РегЗадание.УникальныйИдентификатор, ПараметрыЗадания);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Метаданные", ИмяЗадания);
	РегЗадание = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыОтбора)[0];
	
	Элемент = Элементы[ИмяЗадания];
	УстановитьТекстНадписиРегламентнойНастройки(РегЗадание, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуРасписанияОбмена(ОписаниеОповещения, РасписаниеРегламентногоЗадания)
	
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСоответствиеИспользованияРегламентныхЗаданийКонстантам()
	
	Если ОбщегоНазначения.РазделениеВключено()
		Или Не ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	КонстантыИЗадания = Новый Структура;
	КонстантыИЗадания.Вставить("ИспользоватьАвтоматическуюОтправкуПолучениеДанныхИСМП", "ОтправкаПолучениеДанныхИСМП");
	КонстантыИЗадания.Вставить("СрокХраненияИспользованныхКодовМаркировки", "ОчисткаПулаКодовМаркировкиИСМП");
	КонстантыИЗадания.Вставить("ИспользоватьАвтоматическоеУдалениеНеиспользованныхКодовМаркировкиИСМП", "УдалениеНеиспользованныхКодовМаркировкиИСМП");
	КонстантыИЗадания.Вставить("ИспользоватьПроверкуСтатусовДокументовВГИСМТ", "ПроверкаСтатусовДокументовВГИСМТ");
	КонстантыИЗадания.Вставить("ИспользоватьАвтоматическуюЗагрузкуСведенийОбОтклоненияхИСМП", "ЗагрузкаСведенийОбОтклоненияхИСМП");
	
	Для Каждого КлючИЗначение Из КонстантыИЗадания Цикл
		
		УстановитьЗначениеКонстанты = Ложь;
		ЗначениеКонстанты = НаборКонстант[КлючИЗначение.Ключ];
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Метаданные", КлючИЗначение.Значение);
		РегЗадание = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыОтбора)[0];
		
		Если КлючИЗначение.Ключ = "СрокХраненияИспользованныхКодовМаркировки" Тогда
			Если РегЗадание.Использование И ЗначениеКонстанты = 0 Тогда
				УстановитьЗначениеКонстанты = Истина;
				ЗначениеКонстанты = 1;
			ИначеЕсли Не РегЗадание.Использование И ЗначениеКонстанты > 0 Тогда
				УстановитьЗначениеКонстанты = Истина;
				ЗначениеКонстанты = 0;
			КонецЕсли;
		ИначеЕсли ЗначениеКонстанты <> РегЗадание.Использование Тогда
			УстановитьЗначениеКонстанты = Истина;
			ЗначениеКонстанты = РегЗадание.Использование;
		КонецЕсли;
		
		Если УстановитьЗначениеКонстанты Тогда
			КонстантаМенеджер = Константы[КлючИЗначение.Ключ];
			КонстантаМенеджер.Установить(ЗначениеКонстанты);
			НаборКонстант[КлючИЗначение.Ключ] = ЗначениеКонстанты;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиЗаданий()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Метаданные", "ОтправкаПолучениеДанныхИСМП");
	ЗаданиеОтправкаПолучениеДанныхИСМП = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыОтбора)[0];
	
	РасписаниеОтправкиПолученияИСМП = ЗаданиеОтправкаПолучениеДанныхИСМП.Расписание;
	
	Элементы.ОтправкаПолучениеДанныхИСМП.Доступность = ЗаданиеОтправкаПолучениеДанныхИСМП.Использование;
	УстановитьТекстНадписиРегламентнойНастройки(ЗаданиеОтправкаПолучениеДанныхИСМП, Элементы.ОтправкаПолучениеДанныхИСМП);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Метаданные", "ПроверкаСтатусовДокументовВГИСМТ");
	ЗаданиеПроверкаСтатусовДокументовВГИСМТ = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыОтбора)[0];
	
	РасписаниеПроверкаСтатусовДокументовВГИСМТ = ЗаданиеПроверкаСтатусовДокументовВГИСМТ.Расписание;
	
	Элементы.ПроверкаСтатусовДокументовВГИСМТ.Доступность = ЗаданиеПроверкаСтатусовДокументовВГИСМТ.Использование;
	УстановитьТекстНадписиРегламентнойНастройки(ЗаданиеПроверкаСтатусовДокументовВГИСМТ, Элементы.ПроверкаСтатусовДокументовВГИСМТ);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Метаданные", "ОчисткаПулаКодовМаркировкиИСМП");
	ЗаданиеОчисткаПулаКодовМаркировкиИСМП = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыОтбора)[0];
	
	РасписаниеОчисткиПулаКодовИСМП = ЗаданиеОчисткаПулаКодовМаркировкиИСМП.Расписание;
	
	Элементы.ОчисткаПулаКодовМаркировкиИСМП.Доступность = ЗаданиеОчисткаПулаКодовМаркировкиИСМП.Использование;
	УстановитьТекстНадписиРегламентнойНастройки(ЗаданиеОчисткаПулаКодовМаркировкиИСМП, Элементы.ОчисткаПулаКодовМаркировкиИСМП);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Метаданные", "УдалениеНеиспользованныхКодовМаркировкиИСМП");
	Задание = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыОтбора)[0];
	
	РасписаниеАвтоматическогоУдаленияНеиспользованныхКодовМаркировки = Задание.Расписание;
	
	Элементы.УдалениеНеиспользованныхКодовМаркировкиИСМП.Доступность = Задание.Использование;
	УстановитьТекстНадписиРегламентнойНастройки(Задание, Элементы.УдалениеНеиспользованныхКодовМаркировкиИСМП);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Метаданные", "ЗагрузкаСведенийОбОтклоненияхИСМП");
	Задание = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыОтбора)[0];
	
	РасписаниеЗагрузкиСведенийОбОтклонениях = Задание.Расписание;
	
	Элементы.ЗагрузкаСведенийОбОтклоненияхИСМП.Доступность = Задание.Использование;
	УстановитьТекстНадписиРегламентнойНастройки(Задание, Элементы.ЗагрузкаСведенийОбОтклоненияхИСМП);
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаСервере
Процедура УстановитьТекстНадписиРегламентнойНастройки(Задание, Элемент)
	
	Перем ТекстРасписания, РасписаниеАктивно;
	
	ОбщегоНазначенияИС.ПолучитьТекстЗаголовкаИРасписанияРегламентнойНастройки(Задание, ТекстРасписания, РасписаниеАктивно);
	Элемент.Заголовок = ТекстРасписания;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	Результат = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
		ОбновитьИнтерфейс = Истина;
	КонецЕсли;
	
	Если Результат <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	Результат = Новый Структура;
	
	РеквизитПутьКДанным   = Элементы[ИмяЭлемента].ПутьКДанным;
	НастройкиСканирования = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.НастройкиСканированияКодовМаркировки();
	
	СохранитьЗначениеРеквизита(РеквизитПутьКДанным, Результат, НастройкиСканирования);
	
	НастроитьФормуПриИзменииЭлементовУправления();
	УстановитьДоступность(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СохранитьЗначениеРеквизита(РеквизитПутьКДанным, Результат, НастройкиСканирования)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат;
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	Иначе
		// Определение имени и запись значения реквизита в соответствующей константе из "НаборКонстант".
		// Используется для тех реквизитов формы, которые связаны с константами напрямую (в отношении один-к-одному).
	КонецЕсли;
	
	СохранитьЗначениеКонстанты(КонстантаИмя, НастройкиСканирования);
	
	Если РеквизитПутьКДанным = Элементы.МаркируемаяПродукция.Имя Тогда
		ЗначениеВестиУчетМаркируемойПродукцииИСМП = МаркируемаяПродукция.ПолучитьЭлементы().Количество() > 0;
		Если ЗначениеВестиУчетМаркируемойПродукцииИСМП <> Константы.ВестиУчетМаркируемойПродукцииИСМП.Получить() Тогда
			Если ЭтоРасширеннаяВерсияГосИС
				И ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИС").УпрощеннаяИнтеграцияБЭД() Тогда
				Если ЗначениеВестиУчетМаркируемойПродукцииИСМП Тогда
					Константы.ВестиУчетМаркируемойПродукцииИСМП.Установить(ЗначениеВестиУчетМаркируемойПродукцииИСМП);
				КонецЕсли;
			Иначе
				Константы.ВестиУчетМаркируемойПродукцииИСМП.Установить(ЗначениеВестиУчетМаркируемойПродукцииИСМП);
			КонецЕсли;
		КонецЕсли;
		Если Не ЗначениеВестиУчетМаркируемойПродукцииИСМП Тогда
			ИзменитьИспользованиеЗадания("ОтправкаПолучениеДанныхИСМП", Ложь);
			СохранитьЗначениеКонстанты("ИспользоватьАвтоматическуюОтправкуПолучениеДанныхИСМП", НастройкиСканирования, Ложь);
			
			ИзменитьИспользованиеЗадания("ОчисткаПулаКодовМаркировкиИСМП", Ложь);
			СохранитьЗначениеКонстанты("СрокХраненияИспользованныхКодовМаркировки", 0);
			УдалятьКодыМаркировкиИзПула = Ложь;
			
			ИзменитьИспользованиеЗадания("УдалениеНеиспользованныхКодовМаркировкиИСМП", Ложь);
			СохранитьЗначениеКонстанты("ИспользоватьАвтоматическоеУдалениеНеиспользованныхКодовМаркировкиИСМП", НастройкиСканирования, Ложь);
			
			ИзменитьИспользованиеЗадания("ПроверкаСтатусовДокументовВГИСМТ", Ложь);
			СохранитьЗначениеКонстанты("ИспользоватьПроверкуСтатусовДокументовВГИСМТ", НастройкиСканирования, Ложь);
			
			ИзменитьИспользованиеЗадания("ЗагрузкаСведенийОбОтклоненияхИСМП", Ложь);
			СохранитьЗначениеКонстанты("ИспользоватьАвтоматическуюЗагрузкуСведенийОбОтклоненияхИСМП", НастройкиСканирования, Ложь);
			
		КонецЕсли;
	КонецЕсли;
	
	Если КонстантаИмя = "ИспользоватьАвтоматическуюОтправкуПолучениеДанныхИСМП" Тогда
		ИзменитьИспользованиеЗадания("ОтправкаПолучениеДанныхИСМП", НаборКонстант.ИспользоватьАвтоматическуюОтправкуПолучениеДанныхИСМП);
	КонецЕсли;
	
	Если КонстантаИмя = "СрокХраненияИспользованныхКодовМаркировки" Тогда
		ИзменитьИспользованиеЗадания("ОчисткаПулаКодовМаркировкиИСМП", НаборКонстант.СрокХраненияИспользованныхКодовМаркировки > 0);
	КонецЕсли;
	
	Если КонстантаИмя = "ИспользоватьАвтоматическоеУдалениеНеиспользованныхКодовМаркировкиИСМП" Тогда
		ИзменитьИспользованиеЗадания("УдалениеНеиспользованныхКодовМаркировкиИСМП", НаборКонстант.ИспользоватьАвтоматическоеУдалениеНеиспользованныхКодовМаркировкиИСМП);
	КонецЕсли;
		
	Если КонстантаИмя = "ИспользоватьПроверкуСтатусовДокументовВГИСМТ" Тогда
		ИзменитьИспользованиеЗадания("ПроверкаСтатусовДокументовВГИСМТ", НаборКонстант.ИспользоватьПроверкуСтатусовДокументовВГИСМТ);
	КонецЕсли;
	
	Если КонстантаИмя = "ИспользоватьАвтоматическуюЗагрузкуСведенийОбОтклоненияхИСМП" Тогда
		ИзменитьИспользованиеЗадания("ЗагрузкаСведенийОбОтклоненияхИСМП", НаборКонстант.ИспользоватьАвтоматическуюЗагрузкуСведенийОбОтклоненияхИСМП);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначениеКонстанты(КонстантаИмя, НастройкиСканирования, Знач КонстантаЗначение = Неопределено)
	
	Если КонстантаИмя = "" Тогда
		
		Если Не КонтролироватьСтатусыКодовМаркировки
			И КонтролироватьВладельцевКодовМаркировки Тогда
			КонтролироватьВладельцевКодовМаркировки = Ложь;
		КонецЕсли;
		
		Если ИгнорироватьРезультатыПроверкиСредствамиККТ
			И ПропускатьПроверкуСредствамиККТ Тогда
			ПропускатьПроверкуСредствамиККТ = Ложь;
		КонецЕсли;
		
		Если Не (КонтролироватьСтатусыКодовМаркировки Или КонтролироватьВладельцевКодовМаркировки)
			И ПропускатьПроверкуСредствамиККТ Тогда
			ПропускатьПроверкуСредствамиККТ = Ложь;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НастройкиСканирования, ЭтотОбъект);
		
		КонстантаЗначение = Новый ХранилищеЗначения(НастройкиСканирования);
		Константы.НастройкиСканированияКодовМаркировкиИСМП.Установить(КонстантаЗначение);
		
	Иначе
		
		КонстантаМенеджер = Константы[КонстантаИмя];
		Если КонстантаЗначение = Неопределено Тогда
			КонстантаЗначение = НаборКонстант[КонстантаИмя];
		КонецЕсли;
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
			Если КонстантаЗначение <> Неопределено Тогда
				НаборКонстант[КонстантаИмя] = КонстантаЗначение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоРасширеннаяВерсияГосИС Тогда
		МодульСобытияФормИСПереопределяемый = ОбщегоНазначения.ОбщийМодуль("СобытияФормИСПереопределяемый");
		Если КонстантаИмя = "" Тогда
			МодульСобытияФормИСПереопределяемый.ОбновитьФормуНастройкиПриЗаписиПодчиненныхКонстант(
				ЭтотОбъект, "НастройкиСканированияКодовМаркировкиИСМП", Неопределено);
		Иначе
			МодульСобытияФормИСПереопределяемый.ОбновитьФормуНастройкиПриЗаписиПодчиненныхКонстант(
				ЭтотОбъект, КонстантаИмя, КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность(РеквизитПутьКДанным = "")
	
	Если ЭтоРасширеннаяВерсияГосИС Тогда
		//@skip-check bsl-legacy-check-string-literal
		ВестиУчетМаркируемойПродукцииИСМП = ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП");
	Иначе
		ВестиУчетМаркируемойПродукцииИСМП = ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМПРМК");
	КонецЕсли;
	
	Элементы.СтраницаРегламентныеЗадания.Доступность   = ВестиУчетМаркируемойПродукцииИСМП;
	Элементы.СтраницаНастройкиСканирования.Доступность = ВестиУчетМаркируемойПродукцииИСМП;
	Элементы.СтраницаРозница.Доступность               = ВестиУчетМаркируемойПродукцииИСМП;
	Элементы.СтраницаСправочники.Доступность           = ВестиУчетМаркируемойПродукцииИСМП;
	Элементы.СтраницаСУЗ.Доступность                   = ВестиУчетМаркируемойПродукцииИСМП;
	Элементы.МаркируемаяПродукция.ТолькоПросмотр       = Не Пользователи.ЭтоПолноправныйПользователь();
	
	Если ЭтоРасширеннаяВерсияГосИС Тогда
		Элементы.СрокХраненияИспользованныхКодовМаркировки.Доступность = УдалятьКодыМаркировкиИзПула И ВестиУчетМаркируемойПродукцииИСМП;
	КонецЕсли;
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Элементы.ГруппаНастройкаСертификатовДляАвтоматическогоОбменаИССтраницаНастройки.Видимость = Ложь;
		Элементы.СтраницаРегламентныеЗадания.Видимость = Ложь;
	ИначеЕсли ЭтоРасширеннаяВерсияГосИС Тогда
		
		Элементы.ГруппаНастройкиРегламентногоЗаданияОбмена.ТолькоПросмотр = Не РедактированиеАвтоматическойОтправкиДанных;
		Элементы.ГруппаНастройкиРегламентногоЗаданияОчисткиПула.ТолькоПросмотр = Не РедактированиеСрокаХранения;
		Элементы.ГруппаАвтоматическоеУдалениеНеиспользованныхКодовМаркировки.ТолькоПросмотр =
			Не РедактированиеАвтоматическогоУдаленияНеиспользованныхКодовМаркировки;
		Элементы.ГруппаФоноваяПроверкаДокументовДляГИСМТ.Видимость = ОбщегоНазначения.ИнформационнаяБазаФайловая();
		
		УстановитьНастройкиЗаданий();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

#Область МаркируемаяПродукция

&НаСервере
Процедура ЗаполнитьМаркируемуюПродукцию()
	
	ЭлементыДерева = МаркируемаяПродукция.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();
	
	ПоляЗапросаДаты = "";
	ТекстЗапросаДаты = "";
	Для Каждого Имя Из КонструкторИСМПОбщегоНазначенияКлиентСервер.ИменаДатНачалаРаботыСМаркируемойПродукцией() Цикл
		
		ИмяЭлементаКонструктора = КонструкторИСМПОбщегоНазначенияКлиентСервер.ИмяЭлементаКонструктораПоИмениДаты(Имя);
		
		ПоляЗапросаДаты = ПоляЗапросаДаты + СтрШаблон("
		|	,%1.Значение КАК %2",
		ИмяЭлементаКонструктора,
		Имя);
		
		ТекстЗапросаДаты = ТекстЗапросаДаты + СтрШаблон("
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ ЗначенияЭлементовКонструктора.ВидПродукции, ЗначенияЭлементовКонструктора.Значение
		|		ИЗ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
		|			ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
		|			И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
		|		ГДЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.%1)
		|		И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
		|		ОБЪЕДИНИТЬ
		|		ВЫБРАТЬ ЗначенияПользователяЭлементовКонструктора.ВидПродукции, ЗначенияПользователяЭлементовКонструктора.Значение
		|		ИЗ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
		|		ГДЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.%1)
		|			И НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
		|		) КАК %1
		|		ПО ВидыПродукции.Ссылка = %1.ВидПродукции",
		ИмяЭлементаКонструктора);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
	"ВЫБРАТЬ
	|	ВидыПродукции.Ссылка КАК ВидПродукции,
	|	Представление(ВидыПродукции.Ссылка) КАК Представление
	|%1
	|ИЗ
	|	Справочник.ВидыПродукцииИС КАК ВидыПродукции
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ ЗначенияЭлементовКонструктора.ВидПродукции
	|		ИЗ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|			ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
	|			И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|		ГДЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ)
	|		И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
	|		ОБЪЕДИНИТЬ
	|		ВЫБРАТЬ ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|		ИЗ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|		ГДЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ)
	|			И НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
	|		) КАК ДоступныеВидыПродукции
	|		ПО ДоступныеВидыПродукции.ВидПродукции = ВидыПродукции.Ссылка
	|%2
	|УПОРЯДОЧИТЬ ПО ВидыПродукции.Наименование",
	ПоляЗапросаДаты,
	ТекстЗапросаДаты);
	
	Выборка= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементДерева = ЭлементыДерева.Добавить();
		ЗаполнитьЗначенияСвойств(ЭлементДерева, Выборка);
		
		ЭлементДерева.ТоварнаяКатегория = КонструкторИСМПОбщегоНазначенияКлиентСервер.ПредставлениеТоварнойКатегории(
			Выборка.ВидПродукции, Выборка.Представление);
		
	КонецЦикла;
	
	ДеревоЗначений = РеквизитФормыВЗначение("МаркируемаяПродукция", Тип("ДеревоЗначений"));
	ДеревоЗначений.Строки.Сортировать("ТоварнаяКатегория", Истина);
	ЗначениеВРеквизитФормы(ДеревоЗначений, "МаркируемаяПродукция");
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура МаркируемаяПродукцияДатаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.МаркируемаяПродукция.ТекущиеДанные;
	Имя = СтрЗаменить(Элемент.Имя, "МаркируемаяПродукция", "");
	
	ПараметрыЗаписи = АдминистрированиеИСМПКлиентСервер.ПараметрыЗаписиМаркируемойПродукции();
	ПараметрыЗаписи["Записывать" + Имя] = Истина;
	
	СтрокаДанных = АдминистрированиеИСМПКлиентСервер.СтрокаДанныхЗаписиМаркируемойПродукции();
	СтрокаДанных.ВидПродукции = ТекущиеДанные.ВидПродукции;
	СтрокаДанных[Имя] = ТекущиеДанные[Имя];
	
	ПараметрыЗаписи.Данные.Добавить(СтрокаДанных);
	
	РезультатЗаписи = ЗаписатьДанныеМаркируемойПродукции(ПараметрыЗаписи);
	
	Если ЗначениеЗаполнено(РезультатЗаписи) Тогда
		ТекущиеДанные[Имя] = ДатыНачалаРаботыСМаркируемойПродукцией[Имя];
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗаписи);
	Иначе
		ЗаполнитьДатыПоУмолчаниюПослеЗаписи(ТекущиеДанные, ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатыПоУмолчаниюПослеЗаписи(ТекущиеДанные, ПараметрыЗаписи)
	
	ИменаДатНачалаРаботыСМаркируемойПродукцией = КонструкторИСМПОбщегоНазначенияКлиентСервер.ИменаДатНачалаРаботыСМаркируемойПродукцией();
	
	Для Каждого СтрокаДанных Из ПараметрыЗаписи.Данные Цикл
		
		Для Каждого Имя Из ИменаДатНачалаРаботыСМаркируемойПродукцией Цикл
			Если ПараметрыЗаписи["Записывать" + Имя]
				И Не ЗначениеЗаполнено(СтрокаДанных[Имя]) Тогда
				Значения = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
					ПредопределенноеЗначение(
						СтрШаблон("Справочник.ЭлементыКонструктораВидовПродукцииИС.%1",
						КонструкторИСМПОбщегоНазначенияКлиентСервер.ИмяЭлементаКонструктораПоИмениДаты(Имя))),
					СтрокаДанных.ВидПродукции);
				Если Значения.Количество() > 0 Тогда
					ТекущиеДанные[Имя] = Значения[0];
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюСтрокуМаркируемойПродукции(ВидПродукции)
	
	ЭлементыДерева = МаркируемаяПродукция.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.ВидПродукции = ВидПродукции Тогда
			Элементы.МаркируемаяПродукция.ТекущаяСтрока = ЭлементДерева.ПолучитьИдентификатор();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеДобавленияМаркируемойПродукции(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("СправочникСсылка.ВидыПродукцииИС")
		И ТипЗнч(Результат) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.ВидыПродукцииИС") Тогда
		ВидыПродукции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Результат);
	Иначе
		ВидыПродукции = Результат;
	КонецЕсли;
	
	ПараметрыЗаписи = АдминистрированиеИСМПКлиентСервер.ПараметрыЗаписиМаркируемойПродукции();
	ПараметрыЗаписи.ЗаписыватьВидПродукции = Истина;
	Для Каждого ВидПродукции Из ВидыПродукции Цикл
		СтрокаДанных = АдминистрированиеИСМПКлиентСервер.СтрокаДанныхЗаписиМаркируемойПродукции();
		СтрокаДанных.ВидПродукции = ВидПродукции;
		СтрокаДанных.ВидПродукцииВерхнегоУровня = Истина;
		ПараметрыЗаписи.Данные.Добавить(СтрокаДанных);
	КонецЦикла;
	
	РезультатЗаписи = ЗаписатьДанныеМаркируемойПродукции(ПараметрыЗаписи);
	
	Если ЗначениеЗаполнено(РезультатЗаписи) Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗаписи);
	Иначе
		ЗаполнитьМаркируемуюПродукцию();
		ПослеРедактированияСпискаМаркируемойПродукции();
		УстановитьТекущуюСтрокуМаркируемойПродукции(СтрокаДанных.ВидПродукции);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписатьДанныеМаркируемойПродукции(ПараметрыЗаписи)
	
	Результат = АдминистрированиеИСМП.ЗаписатьДанныеМаркируемойПродукции(ПараметрыЗаписи);
	
	Если Результат = "" Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПослеРедактированияСпискаМаркируемойПродукции()
	
	ОчиститьСообщения();
	
	Результат = ПослеРедактированияСпискаМаркируемойПродукцииНаСервере();
	
	ОбновитьИнтерфейс = Истина;
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	
	Если Результат <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПослеРедактированияСпискаМаркируемойПродукцииНаСервере()
	
	Результат = ПриИзмененииРеквизитаСервер(Элементы.МаркируемаяПродукция.Имя);
	НастроитьЭлементыФормыНаСервере();
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура НастроитьЭлементыФормыНаСервере()
	
	Если ЭтоРасширеннаяВерсияГосИС Тогда
		СтандартнаяОбработка = Истина;
		МодульПанельАдминистрированияИСМП = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ПанельАдминистрированияИСМП");
		МодульПанельАдминистрированияИСМП.НастроитьЭлементыФормыНаСервере(ЭтотОбъект, СтандартнаяОбработка);
		Если Не СтандартнаяОбработка Тогда
			Возврат;
		КонецЕсли;
		УчитываетсяТолькоСырье = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываетсяТолькоСырье();
	Иначе
		Элементы.ОткрытьКассыНеПередающиеДанныеВИСМП.Видимость = Ложь;
		Элементы.ОткрытьКлассификаторСырьяГИСМТ.Видимость      = Ложь;
		УчитываетсяТолькоСырье                                 = Ложь;
	КонецЕсли;
	
	Элементы.СтраницаСУЗ.Видимость                   = ЭтоРасширеннаяВерсияГосИС И Не УчитываетсяТолькоСырье;
	Элементы.СтраницаСправочники.Видимость           = ЭтоРасширеннаяВерсияГосИС;
	Элементы.СтраницаРегламентныеЗадания.Видимость   = ЭтоРасширеннаяВерсияГосИС;
	Элементы.РежимКонтроляСредствамиККТ.Видимость    = ЭтоРасширеннаяВерсияГосИС И Не УчитываетсяТолькоСырье;
	Элементы.МаркируемаяПродукцияДатаНачалаПроизводства.Видимость                        = ЭтоРасширеннаяВерсияГосИС;
	Элементы.МаркируемаяПродукцияДатаНачалаВыводаИзОборота.Видимость                     = ЭтоРасширеннаяВерсияГосИС;
	Элементы.МаркируемаяПродукцияДатаНачалаПрослеживаемостиПеремещенияМеждуМОД.Видимость = ЭтоРасширеннаяВерсияГосИС;
	Элементы.МаркируемаяПродукцияДатаНачалаОформленияУПДОСУ.Видимость                    = ЭтоРасширеннаяВерсияГосИС;
	Элементы.МаркируемаяПродукцияДатаНачалаОформленияУПДПоштучно.Видимость               = ЭтоРасширеннаяВерсияГосИС И Не УчитываетсяТолькоСырье;
	Элементы.СтраницаНастройкиСканирования.Видимость                                     = Не УчитываетсяТолькоСырье;
	Элементы.СтраницаРозница.Видимость                                                   = Не УчитываетсяТолькоСырье;
	Элементы.МаркируемаяПродукцияГруппаРозничнаяТорговля.Видимость                       = Не УчитываетсяТолькоСырье;
	
	Элементы.ОткрытьМашиночитаемыеДоверенности.Видимость = ОбщегоНазначения.ПодсистемаСуществует(
		"ЭлектронноеВзаимодействие.ОбменСКонтрагентами.МашиночитаемыеДоверенности");
	
	Элементы.СтраницаНастройкиСканирования.ТолькоПросмотр  = Не ЭтоПолноправныйПользователь;
	Элементы.ГруппаКонтрольСредствамиККТ.Доступность    = ЭтоПолноправныйПользователь;
	Элементы.ГруппаПодбиратьКодыМаркировкиВскрытыхПотребительскихУпаковокПоFIFO.Доступность = ЭтоПолноправныйПользователь;
	Элементы.ЧастотаОбновленияCDNПлощадок.ТолькоПросмотр                    = Не ЭтоПолноправныйПользователь;
	Элементы.ВремяБлокировкиCDNПлощадок.ТолькоПросмотр                      = Не ЭтоПолноправныйПользователь;
	Элементы.ВремяОтветаCDNПлощадокПриПробитииЧека.ТолькоПросмотр           = Не ЭтоПолноправныйПользователь;
	Элементы.СрокДействияИдентификатораРазрешительногоРежима.ТолькоПросмотр = Не ЭтоПолноправныйПользователь;
	
	Элементы.ГруппаНастройкиРаботыСМернымТоваром.Видимость = ОбщегоНазначенияИС.ЕстьПродукцияТребующаяВзвешивания();
	
	ВедетсяУчетВидовПродукцииСЧастичнымВыбытием = Ложь;
	
	Для Каждого ВидПродукции Из ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции() Цикл
		Если ОбщегоНазначенияИСКлиентСерверПовтИсп.ПоддерживаетсяЧастичноеВыбытие(ВидПродукции) Тогда
			ВедетсяУчетВидовПродукцииСЧастичнымВыбытием = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ПодбиратьКодыМаркировкиВскрытыхПотребительскихУпаковокПоFIFO.Видимость = ВедетсяУчетВидовПродукцииСЧастичнымВыбытием И ЭтоРасширеннаяВерсияГосИС;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПриИзменииЭлементовУправления()
	
	ПараметрыКонтроля = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ПараметрыКонтроля();
	
	НастройкиПользователя = НастройкаПараметровСканированияИСМПСлужебный.НастройкиПользователяЭлементовКонструктора();
	
	КонтролироватьСтатусыКодовМаркировки        = НастройкаПараметровСканированияСлужебныйКлиентСервер.КонтролироватьСтатусыКодовМаркировки();
	КонтролироватьВладельцевКодовМаркировки     = НастройкаПараметровСканированияСлужебныйКлиентСервер.КонтролироватьВладельцевКодовМаркировки();
	ИгнорироватьРезультатыПроверкиСредствамиККТ = НастройкаПараметровСканированияСлужебныйКлиентСервер.ИгнорироватьРезультатыПроверкиСредствамиККТ();
	
	Для Каждого КлючИЗначение Из ПараметрыКонтроля Цикл
		
		ИмяПараметраНастройки  = КлючИЗначение.Ключ;
		ЭлементФормыИсключения = Элементы[СтрШаблон("Группа%1", ИмяПараметраНастройки)];
		
		Подсказка = "";
		
		ЭлементКонструктора = НастройкаПараметровСканированияСлужебныйКлиентСервер.КонвертироватьИмяЭлементаЭлементКонструктора(СтрШаблон("%1Настройка", ИмяПараметраНастройки));
		Если ЭлементКонструктора <> Неопределено Тогда
			НастройкаПользователя = НастройкиПользователя[ЭлементКонструктора];
			Если НастройкаПользователя <> Неопределено Тогда
				Подсказка = НастройкаПользователя;
			КонецЕсли;
		КонецЕсли;
		
		ЭлементФормыИсключения.РасширеннаяПодсказка.Заголовок = Подсказка;
		
		Если Подсказка = "" Тогда
			ЭлементФормыИсключения.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Иначе
			ЭлементФормыИсключения.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		КонецЕсли;
		
	КонецЦикла;
	
	КонтрольСтатусовТабачнойПродукцииВедется =
		ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции(Ложь, Истина).Количество() > 0;
	
	Элементы.ПропускатьПроверкуСредствамиККТ.Доступность = (Не ИгнорироватьРезультатыПроверкиСредствамиККТ
		И (КонтролироватьСтатусыКодовМаркировки Или КонтролироватьВладельцевКодовМаркировки));
	
	Элементы.ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП.Доступность = КонтрольСтатусовТабачнойПродукцииВедется;
	Элементы.ПараметрыИгнорированияПроверкиККТНастройка.Видимость = Не ПропускатьПроверкуСредствамиККТ;
	
	УстановитьВидимостьДоступностьОтПроверкиРозничнымМетодом();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьОтПроверкиРозничнымМетодом()
	
	КоличествоВключенныхТоварныхГрупп           = СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницу.Количество();
	ВедетсяУчетТГТребующихОбязательногоКонтроля = КоличествоВключенныхТоварныхГрупп > 0;
	
	Элементы.ГруппаОписаниеСеройЗоны.Видимость = ВедетсяУчетТГТребующихОбязательногоКонтроля
		И Не ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТП
		И Не ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП;
	
	Если ВедетсяУчетТГТребующихОбязательногоКонтроля Тогда
	
		ТекстСеройЗоны = НСтр("ru = 'Проверка на вхождение в серую зону будет проводиться при розничных продажах.'");
		Элементы.КомментарийОСеройЗоне.Заголовок = ТекстСеройЗоны;
		
	КонецЕсли;
	
КонецПроцедуры

#Область АварийныйРежим

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиАварийногоРежима(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПослеЗакрытияФормы   = Новый ОписаниеОповещения("ПослеОбработкиФормыУточненияАварийногоРежима", ЭтотОбъект);
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ВключитьАварийныйРежим" Тогда
		
		ОткрытьФорму("ОбщаяФорма.АварийныйРежимИСМП",
			Новый Структура("АварийныйРежимВключен", Ложь),,,,,
			ПослеЗакрытияФормы,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ИзменитьВремяОкончанияАварийногоРежима" Тогда
		
		ОткрытьФорму("ОбщаяФорма.АварийныйРежимИСМП", 
			Новый Структура("АварийныйРежимВключен, АварийныйРежимДо", ПараметрыАварийногоРежима.Включено, МестноеВремя(ПараметрыАварийногоРежима.ДатаОкончания)),
			,,,,
			ПослеЗакрытияФормы,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтключитьАварийныйРежим" Тогда
		
		ОбщегоНазначенияИСМПВызовСервера.ОтключитьАварийныйРежимРазрешительнойСистемы();
		
		ПараметрыАварийногоРежима = ПолучитьПараметрыАварийногоРежима();
		ОбновитьПредставлениеАварийногоРежима();
		Оповестить("ИзменениеАктивностиАварийногоРежимаИСМП");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаОжиданияЗавершенияАварийногоРежима()
	
	ПараметрыАварийногоРежима = ПолучитьПараметрыАварийногоРежима();
	ОбновитьПредставлениеАварийногоРежима();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыАварийногоРежима()
	
	ПараметрыАварийногоРежима = ОбщегоНазначенияИСМППовтИсп.ДанныеНастройкиАварийногоРежима();
	
	Возврат ПараметрыАварийногоРежима;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПредставлениеАварийногоРежима()
	
	ОтключитьОбработчикОжидания("Подключаемый_ОбработкаОжиданияЗавершенияАварийногоРежима");
	
	ДанныеОсновнойЧасти = Новый Массив();
	
	Если ПараметрыАварийногоРежима.Включено Тогда
		
		Если ЗначениеЗаполнено(ПараметрыАварийногоРежима.ДатаОкончания) Тогда
			ДатаЗавершенияАварийногоРежима = МестноеВремя(ПараметрыАварийногоРежима.ДатаОкончания);
		КонецЕсли;
		
		ДатаТекущая = МестноеВремя(ОбщегоНазначенияКлиент.ДатаУниверсальная());
		
		Если ДатаТекущая < ДатаЗавершенияАварийногоРежима Тогда
		
			ДанныеОсновнойЧасти.Добавить(НСтр("ru='Аварийный режим установлен до'"));
			ДанныеОсновнойЧасти.Добавить(" ");
			
			Если НачалоДня(ДатаТекущая) <> НачалоДня(ДатаЗавершенияАварийногоРежима) Тогда
				ПредставлениеДаты = СтрШаблон(
					" (%1)",
					Формат(ДатаЗавершенияАварийногоРежима, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
			
			ПредставлениеВремени = СтрШаблон(
				"%1%2",
				Формат(ДатаЗавершенияАварийногоРежима, "ДФ=HH:mm;"),
				ПредставлениеДаты);
			
			Если ЭтоПолноправныйПользователь Тогда
				ДанныеОсновнойЧасти.Добавить(
					Новый ФорматированнаяСтрока(
						ПредставлениеВремени,,
						ЦветГиперссылки,,
						"ИзменитьВремяОкончанияАварийногоРежима"));
				
				ПодключитьОбработчикОжидания(
					"Подключаемый_ОбработкаОжиданияЗавершенияАварийногоРежима",
					(ДатаЗавершенияАварийногоРежима - ДатаТекущая) + 10,
					Истина);
				
				ДанныеОсновнойЧасти.Добавить(" ");
				ДанныеОсновнойЧасти.Добавить(
					Новый ФорматированнаяСтрока(
						НСтр("ru='Отключить'"),,
						ЦветГиперссылки,,
						"ОтключитьАварийныйРежим"));
			КонецЕсли;
			
			ШаблонСтроки = НСтр("ru = 'Установлен аварийный режим до %1'");
			Элементы.НадписьАварийныйРежим.Заголовок = СтрШаблон(ШаблонСтроки, ПредставлениеВремени);
			
		Иначе
			
			ПараметрыАварийногоРежима.Включено = Ложь;
			
			ДанныеОсновнойЧасти.Добавить(НСтр("ru='Аварийный режим не включен.'"));
			
			Если ЭтоПолноправныйПользователь Тогда
				ДанныеОсновнойЧасти.Добавить(" ");
				ДанныеОсновнойЧасти.Добавить(
					Новый ФорматированнаяСтрока(
						НСтр("ru='Включить'"),,
						ЦветГиперссылки,,
						"ВключитьАварийныйРежим"));
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ДанныеОсновнойЧасти.Добавить(НСтр("ru='Аварийный режим не включен.'"));
		Если ЭтоПолноправныйПользователь Тогда
			ДанныеОсновнойЧасти.Добавить(" ");
			ДанныеОсновнойЧасти.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru='Включить'"),,
					ЦветГиперссылки,,
					"ВключитьАварийныйРежим"));
		КонецЕсли;
		
	КонецЕсли;
	
	ПредставлениеАварийногоРежима = Новый ФорматированнаяСтрока(ДанныеОсновнойЧасти);
	
	Элементы.ГруппаОтображениеАварийногоРежима.Видимость = ПараметрыАварийногоРежима.Включено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбработкиФормыУточненияАварийногоРежима(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("АктивностьРежима") Тогда
		
		Если Результат.АктивностьРежима Тогда
			// включение аварийного режима
			ОбщегоНазначенияИСМПВызовСервера.ВключитьАварийныйРежимРазрешительнойСистемы(Результат.СрокДействияВЧасах);
			
		Иначе
			// отключение аварийного режима
			ОбщегоНазначенияИСМПВызовСервера.ОтключитьАварийныйРежимРазрешительнойСистемы();
			
		КонецЕсли;
		
		ПараметрыАварийногоРежима = ПолучитьПараметрыАварийногоРежима();
		ОбновитьПредставлениеАварийногоРежима();
		Оповестить("ИзменениеАктивностиАварийногоРежимаИСМП");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаЭлементаКонструктора

&НаКлиенте
Процедура ОткрытьНастройкуЭлементаКонструктора(ИмяЭлемента)
	
	ЭлементКонструктора = НастройкаПараметровСканированияСлужебныйКлиентСервер.КонвертироватьИмяЭлементаЭлементКонструктора(ИмяЭлемента);
	Если ЭлементКонструктора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ЭлементКонструктора", ЭлементКонструктора);
	
	ОткрытьФорму(
		"Обработка.ПанельАдминистрированияИСМП.Форма.НастройкаИсключений",
		ПараметрыОткрытияФормы,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("НастройкаЭлементаКонструктораЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЭлементаКонструктораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НастроитьФормуПриИзменииЭлементовУправления();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьФормуВыбораВидаПродукцииПриДобавлении()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТолькоВыключенные",  Истина);
	ПараметрыОткрытия.Вставить("ОтборПоПодсистеме",  "ГИСМТ");
	ПараметрыОткрытия.Вставить("РежимВыбора",        Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	ПараметрыОткрытия.Вставить("ЭлементКонструктораДляОпределенияДоступныхВидовПродукции",
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ"));
	
	ОткрытьФорму(
		"Справочник.ВидыПродукцииИС.Форма.ФормаВыбора", ПараметрыОткрытия,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ЗавершениеДобавленияМаркируемойПродукции", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция НачатьЗагрузкуКлассификатораНастроекВидовПродукции()
	
	Возврат ОбщегоНазначенияИС.НачатьЗагрузкуКлассификатораНастроекВидовПродукции(УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузкаКлассификатораНастроекЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатЗагрузки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если РезультатЗагрузки.ЕстьОшибки Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗагрузки.ТекстОшибки);
		Иначе
			ОткрытьФормуВыбораВидаПродукцииПриДобавлении();
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#Область СинхронизацияТоварныхГрупп

&НаКлиенте
Процедура ВыполнитьСинхронизацияТоварныхГрупп()
	
	ДоступныеОрганизации = ДоступныеОрганизации();
	Если ДоступныеОрганизации.Количество() = 0 Тогда
		ПоказатьПредупреждение(,
			НСтр("ru = 'Отсутствуют организации по которым возможно обращение в ФГИС ""Честный знак""'"));
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если ДоступныеОрганизации.Количество() > 1 Тогда
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Организации", ДоступныеОрганизации);
		ОткрытьФорму(
			"Обработка.ПанельАдминистрированияИСМП.Форма.ФормаВыбораСпискаОрганизацийИСМП", ПараметрыОткрытияФормы,
			ЭтотОбъект, , , , Новый ОписаниеОповещения("ПослеВыбораОрганизации", ЭтотОбъект));
	Иначе
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ВопросЗагрузкаОстатковПоКодамМаркировкиЗавершение",
			ЭтотОбъект, Новый Структура("ДоступныеОрганизации", ДоступныеОрганизации));
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Загрузить остатки по кодам маркировки по организации %1?'"), ДоступныеОрганизации[0]);
		
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОрганизации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено
		И Результат.Количество() Тогда
		ПараметрыОбработки = ПараметрыОбработкиТоварныхГруппПоОрганизации(Результат);
		
		Для Каждого КлючИЗначение Из Результат Цикл
			Организация = КлючИЗначение.Ключ;
			Прервать;
		КонецЦикла;
		
		ВыполнитьСинхронизацияТоварныхГруппПоОрганизации(Организация, ПараметрыОбработки);
		
		Если ЭтоРасширеннаяВерсияГосИС Тогда
			ЗагрузитьОстаткиПоНоменклатуре(ПараметрыОбработки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыОбработкиТоварныхГруппПоОрганизации(Организации)
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ТекущаяОрганизация");
	ВозвращаемоеЗначение.Вставить("Форма",                ЭтотОбъект);
	ВозвращаемоеЗначение.Вставить("ДанныеПоОрганизациям", Новый Соответствие());
	
	Для Каждого Организация Из Организации Цикл
		РезультатыВыбора    = Организация.Значение;
		ДанныеПоОрганизации = Новый Структура;
		
		ДанныеПоОрганизации.Вставить("Обработано", Ложь);
		ДанныеПоОрганизации.Вставить("ЗагружатьНоменклатуру", РезультатыВыбора.ЗагружатьНоменклатуру);
		ДанныеПоОрганизации.Вставить("ТоварныеГруппы",        Новый Массив);
		
		ВозвращаемоеЗначение.ДанныеПоОрганизациям[Организация.Ключ] = ДанныеПоОрганизации;
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьСинхронизацияТоварныхГруппПоОрганизации(Организация, ПараметрыОбработки)
	
	ПараметрыОбработки.ТекущаяОрганизация = Организация;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ТоварныеГруппыОрганизацииЗавершение", ЭтотОбъект, ПараметрыОбработки);
	
	ПараметрыЗапроса = ИнтерфейсИСМПОбщегоНазначенияКлиент.ПараметрыЗапросаДанных();
	ПараметрыЗапроса.Организация             = Организация;
	ПараметрыЗапроса.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыЗапроса.ОповещениеОЗавершении   = ОповещениеОЗавершении;
	
	ИнтерфейсИСМПОбщегоНазначенияКлиент.ТоварныеГруппыОрганизации(ПараметрыЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныеГруппыОрганизацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.ЕстьОшибки Тогда
		ОбщегоНазначенияИСКлиент.СообщитьПользователюВФорму(
			ДополнительныеПараметры.Форма.УникальныйИдентификатор,
			Результат.ТекстОшибки);
	Иначе
		ТоварныеГруппы = Результат.Результат.ТоварныеГруппы;
		ЗагрузитьПолученныеТоварныеГруппы(ТоварныеГруппы);
		ДополнительныеПараметры.ДанныеПоОрганизациям[ДополнительныеПараметры.ТекущаяОрганизация].ТоварныеГруппы = ТоварныеГруппы;
	КонецЕсли;
	
	ДополнительныеПараметры.ДанныеПоОрганизациям[ДополнительныеПараметры.ТекущаяОрганизация].Обработано = Истина;
	
	Для Каждого КлючИЗначение Из ДополнительныеПараметры.ДанныеПоОрганизациям Цикл
		
		Если Не КлючИЗначение.Значение.Обработано Тогда
			ВыполнитьСинхронизацияТоварныхГруппПоОрганизации(КлючИЗначение.Ключ, ДополнительныеПараметры);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступныеОрганизации()
	
	Возврат ОбщегоНазначенияИС.ДоступныеОрганизации().ВыгрузитьЗначения();
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПолученныеТоварныеГруппы(ТоварныеГруппы)
	
	ПараметрыЗаписи = АдминистрированиеИСМПКлиентСервер.ПараметрыЗаписиМаркируемойПродукции();
	ПараметрыЗаписи.ЗаписыватьВидПродукции = Истина;
	
	Для Каждого ВидПродукции Из ОтключенныеВидыПродукции(ТоварныеГруппы) Цикл
		СтрокаДанных = АдминистрированиеИСМПКлиентСервер.СтрокаДанныхЗаписиМаркируемойПродукции();
		СтрокаДанных.ВидПродукции = ВидПродукции;
		СтрокаДанных.ВидПродукцииВерхнегоУровня = Истина;
		ПараметрыЗаписи.Данные.Добавить(СтрокаДанных);
	КонецЦикла;
	
	Если ПараметрыЗаписи.Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗаписи = ЗаписатьДанныеМаркируемойПродукции(ПараметрыЗаписи);
	
	Если ЗначениеЗаполнено(РезультатЗаписи) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗаписи);
	Иначе
		ЗаполнитьМаркируемуюПродукцию();
		ПослеРедактированияСпискаМаркируемойПродукции();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтключенныеВидыПродукции(ТоварныеГруппы)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТоварныеГруппы", ТоварныеГруппы);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗначенияТоварныеГруппы.ВидПродукции
	|ИЗ
	|	Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции,
	|			ЗначенияЭлементовКонструктора.Значение КАК ТоварнаяГруппа
	|		ИЗ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|			ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
	|			И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|		ГДЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ)
	|			И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
	|		ОБЪЕДИНИТЬ
	|		ВЫБРАТЬ ЗначенияПользователяЭлементовКонструктора.ВидПродукции,
	|			ЗначенияПользователяЭлементовКонструктора.Значение
	|		ИЗ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|		ГДЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ)
	|			И НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
	|		) КАК ЗначенияТоварныеГруппы
	|	ПО ТоварныеГруппыГИСМТ.Ссылка = ЗначенияТоварныеГруппы.ТоварнаяГруппа
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции
	|		ИЗ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|		ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
	|		И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|		ГДЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ)
	|			И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
	|		ОБЪЕДИНИТЬ
	|		ВЫБРАТЬ ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|		ИЗ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|		ГДЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ)
	|			И НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
	|		) КАК ЗначенияВидыПродукции
	|	ПО ЗначенияТоварныеГруппы.ВидПродукции = ЗначенияВидыПродукции.ВидПродукции
	|ГДЕ
	|	ТоварныеГруппыГИСМТ.Имя В (&ТоварныеГруппы)
	|	И ЗначенияВидыПродукции.ВидПродукции ЕСТЬ NULL";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидПродукции");
	
КонецФункции

&НаКлиенте
Процедура ВопросЗагрузкаОстатковПоКодамМаркировкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеОрганизации = ДополнительныеПараметры.ДоступныеОрганизации;
	
	ПараметрыОрганизаций = Новый Соответствие;
	
	СтруктураОрганизации = Новый Структура;
	СтруктураОрганизации.Вставить("ЗагружатьТоварныеГруппы", Истина);
	СтруктураОрганизации.Вставить("ЗагружатьНоменклатуру",   Ложь);
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СтруктураОрганизации.ЗагружатьНоменклатуру = Истина;
	КонецЕсли;
	
	ПараметрыОрганизаций.Вставить(ДоступныеОрганизации[0], СтруктураОрганизации);
	
	ПараметрыОбработки = ПараметрыОбработкиТоварныхГруппПоОрганизации(ПараметрыОрганизаций);
	ВыполнитьСинхронизацияТоварныхГруппПоОрганизации(ДоступныеОрганизации[0], ПараметрыОбработки);
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗагрузитьОстаткиПоНоменклатуре(ПараметрыОбработки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаОстатков

&НаКлиенте
Процедура ЗагрузитьОстаткиПоНоменклатуре(ОрганизацииДляЗагрузкиОстатков)
	
	ВидыПродукцииОСУ  = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииОбъемноСортовогоУчета();
	ТоварныеГруппыОСУ = Новый ФиксированныйМассив(
		КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ"),
			ВидыПродукцииОСУ));
			
	ДанныеПоОрганизациям = ОрганизацииДляЗагрузкиОстатков.ДанныеПоОрганизациям;
	
	Для каждого ДанныеПоОрганизации Из ДанныеПоОрганизациям Цикл
		Организация = ДанныеПоОрганизации.Ключ;
		ПараметрыОрганизации = ДанныеПоОрганизации.Значение;
		
		Если ПараметрыОрганизации.ЗагружатьНоменклатуру Тогда
			//@skip-check query-in-loop
			ПодготовитьСообщенияЗагрузкиОстатков(Организация, ПараметрыОрганизации.ТоварныеГруппы, ТоварныеГруппыОСУ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьСообщенияЗагрузкиОстатков(Организация, ТоварныеГруппы, ТоварныеГруппыОСУ)
	
	СписокТоварныхГрупп    = ТоварныеГруппыПоИмени(ТоварныеГруппы);
	СписокТоварныхГруппОСУ = Новый Массив;
	
	Если ТоварныеГруппыОСУ.Количество() Тогда
		Для Каждого ТоварнаяГруппа Из СписокТоварныхГрупп Цикл
			Если ТоварныеГруппыОСУ.Найти(ТоварнаяГруппа) <> Неопределено Тогда
				СписокТоварныхГруппОСУ.Добавить(ТоварнаяГруппа);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыОбработкиДокументов = ОбменДаннымиИСМПКлиентСервер.ПараметрыОбработкиДокументов();
	ПараметрыОбработкиДокументов.Ссылка             = ПредопределенноеЗначение("Документ.ОтчетИСМП.ПустаяСсылка");
	ПараметрыОбработкиДокументов.Организация        = Организация;
	ПараметрыОбработкиДокументов.ДальнейшееДействие = ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеОтчет");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗагрузкаОстатков",  Истина);
	ДополнительныеПараметры.Вставить("ТоварныеГруппы",    СписокТоварныхГрупп);
	ДополнительныеПараметры.Вставить("ТоварныеГруппыОСУ", СписокТоварныхГруппОСУ);
		
	Если ДополнительныеПараметры.ТоварныеГруппы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработкиДокументов.ДополнительныеПараметры = ДополнительныеПараметры;
	
	ОписаниеПриЗавершении = Новый ОписаниеОповещения(
		"Подключаемый_ПриЗавершенииОперации", ЭтотОбъект, ПараметрыОбработкиДокументов);
	
	ОбменДаннымиИСМПКлиент.ПодготовитьКПередаче(
		ЭтотОбъект,
		ПараметрыОбработкиДокументов,
		ОписаниеПриЗавершении);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТоварныеГруппыПоИмени(СписокИмен)
	
	ТоварныеГруппы = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварныеГруппыГИСМТ.Ссылка
	|ИЗ
	|	Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
	|ГДЕ
	|	ТоварныеГруппыГИСМТ.Имя В (&СписокИмен)";
	Запрос.УстановитьПараметр("СписокИмен", СписокИмен);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТоварныеГруппы.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат ТоварныеГруппы;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПриЗавершенииОперации(Результат, ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьФормуПросмотраИАктуализацииТокеновАвторизации(ТипТокенаАвторизации)
	
	Если ЗначениеЗаполнено(ТипТокенаАвторизации) Тогда
		СтруктураПараметров = Новый Структура("ТипТокенаАвторизации", ТипТокенаАвторизации);
	КонецЕсли;
	
	ОткрытьФорму(
		"РегистрСведений.ДанныеКлючаСессииИСМП.Форма.ФормаПросмотраИАктуализацииТокеновАвторизации",
		СтруктураПараметров,,
		Новый УникальныйИдентификатор());
	
КонецПроцедуры

#КонецОбласти
