#Область ПрограммныйИнтерфейс

// Обновить команды.
// 
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - Форма
//  Источник - Неопределено - Источник
Процедура ОбновитьКоманды(Форма, Источник) Экспорт
	Попытка
#Если Сервер Тогда
		ОМПодключаемыеКомандыКлиентСервер = КонтурЗакупки_ОбщегоНазначения.ОбщийМодуль(
				"ПодключаемыеКомандыКлиентСервер");
#Иначе
			ОМПодключаемыеКомандыКлиентСервер = КонтурЗакупки_ОбщегоНазначенияКлиент.ОбщийМодуль(
				"ПодключаемыеКомандыКлиентСервер");
#КонецЕсли
		ОМПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(Форма, Источник);
	Исключение
		;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти