Функция ЗакладкаВВебеПоТрн(ДокументЭтрн) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние КАК Состояние,
	               |	КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние.Код КАК СостояниеКод
	               |ИЗ
	               |	РегистрСведений.КонтурЛогистика_ДвижениеДокументооборота.СрезПоследних(, Документ = &Документ) КАК КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних";
	
	Запрос.УстановитьПараметр("Документ", ДокументЭтрн);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Если Статусы1сНЕОтгруженныеВВебеЛогистики().Найти(Выборка.СостояниеКод) <> Неопределено Тогда
			Возврат "sign";
		ИначеЕсли Статусы1сАрхивныеВВебеЛогистики().Найти(Выборка.СостояниеКод) <> Неопределено Тогда
			Возврат "archive";
		Иначе
			Возврат "shipped";
		КонецЕсли;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Функция Статусы1сНЕОтгруженныеВВебеЛогистики()
	
	НЕОтгруженные = Новый Массив;
	НЕОтгруженные.Добавить("new");
	НЕОтгруженные.Добавить("wait-mintrans-api");
	НЕОтгруженные.Добавить("r-wait-storekeeper");
	НЕОтгруженные.Добавить("r-wait-consignor-sign");
	НЕОтгруженные.Добавить("r-consignor-signed");
	НЕОтгруженные.Добавить("r-wait-driver-draftApprove");
	НЕОтгруженные.Добавить("r-wait-driver-approve");
	НЕОтгруженные.Добавить("r-wait-carrier-sign");
	
	Возврат НЕОтгруженные; 
	
КонецФункции

Функция Статусы1сАрхивныеВВебеЛогистики()
	
	Архивные = Новый Массив;
	Архивные.Добавить("r-rejected");
	Архивные.Добавить("d-rejected");
	Архивные.Добавить("revoked");
	Архивные.Добавить("completed");
	
	Возврат Архивные; 
	
КонецФункции

Функция ПолучитьСтатус(Документ, НовыйДляПустого = Ложь) Экспорт
	
	// падают дымовые тесты, если Состояния ДО еще не загружены
	// Загрузим, если не загружены
	ЗагрузитьСостоянияДО(); 
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		
		Если НовыйДляПустого Тогда
			Возврат Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("new");
		Иначе
			Возврат Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
	СрезПоследних = СрезПоследних(, Новый Структура("Документ", Документ));
	Если СрезПоследних.Количество() > 0 Тогда
		Возврат СрезПоследних[0].Состояние;
	КонецЕсли;
		
	Если НовыйДляПустого Тогда
		Возврат Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("new");
	КонецЕсли;
	
	Возврат Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ПустаяСсылка();
	
КонецФункции

Процедура ОтметитьДокументыРаспечатанными(МассивДокументов) Экспорт 
	
	СостояниеРаспечатать 		= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1НастройкаСостояниеРаспечатать");
	НастройкаВыводитьЗадачуРаспечатать 	= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ВыводитьЗадачуРаспечатать");
	
	Если НастройкаВыводитьЗадачуРаспечатать = Истина 
		И ЗначениеЗаполнено(СостояниеРаспечатать) Тогда 
		
		ДокументыРаспечатать = Новый Массив;
		
		ТекСостояния = ПолучитьТаблицуСостонийПоДокументам(МассивДокументов);
		
		Для Каждого ТекСостояние Из ТекСостояния Цикл 
			
			Если Не ТипЗнч(ТекСостояние.ДокументТитул) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1")
				Или Не ЗначениеЗаполнено(ТекСостояние.Состояние) 
				Или Не ЗначениеЗаполнено(ТекСостояние.ТребуемоеДействиеТ1) Тогда 
				Продолжить;
			КонецЕсли;	
			
			Если ТекСостояние.Состояние = СостояниеРаспечатать Тогда 
				ДокументыРаспечатать.Добавить(ТекСостояние.ДокументТитул);
			КонецЕсли;
			
		КонецЦикла;	
						
		РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатусыДокументам(ДокументыРаспечатать, 
			Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан, Истина, Истина);		
		
	КонецЕсли;

КонецПроцедуры	

Функция ПолучитьТаблицуСостонийПоДокументам(Знач МассивДокСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1.Ссылка КАК ДокументТитул,
	|	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН КАК ДокументЭТРН
	|ПОМЕСТИТЬ ВТ_ПереданныеДокументы
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул1.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул2.Ссылка,
	|	КонтурЛогистика_ТрН_Титул2.ДокументЭТРН
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2 КАК КонтурЛогистика_ТрН_Титул2
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул2.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул3.Ссылка,
	|	КонтурЛогистика_ТрН_Титул3.ДокументЭТРН
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул3 КАК КонтурЛогистика_ТрН_Титул3
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул3.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул4.Ссылка,
	|	КонтурЛогистика_ТрН_Титул4.ДокументЭТРН
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул4 КАК КонтурЛогистика_ТрН_Титул4
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул4.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул5.Ссылка,
	|	КонтурЛогистика_ТрН_Титул5.ДокументЭТРН
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул5 КАК КонтурЛогистика_ТрН_Титул5
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул5.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул6.Ссылка,
	|	КонтурЛогистика_ТрН_Титул6.ДокументЭТРН
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул6 КАК КонтурЛогистика_ТрН_Титул6
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул6.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул7.Ссылка,
	|	КонтурЛогистика_ТрН_Титул7.ДокументЭТРН
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул7 КАК КонтурЛогистика_ТрН_Титул7
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул7.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул8.Ссылка,
	|	КонтурЛогистика_ТрН_Титул8.ДокументЭТРН
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул8 КАК КонтурЛогистика_ТрН_Титул8
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул8.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПереданныеДокументы.ДокументТитул КАК ДокументТитул,
	|	ЕСТЬNULL(КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние, ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_СостоянияДвиженияДокументооборота.ПустаяСсылка)) КАК Состояние,
	|	ЕСТЬNULL(КонтурЛогистика_СостоянияДвиженияДокументооборота.ТребуемоеДействиеТ1, """") КАК ТребуемоеДействиеТ1,
	|	ЕСТЬNULL(КонтурЛогистика_СостоянияДвиженияДокументооборота.ТребуемоеДействиеТ2, """") КАК ТребуемоеДействиеТ2,
	|	ЕСТЬNULL(КонтурЛогистика_СостоянияДвиженияДокументооборота.ТребуемоеДействиеТ3, """") КАК ТребуемоеДействиеТ3,
	|	ЕСТЬNULL(КонтурЛогистика_СостоянияДвиженияДокументооборота.ТребуемоеДействиеТ4, """") КАК ТребуемоеДействиеТ4,
	|	ЕСТЬNULL(КонтурЛогистика_СостоянияДвиженияДокументооборота.ТребуемоеДействиеТ5, """") КАК ТребуемоеДействиеТ5,
	|	ЕСТЬNULL(КонтурЛогистика_СостоянияДвиженияДокументооборота.ТребуемоеДействиеТ6, """") КАК ТребуемоеДействиеТ6
	|ИЗ
	|	ВТ_ПереданныеДокументы КАК ВТ_ПереданныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_ДвижениеДокументооборота.СрезПоследних(
	|				,
	|				Документ В
	|					(ВЫБРАТЬ
	|						ВТ.ДокументЭТРН КАК ДокументЭТРН
	|					ИЗ
	|						ВТ_ПереданныеДокументы КАК ВТ)) КАК КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_СостоянияДвиженияДокументооборота КАК КонтурЛогистика_СостоянияДвиженияДокументооборота
	|			ПО КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние = КонтурЛогистика_СостоянияДвиженияДокументооборота.Ссылка
	|		ПО ВТ_ПереданныеДокументы.ДокументЭТРН = КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Документ";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокСсылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьСостояние(Документ, Состояние, Период = Неопределено, УказатьПользователя = Ложь, ОтвСторона = Неопределено, ДопДанные = Неопределено) Экспорт
	
	Если Состояние = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ПустаяСсылка() Тогда
		Возврат; // исключительная ситуация
	КонецЕсли;
	
	Запись = СоздатьМенеджерЗаписи();
	
	Запись.Документ = Документ;
	Запись.Период 	= ?(Период = Неопределено, КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ТекущийМоментВремени(), Период);
	
	Если ТипЗнч(Состояние) = Тип("Строка") Тогда 
		Состояние = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду(Состояние, ОтвСторона);
	КонецЕсли;
	
	НовоеСостояние = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НовоеСостоянийПоУсловиям(Состояние, Документ);
	Если НовоеСостояние = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запись.Состояние = НовоеСостояние;
	
	Если УказатьПользователя = Истина Тогда
		Попытка
			Запись.Пользователь1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С();
		Исключение
			КонтурЛогистика_Метрика.Метрика_Отправить_Ошибку( , "УстановитьСостояние", ОписаниеОшибки(),
				"не смогли определить тек пользователя 1С");
		КонецПопытки;
	КонецЕсли;
	
	// См. ОписаниеДополнительныхДанных()
	Если ДопДанные <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Запись, ДопДанные);
	КонецЕсли;
	
	Запись.Записать(Истина);
	
	// Вызов подключаемого модуля
	ПараметрыПМ = Новый Структура("ДокументЛогистика, Состояние", Документ, Состояние);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ПослеУстановкиСостояния", , ПараметрыПМ);
	
	// Если требуется, то документ добавится в очередь на поиск/создание связанного документа
	РегистрыСведений.КонтурЛогистика_СвязиДокументов.ДобавитьВОчередь(Документ.Ссылка);
	
	// Настройка конвертации регистра сведений
	ЕстьНастройкиКонвертацииРС = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНастройкиКонвертацииРСПоСтатусуДО(Состояние);
	Если ЕстьНастройкиКонвертацииРС Тогда
		КонтурЛогистика_КонвертацияСервер.КонвертироватьПриТриггереПоСтатусуДО(Документ, Состояние);
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеДополнительныхДанных(ФайлОбмена, ИдентификаторСобытия = Неопределено, КаналТранспорта = Неопределено) Экспорт
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("ФайлОбмена", ФайлОбмена);							// Ссылка на файл обмена
	ОписаниеДанных.Вставить("ИдентификаторСобытия", ИдентификаторСобытия);		// Догистика = id, Диадок = EventId
	ОписаниеДанных.Вставить("КаналТранспорта", КаналТранспорта);				// Перечисление.КонтурЛогистика_КаналыТранспорта
	
	Возврат ОписаниеДанных;
	
КонецФункции

Процедура ЗагрузитьСостоянияДО()
	
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗагрузитьСостоянияДО();
	
КонецПроцедуры	

Функция БылоСостояние(ДокументЭТРН, Состояние) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументЭТРН", ДокументЭТРН);
	Запрос.УстановитьПараметр("Состояние", Состояние);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ДвижениеДокументооборота.Документ КАК Документ,
	|	КонтурЛогистика_ДвижениеДокументооборота.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ДвижениеДокументооборота КАК КонтурЛогистика_ДвижениеДокументооборота
	|ГДЕ
	|	КонтурЛогистика_ДвижениеДокументооборота.Документ = &ДокументЭТРН
	|	И КонтурЛогистика_ДвижениеДокументооборота.Состояние = &Состояние";
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции