#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользовательАдминистраторДД = ПользовательЯвляетсяАдминистраторомВДиадок(, СписокОрганизацийСПравамиАдминистратора);
	
КонецПроцедуры
 	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВариантЗагрузки = "ТекущийПользователь";
	ВариантАвторизации = "ЛогинПароль";
	
	ИзменитьПредставлениеТекущегоПользователя();
	
	УправлениеЭлементамиФормы();
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ВариантЗагрузки = "ТекущийПользователь" Тогда		
		ЗагрузитьМЧДДляТекущегоПользователяВФоне();				
	ИначеЕсли ВариантЗагрузки = "ДругойПользователь" Тогда
		
		ПараметрыФоновогоЗадания = Новый Структура;
		ПараметрыФоновогоЗадания.Вставить("Токен", Токен);
		
		ЗагрузитьМЧДДляДругогоПользователяВФоне(ПараметрыФоновогоЗадания);
			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗагрузкиПриИзменении(Элемент)
	
	Если ВариантЗагрузки = "ТекущийПользователь" И ЗначениеЗаполнено(Токен) Тогда
		ТекущийПользовательАдминистраторДД = ПользовательЯвляетсяАдминистраторомВДиадок(, СписокОрганизацийСПравамиАдминистратора);
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
				
КонецПроцедуры

&НаКлиенте
Процедура ВариантАвторизацииПриИзменении(Элемент)
			
	Токен = "";
	АвторизованныйПользовательАдминистраторДД = Ложь;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Авторизоваться(Команда)
	
	АвторизованныйПользовательАдминистраторДД = Ложь;
	
	Если ВариантАвторизации = "ЛогинПароль" Тогда
		
		Токен = КонтурЛогистика_API_Диадок.Диадок_АПИ_Authenticate_ЛогинПароль(Логин, Пароль);
		
		Если ЗначениеЗаполнено(Токен) Тогда
			
			ПараметрыФоновогоЗадания = Новый Структура;
			ПараметрыФоновогоЗадания.Вставить("Токен", Токен);
						
			Элементы.Авторизоваться.Видимость = Ложь;
			
			АвторизованныйПользовательАдминистраторДД = ПользовательЯвляетсяАдминистраторомВДиадок(Токен, СписокОрганизацийСПравамиАдминистратора);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВариантАвторизации = "Сертификат" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ПоказатьВсе", Истина);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
						 "ОбщаяФорма.КонтурЛогистика_ВыборСертификата",
						 ПараметрыФормы,
						 ЭтаФорма,
						 ЭтаФорма,
						 "ОбработчикВыборСертификата");	
						 
	КонецЕсли;
					 
	УправлениеЭлементамиФормы();				 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокОрганизаций(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьИзСпискаПосле", ЭтаФорма);
	СписокОрганизацийСПравамиАдминистратора.ПоказатьВыборЭлемента(ОписаниеОповещения, "");
		
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеСертификатаНажатие(Элемент)
	
	СертификатСсылка = СертификатПоОтпечатку(ОтпечатокСертификата);
	Если ЗначениеЗаполнено(СертификатСсылка) Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(СертификатСсылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Авторизация

Функция ПредставлениеСертификата(ДанныеСертификата)
	
	Представление = "Сертификат: " 
		+ ДанныеСертификата.ДополнительныеПараметры.ДанныеСертификата.Наименование + ", "
		+ ДанныеСертификата.ДополнительныеПараметры.ДанныеСертификата.Представление + ", "
		+ "по " + Формат(ДанныеСертификата.ДополнительныеПараметры.ДанныеСертификата.СрокДействия, "ДФ=dd.MM.yyyy");
	
	Возврат Представление;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикВыборСертификата(ДанныеСертификата, ДопПараметры = Неопределено) Экспорт

	Если ДанныеСертификата <> Неопределено Тогда
		
		ОтпечатокСертификата = ДанныеСертификата.ДополнительныеПараметры.ДанныеСертификата.ОтпечатокСертификата;
		СертификатНаСервере = ДанныеСертификата.ДополнительныеПараметры.ДанныеСертификата.СертификатНаСервере;
		ПредставлениеСертификата = ПредставлениеСертификата(ДанныеСертификата);
		
		#Если Не ТолстыйКлиентОбычноеПриложение И Не ТолстыйКлиентУправляемоеПриложение Тогда
			
			Если СертификатНаСервере Тогда
				
				АвторизацияНаСервере(ОтпечатокСертификата, ПредставлениеСертификата);
				Закрыть();
							
			Иначе
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ОтпечатокСертификата", ОтпечатокСертификата);
				ДополнительныеПараметры.Вставить("ПредставлениеСертификата", ПредставлениеСертификата);
				
				Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСКриптографиейПодключено", ЭтаФорма, ДополнительныеПараметры);	
				НачатьПодключениеРасширенияРаботыСКриптографией(Оповещение);
				
			КонецЕсли;
			
		#Иначе
			
			Если СертификатНаСервере Тогда				
				
				АвторизацияНаСервере(ОтпечатокСертификата, ПредставлениеСертификата);
				Закрыть();
								
			Иначе
				
				АвторизацияНаКлиенте(ОтпечатокСертификата, ПредставлениеСертификата);				
				
			КонецЕсли;			
			
		#КонецЕсли
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияНаКлиенте(ОтпечатокСертификата, ПредставлениеСертификата)
	
	ДвоичныеДанныеСертификата = КонтурЛогистика_КриптографияКлиентСервер.ПолучитьДвоичныеДанныеСертификата(ОтпечатокСертификата);
				
	ЗашифрованныеДвоичныеДанные = ВыполнитьЗапросАвторизации(Base64Строка(ДвоичныеДанныеСертификата));
	
	РасшифрованныеДвоичныеДанные = КонтурЛогистика_КриптографияКлиентСервер.РасшифроватьДанные(ЗашифрованныеДвоичныеДанные, , , Истина);
			
	Токен = ПолучитьТокен(Base64Строка(РасшифрованныеДвоичныеДанные), ОтпечатокСертификата);
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Токен", Токен);
			
	Элементы.Авторизоваться.Видимость = Ложь;
	АвторизованныйПользовательАдминистраторДД = ПользовательЯвляетсяАдминистраторомВДиадок(Токен, СписокОрганизацийСПравамиАдминистратора);
	
	Элементы.ПредставлениеСертификата.Заголовок = ПредставлениеСертификата;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура АвторизацияНаСервере(ОтпечатокСертификата, ПредставлениеСертификата)
	
	ДвоичныеДанныеСертификата = КонтурЛогистика_КриптографияСервер.ПолучитьДвоичныеДанныеСертификата(ОтпечатокСертификата);
				
	ЗашифрованныеДвоичныеДанные = ВыполнитьЗапросАвторизации(Base64Строка(ДвоичныеДанныеСертификата));
	
	РасшифрованныеДвоичныеДанные = КонтурЛогистика_КриптографияСервер.РасшифроватьДанные(ЗашифрованныеДвоичныеДанные, , , Истина);
			
	Токен = ПолучитьТокен(Base64Строка(РасшифрованныеДвоичныеДанные), ОтпечатокСертификата);
	
	Элементы.ПредставлениеСертификата.Заголовок = ПредставлениеСертификата;
		
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапросАвторизации(ДвоичныеДанныеСертификата)
	
	Ядро = КонтурЛогистика_API_Диадок.Ядро();
	
	ПараметрыСервиса = Ядро.ПараметрыСервиса_Диадок();
	ПараметрыСервиса.Вставить("Токен", Токен);
	
	Ответ = Ядро.АПИ_Authenticate(ПараметрыСервиса, ДвоичныеДанныеСертификата);
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПолучитьТокен(РасшифрованныеДвоичныеДанные, ОтпечатокСертификата)
	
	Ядро = КонтурЛогистика_API_Диадок.Ядро();
	
	ПараметрыСервиса = Ядро.ПараметрыСервиса_Диадок();
	ПараметрыСервиса.Вставить("Токен", Токен);
	
	Ответ = Ядро.АПИ_AuthenticateConfirm(ПараметрыСервиса, РасшифрованныеДвоичныеДанные, ОтпечатокСертификата);
	
	Возврат Ответ;
	
КонецФункции

&НаКлиенте
Процедура РасширениеРаботыСКриптографиейПодключено(Подключено, ДополнительныеПараметры) Экспорт
 
	Если НЕ Подключено Тогда	 
		НачатьУстановкуРасширенияРаботыСКриптографией(Неопределено);
		Возврат;		  
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьДанныеСертификатаЗавершение", ЭтаФорма, ДополнительныеПараметры);
	КонтурЛогистика_КриптографияКлиент.ПолучитьДанныеСертификата(Оповещение, ДополнительныеПараметры.ОтпечатокСертификата, "", "");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеСертификатаЗавершение(ДвоичныеДанныеСертификата, ДополнительныеПараметры) Экспорт
	
	ЗашифрованныеДвоичныеДанные = ВыполнитьЗапросАвторизации(Base64Строка(ДвоичныеДанныеСертификата));
	
	Оповещение = Новый ОписаниеОповещения("РасшифроватьДанныеЗавершение", ЭтаФорма, ДополнительныеПараметры);
	КонтурЛогистика_КриптографияКлиент.РасшифроватьДанныеАсинхронно(Оповещение, ЗашифрованныеДвоичныеДанные, , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьДанныеЗавершение(РасшифрованныеДвоичныеДанные, ДополнительныеПараметры) Экспорт
	
	Токен = ПолучитьТокен(Base64Строка(РасшифрованныеДвоичныеДанные), ДополнительныеПараметры.ОтпечатокСертификата);
			
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Токен", Токен);
			
	Элементы.Авторизоваться.Видимость = Ложь;
	АвторизованныйПользовательАдминистраторДД = ПользовательЯвляетсяАдминистраторомВДиадок(Токен, СписокОрганизацийСПравамиАдминистратора);
	
	Элементы.ПредставлениеСертификата.Заголовок = ДополнительныеПараметры.ПредставлениеСертификата;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	Элементы.Авторизоваться.Видимость = Истина;
	Элементы.Загрузить.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	Элементы.Авторизоваться.Видимость = Истина;
	Элементы.Загрузить.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Если ВариантЗагрузки = "ТекущийПользователь" Тогда
		
		Элементы.Загрузить.Видимость = Истина;
		Элементы.ГруппаДругойПользователь.Видимость = Ложь;
		Элементы.ВариантАвторизации.Видимость = Ложь;
		Элементы.ГруппаОписание.Видимость = Истина;
		
		Элементы.ТекстОписание.Заголовок = ТекстОписания(ТекущийПользовательАдминистраторДД);	
						
	ИначеЕсли ВариантЗагрузки = "ДругойПользователь" Тогда
		
		Элементы.Загрузить.Видимость = Ложь;
		Элементы.ВариантАвторизации.Видимость = Истина;
		Элементы.ГруппаДругойПользователь.Видимость = Истина;
		
		Элементы.Загрузить.Видимость = ЗначениеЗаполнено(Токен);
		Элементы.Авторизоваться.Видимость = Не ЗначениеЗаполнено(Токен);
		Элементы.ГруппаОписание.Видимость = ЗначениеЗаполнено(Токен);
		
		Если ВариантАвторизации = "ЛогинПароль" Тогда			
			Элементы.ГруппаЛогинПароль.Видимость = Истина;
		ИначеЕсли ВариантАвторизации = "Сертификат" Тогда
			Элементы.ГруппаЛогинПароль.Видимость = Ложь;
		КонецЕсли;
		
		Элементы.ТекстОписание.Заголовок = ТекстОписания(АвторизованныйПользовательАдминистраторДД);
		Элементы.ГруппаСертификат.Видимость = ЗначениеЗаполнено(Токен);
		
	КонецЕсли;
	
	Элементы.ПоказатьСписокОрганизаций.Видимость = СписокОрганизацийСПравамиАдминистратора.Количество() > 0;
		
КонецПроцедуры
	
&НаКлиенте
Функция ТекстОписания(ПользовательЯвляетсяАдминистраторомДД)
	
	Если ПользовательЯвляетсяАдминистраторомДД Тогда
		Возврат "Пользователь является администратором для одной или нескольких организаций в Диадоке. Будут загружены МЧД всех пользователей для организаций с признаком ""Наша""";		
	Иначе
		Возврат "Загрузим МЧД, привязанные к этому пользователю в Диадок в Наших организациях.";	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПользовательЯвляетсяАдминистраторомВДиадок(ТокенАвторизации = Неопределено, СписокОрганизаций)
	
	СписокОрганизаций.Очистить();
	
	НашиОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
	Для Каждого Орг Из НашиОрганизации Цикл
		
		Попытка
			
			Ядро = КонтурЛогистика_API_Диадок.Ядро();
			ПараметрыСервиса = КонтурЛогистика_API_Диадок.ЛогистикаПараметрыСервиса_Диадок(Орг.ID);
			
			Если ЗначениеЗаполнено(ТокенАвторизации) Тогда			
				ПараметрыСервиса.Вставить("Токен", Токен);
				ДанныеСотрудника = Ядро.АПИ_GetMyEmployee(ПараметрыСервиса, Орг.ID);
			Иначе
				ДанныеСотрудника = Ядро.АПИ_GetMyEmployee(ПараметрыСервиса, Орг.ID);
			КонецЕсли;
			
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Продолжить;
		КонецПопытки;
		
		Если ДанныеСотрудника.Свойство("Permissions") И ДанныеСотрудника.Permissions.IsAdministrator Тогда
			СписокОрганизаций.Добавить(Орг);			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ПоказатьСписокОрганизаций.Заголовок = "Список организаций (" + Строка(СписокОрганизаций.Количество()) + ")";
	
	Возврат СписокОрганизаций.Количество() > 0;
			
КонецФункции

&НаКлиенте
Процедура ИзменитьПредставлениеТекущегоПользователя()
	
	ТекущийПользователь = Элементы.ВариантЗагрузки.СписокВыбора.НайтиПоЗначению("ТекущийПользователь");
	Если ТекущийПользователь <> Неопределено Тогда
		ТекущийПользователь.Представление = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ЛогинАвторизацииДиадокАПИ");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМЧДДляТекущегоПользователяВФоне(ПараметрыФоновогоЗадания = Неопределено)
	
	КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеВыполнениеСотслеживаниемВНовойФорме("КонтурЛогистика_ДлительныеОперацииСервер.ЗагрузитьМЧДДляТекущегоПользователя",
		"Фоновое задание Загрузка МЧД",
		Новый Структура,
		"Фоновое задание Загрузка МЧД",
		Ложь,
		Истина,
		РежимОткрытияОкнаФормы.Независимый);
		
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМЧДДляДругогоПользователяВФоне(ПараметрыФоновогоЗадания = Неопределено)
	
	КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеВыполнениеСотслеживаниемВНовойФорме("КонтурЛогистика_ДлительныеОперацииСервер.ЗагрузитьМЧДДляДругогоПользователя",
		"Фоновое задание Загрузка МЧД",
		ПараметрыФоновогоЗадания,
		"Фоновое задание Загрузка МЧД",
		Ложь,
		Истина,
		РежимОткрытияОкнаФормы.Независимый);
		
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзСпискаПосле(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ВыбранноеЗначение.Значение);
	
КонецПроцедуры

&НаСервере
Функция СертификатПоОтпечатку(ОтпечатокСертификата)
	Возврат Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.НайтиПоРеквизиту("ОтпечатокСертификата", ОтпечатокСертификата);
КонецФункции

#КонецОбласти