
Перем Метрика;

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции
// - для работы с унифицированными метриками продукта
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс

// Инициализирует новую метрику
//
Процедура НоваяМетрика() Экспорт
	
	Метрика = Новый Структура;
	
	// Переменные свойства
	УстановитьЗначение(Метрика, "ClientInfo.ClientName", "");
	УстановитьЗначение(Метрика, "ClientInfo.ClientVersion", "");
	
	УстановитьЗначение(Метрика, "Path.Category", "");
	УстановитьЗначение(Метрика, "Path.Action", "");
	
	УстановитьЗначение(Метрика, "AppContext.Hardware.CoresCount", "");
	
	//УстановитьЗначение(Метрика, "Session.PortalSession.PortalUserId", ""); // Зарезервировано 
	//УстановитьЗначение(Метрика, "Session.CustomSessionId", ""); // Зарезервировано
	
	// Постоянные свойства
	УстановитьЗначение(Метрика, "Id", Строка(НовыйИдентификаторИБ()));
	
	УстановитьЗначение(Метрика, "Time.ClientTime", ДатаISO8601(ТекущаяУниверсальнаяДата()));
	УстановитьЗначение(Метрика, "Time.SendFromClientTime", ДатаISO8601(ТекущаяУниверсальнаяДата()));
	
	УстановитьЗначение(Метрика, "AppContext.OS.Name", НаименованиеОС());
	УстановитьЗначение(Метрика, "AppContext.OS.Version", ВерсияСпецификации());
	УстановитьЗначение(Метрика, "AppContext.OS.BitSet", РазрядностьОС());
	
	УстановитьЗначение(Метрика, "AppContext.Platform.Name", ИмяПлатформы());
	УстановитьЗначение(Метрика, "AppContext.Platform.Version", ВерсияПлатформы());
	УстановитьЗначение(Метрика, "AppContext.Platform.Configuration", ИмяКонфигурации());
	УстановитьЗначение(Метрика, "AppContext.Platform.ConfigurationVersion", ВерсияКонфигурации());
	УстановитьЗначение(Метрика, "AppContext.Platform.RunMode", РежимЗапускаПриложения());
	
	УстановитьЗначение(Метрика, "Session.KeSession.AbonId", Строка(ИдентификаторИнформационнойБазы()));
	УстановитьЗначение(Метрика, "ClientInstanceId", Строка(ИдентификаторПользователяИБ()));
	УстановитьЗначение(Метрика, "Session.KeSession.UserId", Строка(ИдентификаторПользователяОС()));
		
КонецПроцедуры

// Возвращает метрику и топик
// 
// Возвращаемое значение:
//  Структура - Метрика И Топик в виде структур
//
Функция ПолучитьМетрику() Экспорт
	
	Результат = Новый Структура;
	
	УстановитьЗначение(Результат, "Топик.Источник", "1CModule");
	УстановитьЗначение(Результат, "Топик.Ключ", "Common_Statistics");
	УстановитьЗначение(Результат, "Событие", КоллекцияСкопироватьРекурсивно(Метрика));
	
	ПроверитьЗаполнениеМетрики(Результат);
	
	Возврат Результат;
	
КонецФункции

// Устанавливает имя продукта и версию продукта
//
// Параметры:
//  ИмяПродукта		 - Строка - ClientInfo.ClientName
//  ВерсияПродукта	 - Строка - ClientInfo.ClientVersion
//
Процедура Установить_ИмяВерсиюПродукта(ИмяПродукта, ВерсияПродукта) Экспорт
	
	Если ТипЗнч(Метрика) <> Тип("Структура") Тогда
		ВызватьИсключение "Невозможно установить свойство. Метрика не инициализирована";
	КонецЕсли;
	
	УстановитьЗначение(Метрика, "ClientInfo.ClientName", ИмяПродукта);
	УстановитьЗначение(Метрика, "ClientInfo.ClientVersion", ВерсияПродукта);	
		
КонецПроцедуры

// Устанавливает признак первичного действия
//
Процедура Установить_ПервичноеДействие() Экспорт
	
	Если ТипЗнч(Метрика) <> Тип("Структура") Тогда
		ВызватьИсключение "Невозможно установить свойство. Метрика не инициализирована";
	КонецЕсли;
	
	УстановитьЗначение(Метрика, "AppContext.Hardware.CoresCount", "1");
		
КонецПроцедуры

// Устанавливает категорию и действие
//
// Параметры:
//  Категория	- Строка - Path.Category
//  Действие	- Строка - Path.Action
//
Процедура Установить_КатегориюДействие(Категория, Действие) Экспорт
	
	Если ТипЗнч(Метрика) <> Тип("Структура") Тогда
		ВызватьИсключение "Невозможно установить свойство. Метрика не инициализирована";
	КонецЕсли;
	
	УстановитьЗначение(Метрика, "Path.Category", Категория);
	УстановитьЗначение(Метрика, "Path.Action", Действие);
		
КонецПроцедуры

// Устанавливает идентификатор пользователя Контур
//
// Параметры:
//  ИД	- Строка - Session.PortalSession.PortalUserId
//
Процедура Установить_ИдентификаторПользователяКонтур(ИД) Экспорт
	
	Если ТипЗнч(Метрика) <> Тип("Структура") Тогда
		ВызватьИсключение "Невозможно установить свойство. Метрика не инициализирована";
	КонецЕсли;
	
	УстановитьЗначение(Метрика, "Session.PortalSession.PortalUserId", ИД);
		
КонецПроцедуры

// Устанавливает значение переменной (поле Variables)
// КлючПеременной может быть вложенный - путь через точку
//
// Параметры:
//  КлючПеременной	 - Строка - имя переменной
//  ЗначениеПеременной	 - Строка,Число,Булева - значение переменной
// 
Процедура Установить_Переменную(КлючПеременной, ЗначениеПеременной) Экспорт
	
	Если ТипЗнч(Метрика) <> Тип("Структура") Тогда
		ВызватьИсключение "Невозможно установить свойство. Метрика не инициализирована";
	КонецЕсли;
	
	Если Не Метрика.Свойство("Variables") Тогда
		Метрика.Вставить("Variables", Новый Соответствие);
	КонецЕсли;
		
	УстановитьЗначениеСоответствия(Метрика.Variables, КлючПеременной, СтруктураОписанияЗначения(ЗначениеПеременной));
	
КонецПроцедуры

// Устанавливает произвольное свойство метрики
// Свойство может быть вложенным - путь через точку
//
// Параметры:
//  Свойство - Строка - имя свойства
//  Значение - Строка - значение свойства
// 
Процедура Установить_Свойство(Свойство, Значение) Экспорт
	
	Если ТипЗнч(Метрика) <> Тип("Структура") Тогда
		ВызватьИсключение "Невозможно установить свойство. Метрика не инициализирована";
	КонецЕсли;
	
	УстановитьЗначение(Метрика, Свойство, Значение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

Функция ВариантХранения()
	
	Если ДоступенВариант_КонстантаКонтур() Тогда
		Результат = "Константа_ИдентификаторИБ";
	ИначеЕсли ДоступенВариант_РегистрДополнительныеСведения() Тогда
		Результат = "РегистрСведений_ДополнительныеСведения";
	ИначеЕсли ДоступенВариант_РегистрЗначенияСвойствОбъектов() Тогда
		Результат = "РегистрСведений_ЗначенияСвойствОбъектов";
	ИначеЕсли ДоступенВариант_Файл() Тогда
		Результат = "Файл";
	Иначе
		Результат = "null";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// Служебный программный интерфейс

// Возвращает идентификатор информационной базы
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор информационной базы
//
Функция ИдентификаторИнформационнойБазы() Экспорт
	
	Результат = ИдентификаторИнформационнойБазыБСП();
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		
		ВариантХранения = ВариантХранения();
		
		Результат = ИдентификаторИнформационнойБазыКонтур(ВариантХранения);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает идентификатор информационной базы по умолчанию
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор информационной базы
//
Функция ИдентификаторИнформационнойБазыНеОпределен() Экспорт
	
	Возврат Новый УникальныйИдентификатор("aacc64c0-e8d8-4ae7-b3f8-8300b2f70d2b");
	
КонецФункции

// Возвращает идентификатор пользователя ИБ
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - идентификатор пользователя ИБ
//
Функция ИдентификаторПользователяИБ() Экспорт
 
    Результат = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	
	ИдентификаторАнонимногоПользователяИБ = "071523a4-516f-4fce-ba4b-0d11ab7a1893";
	
    ЭтоАнонимныйПользовательИБ = Строка(Результат) = ИдентификаторАнонимногоПользователяИБ;
    Если ЭтоАнонимныйПользовательИБ Тогда
        Результат = ИдентификаторПользователяОС();
    КонецЕсли;
 
    Возврат Результат;
 
КонецФункции

// Возвращает идентификатор пользователя ОС
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - идентификатор пользователя ОС
//
Функция ИдентификаторПользователяОС() Экспорт
 
    СистемнаяИнформация1 = Новый СистемнаяИнформация;
    СистемнаяИнформация2 = Новый СистемнаяИнформация;
 
    Если СистемнаяИнформация1.ИдентификаторКлиента = СистемнаяИнформация2.ИдентификаторКлиента Тогда
        Результат = СистемнаяИнформация1.ИдентификаторКлиента;
    Иначе
        // https://devtrainingforum.v8.1c.ru/forum/thread.jsp?id=588350&threadtype=0
        // Константа - Ошибка идентификации клиента, переменный идентификатор
        Результат = Новый УникальныйИдентификатор("d808d128-2d0e-498e-a728-20bdbe6aae56");
    КонецЕсли; 
	
    Если Строка(Результат) = "00000000-0000-0000-0000-000000000000" Тогда
        // Константа - Ошибка идентификации клиента, пустой идентификатор
        Результат = Новый УникальныйИдентификатор("d808d128-7a45-43c4-88f2-7d666470b842");
    КонецЕсли;  
 
    Возврат Результат;
 
КонецФункции

// Проверяет доступность константы КонтурИдентификаторИБ
// для хранения идентификатора ИБ
// 
// Возвращаемое значение:
//  Булево - Истина, если доступен вариант хранения идентификатора ИБ в константе
//
Функция ДоступенВариант_КонстантаКонтур() Экспорт
	
	ИмяКонстанты = "КонтурИдентификаторИБ";
	
	Результат = Метаданные.Константы.Найти(ИмяКонстанты) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

// Проверяет доступность регистра сведений ДополнительныеСведения
// для хранения идентификатора ИБ
// 
// Возвращаемое значение:
//  Булево - Истина, если доступен вариант хранения идентификатора ИБ в регистре
//
Функция ДоступенВариант_РегистрДополнительныеСведения() Экспорт
	
	ИмяРегистра = "ДополнительныеСведения";
	ИмяПВХ = "ДополнительныеРеквизитыИСведения";
	
	ЕстьРегистрДополнительныеСведения = Метаданные.РегистрыСведений.Найти(ИмяРегистра) <> Неопределено;
	ЕстьПланВидовХарактеристик = Метаданные.ПланыВидовХарактеристик.Найти(ИмяПВХ) <> Неопределено;
	ЕстьСправочникВалюты = Метаданные.Справочники.Найти("Валюты") <> Неопределено;
	ЕстьВладелецВалюты = (ЕстьСправочникВалюты И ЗначениеЗаполнено(ЗаписьСправочникаВалютыРуб()));
	ВалютаВладелецСвойства = (ЕстьПланВидовХарактеристик
		И ЕстьСправочникВалюты
		И ПроверитьВладельцаДополнительногоСвойства());
	
	Результат = (ЕстьРегистрДополнительныеСведения
		И ЕстьПланВидовХарактеристик
		И ЕстьВладелецВалюты
		И ВалютаВладелецСвойства);
	
	Возврат Результат;
	
КонецФункции

// Проверяет доступность регистра сведений ЗначенияСвойствОбъектов
// для хранения идентификатора ИБ
// 
// Возвращаемое значение:
//  Булево - Истина, если доступен вариант хранения идентификатора ИБ в регистре
//
Функция ДоступенВариант_РегистрЗначенияСвойствОбъектов() Экспорт
	
	ИмяРегистра = "ЗначенияСвойствОбъектов";
	ИмяПВХСвойстваОбъектов = "СвойстваОбъектов";
	
	ЕстьРегистрЗначенияСвойствОбъектов = Метаданные.РегистрыСведений.Найти(ИмяРегистра) <> Неопределено;
	ЕстьПланВидовХарактеристик = Метаданные.ПланыВидовХарактеристик.Найти(ИмяПВХСвойстваОбъектов) <> Неопределено;
	ЕстьСправочникВалюты = Метаданные.Справочники.Найти("Валюты") <> Неопределено;
	ЕстьВладелецВалюты = (ЕстьСправочникВалюты И ЗначениеЗаполнено(ЗаписьСправочникаВалютыРуб()));
	ВалютаВладелецСвойства = (ЕстьПланВидовХарактеристик
		И ЕстьСправочникВалюты
		И ПроверитьВладельцаЗначенияСвойства());
	
	Результат = (ЕстьРегистрЗначенияСвойствОбъектов
		И ЕстьПланВидовХарактеристик
		И ЕстьВладелецВалюты
		И ВалютаВладелецСвойства);
	
	Возврат Результат;
	
КонецФункции

// Проверяет права на чтение и запись в каталоге информационной базы
// для хранения идентификатора ИБ
// 
// Возвращаемое значение:
//  Булево - Истина, если доступен вариант хранения идентификатора ИБ в файле
//
Функция ДоступенВариант_Файл() Экспорт
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	ЧислоСимволовПризнакИБ = 5;
	ЭтоФайловаяИнформационнаяБаза = (ВРег(Лев(СтрокаСоединения, ЧислоСимволовПризнакИБ)) = "FILE=");
	
	Результат = (ЭтоФайловаяИнформационнаяБаза
		И РазрешенаЗаписьВКаталогИнформационнойБазы());
	
	Возврат Результат;
	
КонецФункции

// Возвращает идентификатор информационной базы
// вычисленный методом БСП
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор информационной базы
//
Функция ИдентификаторИнформационнойБазыБСП() Экспорт
	
	Попытка
		
		ИнтерфейсБСП = Вычислить("СтандартныеПодсистемыСервер");
		Результат = ИнтерфейсБСП.ИдентификаторИнформационнойБазы();
		
	Исключение
		
		Результат = "";
		
		ОписаниеОшибки_ = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		// BSLLS:UsageWriteLogEvent-off
		ЗаписьЖурналаРегистрации(
			"МетрикиКонтур",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			ОписаниеОшибки_
		);
		// BSLLS:UsageWriteLogEvent-on
		
		Возврат Результат;
		
	КонецПопытки;
	
	Возврат Новый УникальныйИдентификатор(Результат);
	
КонецФункции

// Возвращает идентификатор информационной базы
// вычисленный бизнес-логикой библиотеки
//
// Параметры:
//  ВариантХранения - Строка - Вариант хранения идентификатора ИБ (см. метод ВариантХранения())
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор информационной базы
//
Функция ИдентификаторИнформационнойБазыКонтур(ВариантХранения) Экспорт
	
	Если ВариантХранения = "Константа_ИдентификаторИБ" Тогда
		Результат = ИдентификаторИнформационнойБазыИзКонстанты();
	ИначеЕсли ВариантХранения = "РегистрСведений_ДополнительныеСведения" Тогда
		Результат = ИдентификаторИнформационнойБазыИзРегистраДополнительныеСведения();
	ИначеЕсли ВариантХранения = "РегистрСведений_ЗначенияСвойствОбъектов" Тогда
		Результат = ИдентификаторИнформационнойБазыИзРегистраЗначенияСвойствОбъектов();
	ИначеЕсли ВариантХранения = "Файл" Тогда
		Результат = ИдентификаторИнформационнойБазыИзФайла();
	Иначе
		Результат = ИдентификаторИнформационнойБазыНеОпределен();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторИнформационнойБазыИзКонстанты()
	
	Результат = ПрочитатьКонстантуИдентификаторИнформационнойБазы();
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = ЗаписатьКонстантуИдентификаторИнформационнойБазы();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторИнформационнойБазыИзРегистраДополнительныеСведения()
	
	Результат = ПрочитатьДополнительноеСведениеИдентификаторИнформационнойБазы();
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = ЗаписатьДополнительноеСведениеИдентификаторИнформационнойБазы();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторИнформационнойБазыИзРегистраЗначенияСвойствОбъектов()
	
	Результат = ПрочитатьЗначениеСвойстваИдентификаторИнформационнойБазы();
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = ЗаписатьЗначениеСвойстваИдентификаторИнформационнойБазы();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторИнформационнойБазыИзФайла()
	
	Результат = ПрочитатьФайлИдентификаторИнформационнойБазы();
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = ЗаписатьФайлИдентификаторИнформационнойБазы();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Чтение идентификатора информационной базы

Функция ПрочитатьКонстантуИдентификаторИнформационнойБазы()
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Результат = Константы.КонтурИдентификаторИБ.Получить();
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрочитатьДополнительноеСведениеИдентификаторИнформационнойБазы()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Объект КАК Объект,
	|	Т.Свойство.Наименование КАК ИмяСвойства,
	|	Т.Значение КАК ЗначениеСвойства
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК Т
	|ГДЕ
	|	Т.Свойство = &Свойство
	|	И Т.Объект = &Объект";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Свойство", ДополнительноеСвойствоИдентификаторИБ());
	Запрос.УстановитьПараметр("Объект", ЗаписьСправочникаВалютыРуб());
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ВыборкаЗапроса.Следующий() Тогда
		Результат = ВыборкаЗапроса.ЗначениеСвойства;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрочитатьЗначениеСвойстваИдентификаторИнформационнойБазы()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Объект КАК Объект,
	|	Т.Свойство.Наименование КАК ИмяСвойства,
	|	Т.Значение КАК ЗначениеСвойства
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК Т
	|ГДЕ
	|	Т.Свойство = &Свойство
	|	И Т.Объект = &Объект";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Свойство", СвойствоОбъектаИдентификаторИБ());
	Запрос.УстановитьПараметр("Объект", ЗаписьСправочникаВалютыРуб());
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ВыборкаЗапроса.Следующий() Тогда
		Результат = ВыборкаЗапроса.ЗначениеСвойства;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрочитатьФайлИдентификаторИнформационнойБазы()
	
	Результат = "";
	
	ПутьКФайлу = ПутьКФайлуKonturBaseId();
	
	Если НЕ ФайлСуществует(ПутьКФайлу) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТД = Новый ТекстовыйДокумент;
	ТД.Прочитать(ПутьКФайлу);
	
	Результат = СокрЛП(ТД.ПолучитьСтроку(1));
	
	Возврат Результат;
	
КонецФункции

// Запись идентификатора информационной базы

Функция ЗаписатьКонстантуИдентификаторИнформационнойБазы()
	
	Результат = НовыйИдентификаторИБ();
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Константы.КонтурИдентификаторИБ.Установить(Результат);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьДополнительноеСведениеИдентификаторИнформационнойБазы()
	
	Результат = НовыйИдентификаторИБ();
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	Запись.Объект = ЗаписьСправочникаВалютыРуб();
	Запись.Свойство = ДополнительноеСвойствоИдентификаторИБ();
	Запись.Значение = Результат;
	
	Запись.Записать();
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьЗначениеСвойстваИдентификаторИнформационнойБазы()
	
	Результат = НовыйИдентификаторИБ();
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	Запись.Объект = ЗаписьСправочникаВалютыРуб();
	Запись.Свойство = СвойствоОбъектаИдентификаторИБ();
	Запись.Значение = Результат;
	
	Запись.Записать();
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьФайлИдентификаторИнформационнойБазы()
	
	ПутьКФайлу = ПутьКФайлуKonturBaseId();
	Результат = НовыйИдентификаторИБ();
	
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(Результат);
	ТД.Записать(ПутьКФайлу);
	
	Возврат Результат;
	
КонецФункции

// Ключевые объекты метрик

Функция НовыйИдентификаторИБ()
	
	Результат = Новый УникальныйИдентификатор;
	
	Возврат Результат;
	
КонецФункции

Функция ПутьКФайлуKonturBaseId()
	
	Результат = "";
	
	КаталогИБ = КаталогИнформационнойБазыЛок();
	ИмяФайлаИД = ИмяФайлаKonturBaseId();
	
	Результат = ОбъединитьПути(
		КаталогИБ,
		ИмяФайлаИД
	);
	
	Возврат Результат;
	
КонецФункции

Функция КаталогИнформационнойБазыЛок()
	
	СтрокаСоединенияИБ = СтрокаСоединенияИнформационнойБазы();
	Параметры = ПараметрыИзСтроки(СтрокаСоединенияИБ);
	
	Результат = Параметры.File;
	
	Возврат Результат;
	
КонецФункции

Функция ИмяФайлаKonturBaseId()
	
	Возврат "KonturBaseId.txt";
	
КонецФункции

Функция ЗаписьСправочникаВалютыРуб()
	
	Результат = Справочники.Валюты.ПустаяСсылка();
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Т
	|ГДЕ
	|	Т.Код В(&Код)
	|	И НЕ Т.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.Код";
	
	КодыЗаписиСправочникаВалюты = Новый Массив;
	КодыЗаписиСправочникаВалюты.Добавить("643");
	КодыЗаписиСправочникаВалюты.Добавить("810");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Код", КодыЗаписиСправочникаВалюты);
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДополнительноеСвойствоИдентификаторИБ()
	
	ИмяСвойства = ИмяДополнительногоСведения();
	
	Результат = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ИмяСвойства, Истина);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
		
		СвойствоОбъект = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		
		СвойствоОбъект.Наименование = ИмяСвойства;
		СвойствоОбъект.ТипЗначения = ОписаниеТипа_Строка50();
		СвойствоОбъект.УстановитьНовыйКод();
		
		ЕстьРеквизитЗаголовок =
			(Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Реквизиты.Найти("Заголовок") <> Неопределено);
		Если ЕстьРеквизитЗаголовок Тогда
			СвойствоОбъект.Заголовок = СвойствоОбъект.Наименование;
		КонецЕсли;
		
		СвойствоОбъект.ОбменДанными.Загрузка = Истина;
		СвойствоОбъект.Записать();
		
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		Результат = СвойствоОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СвойствоОбъектаИдентификаторИБ()
	
	ИмяСвойства = ИмяДополнительногоСведения();
	
	Результат = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(ИмяСвойства, Истина);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		
		// BSLLS:SetPrivilegedMode-off
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
		
		СвойствоОбъект = ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
		
		СвойствоОбъект.Наименование = ИмяСвойства;
		СвойствоОбъект.ТипЗначения = ОписаниеТипа_Строка50();
		СвойствоОбъект.УстановитьНовыйКод();
		
		ЕстьРеквизитЗаголовок =
			(Метаданные.ПланыВидовХарактеристик.СвойстваОбъектов.Реквизиты.Найти("Заголовок") <> Неопределено);
		Если ЕстьРеквизитЗаголовок Тогда
			СвойствоОбъект.Заголовок = СвойствоОбъект.Наименование;
		КонецЕсли;
		
		СвойствоОбъект.ОбменДанными.Загрузка = Истина;
		СвойствоОбъект.Записать();
		
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		Результат = СвойствоОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИмяДополнительногоСведения()
	
	Возврат "КонтурИдентификаторИБ";
	
КонецФункции

// Прочее

Функция ПроверитьВладельцаЗначенияСвойства()
	
	Результат = Истина;
	
	ВладелецВалюта = ЗаписьСправочникаВалютыРуб();
	
	ТипыОбъектовРегистра = Метаданные.РегистрыСведений.ЗначенияСвойствОбъектов.Измерения.Объект.Тип.Типы();
	
	Результат = (ТипыОбъектовРегистра.Найти(ТипЗнч(ВладелецВалюта)) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьВладельцаДополнительногоСвойства()
	
	Результат = Истина;
	
	ВладелецВалюта = ЗаписьСправочникаВалютыРуб();
	
	ТипыОбъектовРегистра = Метаданные.РегистрыСведений.ДополнительныеСведения.Измерения.Объект.Тип.Типы();
	
	Результат = (ТипыОбъектовРегистра.Найти(ТипЗнч(ВладелецВалюта)) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция РазрешенаЗаписьВКаталогИнформационнойБазы()
	
	Результат = Истина;
	
	Префикс = "Diadoc_WriteTest_";
	Расширение = ".txt";
	УникальнаяЧасть = Строка(Новый УникальныйИдентификатор);
	Каталог = КаталогИнформационнойБазыЛок();
	
	ИмяТестовогоФайла = Префикс + УникальнаяЧасть + Расширение;
	ПутьКТестовомуФайлу = ОбъединитьПути(Каталог, ИмяТестовогоФайла);
	
	Попытка
		
		Запись = Новый ЗаписьТекста(ПутьКТестовомуФайлу);
		Запись.Записать("Тест записи файла");
		Запись.Закрыть();
		
	Исключение
		
		Результат = Ложь;
		
	КонецПопытки;
	
	Попытка
		// BSLLS:UsingSynchronousCalls-off
		УдалитьФайлы(ПутьКТестовомуФайлу);
		// BSLLS:UsingSynchronousCalls-on
	Исключение
		
		ОписаниеОшибки_ = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(
			"МетрикиКонтур",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОписаниеОшибки_
		);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыИзСтроки(Знач СтрокаПараметров, Знач Разделитель = ";")
	
	Результат = Новый Структура;
	
	ОписаниеПараметра = "";
	НайденоНачалоСтроки = Ложь;
	НомерПоследнегоСимвола = СтрДлина(СтрокаПараметров);
	Для НомерСимвола = 1 По НомерПоследнегоСимвола Цикл
		Символ = Сред(СтрокаПараметров, НомерСимвола, 1);
		Если Символ = """" Тогда
			НайденоНачалоСтроки = Не НайденоНачалоСтроки;
		КонецЕсли;
		Если Символ <> Разделитель Или НайденоНачалоСтроки Тогда
			ОписаниеПараметра = ОписаниеПараметра + Символ;
		КонецЕсли;
		Если Символ = Разделитель И Не НайденоНачалоСтроки Или НомерСимвола = НомерПоследнегоСимвола Тогда
			// BSLLS:DeprecatedFind-off
			Позиция = Найти(ОписаниеПараметра, "=");
			// BSLLS:DeprecatedFind-on
			Если Позиция > 0 Тогда
				ИмяПараметра = СокрЛП(Лев(ОписаниеПараметра, Позиция - 1));
				ЗначениеПараметра = СокрЛП(Сред(ОписаниеПараметра, Позиция + 1));
				ЗначениеПараметра = СократитьДвойныеКавычки(ЗначениеПараметра);
				Результат.Вставить(ИмяПараметра, ЗначениеПараметра);
			КонецЕсли;
			ОписаниеПараметра = "";
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ФайлСуществует(ИмяФайла)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		
		Файл = Новый Файл(ИмяФайла);
		
		Результат = Файл.Существует();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбъединитьПути(П1, П2, П3 = Неопределено, П4 = Неопределено)
	
	Результат = П1;
	
	РазделительПути = РазделительПути();
	
	ЧастиПути = Новый Массив;
	ЧастиПути.Добавить(П2);
	ЧастиПути.Добавить(П3);
	ЧастиПути.Добавить(П4);
	
	Для Каждого Элемент Из ЧастиПути Цикл
		
		Если Не ЗначениеЗаполнено(Элемент) Тогда
			Прервать;
		КонецЕсли;
		
		Если Прав(Результат, 1) <> РазделительПути Тогда
			Результат = Результат + РазделительПути;
		КонецЕсли;
		
		Результат = Результат + Элемент;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РазделительПути()
	
	СисИнфо = Новый СистемнаяИнформация;
	Если СравнитьВерсииЛок(СисИнфо.ВерсияПриложения, "8.3.3") < 0 Тогда
		
		Результат = "\";
		// BSLLS:DeprecatedFind-off
		Если Найти(СисИнфо.ТипПлатформы, "Linux") > 0 Тогда
		// BSLLS:DeprecatedFind-on
			Результат = "/";
		КонецЕсли;
		
	Иначе
		Результат = Вычислить("ПолучитьРазделительПути()");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СократитьДвойныеКавычки(Знач Значение)
	
	Пока СтрНачинаетсяСЛок(Значение, """") Цикл
		
		НачальныйНомер = 2;
		Значение = Сред(Значение, НачальныйНомер); 
		
	КонецЦикла;
	
	Пока СтрЗаканчиваетсяНаЛок(Значение, """") Цикл
		Значение = Лев(Значение, СтрДлина(Значение) - 1);
	КонецЦикла;
	
	Возврат Значение;
	
КонецФункции 

Функция ОписаниеТипа_Строка50()
	
	ДлинаСтроки50 = 50;
	
	Результат = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(ДлинаСтроки50));
	
	Возврат Результат;
	
КонецФункции

Функция СтрНачинаетсяСЛок(Строка, СтрокаПоиска)
	
	Возврат Лев(Строка, СтрДлина(СтрокаПоиска)) = СтрокаПоиска;
	
КонецФункции

Функция СтрЗаканчиваетсяНаЛок(Строка, СтрокаПоиска)
	
	Возврат Прав(Строка, СтрДлина(СтрокаПоиска)) = СтрокаПоиска;
	
КонецФункции

Функция СравнитьВерсииЛок(Знач СтрокаВерсия1, Знач СтрокаВерсия2)
	
	Результат = 0;
	Если СокрЛП(СтрокаВерсия1) = СокрЛП(СтрокаВерсия2) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Версия1 = СтрРазделитьЛок(СтрокаВерсия1, ".");
	Версия2 = СтрРазделитьЛок(СтрокаВерсия2, ".");
	
	КоличествоИтераций = Мин(Версия1.Количество(), Версия2.Количество()) - 1;
	Для Разряд = 0 По КоличествоИтераций Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат (Результат > 0) - (Результат < 0);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтрРазделитьЛок(Знач Строка, Знач Разделитель = ",", ВключатьПустые = Истина)
	
	ПропускатьПустыеСтроки = НЕ ВключатьПустые;
	Результат = Новый Массив;
	
	НачалоСтроки = 1;
	
	Для Позиция = 1 По СтрДлина(Строка) Цикл
		Символ = Сред(Строка, Позиция, 1);
		Если СтрНайтиЛок(Разделитель, Символ) > 0 Тогда
			Результат.Добавить(Сред(Строка, НачалоСтроки, Позиция - НачалоСтроки));
			НачалоСтроки = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
	
	Значение = Сред(Строка, НачалоСтроки, Позиция - НачалоСтроки);
	Если НЕ ПропускатьПустыеСтроки ИЛИ НЕ ПустаяСтрока(Значение) Тогда
		Результат.Добавить(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрНайтиЛок(Знач Строка,
	Знач Подстрока,
	Направление = "СНачала",
	НачальнаяПозиция = Неопределено,
	НомерВхождения = 1)
	
	Если НачальнаяПозиция = Неопределено Тогда
		Если Направление = "СНачала" ИЛИ Строка(Направление) = "С начала" Тогда
			НачальнаяПозиция = 1;
		Иначе
			НачальнаяПозиция = СтрДлина(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Позиция = НачальнаяПозиция;
	Если Направление = "СКонца" Тогда
		Строка = СтрРазвернутьЛок(Строка);
		Подстрока = СтрРазвернутьЛок(Подстрока);
		Позиция = 1;
	КонецЕсли;
	
	Результат = 0;
	Вхождение = 0;
	ДлинаСтроки = СтрДлина(Строка);
	ДлинаПодстроки = СтрДлина(Подстрока);
	
	Пока Позиция <> ДлинаСтроки + 1 Цикл
		Если Сред(Строка, Позиция, ДлинаПодстроки) = Подстрока Тогда
			Результат = Позиция;
			Вхождение = Вхождение + 1;
			Если Вхождение = НомерВхождения Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		Позиция = Позиция + 1;
	КонецЦикла;
	
	Если Направление = "СКонца" Тогда
		Сдвиг = 2;
		Результат = ДлинаСтроки - ДлинаПодстроки - Результат + Сдвиг;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрРазвернутьЛок(Знач Строка)
	
	Результат = "";
	ВторойСимвол = 2;
	Для Сч = 1 По СтрДлина(Строка) Цикл
		Результат = Лев(Строка, 1) + Результат;
		Строка = Сред(Строка, ВторойСимвол);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьЗначение(Структура, Путь, Значение)
	
	ТекСтруктура = Структура;
	
	Ключи = СтрРазделитьЛок(Путь, ".");
	
	ВГраница = Ключи.ВГраница();
	ИтоговыйКлюч = Ключи[ВГраница];
	Ключи.Удалить(ВГраница);
	
	Для Каждого ТекКлюч Из Ключи Цикл
		Если Не ТекСтруктура.Свойство(ТекКлюч) Тогда
			ТекСтруктура.Вставить(ТекКлюч, Новый Структура);
		КонецЕсли;
		ТекСтруктура = ТекСтруктура[ТекКлюч];
	КонецЦикла;
	
	ТекСтруктура.Вставить(ИтоговыйКлюч, Значение);
	
КонецПроцедуры

Процедура УстановитьЗначениеСоответствия(Соответствие, Путь, Значение)
	
	ТекСоответствие = Соответствие;
	
	Ключи = СтрРазделитьЛок(Путь, ".");
	
	ВГраница = Ключи.ВГраница();
	ИтоговыйКлюч = Ключи[ВГраница];
	Ключи.Удалить(ВГраница);
	
	Для Каждого ТекКлюч Из Ключи Цикл
		Если Не ТекСоответствие[ТекКлюч] = Неопределено Тогда
			ТекСоответствие.Вставить(ТекКлюч, Новый Соответствие);
		КонецЕсли;
		ТекСоответствие = ТекСоответствие[ТекКлюч];
	КонецЦикла;
	
	ТекСоответствие.Вставить(ИтоговыйКлюч, Значение);
	
КонецПроцедуры

Функция ДатаISO8601(ДатаВремя)
	
	Результат = Формат(ДатаВремя, "ДФ=yyyy-MM-ddTHH:mm:ss+00:00");
	
	Возврат Результат;
	
КонецФункции

Функция ОбъемОперативнойПамяти()
	
	СИ = Новый СистемнаяИнформация;
	
	Результат = Формат(СИ.ОперативнаяПамять / 1000, "ЧДЦ=0; ЧГ=");
	
	Возврат Результат;
	
КонецФункции

Функция НаименованиеОС()
	
	Результат = "";
	
	СИ = Новый СистемнаяИнформация;
	
	ТипПлатформыСтрокой = НРег(Строка(СИ.ТипПлатформы));
	Если СтрНайтиЛок(ТипПлатформыСтрокой, "linux") > 0 Тогда
		Результат =  "Linux";
	ИначеЕсли СтрНайтиЛок(ТипПлатформыСтрокой, "macOS") > 0 Тогда
		Результат =  "MacOS";
	ИначеЕсли СтрНайтиЛок(ТипПлатформыСтрокой, "windows") > 0 Тогда
		Результат =  "Windows";
	Иначе
		Результат =  "Unknown";
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция РазрядностьОС()
	
	Результат = "";
	
	СИ = Новый СистемнаяИнформация;
	
	ТипПлатформыСтрокой = Строка(СИ.ТипПлатформы);
	Если СтрНайтиЛок(ТипПлатформыСтрокой, "64") > 0 Тогда
		Результат =  "x64";
	Иначе
		Результат = "x86";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияСпецификации()
	
	Возврат "1.0.0";
	
КонецФункции

Функция ВерсияПлатформы()
	
	СИ = Новый СистемнаяИнформация;
	
	Результат = ВерсияВСемантик(СИ.ВерсияПриложения);
	
	Возврат Результат;
	
КонецФункции

Функция ВерсияВСемантик(Знач Версия)
	
	Если Не ЗначениеЗаполнено(Версия) Тогда
		Возврат "0.0.1";
	КонецЕсли;
	
	Версия 			= Строка(Версия);	
	МассивРазрядов 	= СтрРазделитьЛок(Версия, ".");
	СемантикВерсия	= "";
	
	Сч = 0;
	Разделитель = "";
	ТекРазряд = "";
	Для каждого Разряд Из МассивРазрядов Цикл
		Сч = Сч + 1;
		Если Сч < 4 Тогда
			ТекРазряд = ?(ТолькоЦифрыВСтроке(Разряд), Разряд, "0");
		Иначе
			ТекРазряд = СтрЗаменить(Разряд, " ", "");
		КонецЕсли;	
		СемантикВерсия = СемантикВерсия + Разделитель + ТекРазряд;
		Если Сч < 3 Тогда
			Разделитель = ".";
		ИначеЕсли Сч = 3 Тогда
			Разделитель = "-";
		Иначе
			Разделитель = "";
		КонецЕсли;
	КонецЦикла;
	
	Пока Сч < 3 Цикл
		СемантикВерсия = СемантикВерсия + ".0";
		Сч = Сч + 1;
	КонецЦикла;
	
	Возврат СемантикВерсия;
	
КонецФункции

Функция ТолькоЦифрыВСтроке(Знач Значение, Знач ПробелыЗапрещены = Истина)
	
	// BSLLS-off
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПробелыЗапрещены Тогда
		Значение = СтрЗаменить(Значение, " ", "");
	КонецЕсли;
		
	Если СтрДлина(Значение) = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка.
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы.
	Возврат СтрДлина(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
			Значение, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", "")) = 0;
			
	// BSLLS-on
	
КонецФункции

Функция ИмяПлатформы()
	
	Возврат "1С:Предприятие 8";	
	
КонецФункции

Функция ИмяКонфигурации()
	
	Возврат	Метаданные.Имя;
	
КонецФункции

Функция ВерсияКонфигурации()
	
	Результат = ВерсияВСемантик(Метаданные.Версия);
	
	Возврат	Результат;
	
КонецФункции

Функция РежимЗапускаПриложения()
	
	Результат = ТекущийРежимЗапуска();
	Если Результат = Неопределено Тогда
		Результат = "Регламентное задание";
	КонецЕсли;
	
	Возврат Строка(Результат);
	
КонецФункции

Функция ЮзерАгент()
	
	СИ = Новый СистемнаяИнформация;
	
	Результат = СИ.ИнформацияПрограммыПросмотра;
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = "1С";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураОписанияЗначения(Значение)
	
	Результат = Новый Структура("value, type");
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Результат.value = XMLСтрока(Значение);
		Результат.type = "number";
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
		Результат.value = Значение;
		Результат.type = "string";
	ИначеЕсли ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
		Результат.value = XMLСтрока(Значение);
		Результат.type = "uuid";
	ИначеЕсли ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
		Результат.value = Base64Строка(Значение);
		Результат.type = "base64";
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
		Результат.value = XMLСтрока(Значение);
		Результат.type = "string";
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		Результат.value = XMLСтрока(Значение);
		Результат.type = "string";
	Иначе
		Результат.value = "convert_error";
		Результат.type = "string";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьЗаполнениеМетрики(Результат)
	
	Если Не ЗначениеЗаполнено(Результат.Событие.ClientInfo.ClientName) Тогда
		ВызватьИсключение "Свойство ClientInfo.ClientName не может быть пустым";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.Событие.ClientInfo.ClientVersion) Тогда
		ВызватьИсключение "Свойство ClientInfo.ClientVersion не может быть пустым";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.Событие.Path.Category) Тогда
		ВызватьИсключение "Свойство Path.Category не может быть пустым";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.Событие.Path.Action) Тогда
		ВызватьИсключение "Свойство Path.Action не может быть пустым";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.Событие.AppContext.Platform.Name) Тогда
		ВызватьИсключение "Свойство AppContext.Platform.Name не может быть пустым";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.Событие.AppContext.Platform.Version) Тогда
		ВызватьИсключение "Свойство AppContext.Platform.Version не может быть пустым";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.Событие.AppContext.OS.Name) Тогда
		ВызватьИсключение "Свойство AppContext.OS.Name не может быть пустым";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.Событие.AppContext.OS.Version) Тогда
		ВызватьИсключение "Свойство AppContext.OS.Version не может быть пустым";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.Событие.Session.KeSession.UserId) Тогда
		ВызватьИсключение "Свойство Session.KeSession.UserId не может быть пустым";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.Событие.Session.KeSession.AbonId) Тогда
		ВызватьИсключение "Свойство Session.KeSession.AbonId не может быть пустым";
	КонецЕсли;
	
	Если Результат.Событие.Свойство("Variables") Тогда
		
		Для Каждого Элемент Из Результат.Событие.Variables Цикл
			
			Если Не ЗначениеЗаполнено(Элемент.Ключ) Тогда
				ВызватьИсключение "Ключ переменной из коллекции Variables не может быть пустым";
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Элемент.Значение.Value) Тогда
				ВызватьИсключение "Элемент Value переменной из коллекции Variables не может быть пустым";
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Элемент.Значение.Type) Тогда
				ВызватьИсключение "Элемент Type переменной из коллекции Variables не может быть пустым";
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Копирование коллекций

Функция КоллекцияСкопироватьРекурсивно(Источник, ФиксироватьДанные = Неопределено)
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ЭтоСтруктура(Источник) Тогда
		Приемник = Структура_Скопировать(Источник, ФиксироватьДанные);
	ИначеЕсли ЭтоСоответствие(Источник) Тогда
		Приемник = Соответствие_Скопировать(Источник, ФиксироватьДанные);
	ИначеЕсли ЭтоМассив(Источник) Тогда
		Приемник = Массив_Скопировать(Источник, ФиксироватьДанные);
	Иначе
		Приемник = Источник;
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

Функция Структура_Скопировать(СтруктураИсточник, ФиксироватьДанные = Неопределено)
	
	Результат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураИсточник Цикл
		Результат.Вставить(КлючИЗначение.Ключ, КоллекцияСкопироватьРекурсивно(КлючИЗначение.Значение, ФиксироватьДанные));
	КонецЦикла;
	
	Если ФиксироватьДанные = Истина
		ИЛИ ФиксироватьДанные = Неопределено
		И ТипЗнч(СтруктураИсточник) = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Новый ФиксированнаяСтруктура(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Массив_Скопировать(МассивИсточник, ФиксироватьДанные = Неопределено)
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из МассивИсточник Цикл
		
		НовыйЭлемент = КоллекцияСкопироватьРекурсивно(Элемент, ФиксироватьДанные);
		Результат.Добавить(НовыйЭлемент);
		
	КонецЦикла;
	
	Если ФиксироватьДанные = Истина
		ИЛИ ФиксироватьДанные = Неопределено
		И ТипЗнч(МассивИсточник) = Тип("ФиксированныйМассив") Тогда
		
		Результат = Новый ФиксированныйМассив(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Соответствие_Скопировать(СоответствиеИсточник, ФиксироватьДанные = Неопределено)
	
	Результат = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из СоответствиеИсточник Цикл
		
		Ключ = КлючИЗначение.Ключ;
		Значение = КоллекцияСкопироватьРекурсивно(КлючИЗначение.Значение, ФиксироватьДанные);
		
		Результат.Вставить(Ключ, Значение);
		
	КонецЦикла;
	
	Если ФиксироватьДанные = Истина
		ИЛИ ФиксироватьДанные = Неопределено
		И ТипЗнч(СоответствиеИсточник) = Тип("ФиксированноеСоответствие") Тогда
		
		Результат = Новый ФиксированноеСоответствие(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСтруктура(Значение)
	
	Результат = Ложь;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура")
		ИЛИ ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоМассив(Значение)
	
	Результат = Ложь;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Массив")
		ИЛИ ТипЗначения = Тип("ФиксированныйМассив") Тогда
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоСоответствие(Значение)
	
	Результат = Ложь;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Соответствие")
		ИЛИ ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Инициализация

// Инициализирует Обработку.
// 
// Возвращаемое значение:
//  ОбработкаОбъект.Метрики - Настроенный объект
Функция __Инит__() Экспорт

	НоваяМетрика();
	
	Возврат ЭтотОбъект;

КонецФункции

__Инит__();

