#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиРазбораКодаМаркировки

Процедура ДополнитьОписанияКодовМаркировки(ДанныеОписанийКодаМаркировки, НастройкиРазбораКодаМаркировки, МодулиПодсистемы) Экспорт
	
	ДанныеШаблоновКодаМаркировки = ДанныеШаблоновКодаМаркировки(НастройкиРазбораКодаМаркировки.ДоступныеВидыПродукции);
	
	Параметры = Новый Структура;
	Параметры.Вставить("ДанныеОписанийКодаМаркировки", ДанныеОписанийКодаМаркировки);
	Параметры.Вставить("ДанныеОбщегоМодуля",           МодулиПодсистемы.Разбор);
	
	Параметры.Вставить("ВключаетИдентификаторыПрименения", Истина);
	Параметры.Вставить("ЕстьМРЦ",            Ложь);
	Параметры.Вставить("ЕстьВес",            Ложь);
	Параметры.Вставить("ЕстьОбъем",          Ложь);
	Параметры.Вставить("ЕстьКодТНВЭД",       Ложь);
	Параметры.Вставить("ЕстьЗаводскойSN",    Ложь);
	Параметры.Вставить("ЕстьПроизвольныеAI", Ложь);
	
	СписокШаблонов = Новый Массив;
	
	ОписанияЭлементовКодовМаркировки = ОписанияЭлементовКодовМаркировки(Параметры.ДанныеОписанийКодаМаркировки.Алфавит);
	
	Для Каждого КлючИЗначение Из ДанныеШаблоновКодаМаркировки Цикл
		
		ВидПродукции = КлючИЗначение.Ключ;
		ТаблицаШаблоновКодаМаркировки = КлючИЗначение.Значение;
		
		Параметры.Вставить("ВидПродукции", ВидПродукции);
		
		ИндексПоследнейСтроки = ТаблицаШаблоновКодаМаркировки.Количество() - 1;
		
		Для Каждого ДанныеШаблонаКодаМаркировки Из ТаблицаШаблоновКодаМаркировки Цикл
			
			ЭлементыСпискаШаблонов = Новый Массив;
			
			Если ДанныеШаблонаКодаМаркировки.ИдентификаторыПримененияОтсутствуют Тогда
				Параметры.ВключаетИдентификаторыПрименения = Ложь;
			КонецЕсли;
			
			Если ДанныеШаблонаКодаМаркировки.ШаблонРазбораКодаМаркировки = Справочники.ШаблоныРазбораКодовМаркировкиИСМП.ИзделияИзМеха Тогда
				ОписаниеКодаМаркировкиПродукцииИзНатуральногоМеха(Параметры.ДанныеОписанийКодаМаркировки, ВидПродукции, Параметры.ДанныеОбщегоМодуля);
				ДобавитьБуквенныеКодыСтранДляПродукцииИзНатуральногоМеха(НастройкиРазбораКодаМаркировки, МодулиПодсистемы);
				Продолжить;
			Иначе
				Для Каждого ЭлементСоставаКодаМаркировки Из ДанныеШаблонаКодаМаркировки.СоставКодаМаркировки Цикл
					
					Если ЭлементСоставаКодаМаркировки = Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.МРЦ4
						Или ЭлементСоставаКодаМаркировки = Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.МРЦ6 Тогда
						Параметры.ЕстьМРЦ = Истина;
					ИначеЕсли ЭлементСоставаКодаМаркировки = Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.Вес6 Тогда
						Параметры.ЕстьВес = Истина;
					ИначеЕсли ЭлементСоставаКодаМаркировки = Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.Объем6 Тогда
						Параметры.ЕстьОбъем = Истина;
					ИначеЕсли ЭлементСоставаКодаМаркировки = Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.КодТНВЭД4
						Или ЭлементСоставаКодаМаркировки = Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.КодТНВЭД8
						Или ЭлементСоставаКодаМаркировки = Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.КодТНВЭД10 Тогда
						Параметры.ЕстьКодТНВЭД = Истина;
					КонецЕсли;
					
					Если ЭлементСоставаКодаМаркировки = Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.ЗаводскойSN Тогда
						Параметры.ЕстьЗаводскойSN = Истина;
					ИначеЕсли ЭлементСоставаКодаМаркировки = Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.ПроизвольныеAI Тогда
						Параметры.ЕстьПроизвольныеAI = Истина;
					Иначе
						ОписаниеЭлементаКодовМаркировки = ОписанияЭлементовКодовМаркировки[ЭлементСоставаКодаМаркировки];
						Если ОписаниеЭлементаКодовМаркировки <> Неопределено Тогда
							Если ЭлементСоставаКодаМаркировки = Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.СерийныйНомер Тогда
								Длина = ДанныеШаблонаКодаМаркировки.ДлинаСерийногоНомера;
							Иначе
								Длина = ОписаниеЭлементаКодовМаркировки.Длина;
							КонецЕсли;
							Если Параметры.ВключаетИдентификаторыПрименения Тогда
								Код = ОписаниеЭлементаКодовМаркировки.Код;
							Иначе
								Код = "";
							КонецЕсли;
							ЭлементыСпискаШаблонов.Добавить(
								РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки(
									Код,
									ОписаниеЭлементаКодовМаркировки.Имя,
									Длина,
									ОписаниеЭлементаКодовМаркировки.Алфавит));
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			Если ЭлементыСпискаШаблонов.Количество() > 0 Тогда
				
				Если Параметры.ЕстьЗаводскойSN
					Или Параметры.ЕстьПроизвольныеAI Тогда
					Если Параметры.ЕстьЗаводскойSN Тогда
						ИмяШаблона = "ЗаводскойSN";
					Иначе
						ИмяШаблона = "ПроизвольныеAI";
					КонецЕсли;
					ШаблоныНеФормализованныхКодовМаркировки = РазборКодаМаркировкиИСМПСлужебныйКлиентСервер.ШаблоныНеФормализованныхКодовМаркировки(
						НастройкиРазбораКодаМаркировки, МодулиПодсистемы.Подсистема, ИмяШаблона);
					ДанныеШаблонаКМ = РазборКодаМаркировкиИССлужебный.ОписаниеЭлементовШаблонаКодаМаркировкиВСтруктуру(
						НастройкиРазбораКодаМаркировки, ЭлементыСпискаШаблонов);
					ДанныеШаблонаКМ.Вставить("ВидПродукции", ВидПродукции);
					ДанныеШаблонаКМ.Вставить("ТипШтрихкода", ДанныеШаблонаКодаМаркировки.ТипШтрихкода);
					ДанныеШаблонаКМ.Вставить("ВидУпаковки",  ВидУпаковкиПоТипуКодаМаркировки(ДанныеШаблонаКодаМаркировки.ТипКодаМаркировки));
					ШаблоныНеФормализованныхКодовМаркировки.Добавить(ДанныеШаблонаКМ);
					Параметры.ЕстьЗаводскойSN = Ложь;
					Параметры.ЕстьПроизвольныеAI = Ложь;
				КонецЕсли;
				
				Если Параметры.ЕстьОбъем Тогда
					СписокШаблоновКопия = Новый Массив;
					Для Счетчик = 0 По 5 Цикл
						ЭлементыСпискаШаблоновСОбъемом = Новый Массив;
						Для Каждого ЭлементСписка Из ЭлементыСпискаШаблонов Цикл
							Если ЭлементСписка.Код = "335Y" Тогда
								Код = СтрЗаменить(ЭлементСписка.Код, "Y", Счетчик);
							Иначе
								Код = ЭлементСписка.Код;
							КонецЕсли;
							ЭлементыСпискаШаблоновСОбъемом.Добавить(
								РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки(
									Код,
									ЭлементСписка.Имя,
									ЭлементСписка.Длина,
									ЭлементСписка.Алфавит));
						КонецЦикла;
						СписокШаблоновКопия.Добавить(ЭлементыСпискаШаблоновСОбъемом);
					КонецЦикла;
					ДобавитьДанныеОписанияКодовМаркировки(ДанныеШаблонаКодаМаркировки, СписокШаблоновКопия, Параметры, Ложь);
					Параметры.ЕстьОбъем = Ложь;
				Иначе
					СписокШаблонов.Добавить(ЭлементыСпискаШаблонов);
				КонецЕсли;
				
			КонецЕсли;
			
			ИндексТекущейСтроки = ТаблицаШаблоновКодаМаркировки.Индекс(ДанныеШаблонаКодаМаркировки);
			ЭтоПоследняяСтрока = ИндексТекущейСтроки = ИндексПоследнейСтроки;
			
			Если ЭтоПоследняяСтрока
				Или ДанныеШаблонаКодаМаркировки.ШаблонКодаМаркировки <> ТаблицаШаблоновКодаМаркировки[ИндексТекущейСтроки+1].ШаблонКодаМаркировки Тогда
				ДобавитьДанныеОписанияКодовМаркировки(ДанныеШаблонаКодаМаркировки, СписокШаблонов, Параметры);
			КонецЕсли;
			
		КонецЦикла;
		
		Если КонструкторИСМПОбщегоНазначенияКлиентСервер.ИспользуетсяSSCC18(ВидПродукции) Тогда
			ОписаниеКодаМаркировкиЛогистическаяУпаковка18(Параметры.ДанныеОписанийКодаМаркировки, ВидПродукции, Параметры.ДанныеОбщегоМодуля);
		КонецЕсли;
		
		Если КонструкторИСМПОбщегоНазначенияКлиентСервер.ИспользуетсяSSCC20(ВидПродукции) Тогда
			ОписаниеКодаМаркировкиЛогистическаяУпаковка20(Параметры.ДанныеОписанийКодаМаркировки, ВидПродукции, Параметры.ДанныеОбщегоМодуля);
		КонецЕсли;
		
		Если КонструкторИСМПОбщегоНазначенияКлиентСервер.ИспользуетсяАТК(ВидПродукции) Тогда
			ОписаниеАгрегированногоТаможенногоКода(Параметры.ДанныеОписанийКодаМаркировки, ВидПродукции, Параметры.ДанныеОбщегоМодуля);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьВспомогательнымиНастройкиРазбораКодаМаркировки(НастройкиРазбораКодаМаркировки, МодулиПодсистемы) Экспорт
	
	ДополнитьШаблоныНеФормализованныхКодовМаркировки(НастройкиРазбораКодаМаркировки, МодулиПодсистемы, "ЗаводскойSN");
	ДополнитьШаблоныНеФормализованныхКодовМаркировки(НастройкиРазбораКодаМаркировки, МодулиПодсистемы, "ПроизвольныеAI");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкиРазбораКодаМаркировки

#Область Общие

Функция ДанныеШаблоновКодаМаркировки(ВидыПродукции)
	
	Результат = Новый Соответствие;
	
	ДанныеЭлемента = КонструкторИСОбщегоНазначенияКлиентСервер.ДанныеЭлементаКонструктора(
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ);
	
	ТаблицаВидовПродукции = Новый ТаблицаЗначений;
	ТаблицаВидовПродукции.Колонки.Добавить("ВидПродукции",   Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС"));
	ТаблицаВидовПродукции.Колонки.Добавить("ТоварнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.ТоварныеГруппыГИСМТ"));
	Для Каждого ВидПродукции Из ВидыПродукции Цикл
		Значения = ДанныеЭлемента.ВидыПродукции[ВидПродукции];
		Если Значения <> Неопределено Тогда
			Для Каждого КлючИЗначение Из Значения Цикл
				Строка = ТаблицаВидовПродукции.Добавить();
				Строка.ВидПродукции   = ВидПродукции;
				Строка.ТоварнаяГруппа = КлючИЗначение.Ключ;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаВидовПродукции", ТаблицаВидовПродукции);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаВидовПродукции.ВидПродукции КАК ВидПродукции,
	|	ТаблицаВидовПродукции.ТоварнаяГруппа КАК ТоварнаяГруппа
	|ПОМЕСТИТЬ ТаблицаВидовПродукции
	|ИЗ
	|	&ТаблицаВидовПродукции КАК ТаблицаВидовПродукции
	|;
	|ВЫБРАТЬ
	|	ТаблицаВидовПродукции.ВидПродукции КАК ВидПродукции,
	|	ШаблоныКодовМаркировкиСУЗ.Ссылка КАК ШаблонКодаМаркировки,
	|	ШаблоныРазбораКодовМаркировкиИСМП.Ссылка КАК ШаблонРазбораКодаМаркировки,
	|	ШаблоныКодовМаркировкиСУЗ.ТипКодаМаркировки КАК ТипКодаМаркировки,
	|	ШаблоныКодовМаркировкиСУЗ.ТипШтрихкода КАК ТипШтрихкода,
	|	ВЫБОР
	|		КОГДА ШаблоныРазбораКодовМаркировкиИСМП.ДлинаСерийногоНомера > 0
	|			ТОГДА ШаблоныРазбораКодовМаркировкиИСМП.ДлинаСерийногоНомера
	|		ИНАЧЕ ШаблоныКодовМаркировкиСУЗ.ДлинаСерийногоНомера
	|	КОНЕЦ КАК ДлинаСерийногоНомера,
	|	ШаблоныРазбораКодовМаркировкиИСМП.ИдентификаторыПримененияОтсутствуют КАК ИдентификаторыПримененияОтсутствуют,
	|	СоставКодаМаркировкиТаблица.ЭлементСоставаКодаМаркировки КАК ЭлементСоставаКодаМаркировки
	|ИЗ
	|	ТаблицаВидовПродукции КАК ТаблицаВидовПродукции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныКодовМаркировкиСУЗ КАК ШаблоныКодовМаркировкиСУЗ
	|		ПО ТаблицаВидовПродукции.ТоварнаяГруппа = ШаблоныКодовМаркировкиСУЗ.ТоварнаяГруппа
	|			И НЕ ШаблоныКодовМаркировкиСУЗ.Архивный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныКодовМаркировкиСУЗ.ШаблоныРазбораКодовМаркировки КАК
	|			ШаблоныКодовМаркировкиТаблица
	|		ПО ШаблоныКодовМаркировкиСУЗ.Ссылка = ШаблоныКодовМаркировкиТаблица.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныРазбораКодовМаркировкиИСМП КАК ШаблоныРазбораКодовМаркировкиИСМП
	|		ПО ШаблоныКодовМаркировкиТаблица.ШаблонРазбораКодовМаркировки = ШаблоныРазбораКодовМаркировкиИСМП.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныРазбораКодовМаркировкиИСМП.СоставКодаМаркировки КАК СоставКодаМаркировкиТаблица
	|		ПО ШаблоныРазбораКодовМаркировкиИСМП.Ссылка = СоставКодаМаркировкиТаблица.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидПродукции,
	|	ШаблонКодаМаркировки,
	|	ШаблонРазбораКодаМаркировки,
	|	СоставКодаМаркировкиТаблица.НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекущийВидПродукции                = Неопределено;
	ТекущийШаблонКодаМаркировки        = Неопределено;
	ТекущийШаблонРазбораКодаМаркировки = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидПродукции <> ТекущийВидПродукции Тогда
			Результат.Вставить(Выборка.ВидПродукции, ТаблицаШаблоновКодаМаркировки());
			Данные = Результат[Выборка.ВидПродукции];
			ТекущийВидПродукции = Выборка.ВидПродукции;
		КонецЕсли;
		
		Если Выборка.ШаблонКодаМаркировки <> ТекущийШаблонКодаМаркировки
			Или Выборка.ШаблонРазбораКодаМаркировки <> ТекущийШаблонРазбораКодаМаркировки Тогда
			СтрокаДанных = Данные.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДанных, Выборка);
			ТекущийШаблонКодаМаркировки        = Выборка.ШаблонКодаМаркировки;
			ТекущийШаблонРазбораКодаМаркировки = Выборка.ШаблонРазбораКодаМаркировки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ЭлементСоставаКодаМаркировки) Тогда
			СтрокаДанных.СоставКодаМаркировки.Добавить(Выборка.ЭлементСоставаКодаМаркировки);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаШаблоновКодаМаркировки()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ШаблонКодаМаркировки",                Новый ОписаниеТипов("СправочникСсылка.ШаблоныКодовМаркировкиСУЗ"));
	Результат.Колонки.Добавить("ШаблонРазбораКодаМаркировки",         Новый ОписаниеТипов("СправочникСсылка.ШаблоныРазбораКодовМаркировкиИСМП"));
	Результат.Колонки.Добавить("ТипКодаМаркировки",                   Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКодовМаркировкиИСМП"));
	Результат.Колонки.Добавить("ТипШтрихкода",                        Новый ОписаниеТипов("ПеречислениеСсылка.ТипыШтрихкодов"));
	Результат.Колонки.Добавить("ДлинаСерийногоНомера",                ОбщегоНазначения.ОписаниеТипаЧисло(2, 0, ДопустимыйЗнак.Неотрицательный));
	Результат.Колонки.Добавить("ИдентификаторыПримененияОтсутствуют", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("СоставКодаМаркировки",                Новый ОписаниеТипов("Массив"));
	
	Возврат Результат;
	
КонецФункции

Функция ОписанияЭлементовКодовМаркировки(Алфавит)
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.GTIN,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("01", "GTIN", 14, ""));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.СерийныйНомер,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("21", "СерийныйНомер", 0, Алфавит.БуквыЦифрыЗнаки));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.КлючПроверки4,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("91", "КлючПроверки", 4, Алфавит.БуквыЦифрыЗнаки));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.Подпись44,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("92", "Подпись", 44, Алфавит.БуквыЦифрыЗнаки));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.Подпись88,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("92", "Подпись", 88, Алфавит.БуквыЦифрыЗнаки));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.КодПроверки4,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("93", "КодПроверки", 4, Алфавит.БуквыЦифрыЗнаки));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.КодПроверки8,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("93", "КодПроверки", 8, Алфавит.БуквыЦифрыЗнаки));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.МРЦ4,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("8005", "МРЦСтрокой", 4, Алфавит.БуквыЦифрыЗнакиМРЦ));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.МРЦ6,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("8005", "МРЦСтрокой", 6, Алфавит.Цифры));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.КодТНВЭД4,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("240", "КодТНВЭД", 4, Алфавит.Цифры));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.КодТНВЭД8,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("240", "КодТНВЭД", 8, Алфавит.Цифры));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.КодТНВЭД10,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("240", "КодТНВЭД", 10, Алфавит.Цифры));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.Вес6,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("3103", "МассаНеттоВКг", 6, Алфавит.Цифры));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.Объем6,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("335Y", "ОбъемВЛитрах", 6, Алфавит.Цифры));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.ГоденДо6,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("17", "ГоденДо", 6, Алфавит.Цифры));
	Результат.Вставить(Перечисления.ЭлементыСоставаКодаМаркировкиИСМП.ГоденДо10,
		РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("7003", "ГоденДо", 10, Алфавит.Цифры));
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьДанныеОписанияКодовМаркировки(ДанныеШаблонаКодаМаркировки, СписокШаблонов, Параметры, ОчищатьПараметры = Истина)
	
	Если СписокШаблонов.Количество() > 0 Тогда
		
		ТипШтрихкодаИВидУпаковки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ТипШтрихкодаИВидУпаковки();
		ТипШтрихкодаИВидУпаковки.ТипШтрихкода = ДанныеШаблонаКодаМаркировки.ТипШтрихкода;
		ТипШтрихкодаИВидУпаковки.ВидУпаковки  = ВидУпаковкиПоТипуКодаМаркировки(ДанныеШаблонаКодаМаркировки.ТипКодаМаркировки);
		
		СоставКодаМаркировки = РазборКодаМаркировкиИСМПСлужебныйКлиентСервер.НовыйСоставКодаМаркировки(ТипШтрихкодаИВидУпаковки);
		СоставКодаМаркировки.ВключаетИдентификаторыПрименения = Параметры.ВключаетИдентификаторыПрименения;
		СоставКодаМаркировки.Вставить("ВключаетКриптоХвост", Ложь);
		
		Если Параметры.ЕстьМРЦ Тогда
			СоставКодаМаркировки.Вставить("ВключаетМРЦ", Ложь);
			СоставКодаМаркировки.Вставить("МРЦ",         0);
			СоставКодаМаркировки.Вставить("МРЦСтрокой",  "");
		КонецЕсли;
		
		Если Параметры.ЕстьВес Тогда
			СоставКодаМаркировки.Вставить("МассаНеттоВКг", Неопределено);
		КонецЕсли;
		
		Если Параметры.ЕстьОбъем Тогда
			СоставКодаМаркировки.Вставить("ОбъемВЛитрах", Неопределено);
		КонецЕсли;
		
		Если Параметры.ЕстьКодТНВЭД Тогда
			СоставКодаМаркировки.Вставить("КодТНВЭД", "");
		КонецЕсли;
		
		НастройкаОписанияКодаМаркировки = РазборКодаМаркировкиИССлужебный.НастройкиОписанияШаблонаКодаМаркировкиВидаПродукции();
		НастройкаОписанияКодаМаркировки.ВидПродукции             = Параметры.ВидПродукции;
		НастройкаОписанияКодаМаркировки.ДанныеОбщегоМодуля       = Параметры.ДанныеОбщегоМодуля;
		НастройкаОписанияКодаМаркировки.ТипШтрихкодаИВидУпаковки = ТипШтрихкодаИВидУпаковки;
		НастройкаОписанияКодаМаркировки.СоставКодаМаркировки     = СоставКодаМаркировки;
		НастройкаОписанияКодаМаркировки.СписокШаблонов           = СписокШаблонов;
		
		Параметры.ДанныеОписанийКодаМаркировки.ОписанияКодовМаркировки.Добавить(НастройкаОписанияКодаМаркировки);
		
	КонецЕсли;
	
	СписокШаблонов = Новый Массив;
	Если ОчищатьПараметры Тогда
		Параметры.ВключаетИдентификаторыПрименения = Истина;
		Параметры.ЕстьМРЦ            = Ложь;
		Параметры.ЕстьВес            = Ложь;
		Параметры.ЕстьКодТНВЭД       = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция ВидУпаковкиПоТипуКодаМаркировки(ТипКодаМаркировки)
	
	Если ТипКодаМаркировки = Перечисления.ТипыКодовМаркировкиИСМП.ГрупповаяУпаковка Тогда
		Возврат Перечисления.ВидыУпаковокИС.Групповая;
	ИначеЕсли ТипКодаМаркировки = Перечисления.ТипыКодовМаркировкиИСМП.Набор Тогда
		Возврат Перечисления.ВидыУпаковокИС.Набор;
	Иначе
		Возврат Перечисления.ВидыУпаковокИС.Потребительская;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОписаниеКодаМаркировки

Процедура ОписаниеКодаМаркировкиПродукцииИзНатуральногоМеха(ДанныеОписанийКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля)

	// Шаблон: (RU|AM|BY|KZ|KG)[-]{1}[A-Z0-9]{6}[-]{1}[A-Z0-9]{10}

	Алфавит = ДанныеОписанийКодаМаркировки.Алфавит;

	ОписаниеЭлементовКМ = Новый Структура("КодСтраны, Секция6, Секция10, Разделитель1, Разделитель2");

	ОписаниеЭлементовКМ.КодСтраны    = РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("", "КодСтраны",    2);
	ОписаниеЭлементовКМ.Секция6      = РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("", "Секция6",      6, Алфавит.БуквыПрописныеЦифры);
	ОписаниеЭлементовКМ.Секция10     = РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("", "Секция10",    10, Алфавит.БуквыПрописныеЦифры);
	ОписаниеЭлементовКМ.Разделитель1 = РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("", "Разделитель1",  1, "-");
	ОписаниеЭлементовКМ.Разделитель2 = РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("", "Разделитель2",  1, "-");

	ШаблоныСтрокой = Новый Массив;
	ШаблоныСтрокой.Добавить("КодСтраны + Разделитель1 + Секция6 + Разделитель2 + Секция10");

	СписокШаблонов = РазборКодаМаркировкиИССлужебный.ОписанияШаблоновКодаМаркировки(ОписаниеЭлементовКМ, ШаблоныСтрокой);

	ТипШтрихкодаИВидУпаковки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ТипШтрихкодаИВидУпаковки();
	ТипШтрихкодаИВидУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.Code128;
	ТипШтрихкодаИВидУпаковки.ВидУпаковки  = Перечисления.ВидыУпаковокИС.Потребительская;

	СоставКодаМаркировки = РазборКодаМаркировкиИСМПСлужебныйКлиентСервер.НовыйСоставКодаМаркировки(ТипШтрихкодаИВидУпаковки);

	// Добавление настроек
	НастройкаОписанияКодаМаркировки = РазборКодаМаркировкиИССлужебный.НастройкиОписанияШаблонаКодаМаркировкиВидаПродукции();
	НастройкаОписанияКодаМаркировки.ВидПродукции             = ВидПродукции;
	НастройкаОписанияКодаМаркировки.ТипШтрихкодаИВидУпаковки = ТипШтрихкодаИВидУпаковки;
	НастройкаОписанияКодаМаркировки.СоставКодаМаркировки     = СоставКодаМаркировки;
	НастройкаОписанияКодаМаркировки.ДанныеОбщегоМодуля       = ДанныеОбщегоМодуля;
	НастройкаОписанияКодаМаркировки.СписокШаблонов           = СписокШаблонов;

	ДанныеОписанийКодаМаркировки.ОписанияКодовМаркировки.Добавить(НастройкаОписанияКодаМаркировки);

КонецПроцедуры

// Формирует описание кода маркировки для логистической упаковки
Процедура ОписаниеКодаМаркировкиЛогистическаяУпаковка18(ДанныеОписанийКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля)
	
	// Примеры:
	//	- исмп:
	//	* 199988888800000013 - из сервиса
	
	Алфавит = ДанныеОписанийКодаМаркировки.Алфавит;
	
	ОписаниеЭлементовКМ = Новый Структура("SSCC");
	ОписаниеЭлементовКМ.SSCC = РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("", "SSCC", 18, Алфавит.Цифры); // Серийный код транспортной упаковки, представленный в виде цифрового номера.
	
	ШаблоныСтрокой = Новый Массив;
	ШаблоныСтрокой.Добавить("SSCC");
	
	СписокШаблонов = РазборКодаМаркировкиИССлужебный.ОписанияШаблоновКодаМаркировки(ОписаниеЭлементовКМ, ШаблоныСтрокой);
	
	ТипШтрихкодаИВидУпаковки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ТипШтрихкодаИВидУпаковки();
	ТипШтрихкодаИВидУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.SSCC;
	ТипШтрихкодаИВидУпаковки.ВидУпаковки  = Перечисления.ВидыУпаковокИС.Логистическая;
	
	СоставКодаМаркировки = РазборКодаМаркировкиИСМПСлужебныйКлиентСервер.НовыйСоставКодаМаркировки(ТипШтрихкодаИВидУпаковки);
	
	// Добавление настроек
	НастройкаОписанияКодаМаркировки = РазборКодаМаркировкиИССлужебный.НастройкиОписанияШаблонаКодаМаркировкиВидаПродукции();
	НастройкаОписанияКодаМаркировки.ВидПродукции             = ВидПродукции;
	НастройкаОписанияКодаМаркировки.ТипШтрихкодаИВидУпаковки = ТипШтрихкодаИВидУпаковки;
	НастройкаОписанияКодаМаркировки.СоставКодаМаркировки     = СоставКодаМаркировки;
	НастройкаОписанияКодаМаркировки.ДанныеОбщегоМодуля       = ДанныеОбщегоМодуля;
	НастройкаОписанияКодаМаркировки.СписокШаблонов           = СписокШаблонов;
	
	ДанныеОписанийКодаМаркировки.ОписанияКодовМаркировки.Добавить(НастройкаОписанияКодаМаркировки);
	
КонецПроцедуры

// Формирует описание кода маркировки для логистической упаковки
Процедура ОписаниеКодаМаркировкиЛогистическаяУпаковка20(ДанныеОписанийКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля)
	
	// Примеры:
	//	- исмп:
	//	* (00)199988888800000013 - в ИБ
	//	* 00199988888800000013 - от сканера
	//	- мотп:
	//	* 00199988888800000013 - из сервиса, от сканера
	//	* (00)199988888800000013 - в ИБ
	
	Алфавит = ДанныеОписанийКодаМаркировки.Алфавит;
	
	ОписаниеЭлементовКМ = Новый Структура("SSCC");
	ОписаниеЭлементовКМ.SSCC = РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("00", "SSCC", 18, Алфавит.Цифры); // Серийный код транспортной упаковки, представленный в виде цифрового номера.
	
	ШаблоныСтрокой = Новый Массив;
	ШаблоныСтрокой.Добавить("SSCC");
	
	СписокШаблонов = РазборКодаМаркировкиИССлужебный.ОписанияШаблоновКодаМаркировки(ОписаниеЭлементовКМ, ШаблоныСтрокой);
	
	ТипШтрихкодаИВидУпаковки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ТипШтрихкодаИВидУпаковки();
	ТипШтрихкодаИВидУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.SSCC;
	ТипШтрихкодаИВидУпаковки.ВидУпаковки  = Перечисления.ВидыУпаковокИС.Логистическая;
	
	СоставКодаМаркировки = РазборКодаМаркировкиИСМПСлужебныйКлиентСервер.НовыйСоставКодаМаркировки(ТипШтрихкодаИВидУпаковки);
	
	// Добавление настроек
	НастройкаОписанияКодаМаркировки = РазборКодаМаркировкиИССлужебный.НастройкиОписанияШаблонаКодаМаркировкиВидаПродукции();
	НастройкаОписанияКодаМаркировки.ВидПродукции             = ВидПродукции;
	НастройкаОписанияКодаМаркировки.ТипШтрихкодаИВидУпаковки = ТипШтрихкодаИВидУпаковки;
	НастройкаОписанияКодаМаркировки.СоставКодаМаркировки     = СоставКодаМаркировки;
	НастройкаОписанияКодаМаркировки.ДанныеОбщегоМодуля       = ДанныеОбщегоМодуля;
	НастройкаОписанияКодаМаркировки.СписокШаблонов           = СписокШаблонов;
	
	ДанныеОписанийКодаМаркировки.ОписанияКодовМаркировки.Добавить(НастройкаОписанияКодаМаркировки);
	
КонецПроцедуры

Процедура ОписаниеАгрегированногоТаможенногоКода(ДанныеОписанийКодаМаркировки, ВидПродукции, ДанныеОбщегоМодуля)
	
	// XXXXXXXXXXXXДДММГГXXXXXXX
	
	Алфавит = ДанныеОписанийКодаМаркировки.Алфавит;
	
	ОписаниеЭлементовКМ = Новый Структура("ИНН, ДатаФормированияАТК, ПризнакУникальности");
	ОписаниеЭлементовКМ.ИНН                 = РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("", "ИНН",                 12, Алфавит.Цифры); // ИНН заявителя (если ИНН состоит из меньшего количества цифр, то ему предшествуют нули (00)
	ОписаниеЭлементовКМ.ДатаФормированияАТК = РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("", "ДатаФормированияАТК",  6, Алфавит.Цифры); // дата формирования оператором агрегированного таможенного кода (ДДММГГ)
	ОписаниеЭлементовКМ.ПризнакУникальности = РазборКодаМаркировкиИССлужебный.ОписаниеЭлементаКодаМаркировки("", "ПризнакУникальности",  7, Алфавит.БуквыЦифры); // генерируются оператором автоматически по произвольному (как правило, последовательному) порядку присвоения. Они обеспечивают уникальность агрегированного таможенного кода на протяжении 5 лет.
	
	ШаблоныСтрокой = Новый Массив;
	ШаблоныСтрокой.Добавить("ИНН + ДатаФормированияАТК + ПризнакУникальности");
	
	СписокШаблонов = РазборКодаМаркировкиИССлужебный.ОписанияШаблоновКодаМаркировки(ОписаниеЭлементовКМ, ШаблоныСтрокой);
	
	ТипШтрихкодаИВидУпаковки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ТипШтрихкодаИВидУпаковки();
	ТипШтрихкодаИВидУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.ПустаяСсылка();
	ТипШтрихкодаИВидУпаковки.ВидУпаковки  = Перечисления.ВидыУпаковокИС.АгрегированныйТаможенныйКод;
	
	СоставКодаМаркировки = РазборКодаМаркировкиИСМПСлужебныйКлиентСервер.НовыйСоставКодаМаркировки(ТипШтрихкодаИВидУпаковки);
	
	// Добавление настроек
	НастройкаОписанияКодаМаркировки = РазборКодаМаркировкиИССлужебный.НастройкиОписанияШаблонаКодаМаркировкиВидаПродукции();
	НастройкаОписанияКодаМаркировки.ВидПродукции             = ВидПродукции;
	НастройкаОписанияКодаМаркировки.ТипШтрихкодаИВидУпаковки = ТипШтрихкодаИВидУпаковки;
	НастройкаОписанияКодаМаркировки.СоставКодаМаркировки     = СоставКодаМаркировки;
	НастройкаОписанияКодаМаркировки.ДанныеОбщегоМодуля       = ДанныеОбщегоМодуля;
	НастройкаОписанияКодаМаркировки.СписокШаблонов           = СписокШаблонов;
	
	ДанныеОписанийКодаМаркировки.ОписанияКодовМаркировки.Добавить(НастройкаОписанияКодаМаркировки);
	
КонецПроцедуры

#КонецОбласти

Процедура ДобавитьБуквенныеКодыСтранДляПродукцииИзНатуральногоМеха(НастройкиРазбораКодаМаркировки, МодулиПодсистемы)
	
	Если Не НастройкиРазбораКодаМаркировки.ДополнительныеПараметры.Свойство(МодулиПодсистемы.Подсистема) Тогда
		НастройкиРазбораКодаМаркировки.ДополнительныеПараметры.Вставить(МодулиПодсистемы.Подсистема, Новый Структура);
	КонецЕсли;
	ДополнительныеПараметрыПодсистемы = НастройкиРазбораКодаМаркировки.ДополнительныеПараметры[МодулиПодсистемы.Подсистема];
	
	Если Не ДополнительныеПараметрыПодсистемы.Свойство("ПродукцияИзНатуральногоМеха") Тогда
		ДополнительныеПараметрыПодсистемы.Вставить("ПродукцияИзНатуральногоМеха", Новый Структура);
	КонецЕсли;
	ПродукцияИзНатуральногоМеха = ДополнительныеПараметрыПодсистемы.ПродукцияИзНатуральногоМеха;
	
	Если Не ПродукцияИзНатуральногоМеха.Свойство("БуквенныеКодыСтран") Тогда
		ПродукцияИзНатуральногоМеха.Вставить("БуквенныеКодыСтран", Новый Соответствие);
	КонецЕсли;
	БуквенныеКодыСтран = ПродукцияИзНатуральногоМеха.БуквенныеКодыСтран;
	
	Если БуквенныеКодыСтран.Количество() = 0 Тогда
		Для Каждого БуквенныйКодСтраны Из СтрРазделить("RU|AM|BY|KZ|KG", "|") Цикл
			БуквенныеКодыСтран.Вставить(БуквенныйКодСтраны, Истина);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьШаблоныНеФормализованныхКодовМаркировки(НастройкиРазбораКодаМаркировки, МодулиПодсистемы, ИмяШаблона)
	
	ШаблоныНеФормализованныхКодовМаркировки = РазборКодаМаркировкиИСМПСлужебныйКлиентСервер.ШаблоныНеФормализованныхКодовМаркировки(
		НастройкиРазбораКодаМаркировки, МодулиПодсистемы.Подсистема, ИмяШаблона);
	
	Для Каждого ШаблонНеФормализованныхКодовМаркировки Из ШаблоныНеФормализованныхКодовМаркировки Цикл
		СтрокаШаблонаКМ = НастройкиРазбораКодаМаркировки.ШаблоныКодовМаркировки.Найти(ШаблонНеФормализованныхКодовМаркировки.Шаблон, "Шаблон");
		ШаблонНеФормализованныхКодовМаркировки.Вставить("СтрокаШаблона",
			ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаШаблонаКМ));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
