////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы библиотеки интеграции с МОТП.
// 
/////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Получение сведений о библиотеке (или конфигурации).

// Редакция подсистемы.
// 
// Возвращаемое значение:
//  Строка - Редакция подсистемы
Функция РедакцияПодсистемы() Экспорт

	Возврат "11";

КонецФункции

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииПодсистемы
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	РедакцияПодсистемы = РедакцияПодсистемы();
	Описание.Имя       = "БиблиотекаИнтеграцииИСМП";
	Описание.Версия    = ОбщегоНазначенияИС.ВерсияПодсистемы(РедакцияПодсистемы);
	Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
	
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	Описание.ТребуемыеПодсистемы.Добавить("БиблиотекаПодключаемогоОборудования");
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
#Область Монопольно
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "10.1.2.102";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыИСМП.НачальноеЗаполнениеГИСМТ";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение настроек интеграции ГИС МП.'");
	
#КонецОбласти

#Область Отложенно
	
	Если ОбщегоНазначенияИСМП.ЭтоРасширеннаяВерсияГосИС() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "10.1.1.3";
		Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Процедура = "Справочники.ШтрихкодыУпаковокТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсиюЗаполнениеХешСуммаЗначенияШтрихкодаGS1";
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("b0ecb2a5-bc53-43c4-a2ab-9b3e5e1d60f7");
		Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.ШтрихкодыУпаковокТоваров.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюЗаполнениеХешСуммаЗначенияШтрихкодаGS1";
		Обработчик.ОчередьОтложеннойОбработки = 2;
		Обработчик.ПроцедураПроверки = "";
		Обработчик.ЧитаемыеОбъекты = "Справочник.ШтрихкодыУпаковокТоваров";
		Обработчик.ИзменяемыеОбъекты = "Справочник.ШтрихкодыУпаковокТоваров";
		Обработчик.БлокируемыеОбъекты = "";
		Обработчик.Комментарий = НСтр("ru = 'Заполнение реквизита ХешСуммаНормализации'");
		Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
		ОбновлениеИнформационнойБазыГосИС.ДополнитьПриоритетВыполненияОбработчикаОбновленияСправочникаШтрихкодыУпаковокТоваров(Обработчик.ПриоритетыВыполнения);
		
	КонецЕсли;
	
	Для Каждого ОбъектМетаданных Из МетаданныеДляПереходаНаКонструкторНастроек() Цикл
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
		Менеджер.ПриДобавленииОбработчиковОбновления(Обработчики);
	КонецЦикла;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "11.0.5.2";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "РегистрыСведений.НастройкиПодключенияЛокальныхМодулейИСМП.ОбработатьДанныеДляПереходаНаНовуюВерсиюЗаполнениеФорматаОбмена";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9d79a24d-49f8-46f9-b44b-2b3de70adb94");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.НастройкиПодключенияЛокальныхМодулейИСМП.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюЗаполнениеФорматаОбмена";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ЧитаемыеОбъекты = "РегистрСведений.НастройкиПодключенияЛокальныхМодулейИСМП";
	Обработчик.ИзменяемыеОбъекты = "РегистрСведений.НастройкиПодключенияЛокальныхМодулейИСМП";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение формата обмена по умолчанию'");
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	
#КонецОбласти

КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПередОбновлениемИнформационнойБазы
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
	ВерсияКонфигурации = ОбновлениеИнформационнойБазы.ВерсияИБ(Метаданные.Имя);
	Если ВерсияКонфигурации <> "0.0.0.0" Тогда
		
		ИдентификаторБиблиотекаИнтеграцииИСМП = "БиблиотекаИнтеграцииИСМП";
		ВерсияБиблиотекаИнтеграцииИСМП = ОбновлениеИнформационнойБазы.ВерсияИБ(ИдентификаторБиблиотекаИнтеграцииИСМП);
		Если ВерсияБиблиотекаИнтеграцииИСМП = "0.0.0.0" Тогда
			
			ОбновлениеИнформационнойБазы.УстановитьВерсиюИБ("БиблиотекаИнтеграцииИСМП", "1.0.0.0", Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПослеОбновленияИнформационнойБазы
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриПодготовкеМакетаОписанияОбновлений
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
	Возврат;

КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура:
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Регистрация данных при переходе на конструктор настроек видов продукции.
// 
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеСсылочногоТипаПриПереходеНаКонстукторНастроекПоВидуПродукции(ОбъектМетаданных, Параметры) Экспорт
	
	ПолноеИмяОбъекта                     = ОбъектМетаданных.ПолноеИмя();
	ПараметрыВыборки                     = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПолноеИмяОбъекта;
	ПараметрыВыборки.СпособВыборки       = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	ДоступнаСледующаяСтраница            = Истина;
	Курсор                               = "";
	
	Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
		ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойВидПродукции",   Перечисления.ВидыПродукцииИС.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяТоварнаяГруппа", Справочники.ТоварныеГруппыГИСМТ.ПустаяСсылка());
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	&ИмяТаблицы КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка > &Курсор
		|	И Таблица.УдалитьВидПродукции <> &ПустойВидПродукции
		|	И Таблица.ТоварнаяГруппа = &ПустаяТоварнаяГруппа
		|	
		|УПОРЯДОЧИТЬ ПО
		|	Таблица.Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ПолноеИмяОбъекта);
	
	Пока ДоступнаСледующаяСтраница Цикл
		
		Запрос.УстановитьПараметр("Курсор", Курсор);
		
		//@skip-check query-in-loop
		ТабицаДанных    = Запрос.Выполнить().Выгрузить();
		КоличествоСтрок = ТабицаДанных.Количество();
		
		Если КоличествоСтрок > 0 Тогда
			
			ИндексПоследнейСтроки = КоличествоСтрок - 1;
			ДанныеДляОбработки    = ТабицаДанных.ВыгрузитьКолонку("Ссылка");
			
			ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ДанныеДляОбработки);
			
			Если КоличествоСтрок = 1000 Тогда
				Курсор = ТабицаДанных[ИндексПоследнейСтроки].Ссылка;
			Иначе
				ДоступнаСледующаяСтраница = Ложь;
			КонецЕсли;
			
		Иначе
			
			ДоступнаСледующаяСтраница = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработка данных перехода на конструктор настроек видов продукции
// 
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсиюКонструктораНастроек(ОбъектМетаданных, Параметры) Экспорт
	
	ПолноеИмяОбъекта     = ОбъектМетаданных.ПолноеИмя();
	ОбработанныхОбъектов = 0;
	ПроблемныхОбъектов   = 0;
	ОбновляемыеДанные    = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	ПроблемыСДанными     = Новый Соответствие();
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
			Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	КешКонвертаций = ОбновлениеИнформационнойБазыГосИС.КешКонвертацийВидаПродукции();
	Если ОбъектМетаданных = Метаданные.Документы["ЗаказНаЭмиссиюКодовМаркировкиСУЗ"] Тогда
		МенеджерДополнительнойОбработки = Документы["ЗаказНаЭмиссиюКодовМаркировкиСУЗ"];
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы["ВыводИзОборотаИСМП"] Тогда
		МенеджерДополнительнойОбработки = Документы["ВыводИзОборотаИСМП"];
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы["СписаниеКодовМаркировкиИСМП"] Тогда
		МенеджерДополнительнойОбработки = Документы["СписаниеКодовМаркировкиИСМП"];
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы["ВозвратВОборотИСМП"] Тогда
		МенеджерДополнительнойОбработки = Документы["ВозвратВОборотИСМП"];
	КонецЕсли;
	
	Для Каждого ДанныеКОбработке Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			ПоляБлокировки = Новый Структура("Ссылка", ДанныеКОбработке.Ссылка);
			ОбщегоНазначенияИС.УстановитьУправляемуюБлокировку(ПолноеИмяОбъекта, ПоляБлокировки);
			
			ОбъектДанных = ДанныеКОбработке.Ссылка.ПолучитьОбъект();
			
			Если ОбъектДанных = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ДанныеКОбработке.Ссылка);
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОбъектДанных.УдалитьВидПродукции) Тогда
				
				ОбъектДанных.ТоварнаяГруппа = ТоварнаяГруппаПоПеречислениюВидПродукции(
					ОбъектДанных.УдалитьВидПродукции,
					КешКонвертаций);
				
				Если Не ЗначениеЗаполнено(ОбъектДанных.ТоварнаяГруппа) Тогда
					ВызватьИсключение СтрШаблон(
						НСтр("ru = 'Не удалось получить товарную группу по виду продукции ""%1""'"),
						ОбъектДанных.УдалитьВидПродукции);
				КонецЕсли;
				
				Если МенеджерДополнительнойОбработки <> Неопределено Тогда
					МенеджерДополнительнойОбработки.ДополнительнаяОбработкаДанныхПриПереходеНаКонструкторНастроек(
						ОбъектДанных, ПроблемыСДанными, КешКонвертаций);
				КонецЕсли;
				
			Иначе
				
				ПроблемыСДанными[ДанныеКОбработке.Ссылка] = СтрШаблон(
					НСтр("ru = 'Не удалось обработать пустой вид продукции при переходе на конструктор настроек видов продукции для объекта ""%1""'"),
					ДанныеКОбработке.Ссылка);
					
			КонецЕсли;
			
			Если ОбъектДанных.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДанных, Ложь);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ДанныеКОбработке.Ссылка);
			КонецЕсли;
			
			ОбработанныхОбъектов = ОбработанныхОбъектов + 1;
			
			ЗафиксироватьТранзакцию();

		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Не удалось обработать ""%1"" при переходе на конструктор настроек видов продукции по причине:
					       |%2'"),
				ДанныеКОбработке.Ссылка,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				ОбъектДанных,,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого НеобработанныйОбъект Из ПроблемыСДанными Цикл
		ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(
			НеобработанныйОбъект.Ключ,
			НеобработанныйОбъект.Значение,
			Параметры);
	КонецЦикла;
	
	Если ОбработанныхОбъектов = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать некоторые данные ""%1"": %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектМетаданных.Синоним, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция ""%1"": %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектМетаданных.Синоним, ОбработанныхОбъектов);
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			ОбъектМетаданных,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов = Параметры.ПрогрессВыполнения.ОбработаноОбъектов
		+ ОбработанныхОбъектов;
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

// Регистрация данных при переходе на конструктор настроек видов продукции.
// 
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//  ИмяНовогоПоля - Строка -
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюКонструктораНастроекРегистрСведений(ОбъектМетаданных, Параметры, ИмяНовогоПоля) Экспорт
	
	ПолноеИмяОбъекта                      = ОбъектМетаданных.ПолноеИмя();
	ПараметрыВыборки                      = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяОбъекта;
	ПараметрыВыборки.СпособВыборки        = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра             = ПолноеИмяОбъекта;
	
	ДанныеПолей = Новый Массив;
	Для Каждого Измерение Из ОбъектМетаданных.Измерения Цикл
		Если Измерение.Имя = ИмяНовогоПоля Тогда
			Продолжить;
		КонецЕсли;
		ДанныеПолей.Добавить(СтрШаблон("Таблица.%1 КАК %1", Измерение.Имя));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойВидПродукции", Перечисления.ВидыПродукцииИС.ПустаяСсылка());
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&ВыбираемыеПоля
		|ИЗ
		|	&ИмяТаблицы КАК Таблица
		|ГДЕ
		|	Таблица.УдалитьВидПродукции <> &ПустойВидПродукции";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы",     ПолноеИмяОбъекта);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВыбираемыеПоля", СтрСоединить(ДанныеПолей, "," + Символы.ПС));
	
	Данные = Запрос.Выполнить().Выгрузить();
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Данные, ДополнительныеПараметры);
	
КонецПроцедуры

// Обработка данных перехода на конструктор настроек видов продукции
// 
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//  ИмяНовогоПоля - Строка -
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсиюКонструктораНастроекРегистраСведений(ОбъектМетаданных, Параметры, ИмяНовогоПоля) Экспорт
	
	ПолноеИмяОбъекта     = ОбъектМетаданных.ПолноеИмя();
	ОбработанныхОбъектов = 0;
	ПроблемныхОбъектов   = 0;
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
			Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	КешКонвертаций  = ОбновлениеИнформационнойБазыГосИС.КешКонвертацийВидаПродукции();
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
	
	Для Каждого СтрокаКлюча Из ОбновляемыеДанные Цикл
		
		НаборЗаписей = МенеджерОбъекта.СоздатьНаборЗаписей();
		Для Каждого ЭлементИзмерения Из ОбновляемыеДанные.Колонки Цикл
			Если ЭлементИзмерения.Имя = ИмяНовогоПоля Тогда
				Продолжить;
			КонецЕсли;
			НаборЗаписей.Отбор[ЭлементИзмерения.Имя].Установить(СтрокаКлюча[ЭлементИзмерения.Имя]);
		КонецЦикла;
		
		НачатьТранзакцию();
		
		Попытка
			
			ОбщегоНазначенияИС.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(НаборЗаписей);
			НаборЗаписей.Прочитать();
			
			ЕстьИзменения = Ложь;
			
			Для Каждого СтрокаНабора Из НаборЗаписей Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаНабора.УдалитьВидПродукции)
					Или ЗначениеЗаполнено(СтрокаНабора[ИмяНовогоПоля]) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ИмяНовогоПоля = "ТоварнаяГруппа" Тогда
					ЗначениеНовогоПоля = ТоварнаяГруппаПоПеречислениюВидПродукции(
						СтрокаНабора.УдалитьВидПродукции, КешКонвертаций);
				ИначеЕсли ИмяНовогоПоля = "ВидПродукции" Тогда
					ЗначениеНовогоПоля = ВидПродукцииГИСМТПоПеречислению(
						СтрокаНабора.УдалитьВидПродукции, КешКонвертаций);
				Иначе
					ТекстСообщения = СтрШаблон(
						НСтр("ru = 'Внутренняя ошибка. Неизвестное имя нового поля ""%1"" при переходе на конструктор настроек видов продукции'"),
						ИмяНовогоПоля);
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
				
				СтрокаНабора[ИмяНовогоПоля] = ЗначениеНовогоПоля;
				
				ЕстьИзменения = Истина;
				
			КонецЦикла;
			
			Если ЕстьИзменения Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей,, Ложь);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ОбработанныхОбъектов = ОбработанныхОбъектов + 1;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Не удалось обработать ""%1"" при переходе на конструктор настроек видов продукции по причине:
					       |%2'"),
				ПолноеИмяОбъекта,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,,,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбработанныхОбъектов = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать некоторые данные ""%1"": %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектМетаданных.Синоним, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция ""%1"": %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектМетаданных.Синоним, ОбработанныхОбъектов);
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			ОбъектМетаданных,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов = Параметры.ПрогрессВыполнения.ОбработаноОбъектов
		+ ОбработанныхОбъектов;
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

// Товарная группа по перечислению вид продукции.
// 
// Параметры:
//  ЗначениеПеречисления - ПеречислениеСсылка.ВидыПродукцииИС - Значение перечисления
//  ДанныеКеша - см. ОбновлениеИнформационнойБазыГосИС.КешКонвертацийВидаПродукции
// 
// Возвращаемое значение:
//  Произвольный - Товарная группа по перечислению вид продукции
Функция ТоварнаяГруппаПоПеречислениюВидПродукции(ЗначениеПеречисления, ДанныеКеша) Экспорт
	
	Если ДанныеКеша.РезультаТоварныеГруппыГИСМТ[ЗначениеПеречисления] <> Неопределено Тогда
		Возврат ДанныеКеша.РезультаТоварныеГруппыГИСМТ[ЗначениеПеречисления];
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЗначениюПеречисления(ЗначениеПеречисления);
	
	Если ВидыПродукции.Количество() Тогда
		
		Для Каждого ВидПродукции Из ВидыПродукции Цикл
			
			Если ДанныеКеша.ВидыПродукцииГИСМТ.Найти(ВидПродукции) <> Неопределено Тогда
				
				ТоварнаяГруппа = КонструкторИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаПоВидуПродукции(
					ВидПродукции);
				
				Если ЗначениеЗаполнено(ТоварнаяГруппа) Тогда
					ДанныеКеша.РезультаТоварныеГруппыГИСМТ[ВидПродукции] = ТоварнаяГруппа;
					Возврат ТоварнаяГруппа;
				Иначе
					ТекстСообщения  = СтрШаблон(
						НСтр("ru = 'Не удалось получить товарную группу по виду продукции ""%1""'"),
						ВидПродукции);
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	
	Иначе
		
		ТекстСообщения  = СтрШаблон(
			НСтр("ru = 'Не удалось получить вид продукции конструктора по ""%1""'"),
			ЗначениеПеречисления);
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
КонецФункции

// Вид продукции ГИСМТ по перечислению.
// 
// Параметры:
//  ЗначениеПеречисления - ПеречислениеСсылка.ВидыПродукцииИС
//  ДанныеКеша - см. КешКонвертацийВидаПродукции
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыПродукцииИС, Произвольный - Вид продукции ГИСМТ по перечислению
Функция ВидПродукцииГИСМТПоПеречислению(ЗначениеПеречисления, ДанныеКеша) Экспорт
	
	Если ДанныеКеша.РезультаВидыПродукцииГИСМТ[ЗначениеПеречисления] <> Неопределено Тогда
		Возврат ДанныеКеша.РезультаВидыПродукцииГИСМТ[ЗначениеПеречисления];
	ИначеЕсли ЗначениеПеречисления = Перечисления.ВидыПродукцииИС.Зерно
		Или ЗначениеПеречисления = Перечисления.ВидыПродукцииИС.ПродуктыПереработкиЗерна
		Или ЗначениеПеречисления = Перечисления.ВидыПродукцииИС.ЗерноВЕТИС
		Или ЗначениеПеречисления = Перечисления.ВидыПродукцииИС.ПродуктыПереработкиЗернаВЕТИС
		Или ЗначениеПеречисления = Перечисления.ВидыПродукцииИС.ПодконтрольнаяПродукцияВЕТИС
		Или ЗначениеПеречисления = Перечисления.ВидыПродукцииИС.ПодконтрольнаяПродукцияСАТУРН
		Или ЗначениеПеречисления = Перечисления.ВидыПродукцииИС.Алкогольная
		Или ЗначениеПеречисления = Перечисления.ВидыПродукцииИС.АлкогольнаяПродукцияДо9Процентов Тогда
		Возврат Справочники.ВидыПродукцииИС.ПустаяСсылка();
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЗначениюПеречисления(
		ЗначениеПеречисления);
	
	Для Каждого ВидПродукции Из ВидыПродукции Цикл
		
		Если ДанныеКеша.ВидыПродукцииГИСМТ.Найти(ВидПродукции) <> Неопределено Тогда
			ДанныеКеша.РезультаВидыПродукцииГИСМТ[ЗначениеПеречисления] = ВидПродукции;
			Возврат ВидПродукции;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстСообщения  = СтрШаблон(
		НСтр("ru = 'Не удалось получить вид продукции ГИСМТ по виду продукции ""%1""'"),
		ЗначениеПеречисления);
	ВызватьИсключение ТекстСообщения;
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("НачальноеЗаполнениеГИСМТ");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

Процедура НачальноеЗаполнениеГИСМТ() Экспорт
	
	Если ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС() Тогда
		
		МодульИнтеграцияИС = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСВызовСервера");
		
		Если Не ЗначениеЗаполнено(МодульИнтеграцияИС.ЕдиницаИзмеренияКилограмм()) Тогда
			
			ЕдиницаИзмеренияКилограмм = Неопределено;
			
			МодульИнтеграцияИСПереопределяемый = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
			МодульИнтеграцияИСПереопределяемый.ЕдиницаИзмеренияКилограмм(ЕдиницаИзмеренияКилограмм);
			
			Если ЕдиницаИзмеренияКилограмм <> Неопределено Тогда
				ИмяКонстанты = "ЕдиницаИзмеренияКилограммИС";
				Константы[ИмяКонстанты].Установить(ЕдиницаИзмеренияКилограмм);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеДляОбновленияИсключенийКонтроляСтатусовИВладельцев(Параметры) Экспорт
	
	Возврат;

КонецПроцедуры

Функция ШаблонКодаМаркировкиПоЗначениюПеречисления(ЗначениеПеречисления, ТоварнаяГруппа, КешКонвертаций) Экспорт
	
	Если КешКонвертаций.ШаблоныПоТоварнымГруппам.Количество() = 0 Тогда
		
		ТоварныеГруппы      = ТоварныеГруппыПоВидамПродукции();
		ЭлементКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС.СвязьЭлементаСправочникаИЗначенияЗначенияПеречисленияШаблоныКодовМаркировки;
		ДанныеЭлемента      = КонструкторИСОбщегоНазначенияКлиентСервер.ДанныеЭлементаКонструктора(ЭлементКонструктора);
		
		Для Каждого КлючИЗначение Из ДанныеЭлемента.ВидыПродукции Цикл
			
			ВидПродукции                  = КлючИЗначение.Ключ;
			ТоварнаяГруппаПоВидуПродукции = ТоварныеГруппы[ВидПродукции];
			
			Если Не ЗначениеЗаполнено(ТоварнаяГруппаПоВидуПродукции) Тогда
				ТекстСообщения = СтрШаблон(
					НСтр("ru = 'Не удалось получить товарную групу по виду продукции ""%1 "" при переходе на конструктор настроек видов продукции при конвертации шаблона %2'"),
					ВидПродукции,
					ЗначениеПеречисления);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			
			ШаблоныПоТоварнойГруппе = КешКонвертаций.ШаблоныПоТоварнымГруппам[ТоварнаяГруппаПоВидуПродукции];
			Если ШаблоныПоТоварнойГруппе = Неопределено Тогда
				ШаблоныПоТоварнойГруппе = Новый Соответствие();
				КешКонвертаций.ШаблоныПоТоварнымГруппам[ТоварнаяГруппаПоВидуПродукции] = ШаблоныПоТоварнойГруппе;
			Иначе
				Продолжить;
			КонецЕсли;
			
			Для Каждого КлючИЗначениеПоВидуПродукции Из КлючИЗначение.Значение Цикл
				
				ШаблонПеречисление = КлючИЗначениеПоВидуПродукции.Ключ;
				Шаблон             = Неопределено;
				
				Если КлючИЗначениеПоВидуПродукции.Значение = Неопределено
					Или Не КлючИЗначениеПоВидуПродукции.Значение.Свойство("Шаблон", Шаблон)
					Или Не ЗначениеЗаполнено(Шаблон) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Шаблон) Тогда
					ШаблоныПоТоварнойГруппе[ШаблонПеречисление] = Шаблон;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
	
	КонецЕсли;
	
	ШаблоныПоТоварнойГруппе = КешКонвертаций.ШаблоныПоТоварнымГруппам[ТоварнаяГруппа];
	Если ШаблоныПоТоварнойГруппе = Неопределено Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось получить шаблоны по товарной группе ""%1"" при переходе на конструктор настроек видов продукции'"),
			ТоварнаяГруппа);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Результат = ШаблоныПоТоварнойГруппе[ЗначениеПеречисления];
	
	Если Результат = Неопределено
		И ШаблоныПоТоварнойГруппе.Количество() Тогда
		
		Для Каждого КлючИЗначение Из КешКонвертаций.ШаблоныПоТоварнымГруппам Цикл
			
			Для Каждого КлючИЗначениеШаблон Из КлючИЗначение.Значение Цикл
				
				Если КлючИЗначениеШаблон.Ключ = ЗначениеПеречисления Тогда
					Результат = КлючИЗначениеШаблон.Значение;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Результат <> Неопределено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось получить шаблон по значению перечисления ""%1"" (товарная группа %2) при переходе на конструктор настроек видов продукции'"),
			ЗначениеПеречисления,
			ТоварнаяГруппа);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТоварныеГруппыПоВидамПродукции()
	
	Результат = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗначенияЭлементовКонструктораВидовПродукцииИС.ВидПродукции,
		|	ЗначенияЭлементовКонструктораВидовПродукцииИС.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктораВидовПродукцииИС
		|ГДЕ
		|	ЗначенияЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора = &ЭлементКонструктора";
	
	Запрос.УстановитьПараметр("ЭлементКонструктора", Справочники.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Вставить(ВыборкаДетальныеЗаписи.ВидПродукции, ВыборкаДетальныеЗаписи.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВидыВозвратаВОборотКонструктораНастроекПоПеречислению() Экспорт
	
	Результат                   = Новый Соответствие;
	СправочникиПоИдентификатору = Новый Соответствие;
	Запрос                      = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыВозвратаВОборотИСМП.Имя,
		|	ВидыВозвратаВОборотИСМП.Ссылка
		|ИЗ
		|	Справочник.ВидыВозвратаВОборотИСМП КАК ВидыВозвратаВОборотИСМП";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СправочникиПоИдентификатору.Вставить(Выборка.Имя, Выборка.Ссылка);
	КонецЦикла;
	
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриРозничнойРеализации,
		СправочникиПоИдентификатору["RETAIL_RETURN"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВозвратВОборотПриДистанционномСпособеПродажи,
		СправочникиПоИдентификатору["REMOTE_SALE_RETURN"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВозвратВОборотТовараВыведенногоИзОборотаВЦеляхНеСвязанныхСРеализацией,
		СправочникиПоИдентификатору["OWN_USE_RETURN"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВозвратВОборотТовараПриобретавшегосяНеДляПродажи,
		СправочникиПоИдентификатору["NOT_FOR_SALE_RETURN"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВозвратВОборотТовараВыведенногоДляПроизводственныхЦелей,
		СправочникиПоИдентификатору["PRODUCTION_USE_RETURN"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВозвратВОборотПриПродажеЧерезВендинговыйАппарат,
		СправочникиПоИдентификатору["VENDING_RETURN"]);
	Результат.Вставить(
		Перечисления.ВидыОперацийИСМП.УдалитьВозвратТовараВОборотПоСделкеСГосТайной,
		СправочникиПоИдентификатору["STATE_CONTRACT_RETURN"]);
	
	Возврат Результат;

КонецФункции

Функция МетаданныеДляПереходаНаКонструкторНастроек() Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	ВозвращаемоеЗначение.Добавить(Метаданные.РегистрыСведений.УдалитьНастройкиУчетаМаркируемойПродукцииИСМП);
	ВозвращаемоеЗначение.Добавить(Метаданные.РегистрыСведений.ОчередьСообщенийИСМП);
	
	Если ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС() Тогда
		
		ВозвращаемоеЗначение.Добавить(Метаданные.Справочники["СервисПровайдерыСУЗ"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.Документы["ВозвратВОборотИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.Документы["ВыводИзОборотаИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.Документы["ЗаказНаЭмиссиюКодовМаркировкиСУЗ"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.Документы["МаркировкаТоваровИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.Документы["ОтгрузкаТоваровИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.Документы["ПеремаркировкаТоваровИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.Документы["ПриемкаТоваровИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.Документы["СписаниеКодовМаркировкиИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.Документы["УточнениеСведенийОКодахМаркировкиИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.Документы["ОтчетИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.Документы["ПеремещениеМеждуМОДИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.РегистрыСведений["КодыТНВЭДИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.РегистрыСведений["КэшОписанияОстатковИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.РегистрыСведений["СинхронизацияДанныхИСМП"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.РегистрыСведений["ПулКодовМаркировкиСУЗ"]);
		ВозвращаемоеЗначение.Добавить(Метаданные.РегистрыСведений["ТоварныеГруппыДокументаГИСМТ"]);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти