// 1. В объекте разместить реквизиты:
//	1.1. Статус - ПеречислениеСсылка - Определяющее перечень статусов документа
//	1.2. Автор - СправочникСсылка.Пользователи - Автор документа
//	1.3. Исполнитель- СправочникСсылка.Пользователи - Текущий исполнитель по документу
//	1.4. Комментарий - Строка - Текущий комментарий в документе
//	1.5. Протокол - ТабличнаяЧасть - См. пример в документе "ЗаявкаНаОбеспечение"
//	
// 2. В модуле объекта в событии "ПередЗаписью" вызвать "РаботаСПротоколомДокумента.ПередЗаписью"
//
// 3. В форме объекта:
//	3.1. Вызвать метод "РаботаСПротоколом.ЗаполнитьДанныеФормы" из событий "ПриЧтенииНаСервере", "ПриСозданииНаСервере", "ПослеЗаписиНаСервере"
//	3.2. Добавить реквизит формы "ПредставлениеИсполнителя" - форматированная строка, выведенная на форму с обработкой навигационной ссылки,
//		вызывающей метод "РаботаСПротоколомДокументаКлиент.ОбработатьНавигационнуюСсылкуПротокола".
//	3.3. Добавить реквизит формы "ПредставлениеСтатуса" - аналогично "ПредставлениеИсполнителя".
//	3.4. Добавить метод "Подключаемый_ПриИзмененииПротокола", который будет вызван при изменении реквизитов протокола:
//		//Процедура Подключаемый_ПриИзмененииПротокола(ОписаниеИзменений, ДополнительныеПараметры = Неопределено) Экспорт
//		//КонецПроцедуры

// 4. В перечисление, указываемом в статусе объекта, описать методы:
//	4.1. ЭтоКонечныйСтатусДокумента(Статус). Пример:
//		// Проверяет, что значение статуса завершает процесс работы с документом
//		// 
//		// Параметры:
//		//  Статус - ПеречислениеСсылка.ИмяПеречисления - Проверяемый статус
//		// 
//		// Возвращаемое значение:
//		//  Булево - Истина, если значение статуса входит в список конечных статусов перечисления
//		Функция ЭтоКонечныйСтатусДокумента(Статус) Экспорт
//		
//			Возврат КонечныеСтатусы().Найти(Статус) <> Неопределено;
//		
//		КонецФункции
//
//	4.2 // ЗаполнитьДоступныеМаршрутыСтатусов. Пример:
//		// Параметры:
//		//  Форма - ФормаКлиентскогоПриложения - Владелец протокола
//		Процедура ЗаполнитьДоступныеМаршрутыСтатусов(Форма) Экспорт
//			РаботаСПротоколомДокумента.ДобавитьДоступныйМаршрут(
//					Форма,
//					НаСогласовании,
//					НаВыполнении,
//					НСтр("ru = 'Передать на выполнение'"),
//					"Менеджер");
//		КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытий

// Обработчик событий "ОбработкаНавигационнойСсылки" для полей протокола.
// 
// Параметры:
//  ФормаВладелец - ФормаКлиентскогоПриложения - Владелец протокола.
//  НавигационнаяСсылкаПротокола - Строка - Значение навигационной ссылки из полей протокола
//  СтандартнаяОбработка - Булево - Возвращаемый параметр. Отключает стандартную обработку в событии-источнике
Процедура ОбработатьНавигационнуюСсылкуПротокола(ФормаВладелец, НавигационнаяСсылкаПротокола, СтандартнаяОбработка = Ложь) Экспорт
	
	СтандартнаяОбработка = Ложь;
		
	Если НавигационнаяСсылкаПротокола = "ОткрытьПротокол" Тогда
		
		ОткрытьПротокол(ФормаВладелец);
		Возврат;
		
	КонецЕсли;
	
	// Добавление новой строки одним из способов:
	Объект = ФормаВладелец.Объект;
	
	ПараметрыОткрытия = ПараметрыОткрытияСтрокиПротокола();
	РаботаСПротоколомДокументаКлиентСервер.ЗаполнитьСвойстваПротоколаИзОбъекта(ПараметрыОткрытия.ДанныеПротокола, Объект);
	ПараметрыОткрытия.АвторДокумента = Объект.Автор;
	ПараметрыОткрытия.ДанныеПротокола.Комментарий = ""; // Не устанавливаем значение (очищаем после заполнения из объекта).
	Если НавигационнаяСсылкаПротокола = РаботаСПротоколомДокументаКлиентСервер.ЗначениеКомандыПеренаправить() Тогда
		
		// 1. Статус не изменяется, не отображается. Форма открывается для установки нового исполнителя.
		ПараметрыОткрытия.Заголовок = НСтр("ru = 'Перенаправление документа'");
		
	ИначеЕсли НавигационнаяСсылкаПротокола = "ИзменитьСтатус" Тогда
		
		// 2. Статус можно выбрать из доступных значений. 
		ПараметрыОткрытия.Заголовок = НСтр("ru = 'Изменение статуса документа'");
		ПараметрыОткрытия.ИзменятьСтатус = Истина;
		
	Иначе
		
		// 3. Выполняется переход через "помощник". Значения статуса и исполнителя определяются автоматически:
		УстанавливаемыйСтатус = ПредопределенноеЗначение(НавигационнаяСсылкаПротокола);
		УстанавливаемыйИсполнитель = ОпределитьИсполнителяПоМаршруту(ФормаВладелец, УстанавливаемыйСтатус);
		
		ПараметрыОткрытия.ДанныеПротокола.Статус = УстанавливаемыйСтатус;
		ПараметрыОткрытия.ДанныеПротокола.Исполнитель = УстанавливаемыйИсполнитель;
		
		ПараметрыОткрытия.Заголовок = СтрШаблон(НСтр("ru = 'Установка статуса ""%1""'"), УстанавливаемыйСтатус);
		
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ФормаВладелец", ФормаВладелец);
	ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ПередДобавлениемСтрокиПротокола", ЭтотОбъект, ПараметрыОповещения);
	
	ОткрытьСтрокуПротокола(ФормаВладелец, ПараметрыОткрытия, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтрокаПротокола

// Параметры открытия формы строки протокола.
// 
// Возвращаемое значение:
//  Структура - Параметры открытия формы:
// * ДанныеПротокола - См. РаботаСПротоколомДокументаКлиентСервер.СтруктураСтрокиПротокола.
// * Заголовок - Строка - Заголовок открываемой формы.
// * ЭтоНоваяЗапись - Булево - Скрывает неизменяемые поля протокола.
// * РазрешитьРедактирование - Булево - Возможно редактирование изменяемых полей протокола.
// * ИзменятьСтатус - Булево - Если ложь, то скрывает статус для новой строки или запрещает редактирование для существующей
// * АвторДокумента - СправочникСсылка.Пользователи - Автор документа-владельца протокола.
Функция ПараметрыОткрытияСтрокиПротокола() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Заголовок",               НСтр("ru = 'Строка протокола'"));
	ВозвращаемоеЗначение.Вставить("ЭтоНоваяЗапись",          Истина);
	ВозвращаемоеЗначение.Вставить("РазрешитьРедактирование", Истина);
	ВозвращаемоеЗначение.Вставить("ИзменятьСтатус",          Ложь);
	
	ВозвращаемоеЗначение.Вставить("АвторДокумента", ПользователиКлиент.АвторизованныйПользователь());
	
	ВозвращаемоеЗначение.Вставить("ДанныеПротокола", РаботаСПротоколомДокументаКлиентСервер.СтруктураСтрокиПротокола());
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ОткрытьСтрокуПротокола(ФормаВладелец, ПараметрыОткрытия, ОписаниеОповещения) Экспорт
		
	ОткрытьФорму("ОбщаяФорма.СтрокаПротоколаДокумента",
		ПараметрыОткрытия,
		ФормаВладелец,,,,
		ОписаниеОповещения);
	
КонецПроцедуры

Процедура Подключаемый_ПередДобавлениемСтрокиПротокола(ДанныеПротокола, ПараметрыОповещения) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеПротокола) Тогда
		// Отказ от добавления в форме строки протокола.
		Возврат;
	КонецЕсли;
	
	ФормаВладелец = ПараметрыОповещения.ФормаВладелец;
	Объект = ФормаВладелец.Объект;
	
	ИсходноеСостояние = РаботаСПротоколомДокументаКлиентСервер.ИзменяемыеСвойстваПротокола();
	РаботаСПротоколомДокументаКлиентСервер.ЗаполнитьСвойстваПротоколаИзОбъекта(ИсходноеСостояние, Объект);
	
	Если Не РаботаСПротоколомДокументаКлиентСервер.ИзменилисьСвойстваПротокола(ДанныеПротокола, ИсходноеСостояние, Истина) Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрокаПротокола(Объект.Протокол, ДанныеПротокола);
	ОбновитьДанныеПротокола(ФормаВладелец);
	
КонецПроцедуры

// Добавляет новую строку в протокол документа
// 
// Параметры:
//  Протокол - ДанныеФормыКоллекция - В который будет добавлена новая строка
//  ДанныеПротокола - см. РаботаСПротоколомДокументаКлиентСервер.ИзменяемыеСвойстваПротокола 
// 
// Возвращаемое значение:
//  ДанныеФормыЭлементКоллекции - Новая строка протокола
Функция НоваяСтрокаПротокола(Протокол, ДанныеПротокола) Экспорт
	
	ДанныеСтроки = РаботаСПротоколомДокументаКлиентСервер.СтруктураСтрокиПротокола();
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, ДанныеПротокола);
	ДанныеСтроки.Автор = ПользователиКлиент.ТекущийПользователь();
	ДанныеСтроки.Дата = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	Возврат РаботаСПротоколомДокументаКлиентСервер.НоваяСтрокаПротокола(Протокол, ДанныеСтроки);
	
КонецФункции

#КонецОбласти

#Область Протокол

Процедура ОткрытьПротокол(ФормаВладелец)
	
	Объект = ФормаВладелец.Объект;
	ДанныеПротокола = РаботаСПротоколомДокументаКлиентСервер.СтруктураСтрокиПротокола();
	РаботаСПротоколомДокументаКлиентСервер.ЗаполнитьСвойстваПротоколаИзОбъекта(ДанныеПротокола, Объект);
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("ДанныеПротокола",         ДанныеПротокола); // Таблица может быть еще пустая.
	ПараметрыОткрытия.Вставить("Протокол",                РаботаСПротоколомДокументаКлиент.ПротоколВМассив(ФормаВладелец.Объект.Протокол));
	ПараметрыОткрытия.Вставить("РазрешитьРедактирование", Не ФормаВладелец.ТолькоПросмотр); // В том числе по правам доступа.
	ПараметрыОткрытия.Вставить("АвторДокумента",          Объект.Автор);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ФормаВладелец", ФормаВладелец);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ПередИзменениемПротокола", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("ОбщаяФорма.ПротоколДокумента", ПараметрыОткрытия, ФормаВладелец,,,, ОписаниеОповещения);
	
КонецПроцедуры

Процедура Подключаемый_ПередИзменениемПротокола(Протокол, ПараметрыОповещения) Экспорт
	
	Если Не ЗначениеЗаполнено(Протокол) Тогда
		Возврат;
	КонецЕсли;
	
	ФормаВладелец = ПараметрыОповещения.ФормаВладелец;
	Объект = ФормаВладелец.Объект;
	
	Объект.Протокол.Очистить();
	Для Каждого СтрокаПротокола Из Протокол Цикл
		ЗаполнитьЗначенияСвойств(Объект.Протокол.Добавить(), СтрокаПротокола);
	КонецЦикла;
	
	ОбновитьДанныеПротокола(ФормаВладелец);

КонецПроцедуры

#КонецОбласти

#Область ОповещениеВладельца

// Устанавливает значения реквизитов объекта из последней строки протокола.
// Обновляет данные формы.
// Вызывает обработчик изменений в форме.
// 
// Параметры:
//  ФормаВладелец - ФормаКлиентскогоПриложения
Процедура ОбновитьДанныеПротокола(ФормаВладелец)
	
	Объект = ФормаВладелец.Объект;
	
	НовоеСостояние = РаботаСПротоколомДокументаКлиентСервер.ИзменяемыеСвойстваПротокола();
	ПоследняяСтрока = РаботаСПротоколомДокументаКлиентСервер.ПоследняяСтрокаПротокола(Объект.Протокол);
	ЗаполнитьЗначенияСвойств(НовоеСостояние, ПоследняяСтрока);
	
	ИсходноеСостояние = РаботаСПротоколомДокументаКлиентСервер.ИзменяемыеСвойстваПротокола();
	РаботаСПротоколомДокументаКлиентСервер.ЗаполнитьСвойстваПротоколаИзОбъекта(ИсходноеСостояние, Объект);
	
	ИзмененныеСвойства = РаботаСПротоколомДокументаКлиентСервер.ИзмененныеСвойстваПротокола(НовоеСостояние, ИсходноеСостояние);
	
	ФормаВладелец.Модифицированность = Истина;
	ЗаполнитьСвойстваОбъектаИзПротокола(Объект, НовоеСостояние);
	РаботаСПротоколомДокументаКлиентСервер.ЗаполнитьДанныеФормыПоПротоколу(ФормаВладелец);
	
	ПараметрыОповещенияВладельца = Новый Структура;
	ПараметрыОповещенияВладельца.Вставить("ИсходноеСостояние",  ИсходноеСостояние);
	ПараметрыОповещенияВладельца.Вставить("НовоеСостояние",     НовоеСостояние);
	ПараметрыОповещенияВладельца.Вставить("ИзмененныеСвойства", ИзмененныеСвойства);
	
	ИмяМетода = "Подключаемый_ПриИзмененииПротокола";
	ОбработкаОповещения = Новый ОписаниеОповещения(ИмяМетода, ФормаВладелец);
	ВыполнитьОбработкуОповещения(ОбработкаОповещения, ПараметрыОповещенияВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДанными

// Определяет исполнителя по маршруту (исходный статус --> устанавливаемый статус) исходя из описанных настроек
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма-владелец протокола
//  УстанавливаемыйСтатус - ПеречислениеСсылка - Устанавливаемый статус
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - Исполнитель по умолчанию для устанавливаемого статуса
Функция ОпределитьИсполнителяПоМаршруту(Форма, УстанавливаемыйСтатус)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИсходныйСтатус", Форма.Объект.Статус);
	СтруктураОтбора.Вставить("УстанавливаемыйСтатус", УстанавливаемыйСтатус);
	НайденныеМаршруты = Форма.ДоступныеМаршрутыСтатусов.НайтиСтроки(СтруктураОтбора);
	
	Если НайденныеМаршруты.Количество() <> 1 Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось определить исполнителя по умолчанию для установки статуса ""%1""
		|Обратитесь к администратору: Неправильно определен набор доступных статусов в модуле менеджера перечисления.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ИмяРеквизитаИсполнителя = НайденныеМаршруты[0].ИмяРеквизитаИсполнителя;
	
	Если ПустаяСтрока(ИмяРеквизитаИсполнителя) Тогда
		ВозвращаемоеЗначение = Форма.Объект.Исполнитель;
	Иначе
		ВозвращаемоеЗначение = Форма.Объект[ИмяРеквизитаИсполнителя];
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Преобразовывает таблицу формы протокола в массив для передачи между формами на клиенте
// Параметры:
//  Протокол - ДанныеФормыКоллекция - Преобразуемый протокол
// 
// Возвращаемое значение:
//  Массив Из Структура см. РаботаСПротоколомДокументаКлиентСервер.СтруктураСтрокиПротокола
Функция ПротоколВМассив(Протокол) Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	
	Для Каждого ИсходнаяСтрока Из Протокол Цикл
		
		СтрокаПротокола = РаботаСПротоколомДокументаКлиентСервер.СтруктураСтрокиПротокола();
		ЗаполнитьЗначенияСвойств(СтрокаПротокола, ИсходнаяСтрока);
		ВозвращаемоеЗначение.Добавить(СтрокаПротокола);
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ЗаполнитьСвойстваОбъектаИзПротокола(Объект, ДанныеПротокола)
	
	ЗаполнитьЗначенияСвойств(Объект, ДанныеПротокола);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти