
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИмяСобытия = "Cleverence_ВыгрузитьСправочники";
	ИмяГлавнойФормыОО = "Обработка.КлеверенсТСД_ОсновнаяОбработка.Форма.ГлавнаяФорма";
	ГлавнаяФормаОО = ПолучитьФорму(ИмяГлавнойФормыОО);
	
	//Обработка команды
	ИмяКоманды = "ВыгрузитьСправочники";
	ЭтоФормаСписка = Ложь;
	Форма = Неопределено;
	ОбъектыНазначения = Неопределено;
	
	Попытка	
		
		ОшибкиФоновойИнициализации 				= Ложь;
		ОшибкиФоновойИнициализацииСуществует 	= Ложь;
		
		КэшДанных = Вычислить("Клеверенс_ОбщегоНазначенияВызовСервера.ПолучитьНастройкуОбщегоХранилища(""CleverenceButtonsExtension_КэшДанных"")");
		
		Если Не ТипЗнч(КэшДанных) = Тип("Структура") Тогда
			КэшДанных = Новый Структура;
		КонецЕсли;
		
		Если КэшДанных.Свойство("ОшибкиФоновойИнициализации") Тогда
			ОшибкиФоновойИнициализации = КэшДанных.ОшибкиФоновойИнициализации;
		КонецЕсли;
		
		Если Вычислить("Клеверенс_ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ГлавнаяФормаОО, ""ОшибкиФоновойИнициализации"")") Тогда
			ОшибкиФоновойИнициализацииСуществует = Истина;
			ГлавнаяФормаОО.ОшибкиФоновойИнициализации = ОшибкиФоновойИнициализации;
		КонецЕсли;
		
		Выполнить("Клеверенс_ОбщегоНазначенияКлиент.ВыполнитьКомандуКлеверенс(ГлавнаяФормаОО, ИмяКоманды, ОбъектыНазначения, ЭтоФормаСписка, Форма)");
		
		Если ОшибкиФоновойИнициализацииСуществует Тогда
			
			// Получаем значение реквизита после попытки выполнения команды
			ОшибкиФоновойИнициализации = ГлавнаяФормаОО.ОшибкиФоновойИнициализации;
			
			// Сохраним значение, чтобы оно было доступно на время сеанса
			// При перезапуске значение будет недоступно, поэтому снова будет попытка инициализировать гл форму в фон задании
			КэшДанных.Вставить("ОшибкиФоновойИнициализации", ОшибкиФоновойИнициализации);
			Выполнить("Клеверенс_ОбщегоНазначенияВызовСервера.ЗаписатьНастройкуВХранилище(""CleverenceButtonsExtension_КэшДанных"", КэшДанных)");
			
		КонецЕсли;
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		Выполнить("Клеверенс_ОбщегоНазначенияВызовСервера.ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, ""Ошибка"", ТекстОшибки)");
		ТекстСообщения = НСтр("be = 'Памылка выканання аперацыі. Падрабязнасці ў журнале рэгістрацыі.'; en = 'Operation execution error. Details in the registration log.'; es = 'Error al realizar la operación. Detalles en el registro de eventos.'; ka = 'ოპერაციის შესრულების შეცდომა. დეტალები რეგისტრაციის ჟურნალში.'; kk = 'Операцияны орындауға қателік. Толық мәліметтер жазбаға кіргенде.'; ro = 'Eroare la executarea operației. Detalii în jurnalul de înregistrare.'; ru = 'Ошибка выполнения операции. Подробности в журнале регистрации.'; tr = 'İşlem hatası. Kayıt defterinde ayrıntılar için kontrol edin.'; uk = 'Помилка виконання операції. Деталі в журналі реєстрації.'; uz = 'Амалиётни бажаришда хатолик юз берди. Рўйхатга ёзиш журналида тафсилотлар кўрсатилган.'");
		Сообщить(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры
