#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство") Тогда
		Элементы.ГруппаПостатейныеПостоянные.Видимость = Ложь;
		Элементы.ГруппаПостатейныеПеременные.Видимость = Ложь;
		Элементы.ГруппаТрудозатраты.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодакцизныеТовары") Тогда
		Элементы.ГруппаАкцизы.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Значение = Элемент.ТекущиеДанные[Поле.Имя];
	ПоказатьЗначение(Неопределено, Значение);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РаспределениеПоНаправлениямДеятельности(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено
	 ИЛИ НЕ ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Регистратор) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Необходимо указать регистратор для распределения'"));
		Возврат;
	КонецЕсли;
	
	Регистратор = Элементы.Список.ТекущиеДанные.Регистратор;
	
	Таблица = РаспределениеПоНаправлениямДеятельностиНаСервере(Элементы.Список.ТекущиеДанные.Регистратор);
	
	Если Таблица = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Нет движений для распределения по направлениям деятельности'"));
	Иначе
		Таблица.Показать(НСтр("ru='Документ'") + ": " + СокрЛП(Регистратор));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция РаспределениеПоНаправлениямДеятельностиНаСервере(ДокументСсылка)

	Если НЕ РасчетСебестоимостиПовтИсп.ЕстьНастройкиРаспределенияПоНаправлениямДеятельности()
	 ИЛИ НЕ ПолучитьФункциональнуюОпцию("ФормироватьФинансовыйРезультат") 
	 ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоходовПоНаправлениямДеятельности") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = РасчетСебестоимостиКорректировкаСтоимости.ПодготовитьЗапросЗаполненияНаправленийДеятельности(ДокументСсылка,, Истина);
	
	Если Запрос = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|   ДетальныеЗаписи.НомерЗаписи КАК НомерСтроки,
	|	ДетальныеЗаписи.СпособРаспределения КАК СпособРаспределения,
	|	ДетальныеЗаписи.ПриоритетПартнер + ДетальныеЗаписи.ПриоритетСегментПартнера + ДетальныеЗаписи.ПриоритетПодразделение
	|		+ ДетальныеЗаписи.ПриоритетНоменклатура + ДетальныеЗаписи.ПриоритетСегментНоменклатуры
	|		+ ДетальныеЗаписи.ПриоритетСклад + ДетальныеЗаписи.ПриоритетОрганизация КАК ОбщийПриоритет,
	|
	|	ДетальныеЗаписи.ПриоритетПартнер,
	|	ДетальныеЗаписи.ПриоритетСегментПартнера,
	|	ДетальныеЗаписи.ПриоритетНоменклатура,
	|	ДетальныеЗаписи.ПриоритетСегментНоменклатуры,
	|	ДетальныеЗаписи.ПриоритетСклад,
	|	ДетальныеЗаписи.ПриоритетПодразделение,
	|	ДетальныеЗаписи.ПриоритетОрганизация,
	|
	|	Т.Партнер,
	|	ДетальныеЗаписи.Партнер КАК ПравилоРаспределения_Партнер,
	|	ДетальныеЗаписи.СегментПартнера КАК ПравилоРаспределения_СегментПартнера,
	|	Т.Номенклатура,
	|	ДетальныеЗаписи.Номенклатура КАК ПравилоРаспределения_Номенклатура,
	|	ДетальныеЗаписи.СегментНоменклатуры КАК ПравилоРаспределения_СегментНоменклатуры,
	|	Т.Склад,
	|	ДетальныеЗаписи.Склад КАК ПравилоРаспределения_Склад,
	|	Т.Подразделение,
	|	ДетальныеЗаписи.Подразделение КАК ПравилоРаспределения_Подразделение,
	|	Т.Организация,
	|	ДетальныеЗаписи.Организация КАК ПравилоРаспределения_Организация
	|ИЗ
	|	ВТИсходныеДвижения КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаРаспределенияДетально КАК ДетальныеЗаписи
	|		ПО ДетальныеЗаписи.НомерЗаписи = Т.НомерЗаписи
	|ГДЕ
	|	Т.ЗаполнятьНаправлениеДеятельности
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	ОбщийПриоритет УБЫВ,
	|	СпособРаспределения УБЫВ
	|";
	
	ТаблицаРаспределения = Запрос.Выполнить().Выгрузить();
	
	Если НЕ ЗначениеЗаполнено(ТаблицаРаспределения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияУТ.ТабличныйДокументИзТаблицыЗначений(ТаблицаРаспределения);
	
КонецФункции

#КонецОбласти
