
&ИзменениеИКонтроль("НаименованиеПоШаблону")
Функция АУ_НаименованиеПоШаблону(Знач ШаблонНаименования, ОбъектСправочник)

	ФормулаНаименованияСтруктура = ФормулаНаименования(ШаблонНаименования, ОбъектСправочник);
	ФормулаНаименования = """"" + " + СтрЗаменить(ФормулаНаименованияСтруктура.ФормулаНаименования,
	"МассивЗначенийРеквизитов[",
	"Параметры[");

	Наименование = "";

	Если ЗначениеЗаполнено(ФормулаНаименования) Тогда

		#Вставка
		Если ФормулаНаименования = """"" + " Тогда
			Наименование = ОбъектСправочник.Наименование;
			Возврат Наименование;
		КонецЕсли;
		#КонецВставки
		
		Попытка

			Наименование = ОбщегоНазначения.ВычислитьВБезопасномРежиме(
			ФормулаНаименования,
			ФормулаНаименованияСтруктура.МассивЗначенийРеквизитов);

		Исключение

			ШаблонСообщенияОбОшибке = НСтр("ru = 'Невозможно сформировать наименование по заданному для вида номенклатуры ""%ВидНоменклатуры%"" шаблону. Проверьте правильность шаблона.'");

			Если ТипЗнч(ОбъектСправочник) = Тип("СправочникОбъект.Номенклатура")
				ИЛИ ТипЗнч(ОбъектСправочник) = Тип("СправочникОбъект.СерииНоменклатуры") Тогда

				ВидНоменклатуры = ОбъектСправочник.ВидНоменклатуры;

			Иначе

				Если ТипЗнч(ОбъектСправочник.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда

					ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСправочник.Владелец, "ВидНоменклатуры");

				ИначеЕсли ТипЗнч(ОбъектСправочник.Владелец) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда

					ВидНоменклатуры = ОбъектСправочник.Владелец;

				КонецЕсли;

			КонецЕсли;

			СообщениеОбОшибке = СтрЗаменить(ШаблонСообщенияОбОшибке, "%ВидНоменклатуры%", ВидНоменклатуры);
			ВызватьИсключение СообщениеОбОшибке;

		КонецПопытки;

	КонецЕсли;

	Возврат Наименование;

КонецФункции
