
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = НСтр("ru = 'Уведомление о удалении устаревшей функциональности в редакции 11.6'");
	
	Текст = НСтр("ru = 'В системе используется устаревшая функциональность, которая будет удалена в редакции 11.6.
	|Рекомендуется выполнить переход на новую функциональность.
	|Ознакомиться со списком можно через форму ""Готовность перехода на редакцию 11.6"".
	|'");
	Ссылка = Новый ФорматированнаяСтрока(НСтр("ru = 'Готовность перехода на редакцию 11.6.'"),,,, "ОткрытьФормуГотовностьПерехода26");
	
	
	ИнформационнаяСтрока = Новый ФорматированнаяСтрока(Текст, Ссылка);
	Обработки.ГотовностьКПереходу26.УстановитьКонстантуУведомленияОбУстаревшейФункциональности(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИнформационнаяСтрокаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуГотовностьПерехода26" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Обработка.ГотовностьКПереходу26.Форма.Форма");
		Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
