#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы);
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек,
													"ФормироватьВидыЗапасовПоГруппамФинансовогоУчета",
													ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета"),
													Истина);
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	УдалитьПоказателиИзОтборовРасшифровки(КомпоновщикНастроек, НастройкиОтчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - См. ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы)
	
	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(КомпоновщикНастроек);
	
КонецПроцедуры

Процедура УдалитьПоказателиИзОтборовРасшифровки(КомпоновщикНастроек, НастройкиОтчета)
	Если КомпоновщикНастроек.ФиксированныеНастройки.ДополнительныеСвойства.Свойство("РежимРасшифровки")
		И КомпоновщикНастроек.ФиксированныеНастройки.ДополнительныеСвойства.РежимРасшифровки Тогда
		
		Показатели = Новый Массив;
		Показатели.Добавить("Показатели.Количество.КоличествоНачальныйОстаток");
		Показатели.Добавить("Показатели.Количество.КоличествоПриход");
		Показатели.Добавить("Показатели.Количество.КоличествоРасход");
		Показатели.Добавить("Показатели.Количество.КоличествоКонечныйОстаток");
		Показатели.Добавить("Показатели.СтоимостьБезНДС.СтоимостьБезНДСНачальныйОстаток");
		Показатели.Добавить("Показатели.СтоимостьБезНДС.СтоимостьБезНДСПриход");
		Показатели.Добавить("Показатели.СтоимостьБезНДС.СтоимостьБезНДСРасход");
		Показатели.Добавить("Показатели.СтоимостьБезНДС.СтоимостьБезНДСКонечныйОстаток");
		Показатели.Добавить("Показатели.НДС.НДСНачальныйОстаток");
		Показатели.Добавить("Показатели.НДС.НДСПриход");
		Показатели.Добавить("Показатели.НДС.НДСРасход");
		Показатели.Добавить("Показатели.НДС.НДСКонечныйОстаток");
		Показатели.Добавить("Показатели.НДСУпр.НДСУпрНачальныйОстаток");
		Показатели.Добавить("Показатели.НДСУпр.НДСУпрПриход");
		Показатели.Добавить("Показатели.НДСУпр.НДСУпрРасход");
		Показатели.Добавить("Показатели.НДСУпр.НДСУпрКонечныйОстаток");
		
		Для Каждого Показатель Из Показатели Цикл 
			КомпоновкаДанныхСервер.УдалитьЭлементОтбораИзВсехНастроекОтчета(НастройкиОтчета, Показатель);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли