#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТитулСсылка", Титул);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ЗначениеЗаполнено(ПричинаОтказа) Тогда
		Сообщить("Укажите причину отказа в подписи");
		Возврат;
	КонецЕсли;
	
	ЗаписатьПричинуОтказаВТитул();
	
	Если ЗначениеЗаполнено(ПричинаОтказаТекст) Тогда
		ТекстПричиныОтказа = ТекстПричиныОтказа();
		Закрыть(ТекстПричиныОтказа);
	Иначе
		Закрыть(Строка(ПричинаОтказа));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьПричинуОтказаВТитул() Экспорт

	ТитулОбъект = Титул.ПолучитьОбъект();
	ТитулОбъект.РезультатМедОсмотра = ПричинаОтказа;
	ТитулОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Функция ТекстПричиныОтказа()

	Результат = Перечисления.КонтурЛогистика_РезультатыПослерейсовогоМедОсмотра.ТекстДляПричиныОтказа(ПричинаОтказа) + ". " + ПричинаОтказаТекст; 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


