
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда 
		
		ТипДокумента = ДанныеЗаполнения.ТипДокумента;
		
		ТекстФайла = ДанныеЗаполнения.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ДанныеЗаполнения + " нет текста титула");
			Возврат;
		КонецЕсли;
		
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТитулСВПеревозчика(ТипДокумента) Тогда 
			
			КС = КонтурЛогистика_КонструкторыXDTO;
			СодСВИнфПрв 	= XDTO.Документ.СодСВИнфПрв;
			
			НомерСВ 	= КС.XDTO_ПолучитьЗначениеСвойства(СодСВИнфПрв, "НомерСВ");
			ДатаСВ_raw = КС.XDTO_ПолучитьЗначениеСвойства(СодСВИнфПрв, "ДатаСВ");
			ДатаСВ     = КС.Конвертировать_ДатаТип_вДата(ДатаСВ_raw);
			
			Грузоотправитель 	= КС.Конвертировать_УчастникСВ_вОрганизациюДиадок(КС.XDTO_ПолучитьЗначениеСвойства(СодСВИнфПрв, "СвГО"), "ГО_");
			Перевозчик 			= КС.Конвертировать_УчастникСВ_вОрганизациюДиадок(КС.XDTO_ПолучитьЗначениеСвойства(СодСВИнфПрв, "СвПрв"), "Прв");
			Грузополучатель 	= КС.Конвертировать_УчастникСВ_вОрганизациюДиадок(КС.XDTO_ПолучитьЗначениеСвойства(СодСВИнфПрв, "СвГП"), "ГП_");
			
			Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТитулСВПеревозчика(ТипДокумента) Тогда
				
				ПеревозчикПодразделение 		= ДанныеЗаполнения.ОтправительПодразделение;
				
				Если ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул1 
					Или ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул3 Тогда
					ГрузоотправительПодразделение 	= ДанныеЗаполнения.ПолучательПодразделение;
				Иначе // Т5,Т7,Т9
					ГрузополучательПодразделение 	= ДанныеЗаполнения.ПолучательПодразделение;
				КонецЕсли;
				
			ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТитулСВГрузоотправителя(ТипДокумента) Тогда
				
				ГрузоотправительПодразделение 	= ДанныеЗаполнения.ОтправительПодразделение;
				ПеревозчикПодразделение 		= ДанныеЗаполнения.ПолучательПодразделение;
				
			ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТитулСВГрузополучателя(ТипДокумента) Тогда
				
				ГрузополучательПодразделение 	= ДанныеЗаполнения.ОтправительПодразделение;
				ПеревозчикПодразделение 		= ДанныеЗаполнения.ПолучательПодразделение;
				
			КонецЕсли;
			
		Иначе
			 Сообщить("Обработка заполнения Документа СВ из " + ТипДокумента + " не поддерживается");
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли