#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Скачать файлы закупки локально.
// 
// Параметры:
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Все файлы закупки загружены локально
Функция СкачатьФайлыЗакупкиЛокально(ОписаниеРезультата = "") Экспорт
	ФайлыЗакупокПуть = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ФайлыЗакупокПуть", "");
	ВсеФайлыЗагружены = КонтурЗакупки_ОбщегоНазначенияВызовСервера.ПроверитьДоступностьКаталогаНаСервере(
		ФайлыЗакупокПуть, , ОписаниеРезультата);

	Если ВсеФайлыЗагружены Тогда
		ФайлыЗакупокПуть = КонтурЗакупки_ОбщегоНазначенияВызовСервера.СформироватьПутьККаталогу(ФайлыЗакупокПуть);
		ФайлыЗакупокПутьОтКорня = Документы.КонтурЗакупки_Закупка.ПолучитьПутьОтКорневойПапки(ЭтотОбъект);

		Для Каждого СтрокаДокументов Из ДокументыЗакупки Цикл

			ПараметрыHTTPЗапроса = КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьСтруктуруПараметровHTTPЗапроса();
			ПараметрыHTTPЗапроса.Вставить("Метод", "GET");
			ПараметрыHTTPЗапроса.Вставить("СтрокаПодключения", );
			ПараметрыHTTPЗапроса.Вставить("ОтправитьФайл", Ложь);
			ПараметрыHTTPЗапроса.Вставить("ПолучитьФайл", Истина);
			ПараметрыHTTPЗапроса.Вставить("ТелоЗапроса", Неопределено);

			ЗаполнитьЗначенияСвойств(ПараметрыHTTPЗапроса, КонтурЗакупки_httpВызовСервера.РазложитьURL(
				СтрокаДокументов.СсылкаНаФайл));

			ОписаниеДействия = КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьОписаниеДействия("get file",
				"Скачивание файла", СтрокаДокументов.СсылкаНаФайл, "");

			РезультатHTTPЗапроса = КонтурЗакупки_httpКлиентСервер.ВыполнитьHTTPЗапросСМетрикой(ПараметрыHTTPЗапроса,
				ОписаниеДействия);

			Если Не РезультатHTTPЗапроса.error Тогда
				Если ТипЗнч(РезультатHTTPЗапроса.data) = Тип("ДвоичныеДанные") Тогда
					ПолныйПутьКФайлу = КонтурЗакупки_ОбщегоНазначенияВызовСервера.СформироватьПутьККаталогу(ФайлыЗакупокПуть
						+ ФайлыЗакупокПутьОтКорня) + СтрокаДокументов.ИмяФайла;
					РезультатHTTPЗапроса.data.Записать(ПолныйПутьКФайлу);
					СтрокаДокументов.ДоступенЛокально = Истина;
				КонецЕсли;
			Иначе
				ВсеФайлыЗагружены = Ложь;
				ОписаниеРезультата = ОписаниеРезультата + СтрШаблон(НСтр("ru = 'Ошибка загрузки файла: %1 описание:'"),
					СтрокаДокументов.ИмяФайла) + РезультатHTTPЗапроса.message + Символы.ПС;
			КонецЕсли;

		КонецЦикла;
		Записать();
	КонецЕсли;
	Возврат ВсеФайлыЗагружены
КонецФункции

Процедура ИсправитьКоды() Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.Ключ_ОбъектыЗакупки,
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.Ключ,
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.НаименованиеОбъектаЗакупки,
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.Количество,
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.ЕдиницаИзмерения,
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.СтоимостьЗаЕдиницуОбъекта,
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.ОбщаяСтоимостьОбъекта,
	|	ЕСТЬNULL(КонтурЗакупки_ЗакупкаКодыКТРУ.КТРУКод, КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.КТРУКод) КАК КТРУКод,
	|	ЕСТЬNULL(КонтурЗакупки_ЗакупкаКодыКТРУ.КТРУРасшифровка,
	|		КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.КТРУРасшифровка) КАК КТРУРасшифровка,
	|	ЕСТЬNULL(КонтурЗакупки_ЗакупкаКодыОКВЭД2.ОКВЭД2Код, КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.ОКВЭД2Код) КАК
	|		ОКВЭД2Код,
	|	ЕСТЬNULL(КонтурЗакупки_ЗакупкаКодыОКВЭД2.ОКВЭД2Расшифровка,
	|		КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.ОКВЭД2Расшифровка) КАК ОКВЭД2Расшифровка,
	|	ЕСТЬNULL(КонтурЗакупки_ЗакупкаКодыОКПД2.ОКПД2Код, КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.ОКПД2Код) КАК
	|		ОКПД2Код,
	|	ЕСТЬNULL(КонтурЗакупки_ЗакупкаКодыОКПД2.ОКПД2Расшифровка,
	|		КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.ОКПД2Расшифровка) КАК ОКПД2Расшифровка
	|ИЗ
	|	Документ.КонтурЗакупки_Закупка.СовместныеОбъектыЗакупки КАК КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЗакупки_Закупка.КодыКТРУ КАК КонтурЗакупки_ЗакупкаКодыКТРУ
	|		ПО КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.Ключ_ОбъектыЗакупки = КонтурЗакупки_ЗакупкаКодыКТРУ.Ключ
	|		И КонтурЗакупки_ЗакупкаКодыКТРУ.Ссылка = &Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЗакупки_Закупка.КодыОКВЭД2 КАК КонтурЗакупки_ЗакупкаКодыОКВЭД2
	|		ПО КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.Ключ_ОбъектыЗакупки = КонтурЗакупки_ЗакупкаКодыОКВЭД2.Ключ
	|		И КонтурЗакупки_ЗакупкаКодыОКВЭД2.Ссылка = &Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЗакупки_Закупка.КодыОКПД2 КАК КонтурЗакупки_ЗакупкаКодыОКПД2
	|		ПО КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.Ключ_ОбъектыЗакупки = КонтурЗакупки_ЗакупкаКодыОКПД2.Ключ
	|		И КонтурЗакупки_ЗакупкаКодыОКПД2.Ссылка = &Ссылка
	|ГДЕ
	|	КонтурЗакупки_ЗакупкаСовместныеОбъектыЗакупки.Ссылка = &Ссылка";
	
	
	СовместныеОбъектыЗакупки.Загрузить(Запрос.Выполнить().Выгрузить());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЗакупки_ЗакупкаОбъектыЗакупки.Ключ_ОбъектыЗакупки,
	|	КонтурЗакупки_ЗакупкаОбъектыЗакупки.Ключ,
	|	КонтурЗакупки_ЗакупкаОбъектыЗакупки.НаименованиеОбъектаЗакупки,
	|	КонтурЗакупки_ЗакупкаОбъектыЗакупки.Количество,
	|	КонтурЗакупки_ЗакупкаОбъектыЗакупки.ЕдиницаИзмерения,
	|	КонтурЗакупки_ЗакупкаОбъектыЗакупки.СтоимостьЗаЕдиницуОбъекта,
	|	КонтурЗакупки_ЗакупкаОбъектыЗакупки.ОбщаяСтоимостьОбъекта,
	|	ЕСТЬNULL(КонтурЗакупки_ЗакупкаКодыКТРУ.КТРУКод, КонтурЗакупки_ЗакупкаОбъектыЗакупки.КТРУКод) КАК КТРУКод,
	|	ЕСТЬNULL(КонтурЗакупки_ЗакупкаКодыКТРУ.КТРУРасшифровка, КонтурЗакупки_ЗакупкаОбъектыЗакупки.КТРУРасшифровка) КАК
	|		КТРУРасшифровка,
	|	ЕСТЬNULL(КонтурЗакупки_ЗакупкаКодыОКВЭД2.ОКВЭД2Код, КонтурЗакупки_ЗакупкаОбъектыЗакупки.ОКВЭД2Код) КАК ОКВЭД2Код,
	|	ЕСТЬNULL(КонтурЗакупки_ЗакупкаКодыОКВЭД2.ОКВЭД2Расшифровка,
	|		КонтурЗакупки_ЗакупкаОбъектыЗакупки.ОКВЭД2Расшифровка) КАК ОКВЭД2Расшифровка,
	|	ЕСТЬNULL(КонтурЗакупки_ЗакупкаКодыОКПД2.ОКПД2Код, КонтурЗакупки_ЗакупкаОбъектыЗакупки.ОКПД2Код) КАК ОКПД2Код,
	|	ЕСТЬNULL(КонтурЗакупки_ЗакупкаКодыОКПД2.ОКПД2Расшифровка, КонтурЗакупки_ЗакупкаОбъектыЗакупки.ОКПД2Расшифровка) КАК
	|		ОКПД2Расшифровка
	|ИЗ
	|	Документ.КонтурЗакупки_Закупка.ОбъектыЗакупки КАК КонтурЗакупки_ЗакупкаОбъектыЗакупки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЗакупки_Закупка.КодыКТРУ КАК КонтурЗакупки_ЗакупкаКодыКТРУ
	|		ПО КонтурЗакупки_ЗакупкаОбъектыЗакупки.Ключ_ОбъектыЗакупки = КонтурЗакупки_ЗакупкаКодыКТРУ.Ключ
	|		И КонтурЗакупки_ЗакупкаКодыКТРУ.Ссылка = &Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЗакупки_Закупка.КодыОКВЭД2 КАК КонтурЗакупки_ЗакупкаКодыОКВЭД2
	|		ПО КонтурЗакупки_ЗакупкаОбъектыЗакупки.Ключ_ОбъектыЗакупки = КонтурЗакупки_ЗакупкаКодыОКВЭД2.Ключ
	|		И КонтурЗакупки_ЗакупкаКодыОКВЭД2.Ссылка = &Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЗакупки_Закупка.КодыОКПД2 КАК КонтурЗакупки_ЗакупкаКодыОКПД2
	|		ПО КонтурЗакупки_ЗакупкаОбъектыЗакупки.Ключ_ОбъектыЗакупки = КонтурЗакупки_ЗакупкаКодыОКПД2.Ключ
	|		И КонтурЗакупки_ЗакупкаКодыОКПД2.Ссылка = &Ссылка
	|ГДЕ
	|	КонтурЗакупки_ЗакупкаОбъектыЗакупки.Ссылка = &Ссылка";
	
	ОбъектыЗакупки.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

#КонецОбласти
#КонецЕсли