#Область ПрограммныйИнтерфейс

Функция ПараметрыHTTPЗапроса() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Метод");
	Результат.Вставить("АдресМетода");
	Результат.Вставить("ТелоЗапроса");
	Результат.Вставить("Параметры"					, Новый Структура);
	Результат.Вставить("Заголовки"					, Новый Соответствие);
	Результат.Вставить("ДопустимыеКодыОтвета"		, Новый Массив);
	Результат.Вставить("ТелоОтветаКакДвоичныеДанные", Ложь);
	
	Результат.Метод = "GET";
	
	Результат.Заголовки.Вставить("Accept"		, "application/json");
	Результат.Заголовки.Вставить("Content-Type"	, "application/json;charset=utf-8");
	Результат.Заголовки.Вставить("User-Agent"	, КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеUserAgent());
	//Результат.Заголовки.Вставить("Cache-Control", "max-age=0");
	
	Результат.ДопустимыеКодыОтвета.Добавить(200);
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса) Экспорт
	
	Попытка
		
		Если ИспользоватьВнешнийHTTP() Тогда
			
			Результат = ВыполнитьHTTPЗапрос_COM(ПараметрыСервиса, ПараметрыЗапроса);
			
		Иначе
			
			Результат = ВыполнитьHTTPЗапрос_Native(ПараметрыСервиса, ПараметрыЗапроса);
			
		КонецЕсли;
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ОбработатьОшибкуHTTP(ПараметрыСервиса, ПараметрыЗапроса, ТекстОшибки);
		
		Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоHTTPЗапросОтправкиТитула(ПараметрыЗапроса) Тогда
			Результат = Новый Структура;
			Результат.Вставить("ТипОшибки", ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаСоединения"));
			Результат.Вставить("ОписаниеОшибки", "Ошибка при отправке документов");
			Результат.Вставить("ПодробноеОписаниеОшибки", ТекстОшибки);
			Возврат Результат;			
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Если НЕ Результат.КодОтветаДопустимый Тогда
		
		КодОтвета = Результат.КодОтвета;
		ТелоОтвета = НРег(Результат.ТелоОтвета);
		
		Если ЭтоОшибкаАвторизации(КодОтвета, ТелоОтвета) Тогда
						
			ТекстОшибки = НСтр("ru = 'Не удалось выполнить аутентификацию по ключу API-KEY.'");
			
		ИначеЕсли КодОтвета = 302 Тогда 	
			
			ТекстОшибки = "Ошибка HTTP запроса" + Символы.ПС + "Код ошибки: " + Результат.КодОтвета + Символы.ПС 
							+ "Запрошенный ресурс " + ПараметрыСервиса.АдресВебСервиса + " временно перемещен. " + Символы.ПС
							+ "Обратитесь за помощью к администратору";
			
		Иначе
			
			Если СтрДлина(Результат.ТелоОтвета) > 100000 Тогда
				СтрокаТелоОтвета = Результат.ТелоОтвета;
			Иначе
				Попытка
					СтрокаТелоОтвета = ФорматироватьJSON(Результат.ТелоОтвета);
				Исключение
					СтрокаТелоОтвета = Результат.ТелоОтвета;
				КонецПопытки;
			КонецЕсли;
			
			ТекстОшибки = "Ошибка HTTP запроса" + Символы.ПС + "Код ошибки: " + Результат.КодОтвета + Символы.ПС + СтрокаТелоОтвета;
			
		КонецЕсли;
		
		ОбработатьОшибкуHTTP(ПараметрыСервиса, ПараметрыЗапроса, ТекстОшибки);
		
		Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоHTTPЗапросОтправкиТитула(ПараметрыЗапроса) Тогда
			Результат.Вставить("ТипОшибки", ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаСервиса"));
			Результат.Вставить("ОписаниеОшибки", "Ошибка при отправке документов");
			Результат.Вставить("ПодробноеОписаниеОшибки", ТекстОшибки);
			Возврат Результат;			
		КонецЕсли;
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоОшибкаАвторизации(КодОтвета, ТелоОтвета)
	
	Результат = КодОтвета = 401
					И Найти(ТелоОтвета, "apikey authentication failed");
									
	Возврат Результат

КонецФункции


// Определяет какой транспорт нужно использовать
// в зависимости от версии приложения.
//
// Возвращаемое значение:
//   Булево - Истина, если приложение старше 8.3.6.
Функция ИспользоватьВнешнийHTTP()
	
	Если НЕ ПриложениеСтаршеВерсии("8.3.6") Тогда
		
		// В версии "8.3.6" HTTPЗапрос получил необходимый нам параметр ИспользоватьBOM.
		
		Результат = Ложь;
		
	Иначе
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает объект HTTP cоединение по адресу вэб сервиса.
//
// Параметры:
//  ПараметрыСервиса - Структура - см. функцию ядра ПараметрыСервиса().
//
// Возвращаемое значение:
//   HTTPСоединение - если ИспользоватьВнешнийHTTP() = Ложь;
//   COMОбъект      - если ИспользоватьВнешнийHTTP() = Истина;
Функция HTTPСоединение(ПараметрыСервиса)
	
	Результат = Неопределено;
	
	АдресВебСервиса	= ПараметрыСервиса.АдресВебСервиса;
	
	HTTPСоединения = Новый Соответствие;
		
	Если ИспользоватьВнешнийHTTP() Тогда
		
		Результат = ПолучитьCOMОбъект("", "WinHttp.WinHttpRequest.5.1");
		УстановитьПараметрыПрокси_COM(ПараметрыСервиса, Результат);
		
	Иначе
		
		Прокси		 = НовыйИнтернетПрокси(ПараметрыСервиса.НастройкиПрокси);
		Результат	 = НовоеHTTPСоединение(ПараметрыСервиса, Прокси);
		
	КонецЕсли;
				
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьОшибкуHTTP(ПараметрыСервиса, ПараметрыЗапроса, ТекстОшибки)
	
	Метод			 = ПараметрыЗапроса.Метод;
	АдресМетода		 = ПараметрыЗапроса.АдресМетода;
	АдресВебСервиса	 = ПараметрыСервиса.АдресВебСервиса;
	ДопИнформация	 = Новый Массив;
	
	ВидОперации = "HTTP запрос в сервис " + АдресВебСервиса;
	
	ДопИнформация.Добавить("Метод: " + Метод);
	
	ДопИнформация.Добавить("Адрес метода: https:// " + АдресВебСервиса + АдресМетода);
	
	Если ИспользоватьВнешнийHTTP() Тогда
		ДопИнформация.Добавить("Использован внешний HTTP транспорт");
	КонецЕсли;
		
	КонтурЛогистика_API_Логистика.Ошибка_Обработать(ВидОперации, ТекстОшибки, ДопИнформация);
	
КонецПроцедуры

Функция ВыполнитьHTTPЗапрос_Native(ПараметрыСервиса, ПараметрыЗапроса)
	
	ДопустимыеКодыОтвета		 = ПараметрыЗапроса.ДопустимыеКодыОтвета;
	ТелоОтветаКакДвоичныеДанные	 = ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные;
	
	Ответ = ОтправитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	КодОтвета			 = Ответ.КодСостояния;
	ЗаголовкиОтвета		 = Ответ.Заголовки;
	КодОтветаДопустимый	 = ДопустимыеКодыОтвета.Найти(КодОтвета) <> Неопределено;
	
	Если ТелоОтветаКакДвоичныеДанные И КодОтветаДопустимый Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакДвоичныеДанные();
	Иначе
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КодОтвета"			, КодОтвета);
	Результат.Вставить("ТелоОтвета"			, ТелоОтвета);
	Результат.Вставить("Заголовки"			, ЗаголовкиОтвета);
	Результат.Вставить("КодОтветаДопустимый", КодОтветаДопустимый);
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьHTTPЗапрос_COM(ПараметрыСервиса, ПараметрыЗапроса)
	
	ДопустимыеКодыОтвета		 = ПараметрыЗапроса.ДопустимыеКодыОтвета;
	ТелоОтветаКакДвоичныеДанные	 = ПараметрыЗапроса.ТелоОтветаКакДвоичныеДанные;
	
	Соединение = ОтправитьHTTPЗапрос_COM(ПараметрыСервиса, ПараметрыЗапроса);
	
	КодОтвета			 = Число(Соединение.Status);
	ЗаголовкиОтвета		 = ЗаголовкиHTTPОтвета_COM(Соединение);
	КодОтветаДопустимый	 = ДопустимыеКодыОтвета.Найти(КодОтвета) <> Неопределено;
	
	Если ТелоОтветаКакДвоичныеДанные И КодОтветаДопустимый Тогда
		
		Если Соединение.responseBody = Неопределено Тогда
			ТелоОтвета = Неопределено;
		Иначе
			ТелоОтвета = ДвоичныеДанныеHTTPОтвета_COM(Соединение);
		КонецЕсли;
		
	Иначе
		
		ТелоОтвета = Соединение.ResponseText;
		
		Если НЕ ЗначениеЗаполнено(ТелоОтвета) И НЕ КодОтветаДопустимый Тогда
			ТелоОтвета = Соединение.StatusText;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КодОтвета"			, КодОтвета);
	Результат.Вставить("ТелоОтвета"			, ТелоОтвета);
	Результат.Вставить("Заголовки"			, ЗаголовкиОтвета);
	Результат.Вставить("КодОтветаДопустимый", КодОтветаДопустимый);
	
	Возврат Результат;
	
КонецФункции

// Вычисляет адрес ресурса по имени метода API и его параметрам.
Функция АдресРесурсаHTTP(ИмяМетода, Параметры = Неопределено)
	
	ПараметрыСтрокой = "";
	
	Если ЗначениеЗаполнено(Параметры) Тогда
		
		Если Найти(ИмяМетода, "?") = 0 Тогда
			Разделитель = "?";
		Иначе
			Разделитель = "&";
		КонецЕсли;
		
		Для Каждого Параметр Из Параметры Цикл
			// Метод Общее_ПодставитьПараметрыВСтроку использовать нельзя, в параметрах может быть %n
			Если ТипЗнч(Параметр.Значение) = Тип("Массив") Тогда 
				Для Каждого Значение Из Параметр.Значение Цикл 
					ПараметрыСтрокой = ПараметрыСтрокой + Разделитель + Параметр.Ключ + "=" + Значение;
					Разделитель = "&";
				КонецЦикла;	
			Иначе	
				ПараметрыСтрокой = ПараметрыСтрокой + Разделитель + Параметр.Ключ + "=" + Параметр.Значение;
			КонецЕсли;
			Разделитель = "&";
		КонецЦикла;
		
	КонецЕсли;
	
	Результат = ИмяМетода + ПараметрыСтрокой;
	
	Возврат Результат;
	
КонецФункции

Функция ОтправитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса)
	
	Метод		 = ПараметрыЗапроса.Метод;
	АдресМетода	 = ПараметрыЗапроса.АдресМетода;
	ТелоЗапроса	 = ПараметрыЗапроса.ТелоЗапроса;
	Параметры	 = ПараметрыЗапроса.Параметры;
	Заголовки	 = ПараметрыЗапроса.Заголовки;
	
	Соединение	 = HTTPСоединение(ПараметрыСервиса);
	АдресРесурса = АдресРесурсаHTTP(АдресМетода, Параметры);
	HTTPЗапрос	 = НовыйHTTPЗапрос(АдресРесурса, Заголовки);
	
	Если Метод = "GET" Тогда
		
		Результат = Соединение.Получить(HTTPЗапрос);
		
	ИначеЕсли Метод = "POST" Или Метод = "PATCH" Или Метод = "PUT" Тогда
		
		Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
			
			Если ТипЗнч(ТелоЗапроса) = Тип("Строка") Тогда
				
				HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8,
				ПредопределенноеЗначение("ИспользованиеByteOrderMark.НеИспользовать"));
								
			Иначе
				
				HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Метод = "POST" Тогда
			Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ИначеЕсли Метод = "PUT" Тогда
			Результат = Соединение.ВызватьHTTPМетод("PUT", HTTPЗапрос);
		Иначе
			Результат = Соединение.Изменить(HTTPЗапрос);
		КонецЕсли;
		
	ИначеЕсли Метод = "DELETE" Тогда
		
		Результат = Соединение.Удалить(HTTPЗапрос);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОтправитьHTTPЗапрос_COM(ПараметрыСервиса, ПараметрыЗапроса)
	
	Метод		 = ПараметрыЗапроса.Метод;
	АдресМетода	 = ПараметрыЗапроса.АдресМетода;
	ТелоЗапроса	 = ПараметрыЗапроса.ТелоЗапроса;
	Параметры	 = ПараметрыЗапроса.Параметры;
	Заголовки	 = ПараметрыЗапроса.Заголовки;
	
	Схема	 = ПараметрыСервиса.Схема;
	Порт	 = ПараметрыСервиса.Порт;
	
	Соединение		 = HTTPСоединение(ПараметрыСервиса);
	АдресРесурса	 = АдресРесурсаHTTP(АдресМетода, Параметры);
	РежимПрокси		 = ПараметрыСервиса.НастройкиПрокси.РежимПрокси;
	СтрокаЗапроса	 = Схема + "://" + ПараметрыСервиса.АдресВебСервиса +
					   ?(ЗначениеЗаполнено(Порт), ":" + Формат(Порт, "ЧГ=0"), "") + АдресРесурса;
	
	Соединение.Open(Метод, СтрокаЗапроса, 0);
	
	Если РежимПрокси = "UseProxy" Тогда
		ВыполнитьАвторизациюНаПрокси_COM(ПараметрыСервиса, Соединение);
	КонецЕсли;
	
	Для Каждого Элемент Из Заголовки Цикл
		Соединение.SetRequestHeader(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Если ТипЗнч(ТелоЗапроса) = Тип("ДвоичныеДанные") Тогда
		Соединение.Send(Base64Строка(ТелоЗапроса));
	Иначе 
		Соединение.Send(ТелоЗапроса);
	КонецЕсли;
	
	Возврат Соединение;
	
КонецФункции

Функция ЗаголовкиHTTPОтвета_COM(Соединение)
	
	Результат = Новый Соответствие;
	
	ЗаголовкиСтрокой = Соединение.GetAllResponseHeaders();
	МассивЗаголовков = РазделитьСтроку(ЗаголовкиСтрокой, Символы.ПС, Ложь);
	
	Для Каждого ЗаголовокСтрокой Из МассивЗаголовков Цикл
		
		ЧастиЗаголовка = РазделитьСтроку(ЗаголовокСтрокой, ":");
		
		Ключ	 = ЧастиЗаголовка[0];
		Значение = ЧастиЗаголовка[1];
		
		Результат.Вставить(Ключ, Значение);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДвоичныеДанныеHTTPОтвета_COM(Соединение)
	
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	
	Попытка
		Поток = Новый COMОбъект("ADODB.Stream");
	Исключение
		ОписаниеОшибки = "Не удалось инициализировать COM-объект ""ADODB.Stream""";
		ВызватьИсключение ОписаниеОшибки;
	КонецПопытки;
	
	Поток.Type = 1;  //Бинарный
	Поток.Mode = 3; 
	Поток.Open();
	Поток.Write(Соединение.responseBody);
	Поток.SaveToFile(ИмяФайлаОтвета);
	Поток.Close();	
	
	Результат = Новый ДвоичныеДанные(ИмяФайлаОтвета);
	
	УдалитьФайлы(ИмяФайлаОтвета);
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьПараметрыПрокси_COM(ПараметрыСервиса, Соединение)
	
	// Значения констант: https://msdn.microsoft.com/en-us/library/windows/desktop/aa384059(v=vs.85).aspx
	
	НастройкиПрокси	 = ПараметрыСервиса.НастройкиПрокси;
	РежимПрокси		 = НастройкиПрокси.РежимПрокси;
	
	Если РежимПрокси = "NoProxy" Тогда
		
		Соединение.SetProxy(1, "");  // HTTPREQUEST_PROXYSETTING_DIRECT = 1
		
	ИначеЕсли РежимПрокси = "UseDefaultProxy" Тогда
		
		Соединение.SetProxy(0, "");  // HTTPREQUEST_PROXYSETTING_PRECONFIG = 0
		
	ИначеЕсли РежимПрокси = "UseProxy" Тогда
		
		АдресПроксиСервера	= НастройкиПрокси.АдресПроксиСервера;
		Порт				= НастройкиПрокси.ПортПроксиСервера;
		
		Если Не ЗначениеЗаполнено(АдресПроксиСервера) Тогда
			ВызватьИсключение "Заполните настройки прокси";
		КонецЕсли;
		
		ProxyServer = АдресПроксиСервера + ":" + Формат(Порт, "ЧГ=0");
		
		Соединение.SetProxy(2, ProxyServer);  // HTTPREQUEST_PROXYSETTING_PROXY = 2
			
		// Логин и пароль необходимо указать после установки соединения - т.е. после вызова метода Open
		// Это вынесено в отдельный метод - ВыполнитьАвторизациюНаПрокси_COM
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьАвторизациюНаПрокси_COM(ПараметрыСервиса, Соединение)
	
	// Значения констант: https://msdn.microsoft.com/en-us/library/windows/desktop/aa384058(v=vs.85).aspx
	
	НастройкиПрокси = ПараметрыСервиса.НастройкиПрокси;
	
	Логин	 = НастройкиПрокси.ЛогинПроксиСервера;
	Пароль	 = НастройкиПрокси.ПарольПроксиСервера;
	
	Если ЗначениеЗаполнено(Логин) Тогда
		Соединение.SetCredentials(Логин, Пароль, 1);  // HTTPREQUEST_SETCREDENTIALS_FOR_PROXY = 1
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйИнтернетПрокси(НастройкиПрокси)
	
	РежимПрокси	= НастройкиПрокси.РежимПрокси;
	
	Если РежимПрокси = "UseProxy" Тогда
		
		Результат = Новый ИнтернетПрокси;
		
		АдресПроксиСервера	= НастройкиПрокси.АдресПроксиСервера;
		Порт				= НастройкиПрокси.ПортПроксиСервера;
		Логин				= НастройкиПрокси.ЛогинПроксиСервера;
		Пароль				= НастройкиПрокси.ПарольПроксиСервера;
		
		Если Не ЗначениеЗаполнено(АдресПроксиСервера) Тогда
			ВызватьИсключение "Заполните настройки прокси";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Логин) Тогда
			
			Результат.Установить("http"	, АдресПроксиСервера, Порт, Логин, Пароль, Ложь);
			Результат.Установить("https", АдресПроксиСервера, Порт, Логин, Пароль, Ложь);
			
		Иначе
			
			Результат.Установить("http"	, АдресПроксиСервера, Порт);
			Результат.Установить("https", АдресПроксиСервера, Порт);
			
		КонецЕсли;
		
	ИначеЕсли РежимПрокси = "UseDefaultProxy" Тогда
		
		Результат = Новый ИнтернетПрокси(Истина);
		// Будет использован прокси по умолчанию:
		// либо из файла inetcfg.xml, если он расположен на данной машине, либо из настроек Internet Explorer.
		// Пример файла inetcfg.xml можно найти в официальной документации:
		// https://its.1c.ru/db/v8doc#content:26:1:issogl1_3.13.inetcfg.xml
		
	Иначе
		
		Результат = Новый ИнтернетПрокси(Ложь);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовоеHTTPСоединение(ПараметрыСервиса, Прокси)
	
	АдресВебСервиса = ПараметрыСервиса.АдресВебСервиса;
	
	Схема				 = ПараметрыСервиса.Схема;
	Порт				 = ПараметрыСервиса.Порт;
	ИмяПользователя		 = Неопределено;
	Пароль				 = Неопределено;
	Если ПараметрыСервиса.Свойство("Таймаут") Тогда
		Таймаут = ПараметрыСервиса.Таймаут;
	Иначе
		Таймаут = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ТаймаутHTTP");
	КонецЕсли;
	ЗащищенноеСоединение = ЗащищенноеСоединениеOpenSSL();
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить(АдресВебСервиса);
	ПараметрыКонструктора.Добавить(Порт);
	ПараметрыКонструктора.Добавить(ИмяПользователя);
	ПараметрыКонструктора.Добавить(Пароль);
	ПараметрыКонструктора.Добавить(Прокси);
	ПараметрыКонструктора.Добавить(Таймаут);
	
	Если Схема = "https" Тогда
		ПараметрыКонструктора.Добавить(ЗащищенноеСоединение);
	КонецЕсли;
	
	Результат = Новый("HTTPСоединение", ПараметрыКонструктора);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйHTTPЗапрос(АдресРесурса, Заголовки)
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить(АдресРесурса);
	ПараметрыКонструктора.Добавить(Заголовки);
	
	Результат = Новый("HTTPЗапрос", ПараметрыКонструктора);
	
	Возврат Результат;
	
КонецФункции

Функция ЗащищенноеСоединениеOpenSSL()
	
	Результат = Новый("ЗащищенноеСоединениеOpenSSL");
	
	Возврат Результат;
	
КонецФункции

// Сравнивает текущую версию приложения с указанной версией.
// 
// Параметры:
//  Версия - Строка - номер версии, с которой нужно сравнить текущую версию приложения.
//
// Возвращаемое значение:
//   Булево - Истина, если текущая версия приложения старше чем версия параметра.
//            Например, 8.2 старше чем 8.3.
Функция ПриложениеСтаршеВерсии(Версия)
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Возврат СравнитьВерсии(СисИнфо.ВерсияПриложения, Версия) = "ПерваяМеньше";
	
КонецФункции

// Возвращает строку: "Равны" / "ПерваяБольше" / "ПерваяМеньше".
// Версии типа "1.0.1b" сравнивать нельзя.
Функция СравнитьВерсии(Знач ПерваяВерсия, Знач ВтораяВерсия, Разделитель = ".")
	
	Результат = "Равны";  // ПерваяБольше / ПерваяМеньше
	
	Пока НЕ ПустаяСтрока(ПерваяВерсия) ИЛИ НЕ ПустаяСтрока(ВтораяВерсия) Цикл
		
		Поз = Найти(ПерваяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерПервойВерсии = Число(Лев(ПерваяВерсия, Поз - 1));
			ПерваяВерсия = Сред(ПерваяВерсия, Поз + 1);
		Иначе
			НомерПервойВерсии = ?(ПустаяСтрока(ПерваяВерсия), 0, Число(ПерваяВерсия));
			ПерваяВерсия = "";
		КонецЕсли;
		
		Поз = Найти(ВтораяВерсия, Разделитель);
		Если Поз > 0 Тогда
			НомерВторойВерсии = Число(Лев(ВтораяВерсия, Поз - 1));
			ВтораяВерсия = Сред(ВтораяВерсия, Поз + 1);
		Иначе
			НомерВторойВерсии = ?(ПустаяСтрока(ВтораяВерсия), 0, Число(ВтораяВерсия));
			ВтораяВерсия = "";
		КонецЕсли;
		
		Если НомерПервойВерсии > НомерВторойВерсии Тогда
			
			Результат = "ПерваяБольше";
			Прервать;
			
		ИначеЕсли НомерПервойВерсии < НомерВторойВерсии Тогда
			
			Результат = "ПерваяМеньше";
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

 // Разделяет строку на части по указанным символам-разделителям.
// По аналогии с глобальным методом СтрРазделить, добавленным в платформу версии 8.3.6.
//
// Параметры:
//  Строка         - Строка - разделяемая строка;
//  Разделитель    - Строка - строка символов, каждый из которых является индивидуальным разделителем;
//  ВключатьПустые - Булево - Ложь, если пустые части строки включать в результат не нужно.
// 
// Возвращаемое значение:
//   Массив - массив со строками, которые получились в результате разделения исходной строки.
//
Функция РазделитьСтроку(Знач Строка, Разделитель = ",", ВключатьПустые = Истина)
	
	Результат = Новый Массив;
	
	МассивРазделителей = Новый Массив;
	
	Для Сч = 1 По СтрДлина(Разделитель) Цикл
		СимволРазделителя = Сред(Разделитель, Сч, 1);
		МассивРазделителей.Добавить(СимволРазделителя);
	КонецЦикла;
	
	Пока Истина Цикл
		
		Поз = 0;
		
		Для Каждого СимволРазделителя Из МассивРазделителей Цикл
			
			Поз = Найти(Строка, СимволРазделителя);
			
			Если Поз > 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Поз = 0 Тогда
			Подстрока	 = СокрЛП(Строка);
			Строка		 = "";
		Иначе
			Подстрока	 = СокрЛП(Лев(Строка, Поз - 1));
			Строка		 = Сред(Строка, Поз + 1);
		КонецЕсли;
		
		Если ВключатьПустые ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать; // Нет разделителя, за которым могла бы быть следующая часть строки.
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ФорматироватьJSON(ТекстJSON) Экспорт
	
	indent = -1;
	quoted = Ложь;
	sb = "";
	
	Для i = 1 По СтрДлина(ТекстJSON) Цикл
		ch = Сред(ТекстJSON, i, 1);
		
		Если ch = "[" Или ch = "{" Тогда
			sb = sb + ch + Символы.ПС;
			
			indent = indent + 1;
			Для Счет = 0 По indent Цикл
				sb = sb + Символы.Таб;
			КонецЦикла;
		ИначеЕсли ch = "]" Или ch = "}" Тогда
			sb = sb + Символы.ПС;
			indent = indent - 1;
			Для Счет = 0 По indent Цикл
				sb = sb + Символы.Таб;
			КонецЦикла;
			sb = sb + ch;
		ИначеЕсли ch = """" Тогда
			sb = sb + ch;
		ИначеЕсли ch = "," Тогда
			sb = sb + ch + Символы.ПС;
			Для Счет = 0 По indent Цикл
				sb = sb + Символы.Таб;
			КонецЦикла;
		ИначеЕсли ch = ":" Тогда
			sb = sb + ch + " ";
		Иначе
			sb = sb + ch;
		КонецЕсли;
	КонецЦикла;
	
	return sb;
	
КонецФункции

#КонецОбласти
