&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

&НаКлиенте
Перем МассивКолонок;
	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда	
		Элементы.ТаблицаНовыеШтрихкодыКолонка1.Видимость = Ложь;
	#КонецЕсли
	ПередОткрытием(Отказ);
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить(Новый Структура("Имя,Синоним,Тип","НомерСтроки","N",Новый  ОписаниеТипов("Число")));
	МассивКолонок.Добавить(Новый Структура("Имя,Синоним,Тип","Изменить","Записывать",Новый  ОписаниеТипов("Булево")));

	МетаданныеНСИ = _ЛокКонтекст.ЛокЯдро_ПолучитьМетаданныеНСИ();
	
	СтруктураХраненияШК = Новый Структура;
	СтруктураХраненияШК.Вставить("ШК_ОбъектМетаданных", 		МетаданныеНСИ.Штрихкоды.Путь_ОбъектМетаданных);
	СтруктураХраненияШК.Вставить("ШК_ИзмерениеНоменклатуры", 	МетаданныеНСИ.Штрихкоды.Реквизиты.Номенклатура);
	ШК_ИзмерениеУпаковки = ?(МетаданныеНСИ.Штрихкоды.Реквизиты.Свойство("ЕдиницаИзмерения"), МетаданныеНСИ.Штрихкоды.Реквизиты.ЕдиницаИзмерения, ""); 
	СтруктураХраненияШК.Вставить("ШК_ИзмерениеУпаковки", 		ШК_ИзмерениеУпаковки);
	СтруктураХраненияШК.Вставить("ШК_ИзмерениеШтрихкода", 		МетаданныеНСИ.Штрихкоды.Реквизиты.Штрихкод);
	
	Если Найти(МетаданныеНСИ.Штрихкоды.Путь_ОбъектМетаданных, "РегистрСведений") Тогда
	 	ОбработатьКоллекциюМетаданныхОбъекта(МетаданныеНСИ.Штрихкоды.Путь_ОбъектМетаданных + ".Измерения",МассивКолонок,СтруктураХраненияШК);
		ОбработатьКоллекциюМетаданныхОбъекта(МетаданныеНСИ.Штрихкоды.Путь_ОбъектМетаданных + ".Ресурсы",МассивКолонок,СтруктураХраненияШК);
		ОбработатьКоллекциюМетаданныхОбъекта(МетаданныеНСИ.Штрихкоды.Путь_ОбъектМетаданных + ".Реквизиты",МассивКолонок,СтруктураХраненияШК);
	Иначе
		ОбработатьКоллекциюМетаданныхОбъекта(МетаданныеНСИ.Штрихкоды.Путь_ОбъектМетаданных + ".Реквизиты",МассивКолонок,СтруктураХраненияШК);
	КонецЕсли;		
	
	// колонку "ИмяНеизвестного" нужно расположить справа от колонки "Номенклатура"
	КолонкаНоменклатура = _ЛокКонтекст.ЛокЯдро_НайтиСтруктуруВМассивеПоЭлементу(МассивКолонок,"Имя",МетаданныеНСИ.Штрихкоды.Реквизиты.Номенклатура,Истина);
	
	Если КолонкаНоменклатура <> Неопределено Тогда
		ИндексКолонкиНоменклатура = КолонкаНоменклатура;
	Иначе	
		ИндексКолонкиНоменклатура = 3;
	КонецЕсли;		
	
	МассивКолонок.Вставить(ИндексКолонкиНоменклатура + 1,Новый Структура("Имя,Синоним,Тип","ИмяНеизвестного","Имя неизвестного",Новый  ОписаниеТипов("Строка")));

	ДобавитьКолонкиТаблицаНовыеШтрихкоды(МассивКолонок,МетаданныеНСИ);

	//обработка полученной таблицы штрихкодов с MobileSMARTS в соответствии с объектом 1С где хранятся штрихкоды.Начало.
	Для каждого СтрокаТЧ из ВладелецФормы.ТаблицаНовыхШтрихкодов Цикл
		Если СтрокаТЧ.Свойство("ЭтоТаблицаЗначений") Тогда
			Продолжить;
		КонецЕсли;
		Если _ЛокКонтекст.ЛокЯдро_ШтрихКодЕстьВБазе1С(СтрокаТЧ.ШтрихКод, СтруктураХраненияШК) Тогда
			Продолжить
		КонецЕсли;
		
		// получаем данные штрихкода из ИО. Если ШК есть в базе, у него установлено свойство Существует
		ДанныеШтрихкода = _ЛокКонтекст.ЛокЯдро_ПолучитьДанныеШтрихКода(СтрокаТЧ.ШтрихКод);		
		Если ДанныеШтрихкода <> Неопределено И ДанныеШтрихкода.Свойство("Существует") 
				И ДанныеШтрихкода.Существует Тогда 
			Продолжить;
		КонецЕсли;		                                                                  		
		
		НоваяСтрока =  ТаблицаНовыеШтрихкоды.Добавить();
		НоваяСтрока.НомерСтроки = ТаблицаНовыеШтрихкоды.Индекс(НоваяСтрока)+1;
		НоваяСтрока[МетаданныеНСИ.Штрихкоды.Реквизиты.Штрихкод] = СтрокаТЧ.ШтрихКод;		

		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			НоваяСтрока[МетаданныеНСИ.Штрихкоды.Реквизиты.Номенклатура] = СтрокаТЧ.Номенклатура;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			УИД = Новый УникальныйИдентификатор();
			СтруктураДляПроверки = Новый Структура(СтруктураХраненияШК.ШК_ИзмерениеУпаковки, УИД);
			ЗаполнитьЗначенияСвойств(СтруктураДляПроверки, НоваяСтрока);
			Если СтруктураДляПроверки[СтруктураХраненияШК.ШК_ИзмерениеУпаковки] <> УИД Тогда 
				НоваяСтрока[СтруктураХраненияШК.ШК_ИзмерениеУпаковки] = СтрокаТЧ.Упаковка;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.Характеристика) Тогда
			НоваяСтрока[МетаданныеНСИ.Штрихкоды.Реквизиты.Характеристика] = СтрокаТЧ.Характеристика;	
		КонецЕсли;
		
		НоваяСтрока.ИмяНеизвестного = СтрокаТЧ.ИмяНеизвестного;
		
		// Заполнение колонок из дополнительных (расчетных) данных штрихкода, необходимых для корректной записи в БД
		Если ТипЗнч(ДанныеШтрихкода) = Тип("Структура") Тогда
			Для Каждого ЭлементШтрихкода Из ДанныеШтрихкода Цикл
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					ЕстьКолонкаТЧ = ТаблицаНовыеШтрихкоды.Колонки.Найти(ЭлементШтрихкода.Ключ) <> Неопределено;
				#Иначе
					ЕстьКолонкаТЧ = НоваяСтрока.Свойство(ЭлементШтрихкода.Ключ);
				#КонецЕсли
				
				Если ЕстьКолонкаТЧ И НЕ ЗначениеЗаполнено(НоваяСтрока[ЭлементШтрихкода.Ключ]) Тогда
					НоваяСтрока[ЭлементШтрихкода.Ключ] = ЭлементШтрихкода.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
				
	КонецЦикла;
	//обработка полученной таблицы штрихкодов с MobileSMARTS в соответствии с объектом 1С где хранятся штрихкоды.Окончание.
	
	Если НЕ ТаблицаНовыеШтрихкоды.Количество() Тогда
		Сообщение = НСтр("be = 'Няма новых штрыхкодаў для дадання!'; en = 'No new barcodes to add!'; es = '¡No hay nuevos códigos de barras para agregar!'; ka = 'არ არის ახალი შტრიხკოდები დამატებისთვის!'; kk = 'Қосу үшін жаңа штрихкодтар жоқ!'; ro = 'Nu există coduri de bare noi de adăugat!'; ru = 'Нет новых штрихкодов для добавления!'; tr = 'Eklenecek yeni barkod yok!'; uk = 'Немає нових штрихкодів для додавання!'; uz = ""Qo'shimcha barkodlar qo'shish uchun yangi yo'q!""");
		Сообщить(Сообщение); 
		Отказ = Истина;			
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкиТаблицаНовыеШтрихкоды(МассивКолонок,МетаданныеНСИ)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Для каждого Колонка из МассивКолонок Цикл
			ТаблицаНовыеШтрихкоды.Колонки.Добавить(Колонка.Имя,Колонка.Тип,Колонка.Синоним);
		КонецЦикла;
		Элементы.ТаблицаНовыеШтрихкоды.СоздатьКолонки();
		
		Для каждого Колонка из ТаблицаНовыеШтрихкоды.Колонки Цикл
			
			КолонкаТЧ =  Элементы.ТаблицаНовыеШтрихкоды.Колонки[Колонка.Имя];
			ЭлементУправленияТЧ = КолонкаТЧ.ЭлементУправления;
			//ЭлементУправленияТЧ.УстановитьДействие("НачалоВыбора",Новый Действие("ДействиеНачалоВыбораЗначения"));
			Если Колонка.ТипЗначения.СодержитТип(Тип("Булево")) Тогда
				КолонкаТЧ.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
			Иначе
				ЭлементУправленияТЧ.УстановитьДействие("НачалоВыбора",Новый Действие("ОФ_ДействиеНачалоВыбораЗначения"));
				ЭлементУправленияТЧ.АвтоОтметкаНезаполненного = Истина;
				ЭлементУправленияТЧ.ОтметкаНезаполненного     = Истина;
			КонецЕсли;
			
			ЭлементУправленияТЧ.УстановитьДействие("ПриИзменении",Новый Действие("ДействиеПриИзмененииЗначения"));
			КолонкаТЧ.Ширина  = 15;
			
		КонецЦикла;
		
		КолонкаФлагВыбора = Элементы.ТаблицаНовыеШтрихкоды.Колонки.Найти("Изменить");
		КолонкаФлагВыбора.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;  
		КолонкаФлагВыбора.УстановитьЭлементУправления(Тип("Флажок"));
		КолонкаФлагВыбора.ДанныеФлажка     = "Изменить";
		КолонкаФлагВыбора.Данные           = "";
		КолонкаФлагВыбора.ТекстШапки       = НСтр("be = 'Запісваць'; en = 'Recording'; es = 'Guardar'; ka = 'ჩაწერვა'; kk = 'Жазу'; ro = 'Înregistrare'; ru = 'Записывать'; tr = 'Kaydet'; uk = 'Записувати'; uz = 'Yozish'");
		КолонкаФлагВыбора.Ширина           = 10;
		КолонкаФлагВыбора.ЭлементУправления.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		КолонкаФлагВыбора.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
		
		КолонкаНомерСтроки = Элементы.ТаблицаНовыеШтрихкоды.Колонки.Найти("НомерСтроки");
		КолонкаНомерСтроки.Ширина           = 3;
		КолонкаНомерСтроки.ТолькоПросмотр   = Истина;
		КолонкаНомерСтроки.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
		
		КолонкаШтрихкод = Элементы.ТаблицаНовыеШтрихкоды.Колонки.Найти(МетаданныеНСИ.Штрихкоды.Реквизиты.Штрихкод);
		КолонкаШтрихкод.Ширина           = 13;
		КолонкаШтрихкод.ТолькоПросмотр   = Истина;
		КолонкаШтрихкод.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
		
		КолонкаНоменклатура = Элементы.ТаблицаНовыеШтрихкоды.Колонки[МетаданныеНСИ.Штрихкоды.Реквизиты.Номенклатура]; 
		КолонкаНоменклатура.ЭлементУправления.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка." + МетаданныеНСИ.Номенклатура.ИмяСправочника); 
		КолонкаНоменклатура.ЭлементУправления.Значение = КолонкаНоменклатура.ЭлементУправления.ОграничениеТипа.ПривестиЗначение(КолонкаНоменклатура.ЭлементУправления.Значение);

		
	#Иначе
		
		МассивРеквизитов = Новый Массив;
		
		ТаблицаПолейВыбора = Элементы.ТаблицаНовыеШтрихкоды;
		
		Для Каждого Колонка Из МассивКолонок Цикл
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя,Колонка.Тип,"ТаблицаНовыеШтрихкоды"));
			
		КонецЦикла;
		ИзменитьРеквизиты(МассивРеквизитов);
		
		Для Каждого Колонка Из МассивКолонок Цикл	
			
			НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ТаблицаПолейВыбора);
			НовыйЭлемент.ПутьКДанным = "ТаблицаНовыеШтрихкоды." + Колонка.Имя;
			Если Колонка.Тип.СодержитТип(Тип("Булево")) Тогда
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
				НовыйЭлемент.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
			Иначе
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.УстановитьДействие("НачалоВыбора","ДействиеНачалоВыбораЗначения");
				НовыйЭлемент.БыстрыйВыбор = Ложь;
				НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
			КонецЕсли;
			РазмерКолонки = 15;
			Если НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка Тогда
				НовыйЭлемент.ШиринаЭлемента = РазмерКолонки;
			Иначе
				НовыйЭлемент.Ширина = РазмерКолонки;
			КонецЕсли;
			ЗаголовокКолонки = Неопределено;
			Если Колонка.Свойство("Синоним",ЗаголовокКолонки) Тогда
				НовыйЭлемент.Заголовок = ЗаголовокКолонки;
			КонецЕсли;		
			
			НовыйЭлемент.УстановитьДействие("ПриИзменении","ДействиеПриИзмененииЗначения");
			//НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
			//НовыйЭлемент.ОтметкаНезаполненного     = Истина;
			
		КонецЦикла; 
		КолонкаНоменклатура = Элементы[МетаданныеНСИ.Штрихкоды.Реквизиты.Номенклатура]; 
		КолонкаНоменклатура.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка." + МетаданныеНСИ.Номенклатура.ИмяСправочника);
	#КонецЕсли
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьКоллекциюМетаданныхОбъекта(Знач КоллекцияМетаданныхОбъектаИмя,МассивКолонок,СтруктураХраненияШК)
	
	КоллекцияМетаданныхОбъекта = "";
	КоллекцияМетаданныхОбъектаИмя = СтрЗаменить(КоллекцияМетаданныхОбъектаИмя,"РегистрСведений","РегистрыСведений");
	КоллекцияМетаданныхОбъектаИмя = СтрЗаменить(КоллекцияМетаданныхОбъектаИмя,"Справочник","Справочники");
	
	#Область НесовместимыйКодFresh
	Выполнить("КоллекцияМетаданныхОбъекта = Метаданные."+КоллекцияМетаданныхОбъектаИмя);
	#КонецОбласти //НесовместимыйКодFresh
	#Область СовместимыйКодFresh
	//СтрокаВызова = "КоллекцияМетаданныхОбъекта = Метаданные."+КоллекцияМетаданныхОбъектаИмя;
	//СтрокаВызова = СтрЗаменить(СтрокаВызова, "КоллекцияМетаданныхОбъекта", "Параметры.КоллекцияМетаданныхОбъекта");
	//ПараметрыАлгоритма = Новый Структура;
	//ПараметрыАлгоритма.Вставить("КоллекцияМетаданныхОбъекта", 	КоллекцияМетаданныхОбъекта);
	//ОбщегоНазначения.ВыполнитьВБезопасномРежиме(СтрокаВызова, ПараметрыАлгоритма);
	//КоллекцияМетаданныхОбъекта = ПараметрыАлгоритма.КоллекцияМетаданныхОбъекта;
	#КонецОбласти //СовместимыйКодFresh
	
	Если Найти(КоллекцияМетаданныхОбъектаИмя, "Справочник") Тогда
		ЕстьКолонкаНоменклатура = Ложь;
		ЕстьКолонкаШтрихКод     = Ложь;
		Для каждого КолонкаТаблицы из МассивКолонок Цикл
			Если  КолонкаТаблицы.Синоним = "Номенклатура" Тогда
				ЕстьКолонкаНоменклатура = Истина;
			КонецЕсли;
			Если  КолонкаТаблицы.Синоним = "Штрихкод" Тогда
				ЕстьКолонкаШтрихКод = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если не ЕстьКолонкаНоменклатура Тогда
			МассивКолонок.Добавить(Новый Структура("Имя,Синоним,Тип",СтруктураХраненияШК.ШК_ИзмерениеНоменклатуры,"Номенклатура",Новый ОписаниеТипов("СправочникСсылка.номенклатура")));
		КонецЕсли;		
		Если не ЕстьКолонкаШтрихКод Тогда
			МассивКолонок.Добавить(Новый Структура("Имя,Синоним,Тип",СтруктураХраненияШК.ШК_ИзмерениеШтрихкода,"Штрихкод",Новый ОписаниеТипов("Строка")));
		КонецЕсли;
	КонецЕсли;

	ТипНоменклатура = Тип("СправочникСсылка.Номенклатура");
	
	Для каждого ЭлементКоллекции из КоллекцияМетаданныхОбъекта Цикл
		Если Найти(ЭлементКоллекции.имя,"Удалить") = 0 Тогда
			НазваниеКолонкиНоменклатура = ?(ЭлементКоллекции.тип.СодержитТип(ТипНоменклатура),"Номенклатура", ЭлементКоллекции.Синоним);
			МассивКолонок.Добавить(Новый Структура("Имя,Синоним,Тип",ЭлементКоллекции.имя,НазваниеКолонкиНоменклатура,ЭлементКоллекции.Тип));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПриИзмененииЗначения(Элемент)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ИмяКолонки = Элементы.ТаблицаНовыеШтрихкоды.ТекущаяКолонка.Имя;
	#Иначе
		ИмяКолонки = Элемент.Имя;
	#КонецЕсли	
	//если номенклатура перевыбрана, проверить соответствие всех значений колонок, выбранных ранее
	Если ИмяКолонки = СтруктураХраненияШК.ШК_ИзмерениеНоменклатуры Тогда
		
		ТекущиеДанные = Элементы.ТаблицаНовыеШтрихкоды.ТекущиеДанные;
		
		// Проверка, что колонка с единицей измерения существует
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ЕстьКолонкаЕдиницаИзмерения = ТаблицаНовыеШтрихкоды.Колонки.Найти(СтруктураХраненияШК.ШК_ИзмерениеУпаковки) <> Неопределено;
		#Иначе
			ЕстьКолонкаЕдиницаИзмерения = ТекущиеДанные.Свойство(СтруктураХраненияШК.ШК_ИзмерениеУпаковки);
		#КонецЕсли
		
		Если ЕстьКолонкаЕдиницаИзмерения Тогда
			РезультатПоиска = _ЛокКонтекст.ЛокЯдро_ПолучитьЕдиницуИзмеренияПоУмолчанию(ТекущиеДанные[СтруктураХраненияШК.ШК_ИзмерениеНоменклатуры]);
			Если ЗначениеЗаполнено(РезультатПоиска) Тогда
				ТекущиеДанные[СтруктураХраненияШК.ШК_ИзмерениеУпаковки] = РезультатПоиска;
			КонецЕсли;
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеНачалоВыбораЗначения(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ТекущиеДанные = Элементы.ТаблицаНовыеШтрихкоды.ТекущиеДанные;
	ИмяКолонки = Элемент.Имя;
	ТекущееЗначение = ТекущиеДанные[ИмяКолонки];
	
	//получить владельцев
	попытка
		СтандартнаяОбработка = НЕ ЕстьВладельцыОбъекта(ТекущееЗначение);		
	Исключение
 	КонецПопытки;
	
	//отбор в поле по владельцу
	Если НЕ СтандартнаяОбработка Тогда
		Попытка
			ИзмерениеНоменклатуры = СтруктураХраненияШК.ШК_ИзмерениеНоменклатуры;
			Номенклатура = ТекущиеДанные[ИзмерениеНоменклатуры];
			Если ЗначениеЗаполнено(Номенклатура) Тогда
				ПараметрыФормы = Новый Структура;
				Отбор = Новый Структура;
				ПараметрыФормы.Вставить("Отбор", Отбор);				
				Если ИмяКолонки = "Характеристика" Тогда
					Владелец = ПолучитьВладельцаХарактеристик(Номенклатура);					
					Если ЗначениеЗаполнено(Владелец) Тогда
						Отбор.Вставить("Владелец", Владелец);					
					Иначе
						ПараметрыФормы.Вставить("Номенклатура", Номенклатура);					
					КонецЕсли;	
				ИначеЕсли ИмяКолонки = "Упаковка" Тогда
					ПараметрыФормы.Вставить("Номенклатура", Номенклатура);										
				КонецЕсли;	
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ИмяСправочника", ИмяКолонки);
				ОповещениеПослеВыбораЗначения = Новый ОписаниеОповещения("ОповещениеПослеВыбораЗначения", ЭтаФорма, ДополнительныеПараметры);
				ФормаВыбора = ОткрытьФорму(ИмяТаблицыПоСсылке(ТекущееЗначение) + ".ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОповещениеПослеВыбораЗначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе
				ТекстПредупреждения = НСтр("be = 'Не абрана наменклатура!'; en = 'No item selected!'; es = '¡No se ha seleccionado una nomenclatura!'; ka = 'არ არის არჩეული ნომენკლატურა!'; kk = 'Номенклатура таңдалмады!'; ro = 'Nu a fost selectată nomenclatura!'; ru = 'Не выбрана номенклатура!'; tr = 'Malzeme seçilmedi!'; uk = 'Не обрана номенклатура!'; uz = 'Nomenklatura tanlanmagan!'");
				ПоказатьПредупреждение(, ТекстПредупреждения, 10, ТекстИзменениеДанных()); 
			КонецЕсли;
		Исключение
			Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); 
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПослеВыбораЗначения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Элементы.ТаблицаНовыеШтрихкоды.ТекущиеДанные[ДополнительныеПараметры.ИмяСправочника] = Результат;			
	КонецЕсли; 
	
КонецПроцедуры	

&НаСервере
Функция ПроверитьЗаполненностьКолонокСтроки(ИдентификаторСтрокиТЧ)

	Отказ = Ложь;
	
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		КолонкиТЗ = ТаблицаНовыеШтрихкоды.Колонки;
		СтрокаТЧ = ИдентификаторСтрокиТЧ;
	#Иначе
		КолонкиТЗ = РеквизитФормыВЗначение("ТаблицаНовыеШтрихкоды").Колонки;
		СтрокаТЧ = ТаблицаНовыеШтрихкоды.НайтиПоИдентификатору(ИдентификаторСтрокиТЧ);
	#КонецЕсли
	
	РегистрСведенийИмя = СтруктураХраненияШК.ШК_ОбъектМетаданных;
	РегистрСведенийИмя = СтрЗаменить(РегистрСведенийИмя,"РегистрСведений.","");
	
	ОбъектХраненияРегистрСведений = Найти(СтруктураХраненияШК.ШК_ОбъектМетаданных,"РегистрСведений")>0;
	
	//проверить заполненность колонок строки.Начало.
	//все отображаемые колонки должны быть заполнены.
	ДанныеКолонокНеЗаполнены = ложь;
	Для каждого КолонкаТЧ из КолонкиТЗ Цикл
		КолонкаТЧИмя = Нрег(КолонкаТЧ.имя);
		Если Найти("изменить,номерстроки",НРег(КолонкаТЧИмя))>0 Тогда
			Продолжить
		КонецЕсли;
		
		Если ОбъектХраненияРегистрСведений Тогда
			ИзмерениеРегистра = Метаданные.РегистрыСведений[РегистрСведенийИмя].Измерения.Найти(КолонкаТЧИмя); 
			Если (ИзмерениеРегистра <> Неопределено и ИзмерениеРегистра.ЗапрещатьНезаполненныеЗначения) 
				или КолонкаТЧИмя = нрег(СтруктураХраненияШК.ШК_ИзмерениеШтрихкода)
				или КолонкаТЧИмя = "качество" 
				или КолонкаТЧИмя = Нрег(СтруктураХраненияШК.ШК_ИзмерениеНоменклатуры) Тогда
				Если не ЗначениеЗаполнено(СтрокаТЧ[КолонкаТЧИмя]) Тогда
					ДанныеКолонокНеЗаполнены = Истина;
					Сообщение = НСтр("be = 'У радку №%1 не зададзена значэнне ў калонцы ""%2""'; en = 'No value is specified in column ""%2"" in row #%1'; es = 'No se ha especificado un valor en la columna ""%2"" de la fila n.°%1'; ka = 'სტრიქონში №%1 არ არის მნიშვნელობა სვეტში ""%2""'; kk = '%1 бағанында ""%2"" бағытында мән берілмеген'; ro = 'În rândul nr.%1 nu este specificată o valoare în coloana ""%2""'; ru = 'В строке №%1 не задано значение в колонке ""%2""'; tr = '%1 numaralı satırda ""%2"" sütununda değer belirtilmedi'; uk = 'У строці №%1 не задано значення в колонці ""%2""'; uz = '%1 qatorida ""%2"" ustunida qiymat kiritilmagan'");
					#Если Не ТолстыйКлиентОбычноеПриложение Тогда
						Сообщение = РеквизитФормыВЗначение("Объект").ГлЯдро_СтрШаблон(Сообщение, Формат(СтрокаТЧ.НомерСтроки,"ЧГ="), КолонкаТЧ.Заголовок);
					#Иначе
						Сообщение = _ЛокКонтекст.ЛокЯдро_СтрШаблон(Сообщение, Формат(СтрокаТЧ.НомерСтроки,"ЧГ="), КолонкаТЧ.Заголовок);
					#КонецЕсли
					Сообщить(Сообщение, СтатусСообщения.Важное); 
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если КолонкаТЧИмя = Нрег(СтруктураХраненияШК.ШК_ИзмерениеШтрихкода)
				или КолонкаТЧИмя = Нрег(СтруктураХраненияШК.ШК_ИзмерениеНоменклатуры)
				или КолонкаТЧИмя = Нрег(СтруктураХраненияШК.ШК_ИзмерениеУпаковки) тогда
				Если не ЗначениеЗаполнено(СтрокаТЧ[КолонкаТЧИмя]) Тогда
					ДанныеКолонокНеЗаполнены = Истина;
					Сообщение = НСтр("be = 'У радку №%1 не зададзена значэнне ў калонцы ""%2""'; en = 'No value is specified in column ""%2"" in row #%1'; es = 'No se ha especificado un valor en la columna ""%2"" de la fila n.°%1'; ka = 'სტრიქონში №%1 არ არის მნიშვნელობა სვეტში ""%2""'; kk = '%1 бағанында ""%2"" бағытында мән берілмеген'; ro = 'În rândul nr.%1 nu este specificată o valoare în coloana ""%2""'; ru = 'В строке №%1 не задано значение в колонке ""%2""'; tr = '%1 numaralı satırda ""%2"" sütununda değer belirtilmedi'; uk = 'У строці №%1 не задано значення в колонці ""%2""'; uz = '%1 qatorida ""%2"" ustunida qiymat kiritilmagan'");
					#Если Не ТолстыйКлиентОбычноеПриложение Тогда
						Сообщение = РеквизитФормыВЗначение("Объект").ГлЯдро_СтрШаблон(Сообщение, Формат(СтрокаТЧ.НомерСтроки,"ЧГ="), КолонкаТЧ.Заголовок);
					#Иначе
						Сообщение = _ЛокКонтекст.ЛокЯдро_СтрШаблон(Сообщение, Формат(СтрокаТЧ.НомерСтроки,"ЧГ="), КолонкаТЧ.Заголовок);
					#КонецЕсли
					Сообщить(Сообщение, СтатусСообщения.Важное); 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;			
	КонецЦикла;
	
	Если ДанныеКолонокНеЗаполнены Тогда
		Отказ = Истина;		
	КонецЕсли;
	//проверить заполненность колонок строки.Окончание.			
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура ОсновныеДействияФормыЗаписатьШтрихкоды(Кнопка)
	
	Отказ = Ложь;
	
	ДобавленныеШК = Новый СписокЗначений;		
	
	СтруктураИменКолонок = ПолучитьСтруктуруИменКолонокТаблицы();
	
	Для каждого СтрокаТЧ из ТаблицаНовыеШтрихкоды Цикл
		Если Не СтрокаТЧ.Изменить Тогда
			Продолжить;
		КонецЕсли;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ИдентификаторСтрокиТЧ = СтрокаТЧ;
		#Иначе
			ИдентификаторСтрокиТЧ = СтрокаТЧ.ПолучитьИдентификатор();
		#КонецЕсли
		
		ДанныеКолонокНеЗаполнены = ПроверитьЗаполненностьКолонокСтроки(ИдентификаторСтрокиТЧ);
		
		Если ДанныеКолонокНеЗаполнены Тогда
			Отказ = Истина;
			Продолжить
		КонецЕсли;		
		
		Штрихкод =  СтрокаТЧ[СтруктураХраненияШК.ШК_ИзмерениеШтрихкода];

		//проверка существования штрихкода в базе.Начало.
		Если _ЛокКонтекст.ЛокЯдро_ШтрихКодЕстьВБазе1С(Штрихкод, СтруктураХраненияШК) Тогда
			ДобавленныеШК.Добавить(Штрихкод);
			Продолжить
		КонецЕсли;
		//проверка существования штрихкода в базе.Окончание.
		
		ЗаполнитьЗначенияСвойств(СтруктураИменКолонок, СтрокаТЧ);
		_ЛокКонтекст.ЛокЯдро_СоздатьНовыйШтрихкод(СтруктураИменКолонок, СтруктураХраненияШК, ДобавленныеШК);
				
	КонецЦикла;
	
	ЕстьДобавленныеШтрихкоды = Ложь;
	Если ДобавленныеШК.Количество()>0 Тогда   //если штрихкоды добавлены в 1с, удалить их с терминала
		ЕстьДобавленныеШтрихкоды = Истина;
		сч = 0;
		Пока сч < ТаблицаНовыеШтрихкоды.Количество()  Цикл
			Если ДобавленныеШК.НайтиПоЗначению(ТаблицаНовыеШтрихкоды[сч][СтруктураХраненияШК.ШК_ИзмерениеШтрихкода]) <> Неопределено Тогда
				ТаблицаНовыеШтрихкоды.Удалить(сч);
			Иначе
				сч = сч + 1;
			КонецЕсли
		КонецЦикла;      
		
		сч = 0;
		Пока сч < ВладелецФормы.ТаблицаНовыхШтрихкодов.Количество()  Цикл
			Если ВладелецФормы.ТаблицаНовыхШтрихкодов[сч].Свойство("ЭтоТаблицаЗначений") Тогда
				сч = сч + 1;
				Продолжить;
			КонецЕсли;	
			Если ДобавленныеШК.НайтиПоЗначению(ВладелецФормы.ТаблицаНовыхШтрихкодов[сч]["Штрихкод"]) <> Неопределено Тогда
				ВладелецФормы.ТаблицаНовыхШтрихкодов.Удалить(сч);
			Иначе
				сч = сч + 1;
			КонецЕсли
		КонецЦикла;   
	КонецЕсли; 
	
	Если Отказ тогда
		ТекстПредупреждения = НСтр("be = 'Узніклі памылкі пры даданні новых штрыхкодаў! Не ўсе выбраныя для дадання штрыхкоды былі запісаны ў базу! Падрабязнае апісанне памылкі глядзіце ў акне паведамленняў!'; en = 'Errors occurred while adding new barcodes! Not all selected barcodes for addition were saved in the database! See detailed error description in the message window!'; es = '¡Se produjeron errores al agregar nuevos códigos de barras! ¡No todos los códigos de barras seleccionados para agregar se guardaron en la base de datos! Consulte una descripción detallada del error en la ventana de mensajes'; ka = 'შეცდომები წარმოების ახალი შტრიხკოდების დამატებისას! ყველა არჩეული დამატებისთვის შტრიხკოდები არ ჩაიწერე ბაზაში! შეცვლილი შეცდომის დეტალური აღწერა ნახეთ შეტყობინებების ფანჯარაში!'; kk = 'Жаңа штрихкодтарды қосу кезінде қателіктер пайда болды! Қосу үшін таңдалған барлық штрихкодтар базаға жазылған жоқ! Қателік толық сипаттамасын октемдіктің терезесінде көріңіз!'; ro = 'Au aparut erori la adaugarea de coduri de bare noi! Nu toate codurile de bare selectate pentru adaugare au fost inregistrate in baza de date! Consultati fereastra de mesaje pentru o descriere detaliata a erorii!'; ru = 'Возникли ошибки при добавлении новых штрихкодов! Не все выбранные для добавления штрихкоды были записаны в базу! Подробное описание ошибки смотрите в окне сообщений!'; tr = 'Yeni barkodlar eklenirken hatalar oluştu! Eklemek için seçilen tüm barkodlar veritabanına kaydedilmedi! Hata ayrıntıları için ileti penceresine bakın!'; uk = 'Виникли помилки при додаванні нових штрихкодів! Не всі обрані для додавання штрихкоди були записані в базу! Детальний опис помилки дивіться у вікні повідомлень!'; uz = ""Yangi shtrixkodlarni qo'shishda xatoliklar yuzaga keldi! Qo'shish uchun tanlangan barcha shtrixkodlar bazaga yozilmadi! Xatolikning tafsiliy tasviri xabar oynasida ko'ring!""");
		ПоказатьПредупреждение(, ТекстПредупреждения, 20, ТекстИзменениеДанных()); 
	Иначе
		Если ЕстьДобавленныеШтрихкоды Тогда
			ТекстПредупреждения = НСтр("be = 'Штрыхкоды паспяхова дададзеныя! Спіс дададзеных штрыхкодаў прадстаўлены ў акне паведамленняў!'; en = 'Barcodes successfully added! The list of added barcodes is provided in the message window!'; es = '¡Códigos de barras añadidos con éxito! ¡La lista de códigos de barras añadidos se muestra en la ventana de mensajes!'; ka = 'შტრიხკოდები წარმატებით დაემატა! დამატებული შტრიხკოდების სია მოცემულ შეტყობინებების ფანჯრში მოცემულია!'; kk = 'Штрихкодтар сәтті қосылды! Қосылған штрихкодтар тізімі хабарлама терезесінде көрсетілген!'; ro = 'Codurile de bare au fost adăugate cu succes! Lista codurilor de bare adăugate este prezentată în fereastra de mesaje!'; ru = 'Штрихкоды успешно добавлены! Список добавленных штрихкодов приведен в окне сообщений!'; tr = 'Barkodlar başarıyla eklendi! Eklenen barkodların listesi mesaj penceresinde verilmiştir!'; uk = 'Штрихкоди успішно додані! Список доданих штрихкодів наведено в вікні повідомлень!'; uz = ""Shtrixkodlar muvaffaqiyatli qo'shildi! Qo'shilgan shtrixkodlar ro'yxati xabar oynasida ko'rsatilgan!""");
			ПоказатьПредупреждение(, ТекстПредупреждения, 20, ТекстИзменениеДанных()); 
		КонецЕсли;
	КонецЕсли;
	
	Если ТаблицаНовыеШтрихкоды.Количество() = 0 Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельТаблицыШтрхкодыОчиститьВыделение(Кнопка)
	
	Для каждого Строка Из ТаблицаНовыеШтрихкоды Цикл
		Строка.Изменить = Ложь;			
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельТаблицыШтрхкодыВыделитьВсе(Кнопка)
	
	Для каждого Строка Из ТаблицаНовыеШтрихкоды Цикл
		Строка.Изменить = Истина;			
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПередОткрытием(Отказ)
	
	Если ВладелецФормы.ТаблицаНовыхШтрихкодов.Количество() = 0 Тогда
		Сообщение = НСтр("be = 'Няма новых штрыхкодаў для дадання!'; en = 'No new barcodes to add!'; es = '¡No hay nuevos códigos de barras para agregar!'; ka = 'არ არის ახალი შტრიხკოდები დამატებისთვის!'; kk = 'Қосу үшін жаңа штрихкодтар жоқ!'; ro = 'Nu există coduri de bare noi de adăugat!'; ru = 'Нет новых штрихкодов для добавления!'; tr = 'Eklenecek yeni barkod yok!'; uk = 'Немає нових штрихкодів для додавання!'; uz = ""Qo'shimcha barkodlar qo'shish uchun yangi yo'q!""");
		Сообщить(Сообщение); 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ЗаписаныНовыеШтрихкоды 
		//и Вопрос("Перезаполнить таблицу товаров полученных из ТСД?", РежимДиалогаВопрос.ДаНет, 0,,"Изменение данных") = КодВозвратаДиалога.Да 
		Тогда			
		//ВладелецФормы.ЗагрузитьДанныеНажатие(Неопределено,Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНовыеШтрихкодыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = истина;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьВладельцыОбъекта(Ссылка)

	Возврат Ссылка.Метаданные().Владельцы.Количество() > 0;
	
КонецФункции 

// Возвращает полное имя объекта метаданных по переданному значению ссылки.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, для которого необходимо получить имя таблицы ИБ.
// 
// Возвращаемое значение:
//  Строка - полное имя объекта метаданных для указанного объекта. Например: "Справочник.Номенклатура".
//
&НаСервереБезКонтекста
Функция ИмяТаблицыПоСсылке(Ссылка)
	
	Возврат Ссылка.Метаданные().ПолноеИмя();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВладельцаХарактеристик(Номенклатура)

	Владелец = Неопределено;
		
	// Если признак использования характеристик зашит в номенклатуре
	Если Метаданные.Справочники.Номенклатура.Реквизиты.Найти("ИспользованиеХарактеристик") <> Неопределено 
		И Метаданные.Перечисления.Найти("ВариантыИспользованияХарактеристикНоменклатуры") <> Неопределено Тогда	
		
		Если Номенклатура.ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			Владелец = Номенклатура.ВидНоменклатуры;
		ИначеЕсли Номенклатура.ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры") Тогда
			Владелец = Номенклатура;
		ИначеЕсли Номенклатура.ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры") Тогда
			Владелец = Номенклатура.ВладелецХарактеристик;
		ИначеЕсли Номенклатура.ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать") Тогда
			Владелец = Неопределено;		
		Иначе		
			Владелец = Неопределено;		
		КонецЕсли;			
		
	// Если признак использования характеристик зашит в виде номенклатуры
	ИначеЕсли Метаданные.Справочники.ВидыНоменклатуры.Реквизиты.Найти("ИспользованиеХарактеристик") <> Неопределено 
		И Метаданные.Перечисления.Найти("ВариантыВеденияДополнительныхДанныхПоНоменклатуре") <> Неопределено Тогда	
		
		Если Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ОбщиеДляВидаНоменклатуры") Тогда
			Владелец = Номенклатура.ВидНоменклатуры;	
		ИначеЕсли Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ИндивидуальныеДляНоменклатуры") Тогда
			Владелец = Номенклатура;	
		ИначеЕсли Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.НеИспользовать") Тогда
			Владелец = Неопределено;	
		Иначе
			Владелец = Неопределено;	
		КонецЕсли;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Владелец;
	
КонецФункции

// Получает структуру имен колонок таблицы
//
// Возвращаемое значение:
//   Стуктура   - структура имен колонок таблицы
//
Функция ПолучитьСтруктуруИменКолонокТаблицы()

	СтруктураИменКолонок = Новый Структура;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТаблицаЗначений = ТаблицаНовыеШтрихкоды;
	#Иначе
		ТаблицаЗначений = ТаблицаНовыеШтрихкоды.Выгрузить();
	#КонецЕсли
	
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		СтруктураИменКолонок.Вставить(Колонка.Имя);	
	КонецЦикла;

	Возврат СтруктураИменКолонок;
	
КонецФункции

&НаКлиенте
Функция ТекстИзменениеДанных()
	Возврат НСтр("be = 'Змена дадзеных'; en = 'Data change'; es = 'Cambio de datos'; ka = 'მონაცემების შეცვლა'; kk = 'Деректерді өзгерту'; ro = 'Modificare date'; ru = 'Изменение данных'; tr = 'Veri Değişikliği'; uk = 'Зміна даних'; uz = ""Ma'lumotlarni o'zgartirish""");
КонецФункции

#Если ТолстыйКлиентОбычноеПриложение Тогда
	
	Процедура ОФ_ДействиеНачалоВыбораЗначения(Элемент, СтандартнаяОбработка)
		
		ТекущиеДанные = Элементы.ТаблицаНовыеШтрихкоды.ТекущиеДанные;
		ИмяКолонки = Элементы.ТаблицаНовыеШтрихкоды.ТекущаяКолонка.Имя;
		ТекущееЗначение = ТекущиеДанные[ИмяКолонки];
		
		//получить владельцев
		попытка
			СтандартнаяОбработка = НЕ ЕстьВладельцыОбъекта(ТекущееЗначение);		
		Исключение
		КонецПопытки;
		
		//отбор в поле по владельцу
		Если НЕ СтандартнаяОбработка Тогда
			Попытка
				ИзмерениеНоменклатуры = СтруктураХраненияШК.ШК_ИзмерениеНоменклатуры;
				Номенклатура = ТекущиеДанные[ИзмерениеНоменклатуры];
				Если ЗначениеЗаполнено(Номенклатура) Тогда
					ПараметрыФормы = Новый Структура;
					Отбор = Новый Структура;
					ПараметрыФормы.Вставить("Отбор", Отбор);				
					Если ИмяКолонки = "Характеристика" Тогда
						Владелец = ПолучитьВладельцаХарактеристик(Номенклатура);					
						Если ЗначениеЗаполнено(Владелец) Тогда
							Отбор.Вставить("Владелец", Владелец);					
						Иначе
							ПараметрыФормы.Вставить("Номенклатура", Номенклатура);					
						КонецЕсли;	
					ИначеЕсли ИмяКолонки = СтруктураХраненияШК.ШК_ИзмерениеУпаковки Тогда
						СправочникУпаковки 		= Метаданные.НайтиПоТипу(ТипЗнч(ТекущееЗначение));
						СправочникНоменклатура 	= Метаданные.НайтиПоТипу(ТипЗнч(Номенклатура));
						Если СправочникУпаковки <> Неопределено
							И СправочникНоменклатура <> Неопределено
							И Метаданные.Справочники.Содержит(СправочникУпаковки)
							И СправочникУпаковки.Владельцы.Содержит(СправочникНоменклатура) Тогда
							Отбор.Вставить("Владелец", Номенклатура);
						КонецЕсли;	
					ИначеЕсли ИмяКолонки = "Упаковка" Тогда
						ПараметрыФормы.Вставить("Номенклатура", Номенклатура);										
					КонецЕсли;	
					//ДополнительныеПараметры = Новый Структура;
					//ДополнительныеПараметры.Вставить("ИмяСправочника", ИмяКолонки);
					//ОповещениеПослеВыбораЗначения = Новый ОписаниеОповещения("ОповещениеПослеВыбораЗначения", ЭтаФорма, ДополнительныеПараметры);
					//ФормаВыбора = ОткрытьФорму(ИмяТаблицыПоСсылке(ТекущееЗначение) + ".ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОповещениеПослеВыбораЗначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
					ФормаВыбора = ПолучитьФорму(ИмяТаблицыПоСсылке(ТекущееЗначение) + ".ФормаВыбора", ПараметрыФормы, ЭтаФорма);
					ВыбранноеЗначение = ФормаВыбора.ОткрытьМодально();
					Если ВыбранноеЗначение <> Неопределено Тогда
						ТекущиеДанные[ИмяКолонки] = ВыбранноеЗначение;
					КонецЕсли;	
				Иначе
					ТекстПредупреждения = НСтр("be = 'Не абрана наменклатура!'; en = 'No item selected!'; es = '¡No se ha seleccionado una nomenclatura!'; ka = 'არ არის არჩეული ნომენკლატურა!'; kk = 'Номенклатура таңдалмады!'; ro = 'Nu a fost selectată nomenclatura!'; ru = 'Не выбрана номенклатура!'; tr = 'Malzeme seçilmedi!'; uk = 'Не обрана номенклатура!'; uz = 'Nomenklatura tanlanmagan!'");
					ПоказатьПредупреждение(, ТекстПредупреждения, 10, ТекстИзменениеДанных()); 
				КонецЕсли;
			Исключение
				Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке())); 
			КонецПопытки;
		КонецЕсли;
		
	КонецПроцедуры
	
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	Объект = ЭтотОбъект;
#КонецЕсли