
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокаПараметров = "Организация, Состояние, ДатаСобытия, Комментарий";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, СтрокаПараметров);
	
	Если Не ЗначениеЗаполнено(Состояние) Тогда
		Состояние = Перечисления.СостояниеДОПП.ПоставкаПроизошла;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаСобытия) Тогда
		ДатаСобытия = ТекущаяДатаСеанса();
	КонецЕсли;
	
	УстановитьВидимость(Элементы.ДатаСобытия, Состояние);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	Если Не ЗначениеЗаполнено(ДатаСобытия)
		И ЗначениеЗаполнено(Состояние) Тогда
	
		ОчиститьСообщения();
		Если Состояние = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПоставкаОтменена") Тогда
			ТекстСообщения = НСтр("ru='Поле ""Дата отмены поставки"" не заполнено'");
		Иначе
			ТекстСообщения = НСтр("ru='Поле ""Дата принятия к учету"" не заполнено'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	НовыеЗначения = Новый Структура();
	НовыеЗначения.Вставить("Организация", Организация);
	НовыеЗначения.Вставить("Комментарий", Комментарий);
	НовыеЗначения.Вставить("ДатаСобытия", ?(ЗначениеЗаполнено(Состояние), ДатаСобытия, Дата(1,1,1)));
	НовыеЗначения.Вставить("Состояние",   Состояние);
	
	Закрыть(НовыеЗначения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриИзмененииСостояния(Элемент)
	
	УстановитьВидимость(Элементы.ДатаСобытия, Состояние);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Элемент, Состояние)
	
	Элемент.Видимость = ЗначениеЗаполнено(Состояние);
	Если Состояние = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПоставкаОтменена") Тогда
		Элемент.Заголовок = НСтр("ru='Дата отмены поставки'");
	ИначеЕсли Состояние = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПоставкаПроизошла") Тогда
		Элемент.Заголовок = НСтр("ru='Дата принятия к учету'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
