#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ApiKey = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ApiKey", "");
	ОтключитьЛог = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ОтключитьЛог", Ложь);
	ОтключитьМетрики = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ОтключитьМетрики", Ложь);
	НаименованиеСправочникаПользователей = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"НаименованиеСправочникаПользователей", "Пользователи");
	НаименованиеСправочникаКонтрагентов = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"НаименованиеСправочникаКонтрагентов", "Контрагенты");
	ПодключаемыйМодульТип = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"ПодключаемыйМодульТип", Перечисления.КонтурЗакупки_ТипыПМ.Отключен);
	ПодключаемыйМодульПуть = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"ПодключаемыйМодульПуть", "");
	СтарыйСправочникОтраслей = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"СтарыйСправочникОтраслей", Ложь);

	ФайлыЗакупокПуть = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ФайлыЗакупокПуть", "");
	ФайлыЗакупокПутьОтКорня = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ФайлыЗакупокПутьОтКорня",
		"[ОрганизаторИНН]" + ПолучитьРазделительПути() + "[НомерЗакупки]");

	ЕстьСправочникДопОбработок = КонтурЗакупки_ЛокализацияСервер.ЕстьСправочник("ДополнительныеОтчетыИОбработки");
	МассивТиповПуть = Новый Массив;
	Если ЕстьСправочникДопОбработок Тогда
		МассивТиповПуть.Добавить(Тип("Строка"));
		МассивТиповПуть.Добавить(Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки"));
	Иначе
		МассивТиповПуть.Добавить(Тип("Строка"));
	КонецЕсли;
	Элементы.ПодключаемыйМодульПуть.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповПуть);

	СинхронизацияНаКлиенте = КонтурЗакупки_ПодсистемаНастройкиВызовСервера.ПолучитьЗначениеНастройки( ,
		"СинхронизацияНаКлиенте", Ложь);
	ТестированиеЦентраУведомлений = КонтурЗакупки_ПодсистемаНастройкиВызовСервера.ПолучитьЗначениеНастройки( ,
		"ТестированиеЦентраУведомлений", Ложь);
	Если КонтурЗакупки_ОбщегоНазначенияВызовСервера.ПроверитьДоступностьКаталогаНаСервере(ФайлыЗакупокПуть) Тогда
		Элементы.КартинкаДоступностьКаталога.Картинка = БиблиотекаКартинок.КонтурЗакупки_Проверено;
	Иначе
		Элементы.КартинкаДоступностьКаталога.Картинка = БиблиотекаКартинок.КонтурЗакупки_Предупреждение;
	КонецЕсли;

	СтакаНДСПродажиПоУмолчанию = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"СтакаНДСПродажиПоУмолчанию", Перечисления.КонтурЗакупки_СтавкиНДС.ПустаяСсылка());
	СтакаНДСПоУмолчанию = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("СтакаНДСПоУмолчанию",
		Перечисления.КонтурЗакупки_СтавкиНДС.ПустаяСсылка());
	ПВХНормативныйДокумент = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ПВХНормативныйДокумент",
		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка());
	ПВХГородОтгрузкиПартнера = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ПВХГородОтгрузкиПартнера",
		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка());

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияЛоготипНажатие(Элемент)
	НачатьЗапускПриложения(Новый ОписаниеОповещения, "https://zakupki.kontur.ru/");
КонецПроцедуры

&НаКлиенте
Процедура ApiKeyОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не Элемент.РежимПароля = Истина Тогда
		Элемент.РежимПароля = Истина;
	Иначе
		Элемент.РежимПароля = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	ЗаписатьНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьДополнительнуюОбработку(Команда)
	СсылкаДопОбработка = ЗарегистрироватьДополнительнуюОбработкуНаСервере();
	Если Не СсылкаДопОбработка.Пустая() Тогда
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("Ключ", СсылкаДопОбработка);
		ОткрытьФорму("Справочник.ДополнительныеОтчетыИОбработки.Форма.ФормаЭлемента", СтруктураПараметры);
		//Иначе
		//	ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка")
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьДоступностьПутиФайлов(Команда)
	ОписаниеРезультата = "";
	Если КонтурЗакупки_ОбщегоНазначенияВызовСервера.ПроверитьДоступностьКаталогаНаСервере(ФайлыЗакупокПуть, Истина,
		ОписаниеРезультата) Тогда
		Элементы.КартинкаДоступностьКаталога.Картинка = БиблиотекаКартинок.КонтурЗакупки_Проверено;
	Иначе
		Элементы.КартинкаДоступностьКаталога.Картинка = БиблиотекаКартинок.КонтурЗакупки_Предупреждение;
		КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеРезультата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВстаавитьИдентификаторЗакупки(Команда)
	ВставитьШаблонВПуть("[ИдентификаторЗакупки]");
КонецПроцедуры

&НаКлиенте
Процедура КомандаВстаавитьОрганизаторИНН(Команда)
	ВставитьШаблонВПуть("[ОрганизаторИНН]");
КонецПроцедуры

&НаКлиенте
Процедура КомандаВстаавитьОрганизаторКПП(Команда)
	ВставитьШаблонВПуть("[ОрганизаторКПП]");
КонецПроцедуры

&НаКлиенте
Процедура КомандаВстаавитьНомерЗакупки(Команда)
	ВставитьШаблонВПуть("[НомерЗакупки]");
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВставитьШаблонВПуть(ТекстШаблона)
	НачСтроки = 0;
	НачКолонки = 0;
	КонСтроки = 0;
	КонКолонки = 0;
	Элементы.ФайлыЗакупокПутьОтКорня.ПолучитьГраницыВыделения(НачСтроки, НачКолонки, КонСтроки, КонКолонки);
	ФайлыЗакупокПутьОтКорня = Сред(Элементы.ФайлыЗакупокПутьОтКорня.ТекстРедактирования, 1, НачКолонки - 1)
		+ ТекстШаблона + Сред(
		Элементы.ФайлыЗакупокПутьОтКорня.ТекстРедактирования, КонКолонки);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()

	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("ApiKey", ApiKey);
	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("ОтключитьЛог", ОтключитьЛог);
	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("ОтключитьМетрики", ОтключитьМетрики);
	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("НаименованиеСправочникаПользователей",
		НаименованиеСправочникаПользователей);
	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("НаименованиеСправочникаКонтрагентов",
		НаименованиеСправочникаКонтрагентов);
	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("ПодключаемыйМодульТип", ПодключаемыйМодульТип);
	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("ПодключаемыйМодульПуть", ПодключаемыйМодульПуть);
	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("СтарыйСправочникОтраслей",
		СтарыйСправочникОтраслей);

	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("ФайлыЗакупокПуть", ФайлыЗакупокПуть);
	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("ФайлыЗакупокПутьОтКорня", ФайлыЗакупокПутьОтКорня);

	КонтурЗакупки_ПодсистемаНастройкиВызовСервера.УстановитьЗначениеНастройки( , "СинхронизацияНаКлиенте",
		СинхронизацияНаКлиенте);
	КонтурЗакупки_ПодсистемаНастройкиВызовСервера.УстановитьЗначениеНастройки( , "ТестированиеЦентраУведомлений",
		ТестированиеЦентраУведомлений);

	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("СтакаНДСПоУмолчанию", СтакаНДСПоУмолчанию);
	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("СтакаНДСПродажиПоУмолчанию",
		СтакаНДСПродажиПоУмолчанию);
	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("ПВХНормативныйДокумент", ПВХНормативныйДокумент);
	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("ПВХГородОтгрузкиПартнера",
		ПВХГородОтгрузкиПартнера);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗарегистрироватьДополнительнуюОбработкуНаСервере()
	Попытка
		ОМДополнительныеОтчетыИОбработки = КонтурЗакупки_ОбщегоНазначения.ОбщийМодуль("ДополнительныеОтчетыИОбработки");
	Исключение
		;
	КонецПопытки;

	Если Не ОМДополнительныеОтчетыИОбработки = Неопределено Тогда
		ИмяМакета = "КонтурЗакупки_РегламентнаяЗагрузкаЗакупок";
		АдресВХранилище = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет(ИмяМакета));

		ПараметрыРегистрации = Новый Структура;
		ПараметрыРегистрации.Вставить("Успех", Ложь);
		ПараметрыРегистрации.Вставить("АдресДанныхОбработки", АдресВХранилище);
		ПараметрыРегистрации.Вставить("ЭтоОтчет", Ложь);
		ПараметрыРегистрации.Вставить("ОтключатьКонфликтующие", Истина);
		ПараметрыРегистрации.Вставить("ИмяФайла", ИмяМакета + ".epf");
		ПараметрыРегистрации.Вставить("ОтключатьПубликацию", Ложь);
		ПараметрыРегистрации.Вставить("Конфликтующие", Новый СписокЗначений);

		СправочникОбъект = НайтиСоздатьОбъектДополнительнойОбработки("Контур.Закупки: Регламентная загрузка закупок");
		СправочникОбъект.Публикация = Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
		СправочникОбъект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка;
		СправочникОбъект.ХранилищеОбработки = Новый ХранилищеЗначения(ПолучитьОбщийМакет(ИмяМакета));

		Результат = ОМДополнительныеОтчетыИОбработки.ЗарегистрироватьОбработку(СправочникОбъект, ПараметрыРегистрации);

		Если Не Результат.Успех И Результат.ИмяОбъектаЗанято Тогда
			ПараметрыРегистрации.Вставить("ОтключатьКонфликтующие", Истина);
			ПараметрыРегистрации.Вставить("Конфликтующие", Результат.Конфликтующие);
			Результат = ОМДополнительныеОтчетыИОбработки.ЗарегистрироватьОбработку(СправочникОбъект,
				ПараметрыРегистрации);
		КонецЕсли;

		Если Не Результат.Успех Тогда
			Если Результат.ИмяОбъектаЗанято Тогда
				Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Имя ""%1"" занято объектами ""%2""'"), ИмяМакета, Строка(Результат.Конфликтующие));
			КонецЕсли;
			ЗаписьЖурналаРегистрации(
		КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьПрефиксПродукта(), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМакеты.Найти(ИмяМакета), , Результат.ТекстОшибки);
		КонецЕсли;

		Если Результат.Успех Тогда
			СправочникОбъект.Записать();
			Возврат СправочникОбъект.Ссылка;
		//ИначеЕсли Результат.Конфликтующие.Количество() > 0 Тогда
		//	Возврат Результат.Конфликтующие[0].Значение;
		Иначе
			Возврат Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиСоздатьОбъектДополнительнойОбработки(НаименованиеОбработки)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|ГДЕ
	|	ДополнительныеОтчетыИОбработки.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", НаименованиеОбработки);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Возврат Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
	КонецЕсли;

КонецФункции
#КонецОбласти