
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.27.70";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f4144f60-c045-4621-811d-3b729a1ee3da");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	Обработчик.Комментарий = НСтр("ru = 'Исправление состояний документов ""Заявка на возврат товаров от клиента""'");
	
	Читаемые = Новый Массив; // Массив Из Строка
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив; // Массив Из Строка
	Изменяемые.Добавить(Метаданные.РегистрыСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
КонецПроцедуры

// Регистрирует документы к обработке для изменения.
//
// Параметры:
//	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяДокумента = "Документ.ЗаявкаНаВозвратТоваровОтКлиента";
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПолноеИмяДокумента;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРегистра.ЗаявкаНаВозвратТоваровОтКлиента КАК Распоряжение
	|ИЗ
	|	РегистрНакопления.УдалитьЗаявкиНаВозвратТоваровОтКлиентов КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.ЗаявкаНаВозвратТоваровОтКлиента НЕ В
	|		(ВЫБРАТЬ
	|			ТаблицаОстатков.ЗаявкаНаВозвратТоваровОтКлиента
	|		ИЗ
	|			РегистрНакопления.УдалитьЗаявкиНаВозвратТоваровОтКлиентов.Остатки() КАК ТаблицаОстатков)
	|	И ТаблицаРегистра.ЗаявкаНаВозвратТоваровОтКлиента НЕ В
	|		(ВЫБРАТЬ
	|			ТаблицаРаспоряжений.Распоряжение
	|		ИЗ
	|			РегистрНакопления.УдалитьРаспоряженияНаОтгрузку.Обороты(,,,
	|				ТИПЗНАЧЕНИЯ(Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)) КАК ТаблицаРаспоряжений)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТаблицаОборотов.Распоряжение КАК Распоряжение
	|ИЗ
	|	РегистрНакопления.РаспоряженияНаОтгрузкуИВозврат.Обороты(,,, Распоряжение В
	|		(ВЫБРАТЬ
	|			Распоряжение
	|		ИЗ
	|			РегистрСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению
	|		ГДЕ
	|			ТИПЗНАЧЕНИЯ(Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента))
	|	И Показатель В (ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КОформлению),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.Оформлено),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КОтгрузке),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.Отгружено),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КОформлениюПоВозвратам),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.ОформленоПоВозвратам),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КПриемке),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.ПринятоПоВозвратам))) КАК ТаблицаОборотов
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОборотов.Распоряжение
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|		КОГДА ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КОтгрузке)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.Отгружено)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) = 0
	|	И СУММА(ВЫБОР
	|		КОГДА ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КОформлению)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.Оформлено)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) = 0
	|	И СУММА(ВЫБОР
	|		КОГДА
	|			ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КОформлениюПоВозвратам)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА
	|			ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.ОформленоПоВозвратам)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) = 0
	|	И СУММА(ВЫБОР
	|		КОГДА ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КПриемке)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА
	|			ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.ПринятоПоВозвратам)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) = 0";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(
		Параметры,
		Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Распоряжение"));
	
КонецПроцедуры

// Обработчик обновления
//
// Параметры:
//	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Для Каждого ТекущиеДанные Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Распоряжение.Установить(ТекущиеДанные.Ссылка);
			НаборЗаписей.Записать();
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ТекущиеДанные.Ссылка);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ТекущиеДанные.Ссылка);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь,
		Метаданные.РегистрыСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению.ПолноеИмя());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
