#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает заголовок надписи оплаты СБП.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма этапов оплаты.
//  Входящая - Булево - признак направления платежной ссылки.
//
Процедура УстановитьНадписьОплатыСБП(Форма, Входящая = Ложь) Экспорт

	//++ Локализация
	Форма.НадписьОплатаСБП = СистемаБыстрыхПлатежейУТ.ТекстНадписиОплатыСБП(Форма.Ключ, Входящая);
	//-- Локализация
	
	Возврат;

КонецПроцедуры

// Устанавливает доступность элементов по форме оплаты.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма этапов оплаты.
//  Входящая - Булево - признак направления платежной ссылки.
//
Процедура УстановитьДоступностьЭлементовПоФормеОплаты(Форма, Входящая = Ложь) Экспорт

	//++ Локализация
	Элементы = Форма.Элементы;
	Элементы.ЛокализацияГруппаПлатежнаяСсылкаСБП.Видимость = 
		ДенежныеСредстваСерверЛокализация.ДоступнаГиперссылкаСБП(Форма.Ключ, Форма.ФормаОплаты, Входящая);
	//-- Локализация
	
	Возврат;

КонецПроцедуры

#КонецОбласти