#Область ОписаниеПеременных

&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _КлиентскиеВызовы;

&НаКлиенте
Перем СписокВыбораВидТары;

&НаКлиенте
Перем СписокВыбораСостояниеГруза;

&НаКлиенте
Перем СписокВыбораСпособУпаковки;

&НаКлиенте
Перем СписокВыбораСостояниеТары;

&НаКлиенте
Перем СписокВыбораСостояниеУпаковки;

&НаКлиенте
Перем СписокВыбораСостояниеКузова;

&НаКлиенте
Перем СписокВыбораТекстИнфИдентиф;

&НаКлиенте
Перем _Платформа;

&НаСервере
Перем _МодульЯдроНаСервере;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовок();
	
	Если Параметры.Свойство("ОбщийКонтекстКлиентСервер") Тогда
		ОбщийКонтекстКлиентСервер = Параметры.ОбщийКонтекстКлиентСервер;
	КонецЕсли;
	
	_ДокументыОснования = ОпределитьДокументыОснованияИОсновной(Параметры);

	Если Параметры.Свойство("СтрокаСписка")
		И Параметры.СтрокаСписка <> Неопределено Тогда
		СтрокаСписка = Параметры.СтрокаСписка;
	КонецЕсли;
	
	Если Параметры.Свойство("Сценарий")
		И Параметры.Сценарий <> Неопределено Тогда
		Сценарий = Параметры.Сценарий;
	Иначе
		Сценарий = Неопределено;
	КонецЕсли; 
	
	МодульОбъекта = ОбработкаОбъект();
	
	
	УстановитьСписокВыбораМетодОпределенияМассы();
	УстановитьСписокВыбораТипСопроводительногоДокумента();
	
	УстановитьОграниченияТипов();
	
	Если _ДокументыОснования.Количество() > 0 Тогда
		ЗаполнитьДокументыОснования(_ДокументыОснования);
		Если Параметры.Свойство("ДанныеПоОснованиюЗЗ") Тогда
			ЗаполнитьДанныеФормы(Параметры.ДанныеПоОснованиюЗЗ);
		Иначе
			ЗаполнитьДанныеФормы(Неопределено);
		КонецЕсли;
	КонецЕсли;
		
	ТекущийСценарий = ТекущийСценарий(Сценарий);

	// поддержка только 1 сценария: Простая отгрузка, экспедитор агент. Отгрузка со своего склада, мы подписываем документы
	// остальные включим после поддержки диадок.апи.
	// {для включения убрать код ниже
	ТекущийСценарий = МодульОбъекта.СценарийПростаяОтгрузкаЭкспедиторАгент();
	// }

	ОбработатьСценарий(ТекущийСценарий, Ложь);

	//заполняется в "ЗаполнитьДанныеФормы"
	//УстановитьСписокВыбораСведенияОДоставкеФактАдресДоставки();
	//УстановитьСписокВыбораСведенияОПогрузкеФактАдресПогрузки();

	УстановитьПараметрыВыбораДоговора(рл_СвЗак_РекИдентЗак, "рл_СвЗак_ДогУслПер"); 
 	УстановитьПараметрыВыбораДоговора(рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГр, "рл_СвПогруз_СвЛицПогрГр_ОснПогрГр");
	
	УстановитьЗаголовокГруппыДатыИВремя();
	УстановитьУсловноеОформлениеНаСервере();
	
	ИдентификаторыГО = МодульОбъекта.ИдентификаторыЭДО(рл_СвГО_РекИдентГО, Истина);
	ИдГО = ИдентификаторыГО.ID;
	ИдентификаторыПВ = МодульОбъекта.ИдентификаторыЭДО(рл_СвПер, Ложь);
	ИдПер = ИдентификаторыПВ.ID;
	ИдентификаторыГП = МодульОбъекта.ИдентификаторыЭДО(рл_СвГП_РекИдентГП, Ложь);
	ИдГП = ИдентификаторыГП.ID; 
	
	РежимПереотправки = Ложь;

	ОпределитьЗапретРедактирования();
	ДоступностьФормы();
		
	ПроверитьЭлектроннуюТранспортнуюНакладную();
	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();
	НомерДатаЗаказЗаявки();
	
	ДопПеременные = Новый Соответствие;
	
	Если ЭтоНовыйДокументТрН() Тогда
		
		Модифицированность = Истина;
		ДействиеМетрики = МодульОбъекта.Метрика_НазваниеДействий().СозданиеЭТРН;
		
	Иначе
		
		ДействиеМетрики = МодульОбъекта.Метрика_НазваниеДействий().ОткрытиеФормыЭТРН;
		ДопПеременные.Вставить(МодульОбъекта.Метрика_КлючОшибки(), Метрики_ПредставлениеОшибокВМассиве());
		
	КонецЕсли;
	
	МодульОбъекта.Метрика_ЗаполнитьВыбранныеДокументыПоТипам(ДопПеременные, _ДокументыОснования);
	ДопПеременные.Вставить(МодульОбъекта.Метрика_КлючИдентификатораПеревозочногоДокумента(), Строка(ИдентификаторТрН));
	
	НаименованиеФормы = Метрика_НаименованиеФормы();
	
	МодульОбъекта.Метрика_ДобавитьСтатистику_ПоКонтексту(ДействиеМетрики, ДопПеременные, , НаименованиеФормы);
	
	Ядро = Модуль_Ядро();
	Ядро.СписокОшибок_Очистить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграниченияТипов()

	МодульОбъекта = ОбработкаОбъект();
	
	МассивТиповКонтрагент = Новый Массив;
	МассивТиповКонтрагент.Добавить(МодульОбъекта.СправочникТипОрганизации());
	МассивТиповКонтрагент.Добавить(МодульОбъекта.СправочникТипКонтрагенты());
	Элементы.рл_СвПер.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);
	Элементы.рл_СвГО_РекИдентГО.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);
	Элементы.рл_СвГП_РекИдентГП.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);
 	Элементы.рл_СвПогруз_ВладИнфр_РекВладИнф.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);

	МассивТиповКонтрагент = Новый Массив;
	МассивТиповКонтрагент.Добавить(МодульОбъекта.СправочникТипКонтрагенты());
	Элементы.рл_СвЗак_РекИдентЗак.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);
	Элементы.рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГр.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);
	Элементы.рл_СопрДокИдРекСост.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);
	Элементы.рл_ИдПолИной.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);
	
	МассивТиповДоговоры = Новый Массив;
	МассивТиповДоговоры.Добавить(МодульОбъекта.СправочникТипДоговорыКонтрагентов());
	Элементы.рл_СвЗак_ДогУслПер.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповДоговоры);
	Элементы.рл_СвПогруз_СвЛицПогрГр_ОснПогрГр.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповДоговоры);
	
	МассивТиповСотрудники = Новый Массив;
	МассивТиповСотрудники.Добавить(МодульОбъекта.СправочникТипФизическиеЛица());
	Элементы.рл_СвПогруз_СвЛицПогрГр_РабЛицПогрГр.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповСотрудники);  
	Элементы.рл_СвВодит1.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповСотрудники);  
	Элементы.рл_СвВодит2.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповСотрудники);  
	Элементы.рл_СвВодит3.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповСотрудники);  
	
	МассивТиповВалюта = Новый Массив;
	МассивТиповВалюта.Добавить(МодульОбъекта.СправочникТипВалюты());
	Элементы.рл_ОпГрузЦеннГруз_Валюта.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповВалюта);

	МассивТиповНоменклатура = Новый Массив;
	МассивТиповНоменклатура.Добавить(МодульОбъекта.СправочникТипНоменклатура());
	Элементы.рл_ОпГрузНоменклатура.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповНоменклатура);

КонецПроцедуры

&НаСервере
Процедура НомерДатаЗаказЗаявки()
	
	МодульОбъекта = ОбработкаОбъект();
	Если рл_НомЗак <> "Без номера" И ЗначениеЗаполнено(рл_ДатаЗак) Тогда
		Элементы.ГруппаНомерДатаЗаказа.Видимость = Истина;
		ПредставлениеЗаказЗаявки = МодульОбъекта.СтрШаблонЛок("по заказ-заявке №%1 от %2", рл_НомЗак, Формат(рл_ДатаЗак, "ДЛФ=D")); 
	Иначе
		Элементы.ГруппаНомерДатаЗаказа.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьКомандФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(СтрокаСписка);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность
		И НЕ РежимПереотправки Тогда
		
		Отказ = Истина;
		Если ЗавершениеРаботы = Истина Тогда
			ТекстПредупреждения = "Настройки были изменены. Все изменения будут потеряны.";
			Возврат;
		КонецЕсли;
		
		Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВопросаОЗакрытии", ЭтаФорма);
		ПоказатьВопрос(Оповещение,"Настройки были изменены, ВЫЙТИ без сохранения?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиСобытийЭлементовФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура рл_СвТС_ТСОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НельзяОткрыть(рл_СвТС_ТС, "рл_СвТС_ТС") Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеРеквизита", рл_СвТС_ТС);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаТранспортногоСредства"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", "рл_СвТС_ТС");
	ДополнительныеПараметры.Вставить("ЗначениеРеквизита", рл_СвТС_ТС);

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаТранспортногоСредства", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаСервере
Процедура рл_РекизитПриИзмененииНаСервере(ЗначениеРеквизита, ИмяРеквизита)
	
	//перезаполняет подчиненные реквизиты.
	Модифицированность = Истина;
	
	МодульОбъекта = ОбработкаОбъект();
	
	ДанныеОбъекта = МодульОбъекта.ДанныеОбъекта(ЗначениеРеквизита, ИмяРеквизита);
	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеОбъекта, ЭтаФорма, ИмяРеквизита + "_");
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвТС_ТСПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура пр_СвТС_ТСНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ИмяСправочникаТранспортныеСредства() <> Неопределено Тогда
		
		Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораТС", ЭтаФорма);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ФормаВыбора = ПолучитьФорму("Справочник." + ИмяСправочникаТранспортныеСредства() + ".ФормаВыбора", ПараметрыФормы, ЭтаФорма);
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = Оповещение;  
		ФормаВыбора.Открыть();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИмяСправочникаТранспортныеСредства()                                     
	
	МодульОбъекта = ОбработкаОбъект();
	Возврат МодульОбъекта.ИмяСправочникаТранспортныеСредства();		
	
КонецФункции

&НаСервере
Функция ИмяСправочникаФизическиеЛица()                                     
	
	МодульОбъекта = ОбработкаОбъект();
	Возврат МодульОбъекта.ИмяСправочникаФизическиеЛица();		
	
КонецФункции

&НаСервере
Процедура Оповещение_ПослеВыбораТС(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		МодульОбъекта = ОбработкаОбъект();
		ДанныеТС = МодульОбъекта.ДанныеТС(РезультатЗакрытия, "ДопСв");
		ЭтаФорма["рл_СвТС_ТС"] = МодульОбъекта.СериализоватьXML(ДанныеТС);
		ЭтаФорма["пр_СвТС_ТС"] = МодульОбъекта.ЗначениеПредставление(ДанныеТС);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура пр_СвВодит1НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Если ИмяСправочникаФизическиеЛица() <> Неопределено Тогда
		
		Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораСведенияОВодителе1", ЭтаФорма);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ФормаВыбора = ПолучитьФорму("Справочник." + ИмяСправочникаФизическиеЛица() + ".Формавыбора", ПараметрыФормы, ЭтаФорма);
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = Оповещение;  
		ФормаВыбора.Открыть();	
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура Оповещение_ПослеВыбораСведенияОВодителе1(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		МодульОбъекта = ОбработкаОбъект();
		ДанныеВодителя = МодульОбъекта.ДанныеВодителя(РезультатЗакрытия, "ДопСв");
		ЭтаФорма["рл_СвВодит1"] = МодульОбъекта.СериализоватьXML(ДанныеВодителя);
		ЭтаФорма["пр_СвВодит1"] = МодульОбъекта.ЗначениеПредставление(ДанныеВодителя);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура пр_СвВодит2НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Если ИмяСправочникаФизическиеЛица() <> Неопределено Тогда
		Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораСведенияОВодителе2", ЭтаФорма);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ФормаВыбора = ПолучитьФорму("Справочник." + ИмяСправочникаФизическиеЛица() + ".Формавыбора", ПараметрыФормы, ЭтаФорма);
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = Оповещение;  
		ФормаВыбора.Открыть();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура Оповещение_ПослеВыбораСведенияОВодителе2(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		МодульОбъекта = ОбработкаОбъект();
		ДанныеВодителя = МодульОбъекта.ДанныеВодителя(РезультатЗакрытия, "ДопСв");
		ЭтаФорма["рл_СвВодит2"] = МодульОбъекта.СериализоватьXML(ДанныеВодителя);
		ЭтаФорма["пр_СвВодит2"] = МодульОбъекта.ЗначениеПредставление(ДанныеВодителя);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура пр_СвВодит3НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ИмяСправочникаФизическиеЛица() <> Неопределено Тогда
		Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораСведенияОВодителе3", ЭтаФорма);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ФормаВыбора = ПолучитьФорму("Справочник." + ИмяСправочникаФизическиеЛица() + ".Формавыбора", ПараметрыФормы, ЭтаФорма);
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = Оповещение;  
		ФормаВыбора.Открыть();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Оповещение_ПослеВыбораСведенияОВодителе3(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		МодульОбъекта = ОбработкаОбъект();
		ДанныеВодителя = МодульОбъекта.ДанныеВодителя(РезультатЗакрытия, "ДопСв");
		ЭтаФорма["рл_СвВодит3"] = МодульОбъекта.СериализоватьXML(ДанныеВодителя);
		ЭтаФорма["пр_СвВодит3"] = МодульОбъекта.ЗначениеПредставление(ДанныеВодителя);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура пр_СвТС_ПрицепНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Если ИмяСправочникаТранспортныеСредства() <> Неопределено Тогда
		
		Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораСвТС_Прицепа", ЭтаФорма);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ФормаВыбора = ПолучитьФорму("Справочник." + ИмяСправочникаТранспортныеСредства() + ".ФормаВыбора", ПараметрыФормы, ЭтаФорма);
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = Оповещение;  
		ФормаВыбора.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Оповещение_ПослеВыбораСвТС_Прицепа(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		МодульОбъекта = ОбработкаОбъект();
		ДанныеТС = МодульОбъекта.ДанныеТС(РезультатЗакрытия, "ДопСв");
		ЭтаФорма["рл_СвТС_Прицеп"] = МодульОбъекта.СериализоватьXML(ДанныеТС);
		ЭтаФорма["пр_СвТС_Прицеп"] = МодульОбъекта.ЗначениеПредставление(ДанныеТС);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СведенияОДоставкеПриИзменении(Элемент)
	
	Адреса = ПолучитьИзВременногоХранилища(ХранениеАдресаДоставки);
	Адрес = рл_СвГП_АдресДостГр_Адрес;
	Для Каждого СтруктураАдреса Из Адреса Цикл
		Если СтруктураАдреса.Адрес = Адрес Тогда
			рл_СвГП_АдресДостГр_АдресРФ = СтруктураАдреса.ЗначениеАдреса;                     
		КонецЕсли;
	КонецЦикла;
	Модифицированность = Истина;
	
КонецПроцедуры 

&НаКлиенте
Процедура рл_СвПогрузПриИзменении(Элемент)

	Адреса = ПолучитьИзВременногоХранилища(ХранениеАдресаПогрузки);
	Адрес = рл_СвПогруз_ФАдресПогр_Адрес;
	Для Каждого СтруктураАдреса Из Адреса Цикл
		Если СтруктураАдреса.Адрес = Адрес Тогда
			рл_СвПогруз_ФАдресПогр_АдресРФ = СтруктураАдреса.ЗначениеАдреса;                     
		КонецЕсли;
	КонецЦикла;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ГрузоотправительПриИзменении(Элемент)

 	УстановитьСписокВыбораСведенияОПогрузкеФактАдресПогрузки();
	
	Если ЗначениеЗаполнено(рл_СвГО_РекИдентГО) 
		И Не ЕстьИдентификаторыЭДО(рл_СвГО_РекИдентГО, Истина) Тогда
		ПредложитьСопоставитьКонтрагента("рл_СвГО_РекИдентГО");
	КонецЕсли;
  	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_ГрузоотправительОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если НельзяОткрыть(рл_СвГО_РекИдентГО, "рл_СвГО_РекИдентГО") Тогда
		Возврат;	
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвГО_РекИдентГО);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаУчастника"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", "рл_СвГО_РекИдентГО");

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаУчастника", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура рл_ПеревозчикПриИзменении(Элемент)

	Если ЗначениеЗаполнено(рл_СвПер) 
		И Не ЕстьИдентификаторыЭДО(рл_СвПер, Ложь) Тогда
		ПредложитьСопоставитьКонтрагента("рл_СвПер");
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ПеревозчикОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НельзяОткрыть(рл_СвПер, "рл_СвПер") Тогда
		Возврат;	
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвПер);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаУчастника"));
	
	ДополнительныеПараметры = Новый Структура;

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаУчастника", ПараметрыФормы, ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ГрузополучательПриИзменении(Элемент)
	
	УстановитьСписокВыбораСведенияОДоставкеФактАдресДоставки();

	Если ЗначениеЗаполнено(рл_СвГП_РекИдентГП) 
		И Не ЕстьИдентификаторыЭДО(рл_СвГП_РекИдентГП, Ложь) Тогда
		ПредложитьСопоставитьКонтрагента("рл_СвГП_РекИдентГП");
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ГрузополучательОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если НельзяОткрыть(рл_СвГП_РекИдентГП, "рл_СвГП_РекИдентГП") Тогда
		Возврат;	
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвГП_РекИдентГП);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаУчастника"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", "рл_СвГП_РекИдентГП");
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаУчастника", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура рл_ИдПолИнойПриИзменении(Элемент)

	Если ЗначениеЗаполнено(рл_ИдПолИной) 
		И Не ЕстьИдентификаторыЭДО(рл_ИдПолИной, Ложь) Тогда
		ПредложитьСопоставитьКонтрагента("рл_ИдПолИной");
	КонецЕсли;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвТС_ПрицепОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если НельзяОткрыть(рл_СвТС_Прицеп, "рл_СвТС_Прицеп") Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеРеквизита", рл_СвТС_Прицеп);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаТранспортногоСредства"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", "рл_СвТС_Прицеп");
	ДополнительныеПараметры.Вставить("ЗначениеРеквизита", рл_СвТС_Прицеп);

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаТранспортногоСредства", ПараметрыФормы, ЭтаФорма, Оповещение);

	
КонецПроцедуры

&НаКлиенте
Процедура рл_ПогрузкаСотрудникПриИзменении(Элемент)

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_ПогрузкаСотрудникОткрытие(Элемент, СтандартнаяОбработка)
     
	СтандартнаяОбработка = Ложь;
	Если НельзяОткрыть(рл_СвПогруз_СвЛицПогрГр_РабЛицПогрГр, "рл_СвПогруз_СвЛицПогрГр_РабЛицПогрГр") Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвПогруз_СвЛицПогрГр_РабЛицПогрГр);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаПогрузкаСотрудник"));
	
	ДополнительныеПараметры = Новый Структура;

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаПогрузкаСотрудник", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура рл_СвВодит1Открытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если НельзяОткрыть(рл_СвВодит1, "рл_СвВодит1") Тогда
		Возврат;	
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеРеквизита", рл_СвВодит1);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаВодителя"));
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", "рл_СвВодит1");
	ДополнительныеПараметры.Вставить("ЗначениеРеквизита", рл_СвВодит1);

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаВодителя", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура рл_СвВодит2Открытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
 	Если НельзяОткрыть(рл_СвВодит2, "рл_СвВодит2") Тогда
		Возврат;	
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеРеквизита", рл_СвВодит2);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаВодителя"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", "рл_СвВодит2");
	ДополнительныеПараметры.Вставить("ЗначениеРеквизита", рл_СвВодит2);

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаВодителя", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура рл_СвВодит3Открытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
 	Если НельзяОткрыть(рл_СвВодит3, "рл_СвВодит3") Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеРеквизита", рл_СвВодит3);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаВодителя"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", "рл_СвВодит3");
	ДополнительныеПараметры.Вставить("ЗначениеРеквизита", рл_СвВодит3);

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаВодителя", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура рл_ЗаказчикПриИзменении(Элемент)
	
	рл_СвЗак_ДогУслПер = Неопределено;
	УстановитьПараметрыВыбораДоговора(рл_СвЗак_РекИдентЗак, "рл_СвЗак_ДогУслПер"); 
 	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_ЗаказчикОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
 	Если НельзяОткрыть(рл_СвЗак_РекИдентЗак, "рл_СвЗак_РекИдентЗак") Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвЗак_РекИдентЗак);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаУчастника"));
	
	ДополнительныеПараметры = Новый Структура;

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаУчастника", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура рл_ГрузоотправительЭтоЭкспедицияПриИзменении(Элемент)

	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();
	ВидимостьЭкспедиции();
 	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_СвЛицПогрГр_СовпГОППриИзменении(Элемент)

	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();
	ВидимостьСовпГОП();
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_ВладИнфр_СовпГОВПриИзменении(Элемент)

	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();
	ВидимостьСовпГОВ();
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГрПриИзменении(Элемент)
	
	рл_СвПогруз_СвЛицПогрГр_ОснПогрГр = Неопределено;
 	УстановитьПараметрыВыбораДоговора(рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГр, "рл_СвПогруз_СвЛицПогрГр_ОснПогрГр"); 

	//при варианте ОтгрузкаСоСкладаПартнера, СобственникСклада = ЛОП       
	Если ТипЗнч(ТекущийСценарий) = Тип("Структура") Тогда
		Если ТекущийСценарий.МестоФактическойПогрузки = "СкладПартнера"
			И Не ЗначениеЗаполнено(рл_СвПогруз_ВладИнфр_РекВладИнф) Тогда
			рл_СвПогруз_ВладИнфр_РекВладИнф = рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГр;
			УстановитьСписокВыбораСведенияОПогрузкеФактАдресПогрузки(Истина);
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГрОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
 	Если НельзяОткрыть(рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГр, "рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГр") Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГр);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаУчастника"));
	
	ДополнительныеПараметры = Новый Структура;

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаУчастника", ПараметрыФормы, ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвЗак_ДогУслПерПриИзменении(Элемент)

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_СвЛицПогрГр_ОснПогрГрПриИзменении(Элемент)

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_ВладИнфр_РекВладИнфПриИзменении(Элемент)

	//при варианте ОтгрузкаСоСкладаПартнера, СобственникСклада = ЛОП       
	Если ТипЗнч(ТекущийСценарий) = Тип("Структура") Тогда
		Если ТекущийСценарий.МестоФактическойПогрузки = "СкладПартнера"
			И Не ЗначениеЗаполнено(рл_СвПогруз_ВладИнфр_РекВладИнф) Тогда
			рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГр = рл_СвПогруз_ВладИнфр_РекВладИнф;
			УстановитьСписокВыбораСведенияОПогрузкеФактАдресПогрузки(Истина);
		КонецЕсли;
	КонецЕсли;

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_ВладИнфр_РекВладИнфОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
 	Если НельзяОткрыть(рл_СвПогруз_ВладИнфр_РекВладИнф, "рл_СвПогруз_ВладИнфр_РекВладИнф") Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвПогруз_ВладИнфр_РекВладИнф);
	ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаУчастника"));
	
	ДополнительныеПараметры = Новый Структура;

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаУчастника", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеЗакрытияФормыРедактирования(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия <> Неопределено Тогда
		Если ДополнительныеПараметры.Свойство("ИмяРеквизита") Тогда
			Если ЭтоРеквизитXML(ДополнительныеПараметры.ИмяРеквизита) И ТипЗнч(РезультатЗакрытия) = Тип("Строка") Тогда
				ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита] = РезультатЗакрытия;
				ЭтаФорма[КлючПредставление(ДополнительныеПараметры.ИмяРеквизита)] = ЗначениеПредставлениеПоСтрокеXML(РезультатЗакрытия);
			ИначеЕсли ДополнительныеПараметры.ИмяРеквизита = "рл_СвГО_РекИдентГО" Тогда	
				УстановитьСписокВыбораСведенияОПогрузкеФактАдресПогрузки();
			ИначеЕсли ДополнительныеПараметры.ИмяРеквизита = "рл_СвГП_РекИдентГП" Тогда	
				УстановитьСписокВыбораСведенияОДоставкеФактАдресДоставки();
			КонецЕсли;
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораСостоянияТары(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		рл_СвПогруз_ФСостТар = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораСостоянияУпаковки(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		рл_СвПогруз_ФСостУп = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораСостоянияКузова(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		рл_СвПогруз_ФСостКуз = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ОтветНаВопросУдаления(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса <> Неопределено Тогда
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			УдалитьНаСервере();
			СтрокаСписка = Истина; // Обновить весь список
			ЭтаФорма.Закрыть(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_ФСостТарНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если СписокВыбораСостояниеТары = Неопределено Тогда
		СписокВыбораСостояниеТары = СписокВыбораСостояниеТары();
	КонецЕсли;
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораСостоянияТары", ЭтаФорма);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораСостояниеТары, Оповещение, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_ФСостТарАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
		
	Если СписокВыбораСостояниеТары = Неопределено Тогда
		СписокВыбораСостояниеТары = СписокВыбораСостояниеТары();
	КонецЕсли; 
	ВыполнитьАвтоПодбор(СписокВыбораСостояниеТары, Текст, Элемент.ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_ФСостУпНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если СписокВыбораСостояниеУпаковки = Неопределено Тогда
		СписокВыбораСостояниеУпаковки = СписокВыбораСостояниеУпаковки();
	КонецЕсли;
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораСостоянияУпаковки", ЭтаФорма);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораСостояниеУпаковки, Оповещение, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_ФСостУпАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СписокВыбораСостояниеУпаковки = Неопределено Тогда
		СписокВыбораСостояниеУпаковки = СписокВыбораСостояниеУпаковки();
	КонецЕсли;
	ВыполнитьАвтоПодбор(СписокВыбораСостояниеУпаковки, Текст, Элемент.ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_ФСостКузНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если СписокВыбораСостояниеКузова = Неопределено Тогда
		СписокВыбораСостояниеКузова = СписокВыбораСостояниеКузова();
	КонецЕсли;
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораСостоянияКузова", ЭтаФорма);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораСостояниеКузова, Оповещение, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвПогруз_ФСостКузАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СписокВыбораСостояниеКузова = Неопределено Тогда
		СписокВыбораСостояниеКузова = СписокВыбораСостояниеКузова();
	КонецЕсли;
	ВыполнитьАвтоПодбор(СписокВыбораСостояниеКузова, Текст, Элемент.ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВопросаОЗакрытии(РезультатВопроса,ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ЭтаФорма.Закрыть();	
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура пр_СвТС_ПрицепОчистка(Элемент, СтандартнаяОбработка)
	рл_СвТС_Прицеп = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура пр_СвТС_ТСОчистка(Элемент, СтандартнаяОбработка)
	рл_СвТС_ТС = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура пр_СвВодит3Очистка(Элемент, СтандартнаяОбработка)
	рл_СвВодит3 = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура пр_СвВодит2Очистка(Элемент, СтандартнаяОбработка)
	рл_СвВодит2 = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура пр_СвВодит1Очистка(Элемент, СтандартнаяОбработка)
	рл_СвВодит1 = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура БаннерБольшеВозможностейТекстГиперссылкаНажатие(Элемент)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().БольшеВозможностейЛогистики;
	Метрика_ПриВыполненииДействия(ДействиеМетрики);
	
	_КлиентскиеВызовы.ОткрытьСтраницуСИнформациейОМодулеЛогистики();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыРлОпГруз

&НаКлиенте
Процедура рл_ОпГрузПередУдалением(Элемент, Отказ)

	//ТекущиеДанные = Элементы.рл_СведенияОГрузе.ТекущиеДанные;
	//Если ТекущиеДанные.ЕстьИсточник = Истина Тогда
	//	Отказ = Истина;
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока = Истина Тогда
		ТекущиеДанные = Элементы.рл_ОпГруз.ТекущиеДанные;
		ТекущиеДанные.КонтейнерыГиперссылка = "<добавить>";
		ТекущиеДанные.ОпасныеГрузыГиперссылка = "<добавить>";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузПлМасГруз_МасБрутЗначПриИзменении(Элемент)
	
	ЗаполнитьСвПогруз_МасБрутОтгр();
	Модифицированность = Истина;
	
КонецПроцедуры 

&НаКлиенте
Процедура рл_ОпГрузКолМестГрПриИзменении(Элемент)

	ЗаполнитьКолМестПрием();
 	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузПриИзменении(Элемент)

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	Если Поле.Имя = "рл_ОпГрузКонтейнерыГиперссылка" Тогда
		
		ТекущиеДанные = Элементы.рл_ОпГруз.ТекущиеДанные;
		ТекущаяСтрока = Элементы.рл_ОпГруз.ТекущаяСтрока;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КонтейнерыXML", ТекущиеДанные.КонтейнерыXML);
		ПараметрыФормы.Вставить("ЗапретРедактирования", ЗапретРедактирования);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИндентификаторСтроки", ТекущаяСтрока);
		
		Если ЗапретРедактирования Тогда
			Оповещение = Неопределено;
		Иначе
			Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеРедактированияКонтейнеров", ЭтаФорма, ДополнительныеПараметры);
		КонецЕсли;
		
		_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаРедактированияКонтейнеров", ПараметрыФормы, ЭтаФорма, Оповещение);

	ИначеЕсли Поле.Имя = "рл_ОпГрузОпасныеГрузыГиперссылка"  Тогда

		ТекущиеДанные = Элементы.рл_ОпГруз.ТекущиеДанные;
		ТекущаяСтрока = Элементы.рл_ОпГруз.ТекущаяСтрока;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОпасныеГрузыXML", ТекущиеДанные.ОпасныеГрузыXML);
		ПараметрыФормы.Вставить("ЗапретРедактирования", ЗапретРедактирования);
		ПараметрыФормы.Вставить("ИмяФормы", "ФормаТрН");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИндентификаторСтроки", ТекущаяСтрока);
		
		Если ЗапретРедактирования Тогда
			Оповещение = Неопределено;
		Иначе
			Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеРедактированияОпасныхГрузов", ЭтаФорма, ДополнительныеПараметры);
		КонецЕсли;
		
		_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаРедактированияОпасныхГрузов", ПараметрыФормы, ЭтаФорма, Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузВидТарПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если СписокВыбораВидТары = Неопределено Тогда
		СписокВыбораВидТары = СписокВыбораВидТары(); 
	КонецЕсли;

	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ДанныеДляВыбора", СписокВыбораВидТары);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИндентификаторСтроки", Элементы.рл_ОпГруз.ТекущаяСтрока);

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораВидаТары", ЭтаФорма, ДополнительныеПараметры);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораВидТары, Оповещение);

	//_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаВыбораЗначений", ПараметрыФормы, ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораВидаТары(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		ТекущиеДанные = рл_ОпГруз.НайтиПоИдентификатору(ДополнительныеПараметры.ИндентификаторСтроки);
		ТекущиеДанные.ВидТар = ЗначениеВыбора.Значение;
		ТекущиеДанные.ВидТарПредставление = ЗначениеВыбора.Представление;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораСпособаУпаковки(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		ТекущиеДанные = рл_ОпГруз.НайтиПоИдентификатору(ДополнительныеПараметры.ИндентификаторСтроки);
		ТекущиеДанные.СпУпак = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеРедактированияКонтейнеров(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		ТекущиеДанные = рл_ОпГруз.НайтиПоИдентификатору(ДополнительныеПараметры.ИндентификаторСтроки);
		ТекущиеДанные.КонтейнерыXML = РезультатЗакрытия;
		Если ТекущиеДанные.КонтейнерыXML = "" Тогда
			ТекущиеДанные.КонтейнерыГиперссылка = "<добавить>";
		Иначе
			ТекущиеДанные.КонтейнерыГиперссылка = "<редактировать>";
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеРедактированияОпасныхГрузов(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		ТекущиеДанные = рл_ОпГруз.НайтиПоИдентификатору(ДополнительныеПараметры.ИндентификаторСтроки);
		ТекущиеДанные.ОпасныеГрузыXML = РезультатЗакрытия;
		Если ТекущиеДанные.ОпасныеГрузыXML = "" Тогда
			ТекущиеДанные.ОпасныеГрузыГиперссылка = "<добавить>";
		Иначе
			ТекущиеДанные.ОпасныеГрузыГиперссылка = "<редактировать>";
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузВидТарПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если СписокВыбораВидТары = Неопределено Тогда
		СписокВыбораВидТары = СписокВыбораВидТары(); 
	КонецЕсли;

	ТекущиеДанные = Элементы.рл_ОпГруз.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(Текст) Тогда
		ТекущиеДанные.ВидТар = "00";
		ТекущиеДанные.ВидТарПредставление = "не указан";
	Иначе
		СтрокаПоиска = СтрокаПоискаФильтра(Текст, Элемент.ТекстРедактирования);
		Если СтрокаПоиска = Неопределено Тогда
			ТекущиеДанные.ВидТар = "00";
			ТекущиеДанные.ВидТарПредставление = "не указан";
		Иначе
			ДанныеВыбора = СписокЗначенийНайти(СтрокаПоиска, СписокВыбораВидТары);
			Если ДанныеВыбора.Количество() > 0 Тогда
				ТекущиеДанные.ВидТарПредставление = ?(ДанныеВыбора[0].Представление = "", ДанныеВыбора[0].Значение, ДанныеВыбора[0].Представление);
				ТекущиеДанные.ВидТар = ДанныеВыбора[0].Значение;
			Иначе
				ТекущиеДанные.ВидТар = "00";
				ТекущиеДанные.ВидТарПредставление = "не указан";
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура рлОпГрузВидТарПредставлениеПриИзменении(Элемент)

	ТекущиеДанные = Элементы.рл_ОпГруз.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидТарПредставление) Тогда
		ТекущиеДанные.ВидТар = "00";
		ТекущиеДанные.ВидТарПредставление = "не указан";
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура рл_ОпГрузВидТарПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если СписокВыбораВидТары = Неопределено Тогда
		СписокВыбораВидТары = СписокВыбораВидТары(); 
	КонецЕсли;
	
	ТекущиеДанные = Элементы.рл_ОпГруз.ТекущиеДанные;
	ЭлементСписка = СписокВыбораВидТары.НайтиПоЗначению(ВыбранноеЗначение);
	Если ЭлементСписка = Неопределено Тогда
		ТекущиеДанные.ВидТар = "00";
		ТекущиеДанные.ВидТарПредставление = "не указан";
	Иначе
		ТекущиеДанные.ВидТарПредставление = ?(ЭлементСписка.Представление = "", ЭлементСписка.Значение, ЭлементСписка.Представление);
		ТекущиеДанные.ВидТар = ЭлементСписка.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузСостГрузНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если СписокВыбораСостояниеГруза = Неопределено Тогда
		СписокВыбораСостояниеГруза = СписокВыбораСостояниеГруза();
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура("ИндентификаторСтроки", Элементы.рл_ОпГруз.ТекущаяСтрока);
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораСостоянияГруза", ЭтаФорма, ДополнительныеПараметры);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораСостояниеГруза, Оповещение, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораСостоянияГруза(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		ТекущиеДанные = рл_ОпГруз.НайтиПоИдентификатору(ДополнительныеПараметры.ИндентификаторСтроки);
		ТекущиеДанные.СостГруз = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузСостГрузАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СписокВыбораСостояниеГруза = Неопределено Тогда
		СписокВыбораСостояниеГруза = СписокВыбораСостояниеГруза();
	КонецЕсли;
	ВыполнитьАвтоПодбор(СписокВыбораСостояниеГруза, Текст, Элемент.ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузСпУпакНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если СписокВыбораСпособУпаковки = Неопределено Тогда
		СписокВыбораСпособУпаковки = СписокВыбораСпособУпаковки();
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура("ИндентификаторСтроки", Элементы.рл_ОпГруз.ТекущаяСтрока);
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораСпособаУпаковки", ЭтаФорма, ДополнительныеПараметры);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораСпособУпаковки, Оповещение, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузСпУпакАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СписокВыбораСпособУпаковки = Неопределено Тогда
		СписокВыбораСпособУпаковки = СписокВыбораСпособУпаковки();
	КонецЕсли;
	ВыполнитьАвтоПодбор(СписокВыбораСпособУпаковки, Текст, Элемент.ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ИнфПолТекстИнф_ИдентифНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если СписокВыбораТекстИнфИдентиф = Неопределено Тогда
		СписокВыбораТекстИнфИдентиф = СписокВыбораТекстИнфИдентиф();
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура("ИндентификаторСтроки", Элементы.рл_ИнфПол.ТекущаяСтрока);
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораТекстИнфИдентиф", ЭтаФорма, ДополнительныеПараметры);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораТекстИнфИдентиф, Оповещение, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораТекстИнфИдентиф(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		ТекущиеДанные = рл_ИнфПол.НайтиПоИдентификатору(ДополнительныеПараметры.ИндентификаторСтроки);
		ТекущиеДанные.ТекстИнф_Идентиф = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОснования

&НаКлиенте
Процедура ДокументыОснованияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = ДокументыОснования.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументОснование) Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ДокументОснование);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОшибки

&НаКлиенте
Процедура ОшибкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда
		
		ТекДанные = Элементы.Ошибки.ТекущиеДанные;
		Если СтрНайтиЛок(ЭтаФорма.ИмяФормы, ТекДанные.ИмяФормы) = 0 Тогда
			
			ОбязательныеРеквизиты = ОбязательныеРеквизитыФормы(ТекДанные.ИмяФормы);
			
			Попытка
				ЗначениеРодителя = ЭтаФорма[ТекДанные.ИмяРеквизитаРодителя];
			Исключение
				ЗначениеРодителя = Неопределено;
			КонецПопытки;
			
			Если ЗначениеРодителя <> Неопределено И ЗначениеЗаполнено(ЗначениеРодителя) Тогда
				
				НазваниеФормы = ТекДанные.ИмяФормы;
				НазваниеРеквизита = ТекДанные.НазваниеРеквизита;
				Если НазваниеФормы = "ФормаДоговора" Тогда      
					//пока так, далее реализуем форму в форме.
					НазваниеФормы = "ФормаТранспортногоСредства";
					НазваниеРеквизита = "пр_ОснАрЛиз";
				КонецЕсли;
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("СсылкаНаОбъект", ЗначениеРодителя); 
				ПараметрыФормы.Вставить("ЗначениеРеквизита", ЗначениеРодителя);
				ПараметрыФормы.Вставить("ИмяТекущегоЭлемента", НазваниеРеквизита);
				ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизиты);
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ИмяРеквизита", ТекДанные.ИмяРеквизитаРодителя);
				ДополнительныеПараметры.Вставить("ЗначениеРеквизита", ЗначениеРодителя);
				
				Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);
				
				_КлиентскиеВызовы.ОткрытьФормуПоИмени(НазваниеФормы, ПараметрыФормы, ЭтаФорма, Оповещение);

			КонецЕсли;
			
		Иначе
			
			НазваниеРеквизита = ТекДанные.НазваниеРеквизита;
			Если НазваниеРеквизита = "рл_СопрДокИдРекСост_ИНН" Тогда      
				НазваниеРеквизита = "рл_СопрДокИдРекСост";
			КонецЕсли;
			Попытка
				ЭтаФорма.ТекущийЭлемент = Элементы[НазваниеРеквизита];
			Исключение
			КонецПопытки;
				
			Если ЗначениеЗаполнено(ТекДанные.ИдентификаторСтроки) Тогда
				Элементы[ТекДанные.ИмяРеквизитаТЧ].ТекущаяСтрока = Число(ТекДанные.ИдентификаторСтроки);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекДанные.НазваниеРеквизита = "рл_СвГО_РекИдентГО"
			Или ТекДанные.НазваниеРеквизита = "рл_СвГП_РекИдентГП"
			Или ТекДанные.НазваниеРеквизита = "рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГр"
			Или ТекДанные.НазваниеРеквизита = "рл_ИдПолИной"
			Или ТекДанные.НазваниеРеквизита = "рл_СвПер" Тогда
			Если СтрНайтиЛок(ТекДанные.Представление, "ЭДО - совпадают идентификаторы") > 0 Тогда
			Иначе
				ПредложитьСопоставитьКонтрагента(ТекДанные.НазваниеРеквизита);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьЧерновик();
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ЗаписатьЭТРН;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить(
		_КлиентскиеВызовы.Метрика_КлючИдентификатораПеревозочногоДокумента(), Строка(ИдентификаторТрН));
		
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючОшибки(), Метрики_ПредставлениеОшибокВМассиве());
	Метрика_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЭлектроннуюТранспортнуюНакладную(Команда)
	
	Результат = ПодготовитьЭлектроннуюТранспортнуюНакладную(Ложь);
	
	Если Результат <> Неопределено Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(Результат);
		ТекстовыйДокумент.Показать("Транспортная накладная");
	КонецЕсли;
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПоказатьЭТРН;
	Метрика_ПриВыполненииДействия(ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСвВодит(Команда)
	
	Если Не Элементы.ГруппаСвВодит2.Видимость Тогда
		Элементы.ГруппаСвВодит2.Видимость = Истина;	
	ИначеЕсли Не Элементы.ГруппаСвВодит3.Видимость Тогда
		Элементы.ГруппаСвВодит3.Видимость = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСвВодит(Команда)

	Если Элементы.ГруппаСвВодит3.Видимость Тогда
		Элементы.ГруппаСвВодит3.Видимость = Ложь;	
		рл_СвВодит3 = Неопределено;
		пр_СвВодит3 = Неопределено;
	ИначеЕсли Элементы.ГруппаСвВодит2.Видимость Тогда
		Элементы.ГруппаСвВодит2.Видимость = Ложь;	
		рл_СвВодит2 = Неопределено;
		пр_СвВодит2 = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВремяПрибытияТекущим(Команда)

	рл_СвПогруз_ФДатВрПриб = ТекущаяДата();

	ПродолжительностьПогрузки = 30;
	Если ТипЗнч(ПродолжительностьПогрузки) = Тип("Число") Тогда
		рл_СвПогруз_ФДатВрУбыт = рл_СвПогруз_ФДатВрПриб + ПродолжительностьПогрузки * 60;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВремяУбытияТекущим(Команда)

	рл_СвПогруз_ФДатВрУбыт = ТекущаяДата();

КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправитьИсходящий(Команда)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПодписатьИОтправить;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Resend", РежимПереотправки);
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючИдентификатораПеревозочногоДокумента(), Строка(ИдентификаторТрН));
	ДополнитьДопПеременныеИдентификаторамиУчастников(ДопПеременные);
	
	Метрика_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);
	
	Если РежимПереотправки Тогда
		ПодписатьИОтправитьПовторноИсходящийДокумент();
	Иначе
		ПодписатьИОтправитьИсходящийДокумент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДопПеременныеИдентификаторамиУчастников(ДопПеременные)
	
	СтруктураУчастников = Новый Структура();
	
	УчастникГО = _КлиентскиеВызовы.Контракт_СтруктураУчастника(рл_СвГО_РекИдентГО, Истина);
	СтруктураУчастников.Вставить("УчастникГО", УчастникГО);
	
	УчастникПер = _КлиентскиеВызовы.Контракт_СтруктураУчастника(рл_СвПер, Ложь);
	СтруктураУчастников.Вставить("УчастникПер", УчастникПер);
	
	УчастникГП = _КлиентскиеВызовы.Контракт_СтруктураУчастника(рл_СвГП_РекИдентГП, Ложь);
	СтруктураУчастников.Вставить("УчастникГП", УчастникГП);
	
	ЗаполнитьИдентификаторыЭДОУчастниковНаСервере(СтруктураУчастников);
	
	УчастникГО = СтруктураУчастников.УчастникГО;
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючBoxIDГО(), УчастникГО.Идентификатор);
	УчастникПер = СтруктураУчастников.УчастникПер;
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючBoxIDПРВ(), УчастникПер.Идентификатор);
	УчастникГП = СтруктураУчастников.УчастникГП;
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючBoxIDГП(), УчастникГП.Идентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИдентификаторыЭДОУчастниковНаСервере(СтруктураУчастников)
	
	МодульОбъекта = ОбработкаОбъект();
	МодульОбъекта.ЗаполнитьИдентификаторыЭДОУчастников(СтруктураУчастников);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборДокументовОснования(Команда)

	ПараметрыФормы = Новый Структура;
	мДокументыОснования = Новый Массив;
	Для Каждого СтрокаОснования Из ДокументыОснования Цикл
		мДокументыОснования.Добавить(СтрокаОснования.ДокументОснование);	
	КонецЦикла;
	ПараметрыФормы.Вставить("ДокументыОснования", мДокументыОснования);
	ПараметрыФормы.Вставить("Период", Новый СтандартныйПериод(рл_ДатаТрН, ТекущаяДата()));
	ПараметрыФормы.Вставить("РежимПодбораИзЭТрН", Истина);
	
	ДополнительныеПараметры = Новый Структура;

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеПодбораДокументовОснования", ЭтаФорма, ДополнительныеПараметры);
  	_КлиентскиеВызовы.ОткрытьФормуПодбораДокументов(ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеПодбораДокументовОснования(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия <> Неопределено 
		И РезультатЗакрытия.ДокументыОснования.Количество() > 0 Тогда
		
		ПерезаполнитьШапку = Ложь;
		
		ДокументыОснования.Очистить();
		Если РезультатЗакрытия.ДокументыОснования.Найти(ОсновнойДокумент) = Неопределено Тогда
			ОсновнойДокумент = РезультатЗакрытия.ДокументыОснования[0];
			ПерезаполнитьШапку = Истина;
		КонецЕсли;
		
		Для Каждого ВыбранныйДокумент Из РезультатЗакрытия.ДокументыОснования Цикл	
			НоваяСтрока = ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование = ВыбранныйДокумент;
			Если НоваяСтрока.ДокументОснование = ОсновнойДокумент Тогда
				НоваяСтрока.ГлавныйДокумент = Истина;	
			КонецЕсли;
		КонецЦикла;
		
		ПерезаполнитьОпГруз = Истина;
		ЗаполнитьДанныеФормы(Неопределено, ПерезаполнитьШапку, ПерезаполнитьОпГруз);
        ПроверитьЭлектроннуюТранспортнуюНакладную();
		Модифицированность = Истина;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДокументОсновным(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.ДокументыОснования.ТекущаяСтрока);

	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ОтветУстановитьДокументОсновным", ЭтаФорма, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Установить документ основным?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ОтветУстановитьДокументОсновным(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> Неопределено Тогда
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Поиск = Новый Структура("ГлавныйДокумент", Истина);
			НашлиСтроки = ДокументыОснования.НайтиСтроки(Поиск);
			Для Каждого НашлиСтроку Из НашлиСтроки Цикл
				НашлиСтроку.ГлавныйДокумент = Ложь;
			КонецЦикла;
			ТекущиеДанные = ДокументыОснования.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
			ТекущиеДанные.ГлавныйДокумент = Истина;
			ОсновнойДокумент = ТекущиеДанные.ДокументОснование;
			ДокументыОснования.Сортировать("ГлавныйДокумент Убыв");
			Модифицированность = Истина;
		КонецЕсли;    
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	//Только если не отправлен!
	
	Если ТипЗнч(СтрокаСписка) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(СтрокаСписка.LetterId) Тогда
			ПоказатьПредупреждение(Неопределено, "Нельзя удалять отправленный документ");
		Иначе
			Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ОтветНаВопросУдаления", ЭтаФорма);
			ПоказатьВопрос(Оповещение, "Вы действительно хотите удалить данные по ЭТрН?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПоУмолчанию(Команда)
	
	ИмяРеквизита = СтрЗаменить(Команда.Имя, "кф_", "рл_");
	Элемент = Элементы.Найти(ИмяРеквизита);
	Если Элемент <> Неопределено Тогда
		                                     
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИмяРеквизита", Сред(Элемент.Имя, 4)); //убрать рл_
		ПараметрыФормы.Вставить("КлючРеквизитов", "трнТитул1");
		Если Элемент.Заголовок = "" Тогда
			//получим заголовок из реквизитов
			ПредставлениеРеквизита = ЗаголовокИзРеквизитов(Элемент.Имя);
		Иначе
			ПредставлениеРеквизита = Элемент.Заголовок;
		КонецЕсли;
		ПараметрыФормы.Вставить("ПредставлениеРеквизита", ПредставлениеРеквизита);
		Если Элемент.Имя = "рл_СвПогруз_ФАдресПогр_Адрес" Тогда
			ПараметрыФормы.Вставить("ИмяРеквизитаДоп", Сред(Элемент.Имя, 4) + "РФ");
			ЗначениеРеквизита = Новый Структура;
			ЗначениеРеквизита.Вставить(Сред(Элемент.Имя, 4), ЭтаФорма[Элемент.Имя]);
			ЗначениеРеквизита.Вставить(Сред(Элемент.Имя, 4) + "РФ", ЭтаФорма[Элемент.Имя + "РФ"]);
			ПараметрыФормы.Вставить("ЗначениеРеквизита", ЗначениеРеквизита);
			ПараметрыФормы.Вставить("ХранениеВозможныхЗначений", ХранениеАдресаПогрузки);
		ИначеЕсли ЭтоРеквизитXML(ИмяРеквизита) Тогда
			ЗначениеРеквизита = ДесериализоватьXML(ЭтаФорма[Элемент.Имя]);
			Если ЗначениеРеквизита.Свойство("Ссылка") И ЗначениеЗаполнено(ЗначениеРеквизита.Ссылка) Тогда
				ПараметрыФормы.Вставить("ЗначениеРеквизита", ЗначениеРеквизита.Ссылка);
			Иначе
				ПараметрыФормы.Вставить("ЗначениеРеквизита", ПустаяСсылкаПоРеквизиту(Элемент.Имя));
			КонецЕсли;
			
		Иначе
			ПараметрыФормы.Вставить("ЗначениеРеквизита", ЭтаФорма[Элемент.Имя]);
		КонецЕсли;
		ПараметрыФормы.Вставить("ОсновнойДокумент", ОсновнойДокумент);
		
		ДополнительныеПараметры = Новый Структура;
		
		Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_УстановитьЗначениеПоУмолчанию", ЭтаФорма, ДополнительныеПараметры);
		
		_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаЗначенийПоУмолчанию", ПараметрыФормы, ЭтаФорма, Оповещение);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗначенийПоУмолчанию(Команда)

	УправлениеНастройкиЗначенийПоУмолчанию();
	ПроверитьНастройкиЗначенийПоУмолчанию();

КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьЭлектроннуюТранспортнуюНакладную(Команда)
	
	ПредставлениеОшибокВМассивеДо = Метрики_ПредставлениеОшибокВМассиве();
	КоличествоОшибокДо = ФорматированиеЧислаСтрокой(ПредставлениеОшибокВМассивеДо.Количество());
	
	ПроверитьЭлектроннуюТранспортнуюНакладную();
	
	ПредставлениеОшибокВМассивеПосле = Метрики_ПредставлениеОшибокВМассиве();
	КоличествоОшибокПосле = ФорматированиеЧислаСтрокой(ПредставлениеОшибокВМассивеПосле.Количество());
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПроверитьНаНаличиеОшибок;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючИдентификатораПеревозочногоДокумента(),
		Строка(ИдентификаторТрН));
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючКоличествоОшибокДо(), КоличествоОшибокДо);
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючКоличествоОшибокПосле(), КоличествоОшибокПосле);
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючОшибкиПосле(), ПредставлениеОшибокВМассивеПосле);
		
	Метрика_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);
	
КонецПроцедуры

&НаКлиенте
Функция ФорматированиеЧислаСтрокой(ВходящееЧисло)
	Возврат Формат(ВходящееЧисло, "ЧН=; ЧГ=");
КонецФункции

&НаКлиенте
Процедура СохранитьДокументНаДиск(Команда)
	
	ДокументОтправлен = ДокументОтправлен();
	Если ДокументОтправлен Тогда
		Пакет = ПодготовитьПакетНаСервере();
		ВОтправленномПакетеЕстьДокумент = Пакет.Документы.Количество() > 0;
	Иначе
		ВОтправленномПакетеЕстьДокумент = Ложь;
	КонецЕсли;
	
	ДокументПакета = Неопределено;
	
	Если ВОтправленномПакетеЕстьДокумент Тогда
		
		ДокументПакета = Пакет.Документы[0];
		
		ИмяФайла = ДокументПакета.Документооборот.ХранилищеКонтента.ИмяФайла;
		ДанныеДокумента = ДокументПакета.Документооборот.ХранилищеКонтента.Данные;
		
	Иначе
		
		ЭПДСтрокой = ПодготовитьЭлектроннуюТранспортнуюНакладную();
		
		ИдФайлСтрокой = СтрПолучитьСтроку(ЭПДСтрокой, 2);
		ИдФайлСтроками = СтрЗаменить(ИдФайлСтрокой, """", Символы.ПС);
		
		ИмяФайла = СтрПолучитьСтроку(ИдФайлСтроками, 2) + ".xml";
		ДанныеДокумента = ЭПДСтрокой;
		
	КонецЕсли;

	ПараметрыКоманды = _Платформа.ПараметрыКомандыСохранитьДокументНаДиск(ИмяФайла, ДанныеДокумента);
	ПараметрыКоманды.КатегорияМетрики = _КлиентскиеВызовы.Метрика_НазваниеКатегории().Перевозочные;
	ПараметрыКоманды.НазваниеФормыДляМетрики = Метрика_НаименованиеФормы();
	ПараметрыКоманды.ПредставлениеМетрики = Метрика_ПредставленияМетрик().ИсходящийПакет;
	ПараметрыКоманды.ДокументДляМетрики = ДокументПакета;
	
	_Платформа.СохранитьДокументНаДиск(ПараметрыКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПечатнуюФорму(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеФормы = Метрика_НаименованиеФормы();
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПолучитьПечатнуюФорму;
	ПредставлениеМетрики = Метрика_ПредставленияМетрик().Исходящийпакет;
	
	_КлиентскиеВызовы.Метрика_ДобавитьПоведение_НажатиеКнопки(НаименованиеФормы, ДействиеМетрики, ПредставлениеМетрики);
	
	Документ = Пакет.Документы[0];
	
	ДокументОтправлен = ДокументОтправлен();
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("BoxID", Документ.Идентификаторы.BoxId);
	ДопПеременные.Вставить("DocumentType", Документ.Тип.ТипДокумента);
	
	Если ДокументОтправлен Тогда
		ДопПеременные.Вставить("LetterId", Документ.Идентификаторы.LetterId);
		ДопПеременные.Вставить("DocumentId", Документ.Идентификаторы.DocumentId);
		ДопПеременные.Вставить("Status", Документ.Статусы.Статус);
	Иначе
		ДопПеременные.Вставить("Status", Перечисление_ЛокальныеСтатусыДокумента().Подготовлен);
	КонецЕсли;
	
	КатегорияМетрики = _КлиентскиеВызовы.Метрика_НазваниеКатегории().Перевозочные;
	
	_Платформа.ПолучитьПечатнуюФормуСервераДиадок(Документ, ДопПеременные, КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДокументооборот(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Пакет.Документы[0];
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("BoxID", Документ.Идентификаторы.BoxId);
	ДопПеременные.Вставить("LetterId", Документ.Идентификаторы.LetterId);
	ДопПеременные.Вставить("DocumentId", Документ.Идентификаторы.DocumentId);
	ДопПеременные.Вставить("Status", Документ.Статусы.Статус);
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().СохранитьДокументооборот;
	Метрика_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);
	
	_Платформа.СохранитьДокументооборот(Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВДиадок(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПерейтиВДиадок;
	Метрика_ПриВыполненииДействия(ДействиеМетрики);
	
	_Платформа.ПерейтиВДиадок(Пакет.Документы[0]);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереотправитьИсходящий(Команда)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().Переотправить;
	Метрика_ПриВыполненииДействия(ДействиеМетрики);
	
	РежимПереотправки = Истина;
	ЗапретРедактирования = Ложь;
	
	СтрокаСписка.Статус = "";
	
	ПодготовитьЭлектроннуюТранспортнуюНакладную();
	НастроитьВидимостьКомандФормы();
	ДоступностьФормы();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТипКонтента_ЭТрН()
	Возврат "kl";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидТитула_ЭТрН()
	Возврат "LogisticsWaybill";
КонецФункции

&НаКлиенте
Процедура НастроитьПараметрыПодписания(Команда)
	
	BoxId = ПолучитьBoxIdНаСервере();
	
	Если ЗначениеЗаполнено(BoxId) Тогда
		
		Модуль_Платформа = Модуль_Платформа();
		ПараметрыОткрытия = Модуль_Платформа.ПараметрыФормыРедактированияПолномочий();
		
		ПараметрыОткрытия.АдресЯщика = BoxId;
		ПараметрыОткрытия.ТипКонтента = ТипКонтента_ЭТрН();
		ПараметрыОткрытия.ПокупательПродавец = "Продавец";
		ПараметрыОткрытия.ВидТитула = ВидТитула_ЭТрН();
		
		Модуль_Платформа.ОткрытьФормуДиадокМодальноЛок(
			"РедактированиеПолномочийУправляемая",
			ЭтаФорма,
			ПараметрыОткрытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)
	
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеОтветаПерезаполнения", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Документ ЭТрН будет перезаполнен. Продолжить?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеОтветаПерезаполнения(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПерезаполнитьШапку = Истина;
		ПерезаполнитьОпГруз = Истина;
		ЗаполнитьДанныеФормы(Неопределено, ПерезаполнитьШапку, ПерезаполнитьОпГруз);
		ПроверитьЭлектроннуюТранспортнуюНакладную();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

#Область ИнфраструктураМодуля

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		Модуль_Ядро = Модуль_Ядро();
		_ОбработкаОбъект.ИнициализироватьМодуль(Модуль_Ядро); 
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция Модуль_Платформа() Экспорт
	Возврат _Платформа;
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Возврат _КлиентскиеВызовы.Модуль_ЯдроНаКлиенте();
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьФорму(ФормаКлиентскиеВызовы, Модуль_Платформа) Экспорт
	
	_КлиентскиеВызовы = ФормаКлиентскиеВызовы;
	_Платформа = Модуль_Платформа;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьДокументыОснованияИОсновной(Параметры)
	
	МодульОбъекта = ОбработкаОбъект();
	
	
	Если Метаданные.Документы.Найти("РеализацияТоваровУслуг") <> Неопределено Тогда
		ОсновнойДокумент = Документы["РеализацияТоваровУслуг"].ПустаяСсылка();
	ИначеЕсли Метаданные.Документы.Найти("РасходнаяНакладная") <> Неопределено Тогда	
		ОсновнойДокумент = Документы["РасходнаяНакладная"].ПустаяСсылка();
	КонецЕсли;
	
	_ДокументыОснования = Новый Массив;
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		
		ОсновнойДокумент = Параметры.ДокументОснование;
		_ДокументыОснования.Добавить(ОсновнойДокумент);
		
	ИначеЕсли Параметры.Свойство("ДокументыОснования")
		И Параметры.ДокументыОснования.Количество() > 0 Тогда
		
		Если ТипЗнч(Параметры.ДокументыОснования[0]) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
			
			ИдентификаторТрН = Параметры.ДокументыОснования[0];
			_ДокументыОснования = МодульОбъекта.ДокументыОснования(МодульОбъекта.КлючИдентификатораТрН(), ИдентификаторТрН);
			ОсновнойДокумент = _ДокументыОснования[0];       
			
		Иначе
			_ДокументыОснования = Параметры.ДокументыОснования;
			ОсновнойДокумент = _ДокументыОснования[0];       
		КонецЕсли;
		
	Иначе
		
		_ДокументыОснования.Добавить(ОсновнойДокумент);

	КонецЕсли;  
	
	Возврат _ДокументыОснования;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовок()
	ЭтаФорма.Заголовок = "Диадок: Транспортная накладная";
КонецПроцедуры

&НаСервере
Процедура ОпределитьЗапретРедактирования()
	
	Если ТипЗнч(СтрокаСписка) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(СтрокаСписка.LetterId) Тогда
			ЗапретРедактирования = Истина;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДоступностьФормы()
	
	Элементы.ГруппаНомерДата.ТолькоПросмотр = ЗапретРедактирования;
	Элементы.ГруппаСтраницы.ТолькоПросмотр = ЗапретРедактирования;
	Элементы.ФормаСохранить.Доступность = Не ЗапретРедактирования; 
	Элементы.ДобавитьСвВодит.Доступность = Не ЗапретРедактирования;
	Элементы.УдалитьСвВодит2.Доступность = Не ЗапретРедактирования;
	Элементы.УдалитьСвВодит3.Доступность = Не ЗапретРедактирования;
	
	Элементы.ДокументыОснованияПодборДокументовОснования.Доступность = Не ЗапретРедактирования;
	Элементы.ДокументыОснованияУстановитьДокументОсновным.Доступность = Не ЗапретРедактирования;
	Элементы.УстановитьДатуВремяПрибытияТекущим.Доступность = Не ЗапретРедактирования;
	Элементы.УстановитьДатуВремяУбытияТекущим.Доступность = Не ЗапретРедактирования;

КонецПроцедуры

&НаСервере
Функция Модуль_Ядро() Экспорт
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		АдресОбработкиЯдра = СвойствоСтруктуры(ОбщийКонтекстКлиентСервер, "АдресОбработкиЯдра");
		
		Если ЗначениеЗаполнено(АдресОбработкиЯдра) Тогда
			_МодульЯдроНаСервере = ХранилищеОбработки_Прочитать(АдресОбработкиЯдра);
		КонецЕсли;
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

// Возвращает объект обработки из временного хранилища
//
// Параметры:
//  АдресОбработки - Строка - адрес обработки во временном хранилище
// 
// Возвращаемое значение:
//  ОбработкаОбъект - если обект обработки все еще загружен в память
//  Неопределено    - если объект обработки уже уничтожен
//
&НаСервереБезКонтекста
Функция ХранилищеОбработки_Прочитать(АдресОбработки)
	
	СтруктураОбработки = ПолучитьИзВременногоХранилища(АдресОбработки);
	
	Результат = СвойствоСтруктуры(СтруктураОбработки, "ОбработкаОбъект");
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
// 
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Имя ключа структуры,
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в структуре нет указанного свойства.
// 
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
&НаСервереБезКонтекста
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем Значение;
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ЭтоСтруктура(Структура) И ЗначениеЗаполнено(Ключ) Тогда
		
		Если Структура.Свойство(Ключ, Значение) Тогда
			Результат = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение структурой или фиксированной структурой.
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить.
// 
// Возвращаемое значение:
//   Булево - Истина, если переданое значение является структрой или фиксированной структурой.
//
&НаСервереБезКонтекста
Функция ЭтоСтруктура(Значение)
	
	Результат = Ложь;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура")
		Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область РаботаСКонтрагентами

&НаКлиенте
Процедура ОсновнойДокументПриИзменении(Элемент)
	
	_ДокументыОснования = Новый Массив;
	_ДокументыОснования.Добавить(ОсновнойДокумент);
	
	ЗаполнитьДокументыОснования(_ДокументыОснования);
	ЗаполнитьДанныеФормы(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьСопоставитьКонтрагента(ИмяРеквизита)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().НеСопоставленУчастник;
	Представление = "Контрагент не сопоставлен";
	_КлиентскиеВызовы.Метрика_ДобавитьСтатистику_ПоКонтексту(ДействиеМетрики, , Представление);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", ИмяРеквизита);
	
	ОписаниеЗакрытияФормы = _Платформа.НовыйОписаниеОповещения("ОбработатьРезультатПредложенияСопоставленияКонтрагента", ЭтаФорма, ДополнительныеПараметры);
	
	ТипУчастникаБезСопоставления = СокрЛП(ТипЗнч(ЭтаФорма[ИмяРеквизита]));
	
	_КлиентскиеВызовы.ОткрытьПредложениеСопоставления(ОписаниеЗакрытияФормы, ТипУчастникаБезСопоставления);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПредложенияСопоставленияКонтрагента(РезультатПредложения, ДополнительныеПараметры) Экспорт
	
	Если РезультатПредложения = КодВозвратаДиалога.Да Тогда
		
		НачатьСопоставление(ДополнительныеПараметры.ИмяРеквизита);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСопоставление(ИмяРеквизита)
	
	ОписаниеЗакрытияФормы = _Платформа.НовыйОписаниеОповещения("ОбработатьРезультатСопоставленияКонтрагента", ЭтаФорма);
	ОтборПоКонтрагенту = ЭтаФорма[ИмяРеквизита];
	
	НужноСопоставлениеСОрганизациейДиадок = НужноСопоставлениеСОрганизациейДиадок(ИмяРеквизита);
	Если НужноСопоставлениеСОрганизациейДиадок Тогда
		
		_КлиентскиеВызовы.НачатьСопоставлениеСОрганизациейДиадок(ОтборПоКонтрагенту, ОписаниеЗакрытияФормы);
		
	Иначе
		
		ОтборПоОрганизации = ЭтаФорма["рл_Организация"];
		
		Если ЗначениеЗаполнено(ОтборПоКонтрагенту) И ЗначениеЗаполнено(ОтборПоОрганизации) Тогда
			_КлиентскиеВызовы.ОткрытьСопоставление(ОтборПоОрганизации, ОтборПоКонтрагенту, ОписаниеЗакрытияФормы);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатСопоставленияКонтрагента(РезультатСопоставления, ДополнительныеПараметры) Экспорт
	
	Если РезультатСопоставления = КодВозвратаДиалога.Да Тогда
		ПроверитьЭлектроннуюТранспортнуюНакладную();			
	Иначе
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьИдентификаторыЭДО(ЗначениеРеквизита, ЭтоОрганизация) 
	
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		МодульОбъекта = ОбработкаОбъект();
		
		ИдентификаторыЭДО = МодульОбъекта.ИдентификаторыЭДО(ЗначениеРеквизита, ЭтоОрганизация);
		ID = ИдентификаторыЭДО.ID;
		Если ЗначениеЗаполнено(ID) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

&НаКлиенте
Функция НужноСопоставлениеСОрганизациейДиадок(ИмяСопоставляемогоРеквизита)
	
	ИмяРеквизита = "рл_СвГО_РекИдентГО";
	
	Возврат ИмяСопоставляемогоРеквизита = ИмяРеквизита;
	
КонецФункции

#КонецОбласти


#Область ДанныеФормыИСохранение

&НаСервере
Процедура СохранитьНаСервере()
	
	Модифицированность = Ложь;
	
	МодульОбъекта = ОбработкаОбъект();
	
	ЗначенияРеквизитовТрН = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма, "ФормаТрН");
	_ДокументыОснования = ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	ПараметрыТрН = МодульОбъекта.ПараметрыТрН(ОсновнойДокумент, _ДокументыОснования, ЗначенияРеквизитовТрН, ТекущийСценарий);
 	МодульОбъекта.СохранитьЗначенияЭПД(МодульОбъекта.КлючИдентификатораТрН(), ИдентификаторТрН, МодульОбъекта.КлючРеквизитовТрН(), ЗначенияРеквизитовТрН, ПараметрыТрН);

КонецПроцедуры

&НаСервере
Процедура СохранитьСтатусНаСервере()
	
	МодульОбъекта = ОбработкаОбъект();

	// ошибки заполняются в процессе сохранения, статус необходимо записать после сохранения и проверок.
	ЕстьОшибки = ?(Ошибки.Количество() = 0, Ложь, Истина);
	Статус = МодульОбъекта.ОпределитьСтатусТрН(ЕстьОшибки);
	МодульОбъекта.СохранитьСтатусТрН(ИдентификаторТрН, Статус);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыОснования(_ДокументыОснования)
	
	МодульОбъекта = ОбработкаОбъект();
	
	мДокументыОснования = Новый Массив;
	
	Для Каждого ДокументОснование Из _ДокументыОснования Цикл
		
		ИдентификаторТрН = МодульОбъекта.ИдентификаторТрН(ДокументОснование, Истина);
		Если ИдентификаторТрН = Неопределено Тогда
			ОснованияПоИдентификаторуТрН = Новый Массив;
		Иначе
			ОснованияПоИдентификаторуТрН = МодульОбъекта.ДокументыОснования(МодульОбъекта.КлючИдентификатораТрН(), ИдентификаторТрН);
		КонецЕсли;
		
		Если ОснованияПоИдентификаторуТрН.Количество() = 0 Тогда
			ОснованияПоИдентификаторуТрН.Добавить(ДокументОснование);
		КонецЕсли;
		
		Для Каждого ОснованиеПоИдентификаторуТрН Из ОснованияПоИдентификаторуТрН Цикл
			Если мДокументыОснования.Найти(ОснованиеПоИдентификаторуТрН) = Неопределено Тогда
				мДокументыОснования.Добавить(ОснованиеПоИдентификаторуТрН);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ДокументыОснования.Очистить();
	Для Каждого ДокументОснование Из мДокументыОснования Цикл
		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ДокументОснование;
		Если ДокументОснование = ОсновнойДокумент Тогда
			НоваяСтрока.ГлавныйДокумент = Истина;	
		КонецЕсли;
	КонецЦикла; 
	ДокументыОснования.Сортировать("ГлавныйДокумент Убыв");
	
	Если ИдентификаторТрН = Неопределено И ДокументыОснования.Количество() > 0  Тогда
		ИдентификаторТрН = МодульОбъекта.ИдентификаторТрН(ДокументыОснования[0].ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы(ДанныеПоОснованиюЗЗ, ПерезаполнитьШапку = Ложь, ПерезаполнитьОпГруз = Ложь)
	
	МодульОбъекта = ОбработкаОбъект();	
	
	мДокументыОснования = ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	
	ДанныеТрН = МодульОбъекта.ДанныеТрН(ИдентификаторТрН, мДокументыОснования, ПерезаполнитьШапку, ПерезаполнитьОпГруз, ДанныеПоОснованиюЗЗ);

	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеТрН, ЭтаФорма); 

	УстановитьСписокВыбораСведенияОДоставкеФактАдресДоставки(ДанныеТрН);
	УстановитьСписокВыбораСведенияОПогрузкеФактАдресПогрузки(ДанныеТрН);
	
	ВидимостьВодителей();
	ВидимостьЭкспедиции();
	ВидимостьСовпГОП();
	ВидимостьСовпГОВ();

КонецПроцедуры

&НаСервере
Функция ЭтоНовыйДокументТрН()

	Если Не ЭтоСтруктура(СтрокаСписка) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Не ЗначениеЗаполнено(СвойствоСтруктуры(СтрокаСписка, "Ключ"));

КонецФункции

&НаСервере
Функция ЗначениеПредставлениеПоСтрокеXML(РезультатЗакрытия)
	
	МодульОбъекта = ОбработкаОбъект();
	Возврат МодульОбъекта.ЗначениеПредставлениеПоСтрокеXML(РезультатЗакрытия);
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыВыбораДоговора(Владелец, РеквизитДоговор)
	
	МодульОбъекта = ОбработкаОбъект();
	ИмяСправочника = МодульОбъекта.ИмяСправочникаДоговорыКонтрагентов();
	Если Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено Тогда
		// проверим наличие владельца
		Если Метаданные.Справочники[ИмяСправочника].Владельцы.Количество() > 0 Тогда
			ПараметрыВыбора = Новый Массив;
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Владелец));
			ЭтаФорма.Элементы[РеквизитДоговор].ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		// проверим наличие контрагента
		ИначеЕсли Метаданные.Справочники[ИмяСправочника].Реквизиты.Найти("Контрагент") <> Неопределено Тогда
			ПараметрыВыбора = Новый Массив;
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", Владелец));
			ЭтаФорма.Элементы[РеквизитДоговор].ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораМетодОпределенияМассы()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("01", "Взвешивание по общей массе (код 01)");
	СписокВыбора.Добавить("02", "Взвешивание поосно (код 02)");
	СписокВыбора.Добавить("03", "Расчетная масса груза (код 03)");
	
	Для Каждого ЭлементСписка Из СписокВыбора Цикл
		Элементы.рл_СвПогруз_МетОпрМасс.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораТипСопроводительногоДокумента()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("ДОПОГ, санитарный, таможенный, карантинный (иные правила) для ТрН");
	СписокВыбора.Добавить("Сертификаты, паспорты качества, удостоверения, разрешения, инструкции, товарораспредительные и другие обязательные документы");
	СписокВыбора.Добавить("Документ, подтверждающий отгрузку товара");
	СписокВыбора.Добавить("Сопроводительная ведомость при перевозке груженных контейнеров в случае погрузки груза в контейнер без участия водителя");
	
	Для Каждого ЭлементСписка Из СписокВыбора Цикл
		Элементы.рл_СопрДокТипСопрДок.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораСведенияОДоставкеФактАдресДоставки(ДанныеТрН = Неопределено)
	
	МодульОбъекта = ОбработкаОбъект();
	
	Адреса = Новый Массив;
	АдресаПоПредставлению = Новый Массив; // для проверки дублей

	Грузополучатель = ЭтаФорма.рл_СвГП_РекИдентГП;
	Если ЗначениеЗаполнено(Грузополучатель) Тогда
		Поиск = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
		КонтактнаяИнформация = МодульОбъекта.ДанныеКонтактнаяИнформацияАдреса(Грузополучатель);
		Для Каждого СтрокаАдреса Из КонтактнаяИнформация Цикл
			Адрес = СтрокаАдреса.Адрес;
			Если АдресаПоПредставлению.Найти(Адрес) = Неопределено Тогда
				ЗначениеАдреса = СтрокаАдреса.АдресРФ;
				ПредставлениеАдреса = СтрокаАдреса.Адрес;
				Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, ЗначениеАдреса, ПредставлениеАдреса));	
				АдресаПоПредставлению.Добавить(Адрес)
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	
	Если ЭтаФорма.ОсновнойДокумент <> Неопределено Тогда
		
		МетаданныеДокумента = ЭтаФорма.ОсновнойДокумент.Метаданные();
		
		Склад = Неопределено;
		Если МодульОбъекта.ЕстьРеквизитМетаданных(МетаданныеДокумента, "СкладПолучатель") Тогда
			Склад = ЭтаФорма.ОсновнойДокумент.СкладПолучатель;
		ИначеЕсли МодульОбъекта.ЕстьРеквизитМетаданных(МетаданныеДокумента, "СтруктурнаяЕдиницаПолучатель") Тогда //оу, это УНФ
			Склад = ЭтаФорма.ОсновнойДокумент.СтруктурнаяЕдиницаПолучатель;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Склад) Тогда
			Поиск = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
			КонтактнаяИнформация = МодульОбъекта.ДанныеКонтактнаяИнформацияАдреса(Склад);
			Для Каждого СтрокаАдреса Из КонтактнаяИнформация Цикл
				Адрес = СтрокаАдреса.Адрес;
				Если АдресаПоПредставлению.Найти(Адрес) = Неопределено Тогда
					ЗначениеАдреса = СтрокаАдреса.АдресРФ;
					ПредставлениеАдреса = СтрокаАдреса.Адрес;
					Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, ЗначениеАдреса, ПредставлениеАдреса));		
					АдресаПоПредставлению.Добавить(Адрес)
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если МодульОбъекта.ЕстьРеквизитМетаданных(МетаданныеДокумента, "АдресДоставкиЗначение") 
			И МодульОбъекта.ЕстьРеквизитМетаданных(МетаданныеДокумента, "АдресДоставки") Тогда
			Адрес = ЭтаФорма.ОсновнойДокумент.АдресДоставки;
			Если АдресаПоПредставлению.Найти(Адрес) = Неопределено Тогда
				ЗначениеАдреса = ЭтаФорма.ОсновнойДокумент.АдресДоставкиЗначение;
				ПредставлениеАдреса = ЭтаФорма.ОсновнойДокумент.АдресДоставки;
				Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, ЗначениеАдреса, ПредставлениеАдреса));		
				АдресаПоПредставлению.Добавить(Адрес)
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
	СписокВыбораФактАдресДоставки = Элементы.рл_СвГП_АдресДостГр_Адрес.СписокВыбора;
	СписокВыбораФактАдресДоставки.Очистить();
	Для Каждого СтруктураАдреса Из Адреса Цикл
		СписокВыбораФактАдресДоставки.Добавить(СтруктураАдреса.Адрес, СтруктураАдреса.ПредставлениеАдреса);
	КонецЦикла;
	
	Если МодульОбъекта.ЕстьИЗаполненоСвойствоСтруктуры(ДанныеТрН, "СвГП.АдресДостГр") Тогда
		Адрес = ДанныеТрН.СвГП.АдресДостГр.Адрес;
		АдресРФ = ДанныеТрН.СвГП.АдресДостГр.АдресРФ; 
		Если ЗначениеЗаполнено(Адрес) Тогда
			Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, АдресРФ, Адрес));
			НайденныйАдрес = СписокВыбораФактАдресДоставки.НайтиПоЗначению(Адрес);
			Если НайденныйАдрес = Неопределено Тогда
				СписокВыбораФактАдресДоставки.Добавить(Адрес, Адрес);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	ХранениеАдресаДоставки = ПоместитьВоВременноеХранилище(Адреса, УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораСведенияОПогрузкеФактАдресПогрузки(ДанныеТрН = Неопределено)
	
	МодульОбъекта = ОбработкаОбъект();

	Адреса = Новый Массив;
	АдресаПоПредставлению = Новый Массив; // для проверки дублей

	Грузоотправитель = ЭтаФорма.рл_СвГО_РекИдентГО;
	Если ЗначениеЗаполнено(Грузоотправитель) Тогда
		Поиск = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
		КонтактнаяИнформация = МодульОбъекта.ДанныеКонтактнаяИнформацияАдреса(Грузоотправитель);
		Для Каждого СтрокаАдреса Из КонтактнаяИнформация Цикл
			Адрес = СтрокаАдреса.Адрес;
			Если АдресаПоПредставлению.Найти(Адрес) = Неопределено Тогда
				ЗначениеАдреса = СтрокаАдреса.АдресРФ;
				ПредставлениеАдреса = СтрокаАдреса.Адрес;
				Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, ЗначениеАдреса, ПредставлениеАдреса));		
				АдресаПоПредставлению.Добавить(Адрес)
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтаФорма.ОсновнойДокумент <> Неопределено Тогда
		
		МетаданныеДокумента = ЭтаФорма.ОсновнойДокумент.Метаданные().ПолноеИмя();
		
		Склад = Неопределено;
		Если МодульОбъекта.ЕстьРеквизитМетаданных(МетаданныеДокумента, "Склад") Тогда
			Склад = ЭтаФорма.ОсновнойДокумент.Склад;                                     
		ИначеЕсли МодульОбъекта.ЕстьРеквизитМетаданных(МетаданныеДокумента, "СкладОтправитель") Тогда
			Склад = ЭтаФорма.ОсновнойДокумент.СкладОтправитель;
		ИначеЕсли МодульОбъекта.ЕстьРеквизитМетаданных(МетаданныеДокумента, "СтруктурнаяЕдиница") Тогда //оу, это УНФ
			Склад = ЭтаФорма.ОсновнойДокумент.СтруктурнаяЕдиница;
		ИначеЕсли МодульОбъекта.ЕстьРеквизитМетаданных(МетаданныеДокумента, "СкладКомпании") Тогда //аааа
			Склад = ЭтаФорма.ОсновнойДокумент.СкладКомпании;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Склад) Тогда
			Поиск = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
			КонтактнаяИнформация = МодульОбъекта.ДанныеКонтактнаяИнформацияАдреса(Склад);
			Для Каждого СтрокаАдреса Из КонтактнаяИнформация Цикл
				Адрес = СтрокаАдреса.Адрес;
				Если АдресаПоПредставлению.Найти(Адрес) = Неопределено Тогда
					ЗначениеАдреса = СтрокаАдреса.АдресРФ;
					ПредставлениеАдреса = СтрокаАдреса.Адрес;
					Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, ЗначениеАдреса, ПредставлениеАдреса));		
					АдресаПоПредставлению.Добавить(Адрес)
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;  
		
	КонецЕсли;
	
	СписокВыбораФактАдресПогрузки = Элементы.рл_СвПогруз_ФАдресПогр_Адрес.СписокВыбора;
	СписокВыбораФактАдресПогрузки.Очистить();
	Для Каждого СтруктураАдреса Из Адреса Цикл
		СписокВыбораФактАдресПогрузки.Добавить(СтруктураАдреса.Адрес, СтруктураАдреса.ПредставлениеАдреса);
	КонецЦикла;
	
	Если МодульОбъекта.ЕстьИЗаполненоСвойствоСтруктуры(ДанныеТрН, "СвПогруз.ФАдресПогр") Тогда
		Адрес = ДанныеТрН.СвПогруз.ФАдресПогр.Адрес;
		АдресРФ = ДанныеТрН.СвПогруз.ФАдресПогр.АдресРФ;
		Если ЗначениеЗаполнено(Адрес) Тогда
			Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, АдресРФ, Адрес));
			НайденныйАдрес = СписокВыбораФактАдресПогрузки.НайтиПоЗначению(Адрес);
			Если НайденныйАдрес = Неопределено Тогда
				СписокВыбораФактАдресПогрузки.Добавить(Адрес, Адрес);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ХранениеАдресаПогрузки = ПоместитьВоВременноеХранилище(Адреса, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьЧерновик()
	
	СохранитьНаСервере();
	ПодготовитьЭлектроннуюТранспортнуюНакладную();
	СохранитьСтатусНаСервере();
	ПодготовитьСтрокуСпискаПоДаннымЧерновика();
	НастроитьВидимостьКомандФормы();
	
КонецПроцедуры

#КонецОбласти


#Область ПроверкаИСтатусы

&НаСервере
Функция ПодготовитьЭлектроннуюТранспортнуюНакладную(УчитыватьОшибки = Истина)
	
	МодульОбъекта = ОбработкаОбъект();
	Формат = "__etrnTitle1";
	ПараметрыТрН = Новый Структура;
	ПараметрыТрН.Вставить("ДанныеСотрудника", Новый Структура);

	мДокументыОснования = МодульОбъекта.ДокументыОснования(МодульОбъекта.КлючИдентификатораТрН(), ИдентификаторТрН);
	Если мДокументыОснования.Найти(ОсновнойДокумент) = Неопределено
		И ЗначениеЗаполнено(ОсновнойДокумент) Тогда
		мДокументыОснования.Добавить(ОсновнойДокумент);
	КонецЕсли;
	СообщениеТрН = МодульОбъекта.ПодготовитьСообщениеТрН(Формат, ИдентификаторТрН, мДокументыОснования, ПараметрыТрН);

	ЕстьОшибки = ОбработатьОшибки(МодульОбъекта, СообщениеТрН);
	Если ЕстьОшибки И УчитыватьОшибки Тогда
		Результат = Неопределено;
	Иначе
		Результат = МодульОбъекта.СобратьXmlПоДокументу(СообщениеТрН, Формат, ПараметрыТрН);
	КонецЕсли;

	ОпределитьСтатусДокумента(ЕстьОшибки);	

	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОпределитьСтатусДокумента(ЕстьОшибки)

	МодульОбъекта = ОбработкаОбъект();

	СтатусЛокальный = МодульОбъекта.ОпределитьСтатусТрН(ЕстьОшибки);
	СтатусДокумента = МодульОбъекта.СтрШаблонЛок("(%1)", СтатусЛокальный);
	
	СтатусыДоОтправки = МодульОбъекта.СтатусыДоОтправки();
	Если ТипЗнч(СтрокаСписка) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(СтрокаСписка.Статус) 
			И СтатусыДоОтправки.Найти(СтрокаСписка.Статус) = Неопределено Тогда
			СтатусДокумента = МодульОбъекта.СтрШаблонЛок("(%1 %2)", СтрокаСписка.Статус, СтрокаСписка.ДополнительныйСтатус);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьЭлектроннуюТранспортнуюНакладную()
	
	МодульОбъекта = ОбработкаОбъект();
	
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма, "ФормаТрН");
	СообщениеТрН = Новый Структура;
	МодульОбъекта.ЗаменитьСсылкиНаСтруктуры(СообщениеТрН, ЗначенияДополнительныхСвойств);

	ЕстьОшибки = ОбработатьОшибки(МодульОбъекта, СообщениеТрН);
	
	ОпределитьСтатусДокумента(ЕстьОшибки);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьОшибки(МодульОбъекта, СообщениеТрН)
	     
	НезаполненныеРеквизиты = Новый Массив;
	ПараметрыВалидации = МодульОбъекта.ВсеПараметрыВалидацииТрН();
	МодульОбъекта.ПроверитьОбязательныеПоля(СообщениеТрН, СообщениеТрН, ПараметрыВалидации, НезаполненныеРеквизиты);
	МодульОбъекта.ПроверитьИдентификаторыЭДО(СообщениеТрН, НезаполненныеРеквизиты, "ФормаТрН");
	
	Ошибки.Очистить();
	Для Каждого ПараметрыПоля Из НезаполненныеРеквизиты Цикл
		
		СтрокаСОшибкой = "";
		ИдентификаторСтроки = "";
		Если ПараметрыПоля.Свойство("НомерСтрокиОшибки") И ПараметрыПоля.НомерСтрокиОшибки > 0 Тогда
			СтрокаСОшибкой = " строка " + ПараметрыПоля.НомерСтрокиОшибки;
			ИдентификаторСтроки = ЭтаФорма[ПараметрыПоля.ИмяРеквизитаТЧ][ПараметрыПоля.НомерСтрокиОшибки-1].ПолучитьИдентификатор();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыПоля.ИмяФормы) Тогда
			НоваяСтрока = Ошибки.Добавить();
			НоваяСтрока.НазваниеРеквизита = ПараметрыПоля.НазваниеРеквизита;
			Если ПараметрыПоля.Свойство("ТекстОшибки") Тогда
				НоваяСтрока.Представление = ПараметрыПоля.ТекстОшибки;
				НоваяСтрока.НекорректноЗаполнено = Истина;
			Иначе
				НоваяСтрока.Представление = "Указать: " + ПараметрыПоля.Представление + СтрокаСОшибкой;
			КонецЕсли;
			НоваяСтрока.Действие = "Указать";
			НоваяСтрока.ИмяФормы = ПараметрыПоля.ИмяФормы;
			НоваяСтрока.ИмяРеквизитаРодителя = ПараметрыПоля.ИмяРеквизитаРодителя;
			НоваяСтрока.ИмяРеквизитаТЧ = ПараметрыПоля.ИмяРеквизитаТЧ;
			НоваяСтрока.ИндексКартинки = Истина;
			НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
			Если МодульОбъекта.СтрНайтиЛок(ЭтаФорма.ИмяФормы, ПараметрыПоля.ИмяФормы) > 0 Тогда
				Попытка
					Элементы[ПараметрыПоля.НазваниеРеквизита].АвтоОтметкаНезаполненного = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ЕстьОшибки = Ошибки.Количество() > 0;
	Если ЕстьОшибки Тогда
		Элементы.ГруппаОшибки.Видимость = Истина;
	Иначе
		Элементы.ГруппаОшибки.Видимость = Ложь;
	КонецЕсли; 
	
	Возврат ЕстьОшибки;
	
КонецФункции

#КонецОбласти


#Область ОформлениеИВидимостьФормы

&НаСервере
Процедура ЗаполнитьКолМестПрием()
	
	рл_СвПогруз_КолМестПрием = рл_ОпГруз.Итог("КолМестГр");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвПогруз_МасБрутОтгр()
	
	рл_СвПогруз_МасБрутОтгр = рл_ОпГруз.Итог("ПлМасГруз_МасБрутЗнач");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокГруппыДатыИВремя()
	
	МодульОбъекта = ОбработкаОбъект();
	
	ЧасовойПоясСервера = ЧасовойПоясСеанса();
	ТекущаяДатаСервера = ТекущаяДатаСеанса();
	УниверсальнаяДата = УниверсальноеВремя(ТекущаяДатаСервера, ЧасовойПоясСервера);
	СмещениеОтUTC = СмещениеСтандартногоВремени(ЧасовойПоясСервера, УниверсальнаяДата);
	
	ЗнакСмещенияUTC = ?(СмещениеОтUTC >= 0, "+", "-");
	СмещениеОтUTCВЧасах = СмещениеОтUTC / 3600;
	СтрокаСмещениеUTC = ЗнакСмещенияUTC + Строка(СмещениеОтUTCВЧасах);
	
	СмещениеОтMSKВЧасах = СмещениеОтUTCВЧасах - 3;
	ЗнакСмещенияMSK = ?(СмещениеОтMSKВЧасах >= 0, "+", "-");
	СтрокаСмещениеMSK = ЗнакСмещенияMSK + Строка(СмещениеОтMSKВЧасах);
	
	Элементы.ГруппаДатыИВремя.Заголовок = МодульОбъекта.СтрШаблонЛок("%1 MSK%2 (UTC%3)", Элементы.ГруппаДатыИВремя.Заголовок, СтрокаСмещениеMSK, СтрокаСмещениеUTC);
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьВодителей()

	Если ЗначениеЗаполнено(рл_СвВодит2) Тогда
		Элементы.ГруппаСвВодит2.Видимость = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(рл_СвВодит3) Тогда
		Элементы.ГруппаСвВодит3.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВидимостьЭкспедиции()
	
	Если рл_СвГО_ГОЭксп = 1 Тогда //это экспедиция
		Элементы.ГруппаЭкспедицияРеквизиты.Видимость = Истина;
	Иначе
		Элементы.ГруппаЭкспедицияРеквизиты.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьСовпГОП()

 	Если рл_СвПогруз_СвЛицПогрГр_СовпГОП = 1 Тогда 
		Элементы.ГруппаНеСовпГОП.Видимость = Ложь;
	Иначе
		Элементы.ГруппаНеСовпГОП.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВидимостьСовпГОВ()

	Если рл_СвПогруз_ВладИнфр_СовпГОВ = 1 Тогда 
		Элементы.ГруппаНеСовпГОВ.Видимость = Ложь;
	Иначе
		Элементы.ГруппаНеСовпГОВ.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНаСервере()
	
	УсловноеОформление.Элементы.Очистить();
	
	//главный документ
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокументыОснования.ГлавныйДокумент");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУсловия.Использование = Истина;
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументыОснованияДокументОснование");
		
КонецПроцедуры

#КонецОбласти


#Область СпискиВыбора

&НаСервере
Функция СписокВыбораВидТары()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияВидТары");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		ПолноеНаименованиеЗначения = СокрЛП(Макет.Область(НомерСтроки, 2).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, ПолноеНаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораСостояниеГруза()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияСостояниеГруза");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораСпособУпаковки()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияСпособУпаковки");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораСостояниеТары()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияСостояниеТары");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораСостояниеУпаковки()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияСостояниеУпаковки");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораСостояниеКузова()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияСостояниеКузова");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораТекстИнфИдентиф()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияТекстИнфИдентиф");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

#КонецОбласти


#Область ПодготовкаПакетаИОтправка

&НаСервере
Функция ОписаниеВидаПакета(ВидПакетаID)
	
	Модуль_Ядро = Модуль_Ядро();
	
	Результат = Модуль_Ядро.Списки_ОписаниеВидаПакета(ВидПакетаID);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Перечисление_ЛокальныеСтатусыДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("Черновик", "Черновик");
	Результат.Вставить("Подготовлен", "Подготовлен");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей()
	
	МодульОбъекта = ОбработкаОбъект();
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма, "ФормаТрН");
	СообщениеТрН = Новый Структура;
	МодульОбъекта.ЗаменитьСсылкиНаСтруктуры(СообщениеТрН, ЗначенияДополнительныхСвойств);
	
	ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Ложь);

	ПараметрыВалидации = МодульОбъекта.ВсеПараметрыВалидацииТрН();
	ОбязательныеРеквизитыПоФормам = МодульОбъекта.РеквизитыОбязательныхПолейПоФормам(СообщениеТрН, СообщениеТрН, ПараметрыВалидации);
	
	ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Истина);

КонецПроцедуры

&НаСервере
Процедура ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Значение)
	
	ОбязательныеРеквизиты = ОбязательныеРеквизитыФормы("ФормаТрН");
	
	Для Каждого ИмяРеквизита Из ОбязательныеРеквизиты Цикл
		Попытка
			Если ЭтоРеквизитXML(ИмяРеквизита) Тогда
				ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "рл", "пр");
			КонецЕсли;
			Элементы[ИмяРеквизита].АвтоОтметкаНезаполненного = Значение;
			Если Не ЗначениеЗаполнено(ЭтаФорма[ИмяРеквизита]) И Значение = Истина Тогда
				Элементы[ИмяРеквизита].ОтметкаНезаполненного = Истина;
			Иначе 
				Элементы[ИмяРеквизита].ОтметкаНезаполненного = Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НельзяОткрыть(ЗначениеРеквизита, ИмяРеквизита)
	
	Если Не ЗначениеЗаполнено(ЗначениеРеквизита)
		И Не ЭтоРеквизитXML(ИмяРеквизита) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ОбязательныеРеквизитыФормы(ИмяФормы)
	
	Результат = Новый Массив;
		
	Если ТипЗнч(ОбязательныеРеквизитыПоФормам) = Тип("Структура")
		И ОбязательныеРеквизитыПоФормам.Свойство(ИмяФормы) Тогда
		Результат = ОбязательныеРеквизитыПоФормам[ИмяФормы];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ПодготовитьПакетНаСервере()
	
	Ядро = Модуль_Ядро();
	Результат = Ядро.Пакеты_ПодготовитьПакет(СтрокаСписка, Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПослеОтправкиПакета(ПакетОтправлен, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ПакетОтправлен Тогда
		
		СтрокаСписка = Истина; // Обновить весь список
		Состояние("ТрН подписан и отправлен");
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УдалитьНаСервере()
	
	Если ЗначениеЗаполнено(ИдентификаторТрН) Тогда
		
		МодульОбъекта = ОбработкаОбъект();
		МодульОбъекта.Удалить(МодульОбъекта.КлючИдентификатораТрН(), ИдентификаторТрН);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправитьИсходящийДокумент()
	
	МожноПодписатьОтправить = Ошибки.Количество() = 0;
	
	Если МожноПодписатьОтправить Тогда
		
		СохранитьЧерновик();
		
		Пакет = ПодготовитьПакетНаСервере();
		ОповещениеПослеОтправкиПакета = _Платформа.НовыйОписаниеОповещения("ПослеОтправкиПакета", ЭтаФорма);
		
		ПараметрыКоманды = _Платформа.ПараметрыКомандыДействияСПакетом(
			Пакет,
			ОповещениеПослеОтправкиПакета
		);
		
		_Платформа.ПодписатьИОтправитьИсходящийПакет(ПараметрыКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправитьПовторноИсходящийДокумент()
	
	ПроверитьЭлектроннуюТранспортнуюНакладную();
	
	МожноПодписатьОтправить = Ошибки.Количество() = 0;
	
	Если МожноПодписатьОтправить Тогда
		
		СохранитьЧерновик();
		
		Пакет = ПодготовитьПереотправляемыйПакетНаСервере();
		ОповещениеПослеОтправкиПакета = _Платформа.НовыйОписаниеОповещения("ПослеОтправкиПакета", ЭтаФорма);
		
		ПараметрыКоманды = _Платформа.ПараметрыКомандыДействияСПакетом(
			Пакет,
			ОповещениеПослеОтправкиПакета
		);
		
		_Платформа.ПодписатьИОтправитьИсходящийПакет(ПараметрыКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПереотправляемыйПакетНаСервере()
	
	ПереотправляемыйПакет = Новый Структура;
	ПереотправляемыйПакет.Вставить("BoxId", СтрокаСписка.BoxId);
	ПереотправляемыйПакет.Вставить("LetterId", СтрокаСписка.LetterId);
	ПереотправляемыйПакет.Вставить("ПакетЭДО", СтрокаСписка.Пакет);
	
	ПодготовитьСтрокуСпискаПоДаннымЧерновика();
	
	СтрокаСписка.Пакет = Неопределено;
	СтрокаСписка.LetterId = "";
	
	Результат = ПодготовитьПакетНаСервере();
	
	ПараметрыПереотправки = Новый Структура;
	ПараметрыПереотправки.Вставить("ПереотправляемыйПакет", ПереотправляемыйПакет);
	ПараметрыПереотправки.Вставить("ВыполнитьУдалениеНеактуальныхДокументовПакета", Ложь);
	
	Результат.СлужебнаяИнформация.Вставить("ПараметрыПереотправки", ПараметрыПереотправки);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьBoxIdНаСервере()
	
	BoxId = "";
	
	МодульОбъекта = ОбработкаОбъект();
	ИдентификаторыГО = МодульОбъекта.ИдентификаторыЭДО(рл_СвГО_РекИдентГО, Истина);
	BoxId = ИдентификаторыГО.BoxId;
	
	Возврат BoxId;

КонецФункции

#КонецОбласти


#Область НастройкиЗначенийПоУмолчанию

&НаСервере
Функция ПустаяСсылкаПоРеквизиту(ИмяРеквизита)
	
	МодульОбъекта = ОбработкаОбъект();
	Результат = Неопределено;
	Если ИмяРеквизита = "рл_СвТС_ТС" Или ИмяРеквизита = "рл_СвТС_Прицеп" Тогда
		Если МодульОбъекта.ИмяСправочникаТранспортныеСредства() <> Неопределено Тогда
			Результат = Справочники[МодульОбъекта.ИмяСправочникаТранспортныеСредства()].ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ИмяРеквизита = "рл_СвВодит1" Или ИмяРеквизита = "рл_СвВодит2" Или ИмяРеквизита = "рл_СвВодит3" Тогда
		Если МодульОбъекта.ИмяСправочникаФизическиеЛица() <> Неопределено Тогда
			Результат = Справочники[МодульОбъекта.ИмяСправочникаФизическиеЛица()].ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
			
	Возврат Результат;
			
КонецФункции

&НаСервере
Функция ЗаголовокИзРеквизитов(ПутьКДанным)
	
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	Для Каждого СтрокаРеквизит Из РеквизитыФормы Цикл
		Если СтрокаРеквизит.Имя = ПутьКДанным Тогда
			Возврат СтрокаРеквизит.Заголовок;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура Оповещение_УстановитьЗначениеПоУмолчанию(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	ПроверитьНастройкиЗначенийПоУмолчанию();

КонецПроцедуры

&НаКлиенте
Процедура УправлениеНастройкиЗначенийПоУмолчанию()
	
	Для Каждого Элемент Из ЭтаФорма.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы") 
			И Лев(Элемент.Имя, 3) = "кф_" Тогда
			Элемент.Видимость = Не Элемент.Видимость;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНастройкиЗначенийПоУмолчанию()

	ОбработкаОбъект = ОбработкаОбъект();
	Для Каждого Элемент Из ЭтаФорма.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы") 
			И Лев(Элемент.Имя, 3) = "кф_" Тогда
			ИмяРеквизита = Сред(Элемент.Имя, 4);
			Результат = Новый Структура;
			Результат.Вставить("ЗначениеРеквизита", Неопределено);
			Результат.Вставить("ИмяРеквизита", ИмяРеквизита);
			
			МетаданныеДокумента = ОсновнойДокумент.Метаданные().ПолноеИмя();
			ИдентификаторНастройки = МетаданныеДокумента + "_" + ОбработкаОбъект.КлючРеквизитовТрН() + "_" + ИмяРеквизита;
			
			Настройки = ОбработкаОбъект.ВосстановитьНастройки(ИдентификаторНастройки).Настройки;
			Если ЗначениеЗаполнено(Настройки)
				И Настройки.Количество() > 0 Тогда
				Элемент.ЦветФона = WebЦвета.Золотой;
			Иначе
				Элемент.ЦветФона = Новый Цвет();
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область УниверсальныеВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьНачалоВыбораИзСписка(СписокВыбора, Оповещение, ОтображатьПредставление = Истина)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеДляВыбора", СписокВыбора);
	ПараметрыФормы.Вставить("ОтображатьПредставление", ОтображатьПредставление);
	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаВыбораЗначений", ПараметрыФормы, ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвтоПодбор(СписокВыбора, Текст, ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаПоиска = СтрокаПоискаФильтра(Текст, ТекстРедактирования);
	Если СтрокаПоиска = Неопределено Тогда
		ДанныеВыбора = СписокВыбора;//Новый СписокЗначений;
		СтандартнаяОбработка = Ложь;
	Иначе
		ДанныеВыбора = СписокЗначенийНайти(СтрокаПоиска, СписокВыбора); 
		Если ДанныеВыбора.Количество() = 0 Тогда
			СтандартнаяОбработка = Истина;
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СписокЗначенийНайти(СтрокаПоиска, СписокЗначений, РеквизитПоиска = "Представление") Экспорт

	Результат = Новый СписокЗначений;
	Для Каждого Элемент Из СписокЗначений Цикл
		Если Найти(ВРег(Элемент[РеквизитПоиска]), ВРег(СтрокаПоиска)) > 0 Тогда
			Результат.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаКлиенте
Функция СтрокаПоискаФильтра(Текст, ТекстРедактирования) Экспорт

	МинимальноеКоличествоСимволов = 2;
	Если СтрДлина(СокрЛП(Текст)) >= МинимальноеКоличествоСимволов Тогда
		СтрокаПоиска = СокрЛП(Текст);
	ИначеЕсли СтрДлина(СокрЛП(ТекстРедактирования)) >= МинимальноеКоличествоСимволов Тогда
		СтрокаПоиска = СокрЛП(ТекстРедактирования);
	Иначе
		СтрокаПоиска = Неопределено;
	КонецЕсли;

	Возврат СтрокаПоиска;

КонецФункции

&НаКлиенте
Функция СтрНайтиЛок(Строка, ПодстрокаПоиска)
	
	// BSLLS:DeprecatedFind-off
	Результат = Найти(Строка, ПодстрокаПоиска);
	// BSLLS:DeprecatedFind-on
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область XMLВспомогательныеФункции

&НаСервереБезКонтекста
Функция ДесериализоватьXML(СтрокаXML)
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.УстановитьСтроку(СтрокаXML);
		Значение = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Исключение
		Значение = Новый Структура;
	КонецПопытки;
	
	Возврат Значение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитыXML()
	
	Результат = Новый Массив;
	Результат.Добавить("рл_СвТС_Прицеп");
	Результат.Добавить("рл_СвТС_ТС");
	Результат.Добавить("рл_СвВодит1");
	Результат.Добавить("рл_СвВодит2");
	Результат.Добавить("рл_СвВодит3");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРеквизитXML(ИмяРеквизита)
	
	РеквизитыXML = РеквизитыXML();
	Если РеквизитыXML.Найти(ИмяРеквизита) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция КлючПредставление(Ключ)
	
	Результат = СтрЗаменить(Ключ, "рл_", "пр_");
	Возврат Результат;

КонецФункции

#КонецОбласти

&НаСервере
Процедура ПодготовитьСтрокуСпискаПоДаннымЧерновика()
	
	МодульОбъекта = ОбработкаОбъект();
	
	ЕстьОшибки = Ошибки.Количество() > 0;
	СтатусТрН = МодульОбъекта.ОпределитьСтатусТрН(ЕстьОшибки);
	СтатусПодготовлен = Перечисление_ЛокальныеСтатусыДокумента().Подготовлен;
	
	//Если СтатусТрН <> СтатусПодготовлен Тогда
	//	Возврат;
	//КонецЕсли;
	
	КлючИдентификатораТрН = МодульОбъекта.КлючИдентификатораТрН();
	
	ПараметрыПолученияЧерновиковЭТрН = Новый Структура;
	ПараметрыПолученияЧерновиковЭТрН.Вставить(КлючИдентификатораТрН, ИдентификаторТрН);
	ПараметрыПолученияЧерновиковЭТрН.Вставить("НачалоПериода", НачалоДня(рл_ДатаТрН));
	ПараметрыПолученияЧерновиковЭТрН.Вставить("КонецПериода", КонецДня(рл_ДатаТрН));
	
	ДанныеЧерновиковЭТрН = МодульОбъекта.ДанныеДляОтправкиТитуловЭТрН(ПараметрыПолученияЧерновиковЭТрН);
	
	Если ДанныеЧерновиковЭТрН[ОсновнойДокумент] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЧерновика = ДанныеЧерновиковЭТрН[ОсновнойДокумент];
		
	ВидПакетаID = МодульОбъекта.ИдентификаторПакетаЭТрН();
	ВидПакета = ОписаниеВидаПакета(ВидПакетаID);
	
	ЗаполнитьЗначенияСвойств(СтрокаСписка, ДанныеЧерновика);
	
	СтрокаСписка.Ключ = Строка(ДанныеЧерновика.ИдентификаторДокумента);
	СтрокаСписка.Направление = "Исходящее";
	СтрокаСписка.ВидПакета = ВидПакета.Наименование;
	СтрокаСписка.СодержимоеПакета = ВидПакета.Наименование;
	СтрокаСписка.Организация = ДанныеЧерновика.Грузоотправитель;
	СтрокаСписка.Контрагент = ДанныеЧерновика.Перевозчик;
	СтрокаСписка.ПромежуточныйПолучатель = ДанныеЧерновика.Грузополучатель;
	
	СлужебнаяИнформацияСтроки = СвойствоСтруктуры(СтрокаСписка, "СлужебнаяИнформация", Новый Структура);
	СлужебнаяИнформацияСтроки.Вставить(МодульОбъекта.КлючИдентификаторПеревозочногоДокумента(), Строка(ИдентификаторТрН));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьКомандФормы()
	
	СтатусПодготовлен = Перечисление_ЛокальныеСтатусыДокумента().Подготовлен;
	СтатусДокументаПодготовлен = Найти(СтатусДокумента, СтатусПодготовлен) > 0;
	ДокументБезОшибок = Ошибки.Количество() = 0;
	
	Если РежимПереотправки Тогда
		ЭтоНовыйДокумент = Истина;
		ДокументОтправлен = Ложь;
	Иначе
		ЭтоНовыйДокумент = ЭтоНовыйДокументТрН();
		ДокументОтправлен = ДокументОтправлен();
	КонецЕсли;
	
	ДоступныеДействияПодписатьИОтправить = Ложь;
	ДоступныеДействияНастроитьПараметрыПодписания = Ложь;
	
	Если Не ЭтоНовыйДокумент И ДокументБезОшибок Тогда
		
		Пакет = ПодготовитьПакетНаСервере();
		Документ = Пакет.Документы[0];
		
		Ядро = Модуль_ЯдроНаКлиенте();
		ДоступныеДействия = Ядро.Документы_ДоступныеДействия(Документ);
		
		ДоступныеДействияПодписатьИОтправить = ДоступныеДействия.ПодписатьИОтправить;
		ДоступныеДействияНастроитьПараметрыПодписания = ДоступныеДействия.НастроитьПараметрыПодписания;
		
		Элементы.ПередатьНаСогласование.Видимость = ДоступныеДействия.ПередатьНаСогласование;
		Элементы.ПередатьНаПодпись.Видимость = ДоступныеДействия.ПередатьНаПодпись;
		Элементы.ПередатьПоМаршруту.Видимость = ДоступныеДействия.ПередатьПоМаршруту;
		Элементы.Согласовать.Видимость = ДоступныеДействия.Согласование;
		Элементы.ОтказатьВСогласовании.Видимость = ДоступныеДействия.ОтказВСогласовании;
		Элементы.КнопкаОтказатьВЗапросеПодписи.Видимость = ДоступныеДействия.ОтказВЗапросеПодписи;
		
		Элементы.ГруппаСогласованиеПередать.Видимость = ДоступныеДействия.ПередатьНаСогласование
			Или ДоступныеДействия.ПередатьНаПодпись
			Или ДоступныеДействия.ПередатьПоМаршруту;
		Элементы.ГруппаСогласованиеВердикт.Видимость = ДоступныеДействия.Согласование
			Или ДоступныеДействия.ОтказВСогласовании;
		Элементы.ГруппаСогласование.Видимость = Элементы.ГруппаСогласованиеПередать.Видимость
			Или Элементы.ГруппаСогласованиеВердикт.Видимость;
			
	Иначе
			
		Элементы.ПередатьНаСогласование.Видимость = Ложь;
		Элементы.ПередатьНаПодпись.Видимость = Ложь;
		Элементы.ПередатьПоМаршруту.Видимость = Ложь;
		Элементы.Согласовать.Видимость = Ложь;
		Элементы.ОтказатьВСогласовании.Видимость = Ложь;
		Элементы.КнопкаОтказатьВЗапросеПодписи.Видимость = Ложь;
		
		Элементы.ГруппаСогласованиеПередать.Видимость = Ложь;
		Элементы.ГруппаСогласованиеВердикт.Видимость = Ложь;
		Элементы.ГруппаСогласование.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.ПодписатьИОтправитьИсходящий.Видимость = ДоступныеДействияПодписатьИОтправить Или РежимПереотправки;
	Элементы.НастроитьПараметрыПодписания.Видимость = ДоступныеДействияНастроитьПараметрыПодписания;
	Элементы.СохранитьДокументНаДиск.Видимость = ДокументОтправлен Или ДокументБезОшибок;
	Элементы.ПолучитьПечатнуюФорму.Видимость = ДокументОтправлен Или СтатусДокументаПодготовлен;
	Элементы.СохранитьДокументооборот.Видимость = ДокументОтправлен;
	Элементы.ПерейтиВДиадок.Видимость = ДокументОтправлен;
	Элементы.ПереотправитьИсходящий.Видимость = ДокументОтправлен;
	Элементы.ФормаСохранить.Видимость = Не ДокументОтправлен И Не РежимПереотправки;
	Элементы.Перезаполнить.Видимость = Не ДокументОтправлен;
	Элементы.ПоказатьСодержимоеДокументаXML.Видимость = Не ДокументОтправлен;
	
	Элементы.ПередатьВПодразделение.Видимость = ДокументОтправлен;
	
	Элементы.СтраницаИсторияПоДокументу.Видимость = ДокументОтправлен;
	Если ДокументОтправлен Тогда
		УстановитьВидимостьКартинкаОшибкиИсторияПоДокументу();
	КонецЕсли;
	
	УстановитьДоступностьФункцийТарифа();
	
КонецПроцедуры

&НаКлиенте
Функция ДокументОтправлен()
	
	Если ТипЗнч(СтрокаСписка) = Тип("Структура")
		И ЗначениеЗаполнено(СтрокаСписка.LetterId) Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура рл_СопрДокПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_ИнфПолПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвПогруз_ЗаявПогрВрПриИзменении(Элемент)
	
	Если НачалоДня(рл_СвПогруз_ЗаявПогр) = '00010101000000' Тогда
		рл_СвПогруз_ЗаявПогр = НачалоДня(ТекущаяДата()) + Час(рл_СвПогруз_ЗаявПогр)*60*60 + Минута(рл_СвПогруз_ЗаявПогр)*60;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СвПогруз_ФДатВрПрибВрПриИзменении(Элемент)

	Если НачалоДня(рл_СвПогруз_ФДатВрПриб) = '00010101000000' Тогда
		рл_СвПогруз_ФДатВрПриб = НачалоДня(ТекущаяДата()) + Час(рл_СвПогруз_ФДатВрПриб)*60*60 + Минута(рл_СвПогруз_ФДатВрПриб)*60;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СвПогруз_ФДатВрУбытВрПриИзменении(Элемент)

	Если НачалоДня(рл_СвПогруз_ФДатВрУбыт) = '00010101000000' Тогда
		рл_СвПогруз_ФДатВрУбыт = НачалоДня(ТекущаяДата()) + Час(рл_СвПогруз_ФДатВрУбыт)*60*60 + Минута(рл_СвПогруз_ФДатВрУбыт)*60;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Метрика_ПриВыполненииДействия(ДействиеМетрики, Доппеременные = Неопределено)
	
	НаименованиеФормы = Метрика_НаименованиеФормы();
	
	ДокументОтправлен = ДокументОтправлен();
	Если РежимПереотправки Тогда
		ДокументОтправлен = Ложь;
	КонецЕсли;
	
	Если ДокументОтправлен Тогда
		ПредставлениеМетрики = Метрика_ПредставленияМетрик().Исходящийпакет;
	Иначе
		ПредставлениеМетрики = Метрика_ПредставленияМетрик().ПакетНаОтправку;
	КонецЕсли;
	
	_КлиентскиеВызовы.Метрика_ДобавитьПоведение_НажатиеКнопки(НаименованиеФормы, ДействиеМетрики, ПредставлениеМетрики);
	_КлиентскиеВызовы.Метрика_ДобавитьСтатистику_ПоКонтексту(ДействиеМетрики, ДопПеременные);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_НаименованиеФормы()
	Возврат "Транспортная накладная";
КонецФункции

&НаКлиенте
Функция Метрика_ПредставленияМетрик()
	
	Результат = Новый Структура;
	Результат.Вставить("ПакетНаОтправку", "Пакет на отправку ЭТрН");
	Результат.Вставить("Исходящийпакет", "Исходящий пакет ЭТрН");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Метрики_ПредставлениеОшибокВМассиве()
	
	Результат = Новый Массив;
	
	ТаблицаОшибок = Ошибки.Выгрузить(, "Представление");
	Результат = ТаблицаОшибок.ВыгрузитьКолонку("Представление");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Элементы.СтраницаИсторияПоДокументу Тогда
		
		ЗаполнитьИсториюПоДокументу();
		
	КонецЕсли;
	
КонецПроцедуры

#Область ИсторияПоДокументу

&НаКлиенте
Процедура ЗаполнитьИсториюПоДокументу()
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Пакет.Документы[0];
	
	ИсторияДокументаHTML = "";
	
	Если ЗначениеЗаполнено(Документ.Идентификаторы.DocumentId) Тогда
		ЗаполнитьИсториюПоДокументуВызовСервера(Документ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсториюПоДокументуВызовСервера(Документ)
	
	Ядро = Модуль_Ядро();
	ВнешниеСтатусы = Документ.Статусы.ВнешниеСтатусы;
	ИдентификаторПеревозочного_kl_id = СвойствоСтруктуры(ВнешниеСтатусы, "kl_id");
	
	ИсторияДО = Ядро.Документы_ИсторияДО(Документ.Идентификаторы, ИдентификаторПеревозочного_kl_id);
	// BSLLS:UnusedLocalVariable-off
	ИсторияДокументаHTML = Ядро.HTMLИсторияДокументооборота(ИсторияДО);
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияДокументаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	АдресСсылки = Неопределено;
	ДопПараметры = Неопределено;
	
	ДанныеСобытия.Свойство("href", АдресСсылки);
	
	Если ЗначениеЗаполнено(АдресСсылки) Тогда
		// BSLLS:UnusedLocalVariables-off
		СтандартнаяОбработка = Ложь;
		// BSLLS:UnusedLocalVariables-on
		_Платформа.ОповеститьИлиПерейтиПоСсылке(АдресСсылки, ДопПараметры, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуЭлектроннаяПодписьИДоверенности(
		АдресВременногоХранилища = Неопределено,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	Пакет = ПодготовитьПакетНаСервере();
	Документ = Пакет.Документы[0];
	ПредставлениеТекущегоДокумента = Документ.ИмяФайла;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "ФормаЭлектроннаяПодписьИДоверенности");
	ПараметрыОткрытияФормы.Вставить("АдресВременногоХранилища", АдресВременногоХранилища);
	ПараметрыОткрытияФормы.Вставить("ПредставлениеТекущегоДокумента", ПредставлениеТекущегоДокумента);
	
	_Платформа.ОткрытьФормуДиадокМодальноЛок(
		"ФормаHTMLСообщенияУправляемая",
		ЭтаФорма,
		ПараметрыОткрытияФормы
	);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_СохранитьQRКод(АдресВременногоХранилища, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	// BSLLS:MissingTempStorageDeletion-off
	ДанныеQR = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	// BSLLS:MissingTempStorageDeletion-on
	ИмяФайла = ДанныеQR.ИмяФайла;
	ДвоичныеДанные = ДанныеQR.Data;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Заголовок = "Укажите файл, в который нужно сохранить QR код";
	ДиалогВыбора.Фильтр = "GIF (*.gif)|*.gif";
	ДиалогВыбора.ПолноеИмяФайла = ИмяФайла;
	
	Если НЕ ДиалогВыбора.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
		
		Попытка
			
			Файл = Новый Файл(ДиалогВыбора.ПолноеИмяФайла);
			// BSLLS:UsingSynchronousCalls-off
			СоздатьКаталог(Файл.Путь);
			// BSLLS:UsingSynchronousCalls-on
			ДвоичныеДанные.Записать(ДиалогВыбора.ПолноеИмяФайла);
			
		Исключение
			
			Сообщить(ОписаниеОшибки());
			
		КонецПопытки;
		
	Иначе
		
		Сообщить(НСтр("ru = 'Не удалось получить файл QR кода'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКартинкаОшибкиИсторияПоДокументу()
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Пакет.Документы[0];
	
	СтатусМЧДКритичность = Документ.Статусы.СтатусМЧДКритичность;
	СтатусПКФНСКритичность = Документ.Статусы.СтатусПКФНСКритичность;
	
	Ядро = Модуль_Ядро();
	УровниКритичности = Ядро.Контракт_УровниКритичностиСтатусаДокумента();
	
	ЕстьОшибкаПроверкиМЧД = СтатусМЧДКритичность = УровниКритичности.Error
		Или СтатусМЧДКритичность = УровниКритичности.Warning;
	
	СтатусПКФНСКритичность = СтатусПКФНСКритичность = УровниКритичности.Error
		Или СтатусПКФНСКритичность = УровниКритичности.Warning;
		
	Если Не ЕстьОшибкаПроверкиМЧД И Не СтатусПКФНСКритичность Тогда
		Элементы.СтраницаИсторияПоДокументу.Картинка = Новый Картинка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Сценарии 

&НаКлиенте
Процедура ВыборСценария(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеВыбораСценария", ЭтаФорма, ДополнительныеПараметры);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийСценарий", ТекущийСценарий);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаВыбораСценария", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораСценария(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора <> Неопределено Тогда
		ТекущийСценарий = РезультатВыбора;
		ОбработатьСценарий(ТекущийСценарий, Истина);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОписаниеСценария(ТекущийСценарий)

	МодульОбъекта = ОбработкаОбъект();
	Результат = МодульОбъекта.ПредставлениеСценария(ТекущийСценарий);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбработатьСценарий(ТекущийСценарий, ЭтоВыборСценария)
	
	Элементы.КартинкаСценарий0.Видимость = Ложь;
	Элементы.КартинкаСценарий1.Видимость = Ложь;
	Элементы.КартинкаСценарий2.Видимость = Ложь;
	Элементы.КартинкаСценарий3.Видимость = Ложь;
	Элементы.КартинкаСценарий4.Видимость = Ложь;
	
	ОписаниеСценария = ОписаниеСценария(ТекущийСценарий);
	Элементы.ВыборСценария.Заголовок = ОписаниеСценария.ПредставлениеСценария + " (" + ОписаниеСценария.ПодсказкаСценария + ")";
	Элементы["КартинкаСценарий" + ОписаниеСценария.НомерКартинки].Видимость = Истина;
	НастройкаФормыПоСценарию(ТекущийСценарий, ЭтоВыборСценария);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаФормыПоСценарию(ТекущийСценарий, ЭтоВыборСценария)
	
	//сброс или универс. сценарий
	Элементы.рл_СвГО_РекИдентГО.Подсказка = "";
	Элементы.рл_СвПогруз_ВладИнфр_РекВладИнф.Подсказка = ""; 
	Элементы.ГруппаЭкспедиция.Заголовок = "Перевозку осуществляет";
	
	ВидимостьВыбораСовпГОП(Истина);	
	ВидимостьВыбораСовпГОВ(Истина);
	
	ВидимостьГруппыЭкспедиция(Истина);	
	ВидимостьВыбораЭкспедиция(Истина);
 	ВидимостьГруппыЭкспедицияАгент(Ложь);

	ВидимостьГруппыСовпГОВ(Истина);	

	Если ТекущийСценарий <> Неопределено Тогда
		
		Если ТекущийСценарий.КтоЗаказываетПеревозку = "Мы"
			И ТекущийСценарий.МестоФактическойПогрузки = "НашСклад" Тогда
			
			рл_СвПогруз_СвЛицПогрГр_СовпГОП = 1;
			рл_СвПогруз_СвЛицПогрГр_ОснПогрГр = Неопределено;
			рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГр = Неопределено;
			
			рл_СвПогруз_ВладИнфр_СовпГОВ = 1;
			рл_СвПогруз_ВладИнфр_РекВладИнф = Неопределено;
			
			ВидимостьВыбораСовпГОВ(Ложь);
			ВидимостьГруппыСовпГОВ(Ложь);			
			ВидимостьВыбораСовпГОП(Ложь);
			
		ИначеЕсли ТекущийСценарий.КтоЗаказываетПеревозку = "Мы"
			И ТекущийСценарий.МестоФактическойПогрузки = "СкладПартнера" Тогда
			
			рл_СвПогруз_ВладИнфр_СовпГОВ = 2;
			ВидимостьВыбораСовпГОВ(Ложь);
			ВидимостьГруппыСовпГОВ(Истина);
			
			рл_СвПогруз_СвЛицПогрГр_СовпГОП = 2;
			ВидимостьВыбораСовпГОП(Ложь);	
			
		ИначеЕсли ТекущийСценарий.КтоЗаказываетПеревозку = "Покупатель"
			И ТекущийСценарий.МестоФактическойПогрузки = "НашСклад" Тогда
			
			рл_СвПогруз_СвЛицПогрГр_СовпГОП = 1;
			рл_СвПогруз_СвЛицПогрГр_ОснПогрГр = Неопределено;
			рл_СвПогруз_СвЛицПогрГр_РекЛицПогрГр = Неопределено;
			ВидимостьВыбораСовпГОП(Ложь);	
			
			Если ЭтоВыборСценария Тогда
				рл_СвГО_РекИдентГО = рл_Контрагент;
			КонецЕсли;
			Элементы.рл_СвГО_РекИдентГО.Подсказка = "грузоотправителем является покупатель";
			
			ВидимостьВыбораСовпГОВ(Ложь);
			ВидимостьГруппыСовпГОВ(Истина);
			
			рл_СвПогруз_ВладИнфр_СовпГОВ = 2;
			Если ЭтоВыборСценария Тогда
				рл_СвПогруз_ВладИнфр_РекВладИнф = рл_Организация;
			КонецЕсли;
			Элементы.рл_СвПогруз_ВладИнфр_РекВладИнф.Подсказка = "собственное юридическое лицо";

		ИначеЕсли ТекущийСценарий.КтоЗаказываетПеревозку = "Покупатель"
			И ТекущийСценарий.МестоФактическойПогрузки = "СкладПартнера" Тогда
			
			Если ЭтоВыборСценария Тогда
				рл_СвГО_РекИдентГО = рл_Контрагент; 
				рл_СвПогруз_ВладИнфр_РекВладИнф = Неопределено;
			КонецЕсли;
			
			рл_СвПогруз_ВладИнфр_СовпГОВ = 2;
			ВидимостьВыбораСовпГОВ(Ложь);
			ВидимостьГруппыСовпГОВ(Истина);
			
			рл_СвПогруз_СвЛицПогрГр_СовпГОП = 2;
			ВидимостьВыбораСовпГОП(Ложь);	
			
			Элементы.рл_СвПогруз_ВладИнфр_РекВладИнф.Подсказка = "юридическое лицо пункта погрузки";
 			Элементы.рл_СвГО_РекИдентГО.Подсказка = "грузоотправителем является покупатель";

		КонецЕсли;
		
		Если ТекущийСценарий.РольЭкспедитора = "ОтвечаетЗаГруз" Тогда
			
			рл_СвГО_ГОЭксп = 1;
			ВидимостьГруппыЭкспедиция(Истина);	
			ВидимостьВыбораЭкспедиция(Ложь);
 			ВидимостьГруппыЭкспедицияАгент(Ложь);	
			Элементы.рл_СвГО_РекИдентГО.Подсказка = Элементы.рл_СвГО_РекИдентГО.Подсказка + 
				?(Элементы.рл_СвГО_РекИдентГО.Подсказка = "", "", ", ") +
				"грузоотправителем является экспедитор";
			Элементы.ГруппаЭкспедиция.Заголовок = "Заказчик перевозки";
			
		ИначеЕсли ТекущийСценарий.РольЭкспедитора = "ТолькоСопровождает" Тогда
			
			рл_СвГО_ГОЭксп = 0;
			ВидимостьГруппыЭкспедиция(Ложь);	
			ВидимостьВыбораЭкспедиция(Ложь);
 			ВидимостьГруппыЭкспедицияАгент(Истина);	
			
		ИначеЕсли ТекущийСценарий.РольЭкспедитора = "НеПривлекается" Тогда
			
			рл_СвГО_ГОЭксп = 0;
			рл_СвЗак_РекИдентЗак = Неопределено;
			рл_СвЗак_ДогУслПер = Неопределено;
			ВидимостьГруппыЭкспедиция(Ложь);	
			ВидимостьВыбораЭкспедиция(Ложь);
 			ВидимостьГруппыЭкспедицияАгент(Ложь);	
			
		КонецЕсли;
		
	КонецЕсли;

	ВидимостьСовпГОВ();
	ВидимостьЭкспедиции();
	ВидимостьСовпГОП();	
	
	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();
	
КонецПроцедуры

&НаСервере
Функция ТекущийСценарий(Сценарий)
	
	МодульОбъекта = ОбработкаОбъект();
	
	Результат = ?(Сценарий = Неопределено, МодульОбъекта.СценарийПростаяОтгрузка(), Сценарий);
	Если ЭтоНовыйДокументТрН() Тогда 

	ИначеЕсли ЗначениеЗаполнено(ИдентификаторТрН) Тогда
		Результат = МодульОбъекта.ПолучитьЗначениеСведения(ИдентификаторТрН, "Сценарий", Истина);
		Если Результат <> Неопределено Тогда
			Результат = ДесериализоватьXML(Результат);
		КонецЕсли;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Результат = МодульОбъекта.СценарийУниверсальный();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции  	

&НаСервере
Процедура ВидимостьГруппыЭкспедиция(Режим)
	Элементы.ГруппаЭкспедиция.Видимость = Режим;
КонецПроцедуры

&НаСервере
Процедура ВидимостьВыбораЭкспедиция(Режим)
	Элементы.рл_СвГО_ГОЭксп.Видимость = Режим;
КонецПроцедуры

&НаСервере
Процедура ВидимостьГруппыЭкспедицияАгент(Режим)
	Элементы.ГруппаЭкспедицияАгент.Видимость = Режим;
КонецПроцедуры

&НаСервере
Процедура ВидимостьГруппыСовпГОП(Режим)
	Элементы.ГруппаСовпГОП.Видимость = Режим;
КонецПроцедуры

&НаСервере
Процедура ВидимостьВыбораСовпГОП(Режим)
	Элементы.рл_СвПогруз_СвЛицПогрГр_СовпГОП.Видимость = Режим;
КонецПроцедуры

&НаСервере
Процедура ВидимостьВыбораСовпГОВ(Режим)
	Элементы.рл_СвПогруз_ВладИнфр_СовпГОВ.Видимость = Режим;
КонецПроцедуры

&НаСервере
Процедура ВидимостьГруппыСовпГОВ(Режим)
	Элементы.ГруппаСовпГОВ.Видимость = Режим;	
КонецПроцедуры

#КонецОбласти

#Область Согласование

&НаКлиенте
Процедура ПередатьНаСогласование(Команда)
	
	НачатьПроцессСогласования("ПередатьНаСогласование");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьНаПодпись(Команда)
	
	НачатьПроцессСогласования("ПередатьНаПодпись");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьПоМаршруту(Команда)
	
	НачатьПроцессСогласования("ПередатьПоМаршруту");
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	
	НачатьПроцессСогласования("Согласование");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВСогласовании(Команда)
	
	НачатьПроцессСогласования("ОтказВСогласовании");
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроцессСогласования(РежимФормыСогласования)
	
	ПакетОтправлен = ДокументОтправлен();
	
	Пакет = ПодготовитьПакетНаСервере();
	
	ДанныеДляОбработки = Новый Массив;
	Если ПакетОтправлен Тогда
		Документ = Пакет.Документы[0];
		ДанныеДляОбработки.Добавить(Документ);
	Иначе
		ДанныеДляОбработки.Добавить(Пакет);
	КонецЕсли;
	
	КатегорияМетрики = Метрика_НазваниеКатегорииПоНаправлению();
	КоличествоДанных = ДанныеДляОбработки.Количество();
	ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте();
	ДействиеМетрики = ЯдроНаКлиенте.Метрика_НазваниеДействияМаршрутизации(РежимФормыСогласования);
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, КоличествоДанных);
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(
		ДанныеДляОбработки,
		РежимФормыСогласования,
		КатегорияМетрики,
		ДействиеМетрики);
	
	ПараметрыОбработки.Вставить("BoxId", Пакет.Идентификаторы.BoxId);
	ПараметрыОбработки.Вставить("ДокументыОтправлены", ПакетОтправлен);
	ПараметрыОбработки.ИсточникОткрытия = Неопределено; //ИсточникОткрытия;
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОбработатьДействиеПоМаршрутизации( , ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Функция Новый_ПараметрыГрупповойОбработки(
	ДокументыДляОбработки,
	Действие,
	КатегорияМетрики,
	ДействиеМетрики,
	Знач ФормаВыполнения = Неопределено,
	ИдентификаторЯщика = Неопределено,
	КонтрагентПоддерживаетМЧД = Истина)
	
	Если ФормаВыполнения = Неопределено Тогда
		ФормаВыполнения = ЭтаФорма;
	КонецЕсли;
	
	ВыполнениеИзФормыПакета = Истина;
	РежимОтображенияДокументов = РежимыОтображения().Перевозочные;
	ИдентификаторОсновнойФормы = Неопределено;
	
	Модуль_Платформа = Модуль_Платформа();
	
	Результат = Модуль_Платформа.Новый_ПараметрыГрупповойОбработки(
		ДокументыДляОбработки,
		Действие,
		КатегорияМетрики,
		ДействиеМетрики,
		ФормаВыполнения,
		ИдентификаторЯщика,
		КонтрагентПоддерживаетМЧД,
		ВыполнениеИзФормыПакета,
		РежимОтображенияДокументов,
		ИдентификаторОсновнойФормы
	);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, КоличествоДанных = 1)
	
	НазваниеФормыДляМетрики = Метрика_НаименованиеФормы();
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Ядро.Метрика_ДобавитьПоведение_МассовоеДействиеНажатиеКнопки(НазваниеФормыДляМетрики,
		КатегорияМетрики,
		ДействиеМетрики,
		КоличествоДанных);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеКатегорииПоНаправлению()
	
	Результат = "";
	
	//Если Направление = Направление().Входящее Тогда
	//	Результат = "Действие во входящих";
	//ИначеЕсли Направление = Направление().Внутреннее Тогда
	//	Результат = "Действие во внутренних";
	//ИначеЕсли Направление = Направление().Исходящее И ПакетОтправлен Тогда
	//	Результат = "Действие в исходящих";
	//ИначеЕсли Направление = Направление().Исходящее И НЕ ПакетОтправлен Тогда
		Результат = "Действия в пакете перевозочных";	
	//КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимыОтображения()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Перевозочные", "ПеревозочныеДокументы");
	
	Возврат Результат
	
КонецФункции

&НаКлиенте
Процедура ОбновитьФорму(ДанныеДляОбработки = Неопределено) Экспорт
	
	НастроитьВидимостьКомандФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииПакета() Экспорт
	
	ОповеститьОВыборе(СтрокаСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВПодразделение(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	ДанныеДляОбработки = Новый Массив;
	Документ = Пакет.Документы[0];
	ДанныеДляОбработки.Добавить(Документ);
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииПоНаправлению();
	КоличествоДанных	= ДанныеДляОбработки.Количество();
	
	ДействиеМетрики		= "Передать в подразделение";
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, КоличествоДанных);
	
	ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте();
	Действие = ЯдроНаКлиенте.Перечисление_ДействияЭДО().ПередатьВПодразделение;
	
	Модуль_Платформа = Модуль_Платформа();
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(
		ДанныеДляОбработки,
		Действие,
		КатегорияМетрики,
		ДействиеМетрики
	);
	ПараметрыОбработки.ИсточникОткрытия = Неопределено;
	Модуль_Платформа.ОбработатьПередатьВПодразделение(, ПараметрыОбработки);
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьПередатьНаСогласование(ЕстьОграниченияПоТарифу)
	
	Если ЕстьОграниченияПоТарифу Тогда
		Элементы.ПередатьНаСогласование.Видимость = Ложь;
		Элементы.ПередатьНаСогласованиеЗаглушка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьПередатьПоМаршруту(ЕстьОграниченияПоТарифу)
	
	Если ЕстьОграниченияПоТарифу Тогда
		Элементы.ПередатьПоМаршруту.Видимость = Ложь;
		Элементы.ПередатьПоМаршрутуЗаглушка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьФункциональностьПоТарифуМини(ЕстьОграниченияПоТарифу)
	
	ОтключитьВключитьПередатьНаСогласование(ЕстьОграниченияПоТарифу);
	ОтключитьВключитьПередатьПоМаршруту(ЕстьОграниченияПоТарифу);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьФункцийТарифа()
	
	Ядро = Модуль_Ядро();
	ЕстьОграниченияПоТарифу = Ядро.ЕстьОграниченияПоТарифу();
	ОтключитьВключитьФункциональностьПоТарифуМини(ЕстьОграниченияПоТарифу);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВЗапросеПодписи(Команда)
	
	НачатьПроцессСогласования("ОтказВЗапросеПодписи");
	
КонецПроцедуры

#КонецОбласти
