// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.НадписьПредупреждение.Заголовок = СтрШаблон(
	НСтр("ru = 'В связи с переходом оператора Такском на платформу 1С:Хаб необходимо до %1 завершить документооборот для электронных документов из списка ниже. После этой даты завершение документооборота для них будет невозможно.
	|Остальные документы обрабатываются в штатном режиме.
	|
	|Контакты технической поддержки:
	|8 800 333-93-13, email: edo@1c.ru'"), 
	Формат(УчетныеЗаписиЭДО.ДатаОтключенияAPIТакском(), "ДЛФ=DD"));
	
	СписокДокументовКЗакрытию.Параметры.УстановитьЗначениеПараметра("ЧерезОператораЭДОТакском", Перечисления.СпособыОбменаЭД.ЧерезОператораЭДОТакском);
	СписокДокументовКЗакрытию.Параметры.УстановитьЗначениеПараметра("СостоянияЗавершенногоЭДО", РегламентыЭДО.СостоянияЗавершенногоЭДО());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументовКЗакрытию

&НаКлиенте
Процедура СписокДокументовКЗакрытиюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение( ,Элемент.ТекущиеДанные.ЭлектронныйДокумент);
КонецПроцедуры

#КонецОбласти