#Область СлужебныйПрограммныйИнтерфейс

#Область ПрограммныйИнтерфейс

#Область ДоступныеОперацииОтгрузки

// Функция проверяет, доступна ли операция отгрузки через агента для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Истина, если для вида продукции доступна операция отгрузки через агента
Функция ОперацияОтгрузкаАгентДоступна(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияОтгрузкаАгент"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

// Функция проверяет, доступна ли операция отгрузки ЕАЭС через ОСУ для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Истина, если для вида продукции доступна операция отгрузки ЕАЭС через ОСУ
Функция ОперацияОтгрузкаВЕАЭСПриОСУДоступна(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияОтгрузкаВЕАЭСПриОСУ"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

// Функция проверяет, доступна ли операция отгрузки ЕАЭС с признанием КИ для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Истина, если для вида продукции доступна операция отгрузки ЕАЭС с признанием КИ
Функция ОперацияОтгрузкаЕАЭССПризнаниемКИДоступна(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияОтгрузкаЕАЭССПризнаниемКИ"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

// Функция проверяет, доступна ли операция отгрузки на комиссию для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Истина, если для вида продукции доступна операция отгрузки на комиссию
Функция ОперацияОтгрузкаКомиссияДоступна(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияОтгрузкаКомиссия"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

// Функция проверяет, доступна ли операция отгрузки продажи для указанного вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Истина, если для вида продукции доступна операция отгрузки продажи
Функция ОперацияОтгрузкаПродажаДоступна(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияОтгрузкаПродажа"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ЭлементыКонструктораВидовПродукции

Функция ДоступныеОперации(ВидПродукцииТоварнаяГруппа) Экспорт
	
	ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа);
	
	ДоступныеОперации = Новый Массив;
	
	Если ОперацияОтгрузкаЕАЭССПризнаниемКИДоступна(ВидыПродукции) Тогда
		Операция = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийИСМП.ОтгрузкаЕАЭССПризнаниемКИ");
		ДоступныеОперации.Добавить(Операция);
	КонецЕсли;
	
	Если ОперацияОтгрузкаВЕАЭСПриОСУДоступна(ВидыПродукции) Тогда
		Операция = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийИСМП.ОтгрузкаВЕАЭСПриОСУ");
		ДоступныеОперации.Добавить(Операция);
	КонецЕсли;
	
	Если ОперацияОтгрузкаПродажаДоступна(ВидыПродукции) Тогда
		Операция = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийИСМП.ОтгрузкаПродажа");
		ДоступныеОперации.Добавить(Операция);
	КонецЕсли;
	
	Если ОперацияОтгрузкаКомиссияДоступна(ВидыПродукции) Тогда
		Операция = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийИСМП.ОтгрузкаКомиссия");
		ДоступныеОперации.Добавить(Операция);
	КонецЕсли;
		
	Если ОперацияОтгрузкаАгентДоступна(ВидыПродукции) Тогда
		Операция = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийИСМП.ОтгрузкаАгент");
		ДоступныеОперации.Добавить(Операция);
	КонецЕсли;
		
	Возврат ДоступныеОперации;
	
КонецФункции

Функция ДоступноПолеИдентификаторПроисхождения(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеИдентификаторПроисхождения"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеПолеGLNКонтрагента(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеGLNКонтрагента"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеПроизводитель(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеПроизводитель"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеДанныеИмпорта(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеДанныеИмпорта"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеОтгрузкаНеучастнику(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеОтгрузкаНеучастнику"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляСтранаНазначения(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляСтранаНазначения"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляGLNКонтрагента(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляGLNКонтрагента"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляGTIN(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляGTIN"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляИдентификаторПроисхожденияВЕТИС(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляИдентификаторПроисхожденияВЕТИС"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

#КонецОбласти

#КонецОбласти