#Область ПрограммныйИнтерфейс

Функция СоответствиеПоляПеречисляемыхТипов() Экспорт
	
	Результат = Новый Соответствие;
	
	#Область СистемнаяИнформация
	ОписаниеПолей = Новый Массив;
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ВерсияОС";
	ОписаниеПоля["ИмяНаАнглийском"] = "OSVersion";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ВерсияПриложения";
	ОписаниеПоля["ИмяНаАнглийском"] = "AppVersion";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ТипПлатформы";
	ОписаниеПоля["ИмяНаАнглийском"] = "PlatformType";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ОперативнаяПамять";
	ОписаниеПоля["ИмяНаАнглийском"] = "RAM";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "Процессор";
	ОписаниеПоля["ИмяНаАнглийском"] = "Processor";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ИдентификаторКлиента";
	ОписаниеПоля["ИмяНаАнглийском"] = "ClientID";
	ОписаниеПолей.Добавить(ОписаниеПоля);

	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ИнформацияПрограммыПросмотра";
	ОписаниеПоля["ИмяНаАнглийском"] = "UserAgentInformation";
	ОписаниеПолей.Добавить(ОписаниеПоля);

	Результат.Вставить(Тип("СистемнаяИнформация"), ОписаниеПолей);
	#КонецОбласти
	#Область Файл
	ОписаниеПолей = Новый Массив;
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "Имя";
	ОписаниеПоля["ИмяНаАнглийском"] = "Name";
	ОписаниеПоля["Тип"] = "Строка";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ИмяБезРасширения";
	ОписаниеПоля["ИмяНаАнглийском"] = "BaseName";
	ОписаниеПоля["Тип"] = "Строка";
	ОписаниеПолей.Добавить(ОписаниеПоля);

	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ПолноеИмя";
	ОписаниеПоля["ИмяНаАнглийском"] = "FullName";
	ОписаниеПоля["Тип"] = "Строка";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "Путь";
	ОписаниеПоля["ИмяНаАнглийском"] = "Path";
	ОписаниеПоля["Тип"] = "Строка";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "Расширение";
	ОписаниеПоля["ИмяНаАнглийском"] = "Extension";
	ОписаниеПоля["Тип"] = "Строка";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа("Сервер");
	ОписаниеПоля["Имя"] = "ЭтоФайл()";
	ОписаниеПоля["ИмяНаАнглийском"] = "IsFile()";
	ОписаниеПоля["Тип"] = "Булево";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа("Сервер");
	ОписаниеПоля["Имя"] = "ЭтоКаталог()";
	ОписаниеПоля["ИмяНаАнглийском"] = "IsDirectory()";
	ОписаниеПоля["Тип"] = "Булево";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа("Сервер");
	ОписаниеПоля["Имя"] = "Существует()";
	ОписаниеПоля["ИмяНаАнглийском"] = "Exists()";
	ОписаниеПоля["Тип"] = "Булево";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа("Сервер");
	ОписаниеПоля["Имя"] = "Размер()";
	ОписаниеПоля["ИмяНаАнглийском"] = "Size()";
	ОписаниеПоля["Тип"] = "Число";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа("Сервер");
	ОписаниеПоля["Имя"] = "ПолучитьВремяИзменения()";
	ОписаниеПоля["ИмяНаАнглийском"] = "GetModificationTime()";
	ОписаниеПоля["Тип"] = "Булево";
	ОписаниеПолей.Добавить(ОписаниеПоля);

	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа("Сервер");
	ОписаниеПоля["Имя"] = "ПолучитьУниверсальноеВремяИзменения()";
	ОписаниеПоля["ИмяНаАнглийском"] = "GetModificationUniversalTime()";
	ОписаниеПоля["Тип"] = "Дата";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа("Сервер");
	ОписаниеПоля["Имя"] = "ПолучитьТолькоЧтение()";
	ОписаниеПоля["ИмяНаАнглийском"] = "GetReadOnly()";
	ОписаниеПоля["Тип"] = "Булево";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа("Сервер");
	ОписаниеПоля["Имя"] = "ПолучитьНевидимость()";
	ОписаниеПоля["ИмяНаАнглийском"] = "GetHidden()";
	ОписаниеПоля["Тип"] = "Булево";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	Результат.Вставить(Тип("Файл"), ОписаниеПолей);
	#КонецОбласти
	
	#Если Сервер Тогда
	#Область Запрос
	ОписаниеПолей = Новый Массив;
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "Текст";
	ОписаниеПоля["ИмяНаАнглийском"] = "Text";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "Параметры";
	ОписаниеПоля["ИмяНаАнглийском"] = "Parameters";
	ОписаниеПоля["Тип"] = "Структура";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "МенеджерВременныхТаблиц";
	ОписаниеПоля["ИмяНаАнглийском"] = "TempTablesManager";
	ОписаниеПоля["Тип"] = "МенеджерВременныхТаблиц";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	Результат.Вставить(Тип("Запрос"), ОписаниеПолей);
	#КонецОбласти
	#Область РезультатЗапроса
	ОписаниеПолей = Новый Массив;
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "Пустой()";
	ОписаниеПоля["ИмяНаАнглийском"] = "IsEmpty()";
	ОписаниеПоля["Тип"] = "Булево";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "Колонки";
	ОписаниеПоля["ИмяНаАнглийском"] = "Columns";
	ОписаниеПоля["Тип"] = "КоллекцияКолонокРезультатаЗапроса";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	Результат.Вставить(Тип("РезультатЗапроса"), ОписаниеПолей);
	#КонецОбласти
	#Область КолонкаРезультатаЗапроса 
	ОписаниеПолей = Новый Массив;
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "Имя";
	ОписаниеПоля["ИмяНаАнглийском"] = "Name";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "ТипЗначения";
	ОписаниеПоля["ИмяНаАнглийском"] = "ValueType";
	ОписаниеПоля["Тип"] = "ОписаниеТипов";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	ОписаниеПоля = ОписаниеПоляПеречисляемогоТипа();
	ОписаниеПоля["Имя"] = "Ширина";
	ОписаниеПоля["ИмяНаАнглийском"] = "Width";
	ОписаниеПоля["Тип"] = "Число";
	ОписаниеПолей.Добавить(ОписаниеПоля);
	
	Результат.Вставить(Тип("КолонкаРезультатаЗапроса"), ОписаниеПолей);
	#КонецОбласти
	#КонецЕсли

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеПоляПеречисляемогоТипа(Контекст = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("Имя");
	Результат.Вставить("ИмяНаАнглийском");
	Результат.Вставить("Тип", Тип("Строка"));
	
	ДоступноНаКлиенте = (Контекст = Неопределено) ИЛИ Контекст = "Клиент";
	Результат.Вставить("ДоступноНаКлиенте", ДоступноНаКлиенте);
	
	ДоступноНаСервере = (Контекст = Неопределено) ИЛИ Контекст = "Сервер";
	Результат.Вставить("ДоступноНаСервере", ДоступноНаСервере);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
