////////////////////////////////////////////////////////////////////////////////
// ОПИСПНИЕ ПЕРЕМЕННЫХ

// Кэш клиент

// BSLLS:UnusedLocalVariable-off
&НаКлиенте
Перем
_Платформа, // Кэш модуля Платформа
_ЯдроКлиент, // Кэш модуля Ядра
_Стд; // Кэш модуля Стд
// Кэш сервер

&НаСервере
Перем
_ОбработкаОбъект, // Кэш модуля объекта
_МодульЯдроНаСервере, // Кэш модуля Ядра на сервере
_БиблиотекаКартинок; // Кэш модуля Библиотеки картинок
// BSLLS:UnusedLocalVariable-on

////////////////////////////////////////////////////////////////////////////////
// ЗАВИСИМОСТИ

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()

	Если _ЯдроКлиент = Неопределено Тогда
		_ЯдроКлиент = Платформа().Модуль_ЯдроНаКлиенте();
	КонецЕсли;
	
	Возврат _ЯдроКлиент;
	
КонецФункции

&НаКлиенте
Функция Стд()

	Если _Стд = Неопределено Тогда
		_Стд = Модуль_ЯдроНаКлиенте()._Стд();
	КонецЕсли;
	
	Возврат _Стд;
	
КонецФункции

&НаКлиенте
Функция Платформа() Экспорт
	
	Если _Платформа = Неопределено Тогда
		_Платформа = ВладелецФормы.Модуль_Платформа();
	КонецЕсли;
	
	Возврат _Платформа;
	
КонецФункции

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

&НаСервере
Функция БиблиотекаКартинок()
	
	Если _БиблиотекаКартинок = Неопределено Тогда
		_БиблиотекаКартинок = ОбработкаОбъект().БиблиотекаКартинок();
	КонецЕсли;
	
	Возврат _БиблиотекаКартинок;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Объект.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	// BSLLS:UnusedLocalVariable-off
	ОбщийКонтекстКлиентСервер = Объект.ОбщийКонтекстКлиентСервер;
	// BSLLS:UnusedLocalVariable-off
	
	ЗаполнитьНастройки();
	УстановитьНастройкиФормы();
	
	// BSLLS:UnusedLocalVariable-off
	КартинкаКлюч = ПоместитьВоВременноеХранилище(БиблиотекаКартинок().КартинкаБольшойКлюч, УникальныйИдентификатор);
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОтправкаПриглашенийАвтоматическаяОтправкаПриИзменении(Элемент)
	
	УстановитьМодифицированность(Истина);
	
	Если ОтправлятьАвтоматически  
		И РежимОтправкиЯщикиДиадок = 0 И РежимОтправкиЯщикВсе = 0 Тогда
		// BSLLS:UnusedLocalVariable-off
		РежимОтправкиЯщикиДиадок = 1;
		// BSLLS:UnusedLocalVariable-on
	КонецЕсли;
	
	Если ОтправлятьАвтоматически = Ложь Тогда
		// BSLLS:UnusedLocalVariable-off
		РежимОтправкиЯщикиДиадок = 0;
		РежимОтправкиЯщикВсе = 0;       
		// BSLLS:UnusedLocalVariable-on
	КонецЕсли;
	
	УстановитьНастройкиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацийПометкаПриИзменении(Элемент)
	
	УстановитьМодифицированность(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаПриглашенийРежимОтправкиЯщикиДиадокПриИзменении(Элемент)
		
	УстановитьМодифицированность(Истина);
	// BSLLS:UnusedLocalVariable-off
	РежимОтправкиЯщикВсе = 0;       
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаПриглашенийРежимОтправкиЯщикВсеПриИзменении(Элемент)
	
	УстановитьМодифицированность(Истина);
	// BSLLS:UnusedLocalVariable-off
	РежимОтправкиЯщикиДиадок = 0;   
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияУведомлениеТестФункционалОставьтеОтзывНажатие(Элемент)
	
	Оповещение = Платформа().НовыйОписаниеОповещения("_ПослеОбработкиОценкаРаботыСМодулем", ЭтаФорма);
	Платформа().ПоказатьФормуОценкиРаботыСМодулем("ОтзывОбАвтоОтправкиПриглашений", ЭтаФорма, Оповещение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	ЗакрытьФормуНастроек(Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	Если Модифицированность Тогда
		ПоказатьВопросОСохраненииНастроек();
	Иначе
		ЗакрытьФормуНастроек();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ

&НаКлиенте
Процедура ЗакрытьФормуНастроек(НастройкиИзменены = Ложь)

	Если Модифицированность Тогда
		
		СохранитьНастройки();
		НачатьОтправкуПриглашенийКонтрагентам();
		Закрыть();
		
	Иначе
				
		ПараметрыЗакрытияФормы = Новый Структура;
		ПараметрыЗакрытияФормы.Вставить("ПерезапуститьМодуль", Ложь);
		ПараметрыЗакрытияФормы.Вставить("НастройкиИзменены", НастройкиИзменены);
		
		Закрыть(ПараметрыЗакрытияФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтправкуПриглашенийКонтрагентам()
	
	Если Платформа().ДлительныеОперации_Доступны() И ФоновыеОперацииРазрешеныНаСервере() Тогда
		// BSLLS:UnusedLocalVariable-off
		ОписаниеЗадания = Платформа().ДлительныеОперации_ВыполнитьВФоне("ОтправитьПриглашенияКонтрагентам");
		// BSLLS:UnusedLocalVariable-on
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки()
	
	КоличествоВыбранных = 0;
	
	Для Каждого Элемент Из СписокОрганизаций Цикл
		Если Элемент.Пометка Тогда
			КоличествоВыбранных = КоличествоВыбранных + 1;
		КонецЕсли;
	КонецЦикла;
	
	Переменные = Новый Соответствие;
	Переменные.Вставить("Количество доступных организаций", СписокОрганизаций.Количество());
	Переменные.Вставить("Количество выбранных организаций", КоличествоВыбранных);
	Переменные.Вставить("Чекбокс", ОтправлятьАвтоматически);
	
	КлючНастройкаОтправкиПриглашений = "НастройкаОтправкиПриглашений";
	
	Если РежимОтправкиЯщикиДиадок <> 0 Тогда
		Переменные.Вставить(КлючНастройкаОтправкиПриглашений, "только в Диадок");
	ИначеЕсли РежимОтправкиЯщикВсе <> 0 Тогда
		Переменные.Вставить(КлючНастройкаОтправкиПриглашений, "все");
	Иначе
		Переменные.Вставить(КлючНастройкаОтправкиПриглашений, "0");
	КонецЕсли;
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьСтатистику(
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеКатегории().АвтоотправкаПриглашений,
		Модуль_ЯдроНаКлиенте().Метрика_НазваниеДействий().СохранениеНастройки,
		,
		Переменные);
		
	СохранитьНастройкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОСохраненииНастроек()
	
	ТекстВопроса = "Настройки были изменены. Сохранить изменения?";
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Стд().ОбщегоНазначения().ОписаниеОповещения("ЗакрытиеФормыНастроекЗавершение", ЭтаФорма);
	
	Стд().Диалоги().ПоказатьВопросЛок(Оповещение, ТекстВопроса, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыНастроекЗавершение(ОтветНаВопрос, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		СохранитьНастройки();
		Закрыть();
	Иначе
		// BSLLS:UnusedLocalVariable-off
		Модифицированность = Ложь;
		// BSLLS:UnusedLocalVariable-on
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМодифицированность(Значение)
	
	// BSLLS:UnusedLocalVariable-off
	Модифицированность = Значение;
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

&НаКлиенте
Процедура _ПослеОбработкиОценкаРаботыСМодулем(Результат, ДопПараметры = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Категория = "ОтзывОбАвтоОтправкиПриглашений";
	Сценарий = "Отзыв";
	Модуль_ЯдроНаКлиенте().ЗаписатьОС(Результат, Сценарий, Категория, "Да");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	Настройки = СформироватьНастройки();
	Модуль_ЯдроНаСервере().ХранениеДанных_НастройкиАвтоматическойОтправкиПриглашенийЗаписать(Настройки);
	
КонецПроцедуры

&НаСервере
Функция СформироватьНастройки()
	
	Результат = Модуль_ЯдроНаСервере().МодельНастройкиАвтоматическойОтправкиПриглашений();
	Результат.ОтправлятьАвтоматически = ОтправлятьАвтоматически;
	Результат.Организации = СписокОрганизаций;
	
	РежимыОтправки = Модуль_ЯдроНаСервере().РежимыОтправкиПриглашенийКонтрагентам();
	
	Если РежимОтправкиЯщикиДиадок = РежимыОтправки.ЯщикиДиадок Тогда
		Результат.РежимОтправки = РежимОтправкиЯщикиДиадок;
	ИначеЕсли РежимОтправкиЯщикВсе = РежимыОтправки.ЯщикиВсе Тогда
		Результат.РежимОтправки = РежимОтправкиЯщикВсе;
	Иначе
		Результат.РежимОтправки = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура УстановитьНастройкиАвтоматическойОтправкиПриглашений(Настройки)
	
	РежимыОтправки = Модуль_ЯдроНаСервере().РежимыОтправкиПриглашенийКонтрагентам();
	
	Если Настройки.РежимОтправки = РежимыОтправки.ЯщикиДиадок Тогда
		// BSLLS:UnusedLocalVariable-off
		РежимОтправкиЯщикиДиадок = Настройки.РежимОтправки;
		// BSLLS:UnusedLocalVariable-on
	КонецЕсли;
	Если Настройки.РежимОтправки = РежимыОтправки.ЯщикиВсе Тогда
		// BSLLS:UnusedLocalVariable-off
		РежимОтправкиЯщикВсе = Настройки.РежимОтправки;
		// BSLLS:UnusedLocalVariable-on
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	
	Настройки = Модуль_ЯдроНаСервере().ХранениеДанных_НастройкиАвтоматическойОтправкиПриглашений();
	// BSLLS:UnusedLocalVariable-off
	ОтправлятьАвтоматически = Настройки.ОтправлятьАвтоматически;
	// BSLLS:UnusedLocalVariable-on
	
	УстановитьНастройкиАвтоматическойОтправкиПриглашений(Настройки);
	ЗаполнитьСписокОрганизаций(Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОрганизаций(Настройки)
		
	СписокОрганизаций.Очистить();
	
	Для Каждого Организация Из Настройки.Организации Цикл
		
		НоваяСтрока = СписокОрганизаций.Добавить();
		НоваяСтрока.Значение = Организация.Значение;
		НоваяСтрока.Пометка = Организация.Пометка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиФормы()

	Элементы.СписокОрганизаций.ТолькоПросмотр = Не ОтправлятьАвтоматически;
	Элементы.ОтправкаПриглашенийРежимОтправкиЯщикиДиадок.ТолькоПросмотр = Не ОтправлятьАвтоматически;
	Элементы.ОтправкаПриглашенийРежимОтправкиЯщикВсе.ТолькоПросмотр = Не ОтправлятьАвтоматически;
	
КонецПроцедуры

&НаСервере
Функция ФоновыеОперацииРазрешеныНаСервере()
	
	Возврат Модуль_ЯдроНаСервере().ФоновыеОперацииРазрешены();
	
КонецФункции