Функция ЗначениеДляXDTO(Ссылка) Экспорт

	Если Ссылка = НетКонтейнера Тогда 
		Результат = Неопределено;
	ИначеЕсли Ссылка = ПриемКПеревозкеГруженогоКонтейнера Тогда 
		Результат = "0";
	ИначеЕсли Ссылка= ПодачаПорожнегоКонтейнераГрузоотправителю Тогда 
		Результат = "1";
	Иначе
		
		ВызватьИсключение "Для заполнения в xml передано неверное значение метода определения ВариантыПодачиКонтейнера: " + Ссылка;
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции 

Функция ЗначениеИзXDTO(Строка, ЭтоТитул1 = Истина) Экспорт
	
	Результат = ПустаяСсылка();
	
	Если Строка = Неопределено Тогда 
		Результат = ПустаяСсылка();
	ИначеЕсли Строка = "0" Тогда 
		Результат = ПриемКПеревозкеГруженогоКонтейнера;
	ИначеЕсли Строка= "1" Тогда 
		Результат = ПодачаПорожнегоКонтейнераГрузоотправителю;
	Иначе
		
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстОшибки = "Для Титула 1 в xml передано неверное значение метода определения ВариантыПодачиКонтейнера: " + Строка;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
