#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	Объект.ВестиРасчетыПоПретензии = Истина;
	Элементы.ПретензияПоставщику.ФорматРедактирования = "БЛ=Входящая; БИ=Исходящая"; 
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ДатаПретензии", "ГруппаПартнерСтатус", , 1, "Объект.АУ_ДатаПретензии");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ЕИС", "ГруппаНаименованиеФлагРасчеты", , 2, "Объект.АУ_ЕИС");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ПризнаннаяСумма", "СтраницаУчетнаяИнформация", , 1, "Объект.АУ_ПризнаннаяСумма");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_СписанаКонтрагентом", "ГруппаНаименованиеФлагРасчеты", , 2, "Объект.АУ_СписанаКонтрагентом");
	Элементы.Ответственный.Заголовок = "Исполнитель";
	Элементы.ВиновноеПодразделение.Заголовок = "Ответственное подразделение";
	Элементы.ВиновныйСотрудник.Заголовок = "Менеджер";
	Элементы.СтраницаДополнительнаяИнформация.Заголовок = "Этапы рассмотрения";

	АУ_СозданиеЭлементовФормы.СоздатьДинамическийСписок(ЭтаФорма, "АУ_Задачи", "СтраницаДополнительнаяИнформация", , , "Задача.ЗадачаИсполнителя", Новый Структура("Дата,Номер,Наименование,ПринятаКИсполнению,Выполнена,Исполнитель,СостояниеБизнесПроцесса"));
	Элементы.АУ_ЗадачиКоманднаяПанель.Видимость = Ложь;
	Элементы.АУ_Задачи.ТолькоПросмотр = Истина;

	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(ЭтаФорма, "СформироватьЗадачу", Новый ОписаниеТипов("Булево"));

	Группа = АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычнаяБезОтображения(ЭтаФорма, "АУ_ГруппаВариантРасчетаНеустойки", "СтраницаОсновное", 3, 1, 2);

	СвойстваПереключателя = Новый Структура;
	СвойстваПереключателя.Вставить("ВидПереключателя", ВидПереключателя.Тумблер);
	СвойстваПереключателя.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Верх);

	Элемент = АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ВариантРасчетаНеустойки", Группа, , 4, "Объект.АУ_ВариантРасчетаНеустойки", СвойстваПереключателя, Новый Структура("ПриИзменении", "ПриИзмененииВариантаРасчетаНеустойки"));

	Элемент.СписокВыбора.Добавить(0, "Расчет неустойки на дату каждой реализации");
	Элемент.СписокВыбора.Добавить(1, "Фиксированная ставка на дату последней реализации");
	Элемент.СписокВыбора.Добавить(2, "Фиксированная ставка на заданную дату");

	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ДатаКлючевойСтавки", Группа, , 1, "Объект.АУ_ДатаКлючевойСтавки");

	НастроитьОтборПоЗадачам();

	НастроитьДоступныеСтатусы();

	Если Параметры.Ключ.Пустая() Тогда
		Если Объект.ЭтоПретензияПоставщику Тогда
			Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПретензийКлиентов.АУ_Направлена");
		Иначе
			Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПретензийКлиентов.Зарегистрирована");
		КонецЕсли;
	КонецЕсли;

	АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычная(ЭтаФорма, "АУ_ГруппаДоговоры", "СтраницаУчетнаяИнформация", "Договоры", 1, 1, 2);
	АУ_СозданиеЭлементовФормы.СоздатьТаблицаФормы(ЭтаФорма, "АУ_Договоры", "АУ_ГруппаДоговоры", "Объект.АУ_Договоры", Новый Структура("Договор"));
	АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычная(ЭтаФорма, "АУ_ГруппаОснования", "СтраницаУчетнаяИнформация", "Основания", 1, 1, 2);
	АУ_СозданиеЭлементовФормы.СоздатьТаблицаФормы(ЭтаФорма, "АУ_Основания", "АУ_ГруппаОснования", "Объект.АУ_Основания", Новый Структура("Основание"));

	Элементы.Основание.Вид = ВидПоляФормы.ПолеВвода;
	Элементы.Основание.УстановитьДействие("ПриИзменении", "АУ_ПриИзмененииОснования");

	Элементы.АУ_ДатаКлючевойСтавки.Видимость = (Объект.АУ_ВариантРасчетаНеустойки = 2);
	//Связь=Новый СвязьПараметраВыбора("Отбор.Партнер","Объект.Партнер");
	//Элементы.Договор.СвязиПараметровВыбора=Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Связь));
	//Элементы.Договор.ПараметрыВыбора=Новый ФиксированныйМассив(Новый Массив);

КонецПроцедуры

&НаКлиенте
Процедура АУ_ПослеЗаписиПосле(ПараметрыЗаписи)

	НастроитьОтборПоЗадачам();

КонецПроцедуры

&НаСервере
Процедура АУ_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ЭтаФорма["СформироватьЗадачу"] = Ложь;
	Если НЕ Отказ Тогда
		Если Объект.Ссылка.Пустая() И Объект.Статус = Перечисления.СтатусыПретензийКлиентов.Зарегистрирована Тогда
			ЭтаФорма["СформироватьЗадачу"] = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура АУ_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)

	Если ЭтаФорма["СформироватьЗадачу"] И ЗначениеЗаполнено(АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("РуководительЮридическогоОтдела")) Тогда

		Задача = АУ_ОбщиеПроцедурыИФункцииСервер.СоздатьЗадачуИсполнителю(АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("РуководительЮридическогоОтдела"), "Обработка претензии", Объект.Ссылка);
		ЭтаФорма["СформироватьЗадачу"] = Ложь;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриИзмененииВариантаРасчетаНеустойки(Элемент)

	Элементы.АУ_ДатаКлючевойСтавки.Видимость = (Объект.АУ_ВариантРасчетаНеустойки = 2);

КонецПроцедуры

&НаСервере
Процедура АУ_ПриИзмененииОснованияСервер()

	Объект.Договор = Объект.Основание.Договор;

КонецПроцедуры

&НаКлиенте
Процедура АУ_ПриИзмененииОснования(Элемент)

	АУ_ПриИзмененииОснованияСервер();

КонецПроцедуры

&НаКлиенте
Процедура АУ_ПретензияПоставщикуПриИзмененииПосле(Элемент)

	НастроитьДоступныеСтатусы();
	Если Объект.ЭтоПретензияПоставщику Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПретензийКлиентов.АУ_Направлена");
	Иначе
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПретензийКлиентов.Зарегистрирована");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьОтборПоЗадачам()

	ЭтаФорма["АУ_Задачи"].Отбор.Элементы.Очистить();

	Если Объект.Ссылка.Пустая() Тогда
		Элементы.АУ_Задачи.Видимость = Ложь;
	Иначе
		Элементы.АУ_Задачи.Видимость = Истина;
		ЭлементОтбора = ЭтаФорма["АУ_Задачи"].Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Предмет");
		ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НастроитьДоступныеСтатусы()

	Элементы.Статус.РежимВыбораИзСписка = Истина;
	Элементы.Статус.СписокВыбора.Очистить();

	Если Объект.ЭтоПретензияПоставщику Тогда
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыПретензийКлиентов.АУ_Проект);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыПретензийКлиентов.АУ_Направлена);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыПретензийКлиентов.Удовлетворена);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыПретензийКлиентов.АУ_УдовлетворенаВЧасти);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыПретензийКлиентов.НеУдовлетворена);
	Иначе
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыПретензийКлиентов.Зарегистрирована);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыПретензийКлиентов.Обрабатывается);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыПретензийКлиентов.Удовлетворена);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыПретензийКлиентов.АУ_УдовлетворенаВЧасти);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыПретензийКлиентов.НеУдовлетворена);
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыПретензийКлиентов.АУ_ОтказаноСуммаВРезерв);
	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("НастроитьФормуПоРеквизитам")
Процедура АУ_НастроитьФормуПоРеквизитам()

	#Удаление
	Элементы.Партнер.Заголовок = ?(Объект.ЭтоПретензияПоставщику, НСтр("ru = 'Поставщик'"), НСтр("ru = 'Клиент'"));
	#КонецУдаления
	#Вставка
	Элементы.Партнер.Заголовок = ?(Объект.ЭтоПретензияПоставщику, НСтр("ru = 'Контрагент'"), НСтр("ru = 'Контрагент'"));
	#КонецВставки

	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") 
		И НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	УстановитьПодсказкуНаименования();
	УстановитьПараметрыВыбораПартнера();
	УстановитьВидимостьДоговора();
	УстановитьПараметрыВыбораДоговора();
	УстановитьПараметрыВыбораГФУ();
	УстановитьПараметрыВыбораНД();
	Элементы.ВиновноеПодразделение.Видимость = НЕ Объект.ЭтоПретензияПоставщику;
	Элементы.ВиновныйСотрудник.Видимость = НЕ Объект.ЭтоПретензияПоставщику;
	Элементы.Валюта.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Договор);

КонецПроцедуры

&НаСервере
&Вместо("УстановитьПараметрыВыбораДоговора")
Процедура АУ_УстановитьПараметрыВыбораДоговора()

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("УправлениеДоступностью")
Процедура АУ_УправлениеДоступностью()

	ОтключитьОтметкуНезаполненного();
	#Удаление
	Элементы.ДатаОкончания.Доступность = (Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПретензийКлиентов.Удовлетворена")
	Или Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПретензийКлиентов.НеУдовлетворена"));
	#КонецУдаления
	
	#Вставка
	Элементы.ПретензияПоставщику.ТолькоПросмотр = Ложь;
	Элементы.ПретензияПоставщику.Доступность = Истина;
	#КонецВставки

КонецПроцедуры

&НаСервере
&Вместо("УстановитьПараметрыВыбораПартнера")
Процедура АУ_УстановитьПараметрыВыбораПартнера()

КонецПроцедуры

#КонецОбласти
