&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

&НаКлиенте
Процедура УстановитьПометки(Команда)
	Для каждого СтрокаВыборки из ТаблицаВыборки Цикл
		СтрокаВыборки.Выгружать = Истина;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	Для каждого СтрокаВыборки из ТаблицаВыборки Цикл
		СтрокаВыборки.Выгружать = Ложь;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	КомПанельТаблицыВыборкиЗаполнитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура ГиперСсылкаНажатие(Элемент)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если Элементы.ПанельТаблицыВыгрузки.Свертка = РежимСверткиЭлементаУправления.Низ Тогда 
			Элементы.ПанельТаблицыВыгрузки.Свертка = РежимСверткиЭлементаУправления.Нет;
			Элементы.НадписьКоличествоСтрок.Видимость = Истина;
			Элементы.КоличествоСтрок.Видимость = Истина;
		Иначе 
			Элементы.ПанельТаблицыВыгрузки.Свертка = РежимСверткиЭлементаУправления.Низ;
			Элементы.НадписьКоличествоСтрок.Видимость = Ложь;
			Элементы.КоличествоСтрок.Видимость = Ложь;
		КонецЕсли;
	#Иначе
		Если Элементы.ТаблицаВыборки.Видимость Тогда 
			Элементы.ТаблицаВыборки.Видимость = Ложь;
			Элементы.НадписьКоличествоСтрок.Видимость = Ложь;
			Элементы.КоличествоСтрок.Видимость = Ложь;
		Иначе 
			Элементы.ТаблицаВыборки.Видимость = Истина;
			Элементы.НадписьКоличествоСтрок.Видимость = Истина;
			Элементы.КоличествоСтрок.Видимость = Истина;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекстЗаголовка = НСтр("be = 'Ачысціць даведнік %1'; en = 'Clear directory %1'; es = 'Limpiar directorio %1'; ka = 'საშუალოს გასუფთავება %1'; kk = '%1 тізімді тазалау'; ro = 'Ștergeți dicționarul %1'; ru = 'Очистить справочник %1'; tr = '%1 rehberi temizle'; uk = 'Очистити довідник %1'; uz = ""%1 ma'lumotnoma tozalash""");
	ТекстЗаголовка = _ЛокКонтекст.ЛокЯдро_СтрШаблон(ТекстЗаголовка, ИмяТаблицы);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Элементы.ПанельФормы.Кнопки.ФормаОчиститьСправочник.Текст = ТекстЗаголовка;
		Элементы.ПанельТаблицыВыгрузки.Свертка = РежимСверткиЭлементаУправления.Низ;
	#Иначе
		Элементы.ФормаОчиститьСправочник.Заголовок = ТекстЗаголовка;
		ТекстЗаголовка = НСтр("be = 'Cleverence: Налада і выгрузка даведніка %1 на Мабільнае прылада'; en = 'Cleverence: Setting up and unloading the directory %1 to the Mobile device'; es = 'Cleverence: Configuración y descarga de directorio %1 en dispositivo móvil'; ka = 'Cleverence: %1 სამრავლოს გამოტანის და ჩატვირთვის პარამეტრების პარამეტრები'; kk = 'Cleverence: %1 деректер тізімінің орнату және шығаруы Мобильді құрылғыға'; ro = 'Cleverence: Configurarea și descărcarea dicționarului %1 pe dispozitivul mobil'; ru = 'Клеверенс: Настройка и выгрузка справочника %1 на ТСД'; tr = 'Cleverence: %1 rehberinin Mobil cihaza ayarlanması ve dışa aktarılması'; uk = 'Cleverence: Налаштування та вивантаження довідника %1 на Мобільний пристрій'; uz = ""Cleverence: Ma'lumotnoma %1 ma'lumotnomasini mobil qurilmaga sozlash va yuklash""");
		ТекстЗаголовка = _ЛокКонтекст.ЛокЯдро_СтрШаблон(ТекстЗаголовка, ИмяТаблицы);
		Заголовок = ТекстЗаголовка;
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.НаименованиеУзла) Тогда
			Элементы.НаименованиеУзла.Видимость = Ложь;		
		КонецЕсли;
	#КонецЕсли
	
	ЗаполнитьНастройкиКолонокТаблицыВыборки();
	
    ЗаполнитьНастройкиВыгрузки();
	Если Предпросмотр = Истина Тогда
		КомПанельТаблицыВыборкиЗаполнитьТаблицу();
		ГиперСсылкаНажатие("");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	РезультатСохранения = СохранитьИЗакрытьСервер();
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если НЕ ОписаниеОповещенияОЗакрытии = Неопределено Тогда	
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии,РезультатСохранения);
		КонецЕсли;
	#КонецЕсли
	Закрыть(РезультатСохранения);
КонецПроцедуры

&НаСервере 
Функция СохранитьИЗакрытьСервер()
	НастройкиКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки();	
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, НастройкиКомпоновщика, НазначениеТипаXML.Явное);
	НастройкаКомпоновщикаСтрокой = ЗаписьXML.Закрыть();
	
	РезультатСохранения = Новый Структура;
	РезультатСохранения.Вставить("ИмяТаблицы", ИмяТаблицы);
	РезультатСохранения.Вставить("НастройкаКомпоновщикаСтрокой", НастройкаКомпоновщикаСтрокой);
	
	Возврат РезультатСохранения;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОтмеченныеСтроки(Команда)
	Если НЕ ТаблицаВыборки.Количество() Тогда	
		Сообщение = НСтр("be = 'Калі ласка, спачатку запоўніце табліцу на форме дадзенымі з 1С, націснуўшы на кнопку ""Запоўніць табліцу""'; en = 'Please first fill the table on the form with data from 1C by clicking the ""Fill table"" button'; es = 'Por favor, primero llene la tabla en el formulario con datos de 1C, haciendo clic en el botón ""Llenar tabla""'; ka = 'გთხოვთ, ჯერ შეავსეთ ცხრილი 1C-ში, დაჭერეთ ""ცხრილის შევსება"" ღილაკს'; kk = 'Өтінеміз, алдымен 1С-ден пішіндікті толтырып, ""Таблицаны толтыру"" түймесін басып, формадағы кестені толтырыңыз'; ro = 'Vă rugăm să completați mai întâi tabelul de pe formular cu date din 1C, apăsând butonul ""Completați tabelul""'; ru = 'Пожалуйста, сначала заполните таблицу на форме данными из 1С, нажав на кнопку ""Заполнить таблицу""'; tr = 'Lütfen önce 1C''den formdaki tabloyu ""Tabloyu Doldur"" düğmesine basarak doldurun'; uk = 'Будь ласка, спочатку заповніть таблицю на формі даними з 1С, натиснувши на кнопку ""Заповнити таблицю""'; uz = 'Iltimos, avval 1C dan ma''lumotlar bilan jadvalni to''ldiring, ""Jadvalni to''ldirish"" tugmasini bosing'");
		Сообщить(Сообщение); 
		Возврат;
	КонецЕсли; 
	ТаблицаДляВыгрузкиАдрес = ПодготовитьТаблицуДляВыгрузкиСервер();
		
	_ЛокКонтекст.ЛокЯдро_ВыгрузитьПодготовленнуюТаблицуНаСерверSMARTS(ИмяТаблицы, ТаблицаДляВыгрузкиАдрес,ТипБазы);
КонецПроцедуры

&НаСервере
Функция ПодготовитьТаблицуДляВыгрузкиСервер()
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТЗ = ТаблицаВыборки;
	#Иначе
		ТЗ = РеквизитФормыВЗначение("ТаблицаВыборки");
	#КонецЕсли
	ТаблицаДляВыгрузки = ТЗ.Скопировать(Новый Структура("Выгружать", Истина));
	
	// надо добавить родителей в выгрузку
	// решение может быть пересмотрено, должно работать для складов
	Если ТаблицаДляВыгрузки.Колонки.Найти("Ид") <> Неопределено и ТаблицаДляВыгрузки.Колонки.Найти("ИдРодителя") <> Неопределено Тогда
		
		СтрокиДляДобавления = Новый Соответствие; // удобнее искать повторы
		
		Для каждого СтрокаДляВыгрузки Из ТаблицаДляВыгрузки Цикл
			ТекСтрока = СтрокаДляВыгрузки;
			Пока ТекСтрока <> Неопределено и ЗначениеЗаполнено(ТекСтрока.ИдРодителя) Цикл
				ТекСтрока = ТЗ.Найти(ТекСтрока.ИдРодителя, "Ид");
				Если ТекСтрока <> Неопределено Тогда
					// если уже в таблице для выгрузки или уже отметили, то пропускаем
					Если СтрокиДляДобавления.Получить(ТекСтрока.Ид) = Неопределено и ТаблицаДляВыгрузки.Найти(ТекСтрока.Ид, "Ид") = Неопределено Тогда
						СтрокиДляДобавления.Вставить(ТекСтрока.Ид, ТекСтрока);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для каждого КЗ Из СтрокиДляДобавления Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаДляВыгрузки.Добавить(), КЗ.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	// если оставим эту колонку, то Клеверенс не загрузит такие данные (т.е. массивы данных с колонками, которых нет в Клеверенс), НО И ОШИБКУ НЕ ВЫДАСТ!
	Если ТаблицаДляВыгрузки.Колонки.Найти("Выгружать") <> Неопределено Тогда
		ТаблицаДляВыгрузки.Колонки.Удалить("Выгружать");
	КонецЕсли;
	Возврат ПоместитьВоВременноеХранилище(ТаблицаДляВыгрузки);
КонецФункции

&НаКлиенте
Процедура ВыгрузитьСправочник(Команда)
	
	ПараметрыВыгрузки = ПолучитьПараметрыВыгрузки();
	
	НастройкиКомпоновщикаСтрокой = ПолучитьНастройкиКомпоновщикаСтрокой();
	ПараметрыКомпоновщика = _ЛокКонтекст.ЛокЯдро_ПолучитьЗначенияГлобальныхПараметров();
	_ЛокКонтекст.ЛокЯдро_ВыгрузитьТаблицуНаСерверSMARTS(ИмяТаблицы, НастройкиКомпоновщикаСтрокой, ПараметрыКомпоновщика, ПараметрыВыгрузки);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиКомпоновщикаСтрокой()
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, КомпоновщикНастроек.ПолучитьНастройки(), НазначениеТипаXML.Явное);
	
	СтрокаXML = ЗаписьXML.Закрыть();
	
	Возврат СтрокаXML;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьСправочник(Команда)
	_ЛокКонтекст.ЛокЯдро_ОчиститьТаблицуНаСервереSMARTS(ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиКолонокТаблицыВыборки()
	
	РазмерыКолонок = Новый Структура;
	РазмерыКолонок.Вставить("Алко", 7);
	РазмерыКолонок.Вставить("АлкоКод", 25);
	РазмерыКолонок.Вставить("АлкоКодВ", 10);
	РазмерыКолонок.Вставить("АлкоКрепость", 6);
	РазмерыКолонок.Вставить("АлкоМарк", 9);
	РазмерыКолонок.Вставить("АлкоНаим", 40);
	РазмерыКолонок.Вставить("АлкоНаимВ", 30);
	РазмерыКолонок.Вставить("АлкоОбъем", 11);
	РазмерыКолонок.Вставить("Артикул", 20);
	РазмерыКолонок.Вставить("Весовой", 10);
	РазмерыКолонок.Вставить("Выгружать", 5);
	РазмерыКолонок.Вставить("ДатаСерии", 8);
	РазмерыКолонок.Вставить("ЕстьСерии", 8);
	РазмерыКолонок.Вставить("ИмяСерии", 40);
	РазмерыКолонок.Вставить("ИмяХарактеристики", 40);
	РазмерыКолонок.Вставить("Код", 15);
	РазмерыКолонок.Вставить("Количество", 20);
	РазмерыКолонок.Вставить("Коэффициент", 9);
	РазмерыКолонок.Вставить("Номенклатура", 40);
	РазмерыКолонок.Вставить("НомерСерии", 20);
	РазмерыКолонок.Вставить("Остаток", 20);
	РазмерыКолонок.Вставить("Резерв", 20);
	РазмерыКолонок.Вставить("Родитель", 40);
	РазмерыКолонок.Вставить("ПоХарактеристикам", 10);
	РазмерыКолонок.Вставить("Серия", 40);
	РазмерыКолонок.Вставить("Упаковка", 12);
	РазмерыКолонок.Вставить("ФлагБазовойЕдиницы", 5);
	РазмерыКолонок.Вставить("Характеристика", 40);
	РазмерыКолонок.Вставить("Цена", 15);
	РазмерыКолонок.Вставить("Штрихкод", 18);
	РазмерыКолонок.Вставить("ЭтоГруппа", 8);
	РазмерыКолонок.Вставить("ЭтоПапка", 8);
	
	ЗаголовкиКолонок = Новый Структура;
	ЗаголовкиКолонок.Вставить("АлкоКод", "А.Код");
	ЗаголовкиКолонок.Вставить("АлкоКодВ", "А.Вид");
	ЗаголовкиКолонок.Вставить("АлкоКрепость", "А.%");
	ЗаголовкиКолонок.Вставить("АлкоМарк", "А.Марк");
	ЗаголовкиКолонок.Вставить("АлкоНаим", "А.Наименование");
	ЗаголовкиКолонок.Вставить("АлкоНаимВ", "А.Наименование вида");
	ЗаголовкиКолонок.Вставить("АлкоОбъем", "А.Объем");
	ЗаголовкиКолонок.Вставить("ВидЦены", "Вид цены");
	ЗаголовкиКолонок.Вставить("ВидЦеныВнутр", "Осн. цена");
	ЗаголовкиКолонок.Вставить("Выгружать", "");
	ЗаголовкиКолонок.Вставить("ДатаСерии", "Дата");
	ЗаголовкиКолонок.Вставить("ИмяСерии", "Наименование серии");
	ЗаголовкиКолонок.Вставить("ИмяХарактеристики", "Наименование характеристики");
	ЗаголовкиКолонок.Вставить("ЕстьСерии", "Серии");
	ЗаголовкиКолонок.Вставить("КодФормы", "А.Код формы");
	ЗаголовкиКолонок.Вставить("КонецДействия", "Конец действия");
	ЗаголовкиКолонок.Вставить("Коэффициент", "Коэфф.");
	ЗаголовкиКолонок.Вставить("НачалоДействия", "Начало действия");
	ЗаголовкиКолонок.Вставить("Номенклатура", "Наименование номенклатуры");
	ЗаголовкиКолонок.Вставить("НомерСерии", "Номер");
	ЗаголовкиКолонок.Вставить("ПоХарактеристикам", "Характ.");
	ЗаголовкиКолонок.Вставить("Серия", "Наименование серии");
	ЗаголовкиКолонок.Вставить("ФлагБазовойЕдиницы", "БЕ");
	ЗаголовкиКолонок.Вставить("Характеристика", "Наименование характеристики");
	ЗаголовкиКолонок.Вставить("ЭтоГруппа", "Папка");
	ЗаголовкиКолонок.Вставить("ЭтоПапка", "Папка");
	
	СкрываемыеКолонки = Новый СписокЗначений;
	//СкрываемыеКолонки.Добавить("Ид");
	//СкрываемыеКолонки.Добавить("ИдРодителя");
	//СкрываемыеКолонки.Добавить("ИдНоменклатуры");
	//СкрываемыеКолонки.Добавить("ИдСклада1С");
	//СкрываемыеКолонки.Добавить("ИндексСорт");
	//СкрываемыеКолонки.Добавить("КлючСерий");
	//СкрываемыеКолонки.Добавить("КлючСерийСтрокой");
	//СкрываемыеКолонки.Добавить("КлючХарактеристик");
	//СкрываемыеКолонки.Добавить("КлючХарактеристикСтрокой");
	//СкрываемыеКолонки.Добавить("НаименованиеДляПоиска");
	//СкрываемыеКолонки.Добавить("Производитель");
	//СкрываемыеКолонки.Добавить("ПроизвИНН");
	//СкрываемыеКолонки.Добавить("ПроизвКПП");
	//СкрываемыеКолонки.Добавить("СтатусУказанияСерий");	
	//Если ИмяТаблицы <> "Склады" И ИмяТаблицы <> "Контрагенты" И ИмяТаблицы <> "Остатки" Тогда
	//	СкрываемыеКолонки.Добавить("Наименование");
	//КОнецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиВыгрузки()  Экспорт
	
	ПараметрыВыгрузки = ПолучитьПараметрыВыгрузки();
	АдресСхемыСКД = _ЛокКонтекст.ЛокЯдро_ПолучитьСхемуСКДДляВыгрузкиСправочников(ИмяТаблицы, ПараметрыВыгрузки);
	
	//КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыСКД));
	ИнициализироватьКомпоновщикаИзВременногоХранилища(АдресСхемыСКД);
	// сперва загружаем в компоновщик настройки СКД по умолчанию, т.е. как они заданы в конфигураторе
	// далее, если есть сохраненные настройки - загружаем их
	//ПолучитьСхемуСКДИзХранилища(АдресСхемыСКД);
	
	Если НЕ ЗначениеЗаполнено(НастройкаКомпоновщикаСтрокой) Тогда
		Отбор = Новый Структура("ИмяТаблицы", ИмяТаблицы);
		Если  ID_Узла = _ЛокКонтекст.ДанныеТекущегоУзла.ID_Узла Тогда
			НастройкаКомпоновщикаСтрокой = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаЗначениеТабличнойНастройкиSMARTS("НастройкиОбменаСправочников", Отбор, "НастройкаКомпоновщикаСтрокой");	
		Иначе
			НастройкаКомпоновщикаСтрокой = _ЛокКонтекст.ЛокЯдро_ПолучитьЗначениеТабличнойНастройкиНаСервереSMARTS("НастройкиОбменаСправочников", Отбор, ID_Узла, "НастройкаКомпоновщикаСтрокой");	
		КонецЕсли;
	КонецЕсли;
	Если НЕ НастройкаКомпоновщикаСтрокой = Ложь И ЗначениеЗаполнено(НастройкаКомпоновщикаСтрокой) Тогда
		ЗагрузитьНастройкиКомпоновщикаИзСторки(НастройкаКомпоновщикаСтрокой);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиКомпоновщикаИзСторки(НастройкаКомпоновщикаСтрокой)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(НастройкаКомпоновщикаСтрокой);		
	Попытка
		пНастройкаКомпоновщикаСтрокой = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Исключение
		пНастройкаКомпоновщикаСтрокой = ЗначениеИзСтрокиВнутр(НастройкаКомпоновщикаСтрокой);
	КонецПопытки;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(пНастройкаКомпоновщикаСтрокой);		
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикаИзВременногоХранилища(АдресСхемыСКД)
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыСКД));		
	СхемаСКД = ПолучитьИзВременногоХранилища(АдресСхемыСКД);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаСКД.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура КомПанельТаблицыВыборкиЗаполнитьТаблицу()
	
	ПараметрыВыгрузки = ПолучитьПараметрыВыгрузки();
	
	ПараметрыКомпоновщика = _ЛокКонтекст.ЛокЯдро_ПолучитьЗначенияГлобальныхПараметров();
	ТаблицаВыборкиАдрес = _ЛокКонтекст.ЛокЯдро_ПолучитьДанныеТаблицыДляВыгрузкиНаСерверSMARTS(ИмяТаблицы, КомпоновщикНастроек.Настройки, ПараметрыКомпоновщика, ПараметрыВыгрузки);
	КомПанельТаблицыВыборкиЗаполнитьТаблицуСервер(ТаблицаВыборкиАдрес,ПараметрыКомпоновщика);
	
КонецПроцедуры

&НаСервере
Процедура КомПанельТаблицыВыборкиЗаполнитьТаблицуСервер(ТаблицаВыборкиАдрес,ПараметрыКомпоновщика)
	
	//НастройкиКомпоновщика = КомпоновщикНастроек.Настройки;
		
	ТЗ = ПолучитьИзВременногоХранилища(ТаблицаВыборкиАдрес);	
	//ТаблицаВыборки = _ЛокКонтекст.ЛокЯдро_ПолучитьДанныеТаблицыДляВыгрузкиНаСерверSMARTS(ИмяТаблицы, НастройкиКомпоновщика, ПараметрыКомпоновщика);
	Элементы.КоличествоСтрок.Заголовок = ТЗ.Количество();
	
	УстановитьВидТаблицыВыборки(ТЗ);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидТаблицыВыборки(ТЗ)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТаблицаВыборки = ТЗ;
		ТаблицаВыборки.Колонки.Вставить(0, "Выгружать", Новый ОписаниеТипов("Булево"), "");
		
		Элементы.ТаблицаВыборки.СоздатьКолонки();
		Для Каждого Колонка Из ТаблицаВыборки.Колонки Цикл
			Если СкрываемыеКолонки.НайтиПоЗначению(Колонка.Имя) <> Неопределено Тогда
				Элементы.ТаблицаВыборки.Колонки[Колонка.Имя].Видимость = Ложь;
			КонецЕсли;
			Если Колонка.ТипЗначения.СодержитТип(Тип("Булево")) ИЛИ Колонка.Имя = "ЕстьСерии" ИЛИ Колонка.Имя = "ПоХарактеристикам" ИЛИ Колонка.Имя = "ВидЦеныВнутр" Тогда
				Элементы.ТаблицаВыборки.Колонки[Колонка.Имя].УстановитьЭлементУправления(Тип("Флажок"));
				Элементы.ТаблицаВыборки.Колонки[Колонка.Имя].РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
				Элементы.ТаблицаВыборки.Колонки[Колонка.Имя].Данные = "";
				Элементы.ТаблицаВыборки.Колонки[Колонка.Имя].ДанныеФлажка = Колонка.Имя;
			КонецЕсли;
			Если НЕ Колонка.Имя = "Выгружать" Тогда
				Элементы.ТаблицаВыборки.Колонки[Колонка.Имя].ТолькоПросмотр = Истина;
			КонецЕсли;
			РазмерКолонки = Неопределено;
			Если РазмерыКолонок.Свойство(Колонка.Имя,РазмерКолонки) Тогда
				Элементы.ТаблицаВыборки.Колонки[Колонка.Имя].Ширина = РазмерКолонки;
			КонецЕсли;
			ЗаголовокКолонки = Неопределено;
			Если ЗаголовкиКолонок.Свойство(Колонка.Имя,ЗаголовокКолонки) Тогда
				Элементы.ТаблицаВыборки.Колонки[Колонка.Имя].ТекстШапки = ЗаголовокКолонки;
			КонецЕсли;
		КонецЦикла;
	#Иначе
		ТабВыборки = РеквизитФормыВЗначение("ТаблицаВыборки");
		
		МассивРеквизитов = Новый Массив;
		МассивУдаляемыхРеквизитов = Новый Массив;
		
		Для Каждого Колонка Из ТабВыборки.Колонки Цикл
			Если Колонка.Имя = "Выгружать" Тогда
				Продолжить;
			КонецЕсли;
			ИмяЭлементы = Колонка.Имя;
			ЭлементФ = Элементы.Найти(ИмяЭлементы);
			Если ЭлементФ <> Неопределено Тогда 
				МассивУдаляемыхРеквизитов.Добавить("ТаблицаВыборки."+Колонка.Имя);
				Элементы.Удалить(ЭлементФ);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Колонка Из ТЗ.Колонки Цикл
			
			Если ИмяТаблицы = "ДопРеквизиты" И Колонка.Имя = "ДвоичныеДанныеИзображения" Тогда // реквизит "ДвоичныеДанныеИзображения" имеет тип "ХранилищеЗначения" и не может использоваться в реквизитах управляемой формы	
				Продолжить;
			КонецЕсли; 			
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения,"ТаблицаВыборки"));				
			
		КонецЦикла;
		
		ИзменитьРеквизиты(,МассивУдаляемыхРеквизитов);	
		ИзменитьРеквизиты(МассивРеквизитов);
		
		ТаблицаПолейВыбора = Элементы.ТаблицаВыборки;
		
		Для Каждого Колонка Из ТЗ.Колонки Цикл
			
			Если ИмяТаблицы = "ДопРеквизиты" И Колонка.Имя = "ДвоичныеДанныеИзображения" Тогда // реквизит "ДвоичныеДанныеИзображения" имеет тип "ХранилищеЗначения" и не может использоваться в реквизитах управляемой формы	
				Продолжить;
			КонецЕсли;		
			
			НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ТаблицаПолейВыбора);
			НовыйЭлемент.ПутьКДанным = "ТаблицаВыборки." + Колонка.Имя;
			
			Если СкрываемыеКолонки.НайтиПоЗначению(Колонка.Имя) <> Неопределено Тогда
				НовыйЭлемент.Видимость = Ложь;
			КонецЕсли;
			Если Колонка.ТипЗначения.СодержитТип(Тип("Булево")) ИЛИ Колонка.Имя = "ЕстьСерии" ИЛИ Колонка.Имя = "ПоХарактеристикам" ИЛИ Колонка.Имя = "ВидЦеныВнутр" Тогда
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
				НовыйЭлемент.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
			КонецЕсли;
			Если НЕ Колонка.Имя = "Выгружать" Тогда
				НовыйЭлемент.ТолькоПросмотр = Истина;
			КонецЕсли;
			РазмерКолонки = Неопределено;
			Если РазмерыКолонок.Свойство(Колонка.Имя,РазмерКолонки) Тогда
				Если НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка Тогда
					НовыйЭлемент.ШиринаЭлемента = РазмерКолонки;
				Иначе
					НовыйЭлемент.Ширина = РазмерКолонки;
				КонецЕсли;
			КонецЕсли;
			ЗаголовокКолонки = Неопределено;
			Если ЗаголовкиКолонок.Свойство(Колонка.Имя,ЗаголовокКолонки) Тогда
				НовыйЭлемент.Заголовок = ЗаголовокКолонки;
			КонецЕсли;
			
		КонецЦикла;
		ТЗ.Колонки.Вставить(0, "Выгружать", Новый ОписаниеТипов("Булево"), "");	
		
		ЗначениеВРеквизитФормы(ТЗ,"ТаблицаВыборки");
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьНастройки(Команда)
	
	ПараметрыВыгрузки = ПолучитьПараметрыВыгрузки();

	АдресСхемыСКД = _ЛокКонтекст.ЛокЯдро_ПолучитьСхемуСКДДляВыгрузкиСправочников(ИмяТаблицы, ПараметрыВыгрузки);
	ИнициализироватьКомпоновщикаИзВременногоХранилища(АдресСхемыСКД);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	// Для корректного отображения таблицы выборки при переключении
	// между режимами настройки и предпросмотра
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если Элементы.ПанельТаблицыВыгрузки.Свертка = РежимСверткиЭлементаУправления.Низ Тогда 
			Элементы.ПанельТаблицыВыгрузки.Свертка = РежимСверткиЭлементаУправления.Нет;		
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

// Получает параметры выгрузки справочника
//
// Возвращаемое значение:
//   Структура   - см. ЛокЯдро_ПолучитьПустуюСтруктуруПараметровВыгрузкиСправочника()
//
&НаКлиенте
Функция ПолучитьПараметрыВыгрузки()

	ПараметрыВыгрузки = _ЛокКонтекст.ЛокЯдро_ПолучитьПустуюСтруктуруПараметровВыгрузкиСправочника();
	
	ПараметрыВыгрузки.СпособВыгрузки 				= СпособВыгрузки;
	ПараметрыВыгрузки.ИмяМакетаИО 					= ИмяМакетаИО;
	ПараметрыВыгрузки.ТекстЗапроса 					= ТекстЗапросаВыгрузкиНаТСД;
	ПараметрыВыгрузки.ТекстКодаПолучениеПараметров 	= ТекстКодаПолучениеПараметров;
	ПараметрыВыгрузки.ТаблицаСопоставленияПолей 	= СписокСопоставленияПолей.ВыгрузитьЗначения();
	ПараметрыВыгрузки.ИмяИсточникаДанных 			= ИмяТаблицы;

	Возврат ПараметрыВыгрузки;

КонецФункции

#Область ПечатьЭтикеток

&НаКлиенте
Процедура ПечатьЭтикетки(Команда)
	
	ВыгружаемыеСтроки = ТаблицаВыборки.НайтиСтроки(Новый Структура("Выгружать", ИСТИНА));
	
	КоличествоВыгружаемыхСтрок = ВыгружаемыеСтроки.Количество();
	Если НЕ КоличествоВыгружаемыхСтрок Тогда
		ТекстПредупреждения = НСтр("be = 'Не абрана ні адна пазіцыя для друку!'; en = 'No positions selected for printing!'; es = '¡No se ha seleccionado ninguna posición para imprimir!'; ka = 'არ არის არჩეული არცერთი პოზიცია ბეჭდვისთვის!'; kk = 'Басылу үшін ешқандай элемент таңдалмады!'; ro = 'Nu a fost selectată nicio poziție pentru imprimare!'; ru = 'Не выбрано ни одной позиции для печати!'; tr = 'Yazdırılacak hiçbir pozisyon seçilmedi!'; uk = 'Не обрано жодної позиції для друку!'; uz = 'Chop etish uchun hech qanday pozitsiya tanlanmagan!'");
		ПоказатьПредупреждение(, ТекстПредупреждения, , _ЛокКонтекст.ЛокЯдро_ТекстВнимание()); 
	ИначеЕсли КоличествоВыгружаемыхСтрок > 100 Тогда
		ОП = Новый ОписаниеОповещения("ПечатьЭтикеткиПослеОтветаНаВопрос", ЭтаФорма);
		ТекстВопроса = НСтр("be = 'Для друку выбрана больш за 100 пазіцый. Працягнуць?'; en = 'More than 100 items selected for printing. Continue?'; es = '¿Desea imprimir más de 100 elementos seleccionados? '; ka = 'არჩეული პოზიციების ბეჭდვა 100-ზე მეტია. გსურთ გაგრძელება?'; kk = 'Басқару үшін 100-ден астам позиция таңдалды. Жалғастыру керек пе?'; ro = 'Pentru imprimare au fost selectate peste 100 de poziții. Continuare?'; ru = 'Для печати выбрано более 100 позиций. Продолжить?'; tr = ""Yazdırmak için 100'den fazla pozisyon seçildi. Devam etmek istiyor musunuz?""; uk = 'Для друку обрано більше 100 позицій. Продовжити?'; uz = '100 дан ортиқ элемент чоп этиш учун танланган. Давом этамизми?'");
		ПоказатьВопрос(ОП, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , _ЛокКонтекст.ЛокЯдро_ТекстВнимание()); 
	Иначе	
		НапечататьЭтикетки();	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикеткиПослеОтветаНаВопрос(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		НапечататьЭтикетки();	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЭтикетки()

	АдресТаблицыВыборки = ПолучитьАдресТаблицыВыборки();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяТаблицы", 		ИмяТаблицы);
	СтруктураПараметров.Вставить("ID_Узла", 		ID_Узла);
	СтруктураПараметров.Вставить("ТаблицаВыборки",	_ЛокКонтекст.ЛокЯдро_ТаблицуЗначенийВМассивСтруктур(АдресТаблицыВыборки));
	
	_ЛокКонтекст.ЛокЯдро_НапечататьЭтикетки(СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицыВыборки()

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТЗ = ТаблицаВыборки;
	#Иначе
		ТЗ = РеквизитФормыВЗначение("ТаблицаВыборки");
	#КонецЕсли
		
	// В данный момент интересуют только строки для выгрузки
	ТаблицаКВыгрузке = ТЗ.Скопировать(Новый Структура("Выгружать", Истина));
		
	#Если ТолстыйКлиентОбычноеПриложение Тогда	
		Возврат ПоместитьВоВременноеХранилище(ТаблицаКВыгрузке, Новый УникальныйИдентификатор());
	#Иначе
		Возврат ПоместитьВоВременноеХранилище(ТаблицаКВыгрузке, ЭтаФорма.УникальныйИдентификатор);
	#КонецЕсли
	
КонецФункции

&НаКлиенте
Процедура НастройкаПечати(Команда)

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаНастройки_ПечатьЭтикеток = ПолучитьФорму("ОФ_ФормаНастройки_ПечатьЭтикеток", ЭтаФорма);
	#Иначе
		ФормаНастройки_ПечатьЭтикеток = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаНастройки_ПечатьЭтикеток", , ЭтаФорма, ЭтаФорма);
		ФормаНастройки_ПечатьЭтикеток.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	#КонецЕсли
		
	ФормаНастройки_ПечатьЭтикеток._ЛокКонтекст 			= _ЛокКонтекст;
	ФормаНастройки_ПечатьЭтикеток.КлючНастройки 		= "Настройка_ПечатьЭтикеток";
	ФормаНастройки_ПечатьЭтикеток.ИмяТаблицы			= ИмяТаблицы;
	ФормаНастройки_ПечатьЭтикеток.СписокРеквизитов1С	= ПолучитьСписокКолонокТаблицыВыборки();
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаНастройки_ПечатьЭтикеток.ОткрытьМодально();
	#Иначе
		ФормаНастройки_ПечатьЭтикеток.Открыть();
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКолонокТаблицыВыборки()
	
	СписокКолонок = Новый СписокЗначений;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТабВыборки = ТаблицаВыборки;	
	#Иначе
		ТабВыборки = РеквизитФормыВЗначение("ТаблицаВыборки");
   	#КонецЕсли
	
	Для Каждого Колонка Из ТабВыборки.Колонки Цикл
		Если Колонка.Имя = "Выгружать" 
			ИЛИ ИмяТаблицы = "ДопРеквизиты" И Колонка.Имя = "ДвоичныеДанныеИзображения" Тогда
			Продолжить;
		КонецЕсли;		
		Если СкрываемыеКолонки.НайтиПоЗначению(Колонка.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СписокКолонок.Добавить(Колонка.Имя, Колонка.Имя);
	КонецЦикла;
	СписокКолонок.СортироватьПоЗначению();
	
	Возврат СписокКолонок;
	
КонецФункции

#КонецОбласти

#Если ТолстыйКлиентОбычноеПриложение Тогда
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	Объект = ЭтотОбъект;
#КонецЕсли
