#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Исходящая");
	//ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ЭтоПретензияПоставщику");  
	//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;   
	//ЭлементОтбора.ПравоеЗначение = Истина;   
	//ЭлементОтбора.Использование  = Истина;
	//ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();       
	//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СписокАУ_Направление");
	//ПолеОформления.Использование = Истина;
	//
	//ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Входящая");
	//ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ЭтоПретензияПоставщику");  
	//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;   
	//ЭлементОтбора.ПравоеЗначение = Ложь;   
	//ЭлементОтбора.Использование  = Истина;
	//ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();       
	//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СписокАУ_Направление");
	//ПолеОформления.Использование = Истина;
	
	Список.ПроизвольныйЗапрос = Истина;
	Список.ТекстЗапроса = 
	"ВЫБРАТЬ 
	|	*,
	|	ВЫБОР КОГДА Т.ЭтоПретензияПоставщику ТОГДА ""Исходящая"" ИНАЧЕ ""Входящая"" КОНЕЦ КАК Направление,
	|	ВЫРАЗИТЬ(Т.Комментарий КАК СТРОКА(1000)) КАК КомментарийУрезанный
	|ИЗ Справочник.Претензии КАК Т";
	
	Для каждого стрЭлемент Из Элементы.Список.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(стрЭлемент) = Тип("ПолеФормы") Тогда
			
			стрЭлемент.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "СписокАУ_Направление", "Список", "Направление", 1, "Список.Направление", , , "Статус");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "СписокАУ_Договор", "Список", "Договор", 1, "Список.Договор", , , "ДатаРегистрации");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "СписокАУ_Сумма", "Список", "Сумма претензии", 1, "Список.Сумма", , , "ДатаОкончания");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "СписокАУ_ОписаниеПретензии", "Список", "Описание", 1, "Список.ОписаниеПретензии", , , );
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "СписокАУ_Комментарий", "Список", "Комментарий", 1, "Список.Комментарий", , , );
	
	Элементы.Код.Видимость = Истина;
	Элементы.Статус.Видимость = Истина;
	Элементы.Партнер.Видимость = Истина;
	Элементы.ДатаРегистрации.Видимость = Истина;
	Элементы.ДатаРегистрации.Заголовок = "Дата претензии";
	Элементы.ДатаОкончания.Видимость = Истина;
	Элементы.Наименование.Видимость = Истина;
	Элементы.ПричинаВозникновения.Видимость = Истина;
	Элементы.Ссылка.Видимость = Истина;
	
	Элементы.Переместить(Элементы.Партнер, Элементы.Список, Элементы.СписокАУ_Договор);
	Элементы.Переместить(Элементы.Статус, Элементы.Список, Элементы.Партнер);
	Элементы.Переместить(Элементы.СписокАУ_Направление, Элементы.Список, Элементы.Статус);
	Элементы.Переместить(Элементы.СписокАУ_ОписаниеПретензии, Элементы.Список, Элементы.Ссылка);
	Элементы.Переместить(Элементы.СписокАУ_Комментарий, Элементы.Список, Элементы.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
