&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _КлиентскиеВызовы;

&НаКлиенте
Перем СписокВыбораТипТС;

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьФорму(ФормаКлиентскиеВызовы) Экспорт
	
	_КлиентскиеВызовы = ФормаКлиентскиеВызовы;
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//МассивТиповКонтрагент = Новый Массив;
	//МассивТиповКонтрагент.Добавить(Тип("СправочникСсылка.Контрагенты"));
	//Элементы.рл_ОснАрЛизВлад.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);
	
	//МассивТиповДоговоры = Новый Массив;
	//МассивТиповДоговоры.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	//Элементы.рл_ОснАрЛиз.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповДоговоры);

	УстановитьСписокВыбораТипВлад();
	
	Если Параметры.Свойство("ЗначениеРеквизита") Тогда
		ЗначениеРеквизита = Параметры.ЗначениеРеквизита;
		ЗаполнитьДанныеФормы(ЗначениеРеквизита);             
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяТекущегоЭлемента") Тогда
		
		Попытка
			ЭтаФорма.ТекущийЭлемент = Элементы[Параметры.ИмяТекущегоЭлемента];
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ОбязательныеРеквизиты") Тогда
		
		Попытка
			Для Каждого ОбязательныйРеквизит Из Параметры.ОбязательныеРеквизиты Цикл
				ИмяРеквизита = ОбязательныйРеквизит;
				Если ЭтоРеквизитXML(ИмяРеквизита) Тогда
					ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "рл", "пр");
				КонецЕсли;
				Элементы[ИмяРеквизита].АвтоОтметкаНезаполненного = Истина;
			КонецЦикла;
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	ВидимостьИЗаполнениеАренды();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура рл_РекизитПриИзмененииНаСервере(ЗначениеРеквизита, ИмяРеквизита)
	
	Модифицированность = Истина;
	
	МодульОбъекта = ОбработкаОбъект();
	
	ДанныеОбъекта = МодульОбъекта.ДанныеОбъекта(ЗначениеРеквизита, ИмяРеквизита);
	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеОбъекта, ЭтаФорма, ИмяРеквизита + "_");
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ТипВладПриИзменении(Элемент)

	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();
	ВидимостьИЗаполнениеАренды();

КонецПроцедуры

&НаКлиенте
Процедура рл_ПарТС_ТипНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если СписокВыбораТипТС = Неопределено Тогда
		СписокВыбораТипТС = СписокВыбораТипТС();
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораТипТС", ЭтаФорма);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораТипТС, Оповещение, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораТипТС(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		рл_ПарТС_Тип = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура рл_ПарТС_ТипАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СписокВыбораТипТС = Неопределено Тогда
		СписокВыбораТипТС = СписокВыбораТипТС();
	КонецЕсли; 
	ВыполнитьАвтоПодбор(СписокВыбораТипТС, Текст, Элемент.ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Функция СписокВыбораТипТС()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияТипТС");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

#КонецОбласти

#Область УниверсальныеВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьНачалоВыбораИзСписка(СписокВыбора, Оповещение, ОтображатьПредставление = Истина)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеДляВыбора", СписокВыбора);
	ПараметрыФормы.Вставить("ОтображатьПредставление", ОтображатьПредставление);
	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаВыбораЗначений", ПараметрыФормы, ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвтоПодбор(СписокВыбора, Текст, ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаПоиска = СтрокаПоискаФильтра(Текст, ТекстРедактирования);
	Если СтрокаПоиска = Неопределено Тогда
		ДанныеВыбора = СписокВыбора;//Новый СписокЗначений;
		СтандартнаяОбработка = Ложь;
	Иначе
		ДанныеВыбора = СписокЗначенийНайти(СтрокаПоиска, СписокВыбора); 
		Если ДанныеВыбора.Количество() = 0 Тогда
			СтандартнаяОбработка = Истина;
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СписокЗначенийНайти(СтрокаПоиска, СписокЗначений, РеквизитПоиска = "Представление") Экспорт

	Результат = Новый СписокЗначений;
	Для Каждого Элемент Из СписокЗначений Цикл
		Если Найти(ВРег(Элемент[РеквизитПоиска]), ВРег(СтрокаПоиска)) > 0 Тогда
			Результат.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаКлиенте
Функция СтрокаПоискаФильтра(Текст, ТекстРедактирования) Экспорт

	МинимальноеКоличествоСимволов = 2;
	Если СтрДлина(СокрЛП(Текст)) >= МинимальноеКоличествоСимволов Тогда
		СтрокаПоиска = СокрЛП(Текст);
	ИначеЕсли СтрДлина(СокрЛП(ТекстРедактирования)) >= МинимальноеКоличествоСимволов Тогда
		СтрокаПоиска = СокрЛП(ТекстРедактирования);
	Иначе
		СтрокаПоиска = Неопределено;
	КонецЕсли;

	Возврат СтрокаПоиска;

КонецФункции

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНаСервере();
	ЗначениеРеквизита = ЗначениеРеквизита();
	Закрыть(ЗначениеРеквизита);
	
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизита()

	МодульОбъекта = ОбработкаОбъект();
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма);
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ЗначенияДополнительныхСвойств.Вставить("Ссылка", СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат МодульОбъекта.СериализоватьXML(ЗначенияДополнительныхСвойств);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеФормы(ЗначениеРеквизита)
	
	МодульОбъекта = ОбработкаОбъект();	
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ДанныеТС = МодульОбъекта.ДесериализоватьXML(ЗначениеРеквизита);
	Иначе
		ДанныеТС = Новый Структура;
	КонецЕсли;

	Если ДанныеТС.Свойство("Ссылка") Тогда
		СсылкаНаОбъект = ДанныеТС.Ссылка;     
	КонецЕсли;

	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Элементы.ОбновитьПоСсылке.Видимость = Истина; 
	Иначе
		Элементы.ОбновитьПоСсылке.Видимость = Ложь; 
	КонецЕсли;
	
	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеТС, ЭтаФорма);
		
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		МодульОбъекта = ОбработкаОбъект();
		ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма);
		МодульОбъекта.СохранитьЗначения(СсылкаНаОбъект, ЗначенияДополнительныхСвойств, "СвТС");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораТипВлад()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("1", "Собственность");
	СписокВыбора.Добавить("2", "Совместная собственность супругов");
	СписокВыбора.Добавить("3", "Аренда");
	СписокВыбора.Добавить("4", "Лизинг");
	СписокВыбора.Добавить("5", "Безвозмездное пользование");

	Для Каждого ЭлементСписка Из СписокВыбора Цикл
		Элементы.рл_ТипВлад.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДоговора(Владелец, РеквизитДоговор)

	ИмяСправочника = "ДоговорыКонтрагентов";
	Если Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено Тогда
		// проверим наличие владельца
		Если Метаданные.Справочники[ИмяСправочника].Владельцы.Количество() > 0 Тогда
			ПараметрыВыбора = Новый Массив;
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Владелец));
			ЭтаФорма.Элементы[РеквизитДоговор].ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		// проверим наличие контрагента
		ИначеЕсли Метаданные.Справочники[ИмяСправочника].Реквизиты.Найти("Контрагент") <> Неопределено Тогда
			ПараметрыВыбора = Новый Массив;
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", Владелец));
			ЭтаФорма.Элементы[РеквизитДоговор].ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеЗакрытияФормыРедактирования(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("ИмяРеквизита") Тогда
		Если ЭтоРеквизитXML(ДополнительныеПараметры.ИмяРеквизита) И ТипЗнч(РезультатЗакрытия) = Тип("Строка") Тогда
			ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита] = РезультатЗакрытия;
			ЭтаФорма[КлючПредставление(ДополнительныеПараметры.ИмяРеквизита)] = ЗначениеПредставлениеПоСтрокеXML(РезультатЗакрытия);
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИмяОбработки()
	Возврат ОбработкаОбъект().Метаданные().ПолноеИмя();
КонецФункции

&НаСервере
Процедура ВидимостьИЗаполнениеАренды()
	
	Если рл_ТипВлад = "3"
		Или рл_ТипВлад = "4"
		Или рл_ТипВлад = "5" Тогда
		Элементы.ГруппаАренда.Видимость = Истина;
	Иначе
		Элементы.ГруппаАренда.Видимость = Ложь;
		рл_ОснАрЛиз = Неопределено;
		пр_ОснАрЛиз = Неопределено;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоСсылке(Команда)
	ОбновитьПоСсылкеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоСсылкеНаСервере()

	МодульОбъекта = ОбработкаОбъект();
	ДанныеТС = МодульОбъекта.ДанныеТС(СсылкаНаОбъект, "УчСист");
	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеТС, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей()
	
	МодульОбъекта = ОбработкаОбъект();
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма);
	ДанныеТС = Новый Структура;
	МодульОбъекта.ЗаменитьСсылкиНаСтруктуры(ДанныеТС, ЗначенияДополнительныхСвойств);
	
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	ОбязательныеРеквизиты = Новый Массив;
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		ОбязательныеРеквизиты.Добавить(РеквизитФормы.Имя);	
	КонецЦикла;
	ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Ложь, ОбязательныеРеквизиты);

	ПараметрыВалидацииТС = Новый Структура;
	МодульОбъекта.ПараметрыВалидацииТС(ПараметрыВалидацииТС, "СвТС.ТС");
	ОбязательныеРеквизитыПоФормам = МодульОбъекта.РеквизитыОбязательныхПолейПоФормам(ДанныеТС, ДанныеТС, ПараметрыВалидацииТС.СвТС.ТС);
	ОбязательныеРеквизиты = ОбязательныеРеквизитыФормы("ФормаТранспортногоСредства", ОбязательныеРеквизитыПоФормам);
	
	ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Истина, ОбязательныеРеквизиты);

КонецПроцедуры

&НаСервере
Процедура ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Значение, ОбязательныеРеквизиты)
		
	Для Каждого ИмяРеквизита Из ОбязательныеРеквизиты Цикл
		Попытка
			Если ЭтоРеквизитXML(ИмяРеквизита) Тогда
				ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "рл", "пр");
			КонецЕсли;
			Элементы[ИмяРеквизита].АвтоОтметкаНезаполненного = Значение;
			Элементы[ИмяРеквизита].ОтметкаНезаполненного = Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОбязательныеРеквизитыФормы(ИмяФормы, ОбязательныеРеквизитыПоФормам)
	
	Результат = Новый Массив;
	
	Если ТипЗнч(ОбязательныеРеквизитыПоФормам) = Тип("Структура")
		И ОбязательныеРеквизитыПоФормам.Свойство(ИмяФормы) Тогда
		Результат = ОбязательныеРеквизитыПоФормам[ИмяФормы];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

&НаКлиенте
Процедура пр_ОснАрЛизНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораОснАрЛиз", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Данные = ДесериализоватьXML(рл_ОснАрЛиз);
	Если Данные.Свойство("Ссылка") И ЗначениеЗаполнено(Данные.Ссылка) Тогда
		
		Договор = Данные.Ссылка;
		Контрагент = КонтрагентДоговора(Договор);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Владелец", Контрагент);
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ПараметрыФормы.Вставить("Контрагент", Контрагент);
		
		ФормаВыбора = ПолучитьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = Оповещение;  
		ФормаВыбора.Открыть();	
		
	Иначе
		//сначала выбираем контрагента, потом договор
		Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораОснАрЛизВлад", ЭтаФорма);
		ФормаВыбора = ПолучитьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = Оповещение;  
		ФормаВыбора.Открыть();	
	КонецЕсли;
	
КонецПроцедуры

Функция КонтрагентДоговора(Договор)
	
	Результат = Неопределено;
	ДанныеКонтрагента = Новый Структура("Контрагент, Владелец");
	ЗаполнитьЗначенияСвойств(ДанныеКонтрагента, Договор);
	Результат = ?(ЗначениеЗаполнено(ДанныеКонтрагента.Контрагент), ДанныеКонтрагента.Контрагент, ДанныеКонтрагента.Владелец);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура Оповещение_ПослеВыбораОснАрЛиз(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		МодульОбъекта = ОбработкаОбъект();
		ДанныеДоговора = МодульОбъекта.ДанныеДоговора(РезультатЗакрытия);
		ЭтаФорма["рл_ОснАрЛиз"] = МодульОбъекта.СериализоватьXML(ДанныеДоговора);
		ЭтаФорма["пр_ОснАрЛиз"] = МодульОбъекта.ЗначениеПредставление(ДанныеДоговора);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораОснАрЛизВлад(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		
		Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораОснАрЛиз", ЭтаФорма);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		Отбор = Новый Структура;
		Отбор.Вставить("Владелец", РезультатЗакрытия);
		ПараметрыФормы.Вставить("Отбор", Отбор);
 		ПараметрыФормы.Вставить("Контрагент", РезультатЗакрытия);

		ФормаВыбора = ПолучитьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = Оповещение;  
		ФормаВыбора.Открыть();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура пр_ОснАрЛизОчистка(Элемент, СтандартнаяОбработка)

	рл_ОснАрЛиз = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура пр_ОснАрЛизОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеРеквизита", рл_ОснАрЛиз);
	//ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизитыФормы("ФормаДоговора"));
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", "рл_ОснАрЛиз");
	ДополнительныеПараметры.Вставить("ЗначениеРеквизита", рл_ОснАрЛиз);

	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаДоговора", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

#Область XMLВспомогательныеФункции

&НаСервереБезКонтекста
Функция ДесериализоватьXML(СтрокаXML)
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.УстановитьСтроку(СтрокаXML);
		Значение = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Исключение
		Значение = Новый Структура;
	КонецПопытки;
	
	Возврат Значение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитыXML()
	
	Результат = Новый Массив;
	Результат.Добавить("рл_ОснАрЛиз");
	//Результат.Добавить("рл_ОснАрЛизВлад");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРеквизитXML(ИмяРеквизита)
	
	РеквизитыXML = РеквизитыXML();
	Если РеквизитыXML.Найти(ИмяРеквизита) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция КлючПредставление(Ключ)
	
	Результат = СтрЗаменить(Ключ, "рл_", "пр_");
	Возврат Результат;

КонецФункции

&НаСервере
Функция ЗначениеПредставлениеПоСтрокеXML(РезультатЗакрытия)
	
	МодульОбъекта = ОбработкаОбъект();
	Возврат МодульОбъекта.ЗначениеПредставлениеПоСтрокеXML(РезультатЗакрытия);
	
КонецФункции

#КонецОбласти