// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТоварыХарактеристика.Видимость = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики()
												И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяХарактеристики") = Истина;
	
	ПриИзмененииОтправителяШаблона();
	
	Если Не ЗначениеЗаполнено(Объект.ДокументЭТРН.ДатаТрН) Тогда
		
		ПроставитьВЭТРН(Объект.ДокументЭТРН, "ДатаТрН", ТекущаяДатаСеанса());
		
		Если Не ЗначениеЗаполнено(Объект.ДокументЭТРН.НомерТрН) Тогда 
			ПроставитьВЭТРН(Объект.ДокументЭТРН, "НомерТрН", Формат(Объект.ДокументЭТРН.Номер, "ЧГ="));
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьДанныеФормы();
	
	Элементы.ДокументОснование.Доступность = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ТипыДокументаОснованияНастроеныДляТитула(1);
	
	РазблокироватьДанныеФормыДляРедактирования();
	
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	
	// Нужен для удаления организации из ТЧ дополнительных получателей файла
	ПредОтправительШаблона = Объект.ОтправительШаблона;
	ПредСоставитель = Объект.Составитель;
	
	ЗаполнитьДатыПогрузкиЛокальные();
	ОбработатьСпособСозданияДокумента();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Баги старой платформы при отрисовке сложных группировок:
	// в режиме интерфейса 8.2 отображаем в режиме "на отдельных закладках" шапку и тч
	ШапкаНаОтдельнойЗакладке = Истина;
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоИнтерфейс82() Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШапка;
		Элементы.Группа16.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.Группа14.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ГруппаОграничения.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
	ПроверитьДокумент();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
	// начальное отображение реквизитов
	Если Не ЗначениеЗаполнено(Объект.Водитель2) Тогда 
		Элементы.ГруппаВодитель2.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РедактированиеЭТРН_Прицеп2) Тогда 
		Элементы.ГруппаПрицеп2.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РедактированиеЭТРН_Прицеп) Тогда 
		Элементы.ГруппаПрицеп.Видимость = Ложь;
		Элементы.ГруппаКомандаДобавитьПрицеп.Видимость = Истина;
	Иначе
		Элементы.ГруппаКомандаДобавитьПрицеп.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьЗаголовкиГруппамДопПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И (Параметр = Объект.Ссылка Или (Параметр <> Неопределено
																							И ТипЗнч(Параметр) = Тип("Массив")
																							И Параметр.Найти(Объект.Ссылка) <> Неопределено)) Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();

	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи"
			  И Параметр <> Неопределено
			  И ТипЗнч(Параметр) = Тип("Массив")
			  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда

		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли  ИмяСобытия = "ЗавершениеФоновогоЗадания" 
			И Параметр <> Неопределено
			И ТипЗнч(Параметр) = Тип("Структура")
			И Параметр.Свойство("КлючФЗ")
			И Параметр.КлючФЗ = "Выполнение обмена колбаса" Тогда
			
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);

	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов"
			  И Параметр <> Неопределено
			  И ТипЗнч(Параметр) = Тип("Массив")
			  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда

		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
			
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПерепроверитьДокумент" Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьДокумент", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьВодителяПоУмолчанию" 
		И Параметр <> Неопределено
		И ТипЗнч(Параметр) = Тип("Структура") Тогда
		
		Объект.Водитель = Параметр.ВодительПоУмолчанию;
		Объект.Водитель2 = Параметр.Водитель2ПоУмолчанию;
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПунктМаршрута"
		И Параметр = РедактированиеЭТРН_МестоПогрузки Тогда
		
		ОбновитьЧасовыеПоясаМестаПогрузки();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЧасовыеПоясаМестаПогрузки()
	
	Перем НовыйЧасовойПояс;
	
	НовыйЧасовойПояс = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
	РедактированиеЭТРН_МестоПогрузки, "ЧасовойПояс");
	Если ЧасовойПоясПогрузки <> НовыйЧасовойПояс Тогда
		// Пересчитаем время
		ДатаВремяПодачиПлановая = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
		ДатаВремяПодачиПлановая, ЧасовойПоясПогрузки, НовыйЧасовойПояс);
		ДатаВремяПрибытия = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
		ДатаВремяПрибытия, ЧасовойПоясПогрузки, НовыйЧасовойПояс);
		ДатаВремяУбытия = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
		ДатаВремяУбытия, ЧасовойПоясПогрузки, НовыйЧасовойПояс);
		
		ЧасовойПоясПогрузки = НовыйЧасовойПояс;
		Элементы.ГруппаДатыИМеста.Заголовок = ЗаголовокДатИВременПогрузки(ЧасовойПоясПогрузки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ЗаполнитьТребуемыеДействияТоваров();
	Оповестить("КонтурЛогистика_ВвестиДокумент");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСпособСозданияДокумента();
	
	Если Параметры.Свойство("СозданВручную") Тогда
		Объект.СозданВручную = Параметры.СозданВручную;
		ЭтаФорма.ТекущийЭлемент = Элементы.РедактированиеЭТРН_НомерТрН;
	Иначе 
		ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1;
		НК_ДляРучногоВвода = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьНастройкуКонвертацииТ1РучногоВвода(ТипЛогистическогоДокумента); 
		Объект.СозданВручную = ЗначениеЗаполнено(НК_ДляРучногоВвода) И Не ЗначениеЗаполнено(Объект.ДокументОснование);	 
	КонецЕсли;
		
КонецПроцедуры	 

&НаКлиенте
Процедура ПерезаполнитьПоДокОснованию(Команда)

	СписокКнопок = Новый СписокЗначений();
	СписокКнопок.Добавить("Да, и ЭТрН и Титул");
	СписокКнопок.Добавить("Да, только Титул");
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);

	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика("Полностью перезаполнить по документу-основанию?",
																  СписокКнопок,
																  "Подтвердите операцию",
																  ,
																  ЭтаФорма,
																  "ОбработчикСогласияПерезаполнения");

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласияПерезаполнения(Ответ, ДопПараметр = Неопределено) Экспорт

	Если Ответ = "Да, и ЭТрН и Титул" Тогда
		ПерезаполнитьПоДокОснованиюСервер(Истина);
		ОбновитьДанныеФормы();
	ИначеЕсли Ответ = "Да, только Титул" Тогда
		ПерезаполнитьПоДокОснованиюСервер(Ложь);
		ОбновитьДанныеФормы();
	КонецЕсли;

	Элементы.ПерезаполнитьПоДокОснованию.ЦветТекста = ЦветаСтиляЦветТекстаФормы();
	ОбновитьОтображениеДанных();
	ПолностьюОбновитьПредставлениеДанных();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦветаСтиляЦветТекстаФормы()
	
	Возврат ЦветаСтиля.ЦветТекстаФормы;
	
КонецФункции

&НаКлиенте
Процедура ОтправительШаблонаПриИзменении(Элемент)

	ПриИзмененииОтправителяШаблона();

КонецПроцедуры

&НаКлиенте
Процедура ОтправительШаблонаДопПриИзменении(Элемент)

	ПриИзмененииОтправителяШаблона();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()

	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.ДокументЭТРН);
	КодТекущегоСтатусаДокументооборота = ТекущийСтатусДокументооборота.Код;
	КрайнийФайл = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(Объект.Ссылка);
	
	ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1;
	
	НастройкаКонвертацииДляРучногоВвода = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьНастройкуКонвертацииТ1РучногоВвода(ТипЛогистическогоДокумента); 
	РучнойВвод = Объект.СозданВручную;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена
		 Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда
		ПерешелВЛогистическиеСтатус = Истина;
	Иначе
		ПерешелВЛогистическиеСтатус = Ложь;
	КонецЕсли;
	Элементы.ТекущийСтатус.Видимость = Не ПерешелВЛогистическиеСтатус;
	Элементы.ТекущийСтатусДокументооборота.Видимость = ПерешелВЛогистическиеСтатус;

	ПересчитатьЗаголовкиКоличества(ЭтаФорма);

	// Элементы.ДокументЭТРНПогрузкаСотрудник.Видимость = ЗначениеЗаполнено(Объект.ДокументЭТРН.ПогрузкаСотрудник);
	
	ЕстьЭЗЗ = ЗначениеЗаполнено(Объект.ДокументЭТРН.ЗаказЗаявкаОснование);
	Элементы.ДокументЭТРНЗаказЗаявкаОснование.Видимость = ЕстьЭЗЗ;
	Элементы.ДокументЭТРННомЗак.Видимость 				= НЕ ЕстьЭЗЗ И ЗначениеЗаполнено(Объект.ДокументЭТРН.НомЗак);
	Элементы.ДокументЭТРНДатаЗак.Видимость 				= НЕ ЕстьЭЗЗ И ЗначениеЗаполнено(Объект.ДокументЭТРН.ДатаЗак);
	
	Элементы.ДокументЭТРНПрицеп.Видимость = ЗначениеЗаполнено(Объект.ДокументЭТРН.Прицеп);
	Элементы.ДокументЭТРНПрицеп2.Видимость = ЗначениеЗаполнено(Объект.ДокументЭТРН.Прицеп2);
	
	Элементы.РедактированиеЭТРН_НомерТрН.Видимость = НЕ ЗначениеЗаполнено(Объект.ДокументЭТРН.НомерТрН);
	Элементы.РедактированиеЭТРН_ДатаТрН.Видимость = НЕ ЗначениеЗаполнено(Объект.ДокументЭТРН.ДатаТрН);
	
	УИД_ТрН = Объект.ДокументЭТРН.УИД;
	
	Элементы.ГруппаЭкспедиция.Видимость = Объект.ДокументЭТРН.ЭтоЭкспедиция = Истина;
	
	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = ЭтоВходящий И Не ЕстьДокУчСист;

	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		 Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка
		 Или (ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен И Справочники.КонтурЛогистика_ФайлыОбмена.ЭтоВходящийНеподписанный(КрайнийФайл))
		 Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		 ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена Тогда
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
	КонецЕсли;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;
	
	Элементы.ПерезаполнитьПоДокОснованию.Видимость = (Не ЭтоВходящий И (ЕстьДокУчСист Или РучнойВвод))
													Или (ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
														И ТекущийСтатусДокументооборота = КонтурЛогистика_ОбработкаДокументовСервер.НайтиСостояниеДОПоКоду("r-wait-storekeeper"));
	Элементы.ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = Не ЕстьДокУчСист;
	
	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(
		Объект.Ссылка, Объект.ДокументОснование,
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус, ТребуемоеДействие);
	
	Если Объект.ЭтоПрототип Или (ЗначениеЗаполнено(Объект.Составитель) И Объект.Составитель <> Объект.ДокументЭТРН.Грузоотправитель) Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Отправить прототип в сервис";
	ИначеЕсли ЗначениеЗаполнено(Объект.ОтправительШаблона) Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Отправить шаблон грузоотправителю";
	КонецЕсли;
	
	// Погрузка, Отказ
	Если КодТекущегоСтатусаДокументооборота = "r-rejected" Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Создать Титул 1 с уточнениями";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = Истина;
	КонецЕсли;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда
		НастройкаКонвертации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьНастройкуКонвертации(ТипЛогистическогоДокумента);
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость =
			КонтурЛогистика_ОбработкаДокументовСервер.ДокументМожноОтправлять(Объект.Ссылка, НастройкаКонвертации);
	КонецЕсли;
	
	ДоступностьQR = ЗначениеЗаполнено(Объект.ДокументЭТРН.kl_id);
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьQRКод.Видимость = ДоступностьQR;
	
	ЗаполнитьВспомогательныеРеквизитыРедактированияЭТРН();
			
	ОтрисоватьДокументыОснованияСервер();
	
	СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы.Видимость = СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы;
	 	
	КомментарииВодителяПриПогрузке = Объект.ДокументЭТРН.КомментарииВодителяПриПогрузке;
	Элементы.КомментарииВодителяПриПогрузке.Видимость = ЗначениеЗаполнено(КомментарииВодителяПриПогрузке);
	
	Если Элементы.Найти("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаСогласованиеВодителюПанель") <> Неопределено Тогда
		Если ЗначениеЗаполнено(КомментарииВодителяПриПогрузке) Тогда
			
			Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаСогласованиеВодителюПанель.Видимость =
				(Не ТолькоПросмотр
					И (ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание
						Или ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный));
			
		Иначе
			Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаСогласованиеВодителюПанель.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтрисоватьДокументыОснованияСервер()
	
	КоличествоОснований = Объект.ДокументыОснования.Количество();
	Если КоличествоОснований > 1 Тогда 
		Элементы.ДекорацияНесколькоОснований.Видимость = Истина;
		Элементы.ДокументОснование.Видимость = Ложь;
		Элементы.ДекорацияНесколькоОснований.Заголовок = "" + КоличествоОснований + " документов-оснований";
	Иначе
		Элементы.ДекорацияНесколькоОснований.Видимость = Ложь;
		Элементы.ДокументОснование.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтрисоватьДокументыОснованияКлиент()
	
	КоличествоОснований = Объект.ДокументыОснования.Количество();
	Если КоличествоОснований > 1 Тогда 
		Элементы.ДекорацияНесколькоОснований.Видимость = Истина;
		Элементы.ДокументОснование.Видимость = Ложь;
		Элементы.ДекорацияНесколькоОснований.Заголовок = "" + КоличествоОснований + " документов-оснований";
	Иначе
		Элементы.ДекорацияНесколькоОснований.Видимость = Ложь;
		Элементы.ДокументОснование.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВспомогательныеРеквизитыРедактированияЭТРН()

	ДокЭТРН = Объект.ДокументЭТРН;
	
	Если ЗначениеЗаполнено(ДокЭТРН) Тогда 
		
		РедактированиеЭТРН_ТранспортноеСредство = ДокЭТРН.ТранспортноеСредство;
		РедактированиеЭТРН_Прицеп = ДокЭТРН.Прицеп;
		РедактированиеЭТРН_Прицеп2 = ДокЭТРН.Прицеп2;
		РедактированиеЭТРН_ПогрузкаСотрудник = ДокЭТРН.ПогрузкаСотрудник;
		РедактированиеЭТРН_МестоПогрузки = ДокЭТРН.МестоПогрузки;
		РедактированиеЭТРН_МестоДоставки = ДокЭТРН.МестоДоставки;
		
		РедактированиеЭТРН_Грузоотправитель = ДокЭТРН.Грузоотправитель;
		РедактированиеЭТРН_Перевозчик = ДокЭТРН.Перевозчик;
		РедактированиеЭТРН_Грузополучатель = ДокЭТРН.Грузополучатель;
		РедактированиеЭТРН_ПогрузкуОсуществляет = ДокЭТРН.ПогрузкуОсуществляет;
		
		РедактированиеЭТРН_НомерТрН = ДокЭТРН.НомерТрН;
		РедактированиеЭТРН_ДатаТрН = ДокЭТРН.ДатаТрН;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер(ПерезаполнятьЭТРН = Ложь)

	Если Не Объект.СозданВручную Тогда
		Объект.Товары.Очистить();
		Объект.Маркировки.Очистить();
		Объект.ОпасныеГрузы.Очистить();
		Объект.Контейнеры.Очистить();
		Объект.ТелефоныПереадресующего.Очистить();
		Объект.ДополнительныеВодители.Очистить();
		Объект.СведенияГосСистем.Очистить();
		Объект.ИнфПол.Очистить();
	КонецЕсли;
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование", ДокОбъект.ДокументОснование);
	ДанныеЗаполнения.Вставить("ТипЛогистика", Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1);
	ДанныеЗаполнения.Вставить("Разделитель", ДокОбъект.Разделитель);
	ДанныеЗаполнения.Вставить("ПерезаполнитьГлавныйДокументЕслиСуществует", ПерезаполнятьЭТРН);
	
	ДокОбъект.Заполнить(ДанныеЗаполнения);
	
	СвязанныйДокумент = РегистрыСведений.КонтурЛогистика_СвязиДокументов.СвязанныйДокумент(Объект.Ссылка);
	Если СвязанныйДокумент.ДокументПодчиненный = Объект.Ссылка Тогда
		НастройкиСвязи = Справочники.КонтурЛогистика_НастройкиСвязейДокументов.НастройкиСвязиДокументовПодчиненных(
			СвязанныйДокумент.ТипДокументаПодчиненный);
		Для Каждого ТекущаяНастройка Из НастройкиСвязи Цикл
			Если ТекущаяНастройка.ТипДокументаОсновной = СвязанныйДокумент.ТипДокументаОсновной
				И ТекущаяНастройка.ТипДокументаПодчиненный = СвязанныйДокумент.ТипДокументаПодчиненный
				И ТекущаяНастройка.РасчетОснованияЗаполнения_Расчитывать
				И ЗначениеЗаполнено(ТекущаяНастройка.НастройкиКонвертацииПодчиненного) Тогда
				
				// Заполним из конверации связей
				КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
					ДокОбъект, ТекущаяНастройка.НастройкиКонвертацииПодчиненного, СвязанныйДокумент.ДокументОсновной,, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	Модифицированность = Истина;
		
	ПриИзмененииОтправителяШаблона();

КонецПроцедуры

&НаКлиенте
Процедура ПолностьюОбновитьПредставлениеДанных()

	//УстановитьТипыЗначенийРеквизитов(); // TODO

	ОповеститьОбИзменении(Объект.ДокументЭТРН);
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();

	ЗаполнитьТребуемыеДействияТоваров();
	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();

КонецПроцедуры

// УПРАВЛЕНИЕ ВИДИМОСТЬЮ И ДОСТУПНОСТЬЮ
&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()

	УстановитьПоложениеСохраняемыхЭлементов();
	УстановитьФорматыКолонокСКоличеством();

	УстановитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	РеквизитыЭТРН = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
		Объект.ДокументЭТРН, "Грузоотправитель, ПогрузкуОсуществляет");
	Элементы.ГруппаОтправляющийСклад.Видимость =
		(ЗначениеЗаполнено(РеквизитыЭТРН.ПогрузкуОсуществляет) И РеквизитыЭТРН.ПогрузкуОсуществляет <> РеквизитыЭТРН.Грузоотправитель);
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("БратьУИДИзПулаДляТРН") Тогда

		Элементы.УИД_ТрН.ПодсказкаВвода = "взять из пула";

	Иначе

		Элементы.УИД_ТрН.ПодсказкаВвода = "получим после отправки";

	КонецЕсли;

	Элементы.РазделительИндикатор.Видимость = ЗначениеЗаполнено(Объект.Разделитель);
	
	УстановитьВидимостьНоменклатуры();
		
	Элементы.ГруппаСоставитель.Видимость = Объект.ЭтоПрототип;
	Элементы.Составитель.Видимость = ЗначениеЗаполнено(Объект.Составитель);
	
	СкрытьПоказатьЗначенияДокУчСист();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНоменклатуры()
	
	// видимость номенклатуры в зависимости от того есть ли там номенклатура (она есть если отправляли Т1 из этой базы) 
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьВидимостьКолонкиПоЗаполненностиЗначения(Объект.Товары, "Номенклатура", Элементы.ТоварыГруппаНоменклатура);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьВидимостьКолонкиПоЗаполненностиЗначения(Объект.Товары, "Номенклатура", Элементы.ТоварыХарактеристика);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьВидимостьКолонкиПоЗаполненностиЗначения(Объект.Товары, "Номенклатура", Элементы.ТоварыГруппаЕдиницы);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФорматыКолонокСКоличеством()

	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары,
																			 "МассаПлановаяНеттоКг",
																			 Элементы.ТоварыМассаПлановаяНеттоКг);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары,
																			 "МассаПлановаяБруттоКг",
																			 Элементы.ТоварыМассаПлановаяБруттоКг);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары,
																			 "Количество",
																			 Элементы.ТоварыКоличество);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары,
																			 "Плотность",
																			 Элементы.ТоварыПлотность);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеСохраняемыхЭлементов()

	УстановитьВидимостьНеучитываемыхИФильтраОшибок();
	УстановитьПоложениеШапки();
	УстановитьСвернутостьПодробностейОТоварах();

КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормыВЗависимостиОтСтатуса()
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен
		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке")
		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена")
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением
		Или ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ОтправитьЧерновик
		Или ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание
		Или ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю
		Или (ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный
			И ЗначениеЗаполнено(КомментарииВодителяПриПогрузке)) Тогда
		
		ТолькоПросмотр = Ложь;
		Элементы.ГруппаИсправление.Видимость = Объект.НомИспр > 0;
		Если Элементы.Найти("ВнестиИсправлениеТитула") <> Неопределено Тогда
			Элементы.ВнестиИсправлениеТитула.Видимость = Ложь;
		КонецЕсли;
		
		Если Объект.НомИспр > 0 Тогда
			
			Для Каждого ИмяЭлемента Из Документы.КонтурЛогистика_ТрН_Титул1.МассивЭлементовНедоступныхДляИсправления() Цикл
				
				Элемент = Элементы.Найти(ИмяЭлемента);
				Если Не Элемент = Неопределено Тогда
					Элемент.Доступность = Ложь;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// особенности поведения формы для полученного титула - если сценарий предусматривает подписание - надо проставить подписанта
		Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда
			
			НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
				Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, Объект.ДокументОснование);
			КрайнийФайлДокумента = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(Объект.Ссылка);
			
			Если ЗначениеЗаполнено(НастройкаКонвертации)
				И (НастройкаКонвертации.Сценарий_РазрешитьПодписыватьПолученныйЧерновик
					Или НастройкаКонвертации.Сценарий_ОтправлятьНеподписанный)
				И НастройкаКонвертации.ПодписантТекущийПользователь
				И КрайнийФайлДокумента <> Неопределено
				И Не КрайнийФайлДокумента.ПодписьВерна Тогда
				
				ТолькоПросмотр = Ложь;
				Элементы.ГруппаИсправление.Видимость = Ложь;
				Попытка
					Объект.ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
					ЭтаФорма.Модифицированность = Истина;
				Исключение
				КонецПопытки;
				
			Иначе
				
				ТолькоПросмотр = Истина;
				Элементы.ГруппаИсправление.Видимость = Истина;
				Если Элементы.Найти("ВнестиИсправлениеТитула") <> Неопределено Тогда
					Элементы.ВнестиИсправлениеТитула.Видимость = (Не ЗначениеЗаполнено(Объект.ОтправительШаблона)
						И ТребуемоеДействие <> Перечисления.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный
						И Объект.ДокументЭТРН.Грузоотправитель.Наш);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ТолькоПросмотр = Истина;
		Элементы.ГруппаИсправление.Видимость = Не ЗначениеЗаполнено(Объект.ОтправительШаблона);
		Если Элементы.Найти("ВнестиИсправлениеТитула") <> Неопределено Тогда
			Элементы.ВнестиИсправлениеТитула.Видимость = (Не ЗначениеЗаполнено(Объект.ОтправительШаблона)
				И ТребуемоеДействие <> Перечисления.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный
				И Объект.ДокументЭТРН.Грузоотправитель.Наш);
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ТоварыСкопировать.Видимость 					= Не ТолькоПросмотр;
	Элементы.ТоварыДобавить.Видимость 						= Не ТолькоПросмотр;
	Элементы.ТоварыГруппаТребуемоеДействие.Видимость 		= Не ТолькоПросмотр;
	Элементы.ТоварыГруппаУправление.Видимость 				= Не ТолькоПросмотр;
	Элементы.ОтметкиОтметкиДобавить.Видимость 				= Не ТолькоПросмотр;
	Элементы.ОтметкиОтметкиСкопировать.Видимость 			= Не ТолькоПросмотр;
	Элементы.ПерезаполнитьПоДокОснованию.Видимость 			= Не ТолькоПросмотр;
	Элементы.УстановитьДатуВремяПрибытияТекущим.Видимость 	= Не ТолькоПросмотр;
	Элементы.УстановитьДатуВремяУбытияТекущим.Видимость 	= Не ТолькоПросмотр;
	
	УстановитьДоступностьКоманд(Не ТолькоПросмотр);
	
	// Погрузка, Отказ
	Если КодТекущегоСтатусаДокументооборота = "r-rejected" Тогда
		Элементы.ГруппаИсправление.Видимость = Ложь;
		Если Элементы.Найти("ВнестиИсправлениеТитула") <> Неопределено Тогда
			Элементы.ВнестиИсправлениеТитула.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКоманд(Доступность)
	
	УстановитьДоступностьЭлемента("ФормаЗаписать", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_СформироватьФайлыОбмена", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаПодписание", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПередатьНаСогласованиеВодителю", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИПодготовитьКОтправке", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПропуститьДокумент", Доступность);
	УстановитьДоступностьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОбработатьВходящийДокумент", Доступность);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлемента(ИмяЭлемента, Доступность)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйЭлемент.Доступность = Доступность;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОтправителяШаблона()

	ОтправительШаблонаУправлениеВидимостью();
	ИзменитьДопПолучателя(Объект.ОтправительШаблона, ПредОтправительШаблона);

	ПредОтправительШаблона = Объект.ОтправительШаблона;

КонецПроцедуры

&НаСервере
Процедура ОтправительШаблонаУправлениеВидимостью()

	Элементы.ГруппаОтправительШаблона.Видимость = ЗначениеЗаполнено(Объект.ОтправительШаблона);

КонецПроцедуры

&НаСервере
Процедура ИзменитьДопПолучателя(НовыйДопПолучатель, ПредДопПолучатель)

	Если ЗначениеЗаполнено(НовыйДопПолучатель) 
		И Не НовыйДопПолучатель = ПредДопПолучатель  
		И Не Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ЯвляетсяУчастникомПеревозки(НовыйДопПолучатель, Объект.ДокументЭТРН) Тогда

		нСтроки = Объект.ДополнительныеПолучателиФайла.НайтиСтроки(Новый Структура("ОрганизацияДиадок", НовыйДопПолучатель));
		Если Не нСтроки.Количество() Тогда
			НовыйПолучатель = Объект.ДополнительныеПолучателиФайла.Добавить();
			НовыйПолучатель.ОрганизацияДиадок = НовыйДопПолучатель;
		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(ПредДопПолучатель) И Не НовыйДопПолучатель = ПредДопПолучатель Тогда
		нСтроки = Объект.ДополнительныеПолучателиФайла.НайтиСтроки(Новый Структура("ОрганизацияДиадок", ПредДопПолучатель));
		Для Каждого НайденнаяСтрока Из нСтроки Цикл
			Объект.ДополнительныеПолучателиФайла.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Управление положением подробных сведений о товаре

&НаКлиенте
Процедура СвернутьПодробныеСведенияНажатие(Элемент)

	СкрытьПодробностиТоваров = Истина;
	УстановитьСвернутостьПодробностейОТоварах();

КонецПроцедуры

&НаКлиенте
Процедура КнопкаРазвернутьПодробностиТоваровНажатие(Элемент)

	СкрытьПодробностиТоваров = Ложь;
	УстановитьСвернутостьПодробностейОТоварах();

КонецПроцедуры

// Вспомогательные для Обработчики команд

&НаКлиенте
Процедура УстановитьСвернутостьПодробностейОТоварах()

	Элементы.ГруппаПодробныеСведенияСвернутая.Видимость = СкрытьПодробностиТоваров;
	Элементы.ГруппаПодробныеСведения.Видимость = Не Элементы.ГруппаПодробныеСведенияСвернутая.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)

	ОтборСтрок = Неопределено;

	Если Не Элемент.ТекущиеДанные = Неопределено Тогда

		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиТоваров",
												  Элемент.ТекущиеДанные.ИдентификаторСтроки);

	КонецЕсли;

	Элементы.СведенияГосСистем.ОтборСтрок 	= ОтборСтрок;
	Элементы.Маркировки.ОтборСтрок 			= ОтборСтрок;
	Элементы.Контейнеры.ОтборСтрок 			= ОтборСтрок;
	Элементы.ОпасныеГрузы.ОтборСтрок 		= ОтборСтрок;

	КонтурЛогистика_ПанельОшибокКлиент.УстановитьОтборТаблицыОшибокПоНомеруСтроки(ТаблицаОшибок,
																				  Элементы.Товары.ТекущиеДанные);

КонецПроцедуры

// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьШапку(Команда)

	ШапкаНаОтдельнойЗакладке = Истина;
	УстановитьПоложениеШапки();

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьШапку(Команда)

	//ШапкаНаОтдельнойЗакладке = Ложь;
	//УстановитьПоложениеШапки();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеШапки()

	Если ШапкаНаОтдельнойЗакладке Тогда

		текАктивнаяЗакладка = Элементы.Страницы.ТекущаяСтраница;

		ПереместитьШапкуВызовСервера();
		//Элементы.Переместить(Элементы.ГруппаШапкаЛево, Элементы.СтраницаШапка);
		//Элементы.СвернутьШапку.Видимость = Ложь;
		//Элементы.РазвернутьШапку.Видимость = Истина;

		ПанельОшибокРазвернута = Элементы.ПанельОшибок.РастягиватьПоВертикали;
		Если Не ПанельОшибокРазвернута Тогда
			ПанельОшибокСвернутьРазвернутьВызовОМ();
		КонецЕсли;

		Элементы.Страницы.ТекущаяСтраница = текАктивнаяЗакладка;

	Иначе

		ПереместитьШапкуВызовСервера();
		//Элементы.Переместить(Элементы.ГруппаШапкаЛево, Элементы.ГруппаШапкаМестоположение);
		//Элементы.СвернутьШапку.Видимость = Истина;
		//Элементы.РазвернутьШапку.Видимость = Ложь;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПереместитьШапкуВызовСервера()

	Если ШапкаНаОтдельнойЗакладке Тогда
		Если Элементы.СтраницаШапка.ПодчиненныеЭлементы.Найти(Элементы.ГруппаШапкаДанные.Имя) = Неопределено Тогда
			КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма,
																   Элементы.ГруппаШапкаДанные,
																   Элементы.СтраницаШапка);
		КонецЕсли;
	Иначе
		Если Элементы.ГруппаШапкаМестоположение.ПодчиненныеЭлементы.Найти(Элементы.ГруппаШапкаДанные.Имя) = Неопределено Тогда
			КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма,
																   Элементы.ГруппаШапкаДанные,
																   Элементы.ГруппаШапкаМестоположение);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СделатьНесопоставленныеНеУчитываемыми(Команда)

	НесопоставленныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("КоличествоМест,МассаПлановаяБруттоКг,ОтгрузочноеНаименование,Учитывать",
																	   0,
																	   0,
																	   "",
																	   Истина));
	Если НесопоставленныеСтроки.Количество() > 0 Тогда

		Для Каждого текСтр Из НесопоставленныеСтроки Цикл
			СделатьСтрокуТовараНеучитываемой(текСтр);
		КонецЦикла;

		ПолностьюОбновитьПредставлениеДанных();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СделатьСтрокуТовараНеучитываемой(Знач ТекДанныеТоваров)

	СделатьНоменклатуруНеучитываемой(ТекДанныеТоваров.Номенклатура, ТекДанныеТоваров.УпаковкаЕдиницаИзмерения);
	
	// эта номенклатура может быть еще в других строках
	// требуется переконвертировать все строки с этой номенклатурой
	МассивСтрокСЭтойНоменклатурой = Объект.ТоварыДокумента1С.НайтиСтроки(Новый Структура("Номенклатура",
																						 ТекДанныеТоваров.Номенклатура));

	Для Каждого СтрокаПереконвертации Из МассивСтрокСЭтойНоменклатурой Цикл

		СконвертироватьСтрокуТоваровКлиент(СтрокаПереконвертации.ПолучитьИдентификатор());

	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СделатьНоменклатуруНеучитываемой(Номенклатура, УпаковкаЕдиницаИзмерения)

	РегистрыСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.ПрисвоитьСоответствиеНоменклатуры(Номенклатура,
																									   Новый Структура("Учитывать,УпаковкаЕдиницаИзмерения",
																													   Ложь,
																													   УпаковкаЕдиницаИзмерения));

КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	ВсегдаВыводитьРезультатВалидации = ВсегдаВыводитьРезультатВалидации();
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки, ВсегдаВыводитьРезультатВалидации);
	
КонецПроцедуры

&НаКлиенте
Функция ВсегдаВыводитьРезультатВалидации()
	
	Возврат КодТекущегоСтатусаДокументооборота = "r-rejected"
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю")
		Или ТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОтправитьПодписанный");
	
КонецФункции

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)

	ОбработчикПеречитатьОбъект();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()

	ЭтаФорма.Прочитать();
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьДанныеФормы();
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	ПолностьюОбновитьПредставлениеДанных();
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(ЭтаФорма, Объект.ДокументОснование);
	УправлениеКолбасойТитуловВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеКолбасойТитуловВызовСервера()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УправлениеСтатусомПодписиИКолбасойТитулов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()

	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт

	Если ТипЗнч(Параметр2) = Тип("Структура") Тогда 
		Если Не ЗначениеЗаполнено(Объект.ДокументЭТРН) Тогда
			Параметр2.Свойство("ДокументЭТРН", Объект.ДокументЭТРН);
		КонецЕсли;	
	КонецЕсли; 

	ОбновитьДанныеФормы();
	Перепроверить();

КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	ВсегдаВыводитьРезультатВалидации = ВсегдаВыводитьРезультатВалидации();
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки, ВсегдаВыводитьРезультатВалидации);
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьПиктограммыОшибокТабличнойЧасти(
		Объект.Товары, ТаблицаОшибок, "Товары", "КартинкаОшибок");
	
	ЗаполнитьТребуемыеДействияТоваров(); 	// требуемые действия зависят от результатов проверки 
	УправлениеВидимостьюИДоступностью(); 	// доступность команд
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ТрН_Титул1.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок, ТребуемоеДействие);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		СтрокаТовара.Картинка = 0;
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТребуемыеДействияТоваров()

	Для Каждого СтрокаТовара Из Объект.Товары Цикл

		СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара)

	Если СтрокаТовара = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтрокаТовара.ТребуемоеДействие = "";
	
	// Блок 1 - Требуемые действия ведения пользователя за ручку по номенклатуре

	Если Не СтрокаТовара.Учитывать Тогда
		СтрокаТовара.ТребуемоеДействие = "Не учитывается";
		Возврат;
	КонецЕсли;
	
	// Для исходящих одни требуемые действия, а для исходящих другие
	Если ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен") Тогда

		Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ИспользоватьИПрименятьБазовыеСоответствия") Тогда 
			// эти требуемые действия блока 1 не являются блокирующими по документу - они только ведут пользователя
			Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) И Не СтрокаТовара.Свернута Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Номенклатуру";

			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.УпаковкаЕдиницаИзмерения) И Не СтрокаТовара.Свернута Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Единицу измерения";

			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.Количество) И Не СтрокаТовара.Свернута Тогда
				СтрокаТовара.ТребуемоеДействие = "Указать Количество";
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.СпособУпаковки)
					  Или Не ЗначениеЗаполнено(СтрокаТовара.СостояниеГруза)
					  Или Не ЗначениеЗаполнено(СтрокаТовара.ВидТары)
					  Или Не ЗначениеЗаполнено(СтрокаТовара.МассаПлановаяБруттоКг)
					  Или Не ЗначениеЗаполнено(СтрокаТовара.ОтгрузочноеНаименование) Тогда

				Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ТребоватьНаличиеБазовыхСоответствий") Тогда
					СтрокаТовара.ТребуемоеДействие = "Установить соответствие";
				Иначе
					СтрокаТовара.ТребуемоеДействие = "Заполнить обязательные поля";
				КонецЕсли;

			Иначе
				СтрокаТовара.ТребуемоеДействие = "Готов";
			КонецЕсли;
			
			Если СтрокаТовара.Свернута Тогда 
				СтрокаТовара.ТребуемоеДействие = СтрокаТовара.ТребуемоеДействие + ", свернута";
			КонецЕсли;	
			
		Иначе
			
			Если СтрокаТовара.КартинкаОшибок = 2 Тогда
				СтрокаТовара.ТребуемоеДействие = "Заполнить обязательные поля";
			Иначе
				СтрокаТовара.ТребуемоеДействие = "Готов";
			КонецЕсли;
			
		КонецЕсли;

	Иначе

		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			СтрокаТовара.ТребуемоеДействие = "Сопоставить";
		Иначе
			СтрокаТовара.ТребуемоеДействие = "ОК";
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьЗаголовкиКоличества(Форма)
	
	КоличествоМест = 0;
	КоличествоСтрок = 0;
	
	Для Каждого ТекущаяСтрока Из Форма.Объект.Товары Цикл
		
		Если Не ТекущаяСтрока.Учитывать Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоМест = КоличествоМест + ТекущаяСтрока.КоличествоМест;
		КоличествоСтрок = КоличествоСтрок + 1;
		
	КонецЦикла;
	
	Форма.Элементы.ТоварыКоличествоМест.Заголовок = КоличествоМест;
	Форма.Элементы.ТоварыКоличество.Заголовок = Форма.Объект.Товары.Итог("Количество");
	
	Форма.Элементы.ГруппаТовары.Заголовок = "Грузы (" + КоличествоСтрок + ")";

КонецПроцедуры

// Обслуживание панели ошибок

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()

	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя, "ПослеВыбораВТаблицеОшибок");	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокРежимПриИзменении(Элемент)
	КонтурЛогистика_ПанельОшибокКлиент.ПриИзмененииРежимаПанелиОшибок(Элементы.ТаблицаОшибок,
																	  ПанельОшибокРежимТекущейСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокРежимТекущейСтрокиПриИзменении(Элемент)
	КонтурЛогистика_ПанельОшибокКлиент.ПриИзмененииРежимаПанелиОшибок(Элементы.ТаблицаОшибок,
																	  ПанельОшибокРежимТекущейСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВТаблицеОшибок(Действие) Экспорт 

	Если Действие = "Добавить груз" Тогда 
		
		ТоварыДобавить(Неопределено);
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокФильтроватьСТрокиПоОшибке(Команда)

	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, "ТаблицаОшибокТекстОшибки");
	УстановитьВидимостьНеучитываемыхИФильтраОшибок();

КонецПроцедуры

&НаКлиенте
Процедура ОтключитьФильтрТаблицыОшибок(Команда)

	ОтборТаблицыОшибокЗначение = "";

	Если Элементы.Товары.ОтборСтрок <> Неопределено Тогда

		ВременнаяСтруктура = Новый Структура(Элементы.Товары.ОтборСтрок);

		Если ВременнаяСтруктура.Свойство("ПризнакОтбораТаблицыОшибок") Тогда
			ВременнаяСтруктура.Удалить("ПризнакОтбораТаблицыОшибок");
			Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(ВременнаяСтруктура);
		КонецЕсли;

	КонецЕсли;

	Элементы.ОтключитьФильтрТаблицыОшибок.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ОтключитьФильтрТаблицыОшибокТовары(Команда)

	ОтборТаблицыОшибокЗначениеТовары = "";

	Если Элементы.Товары.ОтборСтрок <> Неопределено Тогда

		ВременнаяСтруктура = Новый Структура(Элементы.Товары.ОтборСтрок);

		Если ВременнаяСтруктура.Свойство("ПризнакОтбораТаблицыОшибок") Тогда
			ВременнаяСтруктура.Удалить("ПризнакОтбораТаблицыОшибок");
			Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(ВременнаяСтруктура);
		КонецЕсли;

	КонецЕсли;

	Элементы.ОтключитьФильтрТаблицыОшибокТовары.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура Водитель2ПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПодачиПлановаяПриИзменении(Элемент)
	
	ДатаВремяПодачиПлановаяПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПодачиПлановоеПриИзменении(Элемент)
	
	Если Год(ДатаВремяПодачиПлановая) < 2022 Тогда
		ДатаВремяПодачиПлановая = НачалоДня(ТекущаяДата())
			+ (ДатаВремяПодачиПлановая - НачалоДня(ДатаВремяПодачиПлановая));
	КонецЕсли;
	
	ДатаВремяПодачиПлановаяПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяПодачиПлановаяПриИзменении(Элемент = Неопределено)
	
	ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатаВремяПодачиПлановая");
	
	Если Не ЗначениеЗаполнено(ДатаВремяПрибытия) И ЗначениеЗаполнено(ДатаВремяПодачиПлановая) Тогда
		ДатаВремяПрибытия = ДатаВремяПодачиПлановая;
		ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатаВремяПрибытия");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаВремяУбытия) И ЗначениеЗаполнено(ДатаВремяПодачиПлановая) Тогда
		ПродолжительностьПогрузки = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("СредняяПродолжительностьПогрузки", ЗначениеРеквизитаСсылки(Объект.ДокументЭТРН,"ПартнерПеревозчик"));
		Если ТипЗнч(ПродолжительностьПогрузки) = Тип("Число") Тогда
			ДатаВремяУбытия = ДатаВремяПодачиПлановая + ПродолжительностьПогрузки * 60;
			ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатаВремяУбытия");
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПрибытияПриИзменении(Элемент)
	ДатаВремяПрибытияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ВремяПрибытияПриИзменении(Элемент)
	
	Если Год(ДатаВремяПрибытия) < 2022 Тогда
		ДатаВремяПрибытия = НачалоДня(ТекущаяДата())
			+ (ДатаВремяПрибытия - НачалоДня(ДатаВремяПрибытия));
	КонецЕсли;
	
	ДатаВремяПрибытияПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяПрибытияПриИзменении(Элемент = Неопределено)
	
	ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатаВремяПрибытия");
	
	Если Не ЗначениеЗаполнено(ДатаВремяУбытия) И ЗначениеЗаполнено(ДатаВремяПрибытия) Тогда
		ПродолжительностьПогрузки = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("СредняяПродолжительностьПогрузки", ЗначениеРеквизитаСсылки(Объект.ДокументЭТРН,"ПартнерПеревозчик"));
		Если ТипЗнч(ПродолжительностьПогрузки) = Тип("Число") Тогда
			ДатаВремяУбытия = ДатаВремяПрибытия + ПродолжительностьПогрузки * 60;
			ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатаВремяУбытия");
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаВремяПодачиПлановая) И ЗначениеЗаполнено(ДатаВремяПрибытия) Тогда
		ДатаВремяПодачиПлановая = ДатаВремяПрибытия;
		ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатаВремяПодачиПлановая");
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяУбытияПриИзменении(Элемент)
	
	Если Год(ДатаВремяУбытия) < 2022 Тогда
		ДатаВремяУбытия = НачалоДня(ТекущаяДата())
			+ (ДатаВремяУбытия - НачалоДня(ДатаВремяУбытия));
	КонецЕсли;
	
	ДатаВремяУбытияПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяУбытияПриИзменении(Элемент = Неопределено)
	
	ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатаВремяУбытия");
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВремяПрибытияТекущим(Команда)
	
	ДатаВремяПрибытия = ТекущаяДатаВЧасовомПоясе(ЧасовойПоясПогрузки);
	ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатаВремяПрибытия");
	
	Если Не ЗначениеЗаполнено(ДатаВремяПодачиПлановая) Тогда 
		ДатаВремяПодачиПлановая = ДатаВремяПрибытия;
		ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатаВремяПодачиПлановая");
	КонецЕсли;
	
	
	ПродолжительностьПогрузки = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("СредняяПродолжительностьПогрузки", ЗначениеРеквизитаСсылки(Объект.ДокументЭТРН,"ПартнерПеревозчик"));
	Если ТипЗнч(ПродолжительностьПогрузки) = Тип("Число") Тогда
		ДатаВремяУбытия = ДатаВремяПрибытия + ПродолжительностьПогрузки * 60;
		ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатаВремяУбытия");
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВремяУбытияТекущим(Команда)
	
	ДатаВремяУбытия = ТекущаяДатаВЧасовомПоясе(ЧасовойПоясПогрузки);
	
	ЗаполнитьДатуПогрузкиОбъекта(ЭтаФорма, ЧасовойПоясПогрузки, "ДатаВремяУбытия");
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоМестПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура МассаБруттоКгПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура МетодОпределенияМассыПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПерезаполнитьДокументыОснования(
		Объект.ДокументыОснования, Объект.ДокументОснование);
		
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда 	
		Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик")
			Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка") Тогда 
			ПерезаполнитьПоДокОснованию(Неопределено);
		КонецЕсли;
	КонецЕсли;
		
	ПроверитьДокумент();
	
	Объект.СозданВручную = (Объект.СозданВручную И Не ЗначениеЗаполнено(Объект.ДокументОснование));  
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	СформироватьТребуемоеДействиеСтрокиТовара(Элемент.ТекущиеДанные);
	ПересчитатьЗаголовкиКоличества(ЭтаФорма);
	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ТоварыТребуемоеДействие" Тогда

		СтандартнаяОбработка = Ложь;

		ТекДанные = Элемент.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда

			ТекСтрТребуемоеДействие = ТекДанные.ТребуемоеДействие;
			ПараметрыТекСтрока = ВыбраннаяСтрока;
			Если ТекСтрТребуемоеДействие = "Указать Номенклатуру" Тогда

				ТипСправочникаНоменклатура = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяСправочникаНоменклатура");

				КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы("Справочник."
																				   + ТипСправочникаНоменклатура
																				   + ".ФормаВыбора",
																				   ,
																				   ЭтаФорма,
																				   ЭтаФорма,
																				   "ОбработчикВыбораНоменклатуры",
																				   ПараметрыТекСтрока);

			ИначеЕсли ТекСтрТребуемоеДействие = "Указать Единицу измерения" Тогда

				Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыУпаковкаЕдиницаИзмерения;
				Элементы.Товары.ИзменитьСтроку();

			ИначеЕсли ТекСтрТребуемоеДействие = "Указать Количество" Тогда

				Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыКоличество;
				Элементы.Товары.ИзменитьСтроку();

			ИначеЕсли ТекСтрТребуемоеДействие = "Установить соответствие" Или ТекСтрТребуемоеДействие = "Не учитывается" Тогда

				ОткрытьСоответствияТекущейСтроки();

			Иначе // требуемое действие от таблицы ошибок

				ОбработатьТребуемоеДействие(ТекСтрТребуемоеДействие, Неопределено);

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СконвертироватьСтрокуПриРучномИзменении(ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаЕдиницаИзмеренияПриИзменении(Элемент)
	
	СконвертироватьСтрокуПриРучномИзменении(ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СконвертироватьСтрокуПриРучномИзменении(ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

// Обработчики для требуемых действий

&НаКлиенте
Процедура ОбработатьТребуемоеДействие(ТребуемоеДействие, ПолеТаблицыОшибок = Неопределено)
	
	// реализуем отдельную обработку некоторых требуемых действий
	Если Ложь Тогда // Какие-то особенные UI для требуемых действий, например: ТребуемоеДействие = "Исправить GTIN" Тогда

	Иначе // типовая обработка таблицы ошибок

		Если ПолеТаблицыОшибок <> Неопределено Тогда
			КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, ПолеТаблицыОшибок.Имя);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствияТекущейСтроки()

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = "Табличная часть пуста! Сначала добавьте товар.";
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения);	
		
	Иначе
	
		текНоменклатура 	= ТекущиеДанные.Номенклатура;
		текЕдиница 			= ТекущиеДанные.УпаковкаЕдиницаИзмерения;
		текХарактеристика 	= ТекущиеДанные.Характеристика;
		
		КонтурЛогистика_КонвертацияКлиент.ОткрытьСоответствияНоменклатуры(текНоменклатура, текЕдиница, текХарактеристика, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтрокаТЧПоИдентификаторуСтроки(ИдСтрокиТоваров)
	Строки = Объект.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдСтрокиТоваров));
	Возврат Строки[0];	
КонецФункции

&НаКлиенте
Процедура ОбработчикВыбораНоменклатуры(ВыбранноеЗначение, ПараметрИдСтрокиТоваров) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда

		ТекДанные = Объект.Товары.НайтиПоИдентификатору(ПараметрИдСтрокиТоваров);
		
		ТекДанные.Номенклатура = ВыбранноеЗначение;

		ОбработчикПереконвертироватьСтроку(ПараметрИдСтрокиТоваров, ТекДанные);
		
		УстановитьВидимостьНоменклатуры();

		ПересчитатьДанныеСтрокиТЧТовары(ТекДанные);
		
		УправлениеВидимостьюИДоступностью();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДанныеСтрокиТЧТовары(ТекДанные)
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест") Тогда
		КоличествоМест = 0;
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Учитывать", Истина));
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			Объект.КоличествоМест = Объект.КоличествоМест + ТекущаяСтрока.КоличествоМест;
		КонецЦикла;
	КонецЕсли;
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто") Тогда
		МассаБруттоКг = 0;
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Учитывать", Истина));
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			Объект.МассаБруттоКг = Объект.МассаБруттоКг + ТекущаяСтрока.МассаПлановаяБруттоКг;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораЕдиницыИзмерения(ВыбранноеЗначение, ПараметрИдСтрокиТоваров) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда

		ТекДанные = Объект.Товары.НайтиПоИдентификатору(ПараметрИдСтрокиТоваров);
		ТекДанные.УпаковкаЕдиницаИзмерения = ВыбранноеЗначение;

		ОбработчикПереконвертироватьСтроку(ПараметрИдСтрокиТоваров, ТекДанные);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПереконвертироватьСтроку(ИдСтрокиТоваров, ТекДанные)

	СконвертироватьСтрокуТоваровКлиент(ИдСтрокиТоваров);
	СформироватьТребуемоеДействиеСтрокиТовара(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикИзмененияСоответствий(Параметр, ДопПараметр) Экспорт

	Если ЗначениеЗаполнено(ДопПараметр) Тогда

		локМассивСтрокСЭтойНоменклатурой = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ДопПараметр));
		локМассивИдентификаторов = Новый Массив();

		Для Каждого СтрокаПереконвертации Из локМассивСтрокСЭтойНоменклатурой Цикл

			СконвертироватьСтрокуТоваровКлиент(СтрокаПереконвертации.ПолучитьИдентификатор());
			локМассивИдентификаторов.Добавить(СтрокаПереконвертации.ИдентификаторСтроки);

		КонецЦикла;

		ПолностьюОбновитьПредставлениеДанных();

		ТоварыКоличествоМестПриИзменении(Неопределено);
		ТоварыМассаПлановаяБруттоКгПриИзменении(Неопределено);

		ПересчитатьЗаголовкиКоличества(ЭтаФорма);

		Модифицированность = Истина;

	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СконвертироватьСтрокуПриРучномИзменении(ПараметрИдСтрокиТоваров)
	
	СконвертироватьСтрокуТоваровКлиент(ПараметрИдСтрокиТоваров);
	
	ТоварыКоличествоМестПриИзменении(Неопределено);
	ТоварыМассаПлановаяБруттоКгПриИзменении(Неопределено);

	ПересчитатьЗаголовкиКоличества(ЭтаФорма);

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СконвертироватьСтрокуТоваровКлиент(ИдентификаторСтрокиТоваров)

	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтрокиТоваров);

	Если (ЗначениеЗаполнено(ТекСтрока.Номенклатура) И ЗначениеЗаполнено(ТекСтрока.УпаковкаЕдиницаИзмерения)) 
	      Или Объект.СозданВручную Тогда
		СконвертироватьСтрокуТоваров1СвЛогистика(ИдентификаторСтрокиТоваров, НастройкаКонвертацииДляРучногоВвода);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СконвертироватьСтрокуТоваров1СвЛогистика(ИдентификаторСтрокиТоваров, НастройкаКонвертацииДляРучногоВввода = Неопределено)

	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтрокиТоваров);

	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.СконвертироватьСтрокуТоваров1СвЛогистика(СтрокаТоваров.НомерСтроки, НастройкаКонвертацииДляРучногоВввода);

	ЗаполнитьЗначенияСвойств(СтрокаТоваров, ДокОбъект.Товары[СтрокаТоваров.НомерСтроки - 1]);
	// маркировки проч не переносим т.к. можно потерять данные

КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьНеучитываемые(Команда)

	СкрытьНеучитываемые = Не СкрытьНеучитываемые;
	УстановитьВидимостьНеучитываемыхИФильтраОшибок();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНеучитываемыхИФильтраОшибок()

	КонтурЛогистика_ОбработкаДокументовКлиент.УстановитьВидимостьНеучитываемыхИФильтраОшибок(Объект.Товары,
																							 СкрытьНеучитываемые,
																							 Элементы.Товары,
																							 Элементы.ТоварыИтоги);
	
	// лишним не будет
	Элементы.ОтключитьФильтрТаблицыОшибокТовары.Видимость = ЗначениеЗаполнено(ОтборТаблицыОшибокЗначениеТовары);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствияНоменклатуры(Команда)

	ОткрытьСоответствияТекущейСтроки();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовкиГруппамДопПолей()
	
	// ТелефоныПереадресующего
	Элементы.ГруппаТелефоныПереадресующего.Заголовок = "Телефоны переадресующих (" + Объект.ТелефоныПереадресующего.Количество() +")";
	
	// Состояние
	УстановитьЗаголовокСостояний();
	
	// Ограничения
	УстановитьЗаголовокОграничений();
	
	// ГруппаИнфПоля
	Элементы.ГруппаИнфПоля.Заголовок = "Информационные поля (" + Объект.ИнфПол.Количество() + ")";
	
	// ГруппаСопроводительные
	Элементы.ГруппаСопроводительные.Заголовок = "Сопроводительные документы (" + Объект.СопроводительныеДокументы.Количество() + ")";
	
	// ГруппаСпецУсловияДвижения
	Если Объект.СпецУслДвиж.Количество() = 0 Тогда 
		Элементы.ГруппаСпецУсловияДвижения.Заголовок = "Специальные условия движения (не указано)";
	Иначе
		Элементы.ГруппаСпецУсловияДвижения.Заголовок = "Специальные условия движения (указано)";
	КонецЕсли;
	
	// ГруппаДопПолучатели1
	Элементы.ГруппаДопПолучатели1.Заголовок = "Дополнительные получатели (" + Объект.ДополнительныеПолучателиФайла.Количество() + ")";
	
	// ГруппаДокументыОснования1
	Элементы.ГруппаДокументыОснования1.Заголовок = "Документы основания (" + Объект.ДокументыОснования.Количество() + ")";
	
	// ГруппаОтправкаУведомлений
	Если ЗначениеЗаполнено(Объект.УведомлениеОтказаНаТелефон) Или ЗначениеЗаполнено(Объект.УведомлениеОтказаНаАдресЭлектроннойПочты) Тогда 
		Элементы.ГруппаОтправкаУведомлений.Заголовок = "Уведомления об отказе (подключено)";
	Иначе
		Элементы.ГруппаОтправкаУведомлений.Заголовок = "Уведомления об отказе (не подключено)";
	КонецЕсли;
	
	// ORDERS DESADV INVOIC
	Если ЗначениеЗаполнено(Объект.НомераЗаказов) 
		Или ЗначениеЗаполнено(Объект.НомераDESADV) 
		Или ЗначениеЗаполнено(Объект.НомераУПД) Тогда
		
		Элементы.ГруппаEDI.Заголовок = "Уведомления об отказе (указано)";
		
	Иначе
		Элементы.ГруппаEDI.Заголовок = "Номера заказов, отгрузок, УПД (не указано)";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокОграничений()
	
	Счетчик = 0;
	Если ЗначениеЗаполнено(Объект.УказанияВОтношенииНормПеревозки) Тогда 
		Счетчик = Счетчик + 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОграничениеСкорости) Тогда 
		Счетчик = Счетчик + 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ТемператураНеНиже) Или ЗначениеЗаполнено(Объект.ТемператураНеВыше) Тогда 
		Счетчик = Счетчик + 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВлажностьНеНиже) Или ЗначениеЗаполнено(Объект.ВлажностьНеВыше) Тогда 
		Счетчик = Счетчик + 1;
	КонецЕсли;
	Элементы.ГруппаОграничения.Заголовок = "Ограничения и указания (" + Счетчик + ")";

КонецПроцедуры

&НаКлиенте
Функция УстановитьЗаголовокСостояний()
	
	Если ЗначениеЗаполнено(Объект.СостояниеКузова)
		Или ЗначениеЗаполнено(Объект.СостояниеТары)
		Или ЗначениеЗаполнено(Объект.СведенияОПломбах)
		Или ЗначениеЗаполнено(Объект.СостояниеУпаковки) Тогда 
		
		Элементы.ГруппаСостояние.Заголовок = "Состояние груза, тары, упаковки, пломбы (заполнено)";
		
	Иначе
		
		Элементы.ГруппаСостояние.Заголовок = "Состояние груза, тары, упаковки, пломбы (не указано)";
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТоварыДобавить(Команда)

	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	НоваяСтрока.Учитывать = Истина;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики()
		И КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ИспользуютсяХарактеристики() Тогда
		НоваяСтрока.Характеристика =  КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ПустаяХарактеристика();
	КонецЕсли;
	
	Если Объект.СозданВручную Тогда
		
		ТипСправочникаНоменклатура = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяСправочникаНоменклатура");

		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы("Справочник."
																		   + ТипСправочникаНоменклатура
																		   + ".ФормаВыбора",
																		   ,
																		   ЭтаФорма,
																		   ЭтаФорма,
																		   "ОбработчикВыбораНоменклатуры",
																		   НоваяСтрока.ПолучитьИдентификатор());
		
	Иначе
	
		ПроверитьДокумент();
		ЗаполнитьТребуемыеДействияТоваров();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкопировать(Команда)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);	
	НоваяСтрока.Учитывать = Истина;
	
	Если ТекСтрока <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока,, "ИдентификаторСтроки");
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументЭТРННажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", Объект.ДокументЭТРН);
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ФормаОбъекта",
																   ПараметрыФормы,
																   ЭтаФорма,
																   ЭтаФорма,
																   "ОбработчикПерепроверить");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМассаПлановаяБруттоКгПриИзменении(Элемент)

	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто")
		И Не ЗначениеЗаполнено(Объект.НомИспр) Тогда
		
		Объект.МассаБруттоКг = МассаПлановаяБруттоКгТоваров();
	КонецЕсли;

	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоМестПриИзменении(Элемент)

	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест")
		И Не ЗначениеЗаполнено(Объект.НомИспр) Тогда
		
		Объект.КоличествоМест = КоличествоМестТоваров();
	КонецЕсли;

	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)

	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто")
		И Не ЗначениеЗаполнено(Объект.НомИспр) Тогда
		
		Объект.МассаБруттоКг = МассаПлановаяБруттоКгТоваров();
	КонецЕсли;

	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест")
		И Не ЗначениеЗаполнено(Объект.НомИспр) Тогда
		
		Объект.КоличествоМест = КоличествоМестТоваров();
	КонецЕсли;

	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СоставительПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорОснованиеДоверияКСоставителюПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()

	Представления = ПолучитьПредставлениеРеквизитовДокументаОснования(Объект.ДокументОснование, Объект);
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();

	ЗаполнитьДатыПогрузкиЛокальные();
	
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл

		Значение = Неопределено;
		ИмяЭлементаЛогистика = Эл.Значение; // сконвертированного
		ИмяЭлементаНадписиСопоставить = "ДокУчСист_" + Эл.Ключ + "_Сопоставить";
		ИмяЭлементаЗначениеИзДокУчСист = "ДокУчСист_" + Эл.Ключ;
		ИмяЭлементаРедактированиеЭТРН = "РедактированиеЭТРН_" + Эл.Ключ;

		Если Представления.Свойство("ДокУчСист_" + Эл.Ключ, Значение) Тогда
			
			// Есть значение в реквизите ДокУчСист_ххх извлеченного из Документа учетной системы
			
			текВыражение = "ДокУчСист_" + Эл.Ключ + " = Значение";
			Выполнить (текВыражение);
			
			// определим доступность команды сопоставления

			Если ЗначениеЗаполнено(ИмяЭлементаЛогистика) Тогда
				
				ПутьПроверкиДанных = Элементы.Найти(ИмяЭлементаЛогистика).ПутьКДанным;

				РеквизитИзвлеченИзДокумента = ЗначениеЗаполнено(Этаформа[ИмяЭлементаЗначениеИзДокУчСист]);
				
				Если Элементы.Найти(ИмяЭлементаРедактированиеЭТРН) <> Неопределено Тогда 
					Элементы.Найти(ИмяЭлементаРедактированиеЭТРН).Видимость = Не РеквизитИзвлеченИзДокумента;
				КонецЕсли;
				
				Если РеквизитИзвлеченИзДокумента Тогда // если этот элемент выведен на форму и он рассчитан из документа уч сист
					
					Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда

						ЗначениеВРеквизите = Вычислить(ПутьПроверкиДанных);
						НужноСопоставить = Не ЗначениеЗаполнено(ЗначениеВРеквизите);

					Иначе

						НужноСопоставить = Ложь;

					КонецЕсли;

					Элементы.Найти(ИмяЭлементаЛогистика).Видимость = Не НужноСопоставить;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = НужноСопоставить;
					Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = НужноСопоставить ИЛИ РеквизитыУчетногоДокументаВидимы;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Заголовок = "Сопоставить";
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Установить новое соответствие";

				Иначе // не извлечен из документа Уч сист
					
					Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = Ложь;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = Ложь;
					
					Если Элементы.Найти(ИмяЭлементаРедактированиеЭТРН) <> Неопределено Тогда 
						Элементы.Найти(ИмяЭлементаЛогистика).Видимость = Ложь;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
						
						Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Не извлечен или не заполнен в док. основании. Открыть исходный документ";
						
					КонецЕсли;
					
				КонецЕсли;

			КонецЕсли;
			
		Иначе
			
			// не выведено поле ДокументаУчетной системы - только выберем видимость в пользу поля ввода РедактированиеЭТРНххх вместо ДокументЭТРНххх
			ЕстьЭлементРедактированиеЭТРН = Элементы.Найти(ИмяЭлементаРедактированиеЭТРН) <> Неопределено;
			Если ЕстьЭлементРедактированиеЭТРН Тогда 
				Элементы.Найти(ИмяЭлементаРедактированиеЭТРН).Видимость = Не ТолькоПросмотр И ЕстьЭлементРедактированиеЭТРН;
			КонецЕсли;
				
			Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость 			= ТолькоПросмотр ИЛИ Не ЕстьЭлементРедактированиеЭТРН;
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРеквизитовДокументаОснования(ДокументОснование, Знач ДокументТитулОбъект)

	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();

	СтруктураПредставлений = Новый Структура();
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		СтруктураПредставлений.Вставить("ДокУчСист_" + Эл.Ключ);
	КонецЦикла;

	Если ЗначениеЗаполнено(ДокументОснование) Тогда

		НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1,
																													   ДокументОснование);

		Если НастройкаКонвертации <> Неопределено Тогда

			Переменные = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьПеременные(ДокументТитулОбъект, ДокументОснование, НастройкаКонвертации, "");
	
			Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл

				Если Эл.Ключ = "Водитель" 
					Или Эл.Ключ = "Водитель2" 
					Или Эл.Ключ = "ОтправительШаблона" Тогда // искать в настройке конвертации титула а не главного 
					
					
					НастройкаКонвертацииРеквизита = НастройкаКонвертации.ПравилаКонвертацииТитулаРеквизиты.Найти(Эл.Ключ,
																												 "РеквизитТитула");
					ТекущийОбъектДляВычисления = ДокументТитулОбъект;
					
				Иначе
					
					НастройкаКонвертацииРеквизита = НастройкаКонвертации.ПравилаКонвертацииГлавногоДокумента.Найти(Эл.Ключ,
																												   "РеквизитТитула");
					ТекущийОбъектДляВычисления = ДокументТитулОбъект.ДокументЭТРН;
					
				КонецЕсли;

				Если НастройкаКонвертацииРеквизита = Неопределено Тогда 
					// настройка не введена
					Продолжить;
				КонецЕсли;	
				
				РезультатВычисления = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьРеквизитОснования(ДокументОснование,
																													 НастройкаКонвертацииРеквизита,
																													 НастройкаКонвертации,
																													 ТекущийОбъектДляВычисления,
																													 Ложь,
																													 Переменные);

				Если РезультатВычисления.Успешно Тогда
					СтруктураПредставлений.Вставить("ДокУчСист_" + Эл.Ключ, РезультатВычисления.Значение);
				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

	КонецЕсли;

	Возврат СтруктураПредставлений;

КонецФункции

&НаСервереБезКонтекста
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()

	Перем МассивКонвертируемыхРеквизитов;

	МассивКонвертируемыхРеквизитов = Новый Соответствие();
	МассивКонвертируемыхРеквизитов.Вставить("ОтправительШаблона", "ОтправительШаблона");
	МассивКонвертируемыхРеквизитов.Вставить("Грузоотправитель", "ДокументЭТРНГрузоотправитель");
	МассивКонвертируемыхРеквизитов.Вставить("Перевозчик", "ДокументЭТРНПеревозчик");
	МассивКонвертируемыхРеквизитов.Вставить("Грузополучатель", "ДокументЭТРНГрузополучатель");
	МассивКонвертируемыхРеквизитов.Вставить("ТранспортноеСредство", "ДокументЭТРНТранспортноеСредство");
	МассивКонвертируемыхРеквизитов.Вставить("Прицеп", "ДокументЭТРНПрицеп");
	МассивКонвертируемыхРеквизитов.Вставить("Прицеп2", "ДокументЭТРНПрицеп2");
	МассивКонвертируемыхРеквизитов.Вставить("МестоПогрузки", "ДокументЭТРНМестоПогрузки");
	МассивКонвертируемыхРеквизитов.Вставить("МестоДоставки", "ДокументЭТРНМестоДоставки");
	МассивКонвертируемыхРеквизитов.Вставить("ГрузоотправительПодразделение", ""); // элементов нет в Т1
	МассивКонвертируемыхРеквизитов.Вставить("ПеревозчикПодразделение", "");
	МассивКонвертируемыхРеквизитов.Вставить("ГрузополучательПодразделение", "");
	МассивКонвертируемыхРеквизитов.Вставить("ПогрузкаДоговор", "");
	МассивКонвертируемыхРеквизитов.Вставить("ПогрузкаСотрудник", "ДокументЭТРНПогрузкаСотрудник");
	МассивКонвертируемыхРеквизитов.Вставить("Водитель", "Водитель");
	МассивКонвертируемыхРеквизитов.Вставить("Водитель2", "Водитель2");
	МассивКонвертируемыхРеквизитов.Вставить("ЭкспедицияЗаказчик", "ДокументЭТРНЭкспедицияЗаказчик");
	МассивКонвертируемыхРеквизитов.Вставить("ЭкспедицияДоговор", "ДокументЭТРНЭкспедицияДоговор");
	Возврат МассивКонвертируемыхРеквизитов;

КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаСсылки(Ссылка, ИмяРеквизита)

	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаСсылки(Ссылка, ИмяРеквизита);

КонецФункции

&НаКлиенте
Процедура ДокУчСист_Реквизит_СопоставитьНажатие(Элемент)

	ИмяЭлемента = Элемент.Имя;
	ОбъектДокУчСистПуть = "ЭтаФорма." + СтрЗаменить(ИмяЭлемента, "_Сопоставить", "");
	ЗначениеОбъектДокУчСист = Вычислить(ОбъектДокУчСистПуть);

	Если ЗначениеЗаполнено(ЗначениеОбъектДокУчСист) Тогда

		ОткрытьФормуПодбораСущностиЛогистика(ЗначениеОбъектДокУчСист, Элемент);

	Иначе
		
		// открыть документ
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Объект.ДокументОснование);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)

	ПараметрыФормыПоиска = Новый Структура();
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);

	ПараметрыОбработчика = Новый Структура();
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);

	Если Элемент.Имя = "ДокУчСист_Грузоотправитель_Сопоставить"
		 Или Элемент.Имя = "ДокУчСист_Перевозчик_Сопоставить"
		 Или Элемент.Имя = "ДокУчСист_Грузополучатель_Сопоставить"
		 Или Элемент.Имя = "ДокУчСист_ЭкспедицияЗаказчик_Сопоставить"
		 Или Элемент.Имя = "ДокУчСист_ОтправительШаблона_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ОрганизацииДиадок";

	ИначеЕсли Элемент.Имя = "ДокУчСист_МестоПогрузки_Сопоставить" Или Элемент.Имя = "ДокУчСист_МестоДоставки_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ПунктыМаршрута";

	ИначеЕсли Элемент.Имя = "ДокУчСист_ТранспортноеСредство_Сопоставить"
		Или Элемент.Имя = "ДокУчСист_Прицеп_Сопоставить"
		Или Элемент.Имя = "ДокУчСист_Прицеп2_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ТранспортныеСредства";

	ИначеЕсли Элемент.Имя = "ДокУчСист_ПогрузкаСотрудник_Сопоставить" 
		Или Элемент.Имя = "ДокУчСист_Водитель_Сопоставить" 
		Или Элемент.Имя = "ДокУчСист_Водитель2_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_Сотрудники";

	ИначеЕсли Элемент.Имя = "ДокУчСист_ЭкспедицияДоговор_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_Договоры";

	Иначе

		ВызватьИсключение "не реализовано";

	КонецЕсли;

	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник." + ИмяСущности + ".ФормаВыбора",
																   ПараметрыФормыПоиска,
																   ЭтаФорма,
																   ЭтаФорма,
																   "ОбработчикВыбораСопоставленияРеквизитаДокумента",
																   ПараметрыОбработчика);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСопоставленияРеквизитаДокумента(ВыбранноеЗначение, ДопПараметры) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда 
		
		// Выполнить переконвертацию или присваивание
		ПовторноСконвертироватьРеквизит(ДопПараметры.ИмяЭлементаФормы);

		ПолностьюОбновитьПредставлениеДанных();

		ОбновитьДанныеФормы();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПовторноСконвертироватьРеквизит(ИмяЭлементаФормы)

	ДокОбъект = РеквизитФормыВЗначение("Объект");

	ПерезаполнитьЭТРН = Ложь;

	ИмяРеквизита = СтрЗаменить(ИмяЭлементаФормы, "ДокУчСист_", "");
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "_Сопоставить", "");
	
	// надо понять, требуется ли переконвертировать ЭТРН или надо конвертнуть только титул	
	СоотвРеквизита = СоответствиеКонвертируемыхРеквизитовИзДокУчСист().Получить(ИмяРеквизита);
	Если СоотвРеквизита <> Неопределено Тогда
		Если Найти(СоотвРеквизита, "ДокументЭТРН") Тогда
			ПерезаполнитьЭТРН = Истина;
		КонецЕсли;
	КонецЕсли;

	ДанныеЗаполнения = Новый Структура("ДокументОснование, ТипЛогистика, ПерезаполнитьГлавныйДокументЕслиСуществует",
									   Объект.ДокументОснование,
									   Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1,
									   ПерезаполнитьЭТРН);
	ДокОбъект.Заполнить(ДанныеЗаполнения);

	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура УдалитьЭТРН()

	ДокЭТРН = Объект.ДокументЭТРН;
	Если ЗначениеЗаполнено(ДокЭТРН) Тогда
		ДокЭТРНОбъект = ДокЭТРН.ПолучитьОбъект();
		ДокЭТРНОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		И (ЗначениеЗаполнено(Объект.ДокументОснование) Или Объект.СозданВручную)
		И (ЗавершениеРаботы = Неопределено Или Не ЗавершениеРаботы)Тогда
		
		УдалитьЭТРН();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура МаркировкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекИдентификаторСтрокиТовара(Знач НоваяСтрока, Знач Элемент)

	Перем ТекТовар;

	Если НоваяСтрока Тогда

		ТекТовар = Элементы.Товары.ТекущиеДанные;

		Элемент.ТекущиеДанные.ИдентификаторСтрокиТоваров = ТекТовар.ИдентификаторСтроки;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеВодителиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеВодителиПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		
		ПерезаписатьИдентификаторыЕГАИС();
				
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемПослеУдаления(Элемент)	
	
	ПерезаписатьИдентификаторыЕГАИС();
		
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТелефоныПереадресующегоПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТелефоныПереадресующегоПослеУдаления(Элемент)
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ИнициаторПереадресацииПриИзменении(Элемент)
	
	
	Если Объект.ИнициаторПереадресации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ИнициаторыПереадресовки.Грузоотправитель") Тогда 
		
		Объект.ТелефоныПереадресующего.Очистить();
		текГО = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Объект.ДокументЭТРН, "Грузоотправитель");
		УстановитьТелефонПереадресацииИзОсновногоТелефонаОрганизации(текГО);

	ИначеЕсли Объект.ИнициаторПереадресации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ИнициаторыПереадресовки.Грузополучатель") Тогда 
		
		Объект.ТелефоныПереадресующего.Очистить();
		текГП = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Объект.ДокументЭТРН, "Грузополучатель");
		УстановитьТелефонПереадресацииИзОсновногоТелефонаОрганизации(текГП);
		
	КонецЕсли;	
		
	
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура АктыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Элементы.ОтметкиГрузоотправителя.ТекущиеДанные = Неопределено Тогда

		Отказ = Истина;
		Сообщить("Сначала добавьте Отметку, к которой будет относиться акт");

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Элементы.ОтметкиГрузоотправителя.ТекущиеДанные = Неопределено Тогда

		Отказ = Истина;
		Сообщить("Сначала добавьте Отметку, к которой будет относиться акт");

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АктыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда

		ТекОтметка = Элементы.ОтметкиГрузоотправителя.ТекущиеДанные;

		Если ТекОтметка <> Неопределено Тогда

			Элемент.ТекущиеДанные.ИдентификаторСтрокиОтметки = ТекОтметка.ИдентификаторСтроки;
			Элемент.ТекущиеДанные.АктДата = ТекущаяДата();
			Элемент.ТекущиеДанные.АктНаименование = "Акт";

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда

		ТекОтметка = Элементы.ОтметкиГрузоотправителя.ТекущиеДанные;

		Если ТекОтметка <> Неопределено Тогда

			Элемент.ТекущиеДанные.ИдентификаторСтрокиОтметки = ТекОтметка.ИдентификаторСтроки;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПриАктивизацииСтроки(Элемент)

	Если Элемент.ТекущиеДанные = Неопределено Тогда

		Элементы.Акты.ОтборСтрок 			= Неопределено;
		Элементы.Штрафы.ОтборСтрок 			= Неопределено;
		Элементы.ОтметкиИнфПол.ОтборСтрок 	= Неопределено;

	Иначе

		Элементы.Акты.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки",
																			Элемент.ТекущиеДанные.ИдентификаторСтроки);
		Элементы.Штрафы.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки",
																			  Элемент.ТекущиеДанные.ИдентификаторСтроки);

		Элементы.ОтметкиИнфПол.ОтборСтрок 	= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки",
																			  Элемент.ТекущиеДанные.ИдентификаторСтроки);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтметкиДобавить(Команда)

	НоваяСтрока = Объект.ОтметкиГрузоотправителя.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	НоваяСтрока.ДатаИВремяОтметки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ТекущийМоментВремени();

	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОтметкиСкопировать(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуКонвертации(Команда)

	КонтурЛогистика_ОбработкаДокументовКлиент.ОткрытьНастройкуКонвертации(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1"),
																		  Объект.ДокументОснование);

КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПередУдалением(Элемент, Отказ)

	ТекДанные = Элементы.Отметки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли
	;

	нСтроки = Объект.Акты.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", ТекДанные.ИдентификаторСтроки));
	Для Каждого Строка Из нСтроки Цикл
		Объект.Акты.Удалить(Строка);
	КонецЦикла;

	нСтроки = Объект.Штрафы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", ТекДанные.ИдентификаторСтроки));
	Для Каждого Строка Из нСтроки Цикл
		Объект.Штрафы.Удалить(Строка);
	КонецЦикла;

	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПослеУдаления(Элемент)

	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура АктыПослеУдаления(Элемент)

	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура АктыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПослеУдаления(Элемент)

	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура СпецУслДвижПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СпецУслДвижПослеУдаления(Элемент)
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура РазделительПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗначенияДокументаУчетнойСистемы(Команда)
	
	РеквизитыУчетногоДокументаВидимы = Не РеквизитыУчетногоДокументаВидимы;
	Если РеквизитыУчетногоДокументаВидимы Тогда 
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Скрыть;
	Иначе
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Показать;
	КонецЕсли;
	
	СкрытьПоказатьЗначенияДокУчСист();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьЗначенияДокУчСист()
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();

КонецПроцедуры

&НаКлиенте
Процедура ИнфПолПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы.ИнфПол.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьРедактированиеИнфПол(ТекДанные);
	ДопПолеПриИзменении(Элемент);	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРедактированиеИнфПол(ТекДанные)
	
	Если ТекДанные.Идентиф = "ORDERS" Тогда
		Объект.НомераЗаказов = ТекДанные.Значение;	
	ИначеЕсли ТекДанные.Идентиф = "INVOIC" Тогда
		Объект.НомераУПД = ТекДанные.Значение;
	ИначеЕсли ТекДанные.Идентиф = "DESADV" Тогда
		Объект.НомераDESADV = ТекДанные.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.ИнфПол.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.Идентиф = "ORDERS" Тогда
		Объект.НомераЗаказов = "";	
	ИначеЕсли ТекДанные.Идентиф = "INVOIC" Тогда
		Объект.НомераУПД = "";
	ИначеЕсли ТекДанные.Идентиф = "DESADV" Тогда
		Объект.НомераDESADV = "";
	КонецЕсли;
	
	ДопПолеПриИзменении(Элемент);	
		
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолПослеУдаления(Элемент)	
	ПроверитьДокумент();		
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеЭТРН_ЛюбойРеквизит_ПриИзменении(Элемент)
	
	текЗначение = ЭтаФорма[Элемент.Имя];
	ПолеЭТРН =  СтрЗаменить(Элемент.Имя, "РедактированиеЭТРН_", "");
	
	РедактированиеЭТРН_Реквизит_ПриИзмененииНаСервере(ПолеЭТРН, текЗначение);
	
	Если ПолеЭТРН = "ТранспортноеСредство" Тогда 
		
		Если ЗначениеЗаполнено(текЗначение) Тогда
			
			ПрицепПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(текЗначение, "ПрицепПоУмолчанию");
			РедактированиеЭТРН_Реквизит_ПриИзмененииНаСервере("Прицеп", ПрицепПоУмолчанию);
			РедактированиеЭТРН_Прицеп = ПрицепПоУмолчанию;
			
			Прицеп2ПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(текЗначение, "Прицеп2ПоУмолчанию");
			РедактированиеЭТРН_Реквизит_ПриИзмененииНаСервере("Прицеп2", Прицеп2ПоУмолчанию);
			РедактированиеЭТРН_Прицеп2 = Прицеп2ПоУмолчанию;
			
		Иначе
			
			ПрицепПустаяСсылка = ПредопределенноеЗначение("Справочник.КонтурЛогистика_ТранспортныеСредства.ПустаяСсылка");
			
			РедактированиеЭТРН_Реквизит_ПриИзмененииНаСервере("Прицеп", ПрицепПустаяСсылка);
			РедактированиеЭТРН_Прицеп = ПрицепПустаяСсылка;
			
			РедактированиеЭТРН_Реквизит_ПриИзмененииНаСервере("Прицеп2", ПрицепПустаяСсылка);
			РедактированиеЭТРН_Прицеп2 = ПрицепПустаяСсылка;
			
		КонецЕсли;
		
	ИначеЕсли ПолеЭТРН = "Перевозчик" Тогда
		
		Перевозчик = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Объект.ДокументЭТРН, "Перевозчик");
		Если Не ЗначениеЗаполнено(Перевозчик) Тогда
			Возврат;
		КонецЕсли;
		
		ТранспортноеСредствоПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Перевозчик, "ТранспортноеСредствоПоУмолчанию");
		ВодительПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Перевозчик, "ВодительПоУмолчанию");
		Водитель2ПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Перевозчик, "Водитель2ПоУмолчанию");
		
		ИспользуютсяРеквизитыПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ИспользуютсяРеквизитыПоУмолчаниюВОрганизации();
		
		Если ИспользуютсяРеквизитыПоУмолчанию Тогда
			Объект.Водитель = ВодительПоУмолчанию;
			Объект.Водитель2 = Водитель2ПоУмолчанию;
			РедактированиеЭТРН_Реквизит_ПриИзмененииНаСервере("ТранспортноеСредство", ТранспортноеСредствоПоУмолчанию);
		КонецЕсли;
		
		Если ИспользуютсяРеквизитыПоУмолчанию Тогда
			
			Если ЗначениеЗаполнено(ТранспортноеСредствоПоУмолчанию) Тогда
				ПрицепПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
					ТранспортноеСредствоПоУмолчанию, "ПрицепПоУмолчанию");	
				Прицеп2ПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
					ТранспортноеСредствоПоУмолчанию, "Прицеп2ПоУмолчанию");
			Иначе
				ПрицепПоУмолчанию = ПредопределенноеЗначение("Справочник.КонтурЛогистика_ТранспортныеСредства.ПустаяСсылка");
				Прицеп2ПоУмолчанию = ПредопределенноеЗначение("Справочник.КонтурЛогистика_ТранспортныеСредства.ПустаяСсылка");
			КонецЕсли;
			
			РедактированиеЭТРН_Реквизит_ПриИзмененииНаСервере("Прицеп", ПрицепПоУмолчанию);
			РедактированиеЭТРН_Прицеп = ПрицепПоУмолчанию;
			
			РедактированиеЭТРН_Реквизит_ПриИзмененииНаСервере("Прицеп2", Прицеп2ПоУмолчанию);
			РедактированиеЭТРН_Прицеп2 = Прицеп2ПоУмолчанию;
			
		КонецЕсли;
		
	ИначеЕсли ПолеЭТРН = "Грузоотправитель" 
		И Объект.ИнициаторПереадресации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ИнициаторыПереадресовки.Грузоотправитель") Тогда
		
		текГО = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Объект.ДокументЭТРН, "Грузоотправитель");
		
		Если ЗначениеЗаполнено(текГО) Тогда
			УстановитьТелефонПереадресацииИзОсновногоТелефонаОрганизации(текГО);
		КонецЕсли;
	
	ИначеЕсли ПолеЭТРН = "Грузополучатель" 
		И Объект.ИнициаторПереадресации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ИнициаторыПереадресовки.Грузополучатель") Тогда
		
		текГП = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Объект.ДокументЭТРН, "Грузополучатель");
		
		Если ЗначениеЗаполнено(текГП) Тогда
			УстановитьТелефонПереадресацииИзОсновногоТелефонаОрганизации(текГП);
		КонецЕсли;
		
	ИначеЕсли ПолеЭТРН = "МестоПогрузки" Тогда 
		
		ОбновитьЧасовыеПоясаМестаПогрузки();
	
	КонецЕсли;
	
	ОповеститьОбИзменении(Объект.ДокументЭТРН);
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТелефонПереадресацииИзОсновногоТелефонаОрганизации(ОрганизацияДДСсылка)
	
	Если ЗначениеЗаполнено(ОрганизацияДДСсылка) Тогда
				
		ТелефоныПАМассив = ТелефоныПередресующего(ОрганизацияДДСсылка);
		Если ТелефоныПАМассив.Количество() > 0  Тогда
			Объект.ТелефоныПереадресующего.Очистить();
			Для Каждого ТелПА из ТелефоныПАМассив Цикл 
				НоваяСтрокаПА = Объект.ТелефоныПереадресующего.Добавить();
				НоваяСтрокаПА.Телефон = ТелПА;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТелефоныПередресующего(ОрганизацияДДСсылка)
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТелефоныПереадресующего(ОрганизацияДДСсылка);
	
КонецФункции

&НаСервере
Процедура РедактированиеЭТРН_Реквизит_ПриИзмененииНаСервере(ВКакойРеквизитИмя, УстанавливаемоеЗначение)
	
	ПроставитьВЭТРН(Объект.ДокументЭТРН, ВКакойРеквизитИмя, УстанавливаемоеЗначение);
	
	// автоопределение партнера
	Если ВКакойРеквизитИмя = "Грузоотправитель" Тогда
		
		Если ЗначениеЗаполнено(УстанавливаемоеЗначение) Тогда 
			ПартнерГрузоотправитель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(УстанавливаемоеЗначение);
		Иначе
			ПартнерГрузоотправитель = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
		КонецЕсли;
		ПроставитьВЭТРН(Объект.ДокументЭТРН, "ПартнерГрузоотправитель", ПартнерГрузоотправитель);
		
	ИначеЕсли ВКакойРеквизитИмя = "Перевозчик" Тогда
		
		Если ЗначениеЗаполнено(УстанавливаемоеЗначение) Тогда 
			ПартнерПеревозчик = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(УстанавливаемоеЗначение);
		Иначе
			ПартнерПеревозчик = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
		КонецЕсли;
		ПроставитьВЭТРН(Объект.ДокументЭТРН, "ПартнерПеревозчик", ПартнерПеревозчик);
		
	ИначеЕсли ВКакойРеквизитИмя = "Грузополучатель" Тогда
		
		Если ЗначениеЗаполнено(УстанавливаемоеЗначение) Тогда 
			ПартнерГрузополучатель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПартнераОрганизацииДиадок(УстанавливаемоеЗначение);
		Иначе
			ПартнерГрузополучатель = Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
		КонецЕсли;
		ПроставитьВЭТРН(Объект.ДокументЭТРН, "ПартнерГрузополучатель", ПартнерГрузополучатель);
		
	КонецЕсли;
	
	ОбновитьДанныеФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПроставитьВЭТРН(ДокументЭТРНСсылка, ВКакойРеквизитИмя, УстанавливаемоеЗначение)

	Если Не ЗначениеЗаполнено(ДокументЭТРНСсылка) Тогда
		
		Если Объект.СозданВручную
			 И ЗначениеЗаполнено(РедактированиеЭТРН_ДатаТрН)
			 И ЗначениеЗаполнено(РедактированиеЭТРН_НомерТрН) Тогда

			ДокументЭТРН = НайтиЭТРН(РедактированиеЭТРН_ДатаТрН, РедактированиеЭТРН_НомерТрН);
			
			Если ЗначениеЗаполнено(ДокументЭТРН) Тогда
				ДокЭТРНОбъект = ДокументЭТРН.ПолучитьОбъект();
			Иначе
				ДокЭТРНОбъект = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.СоздатьДокумент();
			КонецЕсли;

			ДокЭТРНОбъект.Дата = ТекущаяДатаСеанса();
			
			ЗаполнитьЗаимствованныеИзЭТРН_Реквизиты(ДокЭТРНОбъект);
				
			ДокЭТРНОбъект.Записать();

			Объект.ДокументЭТРН = ДокЭТРНОбъект.Ссылка;
		
		КонецЕсли;
		
	Иначе
		
		ДокЭТРНОбъект = ДокументЭТРНСсылка.ПолучитьОбъект();
		ДокЭТРНОбъект[ВКакойРеквизитИмя] = УстанавливаемоеЗначение;
		ДокЭТРНОбъект.Записать();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НайтиЭТРН(ДатаТрН, НомерТрН)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная КАК КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная
	|ГДЕ
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Номер = &Номер
	|	И КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Дата = &Дата
	|	И НЕ КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Номер", НомерТрН);
	Запрос.УстановитьПараметр("Дата", ДатаТрн);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	 
	КонецЕсли;	 
	
	Возврат Неопределено;
	
КонецФункции	

&НаСервере
Процедура ЗаполнитьЗаимствованныеИзЭТРН_Реквизиты(ДокЭТРНОбъект)

	ДокЭТРНОбъект.Грузоотправитель = РедактированиеЭТРН_Грузоотправитель;
	ДокЭТРНОбъект.Грузополучатель = РедактированиеЭТРН_Грузополучатель;
	ДокЭТРНОбъект.ДатаТрН = РедактированиеЭТРН_ДатаТрН;
	ДокЭТРНОбъект.МестоДоставки = РедактированиеЭТРН_МестоДоставки;
	ДокЭТРНОбъект.МестоПогрузки = РедактированиеЭТРН_МестоПогрузки;
	ДокЭТРНОбъект.НомерТрН = РедактированиеЭТРН_НомерТрН;
	ДокЭТРНОбъект.Перевозчик = РедактированиеЭТРН_Перевозчик;
	ДокЭТРНОбъект.ПогрузкаСотрудник = РедактированиеЭТРН_ПогрузкаСотрудник;
	ДокЭТРНОбъект.ПогрузкуОсуществляет = РедактированиеЭТРН_ПогрузкуОсуществляет;
	ДокЭТРНОбъект.Прицеп = РедактированиеЭТРН_Прицеп;
	ДокЭТРНОбъект.Прицеп2 = РедактированиеЭТРН_Прицеп2;
	ДокЭТРНОбъект.ТранспортноеСредство = РедактированиеЭТРН_ТранспортноеСредство;
	
КонецПроцедуры	 

&НаКлиенте
Процедура СопроводительныеДокументыПослеУдаления(Элемент)
	ДопПолеПриИзменении(Элемент);	
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныеДокументыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ДопПолеПриИзменении(Элемент);	
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Функция КоличествоМестТоваров()
	
	КоличествоМест = 0;
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если Не ТекущаяСтрока.Учитывать Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоМест = КоличествоМест + ТекущаяСтрока.КоличествоМест;
	КонецЦикла;
	
	Возврат КоличествоМест;
	
КонецФункции

&НаКлиенте
Функция МассаПлановаяБруттоКгТоваров()
	
	КоличествоЕдиниц = 0;
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если Не ТекущаяСтрока.Учитывать Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоЕдиниц = КоличествоЕдиниц + ТекущаяСтрока.МассаПлановаяБруттоКг;
	КонецЦикла;
	
	Возврат КоличествоЕдиниц;
	
КонецФункции

&НаКлиенте
Процедура Составитель1ПриИзменении(Элемент)
	
	ИзменитьДопПолучателя(Объект.Составитель, ПредСоставитель);
	УстановитьВидимостьЭлементов();
	ОбновитьДанныеФормы();
	ПроверитьДокумент();
	
	ПредСоставитель = Объект.Составитель;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПрототип1ПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
	ОбновитьДанныеФормы();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПунктКолбасыНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоКолбасеКТитулу(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНесколькоОснованийНажатие(Элемент)
	ЭтаФорма.ТекущийЭлемент = Элементы.ДокументыОснования;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ИзменениеДокумнетовОснований();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДокумнетовОснований()
	ОтрисоватьДокументыОснованияКлиент();
	Элементы.ПерезаполнитьПоДокОснованию.ЦветТекста = WebЦвета.Красный;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПослеУдаления(Элемент)
	
	ИзменениеДокумнетовОснований();
	
	// Проверим, что удаленный документ основания не используется для заполнения
	ЕстьДокументЗаполнения = Ложь;
	Для Каждого ТекущаяСтрока Из Объект.ДокументыОснования Цикл
		Если ТекущаяСтрока.ДокументОснование = Объект.ДокументОснование Тогда
			ЕстьДокументЗаполнения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьДокументЗаполнения Тогда
		Если Объект.ДокументыОснования.Количество() > 0 Тогда
			// Возьмем первый из списка
			Объект.ДокументОснование = Объект.ДокументыОснования[0].ДокументОснование;
			ПоказатьПредупреждениеПерезаполнения();
		Иначе
			Объект.ДокументОснование = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерегрузкаЗапрещенаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.ПерегрузкаЗапрещена = Не Объект.ПерегрузкаЗапрещена;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьДопКолонкиОпасныхГрузов(Команда)
	
	Элементы.ОпасныеГрузыГруппаДополнительные.Видимость = Не Элементы.ОпасныеГрузыГруппаДополнительные.Видимость;
	
	Если Элементы.ОпасныеГрузыГруппаДополнительные.Видимость Тогда
		Элементы.ОпасныеГрузыСкрытьПоказатьДопКолонкиОпасныхГрузов.Заголовок = "Скрыть доп. колонки";
	Иначе
		Элементы.ОпасныеГрузыСкрытьПоказатьДопКолонкиОпасныхГрузов.Заголовок = "Показать доп. колонки";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпасныеГрузыОписаниеОпасногоГрузаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОпасныеГрузы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.ОписаниеОпасногоГруза) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеРеквизиты = 
		"НомерООН, НадлежащееОтгрузочноеНаименование, ТехническоеНаименование, Описание, Класс, КлассификационныйКод,
		|ГруппаУпаковки, ЗнакОпасности, КодОграниченияТуннели, Радионуклиды, ОписаниеФизХимФормы, МаксАктивностьРадиации,
		|КатегорияУпаковки, ТранспортныйИндекс, ИндексБезопасности, ОпознавательныйЗнакСертификатов, ПолнаяАктивностьГруза,
		|ПроцСмеси, ДатаИстеченияВремениУдержания, КонтрольнаяТемпература, АварийнаяТемпература";
	
	Если СокрЛП(ТекущиеДанные.ОбМасНетВзрСод) = "" Тогда
		ЗаполняемыеРеквизиты = ЗаполняемыеРеквизиты + ", ОбМасНетВзрСод";
	КонецЕсли;
	
	Если СокрЛП(ТекущиеДанные.ОбМасНетВзрСодВсех) = "" Тогда
		ЗаполняемыеРеквизиты = ЗаполняемыеРеквизиты + ", ОбМасНетВзрСодВсех";
	КонецЕсли;
	
	ЗначенияРеквизитов = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
		ТекущиеДанные.ОписаниеОпасногоГруза,
		ЗаполняемыеРеквизиты);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ЗначенияРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРазрешенияПолномочий(Параметр1, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработчикРазрешенияПолномочий(ЭтаФорма, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОснование(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаДокументОснование(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПриОчисткеДокументаОснование(ЭтаФорма, Объект.ДокументОснование);
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПерезаполнитьДокументыОснования(
		Объект.ДокументыОснования, Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборДокументовОснования(Команда)
	
	ИмяФормыДокумента = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ИмяФормыДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ИмяФормыВыбораПоТипуДокумента(ТипЗнч(Объект.ДокументОснование));
	КонецЕсли;
	
	Если ИмяФормыДокумента = Неопределено Тогда
		
		// Открываем форму выбора типа документа
		ТипыДокументаОснования = КонтурЛогистика_ОбщегоНазначенияСервер.ТипыДокументаОснования("КонтурЛогистика_ТрН_Титул1");
		
		Если ТипыДокументаОснования = Неопределено Тогда
			Сообщить("Не удалось определить тип документа основания!");
			Возврат;
		КонецЕсли;
		
		СЗТипыДокументаОснования = Новый СписокЗначений;
		СЗТипыДокументаОснования.ЗагрузитьЗначения(ТипыДокументаОснования);
		
		Оповещение = Новый ОписаниеОповещения("ВыборТипаДокументаОснованияЗавершение", ЭтаФорма);
		
		СЗТипыДокументаОснования.ПоказатьВыборЭлемента(Оповещение);
		
	Иначе
		
		// Сразу открываем форму выбора
		ОткрытьФормуВыбораДокументаОснование(ИмяФормыДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаДокументаОснованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормыДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ИмяФормыВыбораПоТипуДокумента(Результат.Значение);
	
	ОткрытьФормуВыбораДокументаОснование(ИмяФормыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораДокументаОснование(ИмяФормыДокумента)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор, ЗакрыватьПриВыборе", Истина, Ложь);
	
	Если ТипЗнч(ПолучитьФорму(ИмяФормыДокумента)) = Тип("УправляемаяФорма") Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы(ИмяФормыДокумента, ПараметрыФормы, Элементы.ДокументыОснования);
	Иначе
		ОткрытьФорму(ИмяФормыДокумента, ПараметрыФормы, Элементы.ДокументыОснования);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновнымДокументомОснования(Команда)
	
	ТекущиеДанные = Элементы.ДокументыОснования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДокументОснование = ТекущиеДанные.ДокументОснование;
	
	ИзменениеДокумнетовОснований();
	
	УстановитьПервой(Объект.ДокументыОснования.Индекс(ТекущиеДанные), ТекущиеДанные.НомерСтроки);
	
	ПоказатьПредупреждениеПерезаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеПерезаполнения()
	
	ТекстПредупреждения = "Документ используемый для заполнения изменен.
		|Возможно следует перезаполнить документ.";
	КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПервой(Знач ИндексСтроки, Знач НомерСтроки)
	
	Объект.ДокументыОснования.Сдвинуть(ИндексСтроки, 1 - НомерСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		ОбработатьВыборДокументовОснования(ВыбранноеЗначение);
		
	Иначе
		
		массДокументыОснования = Новый Массив;
		массДокументыОснования.Добавить(ВыбранноеЗначение);
		
		ОбработатьВыборДокументовОснования(массДокументыОснования);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументовОснования(массДокументыОснования)
	
	Если массДокументыОснования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущееЗначение Из массДокументыОснования Цикл
		
		ЕстьДубли = Ложь;
		
		Для Каждого ТекущийДокументОснования Из Объект.ДокументыОснования Цикл
			Если ТекущийДокументОснования.ДокументОснование = ТекущееЗначение Тогда
				ЕстьДубли = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДубли Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ТекущееЗначение;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) И Объект.ДокументыОснования.Количество() <> 0 Тогда
		Объект.ДокументОснование = Объект.ДокументыОснования[0].ДокументОснование;
		ПоказатьПредупреждениеПерезаполнения();
	КонецЕсли;
	
	ИзменениеДокумнетовОснований();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВодителя(Команда)
	Элементы.ГруппаВодитель2.Видимость = Истина;
	Элементы.ДобавитьВодителя.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПрицеп(Команда)
	Элементы.ГруппаПрицепы.Видимость = Истина;
	Элементы.ГруппаПрицеп.Видимость = Истина;
	Элементы.ГруппаКомандаДобавитьПрицеп.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВторойПрицеп(Команда)
	Элементы.ГруппаПрицеп2.Видимость = Истина;
	Элементы.ДобавитьПрицеп.Видимость = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ORDERSПриИзменении(Элемент)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Идентиф", "ORDERS");
	
	Найд = Объект.ИнфПол.НайтиСтроки(Отбор);
	Если Найд.Количество() > 0 И ЗначениеЗаполнено(Объект.НомераЗаказов) Тогда			
		Найд[0].Значение = Объект.НомераЗаказов;
	ИначеЕсли Найд.Количество() > 0 И Не ЗначениеЗаполнено(Объект.НомераЗаказов) Тогда
		Объект.ИнфПол.Удалить(Найд[0]);	
	ИначеЕсли Найд.Количество() = 0 И ЗначениеЗаполнено(Объект.НомераЗаказов) Тогда
		НоваяСтрока = Объект.ИнфПол.Добавить();
		НоваяСтрока.Идентиф = "ORDERS";
		НоваяСтрока.Значение = Объект.НомераЗаказов;
	КонецЕсли;	
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура INVOICEПриИзменении(Элемент)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Идентиф", "INVOIC");
	
	Найд = Объект.ИнфПол.НайтиСтроки(Отбор);
	Если Найд.Количество() > 0 И ЗначениеЗаполнено(Объект.НомераУПД) Тогда			
		Найд[0].Значение = Объект.НомераУПД;
	ИначеЕсли Найд.Количество() > 0 И Не ЗначениеЗаполнено(Объект.НомераУПД) Тогда
		Объект.ИнфПол.Удалить(Найд[0]);	
	ИначеЕсли Найд.Количество() = 0 И ЗначениеЗаполнено(Объект.НомераУПД) Тогда
		НоваяСтрока = Объект.ИнфПол.Добавить();
		НоваяСтрока.Идентиф = "INVOIC";
		НоваяСтрока.Значение = Объект.НомераУПД;
	КонецЕсли;
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура НомераDESADVПриИзменении(Элемент)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Идентиф", "DESADV");
	
	Найд = Объект.ИнфПол.НайтиСтроки(Отбор);
	Если Найд.Количество() > 0 И ЗначениеЗаполнено(Объект.НомераDESADV) Тогда			
		Найд[0].Значение = Объект.НомераDESADV;
	ИначеЕсли Найд.Количество() > 0 И Не ЗначениеЗаполнено(Объект.НомераDESADV) Тогда
		Объект.ИнфПол.Удалить(Найд[0]);	
	ИначеЕсли Найд.Количество() = 0 И ЗначениеЗаполнено(Объект.НомераDESADV) Тогда
		НоваяСтрока = Объект.ИнфПол.Добавить();
		НоваяСтрока.Идентиф = "DESADV";
		НоваяСтрока.Значение = Объект.НомераDESADV;
	КонецЕсли;
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕГАИСПриИзменении(Элемент)
	
	ИзменитьСведенияГосСистемДляЕГАИС();
		
КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемНаимГосСистПриИзменении(Элемент)
	
	ТекДанные = Элементы.СведенияГосСистем.ТекущиеДанные;
		
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.ИдНомУчетЕд) Тогда
		ПерезаписатьИдентификаторыЕГАИС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияГосСистемИдНомУчетЕдПриИзменении(Элемент)
	ПерезаписатьИдентификаторыЕГАИС();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПлотностьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанные.Плотность = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОкруглитьПлотность(ТекущиеДанные.Плотность);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПриИзменении(Элемент)
	ДопПолеПриИзменении(Элемент);
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУчитыватьПриИзменении(Элемент)
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто")
		И Не ЗначениеЗаполнено(Объект.НомИспр) Тогда		
		Объект.МассаБруттоКг = МассаПлановаяБруттоКгТоваров();
	КонецЕсли;

	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест")
		И Не ЗначениеЗаполнено(Объект.НомИспр) Тогда		
		Объект.КоличествоМест = КоличествоМестТоваров();
	КонецЕсли;
	
КонецПроцедуры

#Область ДатаВремяПогрузки

&НаСервере
Процедура ЗаполнитьДатыПогрузкиЛокальные()
	
	Если Не ЗначениеЗаполнено(Объект.ДокументЭТРН) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыЭТРН = КонтурЛогистика_СтдОбщегоНазначения.ЗначенияРеквизитовОбъектаЛок(
		Объект.ДокументЭТРН, "ДатаВремяДоставки, МестоПогрузки");
	Если ЗначениеЗаполнено(РеквизитыЭТРН.МестоПогрузки) Тогда
		ЧасовойПоясПогрузки = РеквизитыЭТРН.МестоПогрузки.ЧасовойПояс;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЧасовойПоясПогрузки) Тогда
		ДатаВремяПодачиПлановая = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			Объект.ДатаВремяПодачиПлановая, Неопределено, ЧасовойПоясПогрузки);
		ДатаВремяПрибытия = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			Объект.ДатаВремяПрибытия, Неопределено, ЧасовойПоясПогрузки);
		ДатаВремяУбытия = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			Объект.ДатаВремяУбытия, Неопределено, ЧасовойПоясПогрузки);
		ДатаВремяДоставки = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			РеквизитыЭТРН.ДатаВремяДоставки, Неопределено, ЧасовойПоясПогрузки);
	Иначе
		ДатаВремяПодачиПлановая = Объект.ДатаВремяПодачиПлановая;
		ДатаВремяПрибытия = Объект.ДатаВремяПрибытия;
		ДатаВремяУбытия = Объект.ДатаВремяУбытия;
		ДатаВремяДоставки = РеквизитыЭТРН.ДатаВремяДоставки;
	КонецЕсли;
	
	Элементы.ГруппаДатыИМеста.Заголовок = ЗаголовокДатИВременПогрузки(ЧасовойПоясПогрузки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДатуПогрузкиОбъекта(Форма, ЧасовойПоясПогрузки, ИмяРеквизита)
	
	РеквизитФормы = Форма[ИмяРеквизита];
	
	Если ЗначениеЗаполнено(ЧасовойПоясПогрузки) Тогда
		Форма.Объект[ИмяРеквизита] = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(РеквизитФормы, ЧасовойПоясПогрузки);
	Иначе
		Форма.Объект[ИмяРеквизита] = РеквизитФормы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокДатИВременПогрузки(ЧасовойПояс)
	
	Заголовок = "Даты и время";
	
	Если ЗначениеЗаполнено(ЧасовойПояс) Тогда
		Заголовок = Заголовок + " " + КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПредставлениеЧасовогоПоясаЛок(ЧасовойПояс);
	КонецЕсли;
	
	Возврат Заголовок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекущаяДатаВЧасовомПоясе(ЧасовойПояс)
	
	Если ЗначениеЗаполнено(ЧасовойПояс) Тогда
		Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(ТекущаяДата(), Неопределено, ЧасовойПояс);
	Иначе
		Возврат ТекущаяДата();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ЕГАИС

&НаКлиенте
Процедура ИзменитьСведенияГосСистемДляЕГАИС()
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.ИдентификаторыЕГАИС) Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторСтрокиТоваров", ТекДанные.ИдентификаторСтроки);
		Отбор.Вставить("НаимГосСист", "ЕГАИС");
				
		Найд = Объект.СведенияГосСистем.НайтиСтроки(Отбор);		
		Для каждого Стр Из Найд Цикл
			Объект.СведенияГосСистем.Удалить(Стр);	
		КонецЦикла;
		
		ИдентификаторыЕГАИС = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(ТекДанные.ИдентификаторыЕГАИС, ";", Ложь);
		
		Для каждого Идентификатор Из ИдентификаторыЕГАИС Цикл
			
			НоваяСтрока = Объект.СведенияГосСистем.Добавить();
			НоваяСтрока.ИдентификаторСтрокиТоваров = ТекДанные.ИдентификаторСтроки;
			НоваяСтрока.НаимГосСист = "ЕГАИС";
			НоваяСтрока.ИдНомУчетЕд = СокрЛП(Идентификатор);
						
		КонецЦикла;
		
		ТекДанные.УчетГрузаВГИС = Истина;
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторСтрокиТоваров", ТекДанные.ИдентификаторСтроки);
		Отбор.Вставить("НаимГосСист", "ЕГАИС");
				
		Найд = Объект.СведенияГосСистем.НайтиСтроки(Отбор);		
		Для каждого Стр Из Найд Цикл
			Объект.СведенияГосСистем.Удалить(Стр);	
		КонецЦикла;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторСтрокиТоваров", ТекДанные.ИдентификаторСтроки);
		Найд = Объект.СведенияГосСистем.НайтиСтроки(Отбор);
		Если Найд.Количество() = 0 Тогда
			ТекДанные.УчетГрузаВГИС = Ложь;	
		КонецЕсли;
			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПерезаписатьИдентификаторыЕГАИС()	
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
		
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиТоваров", ТекДанные.ИдентификаторСтроки);
	Отбор.Вставить("НаимГосСист", "ЕГАИС");
	
	ИдентификаторыЕГАИС = "";
	Найд = Объект.СведенияГосСистем.НайтиСтроки(Отбор);
	ид = 1;
	Для каждого Стр Из Найд Цикл
		
		Если ид = Найд.Количество() Тогда
			ИдентификаторыЕГАИС = ИдентификаторыЕГАИС + Стр.ИдНомУчетЕд;
		Иначе
			ИдентификаторыЕГАИС = ИдентификаторыЕГАИС + Стр.ИдНомУчетЕд + "; ";
		КонецЕсли;
		
		ид = ид + 1;
		
	КонецЦикла;
	
	ТекДанные.ИдентификаторыЕГАИС = ИдентификаторыЕГАИС;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиТоваров", ТекДанные.ИдентификаторСтроки);		
	Найд = Объект.СведенияГосСистем.НайтиСтроки(Отбор);
	Если Найд.Количество() = 0 Тогда
		ТекДанные.УчетГрузаВГИС = Ложь;	
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ДопПолеПриИзменении(Элемент)
	УстановитьЗаголовкиГруппамДопПолей();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ДопПолеПриИзменении(Элемент);
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПослеУдаления(Элемент)
	ДопПолеПриИзменении(Элемент);
	ПроверитьДокумент();
КонецПроцедуры

#КонецОбласти
