Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаСВ(Данные, Представление, СтандартнаяОбработка);

КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов(ТипДокумента = Неопределено) Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Если ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул1 Тогда 
		// выгружаем пустой контейнер из ТС
		МассивОбязательных.Добавить("МестоВыгрузки");
		МассивОбязательных.Добавить("ДатТСВыгр");
	ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул3 Тогда 
		// погружаем заполненный контейнер на ТС
		МассивОбязательных.Добавить("МестоПогрузки");
		МассивОбязательных.Добавить("ДатТСПогр");
	КонецЕсли;
	
	// FIXME
	МассивОбязательных.Добавить("ОтвЛицоПВ");
	МассивОбязательных.Добавить("ТранспортноеСредство");
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ОтгрузочноеНаименование");
	МассивОбязательных.Добавить("СостояниеГруза");
	МассивОбязательных.Добавить("ОбъемКонтейнера");
	МассивОбязательных.Добавить("МассаКонтейнеровБрутто");
	МассивОбязательных.Добавить("Высота");
	МассивОбязательных.Добавить("Длина");
	МассивОбязательных.Добавить("Ширина");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("Прицеп");
	МассивОбязательных.Добавить("ДополнительныеВодителиМассив");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("МаркировкиМассив");
	МассивОбязательных.Добавить("ОпасныеГрузыМассивСтруктур");
	
	Возврат МассивОбязательных;
	
КонецФункции

// какие поля могут быть высчитаны из базовых
Функция МассивБазовыхСоответствийРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ОтгрузочноеНаименование");
	МассивОбязательных.Добавить("СостояниеГруза");
	МассивОбязательных.Добавить("КоличествоМест");
	МассивОбязательных.Добавить("ОбъявленнаяЦенность");
	МассивОбязательных.Добавить("ОбъявленнаяЦенностьВалюта");
	МассивОбязательных.Добавить("СпособУпаковки");
	МассивОбязательных.Добавить("ВидТары");
	МассивОбязательных.Добавить("Плотность");
	МассивОбязательных.Добавить("ЗначениеМаркировки");
	МассивОбязательных.Добавить("ОписаниеОпасногоГруза");
	МассивОбязательных.Добавить("Высота");
	МассивОбязательных.Добавить("Длина");
	МассивОбязательных.Добавить("Ширина");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("ДополнительныеВодителиМассив", "Дополнительные водители ", "Указываются, если а/м управляют несколько водителей", "Массив(КонтурЛогистика_Сотрудники)", 2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("МаркировкиМассив", "Маркировки", "Маркировка(и) товара", "МассивСтрок или Строка", 3));
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("ОпасныеГрузыМассивСтруктур", "Опасные грузы", "Сведения об опасных грузах ДОПОГ", "МассивСтруктур(см. спр.КонтурЛогистика_ОписанияОпасныхГрузов)", 2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_СВ");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("ДокументСВ");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфПрв");
	МассивКлючевых.Добавить("ВрИнфПрв");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

// Конец Обязательные манифесты

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда 
		
		// TODO понять какие сценарии проверки входящего документа
		
	ИначеЕсли Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		И Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан Тогда  
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ПроверитьТабЧастьТовары(ДокументОбъектИлиСсылка, ТаблицаОшибок, ТекСтатусТитула);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;

	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ДокументСВ = Объект.ДокументСВ;
	
	Если НЕ ЗначениеЗаполнено(ДокументСВ)  Тогда
		
		ТекстОшибки = "Титул не привязан к Документу электронной сопроводительной ведомости";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументСВ", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		ОбязательныеРеквизитыГлавного = Документы.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость.МассивОбязательныхРеквизитов();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыГлавного Цикл
			Если НЕ ЗначениеЗаполнено(ДокументСВ[ОбязательныйРевизит])  Тогда
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной сопроводительной ведомости";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		Документы.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость.ПроверитьКлючевыеРеквизитыСВ(ДокументСВ, ТаблицаОшибок);

	КонецЕсли;
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(ДокументСВ.Грузоотправитель);
	
	Если Не ПараметрыСервиса.АвторизацияВыполнена И ЗначениеЗаполнено(ДокументСВ.Грузоотправитель) Тогда
	
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
			Если Не ЗначениеЗаполнено(Объект.УИД_СВ) Тогда 
				ТекстОшибки = "Не указан УИД из пула";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"УИД_СВ", КатегорияОшибка, ТекстОшибки, "Взять из пула");
			КонецЕсли;
			
		Иначе
			
			ОстатокУИДов = РегистрыСведений.КонтурЛогистика_УИДыГИС.ОсталосьСвободныхУИДов(ДокументСВ.Грузоотправитель);
			Если ОстатокУИДов = 0 Тогда
				
				ТекстОшибки = "Не осталось свободных УИД в пуле. Получите новые или отключите использование пула.";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"УИД_СВ", КатегорияОшибка, ТекстОшибки, "Получить УИДы");
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов(Объект.ТипТитула) Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_СВ_ТитулПВ.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	// Водитель
	ПроверитьВодителя(Объект.Водитель, ТаблицаОшибок, КатегорияОшибка);
	
	// ДополнительныеВодители
	Для Каждого Строка Из Объект.ДополнительныеВодители Цикл 
		
		ПроверитьВодителя(Строка.Водитель, ТаблицаОшибок, КатегорияОшибка, Строка);
		
	КонецЦикла;	
	
	// ТС
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.ВидВладения) Тогда
			
			ТекстОшибки = "Укажите вид владения транспортным средством";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.ВидВладения", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Прицеп) Тогда
		Если Не ЗначениеЗаполнено(Объект.Прицеп.ВидВладения) Тогда
			
			ТекстОшибки = "Укажите вид владения прицепом";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"Прицеп.ВидВладения", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЕсли;
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьВодителя(Водитель, ТаблицаОшибок, КатегорияОшибка, СтрокаДопВодитель = Неопределено)
	
	Если ЗначениеЗаполнено(Водитель) Тогда
				
		НомерСтроки = ?(СтрокаДопВодитель = Неопределено, "", СтрокаДопВодитель.НомерСтроки);
		ИмяТЧ 		= ?(СтрокаДопВодитель = Неопределено, "", "ДополнительныеВодители");
		
		ПрефВодителя	= ?(СтрокаДопВодитель = Неопределено, " ", " Дополнительного ");
		
		Если Не ЗначениеЗаполнено(Водитель.ТелефонОсновной) Тогда
			
			ТекстОшибки = "Укажите телефон" + ПрефВодителя + "водителя";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
				"Водитель.ТелефонОсновной", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Водитель.ИНН) 
			И Не ЗначениеЗаполнено(Водитель.ВУДатаВыдачи) 
			И Не ЗначениеЗаполнено(Водитель.ВУНомер)
			И Не ЗначениеЗаполнено(Водитель.ВУСерия) Тогда
			
			ТекстОшибки = "Не запонен ИНН" + ПрефВодителя + "водителя или дата выдачи, серия и номер водительского удостоверения";
				
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
				"Водитель.ИНН", КатегорияОшибка, ТекстОшибки, "Указать ИНН");	
			
		ИначеЕсли Не ЗначениеЗаполнено(Водитель.ИНН) Тогда 
			
			Если Не ЗначениеЗаполнено(Водитель.ВУДатаВыдачи) Тогда			
				ТекстОшибки = "Укажите у" + ПрефВодителя + "водителя дату выдачи ВУ";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
					"Водитель.ВУДатаВыдачи", КатегорияОшибка, ТекстОшибки, "Указать");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Водитель.ВУНомер) Тогда
				ТекстОшибки = "Укажите у" + ПрефВодителя + "водителя номер ВУ";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
					"Водитель.ВУНомер", КатегорияОшибка, ТекстОшибки, "Указать");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Водитель.ВУСерия) Тогда				
				ТекстОшибки = "Укажите у" + ПрефВодителя + "водителя серию ВУ";				
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
					"Водитель.ВУСерия", КатегорияОшибка, ТекстОшибки, "Указать");				
			КонецЕсли;	
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Водитель.ИНН) Тогда 
			
			ТекстОшибки = Справочники.КонтурЛогистика_Сотрудники.ТекстОшибкиПроверкиИНН(Водитель.ИНН);
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
				
			    КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
					"Водитель.ИНН", КатегорияОшибка, "Укажите верный ИНН" + ПрефВодителя + "водителя. " + ТекстОшибки, "Указать");
				
			КонецЕсли;
					
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ПроверитьТабЧастьТовары(Знач Объект, ТаблицаОшибок, ТекСтатусДокумента = Неопределено)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ИмяТЧ = "Товары";
	
	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		
		Если Не СтрокаТовара.Учитывать Тогда 
			Продолжить;
		КонецЕсли;
		
		ТекущийНомерСтроки = СтрокаТовара.НомерСтроки;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.ОтгрузочноеНаименование) Тогда
			ТекстОшибки = "Укажите Отгрузочное наименование";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать отгрузочное наименование");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.СостояниеГруза) Тогда
			ТекстОшибки = "Укажите Состояние груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"СостояниеГруза", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать состояние груза");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.ОбъемКонтейнера) Тогда
			ТекстОшибки = "Объем контейнера (куб м.)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОбъемКонтейнера", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.МассаКонтейнеровБрутто) Тогда
			ТекстОшибки = "Укажите массу контейнера(ов)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"МассаКонтейнеровБрутто", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Высота) Тогда
			ТекстОшибки = "Укажите высоту груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"Высота", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Ширина) Тогда
			ТекстОшибки = "Укажите ширину груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"Ширина", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Длина) Тогда
			ТекстОшибки = "Укажите длину груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"Длина", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать");
		КонецЕсли;
		
		ПроверитьСвязанныеОпасныеГрузы(Объект, СтрокаТовара, ТаблицаОшибок);
		
	КонецЦикла;

КонецПроцедуры

Функция ПроверитьСвязанныеОпасныеГрузы(Знач Объект, Знач СтрокаТовара, ТаблицаОшибок)
	
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ТекущийНомерСтроки = СтрокаТовара.НомерСтроки;
	ИмяТЧ = "Товары"; // ошибки будем складывать к товарам

	СвязанныеСтрокиОГ = Объект.ОпасныеГрузы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиТоваров", СтрокаТовара.ИдентификаторСтроки));
	Для Каждого СтрокаОГ Из СвязанныеСтрокиОГ Цикл 
		
		Если ЗначениеЗаполнено(СтрокаОГ.ОписаниеОпасногоГруза) Тогда 
			Источник = СтрокаОГ.ОписаниеОпасногоГруза;
		Иначе
			Источник = СтрокаОГ;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.НомерООН) Тогда
			ТекстОшибки = "Укажите Номер ООН опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.НадлежащееОтгрузочноеНаименование) Тогда
			ТекстОшибки = "Укажите Надлежащее отгрузочное наименование опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.Класс) Тогда
			ТекстОшибки = "Укажите Класс опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.КлассификационныйКод) Тогда
			ТекстОшибки = "Укажите Классификационный код опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.ГруппаУпаковки) Тогда
			ТекстОшибки = "Укажите Группу упаковки опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.ЗнакОпасности) Тогда
			ТекстОшибки = "Укажите Знак опасности опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.КодОграниченияТуннели) Тогда
			ТекстОшибки = "Укажите Код ограничения проезда через туннели опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если Источник.Класс = Перечисления.КонтурЛогистика_КлассыОпасностиГрузов.Класс1 Тогда
			
			Если НЕ ЗначениеЗаполнено(Источник.ОбМасНетВзрСод) Тогда
				ТекстОшибки = "Укажите Общая масса нетто взрывчатого содержимого в килограммах для каждого вещества или изделия, имеющего отдельный номер ООН (т.к. класс = 1)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Источник.ОбМасНетВзрСодВсех) Тогда
				ТекстОшибки = "Укажите Общая масса нетто взрывчатого содержимого в килограммах для всех веществ и изделий, которых касается сопроводительная ведомость (т.к. класс = 1)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_СВ_ТитулПВ.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции
	
#КонецЕсли