
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ = Ложь 
		И Не ЗначениеЗаполнено(УИД_СВ) 
		И Не КонтурЛогистика_ОбработкаДокументовСервер.ЭтоВходящийДокумент(ДополнительныеСвойства) 
		И ЗначениеЗаполнено(ДокументСВ.Перевозчик) Тогда
		
		Организация = КонтурЛогистика_ОбщегоНазначенияСервер.ОрганизацияДляЗапросаУИДов(ЭтотОбъект);
		
		ПолученныйУИД = РегистрыСведений.КонтурЛогистика_УИДыГИС.ПолучитьОчередной(Организация);			
		Если ПолученныйУИД <> Неопределено Тогда				
			УИД_СВ = ПолученныйУИД;				
			ПроверитьИспользованиеУИДа(ПолученныйУИД, Отказ, Организация);			
		Иначе
			Сообщить("Не получен УИД из пула. Закончились?");
		КонецЕсли;
		
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("СВ_ТитулПВ_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);

	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"СВ_ТитулПВ_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
	
	КонецПроцедуры

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
							ДанныеЗаполнения.ТипЛогистика);
							
	УИД_СВ 		= ПредыдущийТитул.УИД_СВ;
	Если Не ЗначениеЗаполнено(УИД_СВ) Тогда 
		УИД_СВ = "Отсутствует";
	КонецЕсли;
	
	ДокументСВ 	= ПредыдущийТитул.ДокументСВ;
	
	ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
	
	Если ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул9 Тогда 
	// это файл обмена информации перевозчика (по факту принятия порожнего контейнера от грузополучателя)
	// (является обязательным при информационном обмене), состоящей из сведений о временных обстоятельствах приёма контейнера от грузополучателя
		
		МестоПогрузки 	= ПредыдущийТитул.МестоВыгрузки;
		ДатТСПогр 		= ПредыдущийТитул.ДатаПВыгр;
		
		// Найти Титул7
		Титул7 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул7, ДокументСВ);
		Если ЗначениеЗаполнено(Титул7) Тогда 
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Титул7, ",ТранспортноеСредство,Прицеп,Водитель,ПутевойЛистНомер,ПутевойЛистДата,ПутевойЛистСрокДействия,ОтвЛицоГО,ОтвЛицоГО_ЮЛ,ОтвЛицоПВ,ОтвЛицоГП,ОтвЛицоГП_ЮЛ");
		КонецЕсли;
		
		Для Каждого СтрКонтейнерТ7 Из Титул7.Контейнеры Цикл 
			КонтейнерТ9 = Контейнеры.Добавить();
			ЗаполнитьЗначенияСвойств(КонтейнерТ9, СтрКонтейнерТ7);
		КонецЦикла;
		
		Для Каждого СтрДопВодителя Из Титул7.ДополнительныеВодители Цикл 
			СтрНовыйДопВодитель = ДополнительныеВодители.Добавить();
			ЗаполнитьЗначенияСвойств(СтрНовыйДопВодитель, СтрДопВодителя);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		
		ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации);

	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул) Экспорт
	
	// в формате ON_SOPVEDPER нет идентификации!
	ТипПредыдущегоТитула = ПредыдущийТитул.ТипТитула;
	
	ТипТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СледующийТипДокумента(ТипПредыдущегоТитула);
	
КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации)

	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		//Заполнить ЭтотТитул
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДата();
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Из док Основания

Процедура ЗаполнитьПоДокОснованию(Знач ДанныеЗаполнения)
	
	Перем ДокументСВОбъект, НайденныйЭТрН, НастройкаКонвертации, ТЗ_ТоварыВременная;
	
	ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
								ДанныеЗаполнения.ТипЛогистика, 
								ДанныеЗаполнения.ДокументОснование);
	
	// ДокументЭТрН потребуется создать(найти) и записать в базу.
	
	НайденныйЭТрН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиЭТрН(ДокументОснование, НастройкаКонвертации);
	Если ЗначениеЗаполнено(НайденныйЭТрН) Тогда 
		ДокументСВ = НайденныйЭТрН;
		
		// перезаполним ЭТРН если взведен флаг
		Если ДанныеЗаполнения.Свойство("ПерезаполнитьГлавныйДокументЕслиСуществует") И ДанныеЗаполнения.ПерезаполнитьГлавныйДокументЕслиСуществует Тогда 
			
			ДокументСВОбъект = ДокументСВ.ПолучитьОбъект();
			КонтурЛогистика_КонвертацияСервер.ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы(ДокументСВОбъект, ДанныеЗаполнения.ДокументОснование, НастройкаКонвертации);
			ДокументСВОбъект.Записать();
			
		КонецЕсли;
	Иначе
		
		ДокументСВОбъект = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.СоздатьДокумент();
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы(ДокументСВОбъект, ДанныеЗаполнения.ДокументОснование, НастройкаКонвертации);
		ДокументСВОбъект.Записать();
		ДокументСВ = ДокументСВОбъект.Ссылка;
		
	КонецЕсли;
	
	//Заполнить ЭтотТитул
	КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	
	// TODO отрефачить дублирвоание в модулях объектов Т1 и Т3 
	ТЗ_ТоварыВременная = ЗаполнитьТабЧастьТовары(НастройкаКонвертации);
	
	КонтурЛогистика_КонвертацияСервер.СгенерироватьИдентификаторыСтрок(ТЗ_ТоварыВременная);
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьИПрименятьБазовыеСоответствия") Тогда 
		КонтурЛогистика_КонвертацияСервер.КонвертироватьТовары1сВЛогистику(ТЗ_ТоварыВременная, ЭтотОбъект);
	КонецЕсли;
	
	Товары.Загрузить(ТЗ_ТоварыВременная);
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест") Тогда 
		КоличествоМест = Товары.Итог("КоличествоМест");
	КонецЕсли;
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто") Тогда 
		МассаБруттоКг = Товары.Итог("МассаПлановаяБруттоКг");
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьТабЧастьТовары(НастройкаКонвертации)
	
	Товары.Очистить();
			
	ТЗ_ТоварыВременная = Товары.Выгрузить(); 
	
	КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ЗаполнитьТабЧастьТоварыПоДокументуУчетнойСистемы(ТЗ_ТоварыВременная, НастройкаКонвертации, ЭтотОбъект);

	Возврат ТЗ_ТоварыВременная;
	
КонецФункции

Процедура СконвертироватьСтрокуТоваров1СвЛогистика(НомерСтроки) Экспорт
	
	СтрокаТоваров = Товары.Найти(НомерСтроки, "НомерСтроки");
	
	// сформировать расширенную (с упаковками) строку товаров
	ТЗ_ТоварыВременная = Товары.ВыгрузитьКолонки(); 
	
	СтрокаТоваровВременная = ТЗ_ТоварыВременная.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТоваровВременная, СтрокаТоваров);
	
	КонтурЛогистика_КонвертацияСервер.КонвертироватьТовары1сВЛогистику(ТЗ_ТоварыВременная, ЭтотОбъект);
	
	// положить расширенную строку товаров обратно в ТоварыДокумента1С
	ЗаполнитьЗначенияСвойств(СтрокаТоваров, СтрокаТоваровВременная);
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоУмолчаниюВСтрокеТоваров(СтрокаТоваров)
	
	// если есть дефолтные значения, например в настройках
	ДефолтСпособУпаковки = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("СпособУпаковкиПоУмолчанию");
	
	Если Не ЗначениеЗаполнено(ДефолтСпособУпаковки) Тогда 
		СтрокаТоваров.СпособУпаковки = ДефолтСпособУпаковки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ДокументСВ.Перевозчик,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Из пришедшего файла XML

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	Перем XDTO, ВидТар_raw, ВодительN, ДатаВремяПодачиПлановая_raw, ДатаВремяПрибытия_raw, ДатаВремяУбытия_raw, ЗакУсл_raw, ИнициаторПереадресации_стр, й, КС, МассивОпГруз, МассивСвВодит_XDTO, МетодОпределенияМассы_raw, НайденныйГлавныйДокумент, НоваяСтрокаТовара, ОбъявленнаяЦенность, ОбъявленнаяЦенность_raw, ОпГруз, ОпГруз_raw, СвВодит_XDTO, СодИнфГО, стрОбъявленнаяЦенность_raw, СтрокаДопВодителя, СтрокаТелефонаПА, ТелефонПереадресующего, ТелефоныПереадресующего_raw, ТелефоныПереадресующего_массив;
	
	НайденныйГлавныйДокумент = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлу(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйГлавныйДокумент) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти Документ ЭТРН, создание не выполнено");
		
	Иначе
		
		ДокументСВ = НайденныйГлавныйДокумент;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		СодСВИнфПрв 	= XDTO.Документ.СодСВИнфПрв;
		ТипТитула 		= ФайлСсылка.ТипДокумента;
		
		ЗаполнитьРеквизитыТитулаИзXDTO(XDTO, СодСВИнфПрв);
		
		ЗаполнитьТоварыИзXDTO(СодСВИнфПрв);

		// TODO ИнфПол
		
		// Комментарий - нет в формате минтранса // TODO есть в Диадоке - научиться доставать из ДД 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO, Знач СодСВИнфПрв)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ДатИнфПрв 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO, "Документ.ДатИнфПрв"));
	ВрИнфПрв 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(XDTO, "Документ.ВрИнфПрв"));
	
	НомИспр						= КС.XDTO_Вычислить(СодСВИнфПрв, "ИспрСВ.НомИспр");
	ДатаИспр					= КС.XDTO_Вычислить(СодСВИнфПрв, "ИспрСВ.ДатаИспр");
	
	СвВодит_XDTO				= КС.XDTO_Вычислить(СодСВИнфПрв, "СвПрв.СвВодит");
	МассивСвВодит_XDTO         	= КС.XDTO_ВычислитьМассивXDTO(СвВодит_XDTO);
	
	// Сведения о грузе
	СвГруз 						= КС.XDTO_Вычислить(СодСВИнфПрв, "СвГруз");
	ОбъявленнаяЦенность			= КС.XDTO_ВычислитьЧисло(СвГруз, "ОбщСтоимГруз.СтЦеннГр");
	//ОбъявленнаяЦенностьВалюта	= КС.XDTO_Вычислить(СвГруз, "ОбщСтоимГруз.КодОКВ");
	
	ЗаполнитьТоварыИзXDTO(СвГруз);
	
	// СвКонтейн	
	ЗаполнитьКонтейнерыИзXDTO(СодСВИнфПрв);
	
	// СдачКонтПогрВыгр
	ДатТСПогр_raw	= КС.XDTO_Вычислить(СодСВИнфПрв, "СдачКонтПогрВыгр.ДатТСПогр");
	ДатТСПогр		= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДатТСПогр_raw);
	
	ДатТСВыгр_raw	= КС.XDTO_Вычислить(СодСВИнфПрв, "СдачКонтПогрВыгр.ДатТСВыгр");
	ДатТСВыгр		= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДатТСВыгр_raw);
	
	МестоПогрузки  	= КС.Конвертировать_АдресПользТип_вПунктМаршрутаЛогистика(КС.XDTO_Вычислить(СодСВИнфПрв, "СдачКонтПогрВыгр.АдрМП"));
	МестоВыгрузки  	= КС.Конвертировать_АдресПользТип_вПунктМаршрутаЛогистика(КС.XDTO_Вычислить(СодСВИнфПрв, "СдачКонтПогрВыгр.АдрМВ"));
	
	// СвВодит Сведения о водителе (водителях), путевых Листах
	ЗаполнитьВодителейИПутевыеЛисты(СодСВИнфПрв);
	
	// ОтвЛица
	ЗаполнитьОтветственныхЛиц(СодСВИнфПрв);
	
	// СвТС Сведения о транспортном средстве
	ТС_XDTO = КС.XDTO_Вычислить(СодСВИнфПрв, "СвТС.ТС");
	ТранспортноеСредство = КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(ТС_XDTO, Ложь);
	
	Прицеп_XDTO = КС.XDTO_Вычислить(СодСВИнфПрв, "СвТС.Прицеп");
	Прицеп = КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(Прицеп_XDTO, Ложь);
	
	
	// Подписант - для полученных титул1 не заполняем
	
КонецПроцедуры

Процедура ЗаполнитьОтветственныхЛиц(Знач СодСВИнфПрв)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ГО_ОтвФЛ_XDTO = КС.XDTO_Вычислить(СодСВИнфПрв, "СвГО.ОтвПогрузФЛ");
	Если ГО_ОтвФЛ_XDTO <> Неопределено Тогда 
		ОтвЛицоГО 	= КС.Конвертировать_СведОтвЛицоТип_вСотрудникаЛогистика(ГО_ОтвФЛ_XDTO);
	КонецЕсли;
	
	ГО_ОтвЮЛ_XDTO = КС.XDTO_Вычислить(СодСВИнфПрв, "СвГО.ОтвПогрузЮЛ");
	Если ГО_ОтвЮЛ_XDTO <> Неопределено Тогда 
		ОтвЛицоГО_ЮЛ = КС.Конвертировать_СвЮЛУч_вОрганизациюДиадок(ГО_ОтвЮЛ_XDTO);
	КонецЕсли;
	
	ГП_ОтвФЛ_XDTO = КС.XDTO_Вычислить(СодСВИнфПрв, "СвГП.ОтвПриемФЛ");
	Если ГП_ОтвФЛ_XDTO <> Неопределено Тогда 
		ОтвЛицоГП 	= КС.Конвертировать_СведОтвЛицоТип_вСотрудникаЛогистика(ГП_ОтвФЛ_XDTO);
	КонецЕсли;
	
	ГП_ОтвЮЛ_XDTO = КС.XDTO_Вычислить(СодСВИнфПрв, "СвГП.ОтвПриемЮЛ");
	Если ГП_ОтвЮЛ_XDTO <> Неопределено Тогда 
		ОтвЛицоГП_ЮЛ = КС.Конвертировать_СвЮЛУч_вОрганизациюДиадок(ГП_ОтвЮЛ_XDTO);
	КонецЕсли;
	
	ПВ_ОтвФЛ_XDTO = КС.XDTO_Вычислить(СодСВИнфПрв, "СвПрв.СвОтвПрвз");
	Если ПВ_ОтвФЛ_XDTO <> Неопределено Тогда 
		ОтвЛицоПВ 	= КС.Конвертировать_СведОтвЛицоТип_вСотрудникаЛогистика(ПВ_ОтвФЛ_XDTO);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьВодителейИПутевыеЛисты(Знач СодСВИнфПрв)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	МассивВодителей_raw = КС.XDTO_Вычислить(СодСВИнфПрв, "СвПрв.СвВодит");
	МассивСвВодит_XDTO = КС.XDTO_ВычислитьМассивXDTO(МассивВодителей_raw);
	
	Водитель 		= КС.Конвертировать_СвВодит_вВодителяЛогистика(МассивСвВодит_XDTO[0]);
	ДополнительныеВодители.Очистить();
	Если МассивСвВодит_XDTO.Количество() > 1 Тогда 
		Для й = 2 По МассивСвВодит_XDTO.Количество() Цикл 
			ВодительN	= КС.Конвертировать_СвВодит_вВодителяЛогистика(МассивСвВодит_XDTO[й-1]);
			СтрокаДопВодителя = ДополнительныеВодители.Добавить();
			СтрокаДопВодителя.Водитель = ВодительN;
		КонецЦикла;
	КонецЕсли;
	
	МассивПутЛист_raw = КС.XDTO_Вычислить(СодСВИнфПрв, "СвПрв.ПутевойЛист");
	МассивПутЛист_XDTO = КС.XDTO_ВычислитьМассивXDTO(МассивПутЛист_raw);
	
	ПутевойЛистНомер			= КС.XDTO_Вычислить(МассивПутЛист_XDTO[0], "НомерПЛ");
	ПутевойЛистДата_raw			= КС.XDTO_Вычислить(МассивПутЛист_XDTO[0], "ДатаВыпПЛ");
	Если ПутевойЛистДата_raw <> Неопределено Тогда 
		ПутевойЛистДата			= КС.Конвертировать_ДатаТип_вДата(ПутевойЛистДата_raw);
	КонецЕсли;
	ПутевойЛистСрокДействия		= КС.XDTO_Вычислить(МассивПутЛист_XDTO[0], "СвСрокПЛ");
	
	Если МассивПутЛист_XDTO.Количество() > 1 Тогда 
		Для й = 2 По МассивПутЛист_XDTO.Количество() Цикл
			
			ПутЛистN	= МассивПутЛист_XDTO[й-1];
			Если ДополнительныеВодители.Количество() >= й-1 Тогда 
				СтрокаДопВодителя = ДополнительныеВодители[й-2];
			Иначе
				СтрокаДопВодителя = ДополнительныеВодители.Добавить();
			КонецЕсли;
			СтрокаДопВодителя.ПутевойЛистНомер			= КС.XDTO_Вычислить(МассивПутЛист_XDTO[й-1], "НомерПЛ");
			ПутевойЛистДата_raw			= КС.XDTO_Вычислить(МассивПутЛист_XDTO[й-1], "ДатаВыпПЛ");
			Если ПутевойЛистДата_raw <> Неопределено Тогда 
				СтрокаДопВодителя.ПутевойЛистДата		= КС.Конвертировать_ДатаТип_вДата(ПутевойЛистДата_raw);
			КонецЕсли;
			СтрокаДопВодителя.ПутевойЛистСрокДействия	= КС.XDTO_Вычислить(МассивПутЛист_XDTO[й-1], "СвСрокПЛ");
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьТоварыИзXDTO(Знач СвГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ОпГруз_raw 					= КС.XDTO_Вычислить(СвГруз, "ОпГруз");
	МассивОпГруз 				= КС.XDTO_ВычислитьМассивXDTO(ОпГруз_raw);
	
	Для Каждого ОпГруз из МассивОпГруз Цикл 
		
		НоваяСтрокаТовара = Товары.Добавить();
		НоваяСтрокаТовара.Учитывать = Истина;
		НоваяСтрокаТовара.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		НоваяСтрокаТовара.ОтгрузочноеНаименование 	= КС.XDTO_Вычислить(ОпГруз, "НаимГруз");
		НоваяСтрокаТовара.СостояниеГруза 			= КС.XDTO_Вычислить(ОпГруз, "СостГруз");
		НоваяСтрокаТовара.СпособУпаковки 			= КС.XDTO_Вычислить(ОпГруз, "СпУпак");
		ВидТар_raw = КС.XDTO_Вычислить(ОпГруз, "ВидТар");
		Если ЗначениеЗаполнено(ВидТар_raw) Тогда                                          
			НоваяСтрокаТовара.ВидТары 				= Справочники.КонтурЛогистика_КлассификаторУпаковок.НайтиПоКоду(ВидТар_raw);
		КонецЕсли;
		НоваяСтрокаТовара.Плотность 				= КС.XDTO_ВычислитьЧисло(ОпГруз, "Плотн");
		НоваяСтрокаТовара.ГрузДелим 				= КС.XDTO_Вычислить(ОпГруз, "ГрузДелим") = "1";
		
		НоваяСтрокаТовара.ОбъемКонтейнера  			= КС.XDTO_ВычислитьЧисло(ОпГруз, "ОбъемКонт");
		НоваяСтрокаТовара.МассаКонтейнеровБрутто  	= КС.XDTO_ВычислитьЧисло(ОпГруз, "МассаКонт");
		НоваяСтрокаТовара.ДопИнформация  			= КС.XDTO_Вычислить(ОпГруз, "ИнфГруз");
		НоваяСтрокаТовара.ОбъемГруза	  			= КС.XDTO_ВычислитьЧисло(ОпГруз, "Объем");
		НоваяСтрокаТовара.КоличествоМест  			= КС.XDTO_ВычислитьЧисло(ОпГруз, "ПлКолМест");
		
		НоваяСтрокаТовара.Высота  					= КС.XDTO_ВычислитьЧисло(ОпГруз, "Габар.ВысЗнач");
		НоваяСтрокаТовара.Длина  					= КС.XDTO_ВычислитьЧисло(ОпГруз, "Габар.ДлЗнач");
		НоваяСтрокаТовара.Ширина  					= КС.XDTO_ВычислитьЧисло(ОпГруз, "Габар.ШирЗнач");
		
		НоваяСтрокаТовара.ПлановаяМассаГрузаБрутто 	= КС.XDTO_ВычислитьЧисло(ОпГруз, "ПлМасГруз.МасБрутЗнач");
		НоваяСтрокаТовара.КоличествоПаллет		 	= КС.XDTO_ВычислитьЧисло(ОпГруз, "ПлМасГруз.КолПалл");
		
		ЗаполнитьМаркировкиИзXDTO(НоваяСтрокаТовара, ОпГруз);
		
		ЗаполнитьОпасныеГрузыИзXDTO(НоваяСтрокаТовара, ОпГруз);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьКонтейнерыИзXDTO(Знач СодСВИнфПрв)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	СвКонтейн_raw			= КС.XDTO_Вычислить(СодСВИнфПрв, "СвКонтейн");
	МассивСВКонтейнXDTO		= КС.XDTO_ВычислитьМассивXDTO(СвКонтейн_raw);
	Контейнеры.Очистить();
	
	Для й = 1 По МассивСВКонтейнXDTO.количество() Цикл
		
		XDTO_СтрокаКонтейнера = МассивСВКонтейнXDTO[й-1];
		
		НомКонтейн_Массив = КС.XDTO_ВычислитьМассивXDTO(КС.XDTO_Вычислить(XDTO_СтрокаКонтейнера, "НомКонтейн"));
		
		Для Каждого НомерКонтейнера Из НомКонтейн_Массив Цикл
			
			НоваяСтрокаКонтейнера = Контейнеры.Добавить();
			ДатВрСдПгр_raw 							=  КС.XDTO_Вычислить(XDTO_СтрокаКонтейнера, "ДатВрСдПгр");
			НоваяСтрокаКонтейнера.ДатВрСдПгр 		=  КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДатВрСдПгр_raw);
			ДатВрВозврКонт_raw 						=  КС.XDTO_Вычислить(XDTO_СтрокаКонтейнера, "ДатВрВозврКонт");
			НоваяСтрокаКонтейнера.ДатВрВозврКонт 	=  КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДатВрВозврКонт_raw);
			НоваяСтрокаКонтейнера.КодРазТипКонт 	=  КС.XDTO_Вычислить(XDTO_СтрокаКонтейнера, "КодРазТипКонт");
			
			КонтКодСтр 		=  КС.XDTO_Вычислить(XDTO_СтрокаКонтейнера, "КонтКодСтр");
			Если ЗначениеЗаполнено(КонтКодСтр) Тогда 
				НоваяСтрокаКонтейнера.КонтКодСтр = Справочники.КонтурЛогистика_СтраныМира.НайтиПоКоду(СокрЛП(КонтКодСтр));
			КонецЕсли;
			
			НоваяСтрокаКонтейнера.ГрузПодКонт 		=  КС.XDTO_ВычислитьЧисло(XDTO_СтрокаКонтейнера, "ГрузПодКонт");
			НоваяСтрокаКонтейнера.МассаКонт 		=  КС.XDTO_ВычислитьЧисло(XDTO_СтрокаКонтейнера, "МассаКонт");
			НоваяСтрокаКонтейнера.ПрТаблПломб 		=  КС.XDTO_Вычислить(XDTO_СтрокаКонтейнера, "ПрТаблПломб") = "1";
			
			НоваяСтрокаКонтейнера.НомКонтейн 		=  НомерКонтейнера;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьОпасныеГрузыИзXDTO(Знач НоваяСтрокаТовара, Знач ОпГруз)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	СвОпГруз_XDTO = КС.XDTO_Вычислить(ОпГруз, "СвОпГруз");
	Если СвОпГруз_XDTO <> Неопределено Тогда
		
		НоваяСтрокаОпГр = ОпасныеГрузы.Добавить();
		НоваяСтрокаОпГр.ИдентификаторСтрокиТоваров = НоваяСтрокаТовара.ИдентификаторСтроки;
		
		НоваяСтрокаОпГр.НомерООН 						= КС.XDTO_Вычислить(СвОпГруз_XDTO, "НомООН");
		НоваяСтрокаОпГр.НадлежащееОтгрузочноеНаименование = КС.XDTO_Вычислить(СвОпГруз_XDTO, "НадОтгНаим");
		НоваяСтрокаОпГр.ТехническоеНаименование 		= КС.XDTO_Вычислить(СвОпГруз_XDTO, "ТехНаим");
		НоваяСтрокаОпГр.Описание 						= КС.XDTO_Вычислить(СвОпГруз_XDTO, "Описание");
		Класс_raw = КС.XDTO_Вычислить(СвОпГруз_XDTO, "Клас");
		НоваяСтрокаОпГр.Класс 							= Перечисления.КонтурЛогистика_КлассыОпасностиГрузов.ЗначениеИзXDTO(Класс_raw);
		НоваяСтрокаОпГр.КлассификационныйКод 			= КС.XDTO_Вычислить(СвОпГруз_XDTO, "КласКод");
		ГруппаУпаковки_raw = КС.XDTO_Вычислить(СвОпГруз_XDTO, "ГрУп");
		НоваяСтрокаОпГр.ГруппаУпаковки 					= Перечисления.КонтурЛогистика_ГруппыУпаковки.ЗначениеИзXDTO(ГруппаУпаковки_raw);
		НоваяСтрокаОпГр.ЗнакОпасности 					= КС.XDTO_Вычислить(СвОпГруз_XDTO, "ЗнОп");
		НоваяСтрокаОпГр.КодОграниченияТуннели 			= КС.XDTO_Вычислить(СвОпГруз_XDTO, "КодОгрЧерТун");
		НоваяСтрокаОпГр.Радионуклиды 					= КС.XDTO_Вычислить(СвОпГруз_XDTO, "НазРадионук");
		НоваяСтрокаОпГр.ОписаниеФизХимФормы 			= КС.XDTO_Вычислить(СвОпГруз_XDTO, "ОписФизХимФорм");
		НоваяСтрокаОпГр.МаксАктивностьРадиации 			= КС.XDTO_Вычислить(СвОпГруз_XDTO, "МаксАкт");
		НоваяСтрокаОпГр.КатегорияУпаковки 				= КС.XDTO_Вычислить(СвОпГруз_XDTO, "КатУпак");
		НоваяСтрокаОпГр.ТранспортныйИндекс 				= КС.XDTO_Вычислить(СвОпГруз_XDTO, "ТрансИндекс");
		НоваяСтрокаОпГр.ИндексБезопасности 				= КС.XDTO_Вычислить(СвОпГруз_XDTO, "ИндексБез");
		НоваяСтрокаОпГр.ОпознавательныйЗнакСертификатов = КС.XDTO_Вычислить(СвОпГруз_XDTO, "ОпозЗнак");
		НоваяСтрокаОпГр.ПолнаяАктивностьГруза 			= КС.XDTO_Вычислить(СвОпГруз_XDTO, "ПолнАктГр");
		НоваяСтрокаОпГр.ОбМасНетВзрСод 					= КС.XDTO_Вычислить(СвОпГруз_XDTO, "ОбМасНетВзрСод");
		НоваяСтрокаОпГр.ОбМасНетВзрСодВсех 				= КС.XDTO_Вычислить(СвОпГруз_XDTO, "ОбМасНетВзрСодВсех");
		НоваяСтрокаОпГр.ПроцСмеси 						= КС.XDTO_Вычислить(СвОпГруз_XDTO, "ПроцСмеси");
		НоваяСтрокаОпГр.ДатаИстеченияВремениУдержания 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(СвОпГруз_XDTO, "ДатИстВрУдер"));
		НоваяСтрокаОпГр.КонтрольнаяТемпература 			= КС.XDTO_Вычислить(СвОпГруз_XDTO, "КонтТемпер");
		НоваяСтрокаОпГр.АварийнаяТемпература 			= КС.XDTO_Вычислить(СвОпГруз_XDTO, "АварТемпер");
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьМаркировкиИзXDTO(Знач НоваяСтрокаТовара, Знач ОпГруз)
	
	Перем МаркировкаЗначение, МассивМаркировок, НоваяСтрокаМаркировки, стрМаркировки_raw;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	стрМаркировки_raw = КС.XDTO_Вычислить(ОпГруз, "Марк");
	
	Если стрМаркировки_raw <> Неопределено Тогда 
		Если ТипЗнч(стрМаркировки_raw) = Тип("Строка") Тогда 
			МассивМаркировок = Новый Массив;
			МассивМаркировок.Добавить(стрМаркировки_raw);
		Иначе
			МассивМаркировок = КС.XDTO_ВычислитьМассивXDTO(стрМаркировки_raw);
		КонецЕсли;
	КонецЕсли;
	Для Каждого МаркировкаЗначение Из МассивМаркировок Цикл 
		НоваяСтрокаМаркировки = Маркировки.Добавить();
		НоваяСтрокаМаркировки.ИдентификаторСтрокиТоваров = НоваяСтрокаТовара.ИдентификаторСтроки;
		НоваяСтрокаМаркировки.ЗначениеМаркировки = МаркировкаЗначение;
	КонецЦикла;

КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Генерация xml

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_СВ_ТитулПВ.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	ДатИнфПрв = ТекущаяДатаСеанса();
	ВрИнфПрв = ТекущаяДатаСеанса();
	
	Попытка
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфПрв, ВрИнфПрв);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										ТипТитула,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфГО и ВрИнфГО
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = "Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить(ТекстОшибки);
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(1, ,"__SoprVed");
	
	GUID = Строка(Новый УникальныйИдентификатор);
	НомерТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.НомерТитула(ТипТитула);
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаСВ(НомерТитула, 
												ДокументСВ.Грузоотправитель,
												ДокументСВ.Перевозчик,
												ДокументСВ.Грузополучатель,
												GUID); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументСВ.Перевозчик, ПользовательПодписант, ДокументСВ.ДатаСВ, ЭтотОбъект, ПараметрНастроекПодписания);
	XDTO_Подписант 		= КС.XDTO_Подписант(1, "__SoprVed", , ПодписантСтруктура, неопределено); // TODO МЧД
	
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(1, "__SoprVed", , XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	СодСВИнфПрв = КС.XDTO_СодСВИнфПрв(1, , Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодСВИнфПрв", СодСВИнфПрв);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьИспользованиеУИДа(ПолученныйУИД, Отказ, Организация)
	
	УспешноОтметилиИспользованиеУИД = РегистрыСведений.КонтурЛогистика_УИДыГИС.ОтметитьИспользованным(УИД_СВ, Организация);
	Если УспешноОтметилиИспользованиеУИД Тогда
		
		Если ЗначениеЗаполнено(ДокументСВ) И ДокументСВ.УИД <> ПолученныйУИД Тогда 
			ЗаписатьУИДвГлавныйДокумент();
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		Сообщить("УИД из пула был использован другим документом, попробуйте повторить операцию");
		
	КонецЕсли;
	
КонецПроцедуры		

Процедура ЗаписатьУИДвГлавныйДокумент()
	
	ДокументСВОбъект = ДокументСВ.ПолучитьОбъект();
	ДокументСВОбъект.УИД = УИД_СВ;
	ДокументСВОбъект.Записать();
	
КонецПроцедуры	

#КонецЕсли