
// СОБЫТИЯ ФОРМЫ
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТоварыХарактеристика.Видимость = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики() 
												И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяХарактеристики") = Истина;
	
	ОбновитьДанныеФормы();
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	
	РазблокироватьДанныеФормыДляРедактирования();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// баги старой платформы при отрисовке сложных группировок:
	// в режиме интерфейса 8.2 отображаем в режиме "на отдельных закладках" шапку и тч
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоИнтерфейс82() Тогда 
		ШапкаНаОтдельнойЗакладке = Истина;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШапка;
		элементы.Группа16.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;

	УправлениеВидимостьюИДоступностью(); // в будущем завернуть на проверить документ
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" 
		И 	(Параметр = Объект.Ссылка 
				ИЛИ
			(Параметр <> Неопределено 
			И ТипЗнч(Параметр) = Тип("Массив") 
			И Параметр.Найти(Объект.Ссылка) <> Неопределено)) Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполнитьТребуемыеДействияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		И ЗначениеЗаполнено(Объект.ДокументОснование)
		И (ЗавершениеРаботы = Неопределено Или Не ЗавершениеРаботы)Тогда
		
		УдалитьЗН();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗН()
	
	ДокЗН = Объект.ДокументЗН;
	Если ЗначениеЗаполнено(ДокЗН) Тогда 
		ДокЭТРНОбъект = ДокЗН.ПолучитьОбъект();
		ДокЭТРНОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.ДокументЗН, Истина);
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда 
		ПерешелВЛогистическиеСтатус = Истина;
	Иначе
		ПерешелВЛогистическиеСтатус = Ложь;
	КонецЕсли;
	ПерешелВЛогистическиеСтатус = Ложь; // не переходит в логистические статусы
	
	Элементы.ТекущийСтатус.Видимость = Не ПерешелВЛогистическиеСтатус;
	
	ПересчитатьЗаголовкиКоличества();
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Повторно выполнить задачу";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Переотправить неподписанный (черновик)";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Выполнить задачу";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Отправить неподписанный (черновик)";
	КонецЕсли;

	//Элементы.ДокументЭТРНПогрузкаСотрудник.Видимость = ЗначениеЗаполнено(Объект.ДокументЭТРН.ПогрузкаСотрудник);
	//Элементы.ДокументЭТРННомЗак.Видимость = ЗначениеЗаполнено(Объект.ДокументЭТРН.НомЗак);
	//Элементы.ДокументЭТРНПрицеп.Видимость = ЗначениеЗаполнено(Объект.ДокументЭТРН.Прицеп);
	
	//Элементы.ГруппаЭкспедиция.Видимость = Объект.ДокументЭТРН.ЭтоЭкспедиция = Истина;
	
	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	//Элементы.ФормаОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = ЭтоВходящий И Не ЕстьДокУчСист;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
	КонецЕсли;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;
	
	//Элементы.ПерезаполнитьПоДокОснованию.Видимость = НЕ ЭтоВходящий И ЕстьДокУчСист;
	//Элементы.ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = НЕ ЕстьДокУчСист;
	Элементы.ПользовательПодписант.Видимость = НЕ ЭтоВходящий;
	
	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, Объект.ДокументОснование, Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЗаголовкиКоличества()
	Элементы.ТоварыКоличествоМест.Заголовок = Объект.Товары.Итог("КоличествоМест");	
	Элементы.ТоварыКоличество.Заголовок = Объект.Товары.Итог("Количество");	
КонецПроцедуры


&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьПиктограммыОшибокТабличнойЧасти(Объект.Товары, ТаблицаОшибок, "Товары", "КартинкаОшибок");
	
	ЗаполнитьТребуемыеДействияТоваров(); 	// требуемые действия зависят от результатов проверки 
	УправлениеВидимостьюИДоступностью(); 	// доступность команд
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ЗН_Титул1.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		СтрокаТовара.Картинка = 0;
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции

// УПРАВЛЕНИЕ ВИДИМОСТЬЮ И ДОСТУПНОСТЬЮ
&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	УстановитьПоложениеСохраняемыхЭлементов();
	УстановитьФорматыКолонокСКоличеством();

	УстановитьВидимостьЭлементов();
	УстановитьВидимостьНеучитываемыхИФильтраОшибок();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ИсправлениеФИОЛиц.Видимость = Объект.НомИспр <> 0;
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("БратьУИДИзПулаДляЗН") Тогда
		
		Элементы.УИД_ЗН.ПодсказкаВвода = "взять из пула";
		
	Иначе
		
		Элементы.УИД_ЗН.ПодсказкаВвода = "получим после отправки";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеСохраняемыхЭлементов()
	
	УстановитьПоложениеШапки();
	УстановитьСвернутостьПодробностейОТоварах();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвернутостьПодробностейОТоварах()
	
	Элементы.ГруппаПодробныеСведенияСвернутая.Видимость = СкрытьПодробностиТоваров;
	Элементы.ГруппаПодробныеСведения.Видимость = НЕ Элементы.ГруппаПодробныеСведенияСвернутая.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФорматыКолонокСКоличеством()
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары, "МассаПлановаяНеттоКг", Элементы.ТоварыМассаПлановаяНеттоКг);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары, "МассаПлановаяБруттоКг", Элементы.ТоварыМассаПлановаяБруттоКг);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары, "Количество", Элементы.ТоварыКоличество);
	КонтурЛогистика_ОбщегоНазначенияКлиент.УстановитьФорматКолонкиКоличества(Объект.Товары, "Плотность", Элементы.ТоварыПлотность);
	
КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
КонецПроцедуры


&НаКлиенте
Процедура ПеречитатьОбъект(Команда)
	
	ОбработчикПеречитатьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ПолностьюОбновитьПредставлениеДанных();
	ОбновитьДанныеФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПолностьюОбновитьПредставлениеДанных()

	//УстановитьТипыЗначенийРеквизитов(); // TODO
	
	ОповеститьОбИзменении(Объект.ДокументЗН);
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	
	ЗаполнитьТребуемыеДействияТоваров();
	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТребуемыеДействияТоваров()

	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		
		СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТребуемоеДействиеСтрокиТовара(СтрокаТовара)
	
	Если СтрокаТовара = Неопределено Тогда 	
		Возврат;
	КонецЕсли;
	
	СтрокаТовара.ТребуемоеДействие = "";
	
	// Блок 1 - Требуемые действия ведения пользователя за ручку по номенклатуре
	
	Если НЕ СтрокаТовара.Учитывать Тогда 
		СтрокаТовара.ТребуемоеДействие = "Не учитывается";
		Возврат;
	КонецЕсли;
	
	// Для исходящих одни требуемые действия, а для исходящих другие
	Если ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен") Тогда 
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ИспользоватьИПрименятьБазовыеСоответствия") Тогда 
			// эти требуемые действия блока 1 не являются блокирующими по документу - они только ведут пользователя
			Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда 
				СтрокаТовара.ТребуемоеДействие = "Указать Номенклатуру";
				
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.УпаковкаЕдиницаИзмерения) Тогда 
				СтрокаТовара.ТребуемоеДействие = "Указать Единицу измерения";
				
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаТовара.Количество) Тогда 
				СтрокаТовара.ТребуемоеДействие = "Указать Количество";
				
				
			ИначеЕсли
					Не ЗначениеЗаполнено(СтрокаТовара.КоличествоМест) 
					ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.СпособУпаковки) 
					ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.СостояниеГруза) 
					ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.ВидТары) 
					ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.МассаПлановаяБруттоКг) 
					ИЛИ Не ЗначениеЗаполнено(СтрокаТовара.ОтгрузочноеНаименование) Тогда
					
				Если КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ТребоватьНаличиеБазовыхСоответствий") Тогда 
					СтрокаТовара.ТребуемоеДействие = "Установить соответствие";
				Иначе
					СтрокаТовара.ТребуемоеДействие = "Заполнить обязательные поля";
				КонецЕсли;
				
			Иначе
				СтрокаТовара.ТребуемоеДействие = "Готов";
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда 
			СтрокаТовара.ТребуемоеДействие = "Сопоставить";
		Иначе
			СтрокаТовара.ТребуемоеДействие = "ОК";
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()

	Представления = ПолучитьПредставлениеРеквизитовДокументаОснования(Объект.ДокументОснование, Объект);	
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл 
		
		Значение = Неопределено;
		
		Если  Представления.Свойство("ДокУчСист_" + Эл.Ключ, Значение) Тогда 
			текВыражение = "ДокУчСист_" + Эл.Ключ  + " = Значение";
			Выполнить (текВыражение);
			
			
			// определим доступность команды сопоставления
			ИмяЭлементаЛогистика = Эл.Значение; // сконвертированного
			ИмяЭлементаНадписиСопоставить = "ДокУчСист_" + Эл.Ключ + "_Сопоставить";
			
			Если ЗначениеЗаполнено(ИмяЭлементаЛогистика) Тогда // если этот элемент выведен на форму
				
				Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
					
					ПутьПроверкиДанных = Элементы.Найти(ИмяЭлементаЛогистика).ПутьКДанным;
					ЗначениеВРеквизите = Вычислить(ПутьПроверкиДанных);
					НужноСопоставить = Не ЗначениеЗаполнено(ЗначениеВРеквизите);
					
				Иначе
					
					НужноСопоставить = Ложь;
					
				КонецЕсли;
				
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость = НЕ НужноСопоставить;
				Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = НужноСопоставить;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРеквизитовДокументаОснования(ДокументОснование, Знач ДокументТитулОбъект)
	
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	СтруктураПредставлений = Новый Структура;
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл 
		СтруктураПредставлений.Вставить("ДокУчСист_" + Эл);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда 
		
		НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул1, ДокументОснование);
		
		Если НастройкаКонвертации <> Неопределено Тогда
			
			Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл 
				
				//Если Эл.Ключ = "Водитель" Тогда // в другой ТЧ 
				//	НастройкаКонвертацииРеквизита = НастройкаКонвертации.ПравилаКонвертацииТитулаРеквизиты.Найти(Эл.Ключ, "РеквизитТитула");
				//Иначе
					НастройкаКонвертацииРеквизита = НастройкаКонвертации.ПравилаКонвертацииГлавногоДокумента.Найти(Эл.Ключ, "РеквизитТитула");
				//КонецЕсли;
				
				РезультатВычисления = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьРеквизитОснования(
											ДокументОснование,
											НастройкаКонвертацииРеквизита,
											НастройкаКонвертации,
											ДокументТитулОбъект,
											Ложь);
				
				Если РезультатВычисления.Успешно Тогда 
					СтруктураПредставлений.Вставить("ДокУчСист_" + Эл.Ключ, 	РезультатВычисления.Значение);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		 
	КонецЕсли;
	
	Возврат СтруктураПредставлений;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()
	
	Перем МассивКонвертируемыхРеквизитов;
	
	МассивКонвертируемыхРеквизитов = Новый Соответствие;
	МассивКонвертируемыхРеквизитов.Вставить("Фрахтователь"	, "ДокументЗНФрахтователь");
	МассивКонвертируемыхРеквизитов.Вставить("Фрахтовщик"	, "ДокументЗНФрахтовщик");
	МассивКонвертируемыхРеквизитов.Вставить("МестоПодачи"	, "ДокументЗНМестоПодачи");
	
	Возврат МассивКонвертируемыхРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДокУчСист_Реквизит_СопоставитьНажатие(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	ОбъектДокУчСистПуть = "ЭтаФорма." + СтрЗаменить(ИмяЭлемента, "_Сопоставить", "");
	ЗначениеОбъектДокУчСист = Вычислить(ОбъектДокУчСистПуть);
	
	ОткрытьФормуПодбораСущностиЛогистика(ЗначениеОбъектДокУчСист, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)
	
	ПараметрыФормыПоиска = Новый Структура;
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);
	
	Если Элемент.Имя = "ДокУчСист_Фрахтователь_Сопоставить"
		ИЛИ Элемент.Имя = "ДокУчСист_Фрахтовщик_Сопоставить"
		Тогда 
		
		ИмяСущности = "КонтурЛогистика_ОрганизацииДиадок";
		
	ИначеЕсли Элемент.Имя = "ДокУчСист_МестоПодачи_Сопоставить"
		Тогда
		
		ИмяСущности = "КонтурЛогистика_ПунктыМаршрута";
		
	Иначе
		
		ВызватьИсключение "не реализовано";
		
	КонецЕсли;
	
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник." + ИмяСущности + ".ФормаВыбора",
			ПараметрыФормыПоиска,
			ЭтаФорма,
			ЭтаФорма,
			"ОбработчикВыбораСопоставленияРеквизитаДокумента",
			ПараметрыОбработчика);
	
	
КонецПроцедуры


// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура СвернутьШапку(Команда)
	
	ШапкаНаОтдельнойЗакладке = Истина;
	УстановитьПоложениеШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьШапку(Команда)
	
	ШапкаНаОтдельнойЗакладке = Ложь;
	УстановитьПоложениеШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеШапки()
	
	Если ШапкаНаОтдельнойЗакладке Тогда
		
		текАктивнаяЗакладка = Элементы.Страницы.ТекущаяСтраница;
		
		ПереместитьШапкуВызовСервера();
		//Элементы.Переместить(Элементы.ГруппаШапкаЛево, Элементы.СтраницаШапка);
		Элементы.СвернутьШапку.Видимость = Ложь;
		Элементы.РазвернутьШапку.Видимость = Истина;
		
		ПанельОшибокРазвернута = Элементы.ПанельОшибок.РастягиватьПоВертикали;
		Если Не ПанельОшибокРазвернута Тогда 
			ПанельОшибокСвернутьРазвернутьВызовОМ();
		КонецЕсли;
		                                             
		Элементы.Страницы.ТекущаяСтраница = текАктивнаяЗакладка;
		
	Иначе
		
		ПереместитьШапкуВызовСервера();
		//Элементы.Переместить(Элементы.ГруппаШапкаЛево, Элементы.ГруппаШапкаМестоположение);
		Элементы.СвернутьШапку.Видимость = Истина;
		Элементы.РазвернутьШапку.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПереместитьШапкуВызовСервера()
	
	Если ШапкаНаОтдельнойЗакладке Тогда
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма, Элементы.ГруппаШапкаДанные, Элементы.СтраницаШапка);
	Иначе
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма, Элементы.ГруппаШапкаДанные, Элементы.ГруппаШапкаМестоположение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоДокОснованию(Команда)
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("Да, и ЭТрН и Титул");
	СписокКнопок.Добавить("Да, только Титул");
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика("Действие полностью перезаполнит документ по Основанию. Вы АБСОЛЮТНО уверены?",
		СписокКнопок,
		"Подтвердите операцию",
		,
		ЭтаФорма,
		"ОбработчикСогласияПерезаполнения");
		
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработчикСогласияПерезаполнения(Ответ, ДопПараметр = Неопределено) Экспорт
	
	Если Ответ = "Да, и ЭТрН и Титул" Тогда 
		ПерезаполнитьПоДокОснованиюСервер(Истина);
		ОбновитьДанныеФормы();
	ИначеЕсли Ответ = "Да, только Титул" Тогда
		ПерезаполнитьПоДокОснованиюСервер(Ложь);
		ОбновитьДанныеФормы();
	КонецЕсли;
	
	ОбновитьОтображениеДанных();
	ПолностьюОбновитьПредставлениеДанных();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер(ПерезаполнятьГлавныйДокумент = Ложь)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Объект.Товары.Очистить();
		Объект.Маркировки.Очистить();
		Объект.ОпасныеГрузы.Очистить();
		Объект.Контейнеры.Очистить();
		Объект.ТелефоныПереадресующего.Очистить();
		Объект.ДополнительныеВодители.Очистить();
		Объект.СведенияГосСистем.Очистить();
		
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ДокОбъект.Заполнить(Новый Структура("ДокументОснование, ТипЛогистика, ПерезаполнитьГлавныйДокументЕслиСуществует", ДокОбъект.ДокументОснование, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, ПерезаполнятьГлавныйДокумент));
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()
	
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
	
КонецПроцедуры

// Управление положением подробных сведений о товаре

&НаКлиенте
Процедура СвернутьПодробныеСведенияНажатие(Элемент)
	
	СкрытьПодробностиТоваров = Истина;
	УстановитьСвернутостьПодробностейОТоварах();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаРазвернутьПодробностиТоваровНажатие(Элемент)
	
	СкрытьПодробностиТоваров = Ложь;
	УстановитьСвернутостьПодробностейОТоварах();
	
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МаркировкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТекИдентификаторСтрокиТовара(НоваяСтрока, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекИдентификаторСтрокиТовара(Знач НоваяСтрока, Знач Элемент)
	
	Перем ТекТовар;
	
	Если НоваяСтрока Тогда 
		
		ТекТовар = Элементы.Товары.ТекущиеДанные;
		
		Элемент.ТекущиеДанные.ИдентификаторСтрокиТоваров = ТекТовар.ИдентификаторСтроки;
		
	КонецЕсли
	
КонецПроцедуры


// События ТЧ Товары
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	СформироватьТребуемоеДействиеСтрокиТовара(Элемент.ТекущиеДанные);
	ПересчитатьЗаголовкиКоличества();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТоварыТребуемоеДействие" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекДанные = Элемент.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда 
			
			ТребуемоеДействие = ТекДанные.ТребуемоеДействие; 
			ПараметрыТекСтрока = ВыбраннаяСтрока;
			Если ТребуемоеДействие 		= "Указать Номенклатуру" Тогда
				
				ТипСправочникаНоменклатура = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяСправочникаНоменклатура");
				
				КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_УчетнойСистемы(
					"Справочник." + ТипСправочникаНоменклатура + ".ФормаВыбора",
					,
					ЭтаФорма,
					ЭтаФорма,
					"ОбработчикВыбораНоменклатуры",
					ПараметрыТекСтрока);
					
			ИначеЕсли ТребуемоеДействие = "Указать Единицу измерения" Тогда
				
				Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыУпаковкаЕдиницаИзмерения;
				Элементы.Товары.ИзменитьСтроку();
					
			ИначеЕсли ТребуемоеДействие = "Указать Количество" Тогда
				
				Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыКоличество;
				Элементы.Товары.ИзменитьСтроку();
					
			ИначеЕсли ТребуемоеДействие = "Установить соответствие"
				ИЛИ ТребуемоеДействие = "Не учитывается" Тогда
				
				ОткрытьСоответствияТекущейСтроки();
				
			Иначе // требуемое действие от таблицы ошибок
				
				ОбработатьТребуемоеДействие(ТребуемоеДействие, Неопределено);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ОтборСтрок = Неопределено;
	
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда  
		
		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиТоваров", Элемент.ТекущиеДанные.ИдентификаторСтроки);	
		
	КонецЕсли;	
					
	Элементы.Маркировки.ОтборСтрок 			= ОтборСтрок;
	Элементы.Контейнеры.ОтборСтрок 			= ОтборСтрок;
	Элементы.ОпасныеГрузы.ОтборСтрок 		= ОтборСтрок;					
					
	КонтурЛогистика_ПанельОшибокКлиент.УстановитьОтборТаблицыОшибокПоНомеруСтроки(ТаблицаОшибок, Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

// Обработчики для требуемых действий

&НаКлиенте
Процедура ОбработатьТребуемоеДействие(ТребуемоеДействие, ПолеТаблицыОшибок = Неопределено)
	
	// реализуем отдельную обработку некоторых требуемых действий
	Если Ложь Тогда // Какие-то особенные UI для требуемых действий, например: ТребуемоеДействие = "Исправить GTIN" Тогда
		
	Иначе // типовая обработка таблицы ошибок
		
		Если ПолеТаблицыОшибок <> Неопределено Тогда
			КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, ПолеТаблицыОшибок.Имя);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоответствияТекущейСтроки()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = "Табличная часть пуста! Сначала добавьте товар.";
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения);	
		
	Иначе

		текНоменклатура = ТекущиеДанные.Номенклатура; 
		текЕдиница = ТекущиеДанные.УпаковкаЕдиницаИзмерения; 
		текХарактеристика = ТекущиеДанные.Характеристика; 
		
		Если ЗначениеЗаполнено(текНоменклатура) Тогда
			
			ПараметрыФормыСоответствий = Новый Структура;
			ПараметрыФормыСоответствий.Вставить("Номенклатура", текНоменклатура);
			ПараметрыФормыСоответствий.Вставить("Сопоставление", Истина);
			
			Если НаНоменклатуруУжеЕстьКакоеЛибоБазовоеСоответствие(текНоменклатура) Тогда 
			
				КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.Форма.ФормаНабораЗаписей",
						ПараметрыФормыСоответствий,
						ЭтаФорма,
						ЭтаФорма,
						"ОбработчикИзмененияСоответствий",
						текНоменклатура);
					
			Иначе
						
				ПараметрыФормыСоответствий.Вставить("УпаковкаЕдиницаИзмерения", текЕдиница);
				ПараметрыФормыСоответствий.Вставить("Характеристика", текХарактеристика);
				
				КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.Форма.ФормаЗаписи",
						ПараметрыФормыСоответствий,
						ЭтаФорма,
						ЭтаФорма,
						"ОбработчикИзмененияСоответствий",
						текНоменклатура);
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция НаНоменклатуруУжеЕстьКакоеЛибоБазовоеСоответствие(текНоменклатура)
	
	ВыборкаПоНоменклатуре = РегистрыСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.Выбрать(Новый Структура("Номенклатура", текНоменклатура));
	Если ВыборкаПоНоменклатуре.Следующий() Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТоварыДобавить(Команда)
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);	
	НоваяСтрока.Учитывать = Истина;	
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики()
		И КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ИспользуютсяХарактеристики() Тогда 
		НоваяСтрока.Характеристика =  КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ПустаяХарактеристика();
	КонецЕсли;
	
	ПроверитьДокумент();
	ЗаполнитьТребуемыеДействияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкопировать(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьНеучитываемые(Команда)
	
	СкрытьНеучитываемые = Не СкрытьНеучитываемые;
	УстановитьВидимостьНеучитываемыхИФильтраОшибок();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНеучитываемыхИФильтраОшибок()
	
	КонтурЛогистика_ОбработкаДокументовКлиент.УстановитьВидимостьНеучитываемыхИФильтраОшибок(Объект.Товары, СкрытьНеучитываемые, Элементы.Товары, Элементы.ТоварыИтоги);
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПлотностьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанные.Плотность = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОкруглитьПлотность(ТекущиеДанные.Плотность);
	
КонецПроцедуры
