#Область СобытияФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_СписокРасширенныйНаименованиеПолное", "СписокРасширенныйПоискНоменклатура",, 1, "СписокНоменклатура.Ссылка.НаименованиеПолное");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_СписокСтандартныйНаименованиеПолное", "СписокСтандартныйПоискНоменклатура",, 1, "СписокНоменклатура.Ссылка.НаименованиеПолное");
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_ПеревестиНоменклатуруНаНовыйУчет", "Перевести номенклатуру на новый учет", "АУ_ПеревестиНоменклатуруНаНовыйУчет");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ПеревестиНоменклатуруНаНовыйУчет", Элементы.СписокРасширенныйПоискНоменклатураКонтекстноеМеню,, "АУ_ПеревестиНоменклатуруНаНовыйУчет");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ПеревестиНоменклатуруНаНовыйУчет1", Элементы.СписокСтандартныйПоискНоменклатураКонтекстноеМеню,, "АУ_ПеревестиНоменклатуруНаНовыйУчет");
	
	События = Новый Структура;
	События.Вставить("ПриИзменении", "АУ_ПриИзмененииОтображенияАрхива");
	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(ЭтаФорма, "АУ_ПоказыватьАрхив", АУ_СозданиеЭлементовФормы.ОписаниеТипаБулево());
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ПоказыватьАрхив", "ГруппаПанельКатегорий", "Показывать архивные позиции", 2, "АУ_ПоказыватьАрхив",, События);
	УстановитьОтборПоАрхиву();
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовИКоманды

&НаКлиенте
Процедура АУ_ПеревестиНоменклатуруНаНовыйУчет(Конмада)
	
	Если Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаРасширенныйПоискНоменклатура Тогда
		ТекущаяСтрока = Элементы.СписокРасширенныйПоискНоменклатура.ТекущаяСтрока;
	ИначеЕсли Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаСтандартныйПоискНоменклатура Тогда
		ТекущаяСтрока = Элементы.СписокСтандартныйПоискНоменклатура.ТекущаяСтрока;
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АУ_ОбщиеПроцедурыИФункцииВызовСервера.ПеревестиНоменклатуруНаНовыйУчет(ТекущаяСтрока);
	
	Элементы.СписокРасширенныйПоискНоменклатура.Обновить();
	Элементы.СписокСтандартныйПоискНоменклатура.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ПриИзмененииОтображенияАрхива(Элемент)
	
	УстановитьОтборПоАрхиву();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура УстановитьОтборПоАрхиву()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокНоменклатура, "Ссылка.АУ_ВАрхиве", Ложь, ВидСравненияКомпоновкиДанных.Равно,, НЕ ЭтаФорма.АУ_ПоказыватьАрхив, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

#КонецОбласти