#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
			
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.ДокументОснование.Метаданные()) Тогда
		
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения.ДокументОснование, СтандартнаяОбработка);
		
	КонецЕсли;
	
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	Если Не Отказ И ЗначениеЗаполнено(НомерДОПП) Тогда
		СтруктураШапкиДокумента = ЗаполнитьСтруктуруШапкиДокумента();
		РегистрыСведений.ДокументыОПредстоящейПоставке.ЗаписьДанныхДОПП(СтруктураШапкиДокумента);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, "Товары");
	
	ИспользоватьПодакцизныеТовары = УчетПодакцизныхТоваров.ИспользуетсяИмпортПодакцизныхТоваров(Организация, Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = УчетПодакцизныхТоваров.ТекстЗапросаНомераСтрокДляОчисткиСуммыАкциза();
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(, "НомерСтроки, Номенклатура, СуммаАкциза"));
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Страна", ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(Организация));
	Запрос.УстановитьПараметр("ИспользоватьПодакцизныеТовары", ИспользоватьПодакцизныеТовары);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = Товары[Выборка.НомерСтроки - 1];
		СтрокаТаблицы.НалоговаяБазаАкцизы = 0;
		СтрокаТаблицы.ТвердаяСтавкаАкциза = 0;
		СтрокаТаблицы.АдвалорнаяСтавкаАкциза = 0;
		СтрокаТаблицы.СуммаАкциза = 0;
	КонецЦикла;
	
	СуммаОбеспечительногоПлатежа = Окр(Товары.Итог("ОбеспечительныйПлатеж"));
	
	Если Не Отказ Тогда
		СтарыйНомерДОПП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "НомерДОПП");
		Если ЗначениеЗаполнено(СтарыйНомерДОПП)
			И (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
			Или СтарыйНомерДОПП <> НомерДОПП) Тогда
			РегистрыСведений.ДокументыОПредстоящейПоставке.ОтменаДанныхПоНомеруДОПП(Организация, СтарыйНомерДОПП, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	НомерДОПП = "";
	ДатаДОПП  = Дата(1,1,1);
	
	ИнициализироватьДокумент();
	
	ОбщегоНазначенияУТ.ОчиститьИдентификаторыДокумента(ЭтотОбъект, "Товары");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Организация.Пустая() и ЗначениеЗаполнено(НомерДОПП) Тогда
		// Проверяем наличие проведенных документов по выбранной организации с тем же номером ДОПП.
		ПроверитьДублиДокументов(Отказ);
	КонецЕсли;
	
	ШаблонТекстаОшибкиТовар = НСтр("ru='Не заполнена колонка ""Товар"" в строке %НомерСтроки% списка ""Товары""'");
	ШаблонТекстаОшибкиАкцизы = НСтр("ru='Не заполнен %Реквизит% в строке %НомерСтроки% списка ""Товары""'");
	
	Для Каждого Строка Из Товары Цикл
		
		Префикс = "Объект.Товары[%1].";
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) И Не ЗначениеЗаполнено(Строка.Содержание) Тогда
				
			ТекстОшибки = СтрЗаменить(ШаблонТекстаОшибкиТовар, "%НомерСтроки%", Строка.НомерСтроки);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Строка.НомерСтроки, "Товар"),
				,
				Отказ);
				
		КонецЕсли;
		
		Если Строка.ПодакцизныйТовар Тогда
			
			Если Не ЗначениеЗаполнено(Строка.КБК) Тогда
				
				ТекстОшибки = СтрЗаменить(ШаблонТекстаОшибкиАкцизы, "%Реквизит%", "КБК Акциза");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", Строка.НомерСтроки);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Строка.НомерСтроки, "КБК"),
				,
				Отказ);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.КатегорияПодакцизныхТоваров) Тогда
				
				ТекстОшибки = СтрЗаменить(ШаблонТекстаОшибкиАкцизы, "%Реквизит%", "категория подакцизного товара");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", Строка.НомерСтроки);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Строка.НомерСтроки, "КатегорияПодакцизныхТоваров"),
				,
				Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Строка.СуммаНДС <> 0
			И НЕ ЗначениеЗаполнено(Строка.СтавкаНДС) Тогда
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Заполнение",
				НСтр("ru='% НДС'"),
				Строка.НомерСтроки,
				НСтр("ru='Товары, ввозимые из стран Таможенного Союза'"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Префикс + "СтавкаНДС", , Отказ);
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	ИспользоватьПодакцизныеТовары = УчетПодакцизныхТоваров.ИспользуетсяИмпортПодакцизныхТоваров(Организация, Дата);
	
	Если Не ИспользоватьПодакцизныеТовары Тогда
		
		ПараметрыКонтроля = УчетПодакцизныхТоваров.ПараметрыКонтроляЗаполненияПодакцизныхТоваров();
		ПараметрыКонтроля.ПроверятьСклад = Ложь;
		ПараметрыКонтроля.ШаблонТекстаОшибки = НСтр("ru = 'Для организации ""%Организация%"" запрещен ввоз подакцизного товара ""%Номенклатура%"", указанного в строке %НомерСтроки% списка ""%ПредставлениеТабличнойЧасти%""'");
		ПараметрыКонтроля.ИмяПоляСОшибкой = "Товар";
		
		УчетПодакцизныхТоваров.КонтрольЗаполненияПодакцизныхТоваров(ЭтотОбъект, ПараметрыКонтроля, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)

	СтруктураЗаполненияСтавкиНДС = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ЭтотОбъект);
	СтруктураЗаполненияСтавкиНДС.ИнициализацияВходящегоДокумента = Истина;
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("СкорректироватьСтавкуНДС", СтруктураЗаполненияСтавкиНДС);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий, КэшированныеЗначения);

	Для Каждого Строка Из КэшированныеЗначения.ОбработанныеСтроки Цикл
		Строка.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
			Строка.НалоговаяБазаНДС,
			УчетНДСУПКлиентСервер.ЗначениеСтавкиНДС(Строка.СтавкаНДС),
			Ложь);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуОснованию(Основание, СтандартнаяОбработка)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "ХозяйственнаяОперация");
		
		Если НЕ (РеквизитыОснования.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС
					Или РеквизитыОснования.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки
					Или РеквизитыОснования.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути
					Или РеквизитыОснования.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет) Тогда
			Ошибка = НСтр("ru='Ввод документа о предстоящей поставке на основании заказ поставщику с операцией %Операция% не требуется.'");
			ВызватьИсключение СтрЗаменить(Ошибка, "%Операция%", РеквизитыОснования.ХозяйственнаяОперация);
		КонецЕсли;
		
		ЗаполнитьДокументНаОснованииЗаказаПоставщику(Основание);
		
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Контрагент");
		
		Если ЗначениеЗаполнено(РеквизитыОснования.Контрагент) Тогда
			
			ЗначенияРеквизитовКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыОснования.Контрагент, "ЮрФизЛицо,СтранаРегистрации.УчастникЕАЭС");
			Если НЕ (ЗначенияРеквизитовКонтрагента.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент")
				И ЗначениеЗаполнено(ЗначенияРеквизитовКонтрагента.СтранаРегистрацииУчастникЕАЭС)
				И ЗначенияРеквизитовКонтрагента.СтранаРегистрацииУчастникЕАЭС) Тогда
					
				Ошибка = НСтр("ru='Ввод документа о предстоящей поставке для контрагента %Контрагент% не требуется'");
				ВызватьИсключение СтрЗаменить(Ошибка, "%Контрагент%", РеквизитыОснования.Контрагент);
					
			КонецЕсли;
	
			ЗаполнитьДокументНаОснованииЗаявкиНаВозврат(Основание);
			
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииЗаказаПоставщику(Знач Основание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка   КАК Основание,
	|	ЗаказПоставщику.Проведен КАК Проведен,
	|	ЗаказПоставщику.Дата КАК Дата,
	|	""0"" КАК ОсобыйПризнакДОПП,
	|	Организации.ОсобыйПризнакЗаявителяДОПП КАК ОсобыйПризнакЗаявителя,
	|	Организации.ИнойОсобыйПризнакЗаявителяДОПП КАК ИнойОсобыйПризнакЗаявителя,
	|	ЗаказПоставщику.Подразделение КАК Подразделение,
	|	ЗаказПоставщику.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗаказПоставщику.Организация КАК Организация,
	|	ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказПоставщику.Партнер КАК Партнер,
	|	ЗаказПоставщику.Договор КАК Договор,
	|	ЗаказПоставщику.Валюта КАК Валюта,
	|	ЗаказПоставщику.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЗаказПоставщику.Организация = Организации.Ссылка
	|ГДЕ
	|	ЗаказПоставщику.Ссылка = &Основание";
	Запрос.УстановитьПараметр("Основание", Основание);
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
		
	// Заполнение шапки
	СтрокаРеквизитов = "Организация, Партнер, Контрагент, Договор, Подразделение,
						|НаправлениеДеятельности, Валюта, ОсобыйПризнакДОПП, ИнойОсобыйПризнакЗаявителя";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты, СтрокаРеквизитов);
	
	ТекстЧастиЗапроса = 
	"ВЫБРАТЬ
	|	ДокументОснованиеДОППТовары.НомерСтроки КАК НомерСтроки,
	|	ДокументОснованиеДОППТовары.Номенклатура КАК Номенклатура,
	|	"""" КАК Содержание,
	|	ДокументОснованиеДОППТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ДокументОснованиеДОППТовары.Характеристика КАК Характеристика,
	|	ДокументОснованиеДОППТовары.Упаковка КАК Упаковка,
	|	ДокументОснованиеДОППТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ДокументОснованиеДОППТовары.Количество КАК Количество,
	|	ДокументОснованиеДОППТовары.Сумма КАК ФактурнаяСтоимость,
	|	ДокументОснованиеДОППТовары.Цена КАК Цена,
	|	""0"" КАК ОсобыйПризнакДОПП,
	|	ТоварНоменклатура.КодТНВЭД КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ТоварНоменклатураКонтрагентов.Ссылка ЕСТЬ NULL
	|			ТОГДА ТоварНоменклатура.СтранаПроисхождения
	|		ИНАЧЕ СтраныМираНоменклатурыКонтрагента.Ссылка
	|	КОНЕЦ КАК СтранаПроисхождения
	|ПОМЕСТИТЬ ВтТоварыОснования
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ДокументОснованиеДОППТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК ТоварНоменклатураКонтрагентов
	|			ПО ДокументОснованиеДОППТовары.НоменклатураПартнера = ТоварНоменклатураКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМираНоменклатурыКонтрагента
	|			ПО ТоварНоменклатураКонтрагентов.СтранаПроисхожденияКод = СтраныМираНоменклатурыКонтрагента.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТоварНоменклатура
	|			ПО ДокументОснованиеДОППТовары.Номенклатура = ТоварНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|			ПО ТоварНоменклатура.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|			ПО ТоварНоменклатура.КодТНВЭД = КлассификаторТНВЭД.Ссылка
	|ГДЕ
	|	ДокументОснованиеДОППТовары.Ссылка = &Основание
	|	И НЕ ДокументОснованиеДОППТовары.Отменено
	|	И НЕ ТоварНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга),
	|												ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура";
	
	ДозаполнитьДокумент(Запрос, ТекстЧастиЗапроса, Реквизиты);
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииЗаявкиНаВозврат(Знач Основание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Ссылка   КАК Основание,
	|	ЗаявкаНаВозврат.Проведен КАК Проведен,
	|	ЗаявкаНаВозврат.Дата КАК Дата,
	|	""6"" КАК ОсобыйПризнакДОПП,
	|	Организации.ОсобыйПризнакЗаявителяДОПП КАК ОсобыйПризнакЗаявителя,
	|	Организации.ИнойОсобыйПризнакЗаявителяДОПП КАК ИнойОсобыйПризнакЗаявителя,
	|	ЗаявкаНаВозврат.Подразделение КАК Подразделение,
	|	ЗаявкаНаВозврат.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗаявкаНаВозврат.Организация КАК Организация,
	|	ЗаявкаНаВозврат.Контрагент КАК Контрагент,
	|	ЗаявкаНаВозврат.Партнер КАК Партнер,
	|	ЗаявкаНаВозврат.Договор КАК Договор,
	|	ЗаявкаНаВозврат.Валюта КАК Валюта,
	|	ЗаявкаНаВозврат.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозврат
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЗаявкаНаВозврат.Организация = Организации.Ссылка
	|ГДЕ
	|	ЗаявкаНаВозврат.Ссылка = &Основание";
	Запрос.УстановитьПараметр("Основание", Основание);
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
		
	// Заполнение шапки
	СтрокаРеквизитов = "Организация, Партнер, Контрагент, Договор, Подразделение,
						|НаправлениеДеятельности, Валюта, ОсобыйПризнакДОПП, ИнойОсобыйПризнакЗаявителя";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты, СтрокаРеквизитов);
	
	ТекстЧастиЗапроса = 
	"ВЫБРАТЬ
	|	ДокументОснованиеДОППТовары.НомерСтроки    КАК НомерСтроки,
	|	ДокументОснованиеДОППТовары.Номенклатура   КАК Номенклатура,
	|	"""" КАК Содержание,
	|	NULL                                       КАК НоменклатураПартнера,
	|	ДокументОснованиеДОППТовары.Характеристика КАК Характеристика,
	|	ДокументОснованиеДОППТовары.Упаковка       КАК Упаковка,
	|	ДокументОснованиеДОППТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ДокументОснованиеДОППТовары.Количество КАК Количество,
	|	ДокументОснованиеДОППТовары.Сумма      КАК ФактурнаяСтоимость,
	|	ДокументОснованиеДОППТовары.Цена       КАК Цена,
	|	""6"" КАК ОсобыйПризнакДОПП,
	|	ТоварНоменклатура.КодТНВЭД КАК КодТНВЭД,
	|	ТоварНоменклатура.СтранаПроисхождения КАК СтранаПроисхождения
	|ПОМЕСТИТЬ ВтТоварыОснования
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ВозвращаемыеТовары КАК ДокументОснованиеДОППТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТоварНоменклатура
	|			ПО ДокументОснованиеДОППТовары.Номенклатура = ТоварНоменклатура.Ссылка
	|ГДЕ
	|	ДокументОснованиеДОППТовары.Ссылка = &Основание
	|	И НЕ ДокументОснованиеДОППТовары.Отменено
	|	И НЕ ТоварНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга),
	|												ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура";
	
	ДозаполнитьДокумент(Запрос, ТекстЧастиЗапроса, Реквизиты);
	
КонецПроцедуры




Процедура ДозаполнитьДокумент(Запрос, ТекстЧастиЗапроса, Реквизиты)
	
	ЧастиТекстаЗапроса = Новый Массив();
	ЧастиТекстаЗапроса.Добавить(ТекстЧастиЗапроса);
	
	// Получим параметры расчета суммы Акциза
	ИспользоватьПодакцизныеТовары = УчетПодакцизныхТоваров.ИспользуетсяИмпортПодакцизныхТоваров(
					Реквизиты.Организация, ТекущаяДатаСеанса());
	ТекстЧастиЗапроса =
			УчетПодакцизныхТоваров.ТекстЗапросаДанныеПодакцизныхТоваров(ИспользоватьПодакцизныеТовары, "ВтТоварыОснования");
			
	ЧастиТекстаЗапроса.Добавить(ТекстЧастиЗапроса);

	// Итоговый запрос заполнения табличной части
	ТекстЧастиЗапроса = Документы.ДокументОПредстоящейПоставке.ТекстЗапросаЗаполненияТабличнойЧастиТовары();
	ЧастиТекстаЗапроса.Добавить(ТекстЧастиЗапроса);
	
	ТекстЗапроса = СтрСоединить(ЧастиТекстаЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		
	Запрос.Текст = ТекстЗапроса;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьМногострановойУчет") Тогда
		Запрос.УстановитьПараметр("СтранаРегистрации", ЗначениеНастроекКлиентСерверПовтИсп.ОсновнаяСтрана());
	Иначе
		Страна = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизиты.Организация, "СтранаРегистрации");
		Запрос.УстановитьПараметр("СтранаРегистрации", Страна);
	КонецЕсли;
	
	ОсновнаяСтавкаНДС = УчетНДСУП.СтавкаНДСПоУмолчанию(Реквизиты.Организация, ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ОсновнаяСтавкаНДС", ОсновнаяСтавкаНДС);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДатаСеанса()) - 86400);
	ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Реквизиты.Организация);
	Запрос.УстановитьПараметр("БазоваяВалюта",     ВалютаРегламентированногоУчета);
		
	УстановитьПривилегированныйРежим(Истина);
	ДокументОснование = Реквизиты.Основание;
	ДатаВвоза = ТекущаяДатаСеанса() + 2*86400;
		
	Автор = Пользователи.ТекущийПользователь();
	
	ТоварыОснования = Запрос.Выполнить().Выгрузить();
	СтруктураКурса = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(Валюта, ТекущаяДатаСеанса());
	
	Если СтруктураКурса.КурсЗнаменатель = 0 Тогда
		СтруктураКурса.КурсЧислитель = 1;
		СтруктураКурса.КурсЗнаменатель = 1;
	КонецЕсли;
	
	
	Для каждого СтрокаТаблицыТовары Из ТоварыОснования Цикл
		
		Если СтрокаТаблицыТовары.ОсобыйПризнакДОПП = "0" Тогда
			СтрокаТаблицыТовары.ОбеспечительныйПлатеж = СтрокаТаблицыТовары.СуммаНДС
														+ ?(СтрокаТаблицыТовары.МаркируемаяПродукция, 0 , СтрокаТаблицыТовары.СуммаАкциза);
			// Рассчитаем по фактурной стоимости налоговую базу в рублях на дату принятия на учет.
			Если Валюта <> ВалютаРегламентированногоУчета Тогда
				СтрокаТаблицыТовары.НалоговаяБазаНДС = СтрокаТаблицыТовары.ФактурнаяСтоимость * (СтруктураКурса.КурсЧислитель/СтруктураКурса.КурсЗнаменатель)
														+ СтрокаТаблицыТовары.СуммаАкциза;
			Иначе
				СтрокаТаблицыТовары.НалоговаяБазаНДС = СтрокаТаблицыТовары.ФактурнаяСтоимость + СтрокаТаблицыТовары.СуммаАкциза;
			КонецЕсли;
		
			// Рассчитаем по налоговой базе и ставке сумму НДС
			Если СтрокаТаблицыТовары.НалоговаяБазаНДС <> 0 Тогда
				СтрокаТаблицыТовары.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
					СтрокаТаблицыТовары.НалоговаяБазаНДС,
					УчетНДСУПКлиентСервер.ЗначениеСтавкиНДС(СтрокаТаблицыТовары.СтавкаНДС),
					Ложь);
			КонецЕсли;
				
		Иначе
			
			СтрокаТаблицыТовары.ОбеспечительныйПлатеж = 0;
			СтрокаТаблицыТовары.НалоговаяБазаНДС = 0;
			СтрокаТаблицыТовары.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
			СтрокаТаблицыТовары.СуммаАкциза = 0;
			
		КонецЕсли;
													
		Если СтрокаТаблицыТовары.Цена = 0 И СтрокаТаблицыТовары.КоличествоУпаковок <> 0 Тогда
			СтрокаТаблицыТовары.Цена = СтрокаТаблицыТовары.ФактурнаяСтоимость / СтрокаТаблицыТовары.КоличествоУпаковок;
		КонецЕсли;
		
	
	КонецЦикла;
	
	Товары.Загрузить(ТоварыОснования);
	
КонецПроцедуры

#КонецОбласти

Процедура ПроверитьДублиДокументов(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.Номер
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.НомерДОПП = &НомерДОПП
	|	И ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Организация",        Организация);
	Запрос.УстановитьПараметр("Ссылка",             Ссылка);
	Запрос.УстановитьПараметр("НомерДОПП",          НомерДОПП);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		
		ШаблонТекста = НСтр("ru = 'Для организации %1 с номером ДОПП %2 уже есть проведенный документ ""Документ о предстоящей поставке № %3""'");
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонТекста,
				Выборка.Организация,
				НомерДОПП,
				Выборка.Номер);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , , Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьСтруктуруШапкиДокумента()
	
	СтруктураШапки = Новый Структура();

	СтруктураШапки.Вставить("Организация", Организация);
	СтруктураШапки.Вставить("СсылкаДОПП",  Ссылка);
	СтруктураШапки.Вставить("НомерДОПП",   НомерДОПП);
	СтруктураШапки.Вставить("Комментарий", Комментарий);
	СтруктураШапки.Вставить("Контрагент",  Контрагент);
	СтруктураШапки.Вставить("ПланируемаяДатаВвоза", ДатаВвоза);
	СтруктураШапки.Вставить("СуммаОбеспечительногоПлатежа", СуммаОбеспечительногоПлатежа);
	
	Возврат СтруктураШапки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
