// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off

&НаКлиенте
Перем _МодульПлатформаНаКлиенте;

&НаСервере
Перем _ОбработкаОбъект;

&НаСервере
Перем _МодульЯдроНаСервере;
// BSLLS:MissingVariablesDescription-on
// BSLLS:UnusedLocalVariable-on

//{ СЕРВИСНЫЕ МЕТОДЫ

&НаКлиенте
Функция ОсновнаяФорма() Экспорт
	
	Результат = ВладелецФормы.ОсновнаяФорма();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Модуль_Платформа() Экспорт
	
	Если _МодульПлатформаНаКлиенте = Неопределено Тогда
		_МодульПлатформаНаКлиенте = ВладелецФормы.Модуль_Платформа();
	КонецЕсли;
	
	Возврат _МодульПлатформаНаКлиенте;
	
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Результат = ОсновнаяФорма().Модуль_ЯдроНаКлиенте();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Модуль_ЯдроНаСервере()
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		Модуль = ОбработкаОбъект();
		_МодульЯдроНаСервере = Модуль.Модуль_Ядро();
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

//} СЕРВИСНЫЕ МЕТОДЫ


//{ ОСНОВНЫЕ СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Объект.Свойство("ОбщийКонтекстКлиентСервер", Объект.ОбщийКонтекстКлиентСервер);
	
	Ядро = Модуль_ЯдроНаСервере();
	// BSLLS:UnusedLocalVariable-off
	АдресаИнтернетРесурсов = Ядро.Перечисление_АдресаИнтернетРесурсов();
	// BSLLS:UnusedLocalVariable-on
	
	УстановитьСвойстваФормыТакси();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваФормыТакси()
	
	СвойствоАвтоМаксимальнаяШирина = Новый Структура("АвтоМаксимальнаяШирина", Ложь);
	
	ЗаполнитьЗначенияСвойств(Элементы.Заголовок				, СвойствоАвтоМаксимальнаяШирина);
	ЗаполнитьЗначенияСвойств(Элементы.ТекстДополнительный	, СвойствоАвтоМаксимальнаяШирина);
	ЗаполнитьЗначенияСвойств(Элементы.ТекстОсновной			, СвойствоАвтоМаксимальнаяШирина);
	
	Элементы.ГиперссылкаИнструкции.ЦветТекста = Новый Цвет(83, 106, 194);
	Элементы.ТекстДополнительный.ЦветТекста = Новый Цвет(89, 67, 4);
	
	#Если ВебКлиент Тогда
		Элементы.Сохранить.Видимость = Ложь;
	#КонецЕсли
	
КонецПроцедуры

//} ОСНОВНЫЕ СОБЫТИЯ ФОРМЫ

//{	ИНТЕРФЕЙСНЫЕ ОБРАБОТЧИКИ

&НаКлиенте
Процедура СохранитьКонфигурациюВФайл(Команда)
	
	КатегорияМетрики	= Метрика_НазваниеКатегории();
	ДействиеМетрики		= "Скачать обновление конфигурации";
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_НажатиеКнопки(Метрика_НазваниеФормы(), КатегорияМетрики, ДействиеМетрики);
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Фильтр", "Файл конфигурации 1С (*.cf)|*.cf");
	ПараметрыВыбора.Вставить("Заголовок", "Укажите файл, в который нужно сохранить обновление для вашей конфигурации");
	ПараметрыВыбора.Вставить("ПолноеИмяФайла", "diadoc_storage_cfg.cf");
	
	Платформа = Модуль_Платформа();
	ОписаниеОповещения = Платформа.НовыйОписаниеОповещения("СохранениеКонфигурацииВФайлПутьОкончаниеВыбора", ЭтаФорма);
	Платформа.ПоказатьДиалогВыбораФайла(ОписаниеОповещения, РежимДиалогаВыбораФайла.Сохранение, ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранениеКонфигурацииВФайлПутьОкончаниеВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанныеФайлаОбновления = Неопределено;
	
	Попытка
		
		ДвоичныеДанныеФайлаОбновления = ФайлПодсистемыХраненияДанных();
		
	Исключение
		
		ДействиеМетрики = "СкачатьФайлПодсистемыХраненияДиадок";
		ИнформацияОбОшибкеЛок = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибкеЛок);
		
		Метрика_ДобавитьОшибку(ДействиеМетрики, ПодробноеПредставлениеОшибки);
		
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ДвоичныеДанныеФайлаОбновления) Тогда
		
		ОписаниеОповещения = Неопределено;
		
		Платформа = Модуль_Платформа();
		Платформа.ПоказатьПредупреждениеЛок(
			ОписаниеОповещения,
			"При получении файла обновления произошла ошибка.
			|Попробуйте сохранить файл снова. При повторении ошибки обратитесь в техническую подержку."
		);
		
		Возврат;
		
	КонецЕсли;
	
	ДвоичныеДанныеФайлаОбновления.Записать(ВыбранныеФайлы[0]);
	
	СохранитьКонфигурациюВФайлОкончание();
	
КонецПроцедуры

&НаКлиенте
Функция ФайлПодсистемыХраненияДанных()
	
	ПутьФайлаСистемыХранения = ПолучитьИмяВременногоФайла("cf");
	// BSLLS:UsingSynchronousCalls-off
	КопироватьФайл(
		АдресаИнтернетРесурсов.ПодсистемаХраненияДиадок,
		ПутьФайлаСистемыХранения
	);
	// BSLLS:UsingSynchronousCalls-on
	
	Результат = Новый ДвоичныеДанные(ПутьФайлаСистемыХранения);
	
	// BSLLS:UsingSynchronousCalls-off
	УдалитьФайлы(ПутьФайлаСистемыХранения);
	// BSLLS:UsingSynchronousCalls-on
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СохранитьКонфигурациюВФайлОкончание()
	
	ОписаниеОповещения = ОсновнаяФорма().НовыйОписаниеОповещения("ОбработчикЗакрытияФормы", ЭтаФорма);
	ОсновнаяФорма().ПоказатьПредупреждениеПереопределенная(ОписаниеОповещения,
	"ВНИМАНИЕ! 
	|При обновлении конфигурации в окне ""Сравнение, объединение"" НЕ ЗАБУДЬТЕ снять флажок с раздела ""Свойства""!
	|Запустите модуль после обновления конфигурации базы из файла.");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытияФормы(Параметры) Экспорт
	
	Закрыть();
	
КонецПроцедуры

//} ИНТЕРФЕЙСНЫЕ ОБРАБОТЧИКИ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Модуль_ЯдроНаКлиенте().Метрика_ДобавитьПоведение_ДействиеСФормой(Метрика_НазваниеФормы(), Метрика_НазваниеКатегории());
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеФормы()
	
	Возврат "Настройка хранения данных";
	
КонецФункции

&НаКлиенте
Функция Метрика_НазваниеКатегории()
	
	Возврат "Система хранения";
	
КонецФункции

&НаКлиенте
Процедура Метрика_ДобавитьОшибку(ДействиеМетрики, ТекстОшибки)
	
	КатегорияМетрики = Метрика_НазваниеКатегории();
	
	Ядро = Модуль_ЯдроНаКлиенте();
	Ядро.Метрика_ДобавитьОшибку_СУчетомЗаполненияКонтекста(
		КатегорияМетрики,
		ДействиеМетрики,
		ТекстОшибки
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаИнструкцииНажатие(Элемент)
	
	Платформа = Модуль_Платформа();
	Платформа.ОповеститьИлиПерейтиПоСсылке(АдресаИнтернетРесурсов.Инструкция_УстановкаПодсистемыДД);
	
КонецПроцедуры

