
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// +++ КонтурЛогистика_НастройкиКонвертацииСправочников
	
	КонтурЛогистика_КонвертацияСервер.НастройкиКонвертацииСправочников_ПриСозданииНаСервере(
		ЭтаФорма, "КонтурЛогистика_Договоры", ЭтаФорма, Элементы.Код);
		
	// --- КонтурЛогистика_НастройкиКонвертацииСправочников
	
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры	

// +++ КонтурЛогистика_НастройкиКонвертацииСправочников

&НаКлиенте
Процедура СоздатьНастройкуКонвертации(Элемент) Экспорт
	
	КонтурЛогистика_КонвертацияКлиент.СоздатьНастройкуКонвертации(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкеКонвертацииСправочника(Элемент) Экспорт 
	
	КонтурЛогистика_КонвертацияКлиент.ПерейтиКНастройкеКонвертацииСправочника(ЭтаФорма);	
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
  КонтурЛогистика_КонвертацияКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДокументаПриИзменении(Элемент)
	ПроверитьСформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокументаПриИзменении(Элемент)
	ПроверитьСформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСформироватьНаименование()

	Если Не ЗначениеЗаполнено(СокрЛП(Объект.Наименование)) 
		И ЗначениеЗаполнено(СокрЛП(Объект.НомерДокумента))
		И ЗначениеЗаполнено(Объект.ДатаДокумента) Тогда 
		
		Объект.Наименование = Объект.НомерДокумента + " от " + Формат(Объект.ДатаДокумента,"ДФ=dd.MM.yyyy")
		
	КонецЕсли;
	

КонецПроцедуры

// --- КонтурЛогистика_НастройкиКонвертацииСправочников

&НаКлиенте
Процедура СвязанныеОбъектыПослеУдаления(Элемент)
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("КонтурЛогистика_ПерепроверитьДокумент");
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлементУчетнойСистемы(Команда)
	
	Если ЭтаФорма.СписокНастроекКонвертации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ВыборЭлементаУчетнойСистемыДляЗаполнения(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения");
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ВыбратьЭлементУчетнойСистемыЗавершение(ВыбранноеЗначение, ДополнительныеПараметры);
	
	УправлениеВидимостьюЭлементовФормыПослеКонвертации();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюЭлементовФормыПослеКонвертации() Экспорт
	
	УправлениеВидимостьюЭлементовФормыСервер();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюЭлементовФормыСервер()
	
	КонтурЛогистика_КонвертацияСервер.УправлениеВидимостьюЭлементовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектОткрытие(Элемент, СтандартнаяОбработка)
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьСвязанныйОбъект(ЭтаФорма, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПоказатьСписокТиповДляСвязанногоОбъекта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработкаВыбораСвязанногоОбъекта(ЭтаФорма, ВыбранноеЗначение);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед добавлением необходимо сохранить");
		Возврат;
	КонецЕсли;
			
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаВыбора";
	НаправлениеКонвертации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НаправлениеКонвертации.Входящее");
	ИмяТипаСправочника = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоСсылкеНаДокумент(Объект.Ссылка);
	
	ЗначениеОтбора = Новый Структура("НаправлениеКонвертации, ТипСправочникаЛогистика", НаправлениеКонвертации, ИмяТипаСправочника); 
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыФормы, ЭтаФорма, ЭтаФорма,
		"СоздатьНаОснованииНачалоВыбораЗавершение", Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры
	
&НаКлиенте
Процедура СоздатьНаОснованииНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Сообщить("Не выбрана настройка конвертации справочника");
		Возврат;
	КонецЕсли;
	
	НастройкаКонвертацииСправочника = Результат;
	КонтурЛогистика_КонвертацияКлиент.КонвертироватьОбъектСправочникаЛогистикиВОбъектУС(ЭтаФорма, НастройкаКонвертацииСправочника);
	
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
	
КонецПроцедуры
