#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	ИспользоватьИнтеграциюДО2 = Настройки.ИспользоватьИнтеграциюДО2;
	ИспользоватьИнтеграциюДО3 = Настройки.ИспользоватьИнтеграциюДО3;
	
	ИспользоватьПроцессыИЗадачи1СДокументооборота = Ложь;
	Если ИспользоватьИнтеграциюДО2 Тогда
		ИмяФО = "ИспользоватьПроцессыИЗадачи1СДокументооборота";
		ИспользоватьПроцессыИЗадачи1СДокументооборота = ПолучитьФункциональнуюОпцию(ИмяФО);
	КонецЕсли;
	
	ДоступенЗахватИРедактирование =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ДоступенФункционалВерсииСервиса("1.4.9.1");
	Элементы.ОткрытьДляРедактирования.Видимость = ДоступенЗахватИРедактирование;
	Элементы.ПанельОткрытьДляРедактирования.Видимость = ДоступенЗахватИРедактирование;
	Элементы.ЗакончитьРедактирование.Видимость = ДоступенЗахватИРедактирование;
	Элементы.ПанельЗакончитьРедактирование.Видимость = ДоступенЗахватИРедактирование;
	Элементы.ПанельСохранитьИзменения.Видимость = ДоступенЗахватИРедактирование;
	Элементы.ПанельОтменитьРедактирование.Видимость = ДоступенЗахватИРедактирование;
	Элементы.ПанельОткрытьКаталогФайла.Видимость = ДоступенЗахватИРедактирование;
	
	Элементы.ПредставлениеРедактирует.Видимость = ДоступенЗахватИРедактирование;
	Элементы.ДекорацияРедактируется.Видимость = Не ДоступенЗахватИРедактирование;
	
	ID = Параметры.ID;
	ОригиналID = Параметры.ОригиналID; // Заполнен если создается новый файл, копированием существующего файла.
	ШаблонID = Параметры.ШаблонID; // Заполнен если новый файл создается из шаблона.
	
	Если Не Параметры.Свойство("РазрешеноРедактирование", РазрешеноРедактирование) Тогда
		РазрешеноРедактирование = Истина;
	КонецЕсли;
	
	ПолучитьОписаниеФайлаИЗаполнитьФорму(Параметры);
	
	НастройкиДокументооборота = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьНастройки();
	ЗаголовокСообщенияВОбластиПредпросмотра = НастройкиДокументооборота.ЗаголовокСообщенияВОбластиПредпросмотра;
	НастройкиДокументооборотаИспользоватьЭП = НастройкиДокументооборота.ИспользоватьЭлектронныеЦифровыеПодписи;
	ИспользоватьЭП =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьЭлектронныеЦифровыеПодписи();
	СписокРасширенийСканКопийОригиналов = НастройкиДокументооборота.СписокРасширенийСканКопийОригиналов;
	ПоказыватьPDFСредствами1С = НастройкиДокументооборота.ПоказыватьPDFСредствами1С;
	Если ПоказыватьPDFСредствами1С Тогда
		МодульИнтеграцияС1СДокументооборот3 = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборот3");
		МодульИнтеграцияС1СДокументооборот3.ВывестиPDFДокументНаФорму(ЭтотОбъект, "СтраницаГруппаPDF");
	КонецЕсли;
	
	Если НастройкиДокументооборотаИспользоватьЭП = Ложь Тогда
		Элементы.КартинкаЭП.Видимость = Ложь;
		Элементы.ГруппаЭП.Видимость = Ложь;
		Элементы.ФормаСохранитьВместеСЭП.Видимость = Ложь;
	КонецЕсли;
	
	Если НастройкиДокументооборотаИспользоватьЭП = Ложь Или ИспользоватьЭП = Ложь Тогда
		Элементы.ФормаПодписать.Видимость = Ложь;
		Элементы.ФормаДобавитьЭПИзФайла.Видимость = Ложь;
		Элементы.ТаблицаПодписейПроверить.Видимость = Ложь;
		Элементы.ТаблицаПодписейПроверитьВсе.Видимость = Ложь;
	КонецЕсли;
	
	КолонкиМассив = Новый Массив;
	Для Каждого ОписаниеКолонки Из РеквизитФормыВЗначение("ТаблицаПодписей").Колонки Цикл
		КолонкиМассив.Добавить(ОписаниеКолонки.Имя);
	КонецЦикла;
	ОписаниеКолонокТаблицыПодписей = Новый ФиксированныйМассив(КолонкиМассив);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьКомандСпискаЭП();
	
	ДвоичныеДанные = ДвоичныеДанныеИзВременногоХранилищаФайла();
	Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Или ЗначениеЗаполнено(ПредставлениеHTML) Тогда
		HTMLПредпросмотрОбъекта =
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ПараметрыОповещенияПолученHTMLПредпросмотрОбъекта();
		HTMLПредпросмотрОбъекта.ID = ID;
		HTMLПредпросмотрОбъекта.Тип = Тип;
		HTMLПредпросмотрОбъекта.Расширение = Расширение;
		Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
			HTMLПредпросмотрОбъекта.ДвоичныеДанные = ДвоичныеДанные;
		Иначе
			HTMLПредпросмотрОбъекта.ПредставлениеHTML = ПредставлениеHTML;
			HTMLПредпросмотрОбъекта.ПредпросмотрУрезан = ПредпросмотрУрезан;
		КонецЕсли;
		Оповестить("ПолученHTMLПредпросмотрОбъекта", HTMLПредпросмотрОбъекта, ЭтотОбъект);
	Иначе
		Элементы.СтраницыПросмотра.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПоказыватьPDFСредствами1С Тогда
		ЭтотОбъект["ДокументPDFРеквизит"] = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗакрытиеСПараметром Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ТекстПредупреждения = "";
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы,,ТекстПредупреждения);
		
	Иначе
		
		Отказ = Истина;
		ПодключитьОбработчикОжидания("ЗакрытьСПараметром", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Не Открыта() Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПолученHTMLПредпросмотрОбъекта" Тогда
		Если Не ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ЭтоПараметрыОповещенияПолученHTMLПредпросмотрОбъекта(
				Параметр) Тогда
			Возврат;
		КонецЕсли;
		ОбработатьСобытиеПолученияHTMLПредпросмотра(Параметр, Источник);
		
	ИначеЕсли ИмяСобытия = "Запись_ДокументооборотФайл" Тогда
		Если ТипЗнч(Параметр) <> Тип("Структура")
				Или Не Параметр.Свойство("ДействиеНадФайлом")
				Или Не Параметр.Свойство("ИдентификаторФайла")
				Или Не Параметр.ДействиеНадФайлом.ИнформироватьФормуФайла
				Или Параметр.ИдентификаторФайла <> ID
				Или Параметр.ДействиеНадФайлом.УдалениеФайла Тогда
			Возврат;
		КонецЕсли;
		НужноОбновление = Истина;
		Если Параметр.ДействиеНадФайлом.РедактированиеФайла Тогда
			НужноОбновление = Не Редактируется;
		КонецЕсли;
		Если НужноОбновление Тогда
			ПолучитьОписаниеФайлаИЗаполнитьФорму();
			УстановитьДоступностьКомандСпискаЭП();
			Если Элементы.ГруппаДополнительныеДанныеСтраницы.ТекущаяСтраница = Элементы.ГруппаЭП
					И ТаблицаПодписей.Количество() > 0 Тогда
				ПроверитьВсеПодписи(Неопределено);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаДополнительныеДанныеСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаЭП И ТаблицаПодписей.Количество() > 0 Тогда
		ПроверитьВсеПодписи(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаБольшаяНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(ID) Тогда
		ЗаписатьВыполнитьКлиент(Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФайл(
			ID,
			Наименование,
			Расширение,
			УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаВзаимодействиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ИспользоватьПроцессыИЗадачи1СДокументооборота Тогда
		
		ВнешнийОбъект = Новый Структура;
		ВнешнийОбъект.Вставить("ID", ID);
		ВнешнийОбъект.Вставить("type", Тип);
		ВнешнийОбъект.Вставить("presentation", "");
		
		ПараметрыФормы = Новый Структура("ВнешнийОбъект", ВнешнийОбъект);
		ИмяФормыВсеЗадачи = "Обработка.ИнтеграцияС1СДокументооборот.Форма.ВсеЗадачи";
		
		ОткрытьФорму(
			ИмяФормыВсеЗадачи,
			ПараметрыФормы,
			ЭтотОбъект,
			КлючУникальности,
			Окно);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаЭПНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Зашифрован Или Не Существует Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаДополнительныеДанныеСтраницы.ТекущаяСтраница = Элементы.ГруппаЭП;
	ПроверитьВсеПодписи(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ДанныеСобытия.Href, "OpenForEdit") Тогда
		
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФайл(
			ID,
			Наименование,
			Расширение,
			УникальныйИдентификатор,
			Ложь,,
			ВладелецID);
		
	ИначеЕсли СтрНайти(ДанныеСобытия.Href, "OpenForView") Тогда
		
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФайл(
			ID,
			Наименование,
			Расширение,
			УникальныйИдентификатор);
		
	ИначеЕсли СтрНайти(ДанныеСобытия.Href, "CreatePreview") Тогда
		
		ОбновитьПредпросмотр(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЯвляетсяОригиналомПриИзменении(Знач Элемент)
	
	Если ЯвляетсяОригиналом Тогда
		УстановкаПризнакаЯвляетсяОригиналомВозможна =
			Ждать ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.УстановкаПризнакаЯвляетсяОригиналомВозможна(
				ШаблонID,
				Расширение,
				СписокРасширенийСканКопийОригиналов);
		Если Не УстановкаПризнакаЯвляетсяОригиналомВозможна Тогда
			ЯвляетсяОригиналом = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвойства

&НаКлиенте
Процедура СвойстваЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыбратьЗначениеДополнительногоРеквизита(
		ЭтотОбъект,
		Элемент,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Свойства.ТекущиеДанные;
	Если ТекущиеДанные.СписокДоступныхТипов.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
		
	Если ТипЗнч(ТекущиеДанные.Значение) = Тип("Строка") Тогда
		ТипXDTO =ТекущиеДанные.СписокДоступныхТипов[0].Значение.xdtoClassName;
		Если ТипXDTO = "integer" Тогда
			ТекущиеДанные.Значение = 0;
		ИначеЕсли ТипXDTO = "boolean" Тогда
			ТекущиеДанные.Значение = Ложь;
		ИначеЕсли ТипXDTO = "date" Тогда
			ТекущиеДанные.Значение = Дата(1, 1, 1);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СвойстваЗначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Свойства.ТекущиеДанные;
	Если ТекущиеДанные.СписокДоступныхТипов.Количество() <> 1 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
		
	ТипXDTO = ТекущиеДанные.СписокДоступныхТипов[0].Значение.xdtoClassName;
	
	Если ТипXDTO = "integer"
			Или ТипXDTO = "boolean"
			Или ТипXDTO = "date"
			Или ТипXDTO = "string" Тогда
		Возврат;
	КонецЕсли;
		
	Если ТипXDTO = "DMObjectPropertyValue" Тогда
		ДополнительноеСвойство = Новый Структура;
		ДополнительноеСвойство.Вставить("ID", ТекущиеДанные.СвойствоID);
		ДополнительноеСвойство.Вставить("type", ТекущиеДанные.СвойствоТип);
		Отбор = Новый Структура("additionalProperty", ДополнительноеСвойство);
	Иначе
		Отбор = Неопределено;
	КонецЕсли;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ДанныеДляАвтоПодбора(
		ТипXDTO,
		ДанныеВыбора,
		Текст,
		СтандартнаяОбработка,
		Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Свойства.ТекущиеДанные;
	Если ТекущиеДанные.СписокДоступныхТипов.Количество() <> 1 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
		
	ТипXDTO = ТекущиеДанные.СписокДоступныхТипов[0].Значение.xdtoClassName;
	
	Если ТипXDTO = "integer"
		Или ТипXDTO = "boolean"
		Или ТипXDTO = "string"
		Или ТипXDTO = "date" Тогда
		Возврат;
	КонецЕсли;
		
	Если ТипXDTO = "DMObjectPropertyValue" Тогда
		ДополнительноеСвойство = Новый Структура;
		ДополнительноеСвойство.Вставить("ID", ТекущиеДанные.СвойствоID);
		ДополнительноеСвойство.Вставить("type", ТекущиеДанные.СвойствоТип);
		Отбор = Новый Структура("additionalProperty", ДополнительноеСвойство);
	Иначе
		Отбор = Неопределено;
	КонецЕсли;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ДанныеДляАвтоПодбора(
		ТипXDTO, ДанныеВыбора, Текст, СтандартнаяОбработка, Отбор);
	
	Если ДанныеВыбора.Количество() = 1 Тогда
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОбработкаВыбораДанныхДляАвтоПодбора(
			"Значение", ДанныеВыбора[0].Значение, СтандартнаяОбработка, ЭтотОбъект, Истина, Элемент);
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОбработкаВыбораДанныхДляАвтоПодбора(
		"Значение", ВыбранноеЗначение, СтандартнаяОбработка, ЭтотОбъект, Истина, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.Свойства.ТекущиеДанные.Значение = "";
	Элементы.Свойства.ТекущиеДанные.ЗначениеID = "";
	Элементы.Свойства.ТекущиеДанные.ЗначениеТип = "";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭП

&НаКлиенте
Процедура ТаблицаПодписейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьПодпись(Элементы.ТаблицаПодписей.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДокументPDFУвеличить(Команда)
	
	Элементы["ДокументPDFПоле"].Масштаб = Элементы["ДокументPDFПоле"].Масштаб + 10;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументPDFУменьшить(Команда)
	
	Если Элементы["ДокументPDFПоле"].Масштаб <= 10 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы["ДокументPDFПоле"].Масштаб = Элементы["ДокументPDFПоле"].Масштаб - 10;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументPDFПоворотЛево(Команда)
	
	Элементы["ДокументPDFПоле"].Ориентация = Элементы["ДокументPDFПоле"].Ориентация - 90;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументPDFПоворотПраво(Команда)
	
	Элементы["ДокументPDFПоле"].Ориентация = Элементы["ДокументPDFПоле"].Ориентация + 90;
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	
	ПолучитьОписаниеФайлаИЗаполнитьФорму();
	Если Элементы.ГруппаДополнительныеДанныеСтраницы.ТекущаяСтраница = Элементы.ГруппаЭП
			И ТаблицаПодписей.Количество() > 0 Тогда
		ПроверитьВсеПодписи(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредпросмотрКоманда(Команда)
	
	ОбновитьПредпросмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Отказ = Ложь;
	ЗаписатьВыполнитьКлиент(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВСписке(Команда)
	
	ПараметрыОткрытия = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПараметрыОткрытияСпискаФайлов();
	ПараметрыОткрытия.ТекущийФайл = ID;
	ПараметрыОткрытия.ВладелецФайлаID = ВладелецID;
	ПараметрыОткрытия.ВладелецФайлаТип = ВладелецТип;
	ПараметрыОткрытия.ПредставлениеВладельца = ПредставлениеВладельца;
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФормуПрисоединенныеФайлы(
		ВладелецФайла,
		ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНаЧтение(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФайл(
		ID,
		Наименование,
		Расширение,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДляРедактирования(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФайл(
		ID,
		Наименование,
		Расширение,
		УникальныйИдентификатор,
		Ложь,,
		ВладелецID);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьРедактирование(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ЗакончитьРедактированиеФайла(
		ID,
		Наименование,
		Расширение,
		УникальныйИдентификатор,,
		ВладелецID);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаДиск(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.СохранитьФайлКак(
		ID,
		Наименование,
		Расширение,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайловыеОперацииЕще(Команда)
	
	Подменю = Новый СписокЗначений;
	Если ДоступенЗахватИРедактирование Тогда
		Подменю.Добавить("ОткрытьКаталогФайла", НСтр("ru = 'Открыть каталог файла'"),,
			БиблиотекаКартинок.Папка);
	КонецЕсли;
	Если (Не Редактируется Или РедактируетсяТекущимПользователем) И РазрешеноРедактирование И Не ЕстьПодписи Тогда
		Подменю.Добавить("ОбновитьИзФайлаНаДиске", НСтр("ru = 'Обновить из файла на диске'"),,
			БиблиотекаКартинок.ОбновитьФайлИзФайлаНаДиске);
	КонецЕсли;
	Если ДоступенЗахватИРедактирование И РедактируетсяТекущимПользователем И Не ЕстьПодписи Тогда
		Подменю.Добавить("ОтменитьРедактирование", НСтр("ru = 'Отменить редактирование'"),,
			БиблиотекаКартинок.ОсвободитьФайл);
		Если РазрешеноРедактирование Тогда
			Подменю.Добавить("СохранитьИзменения", НСтр("ru = 'Сохранить изменения'"),,
				БиблиотекаКартинок.ОпубликоватьФайл);
		КонецЕсли;
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ФайловыеОперацииЕщеПослеВыбора", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОписаниеОповещения, Подменю, Элементы.ФайловыеОперацииЕще);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайловыеОперацииЕщеПослеВыбора(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = "ОткрытьКаталогФайла" Тогда
		ОткрытьКаталогФайла();
	ИначеЕсли Результат.Значение = "ОбновитьИзФайлаНаДиске" Тогда
		ОбновитьИзФайлаНаДиске();
	ИначеЕсли Результат.Значение = "ОтменитьРедактирование" Тогда
		ОтменитьРедактирование();
	ИначеЕсли Результат.Значение = "СохранитьИзменения" Тогда
		СохранитьИзменения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подписать(Команда)
	
	СвойстваФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СвойстваФайла();
	СвойстваФайла.ИдентификаторФайла = ID;
	СвойстваФайла.ИмяФайла = Наименование;
	СвойстваФайла.ВладелецФайла = ВладелецID;
	СвойстваФайла.Редактируется = Редактируется;
	СвойстваФайла.Зашифрован = Зашифрован;
	СвойстваФайла.ОписаниеФайла = Описание;
	СвойстваФайла.УникальныйИдентификаторФормы = УникальныйИдентификатор;
	СвойстваФайла.ДанныеПодписейФайла =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ДанныеПодписей(ТаблицаПодписей);
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПодписатьФайл(СвойстваФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодпись(Команда)
	
	ВыделенныеПодписи = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыделенныеПодписи(
		Элементы.ТаблицаПодписей.ВыделенныеСтроки,
		ТаблицаПодписей);
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПроверитьПодписи(
		ТаблицаПодписей,
		Неопределено,
		Неопределено,
		ВыделенныеПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВсеПодписи(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПроверитьПодписи(ТаблицаПодписей);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПодпись(Команда)
	
	ВыделенныеПодписи = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыделенныеПодписи(
		Элементы.ТаблицаПодписей.ВыделенныеСтроки,
		ТаблицаПодписей);
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.УдалитьПодписи(
		ВыделенныеПодписи,
		ТаблицаПодписей,
		ВладелецID,,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	ПараметрыФормы = Новый Структура("ГлавнаяЗадача, Предмет", Новый Структура, Новый Структура);
	
	ПараметрыФормы.Предмет.Вставить("name", Наименование);
	ПараметрыФормы.Предмет.Вставить("ID", ID);
	ПараметрыФормы.Предмет.Вставить("type", Тип);
	ПараметрыФормы.Предмет.Вставить("ВнешнийОбъект", ВладелецФайла);
	
	ИмяФормыСозданиеБизнесПроцесса = "Обработка.ИнтеграцияС1СДокументооборот.Форма.СозданиеБизнесПроцесса";
	ОткрытьФорму(ИмяФормыСозданиеБизнесПроцесса, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭПИзФайла(Команда)
	
	ДанныеПодписейФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ДанныеПодписей(ТаблицаПодписей);
	
	СвойстваФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СвойстваФайла();
	СвойстваФайла.ИдентификаторФайла = ID;
	СвойстваФайла.ИмяФайла = Наименование;
	СвойстваФайла.ОписаниеФайла = Описание;
	СвойстваФайла.Редактируется = Редактируется;
	СвойстваФайла.Зашифрован = Зашифрован;
	СвойстваФайла.ДанныеПодписейФайла = ДанныеПодписейФайла;
	СвойстваФайла.УникальныйИдентификаторФормы = УникальныйИдентификатор;
	СвойстваФайла.ВладелецФайла = ВладелецID;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.НачатьДобавлениеЭПИзФайла(СвойстваФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВместеСЭП(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.НачатьСохранениеВместеСЭП(
		ID,
		Расширение,
		Наименование,
		Размер,
		ДатаМодификацииУниверсальная,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодпись(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьПодпись(Элементы.ТаблицаПодписей.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбъект(Команда)
	
	Отказ = Ложь;
	ЗаписатьВыполнитьКлиент(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.СохранитьПодпись(Элементы.ТаблицаПодписей.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Клиент

// Закрывает форму без вопросов и проверки модифицированности.
//
&НаКлиенте
Процедура ЗакрытьСПараметром()
	
	ЗакрытиеСПараметром = Истина;
	Закрыть(КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

// Записывает файл и его подписи.
//
&НаКлиенте
Процедура ЗаписатьВыполнитьКлиент(Отказ)
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Наименование'")),,
			"Наименование");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ID) Тогда
		ДанныеПодписейФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ДанныеПодписей(ТаблицаПодписей);
		ЗаписатьВыполнить(ДанныеПодписейФайла);
	ИначеЕсли ЗначениеЗаполнено(ОригиналID) Тогда
		СоздатьИзОригинала();
	ИначеЕсли ЗначениеЗаполнено(ШаблонID) Тогда
		СоздатьИзШаблона();
	КонецЕсли;
	
	ДействиеНадФайлом = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДействиеНадФайлом();
	ДействиеНадФайлом.ЗаписьФайла = Истина;
	ДействиеНадФайлом.ИнформироватьФормуФайла = Истина;
	ДействиеНадФайлом.ИнформироватьФормуСпискаФайлов = Истина;
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ИнформироватьОбИзмененииФайла(
		ДействиеНадФайлом,
		Наименование,
		ID,
		ВладелецID,,,
		УникальныйИдентификатор);
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзФайлаНаДиске()
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОбновитьИзФайлаНаДиске(
		ID,
		Наименование,
		Расширение,
		МестноеВремя(ДатаМодификацииУниверсальная),
		УникальныйИдентификатор,,
		ВладелецID);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредпросмотр(ИгнорироватьМаксРазмер = Ложь)
	
	Если ИспользоватьИнтеграциюДО3 Тогда
		ПредставлениеHTML = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СообщениеОЗагрузке();
		Элементы.СтраницыПросмотра.ТекущаяСтраница = Элементы.СтраницаГруппаHTML;
		Элементы.ГруппаПредпросмотрУрезан.Видимость = Ложь;
		
		МодульИнтеграцияС1СДокументооборот3ВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборот3ВызовСервера");
		ВернутьДвоичныеДанные = ПоказыватьPDFСредствами1С И НРег(Расширение) = "pdf" И Не Зашифрован;
		ДлительнаяОперация = МодульИнтеграцияС1СДокументооборот3ВызовСервера.ПолучитьHTMLПредпросмотрОбъектаАсинхронно(
			УникальныйИдентификатор,
			ID,
			Тип,
			ИгнорироватьМаксРазмер,
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеСсылочногоОбъектаДО(
				ВладелецID,
				ВладелецТип),
			ВернутьДвоичныеДанные);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения(
			"ОбновитьПредпросмотрЗавершение",
			ЭтотОбъект);
		
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьЗапросАсинхронно(
			ЭтотОбъект,
			ДлительнаяОперация,
			ОповещениеОЗавершении,
			Ложь,,
			Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после получения предпросмотра объекта ДО.
//
// Параметры:
//   Результат - см. ДлительныеОперации.ОперацияВыполнена
//   ПараметрыОповещения - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла
//
&НаКлиенте
Процедура ОбновитьПредпросмотрЗавершение(Результат, ПараметрыОповещения) Экспорт
	
	HTMLПредпросмотрОбъекта =
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ПараметрыОповещенияПолученHTMLПредпросмотрОбъекта();
	
	Если Результат <> Неопределено И Результат.Статус = "Ошибка" Тогда
		СообщениеHTML =
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СообщениеВПредпросмотр(
				Результат.КраткоеПредставлениеОшибки,
				ЗаголовокСообщенияВОбластиПредпросмотра);
		HTMLПредпросмотрОбъекта.ID = ID;
		HTMLПредпросмотрОбъекта.Тип = Тип;
		HTMLПредпросмотрОбъекта.Расширение = Расширение;
		HTMLПредпросмотрОбъекта.ПредставлениеHTML = СообщениеHTML;
		Оповестить("ПолученHTMLПредпросмотрОбъекта", HTMLПредпросмотрОбъекта, ЭтотОбъект);
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	ИначеЕсли ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОперацияВыполнена(Результат) Тогда
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДополнитьНДПС(HTMLПредпросмотрОбъекта);
		ЗаполнитьЗначенияСвойств(HTMLПредпросмотрОбъекта, Результат.РезультатДлительнойОперации);
		HTMLПредпросмотрОбъекта.ID = ID;
		HTMLПредпросмотрОбъекта.Тип = Тип;
		HTMLПредпросмотрОбъекта.Расширение = Расширение;
		Если ПустаяСтрока(HTMLПредпросмотрОбъекта.ПредставлениеHTML) Тогда
			HTMLПредпросмотрОбъекта.ПредставлениеHTML =
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СообщениеОбОтсутствииПредпросмотра(
					ЗаголовокСообщенияВОбластиПредпросмотра);
		КонецЕсли;
		Оповестить("ПолученHTMLПредпросмотрОбъекта", HTMLПредпросмотрОбъекта, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ПолученHTMLПредпросмотрОбъекта".
//
// Параметры:
//   Параметр - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ПараметрыОповещенияПолученHTMLПредпросмотрОбъекта
//   Источник - Произвольный - источник события.
//
&НаКлиенте
Процедура ОбработатьСобытиеПолученияHTMLПредпросмотра(Параметр, Источник)
	
	Если Параметр.ID = ID И Параметр.Тип = Тип Тогда
		Если ТипЗнч(Параметр.ДвоичныеДанные) = Тип("ДвоичныеДанные") И НРег(Параметр.Расширение) = "pdf" Тогда
			ПредставлениеHTML = "";
			ПредпросмотрУрезан = Ложь;
			АдресВХранилищеФайлаПредпросмотра = ПоместитьВоВременноеХранилище(
				Параметр.ДвоичныеДанные,
				УникальныйИдентификатор);
		Иначе
			ПредставлениеHTML = Параметр.ПредставлениеHTML;
			ПредпросмотрУрезан = Параметр.ПредпросмотрУрезан;
		КонецЕсли;
		ОбновитьЭлементыПредпросмотра();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКаталогФайла()
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьКаталогФайла(ID);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРедактирование()
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОтменитьРедактированиеФайла(
		ID,,
		ВладелецID,
		УникальныйИдентификатор);
	
КонецПроцедуры

// Вызывается после запроса "Сохранить изменения" и завершает закрытие.
//
&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ПараметрыОповещения) Экспорт
	
	Отказ = Ложь;
	
	ЗаписатьВыполнитьКлиент(Отказ);
	ПараметрыОповещения = Новый Структура;
	Оповестить("Запись_ДокументооборотДокумент", ПараметрыОповещения, ВладелецФормы);
	
	Если Не Отказ Тогда
		ЗакрытьСПараметром();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения()
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.СохранитьИзмененияРедактируемогоФайла(
		ID,
		Наименование,
		Расширение,
		УникальныйИдентификатор,,
		ВладелецID);
	
КонецПроцедуры

// В зависимости от наличия подписей устанавливает доступность команд ЭП.
//
&НаКлиенте
Процедура УстановитьДоступностьКомандСпискаЭП()
	
	Элементы.ТаблицаПодписейПроверить.Доступность = ЕстьПодписи И Не Зашифрован;
	Элементы.ТаблицаПодписейПроверитьВсе.Доступность = ЕстьПодписи И Не Зашифрован;
	Элементы.ТаблицаПодписейОткрытьПодпись.Доступность = ЕстьПодписи И Не Зашифрован;
	Элементы.ТаблицаПодписейСохранить.Доступность = ЕстьПодписи И Не Зашифрован;
	Элементы.ТаблицаПодписейУдалить.Доступность = ЕстьПодписи И Не Зашифрован;
	
	Элементы.ФормаСохранитьВместеСЭП.Доступность = ЕстьПодписи И Не Зашифрован;
	
КонецПроцедуры

#КонецОбласти

#Область Сервер

&НаСервере
Функция ДвоичныеДанныеИзВременногоХранилищаФайла()
	
	ДвоичныеДанные = Неопределено;
	Если ПоказыватьPDFСредствами1С
			И НРег(Расширение) = "pdf"
			И Не РедактируетсяТекущимПользователем
			И ЭтоАдресВременногоХранилища(АдресВременногоХранилищаФайла) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаФайла);
	КонецЕсли;
	
	Возврат ДвоичныеДанные;
	
КонецФункции

// Записывает файл и указанные подписи.
//
&НаСервере
Процедура ЗаписатьВыполнить(МассивСуществующихПодписейФайла)
	
	Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
	
	ФайлXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(Прокси, Тип);
	
	ФайлXDTO.objectID = ИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьObjectID(Прокси, ID, Тип);
	
	// При записи передаем Имя, Описание, признак Является оригиналом, Доп. свойства, а также подписи.
	ФайлXDTO.name = Наименование;
	ФайлXDTO.description = Описание;
	ФайлXDTO.scannedOriginal = ЯвляетсяОригиналом;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьПодписиОбъектаXDTO(
		Прокси,
		ФайлXDTO,
		МассивСуществующихПодписейФайла);
	
	Обработки.ИнтеграцияС1СДокументооборотБазоваяФункциональность.СформироватьДополнительныеСвойства(
		Прокси,
		ФайлXDTO,
		ЭтотОбъект);
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаписатьОбъект(Прокси, ФайлXDTO);
	
КонецПроцедуры

// Заполняет форму данными файла.
//
// Параметры:
//   ОписаниеФайла - см. ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОписаниеФайла
//
&НаСервере
Процедура ЗаполнитьФорму(ОписаниеФайла)
	
	Существует = ЗначениеЗаполнено(ID);
	
	Зашифрован = ОписаниеФайла.Зашифрован;
	ШаблонТекстСПояснением = "%1 (%2)";
	Размер = ОписаниеФайла.Размер;
	ПредставлениеРазмера = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.КраткоеПредставлениеРазмера(Размер);
	Наименование = ОписаниеФайла.Наименование;
	Описание = ОписаниеФайла.Описание;
	Расширение = ОписаниеФайла.Расширение;
	ПолноеИмяФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ИмяФайлаСРасширением(
		Наименование,
		Расширение);
	ДатаСоздания = ОписаниеФайла.ДатаСоздания;
	ДатаМодификацииУниверсальная = ОписаниеФайла.ДатаМодификацииУниверсальная;
	Автор = ОписаниеФайла.Автор;
	Тип = "DMFile";
	Редактируется = ОписаниеФайла.Редактируется;
	ШаблонID = ОписаниеФайла.ШаблонID;
	ЯвляетсяОригиналом = ОписаниеФайла.ЯвляетсяОригиналом;
	Элементы.ЯвляетсяОригиналом.Видимость = ОписаниеФайла.ЯвляетсяОригиналомВидимость;
	Элементы.ЯвляетсяОригиналом.ТолькоПросмотр = ОписаниеФайла.ЯвляетсяОригиналомТолькоПросмотр;
	
	ИндексКартинки = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ИндексПиктограммыФайла(Расширение);
	
	Если ОписаниеФайла.Свойство("Владелец") И ЗначениеЗаполнено(ОписаниеФайла.Владелец) Тогда
		ПредставлениеВладельца = ОписаниеФайла.Владелец;
		Элементы.ПредставлениеВладельца.Видимость = Истина;
		ОписаниеФайла.Свойство("Владелец", Владелец);
		ОписаниеФайла.Свойство("ВладелецID", ВладелецID);
		ОписаниеФайла.Свойство("ВладелецТип", ВладелецТип);
		ОписаниеФайла.Свойство("ВладелецФайла", ВладелецФайла);
		Элементы.ФормаПоказатьВСписке.Видимость = Истина;
		
		ПредставлениеТипаВладельца = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПредставлениеТипаОбъектаXDTO(
			ВладелецТип);
		Элементы.ПредставлениеВладельца.Заголовок = ПредставлениеТипаВладельца;
		Элементы.Владелец.Заголовок = ПредставлениеТипаВладельца;
	Иначе
		Элементы.ПредставлениеВладельца.Видимость = Ложь;
		Элементы.ФормаПоказатьВСписке.Видимость = Ложь;
	КонецЕсли;
	
	//@skip-check module-nstr-camelcase
	ФорматнаяСтрока = НСтр("ru = 'ДФ=""дд.ММ.гггг ЧЧ:мм""'");
	
	ПредставлениеСоздан = СтрШаблон(ШаблонТекстСПояснением,
		Формат(ОписаниеФайла.ДатаСоздания, ФорматнаяСтрока),
		ОписаниеФайла.Автор);
	
	Если ЗначениеЗаполнено(ОписаниеФайла.ТекущаяВерсияДатаСоздания) Тогда
		ПредставлениеИзменен = Формат(ОписаниеФайла.ТекущаяВерсияДатаСоздания, ФорматнаяСтрока);
		АвторМодификации = ОписаниеФайла.ТекущаяВерсияАвтор;
	Иначе
		ПредставлениеИзменен = Формат(ОписаниеФайла.ДатаМодификации, ФорматнаяСтрока);
		АвторМодификации = ОписаниеФайла.АвторМодификации;
	КонецЕсли;
	Если ЗначениеЗаполнено(АвторМодификации) Тогда
		ПредставлениеИзменен = СтрШаблон(ШаблонТекстСПояснением, ПредставлениеИзменен, АвторМодификации);
	КонецЕсли;
	
	Если ОписаниеФайла.Свойство("Редактирует") И ЗначениеЗаполнено(ОписаниеФайла.Редактирует) Тогда
		Редактирует = ОписаниеФайла.Редактирует;
		ДатаЗаема = ОписаниеФайла.ДатаЗаема;
		ПредставлениеРедактирует = СтрШаблон(ШаблонТекстСПояснением,
			Формат(ОписаниеФайла.ДатаЗаема, ФорматнаяСтрока),
			ОписаниеФайла.Редактирует);
		ТекущийПользовательИСотрудники =
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ТекущийПользовательДокументооборота();
		РедактируетсяТекущимПользователем =
			ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ФайлРедактируетсяТекущимПользователем(
				ОписаниеФайла.РедактируетID,
				ОписаниеФайла.РедактируетТип,
				ТекущийПользовательИСотрудники);
	Иначе
		Редактирует = "";
		ДатаЗаема = Неопределено;
		ПредставлениеРедактирует = "";
		РедактируетсяТекущимПользователем = Ложь;
		Элементы.ДекорацияРедактируется.Заголовок = ?(Редактируется, НСтр("ru = 'Редактируется'"), "");
	КонецЕсли;
	
	Если ТипЗнч(ДвоичныеДанныеИзВременногоХранилищаФайла()) = Тип("ДвоичныеДанные") Тогда
		ПредставлениеHTML = "";
		ПредпросмотрУрезан = Ложь;
	Иначе
		ПредставлениеHTML = ОписаниеФайла.ПредставлениеHTML;
		ПредпросмотрУрезан = ОписаниеФайла.ПредпросмотрУрезан;
	КонецЕсли;
	ОбновитьЭлементыПредпросмотра();
	
	Элементы.ЗадачиПоПриложению.Заголовок = ОписаниеФайла.ЗадачиПоПриложению;
	Элементы.ЗадачиПоПриложению.Видимость = ЗначениеЗаполнено(Элементы.ЗадачиПоПриложению.Заголовок);
	
	ТекущаяВерсияID = ОписаниеФайла.ТекущаяВерсияID;
	ТекущаяВерсияНомер = ОписаниеФайла.ТекущаяВерсияНомер;
	Элементы.ТекущаяВерсияНомер.Видимость = (ОписаниеФайла.ТекущаяВерсияНомер <> Неопределено);
	ТекущаяВерсияАвтор = ОписаниеФайла.ТекущаяВерсияАвтор;
	Элементы.ТекущаяВерсияАвтор.Видимость = (ОписаниеФайла.ТекущаяВерсияАвтор <> Неопределено);
	ТекущаяВерсияДатаСоздания = ОписаниеФайла.ТекущаяВерсияДатаСоздания;
	Элементы.ТекущаяВерсияДатаСоздания.Видимость = (ОписаниеФайла.ТекущаяВерсияДатаСоздания <> Неопределено);
	ТекущаяВерсияДатаИзменения = ОписаниеФайла.ТекущаяВерсияДатаИзменения;
	Элементы.ТекущаяВерсияДатаИзменения.Видимость = (ОписаниеФайла.ТекущаяВерсияДатаИзменения <> Неопределено);
	ТекущаяВерсияРазмер = ОписаниеФайла.ТекущаяВерсияРазмер;
	Элементы.ГруппаРазмер.Видимость = (ОписаниеФайла.ТекущаяВерсияРазмер <> Неопределено);
	ХранитьВерсии = ОписаниеФайла.ХранитьВерсии;
	Элементы.ХранитьВерсии.Видимость = (ОписаниеФайла.ХранитьВерсии <> Неопределено);
	
	РольФайлаID = ОписаниеФайла.РольФайлаID;
	ПредставлениеРольФайла = ОписаниеФайла.РольФайла;
	Элементы.ПредставлениеРольФайла.Видимость = (ПредставлениеРольФайла <> "");
	
	Код = ОписаниеФайла.Код;
	Элементы.Код.Видимость = (Код <> "");
	
	Проект = ОписаниеФайла.Проект;
	Элементы.Проект.Видимость = (Проект <> "");
	
	ТаблицаПодписей.Очистить();
	
	ДанныеВладельцаПодписи = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеВладельцаПодписи(
		Наименование,
		ID,
		Тип,
		Зашифрован);
	
	НомерСтроки = 0;
	Для Каждого Подпись Из ОписаниеФайла.Подписи Цикл
		ИнтеграцияС1СДокументооборотБазоваяФункциональность.ЗаполнитьСтрокуДереваПодписей(
			ТаблицаПодписей.Добавить(),
			НомерСтроки,
			Подпись,
			ДанныеВладельцаПодписи,
			УникальныйИдентификатор);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	КолВоПодписей = ТаблицаПодписей.Количество();
	ЕстьПодписи = (КолВоПодписей <> 0);
	
	ТекстЗаголовка = НСтр("ru = 'ЭП'");
	Если ЕстьПодписи Тогда
		ТекстЗаголовка = СтрШаблон(ШаблонТекстСПояснением,
			ТекстЗаголовка,
			Строка(КолВоПодписей));
	КонецЕсли;
	Элементы.ГруппаЭП.Заголовок = ТекстЗаголовка;
	
	Если ОписаниеФайла.СтатусЭП <> Неопределено Тогда
		
		СтатусЭП = ОписаниеФайла.СтатусЭП;
		Элементы.КартинкаЭП.Подсказка = ОписаниеФайла.СтатусЭППодсказка;
		
	Иначе
		
		Если Зашифрован Тогда
			Если КолВоПодписей = 0 Тогда
				СтатусЭП = 1;
				Элементы.КартинкаЭП.Подсказка = НСтр("ru = 'Зашифрован. Не подписан электронной подписью'");
			Иначе
				СтатусЭП = 3;
				Элементы.КартинкаЭП.Подсказка = НСтр("ru = 'Зашифрован. Подписан электронной подписью. Подпись не проверена.'");
			КонецЕсли;
		Иначе
			Если КолВоПодписей = 0 Тогда
				СтатусЭП = 0;
				Элементы.КартинкаЭП.Подсказка = НСтр("ru = 'Не подписан электронной подписью'");
			Иначе
				СтатусЭП = 2;
				Элементы.КартинкаЭП.Подсказка = НСтр("ru = 'Подписан электронной подписью. Подпись не проверена.'");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОписаниеФайла.СтатусВзаимодействия <> Неопределено Тогда
		
		СтатусВзаимодействия = ОписаниеФайла.СтатусВзаимодействия;
		Элементы.КартинкаВзаимодействие.Подсказка = ОписаниеФайла.СтатусВзаимодействияПодсказка;
		
	Иначе
		
		ЕстьЗадачи = Ложь;
		
		Если ИспользоватьИнтеграциюДО2 Тогда
			МодульИнтеграцияС1СДокументооборот = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборот");
			ЕстьЗадачи = МодульИнтеграцияС1СДокументооборот.ЕстьЗадачи(ID, Тип);
		КонецЕсли;
		
		Если ЕстьЗадачи Тогда
			СтатусВзаимодействия = 1;
			Элементы.КартинкаВзаимодействие.Подсказка = НСтр("ru = 'По файлу выполняются задачи'");
		Иначе
			СтатусВзаимодействия = 0;
			Элементы.КартинкаВзаимодействие.Подсказка = НСтр("ru = 'По файлу нет выполняющихся задач'");
		КонецЕсли;
		
	КонецЕсли;
	
	Обработки.ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПоместитьДополнительныеРеквизитыНаФорму(
		ЭтотОбъект,,
		ОписаниеФайла.ДопРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыПредпросмотра()
	
	Элементы.СтраницыПросмотра.ТекущаяСтраница = Элементы.СтраницаГруппаHTML;
	Элементы.ГруппаПредпросмотрУрезан.Видимость = (Не РедактируетсяТекущимПользователем И ПредпросмотрУрезан);
	
	ЕстьФайлПредпросмотра = ЭтоАдресВременногоХранилища(АдресВХранилищеФайлаПредпросмотра) И Не Зашифрован;
	
	Если ЕстьФайлПредпросмотра И Не ЗначениеЗаполнено(ПредставлениеHTML) Тогда
		Если РедактируетсяТекущимПользователем Тогда
			ПредставлениеHTML = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СообщениеОРедактировании(
				ЗаголовокСообщенияВОбластиПредпросмотра);
		Иначе
			ДокументPDF = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПолучитьДокументPDF(
				АдресВХранилищеФайлаПредпросмотра);
			Если ДокументPDF = Неопределено Тогда
				ПредставлениеHTML = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СообщениеОбОтсутствииПредпросмотра(
					ЗаголовокСообщенияВОбластиПредпросмотра);
			Иначе
				ЭтотОбъект["ДокументPDFРеквизит"] = ДокументPDF;
				Элементы.СтраницыПросмотра.ТекущаяСтраница = Элементы.СтраницаГруппаPDF;
				Элементы["ДокументPDFПоле"].НомерТекущейСтраницы = 1;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(ПредставлениеHTML) Тогда
		ПредставлениеHTML = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.СообщениеОбОтсутствииПредпросмотра(
			ЗаголовокСообщенияВОбластиПредпросмотра);
	КонецЕсли;
	
КонецПроцедуры

// Получает описание файла по идентификатору и заполняет поля формы.
//
// Параметры:
//   ПараметрыФормы - Структура - параметры формы
//     Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.Файл.
//
&НаСервере
Процедура ПолучитьОписаниеФайлаИЗаполнитьФорму(ПараметрыФормы = Неопределено)
	
	АдресВременногоХранилищаФайла = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	Если ЗначениеЗаполнено(ID) Тогда
		ОписаниеФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОписаниеФайла(
			ID,
			ЭтотОбъект,
			АдресВременногоХранилищаФайла);
	ИначеЕсли ЗначениеЗаполнено(ОригиналID) Тогда
		ОписаниеФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОписаниеФайла(
			ОригиналID,
			ЭтотОбъект,
			АдресВременногоХранилищаФайла);
	ИначеЕсли ЗначениеЗаполнено(ШаблонID) И ПараметрыФормы <> Неопределено Тогда
		ОписаниеФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОписаниеФайла(
			ШаблонID,
			ЭтотОбъект);
		ОписаниеФайла.Владелец = ПараметрыФормы.Владелец;
		ОписаниеФайла.ВладелецID = ПараметрыФормы.ВладелецID;
		ОписаниеФайла.ВладелецТип = ПараметрыФормы.ВладелецТип;
		ОписаниеФайла.ВладелецФайла = ПараметрыФормы.ВладелецФайла;
		ОписаниеФайла.РольФайлаID = ПараметрыФормы.РольФайлаID;
		ОписаниеФайла.ШаблонID = ПараметрыФормы.ШаблонID;
		ОписаниеФайла.ДатаСоздания = ТекущаяДатаСеанса();
		ОписаниеФайла.Код = "";
	Иначе
		ВызватьИсключение НСтр("ru = 'Не указан идентификатор файла.'");
	КонецЕсли;
	
	ЗаполнитьФорму(ОписаниеФайла);
	УстановитьДоступностьКоманд();
	
	Элементы.Наименование.ТолькоПросмотр = Не РазрешеноРедактирование;
	Элементы.Описание.ТолькоПросмотр = Не РазрешеноРедактирование;
	
	Если ЗначениеЗаполнено(ID) Тогда
		Заголовок = СтрШаблон(НСтр("ru = '%1 (Файл)'"), Наименование);
	Иначе
		Заголовок = НСтр("ru = 'Файл (создание)'");
	КонецЕсли;
	
КонецПроцедуры

// Создает файл копированием оригинала.
//
&НаСервере
Процедура СоздатьИзОригинала()
	
	ТекущийФайл = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Наименование,
		Неопределено,
		"DMFile",
		Расширение,
		РольФайлаID);
	ТекущийФайл.Описание = Описание;
	ТекущийФайл.Размер = Размер;
	ТекущийФайл.ДатаМодификации = ДатаМодификацииУниверсальная;
	ТекущийФайл.ДатаМодификацииУниверсальная = ДатаМодификацииУниверсальная;
	
	ПараметрыСоздания = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.НовыеПараметрыСозданияФайла(
		ТекущийФайл);
	ПараметрыСоздания.АдресВременногоХранилищаФайла = АдресВременногоХранилищаФайла;
	ПараметрыСоздания.Владелец = ВладелецФайла;
	ПараметрыСоздания.ЯвляетсяСканКопией = ЯвляетсяОригиналом;
	
	ID = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СоздатьФайлВДокументообороте(
		ПараметрыСоздания,
		ВладелецID,
		ВладелецТип,
		Владелец);
	
	ОригиналID = "";
	
	ПолучитьОписаниеФайлаИЗаполнитьФорму();
	
КонецПроцедуры

// Создает файл из шаблона.
//
&НаСервере
Процедура СоздатьИзШаблона()
	
	ТекущийФайл = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		Наименование,
		Неопределено,
		"DMFile",
		Расширение,
		РольФайлаID);
	ТекущийФайл.Описание = Описание;
	ТекущийФайл.Размер = Размер;
	ТекущийФайл.ДатаМодификации = ДатаМодификацииУниверсальная;
	ТекущийФайл.ДатаМодификацииУниверсальная = ДатаМодификацииУниверсальная;
	
	ПараметрыСоздания = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.НовыеПараметрыСозданияФайла(
		ТекущийФайл);
	ПараметрыСоздания.ШаблонID = ШаблонID;
	ПараметрыСоздания.Владелец = ВладелецФайла;
	ПараметрыСоздания.ЯвляетсяСканКопией = ЯвляетсяОригиналом;
	
	ID = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СоздатьФайлВДокументообороте(
		ПараметрыСоздания,
		ВладелецID,
		ВладелецТип,
		Владелец);
	
	ПолучитьОписаниеФайлаИЗаполнитьФорму();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКоманд()
	
	РедактируетсяДругимПользователем = Редактируется И Не РедактируетсяТекущимПользователем;
	
	МожноЗахватить = ДоступенЗахватИРедактирование
		И Не РедактируетсяДругимПользователем
		И РазрешеноРедактирование
		И Не Зашифрован
		И Не ЕстьПодписи;
	МожноЗакончитьРедактирование = Существует И РедактируетсяТекущимПользователем И Не Зашифрован И Не ЕстьПодписи;
	
	Элементы.ФормаПоказатьВСписке.Доступность = Существует И Не Зашифрован;
	Элементы.ОткрытьНаЧтение.Доступность = Существует И Не Зашифрован;
	Элементы.ПанельОткрытьНаЧтение.Доступность = Существует И Не Зашифрован;
	Элементы.СохранитьНаДиск.Доступность = Существует И Не Зашифрован;
	Элементы.ПанельСохранитьНаДиск.Доступность = Существует И Не Зашифрован;
	Элементы.ФайловыеОперацииЕще.Доступность = Существует И Не Зашифрован;
	Элементы.ПанельОткрытьКаталогФайла.Доступность = Существует И Не Зашифрован;
	
	Элементы.ГруппаЭП.Доступность = Существует И Не Зашифрован;
	Элементы.ГруппаКомандыЭП.Доступность = Существует И Не Зашифрован;
	
	Элементы.ОткрытьДляРедактирования.Доступность = Существует И МожноЗахватить;
	Элементы.ПанельОткрытьДляРедактирования.Доступность = Существует И МожноЗахватить;
	
	Элементы.ЗакончитьРедактирование.Доступность = МожноЗакончитьРедактирование;
	Элементы.ПанельЗакончитьРедактирование.Доступность = МожноЗакончитьРедактирование;
	Элементы.ПанельСохранитьИзменения.Доступность = МожноЗакончитьРедактирование;
	Элементы.ПанельОтменитьРедактирование.Доступность = МожноЗакончитьРедактирование;
	
	Элементы.ПанельОбновитьИзФайлаНаДиске.Доступность = Существует И МожноЗахватить;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти