/////////////////////////////////////////////////////////////////////////
//Все модули Управляемых и Обычных форм обработки одинаковы и совместимы.
//Для копирования модуля Управляемой формы в модуль Обычной формы, нужно
//	быстрой заменой закомментировать директивы "&НаКлиенте" и "&НаСервере".
//Для копирования модуля Обычной формы в модуль Управляемой формы, нужно 
//	быстрой заменой раскомментировать директивы "&НаКлиенте" и "&НаСервере"

 &НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПодборДляКопированияНастроек Тогда
		ЗаголовокКнопки = НСтр("be = 'Скапіяваць Налады абраным карыстальнікам'; en = 'Copy settings to selected users'; es = 'Copiar la configuración a los usuarios seleccionados'; ka = 'დააკოპირეთ პარამეტრები შერჩეულ მომხმარებლებს'; kk = 'Таңдалған пайдаланушыларға параметрлерді көшіру'; ro = 'Copiați setările pentru utilizatorii selectați'; ru = 'Скопировать настройки выбранным пользователям'; tr = 'Ayarları seçilen kullanıcılara kopyala'; uk = 'Скопіювати Налаштування обраним користувачам'; uz = 'Tanlangan foydalanuvchilarga sozlamalarni nusxalash'");
		ЗаголовокСписка = НСтр("be = 'Выбраныя карыстальнікі'; en = 'Selected Users'; es = 'Usuarios seleccionados'; ka = 'შერჩეული მომხმარებლები'; kk = 'Таңдалған пайдаланушылар'; ro = 'Utilizatori Selectați'; ru = 'Выбранные пользователи'; tr = 'Seçilen Kullanıcılar'; uk = 'Вибрані користувачі'; uz = 'Tanlangan foydalanuvchilar'");
	Иначе
		ЗаголовокКнопки = НСтр("be = 'Загрузіць выбраных карыстальнікаў'; en = 'Upload selected users'; es = 'Descargar usuarios seleccionados'; ka = 'ატვირთეთ შერჩეული მომხმარებლები'; kk = 'Таңдалған пайдаланушыларды жүктеу'; ro = 'Încărcați utilizatorii selectați'; ru = 'Загрузить выбранных пользователей'; tr = 'Seçilen kullanıcıları yükle'; uk = 'Завантажити вибраних користувачів'; uz = 'Tanlangan foydalanuvchilarni yuklab oling'");
		ЗаголовокСписка = НСтр("be = 'Карыстальнікі для імпарту ў Cleverence'; en = 'Users to import into Cleverence'; es = 'Usuarios para importar a Cleverence'; ka = 'მომხმარებელი იმპორტი შევიდა Cleverence'; kk = 'Cleverence-ке импорттау үшін пайдаланушылар'; ro = 'Utilizatorii să importe în Cleverence'; ru = 'Пользователи для импорта в MobileSMARTS'; tr = ""Cleverence'a aktarılacak kullanıcılar""; uk = 'Користувачі для імпорту в Cleverence'; uz = 'Cleverence-ga import qilish uchun foydalanuvchilar'");
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЭлементыФормы.КоманднаяПанельФормы.Кнопки.ОК.Текст = ЗаголовокКнопки;
		Элементы.ПользователиКороткогоСпискаЗаголовок.Заголовок = ЗаголовокСписка;
		КопироватьПрава = Ложь;
	#Иначе
		Элементы.ОК.Заголовок = ЗаголовокКнопки;
		Элементы.ПользователиКороткогоСписка.Заголовок = ЗаголовокСписка;
		КопироватьПрава = Истина;
	#КонецЕсли
	
	ЗаполнитьТаблицы();
	
	//Клеверенс Автотестирование. Текст проверки должен быть последним!
	Если АвтоТестОткрытияФормы и ОписаниеОповещенияОЗакрытии <> Неопределено Тогда
		РезОткрытия = Новый Структура;
		РезОткрытия.Вставить("ВремяЗакрытия",ТекущаяУниверсальнаяДатаВМиллисекундах());
		#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
        	РезОткрытия.Вставить("ИмяФормы",ЭтаФорма.ИмяФормы);
		#Иначе	
			РезОткрытия.Вставить("ИмяФормы",ЭтаФорма.Заголовок);
		#КонецЕсли
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, РезОткрытия);
		Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВсеПользователи

&НаКлиенте
Процедура ВсеПользователиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда		
		СтандартнаяОбработка = Ложь;                    
	#КонецЕсли

	Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("Число") Тогда
		Возврат;
	КонецЕсли;
	
	ПеренестиПользователей(ВсеПользователи, ПользователиКороткогоСписка, ПараметрыПеретаскивания.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеПользователиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПользователиКороткогоСписка

&НаКлиенте
Процедура ПользователиКороткогоСпискаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда		
		СтандартнаяОбработка = Ложь;                    
	#КонецЕсли

	Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("Число") Тогда
		Возврат;
	КонецЕсли;
	
	ПеренестиПользователей(ПользователиКороткогоСписка, ВсеПользователи, ПараметрыПеретаскивания.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиКороткогоСпискаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УбратьДоступККомандеУВсехПользователей(Команда)
	
	МассивПеретаскиваемыхЭлементов = Новый Массив;
	
	Для Каждого ОписаниеСтроки Из ПользователиКороткогоСписка Цикл
		МассивПеретаскиваемыхЭлементов.Добавить(ОписаниеСтроки);
	КонецЦикла;
	
	ПеренестиПользователей(ВсеПользователи, ПользователиКороткогоСписка, МассивПеретаскиваемыхЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьДоступККомандеУВыделенныхПользователей(Команда)
	
	МассивПеретаскиваемыхЭлементов = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ПользователиКороткогоСписка.ВыделенныеСтроки Цикл
		МассивПеретаскиваемыхЭлементов.Добавить(Элементы.ПользователиКороткогоСписка.ДанныеСтроки(ВыделеннаяСтрока));
	КонецЦикла;
	
	ПеренестиПользователей(ВсеПользователи, ПользователиКороткогоСписка, МассивПеретаскиваемыхЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступДляВсехПользователей(Команда)
	
	МассивПеретаскиваемыхЭлементов = Новый Массив;
	
	Для Каждого ОписаниеСтроки Из ВсеПользователи Цикл
		МассивПеретаскиваемыхЭлементов.Добавить(ОписаниеСтроки);
	КонецЦикла;
	
	ПеренестиПользователей(ПользователиКороткогоСписка, ВсеПользователи, МассивПеретаскиваемыхЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКомандуДляВыделенныхПользователей(Команда)
	
	МассивПеретаскиваемыхЭлементов = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ВсеПользователи.ВыделенныеСтроки Цикл
		МассивПеретаскиваемыхЭлементов.Добавить(Элементы.ВсеПользователи.ДанныеСтроки(ВыделеннаяСтрока));
	КонецЦикла;
	
	ПеренестиПользователей(ПользователиКороткогоСписка, ВсеПользователи, МассивПеретаскиваемыхЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	РезультатВыбора = Новый Структура;
	РезультатВыбораПользователи = Новый СписокЗначений;
	
	Для Каждого ЭлементКоллекции Из ПользователиКороткогоСписка Цикл
		РезультатВыбораПользователи.Добавить(ЭлементКоллекции.Пользователь);
	КонецЦикла;
	
	РезультатВыбора.Вставить("Пользователи", РезультатВыбораПользователи);
	РезультатВыбора.Вставить("КопироватьПрава", КопироватьПрава);
	#Если ТолстыйКлиентОбычноеПриложение Тогда		
		Если НЕ ОписаниеОповещенияОЗакрытии = Неопределено Тогда	
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, РезультатВыбора);
		КонецЕсли;                              		
	#КонецЕсли
	
	Закрыть(РезультатВыбора);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицы()
	
	Запрос = Новый Запрос;
	
	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления";
		
		Если Метаданные.Справочники.Найти("Users") <> Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Пользователи", "Справочник.Users");
			ИмяСправочника = "Users";
		Иначе
			ИмяСправочника = "Пользователи";
		КонецЕсли;
		
		Если Метаданные.Справочники[ИмяСправочника].Реквизиты.Найти("Недействителен") <> Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса +" И НЕ Пользователи.Недействителен";
		ИначеЕсли Метаданные.Справочники[ИмяСправочника].Реквизиты.Найти("Invalid") <> Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса +" И НЕ Пользователи.Invalid";
		КонецЕсли;
		
		Если Метаданные.Справочники[ИмяСправочника].Реквизиты.Найти("Служебный") <> Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса +" И НЕ Пользователи.Служебный";
		ИначеЕсли Метаданные.Справочники[ИмяСправочника].Реквизиты.Найти("Internal") <> Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса +" И НЕ Пользователи.Internal";
		КонецЕсли;
	#Иначе
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления";		
	#КонецЕсли
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СозданныеПользователиИмпорта.НайтиПоЗначению(Выборка.Ссылка) = Неопределено Тогда
			ВсеПользователи.Добавить().Пользователь = Выборка.Ссылка;
		Иначе
			ПользователиКороткогоСписка.Добавить().Пользователь = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	ВсеПользователи.Сортировать("Пользователь Возр");
	ПользователиКороткогоСписка.Сортировать("Пользователь Возр");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиПользователей(Приемник, Источник, МассивПеретаскиваемыхЭлементов)
	
	Для Каждого ПеретаскиваемыйЭлемент Из МассивПеретаскиваемыхЭлементов Цикл
		НовыйПользователь = Приемник.Добавить();
		НовыйПользователь.Пользователь = ПеретаскиваемыйЭлемент.Пользователь;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Источник.Удалить(Источник.Найти(ПеретаскиваемыйЭлемент.Пользователь));
		#Иначе
			Источник.Удалить(ПеретаскиваемыйЭлемент);
		#КонецЕсли
	КонецЦикла;
	
	Приемник.Сортировать("Пользователь Возр");
	
КонецПроцедуры

#КонецОбласти

#Если ТолстыйКлиентОбычноеПриложение Тогда
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	Объект = ЭтотОбъект;
#КонецЕсли
