
&НаСервере
Процедура ЗаписатьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Данные=Новый Структура;
	//Данные.Вставить("Адрес",Адрес);
	//Данные.Вставить("Порт",Порт);
	//Данные.Вставить("ИмяПользователя",ИмяПользователя);
	//Данные.Вставить("ИмяПользователяСистемы",ИмяПользователяСистемы);
	//Данные.Вставить("Пароль",Пароль);
	//Данные.Вставить("ПарольПользователяСистемы",ПарольПользователяСистемы);
	//Данные.Вставить("ИД",ИД);
	//Данные.Вставить("КоличествоОтправляемыхПакетовЗаРаз",КоличествоОтправляемыхПакетовЗаРаз);
	
	Константы.ш_НастройкиПочты.Установить(ЗначениеВСтрокуВнутр(Данные));
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Данные=ЗначениеИзСтрокиВнутр(Константы.ш_НастройкиПочты.Получить());
		Данные.Свойство("АдресSMTP",АдресSMTP);
		Данные.Свойство("ПортSMTP",ПортSMTP);
		Данные.Свойство("АдресIMAP",АдресIMAP);
		Данные.Свойство("ПортIMAP",ПортIMAP);
		Данные.Свойство("АдресPOP3",АдресPOP3);
		Данные.Свойство("ПортPOP3",ПортPOP3);
		Данные.Свойство("ПользовательSMTP",ПользовательSMTP);
		Данные.Свойство("ПарольSMTP",ПарольSMTP);
		Данные.Свойство("ИспользоватьSSLSMTP",ИспользоватьSSLSMTP);
		Данные.Свойство("СпособSMTPАвторизации",СпособSMTPАвторизации);
		Данные.Свойство("POP3ПередSMTP",POP3ПередSMTP);
		Данные.Свойство("ПользовательIMAP",ПользовательIMAP);
		Данные.Свойство("ПарольIMAP",ПарольIMAP);
		Данные.Свойство("ИспользоватьSSLIMAP",ИспользоватьSSLIMAP);
		Данные.Свойство("ПользовательPOP3",ПользовательPOP3);
		Данные.Свойство("ПарольPOP3",ПарольPOP3);
		Данные.Свойство("СпособPOP3Авторизации",СпособPOP3Авторизации);
		Данные.Свойство("ОтображаемоеИмя",ОтображаемоеИмя);
		Данные.Свойство("ИмяОтправителя",ИмяОтправителя);
		Данные.Свойство("ПарольSMTP",ПарольSMTP);
		Данные.Свойство("ПарольSMTP",ПарольSMTP);
	Исключение
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
