
&НаСервере
Процедура СоздатьЗаказыНаСборкуНаСервере()
	
	Если НЕ ЗначениеЗаполнено(ЗаказНаСборку) Тогда
		Сообщить("Не указан исходный заказ на сборку");
		Возврат;
	КонецЕсли;
	
	Для каждого стрШифр Из ТаблицаШифров Цикл
		
		НовыйЗаказ = ЗаказНаСборку.Скопировать();
		НовыйЗаказ.Дата = ЗаказНаСборку.Дата;
		
		Если ЗначениеЗаполнено(НовыйЗаказ.Характеристика) Тогда
			
			НовыйЗаказ.Характеристика = стрШифр.Шифр;
			
			Для каждого стрТовары Из НовыйЗаказ.Товары Цикл
				
				Если (стрТовары.Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры 
					ИЛИ стрТовары.Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
					И ЗначениеЗаполнено(НовыйЗаказ.Характеристика) Тогда
					
					стрТовары.Характеристика = стрШифр.Шифр;
					
				КонецЕсли;
				
			КонецЦикла;
			
			НовыйЗаказ.Записать(РежимЗаписиДокумента.Проведение);
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан %1", НовыйЗаказ.Ссылка), НовыйЗаказ.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказыНаСборку(Команда)
	СоздатьЗаказыНаСборкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ЗаказНаСборку", ЗаказНаСборку);
	
КонецПроцедуры
