&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ОтборНаш) Тогда 
		
		ОтборНаш = Параметры.ОтборНаш;
		
	Иначе
		ОтборНаш = "Все";	
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ОтборОтправлениеПрибытие) Тогда 
		
		ОтборОтправлениеПрибытие = Параметры.ОтборОтправлениеПрибытие;
		
	Иначе
		ОтборОтправлениеПрибытие = "Все";	
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере_ФормаСписка(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНашПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтправлениеПрибытиеПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинСписка()

	Список.Отбор.Элементы.Очистить();
	
	Если  ОтборНаш = "Наши" ИЛИ ОтборНаш = "Сторонние" Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наш");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Истина;
		
		Если ОтборНаш = "Наши" Тогда
			ЭлементОтбора.ПравоеЗначение = Истина;
		Иначе
			ЭлементОтбора.ПравоеЗначение = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	Если  ОтборОтправлениеПрибытие = "ТолькоОтправление" ИЛИ ОтборОтправлениеПрибытие = "ТолькоПрибытие" Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ОтборОтправлениеПрибытие = "ТолькоОтправление" Тогда 
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отправление");
		Иначе
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Прибытие");
		КонецЕсли;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Истина;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	

КонецПроцедуры