
#Область МенеджерКриптографии

Функция ИнициализироватьМенеджерКриптографии(ПарольКонтейнера = Неопределено, ТипМодуляКриптографии = Неопределено, ИспользоватьИнтерактивныйРежим = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ТипМодуляКриптографии) Тогда
		ТипМодуляКриптографии = 80;
	КонецЕсли;
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить("");
	ПараметрыКонструктора.Добавить("");
	ПараметрыКонструктора.Добавить(ТипМодуляКриптографии);
	
	Если ИспользоватьИнтерактивныйРежим
		И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ВерсияПриложенияНиже8_3_13() Тогда
		
		ПараметрыКонструктора.Добавить(Вычислить("ИспользованиеИнтерактивногоРежимаКриптографии.Использовать"));
	КонецЕсли;
	
	МенеджерКриптографии = Новый("МенеджерКриптографии", ПараметрыКонструктора);
	
	Если ЗначениеЗаполнено(ПарольКонтейнера) Тогда
		МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ПарольКонтейнера;
	КонецЕсли;
	
	Возврат МенеджерКриптографии;
	
КонецФункции 

#КонецОбласти

#Область Подписание

Функция ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера = Неопределено, ТипМодуляКриптографии, ИспользоватьИнтерактивныйРежим = Ложь, 
	ФайлОбмена = Неопределено, ВернутьОшибку = Ложь) Экспорт
	
	Попытка
	
		Результат = ПодписатьКонтент(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера, ТипМодуляКриптографии, ИспользоватьИнтерактивныйРежим);
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		Если ИнформацияОбОшибке.Причина = Неопределено Тогда
			Описание = ИнформацияОбОшибке.Описание;
		Иначе
			Описание = ИнформацияОбОшибке.Причина.Описание;
		КонецЕсли;
		
		КодОшибки = КодОшибкиМенеджераКриптографии(Описание);
		
		Если ЗначениеЗаполнено(ФайлОбмена) Тогда
			КонтурЛогистика_КриптографияСервер.ДобавитьОшибкуКриптографииВСтатусТитула(
				ФайлОбмена, КодОшибки, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке), "Ошибка подписания менеджером криптографии 1С");			
		КонецЕсли;
		
		Если ВернутьОшибку Тогда
			Ошибка = Новый Структура;
			Ошибка.Вставить("КодОшибки", КодОшибки);
			Ошибка.Вставить("ОписаниеОшибки", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
			Возврат Ошибка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
			
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПодписатьКонтент(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера, ТипМодуляКриптографии, ИспользоватьИнтерактивныйРежим)
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии(ПарольКонтейнера, ТипМодуляКриптографии, ИспользоватьИнтерактивныйРежим);
		
	Результат = ПодписатьКонтентЧерезМенеджерКриптографии(МенеджерКриптографии, ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера);
	
	Возврат Результат;
	
КонецФункции

Функция ПодписатьКонтентЧерезМенеджерКриптографии(МенеджерКриптографии, ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера)
	
	ПараметрыПоиска		 = ПараметрыПоискаСертификатов();
	СвойстваСертификата	 = ВсеСвойстваСертификата(Истина);
	
	Сертификат				 = ПолучитьДанныеСертификата(МенеджерКриптографии, ОтпечатокСертификата, ПараметрыПоиска, СвойстваСертификата);
	СертификатКриптографии	 = Новый СертификатКриптографии(Сертификат.ДвоичныеДанные);
	
	Результат = МенеджерКриптографии.Подписать(ДвоичныеДанные, СертификатКриптографии);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СписокСертификатов

Функция ПолучитьСписокЛокальныхСертификатов() Экспорт
	
	Попытка
		
		ПараметрыПоиска		 = ПараметрыПоискаСертификатов();
		СвойстваСертификата	 = ВсеСвойстваСертификата();
		
		СписокСертификатов = ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата);
		
		Результат = ПолучитьСписокЛокальныхСертификатов_ПодготовитьРезультат(СписокСертификатов);
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("КриптографияКлиентСервер.ПолучитьСписокЛокальныхСертификатов",
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокСертификатов(ПараметрыПоиска, СвойстваСертификата)
	
	МенеджерКриптографии	 = ИнициализироватьМенеджерКриптографии();
	
	ХранилищеСертификатовКриптографии = ПолучитьХранилищеСертификатов(МенеджерКриптографии, ПараметрыПоиска);
	
	Если ПараметрыПоиска.Свойство("Отпечаток") Тогда
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(ПараметрыПоиска.Отпечаток);
		Возврат РазобратьОтвет_ПолучитьСписокСертификатов(СертификатКриптографии, ПараметрыПоиска, СвойстваСертификата);
	КонецЕсли;
	
	Если ПараметрыПоиска.Свойство("СерийныйНомер") Тогда
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоСерийномуНомеру(Base64Значение(ПараметрыПоиска.СерийныйНомер));
		Возврат РазобратьОтвет_ПолучитьСписокСертификатов(СертификатКриптографии, ПараметрыПоиска, СвойстваСертификата);
	КонецЕсли;
	
	СертификатыКриптографии = ХранилищеСертификатовКриптографии.ПолучитьВсе();
	Возврат РазобратьОтвет_ПолучитьСписокСертификатов(СертификатыКриптографии, ПараметрыПоиска, СвойстваСертификата);
	
КонецФункции

Функция РазобратьОтвет_ПолучитьСписокСертификатов(Ответ, ПараметрыПоиска, СвойстваСертификата)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(Ответ) Тогда
		
		Если ТипЗнч(Ответ) = Тип("Массив") Тогда
			
			Для Каждого СертификатКриптографии Из Ответ Цикл
				
				Результат.Добавить(Новый_ОписаниеСертификата(СертификатКриптографии, СвойстваСертификата));
				
				Если СвойствоСтруктуры(ПараметрыПоиска, "ТолькоПервый") = Истина Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			Результат.Добавить(Новый_ОписаниеСертификата(Ответ, СвойстваСертификата));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПолучениеСертификата

Функция ПолучитьСертификат(ОтпечатокСертификата, ТипМодуля) Экспорт
	
	ПараметрыПоиска		 = ПараметрыПоискаСертификатов();
	СвойстваСертификата	 = ВсеСвойстваСертификата(Истина);
	
	МенеджерКриптографии	 = ИнициализироватьМенеджерКриптографии(, ТипМодуля);
	
	Результат = ПолучитьДанныеСертификата(МенеджерКриптографии, ОтпечатокСертификата, ПараметрыПоиска, СвойстваСертификата);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеСертификата(МенеджерКриптографии, ОтпечатокСертификата, ПараметрыПоиска, СвойстваСертификата) Экспорт
	
	ХранилищеСертификатовКриптографии = ПолучитьХранилищеСертификатов(МенеджерКриптографии, ПараметрыПоиска);
	
	Если ТипЗнч(ОтпечатокСертификата) = Тип("ДвоичныеДанные") Тогда
		
		СертификатКриптографии = ХранилищеСертификатовКриптографии.НайтиПоОтпечатку(ОтпечатокСертификата);
		
	Иначе
		
		СертификатыКриптографии	 = ХранилищеСертификатовКриптографии.ПолучитьВсе();
		СертификатКриптографии	 = НайтиСертификатВМассивеПоОтпечатку(СертификатыКриптографии, ОтпечатокСертификата);
		
	КонецЕсли;
	
	Результат = Новый_ОписаниеСертификата(СертификатКриптографии, СвойстваСертификата);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДвоичныеДанныеСертификата(ОтпечатокСертификата, ТипМодуля = Неопределено) Экспорт
	
	ПараметрыПоиска	= ПараметрыПоискаСертификатов();
	
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии(, ТипМодуля);
	
	ХранилищеСертификатовКриптографии = ПолучитьХранилищеСертификатов(МенеджерКриптографии, ПараметрыПоиска);
	
	СертификатыКриптографии	 = ХранилищеСертификатовКриптографии.ПолучитьВсе();
	СертификатКриптографии	 = НайтиСертификатВМассивеПоОтпечатку(СертификатыКриптографии, ОтпечатокСертификата);
		
	Результат = СертификатКриптографии.Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьХранилищеСертификатов(МенеджерКриптографии, ПараметрыПоиска)
	
	ТипХранилища			 = СвойствоСтруктуры(ПараметрыПоиска, "ТипХранилища");
	РасположениеХранилища	 = СвойствоСтруктуры(ПараметрыПоиска, "РасположениеХранилища");
	
	Возврат МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилища, РасположениеХранилища);
		
КонецФункции

#КонецОбласти

#Область Расшифровка

Функция РасшифроватьДанные(ЗашифрованныеДвоичныеДанные, ПарольКонтейнера = "", ТипМодуляКриптографии = Неопределено, ИспользоватьИнтерактивныйРежим = Ложь) Экспорт
		
	МенеджерКриптографии = ИнициализироватьМенеджерКриптографии(ПарольКонтейнера, ТипМодуляКриптографии, ИспользоватьИнтерактивныйРежим);
	
	Попытка
		Результат = МенеджерКриптографии.Расшифровать(ЗашифрованныеДвоичныеДанные);
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
	КонецПопытки;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область ВспомогательныеФункции

Функция ПолучитьСписокЛокальныхСертификатов_ПодготовитьРезультат(СписокСертификатов) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого Серт Из СписокСертификатов Цикл
		
		Если Не ЭтоВалидныйСертификат(Серт) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеСертификата = Новый Структура("Наименование, Фамилия, Имя, Отчество, Должность, ДатаВыдачи, СрокДействия, ОтпечатокСертификата, 
											|Организация, Издатель, Контур, Инн, ИННЮЛ, ОГРНИП, Кпп, СНИЛС, ВДиадоке, Ошибка, ИздательИНН, ИздательОГРН");
		
		ОписаниеСертификата.ДатаВыдачи			 = Серт.ДатаНачала;
		ОписаниеСертификата.СрокДействия		 = Серт.ДатаОкончания;
		ОписаниеСертификата.ОтпечатокСертификата = Серт.Отпечаток;
		
		Если Серт.Субъект.Свойство("SN") И Серт.Субъект.Свойство("G") Тогда // в старых форматах сертификатов этих полей может не быть
			ОписаниеСертификата.Наименование = Серт.Субъект.SN + " " + Серт.Субъект.G;
		Иначе
			Если Серт.Субъект.Свойство("O") Тогда   // проверка юл
				Если Серт.Субъект.Свойство("OID2_5_4_4") И Серт.Субъект.Свойство("OID2_5_4_42") Тогда
					ОписаниеСертификата.Наименование = Серт.Субъект.OID2_5_4_4 + " " + Серт.Субъект.OID2_5_4_42;	
				КонецЕсли;
			Иначе
				ОписаниеСертификата.Наименование = Серт.Субъект.CN;
			КонецЕсли;
		КонецЕсли;
		
		Если Серт.Субъект.Свойство("Фамилия") Тогда
			ОписаниеСертификата.Фамилия = Серт.Субъект.Фамилия;
		ИначеЕсли Серт.Субъект.Свойство("SN") Тогда
			ОписаниеСертификата.Фамилия = Серт.Субъект.SN;	
		КонецЕсли;
		
		ИмяОтчествоМассив = Новый Массив;
		Если Серт.Субъект.Свойство("ИмяОтчество") Тогда
			ИмяОтчествоМассив = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(Серт.Субъект.ИмяОтчество, " ");
		ИначеЕсли Серт.Субъект.Свойство("G") Тогда
			ИмяОтчествоМассив = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(Серт.Субъект.G, " ");	
		КонецЕсли;
		
		Если Серт.Субъект.Свойство("T") Тогда
			ОписаниеСертификата.Должность = Серт.Субъект.T;
		ИначеЕсли Серт.Субъект.Свойство("OID2_5_4_12") Тогда
			ОписаниеСертификата.Должность = Серт.Субъект.OID2_5_4_12;	
		КонецЕсли;
		
		Если ИмяОтчествоМассив.Количество() = 1 Тогда 
			ОписаниеСертификата.Имя = ИмяОтчествоМассив[0];
		КонецЕсли;
		Если ИмяОтчествоМассив.Количество() > 1 Тогда
			ОписаниеСертификата.Имя = ИмяОтчествоМассив[0];
			ОписаниеСертификата.Отчество = ИмяОтчествоМассив[1];
			Для Счет = 2 По ИмяОтчествоМассив.Количество() -1 Цикл
				ОписаниеСертификата.Отчество = ОписаниеСертификата.Отчество + " " + ИмяОтчествоМассив[Счет];
			КонецЦикла;
		КонецЕсли;
		
		ОписаниеСертификата.Издатель	 = Серт.Издатель.CN;
		ОписаниеСертификата.Организация	 = ?(Серт.Субъект.Свойство("O"), Серт.Субъект.O, "");
		
		ОписаниеСертификата.ИздательИНН = ПолучитьИННИздателя(Серт);		
		ОписаниеСертификата.ИздательОГРН = ПолучитьОГРНИздателя(Серт);
						
		Если Серт.Субъект.Свойство("ИННЮЛ") Тогда
			ИННЮЛ = Серт.Субъект.ИННЮЛ;
		Иначе
			ИННЮЛ = "";
		КонецЕсли;
			
		Если Серт.Субъект.Свойство("ИНН") Тогда
			ИНН = Серт.Субъект.ИНН;
		Иначе
			ИНН = "";
		КонецЕсли;
		
		// обрезаем лидирующие нули
		Если Лев(ИНН, 2) = "00" Тогда 
			ИНН = Сред(ИНН, 3);
		КонецЕсли;
		
		ОписаниеСертификата.ИНН = ИНН;
		ОписаниеСертификата.ИННЮЛ = ИННЮЛ;
		
		Если Серт.Субъект.Свойство("ОГРНИП") Тогда
			ОписаниеСертификата.ОГРНИП = Серт.Субъект.ОГРНИП;
		КонецЕсли;
		
		// здесь КПП так просто не вытащить, он вроде присутствует в хитром поле:
		// _1_2_840_113549_1_9_2	"6699000000-669901001-012522310804"	Строка
		// _1_2_840_113549_1_9_2	"6699000000-669901001-005809723989"	Строка
		
		// еще один вариант - раскладывать в массив строк и брать вторую
		
		Если Серт.Субъект.Свойство("СНИЛС") Тогда
			СНИЛС = Серт.Субъект.СНИЛС;
		Иначе
			СНИЛС = "";
		КонецЕсли;
		ОписаниеСертификата.СНИЛС = СНИЛС;
		
		Для Каждого ЭлементСтруктуры Из Серт.Субъект Цикл
			
			Если Найти(ЭлементСтруктуры.Значение, "-0" + СНИЛС) > 0
				И СтрДлина(ЭлементСтруктуры.Значение) >= 10 + 1 + 9 + 1 + СтрДлина(СНИЛС) + 1 Тогда
				// 6699000000-669901001-005809723989
				// 10        1    9    1   СНИЛС+"0"
				КПП = ЭлементСтруктуры.Значение;
				
				КПП = Сред(КПП, 12);							// 6699000000-669901001-005809723989  -> 669901001-005809723989
				КПП = СтрЗаменить(КПП, "0" + СНИЛС, "");	// 669901001-005809723989  -> -005809723989
				КПП = СтрЗаменить(КПП, "-", "");				// -005809723989 -> 005809723989
				Если СтрДлина(КПП) = 9 Тогда
					ОписаниеСертификата.КПП = КПП;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОписаниеСертификата.КПП) Тогда
				ЭлементыКПП = РазделитьСтроку(ЭлементСтруктуры.Значение, "-");
				Если ЭлементыКПП.Количество() > 1 Тогда
					ОписаниеСертификата.КПП = ЭлементыКПП[1];
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		ОписаниеСертификата.Контур = Истина;
		
		Если ОписаниеСертификата.СрокДействия < НачалоДня(ТекущаяДата()) Тогда
			
			ОписаниеСертификата.Вставить("Ошибка"	, "Срок действия сертификата истек");
			ОписаниеСертификата.Вставить("ВДиадоке"	, Ложь);
			// кажется, что их лучше вообще не показывать
			
		Иначе
			
			ОписаниеСертификата.Вставить("ВДиадоке", Истина);
			
		КонецЕсли;
		
		Если ОписаниеСертификата.ВДиадоке Тогда
			Результат.Добавить(ОписаниеСертификата);  // добавляем только валидные сертификаты
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИННИздателя(Сертификат) Экспорт
	
	Если Сертификат.Издатель.Свойство("ИННЮЛ") Тогда
		Возврат Сертификат.Издатель.ИННЮЛ;
	ИначеЕсли Сертификат.Издатель.Свойство("ИНН") Тогда
		Возврат Сертификат.Издатель.ИНН;
	ИначеЕсли Сертификат.Издатель.Свойство("OID1_2_643_100_4") Тогда
		Возврат Сертификат.Издатель.OID1_2_643_100_4;
	ИначеЕсли Сертификат.Издатель.Свойство("OID1_2_643_3_131_1_1") Тогда
		Возврат Сертификат.Издатель.OID1_2_643_3_131_1_1;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОГРНИздателя(Сертификат) Экспорт
	
	Если Сертификат.Издатель.Свойство("ОГРН") Тогда
		Возврат Сертификат.Издатель.ОГРН;	
	ИначеЕсли Сертификат.Издатель.Свойство("OID1_2_643_100_1") Тогда
		Возврат Сертификат.Издатель.OID1_2_643_100_1;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПараметрыПоискаСертификатов() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТипХранилища",			ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	Результат.Вставить("РасположениеХранилища",	РасположениеХранилищаСертификатовКриптографии.ДанныеПользователяОС);
		
	Возврат Результат;
	
КонецФункции

Функция ЭтоВалидныйСертификат(ДанныеСертификата) Экспорт
	
	Результат = Ложь;
	
	Если ТипЗнч(ДанныеСертификата) = Тип("Структура")
		
		И ДанныеСертификата.Свойство("Субъект") И ТипЗнч(ДанныеСертификата.Субъект) = Тип("Структура")
		И ДанныеСертификата.Субъект.Свойство("CN")
		И (ДанныеСертификата.Субъект.Свойство("ИНН") ИЛИ ДанныеСертификата.Субъект.Свойство("ИННЮЛ"))
		
		И ДанныеСертификата.Свойство("Издатель") И ТипЗнч(ДанныеСертификата.Издатель) = Тип("Структура")
		И ДанныеСертификата.Издатель.Свойство("CN") 
		
	Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВсеСвойстваСертификата(ДобавитьДвоичныеДанные = Ложь, ДобавитьЗакрытыйКлюч = Истина) Экспорт
	
	Результат = Новый Структура("СерийныйНомер, Издатель, Субъект, ДатаНачала, ДатаОкончания, АлгоритмКлюча");
	
	Если ДобавитьДвоичныеДанные = Истина Тогда
		Результат.Вставить("ДвоичныеДанные");
	КонецЕсли;
	
	Если ДобавитьЗакрытыйКлюч = Истина Тогда
		Результат.Вставить("ЕстьЗакрытыйКлюч");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем Значение;
	
	Результат = ЗначениеПоУмолчанию;
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоСтруктура(Структура) И ЗначениеЗаполнено(Ключ) Тогда
		
		Если Структура.Свойство(Ключ, Значение) Тогда
			Результат = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Новый_ОписаниеСертификата(СертификатКриптографии, СвойстваСертификата) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Отпечаток", HexСтрокаИзДвоичныхДанных(СертификатКриптографии.Отпечаток));
	
	Если СвойстваСертификата.Свойство("СерийныйНомер") Тогда
		Результат.Вставить("СерийныйНомер", HexСтрокаИзДвоичныхДанных(СертификатКриптографии.СерийныйНомер));
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("Издатель") Тогда
		Результат.Вставить("Издатель", Новый Структура(СертификатКриптографии.Издатель));
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("Субъект") Тогда
		
		Результат.Вставить("Субъект", Новый Структура(СертификатКриптографии.Субъект));
		
		Если СертификатКриптографии.Субъект.Свойство("OID2_5_4_4") Тогда
			Результат.Субъект.Вставить("Фамилия", СертификатКриптографии.Субъект.OID2_5_4_4);
		КонецЕсли;
		
		Если СертификатКриптографии.Субъект.Свойство("OID2_5_4_42") Тогда
			Результат.Субъект.Вставить("ИмяОтчество", СертификатКриптографии.Субъект.OID2_5_4_42);
		КонецЕсли;
		
		Если СертификатКриптографии.Субъект.Свойство("OGRN")Тогда
			Результат.Субъект.Вставить("ОГРН", СертификатКриптографии.Субъект.OGRN);
		ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_1") Тогда
			Результат.Субъект.Вставить("ОГРН", СертификатКриптографии.Субъект.OID1_2_643_100_1);
		КонецЕсли;
		
		Если СертификатКриптографии.Субъект.Свойство("SNILS") Тогда
			Результат.Субъект.Вставить("СНИЛС", СертификатКриптографии.Субъект.SNILS);
		ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_3") Тогда
			Результат.Субъект.Вставить("СНИЛС", СертификатКриптографии.Субъект.OID1_2_643_100_3);
		КонецЕсли;
		
		Если СертификатКриптографии.Субъект.Свойство("INN") Тогда
			Результат.Субъект.Вставить("ИНН", СертификатКриптографии.Субъект.INN);
		ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_3_131_1_1")Тогда
			Результат.Субъект.Вставить("ИНН", СертификатКриптографии.Субъект.OID1_2_643_3_131_1_1);
		КонецЕсли;
		
		Если СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_4")Тогда
			Результат.Субъект.Вставить("ИННЮЛ", СертификатКриптографии.Субъект.OID1_2_643_100_4);
		КонецЕсли;
		
		Если СертификатКриптографии.Субъект.Свойство("OGRNIP")Тогда
			Результат.Субъект.Вставить("ОГРНИП", СертификатКриптографии.Субъект.OGRNIP);
		ИначеЕсли СертификатКриптографии.Субъект.Свойство("OID1_2_643_100_5")Тогда
			Результат.Субъект.Вставить("ОГРНИП", СертификатКриптографии.Субъект.OID1_2_643_100_5);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("ДвоичныеДанные") Тогда
		Результат.Вставить("ДвоичныеДанные", СертификатКриптографии.Выгрузить());
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("ДатаНачала") Тогда
		Результат.Вставить("ДатаНачала", СертификатКриптографии.ДатаНачала);
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("ДатаОкончания") Тогда
		Результат.Вставить("ДатаОкончания", СертификатКриптографии.ДатаОкончания);
	КонецЕсли;
	
	Если СвойстваСертификата.Свойство("РасширенныеСвойства") Тогда
		Результат.Вставить("РасширенныеСвойства", Новый Структура(СертификатКриптографии.РасширенныеСвойства));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиСертификатВМассивеПоОтпечатку(МассивСертификатов, ОтпечатокСертификата) Экспорт
	
	Результат = Неопределено;
	
	Для Каждого Сертификат Из МассивСертификатов Цикл
		
		ТекущийОтпечаток = HexСтрокаИзДвоичныхДанных(Сертификат.Отпечаток);
		
		Если НРег(ТекущийОтпечаток) = НРег(ОтпечатокСертификата) Тогда
			
			Результат = Сертификат;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РазделитьСтроку(Знач Строка, Разделитель = ",", ВключатьПустые = Истина) Экспорт
	
	Результат = Новый Массив;
	
	МассивРазделителей = Новый Массив;
	
	Для Сч = 1 По СтрДлина(Разделитель) Цикл
		СимволРазделителя = Сред(Разделитель, Сч, 1);
		МассивРазделителей.Добавить(СимволРазделителя);
	КонецЦикла;
	
	Пока Истина Цикл
		
		Поз = 0;
		
		Для Каждого СимволРазделителя Из МассивРазделителей Цикл
			
			Поз = Найти(Строка, СимволРазделителя);
			
			Если Поз > 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Поз = 0 Тогда
			Подстрока	 = СокрЛП(Строка);
			Строка		 = "";
		Иначе
			Подстрока	 = СокрЛП(Лев(Строка, Поз - 1));
			Строка		 = Сред(Строка, Поз + 1);
		КонецЕсли;
		
		Если ВключатьПустые ИЛИ ЗначениеЗаполнено(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			Прервать; // Нет разделителя, за которым могла бы быть следующая часть строки.
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция HexСтрокаИзДвоичныхДанных(ДвоичныеДанные) Экспорт
	
	Результат = СтрЗаменить(Строка(ДвоичныеДанные), " ", "");
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОшибкиКриптографии

Функция ТипОшибкиКриптографии(КодОшибки, НаСервере) Экспорт

	Если КодОшибки = "100" Или КодОшибки = "2148532334" Или КодОшибки = "НеНайденСертификат" Тогда
					
		Если НаСервере Тогда
			Возврат "НеНайденСертификатНаСервере";
		Иначе
			Возврат "НеНайденСертификатНаКлиенте";
		КонецЕсли;
		
	ИначеЕсли КодОшибки = "1627" Или КодОшибки = "ИстеклаЛицензияКриптоПро" Тогда
					
		Возврат "ИстеклаЛицензияКриптоПро";	
		
	Иначе
		
		Возврат "ПрочаяОшибкаКриптографии";	
		
	КонецЕсли;
		
КонецФункции

Функция КодОшибкиМенеджераКриптографии(Описание) Экспорт
	
	Если Описание = "Значение не является значением объектного типа (Отпечаток)"
		Или Описание = "Значение не является значением объектного типа (Отпечаток)" Тогда
		Возврат "НеНайденСертификат";
	ИначеЕсли Найти(Описание, "0x0000065B") > 0 Тогда
		Возврат "ИстеклаЛицензияКриптоПро";
	Иначе
		Возврат "ПрочаяОшибкаКриптографии";	
	КонецЕсли;
	
КонецФункции

Функция ОшибкиКриптографии() Экспорт
	
	ТипыОшибок = Новый Структура;
			
	// 1. Не найден сертификат на сервере
		
	ВариантыРешения = Новый Массив;
	
	ВариантРешения = Новый Структура;
	ВариантРешения.Вставить("Наименование", 
		"Проверьте, что сертификат установлен на сервере приложений 1С в локальном хранилище пользователя, под которым запускается служба rphost.");
	ВариантыРешения.Добавить(ВариантРешения);	
	ВариантРешения = Новый Структура;
	ВариантРешения.Вставить("Наименование", 
		"Если у вас в кластере несколько физических серверов - убедитесь, что сертификат установлен на каждом.");
	ВариантыРешения.Добавить(ВариантРешения);
	
	ВариантРешения = Новый Структура;
	ФорматированнаяСтрока = Новый Массив;
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("Если ошибка сохранилась, то на сервере пройдите "));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("диагностику",,,, "https://help.kontur.ru/diadoc"));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока(" и выполните рекомендации."));		
	ВариантРешения.Вставить("Наименование", ФорматированнаяСтрока);
	ВариантыРешения.Добавить(ВариантРешения);
	
	ВариантРешения = Новый Структура;
	ВариантРешения.Вставить("Наименование", 
		"Если после выполнения рекомендаций ошибка сохранилась, обратитесь в техподдержку и сообщите номер диагностики.");
	ВариантыРешения.Добавить(ВариантРешения);
	
	СоставОшибки = Новый Структура;
	СоставОшибки.Вставить("ПредставлениеТипаОшибки", "Не найден сертификат на сервере");
	СоставОшибки.Вставить("ВариантыРешения", ВариантыРешения);
	
	ТипыОшибок.Вставить("НеНайденСертификатНаСервере", СоставОшибки);
	
	// 2. Не найден сертификат на клиенте
		
	ВариантыРешения = Новый Массив;
	
	ВариантРешения = Новый Структура;
	ВариантРешения.Вставить("Наименование", "Убедитесь, что токен с сертификатом КЭП подключен к компьютеру.");
	ВариантыРешения.Добавить(ВариантРешения);	
	ВариантРешения = Новый Структура;
	ВариантРешения.Вставить("Наименование", 
		"Если работаете в 1С через удаленный рабочий стол (RDP), проверьте, что в настройках удаленного рабочего " + 
		"стола включено использование локальных портов и смарт-карт.");
	ВариантыРешения.Добавить(ВариантРешения);
	ВариантРешения = Новый Структура;
	ВариантРешения.Вставить("Наименование", 
		"Если сертификат скопирован на удаленный рабочий стол (терминальный сервер)," + 
		"то проверьте, что он установлен в локальном хранилище пользователя, под которым вы заходите.");
	ВариантыРешения.Добавить(ВариантРешения);
	
	ВариантРешения = Новый Структура;
	ФорматированнаяСтрока = Новый Массив;
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("Если ошибка сохранилась, то пройдите "));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("диагностику",,,, "https://help.kontur.ru/diadoc"));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("."));		
	ВариантРешения.Вставить("Наименование", ФорматированнаяСтрока);
	ВариантыРешения.Добавить(ВариантРешения);
	
	ВариантРешения = Новый Структура;
	ВариантРешения.Вставить("Наименование", 
		"Если после выполнения рекомендаций ошибка сохранилась, обратитесь в техподдержку и сообщите номер диагностики.");
	ВариантыРешения.Добавить(ВариантРешения);
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтурЛогистика_КакаяБаза() = "Файловая" Тогда
		ПредставлениеТипаОшибки = "Не найден сертификат";
	Иначе
		ПредставлениеТипаОшибки = "Не найден сертификат на клиенте";
	КонецЕсли;
	
	СоставОшибки = Новый Структура;
	СоставОшибки.Вставить("ПредставлениеТипаОшибки", ПредставлениеТипаОшибки);
	СоставОшибки.Вставить("ВариантыРешения", ВариантыРешения);
	
	ТипыОшибок.Вставить("НеНайденСертификатНаКлиенте", СоставОшибки);
	
	// 3. Истекла лицензия на КриптоПро
		
	ВариантыРешения = Новый Массив;
	
	ВариантРешения = Новый Структура;
		
	ВариантРешения = Новый Структура;
	ФорматированнаяСтрока = Новый Массив;
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("Перейдите по "));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("ссылке",,,, "https://i.kontur.ru/csp-license"));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока(" для ввода лицензии. Подробнее в "));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("инструкции",,,, "https://support.kontur.ru/ca/38783-vvod_licenzii_kriptopro"));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("."));
	ВариантРешения.Вставить("Наименование", ФорматированнаяСтрока);
	ВариантыРешения.Добавить(ВариантРешения);
	
	Ссылка_ИНН_КПП_Организации = "https://support.kontur.ru/cabinet/poisk-sc?p=1210&utm_source=google&utm_medium=organic&utm_referer=www.google.com"
		+ "&utm_startpage=support.kontur.ru%2fca%2f38869-licenziya_kriptopro_csp_istekla&utm_orderpage=support.kontur.ru%2fca%2f38783-vvod_licenzii_kriptopro"
		+ "&utm_campaign=callibri&utm_content=popup&utm_term=price&_gl=1*1q0bog9*_ga*MzE2NTA4MzA1LjE3Mjk0NDQ0NDk.*_ga_71ZNTPT08B*MTc0MTY4NTMzMS4zMi4xLjE3NDE2ODU5MjcuNjAuMC4w";
	
	Ссылка_Городу = "https://kontur.ru/contacts/all?p=1210&utm_source=google&utm_medium=organic&utm_referer=www.google.com&utm_startpage=support.kontur.ru%2Fca"
		+ "%2F38869-licenziya_kriptopro_csp_istekla&utm_orderpage=support.kontur.ru%2Fca%2F38783-vvod_licenzii_kriptopro&utm_campaign=callibri&utm_content=popup&utm_term=price";
	
	ВариантРешения = Новый Структура;
	ФорматированнаяСтрока = Новый Массив;
	ФорматированнаяСтрока.Добавить(
		Новый ФорматированнаяСтрока("Если лицензии нет, то можно приобрести в сервисном центре. Контакты сервисного центра можно найти по "));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("ИНН и КПП организации",,,, Ссылка_ИНН_КПП_Организации));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока(" или по "));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("городу",,,, Ссылка_Городу));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("."));
	ВариантРешения.Вставить("Наименование", ФорматированнаяСтрока);
	ВариантыРешения.Добавить(ВариантРешения);
	
	СоставОшибки = Новый Структура;
	СоставОшибки.Вставить("ПредставлениеТипаОшибки", "Истекла лицензия на КриптоПро");
	СоставОшибки.Вставить("ВариантыРешения", ВариантыРешения);
	
	ТипыОшибок.Вставить("ИстеклаЛицензияКриптоПро", СоставОшибки);
	
	// 4. Прочие ошибки криптографии
		
	ВариантыРешения = Новый Массив;
	
	ВариантРешения = Новый Структура;
	ВариантРешения.Вставить("Наименование", 
		"Обратитесь к администратору 1С и пройдите диагностику. " + 
		"Если КриптоПро установлен на сервере, то диагностику необходимо запустить тоже на сервере.");
	ВариантыРешения.Добавить(ВариантРешения);	
	
	ВариантРешения = Новый Структура;
	ФорматированнаяСтрока = Новый Массив;
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("Выполните рекомендации от "));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("диагностики",,,, "https://help.kontur.ru/diadoc"));
	ФорматированнаяСтрока.Добавить(Новый ФорматированнаяСтрока("."));		
	ВариантРешения.Вставить("Наименование", ФорматированнаяСтрока);
	ВариантыРешения.Добавить(ВариантРешения);
	
	ВариантРешения = Новый Структура;
	ВариантРешения.Вставить("Наименование", "Если ошибка сохранилась, то обратитесь в техподдержку и назовите номер диагностики.");
	ВариантыРешения.Добавить(ВариантРешения);
		
	СоставОшибки = Новый Структура;
	СоставОшибки.Вставить("ПредставлениеТипаОшибки", "Прочая ошибка подписания");
	СоставОшибки.Вставить("ВариантыРешения", ВариантыРешения);
	
	ТипыОшибок.Вставить("ПрочаяОшибкаКриптографии", СоставОшибки);
	
	Возврат ТипыОшибок;
	
КонецФункции

Функция ПолучитьОшибку(ТипОшибки, ТипыОшибок) Экспорт
	
	Если ТипыОшибок.Свойство(ТипОшибки) Тогда
		Возврат ТипыОшибок[ТипОшибки];	
	Иначе
		Сообщить("Неизвестный тип ошибки"); 
	КонецЕсли
	
КонецФункции

#КонецОбласти
