#Область ПрограммныйИнтерфейс

// Проверяет наличие новой версии, и если она есть, то обновляет установленное расширение
//
// Параметры:
//  ВыполняемаяКоманда - ОписаниеОповещения - описание метода, который должен быть вызван после проверки новой версии
//  ПараметрыКоманды - Структура - данные, необходимые для выполнения метода из оповещения
//
Процедура ОбновитьРасширениеКонтурДиадок(ВыполняемаяКоманда, ПараметрыКоманды) Экспорт
	
	КонтурДиадокКлиент.ПрочитатьКонфигурационныйФайл();
	
	РасширениеОбновлено = КонтурДиадокОбновлениеВызовСервера.ОбновитьРасширениеКонтурДиадок();
	
	Если РасширениеОбновлено Тогда
		
		УведомитьПользователяОбУспешномОбновленииРасширения(ВыполняемаяКоманда, ПараметрыКоманды);
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ВыполняемаяКоманда, ПараметрыКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УведомитьПользователяОбУспешномОбновленииРасширения(ВыполняемаяКоманда, ПараметрыКоманды)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыполняемаяКоманда", ВыполняемаяКоманда);
	ДополнительныеПараметры.Вставить("ПараметрыКоманды", ПараметрыКоманды);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
			"СлужебныйОбработчик_ОбработатьДействиеПользователяПослеОбновления",
			ЭтотОбъект,
			ДополнительныеПараметры
	);
	
	ЗаголовокВопроса = "Обновление модуля";
	ТекстСообщения = "Модуль автоматически обновлен до актуальной версии.
		|Для работы в новой версии модуля перезапустите программу.";
	
	КнопкаПоУмолчанию = КодВозвратаДиалога.ОК;
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Продолжить работу");
	Кнопки.Добавить(КнопкаПоУмолчанию, "Перезапустить");
	
	КонтурДиадокСтдДиалогиКлиент.ПоказатьВопросЛок(
		ОписаниеОповещения,
		ТекстСообщения,
		Кнопки, ,
		КнопкаПоУмолчанию,
		ЗаголовокВопроса
	);
	
КонецПроцедуры

Процедура СлужебныйОбработчик_ОбработатьДействиеПользователяПослеОбновления(
	Результат,
	ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ЗавершитьРаботуСистемы(Ложь, Истина);
	Иначе
		
		ВыполняемаяКоманда = ДополнительныеПараметры.ВыполняемаяКоманда;
		ПараметрыКоманды = ДополнительныеПараметры.ПараметрыКоманды;
		
		ВыполнитьОбработкуОповещения(ВыполняемаяКоманда, ПараметрыКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти