#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заказы") Тогда
		
		ЗаполнитьТоварыПоЗаказам(Параметры.Заказы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовИКоманды

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	ОтметитьИспользование(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	ОтметитьИспользование(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКонтрагентПриИзменении(Элемент)
	
	ТекущаяСтрока = Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Поставщик", ТекущаяСтрока.Поставщик));
	Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
		Если НЕ ЗначениеЗаполнено(стрНайденныеСтроки.Контрагент) Тогда
			стрНайденныеСтроки.Контрагент = ТекущаяСтрока.Контрагент;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаказыНаСервере()
	
	ТЗПоставщики = Товары.Выгрузить(, "Поставщик,Контрагент");
	ТЗПоставщики.Свернуть("Поставщик,Контрагент");
	
	Для каждого стрПоставщик Из ТЗПоставщики Цикл
		
		СтрокиТовары = Товары.НайтиСтроки(Новый Структура("Поставщик,Контрагент,Использовать", стрПоставщик.Поставщик, стрПоставщик.Контрагент, Истина));
		
		Если СтрокиТовары.Количество() >0 Тогда
			
			ЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент();
			ЗаказПоставщику.Дата = ТекущаяДата();
			ЗаказПоставщику.Организация = Организация;
			ЗаказПоставщику.Склад = Склад;
			ЗаказПоставщику.ДокументОснование = СтрокиТовары[0].ЗаказнаСборку;
			ЗаказПоставщику.Партнер = стрПоставщик.Поставщик;
			ЗаказПоставщику.Контрагент = стрПоставщик.Контрагент;
			ЗаказПоставщику.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
			ЗаказПоставщику.Менеджер = Пользователи.АвторизованныйПользователь();
			ЗаказПоставщику.Автор = Пользователи.АвторизованныйПользователь();
			ЗаказПоставщику.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
			ЗаказПоставщику.ЖелаемаяДатаПоступления = ЗаказПоставщику.Дата + 86400 * 10;
			ЗаказПоставщику.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			ЗаказПоставщику.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			ЗаказПоставщику.Подразделение = ЗаказПоставщику.Автор.Подразделение;
			ЗаказПоставщику.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
			ЗаказПоставщику.Согласован = Истина;
			ЗаказПоставщику.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада;
			ЗаказПоставщику.Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден;
			ЗаказПоставщику.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
			ЗаказПоставщику.ЦенаВключаетНДС = Истина;
			
			Для каждого стрТовары Из СтрокиТовары Цикл
				
				НоваяСтрока = ЗаказПоставщику.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрТовары);
				НоваяСтрока.КодСтроки = НоваяСтрока.НомерСтроки;
				НоваяСтрока.СтавкаНДС = НоваяСтрока.Номенклатура.СтавкаНДС;
				НоваяСтрока.Склад = Склад;
				
				Если стрТовары.ЗаказНаСборку <> ЗаказПоставщику.ДокументОснование Тогда
					НоваяСтрока.АУ_ЗаказНаСборку = стрТовары.ЗаказНаСборку;
				КонецЕсли;
				
			КонецЦикла;
			
			ЗаказПоставщику.Записать(РежимЗаписиДокумента.Запись);
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан документ %1", ЗаказПоставщику.Ссылка), ЗаказПоставщику.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Использовать", Истина));
	Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
		Товары.Удалить(стрНайденныеСтроки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаказы(Команда)
	
	СформироватьЗаказыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ЗаполнитьТоварыПоЗаказам(Заказы)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаСборкуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказНаСборкуТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказНаСборкуТовары.Обособленно
	|			ТОГДА ЗаказНаСборкуТовары.Ссылка.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	|	СУММА(ЗаказНаСборкуТовары.Количество) КАК Количество,
	|	СУММА(ЗаказНаСборкуТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	ЗаказНаСборкуТовары.АУ_Поставщик КАК Поставщик,
	|	ЗаказНаСборкуТовары.Ссылка КАК ЗаказНаСборку,
	|	ЗаказНаСборкуТовары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТЗаказы
	|ИЗ
	|	Документ.ЗаказНаСборку.Товары КАК ЗаказНаСборкуТовары
	|ГДЕ
	|	ЗаказНаСборкуТовары.Ссылка В(&Заказы)
	|	И ЗаказНаСборкуТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаСборкуТовары.Характеристика,
	|	ЗаказНаСборкуТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЗаказНаСборкуТовары.Обособленно
	|			ТОГДА ЗаказНаСборкуТовары.Ссылка.Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЗаказНаСборкуТовары.АУ_Поставщик,
	|	ЗаказНаСборкуТовары.Ссылка,
	|	ЗаказНаСборкуТовары.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	|	СУММА(ЗаказПоставщикуТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество,
	|	ЗаказПоставщикуТовары.Назначение КАК Назначение,
	|	ЗаказПоставщикуТовары.Ссылка.Партнер КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.АУ_ЗаказНаСборку = ЗНАЧЕНИЕ(Документ.ЗаказНаСборку.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Ссылка.ДокументОснование
	|		ИНАЧЕ ЗаказПоставщикуТовары.АУ_ЗаказНаСборку
	|	КОНЕЦ КАК ЗаказнаСборку
	|ПОМЕСТИТЬ ВТЗаказано
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	(ЗаказПоставщикуТовары.Ссылка.ДокументОснование В (&Заказы)
	|			ИЛИ ЗаказПоставщикуТовары.АУ_ЗаказНаСборку В (&Заказы))
	|	И ЗаказПоставщикуТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Ссылка.Партнер,
	|	ЗаказПоставщикуТовары.Назначение,
	|	ЗаказПоставщикуТовары.Характеристика,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.АУ_ЗаказНаСборку = ЗНАЧЕНИЕ(Документ.ЗаказНаСборку.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Ссылка.ДокументОснование
	|		ИНАЧЕ ЗаказПоставщикуТовары.АУ_ЗаказНаСборку
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаказы.Номенклатура КАК Номенклатура,
	|	ВТЗаказы.Характеристика КАК Характеристика,
	|	ВТЗаказы.Назначение КАК Назначение,
	|	ВТЗаказы.Поставщик КАК Поставщик,
	|	СУММА(ВТЗаказы.Количество - ЕСТЬNULL(ВТЗаказано.Количество, 0)) КАК Количество,
	|	СУММА(ВТЗаказы.КоличествоУпаковок - ЕСТЬNULL(ВТЗаказано.КоличествоУпаковок, 0)) КАК КоличествоУпаковок,
	|	ВТЗаказы.ЗаказНаСборку КАК ЗаказНаСборку,
	|	ВТЗаказы.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТЗаказы КАК ВТЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказано КАК ВТЗаказано
	|		ПО ВТЗаказы.Номенклатура = ВТЗаказано.Номенклатура
	|			И ВТЗаказы.Характеристика = ВТЗаказано.Характеристика
	|			И ВТЗаказы.Назначение = ВТЗаказано.Назначение
	|			И ВТЗаказы.Поставщик = ВТЗаказано.Поставщик
	|			И ВТЗаказы.ЗаказНаСборку = ВТЗаказано.ЗаказнаСборку
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗаказы.Характеристика,
	|	ВТЗаказы.Номенклатура,
	|	ВТЗаказы.Поставщик,
	|	ВТЗаказы.Назначение,
	|	ВТЗаказы.ЗаказНаСборку,
	|	ВТЗаказы.НомерСтроки
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТЗаказы.Количество - ЕСТЬNULL(ВТЗаказано.Количество, 0)) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказНаСборку,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Заказы", Заказы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
	Если Заказы.Количество() > 0 Тогда
		
		Организация = Заказы[0].Организация;
		Склад = Заказы[0].Склад;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьИспользование(Отметка)
	
	Для каждого стрТовары Из Товары Цикл
		стрТовары.Использовать = Отметка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти