#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	
	АдресНастройки = ДанныеНастройкиЗаполненияДополнительныхПолей();
	ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(
		СтрШаблон(НСтр("ru = 'Доп. поля %1 %2.json'"), Запись.ВидЭлектронногоДокумента, Запись.Формат));
	ФайловаяСистемаКлиент.СохранитьФайл(Неопределено, АдресНастройки, ИмяФайла);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДанныеНастройкиЗаполненияДополнительныхПолей()
	
	МенеджерЗаписи = РегистрыСведений.НастройкиЗаполненияДополнительныхПолей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Отправитель = Запись.Отправитель;
	МенеджерЗаписи.Получатель = Запись.Получатель;
	МенеджерЗаписи.Договор = Запись.Договор;
	МенеджерЗаписи.ВидЭлектронногоДокумента = Запись.ВидЭлектронногоДокумента;
	МенеджерЗаписи.Формат = Запись.Формат;
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Настройка = МенеджерЗаписи.Настройка.Получить();
	
	НастройкиЗаполненияПолей = ОбщегоНазначения.JSONВЗначение(Настройка,, Ложь);
	
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("Формат", МенеджерЗаписи.Формат);
	ПараметрыНастройки.Вставить("Поля", НастройкиЗаполненияПолей);
	
	Возврат ПоместитьВоВременноеХранилище(ОбщегоНазначения.ЗначениеВJSON(ПараметрыНастройки),
		УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
