#Область ПрограммныйИнтерфейс

// Выполнить HTTPЗапрос.
// 
// Параметры:
//  ПараметрыHTTPЗапроса - Структура: см. КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьСтруктуруПараметровHTTPЗапроса
// 
// Возвращаемое значение:
//  Структура: см. КонтурЗакупки_СтруктурыКлиентСервер.ИнициализироватьРезультатФункции
Функция ВыполнитьHTTPЗапрос(ПараметрыHTTPЗапроса) Экспорт
	СинхронизацияНаКлиенте = КонтурЗакупки_ПодсистемаНастройкиВызовСервера.ПолучитьЗначениеНастройки("КонтурПодсистема",
		"СинхронизацияНаКлиенте", Ложь);

#Если Клиент Тогда
	Если СинхронизацияНаКлиенте Тогда
		РезультатФункции = КонтурЗакупки_httpКлиент.ВыполнитьHTTPЗапрос(ПараметрыHTTPЗапроса);
	Иначе
		РезультатФункции = КонтурЗакупки_httpВызовСервера.ВыполнитьHTTPЗапрос(ПараметрыHTTPЗапроса);
	КонецЕсли;
#Иначе
		РезультатФункции = КонтурЗакупки_httpВызовСервера.ВыполнитьHTTPЗапрос(ПараметрыHTTPЗапроса);
#КонецЕсли

	Возврат РезультатФункции;

КонецФункции

// Выполнить HTTPЗапрос с метрикой.
// 
// Параметры:
//  ПараметрыHTTPЗапроса - Структура: см. КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьСтруктуруПараметровHTTPЗапроса
//  СтруктураДействия - Структура: см. КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьОписаниеДействия
// 
// Возвращаемое значение:
//  Структура: см. КонтурЗакупки_СтруктурыКлиентСервер.ИнициализироватьРезультатФункции
Функция ВыполнитьHTTPЗапросСМетрикой(ПараметрыHTTPЗапроса, СтруктураДействия) Экспорт

	СинхронизацияНаКлиенте = КонтурЗакупки_ПодсистемаНастройкиВызовСервера.ПолучитьЗначениеНастройки("КонтурПодсистема",
		"СинхронизацияНаКлиенте", Ложь);
	СтруктураКлиентаДляМетрики = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьСтруктуруКлиентаДляМетрики();

#Если Клиент Тогда
	Если СинхронизацияНаКлиенте Тогда
		РезультатФункции = КонтурЗакупки_httpКлиент.ВыполнитьHTTPЗапросСМетрикой(ПараметрыHTTPЗапроса,
			СтруктураДействия, СтруктураКлиентаДляМетрики, Истина);
	Иначе
		РезультатФункции = КонтурЗакупки_httpВызовСервера.ВыполнитьHTTPЗапросСМетрикой(ПараметрыHTTPЗапроса,
			СтруктураДействия, СтруктураКлиентаДляМетрики, Ложь);
	КонецЕсли;
#Иначе
		РезультатФункции = КонтурЗакупки_httpВызовСервера.ВыполнитьHTTPЗапросСМетрикой(ПараметрыHTTPЗапроса,
			СтруктураДействия, СтруктураКлиентаДляМетрики, Ложь);
#КонецЕсли
	Возврат РезультатФункции;

КонецФункции
#КонецОбласти