// @strict-types

#Область ПрограммныйИнтерфейс

// Настройки проверки использования реквизитов доставки.
// Пустое имя поля означает, что в объекта не используется.
//
// Возвращаемое значение:
//  Структура:
// * ДокументОбъект - ДокументОбъект, Неопределено - проверяемый объект доставки (обязательно к заполнению)
// * СкладыДоставки - Массив из СправочникСсылка.Склады - склады, которые используются для оформления доставки
// * ВладелецТочекДоставки - СправочникСсылка.Партнеры, СправочникСсылка.Склады, Неопределено - владелец точек доставки документа
// * ТребуетсяДоставка - Булево - требуется в целом перевозка
// * ВидПланированияДоставкиИмяПоля - Строка - имя поля с адресом доставки, если не задано должно быть указано значение в ВидПланированияДоставкиБезусловный
// * ВидПланированияДоставкиБезусловный - ПеречислениеСсылка.ВидыПланированияДоставки  - значение (обязательное), если не задано ВидПланированияДоставкиИмяПоля
// * СпособУказанияДоставкиИмяПоля - Строка - имя поля способа указания доставки, если не задано должно быть указано значение в СпособУказанияДоставкиБезусловный
// * СпособУказанияДоставкиБезусловный - ПеречислениеСсылка.СпособыУказанияДоставки - значение (обязательное), если не задано СпособУказанияДоставкиИмяПоля
// * СпособДоставкиИмяПоля - Строка - имя поля способа доставки, если не задано должно быть указано значение в СпособУказанияДоставкиБезусловный
// * СпособДоставкиБезусловный - ПеречислениеСсылка.СпособыДоставки25 - значение, если не задано СпособДоставкиИмяПоля
// * ВремяДоставкиСИмяПоля - Строка - имя поля времени доставки с
// * ВремяДоставкиПоИмяПоля - Строка - имя поля времени доставки по
// * ТочкаДоставкиИмяПоля - Строка - имя поля точки доставки 
// * ЗонаДоставкиИмяПоля - Строка  - имя поля зоны доставки
// * ПеревозчикИмяПоля - Строка - имя поля перевозчика
// * ДоставкаДоПеревозчикаИмяПоля - Строка - имя поля доставки до перевозчика, если не задано должно быть указано значение в ДоставкаДоПеревозчикаБезусловный
// * ДоставкаДоПеревозчикаБезусловный - Булево - значение, если не задано ДоставкаДоПеревозчикаИмяПоля
// * ТочкаДоставкиПеревозчикаИмяПоля - Строка - имя поля точки доставки до перевозчика
// * ЗонаДоставкиПеревозчикаИмяПоля - Строка - имя поля зоны доставки перевозчика
// * АдресДоставкиИмяПоля - Строка - имя поля с адресом доставки
// * ДополнительнаяИнформацияПоДоставкеИмяПоля - Строка - Имя поля дополнительной информации к перевозке, может быть пустым
// * ОсобыеУсловияПеревозкиИмяПоля - Строка - Имя поля признака особых условий перевозки
// * ОсобыеУсловияПеревозкиОписаниеИмяПоля - Строка - Имя поля описания особых условий перевозки
// * ТоварыКДоставкеИмяТаблицы - Строка - имя табличной части товаров к доставке
// * ТаблицаТоваровДоставки - см. НоваяТаблицаТоваровДоставки
// * НакладнаяПоЗаказам - Булево - Применяется для доставки 2.0
//
Функция НовыеНастройкиПроверкиИспользованияРеквизитовДоставки() Экспорт
	
	НовыеНастройки = Новый Структура;
	
	НовыеНастройки.Вставить("ДокументОбъект", Неопределено);
	НовыеНастройки.Вставить("СкладыДоставки", Новый Массив);
	НовыеНастройки.Вставить("ВладелецТочекДоставки", Неопределено);
	
	НовыеНастройки.Вставить("ТребуетсяДоставка", Ложь);
	
	НовыеНастройки.Вставить("ВидПланированияДоставкиИмяПоля", "ВидПланированияДоставки");
	НовыеНастройки.Вставить("ВидПланированияДоставкиБезусловный", Перечисления.ВидыПланированияДоставки.ПустаяСсылка());
	НовыеНастройки.Вставить("СпособУказанияДоставкиИмяПоля", "СпособУказанияДоставки");
	НовыеНастройки.Вставить("СпособУказанияДоставкиБезусловный", Перечисления.СпособыУказанияДоставки.ПустаяСсылка());
	НовыеНастройки.Вставить("СпособДоставкиИмяПоля", "СпособДоставки25");
	НовыеНастройки.Вставить("СпособДоставкиБезусловный", Перечисления.СпособыДоставки25.ПустаяСсылка());
	
	НовыеНастройки.Вставить("ВремяДоставкиСИмяПоля", "ВремяДоставкиС");
	НовыеНастройки.Вставить("ВремяДоставкиПоИмяПоля", "ВремяДоставкиПо");
	
	НовыеНастройки.Вставить("ТочкаДоставкиИмяПоля", "ТочкаДоставки");
	НовыеНастройки.Вставить("ЗонаДоставкиИмяПоля", "ЗонаДоставки");
	
	НовыеНастройки.Вставить("ПеревозчикИмяПоля", "ПеревозчикПартнер");
	НовыеНастройки.Вставить("ДоставкаДоПеревозчикаИмяПоля", "ДоставкаДоПеревозчика");
	НовыеНастройки.Вставить("ДоставкаДоПеревозчикаБезусловный", Ложь);
	НовыеНастройки.Вставить("ТочкаДоставкиПеревозчикаИмяПоля", "ТочкаДоставкиПеревозчика");
	НовыеНастройки.Вставить("ЗонаДоставкиПеревозчикаИмяПоля", "ЗонаДоставкиПеревозчика");
	
	НовыеНастройки.Вставить("АдресДоставкиИмяПоля", "АдресДоставки");
	НовыеНастройки.Вставить("ДополнительнаяИнформацияПоДоставкеИмяПоля", "ДополнительнаяИнформацияПоДоставке");
	НовыеНастройки.Вставить("ОсобыеУсловияПеревозкиИмяПоля", "ОсобыеУсловияПеревозки");
	НовыеНастройки.Вставить("ОсобыеУсловияПеревозкиОписаниеИмяПоля", "ОсобыеУсловияПеревозкиОписание");
	
	НовыеНастройки.Вставить("ТоварыКДоставкеИмяТаблицы", "ТоварыКДоставке");
	НовыеНастройки.Вставить("ТаблицаТоваровДоставки", НоваяТаблицаТоваровДоставки());
	
	// Данные для доставки 2.0
	НовыеНастройки.Вставить("НакладнаяПоЗаказам", Ложь);
	
	Возврат НовыеНастройки;
	
КонецФункции

// Выполняет проверку корректности заполнения данных доставки по переданным настройкам
//
// Параметры:
//  Настройки - см. НовыеНастройкиПроверкиИспользованияРеквизитовДоставки
//  МассивНепроверяемыхРеквизитов - Массив из Строка - Массив имен непроверяемых реквизитов для дозаполнения
//  Отказ - Булево - 
//
Процедура ПроверитьЗаполнениеДанныхДоставки(Настройки, МассивНепроверяемыхРеквизитов, Отказ) Экспорт
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() Тогда
		Возврат;
	КонецЕсли;
	
	// Для совместимости с Доставка 2.0 требуется сохранить платформенную проверку,
	// а для Доставки 2.5 используется другой алгоритм
	МассивНепроверяемыхРеквизитов.Добавить(Настройки.ПеревозчикИмяПоля);
	МассивНепроверяемыхРеквизитов.Добавить(Настройки.ОсобыеУсловияПеревозкиОписаниеИмяПоля);
	
	Если Не ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка() Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить(Настройки.АдресДоставкиИмяПоля);
		Возврат;
		
	КонецЕсли;
	
	Объект = Настройки.ДокументОбъект; // ДокументОбъект
	
	Если Настройки.ТребуетсяДоставка Тогда
		
		Если ПустаяСтрока(Настройки.ВидПланированияДоставкиИмяПоля) Тогда
			ВидПланированияДоставки = Настройки.ВидПланированияДоставкиБезусловный;
		Иначе
			ВидПланированияДоставки = Объект[Настройки.ВидПланированияДоставкиИмяПоля]; // ПеречислениеСсылка.ВидыПланированияДоставки
		КонецЕсли;
		
		Если ПустаяСтрока(Настройки.СпособУказанияДоставкиИмяПоля) Тогда
			СпособУказанияДоставки = Настройки.СпособУказанияДоставкиБезусловный;
		Иначе
			СпособУказанияДоставки = Объект[Настройки.СпособУказанияДоставкиИмяПоля]; // ПеречислениеСсылка.СпособыУказанияДоставки
		КонецЕсли;
		
		Если СпособУказанияДоставки = Перечисления.СпособыУказанияДоставки.НаВесьДокумент Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить(Настройки.АдресДоставкиИмяПоля);
			
		КонецЕсли;
		
		Если СпособУказанияДоставки = Перечисления.СпособыУказанияДоставки.НаВесьДокумент Тогда
			
			Если ПустаяСтрока(Настройки.СпособДоставкиИмяПоля) Тогда
				СпособДоставки = Настройки.СпособДоставкиБезусловный;
			Иначе
				СпособДоставки = Объект[Настройки.СпособДоставкиИмяПоля]; // ПеречислениеСсылка.СпособыДоставки25
			КонецЕсли;
			
			Если СпособДоставки.Пустая() Тогда
				
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Способ доставки'"));
				ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					Объект,
					"ТребуетсяДоставка",
					,
					Отказ);
				
				КонецЕсли;
				
		КонецЕсли;
		
		Если ВидПланированияДоставки = Перечисления.ВидыПланированияДоставки.ОтдельнымДокументом Тогда
			
			ПроверитьОбновитьДанныеТочкиЗоныДоставки(СпособУказанияДоставки, Настройки, Ложь, Истина, Истина, Отказ);
			ОтключитьПроверкуЗаполненияОбязательныхПолейДанныхДоставки(МассивНепроверяемыхРеквизитов, Настройки);
			
		Иначе
			
			ПроверитьОбновитьДанныеПолейДоставки(Настройки, Отказ, Истина);
			
		КонецЕсли;
		
		// Прочие сведения проверяются всегда, независимо от вида планирования доставки
		ПроверитьОбновитьСведенияДанныхДоставкиПоСкладам(Настройки, Отказ);
		ПроверитьПересечениеКлиентаИПеревозчика(Настройки, СпособУказанияДоставки, Отказ);
		
	Иначе
		
		ОтключитьПроверкуЗаполненияОбязательныхПолейДанныхДоставки(МассивНепроверяемыхРеквизитов, Настройки);
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет проверку корректности заполнения данных доставки по переданным настройкам
//
// Параметры:
//  Настройки - см. НовыеНастройкиПроверкиИспользованияРеквизитовДоставки
//  Отказ - Булево - 
//
Процедура ОчиститьНеиспользуемыеПоляДоставки(Настройки, Отказ) Экспорт
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() Тогда
		Возврат;
	КонецЕсли;
	
	СкладыСведенияДоставкиИмяТаблицы = "СкладыСведенияДоставки";
	
	Объект = Настройки.ДокументОбъект; // ДокументОбъект
	
	Если Настройки.ТребуетсяДоставка Тогда
		
		Если ПустаяСтрока(Настройки.СпособУказанияДоставкиИмяПоля) Тогда
			СпособУказанияДоставки = Настройки.СпособУказанияДоставкиБезусловный;
		Иначе
			СпособУказанияДоставки = Объект[Настройки.СпособУказанияДоставкиИмяПоля]; // ПеречислениеСсылка.СпособыУказанияДоставки
		КонецЕсли;
		
		Если ПустаяСтрока(Настройки.СпособДоставкиИмяПоля) Тогда
			СпособДоставки = Настройки.СпособДоставкиБезусловный;
		Иначе
			СпособДоставки = Объект[Настройки.СпособДоставкиИмяПоля]; // ПеречислениеСсылка.СпособыДоставки25
		КонецЕсли;
		
		#Область Перевозчик
		Если ПустаяСтрока(Настройки.ДоставкаДоПеревозчикаИмяПоля) Тогда
			ДоставкаДоПеревозчика = Настройки.ДоставкаДоПеревозчикаБезусловный;
		Иначе
			ДоставкаДоПеревозчика = Объект[Настройки.ДоставкаДоПеревозчикаИмяПоля]; // Булево
		КонецЕсли;
		
		Если (СпособДоставки = Перечисления.СпособыДоставки25.НашимиСилами
				И НЕ ДоставкаДоПеревозчика)
			ИЛИ СпособДоставки = Перечисления.СпособыДоставки25.НашКурьер
			ИЛИ СпособДоставки = Перечисления.СпособыДоставки25.Самовывоз
			ИЛИ СпособДоставки = Перечисления.СпособыДоставки25.ОпределяетСлужбаДоставки
			ИЛИ СпособУказанияДоставки = Перечисления.СпособыУказанияДоставки.ПоСтрокам Тогда
			
			Если НЕ ПустаяСтрока(Настройки.ПеревозчикИмяПоля) Тогда
				Объект[Настройки.ПеревозчикИмяПоля] = Справочники.Партнеры.ПустаяСсылка();
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(Настройки.ТочкаДоставкиПеревозчикаИмяПоля) Тогда
				Объект[Настройки.ТочкаДоставкиПеревозчикаИмяПоля] = Справочники.ТочкиДоставки.ПустаяСсылка();
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(Настройки.ЗонаДоставкиПеревозчикаИмяПоля) Тогда
				Объект[Настройки.ЗонаДоставкиПеревозчикаИмяПоля] = Справочники.ЗоныДоставки.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		#КонецОбласти
		
		Если НЕ ПустаяСтрока(Настройки.ОсобыеУсловияПеревозкиИмяПоля)
			И НЕ Объект[Настройки.ОсобыеУсловияПеревозкиИмяПоля] Тогда
			
			Если НЕ ПустаяСтрока(Настройки.ОсобыеУсловияПеревозкиОписаниеИмяПоля) Тогда
				Объект[Настройки.ОсобыеУсловияПеревозкиОписаниеИмяПоля] = "";
			КонецЕсли;
			
		КонецЕсли;
		
		Если СпособУказанияДоставки = Перечисления.СпособыУказанияДоставки.НаВесьДокумент
			И НЕ ПустаяСтрока(Настройки.ТоварыКДоставкеИмяТаблицы) Тогда
			
			// Данные внутри таблицы обрабатываются в рамках метода проверки/обновления полей
			ТаблицаТоварыКДоставке = Объект[Настройки.ТоварыКДоставкеИмяТаблицы]; // ТабличнаяЧасть
			ТаблицаТоварыКДоставке.Очистить();
			
		КонецЕсли;
		
	Иначе
		
		Если НЕ ПустаяСтрока(Настройки.ВидПланированияДоставкиИмяПоля) Тогда
			Объект[Настройки.ВидПланированияДоставкиИмяПоля] = Перечисления.ВидыПланированияДоставки.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Настройки.СпособУказанияДоставкиИмяПоля) Тогда
			Объект[Настройки.СпособУказанияДоставкиИмяПоля] = Перечисления.СпособыУказанияДоставки.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Настройки.СпособДоставкиИмяПоля) Тогда
			Объект[Настройки.СпособДоставкиИмяПоля] = Перечисления.СпособыДоставки25.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Настройки.ВремяДоставкиСИмяПоля) Тогда
			Объект[Настройки.ВремяДоставкиСИмяПоля] = Дата(1, 1, 1, 0, 0, 0);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Настройки.ВремяДоставкиПоИмяПоля) Тогда
			Объект[Настройки.ВремяДоставкиПоИмяПоля] = Дата(1, 1, 1, 0, 0, 0);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Настройки.ТочкаДоставкиИмяПоля) Тогда
			Объект[Настройки.ТочкаДоставкиИмяПоля] = Справочники.ТочкиДоставки.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Настройки.ЗонаДоставкиИмяПоля) Тогда
			Объект[Настройки.ЗонаДоставкиИмяПоля] = Справочники.ЗоныДоставки.ПустаяСсылка();
		КонецЕсли;
		
		#Область Перевозчик
		Если НЕ ПустаяСтрока(Настройки.ПеревозчикИмяПоля) Тогда
			Объект[Настройки.ПеревозчикИмяПоля] = Справочники.Партнеры.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Настройки.ДоставкаДоПеревозчикаИмяПоля) Тогда
			Объект[Настройки.ДоставкаДоПеревозчикаИмяПоля] = Ложь;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Настройки.ТочкаДоставкиПеревозчикаИмяПоля) Тогда
			Объект[Настройки.ТочкаДоставкиПеревозчикаИмяПоля] = Справочники.ТочкиДоставки.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Настройки.ЗонаДоставкиПеревозчикаИмяПоля) Тогда
			Объект[Настройки.ЗонаДоставкиПеревозчикаИмяПоля] = Справочники.ЗоныДоставки.ПустаяСсылка();
		КонецЕсли;
		#КонецОбласти
		
		Если НЕ ПустаяСтрока(Настройки.ДополнительнаяИнформацияПоДоставкеИмяПоля) Тогда
			Объект[Настройки.ДополнительнаяИнформацияПоДоставкеИмяПоля] = "";
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Настройки.ОсобыеУсловияПеревозкиИмяПоля) Тогда
			Объект[Настройки.ОсобыеУсловияПеревозкиИмяПоля] = Ложь;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Настройки.ОсобыеУсловияПеревозкиОписаниеИмяПоля) Тогда
			Объект[Настройки.ОсобыеУсловияПеревозкиОписаниеИмяПоля] = "";
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Настройки.ТоварыКДоставкеИмяТаблицы) Тогда
			
			ТаблицаТоварыКДоставке = Объект[Настройки.ТоварыКДоставкеИмяТаблицы]; // ТабличнаяЧасть
			ТаблицаТоварыКДоставке.Очистить();
			
		КонецЕсли;
		
		ТаблицаСкладыСведенияДоставки = Объект[СкладыСведенияДоставкиИмяТаблицы]; // ТабличнаяЧасть
		ТаблицаСкладыСведенияДоставки.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет обновление сведений точек доставки (если не заполнены их данные)
//
// Параметры:
//  Настройки - см. НовыеНастройкиПроверкиИспользованияРеквизитовДоставки
//  ВыводитьОшибки - Булево
//  Отказ - Булево - 
//
Процедура ОбновитьДанныеПолейДоставки(Настройки, ВыводитьОшибки, Отказ) Экспорт
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() 
		ИЛИ НЕ Настройки.ТребуетсяДоставка Тогда
		
		ОчиститьНеиспользуемыеПоляДоставки(Настройки, Отказ);
		Возврат;
		
	КонецЕсли;
	
	ПроверитьОбновитьДанныеПолейДоставки(Настройки, Отказ, ВыводитьОшибки, Истина);
	
КонецПроцедуры

// Выполняет обновление сведений складов доставки (если не заполнены склады и их данные)
//
// Параметры:
//  Настройки - см. НовыеНастройкиПроверкиИспользованияРеквизитовДоставки
//  ВыводитьОшибки - Булево
//  Отказ - Булево - 
//
Процедура ОбновитьСведенияСкладовДоставки(Настройки, ВыводитьОшибки, Отказ) Экспорт
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() 
		ИЛИ НЕ Настройки.ТребуетсяДоставка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПроверитьОбновитьСведенияДанныхДоставкиПоСкладам(Настройки, Отказ, Истина, ВыводитьОшибки);
	
КонецПроцедуры

// Проверяет, что для переданной складской операции предусмотрена доставка.
//
// Параметры:
//  СкладскаяОперация - ПеречислениеСсылка.СкладскиеОперации - складская операция.
// 
// Возвращаемое значение:
//  Булево - Истина - предусмотрена доставка для переданной складской операции.
//
Функция ЕстьДоставкаПоСкладскойОперации(СкладскаяОперация) Экспорт
	
	ТекстЗапроса = СкладыСервер.ТекстЗапросаСкладскаяОперацияТипДокумента() + " 
	|ВЫБРАТЬ
	|	СкладскаяОперацияТипДокумента.СкладскаяОперация
	|ИЗ
	|	СкладскаяОперацияТипДокумента КАК СкладскаяОперацияТипДокумента
	|
	|ГДЕ
	|	СкладскаяОперацияТипДокумента.СкладскаяОперация = &СкладскаяОперация
	|	И СкладскаяОперацияТипДокумента.Тип В (&ТипыРаспоряжениеНаДоставку)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СкладскаяОперация", СкладскаяОперация);
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка25() Тогда
		ТипыРаспоряжениеНаДоставку = Метаданные.ОпределяемыеТипы.РаспоряжениеНаДоставку25.Тип.Типы();
	Иначе
		ТипыРаспоряжениеНаДоставку = Метаданные.ОпределяемыеТипы.РаспоряжениеНаДоставку.Тип.Типы();
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипыРаспоряжениеНаДоставку", ТипыРаспоряжениеНаДоставку);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#Область РаботаСФормами

// Определяет заголовки элементов настройки доставки по настройкам системы
// 
// Параметры:
//  Форма - см. Справочник.Склады.Форма.ФормаЭлемента
//
Процедура УстановитьНастройкиЭлементовФормыСклада(Форма) Экспорт
	
	Если НЕ ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() Тогда
		
		ЗаголовокСборкаПланируетсяДоставкой = НСтр("ru = 'Собирать товары в порядке доставки'");
		ЗаголовокДоставкаСборкаНезависимо = НСтр("ru = 'Порядок отбора товаров не зависит от порядка доставки'");
		
		ПодсказкаСборкаПланируетсяДоставкой = НСтр("ru = 'Если распоряжением на отгрузку предусмотрена доставка, то расходные ордера можно будет создать только после включения распоряжения в задание на перевозку.'");
		ПодсказкаДоставкаСборкаНезависимо = НСтр("ru = 'Расходные ордера создаются без учета заданий на перевозку. Если распоряжение на отгрузку предусматривает доставку, то нужно будет перед отгрузкой указать в ордере задание на перевозку.'");
		
	Иначе
		
		ЗаголовокСборкаПланируетсяДоставкой = НСтр("ru = 'Сборка осуществляется после планирования доставки'");
		ЗаголовокДоставкаСборкаНезависимо = НСтр("ru = 'Доставка и сборка планируются независимо'");
		
		ПодсказкаСборкаПланируетсяДоставкой = НСтр("ru = 'Сборка осуществляется после того, как распоряжение на доставку включено в рейс, планирующийся к погрузке. Расходный ордер связан с рейсом.'");
		ПодсказкаДоставкаСборкаНезависимо = НСтр("ru = 'Расходные ордера создаются без учета рейса. Сборка и планирование доставки происходит независимо. Расходный ордер и рейс не связаны.'");
		
	КонецЕсли;
	
	Элементы.ПорядокУказанияЗаданияНаПеревозку1.СписокВыбора[0].Представление = ЗаголовокСборкаПланируетсяДоставкой;
	Элементы.ПорядокУказанияЗаданияНаПеревозку2.СписокВыбора[0].Представление = ЗаголовокДоставкаСборкаНезависимо;
	
	Элементы.ПорядокУказанияЗаданияНаПеревозку1.РасширеннаяПодсказка.Заголовок = ПодсказкаСборкаПланируетсяДоставкой;
	Элементы.ПорядокУказанияЗаданияНаПеревозку2.РасширеннаяПодсказка.Заголовок = ПодсказкаДоставкаСборкаНезависимо;
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// см. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных
//
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Справочник.ЗаказНаДоставкуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказНаДоставкуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РейсПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РейсПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТочкиДоставки.Чтение.ВнешниеПользователи
	|Справочник.ТочкиДоставки.Чтение.Склады
	|Справочник.ТочкиДоставки.Изменение.Склады
	|Справочник.ТочкиДоставки.Чтение.ГруппыПартнеров
	|Справочник.ТочкиДоставки.Изменение.ГруппыПартнеров
	|Документ.ЗаказНаДоставку.Чтение.ГруппыПартнеров
	|Документ.ЗаказНаДоставку.Чтение.Организации
	|Документ.ЗаказНаДоставку.Чтение.Склады
	|Документ.ЗаказНаДоставку.Изменение.ГруппыПартнеров
	|Документ.ЗаказНаДоставку.Изменение.Организации
	|Документ.ЗаказНаДоставку.Изменение.Склады
	|Документ.Рейс.Чтение.Организации
	|Документ.Рейс.Чтение.Склады
	|Документ.Рейс.Изменение.Организации
	|Документ.Рейс.Изменение.Склады
	|РегистрНакопления.Доставка.Чтение.ГруппыПартнеров
	|РегистрНакопления.Доставка.Чтение.Организации
	|РегистрНакопления.Доставка.Чтение.Склады
	|";
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
//
// Параметры:
//  КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//  Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//  ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Набор = Элементы.Добавить();
	Набор.ИмяПредопределенногоНабора = "Документ_ЗаказНаДоставку";
	Набор.Ссылка = Новый УникальныйИдентификатор("4168361e-b247-4e96-9bad-e3396176572e");
	Набор.Используется = ПолучитьФункциональнуюОпцию("НеИспользоватьУправлениеДоставкой20");
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Набор, "Наименование",
		"ru = 'Заказ на доставку'", КодыЯзыков); // @НСтр-2
	
	Набор = Элементы.Добавить();
	Набор.ИмяПредопределенногоНабора = "Документ_Рейс";
	Набор.Ссылка = Новый УникальныйИдентификатор("d2a3c499-0913-4c02-a893-be7edb9c393f");
	Набор.Используется = ПолучитьФункциональнуюОпцию("НеИспользоватьУправлениеДоставкой20");
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Набор, "Наименование",
		"ru = 'Рейс'", КодыЯзыков); // @НСтр-2
	
КонецПроцедуры

// см. ВариантыОтчетовПереопределяемый.ОпределитьОбъектыСКомандамиОтчетов
Процедура ОпределитьОбъектыСКомандамиОтчетов(Объекты) Экспорт
	
	Объекты.Добавить(Метаданные.Документы.Рейс);
	
КонецПроцедуры

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.ТочкиДоставки, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаказНаДоставкуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РейсПрисоединенныеФайлы, Истина);
	
	Списки.Вставить(Метаданные.Документы.ЗаказНаДоставку, Истина);
	Списки.Вставить(Метаданные.Документы.Рейс, Истина);
	
	Списки.Вставить(Метаданные.РегистрыНакопления.Доставка, Истина);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
Процедура ДополнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	ДобавитьПрофильМенеджерПоДоставке(ОписанияПрофилей, ПараметрыОбновления);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Доставка20

// Процедура по переданной ссылке на заказ рассчитывает и записывает в регистр сведений состояние заказа.
//
//	Параметры:
//		РаспоряженияСсылки - Массив из ДокументСсылка -
//						   - ДокументСсылка - ссылки на документы, по которым нужно рассчитать состояние отгрузки.
//					В модуле менеджера документов должна быть определена функция ТекстЗапросаРеквизитыДоставки().
//		Отказ - Булево - признак прерывания обработки проведения
//		УдалениеПроведения - Булево - признак обработки удаления проведения.
//
Процедура ОтразитьСостояниеДоставки(РаспоряженияСсылки, Отказ = Ложь, УдалениеПроведения = Ложь) Экспорт
	
	Если Отказ
	 ИЛИ НЕ ЗначениеЗаполнено(РаспоряженияСсылки)
	 ИЛИ НЕ ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(РаспоряженияСсылки) <> Тип("Массив") Тогда
		
		МассивСсылок = Новый Массив; // Массив из ДокументСсылка, СправочникСсылка
		МассивСсылок.Добавить(РаспоряженияСсылки);
		
		МассивДоговоровРаспоряжений = Новый Массив; // Массив из СправочникСсылка.ДоговорыКонтрагентов
		
		ДоговорРаспоряжение = ПолучитьДоговорРаспоряжение(РаспоряженияСсылки);
		
		Если ДоговорРаспоряжение <> Неопределено Тогда
			
			Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РаспоряженияСсылки, "Договор"); // СправочникСсылка.ДоговорыКонтрагентов
			
			МассивСсылок.Добавить(Договор);
			МассивДоговоровРаспоряжений.Добавить(Договор);
			
		КонецЕсли;
		
	Иначе
		
		МассивСсылок = РаспоряженияСсылки;
		МассивДоговоровРаспоряжений = Новый Массив;
		
		ДоговорРаспоряжение = ПолучитьДоговорРаспоряжение(РаспоряженияСсылки);
		
		Если ДоговорРаспоряжение <> Неопределено Тогда
			
			Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РаспоряженияСсылки, "Договор"); // СправочникСсылка.ДоговорыКонтрагентов
			
			МассивСсылок.Добавить(Договор);
			МассивДоговоровРаспоряжений.Добавить(Договор);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если УдалениеПроведения Тогда
		Для Каждого Ссылка Из МассивСсылок Цикл
			Набор = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьНаборЗаписей();
			Набор.Отбор.Распоряжение.Установить(Ссылка);
			УстановитьПривилегированныйРежим(Истина);
			Набор.Записать(Истина);
			УстановитьПривилегированныйРежим(Ложь);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками = ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками");
	
	ЭтоДоставкаНаНашСклад = ДоставкаТоваровКлиентСервер.ЭтоРаспоряжениеНаДоставкуНаНашСклад(МассивСсылок[0]);
	
	ТаблицаРаспоряжений = Новый ТаблицаЗначений;
	ТаблицаРаспоряжений.Колонки.Добавить("Ссылка", Метаданные.ОпределяемыеТипы.РаспоряжениеНаДоставку.Тип);
	СоответствиеТипов = Новый Соответствие;
	ТекстЗапроса = "";
	Для Каждого Ссылка Из МассивСсылок Цикл
		
		Если ДоставкаТоваровКлиентСервер.ЭтоРаспоряжениеНаДоставкуНаНашСклад(Ссылка) Тогда
			
			ПараметрыПриемки = ПолучитьПараметрыПриемки(Ссылка);
			
			СпособДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СпособДоставки");
			
			ДоставкаОпределенаВДоговоре = ДоставкаОпределенаВДоговоре(Ссылка);
			
			Если ((ПараметрыПриемки.СоглашениеЯвляетсяРаспоряжением
					Или ДоставкаОпределенаВДоговоре
						И ПараметрыПриемки.ДоговорЯвляетсяРаспоряжением)
					И ПараметрыПриемки.ЭтоРаспоряжение)
				Или
					(Не ПараметрыПриемки.ЭтоДокументПоступление
					И ДоставкаТоваровКлиентСервер.ДоставкаИспользуется(СпособДоставки,
						ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками)) Тогда
				
				Набор = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьНаборЗаписей();
				Набор.Отбор.Распоряжение.Установить(Ссылка);
				Набор.Записать(Истина);
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока = ТаблицаРаспоряжений.Добавить();
		НоваяСтрока.Ссылка = Ссылка;
		
		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Продолжить; // Использование договора как распоряжения определяется в документах
		КонецЕсли;
		
		ТипСсылки = ТипЗнч(Ссылка);
		Если СоответствиеТипов[ТипСсылки] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СоответствиеТипов.Вставить(ТипСсылки,Истина);
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
		ТекстЗапросаПоДокументу = МенеджерОбъекта.ТекстЗапросаРеквизитыДоставки();
		Если ДоставкаТоваровКлиентСервер.ЭтоРаспоряжениеНаДоставкуНаНашСклад(Ссылка) Тогда
			ПараметрыПриемки = ПолучитьПараметрыПриемки(Ссылка);
			ТекстЗапросаПоДокументу = СтрЗаменить(ТекстЗапросаПоДокументу, "&ЭтоРаспоряжение", ?(ПараметрыПриемки.ЭтоРаспоряжение, "ИСТИНА", "ЛОЖЬ"));
		КонецЕсли;
		Если ТекстЗапроса = "" Тогда
			ПоложениеИЗ = СтрНайти(ТекстЗапросаПоДокументу, "ИЗ");
			ТекстЗапроса = Лев(ТекстЗапросаПоДокументу,ПоложениеИЗ - 1)
						+ " ПОМЕСТИТЬ ДанныеРаспоряжений
						|" + Прав(ТекстЗапросаПоДокументу,СтрДлина(ТекстЗапросаПоДокументу) - ПоложениеИЗ + 1);
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|" + ТекстЗапросаПоДокументу;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТекстЗапросаПоДокументу) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов()
	+
	"ВЫБРАТЬ
	|	ТаблицаРаспоряжений.Ссылка КАК Ссылка,
	|	ТаблицаРаспоряжений.Ссылка ССЫЛКА Документ.ПоручениеЭкспедитору КАК ЭтоПоручениеЭкспедитору
	|ПОМЕСТИТЬ ТаблицаРаспоряжений
	|ИЗ
	|	&ТаблицаРаспоряжений КАК ТаблицаРаспоряжений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКДоставке.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ТоварыКДоставке.Распоряжение КАК Распоряжение,
	|	ТоварыКДоставке.Склад КАК Склад,
	|	ТоварыКДоставке.Номенклатура КАК Номенклатура,
	|	ТоварыКДоставке.Характеристика КАК Характеристика,
	|	ТоварыКДоставке.Назначение КАК Назначение,
	|	ТоварыКДоставке.Серия КАК Серия,
	|	ТоварыКДоставке.Количество КАК Количество,
	|	ТоварыКДоставке.ВсеТовары КАК ВсеТовары
	|ПОМЕСТИТЬ ТоварыКДоставке
	|ИЗ
	|	РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРаспоряжений КАК ТаблицаРаспоряжений
	|		ПО (ТаблицаРаспоряжений.Ссылка = ТоварыКДоставке.Распоряжение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку КАК ДокументЗаданиеНаПеревозку
	|		ПО (ДокументЗаданиеНаПеревозку.Ссылка = ТоварыКДоставке.ЗаданиеНаПеревозку)
	|			И (ДокументЗаданиеНаПеревозку.Проведен)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Распоряжение,
	|	Склад,
	|	ЗаданиеНаПеревозку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспоряженияЗаданий.Распоряжение КАК Ссылка,
	|	РаспоряженияЗаданий.Склад КАК Склад,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ТоварыКДоставке.ЗаданиеНаПеревозку ЕСТЬ NULL
	|					И ЗаданиеНаПеревозкуШапка.Проведен
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВсеПроведенныеЗаданияБезТоваров,
	|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
	|				КОГДА ТоварыКДоставке.ВсеТовары
	|						И ЗаданиеНаПеревозкуШапка.Проведен
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ), МАКСИМУМ(ТаблицаРаспоряжений.ЭтоПоручениеЭкспедитору)) КАК ВсеТоварыВДоставке,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ЗаданиеНаПеревозкуШапка.Проведен
	|					И ЗаданиеНаПеревозкуШапка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийНаПеревозку.Закрыто)
	|					И РаспоряженияЗаданий.Доставлено
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВсеЗаданияЗакрыты,
	|	МАКСИМУМ(ЗаданиеНаПеревозкуШапка.Проведен
	|				И РаспоряженияЗаданий.Доставлено) КАК ЕстьДоставленныеТовары,
	|	МАКСИМУМ(ЗаданиеНаПеревозкуШапка.Проведен
	|				И НЕ РаспоряженияЗаданий.Доставлено) КАК ЕстьНедоставленныеТовары,
	|	МАКСИМУМ(ЗаданиеНаПеревозкуШапка.Проведен) КАК ЕстьПроведенныеЗадания,
	|	МАКСИМУМ(ТаблицаРаспоряжений.ЭтоПоручениеЭкспедитору) КАК ЭтоПоручениеЭкспедитору
	|ПОМЕСТИТЬ ТаблицаПроверкиЗаданийИТоваровВДоставке
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗаданий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозкуШапка
	|		ПО РаспоряженияЗаданий.Ссылка = ЗаданиеНаПеревозкуШапка.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРаспоряжений КАК ТаблицаРаспоряжений
	|		ПО (ТаблицаРаспоряжений.Ссылка = РаспоряженияЗаданий.Распоряжение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКДоставке КАК ТоварыКДоставке
	|		ПО РаспоряженияЗаданий.Распоряжение = ТоварыКДоставке.Распоряжение
	|			И РаспоряженияЗаданий.Склад = ТоварыКДоставке.Склад
	|			И РаспоряженияЗаданий.Ссылка = ТоварыКДоставке.ЗаданиеНаПеревозку
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияЗаданий.Распоряжение,
	|	РаспоряженияЗаданий.Склад
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Склад,
	|	ЕстьПроведенныеЗадания";
	
	Если ЭтоДоставкаНаНашСклад Тогда
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК ЕстьТоварыНеВключенныеВЗадания,
		|	Т.Распоряжение КАК Ссылка,
		|	Т.Склад
		|ПОМЕСТИТЬ РаспоряженияЧастичноВДоставке
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыКДоставке.Распоряжение КАК Распоряжение,
		|		ТоварыКДоставке.Склад КАК Склад,
		|		ТоварыКДоставке.Номенклатура КАК Номенклатура,
		|		ТоварыКДоставке.Характеристика КАК Характеристика,
		|		ТоварыКДоставке.Назначение КАК Назначение,
		|		ТоварыКДоставке.Серия КАК Серия,
		|		-ТоварыКДоставке.Количество КАК Количество
		|	ИЗ
		|		ТоварыКДоставке КАК ТоварыКДоставке
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПроверкиЗаданийИТоваровВДоставке КАК ТаблицаПроверки
		|			ПО (ТаблицаПроверки.Склад = ТоварыКДоставке.Склад)
		|				И (ТаблицаПроверки.Ссылка = ТоварыКДоставке.Распоряжение)
		|				И НЕ ТаблицаПроверки.ВсеТоварыВДоставке
		|				И ТаблицаПроверки.ЕстьПроведенныеЗадания
		|				И ТаблицаПроверки.ЕстьПроведенныеЗадания
		|				И НЕ ТаблицаПроверки.ЭтоПоручениеЭкспедитору
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДанныеРаспоряженийПоТоварам.Ссылка,
		|		ДанныеРаспоряженийПоТоварам.Склад,
		|		ДанныеРаспоряженийПоТоварам.Номенклатура,
		|		ДанныеРаспоряженийПоТоварам.Характеристика,
		|		ДанныеРаспоряженийПоТоварам.Назначение,
		|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		|		ДанныеРаспоряженийПоТоварам.Количество
		|	ИЗ
		|		Документ.ЗаказПоставщику.Товары КАК ДанныеРаспоряженийПоТоварам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПроверкиЗаданийИТоваровВДоставке КАК ТаблицаПроверки
		|			ПО (ТаблицаПроверки.Склад = ДанныеРаспоряженийПоТоварам.Склад)
		|				И (ТаблицаПроверки.Ссылка = ДанныеРаспоряженийПоТоварам.Ссылка)
		|				И НЕ ТаблицаПроверки.ВсеТоварыВДоставке
		|				И ТаблицаПроверки.ЕстьПроведенныеЗадания
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДанныеРаспоряженийПоТоварам.Ссылка,
		|		ДанныеРаспоряженийПоТоварам.Склад,
		|		ДанныеРаспоряженийПоТоварам.Номенклатура,
		|		ДанныеРаспоряженийПоТоварам.Характеристика,
		|		ДанныеРаспоряженийПоТоварам.Назначение,
		|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		|		ДанныеРаспоряженийПоТоварам.Количество
		|	ИЗ
		|		Документ.ПриобретениеТоваровУслуг.Товары КАК ДанныеРаспоряженийПоТоварам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПроверкиЗаданийИТоваровВДоставке КАК ТаблицаПроверки
		|			ПО (ТаблицаПроверки.Склад = ДанныеРаспоряженийПоТоварам.Склад)
		|				И (ТаблицаПроверки.Ссылка = ДанныеРаспоряженийПоТоварам.Ссылка)
		|				И НЕ ТаблицаПроверки.ВсеТоварыВДоставке
		|				И ТаблицаПроверки.ЕстьПроведенныеЗадания
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДанныеРаспоряженийПоТоварам.Ссылка,
		|		ДанныеРаспоряженийПоТоварам.Склад,
		|		ДанныеРаспоряженийПоТоварам.Номенклатура,
		|		ДанныеРаспоряженийПоТоварам.Характеристика,
		|		ДанныеРаспоряженийПоТоварам.Назначение,
		|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
		|		ДанныеРаспоряженийПоТоварам.Количество
		|	ИЗ
		|		Документ.ПриемкаТоваровНаХранение.Товары КАК ДанныеРаспоряженийПоТоварам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПроверкиЗаданийИТоваровВДоставке КАК ТаблицаПроверки
		|			ПО (ТаблицаПроверки.Склад = ДанныеРаспоряженийПоТоварам.Склад)
		|				И (ТаблицаПроверки.Ссылка = ДанныеРаспоряженийПоТоварам.Ссылка)
		|				И НЕ ТаблицаПроверки.ВсеТоварыВДоставке
		|				И ТаблицаПроверки.ЕстьПроведенныеЗадания) КАК Т
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Распоряжение,
		|	Т.Склад,
		|	Т.Характеристика,
		|	Т.Назначение,
		|	Т.Серия,
		|	Т.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(Т.Количество) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК НетОстатка,
		|	ТоварыКПоступлениюОбороты.ДокументПоступления КАК ДокументОтгрузкиПоступления,
		|	ТоварыКПоступлениюОбороты.Склад КАК Склад
		|ПОМЕСТИТЬ ОстаткиКОтгрузкеКПоступлению
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Обороты(, , , ДокументПоступления В (&Ссылки)) КАК ТоварыКПоступлениюОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению.Остатки(, ДокументПоступления В (&Ссылки)) КАК ОстаткиТоварыКПоступлению
		|		ПО ТоварыКПоступлениюОбороты.ДокументПоступления = ОстаткиТоварыКПоступлению.ДокументПоступления
		|			И ТоварыКПоступлениюОбороты.Склад = ОстаткиТоварыКПоступлению.Склад
		|ГДЕ
		|	ТоварыКПоступлениюОбороты.КОформлениюОрдеровПриход > 0
		|	И ОстаткиТоварыКПоступлению.КОформлениюОрдеровОстаток ЕСТЬ NULL";
	Иначе
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК ЕстьТоварыНеВключенныеВЗадания,
		|	Т.Распоряжение КАК Ссылка,
		|	Т.Склад
		|ПОМЕСТИТЬ РаспоряженияЧастичноВДоставке
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыКДоставке.Распоряжение КАК Распоряжение,
		|		ТоварыКДоставке.Склад КАК Склад,
		|		ТоварыКДоставке.Номенклатура КАК Номенклатура,
		|		ТоварыКДоставке.Характеристика КАК Характеристика,
		|		ТоварыКДоставке.Назначение КАК Назначение,
		|		ТоварыКДоставке.Серия КАК Серия,
		|		-ТоварыКДоставке.Количество КАК Количество
		|	ИЗ
		|		ТоварыКДоставке КАК ТоварыКДоставке
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПроверкиЗаданийИТоваровВДоставке КАК ТаблицаПроверки
		|			ПО (ТаблицаПроверки.Склад = ТоварыКДоставке.Склад)
		|				И (ТаблицаПроверки.Ссылка = ТоварыКДоставке.Распоряжение)
		|				И НЕ ТаблицаПроверки.ВсеТоварыВДоставке
		|				И ТаблицаПроверки.ЕстьПроведенныеЗадания
		|				И НЕ ТаблицаПроверки.ЭтоПоручениеЭкспедитору
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыКОтгрузке.ДокументОтгрузки,
		|		ТоварыКОтгрузке.Склад,
		|		ТоварыКОтгрузке.Номенклатура,
		|		ТоварыКОтгрузке.Характеристика,
		|		ТоварыКОтгрузке.Назначение,
		|		ТоварыКОтгрузке.Серия,
		|		ТоварыКОтгрузке.КОтгрузкеПриход
		|	ИЗ
		|		РегистрНакопления.ТоварыКОтгрузке.Обороты(, , , ДокументОтгрузки В (&Ссылки)) КАК ТоварыКОтгрузке
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПроверкиЗаданийИТоваровВДоставке КАК ТаблицаПроверки
		|			ПО (ТаблицаПроверки.Склад = ТоварыКОтгрузке.Склад)
		|				И (ТаблицаПроверки.Ссылка = ТоварыКОтгрузке.ДокументОтгрузки)
		|				И НЕ ТаблицаПроверки.ВсеТоварыВДоставке
		|				И ТаблицаПроверки.ЕстьПроведенныеЗадания
		|	ГДЕ
		|		ТоварыКОтгрузке.КОтгрузкеПриход > 0) КАК Т
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Распоряжение,
		|	Т.Склад,
		|	Т.Характеристика,
		|	Т.Назначение,
		|	Т.Серия,
		|	Т.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(Т.Количество) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК НетОстатка,
		|	ТоварыКОтгрузкеОбороты.ДокументОтгрузки КАК ДокументОтгрузкиПоступления,
		|	ТоварыКОтгрузкеОбороты.Склад КАК Склад
		|ПОМЕСТИТЬ ОстаткиКОтгрузкеКПоступлению
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Обороты(, , , ДокументОтгрузки В (&Ссылки)) КАК ТоварыКОтгрузкеОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, ДокументОтгрузки В (&Ссылки)) КАК ОстаткиТоварыКОтгрузке
		|		ПО ТоварыКОтгрузкеОбороты.ДокументОтгрузки = ОстаткиТоварыКОтгрузке.ДокументОтгрузки
		|			И ТоварыКОтгрузкеОбороты.Склад = ОстаткиТоварыКОтгрузке.Склад
		|ГДЕ
		|	ТоварыКОтгрузкеОбороты.КОтгрузкеПриход > 0
		|	И ОстаткиТоварыКОтгрузке.КОтгрузкеОстаток ЕСТЬ NULL";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ТаблицаРаспоряжений.Ссылка КАК Распоряжение,
	|	ДанныеРаспоряжений.Номер,
	|	ДанныеРаспоряжений.Дата,
	|	ЕСТЬNULL(ДанныеРаспоряжений.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	|	ДанныеРаспоряжений.ПолучательОтправитель,
	|	ДанныеРаспоряжений.Перевозчик,
	|	ДанныеРаспоряжений.СпособДоставки,
	|	ДанныеРаспоряжений.Зона,
	|	ДанныеРаспоряжений.Адрес,
	|	ДанныеРаспоряжений.АдресЗначенияПолей,
	|	ДанныеРаспоряжений.ВремяС,
	|	ДанныеРаспоряжений.ВремяПо,
	|	ДанныеРаспоряжений.ДополнительнаяИнформация,
	|	ДанныеРаспоряжений.ДоставитьПолностью,
	|	ДанныеРаспоряжений.ОсобыеУсловияПеревозки,
	|	ДанныеРаспоряжений.ОсобыеУсловияПеревозкиОписание,
	|	ДанныеРаспоряжений.РазбиватьРасходныеОрдераПоРаспоряжениям,
	|	ВЫБОР
	|		КОГДА ДанныеРаспоряжений.Ссылка ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ДанныеРаспоряжений.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПоставщикаДоНашегоСклада)
	|			ИЛИ НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
	|				И ДанныеРаспоряжений.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
	|			ИЛИ НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
	|				И ДанныеРаспоряжений.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|			ИЛИ ДанныеРаспоряжений.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	|				И (НЕ ДанныеРаспоряжений.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|					ИЛИ ДанныеРаспоряжений.Дата < ДанныеРаспоряжений.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ДанныеРаспоряжений.Проведен = ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ТаблицаПроверки.ВсеПроведенныеЗаданияБезТоваров
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ТаблицаПроверки.ВсеЗаданияЗакрыты = ИСТИНА
	|				И ОстаткиКОтгрузкеКПоступлению.НетОстатка
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ТаблицаПроверки.ВсеЗаданияЗакрыты = ИСТИНА
	|				И РаспоряженияЧастичноВДоставке.Ссылка ЕСТЬ NULL 
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|
	|		КОГДА ЕстьNULL(ТаблицаПроверки.ЕстьПроведенныеЗадания,Ложь)
	|				И НЕ ЕстьNULL(РаспоряженияЧастичноВДоставке.ЕстьТоварыНеВключенныеВЗадания,Ложь)
	|				И ЕСТЬNULL(ТаблицаПроверки.ЕстьДоставленныеТовары, ЛОЖЬ)
	|				И НЕ ЕСТЬNULL(ТаблицаПроверки.ЕстьНедоставленныеТовары, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ПолностьюВДоставке)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка)
	|	КОНЕЦ КАК Состояние
	|ИЗ
	|	ТаблицаРаспоряжений КАК ТаблицаРаспоряжений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРаспоряжений КАК ДанныеРаспоряжений
	|		ПО ДанныеРаспоряжений.Ссылка = ТаблицаРаспоряжений.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПроверкиЗаданийИТоваровВДоставке КАК ТаблицаПроверки
	|		ПО ДанныеРаспоряжений.Склад = ТаблицаПроверки.Склад
	|			И ДанныеРаспоряжений.Ссылка = ТаблицаПроверки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РаспоряженияЧастичноВДоставке КАК РаспоряженияЧастичноВДоставке
	|		ПО ДанныеРаспоряжений.Склад = РаспоряженияЧастичноВДоставке.Склад
	|			И ДанныеРаспоряжений.Ссылка = РаспоряженияЧастичноВДоставке.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиКОтгрузкеКПоступлению КАК ОстаткиКОтгрузкеКПоступлению
	|		ПО ДанныеРаспоряжений.Склад = ОстаткиКОтгрузкеКПоступлению.Склад
	|			И ДанныеРаспоряжений.Ссылка = ОстаткиКОтгрузкеКПоступлению.ДокументОтгрузкиПоступления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаРаспоряжений.Ссылка,
	|	ЕСТЬNULL(ДанныеРаспоряжений.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))";
	
	ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками = ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылки", МассивСсылок);
	Запрос.УстановитьПараметр("ДоговораРаспоряженияНаПоступление", МассивДоговоровРаспоряжений);
	Запрос.УстановитьПараметр("ТаблицаРаспоряжений", ТаблицаРаспоряжений);
	Запрос.УстановитьПараметр("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками",
		ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками);
	Запрос.УстановитьПараметр("ИспользоватьРасширенныеВозможностиЗаказаКлиента",
		ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента"));
	Запрос.УстановитьПараметр("ИспользуемыеСпособыДоставки", ДоставкаТоваровКлиентСервер.ИспользуемыеСпособыДоставки(
		ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками));
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Распоряжение") Цикл
		
		НаборСостояние = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьНаборЗаписей();
		НаборСостояние.Отбор.Распоряжение.Установить(Выборка.Распоряжение);
		
		Пока Выборка.СледующийПоЗначениюПоля("Склад") Цикл
			
			Если ЗначениеЗаполнено(Выборка.Состояние) Тогда
				ЗаполнитьЗначенияСвойств(НаборСостояние.Добавить(), Выборка);
			КонецЕсли;
			
		КонецЦикла;
		
		НаборСостояние.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Получает список перевозчиков и помещает их во временное хранилище.
//
// Параметры:
//  ПараметрыЗадания - Массив - содержит параметры вызова
//  АдресХранилища - Строка - адрес временного хранилища, по которому будет помещен результат выполнения.
//
Процедура ПолучитьСписокПеревозчиковВФоне(ПараметрыЗадания, АдресХранилища) Экспорт
	
	МассивОтправителей = ПолучитьСписокПеревозчиков(ПараметрыЗадания[0], ПараметрыЗадания[1]);
	
	ПоместитьВоВременноеХранилище(МассивОтправителей, АдресХранилища);
	
КонецПроцедуры

// Устанавливает свойства форм документов, в которых имеются реквизиты доставки при чтении, создании.
//
// Параметры:
//  ЭлементыФормы		 - ВсеЭлементыФормы	 - все элементы формы для управления свойствами и переключения закладок, может содержать:
//  							* ОсобыеУсловияПеревозкиОписание - ПолеФормы - обязательное
//  							* ОсобыеУсловияПеревозкиОписание1 - ПолеФормы - необязательное
//  							* ОсобыеУсловияПеревозкиОписание2 - ПолеФормы - необязательное
//  							* ОсобыеУсловияПеревозкиОписаниеДоставкаПеревозчиком - ПолеФормы - необязательное
//  ДокОбъект			       - ДанныеФормыСтруктура	 - объект, реквизиты которого используются при заполнении свойств,
//  НакладнаяПоЗаказу	       - Булево				 - Истина, если ДокОбъект является накладной и по заказам, иначе Ложь,
//  ПараметрыЗаполнения	       - Структура			 - структуру см. ПараметрыЗаполненияРеквизитов
//  СводнаяИнформация          - Строка				 - реквизит формы, для заполнения сводной информации по доставке.
//  ЗаполнятьПеревозчиковВФоне - Булево				 - признак, что заполнение перевозчиков заполняется в фоне.
// Возвращаемое значение:
//  Структура                  - см. ДлительныеОперации.ВыполнитьВФоне или пустая стуктура.
//
Функция ПриЧтенииСозданииРаспоряженийНаСервере(ЭлементыФормы,
	ДокОбъект, НакладнаяПоЗаказу = Ложь, ПараметрыЗаполнения = Неопределено, СводнаяИнформация = Неопределено,
	ЗаполнятьПеревозчиковВФоне = Ложь) Экспорт
	
	ПараметрыПриемки         = Неопределено;
	РаспоряжениеПоСоглашению = Ложь;
	РаспоряжениеПоДоговору   = Ложь;
	РезультатФоновогоЗадания = Новый Структура();
	
	ЭтоДоставкаНаНашСклад = ДоставкаТоваровКлиентСервер.ЭтоРаспоряжениеНаДоставкуНаНашСклад(ДокОбъект);
	
	Если ЭтоДоставкаНаНашСклад И ДокОбъект.Свойство("Ссылка") И ДокОбъект.Свойство("ВариантПриемкиТоваров") Тогда
		ПараметрыПриемки = ПолучитьПараметрыПриемки(ДокОбъект, ДокОбъект.ВариантПриемкиТоваров, НакладнаяПоЗаказу);
	КонецЕсли;
	
	Если Не УстановитьВидимостьЭлементовДоставки(ЭлементыФормы, ДокОбъект, НакладнаяПоЗаказу, ПараметрыПриемки, ЭтоДоставкаНаНашСклад) Тогда
		ПриЧтенииСозданииЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(ЭлементыФормы, ДокОбъект);
		Возврат РезультатФоновогоЗадания;
	КонецЕсли;
	
	УстановитьДоступностьАдресовЗаполнитьСпискиВремени(ЭлементыФормы);
	
	Если ЗаполнятьПеревозчиковВФоне Тогда
		
		Если НЕ ЭлементыФормы.Найти("ПеревозчикПартнер") = Неопределено Тогда
			
			ПроцедураРасчета = "ДоставкаТоваров.ПолучитьСписокПеревозчиковВФоне";
			
			ПараметрыЗадания = Новый Массив;
			ПараметрыЗадания.Добавить(ЭлементыФормы.ПеревозчикПартнер.СписокВыбора.ВыгрузитьЗначения());
			Если ДокОбъект <> Неопределено Тогда
				ПараметрыЗадания.Добавить(ПолучательОтправитель(ДокОбъект).Значение);
			Иначе
				ПараметрыЗадания.Добавить(Неопределено);
			КонецЕсли;
			
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор());
			ПараметрыВыполнения.ОжидатьЗавершение = 0;
			ПараметрыВыполнения.ЗапуститьВФоне = Истина;
			
			РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(
				ПроцедураРасчета, ПараметрыЗадания, ПараметрыВыполнения);
			
		КонецЕсли;
	
	Иначе
		
		ЗаполнитьСписокВыбораПеревозчиков(ЭлементыФормы,ДокОбъект);
		
	КонецЕсли;
	
	СпособДоставки = ДокОбъект.СпособДоставки;
	
	Если СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи Тогда
		ЗаполнитьСписокВыбораАдресовПеревозчика(ЭлементыФормы, ДокОбъект);
	КонецЕсли;
	ЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(ЭлементыФормы, ДокОбъект);
	ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками = ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками");
	Если ЭлементыФормы.Найти("СтраницыДоставки") <> Неопределено Тогда
		
		ДоставкаОпределенаВДоговоре = Ложь;
		
		Если ЭтоДоставкаНаНашСклад Тогда
			РаспоряжениеПоСоглашению    = ЭтоРаспоряжениеПоСоглашению(ДокОбъект, ПараметрыПриемки);
			ДоставкаОпределенаВДоговоре = ДоставкаОпределенаВДоговоре(ДокОбъект);
			Если ДоставкаОпределенаВДоговоре И ДокОбъект.Свойство("Договор") И ЭлементыФормы.Найти("ГруппаСводнаяИнформацияПоДоставке") <> Неопределено Тогда
				СпособДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.Договор, "СпособДоставки");
				СводнаяИнформация = СформироватьСводнуюИнформациюПоДоставке(ДокОбъект.Договор);
				ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(ЭлементыФормы, ДокОбъект);
			ИначеЕсли РаспоряжениеПоСоглашению И ДокОбъект.Свойство("Соглашение") И ЭлементыФормы.Найти("ГруппаСводнаяИнформацияПоДоставке") <> Неопределено Тогда
				СпособДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.Соглашение, "СпособДоставки");
				СводнаяИнформация = СформироватьСводнуюИнформациюПоДоставке(ДокОбъект.Соглашение);
				ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(ЭлементыФормы, ДокОбъект);
			КонецЕсли;
		КонецЕсли;
		
		ЭтоДоговорСоглашение = ТипЗнч(ДокОбъект.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
			Или ТипЗнч(ДокОбъект.Ссылка) = Тип("СправочникСсылка.СоглашенияСПоставщиками");
		
		РаспоряжениеПоДоговору = Не ЭтоДоговорСоглашение И ДоставкаОпределенаВДоговоре;
		
		ДоставкаТоваровКлиентСервер.УстановитьСтраницуДоставки(ЭлементыФормы,
			СпособДоставки,
			ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками,
			РаспоряжениеПоСоглашению,
			РаспоряжениеПоДоговору);
		Если ЭлементыФормы.Найти("СтраницаДоставкаПеревозчиком") <> Неопределено Тогда
			ЭлементыФормы.ОсобыеУсловияПеревозкиДоставкаПеревозчиком.Видимость         = ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками;
			ЭлементыФормы.ОсобыеУсловияПеревозкиОписаниеДоставкаПеревозчиком.Видимость = ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками;
		КонецЕсли;
	КонецЕсли;
	
	ОсобыеУсловияПеревозкиУстановитьДоступность(ЭлементыФормы, ДокОбъект);
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

// В зависимости от ФО РедактироватьАдресаДоставкиТолькоВДиалоге для элементов-адресов доставки
//	устанавливается признак РедактированиеТекста.
//
// Параметры:
//	ЭлементыФормы - ВсеЭлементыФормы - элементы формы, для которых осуществляется изменение свойств.
//
Процедура УстановитьДоступностьАдресовДоставки(ЭлементыФормы) Экспорт
	
	РедактированиеРазрешено = Не ПолучитьФункциональнуюОпцию("РедактироватьАдресаДоставкиТолькоВДиалоге");
	Если РедактированиеРазрешено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ЭлементФормы Из ЭлементыФормы Цикл
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы")
		 И ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода
		 И СтрНайти(НРег(ЭлементФормы.Имя), НРег("Адрес")) > 0 Тогда
			ЭлементФормы.РедактированиеТекста = РедактированиеРазрешено;
			ЭлементФормы.КнопкаОчистки = Истина;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

// В зависимости от ФО РедактироватьАдресаДоставкиТолькоВДиалоге для элементов-адресов доставки
//	устанавливается признак РедактированиеТекста и заполняется список выбора.
//
// Параметры:
//	ЭлементыФормы - ВсеЭлементыФормы - элементы формы, для которых осуществляется изменение свойств.
//
Процедура УстановитьДоступностьАдресовЗаполнитьСпискиВремени(ЭлементыФормы) Экспорт
	
	РедактированиеРазрешено = Не ПолучитьФункциональнуюОпцию("РедактироватьАдресаДоставкиТолькоВДиалоге");
	Если ЭлементыФормы.Найти("СтраницаДоставка") <> Неопределено Тогда
		ЭлементыДляОбхода = ЭлементыФормы.СтраницаДоставка.ПодчиненныеЭлементы;
	Иначе
		ЭлементыДляОбхода = ЭлементыФормы;
	КонецЕсли;
	
	РекурсивноУстановитьДоступностьАдресовЗаполнитьСпискиВремени(ЭлементыДляОбхода, РедактированиеРазрешено);
	
КонецПроцедуры

// Возвращает параметры заполнения реквизитов доставки
// 
// Возвращаемое значение:
//  Структура - с ключом:
//  * ОчиститьРеквизитыДоставки - Булево - инициализировать реквизиты доставки,
//  * УстановитьСпособДоставки - Булево - установить способ доставки по статистике,
//  * УстановитьАдресДоставки - Булево - установить адрес доставки из списка выбора,
//  * ИсточникСтатистики - ДокументМенеджер, Неопределено - менеджеры документов,
//  из которых будет извлекаться статистика для заполнения реквизитов доставки.
//
Функция ПараметрыЗаполненияРеквизитов() Экспорт
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("ОчиститьРеквизитыДоставки", Истина);
	ПараметрыЗаполнения.Вставить("УстановитьСпособДоставки", Истина);
	ПараметрыЗаполнения.Вставить("УстановитьАдресДоставки", Истина);
	ПараметрыЗаполнения.Вставить("ИсточникСтатистики", Неопределено);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Заполняет реквизиты доставки в зависимости от элемента формы, в котором производятся изменения.
//
// Параметры:
//	ЭлементыФормы - ВсеЭлементыФормы - все элементы формы, в которых производятся изменения
//	ИмяЭлементаФормы - Строка - имя элемента формы, в котором произошли изменения
//	ДокОбъект - ДанныеФормыСтруктура - объект, реквизиты которого используются при заполнении
//	ПараметрыЗаполнения - см. ПараметрыЗаполненияРеквизитов
//
Процедура ЗаполнитьРеквизитыДоставки(ЭлементыФормы, ИмяЭлементаФормы, ДокОбъект, ПараметрыЗаполнения = Неопределено) Экспорт
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка25() Тогда
		
		Если ДокОбъект.Свойство("Ссылка") Тогда
			
			ТипЗначенияОбъекта = ТипЗнч(ДокОбъект.Ссылка);
			
			ИмяЭлементаАдреса = "";
			
			Если ТипЗначенияОбъекта = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				
				Если ДокОбъект.Свойство("СоздаватьЗаказКлиента")
					Или (ИмяЭлементаФормы = "Партнер"
						И Не ДокОбъект.Партнер.Пустая()
						И (Не ДокОбъект.ТребуетсяДоставка))
					Или (ДокОбъект.СпособУказанияДоставки = Перечисления.СпособыУказанияДоставки.ПоСтрокам
						И ДокОбъект.ТребуетсяДоставка) Тогда
					
					ИмяЭлементаАдреса = "АдресДоставкиПолучателя";
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТипЗначенияОбъекта = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
				Если (ИмяЭлементаФормы = "Партнер"
						Или ИмяЭлементаФормы = "Грузополучатель")
					И Не ДокОбъект.Партнер.Пустая()
					И Не ДокОбъект.ТребуетсяДоставка Тогда
					
					ИмяЭлементаАдреса = "АдресДоставкиПолучателя";
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТипЗначенияОбъекта = Тип("ДокументСсылка.ОтгрузкаТоваровКлиенту")
				Или ТипЗначенияОбъекта = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента")
				Или ТипЗначенияОбъекта = Тип("ДокументСсылка.ОтгрузкаТоваровСХранения")
				
				
				Или ТипЗначенияОбъекта = Тип("ДокументСсылка.ПередачаТоваровХранителю") Тогда
				
				Если ИмяЭлементаФормы = "Партнер"
					И Не ДокОбъект.Партнер.Пустая() Тогда
					
					ИмяЭлементаАдреса = "АдресДоставкиПолучателя";
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ПустаяСтрока(ИмяЭлементаАдреса) Тогда
				
				ЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(ЭлементыФормы, ДокОбъект, Истина);
				
				ЭлементАдреса = ЭлементыФормы[ИмяЭлементаАдреса]; // ПолеФормы, РасширениеПоляФормыДляПоляВвода
				Если ЭлементАдреса.СписокВыбора.Количество() > 0 Тогда
					
					ПерваяСтруктураВСписке = ЭлементАдреса.СписокВыбора[0].Значение; // Структура
					ДокОбъект.АдресДоставки = ПерваяСтруктураВСписке.АдресДоставки;
					ДокОбъект.АдресДоставкиЗначение = ПерваяСтруктураВСписке.АдресДоставкиЗначение;
					ДокОбъект.АдресДоставкиЗначенияПолей = ПерваяСтруктураВСписке.АдресДоставкиЗначенияПолей;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ПолучательОтправитель = ПолучательОтправитель(ДокОбъект);
	
	Если ИмяЭлементаФормы = ПолучательОтправитель.ИмяПоля Тогда
		
		ПриИзмененииПолучателяОтправителя(ЭлементыФормы, ДокОбъект, ПараметрыЗаполнения);
		
	ИначеЕсли СтрНайти(ИмяЭлементаФормы,"Грузополучатель") > 0 Тогда
		
		Если ПараметрыЗаполнения = Неопределено Тогда
			ПараметрыЗаполнения = ПараметрыЗаполненияРеквизитов();
			ПараметрыЗаполнения.ОчиститьРеквизитыДоставки = Ложь;
			ПараметрыЗаполнения.УстановитьСпособДоставки = Ложь;
			ПараметрыЗаполнения.УстановитьАдресДоставки = Ложь;
		КонецЕсли;
		
		ПриИзмененииПолучателяОтправителя(ЭлементыФормы, ДокОбъект, ПараметрыЗаполнения);
		
	Иначе
		
		Если СтрНайти(ИмяЭлементаФормы, "СпособДоставки") > 0
		 ИЛИ СтрНайти(ИмяЭлементаФормы, "МестоПередачи") > 0 Тогда
			
			ПриИзмененииСпособаДоставки(ЭлементыФормы, ДокОбъект);
			
		ИначеЕсли СтрНайти(ИмяЭлементаФормы, "ПеревозчикПартнер") > 0 Тогда
			
			ПриИзмененииПеревозчика(ЭлементыФормы, ДокОбъект);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет необходимые действия при изменении способа доставки в распоряжениях на доставку,
//	заполняет списки выбора, реквизиты доставки, настраивает элементы формы.
//
// Параметры:
//  ЭлементыФормы - ВсеЭлементыФормы - элементы формы, в которой производятся изменения,
//	ДокОбъект - ДанныеФормыСтруктура, СправочникОбъект - объект, реквизиты которого используются при заполнении.
//
Процедура ПриИзмененииСпособаДоставки(ЭлементыФормы, ДокОбъект) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой") Тогда
		Возврат
	КонецЕсли;
	
	ЭтоДоставкаНаНашСклад = ДоставкаТоваровКлиентСервер.ЭтоРаспоряжениеНаДоставкуНаНашСклад(ДокОбъект.Ссылка);
	
	РеквизитыДоставки = РеквизитыДоставки(ДокОбъект);
	
	ДопИнфоИзмененоПользователем = ДоставкаТоваровКлиентСервер.ДопИнфоИзмененоПользователем(ЭлементыФормы, ДокОбъект);
	
	ЗаполнитьРеквизитыПоСпособуДоставки(ЭлементыФормы, РеквизитыДоставки, ДопИнфоИзмененоПользователем);
	
	Если (РеквизитыДоставки.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
			Или РеквизитыДоставки.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи)
		И ЗначениеЗаполнено(РеквизитыДоставки.ПеревозчикПартнер) Тогда
		ЗаполнитьСписокВыбораАдресовПеревозчика(ЭлементыФормы, РеквизитыДоставки);
		ЗаполнитьРеквизитыПоПеревозчику(ЭлементыФормы, РеквизитыДоставки, ДопИнфоИзмененоПользователем);
	КонецЕсли;
	
	Если РеквизитыДоставки.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиентаКурьером Тогда
		
		ДатаДокумента = ДокОбъект.Дата;
		Если ДокОбъект.Дата - НачалоДня(ДокОбъект.Дата) = 0 Тогда
			ДатаДокумента = ТекущаяДатаСеанса();
		КонецЕсли;
		
		ДатаОтгрузки = ДатаДокумента;
		
		Если (ТипЗнч(ДокОбъект) = Тип("ДанныеФормыСтруктура")
			Или ТипЗнч(ДокОбъект) = Тип("Структура")) Тогда
			
			Если ДокОбъект.Свойство("ДатаОтгрузки") Тогда
				
				Если ЗначениеЗаполнено(ДокОбъект.ДатаОтгрузки) Тогда
					ДатаОтгрузки = ДокОбъект.ДатаОтгрузки;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаОтгрузки", ДокОбъект.Метаданные()) Тогда
			
			Если ЗначениеЗаполнено(ДокОбъект.ДатаОтгрузки) Тогда
				ДатаОтгрузки = ДокОбъект.ДатаОтгрузки;
			КонецЕсли;
			
		КонецЕсли;
		
		НастройкиСклада = СкладыСервер.НастройкиСкладаДляСборкиИДоставки(ДокОбъект.Склад, ДатаДокумента);
		
		Если НастройкиСклада <> Неопределено 
			И НастройкиСклада.НормативныйСрокДоставкиЗаказов > 0 
			И НачалоДня(ДатаОтгрузки) = НачалоДня(ДатаДокумента) Тогда
			
			РеквизитыДоставки.ВремяДоставкиС = ДатаДокумента;
			РеквизитыДоставки.ВремяДоставкиПо = ДатаДокумента + НастройкиСклада.НормативныйСрокДоставкиЗаказов*60;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокОбъект, РеквизитыДоставки);
	
	ЭтоДоговорСоглашение = ТипЗнч(ДокОбъект.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
		Или ТипЗнч(ДокОбъект.Ссылка) = Тип("СправочникСсылка.СоглашенияСПоставщиками");
	
	Если ЭлементыФормы.Найти("СтраницыДоставки") <> Неопределено Тогда
		РаспоряжениеПоСоглашению = ЭтоДоставкаНаНашСклад И ЭтоРаспоряжениеПоСоглашению(ДокОбъект);
		ДоставкаОпределенаВДоговоре = ЭтоДоставкаНаНашСклад И ДоставкаОпределенаВДоговоре(ДокОбъект);
		
		РаспоряжениеПоДоговору = Не ЭтоДоговорСоглашение И ДоставкаОпределенаВДоговоре;
		
		ДоставкаТоваровКлиентСервер.УстановитьСтраницуДоставки(ЭлементыФормы,
			ДокОбъект.СпособДоставки,
			ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками"),
			РаспоряжениеПоСоглашению,
			РаспоряжениеПоДоговору);
	КонецЕсли;
	
	ОсобыеУсловияПеревозкиУстановитьДоступность(ЭлементыФормы, ДокОбъект);
	
КонецПроцедуры

// Добавляет в структуру РеквизитыШапки реквизиты доставки в зависимости от способа доставки,
// используется при вводе Реализации товаров и услуг на основании Заказов клиента.
//
// Параметры:
//	РеквизитыШапки - Структура - структура, в которую добавляются реквизиты, связанные с доставкой;
//	ВыборкаРеквизитыШапки - ВыборкаИзРезультатаЗапроса - выборка из результатов запроса, в которой содержатся 
//		данные по доставке.
//
Процедура ДополнитьРеквизитамиДоставкиДанныеЗаполнения(РеквизитыШапки,ВыборкаРеквизитыШапки) Экспорт
	
	РеквизитыШапки.Вставить("СпособДоставки", ВыборкаРеквизитыШапки.СпособДоставки);
	Если ВыборкаРеквизитыШапки.СпособДоставки <> Перечисления.СпособыДоставки.Самовывоз 
	 ИЛИ ЗначениеЗаполнено(ВыборкаРеквизитыШапки.АдресДоставки) Тогда //наследуем, если заполнен АдресДоставки
		
		РеквизитыШапки.Вставить("АдресДоставки", ВыборкаРеквизитыШапки.АдресДоставки);
		РеквизитыШапки.Вставить("АдресДоставкиЗначенияПолей", ВыборкаРеквизитыШапки.АдресДоставкиЗначенияПолей);
		
		ЕстьСвойствоЗначенияАдреса = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
			ВыборкаРеквизитыШапки,
			"АдресДоставкиЗначение");
			
		Если ЕстьСвойствоЗначенияАдреса Тогда
			АдресДоставкиЗначение = ВыборкаРеквизитыШапки.АдресДоставкиЗначение; // Строка
		Иначе
			АдресДоставкиЗначение = "";
		КонецЕсли;
		
		РеквизитыШапки.Вставить("АдресДоставкиЗначение", АдресДоставкиЗначение);
		
		Если ВыборкаРеквизитыШапки.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента
			Или ВыборкаРеквизитыШапки.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
			РеквизитыШапки.Вставить("ЗонаДоставки", ВыборкаРеквизитыШапки.ЗонаДоставки);
			РеквизитыШапки.Вставить("ВремяДоставкиС", ВыборкаРеквизитыШапки.ВремяДоставкиС);
			РеквизитыШапки.Вставить("ВремяДоставкиПо", ВыборкаРеквизитыШапки.ВремяДоставкиПо);
			РеквизитыШапки.Вставить("ДополнительнаяИнформацияПоДоставке", ВыборкаРеквизитыШапки.ДополнительнаяИнформацияПоДоставке);
		КонецЕсли;
		
		Если ВыборкаРеквизитыШапки.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика
		 ИЛИ ВыборкаРеквизитыШапки.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
			РеквизитыШапки.Вставить("ПеревозчикПартнер",                     ВыборкаРеквизитыШапки.ПеревозчикПартнер);
			РеквизитыШапки.Вставить("ДополнительнаяИнформацияПоДоставке",    ВыборкаРеквизитыШапки.ДополнительнаяИнформацияПоДоставке);
			Если ВыборкаРеквизитыШапки.ПеревозчикПартнер <> Справочники.Партнеры.ПустаяСсылка()
					И ВыборкаРеквизитыШапки.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
				РеквизитыШапки.Вставить("АдресДоставкиПеревозчика",              ВыборкаРеквизитыШапки.АдресДоставкиПеревозчика);
				РеквизитыШапки.Вставить("АдресДоставкиПеревозчикаЗначенияПолей", ВыборкаРеквизитыШапки.АдресДоставкиПеревозчикаЗначенияПолей);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// При изменении флага "По заказам" в накладной меняет видимость элементов управления доставкой, меняет способ доставки.
//
// Параметры:
//	ЭлементыФормы		 - ЭлементыФормы			- все элементы формы;
//	ДокОбъект			 - ДокументОбъект			- документ, в котором осуществляются изменения;
//	НакладнаяПоЗаказам	 - Булево					- Истина - документ является накладной по заказам.
//
Процедура ПриИзмененииФлагаПоЗаказам(ЭлементыФормы, ДокОбъект, НакладнаяПоЗаказам) Экспорт
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка25() Тогда
		Возврат;
	КонецЕсли;
	
	Если НакладнаяПоЗаказам Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками")
			Или ДокОбъект.СпособДоставки <> Перечисления.СпособыДоставки.СиламиПеревозчика Тогда
			ЗаполнитьЗначенияСвойств(ДокОбъект, ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки(ДокОбъект));
		КонецЕсли;
		УстановитьВидимостьЭлементовДоставки(ЭлементыФормы, ДокОбъект, НакладнаяПоЗаказам);
	Иначе
		ПриЧтенииСозданииРаспоряженийНаСервере(ЭлементыФормы, ДокОбъект, НакладнаяПоЗаказам);
	КонецЕсли;
	
КонецПроцедуры

// Подбирает из Заданий на перевозку значения последних реквизитов доставки по получателю или партнеру.
// Параметры:
//	ПолучательОтправитель - СправочникСсылка.Партнеры, СправочникСсылка.Склады - необязательный, если указан Перевозчик,
//	Перевозчик - СправочникСсылка.Партнеры - необязательный, если указан ПолучательОтправитель.
//
// Возвращаемое значение:
//	ТаблицаЗначений - содержит три последних набора реквизитов доставки по Партнеру или Перевозчику.
//		Колонки:
//		АдресДоставки,
//		АдресДоставкиЗначение,
//		АдресДоставкиЗначенияПолей,
//		ЗонаДоставки,
//		ВремяС,
//		ВремяПо,
//		ДополнительнаяИнформация.
//
Функция ПоследниеРеквизитыДоставкиИзЗаданий(ПолучательОтправитель = Неопределено, Перевозчик = Неопределено) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗаданиеНаПеревозкуРаспоряжения.НомерСтроки,
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Дата,
	|	ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи,
	|	ЗаданиеНаПеревозкуРаспоряжения.ВремяС,
	|	ЗаданиеНаПеревозкуРаспоряжения.ВремяПо,
	|	ЗаданиеНаПеревозкуРаспоряжения.ДополнительнаяИнформация,
	|	ЗаданиеНаПеревозкуМаршрут.Адрес,
	|	ЗаданиеНаПеревозкуМаршрут.АдресЗначение,
	|	ЗаданиеНаПеревозкуМаршрут.АдресЗначенияПолей
	|ПОМЕСТИТЬ ВТ_ЗаданиеНаПеревозкуСтроки
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Маршрут КАК ЗаданиеНаПеревозкуМаршрут
	|		ПО ЗаданиеНаПеревозкуРаспоряжения.Ссылка = ЗаданиеНаПеревозкуМаршрут.Ссылка
	|			И ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи = ЗаданиеНаПеревозкуМаршрут.КлючСвязи
	|ГДЕ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен
	|	И (ЗаданиеНаПеревозкуРаспоряжения.ПолучательОтправитель = &ПолучательОтправитель
	|			ИЛИ &ПолучательОтправитель = НЕОПРЕДЕЛЕНО)
	|	И (ЗаданиеНаПеревозкуРаспоряжения.Перевозчик = &Перевозчик
	|			ИЛИ &Перевозчик = НЕОПРЕДЕЛЕНО
	|				И ЗаданиеНаПеревозкуРаспоряжения.Перевозчик = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 3
	|	ВТ_ЗаданиеНаПеревозкуСтроки.Адрес КАК Адрес,
	|	МАКСИМУМ(ВТ_ЗаданиеНаПеревозкуСтроки.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_ПоследниеАдреса
	|ИЗ
	|	ВТ_ЗаданиеНаПеревозкуСтроки КАК ВТ_ЗаданиеНаПеревозкуСтроки
	|ГДЕ
	|	ВТ_ЗаданиеНаПеревозкуСтроки.Адрес <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗаданиеНаПеревозкуСтроки.Адрес
	|
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(ВТ_ЗаданиеНаПеревозкуСтроки.Дата) УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеАдреса.Адрес,
	|	ЗаданиеНаПеревозкуМаршрут.Зона,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.Дата
	|ПОМЕСТИТЬ ВТ_МаршрутыСНужнымиАдресами
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Маршрут КАК ЗаданиеНаПеревозкуМаршрут
	|		ПО ВТ_ПоследниеАдреса.Адрес = ЗаданиеНаПеревозкуМаршрут.Адрес
	|ГДЕ
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеАдреса.Адрес,
	|	МАКСИМУМ(ВТ_МаршрутыСНужнымиАдресами.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_ДатыПоследнихЗонПоАдресам
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаршрутыСНужнымиАдресами КАК ВТ_МаршрутыСНужнымиАдресами
	|		ПО ВТ_ПоследниеАдреса.Адрес = ВТ_МаршрутыСНужнымиАдресами.Адрес
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоследниеАдреса.Адрес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_МаршрутыСНужнымиАдресами.Зона) КАК Зона,
	|	ВТ_ДатыПоследнихЗонПоАдресам.Адрес
	|ПОМЕСТИТЬ ВТ_ПоследниеЗоныПоАдресам
	|ИЗ
	|	ВТ_МаршрутыСНужнымиАдресами КАК ВТ_МаршрутыСНужнымиАдресами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДатыПоследнихЗонПоАдресам КАК ВТ_ДатыПоследнихЗонПоАдресам
	|		ПО (ВТ_ДатыПоследнихЗонПоАдресам.Адрес = ВТ_МаршрутыСНужнымиАдресами.Адрес)
	|			И (ВТ_ДатыПоследнихЗонПоАдресам.Дата = ВТ_МаршрутыСНужнымиАдресами.Дата)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДатыПоследнихЗонПоАдресам.Адрес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеАдреса.Адрес,
	|	МАКСИМУМ(ВТ_ЗаданиеНаПеревозкуСтроки.КлючСвязи) КАК КлючСвязи
	|ПОМЕСТИТЬ ВТ_ПоследниеАдресаКлючиСвязи
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаданиеНаПеревозкуСтроки КАК ВТ_ЗаданиеНаПеревозкуСтроки
	|		ПО (ВТ_ЗаданиеНаПеревозкуСтроки.Адрес = ВТ_ПоследниеАдреса.Адрес)
	|			И (ВТ_ЗаданиеНаПеревозкуСтроки.Дата = ВТ_ПоследниеАдреса.Дата)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоследниеАдреса.Адрес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеАдресаКлючиСвязи.КлючСвязи,
	|	МАКСИМУМ(ВТ_ЗаданиеНаПеревозкуСтроки.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ПоследниеАдресаКлючиСвязиНомераСтрок
	|ИЗ
	|	ВТ_ПоследниеАдресаКлючиСвязи КАК ВТ_ПоследниеАдресаКлючиСвязи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаданиеНаПеревозкуСтроки КАК ВТ_ЗаданиеНаПеревозкуСтроки
	|		ПО (ВТ_ЗаданиеНаПеревозкуСтроки.КлючСвязи = ВТ_ПоследниеАдресаКлючиСвязи.КлючСвязи)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоследниеАдресаКлючиСвязи.Адрес,
	|	ВТ_ПоследниеАдресаКлючиСвязи.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаданиеНаПеревозкуСтроки.Адрес              КАК АдресДоставки,
	|	ВТ_ЗаданиеНаПеревозкуСтроки.АдресЗначение      КАК АдресДоставкиЗначение,
	|	ВТ_ЗаданиеНаПеревозкуСтроки.АдресЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ВТ_ПоследниеЗоныПоАдресам.Зона                 КАК ЗонаДоставки,
	|	ВТ_ЗаданиеНаПеревозкуСтроки.ВремяС             КАК ВремяДоставкиС,
	|	ВТ_ЗаданиеНаПеревозкуСтроки.ВремяПо            КАК ВремяДоставкиПо,
	|	ВТ_ЗаданиеНаПеревозкуСтроки.ДополнительнаяИнформация КАК ДополнительнаяИнформацияПоДоставке
	|ИЗ
	|	ВТ_ЗаданиеНаПеревозкуСтроки КАК ВТ_ЗаданиеНаПеревозкуСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследниеАдресаКлючиСвязиНомераСтрок КАК ВТ_ПоследниеАдресаКлючиСвязиНомераСтрок
	|		ПО ВТ_ЗаданиеНаПеревозкуСтроки.КлючСвязи = ВТ_ПоследниеАдресаКлючиСвязиНомераСтрок.КлючСвязи
	|			И ВТ_ЗаданиеНаПеревозкуСтроки.НомерСтроки = ВТ_ПоследниеАдресаКлючиСвязиНомераСтрок.НомерСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоследниеЗоныПоАдресам КАК ВТ_ПоследниеЗоныПоАдресам
	|		ПО (ВТ_ПоследниеЗоныПоАдресам.Адрес = ВТ_ЗаданиеНаПеревозкуСтроки.Адрес)
	|
	|ГДЕ
	|	ВЫРАЗИТЬ(ВТ_ЗаданиеНаПеревозкуСтроки.АдресЗначенияПолей КАК СТРОКА(10)) = """"
	|	ИЛИ
	|	ВТ_ЗаданиеНаПеревозкуСтроки.АдресЗначенияПолей ПОДОБНО ""%</КонтактнаяИнформация>""
	|	ИЛИ
	|	ВТ_ЗаданиеНаПеревозкуСтроки.АдресЗначение ПОДОБНО ""%}""
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ЗаданиеНаПеревозкуСтроки.Дата УБЫВ,
	|	ВТ_ЗаданиеНаПеревозкуСтроки.Адрес";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПолучательОтправитель", ПолучательОтправитель);
	Запрос.УстановитьПараметр("Перевозчик", Перевозчик);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
	
КонецФункции

// Возвращает порядок доставки по получателю из задания на перевозку.
// Если получатель упоминается несколько раз - берется номер первого пункта,
// если получателя нет в задании, вместо пункта пишется "?".
//
// Параметры:
//	ЗаданиеНаПеревозку	 - ДокументСсылка.ЗаданиеНаПеревозку - ссылка на документ задания на перевозку;
//	Получатель			 - ОпределяемыйТип.ОтправительПолучательДоставки - получатель груза.
//
// Возвращаемое значение:
//	Строка - порядок доставки в формате "%НомерПункта% из %КоличествоПунктов%".
//
Функция ПорядокДоставкиВЗаданииНаПеревозку(ЗаданиеНаПеревозку, Получатель) Экспорт
	
	Если Не ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ЗаданиеНаПеревозкуМаршрут.НомерСтроки) КАК НомерСтроки,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ НомерПункта
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Маршрут КАК ЗаданиеНаПеревозкуМаршрут
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|		ПО ЗаданиеНаПеревозкуМаршрут.Ссылка = ЗаданиеНаПеревозкуРаспоряжения.Ссылка
	|			И ЗаданиеНаПеревозкуМаршрут.КлючСвязи = ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи
	|ГДЕ
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка = &ЗаданиеНаПеревозку
	|	И ЗаданиеНаПеревозкуРаспоряжения.Ссылка = &ЗаданиеНаПеревозку
	|	И ЗаданиеНаПеревозкуРаспоряжения.ПолучательОтправитель = &Получатель
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеНаПеревозку.КоличествоПунктов,
	|	ЕСТЬNULL(НомерПункта.НомерСтроки, 0) КАК НомерПункта
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомерПункта КАК НомерПункта
	|		ПО НомерПункта.Ссылка = ЗаданиеНаПеревозку.Ссылка
	|ГДЕ
	|	ЗаданиеНаПеревозку.Ссылка = &ЗаданиеНаПеревозку";
	
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", ЗаданиеНаПеревозку);
	Запрос.УстановитьПараметр("Получатель", Получатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ПорядокДоставки = НСтр("ru = '%НомерПункта% из %КоличествоПунктов%'");	
		ПорядокДоставки = СтрЗаменить(ПорядокДоставки, "%НомерПункта%", ?(Выборка.НомерПункта = 0, "?", Формат(Выборка.НомерПункта,"ЧЦ=2; ЧВН=")));
		ПорядокДоставки = СтрЗаменить(ПорядокДоставки, "%КоличествоПунктов%", Формат(Выборка.КоличествоПунктов,"ЧЦ=2; ЧВН="));
		
	Иначе
		
		ПорядокДоставки = "";
		
	КонецЕсли;
	
	Возврат ПорядокДоставки;
	
КонецФункции

// Возвращает значение коэффициента из константы, проверяет и выдает сообщение при незаполненности.
// 
// Возвращаемое значение:
//  Число - значение коэффициента.
//
Функция КоэффициентПересчетаВТонны() Экспорт
	
	Возврат НоменклатураСервер.КоэффициентПересчетаВТонны(Константы.ЕдиницаИзмеренияВеса.Получить());
	
КонецФункции

// Возвращает значение коэффициента из константы, проверяет и выдает сообщение при незаполненности.
// Возвращаемое значение:
//		Число
//
Функция КоэффициентПересчетаВКубическиеМетры() Экспорт
	
	Возврат НоменклатураСервер.КоэффициентПересчетаВКубическиеМетры(Константы.ЕдиницаИзмеренияОбъема.Получить());
	
КонецФункции

// Перезаполняет список распоряжений на доставку на форме.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма, для которой необходимо обновить список распоряжений на доставку;
//	ОбновляемыеРаспоряжения - ТаблицаЗначений, Неопределено - фильтр для частичного перезаполнения списка только 
//		по переданным в таблице распоряжениям.
//
Процедура ОбновитьСписокРаспоряженийНаДоставку(Форма, ОбновляемыеРаспоряжения = Неопределено) Экспорт
	
	ДопустимоеОтклонениеПроцент = Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
	
	РаспоряженияНаДоставку 		= Форма.РаспоряженияНаДоставку;
	ТоварыРаспоряженийКДоставке = Форма.ТоварыРаспоряженийКДоставке;
	ОтборПоТипуИсполнителей 	= Форма.ОтборПоТипуИсполнителей;
	Зона 						= Форма.Зона; // СправочникСсылка.ЗоныДоставки
	Склад 						= Форма.Склад; // СправочникСсылка.Склады
	ДатаРаспоряжений 			= Форма.ДатаРаспоряжений; // Дата
	ЗонаГруппаИлиПустая 		= НЕ ЗначениеЗаполнено(Зона) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Зона,"ЭтоГруппа");
	
	ВыборочноеОбновление = (ОбновляемыеРаспоряжения <> Неопределено);
	
	ВесОбъемРаспоряженийПоДатам = Новый ТаблицаЗначений;
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Вес", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Объем", ОбщегоНазначения.ОписаниеТипаЧисло(18,6));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	
	КешДобавляемыхСтрок = Новый Массив;
	
	КоллекцияРаспоряжений = РаспоряженияНаДоставку.ПолучитьЭлементы();
	ВесОбъем = Новый Структура;
	
	Если Не ВыборочноеОбновление Тогда
		ВесОбъем.Вставить("ИтогоВес", 0);
		ВесОбъем.Вставить("ИтогоОбъем",0);
		КоллекцияРаспоряжений.Очистить();
		ТоварыРаспоряженийКДоставке.Очистить();
	Иначе
		СтруктураПоиска = Новый Структура("Склад, Распоряжение");
		
		Для Каждого Стр Из ОбновляемыеРаспоряжения Цикл
			
			// При выборочном обновлении сначала нужно удалить строки обновляемых распоряжений,
			// для этого воспользуемся списком товаров по распоряжениям.
			ПредыдущийИдентификатор = Неопределено;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Стр);
			
			НайденныеСтроки = ТоварыРаспоряженийКДоставке.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаТовары Из НайденныеСтроки Цикл
				Идентификатор = СтрокаТовары.ИдентификаторВДеревеРаспоряжений;
				Если ПредыдущийИдентификатор = Идентификатор
					Или Не ЗначениеЗаполнено(Идентификатор) Тогда
					Продолжить;
				КонецЕсли;
				СтрокаРаспоряжение = РаспоряженияНаДоставку.НайтиПоИдентификатору(Идентификатор);
				Если СтрокаРаспоряжение <> Неопределено Тогда
					Если ЗонаГруппаИлиПустая Тогда
						ТекущаяВетка = СтрокаРаспоряжение.ПолучитьРодителя();
						КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
						// Если удаляем последний элемент в ветке, удалим родителя.
						Если КоллекцияТекущаяВетка.Количество() = 1 Тогда
							КоллекцияРаспоряжений.Удалить(ТекущаяВетка);
						Иначе
							ТекущаяВетка.Вес = ТекущаяВетка.Вес - СтрокаРаспоряжение.Вес;
							ТекущаяВетка.Объем = ТекущаяВетка.Объем - СтрокаРаспоряжение.Объем;
							КоллекцияТекущаяВетка.Удалить(СтрокаРаспоряжение);
						КонецЕсли;
					Иначе
						КоллекцияРаспоряжений.Удалить(СтрокаРаспоряжение);
					КонецЕсли;
				КонецЕсли;
				ТоварыРаспоряженийКДоставке.Удалить(СтрокаТовары);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураЗадание = Новый Структура("ЗаданиеНаПеревозку", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураЗадание, Форма);
	
	Запрос = Новый Запрос;
	ИсходящаяДоставка = Форма.ВидДоставки = Перечисления.ВидыДоставки.СоСклада;
	
	ЕстьОрдерныйНаОтгрузкуСклад      = Ложь;
	ЕстьНеОрдерныйНаОтгрузкуСклад    = Ложь;
	ЕстьОрдерныйНаПоступлениеСклад   = Ложь;
	ЕстьНеОрдерныйНаПоступлениеСклад = Ложь;
	
	Если ИсходящаяДоставка Тогда
		ЕстьОрдерныйНаОтгрузкуСклад = СкладыСервер.ЕстьОрдерныйНаОтгрузкуСклад(Склад);
		ЕстьНеОрдерныйНаОтгрузкуСклад = СкладыСервер.ЕстьНеОрдерныйНаОтгрузкуСклад(Склад);
	Иначе
		ЕстьОрдерныйНаПоступлениеСклад = СкладыСервер.ЕстьОрдерныйНаПоступлениеСклад(Склад);
		ЕстьНеОрдерныйНаПоступлениеСклад = СкладыСервер.ЕстьНеОрдерныйНаПоступлениеСклад(Склад);
	КонецЕсли;
	
	ТекстЗапроса = "";
	Если ИсходящаяДоставка Тогда
		
		ТекстЗапроса = ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление,
			ЕстьОрдерныйНаОтгрузкуСклад,
			ЕстьНеОрдерныйНаОтгрузкуСклад,
			Истина);
		
		Запрос.УстановитьПараметр("СпособыДоставкиНашимиСиламиКПолучателю", СпособыДоставкиНашимиСиламиКПолучателю());
		Запрос.УстановитьПараметр("СпособыДоставкиПеревозчикомКПолучателю", СпособыДоставкиПеревозчикомКПолучателю());
		
	Иначе
		
		ТекстЗапроса = ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление,
			ЕстьОрдерныйНаПоступлениеСклад,
			ЕстьНеОрдерныйНаПоступлениеСклад,
			Ложь);
		
		Запрос.УстановитьПараметр("ДатаОтбора", НачалоДня(ТекущаяДатаСеанса()));
		Запрос.УстановитьПараметр("СпособыДоставкиНашимиСиламиОтОтправителя", СпособыДоставкиНашимиСиламиОтОтправителя());
		Запрос.УстановитьПараметр("СпособыДоставкиПеревозчикомОтОтправителя", СпособыДоставкиПеревозчикомОтОтправителя());
	
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	БезОтбораПоЗоне = Зона = Справочники.ЗоныДоставки.ПустаяСсылка();
	
	Запрос.УстановитьПараметр("Зона",                              Зона);
	Запрос.УстановитьПараметр("Склад",                             Склад);
	Запрос.УстановитьПараметр("БезОтбораПоЗоне",                   БезОтбораПоЗоне);
	Запрос.УстановитьПараметр("ОбновляемыеРаспоряжения",           ОбновляемыеРаспоряжения);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозкуПодбор",          СтруктураЗадание.ЗаданиеНаПеревозку);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозкуПустаяСсылка",    Документы.ЗаданиеНаПеревозку.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусЗаданияЗакрыто",              Перечисления.СтатусыЗаданийНаПеревозку.Закрыто);
	Запрос.УстановитьПараметр("ОтборПоТипуИсполнителей",           ОтборПоТипуИсполнителей);
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса",                 ТекущаяДатаСеанса());
	
	Пакет = Запрос.ВыполнитьПакет();
	РезультатЗапроса = Пакет[Пакет.ВГраница()-1]; // РезультатЗапроса
	ДвиженияКРаспределению = РезультатЗапроса.Выгрузить();
	
	ПоляОтбораДвижений = Новый Массив(); // Массив из Строка
	ПоляОтбораДвижений.Добавить("Распоряжение");
	ПоляОтбораДвижений.Добавить("Склад");
	ПоляОтбораДвижений.Добавить("Номенклатура");
	ПоляОтбораДвижений.Добавить("Характеристика");
	ПоляОтбораДвижений.Добавить("Назначение");
	Если ДвиженияКРаспределению.Колонки.Найти("Серия") <> Неопределено Тогда
		ПоляОтбораДвижений.Добавить("Серия");
	КонецЕсли;
	ПоляОтбораДвиженийКРаспределению = СтрСоединить(ПоляОтбораДвижений, ",");
	
	Если ИсходящаяДоставка
		Или ЕстьОрдерныйНаПоступлениеСклад Тогда
		ДвиженияКРаспределению.Индексы.Добавить(ПоляОтбораДвиженийКРаспределению);
	КонецЕсли;
	
	РезультатЗапроса = Пакет[Пакет.ВГраница()]; // РезультатЗапроса
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Зона") Цикл
		
		Если ВыборочноеОбновление Тогда
			
		ИначеЕсли ЗонаГруппаИлиПустая Тогда
			ТекущаяВетка = КоллекцияРаспоряжений.Добавить();
			ТекущаяВетка.Адрес = Строка(Выборка.Зона);
			ТекущаяВетка.Зона = Выборка.Зона;
			КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
		Иначе
			КоллекцияТекущаяВетка = КоллекцияРаспоряжений;
		КонецЕсли;
		
		ВесПоЗоне = 0;
		ОбъемПоЗоне = 0;
		
		Пока Выборка.СледующийПоЗначениюПоля("Распоряжение") Цикл
			
			Если ВыборочноеОбновление Тогда
				СтруктураЗонаАдрес = Новый Структура("Зона, Адрес");
				ЗаполнитьЗначенияСвойств(СтруктураЗонаАдрес, Выборка);
				ПозицияДляВставки = ПолучитьПозициюДляВставки(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая, СтруктураЗонаАдрес);
				Если ЗонаГруппаИлиПустая Тогда
					ТекущаяВетка = КоллекцияРаспоряжений[ПозицияДляВставки.Зона];
					КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
				Иначе
					КоллекцияТекущаяВетка = КоллекцияРаспоряжений;
				КонецЕсли;
				ПозицияДляВставки = ПозицияДляВставки.Распоряжение;
			КонецЕсли;
			
			Если Выборка.ВидРаспоряжения = Тип("ДокументСсылка.ПоручениеЭкспедитору") Тогда
				
				Если ЗначениеЗаполнено(ДатаРаспоряжений)
					И ЗначениеЗаполнено(Выборка.Дата)
					И НачалоДня(Выборка.Дата) > ДатаРаспоряжений Тогда
					Продолжить;
				КонецЕсли;
				
				Если ВыборочноеОбновление Тогда
					СтрокаРаспоряжение = КоллекцияТекущаяВетка.Вставить(ПозицияДляВставки);
					ПозицияДляВставки = ПозицияДляВставки + 1;
				Иначе
					СтрокаРаспоряжение = КоллекцияТекущаяВетка.Добавить();
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(СтрокаРаспоряжение, Выборка);
				СтрокаРаспоряжение.ПолучательОтправительПредставление = Выборка.ПолучательОтправитель;
				СтрокаРаспоряжение.Время = ДоставкаТоваровКлиентСервер.ПредставлениеВремениДоставки(Выборка.ВремяС, Выборка.ВремяПо);
				
				СтрокаДляХраненияИдентификатора = ТоварыРаспоряженийКДоставке.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДляХраненияИдентификатора, Выборка);
				СтрокаДляХраненияИдентификатора.ИдентификаторВДеревеРаспоряжений = СтрокаРаспоряжение.ПолучитьИдентификатор();
				
				Продолжить;
				
			КонецЕсли;
			
			Пока Выборка.СледующийПоЗначениюПоля("Склад") Цикл
				
				Номенклатура = Неопределено;
				Характеристика = Неопределено;
				Назначение = Неопределено;
				Серия = Неопределено;
				
				ВесОбъемРаспоряженийПоДатам.Очистить();
				КешДобавляемыхСтрок.Очистить();
				ПотребностьПоТовару = 0;
				ПроверитьОтклонение = Ложь;
				
				Пока Выборка.Следующий() Цикл
					
					Если Номенклатура <> Выборка.Номенклатура
					 ИЛИ Характеристика <> Выборка.Характеристика
					 ИЛИ Назначение <> Выборка.Назначение
					 ИЛИ Серия <> Выборка.Серия Тогда
						// перешли к другому товару
						
						Номенклатура = Выборка.Номенклатура;
						Характеристика = Выборка.Характеристика;
						Назначение = Выборка.Назначение;
						Серия = Выборка.Серия;
						
						Если ПроверитьОтклонение Тогда
							ДопустимоеОтклонение = ДопустимоеОтклонениеПроцент/100 * ПотребностьПоТовару;
							// Не нужно выводить строки с мерным товаром, если остаток к доставке не превысил допустимое отклонение;
							Для Каждого Стр Из КешДобавляемыхСтрок Цикл
								Если Стр.Количество <= ДопустимоеОтклонение Тогда
									ВесОбъемРаспоряженийПоДатам.Удалить(Стр);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						КешДобавляемыхСтрок.Очистить();
						ПотребностьПоТовару = 0;
						
						ПроверитьОтклонение = Выборка.МернаяЕдиницаИзмерения И ДопустимоеОтклонениеПроцент > 0;
						
					КонецЕсли;
					
					Если ИсходящаяДоставка Тогда
						
						ОсталосьРаспределить = Выборка.Количество;
						
						ПараметрыОтбора = Новый Структура(ПоляОтбораДвиженийКРаспределению);
						ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
						ДетальныеДанные = ДвиженияКРаспределению.НайтиСтроки(ПараметрыОтбора);
						Для Каждого СтрокаДетальныхДанных Из ДетальныеДанные Цикл
							Списываем = Мин(ОсталосьРаспределить, СтрокаДетальныхДанных.Количество);
							ОсталосьРаспределить = ОсталосьРаспределить - Списываем;
							СтрокаДетальныхДанных.Количество = СтрокаДетальныхДанных.Количество - Списываем;
							
							Если ОсталосьРаспределить = 0 Тогда
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если ОсталосьРаспределить > 0 Тогда
							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка);
							ТекущаяСтрокаВесОбъем.Количество = ОсталосьРаспределить;
							ТекущаяСтрокаВесОбъем.Вес = ОсталосьРаспределить * (Выборка.Вес / Выборка.Количество);
							ТекущаяСтрокаВесОбъем.Объем = ОсталосьРаспределить * (Выборка.Объем / Выборка.Количество);
							
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
							ПотребностьПоТовару = ПотребностьПоТовару + ОсталосьРаспределить;
						КонецЕсли;
						
					ИначеЕсли Не ЕстьОрдерныйНаПоступлениеСклад Тогда
						
						ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
						ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка);
						КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
						ПотребностьПоТовару = ПотребностьПоТовару + Выборка.Количество;
						
					Иначе
						
						ПараметрыОтбора = Новый Структура(ПоляОтбораДвиженийКРаспределению);
						ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
						ДетальныеДанные = ДвиженияКРаспределению.НайтиСтроки(ПараметрыОтбора);
						
						ОсталосьРаспределить = Выборка.Количество;
						// Распределение товаров по датам поступления;
						Для Каждого СтрокаДетальныхДанных Из ДетальныеДанные Цикл
							
							Списываем = Мин(ОсталосьРаспределить, СтрокаДетальныхДанных.Количество);
							ОсталосьРаспределить = ОсталосьРаспределить - Списываем;
							
							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка,,"Количество,Вес,Объем");
							ТекущаяСтрокаВесОбъем.Дата = СтрокаДетальныхДанных.Период;
							ТекущаяСтрокаВесОбъем.Количество = Списываем;
							ТекущаяСтрокаВесОбъем.Вес = Списываем * СтрокаДетальныхДанных.Вес / СтрокаДетальныхДанных.Количество;
							ТекущаяСтрокаВесОбъем.Объем = Списываем * СтрокаДетальныхДанных.Объем / СтрокаДетальныхДанных.Количество;
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
							
							Если ОсталосьРаспределить <= 0 Тогда
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
						Если ОсталосьРаспределить > 0 Тогда
							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка,,"Количество,Вес,Объем");
							ТекущаяСтрокаВесОбъем.Дата = НачалоДня(ТекущаяДатаСеанса());
							ТекущаяСтрокаВесОбъем.Количество = ОсталосьРаспределить;
							ТекущаяСтрокаВесОбъем.Вес = ОсталосьРаспределить 	* Выборка.Вес 	/ Выборка.Количество;
							ТекущаяСтрокаВесОбъем.Объем = ОсталосьРаспределить 	* Выборка.Объем / Выборка.Количество;
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
						КонецЕсли;
						ПотребностьПоТовару = ПотребностьПоТовару + Выборка.Количество;
					КонецЕсли;
				КонецЦикла;
				
				// Нужно проверить последний добавленный товар распоряжения;
				Если ПроверитьОтклонение Тогда
					ДопустимоеОтклонение = ДопустимоеОтклонениеПроцент/100 * ПотребностьПоТовару;
					// Не нужно выводить строки с мерным товаром, если остаток к доставке не превысил допустимое отклонение;
					Для Каждого Стр Из КешДобавляемыхСтрок Цикл
						Если Стр.Количество <= ДопустимоеОтклонение Тогда
							ВесОбъемРаспоряженийПоДатам.Удалить(Стр);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				ВесОбъемРаспоряженийПоДатам.Сортировать("Дата");
				
				ТекущаяДата = Неопределено;
				
				Для Каждого СтрокаВесОбъемДата Из ВесОбъемРаспоряженийПоДатам Цикл
					
					Если ЗначениеЗаполнено(ДатаРаспоряжений)
						И СтрокаВесОбъемДата.Дата > ДатаРаспоряжений Тогда
						Прервать;
					КонецЕсли;
					
					СтрокаТовар = ТоварыРаспоряженийКДоставке.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТовар, Выборка);
					ЗаполнитьЗначенияСвойств(СтрокаТовар, СтрокаВесОбъемДата);
					
					Если ТекущаяДата <> СтрокаВесОбъемДата.Дата Тогда
						
						ТекущаяДата = СтрокаВесОбъемДата.Дата;
						
						Если ВыборочноеОбновление Тогда
							СтрокаРаспоряжение = КоллекцияТекущаяВетка.Вставить(ПозицияДляВставки);
							ПозицияДляВставки = ПозицияДляВставки + 1;
						Иначе
							СтрокаРаспоряжение = КоллекцияТекущаяВетка.Добавить();
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(СтрокаРаспоряжение, Выборка);
						
						Если СтрокаРаспоряжение.Свойство("АдресДоставкиЗначенияПолей") Тогда
							СтрокаРаспоряжение.АдресДоставкиЗначенияПолей = Выборка.АдресЗначенияПолей;
						КонецЕсли;
						
						СтрокаРаспоряжение.Дата = ТекущаяДата;
						СтрокаРаспоряжение.Вес = 0;
						СтрокаРаспоряжение.Объем = 0;
						
						СтрокаРаспоряжение.ПолучательОтправительПредставление = ДоставкаТоваровКлиентСервер.ПредставлениеПолучателяОтправителя(
							Выборка.ПолучательОтправитель, Выборка.Перевозчик, Форма.ВидДоставки);
						СтрокаРаспоряжение.Время = ДоставкаТоваровКлиентСервер.ПредставлениеВремениДоставки(
							Выборка.ВремяС, Выборка.ВремяПо);
						
						ИдентификаторВДеревеРаспоряжений = СтрокаРаспоряжение.ПолучитьИдентификатор();
						
					КонецЕсли;
					
					СтрокаТовар.ИдентификаторВДеревеРаспоряжений = ИдентификаторВДеревеРаспоряжений;
					
					СтрокаРаспоряжение.Вес = СтрокаРаспоряжение.Вес + СтрокаВесОбъемДата.Вес;
					СтрокаРаспоряжение.Объем = СтрокаРаспоряжение.Объем + СтрокаВесОбъемДата.Объем;
					
					ВесПоЗоне   = ВесПоЗоне   + СтрокаВесОбъемДата.Вес;
					ОбъемПоЗоне = ОбъемПоЗоне + СтрокаВесОбъемДата.Объем;
					
				КонецЦикла;
				
			КонецЦикла; // Склад
		КонецЦикла; // Распоряжение
		
		Если Не ВыборочноеОбновление Тогда
			ВесОбъем.ИтогоВес = ВесОбъем.ИтогоВес + ВесПоЗоне;
			ВесОбъем.ИтогоОбъем = ВесОбъем.ИтогоОбъем  + ОбъемПоЗоне;
		КонецЕсли;
		
		Если ЗонаГруппаИлиПустая Тогда
			
			Если КоллекцияТекущаяВетка.Количество() = 0 Тогда
				КоллекцияРаспоряжений.Удалить(ТекущаяВетка);
			Иначе
				Если ВыборочноеОбновление Тогда
					ТекущаяВетка.Вес   = ТекущаяВетка.Вес + ВесПоЗоне;
					ТекущаяВетка.Объем = ТекущаяВетка.Объем + ОбъемПоЗоне;
				Иначе
					ТекущаяВетка.Вес   = ВесПоЗоне;
					ТекущаяВетка.Объем = ОбъемПоЗоне;
				КонецЕсли;
				ТекущаяВетка.ОформлениеСтроки = 5;
				ТекущаяВетка.Зона = Выборка.Зона;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла; // Зона
	
	ЗаполнитьЗначенияСвойств(Форма, ВесОбъем);
	ЗаполнитьПризнакиОформленияРаспоряжений(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая);
	
КонецПроцедуры

// Заполняет признаки оформления в дереве распоряжений на доставку.
// Параметры:
//	РаспоряженияНаДоставку - ДанныеФормыДерево - распоряжения на доставку,
//  ЗонаГруппаИлиПустая - Булево - признак того, что в отборе по зоне доставки установлена группа или этот отбор не заполнен.
//
Процедура ЗаполнитьПризнакиОформленияРаспоряжений(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая) Экспорт
	
	ВерхниеСтрокиДерева = РаспоряженияНаДоставку.ПолучитьЭлементы();
	Если ЗонаГруппаИлиПустая Тогда
		Для каждого СтрокаЗонаДоставки Из ВерхниеСтрокиДерева Цикл
			ЗаполнитьПризнакиОформленияРаспоряженийНижнийУровень(СтрокаЗонаДоставки.ПолучитьЭлементы())
		КонецЦикла;
	Иначе
		ЗаполнитьПризнакиОформленияРаспоряженийНижнийУровень(ВерхниеСтрокиДерева)
	КонецЕсли;
	
КонецПроцедуры

// Перезаполняет задание на перевозку в соответствии со связанными расходными ордерами на товары.
//
// Параметры:
//  ЗаданиеОбъект - ДокументОбъект.ЗаданиеНаПеревозку, ДанныеФормыСтруктура: см. Документ.ЗаданиеНаПеревозку.Форма.ФормаДокумента.Объект - документ задания на перевозку;
//  ТоварыКДоставке - ДанныеФормыКоллекция, Неопределено - коллекция с данными по доставляемым товарам.
// 
// Возвращаемое значение:
//  Булево - признак корректного перезаполнения.
//
Функция ПерезаполнитьЗаданиеНаПеревозкуПоРасходнымОрдерам(ЗаданиеОбъект, ТоварыКДоставке = Неопределено) Экспорт
	
	Запрос = Новый Запрос(ТекстЗапросаЗаполненияЗаданияНаПеревозкуПоРасходнымОрдерам());
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеОбъект.Ссылка);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозкуРаспоряжения", ЗаданиеОбъект.Распоряжения.Выгрузить());
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозкуМаршрут", ЗаданиеОбъект.Маршрут.Выгрузить());
	Запрос.УстановитьПараметр("ДатаВремяРейсаПланС", ЗаданиеОбъект.ДатаВремяРейсаПланС);
	СпособыДоставки = Новый Массив; // Массив из ПеречислениеСсылка.СпособыДоставки
	СпособыДоставки.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу);
	СпособыДоставки.Добавить(Перечисления.СпособыДоставки.ДоКлиента);
	СпособыДоставки.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками") Тогда
		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчика);
	КонецЕсли;
	Запрос.УстановитьПараметр("СпособыДоставки", СпособыДоставки);
	Запрос.УстановитьПараметр("ДоставкаСиламиПеревозчикаПоАдресу", Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу);
	
	Результат = Запрос.ВыполнитьПакет();
	ВГраница = Результат.ВГраница();
	
	ЕстьИзменения = Ложь;
	
	// Изменяем
	Выборка = Результат[ВГраница-2].Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаРаспоряжений = ЗаданиеОбъект.Распоряжения[Выборка.НомерСтроки - 1];
		СтрокаМаршрута = ЗаданиеОбъект.Маршрут[Выборка.МаршрутНомерСтроки - 1];
		СтрокаМаршрута.Вес = СтрокаМаршрута.Вес + (Выборка.Вес - СтрокаРаспоряжений.Вес);
		СтрокаМаршрута.Объем = СтрокаМаршрута.Объем + (Выборка.Объем - СтрокаРаспоряжений.Объем);
		ЗаполнитьЗначенияСвойств(СтрокаРаспоряжений, Выборка);
		ЕстьИзменения = Истина;
	КонецЦикла;
	
	// Удаляем строки распоряжений
	// Выборка упорядочена по убыванию номеров строк распоряжений.
	Выборка = Результат[ВГраница-4].Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаРаспоряжений = ЗаданиеОбъект.Распоряжения[Выборка.НомерСтроки - 1];
		СтрокаМаршрута = ЗаданиеОбъект.Маршрут[Выборка.МаршрутНомерСтроки - 1];
		СтрокаМаршрута.Вес = СтрокаМаршрута.Вес - СтрокаРаспоряжений.Вес;
		СтрокаМаршрута.Объем = СтрокаМаршрута.Объем - СтрокаРаспоряжений.Объем;
		ЗаданиеОбъект.Распоряжения.Удалить(Выборка.НомерСтроки - 1);
		ЕстьИзменения = Истина;
	КонецЦикла;
	
	// Удаляем пункты маршрута
	// Выборка упорядочена по убыванию номеров строк маршрута.
	Выборка = Результат[ВГраница-3].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаданиеОбъект.Маршрут.Удалить(Выборка.МаршрутНомерСтроки - 1);
		ЕстьИзменения = Истина;
	КонецЦикла;
	
	// Добавляем новые
	Выборка = Результат[ВГраница-1].Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаРаспоряжений = ЗаданиеОбъект.Распоряжения.Добавить();
		СтрокаМаршрута = ДобавитьИзменитьПунктПоРеквизитамДоставки(ЗаданиеОбъект.Маршрут, Выборка, ЗаданиеОбъект.ДатаВремяРейсаПланС);
		ЗаполнитьЗначенияСвойств(СтрокаРаспоряжений, Выборка);
		СтрокаРаспоряжений.КлючСвязи = СтрокаМаршрута.КлючСвязи;
		ЕстьИзменения = Истина;
	КонецЦикла;
	
	ТаблицаТоварыКДоставке = Результат[ВГраница].Выгрузить();
	// Заполняем ТоварыКДоставке
	Если ТоварыКДоставке <> Неопределено Тогда
		
		ТоварыКДоставке.Загрузить(ТаблицаТоварыКДоставке);
		
	Иначе
		
		ЗаданиеОбъект.ДополнительныеСвойства.Вставить("ТоварыКДоставке", ТаблицаТоварыКДоставке);
		
	КонецЕсли;
	
	Для Каждого Стр Из ЗаданиеОбъект.Распоряжения Цикл
		Стр.ДоставляетсяПолностью = Ложь;
	КонецЦикла;
	ЗаполнитьПризнакДоставляетсяПолностью(ТаблицаТоварыКДоставке, ЗаданиеОбъект.Распоряжения);
	
	Возврат ЕстьИзменения;
	
КонецФункции

// Добавляет или изменяет пункт доставки в соответствии в реквизитами доставки распоряжения на доставку.
//
// Параметры:
//  КоллекцияМаршрут	 - ДанныеФормыКоллекция - коллекция, в которую добавляем пункт;
//  РеквизитыДоставки	 - Структура, ВыборкаИзРезультатаЗапроса, ДанныеФормыЭлементДерева	 - со свойствами:
//  	* Адрес - Строка - адрес доставки;
//  	* Вес - Число - вес груза;
//  	* Объем - Число - объем груза.
//  ДатаВремяРейсаПланС	 - Дата - дата планового начала рейса.
// 
// Возвращаемое значение:
//  ДанныеФормыЭлементДерева, ДанныеФормыЭлементКоллекции - строка-пункт доставки. Содержит в том числе:
//  	* Ссылка - ДокументСсылка.ЗаданиеНаПеревозку
//
Функция ДобавитьИзменитьПунктПоРеквизитамДоставки(КоллекцияМаршрут, РеквизитыДоставки, ДатаВремяРейсаПланС) Экспорт
	
	СтруктураРеквизиты = Новый Структура("Адрес, АдресДоставки, АдресЗначенияПолей, Зона, ЗонаДоставки, ДополнительнаяИнформация, ДополнительнаяИнформацияПоДоставке, Вес, Объем, ВремяС, ВремяПо");
	ЗаполнитьЗначенияСвойств(СтруктураРеквизиты, РеквизитыДоставки);
	СтруктураРеквизиты.Адрес = ?(ЗначениеЗаполнено(СтруктураРеквизиты.АдресДоставки),СтруктураРеквизиты.АдресДоставки, СтруктураРеквизиты.Адрес);
	СтруктураРеквизиты.Зона = ?(ЗначениеЗаполнено(СтруктураРеквизиты.ЗонаДоставки),СтруктураРеквизиты.ЗонаДоставки, СтруктураРеквизиты.Зона);
	СтруктураРеквизиты.ДополнительнаяИнформация = ?(ЗначениеЗаполнено(СтруктураРеквизиты.ДополнительнаяИнформацияПоДоставке),СтруктураРеквизиты.ДополнительнаяИнформацияПоДоставке, СтруктураРеквизиты.ДополнительнаяИнформация);
	
	АдресСравнения = Врег(СокрЛП(СтруктураРеквизиты.Адрес));
	АдресСравнения = СтрЗаменить(АдресСравнения," ","");
	
	Для Каждого СтрокаМаршрута Из КоллекцияМаршрут Цикл
		
		АдресСравненияМаршрут = СтрЗаменить(Врег(СокрЛП(СтрокаМаршрута.Адрес))," ","");
		
		Если АдресСравнения = АдресСравненияМаршрут Тогда
			
			СтрокаМаршрута.Вес = СтрокаМаршрута.Вес + СтруктураРеквизиты.Вес;
			СтрокаМаршрута.Объем = СтрокаМаршрута.Объем + СтруктураРеквизиты.Объем;
			СтрокаМаршрута.ДополнительнаяИнформация = ДополнитьТекстРаспоряжениемИДопИнфо(СтрокаМаршрута.ДополнительнаяИнформация,
				СтруктураРеквизиты.ДополнительнаяИнформация,РеквизитыДоставки.Распоряжение);
			
			Возврат СтрокаМаршрута;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаМаршрута = КоллекцияМаршрут.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаМаршрута, СтруктураРеквизиты);
	СтрокаМаршрута.КлючСвязи = Новый УникальныйИдентификатор;
	
	СтрокаМаршрута.ДополнительнаяИнформация = ДополнитьТекстРаспоряжениемИДопИнфо(
		"", СтруктураРеквизиты.ДополнительнаяИнформация,РеквизитыДоставки.Распоряжение);
	
	Если КоллекцияМаршрут.Количество() = 1 Тогда
		
		СтрокаМаршрута.ВремяС = ДатаВремяРейсаПланС;
		СтрокаМаршрута.ВремяПо = СтрокаМаршрута.ВремяС;
		
	Иначе
		
		СтрокаМаршрута.ВремяС = КоллекцияМаршрут[КоллекцияМаршрут.Индекс(СтрокаМаршрута) - 1].ВремяПо;
		СтрокаМаршрута.ВремяПо = СтрокаМаршрута.ВремяС;
	
	КонецЕсли;
	
	Если ТипЗнч(КоллекцияМаршрут) = Тип("ДанныеФормыКоллекция") Тогда
		СтрокаМаршрута.ВремяСБезДаты  = ДоставкаТоваровКлиентСервер.ВремяБезДаты(СтрокаМаршрута.ВремяС);
		СтрокаМаршрута.ВремяПоБезДаты = ДоставкаТоваровКлиентСервер.ВремяБезДаты(СтрокаМаршрута.ВремяПо);
	КонецЕсли;
	
	Возврат СтрокаМаршрута;
	
КонецФункции

// Рассчитывает и возвращает максимальное время планируемого окончания доставки по пунктам.
//
// Параметры:
//  Объект - ДокументОбъект.ЗаданиеНаПеревозку -
//  	   - ДанныеФормыСтруктура: см. Документ.ЗаданиеНаПеревозку.Форма.ФормаДокумента.Объект
//
// Возвращаемое значение:
//	Дата - время окончания доставки по пунктам.
//
Функция МаксимальноеВремяПо(Объект) Экспорт
	
	Если Объект.Маршрут.Количество() <> 0 Тогда
		ТаблицаМаршрута = Объект.Маршрут.Выгрузить();
		ТаблицаМаршрута.Сортировать("ВремяПо Убыв");
		
		Возврат Макс(Объект.ДатаВремяРейсаПланС, ТаблицаМаршрута[0].ВремяПо);
	Иначе
		Возврат Объект.ДатаВремяРейсаПланС;
	КонецЕсли;
	
КонецФункции

// Возвращает таблицу значений с колонками, скопированными из переданной коллекции.
//
// Параметры:
//  Коллекция	 - ДанныеФормыДерево, ДанныеФормыКоллекция, ТаблицаЗначений	 - источник данных, колонки которого
//  	необходимо копировать.
//  ИменаКолонок - Строка													 - имена копируемых колонок, перечисленные через запятую.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - скопированная таблица.
//
Функция СкопироватьКолонкиКоллекции(Коллекция, ИменаКолонок) Экспорт
	
	Если ТипЗнч(Коллекция) = Тип("ДанныеФормыДерево") Тогда
		ЭлементыДерева = Коллекция.ПолучитьЭлементы();
		Если ЭлементыДерева.Количество() > 0 Тогда
			СтрокаДляКопированияТипов = ЭлементыДерева[0];
		Иначе
			КоллекцияДляКопирования = ДанныеФормыВЗначение(Коллекция, Тип("ДеревоЗначений")).Строки; // ДеревоЗначений, ТаблицаЗначений
			СтрокаДляКопированияТипов = КоллекцияДляКопирования.Добавить();
		КонецЕсли;
	ИначеЕсли ТипЗнч(Коллекция) = Тип("ДанныеФормыКоллекция") Тогда
		Если Коллекция.Количество() > 0 Тогда
			СтрокаДляКопированияТипов = Коллекция[0];
		Иначе
			Возврат ДанныеФормыВЗначение(Коллекция, Тип("ТаблицаЗначений"));
		КонецЕсли;
	Иначе // ТаблицаЗначений
		Возврат Коллекция.СкопироватьКолонки();
	КонецЕсли;
	
	СтруктураКолонок = Новый Структура(ИменаКолонок);
	ЗаполнитьЗначенияСвойств(СтруктураКолонок, СтрокаДляКопированияТипов);
	
	Таблица = Новый ТаблицаЗначений;
	МассивТипов = Новый Массив(1);
	Для Каждого КлючИЗначение Из СтруктураКолонок Цикл
		Если КлючИЗначение.Ключ = "Распоряжение" Тогда
			Таблица.Колонки.Добавить(КлючИЗначение.Ключ, Метаданные.ОпределяемыеТипы.РаспоряжениеНаДоставку.Тип);
		ИначеЕсли  КлючИЗначение.Ключ = "ПолучательОтправитель" Тогда
			Таблица.Колонки.Добавить(КлючИЗначение.Ключ, Метаданные.ОпределяемыеТипы.ОтправительПолучательДоставки.Тип);
		Иначе
			МассивТипов[0] = ТипЗнч(КлючИЗначение.Значение);
			Таблица.Колонки.Добавить(КлючИЗначение.Ключ, Новый ОписаниеТипов(МассивТипов));
		КонецЕсли;
	КонецЦикла;
	Возврат Таблица;
	
КонецФункции

// Добавляет или замещает записи в регистре сведений ТоварыКДоставке по заданию на перевозку.
//
// Параметры:
//	ТоварыРаспоряжений - ТаблицаЗначений, ДанныеФормыКоллекция - источник данных для заполнения;
//	ТЧРаспоряжения - ДанныеФормыКоллекция - табличная часть с распоряжениями;
//	ЗаданиеНаПеревозку - ДокументСсылка.ЗаданиеНаПеревозку - ссылка на документ задания на перевозку.
//
Процедура ЗаписатьТоварыКДоставке(ТоварыРаспоряжений, ТЧРаспоряжения, ЗаданиеНаПеревозку) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Т.Распоряжение,
	|	Т.Склад,
	|	ИСТИНА КАК ВсеТовары
	|ПОМЕСТИТЬ ПолностьюДоставляемыеРаспоряжения
	|ИЗ
	|	&ПолностьюДоставляемыеРаспоряжения КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКДоставке.Распоряжение,
	|	ТоварыКДоставке.Склад,
	|	ТоварыКДоставке.Номенклатура,
	|	ТоварыКДоставке.Характеристика,
	|	ТоварыКДоставке.Назначение,
	|	ТоварыКДоставке.Серия,
	|	ТоварыКДоставке.Количество,
	|	ТоварыКДоставке.ВсеТовары,
	|	ТоварыКДоставке.ПолучательОтправитель
	|ПОМЕСТИТЬ ВТТоварыЗадания
	|ИЗ
	|	&ТоварыКДоставке КАК ТоварыКДоставке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТоварыЗадания.Распоряжение,
	|	ВТТоварыЗадания.Склад,
	|	ВТТоварыЗадания.ВсеТовары
	|ПОМЕСТИТЬ РаспоряженияЗадания
	|ИЗ
	|	ВТТоварыЗадания КАК ВТТоварыЗадания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Распоряжение,
	|	Т.ПолучательОтправитель,
	|	Т.Номенклатура,
	|	Т.Склад,
	|	Т.Назначение,
	|	Т.Характеристика,
	|	Т.Серия,
	|	СУММА(Т.Количество) КАК Количество,
	|	МАКСИМУМ(Т.ВсеТовары) КАК ВсеТовары
	|ПОМЕСТИТЬ ТоварыЗадания
	|ИЗ
	|	ВТТоварыЗадания КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Распоряжение,
	|	Т.ПолучательОтправитель,
	|	Т.Номенклатура,
	|	Т.Склад,
	|	Т.Назначение,
	|	Т.Характеристика,
	|	Т.Серия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Т.Распоряжение,
	|	Т.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Распоряжение,
	|	Т.Склад
	|ПОМЕСТИТЬ ИзмененныеРаспоряжения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКДоставке.Распоряжение КАК Распоряжение,
	|		ТоварыКДоставке.Склад КАК Склад,
	|		ТоварыКДоставке.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставке.Характеристика КАК Характеристика,
	|		ТоварыКДоставке.Назначение КАК Назначение,
	|		ТоварыКДоставке.Серия КАК Серия,
	|		ТоварыКДоставке.Количество КАК Количество,
	|		1 КАК СчетИзмененныхСтрок
	|	ИЗ
	|		РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|	ГДЕ
	|		ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыЗадания.Распоряжение,
	|		ТоварыЗадания.Склад,
	|		ТоварыЗадания.Номенклатура,
	|		ТоварыЗадания.Характеристика,
	|		ТоварыЗадания.Назначение,
	|		ТоварыЗадания.Серия,
	|		-ТоварыЗадания.Количество,
	|		-1
	|	ИЗ
	|		ТоварыЗадания КАК ТоварыЗадания) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Распоряжение,
	|	Т.Характеристика,
	|	Т.Назначение,
	|	Т.Серия,
	|	Т.Номенклатура,
	|	Т.Склад
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Т.Количество) <> 0
	|		ИЛИ СУММА(Т.СчетИзмененныхСтрок) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИзмененныеРаспоряжения.Распоряжение,
	|	ИзмененныеРаспоряжения.Склад
	|ПОМЕСТИТЬ ИзмененныеРаспоряженияСвернутые
	|ИЗ
	|	ИзмененныеРаспоряжения КАК ИзмененныеРаспоряжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ИзмененныеРаспоряженияСвернутые.Распоряжение,
	|	ИзмененныеРаспоряженияСвернутые.Склад,
	|	ТоварыЗадания.Номенклатура,
	|	ТоварыЗадания.Характеристика,
	|	ТоварыЗадания.Назначение,
	|	ТоварыЗадания.Серия,
	|	ТоварыЗадания.Количество,
	|	ЕСТЬNULL(ПолностьюДоставляемыеРаспоряжения.ВсеТовары, ТоварыЗадания.ВсеТовары) КАК ВсеТовары,
	|	ТоварыЗадания.ПолучательОтправитель,
	|	ВЫБОР
	|		КОГДА ТоварыЗадания.Распоряжение ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Удалить
	|ИЗ
	|	ИзмененныеРаспоряженияСвернутые КАК ИзмененныеРаспоряженияСвернутые
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыЗадания КАК ТоварыЗадания
	|		ПО ИзмененныеРаспоряженияСвернутые.Распоряжение = ТоварыЗадания.Распоряжение
	|			И ИзмененныеРаспоряженияСвернутые.Склад = ТоварыЗадания.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПолностьюДоставляемыеРаспоряжения КАК ПолностьюДоставляемыеРаспоряжения
	|		ПО ИзмененныеРаспоряженияСвернутые.Распоряжение = ПолностьюДоставляемыеРаспоряжения.Распоряжение
	|			И ИзмененныеРаспоряженияСвернутые.Склад = ПолностьюДоставляемыеРаспоряжения.Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыЗадания.Распоряжение,
	|	ТоварыЗадания.Склад";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку", ЗаданиеНаПеревозку);
	Запрос.УстановитьПараметр("ПолностьюДоставляемыеРаспоряжения",
		ТЧРаспоряжения.Выгрузить(Новый Структура("ДоставляетсяПолностью", Истина), "Распоряжение,Склад"));
	Запрос.УстановитьПараметр("ТоварыКДоставке", ТоварыРаспоряжений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Распоряжение") Цикл
		Пока Выборка.СледующийПоЗначениюПоля("Склад") Цикл
			
			НаборЗаписейУдалить = РегистрыСведений.ТоварыКДоставке.СоздатьНаборЗаписей();
			НаборЗаписейУдалить.Отбор.Склад.Установить(Выборка.Склад);
			НаборЗаписейУдалить.Отбор.Распоряжение.Установить(Выборка.Распоряжение);
			НаборЗаписейУдалить.Отбор.Номенклатура.Установить(Справочники.Номенклатура.ПустаяСсылка());
			НаборЗаписейУдалить.Отбор.Характеристика.Установить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
			НаборЗаписейУдалить.Отбор.Назначение.Установить(Справочники.Назначения.ПустаяСсылка());
			НаборЗаписейУдалить.Отбор.Серия.Установить(Справочники.СерииНоменклатуры.ПустаяСсылка());
			НаборЗаписейУдалить.Записать();
			
			Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
				
				НаборЗаписейУдалить = РегистрыСведений.ТоварыКДоставке.СоздатьНаборЗаписей();
				НаборЗаписейУдалить.Отбор.Склад.Установить(Выборка.Склад);
				НаборЗаписейУдалить.Отбор.Распоряжение.Установить(Выборка.Распоряжение);
				НаборЗаписейУдалить.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
				НаборЗаписейУдалить.Отбор.Характеристика.Установить(Выборка.Характеристика);
				НаборЗаписейУдалить.Отбор.Назначение.Установить(Выборка.Назначение);
				НаборЗаписейУдалить.Отбор.Серия.Установить(Выборка.Серия);
				НаборЗаписейУдалить.Записать();
				
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ТоварыКДоставке.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЗаданиеНаПеревозку.Установить(ЗаданиеНаПеревозку);
			НаборЗаписей.Отбор.Распоряжение.Установить(Выборка.Распоряжение);
			НаборЗаписей.Отбор.Склад.Установить(Выборка.Склад);
			Если Не Выборка.Удалить Тогда
				Если Выборка.ВсеТовары Тогда
					ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(),Выборка,"ЗаданиеНаПеревозку,ПолучательОтправитель,Склад,Распоряжение,ВсеТовары");
				Иначе
					Пока Выборка.Следующий() Цикл
						ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(),Выборка);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Рассчитывает, полностью ли доставляется распоряжение по складу и заполняет соответствующий признак.
//
// Параметры:
//	ТоварыРаспоряжений - ТаблицаЗначений - товары распоряжений на доставку;
//	ТЧРаспоряжения - ДанныеФормыКоллекция - табличная часть с распоряжениями для заполнения признака ДоставляетсяПолностью;
//	СтрокиТЧКЗаполнению - Массив, Неопределено - строки, табличной части распоряжения.
//
Процедура ЗаполнитьПризнакДоставляетсяПолностью(ТоварыРаспоряжений, ТЧРаспоряжения, СтрокиТЧКЗаполнению = Неопределено) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Т.НомерСтроки,
	|	Т.Распоряжение,
	|	Т.Склад,
	|	Т.ДоставляетсяПолностью
	|ПОМЕСТИТЬ ТЧРаспоряжения
	|ИЗ
	|	&ТЧРаспоряжения КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКДоставке.Распоряжение,
	|	ТоварыКДоставке.Склад,
	|	ТоварыКДоставке.Номенклатура,
	|	ТоварыКДоставке.Характеристика,
	|	ТоварыКДоставке.Назначение,
	|	ТоварыКДоставке.Серия,
	|	ТоварыКДоставке.Количество,
	|	ТоварыКДоставке.ВсеТовары,
	|	ТоварыКДоставке.ПолучательОтправитель
	|ПОМЕСТИТЬ ВТТоварыЗадания
	|ИЗ
	|	&ТоварыКДоставке КАК ТоварыКДоставке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТоварыЗадания.Распоряжение,
	|	ВТТоварыЗадания.Склад,
	|	ВТТоварыЗадания.ВсеТовары
	|ПОМЕСТИТЬ РаспоряженияЗадания
	|ИЗ
	|	ВТТоварыЗадания КАК ВТТоварыЗадания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Распоряжение КАК Распоряжение,
	|	Т.ПолучательОтправитель КАК ПолучательОтправитель,
	|	Т.Склад КАК Склад,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Назначение КАК Назначение,
	|	Т.Серия КАК Серия,
	|	СУММА(Т.Количество) КАК Количество,
	|	МАКСИМУМ(Т.ВсеТовары) КАК ВсеТовары
	|ПОМЕСТИТЬ ТоварыЗадания
	|ИЗ
	|	ВТТоварыЗадания КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Распоряжение,
	|	Т.ПолучательОтправитель,
	|	Т.Номенклатура,
	|	Т.Склад,
	|	Т.Назначение,
	|	Т.Характеристика,
	|	Т.Серия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Т.Распоряжение,
	|	Т.Склад";
	
	ШаблонТекстаЗапросаПоРаспоряжению =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка,
	|	Шапка.Партнер КАК ПолучательОтправитель,
	|	ТЧ.Склад КАК Склад,
	|	ТЧ.Номенклатура,
	|	ТЧ.Характеристика,
	|	ТЧ.Назначение КАК Назначение,
	|	ТЧ.Серия,
	|	ТЧ.Количество КАК Количество
	|ПОМЕСТИТЬ ТоварыРаспоряжений
	|ИЗ
	|	Документ.ЗаказКлиента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ТЧ
	|		ПО Шапка.Ссылка = ТЧ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияЗадания КАК РаспоряженияЗадания
	|		ПО (РаспоряженияЗадания.Распоряжение = Шапка.Ссылка)
	|			И (РаспоряженияЗадания.Склад = ТЧ.Склад)
	|			И (НЕ РаспоряженияЗадания.ВсеТовары)";
	
	ТекстРаспоряженияНаДоставку = "";
	
	ТекстОбъединитьВсе = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	ЭтоПервый = Истина;
	ОписанияРаспоряженийНаДоставку = ДоставкаТоваровКлиентСервер.ОписанияРаспоряженийНаДоставку();
	Для Каждого Описание Из ОписанияРаспоряженийНаДоставку Цикл
		
		ТекстПоРаспоряжению = СтрЗаменить(ШаблонТекстаЗапросаПоРаспоряжению, "ЗаказКлиента", Описание.Имя);
		ТекстПоРаспоряжению = СтрЗаменить(ТекстПоРаспоряжению, ".Товары",                    "." + Описание.ИмяТЧ);
		ТекстПоРаспоряжению = СтрЗаменить(ТекстПоРаспоряжению, "Партнер КАК ПолучательОтправитель",     Описание.ИмяПоляПолучательОтправитель + " КАК ПолучательОтправитель");
		ТекстПоРаспоряжению = СтрЗаменить(ТекстПоРаспоряжению, "ТЧ.Склад",                   Описание.ИмяПоляСклад);
		ТекстПоРаспоряжению = СтрЗаменить(ТекстПоРаспоряжению, "ТЧ.Назначение",              Описание.ИмяПоляНазначение);
		ТекстПоРаспоряжению = СтрЗаменить(ТекстПоРаспоряжению, "ТЧ.Серия",                   Описание.ИмяПоляСерия);
		
		Если ЭтоПервый Тогда
			ЭтоПервый = Ложь;
		Иначе
			ТекстПоРаспоряжению = СтрЗаменить(ТекстПоРаспоряжению, "РАЗРЕШЕННЫЕ", "");
			ТекстПоРаспоряжению = СтрЗаменить(ТекстПоРаспоряжению, "ПОМЕСТИТЬ ТоварыРаспоряжений","");
			ТекстРаспоряженияНаДоставку = ТекстРаспоряженияНаДоставку + ТекстОбъединитьВсе;
		КонецЕсли;
		
		ТекстРаспоряженияНаДоставку = ТекстРаспоряженияНаДоставку + ТекстПоРаспоряжению;
		
	КонецЦикла;
	
	ТекстЗапросаПоСоглашениям =
	"ВЫБРАТЬ
	|	СоглашенияСПоставщиками.Ссылка,
	|	СоглашенияСПоставщиками.Партнер,
	|	СоглашенияСПоставщиками.Склад,
	|	ТоварыКПоступлениюОстатки.Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика,
	|	ТоварыКПоступлениюОстатки.Назначение,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток
	|ИЗ
	|	Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияЗадания КАК РаспоряженияЗадания
	|		ПО (РаспоряженияЗадания.Распоряжение = СоглашенияСПоставщиками.Ссылка)
	|			И (НЕ РаспоряженияЗадания.ВсеТовары)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению.Остатки(, ) КАК ТоварыКПоступлениюОстатки
	|		ПО СоглашенияСПоставщиками.Ссылка = ТоварыКПоступлениюОстатки.ДокументПоступления
	|			И СоглашенияСПоставщиками.Склад = ТоварыКПоступлениюОстатки.Склад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|		ПО СоглашенияСПоставщиками.Ссылка = СостоянияИРеквизитыДоставки.Распоряжение";
	
	ТекстЗапросаПоДоговорам =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.Партнер,
	|	ТоварыКПоступлениюОстатки.Склад,
	|	ТоварыКПоступлениюОстатки.Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика,
	|	ТоварыКПоступлениюОстатки.Назначение,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияЗадания КАК РаспоряженияЗадания
	|		ПО (РаспоряженияЗадания.Распоряжение = ДоговорыКонтрагентов.Ссылка)
	|			И (НЕ РаспоряженияЗадания.ВсеТовары)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению.Остатки(, ) КАК ТоварыКПоступлениюОстатки
	|		ПО ДоговорыКонтрагентов.Ссылка = ТоварыКПоступлениюОстатки.ДокументПоступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|		ПО ДоговорыКонтрагентов.Ссылка = СостоянияИРеквизитыДоставки.Распоряжение";
	
	ТекстРаспоряженияНаДоставку = ТекстРаспоряженияНаДоставку 
		+ ТекстОбъединитьВсе 
		+ ТекстЗапросаПоСоглашениям 
		+ ТекстОбъединитьВсе 
		+ ТекстЗапросаПоДоговорам;
	
	ТекстЗапроса = ТекстЗапроса 
		+ ОбщегоНазначения.РазделительПакетаЗапросов() 
		+ ТекстРаспоряженияНаДоставку 
		+ ОбщегоНазначения.РазделительПакетаЗапросов();
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	Т.Распоряжение,
	|	Т.Склад,
	|	СУММА(Т.Количество) КАК Количество
	|ПОМЕСТИТЬ ОстаткиПоРаспоряжению
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыЗадания.Распоряжение КАК Распоряжение,
	|		ТоварыЗадания.ПолучательОтправитель КАК ПолучательОтправитель,
	|		ТоварыЗадания.Склад КАК Склад,
	|		ТоварыЗадания.Номенклатура КАК Номенклатура,
	|		ТоварыЗадания.Характеристика КАК Характеристика,
	|		ТоварыЗадания.Назначение КАК Назначение,
	|		ТоварыЗадания.Серия КАК Серия,
	|		-ТоварыЗадания.Количество КАК Количество
	|	ИЗ
	|		ТоварыЗадания КАК ТоварыЗадания
	|	ГДЕ
	|		НЕ ТоварыЗадания.ВсеТовары
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.ПолучательОтправитель,
	|		Т.Склад,
	|		Т.Номенклатура,
	|		Т.Характеристика,
	|		Т.Назначение,
	|		Т.Серия,
	|		Т.Количество
	|	ИЗ
	|		ТоварыРаспоряжений КАК Т) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Распоряжение,
	|	Т.ПолучательОтправитель,
	|	Т.Склад,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.Назначение,
	|	Т.Серия
	|
	|ИМЕЮЩИЕ
	|	СУММА(Т.Количество) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспоряженияЗадания.Распоряжение,
	|	РаспоряженияЗадания.Склад,
	|	ИСТИНА КАК ВсеТовары
	|ПОМЕСТИТЬ ПолностьюДоставляемыеРаспоряжения
	|ИЗ
	|	РаспоряженияЗадания КАК РаспоряженияЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоРаспоряжению КАК ОстаткиПоРаспоряжению
	|		ПО РаспоряженияЗадания.Распоряжение = ОстаткиПоРаспоряжению.Распоряжение
	|			И РаспоряженияЗадания.Склад = ОстаткиПоРаспоряжению.Склад
	|ГДЕ
	|	ОстаткиПоРаспоряжению.Распоряжение ЕСТЬ NULL" + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ТЧРаспоряжения.НомерСтроки
	|ИЗ
	|	ПолностьюДоставляемыеРаспоряжения КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЧРаспоряжения КАК ТЧРаспоряжения
	|		ПО (ТЧРаспоряжения.Распоряжение = Т.Распоряжение)
	|			И (ТЧРаспоряжения.Склад = Т.Склад)
	|			И НЕ ТЧРаспоряжения.ДоставляетсяПолностью";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТоварыКДоставке", ТоварыРаспоряжений);
	
	Если СтрокиТЧКЗаполнению = Неопределено Тогда
		Запрос.УстановитьПараметр("ТЧРаспоряжения",
			ТЧРаспоряжения.Выгрузить(,"НомерСтроки, Распоряжение, Склад, ДоставляетсяПолностью"));
	Иначе
		Запрос.УстановитьПараметр("ТЧРаспоряжения",
			ТЧРаспоряжения.Выгрузить(СтрокиТЧКЗаполнению,"НомерСтроки, Распоряжение, Склад, ДоставляетсяПолностью"));
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТЧРаспоряжения[Выборка.НомерСтроки - 1].ДоставляетсяПолностью = Истина;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет массив непроверяемых реквизитов распоряжения на доставку в зависимости от способа доставки.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект	- распоряжение, в котором проверяется заполнение реквизитов;
//  МассивНепроверяемыхРеквизитов - Массив из Строка - массив реквизитов, заполнение которых не обязательно;
//  Отказ - Булево - Истина - признак отказа выполнения заполнения реквизитов;
//  НакладнаяПоЗаказам - Булево - Истина - ДокументОбъект является накладной по заказу.
//
Процедура ПроверитьЗаполнениеРеквизитовДоставки(ДокументОбъект, МассивНепроверяемыхРеквизитов, Отказ, НакладнаяПоЗаказам = Ложь) Экспорт
	
	Если НЕ ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("АдресДоставки");
		Возврат;
		
	КонецЕсли;
	
	// Проверим соответствие реквизитов доставки заказов и накладных
	КлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(ДокументОбъект);
	Поле = "СпособДоставки";
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками") Тогда
		
		Если НакладнаяПоЗаказам
			И ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика Тогда
			// Проверим, что в заказах по накладной указан корректный способ доставки
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТоварыКОтгрузкеОбороты.ДокументОтгрузки КАК Ссылка
			|ИЗ
			|	РегистрНакопления.ТоварыКОтгрузке.Обороты(, , Регистратор, ) КАК ТоварыКОтгрузкеОбороты
			|ГДЕ
			|	ТоварыКОтгрузкеОбороты.Регистратор = &Ссылка
			|	И ТоварыКОтгрузкеОбороты.ДокументОтгрузки.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)";
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ТекстСообщения = НСтр("ru = 'Способ доставки в связанном документе %Ссылка% не соответствует указанному в накладной.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Выборка.Ссылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,КлючДанных,Поле,"Объект",Отказ);
			КонецЦикла;
			
		Иначе
			// Проверим, что в накладных по заказу указан корректный способ доставки
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТоварыКОтгрузкеОбороты.Регистратор КАК Ссылка
			|ИЗ
			|	РегистрНакопления.ТоварыКОтгрузке.Обороты(, , Регистратор, ДокументОтгрузки = &Ссылка) КАК ТоварыКОтгрузкеОбороты
			|ГДЕ
			|	ТоварыКОтгрузкеОбороты.Регистратор <> ТоварыКОтгрузкеОбороты.ДокументОтгрузки
			|	И ТоварыКОтгрузкеОбороты.КОформлениюРасход > 0";
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				СиламиПеревозчика = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика");
				ЕстьСпособДоставки = ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Выборка.Ссылка, "СпособДоставки");
				Если ЕстьСпособДоставки Тогда
					СпособДоставкиСвязанногоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Ссылка, "СпособДоставки");
					Если ДокументОбъект.СпособДоставки = СиламиПеревозчика
						И СпособДоставкиСвязанногоДокумента <> СиламиПеревозчика
						Или ДокументОбъект.СпособДоставки <> СиламиПеревозчика
						И СпособДоставкиСвязанногоДокумента = СиламиПеревозчика Тогда
						
						ТекстСообщения = НСтр("ru = 'Способ доставки в связанном документе %Ссылка% не соответствует указанному в заказе.'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Выборка.Ссылка);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,КлючДанных,Поле,"Объект",Отказ);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДокументОбъект, "ОсобыеУсловияПеревозки")
		И Не ДокументОбъект.ОсобыеУсловияПеревозки Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ОсобыеУсловияПеревозкиОписание");
	КонецЕсли;
	
	// Доставка не требуется
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.СпособДоставки)
	 ИЛИ ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.ОпределяетсяВРаспоряжении
	 ИЛИ (НакладнаяПоЗаказам И Не ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика)
	 ИЛИ ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз
	 ИЛИ ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ПеревозчикПартнер");
		МассивНепроверяемыхРеквизитов.Добавить("АдресДоставки");
		МассивНепроверяемыхРеквизитов.Добавить("АдресДоставкиПеревозчика");
		
	// Доставка от нас
		
	ИначеЕсли ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("АдресДоставкиПеревозчика");
		
	ИначеЕсли ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента
		  ИЛИ ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки
		  ИЛИ ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиентаКурьером
	// Доставка к нам
		
		  ИЛИ ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя
		  ИЛИ ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ПеревозчикПартнер");
		МассивНепроверяемыхРеквизитов.Добавить("АдресДоставкиПеревозчика");
		
	ИначеЕсли ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("АдресДоставки");
		МассивНепроверяемыхРеквизитов.Добавить("АдресДоставкиПеревозчика");
		
	ИначеЕсли ДокументОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("АдресДоставки");
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет действия при изменении реквизита "Особые условия перевозки".
//
// Параметры:
//	ЭлементыФормы - ВсеЭлементыФормы - элементы формы, в которых осуществляется изменение свойств;
//	ДокОбъект - ДанныеФормыСтруктура - объект, реквизиты которого используются при изменении 
//		значения реквизита "Особые условия перевозки".
//
Процедура ОсобыеУсловияПеревозкиПриИзменении(ЭлементыФормы, ДокОбъект) Экспорт
	
	Если НЕ ДокОбъект.ОсобыеУсловияПеревозки Тогда
		ДокОбъект.ОсобыеУсловияПеревозкиОписание = "";
	КонецЕсли;
	
	ОсобыеУсловияПеревозкиУстановитьДоступность(ЭлементыФормы, ДокОбъект);
	
КонецПроцедуры

// Дополняет контактную информацию телефонами контактного лица, перевозчика, отправителя или получателя.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - объект, в котором данные по доставке заполняются контактной информацией.
//
Процедура ДополнитьИнформациюПоДоставкеКонтактами(Объект) Экспорт
	
	ТипыКИ = Новый Массив; // Массив из ПеречислениеСсылка.ТипыКонтактнойИнформации
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	ИсточникиКИ = Новый Массив;
	КонтактноеЛицо = Неопределено;
	Объект.Свойство("КонтактноеЛицо", КонтактноеЛицо);
	Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		ИсточникиКИ.Добавить(КонтактноеЛицо);
	КонецЕсли;
	
	СпособДоставки = Неопределено;
	Объект.Свойство("СпособДоставки",СпособДоставки);
	
	Если СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи
		Или СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		ПеревозчикПартнер = Объект.ПеревозчикПартнер;
		ИсточникиКИ.Добавить(ПеревозчикПартнер);
	Иначе
		ПолучательОтправитель = ПолучательОтправитель(Объект);
		ИсточникиКИ.Добавить(ПолучательОтправитель.Значение);
	КонецЕсли;
	
	Для Каждого Источник Из ИсточникиКИ Цикл
		Если Не ЗначениеЗаполнено(Источник) Тогда
			Продолжить;
		КонецЕсли;
		ИсточникПараметр = Новый Массив;
		ИсточникПараметр.Добавить(Источник);
		КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(ИсточникПараметр, ТипыКИ, , ТекущаяДатаСеанса());
		КонтактнаяИнформацияЗаполнена = Ложь;
		Если КонтактнаяИнформация.Количество() > 0 Тогда
			ТекстТелефоны = Строка(Источник) + ": ";
			Для Каждого Стр Из КонтактнаяИнформация Цикл
				Если ЗначениеЗаполнено(Стр.Представление) Тогда
					КонтактнаяИнформацияЗаполнена = Истина;
					ТекстТелефоны = ТекстТелефоны + Стр.Представление + ", ";
				КонецЕсли;
			КонецЦикла;
			ТекстТелефоны = Лев(ТекстТелефоны, СтрДлина(ТекстТелефоны)-2) + ".";
			Если КонтактнаяИнформацияЗаполнена
				И СтрНайти(Объект.ДополнительнаяИнформацияПоДоставке, ТекстТелефоны) = 0 Тогда
				Если ЗначениеЗаполнено(Объект.ДополнительнаяИнформацияПоДоставке) Тогда
					Объект.ДополнительнаяИнформацияПоДоставке = Объект.ДополнительнаяИнформацияПоДоставке + Символы.ПС;
				КонецЕсли;
				Объект.ДополнительнаяИнформацияПоДоставке = Объект.ДополнительнаяИнформацияПоДоставке + ТекстТелефоны;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Получает реквизиты транспортного средства.
//
// Параметры:
//  ТранспортноеСредство - СправочникСсылка.ТранспортныеСредства, СправочникСсылка.ТипыТранспортныхСредств	 - транспортное средство,
//  	реквизиты которого нужно получить.
// 
// Возвращаемое значение:
//  Структура - с полями:
//  *ВместимостьПредставление - Строка - вместимость
//  *ГрузоподъемностьВЕдПользователя - Число - грузоподъемность
//  *ВместимостьВЕдПользователя - Число - вместимость в пользовательских единицах измерения
//  *ГрузоподъемностьВТоннах - Число - грузоподъемность в тоннах
//  *ВместимостьВКубическихМетрах - Число - вместимость в кубических метрах.
//
Функция РеквизитыТС(ТранспортноеСредство) Экспорт
	
	СтруктураВозврата = Новый Структура;
	
	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		
		РеквизитыТС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ТранспортноеСредство,
			"ВместимостьПредставление, ГрузоподъемностьВТоннах, ВместимостьВКубическихМетрах");
		
		СтруктураВозврата.Вставить("ВместимостьПредставление", РеквизитыТС.ВместимостьПредставление);
		СтруктураВозврата.Вставить("ГрузоподъемностьВЕдПользователя", РеквизитыТС.ГрузоподъемностьВТоннах / КоэффициентПересчетаВТонны());
		СтруктураВозврата.Вставить("ВместимостьВЕдПользователя", РеквизитыТС.ВместимостьВКубическихМетрах / КоэффициентПересчетаВКубическиеМетры());
		СтруктураВозврата.Вставить("ГрузоподъемностьВТоннах", РеквизитыТС.ГрузоподъемностьВТоннах);
		СтруктураВозврата.Вставить("ВместимостьВКубическихМетрах", РеквизитыТС.ВместимостьВКубическихМетрах);
		
	Иначе
		
		СтруктураВозврата.Вставить("ВместимостьПредставление", "");
		СтруктураВозврата.Вставить("ГрузоподъемностьВЕдПользователя", 0);
		СтруктураВозврата.Вставить("ВместимостьВЕдПользователя", 0);
		СтруктураВозврата.Вставить("ГрузоподъемностьВТоннах", 0);
		СтруктураВозврата.Вставить("ВместимостьВКубическихМетрах", 0);
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Формирует текстовое представление реквизитов доставки для вывода на форму.
//
// Параметры:
//  КонтейнерРеквизитовДоставки	 - СправочникСсылка.СоглашенияСПоставщиками, СправочникСсылка.ДоговорыКонтрагентов - 
//  									договор или соглашение, содержащее информацию по реквизитам доставки.
// 
// Возвращаемое значение:
//  Строка - текстовое представление реквизитов доставки.
//
Функция СформироватьСводнуюИнформациюПоДоставке(КонтейнерРеквизитовДоставки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КонтейнерРеквизитовДоставки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДоставкиПредставление = Неопределено;
	
	РеквизитыДоставки = РеквизитыДоставки(КонтейнерРеквизитовДоставки);
	
	ОписаниеРеквизитов = Новый Соответствие;
	ОписаниеРеквизитов.Вставить("СпособДоставки"					, "Способ доставки");
	ОписаниеРеквизитов.Вставить("ВремяДоставки"						, "Желаемое время доставки");
	ОписаниеРеквизитов.Вставить("АдресДоставки"						, "Адрес доставки");
	ОписаниеРеквизитов.Вставить("ПеревозчикПартнер"					, "Перевозчик");
	ОписаниеРеквизитов.Вставить("АдресДоставкиПеревозчика"			, "Адрес пункта передачи");
	ОписаниеРеквизитов.Вставить("ЗонаДоставки"						, "Зона доставки");
	ОписаниеРеквизитов.Вставить("ДополнительнаяИнформацияПоДоставке", "Дополнительная информация по доставке");
	
	РеквизитыДоставкиПредставление = "";
	
	Если ЗначениеЗаполнено(РеквизитыДоставки.ВремяДоставкиС) И ЗначениеЗаполнено(РеквизитыДоставки.ВремяДоставкиПо) Тогда
		Шаблон = НСтр("ru='с %1 до %2'");
		ПредставлениеВремениДоставки = СтрШаблон(Шаблон,
			Формат(РеквизитыДоставки.ВремяДоставкиС	, НСтр("ru='ДФ=''HH"":""mm'''")),
			Формат(РеквизитыДоставки.ВремяДоставкиПо, НСтр("ru='ДФ=''HH"":""mm'''")));
		РеквизитыДоставки.Вставить("ВремяДоставки", ПредставлениеВремениДоставки);
	ИначеЕсли ЗначениеЗаполнено(РеквизитыДоставки.ВремяДоставкиС) Тогда
		Шаблон = НСтр("ru='после %1'");
		ПредставлениеВремениДоставки = СтрШаблон(Шаблон,
			Формат(РеквизитыДоставки.ВремяДоставкиС	, НСтр("ru='ДФ=''HH"":""mm'''")));
		РеквизитыДоставки.Вставить("ВремяДоставки", ПредставлениеВремениДоставки);
	ИначеЕсли ЗначениеЗаполнено(РеквизитыДоставки.ВремяДоставкиПо) Тогда
		Шаблон = НСтр("ru='до %1'");
		ПредставлениеВремениДоставки = СтрШаблон(Шаблон,
			Формат(РеквизитыДоставки.ВремяДоставкиПо, НСтр("ru='ДФ=''HH"":""mm'''")));
		РеквизитыДоставки.Вставить("ВремяДоставки", ПредставлениеВремениДоставки);
	КонецЕсли;
	
	Для Каждого РеквизитДоставки Из РеквизитыДоставки Цикл
		ПредставлениеРеквизита = ОписаниеРеквизитов[РеквизитДоставки.Ключ]; 
		Если ПредставлениеРеквизита <> Неопределено И ЗначениеЗаполнено(РеквизитДоставки.Значение) Тогда 
			РеквизитыДоставкиПредставление = РеквизитыДоставкиПредставление
			+ ПредставлениеРеквизита + ": " + РеквизитДоставки.Значение + Символы.ПС; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат РеквизитыДоставкиПредставление;
	
КонецФункции

// Вызывается после завершения вызова процедуры Печать менеджера печати объекта, имеет те же параметры.
// Используется для печати комплекта документов в соответствии с порядком документов в "Задании на перевозку".
// 
// Параметры:
//  МассивОбъектов - Массив - список объектов, для которых была выполнена процедура Печать;
//  ПараметрыПечати - Структура - произвольные параметры, переданные при вызове команды печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - содержит табличные документы и дополнительную информацию;
//  ОбъектыПечати - СписокЗначений - соответствие между объектами и именами областей в табличных документах, где
//                                   значение - Объект, представление - имя области с объектом в табличных документах.
//  ПараметрыВывода - Структура - параметры, связанные с выводом табличных документов:
//		* ПараметрыОтправки - Структура - информация для заполнения письма при отправке печатной формы по электронной почте, содержит следующие поля (описание см. в общем модуле конфигурации РаботаСПочтовымиСообщениямиКлиент в процедуре СоздатьНовоеПисьмо):
//			* Получатель - Строка,
//			* Тема - Строка,
//			* Текст - Строка.
//
Процедура ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если КоллекцияПечатныхФорм.Количество()
	   И КоллекцияПечатныхФорм[0].ИмяМакета = "КомплектДокументов" 
	   И МассивОбъектов.Количество()
	   И ТипЗнч(МассивОбъектов[0]) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
		
		Задание = МассивОбъектов[0];
		ДокументыПоЗаданию = Документы.ЗаданиеНаПеревозку.ПолучитьНакладныеПоЗаданиюНаПеревозку(Задание);
		Соответствие = Новый Соответствие;
		ОбъектыПечатиРезультат = Новый СписокЗначений;
		ЗаполнитьЗначенияСвойств(ОбъектыПечатиРезультат.Добавить(), ОбъектыПечати[0]);
		Для Каждого ОбъектПечати Из ОбъектыПечати Цикл
			Индекс = ДокументыПоЗаданию.Найти(ОбъектПечати.Значение);
			Если Индекс <> Неопределено Тогда
				Соответствие.Вставить(Индекс, ОбъектПечати.Значение);
			КонецЕсли;
		КонецЦикла;
		Для Сч = 0 По Соответствие.Количество() - 1 Цикл 
			ЭлементСписка = ОбъектыПечати.НайтиПоЗначению(Соответствие[Сч]);
			ЗаполнитьЗначенияСвойств(ОбъектыПечатиРезультат.Добавить(), ЭлементСписка);
		КонецЦикла;
		ОбъектыПечати = ОбъектыПечатиРезультат;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак необходимости перезаполнения адреса доставки и списка выбора в документе продажи.
// 
// Параметры:
//  Распоряжение - ДокументСсылка, ДанныеФормыСтруктура - Документ продажи:
//      * Ссылка - ДокументСсылка - Документ продажи.
// 
// Возвращаемое значение:
//  Булево - Перезаполнить адрес доставки в документе продажи.
//
Функция ПерезаполнятьАдресДоставкиВДокументеПродажи(Распоряжение) Экспорт
	
	Возврат ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента")
		Или ТипЗнч(Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ОтгрузкаТоваровКлиенту")
		Или ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента")
		Или ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПередачаТоваровХранителю")
		
		Или (ТипЗнч(Распоряжение) = Тип("ДанныеФормыСтруктура")
			Или ТипЗнч(Распоряжение) = Тип("Структура")
			Или ТипЗнч(Распоряжение) = Тип("ФормаКлиентскогоПриложения"))
			
			И (ТипЗнч(Распоряжение.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента")
				Или ТипЗнч(Распоряжение.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				Или ТипЗнч(Распоряжение.Ссылка) = Тип("ДокументСсылка.ОтгрузкаТоваровКлиенту")
				Или ТипЗнч(Распоряжение.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента")
				Или ТипЗнч(Распоряжение.Ссылка) = Тип("ДокументСсылка.ПередачаТоваровХранителю"));
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  ЗапускВручную - Булево - 
// 
// Возвращаемое значение:
//  см. НовыеДанныеПереходаНаДоставку25 
//
Функция СтатусПереходаНаДоставку25(ЗапускВручную = Ложь) Экспорт
	
	СостояниеПерехода = НовыеДанныеПереходаНаДоставку25();
	
	СостояниеПерехода.ПереходЗавершен = ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка25();
	
	Если ЗапускВручную Тогда
		
		СостояниеПерехода.ПереходЗапущен = Истина;
		
	КонецЕсли;
	
	Если НЕ СостояниеПерехода.ПереходЗавершен Тогда
		
		Задание = РегламентныеЗаданияСервер.Задание(Метаданные.РегламентныеЗадания.ПереходНаУправлениеДоставкой25);
		
		Если Задание <> Неопределено Тогда
			
			СостояниеПерехода.СозданоЗадание = Истина;
			СостояниеПерехода.ПереходЗапущен = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СостояниеПерехода.ПереходЗавершен
	 ИЛИ СостояниеПерехода.ПереходЗапущен Тогда
		
		ТекстЗапроса = ТекстЗапросаПрогрессаПереходаНаДоставку25();
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ВидКИСклад", Справочники.ВидыКонтактнойИнформации.АдресСклада);
		Запрос.УстановитьПараметр("ВидКИПартнер", Справочники.ВидыКонтактнойИнформации.АдресПартнера);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(СостояниеПерехода, Выборка);
			
			ПартнерыОбработаны = (СостояниеПерехода.КоличествоПартнеров = СостояниеПерехода.КоличествоПартнеровОбработано);
			СкладыОбработаны = (СостояниеПерехода.КоличествоСкладов = СостояниеПерехода.КоличествоСкладовОбработано);
			
			СостояниеПерехода.ДанныеОбработаны = (ПартнерыОбработаны И СкладыОбработаны);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СостояниеПерехода;
	
КонецФункции

// Очистить заполнить коды строк доставки.
// 
// Параметры:
//  Объект - ДокументОбъект.РеализацияТоваровУслуг - 
//         - ДокументОбъект.ОтгрузкаТоваровКлиенту-
//  ТребуетсяДоставка - Булево -
//  ИмяТабличнойЧасти - Строка - Имя табличной части
//  РеквизитМаксимальныйКодСтроки - Строка - Имя реквизита максимальный код строки
//  ИмяРеквизитаТЧ - Строка - Имя реквизита ТЧ
//
Процедура ОчиститьЗаполнитьКодыСтрокДоставки(
	Объект,
	ТребуетсяДоставка,
	ИмяТабличнойЧасти = "Товары",
	РеквизитМаксимальныйКодСтроки = "МаксимальныйКодСтрокиДоставки",
	ИмяРеквизитаТЧ = "КодСтрокиДоставки") Экспорт
	
	Если ТребуетсяДоставка Тогда
		
		ЗаказыСервер.УстановитьКлючВСтрокахТабличнойЧасти(
			Объект,
			ИмяТабличнойЧасти,
			РеквизитМаксимальныйКодСтроки,
			ИмяРеквизитаТЧ);
		
	Иначе
		
		Объект[РеквизитМаксимальныйКодСтроки] = 0;
		
		ТабличнаяЧасть = Объект[ИмяТабличнойЧасти]; // ДокументТабличнаяЧасть.РеализацияТоваровУслуг.Товары, ДокументТабличнаяЧасть.ОтгрузкаТоваровКлиенту.Товары
		Для Каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
			
			СтрокаТабличнойЧасти[ИмяРеквизитаТЧ] = 0;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Включает режим доставки 2.5 после обработки данных
//
Процедура ЗавершитьПереходНаДоставку25() Экспорт
	
	СоединенияЗаблокированы = СоединенияИБ.УстановленаБлокировкаСоединений();
	
	НачатьТранзакцию();
	
	Попытка
		
		ИнформацияОСоединениях = СоединенияИБ.ИнформацияОСоединениях();
		ТекстСообщенияБлокировки = ДоставкаТоваровКлиентСервер.ТекстПроверкиАктивныхСеансов();
		Если ИнформацияОСоединениях.НаличиеАктивныхСоединений Тогда
			
			ВызватьИсключение ТекстСообщенияБлокировки;
			
		КонецЕсли;
		
		Если НЕ СоединенияЗаблокированы Тогда
			
			БлокировкаУстановлена = СоединенияИБ.УстановитьБлокировкуСоединений(ТекстСообщенияБлокировки);
			Если НЕ БлокировкаУстановлена Тогда
				
				ТекстИсключения = НСтр("ru = 'Не удалось установить блокировку соединений информационной базы.'"); 
				
			КонецЕсли;
			
		КонецЕсли;
		
		РезультатПроверки = ПроверитьВозможностьПереходаНаДоставку25(Истина);
		
		Если НЕ РезультатПроверки.ПереходДоступен Тогда
			
			ТекстИсключения = ДоставкаТоваровКлиентСервер.ТекстПроверкиВозможностиПереходаНаДоставку25(
				РезультатПроверки);
			
			ВызватьИсключение ТекстИсключения;
			
		КонецЕсли;
		
		Константы.НеИспользоватьУправлениеДоставкой20.Установить(Истина);
		Константы.НеИспользоватьУправлениеДоставкой25.Установить(Ложь);
		РегламентныеЗаданияСервер.УдалитьЗадание(Метаданные.РегламентныеЗадания.ПереходНаУправлениеДоставкой25);
		
		ОбновитьПовторноИспользуемыеЗначения();
		Если НЕ СоединенияЗаблокированы Тогда
			
			СоединенияИБ.РазрешитьРаботуПользователей();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Если НЕ СоединенияЗаблокированы Тогда
			
			СоединенияИБ.РазрешитьРаботуПользователей();
			
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Дополняет текст запроса для формы управления отгрузкой данными доставки
// 
// Параметры:
//  Запрос - Запрос
//  ТекстЗапроса - Строка
//
Процедура ДополнитьТекстЗапросаУправленияОтгрузкойДаннымиДоставки(Запрос, ТекстЗапроса) Экспорт
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() Тогда
		
		ДополнитьТекстЗапросаУправленияОтгрузкойДаннымиДоставки20(Запрос, ТекстЗапроса);
		
	Иначе
		
		ДополнитьТекстЗапросаУправленияОтгрузкойДаннымиДоставки25(ТекстЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры

// Дополняет текст запроса для формы управления отгрузкой данными доставки с расшифровкой по документу доставки
// 
// Параметры:
//  ТекстЗапроса - Строка
//
Процедура ДополнитьТекстЗапросаУправленияОтгрузкойДаннымиДоставкиДеталиОтгрузки(ТекстЗапроса) Экспорт
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() Тогда
		
		ДополнитьТекстЗапросаУправленияОтгрузкойДаннымиДоставки20ДеталиОтгрузки(ТекстЗапроса);
		
	Иначе
		
		ДополнитьТекстЗапросаУправленияОтгрузкойДаннымиДоставки25ДеталиОтгрузки(ТекстЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьПереходНаДоставку25() Экспорт
	
	СтатусПерехода = СтатусПереходаНаДоставку25(Истина);
	
	Если Не СтатусПерехода.ПереходЗавершен
		И Не СтатусПерехода.СозданоЗадание Тогда
		
		ПерейтиНаДоставку25(Истина);
		СоздатьРегламентноеЗаданиеПереходаНаДоставку25();
		
	КонецЕсли;
	
КонецПроцедуры

// Данные распоряжения на доставку.
// 
// Параметры:
//  Распоряжение - ДокументСсылка.РеализацияТоваровУслуг
//  ДополнительныеПараметры - Неопределено
//                          - Структура:
//                            * ОтборНоменклатуры - Массив из СправочникСсылка.Номенклатура
// 
// Возвращаемое значение:
//  см. НовыеДанныеАдресовРаспоряжения
//
Функция ДанныеРаспоряженияНаДоставку(Распоряжение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры <> Неопределено
		И ДополнительныеПараметры.Свойство("ОтборНоменклатуры") Тогда
		
		ОтборНоменклатуры = ДополнительныеПараметры.ОтборНоменклатуры;
		БезОтбораПоНоменклатуре = Ложь;
		
	Иначе
		
		ОтборНоменклатуры = Неопределено;
		БезОтбораПоНоменклатуре = Истина;
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаДанныхРаспоряженийНаДоставку();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Распоряжение);
	Запрос.УстановитьПараметр("ОтборНоменклатуры", ОтборНоменклатуры);
	Запрос.УстановитьПараметр("БезОтбораПоНоменклатуре", БезОтбораПоНоменклатуре);
	
	ДанныеАдресов = НовыеДанныеАдресовРаспоряжения();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаДанных = ДанныеАдресов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, Выборка);
		
	КонецЦикла;
	
	Возврат ДанныеАдресов;
	
КонецФункции

#Область РаботаСФормами
	
// Добавляет на форму владельца точек доставки команду перехода к списку точек доставки.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ИмяЭлементаДляРазмещения - Строка
//  ИмяКоманды - Строка
//  Видимость - Булево
//
Процедура ДобавитьКомандуПереходаКСпискуТочекДоставки(Форма, ИмяЭлементаДляРазмещения, ИмяКоманды, Видимость = Истина) Экспорт
	
	Элементы = Форма.Элементы;
	Родитель = Элементы[ИмяЭлементаДляРазмещения];
	
	Элемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Родитель);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = ИмяКоманды;
	Элемент.Видимость = Видимость;
	
КонецПроцедуры

// Параметры:
//  Список - СписокЗначений из ПеречислениеСсылка.ВидыПланированияДоставки -
//  Объект - ДанныеФормыСтруктура:
//  * Ссылка - СправочникСсылка.Партнеры, СправочникСсылка.СоглашенияСКлиентами -
//  * Типовое - Булево -
//  * Партнер - СправочникСсылка.Партнеры -
//
Процедура ЗаполнитьСписокВыбораПланированияДоставки(Список, Объект) Экспорт
	
	Список.Очистить();
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.СоглашенияСКлиентами")
	   И НЕ Объект.Типовое
	   И ЗначениеЗаполнено(Объект.Партнер) Тогда
		
		ШаблонПустогоЗначения = НСтр("ru = '<Из клиента: %1>'");
		
		ЗначениеНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Партнер, "ВидПланированияДоставки");
		
		Если НЕ ЗначениеЗаполнено(ЗначениеНастройки) Тогда
			
			ЗначениеНастройки = ВидПланированияДоставкиНаУровнеСистемы();
			
		КонецЕсли;
		
	Иначе
		
		ШаблонПустогоЗначения = НСтр("ru = '<Из настроек системы: %1>'");
		ЗначениеНастройки = ВидПланированияДоставкиНаУровнеСистемы();
		
	КонецЕсли;
	
	ПредставлениеНастройки = ОбщегоНазначения.ПредметСтрокой(ЗначениеНастройки);
	
	ПредставлениеПустогоЗначения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонПустогоЗначения,
		НРег(ПредставлениеНастройки));
	
	Список.Добавить(Перечисления.ВидыПланированияДоставки.ПустаяСсылка(), ПредставлениеПустогоЗначения);
	Список.Добавить(Перечисления.ВидыПланированияДоставки.ТекущимДокументом);
	Список.Добавить(Перечисления.ВидыПланированияДоставки.ОтдельнымДокументом);
	
КонецПроцедуры

// Устанавливает выделение цветом неиспользуемых точек доставки в списках
//
// Параметры:
//  Список - ДинамическийСписок
//
Процедура УстановитьОформлениеНеиспользуемыхТочекДоставки(Список) Экспорт
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НеИспользуется");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСАдресамиДоставки

// Параметры:
//  Адрес - Строка - Строковое представление адреса
//  АдресЗначение - Строка - JSON представление адреса
//  АдресЗначенияПолей - Строка - XML представлениеАдреса
//
Процедура ЗаполнитьПоляАдресаПоПредставлению(Адрес, АдресЗначение, АдресЗначенияПолей) Экспорт
	
	Если ПустаяСтрока(Адрес) Тогда
		
		АдресЗначение = "";
		АдресЗначенияПолей = "";
		
	Иначе
		
		НоваяСтруктураАдреса = УправлениеКонтактнойИнформацией.СведенияОбАдресе();
		НоваяСтруктураАдреса.Представление = Адрес;
		
		ДоставкаТоваровЛокализация.УстановитьТипАдресаВСвободнойФорме(НоваяСтруктураАдреса);
		
		АдресЗначение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(
			НоваяСтруктураАдреса,
			Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		АдресЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(
			АдресЗначение,
			Адрес,
			Перечисления.ТипыКонтактнойИнформации.Адрес);
		
	КонецЕсли;
	
КонецПроцедуры

// Получает адреса владельцев точек доставки и создает по ним точки доставки
// 
// Параметры:
//  СтартПерехода - Булево - признак первого запуска при начале перехода
//
Процедура ПерейтиНаДоставку25(СтартПерехода = Ложь) Экспорт
	
	Если Не СтартПерехода Тогда
		
		РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПереходНаУправлениеДоставкой25;
		ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаВладельцевДляСозданияТочекДоставки();
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВидКИСклад", Справочники.ВидыКонтактнойИнформации.АдресСклада);
	Запрос.УстановитьПараметр("ВидКИПартнер", Справочники.ВидыКонтактнойИнформации.АдресПартнера);
	
	Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("ДоставкаТоваров.ПерейтиНаДоставку25");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Если НЕ СтартПерехода Тогда
			
			ОтключитьРегламентноеЗаданиеПереходаНаДоставку25();
			
		КонецЕсли;
		
		КоличествоОбработанныхОбъектов = 0;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СоздатьТочкиДоставкиПоВладельцу(Выборка.Ссылка);
			
		КонецЦикла;
		
		КоличествоОбработанныхОбъектов = Выборка.Количество();
		
	КонецЕсли;
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, КоличествоОбработанныхОбъектов);
	
КонецПроцедуры

// Возвращаемое значение:
//  ТаблицаЗначений - Новые данные точек доставки:
// * Адрес - Строка -
// * АдресЗначение - Строка -
// * АдресЗначенияПолей - Строка -
// * ИдентификаторАдреса - Строка -
// * ИдентификаторТочкиДоставки - Строка -
// * Наименование - Строка -
// * ОсновнаяТочка - Булево - 
// * НеИспользуется - Булево - 
// * ИдентификаторПереопределен - Булево - 
// * ЗонаДоставки - СправочникСсылка.ЗоныДоставки - 
// * ТочкаДоставки - СправочникСсылка.ТочкиДоставки - 
// * ПодобранаПоИдентификатору - Булево - 
// * ПодобранаПоАдресу - Булево - 
// * АктуализацияОсновнойТочки - Булево - 
// * НесколькоОсновныхАдресов - Булево - 
//
Функция НовыеДанныеТочекДоставки() Экспорт
	
	ТипСтрокаНеограниченная = ОбщегоНазначения.ОписаниеТипаСтрока(0);
	ТипСтрокаИдентификатора = ОбщегоНазначения.ОписаниеТипаСтрока(36);
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Данные = Новый ТаблицаЗначений();
	Данные.Колонки.Добавить("Адрес", ТипСтрокаНеограниченная);
	Данные.Колонки.Добавить("АдресЗначение", ТипСтрокаНеограниченная);
	Данные.Колонки.Добавить("АдресЗначенияПолей", ТипСтрокаНеограниченная);
	Данные.Колонки.Добавить("ИдентификаторАдреса", ТипСтрокаИдентификатора);
	Данные.Колонки.Добавить("ИдентификаторТочкиДоставки", ТипСтрокаИдентификатора);
	Данные.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	Данные.Колонки.Добавить("ОсновнаяТочка", ТипБулево);
	Данные.Колонки.Добавить("НеИспользуется", ТипБулево);
	Данные.Колонки.Добавить("ИдентификаторПереопределен", ТипБулево);
	Данные.Колонки.Добавить("ЗонаДоставки", Новый ОписаниеТипов("СправочникСсылка.ЗоныДоставки"));
	Данные.Колонки.Добавить("ТочкаДоставки", Новый ОписаниеТипов("СправочникСсылка.ТочкиДоставки"));
	Данные.Колонки.Добавить("ПодобранаПоИдентификатору", ТипБулево);
	Данные.Колонки.Добавить("ПодобранаПоАдресу", ТипБулево);
	Данные.Колонки.Добавить("АктуализацияОсновнойТочки", ТипБулево);
	Данные.Колонки.Добавить("НесколькоОсновныхАдресов", ТипБулево);
	
	Возврат Данные;
	
КонецФункции

// Параметры:
//  Владелец - СправочникСсылка.Склады
//           - СправочникСсылка.Партнеры
//  ДанныеТочки - СтрокаТаблицыЗначений из см. НовыеДанныеТочекДоставки
//  ПереходНаДоставку25 - Булево
// 
Процедура ОбновитьСоздатьТочкуДоставки(Владелец, ДанныеТочки, ПереходНаДоставку25 = Ложь) Экспорт
	
	НоваяТочка = ДанныеТочки.ТочкаДоставки.Пустая();
	
	Если НоваяТочка Тогда
		
		ТочкаОбъект = Справочники.ТочкиДоставки.СоздатьЭлемент();
		
	Иначе
		
		ТочкаОбъект = ДанныеТочки.ТочкаДоставки.ПолучитьОбъект();
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ТочкаОбъект, ДанныеТочки);
	
	ТочкаОбъект.Владелец = Владелец;
	
	КомментарийВерсии = КомментарийВерсииТочкиДоставки(НоваяТочка, ДанныеТочки, ПереходНаДоставку25);
	Если Не ПустаяСтрока(КомментарийВерсии) Тогда
		
		ТочкаОбъект.ЗаписьИсторииДанных.КомментарийВерсии = КомментарийВерсии;
		
		ДополнительныеДанные = ТочкаОбъект.ЗаписьИсторииДанных.ДополнительныеДанные;
		ДополнительныеДанные.Вставить("ОсновнаяТочка", ДанныеТочки.ОсновнаяТочка);
		
	КонецЕсли;
	
	ТочкаОбъект.Записать();
	
КонецПроцедуры

// Параметры:
//  Адрес - см. НовыеДанныеАдреса
// 
// Возвращаемое значение:
//  Булево
//
Функция АдресПустой(Адрес) Экспорт
	
	АдресПустой = Ложь;
	
	Если ПустаяСтрока(Адрес.АдресЗначение)
		И ПустаяСтрока(Адрес.Адрес)
		И ПустаяСтрока(Адрес.АдресЗначенияПолей) Тогда
		
		АдресПустой = Истина;
		
	КонецЕсли;
	
	Возврат АдресПустой;
	
КонецФункции

// Возвращаемое значение:
//  Структура - Новые данные адреса:
// * ЗонаДоставки - СправочникСсылка.ЗоныДоставки - 
// * Адрес - Строка - 
// * АдресЗначение - Строка - 
// * АдресЗначенияПолей - Строка - 
// * Основной - Булево - 
//
Функция НовыеДанныеАдреса() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗонаДоставки", Справочники.ЗоныДоставки.ПустаяСсылка());
	Результат.Вставить("Адрес", "");
	Результат.Вставить("АдресЗначение", "");
	Результат.Вставить("АдресЗначенияПолей", "");
	Результат.Вставить("Основной", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  ТаблицаЗначений:
// * ЗонаДоставки - СправочникСсылка.ЗоныДоставки - 
// * Адрес - Строка - 
// * АдресЗначение - Строка - 
// * АдресЗначенияПолей - Строка - 
// * Идентификатор - Строка - 
// * Основной - Булево -
//
Функция НовыеДанныеАдресов() Экспорт
	
	ОписаниеТипаСтрокаНеограниченная = ОбщегоНазначения.ОписаниеТипаСтрока(0);
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ЗонаДоставки", Новый ОписаниеТипов("СправочникСсылка.ЗоныДоставки"));
	Результат.Колонки.Добавить("Адрес", ОписаниеТипаСтрокаНеограниченная);
	Результат.Колонки.Добавить("АдресЗначение", ОписаниеТипаСтрокаНеограниченная);
	Результат.Колонки.Добавить("АдресЗначенияПолей", ОписаниеТипаСтрокаНеограниченная);
	Результат.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	Результат.Колонки.Добавить("Основной", Новый ОписаниеТипов("Булево"));
	
	Возврат Результат;
	
КонецФункции

// Данные точек доставки, изменяемых при записи владельца.
// 
// Параметры:
//  ВладелецТочекДоставки - СправочникСсылка.Партнеры -
//                        - СправочникСсылка.Склады -
//  ПерваяЗапись - Булево -
//  ДанныеОсновныхАдресов - см. НовыеДанныеАдресов
// 
// Возвращаемое значение:
//  см. НовыеДанныеТочекДоставки
//
Функция ДанныеТочекДоставкиКОбработке(ВладелецТочекДоставки, ПерваяЗапись, ДанныеОсновныхАдресов) Экспорт
	
	ДанныеКОбработке = НовыеДанныеТочекДоставки();
	НесколькоОсновныхАдресов = (ДанныеОсновныхАдресов.Количество() > 1);
	ДанныеТочекВладельца = ДанныеСуществующихТочекДоставки(ВладелецТочекДоставки, ПерваяЗапись);
	ДанныеОсновнойТД = ДанныеОсновнойТочкиДоставки(ДанныеТочекВладельца);
	ОсновнаяТДЗаполнена = (ДанныеОсновнойТД <> Неопределено);
	
	Если НесколькоОсновныхАдресов Тогда
		
		ОсновнаяТДИзменена = Ложь;
		
		Для Каждого ДанныеОсновногоАдреса Из ДанныеОсновныхАдресов Цикл
			
			ДобавитьДанныеДляИзмененияНесколькоОсновных(
				ДанныеКОбработке,
				ДанныеТочекВладельца,
				ДанныеОсновногоАдреса,
				ОсновнаяТДИзменена);
			
		КонецЦикла;
		
		Если ОсновнаяТДЗаполнена
		   И Не ОсновнаяТДИзменена Тогда
			
			ДанныеОсновнойТД.ОсновнаяТочка = Ложь;
			ДанныеОсновнойТД.НесколькоОсновныхАдресов = Истина;
			ДобавитьДанныеДляИзменения(ДанныеКОбработке, ДанныеОсновнойТД);
			
		КонецЕсли;
		
	ИначеЕсли ДанныеОсновныхАдресов.Количество() = 1 Тогда
		
		ДанныеОсновногоАдреса = ДанныеОсновныхАдресов[0];
		
		АдресОбработан = Ложь;
		Если ОсновнаяТДЗаполнена Тогда
			
			ДобавитьДанныеДляИзмененияОднойОсновной(ДанныеКОбработке, ДанныеТочекВладельца, ДанныеОсновногоАдреса, ДанныеОсновнойТД);
			АдресОбработан = ДанныеОсновнойТД.АктуализацияОсновнойТочки;
			
		КонецЕсли;
		
		Если Не АдресОбработан Тогда
			
			СменитьОсновнуюТочкуДоставки(ДанныеКОбработке, ДанныеОсновногоАдреса, ДанныеТочекВладельца);
			
		КонецЕсли;
		
	ИначеЕсли ОсновнаяТДЗаполнена Тогда
		
		ДанныеОсновнойТД.ОсновнаяТочка = Ложь;
		ДобавитьДанныеДляИзменения(ДанныеКОбработке, ДанныеОсновнойТД);
		
	КонецЕсли;
	
	ДанныеКОбработке.Сортировать("ОсновнаяТочка Возр");
	
	Возврат ДанныеКОбработке;
	
КонецФункции

// Параметры:
//  Адрес1 - СтрокаТаблицыЗначений: см. НовыеДанныеАдресов
//  Адрес2 - СтрокаТаблицыЗначений: см. НовыеДанныеАдресов
// 
// Возвращаемое значение:
//  Булево
//
Функция АдресаРавны(Адрес1, Адрес2) Экспорт
	
	Результат = Ложь;
	
	Если НЕ ПустаяСтрока(Адрес1.АдресЗначение)
	   И НЕ ПустаяСтрока(Адрес2.АдресЗначение) Тогда
		
		Результат = (СтрСравнить(Адрес1.АдресЗначение, Адрес2.АдресЗначение) = 0);
		
	ИначеЕсли НЕ ПустаяСтрока(Адрес1.АдресЗначенияПолей)
	   И НЕ ПустаяСтрока(Адрес2.АдресЗначенияПолей) Тогда
		
		Результат = (СтрСравнить(Адрес1.АдресЗначенияПолей, Адрес2.АдресЗначенияПолей) = 0);
		
	ИначеЕсли НЕ ПустаяСтрока(Адрес1.Адрес)
	   И НЕ ПустаяСтрока(Адрес2.Адрес) Тогда
		
		Результат = (СтрСравнить(Адрес1.Адрес, Адрес2.Адрес) = 0);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  АдресаДо - см. НовыеДанныеАдресов
//  АдресаПосле - см. НовыеДанныеАдресов
// 
// Возвращаемое значение:
//  Булево -
//
Функция АдресаИзменены(АдресаДо, АдресаПосле) Экспорт
	
	АдресаИзменены = Ложь;
	
	Если АдресаДо.Количество() <> АдресаПосле.Количество() Тогда
		
		АдресаИзменены = Истина;
		
	Иначе
		
		АдресаДо.Сортировать("Идентификатор Убыв");
		АдресаПосле.Сортировать("Идентификатор Убыв");
		
		Для Индекс = 0 По АдресаДо.Количество() - 1 Цикл
			
			СтрокаДо = АдресаДо[Индекс];
			СтрокаПосле = АдресаПосле[Индекс];
			
			Если (СтрокаДо.Основной
					И СтрокаПосле.Основной)
				Или (ПустаяСтрока(СтрокаДо.Идентификатор)
					И ПустаяСтрока(СтрокаПосле.Идентификатор)) Тогда
				
				СтрокиРавны = АдресаРавны(СтрокаДо, СтрокаПосле);
				
			Иначе
				
				СтрокиРавны = (СтрСравнить(СтрокаДо.Идентификатор, СтрокаПосле.Идентификатор) = 0);
				
			КонецЕсли;
			
			Если Не СтрокиРавны Тогда
				
				АдресаИзменены = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат АдресаИзменены;
	
КонецФункции

// Параметры:
//  ВладелецОбъект - СправочникОбъект.Партнеры
//                 - СправочникОбъект.Склады -
// 
// Возвращаемое значение:
//  Булево
//
Функция ПервоеСозданиеТочекДоставки(ВладелецОбъект) Экспорт
	
	Если ВладелецОбъект.ЭтоНовый() Тогда
		
		ПерваяЗапись = Истина;
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТочкиДоставки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТочкиДоставки КАК ТочкиДоставки
		|ГДЕ
		|	ТочкиДоставки.Владелец = &Владелец";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.Параметры.Вставить("Владелец", ВладелецОбъект.Ссылка);
		
		УстановитьПривилегированныйРежим(Истина);
		
		РезультатЗапроса = Запрос.Выполнить();
		ПерваяЗапись = РезультатЗапроса.Пустой();
		
	КонецЕсли;
	
	Возврат ПерваяЗапись;
	
КонецФункции

// Параметры:
//  ТочкаДоставки - СправочникСсылка.ТочкиДоставки -
//  ПроверятьСБлокировкой - Булево -
// 
// Возвращаемое значение:
//  Булево -
//
Функция ТочкаИспользуетсяПриПланированииДоставки(ТочкаДоставки, ПроверятьСБлокировкой = Ложь) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Доставка.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.Доставка КАК Доставка
	|ГДЕ
	|	Доставка.ТочкаОтправителя = &ТочкаДоставки
	|	ИЛИ Доставка.ТочкаПолучателя = &ТочкаДоставки";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТочкаДоставки", ТочкаДоставки);
	
	ПредставлениеТочкиДоставки = Строка(ТочкаДоставки);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПроверятьСБлокировкой Тогда
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Доставка");
			ЭлементБлокировки.УстановитьЗначение("ТочкаОтправителя", ТочкаДоставки);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Доставка");
			ЭлементБлокировки.УстановитьЗначение("ТочкаПолучателя", ТочкаДоставки);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			
			Блокировка.Заблокировать();
			
		Исключение
			
			Информация = ИнформацияОбОшибке();
			ШаблонСообщения = НСтр("ru = 'Не удалось заблокировать записи регистра накопления Доставка по точке доставки ""%1""'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения,
				ПредставлениеТочкиДоставки);
			
			Уточнение = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(Информация, ТекстСообщения);
			ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ВызватьИсключение(Уточнение.Текст, Уточнение.Категория,, ПредставлениеОшибки, Информация);
			
		КонецПопытки;
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТочкаДоставкиИспользуется = НЕ РезультатЗапроса.Пустой();
	
	Возврат ТочкаДоставкиИспользуется;
	
КонецФункции

// Данные адресов по данным контактной информации.
// 
// Параметры:
//  ДанныеКИ - ТаблицаЗначений:
//             * Представление - Строка
//             * Значение - Строка
//             * ЗначенияПолей - Строка
//             * ЗонаДоставки - СправочникСсылка.ЗоныДоставки
//             * Вид - СправочникСсылка.ВидыКонтактнойИнформации
//           - Массив из СправочникТабличнаяЧастьСтрока.Партнеры.КонтактнаяИнформация
//           - Массив из СправочникТабличнаяЧастьСтрока.Склады.КонтактнаяИнформация
//  ЗонаДоставки - СправочникСсылка.ЗоныДоставки
// 
// Возвращаемое значение:
//  см. НовыеДанныеАдресов
//
Функция ДанныеАдресовПоДаннымКонтактнойИнформации(ДанныеКИ, ЗонаДоставки = Неопределено) Экспорт
	
	ДанныеАдресов = НовыеДанныеАдресов();
	
	Если ЗначениеЗаполнено(ЗонаДоставки) Тогда
		
		ЗонаДоставкиДляЗаполнения = ЗонаДоставки;
		
	Иначе
		
		ЗонаДоставкиДляЗаполнения = Справочники.ЗоныДоставки.ПустаяСсылка();
		
	КонецЕсли;
	
	Для Каждого СтрокаАдреса Из ДанныеКИ Цикл
		
		ДанныеЗоныДоставки = Новый Структура("ЗонаДоставки", ЗонаДоставкиДляЗаполнения);
		ЗаполнитьЗначенияСвойств(ДанныеЗоныДоставки, СтрокаАдреса);
		
		ДанныеАдреса = НовыеДанныеАдреса();
		
		ДанныеАдреса.ЗонаДоставки = ДанныеЗоныДоставки.ЗонаДоставки;
		ДанныеАдреса.Адрес = СтрокаАдреса.Представление;
		ДанныеАдреса.АдресЗначение = СтрокаАдреса.Значение;
		ДанныеАдреса.АдресЗначенияПолей = СтрокаАдреса.ЗначенияПолей;
		
		Если СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.АдресПартнера
			Или СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.АдресСклада Тогда
			
			ДанныеАдреса.Основной = Истина;
			
		КонецЕсли;
		
		АдресПустой = АдресПустой(ДанныеАдреса);
		Если Не АдресПустой Тогда
			
			ИдентификаторАдреса = ДоставкаТоваровЛокализация.ИдентификаторАдресаТочкиДоставки(ДанныеАдреса.АдресЗначение);
			
			Отбор = Новый Структура;
			Отбор.Вставить("Идентификатор", ИдентификаторАдреса);
			
			Если ПустаяСтрока(ИдентификаторАдреса) Тогда
				
				Отбор.Вставить("Адрес", ДанныеАдреса.Адрес);
				
			КонецЕсли;
			
			ДобавленныеСтроки = ДанныеАдресов.НайтиСтроки(Отбор);
			Если ДобавленныеСтроки.Количество() = 0 Тогда
				
				СтрокаАдреса = ДанныеАдресов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаАдреса, ДанныеАдреса);
				СтрокаАдреса.Идентификатор = ИдентификаторАдреса;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеАдресов;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "11.5.27.26";
	Обработчик.Процедура = "ДоставкаТоваров.ИнициализацияПоддержкиДоставки25";
	Обработчик.РежимВыполнения = "Монопольно";
	
КонецПроцедуры

Процедура ИнициализацияПоддержкиДоставки25() Экспорт
	
	Если Константы.ИспользоватьУправлениеДоставкой.Получить() = Истина
	   И Константы.НеИспользоватьУправлениеДоставкой20.Получить() = Ложь Тогда
		
		Константы.НеИспользоватьУправлениеДоставкой25.Установить(Истина);
		
	КонецЕсли;
	
	Если Константы.ВидПланированияДоставки.Получить().Пустая() Тогда
		
		Константы.ВидПланированияДоставки.Установить(Перечисления.ВидыПланированияДоставки.ТекущимДокументом);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Проведение

// Параметры:
//  Ссылка - ОпределяемыйТип.ДокументПланированияДоставки, ДокументСсылка.Рейс - 
//  ВидПланирования - ПеречислениеСсылка.ВидыПланированияДоставки -
//                  - Неопределено -
// 
// Возвращаемое значение:
//  Число - Уровень операции документа с учетом вида планирования
//
Функция УровеньОперацииДокумента(Ссылка, ВидПланирования = Неопределено) Экспорт
	
	ТипСсылки = ТипЗнч(Ссылка);
	Результат = -1;
	
	Если ТипСсылки = Тип("ДокументСсылка.ЗаказКлиента")
	 ИЛИ ТипСсылки = Тип("ДокументСсылка.РеализацияТоваровУслуг")
	 ИЛИ ТипСсылки = Тип("ДокументСсылка.ОтгрузкаТоваровКлиенту") Тогда
		
		Если ВидПланирования = Перечисления.ВидыПланированияДоставки.ОтдельнымДокументом Тогда
			Результат = 10;
		ИначеЕсли ВидПланирования = Перечисления.ВидыПланированияДоставки.ТекущимДокументом Тогда
			Результат = 15;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипСсылки = Тип("ДокументСсылка.ЗаказНаДоставку") Тогда
		
		Результат = 20;
		
	КонецЕсли;
	
	Если ТипСсылки = Тип("ДокументСсылка.Рейс") Тогда
		
		Результат = 30;
		
	КонецЕсли;
	
	//@skip-check module-nstr-camelcase
	ШаблонСообщения = НСтр("ru = 'Не удалось определить уровень операции документа.
						   |Переданные значения: Ссылка: ""%1"", ВидПланирования: ""%2""'");
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонСообщения,
		Строка(Ссылка),
		Строка(ВидПланирования));
	//@skip-check module-nstr-camelcase
	КонтекстСообщения = НСтр("ru = 'ДоставкаТоваров.УровеньОперацииДокумента'"); 
	ОбщегоНазначенияКлиентСервер.Проверить(
		Результат >= 0,
		ТекстСообщения,
		КонтекстСообщения);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Отказ - Булево - признак отказа записи
//  РежимЗаписи - РежимЗаписиДокумента - установленный режим записи документа
//
Процедура ПередЗаписью(Знач Документ, Отказ, Знач РежимЗаписи) Экспорт
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	ОжидаемыеТипыДокумента = Новый Массив; // Массив из Тип
	ОжидаемыеТипыДокумента.Добавить(Тип("ДокументОбъект.ЗаказКлиента"));
	ОжидаемыеТипыДокумента.Добавить(Тип("ДокументОбъект.РеализацияТоваровУслуг"));
	ОжидаемыеТипыДокумента.Добавить(Тип("ДокументОбъект.ОтгрузкаТоваровКлиенту"));
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ДоставкаТоваров.ПередЗаписью",
		"Документ",
		Документ,
		ОжидаемыеТипыДокумента);
	
	Если Документ.ЭтоНовый()
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ, "Исправление")
		И Документ.Исправление Тогда
		
		ВидПланированияДоставки = Документ.ВидПланированияДоставки;
		
	ИначеЕсли Документ.ЭтоНовый() Тогда
		
		ВидПланированияДоставки = Перечисления.ВидыПланированияДоставки.ПустаяСсылка();
		
	Иначе
		
		ВидПланированияДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Документ.Ссылка,
			"ВидПланированияДоставки"); // ПеречислениеСсылка.ВидыПланированияДоставки
		
	КонецЕсли;
	
	ДанныеДоставки = Новый Структура;
	ДанныеДоставки.Вставить("ПредыдущийВидПланированияДоставки", ВидПланированияДоставки);
	Документ.ДополнительныеСвойства.Вставить("ДанныеДоставки", ДанныеДоставки);
	
КонецПроцедуры

// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - См. ПроведениеДокументов.СвойстваДокумента
//
// Возвращаемое значение:
//  См. ПроведениеДокументов.ПараметрыУчетногоМеханизма
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка25() Тогда
		
		ТипДокумента = ТипЗнч(Документ);
		
		Если ТипДокумента = Тип("ДокументОбъект.Сторно")
			ИЛИ ТипДокумента = Тип("ДокументОбъект.РасходныйОрдерНаТовары") Тогда
			
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.Доставка);
			
		Иначе
			
			Параметры.ЕстьПроизводныеДвижения = Истина;
			
		КонецЕсли;
		
		Если Свойства.РежимЗаписи <> РежимЗаписиДокумента.Запись Тогда
			
			Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.Доставка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Возвращает тексты запросов для сторнирования движений при исправлении документов
// 
// Параметры:
//  МетаданныеДокумента - ОбъектМетаданныхДокумент - Метаданные документа, который проводится.
// 
// Возвращаемое значение:
//   Соответствие Из КлючИЗначение - Содержит тексты запросов сторнирования, где:
//    * Ключ - Строка - Полное имя регистра.
//    * Значение - Строка - Текст запроса.
//
Функция ТекстыЗапросовСторнирования(МетаданныеДокумента) Экспорт
	
	ТекстыЗапросов = Новый Соответствие();
	
	ДвиженияДокумента = МетаданныеДокумента.Движения;
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.Доставка;
	Если ДвиженияДокумента.Содержит(МетаданныеРегистра) Тогда
		
		ШаблонЗапроса =
		"ВЫБРАТЬ
		|	ДокументыСторно.Ссылка КАК Регистратор,
		|	ДокументыСторно.Дата КАК Период,
		|	&ПоляВыборки,
		|	ИСТИНА КАК Сторно
		|ИЗ
		|	РегистрНакопления.Доставка КАК ДанныеРегистра
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ &ИмяДокумента КАК ДокументыСторно
		|		ПО ДанныеРегистра.Регистратор = ДокументыСторно.СторнируемыйДокумент
		|			И (ДокументыСторно.Ссылка В (&Ссылка))
		|ГДЕ
		|	НЕ ДанныеРегистра.Сторно";
		
		МассивПолейВыборки = Новый Массив; // Массив из Строка
		Исключения = Новый Массив; // Массив из Строка
		
		Исключения.Добавить("Регистратор");
		Исключения.Добавить("Период");
		Исключения.Добавить("Сторно");
		Исключения.Добавить("НомерСтроки");
		Исключения.Добавить("Активность");
		
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(
			МетаданныеРегистра.СтандартныеРеквизиты,
			МассивПолейВыборки,
			Исключения);
		
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(
			МетаданныеРегистра.Измерения,
			МассивПолейВыборки,
			Исключения);
		
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(
			МетаданныеРегистра.Ресурсы,
			МассивПолейВыборки,
			Исключения,
			Истина);
		
		ТекстПоляВыборки = СтрСоединить(МассивПолейВыборки, "," + Символы.ПС);
		ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ПоляВыборки", ТекстПоляВыборки);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяДокумента", МетаданныеДокумента.ПолноеИмя());
		
		ТекстыЗапросов.Вставить(МетаданныеРегистра.ПолноеИмя(), ТекстЗапроса);
		
	КонецЕсли;
	
	Возврат ТекстыЗапросов;
	
КонецФункции

// Возникает перед выполнением записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПередЗаписьюДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	ТипДокумента = ТипЗнч(Документ);
	Если ТипДокумента <> Тип("ДокументОбъект.Сторно")
		И ТипДокумента <> Тип("ДокументОбъект.РасходныйОрдерНаТовары") Тогда
		
		// Из-за особенностей механизма проведения может возникать двойная запись.
		// Для избежания такой ситуации явно указываем, что РН Доставка не пишем механизмом движений
		Документ.Движения.Доставка.Записывать = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Возникает после выполнения записи регистров документа
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - 
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПослеЗаписиДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	ИмяРегистра = "Доставка";
	
	ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	ДопПараметры.ДополнительныеСвойства = ПроведениеДокументов.СвойстваДокумента(Документ);
	
	Если ДопПараметры.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		ОтменитьПроведениеДокументаДоставки(Документ, ИмяРегистра);
		
	Иначе
		
		СтрокиТоваровИзменениеТолькоУпаковки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Документ.ДополнительныеСвойства,
			"СтрокиТоваровИзменениеТолькоУпаковки",
			Новый ТаблицаЗначений); // ТаблицаЗначений
		ДопПараметры.Вставить("СтрокиТоваровИзменениеТолькоУпаковки", СтрокиТоваровИзменениеТолькоУпаковки);
		
		ТаблицыДляДвижений = ПроведениеДокументов.ДанныеДокументаДляПроведения(Документ.Ссылка, ИмяРегистра, ДопПараметры);
		
		ИмяТаблицы = "Таблица" + ИмяРегистра;
		ЕстьДанныеВТаблице = ТаблицыДляДвижений.Свойство(ИмяТаблицы);
		
		Если ЕстьДанныеВТаблице Тогда
			
			ТаблицаДанных = ТаблицыДляДвижений[ИмяТаблицы]; // ТаблицаЗначений
			
			Если ТаблицаДанных.Колонки.Найти("Регистратор") = Неопределено Тогда
				
				ТаблицаДанных.Колонки.Добавить("Регистратор");
				ТаблицаДанных.ЗаполнитьЗначения(Документ.Ссылка, "Регистратор");
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПредыдущийВидПланированияДоставки = Перечисления.ВидыПланированияДоставки.ПустаяСсылка();
		Если ТипЗнч(Документ) <> Тип("ДокументОбъект.ЗаказНаДоставку")
			И ТипЗнч(Документ) <> Тип("ДокументОбъект.Рейс") Тогда
			
			ПредыдущийВидПланированияДоставки = Документ.ДополнительныеСвойства.ДанныеДоставки.ПредыдущийВидПланированияДоставки; // ПеречислениеСсылка.ВидыПланированияДоставки
			
		КонецЕсли;
		
		МассивУровнейОпераций = Новый Массив; // Массив из Число
		УдалятьСторноДвижения = Истина;
		
		Если ТипЗнч(Документ) = Тип("ДокументОбъект.Рейс") Тогда
			
			УдалятьСторноДвижения = Ложь;
			
		ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаказНаДоставку") Тогда
			
			МассивУровнейОпераций.Добавить(20);
			
		ИначеЕсли НЕ Документ.ТребуетсяДоставка Тогда
			
			МассивУровнейОпераций.Добавить(20);
			МассивУровнейОпераций.Добавить(30);
			
		ИначеЕсли НЕ ПредыдущийВидПланированияДоставки.Пустая() Тогда
			
			УровеньПредыдущейОперации = УровеньОперацииДокумента(
				Документ.Ссылка,
				ПредыдущийВидПланированияДоставки);
			
			Если УровеньПредыдущейОперации = 10 Тогда
				
				МассивУровнейОпераций.Добавить(20);
				
			ИначеЕсли УровеньПредыдущейОперации = 15 Тогда
				
				МассивУровнейОпераций.Добавить(30);
				
			Иначе
				
				УдалятьСторноДвижения = Ложь;
				
			КонецЕсли;
			
		Иначе
			
			// Документ не был проведен, раз ПредыдущийВидПланированияДоставки не указан
			УдалятьСторноДвижения = Ложь;
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Доставка.Регистратор КАК Регистратор,
		|	Доставка.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрНакопления.Доставка КАК Доставка
		|ГДЕ
		|	&УдалятьСторноДвижения
		|	И Доставка.СторнируемыйДокументПланирования = &ДокументПланирования
		|	И Доставка.УровеньОперации В (&МассивУровнейОпераций)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Доставка.Регистратор,
		|	Доставка.НомерСтроки
		|ИЗ
		|	РегистрНакопления.Доставка КАК Доставка
		|ГДЕ
		|	Доставка.Регистратор = &ДокументПланирования";
		
		Если СтрокиТоваровИзменениеТолькоУпаковки.Количество() > 0 Тогда
			
			ТекстЗапросаВТСтрокиТоваровИзменениеТолькоУпаковки =
			"ВЫБРАТЬ
			|	СтрокиТоваровИзменениеТолькоУпаковки.Распоряжение КАК Распоряжение,
			|	СтрокиТоваровИзменениеТолькоУпаковки.КодСтрокиДоставки КАК КодСтрокиДоставки
			|ПОМЕСТИТЬ ВТ_СтрокиТоваровИзменениеТолькоУпаковки
			|ИЗ
			|	&СтрокиТоваровИзменениеТолькоУпаковки КАК СтрокиТоваровИзменениеТолькоУпаковки";
			
			ТекстВыборкиСторноДвиженияПоСтрокамСИзменениемУпаковки =
			"ВЫБРАТЬ
			|	Доставка.Регистратор КАК Регистратор,
			|	Доставка.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	ВТ_СтрокиТоваровИзменениеТолькоУпаковки КАК СтрокиТоваровИзменениеТолькоУпаковки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК Доставка
			|		ПО СтрокиТоваровИзменениеТолькоУпаковки.Распоряжение = Доставка.Распоряжение
			|			И СтрокиТоваровИзменениеТолькоУпаковки.КодСтрокиДоставки = Доставка.КодСтроки
			|ГДЕ
			|	Доставка.СторнируемыйДокументПланирования = &ДокументПланирования
			|	И Доставка.УровеньОперации = 30";
			
			ТекстЗапроса = ТекстЗапросаВТСтрокиТоваровИзменениеТолькоУпаковки
				+ ОбщегоНазначения.РазделительПакетаЗапросов()
				+ ТекстЗапроса
				+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()
				+ ТекстВыборкиСторноДвиженияПоСтрокамСИзменениемУпаковки;
			
			Запрос.УстановитьПараметр("СтрокиТоваровИзменениеТолькоУпаковки", СтрокиТоваровИзменениеТолькоУпаковки);
			
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ, "Исправление")
		   И Документ.Исправление Тогда
			
			ТекстВыборкиСторноДвиженияПредыдущихИсправлений =
			"ВЫБРАТЬ
			|	Доставка.Регистратор КАК Регистратор,
			|	Доставка.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	РегистрСведений.ИсправленияДокументов КАК ИсправленияДокументов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК Доставка
			|		ПО ИсправленияДокументов.ПредыдущееИсправление = Доставка.СторнируемыйДокументПланирования
			|ГДЕ
			|	ИсправленияДокументов.Регистратор = &ДокументПланирования
			|	И ИсправленияДокументов.ПредыдущееИсправление <> НЕОПРЕДЕЛЕНО
			|	И Доставка.УровеньОперации В (&МассивУровнейОпераций)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Доставка.Регистратор КАК Регистратор,
			|	Доставка.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	РегистрСведений.ИсправленияДокументов КАК ИсправленияДокументов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК Доставка
			|		ПО ИсправленияДокументов.ИсправляемыйДокумент = Доставка.СторнируемыйДокументПланирования
			|ГДЕ
			|	ИсправленияДокументов.Регистратор = &ДокументПланирования
			|	И ИсправленияДокументов.ПредыдущееИсправление = НЕОПРЕДЕЛЕНО
			|	И ИсправленияДокументов.ИсправляемыйДокумент <> НЕОПРЕДЕЛЕНО
			|	И Доставка.УровеньОперации В (&МассивУровнейОпераций)";
			
			ТекстЗапроса = ТекстЗапроса
				+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()
				+ ТекстВыборкиСторноДвиженияПредыдущихИсправлений;
			
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ДокументПланирования", Документ.Ссылка);
		Запрос.УстановитьПараметр("МассивУровнейОпераций", МассивУровнейОпераций);
		Запрос.УстановитьПараметр("УдалятьСторноДвижения", УдалятьСторноДвижения);
		ТаблицаУдаляемыхЗаписей = Запрос.Выполнить().Выгрузить();
		
		МассивРегистраторов = ТаблицаУдаляемыхЗаписей.ВыгрузитьКолонку("Регистратор"); // Массив Из ДокументСсылка
		
		Если ЕстьДанныеВТаблице Тогда
			
			ТаблицаДанных = ТаблицыДляДвижений[ИмяТаблицы]; // ТаблицаЗначений
			РегистраторыАктуальныхДвижений = ТаблицаДанных.ВыгрузитьКолонку("Регистратор"); // Массив Из ДокументСсылка
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивРегистраторов, РегистраторыАктуальныхДвижений, Истина);
			
		КонецЕсли;
		
		Если ТаблицаУдаляемыхЗаписей.Количество() > 0 Тогда
			
			НаборЗаписейУдаляемый = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
			МенеджерВТ = ПроведениеДокументов.МенеджерВременныхТаблицКонтроля(Документ);
			ПроведениеДокументов.УстановитьДопСвойстваРегистра(НаборЗаписейУдаляемый, Документ, МенеджерВТ, Истина);
			НаборЗаписейУдаляемый.ДополнительныеСвойства.Вставить("ФиксироватьИзмененияПослеЗаписи", НЕ ЕстьДанныеВТаблице);
			НаборЗаписейУдаляемый.ДополнительныеСвойства.Вставить("Регистраторы", МассивРегистраторов);
			НаборЗаписейУдаляемый.ДополнительныеСвойства.Вставить("НеОтражатьВБюджетировании", Истина);
			НаборЗаписейУдаляемый.РасширенныеРежимыЗамещения = Истина;
			НаборЗаписейУдаляемый.Отбор.Регистратор.Установить(, Ложь);
			НаборЗаписейУдаляемый.Загрузить(ТаблицаУдаляемыхЗаписей);
			НаборЗаписейУдаляемый.Записать(РежимЗамещения.Удаление);
			
		КонецЕсли;
		
		Если ЕстьДанныеВТаблице Тогда
			
			НаборЗаписейДобавляемый = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
			МенеджерВТ = ПроведениеДокументов.МенеджерВременныхТаблицКонтроля(Документ);
			ПроведениеДокументов.УстановитьДопСвойстваРегистра(НаборЗаписейДобавляемый, Документ, МенеджерВТ, Истина);
			НаборЗаписейДобавляемый.ДополнительныеСвойства.Вставить("ФиксироватьИзмененияПослеЗаписи", Истина);
			НаборЗаписейДобавляемый.ДополнительныеСвойства.Вставить("Регистраторы", МассивРегистраторов);
			НаборЗаписейДобавляемый.ДополнительныеСвойства.Вставить("НеОтражатьВБюджетировании", Истина);
			НаборЗаписейДобавляемый.РасширенныеРежимыЗамещения = Истина;
			НаборЗаписейДобавляемый.Отбор.Регистратор.Установить(, Ложь);
			НаборЗаписейДобавляемый.Загрузить(ТаблицаДанных);
			НаборЗаписейДобавляемый.Записать(РежимЗамещения.Добавление);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура формирования движений по подчиненным регистрам доставки.
//
// Параметры:
//	ТаблицыДляДвижений - Структура - таблицы данных документа
//	Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//	Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "Доставка");
	
КонецПроцедуры

// Дополняет текст запроса механизма проверки даты запрета по таблице изменений.
// 
// Параметры:
// 	Запрос - Запрос - используется для установки параметров запроса.
// 
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение:
//		* Ключ - Строка - Имя временной таблицы изменений регистра.
//		* Значение - Строка - Текст запроса.
//
Функция ТекстыЗапросовКонтрольДатыЗапретаПоТаблицеИзменений(Запрос) Экспорт
	
	СоответствиеТекстовЗапросов = Новый Соответствие();
	Возврат СоответствиеТекстовЗапросов;
	
КонецФункции

// Формирует тексты запросов для контроля изменений записанных движений регистров.
//
// Параметры:
//  Запрос - Запрос - запрос, хранящий параметры используемые в списке запросов
//  ТекстыЗапроса - СписокЗначений из Строка - список текстов запросов и их имен.
//  Документ - ДокументОбъект - записываемый документ.
//
Процедура ИнициализироватьДанныеКонтроляИзменений(Запрос, ТекстыЗапроса, Документ) Экспорт
	
	ИмяТаблицыКонтроля = "ДвиженияДоставкаИзменение";
	ЕстьИзмененияДвиженийДоставки = ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, ИмяТаблицыКонтроля);
	Если НЕ ЕстьИзмененияДвиженийДоставки Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыТаблицыКонтроля = Документ.ДополнительныеСвойства.ПроведениеДокументов.ТаблицыКонтроля[ИмяТаблицыКонтроля].Параметры; // См. НовыеПараметрыТаблицыКонтроляДоставки
	КонтролироватьОтклонениеМерныхТоваров = ПараметрыТаблицыКонтроля.ЕстьИзмененияМерныхТоваров; // Булево
	
	Если КонтролироватьОтклонениеМерныхТоваров Тогда
		
		ТекстЗапросаПервичныеНазначенияДоставкиДляМерных = ТекстЗапросаПервичныеНазначенияДоставкиДляМерных();
		ТекстыЗапроса.Добавить(ТекстЗапросаПервичныеНазначенияДоставкиДляМерных);
		
		ТекстЗапросаДопустимыеОтклоненияКРейсу = ТекстЗапросаДопустимыеОтклоненияКРейсу();
		ТекстыЗапроса.Добавить(ТекстЗапросаДопустимыеОтклоненияКРейсу);
		
		ВыражениеДопустимоеОтклонение = "ЕСТЬNULL(ДопустимыеОтклоненияОстатковДоставки.ДопустимоеОтклонение, 0)";
		
		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		Запрос.УстановитьПараметр(
			"ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров", ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров);
		
		МерныеТипыЕдиницИзмерений = Справочники.УпаковкиЕдиницыИзмерения.МерныеТипыЕдиницИзмерений();
		Запрос.УстановитьПараметр("МерныеТипыЕдиницИзмерений", МерныеТипыЕдиницИзмерений);
		
	Иначе
		
		ВыражениеДопустимоеОтклонение = "0";
		
	КонецЕсли;
	
	Если ПараметрыТаблицыКонтроля.ЕстьИзмененияКДоставкеКРейсу Тогда
		
		ТекстЗапросаКонтроляКДоставкеКРейсу = ТекстЗапросаКонтроляДоставки(
			"ДоставкаОбороты.КДоставкеОборот - ДоставкаОбороты.КРейсуОборот",
			Ложь,
			ВыражениеДопустимоеОтклонение,
			КонтролироватьОтклонениеМерныхТоваров);
		ТекстыЗапроса.Добавить(ТекстЗапросаКонтроляКДоставкеКРейсу, "ОшибкиКонтроляКДоставкеКРейсу");
		
	КонецЕсли;
	
	Если ПараметрыТаблицыКонтроля.ЕстьИзмененияКРейсуВРейсе Тогда
		
		ТекстЗапросаКонтроляКРейсуВРейсе = ТекстЗапросаКонтроляДоставки(
			"ДоставкаОбороты.КРейсуОборот - ДоставкаОбороты.ВРейсеОборот",
			Истина,
			ВыражениеДопустимоеОтклонение,
			КонтролироватьОтклонениеМерныхТоваров);
		ТекстыЗапроса.Добавить(ТекстЗапросаКонтроляКРейсуВРейсе, "ОшибкиКонтроляКРейсуВРейсе");
		
	КонецЕсли;
	
	Если ПараметрыТаблицыКонтроля.ЕстьИзмененияСборки Тогда
		
		ТекстЗапросаСклады = ТекстЗапросаКонтроляПараметрыСклада();
		ТекстыЗапроса.Добавить(ТекстЗапросаСклады);
		
		ТекстЗапросаПервичныеЗаписиДоставки = ТекстЗапросаПервичныеЗаписиДоставки();
		ТекстыЗапроса.Добавить(ТекстЗапросаПервичныеЗаписиДоставки);
		
		Если КонтролироватьОтклонениеМерныхТоваров Тогда
			
			ТекстЗапросаДопустимыеОтклоненияКСборке = ТекстЗапросаДопустимыеОтклоненияКСборке();
			ТекстыЗапроса.Добавить(ТекстЗапросаДопустимыеОтклоненияКСборке);
			
		КонецЕсли;
		
		ТекстЗапросаОборотыСборкиПоОрдеру = ТекстЗапросаОборотыСборкиПоОрдеру();
		ТекстыЗапроса.Добавить(ТекстЗапросаОборотыСборкиПоОрдеру);
		
		ТекстЗапросаОборотыКСборкеПоРейсу = ТекстЗапросаОборотыКСборкеПоРейсу();
		ТекстыЗапроса.Добавить(ТекстЗапросаОборотыКСборкеПоРейсу);
		
		ТекстЗапросаКонтроляКоличестваСборкиПоРейсу = ТекстЗапросаКонтроляКоличестваСборкиПоРейсу(
			ВыражениеДопустимоеОтклонение,
			КонтролироватьОтклонениеМерныхТоваров);
		ТекстыЗапроса.Добавить(ТекстЗапросаКонтроляКоличестваСборкиПоРейсу, "ОшибкиКонтроляКоличестваСборкиПоРейсу");
		
		ТекстЗапросаКонтроляСтатусовРейса = ТекстЗапросаКонтроляСтатусовРейса(
			ВыражениеДопустимоеОтклонение,
			КонтролироватьОтклонениеМерныхТоваров);
		ТекстыЗапроса.Добавить(ТекстЗапросаКонтроляСтатусовРейса, "ОшибкиКонтроляЗавершенияРейса");
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура - Параметры таблицы контроля доставки:
//  * ЕстьИзмененияКДоставкеКРейсу - Булево - Признак наличия изменений по ресурсам КДоставке или КРейсу
//  * ЕстьИзмененияКРейсуВРейсе - Булево - Признак наличия изменений по ресурсам ВРейсе или КРейсу
//  * ЕстьИзмененияСборки - Булево - Признак наличия изменений по ресурсам сборки
//  * ЕстьИзмененияМерныхТоваров - Булево - Признак наличия мерных товаров в изменениях движений.
//
Функция НовыеПараметрыТаблицыКонтроляДоставки() Экспорт
	
	ПараметрыТаблицыКонтроля = Новый Структура;
	ПараметрыТаблицыКонтроля.Вставить("ЕстьИзмененияКДоставкеКРейсу", Ложь);
	ПараметрыТаблицыКонтроля.Вставить("ЕстьИзмененияКРейсуВРейсе", Ложь);
	ПараметрыТаблицыКонтроля.Вставить("ЕстьИзмененияСборки", Ложь);
	ПараметрыТаблицыКонтроля.Вставить("ЕстьИзмененияМерныхТоваров", Ложь);
	Возврат ПараметрыТаблицыКонтроля;
	
КонецФункции

// Выводит сообщения пользователю при наличии ошибок контроля изменений записанных движений регистров.
//
// Параметры:
//  РезультатыКонтроля - Структура - таблицы с результатами контроля изменений:
//    * ОшибкиКонтроляКДоставкеКРейсу - ТаблицаЗначений:
//      ** Организация - СправочникСсылка.Организации
//      ** Отправитель - СправочникСсылка.Склады, СправочникСсылка.Партнеры -
//      ** Получатель - СправочникСсылка.Партнеры
//      ** Распоряжение - ОпределяемыйТип.РаспоряжениеНаДоставку25
//      ** Номенклатура - СправочникСсылка.Номенклатура
//      ** Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//      ** Серия - СправочникСсылка.СерииНоменклатуры
//      ** Превышение - Число
//      ** ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения
//    * ОшибкиКонтроляКРейсуВРейсе - ТаблицаЗначений:
//      ** Организация - СправочникСсылка.Организации
//      ** Отправитель - СправочникСсылка.Склады, СправочникСсылка.Партнеры -
//      ** Получатель - СправочникСсылка.Партнеры
//      ** Распоряжение - ОпределяемыйТип.РаспоряжениеНаДоставку25
//      ** Номенклатура - СправочникСсылка.Номенклатура
//      ** Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//      ** Серия - СправочникСсылка.СерииНоменклатуры
//      ** Превышение - Число
//      ** ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения
//    * ОшибкиКонтроляКоличестваСборкиПоРейсу - ТаблицаЗначений:
//      ** Распоряжение - ОпределяемыйТип.РаспоряжениеНаДоставку25
//      ** Номенклатура - СправочникСсылка.Номенклатура
//      ** Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//      ** Серия - СправочникСсылка.СерииНоменклатуры
//      ** Назначение - СправочникСсылка.Назначения
//      ** Рейс - ДокументСсылка.Рейс
//      ** Превышение - Число
//      ** ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения
//    * ОшибкиКонтроляЗавершенияРейса - ТаблицаЗначений:
//      ** Отправитель - СправочникСсылка.Склады
//      ** Распоряжение - ОпределяемыйТип.РаспоряжениеНаДоставку25
//      ** Номенклатура - СправочникСсылка.Номенклатура
//      ** Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//      ** Серия - СправочникСсылка.СерииНоменклатуры
//      ** Рейс - ДокументСсылка.Рейс
//      ** ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения
//      ** Превышение - Число
//  Документ - ДокументОбъект - записываемый документ
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура СообщитьОРезультатахКонтроляИзменений(РезультатыКонтроля, Документ, Отказ) Экспорт
	
	Если РезультатыКонтроля.Свойство("ОшибкиКонтроляКДоставкеКРейсу")
	   И ЗначениеЗаполнено(РезультатыКонтроля.ОшибкиКонтроляКДоставкеКРейсу) Тогда
		
		РезультатыКонтроля.ОшибкиКонтроляКДоставкеКРейсу.Свернуть(
			"Отправитель,Распоряжение,Номенклатура,Характеристика,Серия,ЕдиницаИзмерения",
			"Превышение");
		
		Для Каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиКонтроляКДоставкеКРейсу Цикл
			
			Если ТипЗнч(СтрокаОшибки.Отправитель) = Тип("СправочникСсылка.Склады") Тогда
				
				ШаблонСообщения = НСтр("ru = 'По распоряжению %1 товара %2 со склада %3 запланировано к рейсу больше, чем требуется доставить, на %4 %5'");
				
			Иначе
				
				ШаблонСообщения = НСтр("ru = 'По распоряжению %1 товара %2 от перевозчика %3 запланировано к рейсу больше, чем требуется доставить, на %4 %5'");
				
			КонецЕсли;
			
			ПредставленияПолей = ПредставленияПолейРезультатовКонтроля(СтрокаОшибки);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения,
				ПредставленияПолей.Распоряжение,
				ПредставленияПолей.Номенклатура,
				ПредставленияПолей.Отправитель,
				ПредставленияПолей.Превышение,
				ПредставленияПолей.ЕдиницаИзмерения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ,,, Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если РезультатыКонтроля.Свойство("ОшибкиКонтроляКРейсуВРейсе")
	   И ЗначениеЗаполнено(РезультатыКонтроля.ОшибкиКонтроляКРейсуВРейсе) Тогда
		
		РезультатыКонтроля.ОшибкиКонтроляКРейсуВРейсе.Свернуть(
			"Отправитель,Получатель,Распоряжение,Номенклатура,Характеристика,Серия,ЕдиницаИзмерения",
			"Превышение");
		
		Для Каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиКонтроляКРейсуВРейсе Цикл
			
			Если ТипЗнч(СтрокаОшибки.Отправитель) = Тип("СправочникСсылка.Склады") Тогда
				
				ШаблонСообщения = НСтр("ru = 'По распоряжению %1 товара %2 со склада %3 для получателя %4 в рейсы включено больше, чем запланировано, на %5 %6'");
				
			Иначе
				
				ШаблонСообщения = НСтр("ru = 'По распоряжению %1 товара %2 от перевозчика %3 для получателя %4 в рейсы включено больше, чем запланировано, на %5 %6'");
				
			КонецЕсли;
			
			ПредставленияПолей = ПредставленияПолейРезультатовКонтроля(СтрокаОшибки);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения,
				ПредставленияПолей.Распоряжение,
				ПредставленияПолей.Номенклатура,
				ПредставленияПолей.Отправитель,
				ПредставленияПолей.Получатель,
				ПредставленияПолей.Превышение,
				ПредставленияПолей.ЕдиницаИзмерения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ,,, Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если РезультатыКонтроля.Свойство("ОшибкиКонтроляКоличестваСборкиПоРейсу")
	   И ЗначениеЗаполнено(РезультатыКонтроля.ОшибкиКонтроляКоличестваСборкиПоРейсу) Тогда
		
		РезультатыКонтроля.ОшибкиКонтроляКоличестваСборкиПоРейсу.Свернуть(
			"Распоряжение,Рейс,Номенклатура,Характеристика,Серия,Назначение,ЕдиницаИзмерения",
			"Превышение");
		
		Для Каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиКонтроляКоличестваСборкиПоРейсу Цикл
			
			ШаблонСообщения = НСтр("ru = 'По распоряжению %1 товара %2 планируется к отгрузке больше, чем в рейсе %3, на %4 %5'");
			
			ПредставленияПолей = ПредставленияПолейРезультатовКонтроля(СтрокаОшибки);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения,
				ПредставленияПолей.Распоряжение,
				ПредставленияПолей.Номенклатура,
				ПредставленияПолей.Рейс,
				ПредставленияПолей.Превышение,
				ПредставленияПолей.ЕдиницаИзмерения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ,,, Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если РезультатыКонтроля.Свойство("ОшибкиКонтроляЗавершенияРейса")
	   И ЗначениеЗаполнено(РезультатыКонтроля.ОшибкиКонтроляЗавершенияРейса) Тогда
		
		Для Каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиКонтроляЗавершенияРейса Цикл
			
			ПредставленияПолей = ПредставленияПолейРезультатовКонтроля(СтрокаОшибки);
			
			Если СтрокаОшибки.Превышение > 0 Тогда
				
				ШаблонСообщения = НСтр("ru = 'По распоряжению %1 товара %2 собрано больше, чем указано в рейсе, на %3 %4'");
				Отклонение = СтрокаОшибки.Превышение;
				
			Иначе
				
				ШаблонСообщения = НСтр("ru = 'По распоряжению %1 товара %2 собрано меньше, чем указано в рейсе, на %3 %4'");
				Отклонение = -СтрокаОшибки.Превышение;
				
			КонецЕсли;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения,
				ПредставленияПолей.Распоряжение,
				ПредставленияПолей.Номенклатура,
				Формат(Отклонение, "ЧГ=0;"),
				ПредставленияПолей.ЕдиницаИзмерения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ,,, Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет подготовку итоговых запросов отражения документа по регистру доставки.
// 
// Параметры:
//  Запрос - Запрос - Запрос отражения документа:
//   * Параметры - Структура - Должны быть установлены обязательные параметры:
//    ** Ссылка - ДокументСсылка
//    ** УровеньОперации - Число
//    ** ЭтоНовый - Булево
//    ** СтрокиТоваровИзменениеТолькоУпаковки - ТаблицаЗначений
//  Регистры - Неопределено, Структура, Строка - Список регистров для отражения
//  ТекстыЗапроса - СписокЗначений из Строка - Список текстов запроса отражения документа
//  ТекстЗапросаДокумента - Строка - Текст запроса выборки данных документа
//  СинонимТаблицыДокумента - Строка - Синоним основной таблицы в ТекстЗапросаДокумента
//
Процедура ДополнитьЗапросОтраженияДокумента(Запрос, Регистры, ТекстыЗапроса, ТекстЗапросаДокумента, СинонимТаблицыДокумента) Экспорт
	
	ЕстьСтрокиТоваровИзменениеТолькоУпаковки = Запрос.Параметры.Свойство("СтрокиТоваровИзменениеТолькоУпаковки");
	
	ТекстыШаблоновОтражения = Новый Структура();
	ТекстыЗапросовДанныхДокумента = Новый Структура();
	ТекстыЗапросовВременныхТаблиц = Новый Структура();
	
	ТекстыЗапросовДанныхДокумента.Вставить(СинонимТаблицыДокумента, ТекстЗапросаДокумента);
	
	// Сравнение с предыдущим уровнем планирования
	
	ТекстЗапроса = ТекстЗапросаВТТекущийУровеньТ2();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТТекущийУровеньТ2", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТОтборДоставкиПредыдущегоУровня();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТОтборДоставкиПредыдущегоУровня", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТПредыдущийУровеньТ1();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТПредыдущийУровеньТ1", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТПлечиПредыдущегоУровняТ1();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТПлечиПредыдущегоУровняТ1", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТКлючевыеПоляТекущегоУровняТ2();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТКлючевыеПоляТекущегоУровняТ2", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТНедостающиеПлечиТекущегоУровняТ2();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТНедостающиеПлечиТекущегоУровняТ2", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТТекущийУровеньТ2_ДополнениеПлеч();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТТекущийУровеньТ2_ДополнениеПлеч", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТПлечиТекущегоУровняТ2();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТПлечиТекущегоУровняТ2", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТКлючевыеПоляПредыдущегоУровняТ1();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТКлючевыеПоляПредыдущегоУровняТ1", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТНедостающиеПлечиПредыдущегоУровняТ1();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТНедостающиеПлечиПредыдущегоУровняТ1", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТПредыдущийУровеньТ1_ДополнениеПлеч();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТПредыдущийУровеньТ1_ДополнениеПлеч", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТКонтрольИзмененияПолейТекущегоУровня();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТКонтрольИзмененияПолейТекущегоУровня", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТСравнениеТекущегоУровняСПредыдущим();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТСравнениеТекущегоУровняСПредыдущим", ТекстЗапроса);
	
	// Сравнение со следующим уровнем планирования
	
	ТекстЗапроса = ТекстЗапросаВТТекущийУровеньТ1();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТТекущийУровеньТ1", ТекстЗапроса);
	
	Если ЕстьСтрокиТоваровИзменениеТолькоУпаковки Тогда
		
		ТекстЗапроса = ТекстЗапросаВТСтрокиТоваровИзменениеТолькоУпаковки();
		ТекстыЗапросовВременныхТаблиц.Вставить("ВТСтрокиТоваровИзменениеТолькоУпаковки", ТекстЗапроса);
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаВТОтборДоставкиСледующегоУровня(ЕстьСтрокиТоваровИзменениеТолькоУпаковки);
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТОтборДоставкиСледующегоУровня", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТСледующийУровеньТ2();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТСледующийУровеньТ2", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТПлечиТекущегоУровняТ1();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТПлечиТекущегоУровняТ1", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТКлючевыеПоляСледующегоУровняТ2();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТКлючевыеПоляСледующегоУровняТ2", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТНедостающиеПлечиСледующегоУровняТ2();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТНедостающиеПлечиСледующегоУровняТ2", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТСледующийУровеньТ2_ДополнениеПлеч();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТСледующийУровеньТ2_ДополнениеПлеч", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТПлечиСледующегоУровняТ2();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТПлечиСледующегоУровняТ2", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТКлючевыеПоляТекущегоУровняТ1();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТКлючевыеПоляТекущегоУровняТ1", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТНедостающиеПлечиТекущегоУровняТ1();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТНедостающиеПлечиТекущегоУровняТ1", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТТекущийУровеньТ1_ДополнениеПлеч();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТТекущийУровеньТ1_ДополнениеПлеч", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТКонтрольИзмененияПолейСледующегоУровня();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТКонтрольИзмененияПолейСледующегоУровня", ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТСравнениеТекущегоУровняСоСледующим();
	ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента);
	ТекстыЗапросовВременныхТаблиц.Вставить("ВТСравнениеТекущегоУровняСоСледующим", ТекстЗапроса);
	
	// Формирование движений со сторно
	
	ШаблонЗапросаДоставка = ШаблонЗапросаДоставка();
	ПодставитьСинонимТаблицыДокумента(ШаблонЗапросаДоставка, СинонимТаблицыДокумента);
	
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений("Доставка", Регистры) Тогда
		ТекстыШаблоновОтражения.Вставить("Доставка", ШаблонЗапросаДоставка);
	КонецЕсли;
	
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(
		Запрос,
		ТекстыЗапроса,
		ТекстыШаблоновОтражения,
		ТекстыЗапросовДанныхДокумента,
		ТекстыЗапросовВременныхТаблиц);
	
КонецПроцедуры

// Параметры:
//  Запрос - Запрос
//  ДопПараметры - См. ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения
//
Процедура УстановитьПараметрыЗапросаПроведения(Запрос, ДопПараметры = Неопределено) Экспорт
	
	ДополнительныеСвойства = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "ДополнительныеСвойства"); // Структура
	ЭтоНовый = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЭтоНовый", Ложь);
	Запрос.УстановитьПараметр("ЭтоНовый", ЭтоНовый);
	
	СтрокиТоваровИзменениеТолькоУпаковки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "СтрокиТоваровИзменениеТолькоУпаковки"); // См. СтрокиТоваровИзменениеТолькоУпаковки
	Если СтрокиТоваровИзменениеТолькоУпаковки <> Неопределено
	   И ТипЗнч(СтрокиТоваровИзменениеТолькоУпаковки) = Тип("ТаблицаЗначений")
	   И СтрокиТоваровИзменениеТолькоУпаковки.Количество() > 0 Тогда
		
		Запрос.УстановитьПараметр("СтрокиТоваровИзменениеТолькоУпаковки", СтрокиТоваровИзменениеТолькоУпаковки);
		
	КонецЕсли;
	
	ЕстьСтрокиТоваровИзменениеТолькоУпаковки = Запрос.Параметры.Свойство("СтрокиТоваровИзменениеТолькоУпаковки");
	
	ТекущийУровеньОперации = Запрос.Параметры.УровеньОперации;
	ПредыдущиеУровниОперации = ПредыдущиеУровниОперации(ТекущийУровеньОперации);
	Запрос.УстановитьПараметр("ПредыдущиеУровниОперации", ПредыдущиеУровниОперации);
	СледующиеУровниОперации = СледующиеУровниОперации(ТекущийУровеньОперации, ЕстьСтрокиТоваровИзменениеТолькоУпаковки);
	Запрос.УстановитьПараметр("СледующиеУровниОперации", СледующиеУровниОперации);
	
	Если Не Запрос.Параметры.Свойство("Исправление") Тогда
		Запрос.УстановитьПараметр("Исправление", Ложь);
	КонецЕсли;
	
	Если ДопПараметры.Свойство("ПредыдущееИсправление") Тогда
		
		ПредыдущееИсправление = ДопПараметры.ПредыдущееИсправление;
		
	ИначеЕсли Запрос.Параметры.Исправление Тогда
		
		ЗапросПредыдущееИсправление = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ИсправленияДокументов.ПредыдущееИсправление <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ИсправленияДокументов.ПредыдущееИсправление
		|		ИНАЧЕ ИсправленияДокументов.ИсправляемыйДокумент
		|	КОНЕЦ КАК ПредыдущееИсправление
		|ИЗ
		|	РегистрСведений.ИсправленияДокументов КАК ИсправленияДокументов
		|ГДЕ
		|	ИсправленияДокументов.Регистратор = &Ссылка";
		ЗапросПредыдущееИсправление.Текст = ТекстЗапроса;
		ЗапросПредыдущееИсправление.УстановитьПараметр("Ссылка", Запрос.Параметры.Ссылка);
		
		Выборка = ЗапросПредыдущееИсправление.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПредыдущееИсправление = Выборка.ПредыдущееИсправление; // ДокументСсылка
		Иначе
			ПредыдущееИсправление = Запрос.Параметры.ИсправляемыйДокумент;
		КонецЕсли;
		
	Иначе
		
		ПредыдущееИсправление = Запрос.Параметры.Ссылка;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПредыдущееИсправление", ПредыдущееИсправление);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыПланированияДоставки
//
Функция ВидПланированияДоставкиНаУровнеСистемы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ЗначениеНастройки = Константы.ВидПланированияДоставки.Получить();
	
	Возврат ЗначениеНастройки;
	
КонецФункции

// Возвращает вид планирования доставки из соглашения с клиентом, если он заполнен. Иначе - из партнера.
// Если вид планирования доставки не заполнен ни в соглашении, ни в партнере, возвращает значение системной настройки.
//
// Параметры:
//  Партнер - СправочникСсылка.Партнеры -
//  Соглашение - СправочникСсылка.СоглашенияСКлиентами -
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыПланированияДоставки -
//
Функция ВидПланированияДоставкиПоПартнеруСоглашению(Партнер, Соглашение) Экспорт
	
	ИсточникиНастроек = Новый Массив; // Массив из СправочникСсылка.Партнеры, СправочникСсылка.СоглашенияСКлиентами
	ИсточникиНастроек.Добавить(Партнер);
	ИсточникиНастроек.Добавить(Соглашение);
	
	ВидыПланирования = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ИсточникиНастроек, "ВидПланированияДоставки");
	
	Если ЗначениеЗаполнено(ВидыПланирования[Соглашение]) Тогда
		
		ВидПланированияДоставки = ВидыПланирования[Соглашение];
		
	ИначеЕсли ЗначениеЗаполнено(ВидыПланирования[Партнер]) Тогда 
		
		ВидПланированияДоставки = ВидыПланирования[Партнер];
		
	Иначе
		
		ВидПланированияДоставки = ВидПланированияДоставкиНаУровнеСистемы();
		
	КонецЕсли;
	
	Возврат ВидПланированияДоставки;
	
КонецФункции

// Параметры:
//  ПроверкаВТранзакции - Булево
// 
// Возвращаемое значение:
//   Структура:
//   * ПереходДоступен - Булево -
//   * ЕстьОстаткиКОтгрузке - Булево
//   * ЕстьСкладыСборкаПослеДоставки - Булево -
//
Функция ПроверитьВозможностьПереходаНаДоставку25(ПроверкаВТранзакции = Ложь) Экспорт
	
	ДанныеЗаданийНаПеревозку = ДанныеЗаданийНаПеревозкуБезОтметкиОДоставке();
	
	Если ДанныеЗаданийНаПеревозку.КоличествоДокументов > 0 Тогда
		
		ИмяСобытия = НСтр("ru = 'Переход на управление доставкой 2.5'", ОбщегоНазначения.КодОсновногоЯзыка());
		
		ШаблонСообщения = НСтр("ru = 'Перед началом перехода на управление доставкой 2.5 найдено %1 закрытых заданий на перевозку, в которых не отмечена доставка по всем пунктам маршрута (флаг ""Все товары по пункту маршрута доставлены""):
									 |%2'");
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			Формат(ДанныеЗаданийНаПеревозку.КоличествоДокументов, "ЧГ=0"),
			ДанныеЗаданийНаПеревозку.ИнформацияОДокументах);
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
		
	КонецЕсли;
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ПереходДоступен", Истина);
	РезультатПроверки.Вставить("ЕстьОстаткиКОтгрузке", Ложь);
	РезультатПроверки.Вставить("ЕстьСкладыСборкаПослеДоставки", Ложь);
	
	РезультатПроверки.ЕстьОстаткиКОтгрузке = ЕстьОстаткиКОтгрузкеДоЗавершенияПереходаНаДоставку25(ПроверкаВТранзакции);
	Если НЕ РезультатПроверки.ЕстьОстаткиКОтгрузке Тогда
		
		ПорядокОформления = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить();
		Если ПорядокОформления = Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаНакладные Тогда
			
			РезультатПроверки.ЕстьСкладыСборкаПослеДоставки = ЕстьСкладыССборкойПослеДоставки(ПроверкаВТранзакции);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатПроверки.ЕстьОстаткиКОтгрузке
	 ИЛИ РезультатПроверки.ЕстьСкладыСборкаПослеДоставки Тогда
		
		РезультатПроверки.ПереходДоступен = Ложь;
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

// см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.СборкаПоРейсу);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.НакладныеПоРаспоряжениямРейса);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.СостояниеДоставки);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.МаршрутРейса);
	
КонецПроцедуры

Функция ИспользоваласьДоставка25() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Доставка.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	РегистрНакопления.Доставка КАК Доставка";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	ЕстьДвижения = НЕ РезультатЗапроса.Пустой();
	
	Возврат ЕстьДвижения;
	
КонецФункции

// Возвращаемое значение:
//  Структура - Данные заданий на перевозку без отметки о доставке:
// * КоличествоДокументов - Число - 
// * ИнформацияОДокументах - Строка - 
//
Функция ДанныеЗаданийНаПеревозкуБезОтметкиОДоставке() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КоличествоДокументов", 0);
	Результат.Вставить("ИнформацияОДокументах", "");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаданиеНаПеревозкуМаршрут.Ссылка) КАК КоличествоДокументов
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Маршрут КАК ЗаданиеНаПеревозкуМаршрут
	|ГДЕ
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.Проведен
	|	И ЗаданиеНаПеревозкуМаршрут.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийНаПеревозку.Закрыто)
	|	И НЕ ЗаданиеНаПеревозкуМаршрут.Доставлено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка КАК ЗаданиеНаПеревозку,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Маршрут КАК ЗаданиеНаПеревозкуМаршрут
	|ГДЕ
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка.Проведен
	|	И ЗаданиеНаПеревозкуМаршрут.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийНаПеревозку.Закрыто)
	|	И НЕ ЗаданиеНаПеревозкуМаршрут.Доставлено
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаКоличество = РезультатыЗапроса[0].Выбрать();
	ВыборкаКоличество.Следующий();
	КоличествоДокументов = ВыборкаКоличество.КоличествоДокументов; // Число
	
	Результат.КоличествоДокументов = КоличествоДокументов;
	
	СсылкиНаДокументы = РезультатыЗапроса[1].Выгрузить().ВыгрузитьКолонку("ЗаданиеНаПеревозку");
	КоличествоВыбранныхДокументов = СсылкиНаДокументы.Количество();
	Если КоличествоВыбранныхДокументов > 0 Тогда
		
		СоответствиеПредставлений = ОбщегоНазначения.ПредметыСтрокой(СсылкиНаДокументы);
		ПредставленияДокументов = ОбщегоНазначенияУТКлиентСервер.ПреобразоватьСоответствиеИлиСтруктуруВМассив(
			СоответствиеПредставлений,
			Ложь);
		
		ДокументыСтрокой = СтрСоединить(ПредставленияДокументов, Символы.ПС);
		
	КонецЕсли;
	
	Если КоличествоДокументов > КоличествоВыбранныхДокументов Тогда
		
		КоличествоДополнительно = КоличествоДокументов - КоличествоВыбранныхДокументов;
		ШаблонДополнение = НСтр("ru = '%1 (и еще %2)'");
		ДокументыСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонДополнение,
			ДокументыСтрокой,
			Формат(КоличествоДополнительно, "ЧГ=0;"));
		
	КонецЕсли;
	
	Результат.ИнформацияОДокументах = ДокументыСтрокой;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ПроверкаВТранзакции - Булево -
// 
// Возвращаемое значение:
//  Булево -
//
Функция ЕстьСкладыССборкойПослеДоставки(ПроверкаВТранзакции = Ложь) Экспорт
	
	Если ПроверкаВТранзакции Тогда
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных();
			ЭлементБлокировки = Блокировка.Добавить("Справочник.Склады");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
		Исключение
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	НайденыСклады = НЕ РезультатЗапроса.Пустой();
	
	Возврат НайденыСклады;
	
КонецФункции

// Параметры:
//  Владелец - СправочникСсылка.Партнеры -
//           - СправочникСсылка.Склады -
// 
// Возвращаемое значение:
//  Булево -
//
Функция ЕстьДействующиеТочкиДоставки(Владелец) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТочкиДоставки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТочкиДоставки КАК ТочкиДоставки
	|ГДЕ
	|	ТочкиДоставки.Владелец = &Владелец
	|	И НЕ ТочкиДоставки.НеИспользуется";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	РезультатЗапроса = Запрос.Выполнить();
	
	ЕстьДействующиеТД = НЕ РезультатЗапроса.Пустой();
	
	Возврат ЕстьДействующиеТД;
	
КонецФункции

// Параметры:
//  ДокументДоставки - ОпределяемыйТип.ДокументПланированияДоставки
// 
// Возвращаемое значение:
//  См. ДопПараметры
//
Функция ДополнительныеПараметрыИзШапкиДокумента(ДокументДоставки) Экспорт
	
	ДопПараметры = ДопПараметры();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ШапкаДокумента.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ШапкаДокумента.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ШапкаДокумента.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ШапкаДокумента.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	&ПолеДополнительнаяИнформация КАК ДополнительнаяИнформацияПоДоставке
	|ИЗ
	|	&ТаблицаДокумента КАК ШапкаДокумента
	|ГДЕ
	|	ШапкаДокумента.Ссылка = &ДокументДоставки";
	
	ТаблицаДокумента = ДокументДоставки.Метаданные().ПолноеИмя();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаДокумента", ТаблицаДокумента);
	
	Если ТипЗнч(ДокументДоставки) = Тип("ДокументСсылка.ЗаказНаДоставку") Тогда
		ПолеДополнительнаяИнформация = "ШапкаДокумента.ДополнительнаяИнформация";
	Иначе
		ПолеДополнительнаяИнформация = "ШапкаДокумента.ДополнительнаяИнформацияПоДоставке";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДополнительнаяИнформация", ПолеДополнительнаяИнформация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДокументДоставки", ДокументДоставки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ДопПараметры, Выборка);
		
	КонецЕсли;
	
	Возврат ДопПараметры;
	
КонецФункции

// Параметры:
//  ДокументыДоставки - Массив Из ОпределяемыйТип.ДокументПланированияДоставки, ОпределяемыйТип.РаспоряжениеНаДоставку25 -
//  ОтборПараметров - Структура:
//  * Распоряжение - ОпределяемыйТип.РаспоряжениеНаДоставку25
//  * Отправитель - СправочникСсылка.Склады, СправочникСсылка.Партнеры - 
//  * СпособДоставки - ПеречислениеСсылка.СпособыДоставки25
//  * Получатель - СправочникСсылка.Партнеры
//  * ТочкаПолучателя - СправочникСсылка.ТочкиДоставки
//  * ЗонаПолучателя - СправочникСсылка.ЗоныДоставки
//  * ДатаОтгрузки - Дата
//  * Номенклатура - СправочникСсылка.Номенклатура
//  * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//  * Серия - СправочникСсылка.СерииНоменклатуры
//  * Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения
//  ИспользоватьОтборПоТоварам - Булево
// 
// Возвращаемое значение:
//  См. ДопПараметры
//
Функция СовпадающиеДополнительныеПараметрыИзСтрокДокументов(ДокументыДоставки, ОтборПараметров, ИспользоватьОтборПоТоварам) Экспорт
	
	ДопПараметры = ДопПараметры();
	
	ВариантыДопПараметров = ВсеДополнительныеПараметрыИзСтрокДокументов(ДокументыДоставки, ОтборПараметров, ИспользоватьОтборПоТоварам);
	
	Если ВариантыДопПараметров.Количество() = 1 Тогда
		
		ЗаполнитьЗначенияСвойств(ДопПараметры, ВариантыДопПараметров[0]);
		
	Иначе
		
		КолонкиБезСтрок = "ОсобыеУсловияПеревозки,ОсобыеУсловияПеревозкиОписаниеХеш,ВремяДоставкиС,ВремяДоставкиПо,ДополнительнаяИнформацияПоДоставкеХеш";
		КопияВариантыДопПараметров = ВариантыДопПараметров.Скопировать(, КолонкиБезСтрок);
		КопияВариантыДопПараметров.Свернуть(КолонкиБезСтрок);
		
		Если КопияВариантыДопПараметров.Количество() = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(ДопПараметры, ВариантыДопПараметров[0]);
			
		Иначе
			
			ДопПараметры.Совпадают = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДопПараметры;
	
КонецФункции

// Параметры:
//  ДокументыДоставки - Массив Из ОпределяемыйТип.ДокументПланированияДоставки, ОпределяемыйТип.РаспоряжениеНаДоставку25 -
//  ОтборПараметров - Структура:
//  * Распоряжение - ОпределяемыйТип.РаспоряжениеНаДоставку25
//  * Отправитель - СправочникСсылка.Склады, СправочникСсылка.Партнеры - 
//  * СпособДоставки - ПеречислениеСсылка.СпособыДоставки25
//  * Получатель - СправочникСсылка.Партнеры
//  * ТочкаПолучателя - СправочникСсылка.ТочкиДоставки
//  * ЗонаПолучателя - СправочникСсылка.ЗоныДоставки
//  * ДатаОтгрузки - Дата
//  * Номенклатура - СправочникСсылка.Номенклатура
//  * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//  * Серия - СправочникСсылка.СерииНоменклатуры
//  * Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения
//  ИспользоватьОтборПоТоварам - Булево
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * ДокументДоставки - ОпределяемыйТип.ДокументПланированияДоставки, ОпределяемыйТип.РаспоряжениеНаДоставку25 -
//  * КодСтроки - Число
//  * ВремяДоставкиС - Дата
//  * ВремяДоставкиПо - Дата
//  * ДополнительнаяИнформацияПоДоставке - Строка
//  * ОсобыеУсловияПеревозки - Булево
//  * ОсобыеУсловияПеревозкиОписание - Строка
//  * ОсобыеУсловияПеревозкиОписаниеХеш - Строка
//  * ДополнительнаяИнформацияПоДоставкеХеш - Строка
//
Функция ВсеДополнительныеПараметрыИзСтрокДокументов(ДокументыДоставки, ОтборПараметров = Неопределено, ИспользоватьОтборПоТоварам = Ложь) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ШапкаДокумента.Ссылка КАК ДокументДоставки,
	|	0 КАК КодСтроки,
	|	ШапкаДокумента.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ШапкаДокумента.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ШапкаДокумента.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ШапкаДокумента.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ШапкаДокумента.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ШапкаДокумента
	|ГДЕ
	|	ШапкаДокумента.Ссылка В (&ДокументыДоставкиРеализацияТоваровУслуг)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШапкаДокумента.Ссылка КАК ДокументДоставки,
	|	0 КАК КодСтроки,
	|	ШапкаДокумента.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ШапкаДокумента.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ШапкаДокумента.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ШапкаДокумента.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ШапкаДокумента.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке
	|ИЗ
	|	Документ.ОтгрузкаТоваровКлиенту КАК ШапкаДокумента
	|ГДЕ
	|	ШапкаДокумента.Ссылка В (&ДокументыДоставкиОтгрузкаТоваровКлиенту)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШапкаДокумента.Ссылка КАК ДокументДоставки,
	|	0 КАК КодСтроки,
	|	ШапкаДокумента.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ШапкаДокумента.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ШапкаДокумента.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ШапкаДокумента.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ШапкаДокумента.ДополнительнаяИнформация КАК ДополнительнаяИнформацияПоДоставке
	|ИЗ
	|	Документ.ЗаказНаДоставку КАК ШапкаДокумента
	|ГДЕ
	|	ШапкаДокумента.Ссылка В (&ДокументыДоставкиЗаказНаДоставку)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШапкаДокумента.Ссылка КАК ДокументДоставки,
	|	0 КАК КодСтроки,
	|	ШапкаДокумента.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ШапкаДокумента.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ШапкаДокумента.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ШапкаДокумента.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ШапкаДокумента.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке
	|ИЗ
	|	Документ.ЗаказКлиента КАК ШапкаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ТоварыДокумента
	|		ПО ШапкаДокумента.Ссылка = ТоварыДокумента.Ссылка
	|ГДЕ
	|	ШапкаДокумента.Ссылка В (&ДокументыДоставкиЗаказКлиента)
	|	И ШапкаДокумента.СпособУказанияДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыУказанияДоставки.НаВесьДокумент)";
	
	Если ЗначениеЗаполнено(ОтборПараметров) Тогда
		
		ТекстЗапросаСтрокиЗаказаКлиента =
		"ВЫБРАТЬ
		|	ШапкаЗаказа.Ссылка КАК ДокументДоставки,
		|	ТоварыКДоставкеЗаказа.КодСтроки КАК КодСтроки,
		|	ТоварыКДоставкеЗаказа.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
		|	ТоварыКДоставкеЗаказа.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
		|	ТоварыКДоставкеЗаказа.ВремяДоставкиС КАК ВремяДоставкиС,
		|	ТоварыКДоставкеЗаказа.ВремяДоставкиПо КАК ВремяДоставкиПо,
		|	ТоварыКДоставкеЗаказа.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке
		|ИЗ
		|	Документ.ЗаказКлиента КАК ШапкаЗаказа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ТоварыКДоставке КАК ТоварыКДоставкеЗаказа
		|		ПО ШапкаЗаказа.Ссылка = ТоварыКДоставкеЗаказа.Ссылка
		|			И ТоварыКДоставкеЗаказа.СпособДоставки = &СпособДоставки
		|			И ТоварыКДоставкеЗаказа.ТочкаДоставки = &ТочкаПолучателя
		|			И ТоварыКДоставкеЗаказа.ЗонаДоставки = &ЗонаПолучателя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ТоварыЗаказа
		|		ПО ТоварыКДоставкеЗаказа.Ссылка = ТоварыЗаказа.Ссылка
		|			И ТоварыКДоставкеЗаказа.КодСтроки = ТоварыЗаказа.КодСтроки
		|			И ТоварыКДоставкеЗаказа.ДоставкаДоПеревозчика = ЛОЖЬ
		|			И ТоварыЗаказа.ДатаОтгрузки = &ДатаОтгрузки
		|			И &ОтборПоОтправителю
		|			И &ОтборПоТоварам
		|ГДЕ
		|	ШапкаЗаказа.Ссылка В (&ДокументыДоставкиЗаказКлиента)
		|	И ШапкаЗаказа.СпособУказанияДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыУказанияДоставки.ПоСтрокам)
		|	И ШапкаЗаказа.Партнер = &Получатель
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШапкаЗаказа.Ссылка КАК ДокументДоставки,
		|	ТоварыКДоставкеЗаказа.КодСтроки КАК КодСтроки,
		|	ТоварыКДоставкеЗаказа.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
		|	ТоварыКДоставкеЗаказа.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
		|	ТоварыКДоставкеЗаказа.ВремяДоставкиС КАК ВремяДоставкиС,
		|	ТоварыКДоставкеЗаказа.ВремяДоставкиПо КАК ВремяДоставкиПо,
		|	ТоварыКДоставкеЗаказа.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке
		|ИЗ
		|	Документ.ЗаказКлиента КАК ШапкаЗаказа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ТоварыКДоставке КАК ТоварыКДоставкеЗаказа
		|		ПО ШапкаЗаказа.Ссылка = ТоварыКДоставкеЗаказа.Ссылка
		|			И ТоварыКДоставкеЗаказа.СпособДоставки = &СпособДоставки
		|			И ТоварыКДоставкеЗаказа.ТочкаДоставкиПеревозчика = &ТочкаПолучателя
		|			И ТоварыКДоставкеЗаказа.ЗонаДоставкиПеревозчика = &ЗонаПолучателя
		|			И ТоварыКДоставкеЗаказа.Перевозчик = &Получатель
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ТоварыЗаказа
		|		ПО ТоварыКДоставкеЗаказа.Ссылка = ТоварыЗаказа.Ссылка
		|			И ТоварыКДоставкеЗаказа.КодСтроки = ТоварыЗаказа.КодСтроки
		|			И ТоварыКДоставкеЗаказа.ДоставкаДоПеревозчика = ИСТИНА
		|			И ТоварыЗаказа.ДатаОтгрузки = &ДатаОтгрузки
		|			И &ОтборПоОтправителю
		|			И &ОтборПоТоварам
		|ГДЕ
		|	ШапкаЗаказа.Ссылка В (&ДокументыДоставкиЗаказКлиента)
		|	И ШапкаЗаказа.СпособУказанияДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыУказанияДоставки.ПоСтрокам)";
		
		Если ОтборПараметров.Свойство("Отправитель") Тогда
			ОтборПоОтправителю = "ТоварыЗаказа.Склад = &Отправитель";
		Иначе
			ОтборПоОтправителю = "ИСТИНА";
		КонецЕсли;
		
		ТекстЗапросаСтрокиЗаказаКлиента = СтрЗаменить(
			ТекстЗапросаСтрокиЗаказаКлиента, "&ОтборПоОтправителю", ОтборПоОтправителю);
		
	Иначе
		
		ТекстЗапросаСтрокиЗаказаКлиента =
		"ВЫБРАТЬ
		|	ШапкаЗаказа.Ссылка КАК ДокументДоставки,
		|	ТоварыКДоставкеЗаказа.КодСтроки КАК КодСтроки,
		|	ТоварыКДоставкеЗаказа.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
		|	ТоварыКДоставкеЗаказа.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
		|	ТоварыКДоставкеЗаказа.ВремяДоставкиС КАК ВремяДоставкиС,
		|	ТоварыКДоставкеЗаказа.ВремяДоставкиПо КАК ВремяДоставкиПо,
		|	ТоварыКДоставкеЗаказа.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке
		|ИЗ
		|	Документ.ЗаказКлиента КАК ШапкаЗаказа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ТоварыКДоставке КАК ТоварыКДоставкеЗаказа
		|		ПО ШапкаЗаказа.Ссылка = ТоварыКДоставкеЗаказа.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ТоварыЗаказа
		|		ПО ТоварыКДоставкеЗаказа.Ссылка = ТоварыЗаказа.Ссылка
		|			И ТоварыКДоставкеЗаказа.КодСтроки = ТоварыЗаказа.КодСтроки
		|			И &ОтборПоТоварам
		|ГДЕ
		|	ШапкаЗаказа.Ссылка В (&ДокументыДоставкиЗаказКлиента)
		|	И ШапкаЗаказа.СпособУказанияДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыУказанияДоставки.ПоСтрокам)";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.ТекстОбъединитьВсе() + ТекстЗапросаСтрокиЗаказаКлиента;
	
	Если ИспользоватьОтборПоТоварам Тогда
		
		ОтборПоТоварам = "ТоварыЗаказа.Номенклатура = &Номенклатура
		|И ТоварыЗаказа.Характеристика = &Характеристика
		|И ТоварыЗаказа.Серия = &Серия";
		
	Иначе
		ОтборПоТоварам = "ИСТИНА";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоТоварам", ОтборПоТоварам);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	ТипыДокументов = Метаданные.ОпределяемыеТипы.РаспоряжениеНаДоставку25.Тип.Типы();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ТипыДокументов, Метаданные.ОпределяемыеТипы.ДокументПланированияДоставки.Тип.Типы(), Истина);
	
	ДокументыДоставкиПоТипам = ОбъектыПоТипам(ДокументыДоставки);
	
	Для Каждого ТипДокумента Из ТипыДокументов Цикл
		
		ДокументыПоТипу = ДокументыДоставкиПоТипам[ТипДокумента];
		Если ДокументыПоТипу = Неопределено Тогда
			ДокументыПоТипу = Новый Массив; // Массив Из ДокументСсылка
		КонецЕсли;
		
		МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипДокумента);
		ИмяПараметра = "ДокументыДоставки" + МетаданныеДокумента.Имя;
		
		Запрос.УстановитьПараметр(ИмяПараметра, ДокументыПоТипу);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ОтборПараметров) Тогда
		
		Если ОтборПараметров.Свойство("Отправитель") Тогда
			Запрос.УстановитьПараметр("Отправитель", ОтборПараметров.Отправитель);
		КонецЕсли;
		Запрос.УстановитьПараметр("СпособДоставки", ОтборПараметров.СпособДоставки);
		Запрос.УстановитьПараметр("Получатель", ОтборПараметров.Получатель);
		Запрос.УстановитьПараметр("ТочкаПолучателя", ОтборПараметров.ТочкаПолучателя);
		Запрос.УстановитьПараметр("ЗонаПолучателя", ОтборПараметров.ЗонаПолучателя);
		Запрос.УстановитьПараметр("ДатаОтгрузки", ОтборПараметров.ДатаОтгрузки);
		
	КонецЕсли;
	
	Если ИспользоватьОтборПоТоварам Тогда
		
		Запрос.УстановитьПараметр("Номенклатура", ОтборПараметров.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", ОтборПараметров.Характеристика);
		Запрос.УстановитьПараметр("Серия", ОтборПараметров.Серия);
		Запрос.УстановитьПараметр("Упаковка", ОтборПараметров.Упаковка);
		
	КонецЕсли;
	
	ВариантыДопПараметров = Запрос.Выполнить().Выгрузить();
	
	ТипСтрока32 = ОбщегоНазначения.ОписаниеТипаСтрока(32);
	ВариантыДопПараметров.Колонки.Добавить("ОсобыеУсловияПеревозкиОписаниеХеш", ТипСтрока32);
	ВариантыДопПараметров.Колонки.Добавить("ДополнительнаяИнформацияПоДоставкеХеш", ТипСтрока32);
	
	Для Каждого СтрокаВарианта Из ВариантыДопПараметров Цикл
		
		СтрокаВарианта.ОсобыеУсловияПеревозкиОписаниеХеш = ХешЗначимыхСимволовСтроки(
			СтрокаВарианта.ОсобыеУсловияПеревозкиОписание);
		СтрокаВарианта.ДополнительнаяИнформацияПоДоставкеХеш = ХешЗначимыхСимволовСтроки(
			СтрокаВарианта.ДополнительнаяИнформацияПоДоставке);
		
	КонецЦикла;
	
	Возврат ВариантыДопПараметров;
	
КонецФункции

// Параметры:
//  Строка - Строка
// 
// Возвращаемое значение:
//  Строка - Контрольная сумма значимых символов строки, без учета пробелов и переносов строк
//
Функция ХешЗначимыхСимволовСтроки(Строка) Экспорт
	
	УдаляемыеСимволы = " " + Символы.НПП + Символы.Таб + Символы.ВК + Символы.ПС;
	ЗначимыеСимволы = СтрСоединить(СтрРазделить(Строка, УдаляемыеСимволы, Ложь), "");
	ЗначимыеСимволы = НРег(ЗначимыеСимволы);
	Хеш = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ЗначимыеСимволы);
	Возврат Хеш;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//  Структура:
// * ПереходЗапущен - Булево - 
// * СозданоЗадание - Булево - 
// * ДанныеОбработаны - Булево - 
// * ПереходЗавершен - Булево - 
// * КоличествоПартнеров - Число - 
// * КоличествоПартнеровОбработано - Число - 
// * КоличествоСкладов - Число - 
// * КоличествоСкладовОбработано - Число - 
//
Функция НовыеДанныеПереходаНаДоставку25()
	
	ДанныеПерехода = Новый Структура;
	ДанныеПерехода.Вставить("ПереходЗапущен", Ложь);
	ДанныеПерехода.Вставить("СозданоЗадание", Ложь);
	ДанныеПерехода.Вставить("ДанныеОбработаны", Ложь);
	ДанныеПерехода.Вставить("ПереходЗавершен", Ложь);
	ДанныеПерехода.Вставить("КоличествоПартнеров", 0);
	ДанныеПерехода.Вставить("КоличествоПартнеровОбработано", 0);
	ДанныеПерехода.Вставить("КоличествоСкладов", 0);
	ДанныеПерехода.Вставить("КоличествоСкладовОбработано", 0);
	
	Возврат ДанныеПерехода;
	
КонецФункции

Функция ТекстЗапросаПрогрессаПереходаНаДоставку25()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеКИ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СкладыСАдресами
	|ИЗ
	|	Справочник.Склады.КонтактнаяИнформация КАК ДанныеКИ
	|ГДЕ
	|	НЕ ДанныеКИ.Ссылка.ЭтоГруппа
	|	И ДанныеКИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И СОКРЛП(ДанныеКИ.Представление) <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеКИ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПартнерыСАдресами
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ДанныеКИ
	|ГДЕ
	|	ДанныеКИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И СОКРЛП(ДанныеКИ.Представление) <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СкладыКОбработке
	|ИЗ
	|	ВТ_СкладыСАдресами КАК Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТочкиДоставки КАК ТочкиДоставки
	|		ПО Склады.Ссылка = ТочкиДоставки.Владелец
	|ГДЕ
	|	ТочкиДоставки.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПартнерыКОбработке
	|ИЗ
	|	ВТ_ПартнерыСАдресами КАК Партнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТочкиДоставки КАК ТочкиДоставки
	|		ПО Партнеры.Ссылка = ТочкиДоставки.Владелец
	|ГДЕ
	|	ТочкиДоставки.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Склады.Ссылка) КАК КоличествоСкладов,
	|	0 КАК КоличествоПартнеров,
	|	0 КАК СкладовНеОбработано,
	|	0 КАК ПартнеровНеОбработано
	|ПОМЕСТИТЬ ВТ_ПрогрессОбработки
	|ИЗ
	|	ВТ_СкладыСАдресами КАК Склады
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0 КАК КоличествоСкладов,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Партнеры.Ссылка) КАК КоличествоПартнеров,
	|	0 КАК СкладовНеОбработано,
	|	0 КАК ПартнеровНеОбработано
	|ИЗ
	|	ВТ_ПартнерыСАдресами КАК Партнеры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0 КАК КоличествоСкладов,
	|	0 КАК КоличествоПартнеров,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Склады.Ссылка) КАК СкладовНеОбработано,
	|	0 КАК ПартнеровНеОбработано
	|ИЗ
	|	ВТ_СкладыКОбработке КАК Склады
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0 КАК КоличествоСкладов,
	|	0 КАК КоличествоПартнеров,
	|	0 КАК СкладовНеОбработано,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Партнеры.Ссылка) КАК ПартнеровНеОбработано
	|ИЗ
	|	ВТ_ПартнерыКОбработке КАК Партнеры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Прогресс.КоличествоСкладов) КАК КоличествоСкладов,
	|	СУММА(Прогресс.КоличествоПартнеров) КАК КоличествоПартнеров,
	|	СУММА(Прогресс.КоличествоСкладов) - СУММА(Прогресс.СкладовНеОбработано) КАК КоличествоСкладовОбработано,
	|	СУММА(Прогресс.КоличествоПартнеров) -СУММА(Прогресс.ПартнеровНеОбработано) КАК КоличествоПартнеровОбработано
	|ИЗ
	|	ВТ_ПрогрессОбработки КАК Прогресс";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДополнитьТекстЗапросаУправленияОтгрузкойДаннымиДоставки25(ТекстЗапроса)
	
	ТекстыЗапроса = Новый Массив; // Массив Из Строка
	
	ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
		Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
	#Область ТекстЗапросаВтДанныеПоРейсам_ДопустимоеОтклонение_0
	Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 0 Тогда
		
		ТекстЗапросаВтДанныеПоРейсам =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТИПЗНАЧЕНИЯ(ДанныеДоставки.Рейс) КАК ТипДокумента,
		|	ДанныеДоставки.Рейс КАК Распоряжение,
		|	ДанныеДоставки.Рейс КАК ЗаданиеНаПеревозку,
		|	ДанныеДоставки.Рейс.Номер КАК Номер,
		|	ДанныеДоставки.Рейс.ДатаВыезда КАК Дата,
		|	НЕОПРЕДЕЛЕНО КАК Получатель,
		|	ВЫБОР МИНИМУМ(ДанныеДоставки.КодСостояния)
		|		КОГДА 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
		|		КОГДА 1
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
		|		КОГДА 2
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
		|	КОНЕЦ КАК Состояние,
		|	1 КАК ИндексКартинки
		|ПОМЕСТИТЬ ВтДанныеПоРейсам
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДоставкаОбороты.Рейс КАК Рейс,
		|		ВЫБОР
		|			КОГДА ДоставкаОбороты.КСборкеОборот - ДоставкаОбороты.СобираетсяОборот - ДоставкаОбороты.СобраноОборот > 0
		|				ТОГДА 0
		|			КОГДА ДоставкаОбороты.ВПутиОборот <> 0
		|				ТОГДА 200
		|			КОГДА ДоставкаОбороты.ДоставленоОборот <> 0
		|				ТОГДА 200
		|			КОГДА ДоставкаОбороты.СобираетсяОборот <> 0
		|				ТОГДА 1
		|			КОГДА ДоставкаОбороты.СобраноОборот <> 0
		|				ТОГДА 2
		|			ИНАЧЕ 404
		|		КОНЕЦ КАК КодСостояния,
		|		ДоставкаОбороты.Номенклатура КАК Номенклатура,
		|		ДоставкаОбороты.Характеристика КАК Характеристика,
		|		ДоставкаОбороты.Серия КАК Серия
		|	ИЗ
		|		РегистрНакопления.Доставка.Обороты(
		|				,
		|				,
		|				,
		|				(ДатаОтгрузки <= &ДатаОтгрузкиДоставки
		|					ИЛИ НЕ &ДатаОтгрузкиЗаполнена)
		|					И Рейс <> ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
		|					И Отправитель = &Склад
		|					И Плечо = 1) КАК ДоставкаОбороты
		|	ГДЕ
		|		(ДоставкаОбороты.КСборкеОборот - ДоставкаОбороты.СобираетсяОборот - ДоставкаОбороты.СобраноОборот > 0
		|				ИЛИ ДоставкаОбороты.СобираетсяОборот <> 0
		|				ИЛИ ДоставкаОбороты.СобраноОборот <> 0)) КАК ДанныеДоставки
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДоставки.Рейс,
		|	ДанныеДоставки.Рейс.Номер,
		|	ДанныеДоставки.Рейс.ДатаВыезда
		|
		|ИМЕЮЩИЕ
		|	ВЫБОР МИНИМУМ(ДанныеДоставки.КодСостояния)
		|		КОГДА 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
		|		КОГДА 1
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
		|		КОГДА 2
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
		|	КОНЕЦ В (&Состояния)";
		ТекстыЗапроса.Добавить(ТекстЗапросаВтДанныеПоРейсам);
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ТекстЗапросаВтДанныеПоРейсам_ДопустимоеОтклонение_не_0
	Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров <> 0 Тогда
		
		ТекстЗапросаВтДанныеПоРейсам =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТИПЗНАЧЕНИЯ(ДанныеДоставки.Рейс) КАК ТипДокумента,
		|	ДанныеДоставки.Рейс КАК Распоряжение,
		|	ДанныеДоставки.Рейс КАК ЗаданиеНаПеревозку,
		|	ДанныеДоставки.Рейс.Номер КАК Номер,
		|	ДанныеДоставки.Рейс.ДатаВыезда КАК Дата,
		|	НЕОПРЕДЕЛЕНО КАК Получатель,
		|	ВЫБОР МИНИМУМ(ДанныеДоставки.КодСостояния)
		|		КОГДА 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
		|		КОГДА 1
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
		|		КОГДА 2
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
		|	КОНЕЦ КАК Состояние,
		|	1 КАК ИндексКартинки
		|ПОМЕСТИТЬ ВтДанныеПоРейсам
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДоставкаОбороты.Рейс КАК Рейс,
		|		ВЫБОР
		|			КОГДА ВЫБОР
		|					КОГДА ДоставкаОбороты.КСборкеОборот - ДоставкаОбороты.СобираетсяОборот - ДоставкаОбороты.СобраноОборот >= 0
		|						ТОГДА ДоставкаОбороты.КСборкеОборот - ДоставкаОбороты.СобираетсяОборот - ДоставкаОбороты.СобраноОборот
		|					ИНАЧЕ -(ДоставкаОбороты.КСборкеОборот - ДоставкаОбороты.СобираетсяОборот - ДоставкаОбороты.СобраноОборот)
		|				КОНЕЦ > ВЫБОР
		|					КОГДА ДоставкаОбороты.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
		|						ТОГДА &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ДоставкаОбороты.КСборкеОборот
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|				ТОГДА 0
		|			КОГДА ДоставкаОбороты.ВПутиОборот <> 0
		|				ТОГДА 200
		|			КОГДА ДоставкаОбороты.ДоставленоОборот <> 0
		|				ТОГДА 200
		|			КОГДА ДоставкаОбороты.СобираетсяОборот <> 0
		|				ТОГДА 1
		|			КОГДА ДоставкаОбороты.СобраноОборот <> 0
		|				ТОГДА 2
		|			ИНАЧЕ 404
		|		КОНЕЦ КАК КодСостояния,
		|		ДоставкаОбороты.Номенклатура КАК Номенклатура,
		|		ДоставкаОбороты.Характеристика КАК Характеристика,
		|		ДоставкаОбороты.Серия КАК Серия
		|	ИЗ
		|		РегистрНакопления.Доставка.Обороты(
		|				,
		|				,
		|				,
		|				(ДатаОтгрузки <= &ДатаОтгрузкиДоставки
		|					ИЛИ НЕ &ДатаОтгрузкиЗаполнена)
		|					И Рейс <> ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
		|					И Отправитель = &Склад
		|					И Плечо = 1) КАК ДоставкаОбороты
		|	ГДЕ
		|		(ДоставкаОбороты.КСборкеОборот - ДоставкаОбороты.СобираетсяОборот - ДоставкаОбороты.СобраноОборот > 0
		|				ИЛИ ДоставкаОбороты.СобираетсяОборот <> 0
		|				ИЛИ ДоставкаОбороты.СобраноОборот <> 0)) КАК ДанныеДоставки
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДоставки.Рейс,
		|	ДанныеДоставки.Рейс.Номер,
		|	ДанныеДоставки.Рейс.ДатаВыезда,
		|	ДанныеДоставки.Рейс
		|
		|ИМЕЮЩИЕ
		|	ВЫБОР МИНИМУМ(ДанныеДоставки.КодСостояния)
		|		КОГДА 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
		|		КОГДА 1
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
		|		КОГДА 2
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
		|	КОНЕЦ В (&Состояния)";
		ТекстыЗапроса.Добавить(ТекстЗапросаВтДанныеПоРейсам);
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ВтДанныеБезДоставки
	ВтДанныеБезДоставки =
	"ВЫБРАТЬ
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Распоряжение,
	|	ТоварыКОтгрузкеОстатки.Получатель КАК Получатель,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КОтгрузкеОстаток,
	|	ТоварыКОтгрузкеОстатки.СобираетсяОстаток КАК СобираетсяОстаток,
	|	ТоварыКОтгрузкеОстатки.СобраноОстаток КАК СобраноОстаток,
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.Серия КАК Серия,
	|	ТоварыКОтгрузкеОстатки.Назначение КАК Назначение
	|ПОМЕСТИТЬ ВтДанныеОтгрузкиТоваров
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(&ДатаОтгрузки, Склад = &Склад) КАК ТоварыКОтгрузкеОстатки
	|ГДЕ
	|	(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток - ТоварыКОтгрузкеОстатки.СобираетсяОстаток - ТоварыКОтгрузкеОстатки.СобраноОстаток > 0
	|			ИЛИ ТоварыКОтгрузкеОстатки.СобираетсяОстаток > 0
	|			ИЛИ ТоварыКОтгрузкеОстатки.СобраноОстаток > 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Распоряжение,
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Доставка.Распоряжение КАК Распоряжение,
	|	Доставка.Номенклатура КАК Номенклатура,
	|	Доставка.Характеристика КАК Характеристика,
	|	Доставка.Серия КАК Серия,
	|	Доставка.Назначение КАК Назначение,
	|	Доставка.КодСтроки КАК КодСтроки,
	|	Доставка.ДокументПланирования КАК ДокументПланирования
	|ПОМЕСТИТЬ ВтПервичныеЗаписиДоставки
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВтДанныеОтгрузкиТоваров.Распоряжение КАК Распоряжение
	|	ИЗ
	|		ВтДанныеОтгрузкиТоваров КАК ВтДанныеОтгрузкиТоваров) КАК РаспоряженияОтгрузки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК Доставка
	|		ПО РаспоряженияОтгрузки.Распоряжение = Доставка.Распоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДанныеОтгрузкиТоваров КАК ВтДанныеОтгрузкиТоваров
	|		ПО (ВтДанныеОтгрузкиТоваров.Распоряжение = Доставка.Распоряжение)
	|			И (ВтДанныеОтгрузкиТоваров.Номенклатура = Доставка.Номенклатура)
	|			И (ВтДанныеОтгрузкиТоваров.Характеристика = Доставка.Характеристика)
	|			И (ВтДанныеОтгрузкиТоваров.Серия = Доставка.Серия)
	|			И (ВтДанныеОтгрузкиТоваров.Назначение = Доставка.Назначение)
	|			И (Доставка.ПервичнаяЗапись)
	|ГДЕ
	|	(НЕ &ДатаОтгрузкиЗаполнена
	|			ИЛИ ЕСТЬNULL(Доставка.ПервичнаяДатаОтгрузки, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтгрузкиДоставки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Распоряжение,
	|	ДокументПланирования,
	|	КодСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоставкаОбороты.Распоряжение КАК Распоряжение,
	|	ДоставкаОбороты.Номенклатура КАК Номенклатура,
	|	ДоставкаОбороты.Характеристика КАК Характеристика,
	|	ДоставкаОбороты.Серия КАК Серия,
	|	ЕСТЬNULL(ВтПервичныеЗаписиДоставки.Назначение, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение,
	|	СУММА(0) КАК КОтгрузке,
	|	СУММА(ДоставкаОбороты.СобираетсяОборот) КАК Собирается,
	|	СУММА(ДоставкаОбороты.СобраноОборот) КАК Собрано,
	|	СУММА(ДоставкаОбороты.КДоставкеОборот) КАК КДоставке
	|ПОМЕСТИТЬ ВтДанныеКДоставке
	|ИЗ
	|	РегистрНакопления.Доставка.Обороты(
	|			,
	|			,
	|			День,
	|			Отправитель = &Склад
	|				И Плечо = 1
	|				И СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки25.Самовывоз)
	|				И Распоряжение В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВтДанныеОтгрузкиТоваров.Распоряжение КАК ДокументОтгрузки
	|					ИЗ
	|						ВтДанныеОтгрузкиТоваров КАК ВтДанныеОтгрузкиТоваров)
	|				И (Распоряжение, Номенклатура, Характеристика, Серия) В
	|					(ВЫБРАТЬ
	|						ВтДанныеОтгрузкиТоваров.Распоряжение КАК Распоряжение,
	|						ВтДанныеОтгрузкиТоваров.Номенклатура КАК Номенклатура,
	|						ВтДанныеОтгрузкиТоваров.Характеристика КАК Характеристика,
	|						ВтДанныеОтгрузкиТоваров.Серия КАК Серия
	|					ИЗ
	|						ВтДанныеОтгрузкиТоваров КАК ВтДанныеОтгрузкиТоваров)) КАК ДоставкаОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПервичныеЗаписиДоставки КАК ВтПервичныеЗаписиДоставки
	|		ПО ДоставкаОбороты.Распоряжение = ВтПервичныеЗаписиДоставки.Распоряжение
	|			И ДоставкаОбороты.ДокументПланирования = ВтПервичныеЗаписиДоставки.ДокументПланирования
	|			И ДоставкаОбороты.КодСтроки = ВтПервичныеЗаписиДоставки.КодСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоставкаОбороты.Номенклатура,
	|	ЕСТЬNULL(ВтПервичныеЗаписиДоставки.Назначение, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)),
	|	ДоставкаОбороты.Характеристика,
	|	ДоставкаОбороты.Серия,
	|	ДоставкаОбороты.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТИПЗНАЧЕНИЯ(ДанныеОтгрузки.Распоряжение) КАК ТипДокумента,
	|	ДанныеОтгрузки.Распоряжение КАК Распоряжение,
	|	НЕОПРЕДЕЛЕНО КАК ЗаданиеНаПеревозку,
	|	ДанныеОтгрузки.Получатель КАК Получатель,
	|	ВЫБОР МИНИМУМ(ДанныеОтгрузки.КодСостояния)
	|		КОГДА 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ КАК Состояние,
	|	0 КАК ИндексКартинки
	|ПОМЕСТИТЬ ВтДанныеБезДоставки
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспоряженияКОтгрузке.Распоряжение КАК Распоряжение,
	|		РаспоряженияКОтгрузке.Получатель КАК Получатель,
	|		ВЫБОР
	|			КОГДА РаспоряженияКОтгрузке.КОтгрузкеОстаток - ЕСТЬNULL(ТоварыКДоставке.КДоставке, 0) - (РаспоряженияКОтгрузке.СобираетсяОстаток - ЕСТЬNULL(ТоварыКДоставке.Собирается, 0)) - (РаспоряженияКОтгрузке.СобраноОстаток - ЕСТЬNULL(ТоварыКДоставке.Собрано, 0)) > 0
	|				ТОГДА 0
	|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток - ЕСТЬNULL(ТоварыКДоставке.Собирается, 0) <> 0
	|				ТОГДА 1
	|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток - ЕСТЬNULL(ТоварыКДоставке.Собрано, 0) <> 0
	|				ТОГДА 2
	|			ИНАЧЕ 404
	|		КОНЕЦ КАК КодСостояния,
	|		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
	|		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
	|		РаспоряженияКОтгрузке.Серия КАК Серия
	|	ИЗ
	|		ВтДанныеОтгрузкиТоваров КАК РаспоряженияКОтгрузке
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтДанныеКДоставке КАК ТоварыКДоставке
	|			ПО РаспоряженияКОтгрузке.Распоряжение = ТоварыКДоставке.Распоряжение
	|				И РаспоряженияКОтгрузке.Номенклатура = ТоварыКДоставке.Номенклатура
	|				И РаспоряженияКОтгрузке.Характеристика = ТоварыКДоставке.Характеристика
	|				И РаспоряженияКОтгрузке.Серия = ТоварыКДоставке.Серия
	|				И РаспоряженияКОтгрузке.Назначение = ТоварыКДоставке.Назначение
	|	ГДЕ
	|		РаспоряженияКОтгрузке.КОтгрузкеОстаток - (ЕСТЬNULL(ТоварыКДоставке.КДоставке, 0) - ЕСТЬNULL(ТоварыКДоставке.Собрано, 0)) > 0) КАК ДанныеОтгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОтгрузки.Получатель,
	|	ТИПЗНАЧЕНИЯ(ДанныеОтгрузки.Распоряжение),
	|	ДанныеОтгрузки.Распоряжение
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР МИНИМУМ(ДанныеОтгрузки.КодСостояния)
	|		КОГДА 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ В (&Состояния)";
	ТекстыЗапроса.Добавить(ВтДанныеБезДоставки);
	#КонецОбласти
	
	#Область ТекстЗапросаОбъединение
	ТекстЗапросаОбъединение =
	"ВЫБРАТЬ
	|	ВтДанныеПоРейсам.ТипДокумента КАК ТипДокумента,
	|	ВтДанныеПоРейсам.Распоряжение КАК Распоряжение,
	|	ВтДанныеПоРейсам.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ВтДанныеПоРейсам.Номер КАК Номер,
	|	ВтДанныеПоРейсам.Дата КАК Дата,
	|	ВтДанныеПоРейсам.Получатель КАК Получатель,
	|	ВтДанныеПоРейсам.Состояние КАК Состояние,
	|	ВтДанныеПоРейсам.ИндексКартинки КАК ИндексКартинки
	|ИЗ
	|	ВтДанныеПоРейсам КАК ВтДанныеПоРейсам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВтДанныеБезДоставки.ТипДокумента
	|	КОНЕЦ,
	|	ВтДанныеБезДоставки.Распоряжение,
	|	ВтДанныеБезДоставки.ЗаданиеНаПеревозку,
	|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """"),
	|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)),
	|	ВтДанныеБезДоставки.Получатель,
	|	ВтДанныеБезДоставки.Состояние,
	|	ВтДанныеБезДоставки.ИндексКартинки
	|ИЗ
	|	ВтДанныеБезДоставки КАК ВтДанныеБезДоставки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ВтДанныеБезДоставки.Распоряжение = РеестрДокументов.Ссылка
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	ТекстыЗапроса.Добавить(ТекстЗапросаОбъединение);
	#КонецОбласти
	
	ИтоговыйТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	ТекстЗапроса = ТекстЗапроса + ИтоговыйТекстЗапроса;
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаУправленияОтгрузкойДаннымиДоставки25ДеталиОтгрузки(ТекстЗапроса)
	
	ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
		Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
	
	Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 0 Тогда
		
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) КАК ТипДокумента,
		|	2 КАК ИндексКартинки,
		|	ДанныеДокумента.Ссылка КАК Распоряжение,
		|	ДанныеДокумента.Ссылка КАК ЗаданиеНаПеревозку,
		|	НЕОПРЕДЕЛЕНО КАК Получатель,
		|	"""" КАК Номер,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК Дата,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка) КАК Состояние,
		|	0 КАК Порядок
		|ИЗ
		|	Документ.Рейс КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка = &ЗаданиеНаПеревозку
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТИПЗНАЧЕНИЯ(ДанныеПоРейсу.Распоряжение),
		|	3,
		|	ДанныеПоРейсу.Распоряжение,
		|	&ЗаданиеНаПеревозку,
		|	ЕСТЬNULL(РеестрДокументов.Партнер, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """"),
		|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)),
		|	ВЫБОР
		|		КОГДА ДанныеПоРейсу.КСборкеОборот - ДанныеПоРейсу.СобираетсяОборот - ДанныеПоРейсу.СобраноОборот > 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
		|		КОГДА ДанныеПоРейсу.СобираетсяОборот <> 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
		|		КОГДА ДанныеПоРейсу.СобраноОборот <> 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
		|	КОНЕЦ,
		|	1
		|ИЗ
		|	РегистрНакопления.Доставка.Обороты(
		|			,
		|			,
		|			,
		|			Рейс = &ЗаданиеНаПеревозку
		|				И Плечо = 1) КАК ДанныеПоРейсу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|		ПО ДанныеПоРейсу.Распоряжение = РеестрДокументов.Ссылка
		|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ДанныеПоРейсу.КСборкеОборот - ДанныеПоРейсу.СобираетсяОборот - ДанныеПоРейсу.СобраноОборот > 0
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
		|			КОГДА ДанныеПоРейсу.СобираетсяОборот <> 0
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
		|			КОГДА ДанныеПоРейсу.СобраноОборот <> 0
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
		|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
		|		КОНЕЦ В (&Состояния)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	Дата";
		
	КонецЕсли;
	
	Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров <> 0 Тогда
		
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) КАК ТипДокумента,
		|	2 КАК ИндексКартинки,
		|	ДанныеДокумента.Ссылка КАК Распоряжение,
		|	ДанныеДокумента.Ссылка КАК ЗаданиеНаПеревозку,
		|	НЕОПРЕДЕЛЕНО КАК Получатель,
		|	"""" КАК Номер,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК Дата,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка) КАК Состояние,
		|	0 КАК Порядок
		|ИЗ
		|	Документ.Рейс КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка = &ЗаданиеНаПеревозку
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТИПЗНАЧЕНИЯ(ДанныеПоРейсу.Распоряжение),
		|	3,
		|	ДанныеПоРейсу.Распоряжение,
		|	&ЗаданиеНаПеревозку,
		|	ЕСТЬNULL(РеестрДокументов.Партнер, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """"),
		|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)),
		|	ВЫБОР
		|		КОГДА ВЫБОР
		|				КОГДА ДанныеПоРейсу.КСборкеОборот - ДанныеПоРейсу.СобираетсяОборот - ДанныеПоРейсу.СобраноОборот >= 0
		|					ТОГДА ДанныеПоРейсу.КСборкеОборот - ДанныеПоРейсу.СобираетсяОборот - ДанныеПоРейсу.СобраноОборот
		|				ИНАЧЕ -(ДанныеПоРейсу.КСборкеОборот - ДанныеПоРейсу.СобираетсяОборот - ДанныеПоРейсу.СобраноОборот)
		|			КОНЕЦ > ВЫБОР
		|				КОГДА ДанныеПоРейсу.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
		|					ТОГДА &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ДанныеПоРейсу.КСборкеОборот
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
		|		КОГДА ДанныеПоРейсу.СобираетсяОборот <> 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
		|		КОГДА ДанныеПоРейсу.СобраноОборот <> 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
		|	КОНЕЦ,
		|	1
		|ИЗ
		|	РегистрНакопления.Доставка.Обороты(
		|			,
		|			,
		|			,
		|			Рейс = &ЗаданиеНаПеревозку
		|				И Плечо = 1) КАК ДанныеПоРейсу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|		ПО ДанныеПоРейсу.Распоряжение = РеестрДокументов.Ссылка
		|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВЫБОР
		|					КОГДА ДанныеПоРейсу.КСборкеОборот - ДанныеПоРейсу.СобираетсяОборот - ДанныеПоРейсу.СобраноОборот >= 0
		|						ТОГДА ДанныеПоРейсу.КСборкеОборот - ДанныеПоРейсу.СобираетсяОборот - ДанныеПоРейсу.СобраноОборот
		|					ИНАЧЕ -(ДанныеПоРейсу.КСборкеОборот - ДанныеПоРейсу.СобираетсяОборот - ДанныеПоРейсу.СобраноОборот)
		|				КОНЕЦ > ВЫБОР
		|					КОГДА ДанныеПоРейсу.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
		|						ТОГДА &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ДанныеПоРейсу.КСборкеОборот
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
		|			КОГДА ДанныеПоРейсу.СобираетсяОборот <> 0
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
		|			КОГДА ДанныеПоРейсу.СобраноОборот <> 0
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
		|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
		|		КОНЕЦ В (&Состояния)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	Дата";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтключитьРегламентноеЗаданиеПереходаНаДоставку25()
	
	Параметры = Новый Структура;
	Параметры.Вставить("Использование", Ложь);
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Использование", Ложь);
	ПараметрыЗадания.Вставить("Параметры", Параметры);
	
	РегламентныеЗаданияСервер.ИзменитьЗадание(
		Метаданные.РегламентныеЗадания.ПереходНаУправлениеДоставкой25,
		ПараметрыЗадания);
	
КонецПроцедуры

Процедура СоздатьРегламентноеЗаданиеПереходаНаДоставку25()
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ПереходНаУправлениеДоставкой25);
	ПараметрыЗадания.Вставить("Использование", Истина);
	
	Расписание = Новый РасписаниеРегламентногоЗадания();
	Расписание.ПериодПовтораДней = 1;
	Расписание.ПериодПовтораВТечениеДня = 10;
	
	ПараметрыЗадания.Вставить("Расписание", Расписание);
	
	РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	
КонецПроцедуры

Процедура ОтключитьПроверкуЗаполненияОбязательныхПолейДанныхДоставки(МассивНепроверяемыхРеквизитов, Знач Настройки)
	
	// Сведения о складах проверяются всегда, если требуется доставка
	
	МассивНепроверяемыхРеквизитов.Добавить(Настройки.АдресДоставкиИмяПоля);
	МассивНепроверяемыхРеквизитов.Добавить(Настройки.ПеревозчикИмяПоля);
	МассивНепроверяемыхРеквизитов.Добавить(Настройки.ОсобыеУсловияПеревозкиОписаниеИмяПоля);
	
КонецПроцедуры

// Параметры:
//  Настройки - см. НовыеНастройкиПроверкиИспользованияРеквизитовДоставки
//  Отказ  - Булево
//  ВыводитьОшибкиЗаполнения - Булево - признак необходимости выводить ошибки заполнения
//  ОбновитьДанные - Булево - указывает на необходимость записи обновленных данных в таблицу
//
Процедура ПроверитьОбновитьДанныеПолейДоставки(Настройки, Отказ, ВыводитьОшибкиЗаполнения, ОбновитьДанные = Ложь)
	
	Если ОбновитьДанные Тогда
		ОчиститьНеиспользуемыеПоляДоставки(Настройки, Отказ);
	КонецЕсли;
	
	Объект = Настройки.ДокументОбъект; // ДокументОбъект
	
	Если ПустаяСтрока(Настройки.СпособУказанияДоставкиИмяПоля) Тогда
		СпособУказанияДоставки = Настройки.СпособУказанияДоставкиБезусловный;
	Иначе
		СпособУказанияДоставки = Объект[Настройки.СпособУказанияДоставкиИмяПоля]; // ПеречислениеСсылка.СпособыУказанияДоставки
	КонецЕсли;
	
	Если ПустаяСтрока(Настройки.ВидПланированияДоставкиИмяПоля) Тогда
		ВидПланированияДоставки = Настройки.ВидПланированияДоставкиБезусловный;
	Иначе
		ВидПланированияДоставки = Объект[Настройки.ВидПланированияДоставкиИмяПоля]; // ПеречислениеСсылка.ВидыПланированияДоставки
	КонецЕсли;
	
	ТолькоСброс = (ВидПланированияДоставки = Перечисления.ВидыПланированияДоставки.ОтдельнымДокументом);
	
	ПроверитьОбновитьДанныеПолейДоставкиШапка(СпособУказанияДоставки, Настройки, ОбновитьДанные, ТолькоСброс, ВыводитьОшибкиЗаполнения, Отказ);
	ПроверитьОбновитьДанныеПолейДоставкиТаблица(СпособУказанияДоставки, Настройки, ОбновитьДанные, ТолькоСброс, ВыводитьОшибкиЗаполнения, Отказ);
	
КонецПроцедуры

Процедура ПроверитьОбновитьДанныеПолейДоставкиШапка(Знач СпособУказанияДоставки, Знач Настройки, Знач ОбновитьДанные, Знач ТолькоСброс, Знач ВыводитьОшибкиЗаполнения, Отказ)
	
	Если СпособУказанияДоставки <> Перечисления.СпособыУказанияДоставки.НаВесьДокумент Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Настройки.ДокументОбъект; // ДокументОбъект
	
	ПроверитьОбновитьДанныеТочкиЗоныДоставки(СпособУказанияДоставки, Настройки, ОбновитьДанные, ТолькоСброс, ВыводитьОшибкиЗаполнения, Отказ);
	
	Если ПустаяСтрока(Настройки.СпособДоставкиИмяПоля) Тогда
		СпособДоставки = Настройки.СпособДоставкиБезусловный;
	Иначе
		СпособДоставки = Объект[Настройки.СпособДоставкиИмяПоля]; // ПеречислениеСсылка.СпособыДоставки25
	КонецЕсли;
		
	Если ВыводитьОшибкиЗаполнения Тогда
		
		ПроверитьДанныеПолейДоставкиШапкаСведенияПеревозчика(Настройки, СпособДоставки, Объект, Отказ);
		
		Если НЕ ПустаяСтрока(Настройки.ОсобыеУсловияПеревозкиИмяПоля)
			И Объект[Настройки.ОсобыеУсловияПеревозкиИмяПоля] Тогда
			
			Если НЕ ЗначениеЗаполнено(Объект[Настройки.ОсобыеУсловияПеревозкиОписаниеИмяПоля]) Тогда
				
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Описание особых условий перевозки'"));
				ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					Объект,
					"ТребуетсяДоставка",
					,
					Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьОбновитьДанныеТочкиЗоныДоставки(Знач СпособУказанияДоставки, Знач Настройки, Знач ОбновитьДанные, Знач ТолькоСброс, Знач ВыводитьОшибкиЗаполнения, Отказ)
	
	Если СпособУказанияДоставки <> Перечисления.СпособыУказанияДоставки.НаВесьДокумент Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Настройки.ДокументОбъект; // ДокументОбъект
	
	ТочкаДоставки = Объект[Настройки.ТочкаДоставкиИмяПоля]; // СправочникСсылка.ТочкиДоставки
	ЗонаДоставки = Объект[Настройки.ЗонаДоставкиИмяПоля]; // СправочникСсылка.ЗоныДоставки
	
	ДанныеТочкиДоставки = Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(Настройки.ВладелецТочекДоставки);
	ТочкаДоставкиЗадана = Истина;
	ЗонаДоставкиЗадана = Истина;
	
	ВладельцыТочекДоставки = Новый Соответствие;
	Если НЕ ДанныеТочкиДоставки.ТочкаДоставки.Пустая() Тогда
		ВладельцыТочекДоставки[ДанныеТочкиДоставки.ТочкаДоставки] = Настройки.ВладелецТочекДоставки;
	КонецЕсли;
	ВладельцыТочекДоставки[ТочкаДоставки] = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТочкаДоставки, "Владелец");
	
	ПроверитьОбновитьДанныеПоТочкеДоставки(
		ДанныеТочкиДоставки,
		ВладельцыТочекДоставки,
		ТочкаДоставки,
		ТочкаДоставкиЗадана,
		ЗонаДоставки,
		ЗонаДоставкиЗадана,
		ОбновитьДанные,
		ТолькоСброс);
	
	Если ОбновитьДанные Тогда
		
		Объект[Настройки.ТочкаДоставкиИмяПоля] = ТочкаДоставки;
		Объект[Настройки.ЗонаДоставкиИмяПоля] = ЗонаДоставки;
		
	КонецЕсли;
	
	Если НЕ ТочкаДоставкиЗадана
		И ВыводитьОшибкиЗаполнения Тогда
		
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Точка доставки'"));
		ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			Объект,
			"ТребуетсяДоставка",
			,
			Отказ);
		
	КонецЕсли;
	
	Если НЕ ЗонаДоставкиЗадана
		И ВыводитьОшибкиЗаполнения Тогда
		
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Зона доставки'"));
		ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			Объект,
			"ТребуетсяДоставка",
			,
			Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДанныеПолейДоставкиШапкаСведенияПеревозчика(Знач Настройки, Знач СпособДоставки, Знач Объект, Отказ)

	Если ПустаяСтрока(Настройки.ДоставкаДоПеревозчикаИмяПоля) Тогда
		ДоставкаДоПеревозчика = Настройки.ДоставкаДоПеревозчикаБезусловный;
	Иначе
		ДоставкаДоПеревозчика = Объект[Настройки.ДоставкаДоПеревозчикаИмяПоля]; // Булево
	КонецЕсли;
	
	Если (СпособДоставки = Перечисления.СпособыДоставки25.НашимиСилами
			И ДоставкаДоПеревозчика)
		ИЛИ СпособДоставки = Перечисления.СпособыДоставки25.СиламиПеревозчика Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект[Настройки.ПеревозчикИмяПоля]) Тогда
			
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Перевозчик'"));
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				Объект,
				"ТребуетсяДоставка",
				,
				Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если (СпособДоставки = Перечисления.СпособыДоставки25.НашимиСилами
		И ДоставкаДоПеревозчика) Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект[Настройки.ТочкаДоставкиПеревозчикаИмяПоля]) Тогда
			
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Точка доставки перевозчика'"));
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				Объект,
				"ТребуетсяДоставка",
				,
				Отказ);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[Настройки.ЗонаДоставкиПеревозчикаИмяПоля]) Тогда
			
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Зона доставки перевозчика'"));
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				Объект,
				"ТребуетсяДоставка",
				,
				Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьОбновитьДанныеПолейДоставкиТаблица(Знач СпособУказанияДоставки, Знач Настройки, Знач ОбновитьДанные, Знач ТолькоСброс, Знач ВыводитьОшибкиЗаполнения, Отказ)
	
	Если СпособУказанияДоставки <> Перечисления.СпособыУказанияДоставки.ПоСтрокам Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Настройки.ДокументОбъект; // ДокументОбъект
	
	ТаблицаТоваровДоставки = Настройки.ТаблицаТоваровДоставки;
	ТочкиДоставкиТаблицы = ТаблицаТоваровДоставки.ВыгрузитьКолонку("ТочкаДоставки"); // Массив из СправочникСсылка.ТочкиДоставки
	ДанныеТочекДоставкиТаблицы = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТочкиДоставкиТаблицы, "Владелец");
	ДанныеТочкиДоставкиВладельца = Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(Настройки.ВладелецТочекДоставки);
	
	КлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(Объект);
	ШаблонОшибкиПоле = НСтр("ru = 'Поле ""%1"" параметров доставки не заполнено для строки %2'");
	ШаблонОшибкиКолонка = НСтр("ru = 'Колонка ""%1"" параметров доставки не заполнена для строки %2'");
	
	Для каждого СтрокаДоставки Из ТаблицаТоваровДоставки Цикл
		
		Если СтрокаДоставки.СпособДоставки = Перечисления.СпособыДоставки25.Самовывоз Тогда
			
			Если ОбновитьДанные Тогда
				СброситьДанныеСтрокиПараметровДоставки(СтрокаДоставки);
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		НомерСтроки = Формат(СтрокаДоставки.НомерСтрокиДокумента, "ЧГ=");
		ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			"Товары", СтрокаДоставки.НомерСтрокиДокумента, "НомерСтроки");
			
		Если СтрокаДоставки.СпособДоставки.Пустая() Тогда
			
			Если ВыводитьОшибкиЗаполнения Тогда
				
				ИмяПоля = НСтр("ru = 'Способ доставки'");
				ПроверитьЗаполнениеПоляТаблицы(СтрокаДоставки.СпособДоставки, ШаблонОшибкиКолонка, ИмяПоля, НомерСтроки, КлючДанных, ПутьКПолю, Отказ);
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		#Область ТочкаЗонаДоставки
		ТочкаДоставкиЗадана = Истина;
		ЗонаДоставкиЗадана = Истина;
		
		ПроверитьОбновитьДанныеПоТочкеДоставки(
			ДанныеТочкиДоставкиВладельца,
			ДанныеТочекДоставкиТаблицы,
			СтрокаДоставки.ТочкаДоставки,
			ТочкаДоставкиЗадана,
			СтрокаДоставки.ЗонаДоставки,
			ЗонаДоставкиЗадана,
			ОбновитьДанные,
			ТолькоСброс);
			
		Если НЕ ТочкаДоставкиЗадана
			И ВыводитьОшибкиЗаполнения Тогда
			
			ИмяПоля = НСтр("ru = 'Точка доставки'");
			ПроверитьЗаполнениеПоляТаблицы(Неопределено, ШаблонОшибкиПоле, ИмяПоля, НомерСтроки, КлючДанных, ПутьКПолю, Отказ);
			
		КонецЕсли;
		
		Если НЕ ЗонаДоставкиЗадана
			И ВыводитьОшибкиЗаполнения Тогда
			
			ИмяПоля = НСтр("ru = 'Зона доставки'");
			ПроверитьЗаполнениеПоляТаблицы(Неопределено, ШаблонОшибкиПоле, ИмяПоля, НомерСтроки, КлючДанных, ПутьКПолю, Отказ);
			
		КонецЕсли;
		#КонецОбласти
		
		Если СтрокаДоставки.СпособДоставки = Перечисления.СпособыДоставки25.НашимиСилами Тогда
			
			Если СтрокаДоставки.ДоставкаДоПеревозчика Тогда
				
				Если ВыводитьОшибкиЗаполнения Тогда
					
					ИмяПоля = НСтр("ru = 'Перевозчик'");
					ПроверитьЗаполнениеПоляТаблицы(СтрокаДоставки.Перевозчик, ШаблонОшибкиПоле, ИмяПоля, НомерСтроки, КлючДанных, ПутьКПолю, Отказ);
					
					ИмяПоля = НСтр("ru = 'Точка доставки перевозчика'");
					ПроверитьЗаполнениеПоляТаблицы(СтрокаДоставки.ТочкаДоставкиПеревозчика, ШаблонОшибкиПоле, ИмяПоля, НомерСтроки, КлючДанных, ПутьКПолю, Отказ);
					
					ИмяПоля = НСтр("ru = 'Зона доставки перевозчика'");
					ПроверитьЗаполнениеПоляТаблицы(СтрокаДоставки.ЗонаДоставкиПеревозчика, ШаблонОшибкиПоле, ИмяПоля, НомерСтроки, КлючДанных, ПутьКПолю, Отказ);
					
				КонецЕсли;
				
			Иначе
				
				Если ОбновитьДанные Тогда
					
					СтрокаДоставки.Перевозчик = Справочники.Партнеры.ПустаяСсылка();
					СтрокаДоставки.ТочкаДоставкиПеревозчика = Справочники.ТочкиДоставки.ПустаяСсылка();
					СтрокаДоставки.ЗонаДоставкиПеревозчика = Справочники.ЗоныДоставки.ПустаяСсылка();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаДоставки.СпособДоставки = Перечисления.СпособыДоставки25.СиламиПеревозчика Тогда
			
			Если ВыводитьОшибкиЗаполнения Тогда
				
				ИмяПоля = НСтр("ru = 'Перевозчик'");
				ПроверитьЗаполнениеПоляТаблицы(СтрокаДоставки.Перевозчик, ШаблонОшибкиПоле, ИмяПоля, НомерСтроки, КлючДанных, ПутьКПолю, Отказ);
				
			КонецЕсли;
			
			Если ОбновитьДанные Тогда
				
				СтрокаДоставки.ТочкаДоставкиПеревозчика = Справочники.ТочкиДоставки.ПустаяСсылка();
				СтрокаДоставки.ЗонаДоставкиПеревозчика = Справочники.ЗоныДоставки.ПустаяСсылка();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаДоставки.ОсобыеУсловияПеревозки Тогда
			
			Если ВыводитьОшибкиЗаполнения Тогда
				
				ИмяПоля = НСтр("ru = 'Описание особых условий перевозки'");
				ПроверитьЗаполнениеПоляТаблицы(СтрокаДоставки.ОсобыеУсловияПеревозкиОписание, ШаблонОшибкиПоле, ИмяПоля, НомерСтроки, КлючДанных, ПутьКПолю, Отказ);
				
			КонецЕсли;
			
		Иначе
			
			Если ОбновитьДанные Тогда
				СтрокаДоставки.ОсобыеУсловияПеревозкиОписание = "";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбновитьДанные Тогда
		
		ТоварыКДоставке = Объект[Настройки.ТоварыКДоставкеИмяТаблицы]; // ТабличнаяЧасть
		ТоварыКДоставке.Загрузить(ТаблицаТоваровДоставки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПоляТаблицы(ПроверяемоеПоле, ШаблонОшибки, ИмяПоля, НомерСтроки, КлючДанных, ПутьКПолю, Отказ)
	
	Если НЕ ЗначениеЗаполнено(ПроверяемоеПоле) Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонОшибки,
			ИмяПоля,
			НомерСтроки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, КлючДанных, ПутьКПолю, "Объект", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СброситьДанныеСтрокиПараметровДоставки(Знач СтрокаДоставки)
	
	СтрокаДоставки.ТочкаДоставки = Справочники.ТочкиДоставки.ПустаяСсылка();
	СтрокаДоставки.ЗонаДоставки = Справочники.ЗоныДоставки.ПустаяСсылка();
	
	СтрокаДоставки.ДоставкаДоПеревозчика = Ложь;
	СтрокаДоставки.Перевозчик = Справочники.Партнеры.ПустаяСсылка();
	СтрокаДоставки.ТочкаДоставкиПеревозчика = Справочники.ТочкиДоставки.ПустаяСсылка();
	СтрокаДоставки.ЗонаДоставкиПеревозчика = Справочники.ЗоныДоставки.ПустаяСсылка();
	
	СтрокаДоставки.ВремяДоставкиС = Дата(1, 1, 1, 0, 0, 0);
	СтрокаДоставки.ВремяДоставкиПо = Дата(1, 1, 1, 0, 0, 0);
	
	СтрокаДоставки.ДополнительнаяИнформацияПоДоставке = "";
	
	СтрокаДоставки.ОсобыеУсловияПеревозки = Ложь;
	СтрокаДоставки.ОсобыеУсловияПеревозкиОписание = "";

КонецПроцедуры

Процедура ПроверитьОбновитьДанныеПоТочкеДоставки(Знач ДанныеТочкиДоставки, Знач ВладельцыТочекДоставки, ТочкаДоставки, ТочкаДоставкиЗадана, ЗонаДоставки, ЗонаДоставкиЗадана, Знач ОбновитьДанные, Знач ТолькоСброс)
	
	ВладелецТекущейТочкиДоставки = ВладельцыТочекДоставки[ТочкаДоставки];
	
	Если ТочкаДоставки.Пустая()
		ИЛИ ДанныеТочкиДоставки.Владелец <> ВладелецТекущейТочкиДоставки Тогда
		
		Если НЕ ЗонаДоставки.Пустая()
			И ДанныеТочкиДоставки.Владелец = ВладелецТекущейТочкиДоставки Тогда
			
			ТочкаДоставкиЗадана = Ложь;
			
		ИначеЕсли ДанныеТочкиДоставки.ТочкаДоставки.Пустая() Тогда
			
			ТочкаДоставкиЗадана = Ложь;
			ЗонаДоставкиЗадана = Ложь;
			
		Иначе
			
			Если ДанныеТочкиДоставки.ЗонаДоставки.Пустая() Тогда
				ЗонаДоставкиЗадана = Ложь;
			КонецЕсли;
			
			Если ОбновитьДанные Тогда
				
				ТочкаДоставки = ДанныеТочкиДоставки.ТочкаДоставки;
				ЗонаДоставки = ДанныеТочкиДоставки.ЗонаДоставки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если ДанныеТочкиДоставки.Владелец = ВладелецТекущейТочкиДоставки Тогда
			
			Если ЗонаДоставки.Пустая()
				И (ТочкаДоставки <> ДанныеТочкиДоставки.ТочкаДоставки
					ИЛИ ДанныеТочкиДоставки.ЗонаДоставки.Пустая()) Тогда
				
				ЗонаДоставкиЗадана = Ложь;
				
			ИначеЕсли ЗонаДоставки.Пустая()
				И ТочкаДоставки = ДанныеТочкиДоставки.ТочкаДоставки
				И ОбновитьДанные Тогда
				
				ЗонаДоставки = ДанныеТочкиДоставки.ЗонаДоставки;
				
			КонецЕсли;
			
		Иначе
			
			Если ДанныеТочкиДоставки.ТочкаДоставки.Пустая()
				ИЛИ ТолькоСброс Тогда
				
				ТочкаДоставкиЗадана = Ложь;
				ЗонаДоставкиЗадана = Ложь;
				
				Если ОбновитьДанные Тогда
					
					ТочкаДоставки = Справочники.ТочкиДоставки.ПустаяСсылка();
					ЗонаДоставки = Справочники.ЗоныДоставки.ПустаяСсылка();
					
				КонецЕсли;
				
			Иначе
				
				Если ДанныеТочкиДоставки.ЗонаДоставки.Пустая() Тогда
					
					ЗонаДоставкиЗадана = Ложь;
					Если ОбновитьДанные Тогда
						ЗонаДоставки = Справочники.ЗоныДоставки.ПустаяСсылка();
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  СкладыДоставки - Массив из СправочникСсылка.Склады
//  ТаблицаТекущихДанных - ТаблицаЗначений - таблица текущих данных по складам:
//    * Склад - СправочникСсылка.Склады
//    * ТочкаСклада - СправочникСсылка.ТочкиДоставки
//    * ЗонаСклада - СправочникСсылка.ЗоныДоставки
// 
// Возвращаемое значение:
//  Структура - Сформировать данные доставки по складам:
// * ДублиСкладов - ТаблицаЗначений:
//    ** Склад - СправочникСсылка.Склады 
// * ТаблицаСведений - ТаблицаЗначений:
//    ** Склад - СправочникСсылка.Склады
//    ** ТочкаСклада - СправочникСсылка.ТочкиДоставки
//    ** ЗонаСклада - СправочникСсылка.ЗоныДоставки
// 
Функция СформироватьДанныеДоставкиПоСкладам(СкладыДоставки, ТаблицаТекущихДанных)
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВтТаблицаСведений.Склад КАК Склад,
	|	ВтТаблицаСведений.ТочкаСклада КАК ТочкаСклада,
	|	ВтТаблицаСведений.ЗонаСклада КАК ЗонаСклада
	|ПОМЕСТИТЬ ВтТекущиеСведения
	|ИЗ
	|	&ТаблицаСкладыСведенияДоставки КАК ВтТаблицаСведений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад,
	|	ЕСТЬNULL(ТочкиДоставки.Ссылка, ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)) КАК ТочкаДоставки,
	|	ЕСТЬNULL(ТочкиДоставки.ЗонаДоставки, ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяСсылка)) КАК ЗонаДоставки
	|ПОМЕСТИТЬ ВтДанныеПоСкладам
	|ИЗ
	|	Справочник.Склады КАК Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТочкиДоставки КАК ТочкиДоставки
	|		ПО Склады.Ссылка = ТочкиДоставки.Владелец
	|			И (ТочкиДоставки.ОсновнаяТочка)
	|ГДЕ
	|	Склады.Ссылка В(&Ссылки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТекущиеСведения.Склад КАК Склад,
	|	1 КАК КоличествоЗаписей
	|ИЗ
	|	ВтТекущиеСведения КАК ВтТекущиеСведения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТекущиеСведения.Склад
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(1) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанныеПоСкладам.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ВтТекущиеСведения.ТочкаСклада ЕСТЬ NULL
	|			ТОГДА ВтДанныеПоСкладам.ТочкаДоставки
	|		КОГДА ВтТекущиеСведения.ТочкаСклада = ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)
	|			ТОГДА ВтДанныеПоСкладам.ТочкаДоставки
	|		ИНАЧЕ ВтТекущиеСведения.ТочкаСклада
	|	КОНЕЦ КАК ТочкаСклада,
	|	ВЫБОР
	|		КОГДА ВтТекущиеСведения.ЗонаСклада ЕСТЬ NULL
	|			ТОГДА ВтДанныеПоСкладам.ЗонаДоставки
	|		КОГДА ВтТекущиеСведения.ЗонаСклада = ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL((ВЫБОР
	|						КОГДА ВтТекущиеСведения.ТочкаСклада ЕСТЬ NULL
	|							ТОГДА ВтДанныеПоСкладам.ТочкаДоставки
	|						КОГДА ВтТекущиеСведения.ТочкаСклада = ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)
	|							ТОГДА ВтДанныеПоСкладам.ТочкаДоставки
	|						ИНАЧЕ ВтТекущиеСведения.ТочкаСклада
	|					КОНЕЦ).ЗонаДоставки, ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка))
	|		КОГДА ВтТекущиеСведения.ТочкаСклада ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ВтДанныеПоСкладам.ТочкаДоставки.ЗонаДоставки, ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка))
	|		КОГДА ВтТекущиеСведения.ТочкаСклада = ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ВтДанныеПоСкладам.ТочкаДоставки.ЗонаДоставки, ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка))
	|		ИНАЧЕ ВтТекущиеСведения.ЗонаСклада
	|	КОНЕЦ КАК ЗонаСклада
	|ИЗ
	|	ВтДанныеПоСкладам КАК ВтДанныеПоСкладам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТекущиеСведения КАК ВтТекущиеСведения
	|		ПО ВтДанныеПоСкладам.Склад = ВтТекущиеСведения.Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склад";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылки", СкладыДоставки);
	Запрос.УстановитьПараметр("ТаблицаСкладыСведенияДоставки", ТаблицаТекущихДанных);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	КоличествоЗапросов = МассивРезультатов.Количество();
	ДублиСкладов = МассивРезультатов[КоличествоЗапросов - 2].Выгрузить();
	ТаблицаНовыхСведенийСкладов = МассивРезультатов[КоличествоЗапросов - 1].Выгрузить();
	
	Результат.Вставить("ДублиСкладов", ДублиСкладов);
	Результат.Вставить("ТаблицаСведений", ТаблицаНовыхСведенийСкладов);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Настройки - см. НовыеНастройкиПроверкиИспользованияРеквизитовДоставки
//  Отказ  - Булево
//  ОбновитьДанные - Булево - указывает на необходимость записи обновленных данных в таблицу
//  ВыводитьОшибкиЗаполнения - Булево - признак необходимости выводить ошибки заполнения
//
Процедура ПроверитьОбновитьСведенияДанныхДоставкиПоСкладам(Знач Настройки, Отказ, ОбновитьДанные = Ложь, ВыводитьОшибкиЗаполнения = Истина)
	
	СкладыСведенияДоставкиИмяТаблицы = "СкладыСведенияДоставки";
	
	Объект = Настройки.ДокументОбъект; // ДокументОбъект
	СкладыДоставки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Настройки.СкладыДоставки);
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(СкладыДоставки, Справочники.Склады.ПустаяСсылка());
	
	ТабличнаяЧастьСведений = Объект[СкладыСведенияДоставкиИмяТаблицы]; // ТабличнаяЧасть
	
	ТаблицаСкладыСведенияДоставки = ТабличнаяЧастьСведений.Выгрузить();
	ДанныеПоСкладам = СформироватьДанныеДоставкиПоСкладам(СкладыДоставки, ТаблицаСкладыСведенияДоставки);
	
	ЕстьДубли = Ложь;
	ШаблонСообщенияДубль = НСтр("ru = 'Для склада ""%1"" обнаружены дубли в записях сведений доставки, обновите настройки доставки.'");
	Для Каждого СтрокаДубля Из ДанныеПоСкладам.ДублиСкладов Цикл
		
		ЕстьДубли = Истина;
		
		Если ВыводитьОшибкиЗаполнения Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщенияДубль,
				Строка(СтрокаДубля));
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				Объект,
				"ТребуетсяДоставка",
				,
				Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЕстьДубли
		И ВыводитьОшибкиЗаполнения Тогда
		
		ПроверитьЗаполнениеСведенийСкладов(Объект, ДанныеПоСкладам.ТаблицаСведений, Отказ);
		
	КонецЕсли;
	
	Если НЕ Отказ
		И ОбновитьДанные Тогда
		
		ТабличнаяЧастьСведений.Загрузить(ДанныеПоСкладам.ТаблицаСведений);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеСведенийСкладов(Знач Объект, Знач ТаблицаСведений, Отказ )
	
	ШаблонСообщенияТочка = НСтр("ru = 'Для склада ""%1"" не указана точка отправки'");
	ШаблонСообщенияЗона = НСтр("ru = 'Для склада ""%1"" не указана зона отправки'");
	
	Для Каждого СтрокаСклада Из ТаблицаСведений Цикл
		
		Если СтрокаСклада.ТочкаСклада.Пустая() Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщенияТочка,
				Строка(СтрокаСклада.Склад));
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				Объект,
				"ТребуетсяДоставка",
				,
				Отказ);
			
		КонецЕсли;
		
		Если СтрокаСклада.ЗонаСклада.Пустая() Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщенияЗона,
				Строка(СтрокаСклада.Склад));
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				Объект,
				"ТребуетсяДоставка",
				,
				Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Настройки - см. НовыеНастройкиПроверкиИспользованияРеквизитовДоставки
//  СпособУказанияДоставки - ПеречислениеСсылка.СпособыУказанияДоставки
//  Отказ  - Булево
//
Процедура ПроверитьПересечениеКлиентаИПеревозчика(Настройки, СпособУказанияДоставки, Отказ)
	
	Если НЕ ЗначениеЗаполнено(Настройки.ВладелецТочекДоставки) Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Настройки.ДокументОбъект; // ДокументОбъект
	ПартнерПеревозчик = Объект[Настройки.ПеревозчикИмяПоля]; // СправочникСсылка.Партнеры
	ПредставлениеПартнера = Строка(Настройки.ВладелецТочекДоставки);
	
	Если СпособУказанияДоставки = Перечисления.СпособыУказанияДоставки.НаВесьДокумент Тогда
		
		Если ПустаяСтрока(Настройки.СпособДоставкиИмяПоля) Тогда
			СпособДоставки = Настройки.СпособДоставкиБезусловный;
		Иначе
			СпособДоставки = Объект[Настройки.СпособДоставкиИмяПоля]; // ПеречислениеСсылка.СпособыДоставки25
		КонецЕсли;
		
		Если ПустаяСтрока(Настройки.ДоставкаДоПеревозчикаИмяПоля) Тогда
			ДоставкаДоПеревозчика = Настройки.ДоставкаДоПеревозчикаБезусловный;
		Иначе
			ДоставкаДоПеревозчика = Объект[Настройки.ДоставкаДоПеревозчикаИмяПоля]; // Булево
		КонецЕсли;
		
		Если ЭтоСпособДоставкиСПеревозчиком(СпособДоставки, ДоставкаДоПеревозчика)
			И Настройки.ВладелецТочекДоставки = ПартнерПеревозчик Тогда
			
			ШаблонСообщения = НСтр("ru = 'Совпадают данные получателя и перевозчика (%1), оформление доставки невозможно.'");
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения,
				ПредставлениеПартнера);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				Объект,
				"ТребуетсяДоставка",
				,
				Отказ);
			
		КонецЕсли;
		
	Иначе
		
		ШаблонСообщения = НСтр("ru = 'Совпадают данные получателя и перевозчика (%1), оформление доставки по строке %2 невозможно.'");
		ТаблицаТоваровДоставки = Настройки.ТаблицаТоваровДоставки;
		КлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(Объект);
		
		Для каждого СтрокаДоставки Из ТаблицаТоваровДоставки Цикл
			
			Если НЕ (ЭтоСпособДоставкиСПеревозчиком(СтрокаДоставки.СпособДоставки, СтрокаДоставки.ДоставкаДоПеревозчика)
				И Настройки.ВладелецТочекДоставки = СтрокаДоставки.Перевозчик) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			НомерСтроки = Формат(СтрокаДоставки.НомерСтрокиДокумента, "ЧГ=");
			ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"Товары", СтрокаДоставки.НомерСтрокиДокумента, "НомерСтроки");
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения,
				ПредставлениеПартнера,
				НомерСтроки);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, КлючДанных, ПутьКПолю, "Объект", Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоСпособДоставкиСПеревозчиком(СпособДоставки, ДоставкаДоПеревозчика)
	
	Результат = Истина;
	
	Если СпособДоставки.Пустая()
		ИЛИ СпособДоставки = Перечисления.СпособыДоставки25.Самовывоз
		ИЛИ СпособДоставки = Перечисления.СпособыДоставки25.НашКурьер
		ИЛИ СпособДоставки = Перечисления.СпособыДоставки25.ОпределяетСлужбаДоставки
		ИЛИ (СпособДоставки = Перечисления.СпособыДоставки25.НашимиСилами
			И НЕ ДоставкаДоПеревозчика) Тогда
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  ТаблицаЗначений - Новая таблица товаров доставки:
// * НомерСтрокиДокумента - Число 
// * КодСтроки - Число 
// * Номенклатура - СправочникСсылка.Номенклатура 
// * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры 
// * Серия - СправочникСсылка.СерииНоменклатуры
// * СпособДоставки - ПеречислениеСсылка.СпособыДоставки25
// * ТочкаДоставки - СправочникСсылка.ТочкиДоставки
// * ЗонаДоставки - СправочникСсылка.ЗоныДоставки
// * ДоставкаДоПеревозчика - Булево
// * Перевозчик - СправочникСсылка.Партнеры
// * ТочкаДоставкиПеревозчика - СправочникСсылка.ТочкиДоставки
// * ЗонаДоставкиПеревозчика - СправочникСсылка.ЗоныДоставки
// * ВремяДоставкиС - Дата
// * ВремяДоставкиПо - Дата
// * ДополнительнаяИнформацияПоДоставке - Строка 
// * ОсобыеУсловияПеревозки - Булево
// * ОсобыеУсловияПеревозкиОписание - Строка
//
Функция НоваяТаблицаТоваровДоставки()
	
	ТипЧисло5 = ОбщегоНазначения.ОписаниеТипаЧисло(5,, ДопустимыйЗнак.Неотрицательный);
	ТипЧисло10 = ОбщегоНазначения.ОписаниеТипаЧисло(10,, ДопустимыйЗнак.Неотрицательный);
	ТипВремя = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Время);
	ТипСтрока0 = ОбщегоНазначения.ОписаниеТипаСтрока(0);
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	ТипНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ТипХарактеристика = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
	ТипСерииНоменклатуры = Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры");
	ТипСпособДоставки = Новый ОписаниеТипов("ПеречислениеСсылка.СпособыДоставки25");
	ТипПеревозчик = Новый ОписаниеТипов("СправочникСсылка.Партнеры");
	ТипТочкаДоставки = Новый ОписаниеТипов("СправочникСсылка.ТочкиДоставки");
	ТипЗонаДоставки = Новый ОписаниеТипов("СправочникСсылка.ЗоныДоставки");
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("НомерСтрокиДокумента", ТипЧисло5);
	Таблица.Колонки.Добавить("КодСтроки", ТипЧисло10);
	Таблица.Колонки.Добавить("Номенклатура", ТипНоменклатура);
	Таблица.Колонки.Добавить("Характеристика", ТипХарактеристика);
	Таблица.Колонки.Добавить("Серия", ТипСерииНоменклатуры);
	Таблица.Колонки.Добавить("СпособДоставки", ТипСпособДоставки);
	Таблица.Колонки.Добавить("ТочкаДоставки", ТипТочкаДоставки);
	Таблица.Колонки.Добавить("ЗонаДоставки", ТипЗонаДоставки);
	Таблица.Колонки.Добавить("ДоставкаДоПеревозчика", ТипБулево);
	Таблица.Колонки.Добавить("Перевозчик", ТипПеревозчик);
	Таблица.Колонки.Добавить("ТочкаДоставкиПеревозчика", ТипТочкаДоставки);
	Таблица.Колонки.Добавить("ЗонаДоставкиПеревозчика", ТипЗонаДоставки);
	Таблица.Колонки.Добавить("ВремяДоставкиС", ТипВремя);
	Таблица.Колонки.Добавить("ВремяДоставкиПо", ТипВремя);
	Таблица.Колонки.Добавить("ДополнительнаяИнформацияПоДоставке", ТипСтрока0);
	Таблица.Колонки.Добавить("ОсобыеУсловияПеревозки", ТипБулево);
	Таблица.Колонки.Добавить("ОсобыеУсловияПеревозкиОписание", ТипСтрока0);
	
	Возврат Таблица;
	
КонецФункции

// Параметры:
//  ПроверкаВТранзакции - Булево -
// 
// Возвращаемое значение:
//  Булево -
//
Функция ЕстьОстаткиКОтгрузкеДоЗавершенияПереходаНаДоставку25(ПроверкаВТранзакции = Ложь)
	
	СпособыДоставки = Новый Массив; // Массив из  ПеречислениеСсылка.СпособыДоставки
	СпособыДоставки.Добавить(Перечисления.СпособыДоставки.ДоКлиента);
	СпособыДоставки.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчика);
	СпособыДоставки.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу);
	СпособыДоставки.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки);
	
	ТекстЗапросаРаспоряжения =
	"ВЫБРАТЬ
	|	СостоянияИРеквизитыДоставки.Распоряжение КАК Распоряжение,
	|	СостоянияИРеквизитыДоставки.Склад КАК Склад,
	|	СостоянияИРеквизитыДоставки.СпособДоставки КАК СпособДоставки
	|ПОМЕСТИТЬ ВТ_Распоряжения
	|ИЗ
	|	РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|ГДЕ
	|	СостоянияИРеквизитыДоставки.СпособДоставки В(&СпособыДоставки)
	|	И СостоянияИРеквизитыДоставки.Склад.НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СпособыДоставки", СпособыДоставки);
	Запрос.Текст = ТекстЗапросаРаспоряжения;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Выполнить();
	
	Если ПроверкаВТранзакции Тогда
		
		ТекстЗапросаБлокируемыеЗначения =
		"ВЫБРАТЬ
		|	Распоряжения.Распоряжение КАК Распоряжение,
		|	Распоряжения.Склад КАК Склад,
		|	Распоряжения.СпособДоставки КАК СпособДоставки
		|ИЗ
		|	ВТ_Распоряжения КАК Распоряжения";
		
		Запрос.Текст = ТекстЗапросаБлокируемыеЗначения;
		РезультатЗапроса = Запрос.Выполнить();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияИРеквизитыДоставки");
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СпособДоставки", "СпособДоставки");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыКОтгрузке");
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДокументОтгрузки", "Распоряжение");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
		Исключение
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТоварыКОтгрузкеОстатки.Склад КАК Склад,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КОтгрузкеОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ДокументОтгрузки В
	|		(ВЫБРАТЬ
	|			Распоряжения.Распоряжение КАК ДокументОтгрузки
	|		ИЗ
	|			ВТ_Распоряжения КАК Распоряжения)) КАК ТоварыКОтгрузкеОстатки";
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	ЕстьОстатки = НЕ Результат.Пустой();
	
	Возврат ЕстьОстатки;
	
КонецФункции

// Возвращаемое значение:
// Структура - Дополнительные параметры доставки из шапки распоряжения:
// * ВремяДоставкиС - Дата - 
// * ВремяДоставкиПо - Дата - 
// * ДополнительнаяИнформацияПоДоставке - Строка - 
// * ОсобыеУсловияПеревозки - Булево - 
// * ОсобыеУсловияПеревозкиОписание - Строка - 
// * Совпадают - Булево
//
Функция ДопПараметры()
	
	ПустоеВремя = '00010101';
	ПустаяСтрока = "";
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Совпадают", Истина);
	ДопПараметры.Вставить("ВремяДоставкиС", ПустоеВремя);
	ДопПараметры.Вставить("ВремяДоставкиПо", ПустоеВремя);
	ДопПараметры.Вставить("ДополнительнаяИнформацияПоДоставке", ПустаяСтрока);
	ДопПараметры.Вставить("ОсобыеУсловияПеревозки", Ложь);
	ДопПараметры.Вставить("ОсобыеУсловияПеревозкиОписание", ПустаяСтрока);
	
	Возврат ДопПараметры;
	
КонецФункции

// Параметры:
//  Объекты - Массив из Произвольный - объекты, которые необходимо сгруппировать.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Тип
//  * Значение - Массив из Произвольный
//
Функция ОбъектыПоТипам(Объекты)
	
	ОбъектыПоТипам = Новый Соответствие;
	
	Для Каждого Объект Из Объекты Цикл
		
		ОбъектыТипа = ОбъектыПоТипам[ТипЗнч(Объект)];
		
		Если ОбъектыТипа = Неопределено Тогда
			
			ОбъектыТипа = Новый Массив;
			ОбъектыПоТипам.Вставить(ТипЗнч(Объект), ОбъектыТипа);
			
		КонецЕсли;
		
		ОбъектыТипа.Добавить(Объект);
		
	КонецЦикла;
	
	Возврат ОбъектыПоТипам;
	
КонецФункции

// Возвращаемое значение:
//  ТаблицаЗначений:
// * ЗаказКлиента - ДокументСсылка.ЗаказКлиента -
// * КодСтрокиЗаказа - Число -
// * Номенклатура - СправочникСсылка.Номенклатура - 
// * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - 
// * Серия - СправочникСсылка.СерииНоменклатуры - 
// * Количество - Число -
// * КонечнаяТочкаДоставки - СправочникСсылка.ТочкиДоставки - 
//
Функция НовыеДанныеАдресовРаспоряжения()
	
	ТипЗаказ = Метаданные.Документы.РеализацияТоваровУслуг.ТабличныеЧасти.Товары.Реквизиты.ЗаказКлиента.Тип;
	ТипКод = ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный);
	ТипКоличество = ОбщегоНазначения.ОписаниеТипаЧисло(15, 3);
	
	ДанныеАдресов = Новый ТаблицаЗначений;
	ДанныеАдресов.Колонки.Добавить("ЗаказКлиента", ТипЗаказ);
	ДанныеАдресов.Колонки.Добавить("КодСтрокиЗаказа", ТипКод);
	ДанныеАдресов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДанныеАдресов.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ДанныеАдресов.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ДанныеАдресов.Колонки.Добавить("Количество", ТипКоличество);
	ДанныеАдресов.Колонки.Добавить("КонечнаяТочкаДоставки", Новый ОписаниеТипов("СправочникСсылка.ТочкиДоставки"));
	
	Возврат ДанныеАдресов;
	
КонецФункции

Функция ТекстЗапросаДанныхРаспоряженийНаДоставку()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.ЗаказКлиента КАК ЗаказКлиента,
	|	ВЫБОР
	|		КОГДА Товары.ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|			ТОГДА Товары.Ссылка
	|		ИНАЧЕ Товары.ЗаказКлиента
	|	КОНЕЦ КАК Распоряжение,
	|	Товары.КодСтроки КАК КодСтроки,
	|	Товары.КодСтрокиДоставки КАК КодСтрокиДоставки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ДанныеРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И (&БезОтбораПоНоменклатуре
	|		ИЛИ Товары.Номенклатура В (&ОтборНоменклатуры))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеРеализации.Ссылка КАК Ссылка,
	|	ДанныеРеализации.ЗаказКлиента КАК ЗаказКлиента,
	|	ДанныеРеализации.КодСтроки КАК КодСтроки,
	|	ДанныеРеализации.КодСтрокиДоставки КАК КодСтрокиДоставки,
	|	ДанныеРеализации.Номенклатура КАК Номенклатура,
	|	ДанныеРеализации.Характеристика КАК Характеристика,
	|	ДанныеРеализации.Серия КАК Серия,
	|	ДанныеРеализации.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_СтрокиНеПоЗаказам
	|ИЗ
	|	ВТ_ДанныеРеализации КАК ДанныеРеализации
	|ГДЕ
	|	ДанныеРеализации.ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеРеализации.Ссылка КАК Ссылка,
	|	ДанныеРеализации.ЗаказКлиента КАК ЗаказКлиента,
	|	ДанныеРеализации.КодСтроки КАК КодСтроки,
	|	ДанныеРеализации.КодСтрокиДоставки КАК КодСтрокиДоставки,
	|	ДанныеРеализации.Номенклатура КАК Номенклатура,
	|	ДанныеРеализации.Характеристика КАК Характеристика,
	|	ДанныеРеализации.Серия КАК Серия,
	|	ДанныеРеализации.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_СтрокиПоЗаказам
	|ИЗ
	|	ВТ_ДанныеРеализации КАК ДанныеРеализации
	|ГДЕ
	|	ДанныеРеализации.ЗаказКлиента <> НЕОПРЕДЕЛЕНО
	|	И ДанныеРеализации.КодСтроки <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеРеализации.Ссылка КАК Ссылка,
	|	ДанныеРеализации.ЗаказКлиента КАК ЗаказКлиента,
	|	ДанныеРеализации.КодСтроки КАК КодСтроки,
	|	ДанныеРеализации.КодСтрокиДоставки КАК КодСтрокиДоставки,
	|	ДанныеРеализации.Номенклатура КАК Номенклатура,
	|	ДанныеРеализации.Характеристика КАК Характеристика,
	|	ДанныеРеализации.Серия КАК Серия,
	|	ДанныеРеализации.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_СтрокиСверхЗаказа
	|ИЗ
	|	ВТ_ДанныеРеализации КАК ДанныеРеализации
	|ГДЕ
	|	ДанныеРеализации.ЗаказКлиента <> НЕОПРЕДЕЛЕНО
	|	И ДанныеРеализации.КодСтроки = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доставка.Распоряжение КАК Распоряжение,
	|	Доставка.ДокументПланирования КАК ДокументПланирования,
	|	Доставка.КодСтроки КАК КодСтроки,
	|	Доставка.Номенклатура КАК Номенклатура,
	|	Доставка.Характеристика КАК Характеристика,
	|	Доставка.Серия КАК Серия,
	|	Доставка.КДоставкеОборот КАК КДоставке,
	|	Доставка.КРейсуОборот КАК КРейсу,
	|	Доставка.ВРейсеОборот КАК ВРейсе
	|ПОМЕСТИТЬ ВТ_ДанныеДоставкиНеПоЗаказу
	|ИЗ
	|	РегистрНакопления.Доставка.Обороты(
	|			,
	|			,
	|			,
	|			Плечо = 1
	|				И (Распоряжение, Номенклатура, Характеристика, Серия, КодСтроки) В
	|					(ВЫБРАТЬ
	|						Т.Ссылка,
	|						Т.Номенклатура,
	|						Т.Характеристика,
	|						Т.Серия,
	|						Т.КодСтрокиДоставки
	|					ИЗ
	|						ВТ_СтрокиНеПоЗаказам КАК Т)) КАК Доставка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доставка.Распоряжение КАК Распоряжение,
	|	Доставка.ДокументПланирования КАК ДокументПланирования,
	|	Доставка.КодСтроки КАК КодСтроки,
	|	Доставка.Номенклатура КАК Номенклатура,
	|	Доставка.Характеристика КАК Характеристика,
	|	Доставка.Серия КАК Серия,
	|	Доставка.КДоставкеОборот КАК КДоставке,
	|	Доставка.КРейсуОборот КАК КРейсу,
	|	Доставка.ВРейсеОборот КАК ВРейсе
	|ПОМЕСТИТЬ ВТ_ДанныеДоставкиПоЗаказу
	|ИЗ
	|	РегистрНакопления.Доставка.Обороты(
	|			,
	|			,
	|			,
	|			Плечо = 1
	|				И НЕ ДокументПланирования В
	|						(ВЫБРАТЬ
	|							Т.Ссылка
	|						ИЗ
	|							ВТ_СтрокиПоЗаказам КАК Т)
	|				И (Распоряжение, Номенклатура, Характеристика, Серия, КодСтроки) В
	|					(ВЫБРАТЬ
	|						Т.ЗаказКлиента,
	|						Т.Номенклатура,
	|						Т.Характеристика,
	|						Т.Серия,
	|						Т.КодСтроки
	|					ИЗ
	|						ВТ_СтрокиПоЗаказам КАК Т)) КАК Доставка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доставка.Распоряжение КАК Распоряжение,
	|	Доставка.ДокументПланирования КАК ДокументПланирования,
	|	Доставка.КодСтроки КАК КодСтроки,
	|	Доставка.Номенклатура КАК Номенклатура,
	|	Доставка.Характеристика КАК Характеристика,
	|	Доставка.Серия КАК Серия,
	|	Доставка.КДоставкеОборот КАК КДоставке,
	|	Доставка.КРейсуОборот КАК КРейсу,
	|	Доставка.ВРейсеОборот КАК ВРейсе
	|ПОМЕСТИТЬ ВТ_ДанныеДоставкиСверхЗаказа
	|ИЗ
	|	РегистрНакопления.Доставка.Обороты(
	|			,
	|			,
	|			,
	|			Плечо = 1
	|				И (Распоряжение, ДокументПланирования, Номенклатура, Характеристика, Серия, КодСтроки) В
	|					(ВЫБРАТЬ
	|						Т.ЗаказКлиента,
	|						Т.Ссылка,
	|						Т.Номенклатура,
	|						Т.Характеристика,
	|						Т.Серия,
	|						Т.КодСтрокиДоставки
	|					ИЗ
	|						ВТ_СтрокиСверхЗаказа КАК Т)) КАК Доставка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДоставки.Распоряжение КАК Распоряжение,
	|	ДанныеДоставки.ДокументПланирования КАК ДокументПланирования,
	|	ДанныеДоставки.КодСтроки КАК КодСтроки,
	|	ДанныеДоставки.Номенклатура КАК Номенклатура,
	|	ДанныеДоставки.Характеристика КАК Характеристика,
	|	ДанныеДоставки.Серия КАК Серия,
	|	ДанныеДоставки.КДоставке КАК КДоставке,
	|	ДанныеДоставки.КРейсу КАК КРейсу,
	|	ДанныеДоставки.ВРейсе КАК ВРейсе
	|ПОМЕСТИТЬ ВТ_ДанныеДоставки
	|ИЗ
	|	ВТ_ДанныеДоставкиНеПоЗаказу КАК ДанныеДоставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДоставки.Распоряжение,
	|	ДанныеДоставки.ДокументПланирования,
	|	ДанныеДоставки.КодСтроки,
	|	ДанныеДоставки.Номенклатура,
	|	ДанныеДоставки.Характеристика,
	|	ДанныеДоставки.Серия,
	|	ДанныеДоставки.КДоставке,
	|	ДанныеДоставки.КРейсу,
	|	ДанныеДоставки.ВРейсе
	|ИЗ
	|	ВТ_ДанныеДоставкиПоЗаказу КАК ДанныеДоставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДоставки.Распоряжение,
	|	ДанныеДоставки.ДокументПланирования,
	|	ДанныеДоставки.КодСтроки,
	|	ДанныеДоставки.Номенклатура,
	|	ДанныеДоставки.Характеристика,
	|	ДанныеДоставки.Серия,
	|	ДанныеДоставки.КДоставке,
	|	ДанныеДоставки.КРейсу,
	|	ДанныеДоставки.ВРейсе
	|ИЗ
	|	ВТ_ДанныеДоставкиСверхЗаказа КАК ДанныеДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДоставки.Распоряжение КАК Распоряжение,
	|	ДанныеДоставки.ДокументПланирования КАК ДокументПланирования,
	|	ДанныеДоставки.КодСтроки КАК КодСтроки,
	|	ДанныеДоставки.Номенклатура КАК Номенклатура,
	|	ДанныеДоставки.Характеристика КАК Характеристика,
	|	ДанныеДоставки.Серия КАК Серия,
	|	СУММА(ДанныеДоставки.ВРейсе) КАК ОстатокВРейсе,
	|	СУММА(ДанныеДоставки.КРейсу) - СУММА(ДанныеДоставки.ВРейсе) КАК ОстатокКРейсу,
	|	СУММА(ДанныеДоставки.КДоставке) - СУММА(ДанныеДоставки.КРейсу) КАК ОстатокКДоставке
	|ПОМЕСТИТЬ ВТ_ОстаткиПоДокументамПланирования
	|ИЗ
	|	ВТ_ДанныеДоставки КАК ДанныеДоставки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДоставки.Распоряжение,
	|	ДанныеДоставки.ДокументПланирования,
	|	ДанныеДоставки.КодСтроки,
	|	ДанныеДоставки.Номенклатура,
	|	ДанныеДоставки.Характеристика,
	|	ДанныеДоставки.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДоставки.Распоряжение КАК Распоряжение,
	|	ДанныеДоставки.КодСтроки КАК КодСтроки,
	|	ДанныеДоставки.Номенклатура КАК Номенклатура,
	|	ДанныеДоставки.Характеристика КАК Характеристика,
	|	ДанныеДоставки.Серия КАК Серия,
	|	СУММА(ДанныеДоставки.ВРейсе) КАК ОстатокВРейсе,
	|	СУММА(ДанныеДоставки.КРейсу) - СУММА(ДанныеДоставки.ВРейсе) КАК ОстатокКРейсу,
	|	СУММА(ДанныеДоставки.КДоставке) - СУММА(ДанныеДоставки.КРейсу) КАК ОстатокКДоставке
	|ПОМЕСТИТЬ ВТ_ОстаткиПоРаспоряжению
	|ИЗ
	|	ВТ_ДанныеДоставки КАК ДанныеДоставки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДоставки.Распоряжение,
	|	ДанныеДоставки.КодСтроки,
	|	ДанныеДоставки.Номенклатура,
	|	ДанныеДоставки.Характеристика,
	|	ДанныеДоставки.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоРаспоряжению.Распоряжение КАК Распоряжение,
	|	ОстаткиПоРаспоряжению.ДокументПланирования КАК ДокументПланирования,
	|	ОстаткиПоРаспоряжению.КодСтроки КАК КодСтроки,
	|	ОстаткиПоРаспоряжению.Номенклатура КАК Номенклатура,
	|	ОстаткиПоРаспоряжению.Характеристика КАК Характеристика,
	|	ОстаткиПоРаспоряжению.Серия КАК Серия,
	|	ЕСТЬNULL(Доставка.ТочкаПолучателя, ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)) КАК ТочкаДоставки
	|ПОМЕСТИТЬ ВТ_ТочкиВРейсе
	|ИЗ
	|	ВТ_ОстаткиПоДокументамПланирования КАК ОстаткиПоРаспоряжению
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК Доставка
	|		ПО ОстаткиПоРаспоряжению.Распоряжение = Доставка.Распоряжение
	|			И ОстаткиПоРаспоряжению.ДокументПланирования = Доставка.ДокументПланирования
	|			И ОстаткиПоРаспоряжению.КодСтроки = Доставка.КодСтроки
	|			И (Доставка.УровеньОперации = 30)
	|			И (Доставка.ЭтоКонечноеПлечо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доставка.Распоряжение КАК Распоряжение,
	|	Доставка.КодСтроки КАК КодСтроки,
	|	Доставка.Номенклатура КАК Номенклатура,
	|	Доставка.Характеристика КАК Характеристика,
	|	Доставка.Серия КАК Серия,
	|	Доставка.ТочкаПолучателя КАК ТочкаДоставки,
	|	Доставка.ВРейсеОборот КАК Остаток
	|ПОМЕСТИТЬ ВТ_ОстаткиВРейсе
	|ИЗ
	|	РегистрНакопления.Доставка.Обороты(
	|			,
	|			,
	|			,
	|			(Распоряжение, ДокументПланирования, КодСтроки, ТочкаПолучателя) В
	|				(ВЫБРАТЬ
	|					Т.Распоряжение,
	|					Т.ДокументПланирования,
	|					Т.КодСтроки,
	|					Т.ТочкаДоставки
	|				ИЗ
	|					ВТ_ТочкиВРейсе КАК Т)) КАК Доставка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоДокументамПланирования.Распоряжение КАК Распоряжение,
	|	ОстаткиПоДокументамПланирования.КодСтроки КАК КодСтроки,
	|	ОстаткиПоДокументамПланирования.Номенклатура КАК Номенклатура,
	|	ОстаткиПоДокументамПланирования.Характеристика КАК Характеристика,
	|	ОстаткиПоДокументамПланирования.Серия КАК Серия,
	|	ОстаткиПоДокументамПланирования.ОстатокКРейсу КАК Остаток,
	|	Доставка.ТочкаПолучателя КАК ТочкаДоставки
	|ПОМЕСТИТЬ ВТ_ОстаткиКРейсу
	|ИЗ
	|	ВТ_ОстаткиПоДокументамПланирования КАК ОстаткиПоДокументамПланирования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК Доставка
	|		ПО ОстаткиПоДокументамПланирования.Распоряжение = Доставка.Распоряжение
	|			И ОстаткиПоДокументамПланирования.ДокументПланирования = Доставка.ДокументПланирования
	|			И ОстаткиПоДокументамПланирования.КодСтроки = Доставка.КодСтроки
	|			И (Доставка.УровеньОперации В (15, 20))
	|			И (Доставка.ЭтоКонечноеПлечо)
	|ГДЕ
	|	ОстаткиПоДокументамПланирования.ОстатокКРейсу <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоРаспоряжению.Распоряжение КАК Распоряжение,
	|	ОстаткиПоРаспоряжению.КодСтроки КАК КодСтроки,
	|	ОстаткиПоРаспоряжению.Номенклатура КАК Номенклатура,
	|	ОстаткиПоРаспоряжению.Характеристика КАК Характеристика,
	|	ОстаткиПоРаспоряжению.Серия КАК Серия,
	|	ОстаткиПоРаспоряжению.ОстатокКДоставке КАК Остаток,
	|	ЕСТЬNULL(Доставка.ТочкаПолучателя, ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)) КАК ТочкаДоставки
	|ПОМЕСТИТЬ ВТ_ОстаткиКДоставке
	|ИЗ
	|	ВТ_ОстаткиПоРаспоряжению КАК ОстаткиПоРаспоряжению
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК Доставка
	|		ПО ОстаткиПоРаспоряжению.Распоряжение = Доставка.Распоряжение
	|			И ОстаткиПоРаспоряжению.КодСтроки = Доставка.КодСтроки
	|			И (Доставка.УровеньОперации = 10)
	|			И (Доставка.ЭтоКонечноеПлечо)
	|ГДЕ
	|	ОстаткиПоРаспоряжению.ОстатокКДоставке <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Остатки.Распоряжение ССЫЛКА Документ.ЗаказКлиента
	|			ТОГДА Остатки.Распоряжение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказКлиента,
	|	Остатки.КодСтроки КАК КодСтрокиЗаказа,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.Серия КАК Серия,
	|	Остатки.ТочкаДоставки КАК КонечнаяТочкаДоставки,
	|	СУММА(Остатки.Остаток) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.Распоряжение КАК Распоряжение,
	|		Остатки.КодСтроки КАК КодСтроки,
	|		Остатки.Номенклатура КАК Номенклатура,
	|		Остатки.Характеристика КАК Характеристика,
	|		Остатки.Серия КАК Серия,
	|		Остатки.ТочкаДоставки КАК ТочкаДоставки,
	|		Остатки.Остаток КАК Остаток
	|	ИЗ
	|		ВТ_ОстаткиВРейсе КАК Остатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Остатки.Распоряжение,
	|		Остатки.КодСтроки,
	|		Остатки.Номенклатура,
	|		Остатки.Характеристика,
	|		Остатки.Серия,
	|		Остатки.ТочкаДоставки,
	|		Остатки.Остаток
	|	ИЗ
	|		ВТ_ОстаткиКРейсу КАК Остатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Остатки.Распоряжение,
	|		Остатки.КодСтроки,
	|		Остатки.Номенклатура,
	|		Остатки.Характеристика,
	|		Остатки.Серия,
	|		Остатки.ТочкаДоставки,
	|		Остатки.Остаток
	|	ИЗ
	|		ВТ_ОстаткиКДоставке КАК Остатки) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Распоряжение,
	|	Остатки.КодСтроки,
	|	Остатки.ТочкаДоставки,
	|	Остатки.Номенклатура,
	|	Остатки.Характеристика,
	|	Остатки.Серия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказКлиента,
	|	КодСтрокиЗаказа,
	|	КонечнаяТочкаДоставки,
	|	Номенклатура,
	|	Характеристика,
	|	Серия";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#Область РаботаСАдресамиДоставки

Функция ТекстЗапросаВладельцевДляСозданияТочекДоставки()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СкладыКИ.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(*) КАК КоличествоАдресов
	|ПОМЕСТИТЬ ВТ_АдресаВладельцев
	|ИЗ
	|	Справочник.Склады.КонтактнаяИнформация КАК СкладыКИ
	|ГДЕ
	|	НЕ СкладыКИ.Ссылка.ЭтоГруппа
	|	И СкладыКИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И ДЛИНАСТРОКИ(СОКРЛП(СкладыКИ.Представление)) > 0
	|СГРУППИРОВАТЬ ПО
	|	СкладыКИ.Ссылка
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПартнерыКИ.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(*) КАК КоличествоАдресов
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКИ
	|ГДЕ
	|	ПартнерыКИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И ДЛИНАСТРОКИ(СОКРЛП(ПартнерыКИ.Представление)) > 0
	|СГРУППИРОВАТЬ ПО
	|	ПартнерыКИ.Ссылка
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 100
	|	АдресаВладельцев.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_АдресаВладельцев КАК АдресаВладельцев
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТочкиДоставки КАК ТочкиДоставки
	|		ПО АдресаВладельцев.Ссылка = ТочкиДоставки.Владелец
	|ГДЕ
	|	ТочкиДоставки.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Параметры:
//  ВладелецТочкиДоставки - СправочникСсылка.Склады
//                        - СправочникСсылка.Партнеры
//
Процедура СоздатьТочкиДоставкиПоВладельцу(ВладелецТочкиДоставки)
	
	Если Не ОбщегоНазначения.СсылкаСуществует(ВладелецТочкиДоставки) Тогда
		Возврат;
	КонецЕсли;
	
	ПространствоБлокировки = ОбщегоНазначения.ИмяТаблицыПоСсылке(ВладелецТочкиДоставки);
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить(ПространствоБлокировки);
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ВладелецТочкиДоставки);
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ТочкиДоставки");
		ЭлементБлокировки.УстановитьЗначение("Владелец", ВладелецТочкиДоставки);
		Блокировка.Заблокировать();
		
		ДанныеТочекДоставки = ДанныеТочекДоставкиВладельца(ВладелецТочкиДоставки);
		Для Каждого ДанныеТочки Из ДанныеТочекДоставки Цикл
			
			ОбновитьСоздатьТочкуДоставки(ВладелецТочкиДоставки, ДанныеТочки, Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписатьОшибкуСозданияТочекДоставкиВЖурнал(ПредставлениеОшибки, ВладелецТочкиДоставки);
		
	КонецПопытки;
	
КонецПроцедуры

Функция ДанныеТочекДоставкиВладельца(ВладелецТочкиДоставки)
	
	Если ТипЗнч(ВладелецТочкиДоставки) = Тип("СправочникСсылка.Склады") Тогда
		
		ТекстЗапроса = ТекстЗапросаАдресовСклад();
		ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресСклада;
		
	ИначеЕсли ТипЗнч(ВладелецТочкиДоставки) = Тип("СправочникСсылка.Партнеры") Тогда
		
		ТекстЗапроса = ТекстЗапросаАдресовПартнер();
		ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец", ВладелецТочкиДоставки);
	Запрос.УстановитьПараметр("ВидКИ", ВидКИ);
	
	ДанныеКИ = Запрос.Выполнить().Выгрузить();
	ДанныеАдресов = ДанныеАдресовПоДаннымКонтактнойИнформации(ДанныеКИ);
	
	Отбор = Новый Структура("Основной", Истина);
	ОсновныеАдреса = ДанныеАдресов.НайтиСтроки(Отбор);
	НесколькоОсновныхАдресов = (ОсновныеАдреса.Количество() > 1);
	
	ДанныеТочекДоставки = НовыеДанныеТочекДоставки();
	
	Для Каждого ДанныеАдреса Из ДанныеАдресов Цикл
		
		ДанныеТочки = ДанныеТочекДоставки.Добавить();
		ДанныеТочки.НесколькоОсновныхАдресов = НесколькоОсновныхАдресов;
		
		Если НесколькоОсновныхАдресов Тогда
			
			ОсновнойАдрес = Ложь;
			
		Иначе
			
			ОсновнойАдрес = ДанныеАдреса.Основной;
			
		КонецЕсли;
		
		Если НЕ ОсновнойАдрес Тогда
			
			ДанныеАдреса.ЗонаДоставки = Справочники.ЗоныДоставки.ПустаяСсылка();
			
		КонецЕсли;
		
		ЗаполнитьДанныеТочкиДоставкиДаннымиАдреса(ДанныеТочки, ДанныеАдреса, ОсновнойАдрес);
		ПроверитьЗаполнитьПредставлениеАдреса(ДанныеТочки);
		
	КонецЦикла;
	
	Возврат ДанныеТочекДоставки;
	
КонецФункции

Процедура ПроверитьЗаполнитьПредставлениеАдреса(ДанныеТочкиДоставки)
	
	Если ПустаяСтрока(ДанныеТочкиДоставки.Адрес) Тогда
		
		Источник = "";
		
		Если НЕ ПустаяСтрока(ДанныеТочкиДоставки.АдресЗначение) Тогда
			
			Источник = ДанныеТочкиДоставки.АдресЗначение;
			
		ИначеЕсли НЕ ПустаяСтрока(ДанныеТочкиДоставки.АдресЗначенияПолей) Тогда
			
			Источник = ДанныеТочкиДоставки.АдресЗначенияПолей;
			
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Источник) Тогда
			
			ДанныеТочкиДоставки.Адрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(Источник);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаАдресовСклад()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.Значение КАК Значение,
	|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	КонтактнаяИнформация.Вид КАК Вид
	|ИЗ
	|	Справочник.Склады.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Владелец
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И СОКРЛП(КонтактнаяИнформация.Представление) <> """"";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаАдресовПартнер()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.Значение КАК Значение,
	|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	КонтактнаяИнформация.Ссылка.ЗонаДоставки КАК ЗонаДоставки,
	|	КонтактнаяИнформация.Вид КАК Вид
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Владелец
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И СОКРЛП(КонтактнаяИнформация.Представление) <> """"";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ЗаписатьОшибкуСозданияТочекДоставкиВЖурнал(ПредставлениеОшибки, ВладелецТочкиДоставки)
	
	ИмяСобытия = НСтр("ru = 'Переход на управление доставкой 2.5'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ШаблонСообщения = НСтр("ru = 'Не удалось создать точки доставки для %1 по причине:
								 |%2'");
	
	ПредставлениеВладельца = ОбщегоНазначения.ПредметСтрокой(ВладелецТочкиДоставки);
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонСообщения,
		ПредставлениеВладельца,
		ПредставлениеОшибки);
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Предупреждение,
		,
		ВладелецТочкиДоставки,
		ТекстСообщения);
	
КонецПроцедуры

// Параметры:
//  ВладелецКонтактнойИнформации - СправочникСсылка.Партнеры, СправочникСсылка.Склады -
//  ПерваяЗапись - Булево -
// 
// Возвращаемое значение:
//  см. ДоставкаТоваров.НовыеДанныеТочекДоставки
//
Функция ДанныеСуществующихТочекДоставки(ВладелецКонтактнойИнформации, ПерваяЗапись)
	
	ДанныеТочекДоставки = НовыеДанныеТочекДоставки();
	
	Если НЕ ПерваяЗапись Тогда
		
		ТекстЗапроса = ТекстЗапросаДанныхТочекДоставки();
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Владелец", ВладелецКонтактнойИнформации);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ДанныеТочки = ДанныеТочекДоставки.Добавить();
			ЗаполнитьЗначенияСвойств(ДанныеТочки, Выборка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДанныеТочекДоставки;
	
КонецФункции

Функция ТекстЗапросаДанныхТочекДоставки()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТочкиДоставки.Ссылка КАК ТочкаДоставки,
	|	ТочкиДоставки.ОсновнаяТочка КАК ОсновнаяТочка,
	|	ТочкиДоставки.НеИспользуется КАК НеИспользуется,
	|	ТочкиДоставки.Адрес КАК Адрес,
	|	ТочкиДоставки.АдресЗначение КАК АдресЗначение,
	|	ТочкиДоставки.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ТочкиДоставки.ИдентификаторПереопределен КАК ИдентификаторПереопределен,
	|	СОКРЛП(ТочкиДоставки.ИдентификаторТочкиДоставки) КАК ИдентификаторТочкиДоставки,
	|	ТочкиДоставки.Наименование КАК Наименование,
	|	ТочкиДоставки.ЗонаДоставки КАК ЗонаДоставки,
	|	СОКРЛП(ТочкиДоставки.ИдентификаторАдреса) КАК ИдентификаторАдреса
	|ИЗ
	|	Справочник.ТочкиДоставки КАК ТочкиДоставки
	|ГДЕ
	|	ТочкиДоставки.Владелец = &Владелец
	|	И НЕ ТочкиДоставки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторАдреса";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ДанныеОсновнойТочкиДоставки(ДанныеТочекДоставки)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОсновнаяТочка", Истина);
	
	Строки = ДанныеТочекДоставки.НайтиСтроки(Отбор);
	
	Если Строки.Количество() > 0 Тогда
		
		ДанныеТД = Строки[0];
		
	Иначе
		
		ДанныеТД = Неопределено;
		
	КонецЕсли;
	
	Возврат ДанныеТД;
	
КонецФункции

Функция ДанныеТочкиДоставкиПоДаннымАдреса(ДанныеТДВладельца, ДанныеАдреса)
	
	Если ЗначениеЗаполнено(ДанныеАдреса.Идентификатор) Тогда
		
		ДанныеТД =  ДанныеТочкиДоставкиПоИдентификатору(ДанныеТДВладельца, ДанныеАдреса.Идентификатор);
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеАдреса.Адрес) Тогда
		
		ДанныеТД =  ДанныеТочкиДоставкиПоПредставлению(ДанныеТДВладельца, ДанныеАдреса.Адрес);
		
	Иначе
		
		ДанныеТД = Неопределено;
		
	КонецЕсли;
	
	Возврат ДанныеТД;
	
КонецФункции

Функция ДанныеТочкиДоставкиПоИдентификатору(ДанныеТДВладельца, ИдентификаторАдреса)
	
	ДанныеТД = Неопределено;
	
	Если НЕ ПустаяСтрока(ИдентификаторАдреса) Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторАдреса", ИдентификаторАдреса);
		Отбор.Вставить("ИдентификаторТочкиДоставки", "");
		
		Строки = ДанныеТДВладельца.НайтиСтроки(Отбор);
		
		Если Строки.Количество() = 0 Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("ИдентификаторТочкиДоставки", ИдентификаторАдреса);
			
			Строки = ДанныеТДВладельца.НайтиСтроки(Отбор);
			
		КонецЕсли;
		
		Если Строки.Количество() > 0 Тогда
			
			ДанныеТД = Строки[0];
			ДанныеТД.ПодобранаПоИдентификатору = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеТД;
	
КонецФункции

Функция ДанныеТочкиДоставкиПоПредставлению(ДанныеТДВладельца, ПредставлениеАдреса)
	
	ДанныеТД = Неопределено;
	
	Если НЕ ПустаяСтрока(ПредставлениеАдреса) Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Адрес", ПредставлениеАдреса);
		Отбор.Вставить("ИдентификаторАдреса", "");
		Отбор.Вставить("ИдентификаторТочкиДоставки", "");
		
		Строки = ДанныеТДВладельца.НайтиСтроки(Отбор);
		
		Если Строки.Количество() > 0 Тогда
			
			ДанныеТД = Строки[0];
			ДанныеТД.ПодобранаПоАдресу = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеТД;
	
КонецФункции

Процедура ДобавитьДанныеДляИзменения(ДанныеТочекДляИзменения, ДанныеТочки)
	
	ДанныеТД = ДанныеТочекДляИзменения.Добавить();
	ЗаполнитьЗначенияСвойств(ДанныеТД, ДанныеТочки);
	
КонецПроцедуры

Процедура ДобавитьДанныеДляИзмененияНесколькоОсновных(ДанныеКОбработке, ДанныеТочекВладельца, ДанныеОсновногоАдреса, ОсновнаяТДИзменена)
	
	ДанныеСуществующейТД = ДанныеТочкиДоставкиПоДаннымАдреса(ДанныеТочекВладельца, ДанныеОсновногоАдреса);
	
	Если ДанныеСуществующейТД <> Неопределено Тогда
		
		Если ДанныеСуществующейТД.ОсновнаяТочка Тогда
			
			ТребуетсяОбновление = Истина;
			ОсновнаяТДИзменена = Истина;
			
		ИначеЕсли ДанныеСуществующейТД.НеИспользуется Тогда
			
			ТребуетсяОбновление = Истина;
			
		Иначе
			
			ТребуетсяОбновление = Ложь;
			
		КонецЕсли;
		
		Если ТребуетсяОбновление Тогда
			
			ДанныеСуществующейТД.ОсновнаяТочка = Ложь;
			ДанныеСуществующейТД.НеИспользуется = Ложь;
			ДанныеСуществующейТД.НесколькоОсновныхАдресов = Истина;
			
			ДобавитьДанныеДляИзменения(ДанныеКОбработке, ДанныеСуществующейТД);
			
		КонецЕсли;
		
	Иначе
		
		ДанныеТД = ДанныеКОбработке.Добавить();
		ДанныеТД.НесколькоОсновныхАдресов = Истина;
		ЗаполнитьДанныеТочкиДоставкиДаннымиАдреса(ДанныеТД, ДанныеОсновногоАдреса);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДанныеДляИзмененияОднойОсновной(ДанныеКОбработке, ДанныеТочекВладельца, ДанныеОсновногоАдреса, ДанныеОсновнойТД)
	
	ЭтоАдресОсновнойТД = АдресСоответствуетОсновнойТочкеДоставки(ДанныеОсновногоАдреса, ДанныеОсновнойТД);
	
	Если ЭтоАдресОсновнойТД Тогда
		
		ДанныеОсновнойТД.АктуализацияОсновнойТочки = Истина;
		Если Не АдресаРавны(ДанныеОсновнойТД, ДанныеОсновногоАдреса) Тогда
			
			ЗаполнитьДанныеТочкиДоставкиДаннымиАдреса(ДанныеОсновнойТД, ДанныеОсновногоАдреса, Истина);
			ДобавитьДанныеДляИзменения(ДанныеКОбработке, ДанныеОсновнойТД);
			
		КонецЕсли;
		
	Иначе
		
		ТочкаПоОсновномуАдресу = ДанныеТочкиДоставкиПоДаннымАдреса(ДанныеТочекВладельца, ДанныеОсновногоАдреса);
		
		Если Не ЗначениеЗаполнено(ТочкаПоОсновномуАдресу)
			Или Не ТочкаПоОсновномуАдресу.ОсновнаяТочка Тогда
			
			ДанныеОсновнойТД.ОсновнаяТочка = Ложь;
			ДобавитьДанныеДляИзменения(ДанныеКОбработке, ДанныеОсновнойТД);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеТочкиДоставкиДаннымиАдреса(ДанныеТД, ДанныеАдреса, Основная = Ложь)
	
	Если Не ЗначениеЗаполнено(ДанныеТД.ТочкаДоставки) Тогда
		
		ЗаполнитьЗначенияСвойств(ДанныеТД, ДанныеАдреса);
		ДанныеТД.Наименование = НаименованиеТочкиДоставкиПоДаннымАдреса(ДанныеАдреса);
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(ДанныеТД, ДанныеАдреса,, "ЗонаДоставки");
		
		Если (ДанныеТД.АктуализацияОсновнойТочки
				И Не ДанныеТД.ИдентификаторПереопределен)
			Или (Не ДанныеТД.НесколькоОсновныхАдресов
				И ДанныеТД.ПодобранаПоИдентификатору) Тогда
			
			ДанныеТД.Наименование = НаименованиеТочкиДоставкиПоДаннымАдреса(ДанныеАдреса);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеТД.ИдентификаторАдреса = ДанныеАдреса.Идентификатор;
	ДанныеТД.ОсновнаяТочка = Основная;
	Если Основная Тогда
		
		ДанныеТД.НеИспользуется = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НаименованиеТочкиДоставкиПоДаннымАдреса(ДанныеАдреса)
	
	Если Не ПустаяСтрока(ДанныеАдреса.АдресЗначение)
		И ЗначениеЗаполнено(ДанныеАдреса.Идентификатор) Тогда
		
		НаименованиеТочкиДоставки = ДоставкаТоваровЛокализация.НаименованиеТочкиДоставкиПоАдресу(
			ДанныеАдреса.Адрес,
			ДанныеАдреса.АдресЗначение,
			Ложь);
		
	Иначе
		
		НаименованиеТочкиДоставки = ДанныеАдреса.Адрес;
		
	КонецЕсли;
	
	Возврат НаименованиеТочкиДоставки;
	
КонецФункции

// Параметры:
//  ДанныеКОбработке - см. НовыеДанныеТочекДоставки
//  ДанныеАдреса - СтрокаТаблицыЗначений из см. НовыеДанныеАдресов
//  ДанныеТочекВладельца - см. НовыеДанныеТочекДоставки
//
Процедура СменитьОсновнуюТочкуДоставки(ДанныеКОбработке, ДанныеАдреса, ДанныеТочекВладельца)
	
	ДанныеСуществующейТД = ДанныеТочкиДоставкиПоДаннымАдреса(ДанныеТочекВладельца, ДанныеАдреса);
	
	Если ДанныеСуществующейТД <> Неопределено Тогда
		
		Если ДанныеСуществующейТД.ИдентификаторПереопределен
			Или Не ПустаяСтрока(ДанныеСуществующейТД.ИдентификаторТочкиДоставки)
			Или Не ДанныеСуществующейТД.ОсновнаяТочка Тогда
			
			ДанныеИзменены = Истина;
			
		Иначе
			
			ДанныеИзменены = Не АдресаРавны(ДанныеСуществующейТД, ДанныеАдреса);
			
		КонецЕсли;
		
		Если ДанныеИзменены Тогда
			
			ДанныеСуществующейТД.ИдентификаторПереопределен = Ложь;
			ДанныеСуществующейТД.ИдентификаторТочкиДоставки = "";
			
			ЗаполнитьДанныеТочкиДоставкиДаннымиАдреса(ДанныеСуществующейТД, ДанныеАдреса, Истина);
			ДобавитьДанныеДляИзменения(ДанныеКОбработке, ДанныеСуществующейТД);
			
		КонецЕсли;
		
	Иначе
		
		ДанныеНовойТД = ДанныеКОбработке.Добавить();
		ЗаполнитьДанныеТочкиДоставкиДаннымиАдреса(ДанныеНовойТД, ДанныеАдреса, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция АдресСоответствуетОсновнойТочкеДоставки(ДанныеАдреса, ДанныеОсновнойТД)
	
	ЭтоАдресОсновнойТочки = Ложь;
	
	Если ЗначениеЗаполнено(ДанныеАдреса.Идентификатор) Тогда
		
		ЭтоАдресОсновнойТочки = (ДанныеАдреса.Идентификатор = ДанныеОсновнойТД.ИдентификаторАдреса);
		
	Иначе
		
		ЭтоАдресОсновнойТочки = (СтрСравнить(ДанныеАдреса.Адрес, ДанныеОсновнойТД.Адрес) = 0);
		
	КонецЕсли;
	
	Возврат ЭтоАдресОсновнойТочки;
	
КонецФункции

Функция КомментарийВерсииТочкиДоставки(НоваяТочка, ДанныеТочки, ПереходНаДоставку25)
	
	Доставка20 = ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20();
	
	ТекстПереход = НСтр("ru = 'Точка доставки создана при переходе на версию Доставки 2.5'");
	ТекстОсновная = НСтр("ru = 'Точка доставки записана по данным адреса владельца'");
	ТекстОсновная20 = НСтр("ru = 'Точка доставки записана по данным адреса владельца (версия Доставки 2.0)'");
	ТекстСтараяОсновная = НСтр("ru = 'Адрес владельца изменен, не соответствует текущему адресу точки доставки'");
	ТекстСтараяОсновная20 = НСтр("ru = 'Адрес владельца изменен, не соответствует текущему адресу точки доставки (версия Доставки 2.0)'");
	
	КомментарийВерсии = "";
	
	Если ПереходНаДоставку25 Тогда
		
		КомментарийВерсии = ТекстПереход;
		
	ИначеЕсли Доставка20
		И Не ДанныеТочки.НесколькоОсновныхАдресов Тогда
		
		Если НоваяТочка
			Или ДанныеТочки.ПодобранаПоИдентификатору
			Или ДанныеТочки.ПодобранаПоАдресу Тогда
			
			КомментарийВерсии = ТекстОсновная20;
			
		ИначеЕсли Не ДанныеТочки.ОсновнаяТочка Тогда
			
			КомментарийВерсии = ТекстСтараяОсновная20;
			
		КонецЕсли;
		
	ИначеЕсли Не ДанныеТочки.НесколькоОсновныхАдресов Тогда
		
		Если ДанныеТочки.ОсновнаяТочка Тогда
			
			КомментарийВерсии = ТекстОсновная;
			
		Иначе
			
			КомментарийВерсии = ТекстСтараяОсновная;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КомментарийВерсии;
	
КонецФункции

#КонецОбласти

#Область Проведение

Процедура ОтменитьПроведениеДокументаДоставки(Документ, Знач ИмяРегистра)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ, "Исправление")
	   И Документ.Исправление Тогда
		
		ЗапросПредыдущееИсправление = Новый Запрос;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ИсправленияДокументовСрезПоследних.ПоследнийДокументЦепочки <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ИсправленияДокументовСрезПоследних.ПоследнийДокументЦепочки
		|		ИНАЧЕ ИсправленияДокументовСрезПоследних.ИсправляемыйДокумент
		|	КОНЕЦ КАК ПредыдущееИсправление
		|ИЗ
		|	РегистрСведений.ИсправленияДокументов.СрезПоследних(, ИсправляемыйДокумент = &ИсправляемыйДокумент) КАК ИсправленияДокументовСрезПоследних";
		ЗапросПредыдущееИсправление.Текст = ТекстЗапроса;
		ЗапросПредыдущееИсправление.УстановитьПараметр("ИсправляемыйДокумент", Документ.ИсправляемыйДокумент);
		Выборка = ЗапросПредыдущееИсправление.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПредыдущееИсправление = Выборка.ПредыдущееИсправление; // ДокументСсылка
		Иначе
			ПредыдущееИсправление = Документ.ИсправляемыйДокумент;
		КонецЕсли;
		ПредыдущийДокумент = ПредыдущееИсправление.ПолучитьОбъект();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Доставка.Регистратор КАК Регистратор,
	|	Доставка.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	РегистрНакопления.Доставка КАК Доставка
	|ГДЕ
	|	Доставка.СторнируемыйДокументПланирования = &ДокументПланирования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Доставка.Регистратор,
	|	Доставка.НомерСтроки
	|ИЗ
	|	РегистрНакопления.Доставка КАК Доставка
	|ГДЕ
	|	Доставка.Регистратор = &ДокументПланирования";
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ, "Исправление")
	   И Документ.Исправление Тогда
		
		ТекстВыборкиДвиженияПредыдущегоДокумента =
		"ВЫБРАТЬ
		|	Доставка.Регистратор КАК Регистратор,
		|	Доставка.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрНакопления.Доставка КАК Доставка
		|ГДЕ
		|	Доставка.Регистратор = &ПредыдущееИсправление
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Доставка.Регистратор КАК Регистратор,
		|	Доставка.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрНакопления.Доставка КАК Доставка
		|ГДЕ
		|	Доставка.СторнируемыйДокументПланирования = &ПредыдущееИсправление";
		
		Запрос.УстановитьПараметр("ПредыдущееИсправление", ПредыдущееИсправление);
		
		ТекстЗапроса = ТекстЗапроса
			+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()
			+ ТекстВыборкиДвиженияПредыдущегоДокумента;
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДокументПланирования", Документ.Ссылка);
	ТаблицаУдаляемыхЗаписей = Запрос.Выполнить().Выгрузить();
	Регистраторы = ТаблицаУдаляемыхЗаписей.ВыгрузитьКолонку("Регистратор"); // Массив Из ДокументСсылка
	Регистраторы.Добавить(Документ.Ссылка);
	ЕстьДанныеВТаблице = Ложь;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ, "Исправление")
	   И Документ.Исправление Тогда
		
		// Переформировываем движения предыдущего документа цепочки исправлений.
		
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
		ДопПараметры.ДополнительныеСвойства = ПроведениеДокументов.СвойстваДокумента(Документ);
		ДопПараметры.Вставить("ПредыдущееИсправление", Документ.Ссылка);
		ТаблицыДляДвижений = ПроведениеДокументов.ДанныеДокументаДляПроведения(ПредыдущееИсправление, ИмяРегистра, ДопПараметры);
		ИмяТаблицы = "Таблица" + ИмяРегистра;
		ЕстьДанныеВТаблице = ТаблицыДляДвижений.Свойство(ИмяТаблицы);
		
		Если ЕстьДанныеВТаблице Тогда
			
			ТаблицаДанных = ТаблицыДляДвижений[ИмяТаблицы]; // ТаблицаЗначений
			
			Если ТаблицаДанных.Колонки.Найти("Регистратор") = Неопределено Тогда
				
				ТаблицаДанных.Колонки.Добавить("Регистратор");
				ТаблицаДанных.ЗаполнитьЗначения(ПредыдущееИсправление, "Регистратор");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЕстьДанныеВТаблице Тогда
			
			ТаблицаДанных = ТаблицыДляДвижений[ИмяТаблицы]; // ТаблицаЗначений
			РегистраторыАктуальныхДвижений = ТаблицаДанных.ВыгрузитьКолонку("Регистратор"); // Массив Из ДокументСсылка
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Регистраторы, РегистраторыАктуальныхДвижений, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТаблицаУдаляемыхЗаписей.Количество() > 0 Тогда
		
		НаборЗаписейУдаляемый = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
		МенеджерВТ = ПроведениеДокументов.МенеджерВременныхТаблицКонтроля(Документ);
		ПроведениеДокументов.УстановитьДопСвойстваРегистра(НаборЗаписейУдаляемый, Документ, МенеджерВТ, Истина);
		НаборЗаписейУдаляемый.ДополнительныеСвойства.Вставить("Регистраторы", Регистраторы);
		НаборЗаписейУдаляемый.ДополнительныеСвойства.Вставить("ФиксироватьИзмененияПослеЗаписи", НЕ ЕстьДанныеВТаблице);
		НаборЗаписейУдаляемый.ДополнительныеСвойства.Вставить("НеОтражатьВБюджетировании", Истина);
		НаборЗаписейУдаляемый.РасширенныеРежимыЗамещения = Истина;
		НаборЗаписейУдаляемый.Отбор.Регистратор.Установить(, Ложь);
		НаборЗаписейУдаляемый.Загрузить(ТаблицаУдаляемыхЗаписей);
		НаборЗаписейУдаляемый.Записать(РежимЗамещения.Удаление);
		
	КонецЕсли;
	
	Если ЕстьДанныеВТаблице Тогда
		
		НаборЗаписейДобавляемый = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
		МенеджерВТ = ПроведениеДокументов.МенеджерВременныхТаблицКонтроля(Документ);
		ПроведениеДокументов.УстановитьДопСвойстваРегистра(НаборЗаписейДобавляемый, Документ, МенеджерВТ, Истина);
		НаборЗаписейДобавляемый.ДополнительныеСвойства.Вставить("ФиксироватьИзмененияПослеЗаписи", Истина);
		НаборЗаписейДобавляемый.ДополнительныеСвойства.Вставить("Регистраторы", Регистраторы);
		НаборЗаписейДобавляемый.ДополнительныеСвойства.Вставить("НеОтражатьВБюджетировании", Истина);
		НаборЗаписейДобавляемый.РасширенныеРежимыЗамещения = Истина;
		НаборЗаписейДобавляемый.Отбор.Регистратор.Установить(, Ложь);
		НаборЗаписейДобавляемый.Загрузить(ТаблицаДанных);
		НаборЗаписейДобавляемый.Записать(РежимЗамещения.Добавление);
	
	КонецЕсли;
	
КонецПроцедуры

Функция ПредыдущиеУровниОперации(ТекущийУровеньОперации)
	
	Результат = Новый Массив; // Массив Из Число
	
	Если ТекущийУровеньОперации = 20 Тогда
		
		Результат.Добавить(10);
		
	КонецЕсли;
	
	Если ТекущийУровеньОперации = 30 Тогда
		
		Результат.Добавить(20);
		Результат.Добавить(15);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СледующиеУровниОперации(ТекущийУровеньОперации, ЕстьСтрокиТоваровИзменениеТолькоУпаковки = Ложь)
	
	Результат = Новый Массив; // Массив Из Число
	
	Если ТекущийУровеньОперации = 10 Тогда
		
		Результат.Добавить(20);
		
	КонецЕсли;
	
	Если ТекущийУровеньОперации = 15 Тогда
		
		Результат.Добавить(30);
		
	КонецЕсли;
	
	Если ТекущийУровеньОперации = 20
	   И ЕстьСтрокиТоваровИзменениеТолькоУпаковки Тогда
		
		Результат.Добавить(30);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПодставитьСинонимТаблицыДокумента(ТекстЗапроса, СинонимТаблицыДокумента)
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаДанных", "#" + СинонимТаблицыДокумента);
	
КонецПроцедуры

Процедура ПодставитьДополнительныеПоляВШаблоны(ТекстыШаблонов, ДополнительныеПоля)
	
	Для Индекс = 0 По ТекстыШаблонов.ВГраница() Цикл
		
		ТекстыШаблонов[Индекс] = СтрЗаменить(ТекстыШаблонов[Индекс], "&ДополнительныеПоля", ДополнительныеПоля);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ШаблонЗапросаВТТекущийУровень()
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	ЛОЖЬ КАК ДополненнаяСтрока,
	|	&Ссылка КАК Регистратор,
	|	ВЫРАЗИТЬ(ТаблицаДанных.НомерСтроки КАК ЧИСЛО(15, 0)) КАК НомерСтроки,
	|	ТаблицаДанных.Период КАК Период,
	|	ТаблицаДанных.Организация КАК Организация,
	|	ТаблицаДанных.ТипДоставки КАК ТипДоставки,
	|	ТаблицаДанных.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ТаблицаДанных.СпособДоставки КАК СпособДоставки,
	|	ТаблицаДанных.Отправитель КАК Отправитель,
	|	ТаблицаДанных.ТочкаОтправителя КАК ТочкаОтправителя,
	|	ТаблицаДанных.ЗонаОтправителя КАК ЗонаОтправителя,
	|	ТаблицаДанных.Получатель КАК Получатель,
	|	ТаблицаДанных.ТочкаПолучателя КАК ТочкаПолучателя,
	|	ТаблицаДанных.ЗонаПолучателя КАК ЗонаПолучателя,
	|	ТаблицаДанных.Распоряжение КАК Распоряжение,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.Характеристика КАК Характеристика,
	|	ТаблицаДанных.Серия КАК Серия,
	|	ТаблицаДанных.КодСтроки КАК КодСтроки,
	|	ВЫРАЗИТЬ(ТаблицаДанных.Плечо КАК ЧИСЛО(2, 0)) КАК Плечо,
	|	ТаблицаДанных.Перевозчик КАК Перевозчик,
	|	ТаблицаДанных.Упаковка КАК Упаковка,
	|	&УровеньОперации КАК УровеньОперации,
	|	&ВыражениеДокументПланирования КАК ДокументПланирования,
	|	ТаблицаДанных.ЭтоКонечноеПлечо КАК ЭтоКонечноеПлечо,
	|	ВЫРАЗИТЬ(ТаблицаДанных.НомерМинимальногоПлеча КАК ЧИСЛО(2, 0)) КАК НомерМинимальногоПлеча,
	|	&ВыражениеКоличество КАК Количество
	|ПОМЕСТИТЬ ТаблицаНазначение
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных";
	
	Возврат ШаблонЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТТекущийУровеньТ2()
	
	ТекстЗапроса = ШаблонЗапросаВТТекущийУровень();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТТекущийУровеньТ2");
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеДокументПланирования",
		"ВЫБОР
		|		КОГДА &УровеньОперации = 20
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаДанных.ДокументПланирования
		|	КОНЕЦ");
		
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеКоличество",
		"ВЫБОР
		|		КОГДА &УровеньОперации = 10
		|				ИЛИ &УровеньОперации = 15
		|			ТОГДА ТаблицаДанных.КДоставке
		|		КОГДА &УровеньОперации = 20
		|			ТОГДА ТаблицаДанных.КРейсу
		|		КОГДА &УровеньОперации = 30
		|			ТОГДА ТаблицаДанных.ВРейсе
		|		ИНАЧЕ 0
		|	КОНЕЦ");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТОтборДоставкиПредыдущегоУровня()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДанных.Распоряжение КАК Распоряжение,
	|	ТаблицаДанных.КодСтроки КАК КодСтроки,
	|	ВЫБОР
	|		КОГДА &УровеньОперации = 20
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаДанных.ДокументПланирования
	|	КОНЕЦ КАК ДокументПланирования
	|ПОМЕСТИТЬ ВТОтборДоставкиПредыдущегоУровня
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТПредыдущийУровеньТ1()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЛОЖЬ КАК ДополненнаяСтрока,
	|	Доставка.Регистратор КАК Регистратор,
	|	ВЫРАЗИТЬ(Доставка.НомерСтроки КАК ЧИСЛО(15, 0)) КАК НомерСтроки,
	|	Доставка.Период КАК Период,
	|	Доставка.Организация КАК Организация,
	|	Доставка.ТипДоставки КАК ТипДоставки,
	|	Доставка.ДатаОтгрузки КАК ДатаОтгрузки,
	|	Доставка.СпособДоставки КАК СпособДоставки,
	|	Доставка.Отправитель КАК Отправитель,
	|	Доставка.ТочкаОтправителя КАК ТочкаОтправителя,
	|	Доставка.ЗонаОтправителя КАК ЗонаОтправителя,
	|	Доставка.Получатель КАК Получатель,
	|	Доставка.ТочкаПолучателя КАК ТочкаПолучателя,
	|	Доставка.ЗонаПолучателя КАК ЗонаПолучателя,
	|	Доставка.Распоряжение КАК Распоряжение,
	|	Доставка.Номенклатура КАК Номенклатура,
	|	Доставка.Характеристика КАК Характеристика,
	|	Доставка.Серия КАК Серия,
	|	Доставка.КодСтроки КАК КодСтроки,
	|	ВЫРАЗИТЬ(Доставка.Плечо КАК ЧИСЛО(2, 0)) КАК Плечо,
	|	Доставка.Перевозчик КАК Перевозчик,
	|	Доставка.Упаковка КАК Упаковка,
	|	Доставка.УровеньОперации КАК УровеньОперации,
	|	ВЫБОР
	|		КОГДА &УровеньОперации = 20
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Доставка.ДокументПланирования
	|	КОНЕЦ КАК ДокументПланирования,
	|	Доставка.ЭтоКонечноеПлечо КАК ЭтоКонечноеПлечо,
	|	ВЫРАЗИТЬ(Доставка.НомерМинимальногоПлеча КАК ЧИСЛО(2, 0)) КАК НомерМинимальногоПлеча,
	|	0 КАК Количество
	|ПОМЕСТИТЬ ВТПредыдущийУровеньТ1
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВТОтборДоставкиПредыдущегоУровня.Распоряжение КАК Распоряжение
	|	ИЗ
	|		ВТОтборДоставкиПредыдущегоУровня КАК ВТОтборДоставкиПредыдущегоУровня) КАК ОтборРаспоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК Доставка
	|		ПО ОтборРаспоряжения.Распоряжение = Доставка.Распоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборДоставкиПредыдущегоУровня КАК ВТОтборДоставкиПредыдущегоУровня
	|		ПО (ВТОтборДоставкиПредыдущегоУровня.Распоряжение = Доставка.Распоряжение)
	|			И (ВТОтборДоставкиПредыдущегоУровня.КодСтроки = Доставка.КодСтроки)
	|			И (ВЫБОР
	|				КОГДА &УровеньОперации = 30
	|					ТОГДА ВТОтборДоставкиПредыдущегоУровня.ДокументПланирования = Доставка.ДокументПланирования
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (Доставка.УровеньОперации В (&ПредыдущиеУровниОперации))
	|ГДЕ
	|	&УровеньОперации > 15
	|	И Доставка.СторнируемыйДокументПланирования <> &Ссылка
	|	И Доставка.СторнируемыйДокументПланирования <> &ПредыдущееИсправление
	|	И НЕ 1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			1
	|		ИЗ
	|			РегистрСведений.ИсправленияДокументов КАК ИсправленияДокументов
	|		ГДЕ
	|			ИсправленияДокументов.ИсправляемыйДокумент = Доставка.Регистратор
	|			ИЛИ ИсправленияДокументов.ПредыдущееИсправление = Доставка.Регистратор)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТПлечиПредыдущегоУровняТ1()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПредыдущийУровеньТ1.Распоряжение КАК Распоряжение,
	|	ВТПредыдущийУровеньТ1.КодСтроки КАК КодСтроки,
	|	ВТПредыдущийУровеньТ1.ДокументПланирования КАК ДокументПланирования,
	|	ВТПредыдущийУровеньТ1.Плечо КАК Плечо
	|ПОМЕСТИТЬ ВТПлечиПредыдущегоУровняТ1
	|ИЗ
	|	ВТПредыдущийУровеньТ1 КАК ВТПредыдущийУровеньТ1
	|ГДЕ
	|	&УровеньОперации > 15";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ШаблонЗапросаВТКлючевыеПоля()
	
	ШаблонЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т2.ТипДоставки КАК ТипДоставки,
	|	Т2.Регистратор КАК Регистратор,
	|	Т2.Период КАК Период,
	|	Т2.Распоряжение КАК Распоряжение,
	|	Т2.КодСтроки КАК КодСтроки,
	|	Т2.Номенклатура КАК Номенклатура,
	|	Т2.Характеристика КАК Характеристика,
	|	Т2.Серия КАК Серия,
	|	Т2.Организация КАК Организация,
	|	Т2.ДокументПланирования КАК ДокументПланирования,
	|	Т2.Количество КАК Количество,
	|	Т2.УровеньОперации КАК УровеньОперации
	|ПОМЕСТИТЬ ТаблицаНазначение
	|ИЗ
	|	&ТаблицаИсточник КАК Т2
	|ГДЕ
	|	&ВыражениеОтбор";
	
	Возврат ШаблонЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТКлючевыеПоляТекущегоУровняТ2()
	
	ТекстЗапроса = ШаблонЗапросаВТКлючевыеПоля();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточник", "ВТТекущийУровеньТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТКлючевыеПоляТекущегоУровняТ2");
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации > 15");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ШаблонЗапросаНедостающиеПлечиТ2()
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	КлючевыеПоляТ2.Период КАК Период,
	|	КлючевыеПоляТ2.ТипДоставки КАК ТипДоставки,
	|	КлючевыеПоляТ2.Распоряжение КАК Распоряжение,
	|	КлючевыеПоляТ2.КодСтроки КАК КодСтроки,
	|	КлючевыеПоляТ2.Номенклатура КАК Номенклатура,
	|	КлючевыеПоляТ2.Характеристика КАК Характеристика,
	|	КлючевыеПоляТ2.Серия КАК Серия,
	|	КлючевыеПоляТ2.Организация КАК Организация,
	|	КлючевыеПоляТ2.ДокументПланирования КАК ДокументПланирования,
	|	КлючевыеПоляТ2.Регистратор КАК Регистратор,
	|	КлючевыеПоляТ2.Количество КАК Количество,
	|	КлючевыеПоляТ2.УровеньОперации КАК УровеньОперации,
	|	ПлечиТ1.Плечо КАК Плечо
	|ПОМЕСТИТЬ ТаблицаНазначение
	|ИЗ
	|	&ТаблицаИсточникТ2 КАК КлючевыеПоляТ2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ &ТаблицаИсточникТ1 КАК ПлечиТ1
	|		ПО КлючевыеПоляТ2.Распоряжение = ПлечиТ1.Распоряжение
	|			И КлючевыеПоляТ2.КодСтроки = ПлечиТ1.КодСтроки
	|			И КлючевыеПоляТ2.ДокументПланирования = ПлечиТ1.ДокументПланирования
	|ГДЕ
	|	&ВыражениеОтбор";
	
	Возврат ШаблонЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТНедостающиеПлечиТекущегоУровняТ2()
	
	ТекстЗапроса = ШаблонЗапросаНедостающиеПлечиТ2();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ1", "ВТПлечиПредыдущегоУровняТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ2", "ВТКлючевыеПоляТекущегоУровняТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТНедостающиеПлечиТекущегоУровняТ2");
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации > 15");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ШаблонЗапросаДополнениеПлечТ2()
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	ИСТИНА КАК ДополненнаяСтрока,
	|	Т2.Регистратор КАК Регистратор,
	|	0 КАК НомерСтроки,
	|	Т2.Период КАК Период,
	|	Т2.Организация КАК Организация,
	|	Т2.ТипДоставки КАК ТипДоставки,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыДоставки25.ПустаяСсылка) КАК СпособДоставки,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК Отправитель,
	|	ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка) КАК ТочкаОтправителя,
	|	ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяСсылка) КАК ЗонаОтправителя,
	|	ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) КАК Получатель,
	|	ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка) КАК ТочкаПолучателя,
	|	ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяСсылка) КАК ЗонаПолучателя,
	|	Т2.Распоряжение КАК Распоряжение,
	|	Т2.Номенклатура КАК Номенклатура,
	|	Т2.Характеристика КАК Характеристика,
	|	Т2.Серия КАК Серия,
	|	Т2.КодСтроки КАК КодСтроки,
	|	ПлечиТ1.Плечо КАК Плечо,
	|	ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) КАК Перевозчик,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
	|	Т2.УровеньОперации КАК УровеньОперации,
	|	Т2.ДокументПланирования КАК ДокументПланирования,
	|	ЛОЖЬ КАК ЭтоКонечноеПлечо,
	|	0 КАК НомерМинимальногоПлеча,
	|	Т2.Количество КАК Количество
	|ДОБАВИТЬ ТаблицаНазначение
	|ИЗ
	|	&ТаблицаИсточникТ2 КАК Т2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ &ТаблицаНедостающиеПлечиТ2 КАК ПлечиТ1
	|		ПО Т2.Распоряжение = ПлечиТ1.Распоряжение
	|			И Т2.КодСтроки = ПлечиТ1.КодСтроки
	|			И Т2.ДокументПланирования = ПлечиТ1.ДокументПланирования
	|			И Т2.Плечо < ПлечиТ1.Плечо
	|			И Т2.ЭтоКонечноеПлечо
	|ГДЕ
	|	&ВыражениеОтбор";
	
	Возврат ШаблонЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТТекущийУровеньТ2_ДополнениеПлеч()
	
	ТекстЗапроса = ШаблонЗапросаДополнениеПлечТ2();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ2", "ВТТекущийУровеньТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаНедостающиеПлечиТ2", "ВТПлечиПредыдущегоУровняТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДОБАВИТЬ ТаблицаНазначение", "ДОБАВИТЬ ВТТекущийУровеньТ2"); // @Query-part-1, @Query-part-2
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации > 15");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТПлечиТекущегоУровняТ2()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТекущийУровеньТ2.Распоряжение КАК Распоряжение,
	|	ВТТекущийУровеньТ2.КодСтроки КАК КодСтроки,
	|	ВТТекущийУровеньТ2.ДокументПланирования КАК ДокументПланирования,
	|	ВТТекущийУровеньТ2.Плечо КАК Плечо
	|ПОМЕСТИТЬ ВТПлечиТекущегоУровняТ2
	|ИЗ
	|	ВТТекущийУровеньТ2 КАК ВТТекущийУровеньТ2
	|ГДЕ
	|	&УровеньОперации > 15";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТКлючевыеПоляПредыдущегоУровняТ1()
	
	ТекстЗапроса = ШаблонЗапросаВТКлючевыеПоля();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточник", "ВТПредыдущийУровеньТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТКлючевыеПоляПредыдущегоУровняТ1");
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации > 15");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТНедостающиеПлечиПредыдущегоУровняТ1()
	
	ТекстЗапроса = ШаблонЗапросаНедостающиеПлечиТ2();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ1", "ВТПлечиТекущегоУровняТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ2", "ВТКлючевыеПоляПредыдущегоУровняТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТНедостающиеПлечиПредыдущегоУровняТ1");
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации > 15");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТПредыдущийУровеньТ1_ДополнениеПлеч()
	
	ТекстЗапроса = ШаблонЗапросаДополнениеПлечТ2();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ2", "ВТПредыдущийУровеньТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаНедостающиеПлечиТ2", "ВТПлечиТекущегоУровняТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДОБАВИТЬ ТаблицаНазначение", "ДОБАВИТЬ ВТПредыдущийУровеньТ1"); // @Query-part-1, @Query-part-2 
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации > 15");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ШаблонЗапросаКонтрольИзмененияПолей()
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	КонтрольПолей.Распоряжение КАК Распоряжение,
	|	КонтрольПолей.КодСтроки КАК КодСтроки,
	|	КонтрольПолей.ДокументПланирования КАК ДокументПланирования,
	|	КонтрольПолей.РегистраторТ1 КАК РегистраторТ1,
	|	КонтрольПолей.РегистраторТ2 КАК РегистраторТ2,
	|	МАКСИМУМ(КонтрольПолей.ИзменилсяКонечныйПолучатель) КАК ИзменилсяКонечныйПолучатель,
	|	МАКСИМУМ(КонтрольПолей.ИзменилсяНачальныйОтправитель) КАК ИзменилсяНачальныйОтправитель
	|ПОМЕСТИТЬ ТаблицаНазначение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т1.Распоряжение КАК Распоряжение,
	|		Т1.КодСтроки КАК КодСтроки,
	|		Т1.ДокументПланирования КАК ДокументПланирования,
	|		Т1.Регистратор КАК РегистраторТ1,
	|		Т2.Регистратор КАК РегистраторТ2,
	|		(Т1.Получатель <> Т2.Получатель) КАК ИзменилсяКонечныйПолучатель,
	|		ЛОЖЬ КАК ИзменилсяНачальныйОтправитель
	|	ИЗ
	|		&ТаблицаИсточникТ1 КАК Т1
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ &ТаблицаИсточникТ2 КАК Т2
	|			ПО Т1.Распоряжение = Т2.Распоряжение
	|				И Т1.КодСтроки = Т2.КодСтроки
	|				И Т1.ДокументПланирования = Т2.ДокументПланирования
	|				И Т1.ЭтоКонечноеПлечо
	|				И Т2.ЭтоКонечноеПлечо
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т2.Распоряжение КАК Распоряжение,
	|		Т2.КодСтроки КАК КодСтроки,
	|		Т2.ДокументПланирования КАК ДокументПланирования,
	|		Т1.Регистратор КАК РегистраторТ1,
	|		Т2.Регистратор КАК РегистраторТ2,
	|		ЛОЖЬ КАК ИзменилсяКонечныйПолучатель,
	|		(Т1.Отправитель <> Т2.Отправитель) КАК ИзменилсяНачальныйОтправитель
	|	ИЗ
	|		&ТаблицаИсточникТ2 КАК Т2
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ &ТаблицаИсточникТ1 КАК Т1
	|			ПО Т2.Распоряжение = Т1.Распоряжение
	|				И Т2.КодСтроки = Т1.КодСтроки
	|				И Т2.ДокументПланирования = Т1.ДокументПланирования
	|				И Т2.НомерМинимальногоПлеча > 0
	|				И Т2.НомерМинимальногоПлеча = Т1.Плечо) КАК КонтрольПолей
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтрольПолей.Распоряжение,
	|	КонтрольПолей.КодСтроки,
	|	КонтрольПолей.ДокументПланирования,
	|	КонтрольПолей.РегистраторТ1,
	|	КонтрольПолей.РегистраторТ2";
	
	Возврат ШаблонЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТКонтрольИзмененияПолейТекущегоУровня()
	
	ТекстЗапроса = ШаблонЗапросаКонтрольИзмененияПолей();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ1", "ВТПредыдущийУровеньТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ2", "ВТТекущийУровеньТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТКонтрольИзмененияПолейТекущегоУровня");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ШаблонЗапросаСравненияУровней()
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Т1.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипыДоставки.ПустаяСсылка)
	|			ТОГДА Т2.ТипДоставки
	|		ИНАЧЕ Т1.ТипДоставки
	|	КОНЕЦ КАК ТипДоставки,
	|	ВЫБОР
	|		КОГДА Т1.Распоряжение = НЕОПРЕДЕЛЕНО
	|			ТОГДА Т2.Распоряжение
	|		ИНАЧЕ Т1.Распоряжение
	|	КОНЕЦ КАК Распоряжение,
	|	ВЫБОР
	|		КОГДА Т1.КодСтроки = 0
	|			ТОГДА Т2.КодСтроки
	|		ИНАЧЕ Т1.КодСтроки
	|	КОНЕЦ КАК КодСтроки,
	|	ВЫБОР
	|		КОГДА Т1.Плечо = 0
	|			ТОГДА Т2.Плечо
	|		ИНАЧЕ Т1.Плечо
	|	КОНЕЦ КАК Плечо,
	|	
	|	Т2.Распоряжение КАК РаспоряжениеТ2,
	|	Т2.ДокументПланирования КАК ДокументПланированияТ2,
	|	Т2.Организация КАК ОрганизацияТ2,
	|	Т2.Регистратор КАК РегистраторТ2,
	|	Т2.НомерСтроки КАК НомерСтрокиТ2,
	|	Т2.Период КАК ПериодТ2,
	|	Т2.Количество КАК КоличествоТ2,
	|	Т2.УровеньОперации КАК УровеньОперацииТ2,
	|	Т2.ДатаОтгрузки КАК ДатаОтгрузкиТ2,
	|	Т2.СпособДоставки КАК СпособДоставкиТ2,
	|	Т2.Отправитель КАК ОтправительТ2,
	|	Т2.ТочкаОтправителя КАК ТочкаОтправителяТ2,
	|	Т2.ЗонаОтправителя КАК ЗонаОтправителяТ2,
	|	Т2.Получатель КАК ПолучательТ2,
	|	Т2.ТочкаПолучателя КАК ТочкаПолучателяТ2,
	|	Т2.ЗонаПолучателя КАК ЗонаПолучателяТ2,
	|	Т2.Номенклатура КАК НоменклатураТ2,
	|	Т2.Характеристика КАК ХарактеристикаТ2,
	|	Т2.Серия КАК СерияТ2,
	|	Т2.Перевозчик КАК ПеревозчикТ2,
	|	Т2.ДополненнаяСтрока КАК ДополненнаяСтрокаТ2,
	|	Т2.ЭтоКонечноеПлечо КАК ЭтоКонечноеПлечоТ2,
	|	Т2.НомерМинимальногоПлеча КАК НомерМинимальногоПлечаТ2,
	|	Т2.Упаковка КАК УпаковкаТ2,
	|	
	|	Т1.Распоряжение КАК РаспоряжениеТ1,
	|	Т1.ДокументПланирования КАК ДокументПланированияТ1,
	|	Т1.Организация КАК ОрганизацияТ1,
	|	Т1.Регистратор КАК РегистраторТ1,
	|	Т1.НомерСтроки КАК НомерСтрокиТ1,
	|	Т1.Период КАК ПериодТ1,
	|	Т1.Количество КАК КоличествоТ1,
	|	Т1.УровеньОперации КАК УровеньОперацииТ1,
	|	Т1.ДатаОтгрузки КАК ДатаОтгрузкиТ1,
	|	Т1.СпособДоставки КАК СпособДоставкиТ1,
	|	Т1.Отправитель КАК ОтправительТ1,
	|	Т1.ТочкаОтправителя КАК ТочкаОтправителяТ1,
	|	Т1.ЗонаОтправителя КАК ЗонаОтправителяТ1,
	|	Т1.Получатель КАК ПолучательТ1,
	|	Т1.ТочкаПолучателя КАК ТочкаПолучателяТ1,
	|	Т1.ЗонаПолучателя КАК ЗонаПолучателяТ1,
	|	Т1.Номенклатура КАК НоменклатураТ1,
	|	Т1.Характеристика КАК ХарактеристикаТ1,
	|	Т1.Серия КАК СерияТ1,
	|	Т1.Перевозчик КАК ПеревозчикТ1,
	|	Т1.ДополненнаяСтрока КАК ДополненнаяСтрокаТ1,
	|	Т1.ЭтоКонечноеПлечо КАК ЭтоКонечноеПлечоТ1,
	|	Т1.НомерМинимальногоПлеча КАК НомерМинимальногоПлечаТ1,
	|	Т1.Упаковка КАК УпаковкаТ1,
	|	
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтрольИзмененияПолей.ИзменилсяНачальныйОтправитель, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(КонтрольИзмененияПолей.ИзменилсяКонечныйПолучатель, ЛОЖЬ)
	|			ТОГДА 0
	|		КОГДА (Т1.Организация <> Т2.Организация
	|				ИЛИ Т1.Номенклатура <> Т2.Номенклатура
	|				ИЛИ Т1.Характеристика <> Т2.Характеристика
	|				ИЛИ Т1.Серия <> Т2.Серия)
	|			ТОГДА 0
	|		КОГДА Т1.ДатаОтгрузки = Т2.ДатаОтгрузки
	|				И Т1.СпособДоставки = Т2.СпособДоставки
	|				И Т1.Отправитель = Т2.Отправитель
	|				И Т1.ТочкаОтправителя = Т2.ТочкаОтправителя
	|				И Т1.ЗонаОтправителя = Т2.ЗонаОтправителя
	|				И Т1.Получатель = Т2.Получатель
	|				И Т1.ТочкаПолучателя = Т2.ТочкаПолучателя
	|				И Т1.ЗонаПолучателя = Т2.ЗонаПолучателя
	|				И Т1.Перевозчик = Т2.Перевозчик
	|				И Т1.Упаковка = Т2.Упаковка
	|			ТОГДА 0
	|		ИНАЧЕ Т2.Количество
	|	КОНЕЦ КАК Разница
	|ПОМЕСТИТЬ ТаблицаНазначение
	|ИЗ
	|	&ТаблицаИсточникТ2 КАК Т2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ &ТаблицаИсточникТ1 КАК Т1
	|		ПО Т2.Распоряжение = Т1.Распоряжение
	|			И Т2.КодСтроки = Т1.КодСтроки
	|			И Т2.ДокументПланирования = Т1.ДокументПланирования
	|			И Т2.Плечо = Т1.Плечо
	|		ЛЕВОЕ СОЕДИНЕНИЕ &ТаблицаКонтрольИзмененияПолей КАК КонтрольИзмененияПолей
	|		ПО Т2.Распоряжение = КонтрольИзмененияПолей.Распоряжение
	|			И Т2.КодСтроки = КонтрольИзмененияПолей.КодСтроки
	|			И Т2.ДокументПланирования = КонтрольИзмененияПолей.ДокументПланирования
	|			И Т2.Регистратор = КонтрольИзмененияПолей.РегистраторТ2
	|			И Т1.Регистратор = КонтрольИзмененияПолей.РегистраторТ1
	|ГДЕ
	|	&ВыражениеОтбор";
	
	Возврат ШаблонЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТСравнениеТекущегоУровняСПредыдущим()
	
	ТекстЗапроса = ШаблонЗапросаСравненияУровней();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ1", "ВТПредыдущийУровеньТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ2", "ВТТекущийУровеньТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаКонтрольИзмененияПолей", "ВТКонтрольИзмененияПолейТекущегоУровня");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТСравнениеТекущегоУровняСПредыдущим");
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации > 15");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТТекущийУровеньТ1()
	
	ТекстЗапроса = ШаблонЗапросаВТТекущийУровень();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТТекущийУровеньТ1");
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеДокументПланирования",
		"ВЫБОР
		|		КОГДА &УровеньОперации = 10
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаДанных.ДокументПланирования
		|	КОНЕЦ");
		
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеКоличество",
		"ВЫБОР
		|		КОГДА &УровеньОперации = 10
		|				ИЛИ &УровеньОперации = 15
		|			ТОГДА ТаблицаДанных.КДоставке
		|		КОГДА &УровеньОперации = 20
		|			ТОГДА ТаблицаДанных.КРейсу
		|		КОГДА &УровеньОперации = 30
		|			ТОГДА ТаблицаДанных.ВРейсе
		|		ИНАЧЕ 0
		|	КОНЕЦ");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТСтрокиТоваровИзменениеТолькоУпаковки()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СтрокиТоваровИзменениеТолькоУпаковки.Распоряжение КАК Распоряжение,
	|	СтрокиТоваровИзменениеТолькоУпаковки.КодСтрокиДоставки КАК КодСтрокиДоставки
	|ПОМЕСТИТЬ ВТСтрокиТоваровИзменениеТолькоУпаковки
	|ИЗ
	|	&СтрокиТоваровИзменениеТолькоУпаковки КАК СтрокиТоваровИзменениеТолькоУпаковки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТОтборДоставкиСледующегоУровня(ЕстьСтрокиТоваровИзменениеТолькоУпаковки = Ложь)
	
	Если ЕстьСтрокиТоваровИзменениеТолькоУпаковки Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДанных.Распоряжение КАК Распоряжение,
		|	ТаблицаДанных.КодСтроки КАК КодСтроки,
		|	ВЫБОР
		|		КОГДА &УровеньОперации = 15
		|				ИЛИ &УровеньОперации = 20
		|			ТОГДА ТаблицаДанных.ДокументПланирования
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ДокументПланирования
		|ПОМЕСТИТЬ ВТОтборДоставкиСледующегоУровня
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтрокиТоваровИзменениеТолькоУпаковки КАК СтрокиТоваровИзменениеТолькоУпаковки
		|		ПО ТаблицаДанных.Распоряжение = СтрокиТоваровИзменениеТолькоУпаковки.Распоряжение
		|			И ТаблицаДанных.КодСтроки = СтрокиТоваровИзменениеТолькоУпаковки.КодСтрокиДоставки";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДанных.Распоряжение КАК Распоряжение,
		|	ТаблицаДанных.КодСтроки КАК КодСтроки,
		|	ВЫБОР
		|		КОГДА &УровеньОперации = 15
		|				ИЛИ &УровеньОперации = 20
		|			ТОГДА ТаблицаДанных.ДокументПланирования
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ДокументПланирования
		|ПОМЕСТИТЬ ВТОтборДоставкиСледующегоУровня
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТСледующийУровеньТ2()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЛОЖЬ КАК ДополненнаяСтрока,
	|	Доставка.Регистратор КАК Регистратор,
	|	ВЫРАЗИТЬ(Доставка.НомерСтроки КАК ЧИСЛО(15, 0)) КАК НомерСтроки,
	|	Доставка.Период КАК Период,
	|	Доставка.Организация КАК Организация,
	|	Доставка.ТипДоставки КАК ТипДоставки,
	|	Доставка.ДатаОтгрузки КАК ДатаОтгрузки,
	|	Доставка.СпособДоставки КАК СпособДоставки,
	|	Доставка.Отправитель КАК Отправитель,
	|	Доставка.ТочкаОтправителя КАК ТочкаОтправителя,
	|	Доставка.ЗонаОтправителя КАК ЗонаОтправителя,
	|	Доставка.Получатель КАК Получатель,
	|	Доставка.ТочкаПолучателя КАК ТочкаПолучателя,
	|	Доставка.ЗонаПолучателя КАК ЗонаПолучателя,
	|	Доставка.Распоряжение КАК Распоряжение,
	|	Доставка.Номенклатура КАК Номенклатура,
	|	Доставка.Характеристика КАК Характеристика,
	|	Доставка.Серия КАК Серия,
	|	Доставка.КодСтроки КАК КодСтроки,
	|	ВЫРАЗИТЬ(Доставка.Плечо КАК ЧИСЛО(2,0)) КАК Плечо,
	|	Доставка.Перевозчик КАК Перевозчик,
	|	Доставка.Упаковка КАК Упаковка,
	|	Доставка.УровеньОперации КАК УровеньОперации,
	|	ВЫБОР
	|		КОГДА &УровеньОперации = 15
	|				ИЛИ &УровеньОперации = 20
	|			ТОГДА Доставка.ДокументПланирования
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДокументПланирования,
	|	Доставка.ЭтоКонечноеПлечо КАК ЭтоКонечноеПлечо,
	|	ВЫРАЗИТЬ(Доставка.НомерМинимальногоПлеча КАК ЧИСЛО(2,0)) КАК НомерМинимальногоПлеча,
	|	ВЫБОР
	|		КОГДА Доставка.УровеньОперации = 15
	|				ИЛИ Доставка.УровеньОперации = 20
	|			ТОГДА Доставка.КРейсу
	|		КОГДА Доставка.УровеньОперации = 30
	|			ТОГДА Доставка.ВРейсе
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ВТСледующийУровеньТ2
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВТОтборДоставкиСледующегоУровня.Распоряжение КАК Распоряжение
	|	ИЗ
	|		ВТОтборДоставкиСледующегоУровня КАК ВТОтборДоставкиСледующегоУровня) КАК ОтборРаспоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК Доставка
	|		ПО ОтборРаспоряжения.Распоряжение = Доставка.Распоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборДоставкиСледующегоУровня КАК ВТОтборДоставкиСледующегоУровня
	|		ПО ВТОтборДоставкиСледующегоУровня.Распоряжение = Доставка.Распоряжение
	|			И ВТОтборДоставкиСледующегоУровня.КодСтроки = Доставка.КодСтроки
	|			И ВЫБОР
	|				КОГДА &УровеньОперации = 15
	|						ИЛИ &УровеньОперации = 20
	|					ТОГДА ВТОтборДоставкиСледующегоУровня.ДокументПланирования = Доставка.ДокументПланирования
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|			И Доставка.УровеньОперации В (&СледующиеУровниОперации)
	|ГДЕ
	|	&УровеньОперации < 30
	|	И (НЕ &ЭтоНовый ИЛИ &Исправление)
	|	И Доставка.СторнируемыйДокументПланирования <> &Ссылка
	|	И Доставка.СторнируемыйДокументПланирования <> &ПредыдущееИсправление";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТПлечиТекущегоУровняТ1()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т1.Распоряжение КАК Распоряжение,
	|	Т1.КодСтроки КАК КодСтроки,
	|	Т1.ДокументПланирования КАК ДокументПланирования,
	|	Т1.Плечо КАК Плечо
	|ПОМЕСТИТЬ ВТПлечиТекущегоУровняТ1
	|ИЗ
	|	ВТТекущийУровеньТ1 КАК Т1
	|ГДЕ
	|	&УровеньОперации < 30
	|	И (НЕ &ЭтоНовый ИЛИ &Исправление)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТКлючевыеПоляСледующегоУровняТ2()
	
	ТекстЗапроса = ШаблонЗапросаВТКлючевыеПоля();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточник", "ВТСледующийУровеньТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТКлючевыеПоляСледующегоУровняТ2");
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации < 30
		|	И (НЕ &ЭтоНовый ИЛИ &Исправление)");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТНедостающиеПлечиСледующегоУровняТ2()
	
	ТекстЗапроса = ШаблонЗапросаНедостающиеПлечиТ2();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ1", "ВТПлечиТекущегоУровняТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ2", "ВТКлючевыеПоляСледующегоУровняТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТНедостающиеПлечиСледующегоУровняТ2");
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации < 30
		|	И (НЕ &ЭтоНовый ИЛИ &Исправление)");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТСледующийУровеньТ2_ДополнениеПлеч()
	
	ТекстЗапроса = ШаблонЗапросаДополнениеПлечТ2();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ2", "ВТСледующийУровеньТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаНедостающиеПлечиТ2", "ВТПлечиТекущегоУровняТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДОБАВИТЬ ТаблицаНазначение", "ДОБАВИТЬ ВТСледующийУровеньТ2"); // @Query-part-1, @Query-part-2
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации < 30
		|	И (НЕ &ЭтоНовый ИЛИ &Исправление)");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТКонтрольИзмененияПолейСледующегоУровня()
	
	ТекстЗапроса = ШаблонЗапросаКонтрольИзмененияПолей();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ1", "ВТТекущийУровеньТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ2", "ВТСледующийУровеньТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТКонтрольИзмененияПолейСледующегоУровня");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТСравнениеТекущегоУровняСоСледующим()
	
	ТекстЗапроса = ШаблонЗапросаСравненияУровней();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ1", "ВТТекущийУровеньТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ2", "ВТСледующийУровеньТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаКонтрольИзмененияПолей", "ВТКонтрольИзмененияПолейСледующегоУровня");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТСравнениеТекущегоУровняСоСледующим");
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации < 30
		|	И (НЕ &ЭтоНовый ИЛИ &Исправление)");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТПлечиСледующегоУровняТ2()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т2.Распоряжение КАК Распоряжение,
	|	Т2.КодСтроки КАК КодСтроки,
	|	Т2.ДокументПланирования КАК ДокументПланирования,
	|	Т2.Плечо КАК Плечо
	|ПОМЕСТИТЬ ВТПлечиСледующегоУровняТ2
	|ИЗ
	|	ВТСледующийУровеньТ2 КАК Т2
	|ГДЕ
	|	&УровеньОперации < 30
	|	И (НЕ &ЭтоНовый ИЛИ &Исправление)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТКлючевыеПоляТекущегоУровняТ1()
	
	ТекстЗапроса = ШаблонЗапросаВТКлючевыеПоля();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточник", "ВТТекущийУровеньТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТКлючевыеПоляТекущегоУровняТ1");
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации < 30
		|	И (НЕ &ЭтоНовый ИЛИ &Исправление)");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТНедостающиеПлечиТекущегоУровняТ1()
	
	ТекстЗапроса = ШаблонЗапросаНедостающиеПлечиТ2();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ1", "ВТПлечиСледующегоУровняТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ2", "ВТКлючевыеПоляТекущегоУровняТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаНазначение", "ПОМЕСТИТЬ ВТНедостающиеПлечиТекущегоУровняТ1");
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации < 30
		|	И (НЕ &ЭтоНовый ИЛИ &Исправление)");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТТекущийУровеньТ1_ДополнениеПлеч()
	
	ТекстЗапроса = ШаблонЗапросаДополнениеПлечТ2();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаИсточникТ2", "ВТТекущийУровеньТ1");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаНедостающиеПлечиТ2", "ВТПлечиСледующегоУровняТ2");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДОБАВИТЬ ТаблицаНазначение", "ДОБАВИТЬ ВТТекущийУровеньТ1"); // @Query-part-1, @Query-part-2
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ВыражениеОтбор",
		"&УровеньОперации < 30
		|	И (НЕ &ЭтоНовый ИЛИ &Исправление)");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ШаблонЗапросаСторноТ1ПоДокументуПланирования()
	
	Шаблон =
	"ВЫБРАТЬ
	|	ТаблицаИсточник.РегистраторТ2 КАК Регистратор,
	|	ТаблицаИсточник.РегистраторТ1 КАК СторнируемыйДокументПланирования,
	|	1 КАК НомерСтроки,
	|	ТаблицаИсточник.ПериодТ2 КАК Период,
	|	ТаблицаИсточник.ОрганизацияТ1 КАК Организация,
	|	ТаблицаИсточник.ТипДоставки КАК ТипДоставки,
	|	ТаблицаИсточник.ДатаОтгрузкиТ1 КАК ДатаОтгрузки,
	|	ТаблицаИсточник.СпособДоставкиТ1 КАК СпособДоставки,
	|	ТаблицаИсточник.ПеревозчикТ1 КАК Перевозчик,
	|	ТаблицаИсточник.ОтправительТ1 КАК Отправитель,
	|	ТаблицаИсточник.ТочкаОтправителяТ1 КАК ТочкаОтправителя,
	|	ТаблицаИсточник.ЗонаОтправителяТ1 КАК ЗонаОтправителя,
	|	ТаблицаИсточник.ПолучательТ1 КАК Получатель,
	|	ТаблицаИсточник.ТочкаПолучателяТ1 КАК ТочкаПолучателя,
	|	ТаблицаИсточник.ЗонаПолучателяТ1 КАК ЗонаПолучателя,
	|	ТаблицаИсточник.Распоряжение КАК Распоряжение,
	|	ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка) КАК Рейс,
	|	ТаблицаИсточник.НоменклатураТ1 КАК Номенклатура,
	|	ТаблицаИсточник.ХарактеристикаТ1 КАК Характеристика,
	|	ТаблицаИсточник.СерияТ1 КАК Серия,
	|	ТаблицаИсточник.КодСтроки КАК КодСтроки,
	|	ТаблицаИсточник.ДокументПланированияТ1 КАК ДокументПланирования,
	|	ТаблицаИсточник.Плечо КАК Плечо,
	|	ТаблицаИсточник.УпаковкаТ1 КАК Упаковка,
	|	&ДополнительныеПоля,
	|	ВЫБОР
	|		КОГДА ТаблицаИсточник.УровеньОперацииТ1 = 10
	|				ИЛИ ТаблицаИсточник.УровеньОперацииТ1 = 15
	|			ТОГДА -1 * ТаблицаИсточник.Разница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КДоставке,
	|	ВЫБОР
	|		КОГДА ТаблицаИсточник.УровеньОперацииТ1 = 15
	|				ИЛИ ТаблицаИсточник.УровеньОперацииТ1 = 20
	|			ТОГДА -1 * ТаблицаИсточник.Разница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КРейсу,
	|	0 КАК ВРейсе,
	|	0 КАК ВПути,
	|	0 КАК Доставлено,
	|	0 КАК Отменено,
	|	0 КАК КСборке,
	|	0 КАК Собирается,
	|	0 КАК Собрано,
	|	ТаблицаИсточник.УровеньОперацииТ2 КАК УровеньОперации
	|ИЗ
	|	&ТаблицаИсточник КАК ТаблицаИсточник
	|ГДЕ
	|	ТаблицаИсточник.Разница <> 0
	|	И НЕ ТаблицаИсточник.ДополненнаяСтрокаТ1";
	
	Возврат Шаблон;
	
КонецФункции

Функция ШаблонЗапросаСторноТ1БезДокументаПланирования()
	
	Шаблон =
	"ВЫБРАТЬ
	|	ТаблицаИсточник.РегистраторТ2 КАК Регистратор,
	|	ТаблицаИсточник.РегистраторТ1 КАК СторнируемыйДокументПланирования,
	|	1 КАК НомерСтроки,
	|	ТаблицаИсточник.ПериодТ2 КАК Период,
	|	ТаблицаИсточник.ОрганизацияТ1 КАК Организация,
	|	ТаблицаИсточник.ТипДоставки КАК ТипДоставки,
	|	ТаблицаИсточник.ДатаОтгрузкиТ1 КАК ДатаОтгрузки,
	|	ТаблицаИсточник.СпособДоставкиТ1 КАК СпособДоставки,
	|	ТаблицаИсточник.ПеревозчикТ1 КАК Перевозчик,
	|	ТаблицаИсточник.ОтправительТ1 КАК Отправитель,
	|	ТаблицаИсточник.ТочкаОтправителяТ1 КАК ТочкаОтправителя,
	|	ТаблицаИсточник.ЗонаОтправителяТ1 КАК ЗонаОтправителя,
	|	ТаблицаИсточник.ПолучательТ1 КАК Получатель,
	|	ТаблицаИсточник.ТочкаПолучателяТ1 КАК ТочкаПолучателя,
	|	ТаблицаИсточник.ЗонаПолучателяТ1 КАК ЗонаПолучателя,
	|	ТаблицаИсточник.Распоряжение КАК Распоряжение,
	|	ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка) КАК Рейс,
	|	ТаблицаИсточник.НоменклатураТ1 КАК Номенклатура,
	|	ТаблицаИсточник.ХарактеристикаТ1 КАК Характеристика,
	|	ТаблицаИсточник.СерияТ1 КАК Серия,
	|	ТаблицаИсточник.КодСтроки КАК КодСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ДокументПланирования,
	|	ТаблицаИсточник.Плечо КАК Плечо,
	|	ТаблицаИсточник.УпаковкаТ1 КАК Упаковка,
	|	&ДополнительныеПоля,
	|	-1 * ТаблицаИсточник.Разница КАК КДоставке,
	|	0 КАК КРейсу,
	|	0 КАК ВРейсе,
	|	0 КАК ВПути,
	|	0 КАК Доставлено,
	|	0 КАК Отменено,
	|	0 КАК КСборке,
	|	0 КАК Собирается,
	|	0 КАК Собрано,
	|	ТаблицаИсточник.УровеньОперацииТ2 КАК УровеньОперации
	|ИЗ
	|	&ТаблицаИсточник КАК ТаблицаИсточник
	|ГДЕ
	|	ТаблицаИсточник.Разница <> 0
	|	И НЕ ТаблицаИсточник.ДополненнаяСтрокаТ1
	|	И ТаблицаИсточник.УровеньОперацииТ1 = 20";
	
	Возврат Шаблон;
	
КонецФункции

Функция ШаблонЗапросаНовыеПараметрыТ2ПоДокументуПланирования()
	
	Шаблон =
	"ВЫБРАТЬ
	|	ТаблицаИсточник.РегистраторТ2 КАК Регистратор,
	|	ТаблицаИсточник.РегистраторТ1 КАК СторнируемыйДокументПланирования,
	|	1 КАК НомерСтроки,
	|	ТаблицаИсточник.ПериодТ2 КАК Период,
	|	ТаблицаИсточник.ОрганизацияТ2 КАК Организация,
	|	ТаблицаИсточник.ТипДоставки КАК ТипДоставки,
	|	ТаблицаИсточник.ДатаОтгрузкиТ2 КАК ДатаОтгрузки,
	|	ТаблицаИсточник.СпособДоставкиТ2 КАК СпособДоставки,
	|	ТаблицаИсточник.ПеревозчикТ2 КАК Перевозчик,
	|	ТаблицаИсточник.ОтправительТ2 КАК Отправитель,
	|	ТаблицаИсточник.ТочкаОтправителяТ2 КАК ТочкаОтправителя,
	|	ТаблицаИсточник.ЗонаОтправителяТ2 КАК ЗонаОтправителя,
	|	ТаблицаИсточник.ПолучательТ2 КАК Получатель,
	|	ТаблицаИсточник.ТочкаПолучателяТ2 КАК ТочкаПолучателя,
	|	ТаблицаИсточник.ЗонаПолучателяТ2 КАК ЗонаПолучателя,
	|	ТаблицаИсточник.Распоряжение КАК Распоряжение,
	|	ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка) КАК Рейс,
	|	ТаблицаИсточник.НоменклатураТ2 КАК Номенклатура,
	|	ТаблицаИсточник.ХарактеристикаТ2 КАК Характеристика,
	|	ТаблицаИсточник.СерияТ2 КАК Серия,
	|	ТаблицаИсточник.КодСтроки КАК КодСтроки,
	|	ТаблицаИсточник.ДокументПланированияТ2 КАК ДокументПланирования,
	|	ТаблицаИсточник.Плечо КАК Плечо,
	|	ТаблицаИсточник.УпаковкаТ2 КАК Упаковка,
	|	&ДополнительныеПоля,
	|	ВЫБОР
	|		КОГДА ТаблицаИсточник.УровеньОперацииТ1 = 10
	|				ИЛИ ТаблицаИсточник.УровеньОперацииТ1 = 15
	|				ИЛИ ТаблицаИсточник.УровеньОперацииТ1 = 20
	|					И ТаблицаИсточник.ДокументПланированияТ1 = НЕОПРЕДЕЛЕНО
	|			ТОГДА ТаблицаИсточник.Разница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КДоставке,
	|	ВЫБОР
	|		КОГДА ТаблицаИсточник.УровеньОперацииТ1 = 15
	|				ИЛИ ТаблицаИсточник.УровеньОперацииТ1 = 20
	|					И ТаблицаИсточник.ДокументПланированияТ1 <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ТаблицаИсточник.Разница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КРейсу,
	|	0 КАК ВРейсе,
	|	0 КАК ВПути,
	|	0 КАК Доставлено,
	|	0 КАК Отменено,
	|	0 КАК КСборке,
	|	0 КАК Собирается,
	|	0 КАК Собрано,
	|	ТаблицаИсточник.УровеньОперацииТ2 КАК УровеньОперации
	|ИЗ
	|	&ТаблицаИсточник КАК ТаблицаИсточник
	|ГДЕ
	|	ТаблицаИсточник.Разница <> 0
	|	И НЕ ТаблицаИсточник.ДополненнаяСтрокаТ2";
	
	Возврат Шаблон;
	
КонецФункции

Функция ШаблонЗапросаНовыеПараметрыТ2БезДокументаПланирования()
	
	Шаблон =
	"ВЫБРАТЬ
	|	ТаблицаИсточник.РегистраторТ2 КАК Регистратор,
	|	ТаблицаИсточник.РегистраторТ1 КАК СторнируемыйДокументПланирования,
	|	1 КАК НомерСтроки,
	|	ТаблицаИсточник.ПериодТ2 КАК Период,
	|	ТаблицаИсточник.ОрганизацияТ2 КАК Организация,
	|	ТаблицаИсточник.ТипДоставки КАК ТипДоставки,
	|	ТаблицаИсточник.ДатаОтгрузкиТ2 КАК ДатаОтгрузки,
	|	ТаблицаИсточник.СпособДоставкиТ2 КАК СпособДоставки,
	|	ТаблицаИсточник.ПеревозчикТ2 КАК Перевозчик,
	|	ТаблицаИсточник.ОтправительТ2 КАК Отправитель,
	|	ТаблицаИсточник.ТочкаОтправителяТ2 КАК ТочкаОтправителя,
	|	ТаблицаИсточник.ЗонаОтправителяТ2 КАК ЗонаОтправителя,
	|	ТаблицаИсточник.ПолучательТ2 КАК Получатель,
	|	ТаблицаИсточник.ТочкаПолучателяТ2 КАК ТочкаПолучателя,
	|	ТаблицаИсточник.ЗонаПолучателяТ2 КАК ЗонаПолучателя,
	|	ТаблицаИсточник.Распоряжение КАК Распоряжение,
	|	ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка) КАК Рейс,
	|	ТаблицаИсточник.НоменклатураТ2 КАК Номенклатура,
	|	ТаблицаИсточник.ХарактеристикаТ2 КАК Характеристика,
	|	ТаблицаИсточник.СерияТ2 КАК Серия,
	|	ТаблицаИсточник.КодСтроки КАК КодСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ДокументПланирования,
	|	ТаблицаИсточник.Плечо КАК Плечо,
	|	ТаблицаИсточник.УпаковкаТ2 КАК Упаковка,
	|	&ДополнительныеПоля,
	|	ТаблицаИсточник.Разница КАК КДоставке,
	|	0 КАК КРейсу,
	|	0 КАК ВРейсе,
	|	0 КАК ВПути,
	|	0 КАК Доставлено,
	|	0 КАК Отменено,
	|	0 КАК КСборке,
	|	0 КАК Собирается,
	|	0 КАК Собрано,
	|	ТаблицаИсточник.УровеньОперацииТ2 КАК УровеньОперации
	|ИЗ
	|	&ТаблицаИсточник КАК ТаблицаИсточник
	|ГДЕ
	|	ТаблицаИсточник.Разница <> 0
	|	И НЕ ТаблицаИсточник.ДополненнаяСтрокаТ2
	|	И ТаблицаИсточник.УровеньОперацииТ1 = 20";
	
	Возврат Шаблон;
	
КонецФункции

Функция ШаблонЗапросаДоставка()
	
	ТекстыШаблонов = Новый Массив; // Массив Из Строка
	
	// Сторно по сравнению с предыдущим уровнем планирования доставки
	
	ТаблицаИсточник = "ВТСравнениеТекущегоУровняСПредыдущим";
	
	Шаблон = ШаблонЗапросаСторноТ1ПоДокументуПланирования();
	Шаблон = СтрЗаменить(Шаблон, "&ТаблицаИсточник", ТаблицаИсточник);
	ТекстыШаблонов.Добавить(Шаблон);
	
	Шаблон = ШаблонЗапросаСторноТ1БезДокументаПланирования();
	Шаблон = СтрЗаменить(Шаблон, "&ТаблицаИсточник", ТаблицаИсточник);
	ТекстыШаблонов.Добавить(Шаблон);
	
	Шаблон = ШаблонЗапросаНовыеПараметрыТ2ПоДокументуПланирования();
	Шаблон = СтрЗаменить(Шаблон, "&ТаблицаИсточник", ТаблицаИсточник);
	ТекстыШаблонов.Добавить(Шаблон);
	
	Шаблон = ШаблонЗапросаНовыеПараметрыТ2БезДокументаПланирования();
	Шаблон = СтрЗаменить(Шаблон, "&ТаблицаИсточник", ТаблицаИсточник);
	ТекстыШаблонов.Добавить(Шаблон);
	
	// Сторно по сравнению со следующим уровнем планирования доставки
	
	ТаблицаИсточник = "ВТСравнениеТекущегоУровняСоСледующим";
	
	Шаблон = ШаблонЗапросаСторноТ1ПоДокументуПланирования();
	Шаблон = СтрЗаменить(Шаблон, "&ТаблицаИсточник", ТаблицаИсточник);
	ТекстыШаблонов.Добавить(Шаблон);
	
	Шаблон = ШаблонЗапросаСторноТ1БезДокументаПланирования();
	Шаблон = СтрЗаменить(Шаблон, "&ТаблицаИсточник", ТаблицаИсточник);
	ТекстыШаблонов.Добавить(Шаблон);
	
	Шаблон = ШаблонЗапросаНовыеПараметрыТ2ПоДокументуПланирования();
	Шаблон = СтрЗаменить(Шаблон, "&ТаблицаИсточник", ТаблицаИсточник);
	ТекстыШаблонов.Добавить(Шаблон);
	
	Шаблон = ШаблонЗапросаНовыеПараметрыТ2БезДокументаПланирования();
	Шаблон = СтрЗаменить(Шаблон, "&ТаблицаИсточник", ТаблицаИсточник);
	ТекстыШаблонов.Добавить(Шаблон);
	
	// Движения текущего регистратора
	
	ДополнитьШаблонАктуальнымиДвижениями(ТекстыШаблонов);
	
	ШаблонЗапросаДоставка = СтрСоединить(ТекстыШаблонов, ОбщегоНазначения.ТекстОбъединитьВсе()) + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	Плечо";
	
	Возврат ШаблонЗапросаДоставка;
	
КонецФункции

Процедура ДополнитьШаблонАктуальнымиДвижениями(ТекстыШаблонов)
	
	ДополнительныеПоляСторно =
	"ЛОЖЬ КАК ЭтоКонечноеПлечо,
	|0 КАК НомерМинимальногоПлеча,
	|ЛОЖЬ КАК ПервичнаяЗапись,
	|ДАТАВРЕМЯ(1, 1, 1) КАК ПервичнаяДатаОтгрузки,
	|ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение";
	
	ПодставитьДополнительныеПоляВШаблоны(ТекстыШаблонов, ДополнительныеПоляСторно);
	
	// Дополнительные поля в шаблоне размещаются между полями Упаковка и КДоставке
	
	ШаблонАктуальныеДвиженияТекущегоРегистратора =
	"ВЫБРАТЬ
	|	&Ссылка КАК Регистратор,
	|	НЕОПРЕДЕЛЕНО КАК СторнируемыйДокументПланирования,
	|	ТаблицаДанных.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанных.Период КАК Период,
	|	ТаблицаДанных.Организация КАК Организация,
	|	ТаблицаДанных.ТипДоставки КАК ТипДоставки,
	|	ТаблицаДанных.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ТаблицаДанных.СпособДоставки КАК СпособДоставки,
	|	ТаблицаДанных.Перевозчик КАК Перевозчик,
	|	ТаблицаДанных.Отправитель КАК Отправитель,
	|	ТаблицаДанных.ТочкаОтправителя КАК ТочкаОтправителя,
	|	ТаблицаДанных.ЗонаОтправителя КАК ЗонаОтправителя,
	|	ТаблицаДанных.Получатель КАК Получатель,
	|	ТаблицаДанных.ТочкаПолучателя КАК ТочкаПолучателя,
	|	ТаблицаДанных.ЗонаПолучателя КАК ЗонаПолучателя,
	|	ТаблицаДанных.Распоряжение КАК Распоряжение,
	|	ТаблицаДанных.Рейс КАК Рейс,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.Характеристика КАК Характеристика,
	|	ТаблицаДанных.Серия КАК Серия,
	|	ТаблицаДанных.КодСтроки КАК КодСтроки,
	|	ТаблицаДанных.ДокументПланирования КАК ДокументПланирования,
	|	ТаблицаДанных.Плечо КАК Плечо,
	|	ТаблицаДанных.Упаковка КАК Упаковка,
	|	ТаблицаДанных.ЭтоКонечноеПлечо КАК ЭтоКонечноеПлечо,
	|	ТаблицаДанных.НомерМинимальногоПлеча КАК НомерМинимальногоПлеча,
	|	ТаблицаДанных.ПервичнаяЗапись КАК ПервичнаяЗапись,
	|	ТаблицаДанных.ПервичнаяДатаОтгрузки КАК ПервичнаяДатаОтгрузки,
	|	ТаблицаДанных.Назначение КАК Назначение,
	|	ТаблицаДанных.КДоставке КАК КДоставке,
	|	ТаблицаДанных.КРейсу КАК КРейсу,
	|	ТаблицаДанных.ВРейсе КАК ВРейсе,
	|	ТаблицаДанных.ВПути КАК ВПути,
	|	ТаблицаДанных.Доставлено КАК Доставлено,
	|	ТаблицаДанных.Отменено КАК Отменено,
	|	ТаблицаДанных.КСборке КАК КСборке,
	|	ТаблицаДанных.Собирается КАК Собирается,
	|	ТаблицаДанных.Собрано КАК Собрано,
	|	ТаблицаДанных.УровеньОперации КАК УровеньОперации
	|	
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных";
	
	ТекстыШаблонов.Добавить(ШаблонАктуальныеДвиженияТекущегоРегистратора);
	
КонецПроцедуры

#Область КонтрольОстатков

Функция ТекстЗапросаПервичныеНазначенияДоставкиДляМерных()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИзмененияМерныхТоваров.Распоряжение КАК Распоряжение,
	|	ВЫБОР
	|		КОГДА ИзмененияМерныхТоваров.ДокументПланирования ССЫЛКА Документ.ЗаказНаДоставку
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ИзмененияМерныхТоваров.ДокументПланирования
	|	КОНЕЦ КАК ДокументПланирования,
	|	ИзмененияМерныхТоваров.Номенклатура КАК Номенклатура,
	|	ИзмененияМерныхТоваров.Характеристика КАК Характеристика,
	|	ИзмененияМерныхТоваров.Серия КАК Серия,
	|	ИзмененияМерныхТоваров.КодСтроки КАК КодСтроки,
	|	ЕСТЬNULL(ДоставкаПоДокументуПланирования.Назначение, ДоставкаБезДокументаПланирования.Назначение) КАК Назначение
	|ПОМЕСТИТЬ ВТ_ПервичныеНазначенияДоставкиДляМерных
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДвиженияДоставкаИзменение.Распоряжение КАК Распоряжение,
	|		ДвиженияДоставкаИзменение.ДокументПланирования КАК ДокументПланирования,
	|		ДвиженияДоставкаИзменение.Номенклатура КАК Номенклатура,
	|		ДвиженияДоставкаИзменение.Характеристика КАК Характеристика,
	|		ДвиженияДоставкаИзменение.Серия КАК Серия,
	|		ДвиженияДоставкаИзменение.КодСтроки КАК КодСтроки
	|	ИЗ
	|		ДвиженияДоставкаИзменение КАК ДвиженияДоставкаИзменение
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО ДвиженияДоставкаИзменение.Номенклатура = СправочникНоменклатура.Ссылка
	|	ГДЕ
	|		СправочникНоменклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В(&МерныеТипыЕдиницИзмерений)) КАК ИзмененияМерныхТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДоставкаПоДокументуПланирования
	|		ПО ИзмененияМерныхТоваров.Распоряжение = ДоставкаПоДокументуПланирования.Распоряжение
	|			И ИзмененияМерныхТоваров.КодСтроки = ДоставкаПоДокументуПланирования.КодСтроки
	|			И (НЕ ИзмененияМерныхТоваров.ДокументПланирования ССЫЛКА Документ.ЗаказНаДоставку)
	|			И ИзмененияМерныхТоваров.ДокументПланирования = ДоставкаПоДокументуПланирования.ДокументПланирования
	|			И (ДоставкаПоДокументуПланирования.ПервичнаяЗапись = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДоставкаБезДокументаПланирования
	|		ПО ИзмененияМерныхТоваров.Распоряжение = ДоставкаБезДокументаПланирования.Распоряжение
	|			И ИзмененияМерныхТоваров.КодСтроки = ДоставкаБезДокументаПланирования.КодСтроки
	|			И (ИзмененияМерныхТоваров.ДокументПланирования ССЫЛКА Документ.ЗаказНаДоставку)
	|			И (ДоставкаБезДокументаПланирования.ДокументПланирования = НЕОПРЕДЕЛЕНО)
	|			И (ДоставкаБезДокументаПланирования.ПервичнаяЗапись = ИСТИНА)
	|ГДЕ
	|	(ДоставкаПоДокументуПланирования.Назначение ЕСТЬ НЕ NULL 
	|			ИЛИ ДоставкаБезДокументаПланирования.Назначение ЕСТЬ НЕ NULL )";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДопустимыеОтклоненияКРейсу()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыКОтгрузкеОбороты.ДокументОтгрузки КАК Распоряжение,
	|	ТоварыКОтгрузкеОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОбороты.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОбороты.Серия КАК Серия,
	|	ТоварыКОтгрузкеОбороты.Назначение КАК Назначение,
	|	ТоварыКОтгрузкеОбороты.КОтгрузкеПриход КАК КОтгрузкеПриход,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОбороты.КОтгрузкеПриход * &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 КАК ЧИСЛО(15, 3)) КАК ДопустимоеОтклонение
	|ПОМЕСТИТЬ ВТ_ДопустимыеОтклоненияКРейсу
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Обороты(
	|			,
	|			,
	|			,
	|			(ДокументОтгрузки, Номенклатура, Характеристика, Назначение, Серия) В
	|					(ВЫБРАТЬ
	|						ПервичныеНазначенияДоставки.Распоряжение,
	|						ПервичныеНазначенияДоставки.Номенклатура,
	|						ПервичныеНазначенияДоставки.Характеристика,
	|						ПервичныеНазначенияДоставки.Назначение,
	|						ПервичныеНазначенияДоставки.Серия
	|					ИЗ
	|						ВТ_ПервичныеНазначенияДоставкиДляМерных КАК ПервичныеНазначенияДоставки)) КАК ТоварыКОтгрузкеОбороты
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаКонтроляДоставки(ПроверяемоеВыражение, УчитыватьДокументыПланирования, ВыражениеДопустимоеОтклонение, КонтролироватьОтклонениеМерныхТоваров)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоставкаОбороты.Организация КАК Организация,
	|	ДоставкаОбороты.ТипДоставки КАК ТипДоставки,
	|	ДоставкаОбороты.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ДоставкаОбороты.СпособДоставки КАК СпособДоставки,
	|	ДоставкаОбороты.Отправитель КАК Отправитель,
	|	ДоставкаОбороты.ТочкаОтправителя КАК ТочкаОтправителя,
	|	ДоставкаОбороты.ЗонаОтправителя КАК ЗонаОтправителя,
	|	ДоставкаОбороты.Получатель КАК Получатель,
	|	ДоставкаОбороты.ТочкаПолучателя КАК ТочкаПолучателя,
	|	ДоставкаОбороты.ЗонаПолучателя КАК ЗонаПолучателя,
	|	ДоставкаОбороты.Распоряжение КАК Распоряжение,
	|	&ПолеДокументПланирования КАК ДокументПланирования,
	|	ДоставкаОбороты.Номенклатура КАК Номенклатура,
	|	ДоставкаОбороты.Характеристика КАК Характеристика,
	|	ДоставкаОбороты.Серия КАК Серия,
	|	ДоставкаОбороты.КодСтроки КАК КодСтроки,
	|	ДоставкаОбороты.Плечо КАК Плечо,
	|	ДоставкаОбороты.Перевозчик КАК Перевозчик,
	|	-1 * (&ПроверяемоеВыражение) КАК Превышение,
	|	ДоставкаОбороты.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрНакопления.Доставка.Обороты(
	|			,
	|			,
	|			,
	|			(Организация, ТипДоставки, ДатаОтгрузки, СпособДоставки,
	|			Отправитель, ТочкаОтправителя, ЗонаОтправителя,
	|			Получатель, ТочкаПолучателя, ЗонаПолучателя,
	|			&ОтборОборотыДокументПланирования, Распоряжение,
	|			Номенклатура, Характеристика, Серия, КодСтроки, Плечо, Перевозчик) В
	|				(ВЫБРАТЬ
	|					Таблица.Организация КАК Организация,
	|					Таблица.ТипДоставки КАК ТипДоставки,
	|					Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
	|					Таблица.СпособДоставки КАК СпособДоставки,
	|					Таблица.Отправитель КАК Отправитель,
	|					Таблица.ТочкаОтправителя КАК ТочкаОтправителя,
	|					Таблица.ЗонаОтправителя КАК ЗонаОтправителя,
	|					Таблица.Получатель КАК Получатель,
	|					Таблица.ТочкаПолучателя КАК ТочкаПолучателя,
	|					Таблица.ЗонаПолучателя КАК ЗонаПолучателя,
	|					&ОтборИзменениеДокументПланирования КАК ДокументПланирования,
	|					Таблица.Распоряжение КАК Распоряжение,
	|					Таблица.Номенклатура КАК Номенклатура,
	|					Таблица.Характеристика КАК Характеристика,
	|					Таблица.Серия КАК Серия,
	|					Таблица.КодСтроки КАК КодСтроки,
	|					Таблица.Плечо КАК Плечо,
	|					Таблица.Перевозчик КАК Перевозчик
	|				ИЗ
	|					ДвиженияДоставкаИзменение КАК Таблица)) КАК ДоставкаОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ &ДопустимыеОтклоненияОстатковДоставки КАК ДопустимыеОтклоненияОстатковДоставки ПО ИСТИНА
	|ГДЕ
	|	&ПроверяемоеВыражение + &ВыражениеДопустимоеОтклонение < 0";
	
	Если УчитыватьДокументыПланирования Тогда
		
		ПолеДокументПланирования = "ДоставкаОбороты.ДокументПланирования";
		ОтборОборотыДокументПланирования = "ДокументПланирования";
		ОтборИзменениеДокументПланирования = "Таблица.ДокументПланирования";
		
	Иначе
		
		ПолеДокументПланирования = "НЕОПРЕДЕЛЕНО";
		ОтборОборотыДокументПланирования = "НЕОПРЕДЕЛЕНО";
		ОтборИзменениеДокументПланирования = "НЕОПРЕДЕЛЕНО";
		
	КонецЕсли;
	
	Если КонтролироватьОтклонениеМерныхТоваров
	   И УчитыватьДокументыПланирования Тогда
		
		СоединениеДопустимыеОтклонения =
		"ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервичныеНазначенияДоставкиДляМерных КАК ПервичныеНазначенияДоставкиПоДокументуПланирования
		|ПО ДоставкаОбороты.Распоряжение = ПервичныеНазначенияДоставкиПоДокументуПланирования.Распоряжение
		|	И ДоставкаОбороты.Номенклатура = ПервичныеНазначенияДоставкиПоДокументуПланирования.Номенклатура
		|	И ДоставкаОбороты.Характеристика = ПервичныеНазначенияДоставкиПоДокументуПланирования.Характеристика
		|	И ДоставкаОбороты.Серия = ПервичныеНазначенияДоставкиПоДокументуПланирования.Серия
		|	И ДоставкаОбороты.КодСтроки = ПервичныеНазначенияДоставкиПоДокументуПланирования.КодСтроки
		|	И (НЕ ДоставкаОбороты.ДокументПланирования ССЫЛКА Документ.ЗаказНаДоставку)
		|	И ДоставкаОбороты.ДокументПланирования = ПервичныеНазначенияДоставкиПоДокументуПланирования.ДокументПланирования
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервичныеНазначенияДоставкиДляМерных КАК ПервичныеНазначенияДоставкиБезДокументаПланирования
		|ПО ДоставкаОбороты.Распоряжение = ПервичныеНазначенияДоставкиБезДокументаПланирования.Распоряжение
		|	И ДоставкаОбороты.Номенклатура = ПервичныеНазначенияДоставкиБезДокументаПланирования.Номенклатура
		|	И ДоставкаОбороты.Характеристика = ПервичныеНазначенияДоставкиБезДокументаПланирования.Характеристика
		|	И ДоставкаОбороты.Серия = ПервичныеНазначенияДоставкиБезДокументаПланирования.Серия
		|	И ДоставкаОбороты.КодСтроки = ПервичныеНазначенияДоставкиБезДокументаПланирования.КодСтроки
		|	И ДоставкаОбороты.ДокументПланирования ССЫЛКА Документ.ЗаказНаДоставку
		|	И ПервичныеНазначенияДоставкиБезДокументаПланирования.ДокументПланирования = НЕОПРЕДЕЛЕНО
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопустимыеОтклоненияКРейсу КАК ДопустимыеОтклоненияОстатковДоставки
		|ПО ДоставкаОбороты.Распоряжение = ДопустимыеОтклоненияОстатковДоставки.Распоряжение
		|	И ДоставкаОбороты.Номенклатура = ДопустимыеОтклоненияОстатковДоставки.Номенклатура
		|	И ДоставкаОбороты.Характеристика = ДопустимыеОтклоненияОстатковДоставки.Характеристика
		|	И ДоставкаОбороты.Серия = ДопустимыеОтклоненияОстатковДоставки.Серия
		|	И ЕСТЬNULL(ПервичныеНазначенияДоставкиПоДокументуПланирования.Назначение, ПервичныеНазначенияДоставкиБезДокументаПланирования.Назначение) = ДопустимыеОтклоненияОстатковДоставки.Назначение";
		
	ИначеЕсли КонтролироватьОтклонениеМерныхТоваров Тогда
		
		СоединениеДопустимыеОтклонения =
		"ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервичныеНазначенияДоставкиДляМерных КАК ПервичныеНазначенияДоставки
		|ПО ДоставкаОбороты.Распоряжение = ПервичныеНазначенияДоставки.Распоряжение
		|	И ДоставкаОбороты.Номенклатура = ПервичныеНазначенияДоставки.Номенклатура
		|	И ДоставкаОбороты.Характеристика = ПервичныеНазначенияДоставки.Характеристика
		|	И ДоставкаОбороты.Серия = ПервичныеНазначенияДоставки.Серия
		|	И ДоставкаОбороты.КодСтроки = ПервичныеНазначенияДоставки.КодСтроки
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопустимыеОтклоненияКРейсу КАК ДопустимыеОтклоненияОстатковДоставки
		|ПО ПервичныеНазначенияДоставки.Распоряжение = ДопустимыеОтклоненияОстатковДоставки.Распоряжение
		|	И ПервичныеНазначенияДоставки.Номенклатура = ДопустимыеОтклоненияОстатковДоставки.Номенклатура
		|	И ПервичныеНазначенияДоставки.Характеристика = ДопустимыеОтклоненияОстатковДоставки.Характеристика
		|	И ПервичныеНазначенияДоставки.Серия = ДопустимыеОтклоненияОстатковДоставки.Серия
		|	И ПервичныеНазначенияДоставки.Назначение = ДопустимыеОтклоненияОстатковДоставки.Назначение";
		
	Иначе
		
		СоединениеДопустимыеОтклонения = "";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДокументПланирования", ПолеДокументПланирования);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборОборотыДокументПланирования", ОтборОборотыДокументПланирования);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборИзменениеДокументПланирования", ОтборИзменениеДокументПланирования);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПроверяемоеВыражение", ПроверяемоеВыражение);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыражениеДопустимоеОтклонение", ВыражениеДопустимоеОтклонение);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"ЛЕВОЕ СОЕДИНЕНИЕ &ДопустимыеОтклоненияОстатковДоставки КАК ДопустимыеОтклоненияОстатковДоставки ПО ИСТИНА",
		СоединениеДопустимыеОтклонения);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаКонтроляПараметрыСклада()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Ссылка КАК Склад
	|ПОМЕСТИТЬ ВТ_Склады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияДоставкаИзменение КАК ДвиженияДоставкаИзменение
	|		ПО Склады.Ссылка = ДвиженияДоставкаИзменение.Отправитель
	|			И Склады.ИспользоватьОрдернуюСхемуПриОтгрузке
	|			И Склады.НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДопустимыеОтклоненияКСборке()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыКОтгрузкеОбороты.ДокументОтгрузки КАК Распоряжение,
	|	ТоварыКОтгрузкеОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОбороты.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОбороты.Серия КАК Серия,
	|	ТоварыКОтгрузкеОбороты.Назначение КАК Назначение,
	|	ТоварыКОтгрузкеОбороты.КОтгрузкеПриход КАК КОтгрузкеПриход,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОбороты.КОтгрузкеПриход * &ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 КАК ЧИСЛО(15, 3)) КАК ДопустимоеОтклонение
	|ПОМЕСТИТЬ ВТ_ДопустимыеОтклоненияКСборке
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Обороты(
	|			,
	|			,
	|			,
	|			(ДокументОтгрузки, Номенклатура, Характеристика, Назначение, Серия) В
	|					(ВЫБРАТЬ
	|						Таблица.Распоряжение,
	|						Таблица.Номенклатура,
	|						Таблица.Характеристика,
	|						Таблица.Назначение,
	|						Таблица.Серия
	|					ИЗ
	|						ВТ_ПервичныеЗаписиДоставки КАК Таблица)
	|			И Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)) КАК ТоварыКОтгрузкеОбороты
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПервичныеЗаписиДоставки()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Доставка.Распоряжение КАК Распоряжение,
	|	Доставка.ДокументПланирования КАК ДокументПланирования,
	|	Доставка.Номенклатура КАК Номенклатура,
	|	Доставка.Характеристика КАК Характеристика,
	|	Доставка.Серия КАК Серия,
	|	Доставка.КодСтроки КАК КодСтроки,
	|	ДвиженияДоставкаИзменение.Рейс КАК Рейс,
	|	Доставка.Назначение КАК Назначение
	|ПОМЕСТИТЬ ВТ_ПервичныеЗаписиДоставки
	|ИЗ
	|	ДвиженияДоставкаИзменение КАК ДвиженияДоставкаИзменение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК Склады
	|		ПО ДвиженияДоставкаИзменение.Отправитель = Склады.Склад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК Доставка
	|		ПО ДвиженияДоставкаИзменение.Распоряжение = Доставка.Распоряжение
	|			И ДвиженияДоставкаИзменение.Номенклатура = Доставка.Номенклатура
	|			И ДвиженияДоставкаИзменение.Характеристика = Доставка.Характеристика
	|			И ДвиженияДоставкаИзменение.Серия = Доставка.Серия
	|			И Доставка.ПервичнаяЗапись = ИСТИНА
	|ГДЕ
	|	ДвиженияДоставкаИзменение.КодСтроки > 0
	|	И ДвиженияДоставкаИзменение.Рейс <> ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДвиженияДоставкиПервичные.Распоряжение КАК Распоряжение,
	|	ДвиженияДоставкиПервичные.ДокументПланирования КАК ДокументПланирования,
	|	ДвиженияДоставкиПервичные.Номенклатура КАК Номенклатура,
	|	ДвиженияДоставкиПервичные.Характеристика КАК Характеристика,
	|	ДвиженияДоставкиПервичные.Серия КАК Серия,
	|	ДвиженияДоставкиПервичные.КодСтроки КАК КодСтроки,
	|	ДвиженияДоставкаИзменение.Рейс КАК Рейс,
	|	ДвиженияДоставкиПервичные.Назначение КАК Назначение
	|ИЗ
	|	ДвиженияДоставкаИзменение КАК ДвиженияДоставкаИзменение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК Склады
	|		ПО ДвиженияДоставкаИзменение.Отправитель = Склады.Склад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиОрдер
	|		ПО ДвиженияДоставкаИзменение.Распоряжение = ДвиженияДоставкиОрдер.Распоряжение
	|			И ДвиженияДоставкаИзменение.Номенклатура = ДвиженияДоставкиОрдер.Номенклатура
	|			И ДвиженияДоставкаИзменение.Характеристика = ДвиженияДоставкиОрдер.Характеристика
	|			И ДвиженияДоставкаИзменение.Серия = ДвиженияДоставкиОрдер.Серия
	|			И ДвиженияДоставкаИзменение.Рейс = ДвиженияДоставкиОрдер.Рейс
	|			И ДвиженияДоставкиОрдер.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиРейс
	|		ПО ДвиженияДоставкиОрдер.Распоряжение = ДвиженияДоставкиРейс.Распоряжение
	|			И ДвиженияДоставкиОрдер.Номенклатура = ДвиженияДоставкиРейс.Номенклатура
	|			И ДвиженияДоставкиОрдер.Характеристика = ДвиженияДоставкиРейс.Характеристика
	|			И ДвиженияДоставкиОрдер.Серия = ДвиженияДоставкиРейс.Серия
	|			И ДвиженияДоставкиОрдер.Рейс = ДвиженияДоставкиРейс.Рейс
	|			И ДвиженияДоставкиРейс.КСборке > 0
	|			И ДвиженияДоставкиРейс.ДокументПланирования ССЫЛКА Документ.ЗаказНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиПервичные
	|		ПО ДвиженияДоставкиОрдер.Распоряжение = ДвиженияДоставкиПервичные.Распоряжение
	|			И ДвиженияДоставкиПервичные.ДокументПланирования = НЕОПРЕДЕЛЕНО
	|			И ДвиженияДоставкиОрдер.Номенклатура = ДвиженияДоставкиПервичные.Номенклатура
	|			И ДвиженияДоставкиОрдер.Характеристика = ДвиженияДоставкиПервичные.Характеристика
	|			И ДвиженияДоставкиОрдер.Серия = ДвиженияДоставкиПервичные.Серия
	|			И ДвиженияДоставкиОрдер.Назначение = ДвиженияДоставкиПервичные.Назначение
	|			И ДвиженияДоставкиРейс.КодСтроки = ДвиженияДоставкиПервичные.КодСтроки
	|			И ДвиженияДоставкиПервичные.ПервичнаяЗапись = ИСТИНА
	|ГДЕ
	|	ДвиженияДоставкаИзменение.КодСтроки = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДвиженияДоставкиПервичные.Распоряжение КАК Распоряжение,
	|	ДвиженияДоставкиПервичные.ДокументПланирования КАК ДокументПланирования,
	|	ДвиженияДоставкиПервичные.Номенклатура КАК Номенклатура,
	|	ДвиженияДоставкиПервичные.Характеристика КАК Характеристика,
	|	ДвиженияДоставкиПервичные.Серия КАК Серия,
	|	ДвиженияДоставкиПервичные.КодСтроки КАК КодСтроки,
	|	ДвиженияДоставкаИзменение.Рейс КАК Рейс,
	|	ДвиженияДоставкиПервичные.Назначение КАК Назначение
	|ИЗ
	|	ДвиженияДоставкаИзменение КАК ДвиженияДоставкаИзменение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК Склады
	|		ПО ДвиженияДоставкаИзменение.Отправитель = Склады.Склад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиОрдер
	|		ПО ДвиженияДоставкаИзменение.Распоряжение = ДвиженияДоставкиОрдер.Распоряжение
	|			И ДвиженияДоставкаИзменение.Номенклатура = ДвиженияДоставкиОрдер.Номенклатура
	|			И ДвиженияДоставкаИзменение.Характеристика = ДвиженияДоставкиОрдер.Характеристика
	|			И ДвиженияДоставкаИзменение.Серия = ДвиженияДоставкиОрдер.Серия
	|			И ДвиженияДоставкаИзменение.Рейс = ДвиженияДоставкиОрдер.Рейс
	|			И ДвиженияДоставкиОрдер.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиРейс
	|		ПО ДвиженияДоставкиОрдер.Распоряжение = ДвиженияДоставкиРейс.Распоряжение
	|			И ДвиженияДоставкиОрдер.Номенклатура = ДвиженияДоставкиРейс.Номенклатура
	|			И ДвиженияДоставкиОрдер.Характеристика = ДвиженияДоставкиРейс.Характеристика
	|			И ДвиженияДоставкиОрдер.Серия = ДвиженияДоставкиРейс.Серия
	|			И ДвиженияДоставкиОрдер.Рейс = ДвиженияДоставкиРейс.Рейс
	|			И ДвиженияДоставкиРейс.КСборке > 0
	|			И НЕ (ДвиженияДоставкиРейс.ДокументПланирования ССЫЛКА Документ.ЗаказНаДоставку)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиПервичные
	|		ПО ДвиженияДоставкиОрдер.Распоряжение = ДвиженияДоставкиПервичные.Распоряжение
	|			И ДвиженияДоставкиРейс.ДокументПланирования = ДвиженияДоставкиПервичные.ДокументПланирования
	|			И ДвиженияДоставкиОрдер.Номенклатура = ДвиженияДоставкиПервичные.Номенклатура
	|			И ДвиженияДоставкиОрдер.Характеристика = ДвиженияДоставкиПервичные.Характеристика
	|			И ДвиженияДоставкиОрдер.Серия = ДвиженияДоставкиПервичные.Серия
	|			И ДвиженияДоставкиОрдер.Назначение = ДвиженияДоставкиПервичные.Назначение
	|			И ДвиженияДоставкиРейс.КодСтроки = ДвиженияДоставкиПервичные.КодСтроки
	|			И ДвиженияДоставкиПервичные.ПервичнаяЗапись = ИСТИНА
	|ГДЕ
	|	ДвиженияДоставкаИзменение.КодСтроки = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДвиженияДоставкиПервичные.Распоряжение,
	|	ДвиженияДоставкиПервичные.ДокументПланирования,
	|	ДвиженияДоставкиПервичные.Номенклатура,
	|	ДвиженияДоставкиПервичные.Характеристика,
	|	ДвиженияДоставкиПервичные.Серия,
	|	ДвиженияДоставкиПервичные.КодСтроки,
	|	ДвиженияДоставкаИзменение.Рейс,
	|	ДвиженияДоставкиПервичные.Назначение
	|ИЗ
	|	ДвиженияДоставкаИзменение КАК ДвиженияДоставкаИзменение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК Склады
	|		ПО ДвиженияДоставкаИзменение.Отправитель = Склады.Склад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиОрдер
	|		ПО ДвиженияДоставкаИзменение.Распоряжение = ДвиженияДоставкиОрдер.Распоряжение
	|			И ДвиженияДоставкаИзменение.Номенклатура = ДвиженияДоставкиОрдер.Номенклатура
	|			И ДвиженияДоставкаИзменение.Характеристика = ДвиженияДоставкиОрдер.Характеристика
	|			И ДвиженияДоставкаИзменение.Серия = ДвиженияДоставкиОрдер.Серия
	|			И ДвиженияДоставкаИзменение.Рейс = ДвиженияДоставкиОрдер.Рейс
	|			И (ДвиженияДоставкиОрдер.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиПервичные
	|		ПО (ДвиженияДоставкиОрдер.Распоряжение = ДвиженияДоставкиПервичные.Распоряжение)
	|			И (ДвиженияДоставкиОрдер.Номенклатура = ДвиженияДоставкиПервичные.Номенклатура)
	|			И (ДвиженияДоставкиОрдер.Характеристика = ДвиженияДоставкиПервичные.Характеристика)
	|			И (ДвиженияДоставкиОрдер.Серия = ДвиженияДоставкиПервичные.Серия)
	|			И (ДвиженияДоставкиОрдер.Назначение = ДвиженияДоставкиПервичные.Назначение)
	|			И (ДвиженияДоставкиПервичные.ПервичнаяЗапись = ИСТИНА)
	|			И ДвиженияДоставкиПервичные.ДокументПланирования = НЕОПРЕДЕЛЕНО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиРейс
	|		ПО (ДвиженияДоставкиПервичные.Распоряжение = ДвиженияДоставкиРейс.Распоряжение)
	|			И (ДвиженияДоставкиПервичные.Номенклатура = ДвиженияДоставкиРейс.Номенклатура)
	|			И (ДвиженияДоставкиПервичные.Характеристика = ДвиженияДоставкиРейс.Характеристика)
	|			И (ДвиженияДоставкиПервичные.Серия = ДвиженияДоставкиРейс.Серия)
	|			И (ДвиженияДоставкиПервичные.КодСтроки = ДвиженияДоставкиРейс.КодСтроки)
	|			И (ДвиженияДоставкиОрдер.Рейс = ДвиженияДоставкиРейс.Рейс)
	|			И (ДвиженияДоставкиРейс.КСборке > 0)
	|			И ДвиженияДоставкиРейс.ДокументПланирования ССЫЛКА Документ.ЗаказНаДоставку
	|ГДЕ
	|	ДвиженияДоставкаИзменение.КодСтроки = 0
	|	И ДвиженияДоставкиРейс.Регистратор ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДвиженияДоставкиПервичные.Распоряжение,
	|	ДвиженияДоставкиПервичные.ДокументПланирования,
	|	ДвиженияДоставкиПервичные.Номенклатура,
	|	ДвиженияДоставкиПервичные.Характеристика,
	|	ДвиженияДоставкиПервичные.Серия,
	|	ДвиженияДоставкиПервичные.КодСтроки,
	|	ДвиженияДоставкаИзменение.Рейс,
	|	ДвиженияДоставкиПервичные.Назначение
	|ИЗ
	|	ДвиженияДоставкаИзменение КАК ДвиженияДоставкаИзменение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК Склады
	|		ПО ДвиженияДоставкаИзменение.Отправитель = Склады.Склад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиОрдер
	|		ПО ДвиженияДоставкаИзменение.Распоряжение = ДвиженияДоставкиОрдер.Распоряжение
	|			И ДвиженияДоставкаИзменение.Номенклатура = ДвиженияДоставкиОрдер.Номенклатура
	|			И ДвиженияДоставкаИзменение.Характеристика = ДвиженияДоставкиОрдер.Характеристика
	|			И ДвиженияДоставкаИзменение.Серия = ДвиженияДоставкиОрдер.Серия
	|			И ДвиженияДоставкаИзменение.Рейс = ДвиженияДоставкиОрдер.Рейс
	|			И (ДвиженияДоставкиОрдер.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиПервичные
	|		ПО (ДвиженияДоставкиОрдер.Распоряжение = ДвиженияДоставкиПервичные.Распоряжение)
	|			И (ДвиженияДоставкиОрдер.Номенклатура = ДвиженияДоставкиПервичные.Номенклатура)
	|			И (ДвиженияДоставкиОрдер.Характеристика = ДвиженияДоставкиПервичные.Характеристика)
	|			И (ДвиженияДоставкиОрдер.Серия = ДвиженияДоставкиПервичные.Серия)
	|			И (ДвиженияДоставкиОрдер.Назначение = ДвиженияДоставкиПервичные.Назначение)
	|			И (ДвиженияДоставкиПервичные.ПервичнаяЗапись = ИСТИНА)
	|			И ДвиженияДоставкиПервичные.ДокументПланирования <> НЕОПРЕДЕЛЕНО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиРейс
	|		ПО (ДвиженияДоставкиПервичные.Распоряжение = ДвиженияДоставкиРейс.Распоряжение)
	|			И (ДвиженияДоставкиПервичные.Номенклатура = ДвиженияДоставкиРейс.Номенклатура)
	|			И (ДвиженияДоставкиПервичные.Характеристика = ДвиженияДоставкиРейс.Характеристика)
	|			И (ДвиженияДоставкиПервичные.Серия = ДвиженияДоставкиРейс.Серия)
	|			И (ДвиженияДоставкиПервичные.КодСтроки = ДвиженияДоставкиРейс.КодСтроки)
	|			И (ДвиженияДоставкиОрдер.Рейс = ДвиженияДоставкиРейс.Рейс)
	|			И (ДвиженияДоставкиРейс.КСборке > 0)
	|			И (ДвиженияДоставкиРейс.ДокументПланирования = ДвиженияДоставкиПервичные.ДокументПланирования)
	|			
	|ГДЕ
	|	ДвиженияДоставкаИзменение.КодСтроки = 0
	|	И ДвиженияДоставкиРейс.Регистратор ЕСТЬ NULL
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДвиженияДоставкиПервичные.Распоряжение КАК Распоряжение,
	|	ДвиженияДоставкиПервичные.ДокументПланирования КАК ДокументПланирования,
	|	ДвиженияДоставкиПервичные.Номенклатура КАК Номенклатура,
	|	ДвиженияДоставкиПервичные.Характеристика КАК Характеристика,
	|	ДвиженияДоставкиПервичные.Серия КАК Серия,
	|	ДвиженияДоставкиПервичные.КодСтроки КАК КодСтроки,
	|	ДвиженияДоставкаИзменение.Рейс КАК Рейс,
	|	ДвиженияДоставкиПервичные.Назначение КАК Назначение
	|ИЗ
	|	ДвиженияДоставкаИзменение КАК ДвиженияДоставкаИзменение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК Склады
	|		ПО ДвиженияДоставкаИзменение.Отправитель = Склады.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиОрдер
	|		ПО ДвиженияДоставкаИзменение.Распоряжение = ДвиженияДоставкиОрдер.Распоряжение
	|			И ДвиженияДоставкаИзменение.Номенклатура = ДвиженияДоставкиОрдер.Номенклатура
	|			И ДвиженияДоставкаИзменение.Характеристика = ДвиженияДоставкиОрдер.Характеристика
	|			И ДвиженияДоставкаИзменение.Серия = ДвиженияДоставкиОрдер.Серия
	|			И ДвиженияДоставкаИзменение.Рейс = ДвиженияДоставкиОрдер.Рейс
	|			И ДвиженияДоставкиОрдер.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиРейс
	|		ПО ДвиженияДоставкаИзменение.Распоряжение = ДвиженияДоставкиРейс.Распоряжение
	|			И ДвиженияДоставкаИзменение.Номенклатура = ДвиженияДоставкиРейс.Номенклатура
	|			И ДвиженияДоставкаИзменение.Характеристика = ДвиженияДоставкиРейс.Характеристика
	|			И ДвиженияДоставкаИзменение.Серия = ДвиженияДоставкиРейс.Серия
	|			И ДвиженияДоставкаИзменение.Рейс = ДвиженияДоставкиРейс.Рейс
	|			И ДвиженияДоставкиРейс.КСборке > 0
	|			И ДвиженияДоставкиРейс.ДокументПланирования ССЫЛКА Документ.ЗаказНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиПервичные
	|		ПО ДвиженияДоставкиРейс.Распоряжение = ДвиженияДоставкиПервичные.Распоряжение
	|			И ДвиженияДоставкиПервичные.ДокументПланирования = НЕОПРЕДЕЛЕНО
	|			И ДвиженияДоставкиРейс.Номенклатура = ДвиженияДоставкиПервичные.Номенклатура
	|			И ДвиженияДоставкиРейс.Характеристика = ДвиженияДоставкиПервичные.Характеристика
	|			И ДвиженияДоставкиРейс.Серия = ДвиженияДоставкиПервичные.Серия
	|			И ДвиженияДоставкиРейс.КодСтроки = ДвиженияДоставкиПервичные.КодСтроки
	|			И ДвиженияДоставкиПервичные.ПервичнаяЗапись = ИСТИНА
	|ГДЕ
	|	ДвиженияДоставкаИзменение.КодСтроки = 0
	|	И ДвиженияДоставкиОрдер.Регистратор ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДвиженияДоставкиПервичные.Распоряжение КАК Распоряжение,
	|	ДвиженияДоставкиПервичные.ДокументПланирования КАК ДокументПланирования,
	|	ДвиженияДоставкиПервичные.Номенклатура КАК Номенклатура,
	|	ДвиженияДоставкиПервичные.Характеристика КАК Характеристика,
	|	ДвиженияДоставкиПервичные.Серия КАК Серия,
	|	ДвиженияДоставкиПервичные.КодСтроки КАК КодСтроки,
	|	ДвиженияДоставкаИзменение.Рейс КАК Рейс,
	|	ДвиженияДоставкиПервичные.Назначение КАК Назначение
	|ИЗ
	|	ДвиженияДоставкаИзменение КАК ДвиженияДоставкаИзменение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК Склады
	|		ПО ДвиженияДоставкаИзменение.Отправитель = Склады.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиОрдер
	|		ПО ДвиженияДоставкаИзменение.Распоряжение = ДвиженияДоставкиОрдер.Распоряжение
	|			И ДвиженияДоставкаИзменение.Номенклатура = ДвиженияДоставкиОрдер.Номенклатура
	|			И ДвиженияДоставкаИзменение.Характеристика = ДвиженияДоставкиОрдер.Характеристика
	|			И ДвиженияДоставкаИзменение.Серия = ДвиженияДоставкиОрдер.Серия
	|			И ДвиженияДоставкаИзменение.Рейс = ДвиженияДоставкиОрдер.Рейс
	|			И ДвиженияДоставкиОрдер.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиРейс
	|		ПО ДвиженияДоставкаИзменение.Распоряжение = ДвиженияДоставкиРейс.Распоряжение
	|			И ДвиженияДоставкаИзменение.Номенклатура = ДвиженияДоставкиРейс.Номенклатура
	|			И ДвиженияДоставкаИзменение.Характеристика = ДвиженияДоставкиРейс.Характеристика
	|			И ДвиженияДоставкаИзменение.Серия = ДвиженияДоставкиРейс.Серия
	|			И ДвиженияДоставкаИзменение.Рейс = ДвиженияДоставкиРейс.Рейс
	|			И ДвиженияДоставкиРейс.КСборке > 0
	|			И НЕ (ДвиженияДоставкиРейс.ДокументПланирования ССЫЛКА Документ.ЗаказНаДоставку)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиПервичные
	|		ПО ДвиженияДоставкиРейс.Распоряжение = ДвиженияДоставкиПервичные.Распоряжение
	|			И ДвиженияДоставкиРейс.ДокументПланирования = ДвиженияДоставкиПервичные.ДокументПланирования
	|			И ДвиженияДоставкиРейс.Номенклатура = ДвиженияДоставкиПервичные.Номенклатура
	|			И ДвиженияДоставкиРейс.Характеристика = ДвиженияДоставкиПервичные.Характеристика
	|			И ДвиженияДоставкиРейс.Серия = ДвиженияДоставкиПервичные.Серия
	|			И ДвиженияДоставкиРейс.КодСтроки = ДвиженияДоставкиПервичные.КодСтроки
	|			И ДвиженияДоставкиПервичные.ПервичнаяЗапись = ИСТИНА
	|ГДЕ
	|	ДвиженияДоставкаИзменение.КодСтроки = 0
	|	И ДвиженияДоставкиОрдер.Регистратор ЕСТЬ NULL";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОборотыСборкиПоОрдеру()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Доставка.Распоряжение КАК Распоряжение,
	|	Доставка.Номенклатура КАК Номенклатура,
	|	Доставка.Характеристика КАК Характеристика,
	|	Доставка.Серия КАК Серия,
	|	Доставка.Назначение КАК Назначение,
	|	Доставка.Рейс КАК Рейс,
	|	СУММА(Доставка.ЗапланированаСборка) КАК ЗапланированаСборкаОборот,
	|	СУММА(Доставка.Собирается) КАК СобираетсяОборот,
	|	СУММА(Доставка.Собрано) КАК СобраноОборот
	|ПОМЕСТИТЬ ВТ_ОборотыСборкиПоОрдеру
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПервичныеЗаписиДоставки.Распоряжение КАК Распоряжение,
	|		ПервичныеЗаписиДоставки.Номенклатура КАК Номенклатура,
	|		ПервичныеЗаписиДоставки.Характеристика КАК Характеристика,
	|		ПервичныеЗаписиДоставки.Серия КАК Серия,
	|		ПервичныеЗаписиДоставки.Назначение КАК Назначение,
	|		ПервичныеЗаписиДоставки.Рейс КАК Рейс
	|	ИЗ
	|		ВТ_ПервичныеЗаписиДоставки КАК ПервичныеЗаписиДоставки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДвиженияДоставкиОрдер.Распоряжение,
	|		ДвиженияДоставкиОрдер.Номенклатура,
	|		ДвиженияДоставкиОрдер.Характеристика,
	|		ДвиженияДоставкиОрдер.Серия,
	|		ДвиженияДоставкиОрдер.Назначение,
	|		ДвиженияДоставкиОрдер.Рейс
	|	ИЗ
	|		ДвиженияДоставкаИзменение КАК ДвиженияДоставкаИзменение
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК Склады
	|			ПО ДвиженияДоставкаИзменение.Отправитель = Склады.Склад
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДвиженияДоставкиОрдер
	|			ПО ДвиженияДоставкаИзменение.Распоряжение = ДвиженияДоставкиОрдер.Распоряжение
	|				И ДвиженияДоставкаИзменение.Номенклатура = ДвиженияДоставкиОрдер.Номенклатура
	|				И ДвиженияДоставкаИзменение.Характеристика = ДвиженияДоставкиОрдер.Характеристика
	|				И ДвиженияДоставкаИзменение.Серия = ДвиженияДоставкиОрдер.Серия
	|				И ДвиженияДоставкаИзменение.Рейс = ДвиженияДоставкиОрдер.Рейс
	|				И (ДвиженияДоставкиОрдер.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервичныеЗаписиДоставки КАК ПервичныеЗаписиДоставки
	|			ПО (ДвиженияДоставкиОрдер.Распоряжение = ПервичныеЗаписиДоставки.Распоряжение)
	|				И (ДвиженияДоставкиОрдер.Номенклатура = ПервичныеЗаписиДоставки.Номенклатура)
	|				И (ДвиженияДоставкиОрдер.Характеристика = ПервичныеЗаписиДоставки.Характеристика)
	|				И (ДвиженияДоставкиОрдер.Серия = ПервичныеЗаписиДоставки.Серия)
	|				И (ДвиженияДоставкиОрдер.Рейс = ПервичныеЗаписиДоставки.Рейс)
	|				И (ДвиженияДоставкиОрдер.Назначение = ПервичныеЗаписиДоставки.Назначение)
	|	ГДЕ
	|		ПервичныеЗаписиДоставки.КодСтроки ЕСТЬ NULL) КАК ПервичныеЗаписиДоставкиБезКодаСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК Доставка
	|		ПО ПервичныеЗаписиДоставкиБезКодаСтроки.Распоряжение = Доставка.Распоряжение
	|			И ПервичныеЗаписиДоставкиБезКодаСтроки.Номенклатура = Доставка.Номенклатура
	|			И ПервичныеЗаписиДоставкиБезКодаСтроки.Характеристика = Доставка.Характеристика
	|			И ПервичныеЗаписиДоставкиБезКодаСтроки.Серия = Доставка.Серия
	|			И ПервичныеЗаписиДоставкиБезКодаСтроки.Назначение = Доставка.Назначение
	|			И ПервичныеЗаписиДоставкиБезКодаСтроки.Рейс = Доставка.Рейс
	|
	|СГРУППИРОВАТЬ ПО
	|	Доставка.Распоряжение,
	|	Доставка.Номенклатура,
	|	Доставка.Характеристика,
	|	Доставка.Серия,
	|	Доставка.Назначение,
	|	Доставка.Рейс";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОборотыКСборкеПоРейсу()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Распоряжение КАК Распоряжение,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Серия КАК Серия,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Назначение КАК Назначение,
	|	ВложенныйЗапрос.Рейс КАК Рейс,
	|	СУММА(ВложенныйЗапрос.КСборкеОборот) КАК КСборкеОборот,
	|	СУММА(ВложенныйЗапрос.ВПутиОборот) КАК ВПутиОборот,
	|	СУММА(ВложенныйЗапрос.ДоставленоОборот) КАК ДоставленоОборот
	|ПОМЕСТИТЬ ВТ_ОборотыКСборкеПоРейсу
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоставкаОбороты.Распоряжение КАК Распоряжение,
	|		ДоставкаОбороты.Номенклатура КАК Номенклатура,
	|		ДоставкаОбороты.Характеристика КАК Характеристика,
	|		ДоставкаОбороты.Серия КАК Серия,
	|		ДоставкаОбороты.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЕСТЬNULL(ПервичныеЗаписиДоставки.Назначение, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение,
	|		ДоставкаОбороты.Рейс КАК Рейс,
	|		ДоставкаОбороты.КСборкеОборот КАК КСборкеОборот,
	|		ДоставкаОбороты.ВПутиОборот КАК ВПутиОборот,
	|		ДоставкаОбороты.ДоставленоОборот КАК ДоставленоОборот
	|	ИЗ
	|		РегистрНакопления.Доставка.Обороты(
	|				,
	|				,
	|				,
	|				Плечо = 1
	|					И ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипыДоставки.Исходящая)
	|					И Отправитель В
	|						(ВЫБРАТЬ
	|							Склады.Склад КАК Склад
	|						ИЗ
	|							ВТ_Склады КАК Склады)
	|					И НЕ ДокументПланирования ССЫЛКА Документ.ЗаказНаДоставку
	|					И (Распоряжение, ДокументПланирования, Рейс, Номенклатура, Характеристика, Серия, КодСтроки) В
	|						(ВЫБРАТЬ
	|							Таблица.Распоряжение КАК Распоряжение,
	|							Таблица.ДокументПланирования КАК ДокументПланирования,
	|							Таблица.Рейс КАК Рейс,
	|							Таблица.Номенклатура КАК Номенклатура,
	|							Таблица.Характеристика КАК Характеристика,
	|							Таблица.Серия КАК Серия,
	|							Таблица.КодСтроки КАК КодСтроки
	|						ИЗ
	|							ВТ_ПервичныеЗаписиДоставки КАК Таблица
	|						ГДЕ
	|							Таблица.ДокументПланирования <> НЕОПРЕДЕЛЕНО)) КАК ДоставкаОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервичныеЗаписиДоставки КАК ПервичныеЗаписиДоставки
	|			ПО ДоставкаОбороты.Распоряжение = ПервичныеЗаписиДоставки.Распоряжение
	|				И ДоставкаОбороты.ДокументПланирования = ПервичныеЗаписиДоставки.ДокументПланирования
	|				И ДоставкаОбороты.Номенклатура = ПервичныеЗаписиДоставки.Номенклатура
	|				И ДоставкаОбороты.Характеристика = ПервичныеЗаписиДоставки.Характеристика
	|				И ДоставкаОбороты.Серия = ПервичныеЗаписиДоставки.Серия
	|				И ДоставкаОбороты.КодСтроки = ПервичныеЗаписиДоставки.КодСтроки
	|				И ДоставкаОбороты.Рейс = ПервичныеЗаписиДоставки.Рейс
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДоставкаОбороты.Распоряжение,
	|		ДоставкаОбороты.Номенклатура,
	|		ДоставкаОбороты.Характеристика,
	|		ДоставкаОбороты.Серия,
	|		ДоставкаОбороты.Номенклатура.ЕдиницаИзмерения,
	|		ЕСТЬNULL(ПервичныеЗаписиДоставки.Назначение, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)),
	|		ДоставкаОбороты.Рейс,
	|		ДоставкаОбороты.КСборкеОборот,
	|		ДоставкаОбороты.ВПутиОборот КАК ВПутиОборот,
	|		ДоставкаОбороты.ДоставленоОборот КАК ДоставленоОборот
	|	ИЗ
	|		РегистрНакопления.Доставка.Обороты(
	|				,
	|				,
	|				,
	|				Плечо = 1
	|					И ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипыДоставки.Исходящая)
	|					И Отправитель В
	|						(ВЫБРАТЬ
	|							Склады.Склад КАК Склад
	|						ИЗ
	|							ВТ_Склады КАК Склады)
	|					И ДокументПланирования ССЫЛКА Документ.ЗаказНаДоставку
	|					И (Распоряжение, Рейс, Номенклатура, Характеристика, Серия, КодСтроки) В
	|						(ВЫБРАТЬ
	|							Таблица.Распоряжение КАК Распоряжение,
	|							Таблица.Рейс КАК Рейс,
	|							Таблица.Номенклатура КАК Номенклатура,
	|							Таблица.Характеристика КАК Характеристика,
	|							Таблица.Серия КАК Серия,
	|							Таблица.КодСтроки КАК КодСтроки
	|						ИЗ
	|							ВТ_ПервичныеЗаписиДоставки КАК Таблица
	|						ГДЕ
	|							Таблица.ДокументПланирования = НЕОПРЕДЕЛЕНО)) КАК ДоставкаОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервичныеЗаписиДоставки КАК ПервичныеЗаписиДоставки
	|			ПО ДоставкаОбороты.Распоряжение = ПервичныеЗаписиДоставки.Распоряжение
	|				И (ПервичныеЗаписиДоставки.ДокументПланирования = НЕОПРЕДЕЛЕНО)
	|				И ДоставкаОбороты.Номенклатура = ПервичныеЗаписиДоставки.Номенклатура
	|				И ДоставкаОбороты.Характеристика = ПервичныеЗаписиДоставки.Характеристика
	|				И ДоставкаОбороты.Серия = ПервичныеЗаписиДоставки.Серия
	|				И ДоставкаОбороты.КодСтроки = ПервичныеЗаписиДоставки.КодСтроки
	|				И ДоставкаОбороты.Рейс = ПервичныеЗаписиДоставки.Рейс) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Распоряжение,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Серия,
	|	ВложенныйЗапрос.Назначение,
	|	ВложенныйЗапрос.Рейс,
	|	ВложенныйЗапрос.ЕдиницаИзмерения";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаКонтроляКоличестваСборкиПоРейсу(ВыражениеДопустимоеОтклонение, КонтролироватьОтклонениеМерныхТоваров)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОборотыКСборкеПоРейсу.Распоряжение КАК Распоряжение,
	|	ОборотыКСборкеПоРейсу.Номенклатура КАК Номенклатура,
	|	ОборотыКСборкеПоРейсу.Характеристика КАК Характеристика,
	|	ОборотыКСборкеПоРейсу.Серия КАК Серия,
	|	ОборотыКСборкеПоРейсу.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОборотыКСборкеПоРейсу.Назначение КАК Назначение,
	|	ОборотыКСборкеПоРейсу.Рейс КАК Рейс,
	|	-1 * (ОборотыКСборкеПоРейсу.КСборкеОборот - ЕСТЬNULL(ОборотыСборкиПоОрдеру.ЗапланированаСборкаОборот, 0)
	|		- ЕСТЬNULL(ОборотыСборкиПоОрдеру.СобираетсяОборот, 0) - ЕСТЬNULL(ОборотыСборкиПоОрдеру.СобраноОборот, 0)) КАК Превышение
	|ИЗ
	|	ВТ_ОборотыКСборкеПоРейсу КАК ОборотыКСборкеПоРейсу
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОборотыСборкиПоОрдеру КАК ОборотыСборкиПоОрдеру
	|			ПО ОборотыКСборкеПоРейсу.Распоряжение = ОборотыСборкиПоОрдеру.Распоряжение
	|				И ОборотыКСборкеПоРейсу.Номенклатура = ОборотыСборкиПоОрдеру.Номенклатура
	|				И ОборотыКСборкеПоРейсу.Характеристика = ОборотыСборкиПоОрдеру.Характеристика
	|				И ОборотыКСборкеПоРейсу.Серия = ОборотыСборкиПоОрдеру.Серия
	|				И ОборотыКСборкеПоРейсу.Назначение = ОборотыСборкиПоОрдеру.Назначение
	|				И ОборотыКСборкеПоРейсу.Рейс = ОборотыСборкиПоОрдеру.Рейс
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДопустимыеОтклоненияОстатковДоставки КАК ДопустимыеОтклоненияОстатковДоставки ПО ИСТИНА
	|ГДЕ
	|	ОборотыКСборкеПоРейсу.КСборкеОборот - ЕСТЬNULL(ОборотыСборкиПоОрдеру.ЗапланированаСборкаОборот, 0)
	|		- ЕСТЬNULL(ОборотыСборкиПоОрдеру.СобираетсяОборот, 0) - ЕСТЬNULL(ОборотыСборкиПоОрдеру.СобраноОборот, 0) + &ВыражениеДопустимоеОтклонение < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОборотыСборкиПоОрдеру.Распоряжение КАК Распоряжение,
	|	ОборотыСборкиПоОрдеру.Номенклатура КАК Номенклатура,
	|	ОборотыСборкиПоОрдеру.Характеристика КАК Характеристика,
	|	ОборотыСборкиПоОрдеру.Серия КАК Серия,
	|	ОборотыСборкиПоОрдеру.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОборотыСборкиПоОрдеру.Назначение КАК Назначение,
	|	ОборотыСборкиПоОрдеру.Рейс КАК Рейс,
	|	-1 * (0 - ОборотыСборкиПоОрдеру.ЗапланированаСборкаОборот
	|		- ОборотыСборкиПоОрдеру.СобираетсяОборот - ОборотыСборкиПоОрдеру.СобраноОборот) КАК Превышение
	|ИЗ
	|	ВТ_ОборотыСборкиПоОрдеру КАК ОборотыСборкиПоОрдеру
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОборотыКСборкеПоРейсу КАК ОборотыКСборкеПоРейсу
	|			ПО ОборотыСборкиПоОрдеру.Распоряжение = ОборотыКСборкеПоРейсу.Распоряжение
	|				И ОборотыСборкиПоОрдеру.Номенклатура = ОборотыКСборкеПоРейсу.Номенклатура
	|				И ОборотыСборкиПоОрдеру.Характеристика = ОборотыКСборкеПоРейсу.Характеристика
	|				И ОборотыСборкиПоОрдеру.Серия = ОборотыКСборкеПоРейсу.Серия
	|				И ОборотыСборкиПоОрдеру.Назначение = ОборотыКСборкеПоРейсу.Назначение
	|				И ОборотыСборкиПоОрдеру.Рейс = ОборотыКСборкеПоРейсу.Рейс
	|ГДЕ
	|	ОборотыКСборкеПоРейсу.КСборкеОборот ЕСТЬ NULL
	|	И (ОборотыСборкиПоОрдеру.ЗапланированаСборкаОборот + ОборотыСборкиПоОрдеру.СобираетсяОборот + ОборотыСборкиПоОрдеру.СобраноОборот) > 0";
	
	Если КонтролироватьОтклонениеМерныхТоваров Тогда
		
		СоединениеДопустимыеОтклонения =
		"ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопустимыеОтклоненияКСборке КАК ДопустимыеОтклоненияОстатковДоставки
		|ПО ОборотыКСборкеПоРейсу.Распоряжение = ДопустимыеОтклоненияОстатковДоставки.Распоряжение
		|	И ОборотыКСборкеПоРейсу.Номенклатура = ДопустимыеОтклоненияОстатковДоставки.Номенклатура
		|	И ОборотыКСборкеПоРейсу.Характеристика = ДопустимыеОтклоненияОстатковДоставки.Характеристика
		|	И ОборотыКСборкеПоРейсу.Серия = ДопустимыеОтклоненияОстатковДоставки.Серия
		|	И ОборотыКСборкеПоРейсу.Назначение = ДопустимыеОтклоненияОстатковДоставки.Назначение";
		
	Иначе
		
		СоединениеДопустимыеОтклонения = "";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"ЛЕВОЕ СОЕДИНЕНИЕ ДопустимыеОтклоненияОстатковДоставки КАК ДопустимыеОтклоненияОстатковДоставки ПО ИСТИНА",
		СоединениеДопустимыеОтклонения);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыражениеДопустимоеОтклонение", ВыражениеДопустимоеОтклонение);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаКонтроляСтатусовРейса(ВыражениеДопустимоеОтклонение, КонтролироватьОтклонениеМерныхТоваров)
	
	Если НЕ КонтролироватьОтклонениеМерныхТоваров Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДоставкаОбороты.Распоряжение КАК Распоряжение,
		|	ДоставкаОбороты.Рейс КАК Рейс,
		|	ДоставкаОбороты.Отправитель КАК Отправитель,
		|	ДоставкаОбороты.Номенклатура КАК Номенклатура,
		|	ДоставкаОбороты.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ДоставкаОбороты.Характеристика КАК Характеристика,
		|	ДоставкаОбороты.Серия КАК Серия,
		|	(ДоставкаОбороты.СобраноОборот - ДоставкаОбороты.КСборкеОборот) КАК Превышение
		|ИЗ
		|	РегистрНакопления.Доставка.Обороты(
		|			,
		|			,
		|			,
		|			Плечо = 1
		|				И ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипыДоставки.Исходящая)
		|				И Отправитель В
		|					(ВЫБРАТЬ
		|						Склады.Склад КАК Склад
		|					ИЗ
		|						ВТ_Склады КАК Склады)
		|				И (Распоряжение, Рейс, Номенклатура, Характеристика, Серия) В
		|					(ВЫБРАТЬ
		|						Таблица.Распоряжение КАК Распоряжение,
		|						Таблица.Рейс КАК Рейс,
		|						Таблица.Номенклатура КАК Номенклатура,
		|						Таблица.Характеристика КАК Характеристика,
		|						Таблица.Серия КАК Серия
		|					ИЗ
		|						ДвиженияДоставкаИзменение КАК Таблица)) КАК ДоставкаОбороты
		|ГДЕ
		|	ДоставкаОбороты.КСборкеОборот <> ДоставкаОбороты.СобраноОборот
		|	И (ДоставкаОбороты.ВПутиОборот > 0
		|			ИЛИ ДоставкаОбороты.ДоставленоОборот > 0)";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ОборотыКСборкеПоРейсу.Распоряжение КАК Распоряжение,
		|	ОборотыКСборкеПоРейсу.Номенклатура КАК Номенклатура,
		|	ОборотыКСборкеПоРейсу.Характеристика КАК Характеристика,
		|	ОборотыКСборкеПоРейсу.Серия КАК Серия,
		|	ОборотыКСборкеПоРейсу.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ОборотыКСборкеПоРейсу.Назначение КАК Назначение,
		|	ОборотыКСборкеПоРейсу.Рейс КАК Рейс,
		|	(ЕСТЬNULL(ОборотыСборкиПоОрдеру.СобраноОборот, 0) - ОборотыКСборкеПоРейсу.КСборкеОборот) КАК Превышение
		|ИЗ
		|	ВТ_ОборотыКСборкеПоРейсу КАК ОборотыКСборкеПоРейсу
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОборотыСборкиПоОрдеру КАК ОборотыСборкиПоОрдеру
		|			ПО ОборотыКСборкеПоРейсу.Распоряжение = ОборотыСборкиПоОрдеру.Распоряжение
		|				И ОборотыКСборкеПоРейсу.Номенклатура = ОборотыСборкиПоОрдеру.Номенклатура
		|				И ОборотыКСборкеПоРейсу.Характеристика = ОборотыСборкиПоОрдеру.Характеристика
		|				И ОборотыКСборкеПоРейсу.Серия = ОборотыСборкиПоОрдеру.Серия
		|				И ОборотыКСборкеПоРейсу.Назначение = ОборотыСборкиПоОрдеру.Назначение
		|				И ОборотыКСборкеПоРейсу.Рейс = ОборотыСборкиПоОрдеру.Рейс
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопустимыеОтклоненияКСборке КАК ДопустимыеОтклоненияОстатковДоставки
		|			ПО ОборотыКСборкеПоРейсу.Распоряжение = ДопустимыеОтклоненияОстатковДоставки.Распоряжение
		|				И ОборотыКСборкеПоРейсу.Номенклатура = ДопустимыеОтклоненияОстатковДоставки.Номенклатура
		|				И ОборотыКСборкеПоРейсу.Характеристика = ДопустимыеОтклоненияОстатковДоставки.Характеристика
		|				И ОборотыКСборкеПоРейсу.Серия = ДопустимыеОтклоненияОстатковДоставки.Серия
		|				И ОборотыКСборкеПоРейсу.Назначение = ДопустимыеОтклоненияОстатковДоставки.Назначение
		|ГДЕ
		|	((ОборотыКСборкеПоРейсу.КСборкеОборот - ЕСТЬNULL(ОборотыСборкиПоОрдеру.СобраноОборот, 0)) > &ВыражениеДопустимоеОтклонение
		|		ИЛИ ЕСТЬNULL(ОборотыСборкиПоОрдеру.ЗапланированаСборкаОборот, 0) <> 0
		|		ИЛИ ЕСТЬNULL(ОборотыСборкиПоОрдеру.СобираетсяОборот, 0) <> 0)
		|	И (ОборотыКСборкеПоРейсу.ВПутиОборот > 0
		|		ИЛИ ОборотыКСборкеПоРейсу.ДоставленоОборот > 0)";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыражениеДопустимоеОтклонение", ВыражениеДопустимоеОтклонение);
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПредставленияПолейРезультатовКонтроля(СтрокаОшибки)
	
	Результат = Новый Структура;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаОшибки, "Назначение") Тогда
		
		ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
			СтрокаОшибки.Номенклатура, СтрокаОшибки.Характеристика,, СтрокаОшибки.Серия, СтрокаОшибки.Назначение);
		
	Иначе
		
		ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
			СтрокаОшибки.Номенклатура, СтрокаОшибки.Характеристика,, СтрокаОшибки.Серия);
		
	КонецЕсли;
	Результат.Вставить("Номенклатура", ПредставлениеНоменклатуры);
	
	ПредставлениеРаспоряжения = Строка(СтрокаОшибки.Распоряжение);
	Результат.Вставить("Распоряжение", ПредставлениеРаспоряжения);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаОшибки, "Отправитель") Тогда
		ПредставлениеОтправителя = Строка(СтрокаОшибки.Отправитель);
	Иначе
		ПредставлениеОтправителя = "";
	КонецЕсли;
	Результат.Вставить("Отправитель", ПредставлениеОтправителя);
	
	ПредставлениеПревышение = Строка(СтрокаОшибки.Превышение);
	Результат.Вставить("Превышение", ПредставлениеПревышение);
	
	ПредставлениеЕдиницаИзмерения = Строка(СтрокаОшибки.ЕдиницаИзмерения);
	Результат.Вставить("ЕдиницаИзмерения", ПредставлениеЕдиницаИзмерения);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаОшибки, "Организация") Тогда
		ПредставлениеОрганизации = Строка(СтрокаОшибки.Организация);
	Иначе
		ПредставлениеОрганизации = "";
	КонецЕсли;
	Результат.Вставить("Организация", ПредставлениеОрганизации);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаОшибки, "Получатель") Тогда
		ПредставлениеПолучателя = Строка(СтрокаОшибки.Получатель);
	Иначе
		ПредставлениеПолучателя = "";
	КонецЕсли;
	Результат.Вставить("Получатель", ПредставлениеПолучателя);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаОшибки, "Рейс") Тогда
		ПредставлениеРейса = Строка(СтрокаОшибки.Рейс);
	Иначе
		ПредставлениеРейса = "";
	КонецЕсли;
	Результат.Вставить("Рейс", ПредставлениеРейса);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область УправлениеДоступом

Процедура ДобавитьПрофильМенеджерПоДоставке(ОписанияПрофилей, ПараметрыОбновления)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя = "МенеджерПоДоставке";
	ОписаниеПрофиля.Идентификатор = "d3e34937-0a73-4468-8105-8f9ab0e311ac";
	ОписаниеПрофиля.Родитель = "Прочее";
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Менеджер по доставке'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетовКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузокТоваровКлиентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПослеПеремещения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровНаСклад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаЗакупку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаОбеспечение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");
	
	// Добавление.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаДоставки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТочекДоставки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗонДоставки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаДоставку");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРейсов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровБПО");
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПечатьЭтикетокИЦенников");
	
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиМенеджераПоДоставке(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется создание и редактирование зон доставки,
										|создание и редактирование транспортных средств, типов транспортных средств,
										|создание и обработка Заданий на перевозку,
										|работа в обработке Рабочее место менеджера по доставке'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

#Область Доставка20

Процедура ДополнитьТекстЗапросаУправленияОтгрузкойДаннымиДоставки20(Запрос, ТекстЗапроса)
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СостоянияИРеквизитыДоставки.Распоряжение КАК ДокументОтгрузки,
	|	СостоянияИРеквизитыДоставки.ПолучательОтправитель КАК Получатель
	|ПОМЕСТИТЬ ВТРаспоряженияСДоставкойПоЗаданиям
	|ИЗ
	|	РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ОтказОтПеревозки
	|		ПО (ОтказОтПеревозки.ЗаданиеНаПеревозку = ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка))
	|			И СостоянияИРеквизитыДоставки.Склад = ОтказОтПеревозки.Склад
	|			И (ОтказОтПеревозки.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение)
	|ГДЕ
	|	СостоянияИРеквизитыДоставки.Склад = &Склад
	|	И СостоянияИРеквизитыДоставки.СпособДоставки В(&СпособыДоставки)
	|	И ОтказОтПеревозки.Распоряжение ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ВложенныйЗапрос.Получатель КАК Получатель,
	|	МИНИМУМ(ВложенныйЗапрос.Состояние) КАК Состояние
	|ПОМЕСТИТЬ ВТРаспоряженияКОтгрузке
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	|		РаспоряженияКОтгрузке.Получатель КАК Получатель,
	|		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
	|		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
	|		РаспоряженияКОтгрузке.Назначение КАК Назначение,
	|		РаспоряженияКОтгрузке.Серия КАК Серия,
	|		ВЫБОР
	|			КОГДА &ОжидаетсяОтбор
	|				ТОГДА 0
	|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
	|				ТОГДА 1
	|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|				ТОГДА 2
	|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
	|				ТОГДА 3
	|			ИНАЧЕ 404
	|		КОНЕЦ КАК Состояние
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.Остатки(&ДатаОтгрузки, Склад = &Склад) КАК РаспоряженияКОтгрузке
	|	ГДЕ &УсловиеТоварыКОтбору) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ДокументОтгрузки,
	|	ВложенныйЗапрос.Получатель
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК Ссылка,
	|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Распоряжение,
	|	ЗаданиеНаПеревозкуРаспоряжения.ПолучательОтправитель КАК ПолучательОтправитель
	|ПОМЕСТИТЬ ВТОтборЗаданияНаПеревозку
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|ГДЕ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен
	|	И ЗаданиеНаПеревозкуРаспоряжения.Склад = &Склад
	|	И ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийНаПеревозку.КПогрузке))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТИПЗНАЧЕНИЯ(ЗаданияНаПеревозку.Ссылка) КАК ТипДокумента,
	|	ЗаданияНаПеревозку.Ссылка КАК Распоряжение,
	|	ЗаданияНаПеревозку.Ссылка КАК ЗаданиеНаПеревозку,
	|	ЗаданияНаПеревозку.Ссылка.Номер КАК Номер,
	|	ЗаданияНаПеревозку.Ссылка.ДатаВремяРейсаПланС КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Получатель,
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ КАК Состояние,
	|	1 КАК ИндексКартинки
	|ИЗ
	|	ВТОтборЗаданияНаПеревозку КАК ЗаданияНаПеревозку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРаспоряженияКОтгрузке КАК ВТРаспоряженияКОтгрузке
	|		ПО (ВТРаспоряженияКОтгрузке.ДокументОтгрузки = ЗаданияНаПеревозку.Распоряжение)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданияНаПеревозку.Ссылка,
	|	ЗаданияНаПеревозку.Ссылка.Номер,
	|	ЗаданияНаПеревозку.Ссылка.ДатаВремяРейсаПланС
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		КОГДА МИНИМУМ(ВТРаспоряженияКОтгрузке.Состояние) = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ В (&Состояния)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТИПЗНАЧЕНИЯ(РаспоряженияКОтгрузке.ДокументОтгрузки)
	|,
	|	РаспоряженияКОтгрузке.ДокументОтгрузки,
	|	ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка),
	|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """"),
	|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)),
	|	РаспоряженияКОтгрузке.Получатель,
	|	ВЫБОР
	|		КОГДА РаспоряженияКОтгрузке.Состояние = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА РаспоряженияКОтгрузке.Состояние = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА РаспоряженияКОтгрузке.Состояние = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		КОГДА РаспоряженияКОтгрузке.Состояние = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	ВТРаспоряженияКОтгрузке КАК РаспоряженияКОтгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО РаспоряженияКОтгрузке.ДокументОтгрузки = РеестрДокументов.Ссылка
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспоряженияСДоставкойПоЗаданиям КАК ВТРаспоряженияСДоставкойПоЗаданиям
	|		ПО РаспоряженияКОтгрузке.ДокументОтгрузки = ВТРаспоряженияСДоставкойПоЗаданиям.ДокументОтгрузки
	|ГДЕ
	|	ВТРаспоряженияСДоставкойПоЗаданиям.ДокументОтгрузки ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА РаспоряженияКОтгрузке.Состояние = 0
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|			КОГДА РаспоряженияКОтгрузке.Состояние = 1
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|			КОГДА РаспоряженияКОтгрузке.Состояние = 2
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|			КОГДА РаспоряженияКОтгрузке.Состояние = 3
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|		КОНЕЦ В (&Состояния)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	СпособыДоставки = ДоставкаТоваровКлиентСервер.СпособыДоставкиДоКлиентаСНашимУчастием(
		ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками"));
	
	Запрос.УстановитьПараметр("СпособыДоставки", СпособыДоставки);
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаУправленияОтгрузкойДаннымиДоставки20ДеталиОтгрузки(ТекстЗапроса)
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.ДокументОтгрузки КАК Распоряжение,
	|	ВложенныйЗапрос.Получатель КАК Получатель,
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ КАК Состояние
	|ПОМЕСТИТЬ РаспоряженияИСостояния
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	|		РаспоряженияКОтгрузке.Получатель КАК Получатель,
	|		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
	|		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
	|		РаспоряженияКОтгрузке.Назначение КАК Назначение,
	|		РаспоряженияКОтгрузке.Серия КАК Серия,
	|		ВЫБОР
	|			КОГДА &ОжидаетсяОтбор
	|				ТОГДА 0
	|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
	|				ТОГДА 1
	|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|				ТОГДА 2
	|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
	|				ТОГДА 3
	|			ИНАЧЕ 404
	|		КОНЕЦ КАК Состояние
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.Остатки(
	|				&ДатаОтгрузки,
	|				Склад = &Склад
	|					И ДокументОтгрузки В
	|						(ВЫБРАТЬ
	|							ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК ДокументОтгрузки
	|						ИЗ
	|							Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|						ГДЕ
	|							ЗаданиеНаПеревозкуРаспоряжения.Ссылка = &ЗаданиеНаПеревозку)) КАК РаспоряженияКОтгрузке
	|	ГДЕ &УсловиеТоварыКОтбору) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ДокументОтгрузки,
	|	ВложенныйЗапрос.Получатель
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ В (&Состояния)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение)
	|	КОНЕЦ КАК ТипДокумента,
	|	3 КАК ИндексКартинки,
	|	РаспоряженияИСостояния.Распоряжение,
	|	&ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	РаспоряженияИСостояния.Получатель,
	|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """") КАК Номер,
	|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) КАК Дата,
	|	РаспоряженияИСостояния.Состояние,
	|	1 КАК Порядок
	|ИЗ
	|	РаспоряженияИСостояния КАК РаспоряженияИСостояния
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО РаспоряженияИСостояния.Распоряжение = РеестрДокументов.Ссылка
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТИПЗНАЧЕНИЯ(ЗаданиеНаПеревозку.Ссылка),
	|	2,
	|	ЗаданиеНаПеревозку.Ссылка,
	|	ЗаданиеНаПеревозку.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка),
	|	0
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
	|ГДЕ
	|	ЗаданиеНаПеревозку.Ссылка = &ЗаданиеНаПеревозку
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Дата";
	
КонецПроцедуры

Функция ТекстЗапросаЗаполненияЗаданияНаПеревозкуПоРасходнымОрдерам()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗаданияНаПеревозкуРаспоряжения.Распоряжение КАК Распоряжение,
	|	ЗаданияНаПеревозкуРаспоряжения.Склад КАК Склад,
	|	ЗаданияНаПеревозкуРаспоряжения.НомерСтроки КАК НомерСтроки,
	|	ЗаданияНаПеревозкуРаспоряжения.Вес КАК Вес,
	|	ЗаданияНаПеревозкуРаспоряжения.Объем КАК Объем,
	|	ЗаданияНаПеревозкуРаспоряжения.ДоставляетсяПолностью КАК ДоставляетсяПолностью,
	|	ЗаданияНаПеревозкуРаспоряжения.КлючСвязи КАК КлючСвязи
	|ПОМЕСТИТЬ ЗаданияНаПеревозкуРаспоряжения
	|ИЗ
	|	&ЗаданиеНаПеревозкуРаспоряжения КАК ЗаданияНаПеревозкуРаспоряжения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Распоряжение,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданияНаПеревозкуМаршрут.НомерСтроки КАК НомерСтроки,
	|	ЗаданияНаПеревозкуМаршрут.КлючСвязи КАК КлючСвязи
	|ПОМЕСТИТЬ ЗаданияНаПеревозкуМаршрут
	|ИЗ
	|	&ЗаданиеНаПеревозкуМаршрут КАК ЗаданияНаПеревозкуМаршрут
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасходныйОрдерНаТовары.Ссылка,
	|	РасходныйОрдерНаТовары.Склад
	|ПОМЕСТИТЬ ОрдераФильтр
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Проведен
	|	И РасходныйОрдерНаТовары.ОтгрузкаПоЗаданиюНаПеревозку
	|	И РасходныйОрдерНаТовары.ЗаданиеНаПеревозку = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасходныйОрдерНаТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрдеров.Номенклатура,
	|	ТоварыОрдеров.Характеристика,
	|	ТоварыОрдеров.Назначение,
	|	ТоварыОрдеров.Серия,
	|	ТоварыОрдеров.Распоряжение,
	|	СУММА(ТоварыОрдеров.Количество) КАК Количество,
	|	ОрдераФильтр.Склад
	|ПОМЕСТИТЬ ТоварыОрдеров
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК ТоварыОрдеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОрдераФильтр КАК ОрдераФильтр
	|		ПО ТоварыОрдеров.Ссылка = ОрдераФильтр.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыОрдеров.Распоряжение,
	|	ТоварыОрдеров.Назначение,
	|	ТоварыОрдеров.Характеристика,
	|	ТоварыОрдеров.Номенклатура,
	|	ТоварыОрдеров.Серия,
	|	ОрдераФильтр.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение,
	|	ОрдераФильтр.Склад
	|ПОМЕСТИТЬ РаспоряженияВОрдерах
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОрдераФильтр КАК ОрдераФильтр
	|		ПО (ОрдераФильтр.Ссылка = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузке.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузке.Назначение КАК Назначение,
	|	ТоварыКОтгрузке.Склад КАК Склад,
	|	ТоварыКОтгрузке.Серия КАК Серия,
	|	ТоварыКОтгрузке.Получатель КАК Получатель,
	|	ТоварыКОтгрузке.КОтгрузкеПриход КАК КОтгрузкеПриход,
	|	ТоварыОрдеров.Распоряжение КАК Распоряжение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыОрдеров.Количество, 0) > ТоварыКОтгрузке.КОтгрузкеПриход
	|			ТОГДА ТоварыКОтгрузке.КОтгрузкеПриход
	|		ИНАЧЕ ТоварыОрдеров.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыОрдеров.Количество, 0) > ТоварыКОтгрузке.КОтгрузкеПриход
	|			ТОГДА ТоварыКОтгрузке.КОтгрузкеПриход * &ТекстЗапросаВесУпаковки
	|		ИНАЧЕ ТоварыОрдеров.Количество * &ТекстЗапросаВесУпаковки
	|	КОНЕЦ КАК Вес,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыОрдеров.Количество, 0) > ТоварыКОтгрузке.КОтгрузкеПриход
	|			ТОГДА ТоварыКОтгрузке.КОтгрузкеПриход * &ТекстЗапросаОбъемУпаковки
	|		ИНАЧЕ ТоварыОрдеров.Количество * &ТекстЗапросаОбъемУпаковки
	|	КОНЕЦ КАК Объем
	|ПОМЕСТИТЬ ТоварыОрдеровИКОтгрузке
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Обороты(
	|			,
	|			,
	|			,
	|			(ДокументОтгрузки, Склад) В
	|				(ВЫБРАТЬ
	|					РаспоряженияВОрдерах.Распоряжение,
	|					РаспоряженияВОрдерах.Склад
	|				ИЗ
	|					РаспоряженияВОрдерах)) КАК ТоварыКОтгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОрдеров КАК ТоварыОрдеров
	|		ПО ТоварыКОтгрузке.ДокументОтгрузки = ТоварыОрдеров.Распоряжение
	|			И ТоварыКОтгрузке.Склад = ТоварыОрдеров.Склад
	|			И ТоварыКОтгрузке.Номенклатура = ТоварыОрдеров.Номенклатура
	|			И ТоварыКОтгрузке.Характеристика = ТоварыОрдеров.Характеристика
	|			И ТоварыКОтгрузке.Назначение = ТоварыОрдеров.Назначение
	|			И ТоварыКОтгрузке.Серия = ТоварыОрдеров.Серия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО (СправочникНоменклатура.Ссылка = ТоварыКОтгрузке.Номенклатура)
	|ГДЕ
	|	ТоварыКОтгрузке.КОтгрузкеПриход > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрдеровИКОтгрузке.Склад,
	|	ТоварыОрдеровИКОтгрузке.Распоряжение,
	|	ТоварыОрдеровИКОтгрузке.Получатель,
	|	СУММА(ТоварыОрдеровИКОтгрузке.Вес) КАК Вес,
	|	СУММА(ТоварыОрдеровИКОтгрузке.Объем) КАК Объем
	|ПОМЕСТИТЬ ВесОбъемПоРаспоряжениям
	|ИЗ
	|	ТоварыОрдеровИКОтгрузке КАК ТоварыОрдеровИКОтгрузке
	|ГДЕ
	|	ТоварыОрдеровИКОтгрузке.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыОрдеровИКОтгрузке.Склад,
	|	ТоварыОрдеровИКОтгрузке.Распоряжение,
	|	ТоварыОрдеровИКОтгрузке.Получатель" + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("СправочникНоменклатура.ЕдиницаИзмерения", "СправочникНоменклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("СправочникНоменклатура.ЕдиницаИзмерения", "СправочникНоменклатура"));
	
	ШаблонТекстаЗапросаПоРаспоряжению =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаспоряженияНаДоставку.Ссылка КАК Ссылка,
	|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Ссылка) КАК ВидРаспоряжения,
	|	РаспоряженияНаДоставку.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА РаспоряженияНаДоставку.СпособДоставки = &ДоставкаСиламиПеревозчикаПоАдресу
	|			ТОГДА РаспоряженияНаДоставку.АдресДоставкиПеревозчика
	|		ИНАЧЕ РаспоряженияНаДоставку.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
	|	РаспоряженияНаДоставку.ЗонаДоставки КАК ЗонаДоставки,
	|	РаспоряженияНаДоставку.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	ВЫБОР
	|		КОГДА РаспоряженияНаДоставку.СпособДоставки = &ДоставкаСиламиПеревозчикаПоАдресу
	|			ТОГДА РаспоряженияНаДоставку.АдресДоставкиПеревозчикаЗначенияПолей
	|		ИНАЧЕ РаспоряженияНаДоставку.АдресДоставкиЗначенияПолей
	|	КОНЕЦ КАК АдресДоставкиЗначенияПолей,
	|	РаспоряженияНаДоставку.ВремяДоставкиС КАК ВремяДоставкиС,
	|	РаспоряженияНаДоставку.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	РаспоряженияНаДоставку.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке
	|ИЗ
	|	Документ.ЗаказКлиента КАК РаспоряженияНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияВОрдерах КАК РаспоряженияВОрдерах
	|		ПО (РаспоряженияВОрдерах.Распоряжение = РаспоряженияНаДоставку.Ссылка)
	|ГДЕ
	|	РаспоряженияНаДоставку.СпособДоставки В(&СпособыДоставки)
	|	И РаспоряженияНаДоставку.Проведен";
	
	ЭтоПервый = Истина;
	
	Для Каждого ТипРаспоряжениеНаДоставку Из Метаданные.ОпределяемыеТипы.РаспоряжениеНаДоставку.Тип.Типы() Цикл
		
		// Текст запроса собирается по документам, а не по регистру СостоянияИРеквизитыДоставки,
		// чтобы поддержать перезаполнение закрытых заданий,
		// т.к. данные регистра по распоряжениям очищаются после закрытия заданий на перевозку по этим распоряжениям.
		Если ТипРаспоряжениеНаДоставку = Тип("СправочникСсылка.СоглашенияСПоставщиками")
			Или ТипРаспоряжениеНаДоставку = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Продолжить;
		КонецЕсли;
		
		МетаданныеРаспоряжения = Метаданные.НайтиПоТипу(ТипРаспоряжениеНаДоставку);
		ПолноеИмяДокумента = МетаданныеРаспоряжения.ПолноеИмя();
		ТекстЗапросаПоРаспоряжению = СтрЗаменить(ШаблонТекстаЗапросаПоРаспоряжению, "Документ.ЗаказКлиента", ПолноеИмяДокумента);
		
		Если ЭтоПервый Тогда
			ТекстЗапросаПоРаспоряжению = СтрЗаменить(ТекстЗапросаПоРаспоряжению, "КАК ДополнительнаяИнформацияПоДоставке",
				"КАК ДополнительнаяИнформацияПоДоставке
				|ПОМЕСТИТЬ РаспоряженияНаДоставку");
			
			ЭтоПервый = Ложь;
		Иначе
			ТекстЗапросаПоРаспоряжению = СтрЗаменить(ТекстЗапросаПоРаспоряжению, "РАЗРЕШЕННЫЕ", "");
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		
		Если Не ОбщегоНазначения.ЕстьРеквизитОбъекта("АдресДоставкиПеревозчика", МетаданныеРаспоряжения) Тогда
			// Не во всех распоряжениях полный состав реквизитов доставки
			ТекстЗапросаПоРаспоряжению = СтрЗаменить(ТекстЗапросаПоРаспоряжению, "АдресДоставкиПеревозчика", "АдресДоставки");
			ТекстЗапросаПоРаспоряжению = СтрЗаменить(ТекстЗапросаПоРаспоряжению, "АдресДоставкиПеревозчикаЗначенияПолей", "АдресДоставкиЗначенияПолей");
		КонецЕсли;
		Если Не ОбщегоНазначения.ЕстьРеквизитОбъекта("ЗонаДоставки", МетаданныеРаспоряжения) Тогда
			ТекстЗапросаПоРаспоряжению = СтрЗаменить(ТекстЗапросаПоРаспоряжению, "РаспоряженияНаДоставку.ЗонаДоставки", "ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяСсылка)");
		КонецЕсли;
		Если Не ОбщегоНазначения.ЕстьРеквизитОбъекта("ВремяДоставкиС", МетаданныеРаспоряжения) Тогда
			ТекстЗапросаПоРаспоряжению = СтрЗаменить(ТекстЗапросаПоРаспоряжению, "РаспоряженияНаДоставку.ВремяДоставкиС", "ДАТАВРЕМЯ(1,1,1)");
			ТекстЗапросаПоРаспоряжению = СтрЗаменить(ТекстЗапросаПоРаспоряжению, "РаспоряженияНаДоставку.ВремяДоставкиПо", "ДАТАВРЕМЯ(1,1,1)");
		КонецЕсли;
		Если Не ОбщегоНазначения.ЕстьРеквизитОбъекта("ПеревозчикПартнер", МетаданныеРаспоряжения) Тогда
			ТекстЗапросаПоРаспоряжению = СтрЗаменить(ТекстЗапросаПоРаспоряжению, "РаспоряженияНаДоставку.ПеревозчикПартнер", "ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)");
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаПоРаспоряжению;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ИНДЕКСИРОВАТЬ ПО
	|	РаспоряженияНаДоставку.Ссылка" + ОбщегоНазначения.РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	РаспоряженияУдалить.НомерСтроки КАК НомерСтроки,
	|	Маршрут.НомерСтроки КАК МаршрутНомерСтроки
	|ИЗ
	|	ЗаданияНаПеревозкуРаспоряжения КАК РаспоряженияУдалить
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВесОбъемПоРаспоряжениям КАК ВесОбъемПоРаспоряжениям
	|		ПО РаспоряженияУдалить.Распоряжение = ВесОбъемПоРаспоряжениям.Распоряжение
	|			И РаспоряженияУдалить.Склад = ВесОбъемПоРаспоряжениям.Склад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаданияНаПеревозкуМаршрут КАК Маршрут
	|		ПО (РаспоряженияУдалить.КлючСвязи = Маршрут.КлючСвязи)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СправочникСклады
	|		ПО (СправочникСклады.Ссылка = РаспоряженияУдалить.Склад)
	|			И (СправочникСклады.ИспользоватьОрдернуюСхемуПриОтгрузке)
	|			И (&ДатаВремяРейсаПланС >= СправочникСклады.ДатаНачалаОрдернойСхемыПриОтгрузке)
	|ГДЕ
	|	ВесОбъемПоРаспоряжениям.Распоряжение ЕСТЬ NULL
	|	И НЕ РаспоряженияУдалить.Распоряжение ССЫЛКА Документ.ПоручениеЭкспедитору
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияУдалить.НомерСтроки,
	|	Маршрут.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	РаспоряженияУдалить.НомерСтроки УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиМаршрутаУдалить.НомерСтроки КАК МаршрутНомерСтроки
	|ИЗ
	|	ЗаданияНаПеревозкуМаршрут КАК СтрокиМаршрутаУдалить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаданияНаПеревозкуРаспоряжения КАК ЗаданияНаПеревозкуРаспоряжения
	|		ПО (ЗаданияНаПеревозкуРаспоряжения.КлючСвязи = СтрокиМаршрутаУдалить.КлючСвязи)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВесОбъемПоРаспоряжениям КАК ВесОбъемПоРаспоряжениям
	|		ПО (ЗаданияНаПеревозкуРаспоряжения.Распоряжение = ВесОбъемПоРаспоряжениям.Распоряжение)
	|			И (ЗаданияНаПеревозкуРаспоряжения.Склад = ВесОбъемПоРаспоряжениям.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СправочникСклады
	|		ПО (СправочникСклады.Ссылка = ЗаданияНаПеревозкуРаспоряжения.Склад)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиМаршрутаУдалить.НомерСтроки
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ВесОбъемПоРаспоряжениям.Распоряжение ЕСТЬ NULL 
	|					ИЛИ НЕ СправочникСклады.ИспользоватьОрдернуюСхемуПриОтгрузке
	|					ИЛИ &ДатаВремяРейсаПланС < СправочникСклады.ДатаНачалаОрдернойСхемыПриОтгрузке
	|					ИЛИ ЗаданияНаПеревозкуРаспоряжения.Распоряжение ССЫЛКА Документ.ПоручениеЭкспедитору
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаршрутНомерСтроки УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияИзменить.НомерСтроки КАК НомерСтроки,
	|	ВесОбъемПоРаспоряжениям.Вес КАК Вес,
	|	ВесОбъемПоРаспоряжениям.Объем КАК Объем,
	|	Маршрут.НомерСтроки КАК МаршрутНомерСтроки
	|ИЗ
	|	ЗаданияНаПеревозкуРаспоряжения КАК РаспоряженияИзменить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВесОбъемПоРаспоряжениям КАК ВесОбъемПоРаспоряжениям
	|		ПО РаспоряженияИзменить.Распоряжение = ВесОбъемПоРаспоряжениям.Распоряжение
	|			И РаспоряженияИзменить.Склад = ВесОбъемПоРаспоряжениям.Склад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаданияНаПеревозкуМаршрут КАК Маршрут
	|		ПО (Маршрут.КлючСвязи = РаспоряженияИзменить.КлючСвязи)
	|ГДЕ
	|	(ВесОбъемПоРаспоряжениям.Вес <> РаспоряженияИзменить.Вес
	|			ИЛИ ВесОбъемПоРаспоряжениям.Объем <> РаспоряженияИзменить.Объем)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВесОбъемПоРаспоряжениям.Вес КАК Вес,
	|	ВесОбъемПоРаспоряжениям.Объем КАК Объем,
	|	ВесОбъемПоРаспоряжениям.Склад КАК Склад,
	|	ВесОбъемПоРаспоряжениям.Распоряжение КАК Распоряжение,
	|	НовыеРаспоряжения.ВидРаспоряжения,
	|	НовыеРаспоряжения.Номер,
	|	НовыеРаспоряжения.АдресДоставки,
	|	НовыеРаспоряжения.СпособДоставки,
	|	НовыеРаспоряжения.ЗонаДоставки,
	|	ВесОбъемПоРаспоряжениям.Получатель КАК ПолучательОтправитель,
	|	НовыеРаспоряжения.ПеревозчикПартнер,
	|	НовыеРаспоряжения.АдресДоставкиЗначенияПолей,
	|	НовыеРаспоряжения.ВремяДоставкиС КАК ВремяС,
	|	НовыеРаспоряжения.ВремяДоставкиПо КАК ВремяПо,
	|	НовыеРаспоряжения.ДополнительнаяИнформацияПоДоставке
	|ИЗ
	|	РаспоряженияНаДоставку КАК НовыеРаспоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВесОбъемПоРаспоряжениям КАК ВесОбъемПоРаспоряжениям
	|		ПО НовыеРаспоряжения.Ссылка = ВесОбъемПоРаспоряжениям.Распоряжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаданияНаПеревозкуРаспоряжения КАК ЗаданияНаПеревозкуРаспоряжения
	|		ПО (ЗаданияНаПеревозкуРаспоряжения.Распоряжение = ВесОбъемПоРаспоряжениям.Распоряжение)
	|			И (ЗаданияНаПеревозкуРаспоряжения.Склад = ВесОбъемПоРаспоряжениям.Склад)
	|ГДЕ
	|	ЗаданияНаПеревозкуРаспоряжения.Распоряжение ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКДоставке.Склад,
	|	ТоварыКДоставке.Распоряжение,
	|	ТоварыКДоставке.Получатель КАК ПолучательОтправитель,
	|	ТоварыКДоставке.Номенклатура,
	|	ТоварыКДоставке.Характеристика,
	|	ТоварыКДоставке.Назначение,
	|	ТоварыКДоставке.Серия,
	|	ЛОЖЬ КАК ВсеТовары,
	|	ТоварыКДоставке.Количество
	|ИЗ
	|	ТоварыОрдеровИКОтгрузке КАК ТоварыКДоставке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВесОбъемПоРаспоряжениям КАК ВесОбъемПоРаспоряжениям
	|		ПО (ВесОбъемПоРаспоряжениям.Склад = ТоварыКДоставке.Склад)
	|			И (ВесОбъемПоРаспоряжениям.Распоряжение = ТоварыКДоставке.Распоряжение)
	|ГДЕ
	|	ТоварыКДоставке.Количество > 0";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ЗаполнитьПризнакиОформленияРаспоряженийНижнийУровень(КоллекцияСтрокДерева)
	
	ПредыдущийАдресИлиПеревозчик = Неопределено;
	Подсвечиваем = 0;
	Для каждого Строка Из КоллекцияСтрокДерева Цикл
		Если (Строка.ПолеУпорядочения <> ПредыдущийАдресИлиПеревозчик)
			И (ПредыдущийАдресИлиПеревозчик <> Неопределено) Тогда
			Подсвечиваем = Макс(Подсвечиваем-1,-Подсвечиваем+1);
		КонецЕсли;
		Строка.ОформлениеСтроки = Подсвечиваем;
		ПредыдущийАдресИлиПеревозчик = Строка.ПолеУпорядочения;
	КонецЦикла;
	
КонецПроцедуры

// Возвращаемое значение:
// 	Структура - где:
// * ИмяПоля - Строка - Имя поля
// * Значение - ОпределяемыйТип.ОтправительПолучательДоставки
// * Представление - Строка - Представление получателя/отправителя
//
Функция ПолучательОтправитель(ДокОбъект)
	
	Заполнение = Новый Структура("Партнер,СкладПолучатель,Пункт",0,0,0);
	
	ЗаполнитьЗначенияСвойств(Заполнение,ДокОбъект);
	Если Заполнение.СкладПолучатель <> 0 Тогда
		
		Возврат Новый Структура("ИмяПоля, Значение, Представление", "СкладПолучатель", ДокОбъект.СкладПолучатель, НСтр("ru = 'Склад'"));
		
	ИначеЕсли Заполнение.Пункт <> 0 Тогда
		
		Возврат Новый Структура("ИмяПоля, Значение, Представление", "Пункт", ДокОбъект.Пункт, НСтр("ru = 'Пункт'"));
		
	ИначеЕсли Заполнение.Партнер <> 0 Тогда
		
		ПредставлениеПартнера = ?(
			ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов"),
			НСтр("ru = 'Контрагент'"),
			НСтр("ru = 'Партнер'"));
		Возврат Новый Структура("ИмяПоля, Значение, Представление", "Партнер", ДокОбъект.Партнер, ПредставлениеПартнера);
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Получатель (отправитель) не определен.'");
		
	КонецЕсли;
	
КонецФункции

Функция ИмяЭлементаАдрес(ЭлементыФормы)
	
	Если ЭлементыФормы.Найти("АдресДоставкиПолучателя") <> Неопределено Тогда
		Возврат "АдресДоставкиПолучателя";
	ИначеЕсли ЭлементыФормы.Найти("АдресДоставки") <> Неопределено Тогда
		Возврат "АдресДоставки";
	ИначеЕсли ЭлементыФормы.Найти("АдресПоставщика") <> Неопределено Тогда
		Возврат "АдресПоставщика";
	ИначеЕсли ЭлементыФормы.Найти("АдресПункта") <> Неопределено Тогда
		Возврат "АдресПункта";
	Иначе
		ВызватьИсключение НСтр("ru = 'Элемент адреса не определен'");
	КонецЕсли;
	
КонецФункции

// Заполняет реквизиты доставки по известным получателю и способу доставки
// 
// Параметры:
//  ЭлементыФормы - ВсеЭлементыФормы - все элементы формы для получения/заполнения списков выбора, управления закладками доставки.
//  ДокОбъект - ДокументОбъект - документ-объект, реквизиты которого изменяются.
//  ДопИнфоИзмененоПользователем - Булево -
//
Процедура ЗаполнитьРеквизитыПоСпособуДоставки(ЭлементыФормы, ДокОбъект, ДопИнфоИзмененоПользователем = Ложь)
	
	ПустыеРеквизиты = ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки(ДокОбъект);
	ЗаполнитьЗначенияСвойств(ДокОбъект, ПустыеРеквизиты,
		"АдресДоставкиПеревозчика, АдресДоставкиПеревозчикаЗначенияПолей, ЗонаДоставки, ВремяДоставкиС, ВремяДоставкиПо, Курьер");
	
	Если Не ДопИнфоИзмененоПользователем Тогда
		ДокОбъект.ДополнительнаяИнформацияПоДоставке = "";
	КонецЕсли;
	
	ПолучательОтправитель = ПолучательОтправитель(ДокОбъект);
	
	Если ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи Тогда
			
		Если ЭлементыФормы.Найти("ПеревозчикПартнер") <> Неопределено
			И ЭлементыФормы.ПеревозчикПартнер.СписокВыбора.Количество() > 0
			И ДокОбъект.ПеревозчикПартнер = Справочники.Партнеры.ПустаяСсылка() Тогда
			ДокОбъект.ПеревозчикПартнер = ЭлементыФормы.ПеревозчикПартнер.СписокВыбора[0].Значение;
		КонецЕсли;
		
	Иначе
		
		ДокОбъект.ПеревозчикПартнер = Справочники.Партнеры.ПустаяСсылка();
		
	КонецЕсли;
	
	ИмяЭлементаАдрес = ИмяЭлементаАдрес(ЭлементыФормы);
	
	Если ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика Тогда
		
		Если Не ДопИнфоИзмененоПользователем Тогда
			
			Если ЗначениеЗаполнено(ДокОбъект.АдресДоставки) Тогда
				НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(
					ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора, "АдресДоставки", ДокОбъект.АдресДоставки);
				Если Не НайденныйЭлементСЗ = Неопределено Тогда
					ДокОбъект.ДополнительнаяИнформацияПоДоставке = НайденныйЭлементСЗ.Значение.ДополнительнаяИнформацияПоДоставке;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента
		  ИЛИ ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки
		  ИЛИ ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада
		  ИЛИ ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуНаСклад
		  ИЛИ ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте 
		  ИЛИ ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиентаКурьером Тогда
		
		Если ЗначениеЗаполнено(ДокОбъект.АдресДоставки) Тогда
			НайденныйЭлементСЗ = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(
				ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора, "АдресДоставки", ДокОбъект.АдресДоставки);
			Если Не НайденныйЭлементСЗ = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ДокОбъект, НайденныйЭлементСЗ.Значение,
					"ЗонаДоставки, ВремяДоставкиС, ВремяДоставкиПо")
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя
		Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки Тогда
		
		Если ЭлементыФормы.АдресПоставщика.СписокВыбора.Количество() > 0 Тогда
			ПерваяСтруктураВСписке = ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора[0].Значение;
			ЗаполнитьЗначенияСвойств(ДокОбъект,ПерваяСтруктураВСписке,,"ДополнительнаяИнформацияПоДоставке");
			Если Не ДопИнфоИзмененоПользователем Тогда
				ДокОбъект.ДополнительнаяИнформацияПоДоставке = ПерваяСтруктураВСписке.ДополнительнаяИнформацияПоДоставке;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ДокОбъект.СпособДоставки)
		  ИЛИ ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз
		  ИЛИ ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада
		  ИЛИ ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада Тогда
		
		ДокОбъект.ДополнительнаяИнформацияПоДоставке = "";
		ДокОбъект.ОсобыеУсловияПеревозки = Ложь;
		ДокОбъект.ОсобыеУсловияПеревозкиОписание = "";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПеревозчику(ЭлементыФормы, ДокОбъект, ДопИнфоИзмененоПользователем = Ложь)
	
	ПустыеРеквизиты = ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки(ДокОбъект);
	
	ЗаполнитьЗначенияСвойств(ДокОбъект, ПустыеРеквизиты,
		"АдресДоставкиПеревозчика, АдресДоставкиПеревозчикаЗначенияПолей, ЗонаДоставки, ВремяДоставкиС, ВремяДоставкиПо");
	Если Не ДопИнфоИзмененоПользователем Тогда
		ДокОбъект.ДополнительнаяИнформацияПоДоставке = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокОбъект.ПеревозчикПартнер)
			И ЭлементыФормы.АдресДоставкиПеревозчика.СписокВыбора.Количество() > 0 Тогда
		ПерваяСтруктураВСписке = ЭлементыФормы.АдресДоставкиПеревозчика.СписокВыбора[0].Значение;
		ЗаполнитьЗначенияСвойств(ДокОбъект,ПерваяСтруктураВСписке,
			"ЗонаДоставки, ВремяДоставкиС, ВремяДоставкиПо");
		ДокОбъект.АдресДоставкиПеревозчика = ПерваяСтруктураВСписке.АдресДоставки;
		ДокОбъект.АдресДоставкиПеревозчикаЗначенияПолей = ПерваяСтруктураВСписке.АдресДоставкиЗначенияПолей;
		Если Не ДопИнфоИзмененоПользователем Тогда
			ДокОбъект.ДополнительнаяИнформацияПоДоставке = ПерваяСтруктураВСписке.ДополнительнаяИнформацияПоДоставке;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обновляет список выбора у поля выбора способа доставки при изменении склада отгрузки.
//
// Параметры:
//	ПолеВыбораФормы - ПолеФормы - поле ввода времени доставки
//	ЕстьПоддержкаДоставкиСвоимиКурьерами - Булево
//
Процедура ОбновитьСписокВыбораСпособаДоставкиДляСкладаОтгрузки(ПолеВыбораФормы, ЕстьПоддержкаДоставкиСвоимиКурьерами) Экспорт
	
	СписокВыбора = ПолеВыбораФормы.СписокВыбора;
	ИскомоеЗначение = СписокВыбора.НайтиПоЗначению(Перечисления.СпособыДоставки.ДоКлиентаКурьером);
	
	Если ЕстьПоддержкаДоставкиСвоимиКурьерами Тогда
		
		Если ИскомоеЗначение = Неопределено Тогда
			
			ИскомоеЗначениеНачала = СписокВыбора.НайтиПоЗначению(Перечисления.СпособыДоставки.ДоКлиента);
			Если ИскомоеЗначениеНачала <> Неопределено Тогда
				ИндексДляВставки = СписокВыбора.Индекс(ИскомоеЗначениеНачала)+1;
				СписокВыбора.Вставить(ИндексДляВставки, Перечисления.СпособыДоставки.ДоКлиентаКурьером,
					НСтр("ru='Наш курьер до клиента'"));
			Иначе
				СписокВыбора.Добавить(Перечисления.СпособыДоставки.ДоКлиентаКурьером,
					НСтр("ru='Наш курьер до клиента'"));
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИскомоеЗначение <> Неопределено Тогда
		
		СписокВыбора.Удалить(ИскомоеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

// Получение списка перевозчиков.
//
// Параметры:
//  СписокПеревозчиков - Массив из СправочникСсылка.Партнеры - содержит перевозчиков
//  ПолучательОтправитель - ОпределяемыйТип.ОтправительПолучательДоставки
//  Склад - СправочникСсылка.Склады
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Партнеры - содержит перевозчиков
//
Функция ПолучитьСписокПеревозчиков(Знач СписокПеревозчиков, ПолучательОтправитель, Склад = Неопределено)
	
	ЕстьУсловиеПоCкладу = Склад <> Неопределено;
	ЕстьУсловиеПоПолучателюОтправителю = ПолучательОтправитель <> Неопределено;
	ДатаОграничения = ДобавитьМесяц(ТекущаяДатаСеанса(), -12);
	ТекстЗапроса = ТекстЗапросаПеревозчиков(ЕстьУсловиеПоCкладу, ЕстьУсловиеПоПолучателюОтправителю);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Если ЕстьУсловиеПоCкладу Тогда
		Запрос.УстановитьПараметр("Склад", Склад);
	КонецЕсли;
	
	Если ЕстьУсловиеПоПолучателюОтправителю Тогда
		Запрос.УстановитьПараметр("ПолучательОтправитель",ПолучательОтправитель);
		Запрос.УстановитьПараметр("ДатаОграничения", ДатаОграничения);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			СписокПеревозчиков = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Перевозчик");
		КонецЕсли;
	КонецЕсли;
	
	КоличествоПеревозчиков = СписокПеревозчиков.Количество();
	Если КоличествоПеревозчиков < 5 Тогда
		// Если список не полный, попытаемся дополнить его, устранив ограничение по получателю.
		ТекстЗапроса = ТекстЗапросаПеревозчиков(ЕстьУсловиеПоCкладу, Ложь);
		Если ЕстьУсловиеПоCкладу Тогда
			Запрос.УстановитьПараметр("Склад", Склад);
		КонецЕсли;
		Запрос.УстановитьПараметр("ДатаОграничения", ДатаОграничения);
				
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() > 0 Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока КоличествоПеревозчиков < 5 Цикл
				Если Выборка.Следующий() Тогда
					Если СписокПеревозчиков.Найти(Выборка.Перевозчик) = Неопределено Тогда
						СписокПеревозчиков.Добавить(Выборка.Перевозчик);
						КоличествоПеревозчиков = КоличествоПеревозчиков + 1;
					КонецЕсли;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокПеревозчиков;
	
КонецФункции

Функция ТекстЗапросаПеревозчиков(ЕстьУсловиеПоСкладу, ЕстьУсловиеПоПолучателюОтправителю)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 5
	|	Т.Перевозчик КАК Перевозчик,
	|	МАКСИМУМ(Т.Дата) КАК РаспоряжениеДата
	|ИЗ
	|	РегистрСведений.СостоянияИРеквизитыДоставки КАК Т
	|ГДЕ
	|	&УсловиеПоДате
	|	И &УсловиеПоСкладу
	|	И &УсловиеПоПолучателюОтправителю
	|	И Т.Перевозчик <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	Т.Перевозчик
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(Т.Дата) УБЫВ";
	
	Если ЕстьУсловиеПоСкладу Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоСкладу", "Т.Склад = &Склад");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоСкладу", "Истина");
	КонецЕсли;
	
	Если ЕстьУсловиеПоПолучателюОтправителю Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоПолучателюОтправителю", "Т.ПолучательОтправитель = &ПолучательОтправитель");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоПолучателюОтправителю", "Истина");
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате", "Т.Дата > &ДатаОграничения");
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Заполняет список перевозчиков в форме.
//
// Параметры:
//  ЭлементыФормы		 - ВсеЭлементыФормы	 - все элементы формы для управления свойствами и переключения закладок, может содержать:
//  							* ПеревозчикПартнер - ПолеФормы - обязательное
//  ДокОбъект			 - ДанныеФормыСтруктура	 - объект, реквизиты которого используются при заполнении свойств,
//  Склад				 - СправочникСсылка.Склады
//
Процедура ЗаполнитьСписокВыбораПеревозчиков(ЭлементыФормы, ДокОбъект = Неопределено, Склад = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЭлементыФормы.Найти("ПеревозчикПартнер") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивПеревозчиков = ЭлементыФормы.ПеревозчикПартнер.СписокВыбора.ВыгрузитьЗначения();
	
	ПолучательОтправитель = ?(ДокОбъект <> Неопределено,
			ПолучательОтправитель(ДокОбъект).Значение,
			Неопределено);
	
	МассивПеревозчиков = ПолучитьСписокПеревозчиков(МассивПеревозчиков, ПолучательОтправитель, Склад);
	
	ЭлементыФормы.ПеревозчикПартнер.СписокВыбора.ЗагрузитьЗначения(МассивПеревозчиков);
	
	// Так как формируется список выбора по статистике, информация по истории является излишней, дублирующей.
	ЭлементыФормы.ПеревозчикПартнер.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораАдресовПеревозчика(ЭлементыФормы, ДокОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЭлементыФормы.Найти("АдресДоставкиПеревозчика") <> Неопределено Тогда
		ИмяЭлементаАдрес = "АдресДоставкиПеревозчика";
	Иначе
		Возврат;
	КонецЕсли;
	
	ПеревозчикПартнер = ДокОбъект.ПеревозчикПартнер;
	
	Если Не ЗначениеЗаполнено(ПеревозчикПартнер) Тогда
		ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений;
	
	ПолучательОтправитель = ПолучательОтправитель(ДокОбъект).Значение;
	ПоследниеРеквизитыДоставкиИзЗаданий = ПоследниеРеквизитыДоставкиИзЗаданий(ПолучательОтправитель,ПеревозчикПартнер);
	// Получим последние использованные реквизиты доставки перевозчика по получателю
	ДополнитьСписокВыбораИзТаблицыАдресов(СписокВыбора, ПоследниеРеквизитыДоставкиИзЗаданий, НСтр("ru = 'По статистике'"));
	
	Если СписокВыбора.Количество() < 3 Тогда
		ПоследниеРеквизитыДоставкиИзЗаданий = ПоследниеРеквизитыДоставкиИзЗаданий(,ПеревозчикПартнер);
		// Если список не полный, попытаемся дополнить его, устранив ограничение по получателю.
		ДополнитьСписокВыбораИзТаблицыАдресов(СписокВыбора, ПоследниеРеквизитыДоставкиИзЗаданий, НСтр("ru = 'По статистике'"));
	КонецЕсли;
	
	Если СписокВыбора.Количество() < 5 Тогда
		ПоследниеРеквизитыДоставкиИзРаспоряжений = ПоследниеРеквизитыДоставкиИзРаспоряжений(ДокОбъект.Ссылка, , ПеревозчикПартнер);
		ДополнитьСписокВыбораИзТаблицыАдресов(СписокВыбора, ПоследниеРеквизитыДоставкиИзРаспоряжений, НСтр("ru = 'По статистике'"));
	КонецЕсли;
	
	АдресаПолучателяИзКонтактнойИнформации = АдресаПолучателяИзКонтактнойИнформации(ПеревозчикПартнер);
	ДополнитьСписокВыбораИзТаблицыАдресов(СписокВыбора, АдресаПолучателяИзКонтактнойИнформации, НСтр("ru = 'Перевозчик'"));
	
	СкопироватьСписокЗначений(ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора, СписокВыбора);
	
КонецПроцедуры

Процедура ЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(ЭлементыФормы, ДокОбъект, РаспоряжениеИспользуетДоставку25 = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПолучательОтправитель = ПолучательОтправитель(ДокОбъект).Значение;
	ПолучательОтправительПредставление = ПолучательОтправитель(ДокОбъект).Представление;
	
	Если Не ЗначениеЗаполнено(ПолучательОтправитель) Тогда
		ДоставкаТоваровКлиентСервер.ОчиститьСпискиВыбораАдресовПолучателяОтправителя(ЭлементыФормы);
		Возврат;
	КонецЕсли;
	
	Дата = ТекущаяДатаСеанса();
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокОбъект, "Дата") Тогда
		Дата = ДокОбъект.Дата;
	КонецЕсли;
	
	Грузополучатель = ?(
		ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокОбъект, "Грузополучатель"),
		ДокОбъект.Грузополучатель,
		Неопределено); // ОпределяемыйТип.ВладелецКонтактнойИнформации
		
	Контрагент = ?(
		ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокОбъект, "Контрагент"),
		ДокОбъект.Контрагент,
		Неопределено); // ОпределяемыйТип.ВладелецКонтактнойИнформации
		
	СписокВыбора = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Грузополучатель) Тогда
		АдресаГрузополучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Грузополучатель, Перечисления.ТипыКонтактнойИнформации.Адрес, Дата, Ложь);
		АдресаГрузополучателя = АдресаДоставкиИзКонтактнойИнформации(АдресаГрузополучателя);
		ДополнитьСписокВыбораИзТаблицыАдресов(СписокВыбора, АдресаГрузополучателя, НСтр("ru = 'Грузополучатель'"));
	КонецЕсли;
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() Тогда
		
		ПоследниеРеквизитыДоставкиИзЗаданий = ПоследниеРеквизитыДоставкиИзЗаданий(ПолучательОтправитель);
		ДополнитьСписокВыбораИзТаблицыАдресов(СписокВыбора, ПоследниеРеквизитыДоставкиИзЗаданий, НСтр("ru = 'По статистике'"));
		
	КонецЕсли;
	
	Если Не РаспоряжениеИспользуетДоставку25 Тогда
		
		ПоследниеРеквизитыДоставкиИзРаспоряжений = ПоследниеРеквизитыДоставкиИзРаспоряжений(
			ДокОбъект.Ссылка, ПолучательОтправитель,, Грузополучатель);
		ДополнитьСписокВыбораИзТаблицыАдресов(СписокВыбора, ПоследниеРеквизитыДоставкиИзРаспоряжений, НСтр("ru = 'По статистике'"));
		
	КонецЕсли;
	
	Если (ТипЗнч(ПолучательОтправитель) <> Тип("СправочникСсылка.СтруктураПредприятия")
			И ТипЗнч(ПолучательОтправитель) <> Тип("Строка")) Тогда
		
		АдресаПолучателяИзКонтактнойИнформации = АдресаПолучателяИзКонтактнойИнформации(ПолучательОтправитель);
		ДополнитьСписокВыбораИзТаблицыАдресов(СписокВыбора, АдресаПолучателяИзКонтактнойИнформации, ПолучательОтправительПредставление);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		АдресаКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Контрагент, Перечисления.ТипыКонтактнойИнформации.Адрес, Дата, Ложь);
		АдресаКонтрагента = АдресаДоставкиИзКонтактнойИнформации(АдресаКонтрагента);
		ДополнитьСписокВыбораИзТаблицыАдресов(СписокВыбора, АдресаКонтрагента, НСтр("ru = 'Контрагент'"));
	КонецЕсли;
	
	Если ЭлементыФормы.Найти("АдресДоставкиСамовывоз") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресДоставкиСамовывоз.СписокВыбора, СписокВыбора);
	КонецЕсли;
	Если ЭлементыФормы.Найти("АдресДоставкиПолучателя") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресДоставкиПолучателя.СписокВыбора, СписокВыбора);
	КонецЕсли;
	Если ЭлементыФормы.Найти("АдресДоставки") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресДоставки.СписокВыбора, СписокВыбора);
	КонецЕсли;
	Если ЭлементыФормы.Найти("АдресДоставкиПолучателя1") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресДоставкиПолучателя1.СписокВыбора, СписокВыбора);
	КонецЕсли;
	Если ЭлементыФормы.Найти("АдресДоставкиПолучателя2") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресДоставкиПолучателя2.СписокВыбора, СписокВыбора);
	КонецЕсли;
	Если ЭлементыФормы.Найти("АдресПоставщика") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресПоставщика.СписокВыбора, СписокВыбора);
	КонецЕсли;
	Если ЭлементыФормы.Найти("АдресПункта") <> Неопределено Тогда
		СкопироватьСписокЗначений(ЭлементыФормы.АдресПункта.СписокВыбора, СписокВыбора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьСписокВыбораИзТаблицыАдресов(СписокВыбора, ТаблицаАдресов, Источник = "")
	
	Для Каждого Строка Из ТаблицаАдресов Цикл
		
		НайденныйЭлементСписка = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(СписокВыбора, "АдресДоставки", Строка.АдресДоставки);
		
		Если НайденныйЭлементСписка = Неопределено Тогда
			СтруктураВыбора = СтруктураВыбора();
			ЗаполнитьЗначенияСвойств(СтруктураВыбора, Строка);
			Если ЗначениеЗаполнено(Источник) И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Строка, "Вид") Тогда
				Представление =
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 (%2, %3)", Строка.АдресДоставки, Строка.Вид, Источник);
			ИначеЕсли ЗначениеЗаполнено(Источник) Тогда
				Представление =
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 (%2)", Строка.АдресДоставки, Источник);
			Иначе
				Представление = Строка.АдресДоставки;
			КонецЕсли;
			СписокВыбора.Добавить(СтруктураВыбора, Представление);
		Иначе
			ДозаполнитьПустыеСвойства(НайденныйЭлементСписка.Значение, Строка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура - Структура выбора:
// * АдресДоставки - Строка - 
// * АдресДоставкиЗначение - Строка - 
// * АдресДоставкиЗначенияПолей - Строка - 
// * ЗонаДоставки - СправочникСсылка.ЗоныДоставки - 
// * ВремяДоставкиС - Дата - 
// * ВремяДоставкиПо - Дата - 
// * ДополнительнаяИнформацияПоДоставке - Строка -
// 
Функция СтруктураВыбора()
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("АдресДоставки", "");
	СтруктураВыбора.Вставить("АдресДоставкиЗначение", "");
	СтруктураВыбора.Вставить("АдресДоставкиЗначенияПолей", "");
	СтруктураВыбора.Вставить("ЗонаДоставки", Справочники.ЗоныДоставки.ПустаяСсылка());
	СтруктураВыбора.Вставить("ВремяДоставкиС", Дата(1,1,1));
	СтруктураВыбора.Вставить("ВремяДоставкиПо", Дата(1,1,1));
	СтруктураВыбора.Вставить("ДополнительнаяИнформацияПоДоставке", "");
	
	Возврат СтруктураВыбора;
	
КонецФункции

// Инициализация таблицы адресов доставки.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица адресов доставки:
// * АдресДоставки - Строка - 
// * Вид - СправочникСсылка.ВидыКонтактнойИнформации - 
// * АдресДоставкиЗначение - Строка - 
// * АдресДоставкиЗначенияПолей - Строка - 
// * ЗонаДоставки - СправочникСсылка.ЗоныДоставки - 
// * ВремяДоставкиС - Дата - 
// * ВремяДоставкиПо - Дата -
// * ДополнительнаяИнформацияПоДоставке - Строка - 
//
Функция НоваяТаблицаАдресовДоставки()
	
	АдресаДоставки = Новый ТаблицаЗначений;
	АдресаДоставки.Колонки.Добавить("АдресДоставки", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	АдресаДоставки.Колонки.Добавить("Вид", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	АдресаДоставки.Колонки.Добавить("АдресДоставкиЗначение", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	АдресаДоставки.Колонки.Добавить("АдресДоставкиЗначенияПолей", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	АдресаДоставки.Колонки.Добавить("ЗонаДоставки", Новый ОписаниеТипов("СправочникСсылка.ЗоныДоставки"));
	АдресаДоставки.Колонки.Добавить("ВремяДоставкиС", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Время));
	АдресаДоставки.Колонки.Добавить("ВремяДоставкиПо", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Время));
	АдресаДоставки.Колонки.Добавить("ДополнительнаяИнформацияПоДоставке",  ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Возврат АдресаДоставки;
	
КонецФункции

// Адреса доставки из контактной инфомации.
// 
// Параметры:
//  КонтактнаяИнформация - См. УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация
// 
// Возвращаемое значение:
//  См. НоваяТаблицаАдресовДоставки
//  
Функция АдресаДоставкиИзКонтактнойИнформации(КонтактнаяИнформация)
	
	АдресаДоставки = НоваяТаблицаАдресовДоставки();
	
	Для Каждого Строка Из КонтактнаяИнформация Цикл
		НоваяСтрока = АдресаДоставки.Добавить();
		НоваяСтрока.АдресДоставки = Строка.Представление;
		НоваяСтрока.Вид = Строка.Вид;
		НоваяСтрока.АдресДоставкиЗначение = Строка.Значение;
		НоваяСтрока.АдресДоставкиЗначенияПолей = Строка.ЗначенияПолей;
	КонецЦикла;
	
	Возврат АдресаДоставки;
	
КонецФункции

Функция ПоследниеРеквизитыДоставкиИзРаспоряжений(
			ОбъектСсылка,
			ПолучательОтправитель = Неопределено,
			Перевозчик = Неопределено,
			Грузополучатель = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МетаданныеОбъекта = ОбъектСсылка.Метаданные();
	Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ПоручениеЭкспедитору") Тогда
		Возврат ПоследниеРеквизитыПорученийЭкспедиторам(ПолучательОтправитель)
	КонецЕсли;
	
	СвязанныеДокументы = Новый Массив; // Массив из Массив, ОбъектМетаданных
	
	ГруппаДокументов = Новый Массив; // Массив из ОбъектМетаданных
	ГруппаДокументов.Добавить(Метаданные.Документы.РеализацияТоваровУслуг);
	ГруппаДокументов.Добавить(Метаданные.Документы.ЗаказКлиента);
	ГруппаДокументов.Добавить(Метаданные.Документы.ЗаявкаНаВозвратТоваровОтКлиента);
	ГруппаДокументов.Добавить(Метаданные.Документы.ПередачаТоваровХранителю);
	
	СвязанныеДокументы.Добавить(ГруппаДокументов);
	
	ГруппаДокументов = Новый Массив; // Массив из ОбъектМетаданных
	ГруппаДокументов.Добавить(Метаданные.Документы.ЗаказНаПеремещение);
	ГруппаДокументов.Добавить(Метаданные.Документы.ПеремещениеТоваров);
	
	СвязанныеДокументы.Добавить(ГруппаДокументов);
	
	ГруппаДокументов = Новый Массив; // Массив из ОбъектМетаданных
	ГруппаДокументов.Добавить(Метаданные.Документы.ЗаказПоставщику);
	ГруппаДокументов.Добавить(Метаданные.Документы.ПриобретениеТоваровУслуг);
	ГруппаДокументов.Добавить(Метаданные.Документы.ПриемкаТоваровНаХранение);
	
	СвязанныеДокументы.Добавить(ГруппаДокументов);
	
	
	
	ГруппаДокументов = Новый Массив; // Массив из ОбъектМетаданных
	ГруппаДокументов.Добавить(МетаданныеОбъекта);
	
	СвязанныеДокументы.Добавить(ГруппаДокументов);
	
	Для Каждого ГруппаСвязанныхДокументов Из СвязанныеДокументы Цикл
		
		Если ГруппаСвязанныхДокументов.Найти(МетаданныеОбъекта) <> Неопределено Тогда
			ТекущаяГруппаДокументов = ГруппаСвязанныхДокументов;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ШаблонЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	ВЫБОР КОГДА Док.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА Док.АдресДоставкиПеревозчика
	|		ИНАЧЕ Док.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	МАКСИМУМ(Док.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_ПоследниеАдреса
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Ссылка <> &Ссылка
	|	И Док.Дата > &ДатаНачалаВыборки
	|	И (Док.Партнер = &ПолучательОтправитель
	|		ИЛИ &ПолучательОтправитель = НЕОПРЕДЕЛЕНО)
	|	И (&УсловиеПоГрузополучателю)
	|	И (Док.ПеревозчикПартнер = &Перевозчик
	|			И Док.АдресДоставкиПеревозчика <> """"
	|		ИЛИ &Перевозчик = НЕОПРЕДЕЛЕНО
	|			И Док.АдресДоставки <> """")
	|	И Док.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПоставщикаДоНашегоСклада)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА Док.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА Док.АдресДоставкиПеревозчика
	|		ИНАЧЕ Док.АдресДоставки
	|	КОНЕЦ
	|";
	
	ТекстЗапроса = "";
		
	Для Каждого МетаданныеДокумента Из ТекущаяГруппаДокументов Цикл
		
		ТекстПоДокументу = "";
		
		ИмяДокумента = МетаданныеДокумента.ПолноеИмя();
		
		Если МетаданныеДокумента.Реквизиты.Найти("Партнер") <> Неопределено Тогда
			ИмяПоляПолучатель = "Партнер";
		Иначе
			ИмяПоляПолучатель = "СкладПолучатель";
		КонецЕсли;
		
		Если ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) Тогда
			ИмяПоляАктуальныйОбъект = "Док.Проведен";
		Иначе
			ИмяПоляАктуальныйОбъект = "НЕ Док.ПометкаУдаления";
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Грузополучатель") <> Неопределено И ЗначениеЗаполнено(Грузополучатель) Тогда
			УсловиеПоГрузополучателю = "Док.Грузополучатель = &Грузополучатель";
		Иначе
			УсловиеПоГрузополучателю = "ИСТИНА";
		КонецЕсли;
				
		ТекстПоДокументу = СтрЗаменить(ШаблонЗапроса	, "Документ.РеализацияТоваровУслуг"	, ИмяДокумента);
		ТекстПоДокументу = СтрЗаменить(ТекстПоДокументу	, "Док.Проведен"					, ИмяПоляАктуальныйОбъект);
		ТекстПоДокументу = СтрЗаменить(ТекстПоДокументу	, "Док.Партнер"						, "Док." + ИмяПоляПолучатель);
		ТекстПоДокументу = СтрЗаменить(ТекстПоДокументу	, "&УсловиеПоГрузополучателю"		, УсловиеПоГрузополучателю);
		
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			ТекстПоДокументу = СтрЗаменить(ТекстПоДокументу,"ПОМЕСТИТЬ ВТ_ПоследниеАдреса", "");
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|" + ТекстПоДокументу;
		Иначе
			ТекстЗапроса = ТекстПоДокументу;
		КонецЕсли;
			
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(Док.Дата) УБЫВ
	|;" + "
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПоследниеАдреса.Ссылка) КАК Ссылка,
	|	ПоследниеАдреса.АдресДоставки
	|ПОМЕСТИТЬ ВТ_СсылкиПоАдресам
	|ИЗ #Текст_ВТ_СсылкиПоАдресам КАК ПоследниеАдреса
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеАдреса.АдресДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" +
	"ВЫБРАТЬ ВТ_СсылкиПоАдресам.Ссылка,ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки,
	|	ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоКонечногоПункта),
	|	ВТ_ПоследниеАдреса.АдресДоставки КАК АдресДоставки,
	|	ВЫБОР КОГДА ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиПеревозчикаЗначение
	|		ИНАЧЕ ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиЗначение
	|	КОНЕЦ КАК АдресДоставкиЗначение,
	|	ВЫБОР КОГДА ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиПеревозчикаЗначенияПолей
	|		ИНАЧЕ ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиЗначенияПолей
	|	КОНЕЦ КАК АдресДоставкиЗначенияПолей,
	|	ВТ_СсылкиПоАдресам.Ссылка.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	ВЫБОР КОГДА ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоКонечногоПункта)
	|			И &Перевозчик = НЕОПРЕДЕЛЕНО
	|		ИЛИ ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА ВТ_СсылкиПоАдресам.Ссылка.ЗонаДоставки
	|		ИНАЧЕ Значение(Справочник.ЗоныДоставки.ПустаяСсылка)
	|	КОНЕЦ КАК ЗонаДоставки,
	|	ВЫБОР КОГДА ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоКонечногоПункта)
	|			И &Перевозчик = НЕОПРЕДЕЛЕНО
	|		ИЛИ ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА ВТ_СсылкиПоАдресам.Ссылка.ВремяДоставкиС
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
	|	КОНЕЦ КАК ВремяДоставкиС,
	|	ВЫБОР КОГДА ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоКонечногоПункта)
	|			И &Перевозчик = НЕОПРЕДЕЛЕНО
	|		ИЛИ ВТ_СсылкиПоАдресам.Ссылка.СпособДоставки В (&СпособыДоставкиДоМестаПередачи)
	|			И &Перевозчик <> НЕОПРЕДЕЛЕНО
	|		ТОГДА ВТ_СсылкиПоАдресам.Ссылка.ВремяДоставкиПо
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
	|	КОНЕЦ КАК ВремяДоставкиПо
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СсылкиПоАдресам КАК ВТ_СсылкиПоАдресам
	|		ПО (ВТ_СсылкиПоАдресам.АдресДоставки = ВТ_ПоследниеАдреса.АдресДоставки)
	|
	|ГДЕ
	|	(ВЫРАЗИТЬ(ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиЗначенияПолей КАК СТРОКА(10)) = """"
	|		ИЛИ ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиЗначенияПолей ПОДОБНО ""%</КонтактнаяИнформация>""
	|	И ВЫРАЗИТЬ(ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиПеревозчикаЗначенияПолей КАК СТРОКА(10)) = """"
	|		ИЛИ ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиПеревозчикаЗначенияПолей ПОДОБНО ""%</КонтактнаяИнформация>"")
	|	ИЛИ
	|	(ВЫРАЗИТЬ(ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиЗначенияПолей КАК СТРОКА(10)) = """"
	|		ИЛИ ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиЗначенияПолей ПОДОБНО ""%}""
	|	И ВЫРАЗИТЬ(ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиПеревозчикаЗначенияПолей КАК СТРОКА(10)) = """"
	|		ИЛИ ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиПеревозчикаЗначенияПолей ПОДОБНО ""%}"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ПоследниеАдреса.Дата УБЫВ";
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	ВТ_ПоследниеАдреса.АдресДоставки КАК АдресДоставки
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Док
	|		ПО ВТ_ПоследниеАдреса.Дата = Док.Дата
	|			И (ВТ_ПоследниеАдреса.АдресДоставки = Док.АдресДоставки
	|				ИЛИ ВТ_ПоследниеАдреса.АдресДоставки = Док.АдресДоставкиПеревозчика)
	|";
	Текст_ВТ_СсылкиПоАдресам = "";
	Для Каждого МетаданныеДокумента Из ТекущаяГруппаДокументов Цикл
		ТекстПоДокументу = "";
		ИмяДокумента = МетаданныеДокумента.ПолноеИмя();
		ТекстПоДокументу = СтрЗаменить(ШаблонЗапроса,"Документ.РеализацияТоваровУслуг", ИмяДокумента);
		Если ЗначениеЗаполнено(Текст_ВТ_СсылкиПоАдресам) Тогда
			Текст_ВТ_СсылкиПоАдресам = Текст_ВТ_СсылкиПоАдресам + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|" + ТекстПоДокументу;
		Иначе
			Текст_ВТ_СсылкиПоАдресам = ТекстПоДокументу;
		КонецЕсли;
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#Текст_ВТ_СсылкиПоАдресам","("+Текст_ВТ_СсылкиПоАдресам+")");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Дата = ТекущаяДатаСеанса();
	Если ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) И ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Дата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "Дата");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	Запрос.УстановитьПараметр("ДатаНачалаВыборки", ДобавитьМесяц(Дата, -12));
	Запрос.УстановитьПараметр("ПолучательОтправитель",ПолучательОтправитель);
	Запрос.УстановитьПараметр("Перевозчик",Перевозчик);
	Запрос.УстановитьПараметр("Грузополучатель", Грузополучатель);
	
	СпособыДоставкиДоМестаПередачи = Новый Массив; // Массив из ПеречислениеСсылка.СпособыДоставки
	СпособыДоставкиДоМестаПередачи.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу);
	СпособыДоставкиДоМестаПередачи.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи);
	Запрос.УстановитьПараметр("СпособыДоставкиДоМестаПередачи",СпособыДоставкиДоМестаПередачи);
	
	СпособыДоставкиДоКонечногоПункта = Новый Массив; // Массив из ПеречислениеСсылка.СпособыДоставки
	СпособыДоставкиДоКонечногоПункта.Добавить(Перечисления.СпособыДоставки.ДоКлиента);
	СпособыДоставкиДоКонечногоПункта.Добавить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
	СпособыДоставкиДоКонечногоПункта.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки);
	СпособыДоставкиДоКонечногоПункта.Добавить(Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки);
	Запрос.УстановитьПараметр("СпособыДоставкиДоКонечногоПункта",СпособыДоставкиДоКонечногоПункта);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ПоследниеРеквизитыПорученийЭкспедиторам(ПолучательОтправитель)
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	Док.АдресДоставки,
	|	МАКСИМУМ(Док.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_ПоследниеАдреса
	|ИЗ
	|	Документ.ПоручениеЭкспедитору КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Пункт = &ПолучательОтправитель
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.АдресДоставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(Док.Дата) УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Док.Ссылка) КАК Ссылка,
	|	ВТ_ПоследниеАдреса.АдресДоставки
	|ПОМЕСТИТЬ ВТ_СсылкиПоАдресам
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК Док
	|		ПО ВТ_ПоследниеАдреса.Дата = Док.Дата
	|			И ВТ_ПоследниеАдреса.АдресДоставки = Док.АдресДоставки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоследниеАдреса.АдресДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеАдреса.АдресДоставки КАК АдресДоставки,
	|	ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	ВТ_СсылкиПоАдресам.Ссылка.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	ВТ_СсылкиПоАдресам.Ссылка.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	ВТ_СсылкиПоАдресам.Ссылка.ЗонаДоставки КАК ЗонаДоставки,
	|	ВТ_СсылкиПоАдресам.Ссылка.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ВТ_СсылкиПоАдресам.Ссылка.ВремяДоставкиПо КАК ВремяДоставкиПо
	|ИЗ
	|	ВТ_ПоследниеАдреса КАК ВТ_ПоследниеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СсылкиПоАдресам КАК ВТ_СсылкиПоАдресам
	|		ПО (ВТ_СсылкиПоАдресам.АдресДоставки = ВТ_ПоследниеАдреса.АдресДоставки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ПоследниеАдреса.Дата УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ПолучательОтправитель",ПолучательОтправитель);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция АдресаПолучателяИзКонтактнойИнформации(ПолучательОтправитель)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК АдресДоставки,
		|	КонтактнаяИнформация.Вид.Представление КАК Вид,
		|	КонтактнаяИнформация.Значение КАК АдресДоставкиЗначение,
		|	КонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей,
		|	&ЗонаДоставки КАК ЗонаДоставки
		|ИЗ
		|	&СправочникПолучательОтправительКонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &ПолучательОтправитель
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)");
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СправочникПолучательОтправительКонтактнаяИнформация", "Справочник." + ПолучательОтправитель.Метаданные().Имя + ".КонтактнаяИнформация");
	Запрос.УстановитьПараметр("ПолучательОтправитель", ПолучательОтправитель);
	Если ТипЗнч(ПолучательОтправитель) = Тип("СправочникСсылка.Партнеры") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗонаДоставки", "КонтактнаяИнформация.Ссылка.ЗонаДоставки");
	Иначе	
		Запрос.УстановитьПараметр("ЗонаДоставки", Справочники.ЗоныДоставки.ПустаяСсылка());
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Процедура СкопироватьСписокЗначений(СписокПриемник, СписокИсточник)
	
	СписокПриемник.Очистить();
	Для Каждого Элемент Из СписокИсточник Цикл
		СписокПриемник.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДозаполнитьПустыеСвойства(СтруктураПриемник, Источник);
	
	СтруктураЗаполнения = Новый Структура;
	Для Каждого Элемент Из СтруктураПриемник Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			СтруктураЗаполнения.Вставить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Источник);
	ЗаполнитьЗначенияСвойств(СтруктураПриемник, СтруктураЗаполнения);
	
КонецПроцедуры

Функция УстановитьВидимостьЭлементовДоставки(ЭлементыФормы, ДокОбъект, НакладнаяПоЗаказам, ПараметрыПриемки = Неопределено, ЭтоДоставкаНаНашСклад = Неопределено)
	
	Если ЭтоДоставкаНаНашСклад = Неопределено Тогда
		ЭтоДоставкаНаНашСклад = ДоставкаТоваровКлиентСервер.ЭтоРаспоряжениеНаДоставкуНаНашСклад(ДокОбъект.Ссылка); 
	КонецЕсли;
	
	Если ЭтоДоставкаНаНашСклад И ПараметрыПриемки = Неопределено Тогда
		ПараметрыПриемки = ПолучитьПараметрыПриемки(ДокОбъект,,НакладнаяПоЗаказам);
	КонецЕсли;
	
	ВидимостьДоставки = Ложь;
	
	Если ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() Тогда
		Если ЭтоДоставкаНаНашСклад Тогда 
			ВидимостьДоставки = ПараметрыПриемки.ЭтоДоговорКонтрагента
								Или ПараметрыПриемки.СоглашениеЯвляетсяРаспоряжением
								Или ПараметрыПриемки.ДоговорЯвляетсяРаспоряжением
								Или ПараметрыПриемки.ЭтоДокументПоступление
								Или ПараметрыПриемки.ЭтоРаспоряжение;
		Иначе
			ВидимостьДоставки = Не НакладнаяПоЗаказам 
								Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДокОбъект.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ТипДоговора = ДокОбъект.ТипДоговора;
		ИспользоватьОформлениеЗакупок = (ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком
			Или ТипДоговора = Перечисления.ТипыДоговоров.ВвозИзЕАЭС
			Или ТипДоговора = Перечисления.ТипыДоговоров.Импорт);
			
		ВидимостьДоставки = ВидимостьДоставки И ИспользоватьОформлениеЗакупок;
	КонецЕсли;
	
	Если ЭлементыФормы.Найти("СтраницаДоставка") <> Неопределено Тогда
		ЭлементыФормы.СтраницаДоставка.Видимость = ВидимостьДоставки;
		ЭлементыФормы.СпособДоставки.ТолькоПросмотр = НакладнаяПоЗаказам
			И ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика;
	КонецЕсли;
	
	Возврат ВидимостьДоставки;
	
КонецФункции

Функция ЭтоРаспоряжениеПоСоглашению(ДокОбъект, ПараметрыПриемки = Неопределено)
	
	Если ДоставкаТоваровКлиентСервер.ЭтоРаспоряжениеНаДоставкуНаНашСклад(ДокОбъект)
			И ДокОбъект.Свойство("Соглашение")
			И ЗначениеЗаполнено(ДокОбъект.Соглашение) Тогда
		
		Если ПараметрыПриемки = Неопределено Тогда
			
			ПараметрыПриемки = ПолучитьПараметрыПриемки(ДокОбъект);
			
		КонецЕсли;
		
		Возврат ПараметрыПриемки.СоглашениеЯвляетсяРаспоряжением И Не ПараметрыПриемки.ЭтоДокументПоступление;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ДоставкаОпределенаВДоговоре(ДокОбъект)
	
	Если ДокОбъект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоДоговор = (ТипЗнч(ДокОбъект.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	
	РаспоряжениеНаДоставкуНаНашСклад = Ложь;
	
	Если ТипЗнч(ДокОбъект) = Тип("ДанныеФормыСтруктура")
		Или ТипЗнч(ДокОбъект) = Тип("Структура") Тогда
		РаспоряжениеНаДоставкуНаНашСклад = ДоставкаТоваровКлиентСервер.ЭтоРаспоряжениеНаДоставкуНаНашСклад(ДокОбъект)
			И ДокОбъект.Свойство("Договор")
			И ЗначениеЗаполнено(ДокОбъект.Договор);
	Иначе
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(ДокОбъект.Ссылка));
		ЕстьДоговор = ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор", МетаданныеОбъекта);
		
		РаспоряжениеНаДоставкуНаНашСклад = 
			(ДоставкаТоваровКлиентСервер.ЭтоРаспоряжениеНаДоставкуНаНашСклад(ДокОбъект)
			 И ЭтоДоговор)
			Или (ЕстьДоговор
				И ЗначениеЗаполнено(ДокОбъект.Договор));
	КонецЕсли;
	
	Если РаспоряжениеНаДоставкуНаНашСклад Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Если ЭтоДоговор Тогда
			СпособДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.Ссылка, "СпособДоставки");
		Иначе
			СпособДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.Договор, "СпособДоставки");
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
		СпособыДоставки = Новый Массив; // Массив из ПеречислениеСсылка.СпособыДоставки 
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками") Тогда
			СпособыДоставки.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада);
		КонецЕсли;
		
		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада);
		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи);
		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки);
		
		ДоставкаИспользуется = СпособыДоставки.Найти(СпособДоставки) <> Неопределено;
		
		Возврат ДоставкаИспользуется;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьДоговорРаспоряжение(РаспоряженияСсылки)
	
	ВозвращаемоеЗначение = Неопределено;
	
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(РаспоряженияСсылки, "Договор")
		И ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(РаспоряженияСсылки, "ВариантПриемкиТоваров") Тогда
		
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РаспоряженияСсылки, "Договор, ВариантПриемкиТоваров");
		
		ДоговорИспользуетсяПриПриемке = Справочники.ДоговорыКонтрагентов.ДоговорИспользуетсяПриПриемке(РеквизитыОбъекта.ВариантПриемкиТоваров);
		
		Если ДоговорИспользуетсяПриПриемке Тогда
			ВозвращаемоеЗначение = РеквизитыОбъекта.Договор;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПолучитьПараметрыПриемки(ОбъектСсылка, Знач ВариантПриемкиТоваров = Неопределено, НакладнаяПоЗаказам = Ложь)
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ОбъектСсылка)) Тогда
		Ссылка = ОбъектСсылка;
	Иначе
		Ссылка = ОбъектСсылка.Ссылка;
	КонецЕсли;
	
	ТипСсылки = ТипЗнч(Ссылка);
	
	Если ВариантПриемкиТоваров = Неопределено Тогда
		
		Если ТипСсылки = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда
			
			ВариантПриемкиТоваров = ?(ЗначениеЗаполнено(Ссылка),
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВариантПриемкиТоваров"),
				Константы.ВариантПриемкиТоваров.Получить());
			
		ИначеЕсли ТипСсылки = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			ВариантПриемкиТоваров = ?(ЗначениеЗаполнено(Ссылка),
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВариантПриемкиТоваров"),
				Константы.ВариантПриемкиТоваров.Получить());
			
		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
				И ТипЗнч(ОбъектСсылка) = Тип("ДанныеФормыСтруктура") Тогда
			
			ВариантПриемкиТоваров = ОбъектСсылка.ВариантПриемкиТоваров;
			НакладнаяПоЗаказам = ОбъектСсылка.ПоступлениеПоЗаказам;
			
		ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ЗаказПоставщику")
				И ТипЗнч(ОбъектСсылка) = Тип("ДанныеФормыСтруктура") Тогда
			
			ВариантПриемкиТоваров = ОбъектСсылка.ВариантПриемкиТоваров;
			НакладнаяПоЗаказам = Ложь;
			
		Иначе
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ПриобретениеТоваровУслуг.ВариантПриемкиТоваров КАК ВариантПриемкиТоваров,
			|	ПриобретениеТоваровУслуг.Ссылка                КАК Ссылка,
			|	ПриобретениеТоваровУслуг.ПоступлениеПоЗаказам  КАК ПоступлениеПоЗаказам
			|ИЗ
			|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
			|ГДЕ
			|	ПриобретениеТоваровУслуг.Ссылка = &Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаказПоставщику.ВариантПриемкиТоваров         КАК ВариантПриемкиТоваров,
			|	ЗаказПоставщику.Ссылка                        КАК Ссылка,
			|	ЛОЖЬ                                          КАК ПоступлениеПоЗаказам
			|ИЗ
			|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
			|ГДЕ
			|	ЗаказПоставщику.Ссылка = &Ссылка");
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров.Получить();
			Иначе
				
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				ВариантПриемкиТоваров = Выборка.ВариантПриемкиТоваров;
				НакладнаяПоЗаказам = Выборка.ПоступлениеПоЗаказам;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДокументПоступление");
	СтруктураВозврата.Вставить("СоглашениеЯвляетсяРаспоряжением", Ложь);
	СтруктураВозврата.Вставить("ДоговорЯвляетсяРаспоряжением");
	СтруктураВозврата.Вставить("ЭтоДоговорКонтрагента", (ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов")));
	СтруктураВозврата.Вставить("ЭтоРаспоряжение", Ложь);
	СтруктураВозврата.Вставить("ЭтоДокументПоступление", Ложь);
	СтруктураВозврата.Вставить("СкладСоглашения");
	
	СтруктураВозврата.ДоговорЯвляетсяРаспоряжением    = (Справочники.ДоговорыКонтрагентов.ДоговорИспользуетсяПриПриемке(ВариантПриемкиТоваров));
	
	Договор = Неопределено;
	Если ТипСсылки = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Договор = Ссылка;
	ИначеЕсли ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Ссылка, "Договор") Тогда
		Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Договор");
	КонецЕсли;
	
	РаспоряжениеНаПриемку = Неопределено;
	
	Если Справочники.СоглашенияСПоставщиками.СоглашениеИспользуетсяПриПриемке(ВариантПриемкиТоваров) Тогда
		
		Если ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.НеРазделенаПоНакладным") Тогда
			
			СтруктураВозврата.ДокументПоступление = Тип("СправочникСсылка.СоглашенияСПоставщиками");
			РаспоряжениеНаПриемку = Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
			
		ИначеЕсли ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.НеРазделенаПоЗаказамИНакладным") Тогда
			
			СтруктураВозврата.ДокументПоступление = Тип("СправочникСсылка.СоглашенияСПоставщиками");
			РаспоряжениеНаПриемку = Тип("ДокументСсылка.ЗаказПоставщику");
			
		ИначеЕсли ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.МожетПроисходитьБезЗаказовИНакладных") Тогда 
			
			СтруктураВозврата.ДокументПоступление = Тип("СправочникСсылка.СоглашенияСПоставщиками");
			РаспоряжениеНаПриемку = Тип("Неопределено");
			
		КонецЕсли;
		
		СтруктураВозврата.СоглашениеЯвляетсяРаспоряжением = Истина;
		
	ИначеЕсли Справочники.ДоговорыКонтрагентов.ДоговорИспользуетсяПриПриемке(ВариантПриемкиТоваров)
		И ДоставкаОпределенаВДоговоре(Договор) Тогда
		
		Если ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.ПоДоговорамПослеНакладных") Тогда
			
			СтруктураВозврата.ДокументПоступление = Тип("СправочникСсылка.ДоговорыКонтрагентов");
			РаспоряжениеНаПриемку = Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
			
		ИначеЕсли ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.ПоДоговорамПослеЗаказовИлиНакладных") Тогда
			
			СтруктураВозврата.ДокументПоступление = Тип("СправочникСсылка.ДоговорыКонтрагентов");
			РаспоряжениеНаПриемку = Тип("ДокументСсылка.ЗаказПоставщику");
			
		ИначеЕсли ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.ПоДоговорамБезЗаказовИНакладных") Тогда 
			
			СтруктураВозврата.ДокументПоступление = Тип("СправочникСсылка.ДоговорыКонтрагентов");
			РаспоряжениеНаПриемку = Тип("Неопределено");
			
		КонецЕсли;
		
	ИначеЕсли ЗакупкиСервер.РаспоряжениеНаПриемкуТовараНакладная(ВариантПриемкиТоваров) Тогда
		
		СтруктураВозврата.ДокументПоступление = Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
		РаспоряжениеНаПриемку = Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") И Не НакладнаяПоЗаказам Тогда
		
		СтруктураВозврата.ДокументПоступление = Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
		РаспоряжениеНаПриемку = Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") И Не НакладнаяПоЗаказам Тогда
		
		СтруктураВозврата.ДокументПоступление = Тип("ДокументСсылка.ПриемкаТоваровНаХранение");
		РаспоряжениеНаПриемку = Тип("ДокументСсылка.ПриемкаТоваровНаХранение");
		
	ИначеЕсли ЗакупкиСервер.РаспоряжениеНаПриемкуТовараЗаказ(ВариантПриемкиТоваров) Тогда 
		
		СтруктураВозврата.ДокументПоступление = Тип("ДокументСсылка.ЗаказПоставщику");
		РаспоряжениеНаПриемку = Тип("ДокументСсылка.ЗаказПоставщику");
		
	Иначе
		
		СтруктураВозврата.ДокументПоступление = Тип("ДокументСсылка.ЗаказПоставщику");
		РаспоряжениеНаПриемку = Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
		
	КонецЕсли;
	
	СтруктураВозврата.ЭтоРаспоряжение = (ТипСсылки = РаспоряжениеНаПриемку);
	СтруктураВозврата.ЭтоДокументПоступление = (ТипСсылки = СтруктураВозврата.ДокументПоступление);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьПозициюДляВставки(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая, СтрокаИсточник)
	
	Адрес = СтрокаИсточник.Адрес;
	КоллекцияРаспоряжений = РаспоряженияНаДоставку.ПолучитьЭлементы(); // ДанныеФормыКоллекцияЭлементовДерева
	Если ЗонаГруппаИлиПустая Тогда
		Для Каждого СтрокаЗона Из КоллекцияРаспоряжений Цикл
			Если СтрокаИсточник.Зона = СтрокаЗона.Зона Тогда
				Ветка = СтрокаЗона.ПолучитьЭлементы(); // ДанныеФормыКоллекцияЭлементовДерева
				Для Каждого СтрокаРаспоряжение Из Ветка Цикл
					Если Адрес < СтрокаРаспоряжение.Адрес Тогда
						Возврат Новый Структура("Зона, Распоряжение", КоллекцияРаспоряжений.Индекс(СтрокаЗона), Ветка.Индекс(СтрокаРаспоряжение));
					КонецЕсли;
				КонецЦикла;
				Возврат Новый Структура("Зона, Распоряжение", КоллекцияРаспоряжений.Индекс(СтрокаЗона), Макс(0,Ветка.Количество()));
			ИначеЕсли Строка(СтрокаИсточник.Зона) < Строка(СтрокаЗона.Зона) Тогда
				НоваяСтрока = КоллекцияРаспоряжений.Вставить(КоллекцияРаспоряжений.Индекс(СтрокаЗона));
				НоваяСтрока.Зона  = СтрокаИсточник.Зона;
				НоваяСтрока.Адрес = СтрокаИсточник.Зона;
				НоваяСтрока.ОформлениеСтроки = 5;
				Возврат Новый Структура("Зона, Распоряжение", КоллекцияРаспоряжений.Индекс(НоваяСтрока), 0);
			КонецЕсли;
		КонецЦикла;
		НоваяСтрока = КоллекцияРаспоряжений.Добавить();
		НоваяСтрока.Зона  = СтрокаИсточник.Зона;
		НоваяСтрока.Адрес = СтрокаИсточник.Зона;
		НоваяСтрока.ОформлениеСтроки = 5;
		Возврат Новый Структура("Зона, Распоряжение", КоллекцияРаспоряжений.Количество() - 1, 0);
	Иначе
		Для Каждого СтрокаРаспоряжение Из КоллекцияРаспоряжений Цикл
			Если Адрес < СтрокаРаспоряжение.Адрес Тогда
				Возврат Новый Структура("Зона, Распоряжение", 0, КоллекцияРаспоряжений.Индекс(СтрокаРаспоряжение));
			КонецЕсли;
		КонецЦикла;
		Возврат Новый Структура("Зона, Распоряжение", 0, КоллекцияРаспоряжений.Количество());
	КонецЕсли;
	
КонецФункции

Процедура РекурсивноУстановитьДоступностьАдресовЗаполнитьСпискиВремени(ЭлементыФормы, РедактированиеРазрешено)
	
	Для Каждого ЭлементФормы Из ЭлементыФормы Цикл
		
		Если ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы")
			Или ТипЗнч(ЭлементФормы) = Тип("ТаблицаФормы") Тогда
			РекурсивноУстановитьДоступностьАдресовЗаполнитьСпискиВремени(ЭлементФормы.ПодчиненныеЭлементы, РедактированиеРазрешено);
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ПолеФормы")
			И ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода Тогда
			ИмяЭлемента = ВРег(ЭлементФормы.Имя);
			Если Не РедактированиеРазрешено
				И СтрНайти(ИмяЭлемента, "АДРЕС") > 0
				И ИмяЭлемента <> "АДРЕСДОСТАВКИДЛЯПОСТАВЩИКА" Тогда
				ЭлементФормы.РедактированиеТекста = Ложь;
				ЭлементФормы.КнопкаОчистки = Истина;
			КонецЕсли;
			Если СтрНайти(ИмяЭлемента, "ВРЕМЯДОСТАВКИ") > 0 Тогда
				ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(ЭлементФормы);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РеквизитыДоставки(ДокОбъект)
	
	ПолучательОтправитель = ПолучательОтправитель(ДокОбъект);
	РеквизитыДоставки = ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки(
		ДокОбъект,
		ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20());
	РеквизитыДоставки.Вставить(ПолучательОтправитель.ИмяПоля, ПолучательОтправитель.Значение);
	РеквизитыДоставки.Вставить("Ссылка");
	РеквизитыДоставки.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	РеквизитыДоставки.Вставить("Грузополучатель", Справочники.Контрагенты.ПустаяСсылка());
	ЗаполнитьЗначенияСвойств(РеквизитыДоставки, ДокОбъект);
	РеквизитыДоставки.Вставить("ПолучательОтправитель", ПолучательОтправитель);
	
	Возврат РеквизитыДоставки;
	
КонецФункции

// Перезаполняет реквизиты доставки при изменении реквизиты формы
// Параметры:
//		ЭлементыФормы - ВсеЭлементыФормы - все элементы формы, в которой производятся изменения,
//		ДокОбъект - ДанныеФормыСтруктура - объект, реквизиты которого используются при заполнении.
//
Процедура ПриИзмененииПеревозчика(ЭлементыФормы, ДокОбъект)
	
	Если Не ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20() Тогда
		Возврат;
	КонецЕсли;
	
	Если (ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
			Или ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи) Тогда
		
		ДопИнфоИзмененоПользователем = ДоставкаТоваровКлиентСервер.ДопИнфоИзмененоПользователем(ЭлементыФормы, ДокОбъект);
		ЗаполнитьСписокВыбораАдресовПеревозчика(ЭлементыФормы, ДокОбъект);
		ЗаполнитьРеквизитыПоПеревозчику(ЭлементыФормы, ДокОбъект, ДопИнфоИзмененоПользователем);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДополнитьТекстРаспоряжениемИДопИнфо(Знач ДопИнфоИзменяемое, ДопИнфоДляДобавления, Распоряжение)
	
	Результат = ДопИнфоИзменяемое;
	
	Если Не ПустаяСтрока(ДопИнфоДляДобавления) Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Распоряжение, "Номер, Дата");
		ТекстДопИнфо = НСтр("ru = '%Распоряжение% %Номер% от %Дата%: %ДопИнфо%'");
		
		ТекстДопИнфо = СтрЗаменить(ТекстДопИнфо,"%Распоряжение%",Строка(ТипЗнч(Распоряжение)));
		ТекстДопИнфо = СтрЗаменить(ТекстДопИнфо,"%Номер%",
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
		ТекстДопИнфо = СтрЗаменить(ТекстДопИнфо, "%Дата%", Формат(Реквизиты.Дата,"ДФ=dd.MM.yy"));
		ТекстДопИнфо = СтрЗаменить(ТекстДопИнфо, "%ДопИнфо%", ДопИнфоДляДобавления);
		
		Если СтрНайти(ДопИнфоИзменяемое, ТекстДопИнфо) = 0 Тогда
			Результат = Результат + ?(ЗначениеЗаполнено(Результат), Символы.ПС, "") + ТекстДопИнфо;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОсобыеУсловияПеревозкиУстановитьДоступность(ЭлементыФормы, ДокОбъект)
	
	Если ЭлементыФормы.Найти("ОсобыеУсловияПеревозкиОписание") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОсобыеУсловияПеревозки = ДокОбъект.ОсобыеУсловияПеревозки;
	ЭлементыФормы.ОсобыеУсловияПеревозкиОписание.Доступность = ОсобыеУсловияПеревозки;
	Если ЭлементыФормы.Найти("ОсобыеУсловияПеревозкиОписание1") <> Неопределено Тогда
		ЭлементыФормы.ОсобыеУсловияПеревозкиОписание1.Доступность = ОсобыеУсловияПеревозки;
	КонецЕсли;
	Если ЭлементыФормы.Найти("ОсобыеУсловияПеревозкиОписание2") <> Неопределено Тогда
		ЭлементыФормы.ОсобыеУсловияПеревозкиОписание2.Доступность = ОсобыеУсловияПеревозки;
	КонецЕсли;
	Если ЭлементыФормы.Найти("ОсобыеУсловияПеревозкиОписаниеДоставкаПеревозчиком") <> Неопределено Тогда
		ЭлементыФормы.ОсобыеУсловияПеревозкиОписаниеДоставкаПеревозчиком.Доступность = ОсобыеУсловияПеревозки;
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление, ЕстьОрдерныйСклад, ЕстьНеОрдерныйСклад, ДоставкаПолучателям)
	
	Если ВыборочноеОбновление Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОбновляемыеРаспоряжения.Распоряжение,
		|	ОбновляемыеРаспоряжения.Склад
		|ПОМЕСТИТЬ ОбновляемыеРаспоряжения
		|ИЗ
		|	&ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК Распоряжение,
		|	НЕОПРЕДЕЛЕНО КАК Склад
		|ПОМЕСТИТЬ ОбновляемыеРаспоряжения";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
		ТекстЗапросаВтРаспоряженияНаДоставку(ДоставкаПолучателям);
	
	ШаблонВыборкаДвиженийКРаспределению = ?(ДоставкаПолучателям,
		"ВЫБРАТЬ
		|	ТаблицыИсточника.Склад                  КАК Склад,
		|	ТаблицыИсточника.Распоряжение           КАК Распоряжение,
		|	ТаблицыИсточника.ПолучательОтправитель  КАК ПолучательОтправитель,
		|	ТаблицыИсточника.СпособДоставки         КАК СпособДоставки,
		|	ТаблицыИсточника.Зона                   КАК Зона,
		|	ТаблицыИсточника.Перевозчик             КАК Перевозчик,
		|	ТаблицыИсточника.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
		|	ТаблицыИсточника.Номенклатура           КАК Номенклатура,
		|	ТаблицыИсточника.Характеристика         КАК Характеристика,
		|	ТаблицыИсточника.Назначение             КАК Назначение,
		|	ТаблицыИсточника.Серия                  КАК Серия,
		|	ТаблицыИсточника.Количество             КАК Количество
		|ИЗ
		|	ИмяТаблицыИсточника КАК ТаблицыИсточника",
		"ВЫБРАТЬ
		|	ТаблицыИсточника.Период         КАК Период,
		|	ТаблицыИсточника.Распоряжение   КАК Распоряжение,
		|	ТаблицыИсточника.Номенклатура   КАК Номенклатура,
		|	ТаблицыИсточника.Характеристика КАК Характеристика,
		|	ТаблицыИсточника.Назначение     КАК Назначение,
		|	ТаблицыИсточника.Склад          КАК Склад,
		|	ТаблицыИсточника.Количество     КАК Количество,
		|	ТаблицыИсточника.Вес            КАК Вес,
		|	ТаблицыИсточника.Объем          КАК Объем
		|ИЗ
		|	ИмяТаблицыИсточника КАК ТаблицыИсточника");
	
	ШаблонВыборкаРаспоряжений = 
	"ВЫБРАТЬ
	|	ТаблицыИсточника.Дата                   КАК Дата,
	|	ТаблицыИсточника.Номенклатура           КАК Номенклатура,
	|	ТаблицыИсточника.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	|	ТаблицыИсточника.Характеристика         КАК Характеристика,
	|	ТаблицыИсточника.Назначение             КАК Назначение,
	|	ТаблицыИсточника.Серия                  КАК Серия,
	|	ТаблицыИсточника.Количество             КАК Количество,
	|	ТаблицыИсточника.Вес                    КАК Вес,
	|	ТаблицыИсточника.Объем                  КАК Объем,
	|	ТаблицыИсточника.Склад                  КАК Склад,
	|	ТаблицыИсточника.Распоряжение           КАК Распоряжение,
	|	ТаблицыИсточника.ПолучательОтправитель  КАК ПолучательОтправитель,
	|	ТаблицыИсточника.ВидРаспоряжения        КАК ВидРаспоряжения,
	|	ТаблицыИсточника.Номер                  КАК Номер,
	|	ТаблицыИсточника.Адрес                  КАК Адрес,
	|	ТаблицыИсточника.АдресЗначенияПолей     КАК АдресЗначенияПолей,
	|	ТаблицыИсточника.СпособДоставки         КАК СпособДоставки,
	|	ТаблицыИсточника.Картинка               КАК Картинка,
	|	ТаблицыИсточника.Зона                   КАК Зона,
	|	ТаблицыИсточника.ЗонаПредставление      КАК ЗонаПредставление,
	|	ТаблицыИсточника.Перевозчик             КАК Перевозчик,
	|	ТаблицыИсточника.ВремяС                 КАК ВремяС,
	|	ТаблицыИсточника.ВремяПо                КАК ВремяПо,
	|	ТаблицыИсточника.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ТаблицыИсточника.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ТаблицыИсточника.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ТаблицыИсточника.ПолеУпорядочивания     КАК ПолеУпорядочивания
	|ИЗ
	|	ИмяТаблицыИсточника КАК ТаблицыИсточника";
	
	ТекстИсточникиДвиженийКРаспределению = "";
	ТекстИсточникиРаспоряжений = "";
	
	Если ЕстьОрдерныйСклад Тогда
		
		ТекстЗапроса = ТекстЗапроса
			+ ОбщегоНазначения.РазделительПакетаЗапросов()
			+ ?(ДоставкаПолучателям,
				ТекстЗапросаРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме(),
				ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме());
		
		ИмяТаблицыКРаспределению = "ВтДвиженияКРаспределениюПоОрдернойСхеме";
		ИмяТаблицыРаспоряжений = ?(ДоставкаПолучателям,
			"ВтРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме",
			"ВтРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме");
		
		ТекстИсточникДвиженийКРаспределению = СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
			"ИмяТаблицыИсточника",
			ИмяТаблицыКРаспределению);
		ТекстИсточникРаспоряжений = СтрЗаменить(ШаблонВыборкаРаспоряжений,
			"ИмяТаблицыИсточника",
			ИмяТаблицыРаспоряжений);
		
		ТекстИсточникиДвиженийКРаспределению = ТекстИсточникДвиженийКРаспределению;
		ТекстИсточникиРаспоряжений = ТекстИсточникРаспоряжений;
		
	КонецЕсли;
	
	Если ЕстьНеОрдерныйСклад Тогда
		ТекстЗапроса = ТекстЗапроса
			+ ОбщегоНазначения.РазделительПакетаЗапросов()
			+ ?(ДоставкаПолучателям,
				ТекстЗапросаРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы(),
				ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы());
		
		ИмяТаблицыКРаспределению = "ВтДвиженияКРаспределениюБезОрдернойСхемы";
		ИмяТаблицыРаспоряжений = ?(ДоставкаПолучателям,
			"ВтРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы",
			"ВтРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы");
		
		ТекстИсточникДвиженийКРаспределению = СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
			"ИмяТаблицыИсточника",
			ИмяТаблицыКРаспределению);
		ТекстИсточникРаспоряжений = СтрЗаменить(ШаблонВыборкаРаспоряжений,
			"ИмяТаблицыИсточника",
			ИмяТаблицыРаспоряжений);
		
		ТекстИсточникиДвиженийКРаспределению = ?(ПустаяСтрока(ТекстИсточникиДвиженийКРаспределению),
			ТекстИсточникДвиженийКРаспределению,
			ТекстИсточникиДвиженийКРаспределению
			+ "
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|"
			+ ТекстИсточникДвиженийКРаспределению);
			
		ТекстИсточникиРаспоряжений = ?(ПустаяСтрока(ТекстИсточникиРаспоряжений),
			ТекстИсточникРаспоряжений,
			ТекстИсточникиРаспоряжений
			+ "
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|"
			+ ТекстИсточникРаспоряжений);
		
	КонецЕсли;
	
	ТекстИсключенныхРаспоряжений =
		"
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТаблицаИсключенныхРаспоряжений
		|		ПО ТаблицаИсключенныхРаспоряжений.ЗаданиеНаПеревозку = ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка)
		|			И ТаблицыИсточника.Склад = ТаблицаИсключенныхРаспоряжений.Склад
		|			И ТаблицыИсточника.Распоряжение = ТаблицаИсключенныхРаспоряжений.Распоряжение
		|			И ТаблицыИсточника.Номенклатура = ТаблицаИсключенныхРаспоряжений.Номенклатура
		|			И ТаблицыИсточника.Характеристика = ТаблицаИсключенныхРаспоряжений.Характеристика
		|			И ТаблицыИсточника.Назначение = ТаблицаИсключенныхРаспоряжений.Назначение
		|			И &УсловиеПоСерии
		|
		|ГДЕ
		|	ТаблицаИсключенныхРаспоряжений.ЗаданиеНаПеревозку ЕСТЬ NULL";
		
	Если ДоставкаПолучателям Тогда
		УсловиеПоСерии = "ТаблицыИсточника.Серия = ТаблицаИсключенныхРаспоряжений.Серия";
	Иначе
		УсловиеПоСерии = "ИСТИНА";
	КонецЕсли;
	
	ТекстИсключенныхРаспоряжений = СтрЗаменить(ТекстИсключенныхРаспоряжений,
		"&УсловиеПоСерии",
		УсловиеПоСерии);
	
	ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению = 
		СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
			"ИмяТаблицыИсточника",
			"("
			+ ТекстИсточникиДвиженийКРаспределению
			+ ")");
	
	ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению = ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению
		+ ТекстИсключенныхРаспоряжений;
	
	Если Не ДоставкаПолучателям Тогда
		ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению = ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению
			+
			"
			|УПОРЯДОЧИТЬ ПО
			|	ТаблицыИсточника.Период";
	КонецЕсли;
	
	ФинальныйТекстЗапросаИсточникиРаспоряжений = 
		СтрЗаменить(ШаблонВыборкаРаспоряжений,
			"ИмяТаблицыИсточника",
			"("
			+ ТекстИсточникиРаспоряжений
			+ ")");
	
	ФинальныйТекстЗапросаИсточникиРаспоряжений = ФинальныйТекстЗапросаИсточникиРаспоряжений
		+ ТекстИсключенныхРаспоряжений;
	
	ТекстЗапросаУпорядочивание = "";
	Если Не ДоставкаПолучателям
		И ЕстьОрдерныйСклад Тогда
		ТекстЗапросаУпорядочивание = 
		"
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицыИсточника.ЗонаПредставление,
		|	ТаблицыИсточника.Зона,
		|	ТаблицыИсточника.Распоряжение,
		|	ТаблицыИсточника.Склад,
		|	ТаблицыИсточника.Номенклатура,
		|	ТаблицыИсточника.Характеристика,
		|	ТаблицыИсточника.Назначение,
		|	ТаблицыИсточника.Серия,
		|	ТаблицыИсточника.Дата";
	Иначе
		ТекстЗапросаУпорядочивание = 
		"
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицыИсточника.ЗонаПредставление,
		|	ТаблицыИсточника.Зона,
		|	ТаблицыИсточника.ПолеУпорядочивания,
		|	ТаблицыИсточника.ПолучательОтправитель,
		|	ТаблицыИсточника.Распоряжение,
		|	ТаблицыИсточника.Склад,
		|	ТаблицыИсточника.Номенклатура,
		|	ТаблицыИсточника.Характеристика,
		|	ТаблицыИсточника.Назначение,
		|	ТаблицыИсточника.Серия,
		|	ТаблицыИсточника.Дата";
	КонецЕсли;
	
	ФинальныйТекстЗапросаИсточникиРаспоряжений = ФинальныйТекстЗапросаИсточникиРаспоряжений
		+ ТекстЗапросаУпорядочивание;
	
	ТекстЗапроса = ТекстЗапроса
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ФинальныйТекстЗапросаИсточникиРаспоряжений;
		
	Если Не ВыборочноеОбновление Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения",
		"ЛЕВОЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("СправочникНоменклатура.ЕдиницаИзмерения", "СправочникНоменклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("СправочникНоменклатура.ЕдиницаИзмерения", "СправочникНоменклатура"));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРаспоряженияНаДоставку(ДоставкаПолучателям)
	
	ТекстЗапроса = "";
	
	Если ДоставкаПолучателям Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	РаспоряженияНаДоставку.Дата,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
		|ПОМЕСТИТЬ РаспоряженияНаДоставку
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
		|		ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (ТоварыКДоставке.Склад = РаспоряженияНаДоставку.Склад)
		|			И (ТоварыКДоставке.ВсеТовары)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения
		|		ПО РаспоряженияНаДоставку.Распоряжение = ОбновляемыеРаспоряжения.Распоряжение
		|			И РаспоряженияНаДоставку.Склад = ОбновляемыеРаспоряжения.Склад
		|ГДЕ
		|	(ТоварыКДоставке.Распоряжение ЕСТЬ NULL
		|			ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПодбор
		|			ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийНаПеревозку.Закрыто)
		|			ИЛИ НЕ ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен)
		|	И РаспоряженияНаДоставку.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка)
		|	И ВЫБОР
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиКПолучателю)
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомКПолучателю)
		|			ИНАЧЕ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиКПолучателю)
		|					ИЛИ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомКПолучателю)
		|		КОНЕЦ
		|	И (&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспоряженияНаДоставку.Распоряжение,
		|	РаспоряженияНаДоставку.Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	РаспоряженияНаДоставку.Дата,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗадания
		|		ПО (РаспоряженияЗадания.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (РаспоряженияЗадания.Склад = РаспоряженияНаДоставку.Склад)
		|			И (РаспоряженияЗадания.Ссылка = &ЗаданиеНаПеревозкуПодбор)
		|			И (РаспоряженияНаДоставку.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка))
		|ГДЕ
		|	(&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Распоряжение,
		|	Склад";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	РаспоряженияНаДоставку.Номер КАК Номер,
		|	РаспоряженияНаДоставку.Дата КАК Дата,
		|	РаспоряженияНаДоставку.Адрес КАК Адрес,
		|	РаспоряженияНаДоставку.АдресЗначенияПолей КАК АдресЗначенияПолей,
		|	РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
		|	РаспоряженияНаДоставку.Зона КАК Зона,
		|	РаспоряженияНаДоставку.Перевозчик КАК Перевозчик,
		|	РаспоряженияНаДоставку.ВремяС КАК ВремяС,
		|	РаспоряженияНаДоставку.ВремяПо КАК ВремяПо,
		|	РаспоряженияНаДоставку.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
		|	ВЫБОР
		|		КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(РаспоряженияНаДоставку.Перевозчик)
		|		ИНАЧЕ РаспоряженияНаДоставку.Адрес
		|	КОНЕЦ КАК ПолеУпорядочения
		|ПОМЕСТИТЬ РаспоряженияНаДоставку
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
		|		ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (ТоварыКДоставке.Склад = РаспоряженияНаДоставку.Склад)
		|			И (ТоварыКДоставке.ВсеТовары)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения
		|		ПО РаспоряженияНаДоставку.Распоряжение = ОбновляемыеРаспоряжения.Распоряжение
		|			И РаспоряженияНаДоставку.Склад = ОбновляемыеРаспоряжения.Склад
		|ГДЕ
		|	(ТоварыКДоставке.Распоряжение ЕСТЬ NULL
		|			ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПодбор
		|			ИЛИ НЕ ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен)
		|	И РаспоряженияНаДоставку.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка)
		|	И ВЫБОР
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|			ИНАЧЕ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|					ИЛИ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|		КОНЕЦ
		|	И (&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|	И (НЕ (РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса)
		|		ИЛИ (НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.СоглашенияСПоставщиками
		|			 И НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.ДоговорыКонтрагентов)
		|		)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
		|	РаспоряженияНаДоставку.Склад КАК Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	РаспоряженияНаДоставку.Номер,
		|	РаспоряженияНаДоставку.Дата,
		|	РаспоряженияНаДоставку.Адрес,
		|	РаспоряженияНаДоставку.АдресЗначенияПолей,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	РаспоряженияНаДоставку.ВремяС,
		|	РаспоряженияНаДоставку.ВремяПо,
		|	РаспоряженияНаДоставку.ДополнительнаяИнформация,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
		|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание,
		|	ВЫБОР
		|		КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(РаспоряженияНаДоставку.Перевозчик)
		|		ИНАЧЕ РаспоряженияНаДоставку.Адрес
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗадания
		|		ПО (РаспоряженияЗадания.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
		|			И (РаспоряженияЗадания.Склад = РаспоряженияНаДоставку.Склад)
		|			И (РаспоряженияЗадания.Ссылка = &ЗаданиеНаПеревозкуПодбор)
		|			И (РаспоряженияНаДоставку.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияДоставки.ТребуетсяДоставка))
		|ГДЕ
		|	(&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|	И (НЕ (РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|			И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса)
		|		ИЛИ (НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.СоглашенияСПоставщиками
		|			 И НЕ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.ДоговорыКонтрагентов)
		|		)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспоряженияНаДоставку.Распоряжение,
		|	РаспоряженияНаДоставку.Склад,
		|	(РаспоряженияНаДоставку.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
		|		И РаспоряженияНаДоставку.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= &ТекущаяДатаСеанса) КАК ЭтоОрдерныйСклад,
		|	РаспоряженияНаДоставку.ПолучательОтправитель,
		|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение) КАК ВидРаспоряжения,
		|	NULL КАК Номер,
		|	РаспоряженияНаДоставку.Дата,
		|	NULL КАК Адрес,
		|	NULL КАК АдресЗначенияПолей,
		|	РаспоряженияНаДоставку.СпособДоставки,
		|	РаспоряженияНаДоставку.Зона,
		|	РаспоряженияНаДоставку.Перевозчик,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрСведений.СостоянияИРеквизитыДоставки КАК РаспоряженияНаДоставку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения
		|		ПО РаспоряженияНаДоставку.Распоряжение = ОбновляемыеРаспоряжения.Распоряжение
		|			И РаспоряженияНаДоставку.Склад = ОбновляемыеРаспоряжения.Склад
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|			КОГДА &ОтборПоТипуИсполнителей = ЗНАЧЕНИЕ(Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик)
		|				ТОГДА РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|			ИНАЧЕ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиНашимиСиламиОтОтправителя)
		|					ИЛИ РаспоряженияНаДоставку.СпособДоставки В (&СпособыДоставкиПеревозчикомОтОтправителя)
		|		КОНЕЦ
		|	И (&БезОтбораПоЗоне
		|			ИЛИ РаспоряженияНаДоставку.Зона В ИЕРАРХИИ (&Зона))
		|	И (РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
		|			ИЛИ РаспоряженияНаДоставку.Склад В ИЕРАРХИИ (&Склад))
		|	И (РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.СоглашенияСПоставщиками
		|		ИЛИ РаспоряженияНаДоставку.Распоряжение ССЫЛКА Справочник.ДоговорыКонтрагентов)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Распоряжение,
		|	Склад";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧастичноДоставленныеЗаказы.Склад             КАК Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение      КАК Распоряжение,
	|	РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|	РаспоряженияНаДоставку.СпособДоставки        КАК СпособДоставки,
	|	РаспоряженияНаДоставку.Зона                  КАК Зона,
	|	РаспоряженияНаДоставку.Перевозчик            КАК Перевозчик,
	|	NULL                                         КАК ОсобыеУсловияПеревозки,
	|	ЧастичноДоставленныеЗаказы.Номенклатура      КАК Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика    КАК Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение        КАК Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия             КАК Серия,
	|	СУММА(ЧастичноДоставленныеЗаказы.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюПоОрдернойСхеме
	|ИЗ
	|	РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ЧастичноДоставленныеЗаказы
	|		ПО РаспоряженияНаДоставку.Распоряжение = ЧастичноДоставленныеЗаказы.Распоряжение
	|			И РаспоряженияНаДоставку.Склад = ЧастичноДоставленныеЗаказы.Склад
	|			И (НЕ ЧастичноДоставленныеЗаказы.ВсеТовары)
	|			И (РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|				ИЛИ РаспоряженияНаДоставку.СпособДоставки
	|					= ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗадания
	|		ПО ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку = РаспоряженияЗадания.Ссылка
	|			И ЧастичноДоставленныеЗаказы.Распоряжение = РаспоряженияЗадания.Распоряжение
	|ГДЕ
	|	(ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|		И ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку.Проведен
	|		И ВЫБОР
	|				КОГДА РаспоряженияЗадания.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийНаПеревозку.Закрыто)
	|					ТОГДА РаспоряженияЗадания.Доставлено
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|			ИЛИ ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧастичноДоставленныеЗаказы.Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение,
	|	РаспоряженияНаДоставку.ПолучательОтправитель,
	|	РаспоряженияНаДоставку.СпособДоставки,
	|	РаспоряженияНаДоставку.Зона,
	|	РаспоряженияНаДоставку.Перевозчик,
	|	ЧастичноДоставленныеЗаказы.Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЧастичноДоставленныеЗаказы.Количество) > 0
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКОтгрузкеДетально.ДатаОтгрузки КАК Дата,
	|	ТоварыКОтгрузкеДетально.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеДетально.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	|	ТоварыКОтгрузкеДетально.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеДетально.Назначение КАК Назначение,
	|	ТоварыКОтгрузкеДетально.Серия КАК Серия,
	|	ТоварыКОтгрузкеДетально.Количество КАК Количество,
	|	ТоварыКОтгрузкеДетально.Вес КАК Вес,
	|	ТоварыКОтгрузкеДетально.Объем КАК Объем,
	|	ТоварыКОтгрузкеДетально.Склад КАК Склад,
	|	ТоварыКОтгрузкеДетально.Распоряжение КАК Распоряжение,
	|	ТоварыКОтгрузкеДетально.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеДетально.Распоряжение) КАК ВидРаспоряжения,
	|	СостоянияИРеквизитыДоставки.Номер КАК Номер,
	|	СостоянияИРеквизитыДоставки.Адрес КАК Адрес,
	|	СостоянияИРеквизитыДоставки.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ТоварыКОтгрузкеДетально.СпособДоставки КАК СпособДоставки,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеДетально.ЭтоПоручениеЭкспедитору
	|			ТОГДА 4
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТоварыКОтгрузкеДетально.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|					ТОГДА 0
	|				КОГДА ТоварыКОтгрузкеДетально.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу))
	|					ТОГДА 1
	|				ИНАЧЕ 2
	|			КОНЕЦ + ВЫБОР
	|				КОГДА СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки
	|					ТОГДА 3
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Картинка,
	|	ТоварыКОтгрузкеДетально.Зона КАК Зона,
	|	ТоварыКОтгрузкеДетально.Зона.Наименование КАК ЗонаПредставление,
	|	ТоварыКОтгрузкеДетально.Перевозчик КАК Перевозчик,
	|	СостоянияИРеквизитыДоставки.ВремяС КАК ВремяС,
	|	СостоянияИРеквизитыДоставки.ВремяПо КАК ВремяПо,
	|	СостоянияИРеквизитыДоставки.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеДетально.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ТоварыКОтгрузкеДетально.Перевозчик)
	|		ИНАЧЕ СостоянияИРеквизитыДоставки.Адрес
	|	КОНЕЦ КАК ПолеУпорядочивания
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		МАКСИМУМ(
	|			ВЫБОР КОГДА
	|				НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|					ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ)
	|			КОНЕЦ) КАК ДатаОтгрузки,
	|		ВЫБОР КОГДА
	|			НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ)
	|		КОНЕЦ КАК ПолеГруппировкиПросроченныхДатОтгрузки,
	|		ТоварыСУчетомДоставленных.Номенклатура КАК Номенклатура,
	|		ТоварыСУчетомДоставленных.Характеристика КАК Характеристика,
	|		ТоварыСУчетомДоставленных.Назначение КАК Назначение,
	|		ТоварыСУчетомДоставленных.Серия КАК Серия,
	|		РаспоряженияНаДоставку.Склад                 КАК Склад,
	|		РаспоряженияНаДоставку.Распоряжение          КАК Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки        КАК СпособДоставки,
	|		РаспоряженияНаДоставку.Зона                  КАК Зона,
	|		РаспоряженияНаДоставку.Перевозчик            КАК Перевозчик,
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке) КАК Количество,      // Количество
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке * &ТекстЗапросаВесУпаковки) КАК Вес,
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке * &ТекстЗапросаОбъемУпаковки) КАК Объем,
	|		ЛОЖЬ КАК ЭтоПоручениеЭкспедитору,
	|		ТоварыСУчетомДоставленных.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке КАК ТоварыСУчетомДоставленных
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыСУчетомДоставленных.ДокументОтгрузки = РаспоряженияНаДоставку.Распоряжение
	|			И ТоварыСУчетомДоставленных.Склад = РаспоряженияНаДоставку.Склад
	|			И РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО ТоварыСУчетомДоставленных.Номенклатура = СправочникНоменклатура.Ссылка
	|	ГДЕ
	|		ТоварыСУчетомДоставленных.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР КОГДА
	|			НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|				ТОГДА НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыСУчетомДоставленных.Период, ДЕНЬ)
	|		КОНЕЦ,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		ТоварыСУчетомДоставленных.Номенклатура,
	|		ТоварыСУчетомДоставленных.Характеристика,
	|		ТоварыСУчетомДоставленных.Назначение,
	|		ТоварыСУчетомДоставленных.Серия,
	|		ТоварыСУчетомДоставленных.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|	ИМЕЮЩИЕ
	|		СУММА(ТоварыСУчетомДоставленных.КОтгрузке) > 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		РаспоряженияНаДоставку.Зона,
	|		NULL,
	|		0,
	|		0,
	|		0,
	|		ИСТИНА,
	|		ЛОЖЬ
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
	|	ГДЕ
	|		ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|		И РаспоряженияНаДоставку.СпособДоставки В (
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуСоСклада),
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте)
	|			)
	|	) КАК ТоварыКОтгрузкеДетально
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|	ПО ТоварыКОтгрузкеДетально.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение
	|		И ТоварыКОтгрузкеДетально.Склад = СостоянияИРеквизитыДоставки.Склад";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧастичноДоставленныеЗаказы.Склад              КАК Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение       КАК Распоряжение,
	|	NULL                                          КАК ПолучательОтправитель,
	|	РаспоряженияНаДоставку.СпособДоставки         КАК СпособДоставки,
	|	NULL                                          КАК Зона,
	|	NULL                                          КАК Перевозчик,
	|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ЧастичноДоставленныеЗаказы.Номенклатура       КАК Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика     КАК Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение         КАК Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия              КАК Серия,
	|	СУММА(ЧастичноДоставленныеЗаказы.Количество)  КАК Количество
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюБезОрдернойСхемы
	|ИЗ
	|	РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ЧастичноДоставленныеЗаказы
	|		ПО РаспоряженияНаДоставку.Распоряжение = ЧастичноДоставленныеЗаказы.Распоряжение
	|			И РаспоряженияНаДоставку.Склад = ЧастичноДоставленныеЗаказы.Склад
	|			И НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|			И (НЕ ЧастичноДоставленныеЗаказы.ВсеТовары)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗадания
	|		ПО ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку = РаспоряженияЗадания.Ссылка
	|			И ЧастичноДоставленныеЗаказы.Распоряжение = РаспоряженияЗадания.Распоряжение
	|ГДЕ
	|	(ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|		И ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку.Проведен
	|		И ВЫБОР
	|				КОГДА РаспоряженияЗадания.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийНаПеревозку.Закрыто)
	|					ТОГДА РаспоряженияЗадания.Доставлено
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|			ИЛИ ЧастичноДоставленныеЗаказы.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧастичноДоставленныеЗаказы.Склад,
	|	ЧастичноДоставленныеЗаказы.Распоряжение,
	|	РаспоряженияНаДоставку.СпособДоставки,
	|	РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
	|	ЧастичноДоставленныеЗаказы.Номенклатура,
	|	ЧастичноДоставленныеЗаказы.Характеристика,
	|	ЧастичноДоставленныеЗаказы.Назначение,
	|	ЧастичноДоставленныеЗаказы.Серия
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЗ.Дата КАК Дата,
	|	ВЗ.Номенклатура КАК Номенклатура,
	|	ВЗ.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения,
	|	ВЗ.Характеристика КАК Характеристика,
	|	ВЗ.Назначение КАК Назначение,
	|	ВЗ.Серия КАК Серия,
	|	ВЗ.Количество КАК Количество,
	|	ВЗ.Количество * &ТекстЗапросаВесУпаковки КАК Вес,
	|	ВЗ.Количество * &ТекстЗапросаОбъемУпаковки КАК Объем,
	|	ВЗ.Склад КАК Склад,
	|	ВЗ.Распоряжение КАК Распоряжение,
	|	ДопРеквизиты.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ТИПЗНАЧЕНИЯ(ВЗ.Распоряжение) КАК ВидРаспоряжения,
	|	ДопРеквизиты.Номер КАК Номер,
	|	ДопРеквизиты.Адрес КАК Адрес,
	|	ДопРеквизиты.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ВЗ.СпособДоставки КАК СпособДоставки,
	|	ВЗ.Картинка КАК Картинка,
	|	ЕСТЬNULL(ДопРеквизиты.Зона, ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяСсылка)) КАК Зона,
	|	ДопРеквизиты.Зона.Наименование КАК ЗонаПредставление,
	|	ДопРеквизиты.Перевозчик КАК Перевозчик,
	|	ДопРеквизиты.ВремяС КАК ВремяС,
	|	ДопРеквизиты.ВремяПо КАК ВремяПо,
	|	ДопРеквизиты.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ДопРеквизиты.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ДопРеквизиты.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ВЫБОР
	|		КОГДА ВЗ.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ДопРеквизиты.Перевозчик)
	|		ИНАЧЕ ДопРеквизиты.Адрес
	|	КОНЕЦ КАК ПолеУпорядочивания
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТоварыКОтгрузке.Период, ДЕНЬ) КАК Дата,
	|		РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
	|		РаспоряженияНаДоставку.Склад КАК Склад,
	|		ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	|		ТоварыКОтгрузке.Характеристика КАК Характеристика,
	|		ТоварыКОтгрузке.Назначение КАК Назначение,
	|		ТоварыКОтгрузке.Серия КАК Серия,
	|		РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
	|		СУММА(ТоварыКОтгрузке.КОтгрузке) КАК Количество,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Картинка
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|			ПО РаспоряженияНаДоставку.Распоряжение = ТоварыКОтгрузке.ДокументОтгрузки
	|				И РаспоряженияНаДоставку.Склад = ТоварыКОтгрузке.Склад
	|				И НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|	ГДЕ
	|		ТоварыКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НАЧАЛОПЕРИОДА(ТоварыКОтгрузке.Период, ДЕНЬ),
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Склад,
	|		ТоварыКОтгрузке.Номенклатура,
	|		ТоварыКОтгрузке.Характеристика,
	|		ТоварыКОтгрузке.Назначение,
	|		ТоварыКОтгрузке.Серия,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	
	|	ИМЕЮЩИЕ
	|		СУММА(ТоварыКОтгрузке.КОтгрузке) > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.Склад,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		NULL,
	|		4
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
	|	ГДЕ
	|		РаспоряженияНаДоставку.СпособДоставки В
	|			(ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуСоСклада),
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|		И ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|	) КАК ВЗ
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК ДопРеквизиты
	|	ПО ВЗ.Распоряжение = ДопРеквизиты.Распоряжение
	|		И ВЗ.Склад = ДопРеквизиты.Склад
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|	ПО ВЗ.Номенклатура = СправочникНоменклатура.Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКПоступлениюОстатки.Склад КАК Склад,
	|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК Распоряжение,
	|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
	|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
	|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК Количество
	|ПОМЕСТИТЬ ТоварыКДоставкеОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(
	|			,
	|			(Склад, ДокументПоступления) В
	|				(ВЫБРАТЬ
	|					РаспоряженияНаДоставку.Склад,
	|					РаспоряженияНаДоставку.Распоряжение
	|				ИЗ
	|					РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ГДЕ
	|					РаспоряженияНаДоставку.ЭтоОрдерныйСклад)) КАК ТоварыКПоступлениюОстатки
	|ГДЕ
	|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДетальныеДанные.Склад КАК Склад,
	|	ДетальныеДанные.Распоряжение КАК Распоряжение,
	|	ДетальныеДанные.Номенклатура КАК Номенклатура,
	|	ДетальныеДанные.Характеристика КАК Характеристика,
	|	ДетальныеДанные.Назначение КАК Назначение,
	|	СУММА(ДетальныеДанные.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыСУчетомДоставленных
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКДоставкеОстатки.Склад КАК Склад,
	|		ТоварыКДоставкеОстатки.Распоряжение КАК Распоряжение,
	|		ТоварыКДоставкеОстатки.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставкеОстатки.Характеристика КАК Характеристика,
	|		ТоварыКДоставкеОстатки.Назначение КАК Назначение,
	|		ТоварыКДоставкеОстатки.Количество КАК Количество
	|	ИЗ
	|		ТоварыКДоставкеОстатки КАК ТоварыКДоставкеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКДоставкеОстатки.Склад,
	|		ТоварыКДоставкеОстатки.Распоряжение,
	|		ТоварыКДоставкеОстатки.Номенклатура,
	|		ТоварыКДоставкеОстатки.Характеристика,
	|		ТоварыКДоставкеОстатки.Назначение,
	|		-ЕСТЬNULL(ТоварыКДоставке.Количество, 0)
	|	ИЗ
	|		ТоварыКДоставкеОстатки КАК ТоварыКДоставкеОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО ТоварыКДоставкеОстатки.Склад = ТоварыКДоставке.Склад
	|				И ТоварыКДоставкеОстатки.Распоряжение = ТоварыКДоставке.Распоряжение
	|				И ТоварыКДоставкеОстатки.Номенклатура = ТоварыКДоставке.Номенклатура
	|				И ТоварыКДоставкеОстатки.Характеристика = ТоварыКДоставке.Характеристика
	|				И ТоварыКДоставкеОстатки.Назначение = ТоварыКДоставке.Назначение
	|	ГДЕ
	|		(ТоварыКДоставке.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|					И ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен
	|				ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|		И НЕ ТоварыКДоставке.ВсеТовары) КАК ДетальныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетальныеДанные.Склад,
	|	ДетальныеДанные.Распоряжение,
	|	ДетальныеДанные.Номенклатура,
	|	ДетальныеДанные.Характеристика,
	|	ДетальныеДанные.Назначение
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДетальныеДанные.Количество) > 0
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКПоступлению.Период КАК Период,
	|	ТоварыКПоступлению.ДокументПоступления КАК Распоряжение,
	|	ТоварыКПоступлению.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлению.Характеристика КАК Характеристика,
	|	ТоварыКПоступлению.Назначение КАК Назначение,
	|	ТоварыКПоступлению.Склад КАК Склад,
	|	СУММА(ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеров, 0)) КАК Количество,
	|	СУММА(ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеров, 0) * &ТекстЗапросаВесУпаковки) КАК Вес,
	|	СУММА(ЕСТЬNULL(ТоварыКПоступлению.КОформлениюОрдеров, 0) * &ТекстЗапросаОбъемУпаковки) КАК Объем
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюПоОрдернойСхеме
	|ИЗ
	|	ТоварыСУчетомДоставленных КАК ТоварыСУчетомДоставленных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлению
	|		ПО ТоварыСУчетомДоставленных.Распоряжение = ТоварыКПоступлению.ДокументПоступления
	|			И ТоварыСУчетомДоставленных.Склад = ТоварыКПоступлению.Склад
	|			И ТоварыСУчетомДоставленных.Номенклатура = ТоварыКПоступлению.Номенклатура
	|			И ТоварыСУчетомДоставленных.Характеристика = ТоварыКПоступлению.Характеристика
	|			И ТоварыСУчетомДоставленных.Назначение = ТоварыКПоступлению.Назначение
	|			И (ТоварыКПоступлению.Период >= &ДатаОтбора)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТоварыСУчетомДоставленных.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	ТоварыКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКПоступлению.Период,
	|	ТоварыКПоступлению.ДокументПоступления,
	|	ТоварыКПоступлению.Номенклатура,
	|	ТоварыКПоступлению.Характеристика,
	|	ТоварыКПоступлению.Назначение,
	|	ТоварыКПоступлению.Склад
	|ИМЕЮЩИЕ
	|	СУММА(ТоварыКПоступлению.КОформлениюОрдеров) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СостоянияИРеквизитыДоставки.ПолучательОтправитель, НЕОПРЕДЕЛЕНО) КАК ПолучательОтправитель,
	|	ТоварыСУчетомДоставленных.Номенклатура КАК Номенклатура,
	|	ТоварыСУчетомДоставленных.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения,
	|	ТоварыСУчетомДоставленных.Характеристика КАК Характеристика,
	|	ТоварыСУчетомДоставленных.Назначение КАК Назначение,
	|	ТоварыСУчетомДоставленных.Количество КАК Количество,
	|	ТоварыСУчетомДоставленных.Количество * &ТекстЗапросаВесУпаковки КАК Вес,
	|	ТоварыСУчетомДоставленных.Количество * &ТекстЗапросаОбъемУпаковки КАК Объем,
	|	ТоварыСУчетомДоставленных.Склад КАК Склад,
	|	ТоварыСУчетомДоставленных.Распоряжение КАК Распоряжение,
	|	ТИПЗНАЧЕНИЯ(ТоварыСУчетомДоставленных.Распоряжение) КАК ВидРаспоряжения,
	|	СостоянияИРеквизитыДоставки.Номер КАК Номер,
	|	СостоянияИРеквизитыДоставки.Адрес КАК Адрес,
	|	СостоянияИРеквизитыДоставки.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	СостоянияИРеквизитыДоставки.СпособДоставки КАК СпособДоставки,
	|	СостоянияИРеквизитыДоставки.Зона КАК Зона,
	|	СостоянияИРеквизитыДоставки.Зона.Наименование КАК ЗонаПредставление,
	|	СостоянияИРеквизитыДоставки.Перевозчик КАК Перевозчик,
	|	СостоянияИРеквизитыДоставки.ВремяС КАК ВремяС,
	|	СостоянияИРеквизитыДоставки.ВремяПо КАК ВремяПо,
	|	ВЫБОР
	|		КОГДА СостоянияИРеквизитыДоставки.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада))
	|			ТОГДА 0
	|		КОГДА СостоянияИРеквизитыДоставки.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи))
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Картинка,
	|	СостоянияИРеквизитыДоставки.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	СостоянияИРеквизитыДоставки.Дата КАК Дата,
	|	NULL КАК ПолеУпорядочивания
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме
	|ИЗ
	|	ТоварыСУчетомДоставленных КАК ТоварыСУчетомДоставленных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|		ПО ТоварыСУчетомДоставленных.Склад = СостоянияИРеквизитыДоставки.Склад
	|			И ТоварыСУчетомДоставленных.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТоварыСУчетомДоставленных.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспоряженияНаДоставку.ПолучательОтправитель,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	РаспоряженияНаДоставку.Склад,
	|	РаспоряженияНаДоставку.Распоряжение,
	|	ТИПЗНАЧЕНИЯ(РаспоряженияНаДоставку.Распоряжение),
	|	СостоянияИРеквизитыДоставки.Номер,
	|	СостоянияИРеквизитыДоставки.Адрес,
	|	СостоянияИРеквизитыДоставки.АдресЗначенияПолей,
	|	СостоянияИРеквизитыДоставки.СпособДоставки,
	|	СостоянияИРеквизитыДоставки.Зона,
	|	СостоянияИРеквизитыДоставки.Зона.Наименование,
	|	СостоянияИРеквизитыДоставки.Перевозчик,
	|	СостоянияИРеквизитыДоставки.ВремяС,
	|	СостоянияИРеквизитыДоставки.ВремяПо,
	|	4,
	|	СостоянияИРеквизитыДоставки.ДополнительнаяИнформация,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозки,
	|	СостоянияИРеквизитыДоставки.ОсобыеУсловияПеревозкиОписание,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА РаспоряженияНаДоставку.Распоряжение ССЫЛКА Документ.ПоручениеЭкспедитору
	|			ТОГДА НАЧАЛОПЕРИОДА(СостоянияИРеквизитыДоставки.Дата, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	РаспоряженияНаДоставку.ПолеУпорядочения
	|ИЗ
	|	РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|		ПО РаспоряженияНаДоставку.Распоряжение = ТоварыКДоставке.Распоряжение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|		ПО РаспоряженияНаДоставку.Распоряжение = СостоянияИРеквизитыДоставки.Распоряжение
	|ГДЕ
	|	ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|	И РаспоряженияНаДоставку.СпособДоставки В (
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуНаСклад),
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Распоряжение КАК Распоряжение,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Назначение КАК Назначение,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.КоличествоВДоставке) > СУММА(ВложенныйЗапрос.КоличествоПринято)
	|			ТОГДА СУММА(ВложенныйЗапрос.КоличествоВДоставке)
	|		ИНАЧЕ СУММА(ВложенныйЗапрос.КоличествоПринято)
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ ТоварыКВычетуИзДоставки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыКДоставке.Распоряжение КАК Распоряжение,
	|		ТоварыКДоставке.Склад КАК Склад,
	|		ТоварыКДоставке.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставке.Характеристика КАК Характеристика,
	|		ТоварыКДоставке.Назначение КАК Назначение,
	|		ТоварыКДоставке.Количество КАК КоличествоВДоставке,
	|		0 КАК КоличествоПринято
	|	ИЗ
	|		РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение
	|				И ТоварыКДоставке.Склад = РаспоряженияНаДоставку.Склад
	|				И НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|				И (НЕ ТоварыКДоставке.ВсеТовары)
	|	ГДЕ
	|		(ТоварыКДоставке.ЗаданиеНаПеревозку <> &ЗаданиеНаПеревозкуПодбор
	|					И ТоварыКДоставке.ЗаданиеНаПеревозку.Проведен
	|				ИЛИ ТоварыКДоставке.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозкуПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыКПоступлениюОбороты.ДокументПоступления,
	|		ТоварыКПоступлениюОбороты.Склад,
	|		ТоварыКПоступлениюОбороты.Номенклатура,
	|		ТоварыКПоступлениюОбороты.Характеристика,
	|		ТоварыКПоступлениюОбороты.Назначение,
	|		0,
	|		ТоварыКПоступлениюОбороты.КОформлениюОрдеровРасход
	|	ИЗ
	|		РегистрНакопления.ТоварыКПоступлению.Обороты(, , , 
	|			(ДокументПоступления, Склад) В (
	|				ВЫБРАТЬ
	|					РаспоряженияНаДоставку.Распоряжение,
	|					РаспоряженияНаДоставку.Склад
	|				ИЗ
	|					РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ГДЕ
	|					НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад)
	|			) КАК ТоварыКПоступлениюОбороты
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Назначение,
	|	ВложенныйЗапрос.Распоряжение,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВложенныйЗапрос.Распоряжение,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	NULL КАК Период,
	|	NULL КАК Распоряжение,
	|	NULL КАК Номенклатура,
	|	NULL КАК Характеристика,
	|	NULL КАК Назначение,
	|	NULL КАК Склад,
	|	0 КАК Количество,
	|	0 КАК Вес,
	|	0 КАК Объем
	|ПОМЕСТИТЬ ВтДвиженияКРаспределениюБезОрдернойСхемы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДетальныеДанные.Дата КАК Дата,
	|	ДетальныеДанные.Номенклатура КАК Номенклатура,
	|	ДетальныеДанные.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	|	ДетальныеДанные.Характеристика КАК Характеристика,
	|	ДетальныеДанные.Назначение КАК Назначение,
	|	ДетальныеДанные.Серия КАК Серия,
	|	ДетальныеДанные.НачальнаяПотребностьПоДатам - ДетальныеДанные.ВычетТоварыКДоставке КАК Количество,
	|	ДетальныеДанные.НачальнаяПотребностьПоДатамВес - ДетальныеДанные.ВычетТоварыКДоставкеВес КАК Вес,
	|	ДетальныеДанные.НачальнаяПотребностьПоДатамОбъем - ДетальныеДанные.ВычетТоварыКДоставкеОбъем КАК Объем,
	|	ДетальныеДанные.Склад КАК Склад,
	|	ДетальныеДанные.Распоряжение КАК Распоряжение,
	|	ДетальныеДанные.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ДетальныеДанные.ВидРаспоряжения КАК ВидРаспоряжения,
	|	ДетальныеДанные.Номер КАК Номер,
	|	ДетальныеДанные.Адрес КАК Адрес,
	|	ДетальныеДанные.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ДетальныеДанные.СпособДоставки КАК СпособДоставки,
	|	ДетальныеДанные.Картинка КАК Картинка,
	|	ДетальныеДанные.Зона КАК Зона,
	|	ДетальныеДанные.ЗонаПредставление КАК ЗонаПредставление,
	|	ДетальныеДанные.Перевозчик КАК Перевозчик,
	|	ДетальныеДанные.ВремяС КАК ВремяС,
	|	ДетальныеДанные.ВремяПо КАК ВремяПо,
	|	ДетальныеДанные.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ДетальныеДанные.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ДетальныеДанные.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ДетальныеДанные.ПолеУпорядочения КАК ПолеУпорядочивания
	|ПОМЕСТИТЬ ВтРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТоварыКДоставкеПоРегистраторам.Период, ДЕНЬ) КАК Дата,
	|		ТоварыКДоставкеПоРегистраторам.Номенклатура КАК Номенклатура,
	|		ТоварыКДоставкеПоРегистраторам.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук) КАК МернаяЕдиницаИзмерения,
	|		ТоварыКДоставкеПоРегистраторам.Характеристика КАК Характеристика,
	|		ТоварыКДоставкеПоРегистраторам.Назначение КАК Назначение,
	|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход КАК НачальнаяПотребностьПоДатам,
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход * &ТекстЗапросаВесУпаковки КАК НачальнаяПотребностьПоДатамВес,
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход * &ТекстЗапросаОбъемУпаковки КАК НачальнаяПотребностьПоДатамОбъем,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) КАК ВычетТоварыКДоставке,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаВесУпаковки КАК ВычетТоварыКДоставкеВес,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаОбъемУпаковки КАК ВычетТоварыКДоставкеОбъем,
	|		РаспоряженияНаДоставку.Склад КАК Склад,
	|		РаспоряженияНаДоставку.Распоряжение КАК Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель КАК ПолучательОтправитель,
	|		РаспоряженияНаДоставку.ВидРаспоряжения КАК ВидРаспоряжения,
	|		РаспоряженияНаДоставку.Номер КАК Номер,
	|		РаспоряженияНаДоставку.Адрес КАК Адрес,
	|		РаспоряженияНаДоставку.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|		РаспоряженияНаДоставку.СпособДоставки КАК СпособДоставки,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуНаСклад), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Картинка,
	|		РаспоряженияНаДоставку.Зона КАК Зона,
	|		РаспоряженияНаДоставку.Зона.Наименование КАК ЗонаПредставление,
	|		РаспоряженияНаДоставку.Перевозчик КАК Перевозчик,
	|		РаспоряженияНаДоставку.ВремяС КАК ВремяС,
	|		РаспоряженияНаДоставку.ВремяПо КАК ВремяПо,
	|		РаспоряженияНаДоставку.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|		РаспоряженияНаДоставку.ПолеУпорядочения КАК ПолеУпорядочения
	|	ИЗ
	|		РегистрНакопления.ТоварыКПоступлению.Обороты(, , Регистратор, 
	|			(ДокументПоступления, Склад) В (
	|				ВЫБРАТЬ
	|					РаспоряженияНаДоставку.Распоряжение,
	|					РаспоряженияНаДоставку.Склад
	|				ИЗ
	|					РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ГДЕ
	|					НЕ РаспоряженияНаДоставку.ЭтоОрдерныйСклад
	|				)
	|			) КАК ТоварыКДоставкеПоРегистраторам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКВычетуИзДоставки КАК ТоварыКВычетуИзДоставки
	|			ПО (ТоварыКВычетуИзДоставки.Распоряжение = ТоварыКДоставкеПоРегистраторам.Регистратор)
	|				И (ТоварыКВычетуИзДоставки.Склад = ТоварыКДоставкеПоРегистраторам.Склад)
	|				И (ТоварыКВычетуИзДоставки.Номенклатура = ТоварыКДоставкеПоРегистраторам.Номенклатура)
	|				И (ТоварыКВычетуИзДоставки.Характеристика = ТоварыКДоставкеПоРегистраторам.Характеристика)
	|				И (ТоварыКВычетуИзДоставки.Назначение = ТоварыКДоставкеПоРегистраторам.Назначение)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|			ПО (СправочникНоменклатура.Ссылка = ТоварыКДоставкеПоРегистраторам.Номенклатура)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ПО ТоварыКДоставкеПоРегистраторам.Регистратор = РаспоряженияНаДоставку.Распоряжение
	|				И ТоварыКДоставкеПоРегистраторам.Склад = РаспоряженияНаДоставку.Склад
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗоныДоставки КАК Зоны
	|			ПО (Зоны.Ссылка = РаспоряженияНаДоставку.Зона)
	|	ГДЕ
	|		ТоварыКДоставкеПоРегистраторам.КОформлениюОрдеровПриход > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТоварыКДоставкеПоДням.Период, ДЕНЬ),
	|		ТоварыКДоставкеПоДням.Номенклатура,
	|		ТоварыКДоставкеПоДням.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины <> ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук),
	|		ТоварыКДоставкеПоДням.Характеристика,
	|		ТоварыКДоставкеПоДням.Назначение,
	|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|		ТоварыКДоставкеПоДням.Количество,
	|		ТоварыКДоставкеПоДням.Количество * &ТекстЗапросаВесУпаковки,
	|		ТоварыКДоставкеПоДням.Количество * &ТекстЗапросаОбъемУпаковки,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0),
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаВесУпаковки,
	|		ЕСТЬNULL(ТоварыКВычетуИзДоставки.Количество, 0) * &ТекстЗапросаОбъемУпаковки,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.ВидРаспоряжения,
	|		РаспоряженияНаДоставку.Номер,
	|		РаспоряженияНаДоставку.Адрес,
	|		РаспоряженияНаДоставку.АдресЗначенияПолей,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада))
	|				ТОГДА 0
	|			КОГДА РаспоряженияНаДоставку.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи))
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РаспоряженияНаДоставку.ОсобыеУсловияПеревозки
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.Зона.Наименование,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		РаспоряженияНаДоставку.ВремяС,
	|		РаспоряженияНаДоставку.ВремяПо,
	|		РаспоряженияНаДоставку.ДополнительнаяИнформация,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание,
	|		РаспоряженияНаДоставку.ПолеУпорядочения
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Т.Ссылка КАК Ссылка,
	|			Т.ДатаПоступления КАК Период,
	|			Т.Склад КАК Склад,
	|			Т.Номенклатура КАК Номенклатура,
	|			Т.Характеристика КАК Характеристика,
	|			Т.Назначение КАК Назначение,
	|			СУММА(Т.Количество) КАК Количество
	|		ИЗ
	|			Документ.ЗаказПоставщику.Товары КАК Т
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ПО Т.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|					И Т.Склад = РаспоряженияНаДоставку.Склад
	|					И (НЕ Т.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|						ИЛИ Т.ДатаПоступления < Т.Склад.ДатаНачалаОрдернойСхемыПриПоступлении)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Т.Ссылка,
	|			Т.ДатаПоступления,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Т.Ссылка,
	|			Т.Ссылка.Дата,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			СУММА(Т.Количество)
	|		ИЗ
	|			Документ.ПриобретениеТоваровУслуг.Товары КАК Т
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ПО Т.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|					И Т.Склад = РаспоряженияНаДоставку.Склад
	|					И (НЕ Т.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|						ИЛИ Т.Ссылка.Дата < Т.Склад.ДатаНачалаОрдернойСхемыПриПоступлении)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Т.Ссылка,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			Т.Ссылка.Дата
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Т.Ссылка,
	|			Т.Ссылка.Дата,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			СУММА(Т.Количество)
	|		ИЗ
	|			Документ.ПриемкаТоваровНаХранение.Товары КАК Т
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|				ПО Т.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|					И Т.Склад = РаспоряженияНаДоставку.Склад
	|					И (НЕ Т.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|						ИЛИ Т.Ссылка.Дата < Т.Склад.ДатаНачалаОрдернойСхемыПриПоступлении)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Т.Ссылка,
	|			Т.Склад,
	|			Т.Номенклатура,
	|			Т.Характеристика,
	|			Т.Назначение,
	|			Т.Ссылка.Дата
	|	) КАК ТоварыКДоставкеПоДням
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКВычетуИзДоставки КАК ТоварыКВычетуИзДоставки
	|		ПО (ТоварыКВычетуИзДоставки.Распоряжение = ТоварыКДоставкеПоДням.Ссылка)
	|			И (ТоварыКВычетуИзДоставки.Склад = ТоварыКДоставкеПоДням.Склад)
	|			И (ТоварыКВычетуИзДоставки.Номенклатура = ТоварыКДоставкеПоДням.Номенклатура)
	|			И (ТоварыКВычетуИзДоставки.Характеристика = ТоварыКДоставкеПоДням.Характеристика)
	|			И (ТоварыКВычетуИзДоставки.Назначение = ТоварыКДоставкеПоДням.Назначение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО (СправочникНоменклатура.Ссылка = ТоварыКДоставкеПоДням.Номенклатура)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|		ПО ТоварыКДоставкеПоДням.Ссылка = РаспоряженияНаДоставку.Распоряжение
	|			И ТоварыКДоставкеПоДням.Склад = РаспоряженияНаДоставку.Склад
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(РаспоряженияНаДоставку.Дата, ДЕНЬ),
	|		НЕОПРЕДЕЛЕНО,
	|		ЛОЖЬ,
	|		НЕОПРЕДЕЛЕНО,
	|		НЕОПРЕДЕЛЕНО,
	|		НЕОПРЕДЕЛЕНО,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		РаспоряженияНаДоставку.Склад,
	|		РаспоряженияНаДоставку.Распоряжение,
	|		РаспоряженияНаДоставку.ПолучательОтправитель,
	|		РаспоряженияНаДоставку.ВидРаспоряжения,
	|		РаспоряженияНаДоставку.Номер,
	|		РаспоряженияНаДоставку.Адрес,
	|		РаспоряженияНаДоставку.АдресЗначенияПолей,
	|		РаспоряженияНаДоставку.СпособДоставки,
	|		4,
	|		РаспоряженияНаДоставку.Зона,
	|		РаспоряженияНаДоставку.Зона.Наименование,
	|		РаспоряженияНаДоставку.Перевозчик,
	|		РаспоряженияНаДоставку.ВремяС,
	|		РаспоряженияНаДоставку.ВремяПо,
	|		РаспоряженияНаДоставку.ДополнительнаяИнформация,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозки,
	|		РаспоряженияНаДоставку.ОсобыеУсловияПеревозкиОписание,
	|		РаспоряженияНаДоставку.ПолеУпорядочения
	|	ИЗ
	|		РаспоряженияНаДоставку КАК РаспоряженияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|			ПО (ТоварыКДоставке.Распоряжение = РаспоряженияНаДоставку.Распоряжение)
	|	ГДЕ
	|		РаспоряженияНаДоставку.СпособДоставки В (
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуНаСклад),
	|			ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПоручениеЭкспедиторуВПункте))
	|		И ТоварыКДоставке.Распоряжение ЕСТЬ NULL
	|	) КАК ДетальныеДанные
	|ГДЕ
	|	(ДетальныеДанные.НачальнаяПотребностьПоДатам = 0
	|			ИЛИ ДетальныеДанные.НачальнаяПотребностьПоДатам - ДетальныеДанные.ВычетТоварыКДоставке > 0)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращаемое значение:
//   Массив из ПеречислениеСсылка.СпособыДоставки
//
Функция СпособыДоставкиНашимиСиламиКПолучателю()
	
	СпособыДоставкиНашимиСиламиКПолучателю = Новый Массив; // Массив из ПеречислениеСсылка.СпособыДоставки
	
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.ДоКлиента);
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу);
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки);
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада);
	СпособыДоставкиНашимиСиламиКПолучателю.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте);
	
	Возврат СпособыДоставкиНашимиСиламиКПолучателю;
	
КонецФункции

// Возвращаемое значение:
//   Массив из ПеречислениеСсылка.СпособыДоставки
//
Функция СпособыДоставкиПеревозчикомКПолучателю()
	
	СпособыДоставкиПеревозчикомКПолучателю = Новый Массив; // Массив из ПеречислениеСсылка.СпособыДоставки
	
	СпособыДоставкиПеревозчикомКПолучателю.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчика);
	СпособыДоставкиПеревозчикомКПолучателю.Добавить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки);
	СпособыДоставкиПеревозчикомКПолучателю.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте);
	
	Возврат СпособыДоставкиПеревозчикомКПолучателю;	
	
КонецФункции

// Возвращаемое значение:
//   Массив из ПеречислениеСсылка.СпособыДоставки
//
Функция СпособыДоставкиНашимиСиламиОтОтправителя()
	
	СпособыДоставкиНашимиСиламиОтОтправителя = Новый Массив; // Массив из ПеречислениеСсылка.СпособыДоставки
	
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи);
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки);
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуНаСклад);
	СпособыДоставкиНашимиСиламиОтОтправителя.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте);
	
	Возврат СпособыДоставкиНашимиСиламиОтОтправителя;
	
КонецФункции

// Возвращаемое значение:
//   Массив из ПеречислениеСсылка.СпособыДоставки
//
Функция СпособыДоставкиПеревозчикомОтОтправителя()
	
	СпособыДоставкиПеревозчикомОтОтправителя = Новый Массив; // Массив из ПеречислениеСсылка.СпособыДоставки
	
	СпособыДоставкиПеревозчикомОтОтправителя.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада);
	СпособыДоставкиПеревозчикомОтОтправителя.Добавить(Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки);
	СпособыДоставкиПеревозчикомОтОтправителя.Добавить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуВПункте);
	Возврат СпособыДоставкиПеревозчикомОтОтправителя;
	
КонецФункции

// Устанавливает свойства форм документов, в которых имеются реквизиты доставки при чтении, создании.
//
// Параметры:
//	ЭлементыФормы - ВсеЭлементыФормы - все элементы формы, в которой производятся изменения,
//	ДокОбъект - ДанныеФормыСтруктура, СправочникОбъект - объект, реквизиты которого используются при заполнении.
//
Процедура ПриЧтенииСозданииЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(ЭлементыФормы, ДокОбъект)
	
	Если ПерезаполнятьАдресДоставкиВДокументеПродажи(ДокОбъект) Тогда
		ЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(ЭлементыФормы, ДокОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Перезаполняет реквизиты доставки при изменении реквизиты формы.
//
// Параметры:
//	ЭлементыФормы - ВсеЭлементыФормы - все элементы формы, в которой производятся изменения,
//	ДокОбъект - ДанныеФормыСтруктура, СправочникОбъект - объект, реквизиты которого используются при заполнении,
//	ПараметрыЗаполнения - Структура, Неопределено - параметры заполнения реквизитов доставки. 
//		См. ПараметрыЗаполненияРеквизитов.
//
Процедура ПриИзмененииПолучателяОтправителя(ЭлементыФормы, ДокОбъект, ПараметрыЗаполнения = Неопределено)
	
	Если ПараметрыЗаполнения = Неопределено Тогда
		ПараметрыЗаполнения = ПараметрыЗаполненияРеквизитов();
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой") Тогда
		ПриИзмененииПолучателяНеИспользоватьУправлениеДоставкой(ЭлементыФормы, ДокОбъект, ПараметрыЗаполнения);
		Возврат
	КонецЕсли;
	
	РеквизитыДоставки = РеквизитыДоставки(ДокОбъект);
	
	ПолучательОтправитель = РеквизитыДоставки.ПолучательОтправитель;
	
	ИмяЭлементаАдрес = ИмяЭлементаАдрес(ЭлементыФормы);
	Если ПараметрыЗаполнения.ОчиститьРеквизитыДоставки Тогда
		ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(ЭлементыФормы, РеквизитыДоставки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолучательОтправитель.Значение) Тогда
		
		ЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(ЭлементыФормы, РеквизитыДоставки);
		
		Если ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора.Количество() > 0
			И ПараметрыЗаполнения.УстановитьАдресДоставки Тогда
			
			ПерваяСтруктураВСписке = ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора[0].Значение;
			РеквизитыДоставки.АдресДоставки = ПерваяСтруктураВСписке.АдресДоставки;
			РеквизитыДоставки.АдресДоставкиЗначение = ПерваяСтруктураВСписке.АдресДоставкиЗначение;
			РеквизитыДоставки.АдресДоставкиЗначенияПолей = ПерваяСтруктураВСписке.АдресДоставкиЗначенияПолей;
			
		КонецЕсли;
		
		ЗаполнитьСписокВыбораПеревозчиков(ЭлементыФормы, РеквизитыДоставки);
		
		Если ПараметрыЗаполнения.УстановитьСпособДоставки Тогда
			
			// Получим значения по статистике
			Если ЗначениеЗаполнено(ПараметрыЗаполнения.ИсточникСтатистики) Тогда
				СсылкаДляСтатистики = ПараметрыЗаполнения.ИсточникСтатистики.ПустаяСсылка();
			Иначе
				СсылкаДляСтатистики = РеквизитыДоставки.Ссылка;
			КонецЕсли;
			
			ОписаниеРеквизитов = Новый Структура;
			Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
			Параметры.РазрезыСбораСтатистики.ИспользоватьТолькоЗаполненные = ПолучательОтправитель.ИмяПоля;
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Автор", СсылкаДляСтатистики.Метаданные()) Тогда
				Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Автор";
				Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Автор";
			КонецЕсли;
			ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(ОписаниеРеквизитов, "СпособДоставки", Параметры);
			РеквизитыДляОтбора = Новый Структура(ПолучательОтправитель.ИмяПоля, ПолучательОтправитель.Значение);
			ЗаполняемыеРеквизиты = ЗаполнениеОбъектовПоСтатистике.ПолучитьЗначенияРеквизитов(СсылкаДляСтатистики,
				ОписаниеРеквизитов, РеквизитыДляОтбора);
			
			Если ЗначениеЗаполнено(ЗаполняемыеРеквизиты.СпособДоставки) Тогда
				РеквизитыДоставки.СпособДоставки = ЗаполняемыеРеквизиты.СпособДоставки;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЗаполняемыеРеквизиты.СпособДоставки) Тогда
				
				ЗаполнитьРеквизитыПоСпособуДоставки(ЭлементыФормы, РеквизитыДоставки);
				
				Если (РеквизитыДоставки.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
						Или РеквизитыДоставки.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи)
					И ЗначениеЗаполнено(РеквизитыДоставки.ПеревозчикПартнер) Тогда
					ЗаполнитьСписокВыбораАдресовПеревозчика(ЭлементыФормы, РеквизитыДоставки);
					ЗаполнитьРеквизитыПоПеревозчику(ЭлементыФормы, РеквизитыДоставки);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокОбъект, РеквизитыДоставки);
	
	Если ЭлементыФормы.Найти("СтраницыДоставки") <> Неопределено Тогда
		
		РаспоряжениеПоСоглашению = ЭтоРаспоряжениеПоСоглашению(ДокОбъект);
		ЭтоДоговорСоглашение = ТипЗнч(ДокОбъект.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
			Или ТипЗнч(ДокОбъект.Ссылка) = Тип("СправочникСсылка.СоглашенияСПоставщиками");
		
		ДоставкаОпределенаВДоговоре = ДоставкаОпределенаВДоговоре(ДокОбъект);
		
		РаспоряжениеПоДоговору = Не ЭтоДоговорСоглашение И ДоставкаОпределенаВДоговоре;
		
		ДоставкаТоваровКлиентСервер.УстановитьСтраницуДоставки(ЭлементыФормы,
			ДокОбъект.СпособДоставки,
			ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками"),
			РаспоряжениеПоСоглашению,
			РаспоряжениеПоДоговору);
		
	КонецЕсли;
	
	ОсобыеУсловияПеревозкиУстановитьДоступность(ЭлементыФормы, ДокОбъект);
	
КонецПроцедуры

// Перезаполняет реквизиты доставки при изменении реквизиты формы.
//
// Параметры:
//	ЭлементыФормы - ВсеЭлементыФормы - все элементы формы, в которой производятся изменения,
//	ДокОбъект - ДанныеФормыСтруктура, СправочникОбъект - объект, реквизиты которого используются при заполнении,
//	ПараметрыЗаполнения - См. ПараметрыЗаполненияРеквизитов.
//
Процедура ПриИзмененииПолучателяНеИспользоватьУправлениеДоставкой(ЭлементыФормы, ДокОбъект, ПараметрыЗаполнения)
	
	Если Не ПерезаполнятьАдресДоставкиВДокументеПродажи(ДокОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДоставки = РеквизитыДоставки(ДокОбъект);
	
	ПолучательОтправитель = РеквизитыДоставки.ПолучательОтправитель;
	
	ИмяЭлементаАдрес = ИмяЭлементаАдрес(ЭлементыФормы);
	Если ПараметрыЗаполнения.ОчиститьРеквизитыДоставки Тогда
		ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(ЭлементыФормы, РеквизитыДоставки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолучательОтправитель.Значение) Тогда
		
		ЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(ЭлементыФормы, РеквизитыДоставки);
		Если ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора.Количество() > 0 И ПараметрыЗаполнения.УстановитьАдресДоставки Тогда
			ПерваяСтруктураВСписке = ЭлементыФормы[ИмяЭлементаАдрес].СписокВыбора[0].Значение;
			РеквизитыДоставки.АдресДоставки = ПерваяСтруктураВСписке.АдресДоставки;
			РеквизитыДоставки.АдресДоставкиЗначенияПолей = ПерваяСтруктураВСписке.АдресДоставкиЗначенияПолей;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокОбъект, РеквизитыДоставки);
	
КонецПроцедуры

#Область Прочее

// Параметры:
//  Адрес - Строка - адрес временного хранилища
// 
// Возвращаемое значение:
//  Произвольный, Неопределено -
Функция ПолучитьУдалитьИзВременногоХранилища(Адрес) Экспорт
	
	Результат = Неопределено;
	
	Если НЕ ЭтоАдресВременногоХранилища(Адрес) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПолучитьИзВременногоХранилища(Адрес);
	
	УдалитьИзВременногоХранилища(Адрес);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти