
&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Таблица=АУ_СозданиеЭлементовФормы.СоздатьТаблицаФормы(ЭтаФорма,"АУ_Предметы",ЭтаФорма,"Объект.АУ_Предметы",Новый Структура("Предмет"),,Новый Структура("Выбор","АУ_ВыборДополнительногоПредмета"));
	Таблица.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
	Таблица.Заголовок="Дополнительные предметы";
	Таблица.ТолькоПросмотр=Истина;
	
	Элементы.АУ_ПредметыКоманднаяПанель.Видимость=Ложь;
	
	Если ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.Задание") И ЗначениеЗаполнено(Объект.БизнесПроцесс) Тогда
		
		Если Объект.БизнесПроцесс.АУ_ВидЗадания = Перечисления.АУ_ВидыЗаданий.УточнениеДатыИсполненияКонтракта Тогда
			
			Если Объект.БизнесПроцесс.АУ_ВариантИсполненияКонтракта = 1 Тогда
				
				СтруктураСвойств = Новый Структура("Заголовок", "Контракт будет исполнен в срок !");
				СтруктураСвойств.Вставить("ЦветТекста", WebЦвета.Зеленый);
				СтруктураСвойств.Вставить("Шрифт", Новый Шрифт(, 12, Истина));
				СтруктураСвойств.Вставить("АвтоМаксимальнаяШирина", Ложь);
				АУ_СозданиеЭлементовФормы.СоздатьДекорация(ЭтаФорма, "АУ_РезультатВыполненияСрокаПереноса", "ГруппаСодержание", СтруктураСвойств,, "Предмет");
				
			ИначеЕсли Объект.БизнесПроцесс.АУ_ВариантИсполненияКонтракта = 2 Тогда
				
				СтруктураСвойств = Новый Структура("Заголовок", СтрШаблон("Контракт не будет исполнен в срок ! Дата переноса %1", Формат(Объект.БизнесПроцесс.АУ_ПеренесенныйСрокИсполненияКонтракта, "ДФ=dd.MM.yyyy")));
				СтруктураСвойств.Вставить("ЦветТекста", WebЦвета.Красный);
				СтруктураСвойств.Вставить("Шрифт", Новый Шрифт(, 12, Истина));
				СтруктураСвойств.Вставить("АвтоМаксимальнаяШирина", Ложь);
				АУ_СозданиеЭлементовФормы.СоздатьДекорация(ЭтаФорма, "АУ_РезультатВыполненияСрокаПереноса", "ГруппаСодержание", СтруктураСвойств,, "Предмет");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_Цвет", "ГруппыШапки",, 1, "Объект.АУ_Цвет");
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ВыборДополнительногоПредмета(ВыбраннаяСтрока,Поле,СтандартнаяОбработка)
	
	Если Элементы.АУ_Предметы.ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,Элементы.АУ_Предметы.ТекущиеДанные.Предмет);
	
КонецПроцедуры