
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторЭДО = Параметры.ИдентификаторЭДО;
	Если Не ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан идентификатор учетной записи ЭДО'");
	КонецЕсли;
	
	УчетнаяЗаписьЦентраЭДО = РегистрыСведений.НастройкиИнтеграцииЦентраЭДО.УчетнаяЗаписьЦентраЭДО(ИдентификаторЭДО);
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьЦентраЭДО) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана учетная запись центра ЭДО'");
	КонецЕсли;
	
	Статистика = РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО(ИдентификаторЭДО);
	
	ЗаполнитьРеквизитыФормыПоДаннымСостояния(ЭтотОбъект, Статистика);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(ДатаЗавершения) Тогда
		ПодключитьОбработчикОжидания("ОбновитьСостояниеПереходаВСервис", 5, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Отмена(Команда)
	
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Выгрузка будет прекращена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Состояние = ОтменитьВыгрузку(ИдентификаторЭДО);
		ЗаполнитьРеквизитыФормыПоДаннымСостояния(ЭтотОбъект, Состояние);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСостояниеПереходаВСервис()
	
	Состояние = СостояниеПоУчетнойЗаписи(ИдентификаторЭДО);
	
	ЗаполнитьРеквизитыФормыПоДаннымСостояния(ЭтотОбъект, Состояние);
	
	Если ЗначениеЗаполнено(ДатаЗавершения) Тогда
		ОтключитьОбработчикОжидания("ОбновитьСостояниеПереходаВСервис");
		Элементы.ДатаЗавершения.Видимость = Истина;
		Элементы.ОсталосьВремени.Видимость = Ложь;
		Элементы.Прогресс.Видимость = Ложь;
		Элементы.Отмена.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  См. РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО
&НаСервереБезКонтекста
Функция СостояниеПоУчетнойЗаписи(Знач ИдентификаторЭДО)
	
	Возврат РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО(ИдентификаторЭДО);
	
КонецФункции

// Параметры:
//  Форма - см. РегистрСведений.СостоянияВыгрузкиВЦентрЭДО.Форма.ПросмотрСостояния
//  Состояние - см. РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО
&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыФормыПоДаннымСостояния(Форма, Состояние)
	
	Форма.ДатаНачала = Состояние.ДатаНачала;
	Форма.ДатаЗавершения = Состояние.ДатаЗавершения;
	Форма.ОсталосьВремени = Состояние.ОсталосьВремени;
	Форма.Прогресс = Состояние.Прогресс;
	Форма.ДокументовВыгружено = Состояние.ДокументовВыгружено;
	Форма.ДокументовОсталось = Состояние.ДокументовОсталось;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  См. РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО
&НаСервереБезКонтекста
Функция ОтменитьВыгрузку(Знач ИдентификаторЭДО)
	
	ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ОтменитьВыгрузкуВЦентрЭДО(ИдентификаторЭДО);
	
	Возврат РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО(ИдентификаторЭДО);
	
КонецФункции

#КонецОбласти
