
#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ Локализация
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый документ.
//  Отказ - Булево - Признак проведения документа.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то проведение документа выполнено не будет.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
	//++ Локализация
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
		ЗарегистрироватьПланированиеОплатыНДСПоСчетамФактурам(Объект);
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то будет выполнен отказ от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив из Строка - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	//++ Локализация
	Перем Ошибки;
	
	ВсеРеквизиты = Новый Массив;
	РеквизитыОперации = Новый Массив;
	НепроверяемыеРеквизиты = Новый Массив;
	
	ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(Объект, ВсеРеквизиты, РеквизитыОперации);
	
	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
		ВсеРеквизиты, РеквизитыОперации, НепроверяемыеРеквизиты);
	
	РасшифровкаБезРазбиения = Ложь;
	Если Объект.ДополнительныеСвойства.Свойство("РасшифровкаБезРазбиения")
		И Объект.ДополнительныеСвойства.РасшифровкаБезРазбиения Тогда
		РасшифровкаБезРазбиения = Истина;
	КонецЕсли;
	
	Если Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована
		Или Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена Тогда
		
		НепроверяемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов.Контрагент");
		НепроверяемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов.БанковскийСчетКонтрагента");
		
	ИначеЕсли Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована Тогда
		НепроверяемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов.БанковскийСчетКонтрагента");
	КонецЕсли;
	
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет
		И Не ((Объект.ТипНалога = Справочники.ВидыНалоговВзносов.НДФЛ ИЛИ Объект.ТипНалога = Справочники.ВидыНалоговВзносов.НДФЛСПревышения) И Объект.НДФЛПоВедомостям) Тогда
		
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.Ведомость");
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.Подразделение");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.БанковскийСчет, "СчетПоГосконтракту") <> Истина Тогда
		НепроверяемыеРеквизиты.Добавить("СтатьяЦелевыхСредств");
		НепроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.СтатьяЦелевыхСредств");
	КонецЕсли;
	
	Если Не Объект.СписокКонтрагентов Тогда
		
		НепроверяемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов");
		НепроверяемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов.Контрагент");
		НепроверяемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов.БанковскийСчетКонтрагента");
		НепроверяемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов.Сумма");
		
	Иначе
		
		Если Объект.ФормаОплатыЗаявки <> Перечисления.ФормыОплаты.Безналичная Тогда
			НепроверяемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов.БанковскийСчетКонтрагента");
		КонецЕсли;
	
	КонецЕсли;
	
		НепроверяемыеРеквизиты.Добавить("ПодтверждающиеДокументы");
		НепроверяемыеРеквизиты.Добавить("ДоговорСУчастникомГОЗ");
		НепроверяемыеРеквизиты.Добавить("ТипПлатежаФЗ275");
		НепроверяемыеРеквизиты.Добавить("ПредметОплаты");
		НепроверяемыеРеквизиты.Добавить("ВариантОплаты");
		НепроверяемыеРеквизиты.Добавить("ПодтверждающиеДокументы.ВидДокумента");
		НепроверяемыеРеквизиты.Добавить("ПодтверждающиеДокументы.Файл");
	
	РеквизитыПлатежаВБюджет = Новый Массив;
	РеквизитыПлатежаВБюджет.Добавить("ВидПеречисленияВБюджет");
	РеквизитыПлатежаВБюджет.Добавить("ПеречислениеВБюджет");
	РеквизитыПлатежаВБюджет.Добавить("КодБК");
	РеквизитыПлатежаВБюджет.Добавить("КодОКАТО");
	РеквизитыПлатежаВБюджет.Добавить("ПоказательДаты");
	РеквизитыПлатежаВБюджет.Добавить("ПоказательНомера");
	РеквизитыПлатежаВБюджет.Добавить("ПоказательОснования");
	РеквизитыПлатежаВБюджет.Добавить("ПоказательПериода");
	РеквизитыПлатежаВБюджет.Добавить("СтатусСоставителя");
	
	РеквизитыДокумента = Объект.Метаданные().Реквизиты;
	
	ДатаНачалаПримененияПриказа126н = Константы.ДатаНачалаПримененияПриказа126н.Получить();
	Если ДатаНачалаПримененияПриказа126н <> '00010101' И Объект.Дата >= ДатаНачалаПримененияПриказа126н Тогда
		НепроверяемыеРеквизиты.Добавить("ПоказательТипа");
	Иначе
		РеквизитыПлатежаВБюджет.Добавить("ПоказательТипа");
	КонецЕсли;
	
	Для каждого РеквизитПлатежаВБюджет Из РеквизитыПлатежаВБюджет Цикл
		НепроверяемыеРеквизиты.Добавить(РеквизитПлатежаВБюджет);
		Если Объект.ПеречислениеВБюджет Тогда
			Если Не ЗначениеЗаполнено(Объект[РеквизитПлатежаВБюджет]) Тогда
				Реквизит = РеквизитыДокумента.Найти(РеквизитПлатежаВБюджет);
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Поле ""%1"" не заполнено'"), Реквизит.Синоним);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "НадписьРеквизитыПлатежаВБюджет",, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	РеквизитыПлательщика = ДенежныеСредстваСерверЛокализация.ОписаниеРеквизитовСтороныДляПроверки();
	РеквизитыПлательщика.Вставить("ИНН", Объект.ИННПлательщика);
	РеквизитыПлательщика.Вставить("КПП", Объект.КПППлательщика);
	РеквизитыПлательщика.Вставить("Наименование", Объект.ТекстПлательщика);
	РеквизитыПлательщика.Вставить("Объект", Объект.Организация);
	РеквизитыПлательщика.Вставить("ЮрФизЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо"));
	
	ДанныеПолучателя = ДанныеПолучателяХозяйственнойОперации(Объект);
	ПолученныеРезультаты = ДенежныеСредстваСерверЛокализация.ДанныеПолучателя(ДанныеПолучателя.Получатель, ДанныеПолучателя.СчетПолучателя, Объект.Дата);
	РеквизитыПолучателя = ДенежныеСредстваСерверЛокализация.ОписаниеРеквизитовСтороныДляПроверки();
	РеквизитыПолучателя.Вставить("ИНН", ПолученныеРезультаты.ИННПолучателя);
	РеквизитыПолучателя.Вставить("КПП", ПолученныеРезультаты.КПППолучателя);
	РеквизитыПолучателя.Вставить("Наименование", ПолученныеРезультаты.ТекстПолучателя);
	РеквизитыПолучателя.Вставить("Объект", ДанныеПолучателя.Получатель);
	РеквизитыПолучателя.Вставить("ЮрФизЛицо", ДанныеПолучателя.ПравоСубъект);
	
	Если Объект.ПеречислениеВБюджет Тогда
		ПлатежиВБюджет.ОшибкиЗаполненияРеквизитовПлательщика(Объект, РеквизитыПлательщика, Истина);
		ПлатежиВБюджет.ОшибкиЗаполненияРеквизитовПолучателя(Объект, РеквизитыПолучателя, Истина);
		ДенежныеСредстваСерверЛокализация.ПроверитьЗаполнениеНалоговыхРеквизитов(Объект, Отказ, НепроверяемыеРеквизиты);
	Иначе
		
		ДенежныеСредстваСерверЛокализация.ОшибкиЗаполненияРеквизитовПлательщикаПолучателя(Истина, Объект, РеквизитыПлательщика, Истина);
		ДенежныеСредстваСерверЛокализация.ОшибкиЗаполненияРеквизитовПлательщикаПолучателя(Ложь, Объект, РеквизитыПолучателя, Истина);
		
	КонецЕсли;
	
	
	ДенежныеСредстваСерверЛокализация.ПроверитьЗаполнениеКодаВидаДохода(Объект,
																		Объект.ХозяйственнаяОперацияПоЗарплате,
																		Отказ);
	
	ДенежныеСредстваСерверЛокализация.ПроверитьЗаполнениеДокументаСФлагомСамозанятого(Объект, Отказ);
	
	ПроверитьЗаполнениеПлатежнойСсылкиСБП(Объект, Отказ);
	
	ПодарочныеСертификатыСервер.ОбработкаПроверкиЗаполнения(Объект, Отказ);
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	Если Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате Тогда
		Объект.ДополнительныеСвойства.Вставить("ПараметрыПроверкиКорреспонденцииБанковскихСчетов",
			                                   ПараметрыПроверкиКорреспонденцииМеждуБанковскимиСчетами(Объект));
		ДенежныеСредстваСерверЛокализация.ПроверитьКорреспонденциюБанковскихСчетов(Объект, Отказ, Объект.ХозяйственнаяОперация);
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект.
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	ЗаполнитьФормуОплатыПоХозОперации(ДанныеЗаполнения);
	ТипОснования = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипОснования = Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров") Тогда 
		ЗаполнитьПоЗаявлениюОВвозеТоваров(Объект, ДанныеЗаполнения, ДанныеЗаполнения);
	
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОперацияПоЯндексКассе") Тогда
		ЗаполнитьПоОперацииПоЯндексКассе(Объект, ДанныеЗаполнения, ДанныеЗаполнения);
	
	
	ИначеЕсли ТипОснования = Тип("Массив") И ДанныеЗаполнения.Количество() > 0 Тогда
		ТипОснования = ТипЗнч(ДанныеЗаполнения[0]);
		Если ТипОснования = Тип("ДокументСсылка.СчетФактураНалоговыйАгент") Тогда 
			ЗаполнитьПоСчетуФактуреНалоговогоАгента(Объект, ДанныеЗаполнения[0], ДанныеЗаполнения);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров") Тогда 
			ЗаполнитьПоЗаявлениюОВвозеТоваров(Объект, ДанныеЗаполнения[0], ДанныеЗаполнения);
		КонецЕсли;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СчетФактураНалоговыйАгент") Тогда 
		ЗаполнитьПоСчетуФактуреНалоговогоАгента(Объект, ДанныеЗаполнения, ДанныеЗаполнения);
	КонецЕсли;
	
	
	Если ТипОснования = Тип("Структура") Тогда
		
		Если Не ДанныеЗаполнения.Свойство("ОперацияССамозанятым") Тогда
		
			Если ДанныеЗаполнения.Свойство("Договор")
				И ЗначениеЗаполнено(ДанныеЗаполнения.Договор)
				И ТипЗнч(ДанныеЗаполнения.Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
				И ПолучитьФункциональнуюОпцию("ИспользоватьВыплатыСамозанятым") Тогда
				ДанныеЗаполнения.Вставить("ОперацияССамозанятым",
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Договор, "ДоговорССамозанятым"));
			ИначеЕсли Не ДанныеЗаполнения.Свойство("ОперацияССамозанятым") Тогда
				
				ДанныеЗаполнения.Вставить("ОперацияССамозанятым", Ложь);
				ОписаниеРеквизитов = Новый Структура;
				ДенежныеСредстваСерверЛокализация.ЗадатьОписаниеЗаполняемыхРеквизитовПоСтатистике(ОписаниеРеквизитов);
				
				Если ОписаниеРеквизитов.Количество() <> 0 Тогда
					ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(Объект, ДанныеЗаполнения, ОписаниеРеквизитов);
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Не ПолучитьФункциональнуюОпцию("ИспользоватьВыплатыСамозанятым") Тогда
			ДанныеЗаполнения.Вставить("ОперацияССамозанятым", Ложь);
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "ПлатежнаяСсылка") Тогда
			ЗаполнитьПоПлатежнойСсылкеСБП(Объект, ДанныеЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	ИнициализироватьДокумент(Объект, ДанныеЗаполнения);
	//-- Локализация
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//
Процедура ОбработкаУдаленияПроведения(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//  РежимЗаписи - РежимЗаписиДокумента - В параметр передается текущий режим записи документа. Позволяет определить в теле процедуры режим записи.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//++ Локализация
	НеиспользуемыеРеквизиты = Новый Массив;
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	
	ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(Объект, МассивВсехРеквизитов, МассивРеквизитовОперации);
	
	Если Не (Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет
			И (Объект.ТипНалога = Справочники.ВидыНалоговВзносов.НДФЛ ИЛИ Объект.ТипНалога = Справочники.ВидыНалоговВзносов.НДФЛСПревышения)) Тогда
		НеиспользуемыеРеквизиты.Добавить("НДФЛПоВедомостям");
	КонецЕсли;
	
	
	Если Не Объект.СписокКонтрагентов Тогда
		НеиспользуемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов");
		НеиспользуемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов.Контрагент");
		НеиспользуемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов.БанковскийСчетКонтрагента");
		НеиспользуемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов.Сумма");
	Иначе
		Если Объект.ФормаОплатыЗаявки = Перечисления.ФормыОплаты.Наличная Тогда
			НеиспользуемыеРеквизиты.Добавить("БанковскиеСчетаСпискаКонтрагентов.БанковскийСчетКонтрагента");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Объект.ПеречислениеВБюджет Тогда
		НеиспользуемыеРеквизиты.Добавить("КодБК");
		НеиспользуемыеРеквизиты.Добавить("КодОКАТО");
	КонецЕсли;
	
	Для каждого НеиспользуемыйРеквизит Из НеиспользуемыеРеквизиты Цикл
		УдаляемыйРеквизит = МассивРеквизитовОперации.Найти(НеиспользуемыйРеквизит);
		Если УдаляемыйРеквизит <> Неопределено Тогда
			МассивРеквизитовОперации.Удалить(УдаляемыйРеквизит);
		КонецЕсли;
	КонецЦикла;
	
	ЭтоФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ЮрФизЛицо") = Перечисления.ЮрФизЛицо.ФизЛицо;
	
	Если Не (Объект.ФормаОплатыБезналичная
		И Объект.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту
		Или Объект.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств
		Или (Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаАрендодателю
		И ЭтоФизЛицо)) Тогда
		Объект.КодВидаДохода = "";
	КонецЕсли;
	
	Если Не (Объект.ФормаОплатыБезналичная
		И Объект.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту
		Или Объект.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета) Тогда
		Объект.КодВыплат = "";
	КонецЕсли;
	
	ДенежныеСредстваСерверЛокализация.ОчиститьНеиспользуемыеРеквизитыОплатыСамозанятым(Объект);
	
	Если Объект.ФормаОплатыЗаявки <> Перечисления.ФормыОплаты.ПустаяСсылка()
		И Объект.ФормаОплатыЗаявки <> Перечисления.ФормыОплаты.СистемаБыстрыхПлатежей Тогда
		Объект.ИдентификаторОперацииСБП = "";
		Объект.ПлатежнаяСсылкаСБП = "";
	КонецЕсли;
	
	
	
	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(Объект, МассивВсехРеквизитов, МассивРеквизитовОперации);
	//-- Локализация
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина, то запись выполнена не будет и будет вызвано исключение.
//
Процедура ПриЗаписи(Объект, Отказ) Экспорт
	
	//++ Локализация
	Если ПроведениеДокументов.СвойстваДокумента(Объект).РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		И Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
		
		ЗарегистрироватьПланированиеОплатыНДСПоСчетамФактурам(Объект);
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  ОбъектКопирования - ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств - Исходный документ, который является источником копирования.
//
Процедура ПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	//++ Локализация
	ДенежныеСредстваСерверЛокализация.ОбновитьРеквизитыПлательщика(Объект, ТекущаяДатаСеанса());
	ДенежныеСредстваСерверЛокализация.ПриИзмененииПравилПлатежейВБюджет(Объект, ОбъектКопирования.Дата, ТекущаяДатаСеанса());
	ДенежныеСредстваСерверЛокализация.ОчиститьРеквизитыОплатыСамозанятому(Объект);
	ДенежныеСредстваСерверЛокализация.ИнициализироватьБанковскиеСчетаСпискаКонтрагентов(Объект);
	Объект.ИдентификаторОперацииСБП = "";
	Объект.ПлатежнаяСсылкаСБП = "";
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	//++ Локализация

	
	//-- Локализация
	
КонецПроцедуры

// Добавляет команду создания документа "Авансовый отчет".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт


КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//++ Локализация


	//-- Локализация
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//++ Локализация
	Если ПравоДоступа("Чтение", Метаданные.Документы.СписаниеБезналичныхДенежныхСредств) Тогда
		// Платежное поручение
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.СписаниеБезналичныхДенежныхСредств";
		КомандаПечати.Идентификатор = "ПлатежноеПоручение";
		КомандаПечати.Представление = НСтр("ru = 'Образец платежного поручения'");
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//++ Локализация
	ТабличныйДокумент = Новый ТабличныйДокумент;
	

	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

// Заполняет идентификатор платежа по платежной ссылке СБП в заявке на оплату.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств - заявка на оплату.
//  ПлатежнаяСсылка - Строка - Платежная ссылка СБП.
//
Процедура ЗаполнитьИдентификаторПлатежаПоПлатежнойСсылкеСБП(ДокументОбъект, ПлатежнаяСсылка) Экспорт

	//++ Локализация
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", ДокументОбъект.Организация);
	Отбор.Вставить("БанковскийСчетОрганизации", ДокументОбъект.БанковскийСчет);
	Отбор.Вставить("Склад", Неопределено);
	Отбор.Вставить("ВидКонтрагента", Перечисления.ЮрФизЛицо.ЮрЛицо);
	
	ПараметрыНастроек = СистемаБыстрыхПлатежейУТ.ДоступныеНастройкиПодключения(Отбор);
	
	Если ПараметрыНастроек.НастройкиПодключения <> Неопределено
		И ПараметрыНастроек.НастройкиПодключения.Количество() >= 1 Тогда
		НастройкаПодключения = ПараметрыНастроек.НастройкиПодключения[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НастройкаПодключения", НастройкаПодключения);
	ПараметрыПроцедуры.Вставить("ПлатежнаяСсылка", ПлатежнаяСсылка);
	
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыЗадания.НаименованиеФоновогоЗадания = НСтр("ru='Получение данных функциональной ссылки Системы быстрых платежей'");
	ПараметрыЗадания.ОжидатьЗавершение = Неопределено;
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьВФоне("СистемаБыстрыхПлатежейУТ.ДанныеЗаполненияПоПлатежнойСсылкеСБПb2b", ПараметрыПроцедуры, ПараметрыЗадания);
	ДанныеЗаполнения = ПолучитьИзВременногоХранилища(ФоновоеЗадание.АдресРезультата);
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.КодОшибки) Тогда
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Ошибка получения данных платежной ссылки СБП: %1'"),
			ДанныеЗаполнения.СообщениеОбОшибке);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	ДокументОбъект.ПлатежнаяСсылкаСБП = ПлатежнаяСсылка;
	ДокументОбъект.ИдентификаторОперацииСБП = ДанныеЗаполнения.ИдентификаторОперации;
	ДокументОбъект.ИдентификаторПлатежа = ДанныеЗаполнения.ИдентификаторПлатежа;
	ДокументОбъект.ФормаОплатыЗаявки = ДанныеЗаполнения.ФормаОплатыЗаявки;
	ДокументОбъект.ФормаОплатыНаличная = ДанныеЗаполнения.ФормаОплатыНаличная;
	ДокументОбъект.ФормаОплатыПлатежнаяКарта = ДанныеЗаполнения.ФормаОплатыПлатежнаяКарта;
	ДокументОбъект.ФормаОплатыБезналичная = ДанныеЗаполнения.ФормаОплатыБезналичная;
	
	//-- Локализация
	
	Возврат;

КонецПроцедуры
 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Дополняет доступные формы оплаты в список.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа.
//
Процедура ДополнитьДоступныеФормыОплаты(Форма) Экспорт

	//++ Локализация
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	ФормыОплаты = Элементы.ФормаОплаты.СписокВыбора; // СписокЗначений
	
	Если Не ЭтоОперацияОплатыБезСБП(Объект.ХозяйственнаяОперация, Объект.ПлатежСКонвертацией, Форма.КонтрагентЮрФизЛицо) Тогда
		ФормыОплаты.Добавить("СБП", НСтр("ru = 'СБП'"));
	КонецЕсли;
	//-- Локализация
	
	Возврат;

КонецПроцедуры

#Область СистемаБыстрыхПлатежей

// Заполнить платежную ссылку и идентификатор оплаты СБП по документу основанию.
//
// Параметры:
//  ДанныеЗаполнения - Структура - данные заполнения документа.
//  СписокДокументов - Массив из ДокументСсылка, ДокументСсылка - документы-основания.
//  СуммаКОплате - Число - сумма к оплате по платежной ссылке.
//
Процедура ЗаполнитьПлатежнуюСсылкуПоОснованию(ДанныеЗаполнения, СписокДокументов, СуммаКОплате) Экспорт

	//++ Локализация
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВходящиеПлатежныеСсылкиСБП.ДокументОперации КАК Документ,
		|	ВходящиеПлатежныеСсылкиСБП.ПлатежнаяСсылка КАК ПлатежнаяСсылка,
		|	ВходящиеПлатежныеСсылкиСБП.СуммаОперации КАК СуммаОперации,
		|	ВходящиеПлатежныеСсылкиСБП.ДатаСоздания КАК ДатаСоздания,
		|	ВходящиеПлатежныеСсылкиСБП.НастройкаПодключения КАК НастройкаПодключения,
		|	ВходящиеПлатежныеСсылкиСБП.ИдентификаторПлатежа КАК ИдентификаторПлатежа
		|ПОМЕСТИТЬ ПлатежныеСсылкиПоДокументам
		|ИЗ
		|	РегистрСведений.ВходящиеПлатежныеСсылкиСБП КАК ВходящиеПлатежныеСсылкиСБП
		|ГДЕ
		|	ВходящиеПлатежныеСсылкиСБП.ДокументОперации В(&ДокументыОперации)
		|	И ВходящиеПлатежныеСсылкиСБП.ПроверкаПройдена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежныеСсылкиПоДокументам.Документ КАК Документ,
		|	ПлатежныеСсылкиПоДокументам.ПлатежнаяСсылка КАК ПлатежнаяСсылка,
		|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка КАК Ссылка,
		|	ПлатежныеСсылкиПоДокументам.СуммаОперации КАК СуммаОперации,
		|	ПлатежныеСсылкиПоДокументам.НастройкаПодключения КАК НастройкаПодключения,
		|	ПлатежныеСсылкиПоДокументам.ИдентификаторПлатежа КАК ИдентификаторПлатежа
		|ИЗ
		|	ПлатежныеСсылкиПоДокументам КАК ПлатежныеСсылкиПоДокументам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
		|		ПО ПлатежныеСсылкиПоДокументам.ПлатежнаяСсылка = ЗаявкаНаРасходованиеДенежныхСредств.ПлатежнаяСсылкаСБП
		|			И (ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка ЕСТЬ NULL";
	
	Если ТипЗнч(СписокДокументов) <> Тип("Массив") Тогда
		СписокДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СписокДокументов);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументыОперации", СписокДокументов);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(Выборка.ПлатежнаяСсылка);
		ДанныеЗаполнения.Вставить("ПлатежнаяСсылкаСБП", Выборка.ПлатежнаяСсылка);
		ДанныеЗаполнения.Вставить("ИдентификаторОперацииСБП", СтруктураURI.ПутьНаСервере);
		СуммаКОплате = Выборка.СуммаОперации;
		Прервать;
		
	КонецЦикла;
	
	//-- Локализация

КонецПроцедуры

// Возвращает признак оплаты без возможности применения СБП.
// 
// Параметры:
//  ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - хозяйственная операция документа оплаты.
//  ПлатежСКонвертацией - Булево - признак платежа с конвертацией.
//  ВидКонтрагента - ПеречислениеСсылка.ЮрФизЛицо - вид контрагента.
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоОперацияОплатыБезСБП(ХозяйственнаяОперация, ПлатежСКонвертацией, ВидКонтрагента) Экспорт

	Возврат ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоКредитам
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КонвертацияВалюты
		Или ПлатежСКонвертацией
		Или ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо;

КонецФункции

//++ Локализация

// Проверяет заполнение платежной ссылки в заявке на оплату.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств - заявка на оплату.
//  Ошибка - Булево - признак наличия ошибки.
//
Процедура ПроверитьЗаполнениеПлатежнойСсылкиСБП(ДокументОбъект, Ошибка) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ПлатежнаяСсылкаСБП) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыРасчетов = ДокументОбъект.РасшифровкаПлатежа.ВыгрузитьКолонку("ОбъектРасчетов");
	ОбъектыРасчетов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ОбъектыРасчетов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
		|	ЕСТЬNULL(ВходящиеПлатежныеСсылкиСБП.ПлатежнаяСсылка, """") КАК ПлатежнаяСсылка,
		|	ЕСТЬNULL(ВходящиеПлатежныеСсылкиСБП.ТипСсылки, """") КАК ТипСсылки,
		|	ЕСТЬNULL(ВходящиеПлатежныеСсылкиСБП.ПроверкаПройдена, ИСТИНА) КАК ПроверкаПройдена
		|ПОМЕСТИТЬ ПлатежныеСсылкиОбъектовРасчетов
		|ИЗ
		|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВходящиеПлатежныеСсылкиСБП КАК ВходящиеПлатежныеСсылкиСБП
		|		ПО ОбъектыРасчетов.Объект = ВходящиеПлатежныеСсылкиСБП.ДокументОперации
		|ГДЕ
		|	ОбъектыРасчетов.Ссылка В(&ОбъектыРасчетов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыРасчетов.Ссылка,
		|	ЕСТЬNULL(ВходящиеПлатежныеСсылкиСБП.ПлатежнаяСсылка, """"),
		|	ЕСТЬNULL(ВходящиеПлатежныеСсылкиСБП.ТипСсылки, """"),
		|	ЕСТЬNULL(ВходящиеПлатежныеСсылкиСБП.ПроверкаПройдена, ИСТИНА)
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВходящиеПлатежныеСсылкиСБП.ПлатежнаяСсылка, """") = """"
		|				ТОГДА ИСТИНА
		|			КОГДА ЕСТЬNULL(ВходящиеПлатежныеСсылкиСБП.ПлатежнаяСсылка, """") = &ПлатежнаяСсылка
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежныеСсылкиОбъектовРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ПлатежныеСсылкиОбъектовРасчетов.ПлатежнаяСсылка = """"
		|					ИЛИ ПлатежныеСсылкиОбъектовРасчетов.ПлатежнаяСсылка = &ПлатежнаяСсылка
		|						И ПлатежныеСсылкиОбъектовРасчетов.ПроверкаПройдена
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ПлатежнаяСсылкаСовпадает
		|ИЗ
		|	ПлатежныеСсылкиОбъектовРасчетов КАК ПлатежныеСсылкиОбъектовРасчетов
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлатежныеСсылкиОбъектовРасчетов.ОбъектРасчетов
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ПлатежныеСсылкиОбъектовРасчетов.ПлатежнаяСсылка = """"
		|					ИЛИ ПлатежныеСсылкиОбъектовРасчетов.ПлатежнаяСсылка = &ПлатежнаяСсылка
		|						И ПлатежныеСсылкиОбъектовРасчетов.ПроверкаПройдена
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПлатежныеСсылкиОбъектовРасчетов.ТипСсылки КАК ТипСсылки
		|ИЗ
		|	ПлатежныеСсылкиОбъектовРасчетов КАК ПлатежныеСсылкиОбъектовРасчетов
		|ГДЕ
		|	ПлатежныеСсылкиОбъектовРасчетов.ПлатежнаяСсылка = &ПлатежнаяСсылка";
	
	Запрос.УстановитьПараметр("ОбъектыРасчетов", ОбъектыРасчетов);
	Запрос.УстановитьПараметр("ПлатежнаяСсылка", ДокументОбъект.ПлатежнаяСсылкаСБП);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	Выборка = РезультатыЗапросов[РезультатыЗапросов.ВГраница() - 1].Выбрать();
	ВыборкаТипСсылки = РезультатыЗапросов[РезультатыЗапросов.ВГраница()].Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'К объекту %1 привязана другая платежная ссылка'"), Выборка.ОбъектРасчетов);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Ошибка);
		Прервать;
		
	КонецЦикла;
	
	Если ВыборкаТипСсылки.Следующий() Тогда
		ТипСсылки = ВыборкаТипСсылки.ТипСсылки;
	Иначе
		ТипСсылки = "";
	КонецЕсли;
	
	Если ТипСсылки = "02" Тогда
		ПроверитьИспользованиеПлатежнойСсылкиВЗаявках(ДокументОбъект.Ссылка, ДокументОбъект.ПлатежнаяСсылкаСБП, Ошибка);
	КонецЕсли;

КонецПроцедуры

// Проверяет использование платежной ссылки в заявках.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств - заявка на оплату.
//  ПлатежнаяСсылка - Строка - Платежная ссылка.
//  Ошибка - Булево - Ошибка.
Процедура ПроверитьИспользованиеПлатежнойСсылкиВЗаявках(ДокументСсылка, ПлатежнаяСсылка, Ошибка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
		|ГДЕ
		|	НЕ ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления
		|	И ЗаявкаНаРасходованиеДенежныхСредств.ПлатежнаяСсылкаСБП = &ПлатежнаяСсылка
		|	И ЗаявкаНаРасходованиеДенежныхСредств.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ПлатежнаяСсылка", ПлатежнаяСсылка);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Платежная ссылка уже привязана к документу %1'"), Выборка.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Ошибка);
			Прервать;
		
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

//-- Локализация

#КонецОбласти

#Область РеквизитыПолучателя

// Возвращает данные о получателе денежных средств в зависимости от типа хозяйственной операции.
//
// Параметры:
//   Объект - ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств, ДанныеФормыСтруктура - документ заявки
//
// Возвращаемое значение:
//   Структура:
//     * Получатель - СправочникСсылка.ФизическиеЛица, СправочникСсылка.Контрагенты, СправочникСсылка.Организации, Неопределено - получатель денежных средств
//     * СчетПолучателя - СправочникСсылка.БанковскиеСчетаОрганизаций, СправочникСсылка.БанковскиеСчетаКонтрагентов, Неопределено - банковский счет получателя
//     * ПравоСубъект - ПеречислениеСсылка.ЮрФизЛицо - признак юридического или физического лица
//
Функция ДанныеПолучателяХозяйственнойОперации(Объект) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Получатель", Неопределено);
	Результат.Вставить("СчетПолучателя", Неопределено);
	Результат.Вставить("ПравоСубъект", Перечисления.ЮрФизЛицо.ПустаяСсылка());
	
	// Получатель - физлицо
	Если (Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику)
		И Не Объект.ПеречислениеСотрудникуЧерезБанк
		И Не Объект.СписокФизЛиц Тогда
		
		Результат.Получатель = Объект.ПодотчетноеЛицо;
		Результат.ПравоСубъект = Перечисления.ЮрФизЛицо.ФизЛицо;
		Результат.СчетПолучателя = Объект.БанковскийСчетКонтрагента;
	
	// Получатель - неопределено (нет поля получателя на форме)
	ИначеЕсли (Объект.СписокФизЛиц
		Или Объект.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета)
		И Не Объект.ПеречислениеСотрудникуЧерезБанк Тогда
		
		Результат.Получатель = Неопределено;
		Результат.ПравоСубъект = Перечисления.ЮрФизЛицо.ПустаяСсылка();
		Результат.СчетПолучателя = Неопределено;
	
	// Получатель - организация
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств Тогда
		
		Результат.Получатель = Объект.ОрганизацияПолучатель; // СправочникСсылка.Организации
		Результат.ПравоСубъект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат.Получатель, "ЮрФизЛицо");
		Результат.СчетПолучателя = Объект.БанковскийСчетПолучатель;
		
	ИначеЕсли Объект.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Касса, "Владелец, Владелец.ЮрФизЛицо");
		Результат.Получатель = ЗначенияРеквизитов.Владелец;
		Результат.ПравоСубъект = ЗначенияРеквизитов.ВладелецЮрФизЛицо;
		Результат.СчетПолучателя = Неопределено;
		
	// Получатель - контрагент
	Иначе
		
		Результат.Получатель = Объект.Контрагент; //СправочникСсылка.Контрагенты
		Результат.ПравоСубъект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат.Получатель, "ЮрФизЛицо");
		Результат.СчетПолучателя = Объект.БанковскийСчетКонтрагента;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Процедура дополняет тексты запросов проведения документа.
//
// Параметры:
//  Запрос - Запрос - Общий запрос проведения документа.
//  ТекстыЗапроса - СписокЗначений - Список текстов запроса проведения.
//  Регистры - Строка, Структура - Список регистров проведения документа через запятую или в ключах структуры.
//
Процедура ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	//++ Локализация

	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область Прочее
//++ Локализация

Функция ПараметрыПроверкиКорреспонденцииМеждуБанковскимиСчетами(Объект)
	
	МассивБанковскихСчетов = ОбщегоНазначенияКлиентСервер.МассивЗначений(
		Объект.БанковскийСчет, Объект.БанковскийСчетПолучатель, Объект.БанковскийСчетКонтрагента);
	ДанныеБанковскихСчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивБанковскихСчетов, "СчетЦифровогоРубля");
	
	СчетаРаспределения = Новый Массив;
	Для Каждого СтрокаСчета Из Объект.РаспределениеПоСчетам Цикл
		Если ТипЗнч(СтрокаСчета.БанковскийСчетКасса) = Тип("СправочникСсылка.БанковскиеСчетаОрганизаций") Тогда
			СчетаРаспределения.Добавить(СтрокаСчета.БанковскийСчетКасса);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеБанковскихСчетовОрганизации =
		ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СчетаРаспределения, "СчетЦифровогоРубля");
		
	КорСчетОрганизацииЦифровогоРубля = ?(ЗначениеЗаполнено(Объект.БанковскийСчетПолучатель),
		                                 ДанныеБанковскихСчетов.Получить(Объект.БанковскийСчетПолучатель), Ложь);
	КорСчетКонтрагентаЦифровогоРубля = ?(ЗначениеЗаполнено(Объект.БанковскийСчетКонтрагента),
		                                 ДанныеБанковскихСчетов.Получить(Объект.БанковскийСчетКонтрагента), Ложь);
		
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("СчетЦифровогоРубляОрганизации",    Ложь);
	ПараметрыПроверки.Вставить("РасчетныйСчетОрганизации",         Ложь);
	ПараметрыПроверки.Вставить("КорСчетОрганизацииЦифровогоРубля", КорСчетОрганизацииЦифровогоРубля);
	ПараметрыПроверки.Вставить("КорСчетКонтрагентаЦифровогоРубля", КорСчетКонтрагентаЦифровогоРубля);
	ПараметрыПроверки.Вставить("ОтсутствуетРаспределениеПоСчетам", Не СчетаРаспределения.Количество());
	
	Если ЗначениеЗаполнено(ДанныеБанковскихСчетов.Получить(Объект.БанковскийСчет)) Тогда
		ДанныеБанковскихСчетовОрганизации.Вставить(Объект.БанковскийСчет,
			                                       ДанныеБанковскихСчетов.Получить(Объект.БанковскийСчет));
	КонецЕсли;
	
	Для Каждого ОписаниеБанковскогоСчета Из ДанныеБанковскихСчетовОрганизации Цикл
		Если ОписаниеБанковскогоСчета.Значение Тогда
			ПараметрыПроверки.Вставить("СчетЦифровогоРубляОрганизации", Истина);
		Иначе
			ПараметрыПроверки.Вставить("РасчетныйСчетОрганизации", Истина);
		КонецЕсли;
	КонецЦикла;
	
	ИмяЭлементаПозиционирования = ?(ПараметрыПроверки.ОтсутствуетРаспределениеПоСчетам,
				                    "БанковскийСчет",
				                    "РаспределениеПоСчетам[0].РаспределениеПоСчетамБанковскийСчет");
	
	ПараметрыПроверки.Вставить("ИмяЭлементаБанковскийСчет",    ИмяЭлементаПозиционирования);
	ПараметрыПроверки.Вставить("ИмяЭлементаКорБанковскийСчет", "БанковскийСчетПолучатель");
	
	Возврат ПараметрыПроверки;
	
КонецФункции

// Определяет свойства полей формы в зависимости от данных
// 
// Параметры:
//  Настройки - см. ДенежныеСредстваСервер.ИнициализироватьНастройкиПолейФормы.
// 
Процедура ЗаполнитьНастройкиПолейФормы(Настройки) Экспорт
	
	Финансы = ФинансоваяОтчетностьСервер;
	Операции = Перечисления.ХозяйственныеОперации;
	
	ОтборВыплатаСамозанятому = ДенежныеСредстваСервер.ОтборВыплатаСамозанятому();
	ОтборДопускаетсяБезналичнаяОплата = ДенежныеСредстваСервер.ОтборБезналичнаяОплатаЗаявки();
	
	#Область Шапка
	//
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ПодобратьСчетаФактуры");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ОплатаНДСВБюджетПоОтдельнымОперациям", Истина);
	Элемент.Свойства.Вставить("Видимость");
	
	
	// СПАРКРиски
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ГруппаИндексыСПАРКРиски");
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.КонвертацияВалюты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ОплатаПоКредитам);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВыдачаЗаймов);
	
	ГруппаИ = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	Финансы.НовыйОтбор(ГруппаИ, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты);
	Финансы.НовыйОтбор(ГруппаИ, "ХозяйственнаяОперацияПоЗарплате", Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту);
	
	Элемент.Свойства.Вставить("Видимость");
	
	// Получатель
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Получатель");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
	Элемент.Свойства.Вставить("АвтоОтметкаНезаполненного", Ложь);
	Элемент.Свойства.Вставить("ОтметкаНезаполненного", Ложь);
	
	#КонецОбласти
	
	#Область Реквизиты
	// Только просмотр
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("НДФЛПоВедомостям");
	Элемент.Поля.Добавить("ПеречислениеВБюджет");
	Элемент.Поля.Добавить("ПлатежиПо275ФЗ");
	Элемент.Поля.Добавить("ПлатежиПо275ФЗВыплатаЗарплаты");
	Элемент.Поля.Добавить("ИдентификаторПлатежа");
	Элемент.Поля.Добавить("НомерВедомостиНаВыплатуЗарплаты");
	Элемент.Поля.Добавить("ДатаВедомостиНаВыплатуЗарплаты");
	Элемент.Поля.Добавить("ТипПлатежаФЗ275");
	Элемент.Поля.Добавить("ПредметОплаты");
	Элемент.Поля.Добавить("ВариантОплаты");
	Элемент.Поля.Добавить("ПунктКонтрактаПредмета");
	Элемент.Поля.Добавить("ПунктКонтрактаОплаты");
	Элемент.Поля.Добавить("ПодтверждающиеДокументы");
	Элемент.Поля.Добавить("КодВидаДохода");
	Элемент.Поля.Добавить("КодВыплат");
	Элемент.Поля.Добавить("СтатьяЦелевыхСредств");
	Элемент.Поля.Добавить("СписокКонтрагентовОтключено");
	Элемент.Поля.Добавить("СписокКонтрагентовВключено");
	Элемент.Поля.Добавить("Получатель");
	Элемент.Поля.Добавить("ЛокализацияГруппаОперацияССамозанятым");
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	Финансы.НовыйОтбор(ГруппаИли, "Закрыта", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "Проведен", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.Модифицированность", Ложь);
	Элемент.Свойства.Вставить("ТолькоПросмотр");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ЗаполнитьПоПредыдущемуПлатежу");
	Элемент.Поля.Добавить("НадписьРеквизитыПлатежаВБюджет");
	Элемент.Поля.Добавить("ЗаполнитьВедомостиПоОстаткам");
	Элемент.Поля.Добавить("ЗаполнитьПодтверждающиеДокументы");
	Элемент.Поля.Добавить("НадписьРеквизитыПлательщика");
	Элемент.Поля.Добавить("НадписьРеквизитыПолучателя");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	Финансы.НовыйОтбор(Элемент.Условие, "Проведен", Истина);
	Элемент.Свойства.Вставить("Доступность", Ложь);
	
	// Номер и дата ведомости на выплату зарплаты
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("НомерВедомостиНаВыплатуЗарплаты");
	Элемент.Поля.Добавить("ДатаВедомостиНаВыплатуЗарплаты");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьНачислениеЗарплатыУТ", Ложь);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("НомерВедомостиНаВыплатуЗарплаты");
	Элемент.Поля.Добавить("ДатаВедомостиНаВыплатуЗарплаты");
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьСинхронизациюДанных", Ложь);
	Элемент.Свойства.Вставить("АвтоОтметкаНезаполненного", Ложь);
	Элемент.Свойства.Вставить("ОтметкаНезаполненного", Ложь);
	
	// НДФЛПоВедомостям
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("НДФЛПоВедомостям");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет);
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ТипНалога", Справочники.ВидыНалоговВзносов.НДФЛ);
	Финансы.НовыйОтбор(ГруппаИли, "ТипНалога", Справочники.ВидыНалоговВзносов.НДФЛСПревышения);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьНачислениеЗарплатыУТ", Истина);
	Элемент.Свойства.Вставить("Видимость");
	
	// ПеречислениеВБюджет
	ОтборОперацийПеречисленияВБюджет = Новый ОтборКомпоновкиДанных();
	ГруппаИли = Финансы.НовыйОтбор(ОтборОперацийПеречисленияВБюджет,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ГруппаИлиИ = Финансы.НовыйОтбор(ГруппаИли, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИлиИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	Финансы.НовыйОтбор(ГруппаИлиИ, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	Финансы.НовыйОтбор(ГруппаИлиИ, "ОперацияССамозанятым", Ложь);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПеречислениеТаможне);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ОплатаПоКредитам);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ПеречислениеВБюджет");
	Элемент.Поля.Добавить("Декорация1");
	Финансы.СкопироватьОтбор(ОтборОперацийПеречисленияВБюджет, Элемент.Условие);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("НадписьРеквизитыПлатежаВБюджет");
	Финансы.СкопироватьОтбор(ОтборОперацийПеречисленияВБюджет, Элемент.Условие);
	Финансы.НовыйОтбор(Элемент.Условие, "ПеречислениеВБюджет", Истина);
	Элемент.Свойства.Вставить("Видимость");
	
	// УИП
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ИдентификаторПлатежа");
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'УИП'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ИдентификаторПлатежа");
	Финансы.СкопироватьОтбор(ОтборОперацийПеречисленияВБюджет, Элемент.Условие);
	Финансы.НовыйОтбор(Элемент.Условие, "ПеречислениеВБюджет", Истина);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'УИН'"));
	
	// Код вида дохода
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("КодВидаДохода");
	Финансы.НовыйОтбор(Элемент.Условие, "ФормаОплатыБезналичная", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ДействуетУказание2019_5286У", Истина);
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперацияПоЗарплате", Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперацияПоЗарплате", Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	Финансы.СкопироватьОтбор(ОтборВыплатаСамозанятому, ГруппаИли);
	Элемент.Свойства.Вставить("Видимость");
	
	// Код выплат
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("КодВыплат");
	Финансы.НовыйОтбор(Элемент.Условие, "ФормаОплатыБезналичная", Истина);
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты);
	Элемент.Свойства.Вставить("Видимость");
	
	// Рублевый платеж
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ИдентификаторПлатежа");
	Элемент.Поля.Добавить("КодВидаДохода");
	Элемент.Поля.Добавить("КодВыплат");
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ВалютныйПлатеж", Ложь);
	Элемент.Свойства.Вставить("Видимость");
	
	// СБП
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ЛокализацияГруппаПлатежнаяСсылкаСБП");
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ДоступнаГиперссылкаСБП", Истина);
	Элемент.Свойства.Вставить("Видимость");
	#КонецОбласти
	
	
	#Область РасшифровкаПлатежа
	// Ведомость
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("РасшифровкаПлатежа.Ведомость");
	Элемент.Поля.Добавить("РасшифровкаБезРазбиенияВедомость");
	
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьНачислениеЗарплатыУТ", Истина);
	
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты);
	
	ГруппаИ = Финансы.НовыйОтбор(ГруппаИли,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ГруппаИли1 = Финансы.НовыйОтбор(ГруппаИ,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли1, "ТипНалога", Справочники.ВидыНалоговВзносов.НДФЛ);
	Финансы.НовыйОтбор(ГруппаИли1, "ТипНалога", Справочники.ВидыНалоговВзносов.НДФЛСПревышения);
	
	Финансы.НовыйОтбор(ГруппаИ, "НДФЛПоВедомостям", Истина);
	Финансы.НовыйОтбор(ГруппаИ, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет);
	
	Элемент.Свойства.Вставить("Видимость");
	#КонецОбласти
	
	#Область БанковскиеСчетаКонтрагентов
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскиеСчетаСпискаКонтрагентов.БанковскийСчетКонтрагента");
	Финансы.СкопироватьОтбор(ОтборДопускаетсяБезналичнаяОплата, Элемент.Условие);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("БанковскиеСчетаСпискаКонтрагентов.БанковскийСчетКонтрагента");
	Элемент.Поля.Добавить("БанковскиеСчетаСпискаКонтрагентов.Контрагент");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие, , , Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена);
	Элемент.Свойства.Вставить("АвтоОтметкаНезаполненного", Ложь);
	Элемент.Свойства.Вставить("ОтметкаНезаполненного", Ложь);
	#КонецОбласти
	
	#Область Команды
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ФормаВыгрузитьФайлДляОбменаСБанком");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты);
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперацияПоЗарплате", Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьНачислениеЗарплатыУТ", Истина);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ФормаВыгрузитьФайлДляОбменаСБанком");
	Финансы.НовыйОтбор(Элемент.Условие, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате, , ВидСравненияКомпоновкиДанных.Равно);
	Элемент.Свойства.Вставить("Доступность");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ЗаполнитьОстаткамиНевыданныхСуммСотруднику");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьНачислениеЗарплатыУТ", Истина);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ЗаполнитьОстаткамиНевыданныхСуммСотруднику");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
	Финансы.НовыйОтбор(ГруппаИли, "Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате);
	Финансы.НовыйОтбор(Элемент.Условие, "Проведен", Истина);
	Элемент.Свойства.Вставить("Доступность", Ложь);
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ЗаполнитьВедомостиПоОстаткам");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ИспользоватьНачислениеЗарплатыУТ", Истина);
	Элемент.Свойства.Вставить("Видимость");
	#КонецОбласти
	
	ДенежныеСредстваСерверЛокализация.ЗаполнитьНастройкиПолейФормы(Настройки);
	
КонецПроцедуры

// Заполняет таблицу реквизитов, зависимых от хозяйственной операции документа.
//
// Параметры:
//	Объект - ДокументОбъект - Объект заявка
//	МассивВсехРеквизитов - Массив из Строка - Массив всех реквизитов, зависимых от хозяйственной операции
//	МассивРеквизитовОперации - Массив из Строка - Массив имен реквизитов, используемых в выбранной хозяйственной операции.
//
Процедура ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(Объект, МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт
	
	ХозяйственнаяОперация = Объект.ХозяйственнаяОперация;
	ПеречислениеВБюджет = Объект.ПеречислениеВБюджет;
	
	МассивВсехРеквизитов.Добавить("ДатаВедомостиНаВыплатуЗарплаты");
	МассивВсехРеквизитов.Добавить("ИдентификаторПлатежа");
	МассивВсехРеквизитов.Добавить("ИННПлательщика");
	МассивВсехРеквизитов.Добавить("КПППлательщика");
	МассивВсехРеквизитов.Добавить("РегистрацияВНалоговомОргане");
	МассивВсехРеквизитов.Добавить("НДФЛПоВедомостям");
	МассивВсехРеквизитов.Добавить("НомерВедомостиНаВыплатуЗарплаты");
	МассивВсехРеквизитов.Добавить("ПеречислениеВБюджет");
	МассивВсехРеквизитов.Добавить("ПоказательДаты");
	МассивВсехРеквизитов.Добавить("ПоказательНомера");
	МассивВсехРеквизитов.Добавить("ПоказательОснования");
	МассивВсехРеквизитов.Добавить("ПоказательПериода");
	МассивВсехРеквизитов.Добавить("ПоказательТипа");
	МассивВсехРеквизитов.Добавить("СтатусСоставителя");
	МассивВсехРеквизитов.Добавить("ТекстПлательщика");
	МассивВсехРеквизитов.Добавить("КодБК");
	МассивВсехРеквизитов.Добавить("КодОКАТО");
	
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Ведомость");
	
	МассивВсехРеквизитов.Добавить("БанковскиеСчетаСпискаКонтрагентов");
	МассивВсехРеквизитов.Добавить("БанковскиеСчетаСпискаКонтрагентов.Контрагент");
	МассивВсехРеквизитов.Добавить("БанковскиеСчетаСпискаКонтрагентов.БанковскийСчетКонтрагента");
	МассивВсехРеквизитов.Добавить("БанковскиеСчетаСпискаКонтрагентов.Сумма");
	
	МассивРеквизитовОперации = Новый Массив;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		МассивРеквизитовОперации.Добавить("ИдентификаторПлатежа");
		
		МассивРеквизитовОперации.Добавить("БанковскиеСчетаСпискаКонтрагентов");
		МассивРеквизитовОперации.Добавить("БанковскиеСчетаСпискаКонтрагентов.Контрагент");
		МассивРеквизитовОперации.Добавить("БанковскиеСчетаСпискаКонтрагентов.БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("БанковскиеСчетаСпискаКонтрагентов.Сумма");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		МассивРеквизитовОперации.Добавить("ИдентификаторПлатежа");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств
		ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		МассивРеквизитовОперации.Добавить("ИдентификаторПлатежа");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		МассивРеквизитовОперации.Добавить("ИдентификаторПлатежа");
		
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		МассивРеквизитовОперации.Добавить("ИдентификаторПлатежа");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		МассивРеквизитовОперации.Добавить("ИдентификаторПлатежа");
		
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		МассивРеквизитовОперации.Добавить("ИдентификаторПлатежа");
		МассивРеквизитовОперации.Добавить("НомерВедомостиНаВыплатуЗарплаты");
		МассивРеквизитовОперации.Добавить("ДатаВедомостиНаВыплатуЗарплаты");
		
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоКредитам Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		МассивРеквизитовОперации.Добавить("ИдентификаторПлатежа");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеНаДепозиты Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		МассивРеквизитовОперации.Добавить("ИдентификаторПлатежа");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймов Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		МассивРеквизитовОперации.Добавить("ИдентификаторПлатежа");
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		МассивРеквизитовОперации.Добавить("ИдентификаторПлатежа");
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплатыУТ") Тогда
			МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяЦелевыхСредств");
		Иначе
			МассивРеквизитовОперации.Добавить("СтатьяЦелевыхСредств");
		КонецЕсли;
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту Тогда
		МассивРеквизитовОперации.Добавить("ИННПлательщика");
		МассивРеквизитовОперации.Добавить("КПППлательщика");
		МассивРеквизитовОперации.Добавить("ТекстПлательщика");
		
	
	КонецЕсли;
	
	ДопускаетсяПеречислениеВБюджет =
		(ДенежныеСредстваСерверЛокализация.МассивОперацийПеречисленияВБюджет().Найти(ХозяйственнаяОперация) <> Неопределено);
	
	Если ДопускаетсяПеречислениеВБюджет Тогда
		МассивРеквизитовОперации.Добавить("ПеречислениеВБюджет");
		МассивРеквизитовОперации.Добавить("КодБК");
		МассивРеквизитовОперации.Добавить("КодОКАТО");
	КонецЕсли;
	
	Если ДопускаетсяПеречислениеВБюджет И (ПеречислениеВБюджет = Неопределено Или ПеречислениеВБюджет) Тогда
		МассивРеквизитовОперации.Добавить("ВидПеречисленияВБюджет");
		МассивРеквизитовОперации.Добавить("ПоказательДаты");
		МассивРеквизитовОперации.Добавить("ПоказательНомера");
		МассивРеквизитовОперации.Добавить("ПоказательОснования");
		МассивРеквизитовОперации.Добавить("ПоказательПериода");
		МассивРеквизитовОперации.Добавить("ПоказательТипа");
		МассивРеквизитовОперации.Добавить("СтатусСоставителя");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоСчетуФактуреНалоговогоАгента(Объект, Знач ДокументОснование, ДанныеЗаполнения)
	
	// Заполним данные шапки документа.
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	&Ссылка КАК ДокументОснование,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)                   КАК ФормаОплатыЗаявки,
	|	ЛОЖЬ                           КАК ФормаОплатыНаличная,
	|	ИСТИНА                         КАК ФормаОплатыБезналичная
	|ИЗ
	|	Документ.СчетФактураНалоговыйАгент КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В (&Ссылки)
	|");
	Запрос.УстановитьПараметр("Ссылки", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеЗаполнения = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ДанныеЗаполнения.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Выборка);
		
		НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ВалютаВзаиморасчетов = Выборка.Валюта;
		НоваяСтрока.Сумма = Выборка.СуммаНДС;
		НоваяСтрока.СуммаВзаиморасчетов = Выборка.СуммаНДС;
	КонецЦикла;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаявлениюОВвозеТоваров(Объект, Знач ДокументОснование, ДанныеЗаполнения)
	
	ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Объект.Организация);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация    КАК Организация,
	|	&ТекущаяДата                   КАК ЖелательнаяДатаПлатежа,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаНДС,
	|	&Ссылка                        КАК ДокументОснование,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)                   КАК ФормаОплатыЗаявки,
	|	ЛОЖЬ                           КАК ФормаОплатыНаличная,
	|	ИСТИНА                         КАК ФормаОплатыБезналичная
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В (&Ссылки)
	|");
	Запрос.УстановитьПараметр("Ссылки", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеЗаполнения = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ДанныеЗаполнения.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Выборка);
		
		НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета;
		НоваяСтрока.Сумма = Выборка.СуммаНДС;
		НоваяСтрока.СуммаВзаиморасчетов = Выборка.СуммаНДС;
	КонецЦикла;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоОперацииПоЯндексКассе(Объект, Знач ДокументОснование, ДанныеЗаполнения)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ТекущаяДата КАК ЖелательнаяДатаПлатежа,
	|	ДанныеДокумента.ИдентификаторТранзакции КАК ИдентификаторТранзакции,
	|
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|
	|	ДанныеДокумента.Партнер КАК Партнер,
	|	ДанныеДокумента.Эквайер КАК Контрагент,
	|
	|	ДанныеДокумента.Валюта КАК ВалютаВзаиморасчетов,
	|	ДанныеДокумента.БанковскийСчет КАК БанковскийСчет,
	|	ДанныеДокумента.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|	ДанныеДокумента.СуммаДокумента КАК Сумма,
	|
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
	|	ДанныеДокумента.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту) КАК ХозяйственнаяОперация,
	|	&Ссылка КАК ДокументОснование
	|
	|ИЗ
	|	Документ.ОперацияПоЯндексКассе КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеЗаполнения = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ДанныеЗаполнения.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Выборка);
	
	Если ДанныеЗаполнения.ДокументОснование = Неопределено Тогда 
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не требуется вводить Заявку на расходование денежных средств на основании документа %1, поскольку ввод доступен только на основании операций Поступления оплаты от клиента'"),
		ДокументОснование);
		ВызватьИсключение Текст;
	КонецЕсли;	
	
	ДанныеЗаполнения.Вставить("НазначениеПлатежа",
		 СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		 НСтр("ru = 'Возврат средств по договору %1 по переводу № %2 пользователя № %3, без НДС'"),
		 НСтр("ru = '<номер и дата Договора с Яндексом>'"),
		 Формат(ДанныеЗаполнения.ИдентификаторТранзакции, "ЧГ="),
		 НСтр("ru = '<номер, присвоенный Плательщику Оператором>'")));
	
	НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
	НоваяСтрока.ВалютаВзаиморасчетов 	= Выборка.ВалютаВзаиморасчетов;
	НоваяСтрока.Сумма 					= Выборка.Сумма;
	НоваяСтрока.СуммаВзаиморасчетов 	= Выборка.Сумма;
	НоваяСтрока.Партнер 				= Выборка.Партнер;
	НоваяСтрока.СтатьяРасходов 			= Выборка.СтатьяРасходов; 
	НоваяСтрока.АналитикаРасходов 		= Выборка.АналитикаРасходов; 
	НоваяСтрока.СтавкаНДС 				= Справочники.СтавкиНДС.БезНДС;
	НоваяСтрока.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");
	
КонецПроцедуры




Процедура ЗарегистрироватьПланированиеОплатыНДСПоСчетамФактурам(Объект)
	
	СчетаФактуры = УчетНДСРФ.НоваяТаблицаСчетовФактур();
	
	
	СтрокаСчетаФактуры = СчетаФактуры.Добавить();
	СтрокаСчетаФактуры.СчетФактура = Объект.ДокументОснование;
	СтрокаСчетаФактуры.СуммаОплаты = Объект.СуммаДокумента;
	
	УчетНДСРФ.ЗарегистрироватьПланированиеОплатыНДСПоСчетамФактурам(СчетаФактуры, Объект.ТипНалога, Объект.Ссылка, Истина);
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(Объект, ДанныеЗаполнения = Неопределено)
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "ПеречислениеВБюджет") Тогда
			Объект.ПеречислениеВБюджет = ДанныеЗаполнения.ПеречислениеВБюджет;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "Организация")
			И Не ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = ДанныеЗаполнения.Организация;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "БанковскийСчет")
			И Не ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
			Объект.БанковскийСчет = ДанныеЗаполнения.БанковскийСчет;
		КонецЕсли;
		
	КонецЕсли;
	
	РеквизитыПлательщика = ДенежныеСредстваСерверЛокализация.РеквизитыПлательщика(Объект, ТекущаяДатаСеанса());
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или Не ДанныеЗаполнения.Свойство("ИННПлательщика") Тогда
		Объект.ИННПлательщика = РеквизитыПлательщика.ИННПлательщика;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или Не ДанныеЗаполнения.Свойство("КПППлательщика") Тогда
		Объект.КПППлательщика = РеквизитыПлательщика.КПППлательщика;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или Не ДанныеЗаполнения.Свойство("ТекстПлательщика")
		Или Объект.ПеречислениеВБюджет Тогда
		Объект.ТекстПлательщика = РеквизитыПлательщика.ТекстПлательщика;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ОперацияССамозанятым")
		И ДанныеЗаполнения.ОперацияССамозанятым Тогда
		
		Объект.ОперацияССамозанятым = ДанныеЗаполнения.ОперацияССамозанятым;
		
		Если ДанныеЗаполнения.Свойство("ХозяйственнаяОперация") Тогда
			Объект.ХозяйственнаяОперация = ДанныеЗаполнения.ХозяйственнаяОперация;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Контрагент")
			И Не Объект.СписокКонтрагентов Тогда
			Объект.Контрагент = ДанныеЗаполнения.Контрагент;
		КонецЕсли;
		
	КонецЕсли;
	
	Если (Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
		И Объект.ОперацияССамозанятым) Тогда
		
		Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
		Объект.ПеречислениеВБюджет = Ложь;
		Объект.ПлатежиПо275ФЗ = Ложь;
		ДенежныеСредстваСерверЛокализация.УстановитьКодВидаДоходаСамозанятого(Объект);
		
	КонецЕсли;
	
	ДенежныеСредстваСерверЛокализация.ИнициализироватьБанковскиеСчетаСпискаКонтрагентов(Объект, ДанныеЗаполнения);
	
КонецПроцедуры

// Функция определяет доступную для хозяйственной операции форму оплаты
//
// Параметры:
//    Операция - ПеречислениеСсылка.ХозяйственныеОперации - Хоз. операция, для которой производится проверка.
//
// Возвращаемое значение:
//    ПеречислениеСсылка.ФормыОплаты, Неопределено - Ограничение по форме оплаты, либо Неопределено, если нет ограничений.
//
Функция ОграничениеФормыОплаты(Операция) Экспорт
	
	Ограничения = Новый Соответствие;
	Ограничения.Вставить(Перечисления.ХозяйственныеОперации.ПеречислениеТаможне, Перечисления.ФормыОплаты.Безналичная);
	
	Возврат Ограничения.Получить(Операция);
	
КонецФункции

// Дополняет переданную структуру значениями реквизитов доступных формы оплаты в зависимости от хозяйственной операции.
//
// Параметры:
//    ДанныеЗаполнения - Структура - Структура, содержащая хоз. операцию.
//
Процедура ЗаполнитьФормуОплатыПоХозОперации(ДанныеЗаполнения) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ХозяйственнаяОперация") Тогда
		
		ФормаОплаты = ОграничениеФормыОплаты(ДанныеЗаполнения.ХозяйственнаяОперация);
		
		Если ФормаОплаты <> Неопределено Тогда
			ДанныеЗаполнения.Вставить("ФормаОплатыНаличная",         (ФормаОплаты = Перечисления.ФормыОплаты.Наличная));
			ДанныеЗаполнения.Вставить("ФормаОплатыБезналичная",      (ФормаОплаты = Перечисления.ФормыОплаты.Безналичная 
																		Или ФормаОплаты = Перечисления.ФормыОплаты.СистемаБыстрыхПлатежей));
			ДанныеЗаполнения.Вставить("ФормаОплатыПлатежнаяКарта",   (ФормаОплаты = Перечисления.ФормыОплаты.ПлатежнаяКарта));
			ДанныеЗаполнения.Вставить("ФормаОплатыЗаявки",           ФормаОплаты);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоПлатежнойСсылкеСБП(Объект, ДанныеЗаполнения)

	ДанныеЗаполнения.Вставить("ПлатежнаяСсылкаСБП", ДанныеЗаполнения.ПлатежнаяСсылка);
	ДанныеЗаполнения.Вставить("ИдентификаторОперацииСБП", ДанныеЗаполнения.ИдентификаторОперации);
	ДанныеЗаполнения.Вставить("ИдентификаторПлатежа", ДанныеЗаполнения.ИдентификаторПлатежа);
	
	ДанныеЗаполнения.Вставить("СуммаДокумента", ДанныеЗаполнения.СуммаОплаты);
	ДанныеЗаполнения.Вставить("Валюта", ДенежныеСредстваСерверЛокализация.ПолучитьВалютуПоНомеруСчета(ДанныеЗаполнения.СчетПолучателя));
	
	ДанныеЗаполнения.Вставить("БанковскийСчет", ДанныеЗаполнения.БанковскийСчет);
	ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", Объект.ХозяйственнаяОперация);
	ДанныеЗаполнения.Вставить("ОрганизацияПолучатель", Справочники.Организации.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("БанковскийСчетКонтрагента", Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("Партнер", Справочники.Партнеры.ПустаяСсылка());
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения.ХозяйственнаяОперация) Тогда
		ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	КонецЕсли;
	
	СтатьяДвиженияДенежныхСредств =
		Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(ДанныеЗаполнения.ХозяйственнаяОперация);
	ДанныеЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств", СтатьяДвиженияДенежныхСредств);
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения.Получатель) Тогда
		
		Объект.РасшифровкаПлатежа.Очистить();
		Шаблон = НСтр("ru = 'Не найден получатель с ИНН %1 и номером счета %2.'");
		ТестСообщения = СтрШаблон(Шаблон, ДанныеЗаполнения.ИНН, ДанныеЗаполнения.СчетПолучателя);
		ОбщегоНазначения.СообщитьПользователю(ТестСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения.Получатель) = Тип("СправочникСсылка.Организации") Тогда
		ДанныеЗаполнения.Вставить("ОрганизацияПолучатель", ДанныеЗаполнения.Получатель);
	Иначе
		ДанныеЗаполнения.Вставить("Контрагент", ДанныеЗаполнения.Получатель);
		ДанныеЗаполнения.Вставить("БанковскийСчетКонтрагента", ДанныеЗаполнения.БанковскийСчетПолучатель);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.ОрганизацияПолучатель) Тогда
		
		МассивВзаимосвязанныхОрганизаций = Справочники.Организации.МассивВзаимосвязанныхОрганизаций(ДанныеЗаполнения.Организация);
		
		Если МассивВзаимосвязанныхОрганизаций.Найти(ДанныеЗаполнения.ОрганизацияПолучатель) <> Неопределено Тогда
			ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств);
		Иначе
			ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию);
		КонецЕсли;
		
	КонецЕсли;
	
	Партнер = ДенежныеСредстваСервер.ПолучитьПартнераПоКонтрагенту(ДанныеЗаполнения.Получатель, ДанныеЗаполнения.ХозяйственнаяОперация);
	ДанныеЗаполнения.Вставить("Партнер", Партнер);
	
	ЗаполнитьРасшифровкуПлатежаПоПлатежнойСсылке(Объект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ЗаполнитьРасшифровкуПлатежаПоПлатежнойСсылке(Объект, ДанныеЗаполнения)

	ДокументПлатежнойСсылки = Неопределено;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПлатежнаяСсылка", ДанныеЗаполнения.ПлатежнаяСсылка);
	Выборка = РегистрыСведений.ВходящиеПлатежныеСсылкиСБП.Выбрать(Отбор);
	
	Если Выборка.Следующий() Тогда
		
		ДокументПлатежнойСсылки = Выборка.ДокументОперации;
		РеквизитыДокумента = Новый Соответствие;
		РеквизитыДокумента.Вставить("ПорядокРасчетов", "ПорядокРасчетов");
		РеквизитыДокумента.Вставить("Договор", "Договор");
		ДанныеДокументаПлатежнойСсылки = ДенежныеСредстваСервер.ДанныеДокумента(
			Выборка.ДокументОперации, Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком, РеквизитыДокумента);
		
	КонецЕсли;
	
	РеквизитыОперации = Новый Массив;
	Объект.ХозяйственнаяОперация = ДанныеЗаполнения.ХозяйственнаяОперация;
	Документы.ЗаявкаНаРасходованиеДенежныхСредств.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
		Объект, Неопределено, РеквизитыОперации);
	
	Объект.РасшифровкаПлатежа.Очистить();
	
	Если РеквизитыОперации.Найти("РасшифровкаПлатежа") <> Неопределено Тогда
		
		Если ДокументПлатежнойСсылки <> Неопределено Тогда
			
			Если ДанныеДокументаПлатежнойСсылки.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов 
				Или ДанныеДокументаПлатежнойСсылки.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным Тогда
				
				СтрокаРасшифровки = ДобавитьСтрокуРасшифровкиПлатежаПоШапке(Объект.РасшифровкаПлатежа, ДанныеЗаполнения);
				СтрокаРасшифровки.Сумма = ДанныеЗаполнения.СуммаДокумента;
				СтрокаРасшифровки.ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(ДанныеДокументаПлатежнойСсылки.Договор);
				ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					ДанныеДокументаПлатежнойСсылки.Договор, "СтатьяДвиженияДенежныхСредств, ВалютаВзаиморасчетов, Партнер");
				
				СтрокаРасшифровки.Партнер = ДанныеДоговора.Партнер;
				СтрокаРасшифровки.ВалютаВзаиморасчетов = ДанныеДоговора.ВалютаВзаиморасчетов;
				
				Если ЗначениеЗаполнено(ДанныеДоговора.СтатьяДвиженияДенежныхСредств) Тогда
					СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств = ДанныеДоговора.СтатьяДвиженияДенежныхСредств;
				КонецЕсли;
				
				РаботаСКурсамиВалютУТ.ЗаполнитьКурсДокументаПоУмолчанию(
					СтрокаРасшифровки.КурсЧислительВзаиморасчетов,
					СтрокаРасшифровки.КурсЗнаменательВзаиморасчетов,
					ДанныеЗаполнения.Валюта,
					СтрокаРасшифровки.ВалютаВзаиморасчетов,
					ДанныеЗаполнения.Организация,
					Объект.Дата);
				
			Иначе
				
				ВзаиморасчетыЗаполнениеРасшифровкиПлатежа.ЗаполнитьРасшифровкуПлатежаПоЗаказуПоставщику(
					ДокументПлатежнойСсылки,
					ДанныеДокументаПлатежнойСсылки.Договор,
					ДанныеЗаполнения.Валюта,
					ДанныеЗаполнения.СуммаДокумента,
					Объект.РасшифровкаПлатежа,
					?(ЗначениеЗаполнено(Объект.ЖелательнаяДатаПлатежа), Неопределено, Объект.ЖелательнаяДатаПлатежа));
				Возврат;
				
			КонецЕсли;
			
		Иначе
			
			Реквизиты = Новый Структура;
			Реквизиты.Вставить("Дата", ТекущаяДатаСеанса());
			Реквизиты.Вставить("Организация", ДанныеЗаполнения.Организация);
			Реквизиты.Вставить("Валюта", ДанныеЗаполнения.Валюта);
			Реквизиты.Вставить("ТипРасчетов", Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
			Реквизиты.Вставить("ХозяйственнаяОперация", ДанныеЗаполнения.ХозяйственнаяОперация);
			Реквизиты.Вставить("ПартнерПрочиеОтношения", Ложь);
			Реквизиты.Вставить("ПодборДебиторскойЗадолженности", Ложь);
			Реквизиты.Вставить("ПодборТолькоБезусловнойЗадолженности", Ложь);
			Реквизиты.Вставить("ПодборВОплатуПоЗаявкам", Ложь);
			Реквизиты.Вставить("СуммаДокумента", ДанныеЗаполнения.СуммаДокумента);
			Реквизиты.Вставить("ПоДатамПлатежей", Истина);
			Реквизиты.Вставить("НаДатуВозникновения", ТекущаяДатаСеанса());
			Реквизиты.Вставить("Контрагент", ДанныеЗаполнения.Получатель);
			
			Если ТипЗнч(ДанныеЗаполнения.Получатель) = Тип("СправочникСсылка.Организации") Тогда
				Реквизиты.Вставить("Партнер", Справочники.Партнеры.НашеПредприятие);
			Иначе
				Реквизиты.Вставить("Партнер", ДанныеЗаполнения.Партнер);
			КонецЕсли;
			

			АдресПлатежейВХранилище = "";
			ТаблицаОстатковРасчетов = Неопределено;
			
			ВзаиморасчетыСервер.ЗаполнитьТаблицуОстатковРасчетов(Реквизиты, АдресПлатежейВХранилище, ТаблицаОстатковРасчетов);
			РаспределяемаяСумма = ДанныеЗаполнения.СуммаДокумента;
			
			Для Каждого СтрокаТаблицы Из ТаблицаОстатковРасчетов Цикл
				
				СтрокаРасшифровки = Объект.РасшифровкаПлатежа.Добавить();
				СуммаСтроки = Мин(РаспределяемаяСумма, СтрокаТаблицы.Сумма);
				РаспределяемаяСумма = РаспределяемаяСумма - СтрокаТаблицы.Сумма;
				
				ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаТаблицы, , "Сумма");
				СтрокаРасшифровки.Сумма = СуммаСтроки;
				
				РаботаСКурсамиВалютУТ.ЗаполнитьКурсДокументаПоУмолчанию(
					СтрокаРасшифровки.КурсЧислительВзаиморасчетов,
					СтрокаРасшифровки.КурсЗнаменательВзаиморасчетов,
					ДанныеЗаполнения.Валюта,
					СтрокаРасшифровки.ВалютаВзаиморасчетов,
					ДанныеЗаполнения.Организация,
					Объект.Дата, ,
					СтрокаРасшифровки.ОбъектРасчетов);
				
				Если РаспределяемаяСумма <= 0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если РаспределяемаяСумма > 0 Тогда
				
				СтрокаРасшифровки = ДобавитьСтрокуРасшифровкиПлатежаПоШапке(Объект.РасшифровкаПлатежа, ДанныеЗаполнения);
				СтрокаРасшифровки.Сумма = РаспределяемаяСумма;
				РаботаСКурсамиВалютУТ.ЗаполнитьКурсДокументаПоУмолчанию(
					СтрокаРасшифровки.КурсЧислительВзаиморасчетов,
					СтрокаРасшифровки.КурсЗнаменательВзаиморасчетов,
					ДанныеЗаполнения.Валюта,
					СтрокаРасшифровки.ВалютаВзаиморасчетов,
					ДанныеЗаполнения.Организация,
					Объект.Дата);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДенежныеСредстваСервер.ЗаполнитьНДСВРасшифровке(
			Объект.РасшифровкаПлатежа,
			ДенежныеСредстваСервер.РасшифровкаПлатежаНДС(
				ДанныеЗаполнения.Организация,
				ТекущаяДатаСеанса(),
				ДанныеЗаполнения.Валюта,
				Объект.РасшифровкаПлатежа.ВыгрузитьКолонку("ОбъектРасчетов"), Ложь));
		
	КонецЕсли;

КонецПроцедуры

Функция ДобавитьСтрокуРасшифровкиПлатежаПоШапке(РасшифровкаПлатежа, ДанныеЗаполнения)

	СтрокаРасшифровки = РасшифровкаПлатежа.Добавить();
	СтрокаРасшифровки.Партнер = ДанныеЗаполнения.Партнер;
	СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств = ДанныеЗаполнения.СтатьяДвиженияДенежныхСредств;
	СтрокаРасшифровки.ВалютаВзаиморасчетов = ДанныеЗаполнения.Валюта;
	СтрокаРасшифровки.Организация = ДанныеЗаполнения.Организация;
	
	Возврат СтрокаРасшифровки;

КонецФункции

//-- Локализация
#КонецОбласти

#КонецОбласти
