#Область ПрограммныйИнтерфейс

Процедура ВыполнитьПодключаемуюКоманду(Команда, Форма, Источник) Экспорт
	
	Если Команда.Имя = "КонтурЛогистика_ДекорацияКонтурЕще" Или Команда.Имя = "КонтурЛогистика_ДекорацияКонтурОформить" Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		
		ОповещениеОСкрытииПанели = Новый ОписаниеОповещения("ОповещениеОСкрытииПанели",
			КонтурЛогистика_ИнтеграцияТиповыеКлиент, ДополнительныеПараметры);
		
		ДополнительныеПараметры.Вставить("ОповещениеОСкрытииПанели", ОповещениеОСкрытииПанели);
		
		ЗначенияВыбора = ЗначенияВыбораМеню(Команда.Имя, Форма, ДополнительныеПараметры);
		
		Если ЗначенияВыбора.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ОповещениеОЗакрытие = Новый ОписаниеОповещения("ОбработатьРезультатВыбораТипаДокумента",
			КонтурЛогистика_ИнтеграцияТиповыеКлиент, ДополнительныеПараметры);
		
		Форма.ПоказатьВыборИзМеню(ОповещениеОЗакрытие, ЗначенияВыбора);
		
	ИначеЕсли Лев(Команда.Имя, 22) = "КонтурЛогистика_Ввести" Тогда
		
		НомерТитула = Прав(Команда.Имя, 1);
		
		Если Найти(Команда.Имя, "_ЗЗ_") <> 0 Тогда
			ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул" + НомерТитула);
			ТипГлавногоЛогистика = Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1");
		ИначеЕсли Найти(Команда.Имя, "_ТрН_") <> 0 Тогда
			ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул" + НомерТитула);
			ТипГлавногоЛогистика = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная");
		ИначеЕсли Найти(Команда.Имя, "_ПЛ_") <> 0 Тогда
			ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул" + НомерТитула);
			ТипГлавногоЛогистика = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1");
		Иначе
			Возврат;
		КонецЕсли;
		
		НастройкаТитулаПЛ = КонтурЛогистика_ИнтеграцияТиповыеСервер.ПолучитьНастройкуКонвертации(ТипЛогистика);
		Если НастройкаТитулаПЛ = Неопределено Тогда
			ОткрытьНастройкуКонвертации(Форма, ТипЛогистика);
		Иначе
			ОформитьТитулПоГлавному(Форма, ТипЛогистика, ТипГлавногоЛогистика);
		КонецЕсли;
		
		ИмяЭлементаВыполнения = "ДекорацияКонтурВвести" + КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьИмяСсылкиПоТипуЛогистики(ТипЛогистика);
		Форма.Элементы[ИмяЭлементаВыполнения].Видимость = Ложь;
		
	ИначеЕсли Команда.Имя = "КонтурЛогистика_ДекорацияКонтурНастроитьВводЛогинаПароля"
		Или Команда.Имя = "КонтурЛогистика_ДекорацияКонтурНастроитьФункциональность" Тогда
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("НачальнаяСтраница", СтрЗаменить(Команда.Имя, "КонтурЛогистика_ДекорацияКонтурНастроить", ""));
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Обработка.КонтурЛогистика_СтартовыйПомощник.Форма.Форма",
			ПараметрыОткрытияФормы, Форма, Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповещениеОСкрытииПанели(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Элементы["ГруппаКонтурЛогистика"].Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначенияВыбораМеню(ИмяКоманды, Форма, ДополнительныеПараметры)
	
	ЗначенияВыбора = Новый СписокЗначений();
	
	Если ИмяКоманды = "КонтурЛогистика_ДекорацияКонтурЕще" Тогда
		
		Если Форма.КонтурЛогистика_ВведенныеДокументы.Количество() <> 0 Тогда
			ЗначенияВыбора.Добавить("СписокДокументов", "Список документов",, БиблиотекаКартинок.ПоказатьВСписке);
			ЗначенияВыбора.Добавить("Обновить", "Обновить",, БиблиотекаКартинок.КонтурЛогистика_Повторить);
			
			Если Форма.КонтурЛогистика_ИспользуетсяЗаказЗаявка Тогда
				ЗначенияВыбора.Добавить("ОформитьЗЗ", "Создать Заказ (заявку)");
			КонецЕсли;
			
			Если Форма.КонтурЛогистика_ИспользуетсяТРН Тогда
				ЗначенияВыбора.Добавить("ОформитьЭТрН", "Создать ЭТрН");
			КонецЕсли;
			
			Если Форма.КонтурЛогистика_ИспользуетсяПутевойЛист Тогда
				ЗначенияВыбора.Добавить("ОформитьПутевойЛист", "Создать Путевой лист");
			КонецЕсли;
		КонецЕсли;
		
		Если Форма.КонтурЛогистика_ОтображатьОтключениеОтображениеПанели Тогда
			ЗначенияВыбора.Добавить("ОтключитьОтображениеПанели", "Отключить отображение панели",,
				БиблиотекаКартинок.КонтурЛогистика_Скрыть);
		КонецЕсли;
		
	Иначе
		
		// Если явно настроен только 1 тип документа - то при клике на оформить не делать подменю, а сразу ввести этот документ
		ОбноввитьНаличиеНастроекТитулов(Форма);
		Если (Форма.КонтурЛогистика_ЕстьНастройкаТитулаЭТрН
			+ Форма.КонтурЛогистика_ЕстьНастройкаТитулаПЛ
			+ Форма.КонтурЛогистика_ЕстьНастройкаТитулаЗЗ) = 1 Тогда
			
			Если Форма.КонтурЛогистика_ЕстьНастройкаТитулаЗЗ Тогда
				КодКоманды = "ОформитьЗЗ";
			ИначеЕсли Форма.КонтурЛогистика_ЕстьНастройкаТитулаЭТрН Тогда
				КодКоманды = "ОформитьЭТрН";
			ИначеЕсли Форма.КонтурЛогистика_ЕстьНастройкаТитулаПЛ Тогда
				КодКоманды = "ОформитьПутевойЛист";
			КонецЕсли;
			
			Результат = Новый Структура("Значение", КодКоманды);
			ОбработатьРезультатВыбораТипаДокумента(Результат, ДополнительныеПараметры);
			Возврат ЗначенияВыбора;
		КонецЕсли;
		
		// Если не настроен ни один, то выводим все включенные
		Если (Форма.КонтурЛогистика_ЕстьНастройкаТитулаЭТрН
			+ Форма.КонтурЛогистика_ЕстьНастройкаТитулаПЛ
			+ Форма.КонтурЛогистика_ЕстьНастройкаТитулаЗЗ) = 0 Тогда
			
			Если Форма.КонтурЛогистика_ИспользуетсяЗаказЗаявка Тогда
				ЗначенияВыбора.Добавить("ОформитьЗЗ", "Заказ (заявку)");
			КонецЕсли;
			
			Если Форма.КонтурЛогистика_ИспользуетсяТРН Тогда
				ЗначенияВыбора.Добавить("ОформитьЭТрН", "Электронную транспортную накладную");
			КонецЕсли;
			
			Если Форма.КонтурЛогистика_ИспользуетсяПутевойЛист Тогда
				ЗначенияВыбора.Добавить("ОформитьПутевойЛист", "Путевой лист");
			КонецЕсли;
		Иначе
			Если Форма.КонтурЛогистика_ИспользуетсяЗаказЗаявка И Форма.КонтурЛогистика_ЕстьНастройкаТитулаЗЗ Тогда
				ЗначенияВыбора.Добавить("ОформитьЗЗ", "Заказ (заявку)");
			КонецЕсли;
			
			Если Форма.КонтурЛогистика_ИспользуетсяТРН И Форма.КонтурЛогистика_ЕстьНастройкаТитулаЭТрН Тогда
				ЗначенияВыбора.Добавить("ОформитьЭТрН", "Электронную транспортную накладную");
			КонецЕсли;
			
			Если Форма.КонтурЛогистика_ИспользуетсяПутевойЛист И Форма.КонтурЛогистика_ЕстьНастройкаТитулаПЛ Тогда
				ЗначенияВыбора.Добавить("ОформитьПутевойЛист", "Путевой лист");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗначенияВыбора;
	
КонецФункции

Процедура ОбноввитьНаличиеНастроекТитулов(Форма)
	
	ТипДокумента = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1");
	НастройкаТитулаЗЗ = КонтурЛогистика_ИнтеграцияТиповыеСервер.ПолучитьНастройкуКонвертации(ТипДокумента, Форма.Объект.Ссылка);
	Форма.КонтурЛогистика_ЕстьНастройкаТитулаЗЗ = (НастройкаТитулаЗЗ <> Неопределено);
	
	ТипДокумента = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1");
	НастройкаТитулаЭТрН = КонтурЛогистика_ИнтеграцияТиповыеСервер.ПолучитьНастройкуКонвертации(ТипДокумента, Форма.Объект.Ссылка);
	Форма.КонтурЛогистика_ЕстьНастройкаТитулаЭТрН = (НастройкаТитулаЭТрН <> Неопределено);
	
	ТипДокумента = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1");
	НастройкаТитулаПЛ = КонтурЛогистика_ИнтеграцияТиповыеСервер.ПолучитьНастройкуКонвертации(ТипДокумента, Форма.Объект.Ссылка);
	Форма.КонтурЛогистика_ЕстьНастройкаТитулаПЛ = (НастройкаТитулаПЛ <> Неопределено);
	
КонецПроцедуры

Процедура ОбработатьРезультатВыбораТипаДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если Результат.Значение = "СписокДокументов" Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("СписокДокументов", Форма["КонтурЛогистика_ВведенныеДокументы"].ВыгрузитьЗначения());
		
		ОткрытьФорму("ОбщаяФорма.КонтурЛогистика_СписокДокументов", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Результат.Значение = "Обновить" Тогда
		
		ОбновитьДанныеПанели(Форма);
		
	ИначеЕсли Результат.Значение = "ОформитьЗЗ" Тогда
		
		ТипДокумента = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1");
		НастройкаТитулаЗЗ = КонтурЛогистика_ИнтеграцияТиповыеСервер.ПолучитьНастройкуКонвертации(ТипДокумента, Форма.Объект.Ссылка);
		
		Если НастройкаТитулаЗЗ = Неопределено Тогда
			ОткрытьНастройкуКонвертации(Форма, ТипДокумента);
		Иначе
			ОформитьДокумент(Форма, ТипДокумента);
		КонецЕсли;
		
	ИначеЕсли Результат.Значение = "ОформитьЭТрН" Тогда
		
		ТипДокумента = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1");
		НастройкаТитулаЭТрН = КонтурЛогистика_ИнтеграцияТиповыеСервер.ПолучитьНастройкуКонвертации(ТипДокумента, Форма.Объект.Ссылка);
		
		Если НастройкаТитулаЭТрН = Неопределено Тогда
			ОткрытьНастройкуКонвертации(Форма, ТипДокумента);
		Иначе
			ОформитьДокумент(Форма, ТипДокумента);
		КонецЕсли;
		
	ИначеЕсли Результат.Значение = "ОформитьПутевойЛист" Тогда
		
		ТипДокумента = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1");
		НастройкаТитулаПЛ = КонтурЛогистика_ИнтеграцияТиповыеСервер.ПолучитьНастройкуКонвертации(ТипДокумента, Форма.Объект.Ссылка);
		
		Если НастройкаТитулаПЛ = Неопределено Тогда
			ОткрытьНастройкуКонвертации(Форма, ТипДокумента);
		Иначе
			ОформитьДокумент(Форма, ТипДокумента);
		КонецЕсли;
		
	ИначеЕсли Результат.Значение = "ОтключитьОтображениеПанели" Тогда
		
		ТекстВопроса = "Отключить отображение панели Контур в текущем типе документов?
			|Обратно включить видимость можно в настройках.";
		КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,
			"Отключить отображение панели",, КонтурЛогистика_ИнтеграцияТиповыеКлиент,
			"ОтключитьОтображениеПанелиЗавершение", ДополнительныеПараметры);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтключитьОтображениеПанелиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	ИмяНастройки = КонтурЛогистика_ИнтеграцияТиповыеСервер.ИмяНастройкиОтображенияПанелиПоИмениФормы(Форма.ИмяФормы);
	
	Если ИмяНастройки = "" Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		КонтурЛогистика_ОбщегоНазначенияСервер.УстановитьНастройку(ИмяНастройки, Ложь);
		ОбновитьПовторноИспользуемыеЗначения();
	Исключение
		// Не требуется
	КонецПопытки;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОСкрытииПанели);
	
КонецПроцедуры

Процедура ОформитьДокумент(Форма, ТипЛогистика)
	
	Если Форма.Объект.Ссылка.Пустая() Тогда
		ТекстПредупреждения = "Документ еще не записан. Ввод ЭПД возможен только на основании записанных документов.";
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура("ДокументОснование, ТипЛогистика", Форма.Объект.Ссылка, ТипЛогистика);
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Документ." + КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоТипуЛогистика(ТипЛогистика) + ".ФормаОбъекта",
		ПараметрыФормы,, КонтурЛогистика_ИнтеграцияТиповыеКлиент, "ОформитьДокументЗавершение", Форма);
	
КонецПроцедуры

Процедура ОформитьТитулПоГлавному(Форма, ТипЛогистика, ТипГлавногоЛогистика)
	
	ГлавныйДокумент = Неопределено;
	Для Каждого ВведенныйДокумент Из Форма["КонтурЛогистика_ВведенныеДокументы"] Цикл
		Если ТипЗнч(ВведенныйДокумент.Значение) = ТипГлавногоЛогистика Тогда
			ГлавныйДокумент = ВведенныйДокумент.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если ГлавныйДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущийТипДокумента = КонтурЛогистика_ОбщегоНазначенияСервер.ПредыдущийТипДокумента(ТипЛогистика);
	ПредыдущийТитул = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(ПредыдущийТипДокумента, ГлавныйДокумент);
	
	ДопПараметрыДействия = Новый Структура;
	
	КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаИзПредыдущегоТитула(
		ТипЛогистика, ПредыдущийТитул, Форма, ДопПараметрыДействия);
	
КонецПроцедуры

Процедура ОформитьДокументЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры;
	
	ОбновитьДанныеПанели(Форма);
	
КонецПроцедуры

Процедура ОткрытьНастройкуКонвертации(Форма, ТипДокумента)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТипДокументаЛогистика", ТипДокумента);
	
	Попытка
		ТипДокумента1С = КонтурЛогистика_ОбщегоНазначенияСервер.ТипДокументаСтрокойПотипуДокумента(ТипЗнч(Форма.Объект.Ссылка));
		ПараметрыОткрытия.Вставить("ТипДокумента1С", ТипДокумента1С);
	Исключение
		// Не требуется
	КонецПопытки;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.Форма.ФормаЭлемента",
		ПараметрыОткрытия, Форма,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОбновитьДанныеПанели(Форма)
	
	// Обновляем данные формы
	ВведенныеДокументы = КонтурЛогистика_ИнтеграцияТиповыеСервер.ВведенныеДокументы(Форма.Объект.Ссылка);
	
	ЕстьДокумент1 = ЗначениеЗаполнено(ВведенныеДокументы.Документ1.Ссылка);
	Если ЕстьДокумент1 Тогда
		
		ДекорацияКонтурДокумент1 = Форма.Элементы.Найти("ДекорацияКонтурДокумент1");
		
		Если ДекорацияКонтурДокумент1 <> Неопределено Тогда
			ДекорацияКонтурДокумент1.Видимость = Истина;
			ДекорацияКонтурДокумент1.Заголовок = КонтурЛогистика_ИнтеграцияТиповыеСервер.ПредставлениеДокумента(ВведенныеДокументы.Документ1);
		КонецЕсли;
		
	КонецЕсли;
	
	ЕстьДокумент2 = ЗначениеЗаполнено(ВведенныеДокументы.Документ2.Ссылка);
	Если ЕстьДокумент2 Тогда
		
		ДекорацияКонтурДокумент2 = Форма.Элементы.Найти("ДекорацияКонтурДокумент2");
		
		Если ДекорацияКонтурДокумент2 <> Неопределено Тогда
			ДекорацияКонтурДокумент2.Видимость = Истина;
			ДекорацияКонтурДокумент2.Заголовок = КонтурЛогистика_ИнтеграцияТиповыеСервер.ПредставлениеДокумента(ВведенныеДокументы.Документ2);
		КонецЕсли;
		
	КонецЕсли;
	
	ДекорацияКонтурОформить = Форма.Элементы.Найти("ДекорацияКонтурОформить");
	Если ДекорацияКонтурОформить <> Неопределено И (ЕстьДокумент1 Или ЕстьДокумент2) Тогда
		ДекорацияКонтурОформить.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти