&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресНастроек", АдресНастроек);
	Параметры.Свойство("ТекстовоеПредставлениеНастроек", ТекстовоеПредставлениеНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Телефон) Тогда
		ИдетПроверкаТелефонаВТелеграм = Истина;
		ПодключитьОбработчикОжидания("ПроверитьРегистрациюТелеграм", 0.1, Истина);
	КонецЕсли;
	
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	
	ПроверитьРегистрациюТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРегистрациюТелеграм()
	
	ТелефонЗарегестрированВТелеграм = ПроверитьРегистрациюТелеграмНаСервере(Телефон);
	ИдетПроверкаТелефонаВТелеграм = Ложь;
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьРегистрациюТелеграмНаСервере(Телефон)
	
	Попытка
		ТелефонЗарегестрированВТелеграм = КонтурЛогистика_РаботаСТелеграм.ТелефонЗарегестрирован(Телефон);
	Исключение
		ТелефонЗарегестрированВТелеграм = Ложь;
	КонецПопытки;
	
	Возврат ТелефонЗарегестрированВТелеграм;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьГруппыТелеграм()
	
	Если ЗначениеЗаполнено(Телефон) Тогда
		Элементы.ГруппаТелеграм.Видимость = Истина;
		
		Элементы.ДекорацияИдетПроверкаТелеграм.Видимость = Ложь;
		Элементы.ДекорацияРезультатУспехТелеграм.Видимость = Ложь;
		Элементы.ДекорацияПодключитьТелеграм.Видимость = Ложь;
		
		Если ИдетПроверкаТелефонаВТелеграм Тогда
			Элементы.ДекорацияИдетПроверкаТелеграм.Видимость = Истина;
		ИначеЕсли ТелефонЗарегестрированВТелеграм Тогда
			Элементы.ДекорацияРезультатУспехТелеграм.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПодключитьТелеграм.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ГруппаТелеграм.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Отправить.Доступность = ТелефонЗарегестрированВТелеграм;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодключитьТелеграмНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_QRКодБотаКаналаТелеграм",,
		ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Результат = ОтправитьНаСервере();
	
	Если Результат.Успешно Тогда
		Закрыть("Ок");
	Иначе
		ТекстОшибок = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(Результат.МассивОшибок, Символы.ПС); 
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(ТекстОшибок);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтправитьНаСервере()
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Истина);
	Результат.Вставить("МассивОшибок", Новый Массив);
	
	тзДвоичныхДанныхКОтправке = Новый ТаблицаЗначений;
	тзДвоичныхДанныхКОтправке.Колонки.Добавить("ДвоичныеДанные");
	тзДвоичныхДанныхКОтправке.Колонки.Добавить("ИмяФайла");
	
	// Настройки
	
	ДвоичныеДанныеНастроек = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	НоваяСтрока = тзДвоичныхДанныхКОтправке.Добавить();
	НоваяСтрока.ДвоичныеДанные = ДвоичныеДанныеНастроек;
	НоваяСтрока.ИмяФайла = ИмяФайлаНастроек();
	
	// Настройки Markdown
	
	ПотокДанных = Новый ПотокВПамяти();
	ЗаписьТекста = Новый ЗаписьТекста(ПотокДанных);
	ЗаписьТекста.Записать(ТекстовоеПредставлениеНастроек);
	ЗаписьТекста.Закрыть();
	ДвоичныеДанныеНастроекMarkdown = ПотокДанных.ЗакрытьИПолучитьДвоичныеДанные();
	
	НоваяСтрока = тзДвоичныхДанныхКОтправке.Добавить();
	НоваяСтрока.ДвоичныеДанные = ДвоичныеДанныеНастроекMarkdown;
	НоваяСтрока.ИмяФайла = ИмяФайлаНастроекMarkdown();
	
	Для каждого ДвоичныеДанныеКОтправке Из тзДвоичныхДанныхКОтправке Цикл
	
		Сообщения = Новый Массив;	
		НовоеСообщение = КонтурЛогистика_РаботаСТелеграм.МанифестСообщения();
		НовоеСообщение.Тип = "document";
		НовоеСообщение.ИмяФайла = ДвоичныеДанныеКОтправке.ИмяФайла;
		НовоеСообщение.Данные = ДвоичныеДанныеКОтправке.ДвоичныеДанные;
		Сообщения.Добавить(НовоеСообщение);
		
		РезультатОтправки = КонтурЛогистика_РаботаСТелеграм.ОтправитьСообщения(Телефон, Сообщения);
		Если РезультатОтправки.ЕстьОшибки Тогда
			Результат.Вставить("Успешно", Ложь);
			ТекстОшибки = "Ошибка отправки файла " + ДвоичныеДанныеКОтправке.ИмяФайла + ": " + РезультатОтправки.ТекстОшибки;
			Результат.МассивОшибок.Добавить(ТекстОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИмяФайлаНастроек()
	
	ИмяФайла = "Настройки";
	
	ЗаполнитьИмяФайлаОсновнымиДанными(ИмяФайла);
	
	ИмяФайла = ИмяФайла + ".json";

	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УбратьНедопустимыеСимволыФС(ИмяФайла);
	 
КонецФункции

&НаСервере
Функция ИмяФайлаНастроекMarkdown()
	
	ИмяФайла = "Markdown настройки";
	
	ЗаполнитьИмяФайлаОсновнымиДанными(ИмяФайла);
	
	ИмяФайла = ИмяФайла + ".txt";
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УбратьНедопустимыеСимволыФС(ИмяФайла);
	 
КонецФункции

&НаСервере
Процедура ЗаполнитьИмяФайлаОсновнымиДанными(ИмяФайла)
	
	НашаОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЛюбаяНашаОрганизация();
	Если ЗначениеЗаполнено(НашаОрганизация) Тогда
		ИмяФайла = ИмяФайла + " " + СокрЛП(НашаОрганизация.Наименование);		
	КонецЕсли;
	
	СлужебныйИдентификаторБазыДанных = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("СлужебныйИдентификаторБазыДанных");
	Если ЗначениеЗаполнено(СлужебныйИдентификаторБазыДанных) Тогда
		ИмяФайла = ИмяФайла + " " + СокрЛП(СлужебныйИдентификаторБазыДанных);		
	КонецЕсли;
		 
КонецПроцедуры




