&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии()
	
	ОбновитьТаблицуПроизвольныхОтборовДокументов(ID_ПроизвольногоОтбора);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПанельДействийФормы

&НаКлиенте
Процедура ОсновныеДействияСохранитьВФайл(Кнопка)
	
	СтруктураНастройки = Новый Структура;
	МассивДляСохранения = _ЛокКонтекст.ЛокЯдро_ТаблицуЗначенийВМассивСтруктур(ПолучитьАдресТаблицы());
	СтруктураНастройки.Вставить("ТаблицаПроизвольныхОтборовДокументов", МассивДляСохранения);
	СтруктураНастройки.Вставить("ВерсияОбработкиНастроек",_ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ВерсияОбработкиНастроек"));
	
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкиВФайл(СтруктураНастройки, "ПроизвольныеОтборыДокументов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияЗагрузитьИзФайла(Кнопка)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтаФорма);
	
	_ЛокКонтекст.ЛокЯдро_ПолучитьНастройкиИзФайла("ПроизвольныеОтборыДокументов", ОповещениеОЗавершении);
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМеханизмы

&НаСервере
Функция ПолучитьАдресТаблицы()
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат ПоместитьВоВременноеХранилище(ТаблицаПроизвольныхОтборовДокументов,Новый УникальныйИдентификатор());
	#Иначе
		ТЗ = РеквизитФормыВЗначение("ТаблицаПроизвольныхОтборовДокументов");
		Возврат ПоместитьВоВременноеХранилище(ТЗ,ЭтаФорма.УникальныйИдентификатор);
	#КонецЕсли
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуРедактированияНастройки(ЭтоНоваяНастройка, ЭтоКопирование = Ложь)
	
	ТекущаяСтрока = Элементы.ТаблицаПроизвольныхОтборовДокументов.ТекущиеДанные;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаНастройки_ПроизвольныйОтборДокументов = ПолучитьФорму("ОФ_ФормаНастройки_ПроизвольныйОтборДокументов", ЭтаФорма);
	#Иначе
		ФормаНастройки_ПроизвольныйОтборДокументов = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаНастройки_ПроизвольныйОтборДокументов", , ЭтаФорма, ЭтаФорма);
		ФормаНастройки_ПроизвольныйОтборДокументов.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	#КонецЕсли
	ФормаНастройки_ПроизвольныйОтборДокументов._ЛокКонтекст = _ЛокКонтекст;
	ФормаНастройки_ПроизвольныйОтборДокументов.ЭтоНоваяНастройка = ЭтоНоваяНастройка;
	
	Если НЕ ЭтоНоваяНастройка ИЛИ ЭтоКопирование Тогда		
		ЗаполнитьЗначенияСвойств(ФормаНастройки_ПроизвольныйОтборДокументов, ТекущаяСтрока);
	КонецЕсли;
	
	ОП = Новый ОписаниеОповещения("ФормаНастройки_ПроизвольныйОтборДокументовЗакрытие",ЭтаФорма);
	ФормаНастройки_ПроизвольныйОтборДокументов.ОписаниеОповещенияОЗакрытии = ОП;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаНастройки_ПроизвольныйОтборДокументов.ОткрытьМодально();
	#Иначе
		ФормаНастройки_ПроизвольныйОтборДокументов.Открыть();	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуПроизвольныхОтборовДокументов(ID_ТекущейСтроки = "")
	
	пТаблицаПроизвольныхОтборовДокументов = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ПроизвольныеОтборыДокументов");
	ТаблицаПроизвольныхОтборовДокументов.Очистить();
	
	Если ТипЗнч(пТаблицаПроизвольныхОтборовДокументов) = Тип("Массив") Тогда
		Для каждого СтрокаТЧ Из пТаблицаПроизвольныхОтборовДокументов Цикл
			Если СтрокаТЧ.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ТаблицаПроизвольныхОтборовДокументов.Добавить(),СтрокаТЧ);
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ID_ТекущейСтроки) Тогда
		НайденнаяСтрока = ТаблицаПроизвольныхОтборовДокументов.НайтиСтроки(Новый Структура("ID_ПроизвольногоОтбора",ID_ТекущейСтроки));
		Если НайденнаяСтрока.Количество() = 0 Тогда
			НайденнаяСтрока = Неопределено;
		Иначе
			НайденнаяСтрока = НайденнаяСтрока[0];
		КонецЕсли;
		
		Если НайденнаяСтрока <> Неопределено Тогда
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Элементы.ТаблицаПроизвольныхОтборовДокументов.ТекущаяСтрока = НайденнаяСтрока;
			#Иначе
				Элементы.ТаблицаПроизвольныхОтборовДокументов.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();	
			#КонецЕсли
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки()
	
	МассивДляСохранения = _ЛокКонтекст.ЛокЯдро_ТаблицуЗначенийВМассивСтруктур(ПолучитьАдресТаблицы());
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("ПроизвольныеОтборыДокументов", МассивДляСохранения);	
	_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("ПроизвольныеОтборыДокументов", МассивДляСохранения);		

КонецПроцедуры	

&НаКлиенте
Процедура ЗакрытьФормуСВыборомЭлемента()
	
	Если Элементы.ТаблицаПроизвольныхОтборовДокументов.ТекущиеДанные <> Неопределено Тогда
		Результат = Элементы.ТаблицаПроизвольныхОтборовДокументов.ТекущиеДанные.ID_ПроизвольногоОтбора;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Если НЕ ОписаниеОповещенияОЗакрытии = Неопределено Тогда	
				ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии,Результат);
			КонецЕсли;
		#КонецЕсли
		Закрыть(Результат);
	Иначе
		Закрыть(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличногоПоля_ТаблицаПроизвольныхОтборовДокументов

&НаКлиенте
Процедура ТаблицаПроизвольныхОтборовДокументовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗакрытьФормуСВыборомЭлемента();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроизвольныхОтборовДокументовПередНачаломДобавления(Элемент, Отказ, Копирование)
	ОткрытьФормуРедактированияНастройки(Истина, Копирование);
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроизвольныхОтборовДокументовПередНачаломИзменения(Элемент, Отказ)
	ОткрытьФормуРедактированияНастройки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПроизвольныхОтборовДокументовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ТекстВопроса = НСтр("be = 'Вы сапраўды жадаеце выдаліць давольны выбар?'; en = 'Do you really want to delete the arbitrary selection?'; es = '¿Realmente desea eliminar la selección arbitraria?'; ka = 'ნამდვილად გსურთ შემთხვევითი არჩევანის წაშლა?'; kk = 'Сіз өзгертілген таңдауларды жоюға сенімдісіз бе?'; ro = 'Sunteți sigur că doriți să ștergeți selecția arbitrară?'; ru = 'Вы действительно хотите удалить произвольный отбор?'; tr = 'Rastgele seçimi gerçekten silmek istiyor musunuz?'; uk = 'Ви дійсно хочете видалити довільний відбір?'; uz = ""Siz rostdan tasodifiy tanlovni o'chirmoqchimisiz?""");
	
	ОповещениеСохранитьНастройкиВФайл = Новый ОписаниеОповещения("ВопросУдалитьНастройкуЗавершение", ЭтаФорма);
	ПоказатьВопрос(ОповещениеСохранитьНастройкиВФайл, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , , _ЛокКонтекст.ЛокЯдро_ТекстВнимание()); 
	 
КонецПроцедуры

#КонецОбласти

#Область ОписанияОповещений

&НаКлиенте
Процедура ВопросУдалитьНастройкуЗавершение(РезультатВопроса, ТекущиеДанные) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	ТаблицаПроизвольныхОтборовДокументов.Удалить(Элементы.ТаблицаПроизвольныхОтборовДокументов.ТекущаяСтрока);
	СохранитьНастройки();	
КонецПроцедуры

&НаКлиенте
Процедура ФормаНастройки_ПроизвольныйОтборДокументовЗакрытие(ID_РедактируемойНастройки,ПредыдущееЗначение) Экспорт
	
	Если ЗначениеЗаполнено(ID_РедактируемойНастройки) Тогда
		ОбновитьТаблицуПроизвольныхОтборовДокументов(ID_РедактируемойНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(СтруктураНастроек, ДополнительныеПараметры) Экспорт

	Если СтруктураНастроек <> Неопределено Тогда
		
		//Выполним обновление - Начало
		ВерсияОбработки =_ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("ВерсияОбработки");		
		Если СтруктураНастроек.Свойство("ВерсияОбработкиНастроек") Тогда
			ВерсияОбработкиНастроек = СтруктураНастроек.ВерсияОбработкиНастроек;
		Иначе
			ВерсияОбработкиНастроек = 0;		
		КонецЕсли;  
		Если ВерсияОбработки>ВерсияОбработкиНастроек Тогда
			СтруктураВызова = Новый Структура;
			СтруктураВызова.Вставить("ТипМетода", "Функция");
			СтруктураВызова.Вставить("ИмяМетода", "ВыполнитьОбновлениеНастроек");
			СтруктураВызова.Вставить("ПараметрыМетода", Новый Структура("ВерсияНастроек,СтруктураНастроек",ВерсияОбработкиНастроек,СтруктураНастроек));
			
			СтруктураНастроек = _ЛокКонтекст.Транзит_ВызватьГлобальныйМетодНаКлиенте(СтруктураВызова,,_ЛокКонтекст.АдресаПеременных);
		КонецЕсли;
		//Выполним обновление - Конец
		
		_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("ПроизвольныеОтборыДокументов", СтруктураНастроек.ТаблицаПроизвольныхОтборовДокументов);
		_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("ПроизвольныеОтборыДокументов", СтруктураНастроек.ТаблицаПроизвольныхОтборовДокументов);
		
		ОбновитьТаблицуПроизвольныхОтборовДокументов();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Если ТолстыйКлиентОбычноеПриложение Тогда
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	Объект = ЭтотОбъект;
#КонецЕсли