
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	КонтурЗакупки_ЛокализацияВызовСервера.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	НаименованиеСправочникаПользователей = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"НаименованиеСправочникаПользователей", "Пользователи");
	ЕстьСправочникПользователей = КонтурЗакупки_ЛокализацияСервер.ЕстьСправочник(НаименованиеСправочникаПользователей);
	Элементы.Ответственный.Видимость = ЕстьСправочникПользователей;
	Список.Параметры.УстановитьЗначениеПараметра("НаименованиеСправочникаПользователей", "Справочники."
		+ НаименованиеСправочникаПользователей);

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОтборПоСтатусуЗакупкиПриИзменении(Элемент)
	УстановитьОтборСписка();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	КонтурЗакупки_ЛокализацияКлиент.НачатьОбновлениеКоманд(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.СсылкаНаЗакупкуНаЭТП И Не ПустаяСтрока(Элемент.ТекущиеДанные.СсылкаНаЗакупкуНаЭТП) Тогда
		СтандартнаяОбработка = Ложь;
		НачатьЗапускПриложения(Новый ОписаниеОповещения, Элемент.ТекущиеДанные.СсылкаНаЗакупкуНаЭТП);
	ИначеЕсли Поле = Элементы.СсылкаНаЗакупкуНаКЗ И Не ПустаяСтрока(Элемент.ТекущиеДанные.СсылкаНаЗакупкуНаКЗ) Тогда
		СтандартнаяОбработка = Ложь;
		НачатьЗапускПриложения(Новый ОписаниеОповещения, Элемент.ТекущиеДанные.СсылкаНаЗакупкуНаКЗ);
	ИначеЕсли Поле = Элементы.СсылкаНаЗакупкуНаЕИС И Не ПустаяСтрока(Элемент.ТекущиеДанные.СсылкаНаЗакупкуНаЕИС) Тогда
		СтандартнаяОбработка = Ложь;
		НачатьЗапускПриложения(Новый ОписаниеОповещения, Элемент.ТекущиеДанные.СсылкаНаЗакупкуНаЕИС);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	КонтурЗакупки_ЛокализацияКлиент.НачатьВыполнениеКоманды(ЭтаФорма, Команда, Элементы.Список);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check doc-comment-parameter-section
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборСписка()
	Список.Отбор.Элементы.Очистить();

	Если ЗначениеЗаполнено(ОтборПоСтатусуЗакупки) Тогда

		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусЗакупки");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;

		ЭлементОтбора.ПравоеЗначение = ОтборПоСтатусуЗакупки;

	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	КонтурЗакупки_ЛокализацияВызовСервера.ВыполнитьКоманду(ЭтаФорма, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	КонтурЗакупки_ЛокализацияКлиентСервер.ОбновитьКоманды(ЭтаФорма, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти