
&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_Статус", "Список", , 1, "Список.АУ_Статус");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_СпособДоставки", "Список", , 1, "Список.АУ_СпособДоставки");
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_ВыполнитьПоручение", "Выполнить", "АУ_ВыполнитьПоручение");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ВыполнитьПоручение", "ФормаКоманднаяПанель", , "АУ_ВыполнитьПоручение", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ВыполнитьПоручение(Команда)
	
	АУ_ВыполнитьПоручениеСервер();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура АУ_ВыполнитьПоручениеСервер()
	
	СтрокиПоручений = Элементы.Список.ВыделенныеСтроки;
	
	Для каждого стрПоручение Из СтрокиПоручений Цикл
		
		ПоручениеОбъект = стрПоручение.ПолучитьОбъект();
		ПоручениеОбъект.АУ_Статус = Перечисления.АУ_СтатусыПорученийЭкспедиторам.Выполнено;
		ПоручениеОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Статус поручение %1 установлен в 'Выполнено'", стрПоручение), стрПоручение);
		
	КонецЦикла;
	
КонецПроцедуры