#Область ПрограммныйИнтерфейс

// Выполняет заполнение регистров взаиморасчетов в новой архитектуре по переданной структуре параметров.
//
// Параметры:
//	ОсновныеПараметры - см. ПараметрыРаспределенияРасчетов
//	ТаблицаКРаспределению - см. ТаблицаКРаспределению 
//		Распределение выполняется в цикле по строкам этой таблицы.
//
Процедура ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры, ТаблицаКРаспределению) Экспорт
	
	Если ТаблицаКРаспределению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	#Область ИнициализацияЗапросаИПеременных
	
	ЗапросДополненнойТаблицыКРаспределению = Новый Запрос;
	ЗапросДополненнойТаблицыКРаспределению.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтПараметры.ТипРасчетов КАК ТипРасчетов,
	|	ВтПараметры.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВтПараметры.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВтПараметры.Валюта КАК Валюта,
	|	ВтПараметры.ДатаНачалаПересчета КАК ДатаНачалаПересчета,
	|	ВтПараметры.ПериодКонтроляИзмененийИСозданияЗаданий КАК ПериодКонтроляИзмененийИСозданияЗаданий
	|ПОМЕСТИТЬ ВтТаблицаПараметровРаспределения
	|ИЗ
	|	&ТаблицаПараметровРаспределения КАК ВтПараметры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов,
	|	АналитикаУчетаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПараметры.ТипРасчетов КАК ТипРасчетов,
	|	ВтПараметры.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ЭтоРасчетыСКлиентами,
	|	ВтПараметры.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВтПараметры.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВтПараметры.Валюта КАК Валюта,
	|	ВЫБОР КОГДА ВтПараметры.ДатаНачалаПересчета = ДАТАВРЕМЯ(1,1,1)
	|		ТОГДА ДАТАВРЕМЯ(1,1,1,0,0,2)
	|		ИНАЧЕ ВтПараметры.ДатаНачалаПересчета
	|	КОНЕЦ КАК ДатаНачалаПересчета,
	|	ВтПараметры.ПериодКонтроляИзмененийИСозданияЗаданий КАК ПериодКонтроляИзмененийИСозданияЗаданий,
	|
	|	ЕСТЬNULL(Справочник.Объект, НЕОПРЕДЕЛЕНО) КАК Объект,
	|	ЕСТЬNULL(Справочник.Договор, КлючиАналитикиУчетаПоПартнерам.Договор) КАК Договор,
	|	ВЫБОР КОГДА ЕСТЬNULL(Справочник.Договор.ПорядокЗачетаОплатНакладных, 
	|							ЗНАЧЕНИЕ(Перечисление.ПорядкиЗачетаОплатНакладных.ПустаяСсылка)) 
	|				= ЗНАЧЕНИЕ(Перечисление.ПорядкиЗачетаОплатНакладных.ПустаяСсылка)
	|		ТОГДА КонстантаПорядокЗачетаОплатНакладных.Значение
	|		ИНАЧЕ ЕСТЬNULL(Справочник.Договор.ПорядокЗачетаОплатНакладных, ЗНАЧЕНИЕ(Перечисление.ПорядкиЗачетаОплатНакладных.ПустаяСсылка))
	|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПорядкиЗачетаОплатНакладных.ПоДатеПлановогоПогашения) КАК ЗачетОплатПоДатеПлатежа,
	|
	|	Справочник.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|		И ЕСТЬNULL(Справочник.Договор.ВариантКурсаДоговора, ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный))
	|			 = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки) КАК ФиксированныйКурсНакладной,
	|	
	|	ВЫБОР КОГДА ЕСТЬNULL(КурсыВалют.КурсЗнаменательВалютыВзаиморасчетов, 0) = 0 ИЛИ ЕСТЬNULL(КурсыВалют.КурсЧислительВалютыУправленческогоУчета, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(КурсыВалют.КурсЧислительВалютыВзаиморасчетов, 0)/ЕСТЬNULL(КурсыВалют.КурсЗнаменательВалютыВзаиморасчетов, 0)
	|	КОНЕЦ КАК ФиксированныйКурсРегл,
	|
	|	ВЫБОР КОГДА ЕСТЬNULL(КурсыВалют.КурсЗнаменательВалютыВзаиморасчетов, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(КурсыВалют.КурсЧислительВалютыВзаиморасчетов, 0)
	|				* ЕСТЬNULL(КурсыВалют.КурсЗнаменательВалютыУправленческогоУчета, 0)
	|				/ ЕСТЬNULL(КурсыВалют.КурсЗнаменательВалютыВзаиморасчетов, 0)
	|				* ЕСТЬNULL(КурсыВалют.КурсЧислительВалютыУправленческогоУчета, 0)
	|	КОНЕЦ КАК ФиксированныйКурсУпр,
	|
	|	ЕСТЬNULL(Справочник.Объект.ГрафикИсполненияДоговора, 
	|		ЗНАЧЕНИЕ(Документ.ГрафикИсполненияДоговора.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.ГрафикИсполненияДоговора.ПустаяСсылка) КАК ГрафикВДоговоре,
	|	ЕСТЬNULL(Справочник.Договор.ВариантКурсаДоговора, ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) КАК ВариантКурсаДоговора,
	|	Справочник.ТипОбъектаРасчетов КАК ТипОбъектаРасчетов,
	|	ЕСТЬNULL(Справочник.Объект.ГрафикИсполненияДоговора, НЕОПРЕДЕЛЕНО) КАК ГрафикИсполненияДоговора,
	|	КлючиАналитикиУчетаПоПартнерам.Организация КАК Организация,
	|	КлючиАналитикиУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	КлючиАналитикиУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|ИЗ
	|	ВтТаблицаПараметровРаспределения КАК ВтПараметры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК Справочник
	|		ПО ВтПараметры.ОбъектРасчетов = Справочник.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВалютыИКурсыДокументов КАК КурсыВалют
	|			ПО (Справочник.Объект = КурсыВалют.Документ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютРасчетовПоДоговорам.СрезПоследних(,) КАК КурсыВалютПоДоговору
	|			ПО (Справочник.Договор = КурсыВалютПоДоговору.Договор)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ВтПараметры.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ПорядокЗачетаОплатНакладных КАК КонстантаПорядокЗачетаОплатНакладных
	|			ПО ИСТИНА";
	
	ЗапросДополненнойТаблицыКРаспределению.УстановитьПараметр("ТаблицаПараметровРаспределения", ТаблицаКРаспределению);
	ДополненнаяТаблицаКРаспределению = ЗапросДополненнойТаблицыКРаспределению.Выполнить().Выгрузить(); 
	
	ЕстьЗаписиРасчетовСКлиентами    = ДополненнаяТаблицаКРаспределению.НайтиСтроки(Новый Структура("ЭтоРасчетыСКлиентами",Истина)).Количество() > 0;
	ЕстьЗаписиРасчетовСПоставщиками = ДополненнаяТаблицаКРаспределению.НайтиСтроки(Новый Структура("ЭтоРасчетыСКлиентами",Ложь)).Количество() > 0;
	
	ДатаНачалаПересчетаМинимальный = Дата(3999,1,1);
	Для Каждого СтрокаТаблицыКРаспределению Из ДополненнаяТаблицаКРаспределению Цикл
		ДатаНачалаПересчетаМинимальный = Мин(ДатаНачалаПересчетаМинимальный, СтрокаТаблицыКРаспределению.ДатаНачалаПересчета);
	КонецЦикла;
	
	РазмерПорцииЗаписи = РазмерПорцииЗаписи();
	ХозяйственныеОперацииНеОтгрузка = ХозяйственныеОперацииНеОтгрузка();
	ХозяйственныеОперацииПереноса = ХозяйственныеОперацииПереносаРасчетов();
	ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
	ДатаНачалаПересчетаЕстьРазличные = ОбщегоНазначенияКлиентСервер.СвернутьМассив(
		ДополненнаяТаблицаКРаспределению.ВыгрузитьКолонку("ДатаНачалаПересчета")).Количество() > 1;

	// Переменные распространяющиеся на все строки заданий к распределению
	ГлобальныеПеременные = ОбщегоНазначения.СкопироватьРекурсивно(ОсновныеПараметры);
	ГлобальныеПеременные.Вставить("ЕжедневнаяПереоценка",                               Константы.ПереоцениватьВалютныеСредстваПоДням.Получить());
	ГлобальныеПеременные.Вставить("РазмерПорцииЗаписи",                                 РазмерПорцииЗаписи);
	ГлобальныеПеременные.Вставить("ВалютаУправленческогоУчета",                         ВалютаУправленческогоУчета);
	ГлобальныеПеременные.Вставить("ЕстьЗаписиРасчетовСКлиентами",                       ЕстьЗаписиРасчетовСКлиентами);
	ГлобальныеПеременные.Вставить("ЕстьЗаписиРасчетовСПоставщиками",                    ЕстьЗаписиРасчетовСПоставщиками);
	ГлобальныеПеременные.Вставить("ДатаНачалаПересчетаЕстьРазличные",                   ДатаНачалаПересчетаЕстьРазличные);
	
	Запрос                         = Новый Запрос;
	Менеджер                       = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = Менеджер;
	Запрос.УстановитьПараметр("ВалютаУпр",                   ВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("РазмерПорцииЗаписи",          РазмерПорцииЗаписи);
	Запрос.УстановитьПараметр("СписокТиповЗаказов",          СписокТиповРегистраторовПланов());
	Запрос.УстановитьПараметр("ОперацииСРучнымКурсом",        ХозяйственныеОперацииСРучнымКурсом());
	Запрос.УстановитьПараметр("ИдентификаторНеиспользуемойФинЗаписи", ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи());
	Запрос.УстановитьПараметр("ПустыеСсылкиНаЗаказы",        ПустыеСсылкиНаЗаказы());
	Запрос.УстановитьПараметр("СписокТиповУточняющихПланы", СписокТиповУточняющихПланы());
	Запрос.УстановитьПараметр("ДатаНачалаПересчетаМинимальный", ДатаНачалаПересчетаМинимальный);
	Запрос.УстановитьПараметр("ДополненныеПараметрыРаспределения", ДополненнаяТаблицаКРаспределению);
	Запрос.УстановитьПараметр("СписокАналитикУчетаПоПартнерам", ОбщегоНазначенияКлиентСервер.СвернутьМассив(
		ДополненнаяТаблицаКРаспределению.ВыгрузитьКолонку("АналитикаУчетаПоПартнерам")));
	
	#КонецОбласти
	
	#Область ПолучениеДанныхДляВсехЗаданий
	
	// Движения до начала пересчета и остатки.
	СформироватьВТДанныхРегистров(Запрос, ГлобальныеПеременные);
	ДатаНачалаКурсов = Дата(3000,1,1);
	
	Если ГлобальныеПеременные.ЕстьЗаписиРасчетовСКлиентами Тогда
		// Данные регистров с порядком меньше порядка начала расчета и скопированные сторно записи, далее дополняются.
		ТаблицаРасчетовСКлиентамиПоСрокам      = ЗаписиДоНачалаРасчетаПоСрокам(Запрос, ГлобальныеПеременные, Истина);
		ТаблицаПланОплатКлиентам               = ЗаписиДоНачалаРасчетаПланОплат(Запрос, ГлобальныеПеременные, Истина);
		ТаблицаПланОтгрузокПоставокКлиентам    = ЗаписиДоНачалаРасчетаПланОтгрузок(Запрос, ГлобальныеПеременные, Истина);
		
		ДанныеДляРаспределенияКлиенты = ПолучитьДанныеДляРаспределения(Запрос, Истина);
		ДанныеДляРаспределенияКлиенты.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
		
		ТаблицаНакладныхКлиенты = ПолучитьДанныеНакладных(Запрос, Истина);
		
		ИсходныеРегистраторыКлиенты = Запрос.МенеджерВременныхТаблиц.Таблицы["ВтИсходныеРегистраторыКлиенты"].ПолучитьДанные().Выгрузить();
		ДвиженияИсходныхРегистраторовКлиенты = ДвиженияСторнируемыхДокументовДоНачалаРасчета(Запрос,Истина);
		ДвиженияИсходныхРегистраторовПланОплатКлиенты = ДвиженияСторнируемыхДокументовПланОплатДоНачалаРасчета(Запрос,Истина);
		ДвиженияИсходныхРегистраторовПланОтгрузокКлиенты = ДвиженияСторнируемыхДокументовПланОтгрузокДоНачалаРасчета(Запрос,Истина);
		
		ТаблицаОстатковВзаиморасчетовКлиенты = ТаблицаОстатковВзаиморасчетов(Запрос,Истина);
		
		ДатаНачалаКурсов = Мин(ДатаНачалаКурсов,
								?(ДанныеДляРаспределенияКлиенты.Количество() > 0,ДанныеДляРаспределенияКлиенты[0].Период,ТекущаяДатаСеанса()),
								?(ТаблицаОстатковВзаиморасчетовКлиенты.Количество() > 0,ТаблицаОстатковВзаиморасчетовКлиенты[0].ДатаВозникновения,ТекущаяДатаСеанса()))
		
	КонецЕсли;
	
	Если ГлобальныеПеременные.ЕстьЗаписиРасчетовСПоставщиками Тогда
		
		ТаблицаРасчетовСПоставщикамиПоСрокам     = ЗаписиДоНачалаРасчетаПоСрокам(Запрос, ГлобальныеПеременные, Ложь);
		ТаблицаПланОплатПоставщикам              = ЗаписиДоНачалаРасчетаПланОплат(Запрос, ГлобальныеПеременные, Ложь);
		ТаблицаПланОтгрузокПоставокПоставщикам   = ЗаписиДоНачалаРасчетаПланОтгрузок(Запрос, ГлобальныеПеременные, Ложь);
		
		ДанныеДляРаспределенияПоставщики = ПолучитьДанныеДляРаспределения(Запрос, Ложь);
		ДанныеДляРаспределенияПоставщики.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
		
		ТаблицаНакладныхПоставщики = ПолучитьДанныеНакладных(Запрос, Ложь);
		
		ИсходныеРегистраторыПоставщики = Запрос.МенеджерВременныхТаблиц.Таблицы["ВтИсходныеРегистраторыПоставщики"].ПолучитьДанные().Выгрузить();
		ДвиженияИсходныхРегистраторовПоставщики = ДвиженияСторнируемыхДокументовДоНачалаРасчета(Запрос, Ложь);
		ДвиженияИсходныхРегистраторовПланОплатПоставщики = ДвиженияСторнируемыхДокументовПланОплатДоНачалаРасчета(Запрос,Ложь);
		ДвиженияИсходныхРегистраторовПланОтгрузокПоставщики = ДвиженияСторнируемыхДокументовПланОтгрузокДоНачалаРасчета(Запрос,Ложь);
		
		ТаблицаОстатковВзаиморасчетовПоставщики = ТаблицаОстатковВзаиморасчетов(Запрос,Ложь);
		
		ДатаНачалаКурсов = Мин(ДатаНачалаКурсов,
								?(ДанныеДляРаспределенияПоставщики.Количество() > 0,ДанныеДляРаспределенияПоставщики[0].Период,ТекущаяДатаСеанса()),
								?(ТаблицаОстатковВзаиморасчетовПоставщики.Количество() > 0,ТаблицаОстатковВзаиморасчетовПоставщики[0].ДатаВозникновения,ТекущаяДатаСеанса()))
		
	КонецЕсли;
	
	#Область ТаблицыДляПлановыхРасчетов
		
		Если ГлобальныеПеременные.ЕстьЗаписиРасчетовСКлиентами Тогда
			
			// Остатки плановых оплат для уточнения и закрытия нераспределенными авансами.
			ОстаткиПлановыхОплатКлиенты = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТРасчетыПланОплатОстаткиКлиенты"].ПолучитьДанные().Выгрузить(); //ТаблицаЗначений
			ОстаткиПлановыхОплатКлиенты.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			// Остатки плановых отгрузок для уточнения и закрытия нераспределенными авансами.
			ОстаткиПлановыхОтгрузокКлиенты = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТРасчетыПланОтгрузокПоставокОстаткиКлиенты"].ПолучитьДанные().Выгрузить(); //ТаблицаЗначений
			ОстаткиПлановыхОтгрузокКлиенты.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			// Остатки и движения нераспределенных авансов.
			ДвиженияПредоплатыДляСуммированияКлиенты = ОстаткиНераспределенныхАвансовПлановойОплатыНаНачалоПересчета(Запрос, Истина);
			ДвиженияПредоплатыДляСуммированияКлиенты.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			ОстаткиАвансовКлиенты = ОстаткиАвансов(Запрос, Истина);
			ОстаткиАвансовКлиенты.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			ДвиженияПредоплатыДляСуммированияКлиенты.Свернуть("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта,ДатаДвижения,Регистратор,ЭтоРеализацияВПути,ПорядокОперации,Просуммировано","Сумма");
			
			//Расходные движения накладных, которые распределяются на остатки плановых графиков.
			УточненияГрафиковОплатКлиенты    = ПолучитьУточненияГрафиковОплат(Запрос, ГлобальныеПеременные, Истина);
			УточненияГрафиковОплатКлиенты.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			ЗакрытияГрафиковОтгрузокКлиенты = ПолучитьЗакрытияГрафиковОтгрузок(Запрос, ГлобальныеПеременные, Истина);
			ЗакрытияГрафиковОтгрузокКлиенты.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			//Приходные движения заказов, так же в эту таблицу дописываются движения уточнений графика.
			//Используется для переноса движений в таблицу записей регистра накопления и для определения остатков плановых оплат на каждый день.
			ДвиженияПлановыхОплатДляСуммированияКлиенты    = ПолучитьПриходныеДвиженияПоПлановымОплатам(Запрос, ГлобальныеПеременные, Истина);
			ДвиженияПлановыхОплатДляСуммированияКлиенты.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			ДвиженияПлановыхОтгрузокДляСуммированияКлиенты = ПолучитьПриходныеДвиженияПоПлановымОтгрузкам(Запрос, ГлобальныеПеременные, Истина);
			ДвиженияПлановыхОтгрузокДляСуммированияКлиенты.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
		КонецЕсли;
		
		Если ГлобальныеПеременные.ЕстьЗаписиРасчетовСПоставщиками Тогда
			
			// Остатки плановых оплат для уточнения и закрытия нераспределенными авансами.
			ОстаткиПлановыхОплатПоставщики = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТРасчетыПланОплатОстаткиПоставщики"].ПолучитьДанные().Выгрузить(); //ТаблицаЗначений
			ОстаткиПлановыхОплатПоставщики.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			// Остатки плановых отгрузок для уточнения и закрытия нераспределенными авансами.
			ОстаткиПлановыхОтгрузокПоставщики = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТРасчетыПланОтгрузокПоставокОстаткиПоставщики"].ПолучитьДанные().Выгрузить(); //ТаблицаЗначений
			ОстаткиПлановыхОтгрузокПоставщики.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			// Остатки и движения нераспределенных авансов.
			ДвиженияПредоплатыДляСуммированияПоставщики = ОстаткиНераспределенныхАвансовПлановойОплатыНаНачалоПересчета(Запрос, Ложь);
			ДвиженияПредоплатыДляСуммированияПоставщики.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			ОстаткиАвансовПоставщики = ОстаткиАвансов(Запрос, Ложь);
			ОстаткиАвансовПоставщики.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			ДвиженияПредоплатыДляСуммированияПоставщики.Свернуть("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта,ДатаДвижения,Регистратор,ЭтоРеализацияВПути,ПорядокОперации,Просуммировано","Сумма");
			
			//Расходные движения накладных, которые распределяются на остатки плановых графиков.
			УточненияГрафиковОплатПоставщики    = ПолучитьУточненияГрафиковОплат(Запрос, ГлобальныеПеременные, Ложь);
			УточненияГрафиковОплатПоставщики.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			ЗакрытияГрафиковОтгрузокПоставщики = ПолучитьЗакрытияГрафиковОтгрузок(Запрос, ГлобальныеПеременные, Ложь);
			ЗакрытияГрафиковОтгрузокПоставщики.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			//Приходные движения заказов, так же в эту таблицу дописываются движения уточнений графика.
			//Используется для переноса движений в таблицу записей регистра накопления и для определения остатков плановых оплат на каждый день.
			ДвиженияПлановыхОплатДляСуммированияПоставщики    = ПолучитьПриходныеДвиженияПоПлановымОплатам(Запрос, ГлобальныеПеременные, Ложь);
			ДвиженияПлановыхОплатДляСуммированияПоставщики.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
			ДвиженияПлановыхОтгрузокДляСуммированияПоставщики = ПолучитьПриходныеДвиженияПоПлановымОтгрузкам(Запрос, ГлобальныеПеременные, Ложь);
			ДвиженияПлановыхОтгрузокДляСуммированияПоставщики.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта");
			
		КонецЕсли;
	
	#КонецОбласти
	
	Если НЕ ОсновныеПараметры.ТолькоПлановыеРасчеты Тогда
		СоздатьТаблицуДатЗаПериод(Запрос.МенеджерВременныхТаблиц, "ТаблицаДат", ДатаНачалаКурсов, НачалоДня(ТекущаяДатаСеанса()));
	КонецЕсли;
	
	#КонецОбласти
	
	Для Каждого СтрокаОсновныхПараметровРасчета Из ДополненнаяТаблицаКРаспределению Цикл
		
		// Содержит переменные и таблицы, относящиеся к текущей строке таблицы к распределению.
		ТекущиеПеременные = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаОсновныхПараметровРасчета);
		
		#Область ПолучениеДанныхДляРаспределения
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ОбъектРасчетов",            СтрокаОсновныхПараметровРасчета.ОбъектРасчетов);
		СтруктураОтбора.Вставить("АналитикаУчетаПоПартнерам", СтрокаОсновныхПараметровРасчета.АналитикаУчетаПоПартнерам);
		СтруктураОтбора.Вставить("Валюта",                    СтрокаОсновныхПараметровРасчета.Валюта);
		
		Если СтрокаОсновныхПараметровРасчета.ЭтоРасчетыСКлиентами Тогда
			
			ХозяйственныеОперации = Новый Соответствие;
			ХозяйственныеОперации.Вставить("ЗачетАванса",             Перечисления.ХозяйственныеОперации.ЗачетАвансаКлиента);
			ХозяйственныеОперации.Вставить("ПогашениеЗадолженности",  Перечисления.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента);
			ХозяйственныеОперации.Вставить("ВозвратАванса",           Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
			ХозяйственныеОперации.Вставить("ПереоценкаПоложительная", Перечисления.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль);
			ХозяйственныеОперации.Вставить("ПереоценкаОтрицательная", Перечисления.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток);
			ХозяйственныеОперации.Вставить("Планирование",            Перечисления.ХозяйственныеОперации.ПланированиеПоЗаказуКлиента);
			ТекущиеПеременные.Вставить("ХозяйственныеОперации", ХозяйственныеОперации);
			
			НастройкиХО = Новый Соответствие;
			НастройкиХО.Вставить("ЗачетОплаты", Справочники.НастройкиХозяйственныхОпераций.ЗачетАвансаКлиента);
			НастройкиХО.Вставить("ПереоценкаПоложительная", Справочники.НастройкиХозяйственныхОпераций.КурсовыеРазницыКлиентыПрибыль);
			НастройкиХО.Вставить("ПереоценкаОтрицательная", Справочники.НастройкиХозяйственныхОпераций.КурсовыеРазницыКлиентыУбыток);
			ТекущиеПеременные.Вставить("НастройкиХО", НастройкиХО);
			
			ДанныеДляРаспределения = ДанныеДляРаспределенияКлиенты.Скопировать(СтруктураОтбора);
			
			ТекущиеПеременные.Вставить("ИсходныеРегистраторы", ИсходныеРегистраторыКлиенты.Скопировать(СтруктураОтбора));
			ТекущиеПеременные.Вставить("ДвиженияИсходныхРегистраторов", ДвиженияИсходныхРегистраторовКлиенты.Скопировать(СтруктураОтбора));
			ТекущиеПеременные.Вставить("ДвиженияИсходныхРегистраторовПланОплат", ДвиженияИсходныхРегистраторовПланОплатКлиенты.Скопировать(СтруктураОтбора));
			ТекущиеПеременные.Вставить("ДвиженияИсходныхРегистраторовПланОтгрузок", ДвиженияИсходныхРегистраторовПланОтгрузокКлиенты.Скопировать(СтруктураОтбора));
			
			ТекущиеПеременные.Вставить("ТаблицаОстатковВзаиморасчетов", ТаблицаОстатковВзаиморасчетовКлиенты.Скопировать(СтруктураОтбора));
			
			ДвиженияПредоплатыДляСуммирования = ДвиженияПредоплатыДляСуммированияКлиенты.Скопировать(СтруктураОтбора);
			ДвиженияПлановыхОплатДляСуммирования = ДвиженияПлановыхОплатДляСуммированияКлиенты.Скопировать(СтруктураОтбора);
			ДвиженияПлановыхОтгрузокДляСуммирования = ДвиженияПлановыхОтгрузокДляСуммированияКлиенты.Скопировать(СтруктураОтбора);
			УточненияГрафиковОплат = УточненияГрафиковОплатКлиенты.Скопировать(СтруктураОтбора);
			ЗакрытияГрафиковОтгрузок = ЗакрытияГрафиковОтгрузокКлиенты.Скопировать(СтруктураОтбора);
		
			ОстаткиПлановыхОплат = ОстаткиПлановыхОплатКлиенты.Скопировать(СтруктураОтбора);
			ОстаткиПлановыхОплат.Индексы.Добавить("ДокументПлан,ВариантОплаты");
			ОстаткиПлановыхОплат.Индексы.Добавить("ДокументПлан");
			
			ОстаткиПлановыхОтгрузок = ОстаткиПлановыхОтгрузокКлиенты.Скопировать(СтруктураОтбора);
			ОстаткиПлановыхОтгрузок.Индексы.Добавить("ДокументПлан");
			
			ОстатокАвансов = ОстаткиАвансовКлиенты.Скопировать(СтруктураОтбора).Итог("Сумма");
			
			ДанныеНакладных = Новый Соответствие;
			ТаблицаДанныхНакладных = ТаблицаНакладныхКлиенты.Скопировать(СтруктураОтбора);
			Для Каждого Строка Из ТаблицаДанныхНакладных Цикл
				ДанныеНакладных.Вставить(Строка.Накладная,
											СтруктураСумм(Строка.Сумма,
											Строка.СуммаРегл,
											Строка.СуммаУпр));
			КонецЦикла;
			ТаблицаДанныхНакладных.Очистить();
			ТекущиеПеременные.Вставить("ДанныеНакладных", ДанныеНакладных);
			
			ТекущиеПеременные.Вставить("ТаблицаПланОплат", ТаблицаПланОплатКлиентам.Скопировать(СтруктураОтбора));
			ТаблицаПланОтгрузокПоставок = ТаблицаПланОтгрузокПоставокКлиентам.Скопировать(СтруктураОтбора);
			ТекущиеПеременные.Вставить("ТаблицаРасчетовПоСрокам", ТаблицаРасчетовСКлиентамиПоСрокам.Скопировать(СтруктураОтбора));
			
			ИмяРегистраРасчетов = "РасчетыСКлиентамиПоСрокам";
			ИмяРегистраПланаОплат = "РасчетыСКлиентамиПланОплат";
			ИмяРегистраПланаОтгрузкиПоставки = "РасчетыСКлиентамиПланОтгрузок";
			
		Иначе
			
			ХозяйственныеОперации = Новый Соответствие;
			ХозяйственныеОперации.Вставить("ЗачетАванса",             Перечисления.ХозяйственныеОперации.ЗачетАвансаПоставщику);
			ХозяйственныеОперации.Вставить("ПогашениеЗадолженности",  Перечисления.ХозяйственныеОперации.ПогашениеЗадолженностиПоставщику);
			ХозяйственныеОперации.Вставить("ВозвратАванса",           Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика);
			ХозяйственныеОперации.Вставить("ПереоценкаПоложительная", Перечисления.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток);
			ХозяйственныеОперации.Вставить("ПереоценкаОтрицательная", Перечисления.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль);
			ХозяйственныеОперации.Вставить("Планирование",            Перечисления.ХозяйственныеОперации.ПланированиеПоЗаказуПоставщику);
			ТекущиеПеременные.Вставить("ХозяйственныеОперации", ХозяйственныеОперации);
			
			НастройкиХО = Новый Соответствие;
			НастройкиХО.Вставить("ЗачетОплаты", Справочники.НастройкиХозяйственныхОпераций.ЗачетАвансаПоставщику);
			НастройкиХО.Вставить("ПереоценкаПоложительная", Справочники.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоставщикиУбыток);
			НастройкиХО.Вставить("ПереоценкаОтрицательная", Справочники.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоставщикиПрибыль);
			ТекущиеПеременные.Вставить("НастройкиХО", НастройкиХО);
			
			ДанныеДляРаспределения = ДанныеДляРаспределенияПоставщики.Скопировать(СтруктураОтбора);
			
			ТекущиеПеременные.Вставить("ИсходныеРегистраторы", ИсходныеРегистраторыПоставщики.Скопировать(СтруктураОтбора));
			ТекущиеПеременные.Вставить("ДвиженияИсходныхРегистраторов", ДвиженияИсходныхРегистраторовПоставщики.Скопировать(СтруктураОтбора));
			ТекущиеПеременные.Вставить("ДвиженияИсходныхРегистраторовПланОплат", ДвиженияИсходныхРегистраторовПланОплатПоставщики.Скопировать(СтруктураОтбора));
			ТекущиеПеременные.Вставить("ДвиженияИсходныхРегистраторовПланОтгрузок", ДвиженияИсходныхРегистраторовПланОтгрузокПоставщики.Скопировать(СтруктураОтбора));
			
			ТекущиеПеременные.Вставить("ТаблицаОстатковВзаиморасчетов",ТаблицаОстатковВзаиморасчетовПоставщики.Скопировать(СтруктураОтбора));
			
			ДвиженияПредоплатыДляСуммирования = ДвиженияПредоплатыДляСуммированияПоставщики.Скопировать(СтруктураОтбора);
			ДвиженияПлановыхОплатДляСуммирования = ДвиженияПлановыхОплатДляСуммированияПоставщики.Скопировать(СтруктураОтбора);
			ДвиженияПлановыхОтгрузокДляСуммирования = ДвиженияПлановыхОтгрузокДляСуммированияПоставщики.Скопировать(СтруктураОтбора);
			УточненияГрафиковОплат = УточненияГрафиковОплатПоставщики.Скопировать(СтруктураОтбора);
			ЗакрытияГрафиковОтгрузок = ЗакрытияГрафиковОтгрузокПоставщики.Скопировать(СтруктураОтбора);
			
			ОстаткиПлановыхОплат = ОстаткиПлановыхОплатПоставщики.Скопировать(СтруктураОтбора);
			ОстаткиПлановыхОплат.Индексы.Добавить("ДокументПлан,ВариантОплаты");
			ОстаткиПлановыхОплат.Индексы.Добавить("ДокументПлан");
			
			ОстаткиПлановыхОтгрузок = ОстаткиПлановыхОтгрузокПоставщики.Скопировать(СтруктураОтбора);
			ОстаткиПлановыхОтгрузок.Индексы.Добавить("ДокументПлан");
			
			ОстатокАвансов = ОстаткиАвансовПоставщики.Скопировать(СтруктураОтбора).Итог("Сумма");
				
			ДанныеНакладных = Новый Соответствие;
			ТаблицаДанныхНакладных = ТаблицаНакладныхПоставщики.Скопировать(СтруктураОтбора);
			Для Каждого Строка Из ТаблицаДанныхНакладных Цикл
				ДанныеНакладных.Вставить(Строка.Накладная,
											СтруктураСумм(Строка.Сумма,
											Строка.СуммаРегл,
											Строка.СуммаУпр));
			КонецЦикла;
			ТаблицаДанныхНакладных.Очистить();
			ТекущиеПеременные.Вставить("ДанныеНакладных", ДанныеНакладных);
			
			ТекущиеПеременные.Вставить("ТаблицаПланОплат",ТаблицаПланОплатПоставщикам.Скопировать(СтруктураОтбора));
			ТаблицаПланОтгрузокПоставок = ТаблицаПланОтгрузокПоставокПоставщикам.Скопировать(СтруктураОтбора);
			ТекущиеПеременные.Вставить("ТаблицаРасчетовПоСрокам",ТаблицаРасчетовСПоставщикамиПоСрокам.Скопировать(СтруктураОтбора));
			
			ИмяРегистраРасчетов = "РасчетыСПоставщикамиПоСрокам";
			ИмяРегистраПланаОплат = "РасчетыСПоставщикамиПланОплат";
			ИмяРегистраПланаОтгрузкиПоставки = "РасчетыСПоставщикамиПланПоставок";
		
		КонецЕсли;
		
		ТекущиеПеременные.ДвиженияИсходныхРегистраторов.Индексы.Добавить("ДокументРегистратор");
		ТекущиеПеременные.ИсходныеРегистраторы.Индексы.Добавить("НовыйРегистратор");
		ТекущиеПеременные.ИсходныеРегистраторы.Индексы.Добавить("СторнируемыйРегистратор");
		
		ТекущиеПеременные.Вставить("ПорядокПереоценки", Новый Соответствие);
		ТекущиеПеременные.Вставить("ДанныеКорректировокГрафиков", Новый Соответствие);
		
		Запрос.УстановитьПараметр("ОбъектРасчетов",             ТекущиеПеременные.ОбъектРасчетов);
		Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам",  ТекущиеПеременные.АналитикаУчетаПоПартнерам);
		Запрос.УстановитьПараметр("Валюта",                     ТекущиеПеременные.Валюта);
		Запрос.УстановитьПараметр("ТипРасчетов",                ТекущиеПеременные.ТипРасчетов);
		Запрос.УстановитьПараметр("ДатаНачалаПересчета",        ТекущиеПеременные.ДатаНачалаПересчета);
		Запрос.УстановитьПараметр("ПериодКонтроляИзмененийИСозданияЗаданий", ТекущиеПеременные.ПериодКонтроляИзмененийИСозданияЗаданий);
		
		СтрокиОтгрузок = ДанныеДляРаспределения.НайтиСтроки(Новый Структура("ЭтоОплата",Ложь));
		СтрокиОстатков = ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.НайтиСтроки(Новый Структура("Предоплата",0));
		
		НужнаПереоценка = (СтрокаОсновныхПараметровРасчета.Валюта <> СтрокаОсновныхПараметровРасчета.ВалютаРегламентированногоУчета 
			ИЛИ СтрокаОсновныхПараметровРасчета.Валюта <> ВалютаУправленческогоУчета)
			И (СтрокиОтгрузок.Количество() > 0 ИЛИ СтрокиОстатков.Количество() > 0)
			И НЕ ГлобальныеПеременные.ТолькоПлановыеРасчеты;
		ТекущиеПеременные.Вставить("НужнаПереоценка",НужнаПереоценка);
		Если НужнаПереоценка Тогда
			
			ТаблицаКурсовВалют = ПолучитьКурсыВалют(Запрос, ДатаНачалаКурсов, ГлобальныеПеременные, ТекущиеПеременные);
			ТекущиеПеременные.Вставить("ТаблицаКурсовВалют", ТаблицаКурсовВалют);
			
			ДатаНачалаКурсовыхРазниц = Мин(?(СтрокиОтгрузок.Количество() > 0, СтрокиОтгрузок[0].ДатаВозникновения, ТекущаяДатаСеанса()),
				?(СтрокиОстатков.Количество() > 0, СтрокиОстатков[0].ДатаВозникновения, ТекущаяДатаСеанса()));
			ДатаОкончанияКурсовыхРазниц = Макс(?(СтрокиОтгрузок.Количество() > 0, СтрокиОтгрузок[СтрокиОтгрузок.Количество()-1].ДатаВозникновения, ТекущаяДатаСеанса()),ТекущаяДатаСеанса());
			
			ДокументыРасчетаКурсовыхРазниц = Документы.РасчетКурсовыхРазниц.ДокументыПереоценки(СтрокаОсновныхПараметровРасчета.Организация,
				ДатаНачалаКурсовыхРазниц,
				ДатаОкончанияКурсовыхРазниц,
				ТекущиеПеременные.ЭтоРасчетыСКлиентами);
				
			ТекущиеПеременные.Вставить("ДокументыРасчетаКурсовыхРазниц", ДокументыРасчетаКурсовыхРазниц);
			
		КонецЕсли;
		#КонецОбласти
		
		ДанныеДляРаспределения.Индексы.Добавить("Регистратор");
		
		#Область РасчетПлановыхГрафиков
		ОстаткиПлановыхОтгрузокДляУточненияДатПогашенияАвансов = ОстаткиПлановыхОтгрузок.Скопировать();
		ОстаткиПлановыхОтгрузокДляУточненияДатПогашенияАвансов.Свернуть("ДатаПлановогоПогашения","Сумма,СуммаНераспределенныйАванс");
		ДвиженияПлановыхОтгрузок = ДвиженияПлановыхОтгрузокДляСуммирования.Скопировать();
		ДвиженияПлановыхОтгрузок.Свернуть("ПорядокОперации,ДатаПлановогоПогашения","Сумма");
		
		#Область ДвиженияПредоплатыДляСуммирования
		Сальдо = ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Итог("Предоплата") - ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Итог("Долг");
		Для Каждого СтрокаРасчетов Из ДанныеДляРаспределения Цикл
			Если СтрокаРасчетов.ЭтоОплата Тогда
				Если Сальдо + СтрокаРасчетов.Сумма > 0 Тогда
					СуммаДвижения = ?(Сальдо >= 0,СтрокаРасчетов.Сумма, Сальдо + СтрокаРасчетов.Сумма);
					НовСтр = ДвиженияПредоплатыДляСуммирования.Добавить();
					НовСтр.ДатаДвижения       = НачалоДня(СтрокаРасчетов.Период);
					НовСтр.Сумма             = СуммаДвижения;
					НовСтр.ПорядокОперации   = СтрокаРасчетов.ПорядокОперации;
					НовСтр.Регистратор       = СтрокаРасчетов.Регистратор;
					НовСтр.ЭтоРеализацияВПути = СтрокаРасчетов.ЭтоРеализацияВПути;
					НовСтр.Просуммировано    = ЛОЖЬ;
				КонецЕсли;
				Сальдо = Сальдо + СтрокаРасчетов.Сумма;
			ИначеЕсли НЕ СтрокаРасчетов.ЭтоОплата Тогда
				Если Сальдо > 0 Тогда
					СуммаДвижения = ?(Сальдо - СтрокаРасчетов.Сумма >= 0,СтрокаРасчетов.Сумма, Сальдо);
					НовСтр = ДвиженияПредоплатыДляСуммирования.Добавить();
					НовСтр.ДатаДвижения       = НачалоДня(СтрокаРасчетов.Период);
					НовСтр.Сумма             = -СуммаДвижения;
					НовСтр.ПорядокОперации   = СтрокаРасчетов.ПорядокОперации;
					НовСтр.Регистратор       = СтрокаРасчетов.Регистратор;
					НовСтр.ЭтоРеализацияВПути = СтрокаРасчетов.ЭтоРеализацияВПути;
					НовСтр.Просуммировано    = ЛОЖЬ;
				КонецЕсли;
				Сальдо = Сальдо - СтрокаРасчетов.Сумма;
			КонецЕсли;
		КонецЦикла;
		ДвиженияПредоплатыДляСуммирования.Сортировать("ДатаДвижения ВОЗР,ПорядокОперации ВОЗР");
		
		ДвиженияПредоплатыДляРаспределенияПоГрафикуОплаты = ДвиженияПредоплатыДляСуммирования.Скопировать();
		ДвиженияПредоплатыДляРаспределенияПоГрафикуОплаты.Свернуть("ДатаДвижения,Регистратор,ЭтоРеализацияВПути,ПорядокОперации","Сумма");
		ДвиженияПредоплатыДляРаспределенияПоГрафикуОплаты.Сортировать("ДатаДвижения УБЫВ");
		
		#КонецОбласти
			
			// 1. Определяем список дат, на конец которых нужно сделать перераспределение неиспользованных авансов.
			#Область СписокДатДляДвижений
			СписокДатДвиженийПредоплаты = ДвиженияПредоплатыДляСуммирования.Скопировать(Новый Структура("Просуммировано",Ложь),"ДатаДвижения").ВыгрузитьКолонку("ДатаДвижения");
			СписокДатДвиженийПлановыхОплат = ДвиженияПлановыхОплатДляСуммирования.Скопировать(,"Дата").ВыгрузитьКолонку("Дата");
			СписокДатДвиженийПлановыхОтгрузок = ДвиженияПлановыхОтгрузокДляСуммирования.Скопировать(,"Дата").ВыгрузитьКолонку("Дата");
			СписокДатУточненийОплат = УточненияГрафиковОплат.Скопировать(,"ДатаВозникновения").ВыгрузитьКолонку("ДатаВозникновения");
			СписокДатУточненийОтгрузок = ЗакрытияГрафиковОтгрузок.Скопировать(,"ДатаВозникновения").ВыгрузитьКолонку("ДатаВозникновения");
			СписокДатИсходныеРегистраторы = ТекущиеПеременные.ИсходныеРегистраторы.Скопировать(,"НовыйПериодНачалоДня").ВыгрузитьКолонку("НовыйПериодНачалоДня");
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокДатДвиженийПредоплаты, СписокДатДвиженийПлановыхОплат);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокДатДвиженийПредоплаты, СписокДатДвиженийПлановыхОтгрузок);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокДатДвиженийПредоплаты, СписокДатУточненийОплат);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокДатДвиженийПредоплаты, СписокДатУточненийОтгрузок);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокДатДвиженийПредоплаты, СписокДатИсходныеРегистраторы);
			МассивДат = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СписокДатДвиженийПредоплаты);
			СписокДат = Новый СписокЗначений;
			СписокДат.ЗагрузитьЗначения(МассивДат);
			СписокДат.СортироватьПоЗначению(НаправлениеСортировки.Возр);
			#КонецОбласти
			
			Для Каждого ЗначениеСписка Из СписокДат Цикл
				
				ИсходныеРегистраторыПоТекущейДате = ТекущиеПеременные.ИсходныеРегистраторы.НайтиСтроки(Новый Структура("НовыйПериодНачалоДня", ЗначениеСписка.Значение));
				
				// 2. Добавляем приходы по заказам и свернем остатки плановых оплат и отгрузок
				#Область ДобавлениеПриходныхДвиженийПлановыхОплатИСторно
				Пока ДвиженияПлановыхОплатДляСуммирования.Количество() > 0 Цикл
					Строка = ДвиженияПлановыхОплатДляСуммирования[0];
					Если Строка.Дата <= ЗначениеСписка.Значение Тогда
						НовСтр = ОстаткиПлановыхОплат.Добавить();
						НовСтр.ДокументПлан = Строка.Регистратор;
						НовСтр.ДатаВозникновения = Строка.ДатаВозникновения;
						НовСтр.ДатаПлановогоПогашения = Строка.ДатаПлановогоПогашения;
						НовСтр.ВариантОплаты = Строка.ВариантОплаты;
						НовСтр.КОплате = Строка.Сумма;
						НовСтр.КОплатеНераспределенныйАванс = 0;
						НовСтр.ЕстьКОплатеНераспределенныйАванс = Ложь;
						
						ДвиженияПлановыхОплатДляСуммирования.Удалить(0);
					Иначе
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого СтрокаИсходногоРегистратора Из ИсходныеРегистраторыПоТекущейДате Цикл
					// Сторнируем только запись с Нераспределенный аванс = Ложь, т.к. с Истина пересчитается автоматически ниже.
					ДвиженияИсходногоДокументаПланОплат = ТекущиеПеременные.ДвиженияИсходныхРегистраторовПланОплат.Скопировать(Новый Структура("ДокументРегистратор,НераспределенныйАванс", СтрокаИсходногоРегистратора.СторнируемыйРегистратор, ЛОЖЬ));
					ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТекущиеПеременные.ТаблицаПланОплат.Скопировать(Новый Структура("ДокументРегистратор,ЗаписьДоНачалаРасчета,НераспределенныйАванс", СтрокаИсходногоРегистратора.СторнируемыйРегистратор,Неопределено, ЛОЖЬ)),
															ДвиженияИсходногоДокументаПланОплат);
					// Движения сторно (с минусом)
					Для Каждого ДвижениеИсходногоДокумента Из ДвиженияИсходногоДокументаПланОплат Цикл
						СтрокаСторно = ТекущиеПеременные.ТаблицаПланОплат.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСторно,ДвижениеИсходногоДокумента);
						СтрокаСторно.ДокументРегистратор = СтрокаИсходногоРегистратора.НовыйРегистратор;
						СтрокаСторно.Период              = СтрокаИсходногоРегистратора.НовыйПериод;
						СтрокаСторно.ПорядокОперации     = СтрокаИсходногоРегистратора.НовыйПорядокОперации;
						СтрокаСторно.КОплате             = -ДвижениеИсходногоДокумента.КОплате;
						СтрокаСторно.Сторно              = Истина;
					КонецЦикла;
					// Приходные движения по остаткам графика
					Для Каждого СтрокаИсходныхДвижений Из ДвиженияИсходногоДокументаПланОплат Цикл
						// Если отсторнировалось закрытие графика накладной - график нужно вернуть в остатки.
						НовСтр = ОстаткиПлановыхОплат.Добавить();
						НовСтр.ДокументПлан = СтрокаИсходныхДвижений.ДокументПлан;
						НовСтр.ДатаВозникновения = СтрокаИсходныхДвижений.ДатаВозникновения;
						НовСтр.ДатаПлановогоПогашения = СтрокаИсходныхДвижений.ДатаПлановогоПогашения;
						НовСтр.ВариантОплаты = СтрокаИсходныхДвижений.ВариантОплаты;
						НовСтр.КОплате = СтрокаИсходныхДвижений.КОплате;
						НовСтр.КОплатеНераспределенныйАванс = 0;
					КонецЦикла;
				КонецЦикла;
				
				ОстаткиПлановыхОплат.Сортировать("ДатаПлановогоПогашения,ДатаВозникновения,ВариантОплаты", Новый СравнениеЗначений);
				#КонецОбласти
				
				#Область ДобавлениеПриходныхДвиженийПлановыхОтгрузокИСторно
				Пока ДвиженияПлановыхОтгрузокДляСуммирования.Количество() > 0 Цикл
					Строка = ДвиженияПлановыхОтгрузокДляСуммирования[0];
					Если Строка.Дата <= ЗначениеСписка.Значение Тогда
						НовСтр = ОстаткиПлановыхОтгрузок.Добавить();
						НовСтр.ДокументПлан = Строка.Регистратор;
						НовСтр.ДатаВозникновения = Строка.ДатаВозникновения;
						НовСтр.ДатаПлановогоПогашения = Строка.ДатаПлановогоПогашения;
						НовСтр.Сумма = Строка.Сумма;
						НовСтр.СуммаНераспределенныйАванс = 0;
						НовСтр.ЕстьСуммаНераспределенныйАванс = Ложь;
						
						ДвиженияПлановыхОтгрузокДляСуммирования.Удалить(0);
					Иначе
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого СтрокаИсходногоРегистратора Из ИсходныеРегистраторыПоТекущейДате Цикл
					ДвиженияИсходногоДокументаПланОтгрузок = ТекущиеПеременные.ДвиженияИсходныхРегистраторовПланОтгрузок.Скопировать(Новый Структура("ДокументРегистратор,НераспределенныйАванс", СтрокаИсходногоРегистратора.СторнируемыйРегистратор,ЛОЖЬ));
					ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПланОтгрузокПоставок.Скопировать(Новый Структура("ДокументРегистратор,ЗаписьДоНачалаРасчета,НераспределенныйАванс", СтрокаИсходногоРегистратора.СторнируемыйРегистратор,Неопределено,ЛОЖЬ)),
						ДвиженияИсходногоДокументаПланОтгрузок);
					// Движения сторно (с минусом)
					Для Каждого ДвижениеИсходногоДокумента Из ДвиженияИсходногоДокументаПланОтгрузок Цикл
						СтрокаСторно = ТаблицаПланОтгрузокПоставок.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСторно,ДвижениеИсходногоДокумента);
						СтрокаСторно.ДокументРегистратор = СтрокаИсходногоРегистратора.НовыйРегистратор;
						СтрокаСторно.Период              = СтрокаИсходногоРегистратора.НовыйПериод;
						СтрокаСторно.ПорядокОперации     = СтрокаИсходногоРегистратора.НовыйПорядокОперации;
						
						СтрокаСторно.Сумма = -ДвижениеИсходногоДокумента.Сумма;
						СтрокаСторно.Сторно = Истина;
					КонецЦикла;
					// Приходные движения по остаткам графика
					Для Каждого СтрокаИсходныхДвижений Из ДвиженияИсходногоДокументаПланОтгрузок Цикл
						НовСтр = ОстаткиПлановыхОтгрузок.Добавить();
						НовСтр.ДокументПлан = СтрокаИсходныхДвижений.ДокументПлан;
						НовСтр.ДатаВозникновения = СтрокаИсходныхДвижений.ДатаВозникновения;
						НовСтр.ДатаПлановогоПогашения = СтрокаИсходныхДвижений.ДатаПлановогоПогашения;
						НовСтр.Сумма = СтрокаИсходныхДвижений.Сумма;
						НовСтр.СуммаНераспределенныйАванс = 0;
					КонецЦикла;
				КонецЦикла;
				
				ОстаткиПлановыхОтгрузок.Сортировать("ДатаПлановогоПогашения,ДатаВозникновения");
				#КонецОбласти
				
				// 3. Добавляем уточнения графика оплат по заказам и сторнируем записи нераспределенных авансов, если они были.
				#Область РаспределениеФактическойОтгрузкиНаПлановыеОплаты
				
				счУточнения = 0;
				Пока счУточнения < УточненияГрафиковОплат.Количество() Цикл
					СтрокаУточнения = УточненияГрафиковОплат[счУточнения];
					Если СтрокаУточнения.ДатаВозникновения > ЗначениеСписка.Значение Тогда
						Прервать;
					КонецЕсли;
						
					// С учетом варианта оплаты
					СтрокиОстатков = ОстаткиПлановыхОплат.НайтиСтроки(Новый Структура("ДокументПлан,ВариантОплаты",СтрокаУточнения.Заказ,СтрокаУточнения.ВариантОплаты));
					Для Каждого СтрокаОстатков Из СтрокиОстатков Цикл
						Если НачалоДня(СтрокаОстатков.ДатаВозникновения) > СтрокаУточнения.ДатаВозникновения Тогда
							Продолжить;
						КонецЕсли;
						Если СтрокаУточнения.Сумма = 0 Тогда
							Прервать;
						КонецЕсли;
						СуммаСписания = Мин(СтрокаОстатков.КОплате, СтрокаУточнения.Сумма);
						УменьшитьПланОплатыПоЗаказу(ТекущиеПеременные.ТаблицаПланОплат, СтрокаОстатков, СтрокаУточнения, СуммаСписания);
						Если СуммаСписания > 0 Тогда
							СтрокиОстатковНераспределенногоАванса = ОстаткиПлановыхОплат.НайтиСтроки(Новый Структура("ЕстьКОплатеНераспределенныйАванс",Истина));
							Для Каждого СтрокаОстаткаНераспределенногоАванса Из СтрокиОстатковНераспределенногоАванса Цикл
								Если СуммаСписания = 0 Тогда
									Прервать;
								КонецЕсли;
								Если СтрокаОстаткаНераспределенногоАванса.КОплатеНераспределенныйАванс < 0 Тогда
									СуммаСторнирования = Макс(-СуммаСписания, СтрокаОстаткаНераспределенногоАванса.КОплатеНераспределенныйАванс);
									СторнироватьНераспределенныйАванс(ТекущиеПеременные.ТаблицаПланОплат, СтрокаОстаткаНераспределенногоАванса, СтрокаУточнения, СуммаСторнирования);
									СуммаСписания = СуммаСписания + СуммаСторнирования;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
					// Без учета варианта оплаты
					Если СтрокаУточнения.Сумма > 0 Тогда
						СтрокиОстатков = ОстаткиПлановыхОплат.НайтиСтроки(Новый Структура("ДокументПлан",СтрокаУточнения.Заказ));
						Для Каждого СтрокаОстатков Из СтрокиОстатков Цикл
							Если НачалоДня(СтрокаОстатков.ДатаВозникновения) > СтрокаУточнения.ДатаВозникновения Тогда
								Продолжить;
							КонецЕсли;
							Если СтрокаУточнения.Сумма = 0 Тогда
								Прервать;
							КонецЕсли;
							СуммаСписания = Мин(СтрокаОстатков.КОплате, СтрокаУточнения.Сумма);
							УменьшитьПланОплатыПоЗаказу(ТекущиеПеременные.ТаблицаПланОплат, СтрокаОстатков, СтрокаУточнения, СуммаСписания);
							// Если не весь нераспределенный аванс уменьшили
							Если СуммаСписания > 0 Тогда
								СтрокиОстатковНераспределенногоАванса = ОстаткиПлановыхОплат.НайтиСтроки(Новый Структура("ЕстьКОплатеНераспределенныйАванс",Истина));
								Для Каждого СтрокаОстаткаНераспределенногоАванса Из СтрокиОстатковНераспределенногоАванса Цикл
									Если СуммаСписания = 0 Тогда
										Прервать;
									КонецЕсли;
									Если СтрокаОстаткаНераспределенногоАванса.КОплатеНераспределенныйАванс < 0 Тогда
										СуммаСторнирования = Макс(-СуммаСписания, СтрокаОстаткаНераспределенногоАванса.КОплатеНераспределенныйАванс);
										СторнироватьНераспределенныйАванс(ТекущиеПеременные.ТаблицаПланОплат, СтрокаОстаткаНераспределенногоАванса, СтрокаУточнения, СуммаСторнирования);
										СуммаСписания = СуммаСписания + СуммаСторнирования;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
						
					Если СтрокаУточнения.Сумма = 0 Тогда
						УточненияГрафиковОплат.Удалить(счУточнения);
					Иначе
						счУточнения = счУточнения + 1;
					КонецЕсли;
				КонецЦикла;
				#КонецОбласти
				
				// 4. Добавляем закрытие графика отгрузок по заказам и сторнируем записи нераспределенных авансов, если они были.
				#Область РаспределениеФактическойОтгрузкиНаПлановыеОтгрузки
				счЗакрытия = 0;
				Пока счЗакрытия < ЗакрытияГрафиковОтгрузок.Количество() Цикл
					СтрокаЗакрытия = ЗакрытияГрафиковОтгрузок[счЗакрытия];
					Если СтрокаЗакрытия.ДатаВозникновения > ЗначениеСписка.Значение Тогда
						Прервать;
					Иначе
						СтрокиОстатков = ОстаткиПлановыхОтгрузок.НайтиСтроки(Новый Структура("ДокументПлан",СтрокаЗакрытия.Заказ));
						Для Каждого СтрокаОстатков Из СтрокиОстатков Цикл
							Если НачалоДня(СтрокаОстатков.ДатаВозникновения) > СтрокаЗакрытия.ДатаВозникновения Тогда
								Продолжить;
							КонецЕсли;
							Если СтрокаЗакрытия.Сумма = 0 Тогда
								Прервать;
							КонецЕсли;
							СуммаСписания = Мин(СтрокаОстатков.Сумма,СтрокаЗакрытия.Сумма);
							УменьшитьПланОтгрузкиПоЗаказу(ТаблицаПланОтгрузокПоставок, СтрокаОстатков, СтрокаЗакрытия, СуммаСписания);
							// Если не весь нераспределенный аванс уменьшили
							Если СуммаСписания > 0 Тогда
								СтрокиОстатковНераспределенногоАванса = ОстаткиПлановыхОтгрузок.НайтиСтроки(Новый Структура("ЕстьСуммаНераспределенныйАванс",Истина));
								Для Каждого СтрокаОстаткаНераспределенногоАванса Из СтрокиОстатковНераспределенногоАванса Цикл
									Если СуммаСписания = 0 Тогда
										Прервать;
									КонецЕсли;
									Если СтрокаОстаткаНераспределенногоАванса.СуммаНераспределенныйАванс < 0 Тогда
										СуммаСторнирования = Макс(-СуммаСписания, СтрокаОстаткаНераспределенногоАванса.СуммаНераспределенныйАванс);
										СторнироватьНераспределенныйАвансПланаОтгрузок(ТаблицаПланОтгрузокПоставок, СтрокаОстаткаНераспределенногоАванса, СтрокаЗакрытия, СуммаСторнирования);
										СуммаСписания = СуммаСписания + СуммаСторнирования;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
					Если СтрокаЗакрытия.Сумма = 0 Тогда
						ЗакрытияГрафиковОтгрузок.Удалить(счЗакрытия);
					Иначе
						счЗакрытия = счЗакрытия + 1;
					КонецЕсли;
				КонецЦикла;
				#КонецОбласти
				
				// 5. Обновим остаток предоплаты, что бы понять сколько нужно перераспределить авансов.
				#Область РасчетОстаткаАвансов
				Для Каждого Строка Из ДвиженияПредоплатыДляСуммирования Цикл
					Если Строка.ДатаДвижения > ЗначениеСписка.Значение Тогда
						Прервать;
					КонецЕсли;
					Если НЕ Строка.Просуммировано Тогда
						Строка.Просуммировано         = Истина;
						ОстатокАвансов = ОстатокАвансов + Строка.Сумма;
					КонецЕсли;
				КонецЦикла;
				ДвиженияПредоплатыДляСуммированияПланОтгрузок = ДвиженияПредоплатыДляРаспределенияПоГрафикуОплаты.Скопировать();
				#КонецОбласти
				
				// Дельта авансов = Остаток авансов на конец дня - уже добавленные строки Нераспределенного аванса.
				СуммаАвансовДляРаспределенияПоГрафикуОплат = ОстатокАвансов + ОстаткиПлановыхОплат.Итог("КОплатеНераспределенныйАванс");
				СуммаАвансовДляРаспределенияПоГрафикуОтгрузок = ОстатокАвансов + ОстаткиПлановыхОтгрузок.Итог("СуммаНераспределенныйАванс");
				
				// 6. Распределение дельты суммы авансов за день по графикам плановой оплаты (движения с флагом "НераспределенныйАванс")
				#Область РаспределениеАвансовПоГрафикуОплаты
				// Если дельта положительная (сумма авансов увеличилась) то смотрим остатки с учетом уже зачтенных нераспределенных авансов (НераспределенныйАванс = Истина или Ложь)
				Если СуммаАвансовДляРаспределенияПоГрафикуОплат > 0 Тогда
					Для Каждого СтрокаОстатков Из ОстаткиПлановыхОплат Цикл
						Если СуммаАвансовДляРаспределенияПоГрафикуОплат = 0 Тогда
							Прервать;
						КонецЕсли;
						Если (СтрокаОстатков.КОплате + СтрокаОстатков.КОплатеНераспределенныйАванс) <= 0 Тогда
							Продолжить;
						КонецЕсли;
						Для Каждого ДвижениеПредоплаты Из ДвиженияПредоплатыДляРаспределенияПоГрафикуОплаты Цикл
							СуммаСписания = Мин(СуммаАвансовДляРаспределенияПоГрафикуОплат,ДвижениеПредоплаты.Сумма,СтрокаОстатков.КОплате + СтрокаОстатков.КОплатеНераспределенныйАванс);
							Если СуммаСписания <= 0 ИЛИ ДвижениеПредоплаты.ДатаДвижения > ЗначениеСписка.Значение Тогда
								Продолжить;
							КонецЕсли;
							
							УменьшитьПланОплатыПоЗаказу(ТекущиеПеременные.ТаблицаПланОплат, СтрокаОстатков, ДвижениеПредоплаты, СуммаСписания, КонецДня(ЗначениеСписка.Значение));
							СуммаАвансовДляРаспределенияПоГрафикуОплат = СуммаАвансовДляРаспределенияПоГрафикуОплат - СуммаСписания;
							
						КонецЦикла;
					КонецЦикла;
				// Если дельта отрицательная то нужно уменьшить только зачтенные нераспределенные авансы (НераспределенныйАванс = Истина)
				ИначеЕсли СуммаАвансовДляРаспределенияПоГрафикуОплат < 0 Тогда
					сч = ОстаткиПлановыхОплат.Количество()-1;
					Пока сч >= 0 Цикл
						СтрокаОстатков = ОстаткиПлановыхОплат[сч];
						Если СуммаАвансовДляРаспределенияПоГрафикуОплат = 0 Тогда
							Прервать;
						КонецЕсли;
						Если СтрокаОстатков.КОплатеНераспределенныйАванс = 0 Тогда
							сч = сч -1;
							Продолжить;
						КонецЕсли;
						Для Каждого ДвижениеПредоплаты Из ДвиженияПредоплатыДляРаспределенияПоГрафикуОплаты Цикл
							СуммаСписания = -Мин(-СуммаАвансовДляРаспределенияПоГрафикуОплат,-ДвижениеПредоплаты.Сумма,-СтрокаОстатков.КОплатеНераспределенныйАванс);
							Если ДвижениеПредоплаты.ДатаДвижения > ЗначениеСписка.Значение
								ИЛИ СуммаСписания >= 0
								ИЛИ ДвижениеПредоплаты.ЭтоРеализацияВПути Тогда
								Продолжить;
							КонецЕсли;
								
							СторнироватьНераспределенныйАванс(ТекущиеПеременные.ТаблицаПланОплат, СтрокаОстатков, ДвижениеПредоплаты, СуммаСписания, КонецДня(ЗначениеСписка.Значение));
							СуммаАвансовДляРаспределенияПоГрафикуОплат = СуммаАвансовДляРаспределенияПоГрафикуОплат - СуммаСписания;
								
						КонецЦикла;
						сч = сч -1;
					КонецЦикла;
				КонецЕсли;
				#КонецОбласти
				
				// 7. Распределение дельты суммы авансов за день по графикам плановой отгрузки (движения с флагом "НераспределенныйАванс")
				#Область РаспределениеАвансовПоГрафикуОтгрузки
				// Если дельта положительная (сумма авансов увеличилась) то смотрим остатки с учетом уже зачтенных нераспределенных авансов (НераспределенныйАванс = Истина или Ложь)
				Если СуммаАвансовДляРаспределенияПоГрафикуОтгрузок > 0 Тогда
					Для Каждого СтрокаОстатков Из ОстаткиПлановыхОтгрузок Цикл
						Если СуммаАвансовДляРаспределенияПоГрафикуОтгрузок = 0 Тогда
							Прервать;
						КонецЕсли;
						Если (СтрокаОстатков.Сумма + СтрокаОстатков.СуммаНераспределенныйАванс) <= 0 Тогда
							Продолжить;
						КонецЕсли;
						Для Каждого ДвижениеПредоплаты Из ДвиженияПредоплатыДляСуммированияПланОтгрузок Цикл
							Если ДвижениеПредоплаты.ДатаДвижения = ЗначениеСписка.Значение //Подбираем движения текущего дня, ведь именно они изменили Остаток аванса
								И ДвижениеПредоплаты.ДатаДвижения >= СтрокаОстатков.ДатаВозникновения //График отгрузок уточняют только предоплаты введенные после заказа.
								И ДвижениеПредоплаты.Сумма > 0
								И СуммаАвансовДляРаспределенияПоГрафикуОтгрузок > 0 Тогда
								
								СуммаСписания = Мин(СуммаАвансовДляРаспределенияПоГрафикуОтгрузок,ДвижениеПредоплаты.Сумма,СтрокаОстатков.Сумма + СтрокаОстатков.СуммаНераспределенныйАванс);
								
								УменьшитьПланОтгрузкиПоЗаказу(ТаблицаПланОтгрузокПоставок, СтрокаОстатков, ДвижениеПредоплаты, СуммаСписания, КонецДня(ЗначениеСписка.Значение));
								
								СуммаАвансовДляРаспределенияПоГрафикуОтгрузок = СуммаАвансовДляРаспределенияПоГрафикуОтгрузок - СуммаСписания;
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				// Если дельта отрицательная то нужно уменьшить только зачтенные нераспределенные авансы (НераспределенныйАванс = Истина)
				ИначеЕсли СуммаАвансовДляРаспределенияПоГрафикуОтгрузок < 0 Тогда
					сч = ОстаткиПлановыхОтгрузок.Количество()-1;
					Пока сч >= 0 Цикл
						СтрокаОстатков = ОстаткиПлановыхОтгрузок[сч];
						Если СуммаАвансовДляРаспределенияПоГрафикуОтгрузок = 0 Тогда
							Прервать;
						КонецЕсли;
						Если СтрокаОстатков.СуммаНераспределенныйАванс = 0 Тогда
							сч = сч -1;
							Продолжить;
						КонецЕсли;
						Для Каждого ДвижениеПредоплаты Из ДвиженияПредоплатыДляСуммированияПланОтгрузок Цикл
							Если ДвижениеПредоплаты.ДатаДвижения = ЗначениеСписка.Значение
								И ДвижениеПредоплаты.Сумма < 0
								И СуммаАвансовДляРаспределенияПоГрафикуОтгрузок < 0 Тогда
								СуммаСписания = -Мин(-СуммаАвансовДляРаспределенияПоГрафикуОтгрузок,-ДвижениеПредоплаты.Сумма,-СтрокаОстатков.СуммаНераспределенныйАванс);
								Если ДвижениеПредоплаты.ДатаДвижения > ЗначениеСписка.Значение ИЛИ СуммаСписания >= 0 Тогда
									Продолжить;
								КонецЕсли;
								
								СторнироватьНераспределенныйАвансПланаОтгрузок(ТаблицаПланОтгрузокПоставок, СтрокаОстатков, ДвижениеПредоплаты, СуммаСписания, КонецДня(ЗначениеСписка.Значение));
								СуммаАвансовДляРаспределенияПоГрафикуОтгрузок = СуммаАвансовДляРаспределенияПоГрафикуОтгрузок - СуммаСписания;
								
							КонецЕсли;
						КонецЦикла;
						сч = сч -1;
					КонецЦикла;
				КонецЕсли;
				#КонецОбласти
				
				// 8. Удаление учтенных строк движений по предоплате
				#Область УдалениеУстаревшихСтрок
				сч = 0;
				Пока сч < ДвиженияПредоплатыДляРаспределенияПоГрафикуОплаты.Количество() Цикл
					Строка = ДвиженияПредоплатыДляРаспределенияПоГрафикуОплаты[сч];
					Если Строка.ДатаДвижения <= ЗначениеСписка.Значение И Строка.Сумма = 0 Тогда
						ДвиженияПредоплатыДляРаспределенияПоГрафикуОплаты.Удалить(сч);
					Иначе
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				#КонецОбласти
				
			КонецЦикла;
			
		#КонецОбласти

		#Область РаспределениеОплатНаНакладные
		Для Каждого СтрокаРасчетов Из ДанныеДляРаспределения Цикл
			
			ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Свернуть("РасчетныйДокумент,ДатаПлановогоПогашения,ДатаПогашенияНеЗаполнена,ДатаВозникновения,ПорядокОперации,ПорядокЗачетаПоДатеПлатежа,ДатаПереоценки","Долг,ДолгРегл,ДолгУпр,Предоплата,ПредоплатаРегл,ПредоплатаУпр");
			ПустыеСтроки = ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.НайтиСтроки(Новый Структура("Предоплата,Долг",0,0));
			Для Каждого ПустаяСтрока Из ПустыеСтроки Цикл
				ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Удалить(ПустаяСтрока);
			КонецЦикла;
			
			Если СтрокаРасчетов.Сторно Тогда
			#Область Сторно
				ДобавитьСторноЗаписи(ГлобальныеПеременные,ТекущиеПеременные,СтрокаРасчетов);
				Если ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.Сторно") Тогда
					ДобавитьПочиночныеДвиженияПриНеобходимости(ГлобальныеПеременные, ТекущиеПеременные, СтрокаРасчетов);
				КонецЕсли;
				// Новые движения исправления могут быть на другой объект расчетов - необходимо списать нулевые остатки перед следующей строкой расчетов
				СписатьРеглУпрПоНулевымОстаткам(ТекущиеПеременные, НачалоДня(СтрокаРасчетов.Период));
				Продолжить;
			#КонецОбласти
			КонецЕсли;
			
			Если СтрокаРасчетов.ЭтоОплата Тогда
				
				Если СтрокаРасчетов.НовыеДвиженияИсправления Тогда
				#Область НовыеДвиженияИсправления
					ПодходящиеСтроки = ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Скопировать(Новый Структура("Предоплата,РасчетныйДокумент", 0, СтрокаРасчетов.Регистратор));
					Для Каждого ПодходящаяСтрокаСторно Из ПодходящиеСтроки Цикл
						Если СтрокаРасчетов.Сумма = 0 Тогда
							Прервать;
						КонецЕсли;
						
						#Область ОпределениеСуммыСписания
						СуммаСписания = Мин(ПодходящаяСтрокаСторно.Долг,СтрокаРасчетов.Сумма);
						Если СуммаСписания = 0 Тогда
							Продолжить;
						КонецЕсли;
						СуммаСписанияРегл = СуммаСписания(0, ПодходящаяСтрокаСторно.ДолгРегл, ПодходящаяСтрокаСторно.Долг, СуммаСписания);
						СуммаСписанияУпр = СуммаСписания(0, ПодходящаяСтрокаСторно.ДолгУпр, ПодходящаяСтрокаСторно.Долг, СуммаСписания);
						#КонецОбласти
						
						#Область РасходДолг
						Если СтрокаРасчетов.ПериодЗачета >= ТекущиеПеременные.ДатаНачалаПересчета Тогда
							ДобавитьРасходДолга(ТекущиеПеременные, ПодходящаяСтрокаСторно, СтрокаРасчетов, СуммаСписания, СуммаСписанияРегл, СуммаСписанияУпр, ХозяйственныеОперации["ПогашениеЗадолженности"]);
						КонецЕсли;
						#КонецОбласти
						
						СтрокаРасчетов.Сумма       = СтрокаРасчетов.Сумма     - СуммаСписания;
						СтрокаРасчетов.СуммаРегл   = СтрокаРасчетов.СуммаРегл - СуммаСписанияРегл;
						СтрокаРасчетов.СуммаУпр    = СтрокаРасчетов.СуммаУпр  - СуммаСписанияУпр;
					КонецЦикла;
				#КонецОбласти
				КонецЕсли;
				
				Если ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации")
					Или ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
				#Область КорректировкаНакладнойВМинус
					ОстаткиСвязанногоДокумента = ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.НайтиСтроки(Новый Структура("Предоплата, РасчетныйДокумент", 0, СтрокаРасчетов.СвязанныйДокумент));
					Для Каждого СтрокаОстаткаСвязанногоДокумента Из ОстаткиСвязанногоДокумента Цикл
						Если СтрокаРасчетов.Сумма = 0 Тогда
							Прервать;
						КонецЕсли;
						Если СтрокаРасчетов.ПорядокОперации < СтрокаОстаткаСвязанногоДокумента.ПорядокОперации Тогда
							Продолжить;
						КонецЕсли;
						
						Если НужнаПереоценка Тогда
							ПереоценитьДолг(ГлобальныеПеременные, ТекущиеПеременные, СтрокаРасчетов.СвязанныйДокумент, СтрокаРасчетов.Период, Ложь);
						КонецЕсли;
						
						#Область ОпределениеСуммыСписания
						СуммаСписания = Мин(СтрокаРасчетов.Сумма, СтрокаОстаткаСвязанногоДокумента.Долг);
						Если СуммаСписания = 0 Тогда
							Продолжить;
						КонецЕсли;
						Если СтрокаРасчетов.РучнойКурсРегл
							Или ТекущиеПеременные.ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент] = Неопределено Тогда
							СуммаКорректировкиРегл = Окр(СуммаСписания * СтрокаРасчетов.СуммаРегл / СтрокаРасчетов.Сумма,2);
						Иначе
							СуммаКорректировкиРегл = Окр(СуммаСписания
								* (ТекущиеПеременные.ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокументаРегл 
									/ ТекущиеПеременные.ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокумента),2);
						КонецЕсли;
								
						Если СтрокаРасчетов.РучнойКурсУпр
							Или ТекущиеПеременные.ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент] = Неопределено Тогда
							СуммаКорректировкиУпр = Окр(СуммаСписания * СтрокаРасчетов.СуммаУпр / СтрокаРасчетов.Сумма,2);
						Иначе
							СуммаКорректировкиУпр = Окр(СуммаСписания
								* (ТекущиеПеременные.ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокументаУпр 
									/ ТекущиеПеременные.ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокумента),2);
						КонецЕсли;
						#КонецОбласти
						
						#Область РасходДолг
						ДобавитьРасходДолга(ТекущиеПеременные, СтрокаОстаткаСвязанногоДокумента, СтрокаРасчетов, СуммаСписания, СуммаКорректировкиРегл, СуммаКорректировкиУпр);
						#КонецОбласти
						
						СтрокаРасчетов.Сумма     = СтрокаРасчетов.Сумма     - СуммаСписания;
						СтрокаРасчетов.СуммаРегл = СтрокаРасчетов.СуммаРегл - СуммаКорректировкиРегл;
						СтрокаРасчетов.СуммаУпр  = СтрокаРасчетов.СуммаУпр  - СуммаКорректировкиУпр;
						
					КонецЦикла;
					
					Если СтрокаРасчетов.Сумма > 0 Тогда
						ПересчитатьСуммыЕслиЭтоКорректировка(ГлобальныеПеременные, ТекущиеПеременные, СтрокаРасчетов);
					КонецЕсли;
					#КонецОбласти
				КонецЕсли;
				
				Если ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.КорректировкаГрафикаВзаиморасчетов") Тогда
					#Область КорректировкаГрафика
					Если СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КорректировкаГрафикаОплатыКлиентом
						ИЛИ СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КорректировкаГрафикаОплатыПоставщику Тогда
						ОстаткиРасчетногоДокумента = ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.НайтиСтроки(Новый Структура("Предоплата, РасчетныйДокумент", 0, СтрокаРасчетов.РасчетныйДокумент));
						Для Каждого СтрокаРасчетногоСвязанногоДокумента Из ОстаткиРасчетногоДокумента Цикл
							Если СтрокаРасчетов.Сумма = 0 Тогда
								Прервать;
							КонецЕсли;
							
							Если НужнаПереоценка Тогда
								ПереоценитьДолг(ГлобальныеПеременные, ТекущиеПеременные, СтрокаРасчетов.РасчетныйДокумент, СтрокаРасчетов.Период, Ложь);
							КонецЕсли;
							
							#Область ОпределениеСуммыСписания
							СуммаСписания = Мин(СтрокаРасчетов.Сумма, СтрокаРасчетногоСвязанногоДокумента.Долг);
							Если СуммаСписания = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							//Списываем долг текущему курсу долга, чтобы не возникало курсовых разниц.
							СуммаКорректировкиРегл = Окр(СуммаСписания * СтрокаРасчетногоСвязанногоДокумента.ДолгРегл / СтрокаРасчетногоСвязанногоДокумента.Долг,2);
							СуммаКорректировкиУпр = Окр(СуммаСписания * СтрокаРасчетногоСвязанногоДокумента.ДолгУпр / СтрокаРасчетногоСвязанногоДокумента.Долг,2);
							// Все суммы списаний корректировки графика нужно сложить, чтобы потом начислить такие-же суммы без образования курсовых разниц
							Если ТекущиеПеременные.ДанныеКорректировокГрафиков[СтрокаРасчетов.Регистратор] = Неопределено Тогда
								ТекущиеПеременные.ДанныеКорректировокГрафиков.Вставить(СтрокаРасчетов.Регистратор, СтруктураДанныхКорректировкиГрафика());
							КонецЕсли;
							ДанныеКорректировкиГрафика                 = ТекущиеПеременные.ДанныеКорректировокГрафиков[СтрокаРасчетов.Регистратор];
							ДанныеКорректировкиГрафика.СуммаРасход     = ДанныеКорректировкиГрафика.СуммаРасход     + СуммаСписания;
							ДанныеКорректировкиГрафика.СуммаРасходРегл = ДанныеКорректировкиГрафика.СуммаРасходРегл + СуммаКорректировкиРегл;
							ДанныеКорректировкиГрафика.СуммаРасходУпр  = ДанныеКорректировкиГрафика.СуммаРасходУпр  + СуммаКорректировкиУпр;
							ДанныеКорректировкиГрафика.ДатаВозникновения = СтрокаРасчетногоСвязанногоДокумента.ДатаВозникновения;
							#КонецОбласти
							
							#Область РасходДолг
							ДобавитьРасходДолга(ТекущиеПеременные, СтрокаРасчетногоСвязанногоДокумента, СтрокаРасчетов, СуммаСписания, СуммаКорректировкиРегл, СуммаКорректировкиУпр);
							#КонецОбласти
							
							СтрокаРасчетов.Сумма     = СтрокаРасчетов.Сумма     - СуммаСписания;
							СтрокаРасчетов.СуммаРегл = СтрокаРасчетов.СуммаРегл - СуммаКорректировкиРегл;
							СтрокаРасчетов.СуммаУпр  = СтрокаРасчетов.СуммаУпр  - СуммаКорректировкиУпр;
						КонецЦикла;
						
						Если СтрокаРасчетов.Сумма > 0 Тогда
							СтрокаРасчетов.Сумма = 0;
						КонецЕсли;
						// Если еще не были добавлены суммы расхода, то приход не нужно добавлять, запишем пустую структуру
						Если ТекущиеПеременные.ДанныеКорректировокГрафиков[СтрокаРасчетов.Регистратор] = Неопределено Тогда
							ТекущиеПеременные.ДанныеКорректировокГрафиков.Вставить(СтрокаРасчетов.Регистратор, СтруктураДанныхКорректировкиГрафика());
						КонецЕсли;
					Иначе
						ЗаполнитьДанныеКорректировкиГрафика(ТекущиеПеременные, СтрокаРасчетов.Регистратор, ДанныеДляРаспределения, СтрокаРасчетов.ЭтоОплата);
					КонецЕсли;
					#КонецОбласти
				КонецЕсли;
				
				Если СтрокаРасчетов.Сумма > 0 Тогда
					#Область ПогашениеЗадолженности
					Если СтрокаОсновныхПараметровРасчета.ЗачетОплатПоДатеПлатежа Тогда
						ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Сортировать("ДатаПогашенияНеЗаполнена ВОЗР, ДатаПлановогоПогашения ВОЗР, ДатаВозникновения ВОЗР, ПорядокЗачетаПоДатеПлатежа ВОЗР, ПорядокОперации ВОЗР");
					Иначе
						ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Сортировать("ДатаВозникновения ВОЗР, ПорядокОперации ВОЗР, ДатаПогашенияНеЗаполнена ВОЗР, ДатаПлановогоПогашения ВОЗР, ПорядокЗачетаПоДатеПлатежа ВОЗР");
					КонецЕсли;
					
					Для Каждого ПодходящаяСтрокаОтгрузки Из ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов Цикл
						Если СтрокаРасчетов.Сумма = 0 Тогда
							Прервать;
						КонецЕсли;
						Если ПодходящаяСтрокаОтгрузки.Предоплата <> 0 Тогда
							// Это не строка отгрузки
							Продолжить;
						КонецЕсли;
						
						Если НужнаПереоценка Тогда
							ПереоценитьДолг(ГлобальныеПеременные, ТекущиеПеременные, ПодходящаяСтрокаОтгрузки.РасчетныйДокумент, СтрокаРасчетов.Период, Истина);
						КонецЕсли;
						
						#Область ОпределениеСуммыСписания
						СуммаСписания = Мин(ПодходящаяСтрокаОтгрузки.Долг,СтрокаРасчетов.Сумма);
						Если СуммаСписания = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						//Списываем долг по курсу оплаты, если это не перенос долга.
						Если СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереносДолга Тогда
							СуммаСписанияРегл = СуммаСписания(0, ПодходящаяСтрокаОтгрузки.ДолгРегл, ПодходящаяСтрокаОтгрузки.Долг, СуммаСписания);
							СуммаСписанияУпр = СуммаСписания(0, ПодходящаяСтрокаОтгрузки.ДолгУпр, ПодходящаяСтрокаОтгрузки.Долг, СуммаСписания);
						Иначе
							СуммаСписанияРегл = СуммаСписания(0, СтрокаРасчетов.СуммаРегл, СтрокаРасчетов.Сумма, СуммаСписания);
							СуммаСписанияУпр = СуммаСписания(0, СтрокаРасчетов.СуммаУпр, СтрокаРасчетов.Сумма, СуммаСписания);
						КонецЕсли;
						#КонецОбласти
						
						#Область РасходДолг
						Если СтрокаРасчетов.ПериодЗачета >= ТекущиеПеременные.ДатаНачалаПересчета Тогда
							Если ХозяйственныеОперацииПереноса.Найти(СтрокаРасчетов.ХозяйственнаяОперация) <> Неопределено Тогда
								ХозяйственнаяОперация         = СтрокаРасчетов.ХозяйственнаяОперация;
							Иначе
								ХозяйственнаяОперация         = ТекущиеПеременные.ХозяйственныеОперации["ПогашениеЗадолженности"];
							КонецЕсли;
							ДобавитьРасходДолга(ТекущиеПеременные, ПодходящаяСтрокаОтгрузки, СтрокаРасчетов, СуммаСписания, СуммаСписанияРегл, СуммаСписанияУпр, ХозяйственнаяОперация);
						КонецЕсли;
						#КонецОбласти
						
						СтрокаРасчетов.Сумма       = СтрокаРасчетов.Сумма     - СуммаСписания;
						СтрокаРасчетов.СуммаРегл   = СтрокаРасчетов.СуммаРегл - СуммаСписанияРегл;
						СтрокаРасчетов.СуммаУпр    = СтрокаРасчетов.СуммаУпр  - СуммаСписанияУпр;
					КонецЦикла;
					#КонецОбласти
				КонецЕсли;
					
				Если СтрокаРасчетов.Сумма > 0 Тогда
					
					#Область УточнениеДатПогашенияАвансов
						//Обновление остатков плановых отгрузок
						Пока ДвиженияПлановыхОтгрузок.Количество() > 0 Цикл
							Строка = ДвиженияПлановыхОтгрузок[0];
							Если Строка.ПорядокОперации < СтрокаРасчетов.ПорядокОперации Тогда
								НовСтр = ОстаткиПлановыхОтгрузокДляУточненияДатПогашенияАвансов.Добавить();
								НовСтр.ДатаПлановогоПогашения = Строка.ДатаПлановогоПогашения;
								НовСтр.Сумма = Строка.Сумма;
								НовСтр.СуммаНераспределенныйАванс = 0;
								ДвиженияПлановыхОтгрузок.Удалить(Строка);
							Иначе
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						ОстаткиПлановыхОтгрузокДляУточненияДатПогашенияАвансов.Свернуть("ДатаПлановогоПогашения","Сумма,СуммаНераспределенныйАванс");
						ОстаткиПлановыхОтгрузокДляУточненияДатПогашенияАвансов.Сортировать("ДатаПлановогоПогашения ВОЗР");
						КУточнению = СтрокаРасчетов.Сумма;
						Для Каждого СтрокаОстатков Из ОстаткиПлановыхОтгрузокДляУточненияДатПогашенияАвансов Цикл
							Если СтрокаОстатков.Сумма + СтрокаОстатков.СуммаНераспределенныйАванс <= 0 Тогда
								Продолжить;
							КонецЕсли;
							Если КУточнению = 0 Тогда
								Прервать;
							КонецЕсли;
							
							СуммаУточнения = Мин(СтрокаОстатков.Сумма + СтрокаОстатков.СуммаНераспределенныйАванс,КУточнению);
							Если СтрокаРасчетов.Сумма > СуммаУточнения Тогда
								СуммаУточненияРегл = СуммаСписания(0, СтрокаРасчетов.СуммаРегл, СтрокаРасчетов.Сумма, СуммаУточнения);
								СуммаУточненияУпр = СуммаСписания(0, СтрокаРасчетов.СуммаУпр, СтрокаРасчетов.Сумма, СуммаУточнения);
								Если НЕ ЗначениеЗаполнено(СтрокаРасчетов.ДатаПлановогоПогашения) Тогда
									НовСтр = ДанныеДляРаспределения.Вставить(ДанныеДляРаспределения.Индекс(СтрокаРасчетов)+1);
									ЗаполнитьЗначенияСвойств(НовСтр,СтрокаРасчетов);
									НовСтр.Сумма = СтрокаРасчетов.Сумма - СуммаУточнения;
									НовСтр.СуммаРегл= СтрокаРасчетов.СуммаРегл - СуммаУточненияРегл;
									НовСтр.СуммаУпр = СтрокаРасчетов.СуммаУпр - СуммаУточненияУпр;
									
									СтрокаРасчетов.Сумма = СуммаУточнения;
									СтрокаРасчетов.СуммаРегл = СуммаУточненияРегл;
									СтрокаРасчетов.СуммаУпр = СуммаУточненияУпр;
									СтрокаРасчетов.ДатаПлановогоПогашения = СтрокаОстатков.ДатаПлановогоПогашения;
									КУточнению = 0;
								Иначе
									КУточнению = КУточнению - СуммаУточнения;
								КонецЕсли;
								СтрокаОстатков.Сумма = СтрокаОстатков.Сумма - СуммаУточнения;
							Иначе
								Если НЕ ЗначениеЗаполнено(СтрокаРасчетов.ДатаПлановогоПогашения) Тогда
									СтрокаРасчетов.ДатаПлановогоПогашения = СтрокаОстатков.ДатаПлановогоПогашения;
								КонецЕсли;
								СтрокаОстатков.Сумма = СтрокаОстатков.Сумма - СтрокаРасчетов.Сумма;
								КУточнению = 0;
							КонецЕсли;
						КонецЦикла;
					#КонецОбласти
					
					#Область ПриходПредоплаты
					ДобавитьПриход(ТекущиеПеременные, СтрокаРасчетов, "Оплата");
					#КонецОбласти
				КонецЕсли;
				
			Иначе
				
				СтрокиДвиженийРасходаПланаОтгрузки = ТаблицаПланОтгрузокПоставок.НайтиСтроки(
					Новый Структура("ДокументРегистратор, УчтеноВОстаткахПлановыхОтгрузок,ВидДвижения",
						СтрокаРасчетов.Регистратор, Ложь, ВидДвиженияНакопления.Расход));
				Для Каждого СтрокаДвижений Из СтрокиДвиженийРасходаПланаОтгрузки Цикл
					НовСтр = ОстаткиПлановыхОтгрузокДляУточненияДатПогашенияАвансов.Добавить();
					НовСтр.ДатаПлановогоПогашения = СтрокаДвижений.ДатаПлановогоПогашения;
					НовСтр.Сумма = -СтрокаДвижений.Сумма;
					НовСтр.СуммаНераспределенныйАванс = 0;
					СтрокаДвижений.УчтеноВОстаткахПлановыхОтгрузок = Истина;
				КонецЦикла;
				
				Если СтрокаРасчетов.НовыеДвиженияИсправления Тогда
				#Область НовыеДвиженияИсправления
					ПодходящиеСтроки = ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Скопировать(Новый Структура("Долг,РасчетныйДокумент", 0, СтрокаРасчетов.Регистратор));
					Для Каждого ПодходящаяСтрокаСторно Из ПодходящиеСтроки Цикл
						Если СтрокаРасчетов.Сумма = 0 Тогда
							Прервать;
						КонецЕсли;
						
						#Область ОпределениеСуммыСписания
						СуммаСписания = Мин(ПодходящаяСтрокаСторно.Долг,СтрокаРасчетов.Сумма);
						Если СуммаСписания = 0 Тогда
							Продолжить;
						КонецЕсли;
						СуммаСписанияРегл = СуммаСписания(0, ПодходящаяСтрокаСторно.ДолгРегл, ПодходящаяСтрокаСторно.Долг, СуммаСписания);
						СуммаСписанияУпр = СуммаСписания(0, ПодходящаяСтрокаСторно.ДолгУпр, ПодходящаяСтрокаСторно.Долг, СуммаСписания);
						#КонецОбласти
						
						#Область РасходДолг
						Если СтрокаРасчетов.ПериодЗачета >= ТекущиеПеременные.ДатаНачалаПересчета Тогда
							НовСтр_Предоплата_Расход = ДобавитьРасходПредоплаты(ТекущиеПеременные, ПодходящаяСтрокаСторно, СтрокаРасчетов, СуммаСписания, СуммаСписанияРегл, СуммаСписанияУпр);
						КонецЕсли;
						#КонецОбласти
						
						// Уменьшаем строку оплаты на зачтенную сумму.
						СтрокаРасчетов.Сумма       = СтрокаРасчетов.Сумма     - СуммаСписания;
						СтрокаРасчетов.СуммаРегл   = СтрокаРасчетов.СуммаРегл - СуммаСписанияРегл;
						СтрокаРасчетов.СуммаУпр    = СтрокаРасчетов.СуммаУпр  - СуммаСписанияУпр;
					КонецЦикла;
				#КонецОбласти
				КонецЕсли;
				
				Если ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.КорректировкаГрафикаВзаиморасчетов") Тогда
					
					#Область КорректировкаГрафика
					Если СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КорректировкаГрафикаПогашенияАвансаКлиента
						ИЛИ СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КорректировкаГрафикаПогашенияАвансаПоставщику Тогда
						ОстаткиРасчетногоДокумента = ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.НайтиСтроки(Новый Структура("Долг, РасчетныйДокумент", 0, СтрокаРасчетов.РасчетныйДокумент));
						Для Каждого СтрокаОстаткаРасчетногоДокумента Из ОстаткиРасчетногоДокумента Цикл
							Если СтрокаРасчетов.Сумма = 0 Тогда
								Прервать;
							КонецЕсли;
							
							#Область ОпределениеСуммыСписания
							СуммаСписания = Мин(СтрокаРасчетов.Сумма, СтрокаОстаткаРасчетногоДокумента.Предоплата);
							Если СуммаСписания = 0 Тогда
								Продолжить;
							КонецЕсли;
							СуммаКорректировкиРегл = Окр(СуммаСписания * СтрокаОстаткаРасчетногоДокумента.ПредоплатаРегл / СтрокаОстаткаРасчетногоДокумента.Предоплата,2);
							СуммаКорректировкиУпр = Окр(СуммаСписания * СтрокаОстаткаРасчетногоДокумента.ПредоплатаУпр / СтрокаОстаткаРасчетногоДокумента.Предоплата,2);
							
							// Все суммы списаний корректировки графика нужно сложить, чтобы потом начислить такие-же суммы без образования кусровых разниц
							Если ТекущиеПеременные.ДанныеКорректировокГрафиков[СтрокаРасчетов.Регистратор] = Неопределено Тогда
								ТекущиеПеременные.ДанныеКорректировокГрафиков.Вставить(СтрокаРасчетов.Регистратор, СтруктураДанныхКорректировкиГрафика());
							КонецЕсли;
							ДанныеКорректировкиГрафика                 = ТекущиеПеременные.ДанныеКорректировокГрафиков[СтрокаРасчетов.Регистратор];
							ДанныеКорректировкиГрафика.СуммаРасход     = ДанныеКорректировкиГрафика.СуммаРасход     + СуммаСписания;
							ДанныеКорректировкиГрафика.СуммаРасходРегл = ДанныеКорректировкиГрафика.СуммаРасходРегл + СуммаКорректировкиРегл;
							ДанныеКорректировкиГрафика.СуммаРасходУпр  = ДанныеКорректировкиГрафика.СуммаРасходУпр  + СуммаКорректировкиУпр;
							ДанныеКорректировкиГрафика.ДатаВозникновения = СтрокаОстаткаРасчетногоДокумента.ДатаВозникновения;
							#КонецОбласти
							
							#Область РасходПредоплаты
							НовСтр_Предоплата_Расход = ДобавитьРасходПредоплаты(ТекущиеПеременные,СтрокаОстаткаРасчетногоДокумента,СтрокаРасчетов, СуммаСписания,СуммаКорректировкиРегл,СуммаКорректировкиУпр);
							#КонецОбласти
							
							//Уменьшаем строку оплаты на сумму сторно.
							СтрокаРасчетов.Сумма     = СтрокаРасчетов.Сумма     - СуммаСписания;
							СтрокаРасчетов.СуммаРегл = СтрокаРасчетов.СуммаРегл - СуммаКорректировкиРегл;
							СтрокаРасчетов.СуммаУпр  = СтрокаРасчетов.СуммаУпр  - СуммаКорректировкиУпр;
							
						КонецЦикла;
						Если СтрокаРасчетов.Сумма > 0 Тогда
							СтрокаРасчетов.Сумма = 0;
						КонецЕсли;
						// Если еще не были добавлены суммы расхода, то приход не нужно добавлять, запишем пустую структуру
						Если ТекущиеПеременные.ДанныеКорректировокГрафиков[СтрокаРасчетов.Регистратор] = Неопределено Тогда
							ТекущиеПеременные.ДанныеКорректировокГрафиков.Вставить(СтрокаРасчетов.Регистратор, СтруктураДанныхКорректировкиГрафика());
						КонецЕсли;
					Иначе
						ЗаполнитьДанныеКорректировкиГрафика(ТекущиеПеременные, СтрокаРасчетов.Регистратор, ДанныеДляРаспределения, СтрокаРасчетов.ЭтоОплата);
					КонецЕсли;
					#КонецОбласти
				КонецЕсли;
				
				// Переброс аванса на расчетный документ - накладную.
				// Если "ИСТИНА" - будет просто уменьшена предоплата, иначе будет создана запись по приходу и расходу долга.
				ДвойнаяЗаписьНеНужна = ХозяйственныеОперацииНеОтгрузка.Найти(СтрокаРасчетов.ХозяйственнаяОперация) <> Неопределено;
				
				Если ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации")
					Или ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
					ПересчитатьСуммыЕслиЭтоКорректировка(ГлобальныеПеременные, ТекущиеПеременные, СтрокаРасчетов, "ОтгрузкаПоставка");
				КонецЕсли;
				
				#Область ЗачетАванса
				Если СтрокаОсновныхПараметровРасчета.ЗачетОплатПоДатеПлатежа Тогда
					ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Сортировать("ДатаПогашенияНеЗаполнена ВОЗР, ДатаПлановогоПогашения ВОЗР, ДатаВозникновения ВОЗР, ПорядокЗачетаПоДатеПлатежа ВОЗР,  ПорядокОперации ВОЗР");
				Иначе
					ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Сортировать("ДатаВозникновения ВОЗР, ПорядокОперации ВОЗР, ДатаПогашенияНеЗаполнена ВОЗР, ДатаПлановогоПогашения ВОЗР, ПорядокЗачетаПоДатеПлатежа ВОЗР");
				КонецЕсли;
				
				Для Каждого ПодходящаяСтрокаОплаты Из ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов Цикл
					Если СтрокаРасчетов.Сумма = 0 Тогда
						Прервать;
					КонецЕсли;
					Если ПодходящаяСтрокаОплаты.Долг <> 0 Тогда
						// Это не строка оплаты
						Продолжить;
					КонецЕсли;
					Если ПодходящаяСтрокаОплаты.Предоплата < 0 Тогда
						ВызватьИсключение(СтрШаблон(НСтр("ru = 'В регистрах взаиморасчетов обнаружены отрицательные остатки на дату %1. Проведение невозможно.'"),
							ТекущиеПеременные.ДатаНачалаПересчета));
					КонецЕсли;
					
					#Область ОпределениеСуммыСписания
					
					Если НЕ ДвойнаяЗаписьНеНужна Тогда
						Если СтрокаРасчетов.Регистратор = ПодходящаяСтрокаОплаты.РасчетныйДокумент
							И ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.ОтчетКомиссионера")
							И СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомиссионера Тогда
							ХозяйственнаяОперацияЗачетаАванса = Перечисления.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомиссионера;
						ИначеЕсли СтрокаРасчетов.Регистратор = ПодходящаяСтрокаОплаты.РасчетныйДокумент
							И ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.ОтчетКомитенту")
							И СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомитентом Тогда
							ХозяйственнаяОперацияЗачетаАванса = Перечисления.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомитенту;
						ИначеЕсли СтрокаРасчетов.Регистратор = ПодходящаяСтрокаОплаты.РасчетныйДокумент
							И ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациями")
							И (СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомиссионера
								ИЛИ СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомитентом) Тогда
							Если ГлобальныеПеременные.ЭтоРасчетыСКлиентами Тогда
								ХозяйственнаяОперацияЗачетаАванса = Перечисления.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомиссионера;
							Иначе
								ХозяйственнаяОперацияЗачетаАванса = Перечисления.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомитенту;
							КонецЕсли;
						ИначеЕсли СтрокаРасчетов.Регистратор = ПодходящаяСтрокаОплаты.РасчетныйДокумент
							И ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.ОперацияСЭлектроннымБилетом")
							И (СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеЧерезАгента
								ИЛИ СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом
								ИЛИ СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо) Тогда
							ХозяйственнаяОперацияЗачетаАванса = Перечисления.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом;
						Иначе
							ХозяйственнаяОперацияЗачетаАванса = ТекущиеПеременные.ХозяйственныеОперации["ЗачетАванса"];
						КонецЕсли;
						ИдентификаторФинЗаписиЗачетаАванса = Новый УникальныйИдентификатор;
					КонецЕсли;
					
					СуммаСписания = Мин(СтрокаРасчетов.Сумма,ПодходящаяСтрокаОплаты.Предоплата);
					Если СуммаСписания = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					//Возврат аванса отражаем по курсу возврата. Произвольный взаимозачет всегда по своему курсу.
					Если (СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности
							ИЛИ СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом)
						И СтрокаРасчетов.РучнойКурсРегл
						ИЛИ СтрокаРасчетов.ЭтоВозвратАванса
							И СтрокаРасчетов.Регистратор = ПодходящаяСтрокаОплаты.РасчетныйДокумент
						ИЛИ СтрокаРасчетов.Сторно Тогда
						СуммаСписанияРегл = СуммаСписания(СтрокаРасчетов.ИсходнаяСуммаРегл/СтрокаРасчетов.ИсходнаяСумма,
							СтрокаРасчетов.СуммаРегл, СтрокаРасчетов.Сумма, СуммаСписания);
					// Остальные авансы по курсу аванса.
					Иначе
						СуммаСписанияРегл = СуммаСписания(0, ПодходящаяСтрокаОплаты.ПредоплатаРегл, ПодходящаяСтрокаОплаты.Предоплата, СуммаСписания);
					КонецЕсли;
					
					Если (СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности
							ИЛИ СтрокаРасчетов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом)
						И СтрокаРасчетов.РучнойКурсУпр
						ИЛИ СтрокаРасчетов.ЭтоВозвратАванса 
							И СтрокаРасчетов.Регистратор = ПодходящаяСтрокаОплаты.РасчетныйДокумент
						ИЛИ СтрокаРасчетов.Сторно Тогда
						СуммаСписанияУпр = СуммаСписания(СтрокаРасчетов.ИсходнаяСуммаУпр/СтрокаРасчетов.ИсходнаяСумма,
							СтрокаРасчетов.СуммаУпр, СтрокаРасчетов.Сумма, СуммаСписания);
					Иначе
						СуммаСписанияУпр = СуммаСписания(0, ПодходящаяСтрокаОплаты.ПредоплатаУпр, ПодходящаяСтрокаОплаты.Предоплата, СуммаСписания);
					КонецЕсли;
					#КонецОбласти
					
					Если СтрокаРасчетов.РучнойКурсУпр ИЛИ СтрокаРасчетов.ЭтоВозвратАванса Тогда
						ПриходДолгУпр = СуммаСписания(СтрокаРасчетов.ИсходнаяСуммаУпр/СтрокаРасчетов.ИсходнаяСумма, 
							СтрокаРасчетов.СуммаУпр, СтрокаРасчетов.Сумма, СуммаСписания);
					Иначе
						ПриходДолгУпр = СуммаСписанияУпр;
					КонецЕсли;
					Если СтрокаРасчетов.РучнойКурсРегл ИЛИ СтрокаРасчетов.ЭтоВозвратАванса Тогда
						ПриходДолгРегл = СуммаСписания(СтрокаРасчетов.ИсходнаяСуммаРегл/СтрокаРасчетов.ИсходнаяСумма, 
							СтрокаРасчетов.СуммаРегл, СтрокаРасчетов.Сумма, СуммаСписания);
					Иначе
						ПриходДолгРегл = СуммаСписанияРегл;
					КонецЕсли;
				
					#Область РасходПредоплата
					Если СтрокаРасчетов.ПериодЗачета >= ТекущиеПеременные.ДатаНачалаПересчета И НЕ СтрокаРасчетов.Сторно Тогда
						НовСтр_Предоплата_Расход = ДобавитьРасходПредоплаты(ТекущиеПеременные, ПодходящаяСтрокаОплаты, СтрокаРасчетов, СуммаСписания, СуммаСписанияРегл, СуммаСписанияУпр, ДвойнаяЗаписьНеНужна);
						Если НЕ ДвойнаяЗаписьНеНужна Тогда
							НовСтр_Предоплата_Расход.ХозяйственнаяОперация = ХозяйственнаяОперацияЗачетаАванса;
							НовСтр_Предоплата_Расход.ИдентификаторФинЗаписи = ИдентификаторФинЗаписиЗачетаАванса;
							НовСтр_Предоплата_Расход.НастройкаХозяйственнойОперации = ТекущиеПеременные.НастройкиХО["ЗачетОплаты"];
						КонецЕсли;
					КонецЕсли;
					#КонецОбласти
				
					Если НЕ ДвойнаяЗаписьНеНужна Тогда
						Если СтрокаРасчетов.Период >= ТекущиеПеременные.ДатаНачалаПересчета Тогда
						#Область ПриходДолг
						
							//Отражаем приход на сумму долга по курсу предоплаты.
							НовСтр_Долг_Приход = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
							НовСтр_Долг_Приход.ВидДвижения                   = ВидДвиженияНакопления.Приход;
							
							НовСтр_Долг_Приход.ДокументРегистратор           = СтрокаРасчетов.Регистратор;
							НовСтр_Долг_Приход.ВалютаДокумента               = СтрокаРасчетов.ВалютаДокумента;
							НовСтр_Долг_Приход.ПорядокОперации               = СтрокаРасчетов.ПорядокОперации;
							НовСтр_Долг_Приход.Сторно                        = Ложь;
							НовСтр_Долг_Приход.Период                        = СтрокаРасчетов.Период;
							НовСтр_Долг_Приход.ДатаВозникновения             = СтрокаРасчетов.ДатаВозникновения;
							НовСтр_Долг_Приход.ДатаПлановогоПогашения        = СтрокаРасчетов.ДатаПлановогоПогашения;
							НовСтр_Долг_Приход.РасчетныйДокумент             = ?(СтрокаРасчетов.РасчетныйДокумент <> СтрокаРасчетов.Регистратор, СтрокаРасчетов.РасчетныйДокумент, СтрокаРасчетов.Регистратор);
							НовСтр_Долг_Приход.ПорядокЗачета                 = СтрокаРасчетов.ПорядокЗачетаПоДатеПлатежа;
							НовСтр_Долг_Приход.ХозяйственнаяОперация         = СтрокаРасчетов.ХозяйственнаяОперация;
							НовСтр_Долг_Приход.НастройкаХозяйственнойОперации = СтрокаРасчетов.НастройкаХозяйственнойОперации;
							НовСтр_Долг_Приход.ИдентификаторФинЗаписи        = СтрокаРасчетов.ИдентификаторФинЗаписи;
							//возврат ДС, статья должна быть
							НовСтр_Долг_Приход.СтатьяДвиженияДенежныхСредств = СтрокаРасчетов.СтатьяДвиженияДенежныхСредств;
							НовСтр_Долг_Приход.СвязанныйДокумент             = Неопределено;
							
							//С приемником связан только регистратор отгрузки
							НовСтр_Долг_Приход.АналитикаУчетаПоПартнерамПриемник = СтрокаРасчетов.АналитикаУчетаПоПартнерамПриемник;
							НовСтр_Долг_Приход.ОбъектРасчетовПриемник            = СтрокаРасчетов.ОбъектРасчетовПриемник;
							НовСтр_Долг_Приход.ВалютаПриемник                    = СтрокаРасчетов.ВалютаПриемник;
							НовСтр_Долг_Приход.СуммаПриемник                     = СуммаСписания(0, СтрокаРасчетов.СуммаПриемник, СтрокаРасчетов.Сумма, СуммаСписания);
							СтрокаРасчетов.СуммаПриемник = СтрокаРасчетов.СуммаПриемник - НовСтр_Долг_Приход.СуммаПриемник;
							
							НовСтр_Долг_Приход.ПоДаннымОбъектаРасчетовИсточника  = СтрокаРасчетов.ПоДаннымОбъектаРасчетовИсточника;
							НовСтр_Долг_Приход.КорОбъектРасчетов                 = СтрокаРасчетов.КорОбъектРасчетов;
							НовСтр_Долг_Приход.КорАналитикаУчетаПоПартнерам      = СтрокаРасчетов.КорАналитикаУчетаПоПартнерам;
							
							НовСтр_Долг_Приход.Долг                          = СуммаСписания;
							НовСтр_Долг_Приход.ДолгРегл                      = ПриходДолгРегл;
							НовСтр_Долг_Приход.ДолгУпр                       = ПриходДолгУпр;
							НовСтр_Долг_Приход.ЗаписьДоНачалаРасчета         = Ложь;
							Если НовСтр_Долг_Приход.Сторно
								И СтрокаРасчетов.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.Оплата Тогда
								НовСтр_Долг_Приход.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.ПереносВзаиморасчетов;
							Иначе
								НовСтр_Долг_Приход.ОперацияВзаиморасчетов = СтрокаРасчетов.ОперацияВзаиморасчетов;
							КонецЕсли;
							НовСтр_Долг_Приход.Предоплата                    = 0;
							НовСтр_Долг_Приход.ПредоплатаРегл                = 0;
							НовСтр_Долг_Приход.ПредоплатаУпр                 = 0;
							
							ДобавитьДвижениеВТаблицуОстатковРасчетов(ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов, НовСтр_Долг_Приход);
						#КонецОбласти
						КонецЕсли;
						
						#Область РасходДолг
						Если СтрокаРасчетов.ПериодЗачета>= ТекущиеПеременные.ДатаНачалаПересчета Тогда
						//Переносим предоплату на расчетный документ отгрузки.
						НовСтр_Долг_Расход = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
						НовСтр_Долг_Расход.ВидДвижения                   = ВидДвиженияНакопления.Расход;
						НовСтр_Долг_Расход.ВалютаДокумента               = СтрокаРасчетов.ВалютаДокумента;
						НовСтр_Долг_Расход.Период                        = СтрокаРасчетов.ПериодЗачета;
						
						//Униплан
						НовСтр_Долг_Расход.ХозяйственнаяОперация         = НовСтр_Предоплата_Расход.ХозяйственнаяОперация;
						НовСтр_Долг_Расход.НастройкаХозяйственнойОперации = НовСтр_Предоплата_Расход.НастройкаХозяйственнойОперации;
						НовСтр_Долг_Расход.ИдентификаторФинЗаписи        = НовСтр_Предоплата_Расход.ИдентификаторФинЗаписи;
						
						НовСтр_Долг_Расход.ДатаПлановогоПогашения        = НовСтр_Долг_Приход.ДатаПлановогоПогашения;
						НовСтр_Долг_Расход.РасчетныйДокумент             = НовСтр_Долг_Приход.РасчетныйДокумент;
						НовСтр_Долг_Расход.ДатаВозникновения             = НовСтр_Долг_Приход.ДатаВозникновения;
						НовСтр_Долг_Расход.ПорядокЗачета                 = СтрокаРасчетов.ПорядокОперации;
						НовСтр_Долг_Расход.ПорядокОперации               = СтрокаРасчетов.ПорядокОперации;
						НовСтр_Долг_Расход.ДокументРегистратор           = СтрокаРасчетов.Регистратор;
						НовСтр_Долг_Расход.СтатьяДвиженияДенежныхСредств = СтрокаРасчетов.СтатьяДвиженияДенежныхСредств;
						НовСтр_Долг_Расход.Сторно                        = Ложь;
						НовСтр_Долг_Расход.СвязанныйДокумент             = Неопределено;
						
						НовСтр_Долг_Расход.АналитикаУчетаПоПартнерамПриемник  = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
						НовСтр_Долг_Расход.ОбъектРасчетовПриемник             = Справочники.ОбъектыРасчетов.ПустаяСсылка();
						НовСтр_Долг_Расход.ВалютаПриемник                     = Справочники.Валюты.ПустаяСсылка();
						НовСтр_Долг_Расход.СуммаПриемник                      = 0;
						
						НовСтр_Долг_Расход.ПоДаннымОбъектаРасчетовИсточника = ЛОЖЬ;
						НовСтр_Долг_Расход.КорОбъектРасчетов                = Справочники.ОбъектыРасчетов.ПустаяСсылка();
						НовСтр_Долг_Расход.КорАналитикаУчетаПоПартнерам     = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
						
						НовСтр_Долг_Расход.Долг                          = НовСтр_Предоплата_Расход.Предоплата;
						НовСтр_Долг_Расход.ДолгУпр                       = НовСтр_Предоплата_Расход.ПредоплатаУпр;
						НовСтр_Долг_Расход.ДолгРегл                      = НовСтр_Предоплата_Расход.ПредоплатаРегл;
						НовСтр_Долг_Расход.ЗаписьДоНачалаРасчета         = Ложь;
						Если НовСтр_Долг_Расход.Сторно
							И СтрокаРасчетов.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.Оплата Тогда
							НовСтр_Долг_Расход.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.ПереносВзаиморасчетов;
						Иначе
							НовСтр_Долг_Расход.ОперацияВзаиморасчетов = СтрокаРасчетов.ОперацияВзаиморасчетов;
						КонецЕсли;
						НовСтр_Долг_Расход.Предоплата                    = 0;
						НовСтр_Долг_Расход.ПредоплатаУпр                 = 0;
						НовСтр_Долг_Расход.ПредоплатаРегл                = 0;
						
						ДобавитьДвижениеВТаблицуОстатковРасчетов(ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов, НовСтр_Долг_Расход, НовСтр_Долг_Приход);
						КонецЕсли;
						#КонецОбласти
					
					КонецЕсли;
				
					// Уменьшаем сумму строку отгрузки, которая пойдет в приход.
					Если СтрокаРасчетов.РучнойКурсРегл И НЕ ДвойнаяЗаписьНеНужна Тогда
						СтрокаРасчетов.СуммаРегл = СтрокаРасчетов.СуммаРегл - ПриходДолгРегл;
					Иначе
						// Выше могла произойти переоценка, поэтому сумму для переоценки нужно изменить так же как сумму регл
						// Для ручного или незаполненного курса определяем сумму регл. по отношению сумм в валютах
						Если СтрокаРасчетов.РучнойКурсРегл
							Или СтрокаРасчетов.КурсЗнаменательВалютыВзаиморасчетов = 0
							Или ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации")
							Или ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
							Курс = СтрокаРасчетов.ИсходнаяСуммаРегл / СтрокаРасчетов.ИсходнаяСумма;
						Иначе
							Курс = СтрокаРасчетов.КурсЧислительВалютыВзаиморасчетов / СтрокаРасчетов.КурсЗнаменательВалютыВзаиморасчетов;
						КонецЕсли;
						ПересчитанныйОстатокРегл = СуммаСписания(Курс, СтрокаРасчетов.СуммаРегл, СтрокаРасчетов.Сумма, СтрокаРасчетов.Сумма-СуммаСписания);
						СтрокаРасчетов.СуммаРегл = ПересчитанныйОстатокРегл;
					КонецЕсли;
					
					Если СтрокаРасчетов.РучнойКурсУпр И НЕ ДвойнаяЗаписьНеНужна Тогда
						СтрокаРасчетов.СуммаУпр = СтрокаРасчетов.СуммаУпр - ПриходДолгУпр;
					Иначе
						// Для ручного или незаполненного курса определяем сумму упр. по отношению сумм в валютах
						Если СтрокаРасчетов.РучнойКурсУпр
							Или СтрокаРасчетов.КурсЗнаменательВалютыВзаиморасчетов = 0
							Или СтрокаРасчетов.КурсЧислительВалютыУпр = 0
							Или ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации")
							Или ТипЗнч(СтрокаРасчетов.Регистратор) = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
							Курс = СтрокаРасчетов.ИсходнаяСуммаУпр / СтрокаРасчетов.ИсходнаяСумма;
						ИначеЕсли СтрокаРасчетов.КурсЗнаменательВалютыВзаиморасчетов = 0 Тогда
							Курс = СтрокаРасчетов.КурсЗнаменательВалютыУпр / СтрокаРасчетов.КурсЧислительВалютыУпр;
						Иначе
							Курс = СтрокаРасчетов.КурсЧислительВалютыВзаиморасчетов * СтрокаРасчетов.КурсЗнаменательВалютыУпр
								/ (СтрокаРасчетов.КурсЗнаменательВалютыВзаиморасчетов * СтрокаРасчетов.КурсЧислительВалютыУпр);
						КонецЕсли;
						ПересчитанныйОстатокУпр = СуммаСписания(Курс, СтрокаРасчетов.СуммаУпр, СтрокаРасчетов.Сумма, СтрокаРасчетов.Сумма-СуммаСписания);
						СтрокаРасчетов.СуммаУпр = ПересчитанныйОстатокУпр;
					КонецЕсли;
					СтрокаРасчетов.Сумма                  = СтрокаРасчетов.Сумма - СуммаСписания;
					
					//Хранит средневзвешанные курсы накладных для проведения корректировок.
					Если ТекущиеПеременные.ДанныеНакладных[СтрокаРасчетов.Регистратор] = Неопределено Тогда
						ТекущиеПеременные.ДанныеНакладных.Вставить(СтрокаРасчетов.Регистратор, СтруктураСумм());
					КонецЕсли;
					
					ДанныеНакладной                    = ТекущиеПеременные.ДанныеНакладных[СтрокаРасчетов.Регистратор];
					ДанныеНакладной.СуммаДокумента     = ДанныеНакладной.СуммаДокумента     + СуммаСписания;
					ДанныеНакладной.СуммаДокументаРегл = ДанныеНакладной.СуммаДокументаРегл + СуммаСписанияРегл;
					ДанныеНакладной.СуммаДокументаУпр  = ДанныеНакладной.СуммаДокументаУпр  + СуммаСписанияУпр;
					
				КонецЦикла;
				
				#КонецОбласти
				
				Если СтрокаРасчетов.Сумма > 0 Тогда
					#Область ПриходДолга
					ДобавитьПриход(ТекущиеПеременные, СтрокаРасчетов, "ОтгрузкаПоставка");
					#КонецОбласти
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаРасчетов.НовыеДвиженияИсправления Тогда
				ДобавитьПочиночныеДвиженияПриНеобходимости(ГлобальныеПеременные, ТекущиеПеременные, СтрокаРасчетов);
			КонецЕсли;
			
			СписатьРеглУпрПоНулевымОстаткам(ТекущиеПеременные,НачалоДня(СтрокаРасчетов.Период));
			
		КонецЦикла;
		
		//Переоценить все остатки долгов
		Если НужнаПереоценка Тогда
			Для Каждого СтрокаОстатков Из ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов Цикл
				Если СтрокаОстатков.Долг > 0 Тогда
					ПереоценитьДолг(ГлобальныеПеременные, ТекущиеПеременные, СтрокаОстатков.РасчетныйДокумент, ТекущаяДатаСеанса(), Ложь);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		#КонецОбласти

		#Область ФиксацияРезультатов
		
		НаборЗаписейПоСрокам = РегистрыНакопления[ИмяРегистраРасчетов].СоздатьНаборЗаписей();
		НаборЗаписейПланОплат = РегистрыНакопления[ИмяРегистраПланаОплат].СоздатьНаборЗаписей();
		НаборЗаписейПланОтгрузокПоставок = РегистрыНакопления[ИмяРегистраПланаОтгрузкиПоставки].СоздатьНаборЗаписей();
		
		ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Свернуть("Период, Регистратор, ВидДвижения, АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, ДокументРегистратор,
				|РасчетныйДокумент, ХозяйственнаяОперация, ДатаПлановогоПогашения, ДатаВозникновения, ПорядокЗачета, ПорядокОперации,
				|ВалютаДокумента, СвязанныйДокумент, СтатьяДвиженияДенежныхСредств, КорОбъектРасчетов, КорАналитикаУчетаПоПартнерам,
				|ОбъектРасчетовПриемник, АналитикаУчетаПоПартнерамПриемник, ВалютаПриемник, Сторно,
				|НастройкаХозяйственнойОперации,ИдентификаторФинЗаписи,ЗаписьДоНачалаРасчета,ПоДаннымОбъектаРасчетовИсточника,ОперацияВзаиморасчетов,ТипЗаписиВзаиморасчетов",
				"Предоплата, ПредоплатаРегл, ПредоплатаУпр, Долг, ДолгРегл, ДолгУпр,СуммаПриемник");
		// Заполнение типов записей взаиморасчетов по операциям взаиморасчетов в распределенных движениях
		Для Каждого СтрокаДвижений Из ТекущиеПеременные.ТаблицаРасчетовПоСрокам Цикл
			Если Не СтрокаДвижений.ЗаписьДоНачалаРасчета
				И Не ЗначениеЗаполнено(СтрокаДвижений.ТипЗаписиВзаиморасчетов) Тогда
				СтрокаДвижений.ТипЗаписиВзаиморасчетов = ТипЗаписиВзаиморасчетов(СтрокаДвижений);
			КонецЕсли;
		КонецЦикла;
		
		ТекущиеПеременные.ТаблицаРасчетовПоСрокам.ЗаполнитьЗначения(ТекущиеПеременные.АналитикаУчетаПоПартнерам, "АналитикаУчетаПоПартнерам");
		ТекущиеПеременные.ТаблицаРасчетовПоСрокам.ЗаполнитьЗначения(ТекущиеПеременные.ОбъектРасчетов,            "ОбъектРасчетов");
		ТекущиеПеременные.ТаблицаРасчетовПоСрокам.ЗаполнитьЗначения(ТекущиеПеременные.Валюта,            "Валюта");
		ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Индексы.Добавить("Регистратор");
		
		Если ГлобальныеПеременные.ЗаписыватьИзменения Тогда
			ТаблицаРегистраторов = ТаблицаСвободныхРегистраторовРасчета(ТекущиеПеременные, ГлобальныеПеременные);
		КонецЕсли;
		
		Если НЕ ГлобальныеПеременные.ТолькоПлановыеРасчеты И ГлобальныеПеременные.ЗаписыватьИзменения Тогда
			
			ПодготовитьДанныеДляЗаписи(ТекущиеПеременные, ТекущиеПеременные.ТаблицаРасчетовПоСрокам, НаборЗаписейПоСрокам, ТаблицаРегистраторов);
			
			#Область ПроверкаИзмененийРегистров
			
			ТаблицаИзменений = Неопределено;
			
			Если ТекущиеПеременные.ПериодКонтроляИзмененийИСозданияЗаданий < Дата(3000,1,1) Тогда
			
				Запрос.Текст = "
				|ВЫБРАТЬ *
				|ПОМЕСТИТЬ ВтДвиженияПосле
				|ИЗ  &ТаблицаПоСрокам КАК ДвиженияПосле
				|;
				|ВЫБРАТЬ
				|	ВложенныйЗапрос.Период                        КАК Период,
				|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
				|	ВложенныйЗапрос.ОбъектРасчетов                КАК ОбъектРасчетов,
				|	ВложенныйЗапрос.Валюта                        КАК Валюта,
				|	ВложенныйЗапрос.РасчетныйДокумент             КАК РасчетныйДокумент,
				|	ВложенныйЗапрос.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
				|	ВложенныйЗапрос.ДатаВозникновения             КАК ДатаВозникновения,
				|	ВложенныйЗапрос.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
				|	ВложенныйЗапрос.ДокументРегистратор           КАК ДокументРегистратор,	
				|	СУММА(ВложенныйЗапрос.Предоплата)                    КАК Предоплата,
				|	СУММА(ВложенныйЗапрос.ПредоплатаРегл)                КАК ПредоплатаРегл,
				|	СУММА(ВложенныйЗапрос.ПредоплатаУпр)                 КАК ПредоплатаУпр,
				|	СУММА(ВложенныйЗапрос.Долг)                          КАК Долг,
				|	СУММА(ВложенныйЗапрос.ДолгРегл)                      КАК ДолгРегл,
				|	СУММА(ВложенныйЗапрос.ДолгУпр)                       КАК ДолгУпр,
				|	ВложенныйЗапрос.ДокументРегистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов КАК СоздаватьЗаданияКЗакрытиюСледующегоМесяца
				|ПОМЕСТИТЬ ТаблицаИзмененийРасчетыСКлиентамиПоСрокам
				|ИЗ
				|	(ВЫБРАТЬ
				|		РасчетыПоСрокам.Период                        КАК Период,
				|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
				|		РасчетыПоСрокам.ОбъектРасчетов                КАК ОбъектРасчетов,
				|		РасчетыПоСрокам.Валюта                        КАК Валюта,
				|		РасчетыПоСрокам.РасчетныйДокумент             КАК РасчетныйДокумент,
				|		ВЫБОР КОГДА РасчетыПоСрокам.Предоплата <> 0 
				|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
				|			ИНАЧЕ РасчетыПоСрокам.ДатаПлановогоПогашения
				|		КОНЕЦ                                         КАК ДатаПлановогоПогашения,
				|		РасчетыПоСрокам.ДатаВозникновения             КАК ДатаВозникновения,
				|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоСрокам.ДокументРегистратор)
				|						В (ТИП(Документ.КорректировкаРеализации),
				|						   ТИП(Документ.КорректировкаПриобретения))
				|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
				|			ИНАЧЕ РасчетыПоСрокам.ХозяйственнаяОперация
				|		КОНЕЦ                                         КАК ХозяйственнаяОперация,
				|		РасчетыПоСрокам.ДокументРегистратор           КАК ДокументРегистратор,
				|		
				|		РасчетыПоСрокам.Предоплата                    КАК Предоплата,
				|		РасчетыПоСрокам.ПредоплатаРегл                КАК ПредоплатаРегл,
				|		РасчетыПоСрокам.ПредоплатаУпр                 КАК ПредоплатаУпр,
				|		РасчетыПоСрокам.Долг                          КАК Долг,
				|		РасчетыПоСрокам.ДолгРегл                      КАК ДолгРегл,
				|		РасчетыПоСрокам.ДолгУпр                       КАК ДолгУпр
				|		
				|	ИЗ
				|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
				|	ГДЕ
				|		РасчетыПоСрокам.Активность
				|		И РасчетыПоСрокам.ОбъектРасчетов = &ОбъектРасчетов
				|		И РасчетыПоСрокам.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
				|		И РасчетыПоСрокам.Период >= &ПериодКонтроляИзмененийИСозданияЗаданий
				|		И НЕ РасчетыПоСрокам.ДокументРегистратор ССЫЛКА Документ.КорректировкаРегистров
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ДвиженияПосле.Период                        КАК Период,
				|		ДвиженияПосле.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
				|		ДвиженияПосле.ОбъектРасчетов                КАК ОбъектРасчетов,
				|		ДвиженияПосле.Валюта                        КАК Валюта,
				|		ДвиженияПосле.РасчетныйДокумент             КАК РасчетныйДокумент,
				|		ВЫБОР КОГДА ДвиженияПосле.Предоплата <> 0 
				|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
				|			ИНАЧЕ ДвиженияПосле.ДатаПлановогоПогашения
				|		КОНЕЦ                                       КАК ДатаПлановогоПогашения,
				|		ДвиженияПосле.ДатаВозникновения             КАК ДатаВозникновения,
				|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДвиженияПосле.ДокументРегистратор)
				|						В (ТИП(Документ.КорректировкаРеализации),
				|						   ТИП(Документ.КорректировкаПриобретения))
				|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
				|			ИНАЧЕ ДвиженияПосле.ХозяйственнаяОперация
				|		КОНЕЦ                                       КАК ХозяйственнаяОперация,
				|		ДвиженияПосле.ДокументРегистратор           КАК ДокументРегистратор,
				|		
				|		-ДвиженияПосле.Предоплата                    КАК Предоплата,
				|		-ДвиженияПосле.ПредоплатаРегл                КАК ПредоплатаРегл,
				|		-ДвиженияПосле.ПредоплатаУпр                 КАК ПредоплатаУпр,
				|		-ДвиженияПосле.Долг                          КАК Долг,
				|		-ДвиженияПосле.ДолгРегл                      КАК ДолгРегл,
				|		-ДвиженияПосле.ДолгУпр                       КАК ДолгУпр
				|	ИЗ
				|		ВтДвиженияПосле КАК ДвиженияПосле
				|	ГДЕ
				|		ДвиженияПосле.Период >= &ПериодКонтроляИзмененийИСозданияЗаданий) КАК ВложенныйЗапрос
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.Период,
				|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
				|	ВложенныйЗапрос.ОбъектРасчетов,
				|	ВложенныйЗапрос.Валюта,
				|	ВложенныйЗапрос.РасчетныйДокумент,
				|	ВложенныйЗапрос.ДатаПлановогоПогашения,
				|	ВложенныйЗапрос.ДатаВозникновения,
				|	ВложенныйЗапрос.ХозяйственнаяОперация,
				|	ВложенныйЗапрос.ДокументРегистратор
				|ИМЕЮЩИЕ
				|	СУММА(ВложенныйЗапрос.Предоплата) <> 0
				|	ИЛИ СУММА(ВложенныйЗапрос.ПредоплатаРегл) <> 0
				|	ИЛИ СУММА(ВложенныйЗапрос.ПредоплатаУпр) <> 0
				|	ИЛИ СУММА(ВложенныйЗапрос.Долг) <> 0
				|	ИЛИ СУММА(ВложенныйЗапрос.ДолгРегл) <> 0
				|	ИЛИ СУММА(ВложенныйЗапрос.ДолгУпр) <> 0";
				
				Если НЕ ТекущиеПеременные.ЭтоРасчетыСКлиентами Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст,
						"РегистрНакопления.РасчетыСКлиентамиПоСрокам",
						"РегистрНакопления.РасчетыСПоставщикамиПоСрокам");
					Запрос.Текст = СтрЗаменить(Запрос.Текст,
						"ТаблицаИзмененийРасчетыСКлиентамиПоСрокам",
						"ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам");
				КонецЕсли;
				
				РасчетыДляПроверки = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Скопировать(Новый Структура("ЗаписьДоНачалаРасчета",Ложь));
				
				Запрос.УстановитьПараметр("ТаблицаПоСрокам", РасчетыДляПроверки);
				Запрос.УстановитьПараметр("МассивЗадействованныхРегистраторов",
					ТекущиеПеременные["МассивЗадействованныхРегистраторов"
						+ ?(ТекущиеПеременные.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом,"РасчетыСКлиентамиПоСрокам","РасчетыСПоставщикамиПоСрокам")]);
						
				Если ЗначениеЗаполнено(ТекущиеПеременные.ПериодКонтроляИзмененийИСозданияЗаданий) Тогда
					Запрос.УстановитьПараметр("ПериодКонтроляИзмененийИСозданияЗаданий", ТекущиеПеременные.ПериодКонтроляИзмененийИСозданияЗаданий);
				Иначе
					Запрос.УстановитьПараметр("ПериодКонтроляИзмененийИСозданияЗаданий", ТекущиеПеременные.ДатаНачалаПересчета);
				КонецЕсли;
				
				Запрос.Выполнить();
				
				Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
					РегистрыСведений.ЗаданияКРаспределениюВзаиморасчетов.СоздатьЗаданияНеоперативнойОчередиПриИзмененииРасчетовПоСрокам(
						Запрос.МенеджерВременныхТаблиц, ТекущиеПеременные.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
				КонецЕсли;
				
				Если ТекущиеПеременные.ЭтоРасчетыСКлиентами Тогда
					
					ТекстАктуализацииОтражения =
					"ВЫБРАТЬ
					|	ТаблицаИзменений.ДокументРегистратор КАК Регистратор
					|ИЗ
					|	ТаблицаИзмененийРасчетыСКлиентамиПоСрокам КАК ТаблицаИзменений
					|СГРУППИРОВАТЬ ПО
					|	ТаблицаИзменений.ДокументРегистратор";
							
						
					Запрос.Текст = ТекстАктуализацииОтражения;
					
					ТаблицаИзменений = Запрос.Выполнить().Выгрузить();
					
					#Область ПроверкаДатыЗапрета
					
					ЗапросПроверкиДатыЗапрета = Новый Запрос("
					|ВЫБРАТЬ
					|	ЕСТЬNULL(МИНИМУМ(ТаблицаИзменений.Период),ДАТАВРЕМЯ(3999,1,1)) КАК Период
					|ИЗ
					|	ТаблицаИзмененийРасчетыСКлиентамиПоСрокам КАК ТаблицаИзменений
					|СГРУППИРОВАТЬ ПО
					|	ЕСТЬNULL(ТаблицаИзменений.ОбъектРасчетов.Организация, НЕОПРЕДЕЛЕНО)");
					
					ЗапросПроверкиДатыЗапрета.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
					ВыборкаМинимальногоПериода = ЗапросПроверкиДатыЗапрета.Выполнить().Выбрать();
					ДанныеДляПроверки = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
					Пока ВыборкаМинимальногоПериода.Следующий() Цикл
						НоваяСтрока = ДанныеДляПроверки.Добавить();
						НоваяСтрока.Дата   = НачалоДня(ВыборкаМинимальногоПериода.Период);
						НоваяСтрока.Объект = СтрокаОсновныхПараметровРасчета.Организация;
						НоваяСтрока.Раздел = "ФинансовыйКонтур";
					КонецЦикла;
					
					ОписаниеОшибки = НСтр("ru = 'Изменяемые данные взаиморасчетов находятся в закрытом периоде.'");
					
					Если ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ДанныеДляПроверки, НаборЗаписейПоСрокам) Тогда
						ВызватьИсключение ОписаниеОшибки;
					КонецЕсли;
					#КонецОбласти
					
	
					
					Запрос.Текст =
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	НАЧАЛОПЕРИОДА(Изменения.Период, МЕСЯЦ)         КАК Период,
					|	Изменения.РасчетныйДокумент                    КАК Документ,
					|	Изменения.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент
					|ИЗ
					|	ТаблицаИзмененийРасчетыСКлиентамиПоСрокам КАК Изменения";
					
					ИзмененияНДСУП = Запрос.Выполнить().Выгрузить();
					
					ЭмуляцияДокумента = ПроведениеДокументов.ЭмуляцияДокумента(Неопределено, Неопределено);
					ЭмуляцияДокумента.ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента =
						Новый Структура(ЭмуляцияДокумента.ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента);
					ЭмуляцияДокумента.ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента.РежимЗаписи = РежимЗаписиДокумента.Проведение;
					ЗакрытиеМесяцаСервер.ОтразитьЗаданияКЗакрытиюМесяца(ЭмуляцияДокумента, Запрос.МенеджерВременныхТаблиц);
					
				Иначе
					
					ТекстАктуализацииОтражения =
					"ВЫБРАТЬ
					|	ТаблицаИзменений.ДокументРегистратор КАК Регистратор
					|ИЗ
					|	ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам КАК ТаблицаИзменений
					|СГРУППИРОВАТЬ ПО
					|	ТаблицаИзменений.ДокументРегистратор";
					
						
					Запрос.Текст = ТекстАктуализацииОтражения;
						
					ТаблицаИзменений = Запрос.Выполнить().Выгрузить();
					
					#Область ПроверкаДатыЗапрета
					
					ЗапросПроверкиДатыЗапрета = Новый Запрос("ВЫБРАТЬ
					|	ЕСТЬNULL(МИНИМУМ(ТаблицаИзменений.Период), ДАТАВРЕМЯ(3999, 1, 1)) КАК Период
					|ИЗ
					|	ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам КАК ТаблицаИзменений
					|СГРУППИРОВАТЬ ПО
					|	ЕСТЬNULL(ТаблицаИзменений.ОбъектРасчетов.Организация, НЕОПРЕДЕЛЕНО)");
					
					ЗапросПроверкиДатыЗапрета.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
					ВыборкаМинимальногоПериода = ЗапросПроверкиДатыЗапрета.Выполнить().Выбрать();
					ДанныеДляПроверки = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
					
					Пока ВыборкаМинимальногоПериода.Следующий() Цикл
						НоваяСтрока = ДанныеДляПроверки.Добавить();
						НоваяСтрока.Дата = НачалоДня(ВыборкаМинимальногоПериода.Период);
						НоваяСтрока.Объект = СтрокаОсновныхПараметровРасчета.Организация;
						НоваяСтрока.Раздел = "ФинансовыйКонтур";
					КонецЦикла;
					ОписаниеОшибки = НСтр("ru = 'Изменяемые данные взаиморасчетов находятся в закрытом периоде.'");
					Если ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ДанныеДляПроверки, НаборЗаписейПоСрокам) Тогда
						ВызватьИсключение ОписаниеОшибки;
					КонецЕсли;
					#КонецОбласти
					
	
					Запрос.Текст =
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	НАЧАЛОПЕРИОДА(Изменения.Период, МЕСЯЦ)         КАК Период,
					|	Изменения.ДокументРегистратор                          КАК Документ,
					|	Изменения.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент
					|ИЗ
					|	ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам КАК Изменения
					|
					|ОБЪЕДИНИТЬ
					|
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	НАЧАЛОПЕРИОДА(Изменения.Период, МЕСЯЦ)         КАК Период,
					|	Изменения.РасчетныйДокумент                    КАК Документ,
					|	Изменения.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент
					|ИЗ
					|	ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам КАК Изменения";
					
					ИзмененияНДСУП = Запрос.Выполнить().Выгрузить();
					
					ЭмуляцияДокумента = ПроведениеДокументов.ЭмуляцияДокумента(Неопределено, Неопределено);
					ЭмуляцияДокумента.ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента =
						Новый Структура(ЭмуляцияДокумента.ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента);
					ЭмуляцияДокумента.ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента.РежимЗаписи = РежимЗаписиДокумента.Проведение;
					ЗакрытиеМесяцаСервер.ОтразитьЗаданияКЗакрытиюМесяца(ЭмуляцияДокумента, Запрос.МенеджерВременныхТаблиц);
					
				КонецЕсли;
				
				РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос, "ВтДвиженияПосле");
		
			КонецЕсли;
			
			#КонецОбласти
			
			ЗаписатьПорционно(ТекущиеПеременные, ТекущиеПеременные.ТаблицаРасчетовПоСрокам, НаборЗаписейПоСрокам);
			
			Если ТекущиеПеременные.ПериодКонтроляИзмененийИСозданияЗаданий < Дата(3000,1,1) Тогда
				Если ТекущиеПеременные.ЭтоРасчетыСКлиентами Тогда
					УчетНДСУП.ОтразитьВУчетеНДСИзменениеРасчетовСКлиентами(ИзмененияНДСУП);
					// Уничтожаем временную таблицу изменений, т.к. могут записываться разные наборы записей с одним менеджером запросов.
					РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос, "ТаблицаИзмененийРасчетыСКлиентамиПоСрокам");
				Иначе
					УчетНДСУП.ОтразитьВУчетеНДСИзменениеРасчетовСПоставщиками(ИзмененияНДСУП);
					// Уничтожаем временную таблицу изменений, т.к. могут записываться разные наборы записей с одним менеджером запросов.
					РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос, "ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам");
				КонецЕсли;
			КонецЕсли;
			
			КонецЕсли;
			
			Если ТаблицаИзменений <> Неопределено И ТаблицаИзменений.Количество() > 0 Тогда
				ВзаиморасчетыСлужебный.УдалитьСистемныеКорректировкиРегистров(ТекущиеПеременные.ДатаНачалаПересчета, ТекущиеПеременные.Организация,, ТекущиеПеременные.Контрагент);
			КонецЕсли;
		
		Если ГлобальныеПеременные.ЗаписыватьИзменения Тогда
		
			//Приходные движения пишутся непосредственно документами
			ТаблицаПланОплат = ТекущиеПеременные.ТаблицаПланОплат.Скопировать(Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход));
			ТаблицаПланОплат.Свернуть("Период, Регистратор, ВидДвижения, АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, ДокументРегистратор,
					|ДокументПлан, ДатаПлановогоПогашения, ДатаВозникновения, ВариантОплаты, ПорядокОперации, НераспределенныйАванс,ДокументОплаты",
					"КОплате");
			
			ТаблицаПланОплат.ЗаполнитьЗначения(ТекущиеПеременные.АналитикаУчетаПоПартнерам, "АналитикаУчетаПоПартнерам");
			ТаблицаПланОплат.ЗаполнитьЗначения(ТекущиеПеременные.ОбъектРасчетов,            "ОбъектРасчетов");
			ТаблицаПланОплат.ЗаполнитьЗначения(ТекущиеПеременные.Валюта,            "Валюта");
			ТаблицаПланОплат.Индексы.Добавить("Регистратор");
		
			ПодготовитьДанныеДляЗаписи(ТекущиеПеременные, ТаблицаПланОплат, НаборЗаписейПланОплат, ТаблицаРегистраторов);
			ЗаписатьПорционно(ТекущиеПеременные, ТаблицаПланОплат, НаборЗаписейПланОплат);
			
		КонецЕсли;
		
		Если ГлобальныеПеременные.ЗаписыватьИзменения Тогда
			
			ТаблицаПланОтгрузокПоставок = ТаблицаПланОтгрузокПоставок.Скопировать(Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход));
			
			ТаблицаПланОтгрузокПоставок.ЗаполнитьЗначения(ТекущиеПеременные.АналитикаУчетаПоПартнерам, "АналитикаУчетаПоПартнерам");
			ТаблицаПланОтгрузокПоставок.ЗаполнитьЗначения(ТекущиеПеременные.ОбъектРасчетов,            "ОбъектРасчетов");
			ТаблицаПланОтгрузокПоставок.ЗаполнитьЗначения(ТекущиеПеременные.Валюта,            "Валюта");
			ТаблицаПланОтгрузокПоставок.Индексы.Добавить("Регистратор");
		
			ПодготовитьДанныеДляЗаписи(ТекущиеПеременные, ТаблицаПланОтгрузокПоставок, НаборЗаписейПланОтгрузокПоставок, ТаблицаРегистраторов);
			ЗаписатьПорционно(ТекущиеПеременные, ТаблицаПланОтгрузокПоставок, НаборЗаписейПланОтгрузокПоставок);
			
		КонецЕсли;
		
		Если ПланыОбмена.ГлавныйУзел() = Неопределено И НЕ ГлобальныеПеременные.ТолькоПлановыеРасчеты И ГлобальныеПеременные.ЗаписыватьИзменения Тогда
			УдалитьНеиспользуемыеРегистраторыРасчетов(Запрос, ИмяРегистраРасчетов, ИмяРегистраПланаОплат, ИмяРегистраПланаОтгрузкиПоставки);
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЦикла;
	
	//Используется для исправления остатков
	Если ОсновныеПараметры.Свойство("РасчетныеДвижения") И ДополненнаяТаблицаКРаспределению.Количество() = 1 Тогда
		
		Если ГлобальныеПеременные.ЭтоРасчетыСКлиентами Тогда
			ИмяРегистра = "РасчетыСКлиентамиПоСрокам";
		Иначе 
			ИмяРегистра = "РасчетыСПоставщикамиПоСрокам";
		КонецЕсли;
		ОсновныеПараметры.РасчетныеДвижения.Вставить(
			ИмяРегистра,
			ТекущиеПеременные.ТаблицаРасчетовПоСрокам);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывает перераспределение взаиморасчетов по таблице кортежей. Дополняет приемниками при необходимости и распределяет по порциям, 
// если нужен последовательный пересчет разных объектов расчетов. 
//	
// Параметры:
//	ПараметрыРаспределения - см. ПараметрыРаспределенияРасчетов
//	ИсходнаяТаблицаКРаспределению - ТаблицаЗначений:
//		* ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами 
//		* АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам
//		* ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов
//		* Валюта - СправочникСсылка.Валюты
//		* ДатаНачалаПересчета - Дата - Минимальный период изменений или начала пересчета
//		* ПериодКонтроляИзмененийИСозданияЗаданий - Дата - Дата, начиная с которой требуется проверка изменений и создание дочерних заданий.
//
//		* АналитикаУчетаПоПартнерамПриемник - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам
//		* ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов
//		* ВалютаПриемник - СправочникСсылка.Валюты
//		* ПоДаннымОбъектаРасчетовИсточника - Булево
//		* Документ - ДокументСсылка - Регистратор движений взаиморасчетов.
//
Процедура ЗаполнитьОперативныеВзаиморасчетыПоТаблице(ПараметрыРаспределения, ИсходнаяТаблицаКРаспределению) Экспорт
	
	Если ИсходнаяТаблицаКРаспределению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПараметрыРаспределения.ДополнитьРаспределитьПриемники Тогда
		
		ТаблицаКРаспределению = ТаблицаКРаспределению();
		
		Поля = "ТипРасчетов,АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта";
		ОтборКортежей = Новый Структура(Поля);
		
		Кортежи = ИсходнаяТаблицаКРаспределению.Скопировать();
		Кортежи.Свернуть(Поля);
		Для Каждого Кортеж Из Кортежи Цикл
			СтрокаКРаспределению = ТаблицаКРаспределению.Добавить();
			СтрокаКРаспределению.ТипРасчетов = Кортеж.ТипРасчетов;
			СтрокаКРаспределению.АналитикаУчетаПоПартнерам = Кортеж.АналитикаУчетаПоПартнерам;
			СтрокаКРаспределению.ОбъектРасчетов = Кортеж.ОбъектРасчетов;
			СтрокаКРаспределению.Валюта = Кортеж.Валюта;
			
			ЗаполнитьЗначенияСвойств(ОтборКортежей, Кортеж);
			СтрокиКортежа = ИсходнаяТаблицаКРаспределению.НайтиСтроки(ОтборКортежей);
			Для Каждого СтрокаКортежа Из СтрокиКортежа Цикл
				Если ЗначениеЗаполнено(СтрокаКРаспределению.ДатаНачалаПересчета) Тогда
					СтрокаКРаспределению.ДатаНачалаПересчета = Мин(СтрокаКортежа.ДатаНачалаПересчета, СтрокаКРаспределению.ДатаНачалаПересчета);
				Иначе
					СтрокаКРаспределению.ДатаНачалаПересчета = СтрокаКортежа.ДатаНачалаПересчета;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаКРаспределению.ПериодКонтроляИзмененийИСозданияЗаданий) Тогда
					СтрокаКРаспределению.ПериодКонтроляИзмененийИСозданияЗаданий = Мин(СтрокаКортежа.ПериодКонтроляИзмененийИСозданияЗаданий, СтрокаКРаспределению.ПериодКонтроляИзмененийИСозданияЗаданий);
				Иначе
					СтрокаКРаспределению.ПериодКонтроляИзмененийИСозданияЗаданий = СтрокаКортежа.ПериодКонтроляИзмененийИСозданияЗаданий;
				КонецЕсли;

			КонецЦикла;
		КонецЦикла;
		
		ЗаполнитьОперативныеВзаиморасчеты(ПараметрыРаспределения, ТаблицаКРаспределению);
	Иначе
		// Ищем все зависимые объекты расчетов, затрагиваемые перераспределением текущих и добавляем в общую таблицу
		ТаблицаСвязей = ТаблицаСвязейИсточниковПриемников(ИсходнаяТаблицаКРаспределению);
		ТаблицаСвязей.Сортировать("ПорядокОперации, ПоДаннымОбъектаРасчетовИсточника");
		
		// Разделим все строки на порции: распределение каждой следующей порции зависит от распределения предыдущей
		ТаблицаСвязей.Колонки.Добавить("НомерПорции", Новый ОписаниеТипов("Число"));
		// Для заполнения регистра заданий обязательно нужен документ
		ТаблицаСвязей.Колонки.Добавить("ДокументИсточник", Документы.ТипВсеСсылки());
		ТаблицаСвязей.Индексы.Добавить("АналитикаУчетаПоПартнерамПриемник, ОбъектРасчетовПриемник, ВалютаПриемник");
		ОтборПриемников = Новый Структура("АналитикаУчетаПоПартнерамПриемник, ОбъектРасчетовПриемник, ВалютаПриемник");
		
		МаксимальныйНомерПорции = 0;
		Для Каждого СтрокаКРаспределению Из ТаблицаСвязей Цикл
			
			ОтборПриемников.АналитикаУчетаПоПартнерамПриемник = СтрокаКРаспределению.АналитикаУчетаПоПартнерам;
			ОтборПриемников.ОбъектРасчетовПриемник = СтрокаКРаспределению.ОбъектРасчетов;
			ОтборПриемников.ВалютаПриемник = СтрокаКРаспределению.Валюта;
			
			СтрокиИсточники = ТаблицаСвязей.НайтиСтроки(ОтборПриемников);
			
			Для Каждого СтрокаИсточник Из СтрокиИсточники Цикл
				// СтрокаКРаспределению - это приемник найденной строки и должен распределиться в следующей порции если имеет тот же или поздний день
				Если СтрокаИсточник.ПорядокОперации <= СтрокаКРаспределению.ПорядокОперации
					И СтрокаКРаспределению.НомерПорции <= СтрокаИсточник.НомерПорции Тогда
					СтрокаКРаспределению.НомерПорции = СтрокаИсточник.НомерПорции + 1;
					// Запишем регистратор, инициировавший увеличение порции, для записи заданий.
					СтрокаКРаспределению.ДокументИсточник = СтрокаИсточник.Регистратор;
					МаксимальныйНомерПорции = Макс(МаксимальныйНомерПорции, СтрокаКРаспределению.НомерПорции);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		ПоляПорции = "НомерПорции,АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта";
		ТаблицаСвязей.Индексы.Добавить(ПоляПорции);
		ОтборПорции = Новый Структура(ПоляПорции);
		
		КортежиТаблицыИзменений = ТаблицаСвязей.Скопировать(, "НомерПорции,АналитикаУчетаПоПартнерам,Организация,ОбъектРасчетов,Валюта,ТипРасчетов,ДокументИсточник");
		КортежиТаблицыИзменений.Свернуть("НомерПорции,АналитикаУчетаПоПартнерам,Организация,ОбъектРасчетов,Валюта,ТипРасчетов,ДокументИсточник");
		КортежиТаблицыИзменений.Индексы.Добавить("НомерПорции");
		
		// Нужна для распределения всех связанных кортежей в течение одного дня, чтобы повторно не регистировать задания.
		МинимальнаяДатаНачалаПересчетаНулевойПорции = Дата(3999, 1, 1);
		Для Каждого СтрокаКРаспределению Из ТаблицаСвязей Цикл
			Если СтрокаКРаспределению.НомерПорции = 0 Тогда
				МинимальнаяДатаНачалаПересчетаНулевойПорции = Мин(МинимальнаяДатаНачалаПересчетаНулевойПорции, СтрокаКРаспределению.ДатаНачалаПересчета);
			КонецЕсли;
		КонецЦикла;
		
		// Если нужно регистрировать задания, то распределим все порции, имеющие связи в течение первого дня нулевой порции
		Если ПараметрыРаспределения.РегистрироватьЗаданияПоПриемникам Тогда
			КоличествоПорцийКОбработке = 0;
			Для Каждого СтрокаКРаспределению Из ТаблицаСвязей Цикл
				Если СтрокаКРаспределению.ДатаНачалаПересчета <= МинимальнаяДатаНачалаПересчетаНулевойПорции
					И СтрокаКРаспределению.НомерПорции >= КоличествоПорцийКОбработке Тогда
					КоличествоПорцийКОбработке = СтрокаКРаспределению.НомерПорции + 1;
				КонецЕсли;
			КонецЦикла;
		Иначе
			// Распределим все порции
			КоличествоПорцийКОбработке = МаксимальныйНомерПорции + 1;
		КонецЕсли;
		
		// Выполним по порядку распределение каждой порции
		Для НомерПорции = 0 По МаксимальныйНомерПорции Цикл
			
			СтрокиКортежей = КортежиТаблицыИзменений.Скопировать(Новый Структура("НомерПорции", НомерПорции));
			
			Если КоличествоПорцийКОбработке > 0 Тогда
				
				СтрокиКортежей.Свернуть("НомерПорции,АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта,ТипРасчетов");
				ТаблицаКРаспределениюПорции = ТаблицаКРаспределению();
				
				Для Каждого СтрокаКортежа Из СтрокиКортежей Цикл
					
					СтрокаОсновныхПараметровРасчета = ТаблицаКРаспределениюПорции.Добавить();
					
					// Заполняем ключевые поля - аналитика учета по партнерам, объект расчетов, валюта и тип расчетов
					ЗаполнитьЗначенияСвойств(СтрокаОсновныхПараметровРасчета, СтрокаКортежа);
					
					// Ищем минимальную дату начала пересчета и период контроля изменений среди исходных данных
					ЗаполнитьЗначенияСвойств(ОтборПорции, СтрокаКортежа);
					ИсходныеСтроки = ТаблицаСвязей.НайтиСтроки(ОтборПорции);
					Если ИсходныеСтроки.Количество() = 0 Тогда
						ВызватьИсключение(НСтр("ru = 'Не найдены исходные строки при определении даты начала пересчета.'"));
					КонецЕсли;
					Для Каждого СтрокаИзменений Из ИсходныеСтроки Цикл
						
						Если ЗначениеЗаполнено(СтрокаОсновныхПараметровРасчета.ДатаНачалаПересчета) Тогда
							СтрокаОсновныхПараметровРасчета.ДатаНачалаПересчета = Мин(СтрокаИзменений.ДатаНачалаПересчета, СтрокаОсновныхПараметровРасчета.ДатаНачалаПересчета);
						Иначе
							СтрокаОсновныхПараметровРасчета.ДатаНачалаПересчета = СтрокаИзменений.ДатаНачалаПересчета;
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СтрокаОсновныхПараметровРасчета.ПериодКонтроляИзмененийИСозданияЗаданий) Тогда
							СтрокаОсновныхПараметровРасчета.ПериодКонтроляИзмененийИСозданияЗаданий = 
								Мин(СтрокаОсновныхПараметровРасчета.ПериодКонтроляИзмененийИСозданияЗаданий, СтрокаИзменений.ПериодКонтроляИзмененийИСозданияЗаданий);
						Иначе
							СтрокаОсновныхПараметровРасчета.ПериодКонтроляИзмененийИСозданияЗаданий = СтрокаИзменений.ПериодКонтроляИзмененийИСозданияЗаданий;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
				ЗаполнитьОперативныеВзаиморасчеты(ПараметрыРаспределения, ТаблицаКРаспределениюПорции);
				
			Иначе
				
				ТаблицаКРегистрацииЗаданий = РегистрыСведений.ЗаданияКРаспределениюВзаиморасчетов.ТаблицаФормированияЗаданий();
				
				Для Каждого СтрокаКортежа Из СтрокиКортежей Цикл
					
					СтрокаЗадания = ТаблицаКРегистрацииЗаданий.Добавить();
					
					СтрокаЗадания.Организация               = СтрокаКортежа.Организация;
					СтрокаЗадания.Документ                  = СтрокаКортежа.ДокументИсточник;
					СтрокаЗадания.АналитикаУчетаПоПартнерам = СтрокаКортежа.АналитикаУчетаПоПартнерам;
					СтрокаЗадания.ОбъектРасчетов            = СтрокаКортежа.ОбъектРасчетов;
					СтрокаЗадания.Валюта                    = СтрокаКортежа.Валюта;
					
					// Ищем минимальную дату начала пересчета и период контроля изменений среди исходных данных
					ЗаполнитьЗначенияСвойств(ОтборПорции, СтрокаКортежа);
					ИсходныеСтроки = ТаблицаСвязей.НайтиСтроки(ОтборПорции);
					Если ИсходныеСтроки.Количество() = 0 Тогда
						ВызватьИсключение(НСтр("ru = 'Не найдены исходные строки при определении даты начала пересчета.'"));
					КонецЕсли;
					Для Каждого СтрокаИзменений Из ИсходныеСтроки Цикл
						
						Если ЗначениеЗаполнено(СтрокаЗадания.ПериодЗадания) Тогда
							СтрокаЗадания.ПериодЗадания = Мин(СтрокаИзменений.ДатаНачалаПересчета, СтрокаЗадания.ПериодЗадания);
						Иначе
							СтрокаЗадания.ПериодЗадания = СтрокаИзменений.ДатаНачалаПересчета;
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СтрокаЗадания.ПериодКонтроляИзменений) Тогда
							СтрокаЗадания.ПериодКонтроляИзменений = 
								Мин(СтрокаЗадания.ПериодКонтроляИзменений, СтрокаИзменений.ПериодКонтроляИзмененийИСозданияЗаданий);
						Иначе
							СтрокаЗадания.ПериодКонтроляИзменений = СтрокаИзменений.ПериодКонтроляИзмененийИСозданияЗаданий;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
				РегистрыСведений.ЗаданияКРаспределениюВзаиморасчетов.СоздатьЗаданияПоДаннымТаблицыЗначений(ТаблицаКРегистрацииЗаданий);
				
				// Регистрируем только 1 порцию приемников.
				Прервать;
				
			КонецЕсли;
			
			КоличествоПорцийКОбработке = КоличествоПорцийКОбработке - 1;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Устарела. Пересчитывает все курсовые разницы за указанный период.
//
// Параметры:
//	МассивОрганизаций - Массив из СправочникСсылка.Организации- Перечень организаций по которым необходимо выполнить переоценку.
//	НачалоПериода - Дата - Начало периода пересчета курсовых разниц.
//	КонецПериода - Дата - Конец периода пересчета курсовых разниц.
//  Параметры - см. ПараметрыПереоценки
//
Процедура ВыполнитьПереоценкуЗаПериод(МассивОрганизаций, Знач НачалоПериода, Знач КонецПериода, Параметры) Экспорт
	
	ВзаиморасчетыПереоценкаСервер.ВыполнитьПереоценкуЗаПериод(МассивОрганизаций, НачалоПериода, КонецПериода, Параметры);
	
КонецПроцедуры

// Устарела. Добавляет записи переоценки на одну дату.
//
// Параметры:
//	МассивОрганизаций - Массив из СправочникСсылка.Организации - Перечень организаций по которым необходимо выполнить переоценку.
//	Период - Дата - Дата, на конец которой необходимо выполнить переоценку.
//  Параметры - см. ПараметрыПереоценки 
//
Процедура ВыполнитьПереоценкуНаДату(МассивОрганизаций, Период, Параметры) Экспорт
	
	ВзаиморасчетыПереоценкаСервер.ВыполнитьПереоценкуНаДату(МассивОрганизаций, Период, Параметры);
	
КонецПроцедуры

//Возвращает строковый порядок документа по переданным параметрам.
// 
// Параметры:
// 	Дата - Дата - Дата по которой нужно сделать строковый порядок.
// 	Номер - Строка - Номер документа.
// 	ТипДокумента - Тип - Тип ссылки документа.
// 	ВидОперацииДляСортировки - Строка - вид операции при порядке зачета "По виду документа"
// 	ТипСтрокой - Строка - см. НомерТипа.
// 	ПорядокОперацииВПределахДокумента - Строка - номер операция в пределах одного регистратора.
// Возвращаемое значение:
// 	Строка - Описание
Функция Порядок(Дата, Номер, ТипДокумента, ВидОперацииДляСортировки, ТипСтрокой = Неопределено, ПорядокОперацииВПределахДокумента = "1") Экспорт
	Если НЕ ЗначениеЗаполнено(Дата) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	ДатаСтрокой = Формат(Дата, "ДФ=yyyyMMddHHmmss");
	Если ТипСтрокой = Неопределено Тогда
		ТипСтрокой = НомерТипа(ТипДокумента);
	КонецЕсли;
	Возврат Лев(ДатаСтрокой, 8) + ВидОперацииДляСортировки + Прав(ДатаСтрокой, 6) + ТипСтрокой + Номер + ПорядокОперацииВПределахДокумента;
КонецФункции

// Возвращает структуру параметров, необходимых для заполнения регистров взаиморасчетов.
// 
// Возвращаемое значение:
//  Структура - Структура параметров заполнения взаиморасчетов:
// * ТолькоПлановыеРасчеты - Булево - Истина, если нужно посчитать все, но записать только плановые расчеты. 
// 			Используется для добавления в таблицу контроля изменений при отмене проведения и для исключения из возвращения к отражению по регл. и мсфо.
// * ЗаписыватьИзменения - Булево - Ложь, если требуется получить таблицу сформированных движений без записи изменений.
// * ДополнитьРаспределитьПриемники - Булево - Признак того, что таблицы к распределению необходимо рекурсивно дополнить приемниками.
// * РегистрироватьЗаданияПоПриемникам - Булево - Нужно, чтобы в текущем вызове распределить минимальное количество порций, 
// 						а по приемникам зарегистрировать задания к отложенному распределению взаиморасчетов.
Функция ПараметрыРаспределенияРасчетов() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("ТолькоПлановыеРасчеты", Ложь);
	Структура.Вставить("ЗаписыватьИзменения", Истина);
	Структура.Вставить("ДополнитьРаспределитьПриемники", Ложь);
	Структура.Вставить("РегистрироватьЗаданияПоПриемникам", Ложь);
	
	Возврат Структура;
	
КонецФункции

// Таблица к распределению.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица к распределению:
// * ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами - Тип расчетов - с клиентами или с поставщиками, для определения того какой регистр пересчитывать.
// * АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика к пересчету.
// * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов к пересчету
// * Валюта - СправочникСсылка.Валюты - Валюта взаиморасчетов к пересчету
// * ДатаНачалаПересчета - Дата - Дата начала пересчета, будет приведена к началу дня.
// * ПериодКонтроляИзмененийИСозданияЗаданий - Дата - Дата, начаная с которой требуется выполнять контроль изменений и создавать дочерние задания.
Функция ТаблицаКРаспределению() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ТипРасчетов", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыРасчетовСПартнерами"));
	Таблица.Колонки.Добавить("АналитикаУчетаПоПартнерам", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам"));
	Таблица.Колонки.Добавить("ОбъектРасчетов", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
	Таблица.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Таблица.Колонки.Добавить("ДатаНачалаПересчета", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Таблица.Колонки.Добавить("ПериодКонтроляИзмененийИСозданияЗаданий", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
	Возврат Таблица;
	
КонецФункции

#Область РегистраторыРасчетов

//Возвращает таблицу служебных документов РегистраторРасчетов для перезаписи по переданным параметрам.
//
// Параметры:
//	ТекущиеПеременные - Структура - Описание:
//		* ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов.
//		* АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика взаиморасчетов.
//		* Валюта - СправочникСсылка.Валюты - Валюта взаиморасчетов.
//		* ЭтоРасчетыСКлиентами - Булево - это расчеты с клиентами, а не с поставщиками.
//		* Организация - СправочникСсылка.Организации - Организация расчета.
//	ИмяТаблицы - Строка - Имя регистра накопления, по которому определятся свободный регистратор или нет.
//	КоличествоЗаписей - Число - Количество записей для последующей записи в регистр.
//	ТаблицаСвободныхРегистраторов - см. ТаблицаСвободныхРегистраторовРасчета.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица со следующими колонками:
//		* Ссылка - ДокументСсылка.РегистраторРасчетов - найденный служебный документ;
//		* ТребуетсяОчистка - Булево - У данного документа есть движения в переданной таблице.
//
Функция СвободныеРегистраторыРасчетов(ТекущиеПеременные, ИмяТаблицы, КоличествоЗаписей, ТаблицаСвободныхРегистраторов)
	
	Если КоличествоЗаписей = 0 Тогда
		КоличествоРегистраторов = 0;
	Иначе
		КоличествоРегистраторов = Цел(КоличествоЗаписей/РазмерПорцииЗаписи()) + 1;
	КонецЕсли;
	
	ТаблицаДокументов = Новый ТаблицаЗначений();
	ТаблицаДокументов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.РегистраторРасчетов"));
	ТаблицаДокументов.Колонки.Добавить("ТребуетсяОчистка", Новый ОписаниеТипов("Булево"));
	
	ТипРасчетов = ?(ТекущиеПеременные.ЭтоРасчетыСКлиентами, Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом, Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
	
	СвободныеРегистраторы = ТаблицаСвободныхРегистраторов.НайтиСтроки(Новый Структура("ИмяТаблицы", ИмяТаблицы));
	
	Для Каждого СтрокаСвободныеРегистраторы Из СвободныеРегистраторы Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДокументов.Добавить(), СтрокаСвободныеРегистраторы);
	КонецЦикла;
	
	СписокТаблицРасчетовСПартнерами = Новый Массив;
	Если ТекущиеПеременные.ЭтоРасчетыСКлиентами Тогда
		СписокТаблицРасчетовСПартнерами.Добавить("РасчетыСКлиентамиПоСрокам");
		СписокТаблицРасчетовСПартнерами.Добавить("РасчетыСКлиентамиПланОплат");
		СписокТаблицРасчетовСПартнерами.Добавить("РасчетыСКлиентамиПланОтгрузок");
	Иначе
		СписокТаблицРасчетовСПартнерами.Добавить("РасчетыСПоставщикамиПоСрокам");
		СписокТаблицРасчетовСПартнерами.Добавить("РасчетыСПоставщикамиПланОплат");
		СписокТаблицРасчетовСПартнерами.Добавить("РасчетыСПоставщикамиПланПоставок");
	КонецЕсли;
	
	Пока ТаблицаДокументов.Количество() < КоличествоРегистраторов Цикл
		ДокументОбъект = Документы.РегистраторРасчетов.СоздатьДокумент();
		ДокументОбъект.Валюта = ТекущиеПеременные.Валюта;
		ДокументОбъект.АналитикаУчетаПоПартнерам = ТекущиеПеременные.АналитикаУчетаПоПартнерам;
		ДокументОбъект.Организация = ТекущиеПеременные.Организация;
		ДокументОбъект.ОбъектРасчетов = ТекущиеПеременные.ОбъектРасчетов;
		ДокументОбъект.ТипРасчетов = ТипРасчетов;
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		НовСтр = ТаблицаДокументов.Добавить();
		НовСтр.Ссылка = ДокументОбъект.Ссылка;
		НовСтр.ТребуетсяОчистка = Ложь;
		
		Для Каждого Таблица Из СписокТаблицРасчетовСПартнерами Цикл
			СвободныйРегистратор = ТаблицаСвободныхРегистраторов.Добавить();
			СвободныйРегистратор.ИмяТаблицы = Таблица;
			СвободныйРегистратор.Ссылка = ДокументОбъект.Ссылка;
			СвободныйРегистратор.ТребуетсяОчистка = Ложь;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаДокументов;
	
КонецФункции

// Таблица свободных регистраторов расчета.
// 
// Параметры:
//	ТекущиеПеременные - Структура - Описание:
//		* ОбъектРасчетов - ОпределяемыйТип.ОбъектРасчетов - Объект расчетов.
//		* АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика взаиморасчетов.
//		* Валюта - СправочникСсылка.Валюты - Валюта взаиморасчетов.
//		* ЭтоРасчетыСКлиентами - Булево - это расчеты с клиентами, а не с поставщиками.
//		* Организация - Неопределено, СправочникСсылка.Организации - Организация расчета.
//	ГлобальныеПеременные - Структура - Может содержать информацию о полных регистраторах расчетов, если такие имеются.
// 
// Возвращаемое значение:
//	ТаблицаЗначений - таблица со следующими колонками:
//		* ИмяТаблицы - Строка - Имя регистра накопления;
//		* Ссылка - ДокументСсылка.РегистраторРасчетов - найденный служебный документ;
//		* ТребуетсяОчистка - Булево - У данного документа есть движения в переданной таблице.
//
//  
Функция ТаблицаСвободныхРегистраторовРасчета(ТекущиеПеременные, ГлобальныеПеременные)
		
	Если ТекущиеПеременные.ЭтоРасчетыСКлиентами Тогда
		ТаблицаРасчетыПоСрокам             = "РасчетыСКлиентамиПоСрокам";
		ТаблицаРасчетыПланОплат            = "РасчетыСКлиентамиПланОплат";
		ТаблицаРасчетыПланОтгрузокПоставок = "РасчетыСКлиентамиПланОтгрузок";
	Иначе
		ТаблицаРасчетыПоСрокам             = "РасчетыСПоставщикамиПоСрокам";
		ТаблицаРасчетыПланОплат            = "РасчетыСПоставщикамиПланОплат";
		ТаблицаРасчетыПланОтгрузокПоставок = "РасчетыСПоставщикамиПланПоставок";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Валюта",                    ТекущиеПеременные.Валюта);
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", ТекущиеПеременные.АналитикаУчетаПоПартнерам);
	Запрос.УстановитьПараметр("ОбъектРасчетов",            ТекущиеПеременные.ОбъектРасчетов);
	Запрос.УстановитьПараметр("ТаблицаРасчетыПоСрокам",    ТаблицаРасчетыПоСрокам);
	Запрос.УстановитьПараметр("ТаблицаРасчетыПланОплат",   ТаблицаРасчетыПланОплат);
	Запрос.УстановитьПараметр("ТаблицаРасчетыПланОтгрузокПоставок", ТаблицаРасчетыПланОтгрузокПоставок);
	
	ПустойРегистраторРасчетов = Документы.РегистраторРасчетов.ПустаяСсылка();
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ГлобальныеПеременные,ТаблицаРасчетыПоСрокам + "Регистраторы") Тогда
		СписокПолныхРегистраторовРасчетыПоСрокам = ОбщегоНазначения.СкопироватьРекурсивно(ГлобальныеПеременные[ТаблицаРасчетыПоСрокам + "Регистраторы"]);
	Иначе
		СписокПолныхРегистраторовРасчетыПоСрокам = Новый Массив;
	КонецЕсли;
	СписокПолныхРегистраторовРасчетыПоСрокам.Добавить(ПустойРегистраторРасчетов);
	
	Запрос.УстановитьПараметр("СписокПолныхРегистраторовРасчетыПоСрокам", СписокПолныхРегистраторовРасчетыПоСрокам);
	
	СписокПолныхРегистраторовПоТаблицам = Новый Массив;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ГлобальныеПеременные, ТаблицаРасчетыПланОплат + "Регистраторы") Тогда
			СписокПолныхРегистраторовРасчетыПланОплат = ОбщегоНазначения.СкопироватьРекурсивно(ГлобальныеПеременные[ТаблицаРасчетыПланОплат + "Регистраторы"]);
		Иначе
			СписокПолныхРегистраторовРасчетыПланОплат = Новый Массив;
		КонецЕсли;
		СписокПолныхРегистраторовРасчетыПланОплат.Добавить(ПустойРегистраторРасчетов);
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ГлобальныеПеременные, ТаблицаРасчетыПланОтгрузокПоставок + "Регистраторы") Тогда
			СписокПолныхРегистраторовРасчетыПланОтгрузокПоставок = ОбщегоНазначения.СкопироватьРекурсивно(ГлобальныеПеременные[ТаблицаРасчетыПланОтгрузокПоставок + "Регистраторы"]);
		Иначе
			СписокПолныхРегистраторовРасчетыПланОтгрузокПоставок = Новый Массив;
		КонецЕсли;
		СписокПолныхРегистраторовРасчетыПланОтгрузокПоставок.Добавить(ПустойРегистраторРасчетов);
		
		Запрос.УстановитьПараметр("СписокПолныхРегистраторовРасчетыПланОплат", СписокПолныхРегистраторовРасчетыПланОплат);
		Запрос.УстановитьПараметр("СписокПолныхРегистраторовРасчетыПланОтгрузокПоставок", СписокПолныхРегистраторовРасчетыПланОтгрузокПоставок);
		
		Для Каждого Регистратор Из СписокПолныхРегистраторовРасчетыПоСрокам Цикл
			Если СписокПолныхРегистраторовРасчетыПланОплат.Найти(Регистратор) <> Неопределено
				И СписокПолныхРегистраторовРасчетыПланОтгрузокПоставок.Найти(Регистратор) <> Неопределено Тогда
				СписокПолныхРегистраторовПоТаблицам.Добавить(Регистратор);
			КонецЕсли;
		КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокПолныхРегистраторовПоТаблицам", СписокПолныхРегистраторовПоТаблицам);
	
	МассивТекстовЗапроса = Новый Массив;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КоличествоЗаписейРегистраторовРасчетов.Документ КАК Регистратор
	|ПОМЕСТИТЬ ВтДоступныеРегистраторы
	|ИЗ
	|	РегистрСведений.КоличествоЗаписейРегистраторовРасчетов КАК КоличествоЗаписейРегистраторовРасчетов
	|ГДЕ
	|	КоличествоЗаписейРегистраторовРасчетов.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И КоличествоЗаписейРегистраторовРасчетов.ОбъектРасчетов = &ОбъектРасчетов
	|	И КоличествоЗаписейРегистраторовРасчетов.Валюта = &Валюта
	|	И НЕ КоличествоЗаписейРегистраторовРасчетов.Документ В (&СписокПолныхРегистраторовПоТаблицам)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ТаблицаРасчетыПоСрокам КАК ИмяТаблицы,
	|	ДоступныеРегистраторы.Регистратор КАК Ссылка,
	|	СУММА(ЕСТЬNULL(КоличествоЗаписейРегистраторовРасчетов.КоличествоЗаписей, 0)) > 0 КАК ТребуетсяОчистка
	|ИЗ
	|	ВтДоступныеРегистраторы КАК ДоступныеРегистраторы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоЗаписейРегистраторовРасчетов КАК КоличествоЗаписейРегистраторовРасчетов
	|		ПО ДоступныеРегистраторы.Регистратор = КоличествоЗаписейРегистраторовРасчетов.Документ
	|		И КоличествоЗаписейРегистраторовРасчетов.ИмяТаблицы = &ТаблицаРасчетыПоСрокам
	|ГДЕ
	|	НЕ ДоступныеРегистраторы.Регистратор В (&СписокПолныхРегистраторовРасчетыПоСрокам)
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеРегистраторы.Регистратор";
		
	МассивТекстовЗапроса.Добавить(ТекстЗапроса);
			
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	&ТаблицаРасчетыПланОплат КАК ИмяТаблицы,
		|	ДоступныеРегистраторы.Регистратор КАК Ссылка,
		|	СУММА(ЕСТЬNULL(КоличествоЗаписейРегистраторовРасчетов.КоличествоЗаписей, 0)) > 0 КАК ТребуетсяОчистка
		|ИЗ
		|	ВтДоступныеРегистраторы КАК ДоступныеРегистраторы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоЗаписейРегистраторовРасчетов КАК КоличествоЗаписейРегистраторовРасчетов
		|		ПО ДоступныеРегистраторы.Регистратор = КоличествоЗаписейРегистраторовРасчетов.Документ
		|		И КоличествоЗаписейРегистраторовРасчетов.ИмяТаблицы = &ТаблицаРасчетыПланОплат
		|ГДЕ
		|	НЕ ДоступныеРегистраторы.Регистратор В (&СписокПолныхРегистраторовРасчетыПланОплат)
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеРегистраторы.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ТаблицаРасчетыПланОтгрузокПоставок КАК ИмяТаблицы,
		|	ДоступныеРегистраторы.Регистратор КАК Ссылка,
		|	СУММА(ЕСТЬNULL(КоличествоЗаписейРегистраторовРасчетов.КоличествоЗаписей, 0)) > 0 КАК ТребуетсяОчистка
		|ИЗ
		|	ВтДоступныеРегистраторы КАК ДоступныеРегистраторы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоЗаписейРегистраторовРасчетов КАК КоличествоЗаписейРегистраторовРасчетов
		|		ПО ДоступныеРегистраторы.Регистратор = КоличествоЗаписейРегистраторовРасчетов.Документ
		|		И КоличествоЗаписейРегистраторовРасчетов.ИмяТаблицы = &ТаблицаРасчетыПланОтгрузокПоставок
		|ГДЕ
		|	НЕ ДоступныеРегистраторы.Регистратор В (&СписокПолныхРегистраторовРасчетыПланОтгрузокПоставок)
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеРегистраторы.Регистратор";
			
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
		
	Запрос.Текст = СтрСоединить(МассивТекстовЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
		
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить(); // см.СвободныеРегистраторыРасчетов
	ТаблицаДокументов.Индексы.Добавить("ИмяТаблицы");
	
	Возврат ТаблицаДокументов;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеОчисткаРегистров

// Устарела. Выполняет первоначальное заполнение регистров новой архитектуры
//
// Параметры:
//	Параметры - Структура - параметры обработчика ожидания
//	  ОтключитьПроверкуЗавершенияОтложенногоОбновленияИБ - Булево - флаг отключающий проверку завершения отложенного обновления ИБ.
//	АдресРезультата - Строка - адрес временного хранилища, в которое будет помещен результат работы обработчика ожидания.
//
Процедура ЗаполнитьРегистрыПриВключенииНовойАрхитектуры(Параметры, АдресРезультата) Экспорт

	Если НЕ Параметры.Свойство("ОтключитьПроверкуЗавершенияОтложенногоОбновленияИБ")
	   И НЕ ОбновлениеИнформационнойБазы.ОтложенноеОбновлениеЗавершено() Тогда
		Текст = НСтр("ru = 'Переход на онлайн взаиморасчеты уже запущен. Дождитесь завершения отложенного обновления.'");
		ВызватьИсключение Текст;
	КонецЕсли;
	
	Константы.НачатПереходНаНовуюАрхитектуруВзаиморасчетов.Установить(Истина);//начали регистрироваться задания неоперативной очереди допроведения
	РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСКлиентами(ТекущаяДатаСеанса(),,Ложь);
	РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСПоставщиками(ТекущаяДатаСеанса(),,Ложь);
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСКлиентамиПоДокументам");
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщикамиПоДокументам");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		ЗаполнитьРегистрПереходаНаОнлайн();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ИмяСобытия = ИмяСобытияЖурналаРегистрацииПриВключенииОнлайнРасчетов() 
					+ " " + НСтр("ru = 'Не удалось заполнить регистр перехода.'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	ОписаниеЗамераПерехода = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Взаиморасчеты.ПереходНаНовуюАрхитектуру.Многопоточный");
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ОписаниеЗамераПерехода = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Взаиморасчеты.ПереходНаНовуюАрхитектуру.ФайловаяБаза");
	КонецЕсли;
	
	ВзаиморасчетыСлужебный.ОчиститьРегистрыВзаиморасчетов();
	ВзаиморасчетыСлужебный.ВключитьИтогиРегистровРасчетов();
	
	ПеренестиКорректировкуРегистровНаСервере();
	
	//Фаза 1 - основной перенос (копирование данных)
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ВсегоОбработано = ВыполнитьПереносОфлайнВзаиморасчетов();
	Иначе
		ПараметрыМП = ПараметрыМногопоточнойОбработкиРасчетов();
		ПараметрыМП.Процедура.Имя = "ОперативныеВзаиморасчетыСервер.ВыполнитьПереносОфлайнВзаиморасчетов";
		ПараметрыМП.Процедура.ПредставлениеЗадания = НСтр("ru = 'Перенос офлайн взаиморасчетов'");
		ПараметрыМП.Данные.УсловиеЗапроса = "Задания.ДатаПересчета = ДАТАВРЕМЯ(1,1,1)";
		
		ВсегоОбработано = МногопоточнаяОбработкаЗаданийКРаспределениюРасчетов(ПараметрыМП);
	КонецЕсли;
	
	Шаблон = НСтр("ru = 'Завершен перенос офлайн расчетов. Обработано: %1 кортежей'");
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрацииПриВключенииОнлайнРасчетов(),
		УровеньЖурналаРегистрации.Информация,,,СтрШаблон(Шаблон, ВсегоОбработано));
	
	//Фаза 2 - перенос хвостов (перепроведенные за время основного переноса)
	//Перенос хвостов выполнится в неоперативной очереди допроведения
	
	//++ Локализация
	ЗаписатьРасхожденияОстатковПослеПерехода();
	//-- Локализация
	Константы.НачатПереходНаНовуюАрхитектуруВзаиморасчетов.Установить(Ложь);
	Константы.НоваяАрхитектураВзаиморасчетов.Установить(Истина);
	
	Попытка
		
		ИсправитьРазвернутоеСальдо(НачалоМесяца(ТекущаяДатаСеанса()));
		
	Исключение
		
		ИмяСобытия = ИмяСобытияЖурналаРегистрацииПриВключенииОнлайнРасчетов() 
					+ " " + НСтр("ru = 'Этап 2.'", ОбщегоНазначения.КодОсновногоЯзыка());
		Текст =  НСтр("ru = 'Исправление развернутого сальдо'", ОбщегоНазначения.КодОсновногоЯзыка()) + Символы.ПС + Символы.ПС;
		ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,,, Текст + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамераПерехода, ВсегоОбработано);
	
КонецПроцедуры

// Устарела. Очищает новые регистры расчетов в транзакции с блокировкой всех расчетов.
Процедура ОчиститьРегистрыПриВыключенииНовойАрхитектуры(Параметры = Неопределено, УникальныйИдентификатор = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		ВернутьДвиженияПоРасчетамСКлиентами();
		Константы.НоваяАрхитектураВзаиморасчетов.Установить(Ложь);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выключение онлайн взаиморасчетов с партнерами.'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
		
	ВзаиморасчетыСлужебный.ОчиститьРегистрыВзаиморасчетов();
	
	ВзаиморасчетыСлужебный.УдалитьСистемныеКорректировкиРегистров(Дата(1,1,1));
		
	ВзаиморасчетыСлужебный.ВключитьИтогиРегистровРасчетов();
	
КонецПроцедуры

// Устарела. Заполнение новых регистров по всем объектам расчетов.
// 
// Параметры:
//  ТолькоПлановыеРасчеты - Булево - Только плановые расчеты
Процедура ЗаполнитьПоВсемРасчетам(ТолькоПлановыеРасчеты = Ложь) Экспорт
	
	ВзаиморасчетыСлужебный.ЗаполнитьПоВсемРасчетам(ТолькоПлановыеРасчеты);

КонецПроцедуры

#КонецОбласти

#Область ПереходНаНовуюАрхитектуруПриОбновлении

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчикаПереходаНаНовуюАрхитектуруВзаиморасчетов(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОперативныеВзаиморасчетыСервер.ОбработатьДанныеДляПереходаНаНовуюАрхитектуруВзаиморасчетов";
	Обработчик.Версия = "11.5.27.25";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c196aaa5-6e50-42d4-9f83-13f14b8dccbb");
	Обработчик.Многопоточный = Ложь;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ОперативныеВзаиморасчетыСервер.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюАрхитектуруВзаиморасчетов";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	Обработчик.Комментарий = НСтр("ru = 'Переход на новую архитектуру взаиморасчетов'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоДокументам.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоДокументам.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Константы.НоваяАрхитектураВзаиморасчетов.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Обработчик.БлокируемыеОбъекты = "";
	
КонецПроцедуры

// Процедура регистрации данных для обработчика обновления ОбработатьДанныеДляПереходаНаВерсию.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюАрхитектуруВзаиморасчетов(Параметры) Экспорт
	
	Возврат; //регистрация не требуется
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюАрхитектуруВзаиморасчетов(Параметры) Экспорт

	НоваяАрхитектураВзаиморасчетов = Константы.НоваяАрхитектураВзаиморасчетов.Получить();
	Если НоваяАрхитектураВзаиморасчетов Тогда
		Параметры.ОбработкаЗавершена = Истина;
	Иначе
		
		ПараметрыЭкспортнойПроцедуры = Новый Структура;
		ПараметрыЭкспортнойПроцедуры.Вставить("ОтключитьПроверкуЗавершенияОтложенногоОбновленияИБ", Истина);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне();
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Переход на новую архитектуру взаиморасчетов'");
		
		Результат = ДлительныеОперации.ВыполнитьВФоне(
			"ОперативныеВзаиморасчетыСервер.ЗаполнитьРегистрыПриВключенииНовойАрхитектуры",
			ПараметрыЭкспортнойПроцедуры,
			ПараметрыВыполнения);
		
		//в файловой базе и при включенном РежимеОтладки длительная операция выполняется без фонового задания
		Если ЗначениеЗаполнено(Результат.ИдентификаторЗадания) Тогда
			Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Результат.ИдентификаторЗадания);
			Попытка
				РезультатОжидания = Задание.ОжидатьЗавершенияВыполнения();
				Если РезультатОжидания.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно 
					ИЛИ РезультатОжидания.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
					ТекстСообщения = НСтр("ru = 'Не удалось выполнить переход на онлайн взаиморасчеты.
					|Причину завершения задания перехода смотри выше этой записи в журнале регистрации.'");
					ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрацииПриВключенииОнлайнРасчетов(),
						УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);
				КонецЕсли;
			Исключение
				ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрацииПриВключенииОнлайнРасчетов(),
					УровеньЖурналаРегистрации.Информация,,,НСтр("ru = 'Истекло время ожидания фонового задания перехода на онлайн взаиморасчеты'"));
			КонецПопытки;
		КонецЕсли;
		НоваяАрхитектураВзаиморасчетов = Константы.НоваяАрхитектураВзаиморасчетов.Получить();
		Если НЕ НоваяАрхитектураВзаиморасчетов 
			И Константы.НачатПереходНаНовуюАрхитектуруВзаиморасчетов.Получить() Тогда
			Константы.НачатПереходНаНовуюАрхитектуруВзаиморасчетов.Установить(Ложь);
		КонецЕсли;
		
		Параметры.ОбработкаЗавершена = НоваяАрхитектураВзаиморасчетов;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ИсправлениеОшибок

// Устарела. Формирует текст запроса для поиска некорректных данных в расчетных регистрах. 
// 
// Параметры:
// 	ИмяВТ - Строка - Имя временной таблицы для помещения результата
// 	БезРучныхКорректировок - Булево - необходимость исключения из результата запроса Аналитик расчетов по партнерам 
// 	                                  и Объектов расчетов, по которым введены ручные корректировки регистров.
// Возвращаемое значение:
// 	Строка - Текст запроса
Функция ТекстЗапросаНекорректныхОстаткиВзаиморасчетовПоСрокам(ИмяВТ = "", БезРучныхКорректировок = Истина) Экспорт
	
	Возврат ВзаиморасчетыСлужебный.ТекстЗапросаНекорректныхОстаткиВзаиморасчетовПоСрокам(ИмяВТ, БезРучныхКорректировок);
	
КонецФункции

// Устарела. Формирует текст запроса для поиска записей с развернутым сальдо в расчетных регистрах. 
// 
// Параметры:
// 	ИмяВТ - Строка - Имя временной таблицы для помещения результата
// 	БезРучныхКорректировок - Булево - необходимость исключения из результата запроса Аналитик расчетов по партнерам 
// Возвращаемое значение:
// 	Строка - Текст запроса
Функция ТекстЗапросаРазвернутоеСальдо(ИмяВт = "", БезРучныхКорректировок = Истина) Экспорт
	
	Возврат ВзаиморасчетыСлужебный.ТекстЗапросаРазвернутоеСальдо(ИмяВт, БезРучныхКорректировок) 
	
КонецФункции

// Устарела. Исправление остатков по взаиморасчетам
// 
// Параметры:
// 	Период - Дата - Период проверки, на начало месяца периода будут проверены остатки, 
//		если они некорректные, то будет создана корректировка на конец предыдущего месяца.
//		Если на начало периода остатки в порядке, а на начало следующего месяца - нет, то будет запущен частичный пересчет расчетов.
// 	МассивОрганизаций - Массив из СправочникСсылка.Организации - Массив организация, по которым требуется исправить остатки взаиморасчетов
Процедура ИсправитьОстаткиВзаиморасчетов(Период, ЗНАЧ МассивОрганизаций = Неопределено) Экспорт
	
	ВзаиморасчетыСлужебный.ИсправитьОстаткиВзаиморасчетов(Период, МассивОрганизаций)
	
КонецПроцедуры

// Устарела. Исправление развернутого сальдо по взаиморасчетам
// 
// Параметры:
// 	Период - Дата - Период проверки, требуется указать конец месяца
// 	МассивОрганизаций - Массив из СправочникСсылка.Организации - Массив организация, по которым требуется исправить развернутое сальдо взаиморасчетов
Процедура ИсправитьРазвернутоеСальдо(Период, ЗНАЧ МассивОрганизаций = Неопределено) Экспорт
	
	ВзаиморасчетыСлужебный.ИсправитьРазвернутоеСальдо(Период, МассивОрганизаций)
	
КонецПроцедуры

// Устарела. Добавляет в движения данные по прочим доходам/расходам 
// 
// Параметры:
// 	КорректировкаОбъект - ДокументОбъект.КорректировкаРегистров - ДокументОбъект, с уже записанными движениями по расчетам.
Процедура ДополнитьКорректировкуДвижениямиПоПрочимДоходамРасходам(КорректировкаОбъект) Экспорт
	
	ВзаиморасчетыСлужебный.ДополнитьКорректировкуДвижениямиПоПрочимДоходамРасходам(КорректировкаОбъект);
	
КонецПроцедуры

#КонецОбласти

// Устарела. Регистрирует объекты расчетов для отложенного расчета по срокам и планом
// 
// Параметры:
// 	Регистратор - ДокументСсылка - Регистратор, инициатор регистрации заданий (проводимый документ).
// 	ТаблицаИзменений - см. ТаблицаКРаспределению
Процедура ЗарегистрироватьИзмененияКОтложенномуРаспределению(Регистратор, ТаблицаИзменений) Экспорт
	
	ВзаиморасчетыСлужебный.ЗарегистрироватьИзмененияКОтложенномуРаспределению(Регистратор, ТаблицаИзменений);
	
КонецПроцедуры

// Устарела. Выполняет распределение расчетов по текущим заданиям к распределению в регистрах ЗаданияКРаспределениюРасчетов и ЗаданияКРаспределениюВзаиморасчетов
// 
// Параметры:
// 	Параметры - Структура, Неопределено - В структуре передается таблица заданий для распределения:
// 	 *ДанныеКОтработке - см. ВзаиморасчетыСлужебный.ДанныеДляОбработки
// 	АдресРезультата - Строка - адрес временного хранилища, в которое будет помещен результат работы процедуры.
Процедура ВыполнитьОтложенноеРаспределение(Параметры = Неопределено, АдресРезультата = Неопределено) Экспорт
	
	ВзаиморасчетыСлужебный.ВыполнитьОтложенноеРаспределение(Параметры, АдресРезультата);
	
КонецПроцедуры

// Пустые ссылки на заказы.
// 
// Возвращаемое значение:
//  Массив из Тип - Пустые ссылки на заказы
Функция ПустыеСсылкиНаЗаказы() Экспорт
	
	ПустыеСсылкиНаЗаказы = Новый Массив;
	ПустыеСсылкиНаЗаказы.Добавить(Неопределено);
	ПустыеСсылкиНаЗаказы.Добавить(Документы.ЗаказКлиента.ПустаяСсылка());
	ПустыеСсылкиНаЗаказы.Добавить(Документы.ЗаявкаНаВозвратТоваровОтКлиента.ПустаяСсылка());
	ПустыеСсылкиНаЗаказы.Добавить(Документы.ЗаказПоставщику.ПустаяСсылка());
	
	
	
	Возврат ПустыеСсылкиНаЗаказы;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеДанных

// Формирует временные таблицы для всех аналитик к расчету
Процедура СформироватьВТДанныхРегистров(Запрос, ГлобальныеПеременные)
	
	Тексты = Новый Массив;
	
	// Дополненные параметры, далее используются во всех соединениях для получения данных.
	Тексты.Добавить("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДополненныеПараметрыРаспределения.ОбъектРасчетов КАК ПараметрОбъектРасчетов,
	|	ДополненныеПараметрыРаспределения.АналитикаУчетаПоПартнерам КАК ПараметрАналитикаУчетаПоПартнерам,
	|	ДополненныеПараметрыРаспределения.Валюта КАК ПараметрВалюта,
	|	ДополненныеПараметрыРаспределения.ЭтоРасчетыСКлиентами КАК ПараметрЭтоРасчетыСКлиентами,
	|	ДополненныеПараметрыРаспределения.ГрафикВДоговоре КАК ПараметрГрафикВДоговоре,
	|	ДополненныеПараметрыРаспределения.ГрафикИсполненияДоговора КАК ПараметрГрафикИсполненияДоговора,
	|	ДополненныеПараметрыРаспределения.ВалютаРегламентированногоУчета КАК ПараметрВалютаРегламентированногоУчета,
	|	ДополненныеПараметрыРаспределения.ДатаНачалаПересчета КАК ПараметрДатаНачалаПересчета,
	|	ДополненныеПараметрыРаспределения.ТипРасчетов КАК ПараметрТипРасчетов
	|ПОМЕСТИТЬ ВтДополненныеПараметрыРаспределения
	|ИЗ
	|	&ДополненныеПараметрыРаспределения КАК ДополненныеПараметрыРаспределения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПараметрАналитикаУчетаПоПартнерам,
	|	ПараметрОбъектРасчетов,
	|	ПараметрВалюта");
	
	Если ГлобальныеПеременные.ЕстьЗаписиРасчетовСКлиентами Тогда
		Тексты.Добавить(ТекстЗапросаРасчетыПоСрокамОстатки(ГлобальныеПеременные.ДатаНачалаПересчетаЕстьРазличные, Истина));
		Тексты.Добавить(ТекстЗапросаРасчетыДвиженияСМоментаПересчета(Истина));
		Тексты.Добавить(ТекстЗапросИсходныеРегистраторы(Истина));
		Тексты.Добавить(ТекстЗапросаРасчетыПланОплатОстатки(ГлобальныеПеременные.ДатаНачалаПересчетаЕстьРазличные,Истина));
		Тексты.Добавить(ТекстЗапросаРасчетыПланОтгрузокПоставокОстатки(ГлобальныеПеременные.ДатаНачалаПересчетаЕстьРазличные, Истина));
	КонецЕсли;

	Если ГлобальныеПеременные.ЕстьЗаписиРасчетовСПоставщиками Тогда
		Тексты.Добавить(ТекстЗапросаРасчетыПоСрокамОстатки(ГлобальныеПеременные.ДатаНачалаПересчетаЕстьРазличные,Ложь));
		Тексты.Добавить(ТекстЗапросаРасчетыДвиженияСМоментаПересчета(Ложь));
		Тексты.Добавить(ТекстЗапросИсходныеРегистраторы(Ложь));
		Тексты.Добавить(ТекстЗапросаРасчетыПланОплатОстатки(ГлобальныеПеременные.ДатаНачалаПересчетаЕстьРазличные,Ложь));
		Тексты.Добавить(ТекстЗапросаРасчетыПланОтгрузокПоставокОстатки(ГлобальныеПеременные.ДатаНачалаПересчетаЕстьРазличные, Ложь));
	КонецЕсли;
	
	#Область СлужебныеРегистраторыВзаиморасчетов
	МассивТекстов = Новый Массив;
	// Служебные регистраторы расчетов для ускорения запросов.
	МассивТекстов.Добавить("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Период КАК Период,
	|	Расчеты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТРасчетыСКлиентамиПоСрокамРегистраторы
	|ИЗ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметрыРасчета
	|			ПО Расчеты.АналитикаУчетаПоПартнерамПриемник = ВтПараметрыРасчета.ПараметрАналитикаУчетаПоПартнерам
	|");

	МассивТекстов.Добавить("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Период КАК Период,
	|	Расчеты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТРасчетыСПоставщикамиПоСрокамРегистраторы
	|ИЗ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметрыРасчета
	|			ПО Расчеты.АналитикаУчетаПоПартнерамПриемник = ВтПараметрыРасчета.ПараметрАналитикаУчетаПоПартнерам
	|");
	
	ТекстЗапросаВтТипыПриемников = "";
	
	// Определяет является ли движение-приемник отгрузкой или оплатой.
	Если ГлобальныеПеременные.ЕстьЗаписиРасчетовСКлиентами Тогда
		ТекстЗапросаВтТипыПриемников = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РасчетыДвижения.Регистратор КАК Регистратор,
			|	РасчетыДвижения.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	РасчетыДвижения.ОбъектРасчетов КАК ОбъектРасчетов,
			|	РасчетыДвижения.Валюта КАК Валюта,
			|	РасчетыДвижения.ЭтоОплата  КАК ПриемникЭтоОплата
			|ПОМЕСТИТЬ ВтТипыПриемников
			|ИЗ
			|	РасчетыДвиженияКлиенты КАК РасчетыДвижения
			|ГДЕ
			|	РасчетыДвижения.ПоДаннымОбъектаРасчетовИсточника
			|	И РасчетыДвижения.Сумма <> 0
			|";
	КонецЕсли;
	
	Если ГлобальныеПеременные.ЕстьЗаписиРасчетовСПоставщиками Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РасчетыДвижения.Регистратор КАК Регистратор,
			|	РасчетыДвижения.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	РасчетыДвижения.ОбъектРасчетов КАК ОбъектРасчетов,
			|	РасчетыДвижения.Валюта КАК Валюта,
			|	РасчетыДвижения.ЭтоОплата КАК ПриемникЭтоОплата
			|ПОМЕСТИТЬ ВтТипыПриемников
			|ИЗ
			|	РасчетыДвиженияПоставщики КАК РасчетыДвижения
			|ГДЕ
			|	РасчетыДвижения.ПоДаннымОбъектаРасчетовИсточника
			|	И РасчетыДвижения.Сумма <> 0
			|";
		Если ГлобальныеПеременные.ЕстьЗаписиРасчетовСКлиентами Тогда
			ТекстЗапросаВтТипыПриемников = ТекстЗапросаВтТипыПриемников + ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении();
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВтТипыПриемников", "");
		КонецЕсли;
		ТекстЗапросаВтТипыПриемников = ТекстЗапросаВтТипыПриемников + ТекстЗапроса;
	КонецЕсли;
	МассивТекстов.Добавить(ТекстЗапросаВтТипыПриемников);
	
	Тексты.Добавить(СтрСоединить(МассивТекстов,";"));
	#КонецОбласти
	
	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ТекстЗапросаРасчетыПоСрокамОстатки(ДатаНачалаПересчетаЕстьРазличные, РасчетыСКлиентами = Истина, ИмяТаблицы = "")

	//Данные расчетов до начала пересчета.
	
	МассивТекстовПодзапроса = Новый Массив;
	
	ТекстПодзапросаОстатки = "
	|ВЫБРАТЬ
	|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПоСрокамОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПоСрокамОстатки.Валюта КАК Валюта,
	|	РасчетыПоСрокамОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	РасчетыПоСрокамОстатки.ДатаВозникновения КАК ДатаВозникновения,
	|	РасчетыПоСрокамОстатки.ПредоплатаОстаток КАК ПредоплатаОстаток,
	|	РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток КАК ПредоплатаРеглОстаток,
	|	РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток КАК ПредоплатаУпрОстаток,
	|	РасчетыПоСрокамОстатки.ДолгОстаток КАК ДолгОстаток,
	|	РасчетыПоСрокамОстатки.ДолгРеглОстаток КАК ДолгРеглОстаток,
	|	РасчетыПоСрокамОстатки.ДолгУпрОстаток КАК ДолгУпрОстаток,
	|	0 КАК ПредоплатаОборот,
	|	0 КАК ПредоплатаРеглОборот,
	|	0 КАК ПредоплатаУпрОборот,
	|	0 КАК ДолгОборот,
	|	0 КАК ДолгРеглОборот,
	|	0 КАК ДолгУпрОборот
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&ДатаНачалаПересчетаМинимальный, (АналитикаУчетаПоПартнерам,
	|		ОбъектРасчетов, Валюта) В
	|		(ВЫБРАТЬ
	|			ВтПараметры.ПараметрАналитикаУчетаПоПартнерам,
	|			ВтПараметры.ПараметрОбъектРасчетов,
	|			ВтПараметры.ПараметрВалюта
	|		ИЗ
	|			ВтДополненныеПараметрыРаспределения КАК ВтПараметры)) КАК РасчетыПоСрокамОстатки";
	
	МассивТекстовПодзапроса.Добавить(ТекстПодзапросаОстатки);
	
	Если ДатаНачалаПересчетаЕстьРазличные Тогда
		
		ТекстПодзапросаДвижения = "
		|ВЫБРАТЬ
		|	РасчетыПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасчетыПоСрокам.Валюта КАК Валюта,
		|	РасчетыПоСрокам.РасчетныйДокумент КАК РасчетныйДокумент,
		|	РасчетыПоСрокам.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
		|	РасчетыПоСрокам.ДатаВозникновения КАК ДатаВозникновения,
		|	СУММА(0) КАК ПредоплатаОстаток,
		|	СУММА(0) КАК ПредоплатаРеглОстаток,
		|	СУММА(0) КАК ПредоплатаУпрОстаток,
		|	СУММА(0) КАК ДолгОстаток,
		|	СУММА(0) КАК ДолгРеглОстаток,
		|	СУММА(0) КАК ДолгУпрОстаток,
		|	СУММА(ВЫБОР
		|		КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РасчетыПоСрокам.Предоплата
		|		ИНАЧЕ -РасчетыПоСрокам.Предоплата
		|	КОНЕЦ) КАК ПредоплатаОборот,
		|	СУММА(ВЫБОР
		|		КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РасчетыПоСрокам.ПредоплатаРегл
		|		ИНАЧЕ -РасчетыПоСрокам.ПредоплатаРегл
		|	КОНЕЦ) КАК ПредоплатаРеглОборот,
		|	СУММА(ВЫБОР
		|		КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РасчетыПоСрокам.ПредоплатаУпр
		|		ИНАЧЕ -РасчетыПоСрокам.ПредоплатаУпр
		|	КОНЕЦ) КАК ПредоплатаУпрОборот,
		|	СУММА(ВЫБОР
		|		КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РасчетыПоСрокам.Долг
		|		ИНАЧЕ -РасчетыПоСрокам.Долг
		|	КОНЕЦ) КАК ДолгОборот,
		|	СУММА(ВЫБОР
		|		КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РасчетыПоСрокам.ДолгРегл
		|		ИНАЧЕ -РасчетыПоСрокам.ДолгРегл
		|	КОНЕЦ) КАК ДолгРеглОборот,
		|	СУММА(ВЫБОР
		|		КОГДА РасчетыПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РасчетыПоСрокам.ДолгУпр
		|		ИНАЧЕ -РасчетыПоСрокам.ДолгУпр
		|	КОНЕЦ) КАК ДолгУпрОборот
		|ИЗ
		|	ВтДополненныеПараметрыРаспределения КАК ВтПараметры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
		|		ПО ВтПараметры.ПараметрОбъектРасчетов = РасчетыПоСрокам.ОбъектРасчетов
		|		И ВтПараметры.ПараметрАналитикаУчетаПоПартнерам = РасчетыПоСрокам.АналитикаУчетаПоПартнерам
		|		И ВтПараметры.ПараметрВалюта = РасчетыПоСрокам.Валюта
		|		И РасчетыПоСрокам.Активность
		|		И РасчетыПоСрокам.Период >= &ДатаНачалаПересчетаМинимальный
		|		И РасчетыПоСрокам.Период < ВтПараметры.ПараметрДатаНачалаПересчета
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоСрокам.АналитикаУчетаПоПартнерам,
		|	РасчетыПоСрокам.ОбъектРасчетов,
		|	РасчетыПоСрокам.Валюта,
		|	РасчетыПоСрокам.РасчетныйДокумент,
		|	РасчетыПоСрокам.ДатаПлановогоПогашения,
		|	РасчетыПоСрокам.ДатаВозникновения";
		
		МассивТекстовПодзапроса.Добавить(ТекстПодзапросаДвижения);
		
	КонецЕсли;
	
	ТекстПодзапроса = СтрСоединить(МассивТекстовПодзапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстЗапросаРасчетыПоСрокамОстатки = "
	|ВЫБРАТЬ
	|	ОстаткиИОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.Валюта КАК Валюта,
	|	ОстаткиИОбороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ОстаткиИОбороты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	ОстаткиИОбороты.ДатаВозникновения КАК ДатаВозникновения,
	|	СУММА(ОстаткиИОбороты.ПредоплатаОстаток + ОстаткиИОбороты.ПредоплатаОборот) КАК ПредоплатаОстаток,
	|	СУММА(ОстаткиИОбороты.ПредоплатаРеглОстаток + ОстаткиИОбороты.ПредоплатаРеглОборот) КАК ПредоплатаРеглОстаток,
	|	СУММА(ОстаткиИОбороты.ПредоплатаУпрОстаток + ОстаткиИОбороты.ПредоплатаУпрОборот) КАК ПредоплатаУпрОстаток,
	|	СУММА(ОстаткиИОбороты.ДолгОстаток + ОстаткиИОбороты.ДолгОборот) КАК ДолгОстаток,
	|	СУММА(ОстаткиИОбороты.ДолгРеглОстаток + ОстаткиИОбороты.ДолгРеглОборот) КАК ДолгРеглОстаток,
	|	СУММА(ОстаткиИОбороты.ДолгУпрОстаток + ОстаткиИОбороты.ДолгУпрОборот) КАК ДолгУпрОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиКлиенты
	|ИЗ
	|	&ТекстПодзапроса КАК ОстаткиИОбороты
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиИОбороты.ОбъектРасчетов,
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.Валюта,
	|	ОстаткиИОбороты.РасчетныйДокумент,
	|	ОстаткиИОбороты.ДатаПлановогоПогашения,
	|	ОстаткиИОбороты.ДатаВозникновения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта,
	|	РасчетныйДокумент
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоСрокамОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПоСрокамОстатки.Валюта КАК Валюта,
	|	РасчетыПоСрокамОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	РасчетыПоСрокамОстатки.ДатаВозникновения КАК ДатаВозникновения,
	|	РасчетыПоСрокамОстатки.ПредоплатаОстаток КАК ПредоплатаОстаток,
	|	РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток КАК ПредоплатаРеглОстаток,
	|	РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток КАК ПредоплатаУпрОстаток,
	|	РасчетыПоСрокамОстатки.ДолгОстаток КАК ДолгОстаток,
	|	РасчетыПоСрокамОстатки.ДолгРеглОстаток КАК ДолгРеглОстаток,
	|	РасчетыПоСрокамОстатки.ДолгУпрОстаток КАК ДолгУпрОстаток,
	|	МАКСИМУМ(ВспомогательнаяИнформация.ПорядокОперации) КАК ПорядокОперации
	|ПОМЕСТИТЬ ВТОстаткиСПоследнимМоментомПриходногоДвиженияКлиенты
	|ИЗ
	|	ВТ_ОстаткиКлиенты КАК РасчетыПоСрокамОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК ВспомогательнаяИнформация
	|			ПО РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам     = ВспомогательнаяИнформация.АналитикаУчетаПоПартнерам
	|				И РасчетыПоСрокамОстатки.ОбъектРасчетов             = ВспомогательнаяИнформация.ОбъектРасчетов
	|				И РасчетыПоСрокамОстатки.Валюта                     = ВспомогательнаяИнформация.Валюта
	|				И РасчетыПоСрокамОстатки.РасчетныйДокумент          = ВспомогательнаяИнформация.РасчетныйДокумент
	|				И РасчетыПоСрокамОстатки.ДатаПлановогоПогашения     = ВспомогательнаяИнформация.ДатаПлановогоПогашения
	|				И РасчетыПоСрокамОстатки.ДатаВозникновения          = ВспомогательнаяИнформация.ДатаВозникновения
	|				И ВспомогательнаяИнформация.Активность
	|				И ВспомогательнаяИнформация.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НЕ ВспомогательнаяИнформация.ДокументРегистратор ССЫЛКА Документ.РасчетКурсовыхРазниц
	|				И НЕ ВспомогательнаяИнформация.Сторно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметры
	|			ПО ВтПараметры.ПараметрОбъектРасчетов = РасчетыПоСрокамОстатки.ОбъектРасчетов
	|				И ВтПараметры.ПараметрАналитикаУчетаПоПартнерам = РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам
	|				И ВтПараметры.ПараметрВалюта = РасчетыПоСрокамОстатки.Валюта
	|				И ВспомогательнаяИнформация.Период < ВтПараметры.ПараметрДатаНачалаПересчета
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокамОстатки.ОбъектРасчетов,
	|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам,
	|	РасчетыПоСрокамОстатки.Валюта,
	|	РасчетыПоСрокамОстатки.РасчетныйДокумент,
	|	РасчетыПоСрокамОстатки.ДатаВозникновения,
	|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения,
	|	РасчетыПоСрокамОстатки.ПредоплатаОстаток,
	|	РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток,
	|	РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток,
	|	РасчетыПоСрокамОстатки.ДолгОстаток,
	|	РасчетыПоСрокамОстатки.ДолгРеглОстаток,
	|	РасчетыПоСрокамОстатки.ДолгУпрОстаток
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта,
	|	РасчетныйДокумент,
	|	ДатаПлановогоПогашения,
	|	ДатаВозникновения,
	|	ПорядокОперации
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоСрокамОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПоСрокамОстатки.Валюта КАК Валюта,
	|	РасчетыПоСрокамОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	РасчетыПоСрокамОстатки.ДатаВозникновения КАК ДатаВозникновения,
	|	МИНИМУМ(ВспомогательнаяИнформация.ПорядокЗачета) КАК ПорядокЗачета,
	|	РасчетыПоСрокамОстатки.ПорядокОперации КАК ПорядокОперации,
	|	МАКСИМУМ(ВспомогательнаяИнформация.СвязанныйДокумент) КАК СвязанныйДокумент,
	|	МАКСИМУМ(ВспомогательнаяИнформация.ВалютаДокумента) КАК ВалютаДокумента,
	|	МАКСИМУМ(ВспомогательнаяИнформация.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
	|	МАКСИМУМ(ВспомогательнаяИнформация.ХозяйственнаяОперация) КАК ХозяйственнаяОперация,
	|	МАКСИМУМ(ВспомогательнаяИнформация.ДокументРегистратор) КАК ДокументРегистратор,
	|	РасчетыПоСрокамОстатки.ПредоплатаОстаток КАК Предоплата,
	|	РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток КАК ПредоплатаРегл,
	|	РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток КАК ПредоплатаУпр,
	|	РасчетыПоСрокамОстатки.ДолгОстаток КАК Долг,
	|	РасчетыПоСрокамОстатки.ДолгРеглОстаток КАК ДолгРегл,
	|	РасчетыПоСрокамОстатки.ДолгУпрОстаток КАК ДолгУпр,
	|	РасчетыПоСрокамОстатки.ПредоплатаОстаток <> 0 КАК ЕстьПредоплата,
	|	РасчетыПоСрокамОстатки.ДолгОстаток <> 0 КАК ЕстьДолг
	|ПОМЕСТИТЬ ВТРасчетыПоСрокамОстаткиКлиенты
	|ИЗ
	|	ВТОстаткиСПоследнимМоментомПриходногоДвиженияКлиенты КАК РасчетыПоСрокамОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК ВспомогательнаяИнформация
	|			ПО РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам     = ВспомогательнаяИнформация.АналитикаУчетаПоПартнерам
	|				И РасчетыПоСрокамОстатки.ОбъектРасчетов             = ВспомогательнаяИнформация.ОбъектРасчетов
	|				И РасчетыПоСрокамОстатки.Валюта                     = ВспомогательнаяИнформация.Валюта
	|				И РасчетыПоСрокамОстатки.РасчетныйДокумент          = ВспомогательнаяИнформация.РасчетныйДокумент
	|				И РасчетыПоСрокамОстатки.ДатаПлановогоПогашения     = ВспомогательнаяИнформация.ДатаПлановогоПогашения
	|				И РасчетыПоСрокамОстатки.ДатаВозникновения          = ВспомогательнаяИнформация.ДатаВозникновения
	|				И РасчетыПоСрокамОстатки.ПорядокОперации            = ВспомогательнаяИнформация.ПорядокОперации
	|				И ВспомогательнаяИнформация.Активность
	|				И ВспомогательнаяИнформация.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НЕ ВспомогательнаяИнформация.ДокументРегистратор ССЫЛКА Документ.РасчетКурсовыхРазниц
	|				И НЕ ВспомогательнаяИнформация.Сторно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметры
	|			ПО ВтПараметры.ПараметрОбъектРасчетов = РасчетыПоСрокамОстатки.ОбъектРасчетов
	|				И ВтПараметры.ПараметрАналитикаУчетаПоПартнерам = РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам
	|				И ВтПараметры.ПараметрВалюта = РасчетыПоСрокамОстатки.Валюта
	|				И ВспомогательнаяИнформация.Период < ВтПараметры.ПараметрДатаНачалаПересчета
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокамОстатки.ОбъектРасчетов,
	|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам,
	|	РасчетыПоСрокамОстатки.Валюта,
	|	РасчетыПоСрокамОстатки.РасчетныйДокумент,
	|	РасчетыПоСрокамОстатки.ДатаВозникновения,
	|	РасчетыПоСрокамОстатки.ПорядокОперации,
	|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения,
	|	РасчетыПоСрокамОстатки.ПредоплатаОстаток,
	|	РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток,
	|	РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток,
	|	РасчетыПоСрокамОстатки.ДолгОстаток,
	|	РасчетыПоСрокамОстатки.ДолгРеглОстаток,
	|	РасчетыПоСрокамОстатки.ДолгУпрОстаток,
	|	РасчетыПоСрокамОстатки.ПредоплатаОстаток <> 0,
	|	РасчетыПоСрокамОстатки.ДолгОстаток <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта,
	|	ЕстьПредоплата,
	|	ЕстьДолг";
	
	ТекстЗапросаРасчетыПоСрокамОстатки = СтрЗаменить(ТекстЗапросаРасчетыПоСрокамОстатки, 
			"&ТекстПодзапроса", 
			"(" + ТекстПодзапроса + ")");
		
	Если Не ДатаНачалаПересчетаЕстьРазличные Тогда
		
		ТекстЗапросаРасчетыПоСрокамОстатки = СтрЗаменить(ТекстЗапросаРасчетыПоСрокамОстатки,
			"СУММА(ОстаткиИОбороты.ПредоплатаОстаток + ОстаткиИОбороты.ПредоплатаОборот)", 
			"ОстаткиИОбороты.ПредоплатаОстаток + ОстаткиИОбороты.ПредоплатаОборот");
		
		ТекстЗапросаРасчетыПоСрокамОстатки = СтрЗаменить(ТекстЗапросаРасчетыПоСрокамОстатки, 
			"СУММА(ОстаткиИОбороты.ПредоплатаРеглОстаток + ОстаткиИОбороты.ПредоплатаРеглОборот)",
			"ОстаткиИОбороты.ПредоплатаРеглОстаток + ОстаткиИОбороты.ПредоплатаРеглОборот");
		
		ТекстЗапросаРасчетыПоСрокамОстатки = СтрЗаменить(ТекстЗапросаРасчетыПоСрокамОстатки, 
			"СУММА(ОстаткиИОбороты.ПредоплатаУпрОстаток + ОстаткиИОбороты.ПредоплатаУпрОборот)",
			"ОстаткиИОбороты.ПредоплатаУпрОстаток + ОстаткиИОбороты.ПредоплатаУпрОборот");
		
		ТекстЗапросаРасчетыПоСрокамОстатки = СтрЗаменить(ТекстЗапросаРасчетыПоСрокамОстатки,
			"СУММА(ОстаткиИОбороты.ДолгОстаток + ОстаткиИОбороты.ДолгОборот)",
			"ОстаткиИОбороты.ДолгОстаток + ОстаткиИОбороты.ДолгОборот");
		
		ТекстЗапросаРасчетыПоСрокамОстатки = СтрЗаменить(ТекстЗапросаРасчетыПоСрокамОстатки,
			"СУММА(ОстаткиИОбороты.ДолгРеглОстаток + ОстаткиИОбороты.ДолгРеглОборот)",
			"ОстаткиИОбороты.ДолгРеглОстаток + ОстаткиИОбороты.ДолгРеглОборот");
		
		ТекстЗапросаРасчетыПоСрокамОстатки = СтрЗаменить(ТекстЗапросаРасчетыПоСрокамОстатки,
			"СУММА(ОстаткиИОбороты.ДолгУпрОстаток + ОстаткиИОбороты.ДолгУпрОборот)",
			"ОстаткиИОбороты.ДолгУпрОстаток + ОстаткиИОбороты.ДолгУпрОборот");
		
		ГруппировкаПодзапроса ="
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиИОбороты.ОбъектРасчетов,
		|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам,
		|	ОстаткиИОбороты.Валюта,
		|	ОстаткиИОбороты.РасчетныйДокумент,
		|	ОстаткиИОбороты.ДатаПлановогоПогашения,
		|	ОстаткиИОбороты.ДатаВозникновения";
		
		ТекстЗапросаРасчетыПоСрокамОстатки = СтрЗаменить(ТекстЗапросаРасчетыПоСрокамОстатки, ГруппировкаПодзапроса, "");
		
	КонецЕсли;
	
	Если НЕ РасчетыСКлиентами Тогда
		ТекстЗапросаРасчетыПоСрокамОстатки = СтрЗаменить(ТекстЗапросаРасчетыПоСрокамОстатки,
			"РегистрНакопления.РасчетыСКлиентамиПоСрокам",
			"РегистрНакопления.РасчетыСПоставщикамиПоСрокам");
		ТекстЗапросаРасчетыПоСрокамОстатки = СтрЗаменить(ТекстЗапросаРасчетыПоСрокамОстатки,
			"ВТ_ОстаткиКлиенты",
			"ВТ_ОстаткиПоставщики");
		ТекстЗапросаРасчетыПоСрокамОстатки = СтрЗаменить(ТекстЗапросаРасчетыПоСрокамОстатки,
			"ВТОстаткиСПоследнимМоментомПриходногоДвиженияКлиенты",
			"ВТОстаткиСПоследнимМоментомПриходногоДвиженияПоставщики");
		ТекстЗапросаРасчетыПоСрокамОстатки = СтрЗаменить(ТекстЗапросаРасчетыПоСрокамОстатки,
			"ВТРасчетыПоСрокамОстаткиКлиенты",
			"ВТРасчетыПоСрокамОстаткиПоставщики");
	КонецЕсли;
	
	Возврат ТекстЗапросаРасчетыПоСрокамОстатки;
	
КонецФункции

Функция ТекстЗапросаРасчетыДвиженияСМоментаПересчета(РасчетыСКлиентами = Истина)

	Если РасчетыСКлиентами Тогда
		#Область РасчетыСКлиентамиСМоментаПересчета
		ТекстЗапроса = "
		|ВЫБРАТЬ 
		|	Расчеты.Период КАК Период,
		|	Расчеты.ВидДвижения КАК ВидДвижения,
		|	Расчеты.Регистратор КАК Регистратор,
		|
		|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
		|	Расчеты.Валюта КАК Валюта,
		|	
		// Далее используются флаги ЭтоОтгрузка и ЭтоОплата и суммы по модулю.
		|	ВЫБОР КОГДА Расчеты.Сумма < 0 ТОГДА -Расчеты.Сумма ИНАЧЕ Расчеты.Сумма КОНЕЦ КАК Сумма,
		|	ВЫБОР КОГДА Расчеты.КОплате < 0 ТОГДА -Расчеты.КОплате ИНАЧЕ Расчеты.КОплате КОНЕЦ КАК КОплате,
		|	ВЫБОР КОГДА Расчеты.КОтгрузке < 0 ТОГДА -Расчеты.КОтгрузке ИНАЧЕ Расчеты.КОтгрузке КОНЕЦ КАК КОтгрузке,
		|
		|	Расчеты.ОперацияВзаиморасчетов КАК ОперацияВзаиморасчетов,
		|	Расчеты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	Расчеты.ПродажаПоЗаказу КАК ПродажаПоЗаказу,
		|	Расчеты.ДатаРегистратора КАК ДатаРегистратора,
		|	Расчеты.ДатаПлатежа КАК ДатаПлатежа,
		|	ВЫБОР КОГДА Расчеты.СуммаРегл < 0 ТОГДА -Расчеты.СуммаРегл ИНАЧЕ Расчеты.СуммаРегл КОНЕЦ КАК СуммаРегл,
		|	ВЫБОР КОГДА Расчеты.СуммаУпр < 0 ТОГДА -Расчеты.СуммаУпр ИНАЧЕ Расчеты.СуммаУпр КОНЕЦ КАК СуммаУпр,
		|	Расчеты.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
		|	Расчеты.ПорядокОперации КАК ПорядокОперации,
		|	Расчеты.ПорядокЗачетаПоДатеПлатежа КАК ПорядокЗачетаПоДатеПлатежа,
		|	Расчеты.СвязанныйДокумент КАК СвязанныйДокумент,
		|	Расчеты.ВариантОплаты КАК ВариантОплаты,
		|	Расчеты.ВалютаДокумента КАК ВалютаДокумента,
		|	Расчеты.КорОбъектРасчетов КАК КорОбъектРасчетов,
		|	Расчеты.КорАналитикаУчетаПоПартнерам КАК КорАналитикаУчетаПоПартнерам,
		|	Расчеты.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
		|	Расчеты.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
		|	Расчеты.ОбъектРасчетовПриемник КАК ОбъектРасчетовПриемник,
		|	Расчеты.АналитикаУчетаПоПартнерамПриемник КАК АналитикаУчетаПоПартнерамПриемник,
		|	Расчеты.ВалютаПриемник КАК ВалютаПриемник,
		|	ВЫБОР КОГДА Расчеты.СуммаПриемник < 0 ТОГДА -Расчеты.СуммаПриемник ИНАЧЕ Расчеты.СуммаПриемник КОНЕЦ КАК СуммаПриемник,
		|	Расчеты.ПоДаннымОбъектаРасчетовИсточника КАК ПоДаннымОбъектаРасчетовИсточника,
		|	Расчеты.Сторно КАК Сторно,
		|
		|	(Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			И Расчеты.Сумма < 0
		|		ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			И Расчеты.Сумма> 0) КАК ЭтоОплата,
		|
		|	Расчеты.ВалютаДокумента = Параметры.ПараметрВалютаРегламентированногоУчета
		|		ИЛИ Параметры.ПараметрВалюта = Параметры.ПараметрВалютаРегламентированногоУчета КАК РучнойКурсРегл,
		|
		|	Расчеты.ВалютаДокумента = &ВалютаУпр 
		|		ИЛИ Параметры.ПараметрВалюта = &ВалютаУпр КАК РучнойКурсУпр,
		|
		|	Расчеты.КурсЧислительВалютыВзаиморасчетов КАК КурсЧислительВалютыВзаиморасчетов,
		|	Расчеты.КурсЗнаменательВалютыВзаиморасчетов КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	Расчеты.КурсЧислительВалютыУпр КАК КурсЧислительВалютыУпр,
		|	Расчеты.КурсЗнаменательВалютыУпр КАК КурсЗнаменательВалютыУпр
		|
		|ПОМЕСТИТЬ РасчетыДвиженияКлиенты
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК Параметры
		|			ПО Расчеты.ОбъектРасчетов = Параметры.ПараметрОбъектРасчетов
		|				И Расчеты.АналитикаУчетаПоПартнерам = Параметры.ПараметрАналитикаУчетаПоПартнерам
		|				И Расчеты.Валюта = Параметры.ПараметрВалюта
		|				И Расчеты.Период >= Параметры.ПараметрДатаНачалаПересчета
		|ГДЕ
		|	Расчеты.Активность
		|	И НЕ Расчеты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
		|	И Параметры.ПараметрЭтоРасчетыСКлиентами
		|	И (Расчеты.Сумма <> 0 ИЛИ Расчеты.КОплате <> 0  ИЛИ Расчеты.КОтгрузке <> 0)
		|	
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРасчетов,
		|	АналитикаУчетаПоПартнерам,
		|	Валюта,
		|	ВидДвижения";
		#КонецОбласти
	Иначе
		#Область РасчетыСПоставщикамиСМоментаПересчета
		
		ТекстЗапроса = "
		|ВЫБРАТЬ 
		|	Расчеты.Период КАК Период,
		|	Расчеты.ВидДвижения КАК ВидДвижения,
		|	Расчеты.Регистратор КАК Регистратор,
		|
		|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
		|	Расчеты.Валюта КАК Валюта,
		|	
		|	ВЫБОР КОГДА Расчеты.Сумма < 0 ТОГДА -Расчеты.Сумма ИНАЧЕ Расчеты.Сумма КОНЕЦ КАК Сумма,
		|	ВЫБОР КОГДА Расчеты.КОплате < 0 ТОГДА -Расчеты.КОплате ИНАЧЕ Расчеты.КОплате КОНЕЦ КАК КОплате,
		|	ВЫБОР КОГДА Расчеты.КПоступлению < 0 ТОГДА -Расчеты.КПоступлению ИНАЧЕ Расчеты.КПоступлению КОНЕЦ КАК КОтгрузке,
		|	
		|	Расчеты.ОперацияВзаиморасчетов КАК ОперацияВзаиморасчетов,
		|	Расчеты.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	Расчеты.ЗакупкаПоЗаказу КАК ЗакупкаПоЗаказу,
		|	Расчеты.ДатаРегистратора КАК ДатаРегистратора,
		|	Расчеты.ДатаПлатежа КАК ДатаПлатежа,
		|	ВЫБОР КОГДА Расчеты.СуммаРегл < 0 ТОГДА -Расчеты.СуммаРегл ИНАЧЕ Расчеты.СуммаРегл КОНЕЦ КАК СуммаРегл,
		|	ВЫБОР КОГДА Расчеты.СуммаУпр < 0 ТОГДА -Расчеты.СуммаУпр ИНАЧЕ Расчеты.СуммаУпр КОНЕЦ КАК СуммаУпр,
		|	Расчеты.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
		|	Расчеты.ПорядокОперации КАК ПорядокОперации,
		|	Расчеты.ПорядокЗачетаПоДатеПлатежа КАК ПорядокЗачетаПоДатеПлатежа,
		|	Расчеты.СвязанныйДокумент КАК СвязанныйДокумент,
		|	Расчеты.ВариантОплаты КАК ВариантОплаты,
		|	Расчеты.ВалютаДокумента КАК ВалютаДокумента,
		|	Расчеты.КорОбъектРасчетов КАК КорОбъектРасчетов,
		|	Расчеты.КорАналитикаУчетаПоПартнерам КАК КорАналитикаУчетаПоПартнерам,
		|	Расчеты.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
		|	Расчеты.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
		|	Расчеты.ОбъектРасчетовПриемник КАК ОбъектРасчетовПриемник,
		|	Расчеты.АналитикаУчетаПоПартнерамПриемник КАК АналитикаУчетаПоПартнерамПриемник,
		|	Расчеты.ВалютаПриемник КАК ВалютаПриемник,
		|	ВЫБОР КОГДА Расчеты.СуммаПриемник < 0 ТОГДА -Расчеты.СуммаПриемник ИНАЧЕ Расчеты.СуммаПриемник КОНЕЦ КАК СуммаПриемник,
		|	Расчеты.ПоДаннымОбъектаРасчетовИсточника КАК ПоДаннымОбъектаРасчетовИсточника,
		|	Расчеты.Сторно КАК Сторно,
		|
		|	(Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И Расчеты.Сумма + Расчеты.КОплате < 0
		|		ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И Расчеты.Сумма + Расчеты.КОплате > 0) КАК ЭтоОплата,
		|	Расчеты.ВалютаДокумента = Параметры.ПараметрВалютаРегламентированногоУчета
		|			ИЛИ Параметры.ПараметрВалюта = Параметры.ПараметрВалютаРегламентированногоУчета КАК РучнойКурсРегл,
		|	Расчеты.ВалютаДокумента = &ВалютаУпр 
		|			ИЛИ Параметры.ПараметрВалюта = &ВалютаУпр КАК РучнойКурсУпр,
		|
		|	Расчеты.КурсЧислительВалютыВзаиморасчетов КАК КурсЧислительВалютыВзаиморасчетов,
		|	Расчеты.КурсЗнаменательВалютыВзаиморасчетов КАК КурсЗнаменательВалютыВзаиморасчетов,
		|	Расчеты.КурсЧислительВалютыУпр КАК КурсЧислительВалютыУпр,
		|	Расчеты.КурсЗнаменательВалютыУпр КАК КурсЗнаменательВалютыУпр
		|
		|ПОМЕСТИТЬ РасчетыДвиженияПоставщики
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК Параметры
		|			ПО Расчеты.ОбъектРасчетов = Параметры.ПараметрОбъектРасчетов
		|				И Расчеты.АналитикаУчетаПоПартнерам = Параметры.ПараметрАналитикаУчетаПоПартнерам
		|				И Расчеты.Валюта = Параметры.ПараметрВалюта
		|				И Расчеты.Период >= Параметры.ПараметрДатаНачалаПересчета
		|ГДЕ
		|	Расчеты.Активность
		|	И НЕ Расчеты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
		|	И НЕ Параметры.ПараметрЭтоРасчетыСКлиентами
		|	И (Расчеты.Сумма <> 0 ИЛИ Расчеты.КОплате <> 0  ИЛИ Расчеты.КПоступлению <> 0)
		|	
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРасчетов,
		|	АналитикаУчетаПоПартнерам,
		|	Валюта,
		|	ВидДвижения";
		#КонецОбласти
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРасчетыПланОплатОстатки(ДатаНачалаПересчетаЕстьРазличные, РасчетыСКлиентами)
	
	МассивТекстовПодзапроса = Новый Массив;
	
	ТекстПодзапросаОстатки = "
	|ВЫБРАТЬ
	|	РасчетыПланОплат.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПланОплат.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПланОплат.Валюта КАК Валюта,
	|	РасчетыПланОплат.ДокументПлан КАК ДокументПлан,
	|	РасчетыПланОплат.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	РасчетыПланОплат.ДатаВозникновения КАК ДатаВозникновения,
	|	РасчетыПланОплат.ВариантОплаты КАК ВариантОплаты,
	|	РасчетыПланОплат.НераспределенныйАванс КАК НераспределенныйАванс,
	|	РасчетыПланОплат.КОплатеОстаток КАК КОплатеОстаток,
	|	0 КАК КОплатеООборот
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОплат.Остатки(&ДатаНачалаПересчетаМинимальный, (АналитикаУчетаПоПартнерам,
	|		ОбъектРасчетов, Валюта) В
	|		(ВЫБРАТЬ
	|			ВтПараметры.ПараметрАналитикаУчетаПоПартнерам,
	|			ВтПараметры.ПараметрОбъектРасчетов,
	|			ВтПараметры.ПараметрВалюта
	|		ИЗ
	|			ВтДополненныеПараметрыРаспределения КАК ВтПараметры)) КАК РасчетыПланОплат";
	
	МассивТекстовПодзапроса.Добавить(ТекстПодзапросаОстатки);
	
	Если ДатаНачалаПересчетаЕстьРазличные Тогда
		
		ТекстПодзапросаДвижения = "
		|ВЫБРАТЬ
		|	РасчетыПланОплат.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	РасчетыПланОплат.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасчетыПланОплат.Валюта КАК Валюта,
		|	РасчетыПланОплат.ДокументПлан КАК ДокументПлан,
		|	РасчетыПланОплат.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
		|	РасчетыПланОплат.ДатаВозникновения КАК ДатаВозникновения,
		|	РасчетыПланОплат.ВариантОплаты КАК ВариантОплаты,
		|	РасчетыПланОплат.НераспределенныйАванс КАК НераспределенныйАванс,
		|	СУММА(0) КАК КОплатеОстаток,
		|	СУММА(ВЫБОР
		|		КОГДА РасчетыПланОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РасчетыПланОплат.КОплате
		|		ИНАЧЕ -РасчетыПланОплат.КОплате
		|	КОНЕЦ) КАК КОплатеООборот
		|ИЗ
		|	ВтДополненныеПараметрыРаспределения КАК ВтПараметры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПланОплат КАК РасчетыПланОплат
		|		ПО ВтПараметры.ПараметрОбъектРасчетов = РасчетыПланОплат.ОбъектРасчетов
		|		И ВтПараметры.ПараметрАналитикаУчетаПоПартнерам = РасчетыПланОплат.АналитикаУчетаПоПартнерам
		|		И ВтПараметры.ПараметрВалюта = РасчетыПланОплат.Валюта
		|		И РасчетыПланОплат.Активность
		|		И РасчетыПланОплат.Период >= &ДатаНачалаПересчетаМинимальный
		|		И РасчетыПланОплат.Период < ВтПараметры.ПараметрДатаНачалаПересчета
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПланОплат.АналитикаУчетаПоПартнерам,
		|	РасчетыПланОплат.ОбъектРасчетов,
		|	РасчетыПланОплат.Валюта,
		|	РасчетыПланОплат.ДокументПлан,
		|	РасчетыПланОплат.ДатаПлановогоПогашения,
		|	РасчетыПланОплат.ДатаВозникновения,
		|	РасчетыПланОплат.ВариантОплаты,
		|	РасчетыПланОплат.НераспределенныйАванс";
		
		МассивТекстовПодзапроса.Добавить(ТекстПодзапросаДвижения);
		
	КонецЕсли;
	
	ТекстПодзапроса = СтрСоединить(МассивТекстовПодзапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстЗапросаРасчетыПланОплатОстатки = "
	|ВЫБРАТЬ
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОстаткиИОбороты.Валюта КАК Валюта,
	|	ОстаткиИОбороты.ДокументПлан КАК ДокументПлан,
	|	ОстаткиИОбороты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	ОстаткиИОбороты.ДатаВозникновения КАК ДатаВозникновения,
	|	ОстаткиИОбороты.ВариантОплаты КАК ВариантОплаты,
	|	СУММА(ВЫБОР КОГДА НЕ ОстаткиИОбороты.НераспределенныйАванс 
	|				ТОГДА ОстаткиИОбороты.КОплатеОстаток + ОстаткиИОбороты.КОплатеООборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КОплате,
	|	СУММА(ВЫБОР КОГДА ОстаткиИОбороты.НераспределенныйАванс 
	|				ТОГДА ОстаткиИОбороты.КОплатеОстаток + ОстаткиИОбороты.КОплатеООборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КОплатеНераспределенныйАванс,
	|	СУММА(ВЫБОР КОГДА ОстаткиИОбороты.НераспределенныйАванс 
	|				ТОГДА ОстаткиИОбороты.КОплатеОстаток + ОстаткиИОбороты.КОплатеООборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0 КАК ЕстьКОплатеНераспределенныйАванс
	|ПОМЕСТИТЬ ВТРасчетыПланОплатОстаткиКлиенты
	|ИЗ
	|	&ТекстПодзапроса КАК ОстаткиИОбороты
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.ОбъектРасчетов,
	|	ОстаткиИОбороты.Валюта,
	|	ОстаткиИОбороты.ДокументПлан,
	|	ОстаткиИОбороты.ДатаПлановогоПогашения,
	|	ОстаткиИОбороты.ДатаВозникновения,
	|	ОстаткиИОбороты.ВариантОплаты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта,
	|	ДокументПлан,
	|	ДатаПлановогоПогашения
	|";
		
	ТекстЗапросаРасчетыПланОплатОстатки = СтрЗаменить(ТекстЗапросаРасчетыПланОплатОстатки,
		"&ТекстПодзапроса",
		"(" + ТекстПодзапроса + ")");
	
	Если НЕ РасчетыСКлиентами Тогда
		ТекстЗапросаРасчетыПланОплатОстатки = СтрЗаменить(ТекстЗапросаРасчетыПланОплатОстатки,
			"РегистрНакопления.РасчетыСКлиентамиПланОплат",
			"РегистрНакопления.РасчетыСПоставщикамиПланОплат");
		
		ТекстЗапросаРасчетыПланОплатОстатки = СтрЗаменить(ТекстЗапросаРасчетыПланОплатОстатки,
			"ВТРасчетыПланОплатОстаткиКлиенты",
			"ВТРасчетыПланОплатОстаткиПоставщики");
	КонецЕсли; 
	
	Возврат ТекстЗапросаРасчетыПланОплатОстатки;
	
КонецФункции

Функция ТекстЗапросаРасчетыПланОтгрузокПоставокОстатки(ДатаНачалаПересчетаЕстьРазличные, РасчетыСКлиентами)
	
	МассивТекстовПодзапроса = Новый Массив;
	
	ТекстПодзапросаОстатки = "
	|ВЫБРАТЬ
	|	РасчетыПланОплат.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПланОплат.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПланОплат.Валюта КАК Валюта,
	|	РасчетыПланОплат.ДокументПлан КАК ДокументПлан,
	|	РасчетыПланОплат.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	РасчетыПланОплат.ДатаВозникновения КАК ДатаВозникновения,
	|	РасчетыПланОплат.НераспределенныйАванс КАК НераспределенныйАванс,
	|	РасчетыПланОплат.СуммаОстаток КАК СуммаОстаток,
	|	0 КАК СуммаООборот
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОтгрузок.Остатки(&ДатаНачалаПересчетаМинимальный, (АналитикаУчетаПоПартнерам,
	|		ОбъектРасчетов, Валюта) В
	|		(ВЫБРАТЬ
	|			ВтПараметры.ПараметрАналитикаУчетаПоПартнерам,
	|			ВтПараметры.ПараметрОбъектРасчетов,
	|			ВтПараметры.ПараметрВалюта
	|		ИЗ
	|			ВтДополненныеПараметрыРаспределения КАК ВтПараметры)) КАК РасчетыПланОплат";
	
	МассивТекстовПодзапроса.Добавить(ТекстПодзапросаОстатки);
	
	Если ДатаНачалаПересчетаЕстьРазличные Тогда
		
		ТекстПодзапросаДвижения = "
		|ВЫБРАТЬ
		|	РасчетыПланОплат.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	РасчетыПланОплат.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасчетыПланОплат.Валюта КАК Валюта,
		|	РасчетыПланОплат.ДокументПлан КАК ДокументПлан,
		|	РасчетыПланОплат.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
		|	РасчетыПланОплат.ДатаВозникновения КАК ДатаВозникновения,
		|	РасчетыПланОплат.НераспределенныйАванс КАК НераспределенныйАванс,
		|	СУММА(0) КАК СуммаОстаток,
		|	СУММА(ВЫБОР
		|		КОГДА РасчетыПланОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РасчетыПланОплат.Сумма
		|		ИНАЧЕ -РасчетыПланОплат.Сумма
		|	КОНЕЦ) КАК СуммаООборот
		|ИЗ
		|	ВтДополненныеПараметрыРаспределения КАК ВтПараметры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПланОтгрузок КАК РасчетыПланОплат
		|		ПО ВтПараметры.ПараметрОбъектРасчетов = РасчетыПланОплат.ОбъектРасчетов
		|		И ВтПараметры.ПараметрАналитикаУчетаПоПартнерам = РасчетыПланОплат.АналитикаУчетаПоПартнерам
		|		И ВтПараметры.ПараметрВалюта = РасчетыПланОплат.Валюта
		|		И РасчетыПланОплат.Активность
		|		И РасчетыПланОплат.Период >= &ДатаНачалаПересчетаМинимальный
		|		И РасчетыПланОплат.Период < ВтПараметры.ПараметрДатаНачалаПересчета
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПланОплат.АналитикаУчетаПоПартнерам,
		|	РасчетыПланОплат.ОбъектРасчетов,
		|	РасчетыПланОплат.Валюта,
		|	РасчетыПланОплат.ДокументПлан,
		|	РасчетыПланОплат.ДатаПлановогоПогашения,
		|	РасчетыПланОплат.ДатаВозникновения,
		|	РасчетыПланОплат.НераспределенныйАванс";
		
		МассивТекстовПодзапроса.Добавить(ТекстПодзапросаДвижения);
		
	КонецЕсли;
	
	ТекстПодзапроса = СтрСоединить(МассивТекстовПодзапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	ТекстЗапросаРасчетыПланОтгрузокПоставокОстатки = "
	|ВЫБРАТЬ
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОстаткиИОбороты.Валюта КАК Валюта,
	|	ОстаткиИОбороты.ДокументПлан КАК ДокументПлан,
	|	ОстаткиИОбороты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	ОстаткиИОбороты.ДатаВозникновения КАК ДатаВозникновения,
	|	СУММА(ВЫБОР КОГДА НЕ ОстаткиИОбороты.НераспределенныйАванс 
	|				ТОГДА ОстаткиИОбороты.СуммаОстаток + ОстаткиИОбороты.СуммаООборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР КОГДА ОстаткиИОбороты.НераспределенныйАванс 
	|				ТОГДА ОстаткиИОбороты.СуммаОстаток + ОстаткиИОбороты.СуммаООборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНераспределенныйАванс,
	|	СУММА(ВЫБОР КОГДА ОстаткиИОбороты.НераспределенныйАванс 
	|				ТОГДА ОстаткиИОбороты.СуммаОстаток + ОстаткиИОбороты.СуммаООборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0 КАК ЕстьСуммаНераспределенныйАванс
	|ПОМЕСТИТЬ ВТРасчетыПланОтгрузокПоставокОстаткиКлиенты
	|ИЗ
	|	&ТекстПодзапроса КАК ОстаткиИОбороты
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.ОбъектРасчетов,
	|	ОстаткиИОбороты.Валюта,
	|	ОстаткиИОбороты.ДокументПлан,
	|	ОстаткиИОбороты.ДатаПлановогоПогашения,
	|	ОстаткиИОбороты.ДатаВозникновения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта";
	
	ТекстЗапросаРасчетыПланОтгрузокПоставокОстатки = СтрЗаменить(ТекстЗапросаРасчетыПланОтгрузокПоставокОстатки, 
			"&ТекстПодзапроса", 
			"(" + ТекстПодзапроса + ")");
			
	Если НЕ РасчетыСКлиентами Тогда
		ТекстЗапросаРасчетыПланОтгрузокПоставокОстатки = СтрЗаменить(ТекстЗапросаРасчетыПланОтгрузокПоставокОстатки,
			"РегистрНакопления.РасчетыСКлиентамиПланОтгрузок",
			"РегистрНакопления.РасчетыСПоставщикамиПланПоставок");
		ТекстЗапросаРасчетыПланОтгрузокПоставокОстатки = СтрЗаменить(ТекстЗапросаРасчетыПланОтгрузокПоставокОстатки,
			"ВТРасчетыПланОтгрузокПоставокОстаткиКлиенты","ВТРасчетыПланОтгрузокПоставокОстаткиПоставщики");
	КонецЕсли; 
	
	Возврат ТекстЗапросаРасчетыПланОтгрузокПоставокОстатки;
	
КонецФункции

// Для исправлений и сторно движения исходных документов, не входящих в период распределения, копируются "Как есть".
Функция ТекстЗапросИсходныеРегистраторы(ЭтоРасчетыСКлиентами)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Движения.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Движения.ОбъектРасчетов            КАК ОбъектРасчетов,
	|	Движения.Валюта                    КАК Валюта,
	|
	|	Реестр.СторнируемыйДокумент        КАК СторнируемыйРегистратор,
	|	Реестр.ИсправляемыйДокумент        КАК ИсправляемыйДокумент,
	|	МИНИМУМ(НАЧАЛОПЕРИОДА(ЕСТЬNULL(ИсходныйДокумент.ДатаДокументаИБ,ДАТАВРЕМЯ(1,1,1)), ДЕНЬ)) КАК ИсходнаяДатаВозникновения,
	|
	|	Движения.Регистратор                         КАК НовыйРегистратор,
	|	МИНИМУМ(Движения.Период)                     КАК НовыйПериод,
	|	НАЧАЛОПЕРИОДА(МИНИМУМ(Движения.Период),ДЕНЬ) КАК НовыйПериодНачалоДня,
	|	МИНИМУМ(Движения.ПорядокОперации)            КАК НовыйПорядокОперации,
	|	ЛОЖЬ КАК Отсторнировано
	|ПОМЕСТИТЬ ВтИсходныеРегистраторыКлиенты
	|ИЗ
	|	РасчетыДвиженияКлиенты КАК Движения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|			ПО Реестр.Ссылка = Движения.Регистратор
	|				И Реестр.СторноИсправление
	|				И Реестр.Проведен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК ИсходныйДокумент
	|			ПО ИсходныйДокумент.Ссылка = Реестр.ИсправляемыйДокумент
	|СГРУППИРОВАТЬ ПО 
	|	Движения.АналитикаУчетаПоПартнерам,
	|	Движения.ОбъектРасчетов,
	|	Движения.Валюта,
	|	Реестр.СторнируемыйДокумент,
	|	Реестр.ИсправляемыйДокумент,
	|	Движения.Регистратор
	|";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РасчетыДвиженияКлиенты","РасчетыДвиженияПоставщики");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ВтИсходныеРегистраторыКлиенты","ВтИсходныеРегистраторыПоставщики");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает таблицу движений исходных документов, которые сторнируются в текущем распределении
Функция ДвиженияСторнируемыхДокументовДоНачалаРасчета(Запрос, ЭтоРасчетыСКлиентами = Ложь)
	
	Запрос.Текст = "
	|	ВЫБРАТЬ
	|		ИсходныеРасчетыПоСрокам.Период                             КАК Период,
	|		ИсходныеРасчетыПоСрокам.ВидДвижения                        КАК ВидДвижения,
	|		ИсходныеРасчетыПоСрокам.ДокументРегистратор                КАК ДокументРегистратор,
	|		ИсходныеРасчетыПоСрокам.ОбъектРасчетов                     КАК ОбъектРасчетов,
	|		ИсходныеРасчетыПоСрокам.АналитикаУчетаПоПартнерам          КАК АналитикаУчетаПоПартнерам,
	|		ИсходныеРасчетыПоСрокам.Валюта                             КАК Валюта,
	|		ИсходныеРасчетыПоСрокам.ДатаПлановогоПогашения             КАК ДатаПлановогоПогашения,
	|		ИсходныеРасчетыПоСрокам.ДатаВозникновения                  КАК ДатаВозникновения,
	|		ИсходныеРасчетыПоСрокам.ПорядокОперации                    КАК ПорядокОперации,
	|		ИсходныеРасчетыПоСрокам.ПорядокЗачета                      КАК ПорядокЗачета,
	|		ИсходныеРасчетыПоСрокам.РасчетныйДокумент                  КАК РасчетныйДокумент,
	|		ИсходныеРасчетыПоСрокам.ХозяйственнаяОперация              КАК ХозяйственнаяОперация,
	|		ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПустаяСсылка) КАК ОперацияВзаиморасчетов,
	|		ИсходныеРасчетыПоСрокам.ТипЗаписиВзаиморасчетов            КАК ТипЗаписиВзаиморасчетов,
	|		ИсходныеРасчетыПоСрокам.КорОбъектРасчетов                  КАК КорОбъектРасчетов,
	|		ИсходныеРасчетыПоСрокам.КорАналитикаУчетаПоПартнерам       КАК КорАналитикаУчетаПоПартнерам,
	|		ИсходныеРасчетыПоСрокам.АналитикаУчетаПоПартнерамПриемник  КАК АналитикаУчетаПоПартнерамПриемник,
	|		ИсходныеРасчетыПоСрокам.ОбъектРасчетовПриемник             КАК ОбъектРасчетовПриемник,
	|		ИсходныеРасчетыПоСрокам.ВалютаПриемник                     КАК ВалютаПриемник,
	|		ИсходныеРасчетыПоСрокам.СуммаПриемник                      КАК СуммаПриемник,
	|		ИсходныеРасчетыПоСрокам.ПоДаннымОбъектаРасчетовИсточника   КАК ПоДаннымОбъектаРасчетовИсточника,
	|		
	|		ЛОЖЬ                                                       КАК Сторно,
	|		
	|		ИсходныеРасчетыПоСрокам.Долг           КАК Долг,
	|		ИсходныеРасчетыПоСрокам.ДолгРегл       КАК ДолгРегл,
	|		ИсходныеРасчетыПоСрокам.ДолгУпр        КАК ДолгУпр,
	|		ИсходныеРасчетыПоСрокам.Предоплата     КАК Предоплата,
	|		ИсходныеРасчетыПоСрокам.ПредоплатаРегл КАК ПредоплатаРегл,
	|		ИсходныеРасчетыПоСрокам.ПредоплатаУпр  КАК ПредоплатаУпр,
	|
	|		0 КАК Исправлено,
	|
	|		ИсходныеРасчетыПоСрокам.ВалютаДокумента                 КАК ВалютаДокумента,
	|		ИсходныеРасчетыПоСрокам.СтатьяДвиженияДенежныхСредств   КАК СтатьяДвиженияДенежныхСредств,
	|		ИсходныеРасчетыПоСрокам.ИдентификаторФинЗаписи          КАК ИдентификаторФинЗаписи,
	|		ИсходныеРасчетыПоСрокам.НастройкаХозяйственнойОперации  КАК НастройкаХозяйственнойОперации,
	|		ИсходныеРасчетыПоСрокам.СвязанныйДокумент               КАК СвязанныйДокумент,
	|		ЛОЖЬ                                                    КАК Отсторнировано
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК ИсходныеРасчетыПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИсходныеРегистраторыКлиенты КАК ВтИсходныеРегистраторы
	|				ПО ВтИсходныеРегистраторы.СторнируемыйРегистратор = ИсходныеРасчетыПоСрокам.ДокументРегистратор
	|					И ВтИсходныеРегистраторы.АналитикаУчетаПоПартнерам = ИсходныеРасчетыПоСрокам.АналитикаУчетаПоПартнерам
	|					И ВтИсходныеРегистраторы.ОбъектРасчетов = ИсходныеРасчетыПоСрокам.ОбъектРасчетов
	|					И ВтИсходныеРегистраторы.Валюта = ИсходныеРасчетыПоСрокам.Валюта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметры
	|				ПО ИсходныеРасчетыПоСрокам.АналитикаУчетаПоПартнерам = ВтПараметры.ПараметрАналитикаУчетаПоПартнерам
	|					И ИсходныеРасчетыПоСрокам.ОбъектРасчетов = ВтПараметры.ПараметрОбъектРасчетов
	|					И ИсходныеРасчетыПоСрокам.Валюта = ВтПараметры.ПараметрВалюта
	|	ГДЕ
	|		НЕ ИсходныеРасчетыПоСрокам.Сторно
	|		И ИсходныеРасчетыПоСрокам.Период < ВтПараметры.ПараметрДатаНачалаПересчета";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВтИсходныеРегистраторыКлиенты","ВтИсходныеРегистраторыПоставщики");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрНакопления.РасчетыСКлиентамиПоСрокам","РегистрНакопления.РасчетыСПоставщикамиПоСрокам");
	КонецЕсли;
	
	Движения = Запрос.Выполнить().Выгрузить();
	Возврат Движения;
	
КонецФункции

// Возвращает таблицу движений исходных документов, которые сторнируются в текущем распределении
Функция ДвиженияСторнируемыхДокументовПланОплатДоНачалаРасчета(Запрос, ЭтоРасчетыСКлиентами = Ложь)
	
	Запрос.Текст = "
	|	ВЫБРАТЬ
	|		ИсходныеРасчеты.Период                        КАК Период,
	|		ИсходныеРасчеты.ВидДвижения                   КАК ВидДвижения,
	|		ИсходныеРасчеты.ДокументРегистратор           КАК ДокументРегистратор,
	|		ИсходныеРасчеты.ОбъектРасчетов                КАК ОбъектРасчетов,
	|		ИсходныеРасчеты.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|		ИсходныеРасчеты.Валюта                        КАК Валюта,
	|		ИсходныеРасчеты.ДокументПлан                  КАК ДокументПлан,
	|		ИсходныеРасчеты.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
	|		ИсходныеРасчеты.ДатаВозникновения             КАК ДатаВозникновения,
	|		ИсходныеРасчеты.ВариантОплаты                 КАК ВариантОплаты,
	|		ИсходныеРасчеты.НераспределенныйАванс         КАК НераспределенныйАванс,
	|		ИсходныеРасчеты.ДокументОплаты                КАК ДокументОплаты,
	|		ЛОЖЬ                                          КАК Сторно,
	|		ИсходныеРасчеты.КОплате КАК КОплате
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПланОплат КАК ИсходныеРасчеты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИсходныеРегистраторыКлиенты КАК ВтИсходныеРегистраторы
	|				ПО ВтИсходныеРегистраторы.СторнируемыйРегистратор = ИсходныеРасчеты.ДокументРегистратор
	|					И ВтИсходныеРегистраторы.АналитикаУчетаПоПартнерам = ИсходныеРасчеты.АналитикаУчетаПоПартнерам
	|					И ВтИсходныеРегистраторы.ОбъектРасчетов = ИсходныеРасчеты.ОбъектРасчетов
	|					И ВтИсходныеРегистраторы.Валюта = ИсходныеРасчеты.Валюта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметры
	|				ПО ИсходныеРасчеты.АналитикаУчетаПоПартнерам = ВтПараметры.ПараметрАналитикаУчетаПоПартнерам
	|					И ИсходныеРасчеты.ОбъектРасчетов = ВтПараметры.ПараметрОбъектРасчетов
	|					И ИсходныеРасчеты.Валюта = ВтПараметры.ПараметрВалюта
	|	ГДЕ
	|		НЕ ИсходныеРасчеты.Сторно
	|		И ИсходныеРасчеты.Период < ВтПараметры.ПараметрДатаНачалаПересчета
	|		И НЕ ИсходныеРасчеты.НераспределенныйАванс";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВтИсходныеРегистраторыКлиенты","ВтИсходныеРегистраторыПоставщики");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрНакопления.РасчетыСКлиентамиПланОплат","РегистрНакопления.РасчетыСПоставщикамиПланОплат");
	КонецЕсли;
	
	Движения = Запрос.Выполнить().Выгрузить();
	Возврат Движения;
	
КонецФункции

// Возвращает таблицу движений исходных документов, которые сторнируются в текущем распределении
Функция ДвиженияСторнируемыхДокументовПланОтгрузокДоНачалаРасчета(Запрос, ЭтоРасчетыСКлиентами = Ложь)
	
	Запрос.Текст = "
	|	ВЫБРАТЬ
	|		ИсходныеРасчеты.Период                         КАК Период,
	|		ИсходныеРасчеты.ВидДвижения                    КАК ВидДвижения,
	|		ИсходныеРасчеты.ДокументРегистратор            КАК ДокументРегистратор,
	|		ИсходныеРасчеты.ОбъектРасчетов                 КАК ОбъектРасчетов,
	|		ИсходныеРасчеты.АналитикаУчетаПоПартнерам      КАК АналитикаУчетаПоПартнерам,
	|		ИсходныеРасчеты.Валюта                         КАК Валюта,
	|		ИсходныеРасчеты.ДокументПлан                   КАК ДокументПлан,
	|		ИсходныеРасчеты.ДатаПлановогоПогашения         КАК ДатаПлановогоПогашения,
	|		ИсходныеРасчеты.ДатаВозникновения              КАК ДатаВозникновения,
	|		ИсходныеРасчеты.НераспределенныйАванс          КАК НераспределенныйАванс,
	|		ЛОЖЬ                                           КАК Сторно,
	|		ИсходныеРасчеты.Сумма                          КАК Сумма,
	|		ИсходныеРасчеты.ДокументОплаты                 КАК ДокументОплаты
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПланОтгрузок КАК ИсходныеРасчеты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИсходныеРегистраторыКлиенты КАК ВтИсходныеРегистраторы
	|				ПО ВтИсходныеРегистраторы.СторнируемыйРегистратор = ИсходныеРасчеты.ДокументРегистратор
	|					И ВтИсходныеРегистраторы.АналитикаУчетаПоПартнерам = ИсходныеРасчеты.АналитикаУчетаПоПартнерам
	|					И ВтИсходныеРегистраторы.ОбъектРасчетов = ИсходныеРасчеты.ОбъектРасчетов
	|					И ВтИсходныеРегистраторы.Валюта = ИсходныеРасчеты.Валюта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметры
	|				ПО ИсходныеРасчеты.АналитикаУчетаПоПартнерам = ВтПараметры.ПараметрАналитикаУчетаПоПартнерам
	|					И ИсходныеРасчеты.ОбъектРасчетов = ВтПараметры.ПараметрОбъектРасчетов
	|					И ИсходныеРасчеты.Валюта = ВтПараметры.ПараметрВалюта
	|	ГДЕ
	|		НЕ ИсходныеРасчеты.Сторно
	|		И ИсходныеРасчеты.Период < ВтПараметры.ПараметрДатаНачалаПересчета
	|		И НЕ ИсходныеРасчеты.НераспределенныйАванс";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВтИсходныеРегистраторыКлиенты","ВтИсходныеРегистраторыПоставщики");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрНакопления.РасчетыСКлиентамиПланОтгрузок","РегистрНакопления.РасчетыСПоставщикамиПланПоставок");
	КонецЕсли;
	
	Движения = Запрос.Выполнить().Выгрузить();
	Возврат Движения;
	
КонецФункции

// Возвращает записи до начала расчета (порядка), количество которых в служебном документе регистраторе меньше размера порции записи
// Эти записи будут перезаписаны. В распределении не участвуют.
Функция ЗаписиДоНачалаРасчетаПоСрокам(Запрос, ГлобальныеПеременные, ЭтоРасчетыСКлиентами = Ложь)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Таблица.Документ КАК Регистратор
	|ПОМЕСТИТЬ ВтПолныеРегистраторы
	|ИЗ
	|РегистрСведений.КоличествоЗаписейРегистраторовРасчетов КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметры
	|			ПО Таблица.АналитикаУчетаПоПартнерам = ВтПараметры.ПараметрАналитикаУчетаПоПартнерам
	|				И Таблица.ОбъектРасчетов = ВтПараметры.ПараметрОбъектРасчетов
	|				И Таблица.Валюта = ВтПараметры.ПараметрВалюта
	|				И ВтПараметры.ПараметрЭтоРасчетыСКлиентами = &ЭтоРасчетыСКлиентами
	|ГДЕ
	|	Таблица.ИмяТаблицы = ""РасчетыСКлиентамиПоСрокам""
	|	И Таблица.ПериодЗаписи < ВтПараметры.ПараметрДатаНачалаПересчета
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Документ
	|ИМЕЮЩИЕ
	|	СУММА(Таблица.КоличествоЗаписей) = &РазмерПорцииЗаписи
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Регистраторы.Регистратор КАК Регистратор
	|ИЗ
	|	ВтПолныеРегистраторы КАК Регистраторы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Период КАК Период,
	|	Таблица.ВидДвижения КАК ВидДвижения,
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.ДокументРегистратор КАК ДокументРегистратор,
	|	Таблица.ПорядокОперации КАК ПорядокОперации,
	|	Таблица.Сторно КАК Сторно,
	|	ИСТИНА КАК ЗаписьДоНачалаРасчета,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПустаяСсылка) КАК ОперацияВзаиморасчетов,
	|
	|	Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Таблица.Валюта КАК Валюта,
	|	Таблица.РасчетныйДокумент КАК РасчетныйДокумент,
	|	Таблица.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	Таблица.ДатаВозникновения КАК ДатаВозникновения,
	|	
	|	Таблица.Предоплата КАК Предоплата,
	|	Таблица.ПредоплатаРегл КАК ПредоплатаРегл,
	|	Таблица.ПредоплатаУпр КАК ПредоплатаУпр,
	|	Таблица.Долг КАК Долг,
	|	Таблица.ДолгРегл КАК ДолгРегл,
	|	Таблица.ДолгУпр КАК ДолгУпр,
	|
	|	//Аккумулируют сколько движений сторно уже добавлено
	|	0 КАК Исправлено,
	|	
	|	Таблица.ПорядокЗачета КАК ПорядокЗачета,
	|	Таблица.ВалютаДокумента КАК ВалютаДокумента,
	|	Таблица.СвязанныйДокумент КАК СвязанныйДокумент,
	|	Таблица.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	Таблица.ТипЗаписиВзаиморасчетов КАК ТипЗаписиВзаиморасчетов,
	|	Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Таблица.КорАналитикаУчетаПоПартнерам КАК КорАналитикаУчетаПоПартнерам,
	|	Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	Таблица.КорОбъектРасчетов КАК КорОбъектРасчетов,
	|	Таблица.ПоДаннымОбъектаРасчетовИсточника КАК ПоДаннымОбъектаРасчетовИсточника,
	|	Таблица.ОбъектРасчетовПриемник КАК ОбъектРасчетовПриемник,
	|	Таблица.АналитикаУчетаПоПартнерамПриемник КАК АналитикаУчетаПоПартнерамПриемник,
	|	Таблица.ВалютаПриемник КАК ВалютаПриемник,
	|	Таблица.СуммаПриемник КАК СуммаПриемник
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПолныеРегистраторы КАК ВтПолныеРегистраторы
	|			ПО ВтПолныеРегистраторы.Регистратор = Таблица.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметры
	|			ПО Таблица.АналитикаУчетаПоПартнерам = ВтПараметры.ПараметрАналитикаУчетаПоПартнерам
	|				И Таблица.ОбъектРасчетов = ВтПараметры.ПараметрОбъектРасчетов
	|				И Таблица.Валюта = ВтПараметры.ПараметрВалюта
	|				И ВтПараметры.ПараметрЭтоРасчетыСКлиентами = &ЭтоРасчетыСКлиентами
	|ГДЕ
	|	ВтПолныеРегистраторы.Регистратор ЕСТЬ NULL // Если количество записей <> порции то они будут перераспределены.
	|	И Таблица.Период < ВтПараметры.ПараметрДатаНачалаПересчета
	|	И Таблица.Активность
	|;
	|УНИЧТОЖИТЬ ВтПолныеРегистраторы";
	
	Если ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЭтоРасчетыСКлиентами", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РасчетыСКлиентамиПоСрокам", "РасчетыСПоставщикамиПоСрокам");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЭтоРасчетыСКлиентами", "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(ЗАпрос.Текст, "ВтИсходныеРегистраторыКлиенты", "ВтИсходныеРегистраторыПоставщики")
	КонецЕсли;
	
	Результаты = Запрос.ВыполнитьПакет();
	ПолныеРегистраторы = Результаты[1].Выгрузить().ВыгрузитьКолонку("Регистратор");
	ЗаписиДоНачалаРасчета = Результаты[2].Выгрузить();
	
	Если ЭтоРасчетыСКлиентами Тогда
		ГлобальныеПеременные.Вставить("РасчетыСКлиентамиПоСрокамРегистраторы", ПолныеРегистраторы);
	Иначе
		ГлобальныеПеременные.Вставить("РасчетыСПоставщикамиПоСрокамРегистраторы", ПолныеРегистраторы);
	КонецЕсли;
	
	Возврат ЗаписиДоНачалаРасчета;
	
КонецФункции

// Возвращает записи до начала расчета (порядка), количество которых в служебном документе регистраторе меньше размера порции записи
Функция ЗаписиДоНачалаРасчетаПланОплат(Запрос, ГлобальныеПеременные, ЭтоРасчетыСКлиентами = Ложь)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Таблица.Документ КАК Регистратор
	|ПОМЕСТИТЬ ВтПолныеРегистраторы
	|ИЗ
	|РегистрСведений.КоличествоЗаписейРегистраторовРасчетов КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметры
	|			ПО Таблица.АналитикаУчетаПоПартнерам = ВтПараметры.ПараметрАналитикаУчетаПоПартнерам
	|				И Таблица.ОбъектРасчетов = ВтПараметры.ПараметрОбъектРасчетов
	|				И Таблица.Валюта = ВтПараметры.ПараметрВалюта
	|				И ВтПараметры.ПараметрЭтоРасчетыСКлиентами = &ЭтоРасчетыСКлиентами
	|ГДЕ
	|	Таблица.ИмяТаблицы = ""РасчетыСКлиентамиПланОплат""
	|	И Таблица.ПериодЗаписи < ВтПараметры.ПараметрДатаНачалаПересчета
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Документ
	|ИМЕЮЩИЕ
	|	СУММА(Таблица.КоличествоЗаписей) = &РазмерПорцииЗаписи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|ВЫБРАТЬ
	|	Регистраторы.Регистратор КАК Регистратор
	|ИЗ
	|	ВтПолныеРегистраторы КАК Регистраторы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Период КАК Период,
	|	Таблица.ВидДвижения КАК ВидДвижения,
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.ДокументРегистратор КАК ДокументРегистратор,
	|	Таблица.ПорядокОперации КАК ПорядокОперации,
	|	Таблица.Сторно КАК Сторно,
	|	ИСТИНА КАК ЗаписьДоНачалаРасчета,
	|	
	|	Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Таблица.Валюта КАК Валюта,
	|	Таблица.ДокументПлан КАК ДокументПлан,
	|	Таблица.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	Таблица.ДатаВозникновения КАК ДатаВозникновения,
	|	Таблица.ВариантОплаты КАК ВариантОплаты,
	|	Таблица.НераспределенныйАванс КАК НераспределенныйАванс,
	|	
	|	Таблица.КОплате КАК КОплате,
	|	
	|	Таблица.ДокументОплаты КАК ДокументОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОплат КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПолныеРегистраторы КАК ВтПолныеРегистраторы
	|			ПО ВтПолныеРегистраторы.Регистратор = Таблица.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметры
	|			ПО Таблица.АналитикаУчетаПоПартнерам = ВтПараметры.ПараметрАналитикаУчетаПоПартнерам
	|				И Таблица.ОбъектРасчетов = ВтПараметры.ПараметрОбъектРасчетов
	|				И Таблица.Валюта = ВтПараметры.ПараметрВалюта
	|				И Таблица.Период < ВтПараметры.ПараметрДатаНачалаПересчета
	|				И ВтПараметры.ПараметрЭтоРасчетыСКлиентами = &ЭтоРасчетыСКлиентами
	|ГДЕ
	|	ВтПолныеРегистраторы.Регистратор ЕСТЬ NULL // Если количество записей <> порции то они будут перераспределены.
	|	И Таблица.Активность
	|	И Таблица.Регистратор ССЫЛКА Документ.РегистраторРасчетов
	|;
	|УНИЧТОЖИТЬ ВтПолныеРегистраторы";
	
	Если ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЭтоРасчетыСКлиентами", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РасчетыСКлиентамиПланОплат", "РасчетыСПоставщикамиПланОплат");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЭтоРасчетыСКлиентами", "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(ЗАпрос.Текст, "ВтИсходныеРегистраторыКлиенты", "ВтИсходныеРегистраторыПоставщики")
	КонецЕсли;
	
	Результаты = Запрос.ВыполнитьПакет();
	ПолныеРегистраторы = Результаты[1].Выгрузить().ВыгрузитьКолонку("Регистратор");
	ЗаписиДоНачалаРасчета = Результаты[2].Выгрузить();
	
	Если ЭтоРасчетыСКлиентами Тогда
		ГлобальныеПеременные.Вставить("РасчетыСКлиентамиПланОплатРегистраторы", ПолныеРегистраторы);
	Иначе
		ГлобальныеПеременные.Вставить("РасчетыСПоставщикамиПланОплатРегистраторы", ПолныеРегистраторы);
	КонецЕсли;
	
	Возврат ЗаписиДоНачалаРасчета;
	
КонецФункции

// Возвращает записи до начала расчета (порядка), количество которых в служебном документе регистраторе меньше размера порции записи
Функция ЗаписиДоНачалаРасчетаПланОтгрузок(Запрос, ГлобальныеПеременные, ЭтоРасчетыСКлиентами = Ложь)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Таблица.Документ КАК Регистратор
	|ПОМЕСТИТЬ ВтПолныеРегистраторы
	|ИЗ
	|РегистрСведений.КоличествоЗаписейРегистраторовРасчетов КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметры
	|			ПО Таблица.АналитикаУчетаПоПартнерам = ВтПараметры.ПараметрАналитикаУчетаПоПартнерам
	|				И Таблица.ОбъектРасчетов = ВтПараметры.ПараметрОбъектРасчетов
	|				И Таблица.Валюта = ВтПараметры.ПараметрВалюта
	|				И ВтПараметры.ПараметрЭтоРасчетыСКлиентами = &ЭтоРасчетыСКлиентами
	|ГДЕ
	|	Таблица.ИмяТаблицы = ""РасчетыСКлиентамиПланОтгрузок""
	|	И Таблица.ПериодЗаписи < ВтПараметры.ПараметрДатаНачалаПересчета
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Документ
	|ИМЕЮЩИЕ
	|	СУММА(Таблица.КоличествоЗаписей) = &РазмерПорцииЗаписи
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Регистраторы.Регистратор КАК Регистратор
	|ИЗ
	|	ВтПолныеРегистраторы КАК Регистраторы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Период КАК Период,
	|	Таблица.ВидДвижения КАК ВидДвижения,
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.ДокументРегистратор КАК ДокументРегистратор,
	|	Таблица.ПорядокОперации КАК ПорядокОперации,
	|	Таблица.Сторно КАК Сторно,
	|	ИСТИНА КАК ЗаписьДоНачалаРасчета,
	|	
	|	Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Таблица.Валюта КАК Валюта,
	|	Таблица.ДокументПлан КАК ДокументПлан,
	|	Таблица.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	Таблица.ДатаВозникновения КАК ДатаВозникновения,
	|	Таблица.НераспределенныйАванс КАК НераспределенныйАванс,
	|	
	|	Таблица.Сумма КАК Сумма,
	|	ИСТИНА КАК УчтеноВОстаткахПлановыхОтгрузок,
	|	
	|	Таблица.ДокументОплаты КАК ДокументОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОтгрузок КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПолныеРегистраторы КАК ВтПолныеРегистраторы
	|			ПО ВтПолныеРегистраторы.Регистратор = Таблица.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметры
	|			ПО Таблица.АналитикаУчетаПоПартнерам = ВтПараметры.ПараметрАналитикаУчетаПоПартнерам
	|				И Таблица.ОбъектРасчетов = ВтПараметры.ПараметрОбъектРасчетов
	|				И Таблица.Валюта = ВтПараметры.ПараметрВалюта
	|				И ВтПараметры.ПараметрЭтоРасчетыСКлиентами = &ЭтоРасчетыСКлиентами
	|ГДЕ
	|	ВтПолныеРегистраторы.Регистратор ЕСТЬ NULL // Если количество записей <> порции то они будут перераспределены.
	|	И Таблица.Период < ВтПараметры.ПараметрДатаНачалаПересчета
	|	И Таблица.Активность
	|;
	|УНИЧТОЖИТЬ ВтПолныеРегистраторы";
	
	Если ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЭтоРасчетыСКлиентами", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РасчетыСКлиентамиПланОтгрузок", "РасчетыСПоставщикамиПланПоставок");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЭтоРасчетыСКлиентами", "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(ЗАпрос.Текст, "ВтИсходныеРегистраторыКлиенты", "ВтИсходныеРегистраторыПоставщики")
	КонецЕсли;
	
	Результаты = Запрос.ВыполнитьПакет();
	ПолныеРегистраторы = Результаты[1].Выгрузить().ВыгрузитьКолонку("Регистратор");
	ЗаписиДоНачалаРасчета = Результаты[2].Выгрузить();
	
	Если ЭтоРасчетыСКлиентами Тогда
		ГлобальныеПеременные.Вставить("РасчетыСКлиентамиПланОтгрузокРегистраторы", ПолныеРегистраторы);
	Иначе
		ГлобальныеПеременные.Вставить("РасчетыСПоставщикамиПланПоставокРегистраторы", ПолныеРегистраторы);
	КонецЕсли;
	
	Возврат ЗаписиДоНачалаРасчета;
	
КонецФункции

Функция ПолучитьДанныеДляРаспределения(Запрос, ЭтоРасчетыСКлиентами)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ЭтоОплата                         КАК ЭтоОплата,
	|	ВложенныйЗапрос.Период                            КАК Период,
	|	ВложенныйЗапрос.ПорядокОперации                   КАК ПорядокОперации,
	|	ВложенныйЗапрос.ПорядокЗачетаПоДатеПлатежа        КАК ПорядокЗачетаПоДатеПлатежа,
	|	ВложенныйЗапрос.Регистратор                       КАК Регистратор,
	|	
	|	ВложенныйЗапрос.ОбъектРасчетов                    КАК ОбъектРасчетов,
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.Валюта                            КАК Валюта,
	|	ВложенныйЗапрос.РасчетныйДокумент                 КАК РасчетныйДокумент,
	|	ВложенныйЗапрос.ДатаПлановогоПогашения            КАК ДатаПлановогоПогашения,
	|	ВложенныйЗапрос.ДатаВозникновения                 КАК ДатаВозникновения,
		
	|	ВложенныйЗапрос.ОперацияВзаиморасчетов            КАК ОперацияВзаиморасчетов,
	|	ВложенныйЗапрос.ХозяйственнаяОперация             КАК ХозяйственнаяОперация,
	|	
	|	ВложенныйЗапрос.КорОбъектРасчетов                 КАК КорОбъектРасчетов,
	|	ВложенныйЗапрос.КорАналитикаУчетаПоПартнерам      КАК КорАналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.ПоДаннымОбъектаРасчетовИсточника  КАК ПоДаннымОбъектаРасчетовИсточника,
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерамПриемник КАК АналитикаУчетаПоПартнерамПриемник,
	|	ВложенныйЗапрос.ОбъектРасчетовПриемник            КАК ОбъектРасчетовПриемник,
	|	ВложенныйЗапрос.ВалютаПриемник                    КАК ВалютаПриемник,
	|	СУММА(ВложенныйЗапрос.СуммаПриемник)                           КАК СуммаПриемник,
	|	
	|	ВложенныйЗапрос.Сторно                                         КАК Сторно,
	|	ВложенныйЗапрос.СторнируемыйРегистратор                        КАК СторнируемыйРегистратор,
	|	ВложенныйЗапрос.НовыеДвиженияИсправления                       КАК НовыеДвиженияИсправления,
	|	
	|	СУММА(ВложенныйЗапрос.Сумма)                                   КАК Сумма,
	|	СУММА(ВложенныйЗапрос.Сумма)                                   КАК СуммаДляРаспределения,
	|	СУММА(ВложенныйЗапрос.Сумма) <> 0                              КАК ЕстьОстатокКРаспределению,
	|	СУММА(ВложенныйЗапрос.Сумма)                                   КАК ИсходнаяСумма,
	|	СУММА(ВложенныйЗапрос.СуммаРегл)                               КАК СуммаРегл,
	|	СУММА(ВложенныйЗапрос.СуммаРегл)                               КАК ИсходнаяСуммаРегл,
	|	СУММА(ВложенныйЗапрос.СуммаУпр)                                КАК СуммаУпр,
	|	СУММА(ВложенныйЗапрос.СуммаУпр)                                КАК ИсходнаяСуммаУпр,
	|	
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВложенныйЗапрос.Регистратор) КАК ИдентификаторРегистратора,
	|	ВложенныйЗапрос.ВалютаДокумента                                   КАК ВалютаДокумента,
	|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств                     КАК СтатьяДвиженияДенежныхСредств,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи                            КАК ИдентификаторФинЗаписи,
	|	ВложенныйЗапрос.НастройкаХозяйственнойОперации                    КАК НастройкаХозяйственнойОперации,
	|	ВложенныйЗапрос.ДатаПереоценки                                    КАК ДатаПереоценки,
	|	ВложенныйЗапрос.СвязанныйДокумент                                 КАК СвязанныйДокумент,
	|	
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ) >= ВтПараметрыРасчета.ПараметрДатаНачалаПересчета
	|			ТОГДА ВложенныйЗапрос.Период
	|		ИНАЧЕ ВтПараметрыРасчета.ПараметрДатаНачалаПересчета
	|	КОНЕЦ                                                                               КАК ПериодЗачета,
	|	
	|	ВложенныйЗапрос.РучнойКурсРегл                                                      КАК РучнойКурсРегл,
	|	ВложенныйЗапрос.РучнойКурсУпр                                                       КАК РучнойКурсУпр,
	|	
	|	МАКСИМУМ(ВложенныйЗапрос.КурсЧислительВалютыВзаиморасчетов)                         КАК КурсЧислительВалютыВзаиморасчетов,
	|	МАКСИМУМ(ВложенныйЗапрос.КурсЗнаменательВалютыВзаиморасчетов)                       КАК КурсЗнаменательВалютыВзаиморасчетов,
	|	МАКСИМУМ(ВложенныйЗапрос.КурсЧислительВалютыУпр)                                    КАК КурсЧислительВалютыУпр,
	|	МАКСИМУМ(ВложенныйЗапрос.КурсЗнаменательВалютыУпр)                                  КАК КурсЗнаменательВалютыУпр,
	|	
	|	ВЫБОР
	|		КОГДА ВтПараметрыРасчета.ПараметрЭтоРасчетыСКлиентами И НЕ ВложенныйЗапрос.ЭтоОплата
	|			 	И (ВложенныйЗапрос.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|					ИЛИ ВложенныйЗапрос.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер)
	|			ИЛИ НЕ ВтПараметрыРасчета.ПараметрЭтоРасчетыСКлиентами И НЕ ВложенныйЗапрос.ЭтоОплата
	|				И (ВложенныйЗапрос.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|					ИЛИ ВложенныйЗапрос.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                                               КАК ЭтоВозвратАванса,
	|	ВЫБОР
	|		КОГДА ВтПараметрыРасчета.ПараметрЭтоРасчетыСКлиентами И НЕ ВложенныйЗапрос.ЭтоОплата
	|			 	И ВложенныйЗапрос.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.Регистратор КАК Документ.РеализацияТоваровУслуг).Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.ВПути)
	|		КОГДА ВтПараметрыРасчета.ПараметрЭтоРасчетыСКлиентами И НЕ ВложенныйЗапрос.ЭтоОплата
	|				И ВложенныйЗапрос.Регистратор ССЫЛКА Документ.РеализацияУслугПрочихАктивов
	|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.Регистратор КАК Документ.РеализацияУслугПрочихАктивов).Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.ВПути)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                                               КАК ЭтоРеализацияВПути
	|ИЗ (
	|	//Отгрузки и оплаты без объекта расчетов источника
	|	ВЫБРАТЬ
	|		Расчеты.ЭтоОплата                                   КАК ЭтоОплата,
	|		Расчеты.Регистратор                                 КАК Регистратор,
	|		//Ввод остатков пишет в дату регистратора дату первичного документа, а движения должны делаться датой ввода остатков
	|		ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (ТИП(Документ.ВводОстатков),ТИП(Документ.ВводОстатковВзаиморасчетов))
	|				ТОГДА Расчеты.Период
	|			ИНАЧЕ Расчеты.ДатаРегистратора
	|		КОНЕЦ                                               КАК Период,
	|		Расчеты.ПорядокОперации                             КАК ПорядокОперации,
	|		Расчеты.ПорядокЗачетаПоДатеПлатежа                  КАК ПорядокЗачетаПоДатеПлатежа,
	|		
	|		Расчеты.АналитикаУчетаПоПартнерам                   КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.ОбъектРасчетов                              КАК ОбъектРасчетов,
	|		Расчеты.Валюта                                      КАК Валюта,
	|		ВЫБОР 
	|			КОГДА Расчеты.РасчетныйДокумент <> Неопределено И Расчеты.РасчетныйДокумент <> ЗНАЧЕНИЕ(Документ.ПервичныйДокумент.ПустаяСсылка)
	|				ТОГДА Расчеты.РасчетныйДокумент
	|			КОГДА НЕ ВтИсходныеРегистраторы.ИсправляемыйДокумент ЕСТЬ NULL И НЕ Расчеты.Сторно
	|				ТОГДА ВтИсходныеРегистраторы.ИсправляемыйДокумент 
	|			ИНАЧЕ Расчеты.Регистратор
	|		КОНЕЦ                                               КАК РасчетныйДокумент,
	|		НАЧАЛОПЕРИОДА(ВЫБОР
	|			КОГДА Расчеты.ДатаПлатежа = ДАТАВРЕМЯ(1,1,1) И НЕ Расчеты.ЭтоОплата
	|				ТОГДА Расчеты.Период
	|			ИНАЧЕ Расчеты.ДатаПлатежа
	|		КОНЕЦ , ДЕНЬ)                                       КАК ДатаПлановогоПогашения,
	|		ВЫБОР 
	|			КОГДА НЕ ВтИсходныеРегистраторы.ИсправляемыйДокумент ЕСТЬ NULL И НЕ Расчеты.Сторно
	|					И НЕ ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (ТИП(Документ.ВводОстатков),ТИП(Документ.ВводОстатковВзаиморасчетов))
	|				ТОГДА ВтИсходныеРегистраторы.ИсходнаяДатаВозникновения
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора, ДЕНЬ)
	|		КОНЕЦ                                               КАК ДатаВозникновения,
	|		
	|		Расчеты.Сумма                                       КАК Сумма,
	|		Расчеты.СуммаРегл                                   КАК СуммаРегл,
	|		Расчеты.СуммаУпр                                    КАК СуммаУпр,
	|		
	|		Расчеты.КорОбъектРасчетов                           КАК КорОбъектРасчетов,
	|		Расчеты.КорАналитикаУчетаПоПартнерам                КАК КорАналитикаУчетаПоПартнерам,
	|		Расчеты.ПоДаннымОбъектаРасчетовИсточника            КАК ПоДаннымОбъектаРасчетовИсточника,
	|		Расчеты.АналитикаУчетаПоПартнерамПриемник           КАК АналитикаУчетаПоПартнерамПриемник,
	|		Расчеты.ОбъектРасчетовПриемник                      КАК ОбъектРасчетовПриемник,
	|		Расчеты.ВалютаПриемник                              КАК ВалютаПриемник,
	|		Расчеты.СуммаПриемник                               КАК СуммаПриемник,
	|		
	|		Расчеты.Сторно                                                              КАК Сторно,
	|		НЕ Расчеты.Сторно И НЕ ВтИсходныеРегистраторы.СторнируемыйРегистратор ЕСТЬ NULL КАК НовыеДвиженияИсправления,
	|		ЕСТЬNULL(ВтИсходныеРегистраторы.СторнируемыйРегистратор, Неопределено)          КАК СторнируемыйРегистратор,
	|		
	|		Расчеты.ОперацияВзаиморасчетов                      КАК ОперацияВзаиморасчетов,
	|		Расчеты.ХозяйственнаяОперация                       КАК ХозяйственнаяОперация,
	|		Расчеты.НастройкаХозяйственнойОперации              КАК НастройкаХозяйственнойОперации,
	|		Расчеты.ИдентификаторФинЗаписи                      КАК ИдентификаторФинЗаписи,
	|		Расчеты.ВалютаДокумента                             КАК ВалютаДокумента,
	|		Расчеты.СтатьяДвиженияДенежныхСредств               КАК СтатьяДвиженияДенежныхСредств,
	|		Расчеты.СвязанныйДокумент                           КАК СвязанныйДокумент,
	|		Расчеты.РучнойКурсРегл 
	|			ИЛИ (Расчеты.ХозяйственнаяОперация В (&ОперацииСРучнымКурсом) И НЕ Расчеты.ЭтоОплата) КАК РучнойКурсРегл,
	|		Расчеты.РучнойКурсУпр 
	|			ИЛИ (Расчеты.ХозяйственнаяОперация В (&ОперацииСРучнымКурсом) И НЕ Расчеты.ЭтоОплата) КАК РучнойКурсУпр,
	|		ВЫБОР КОГДА (Расчеты.Регистратор ССЫЛКА Документ.ВводОстатков
	|						ИЛИ Расчеты.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов)
	|				ТОГДА Расчеты.Период
	|			ИНАЧЕ Расчеты.ДатаРегистратора
	|		КОНЕЦ                                              КАК ДатаПереоценки,
	|		Расчеты.КурсЧислительВалютыВзаиморасчетов          КАК КурсЧислительВалютыВзаиморасчетов,
	|		Расчеты.КурсЗнаменательВалютыВзаиморасчетов        КАК КурсЗнаменательВалютыВзаиморасчетов,
	|		Расчеты.КурсЧислительВалютыУпр                     КАК КурсЧислительВалютыУпр,
	|		Расчеты.КурсЗнаменательВалютыУпр                   КАК КурсЗнаменательВалютыУпр
	|
	|	ИЗ
	|		РасчетыДвиженияКлиенты КАК Расчеты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтИсходныеРегистраторыКлиенты КАК ВтИсходныеРегистраторы
	|				ПО ВтИсходныеРегистраторы.НовыйРегистратор = Расчеты.Регистратор
	|					И ВтИсходныеРегистраторы.АналитикаУчетаПоПартнерам = Расчеты.АналитикаУчетаПоПартнерам
	|					И ВтИсходныеРегистраторы.ОбъектРасчетов = Расчеты.ОбъектРасчетов
	|					И ВтИсходныеРегистраторы.Валюта = Расчеты.Валюта
	|	ГДЕ
	|		НЕ Расчеты.ПоДаннымОбъектаРасчетовИсточника
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//Движения из объекта расчетов источника ""Расчеты с клиентами по срокам""
	|	ВЫБРАТЬ
	|		ВтТипыПриемников.ПриемникЭтоОплата                       КАК ЭтоОплата,
	|		Расчеты.ДокументРегистратор                              КАК Регистратор,
	|		Расчеты.Период                                           КАК Период,
	|		Расчеты.ПорядокОперации                                  КАК ПорядокОперации,
	|		Расчеты.ПорядокЗачета                                    КАК ПорядокЗачетаПоДатеПлатежа,
	|		
	|		Расчеты.АналитикаУчетаПоПартнерамПриемник                КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.ОбъектРасчетовПриемник                           КАК ОбъектРасчетов,
	|		Расчеты.ВалютаПриемник                                   КАК Валюта,
	|		Расчеты.РасчетныйДокумент                                КАК РасчетныйДокумент,
	|		ВЫБОР КОГДА Расчеты.ДатаПлановогоПогашения = ДАТАВРЕМЯ(1,1,1) И НЕ ВтТипыПриемников.ПриемникЭтоОплата
	|			ТОГДА Расчеты.ДатаВозникновения
	|			ИНАЧЕ Расчеты.ДатаПлановогоПогашения
	|		КОНЕЦ                                                    КАК ДатаПлановогоПогашения,
	|		Расчеты.ДатаВозникновения                                КАК ДатаВозникновения,
	|		
	|		Расчеты.СуммаПриемник                                    КАК Сумма,
	|		Расчеты.ДолгРегл + Расчеты.ПредоплатаРегл                КАК СуммаРегл,
	|		Расчеты.ДолгУпр + Расчеты.ПредоплатаУпр                  КАК СуммаУпр,
	|		
	|		Расчеты.ОбъектРасчетов                                   КАК КорОбъектРасчетов,
	|		Расчеты.АналитикаУчетаПоПартнерам                        КАК КорАналитикаУчетаПоПартнерам,
	|		ИСТИНА                                                   КАК ПоДаннымОбъектаРасчетовИсточника,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) КАК АналитикаУчетаПоПартнерамПриемник,
	|		ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)        КАК ОбъектРасчетовПриемник,
	|		ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)                 КАК ВалютаПриемник,
	|		0                                                        КАК СуммаПриемник,
	|		
	|		Расчеты.Сторно                                                     КАК Сторно,
	|		НЕ Расчеты.Сторно И НЕ ИсправленияДокументов.Регистратор ЕСТЬ NULL КАК НовыеДвиженияИсправления,
	|		Неопределено                                                       КАК СторнируемыйРегистратор,
	|		
	|		ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов) КАК ОперацияВзаиморасчетов,
	|		Расчеты.ХозяйственнаяОперация                            КАК ХозяйственнаяОперация,
	|		Расчеты.НастройкаХозяйственнойОперации                   КАК НастройкаХозяйственнойОперации,
	|		Расчеты.ИдентификаторФинЗаписи                           КАК ИдентификаторФинЗаписи,
	|		Расчеты.ВалютаДокумента                                  КАК ВалютаДокумента,
	|		Расчеты.СтатьяДвиженияДенежныхСредств                    КАК СтатьяДвиженияДенежныхСредств,
	|		НЕОПРЕДЕЛЕНО                                             КАК СвязанныйДокумент,
	|		ИСТИНА                                                   КАК РучнойКурсРегл,
	|		ИСТИНА                                                   КАК РучнойКурсУпр,
	|		ВЫБОР КОГДА ВтТипыПриемников.ПриемникЭтоОплата 
	|				ТОГДА ДАТАВРЕМЯ(1,1,1)
	|			ИНАЧЕ Расчеты.Период
	|		КОНЕЦ                                                    КАК ДатаПереоценки,
	|		ВЫБОР КОГДА Расчеты.СуммаПриемник = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ((Расчеты.ДолгРегл + Расчеты.ПредоплатаРегл) / Расчеты.СуммаПриемник КАК ЧИСЛО (10,4))
	|		КОНЕЦ                                                    КАК КурсЧислительВалютыВзаиморасчетов,
	|		1                                                        КАК КурсЗнаменательВалютыВзаиморасчетов,
	|		ВЫБОР КОГДА Расчеты.ДолгУпр + Расчеты.ПредоплатаУпр = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ((Расчеты.ДолгРегл + Расчеты.ПредоплатаРегл) / (Расчеты.ДолгУпр + Расчеты.ПредоплатаУпр) КАК ЧИСЛО (10,4))
	|		КОНЕЦ                                                    КАК КурсЧислительВалютыУпр,
	|		1                                                        КАК КурсЗнаменательВалютыУпр
	|	ИЗ
	|		ВТРасчетыСКлиентамиПоСрокамРегистраторы КАК ВТРасчетыСКлиентамиПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметрыРасчета
	|					ПО Расчеты.ОбъектРасчетовПриемник = ВтПараметрыРасчета.ПараметрОбъектРасчетов
	|						И Расчеты.АналитикаУчетаПоПартнерамПриемник = ВтПараметрыРасчета.ПараметрАналитикаУчетаПоПартнерам
	|						И Расчеты.ВалютаПриемник = ВтПараметрыРасчета.ПараметрВалюта
	|						И Расчеты.Период >= ВтПараметрыРасчета.ПараметрДатаНачалаПересчета
	|			ПО ВТРасчетыСКлиентамиПоСрокам.Период = Расчеты.Период
	|				И ВТРасчетыСКлиентамиПоСрокам.Регистратор = Расчеты.Регистратор
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТипыПриемников КАК ВтТипыПриемников
	|			ПО Расчеты.ДокументРегистратор = ВтТипыПриемников.Регистратор
	|				И Расчеты.ОбъектРасчетовПриемник = ВтТипыПриемников.ОбъектРасчетов
	|				И Расчеты.АналитикаУчетаПоПартнерамПриемник = ВтТипыПриемников.АналитикаУчетаПоПартнерам
	|				И Расчеты.ВалютаПриемник = ВтТипыПриемников.Валюта
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсправленияДокументов КАК ИсправленияДокументов
	|				ПО ИсправленияДокументов.Регистратор = Расчеты.ДокументРегистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//Движения из объекта расчетов источника ""Расчеты с поставщиками по срокам""
	|	ВЫБРАТЬ
	|		ВтТипыПриемников.ПриемникЭтоОплата                       КАК ЭтоОплата,
	|		Расчеты.ДокументРегистратор                              КАК Регистратор,
	|		Расчеты.Период                                           КАК Период,
	|		Расчеты.ПорядокОперации                                  КАК ПорядокОперации,
	|		Расчеты.ПорядокЗачета                                    КАК ПорядокЗачетаПоДатеПлатежа,
	|		
	|		Расчеты.АналитикаУчетаПоПартнерамПриемник                КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.ОбъектРасчетовПриемник                           КАК ОбъектРасчетов,
	|		Расчеты.ВалютаПриемник                                   КАК Валюта,
	|		Расчеты.РасчетныйДокумент                                КАК РасчетныйДокумент,
	|		ВЫБОР КОГДА Расчеты.ДатаПлановогоПогашения = ДАТАВРЕМЯ(1,1,1) И НЕ ВтТипыПриемников.ПриемникЭтоОплата 
	|			ТОГДА Расчеты.ДатаВозникновения
	|			ИНАЧЕ Расчеты.ДатаПлановогоПогашения
	|		КОНЕЦ                                                    КАК ДатаПлановогоПогашения,
	|		Расчеты.ДатаВозникновения                                КАК ДатаВозникновения,
	|		
	|		Расчеты.СуммаПриемник                                    КАК Сумма,
	|		Расчеты.ДолгРегл + Расчеты.ПредоплатаРегл                КАК СуммаРегл,
	|		Расчеты.ДолгУпр + Расчеты.ПредоплатаУпр                  КАК СуммаУпр,
	|		
	|		Расчеты.ОбъектРасчетов                                   КАК КорОбъектРасчетов,
	|		Расчеты.АналитикаУчетаПоПартнерам                        КАК КорАналитикаУчетаПоПартнерам,
	|		ИСТИНА                                                   КАК ПоДаннымОбъектаРасчетовИсточника,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) КАК АналитикаУчетаПоПартнерамПриемник,
	|		ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)        КАК ОбъектРасчетовПриемник,
	|		ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)                 КАК ВалютаПриемник,
	|		0                                                        КАК СуммаПриемник,
	|	
	|		Расчеты.Сторно                                                     КАК Сторно,
	|		НЕ Расчеты.Сторно И НЕ ИсправленияДокументов.Регистратор ЕСТЬ NULL КАК НовыеДвиженияИсправления,
	|		Неопределено                                                       КАК СторнируемыйРегистратор,
	|	
	|		ВЫБОР
	|			КОГДА ВтТипыПриемников.ПриемникЭтоОплата 
	|				И Расчеты.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезАгента),
	|													ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика))
	|				 ТОГДА ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаЗадолженности)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПереносВзаиморасчетов) 
	|		КОНЕЦ                                                    КАК ОперацияВзаиморасчетов,
	|		Расчеты.ХозяйственнаяОперация                            КАК ХозяйственнаяОперация,
	|		Расчеты.НастройкаХозяйственнойОперации                   КАК НастройкаХозяйственнойОперации,
	|		Расчеты.ИдентификаторФинЗаписи                           КАК ИдентификаторФинЗаписи,
	|		Расчеты.ВалютаДокумента                                  КАК ВалютаДокумента,
	|		Расчеты.СтатьяДвиженияДенежныхСредств                    КАК СтатьяДвиженияДенежныхСредств,
	|		НЕОПРЕДЕЛЕНО                                             КАК СвязанныйДокумент,
	|		ИСТИНА                                                   КАК РучнойКурсРегл,
	|		ИСТИНА                                                   КАК РучнойКурсУпр,
	|		ВЫБОР КОГДА ВтТипыПриемников.ПриемникЭтоОплата
	|			ТОГДА ДАТАВРЕМЯ(1,1,1)
	|			ИНАЧЕ Расчеты.Период
	|		КОНЕЦ                                                    КАК ДатаПереоценки,
	|		ВЫБОР КОГДА Расчеты.СуммаПриемник = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ((Расчеты.ДолгРегл + Расчеты.ПредоплатаРегл) / Расчеты.СуммаПриемник КАК ЧИСЛО (10,4))
	|		КОНЕЦ                                                    КАК КурсЧислительВалютыВзаиморасчетов,
	|		1                                                        КАК КурсЗнаменательВалютыВзаиморасчетов,
	|		ВЫБОР КОГДА Расчеты.ДолгУпр + Расчеты.ПредоплатаУпр = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ((Расчеты.ДолгРегл + Расчеты.ПредоплатаРегл) / (Расчеты.ДолгУпр + Расчеты.ПредоплатаУпр) КАК ЧИСЛО (10,4))
	|		КОНЕЦ                                                    КАК КурсЧислительВалютыУпр,
	|		1                                                        КАК КурсЗнаменательВалютыУпр
	|	ИЗ
	|		ВТРасчетыСПоставщикамиПоСрокамРегистраторы КАК ВТРасчетыСПоставщикамиПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты 
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметрыРасчета
	|					ПО Расчеты.ОбъектРасчетовПриемник = ВтПараметрыРасчета.ПараметрОбъектРасчетов
	|						И Расчеты.АналитикаУчетаПоПартнерамПриемник = ВтПараметрыРасчета.ПараметрАналитикаУчетаПоПартнерам
	|						И Расчеты.ВалютаПриемник = ВтПараметрыРасчета.ПараметрВалюта
	|						И Расчеты.Период >= ВтПараметрыРасчета.ПараметрДатаНачалаПересчета
	|			ПО ВТРасчетыСПоставщикамиПоСрокам.Период = Расчеты.Период
	|				И ВТРасчетыСПоставщикамиПоСрокам.Регистратор = Расчеты.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТипыПриемников КАК ВтТипыПриемников
	|			ПО Расчеты.ДокументРегистратор = ВтТипыПриемников.Регистратор
	|				И Расчеты.ОбъектРасчетовПриемник = ВтТипыПриемников.ОбъектРасчетов
	|				И Расчеты.АналитикаУчетаПоПартнерамПриемник = ВтТипыПриемников.АналитикаУчетаПоПартнерам
	|				И Расчеты.ВалютаПриемник = ВтТипыПриемников.Валюта
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсправленияДокументов КАК ИсправленияДокументов
	|				ПО ИсправленияДокументов.Регистратор = Расчеты.ДокументРегистратор
	|	) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметрыРасчета
	|			ПО ВложенныйЗапрос.ОбъектРасчетов = ВтПараметрыРасчета.ПараметрОбъектРасчетов
	|				И ВложенныйЗапрос.АналитикаУчетаПоПартнерам = ВтПараметрыРасчета.ПараметрАналитикаУчетаПоПартнерам
	|				И ВложенныйЗапрос.Валюта = ВтПараметрыРасчета.ПараметрВалюта
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ЭтоОплата,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ОбъектРасчетов,
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.Валюта,
	|	ВложенныйЗапрос.ДатаПлановогоПогашения,
	|	ВложенныйЗапрос.ДатаВозникновения,
	|	ВложенныйЗапрос.ПорядокОперации,
	|	ВложенныйЗапрос.ПорядокЗачетаПоДатеПлатежа,
	|	ВложенныйЗапрос.Регистратор,
	|	ВложенныйЗапрос.РасчетныйДокумент,
	|	ВложенныйЗапрос.ОперацияВзаиморасчетов,
	|	ВложенныйЗапрос.ХозяйственнаяОперация,
	|	ВложенныйЗапрос.КорОбъектРасчетов,
	|	ВложенныйЗапрос.КорАналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.ПоДаннымОбъектаРасчетовИсточника,
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерамПриемник,
	|	ВложенныйЗапрос.ОбъектРасчетовПриемник,
	|	ВложенныйЗапрос.ВалютаПриемник,
	|	ВложенныйЗапрос.Сторно,
	|	ВложенныйЗапрос.СторнируемыйРегистратор,
	|	ВложенныйЗапрос.НовыеДвиженияИсправления,
	|	ВложенныйЗапрос.ВалютаДокумента,
	|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи,
	|	ВложенныйЗапрос.НастройкаХозяйственнойОперации,
	|	ВложенныйЗапрос.ДатаПереоценки,
	|	ВложенныйЗапрос.СвязанныйДокумент,
	|	ВложенныйЗапрос.РучнойКурсРегл,
	|	ВложенныйЗапрос.РучнойКурсУпр,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ) >= ВтПараметрыРасчета.ПараметрДатаНачалаПересчета
	|			ТОГДА ВложенныйЗапрос.Период
	|		ИНАЧЕ ВтПараметрыРасчета.ПараметрДатаНачалаПересчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВтПараметрыРасчета.ПараметрЭтоРасчетыСКлиентами И НЕ ВложенныйЗапрос.ЭтоОплата
	|			 	И (ВложенныйЗапрос.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|					ИЛИ ВложенныйЗапрос.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер)
	|			ИЛИ НЕ ВтПараметрыРасчета.ПараметрЭтоРасчетыСКлиентами И НЕ ВложенныйЗапрос.ЭтоОплата
	|				И (ВложенныйЗапрос.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|					ИЛИ ВложенныйЗапрос.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВтПараметрыРасчета.ПараметрЭтоРасчетыСКлиентами И НЕ ВложенныйЗапрос.ЭтоОплата
	|			 	И ВложенныйЗапрос.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.Регистратор КАК Документ.РеализацияТоваровУслуг).Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.ВПути)
	|		КОГДА ВтПараметрыРасчета.ПараметрЭтоРасчетыСКлиентами И НЕ ВложенныйЗапрос.ЭтоОплата
	|				И ВложенныйЗапрос.Регистратор ССЫЛКА Документ.РеализацияУслугПрочихАктивов
	|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.Регистратор КАК Документ.РеализацияУслугПрочихАктивов).Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.ВПути)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.Сумма) > 0
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.ПорядокОперации ВОЗР,
	|	ВложенныйЗапрос.Сторно УБЫВ,
	|	ВложенныйЗапрос.ДатаВозникновения ВОЗР,
	|	//Сначала распределяем с заполненной датой погашения, потом с ""Автоматической""
	|	ВЫБОР КОГДА ВложенныйЗапрос.ДатаПлановогоПогашения = ДАТАВРЕМЯ(1,1,1)
	|		ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВложенныйЗапрос.ДатаПлановогоПогашения,
	|	СУММА(ВложенныйЗапрос.Сумма)
	|";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыДвиженияКлиенты","РасчетыДвиженияПоставщики");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВтИсходныеРегистраторыКлиенты","ВтИсходныеРегистраторыПоставщики");
	КонецЕсли;
	
	Результат     = Запрос.Выполнить();
	Данные = Результат.Выгрузить();
	
	Возврат Данные;
	
КонецФункции

// Возвращает таблицу курсов валют на промежуток между первой записью расчетов и текущей датой.
Функция ПолучитьКурсыВалют(Запрос, ДатаНачала, ГлобальныеПеременные, ТекущиеПеременные)
	
	Запрос.УстановитьПараметр("ДатаНачала",                 ДатаНачала);
	Запрос.УстановитьПараметр("Валюта",                     ТекущиеПеременные.Валюта);
	Запрос.УстановитьПараметр("ВалютаУпр",                  ГлобальныеПеременные.ВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("ВалютаРегл",                 ТекущиеПеременные.ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("Договор",                    ТекущиеПеременные.Договор);
	Запрос.УстановитьПараметр("КурсУстановленныйВДоговоре", ТекущиеПеременные.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.УстановленныйВДоговоре);
	
	Если ТекущиеПеременные.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.УстановленныйВДоговоре Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Курсы.Дата КАК Дата,
		|	СУММА(Курсы.КурсРегл) КАК КурсРегл,
		|	СУММА(Курсы.КурсУпр) КАК КурсУпр
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДат.Дата КАК Дата,
		|		ВЫБОР КОГДА &Валюта <> &ВалютаРегл
		|				ТОГДА ЕСТЬNULL(КурсыВалютыРасчетов.КурсЧислитель / КурсыВалютыРасчетов.КурсЗнаменатель,0)
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК КурсРегл,
		|		ВЫБОР КОГДА &Валюта = &ВалютаУпр
		|				ТОГДА ЕСТЬNULL(КурсыВалютыРасчетов.КурсЧислитель / КурсыВалютыРасчетов.КурсЗнаменатель,0)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК КурсУпр
		|	ИЗ
		|		ТаблицаДат КАК ТаблицаДат
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютРасчетовПоДоговорам КАК КурсыВалютыРасчетов
		|				ПО ТаблицаДат.Дата = КурсыВалютыРасчетов.Период
		|					И КурсыВалютыРасчетов.Договор = &Договор
		|	
		|	ОБЪЕДИНИТЬ ВСЕ 
		|	
		|	ВЫБРАТЬ
		|		ТаблицаДат.Дата КАК Дата,
		|		0 КАК КурсРегл, 
		|		ВЫБОР КОГДА &Валюта = &ВалютаУпр
		|			ТОГДА 0
		|		ИНАЧЕ
		|			ВЫБОР КОГДА &ВалютаРегл <> &ВалютаУпр
		|					ТОГДА ЕСТЬNULL(КурсыВалютыУпр.КурсЧислитель / КурсыВалютыУпр.КурсЗнаменатель,0)
		|				ИНАЧЕ 1
		|			КОНЕЦ 
		|		КОНЕЦ КАК КурсУпр
		|	ИЗ
		|		ТаблицаДат КАК ТаблицаДат
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют КАК КурсыВалютыУпр
		|				ПО ТаблицаДат.Дата = КурсыВалютыУпр.Период
		|					И КурсыВалютыУпр.Валюта = &ВалютаУпр
		|					И КурсыВалютыУпр.БазоваяВалюта = &ВалютаРегл) КАК Курсы
		|
		|СГРУППИРОВАТЬ ПО
		|	Курсы.Дата
		|УПОРЯДОЧИТЬ ПО
		|	Дата ВОЗР
		|";
	Иначе
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Курсы.Дата КАК Дата,
		|	СУММА(Курсы.КурсРегл) КАК КурсРегл,
		|	СУММА(Курсы.КурсУпр) КАК КурсУпр
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаДат.Дата КАК Дата,
		|		ЕСТЬNULL(ВЫБОР КОГДА КурсыВалютыРасчетов.Валюта = &Валюта И &Валюта <> &ВалютаРегл
		|					ТОГДА КурсыВалютыРасчетов.КурсЧислитель / КурсыВалютыРасчетов.КурсЗнаменатель
		|					ИНАЧЕ 0
		|				КОНЕЦ,
		|				ВЫБОР КОГДА &ВалютаРегл = &Валюта
		|					ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КурсРегл,
		|		ЕСТЬNULL(ВЫБОР КОГДА КурсыВалютыРасчетов.Валюта = &ВалютаУпр И &ВалютаРегл <> &ВалютаУпр
		|					ТОГДА КурсыВалютыРасчетов.КурсЧислитель / КурсыВалютыРасчетов.КурсЗнаменатель
		|					ИНАЧЕ 0
		|				КОНЕЦ,
		|				ВЫБОР КОГДА &ВалютаРегл = &ВалютаУпр
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КурсУпр
		|	ИЗ
		|		ТаблицаДат КАК ТаблицаДат
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют КАК КурсыВалютыРасчетов
		|				ПО ТаблицаДат.Дата = КурсыВалютыРасчетов.Период
		|					И КурсыВалютыРасчетов.БазоваяВалюта = &ВалютаРегл
		|					И КурсыВалютыРасчетов.Валюта В (&Валюта,&ВалютаУпр)) КАК Курсы
		|
		|СГРУППИРОВАТЬ ПО
		|	Курсы.Дата
		|УПОРЯДОЧИТЬ ПО
		|	Дата ВОЗР
		|";
	КонецЕсли;
	
	КурсыВалюты =  Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СУММА(Курсы.КурсРегл) КАК КурсРегл,
	|	СУММА(Курсы.КурсУпр) КАК КурсУпр
	|ИЗ
	|	(ВЫБРАТЬ
	|		КурсыВалютыРасчетов.Период КАК Дата,
	|		ВЫБОР КОГДА НЕ &КурсУстановленныйВДоговоре И КурсыВалютыРасчетов.Валюта = &Валюта 
	|			ТОГДА КурсыВалютыРасчетов.КурсЧислитель / КурсыВалютыРасчетов.КурсЗнаменатель
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КурсРегл,
	|		ВЫБОР КОГДА НЕ (&КурсУстановленныйВДоговоре И &ВалютаУпр = &Валюта) И КурсыВалютыРасчетов.Валюта = &ВалютаУпр 
	|			ТОГДА КурсыВалютыРасчетов.КурсЧислитель / КурсыВалютыРасчетов.КурсЗнаменатель
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КурсУпр
	|	ИЗ
	|		РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаНачала, БазоваяВалюта = &ВалютаРегл И Валюта В (&Валюта,&ВалютаУпр)) КАК КурсыВалютыРасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ 
	|	
	|	ВЫБРАТЬ
	|		КурсыВалютыРасчетов.Период КАК Дата,
	|		КурсыВалютыРасчетов.КурсЧислитель / КурсыВалютыРасчетов.КурсЗнаменатель  КАК КурсРегл,
	|		ВЫБОР КОГДА &КурсУстановленныйВДоговоре И &ВалютаУпр = &Валюта
	|			ТОГДА КурсыВалютыРасчетов.КурсЧислитель / КурсыВалютыРасчетов.КурсЗнаменатель
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КурсУпр
	|	ИЗ
	|		РегистрСведений.КурсыВалютРасчетовПоДоговорам.СрезПоследних(&ДатаНачала, Договор = &Договор) КАК КурсыВалютыРасчетов
	|	ГДЕ &КурсУстановленныйВДоговоре) КАК Курсы
	|;";
	
	КурсыВалютСрезПоследних = Запрос.Выполнить().Выгрузить();
	
	ТекущийКурсРегл = ?(КурсыВалютСрезПоследних.Количество() > 0, КурсыВалютСрезПоследних[0].КурсРегл, 1);
	ТекущийКурсУпр = ?(КурсыВалютСрезПоследних.Количество() > 0, КурсыВалютСрезПоследних[0].КурсУпр, 1);
	
	ТекущийКурсРегл = ?(ЗначениеЗаполнено(ТекущийКурсРегл), ТекущийКурсРегл, 1);
	ТекущийКурсУпр =  ?(ЗначениеЗаполнено(ТекущийКурсУпр), ТекущийКурсУпр, 1);
	
	СтрокиСПустымКурсомРегл = КурсыВалюты.НайтиСтроки(Новый Структура("КурсРегл", 0));
	Для Каждого СтрокаПустогоКурса ИЗ СтрокиСПустымКурсомРегл Цикл
		Если КурсыВалюты.Индекс(СтрокаПустогоКурса) = 0 Тогда 
			СтрокаПустогоКурса.КурсРегл = ТекущийКурсРегл;
			Если НЕ ЗначениеЗаполнено(СтрокаПустогоКурса.КурсУпр) Тогда
				СтрокаПустогоКурса.КурсУпр = ТекущийКурсУпр;
			КонецЕсли;
		Иначе
			СтрокаПустогоКурса.КурсРегл = КурсыВалюты[КурсыВалюты.Индекс(СтрокаПустогоКурса)-1].КурсРегл;
			Если НЕ ЗначениеЗаполнено(СтрокаПустогоКурса.КурсУпр) Тогда
				СтрокаПустогоКурса.КурсУпр = КурсыВалюты[КурсыВалюты.Индекс(СтрокаПустогоКурса)-1].КурсУпр;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СтрокиСПустымКурсомУпр = КурсыВалюты.НайтиСтроки(Новый Структура("КурсУпр", 0));
	Для Каждого СтрокаПустогоКурса ИЗ СтрокиСПустымКурсомУпр Цикл
		Если КурсыВалюты.Индекс(СтрокаПустогоКурса) = 0 Тогда 
			СтрокаПустогоКурса.КурсУпр = ТекущийКурсУпр;
		Иначе
			СтрокаПустогоКурса.КурсУпр = КурсыВалюты[КурсыВалюты.Индекс(СтрокаПустогоКурса)-1].КурсУпр;
		КонецЕсли;
	КонецЦикла;
	
	КурсыВалюты.Индексы.Добавить("Дата");
	
	Возврат КурсыВалюты;
	
КонецФункции

// Возвращает таблицу накладных и зачтенных на них, на момент пересчета, авансов.
//Данные используются для определения средневзвешенного курса накладной.
Функция ПолучитьДанныеНакладных(Запрос, ЭтоРасчетыСКлиентами)
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Таблица.Валюта КАК Валюта,
	|	Таблица.СвязанныйДокумент КАК СвязанныйДокумент
	|ПОМЕСТИТЬ ТаблицаСвязанныеДокументы
	|ИЗ
	|	РасчетыДвиженияКлиенты КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПараметры.ПараметрТипРасчетов КАК ТипРасчетов,
	|	ВтПараметры.ПараметрАналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВтПараметры.ПараметрОбъектРасчетов КАК ОбъектРасчетов,
	|	ВтПараметры.ПараметрВалюта КАК Валюта,
	|	ВтПараметры.ПараметрДатаНачалаПересчета КАК ДатаНачалаПересчета,
	|	ТаблицаСвязанныеДокументы.СвязанныйДокумент КАК СвязанныйДокумент
	|ПОМЕСТИТЬ ВТСвязанныеДокументыКлиент
	|ИЗ
	|	ВтДополненныеПараметрыРаспределения КАК ВтПараметры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСвязанныеДокументы КАК ТаблицаСвязанныеДокументы
	|		ПО ВтПараметры.ПараметрАналитикаУчетаПоПартнерам = ТаблицаСвязанныеДокументы.АналитикаУчетаПоПартнерам
	|		И ВтПараметры.ПараметрОбъектРасчетов = ТаблицаСвязанныеДокументы.ОбъектРасчетов
	|		И ВтПараметры.ПараметрВалюта = ТаблицаСвязанныеДокументы.Валюта
	|ГДЕ
	|	ВтПараметры.ПараметрЭтоРасчетыСКлиентами = &ПараметрЭтоРасчетыСКлиентами
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов,
	|	АналитикаУчетаПоПартнерам,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасчетыПоСрокамДо.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВТРасчетыПоСрокамДо.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВТРасчетыПоСрокамДо.Валюта КАК Валюта,
	|	ВТРасчетыПоСрокамДо.ДокументРегистратор КАК Накладная,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|		КОГДА ВТРасчетыПоСрокамДо.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ВТРасчетыПоСрокамДо.Предоплата - ВТРасчетыПоСрокамДо.Долг
	|		ИНАЧЕ ВТРасчетыПоСрокамДо.Долг
	|	КОНЕЦ, 0)) КАК Сумма,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|		КОГДА ВТРасчетыПоСрокамДо.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ВТРасчетыПоСрокамДо.ПредоплатаРегл - ВТРасчетыПоСрокамДо.ДолгРегл
	|		ИНАЧЕ ВТРасчетыПоСрокамДо.ДолгРегл
	|	КОНЕЦ, 0)) КАК СуммаРегл,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|		КОГДА ВТРасчетыПоСрокамДо.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ВТРасчетыПоСрокамДо.ПредоплатаУпр - ВТРасчетыПоСрокамДо.ДолгУпр
	|		ИНАЧЕ ВТРасчетыПоСрокамДо.ДолгУпр
	|	КОНЕЦ, 0)) КАК СуммаУпр
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК ВТРасчетыПоСрокамДо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязанныеДокументыКлиент КАК ТаблицаСвязанныхДокументов
	|		ПО ВТРасчетыПоСрокамДо.ДокументРегистратор = ТаблицаСвязанныхДокументов.СвязанныйДокумент
	|		И ВТРасчетыПоСрокамДо.АналитикаУчетаПоПартнерам = ТаблицаСвязанныхДокументов.АналитикаУчетаПоПартнерам
	|		И ВТРасчетыПоСрокамДо.ОбъектРасчетов = ТаблицаСвязанныхДокументов.ОбъектРасчетов
	|		И ВТРасчетыПоСрокамДо.Валюта = ТаблицаСвязанныхДокументов.Валюта
	|		И ВТРасчетыПоСрокамДо.Период < ТаблицаСвязанныхДокументов.ДатаНачалаПересчета
	|		И НЕ ТИПЗНАЧЕНИЯ(ВТРасчетыПоСрокамДо.ДокументРегистратор) В (ТИП(Документ.КорректировкаРеализации),ТИП(Документ.КорректировкаПриобретения))
	|ГДЕ
	|	ВТРасчетыПоСрокамДо.Активность
	|СГРУППИРОВАТЬ ПО
	|	ВТРасчетыПоСрокамДо.АналитикаУчетаПоПартнерам,
	|	ВТРасчетыПоСрокамДо.ОбъектРасчетов,
	|	ВТРасчетыПоСрокамДо.Валюта,
	|	ВТРасчетыПоСрокамДо.ДокументРегистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаСвязанныхДокументов.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаСвязанныхДокументов.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ТаблицаСвязанныхДокументов.Валюта КАК Валюта,
	|	СвязанныеДокументы.Ссылка КАК Накладная,
	|	СвязанныеДокументы.СуммаВзаиморасчетов КАК Сумма,
	|	СвязанныеДокументы.СуммаРегл КАК СуммаРегл,
	|	СвязанныеДокументы.СуммаУпр КАК СуммаУпр
	|ИЗ
	|	Документ.ПервичныйДокумент КАК СвязанныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязанныеДокументыКлиент КАК ТаблицаСвязанныхДокументов
	|		ПО СвязанныеДокументы.Ссылка = ТаблицаСвязанныхДокументов.СвязанныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСвязанныеДокументыКлиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТь ТаблицаСвязанныеДокументы";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыДвиженияКлиенты","РасчетыДвиженияПоставщики");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрНакопления.РасчетыСКлиентамиПоСрокам", "РегистрНакопления.РасчетыСПоставщикамиПоСрокам");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТСвязанныеДокументы", "ВТСвязанныеДокументыПоставщик");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПараметрЭтоРасчетыСКлиентами", "ЛОЖЬ");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПараметрЭтоРасчетыСКлиентами", "ИСТИНА");
	КонецЕсли;
	
	ТаблицаСвязанныхДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСвязанныхДокументов;
	
КонецФункции

// Остатки предоплаты на начало пересчета за минусом уже списавших плановые оплаты.
// 
// Параметры:
//  Запрос - Запрос - Запрос
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция ОстаткиНераспределенныхАвансовПлановойОплатыНаНачалоПересчета(Запрос, ЭтоРасчетыСКлиентами = Ложь)
	
	Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Остатки.ОбъектРасчетов                    КАК ОбъектРасчетов,
		|	Остатки.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
		|	Остатки.Валюта                            КАК Валюта,
		|	Остатки.РасчетныйДокумент                 КАК Регистратор,
		|	МАКСИМУМ(Остатки.ДатаВозникновения)       КАК ДатаДвижения,
		|	МАКСИМУМ(Остатки.ПорядокОперации)         КАК ПорядокОперации
		|ПОМЕСТИТЬ ВтДокументыПредоплаты
		|ИЗ
		|	ВТРасчетыПоСрокамОстатки КАК Остатки
		|ГДЕ
		|	Остатки.Предоплата >0
		|СГРУППИРОВАТЬ ПО
		|	Остатки.ОбъектРасчетов,
		|	Остатки.АналитикаУчетаПоПартнерам,
		|	Остатки.Валюта,
		|	Остатки.РасчетныйДокумент
		|;
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ВложенныйЗапрос.Валюта КАК Валюта,
		|	ВложенныйЗапрос.ДатаДвижения      КАК ДатаДвижения,
		|	ВложенныйЗапрос.Регистратор       КАК Регистратор,
		|	ВложенныйЗапрос.ЭтоРеализацияВПути КАК ЭтоРеализацияВПути,
		|	ВложенныйЗапрос.ПорядокОперации   КАК ПорядокОперации,
		|	ВложенныйЗапрос.Зачтено           КАК Зачтено,
		|	ИСТИНА                            КАК Просуммировано,
		|	СУММА(ВложенныйЗапрос.Сумма)      КАК Сумма,
		|	СУММА(ВложенныйЗапрос.Сумма) > 0  КАК ОстатокПоложительный
		|ИЗ
		|	(
		|	ВЫБРАТЬ
		|		Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
		|		Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|		Расчеты.Валюта КАК Валюта,
		|		Расчеты.ДокументРегистратор КАК Регистратор,
		|		Расчеты.ДатаВозникновения   КАК ДатаДвижения,
		|		Расчеты.ПорядокОперации     КАК ПорядокОперации,
		|		ЛОЖЬ                        КАК Зачтено,
		|		&ЭтоРеализацияВПути         КАК ЭтоРеализацияВПути,
		|		Расчеты.Предоплата          КАК Сумма
		|	ИЗ
		|		ВТРасчетыПоСрокамОстатки КАК Расчеты
		|	ГДЕ
		|		Расчеты.Предоплата > 0
		|		И ТИПЗНАЧЕНИЯ(Расчеты.ДокументРегистратор) НЕ В (ТИП(Документ.КорректировкаПриобретения), ТИП(Документ.КорректировкаРеализации))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДокументыПредоплаты.ОбъектРасчетов                   КАК ОбъектРасчетов,
		|		ДокументыПредоплаты.АналитикаУчетаПоПартнерам        КАК АналитикаУчетаПоПартнерам,
		|		ДокументыПредоплаты.Валюта                           КАК Валюта,
		|		ДокументыПредоплаты.Регистратор                      КАК Регистратор,
		|		ДокументыПредоплаты.ДатаДвижения                     КАК ДатаДвижения,
		|		ДокументыПредоплаты.ПорядокОперации                  КАК ПорядокОперации,
		|		ИСТИНА                                               КАК Зачтено,
		|		ЛОЖЬ                                                 КАК ЭтоРеализацияВПути,
		|		-ПланыОплат.КОплате                                  КАК Сумма
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПланОплат КАК ПланыОплат
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДокументыПредоплаты КАК ДокументыПредоплаты
		|				ПО ДокументыПредоплаты.Регистратор = ПланыОплат.ДокументОплаты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметрыРасчета
		|				ПО ПланыОплат.ОбъектРасчетов = ВтПараметрыРасчета.ПараметрОбъектРасчетов
		|					И ПланыОплат.АналитикаУчетаПоПартнерам = ВтПараметрыРасчета.ПараметрАналитикаУчетаПоПартнерам
		|					И ПланыОплат.Валюта = ВтПараметрыРасчета.ПараметрВалюта
		|	ГДЕ
		|		ПланыОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И ПланыОплат.НераспределенныйАванс
		|		И ПланыОплат.Период < ВтПараметрыРасчета.ПараметрДатаНачалаПересчета
		|		И ТИПЗНАЧЕНИЯ(ДокументыПредоплаты.Регистратор) НЕ В (ТИП(Документ.КорректировкаПриобретения), ТИП(Документ.КорректировкаРеализации))
		|) КАК ВложенныйЗапрос
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ОбъектРасчетов,
		|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
		|	ВложенныйЗапрос.Валюта,
		|	ВложенныйЗапрос.Регистратор,
		|	ВложенныйЗапрос.ЭтоРеализацияВПути,
		|	ВложенныйЗапрос.ДатаДвижения,
		|	ВложенныйЗапрос.Зачтено,
		|	ВложенныйЗапрос.ПорядокОперации
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектРасчетов,
		|	АналитикаУчетаПоПартнерам,
		|	Валюта,
		|	ДатаДвижения
		|";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрНакопления.РасчетыСКлиентамиПланОплат ","РегистрНакопления.РасчетыСПоставщикамиПланОплат ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТРасчетыПоСрокамОстатки","ВТРасчетыПоСрокамОстаткиПоставщики");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВтДокументыПредоплаты","ВтДокументыПредоплатыПоставщики");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ЭтоРеализацияВПути","ЛОЖЬ");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТРасчетыПоСрокамОстатки","ВТРасчетыПоСрокамОстаткиКлиенты");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВтДокументыПредоплаты","ВтДокументыПредоплатыКлиенты");
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&ЭтоРеализацияВПути",
			"ВЫБОР
			|			КОГДА Расчеты.ДокументРегистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|				ТОГДА ВЫРАЗИТЬ(Расчеты.ДокументРегистратор КАК Документ.РеализацияТоваровУслуг).Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.ВПути)
			|			КОГДА Расчеты.ДокументРегистратор ССЫЛКА Документ.РеализацияУслугПрочихАктивов
			|				ТОГДА ВЫРАЗИТЬ(Расчеты.ДокументРегистратор КАК Документ.РеализацияУслугПрочихАктивов).Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.ВПути)
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Остатки авансов на начало пересчета
// 
// Параметры:
//  Запрос - Запрос - Запрос
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция ОстаткиАвансов(Запрос, ЭтоРасчетыСКлиентами = Ложь)
	
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
		|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.Валюта КАК Валюта,
		|	СУММА(Расчеты.Предоплата)          КАК Сумма
		|ИЗ
		|	ВТРасчетыПоСрокамОстаткиКлиенты КАК Расчеты
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.ОбъектРасчетов,
		|	Расчеты.АналитикаУчетаПоПартнерам,
		|	Расчеты.Валюта
		|";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТРасчетыПоСрокамОстаткиКлиенты","ВТРасчетыПоСрокамОстаткиПоставщики");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПриходныеДвиженияПоПлановымОплатам(Запрос, ГлобальныеПеременные, ЭтоРасчетыСКлиентами = Ложь)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Расчеты.ОбъектРасчетов                              КАК ОбъектРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам                   КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта                                      КАК Валюта,
	|	Расчеты.ДатаРегистратора                            КАК ДатаВозникновения,
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора,ДЕНЬ)        КАК Дата,
	|	Расчеты.ПорядокОперации                             КАК ПорядокОперации,
	|	Расчеты.Регистратор                                 КАК Регистратор,
	|	Расчеты.ДатаПлатежа                                 КАК ДатаПлановогоПогашения,
	|	Расчеты.ВариантОплаты                               КАК ВариантОплаты,
	|	СУММА(Расчеты.КОплате)                              КАК Сумма
	|ИЗ
	|	РасчетыДвижения КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметрыРасчета
	|			ПО Расчеты.ОбъектРасчетов = ВтПараметрыРасчета.ПараметрОбъектРасчетов
	|				И Расчеты.АналитикаУчетаПоПартнерам = ВтПараметрыРасчета.ПараметрАналитикаУчетаПоПартнерам
	|				И Расчеты.Валюта = ВтПараметрыРасчета.ПараметрВалюта
	|				// В РасчетыДвижения лишние записи заказов КОплате с периодом больше даты заказа
	|				И Расчеты.ДатаРегистратора >= ВтПараметрыРасчета.ПараметрДатаНачалаПересчета
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (&ТипыРегистраторов) ИЛИ &РеализацияВПути)
	|		И Расчеты.ВидДвижения = &Приход
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта,
	|	Расчеты.ДатаРегистратора,
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора,ДЕНЬ),
	|	Расчеты.ПорядокОперации,
	|	Расчеты.Регистратор,
	|	Расчеты.ДатаПлатежа,
	|	Расчеты.ВариантОплаты
	|УПОРЯДОЧИТЬ ПО
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта,
	|	Расчеты.ДатаРегистратора
	|";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыДвижения","РасчетыДвиженияПоставщики");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Приход","ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&РеализацияВПути","ЛОЖЬ");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыДвижения","РасчетыДвиженияКлиенты");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Приход","ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&РеализацияВПути","(Расчеты.ПродажаПоЗаказу В (&ПустыеСсылкиНаЗаказы) И НЕ ВтПараметрыРасчета.ПараметрГрафикВДоговоре)
																	|И	(ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.РеализацияТоваровУслуг).Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.Отгружено)
																	|		И ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.РеализацияТоваровУслуг).ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
																	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет),
																	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
																	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионера),
																	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
																	|	ИЛИ ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.РеализацияУслугПрочихАктивов).Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.Отгружено)
																	|		И ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.РеализацияУслугПрочихАктивов).ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
																	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияОСсОтложеннымПереходомПрав))
																	|	)");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипыРегистраторов", СписокТиповРегистраторовПланов());
	
	Результат  = Запрос.Выполнить();
	ПриходныеДвиженияГрафика = Результат.Выгрузить();
	
	Возврат ПриходныеДвиженияГрафика;
	
КонецФункции

//Возвращает таблицу закрывающих планы движений накладных
Функция ПолучитьУточненияГрафиковОплат(Запрос, ГлобальныеПеременные, ЭтоРасчетыСКлиентами = Ложь)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Расчеты.ОбъектРасчетов                              КАК ОбъектРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам                   КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта                                      КАК Валюта,
	|	Расчеты.ДатаРегистратора                            КАК ДатаДвижения,
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора,ДЕНЬ)        КАК ДатаВозникновения,
	|	Расчеты.ПорядокОперации                             КАК ПорядокОперации,
	|	Расчеты.Регистратор                                 КАК Регистратор,
	|	ВЫБОР КОГДА ВтПараметрыРасчета.ПараметрГрафикВДоговоре
	|			ТОГДА ВтПараметрыРасчета.ПараметрГрафикИсполненияДоговора
	|			ИНАЧЕ Расчеты.ПродажаПоЗаказу
	|	КОНЕЦ КАК Заказ,
	|	ВЫБОР КОГДА Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки)
	|		КОГДА Расчеты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыПоставщику.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления)
	|		ИНАЧЕ Расчеты.ВариантОплаты 
	|	КОНЕЦ                                               КАК ВариантОплаты,
	|	//При АДДН и АЗДН сумма двигается по другому объекту расчетов
	|	Расчеты.КОплате                                     КАК Сумма
	|ИЗ
	|	РасчетыДвиженияКлиенты КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметрыРасчета
	|			ПО Расчеты.ОбъектРасчетов = ВтПараметрыРасчета.ПараметрОбъектРасчетов
	|				И Расчеты.АналитикаУчетаПоПартнерам = ВтПараметрыРасчета.ПараметрАналитикаУчетаПоПартнерам
	|				И Расчеты.Валюта = ВтПараметрыРасчета.ПараметрВалюта
	|				// В РасчетыДвижения лишние записи заказов КОплате с периодом больше даты заказа
	|				И Расчеты.ДатаРегистратора >= ВтПараметрыРасчета.ПараметрДатаНачалаПересчета
	|ГДЕ
	|	Расчеты.ВидДвижения = &Расход И Расчеты.КОплате > 0
	|	И (Расчеты.ПродажаПоЗаказу НЕ В (&ПустыеСсылкиНаЗаказы) ИЛИ ВтПараметрыРасчета.ПараметрГрафикВДоговоре)
	|	И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (&СписокТиповУточняющихПланы)
	|УПОРЯДОЧИТЬ ПО
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта,
	|	Расчеты.ДатаРегистратора,
	|	Расчеты.Период
	|";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрНакопления.РасчетыСКлиентами ","РегистрНакопления.РасчетыСПоставщиками ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Расход","ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПродажаПоЗаказу","ЗакупкаПоЗаказу");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыДвиженияКлиенты","РасчетыДвиженияПоставщики");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Расход","ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)");
	КонецЕсли;
	
	Результат  = Запрос.Выполнить();
	УточненияГрафиковОплат = Результат.Выгрузить();
	УточненияГрафиковОплат.Индексы.Добавить("Заказ");
	
	Возврат УточненияГрафиковОплат;
	
КонецФункции

Функция ПолучитьПриходныеДвиженияПоПлановымОтгрузкам(Запрос, ГлобальныеПеременные, ЭтоРасчетыСКлиентами = Ложь)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Расчеты.ОбъектРасчетов                              КАК ОбъектРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам                   КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта                                      КАК Валюта,
	|	Расчеты.ДатаРегистратора                            КАК ДатаВозникновения,
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора,ДЕНЬ)        КАК Дата,
	|	Расчеты.ПорядокОперации                             КАК ПорядокОперации,
	|	Расчеты.Регистратор                                 КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Расчеты.Период,ДЕНЬ)                  КАК ДатаПлановогоПогашения,
	|	Расчеты.КОтгрузке                                   КАК Сумма
	|ИЗ
	|	РасчетыДвиженияКлиенты КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметрыРасчета
	|			ПО Расчеты.ОбъектРасчетов = ВтПараметрыРасчета.ПараметрОбъектРасчетов
	|				И Расчеты.АналитикаУчетаПоПартнерам = ВтПараметрыРасчета.ПараметрАналитикаУчетаПоПартнерам
	|				И Расчеты.Валюта = ВтПараметрыРасчета.ПараметрВалюта
	|				// В РасчетыДвижения лишние записи заказов КОтгрузке с периодом больше даты заказа
	|				И Расчеты.ДатаРегистратора >= ВтПараметрыРасчета.ПараметрДатаНачалаПересчета
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (&ТипыРегистраторов)
	|		И Расчеты.ВидДвижения = &Расход
	|УПОРЯДОЧИТЬ ПО 
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта,
	|	Расчеты.ДатаРегистратора,
	|	Расчеты.Период
	|";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Расход","ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыДвиженияКлиенты","РасчетыДвиженияПоставщики");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Расход","ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипыРегистраторов", СписокТиповРегистраторовПланов());
	
	Результат  = Запрос.Выполнить();
	ПриходныеДвиженияГрафикаОтгрузки = Результат.Выгрузить();
	
	Возврат ПриходныеДвиженияГрафикаОтгрузки;
	
КонецФункции

// Параметры:
//  ТаблицаТекущихПриемников - ТаблицаЗначений - Содержит объекты расчетов, по которым необходимо найти связанные расчеты:
//   * ДатаНачалаПересчета - Дата - День, с которого выполняется поиск приемников
//   * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов источник, с которого нужно начинать поиск приемников
//   * АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика источник
//   * Валюта - СправочникСсылка.Валюты - Валюта источник
//  РассчитываемыеИзмерения - ТаблицаЗначений - Таблица уже добавленных рекурсивно объектов расчетов к пересчету:
//   * ПорядокОперации - Строка - Порядок для сортировки и определения связности объектов пересчета
//   * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов источник, с которого нужно начинать поиск приемников
//   * АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика источник
//   * Валюта - СправочникСсылка.Валюты - Валюта источник
//   * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов приемник
//   * АналитикаУчетаПоПартнерамПриемник - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика приемник
//   * ВалютаПриемник - СправочникСсылка.Валюты - Валюта приемник
//  ТекущаяГлубинаРекурсии - Число - Используется для ограничения поиска связей объектов расчетов
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * ДатаНачалаПересчета - Дата - День, с которого нужно выполнить распределение
//   * ПорядокОперации - Строка - Порядок для сортировки и определения связности объектов пересчета
//   * ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами - Какие расчеты нужно распределить
//   * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов для пересчета
//   * АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика для пересчета
//   * Валюта - СправочникСсылка.Валюты - Валюта для пересчета
//   * ПоДаннымОбъектаРасчетовИсточника - Булево - Это строка приемника
//   * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов приемник
//   * АналитикаУчетаПоПартнерамПриемник - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика приемник
//   * ВалютаПриемник - СправочникСсылка.Валюты - Валюта приемник
// 
Функция ПолучитьТаблицуСвязейРекурсивно(ТаблицаТекущихПриемников, РассчитываемыеИзмерения = Неопределено, ТекущаяГлубинаРекурсии = 0)
	
	Если ТекущаяГлубинаРекурсии >= 100 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	МассивПакетовЗапроса = Новый Массив;
	МассивОбъединенийЗапроса = Новый Массив;
	
	Если РассчитываемыеИзмерения = Неопределено Тогда
		// Первый вызов, необходимо добавить таблицу уже учтенных к расчету измерений
		
		РассчитываемыеИзмерения = Новый ТаблицаЗначений;
		КвалификаторСтроки = Новый КвалификаторыСтроки(40);
		РассчитываемыеИзмерения.Колонки.Добавить("ПорядокОперации", Новый ОписаниеТипов("Строка", , , , КвалификаторСтроки));
		РассчитываемыеИзмерения.Колонки.Добавить("ОбъектРасчетов", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
		РассчитываемыеИзмерения.Колонки.Добавить("АналитикаУчетаПоПартнерам", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам"));
		РассчитываемыеИзмерения.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
		РассчитываемыеИзмерения.Колонки.Добавить("ОбъектРасчетовПриемник", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
		РассчитываемыеИзмерения.Колонки.Добавить("АналитикаУчетаПоПартнерамПриемник", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам"));
		РассчитываемыеИзмерения.Колонки.Добавить("ВалютаПриемник", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
		
		// Для первого вызова ПорядокОперации не обязан быть заполненным
		УсловиеПоискаПриемников = "ВтТекущиеПриемники.ДатаНачалаПересчета <= Расчеты.Период";
		
		// Сгруппируем входную таблицу, чтобы дальнейший поиск работал оптимально
		МассивПакетовЗапроса.Добавить("
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.ДатаНачалаПересчета       КАК ДатаНачалаПересчета,
			|	Таблица.ПериодКонтроляИзмененийИСозданияЗаданий КАК ПериодКонтроляИзмененийИСозданияЗаданий,
			|	Таблица.ОбъектРасчетов            КАК ОбъектРасчетов,
			|	Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	Таблица.Валюта                    КАК Валюта
			|ПОМЕСТИТЬ ВтТаблицаТекущихПриемников
			|ИЗ
			|	&ТаблицаТекущихПриемников КАК Таблица
			|");
		
		// В первом вызове ищем не приемники, а текущие объекты к распределению
		МассивПакетовЗапроса.Добавить("
			|ВЫБРАТЬ
			|	МИНИМУМ(Таблица.ДатаНачалаПересчета) КАК ДатаНачалаПересчета,
			|	МИНИМУМ(Таблица.ПериодКонтроляИзмененийИСозданияЗаданий) КАК ПериодКонтроляИзмененийИСозданияЗаданий,
			|	Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
			|	Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	Таблица.Валюта КАК Валюта
			|ПОМЕСТИТЬ ВтТекущиеПриемники
			|ИЗ
			|	ВтТаблицаТекущихПриемников КАК Таблица
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.ОбъектРасчетов,
			|	Таблица.АналитикаУчетаПоПартнерам,
			|	Таблица.Валюта
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРасчетов,
			|	АналитикаУчетаПоПартнерам,
			|	Валюта"); 
		МассивПакетовЗапроса.Добавить("УНИЧТОЖИТЬ ВтТаблицаТекущихПриемников");
		
	Иначе
		
		УсловиеПоискаПриемников = "ВтТекущиеПриемники.ПорядокОперации <= Расчеты.ПорядокОперации";
		// Пустые объекты расчетов добавляются к поиску из пустого реквизита ОбъектРасчетовПриемник, их нужно отбросить
		МассивПакетовЗапроса.Добавить("
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.ДатаНачалаПересчета               КАК ДатаНачалаПересчета,
			|	Таблица.ПериодКонтроляИзмененийИСозданияЗаданий КАК ПериодКонтроляИзмененийИСозданияЗаданий,
			|	Таблица.ПорядокОперации                   КАК ПорядокОперации,
			|	Таблица.Регистратор                       КАК Регистратор,
			|	Таблица.Организация                       КАК Организация,
			|	Таблица.ОбъектРасчетовПриемник            КАК ОбъектРасчетов,
			|	Таблица.АналитикаУчетаПоПартнерамПриемник КАК АналитикаУчетаПоПартнерам,
			|	Таблица.ВалютаПриемник                    КАК Валюта
			|ПОМЕСТИТЬ ВтТекущиеПриемникиСПустыми
			|ИЗ
			|	&ТаблицаТекущихПриемников КАК Таблица
			|");
		
		МассивПакетовЗапроса.Добавить("
			|ВЫБРАТЬ
			|	МИНИМУМ(Таблица.ДатаНачалаПересчета) КАК ДатаНачалаПересчета,
			|	МИНИМУМ(Таблица.ПериодКонтроляИзмененийИСозданияЗаданий) КАК ПериодКонтроляИзмененийИСозданияЗаданий,
			|	Таблица.ПорядокОперации           КАК ПорядокОперации,
			|	Таблица.Регистратор               КАК Регистратор,
			|	Таблица.Организация               КАК Организация,
			|	Таблица.ОбъектРасчетов            КАК ОбъектРасчетов,
			|	Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	Таблица.Валюта                    КАК Валюта
			|ПОМЕСТИТЬ ВтТекущиеПриемники
			|ИЗ
			|	ВтТекущиеПриемникиСПустыми КАК Таблица
			|ГДЕ
			|	Таблица.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.ПорядокОперации,
			|	Таблица.Регистратор,
			|	Таблица.Организация,
			|	Таблица.ОбъектРасчетов,
			|	Таблица.АналитикаУчетаПоПартнерам,
			|	Таблица.Валюта
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРасчетов,
			|	АналитикаУчетаПоПартнерам,
			|	Валюта,
			|	ПорядокОперации
			|");
		
		МассивПакетовЗапроса.Добавить("УНИЧТОЖИТЬ ВтТекущиеПриемникиСПустыми");
		
		МассивОбъединенийЗапроса.Добавить("
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВтТекущиеПриемники.ДатаНачалаПересчета                           КАК ДатаНачалаПересчета,
			|	ВтТекущиеПриемники.ПериодКонтроляИзмененийИСозданияЗаданий       КАК ПериодКонтроляИзмененийИСозданияЗаданий,
			|	СправочникОбъектыРасчетов.ТипРасчетов                            КАК ТипРасчетов,
			|	ВтТекущиеПриемники.ПорядокОперации                               КАК ПорядокОперации,
			|	ВтТекущиеПриемники.Регистратор                                   КАК Регистратор,
			|	ВтТекущиеПриемники.Организация                                   КАК Организация,
			|	ВтТекущиеПриемники.ОбъектРасчетов                                КАК ОбъектРасчетов,
			|	ВтТекущиеПриемники.АналитикаУчетаПоПартнерам                     КАК АналитикаУчетаПоПартнерам,
			|	ВтТекущиеПриемники.Валюта                                        КАК Валюта,
			|	ИСТИНА                                                           КАК ПоДаннымОбъектаРасчетовИсточника,
			|	ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)                КАК ОбъектРасчетовПриемник,
			|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) КАК АналитикаУчетаПоПартнерамПриемник,
			|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)                         КАК ВалютаПриемник
			|ИЗ
			|	ВтТекущиеПриемники КАК ВтТекущиеПриемники
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК СправочникОбъектыРасчетов
			|		ПО ВтТекущиеПриемники.ОбъектРасчетов = СправочникОбъектыРасчетов.Ссылка
			|");
		
	КонецЕсли;
	
	МассивПакетовЗапроса.Добавить("
		|ВЫБРАТЬ
		|	Таблица.ПорядокОперации                   КАК ПорядокОперации,
		|	Таблица.ОбъектРасчетов                    КАК ОбъектРасчетов,
		|	Таблица.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
		|	Таблица.Валюта                            КАК Валюта,
		|	Таблица.ОбъектРасчетовПриемник            КАК ОбъектРасчетовПриемник,
		|	Таблица.АналитикаУчетаПоПартнерамПриемник КАК АналитикаУчетаПоПартнерамПриемник,
		|	Таблица.ВалютаПриемник                    КАК ВалютаПриемник
		|ПОМЕСТИТЬ ВтРассчитываемыеИзмерения
		|ИЗ
		|	&РассчитываемыеИзмерения КАК Таблица
		|ИНДЕКСИРОВАТЬ ПО
		|	ПорядокОперации,
		|	ОбъектРасчетов,
		|	АналитикаУчетаПоПартнерам,
		|	Валюта,
		|	ОбъектРасчетовПриемник,
		|	АналитикаУчетаПоПартнерамПриемник,
		|	ВалютаПриемник
		|");
	
	ШаблонТекстаЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(Расчеты.Период, ДЕНЬ) > ВтТекущиеПриемники.ДатаНачалаПересчета
		|			ТОГДА НАЧАЛОПЕРИОДА(Расчеты.Период, ДЕНЬ)
		|		ИНАЧЕ ВтТекущиеПриемники.ДатаНачалаПересчета
		|	КОНЕЦ                                      КАК ДатаНачалаПересчета,
		|	ВтТекущиеПриемники.ПериодКонтроляИзмененийИСозданияЗаданий КАК ПериодКонтроляИзмененийИСозданияЗаданий,
		|	&ТипРасчетов                               КАК ТипРасчетов,
		|	Расчеты.ПорядокОперации                    КАК ПорядокОперации,
		|	Расчеты.Регистратор                        КАК Регистратор,
		|	Расчеты.АналитикаУчетаПоПартнерам.Организация КАК Организация,
		|	Расчеты.ОбъектРасчетов                     КАК ОбъектРасчетов,
		|	Расчеты.АналитикаУчетаПоПартнерам          КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.Валюта                             КАК Валюта,
		|	Расчеты.ПоДаннымОбъектаРасчетовИсточника   КАК ПоДаннымОбъектаРасчетовИсточника,
		|	Расчеты.ОбъектРасчетовПриемник             КАК ОбъектРасчетовПриемник,
		|	Расчеты.АналитикаУчетаПоПартнерамПриемник  КАК АналитикаУчетаПоПартнерамПриемник,
		|	Расчеты.ВалютаПриемник                     КАК ВалютаПриемник
		|ИЗ
		|	ВтТекущиеПриемники КАК ВтТекущиеПриемники
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК Расчеты
		|		ПО ВтТекущиеПриемники.ОбъектРасчетов = Расчеты.ОбъектРасчетов
		|		И ВтТекущиеПриемники.АналитикаУчетаПоПартнерам = Расчеты.АналитикаУчетаПоПартнерам
		|		И ВтТекущиеПриемники.Валюта = Расчеты.Валюта
		|		И &УсловиеПоискаПриемников
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтРассчитываемыеИзмерения КАК ВтРассчитываемыеИзмерения
		|		ПО Расчеты.ОбъектРасчетов = ВтРассчитываемыеИзмерения.ОбъектРасчетов
		|		И Расчеты.АналитикаУчетаПоПартнерам = ВтРассчитываемыеИзмерения.АналитикаУчетаПоПартнерам
		|		И Расчеты.Валюта = ВтРассчитываемыеИзмерения.Валюта
		|		И Расчеты.ОбъектРасчетовПриемник = ВтРассчитываемыеИзмерения.ОбъектРасчетовПриемник
		|		И Расчеты.АналитикаУчетаПоПартнерамПриемник = ВтРассчитываемыеИзмерения.АналитикаУчетаПоПартнерамПриемник
		|		И Расчеты.ВалютаПриемник = ВтРассчитываемыеИзмерения.ВалютаПриемник
		|		И Расчеты.ПорядокОперации = ВтРассчитываемыеИзмерения.ПорядокОперации
		|ГДЕ
		|	Расчеты.Активность
		|	И ВтРассчитываемыеИзмерения.ОбъектРасчетов ЕСТЬ NULL
		|	И (&УсловиеЗаполненностиРесурсов)";
	
	// Ищем записи свяей в оперативном регистре расчетов с клиентами
	МассивОбъединенийЗапроса.Добавить(
		СтрЗаменить(СтрЗаменить(ШаблонТекстаЗапроса,
				"&УсловиеЗаполненностиРесурсов",
				"Расчеты.Сумма <> 0
				|	ИЛИ Расчеты.СуммаРегл <> 0
				|	ИЛИ Расчеты.СуммаУпр <> 0
				|	ИЛИ Расчеты.КОплате <> 0
				|	ИЛИ Расчеты.КОтгрузке <> 0"),
			"&ТипРасчетов",
			"ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)"));
	
	// Ищем записи свяей в регистре расчетов по срокам с клиентами
	МассивОбъединенийЗапроса.Добавить(
		СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ШаблонТекстаЗапроса,
						"Расчеты.Регистратор",
						"Расчеты.ДокументРегистратор"),
					Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя(),
					Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя()),
				"&УсловиеЗаполненностиРесурсов",
				"ИСТИНА"),
			"&ТипРасчетов",
			"ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)"));
	
	// Ищем записи свяей в оперативном регистре расчетов с поставщиками
	МассивОбъединенийЗапроса.Добавить(
		СтрЗаменить(СтрЗаменить(СтрЗаменить(ШаблонТекстаЗапроса,
					Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя(),
					Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя()),
				"&УсловиеЗаполненностиРесурсов",
				"Расчеты.Сумма <> 0
				|	ИЛИ Расчеты.СуммаРегл <> 0
				|	ИЛИ Расчеты.СуммаУпр <> 0
				|	ИЛИ Расчеты.КОплате <> 0
				|	ИЛИ Расчеты.КПоступлению <> 0"),
			"&ТипРасчетов",
			"ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)"));
	
	// Ищем записи свяей в регистре расчетов по срокам с поставщиками
	МассивОбъединенийЗапроса.Добавить(
		СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ШаблонТекстаЗапроса,
						"Расчеты.Регистратор",
						"Расчеты.ДокументРегистратор"),
					Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя(),
					Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя()),
				"&УсловиеЗаполненностиРесурсов",
				"ИСТИНА"),
			"&ТипРасчетов",
			"ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)"));
	
	МассивПакетовЗапроса.Добавить(СтрСоединить(МассивОбъединенийЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении(Истина)));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаТекущихПриемников", ТаблицаТекущихПриемников);
	Запрос.УстановитьПараметр("РассчитываемыеИзмерения", РассчитываемыеИзмерения);
	Запрос.Текст = СтрСоединить(МассивПакетовЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоискаПриемников", УсловиеПоискаПриемников);
	
	// Новые приемники к распределению
	ТаблицаПриемников = Запрос.Выполнить().Выгрузить();
	
	// В таблицу с уже добавленными к расчету данными добавляем все новые приемники
	Для Каждого СтрокаПриемника Из ТаблицаПриемников Цикл
		ЗаполнитьЗначенияСвойств(РассчитываемыеИзмерения.Добавить(), СтрокаПриемника);
	КонецЦикла;
	Если ТаблицаПриемников.Количество() > 0 Тогда
		ТаблицаСвязей = ПолучитьТаблицуСвязейРекурсивно(ТаблицаПриемников, РассчитываемыеИзмерения, ТекущаяГлубинаРекурсии + 1);
		Для Каждого СтрокаПриемника Из ТаблицаСвязей Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПриемников.Добавить(), СтрокаПриемника);
		КонецЦикла;
	КонецЕсли;
	
	ИменаКолонок = Новый Массив;
	Для Каждого Колонка Из ТаблицаПриемников.Колонки Цикл
		ИменаКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	ТаблицаПриемников.Свернуть(СтрСоединить(ИменаКолонок, ","));
	
	Возврат ТаблицаПриемников;
	
КонецФункции

// Находит рекурсивно все связанные объекты расчетов по переданной таблице
//
// Параметры:
//  ИсходнаяТаблицаКПересчету - ТаблицаЗначений - Содержит объекты расчетов, по которым необходимо найти связанные расчеты, обязательно должна содержать колонки:
//   * ДатаНачалаПересчета - Дата - День, с которого выполняется поиск приемников
//   * ПериодКонтроляИзмененийИСозданияЗаданий - Дата - день, с которого нужно проверять изменения и создавать задания
//   * ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами - Какие расчеты нужно распределить
//   * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов источник, с которого нужно начинать поиск приемников
//   * АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика источник
//   * Валюта - СправочникСсылка.Валюты - Валюта источник
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * ДатаНачалаПересчета - Дата - День, с которого нужно выполнить распределение
//   * ПериодКонтроляИзмененийИСозданияЗаданий - Дата - день, с которого нужно проверять изменения и создавать задания
//   * ПорядокОперации - Строка - Порядок для сортировки и определения связности объектов пересчета
//   * Регистратор - ДокументСсылка - Документ регистратор, образовавший связь, нужен для регистрации заданий к распределению приемников
//   * Организация - СправочникСсылка - Организация, используется для регистрации заданий к распределению приемников
//   * ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами - Какие расчеты нужно распределить
//   * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов для пересчета
//   * АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика для пересчета
//   * Валюта - СправочникСсылка.Валюты - Валюта для пересчета
//   * ПоДаннымОбъектаРасчетовИсточника - Булево - Это строка приемника
//   * ОбъектРасчетовПриемник - СправочникСсылка.ОбъектыРасчетов - Объект расчетов приемник
//   * АналитикаУчетаПоПартнерамПриемник - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика приемник
//   * ВалютаПриемник - СправочникСсылка.Валюты - Валюта приемник
// 
Функция ТаблицаСвязейИсточниковПриемников(ИсходнаяТаблицаКПересчету) Экспорт
	
	Результат = ИсходнаяТаблицаКПересчету.Скопировать();
	Если Результат.Колонки.Найти("ПорядокОперации") = Неопределено Тогда
		КвалификаторСтроки = Новый КвалификаторыСтроки(40);
		Результат.Колонки.Добавить("ПорядокОперации", Новый ОписаниеТипов("Строка", , , , КвалификаторСтроки));
	КонецЕсли;
	Если Результат.Колонки.Найти("Регистратор") = Неопределено Тогда
		Результат.Колонки.Добавить("Регистратор", Документы.ТипВсеСсылки());
	КонецЕсли;
	Если Результат.Колонки.Найти("Организация") = Неопределено Тогда
		Результат.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	КонецЕсли;
	Если Результат.Колонки.Найти("ПоДаннымОбъектаРасчетовИсточника") = Неопределено Тогда
		Результат.Колонки.Добавить("ПоДаннымОбъектаРасчетовИсточника", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	Если Результат.Колонки.Найти("ОбъектРасчетовПриемник") = Неопределено Тогда
		Результат.Колонки.Добавить("ОбъектРасчетовПриемник", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
	КонецЕсли;
	Если Результат.Колонки.Найти("АналитикаУчетаПоПартнерамПриемник") = Неопределено Тогда
		Результат.Колонки.Добавить("АналитикаУчетаПоПартнерамПриемник", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам"));
	КонецЕсли;
	Если Результат.Колонки.Найти("ВалютаПриемник") = Неопределено Тогда
		Результат.Колонки.Добавить("ВалютаПриемник", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	КонецЕсли;
	
	Для Каждого ИсходнаяСтрока Из Результат Цикл
		Если Не ЗначениеЗаполнено(ИсходнаяСтрока.ПорядокОперации) Тогда
			ИсходнаяСтрока.ПорядокОперации = Порядок(ИсходнаяСтрока.ДатаНачалаПересчета, "", Тип("ДокументСсылка.КорректировкаРегистров"), "0", "00");
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСвязей = ПолучитьТаблицуСвязейРекурсивно(ИсходнаяТаблицаКПересчету);
	
	Для Каждого НайденнаяСтрокаСвязи Из ТаблицаСвязей Цикл
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ДатаНачалаПересчета                     = НайденнаяСтрокаСвязи.ДатаНачалаПересчета;
		НоваяСтрока.ПериодКонтроляИзмененийИСозданияЗаданий = НайденнаяСтрокаСвязи.ПериодКонтроляИзмененийИСозданияЗаданий;
		НоваяСтрока.ПорядокОперации                         = НайденнаяСтрокаСвязи.ПорядокОперации;
		НоваяСтрока.Регистратор                             = НайденнаяСтрокаСвязи.Регистратор;
		НоваяСтрока.Организация                             = НайденнаяСтрокаСвязи.Организация;
		НоваяСтрока.ТипРасчетов                             = НайденнаяСтрокаСвязи.ТипРасчетов;
		НоваяСтрока.ОбъектРасчетов                          = НайденнаяСтрокаСвязи.ОбъектРасчетов;
		НоваяСтрока.АналитикаУчетаПоПартнерам               = НайденнаяСтрокаСвязи.АналитикаУчетаПоПартнерам;
		НоваяСтрока.Валюта                                  = НайденнаяСтрокаСвязи.Валюта;
		НоваяСтрока.ПоДаннымОбъектаРасчетовИсточника        = НайденнаяСтрокаСвязи.ПоДаннымОбъектаРасчетовИсточника;
		НоваяСтрока.ОбъектРасчетовПриемник                  = НайденнаяСтрокаСвязи.ОбъектРасчетовПриемник;
		НоваяСтрока.АналитикаУчетаПоПартнерамПриемник       = НайденнаяСтрокаСвязи.АналитикаУчетаПоПартнерамПриемник;
		НоваяСтрока.ВалютаПриемник                          = НайденнаяСтрокаСвязи.ВалютаПриемник;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//Возвращает таблицу закрывающих планы движений накладных
Функция ПолучитьЗакрытияГрафиковОтгрузок(Запрос, ГлобальныеПеременные, ЭтоРасчетыСКлиентами = Ложь)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Расчеты.ДатаРегистратора                            КАК ДатаДвижения,
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора,ДЕНЬ)        КАК ДатаВозникновения,
	|	Расчеты.ОбъектРасчетов                              КАК ОбъектРасчетов,
	|	Расчеты.АналитикаУчетаПоПартнерам                   КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Валюта                                      КАК Валюта,
	|	Расчеты.ПорядокОперации                             КАК ПорядокОперации,
	|	Расчеты.Регистратор                                 КАК Регистратор,
	|	ВЫБОР КОГДА ВтПараметрыРасчета.ПараметрГрафикВДоговоре
	|			ТОГДА ВтПараметрыРасчета.ПараметрГрафикИсполненияДоговора
	|			ИНАЧЕ Расчеты.ПродажаПоЗаказу
	|	КОНЕЦ                                               КАК Заказ,
	|//При АДДН и АЗДН сумма двигается по другому объекту расчетов
	|	Расчеты.КОтгрузке КАК Сумма
	|ИЗ
	|	РасчетыДвиженияКлиенты КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметрыРасчета
	|			ПО Расчеты.ОбъектРасчетов = ВтПараметрыРасчета.ПараметрОбъектРасчетов
	|				И Расчеты.АналитикаУчетаПоПартнерам = ВтПараметрыРасчета.ПараметрАналитикаУчетаПоПартнерам
	|				И Расчеты.Валюта = ВтПараметрыРасчета.ПараметрВалюта
	|				// В РасчетыДвижения лишние записи заказов КОтгрузке с периодом больше даты заказа
	|				И Расчеты.ДатаРегистратора >= ВтПараметрыРасчета.ПараметрДатаНачалаПересчета
	|ГДЕ
	|	Расчеты.КОтгрузке > 0 И Расчеты.ВидДвижения = &Приход
	|	И (Расчеты.ПродажаПоЗаказу НЕ В (&ПустыеСсылкиНаЗаказы) ИЛИ ВтПараметрыРасчета.ПараметрГрафикВДоговоре)
	|	И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (&СписокТиповУточняющихПланы)
	|УПОРЯДОЧИТЬ ПО
	|	Расчеты.ДатаРегистратора
	|";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Приход","ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПродажаПоЗаказу","ЗакупкаПоЗаказу");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыДвиженияКлиенты","РасчетыДвиженияПоставщики");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Приход","ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)");
	КонецЕсли;
	
	Результат  = Запрос.Выполнить();
	ЗакрытияГрафиковОтгрузок = Результат.Выгрузить();
	ЗакрытияГрафиковОтгрузок.Индексы.Добавить("Заказ");
	
	Возврат ЗакрытияГрафиковОтгрузок;
КонецФункции

Функция ТаблицаОстатковВзаиморасчетов(Запрос, ЭтоРасчетыСКлиентами);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Остатки.ОбъектРасчетов                                                            КАК ОбъектРасчетов,
	|	Остатки.АналитикаУчетаПоПартнерам                                                 КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Валюта                                                                    КАК Валюта,
	|
	|	Остатки.РасчетныйДокумент                                                         КАК РасчетныйДокумент,
	|	Остатки.ДатаВозникновения                                                         КАК ДатаВозникновения,
	|	Остатки.ДатаПлановогоПогашения                                                    КАК ДатаПлановогоПогашения,
	//Нужно для сортировки зачитываемых остатков при создании починочных записей.
	|	Остатки.ПорядокОперации                                                           КАК ПорядокОперации,
	|	Остатки.ПорядокЗачета                                                             КАК ПорядокЗачетаПоДатеПлатежа,
	|	Остатки.ДатаПлановогоПогашения = ДАТАВРЕМЯ(1,1,1)                                 КАК ДатаПогашенияНеЗаполнена,
	|
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВтПараметрыРасчета.ПараметрДатаНачалаПересчета,СЕКУНДА,-1),ДЕНЬ) КАК ДатаПереоценки,
	|	Остатки.Долг                                                                КАК Долг,
	|	Остатки.ДолгРегл                                                            КАК ДолгРегл,
	|	Остатки.ДолгУпр                                                             КАК ДолгУпр,
	|	Остатки.Предоплата                                                          КАК Предоплата,
	|	Остатки.ПредоплатаРегл                                                      КАК ПредоплатаРегл,
	|	Остатки.ПредоплатаУпр                                                       КАК ПредоплатаУпр
	|ИЗ
	|	ВТРасчетыПоСрокамОстаткиКлиенты КАК Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДополненныеПараметрыРаспределения КАК ВтПараметрыРасчета
	|			ПО Остатки.ОбъектРасчетов = ВтПараметрыРасчета.ПараметрОбъектРасчетов
	|				И Остатки.АналитикаУчетаПоПартнерам = ВтПараметрыРасчета.ПараметрАналитикаУчетаПоПартнерам
	|				И Остатки.Валюта = ВтПараметрыРасчета.ПараметрВалюта
	|ГДЕ
	|	Остатки.ЕстьПредоплата ИЛИ Остатки.ЕстьДолг
	|УПОРЯДОЧИТЬ ПО
	|	Остатки.ПорядокОперации,
	|	ВЫБОР КОГДА Остатки.ДатаПлановогоПогашения = ДАТАВРЕМЯ(1,1,1) И Остатки.Предоплата > 0
	|		ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ 
	|";
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТРасчетыПоСрокамОстаткиКлиенты","ВТРасчетыПоСрокамОстаткиПоставщики");
	КонецЕсли;
	
	Результат     = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
КонецФункции

#КонецОбласти

#Область ОбщиеМетодыДобавленияСтрок

#Область ДвиженияФактические

//Переоценивает долг до момента оплаты или по на текущий месяц
Процедура ПереоценитьДолг(ГлобальныеПеременные, ТекущиеПеременные, РасчетныйДокумент, ЗНАЧ Дата, ПереоценитьНаПереданнуюДату = Ложь)
	
	Если ТекущиеПеременные.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки 
		ИЛИ НЕ ТекущиеПеременные.НужнаПереоценка Тогда
		Возврат;
	КонецЕсли;
	
	Если Дата <> Неопределено Тогда
		Дата = НачалоДня(Дата);
	КонецЕсли;
	
	СтрокиДляПереоценки = ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.НайтиСтроки(Новый Структура("РасчетныйДокумент",РасчетныйДокумент));
	Для Каждого СтрокаОтгрузки Из СтрокиДляПереоценки Цикл
		
		Если СтрокаОтгрузки.Долг = 0 И НЕ ПереоценитьНаПереданнуюДату Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущиеПеременные.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки Тогда
		#Область ФиксированныйНаДатуОтгрузкиКурс
			// Переоценка до фиксированного курса возможна после частичной оплаты по другому ручному курсу или оплате в валюте, отличной от  валюты регл. учета
			Если Дата <> Неопределено Тогда
				СуммаПереоценкиРегл = Окр(СтрокаОтгрузки.Долг * ТекущиеПеременные.ФиксированныйКурсРегл, 2) - СтрокаОтгрузки.СуммаРегл;
				СуммаПереоценкиУпр = Окр(СтрокаОтгрузки.Долг * ТекущиеПеременные.ФиксированныйКурсУпр, 2) - СтрокаОтгрузки.СуммаУпр;
				ДобавитьЗаписьПереоценки(ТекущиеПеременные, Дата, СтрокаОтгрузки, "Долг", СуммаПереоценкиРегл, СуммаПереоценкиУпр);
				СтрокаОтгрузки.ДатаПереоценки = Дата;
			КонецЕсли;
			Продолжить;
		#КонецОбласти
		КонецЕсли;
		
		#Область ЕжемесячнаяПереоценка
		Если ГлобальныеПеременные.ЕжедневнаяПереоценка Тогда
			ДатаКэш = НачалоДня(СтрокаОтгрузки.ДатаПереоценки);
		Иначе
			ДатаКэш = НачалоДня(КонецМесяца(СтрокаОтгрузки.ДатаПереоценки));
		КонецЕсли;
		
		ОкончательнаяДатаПереоценки = ?(Дата <> Неопределено, Дата, ТекущаяДатаСеанса());
		Пока ДатаКэш < ОкончательнаяДатаПереоценки Цикл
			
			СтрокаКурса = ТекущиеПеременные.ТаблицаКурсовВалют.Найти(ДатаКэш, "Дата");
			
			Если СтрокаКурса <> Неопределено Тогда
				СуммаПереоценкиРегл = Окр(СтрокаОтгрузки.Долг * СтрокаКурса.КурсРегл, 2) - СтрокаОтгрузки.ДолгРегл;
				СуммаПереоценкиУпр = Окр(СтрокаОтгрузки.Долг * СтрокаКурса.КурсРегл / СтрокаКурса.КурсУпр, 2) - СтрокаОтгрузки.ДолгУпр;
				ДобавитьЗаписьПереоценки(ТекущиеПеременные, КонецДня(ДатаКэш), СтрокаОтгрузки, "Долг", СуммаПереоценкиРегл, СуммаПереоценкиУпр);
				СтрокаОтгрузки.ДатаПереоценки = ДатаКэш;
			КонецЕсли;
			
			Если ГлобальныеПеременные.ЕжедневнаяПереоценка Тогда
				ДатаКэш = ДатаКэш + 86400;
			Иначе
				ДатаКэш = НачалоДня(КонецМесяца(КонецМесяца(ДатаКэш)+1));
			КонецЕсли;
			
		КонецЦикла;
		
		#КонецОбласти
		
		#Область ПереоценкаНаПереданнуюДату
		Если Дата <> Неопределено И Дата > СтрокаОтгрузки.ДатаПереоценки 
			И ПереоценитьНаПереданнуюДату Тогда
			
			СтрокаКурса = ТекущиеПеременные.ТаблицаКурсовВалют.Найти(Дата, "Дата");
			Если СтрокаКурса <> Неопределено Тогда 
				СуммаПереоценкиРегл = Окр(СтрокаОтгрузки.Долг * СтрокаКурса.КурсРегл, 2) - СтрокаОтгрузки.ДолгРегл;
				СуммаПереоценкиУпр = Окр(СтрокаОтгрузки.Долг  * СтрокаКурса.КурсРегл / СтрокаКурса.КурсУпр, 2) - СтрокаОтгрузки.ДолгУпр;
				ДобавитьЗаписьПереоценки(ТекущиеПеременные, Дата, СтрокаОтгрузки, "Долг", СуммаПереоценкиРегл, СуммаПереоценкиУпр);
				СтрокаОтгрузки.ДатаПереоценки = Дата;
			КонецЕсли;
			
		КонецЕсли;
		#КонецОбласти
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СписатьРеглУпрПоНулевымОстаткам(ТекущиеПеременные, ПериодПереоценки)
	СтрокиДляПереоценки = ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.НайтиСтроки(Новый Структура("Долг,Предоплата",0,0));
	Для Каждого СтрокаДляПереоценки из СтрокиДляПереоценки Цикл
		Если СтрокаДляПереоценки.ДолгРегл <> 0 Или СтрокаДляПереоценки.ДолгУпр <> 0 Тогда
			ДобавитьЗаписьПереоценки(ТекущиеПеременные, ПериодПереоценки, СтрокаДляПереоценки, "Долг", -СтрокаДляПереоценки.ДолгРегл, -СтрокаДляПереоценки.ДолгУпр);
		КонецЕсли;
		Если СтрокаДляПереоценки.ПредоплатаРегл <> 0 Или СтрокаДляПереоценки.ПредоплатаУпр <> 0 Тогда
			ДобавитьЗаписьПереоценки(ТекущиеПеременные, ПериодПереоценки, СтрокаДляПереоценки, "Предоплата", -СтрокаДляПереоценки.ПредоплатаРегл, -СтрокаДляПереоценки.ПредоплатаУпр);
		КонецЕсли;
		ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Удалить(СтрокаДляПереоценки);
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьПриход(ТекущиеПеременные, СтрокаРасчетов, ТипИсточника)
	
	Если СтрокаРасчетов.Период >= ТекущиеПеременные.ДатаНачалаПересчета Тогда
	
		НовСтр = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
		НовСтр.ВидДвижения                   = ВидДвиженияНакопления.Приход;
		НовСтр.ДокументРегистратор           = СтрокаРасчетов.Регистратор;
		НовСтр.РасчетныйДокумент             = СтрокаРасчетов.РасчетныйДокумент;
		Если НЕ ЗначениеЗаполнено(НовСтр.РасчетныйДокумент) Тогда
			НовСтр.РасчетныйДокумент = СтрокаРасчетов.Регистратор;
		КонецЕсли;
		НовСтр.ХозяйственнаяОперация         = СтрокаРасчетов.ХозяйственнаяОперация;
		НовСтр.ВалютаДокумента               = СтрокаРасчетов.ВалютаДокумента;
		НовСтр.ДатаВозникновения             = ?(СтрокаРасчетов.Сторно, НачалоДня(СтрокаРасчетов.Период), СтрокаРасчетов.ДатаВозникновения);
		НовСтр.Период                        = СтрокаРасчетов.Период;
		НовСтр.ПорядокОперации               = СтрокаРасчетов.ПорядокОперации;
		НовСтр.СтатьяДвиженияДенежныхСредств = СтрокаРасчетов.СтатьяДвиженияДенежныхСредств;
		НовСтр.НастройкаХозяйственнойОперации = СтрокаРасчетов.НастройкаХозяйственнойОперации;
		НовСтр.ИдентификаторФинЗаписи        = СтрокаРасчетов.ИдентификаторФинЗаписи;
		НовСтр.КорОбъектРасчетов             = СтрокаРасчетов.КорОбъектРасчетов;
		НовСтр.КорАналитикаУчетаПоПартнерам  = СтрокаРасчетов.КорАналитикаУчетаПоПартнерам;
		НовСтр.АналитикаУчетаПоПартнерамПриемник = СтрокаРасчетов.АналитикаУчетаПоПартнерамПриемник;
		НовСтр.ОбъектРасчетовПриемник            = СтрокаРасчетов.ОбъектРасчетовПриемник;
		НовСтр.ВалютаПриемник                    = СтрокаРасчетов.ВалютаПриемник;
		НовСтр.СуммаПриемник                     = СтрокаРасчетов.СуммаПриемник;
		НовСтр.ПоДаннымОбъектаРасчетовИсточника  = СтрокаРасчетов.ПоДаннымОбъектаРасчетовИсточника;
		
		НовСтр.Сторно                        = Ложь;
		
		Если ТипИсточника = "Оплата" Тогда
		
			НовСтр.СвязанныйДокумент     = СтрокаРасчетов.СвязанныйДокумент;
		
			НовСтр.Долг           = 0;
			НовСтр.ДолгРегл       = 0;
			НовСтр.ДолгУпр        = 0;
		
			НовСтр.Предоплата     = СтрокаРасчетов.Сумма;
			НовСтр.ПредоплатаРегл = СтрокаРасчетов.СуммаРегл;
			НовСтр.ПредоплатаУпр  = СтрокаРасчетов.СуммаУпр;
			
			// Если остаток образован сторно записью, то дата погашения равна дате возникновения
			Если СтрокаРасчетов.Сторно Тогда
				НовСтр.ДатаПлановогоПогашения = НачалоДня(СтрокаРасчетов.Период);
			Иначе
				НовСтр.ДатаПлановогоПогашения = СтрокаРасчетов.ДатаПлановогоПогашения;
			КонецЕсли;
			
			НовСтр.ПорядокЗачета = ?(НовСтр.ДатаПлановогоПогашения= Дата(1,1,1),
												СтрокаРасчетов.ПорядокЗачетаПоДатеПлатежа,
												Формат(НовСтр.ДатаПлановогоПогашения , "ДФ=yyyyMMdd") + Прав(СтрокаРасчетов.ПорядокЗачетаПоДатеПлатежа,20));
		ИначеЕсли ТипИсточника = "ОтгрузкаПоставка" Тогда
		
			НовСтр.Долг           = СтрокаРасчетов.Сумма;
			НовСтр.ДолгРегл       = СтрокаРасчетов.СуммаРегл;
			НовСтр.ДолгУпр        = СтрокаРасчетов.СуммаУпр;
			
			НовСтр.Предоплата     = 0;
			НовСтр.ПредоплатаРегл = 0;
			НовСтр.ПредоплатаУпр  = 0;
			// Если остаток образован сторно записью, то дата погашения равна дате возникновения
			Если СтрокаРасчетов.Сторно Тогда
				НовСтр.ДатаПлановогоПогашения = НачалоДня(СтрокаРасчетов.Период);
			Иначе
				НовСтр.ДатаПлановогоПогашения = СтрокаРасчетов.ДатаПлановогоПогашения;
			КонецЕсли;
			НовСтр.ПорядокЗачета = СтрокаРасчетов.ПорядокЗачетаПоДатеПлатежа;
			
		КонецЕсли;
		НовСтр.ЗаписьДоНачалаРасчета = Ложь;
		НовСтр.ОперацияВзаиморасчетов = СтрокаРасчетов.ОперацияВзаиморасчетов;
		
		ДобавитьДвижениеВТаблицуОстатковРасчетов(ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов, НовСтр);
	КонецЕсли;

	Если ТипИсточника = "ОтгрузкаПоставка" Тогда
		//Записи в ДанныеНакладных может не быть.
		Если ТекущиеПеременные.ДанныеНакладных[СтрокаРасчетов.Регистратор] = Неопределено Тогда
			ТекущиеПеременные.ДанныеНакладных.Вставить(СтрокаРасчетов.Регистратор, СтруктураСумм());
		КонецЕсли;
		
		// Если добавляем приход, значит авансы уже зачтены, и осталась часть долга по курсу накладной.
		ДанныеНакладной = ТекущиеПеременные.ДанныеНакладных[СтрокаРасчетов.Регистратор];
		ДанныеНакладной.СуммаДокумента     = ДанныеНакладной.СуммаДокумента + СтрокаРасчетов.Сумма;
		ДанныеНакладной.СуммаДокументаРегл = ДанныеНакладной.СуммаДокументаРегл + СтрокаРасчетов.СуммаРегл;
		ДанныеНакладной.СуммаДокументаУпр  = ДанныеНакладной.СуммаДокументаУпр  + СтрокаРасчетов.СуммаУпр;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРасходДолга(ТекущиеПеременные, СтрокаОстатков, СтрокаРасчетов, СуммаСписания, СуммаСписанияРегл, СуммаСписанияУпр, ХозяйственнаяОперация = Неопределено);
	
	НовСтр_Долг_Расход = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
	НовСтр_Долг_Расход.ВидДвижения                   = ВидДвиженияНакопления.Расход;
	НовСтр_Долг_Расход.ДокументРегистратор           = СтрокаРасчетов.Регистратор;
	НовСтр_Долг_Расход.Период                        = СтрокаРасчетов.ПериодЗачета;
	НовСтр_Долг_Расход.ПорядокОперации               = СтрокаРасчетов.ПорядокОперации;
	
	НовСтр_Долг_Расход.РасчетныйДокумент             = СтрокаОстатков.РасчетныйДокумент;
	НовСтр_Долг_Расход.ДатаВозникновения             = СтрокаОстатков.ДатаВозникновения;
	НовСтр_Долг_Расход.ДатаПлановогоПогашения        = СтрокаОстатков.ДатаПлановогоПогашения;
	НовСтр_Долг_Расход.ПорядокЗачета                 = СтрокаОстатков.ПорядокЗачетаПоДатеПлатежа;
	
	НовСтр_Долг_Расход.НастройкаХозяйственнойОперации = СтрокаРасчетов.НастройкаХозяйственнойОперации;
	НовСтр_Долг_Расход.ИдентификаторФинЗаписи         = СтрокаРасчетов.ИдентификаторФинЗаписи;
	
	НовСтр_Долг_Расход.ХозяйственнаяОперация         = ?(ХозяйственнаяОперация = Неопределено, СтрокаРасчетов.ХозяйственнаяОперация, ХозяйственнаяОперация);
	НовСтр_Долг_Расход.ОперацияВзаиморасчетов        = СтрокаРасчетов.ОперацияВзаиморасчетов;
	НовСтр_Долг_Расход.ВалютаДокумента               = СтрокаРасчетов.ВалютаДокумента;
	НовСтр_Долг_Расход.СтатьяДвиженияДенежныхСредств = СтрокаРасчетов.СтатьяДвиженияДенежныхСредств;
	НовСтр_Долг_Расход.Сторно                        = Ложь;
	НовСтр_Долг_Расход.СвязанныйДокумент             = СтрокаРасчетов.СвязанныйДокумент;
	
	//С приемником связан только регистратор оплаты
	НовСтр_Долг_Расход.АналитикаУчетаПоПартнерамПриемник = СтрокаРасчетов.АналитикаУчетаПоПартнерамПриемник;
	НовСтр_Долг_Расход.ОбъектРасчетовПриемник            = СтрокаРасчетов.ОбъектРасчетовПриемник;
	НовСтр_Долг_Расход.ВалютаПриемник                    = СтрокаРасчетов.ВалютаПриемник;
	НовСтр_Долг_Расход.СуммаПриемник                     = СуммаСписания(0, СтрокаРасчетов.СуммаПриемник, СтрокаРасчетов.Сумма, СуммаСписания);
	СтрокаРасчетов.СуммаПриемник = СтрокаРасчетов.СуммаПриемник - НовСтр_Долг_Расход.СуммаПриемник;
	НовСтр_Долг_Расход.ПоДаннымОбъектаРасчетовИсточника  = СтрокаРасчетов.ПоДаннымОбъектаРасчетовИсточника;
	НовСтр_Долг_Расход.КорОбъектРасчетов                 = СтрокаРасчетов.КорОбъектРасчетов;
	НовСтр_Долг_Расход.КорАналитикаУчетаПоПартнерам      = СтрокаРасчетов.КорАналитикаУчетаПоПартнерам;
	
	НовСтр_Долг_Расход.Долг     = СуммаСписания;
	НовСтр_Долг_Расход.ДолгРегл = СуммаСписанияРегл;
	НовСтр_Долг_Расход.ДолгУпр  = СуммаСписанияУпр;
	НовСтр_Долг_Расход.ЗаписьДоНачалаРасчета = Ложь;
	НовСтр_Долг_Расход.Предоплата = 0;
	НовСтр_Долг_Расход.ПредоплатаРегл = 0;
	НовСтр_Долг_Расход.ПредоплатаУпр = 0;
	
	ДобавитьДвижениеВТаблицуОстатковРасчетов(ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов, НовСтр_Долг_Расход);
	
КонецПроцедуры

Функция ДобавитьРасходПредоплаты(ТекущиеПеременные, СтрокаОстатков, СтрокаРасчетов, СуммаСписания, СуммаСписанияРегл, СуммаСписанияУпр, ЗаполнятьПриемникиИсточники = Истина);
	
	НовСтр_Предоплата_Расход                          = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
	НовСтр_Предоплата_Расход.ВидДвижения              = ВидДвиженияНакопления.Расход;
	
	НовСтр_Предоплата_Расход.ДокументРегистратор      = СтрокаРасчетов.Регистратор;
	НовСтр_Предоплата_Расход.ВалютаДокумента          = СтрокаРасчетов.ВалютаДокумента;
	НовСтр_Предоплата_Расход.Период                   = СтрокаРасчетов.ПериодЗачета;
	НовСтр_Предоплата_Расход.РасчетныйДокумент        = СтрокаОстатков.РасчетныйДокумент;
	НовСтр_Предоплата_Расход.ДатаВозникновения        = СтрокаОстатков.ДатаВозникновения;
	НовСтр_Предоплата_Расход.ДатаПлановогоПогашения   = СтрокаОстатков.ДатаПлановогоПогашения;
	НовСтр_Предоплата_Расход.ПорядокЗачета            = СтрокаОстатков.ПорядокЗачетаПоДатеПлатежа;
	НовСтр_Предоплата_Расход.ПорядокОперации          = СтрокаРасчетов.ПорядокОперации;
	НовСтр_Предоплата_Расход.СтатьяДвиженияДенежныхСредств = СтрокаРасчетов.СтатьяДвиженияДенежныхСредств;
	
	Если ЗаполнятьПриемникиИсточники  Тогда
		НовСтр_Предоплата_Расход.АналитикаУчетаПоПартнерамПриемник = СтрокаРасчетов.АналитикаУчетаПоПартнерамПриемник;
		НовСтр_Предоплата_Расход.ОбъектРасчетовПриемник  = СтрокаРасчетов.ОбъектРасчетовПриемник;
		НовСтр_Предоплата_Расход.ВалютаПриемник  = СтрокаРасчетов.ВалютаПриемник;
		НовСтр_Предоплата_Расход.СуммаПриемник = СуммаСписания(0, СтрокаРасчетов.СуммаПриемник, СтрокаРасчетов.Сумма, СуммаСписания);
		СтрокаРасчетов.СуммаПриемник = СтрокаРасчетов.СуммаПриемник - НовСтр_Предоплата_Расход.СуммаПриемник;
		
		НовСтр_Предоплата_Расход.ПоДаннымОбъектаРасчетовИсточника = СтрокаРасчетов.ПоДаннымОбъектаРасчетовИсточника;
		НовСтр_Предоплата_Расход.КорОбъектРасчетов                = СтрокаРасчетов.КорОбъектРасчетов;
		НовСтр_Предоплата_Расход.КорАналитикаУчетаПоПартнерам     = СтрокаРасчетов.КорАналитикаУчетаПоПартнерам;
		
	Иначе
		НовСтр_Предоплата_Расход.АналитикаУчетаПоПартнерамПриемник = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
		НовСтр_Предоплата_Расход.ОбъектРасчетовПриемник  = Справочники.ОбъектыРасчетов.ПустаяСсылка();
		НовСтр_Предоплата_Расход.ВалютаПриемник  = Справочники.Валюты.ПустаяСсылка();
		НовСтр_Предоплата_Расход.СуммаПриемник = 0;
		
		НовСтр_Предоплата_Расход.ПоДаннымОбъектаРасчетовИсточника = ЛОЖЬ;
		НовСтр_Предоплата_Расход.КорОбъектРасчетов                = Справочники.ОбъектыРасчетов.ПустаяСсылка();
		НовСтр_Предоплата_Расход.КорАналитикаУчетаПоПартнерам     = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
	КонецЕсли;
	
	НовСтр_Предоплата_Расход.Сторно                   = Ложь;
	НовСтр_Предоплата_Расход.ХозяйственнаяОперация    = СтрокаРасчетов.ХозяйственнаяОперация;
	НовСтр_Предоплата_Расход.ИдентификаторФинЗаписи   = СтрокаРасчетов.ИдентификаторФинЗаписи;
	НовСтр_Предоплата_Расход.НастройкаХозяйственнойОперации = СтрокаРасчетов.НастройкаХозяйственнойОперации;
	
	НовСтр_Предоплата_Расход.Предоплата     = СуммаСписания;
	НовСтр_Предоплата_Расход.ПредоплатаРегл = СуммаСписанияРегл;
	НовСтр_Предоплата_Расход.ПредоплатаУпр  = СуммаСписанияУпр;
	НовСтр_Предоплата_Расход.ЗаписьДоНачалаРасчета = Ложь;
	НовСтр_Предоплата_Расход.ОперацияВзаиморасчетов = СтрокаРасчетов.ОперацияВзаиморасчетов;
	НовСтр_Предоплата_Расход.Долг           = 0;
	НовСтр_Предоплата_Расход.ДолгРегл       = 0;
	НовСтр_Предоплата_Расход.ДолгУпр        = 0;
	
	ДобавитьДвижениеВТаблицуОстатковРасчетов(ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов, НовСтр_Предоплата_Расход);
	
	Возврат НовСтр_Предоплата_Расход;
КонецФункции

//Добавляет записи переоценки долга.
Процедура ДобавитьЗаписьПереоценки(ТекущиеПеременные, Период, СтрокаРасчетов, Тип, СуммаРегл, СуммаУпр)
	
	Если НЕ ТекущиеПеременные.НужнаПереоценка
		ИЛИ СуммаРегл = 0 И СуммаУпр = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокПереоценки = ТекущиеПеременные.ПорядокПереоценки.Получить(Период);
	Если ПорядокПереоценки = Неопределено Тогда
		ПорядокПереоценки = Порядок(Период,"", Тип("ДокументСсылка.РасчетКурсовыхРазниц"),"9","99");
		ТекущиеПеременные.ПорядокПереоценки.Вставить(Период, ПорядокПереоценки);
	КонецЕсли;
	
	Если Период < ТекущиеПеременные.ДатаНачалаПересчета Тогда
		Возврат;
	КонецЕсли;
	
	Если СуммаРегл < 0 ИЛИ СуммаУпр < 0 Тогда
		СтрокаПереоценки = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
		СтрокаПереоценки.ВидДвижения              = ВидДвиженияНакопления.Расход;
		СтрокаПереоценки.ДокументРегистратор      = ТекущиеПеременные.ДокументыРасчетаКурсовыхРазниц[НачалоМесяца(Период)];
		СтрокаПереоценки.ХозяйственнаяОперация    = ТекущиеПеременные.ХозяйственныеОперации["ПереоценкаОтрицательная"];
		СтрокаПереоценки.РасчетныйДокумент        = СтрокаРасчетов.РасчетныйДокумент;
		СтрокаПереоценки.ДатаВозникновения        = СтрокаРасчетов.ДатаВозникновения;
		СтрокаПереоценки.НастройкаХозяйственнойОперации = ТекущиеПеременные.НастройкиХО["ПереоценкаОтрицательная"];
		СтрокаПереоценки.ИдентификаторФинЗаписи   = Новый УникальныйИдентификатор;
		СтрокаПереоценки.ПорядокЗачета            = ПорядокПереоценки;
		СтрокаПереоценки.Период                   = КонецДня(Период);
		СтрокаПереоценки.ПорядокОперации          = ПорядокПереоценки;
		СтрокаПереоценки.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
		СтрокаПереоценки.Долг = 0;
		СтрокаПереоценки.Предоплата = 0;
		
		Если Тип = "Долг" Тогда
			СтрокаПереоценки.ДолгРегл             = ?(СуммаРегл < 0, -СуммаРегл, 0);
			СтрокаПереоценки.ДолгУпр              = ?(СуммаУпр < 0, -СуммаУпр, 0);
			СтрокаПереоценки.ПредоплатаРегл = 0;
			СтрокаПереоценки.ПредоплатаУпр = 0;
			СтрокаПереоценки.ДатаПлановогоПогашения   = СтрокаРасчетов.ДатаПлановогоПогашения;
		Иначе
			СтрокаПереоценки.ПредоплатаРегл       = ?(СуммаРегл < 0, -СуммаРегл, 0);
			СтрокаПереоценки.ПредоплатаУпр        = ?(СуммаУпр < 0, -СуммаУпр, 0);
			СтрокаПереоценки.ДатаПлановогоПогашения   = Дата(1,1,1);
			СтрокаПереоценки.ДолгРегл = 0;
			СтрокаПереоценки.ДолгУпр = 0;
		КонецЕсли;
		СтрокаПереоценки.ЗаписьДоНачалаРасчета = Ложь;
		СтрокаПереоценки.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаЗадолженности;
		
		СтрокаПереоценки.КорОбъектРасчетов            = Справочники.ОбъектыРасчетов.ПустаяСсылка();
		СтрокаПереоценки.КорАналитикаУчетаПоПартнерам = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
		СтрокаПереоценки.АналитикаУчетаПоПартнерамПриемник = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
		СтрокаПереоценки.ОбъектРасчетовПриемник            = Справочники.ОбъектыРасчетов.ПустаяСсылка();
		СтрокаПереоценки.ВалютаПриемник            = Справочники.Валюты.ПустаяСсылка();
		СтрокаПереоценки.СуммаПриемник = 0;
		СтрокаПереоценки.ПоДаннымОбъектаРасчетовИсточника = ЛОЖЬ;
		СтрокаПереоценки.Сторно = Ложь;
		
		ДобавитьДвижениеВТаблицуОстатковРасчетов(ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов, СтрокаПереоценки, СтрокаРасчетов.ПорядокОперации);
	КонецЕсли;
	
	Если СуммаРегл > 0 ИЛИ СуммаУпр > 0 Тогда
		СтрокаПереоценки = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
		СтрокаПереоценки.ВидДвижения              = ВидДвиженияНакопления.Приход;
		СтрокаПереоценки.ДокументРегистратор      = ТекущиеПеременные.ДокументыРасчетаКурсовыхРазниц[НачалоМесяца(Период)];
		СтрокаПереоценки.ХозяйственнаяОперация    = ТекущиеПеременные.ХозяйственныеОперации["ПереоценкаПоложительная"];
		СтрокаПереоценки.РасчетныйДокумент        = СтрокаРасчетов.РасчетныйДокумент;
		СтрокаПереоценки.ДатаВозникновения        = СтрокаРасчетов.ДатаВозникновения;
		СтрокаПереоценки.НастройкаХозяйственнойОперации = ТекущиеПеременные.НастройкиХО["ПереоценкаПоложительная"];
		СтрокаПереоценки.ИдентификаторФинЗаписи   = Новый УникальныйИдентификатор;
		СтрокаПереоценки.ПорядокЗачета            = ПорядокПереоценки;
		СтрокаПереоценки.Период                   = КонецДня(Период);
		СтрокаПереоценки.ПорядокОперации          = ПорядокПереоценки;
		СтрокаПереоценки.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
		СтрокаПереоценки.Долг = 0;
		СтрокаПереоценки.Предоплата = 0;
		
		Если Тип = "Долг" Тогда
			СтрокаПереоценки.ДолгРегл               = ?(СуммаРегл > 0, СуммаРегл, 0);
			СтрокаПереоценки.ДолгУпр                = ?(СуммаУпр > 0, СуммаУпр, 0);
			СтрокаПереоценки.ПредоплатаРегл = 0;
			СтрокаПереоценки.ПредоплатаУпр = 0;
			СтрокаПереоценки.ДатаПлановогоПогашения = СтрокаРасчетов.ДатаПлановогоПогашения;
		Иначе
			СтрокаПереоценки.ПредоплатаРегл         = ?(СуммаРегл > 0, СуммаРегл, 0);
			СтрокаПереоценки.ПредоплатаУпр          = ?(СуммаУпр > 0, СуммаУпр, 0);
			СтрокаПереоценки.ДолгРегл = 0;
			СтрокаПереоценки.ДолгУпр = 0;
			СтрокаПереоценки.ДатаПлановогоПогашения   = Дата(1,1,1);
		КонецЕсли;
		СтрокаПереоценки.ЗаписьДоНачалаРасчета = Ложь;
		СтрокаПереоценки.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаЗадолженности;
		
		СтрокаПереоценки.КорОбъектРасчетов            = Справочники.ОбъектыРасчетов.ПустаяСсылка();
		СтрокаПереоценки.КорАналитикаУчетаПоПартнерам = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
		СтрокаПереоценки.АналитикаУчетаПоПартнерамПриемник = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
		СтрокаПереоценки.ОбъектРасчетовПриемник            = Справочники.ОбъектыРасчетов.ПустаяСсылка();
		СтрокаПереоценки.ВалютаПриемник            = Справочники.Валюты.ПустаяСсылка();
		СтрокаПереоценки.СуммаПриемник = 0;
		СтрокаПереоценки.ПоДаннымОбъектаРасчетовИсточника = ЛОЖЬ;
		СтрокаПереоценки.Сторно = Ложь;
		
		ДобавитьДвижениеВТаблицуОстатковРасчетов(ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов, СтрокаПереоценки, СтрокаРасчетов.ПорядокОперации, СтрокаРасчетов.ПорядокЗачетаПоДатеПлатежа);
	КонецЕсли;
	
КонецПроцедуры

// Добавить движение в таблицу остатков расчетов.
// 
// Параметры:
//  ТаблицаОстатковВзаиморасчетов - ТаблицаЗначений - Таблица остатков взаиморасчетов
//  СтрокаРасчетовПоСрокам - СтрокаТаблицыЗначений - Строка расчетов по срокам, которую надо добавить в остатки.
//  ПорядокОперации - Неопределено, СтрокаТаблицыЗначений - Порядок операции, который будет присвоен строке таблицы остатков. 
//  ПорядокЗачетаПоДатеПлатежа - Неопределено - Порядок зачета по дате платежа, который будет присвоен строке таблицы остатков.
Процедура ДобавитьДвижениеВТаблицуОстатковРасчетов(ТаблицаОстатковВзаиморасчетов, СтрокаРасчетовПоСрокам, ПорядокОперации = Неопределено, ПорядокЗачетаПоДатеПлатежа = Неопределено)
	
	Если СтрокаРасчетовПоСрокам.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
		Множитель = -1;
	Иначе
		Множитель = 1;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("РасчетныйДокумент,ДатаВозникновения,ДатаПлановогоПогашения");
	ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаРасчетовПоСрокам);
	СтрокиТаблицыКонтроля = ТаблицаОстатковВзаиморасчетов.НайтиСтроки(СтруктураПоиска);
	
	Если СтрокиТаблицыКонтроля.Количество() = 0 Тогда
		
		Если СтрокаРасчетовПоСрокам.ВидДвижения = ВидДвиженияНакопления.Расход
			И ПорядокОперации = Неопределено Тогда
			ВызватьИсключение(НСтр("ru = 'Не указана строка остатков для списания'", ОбщегоНазначения.КодОсновногоЯзыка()));
		КонецЕсли;
		
		СтрокаТаблицыКонтроля = ТаблицаОстатковВзаиморасчетов.Добавить();
		СтрокаТаблицыКонтроля.РасчетныйДокумент = СтрокаРасчетовПоСрокам.РасчетныйДокумент;
		СтрокаТаблицыКонтроля.ДатаВозникновения = СтрокаРасчетовПоСрокам.ДатаВозникновения;
		СтрокаТаблицыКонтроля.ДатаПлановогоПогашения = СтрокаРасчетовПоСрокам.ДатаПлановогоПогашения;
		СтрокаТаблицыКонтроля.ПорядокОперации = ?(ПорядокОперации=Неопределено, СтрокаРасчетовПоСрокам.ПорядокОперации, ПорядокОперации);
		СтрокаТаблицыКонтроля.ПорядокЗачетаПоДатеПлатежа = ?(ПорядокЗачетаПоДатеПлатежа=Неопределено, СтрокаРасчетовПоСрокам.ПорядокЗачета, ПорядокЗачетаПоДатеПлатежа);
		СтрокаТаблицыКонтроля.ДатаПогашенияНеЗаполнена = Не ЗначениеЗаполнено(СтрокаТаблицыКонтроля.ДатаПлановогоПогашения);
		СтрокаТаблицыКонтроля.ДатаПереоценки = НачалоДня(СтрокаРасчетовПоСрокам.Период);
		
		СтрокаТаблицыКонтроля.Долг = СтрокаРасчетовПоСрокам.Долг * Множитель;
		СтрокаТаблицыКонтроля.ДолгРегл = СтрокаРасчетовПоСрокам.ДолгРегл * Множитель;
		СтрокаТаблицыКонтроля.ДолгУпр = СтрокаРасчетовПоСрокам.ДолгУпр * Множитель;
		СтрокаТаблицыКонтроля.Предоплата = СтрокаРасчетовПоСрокам.Предоплата * Множитель;
		СтрокаТаблицыКонтроля.ПредоплатаРегл = СтрокаРасчетовПоСрокам.ПредоплатаРегл * Множитель;
		СтрокаТаблицыКонтроля.ПредоплатаУпр = СтрокаРасчетовПоСрокам.ПредоплатаУпр * Множитель;
	Иначе
		СтрокаТаблицыКонтроля = СтрокиТаблицыКонтроля[0];
		СтрокаТаблицыКонтроля.Долг = СтрокаТаблицыКонтроля.Долг + СтрокаРасчетовПоСрокам.Долг * Множитель;
		СтрокаТаблицыКонтроля.ДолгРегл = СтрокаТаблицыКонтроля.ДолгРегл + СтрокаРасчетовПоСрокам.ДолгРегл * Множитель;
		СтрокаТаблицыКонтроля.ДолгУпр = СтрокаТаблицыКонтроля.ДолгУпр + СтрокаРасчетовПоСрокам.ДолгУпр * Множитель;
		СтрокаТаблицыКонтроля.Предоплата = СтрокаТаблицыКонтроля.Предоплата + СтрокаРасчетовПоСрокам.Предоплата * Множитель;
		СтрокаТаблицыКонтроля.ПредоплатаРегл = СтрокаТаблицыКонтроля.ПредоплатаРегл + СтрокаРасчетовПоСрокам.ПредоплатаРегл * Множитель;
		СтрокаТаблицыКонтроля.ПредоплатаУпр = СтрокаТаблицыКонтроля.ПредоплатаУпр + СтрокаРасчетовПоСрокам.ПредоплатаУпр * Множитель;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//Пересчитывает сумму регл. и упр. учета строки расчетов по курсу связанного документа, если он проведен.
Процедура ПересчитатьСуммыЕслиЭтоКорректировка(ГлобальныеПеременные, ТекущиеПеременные, СтрокаРасчетов, ТипИсточника = "")
	
	ДанныеНакладных = ТекущиеПеременные.ДанныеНакладных;
	
	Если ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент] <> Неопределено
			И ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокумента <> 0 Тогда
		
		Если ТекущиеПеременные.ВалютаРегламентированногоУчета <> СтрокаРасчетов.ВалютаДокумента
				И ТекущиеПеременные.ВалютаРегламентированногоУчета <> ТекущиеПеременные.Валюта Тогда
			СтрокаРасчетов.СуммаРегл = Окр(СтрокаРасчетов.Сумма *
				(ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокументаРегл
					/ ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокумента),2);
		КонецЕсли;
		Если ГлобальныеПеременные.ВалютаУправленческогоУчета <> СтрокаРасчетов.ВалютаДокумента
				И ГлобальныеПеременные.ВалютаУправленческогоУчета <> ТекущиеПеременные.Валюта Тогда
			СтрокаРасчетов.СуммаУпр = Окр(СтрокаРасчетов.Сумма *
				(ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокументаУпр
					/ ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокумента),2);
		КонецЕсли;
		
		Если ТипИсточника = "ОтгрузкаПоставка" Тогда
			
			СтрокаРасчетов.ИсходнаяСуммаРегл = Окр(СтрокаРасчетов.ИсходнаяСумма
				* (ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокументаРегл
					/ ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокумента),2);
			СтрокаРасчетов.ИсходнаяСуммаУпр = Окр(СтрокаРасчетов.ИсходнаяСумма
				* (ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокументаУпр
					/ ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокумента),2);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет сумму регл. и упр. учета строк оплаты или отгрузки/поставки перед добавлением приходных движений
// по курсу сохраненных сумм расходных движений корректировки графика.
Процедура ЗаполнитьДанныеКорректировкиГрафика(ТекущиеПеременные, Регистратор, ДанныеДляРаспределения, ЭтоОплата)
	
	ДанныеКорректировкиГрафика = ТекущиеПеременные.ДанныеКорректировокГрафиков[Регистратор];
	// Неопределено возможно, если записи корректировки по начислению и списанию уже добавлены ранее до начала пересчета
	Если ДанныеКорректировкиГрафика <> Неопределено
		И ДанныеКорректировкиГрафика.СуммаРасход >= 0 Тогда
		СтрокиРасчетов = ДанныеДляРаспределения.НайтиСтроки(Новый Структура("Регистратор",Регистратор));
		// Сумму для прихода необходимо распределять, начиная с более поздних дат погашения 
		Индекс = СтрокиРасчетов.Количество();
		Пока Индекс > 0 Цикл
			
			Индекс = Индекс - 1;
			СтрокаРасчетов = СтрокиРасчетов[Индекс];
			
			Если СтрокаРасчетов.Сумма = 0
				Или СтрокаРасчетов.ЭтоОплата <> ЭтоОплата Тогда
				Продолжить;
			КонецЕсли;
			
			Сумма = Мин(ДанныеКорректировкиГрафика.СуммаРасход, СтрокаРасчетов.Сумма);
			
			Если СтрокаРасчетов.Сумма = Сумма Тогда
				СтрокаРасчетов.СуммаРегл = СуммаСписания(0, ДанныеКорректировкиГрафика.СуммаРасходРегл, ДанныеКорректировкиГрафика.СуммаРасход, Сумма);
				СтрокаРасчетов.СуммаУпр  = СуммаСписания(0, ДанныеКорректировкиГрафика.СуммаРасходУпр,  ДанныеКорректировкиГрафика.СуммаРасход, Сумма);
				СтрокаРасчетов.ДатаВозникновения = ДанныеКорректировкиГрафика.ДатаВозникновения;
			Иначе
				СтрокаРасчетов.Сумма = ДанныеКорректировкиГрафика.СуммаРасход;
				СтрокаРасчетов.СуммаРегл = ДанныеКорректировкиГрафика.СуммаРасходРегл;
				СтрокаРасчетов.СуммаУпр = ДанныеКорректировкиГрафика.СуммаРасходУпр;
				СтрокаРасчетов.ДатаВозникновения = ДанныеКорректировкиГрафика.ДатаВозникновения;
			КонецЕсли;
			
			ДанныеКорректировкиГрафика.СуммаРасход     = ДанныеКорректировкиГрафика.СуммаРасход     - СтрокаРасчетов.Сумма;
			ДанныеКорректировкиГрафика.СуммаРасходРегл = ДанныеКорректировкиГрафика.СуммаРасходРегл - СтрокаРасчетов.СуммаРегл;
			ДанныеКорректировкиГрафика.СуммаРасходУпр  = ДанныеКорректировкиГрафика.СуммаРасходУпр  - СтрокаРасчетов.СуммаУпр;
			
		КонецЦикла;
		// Все строки по приходным движениям уменьшили, больше в цикл по уменьшению суммы не нужно заходить
		Если ДанныеКорректировкиГрафика.СуммаРасход = 0 Тогда
			ТекущиеПеременные.ДанныеКорректировокГрафиков[Регистратор] = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ДвиженияПланов

// Закрытие графика оплаты заказа фактической отгрузкой. Изменяет строку остатка.
// Параметры:
//  ТекущиеПеременные - Структура
//  СтрокаОстатка - СтрокаТаблицыЗначений - строка остатка плана по заказу.
//  СтрокаРасчетов - СтрокаТаблицыЗначений - строка расчетов, закрывающая остаток.
//  СуммаСписания - Число.
Процедура УменьшитьПланОплатыПоЗаказу(ТаблицаДвиженийПлановыхОплат, СтрокаОстатка, СтрокаУточнения, СуммаСписания, ДатаНераспределенногоАванса = Неопределено)
	
	Если СуммаСписания = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаУточнения.Сумма = СтрокаУточнения.Сумма - СуммаСписания;
	
	Если НачалоДня(СтрокаУточнения.ДатаДвижения) < СтрокаОстатка.ДатаВозникновения Тогда
		ДокументРегистратор = СтрокаОстатка.ДокументПлан;
		ПорядокОперации = "";
		Период = СтрокаОстатка.ДатаВозникновения;
	Иначе
		ДокументРегистратор = СтрокаУточнения.Регистратор;
		ПорядокОперации = СтрокаУточнения.ПорядокОперации;
		Период = СтрокаУточнения.ДатаДвижения;
	КонецЕсли;
	
	НовСтр = ТаблицаДвиженийПлановыхОплат.Добавить();
	НовСтр.ВидДвижения               = ВидДвиженияНакопления.Расход;
	НовСтр.ДокументРегистратор       = ДокументРегистратор;
	НовСтр.ПорядокОперации           = ПорядокОперации;
	НовСтр.ДокументОплаты            = СтрокаУточнения.Регистратор;
	
	НовСтр.ДокументПлан              = СтрокаОстатка.ДокументПлан;
	НовСтр.ВариантОплаты             = СтрокаОстатка.ВариантОплаты;
	НовСтр.ДатаВозникновения         = СтрокаОстатка.ДатаВозникновения;
	НовСтр.ДатаПлановогоПогашения    = СтрокаОстатка.ДатаПлановогоПогашения;
	
	// Закрытие графика оплаты фактической отгрузкой
	Если ДатаНераспределенногоАванса = Неопределено Тогда
		НовСтр.Период                    = Период;
		НовСтр.НераспределенныйАванс     = ЛОЖЬ;
		НовСтр.КОплате                   = СуммаСписания;
		
		СтрокаОстатка.КОплате = СтрокаОстатка.КОплате - СуммаСписания;
		
		// Если есть нераспределенные остатки по этой строке - сторнируем их.
		Если СтрокаОстатка.КОплатеНераспределенныйАванс < 0 Тогда
			СуммаСторнирования = Макс(-СуммаСписания, СтрокаОстатка.КОплатеНераспределенныйАванс);
			СторнироватьНераспределенныйАванс(ТаблицаДвиженийПлановыхОплат, СтрокаОстатка, СтрокаУточнения, СуммаСторнирования);
			СуммаСписания = СуммаСписания + СуммаСторнирования;
		КонецЕсли;
	// Предварительно закрытие графика оплаты фактической оплатой
	Иначе
		НовСтр.Период                    = ДатаНераспределенногоАванса;
		НовСтр.НераспределенныйАванс     = ИСТИНА;
		НовСтр.КОплате                   = СуммаСписания;
		
		СтрокаОстатка.КОплатеНераспределенныйАванс = СтрокаОстатка.КОплатеНераспределенныйАванс - СуммаСписания;
		СтрокаОстатка.ЕстьКОплатеНераспределенныйАванс = СтрокаОстатка.КОплатеНераспределенныйАванс < 0;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ТаблицаДвиженийПлановыхОплат - ТаблицаЗначений
//  СтрокаОстатка - СтрокаТаблицыЗначений
//  СтрокаУточнения - СтрокаТаблицыЗначений
//  СуммаСписания - Число
//  ДатаНераспределенногоАванса - Дата - Передается если сторнируется запись нераспределенного аванса другим нераспределенным авансом.
Процедура СторнироватьНераспределенныйАванс(ТаблицаДвиженийПлановыхОплат, СтрокаОстатка, СтрокаУточнения, СуммаСписания, ДатаНераспределенногоАванса = Неопределено)
	
	Если СуммаСписания = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Если сначала провели документ уточнения, а потом заказ.
	Если НачалоДня(СтрокаУточнения.ДатаДвижения) < СтрокаОстатка.ДатаВозникновения Тогда
		ДокументРегистратор = СтрокаОстатка.ДокументПлан;
		ПорядокОперации = "";
		Период = СтрокаОстатка.ДатаВозникновения;
	Иначе
		ДокументРегистратор = СтрокаУточнения.Регистратор;
		ПорядокОперации = СтрокаУточнения.ПорядокОперации;
		Период = СтрокаУточнения.ДатаДвижения;
	КонецЕсли;
	
	НовСтр = ТаблицаДвиженийПлановыхОплат.Добавить();
	НовСтр.ВидДвижения               = ВидДвиженияНакопления.Расход;
	НовСтр.ДокументРегистратор       = ДокументРегистратор;
	НовСтр.ДокументПлан              = СтрокаОстатка.ДокументПлан;
	НовСтр.ВариантОплаты             = СтрокаОстатка.ВариантОплаты;
	НовСтр.Период                    = ?(ДатаНераспределенногоАванса = Неопределено, Период, ДатаНераспределенногоАванса);
	НовСтр.ПорядокОперации           = ПорядокОперации;
	НовСтр.ДатаВозникновения         = СтрокаОстатка.ДатаВозникновения;
	НовСтр.ДатаПлановогоПогашения    = СтрокаОстатка.ДатаПлановогоПогашения;
	НовСтр.НераспределенныйАванс     = ИСТИНА;
	НовСтр.ДокументОплаты            = СтрокаУточнения.Регистратор;
	НовСтр.КОплате                   = СуммаСписания;
	
	СтрокаОстатка.КОплатеНераспределенныйАванс = СтрокаОстатка.КОплатеНераспределенныйАванс - СуммаСписания;
	
КонецПроцедуры

// Параметры:
//  ТаблицаДвиженийПлановыхОтгрузок - ТаблицаЗначений
//  СтрокаОстатка - СтрокаТаблицыЗначений
//  СтрокаУточнения - СтрокаТаблицыЗначений
//  СуммаСписания - Число
//  ДатаНераспределенногоАванса - Дата
Процедура УменьшитьПланОтгрузкиПоЗаказу(ТаблицаДвиженийПлановыхОтгрузок, СтрокаОстатка, СтрокаУточнения, СуммаСписания, ДатаНераспределенногоАванса = Неопределено)
	
	Если СуммаСписания = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаУточнения.Сумма = СтрокаУточнения.Сумма - СуммаСписания;
	
	Если НачалоДня(СтрокаУточнения.ДатаДвижения) < СтрокаОстатка.ДатаВозникновения Тогда
		ДокументРегистратор = СтрокаОстатка.ДокументПлан;
		ПорядокОперации = "";
		Период = СтрокаОстатка.ДатаВозникновения;
	Иначе
		ДокументРегистратор = СтрокаУточнения.Регистратор;
		ПорядокОперации = СтрокаУточнения.ПорядокОперации;
		Период = СтрокаУточнения.ДатаДвижения;
	КонецЕсли;
	
	НовСтр = ТаблицаДвиженийПлановыхОтгрузок.Добавить();
	НовСтр.ВидДвижения               = ВидДвиженияНакопления.Расход;
	НовСтр.ДокументРегистратор       = ДокументРегистратор;
	НовСтр.ПорядокОперации           = ПорядокОперации;
	НовСтр.ДокументОплаты            = СтрокаУточнения.Регистратор;
	
	НовСтр.ДокументПлан              = СтрокаОстатка.ДокументПлан;
	НовСтр.ДатаВозникновения         = СтрокаОстатка.ДатаВозникновения;
	НовСтр.ДатаПлановогоПогашения    = СтрокаОстатка.ДатаПлановогоПогашения;
	
	НовСтр.Сумма                     = СуммаСписания;
	
	НовСтр.УчтеноВОстаткахПлановыхОтгрузок = Ложь;
	Если ДатаНераспределенногоАванса = Неопределено Тогда
		НовСтр.Период                    = Период;
		НовСтр.НераспределенныйАванс     = ЛОЖЬ;
		
		СтрокаОстатка.Сумма = СтрокаОстатка.Сумма - СуммаСписания;
		
		// Если есть нераспределенные остатки по этой строке - сторнируем их.
		Если СтрокаОстатка.СуммаНераспределенныйАванс < 0 Тогда
			СуммаСторнирования = Макс(-СуммаСписания, СтрокаОстатка.СуммаНераспределенныйАванс);;
			СторнироватьНераспределенныйАвансПланаОтгрузок(ТаблицаДвиженийПлановыхОтгрузок, СтрокаОстатка, СтрокаУточнения, СуммаСторнирования);
			СуммаСписания = СуммаСписания + СуммаСторнирования;
		КонецЕсли;
		
	Иначе
		НовСтр.Период                    = ДатаНераспределенногоАванса;
		НовСтр.НераспределенныйАванс     = ИСТИНА;
		СтрокаОстатка.СуммаНераспределенныйАванс = СтрокаОстатка.СуммаНераспределенныйАванс - СуммаСписания;
		СтрокаОстатка.ЕстьСуммаНераспределенныйАванс = СтрокаОстатка.СуммаНераспределенныйАванс < 0;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ТаблицаДвиженийПлановыхОтгрузок - ТаблицаЗначений
//  СтрокаОстатка - СтрокаТаблицыЗначений
//  СтрокаУточнения - СтрокаТаблицыЗначений
//  СуммаСписания - Число
//  ДатаНераспределенногоАванса - Дата
Процедура СторнироватьНераспределенныйАвансПланаОтгрузок(ТаблицаДвиженийПлановыхОтгрузок, СтрокаОстатка, СтрокаУточнения, СуммаСписания, ДатаНераспределенногоАванса = Неопределено)
	
	Если СуммаСписания = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Если сначала провели документ уточнения, а потом заказ.
	Если НачалоДня(СтрокаУточнения.ДатаДвижения) < СтрокаОстатка.ДатаВозникновения Тогда
		ДокументРегистратор = СтрокаОстатка.ДокументПлан;
		ПорядокОперации = "";
		Период = СтрокаОстатка.ДатаВозникновения;
	Иначе
		ДокументРегистратор = СтрокаУточнения.Регистратор;
		ПорядокОперации = СтрокаУточнения.ПорядокОперации;
		Период = СтрокаУточнения.ДатаДвижения;
	КонецЕсли;
	
	НовСтр = ТаблицаДвиженийПлановыхОтгрузок.Добавить();
	НовСтр.ВидДвижения               = ВидДвиженияНакопления.Расход;
	НовСтр.ДокументРегистратор       = ДокументРегистратор;
	НовСтр.ДокументПлан              = СтрокаОстатка.ДокументПлан;
	НовСтр.Период                    = ?(ДатаНераспределенногоАванса = Неопределено, Период, ДатаНераспределенногоАванса);
	НовСтр.ПорядокОперации           = ПорядокОперации;
	НовСтр.ДатаВозникновения         = СтрокаОстатка.ДатаВозникновения;
	НовСтр.ДатаПлановогоПогашения    = СтрокаОстатка.ДатаПлановогоПогашения;
	НовСтр.НераспределенныйАванс     = ИСТИНА;
	НовСтр.ДокументОплаты            = СтрокаУточнения.Регистратор;
	НовСтр.Сумма                     = СуммаСписания;
	НовСтр.УчтеноВОстаткахПлановыхОтгрузок = ЛОЖЬ;
	
	СтрокаОстатка.СуммаНераспределенныйАванс = СтрокаОстатка.СуммаНераспределенныйАванс - СуммаСписания;
	СтрокаОстатка.ЕстьСуммаНераспределенныйАванс = СтрокаОстатка.СуммаНераспределенныйАванс < 0;
	
КонецПроцедуры

#КонецОбласти

#Область Сторно

Процедура ДобавитьМинусовоеДвижениеСторно(ТекущиеПеременные, СтрокаИсходногоРегистратора, ДвижениеИсходногоДокумента)
	
	СтрокаСторно = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
	
	СтрокаСторно.ВидДвижения = ДвижениеИсходногоДокумента.ВидДвижения;
	
	СтрокаСторно.РасчетныйДокумент = ДвижениеИсходногоДокумента.РасчетныйДокумент;
	СтрокаСторно.ДатаПлановогоПогашения = ДвижениеИсходногоДокумента.ДатаПлановогоПогашения;
	СтрокаСторно.ДатаВозникновения = ДвижениеИсходногоДокумента.ДатаВозникновения;
	
	СтрокаСторно.ДокументРегистратор = СтрокаИсходногоРегистратора.НовыйРегистратор;
	СтрокаСторно.Период              = СтрокаИсходногоРегистратора.НовыйПериод;
	СтрокаСторно.ПорядокОперации     = СтрокаИсходногоРегистратора.НовыйПорядокОперации;
	СтрокаСторно.ПорядокЗачета       = СтрокаИсходногоРегистратора.НовыйПорядокОперации;
	
	СтрокаСторно.ХозяйственнаяОперация       = ДвижениеИсходногоДокумента.ХозяйственнаяОперация;
	СтрокаСторно.НастройкаХозяйственнойОперации  = ДвижениеИсходногоДокумента.НастройкаХозяйственнойОперации;
	СтрокаСторно.ИдентификаторФинЗаписи        = ДвижениеИсходногоДокумента.ИдентификаторФинЗаписи;
	СтрокаСторно.ВалютаДокумента               = ДвижениеИсходногоДокумента.ВалютаДокумента;
	СтрокаСторно.СтатьяДвиженияДенежныхСредств = ДвижениеИсходногоДокумента.СтатьяДвиженияДенежныхСредств;
	
	СтрокаСторно.Долг           = -ДвижениеИсходногоДокумента.Долг;
	СтрокаСторно.ДолгРегл       = -ДвижениеИсходногоДокумента.ДолгРегл;
	СтрокаСторно.ДолгУпр        = -ДвижениеИсходногоДокумента.ДолгУпр;
	СтрокаСторно.Предоплата     = -ДвижениеИсходногоДокумента.Предоплата;
	СтрокаСторно.ПредоплатаРегл = -ДвижениеИсходногоДокумента.ПредоплатаРегл;
	СтрокаСторно.ПредоплатаУпр  = -ДвижениеИсходногоДокумента.ПредоплатаУпр;
	СтрокаСторно.Сторно = Истина;
	
	СтрокаСторно.ЗаписьДоНачалаРасчета = Ложь;
	// Если движение исходного документа после начала расчетов, то тип записи еще не заполнен - определяем по операции взаиморасчетов
	СтрокаСторно.ОперацияВзаиморасчетов = ДвижениеИсходногоДокумента.ОперацияВзаиморасчетов;
	// Если движение исходного документа до начала расчетов, то сразу берем его тип записи 
	СтрокаСторно.ТипЗаписиВзаиморасчетов = ДвижениеИсходногоДокумента.ТипЗаписиВзаиморасчетов;
	
	СтрокаСторно.КорАналитикаУчетаПоПартнерам = ДвижениеИсходногоДокумента.КорАналитикаУчетаПоПартнерам;
	СтрокаСторно.КорОбъектРасчетов = ДвижениеИсходногоДокумента.КорОбъектРасчетов;
	СтрокаСторно.АналитикаУчетаПоПартнерамПриемник = ДвижениеИсходногоДокумента.АналитикаУчетаПоПартнерамПриемник;
	СтрокаСторно.ОбъектРасчетовПриемник = ДвижениеИсходногоДокумента.ОбъектРасчетовПриемник;
	СтрокаСторно.ВалютаПриемник = ДвижениеИсходногоДокумента.ВалютаПриемник;
	СтрокаСторно.СуммаПриемник = ДвижениеИсходногоДокумента.СуммаПриемник;
	СтрокаСторно.ПоДаннымОбъектаРасчетовИсточника = ДвижениеИсходногоДокумента.ПоДаннымОбъектаРасчетовИсточника;
	
	ДобавитьДвижениеВТаблицуОстатковРасчетов(ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов, СтрокаСторно, ДвижениеИсходногоДокумента.ПорядокОперации, ДвижениеИсходногоДокумента.ПорядокЗачета);
	
КонецПроцедуры

Процедура ДобавитьПочиночноеДвижениеНаМинусовойОстаток(ГлобальныеПеременные, ТекущиеПеременные, СтрокаКонтроля, СтрокаРасчетовРегистратора)
	
	ИсправляемМинусПоДолгу = СтрокаКонтроля.Долг < 0;
	
	Если ИсправляемМинусПоДолгу Тогда
		Ресурс = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.Долг.Имя;
		РесурсРегл = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ДолгРегл.Имя;
		РесурсУпр = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ДолгУпр.Имя;
		ПротивоположныйРесурс = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.Предоплата.Имя;
		ПротивоположныйРесурсРегл = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ПредоплатаРегл.Имя;
		ПротивоположныйРесурсУпр = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ПредоплатаУпр.Имя;
	Иначе
		Ресурс = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.Предоплата.Имя;
		РесурсРегл = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ПредоплатаРегл.Имя;
		РесурсУпр = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ПредоплатаУпр.Имя;
		ПротивоположныйРесурс = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.Долг.Имя;
		ПротивоположныйРесурсРегл = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ДолгРегл.Имя;
		ПротивоположныйРесурсУпр = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ДолгУпр.Имя;
	КонецЕсли;
	
	СуммаПочиночного = -СтрокаКонтроля[Ресурс];
	СуммаПочиночногоРегл = -СтрокаКонтроля[РесурсРегл];
	СуммаПочиночногоУпр = -СтрокаКонтроля[РесурсУпр];
	Пока СуммаПочиночного > 0 Цикл
		СуммаСписания = Неопределено;
		
		//Закрываем минус на другой минус в противоположном ресурсе
		Для Каждого СтрокаОстатков Из ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов Цикл
			Если СтрокаОстатков[ПротивоположныйРесурс] < 0 И СтрокаРасчетовРегистратора.Период >= СтрокаОстатков.ДатаВозникновения Тогда
				
				ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВосстановлениеДолгаАвансаПриСторноВзаиморасчетов;
				НастройкаХозяйственнойОперации = Справочники.НастройкиХозяйственныхОпераций.ВосстановлениеДолгаАвансаПриСторноВзаиморасчетов;
				
				СуммаСписания = Мин(-СтрокаОстатков[ПротивоположныйРесурс],СуммаПочиночного);
				СуммаСписанияРегл = СуммаСписания(0,СуммаПочиночногоРегл,СуммаПочиночного,СуммаСписания);
				СуммаСписанияУпр = СуммаСписания(0,СуммаПочиночногоУпр,СуммаПочиночного,СуммаСписания);
				
				#Область СвязанноеПриходноеПочиночноеДвижение
				НовСтр_Приход = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
				НовСтр_Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
				
				НовСтр_Приход.РасчетныйДокумент = СтрокаОстатков.РасчетныйДокумент;
				НовСтр_Приход.ДатаПлановогоПогашения = СтрокаОстатков.ДатаПлановогоПогашения;
				НовСтр_Приход.ДатаВозникновения = СтрокаОстатков.ДатаВозникновения;
				
				НовСтр_Приход.ДокументРегистратор = СтрокаРасчетовРегистратора.Регистратор;
				НовСтр_Приход.Период              = СтрокаРасчетовРегистратора.Период;
				НовСтр_Приход.ПорядокОперации     = СтрокаРасчетовРегистратора.ПорядокОперации;
				НовСтр_Приход.ПорядокЗачета       = СтрокаРасчетовРегистратора.ПорядокОперации;
				НовСтр_Приход.ИдентификаторФинЗаписи  = СтрокаРасчетовРегистратора.ИдентификаторРегистратора;
				НовСтр_Приход.ВалютаДокумента               = СтрокаРасчетовРегистратора.ВалютаДокумента;
				НовСтр_Приход.СтатьяДвиженияДенежныхСредств = Неопределено;
				
				НовСтр_Приход.ХозяйственнаяОперация           = ХозяйственнаяОперация;
				НовСтр_Приход.НастройкаХозяйственнойОперации  = НастройкаХозяйственнойОперации;
				
				НовСтр_Приход[Ресурс]        = 0;
				НовСтр_Приход[РесурсРегл]    = 0;
				НовСтр_Приход[РесурсУпр]     = 0;
				НовСтр_Приход[ПротивоположныйРесурс]        = СуммаСписания;
				НовСтр_Приход[ПротивоположныйРесурсРегл]    = СуммаСписанияРегл;
				НовСтр_Приход[ПротивоположныйРесурсУпр]     = СуммаСписанияУпр;
				
				НовСтр_Приход.Сторно = Ложь;
				
				НовСтр_Приход.ЗаписьДоНачалаРасчета = Ложь;
				НовСтр_Приход.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаЗадолженности;
				
				НовСтр_Приход.КорАналитикаУчетаПоПартнерам = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
				НовСтр_Приход.КорОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
				НовСтр_Приход.АналитикаУчетаПоПартнерамПриемник = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
				НовСтр_Приход.ОбъектРасчетовПриемник = Справочники.ОбъектыРасчетов.ПустаяСсылка();
				НовСтр_Приход.ВалютаПриемник = Справочники.Валюты.ПустаяСсылка();
				НовСтр_Приход.СуммаПриемник = 0;
				НовСтр_Приход.ПоДаннымОбъектаРасчетовИсточника = Ложь;
				
				ДобавитьДвижениеВТаблицуОстатковРасчетов(ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов,НовСтр_Приход);
				
				#КонецОбласти
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		//Закрываем минус на плюс в этом же ресурсе
		Если СуммаСписания = Неопределено Тогда
			Для Каждого СтрокаОстатков Из ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов Цикл
				Если СтрокаОстатков[Ресурс] > 0 И СтрокаРасчетовРегистратора.Период >= СтрокаОстатков.ДатаВозникновения Тогда
					
					Если Ресурс = "Долг" Тогда
						ХозяйственнаяОперация           = Перечисления.ХозяйственныеОперации.ПерезачетДолгаПриСторноВзаиморасчетов;
						НастройкаХозяйственнойОперации  = Справочники.НастройкиХозяйственныхОпераций.ПерезачетДолгаПриСторноВзаиморасчетов;
					Иначе
						ХозяйственнаяОперация           = Перечисления.ХозяйственныеОперации.ПерезачетАвансаПриСторноВзаиморасчетов;
						НастройкаХозяйственнойОперации  = Справочники.НастройкиХозяйственныхОпераций.ПерезачетАвансаПриСторноВзаиморасчетов;
					КонецЕсли;
					
					СуммаСписания = Мин(СтрокаОстатков[Ресурс],СуммаПочиночного);
					СуммаСписанияРегл = СуммаСписания(0,СуммаПочиночногоРегл,СуммаПочиночного,СуммаСписания);
					СуммаСписанияУпр = СуммаСписания(0,СуммаПочиночногоУпр,СуммаПочиночного,СуммаСписания);
					
					#Область СвязанноеРасходноеПочиночноеДвижение
					НовСтр_Расход = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
					НовСтр_Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
					
					НовСтр_Расход.РасчетныйДокумент = СтрокаОстатков.РасчетныйДокумент;
					НовСтр_Расход.ДатаПлановогоПогашения = СтрокаОстатков.ДатаПлановогоПогашения;
					НовСтр_Расход.ДатаВозникновения = СтрокаОстатков.ДатаВозникновения;
					
					НовСтр_Расход.ДокументРегистратор = СтрокаРасчетовРегистратора.Регистратор;
					НовСтр_Расход.Период              = СтрокаРасчетовРегистратора.Период;
					НовСтр_Расход.ПорядокОперации     = СтрокаРасчетовРегистратора.ПорядокОперации;
					НовСтр_Расход.ПорядокЗачета       = СтрокаРасчетовРегистратора.ПорядокОперации;
					НовСтр_Расход.ИдентификаторФинЗаписи  = СтрокаРасчетовРегистратора.ИдентификаторРегистратора;
					НовСтр_Расход.ВалютаДокумента               = СтрокаРасчетовРегистратора.ВалютаДокумента;
					НовСтр_Расход.СтатьяДвиженияДенежныхСредств = СтрокаРасчетовРегистратора.СтатьяДвиженияДенежныхСредств;
					
					НовСтр_Расход.ХозяйственнаяОперация           = ХозяйственнаяОперация;
					НовСтр_Расход.НастройкаХозяйственнойОперации  = НастройкаХозяйственнойОперации;
					
					НовСтр_Расход[Ресурс]        = СуммаСписания;
					НовСтр_Расход[РесурсРегл]    = СуммаСписанияРегл;
					НовСтр_Расход[РесурсУпр]     = СуммаСписанияУпр;
					НовСтр_Расход[ПротивоположныйРесурс]        = 0;
					НовСтр_Расход[ПротивоположныйРесурсРегл]    = 0;
					НовСтр_Расход[ПротивоположныйРесурсУпр]     = 0;
					
					НовСтр_Расход.Сторно = Ложь;
					
					НовСтр_Расход.ЗаписьДоНачалаРасчета = Ложь;
					НовСтр_Расход.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаЗадолженности;
					
					НовСтр_Расход.КорАналитикаУчетаПоПартнерам = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
					НовСтр_Расход.КорОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
					НовСтр_Расход.АналитикаУчетаПоПартнерамПриемник = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
					НовСтр_Расход.ОбъектРасчетовПриемник = Справочники.ОбъектыРасчетов.ПустаяСсылка();
					НовСтр_Расход.ВалютаПриемник = Справочники.Валюты.ПустаяСсылка();
					НовСтр_Расход.СуммаПриемник = 0;
					НовСтр_Расход.ПоДаннымОбъектаРасчетовИсточника = Ложь;
					
					ДобавитьДвижениеВТаблицуОстатковРасчетов(ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов,НовСтр_Расход );
					
					Если Ресурс = "Долг" Тогда
						ПереоценитьДолг(ГлобальныеПеременные, ТекущиеПеременные, СтрокаОстатков.РасчетныйДокумент, СтрокаРасчетовРегистратора.Период, Истина);
					КонецЕсли;
					
					#КонецОбласти
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Если не удалось найти остатки для уменьшения - добавляем приход.
		Если СуммаСписания = Неопределено Тогда
			
			ХозяйственнаяОперация           = Перечисления.ХозяйственныеОперации.ВосстановлениеДолгаАвансаПриСторноВзаиморасчетов;
			НастройкаХозяйственнойОперации  = Справочники.НастройкиХозяйственныхОпераций.ВосстановлениеДолгаАвансаПриСторноВзаиморасчетов;
			
			СуммаСписания = СуммаПочиночного;
			СуммаСписанияРегл = СуммаПочиночногоРегл;
			СуммаСписанияУпр = СуммаПочиночногоУпр;
			
			#Область СвязанноеПриходноеПочиночноеДвижение
			НовСтр_Приход = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
			НовСтр_Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
			
			НовСтр_Приход.РасчетныйДокумент = СтрокаРасчетовРегистратора.РасчетныйДокумент;
			НовСтр_Приход.ДатаПлановогоПогашения = СтрокаРасчетовРегистратора.ДатаПлановогоПогашения;
			НовСтр_Приход.ДатаВозникновения = СтрокаРасчетовРегистратора.ДатаВозникновения;
			
			НовСтр_Приход.ДокументРегистратор = СтрокаРасчетовРегистратора.Регистратор;
			НовСтр_Приход.Период              = СтрокаРасчетовРегистратора.Период;
			НовСтр_Приход.ПорядокОперации     = СтрокаРасчетовРегистратора.ПорядокОперации;
			НовСтр_Приход.ПорядокЗачета       = СтрокаРасчетовРегистратора.ПорядокОперации;
			НовСтр_Приход.ИдентификаторФинЗаписи  = СтрокаРасчетовРегистратора.ИдентификаторРегистратора;
			НовСтр_Приход.ВалютаДокумента               = СтрокаРасчетовРегистратора.ВалютаДокумента;
			НовСтр_Приход.СтатьяДвиженияДенежныхСредств = СтрокаРасчетовРегистратора.СтатьяДвиженияДенежныхСредств;
			
			НовСтр_Приход.ХозяйственнаяОперация           = ХозяйственнаяОперация;
			НовСтр_Приход.НастройкаХозяйственнойОперации  = НастройкаХозяйственнойОперации;
			
			НовСтр_Приход[ПротивоположныйРесурс]        = СуммаСписания;
			НовСтр_Приход[ПротивоположныйРесурсРегл]    = СуммаСписанияРегл;
			НовСтр_Приход[ПротивоположныйРесурсУпр]     = СуммаСписанияУпр;
			НовСтр_Приход[Ресурс]        = 0;
			НовСтр_Приход[РесурсРегл]    = 0;
			НовСтр_Приход[РесурсУпр]     = 0;
			
			НовСтр_Приход.Сторно = Ложь;
			
			НовСтр_Приход.ЗаписьДоНачалаРасчета = Ложь;
			НовСтр_Приход.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаЗадолженности;
			
			НовСтр_Приход.КорАналитикаУчетаПоПартнерам = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
			НовСтр_Приход.КорОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
			НовСтр_Приход.АналитикаУчетаПоПартнерамПриемник = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
			НовСтр_Приход.ОбъектРасчетовПриемник = Справочники.ОбъектыРасчетов.ПустаяСсылка();
			НовСтр_Приход.ВалютаПриемник = Справочники.Валюты.ПустаяСсылка();
			НовСтр_Приход.СуммаПриемник = 0;
			НовСтр_Приход.ПоДаннымОбъектаРасчетовИсточника = Ложь;
			
			ДобавитьДвижениеВТаблицуОстатковРасчетов(ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов,НовСтр_Приход);
			
			#КонецОбласти
			
		КонецЕсли;
	
		#Область ДобавлениеДвиженияДляЗакрытияМинуса
	
		СтрокаПочиночная = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
		
		СтрокаПочиночная.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		СтрокаПочиночная.РасчетныйДокумент = СтрокаКонтроля.РасчетныйДокумент;
		СтрокаПочиночная.ДатаПлановогоПогашения = СтрокаКонтроля.ДатаПлановогоПогашения;
		СтрокаПочиночная.ДатаВозникновения = СтрокаКонтроля.ДатаВозникновения;
		
		СтрокаПочиночная.ДокументРегистратор = СтрокаРасчетовРегистратора.Регистратор;
		СтрокаПочиночная.Период              = СтрокаРасчетовРегистратора.Период;
		СтрокаПочиночная.ПорядокОперации     = СтрокаРасчетовРегистратора.ПорядокОперации;
		СтрокаПочиночная.ПорядокЗачета       = СтрокаРасчетовРегистратора.ПорядокОперации;
		СтрокаПочиночная.ИдентификаторФинЗаписи  = СтрокаРасчетовРегистратора.ИдентификаторРегистратора;
		СтрокаПочиночная.ВалютаДокумента               = СтрокаРасчетовРегистратора.ВалютаДокумента;
		СтрокаПочиночная.СтатьяДвиженияДенежныхСредств = СтрокаРасчетовРегистратора.СтатьяДвиженияДенежныхСредств;
		
		СтрокаПочиночная.ХозяйственнаяОперация           = ХозяйственнаяОперация;
		СтрокаПочиночная.НастройкаХозяйственнойОперации  = НастройкаХозяйственнойОперации;
		СтрокаПочиночная.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаЗадолженности;
		
		СтрокаПочиночная[Ресурс]         = СуммаСписания;
		СтрокаПочиночная[РесурсРегл]     = СуммаСписанияРегл;
		СтрокаПочиночная[РесурсУпр]      = СуммаСписанияУпр;
		СтрокаПочиночная[ПротивоположныйРесурс]        = 0;
		СтрокаПочиночная[ПротивоположныйРесурсРегл]    = 0;
		СтрокаПочиночная[ПротивоположныйРесурсУпр]     = 0;
		
		СтрокаПочиночная.Сторно = Ложь;
		
		СтрокаПочиночная.ЗаписьДоНачалаРасчета = Ложь;
		
		СтрокаПочиночная.КорАналитикаУчетаПоПартнерам = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
		СтрокаПочиночная.КорОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
		СтрокаПочиночная.АналитикаУчетаПоПартнерамПриемник = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
		СтрокаПочиночная.ОбъектРасчетовПриемник = Справочники.ОбъектыРасчетов.ПустаяСсылка();
		СтрокаПочиночная.ВалютаПриемник = Справочники.Валюты.ПустаяСсылка();
		СтрокаПочиночная.СуммаПриемник = 0;
		СтрокаПочиночная.ПоДаннымОбъектаРасчетовИсточника = Ложь;
		
		// Вместо добавления в таблицу контроля и сворачивания 
		СтрокаКонтроля.Долг = 0;
		СтрокаКонтроля.ДолгРегл = 0;
		СтрокаКонтроля.ДолгУпр = 0;
		СтрокаКонтроля.Предоплата = 0;
		СтрокаКонтроля.ПредоплатаРегл = 0;
		СтрокаКонтроля.ПредоплатаУпр = 0;
		
		Если Ресурс = "Долг" Тогда
			ПереоценитьДолг(ГлобальныеПеременные, ТекущиеПеременные, СтрокаКонтроля.РасчетныйДокумент, СтрокаРасчетовРегистратора.Период, Истина);
		КонецЕсли;
		
		#КонецОбласти
		
		СуммаПочиночного = СуммаПочиночного - СуммаСписания;
		СуммаПочиночногоРегл = СуммаПочиночногоРегл - СуммаСписанияРегл;
		СуммаПочиночногоУпр = СуммаПочиночногоУпр - СуммаСписанияУпр;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПочиночныеДвиженияНаРазвернутоеСальдо(ГлобальныеПеременные, ТекущиеПеременные, СуммаДляСворачивания, СтрокаРасчетовРегистратора)
	
	СуммаСписанияДолга = СуммаДляСворачивания;
	СуммаСписанияПредоплаты = СуммаДляСворачивания;
	// Списываем по курсу предоплаты
	СуммаПредоплатыРегл = 0;
	СуммаПредоплатыУпр = 0;
	
	Для Каждого СтрокаОстатков Из ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов Цикл
		Если СуммаСписанияПредоплаты = 0 Тогда
			Прервать;
		КонецЕсли;
		Если СтрокаОстатков.Предоплата = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьПочиночноеДвижениеРазвернутогоСальдо(ГлобальныеПеременные, ТекущиеПеременные, СтрокаОстатков, СтрокаРасчетовРегистратора, СуммаСписанияПредоплаты, СуммаПредоплатыРегл, СуммаПредоплатыУпр);
		
	КонецЦикла;
	
	Для Каждого СтрокаОстатков Из ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов Цикл
		Если СуммаСписанияДолга = 0 Тогда
			Прервать;
		КонецЕсли;
		Если СтрокаОстатков.Долг = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьПочиночноеДвижениеРазвернутогоСальдо(ГлобальныеПеременные, ТекущиеПеременные, СтрокаОстатков, СтрокаРасчетовРегистратора, СуммаСписанияДолга, СуммаПредоплатыРегл, СуммаПредоплатыУпр);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПочиночноеДвижениеРазвернутогоСальдо(ГлобальныеПеременные, ТекущиеПеременные, СтрокаОстатков, СтрокаРасчетовРегистратора, СуммаКСписанию, СуммаПредоплатыРегл, СуммаПредоплатыУпр)
	
	Если СтрокаОстатков.Долг > 0 И СуммаКСписанию > 0 Тогда
		Ресурс = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.Долг.Имя;
		РесурсРегл = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ДолгРегл.Имя;
		РесурсУпр = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ДолгУпр.Имя;
		ПротивоположныйРесурс = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.Предоплата.Имя;
		ПротивоположныйРесурсРегл = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ПредоплатаРегл.Имя;
		ПротивоположныйРесурсУпр = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ПредоплатаУпр.Имя;
		ЭтоДолг = Истина;
	Иначе
		Ресурс = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.Предоплата.Имя;
		РесурсРегл = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ПредоплатаРегл.Имя;
		РесурсУпр = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ПредоплатаУпр.Имя;
		ПротивоположныйРесурс = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.Долг.Имя;
		ПротивоположныйРесурсРегл = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ДолгРегл.Имя;
		ПротивоположныйРесурсУпр = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Ресурсы.ДолгУпр.Имя;
		ЭтоДолг = Ложь;
	КонецЕсли;
	
	СуммаСписания = Мин(СтрокаОстатков[Ресурс],СуммаКСписанию);
	
	Если ЭтоДолг Тогда
		СуммаСписанияРегл = СуммаСписания(0,СуммаПредоплатыРегл,СуммаКСписанию,СуммаСписания);
		СуммаСписанияУпр = СуммаСписания(0,СуммаПредоплатыУпр,СуммаКСписанию,СуммаСписания);
	Иначе
		СуммаСписанияРегл = СуммаСписания(0,СтрокаОстатков[РесурсРегл],СтрокаОстатков[Ресурс],СуммаСписания);
		СуммаСписанияУпр = СуммаСписания(0,СтрокаОстатков[РесурсУпр],СтрокаОстатков[Ресурс],СуммаСписания);
	КонецЕсли;
	
	СуммаКСписанию = СуммаКСписанию - СуммаСписания;
	
	СтрокаОстатков[Ресурс] = СтрокаОстатков[Ресурс] - СуммаСписания;
	СтрокаОстатков[РесурсРегл] = СтрокаОстатков[РесурсРегл] - СуммаСписанияРегл;
	СтрокаОстатков[РесурсУпр] = СтрокаОстатков[РесурсУпр] - СуммаСписанияУпр;
	
	НовСтр_Расход = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.Добавить();
	НовСтр_Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
	
	НовСтр_Расход.РасчетныйДокумент = СтрокаОстатков.РасчетныйДокумент;
	НовСтр_Расход.ДатаПлановогоПогашения = СтрокаОстатков.ДатаПлановогоПогашения;
	НовСтр_Расход.ДатаВозникновения = СтрокаОстатков.ДатаВозникновения;
	
	НовСтр_Расход.ДокументРегистратор = СтрокаРасчетовРегистратора.Регистратор;
	НовСтр_Расход.Период              = СтрокаРасчетовРегистратора.Период;
	НовСтр_Расход.ПорядокОперации     = СтрокаРасчетовРегистратора.ПорядокОперации;
	НовСтр_Расход.ПорядокЗачета       = СтрокаРасчетовРегистратора.ПорядокОперации;
	НовСтр_Расход.ИдентификаторФинЗаписи  = СтрокаРасчетовРегистратора.ИдентификаторРегистратора;
	НовСтр_Расход.ВалютаДокумента               = СтрокаРасчетовРегистратора.ВалютаДокумента;
	НовСтр_Расход.СтатьяДвиженияДенежныхСредств = СтрокаРасчетовРегистратора.СтатьяДвиженияДенежныхСредств;
	
	НовСтр_Расход.ХозяйственнаяОперация           = ТекущиеПеременные.ХозяйственныеОперации["ЗачетАванса"];
	НовСтр_Расход.НастройкаХозяйственнойОперации  = ТекущиеПеременные.НастройкиХО["ЗачетОплаты"];
	
	НовСтр_Расход[Ресурс]        = СуммаСписания;
	НовСтр_Расход[РесурсРегл]    = СуммаСписанияРегл;
	НовСтр_Расход[РесурсУпр]     = СуммаСписанияУпр;
	НовСтр_Расход[ПротивоположныйРесурс]        = 0;
	НовСтр_Расход[ПротивоположныйРесурсРегл]    = 0;
	НовСтр_Расход[ПротивоположныйРесурсУпр]     = 0;
	
	НовСтр_Расход.Сторно = Ложь;
	
	НовСтр_Расход.ЗаписьДоНачалаРасчета = Ложь;
	НовСтр_Расход.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаЗадолженности;
	
	НовСтр_Расход.КорАналитикаУчетаПоПартнерам = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
	НовСтр_Расход.КорОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
	НовСтр_Расход.АналитикаУчетаПоПартнерамПриемник = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
	НовСтр_Расход.ОбъектРасчетовПриемник = Справочники.ОбъектыРасчетов.ПустаяСсылка();
	НовСтр_Расход.ВалютаПриемник = Справочники.Валюты.ПустаяСсылка();
	НовСтр_Расход.СуммаПриемник = 0;
	НовСтр_Расход.ПоДаннымОбъектаРасчетовИсточника = Ложь;
	
	Если Ресурс = "Долг" Тогда
		ПереоценитьДолг(ГлобальныеПеременные, ТекущиеПеременные, СтрокаОстатков.РасчетныйДокумент, СтрокаРасчетовРегистратора.Период, Истина);
	КонецЕсли;
	
	Если ЭтоДолг Тогда
		СуммаПредоплатыРегл = СуммаПредоплатыРегл - СуммаСписанияРегл;
		СуммаПредоплатыУпр = СуммаПредоплатыУпр - СуммаСписанияУпр;
	Иначе
		СуммаПредоплатыРегл = СуммаПредоплатыРегл + СуммаСписанияРегл;
		СуммаПредоплатыУпр = СуммаПредоплатыУпр + СуммаСписанияУпр;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПочиночныеДвиженияПриНеобходимости(ГлобальныеПеременные, ТекущиеПеременные, СтрокаСторно)
	
	// Проверяем на минусовой остаток
	ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Свернуть("РасчетныйДокумент,ДатаПлановогоПогашения,ДатаПогашенияНеЗаполнена,ДатаВозникновения,ПорядокОперации,ДатаПереоценки, ПорядокЗачетаПоДатеПлатежа","Долг,ДолгРегл,ДолгУпр,Предоплата,ПредоплатаРегл,ПредоплатаУпр");
	Если ТекущиеПеременные.ЗачетОплатПоДатеПлатежа Тогда
		ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Сортировать("ПорядокЗачетаПоДатеПлатежа ВОЗР, ПорядокОперации ВОЗР");
	Иначе
		ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Сортировать("ПорядокОперации ВОЗР, ПорядокЗачетаПоДатеПлатежа ВОЗР");
	КонецЕсли;
	Для Каждого СтрокаКонтроля Из ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов Цикл
		Если СтрокаКонтроля.Долг < 0 Или СтрокаКонтроля.Предоплата < 0 Тогда
			ДобавитьПочиночноеДвижениеНаМинусовойОстаток(ГлобальныеПеременные, ТекущиеПеременные, СтрокаКонтроля, СтрокаСторно);
		КонецЕсли;
	КонецЦикла;
	
	// Проверяем на развернутое сальдо
	ИтогДолг = ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Итог("Долг");
	ИтогПредоплата = ТекущиеПеременные.ТаблицаОстатковВзаиморасчетов.Итог("Предоплата");
	Если ИтогДолг> 0 И ИтогПредоплата > 0 Тогда
		СуммаДляСворачивания = Мин(ИтогДолг, ИтогПредоплата);
		ДобавитьПочиночныеДвиженияНаРазвернутоеСальдо(ГлобальныеПеременные, ТекущиеПеременные, СуммаДляСворачивания, СтрокаСторно);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет все движения регистратора сторно - движения исходного документа с минусом.
// Вызывается при добавлении строк зачета, когда одна из строк - это движение сторно.
Процедура ДобавитьСторноЗаписи(ГлобальныеПеременные, ТекущиеПеременные, СтрокаРасчетов)
	
	Если НЕ СтрокаРасчетов.Сторно Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаИсходногоРегистратора = ТекущиеПеременные.ИсходныеРегистраторы.Найти(СтрокаРасчетов.Регистратор, "НовыйРегистратор");
	Если СтрокаИсходногоРегистратора <> Неопределено И НЕ СтрокаИсходногоРегистратора.Отсторнировано Тогда
	
		#Область РасчетыПоСрокам
		ДвиженияИсходногоДокумента = ТекущиеПеременные.ДвиженияИсходныхРегистраторов.Скопировать(Новый Структура("ДокументРегистратор", СтрокаРасчетов.СторнируемыйРегистратор));
		Если ДвиженияИсходногоДокумента.Количество() = 0 Тогда
			ДвиженияИсходногоДокумента = ТекущиеПеременные.ТаблицаРасчетовПоСрокам.НайтиСтроки(Новый Структура("ДокументРегистратор,ЗаписьДоНачалаРасчета,Сторно", СтрокаРасчетов.СторнируемыйРегистратор,Ложь,Ложь));
		КонецЕсли;
	
		Для Каждого ДвижениеИсходногоДокумента Из ДвиженияИсходногоДокумента Цикл
			Если ДвижениеИсходногоДокумента.Долг <> 0 И ДвижениеИсходногоДокумента.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				ПереоценитьДолг(ГлобальныеПеременные, ТекущиеПеременные, ДвижениеИсходногоДокумента.РасчетныйДокумент, СтрокаИсходногоРегистратора.НовыйПериод);
			КонецЕсли;
			ДобавитьМинусовоеДвижениеСторно(ТекущиеПеременные, СтрокаИсходногоРегистратора, ДвижениеИсходногоДокумента);
		КонецЦикла;
		#КонецОбласти
		
		СтрокаИсходногоРегистратора.Отсторнировано = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПереходНаОнлайнВзаиморасчеты

// Устарела
Процедура ЗаполнитьРегистрПереходаНаОнлайн()
	
	#Область ТекстЗапроса
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(РасчетыСКлиентами.ДатаДвижения) КАК ДатаДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСКлиентами.Валюта КАК Валюта,
	|	КОЛИЧЕСТВО(*) КАК КоличествоДокументов,
	|	МАКСИМУМ(РасчетыСКлиентами.Приоритет) КАК Приоритет
	|ИЗ 
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РасчетыСПартнерами.Период КАК ДатаДвижения,
	|		РасчетыСПартнерами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПартнерами.ЗаказКлиента КАК ОбъектРасчетов,
	|		РасчетыСПартнерами.Валюта КАК Валюта,
	|		ВЫБОР КОГДА ЕСТЬNULL(Расчеты.ПоДаннымОбъектаРасчетовИсточника,ЛОЖЬ)
	|			ТОГДА 2
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК Приоритет
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСПартнерами
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|				ПО Расчеты.Регистратор = РасчетыСПартнерами.Регистратор
	|					И Расчеты.АналитикаУчетаПоПартнерам = РасчетыСПартнерами.АналитикаУчетаПоПартнерам
	|					И Расчеты.ОбъектРасчетов = РасчетыСПартнерами.ЗаказКлиента
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РасчетыСПартнерами.Период КАК ДатаДвижения,
	|		РасчетыСПартнерами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПартнерами.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыСПартнерами.Валюта КАК Валюта,
	|		ВЫБОР КОГДА РасчетыСПартнерами.ПоДаннымОбъектаРасчетовИсточника
	|			ТОГДА 2
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК Приоритет
	|	ИЗ 
	|		РегистрНакопления.РасчетыСКлиентами КАК РасчетыСПартнерами
	|	ГДЕ
	|		НЕ ИСТИНА В (
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыПоДокументам
	|			ГДЕ
	|				РасчетыСПартнерами.АналитикаУчетаПоПартнерам = РасчетыПоДокументам.АналитикаУчетаПоПартнерам
	|				И РасчетыСПартнерами.ОбъектРасчетов = РасчетыПоДокументам.ЗаказКлиента
	|				И РасчетыСПартнерами.Валюта = РасчетыПоДокументам.Валюта
	|		)
	|
	|	) КАК РасчетыСКлиентами
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.ОбъектРасчетов,
	|	РасчетыСКлиентами.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(РасчетыСПоставщиками.ДатаДвижения) КАК ДатаДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщиками.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСПоставщиками.Валюта КАК Валюта,
	|	КОЛИЧЕСТВО(*) КАК КоличествоДокументов,
	|	МАКСИМУМ(РасчетыСПоставщиками.Приоритет) КАК Приоритет
	|ИЗ 
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РасчетыСПартнерами.Период КАК ДатаДвижения,
	|		РасчетыСПартнерами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПартнерами.ЗаказПоставщику КАК ОбъектРасчетов,
	|		РасчетыСПартнерами.Валюта КАК Валюта,
	|		ВЫБОР КОГДА ЕСТЬNULL(Расчеты.ПоДаннымОбъектаРасчетовИсточника,ЛОЖЬ)
	|			ТОГДА 2
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК Приоритет
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПартнерами
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|				ПО Расчеты.Регистратор = РасчетыСПартнерами.Регистратор
	|					И Расчеты.АналитикаУчетаПоПартнерам = РасчетыСПартнерами.АналитикаУчетаПоПартнерам
	|					И Расчеты.ОбъектРасчетов = РасчетыСПартнерами.ЗаказПоставщику
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РасчетыСПартнерами.Период КАК ДатаДвижения,
	|		РасчетыСПартнерами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПартнерами.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыСПартнерами.Валюта КАК Валюта,
	|		ВЫБОР КОГДА РасчетыСПартнерами.ПоДаннымОбъектаРасчетовИсточника
	|			ТОГДА 2
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК Приоритет
	|	ИЗ 
	|		РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПартнерами
	|	ГДЕ
	|		НЕ ИСТИНА В (
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыПоДокументам
	|			ГДЕ
	|				РасчетыСПартнерами.АналитикаУчетаПоПартнерам = РасчетыПоДокументам.АналитикаУчетаПоПартнерам
	|				И РасчетыСПартнерами.ОбъектРасчетов = РасчетыПоДокументам.ЗаказПоставщику
	|				И РасчетыСПартнерами.Валюта = РасчетыПоДокументам.Валюта
	|		)
	|
	|	) КАК РасчетыСПоставщиками
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщиками.ОбъектРасчетов,
	|	РасчетыСПоставщиками.Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоДокументов УБЫВ,
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов";
	#КонецОбласти
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Набор = РегистрыСведений.ЗаданияКРаспределениюРасчетов.СоздатьНаборЗаписей();
	Набор.Записать();
	НомерСтроки = 0;
	Пока Выборка.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
		Если НомерСтроки = 1000 Тогда
			Набор.Записать(Ложь);
			Набор.Очистить();
			НомерСтроки = 0;
		КонецЕсли;
		
	КонецЦикла;
	Набор.Записать(Ложь);
	ВсегоКПереносу = Выборка.Количество();
	
	ХранилищеОбщихНастроек.Сохранить("ПереходНаНовуюАрхитектуруВзаиморасчетов", "ВсегоКПереносу", ВсегоКПереносу);
	
	ВсегоЗаписей = НСтр("ru = 'Всего кортежей к переносу'")+": %1";
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрацииПриВключенииОнлайнРасчетов(),
		УровеньЖурналаРегистрации.Информация,,,СтрШаблон(ВсегоЗаписей, ВсегоКПереносу));
	
КонецПроцедуры

// Выполняет заполнение оперативных взаиморасчетов при включении опции Онлайн взаиморасчетов
// 
// Параметры:
//   Параметры - Структура - Необязательный.
//   АдресРезультата - Строка - Необязательный
//
// Возвращаемое значение:
//   Число - Количество обработанных записей
//
Функция ВыполнитьПереносОфлайнВзаиморасчетов(Параметры = Неопределено, АдресРезультата = Неопределено) Экспорт
	
	Если Параметры <> Неопределено И Параметры.Свойство("ДанныеКОбработке") Тогда
		ДанныеКОбработке = Параметры.ДанныеКОбработке;
	Иначе
		ПараметрыДанных = ВзаиморасчетыСлужебный.ПараметрыДанныхМногопоточнойОбработки();
		ДанныеКОбработке = ВзаиморасчетыСлужебный.ДанныеДляОбработки(ПараметрыДанных, Истина).Данные;
	КонецЕсли;
	
	ПорядокОбработки = СформироватьПорцииОбработкиДанныхРегистровВзаиморасчетов(ДанныеКОбработке, 1000);
	
	КоличествоОбработанныхЗаписей = 0;
	ПорядокОперации = Новый Соответствие;
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ХозяйственныеОперацииНеОтгрузка", ХозяйственныеОперацииНеОтгрузка());

	СписокТиповИсходящихПлатежей = Новый Массив;
	СписокТиповИсходящихПлатежей.Добавить(Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств"));
	СписокТиповИсходящихПлатежей.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	Запрос.УстановитьПараметр("СписокТиповИсходящихПлатежей", СписокТиповИсходящихПлатежей);
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(40);
	ДанныеКОбработке.Колонки.Добавить("ПорядокОперации", Новый ОписаниеТипов("Строка", , , , КвалификаторСтроки));

	Для ТекущийПорядокОбработки = 1 По ПорядокОбработки Цикл

		ПорцияДанныхКОбработке = ДанныеКОбработке.Скопировать(Новый Структура("ПорядокОбработки", ТекущийПорядокОбработки));
		
		КоличествоЗаписейКОбработке = ПорцияДанныхКОбработке.Количество();
		Если КоличествоЗаписейКОбработке = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоЗаписейКОбработкеКлиенты = ПорцияДанныхКОбработке.НайтиСтроки(Новый Структура("ТипРасчетов",
			Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом)).Количество();
			
		ЕстьЗаписиРасчетыСКлиентами = (КоличествоЗаписейКОбработкеКлиенты > 0);
		ЕстьЗаписиРасчетыСПоставщиками = (КоличествоЗаписейКОбработке - КоличествоЗаписейКОбработкеКлиенты > 0);

		НачатьТранзакцию();

		Попытка
			
			// 1. Перенесем РасчетыПоДокументам.
			Запрос.УстановитьПараметр("ДанныеКОбработке", ПорцияДанныхКОбработке);
			
			Если ЕстьЗаписиРасчетыСКлиентами Тогда
				Запрос.Текст = ТекстЗапросаРасчетыСКлиентамиПоДокументам();
				ТаблицаДетальныхЗаписейКлиенты = Запрос.Выполнить().Выгрузить();
				ТаблицаДетальныхЗаписейКлиенты.Индексы.Добавить("АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта");
			КонецЕсли;

			Если ЕстьЗаписиРасчетыСПоставщиками Тогда
				Запрос.Текст = ТекстЗапросаРасчетыСПоставщикамиПоДокументам();
				ТаблицаДетальныхЗаписейПоставщики = Запрос.Выполнить().Выгрузить();
				ТаблицаДетальныхЗаписейПоставщики.Индексы.Добавить("АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта");
			КонецЕсли;
			
			Для Каждого СтрокаКОбработке Из ПорцияДанныхКОбработке Цикл
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("АналитикаУчетаПоПартнерам", СтрокаКОбработке.АналитикаУчетаПоПартнерам);
				СтруктураОтбора.Вставить("ОбъектРасчетов", СтрокаКОбработке.ОбъектРасчетов);
				СтруктураОтбора.Вставить("Валюта", СтрокаКОбработке.Валюта);
				
				Если СтрокаКОбработке.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
					ТаблицаДетальныхЗаписей = ТаблицаДетальныхЗаписейКлиенты.Скопировать(СтруктураОтбора);
				Иначе
					ТаблицаДетальныхЗаписей = ТаблицаДетальныхЗаписейПоставщики.Скопировать(СтруктураОтбора);
				КонецЕсли;

				ЭтоРасчетыСКлиентами = (СтрокаКОбработке.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
				Если ТаблицаДетальныхЗаписей.Количество() > 0 Тогда
					ЗаписатьНовыеЗаписиРасчетовПоСрокам(ЭтоРасчетыСКлиентами, ТаблицаДетальныхЗаписей, ПорядокОперации);
					КоличествоОбработанныхЗаписей = КоличествоОбработанныхЗаписей + ТаблицаДетальныхЗаписей.Количество();
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаКОбработке.ДатаПересчета) Тогда
					СтрокаКОбработке.Период = НачалоДня(СтрокаКОбработке.ДатаПересчета);
				КонецЕсли;
				
			КонецЦикла;

			ПараметрыРаспределения = ПараметрыРаспределенияРасчетов();
			ПараметрыРаспределения.ДополнитьРаспределитьПриемники = Ложь;
			ПараметрыРаспределения.ТолькоПлановыеРасчеты = Истина;
			
			ЗаполнитьОперативныеВзаиморасчетыПоТаблице(ПараметрыРаспределения, ПорцияДанныхКОбработке);
			
			Для Каждого Запись Из ПорцияДанныхКОбработке Цикл

				ДопИзмеренияОтбора = "";
				Если Запись.ДатаПересчета = Дата('00010101') Тогда
					ДопИзмеренияОтбора = "ДатаПересчета";
				КонецЕсли;
				ОтметитьВыполнениеЗадания(Запись, ДопИзмеренияОтбора);

			КонецЦикла;

			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ИмяСобытия = ИмяСобытияЖурналаРегистрацииПриВключенииОнлайнРасчетов()
				+ " " + НСтр("ru = 'Работа потока.'",ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
	Если АдресРезультата <> Неопределено Тогда
		Результат = Новый Структура("КоличествоОбработанныхЗаписей", КоличествоОбработанныхЗаписей);
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
	Возврат КоличествоОбработанныхЗаписей;
	
КонецФункции

Процедура ЗаписатьНовыеЗаписиРасчетовПоСрокам(ЭтоРасчетыСКлиентами, ТаблицаДетальныхЗаписей, ПорядокОперации)
	
	Если ЭтоРасчетыСКлиентами Тогда
		НаборЗаписей = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
	Иначе
		НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
	КонецЕсли;
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	ТаблицаДетальныхЗаписей.Колонки.Добавить("Сторно", Новый ОписаниеТипов("Булево"));
	ТаблицаДетальныхЗаписей.Колонки.Добавить("ТипЗаписиВзаиморасчетов", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗаписейВзаиморасчетов"));
	ТаблицаДетальныхЗаписей.Колонки.Добавить("Регистратор", Новый ОписаниеТипов("ДокументСсылка.РегистраторРасчетов"));
	ТаблицаДетальныхЗаписей.Индексы.Добавить("Регистратор");
	
	МассивСторно = Новый Массив;
	Для Каждого СтрокаДвижений Из ТаблицаДетальныхЗаписей Цикл
		Если ТипЗнч(СтрокаДвижений.ДокументРегистратор) = Тип("ДокументСсылка.Сторно") Тогда
			МассивСторно.Добавить(СтрокаДвижений.ДокументРегистратор);
		КонецЕсли;
	КонецЦикла;
	СоответствиеСторнируемыхДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСторно, "СторнируемыйДокумент");
	Для Каждого СтрокаДвижений Из ТаблицаДетальныхЗаписей Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаДвижений.ПорядокОперации) Тогда
			Если ПорядокОперации.Получить(СтрокаДвижений.Период) = Неопределено Тогда
				ПорядокОперации.Вставить(СтрокаДвижений.Период, Порядок(СтрокаДвижений.Период, "", Тип("ДокументСсылка.РасчетКурсовыхРазниц"),"9","99"));
			КонецЕсли;
			СтрокаДвижений.ПорядокОперации = ПорядокОперации[СтрокаДвижений.Период];
		КонецЕсли;
		ТипРегистратора = ТипЗнч(СтрокаДвижений.ДокументРегистратор);
		Если ТипРегистратора = Тип("ДокументСсылка.Сторно")
			И СоответствиеСторнируемыхДокументов[СтрокаДвижений.ДокументРегистратор] <> Неопределено Тогда
			ТипРегистратора = ТипЗнч(СоответствиеСторнируемыхДокументов[СтрокаДвижений.ДокументРегистратор]);
		КонецЕсли;
		ЗаполнитьТипЗаписиВзаиморасчетов(СтрокаДвижений, ТипРегистратора);
	КонецЦикла;
	
	ТаблицаАналитик = ТаблицаДетальныхЗаписей.Скопировать();
	ТаблицаАналитик.Свернуть("АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, Организация");
	Отбор = ТаблицаАналитик[0];
	
	СтруктураПараметровРегистраторов = Новый Структура;
	СтруктураПараметровРегистраторов.Вставить("ОбъектРасчетов",            Отбор.ОбъектРасчетов);
	СтруктураПараметровРегистраторов.Вставить("АналитикаУчетаПоПартнерам", Отбор.АналитикаУчетаПоПартнерам);
	СтруктураПараметровРегистраторов.Вставить("Валюта",                    Отбор.Валюта);
	СтруктураПараметровРегистраторов.Вставить("Организация",               Отбор.Организация);
	СтруктураПараметровРегистраторов.Вставить("ЭтоРасчетыСКлиентами",      ЭтоРасчетыСКлиентами);
	
	ТаблицаРегистраторов = ТаблицаСвободныхРегистраторовРасчета(СтруктураПараметровРегистраторов, Новый Структура);
	ПодготовитьДанныеДляЗаписи(СтруктураПараметровРегистраторов, ТаблицаДетальныхЗаписей, НаборЗаписей, ТаблицаРегистраторов);
	ЗаписатьПорционно(СтруктураПараметровРегистраторов, ТаблицаДетальныхЗаписей, НаборЗаписей);

КонецПроцедуры

Функция ТекстЗапросаРасчетыСКлиентамиПоДокументам()
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеПараметрыРасчета.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОсновныеПараметрыРасчета.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОсновныеПараметрыРасчета.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВтОсновныеПараметрыРасчета
	|ИЗ
	|	&ДанныеКОбработке КАК ОсновныеПараметрыРасчета
	|ГДЕ
	|	ОсновныеПараметрыРасчета.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОсновныеПараметрыРасчета КАК ОсновныеПараметрыРасчета
	|			ПО Расчеты.АналитикаУчетаПоПартнерам = ОсновныеПараметрыРасчета.АналитикаУчетаПоПартнерам
	|				И Расчеты.ЗаказКлиента = ОсновныеПараметрыРасчета.ОбъектРасчетов
	|				И Расчеты.Валюта = ОсновныеПараметрыРасчета.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР КОГДА РасчетыСКлиентами.РасчетныйДокумент <> Неопределено 
	|		ТОГДА РасчетыСКлиентами.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСКлиентами.Регистратор 
	|	КОНЕЦ                                      КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(РасчетыСКлиентами.Период,ДЕНЬ) КАК Дата,
	|	МИНИМУМ(РасчетыСКлиентами.ПорядокОперации) КАК ПорядокОперации,
	|	МИНИМУМ(РасчетыСКлиентами.ПорядокЗачетаПоДатеПлатежа) КАК ПорядокЗачетаПоДатеПлатежа,
	|	МИНИМУМ(ВЫБОР КОГДА РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ВводОстатков
	|					ИЛИ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов
	|						ТОГДА РасчетыСКлиентами.ДатаРегистратора
	|				ИНАЧЕ РасчетыСКлиентами.Период
	|			КОНЕЦ)                             КАК ДатаВозникновения,
	|	МИНИМУМ(РасчетыСКлиентами.ВалютаДокумента) КАК ВалютаДокумента,
	|	МАКСИМУМ(РасчетыСКлиентами.ДатаПлатежа)    КАК ДатаПлатежа
	|ПОМЕСТИТЬ ПорядокДокументов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|			ПО Регистраторы.Регистратор = РасчетыСКлиентами.Регистратор
	|ГДЕ
	|	РасчетыСКлиентами.Активность
	|	И НЕ РасчетыСКлиентами.ПорядокОперации = """"
	|	И РасчетыСКлиентами.Сумма <> 0
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА РасчетыСКлиентами.РасчетныйДокумент <> Неопределено 
	|		ТОГДА РасчетыСКлиентами.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСКлиентами.Регистратор 
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(РасчетыСКлиентами.Период,ДЕНЬ)
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР КОГДА РасчетыСКлиентами.РасчетныйДокумент <> Неопределено 
	|		ТОГДА РасчетыСКлиентами.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСКлиентами.Регистратор 
	|	КОНЕЦ                                      КАК Регистратор,
	|	МИНИМУМ(РасчетыСКлиентами.ПорядокОперации) КАК ПорядокОперации,
	|	МИНИМУМ(РасчетыСКлиентами.ПорядокЗачетаПоДатеПлатежа) КАК ПорядокЗачетаПоДатеПлатежа,
	|	МИНИМУМ(ВЫБОР КОГДА РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ВводОстатков
	|					ИЛИ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов
	|						ТОГДА РасчетыСКлиентами.ДатаРегистратора
	|				ИНАЧЕ РасчетыСКлиентами.Период
	|			КОНЕЦ)                             КАК ДатаВозникновения,
	|	МИНИМУМ(РасчетыСКлиентами.ВалютаДокумента) КАК ВалютаДокумента,
	|	МАКСИМУМ(РасчетыСКлиентами.ДатаПлатежа)    КАК ДатаПлатежа
	|ПОМЕСТИТЬ ДатыВозникновения
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|			ПО Регистраторы.Регистратор = РасчетыСКлиентами.Регистратор
	|ГДЕ
	|	РасчетыСКлиентами.Активность
	|	И НЕ РасчетыСКлиентами.ПорядокОперации = """"
	|	И РасчетыСКлиентами.Сумма <> 0
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА РасчетыСКлиентами.РасчетныйДокумент <> Неопределено 
	|		ТОГДА РасчетыСКлиентами.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСКлиентами.Регистратор 
	|	КОНЕЦ
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПоДокументам.ЗаказКлиента                          КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиПоДокументам.ЗаказКлиента.ТипОбъектаРасчетов       КАК ТипОбъектаРасчетов,
	|	РасчетыСКлиентамиПоДокументам.Валюта                                КАК Валюта,
	|	РасчетыСКлиентамиПоДокументам.Регистратор                           КАК ДокументРегистратор,
	|	РасчетыСКлиентамиПоДокументам.Период                                КАК Период,
	|	РасчетыСКлиентамиПоДокументам.РасчетныйДокумент                     КАК РасчетныйДокумент,
	|	РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация                 КАК ХозяйственнаяОперация,
	|	РасчетыСКлиентамиПоДокументам.СтатьяДвиженияДенежныхСредств         КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И (РасчетыСКлиентамиПоДокументам.Долг > 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр > 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.Предоплата < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр < 0)
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И (РасчетыСКлиентамиПоДокументам.Предоплата > 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр > 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.Долг < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл < 0 
	|			ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр < 0) ТОГДА
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                                                               КАК ВидДвижения,
	|	ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.РасчетныйДокумент КАК Документ.КорректировкаРеализации).ДокументОснование КАК СвязанныйДокумент,
	|
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Предоплата < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.Предоплата 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.Предоплата
	|	КОНЕЦ                                                               КАК Предоплата,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаУпр < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаУпр 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаУпр
	|	КОНЕЦ                                                               КАК ПредоплатаУпр,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|	КОНЕЦ                                                               КАК ПредоплатаРегл,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Долг < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.Долг 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.Долг
	|	КОНЕЦ                                                               КАК Долг,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ДолгУпр < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ДолгУпр 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ДолгУпр
	|	КОНЕЦ                                                               КАК ДолгУпр,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ДолгРегл 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ДолгРегл
	|	КОНЕЦ                                                               КАК ДолгРегл,
	|
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Предоплата <> 0 ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА (ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И (РасчетыСКлиентамиПоДокументам.Долг > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Предоплата < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр < 0)
	|			ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И (РасчетыСКлиентамиПоДокументам.Предоплата > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Долг < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл < 0 
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр < 0))
	|			И НЕ ((РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков ИЛИ
	|					РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов) И 
	|					РасчетыСКлиентамиПоДокументам.РасчетныйДокумент <> Неопределено)
	|			И НЕ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.РасчетКурсовыхРазниц ТОГДА
	|			ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|	КОНЕЦ                                                               КАК ДатаПлановогоПогашения,
	|	ЕСТЬNULL(ДатыВозникновения.ДатаВозникновения,ДАТАВРЕМЯ(1,1,1))      КАК ДатаВозникновения,
	|	ЕСТЬNULL(ПорядокДокументов.ПорядокОперации,"""")                    КАК ПорядокОперации,
	|	ЕСТЬNULL(ДатыВозникновения.ПорядокЗачетаПоДатеПлатежа,"""")         КАК ПорядокЗачетаРегистратора,
	|	ЕСТЬNULL(ДатыВозникновения.ПорядокЗачетаПоДатеПлатежа,"""")         КАК ПорядокЗачета,
	|	ЕСТЬNULL(ДатыВозникновения.ВалютаДокумента,
	|		ЕСТЬNULL(ДатыВозникновения.ВалютаДокумента,
	|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))                  КАК ВалютаДокумента
	|ПОМЕСТИТЬ ВтРасчеты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОсновныеПараметрыРасчета КАК ОсновныеПараметрыРасчета
	|			ПО РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам = ОсновныеПараметрыРасчета.АналитикаУчетаПоПартнерам
	|				И РасчетыСКлиентамиПоДокументам.ЗаказКлиента = ОсновныеПараметрыРасчета.ОбъектРасчетов
	|				И РасчетыСКлиентамиПоДокументам.Валюта = ОсновныеПараметрыРасчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ПорядокДокументов
	|			ПО РасчетыСКлиентамиПоДокументам.Регистратор = ПорядокДокументов.Регистратор
	|				И НАЧАЛОПЕРИОДА(РасчетыСКлиентамиПоДокументам.Период) = ПорядокДокументов.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыВозникновения КАК ДатыВозникновения
	|			ПО РасчетыСКлиентамиПоДокументам.РасчетныйДокумент = ДатыВозникновения.Регистратор
	|ГДЕ
	|	(РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков
	|		ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов)
	|	И РасчетыСКлиентамиПоДокументам.Регистратор <> РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
	|	И (РасчетыСКлиентамиПоДокументам.Предоплата <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.Долг <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр <> 0)
	|	И РасчетыСКлиентамиПоДокументам.Активность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПоДокументам.ЗаказКлиента                          КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиПоДокументам.ЗаказКлиента.ТипОбъектаРасчетов       КАК ТипОбъектаРасчетов,
	|	РасчетыСКлиентамиПоДокументам.Валюта                                КАК Валюта,
	|	РасчетыСКлиентамиПоДокументам.Регистратор                           КАК ДокументРегистратор,
	|	РасчетыСКлиентамиПоДокументам.Период                                КАК Период,
	|	РасчетыСКлиентамиПоДокументам.РасчетныйДокумент                     КАК РасчетныйДокумент,
	|	РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация                 КАК ХозяйственнаяОперация,
	|	РасчетыСКлиентамиПоДокументам.СтатьяДвиженияДенежныхСредств         КАК СтатьяДвиженияДенежныхСредств,
	|ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|			И (РасчетыСКлиентамиПоДокументам.Долг > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Предоплата < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр < 0
	|				ИЛИ (ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиПоДокументам.Регистратор) В (&СписокТиповИсходящихПлатежей) 
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоПлатежнойКарте).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//++ Локализация
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоЯндексКассе).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//-- Локализация
	|					)
	|						И РасчетыСКлиентамиПоДокументам.Предоплата > 0)
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И НЕ ((ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиПоДокументам.Регистратор) В (&СписокТиповИсходящихПлатежей)
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоПлатежнойКарте).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//++ Локализация
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоЯндексКассе).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//-- Локализация
	|			)
	|				И РасчетыСКлиентамиПоДокументам.Предоплата > 0)
	|			И (РасчетыСКлиентамиПоДокументам.Предоплата > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Долг < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл < 0 
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр < 0) ТОГДА
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                                                               КАК ВидДвижения,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРеализации 
	|		ТОГДА ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.КорректировкаРеализации).ДокументОснование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.РасчетныйДокумент КАК Документ.КорректировкаРеализации).ДокументОснование
	|	КОНЕЦ КАК СвязанныйДокумент,
	|
	|	ВЫБОР КОГДА (ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиПоДокументам.Регистратор) В (&СписокТиповИсходящихПлатежей)
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоПлатежнойКарте).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//++ Локализация
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоЯндексКассе).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//-- Локализация
	|				)
	|		И РасчетыСКлиентамиПоДокументам.Предоплата > 0 
	|			ТОГДА 0
	|		КОГДА РасчетыСКлиентамиПоДокументам.Предоплата < 0 ТОГДА
	|			-РасчетыСКлиентамиПоДокументам.Предоплата 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.Предоплата
	|	КОНЕЦ                                                               КАК Предоплата,
	|	ВЫБОР КОГДА (ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиПоДокументам.Регистратор) В (&СписокТиповИсходящихПлатежей)
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоПлатежнойКарте).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//++ Локализация
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоЯндексКассе).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//-- Локализация
	|				)
	|		И РасчетыСКлиентамиПоДокументам.Предоплата > 0 
	|			ТОГДА 0
	|		КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаУпр < 0 ТОГДА
	|			-РасчетыСКлиентамиПоДокументам.ПредоплатаУпр 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаУпр
	|	КОНЕЦ                                                               КАК ПредоплатаУпр,
	|	ВЫБОР КОГДА (ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиПоДокументам.Регистратор) В (&СписокТиповИсходящихПлатежей)
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоПлатежнойКарте).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//++ Локализация
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоЯндексКассе).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//-- Локализация
	|				)
	|		И РасчетыСКлиентамиПоДокументам.Предоплата > 0 
	|			ТОГДА 0
	|		КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0 ТОГДА
	|			-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|	КОНЕЦ                                                               КАК ПредоплатаРегл,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Долг < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.Долг 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.Долг
	|		+ ВЫБОР КОГДА (ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиПоДокументам.Регистратор) В (&СписокТиповИсходящихПлатежей)
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоПлатежнойКарте).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//++ Локализация
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоЯндексКассе).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//-- Локализация
	|					)
	|			И РасчетыСКлиентамиПоДокументам.Предоплата > 0
	|				ТОГДА РасчетыСКлиентамиПоДокументам.Предоплата
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ                                                               КАК Долг,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ДолгУпр < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ДолгУпр 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ДолгУпр
	|		+ ВЫБОР КОГДА (ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиПоДокументам.Регистратор) В (&СписокТиповИсходящихПлатежей)
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоПлатежнойКарте).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//++ Локализация
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоЯндексКассе).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//-- Локализация
	|						)
	|			И РасчетыСКлиентамиПоДокументам.ПредоплатаУпр > 0
	|				ТОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ                                                               КАК ДолгУпр,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ДолгРегл 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ДолгРегл
	|		+ ВЫБОР КОГДА (ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиПоДокументам.Регистратор) В (&СписокТиповИсходящихПлатежей)
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоПлатежнойКарте).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//++ Локализация
	|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.ОперацияПоЯндексКассе).ХозяйственнаяОперация,Неопределено) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	//-- Локализация
	|						)
	|			И РасчетыСКлиентамиПоДокументам.ПредоплатаРегл > 0
	|				ТОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ                                                               КАК ДолгРегл,
	|
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Предоплата <> 0 ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА (ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И (РасчетыСКлиентамиПоДокументам.Долг > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр > 0)
	|			ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И (РасчетыСКлиентамиПоДокументам.Предоплата > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр > 0))
	|			И НЕ ((РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков ИЛИ
	|					РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов) И
	|					РасчетыСКлиентамиПоДокументам.РасчетныйДокумент <> Неопределено)
	|			И НЕ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.РасчетКурсовыхРазниц ТОГДА
	|			ВЫБОР
	|				КОГДА ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1)
	|					ТОГДА ЕСТЬNULL(ПорядокДокументов.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|				ИНАЧЕ ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|	КОНЕЦ                                                               КАК ДатаПлановогоПогашения,
	|	ЕСТЬNULL(ДатыВозникновения.ДатаВозникновения,ДАТАВРЕМЯ(1,1,1))      КАК ДатаВозникновения,
	|	ЕСТЬNULL(ПорядокДокументов.ПорядокОперации,"""")                    КАК ПорядокОперации,
	|	ЕСТЬNULL(ПорядокДокументов.ПорядокЗачетаПоДатеПлатежа,"""")         КАК ПорядокЗачетаРегистратора,
	|	ЕСТЬNULL(ДатыВозникновения.ПорядокЗачетаПоДатеПлатежа,"""")         КАК ПорядокЗачета,
	|	ЕСТЬNULL(ДатыВозникновения.ВалютаДокумента,
	|		ЕСТЬNULL(ПорядокДокументов.ВалютаДокумента,
	|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))                  КАК ВалютаДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОсновныеПараметрыРасчета КАК ОсновныеПараметрыРасчета
	|			ПО РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам = ОсновныеПараметрыРасчета.АналитикаУчетаПоПартнерам
	|				И РасчетыСКлиентамиПоДокументам.ЗаказКлиента = ОсновныеПараметрыРасчета.ОбъектРасчетов
	|				И РасчетыСКлиентамиПоДокументам.Валюта = ОсновныеПараметрыРасчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ПорядокДокументов
	|			ПО РасчетыСКлиентамиПоДокументам.Регистратор = ПорядокДокументов.Регистратор
	|				И НАЧАЛОПЕРИОДА(РасчетыСКлиентамиПоДокументам.Период) = ПорядокДокументов.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыВозникновения КАК ДатыВозникновения
	|			ПО РасчетыСКлиентамиПоДокументам.РасчетныйДокумент = ДатыВозникновения.Регистратор
	|ГДЕ
	|	(НЕ (РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков
	|		ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов)
	|	ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор = РасчетыСКлиентамиПоДокументам.РасчетныйДокумент)
	|	И (РасчетыСКлиентамиПоДокументам.Предоплата <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.Долг <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр <> 0)
	|	И РасчетыСКлиентамиПоДокументам.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов                КАК ОбъектРасчетов,
	|	Расчеты.Валюта                        КАК Валюта,
	|	Расчеты.ДокументРегистратор           КАК ДокументРегистратор,
	|	Расчеты.РасчетныйДокумент             КАК РасчетныйДокумент,
	|	Расчеты.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	Расчеты.Период                        КАК Период,
	|	Расчеты.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
	|	Расчеты.ДатаВозникновения             КАК ДатаВозникновения,
	|	Расчеты.ВидДвижения                   КАК ВидДвижения,
	|	СУММА(Расчеты.Предоплата)             КАК Предоплата,
	|	СУММА(Расчеты.ПредоплатаУпр)          КАК ПредоплатаУпр,
	|	СУММА(Расчеты.ПредоплатаРегл)         КАК ПредоплатаРегл,
	|	СУММА(Расчеты.Долг)                   КАК Долг,
	|	СУММА(Расчеты.ДолгУпр)                КАК ДолгУпр,
	|	СУММА(Расчеты.ДолгРегл)               КАК ДолгРегл,
	|	Расчеты.СвязанныйДокумент             КАК СвязанныйДокумент,
	|	Расчеты.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	Расчеты.ПорядокОперации               КАК ПорядокОперации,
	|	Расчеты.ПорядокЗачета                 КАК ПорядокЗачета,
	|	Расчеты.ВалютаДокумента               КАК ВалютаДокумента,
	|	Расчеты.Организация                   КАК Организация
	|ИЗ (
	|	ВЫБРАТЬ
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам                            КАК АналитикаУчетаПоПартнерам,
	|		ЗачетыОплат.ОбъектРасчетов                                       КАК ОбъектРасчетов,
	|		ЗачетыОплат.Валюта                                               КАК Валюта,
	|		ЗачетыОплат.ДокументРегистратор                                  КАК ДокументРегистратор,
	|		ЗачетыОплат.ДокументРегистратор                                  КАК РасчетныйДокумент,
	|		ЗачетыОплат.ХозяйственнаяОперация                                КАК ХозяйственнаяОперация,
	|		ЗачетыОплат.Период                                               КАК Период,
	|		ДатыВозникновения.ДатаПлатежа                                    КАК ДатаПлановогоПогашения,
	|		ЗачетыОплат.Период                                               КАК ДатаВозникновения,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                           КАК ВидДвижения,
	|		0                                                                КАК Предоплата,
	|		0                                                                КАК ПредоплатаУпр,
	|		0                                                                КАК ПредоплатаРегл,
	|		ЗачетыОплат.Предоплата                                           КАК Долг,
	|		ЗачетыОплат.ПредоплатаУпр                                        КАК ДолгУпр,
	|		ЗачетыОплат.ПредоплатаРегл                                       КАК ДолгРегл,
	|		Неопределено                                                     КАК СвязанныйДокумент,
	|		ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)  КАК СтатьяДвиженияДенежныхСредств,
	|		ЗачетыОплат.ПорядокОперации                                      КАК ПорядокОперации,
	|		ЗачетыОплат.ПорядокЗачетаРегистратора                            КАК ПорядокЗачета,
	|		ЗачетыОплат.ВалютаДокумента                                      КАК ВалютаДокумента,
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам.Организация                КАК Организация
	|	ИЗ ВтРасчеты КАК ЗачетыОплат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыВозникновения КАК ДатыВозникновения
	|			ПО ЗачетыОплат.ДокументРегистратор = ДатыВозникновения.Регистратор
	|	ГДЕ	ЗачетыОплат.Предоплата > 0 
	|		И ЗачетыОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ЗачетыОплат.ХозяйственнаяОперация НЕ В (&ХозяйственныеОперацииНеОтгрузка)
	|		И ЗачетыОплат.ТипОбъектаРасчетов <> ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.ПлатежВозврат)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам                            КАК АналитикаУчетаПоПартнерам,
	|		ЗачетыОплат.ОбъектРасчетов                                       КАК ОбъектРасчетов,
	|		ЗачетыОплат.Валюта                                               КАК Валюта,
	|		ЗачетыОплат.ДокументРегистратор                                  КАК ДокументРегистратор,
	|		ЗачетыОплат.ДокументРегистратор                                  КАК РасчетныйДокумент,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента)  КАК ХозяйственнаяОперация,
	|		ЗачетыОплат.Период                                               КАК Период,
	|		ДатыВозникновения.ДатаПлатежа                                    КАК ДатаПлановогоПогашения,
	|		ЗачетыОплат.Период                                               КАК ДатаВозникновения,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                           КАК ВидДвижения,
	|		0                                                                КАК Предоплата,
	|		0                                                                КАК ПредоплатаУпр,
	|		0                                                                КАК ПредоплатаРегл,
	|		ЗачетыОплат.Предоплата                                           КАК Долг,
	|		ЗачетыОплат.ПредоплатаУпр                                        КАК ДолгУпр,
	|		ЗачетыОплат.ПредоплатаРегл                                       КАК ДолгРегл,
	|		Неопределено                                                     КАК СвязанныйДокумент,
	|		ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)  КАК СтатьяДвиженияДенежныхСредств,
	|		ЗачетыОплат.ПорядокОперации                                      КАК ПорядокОперации,
	|		ЗачетыОплат.ПорядокЗачетаРегистратора                            КАК ПорядокЗачета,
	|		ЗачетыОплат.ВалютаДокумента                                      КАК ВалютаДокумента,
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам.Организация                КАК Организация
	|	ИЗ ВтРасчеты КАК ЗачетыОплат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыВозникновения КАК ДатыВозникновения
	|			ПО ЗачетыОплат.ДокументРегистратор = ДатыВозникновения.Регистратор
	|	ГДЕ
	|		ЗачетыОплат.Предоплата > 0 
	|		И ЗачетыОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ЗачетыОплат.ХозяйственнаяОперация НЕ В (&ХозяйственныеОперацииНеОтгрузка)
	|		И ЗачетыОплат.ТипОбъектаРасчетов <> ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.ПлатежВозврат)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоДокументам.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоДокументам.ОбъектРасчетов                КАК ОбъектРасчетов,
	|		РасчетыПоДокументам.Валюта                        КАК Валюта,
	|		РасчетыПоДокументам.ДокументРегистратор           КАК ДокументРегистратор,
	|		РасчетыПоДокументам.РасчетныйДокумент             КАК РасчетныйДокумент,
	|		ВЫБОР КОГДА РасчетыПоДокументам.Предоплата <> 0 И РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация НЕ В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса))
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента)
	|			КОГДА РасчетыПоДокументам.Долг <> 0 И РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаЗадолженности)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.УдержаниеВознагражденияКомиссионера)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента)
	|			ИНАЧЕ РасчетыПоДокументам.ХозяйственнаяОперация 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		РасчетыПоДокументам.Период                        КАК Период,
	|		РасчетыПоДокументам.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
	|		РасчетыПоДокументам.ДатаВозникновения             КАК ДатаВозникновения,
	|		РасчетыПоДокументам.ВидДвижения                   КАК ВидДвижения,
	|		РасчетыПоДокументам.Предоплата                    КАК Предоплата,
	|		РасчетыПоДокументам.ПредоплатаУпр                 КАК ПредоплатаУпр,
	|		РасчетыПоДокументам.ПредоплатаРегл                КАК ПредоплатаРегл,
	|		РасчетыПоДокументам.Долг                          КАК Долг,
	|		РасчетыПоДокументам.ДолгУпр                       КАК ДолгУпр,
	|		РасчетыПоДокументам.ДолгРегл                      КАК ДолгРегл,
	|		ВЫБОР КОГДА (РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И РасчетыПоДокументам.Предоплата > 0)
	|			ИЛИ (РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И РасчетыПоДокументам.Долг > 0)
	|			ТОГДА РасчетыПоДокументам.СвязанныйДокумент
	|			ИНАЧЕ Неопределено
	|		КОНЕЦ                                             КАК СвязанныйДокумент,
	|		РасчетыПоДокументам.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		РасчетыПоДокументам.ПорядокОперации               КАК ПорядокОперации,
	|		РасчетыПоДокументам.ПорядокЗачета                 КАК ПорядокЗачета,
	|		РасчетыПоДокументам.ВалютаДокумента               КАК ВалютаДокумента,
	|		РасчетыПоДокументам.АналитикаУчетаПоПартнерам.Организация КАК Организация
	|	ИЗ ВтРасчеты КАК РасчетыПоДокументам) КАК Расчеты
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.ДокументРегистратор,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.ХозяйственнаяОперация,
	|	Расчеты.Период,
	|	Расчеты.ДатаПлановогоПогашения,
	|	Расчеты.ДатаВозникновения,
	|	Расчеты.ВидДвижения,
	|	Расчеты.СвязанныйДокумент,
	|	Расчеты.СтатьяДвиженияДенежныхСредств,
	|	Расчеты.ПорядокОперации,
	|	Расчеты.ПорядокЗачета,
	|	Расчеты.ВалютаДокумента,
	|	Расчеты.Организация
	|;
	|УНИЧТОЖИТЬ ВтОсновныеПараметрыРасчета;
	|УНИЧТОЖИТЬ ВтРегистраторы;
	|УНИЧТОЖИТЬ ПорядокДокументов;
	|УНИЧТОЖИТЬ ДатыВозникновения;
	|УНИЧТОЖИТЬ ВтРасчеты
	|";
	
КонецФункции

Функция ТекстЗапросаРасчетыСПоставщикамиПоДокументам()
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеПараметрыРасчета.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОсновныеПараметрыРасчета.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОсновныеПараметрыРасчета.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВтОсновныеПараметрыРасчета
	|ИЗ
	|	&ДанныеКОбработке КАК ОсновныеПараметрыРасчета
	|ГДЕ
	|	ОсновныеПараметрыРасчета.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОсновныеПараметрыРасчета КАК ОсновныеПараметрыРасчета
	|			ПО Расчеты.АналитикаУчетаПоПартнерам = ОсновныеПараметрыРасчета.АналитикаУчетаПоПартнерам
	|				И Расчеты.ЗаказПоставщику = ОсновныеПараметрыРасчета.ОбъектРасчетов
	|				И Расчеты.Валюта = ОсновныеПараметрыРасчета.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР КОГДА РасчетыСПоставщиками.РасчетныйДокумент <> Неопределено 
	|		ТОГДА РасчетыСПоставщиками.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСПоставщиками.Регистратор 
	|	КОНЕЦ                                         КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(РасчетыСПоставщиками.Период,ДЕНЬ) КАК Дата,
	|	МИНИМУМ(РасчетыСПоставщиками.ПорядокОперации) КАК ПорядокОперации,
	|	МИНИМУМ(РасчетыСПоставщиками.ПорядокЗачетаПоДатеПлатежа) КАК ПорядокЗачетаПоДатеПлатежа,
	|	МИНИМУМ(ВЫБОР КОГДА РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ВводОстатков ИЛИ
	|					РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов
	|						ТОГДА РасчетыСПоставщиками.ДатаРегистратора
	|				ИНАЧЕ РасчетыСПоставщиками.Период
	|			КОНЕЦ)                                КАК ДатаВозникновения,
	|	МИНИМУМ(РасчетыСПоставщиками.ВалютаДокумента) КАК ВалютаДокумента,
	|	МАКСИМУМ(РасчетыСПоставщиками.ДатаПлатежа)    КАК ДатаПлатежа
	|ПОМЕСТИТЬ ПорядокДокументов
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|			ПО Регистраторы.Регистратор = РасчетыСПоставщиками.Регистратор
	|ГДЕ
	|	РасчетыСПоставщиками.Активность
	|	И НЕ РасчетыСПоставщиками.ПорядокОперации = """"
	|	И (РасчетыСПоставщиками.Сумма <> 0 ИЛИ РасчетыСПоставщиками.КОплате <> 0)
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА РасчетыСПоставщиками.РасчетныйДокумент <> Неопределено 
	|		ТОГДА РасчетыСПоставщиками.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСПоставщиками.Регистратор 
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(РасчетыСПоставщиками.Период,ДЕНЬ)
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР КОГДА РасчетыСПоставщиками.РасчетныйДокумент <> Неопределено 
	|		ТОГДА РасчетыСПоставщиками.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСПоставщиками.Регистратор 
	|	КОНЕЦ                                         КАК Регистратор,
	|	МИНИМУМ(РасчетыСПоставщиками.ПорядокОперации) КАК ПорядокОперации,
	|	МИНИМУМ(РасчетыСПоставщиками.ПорядокЗачетаПоДатеПлатежа) КАК ПорядокЗачетаПоДатеПлатежа,
	|	МИНИМУМ(ВЫБОР КОГДА РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ВводОстатков ИЛИ
	|					РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов
	|						ТОГДА РасчетыСПоставщиками.ДатаРегистратора
	|				ИНАЧЕ РасчетыСПоставщиками.Период
	|			КОНЕЦ)                                КАК ДатаВозникновения,
	|	МИНИМУМ(РасчетыСПоставщиками.ВалютаДокумента) КАК ВалютаДокумента,
	|	МАКСИМУМ(РасчетыСПоставщиками.ДатаПлатежа)    КАК ДатаПлатежа
	|ПОМЕСТИТЬ ДатыВозникновения
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|			ПО Регистраторы.Регистратор = РасчетыСПоставщиками.Регистратор
	|ГДЕ
	|	РасчетыСПоставщиками.Активность
	|	И НЕ РасчетыСПоставщиками.ПорядокОперации = """"
	|	И (РасчетыСПоставщиками.Сумма <> 0 ИЛИ РасчетыСПоставщиками.КОплате <> 0)
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА РасчетыСПоставщиками.РасчетныйДокумент <> Неопределено 
	|		ТОГДА РасчетыСПоставщиками.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСПоставщиками.Регистратор 
	|	КОНЕЦ
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам      КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику                КАК ОбъектРасчетов,
	|	РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику.ТипОбъектаРасчетов КАК ТипОбъектаРасчетов,
	|	РасчетыСПоставщикамиПоДокументам.Валюта                         КАК Валюта,
	|	РасчетыСПоставщикамиПоДокументам.Регистратор                    КАК ДокументРегистратор,
	|	РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент              КАК РасчетныйДокумент,
	|	РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация          КАК ХозяйственнаяОперация,
	|	РасчетыСПоставщикамиПоДокументам.СтатьяДвиженияДенежныхСредств  КАК СтатьяДвиженияДенежныхСредств,
	|	РасчетыСПоставщикамиПоДокументам.Период                         КАК Период,
	|	ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И (РасчетыСПоставщикамиПоДокументам.Долг < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Предоплата > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл > 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр > 0)
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И (РасчетыСПоставщикамиПоДокументам.Предоплата < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Долг > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл > 0 
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр > 0) ТОГДА
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                                                           КАК ВидДвижения,
	|	ВЫРАЗИТЬ(РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент КАК Документ.КорректировкаПриобретения).ДокументОснование КАК СвязанныйДокумент,
	|
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Предоплата < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.Предоплата 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.Предоплата
	|	КОНЕЦ                                                           КАК Предоплата,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр
	|	КОНЕЦ                                                           КАК ПредоплатаУпр,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|	КОНЕЦ                                                           КАК ПредоплатаРегл,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Долг < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.Долг 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.Долг
	|	КОНЕЦ                                                           КАК Долг,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ДолгУпр < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ДолгУпр 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ДолгУпр
	|	КОНЕЦ                                                           КАК ДолгУпр,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ДолгРегл 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|	КОНЕЦ                                                           КАК ДолгРегл,
	|
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Предоплата <> 0 ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА (ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И (РасчетыСПоставщикамиПоДокументам.Долг < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Предоплата > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл > 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр > 0)
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И (РасчетыСПоставщикамиПоДокументам.Предоплата < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Долг > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл > 0 
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр > 0)) 
	|			И НЕ ((РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков ИЛИ
	|					РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов) И 
	|					РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент <> Неопределено)
	|			И НЕ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.РасчетКурсовыхРазниц ТОГДА
	|			ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|	КОНЕЦ                                                           КАК ДатаПлановогоПогашения,
	|	ЕСТЬNULL(ДатыВозникновения.ДатаВозникновения, ДАТАВРЕМЯ(1,1,1)) КАК ДатаВозникновения,
	|	ЕСТЬNULL(ПорядокДокументов.ПорядокОперации,"""")                КАК ПорядокОперации,
	|	ЕСТЬNULL(ДатыВозникновения.ПорядокЗачетаПоДатеПлатежа,"""")     КАК ПорядокЗачетаРегистратора,
	|	ЕСТЬNULL(ДатыВозникновения.ПорядокЗачетаПоДатеПлатежа,"""")     КАК ПорядокЗачета,
	|	ЕСТЬNULL(ДатыВозникновения.ВалютаДокумента,
	|		ЕСТЬNULL(ДатыВозникновения.ВалютаДокумента,
	|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))              КАК ВалютаДокумента
	|ПОМЕСТИТЬ ВтРасчеты
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОсновныеПараметрыРасчета КАК ОсновныеПараметрыРасчета
	|			ПО РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам = ОсновныеПараметрыРасчета.АналитикаУчетаПоПартнерам
	|				И РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику = ОсновныеПараметрыРасчета.ОбъектРасчетов
	|				И РасчетыСПоставщикамиПоДокументам.Валюта = ОсновныеПараметрыРасчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ПорядокДокументов
	|			ПО РасчетыСПоставщикамиПоДокументам.Регистратор = ПорядокДокументов.Регистратор
	|				И НАЧАЛОПЕРИОДА(РасчетыСПоставщикамиПоДокументам.Период,ДЕНЬ) = ПорядокДокументов.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыВозникновения КАК ДатыВозникновения
	|			ПО РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент = ДатыВозникновения.Регистратор
	|ГДЕ
	|	(РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов)
	|	И РасчетыСПоставщикамиПоДокументам.Регистратор <> РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент
	|	И (РасчетыСПоставщикамиПоДокументам.Предоплата <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.Долг <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр <> 0)
	|	И РасчетыСПоставщикамиПоДокументам.Активность
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам      КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику                КАК ОбъектРасчетов,
	|	РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику.ТипОбъектаРасчетов КАК ТипОбъектаРасчетов,
	|	РасчетыСПоставщикамиПоДокументам.Валюта                         КАК Валюта,
	|	РасчетыСПоставщикамиПоДокументам.Регистратор                    КАК ДокументРегистратор,
	|	РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент              КАК РасчетныйДокумент,
	|	РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация          КАК ХозяйственнаяОперация,
	|	РасчетыСПоставщикамиПоДокументам.СтатьяДвиженияДенежныхСредств  КАК СтатьяДвиженияДенежныхСредств,
	|	РасчетыСПоставщикамиПоДокументам.Период                         КАК Период,
	|	ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НЕ (ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиПоДокументам.Регистратор) В (ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств),ТИП(Документ.ПриходныйКассовыйОрдер))
	|						И РасчетыСПоставщикамиПоДокументам.Предоплата > 0)
	|				И (РасчетыСПоставщикамиПоДокументам.Долг < 0
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр < 0
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.Предоплата > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл > 0
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр > 0 )
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|				И (РасчетыСПоставщикамиПоДокументам.Предоплата < 0
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр < 0
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.Долг > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл > 0 
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр > 0
	|					ИЛИ ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиПоДокументам.Регистратор) В (ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств),ТИП(Документ.ПриходныйКассовыйОрдер))
	|						И РасчетыСПоставщикамиПоДокументам.Предоплата > 0) ТОГДА
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                                                           КАК ВидДвижения,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаПриобретения 
	|		ТОГДА ВЫРАЗИТЬ(РасчетыСПоставщикамиПоДокументам.Регистратор КАК Документ.КорректировкаПриобретения).ДокументОснование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент КАК Документ.КорректировкаПриобретения).ДокументОснование
	|	КОНЕЦ КАК СвязанныйДокумент,
	|
	//Некорректно отражались расчеты по документам
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиПоДокументам.Регистратор) В (ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств),ТИП(Документ.ПриходныйКассовыйОрдер))
	|		И РасчетыСПоставщикамиПоДокументам.Предоплата > 0 
	|			ТОГДА 0
	|		КОГДА РасчетыСПоставщикамиПоДокументам.Предоплата < 0  ТОГДА
	|			-РасчетыСПоставщикамиПоДокументам.Предоплата 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.Предоплата
	|	КОНЕЦ                                                           КАК Предоплата,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиПоДокументам.Регистратор) В (ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств),ТИП(Документ.ПриходныйКассовыйОрдер))
	|		И РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр > 0 
	|			ТОГДА 0
	|		КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр < 0  ТОГДА
	|			-РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр
	|	КОНЕЦ                                                           КАК ПредоплатаУпр,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиПоДокументам.Регистратор) В (ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств),ТИП(Документ.ПриходныйКассовыйОрдер))
	|		И РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл > 0 
	|			ТОГДА 0
	|		КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0  ТОГДА
	|			-РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|	КОНЕЦ                                                           КАК ПредоплатаРегл,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Долг < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.Долг 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.Долг
	|		+ ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиПоДокументам.Регистратор) В (ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств),ТИП(Документ.ПриходныйКассовыйОрдер))
	|			И РасчетыСПоставщикамиПоДокументам.Предоплата > 0
	|				ТОГДА РасчетыСПоставщикамиПоДокументам.Предоплата
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ                                                           КАК Долг,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ДолгУпр < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ДолгУпр 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ДолгУпр
	|		+ ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиПоДокументам.Регистратор) В (ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств),ТИП(Документ.ПриходныйКассовыйОрдер))
	|			И РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр > 0
	|				ТОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ                                                           КАК ДолгУпр,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ДолгРегл 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|		+ ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиПоДокументам.Регистратор) В (ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств),ТИП(Документ.ПриходныйКассовыйОрдер))
	|			И РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл > 0
	|				ТОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ                                                           КАК ДолгРегл,
	|
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Предоплата <> 0 ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА (ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И 
	|				(РасчетыСПоставщикамиПоДокументам.Предоплата > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл > 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр > 0)
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И 
	|				(РасчетыСПоставщикамиПоДокументам.Долг > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл > 0 
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр > 0)) 
	|			И НЕ ((РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков ИЛИ
	|					РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов) И 
	|					РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент <> Неопределено)
	|			И НЕ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.РасчетКурсовыхРазниц ТОГДА
	|			ВЫБОР
	|				КОГДА ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1)
	|					ТОГДА ЕСТЬNULL(ПорядокДокументов.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|				ИНАЧЕ ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|	КОНЕЦ                                                           КАК ДатаПлановогоПогашения,
	|	ЕСТЬNULL(ДатыВозникновения.ДатаВозникновения, ДАТАВРЕМЯ(1,1,1)) КАК ДатаВозникновения,
	|	ЕСТЬNULL(ПорядокДокументов.ПорядокОперации,"""")                КАК ПорядокОперации,
	|	ЕСТЬNULL(ПорядокДокументов.ПорядокЗачетаПоДатеПлатежа,"""")     КАК ПорядокЗачетаРегистратора,
	|	ЕСТЬNULL(ДатыВозникновения.ПорядокЗачетаПоДатеПлатежа,"""")     КАК ПорядокЗачета,
	|	ЕСТЬNULL(ДатыВозникновения.ВалютаДокумента,
	|		ЕСТЬNULL(ПорядокДокументов.ВалютаДокумента,
	|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))              КАК ВалютаДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОсновныеПараметрыРасчета КАК ОсновныеПараметрыРасчета
	|			ПО РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам = ОсновныеПараметрыРасчета.АналитикаУчетаПоПартнерам
	|				И РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику = ОсновныеПараметрыРасчета.ОбъектРасчетов
	|				И РасчетыСПоставщикамиПоДокументам.Валюта = ОсновныеПараметрыРасчета.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ПорядокДокументов
	|			ПО РасчетыСПоставщикамиПоДокументам.Регистратор = ПорядокДокументов.Регистратор
	|				И НАЧАЛОПЕРИОДА(РасчетыСПоставщикамиПоДокументам.Период,ДЕНЬ) = ПорядокДокументов.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыВозникновения КАК ДатыВозникновения
	|			ПО РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент = ДатыВозникновения.Регистратор
	|ГДЕ
	|	(НЕ (РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков 
	|			ИЛИ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов)
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.Регистратор = РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент)
	|	И (РасчетыСПоставщикамиПоДокументам.Предоплата <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.Долг <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр <> 0)
	|	И РасчетыСПоставщикамиПоДокументам.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов                КАК ОбъектРасчетов,
	|	Расчеты.Валюта                        КАК Валюта,
	|	Расчеты.ДокументРегистратор           КАК ДокументРегистратор,
	|	Расчеты.РасчетныйДокумент             КАК РасчетныйДокумент,
	|	Расчеты.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	Расчеты.Период                        КАК Период,
	|	Расчеты.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
	|	Расчеты.ДатаВозникновения             КАК ДатаВозникновения,
	|	Расчеты.ВидДвижения                   КАК ВидДвижения,
	|	СУММА(Расчеты.Предоплата)             КАК Предоплата,
	|	СУММА(Расчеты.ПредоплатаУпр)          КАК ПредоплатаУпр,
	|	СУММА(Расчеты.ПредоплатаРегл)         КАК ПредоплатаРегл,
	|	СУММА(Расчеты.Долг)                   КАК Долг,
	|	СУММА(Расчеты.ДолгУпр)                КАК ДолгУпр,
	|	СУММА(Расчеты.ДолгРегл)               КАК ДолгРегл,
	|	Расчеты.СвязанныйДокумент             КАК СвязанныйДокумент,
	|	Расчеты.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	Расчеты.ПорядокОперации               КАК ПорядокОперации,
	|	Расчеты.ПорядокЗачета                 КАК ПорядокЗачета,
	|	Расчеты.ВалютаДокумента               КАК ВалютаДокумента,
	|	Расчеты.Организация                   КАК Организация
	|ИЗ (
	|	ВЫБРАТЬ
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам                            КАК АналитикаУчетаПоПартнерам,
	|		ЗачетыОплат.ОбъектРасчетов                                       КАК ОбъектРасчетов,
	|		ЗачетыОплат.Валюта                                               КАК Валюта,
	|		ЗачетыОплат.ДокументРегистратор                                  КАК ДокументРегистратор,
	|		ЗачетыОплат.ДокументРегистратор                                  КАК РасчетныйДокумент,
	|		ЗачетыОплат.ХозяйственнаяОперация                                КАК ХозяйственнаяОперация,
	|		ЗачетыОплат.Период                                               КАК Период,
	|		ДатыВозникновения.ДатаПлатежа                                    КАК ДатаПлановогоПогашения,
	|		ЗачетыОплат.Период                                               КАК ДатаВозникновения,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                           КАК ВидДвижения,
	|		0                                                                КАК Предоплата,
	|		0                                                                КАК ПредоплатаУпр,
	|		0                                                                КАК ПредоплатаРегл,
	|		ЗачетыОплат.Предоплата                                           КАК Долг,
	|		ЗачетыОплат.ПредоплатаУпр                                        КАК ДолгУпр,
	|		ЗачетыОплат.ПредоплатаРегл                                       КАК ДолгРегл,
	|		Неопределено                                                     КАК СвязанныйДокумент,
	|		ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)  КАК СтатьяДвиженияДенежныхСредств,
	|		ЗачетыОплат.ПорядокОперации                                      КАК ПорядокОперации,
	|		ЗачетыОплат.ПорядокЗачетаРегистратора                            КАК ПорядокЗачета,
	|		ЗачетыОплат.ВалютаДокумента                                      КАК ВалютаДокумента,
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам.Организация                КАК Организация
	|	ИЗ ВтРасчеты КАК ЗачетыОплат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыВозникновения КАК ДатыВозникновения
	|			ПО ЗачетыОплат.ДокументРегистратор = ДатыВозникновения.Регистратор
	|	ГДЕ
	|		ЗачетыОплат.Предоплата > 0 
	|		И ЗачетыОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ЗачетыОплат.ХозяйственнаяОперация НЕ В (&ХозяйственныеОперацииНеОтгрузка)
	|		И ЗачетыОплат.ТипОбъектаРасчетов <> ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.ПлатежВозврат)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам                              КАК АналитикаУчетаПоПартнерам,
	|		ЗачетыОплат.ОбъектРасчетов                                         КАК ОбъектРасчетов,
	|		ЗачетыОплат.Валюта                                                 КАК Валюта,
	|		ЗачетыОплат.ДокументРегистратор                                    КАК ДокументРегистратор,
	|		ЗачетыОплат.ДокументРегистратор                                    КАК РасчетныйДокумент,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаПоставщику) КАК ХозяйственнаяОперация,
	|		ЗачетыОплат.Период                                                 КАК Период,
	|		ДатыВозникновения.ДатаПлатежа                                      КАК ДатаПлановогоПогашения,
	|		ЗачетыОплат.Период                                                 КАК ДатаВозникновения,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                             КАК ВидДвижения,
	|		0                                                                  КАК Предоплата,
	|		0                                                                  КАК ПредоплатаУпр,
	|		0                                                                  КАК ПредоплатаРегл,
	|		ЗачетыОплат.Предоплата                                             КАК Долг,
	|		ЗачетыОплат.ПредоплатаУпр                                          КАК ДолгУпр,
	|		ЗачетыОплат.ПредоплатаРегл                                         КАК ДолгРегл,
	|		Неопределено                                                       КАК СвязанныйДокумент,
	|		ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)    КАК СтатьяДвиженияДенежныхСредств,
	|		ЗачетыОплат.ПорядокОперации                                        КАК ПорядокОперации,
	|		ЗачетыОплат.ПорядокЗачетаРегистратора                            КАК ПорядокЗачета,
	|		ЗачетыОплат.ВалютаДокумента                                        КАК ВалютаДокумента,
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам.Организация                  КАК Организация
	|	ИЗ ВтРасчеты КАК ЗачетыОплат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыВозникновения КАК ДатыВозникновения
	|			ПО ЗачетыОплат.ДокументРегистратор = ДатыВозникновения.Регистратор
	|	ГДЕ
	|		ЗачетыОплат.Предоплата > 0 
	|		И ЗачетыОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ЗачетыОплат.ХозяйственнаяОперация НЕ В (&ХозяйственныеОперацииНеОтгрузка)
	|		И ЗачетыОплат.ТипОбъектаРасчетов <> ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.ПлатежВозврат)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоДокументам.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоДокументам.ОбъектРасчетов                КАК ОбъектРасчетов,
	|		РасчетыПоДокументам.Валюта                        КАК Валюта,
	|		РасчетыПоДокументам.ДокументРегистратор           КАК ДокументРегистратор,
	|		РасчетыПоДокументам.РасчетныйДокумент             КАК РасчетныйДокумент,
	|		ВЫБОР КОГДА РасчетыПоДокументам.Предоплата <> 0 И РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация НЕ В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса))
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаПоставщику)
	|			КОГДА РасчетыПоДокументам.Долг <> 0 И РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаЗадолженности)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиПоставщику)
	|			ИНАЧЕ РасчетыПоДокументам.ХозяйственнаяОперация 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		РасчетыПоДокументам.Период                        КАК Период,
	|		РасчетыПоДокументам.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
	|		РасчетыПоДокументам.ДатаВозникновения             КАК ДатаВозникновения,
	|		РасчетыПоДокументам.ВидДвижения                   КАК ВидДвижения,
	|		РасчетыПоДокументам.Предоплата                    КАК Предоплата,
	|		РасчетыПоДокументам.ПредоплатаУпр                 КАК ПредоплатаУпр,
	|		РасчетыПоДокументам.ПредоплатаРегл                КАК ПредоплатаРегл,
	|		РасчетыПоДокументам.Долг                          КАК Долг,
	|		РасчетыПоДокументам.ДолгУпр                       КАК ДолгУпр,
	|		РасчетыПоДокументам.ДолгРегл                      КАК ДолгРегл,
	|		ВЫБОР КОГДА (РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И РасчетыПоДокументам.Предоплата > 0)
	|			ИЛИ (РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И РасчетыПоДокументам.Долг > 0)
	|			ТОГДА РасчетыПоДокументам.СвязанныйДокумент
	|			ИНАЧЕ Неопределено
	|		КОНЕЦ                                             КАК СвязанныйДокумент,
	|		РасчетыПоДокументам.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		РасчетыПоДокументам.ПорядокОперации               КАК ПорядокОперации,
	|		РасчетыПоДокументам.ПорядокЗачета                 КАК ПорядокЗачета,
	|		РасчетыПоДокументам.ВалютаДокумента               КАК ВалютаДокумента,
	|		РасчетыПоДокументам.АналитикаУчетаПоПартнерам.Организация КАК Организация
	|	ИЗ ВтРасчеты КАК РасчетыПоДокументам) КАК Расчеты
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.ДокументРегистратор,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.ХозяйственнаяОперация,
	|	Расчеты.Период,
	|	Расчеты.ДатаПлановогоПогашения,
	|	Расчеты.ДатаВозникновения,
	|	Расчеты.ВидДвижения,
	|	Расчеты.СвязанныйДокумент,
	|	Расчеты.СтатьяДвиженияДенежныхСредств,
	|	Расчеты.ПорядокОперации,
	|	Расчеты.ПорядокЗачета,
	|	Расчеты.ВалютаДокумента,
	|	Расчеты.Организация
	|;
	|УНИЧТОЖИТЬ ВтОсновныеПараметрыРасчета;
	|УНИЧТОЖИТЬ ВтРегистраторы;
	|УНИЧТОЖИТЬ ПорядокДокументов;
	|УНИЧТОЖИТЬ ДатыВозникновения;
	|УНИЧТОЖИТЬ ВтРасчеты
	|";
	
КонецФункции

// Устарела.
Функция ИмяСобытияЖурналаРегистрацииПриВключенииОнлайнРасчетов()
	
	Возврат НСтр("ru = 'Включение онлайн взаиморасчетов с партнерами.'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Процедура ПеренестиКорректировкуРегистровНаСервере()
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапросаПереносаКорректировокРегистров();
	
	ТипРасчетов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВсегоПеренесено = 0;
	ТипРегистратора = Тип("ДокументСсылка.КорректировкаРегистров");
	Тип = 21;
	ВидОперацииДляСортировки = "0";
	ПорядокОперацииВПределахДокумента = "1";
	Пока ТипРасчетов.Следующий() Цикл
		
		Корректировка = ТипРасчетов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Корректировка.Следующий() Цикл
			НачатьТранзакцию();
			Попытка
				Если ТипРасчетов.ЭтоРасчетыСКлиентами Тогда
					ИмяРегистра = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.Имя;
					Набор = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Корректировка.ДокументРегистратор);
				Иначе
					ИмяРегистра = Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.Имя;
					Набор = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Корректировка.ДокументРегистратор);
				КонецЕсли;
				ДатаКорректировки = Корректировка.ДатаКорректировки;
				НомерКорректировки = Корректировка.НомерКорректировки;
				КорректировкаОбъект = Корректировка.ДокументРегистратор.ПолучитьОбъект();
				Если КорректировкаОбъект.ТаблицаРегистров.Найти(ИмяРегистра) = Неопределено Тогда
					НовыйРегистр = КорректировкаОбъект.ТаблицаРегистров.Добавить();
					НовыйРегистр.Имя = ИмяРегистра;
				КонецЕсли;
				Движения = Корректировка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока Движения.Следующий() Цикл
					
					ДатаПлатежа = ?(ЗначениеЗаполнено(Движения.ДатаПлатежа), Движения.ДатаПлатежа, Дата(3000,1,1));
					
					НоваяЗапись = Набор.Добавить();
					
					//измерения
					НоваяЗапись.Период = Движения.Период;
					НоваяЗапись.АналитикаУчетаПоПартнерам = Движения.АналитикаУчетаПоПартнерам;
					НоваяЗапись.ОбъектРасчетов = Движения.ОбъектРасчетов;
					НоваяЗапись.Валюта = Движения.Валюта;
					НоваяЗапись.РасчетныйДокумент = Движения.РасчетныйДокумент;
					НоваяЗапись.ДатаВозникновения = Движения.ДатаРасчетногоДокумента;
					Если НоваяЗапись.Предоплата = 0 Тогда
						НоваяЗапись.ДатаПлановогоПогашения = Движения.ДатаПлатежа;
					КонецЕсли;
					//ресурсы
					НоваяЗапись.Предоплата = Движения.Предоплата;
					НоваяЗапись.ПредоплатаРегл = Движения.ПредоплатаРегл;
					НоваяЗапись.ПредоплатаУпр = Движения.ПредоплатаУпр;
					НоваяЗапись.Долг = Движения.Долг;
					НоваяЗапись.ДолгРегл = Движения.ДолгРегл;
					НоваяЗапись.ДолгУпр = Движения.ДолгУпр;
					
					//реквизиты
					НоваяЗапись.СтатьяДвиженияДенежныхСредств = Движения.СтатьяДвиженияДенежныхСредств;
					НоваяЗапись.ХозяйственнаяОперация = Движения.ХозяйственнаяОперация;
					НоваяЗапись.ДокументРегистратор = Движения.ДокументРегистратор;
					
					НоваяЗапись.ПорядокОперации = ОперативныеВзаиморасчетыСервер.Порядок(Движения.ДатаКорректировки, Движения.НомерКорректировки, Неопределено, ВидОперацииДляСортировки, Тип, ПорядокОперацииВПределахДокумента);
					НоваяЗапись.ПорядокЗачета = ОперативныеВзаиморасчетыСервер.Порядок(ДатаПлатежа, Движения.НомерКорректировки, Неопределено, ВидОперацииДляСортировки, Тип);
					ЗаполнитьТипЗаписиВзаиморасчетов(НоваяЗапись, ТипРегистратора);
					
				КонецЦикла;
				КорректировкаОбъект.ОбменДанными.Загрузка = Истина;
				КорректировкаОбъект.Записать();
				Набор.ОбменДанными.Загрузка = Истина;
				Набор.Записать();
				
				ВсегоПеренесено = ВсегоПеренесено + 1;
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ИмяСобытия = ИмяСобытияЖурналаРегистрацииПриВключенииОнлайнРасчетов() 
							+ НСтр("ru = 'Перенос Корректировки регистров.'", ОбщегоНазначения.КодОсновногоЯзыка());
				Шаблон = НСтр("ru = 'Не удалось перенести Корректировку регистров %1 от %2 по причине:
				|%3'");
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, 
							НомерКорректировки, Формат(ДатаКорректировки, "ДФ='dd-MM-yyyy'"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(ИмяСобытия,УровеньЖурналаРегистрации.Ошибка,,, Текст);
			КонецПопытки;
		КонецЦикла;//по документам
	
	КонецЦикла;//по типам расчетов
	
	Шаблон = НСтр("ru = 'Перенесено корректировок регистров'")+": %1";
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрацииПриВключенииОнлайнРасчетов(),
		УровеньЖурналаРегистрации.Информация,,,СтрШаблон(Шаблон, ВсегоПеренесено));
	
	
КонецПроцедуры

Функция ТекстЗапросаПереносаКорректировокРегистров()
	
	Возврат 
	"ВЫБРАТЬ
	|	ИСТИНА                                                              КАК ЭтоРасчетыСКлиентами,
	|	РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПоДокументам.ЗаказКлиента                          КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиПоДокументам.ЗаказКлиента.ТипОбъектаРасчетов       КАК ТипОбъектаРасчетов,
	|	РасчетыСКлиентамиПоДокументам.Валюта                                КАК Валюта,
	|	РасчетыСКлиентамиПоДокументам.Регистратор                           КАК ДокументРегистратор,
	|	РасчетыСКлиентамиПоДокументам.Период                                КАК Период,
	|	РасчетыСКлиентамиПоДокументам.РасчетныйДокумент                     КАК РасчетныйДокумент,
	|	РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация                 КАК ХозяйственнаяОперация,
	|	РасчетыСКлиентамиПоДокументам.СтатьяДвиженияДенежныхСредств         КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|			И (РасчетыСКлиентамиПоДокументам.Долг > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Предоплата < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр < 0)
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И НЕ (РасчетыСКлиентамиПоДокументам.Предоплата > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Долг < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл < 0 
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр < 0) ТОГДА
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                                                               КАК ВидДвижения,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРеализации 
	|		ТОГДА ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.КорректировкаРеализации).ДокументОснование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.РасчетныйДокумент КАК Документ.КорректировкаРеализации).ДокументОснование
	|	КОНЕЦ КАК СвязанныйДокумент,
	|
	|	ВЫБОР 
	|		КОГДА РасчетыСКлиентамиПоДокументам.Предоплата < 0
	|			ТОГДА -РасчетыСКлиентамиПоДокументам.Предоплата 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.Предоплата
	|	КОНЕЦ                                                               КАК Предоплата,
	|	ВЫБОР 
	|		КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаУпр < 0 
	|			ТОГДА -РасчетыСКлиентамиПоДокументам.ПредоплатаУпр 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаУпр
	|	КОНЕЦ                                                               КАК ПредоплатаУпр,
	|	ВЫБОР 
	|		КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|			ТОГДА -РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|	КОНЕЦ                                                               КАК ПредоплатаРегл,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Долг < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.Долг 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.Долг
	|	КОНЕЦ                                                               КАК Долг,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ДолгУпр < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ДолгУпр 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ДолгУпр
	|	КОНЕЦ                                                               КАК ДолгУпр,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ДолгРегл 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ДолгРегл
	|	КОНЕЦ                                                               КАК ДолгРегл,
	|	РасчетыСКлиентамиПоДокументам.ДатаПлатежа                           КАК ДатаПлатежа,
	|	Корректировки.Дата                                                  КАК ДатаКорректировки,
	|	Корректировки.Номер                                                 КАК НомерКорректировки,
	|	ЕСТЬNULL(Реестр.ДатаДокументаИБ,Корректировки.Дата)                 КАК ДатаРасчетногоДокумента,
	|	ЕСТЬNULL(Реестр.НомерДокументаИБ,Корректировки.Номер)               КАК НомерРасчетногоДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРегистров КАК Корректировки
	|	ПО РасчетыСКлиентамиПоДокументам.Регистратор = Корректировки.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|	ПО РасчетыСКлиентамиПоДокументам.РасчетныйДокумент = Реестр.Ссылка
	|	И НЕ Реестр.ДополнительнаяЗапись
	|ГДЕ
	|	(РасчетыСКлиентамиПоДокументам.Предоплата <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.Долг <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр <> 0)
	|	И РасчетыСКлиентамиПоДокументам.Активность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ                                                            КАК ЭтоРасчетыСКлиентами,
	|	РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам      КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику                КАК ОбъектРасчетов,
	|	РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику.ТипОбъектаРасчетов КАК ТипОбъектаРасчетов,
	|	РасчетыСПоставщикамиПоДокументам.Валюта                         КАК Валюта,
	|	РасчетыСПоставщикамиПоДокументам.Регистратор                    КАК ДокументРегистратор,
	|	РасчетыСПоставщикамиПоДокументам.Период                         КАК Период,
	|	РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент              КАК РасчетныйДокумент,
	|	РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация          КАК ХозяйственнаяОперация,
	|	РасчетыСПоставщикамиПоДокументам.СтатьяДвиженияДенежныхСредств  КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И (РасчетыСПоставщикамиПоДокументам.Долг < 0
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр < 0
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.Предоплата > 0 
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр > 0 )
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|				И (РасчетыСПоставщикамиПоДокументам.Предоплата < 0
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр < 0
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.Долг > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл > 0 
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр > 0) ТОГДА
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                                                           КАК ВидДвижения,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаПриобретения 
	|		ТОГДА ВЫРАЗИТЬ(РасчетыСПоставщикамиПоДокументам.Регистратор КАК Документ.КорректировкаПриобретения).ДокументОснование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент КАК Документ.КорректировкаПриобретения).ДокументОснование
	|	КОНЕЦ КАК СвязанныйДокумент,
	|
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоДокументам.Предоплата < 0  ТОГДА
	|			-РасчетыСПоставщикамиПоДокументам.Предоплата 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.Предоплата
	|	КОНЕЦ                                                           КАК Предоплата,
	|	ВЫБОР 
	|		КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр < 0  ТОГДА
	|			-РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр
	|	КОНЕЦ                                                           КАК ПредоплатаУпр,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0  ТОГДА
	|			-РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|	КОНЕЦ                                                           КАК ПредоплатаРегл,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Долг < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.Долг 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.Долг
	|	КОНЕЦ                                                           КАК Долг,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ДолгУпр < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ДолгУпр 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ДолгУпр
	|	КОНЕЦ                                                           КАК ДолгУпр,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ДолгРегл 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|	КОНЕЦ                                                           КАК ДолгРегл,
	|	РасчетыСПоставщикамиПоДокументам.ДатаПлатежа                    КАК ДатаПлатежа,
	|	Корректировки.Дата                                              КАК ДатаКорректировки,
	|	Корректировки.Номер                                             КАК НомерКорректировки,
	|	ЕСТЬNULL(Реестр.ДатаДокументаИБ,Корректировки.Дата)             КАК ДатаРасчетногоДокумента,
	|	ЕСТЬNULL(Реестр.НомерДокументаИБ,Корректировки.Номер)           КАК НомерРасчетногоДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРегистров КАК Корректировки
	|	ПО РасчетыСПоставщикамиПоДокументам.Регистратор = Корректировки.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|	ПО РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент = Реестр.Ссылка
	|	И НЕ Реестр.ДополнительнаяЗапись
	|ГДЕ
	|	РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|	И (РасчетыСПоставщикамиПоДокументам.Предоплата <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.Долг <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр <> 0)
	|	И РасчетыСПоставщикамиПоДокументам.Активность
	|ИТОГИ
	|	МАКСИМУМ(ДатаКорректировки),
	|	МАКСИМУМ(НомерКорректировки)
	|ПО
	|	ЭтоРасчетыСКлиентами,
	|	ДокументРегистратор";
	
КонецФункции

//++ Локализация
Процедура ЗаписатьРасхожденияОстатковПослеПерехода()
	
	Отчет = Новый ПостроительОтчета;
	#Область ТекстЗапроса
	Отчет.Текст = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК ЭтоРасчетыСКлиентами,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПоДокументам.ЗаказКлиента КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.ПредоплатаОстаток КАК Предоплата,
	|	РасчетыПоДокументам.ПредоплатаУпрОстаток КАК ПредоплатаУпр,
	|	РасчетыПоДокументам.ПредоплатаРеглОстаток КАК ПредоплатаРегл,
	|	-РасчетыПоДокументам.ДолгОстаток КАК Долг,
	|	-РасчетыПоДокументам.ДолгУпрОстаток КАК ДолгУпр,
	|	-РасчетыПоДокументам.ДолгРеглОстаток КАК ДолгРегл
	|ПОМЕСТИТЬ втРасчетыСКлиентамиПоДокументамОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки КАК РасчетыПоДокументам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоРасчетыСКлиентами,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПоДокументам.ЗаказПоставщику КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	-РасчетыПоДокументам.ПредоплатаОстаток КАК Предоплата,
	|	-РасчетыПоДокументам.ПредоплатаУпрОстаток КАК ПредоплатаУпр,
	|	-РасчетыПоДокументам.ПредоплатаРеглОстаток КАК ПредоплатаРегл,
	|	РасчетыПоДокументам.ДолгОстаток КАК Долг,
	|	РасчетыПоДокументам.ДолгУпрОстаток КАК ДолгУпр,
	|	РасчетыПоДокументам.ДолгРеглОстаток КАК ДолгРегл
	|ПОМЕСТИТЬ втРасчетыСПоставщикамиПоДокументамОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки КАК РасчетыПоДокументам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЭтоРасчетыСКлиентами,
	|	РасчетыПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПоСрокам.Валюта КАК Валюта,
	|	РасчетыПоСрокам.ПредоплатаОстаток КАК Предоплата,
	|	РасчетыПоСрокам.ПредоплатаУпрОстаток КАК ПредоплатаУпр,
	|	РасчетыПоСрокам.ПредоплатаРеглОстаток КАК ПредоплатаРегл,
	|	РасчетыПоСрокам.ДолгОстаток КАК Долг,
	|	РасчетыПоСрокам.ДолгУпрОстаток КАК ДолгУпр,
	|	РасчетыПоСрокам.ДолгРеглОстаток КАК ДолгРегл
	|ПОМЕСТИТЬ втРасчетыСКлиентамиПоСрокамОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки КАК РасчетыПоСрокам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоРасчетыСКлиентами,
	|	РасчетыПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПоСрокам.Валюта КАК Валюта,
	|	РасчетыПоСрокам.ПредоплатаОстаток КАК Предоплата,
	|	РасчетыПоСрокам.ПредоплатаУпрОстаток КАК ПредоплатаУпр,
	|	РасчетыПоСрокам.ПредоплатаРеглОстаток КАК ПредоплатаРегл,
	|	РасчетыПоСрокам.ДолгОстаток КАК Долг,
	|	РасчетыПоСрокам.ДолгУпрОстаток КАК ДолгУпр,
	|	РасчетыПоСрокам.ДолгРеглОстаток КАК ДолгРегл
	|ПОМЕСТИТЬ втРасчетыСПоставщикамиПоСрокамОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки КАК РасчетыПоСрокам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|	Остатки.Валюта КАК Валюта,
	|	СУММА(Остатки.Предоплата) КАК Предоплата,
	|	СУММА(Остатки.Долг) КАК Долг,
	|	Остатки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(Остатки.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	СУММА(Остатки.ПредоплатаРегл) КАК ПредоплатаРегл,
	|	СУММА(Остатки.ДолгУпр) КАК ДолгУпр,
	|	СУММА(Остатки.ДолгРегл) КАК ДолгРегл
	|ПОМЕСТИТЬ втРасхожденияОстатков
	|ИЗ	
	|	(ВЫБРАТЬ
	|		РасчетыПоДокументам.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|		РасчетыПоДокументам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоДокументам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыПоДокументам.Валюта КАК Валюта,
	|		РасчетыПоДокументам.Предоплата КАК Предоплата,
	|		РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|		РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|		РасчетыПоДокументам.Долг КАК Долг,
	|		РасчетыПоДокументам.ДолгУпр КАК ДолгУпр,
	|		РасчетыПоДокументам.ДолгРегл КАК ДолгРегл
	|	ИЗ
	|		втРасчетыСКлиентамиПоДокументамОстатки КАК РасчетыПоДокументам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоДокументам.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|		РасчетыПоДокументам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоДокументам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыПоДокументам.Валюта КАК Валюта,
	|		РасчетыПоДокументам.Предоплата КАК Предоплата,
	|		РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|		РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|		РасчетыПоДокументам.Долг КАК Долг,
	|		РасчетыПоДокументам.ДолгУпр КАК ДолгУпр,
	|		РасчетыПоДокументам.ДолгРегл КАК ДолгРегл
	|	ИЗ
	|		втРасчетыСПоставщикамиПоДокументамОстатки КАК РасчетыПоДокументам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоСрокам.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта КАК Валюта,
	|		РасчетыПоСрокам.Предоплата КАК Предоплата,
	|		РасчетыПоСрокам.ПредоплатаУпр КАК ПредоплатаУпр,
	|		РасчетыПоСрокам.ПредоплатаРегл КАК ПредоплатаРегл,
	|		РасчетыПоСрокам.Долг КАК Долг,
	|		РасчетыПоСрокам.ДолгУпр КАК ДолгУпр,
	|		РасчетыПоСрокам.ДолгРегл КАК ДолгРегл
	|	ИЗ
	|		втРасчетыСКлиентамиПоСрокамОстатки КАК РасчетыПоСрокам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоСрокам.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта КАК Валюта,
	|		РасчетыПоСрокам.Предоплата КАК Предоплата,
	|		РасчетыПоСрокам.ПредоплатаУпр КАК ПредоплатаУпр,
	|		РасчетыПоСрокам.ПредоплатаРегл КАК ПредоплатаРегл,
	|		РасчетыПоСрокам.Долг КАК Долг,
	|		РасчетыПоСрокам.ДолгУпр КАК ДолгУпр,
	|		РасчетыПоСрокам.ДолгРегл КАК ДолгРегл
	|	ИЗ
	|		втРасчетыСПоставщикамиПоСрокамОстатки КАК РасчетыПоСрокам
	|	) Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.ЭтоРасчетыСКлиентами,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.ОбъектРасчетов,
	|	Остатки.Валюта
	|ИМЕЮЩИЕ
	|	(СУММА(Остатки.Предоплата) <> 0
	|		ИЛИ СУММА(Остатки.ПредоплатаУпр) <> 0
	|		ИЛИ СУММА(Остатки.ПредоплатаРегл) <> 0
	|		ИЛИ СУММА(Остатки.Долг) <> 0
	|		ИЛИ СУММА(Остатки.ДолгУпр) <> 0
	|		ИЛИ СУММА(Остатки.ДолгРегл) <> 0)
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ЭтоРасчетыПоСрокам КАК ЭтоРасчетыПоСрокам,
	|	Остатки.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|	Остатки.Валюта КАК Валюта,
	|	СУММА(Остатки.Предоплата) КАК Предоплата,
	|	СУММА(Остатки.Долг) КАК Долг,
	|	Остатки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(Остатки.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	СУММА(Остатки.ПредоплатаРегл) КАК ПредоплатаРегл,
	|	СУММА(Остатки.ДолгУпр) КАК ДолгУпр,
	|	СУММА(Остатки.ДолгРегл) КАК ДолгРегл
	|ИЗ	
	|	(ВЫБРАТЬ
	|		ЛОЖЬ КАК ЭтоРасчетыПоСрокам,
	|		РасчетыПоДокументам.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|		РасчетыПоДокументам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоДокументам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыПоДокументам.Валюта КАК Валюта,
	|		РасчетыПоДокументам.Предоплата КАК Предоплата,
	|		РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|		РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|		РасчетыПоДокументам.Долг КАК Долг,
	|		РасчетыПоДокументам.ДолгУпр КАК ДолгУпр,
	|		РасчетыПоДокументам.ДолгРегл КАК ДолгРегл
	|	ИЗ
	|		втРасчетыСКлиентамиПоДокументамОстатки КАК РасчетыПоДокументам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРасхожденияОстатков КАК РасхожденияОстатков
	|			ПО РасчетыПоДокументам.АналитикаУчетаПоПартнерам = РасхожденияОстатков.АналитикаУчетаПоПартнерам
	|			И РасчетыПоДокументам.ОбъектРасчетов = РасхожденияОстатков.ОбъектРасчетов
	|			И РасчетыПоДокументам.Валюта = РасхожденияОстатков.Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ КАК ЭтоРасчетыПоСрокам,
	|		РасчетыПоДокументам.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|		РасчетыПоДокументам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоДокументам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыПоДокументам.Валюта КАК Валюта,
	|		РасчетыПоДокументам.Предоплата КАК Предоплата,
	|		РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|		РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|		РасчетыПоДокументам.Долг КАК Долг,
	|		РасчетыПоДокументам.ДолгУпр КАК ДолгУпр,
	|		РасчетыПоДокументам.ДолгРегл КАК ДолгРегл
	|	ИЗ
	|		втРасчетыСПоставщикамиПоДокументамОстатки КАК РасчетыПоДокументам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРасхожденияОстатков КАК РасхожденияОстатков
	|			ПО РасчетыПоДокументам.АналитикаУчетаПоПартнерам = РасхожденияОстатков.АналитикаУчетаПоПартнерам
	|			И РасчетыПоДокументам.ОбъектРасчетов = РасхожденияОстатков.ОбъектРасчетов
	|			И РасчетыПоДокументам.Валюта = РасхожденияОстатков.Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИСТИНА КАК ЭтоРасчетыПоСрокам,
	|		РасчетыПоСрокам.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта КАК Валюта,
	|		РасчетыПоСрокам.Предоплата КАК Предоплата,
	|		РасчетыПоСрокам.ПредоплатаУпр КАК ПредоплатаУпр,
	|		РасчетыПоСрокам.ПредоплатаРегл КАК ПредоплатаРегл,
	|		РасчетыПоСрокам.Долг КАК Долг,
	|		РасчетыПоСрокам.ДолгУпр КАК ДолгУпр,
	|		РасчетыПоСрокам.ДолгРегл КАК ДолгРегл
	|	ИЗ
	|		втРасчетыСКлиентамиПоСрокамОстатки КАК РасчетыПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРасхожденияОстатков КАК РасхожденияОстатков
	|			ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = РасхожденияОстатков.АналитикаУчетаПоПартнерам
	|			И РасчетыПоСрокам.ОбъектРасчетов = РасхожденияОстатков.ОбъектРасчетов
	|			И РасчетыПоСрокам.Валюта = РасхожденияОстатков.Валюта
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИСТИНА КАК ЭтоРасчетыПоСрокам,
	|		РасчетыПоСрокам.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыПоСрокам.Валюта КАК Валюта,
	|		РасчетыПоСрокам.Предоплата КАК Предоплата,
	|		РасчетыПоСрокам.ПредоплатаУпр КАК ПредоплатаУпр,
	|		РасчетыПоСрокам.ПредоплатаРегл КАК ПредоплатаРегл,
	|		РасчетыПоСрокам.Долг КАК Долг,
	|		РасчетыПоСрокам.ДолгУпр КАК ДолгУпр,
	|		РасчетыПоСрокам.ДолгРегл КАК ДолгРегл
	|	ИЗ
	|		втРасчетыСПоставщикамиПоСрокамОстатки КАК РасчетыПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРасхожденияОстатков КАК РасхожденияОстатков
	|			ПО РасчетыПоСрокам.АналитикаУчетаПоПартнерам = РасхожденияОстатков.АналитикаУчетаПоПартнерам
	|			И РасчетыПоСрокам.ОбъектРасчетов = РасхожденияОстатков.ОбъектРасчетов
	|			И РасчетыПоСрокам.Валюта = РасхожденияОстатков.Валюта
	|	) Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.ЭтоРасчетыПоСрокам,
	|	Остатки.ЭтоРасчетыСКлиентами,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.ОбъектРасчетов,
	|	Остатки.Валюта
	|	
	|УПОРЯДОЧИТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	ЭтоРасчетыПоСрокам";
	#КонецОбласти
	
	РезультатОтчета = Новый ТабличныйДокумент;
	
	Отчет.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.Расшифровка;
	Отчет.Вывести(РезультатОтчета);
	ХранилищеОтчета = Новый ХранилищеЗначения(РезультатОтчета, Новый СжатиеДанных(9));
	Константы.УдалитьРасхожденияОстатковПослеПереходаНаНовуюАрхитектуруВзаиморасчетов.Установить(ХранилищеОтчета);
	
КонецПроцедуры
//-- Локализация
#КонецОбласти

#Область ОчисткаРегистровВзаиморасчетов

// Устарел. Очищает регистры взаиморасчетов.
// 
// Параметры:
//  ТолькоПлановыеРасчеты - Булево - Не нужно очищать фактические расчеты.
Процедура ОчиститьРегистрыВзаиморасчетов(ТолькоПлановыеРасчеты = Ложь) Экспорт
	
	ВзаиморасчетыСлужебный.ОчиститьРегистрыВзаиморасчетов(ТолькоПлановыеРасчеты);
		
КонецПроцедуры

// Устарел. Очищает переданный регистр расчетов.
Процедура ОчиститьРегистр(ИмяРегистра, ВсегоОбработано = 0) Экспорт
	
	ВзаиморасчетыСлужебный.ОчиститьРегистр(ИмяРегистра, ВсегоОбработано) 
	
КонецПроцедуры

//Устарел. Очищает переданный регистр расчетов в несколько потоков.
// 
// Параметры:
// 	ИмяРегистра - Строка - Имя очищаемого регистра накопления
// Возвращаемое значение:
// 	Число - Количество обработанных регистраторов
//
Функция ВыполнитьОчисткуРегистраМногопоточно(ИмяРегистра) Экспорт
	
	Возврат ВзаиморасчетыСлужебный.ВыполнитьОчисткуРегистраМногопоточно(ИмяРегистра) 
	
КонецФункции

//Устарел. Очищает переданный регистр расчетов по регистратору
Процедура ОчиститьРегистрВзаиморасчетовПоДокументу(Регистратор, ИмяРегистра) Экспорт
	
	ВзаиморасчетыСлужебный.ОчиститьРегистрВзаиморасчетовПоДокументу(Регистратор, ИмяРегистра);
	
КонецПроцедуры

//Устарел.
Процедура УдалитьЗаписиДокументов(Параметры, АдресРезультата = Неопределено) Экспорт
	
	ВзаиморасчетыСлужебный.УдалитьЗаписиДокументов(Параметры, АдресРезультата);
	
КонецПроцедуры

//Устарел.
Процедура УдалитьСлужебныеРегистраторы(Параметры, АдресРезультата = Неопределено) Экспорт
	
	ВзаиморасчетыСлужебный.УдалитьСлужебныеРегистраторы(Параметры, АдресРезультата)
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеФункции
// Устарела.
Функция МногопоточнаяОбработкаЗаданийКРаспределениюРасчетов(Параметры)
	
	ПроцедураОбработки = Параметры.Процедура;
	ПараметрыДанных = Параметры.Данные;
	РазмерПорцииОбработкиВОдномПотоке = Параметры.РазмерПорцииОбработкиВОдномПотоке;

	Потоки = Новый Массив;
	КоличествоСвободныхПотоков = ВзаиморасчетыСлужебный.КоличествоПотоковРаспределенияВзаиморасчетов();
	КоличествоОбъектовДляОбработки = РазмерПорцииОбработкиВОдномПотоке * КоличествоСвободныхПотоков;
	ПараметрыДанных.ПоследняяЗапись = НовыйКурсор();
	КоличествоОбработанныхЗаписей = 0;
	КоличествоОбработанныхЗаданий = 0;
	Пока КоличествоОбъектовДляОбработки > 0 Цикл

		Если КоличествоСвободныхПотоков > 0 Тогда

			ПараметрыДанных.РазмерПорции = РазмерПорцииОбработкиВОдномПотоке * КоличествоСвободныхПотоков;
			ДанныеДляОбработки = ВзаиморасчетыСлужебный.ДанныеДляОбработки(ПараметрыДанных, Истина);
			Кортежи = ДанныеДляОбработки.Кортежи;
			ПараметрыДанных.ПоследняяЗапись = НовыйКурсор();
			Если Кортежи.Количество() > 0 И ДанныеДляОбработки.ОсталосьОбработать > 0 Тогда
				ЗаполнитьЗначенияСвойств(ПараметрыДанных.ПоследняяЗапись, Кортежи[Кортежи.Количество() - 1]);
			КонецЕсли;

			ПараметрыДанных.РазмерПорции = 1;
			Если Кортежи.Количество()/КоличествоСвободныхПотоков > 1 Тогда
				РазмерПорции = Кортежи.Количество()/КоличествоСвободныхПотоков;
				Если Цел(РазмерПорции) <> РазмерПорции Тогда
					ПараметрыДанных.РазмерПорции = Цел(РазмерПорции) + 1;
				Иначе
					ПараметрыДанных.РазмерПорции = РазмерПорции;
				КонецЕсли;
			КонецЕсли;
			КоличествоОбъектовДляОбработки = ДанныеДляОбработки.ОсталосьОбработать;
			Пока Кортежи.Количество() > 0 Цикл

				ДанныеПотока = ВыбратьДанныеДляПотока(ДанныеДляОбработки, ПараметрыДанных.РазмерПорции);
				Поток = ВзаиморасчетыСлужебный.НовоеОписаниеПотока(ПроцедураОбработки.Имя);
				Поток.НаименованиеЗадания = ПроцедураОбработки.ПредставлениеЗадания;
				Поток.ПараметрыПроцедуры.Вставить("ДанныеКОбработке", ДанныеПотока.Задания);
				Поток.ПараметрыПроцедуры.Вставить("ДополнитьРаспределитьПриемники", Истина);
				Для Каждого Параметр Из ПроцедураОбработки.Параметры Цикл
					Поток.ПараметрыПроцедуры.Вставить(Параметр.Ключ, Параметр.Значение);
				КонецЦикла;
				ВзаиморасчетыСлужебный.ЗапуститьОбработкуВФоне(Поток);
				ДобавитьКортежиПотока(Поток, ПараметрыДанных.КортежиВОбработке, ДанныеПотока.Кортежи);
				КоличествоОбработанныхЗаданий = КоличествоОбработанныхЗаданий + ДанныеПотока.Задания.Количество();
				Потоки.Добавить(Поток);

			КонецЦикла;

		КонецЕсли;

		ВзаиморасчетыСлужебный.ОжидатьЗавершениеПотока(Поток);

		ВзаиморасчетыСлужебный.ЗавершитьПотокиВыполнившиеФЗ(Потоки, ПараметрыДанных.КортежиВОбработке, КоличествоОбработанныхЗаписей);
		ЭтоПоследняяПорция = ПараметрыДанных.ПоследняяЗапись.ОбъектРасчетов = Неопределено;
		Если ЭтоПоследняяПорция Тогда
			ВзаиморасчетыСлужебный.ОжидатьЗавершениеВсехПотоков(Потоки, ПараметрыДанных.КортежиВОбработке, КоличествоОбработанныхЗаписей);
		КонецЕсли;

		КоличествоДоступныхПотоков = ВзаиморасчетыСлужебный.КоличествоПотоковРаспределенияВзаиморасчетов();
		КоличествоСвободныхПотоков = Макс(КоличествоДоступныхПотоков - Потоки.Количество(), 0);

	КонецЦикла;

	ВзаиморасчетыСлужебный.ОжидатьЗавершениеВсехПотоков(Потоки,,КоличествоОбработанныхЗаписей);

	Если КоличествоОбработанныхЗаписей = 0 Тогда
		Возврат КоличествоОбработанныхЗаданий;
	КонецЕсли;

	Возврат КоличествоОбработанныхЗаписей;
	
КонецФункции

// Устарела.
Функция ПараметрыМногопоточнойОбработкиРасчетов(РазмерПорцииВОдномПотоке = Неопределено)
	
	Результат = Новый Структура;
	
	ПроцедураОбработки = Новый Структура;
	ПроцедураОбработки.Вставить("Имя", "");
	ПроцедураОбработки.Вставить("ПредставлениеЗадания", "");
	ПроцедураОбработки.Вставить("Параметры", Новый Структура);
	
	ДанныеОбработки = ВзаиморасчетыСлужебный.ПараметрыДанныхМногопоточнойОбработки();
	
	Результат.Вставить("РазмерПорцииОбработкиВОдномПотоке", ВзаиморасчетыСлужебный.РазмерПорцииОбработкиВОдномПотоке());
	Если РазмерПорцииВОдномПотоке <> Неопределено Тогда
		Результат.РазмерПорцииОбработкиВОдномПотоке = РазмерПорцииВОдномПотоке;
	КонецЕсли;
	Результат.Вставить("Процедура", ПроцедураОбработки);
	Результат.Вставить("Данные", ДанныеОбработки);
	
	Возврат Результат;
	
КонецФункции

// Устарела.
Функция НовыйКурсор()
	
	ПоследняяЗапись = Новый Структура("КоличествоДокументов,АналитикаУчетаПоПартнерам,ОбъектРасчетов");
	ПоследняяЗапись.КоличествоДокументов = 0;
	
	Возврат ПоследняяЗапись;
	
КонецФункции

// Устарела.
Процедура ДобавитьКортежиПотока(Поток,КортежиВОбработке,Кортежи)
	
	Если КортежиВОбработке = Неопределено Тогда
		КортежиВОбработке = Кортежи.Скопировать();
		КортежиВОбработке.ЗаполнитьЗначения(Поток.ИдентификаторЗадания,"ИдПотока");
		Возврат;
	КонецЕсли;
	
	Для Каждого Кортеж Из Кортежи Цикл
		НоваяСтрока = КортежиВОбработке.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Кортеж);
		НоваяСтрока.ИдПотока = Поток.ИдентификаторЗадания;
	КонецЦикла;
	
КонецПроцедуры

// Устарела. Кортежи с наибольшим количеством документов первыми отправляются на обработку.
// Для более равномерной загрузки потоков и максимального распараллеливания обработки
// такие кортежи распределяются равномерно по всем свободными потоками,
// а не назначаются все "тяжелые" в один поток обработки.
//
Функция ВыбратьДанныеДляПотока(ДанныеКОбработке, РазмерПорции)
	
	ПоляКортежа = "ТипРасчетов,АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта";
	Кортежи = ДанныеКОбработке.Кортежи;
	Задания = ДанныеКОбработке.Данные;
	ЗаданияПотока = Задания.СкопироватьКолонки();
	КортежиПотока = Задания.СкопироватьКолонки(ПоляКортежа);
	ЭтоПоследняяПорция = Кортежи.Количество()/РазмерПорции <= 1;
	Индекс = 0;
	Пока (КортежиПотока.Количество() < РазмерПорции ИЛИ ЭтоПоследняяПорция)
		И Кортежи.Количество() > 0 Цикл
		
		Кортеж = Кортежи[Индекс];
		Отбор = Новый Структура(ПоляКортежа);
		ЗаполнитьЗначенияСвойств(Отбор,Кортеж);
		ЗаписиКОбработке = Задания.НайтиСтроки(Отбор);
		Для Каждого Запись Из ЗаписиКОбработке Цикл
			ЗаполнитьЗначенияСвойств(ЗаданияПотока.Добавить(), Запись);
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(КортежиПотока.Добавить(), Кортеж);
		
		Кортежи.Удалить(Кортеж);
		Индекс = Индекс + РазмерПорции;
		Если Индекс >= Кортежи.Количество() Тогда
			Индекс = 0;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеПотока = Новый Структура;
	ДанныеПотока.Вставить("Задания", ЗаданияПотока);
	ДанныеПотока.Вставить("Кортежи", КортежиПотока);
	
	Возврат ДанныеПотока;
	
КонецФункции

// Устарела.
Процедура ОтметитьВыполнениеЗадания(ОтборПоИзмерениям, ДополнительныеИзмеренияОтбора = "") Экспорт
	
	ИзмеренияОтбораСтрокой =  
	"ТипРасчетов,
	|АналитикаУчетаПоПартнерам,
	|ОбъектРасчетов,
	|Валюта,
	|Валюта";
	Если НЕ ПустаяСтрока(ДополнительныеИзмеренияОтбора)  Тогда
		ИзмеренияОтбораСтрокой = ИзмеренияОтбораСтрокой + "," + ДополнительныеИзмеренияОтбора;
	КонецЕсли;
	
	ИзмеренияОтбора = Новый Структура(ИзмеренияОтбораСтрокой);
	ЗаполнитьЗначенияСвойств(ИзмеренияОтбора, ОтборПоИзмерениям);
	
	Набор = РегистрыСведений.ЗаданияКРаспределениюРасчетов.СоздатьНаборЗаписей();
	Для Каждого Измерение Из ИзмеренияОтбора Цикл
		Если Измерение.Значение <> Неопределено Тогда
			ИмяИзмерения = ?(Измерение.Ключ = "Валюта", "Валюта", Измерение.Ключ);
			Набор.Отбор[ИмяИзмерения].Установить(Измерение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

//Для целей сортировки документов в пределах 1 секунды.
// 
// Параметры:
// 	ТипДокумента - Тип - Тип документ, для которого подбирается номер.
// Возвращаемое значение:
// 	Строка - Номер для порядка.
Функция НомерТипа(ТипДокумента) Экспорт
	
	//	При добавлении документа - добавить в конец с новым номером, не меняя типы других документов.
	Тип = "";
	
	Если ТипДокумента = Тип("ДокументСсылка.РасчетКурсовыхРазниц") ИЛИ ТипДокумента = Тип("ДокументСсылка.РегистраторРасчетов")Тогда
		Тип="99";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		Тип="01";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Тип="14";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Тип="16";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Тип="39";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Тип="35";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		Тип="02";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
		Тип="41";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") Тогда
		Тип="22";
	//++ Локализация
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОперацияПоЯндексКассе") Тогда
		Тип="23";
	//-- Локализация
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
		Тип="33";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВводОстатков")
		Или ТипДокумента = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов") Тогда
		Тип="03";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
		Тип="04";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями") Тогда
		Тип="07";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		Тип="06";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		Тип="07";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВыкупВозвратнойТарыКлиентом") Тогда
		Тип="09";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВыкупВозвратнойТарыУПоставщика") Тогда
		Тип="10";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ГрафикИсполненияДоговора") Тогда
		Тип="12";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		Тип="17";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		Тип="18";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
		Тип="19";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Тип="20";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
		Тип="21";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		Тип="25";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионераОСписании") Тогда
		Тип="26";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		Тип="27";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОСписании") Тогда
		Тип="28";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациями") Тогда
		Тип="30";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациямиОСписании") Тогда
		Тип="31";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
		Тип="32";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
		Тип="36";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		Тип="37";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		Тип="38";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда
		Тип="40";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаЗадолженности") Тогда
		Тип="42";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ТаможеннаяДекларацияИмпорт") Тогда
		Тип="43";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВыкупПринятыхНаХранениеТоваров") Тогда
		Тип="11";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВыкупТоваровХранителем") Тогда
		Тип="45";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетОСписанииТоваровСХранения") Тогда
		Тип="46";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОЗакупках") Тогда
		 Тип="47";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОперацияСЭлектроннымБилетом") Тогда
		Тип="49";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.Сторно") Тогда
		Тип="50";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АннулированиеПодарочныхСертификатов") Тогда
		Тип="56";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратПодарочныхСертификатов") Тогда
		Тип="57";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктПремииКлиенту") Тогда
		Тип="58";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктПремииПоставщика") Тогда
		Тип="59";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияПодарочныхСертификатов") Тогда
		Тип="60";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
		Тип="61";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЧекККМ") Тогда
		Тип="62";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПоступлениеТоваровОтКлиента") Тогда
		Тип="63";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СписаниеОтгруженныхТоваров") Тогда
		Тип="64";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаГрафикаВзаиморасчетов") Тогда
		Тип="65";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетБанкаПоОперациямЭквайринга") Тогда
		Тип="66";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтгрузкаТоваровКлиенту") Тогда
		Тип="67";
	КонецЕсли;
	
	Если Тип = ""
		И ОбщегоНазначения.РежимОтладки() Тогда
		
		ПодробноеПредставлениеОшибки = СтрЗаменить(
			НСтр("ru = 'Не определен порядок распределения типа документа в пределах дня %1.'"),
			"%1",
			ТипДокумента);
			
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Оперативные взаиморасчеты с контрагентами'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
			
		ВызватьИсключение ПодробноеПредставлениеОшибки;
		
	Иначе
		Возврат Тип;
	КонецЕсли;
	
КонецФункции

//Возвращает структуру данных реализации для передачи между служебными процедурами.
//
// Возвращаемое значение:
//	Структура - структура данных реализации.
//		* СуммаОстаток для корректировок - при первом упоминании формируется запись с первоначальной суммой, далее из нее вычитаются оплаты и корректировки.
//		* Остальные суммы для расчета среднего курса и, наверное, формирования движений по Суммам документов в валюте регл.
Функция СтруктураСумм(СуммаДокумента = 0, СуммаДокументаРегл = 0, СуммаДокументаУпр = 0)
	СтруктураСумм = Новый Структура;
	СтруктураСумм.Вставить("СуммаДокумента", СуммаДокумента);
	СтруктураСумм.Вставить("СуммаДокументаРегл", СуммаДокументаРегл);
	СтруктураСумм.Вставить("СуммаДокументаУпр", СуммаДокументаУпр);
	Возврат СтруктураСумм;
КонецФункции

//Возвращает структуру данных корректировки графика взаиморасчетов для сохранения курса и даты возникновения
// в процессе переноса дат планового погашения.
//
// Возвращаемое значение:
//	Структура - структура для хранения расходных сумм корректировок графика:
//	 * СуммаРасход - Число - сумма расхода долга или предоплаты в валюте взаиморасчетов.
//	 * СуммаРасходРегл - Число - сумма расхода долга или предоплаты в валюте регламентированного учета.
//	 * СуммаРасходУпр - Число - сумма расхода долга или предоплаты в валюте управленческого учета.
//	 * ДатаВозникновения - Дата - Исходная дата возникновения задолженности.
Функция СтруктураДанныхКорректировкиГрафика()
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("СуммаРасход", 0);
	СтруктураДанных.Вставить("СуммаРасходРегл", 0);
	СтруктураДанных.Вставить("СуммаРасходУпр", 0);
	СтруктураДанных.Вставить("ДатаВозникновения", Дата(1,1,1));
	Возврат СтруктураДанных;
КонецФункции

//Типы регистраторов, которые двигают план оплат, отгрузок и поставок в приход.
//
// Возвращаемое значение:
// 	СписокЗначений из Тип - Список типов документов, которые двигают только плановые регистры расчетов. Используется для распредедления плановых расчетов.
Функция СписокТиповРегистраторовПланов() Экспорт
	СписокТиповРегистраторовПланов = Новый СписокЗначений;

	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ГрафикИсполненияДоговора"));
	Возврат СписокТиповРегистраторовПланов;
КонецФункции

//Для данных хоз операций не будет сформирована двойная запись в регистрах расчетов по срокам.
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ХозяйственныеОперации - Массив операций, для которых не нужно делать запись по переносу аванса.
//
Функция ХозяйственныеОперацииНеОтгрузка() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.НачислениеКредиторскойЗадолженности);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.РезервированиеАвансаКлиента);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиентуНаПлатежнуюКарту);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ОтражениеВозвратаОплатыЧерезКомиссионера);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратБронирования);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратБронированияПодотчетногоЛица);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Массив, ХозяйственныеОперацииПереносаРасчетов());
	
	Возврат Массив;
КонецФункции

//Для данных хоз операций не будет сформирована двойная запись в регистрах расчетов по срокам, а так же будет сохранена исходная хозяйственная операция.
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ХозяйственныеОперации - Массив операций, для которых не нужно делать запись по переносу аванса.
//
Функция ХозяйственныеОперацииПереносаРасчетов()
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ПереносАванса);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ПереносДолга);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ПереносПлатежаМеждуФилиалами);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомиссионера);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомитентом);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.КорректировкаГрафикаОплатыКлиентом);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.КорректировкаГрафикаОплатыПоставщику);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.КорректировкаГрафикаПогашенияАвансаКлиента);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.КорректировкаГрафикаПогашенияАвансаПоставщику);
	Возврат Массив;
КонецФункции

//По данным хоз. операциям суммы в валюте регламентированного и управленческого учета не будут пересчитаны с учетом авансов.
// 
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ХозяйственныеОперации - Массив непересчитываемых операций.
Функция ХозяйственныеОперацииСРучнымКурсом() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхДокументовОтПоставщика);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом);
	Возврат Массив;
КонецФункции

// Устарела. Возвращает движения документов Реализация товаров и услуг с хоз. операцией Товары в пути к движениям,
//пригодным для офлайн взаиморасчетов.
//
Процедура ВернутьДвиженияПоРасчетамСКлиентами()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	РасчетыСКлиентами.Регистратор                  КАК Регистратор,
	|	МАКСИМУМ(РасчетыСКлиентами.Период)             КАК МаксимальныйПериод
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|ГДЕ
	|	РасчетыСКлиентами.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РезервированиеАвансаКлиента),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияОСсОтложеннымПереходомПрав),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности))
	|	И ТИПЗНАЧЕНИЯ(РасчетыСКлиентами.Регистратор) В (ТИП(Документ.РеализацияТоваровУслуг),
	|													ТИП(Документ.РеализацияУслугПрочихАктивов))
	|	И РасчетыСКлиентами.Сумма <> 0
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентами.Регистратор
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасчетыСКлиентами.Период) > 1");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыНакопления.РасчетыСКлиентами.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = ИСТИНА;
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.Сумма <> 0 Тогда
				Запись.Период = Выборка.МаксимальныйПериод;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

// Размер порции записи взаиморасчетов по умолчанию.
// 
// Возвращаемое значение:
//  Число - Количество одновременно записываемых записей регистров под одним служебным документом регистратором.
Функция РазмерПорцииЗаписи() Экспорт
	Возврат 1000;
КонецФункции

Процедура ЗаписатьПорционно(ТекущиеПеременные, ТаблицаЗаписей, НаборЗаписей) 
	
	ИмяРегистра = НаборЗаписей.Метаданные().Имя;
	
	Для Каждого РегистраторРасчетов Из ТекущиеПеременные["МассивЗадействованныхРегистраторов"+ИмяРегистра] Цикл
		
		НаборЗаписей.Отбор.Регистратор.Установить(РегистраторРасчетов);
		НаборЗаписей.Загрузить(ТаблицаЗаписей.Скопировать(Новый Структура("Регистратор", РегистраторРасчетов)));
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	Для Каждого СтрокаСвободныхРегистраторов Из ТекущиеПеременные["МассивСвободныхРегистраторов"+ИмяРегистра] Цикл
		
		Если СтрокаСвободныхРегистраторов.ТребуетсяОчистка Тогда
			ТекущийРегистратор = СтрокаСвободныхРегистраторов.Ссылка; // ДокументСсылка.РегистраторРасчетов
			НаборЗаписей.Отбор.Регистратор.Установить(ТекущийРегистратор);
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодготовитьДанныеДляЗаписи(ТекущиеПеременные, ТаблицаЗаписей, НаборЗаписей, ТаблицаСвободныхРегистраторов)
	РазмерПорцииЗаписи = РазмерПорцииЗаписи();
	ИмяРегистра = НаборЗаписей.Метаданные().Имя;
	
	МассивСвободныхРегистраторов = СвободныеРегистраторыРасчетов(ТекущиеПеременные, ИмяРегистра, ТаблицаЗаписей.Количество(), ТаблицаСвободныхРегистраторов);
	МассивЗадействованныхРегистраторов = Новый Массив;
	
	Если МассивСвободныхРегистраторов.Количество() > 0 Тогда
		
		ТекущаяСтрока = 1;
		ТекущийРегистратор = 0;
		
		МассивСвободныхРегистраторов[ТекущийРегистратор].ТребуетсяОчистка = Ложь;
		МассивЗадействованныхРегистраторов.Добавить(МассивСвободныхРегистраторов[ТекущийРегистратор].Ссылка);
		
		Для Каждого Строка Из ТаблицаЗаписей Цикл
			Если ТипЗнч(Строка.ДокументРегистратор) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
				Продолжить;
			КонецЕсли;
			Если ТекущаяСтрока > РазмерПорцииЗаписи Тогда
				ТекущаяСтрока = 1;
				ТекущийРегистратор = ТекущийРегистратор + 1;
				МассивСвободныхРегистраторов[ТекущийРегистратор].ТребуетсяОчистка = Ложь;
				МассивЗадействованныхРегистраторов.Добавить(МассивСвободныхРегистраторов[ТекущийРегистратор].Ссылка);
			КонецЕсли;
			Строка.Регистратор = МассивСвободныхРегистраторов[ТекущийРегистратор].Ссылка;
			
			ТекущаяСтрока = ТекущаяСтрока + 1;
		КонецЦикла;
		
	КонецЕсли;
	
	ТекущиеПеременные.Вставить("МассивСвободныхРегистраторов" + ИмяРегистра, МассивСвободныхРегистраторов);
	ТекущиеПеременные.Вставить("МассивЗадействованныхРегистраторов" + ИмяРегистра, МассивЗадействованныхРегистраторов);
КонецПроцедуры

// Находит неиспользуемые регистраторы расчетов и удаляет их
//
// Параметры:
//   Запрос - Запрос - Запрос с установленными параметрами.
//   ИмяРегистраРасчетов - Строка.
//   ИмяРегистраПланаОплат - Строка.
//   ИмяРегистраПланаОтгрузкиПоставки - Строка.
//
Процедура УдалитьНеиспользуемыеРегистраторыРасчетов(Запрос, ИмяРегистраРасчетов, ИмяРегистраПланаОплат, ИмяРегистраПланаОтгрузкиПоставки)
	
	Запрос.Текст = "
	|
	|ВЫБРАТЬ
	|	РегистраторРасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РегистраторРасчетов КАК РегистраторРасчетов
	|ГДЕ            
	|	РегистраторРасчетов.ОбъектРасчетов              = &ОбъектРасчетов
	|	И РегистраторРасчетов.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И РегистраторРасчетов.Валюта                    = &Валюта
	|	И РегистраторРасчетов.ТипРасчетов               = &ТипРасчетов
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			&ТаблицаПланаОплат КАК РасчетыПланОплат
	|		ГДЕ
	|			РасчетыПланОплат.Регистратор = РегистраторРасчетов.Ссылка
	|	)
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			&ТаблицаПланаОтгрузкиПоставки КАК РасчетыПланОтгрузокПоставок
	|		ГДЕ
	|			РасчетыПланОтгрузокПоставок.Регистратор = РегистраторРасчетов.Ссылка
	|	)
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			&ТаблицаРасчетов КАК РасчетыПоСрокам
	|		ГДЕ
	|			РасчетыПоСрокам.Регистратор = РегистраторРасчетов.Ссылка
	|	)
	|	
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ТаблицаРасчетов", "РегистрНакопления." + ИмяРегистраРасчетов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ТаблицаПланаОтгрузкиПоставки", "РегистрНакопления." + ИмяРегистраПланаОтгрузкиПоставки);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ТаблицаПланаОплат", "РегистрНакопления." + ИмяРегистраПланаОплат);
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект(); // ДокументОбъект.РегистраторРасчетов
		ДокументОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры

// Устарела.
Процедура РассчитатьВсе(ПараметрыВыполнения, АдресХранилища) Экспорт
	
	РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСКлиентами(ПараметрыВыполнения.ОкончаниеПериодаРасчета, Неопределено);
	РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСПоставщиками(ПараметрыВыполнения.ОкончаниеПериодаРасчета, Неопределено);
	
КонецПроцедуры

// Устарела. Находит по указанным параметрам корректировки регистров, очищает их и возвращает новую корректировку.
//
// Параметры:
//   ПериодКорректировки - Дата - Все корректировки позже этой даты будут очищены, а с равной датой еще и удалены.
//   Организация - СправочникСсылка.Организации.
//   Операция - ПеречислениеСсылка.ОперацииКорректировкиРегистров.
//
// Возвращаемое значение:
//   ДокументОбъект.КорректировкаРегистров - Пустой документ корректировки, с заполненными реквизитами.
//
Функция КорректировкаРегистров(ПериодКорректировки, Организация, Операция) Экспорт
	
	ВзаиморасчетыСлужебный.КорректировкаРегистров(ПериодКорректировки, Организация, Операция);
	
КонецФункции

// Сворачивает и оставляет только значимые изменения, возвращая таблицу 
// 
// Параметры:
//  МенеджерВременныхТаблиц - Неопределено, МенеджерВременныхТаблиц - Менеджер временных таблиц, содержащий временные таблицы "РасчетыСКлиентамиИзменения" или "РасчетыСПоставщикамиИзменения"
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. ТаблицаКРаспределению - Преобразовання таблица изменений в таблицу к распределению
Функция ТаблицаИзмененийДляПересчета(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТипыБезПроверкиИзменения", СписокТиповРегистраторовПланов());
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ТипРасчетов                      КАК ТипРасчетов,
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам        КАК АналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.ОбъектРасчетов                   КАК ОбъектРасчетов,
	|	ВложенныйЗапрос.Валюта                           КАК Валюта,
	|	МАКСИМУМ(ВложенныйЗапрос.ПоДаннымОбъектаРасчетовИсточника) КАК ПоДаннымОбъектаРасчетовИсточника,
	|	МИНИМУМ(ВложенныйЗапрос.ДатаНачалаПересчета)     КАК ДатаНачалаПересчета,
	|	МИНИМУМ(ВложенныйЗапрос.ПериодКонтроляИзмененийИСозданияЗаданий) КАК ПериодКонтроляИзмененийИСозданияЗаданий
	|ИЗ 
	|	&ТаблицаИзменений КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ТипРасчетов,
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.ОбъектРасчетов,
	|	ВложенныйЗапрос.Валюта
	|";
	
	ТекстыВложенногоЗапроса = Новый Массив;
	Если МенеджерВременныхТаблиц.Таблицы.Найти("РасчетыСКлиентамиИзменения") <> Неопределено Тогда
		
		ТекстыВложенногоЗапроса.Добавить("
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)                 КАК ТипРасчетов,
		|		Изменения.АналитикаУчетаПоПартнерам                                             КАК АналитикаУчетаПоПартнерам,
		|		Изменения.ОбъектРасчетов                                                        КАК ОбъектРасчетов,
		|		Изменения.Валюта                                                                КАК Валюта,
		|		Изменения.ПоДаннымОбъектаРасчетовИсточника                                      КАК ПоДаннымОбъектаРасчетовИсточника,
		|		НАЧАЛОПЕРИОДА(
		|			ВЫБОР КОГДА Изменения.Сумма = 0
		|					И (Изменения.КОплате <> 0 ИЛИ Изменения.КОтгрузке <> 0)
		|					И ТИПЗНАЧЕНИЯ(Изменения.Документ) <> ТИП(Документ.ВводОстатков)
		|					И ТИПЗНАЧЕНИЯ(Изменения.Документ) <> ТИП(Документ.ВводОстатковВзаиморасчетов)
		|				ТОГДА Изменения.ДатаРегистратора
		|				ИНАЧЕ Изменения.Период
		|			КОНЕЦ, ДЕНЬ)                                                                КАК ДатаНачалаПересчета,
		|		ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(Изменения.Документ) В (&ТипыБезПроверкиИзменения)
		|				ТОГДА ДАТАВРЕМЯ(3999,1,1)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.Период, ДЕНЬ)
		|		КОНЕЦ                                                                           КАК ПериодКонтроляИзмененийИСозданияЗаданий
		|	ИЗ
		|		РасчетыСКлиентамиИзменения КАК Изменения
		|	ГДЕ
		|		Изменения.Сумма <> 0 ИЛИ Изменения.СуммаРегл <> 0 ИЛИ Изменения.СуммаУпр<> 0 ИЛИ Изменения.КОплате <> 0 ИЛИ Изменения.КОтгрузке <> 0
		|
		|");
		
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("РасчетыСКлиентамиИзменения") <> Неопределено
		И МенеджерВременныхТаблиц.Таблицы.Найти("РасчетыСПоставщикамиИзменения") <> Неопределено Тогда
		ТекстыВложенногоЗапроса.Добавить("
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|");
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("РасчетыСПоставщикамиИзменения") <> Неопределено Тогда
		
		ТекстыВложенногоЗапроса.Добавить("
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)              КАК ТипРасчетов,
		|		Изменения.АналитикаУчетаПоПартнерам                                             КАК АналитикаУчетаПоПартнерам,
		|		Изменения.ОбъектРасчетов                                                        КАК ОбъектРасчетов,
		|		Изменения.Валюта                                                                КАК Валюта,
		|		Изменения.ПоДаннымОбъектаРасчетовИсточника                                      КАК ПоДаннымОбъектаРасчетовИсточника,
		|		НАЧАЛОПЕРИОДА(
		|			ВЫБОР КОГДА Изменения.Сумма = 0
		|					И (Изменения.КОплате <> 0 ИЛИ Изменения.КПоступлению <> 0)
		|					И ТИПЗНАЧЕНИЯ(Изменения.Документ) <> ТИП(Документ.ВводОстатков)
		|					И ТИПЗНАЧЕНИЯ(Изменения.Документ) <> ТИП(Документ.ВводОстатковВзаиморасчетов)
		|				ТОГДА Изменения.ДатаРегистратора
		|				ИНАЧЕ Изменения.Период
		|			КОНЕЦ, ДЕНЬ)                                                                КАК ДатаНачалаПересчета,
		|		ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(Изменения.Документ) В (&ТипыБезПроверкиИзменения)
		|				ТОГДА ДАТАВРЕМЯ(3999,1,1)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.Период, ДЕНЬ)
		|		КОНЕЦ                                                                           КАК ПериодКонтроляИзмененийИСозданияЗаданий
		|	ИЗ
		|		РасчетыСПоставщикамиИзменения КАК Изменения
		|	ГДЕ
		|		Изменения.Сумма <> 0 ИЛИ Изменения.СуммаРегл <> 0 ИЛИ Изменения.СуммаУпр<> 0 ИЛИ Изменения.КОплате <> 0 ИЛИ Изменения.КПоступлению <> 0
		|
		|");
		
	КонецЕсли;
	
	Если ТекстыВложенногоЗапроса.Количество() = 0 Тогда 
		Возврат ТаблицаКРаспределению(); 
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТаблицаИзменений", СтрШаблон("(%1)", СтрСоединить(ТекстыВложенногоЗапроса)));
	
	ТаблицаИзменений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаИзменений;
	
КонецФункции

// Усталела. Возвращает структуру параметров необходимых для регистрации документа к отложенному распределению расчетов.
// 
// Возвращаемое значение:
// 	Структура - Описание:
//  *ЭтоРасчетыСКлиентами - Булево - Истина если это расчеты с клиентами.
//  *ПереоценкаПоДням - Булево - Истина если необходимо переоценивать каждый день, иначе только по дням оплаты.
//  *ПерезаполнениеРегистровНУ - Булево - Истина если выполняется расчет курсовых по НУ.
//
Функция ПараметрыПереоценки(ЭтоРасчетыСКлиентами = Неопределено, ПереоценкаПоДням = Неопределено) Экспорт
	
	Возврат ВзаиморасчетыПереоценкаСервер.ПараметрыПереоценки(ЭтоРасчетыСКлиентами, ПереоценкаПоДням);
	
КонецФункции

// Усталела.
Процедура ПерезаполнитьОборотыНУ(Организация, Период, ЭтоРасчетыСКлиентами) Экспорт
	ПерезаполнитьОборотыНУ(Организация, Период, ЭтоРасчетыСКлиентами)
КонецПроцедуры

Функция СуммаСписания(Курс, СуммаВВалюте, СуммаВзаиморасчетов, СуммаКСписанию)
	
	Если СуммаКСписанию = СуммаВзаиморасчетов Тогда
		Возврат СуммаВВалюте;
	ИначеЕсли СуммаВВалюте = 0 Или СуммаВзаиморасчетов = 0 Тогда
		Возврат 0;
	Иначе
		Если Курс = 0 Тогда
			Если СуммаВВалюте > СуммаВзаиморасчетов Тогда
				Возврат Окр(СуммаВВалюте / СуммаВзаиморасчетов * СуммаКСписанию, 2);
			Иначе
				Возврат Окр(СуммаКСписанию / (СуммаВзаиморасчетов/СуммаВВалюте), 2);
			КонецЕсли;
		Иначе
			Возврат Окр(Курс * СуммаКСписанию,2);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Процедура СоздатьТаблицуДатЗаПериод(МенеджерВременныхТаблиц, ИмяВременнойТаблицы, ДатаНачала, ДатаОкончания)
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ ДатаНачала<Дата(1980,1,1) Тогда
		ВызватьИсключение(НСтр("ru = 'Не заполнена дата начала границы курсов.'"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ 0 КАК Шаг
	|ПОМЕСТИТЬ ТаблицаИсходныхЦифр
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ 1
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ 2
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ 3
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ 4
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ 5
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ 6
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ 7
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ 8
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ 9
	|ИНДЕКСИРОВАТЬ ПО
	|	Шаг
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИсходныхЦифр1.Шаг * 1000 + ТаблицаИсходныхЦифр2.Шаг * 100 + ТаблицаИсходныхЦифр3.Шаг * 10 + ТаблицаИсходныхЦифр4.Шаг КАК Счетчик
	|ПОМЕСТИТЬ ТаблицаСчетчик
	|ИЗ
	|	ТаблицаИсходныхЦифр КАК ТаблицаИсходныхЦифр1,
	|	ТаблицаИсходныхЦифр КАК ТаблицаИсходныхЦифр2,
	|	ТаблицаИсходныхЦифр КАК ТаблицаИсходныхЦифр3,
	|	ТаблицаИсходныхЦифр КАК ТаблицаИсходныхЦифр4
	|ГДЕ
	|	(ТаблицаИсходныхЦифр1.Шаг * 1000 + ТаблицаИсходныхЦифр2.Шаг * 100 + ТаблицаИсходныхЦифр3.Шаг * 10 + ТаблицаИсходныхЦифр4.Шаг) <= РАЗНОСТЬДАТ(&ДатаНачала,&ДатаОкончания,ДЕНЬ)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, ТаблицаСчетчик.Счетчик) КАК Дата
	|ПОМЕСТИТЬ ИмяВТ
	|ИЗ
	|	ТаблицаСчетчик КАК ТаблицаСчетчик
	|ИНДЕКСИРОВАТЬ ПО
	|	Дата
	|";
	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",НачалоДня(ДатаОкончания));
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ИмяВТ",ИмяВременнойТаблицы);
	Запрос.Выполнить();
	
КонецПроцедуры

// Устарела. Текст запроса получения количества записей в оперативных регистрах взаиморасчетов.
// 
// Параметры:
//  ИмяТаблицыДляОбработки - Строка - Имя временной таблицы:
// * АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам
// * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов
// * Валюта - СправочникСсылка.Валюты
// * ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами 
// 
// Возвращаемое значение:
//  Строка -  Текст запроса
//
Функция ТекстЗапросаКоличествоЗаписейВОперативныхРегистрахВзаиморасчетов(ИмяТаблицыДляОбработки) Экспорт

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВТДляОбработки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ВТДляОбработки.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ВТДляОбработки.Валюта КАК Валюта,
		|	СУММА(РегистрКоличествоЗаписей.КоличествоЗаписей) КАК КоличествоЗаписей
		|ИЗ
		|	ВтДанныеДляОбработки КАК ВТДляОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоЗаписейРегистраторовРасчетов КАК РегистрКоличествоЗаписей
		|		ПО ВТДляОбработки.АналитикаУчетаПоПартнерам = РегистрКоличествоЗаписей.АналитикаУчетаПоПартнерам
		|		И ВТДляОбработки.ОбъектРасчетов = РегистрКоличествоЗаписей.ОбъектРасчетов
		|		И ВТДляОбработки.Валюта = РегистрКоличествоЗаписей.Валюта
		|СГРУППИРОВАТЬ ПО
		|	ВТДляОбработки.АналитикаУчетаПоПартнерам,
		|	ВТДляОбработки.ОбъектРасчетов,
		|	ВТДляОбработки.Валюта";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВтДанныеДляОбработки КАК ВТДляОбработки", ИмяТаблицыДляОбработки + " КАК ВТДляОбработки");
	
	Возврат ТекстЗапроса;

КонецФункции

// Устарела. Сформировать порции обработки данных регистров расчета.
// 
// Параметры:
//  ДанныеКОбработке - ТаблицаЗначений - :
// * АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - 
// * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - 
// * Валюта - СправочникСсылка.Валюты - 
//  РазмерПорцииОбработкиЗаписей - Число - Число записей в порции для обработки
// 
// Возвращаемое значение:
//  Число - Количество порций
//
Функция СформироватьПорцииОбработкиДанныхРегистровВзаиморасчетов(ДанныеКОбработке, РазмерПорцииОбработкиЗаписей = 1000) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Данные.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Данные.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Данные.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВтДанныеДляОбработки
	|ИЗ
	|	&ДанныеКОбработке КАК Данные
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанныеДляОбработки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВтДанныеДляОбработки.Валюта КАК Валюта,
	|	ВтДанныеДляОбработки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА ОбъектыРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Договор)
	|			ТОГДА 100
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ВесовойКоэффициентОбработки
	|ИЗ
	|	ВтДанныеДляОбработки КАК ВтДанныеДляОбработки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ВтДанныеДляОбработки.ОбъектРасчетов = ОбъектыРасчетов.Ссылка";
	Запрос.УстановитьПараметр("ДанныеКОбработке", ДанныеКОбработке);
	ВесовыеКоэффициентыОбработкиЗаписей = Запрос.Выполнить().Выгрузить();
	ВесовыеКоэффициентыОбработкиЗаписей.Индексы.Добавить("АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта");
	
	Если ДанныеКОбработке.Колонки.Найти("ПорядокОбработки") = Неопределено Тогда
		ДанныеКОбработке.Колонки.Добавить("ПорядокОбработки", ОбщегоНазначения.ОписаниеТипаЧисло(15, 0));
		ДанныеКОбработке.Индексы.Добавить("ПорядокОбработки");
	КонецЕсли;
	
	РазмерТекущейПорции = 0;
	ПорядокОбработки = 1;
	
	Для Каждого ЗаписьКОбработке Из ДанныеКОбработке Цикл

		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("АналитикаУчетаПоПартнерам", ЗаписьКОбработке.АналитикаУчетаПоПартнерам);
		СтруктураОтбора.Вставить("ОбъектРасчетов", ЗаписьКОбработке.ОбъектРасчетов);
		СтруктураОтбора.Вставить("Валюта", ЗаписьКОбработке.Валюта);

		ЗаписиПоОбъектуРасчетов = ВесовыеКоэффициентыОбработкиЗаписей.НайтиСтроки(СтруктураОтбора);
		ВесовойКоэффициентОбработки = ?(ЗаписиПоОбъектуРасчетов.Количество() > 0,
			ЗаписиПоОбъектуРасчетов[0].ВесовойКоэффициентОбработки, 0);

		Если Не РазмерТекущейПорции = 0 И (РазмерТекущейПорции + ВесовойКоэффициентОбработки) > РазмерПорцииОбработкиЗаписей Тогда

			ПорядокОбработки = ПорядокОбработки + 1;
			РазмерТекущейПорции = 0;

		КонецЕсли;

		ЗаписьКОбработке.ПорядокОбработки = ПорядокОбработки;
		РазмерТекущейПорции = РазмерТекущейПорции + ВесовойКоэффициентОбработки;

	КонецЦикла;
	
	Возврат ПорядокОбработки;

КонецФункции

// Устарела. Очищает оперативные регистры взаиморасчетов и удаляет служебные регистраторы.
// 
// Параметры:
//  ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Объект расчетов
//  АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика учета по партнерам
Процедура ОчиститьРегистрыВзаиморасчетовИУдалитьСлужебныеРегистраторы(ОбъектРасчетов = Неопределено, АналитикаУчетаПоПартнерам = Неопределено) Экспорт
	
	ВзаиморасчетыСлужебный.ОчиститьРегистрыВзаиморасчетовИУдалитьСлужебныеРегистраторы(ОбъектРасчетов, АналитикаУчетаПоПартнерам);
	
КонецПроцедуры

Функция ТипЗаписиВзаиморасчетов(ЗаписьТаблицы)
	
	ЭтоПредоплата = (ЗаписьТаблицы.Предоплата <> Неопределено
			Или ЗаписьТаблицы.ПредоплатаУпр <> Неопределено
			Или ЗаписьТаблицы.ПредоплатаРегл <> Неопределено)
		И (ЗаписьТаблицы.Предоплата <> 0
			Или ЗаписьТаблицы.ПредоплатаУпр <> 0 
			Или ЗаписьТаблицы.ПредоплатаРегл <> 0);
	
	Возврат Перечисления.ТипыЗаписейВзаиморасчетов.ТипЗаписиПоОперации(
		ЗаписьТаблицы.ОперацияВзаиморасчетов,
		ЭтоПредоплата,
		ЗаписьТаблицы.ВидДвижения);
	
КонецФункции

Функция СписокТиповУточняющихПланы()
	СписокТиповРегистраторовПланов = Новый СписокЗначений;

	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОЗакупках"));
	
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ПриобретениеТоваровУслуг"));
	
	//Уточняют график договора
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ВыкупВозвратнойТарыКлиентом"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ВыкупТоваровХранителем"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.РеализацияУслугПрочихАктивов"));
	
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ОперацияСЭлектроннымБилетом"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ВыкупВозвратнойТарыУПоставщика"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ВыкупПринятыхНаХранениеТоваров"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ОтчетОСписанииТоваровСХранения"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ТаможеннаяДекларацияИмпорт"));
	
	Возврат СписокТиповРегистраторовПланов;
	
КонецФункции

#КонецОбласти

#Область ОбработчикОбновленияПоТипамЗаписейВзаиморасчетов

// Устарела. Удалить в следующей LTS. Заполняет в переданной строке движений поле ТипЗаписиВзаиморасчетов
//
// Параметры:
//  Запись - СтрокаТаблицыЗначений - движение по срокам
//  ТипРегистратора - Тип - Тип документа регистратора
//
Процедура ЗаполнитьТипЗаписиВзаиморасчетов(Запись, ТипРегистратора) Экспорт
	
	Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход И Не Запись.Сторно
		Или Запись.ВидДвижения = ВидДвиженияНакопления.Расход И Запись.Сторно Тогда
		Если Запись.Предоплата <> 0 Тогда
			Если (ЭтоКорректировкаЗадолженности(Запись.ХозяйственнаяОперация)
				И Не ТипРегистратора = Тип("ДокументСсылка.КорректировкаРеализации")
				И Не ТипРегистратора = Тип("ДокументСсылка.КорректировкаПриобретения"))
				Или ТипРегистратора = Тип("ДокументСсылка.КорректировкаЗадолженности")
				Или Не ЗначениеЗаполнено(Запись.ХозяйственнаяОперация)
				Или ТипРегистратора = Тип("ДокументСсылка.ОперацияСЭлектроннымБилетом")
					И Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗачетАвансаПоставщику Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеПредоплаты;
			ИначеЕсли ЭтоПереносВзаиморасчетов(Запись.ХозяйственнаяОперация)
				Или ТипРегистратора = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ПереносВзаиморасчетовУвеличениеПредоплаты;
			ИначеЕсли ЭтоКорректировкаНакладной(Запись.ХозяйственнаяОперация)
				Или ТипРегистратора = Тип("ДокументСсылка.КорректировкаРеализации")
				Или ТипРегистратора = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаНакладнойУвеличениеПредоплаты;
			ИначеЕсли ЭтоОплата(Запись.ХозяйственнаяОперация, Истина) Тогда 
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ОплатаУвеличениеПредоплаты;
			ИначеЕсли Запись.Сторно Или ТипРегистратора = Тип("ДокументСсылка.ОперацияСЭлектроннымБилетом")
				И (Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗачетАвансаКлиента
					Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗачетАвансаПоставщику) Тогда
				// Зачет оплаты, возникающий при сторно
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ПереносВзаиморасчетовУвеличениеПредоплаты;
			ИначеЕсли ТипЗнч(Запись.Регистратор) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеПредоплаты;
			Иначе
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеПредоплаты;
			КонецЕсли;
		ИначеЕсли Запись.Долг <> 0 Тогда 
			Если ЭтоВозвратДенежныхСредств(Запись.ХозяйственнаяОперация) Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ВозвратДенежныхСредствУвеличениеДолга;
			ИначеЕсли ЭтоПереносВзаиморасчетов(Запись.ХозяйственнаяОперация)
				Или ТипРегистратора = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ПереносВзаиморасчетовУвеличениеДолга;
			ИначеЕсли ЭтоОтгрузка(Запись.ХозяйственнаяОперация) Тогда 
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ОтгрузкаУвеличениеДолга;
			ИначеЕсли ЭтоКорректировкаНакладной(Запись.ХозяйственнаяОперация)
				Или ТипРегистратора = Тип("ДокументСсылка.КорректировкаРеализации")
				Или ТипРегистратора = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаНакладнойУвеличениеДолга;
			ИначеЕсли ЭтоКорректировкаЗадолженности(Запись.ХозяйственнаяОперация)
				Или ТипРегистратора = Тип("ДокументСсылка.КорректировкаЗадолженности")
				Или Не ЗначениеЗаполнено(Запись.ХозяйственнаяОперация) Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеДолга;
			ИначеЕсли Запись.Сторно Или ТипРегистратора = Тип("ДокументСсылка.ОперацияСЭлектроннымБилетом")
				И (Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗачетАвансаКлиента
					Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗачетАвансаПоставщику) Тогда
				// Зачет оплаты, возникающий при сторно
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ПереносВзаиморасчетовУвеличениеДолга;
			ИначеЕсли ТипЗнч(Запись.Регистратор) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеДолга;
			Иначе
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеДолга;
			КонецЕсли;
		ИначеЕсли Запись.ПредоплатаУпр <> 0 Или Запись.ПредоплатаРегл <> 0 Тогда
			Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеПредоплаты;
		Иначе
			Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУвеличениеДолга;
		КонецЕсли;
	Иначе
		Если Запись.Предоплата <> 0 Тогда
			Если ЭтоВозвратДенежныхСредств(Запись.ХозяйственнаяОперация) Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ВозвратДенежныхСредствУменьшениеПредоплаты;
			ИначеЕсли ЭтоКорректировкаЗадолженности(Запись.ХозяйственнаяОперация)
				Или ТипРегистратора = Тип("ДокументСсылка.КорректировкаЗадолженности")
				Или Не ЗначениеЗаполнено(Запись.ХозяйственнаяОперация) Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеПредоплаты;
			ИначеЕсли ЭтоПереносВзаиморасчетов(Запись.ХозяйственнаяОперация)
				Или ТипРегистратора = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ПереносВзаиморасчетовУменьшениеПредоплаты;
			ИначеЕсли ЭтоОтгрузка(Запись.ХозяйственнаяОперация) Тогда
				Если Запись.Сторно Тогда
					// Для сторно зачет оплаты отражаем как корректировку накладной
					Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаНакладнойУменьшениеПредоплаты;
				Иначе
					Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ОтгрузкаУменьшениеПредоплаты;
				КонецЕсли;
			ИначеЕсли ЭтоКорректировкаНакладной(Запись.ХозяйственнаяОперация) Тогда

				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ОтгрузкаУменьшениеПредоплаты;
			ИначеЕсли ТипЗнч(Запись.Регистратор) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаНакладнойУменьшениеПредоплаты;
			Иначе
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеПредоплаты;
			КонецЕсли;
		ИначеЕсли Запись.Долг <> 0 Тогда
			Если ЭтоВозвратДенежныхСредств(Запись.ХозяйственнаяОперация) Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ВозвратДенежныхСредствУменьшениеДолга;
			ИначеЕсли ЭтоОплата(Запись.ХозяйственнаяОперация)
				И Не ТипРегистратора = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") 
				И Не ТипРегистратора = Тип("ДокументСсылка.ВозвратТоваровПоставщику") 
				И Не ТипРегистратора = Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями")
				И НЕ ТипРегистратора = Тип("ДокументСсылка.КорректировкаЗадолженности")
				И НЕ ТипРегистратора = Тип("ДокументСсылка.КорректировкаРеализации") 
				И НЕ ТипРегистратора = Тип("ДокументСсылка.КорректировкаПриобретения") 
				И НЕ ТипРегистратора = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ОплатаУменьшениеДолга;
			ИначеЕсли ЭтоПереносВзаиморасчетов(Запись.ХозяйственнаяОперация)
				Или ТипРегистратора = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ПереносВзаиморасчетовУменьшениеДолга;
			ИначеЕсли ЭтоОтгрузка(Запись.ХозяйственнаяОперация) Тогда
				Если Запись.Сторно Тогда
					Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаНакладнойУменьшениеДолга;
				Иначе
					Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.ОтгрузкаУменьшениеДолга;
				КонецЕсли;
			ИначеЕсли ЭтоКорректировкаНакладной(Запись.ХозяйственнаяОперация)
				И НЕ ТипРегистратора = Тип("ДокументСсылка.КорректировкаЗадолженности")
				Или ТипРегистратора = Тип("ДокументСсылка.КорректировкаРеализации")
				Или ТипРегистратора = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаНакладнойУменьшениеДолга;
			ИначеЕсли ЭтоКорректировкаЗадолженности(Запись.ХозяйственнаяОперация)
				Или ТипРегистратора = Тип("ДокументСсылка.КорректировкаЗадолженности") 
				Или Не ЗначениеЗаполнено(Запись.ХозяйственнаяОперация) Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеДолга;
			ИначеЕсли ТипЗнч(Запись.Регистратор) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеДолга;
			Иначе
				Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеДолга;
			КонецЕсли;
		ИначеЕсли Запись.ПредоплатаУпр <> 0 Или Запись.ПредоплатаРегл <> 0 Тогда 
			Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеПредоплаты;
		Иначе
			Запись.ТипЗаписиВзаиморасчетов = Перечисления.ТипыЗаписейВзаиморасчетов.КорректировкаЗадолженностиУменьшениеДолга;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Устарела. Удалить в следующей LTS.
//
// Параметры:
//  ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации 
// 
// Возвращаемое значение:
//  Булево - Переданная хозяйственная операция это корректировка задолженности
Функция ЭтоКорректировкаЗадолженности(ХозяйственнаяОперация)
	
	Возврат 
		// Увеличение предоплаты
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль
		// Увеличение долга
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток
		// Корректировки
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КорректировкаЗадолженности
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НачислениеКредиторскойЗадолженности
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НачислениеДебиторскойЗадолженности
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПремийКлиентам
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтражениеПремииКлиентаРетроБонус
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПремийПоставщиков
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтражениеПремииПоставщикаРетроБонус
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет
		// Комиссионные вознаграждения
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомиссионера
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомитентом
		// Бронирования в части подотчетников
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратБронированияПодотчетногоЛица
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ШтрафыПриВозвратеБронированияПодотчетногоЛица
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратБронирования 
		// Сторно возврата бронирования
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноИспользованияБронированияПодотчетнымЛицом
		// Отражение зарплаты в финансовом учете
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеИзЗарплатыВСчетРеализацииСотруднику
		// Сторно
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВосстановлениеДолгаАвансаПриСторноВзаиморасчетов
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПерезачетДолгаПриСторноВзаиморасчетов
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПерезачетАвансаПриСторноВзаиморасчетов
	
КонецФункции

// Устарела. Удалить в следующей LTS.
//
// Параметры:
//  ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации 
// 
// Возвращаемое значение:
//  Булево - Переданная хозяйственная операция это корректировка накладной
Функция ЭтоКорректировкаНакладной(ХозяйственнаяОперация)
	
	Возврат 
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровЧерезКомиссионера
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратБронирования 
		// Возвраты товаров
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПогашениеЗадолженностиПоставщику
		// Отрицательные отчеты комитенту/комиссионера
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомитенту
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионера
		// Отрицательное отражение вознаграждения
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераКомиссия
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомитентуКомиссия
	
КонецФункции

// Устарела. Удалить в следующей LTS.
//
// Параметры:
//  ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации 
// 
// Возвращаемое значение:
//  Булево - Переданная хозяйственная операция это перенос взаиморасчетов
Функция ЭтоПереносВзаиморасчетов(ХозяйственнаяОперация)
	
	Возврат 
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтражениеОплатыЧерезКомиссионера
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереносАванса
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереносДолга
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереносПлатежаМеждуФилиалами
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РезервированиеАвансаКлиента
	
КонецФункции

// Устарела. Удалить в следующей LTS.
//
// Параметры:
//  ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации 
// 
// Возвращаемое значение:
//  Булево - Переданная хозяйственная операция это возврат денежных средств
Функция ЭтоВозвратДенежныхСредств(ХозяйственнаяОперация)
	
	Возврат 
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиентуНаПлатежнуюКарту
	
КонецФункции

// Устарела. Удалить в следующей LTS.
//
// Параметры:
//  ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации 
// 
// Возвращаемое значение:
//  Булево - Переданная хозяйственная операция это оплата
Функция ЭтоОплата(ХозяйственнаяОперация, ЭтоПриходПредоплаты=Ложь) Экспорт
	
	Возврат 
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеУПоставщика
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеЧерезАгента
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхДокументовПоставщику
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиентаПоПлатежнойКарте
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияПодарочныхСертификатов
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПогашениеЗадолженностиПоставщику
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ШтрафыПриВозвратеБронирования
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ШтрафыПриВозвратеБронированияПодотчетногоЛица
		// Ввод остатков
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковАвансовКлиентов
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковАвансовПоставщикам
		Или (ЭтоПриходПредоплаты
			И (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионера
				Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании
				Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомитенту
				Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомитентуОСписании))
	
КонецФункции

// Устарела. Удалить в следующей LTS.
//
// Параметры:
//  ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации 
// 
// Возвращаемое значение:
//  Булево - Переданная хозяйственная операция это отгрузка
Функция ЭтоОтгрузка(ХозяйственнаяОперация)Экспорт
	
	Возврат 
		// Увеличение долга
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеУПоставщика
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеЧерезАгента
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыкупПринятыхНаХранениеТоваров
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыкупТоваровДавальца
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыкупТоваровХранителем
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыкупТоваровПереработчиком
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуПоступлениеИзТоваровВПути
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетДавальцуМеждуОрганизациями
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациямиОСписании
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионера
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераКомиссия
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомитенту
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомитентуКомиссия
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомитентуОСписании
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОформлениеГТДБрокером
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОформлениеГТДСамостоятельно
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереходПраваСобственности
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхДокументовОтПоставщика
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика2_5
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчикаВСтранахЕАЭС2_5
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияВнеоборотныхАктивов
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияВРозницу
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияОСсОтложеннымПереходомПрав
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияУслугПоАренде
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровДавальцаНаРасходы
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеПринятыхТоваровНаРасходы
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ШтрафыПриВозвратеБронирования
		// Уменьшение предоплаты и долга
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗачетАвансаКлиента
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗачетАвансаПоставщику
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомиссионера
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомитенту
		// Ввод остатков
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковЗадолженностиКлиентов
		Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковЗадолженностиПоставщикам
	
КонецФункции

#КонецОбласти

// Распределять взаиморасчеты фоновым заданием.
// 
// Возвращаемое значение:
//  Булево - Распределять взаиморасчеты фоновым заданием
Функция РаспределятьВзаиморасчетыФоновымЗаданием() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.РаспределятьВзаиморасчетыФоновымЗаданием.Получить()
		И Не ОбщегоНазначения.ИнформационнаяБазаФайловая() И Не ОбщегоНазначения.РежимОтладки();

КонецФункции

// Возвращает условия, при которых распределение взаиморасчетов можно выполнять в транзакции проведения документа.
// 
// Возвращаемое значение:
//  Структура - Условия распределения взаиморасчетов в транзакции документа:
// * КоличествоЗаписейОстатков - Число - Количество записей остатков в регистре расчетов по срокам
// * КоличествоДокументовВпереди - Число - Количество регистраторов впереди относительно проводимого документа по регистру расчетов
Функция УсловияДляРаспределенияВзаиморасчетовВТранзакцииДокумента() Экспорт
	
	УсловияРаспределенияВТранзакции = Новый Структура;
	УсловияРаспределенияВТранзакции.Вставить("КоличествоЗаписейОстатков", 20);
	УсловияРаспределенияВТранзакции.Вставить("КоличествоДокументовВпереди", 10);
	
	Возврат УсловияРаспределенияВТранзакции;

КонецФункции

#КонецОбласти
