Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаТрН(Данные, Представление, СтандартнаяОбработка, "8");
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	МассивОбязательных.Добавить("ДатВрЗамен");
	//МассивОбязательных.Добавить("НаимДокументаОснованияПА");
	//МассивОбязательных.Добавить("НомерДокументаОснованияПА");
	//МассивОбязательных.Добавить("ДатаДокументаОснованияПА");
	//МассивОбязательных.Добавить("СтороныСоставителиДокументаОснованияПА");
	//МассивОбязательных.Добавить("АдрВыгруз");
	//МассивОбязательных.Добавить("ДатВрНовВыгрПА");
	//МассивОбязательных.Добавить("ДатВрПА");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("ДопРеквизитНовыйВодитель", "Новый водитель", "Кто будет новым Водителем", "Сотрудники и физические лица (Контур.Логистика)", 1));
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("ДопРеквизитНовоеТранспортноеСредство", "Новое транспортное средство", "Какое транспортное средство будет новым", "Транспортные средства (Контур.Логистика)", 1));
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("ДопРеквизитНовыйПрицеп", "Новый прицеп", "Какой прицеп будет на новом транспортном средстве", "Транспортные средства (Контур.Логистика)", 2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("ДокументЭТРН");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфЗамен");
	МассивКлючевых.Добавить("ВрИнфЗамен");
	
	МассивКлючевых.Добавить("ИдФайлПрвПрием");
	МассивКлючевых.Добавить("ДатФайлПрвПрием");
	МассивКлючевых.Добавить("ВрФайлПрвПрием");
	МассивКлючевых.Добавить("ЭППВ");
	
	МассивКлючевых.Добавить("Водитель");
	МассивКлючевых.Добавить("Водитель2");
	МассивКлючевых.Добавить("ТС");
	МассивКлючевых.Добавить("Прицеп");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиПредыдущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ДокументОбъектИлиСсылка.ДокументЭТРН, ТаблицаОшибок);
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		// TODO понять какие сценарии проверки входящего документа
		
	Иначе
		
		// TODO реализовать проверку документа
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул8, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ПроверитьОтметки(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ПроверитьТабЧастьНовыеВодители(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		ПроверитьТабЧастьПутевыеЛисты(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		ПроверитьТабЧастьНовыеТранспортныеСредства(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		ПроверитьТабЧастьНовыеПрицепы(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		ПроверитьТабЧастьДокументыОПередачеГруза(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ДокументЭТРН = Объект.ДокументЭТРН;
	
	Если НЕ ЗначениеЗаполнено(ДокументЭТРН)  Тогда
		
		ТекстОшибки = "Титул не привязан к Документу электронной транспортной накладной";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ДокументЭТРН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		// эту проверку удастся включить только после того как сервис начнет корректно выдавать статусы
		//ТекСтатус = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.ДокументЭТРН);
		//Если Не ЗначениеЗаполнено(ТекСтатус) ИЛИ ТекСтатус.Код <> "on-the-way" Тогда 
		//	
		//	ТекстОшибки = "Для заметы ТС и/или Водителя статус трн должен быть ""В пути""";
		//	КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		//	"", КатегорияОшибка, ТекстОшибки, "Проверить");
		//	
		//КонецЕсли;
		
		// TODO
		//Если Объект.ОтказВПриемке И не ЗначениеЗаполнено(СокрЛП(Объект.ПричОтк)) Тогда 
		//	
		//	ТекстОшибки = "Укажите причину отказа от приемки";
		//	КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		//	"ПричОтк", КатегорияОшибка, ТекстОшибки, "Указать");
		//	
		//КонецЕсли;
		
		ОбязательныеРеквизитыТРН = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МассивОбязательныхРеквизитов();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыТРН Цикл
			Если НЕ ЗначениеЗаполнено(ДокументЭТРН[ОбязательныйРевизит])  Тогда
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной транспортной накладной";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		// можно не проверять этрн - она была сформирована на этапе Т1
		// Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПроверитьКлючевыеРеквизитыЭтРН(ДокументЭТРН, ТаблицаОшибок);

	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЭППВ)  Тогда
		
		ТекстОшибки = "Не получена подпись перевозчика";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ЭПГО", КатегорияОшибка, ТекстОшибки, "Выполнить обмен");
	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ТрН_Титул8.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	// причина замены
	
	Если Не ЗначениеЗаполнено(Объект.ПричЗамТекст) 
		И Не ЗначениеЗаполнено(Объект.ИдДокПричЗам) 
		И Не ЗначениеЗаполнено(Объект.НаимДокПричЗам) 
		И Не ЗначениеЗаполнено(Объект.ДатаДокПричЗам) 
		И Не ЗначениеЗаполнено(Объект.СтороныСостДокПричЗам) 
		И Не ЗначениеЗаполнено(Объект.ДопСостДокПричЗам) Тогда 
		
		ТекстОшибки = "Укажите причину замены: Текст ИЛИ Идентификатор ИЛИ Наименование, Номер, Дату и Составителей документа-основания причины замены.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"НаимДокПричЗам", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.ПричЗамТекст)
		И Не ЗначениеЗаполнено(Объект.ИдДокПричЗам) 
		И (ЗначениеЗаполнено(Объект.НаимДокПричЗам)
		Или ЗначениеЗаполнено(Объект.НомерДокПричЗам) 
		Или ЗначениеЗаполнено(Объект.ДатаДокПричЗам)
		Или ЗначениеЗаполнено(Объект.ДопСведДокПричЗам)
		Или ЗначениеЗаполнено(Объект.СтороныСостДокПричЗам) 
		Или ЗначениеЗаполнено(Объект.ДопСостДокПричЗам)) Тогда	
			
		Если Не ЗначениеЗаполнено(Объект.НаимДокПричЗам) Тогда 
			
			ТекстОшибки = "Укажите наименование Документа-основания причины замены.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"НаимДокПричЗам", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ДатаДокПричЗам) Тогда 
			
			ТекстОшибки = "Укажите дату Документа-основания причины замены.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"ДатаДокПричЗам", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.СтороныСостДокПричЗам) И Не ЗначениеЗаполнено(Объект.ДопСостДокПричЗам) Тогда 
			
			ТекстОшибки = "Укажите стороны составители или доп.составителя Документа-основания причины замены.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"СтороныСостДокПричЗам", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.НовыеВодители) 
		И  Не ЗначениеЗаполнено(Объект.ЗаменТС) Тогда 
		
		ТекстОшибки = "Укажите замену водителя или замену транспортного средства.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"СтраницаЗаменаВодителей", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;	
	
	// Замены водителей
	
	Если Объект.НовыеВодители.Количество() = 1 Тогда  
		
		Если Не ЗначениеЗаполнено(Объект.НовыеВодители[0].Водитель) Тогда 
		
			ТекстОшибки = "Укажите нового водителя.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"НовыйВодитель", КатегорияОшибка, ТекстОшибки, "Указать");
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.НовыеВодители[0].Водитель) Тогда
			ПроверитьВодителя(Объект.НовыеВодители[0].Водитель, ТаблицаОшибок, КатегорияОшибка);
		КонецЕсли;
		
	КонецЕсли;	
	
	ПроверитьДокументОснование(Объект.ПутевыеЛисты, ТаблицаОшибок, КатегорияОшибка, "путевого листа"); 
		
	// Замена ТС
	
	Если Объект.НовыеТранспортныеСредства.Количество() = 1 Тогда  
		
		Если Не ЗначениеЗаполнено(Объект.НовыеТранспортныеСредства[0].ТранспортноеСредство) Тогда 
		
			ТекстОшибки = "Укажите новое транспортное средство.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"НовоеТС", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.НовыеТранспортныеСредства[0].ТранспортноеСредство) 
			И Не ЗначениеЗаполнено(Объект.НовыеТранспортныеСредства[0].ТранспортноеСредство.ВидВладения) Тогда 
			
			ТекстОшибки = "Укажите вид владения транспортным средством";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"НовыеТранспортныеСредства.ТранспортноеСредство.ВидВладения", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если Объект.НовыеПрицепы.Количество() = 1 Тогда 
		
		Если Не ЗначениеЗаполнено(Объект.НовыеПрицепы[0].Прицеп) Тогда 
		
			ТекстОшибки = "Укажите новый прицеп.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"НовыйПрицеп", КатегорияОшибка, ТекстОшибки, "Указать");
		КонецЕсли;
		
	КонецЕсли;
	
	// документ передачи груза в другое ТС
	
	ПроверитьДокументОснование(Объект.ДокументыОПередачеГруза, ТаблицаОшибок, КатегорияОшибка, "документа-основния передачи груза в другое ТС", "ПерГр");
	
	// Провдение документа основания
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
	
	// специальные условия движения
	
	Если Объект.СпецУсловияДвижения.Количество() = 1 
		И Не ЗначениеЗаполнено(Объект.СпецУсловияДвижения[0].ИдСР) 
		И Не ЗначениеЗаполнено(Объект.СпецУсловияДвижения[0].НомСР) 
		И Не ЗначениеЗаполнено(Объект.СпецУсловияДвижения[0].ДатаСР) 
		И Не ЗначениеЗаполнено(Объект.СпецУсловияДвижения[0].СрокСР) Тогда 
		
		ТекстОшибки = "Укажите Идентификатор ИЛИ Номер, Дату и Срок специального условия движения.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"НомСР", КатегорияОшибка, ТекстОшибки, "Указать");
						
	КонецЕсли;	
	
	Если Объект.СпецУсловияДвижения.Количество() = 1
		И Не ЗначениеЗаполнено(Объект.СпецУсловияДвижения[0].ИдСР) 
		И (ЗначениеЗаполнено(Объект.СпецУсловияДвижения[0].НомСР) 
		Или ЗначениеЗаполнено(Объект.СпецУсловияДвижения[0].ДатаСР)
		Или ЗначениеЗаполнено(Объект.СпецУсловияДвижения[0].СрокСР)) Тогда	
			
		Если Не ЗначениеЗаполнено(Объект.СпецУсловияДвижения[0].НомСР) Тогда 
			
			ТекстОшибки = "Укажите Номер специального условия движения.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"НомСР", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.СпецУсловияДвижения[0].ДатаСР) Тогда 
			
			ТекстОшибки = "Укажите Дату специального условия движения.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"ДатаСР", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.СпецУсловияДвижения[0].СрокСР) Тогда 
			
			ТекстОшибки = "Укажите Срок специального условия движения.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"СрокСР", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
			
	КонецЕсли;
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьОтметки(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка 		= Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ИмяТЧ = "ОтметЗам";
	
	Для Каждого Отметка Из Объект.ОтметЗам Цикл 
		
		ТекущийНомерСтроки = Отметка.НомерСтроки;
		
		Если Не ЗначениеЗаполнено(Отметка.ДатаИВремяОтметки) Тогда
			
			ТекстОшибки = "Укажите Дату отметки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ДатаИВремяОтметки", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Отметка.ОписаниеОбстоятельств) Тогда
			
			ТекстОшибки = "Укажите Описание обстоятельств отметки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОписаниеОбстоятельств", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать описание обстоятельств");
			
		КонецЕсли;
				
		НайденныеАкты = Объект.Акты.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", Отметка.ИдентификаторСтроки)); 
		Для Каждого Акт Из НайденныеАкты Цикл 
						
			Если Не ЗначениеЗаполнено(Акт.АктИдДок) 
				И Не ЗначениеЗаполнено(Акт.АктНаименование) 
				И Не ЗначениеЗаполнено(Акт.АктДата) 
				И Не ЗначениеЗаполнено(Акт.СтороныСоставители) 
				И Не ЗначениеЗаполнено(Акт.ДополнительныйСоставитель) Тогда 
				
				ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей Акта для Отметки №" + ТекущийНомерСтроки;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование акта");
								
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(Акт.АктИдДок) 
				И (ЗначениеЗаполнено(Акт.АктНаименование)
				Или ЗначениеЗаполнено(Акт.АктНомер) 
				Или ЗначениеЗаполнено(Акт.АктДата)
				Или ЗначениеЗаполнено(Акт.АктДопСведДок)
				Или ЗначениеЗаполнено(Акт.СтороныСоставители) 
				Или ЗначениеЗаполнено(Акт.ДополнительныйСоставитель)) Тогда	
					
				Если Не ЗначениеЗаполнено(Акт.АктНаименование) Тогда 
					
					ТекстОшибки = "Укажите Наименование акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование акта");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Акт.АктДата) Тогда 
					
					ТекстОшибки = "Укажите Дату акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктДата", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату акта");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Акт.СтороныСоставители) 
					И Не ЗначениеЗаполнено(Акт.ДополнительныйСоставитель) Тогда 
					
					ТекстОшибки = "Укажите Стороны составители или Доп.составителя акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"СтороныСоставители", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать стороны составители акта");
					
				КонецЕсли;
					
			КонецЕсли;
					
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ПроверитьВодителя(Водитель, ТаблицаОшибок, КатегорияОшибка, СтрокаДопВодитель = Неопределено)
	
	Если ЗначениеЗаполнено(Водитель) Тогда
				
		НомерСтроки = ?(СтрокаДопВодитель = Неопределено, "", СтрокаДопВодитель.НомерСтроки);
		ИмяТЧ 		= ?(СтрокаДопВодитель = Неопределено, "", "ДополнительныеВодители");
		
		ПрефВодителя	= ?(СтрокаДопВодитель = Неопределено, " ", " Дополнительного ");
		
		Если Не ЗначениеЗаполнено(Водитель.ТелефонОсновной) Тогда
			
			ТекстОшибки = "Укажите телефон" + ПрефВодителя + "водителя";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
				"НовыеВодители.Водитель.ТелефонОсновной", КатегорияОшибка, ТекстОшибки, "Указать");
			                    
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Водитель.ИНН) 
			И Не ЗначениеЗаполнено(Водитель.ВУДатаВыдачи) 
			И Не ЗначениеЗаполнено(Водитель.ВУНомер)
			И Не ЗначениеЗаполнено(Водитель.ВУСерия) Тогда
			
			ТекстОшибки = "Не запонен ИНН" + ПрефВодителя + "водителя или дата выдачи, серия и номер водительского удостоверения";
				
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
				"НовыеВодители.Водитель.ИНН", КатегорияОшибка, ТекстОшибки, "Указать ИНН");	
			
		ИначеЕсли Не ЗначениеЗаполнено(Водитель.ИНН) Тогда 
			
			Если Не ЗначениеЗаполнено(Водитель.ВУДатаВыдачи) Тогда			
				ТекстОшибки = "Укажите у" + ПрефВодителя + "водителя дату выдачи ВУ";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
					"НовыеВодители.Водитель.ВУДатаВыдачи", КатегорияОшибка, ТекстОшибки, "Указать");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Водитель.ВУНомер) Тогда
				ТекстОшибки = "Укажите у" + ПрефВодителя + "водителя номер ВУ";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
					"НовыеВодители.Водитель.ВУНомер", КатегорияОшибка, ТекстОшибки, "Указать");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Водитель.ВУСерия) Тогда				
				ТекстОшибки = "Укажите у" + ПрефВодителя + "водителя серию ВУ";				
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
					"НовыеВодители.Водитель.ВУСерия", КатегорияОшибка, ТекстОшибки, "Указать");				
			КонецЕсли;	
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Водитель.ИНН) Тогда 
			
			ТекстОшибки = Справочники.КонтурЛогистика_Сотрудники.ТекстОшибкиПроверкиИНН(Водитель.ИНН);
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
				
			    КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, НомерСтроки, 
					"НовыеВодители.Водитель.ИНН", КатегорияОшибка, "Укажите верный ИНН" + ПрефВодителя + "водителя. " + ТекстОшибки, "Указать");
				
			КонецЕсли;
					
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверитьДокументОСнование(ОбъектДокумента, ТаблицаОшибок, КатегорияОшибка, ПостфиксОшибки, Постфикс = "")
	
	Если ОбъектДокумента.Количество() = 1 
		И Не ЗначениеЗаполнено(ОбъектДокумента[0]["ИдДок" + Постфикс]) 
		И Не ЗначениеЗаполнено(ОбъектДокумента[0]["НаимДок" + Постфикс]) 
		И Не ЗначениеЗаполнено(ОбъектДокумента[0]["ДатаДок" + Постфикс]) 
		И Не ЗначениеЗаполнено(ОбъектДокумента[0]["СтороныСостДок" + Постфикс]) 
		И Не ЗначениеЗаполнено(ОбъектДокумента[0]["ДопСостДок" + Постфикс]) Тогда 
		
		ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей " + ПостфиксОшибки + ".";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"НаимДок" + Постфикс, КатегорияОшибка, ТекстОшибки, "Указать");
						
	КонецЕсли;	
	
	Если ОбъектДокумента.Количество() = 1
		И Не ЗначениеЗаполнено(ОбъектДокумента[0]["ИдДок" + Постфикс]) 
		И (ЗначениеЗаполнено(ОбъектДокумента[0]["НаимДок" + Постфикс])
		Или ЗначениеЗаполнено(ОбъектДокумента[0]["НомерДок" + Постфикс]) 
		Или ЗначениеЗаполнено(ОбъектДокумента[0]["ДатаДок" + Постфикс])
		Или ЗначениеЗаполнено(ОбъектДокумента[0]["ДопСведДок" + Постфикс])
		Или ЗначениеЗаполнено(ОбъектДокумента[0]["СтороныСостДок" + Постфикс]) 
		Или ЗначениеЗаполнено(ОбъектДокумента[0]["ДопСостДок" + Постфикс])) Тогда	
			
		Если Не ЗначениеЗаполнено(ОбъектДокумента[0]["НаимДок" + Постфикс]) Тогда 
			
			ТекстОшибки = "Укажите наименование " + ПостфиксОшибки + ".";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"НаимДок" + Постфикс, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОбъектДокумента[0]["ДатаДок" + Постфикс]) Тогда 
			
			ТекстОшибки = "Укажите дату " + ПостфиксОшибки + ".";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"ДатаДок" + Постфикс, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОбъектДокумента[0]["СтороныСостДок" + Постфикс]) 
			И Не ЗначениеЗаполнено(ОбъектДокумента[0]["ДопСостДок" + Постфикс]) Тогда 
			
			ТекстОшибки = "Укажите стороны составители или доп.составителя " + ПостфиксОшибки + ".";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"СтороныСост" + Постфикс, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПроверитьТабЧастьНовыеВодители(Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ИмяТЧ = "НовыеВодители";	

	Если Объект.НовыеВодители.Количество() > 1 Тогда 
		
		Для Каждого СтрокаТЧ Из Объект.НовыеВодители Цикл  
			
			ТекущийНомерСтроки = СтрокаТЧ.НомерСтроки;
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Водитель) Тогда
				
				ТекстОшибки = "Укажите Нового водителя";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
						"Водитель", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать нового водителя");
				
			КонецЕсли;
						
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдДокПерГрВод) 
				И (ЗначениеЗаполнено(СтрокаТЧ.НаимДокПерГрВод)
				Или ЗначениеЗаполнено(СтрокаТЧ.НомерДокПерГрВод) 
				Или ЗначениеЗаполнено(СтрокаТЧ.ДатаДокПерГрВод)
				Или ЗначениеЗаполнено(СтрокаТЧ.ДопСведДокПерГрВод)
				Или ЗначениеЗаполнено(СтрокаТЧ.СтороныСостДокПерГрВод) 
				Или ЗначениеЗаполнено(СтрокаТЧ.ДопСостДокПерГрВод)) Тогда	
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.НаимДокПерГрВод) Тогда 
					
					ТекстОшибки = "Укажите наименование Документа-основания передачи груза новому водителю.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
							"НаимДокПерГрВод", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование Док. передачи груза новому водителю");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаДокПерГрВод) Тогда 
					
					ТекстОшибки = "Укажите дату Документа-основания передачи груза новому водителю.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
							"ДатаДокПерГрВод", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату Док. передачи груза новому водителю");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.СтороныСостДокПерГрВод) И Не ЗначениеЗаполнено(СтрокаТЧ.ДопСостДокПерГрВод) Тогда 
					
					ТекстОшибки = "Укажите стороны составители или доп.составителя Документа-основания передачи груза новому водителю.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
							"СтороныСостДокПерГрВод", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать стороны составители или доп.составителя Док. передачи груза новому водителю");
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверитьТабЧастьПутевыеЛисты(Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ИмяТЧ = "ПутевыеЛисты";	

	Если Объект.ПутевыеЛисты.Количество() > 1 Тогда 
		
		Для Каждого СтрокаТЧ Из Объект.ПутевыеЛисты Цикл  
			
			ТекущийНомерСтроки = СтрокаТЧ.НомерСтроки;
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдДок) 
				И Не ЗначениеЗаполнено(СтрокаТЧ.НаимДок) 
				И Не ЗначениеЗаполнено(СтрокаТЧ.ДатаДок) 
				И Не ЗначениеЗаполнено(СтрокаТЧ.СтороныСостДок) 
				И Не ЗначениеЗаполнено(СтрокаТЧ.ДопСостДок) Тогда 
				
				ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей путевого листа.";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
							"НаимДок", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать Идентификатор или Данные путевого листа");
				
			КонецЕсли;
	
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдДок) 
				И (ЗначениеЗаполнено(СтрокаТЧ.НаимДок)
				Или ЗначениеЗаполнено(СтрокаТЧ.НомерДок) 
				Или ЗначениеЗаполнено(СтрокаТЧ.ДатаДок)
				Или ЗначениеЗаполнено(СтрокаТЧ.ДопСведДок)
				Или ЗначениеЗаполнено(СтрокаТЧ.СтороныСостДок) 
				Или ЗначениеЗаполнено(СтрокаТЧ.ДопСостДок)) Тогда	
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.НаимДок) Тогда 
					
					ТекстОшибки = "Укажите наименование Документа-основания передачи груза новому водителю.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
							"НаимДок", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование путевого листа");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаДок) Тогда 
					
					ТекстОшибки = "Укажите дату путевого листа.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
							"ДатаДок", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату путевого листа");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.СтороныСостДок) И Не ЗначениеЗаполнено(СтрокаТЧ.ДопСостДок) Тогда 
					
					ТекстОшибки = "Укажите стороны составители или доп.составителя путевого листа.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
							"СтороныСостДок", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать стороны составители или доп.составителя путевого листа");
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьТабЧастьНовыеТранспортныеСредства(Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ИмяТЧ = "НовыеТранспортныеСредства";	

	Если Объект.НовыеТранспортныеСредства.Количество() > 1 Тогда 
		
		Для Каждого СтрокаТЧ Из Объект.НовыеТранспортныеСредства Цикл  
			
			ТекущийНомерСтроки = СтрокаТЧ.НомерСтроки;
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ТранспортноеСредство) Тогда 
				
				ТекстОшибки = "Укажите новое транспортное средство.";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
						"ТранспортноеСредство", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать новое ТС");
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьТабЧастьНовыеПрицепы(Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ИмяТЧ = "НовыеПрицепы";	

	Если Объект.НовыеПрицепы.Количество() > 1 Тогда 
		
		Для Каждого СтрокаТЧ Из Объект.НовыеПрицепы Цикл  
			
			ТекущийНомерСтроки = СтрокаТЧ.НомерСтроки;
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Прицеп) Тогда 
				
				ТекстОшибки = "Укажите новый прицеп.";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
						"Прицеп", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать новый прицеп");
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСпецУсловияДвижения(Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ИмяТЧ = "СпецУсловияДвижения";	

	Если Объект.СпецУсловияДвижения.Количество() > 1 Тогда 
		
		Для Каждого СтрокаТЧ Из Объект.СпецУсловияДвижения Цикл  
			
			ТекущийНомерСтроки = СтрокаТЧ.НомерСтроки;
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдСР) 
				И Не ЗначениеЗаполнено(СтрокаТЧ.НомСР) 
				И Не ЗначениеЗаполнено(СтрокаТЧ.ДатаСР) 
				И Не ЗначениеЗаполнено(СтрокаТЧ.СрокСР) Тогда 
				
				ТекстОшибки = "Укажите Идентификатор ИЛИ Номер, Дату и Срок специального условия движения.";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
							"НомСР", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать Идентификатор ИЛИ Номер, Дату и Срок специального условия движения");
								
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдСР) 
				И (ЗначениеЗаполнено(СтрокаТЧ.НомСР) 
				Или ЗначениеЗаполнено(СтрокаТЧ.ДатаСР)
				Или ЗначениеЗаполнено(СтрокаТЧ.СрокСР)) Тогда	
					
				Если Не ЗначениеЗаполнено(СтрокаТЧ.НомСР) Тогда 
					
					ТекстОшибки = "Укажите Номер специального условия движения.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
								"НомСР", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать Номер специального условия движения");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаСР) Тогда 
					
					ТекстОшибки = "Укажите Дату специального условия движения.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
								"ДатаСР", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать Дату специального условия движения");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.СрокСР) Тогда 
					
					ТекстОшибки = "Укажите Срок специального условия движения.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
								"СрокСР", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Укажить Срок специального условия движения");
					
				КонецЕсли;
					
			КонецЕсли;
						
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьТабЧастьДокументыОПередачеГруза(Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ИмяТЧ = "ДокументыОПередачеГруза";	

	Если Объект.ДокументыОПередачеГруза.Количество() > 1 Тогда 
		
		Для Каждого СтрокаТЧ Из Объект.ДокументыОПередачеГруза Цикл  
			
			ТекущийНомерСтроки = СтрокаТЧ.НомерСтроки;
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдДокПерГр) 
				И Не ЗначениеЗаполнено(СтрокаТЧ.НаимДокПерГр) 
				И Не ЗначениеЗаполнено(СтрокаТЧ.ДатаДокПерГр) 
				И Не ЗначениеЗаполнено(СтрокаТЧ.СтороныСостДокПерГр) 
				И Не ЗначениеЗаполнено(СтрокаТЧ.ДопСостДокПерГр) Тогда 
				
				ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей док. передачи груза в новое ТС.";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
							"НаимДокПерГр", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать Идентификатор или Данные док. передачи груза в новое ТС");
				
			КонецЕсли;
	
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдДокПерГр) 
				И (ЗначениеЗаполнено(СтрокаТЧ.НаимДокПерГр)
				Или ЗначениеЗаполнено(СтрокаТЧ.НомерДокПерГр) 
				Или ЗначениеЗаполнено(СтрокаТЧ.ДатаДокПерГр)
				Или ЗначениеЗаполнено(СтрокаТЧ.ДопСведДокПерГр)
				Или ЗначениеЗаполнено(СтрокаТЧ.СтороныСостДокПерГр) 
				Или ЗначениеЗаполнено(СтрокаТЧ.ДопСостДокПерГр)) Тогда	
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.НаимДокПерГр) Тогда 
					
					ТекстОшибки = "Укажите наименование док. передачи груза в новое ТС.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
							"НаимДокПерГр", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование док. передачи груза в новое ТС");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаДокПерГр) Тогда 
					
					ТекстОшибки = "Укажите дату док. передачи груза в новое ТС.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
							"ДатаДокПерГр", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату док. передачи груза в новое ТС");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТЧ.СтороныСостДокПерГр) И Не ЗначениеЗаполнено(СтрокаТЧ.ДопСостДокПерГр) Тогда 
					
					ТекстОшибки = "Укажите стороны составители или доп.составителя док. передачи груза в новое ТС.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
							"СтороныСостДокПерГр", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать стороны составители или доп.составителя док. передачи груза в новое ТС");
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ТрН_Титул8.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

Функция ВсеЗамены(ДокументЭТрНСсылка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул8.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул8 КАК КонтурЛогистика_ТрН_Титул8
	|ГДЕ
	|	НЕ КонтурЛогистика_ТрН_Титул8.ПометкаУдаления
	|	И КонтурЛогистика_ТрН_Титул8.ДокументЭТРН = &ДокументЭТРН
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтурЛогистика_ТрН_Титул8.Дата";
	
	Запрос.УстановитьПараметр("ДокументЭТРН", ДокументЭТрНСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПоследняяЗамена(ДокументЭТРНСсылка, ИмяТЧ) Экспорт
	
	НайденныйТ8 = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КонтурЛогистика_ТрН_Титул8НовыеПрицепы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.КонтурЛогистика_ТрН_Титул8.НовыеПрицепы КАК КонтурЛогистика_ТрН_Титул8НовыеПрицепы
	               |ГДЕ
	               |	НЕ КонтурЛогистика_ТрН_Титул8НовыеПрицепы.Ссылка.ПометкаУдаления
	               |	И КонтурЛогистика_ТрН_Титул8НовыеПрицепы.Ссылка.ДокументЭТРН = &ДокументЭТРН
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КонтурЛогистика_ТрН_Титул8НовыеПрицепы.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументЭТРН", ДокументЭТРНСсылка);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НовыеПрицепы", ИмяТЧ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НайденныйТ8 = Выборка.Ссылка;	
	КонецЕсли;	
	
	Возврат НайденныйТ8;
	
КонецФункции

#КонецЕсли