
// Заполнение списка

Процедура ПерезаполнитьРегламентныеЗадания() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегламентныеЗаданияПодсистемы.Очистить();
	
	Попытка
		
		Регламентные = КонтурЛогистика_Привилегированный.ПолучитьРегламентныеЗадания();
		
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		Сообщить(ПодробноеПредставлениеОшибки(Инфо));
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
		
	КонецПопытки;
	
	Для Каждого Регламентное Из Регламентные Цикл
		
		Если Найти(СтрЗаменить(СтрЗаменить(Регламентное.Метаданные.Имя, ".", ""), " ", ""), "КонтурЛогистика") = 0 
			И Найти(СтрЗаменить(СтрЗаменить(Регламентное.Наименование, ".", ""), " ", ""), "КонтурЛогистика") = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = РегламентныеЗаданияПодсистемы.Добавить();
		НоваяСтрока.ИмяМетаданных = Регламентное.Метаданные.Имя;
		НоваяСтрока.Наименование = Регламентное.Наименование;
		НоваяСтрока.Ключ = Регламентное.Ключ;
		НоваяСтрока.Расписание = Регламентное.Расписание;
		НоваяСтрока.Использование = Регламентное.Использование;
		НоваяСтрока.Идентификатор = Регламентное.УникальныйИдентификатор;
		НоваяСтрока.Пользователь = Регламентное.ИмяПользователя;
		
		Если Регламентное.Использование Тогда // незачем тратить время на отключенные
			Попытка
				ПоследнееЗадание = Регламентное.ПоследнееЗадание;
				Если ПоследнееЗадание <> Неопределено Тогда 
					НоваяСтрока.Выполнялось = Строка(ПоследнееЗадание.Начало);
					НоваяСтрока.Состояние = Строка(ПоследнееЗадание.Состояние);
				КонецЕсли;
			Исключение
					НоваяСтрока.Состояние = "Неизвестно";
			КонецПопытки;
		Иначе
			НоваяСтрока.Состояние = "Отключено";
		КонецЕсли;
		
	КонецЦикла;
	
	РегламентныеЗаданияПодсистемы.Сортировать("ИмяМетаданных");
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ПерезаполнитьФоновыеЗадания() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если МинутНазадФоновые = 0 Тогда 
		МинутНазадФоновые = Обработки.КонтурЛогистика_ФоновыеИРегламентныеЗадания.ПоказыватьФоновыеПоУмолчаниюМинутНазад();
	КонецЕсли;
	
	ФоновыеЗаданияПодсистемы.Очистить();
	
	Отбор = Новый Структура("Начало", ТекущаяДата() - МинутНазадФоновые * 60);
	// TODO установить отбор по подсистеме
	
	Попытка
		Фоновые = КонтурЛогистика_Привилегированный.ФЗ_ПолучитьФоновыеЗадания(Отбор);
		//Фоновые = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Исключение
		Инфо = ИнформацияОбОшибке();
		Сообщить(ПодробноеПредставлениеОшибки(Инфо));
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;
	КонецПопытки;
	
	Для Каждого Фоновое из Фоновые Цикл
		
		Если ОтображатьТолькоФоновыеКонтурЛогистика = Истина
			И Лев(Фоновое.ИмяМетода, 15) <> "КонтурЛогистика" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОтображатьТолькоАварии = Истина
			И Фоновое.Состояние <> СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ФоновыеЗаданияПодсистемы.Добавить();
		
		Если ФоновыеЗаданияПодсистемы.Индекс(НоваяСтрока) < 100 Тогда // первые 30
			
			РегламентноеЗадание = Фоновое.РегламентноеЗадание;
			Если РегламентноеЗадание <> Неопределено Тогда
				НоваяСтрока.РегламентноеЗадание = РегламентноеЗадание.Метаданные.Имя;
			КонецЕсли;
			НоваяСтрока.Сообщения = Фоновое.ПолучитьСообщенияПользователю().Количество();
		//Иначе
		//	НоваяСтрока.РегламентноеЗадание = Фоновое.УникальныйИдентификатор;
		КонецЕсли;
			
		НоваяСтрока.Наименование = Фоновое.Наименование;
		НоваяСтрока.Ключ 		= Фоновое.Ключ;
		НоваяСтрока.ИмяМетода 	= Фоновое.ИмяМетода;
		НоваяСтрока.Состояние 	= Фоновое.Состояние;
		НоваяСтрока.Начало 		= Фоновое.Начало;
		НоваяСтрока.Окончание 	= Фоновое.Конец;
		
		Если ЗначениеЗаполнено(Фоновое.Конец) Тогда 
			Конец = Фоновое.Конец;
		Иначе
			Конец = ТекущаяДатаСеанса();
		КонецЕсли;
		
		НоваяСтрока.ПродолжительностьСекунд = Конец - НоваяСтрока.Начало;
		
		НоваяСтрока.Идентификатор = Фоновое.УникальныйИдентификатор;
		НоваяСтрока.ЗапущеноРегламентным = ЗначениеЗаполнено(НоваяСтрока.РегламентноеЗадание);
		
		Если Фоновое.ИнформацияОбОшибке <> Неопределено Тогда
			НоваяСтрока.ОписаниеОшибки = Фоновое.ИнформацияОбОшибке.Описание;
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

 // СостояниеЗаданий()
