#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Возврат;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ЭтоГруппа Тогда
		ХешСуммаТекущегоСостояния = ХешСуммаТекущегоСостояния();

		Если ХешСуммаТекущегоСостояния <> ХешСумма Тогда
			ХешСумма = ХешСуммаТекущегоСостояния;
		КонецЕсли;

	КонецЕсли;
	
	Если ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Идентификатор              = Неопределено;
	ХешСуммаПоставляемыхДанных = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ХешСуммаТекущегоСостояния()

	ДанныеДляРасчета = Новый СписокЗначений();
	
	ДанныеДляРасчета.Добавить(Наименование);
	ДанныеДляРасчета.Добавить(Родитель);
	ДанныеДляРасчета.Добавить(Статус);
	
	ДанныеДляРасчета.СортироватьПоЗначению();
	
	СтрокаДляРасчетаХеша = СтрСоединить(ДанныеДляРасчета.ВыгрузитьЗначения());

	Возврат ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрокаДляРасчетаХеша);
	
КонецФункции

#КонецОбласти

#КонецЕсли