#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТекстЗапроса", ТекстЗапроса);
	
	Если Параметры.Свойство("ПараметрыЗапроса") Тогда
		
		Для каждого Параметр Из Параметры.ПараметрыЗапроса Цикл
			
			НоваяСтрока = ПараметрыЗапроса.Добавить();
			НоваяСтрока.Имя = Параметр.Представление;
			
			Если ТипЗнч(Параметр.Значение) = Тип("Массив") Или ТипЗнч(Параметр.Значение) = Тип("СписокЗначений") Тогда
				
				Сп = Новый СписокЗначений;
				Для каждого Стр Из Параметр.Значение Цикл
					Если ТипЗнч(Параметр.Значение) = Тип("Массив") Тогда
						Сп.Добавить(Стр, Строка(Стр));
					Иначе
						Сп.Добавить(Стр.Значение, Строка(Стр.Представление));
					КонецЕсли;
				КонецЦикла;
				НоваяСтрока.Значение = Сп;
				НоваяСтрока.Тип = "СписокЗначений";
				НоваяСтрока.ТипQ1c = "СписокЗначений";
				
			Иначе
				НоваяСтрока.Значение = Параметр.Значение;
				НоваяСтрока.Тип = ТипЗнч(Параметр.Значение);
				НоваяСтрока.ТипQ1c = ИмяТипаИзЗначения(Параметр.Значение);
			КонецЕсли;			
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Параметры.Свойство("Отборы") Тогда
				
		дзОтборы = РеквизитФормыВЗначение("Отборы");
		ВывестиОтборы(дзОтборы, Параметры.Отборы);
		ЗначениеВРеквизитФормы(дзОтборы, "Отборы");
						
	КонецЕсли;
	
	Элементы.ДекорацияПараметры.Заголовок = Элементы.ДекорацияПараметры.Заголовок + " (" + Строка(ПараметрыЗапроса.Количество()) + ")";	
	Элементы.ДекорацияОтборы.Заголовок = Элементы.ДекорацияОтборы.Заголовок + " (" + Строка(Отборы.ПолучитьЭлементы().Количество()) + ")";
	
	Элементы.ПараметрыЗапроса.Видимость = ПараметрыЗапроса.Количество() > 0;
	Элементы.Отборы.Видимость = Отборы.ПолучитьЭлементы().Количество() > 0;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		
		Если ЭтаФорма.ВладелецФормы.ИмяФормы = "ОбщаяФорма.КонтурЛогистика_Задачи" Тогда
			Элементы.Описание.Заголовок = ЭтаФорма.ВладелецФормы.Заголовок + ", Состояние: " + Строка(ЭтаФорма.ВладелецФормы.ОтборСостояние);
		ИначеЕсли ЭтаФорма.ВладелецФормы.ИмяФормы = "Обработка.КонтурЛогистика_РабочееМестоПутевойЛист.Форма.Форма" Тогда
			Если ЭтаФорма.ВладелецФормы.ТекущиВидАРМ = "Диспетчер" Тогда
				Элементы.Описание.Заголовок = ЭтаФорма.ВладелецФормы.Заголовок + ", Состояние: " + Строка(ЭтаФорма.ВладелецФормы.ОтборДиспетчер);
			ИначеЕсли ЭтаФорма.ВладелецФормы.ТекущиВидАРМ = "Медосмотр" Тогда
				Элементы.Описание.Заголовок = ЭтаФорма.ВладелецФормы.Заголовок + ", Состояние: " + Строка(ЭтаФорма.ВладелецФормы.ОтборМедосмотр);
			ИначеЕсли ЭтаФорма.ВладелецФормы.ТекущиВидАРМ = "ТехКонтроль" Тогда
				Элементы.Описание.Заголовок = ЭтаФорма.ВладелецФормы.Заголовок + ", Состояние: " + Строка(ЭтаФорма.ВладелецФормы.ОтборТехКонтроль);
			ИначеЕсли ЭтаФорма.ВладелецФормы.ТекущиВидАРМ = "ПоказанияОдометра" Тогда
				Элементы.Описание.Заголовок = ЭтаФорма.ВладелецФормы.Заголовок + ", Состояние: " + Строка(ЭтаФорма.ВладелецФормы.ОтборПоказанияОдометра);
			КонецЕсли;			
		ИначеЕсли ЭтаФорма.ВладелецФормы.ИмяФормы = "Справочник.КонтурЛогистика_СценарииАвтоматическойРаботы.Форма.ФормаЭлемента" Тогда
			Элементы.Описание.Заголовок = "Сценарий автоматической работы (Робот) " 
				+ ", " + Строка(ЭтаФорма.ВладелецФормы.Объект.Сценарий) 
				+ ", " + Строка(ЭтаФорма.ВладелецФормы.Объект.ТипЛогистическогоДокумента);	
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДекорацияОтборыНажатие(Элемент)
	
	Элементы.Отборы.Видимость = Не Элементы.Отборы.Видимость;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПараметрыНажатие(Элемент)
	
	Элементы.ПараметрыЗапроса.Видимость = Не Элементы.ПараметрыЗапроса.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Значение) = Тип("СписокЗначений") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьИзСпискаПосле", ЭтаФорма);
		ТекущиеДанные.Значение.ПоказатьВыборЭлемента(ОписаниеОповещения, "");
	Иначе
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекущиеДанные.Значение);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапросаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзСпискаПосле(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ВыбранноеЗначение.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура дзОтборыЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Отборы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Значение) = Тип("СписокЗначений") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьИзСпискаПосле", ЭтаФорма);
		ТекущиеДанные.Значение.ПоказатьВыборЭлемента(ОписаниеОповещения, "");
	Иначе
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекущиеДанные.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КонструкторЗапроса(Команда)
	
	Конструктор = Новый КонструкторЗапроса(ТекстЗапроса);
	Конструктор.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонсольЗапросов(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
				
		ИмяВременногоФайлаОбработки = ПолучитьКонсольЗапросовОФ(); 
		
		Форма = ВнешниеОбработки.ПолучитьФорму(ИмяВременногоФайлаОбработки);
		Форма.ДеревоЗапросов = СформироватьДеревоЗапросов();
		Форма.Открыть();
	
		УдалитьФайлы(ИмяВременногоФайлаОбработки);
				
	#Иначе
	
		ИмяВнешнейОбработки = ПолучитьКонсольЗапросовУФ();
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".q1c");
		СохранитьЗапросВФайлQ1cНаСервере(ИмяВременногоФайла);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИмяВременногоФайла", ИмяВременногоФайла);
			
		ОткрытьФорму("ВнешняяОбработка."+ ИмяВнешнейОбработки +".Форма", ПараметрыФормы);
		
		УдалитьФайлы(ИмяВременногоФайла);
						
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиОтборы(дз, ЭлОтборы)
	
	Для каждого Отбор Из ЭлОтборы Цикл
			
		Если Отбор.Значение.ЭтоГруппа Тогда
			НоваяСтрока = дз.Строки.Добавить();
			НоваяСтрока.Имя = Отбор.Представление;
			ВывестиОтборы(НоваяСтрока, Отбор.Значение.Элементы)	
		Иначе
			
			НоваяСтрока = дз.Строки.Добавить();
			НоваяСтрока.Имя = Отбор.Представление;
			НоваяСтрока.ВидСравнения = Отбор.Значение.ВидСравнения;
			
			Если ТипЗнч(Отбор.Значение.Значение) = Тип("СписокЗначений") Тогда
				
				Сп = Новый СписокЗначений;
				Для каждого Стр Из Отбор.Значение.Значение Цикл
					
					Если ТипЗнч(Стр.Значение) = Тип("Массив") Тогда
						
						Для каждого Стр2 Из Стр.Значение Цикл
							Сп.Добавить(Стр2, Строка(Стр2));	
						КонецЦикла;
						
					Иначе	
						Сп.Добавить(Стр.Значение, Стр.Представление);
					КонецЕсли;
					
				КонецЦикла;
				НоваяСтрока.Значение = Сп;
				
			Иначе
				НоваяСтрока.Значение = Отбор.Значение.Значение;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСписокЗначенийВXML(ФайлXML, Значение)
	
	Если ТипЗнч(Значение) <> Тип("СписокЗначений") Тогда 
		Возврат;
	КонецЕсли;	
	
	Для каждого СтрСписка Из Значение Цикл
		
		ЗначениеЭлементаСписка	= СтрСписка.Значение;
		
		ИмяТипа = ИмяТипаИзЗначения(ЗначениеЭлементаСписка); 
		
		ФайлXML.ЗаписатьНачалоЭлемента("item");
			ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);
			ФайлXML.ЗаписатьАтрибут("value", XMLСтрока(ЗначениеЭлементаСписка));
		ФайлXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТаблицуЗначенийВXML(ФайлXML, Значение)
	
	Если ТипЗнч(Значение) <> Тип("ТаблицаЗначений") Тогда 
		Возврат;
	КонецЕсли;
	
	КолКолонок 	= Значение.Колонки.Количество();
	КолСтрок	= Значение.Количество();
	
	Для СтрокаИндекс = 0 По КолСтрок - 1 Цикл
		Для КолонкаИндекс = 0 По КолКолонок - 1 Цикл 
			
			ЗначениеЭлементаСписка	= Значение.Получить(СтрокаИндекс).Получить(КолонкаИндекс);
			ИмяКолонки = Значение.Колонки.Получить(КолонкаИндекс).Имя;
			
			ИмяТипа = ИмяТипаИзЗначения(ЗначениеЭлементаСписка); 
			Если ИмяТипа = "Строка" Тогда 
				Длина = Значение.Колонки.Получить(КолонкаИндекс).ТипЗначения.КвалификаторыСтроки.Длина; 	
			Иначе 
				Длина = 0;
			КонецЕсли; 
			
			ФайлXML.ЗаписатьНачалоЭлемента("item");
				ФайлXML.ЗаписатьАтрибут("nameCol", ИмяКолонки);
				ФайлXML.ЗаписатьАтрибут("row", XMLСтрока(СтрокаИндекс));
				ФайлXML.ЗаписатьАтрибут("col", XMLСтрока(КолонкаИндекс));
				ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);
				ФайлXML.ЗаписатьАтрибут("length", XMLСтрока(Длина));
				ФайлXML.ЗаписатьАтрибут("value", XMLСтрока(ЗначениеЭлементаСписка));
			ФайлXML.ЗаписатьКонецЭлемента();
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьМоментВремениВXML(ФайлXML, Значение)
	
	Если ТипЗнч(Значение) <> Тип("МоментВремени") Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяТипа = ИмяТипаИзЗначения(Значение.Ссылка); 
	
	ФайлXML.ЗаписатьНачалоЭлемента("item");
	Если Значение.Ссылка <> Неопределено Тогда 
		ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);
		ФайлXML.ЗаписатьАтрибут("valueRef", XMLСтрока(Значение.Ссылка));
	КонецЕсли;	
	ФайлXML.ЗаписатьАтрибут("valueDate", XMLСтрока(Значение.Дата));
	ФайлXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры	

&НаСервере
Процедура ЗаписатьГраницуВXML(ФайлXML, Граница)
	
	Если ТипЗнч(Граница) <> Тип("Граница") Тогда
		Возврат;
	КонецЕсли;
	
	ФайлXML.ЗаписатьНачалоЭлемента("divide");
	ИмяТипа 			= ИмяТипаИзЗначения(Граница.Значение); 
	ТипЗначенияГраницы 	= ТипЗнч(Граница.Значение);
	
	ИмяВидаГраницы = Строка(Граница.ВидГраницы);
	
	ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);
	ФайлXML.ЗаписатьАтрибут("valueDiv", ИмяВидаГраницы);
	
	Если ТипЗначенияГраницы <> Тип("МоментВремени") Тогда 
		ФайлXML.ЗаписатьАтрибут("value", XMLСтрока(Граница.Значение));
	Иначе
		ЗаписатьМоментВремениВXML(ФайлXML, Граница.Значение);
	КонецЕсли;
	ФайлXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры	

&НаСервере
Функция ИмяТипаИзЗначения(Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		ИмяТипа = "Строка";
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		ИмяТипа = "Число";
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
		ИмяТипа = "Булево";
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		ИмяТипа = "Дата";
	ИначеЕсли ТипЗнч(Значение) = Тип("МоментВремени") Тогда
		ИмяТипа = "МоментВремени";
	ИначеЕсли ТипЗнч(Значение) = Тип("Неопределено") Тогда
		ИмяТипа = "Строка";
	Иначе	
		ИмяТипа = xmlТип(ТипЗнч(Значение)).ИмяТипа;
	КонецЕсли;
	
	Возврат ИмяТипа;
	
КонецФункции

&НаКлиенте
Процедура СохранитьЗапросВФайл(ФорматФайла)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ФорматФайла", ФорматФайла);
	
	Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСФайламиПодключено", ЭтаФорма, ДополнительныеПараметры);	
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьЗапросВФайлQ1cНаСервере(ИмяФайла)
	
	ФайлXML = Новый ЗаписьXML;
	ФайлXML.ОткрытьФайл(ИмяФайла);
	ФайлXML.ЗаписатьОбъявлениеXML();
	ФайлXML.ЗаписатьНачалоЭлемента("querylist");
	
	ФайлXML.ЗаписатьНачалоЭлемента("query");
	ФайлXML.ЗаписатьАтрибут("name", "Запрос1");
	ФайлXML.ЗаписатьНачалоЭлемента("text");
		
	Для Счетчик = 1 По СтрЧислоСтрок(ТекстЗапроса) Цикл
		ПереносСтр	= Символы.ВК + Символы.ПС;
		ТекСтрока 	= СтрПолучитьСтроку(ТекстЗапроса, Счетчик);
		ФайлXML.ЗаписатьТекст(ТекСтрока);
		ФайлXML.ЗаписатьБезОбработки(ПереносСтр);
	КонецЦикла;
	ФайлXML.ЗаписатьКонецЭлемента();
		
	Если ПараметрыЗапроса.Количество() > 0 Тогда 
		
		ФайлXML.ЗаписатьНачалоЭлемента("parameters");
		Для каждого ТекПараметр Из ПараметрыЗапроса Цикл 
			 
			ИмяПараметра		= ТекПараметр.Имя;
			ТипПараметра		= ТекПараметр.Тип;
			ЗначениеПараметра			= ТекПараметр.Значение;
								
			ФайлXML.ЗаписатьНачалоЭлемента("parameter");
			ФайлXML.ЗаписатьАтрибут("name", ИмяПараметра);
			Если ТипПараметра = "СписокЗначений" Тогда 
				ФайлXML.ЗаписатьАтрибут("type", ТипПараметра);
				ЗаписатьСписокЗначенийВXML(ФайлXML, ЗначениеПараметра);
			ИначеЕсли ТипПараметра = "ТаблицаЗначений" Тогда
				ФайлXML.ЗаписатьАтрибут("type", ТипПараметра);
				
				Колонки = ЗначениеПараметра.Колонки.Количество();
				Строки = ЗначениеПараметра.Количество();
				
				ФайлXML.ЗаписатьАтрибут("colcount", XMLСтрока(Колонки));
				ФайлXML.ЗаписатьАтрибут("rowcount", XMLСтрока(Строки));
				
				ЗаписатьТаблицуЗначенийВXML(ФайлXML, ЗначениеПараметра);
			ИначеЕсли ТипПараметра = "МоментВремени" Тогда
				ФайлXML.ЗаписатьАтрибут("type", ТипПараметра);
				ЗаписатьМоментВремениВXML(ФайлXML, ЗначениеПараметра);
			ИначеЕсли ТипПараметра = "Граница" Тогда
				ФайлXML.ЗаписатьАтрибут("type", ТипПараметра);
				ЗаписатьГраницуВXML(ФайлXML, ЗначениеПараметра);
			Иначе
				ИмяТипа = ИмяТипаИзЗначения(ЗначениеПараметра); 
				ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);
				ФайлXML.ЗаписатьАтрибут("value", XMLСтрока(ЗначениеПараметра));
			КонецЕсли;	
			ФайлXML.ЗаписатьКонецЭлемента();
				
		КонецЦикла;	
		ФайлXML.ЗаписатьКонецЭлемента();
		
	КонецЕсли;	
	ФайлXML.ЗаписатьКонецЭлемента();
		
	ФайлXML.ЗаписатьКонецЭлемента();
	ФайлXML.Закрыть();
	
КонецПроцедуры

&НаСервере
Функция СформироватьДеревоЗапросов()
	
	дз = Новый ДеревоЗначений;
	дз.Колонки.Добавить("Запрос", Новый ОписаниеТипов("Строка"));
	дз.Колонки.Добавить("ТекстЗапроса", Новый ОписаниеТипов("Строка"));
	дз.Колонки.Добавить("ПараметрыЗапроса");
	дз.Колонки.Добавить("СпособВыгрузки");
	дз.Колонки.Добавить("ВариантыКода");
	дз.Колонки.Добавить("ПараметрыИБ");
	
	ПараметрыЗапросаДляВыгрузки = Новый ТаблицаЗначений;
	ПараметрыЗапросаДляВыгрузки.Колонки.Добавить("ИмяПараметра");
	ПараметрыЗапросаДляВыгрузки.Колонки.Добавить("ЭтоВыражение");
	ПараметрыЗапросаДляВыгрузки.Колонки.Добавить("ЗначениеПараметра");
		
	Для каждого Парам Из ПараметрыЗапроса Цикл
		НоваяСтрока = ПараметрыЗапросаДляВыгрузки.Добавить();
		НоваяСтрока.ИмяПараметра = Парам.Имя;		
		НоваяСтрока.ЭтоВыражение = Ложь;
		НоваяСтрока.ЗначениеПараметра = Парам.Значение;
	КонецЦикла;
	
	НоваяСтрока = дз.Строки.Добавить();
	НоваяСтрока.Запрос = "Запрос";
	НоваяСтрока.ТекстЗапроса = ТекстЗапроса;
	НоваяСтрока.ПараметрыЗапроса = ПараметрыЗапросаДляВыгрузки;
	НоваяСтрока.СпособВыгрузки = 1;
	НоваяСтрока.ВариантыКода = Новый ТаблицаЗначений;
	НоваяСтрока.ПараметрыИБ = Новый ТаблицаЗначений;
	
	Возврат дз;
	
КонецФункции

&НаСервере
Функция ПолучитьКонсольЗапросовУФ()
	
	ДвоичныеДанные = ПолучитьОбщийМакет("КонтурЛогистика_КонсольЗапросовУФ");
    АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
    Обработка = ВнешниеОбработки.Подключить(АдресФайлаВоВременномХранилище, , Ложь);
	
	Возврат Обработка;
	
КонецФункции

&НаСервере
Функция ПолучитьКонсольЗапросовОФ()
	
	ОбработкаДвоичныеДанные = ПолучитьОбщийМакет("КонтурЛогистика_КонсольЗапросовОФ");
	ИмяВременногоФайлаОбработки = ПолучитьИмяВременногоФайла("epf");
	ОбработкаДвоичныеДанные.Записать(ИмяВременногоФайлаОбработки);
	
	Возврат ИмяВременногоФайлаОбработки;
	
КонецФункции

#КонецОбласти