
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДокументОснование", ДокументОснование);
	
	ЗаполнитьСписокЗаказов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если КоличествоФоновыхЗаданийСостоянияЗаказов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОжидание;
	
	Для НомерФоновогоЗадания = 1 По КоличествоФоновыхЗаданийСостоянияЗаказов Цикл
		
		ИмяФоновогоЗадания = "ФоновоеЗаданиеПолучитьСостояния_" + НомерФоновогоЗадания;
		
		Если ЗначениеЗаполнено(ЭтотОбъект[ИмяФоновогоЗадания]) Тогда
		
			ПараметрыОперации = Новый Структура("ИмяПроцедуры, НаименованиеОперации, ВыводитьОкноОжидания");
			ПараметрыОперации.Вставить("ИмяПроцедуры", СервисДоставкиКлиентСервер.ИмяПроцедурыПолучитьЗаказыНаДоставку());
			ПараметрыОперации.Вставить("НаименованиеОперации", НСтр("ru = 'Получение списка состояний.'"));
			ПараметрыОперации.Вставить("ИмяФоновогоЗадания", ИмяФоновогоЗадания);
			ПараметрыОперации.Вставить("ВыводитьОкноОжидания", Ложь);
		
			ОжидатьЗавершениеВыполненияЗапроса(ПараметрыОперации);
		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЗаказов

&НаКлиенте
Процедура ТаблицаЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = ТаблицаЗаказов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ПараметрыОткрытияФормы = СервисДоставкиКлиент.НовыйПараметрыОткрытьФормуСервисаДоставки();
	
	ПараметрыОткрытияФормы.ИмяФормы = СервисДоставкиКлиентСервер.ИмяФормыСервисаДоставки(ТекущаяСтрока.ТипГрузоперевозки);
	ПараметрыОткрытияФормы.ТипГрузоперевозки = ТекущаяСтрока.ТипГрузоперевозки;
	ПараметрыОткрытияФормы.ОрганизацияБизнесСети = ТекущаяСтрока.Организация;
	ПараметрыОткрытияФормы.РежимМастера = СервисДоставкиКлиентСервер.РежимМастераЧерновик();
	ПараметрыОткрытияФормы.ИдентификаторЗаказа = ТекущаяСтрока.Идентификатор;
	
	СервисДоставкиКлиент.ОткрытьФормуСервисаДоставки(ПараметрыОткрытияФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокЗаказов()

	ТаблицаЗаказов.Очистить();
	КоличествоФоновыхЗаданийСостоянияЗаказов = 0;
	
	ДокументыОснования = Новый Массив;
	ДокументыОснования.Добавить(ДокументОснование);
	ЗначениеКритерияОтбора = Неопределено;
	СервисДоставкиПереопределяемый.ДополнитьОснованияЗаказаИЗначениеОтбора(ДокументыОснования, ЗначениеКритерияОтбора);
	
	Запрос = Новый Запрос;
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(СервисДоставкиСлужебный.ТекстЗапросаСвязанныеДокументы());
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаказыНаДоставкуПоОснованиям());
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.УстановитьПараметр("ДокументыОснования", ДокументыОснования);
	Запрос.УстановитьПараметр("ЗначениеОтбора", ЗначениеКритерияОтбора);
	Запрос.УстановитьПараметр("ПолучитьСвязанныеДокументы", ЗначениеЗаполнено(ЗначениеКритерияОтбора));
	Запрос.УстановитьПараметр("ТипыСвязанныхДокументовОснований",
		СервисДоставкиПереопределяемый.ТипыСвязанныхДокументовОснований());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ДобавляемыеРеквизиты = Новый Массив;
	НомерФоновогоЗадания = 1;
	ВыборкаОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		
		ВыборкаТипГрузоперевозки = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТипГрузоперевозки.Следующий() Цикл
			КоличествоФоновыхЗаданийСостоянияЗаказов = КоличествоФоновыхЗаданийСостоянияЗаказов + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	Если КоличествоФоновыхЗаданийСостоянияЗаказов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для НомерФоновогоЗадания = 1 По КоличествоФоновыхЗаданийСостоянияЗаказов Цикл
		ИмяФоновогоЗадания = "ФоновоеЗаданиеПолучитьСостояния_" + НомерФоновогоЗадания;
		НовыйРеквизит = Новый РеквизитФормы(ИмяФоновогоЗадания, Новый ОписаниеТипов(Неопределено));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;
		
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ВыборкаОрганизация.Сбросить();
	НомерФоновогоЗадания = 1;
	ДанныеДляРасчетаСостояний = Новый Массив;
    ЕстьИныеОснования = Ложь;
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		
		ВыборкаТипГрузоперевозки = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТипГрузоперевозки.Следующий() Цикл
		
			ИмяФоновогоЗадания = "ФоновоеЗаданиеПолучитьСостояния_" + НомерФоновогоЗадания;
			
			ОписаниеЗаказовНаДоставку = Новый Структура();
			ОписаниеЗаказовНаДоставку.Вставить("Организация", ВыборкаОрганизация.Организация);
			ОписаниеЗаказовНаДоставку.Вставить("ИмяФоновогоЗадания", ИмяФоновогоЗадания);
			
			ДанныеГрузоперевозки = Новый Структура;
			ДанныеГрузоперевозки.Вставить("ТипГрузоперевозки", ВыборкаТипГрузоперевозки.ТипГрузоперевозки);
			ДанныеГрузоперевозки.Вставить("ИдентификаторыЗаказов", Новый Массив);
			
			Выборка = ВыборкаТипГрузоперевозки.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = ТаблицаЗаказов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.Грузоперевозчик = СервисДоставкиКлиентСервер.ПредставлениеТипаГрузоперевозки(
					НоваяСтрока.ТипГрузоперевозки);
				
				ДанныеГрузоперевозки.ИдентификаторыЗаказов.Добавить(Выборка.Идентификатор);
				ЕстьИныеОснования = ЕстьИныеОснования Или Выборка.ДокументОснование <> ДокументОснование;
				
			КонецЦикла;
			
			ОписаниеЗаказовНаДоставку.Вставить("ДанныеГрузоперевозки", ДанныеГрузоперевозки);
			ДанныеДляРасчетаСостояний.Добавить(ОписаниеЗаказовНаДоставку);
			НомерФоновогоЗадания = НомерФоновогоЗадания + 1;
		
		КонецЦикла;
		
	КонецЦикла;
	
	Элементы.ДокументОснование.Видимость = Не ЕстьИныеОснования;
	Элементы.ТаблицаЗаказовДокументОснование.Видимость = ЕстьИныеОснования;
	
	ПолучитьСостоянияВФоне(ДанныеДляРасчетаСостояний);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаЗаказыНаДоставкуПоОснованиям()
	Возврат "ВЫБРАТЬ
	|	ТаблицаРегистра.ТипГрузоперевозки КАК ТипГрузоперевозки,
	|	ТаблицаРегистра.Организация КАК Организация,
	|	ТаблицаРегистра.ИдентификаторДокумента КАК Идентификатор,
	|	ТаблицаРегистра.Представление КАК Представление,
	|	ТаблицаРегистра.ДокументОснование КАК Основание
	|ПОМЕСТИТЬ ВТЗаказыНаДоставкуПоОснованиюИСвязаннымДокументам
	|ИЗ
	|	РегистрСведений.ДанныеЗаказовСервисДоставки КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.ДокументОснование В
	|		(ВЫБРАТЬ
	|			ВТ.Ссылка
	|		ИЗ
	|			ВТСвязанныеДокументы КАК ВТ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ТипГрузоперевозки,
	|	ТаблицаРегистра.Организация,
	|	ТаблицаРегистра.ИдентификаторДокумента,
	|	ТаблицаРегистра.Представление,
	|	ТаблицаРегистра.ДокументОснование
	|ИЗ
	|	РегистрСведений.ДанныеЗаказовСервисДоставки КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.ДокументОснование В (&ДокументыОснования)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыНаДоставкуПоОснованиям.ТипГрузоперевозки КАК ТипГрузоперевозки,
	|	ЗаказыНаДоставкуПоОснованиям.Организация КАК Организация,
	|	ЗаказыНаДоставкуПоОснованиям.Идентификатор КАК Идентификатор,
	|	МАКСИМУМ(ЗаказыНаДоставкуПоОснованиям.Представление) КАК Представление,
	|	ЗаказыНаДоставкуПоОснованиям.Основание КАК ДокументОснование
	|ИЗ
	|	ВТЗаказыНаДоставкуПоОснованиюИСвязаннымДокументам КАК ЗаказыНаДоставкуПоОснованиям
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыНаДоставкуПоОснованиям.ТипГрузоперевозки,
	|	ЗаказыНаДоставкуПоОснованиям.Организация,
	|	ЗаказыНаДоставкуПоОснованиям.Идентификатор,
	|	ЗаказыНаДоставкуПоОснованиям.Основание
	|
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(ЗаказыНаДоставкуПоОснованиям.Представление)
	|ИТОГИ
	|ПО
	|	Организация,
	|	ТипГрузоперевозки";
КонецФункции

#Область ВыполнитьЗапросВФоне

&НаСервере
Процедура ПолучитьСостоянияВФоне(ДанныеДляРасчетаСостояний)
	
	Если ДанныеДляРасчетаСостояний.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// Проверка подключения Интернет-поддержки пользователей.
	ИнтернетПоддержкаПодключена = ИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
	Если Не ИнтернетПоддержкаПодключена Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ОписаниеЗаказовНаДоставку Из ДанныеДляРасчетаСостояний Цикл

		ПараметрыОперации = Новый Структура();
		ПараметрыОперации.Вставить("ИмяПроцедуры", СервисДоставкиКлиентСервер.ИмяПроцедурыПолучитьЗаказыНаДоставку());
		ПараметрыОперации.Вставить("НаименованиеОперации", НСтр("ru = 'Получение списка состояний заказа.'"));
		ПараметрыОперации.Вставить("ИмяФоновогоЗадания", ОписаниеЗаказовНаДоставку.ИмяФоновогоЗадания);
		ПараметрыОперации.Вставить("Организация", ОписаниеЗаказовНаДоставку.Организация);
		ПараметрыОперации.Вставить("ДанныеГрузоперевозки", ОписаниеЗаказовНаДоставку.ДанныеГрузоперевозки);
		
		ЭтотОбъект[ОписаниеЗаказовНаДоставку.ИмяФоновогоЗадания] = ВыполнитьЗапросВФоне(ПараметрыОперации);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапросВФоне(ПараметрыОперации)
	
	Отказ = Ложь;
	
	Если ПараметрыОперации.ИмяПроцедуры = СервисДоставкиКлиентСервер.ИмяПроцедурыПолучитьЗаказыНаДоставку() Тогда
		ПараметрыЗапроса = СервисДоставки.НовыйПараметрыЗапросаПолучитьЗаказыНаДоставку();
		
		ПараметрыЗапроса.Вставить("ОрганизацияБизнесСетиСсылка", ПараметрыОперации.Организация);
		ПараметрыЗапроса.Вставить("Состояние", Новый Массив());
		ПараметрыЗапроса.Состояние.Добавить(Новый Структура("Идентификатор", -1));
		ПараметрыЗапроса.Вставить("ТипГрузоперевозки", ПараметрыОперации.ДанныеГрузоперевозки.ТипГрузоперевозки);
		ПараметрыЗапроса.Вставить("ИдентификаторыЗаказов", ПараметрыОперации.ДанныеГрузоперевозки.ИдентификаторыЗаказов);
		ПараметрыЗапроса.Вставить("Источник", "subOrders");
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		СервисДоставкиСлужебный.ПроверитьОрганизациюБизнесСети(ПараметрыЗапроса.ОрганизацияБизнесСетиСсылка, Отказ);
	КонецЕсли;

	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ФоновоеЗадание = ЭтотОбъект[ПараметрыОперации.ИмяФоновогоЗадания];
	Если ФоновоеЗадание <> Неопределено Тогда
		ОтменитьВыполнениеЗадания(ФоновоеЗадание.ИдентификаторЗадания);
	КонецЕсли;
	
	Задание = Новый Структура("ИмяПроцедуры, Наименование, ПараметрыПроцедуры");

	Задание.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1. %2'"),
		ПараметрыОперации.Организация,
		ПараметрыОперации.НаименованиеОперации);

	Задание.ИмяПроцедуры = "СервисДоставки." + ПараметрыОперации.ИмяПроцедуры;
	Задание.ПараметрыПроцедуры = ПараметрыЗапроса;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = Задание.Наименование;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Если ПараметрыОперации.Свойство("ЗапуститьВФоне")
		И ТипЗнч(ПараметрыОперации.ЗапуститьВФоне) = Тип("Булево") Тогда
		ПараметрыВыполнения.ЗапуститьВФоне = ПараметрыОперации.ЗапуститьВФоне;
	КонецЕсли; 
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("СервисДоставки.ПолучитьЗаказыНаДоставку",
		Задание.ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОтменитьВыполнениеЗадания(ИдентификаторЗадания)
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
		ИдентификаторЗадания = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершениеВыполненияЗапроса(ПараметрыОперации)
	
	ВыводитьОкноОжидания = ?(ЗначениеЗаполнено(ПараметрыОперации.ВыводитьОкноОжидания), ПараметрыОперации.ВыводитьОкноОжидания, Ложь);

	// Инициализация обработчик ожидания завершения.
	ФоновоеЗадание = ЭтотОбъект[ПараметрыОперации.ИмяФоновогоЗадания];
	ПараметрыОперации.Вставить("ФоновоеЗадание", ФоновоеЗадание);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = ПараметрыОперации.НаименованиеОперации;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания = ВыводитьОкноОжидания;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Вставить("ИдентификаторЗадания", ФоновоеЗадание.ИдентификаторЗадания);
	
	ОбработкаЗавершения = Новый ОписаниеОповещения("ВыполнитьЗапросЗавершение",
		ЭтотОбъект, ПараметрыОперации);
		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, ОбработкаЗавершения, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполненоФоновыхЗаданий = ВыполненоФоновыхЗаданий + 1;
	Если ВыполненоФоновыхЗаданий = КоличествоФоновыхЗаданийСостоянияЗаказов Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗаказы;
	КонецЕсли;
	
	// Инициализация.
	Отказ = Ложь;
	ФоновоеЗадание = ЭтотОбъект[ДополнительныеПараметры.ИмяФоновогоЗадания];
	
	// Вывод сообщений из фонового задания.
	СервисДоставкиКлиент.ОбработатьРезультатФоновогоЗадания(Результат, ДополнительныеПараметры, Отказ);
	Если Результат = Неопределено ИЛИ ФоновоеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка результата поиска.
	Если Не Отказ И Результат.Статус = "Выполнено" Тогда
		Если ЗначениеЗаполнено(Результат.АдресРезультата)
			И ЭтоАдресВременногоХранилища(Результат.АдресРезультата)
			И ДополнительныеПараметры.ФоновоеЗадание.ИдентификаторЗадания
			= ЭтотОбъект[ДополнительныеПараметры.ИмяФоновогоЗадания].ИдентификаторЗадания Тогда
			
			Если ДополнительныеПараметры.ИмяПроцедуры = СервисДоставкиКлиентСервер.ИмяПроцедурыПолучитьЗаказыНаДоставку() Тогда
				
				ЗагрузитьРезультатПолученияСпискаСостояний(Результат.АдресРезультата);
				ЭтотОбъект[ДополнительныеПараметры.ИмяФоновогоЗадания] = Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРезультатПолученияСпискаСостояний(АдресРезультата, ОперацияВыполнена = Истина)
	
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
		Если ЗначениеЗаполнено(Результат) 
			И ТипЗнч(Результат) = Тип("Структура") Тогда
			
			Если Результат.Свойство("Список") Тогда
				Для каждого Заказ Из Результат.Список Цикл
					СписокСтрок = ТаблицаЗаказов.НайтиСтроки(Новый Структура("Идентификатор", Заказ.Идентификатор));
					Если СписокСтрок.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаТаблицыЗаказов = СписокСтрок[0];
					СтрокаТаблицыЗаказов.Состояние = Заказ.Состояние;
					СтрокаТаблицыЗаказов.Сумма = Заказ.Сумма;
					Если Заказ.АдресОтгрузкиТипНаименование = "Адрес" Тогда
						СтрокаТаблицыЗаказов.Откуда = Заказ.ОтправительАдресПредставление;
					Иначе
						СтрокаТаблицыЗаказов.Откуда = Заказ.АдресОтгрузкиНаименование;
					КонецЕсли;
					
					Если Заказ.АдресДоставкиТипНаименование = "Адрес" Тогда
						СтрокаТаблицыЗаказов.Куда = Заказ.ПолучательАдресПредставление;
					Иначе
						СтрокаТаблицыЗаказов.Куда = Заказ.АдресДоставкиНаименование;
					КонецЕсли;
				КонецЦикла;
			Иначе
				ОперацияВыполнена = Ложь;
			КонецЕсли;
			
			СервисДоставки.ОбработатьБлокОшибок(Результат, ОперацияВыполнена);
			
		Иначе
			ОперацияВыполнена = Ложь;
		КонецЕсли;
	Иначе
		ОперацияВыполнена = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
