#Область ОбработчикиСобытийФормы

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	//ИнициализироватьДеревоНавигации();	
	
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВебСсылкаНажатие(Элемент, СтандартнаяОбработка)
	
	Если НЕ ПустаяСтрока(Объект.ВебСсылка) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		НачатьЗапускПриложения(Новый ОписаниеОповещения, Объект.ВебСсылка);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНажатияГиперссылкиТабличнойЧастиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	Если Найти(Поле.Имя, "ВебСсылка") > 0 Тогда
		
		СтандартнаяОбработка = Ложь; 
		
		СтрокаТаблицы  = Объект[Элемент.Имя].НайтиПоИдентификатору(ВыбраннаяСтрока);	
		
		Если Элемент.Имя = "Документы" Тогда
			КолонкаТаблицы = "СсылкаНаФайл";	
		Иначе
			КолонкаТаблицы = СтрЗаменить(Поле.Имя, Элемент.Имя, "");
		КонецЕсли;
		
		НачатьЗапускПриложения(Новый ОписаниеОповещения, СтрокаТаблицы[КолонкаТаблицы]);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьДеревоНавигации()

	ДеревоЗначенийНавигации = РеквизитФормыВЗначение("ДеревоНавигации", Тип("ДеревоЗначений"));
	
	СтрокаКонтракты = ДеревоЗначенийНавигации.Строки.Добавить();
	СтрокаКонтракты.Представление = НСтр("ru = 'Контракты'");
	СтрокаКонтракты.Значение 	  = 0;
	
	СтрокаОбъектыЗакупки = СтрокаКонтракты.Строки.Добавить();
	СтрокаОбъектыЗакупки.Представление = НСтр("ru = 'Объекты закупки'");
	СтрокаОбъектыЗакупки.Значение 	   = 1;
	
	СтрокаПоставщики = СтрокаКонтракты.Строки.Добавить();
	СтрокаПоставщики.Представление = НСтр("ru = 'Поставщики'"); 
	СтрокаПоставщики.Значение 	   = 2;
	
	СтрокаДокументы = СтрокаКонтракты.Строки.Добавить();
	СтрокаДокументы.Представление = НСтр("ru = 'Документы контрактов'"); 
	СтрокаДокументы.Значение 	  = 3;
	
	СтрокаПроекты = ДеревоЗначенийНавигации.Строки.Добавить();
	СтрокаПроекты.Представление = НСтр("ru = 'Проекты'"); 
	СтрокаПроекты.Значение 		= 4;
	
	СтрокаДокументы = СтрокаПроекты.Строки.Добавить();
	СтрокаДокументы.Представление = НСтр("ru = 'Документы проектов'");
	СтрокаДокументы.Значение 	  = 5;
	
	СтрокаПротоколы = ДеревоЗначенийНавигации.Строки.Добавить();
	СтрокаПротоколы.Представление = НСтр("ru = 'Протоколы'"); 
	СтрокаПротоколы.Значение 	  = 6;
	
	СтрокаУчастники = СтрокаПротоколы.Строки.Добавить();
	СтрокаУчастники.Представление = НСтр("ru = 'Участники'");
	СтрокаУчастники.Значение 	  = 7;
	
	СтрокаДокументы = СтрокаПротоколы.Строки.Добавить();
	СтрокаДокументы.Представление = НСтр("ru = 'Документы протоколов'");
	СтрокаДокументы.Значение 	  = 8;
	
	ЗначениеВРеквизитФормы(ДеревоЗначенийНавигации, "ДеревоНавигации");
	
КонецПроцедуры // ИнициализироватьДеревоНавигации()

&НаКлиенте
Процедура ДеревоНавигацииПриАктивизацииСтроки(Элемент)
	
	Если ИдентификаторТекущейСтроки <> Элемент.ТекущаяСтрока Тогда
	
		ТекущиеДанные = Элементы.ДеревоНавигации.ТекущиеДанные;
		
		Если ТекущиеДанные.Значение = 0 Тогда
			ЭлементТекущаяСтраница = Элементы.ГруппаКонтракты1;	
		ИначеЕсли ТекущиеДанные.Значение = 1 Тогда
			ЭлементТекущаяСтраница = Элементы.ГруппаОбъектыЗакупки1;	
		ИначеЕсли ТекущиеДанные.Значение = 2 Тогда
			ЭлементТекущаяСтраница = Элементы.ГруппаПоставщики1;	
		ИначеЕсли ТекущиеДанные.Значение = 3 Тогда
			ЭлементТекущаяСтраница = Элементы.ГруппаДокументы1;	
		ИначеЕсли ТекущиеДанные.Значение = 4 Тогда
			ЭлементТекущаяСтраница = Элементы.ГруппаПроекты1;	
		ИначеЕсли ТекущиеДанные.Значение = 5 Тогда
			ЭлементТекущаяСтраница = Элементы.ГруппаДокументы1;	
		ИначеЕсли ТекущиеДанные.Значение = 6 Тогда
			ЭлементТекущаяСтраница = Элементы.ГруппаПротоколы1;	
		ИначеЕсли ТекущиеДанные.Значение = 7 Тогда
			ЭлементТекущаяСтраница = Элементы.ГруппаУчастники1;	
		Иначе
			ЭлементТекущаяСтраница = Элементы.ГруппаДокументы1;	
		КонецЕсли; 
		
		Элементы.Страницы1.ТекущаяСтраница = ЭлементТекущаяСтраница;
		
		ИдентификаторТекущейСтроки = Элемент.ТекущаяСтрока;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
