
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		
		ПараметрыВыполненияКоманды.Источник.РазблокироватьДанныеФормыДляРедактирования();
		Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Обработка.КонтурЛогистика_РабочийСтол.Форма.Форма" Тогда 
			ПараметрыВыполненияКоманды.Источник.Элементы.СостояниеОбмена.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.МенеджерФоновыхЗаданийДоступен() Тогда
		
		КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеВыполнениеСотслеживаниемВНовойФорме("КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьОбмен",
		"Выполнение обмена" + Строка(ПараметрКоманды),
		Новый Структура,
		"Выполнение обмена " + Строка(ПараметрКоманды),
		Истина,
		Истина);
		
	Иначе
		
		Состояние("Выполняется обмен", 20, "читаем ленты событий", БиблиотекаКартинок.КонтурЛогистика_ВыполнитьОбмен);
		ПрочитатьЛентыСобытий();
		
		Состояние("Выполняется обмен", 35, "создаем титулы из файлов", БиблиотекаКартинок.КонтурЛогистика_ВыполнитьОбмен);
		СоздатьТитулыПоЗагруженнымФайламОбмена();
		
		Состояние("Выполняется обмен", 45, "обрабатываем OuterDocflows входящих файлов обмена", БиблиотекаКартинок.КонтурЛогистика_ВыполнитьОбмен);
		ОбработатьOuterDocflowsНеобработанныхФайлов();
		
		Состояние("Выполняется обмен", 55, "отправляем готовые файлы обмена", БиблиотекаКартинок.КонтурЛогистика_ВыполнитьОбмен);
		ОтправитьВсеФайлыОжидающиеОтправки();
		
		Состояние("Выполняется обмен", 70, "отправляем готовые документы", БиблиотекаКартинок.КонтурЛогистика_ВыполнитьОбмен);
		ОтправитьВсеДокументыБезФайловОжидающиеОтправки();
		
		Состояние("Выполняется обмен", 80, "получаем и отправляем QR-коды водителям", БиблиотекаКартинок.КонтурЛогистика_ВыполнитьОбмен);
		ОтправитьQRКодыДокументов();
		
		Состояние("Выполняется обмен", 90, "отправляем и обрабатываем произволные данные", БиблиотекаКартинок.КонтурЛогистика_ВыполнитьОбмен);
		ОбработатьПроизволныеДанные();
		
		Состояние("Выполняется обмен", 95, "получаем уведомления из сервиса", БиблиотекаКартинок.КонтурЛогистика_ВыполнитьОбмен);
		КонтурЛогистика_ОбновлениеСервер.ПолучитьУведомленияИзСервиса(Истина);
		
		Состояние("Обмен завершен", 100, "статусы обновлены, документы отправлены", БиблиотекаКартинок.КонтурЛогистика_ВыполнитьОбмен);
		Оповестить("КонтурЛогистика_ОбновитьЗадачи");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЛентыСобытий()
	
	КонтурЛогистика_API_Диадок.ОбработатьВсеЛентыСобытий();
	
	КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.ОбработатьВсеЛентыСобытий();	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьТитулыПоЗагруженнымФайламОбмена()

	КонтурЛогистика_ОбработкаДокументовСервер.СоздатьТитулыПоЗагруженнымФайламОбмена();	

КонецПроцедуры

&НаСервере
Процедура ОбработатьOuterDocflowsНеобработанныхФайлов()

	КонтурЛогистика_ОбработкаДокументовСервер.ОбработатьOuterDocflowsНеобработанныхФайлов();

КонецПроцедуры

&НаСервере
Процедура ОтправитьВсеФайлыОжидающиеОтправки()

	КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьВсеФайлыОжидающиеОтправки();	

КонецПроцедуры

&НаСервере
Процедура ОтправитьВсеДокументыБезФайловОжидающиеОтправки()

	КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьВсеДокументыБезФайловОжидающиеОтправки();	

КонецПроцедуры

&НаСервере
Процедура ОтправитьQRКодыДокументов()
	
	Если Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("АвтоматическоеПолучениеИОтправкаQRКодов") Тогда
		РегистрыСведений.КонтурЛогистика_ОчередьОтправкиQRКодов.ПолучитьОтправить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПроизволныеДанные()
	
	КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.ОтправитьПроизволныеДанные();
	
	КонтурЛогистика_КонвертацияСервер.ОбработатьПроизвольныеДанныеРС();
	
КонецПроцедуры