
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Токен", Токен);
	Параметры.Свойство("ФИО", ФИО);
	
	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Токен) Тогда
		ОбновитьДанныеПоПравам();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаЛогистика.Видимость = (ЗначениеЗаполнено(ПереченьНедостающихПравЛогистика));
	Элементы.ГруппаДиадок.Видимость = (ЗначениеЗаполнено(ПереченьНедостающихПравДиадок));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы = Неопределено Или Не ЗавершениеРаботы Тогда
		Оповестить("КонтурЛогистика_ФормаПроверкиПравДоступа_Закрытие", Организация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФИОНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьПраваСотрудникаЛогистики(Команда)
	
	СсылкаНастройкиВеб = КонтурЛогистика_ОбщегоНазначенияСервер.СсылкаВебСпискаСотрудниковЛогистики(Организация);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(СсылкаНастройкиВеб);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПраваСотрудникаДиадока(Команда)
	
	СсылкаНастройкиВеб = КонтурЛогистика_ОбщегоНазначенияСервер.СсылкаВебСпискаСотрудниковДиадока(Организация);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(СсылкаНастройкиВеб);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеПоПравам()
	
	ДопИнформация = Новый Структура;
	ДопИнформация.Вставить("BoxID", Организация.ID);
	ДопИнформация.Вставить("СписокПравЛогистики", Новый Массив);
	ДопИнформация.Вставить("СписокПравДиадока", Новый Массив);
	
	ПереченьНедостающихПравОрганизаций = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.ПроверкаПравДляРаботыСервисом(Организация, Токен);
	ПереченьНедостающихПрав = ПереченьНедостающихПравОрганизаций.Получить(Организация.ID);
	Если ПереченьНедостающихПрав <> Неопределено Тогда
		Для Каждого ТекущаяСтрока Из ПереченьНедостающихПрав Цикл
			ПереченьНедостающихПравЛогистика = ПереченьНедостающихПравЛогистика
				+ ?(ЗначениеЗаполнено(ПереченьНедостающихПравЛогистика), Символы.ПС, "")
				+ " - " + ТекущаяСтрока.Значение;
			
			ДопИнформация.СписокПравЛогистики.Добавить(ТекущаяСтрока.Ключ);
	КонецЦикла;
	КонецЕсли;
	
	РезультатПроверкиПравОрганизаций = КонтурЛогистика_API_Диадок.ПроверкаПравДляРаботыСервисом(Организация, Токен);
	ПереченьНедостающихПрав = РезультатПроверкиПравОрганизаций.ПереченьНедостающихПрав;
	Если ПереченьНедостающихПрав <> Неопределено Тогда
		Для Каждого ТекущаяСтрока Из ПереченьНедостающихПрав Цикл
			ПереченьНедостающихПравДиадок = ПереченьНедостающихПравДиадок
				+ ?(ЗначениеЗаполнено(ПереченьНедостающихПравДиадок), Символы.ПС, "")
				+ " - " + ТекущаяСтрока.Значение;
			
			ДопИнформация.СписокПравДиадока.Добавить(ТекущаяСтрока.Ключ);
		КонецЦикла;
	КонецЕсли;
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		"Авторизация", "Настройка прав",
		"РегистрСведений.КонтурЛогистика_Аутентификация.Форма.ФормаПроверкиПравДоступа",,, ДопИнформация);
	
КонецПроцедуры

#КонецОбласти
