#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Цвет) Тогда
		УстановитьЦветДекорации(WebЦвета.Белый);
	Иначе
		УстановитьЦветДекорации(ЗначениеИзСтрокиВнутр(Объект.Цвет));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ВыбратьЦвет(Команда)
	
	Диалог = Новый ДиалогВыбораЦвета;
	Диалог.Показать(Новый ОписаниеОповещения("ВыбратьЦветЗавершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЦветЗавершение(Цвет, ДопПараметры) Экспорт
	
	УстановитьЦветДекорации(Цвет);
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Функция УстановитьЦветДекорации(Цвет)
	
	Элементы.ДекорацияЦвет.ЦветФона = Цвет;
	Элементы.ДекорацияЦвет.ЦветТекста = Цвет;
	
	Объект.Цвет = ЗначениеВСтрокуВнутр(Цвет);
	
КонецФункции

#КонецОбласти