// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ОтраслиОбновленные") Тогда
		ОтраслиОбновленные.Загрузить(Параметры.ОтраслиОбновленные.Выгрузить());
		ЗаполнитьДеревоОтраслей();
		УстиновитьФлагиДереваОтраслей(ДеревоОтраслейОбновленных, ОтраслиОбновленные.Выгрузить( , "Отрасль"));
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОтраслейОбновленных

&НаКлиенте
Процедура ДеревоОтраслейОбновленныхФлагПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ДеревоОтраслейОбновленных.ТекущаяСтрока;

	Если Не ИДТекущейСтроки = Неопределено Тогда

		СтрокаДерева = ДеревоОтраслейОбновленных.НайтиПоИдентификатору(ИДТекущейСтроки);

		Если СтрокаДерева.ЭтоГруппа Тогда
			УстановкаПодчиненныхФлажковОтраслиОбновленные(СтрокаДерева);
		Иначе
			УстановкаРодительскогоФлажка(СтрокаДерева);
			МассиивОтраслей = Новый Массив; // Массив из СправочникСсылка.КонтурЗакупки_ОтраслиОбновленные 
			МассиивОтраслей.Добавить(СтрокаДерева.Отрасль);
			Если СтрокаДерева.Флаг Тогда
				ДобавитьОтрасльОбновленнуюВТабличнуюЧасть(МассиивОтраслей);
			Иначе
				УдалитьОтрасльОбновленнуюИзТабличнойЧасти(МассиивОтраслей);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(ОтраслиОбновленные);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	СвернутьРазвернутьДерево(Истина);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	СвернутьРазвернутьДерево(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СвернутьРазвернутьДерево(ЭтоСвертка)
	КоллекцияЭлементовДерева = ДеревоОтраслейОбновленных.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл
		Если ЭтоСвертка Тогда
			Элементы.ДеревоОтраслейОбновленных.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
		Иначе
			Элементы.ДеревоОтраслейОбновленных.Развернуть(СтрокаДерева.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановкаПодчиненныхФлажковОтраслиОбновленные(СтрокаДерева)
	ПодчинЭлементы = СтрокаДерева.ПолучитьЭлементы();
	МассиивОтраслей = Новый Массив; // Массив из СправочникСсылка.КонтурЗакупки_ОтраслиОбновленные
	Если Не СтрокаДерева.ЭтоГруппа Тогда
		МассиивОтраслей.Добавить(СтрокаДерева.Отрасль);
	КонецЕсли;

	Для Каждого ТекЭлемент Из ПодчинЭлементы Цикл
		ТекЭлемент.Флаг = СтрокаДерева.Флаг;
		МассиивОтраслей.Добавить(ТекЭлемент.Отрасль);
	КонецЦикла;
	Если СтрокаДерева.Флаг Тогда
		ДобавитьОтрасльОбновленнуюВТабличнуюЧасть(МассиивОтраслей);
	Иначе
		УдалитьОтрасльОбновленнуюИзТабличнойЧасти(МассиивОтраслей);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановкаРодительскогоФлажка(СтрокаДерева)
	ЭлементРодитель = СтрокаДерева.ПолучитьРодителя();
	Если Не ЭлементРодитель = Неопределено Тогда
		ЭлементыРодителя = ЭлементРодитель.ПолучитьЭлементы();
		ЕстьФлаги = Ложь;
		Для Каждого ТекЭлемент Из ЭлементыРодителя Цикл
			ЕстьФлаги = ЕстьФлаги Или ТекЭлемент.Флаг;
		КонецЦикла;
		ЭлементРодитель.Флаг = ЕстьФлаги;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОтрасльОбновленнуюВТабличнуюЧасть(Знач МассивОтраслей)
	Для Каждого Отрасль Из МассивОтраслей Цикл
		ОтборПоОтрасли = Новый Структура("Отрасль", Отрасль);
		МассивСтрок = ОтраслиОбновленные.НайтиСтроки(ОтборПоОтрасли);
		Если МассивСтрок.Количество() = 0 Тогда
			НовСтр = ОтраслиОбновленные.Добавить();
			НовСтр.Отрасль = Отрасль;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтрасльОбновленнуюИзТабличнойЧасти(Знач МассивОтраслей)
	Для Каждого Отрасль Из МассивОтраслей Цикл
		ОтборПоОтрасли = Новый Структура("Отрасль", Отрасль);
		МассивСтрок = ОтраслиОбновленные.НайтиСтроки(ОтборПоОтрасли);
		Для Каждого СтрокаНаУдаление Из МассивСтрок Цикл
			ОтраслиОбновленные.Удалить(СтрокаНаУдаление);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОтраслей()
	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЗакупки_ОтраслиОбновленные.Ссылка КАК Отрасль,
	|	КонтурЗакупки_ОтраслиОбновленные.ЭтоГруппа КАК ЭтоГруппа,
	|	КонтурЗакупки_ОтраслиОбновленные.Код КАК Код
	|ИЗ
	|	Справочник.КонтурЗакупки_ОтраслиОбновленные КАК КонтурЗакупки_ОтраслиОбновленные
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтурЗакупки_ОтраслиОбновленные.Ссылка ИЕРАРХИЯ";
	РезЗапроса = Запрос.Выполнить();

	Выборка = РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

	ЗаполнитьСтрокиДереваОтраслей(Выборка, ДеревоОтраслейОбновленных);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиДереваОтраслей(Выборка, РодительДереваОтраслей)
	ЭлементыДереваРодителя = РодительДереваОтраслей.ПолучитьЭлементы();
	Пока Выборка.Следующий() Цикл
		СтрокаДерева = ЭлементыДереваРодителя.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);
		Выборка1 = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		ЗаполнитьСтрокиДереваОтраслей(Выборка1, СтрокаДерева);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстиновитьФлагиДереваОтраслей(Знач РодительДереваОтраслей, МассивВыбраныхОтраслей)
	ЭлементыДереваРодителя = РодительДереваОтраслей.ПолучитьЭлементы();
	Если ЭлементыДереваРодителя.Количество() > 0 Тогда
		Для Каждого ЭлементДереваРодителя Из ЭлементыДереваРодителя Цикл
			Если ЭлементДереваРодителя.ЭтоГруппа Тогда
				ЭлементДереваРодителя.Флаг = УстиновитьФлагиДереваОтраслейУровень2(ЭлементДереваРодителя,
					МассивВыбраныхОтраслей);
			Иначе
				Если МассивВыбраныхОтраслей.Найти(ЭлементДереваРодителя.Отрасль) = Неопределено Тогда
					ЭлементДереваРодителя.Флаг = Ложь;
				Иначе
					ЭлементДереваРодителя.Флаг = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция УстиновитьФлагиДереваОтраслейУровень2(Знач РодительДереваОтраслей, МассивВыбраныхОтраслей)
	ЕстьФлаги = Ложь;
	ЭлементыДереваРодителя = РодительДереваОтраслей.ПолучитьЭлементы();
	Если ЭлементыДереваРодителя.Количество() > 0 Тогда
		Для Каждого ЭлементДереваРодителя Из ЭлементыДереваРодителя Цикл
			Если МассивВыбраныхОтраслей.Найти(ЭлементДереваРодителя.Отрасль) = Неопределено Тогда
				ЭлементДереваРодителя.Флаг = Ложь;
			Иначе
				ЭлементДереваРодителя.Флаг = Истина;
				ЕстьФлаги = ЕстьФлаги Или Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат ЕстьФлаги;
КонецФункции

#КонецОбласти