#Область ПеременныеМодуля

&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _КлиентскиеВызовы;

&НаКлиенте
Перем СписокВыбораВидТары;

&НаКлиенте
Перем СписокВыбораТипТС;

&НаКлиенте
Перем СписокВыбораТипПогрузки;

&НаКлиенте
Перем СписокВыбораТипКузова;

&НаКлиенте
Перем СписокВыбораСостояниеГруза;

&НаКлиенте
Перем _Платформа;

&НаСервере
Перем _МодульЯдроНаСервере;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовок();
	
	Если Параметры.Свойство("ОбщийКонтекстКлиентСервер") Тогда
		ОбщийКонтекстКлиентСервер = Параметры.ОбщийКонтекстКлиентСервер;
	КонецЕсли;
	
	Если Параметры.Свойство("СтрокаСписка") Тогда
		СтрокаСписка = Параметры.СтрокаСписка;
	КонецЕсли;
	
	Если ЭтоНовыйДокументЗЗ() Тогда
		Модифицированность = Истина;
	КонецЕсли;

	_ДокументыОснования = ОпределитьДокументыОснованияИОсновной(Параметры);

	УстановитьСписокВыбораМетодОпределенияМассы();

	МодульОбъекта = ОбработкаОбъект();

	МассивТиповКонтрагент = Новый Массив;
	МассивТиповКонтрагент.Добавить(МодульОбъекта.СправочникТипОрганизации());
	МассивТиповКонтрагент.Добавить(МодульОбъекта.СправочникТипКонтрагенты());
	Элементы.рл_СвГО.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);
 	Элементы.рл_СвПрв.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);
  	Элементы.рл_АдрПунктОргВладИнфр.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповКонтрагент);

	МассивТиповКонтрагент = Новый Массив;
	МассивТиповКонтрагент.Добавить(МодульОбъекта.СправочникТипКонтрагенты());

	МассивТиповДоговоры = Новый Массив;
	МассивТиповДоговоры.Добавить(МодульОбъекта.СправочникТипДоговорыКонтрагентов());

	МассивТиповСотрудники = Новый Массив;
	МассивТиповСотрудники.Добавить(МодульОбъекта.СправочникТипФизическиеЛица());
	
	МассивТиповВалюта = Новый Массив;
	МассивТиповВалюта.Добавить(МодульОбъекта.СправочникТипВалюты());
	Элементы.рл_ОпГрузЦеннГруз_Валюта.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповВалюта);
	
	МассивТиповНоменклатура = Новый Массив;
	МассивТиповНоменклатура.Добавить(МодульОбъекта.СправочникТипНоменклатура());
	Элементы.рл_ОпГрузНоменклатура.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповНоменклатура);
	
	Если _ДокументыОснования.Количество() > 0 Тогда
		ЗаполнитьДокументыОснования(_ДокументыОснования);
		ЗаполнитьДанныеФормы();
	КонецЕсли;
	
	//УстановитьСписокВыбора_ПунктПод_АдрПунктПод(); 
	
	УстановитьЗаголовокГруппыДатыИВремя();
	УстановитьУсловноеОформлениеНаСервере();
	
	ИдентификаторыГО = МодульОбъекта.ИдентификаторыЭДО(рл_СвГО, Истина);
	ИдГО = ИдентификаторыГО.ID;
	ИдентификаторыПВ = МодульОбъекта.ИдентификаторыЭДО(рл_СвПрв, Ложь);
	ИдПрв = ИдентификаторыПВ.ID;
	
	РежимПереотправки = Ложь;
	
	ОпределитьЗапретРедактирования();
	ДоступностьФормы();
		
	ПроверитьЭлектроннуюЗаказЗаявку();
	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();
	ПоказатьОтветныйТитулЗЗ();
	
	ДопПеременные = Новый Соответствие;
	
	Если ЭтоНовыйДокументЗЗ() Тогда
		
		ДействиеМетрики = МодульОбъекта.Метрика_НазваниеДействий().СозданиеЗЗ;
		
	Иначе
		
		ДействиеМетрики = МодульОбъекта.Метрика_НазваниеДействий().ОткрытиеФормыЗЗ;
		ДопПеременные.Вставить(МодульОбъекта.Метрика_КлючОшибки(), Метрики_ПредставлениеОшибокВМассиве());
		
	КонецЕсли;
	
	МодульОбъекта.Метрика_ЗаполнитьВыбранныеДокументыПоТипам(ДопПеременные, _ДокументыОснования);
	ДопПеременные.Вставить(МодульОбъекта.Метрика_КлючИдентификатораПеревозочногоДокумента(), Строка(ИдентификаторЗЗ));
	
	НаименованиеФормы = Метрика_НаименованиеФормы();
	МодульОбъекта.Метрика_ДобавитьСтатистику_ПоКонтексту(ДействиеМетрики, ДопПеременные, , НаименованиеФормы);
	
	Ядро = Модуль_Ядро();
	Ядро.СписокОшибок_Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьКомандФормы(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность
		И НЕ РежимПереотправки Тогда
		
		Отказ = Истина;
		Если ЗавершениеРаботы = Истина Тогда
			ТекстПредупреждения = "Настройки были изменены. Все изменения будут потеряны.";
			Возврат;
		КонецЕсли;

		Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВопросаОЗакрытии", ЭтаФорма);
		ПоказатьВопрос(Оповещение,"Настройки были изменены, ВЫЙТИ без сохранения?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВопросаОЗакрытии(РезультатВопроса,ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ЭтаФорма.Закрыть();	
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(СтрокаСписка);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура рл_СвГООткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
 	Если НельзяОткрыть(рл_СвГО, "рл_СвГО") Тогда
		Возврат;	
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвГО);
	
	ДополнительныеПараметры = Новый Структура;
 	ДополнительныеПараметры.Вставить("ИмяРеквизита", "рл_СвГО");

	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаУчастника", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура рл_СвПрвОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
  	Если НельзяОткрыть(рл_СвПрв, "рл_СвПрв") Тогда
		Возврат;	
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаОбъект", рл_СвПрв);
	
	ДополнительныеПараметры = Новый Структура;

	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаУчастника", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура рл_СвГОПриИзменении(Элемент)
	
	УстановитьСписокВыбора_ПунктПод_АдрПунктПод();
	
	Если ЗначениеЗаполнено(рл_СвГО) 
		И Не ЕстьИдентификаторыЭДО(рл_СвГО, Истина) Тогда
		ПредложитьСопоставитьКонтрагента("рл_СвГО");
	КонецЕсли;
  	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_СвПрвПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(рл_СвПрв) 
		И Не ЕстьИдентификаторыЭДО(рл_СвПрв, Ложь) Тогда
		ПредложитьСопоставитьКонтрагента("рл_СвПрв");
	КонецЕсли;
  	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура рл_РекизитПриИзмененииНаСервере(ЗначениеРеквизита, ИмяРеквизита)
	
	Модифицированность = Истина;
	
	МодульОбъекта = ОбработкаОбъект();
	
	ДанныеОбъекта = МодульОбъекта.ДанныеОбъекта(ЗначениеРеквизита, ИмяРеквизита);
	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеОбъекта, ЭтаФорма, ИмяРеквизита + "_");
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ДатаЗакПриИзменении(Элемент)

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_НомЗакПриИзменении(Элемент)

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_ПунктПод_АдрПунктПод_Адрес_АдрИнф_АдрТекстПриИзменении(Элемент)

	Адреса = ПолучитьИзВременногоХранилища(ХранениеАдресаПодачи);
	Адрес = рл_ПунктПод_АдрПунктПод_Адрес_АдрИнф_АдрТекст;
	Для Каждого СтруктураАдреса Из Адреса Цикл
		Если СтруктураАдреса.Адрес = Адрес Тогда
			рл_ПунктПод_АдрПунктПод_Адрес_АдрРФ = СтруктураАдреса.ЗначениеАдреса;                     
		КонецЕсли;
	КонецЦикла;
	//Добавить_АдрПункт();
	ОбработатьАдрПункт();
	Модифицированность = Истина;
	
КонецПроцедуры 

Процедура ОбработатьАдрПункт()
	
	МодульОбъекта = ОбработкаОбъект();
	мДокументыОснования = ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	АдрПункт = Новый Массив;
	Для Каждого Пункт Из рл_АдрПункт Цикл
		НовыйПункт = МодульОбъекта.АдрПунктТип(); 
		ЗаполнитьЗначенияСвойств(НовыйПункт, Пункт);
		НовыйПункт.АдресПункт.Адрес.АдрИнф.АдрТекст = Пункт.АдресПункт_Адрес_АдрИнф_АдрТекст;
		НовыйПункт.АдресПункт.Адрес.АдрИнф.КодСтр = Пункт.АдресПункт_Адрес_АдрИнф_КодСтр;
		НовыйПункт.АдресПункт.Адрес.АдрРФ = Пункт.АдресПункт_Адрес_АдрРФ;
		АдрПункт.Добавить(НовыйПункт);
	КонецЦикла;

	ДанныеАдреса = Новый Структура;
	ДанныеАдреса.Вставить("Адрес", рл_ПунктПод_АдрПунктПод_Адрес_АдрИнф_АдрТекст);
	ДанныеАдреса.Вставить("АдресРФ", рл_ПунктПод_АдрПунктПод_Адрес_АдрРФ);
	ДанныеАдреса.Вставить("КодСтраны", рл_ПунктПод_АдрПунктПод_Адрес_АдрИнф_КодСтр);

	МодульОбъекта.ОбработатьАдрПункт(мДокументыОснования, АдрПункт, рл_СвГО, рл_Контрагент, ДанныеАдреса);
	
	рл_АдрПункт.Очистить();
	Для Каждого текПункт Из АдрПункт Цикл
		НовыйПункт = рл_АдрПункт.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйПункт, текПункт);
		НовыйПункт.АдресПункт_Адрес_АдрИнф_АдрТекст = текПункт.АдресПункт.Адрес.АдрИнф.АдрТекст;
		НовыйПункт.АдресПункт_Адрес_АдрИнф_КодСтр = текПункт.АдресПункт.Адрес.АдрИнф.КодСтр;
		НовыйПункт.АдресПункт_Адрес_АдрРФ = текПункт.АдресПункт.Адрес.АдрРФ;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура рл_ПарТСПрвз_ТипПогрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если СписокВыбораТипПогрузки = Неопределено Тогда
		СписокВыбораТипПогрузки = СписокВыбораТипПогрузки();
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораТипаПогрузки", ЭтаФорма);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораТипПогрузки, Оповещение, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораТипаПогрузки(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		рл_ПарТСПрвз_ТипПогр = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ПарТСПрвз_ТипПогрАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СписокВыбораТипПогрузки = Неопределено Тогда
		СписокВыбораТипПогрузки = СписокВыбораТипПогрузки();
	КонецЕсли;
	ВыполнитьАвтоПодбор(СписокВыбораТипПогрузки, Текст, Элемент.ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура рл_ПарТСПрвз_ТипКузНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если СписокВыбораТипКузова = Неопределено Тогда
		СписокВыбораТипКузова = СписокВыбораТипКузова();
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораТипаКузова", ЭтаФорма);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораТипКузова, Оповещение, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораТипаКузова(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		рл_ПарТСПрвз_ТипКуз = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ПарТСПрвз_ТипКузАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СписокВыбораТипКузова = Неопределено Тогда
		СписокВыбораТипКузова = СписокВыбораТипКузова();
	КонецЕсли;
	ВыполнитьАвтоПодбор(СписокВыбораТипКузова, Текст, Элемент.ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура БаннерБольшеВозможностейТекстГиперссылкаНажатие(Элемент)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().БольшеВозможностейЛогистики;
	Метрика_ПриВыполненииДействия(ДействиеМетрики);
	
	_КлиентскиеВызовы.ОткрытьСтраницуСИнформациейОМодулеЛогистики();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОшибки

&НаКлиенте
Процедура ОшибкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда
		
		ТекДанные = Элементы.Ошибки.ТекущиеДанные;
		Если СтрНайтиЛок(ЭтаФорма.ИмяФормы, ТекДанные.ИмяФормы) = 0 Тогда
			
			ОбязательныеРеквизиты = ОбязательныеРеквизитыФормы(ТекДанные.ИмяФормы);
			
			Попытка
				ЗначениеРодителя = ЭтаФорма[ТекДанные.ИмяРеквизитаРодителя];
			Исключение
				ЗначениеРодителя = Неопределено;
			КонецПопытки;
			
			Если ЗначениеРодителя <> Неопределено И ЗначениеЗаполнено(ЗначениеРодителя) Тогда
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("СсылкаНаОбъект", ЗначениеРодителя); 
				ПараметрыФормы.Вставить("ЗначениеРеквизита", ЗначениеРодителя);
				ПараметрыФормы.Вставить("ИмяТекущегоЭлемента", ТекДанные.НазваниеРеквизита);
				ПараметрыФормы.Вставить("ОбязательныеРеквизиты", ОбязательныеРеквизиты);
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ИмяРеквизита", ТекДанные.ИмяРеквизитаРодителя);
				ДополнительныеПараметры.Вставить("ЗначениеРеквизита", ЗначениеРодителя);
				
				Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеЗакрытияФормыРедактирования", ЭтаФорма, ДополнительныеПараметры);
				
				_КлиентскиеВызовы.ОткрытьФормуПоИмени(ТекДанные.ИмяФормы, ПараметрыФормы, ЭтаФорма, Оповещение);

			КонецЕсли;
			
		Иначе
			
			Попытка
				ЭтаФорма.ТекущийЭлемент = Элементы[ТекДанные.НазваниеРеквизита];
			Исключение
			КонецПопытки;
				
			Если ЗначениеЗаполнено(ТекДанные.ИдентификаторСтроки) Тогда
				Элементы[ТекДанные.ИмяРеквизитаТЧ].ТекущаяСтрока = Число(ТекДанные.ИдентификаторСтроки);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекДанные.НазваниеРеквизита = "рл_СвГО"
			Или ТекДанные.НазваниеРеквизита = "рл_СвПрв" Тогда
			Если СтрНайтиЛок(ТекДанные.Представление, "ЭДО - совпадают идентификаторы") > 0 Тогда
			Иначе
				ПредложитьСопоставитьКонтрагента(ТекДанные.НазваниеРеквизита);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеЗакрытияФормыРедактирования(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия <> Неопределено Тогда
		Если ДополнительныеПараметры.Свойство("ИмяРеквизита") Тогда
			Если ЭтоРеквизитXML(ДополнительныеПараметры.ИмяРеквизита) И ТипЗнч(РезультатЗакрытия) = Тип("Строка") Тогда
				ЭтаФорма[ДополнительныеПараметры.ИмяРеквизита] = РезультатЗакрытия;
				ЭтаФорма[КлючПредставление(ДополнительныеПараметры.ИмяРеквизита)] = ЗначениеПредставлениеПоСтрокеXML(РезультатЗакрытия);
			ИначеЕсли ДополнительныеПараметры.ИмяРеквизита = "рл_СвГО" Тогда	
				УстановитьСписокВыбора_ПунктПод_АдрПунктПод();
			КонецЕсли;		
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОснования

&НаКлиенте
Процедура ДокументыОснованияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = ДокументыОснования.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументОснование) Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ДокументОснование);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыРлОпГруз

&НаКлиенте
Процедура рл_ОпГрузПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузПередУдалением(Элемент, Отказ)

КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузВидТарПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если СписокВыбораВидТары = Неопределено Тогда
		СписокВыбораВидТары = СписокВыбораВидТары(); 
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеДляВыбора", СписокВыбораВидТары);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИндентификаторСтроки", Элементы.рл_ОпГруз.ТекущаяСтрока);

	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораВидаТары", ЭтаФорма, ДополнительныеПараметры);

	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаВыбораЗначений", ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораВидаТары(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		ТекущиеДанные = рл_ОпГруз.НайтиПоИдентификатору(ДополнительныеПараметры.ИндентификаторСтроки);
		ТекущиеДанные.ВидТар = ЗначениеВыбора.Значение;
		ТекущиеДанные.ВидТарПредставление = ЗначениеВыбора.Представление;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузВидТарПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если СписокВыбораВидТары = Неопределено Тогда
		СписокВыбораВидТары = СписокВыбораВидТары(); 
	КонецЕсли;
	
	ТекущиеДанные = Элементы.рл_ОпГруз.ТекущиеДанные;
	ЭлементСписка = СписокВыбораВидТары.НайтиПоЗначению(ВыбранноеЗначение);
	Если ЭлементСписка = Неопределено Тогда
		ТекущиеДанные.ВидТар = "00";
		ТекущиеДанные.ВидТарПредставление = "-";
	Иначе
		ТекущиеДанные.ВидТарПредставление = ?(ЭлементСписка.Представление = "", ЭлементСписка.Значение, ЭлементСписка.Представление);
		ТекущиеДанные.ВидТар = ЭлементСписка.Значение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузВидТарПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	Если СписокВыбораВидТары = Неопределено Тогда
		СписокВыбораВидТары = СписокВыбораВидТары(); 
	КонецЕсли;

	ТекущиеДанные = Элементы.рл_ОпГруз.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(Текст) Тогда
		ТекущиеДанные.ВидТар = "00";
		ТекущиеДанные.ВидТарПредставление = "не указан";
	Иначе
		СтрокаПоиска = СтрокаПоискаФильтра(Текст, Элемент.ТекстРедактирования);
		Если СтрокаПоиска = Неопределено Тогда
			ТекущиеДанные.ВидТар = "00";
			ТекущиеДанные.ВидТарПредставление = "не указан";
		Иначе
			ДанныеВыбора = СписокЗначенийНайти(СтрокаПоиска, СписокВыбораВидТары);
			Если ДанныеВыбора.Количество() > 0 Тогда
				ТекущиеДанные.ВидТарПредставление = ?(ДанныеВыбора[0].Представление = "", ДанныеВыбора[0].Значение, ДанныеВыбора[0].Представление);
				ТекущиеДанные.ВидТар = ДанныеВыбора[0].Значение;
			Иначе
				ТекущиеДанные.ВидТар = "00";
				ТекущиеДанные.ВидТарПредставление = "не указан";
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;  

КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузВидТарПредставлениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.рл_ОпГруз.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидТарПредставление) Тогда
		ТекущиеДанные.ВидТар = "00";
		ТекущиеДанные.ВидТарПредставление = "не указан";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузСостГрузНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если СписокВыбораСостояниеГруза = Неопределено Тогда
		СписокВыбораСостояниеГруза = СписокВыбораСостояниеГруза();
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура("ИндентификаторСтроки", Элементы.рл_ОпГруз.ТекущаяСтрока);
	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораСостоянияГруза", ЭтаФорма, ДополнительныеПараметры);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораСостояниеГруза, Оповещение, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораСостоянияГруза(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		ТекущиеДанные = рл_ОпГруз.НайтиПоИдентификатору(ДополнительныеПараметры.ИндентификаторСтроки);
		ТекущиеДанные.СостГруз = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузСостГрузАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СписокВыбораСостояниеГруза = Неопределено Тогда
		СписокВыбораСостояниеГруза = СписокВыбораСостояниеГруза();
	КонецЕсли;
	ВыполнитьАвтоПодбор(СписокВыбораСостояниеГруза, Текст, Элемент.ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузМасГруз_МасБрутЗначПриИзменении(Элемент)

	Заполнить_техМасБрутЗнач();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_ОпГрузКолГрМестПриИзменении(Элемент)

	Заполнить_техКолГрМест();
 	Модифицированность = Истина;

КонецПроцедуры 

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыРлАдрПункт

&НаКлиенте
Процедура рл_АдрПунктАдресПункт_Адрес_АдрИнф_АдрТекстНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.рл_АдрПункт.ТекущиеДанные; 
	Элемент.СписокВыбора.Очистить();
	СписокВыбораАдреса = СписокВыбораАдреса(ТекущиеДанные.ОргВладИнфр, ТекущиеДанные.техДокОсн, ТекущиеДанные.АдресПункт_Адрес_АдрИнф_АдрТекст);
	Для Каждого ЭлементСписка Из СписокВыбораАдреса Цикл
		
		Элемент.СписокВыбора.Добавить(ЭлементСписка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура рл_АдрПунктАдресПункт_Адрес_АдрИнф_АдрТекстПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.рл_АдрПункт.ТекущиеДанные; 
	Адреса = ПолучитьИзВременногоХранилища(ХранениеАдреса);
	Адрес = ТекущиеДанные.АдресПункт_Адрес_АдрИнф_АдрТекст;
	Для Каждого СтруктураАдреса Из Адреса Цикл
		Если СтруктураАдреса.Адрес = Адрес Тогда
			ТекущиеДанные.АдресПункт_Адрес_АдрРФ = СтруктураАдреса.ЗначениеАдреса;                     
		КонецЕсли;
	КонецЦикла;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура рл_АдрПунктПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	РежимПереотправки = Ложь;
	СохранитьЧерновик();
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ЗаписатьЗЗ;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить(
		_КлиентскиеВызовы.Метрика_КлючИдентификатораПеревозочногоДокумента(), Строка(ИдентификаторЗЗ));
		
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючОшибки(), Метрики_ПредставлениеОшибокВМассиве());
	Метрика_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЭлектроннуюЗаказЗаявку(Команда)
	
	Результат = ПодготовитьЭлектроннуюЗаказЗаявку(Ложь);
	
	Если Результат <> Неопределено Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(Результат);
		ТекстовыйДокумент.Показать("Заказ-заявка");
	КонецЕсли;
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПоказатьЭЗЗ;
	Метрика_ПриВыполненииДействия(ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
		
	Если ТипЗнч(СтрокаСписка) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(СтрокаСписка.LetterId) Тогда
			ПоказатьПредупреждение(Неопределено, "Нельзя удалять отправленный документ");
		Иначе
			Оповещение = Новый ОписаниеОповещения("Оповещение_ОтветНаВопросУдаления", ЭтаФорма);
			ПоказатьВопрос(Оповещение, "Вы действительно хотите удалить данные по заказ-заявке?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ОтветНаВопросУдаления(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса <> Неопределено Тогда
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			УдалитьНаСервере();
			СтрокаСписка = Истина; // Обновить весь список
			ЭтаФорма.Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДатуВремяПодачиТекущим(Команда)

	рл_ПунктПод_ДатВрПод = ТекущаяДата();

КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьЭлектроннуюЗаказЗаявку(Команда)
	
	ПредставлениеОшибокВМассивеДо = Метрики_ПредставлениеОшибокВМассиве();
	КоличествоОшибокДо = ФорматированиеЧислаСтрокой(ПредставлениеОшибокВМассивеДо.Количество());
	
	ПроверитьЭлектроннуюЗаказЗаявку();
	
	ПредставлениеОшибокВМассивеПосле = Метрики_ПредставлениеОшибокВМассиве();
	КоличествоОшибокПосле = ФорматированиеЧислаСтрокой(ПредставлениеОшибокВМассивеПосле.Количество());
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПроверитьНаНаличиеОшибок;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючИдентификатораПеревозочногоДокумента(),
		Строка(ИдентификаторЗЗ));
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючКоличествоОшибокДо(), КоличествоОшибокДо);
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючКоличествоОшибокПосле(), КоличествоОшибокПосле);
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючОшибкиПосле(), ПредставлениеОшибокВМассивеПосле);
		
	Метрика_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);
	
КонецПроцедуры

&НаКлиенте
Функция ФорматированиеЧислаСтрокой(ВходящееЧисло)
	Возврат Формат(ВходящееЧисло, "ЧН=; ЧГ=");
КонецФункции

&НаКлиенте
Процедура ПодборДокументовОснования(Команда)

	ПараметрыФормы = Новый Структура;
	мДокументыОснования = Новый Массив;
	Для Каждого СтрокаОснования Из ДокументыОснования Цикл
		мДокументыОснования.Добавить(СтрокаОснования.ДокументОснование);	
	КонецЦикла;
	ПараметрыФормы.Вставить("ДокументыОснования", мДокументыОснования);
	ПараметрыФормы.Вставить("Период", Новый СтандартныйПериод(рл_ДатаЗак, ТекущаяДата()));
	ПараметрыФормы.Вставить("РежимПодбораИзЗЗ", Истина);
	
	ДополнительныеПараметры = Новый Структура;

	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеПодбораДокументовОснования", ЭтаФорма, ДополнительныеПараметры);
  	_КлиентскиеВызовы.ОткрытьФормуПодбораДокументов(ПараметрыФормы, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеПодбораДокументовОснования(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия <> Неопределено 
		И РезультатЗакрытия.ДокументыОснования.Количество() > 0 Тогда
		
		ПерезаполнитьШапку = Ложь;
		ДокументыОснования.Очистить();
		Если РезультатЗакрытия.ДокументыОснования.Найти(ОсновнойДокумент) = Неопределено Тогда
			ОсновнойДокумент = РезультатЗакрытия.ДокументыОснования[0];
			ПерезаполнитьШапку = Истина;
		КонецЕсли;
		
		Для Каждого ВыбранныйДокумент Из РезультатЗакрытия.ДокументыОснования Цикл	
			НоваяСтрока = ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование = ВыбранныйДокумент;
			Если НоваяСтрока.ДокументОснование = ОсновнойДокумент Тогда
				НоваяСтрока.ГлавныйДокумент = Истина;	
			КонецЕсли;
		КонецЦикла;
		
		ПерезаполнитьОпГруз = Истина;
		ПерезаполнитьАдрПункт = Истина;
		ЗаполнитьДанныеФормы(ПерезаполнитьШапку, ПерезаполнитьОпГруз, ПерезаполнитьАдрПункт);
		ПроверитьЭлектроннуюЗаказЗаявку();
		Модифицированность = Истина;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДокументОсновным(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.ДокументыОснования.ТекущаяСтрока);

	Оповещение = Новый ОписаниеОповещения("Оповещение_ОтветУстановитьДокументОсновным", ЭтаФорма, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Установить документ основным?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ОтветУстановитьДокументОсновным(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> Неопределено Тогда
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Поиск = Новый Структура("ГлавныйДокумент", Истина);
			НашлиСтроки = ДокументыОснования.НайтиСтроки(Поиск);
			Для Каждого НашлиСтроку Из НашлиСтроки Цикл
				НашлиСтроку.ГлавныйДокумент = Ложь;
			КонецЦикла;
			ТекущиеДанные = ДокументыОснования.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
			ТекущиеДанные.ГлавныйДокумент = Истина;
			ОсновнойДокумент = ТекущиеДанные.ДокументОснование;
			ДокументыОснования.Сортировать("ГлавныйДокумент Убыв");
			Модифицированность = Истина;
		КонецЕсли;    
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправитьИсходящий(Команда)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПодписатьИОтправить;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("Resend", РежимПереотправки);
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючИдентификатораПеревозочногоДокумента(), Строка(ИдентификаторЗЗ));
	ДополнитьДопПеременныеИдентификаторамиУчастников(ДопПеременные);
	
	Метрика_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);
	
	Если РежимПереотправки Тогда
		ПодписатьИОтправитьПовторноИсходящийДокумент();
	Иначе
		ПодписатьИОтправитьИсходящийДокумент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьДопПеременныеИдентификаторамиУчастников(ДопПеременные)
	
	СтруктураУчастников = Новый Структура();
	
	УчастникГО = _КлиентскиеВызовы.Контракт_СтруктураУчастника(рл_СвГО, Истина);
	СтруктураУчастников.Вставить("УчастникГО", УчастникГО);
	
	УчастникПер = _КлиентскиеВызовы.Контракт_СтруктураУчастника(рл_СвПрв, Ложь);
	СтруктураУчастников.Вставить("УчастникПер", УчастникПер);
	
	ЗаполнитьИдентификаторыЭДОУчастниковНаСервере(СтруктураУчастников);
	
	УчастникГО = СтруктураУчастников.УчастникГО;
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючBoxIDГО(), УчастникГО.Идентификатор);
	УчастникПер = СтруктураУчастников.УчастникПер;
	ДопПеременные.Вставить(_КлиентскиеВызовы.Метрика_КлючBoxIDПРВ(), УчастникПер.Идентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИдентификаторыЭДОУчастниковНаСервере(СтруктураУчастников)
	
	МодульОбъекта = ОбработкаОбъект();
	МодульОбъекта.ЗаполнитьИдентификаторыЭДОУчастников(СтруктураУчастников);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДокументНаДиск(Команда)
	
	ДокументОтправлен = ДокументОтправлен();
	Если ДокументОтправлен Тогда
		Пакет = ПодготовитьПакетНаСервере();
		ВОтправленномПакетеЕстьДокумент = Пакет.Документы.Количество() > 0;
	Иначе
		ВОтправленномПакетеЕстьДокумент = Ложь;
	КонецЕсли;
	
	ДокументПакета = Неопределено;
	
	Если ВОтправленномПакетеЕстьДокумент Тогда
		
		ДокументПакета = Пакет.Документы[0];
		
		ИмяФайла = ДокументПакета.Документооборот.ХранилищеКонтента.ИмяФайла;
		ДанныеДокумента = ДокументПакета.Документооборот.ХранилищеКонтента.Данные;
		
	Иначе
		
		ЭПДСтрокой = ПодготовитьЭлектроннуюЗаказЗаявку();
		
		ИдФайлСтрокой = СтрПолучитьСтроку(ЭПДСтрокой, 2);
		ИдФайлСтроками = СтрЗаменить(ИдФайлСтрокой, """", Символы.ПС);
		
		ИмяФайла = СтрПолучитьСтроку(ИдФайлСтроками, 2) + ".xml";
		ДанныеДокумента = ЭПДСтрокой;
		
	КонецЕсли;
	
	ПараметрыКоманды = _Платформа.ПараметрыКомандыСохранитьДокументНаДиск(ИмяФайла, ДанныеДокумента);
	
	ПараметрыКоманды.КатегорияМетрики = _КлиентскиеВызовы.Метрика_НазваниеКатегории().Перевозочные;
	ПараметрыКоманды.НазваниеФормыДляМетрики = Метрика_НаименованиеФормы();
	ПараметрыКоманды.ПредставлениеМетрики = Метрика_ПредставленияМетрик().Исходящийпакет;
	ПараметрыКоманды.ДокументДляМетрики = ДокументПакета;
	
	_Платформа.СохранитьДокументНаДиск(ПараметрыКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПечатнуюФорму(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеФормы = Метрика_НаименованиеФормы();
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПолучитьПечатнуюФорму;
	ПредставлениеМетрики = Метрика_ПредставленияМетрик().Исходящийпакет;
	
	_КлиентскиеВызовы.Метрика_ДобавитьПоведение_НажатиеКнопки(НаименованиеФормы, ДействиеМетрики, ПредставлениеМетрики);
	
	Документ = Пакет.Документы[0];
	
	ДокументОтправлен = ДокументОтправлен();
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("BoxID", Документ.Идентификаторы.BoxId);
	ДопПеременные.Вставить("DocumentType", Документ.Тип.ТипДокумента);
	
	Если ДокументОтправлен Тогда
		ДопПеременные.Вставить("LetterId", Документ.Идентификаторы.LetterId);
		ДопПеременные.Вставить("DocumentId", Документ.Идентификаторы.DocumentId);
		ДопПеременные.Вставить("Status", Документ.Статусы.Статус);
	Иначе
		ДопПеременные.Вставить("Status", Перечисление_ЛокальныеСтатусыДокумента().Подготовлен);
	КонецЕсли;
	
	КатегорияМетрики = _КлиентскиеВызовы.Метрика_НазваниеКатегории().Перевозочные;
	
	_Платформа.ПолучитьПечатнуюФормуСервераДиадок(Документ, ДопПеременные, КатегорияМетрики, ДействиеМетрики);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВДиадок(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().ПерейтиВДиадок;
	Метрика_ПриВыполненииДействия(ДействиеМетрики);
	
	_Платформа.ПерейтиВДиадок(Пакет.Документы[0]);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДокументооборот(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Пакет.Документы[0];
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().СохранитьДокументооборот;
	
	ДопПеременные = Новый Соответствие;
	ДопПеременные.Вставить("BoxID"		, Документ.Идентификаторы.BoxId);
	ДопПеременные.Вставить("LetterId"	, Документ.Идентификаторы.LetterId);
	ДопПеременные.Вставить("DocumentId", Документ.Идентификаторы.DocumentId);
	ДопПеременные.Вставить("Status", Документ.Статусы.Статус);
	
	Метрика_ПриВыполненииДействия(ДействиеМетрики, ДопПеременные);
	
	_Платформа.СохранитьДокументооборот(Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереотправитьИсходящий(Команда)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().Переотправить;
	Метрика_ПриВыполненииДействия(ДействиеМетрики);
	
	РежимПереотправки = Истина;
	ЗапретРедактирования = Ложь;
	
	СтрокаСписка.Статус = "";
	
	ПодготовитьЭлектроннуюЗаказЗаявку();
	НастроитьВидимостьКомандФормы();
	ДоступностьФормы();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТипКонтента_ЗаказЗаявка()
	Возврат "zakzvper";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидТитула_ЗаказЗаявка()
	Возврат "LogisticsOrderRequest";
КонецФункции

&НаКлиенте
Процедура НастроитьПараметрыПодписания(Команда)
	
	BoxId = ПолучитьBoxIdНаСервере();
	
	Если ЗначениеЗаполнено(BoxId) Тогда
		
		Модуль_Платформа = Модуль_Платформа();
		ПараметрыОткрытия = Модуль_Платформа.ПараметрыФормыРедактированияПолномочий();
		
		ПараметрыОткрытия.АдресЯщика = BoxId;
		ПараметрыОткрытия.ТипКонтента = ТипКонтента_ЗаказЗаявка();
		ПараметрыОткрытия.ПокупательПродавец = "Продавец";
		ПараметрыОткрытия.ВидТитула = ВидТитула_ЗаказЗаявка();
		
		Модуль_Платформа.ОткрытьФормуДиадокМодальноЛок(
			"РедактированиеПолномочийУправляемая",
			ЭтаФорма,
			ПараметрыОткрытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)
		
	Оповещение = _Платформа.НовыйОписаниеОповещения("Оповещение_ПослеОтветаПерезаполнения", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Документ заказ-заявка будет перезаполнен. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры 

&НаКлиенте
Процедура Оповещение_ПослеОтветаПерезаполнения(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПерезаполнитьШапку = Истина;
		ПерезаполнитьОпГруз = Истина;
		ПерезаполнитьАдрПункт = Истина;
		ЗаполнитьДанныеФормы(ПерезаполнитьШапку, ПерезаполнитьОпГруз, ПерезаполнитьАдрПункт);
		ПроверитьЭлектроннуюЗаказЗаявку();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ИнфраструктураМодуля

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		Модуль_Ядро = Модуль_Ядро();
		_ОбработкаОбъект.ИнициализироватьМодуль(Модуль_Ядро); 
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Функция Модуль_Платформа() Экспорт
	Возврат _Платформа;
КонецФункции

&НаКлиенте
Функция Модуль_ЯдроНаКлиенте()
	
	Возврат _КлиентскиеВызовы.Модуль_ЯдроНаКлиенте();
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьФорму(ФормаКлиентскиеВызовы, Модуль_Платформа) Экспорт
	
	_КлиентскиеВызовы = ФормаКлиентскиеВызовы;
	_Платформа = Модуль_Платформа;
	
КонецПроцедуры

&НаСервере
Функция Модуль_Ядро() Экспорт
	
	Если _МодульЯдроНаСервере = Неопределено Тогда
		АдресОбработкиЯдра = СвойствоСтруктуры(ОбщийКонтекстКлиентСервер, "АдресОбработкиЯдра");
		
		Если ЗначениеЗаполнено(АдресОбработкиЯдра) Тогда
			_МодульЯдроНаСервере = ХранилищеОбработки_Прочитать(АдресОбработкиЯдра);
		КонецЕсли;
	КонецЕсли;
	
	Возврат _МодульЯдроНаСервере;
	
КонецФункции

// Возвращает объект обработки из временного хранилища
//
// Параметры:
//  АдресОбработки - Строка - адрес обработки во временном хранилище
// 
// Возвращаемое значение:
//  ОбработкаОбъект - если обект обработки все еще загружен в память
//  Неопределено    - если объект обработки уже уничтожен
//
&НаСервереБезКонтекста
Функция ХранилищеОбработки_Прочитать(АдресОбработки)
	
	СтруктураОбработки = ПолучитьИзВременногоХранилища(АдресОбработки);
	
	Результат = СвойствоСтруктуры(СтруктураОбработки, "ОбработкаОбъект");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область ОформлениеИВидимостьФормы

&НаСервере
Процедура УстановитьЗаголовок()
	ЭтаФорма.Заголовок = "Диадок: Заказ-заявка";
КонецПроцедуры

&НаСервере
Процедура ОпределитьЗапретРедактирования()
	
	Если ТипЗнч(СтрокаСписка) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(СтрокаСписка.LetterId) Тогда
			ЗапретРедактирования = Истина;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДоступностьФормы()
	
	Элементы.ГруппаНомерДата.ТолькоПросмотр = ЗапретРедактирования;
	Элементы.ГруппаСтраницы.ТолькоПросмотр = ЗапретРедактирования;
	Элементы.ФормаСохранить.Доступность = Не ЗапретРедактирования; 

	Элементы.ДокументыОснованияПодборДокументовОснования.Доступность = Не ЗапретРедактирования;
	Элементы.ДокументыОснованияУстановитьДокументОсновным.Доступность = Не ЗапретРедактирования;
	Элементы.УстановитьДатуВремяПодачиТекущим.Доступность = Не ЗапретРедактирования;
	
КонецПроцедуры

#КонецОбласти


#Область ДанныеФормыИСохранение

&НаКлиенте
Процедура СохранитьЧерновик()
	
	СохранитьНаСервере();
	ПодготовитьЭлектроннуюЗаказЗаявку();
	СохранитьСтатусНаСервере();
	ПодготовитьСтрокуСпискаПоДаннымЧерновика();
	НастроитьВидимостьКомандФормы();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	Модифицированность = Ложь;
	
	МодульОбъекта = ОбработкаОбъект();
	
	РеквизитыЗЗ = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма, "ФормаЗЗ");
	_ДокументыОснования = ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	ПараметрыЗЗ = МодульОбъекта.ПараметрыЗЗ(ОсновнойДокумент, _ДокументыОснования, РеквизитыЗЗ);
 	МодульОбъекта.СохранитьЗначенияЭПД(МодульОбъекта.КлючИдентификатораЗЗ(), ИдентификаторЗЗ, МодульОбъекта.КлючРеквизитовЗЗ(), РеквизитыЗЗ, ПараметрыЗЗ);

КонецПроцедуры

&НаСервере
Процедура СохранитьСтатусНаСервере()
	
	МодульОбъекта = ОбработкаОбъект();

	// ошибки заполняются в процессе сохранения, статус необходимо записать после сохранения и проверок.
	ЕстьОшибки = ?(Ошибки.Количество() = 0, Ложь, Истина);
	Статус = МодульОбъекта.ОпределитьСтатусЗЗ(ЕстьОшибки);
	МодульОбъекта.СохранитьСтатусТрН(ИдентификаторЗЗ, Статус);

КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере()
	
	Если ЗначениеЗаполнено(ИдентификаторЗЗ) Тогда
		
		МодульОбъекта = ОбработкаОбъект();
		МодульОбъекта.Удалить(МодульОбъекта.КлючИдентификатораЗЗ(), ИдентификаторЗЗ);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокГруппыДатыИВремя()
	
	МодульОбъекта = ОбработкаОбъект();
	
	ЧасовойПоясСервера  = ЧасовойПоясСеанса();
	ТекущаяДатаСервера = ТекущаяДатаСеанса();
	УниверсальнаяДата = УниверсальноеВремя(ТекущаяДатаСервера, ЧасовойПоясСервера);
	СмещениеОтUTC = СмещениеСтандартногоВремени(ЧасовойПоясСервера, УниверсальнаяДата);
	
	ЗнакСмещенияUTC = ?(СмещениеОтUTC >= 0, "+", "-");
	СмещениеОтUTCВЧасах = СмещениеОтUTC / 3600;
	СтрокаСмещениеUTC = ЗнакСмещенияUTC + Строка(СмещениеОтUTCВЧасах);
	
	СмещениеОтMSKВЧасах = СмещениеОтUTCВЧасах - 3;
	ЗнакСмещенияMSK = ?(СмещениеОтMSKВЧасах >= 0, "+", "-");
	СтрокаСмещениеMSK = ЗнакСмещенияMSK + Строка(СмещениеОтMSKВЧасах);
	
	Элементы.ДекорацияСмещение.Заголовок = МодульОбъекта.СтрШаблонЛок("MSK%1 (UTC%2)", СтрокаСмещениеMSK, СтрокаСмещениеUTC);
	Элементы.рл_АдрПунктДатВрОпер.Заголовок = МодульОбъекта.СтрШаблонЛок("%1 MSK%2 (UTC%3)", "Дата/время", СтрокаСмещениеMSK, СтрокаСмещениеUTC);
	
КонецПроцедуры

#КонецОбласти


#Область СпискиВыбора

&НаСервере
Процедура УстановитьСписокВыбора_ПунктПод_АдрПунктПод(ДанныеЗЗ = Неопределено)
	
	МодульОбъекта = ОбработкаОбъект();

	Адреса = Новый Массив;
	АдресаПоПредставлению = Новый Массив; // для проверки дублей
	
	Грузоотправитель = ЭтаФорма.рл_СвГО;

	ИсточникиАдреса = Новый Массив;
	Если ЗначениеЗаполнено(Грузоотправитель) Тогда
		ИсточникиАдреса.Добавить(Грузоотправитель);
	КонецЕсли;
	
	Если ЭтаФорма.ОсновнойДокумент <> Неопределено Тогда
		ДанныеСклада = Новый Структура("Склад, СкладОтправитель, СтруктурнаяЕдиница, СкладКомпании");
		ЗаполнитьЗначенияСвойств(ДанныеСклада, ЭтаФорма.ОсновнойДокумент);
		Если ЗначениеЗаполнено(ДанныеСклада.Склад) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.Склад);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СкладОтправитель) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СкладОтправитель);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СтруктурнаяЕдиница) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СтруктурнаяЕдиница);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СкладКомпании) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СкладКомпании);
		КонецЕсли;
	КонецЕсли;

	Для Каждого Источник Из ИсточникиАдреса Цикл
		
		Поиск = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
		КонтактнаяИнформация = МодульОбъекта.ДанныеКонтактнаяИнформацияАдреса(Источник);
		Для Каждого СтрокаАдреса Из КонтактнаяИнформация Цикл
			Адрес = СтрокаАдреса.Адрес;
			Если АдресаПоПредставлению.Найти(Адрес) = Неопределено Тогда
				ЗначениеАдреса = СтрокаАдреса.АдресРФ;
				ПредставлениеАдреса = СтрокаАдреса.Адрес;
				Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, ЗначениеАдреса, ПредставлениеАдреса));	
				АдресаПоПредставлению.Добавить(Адрес)
			КонецЕсли; 
		КонецЦикла;
			
	КонецЦикла;
	
	СписокВыбораАдреса = Элементы.рл_ПунктПод_АдрПунктПод_Адрес_АдрИнф_АдрТекст.СписокВыбора;
	СписокВыбораАдреса.Очистить();
	Для Каждого СтруктураАдреса Из Адреса Цикл
		СписокВыбораАдреса.Добавить(СтруктураАдреса.Адрес, СтруктураАдреса.ПредставлениеАдреса);
	КонецЦикла;
	
	Если МодульОбъекта.ЕстьИЗаполненоСвойствоСтруктуры(ДанныеЗЗ, "ПунктПод.АдрПунктПод.Адрес.АдрИнф.АдрТекст") Тогда
		Адрес = ДанныеЗЗ.ПунктПод.АдрПунктПод.Адрес.АдрИнф.АдрТекст;
		АдресРФ = ДанныеЗЗ.ПунктПод.АдрПунктПод.Адрес.АдрРФ;
		Если ЗначениеЗаполнено(Адрес) Тогда
			Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, АдресРФ, Адрес));
			НайденныйАдрес = СписокВыбораАдреса.НайтиПоЗначению(Адрес);
			Если НайденныйАдрес = Неопределено Тогда
				СписокВыбораАдреса.Добавить(Адрес, Адрес);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ХранениеАдресаПодачи = ПоместитьВоВременноеХранилище(Адреса, УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораМетодОпределенияМассы()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("01", "Взвешивание по общей массе (код 01)");
	СписокВыбора.Добавить("02", "Взвешивание поосно (код 02)");
	СписокВыбора.Добавить("03", "Расчетная масса груза (код 03)");
	
	Для Каждого ЭлементСписка Из СписокВыбора Цикл
		Элементы.рл_техМетОпрМасс.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


#Область ПроверкаИСтатусы

&НаСервере
Функция ПодготовитьЭлектроннуюЗаказЗаявку(УчитыватьОшибки = Истина)
	
	МодульОбъекта = ОбработкаОбъект();
	Формат = "__zzTitle1";
	ПараметрыЗЗ = Новый Структура;
	ПараметрыЗЗ.Вставить("ДанныеСотрудника", Новый Структура);
	
	Если Модифицированность Тогда 
		ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма, "ФормаЗЗ");
		СообщениеЗЗ = Новый Структура;
		МодульОбъекта.ЗаменитьСсылкиНаСтруктуры(СообщениеЗЗ, ЗначенияДополнительныхСвойств);
	Иначе
		мДокументыОснования = МодульОбъекта.ДокументыОснования(МодульОбъекта.КлючИдентификатораЗЗ(), ИдентификаторЗЗ);
		Если мДокументыОснования.Найти(ОсновнойДокумент) = Неопределено
			И ЗначениеЗаполнено(ОсновнойДокумент) Тогда
			мДокументыОснования.Добавить(ОсновнойДокумент);
		КонецЕсли;
		СообщениеЗЗ = МодульОбъекта.ПодготовитьСообщениеЗЗ(Формат, ИдентификаторЗЗ, мДокументыОснования, ПараметрыЗЗ);
	КонецЕсли;

	ЕстьОшибки = ОбработатьОшибки(МодульОбъекта, СообщениеЗЗ);
	Если ЕстьОшибки И УчитыватьОшибки Тогда
		Результат = Неопределено;
	Иначе
		Результат = МодульОбъекта.СобратьXmlПоДокументу(СообщениеЗЗ, Формат, ПараметрыЗЗ);
	КонецЕсли;                            
	
	ОпределитьСтатусДокумента(ЕстьОшибки);	

	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОпределитьСтатусДокумента(ЕстьОшибки)

	МодульОбъекта = ОбработкаОбъект();

	СтатусЛокальный = МодульОбъекта.ОпределитьСтатусЗЗ(ЕстьОшибки);
	СтатусДокумента = МодульОбъекта.СтрШаблонЛок("(%1)", СтатусЛокальный);
	
	СтатусыДоОтправки = МодульОбъекта.СтатусыДоОтправки();
	Если ТипЗнч(СтрокаСписка) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(СтрокаСписка.Статус) 
			И СтатусыДоОтправки.Найти(СтрокаСписка.Статус) = Неопределено Тогда
			СтатусДокумента = МодульОбъекта.СтрШаблонЛок("(%1 %2)", СтрокаСписка.Статус, СтрокаСписка.ДополнительныйСтатус);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Возвращает значение свойства структуры или значение по умолчанию,
// если в структуре нет такого свойства.
// 
// Параметры:
//  Структура           - Структура    - Структура, которая может содержать вложенные структуры.
//  Ключ                - Строка       - Имя ключа структуры,
//  ЗначениеПоУмолчанию - Произвольный - (необязательный) возвращается в случае если в структуре нет указанного свойства.
// 
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры или ЗначениеПоУмолчанию,
//                  если в структуре нет такого свойства.
//
&НаСервереБезКонтекста
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Перем Значение;
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ЭтоСтруктура(Структура) И ЗначениеЗаполнено(Ключ) Тогда
		
		Если Структура.Свойство(Ключ, Значение) Тогда
			Результат = Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли переданное значение структурой или фиксированной структурой.
// 
// Параметры:
//  Значение - Произвольный - значение, которое нужно проверить.
// 
// Возвращаемое значение:
//   Булево - Истина, если переданое значение является структрой или фиксированной структурой.
//
&НаСервереБезКонтекста
Функция ЭтоСтруктура(Значение)
	
	Результат = Ложь;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура")
		Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПроверитьЭлектроннуюЗаказЗаявку()
	
	МодульОбъекта = ОбработкаОбъект();
	
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма, "ФормаЗЗ");
	СообщениеЗЗ = Новый Структура;
	МодульОбъекта.ЗаменитьСсылкиНаСтруктуры(СообщениеЗЗ, ЗначенияДополнительныхСвойств);

	ЕстьОшибки = ОбработатьОшибки(МодульОбъекта, СообщениеЗЗ);

	ОпределитьСтатусДокумента(ЕстьОшибки);	
		
КонецПроцедуры

&НаСервере
Функция ОбработатьОшибки(МодульОбъекта, СообщениеЗЗ)
	
	НезаполненныеРеквизиты = Новый Массив;
	ПараметрыВалидации = МодульОбъекта.ВсеПараметрыВалидацииЗЗ();
	МодульОбъекта.ПроверитьОбязательныеПоля(СообщениеЗЗ, СообщениеЗЗ, ПараметрыВалидации, НезаполненныеРеквизиты);
	МодульОбъекта.ПроверитьИдентификаторыЭДО(СообщениеЗЗ, НезаполненныеРеквизиты, "ФормаЗЗ");
	
	Ошибки.Очистить();
	Для Каждого ПараметрыПоля Из НезаполненныеРеквизиты Цикл
		
		СтрокаСОшибкой = "";
		ИдентификаторСтроки = "";
		Если ПараметрыПоля.Свойство("НомерСтрокиОшибки") И ПараметрыПоля.НомерСтрокиОшибки > 0 Тогда
			СтрокаСОшибкой = " строка " + ПараметрыПоля.НомерСтрокиОшибки;
			ИдентификаторСтроки = ЭтаФорма[ПараметрыПоля.ИмяРеквизитаТЧ][ПараметрыПоля.НомерСтрокиОшибки-1].ПолучитьИдентификатор();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыПоля.ИмяФормы) Тогда
			НоваяСтрока = Ошибки.Добавить();
			НоваяСтрока.НазваниеРеквизита = ПараметрыПоля.НазваниеРеквизита;
			Если ПараметрыПоля.Свойство("ТекстОшибки") Тогда
				НоваяСтрока.Представление = ПараметрыПоля.ТекстОшибки;
				НоваяСтрока.НекорректноЗаполнено = Истина;
			Иначе
				НоваяСтрока.Представление = "Указать: " + ПараметрыПоля.Представление + СтрокаСОшибкой;
			КонецЕсли;
			НоваяСтрока.Действие = "Указать";
			НоваяСтрока.ИмяФормы = ПараметрыПоля.ИмяФормы;
			НоваяСтрока.ИмяРеквизитаРодителя = ПараметрыПоля.ИмяРеквизитаРодителя;
			НоваяСтрока.ИмяРеквизитаТЧ = ПараметрыПоля.ИмяРеквизитаТЧ;
			НоваяСтрока.ИндексКартинки = Истина;
			НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
			Если МодульОбъекта.СтрНайтиЛок(ЭтаФорма.ИмяФормы, ПараметрыПоля.ИмяФормы) > 0 Тогда
				Попытка
					Элементы[ПараметрыПоля.НазваниеРеквизита].АвтоОтметкаНезаполненного = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ЕстьОшибки = Ошибки.Количество() > 0;
	Если ЕстьОшибки Тогда
		Элементы.ГруппаОшибки.Видимость = Истина;
	Иначе
		Элементы.ГруппаОшибки.Видимость = Ложь;
	КонецЕсли; 
	
	Возврат ЕстьОшибки;
	
КонецФункции

#КонецОбласти


#Область ДанныеФормыИСохранение

&НаСервере
Процедура ЗаполнитьДокументыОснования(_ДокументыОснования)
	
	МодульОбъекта = ОбработкаОбъект();
	
	мДокументыОснования = Новый Массив;
	
	Для Каждого ДокументОснование Из _ДокументыОснования Цикл
		
		ИдентификаторЗЗ = МодульОбъекта.ИдентификаторЗЗ(ДокументОснование, Истина);
		Если ИдентификаторЗЗ = Неопределено Тогда
			ОснованияПоИдентификаторуЗЗ = Новый Массив;
		Иначе
			ОснованияПоИдентификаторуЗЗ = МодульОбъекта.ДокументыОснования(МодульОбъекта.КлючИдентификатораЗЗ(), ИдентификаторЗЗ);
		КонецЕсли;
		
		Если ОснованияПоИдентификаторуЗЗ.Количество() = 0 Тогда
			ОснованияПоИдентификаторуЗЗ.Добавить(ДокументОснование);
		КонецЕсли;
		
		Для Каждого ОснованиеПоИдентификаторуЗЗ Из ОснованияПоИдентификаторуЗЗ Цикл
			Если мДокументыОснования.Найти(ОснованиеПоИдентификаторуЗЗ) = Неопределено Тогда
				мДокументыОснования.Добавить(ОснованиеПоИдентификаторуЗЗ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Элементы.рл_АдрПункттехДокОсн.СписокВыбора.Очистить();
	Элементы.рл_ОпГрузтехДокОсн.СписокВыбора.Очистить();
	ДокументыОснования.Очистить();
	Для Каждого ДокументОснование Из мДокументыОснования Цикл
		НоваяСтрока = ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ДокументОснование;
		Если ДокументОснование = ОсновнойДокумент Тогда
			НоваяСтрока.ГлавныйДокумент = Истина;	
		КонецЕсли;
		Элементы.рл_АдрПункттехДокОсн.СписокВыбора.Добавить(ДокументОснование);
		Элементы.рл_ОпГрузтехДокОсн.СписокВыбора.Добавить(ДокументОснование);
	КонецЦикла; 
	ДокументыОснования.Сортировать("ГлавныйДокумент Убыв");

	Если ИдентификаторЗЗ = Неопределено И ДокументыОснования.Количество() > 0  Тогда
		ИдентификаторЗЗ = МодульОбъекта.ИдентификаторЗЗ(ДокументыОснования[0].ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы(ПерезаполнитьШапку = Ложь, ПерезаполнитьОпГруз = Ложь, ПерезаполнитьАдрПункт = Ложь)
	
	МодульОбъекта = ОбработкаОбъект();	
	
	//первый всегда главный
	мДокументыОснования = ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование");

	ДанныеЗЗ = МодульОбъекта.ДанныеЗЗ(ИдентификаторЗЗ, мДокументыОснования, ПерезаполнитьШапку, ПерезаполнитьОпГруз, ПерезаполнитьАдрПункт);
	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеЗЗ, ЭтаФорма); 
	УстановитьСписокВыбора_ПунктПод_АдрПунктПод(ДанныеЗЗ);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеНаСервере()
	
	УсловноеОформление.Элементы.Очистить();
	
	//главный документ
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокументыОснования.ГлавныйДокумент");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУсловия.Использование = Истина;
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументыОснованияДокументОснование");
	
КонецПроцедуры

#КонецОбласти


#Область УниверсальныеВспомогательныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция Перечисление_ЛокальныеСтатусыДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("Черновик", "Черновик");
	Результат.Вставить("Подготовлен", "Подготовлен");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОписаниеВидаПакета(ВидПакетаID)
	
	Модуль_Ядро = Модуль_Ядро();
	
	Результат = Модуль_Ядро.Списки_ОписаниеВидаПакета(ВидПакетаID);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтоНовыйДокументЗЗ()

	Если Не ЭтоСтруктура(СтрокаСписка) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Не ЗначениеЗаполнено(СвойствоСтруктуры(СтрокаСписка, "Ключ"));

КонецФункции

&НаСервере
Функция ЗначениеПредставлениеПоСтрокеXML(РезультатЗакрытия)
	
	МодульОбъекта = ОбработкаОбъект();
	Возврат МодульОбъекта.ЗначениеПредставлениеПоСтрокеXML(РезультатЗакрытия);
	
КонецФункции

&НаКлиенте
Функция КлючПредставление(Ключ)
	
	Результат = СтрЗаменить(Ключ, "рл_", "пр_");
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция СтрНайтиЛок(Строка, ПодстрокаПоиска)
	
	// BSLLS:DeprecatedFind-off
	Результат = Найти(Строка, ПодстрокаПоиска);
	// BSLLS:DeprecatedFind-on
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область XMLВспомогательныеФункции

&НаСервереБезКонтекста
Функция ДесериализоватьXML(СтрокаXML)
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.УстановитьСтроку(СтрокаXML);
		Значение = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Исключение
		Значение = Новый Структура;
	КонецПопытки;
	
	Возврат Значение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитыXML()
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРеквизитXML(ИмяРеквизита)
	
	РеквизитыXML = РеквизитыXML();
	Если РеквизитыXML.Найти(ИмяРеквизита) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

#КонецОбласти


#Область УниверсальныеВспомогательныеПроцедурыИФункции

&НаКлиенте
Функция СписокЗначенийНайти(СтрокаПоиска, СписокЗначений, РеквизитПоиска = "Представление") Экспорт

	Результат = Новый СписокЗначений;
	Для Каждого Элемент Из СписокЗначений Цикл
		Если Найти(ВРег(Элемент[РеквизитПоиска]), ВРег(СтрокаПоиска)) > 0 Тогда
			Результат.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаКлиенте
Функция СтрокаПоискаФильтра(Текст, ТекстРедактирования) Экспорт

	МинимальноеКоличествоСимволов = 2;
	Если СтрДлина(СокрЛП(Текст)) >= МинимальноеКоличествоСимволов Тогда
		СтрокаПоиска = СокрЛП(Текст);
	ИначеЕсли СтрДлина(СокрЛП(ТекстРедактирования)) >= МинимальноеКоличествоСимволов Тогда
		СтрокаПоиска = СокрЛП(ТекстРедактирования);
	Иначе
		СтрокаПоиска = Неопределено;
	КонецЕсли;

	Возврат СтрокаПоиска;

КонецФункции

&НаКлиенте
Процедура ВыполнитьНачалоВыбораИзСписка(СписокВыбора, Оповещение, ОтображатьПредставление = Истина)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеДляВыбора", СписокВыбора);
	ПараметрыФормы.Вставить("ОтображатьПредставление", ОтображатьПредставление);
	_КлиентскиеВызовы.ОткрытьФормуПоИмени("ФормаВыбораЗначений", ПараметрыФормы, ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвтоПодбор(СписокВыбора, Текст, ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаПоиска = СтрокаПоискаФильтра(Текст, ТекстРедактирования);
	Если СтрокаПоиска = Неопределено Тогда
		ДанныеВыбора = СписокВыбора;//Новый СписокЗначений;
		СтандартнаяОбработка = Ложь;
	Иначе
		ДанныеВыбора = СписокЗначенийНайти(СтрокаПоиска, СписокВыбора); 
		Если ДанныеВыбора.Количество() = 0 Тогда
			СтандартнаяОбработка = Истина;
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область РаботаСКонтрагентами

&НаКлиенте
Процедура ПредложитьСопоставитьКонтрагента(ИмяРеквизита)
	
	ДействиеМетрики = _КлиентскиеВызовы.Метрика_НазваниеДействий().НеСопоставленУчастник;
	Представление = "Контрагент не сопоставлен";
	_КлиентскиеВызовы.Метрика_ДобавитьСтатистику_ПоКонтексту(ДействиеМетрики, , Представление);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", ИмяРеквизита);
	
	ОписаниеЗакрытияФормы = Новый ОписаниеОповещения("ОбработатьРезультатПредложенияСопоставленияКонтрагента", ЭтаФорма, ДополнительныеПараметры);
	
	ТипУчастникаБезСопоставления = СокрЛП(ТипЗнч(ЭтаФорма[ИмяРеквизита]));
	
	_КлиентскиеВызовы.ОткрытьПредложениеСопоставления(ОписаниеЗакрытияФормы, ТипУчастникаБезСопоставления);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПредложенияСопоставленияКонтрагента(РезультатПредложения, ДополнительныеПараметры) Экспорт
	
	Если РезультатПредложения = КодВозвратаДиалога.Да Тогда
		
		НачатьСопоставление(ДополнительныеПараметры.ИмяРеквизита);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСопоставление(ИмяРеквизита)

	ОписаниеЗакрытияФормы = Новый ОписаниеОповещения("ОбработатьРезультатСопоставленияКонтрагента", ЭтаФорма);
	ОтборПоКонтрагенту = ЭтаФорма[ИмяРеквизита];
	
	НужноСопоставлениеСОрганизациейДиадок = НужноСопоставлениеСОрганизациейДиадок(ИмяРеквизита);
	Если НужноСопоставлениеСОрганизациейДиадок Тогда
		
		_КлиентскиеВызовы.НачатьСопоставлениеСОрганизациейДиадок(ОтборПоКонтрагенту, ОписаниеЗакрытияФормы);
		
	Иначе
		
		ОтборПоОрганизации = ЭтаФорма["рл_Организация"];
		
		Если ЗначениеЗаполнено(ОтборПоКонтрагенту) И ЗначениеЗаполнено(ОтборПоОрганизации) Тогда
			_КлиентскиеВызовы.ОткрытьСопоставление(ОтборПоОрганизации, ОтборПоКонтрагенту, ОписаниеЗакрытияФормы);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатСопоставленияКонтрагента(РезультатСопоставления, ДополнительныеПараметры) Экспорт
	
	Если РезультатСопоставления = КодВозвратаДиалога.Да Тогда
		ПроверитьЭлектроннуюЗаказЗаявку();			
	Иначе
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьИдентификаторыЭДО(ЗначениеРеквизита, ЭтоОрганизация) 
	
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		МодульОбъекта = ОбработкаОбъект();
		
		ИдентификаторыЭДО = МодульОбъекта.ИдентификаторыЭДО(ЗначениеРеквизита, ЭтоОрганизация);
		ID = ИдентификаторыЭДО.ID;
		Если ЗначениеЗаполнено(ID) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

&НаКлиенте
Функция НужноСопоставлениеСОрганизациейДиадок(ИмяСопоставляемогоРеквизита)
	
	ИмяРеквизита = "рл_СвГО";
	
	Возврат ИмяСопоставляемогоРеквизита = ИмяРеквизита;
	
КонецФункции

#КонецОбласти


#Область ИнфраструктураМодуля

&НаСервере
Функция ОпределитьДокументыОснованияИОсновной(Параметры)
	
	МодульОбъекта = ОбработкаОбъект();

	ОсновнойДокумент = Неопределено;
	_ДокументыОснования = Новый Массив;
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		
		ОсновнойДокумент = Параметры.ДокументОснование;
		_ДокументыОснования.Добавить(ОсновнойДокумент);
		
	ИначеЕсли Параметры.Свойство("ДокументыОснования")
		И Параметры.ДокументыОснования.Количество() > 0 Тогда
		
		Если ТипЗнч(Параметры.ДокументыОснования[0]) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
			
			ИдентификаторЗЗ = Параметры.ДокументыОснования[0];
			_ДокументыОснования = МодульОбъекта.ДокументыОснования(МодульОбъекта.КлючИдентификатораЗЗ(), ИдентификаторЗЗ);
			ОсновнойДокумент = _ДокументыОснования[0];       
			
		Иначе
			_ДокументыОснования = Параметры.ДокументыОснования;
			ОсновнойДокумент = _ДокументыОснования[0];       
		КонецЕсли;
		
	Иначе
		
		_ДокументыОснования.Добавить(ОсновнойДокумент);

	КонецЕсли;  
	
	Возврат _ДокументыОснования;
	
КонецФункции

#КонецОбласти


#Область НастройкиЗначенийПоУмолчанию

&НаСервере
Процедура Заполнить_техМасБрутЗнач()
	
	рл_техМасБрутЗнач = рл_ОпГруз.Итог("МасГруз_МасБрутЗнач");
	
КонецПроцедуры

&НаСервере
Процедура Заполнить_техКолГрМест()
	
	рл_техКолГрМест = рл_ОпГруз.Итог("КолГрМест");
	
КонецПроцедуры

#КонецОбласти


#Область СпискиВыбора

&НаСервере
Функция СписокВыбораВидТары()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияВидТары");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		ПолноеНаименованиеЗначения = СокрЛП(Макет.Область(НомерСтроки, 2).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, ПолноеНаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораТипПогрузки()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияТипПогрузки");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораСостояниеГруза()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияСостояниеГруза");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораТипКузова()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияТипКузова");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция СписокВыбораАдреса(Участник, техДокОсн, ТекущиеАдрес)
	
	МодульОбъекта = ОбработкаОбъект();
	
	Адреса = Новый Массив;
	АдресаПоПредставлению = Новый Массив; // для проверки дублей 
	
	ИсточникиАдреса = Новый Массив;
	Если ЗначениеЗаполнено(Участник) Тогда
		ИсточникиАдреса.Добавить(Участник);
	КонецЕсли;
	
 	Если ЗначениеЗаполнено(техДокОсн) Тогда
		ДанныеСклада = Новый Структура("Склад, СкладПолучатель, СкладОтправитель, СтруктурнаяЕдиница, СтруктурнаяЕдиницаПолучатель, СкладКомпании");
		ЗаполнитьЗначенияСвойств(ДанныеСклада, техДокОсн);
		Если ЗначениеЗаполнено(ДанныеСклада.Склад) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.Склад);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СкладПолучатель) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СкладПолучатель);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СкладОтправитель) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СкладОтправитель);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СтруктурнаяЕдиница) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СтруктурнаяЕдиница);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СтруктурнаяЕдиницаПолучатель) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СтруктурнаяЕдиницаПолучатель);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСклада.СкладКомпании) Тогда
			ИсточникиАдреса.Добавить(ДанныеСклада.СкладКомпании);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Источник Из ИсточникиАдреса Цикл
		
		Поиск = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
		КонтактнаяИнформация = МодульОбъекта.ДанныеКонтактнаяИнформацияАдреса(Источник);
		Для Каждого СтрокаАдреса Из КонтактнаяИнформация Цикл
			Адрес = СтрокаАдреса.Адрес;
			Если АдресаПоПредставлению.Найти(Адрес) = Неопределено Тогда
				ЗначениеАдреса = СтрокаАдреса.АдресРФ;
				ПредставлениеАдреса = СтрокаАдреса.Адрес;
				Адреса.Добавить(Новый Структура("Адрес, ЗначениеАдреса, ПредставлениеАдреса", Адрес, ЗначениеАдреса, ПредставлениеАдреса));	
				АдресаПоПредставлению.Добавить(Адрес)
			КонецЕсли; 
		КонецЦикла;
			
	КонецЦикла;
		
	ХранениеАдреса = ПоместитьВоВременноеХранилище(Адреса, УникальныйИдентификатор);
	Возврат АдресаПоПредставлению;
			
КонецФункции

#КонецОбласти


#Область ПроверкаИСтатусы

&НаСервере
Процедура ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей()
	
	МодульОбъекта = ОбработкаОбъект();
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма, "ФормаЗЗ");
	СообщениеЗЗ = Новый Структура;
	МодульОбъекта.ЗаменитьСсылкиНаСтруктуры(СообщениеЗЗ, ЗначенияДополнительныхСвойств);
	
	ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Ложь);

	ПараметрыВалидации = МодульОбъекта.ВсеПараметрыВалидацииЗЗ();
	ОбязательныеРеквизитыПоФормам = МодульОбъекта.РеквизитыОбязательныхПолейПоФормам(СообщениеЗЗ, СообщениеЗЗ, ПараметрыВалидации);
	
	ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Истина);

КонецПроцедуры

&НаСервере
Процедура ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Значение)
	
	ОбязательныеРеквизиты = ОбязательныеРеквизитыФормы("ФормаТрН");
	
	Для Каждого ИмяРеквизита Из ОбязательныеРеквизиты Цикл
		Попытка
			Если ЭтоРеквизитXML(ИмяРеквизита) Тогда
				ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "рл", "пр");
			КонецЕсли;
			Элементы[ИмяРеквизита].АвтоОтметкаНезаполненного = Значение;
			Если Не ЗначениеЗаполнено(ЭтаФорма[ИмяРеквизита]) И Значение = Истина Тогда
				Элементы[ИмяРеквизита].ОтметкаНезаполненного = Истина;
			Иначе 
				Элементы[ИмяРеквизита].ОтметкаНезаполненного = Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НельзяОткрыть(ЗначениеРеквизита, ИмяРеквизита)
	
	Если Не ЗначениеЗаполнено(ЗначениеРеквизита)
		И Не ЭтоРеквизитXML(ИмяРеквизита) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ОбязательныеРеквизитыФормы(ИмяФормы)
	
	Результат = Новый Массив;
		
	Если ТипЗнч(ОбязательныеРеквизитыПоФормам) = Тип("Структура")
		И ОбязательныеРеквизитыПоФормам.Свойство(ИмяФормы) Тогда
		Результат = ОбязательныеРеквизитыПоФормам[ИмяФормы];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти


#Область ПодготовкаПакетаИОтправка

&НаСервере
Функция ПодготовитьПакетНаСервере()
	
	Ядро = Модуль_Ядро();
	Результат = Ядро.Пакеты_ПодготовитьПакет(СтрокаСписка, Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПослеОтправкиПакета(ПакетОтправлен, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ПакетОтправлен Тогда
		
		СтрокаСписка = Истина; // Обновить весь список
		Состояние("Заказ-заявка подписан и отправлен");
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПодписатьИОтправитьИсходящийДокумент()
	
	МожноПодписатьОтправить = Ошибки.Количество() = 0;
	
	Если МожноПодписатьОтправить Тогда
		
		СохранитьЧерновик();
		
		Пакет = ПодготовитьПакетНаСервере();
		ОповещениеПослеОтправкиПакета = _Платформа.НовыйОписаниеОповещения("ПослеОтправкиПакета", ЭтаФорма);
		
		ПараметрыКоманды = _Платформа.ПараметрыКомандыДействияСПакетом(
			Пакет,
			ОповещениеПослеОтправкиПакета
		);
		
		_Платформа.ПодписатьИОтправитьИсходящийПакет(ПараметрыКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправитьПовторноИсходящийДокумент()
	
	ПроверитьЭлектроннуюЗаказЗаявку();
	
	МожноПодписатьОтправить = Ошибки.Количество() = 0;
	
	Если МожноПодписатьОтправить Тогда
		
		СохранитьЧерновик();
		
		Пакет = ПодготовитьПереотправляемыйПакетНаСервере();
		ОповещениеПослеОтправкиПакета = _Платформа.НовыйОписаниеОповещения("ПослеОтправкиПакета", ЭтаФорма);
		
		ПараметрыКоманды = _Платформа.ПараметрыКомандыДействияСПакетом(
			Пакет,
			ОповещениеПослеОтправкиПакета
		);
		
		_Платформа.ПодписатьИОтправитьИсходящийПакет(ПараметрыКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПереотправляемыйПакетНаСервере()
	
	ПереотправляемыйПакет = Новый Структура;
	ПереотправляемыйПакет.Вставить("BoxId", СтрокаСписка.BoxId);
	ПереотправляемыйПакет.Вставить("LetterId", СтрокаСписка.LetterId);
	ПереотправляемыйПакет.Вставить("ПакетЭДО", СтрокаСписка.Пакет);
	
	ПодготовитьСтрокуСпискаПоДаннымЧерновика();
	
	СтрокаСписка.Пакет = Неопределено;
	СтрокаСписка.LetterId = "";
	
	Результат = ПодготовитьПакетНаСервере();
	
	ПараметрыПереотправки = Новый Структура;
	ПараметрыПереотправки.Вставить("ПереотправляемыйПакет", ПереотправляемыйПакет);
	ПараметрыПереотправки.Вставить("ВыполнитьУдалениеНеактуальныхДокументовПакета", Ложь);
	
	Результат.СлужебнаяИнформация.Вставить("ПараметрыПереотправки", ПараметрыПереотправки);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ПоказатьОтветныйТитулЗЗ() 

	МодульОбъекта = ОбработкаОбъект();  
	Если ТипЗнч(СтрокаСписка) = Тип("Структура")
		И ЗначениеЗаполнено(СтрокаСписка.LetterId) Тогда
		ОтветныйТитул = МодульОбъекта.ПолучитьОтветныйТитулЗЗ(СтрокаСписка);
		Если ОтветныйТитул <> Неопределено Тогда
			Титул2 = ПредставлениеОтветногоТитула(ОтветныйТитул);
		КонецЕсли;
	Иначе
		Титул2 = "";
  	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеОтветногоТитула(ОтветныйТитул)
	
	МодульОбъекта = ОбработкаОбъект();  
	Результат = "";
	
	СодИнфПрв = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(ОтветныйТитул, "Документ.СодИнфПрв");
	Если СодИнфПрв = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	УИД_Зак = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(СодИнфПрв, "УИД_Зак");
	ТС =  МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(СодИнфПрв, "СвТС.ТС");
	ПредставлениеТС = "ТС: <отсутствует>";
	Если ТС <> Неопределено Тогда
		Тип = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(ТС, "ПарТС.Тип");
		Марка = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(ТС, "ПарТС.Марка");
		РегНомер = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(ТС, "РегНомер");
		ПредставлениеТС = МодульОбъекта.СтрШаблонЛок("%1: %2, %3: %4","ТС", Тип, Марка, РегНомер);
	КонецЕсли;
		
	Прицеп =  МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(СодИнфПрв, "СвТС.Прицеп");
	ПредставлениеПрицеп = "Прицеп: <отсутствует>";
	Если Прицеп <> Неопределено Тогда
		Тип = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(Прицеп, "ПарТС.Тип");
		Марка = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(Прицеп, "ПарТС.Марка");
		РегНомер = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(Прицеп, "РегНомер");
		ПредставлениеПрицеп = МодульОбъекта.СтрШаблонЛок("%1: %2, %3: %4","Прицеп", Тип, Марка, РегНомер);
	КонецЕсли;
	
	Водитель =  МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(СодИнфПрв, "СвВодит");
	ПредставлениеВодитель = "Водитель: <отсутствует>";
	Если Водитель <> Неопределено Тогда
		СерВУ = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(Водитель, "СерВУ");
		НомВУ = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(Водитель, "НомВУ");
		ДатаВыдВУ = Формат(МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(Водитель, "ДатаВыдВУ"), "ДЛФ=Д");
		Тлф = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(Водитель, "Тлф");
		Фамилия = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(Водитель, "ФИО.Фамилия");
		Имя = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(Водитель, "ФИО.Имя");
		Отчество = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(Водитель, "ФИО.Отчество");
		ФИО = МодульОбъекта.СтрШаблонЛок("%1 %2 %3", Фамилия, Имя, Отчество);
		
		ПредставлениеВодитель = МодульОбъекта.СтрШаблонЛок("%1: %2; Тел: %3; %4Водительское удостоверение: %5 %6 от %7", "Водитель", ФИО, Тлф, Символы.ПС, СерВУ, НомВУ, ДатаВыдВУ);
	КонецЕсли;

	Результат = МодульОбъекта.СтрШаблонЛок("%1%2%3%4%5", ПредставлениеТС, Символы.ПС, ПредставлениеПрицеп, Символы.ПС, ПредставлениеВодитель);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПодготовитьСтрокуСпискаПоДаннымЧерновика()
	
	МодульОбъекта = ОбработкаОбъект();
	
	ЕстьОшибки = Ошибки.Количество() > 0;
	СтатусЗЗ = МодульОбъекта.ОпределитьСтатусЗЗ(ЕстьОшибки);
	СтатусПодготовлен = Перечисление_ЛокальныеСтатусыДокумента().Подготовлен;
	
	//Если СтатусЗЗ <> СтатусПодготовлен Тогда
	//	Возврат;
	//КонецЕсли;
	
	КлючИдентификатораЗЗ = МодульОбъекта.КлючИдентификатораЗЗ();
	
	ПараметрыПолученияЧерновиковЗЗ = Новый Структура;
	ПараметрыПолученияЧерновиковЗЗ.Вставить(КлючИдентификатораЗЗ, ИдентификаторЗЗ);
	ПараметрыПолученияЧерновиковЗЗ.Вставить("НачалоПериода", НачалоДня(рл_ДатаЗак));
	ПараметрыПолученияЧерновиковЗЗ.Вставить("КонецПериода", КонецДня(рл_ДатаЗак));
	
	ДанныеЧерновиковЗЗ = МодульОбъекта.ДанныеДляОтправкиТитуловЗаказЗаявка(ПараметрыПолученияЧерновиковЗЗ);
	
	Если ДанныеЧерновиковЗЗ[ОсновнойДокумент] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЧерновика = ДанныеЧерновиковЗЗ[ОсновнойДокумент];
	
	ВидПакетаID = МодульОбъекта.ИдентификаторПакетаЗаказЗаявка();
	ВидПакета = ОписаниеВидаПакета(ВидПакетаID);
	
	ЗаполнитьЗначенияСвойств(СтрокаСписка, ДанныеЧерновика);
	
	СтрокаСписка.Ключ = Строка(ДанныеЧерновика.ИдентификаторДокумента);
	СтрокаСписка.Направление = "Исходящее";
	СтрокаСписка.ВидПакета = ВидПакета.Наименование;
	СтрокаСписка.СодержимоеПакета = ВидПакета.Наименование;
	СтрокаСписка.Организация = ДанныеЧерновика.Грузоотправитель;
	СтрокаСписка.Контрагент = ДанныеЧерновика.Перевозчик;
	
	СлужебнаяИнформацияСтроки = СвойствоСтруктуры(СтрокаСписка, "СлужебнаяИнформация", Новый Структура);
	СлужебнаяИнформацияСтроки.Вставить(МодульОбъекта.КлючИдентификаторПеревозочногоДокумента(), Строка(ИдентификаторЗЗ));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьКомандФормы()
	
	СтатусПодготовлен = Перечисление_ЛокальныеСтатусыДокумента().Подготовлен;
	СтатусДокументаПодготовлен = Найти(СтатусДокумента, СтатусПодготовлен) > 0;
	ДокументБезОшибок = Ошибки.Количество() = 0;
	
	Если РежимПереотправки Тогда
		ЭтоНовыйДокумент = Истина;
		ДокументОтправлен = Ложь;
	Иначе
		ЭтоНовыйДокумент = ЭтоНовыйДокументЗЗ();
		ДокументОтправлен = ДокументОтправлен();
	КонецЕсли;
	
	ДоступныеДействияПодписатьИОтправить = Ложь;
	ДоступныеДействияНастроитьПараметрыПодписания = Ложь;
	
	Если Не ЭтоНовыйДокумент И ДокументБезОшибок Тогда
	
		Пакет = ПодготовитьПакетНаСервере();
		Документ = Пакет.Документы[0];
		
		Ядро = Модуль_ЯдроНаКлиенте();
		ДоступныеДействия = Ядро.Документы_ДоступныеДействия(Документ);
		
		ДоступныеДействияПодписатьИОтправить = ДоступныеДействия.ПодписатьИОтправить;
		ДоступныеДействияНастроитьПараметрыПодписания = ДоступныеДействия.НастроитьПараметрыПодписания;
		
		Элементы.ПередатьНаСогласование.Видимость = ДоступныеДействия.ПередатьНаСогласование;
		Элементы.ПередатьНаПодпись.Видимость = ДоступныеДействия.ПередатьНаПодпись;
		Элементы.ПередатьПоМаршруту.Видимость = ДоступныеДействия.ПередатьПоМаршруту;
		Элементы.Согласовать.Видимость = ДоступныеДействия.Согласование;
		Элементы.ОтказатьВСогласовании.Видимость = ДоступныеДействия.ОтказВСогласовании;
		Элементы.КнопкаОтказатьВЗапросеПодписи.Видимость = ДоступныеДействия.ОтказВЗапросеПодписи;
		
		Элементы.ГруппаСогласованиеПередать.Видимость = ДоступныеДействия.ПередатьНаСогласование
			Или ДоступныеДействия.ПередатьНаПодпись
			Или ДоступныеДействия.ПередатьПоМаршруту;
		Элементы.ГруппаСогласованиеВердикт.Видимость = ДоступныеДействия.Согласование
			Или ДоступныеДействия.ОтказВСогласовании;
		Элементы.ГруппаСогласование.Видимость = Элементы.ГруппаСогласованиеПередать.Видимость
			Или Элементы.ГруппаСогласованиеВердикт.Видимость;
			
	Иначе
			
		Элементы.ПередатьНаСогласование.Видимость = Ложь;
		Элементы.ПередатьНаПодпись.Видимость = Ложь;
		Элементы.ПередатьПоМаршруту.Видимость = Ложь;
		Элементы.Согласовать.Видимость = Ложь;
		Элементы.ОтказатьВСогласовании.Видимость = Ложь;
		Элементы.КнопкаОтказатьВЗапросеПодписи.Видимость = Ложь;
		
		Элементы.ГруппаСогласованиеПередать.Видимость = Ложь;
		Элементы.ГруппаСогласованиеВердикт.Видимость = Ложь;
		Элементы.ГруппаСогласование.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.ПодписатьИОтправитьИсходящий.Видимость = ДоступныеДействияПодписатьИОтправить Или РежимПереотправки;
	Элементы.НастроитьПараметрыПодписания.Видимость = ДоступныеДействияНастроитьПараметрыПодписания;
	Элементы.СохранитьДокументНаДиск.Видимость = ДокументОтправлен Или ДокументБезОшибок;
	Элементы.ПолучитьПечатнуюФорму.Видимость = ДокументОтправлен Или СтатусДокументаПодготовлен;
	Элементы.СохранитьДокументооборот.Видимость = ДокументОтправлен;
	Элементы.ПерейтиВДиадок.Видимость = ДокументОтправлен;
	Элементы.ПереотправитьИсходящий.Видимость = ДокументОтправлен;
	Элементы.ФормаСохранить.Видимость = Не ДокументОтправлен И Не РежимПереотправки;
	Элементы.ФормаВвестиЭТрН.Видимость = Не ЕстьИдентификаторЭтРнПоОснованиям();
	Элементы.Перезаполнить.Видимость = Не ДокументОтправлен;
	Элементы.ПоказатьСодержимоеДокументаXML.Видимость = Не ДокументОтправлен;
	
	Элементы.ПередатьВПодразделение.Видимость = ДокументОтправлен;
	
	Элементы.СтраницаИсторияПоДокументу.Видимость = ДокументОтправлен;
	Если ДокументОтправлен Тогда
		УстановитьВидимостьКартинкаОшибкиИсторияПоДокументу();
	КонецЕсли;
	
	УстановитьДоступностьФункцийТарифа();
	
КонецПроцедуры

&НаКлиенте
Функция ДокументОтправлен()
	
	Если ТипЗнч(СтрокаСписка) = Тип("Структура")
		И ЗначениеЗаполнено(СтрокаСписка.LetterId) Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПараметрыФормыВводаНаОсновании(СтрокаСписка)
	
	МодульОбъекта = ОбработкаОбъект();
	
	Результат = Новый Массив;
	
	мДокументыОснования = ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	ДанныеЗЗ = МодульОбъекта.ДанныеЗЗ(ИдентификаторЗЗ, мДокументыОснования);

	ОтветныйТитул = МодульОбъекта.ПолучитьОтветныйТитулЗЗ(СтрокаСписка);
	СодИнфПрв = МодульОбъекта.ЕстьИЗначениеСвойствоСтруктуры(ОтветныйТитул, "Документ.СодИнфПрв");
	Если Не СодИнфПрв = Неопределено Тогда
		ДанныеЗЗ.Вставить("СодИнфПрв", СодИнфПрв);
	КонецЕсли;	

	мДанныеЭТрН = МодульОбъекта.ЗаполнитьЭтРн(ДанныеЗЗ);

	Для Каждого ДанныеПоОснованиюЗЗ из мДанныеЭТрН Цикл
		
		ПараметрыФормыРедактированияЭТрН = Новый Структура;

		Если ДанныеПоОснованиюЗЗ.Свойство("техДокОсн") И ЗначениеЗаполнено(ДанныеПоОснованиюЗЗ.техДокОсн) Тогда
			лДокументыОснования = ДанныеПоОснованиюЗЗ.техДокОсн;
			ПараметрыФормыРедактированияЭТрН.Вставить("ДокументыОснования", ПодобратьОснованияЭТрН(лДокументыОснования));
		Иначе
			ПараметрыФормыРедактированияЭТрН.Вставить("ДокументыОснования", ПодобратьОснованияЭТрН(мДокументыОснования));
		КонецЕсли;
		
		ПараметрыФормыРедактированияЭТрН.Вставить("ОбщийКонтекстКлиентСервер", ОбщийКонтекстКлиентСервер);
	 	ПараметрыФормыРедактированияЭТрН.Вставить("ДанныеПоОснованиюЗЗ", ДанныеПоОснованиюЗЗ);
		
		Ядро = Модуль_Ядро();
		СтрокаСпискаЭТрН = Ядро.Контракт_СтрокаСпискаДокументов();
		
	 	ПараметрыФормыРедактированияЭТрН.Вставить("СтрокаСписка", СтрокаСпискаЭТрН);
		
		Результат.Добавить(ПараметрыФормыРедактированияЭТрН);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПодобратьОснованияЭТрН(мДокументыОснования)
	
	Результат = Новый Массив;
	
	Для Каждого ДокОсн Из мДокументыОснования Цикл
		
		мтд = ДокОсн.Метаданные();
		НайденныеДокументы = Новый Массив;
		
		// заказ-рту
		Если мтд.Имя = "СчетНаОплатуПокупателю" //бух, со счетом на оплату работаем только с бух.
			И Метаданные.Документы.Найти("РеализацияТоваровУслуг") <> Неопределено
			И Метаданные.Документы["РеализацияТоваровУслуг"].Реквизиты.Найти("СчетНаОплатуПокупателю") <> Неопределено Тогда
			
			НайденныеДокументы = НайтиДокументыПоОснованию(ДокОсн, "РеализацияТоваровУслуг", "СчетНаОплатуПокупателю");
			
		ИначеЕсли мтд.Имя = "ЗаказПокупателя" // упп
			И Метаданные.Документы.Найти("РеализацияТоваровУслуг") <> Неопределено
			И Метаданные.Документы["РеализацияТоваровУслуг"].Реквизиты.Найти("Сделка") <> Неопределено Тогда
			
			НайденныеДокументы = НайтиДокументыПоОснованию(ДокОсн, "РеализацияТоваровУслуг", "Сделка");

		ИначеЕсли мтд.Имя = "ЗаказКлиента" // erp
			И Метаданные.Документы.Найти("РеализацияТоваровУслуг") <> Неопределено
			И Метаданные.Документы["РеализацияТоваровУслуг"].Реквизиты.Найти("ЗаказКлиента") <> Неопределено Тогда
			
			НайденныеДокументы = НайтиДокументыПоОснованию(ДокОсн, "РеализацияТоваровУслуг", "ЗаказКлиента");

		ИначеЕсли мтд.Имя = "ЗаказПокупателя" // унф
			И Метаданные.Документы.Найти("РасходнаяНакладная") <> Неопределено
			И Метаданные.Документы["РасходнаяНакладная"].Реквизиты.Найти("Заказ") <> Неопределено Тогда
			
			НайденныеДокументы = НайтиДокументыПоОснованию(ДокОсн, "РасходнаяНакладная", "Заказ");

		ИначеЕсли мтд.Имя = "СчетНаОплатуПоставщика"
			И Метаданные.Документы.Найти("ПоступлениеТоваровУслуг") <> Неопределено
			И Метаданные.Документы["ПоступлениеТоваровУслуг"].Реквизиты.Найти("СчетНаОплатуПоставщика") <> Неопределено Тогда
			
			НайденныеДокументы = НайтиДокументыПоОснованию(ДокОсн, "ПоступлениеТоваровУслуг", "СчетНаОплатуПоставщика");
			
		ИначеЕсли мтд.Имя = "ЗаказПоставщику" // упп
			И Метаданные.Документы.Найти("ПоступлениеТоваровУслуг") <> Неопределено
			И Метаданные.Документы["ПоступлениеТоваровУслуг"].Реквизиты.Найти("Сделка") <> Неопределено Тогда
			
			НайденныеДокументы = НайтиДокументыПоОснованию(ДокОсн, "ПоступлениеТоваровУслуг", "Сделка");

		ИначеЕсли мтд.Имя = "ЗаказПоставщику" // erp
			И Метаданные.Документы.Найти("ПриобретениеТоваровУслуг") <> Неопределено
			И Метаданные.Документы["ПриобретениеТоваровУслуг"].Реквизиты.Найти("ЗаказПоставщику") <> Неопределено Тогда
			
			НайденныеДокументы = НайтиДокументыПоОснованию(ДокОсн, "ПриобретениеТоваровУслуг", "ЗаказПоставщику");

		ИначеЕсли мтд.Имя = "ЗаказПоставщику" // унф
			И Метаданные.Документы.Найти("ПриходнаяНакладная") <> Неопределено
			И Метаданные.Документы["ПриходнаяНакладная"].Реквизиты.Найти("Заказ") <> Неопределено Тогда
			
			НайденныеДокументы = НайтиДокументыПоОснованию(ДокОсн, "ПриходнаяНакладная", "Заказ");

		Иначе
			
			НайденныеДокументы = мДокументыОснования;
			
		КонецЕсли;
		
		Для Каждого Док Из НайденныеДокументы Цикл 
			Результат.Добавить(Док);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиДокументыПоОснованию(ДокОсн, ТипДокумента, РеквизитОснование)
	
	Результат = Новый Массив;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДокументПоТипу.Ссылка КАК Ссылка
	|ИЗ
	|	Документ." + ТипДокумента + " КАК ДокументПоТипу
	|ГДЕ
	|	ДокументПоТипу." + РеквизитОснование + " = &Основание";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Основание", ДокОсн);
	РезультатЗапроса = Запрос.Выполнить();  
	Если РезультатЗапроса.Пустой() Тогда
		Результат.Добавить(ДокОсн);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.Ссылка);	
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ВвестиЭТрН(Команда)
	
	Если ЕстьИдентификаторЭтРнПоОснованиям() Тогда
		ПоказатьПредупреждение(Неопределено, "На основании заказ-заявки уже введены ЭТрН");
	Иначе	
		
		// поддержка только 1 сценария: Простая отгрузка, экспедитор агент. Отгрузка со своего склада,
		// мы подписываем документы остальные включим после поддержки диадок.апи.
		ТекущийСценарий = Новый Структура;
		ТекущийСценарий.Вставить("КтоЗаказываетПеревозку", "Мы");
		ТекущийСценарий.Вставить("МестоФактическойПогрузки", "НашСклад");
		ТекущийСценарий.Вставить("РольЭкспедитора", "ТолькоСопровождает");
		ДополнительныеПараметры = Новый Структура;
		ПеревозочныеДокументы_ПослеВыбораСценария(ТекущийСценарий, ДополнительныеПараметры); 
		
		// поддержка всех сценариев
		//Модуль_Платформа = Модуль_Платформа();
		//ДополнительныеПараметры = Новый Структура;
		//ОповещениеПослеЗакрытия = Новый ОписаниеОповещения("ПеревозочныеДокументы_ПослеВыбораСценария", ЭтаФорма, ДополнительныеПараметры);
		//ПараметрыФормы = Новый Структура;
		//Модуль_Платформа.ПеревозочныеДокументы_ОткрытьФормуВыбораСценария(ПараметрыФормы, ЭтаФорма, ОповещениеПослеЗакрытия); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозочныеДокументы_ПослеВыбораСценария(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда

		Модуль_Платформа = Модуль_Платформа();

		ТекущийСценарий = Результат;
		
		ПараметрыФормыВводаНаОсновании = ПараметрыФормыВводаНаОсновании(СтрокаСписка);
		Для Каждого ПараметрыФормыРедактированияЭТрН из ПараметрыФормыВводаНаОсновании Цикл
			
			ПараметрыФормыРедактированияЭТрН.Вставить("Сценарий", ТекущийСценарий);
			
			ОписаниеОповещения = Неопределено;
			_КлиентскиеВызовы.ОткрытьФормуРедактированияЭТрН(ПараметрыФормыРедактированияЭТрН, ЭтаФорма.ВладелецФормы, ОписаниеОповещения);
			
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьИдентификаторЭтРнПоОснованиям()
	
	МодульОбъекта = ОбработкаОбъект();
	//проверим главный документ
	Результат = Ложь;                 
	Если ЗначениеЗаполнено(ОсновнойДокумент) Тогда
		ИдентификаторТрН = МодульОбъекта.ИдентификаторТрН(ОсновнойДокумент, Истина); 
		Если ЗначениеЗаполнено(ИдентификаторТрН) Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура рл_ПарТСПрвз_ТипНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если СписокВыбораТипТС = Неопределено Тогда
		СписокВыбораТипТС = СписокВыбораТипТС();
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораТипТС", ЭтаФорма);
	ВыполнитьНачалоВыбораИзСписка(СписокВыбораТипТС, Оповещение, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораТипТС(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		рл_ПарТСПрвз_Тип = ЗначениеВыбора.Значение;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура рл_ПарТСПрвз_ТипАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СписокВыбораТипТС = Неопределено Тогда
		СписокВыбораТипТС = СписокВыбораТипТС();
	КонецЕсли; 
	ВыполнитьАвтоПодбор(СписокВыбораТипТС, Текст, Элемент.ТекстРедактирования, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры 

&НаСервере
Функция СписокВыбораТипТС()
	
	СписокВыбора = Новый СписокЗначений;

	МодульОбъекта = ОбработкаОбъект();
	Макет = МодульОбъекта.ПолучитьМакет("ЗначенияТипТС");
		
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НаименованиеЗначения  = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		
		Если Не ЗначениеЗаполнено(НаименованиеЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(НаименованиеЗначения, НаименованиеЗначения);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаКлиенте
Процедура ПунктПод_ДатВрПодВрПриИзменении(Элемент)
	
	Если НачалоДня(рл_ПунктПод_ДатВрПод) = '00010101000000' Тогда
		рл_ПунктПод_ДатВрПод = НачалоДня(ТекущаяДата()) + Час(рл_ПунктПод_ДатВрПод)*60*60 + Минута(рл_ПунктПод_ДатВрПод)*60;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьBoxIdНаСервере()
	
	BoxId = "";
	
	МодульОбъекта = ОбработкаОбъект();
	ИдентификаторыГО = МодульОбъекта.ИдентификаторыЭДО(рл_СвГО, Истина);
	BoxId = ИдентификаторыГО.BoxId;
	
	Возврат BoxId;

КонецФункции


&НаКлиенте
Процедура Метрика_ПриВыполненииДействия(ДействиеМетрики, Доппеременные = Неопределено)
	
	НаименованиеФормы = Метрика_НаименованиеФормы();
	
	ДокументОтправлен = ДокументОтправлен();
	Если РежимПереотправки Тогда
		ДокументОтправлен = Ложь;
	КонецЕсли;
	
	Если ДокументОтправлен Тогда
		ПредставлениеМетрики = Метрика_ПредставленияМетрик().Исходящийпакет;
	Иначе
		ПредставлениеМетрики = Метрика_ПредставленияМетрик().ПакетНаОтправку;
	КонецЕсли;
	
	_КлиентскиеВызовы.Метрика_ДобавитьПоведение_НажатиеКнопки(НаименованиеФормы, ДействиеМетрики, ПредставлениеМетрики);
	_КлиентскиеВызовы.Метрика_ДобавитьСтатистику_ПоКонтексту(ДействиеМетрики, ДопПеременные);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Метрика_НаименованиеФормы()
	Возврат "Заказ_заявка";
КонецФункции

&НаКлиенте
Функция Метрика_ПредставленияМетрик()
	
	Результат = Новый Структура;
	Результат.Вставить("ПакетНаОтправку", "Пакет на отправку ЭЗЗ");
	Результат.Вставить("Исходящийпакет", "Исходящий пакет ЭЗЗ");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Метрики_ПредставлениеОшибокВМассиве()
	
	Результат = Новый Массив;
	
	ТаблицаОшибок = Ошибки.Выгрузить(, "Представление");
	Результат = ТаблицаОшибок.ВыгрузитьКолонку("Представление");
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Элементы.СтраницаИсторияПоДокументу Тогда
		
		ЗаполнитьИсториюПоДокументу();
		
	КонецЕсли;
	
КонецПроцедуры

#Область ИсторияПоДокументу

&НаКлиенте
Процедура ЗаполнитьИсториюПоДокументу()
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Пакет.Документы[0];
	
	ИсторияДокументаHTML = "";
	
	Если ЗначениеЗаполнено(Документ.Идентификаторы.DocumentId) Тогда
		ЗаполнитьИсториюПоДокументуВызовСервера(Документ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсториюПоДокументуВызовСервера(Документ)
	
	Ядро = Модуль_Ядро();
	ИсторияДО = Ядро.Документы_ИсторияДО(Документ.Идентификаторы);
	// BSLLS:UnusedLocalVariable-off
	ИсторияДокументаHTML = Ядро.HTMLИсторияДокументооборота(ИсторияДО);
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияДокументаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	АдресСсылки = Неопределено;
	ДопПараметры = Неопределено;
	
	ДанныеСобытия.Свойство("href", АдресСсылки);
	
	Если ЗначениеЗаполнено(АдресСсылки) Тогда
		// BSLLS:UnusedLocalVariables-off
		СтандартнаяОбработка = Ложь;
		// BSLLS:UnusedLocalVariables-on
		_Платформа.ОповеститьИлиПерейтиПоСсылке(АдресСсылки, ДопПараметры, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуЭлектроннаяПодписьИДоверенности(
		АдресВременногоХранилища = Неопределено,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	Пакет = ПодготовитьПакетНаСервере();
	Документ = Пакет.Документы[0];
	ПредставлениеТекущегоДокумента = Документ.ИмяФайла;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "ФормаЭлектроннаяПодписьИДоверенности");
	ПараметрыОткрытияФормы.Вставить("АдресВременногоХранилища", АдресВременногоХранилища);
	ПараметрыОткрытияФормы.Вставить("ПредставлениеТекущегоДокумента", ПредставлениеТекущегоДокумента);
	
	_Платформа.ОткрытьФормуДиадокМодальноЛок(
		"ФормаHTMLСообщенияУправляемая",
		ЭтаФорма,
		ПараметрыОткрытияФормы
	);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКартинкаОшибкиИсторияПоДокументу()
	
	Пакет = ПодготовитьПакетНаСервере();
	
	Если Пакет.Документы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Пакет.Документы[0];
	
	СтатусМЧДКритичность = Документ.Статусы.СтатусМЧДКритичность;
	СтатусПКФНСКритичность = Документ.Статусы.СтатусПКФНСКритичность;
	
	Ядро = Модуль_Ядро();
	УровниКритичности = Ядро.Контракт_УровниКритичностиСтатусаДокумента();
	
	ЕстьОшибкаПроверкиМЧД = СтатусМЧДКритичность = УровниКритичности.Error
		Или СтатусМЧДКритичность = УровниКритичности.Warning;
	
	СтатусПКФНСКритичность = СтатусПКФНСКритичность = УровниКритичности.Error
		Или СтатусПКФНСКритичность = УровниКритичности.Warning;

	Если Не ЕстьОшибкаПроверкиМЧД И Не СтатусПКФНСКритичность Тогда
		Элементы.СтраницаИсторияПоДокументу.Картинка = Новый Картинка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Согласование

&НаКлиенте
Процедура ПередатьНаСогласование(Команда)
	
	НачатьПроцессСогласования("ПередатьНаСогласование");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьНаПодпись(Команда)
	
	НачатьПроцессСогласования("ПередатьНаПодпись");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьПоМаршруту(Команда)
	
	НачатьПроцессСогласования("ПередатьПоМаршруту");
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	
	НачатьПроцессСогласования("Согласование");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВСогласовании(Команда)
	
	НачатьПроцессСогласования("ОтказВСогласовании");
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроцессСогласования(РежимФормыСогласования)
	
	ПакетОтправлен = ДокументОтправлен();
	
	Пакет = ПодготовитьПакетНаСервере();
	
	ДанныеДляОбработки = Новый Массив;
	Если ПакетОтправлен Тогда
		Документ = Пакет.Документы[0];
		ДанныеДляОбработки.Добавить(Документ);
	Иначе
		ДанныеДляОбработки.Добавить(Пакет);
	КонецЕсли;
	
	КатегорияМетрики = Метрика_НазваниеКатегорииПоНаправлению();
	КоличествоДанных = ДанныеДляОбработки.Количество();
	ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте();
	ДействиеМетрики = ЯдроНаКлиенте.Метрика_НазваниеДействияМаршрутизации(РежимФормыСогласования);
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, КоличествоДанных);
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(
		ДанныеДляОбработки,
		РежимФормыСогласования,
		КатегорияМетрики,
		ДействиеМетрики);
	
	ПараметрыОбработки.Вставить("BoxId", Пакет.Идентификаторы.BoxId);
	ПараметрыОбработки.Вставить("ДокументыОтправлены", ПакетОтправлен);
	ПараметрыОбработки.ИсточникОткрытия = Неопределено; //ИсточникОткрытия;
	
	Модуль_Платформа = Модуль_Платформа();
	Модуль_Платформа.ОбработатьДействиеПоМаршрутизации( , ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Функция Новый_ПараметрыГрупповойОбработки(
	ДокументыДляОбработки,
	Действие,
	КатегорияМетрики,
	ДействиеМетрики,
	Знач ФормаВыполнения = Неопределено,
	ИдентификаторЯщика = Неопределено,
	КонтрагентПоддерживаетМЧД = Истина)
	
	Если ФормаВыполнения = Неопределено Тогда
		ФормаВыполнения = ЭтаФорма;
	КонецЕсли;
	
	ВыполнениеИзФормыПакета = Истина;
	РежимОтображенияДокументов = РежимыОтображения().Перевозочные;
	ИдентификаторОсновнойФормы = Неопределено;
	
	Модуль_Платформа = Модуль_Платформа();
	
	Результат = Модуль_Платформа.Новый_ПараметрыГрупповойОбработки(
		ДокументыДляОбработки,
		Действие,
		КатегорияМетрики,
		ДействиеМетрики,
		ФормаВыполнения,
		ИдентификаторЯщика,
		КонтрагентПоддерживаетМЧД,
		ВыполнениеИзФормыПакета,
		РежимОтображенияДокументов,
		ИдентификаторОсновнойФормы
	);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, КоличествоДанных = 1)
	
	НазваниеФормыДляМетрики = Метрика_НаименованиеФормы();
	
	Ядро = Модуль_ЯдроНаКлиенте();
	
	Ядро.Метрика_ДобавитьПоведение_МассовоеДействиеНажатиеКнопки(НазваниеФормыДляМетрики,
		КатегорияМетрики,
		ДействиеМетрики,
		КоличествоДанных);
	
КонецПроцедуры

&НаКлиенте
Функция Метрика_НазваниеКатегорииПоНаправлению()
	
	Результат = "";
	
	//Если Направление = Направление().Входящее Тогда
	//	Результат = "Действие во входящих";
	//ИначеЕсли Направление = Направление().Внутреннее Тогда
	//	Результат = "Действие во внутренних";
	//ИначеЕсли Направление = Направление().Исходящее И ПакетОтправлен Тогда
	//	Результат = "Действие в исходящих";
	//ИначеЕсли Направление = Направление().Исходящее И НЕ ПакетОтправлен Тогда
		Результат = "Действия в пакете перевозочных";	
	//КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимыОтображения()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Перевозочные", "ПеревозочныеДокументы");
	
	Возврат Результат
	
КонецФункции

&НаКлиенте
Процедура ОбновитьФорму(ДанныеДляОбработки = Неопределено) Экспорт
	
	НастроитьВидимостьКомандФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииПакета() Экспорт
	
	ОповеститьОВыборе(СтрокаСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВПодразделение(Команда)
	
	Пакет = ПодготовитьПакетНаСервере();
	
	ДанныеДляОбработки = Новый Массив;
	Документ = Пакет.Документы[0];
	ДанныеДляОбработки.Добавить(Документ);
	
	КатегорияМетрики	= Метрика_НазваниеКатегорииПоНаправлению();
	КоличествоДанных	= ДанныеДляОбработки.Количество();
	
	ДействиеМетрики		= "Передать в подразделение";
	Метрика_НажатиеКнопкиПакетнойОбработки(КатегорияМетрики, ДействиеМетрики, КоличествоДанных);
	
	ЯдроНаКлиенте = Модуль_ЯдроНаКлиенте();
	Действие = ЯдроНаКлиенте.Перечисление_ДействияЭДО().ПередатьВПодразделение;
	
	Модуль_Платформа = Модуль_Платформа();
	
	ПараметрыОбработки = Новый_ПараметрыГрупповойОбработки(
		ДанныеДляОбработки,
		Действие,
		КатегорияМетрики,
		ДействиеМетрики
	);
	ПараметрыОбработки.ИсточникОткрытия = Неопределено;
	Модуль_Платформа.ОбработатьПередатьВПодразделение(, ПараметрыОбработки);
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьПередатьНаСогласование(ЕстьОграниченияПоТарифу)
	
	Если ЕстьОграниченияПоТарифу Тогда
		Элементы.ПередатьНаСогласование.Видимость = Ложь;
		Элементы.ПередатьНаСогласованиеЗаглушка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьПередатьПоМаршруту(ЕстьОграниченияПоТарифу)
	
	Если ЕстьОграниченияПоТарифу Тогда
		Элементы.ПередатьПоМаршруту.Видимость = Ложь;
		Элементы.ПередатьПоМаршрутуЗаглушка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВключитьФункциональностьПоТарифуМини(ЕстьОграниченияПоТарифу)
	
	ОтключитьВключитьПередатьНаСогласование(ЕстьОграниченияПоТарифу);
	ОтключитьВключитьПередатьПоМаршруту(ЕстьОграниченияПоТарифу);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьФункцийТарифа()
	
	Ядро = Модуль_Ядро();
	ЕстьОграниченияПоТарифу = Ядро.ЕстьОграниченияПоТарифу();
	ОтключитьВключитьФункциональностьПоТарифуМини(ЕстьОграниченияПоТарифу);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВЗапросеПодписи(Команда)
	
	НачатьПроцессСогласования("ОтказВЗапросеПодписи");
	
КонецПроцедуры

#КонецОбласти
