
////////////////////////////////////////////////////////////////////////////////
// Модуль "ЭтапыОплатыСервер" содержит процедуры и функции для 
// работы с механизмом этапов оплаты,
// в первую очередь заполнение этапов оплаты различных объектов.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

//Выполняет заполнение/очистку/перераспределение этапов графика оплат
//
// Параметры:
// 	Объект - ДокументОбъект, СправочникОбъект, ФормаКлиентскогоПриложения - обрабатываемый объект.
// 	ДополненныеПараметрыМеханизма - см. ВзаиморасчетыСервер.ДополненныеПараметрыМеханизма
// 	ТаблицаЭтаповГрафикаОплаты - ТаблицаЗначений - Выгрузка табличной части ЭтапыГрафикаОплаты
// 
Процедура ПроверитьЗаполнитьЭтапыГрафикаОплаты(Объект, ЗНАЧ ДополненныеПараметрыМеханизма = Неопределено, ТаблицаЭтаповГрафикаОплаты = Неопределено) Экспорт
	
	Если ТипЗнч(Объект) <> Тип("ФормаКлиентскогоПриложения") И ДополненныеПараметрыМеханизма = Неопределено Тогда
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
		ПараметрыМеханизма = МенеджерОбъекта.ПараметрыВзаиморасчеты(Объект);
		ДополненныеПараметрыМеханизма = ВзаиморасчетыСервер.ДополненныеПараметрыМеханизма(Объект, ПараметрыМеханизма);
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
		ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Объект, "Взаиморасчеты");
	КонецЕсли;
	
	СистемныеНастройки = ДополненныеПараметрыМеханизма.СистемныеНастройки;
	
	Для Каждого СтруктураПараметров Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
		
		Если Не ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) И Не ЗначениеЗаполнено(СтруктураПараметров.ДатаПлатежа) Тогда
			Продолжить;
		КонецЕсли;
		
		ИзменяетПланОплаты            = СтруктураПараметров.ИзменяетПланОплаты ИЛИ СтруктураПараметров.ЗаказКакСчет;
		ЗаданГрафикИсполнения         = СтруктураПараметров.ЗаданГрафикИсполнения;
		ГрафикИсполненияДоговора      = СтруктураПараметров.ГрафикИсполненияДоговора;
		ЭтоПродажаЗакупка             = СтруктураПараметров.ЭтоПродажаЗакупка;
		ЭтоЗаказ                      = СтруктураПараметров.ЭтоЗаказ;
		
		ПорядокРасчетов           = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПорядокРасчетов);
		Соглашение                = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Соглашение);
		Если СистемныеНастройки.ИспользоватьГрафикиОплаты Тогда
			ГрафикОплаты          = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ГрафикОплаты);
		Иначе
			ГрафикОплаты          = Справочники.ГрафикиОплаты.ПустаяСсылка();
		КонецЕсли;
		НакладнаяПоЗаказам        = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.НакладнаяПоЗаказам, , Ложь);
		ЗаказШапки = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование);
		ЗаказШапки = ?(ЗаказШапки = Неопределено, Документы.ЗаказКлиента.ПустаяСсылка(),ЗаказШапки);
	
		ДатаДокумента             = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
		ДатаОтгрузки              = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаОтгрузки);
		ДатаСогласования          = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаСогласования);
		Если ЭтоЗаказ Тогда
			ДатаЗаказа            = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
		Иначе
			ДатаЗаказа = Дата(1,1,1);
		КонецЕсли;
		ДатаПереходаПраваСобственности = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаПереходаПраваСобственности);
		Календарь                      = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Календарь);
		
		Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
			ДатаДокумента = ТекущаяДатаСеанса();
		КонецЕсли;
		
		ГрафикСоглашенияЗаполнен = ЭтапыОплатыВызовСервера.ГрафикСоглашенияЗаполнен(Соглашение);
		
		//Если источник сумм табличная часть то сначала получаем таблицу и считаем по ней итоги.
		Если СтруктураПараметров.ИсточникСуммТабличнаяЧасть Тогда
			Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
				СуммыПоЗаказам                 = ВзаиморасчетыСервер.ТаблицаСуммПоЗаказам(Объект.Объект,СтруктураПараметров);
			Иначе
				СуммыПоЗаказам                 = ВзаиморасчетыСервер.ТаблицаСуммПоЗаказам(Объект,СтруктураПараметров);
			КонецЕсли;
			Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
				СуммыДокумента = ВзаиморасчетыСлужебный.СуммыДокумента(Объект.Объект, СтруктураПараметров, СуммыПоЗаказам);
			Иначе
				СуммыДокумента = ВзаиморасчетыСлужебный.СуммыДокумента(Объект, СтруктураПараметров, СуммыПоЗаказам);
			КонецЕсли;
		Иначе
			//Иначе сначала считаем суммы из шапки, а потом создаем таблицу для расчета этапов.
			Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
				СуммыДокумента = ВзаиморасчетыСлужебный.СуммыДокумента(Объект.Объект, СтруктураПараметров);
			Иначе
				СуммыДокумента = ВзаиморасчетыСлужебный.СуммыДокумента(Объект, СтруктураПараметров);
			КонецЕсли;
			
			СуммыПоЗаказам = Новый ТаблицаЗначений;
			СуммыПоЗаказам.Колонки.Добавить("Заказ", Новый ОписаниеТипов(ТипыЗаказов()));
			СуммыПоЗаказам.Колонки.Добавить("СверхЗаказа", Новый ОписаниеТипов("Булево"));
			СуммыПоЗаказам.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
			СуммыПоЗаказам.Колонки.Добавить("ДатаСогласования", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
			СуммыПоЗаказам.Колонки.Добавить("ДатаОтгрузки", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
			СуммыПоЗаказам.Колонки.Добавить("СуммаПлатежа", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаНеотрицательная.Тип);
			СуммыПоЗаказам.Колонки.Добавить("СуммаЗалогаЗаТару", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаНеотрицательная.Тип);
			СуммыПоЗаказам.Колонки.Добавить("СуммаВзаиморасчетов", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаНеотрицательная.Тип);
			СуммыПоЗаказам.Колонки.Добавить("СуммаВзаиморасчетовПоТаре", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаНеотрицательная.Тип);
			
			НовСтр = СуммыПоЗаказам.Добавить();
			НовСтр.Заказ = ЗаказШапки;
			НовСтр.Дата = ДатаДокумента;
			НовСтр.ДатаСогласования = ДатаСогласования;
			НовСтр.ДатаОтгрузки = ДатаОтгрузки;
			НовСтр.СуммаПлатежа = СуммыДокумента.СуммаДокумента;
			НовСтр.СуммаЗалогаЗаТару = СуммыДокумента.СуммаЗалогаЗаТару;
			НовСтр.СуммаВзаиморасчетов = СуммыДокумента.СуммаВзаиморасчетов;
			НовСтр.СуммаВзаиморасчетовПоТаре = СуммыДокумента.СуммаВзаиморасчетовПоТаре;
			
		КонецЕсли;
		
		//Одна дата платежа
		Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) Тогда
			Если ЗначениеЗаполнено(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаПлатежа)) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтапыГрафикаОплаты = Новый ТаблицаЗначений;
			
			ЭтапыГрафикаОплаты.Колонки.Добавить("Заказ",  Новый ОписаниеТипов(ТипыЗаказов()));
			ЭтапыГрафикаОплаты.Колонки.Добавить("СверхЗаказа");
			ЭтапыГрафикаОплаты.Колонки.Добавить("ВариантОплаты");
			ЭтапыГрафикаОплаты.Колонки.Добавить("ДатаПлатежа", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
			ЭтапыГрафикаОплаты.Колонки.Добавить("Сдвиг", ОбщегоНазначения.ОписаниеТипаЧисло(10));
			ЭтапыГрафикаОплаты.Колонки.Добавить("СуммаПлатежа", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаЛюбогоЗнака.Тип);
			ЭтапыГрафикаОплаты.Колонки.Добавить("СуммаЗалогаЗаТару", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаЛюбогоЗнака.Тип);
			ЭтапыГрафикаОплаты.Колонки.Добавить("СуммаВзаиморасчетов", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаЛюбогоЗнака.Тип);
			ЭтапыГрафикаОплаты.Колонки.Добавить("СуммаВзаиморасчетовПоТаре", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаЛюбогоЗнака.Тип);
			ЭтапыГрафикаОплаты.Колонки.Добавить("СуммаОтклоненияМерныхТоваров", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаЛюбогоЗнака.Тип);
			ЭтапыГрафикаОплаты.Колонки.Добавить("ПроцентПлатежа", ОбщегоНазначения.ОписаниеТипаЧисло(5,2));
			ЭтапыГрафикаОплаты.Колонки.Добавить("ПроцентЗалогаЗаТару", ОбщегоНазначения.ОписаниеТипаЧисло(5,2));
			ЭтапыГрафикаОплаты.Колонки.Добавить("ВариантОтсчета");
			ЭтапыГрафикаОплаты.Колонки.Добавить("Формула");
			
		Иначе
			//Таблица этапов оплаты
			Если ТаблицаЭтаповГрафикаОплаты = Неопределено Тогда
				ЭтапыОплатыРеквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
				ЭтапыГрафикаОплаты = ЭтапыОплатыРеквизит.Данные[ЭтапыОплатыРеквизит.Имя];
			Иначе
				ЭтапыГрафикаОплаты = ТаблицаЭтаповГрафикаОплаты;
			КонецЕсли;
		КонецЕсли;
		
		//Если графика быть не должно.
		Если НЕ ИзменяетПланОплаты
			ИЛИ (ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоНакладным") И ЭтоЗаказ И НЕ ЭтоПродажаЗакупка)
			ИЛИ (ЗаданГрафикИсполнения И ЭтоЗаказ
					И (ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов")
						ИЛИ ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамНакладным"))) Тогда
			ЭтапыГрафикаОплаты.Очистить();
			Продолжить;
		КонецЕсли;
		
		// Проверка изменения сумм накладных по заказам в разрезе заказов и признака Сверх заказа
		Если НакладнаяПоЗаказам 
			И ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным
			И НЕ ЗаданГрафикИсполнения 
			И ЭтапыГрафикаОплаты.Количество() > 0 Тогда
			
			ОчиститьЭтапыГрафикаОплатыПриИзмененииСоставаЗаказа(Объект, СтруктураПараметров, ЭтапыГрафикаОплаты);
			
		КонецЕсли;
		
		//Отклонения мерных товаров
		ЕстьОтклоненияМерныхТоваров = Ложь;
		Если ЭтапыГрафикаОплаты.Количество() > 0 Тогда
			ЕстьОтклоненияМерныхТоваров = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыГрафикаОплаты[0],"СуммаОтклоненияМерныхТоваров");
		КонецЕсли;
		
		СуммаЭтаповОплаты       = ЭтапыГрафикаОплаты.Итог("СуммаПлатежа");
		Если ЭтапыГрафикаОплаты.Количество() > 0 И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыГрафикаОплаты[0], "СуммаЗалогаЗаТару") Тогда
			СуммаЗалогаПоЭтапам     = ЭтапыГрафикаОплаты.Итог("СуммаЗалогаЗаТару");
		Иначе
			СуммаЗалогаПоЭтапам = 0;
		КонецЕсли;
		
		Если ЭтоПродажаЗакупка 
			И ЭтапыГрафикаОплаты.Количество() > 0 
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыГрафикаОплаты[0], "СуммаВзаиморасчетов")Тогда
			СуммаВзаиморасчетовЭтапы = ЭтапыГрафикаОплаты.Итог("СуммаВзаиморасчетов");
		Иначе
			СуммаВзаиморасчетовЭтапы = 0;
		КонецЕсли;
		
		Если ЭтоПродажаЗакупка И ЗначениеЗаполнено(СтруктураПараметров.СуммаВзаиморасчетовПоТаре) Тогда
			СуммаВзаиморасчетовПоТареЭтапы = ЭтапыГрафикаОплаты.Итог("СуммаВзаиморасчетовПоТаре");
		Иначе
			СуммаВзаиморасчетовПоТареЭтапы = 0;
		КонецЕсли;
		
		Если ЕстьОтклоненияМерныхТоваров Тогда
			СуммаОтклоненияПоЭтапам = ЭтапыГрафикаОплаты.Итог("СуммаОтклоненияМерныхТоваров");
		Иначе
			СуммаОтклоненияПоЭтапам = 0;
		КонецЕсли;
		
		СуммаОтклоненияПоОплате = ?(СуммаЭтаповОплаты+СуммаЗалогаПоЭтапам = 0,0,
									Окр(СуммаОтклоненияПоЭтапам * СуммаЭтаповОплаты /(СуммаЭтаповОплаты+СуммаЗалогаПоЭтапам),2));
		
		КоличествоЭтапов = ЭтапыГрафикаОплаты.Количество();
		
		Если СуммыДокумента.СуммаДокументаБезЗалога = 0 И СуммыДокумента.СуммаЗалогаЗаТару = 0 И КоличествоЭтапов > 0 Тогда
			ЭтапыГрафикаОплаты.Очистить();
		ИначеЕсли СуммыДокумента.СуммаДокументаБезЗалога - СуммаОтклоненияПоОплате <> СуммаЭтаповОплаты
			ИЛИ СуммыДокумента.СуммаЗалогаЗаТару-(СуммаОтклоненияПоЭтапам - СуммаОтклоненияПоОплате) <> СуммаЗалогаПоЭтапам 
			ИЛИ СуммыДокумента.СуммаВзаиморасчетовБезЗалога <> СуммаВзаиморасчетовЭтапы 
			ИЛИ СуммыДокумента.СуммаВзаиморасчетовПоТаре <> СуммаВзаиморасчетовПоТареЭтапы Тогда
			
			//Заполнение
			Если КоличествоЭтапов = 0 Тогда
				
				//Накладная по заказам
				Если НЕ ЭтоЗаказ 
					И НакладнаяПоЗаказам И ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным
					И НЕ (ЗаданГрафикИсполнения И (ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
													ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным)) Тогда
					
					ПараметрыЗаполнения = ЭтапыОплатыСервер.ПараметрыЗаполненияЭтаповОплатыПоЗаказам();
					ПараметрыЗаполнения.ДатаОтгрузки                   = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
					ПараметрыЗаполнения.ДатаПереходаПраваСобственности = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаПереходаПраваСобственности);
					ПараметрыЗаполнения.ЕстьДатаПереходаПраваСобственности = СтруктураПараметров.ЕстьДатаПереходаПраваСобственности;
					ПараметрыЗаполнения.ТабличнаяЧасть                 = СуммыПоЗаказам;
					ПараметрыЗаполнения.ПорядокРасчетов                = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПорядокРасчетов);
					ПараметрыЗаполнения.ЭтоРасчетыСКлиентами           = СтруктураПараметров.ДокументРасчетовСКлиентами;
					ПараметрыЗаполнения.Календарь                      = Календарь;
					ПараметрыЗаполнения.ЭтоПереходПраваСобственности2_5 = СтруктураПараметров.ЭтоПереходПраваСобственности2_5;
					
					ЭтапыОплатыСервер.ЗаполнитьЭтапыОплатыДокументаПоЗаказам(ЭтапыГрафикаОплаты, ПараметрыЗаполнения);
					
				//Заказ или накладная не по заказам
				Иначе
					
					ПараметрыЗаполнения = ЭтапыОплатыСервер.ПараметрыЗаполненияЭтаповОплаты();
					ПараметрыЗаполнения.ЭтоРасчетыСКлиентами   = СтруктураПараметров.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
					ПараметрыЗаполнения.НакладнаяПоЗаказам     = НакладнаяПоЗаказам;
					ПараметрыЗаполнения.ЭтоЗаказ               = СтруктураПараметров.ЭтоЗаказ;
					ПараметрыЗаполнения.НетКонтроляПредоплаты  = СтруктураПараметров.НетКонтроляПредоплаты;
					ПараметрыЗаполнения.ПорядокРасчетов        = ПорядокРасчетов;
					ПараметрыЗаполнения.ДатаЗаказа             = ДатаЗаказа;
					ПараметрыЗаполнения.ДатаСогласования       = ДатаСогласования;
					Если СтрЧислоВхождений(СтруктураПараметров.ДатаОтгрузки, ".") > 1
						Или СтруктураПараметров.ЭтоПереходПраваСобственности2_5 Тогда
						ПараметрыЗаполнения.ТабличнаяЧасть = СуммыПоЗаказам;
					Иначе
						ПараметрыЗаполнения.ДатаОтгрузки = ДатаОтгрузки;
					КонецЕсли;
					ПараметрыЗаполнения.ГрафикСоглашенияЗаполнен       = ГрафикСоглашенияЗаполнен;
					ПараметрыЗаполнения.ДатаПереходаПраваСобственности = ДатаПереходаПраваСобственности;
					ПараметрыЗаполнения.ЕстьДатаПереходаПраваСобственности = СтруктураПараметров.ЕстьДатаПереходаПраваСобственности;
					ПараметрыЗаполнения.Соглашение                     = Соглашение;
					ПараметрыЗаполнения.ГрафикИсполненияДоговора       = ГрафикИсполненияДоговора;
					ПараметрыЗаполнения.ГрафикОплаты                   = ГрафикОплаты;
					ПараметрыЗаполнения.СуммаОплаты                    = СуммыДокумента.СуммаДокументаБезЗалога;
					ПараметрыЗаполнения.СуммаЗалогаЗаТару              = СуммыДокумента.СуммаЗалогаЗаТару;
					ПараметрыЗаполнения.СуммаВзаиморасчетов            = СуммыДокумента.СуммаВзаиморасчетовБезЗалога;
					ПараметрыЗаполнения.СуммаВзаиморасчетовПоТаре      = СуммыДокумента.СуммаВзаиморасчетовПоТаре;
					ПараметрыЗаполнения.ЭтоПереходПраваСобственности2_5 = СтруктураПараметров.ЭтоПереходПраваСобственности2_5;
					
					ЭтапыОплатыСервер.ЗаполнитьЭтапыОплаты(
							ЭтапыГрафикаОплаты,
							ПараметрыЗаполнения);
							
				КонецЕсли;
			//Перераспределение сумм
			Иначе
					
				Если НакладнаяПоЗаказам 
					И ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным
					//Заказ как счет - распределять ничего не нужно, т.к. заказ не делал движений
					И НЕ (СтруктураПараметров.ДокументРасчетовСКлиентами И СтруктураПараметров.ЗаказКакСчет) 
					И НЕ ЗаданГрафикИсполнения Тогда
					
					ЭтапыОплатыРеквизит            = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
					Если НЕ ЗначениеЗаполнено(ЭтапыОплатыРеквизит.Имя) Тогда
						Продолжить;
					Иначе
						ЭтапыГрафикаОплаты = ЭтапыОплатыРеквизит.Данные[ЭтапыОплатыРеквизит.Имя];
					КонецЕсли;
					
					Соглашение = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Соглашение);
					
					ПараметрыРаспределения = ЭтапыОплатыСервер.ПараметрыЗаполненияЭтаповОплатыПоЗаказам();
					ПараметрыРаспределения.ТабличнаяЧасть                 = СуммыПоЗаказам;
					ПараметрыРаспределения.ПорядокРасчетов                = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПорядокРасчетов);
					ПараметрыРаспределения.ЭтоРасчетыСКлиентами           = СтруктураПараметров.ДокументРасчетовСКлиентами;
					ПараметрыРаспределения.ДатаОтгрузки                   = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
					ПараметрыРаспределения.ДатаПереходаПраваСобственности = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаПереходаПраваСобственности);
					ПараметрыРаспределения.Календарь                      = Календарь;
					
					ЭтапыОплатыСервер.РаспределитьСуммыЭтаповОплатыДокументаПоЗаказам(ЭтапыГрафикаОплаты, ПараметрыРаспределения);
					
				Иначе
					
					ЭтапыОплатыКлиентСервер.РаспределитьСуммуПоЭтапамГрафикаОплаты(
						ЭтапыГрафикаОплаты,
						СуммыДокумента.СуммаДокументаБезЗалога,
						СуммыДокумента.СуммаЗалогаЗаТару,
						СуммыДокумента.СуммаВзаиморасчетовБезЗалога,
						СуммыДокумента.СуммаВзаиморасчетовПоТаре);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ЭтапыОплатыСервер.ЗаполнитьПроцентыПоСуммам(ЭтапыГрафикаОплаты);
			
		КонецЕсли;
		
		Если ТаблицаЭтаповГрафикаОплаты = Неопределено Тогда
			ДополненныеПараметрыМеханизма.ОповеститьОЗаполненииЭтапов = ИСТИНА;
			Если Не ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
				Объект.ДополнительныеСвойства.Вставить("ОповеститьОЗаполненииЭтапов", Истина);
			КонецЕсли;
		КонецЕсли;
			
		//Одна дата платежа
		Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) Тогда
			УпрощенныеДанные = ЭтапыОплатыСервер.ДанныеУпрощенногоРежима(ЭтапыГрафикаОплаты,ДатаОтгрузки,Ложь,Календарь);
			Реквизит = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.ДатаПлатежа);
			
			Если НЕ ЗначениеЗаполнено(Реквизит.Данные[Реквизит.Имя]) Тогда
				Реквизит.Данные[Реквизит.Имя] = УпрощенныеДанные.ДатаКредит;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
		ВзаиморасчетыРаботаСФормами.ОбновитьТекстГиперссылкиЭтапыОплаты(Объект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеЭтаповГрафикаОплаты(Объект, Отказ, ЗНАЧ ДополненныеПараметрыМеханизма = Неопределено) Экспорт
	
	Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
		ДополненныеПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Объект, "Взаиморасчеты");
	КонецЕсли;
	
	Для Каждого СтруктураПараметров Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
		
		ЗаданГрафикИсполнения     = СтруктураПараметров.ЗаданГрафикИсполнения;
		ПорядокРасчетов           = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПорядокРасчетов);
		ДатаПлатежа               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаПлатежа);
		Дата                      = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
		ВалютаВзаиморасчетов      = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаВзаиморасчетов);
		ЭтапыОплатыРеквизит       = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
		
		Если Не ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) И Не ЗначениеЗаполнено(СтруктураПараметров.ДатаПлатежа) 
			ИЛИ НЕ СтруктураПараметров.ИзменяетПланОплаты И НЕ СтруктураПараметров.ЗаказКакСчет
			ИЛИ СтруктураПараметров.ЭтоЗаказ И (ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоНакладным")
												ИЛИ ЗаданГрафикИсполнения И (ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов")
																			ИЛИ ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамНакладным")))
			 Тогда
			Продолжить;
		КонецЕсли;
		
		СуммыДокумента = ВзаиморасчетыСлужебный.СуммыДокумента(Объект, СтруктураПараметров);
		
		Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты) Тогда
			
			ЭтапыГрафикаОплаты = ЭтапыОплатыРеквизит.Данные[ЭтапыОплатыРеквизит.Имя];
			
			СтруктураПараметровПроверки = ЭтапыОплатыСервер.ПараметрыПроверкиКорректностиЗаполненияЭтапов();
			СтруктураПараметровПроверки.Дата                   = Дата;
			СтруктураПараметровПроверки.Валюта                 = ВалютаВзаиморасчетов;
			СтруктураПараметровПроверки.ЭтоЗаказ               = СтруктураПараметров.ЭтоЗаказ;
			СтруктураПараметровПроверки.НакладнаяИсточникГрафика = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.ЭтоПродажаЗакупка)
																			И Не ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.НакладнаяПоЗаказам,,Ложь)
																			И Не СтруктураПараметров.ЗаданГрафикИсполнения;
			СтруктураПараметровПроверки.НадписьЭтапыОплаты     = СтруктураПараметров.НадписьЭтапыОплаты;
			СтруктураПараметровПроверки.СуммаОплатыПоДокументу = СуммыДокумента.СуммаДокументаБезЗалога;
			СтруктураПараметровПроверки.СуммаЗалогаПоДокументу = СуммыДокумента.СуммаЗалогаЗаТару;
			
			ЭтапыОплатыСервер.ПроверитьКорректностьЭтаповГрафикаОплаты(
					ЭтапыГрафикаОплаты,
					Отказ,
					СтруктураПараметровПроверки,
					Ложь,
					Истина);
			
		ИначеЕсли ЗначениеЗаполнено(СтруктураПараметров.ДатаПлатежа)
			И ТипЗнч(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.Ссылка)) <> Тип("ДокументСсылка.КорректировкаРеализации")
			И ТипЗнч(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.Ссылка)) <> Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
			
			// Не выполняем проверку, если не требуется оплата
			Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧ) Тогда
				ТабличнаяЧасть = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧ);
				ОплатаНеТребуется = Истина;
				Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
					Если СтрокаТаблицы[СтруктураПараметров.ИмяРеквизитаТЧСуммаСНДС] > 0 Тогда
						ОплатаНеТребуется = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			Иначе
				ОплатаНеТребуется = СуммыДокумента.СуммаДокумента <= 0;
			КонецЕсли;
			
			Если НЕ ОплатаНеТребуется Тогда
				ЭтапыОплатыСервер.ПроверитьЗаполнениеКорректностьДатыПлатежа(ДатаПлатежа, Дата, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ЗаполнениеЭтаповОплатыПоЗаказам

// Возвращает структуру с параметрами заполнения этапов оплаты по заказам.
// 
// Возвращаемое значение:
//  Структура - Параметры заполнения этапов оплаты:
// * ДатаОтгрузки                    - Дата - Дата текущей накладной (если одна).
// * Календарь                       - СправочникСсылка.ПроизводственныеКалендари - Календарь, если оплата происходит только по рабочим дням календаря.
// * ДатаПереходаПраваСобственности  - Дата - Дата перехода права собственности.
// * ЕстьДатаПереходаПраваСобственности - Булево - Дата перехода собственности есть в документе.
// * ТабличнаяЧасть                  - см. Документы.РеализацияТоваровУслуг.СуммыПоЗаказам
// * ПорядокРасчетов                 - ПеречислениеСсылка.ПорядокРасчетов - Порядок расчетов документа.
// * ЭтоРасчетыСКлиентами            - Булево, Неопределено - Истина, если это расчеты с клиентами.
// * ЭтоПереходПраваСобственности2_5 - Булево - Признак перехода права собственности 2.5.
//
Функция ПараметрыЗаполненияЭтаповОплатыПоЗаказам() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаОтгрузки",                      Дата(1,1,1));
	СтруктураПараметров.Вставить("Календарь",                         Справочники.ПроизводственныеКалендари.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДатаПереходаПраваСобственности",    Дата(1,1,1));
	СтруктураПараметров.Вставить("ЕстьДатаПереходаПраваСобственности",Ложь);
	СтруктураПараметров.Вставить("ТабличнаяЧасть",                    Новый ТаблицаЗначений);
	СтруктураПараметров.Вставить("ПорядокРасчетов",                   Перечисления.ПорядокРасчетов.ПустаяСсылка());
	СтруктураПараметров.Вставить("ЭтоРасчетыСКлиентами",              Неопределено);
	СтруктураПараметров.Вставить("ЭтоПереходПраваСобственности2_5",   Ложь);
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Заполняет ТЧ ЭтапыГрафикаОплаты по переданной структуре параметров.
// 
// Параметры:
//  ЭтапыГрафикаОплаты - ТаблицаЗначений - Таблица этапов для заполнения.
//  Параметры - см. ПараметрыЗаполненияЭтаповОплатыПоЗаказам
//
Процедура ЗаполнитьЭтапыОплатыДокументаПоЗаказам(ЭтапыГрафикаОплаты, Параметры) Экспорт
	
	ДатаОтгрузки = ?(Параметры.ДатаОтгрузки = Дата(1,1,1), НачалоДня(ТекущаяДатаСеанса()), Параметры.ДатаОтгрузки);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	ТаблицаТовары.Заказ КАК Заказ,
	|	ТаблицаТовары.СверхЗаказа КАК СверхЗаказа,
	|	ТаблицаТовары.СуммаПлатежа КАК СуммаПлатежа,
	|	ТаблицаТовары.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаТовары.СуммаЗалогаЗаТару КАК СуммаЗалогаЗаТару,
	|	ТаблицаТовары.СуммаВзаиморасчетовПоТаре КАК СуммаВзаиморасчетовПоТаре
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ &ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Заказ                    КАК Заказ,
	|	ДанныеДокумента.Заказ.Дата               КАК ДатаЗаказа,
	|	ДанныеДокумента.Заказ.ДатаСогласования   КАК ДатаСогласования,
	|	ВЫБОР КОГДА &ЭтоРасчетыСКлиентами И &ЭтоЗаказКакСчет
	|		ТОГДА ЛОЖЬ
	|		ИНАЧЕ ДанныеДокумента.СверхЗаказа
	|	КОНЕЦ                                    КАК СверхЗаказа,
	|	СУММА(ДанныеДокумента.СуммаПлатежа)      КАК СуммаПлатежа,
	|	ВЫБОР КОГДА СУММА(ДанныеДокумента.СуммаВзаиморасчетов) = 0 
	|		ТОГДА СУММА(ДанныеДокумента.СуммаПлатежа) 
	|		ИНАЧЕ СУММА(ДанныеДокумента.СуммаВзаиморасчетов)
	|	КОНЕЦ                                    КАК СуммаВзаиморасчетов,
	|	СУММА(ДанныеДокумента.СуммаЗалогаЗаТару) КАК СуммаЗалогаЗаТару,
	|	ВЫБОР КОГДА СУММА(ДанныеДокумента.СуммаВзаиморасчетовПоТаре) = 0 
	|		ТОГДА СУММА(ДанныеДокумента.СуммаЗалогаЗаТару) 
	|		ИНАЧЕ СУММА(ДанныеДокумента.СуммаВзаиморасчетовПоТаре)
	|	КОНЕЦ                                    КАК СуммаВзаиморасчетовПоТаре
	|ИЗ
	|	ВтДанныеДокумента КАК ДанныеДокумента
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Заказ,
	|	ДанныеДокумента.СверхЗаказа,
	|	ВЫБОР КОГДА &ЭтоРасчетыСКлиентами И &ЭтоЗаказКакСчет
	|		ТОГДА ЛОЖЬ
	|		ИНАЧЕ ДанныеДокумента.СверхЗаказа
	|	КОНЕЦ
	|;";
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	Заказы.Заказ КАК Заказ,
	|	Заказы.Сдвиг КАК Сдвиг,
	|	Заказы.ВариантОплаты КАК ВариантОплаты,
	|	Заказы.ВариантОтсчета КАК ВариантОтсчета,
	|	Заказы.Формула КАК Формула,
	|	Заказы.ДатаПлатежа КАК ДатаПлатежа,
	|	СУММА(Заказы.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(Заказы.СуммаЗалогаЗаТару) КАК СуммаЗалогаЗаТару,
	|	ВЫРАЗИТЬ(СУММА(Заказы.ПроцентПлатежа) КАК ЧИСЛО(13,10)) КАК ПроцентПлатежа,
	|	ВЫРАЗИТЬ(СУММА(Заказы.ПроцентЗалогаЗаТару) КАК ЧИСЛО(13,10)) КАК ПроцентЗалогаЗаТару,
	|	Заказы.Календарь КАК Календарь
	|ИЗ ("; //@Query-part-1
	
	Если ВзаиморасчетыКлиентСервер.ЭтоТабличнаяЧасть(ЭтапыГрафикаОплаты) Тогда
		СписокТипов = ЭтапыГрафикаОплаты.Колонки.Заказ.ТипЗначения.Типы();
	Иначе
		ТаблицаЗначений = ЭтапыГрафикаОплаты.Выгрузить(); //ТаблицаЗначений
		СписокТипов = ТаблицаЗначений.Колонки.Заказ.ТипЗначения.Типы();
	КонецЕсли;
	
	Для Каждого Тип Из СписокТипов Цикл
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	Заказы.Ссылка КАК Заказ,
		|	Заказы.Сдвиг КАК Сдвиг,
		|	Заказы.ВариантОплаты КАК ВариантОплаты,
		|	Заказы.ВариантОтсчета КАК ВариантОтсчета,
		|	Заказы.Формула КАК Формула,
		|	ВЫБОР КОГДА Заказы.ВариантОтсчета = ЗНАЧЕНИЕ(Перечисление.ВариантыОтсчетаДатыПлатежа.ФиксированнаяДата)
		|		ТОГДА Заказы.ДатаПлатежа
		|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
		|	КОНЕЦ КАК ДатаПлатежа,
		|	Заказы.СуммаПлатежа КАК СуммаПлатежа,
		|	Заказы.СуммаЗалогаЗаТару КАК СуммаЗалогаЗаТару,
		|	Заказы.ПроцентПлатежа КАК ПроцентПлатежа,
		|	Заказы.ПроцентЗалогаЗаТару КАК ПроцентЗалогаЗаТару,
		|	&Календарь КАК Календарь
		|ИЗ
		|	&ЭтапыГрафикаОплаты КАК Заказы
		|ГДЕ
		|	Заказы.Ссылка В (&СписокЗаказов)
		|";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтапыГрафикаОплаты", Метаданные.НайтиПоТипу(Тип).ПолноеИмя()+".ЭтапыГрафикаОплаты");
		Если Параметры.ЭтоРасчетыСКлиентами 
			И Метаданные.НайтиПоТипу(Тип).Реквизиты.Найти("ГрафикОплаты") <> Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Календарь", "Заказы.Ссылка.ГрафикОплаты.Календарь");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Календарь", "ЗНАЧЕНИЕ(Справочник.ПроизводственныеКалендари.ПустаяСсылка)");
		КонецЕсли;
		
		Если Тип <> СписокТипов[СписокТипов.Количество()-1] Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|ОБЪЕДИНИТЬ ВСЕ
			|"
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + ") КАК Заказы
	|
	|СГРУППИРОВАТЬ ПО
	|	Заказ,
	|	ДатаПлатежа,
	|	Формула,
	|	Сдвиг,
	|	ВариантОплаты,
	|	ВариантОтсчета,
	|	Календарь
	|";
	
	Если Параметры.ТабличнаяЧасть.Количество() > 0
		И (ТипЗнч(Параметры.ТабличнаяЧасть[0].Заказ) = Тип("ДокументСсылка.ЗаказКлиента")
		Или ТипЗнч(Параметры.ТабличнаяЧасть[0].Заказ) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента")) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоЗаказКакСчет", "ДанныеДокумента.Заказ.ЭтоЗаказКакСчет");
	Иначе
		// для всех остальных типов документов используются расширенные возможности заказов
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоЗаказКакСчет", "ЛОЖЬ");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаТовары", Параметры.ТабличнаяЧасть);
	Запрос.УстановитьПараметр("СписокЗаказов", Параметры.ТабличнаяЧасть.ВыгрузитьКолонку("Заказ"));
	Запрос.УстановитьПараметр("ЭтоРасчетыСКлиентами", Параметры.ЭтоРасчетыСКлиентами);
	
	УстановитьПривилегированныйРежим(Истина);
	Результаты = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	Заказы           = Результаты[1].Выгрузить();
	СтрокиЭтапов     = Результаты[2].Выгрузить();
	СтрокиЭтапов.Индексы.Добавить("Заказ");
	
	ЭтапыГрафикаОплаты.Очистить();
	
	Если НЕ ВзаиморасчетыКлиентСервер.ЭтоТабличнаяЧасть(ЭтапыГрафикаОплаты) Тогда
		ЭтапыЗаказа = ЭтапыГрафикаОплаты.Выгрузить();
		ЭтапыГрафикаОплатыНовые = ЭтапыГрафикаОплаты.Выгрузить();
	Иначе
		ЭтапыЗаказа = ЭтапыГрафикаОплаты.Скопировать();
		ЭтапыГрафикаОплатыНовые = ЭтапыГрафикаОплаты.Скопировать();
	КонецЕсли;
	
	Для Каждого СтрокаЗаказа Из Заказы Цикл
		
		// В реквизите заказа хранится округленный до двух знаков после запятой процент, расситаем проценты с точностью до 10 знаков
		ГрафикЗаказа = СтрокиЭтапов.Скопировать(Новый Структура("Заказ",СтрокаЗаказа.Заказ));
		МассивСуммаПлатежа = ГрафикЗаказа.ВыгрузитьКолонку("СуммаПлатежа");
		МассивСуммаЗалогаЗаТару = ГрафикЗаказа.ВыгрузитьКолонку("СуммаЗалогаЗаТару");
		МассивПроцентовПлатежа = ОбщегоНазначенияУТКлиентСервер.РаспределитьПропорционально(100, МассивСуммаПлатежа, 10);
		МассивПроцентовЗалогаЗаТару = ОбщегоНазначенияУТКлиентСервер.РаспределитьПропорционально(100, МассивСуммаЗалогаЗаТару, 10);
		Для Индекс = 0 По ГрафикЗаказа.Количество() - 1 Цикл
			ГрафикЗаказа[Индекс].ПроцентПлатежа = ?(МассивПроцентовПлатежа = Неопределено, 0, МассивПроцентовПлатежа[Индекс]);
			ГрафикЗаказа[Индекс].ПроцентЗалогаЗаТару = ?(МассивПроцентовЗалогаЗаТару = Неопределено, 0,  МассивПроцентовЗалогаЗаТару[Индекс]);
		КонецЦикла;
		
		ПараметрыЗаполнения = ПараметрыЗаполненияЭтаповОплаты();
		
		Если Параметры.ЭтоПереходПраваСобственности2_5 Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Заказ", СтрокаЗаказа.Заказ);
			Отбор.Вставить("СверхЗаказа", СтрокаЗаказа.СверхЗаказа);
			ДатыОтгрузкиПоЗаказу = Параметры.ТабличнаяЧасть.Скопировать(Отбор, "ДатаОтгрузки, СуммаПлатежа, СуммаЗалогаЗаТару");
			Если ДатыОтгрузкиПоЗаказу.Количество() > 0 Тогда
				ПараметрыЗаполнения.ТабличнаяЧасть = ДатыОтгрузкиПоЗаказу;
			Иначе
				ПараметрыЗаполнения.ДатаОтгрузки = ДатаОтгрузки;
			КонецЕсли;
		Иначе
			ПараметрыЗаполнения.ДатаОтгрузки = ДатаОтгрузки;
		КонецЕсли;
		
		ПараметрыЗаполнения.ДатаЗаказа = СтрокаЗаказа.ДатаЗаказа;
		ПараметрыЗаполнения.ДатаСогласования = СтрокаЗаказа.ДатаСогласования;
		ПараметрыЗаполнения.ДатаПереходаПраваСобственности = Параметры.ДатаПереходаПраваСобственности;
		ПараметрыЗаполнения.ЕстьДатаПереходаПраваСобственности = Параметры.ЕстьДатаПереходаПраваСобственности;
		ПараметрыЗаполнения.СуммаЗалогаЗаТару = СтрокаЗаказа.СуммаЗалогаЗаТару;
		ПараметрыЗаполнения.СуммаОплаты = СтрокаЗаказа.СуммаПлатежа;
		ПараметрыЗаполнения.Календарь = Параметры.Календарь;
		ПараметрыЗаполнения.ШаблонГрафика = ГрафикЗаказа;
		ПараметрыЗаполнения.НакладнаяПоЗаказам = Истина;
		ПараметрыЗаполнения.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам;
		ПараметрыЗаполнения.ЭтоЗаказ = Ложь;
		ПараметрыЗаполнения.ЭтоРасчетыСКлиентами = Параметры.ЭтоРасчетыСКлиентами;
		
		ЗаполнитьЭтапыОплатыДокументаПоШаблону(ЭтапыЗаказа, ПараметрыЗаполнения);
		
		СуммаВзаиморасчетовКРаспределению = СтрокаЗаказа.СуммаВзаиморасчетов;
		СуммаВзаиморасчетовПоТареКРаспределению = СтрокаЗаказа.СуммаВзаиморасчетовПоТаре;
		
		Для Каждого Стр Из ЭтапыЗаказа Цикл
			НовСтр = ЭтапыГрафикаОплатыНовые.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
			НовСтр.Заказ = СтрокаЗаказа.Заказ;
			НовСтр.СверхЗаказа = СтрокаЗаказа.СверхЗаказа;
			
			Если Стр = ЭтапыЗаказа[ЭтапыЗаказа.Количество()-1] Тогда
				НовСтр.СуммаВзаиморасчетов = СуммаВзаиморасчетовКРаспределению;
				НовСтр.СуммаВзаиморасчетовПоТаре = СуммаВзаиморасчетовПоТареКРаспределению;
			Иначе
				Если СтрокаЗаказа.СуммаПлатежа > 0 Тогда
					НовСтр.СуммаВзаиморасчетов = СтрокаЗаказа.СуммаВзаиморасчетов * НовСтр.СуммаПлатежа / СтрокаЗаказа.СуммаПлатежа;
				КонецЕсли;
				Если СтрокаЗаказа.СуммаЗалогаЗаТару > 0 Тогда
					НовСтр.СуммаВзаиморасчетовПоТаре = СтрокаЗаказа.СуммаВзаиморасчетовПоТаре * НовСтр.СуммаЗалогаЗаТару / СтрокаЗаказа.СуммаЗалогаЗаТару;
				КонецЕсли;
			КонецЕсли;
			
			СуммаВзаиморасчетовКРаспределению = СуммаВзаиморасчетовКРаспределению - НовСтр.СуммаВзаиморасчетов;
			СуммаВзаиморасчетовПоТареКРаспределению = СуммаВзаиморасчетовПоТареКРаспределению - НовСтр.СуммаВзаиморасчетовПоТаре;
			
		КонецЦикла;
		
		ЭтапыЗаказа.Очистить();
		
	КонецЦикла;
	
	КолонкиИзмерений = "Заказ,СверхЗаказа,ВариантОплаты,ДатаПлатежа,Сдвиг,ВариантОтсчета,Формула";
	КолонкиРесурсов = "СуммаПлатежа,ПроцентПлатежа,СуммаЗалогаЗаТару,ПроцентЗалогаЗаТару,СуммаВзаиморасчетов,СуммаВзаиморасчетовПоТаре";
	
	ЭтапыГрафикаОплатыНовые.Свернуть(КолонкиИзмерений,КолонкиРесурсов);
	
	ЗаполнитьПроцентыПоСуммам(ЭтапыГрафикаОплатыНовые);
	ЭтапыОплатыКлиентСервер.СортироватьТаблицуЭтапов(ЭтапыГрафикаОплатыНовые);
	
	Для Каждого Стр Из ЭтапыГрафикаОплатыНовые Цикл
		ЗаполнитьЗначенияСвойств(ЭтапыГрафикаОплаты.Добавить(),Стр);
	КонецЦикла;
	
КонецПроцедуры

// Распределяет суммы документа по процентам графика
// 
// Параметры:
//  ЭтапыГрафикаОплаты -ТаблицаЗначений - Этапы графика оплаты.
//  Параметры - см. ПараметрыЗаполненияЭтаповОплатыПоЗаказам
//
Процедура РаспределитьСуммыЭтаповОплатыДокументаПоЗаказам(ЭтапыГрафикаОплаты, Параметры) Экспорт
	
	Запрос   = Новый Запрос;
	Менеджер = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = Менеджер;
	
	Суммы = Параметры.ТабличнаяЧасть;
	
	Если ВзаиморасчетыКлиентСервер.ЭтоТабличнаяЧасть(ЭтапыГрафикаОплаты) Тогда
		ЕстьТара = ЭтапыГрафикаОплаты.Колонки.Найти("СуммаЗалогаЗаТару") <> Неопределено;
	Иначе
		ТаблицаЗначений = ЭтапыГрафикаОплаты.Выгрузить(); //ТаблицаЗначений
		ЕстьТара = ТаблицаЗначений.Колонки.Найти("СуммаЗалогаЗаТару") <> Неопределено;
	КонецЕсли;
	
	Для Каждого СтрокаСумм Из Суммы Цикл
		
		СтрокиГрафика = ЭтапыГрафикаОплаты.НайтиСтроки(Новый Структура("Заказ, СверхЗаказа", СтрокаСумм.Заказ, СтрокаСумм.СверхЗаказа));
		
		СуммаПлатежа              = СтрокаСумм.СуммаПлатежа;
		СуммаВзаиморасчетов       = СтрокаСумм.СуммаВзаиморасчетов;
		СуммаЗалогаЗаТару         = СтрокаСумм.СуммаЗалогаЗаТару;
		СуммаВзаиморасчетовПоТаре = СтрокаСумм.СуммаВзаиморасчетовПоТаре;
		
		ВалютыСовпадают = СуммаПлатежа = СуммаВзаиморасчетов;
		
		СуммаПроцентовПлатежа = 0;
		СуммаПроцентовЗалога = 0;
		Для Каждого СтрокаГрафика Из СтрокиГрафика Цикл
			СуммаПроцентовПлатежа = СуммаПроцентовПлатежа + СтрокаГрафика.ПроцентПлатежа;
			Если ЕстьТара Тогда
				СуммаПроцентовЗалога = СуммаПроцентовЗалога + СтрокаГрафика.ПроцентЗалогаЗаТару;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаГрафика Из СтрокиГрафика Цикл
			
			ЭтоПоследняяСтрока = СтрокаГрафика = СтрокиГрафика[СтрокиГрафика.Количество()-1];
			
			Если СуммаПлатежа <> 0 И СуммаПроцентовПлатежа <> 0 Тогда
				Если ЭтоПоследняяСтрока Тогда
					СтрокаГрафика.СуммаПлатежа = СуммаПлатежа;
				Иначе
					СтрокаГрафика.СуммаПлатежа = СтрокаГрафика.ПроцентПлатежа / СуммаПроцентовПлатежа * СтрокаСумм.СуммаПлатежа;
				КонецЕсли;
				СуммаПлатежа = СуммаПлатежа - СтрокаГрафика.СуммаПлатежа;
			Иначе
				СтрокаГрафика.СуммаПлатежа = 0;
			КонецЕсли;
			
			Если СуммаВзаиморасчетов <> 0 Тогда
				Если ВалютыСовпадают Тогда
					СтрокаГрафика.СуммаВзаиморасчетов = СтрокаГрафика.СуммаПлатежа;
				ИначеЕсли ЭтоПоследняяСтрока Тогда
					СтрокаГрафика.СуммаВзаиморасчетов = СуммаВзаиморасчетов;
				Иначе
					СтрокаГрафика.СуммаВзаиморасчетов = СтрокаГрафика.СуммаПлатежа / СтрокаСумм.СуммаПлатежа * СтрокаСумм.СуммаВзаиморасчетов;
				КонецЕсли;
				СуммаВзаиморасчетов = СуммаВзаиморасчетов - СтрокаГрафика.СуммаВзаиморасчетов;
			Иначе
				СтрокаГрафика.СуммаВзаиморасчетов = 0;
			КонецЕсли;
			
			Если СуммаЗалогаЗаТару <> 0 И СуммаПроцентовЗалога <> 0 Тогда
				Если ЭтоПоследняяСтрока Тогда
					СтрокаГрафика.СуммаЗалогаЗаТару = СуммаЗалогаЗаТару;
				Иначе
					СтрокаГрафика.СуммаЗалогаЗаТару = СтрокаГрафика.ПроцентЗалогаЗаТару / СуммаПроцентовЗалога * СтрокаСумм.СуммаЗалогаЗаТару;
				КонецЕсли;
				СуммаЗалогаЗаТару = СуммаЗалогаЗаТару - СтрокаГрафика.СуммаЗалогаЗаТару;
			ИначеЕсли ЕстьТара Тогда
				СтрокаГрафика.СуммаЗалогаЗаТару = 0;
			КонецЕсли;
			
			Если СуммаВзаиморасчетовПоТаре <> 0 Тогда
				Если ВалютыСовпадают Тогда
					СтрокаГрафика.СуммаВзаиморасчетовПоТаре = СтрокаГрафика.СуммаЗалогаЗаТару;
				ИначеЕсли ЭтоПоследняяСтрока Тогда
					СтрокаГрафика.СуммаВзаиморасчетовПоТаре = СуммаВзаиморасчетовПоТаре;
				Иначе
					СтрокаГрафика.СуммаВзаиморасчетовПоТаре = СтрокаГрафика.СуммаЗалогаЗаТару / СтрокаСумм.СуммаЗалогаЗаТару * СтрокаСумм.СуммаВзаиморасчетовПоТаре;
				КонецЕсли;
				СуммаВзаиморасчетовПоТаре = СуммаВзаиморасчетовПоТаре - СтрокаГрафика.СуммаВзаиморасчетовПоТаре;
			ИначеЕсли ЕстьТара Тогда
				СтрокаГрафика.СуммаВзаиморасчетовПоТаре = 0;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеЭтаповОплаты

// Возвращает структуру с параметрами заполнения этапов оплаты по соглашению, графику оплаты или по умолчанию.
// 
// Возвращаемое значение:
//  Структура - Параметры заполнения этапов оплаты:
// * ДатаЗаказа                     - Дата - Дата заказа, если есть.
// * ДатаСогласования               - Дата - Дата заказа, если есть.
// * ДатаОтгрузки                   - Дата - Общая дата отгрузки или таблица значений с колонками "ДатаОтгрузки","СуммаПлатежа" и "СуммаЗалогаЗаТару".
// * ТабличнаяЧасть                 - см. Документы.РеализацияТоваровУслуг.СуммыПоЗаказам
// * ДатаПереходаПраваСобственности - Дата - Дата перехода права собственности.
// * СрокПереходаПраваСобственности - Число - Срок перехода права собственности из соглашения.
// * СуммаОплаты                    - Число - Общая сумма к оплате, без учета залога.
// * СуммаЗалогаЗаТару              - Число - Сумма залога за тару.
// * СуммаВзаиморасчетов            - Число - Общая сумма взаиморасчетов.
// * СуммаВзаиморасчетовПоТаре      - Число - Сумма взаиморасчетов по таре.
// 
// * ГрафикСоглашенияЗаполнен       - Булево - В соглашении заполнен график оплат.
// * Соглашение                     - СправочникСсылка.СоглашенияСКлиентами, СправочникСсылка.СоглашенияСПоставщиками - Соглашение, если есть.
// * ГрафикИсполненияДоговора       - ДокументСсылка.ГрафикИсполненияДоговора - График договора, если есть.
// * ГрафикОплаты                   - СправочникСсылка.ГрафикиОплаты - График из документа, если есть.
// 
// * ПорядокРасчетов                - ПеречислениеСсылка.ПорядокРасчетов - Порядок расчетов документа.
// * ЭтоРасчетыСКлиентами           - Булево, Неопределено - Истина, если это расчеты с клиентами.
// * ЭтоЗаказ                       - Булево, Неопределено - Истина, если это заказ.
// * НетКонтроляПредоплаты          - Булево, Неопределено - Истина, если не нужно проверять заполненность предоплаты.
// * НакладнаяПоЗаказам             - Булево, Неопределено - Истина, если это накладная по заказам.
// 
// * ШаблонГрафика                  - Неопределено,ТаблицаЗначений:
// 		** ВариантОплаты                - ПеречислениеСсылка.ВариантыКонтроляОплатыКлиентом - Вариант контроля.
// 
// * Календарь                      - СправочникСсылка.ПроизводственныеКалендари - Календарь, если оплата происходит только по рабочим дням календаря.
// * ЭтоПереходПраваСобственности2_5 - Булево - Признак отгрузки без перехода права собственности 2.5.
//
Функция ПараметрыЗаполненияЭтаповОплаты() Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ДатаЗаказа",                        Дата(1,1,1));
	СтруктураПараметров.Вставить("ДатаСогласования",                  Дата(1,1,1));
	СтруктураПараметров.Вставить("ДатаОтгрузки",                      Дата(1,1,1));
	СтруктураПараметров.Вставить("ДатаПоступления",                   Дата(1,1,1));
	СтруктураПараметров.Вставить("ТабличнаяЧасть",                    Неопределено);
	СтруктураПараметров.Вставить("ДатаПереходаПраваСобственности",    Дата(1,1,1));
	СтруктураПараметров.Вставить("ЕстьДатаПереходаПраваСобственности", Ложь);
	СтруктураПараметров.Вставить("СрокПереходаПраваСобственности",    0);
	СтруктураПараметров.Вставить("СуммаОплаты",                       0);
	СтруктураПараметров.Вставить("СуммаЗалогаЗаТару",                 0);
	СтруктураПараметров.Вставить("СуммаВзаиморасчетов",               0);
	СтруктураПараметров.Вставить("СуммаВзаиморасчетовПоТаре",         0);
	
	СтруктураПараметров.Вставить("ГрафикСоглашенияЗаполнен",          Ложь);
	СтруктураПараметров.Вставить("Соглашение",                        Справочники.СоглашенияСКлиентами.ПустаяСсылка());
	СтруктураПараметров.Вставить("ГрафикИсполненияДоговора",          Документы.ГрафикИсполненияДоговора.ПустаяСсылка());
	СтруктураПараметров.Вставить("ГрафикОплаты",                      справочники.ГрафикиОплаты.ПустаяСсылка());
	
	СтруктураПараметров.Вставить("ПорядокРасчетов",                   Перечисления.ПорядокРасчетов.ПустаяСсылка());
	СтруктураПараметров.Вставить("ЭтоРасчетыСКлиентами",              Неопределено);
	СтруктураПараметров.Вставить("ЭтоЗаказ",                          Неопределено);
	СтруктураПараметров.Вставить("НетКонтроляПредоплаты",             Ложь);
	СтруктураПараметров.Вставить("НакладнаяПоЗаказам",                Неопределено);
	
	СтруктураПараметров.Вставить("ШаблонГрафика",                     Неопределено);
	СтруктураПараметров.Вставить("Календарь",                         Справочники.ПроизводственныеКалендари.ПустаяСсылка());
	СтруктураПараметров.Вставить("ЭтоПереходПраваСобственности2_5",   Ложь);
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Заполняет этапы графика оплаты или распределяет уже заполненную сумму в документах продажи.
//
// Параметры:
// 		ЭтапыГрафикаОплаты - ТаблицаЗначений - таблица этапов оплаты.
// 		ПараметрыЗаполнения - см. ПараметрыЗаполненияЭтаповОплаты
//
Процедура ЗаполнитьЭтапыОплаты(ЭтапыГрафикаОплаты, ПараметрыЗаполнения) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.ГрафикИсполненияДоговора) 
		И НЕ ПараметрыЗаполнения.ЭтоЗаказ Тогда
		ЗаполнитьЭтапыОплатыПоГрафикуИсполнения(ЭтапыГрафикаОплаты, ПараметрыЗаполнения);
	ИначеЕсли ЗначениеЗаполнено(ПараметрыЗаполнения.ГрафикОплаты) И ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты") Тогда
		ЗаполнитьЭтапыОплатыПоГрафикуОплаты(ЭтапыГрафикаОплаты, ПараметрыЗаполнения);
	ИначеЕсли ПараметрыЗаполнения.ГрафикСоглашенияЗаполнен Тогда
		ЗаполнитьЭтапыОплатыПоСоглашению(ЭтапыГрафикаОплаты, ПараметрыЗаполнения);
	ИначеЕсли ЭтапыГрафикаОплаты.Количество() > 0 Тогда
		ЭтапыОплатыКлиентСервер.РаспределитьСуммуПоЭтапамГрафикаОплаты(
			ЭтапыГрафикаОплаты,
			ПараметрыЗаполнения.СуммаОплаты,
			ПараметрыЗаполнения.СуммаЗалогаЗаТару,
			ПараметрыЗаполнения.СуммаВзаиморасчетов,
			ПараметрыЗаполнения.СуммаВзаиморасчетовПоТаре);
	ИначеЕсли ЗначениеЗаполнено(ПараметрыЗаполнения.ТабличнаяЧасть) Тогда
		ЗаполнитьЭтапыОплатыПоТаблицеОтгрузок(ЭтапыГрафикаОплаты, ПараметрыЗаполнения);
	Иначе
		НовСтр = ЭтапыГрафикаОплаты.Добавить();
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр, "ВариантОплаты") Тогда
			Если ПараметрыЗаполнения.ЭтоРасчетыСКлиентами Тогда
				НовСтр.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки;
			Иначе
				НовСтр.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыЗаполнения.ДатаЗаказа) Тогда
			НовСтр.ДатаПлатежа  = ПараметрыЗаполнения.ДатаЗаказа;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр, "ВариантОтсчета") Тогда
				НовСтр.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа;
			КонецЕсли;
		Иначе
			НовСтр.ДатаПлатежа  = ПараметрыЗаполнения.ДатаОтгрузки;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр, "ВариантОтсчета") Тогда
				Если ПараметрыЗаполнения.ЭтоПереходПраваСобственности2_5 Тогда
					НовСтр.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыПереходаПраваСобственности;
					НовСтр.ДатаПлатежа = ПараметрыЗаполнения.ДатаПереходаПраваСобственности;
				Иначе
					НовСтр.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки;
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр,"ДатаОтгрузки") Тогда
					НовСтр.ДатаОтгрузки = ПараметрыЗаполнения.ДатаОтгрузки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НовСтр.СуммаПлатежа = ПараметрыЗаполнения.СуммаОплаты;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр, "СуммаЗалогаЗаТару") Тогда
			НовСтр.СуммаЗалогаЗаТару     = ПараметрыЗаполнения.СуммаЗалогаЗаТару;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр, "СуммаВзаиморасчетов") Тогда
			НовСтр.СуммаВзаиморасчетов = ПараметрыЗаполнения.СуммаВзаиморасчетов;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр, "СуммаВзаиморасчетовПоТаре") Тогда
			НовСтр.СуммаВзаиморасчетовПоТаре = ПараметрыЗаполнения.СуммаВзаиморасчетовПоТаре;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьПроцентыПоСуммам(ЭтапыГрафикаОплаты);
	
КонецПроцедуры

// Заполняет этапы графика оплаты в документе по графику исполнения договора.
//
// Параметры:
// 		ЭтапыГрафикаОплаты - ТаблицаЗначений - таблица этапов оплаты.
// 		ПараметрыЗаполнения - см. ПараметрыЗаполненияЭтаповОплаты
//
Процедура ЗаполнитьЭтапыОплатыПоГрафикуИсполнения(ЭтапыГрафикаОплаты, ПараметрыЗаполнения) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЭтапыГрафикаОплатыТЧ.ВариантОплаты      КАК ВариантОплаты,
	|	ЭтапыГрафикаОплатыТЧ.Сдвиг              КАК Сдвиг,
	|	ЭтапыГрафикаОплатыТЧ.ВариантОтсчета     КАК ВариантОтсчета,
	|	ЭтапыГрафикаОплатыТЧ.Формула            КАК Формула,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВариантОпределенияГрафикаИсполненияВДоговоре
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыОпределенияГрафикаИсполненияВДоговоре.РегулярныеПлатежи)
	|		ТОГДА 100
	|		ИНАЧЕ СУММА(ЭтапыГрафикаОплатыТЧ.ПроцентПлатежа)
	|	КОНЕЦ КАК ПроцентПлатежа,
	|	0                                       КАК ПроцентЗалогаЗаТару,
	|	Неопределено                            КАК ФормаОплаты,
	|	ДоговорыКонтрагентов.Дата 				КАК ДатаДоговора,
	|	ВЫБОР КОГДА ЭтапыГрафикаОплатыТЧ.ВариантОтсчета = ЗНАЧЕНИЕ(Перечисление.ВариантыОтсчетаДатыПлатежа.ФиксированнаяДата)
	|		ТОГДА ЭтапыГрафикаОплатыТЧ.ДатаПлатежа
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
	|	КОНЕЦ                                   КАК ДатаПлатежа,
	|	ГрафикИсполненияДоговораШапка.Календарь КАК Календарь
	|ИЗ
	|	Документ.ГрафикИсполненияДоговора КАК ГрафикИсполненияДоговораШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Документ.ГрафикИсполненияДоговора.ЭтапыГрафикаОплаты КАК ЭтапыГрафикаОплатыТЧ
	|		ПО
	|			ГрафикИсполненияДоговораШапка.Ссылка = ЭтапыГрафикаОплатыТЧ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО
	|			ДоговорыКонтрагентов.Ссылка = ГрафикИсполненияДоговораШапка.Договор
	|ГДЕ
	|	ГрафикИсполненияДоговораШапка.Ссылка = &ГрафикИсполненияДоговора
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыГрафикаОплатыТЧ.ВариантОплаты,
	|	ЭтапыГрафикаОплатыТЧ.Сдвиг,
	|	ЭтапыГрафикаОплатыТЧ.ВариантОтсчета,
	|	ЭтапыГрафикаОплатыТЧ.Формула,
	|	ВЫБОР КОГДА ЭтапыГрафикаОплатыТЧ.ВариантОтсчета = ЗНАЧЕНИЕ(Перечисление.ВариантыОтсчетаДатыПлатежа.ФиксированнаяДата)
	|		ТОГДА ЭтапыГрафикаОплатыТЧ.ДатаПлатежа
	|		ИНАЧЕ ДАТАВРЕМЯ(1,1,1)
	|	КОНЕЦ,
	|	ГрафикИсполненияДоговораШапка.Календарь,
	|	ДоговорыКонтрагентов.Дата,
	|	ДоговорыКонтрагентов.ВариантОпределенияГрафикаИсполненияВДоговоре");
	
	Запрос.УстановитьПараметр("ГрафикИсполненияДоговора", ПараметрыЗаполнения.ГрафикИсполненияДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка         = РезультатЗапроса.Выгрузить();
	
	Если ПараметрыЗаполнения.СуммаОплаты = 0 ИЛИ Выгрузка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения.Вставить("ШаблонГрафика",Выгрузка);
	ПараметрыЗаполнения.Вставить("Календарь",Выгрузка[0].Календарь);
	ПараметрыЗаполнения.Вставить("ДатаЗаказа",Выгрузка[0].ДатаДоговора);
	
	ЗаполнитьЭтапыОплатыДокументаПоШаблону(ЭтапыГрафикаОплаты, ПараметрыЗаполнения);
КонецПроцедуры

// Заполняет этапы графика оплаты в документе по графику указанном в соглашении.
//
// Параметры:
// 		ЭтапыГрафикаОплаты - ТаблицаЗначений - таблица этапов оплаты.
// 		ПараметрыЗаполнения - см. ПараметрыЗаполненияЭтаповОплаты
//
Процедура ЗаполнитьЭтапыОплатыПоСоглашению(ЭтапыГрафикаОплаты, ПараметрыЗаполнения) Экспорт
	
	Если ТипЗнч(ПараметрыЗаполнения.Соглашение) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты") Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ГрафикиОплатыЭтапы.НомерСтроки КАК НомерСтроки,
			|	ГрафикиОплатыЭтапы.ВариантОплаты КАК ВариантОплаты,
			|	ГрафикиОплатыЭтапы.Сдвиг КАК Сдвиг,
			|	ГрафикиОплатыЭтапы.ВариантОтсчета КАК ВариантОтсчета,
			|	ГрафикиОплатыЭтапы.Формула КАК Формула,
			|	ГрафикиОплатыЭтапы.ПроцентПлатежа КАК ПроцентПлатежа,
			|	ГрафикиОплатыЭтапы.ПроцентЗалогаЗаТару КАК ПроцентЗалогаЗаТару,
			|	ГрафикиОплатыЭтапы.Ссылка.ФормаОплаты КАК ФормаОплаты,
			|	ГрафикиОплатыЭтапы.Ссылка.Календарь КАК Календарь,
			|	СоглашенияСКлиентами.СрокПереходаПраваСобственности КАК СрокПереходаПраваСобственности
			|ИЗ
			|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГрафикиОплаты.Этапы КАК ГрафикиОплатыЭтапы
			|		ПО СоглашенияСКлиентами.ГрафикОплаты = ГрафикиОплатыЭтапы.Ссылка
			|ГДЕ
			|	СоглашенияСКлиентами.Ссылка = &Соглашение
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки");
		Иначе
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки,
			|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.ВариантОплаты КАК ВариантОплаты,
			|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.Формула КАК Формула,
			|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.Сдвиг КАК Сдвиг,
			|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.ВариантОтсчета КАК ВариантОтсчета,
			|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
			|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.ПроцентЗалогаЗаТару КАК ПроцентЗалогаЗаТару,
			|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.Ссылка.ФормаОплаты КАК ФормаОплаты,
			|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.Ссылка.Календарь КАК Календарь,
			|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.Ссылка.СрокПереходаПраваСобственности КАК СрокПереходаПраваСобственности
			|ИЗ
			|	Справочник.СоглашенияСКлиентами.ЭтапыГрафикаОплаты КАК СоглашенияСКлиентамиЭтапыГрафикаОплаты
			|ГДЕ
			|	СоглашенияСКлиентамиЭтапыГрафикаОплаты.Ссылка = &Соглашение
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки");
			ПараметрыЗаполнения.ЭтоРасчетыСКлиентами = Истина;
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки,
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.ВариантОплаты КАК ВариантОплаты,
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.Сдвиг КАК Сдвиг,
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.ВариантОтсчета КАК ВариантОтсчета,
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.Формула КАК Формула,
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.ПроцентЗалогаЗаТару КАК ПроцентЗалогаЗаТару,
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.Ссылка.ФормаОплаты КАК ФормаОплаты,
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.Ссылка.Календарь КАК Календарь,
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.Ссылка.СрокПереходаПраваСобственности КАК СрокПереходаПраваСобственности
		|ИЗ
		|	Справочник.СоглашенияСПоставщиками.ЭтапыГрафикаОплаты КАК СоглашенияСПоставщикамиЭтапыГрафикаОплаты
		|ГДЕ
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.Ссылка = &Соглашение
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		ПараметрыЗаполнения.ЭтоРасчетыСКлиентами = Ложь;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Соглашение", ПараметрыЗаполнения.Соглашение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка         = РезультатЗапроса.Выгрузить();
	
	Если (ПараметрыЗаполнения.СуммаОплаты = 0 И ПараметрыЗаполнения.СуммаЗалогаЗаТару = 0) ИЛИ Выгрузка.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыЗаполнения.Вставить("СрокПереходаПраваСобственности",Выгрузка[0].СрокПереходаПраваСобственности);
	ПараметрыЗаполнения.Вставить("ШаблонГрафика",Выгрузка);
	ПараметрыЗаполнения.Вставить("Календарь",Выгрузка[0].Календарь);
	
	ЗаполнитьЭтапыОплатыДокументаПоШаблону(ЭтапыГрафикаОплаты, ПараметрыЗаполнения);
	
КонецПроцедуры

// Заполняет этапы графика оплаты в документе по графику оплаты указанном в соглашении.
//
// Параметры:
// 		ЭтапыГрафикаОплаты - ТаблицаЗначений - таблица этапов оплаты.
// 		ПараметрыЗаполнения - см. ПараметрыЗаполненияЭтаповОплаты
//
Процедура ЗаполнитьЭтапыОплатыПоГрафикуОплаты(ЭтапыГрафикаОплаты, ПараметрыЗаполнения) Экспорт
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ГрафикиОплатыЭтапы.НомерСтроки         КАК НомерСтроки,
		|	ГрафикиОплатыЭтапы.ВариантОплаты       КАК ВариантОплаты,
		|	ГрафикиОплатыЭтапы.ВариантОтсчета      КАК ВариантОтсчета,
		|	ГрафикиОплатыЭтапы.Формула             КАК Формула,
		|	ГрафикиОплатыЭтапы.Сдвиг               КАК Сдвиг,
		|	ГрафикиОплатыЭтапы.ПроцентПлатежа      КАК ПроцентПлатежа,
		|	ГрафикиОплатыЭтапы.ПроцентЗалогаЗаТару КАК ПроцентЗалогаЗаТару,
		|	ГрафикиОплатыЭтапы.Ссылка.Календарь    КАК Календарь,
		|	ГрафикиОплатыЭтапы.Ссылка.ФормаОплаты  КАК ФормаОплаты
		|ИЗ
		|	Справочник.ГрафикиОплаты.Этапы КАК ГрафикиОплатыЭтапы
		|ГДЕ
		|	ГрафикиОплатыЭтапы.Ссылка = &ГрафикОплаты
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки ВОЗР
		|");
		
	Запрос.УстановитьПараметр("ГрафикОплаты",ПараметрыЗаполнения.ГрафикОплаты);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка         = РезультатЗапроса.Выгрузить();
	
	Если (ПараметрыЗаполнения.СуммаОплаты = 0 И ПараметрыЗаполнения.СуммаЗалогаЗаТару = 0) ИЛИ Выгрузка.Количество() = 0 Тогда
		
		ЭтапыГрафикаОплаты.Очистить();
		Возврат;
		
	КонецЕсли;
	
	ПараметрыЗаполнения.Вставить("ШаблонГрафика",                  Выгрузка);
	ПараметрыЗаполнения.Вставить("Календарь",                      Выгрузка[0].Календарь);
	
	ЗаполнитьЭтапыОплатыДокументаПоШаблону(ЭтапыГрафикаОплаты, ПараметрыЗаполнения);
	
КонецПроцедуры

// Заполняет этапы графика оплаты в документе по переданной таблице отгрузок.
//
// Параметры:
// 		ЭтапыГрафикаОплаты - ТаблицаЗначений - таблица этапов оплаты.
// 		ПараметрыЗаполнения - см. ПараметрыЗаполненияЭтаповОплаты
//
Процедура ЗаполнитьЭтапыОплатыПоТаблицеОтгрузок(ЭтапыГрафикаОплаты, ПараметрыЗаполнения) Экспорт
	
	Для Каждого СтрокаОтгрузки Из ПараметрыЗаполнения.ТабличнаяЧасть Цикл
		НовСтр = ЭтапыГрафикаОплаты.Добавить();
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр, "ВариантОплаты") Тогда
			Если ПараметрыЗаполнения.ЭтоРасчетыСКлиентами Тогда
				НовСтр.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки;
			Иначе
				НовСтр.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыЗаполнения.ДатаЗаказа) Тогда
			НовСтр.ДатаПлатежа = ПараметрыЗаполнения.ДатаЗаказа;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр, "ВариантОтсчета") Тогда
				НовСтр.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа;
			КонецЕсли;
		Иначе
			НовСтр.ДатаПлатежа = ?(ЗначениеЗаполнено(СтрокаОтгрузки.ДатаОтгрузки),СтрокаОтгрузки.ДатаОтгрузки,ПараметрыЗаполнения.ДатаОтгрузки);
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр, "ВариантОтсчета") Тогда
				Если ПараметрыЗаполнения.ЭтоПереходПраваСобственности2_5 Тогда
					НовСтр.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыПереходаПраваСобственности;
					НовСтр.ДатаПлатежа = ПараметрыЗаполнения.ДатаПереходаПраваСобственности;
				Иначе
					НовСтр.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НовСтр.СуммаПлатежа = СтрокаОтгрузки.СуммаПлатежа;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр, "СуммаЗалогаЗаТару") Тогда
			НовСтр.СуммаЗалогаЗаТару     = СтрокаОтгрузки.СуммаЗалогаЗаТару;
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр,"ДатаОтгрузки") Тогда
			НовСтр.ДатаОтгрузки = СтрокаОтгрузки.ДатаОтгрузки;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр, "СуммаВзаиморасчетов") Тогда
			НовСтр.СуммаВзаиморасчетов = СтрокаОтгрузки.СуммаВзаиморасчетов;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НовСтр, "СуммаВзаиморасчетовПоТаре") Тогда
			НовСтр.СуммаВзаиморасчетовПоТаре = СтрокаОтгрузки.СуммаВзаиморасчетовПоТаре;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет этапы графика оплаты в документе по переданному шаблону.
//
// Параметры:
// 		ЭтапыГрафикаОплаты - ТаблицаЗначений - таблица этапов оплаты.
// 		ПараметрыЗаполнения - см. ПараметрыЗаполненияЭтаповОплаты
//
Процедура ЗаполнитьЭтапыОплатыДокументаПоШаблону(ЭтапыГрафикаОплаты, ПараметрыЗаполнения) Экспорт
	
	РаспределеннаяСуммаОплаты = 0;
	РаспределеннаяСуммаЗалога = 0;
	ТекущийЭтап               = 0;
	
	ШаблонГрафика             = ПараметрыЗаполнения.ШаблонГрафика;
	Календарь                 = ПараметрыЗаполнения.Календарь;
	СуммаОплатыКРаспределению = ПараметрыЗаполнения.СуммаОплаты;
	СуммаЗалогаКРаспределению = ПараметрыЗаполнения.СуммаЗалогаЗаТару;
	
	ДатаЗаказа                     = ПараметрыЗаполнения.ДатаЗаказа;
	ДатаСогласования               = ПараметрыЗаполнения.ДатаСогласования;
	СрокПереходаПраваСобственности = ПараметрыЗаполнения.СрокПереходаПраваСобственности;
	
	ЕстьТара = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыГрафикаОплаты.Добавить(),"СуммаЗалогаЗаТару");
	ЕстьСуммаВзаиморасчетов = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыГрафикаОплаты.Добавить(),"СуммаВзаиморасчетов");
	ЭтапыГрафикаОплаты.Очистить();
	
	Если ВзаиморасчетыКлиентСервер.ЭтоТабличнаяЧасть(ЭтапыГрафикаОплаты) Тогда
		НовыеЭтапыГрафикаОплаты = ЭтапыГрафикаОплаты.Скопировать();
	Иначе
		НовыеЭтапыГрафикаОплаты = ЭтапыГрафикаОплаты.Выгрузить();
	КонецЕсли;
	
	// В накладных нет колонки "ДатаОтгрузки"
	Если НовыеЭтапыГрафикаОплаты.Колонки.Найти("ДатаОтгрузки") = Неопределено Тогда
		НовыеЭтапыГрафикаОплаты.Колонки.Добавить("ДатаОтгрузки");
	КонецЕсли;
	
	Если ПараметрыЗаполнения.ТабличнаяЧасть <> Неопределено Тогда
		ТаблицаОтгрузок = ПараметрыЗаполнения.ТабличнаяЧасть;
	Иначе
		ТаблицаОтгрузок = Новый ТаблицаЗначений();
		ТаблицаОтгрузок.Колонки.Добавить("ДатаОтгрузки");
		ТаблицаОтгрузок.Колонки.Добавить("ДатаПоступления");
		ТаблицаОтгрузок.Колонки.Добавить("СуммаПлатежа");
		ТаблицаОтгрузок.Колонки.Добавить("СуммаЗалогаЗаТару");
		НовСтр = ТаблицаОтгрузок.Добавить();
		НовСтр.ДатаОтгрузки = ПараметрыЗаполнения.ДатаОтгрузки;
		НовСтр.ДатаПоступления = ПараметрыЗаполнения.ДатаПоступления;
		НовСтр.СуммаПлатежа = ПараметрыЗаполнения.СуммаОплаты;
		НовСтр.СуммаЗалогаЗаТару = ПараметрыЗаполнения.СуммаЗалогаЗаТару;
	КонецЕсли;
	
	Если ТаблицаОтгрузок.Колонки.Найти("ДатаПоступления") = Неопределено Тогда
		ТаблицаОтгрузок.Колонки.Добавить("ДатаПоступления",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата))
	КонецЕсли;
	ТаблицаОтгрузок.Свернуть("ДатаОтгрузки,ДатаПоступления","СуммаПлатежа,СуммаЗалогаЗаТару");
	
	Если Не ЗначениеЗаполнено(ДатаСогласования) Тогда
		ДатаСогласования = ДатаЗаказа;
	КонецЕсли;
	
	КоличествоЭтапов = ШаблонГрафика.Количество();
	
	// Определим последний незалоговый этап
	ПоследнийНезалоговыйЭтап = КоличествоЭтапов;
	Пока ПоследнийНезалоговыйЭтап <> 0 И ШаблонГрафика[ПоследнийНезалоговыйЭтап-1].ПроцентПлатежа = 0 Цикл
		ПоследнийНезалоговыйЭтап = ПоследнийНезалоговыйЭтап - 1;
	КонецЦикла;
	
	// Определим последний залоговый этап
	ПоследнийЗалоговыйЭтап = КоличествоЭтапов;
	Пока ПоследнийЗалоговыйЭтап <> 0 И ШаблонГрафика[ПоследнийЗалоговыйЭтап-1].ПроцентЗалогаЗаТару = 0 Цикл
		ПоследнийЗалоговыйЭтап = ПоследнийЗалоговыйЭтап - 1;
	КонецЦикла;
	
	// Если накладная вводится по всей сумме заказа, то и суммы в этапах следует взять из закаказа.
	КопироватьСуммуПлатежа = Ложь;
	КопироватьСуммуЗалогаЗаТару = Ложь;
	Если КоличествоЭтапов > 0 И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ШаблонГрафика[0],"СуммаПлатежа") Тогда
		Если ШаблонГрафика.Итог("СуммаПлатежа") = СуммаОплатыКРаспределению Тогда
			КопироватьСуммуПлатежа = Истина;
		КонецЕсли;
		Если ШаблонГрафика.Итог("СуммаЗалогаЗаТару") = СуммаЗалогаКРаспределению Тогда
			КопироватьСуммуЗалогаЗаТару = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЭтоНакладнаяБезГрафика = НЕ ПараметрыЗаполнения.ЭтоЗаказ 
				И (НЕ ПараметрыЗаполнения.НакладнаяПоЗаказам ИЛИ ПараметрыЗаполнения.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным)
				И (НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.ГрафикИсполненияДоговора) ИЛИ ПараметрыЗаполнения.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным);
	
	// Заполним этапы в соответствии с графиком оплаты
	Для Каждого Этап Из ШаблонГрафика Цикл
		
		ТекущийЭтап                     = ТекущийЭтап + 1;
		
		Если НЕ (СуммаОплатыКРаспределению <> 0 И Этап.ПроцентПлатежа <> 0
					ИЛИ СуммаЗалогаКРаспределению <> 0 И Этап.ПроцентЗалогаЗаТару <> 0) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Этап, "Календарь") Тогда
			Календарь = Этап.Календарь;
		КонецЕсли;
		
		// Приведение варианта отсчета накладной без заказа к "до даты отгрузки" или "от даты отгрузки".
		Если ЭтоНакладнаяБезГрафика Тогда
			Если (Этап.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа 
				Или Этап.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыСогласования) Тогда
		
				Если Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитСдвиг
					ИЛИ Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.КредитСдвиг
					ИЛИ Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки
					ИЛИ Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления Тогда
					Этап.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки;
					Этап.Сдвиг          = 0;
				Иначе
					Этап.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ДоДатыОтгрузки;
					Этап.Сдвиг          = 0;
				КонецЕсли;
			КонецЕсли;
			
			Если Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения Тогда
				Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки;
			КонецЕсли;
			
			Если Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения Тогда
				Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЭтапыОплатыПовтИсп.СтрокаЭтаповЗависитОтДатыОтгрузки(Этап.ВариантОтсчета, Этап.Формула) Тогда
			ЭтапГрафикаОплаты                = НовыеЭтапыГрафикаОплаты.Добавить();
			ЭтапГрафикаОплаты.ВариантОплаты  = Этап.ВариантОплаты;
			ЭтапГрафикаОплаты.ВариантОтсчета = Этап.ВариантОтсчета;
			ЭтапГрафикаОплаты.Формула        = Этап.Формула;
			ЭтапГрафикаОплаты.Сдвиг          = Этап.Сдвиг;
			ЭтапГрафикаОплаты.ВариантОтсчета = Этап.ВариантОтсчета;
			
			СтруктураПараметров = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
			СтруктураПараметров.ВариантОтсчета                 = ЭтапГрафикаОплаты.ВариантОтсчета;
			СтруктураПараметров.Сдвиг                          = ЭтапГрафикаОплаты.Сдвиг;
			СтруктураПараметров.ДатаПлатежа                    = ?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Этап,"ДатаПлатежа"),
																	Этап.ДатаПлатежа,
																	Дата(1,1,1));
			СтруктураПараметров.ДатаЗаказа                     = ДатаЗаказа;
			СтруктураПараметров.ДатаСогласования               = ДатаСогласования;
			СтруктураПараметров.ДатаОтгрузки                   = Дата(1,1,1);
			СтруктураПараметров.ДатаПереходаПраваСобственности = Дата(1,1,1);
			СтруктураПараметров.СрокПереходаПраваСобственности = 0;
			СтруктураПараметров.Календарь                      = Календарь;
			СтруктураПараметров.Формула                        = ЭтапГрафикаОплаты.Формула;
			
			Если ЗначениеЗаполнено(Календарь)  Тогда
				ЭтапГрафикаОплаты.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(СтруктураПараметров);
			Иначе
				ЭтапГрафикаОплаты.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаБезКалендаря(СтруктураПараметров);
			КонецЕсли;
			
			Если КопироватьСуммуПлатежа Тогда 
				СуммаЭтапаОплаты                      = Этап.СуммаПлатежа;
			Иначе
				СуммаЭтапаОплаты                      = СуммаЭтапаОплаты(Этап, СуммаОплатыКРаспределению);
			КонецЕсли;
			ЭтапГрафикаОплаты.СуммаПлатежа        = ?(ТекущийЭтап = ПоследнийНезалоговыйЭтап, СуммаОплатыКРаспределению - РаспределеннаяСуммаОплаты, СуммаЭтапаОплаты);
			ЭтапГрафикаОплаты.ПроцентПлатежа      = ?(СуммаЭтапаОплаты <> 0, Этап.ПроцентПлатежа, 0);
			РаспределеннаяСуммаОплаты             = РаспределеннаяСуммаОплаты + ЭтапГрафикаОплаты.СуммаПлатежа;
			
			Если ЕстьТара Тогда
				
				Если КопироватьСуммуЗалогаЗаТару Тогда
					СуммаЭтапаЗалога                      = Этап.СуммаЗалогаЗаТару;
				Иначе
					СуммаЭтапаЗалога                      = СуммаЭтапаОплаты(Этап, СуммаЗалогаКРаспределению, Истина);
				КонецЕсли;
				
				ЭтапГрафикаОплаты.СуммаЗалогаЗаТару   = ?(ТекущийЭтап = ПоследнийЗалоговыйЭтап, СуммаЗалогаКРаспределению - РаспределеннаяСуммаЗалога, СуммаЭтапаЗалога);
				ЭтапГрафикаОплаты.ПроцентЗалогаЗаТару = ?(Этап.ПроцентЗалогаЗаТару > 0,Этап.ПроцентЗалогаЗаТару, 
					?(СуммаЗалогаКРаспределению<>0 И ЭтапГрафикаОплаты.СуммаЗалогаЗаТару <> 0,
					(Окр(ЭтапГрафикаОплаты.СуммаЗалогаЗаТару/СуммаЗалогаКРаспределению,2,РежимОкругления.Окр15как20))*100,
					0));
				РаспределеннаяСуммаЗалога             = РаспределеннаяСуммаЗалога + ЭтапГрафикаОплаты.СуммаЗалогаЗаТару;
			КонецЕсли;
		Иначе
			
			Если КопироватьСуммуПлатежа Тогда
				СуммаЭтапаОплатыКРаспределению = Этап.СуммаПлатежа;
			ИначеЕсли ТекущийЭтап = ПоследнийНезалоговыйЭтап Тогда
				СуммаЭтапаОплатыКРаспределению = СуммаОплатыКРаспределению - РаспределеннаяСуммаОплаты;
			Иначе
				СуммаЭтапаОплатыКРаспределению = СуммаЭтапаОплаты(Этап, СуммаОплатыКРаспределению)
			КонецЕсли;
			
			Если КопироватьСуммуЗалогаЗаТару Тогда
				СуммаЭтапаЗалогаКРаспределению = Этап.СуммаЗалогаЗаТару;
			ИначеЕсли ТекущийЭтап = ПоследнийЗалоговыйЭтап Тогда
				СуммаЭтапаЗалогаКРаспределению = СуммаЗалогаКРаспределению - РаспределеннаяСуммаЗалога;
			Иначе
				СуммаЭтапаЗалогаКРаспределению = СуммаЭтапаОплаты(Этап, СуммаЗалогаКРаспределению, Истина);
			КонецЕсли;
			
			РаспределеннаяСуммаОплатыЭтапа = 0;
			РаспределеннаяСуммаЗалогаЭтапа = 0;
			Для Каждого СтрокаДатыОтгрузки Из ТаблицаОтгрузок Цикл
				
				СтруктураПараметров = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
				Если Этап.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыПереходаПраваСобственности
					И НЕ ПараметрыЗаполнения.ЕстьДатаПереходаПраваСобственности
					ИЛИ НЕ ЗначениеЗаполнено(Этап.ВариантОтсчета) Тогда
					СтруктураПараметров.ВариантОтсчета                 = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки;
				Иначе
					СтруктураПараметров.ВариантОтсчета                 = Этап.ВариантОтсчета;
				КонецЕсли;
				СтруктураПараметров.Сдвиг                          = Этап.Сдвиг;
				СтруктураПараметров.ДатаЗаказа                     = ДатаЗаказа;
				СтруктураПараметров.ДатаСогласования               = ДатаСогласования;
				СтруктураПараметров.ДатаОтгрузки                   = СтрокаДатыОтгрузки.ДатаОтгрузки;
				СтруктураПараметров.ДатаПоступления                = СтрокаДатыОтгрузки.ДатаПоступления;
				СтруктураПараметров.ДатаПереходаПраваСобственности = ПараметрыЗаполнения.ДатаПереходаПраваСобственности;
				СтруктураПараметров.СрокПереходаПраваСобственности = СрокПереходаПраваСобственности;
				СтруктураПараметров.Календарь                      = Календарь;
				СтруктураПараметров.Формула                        = Этап.Формула;
				
				Если ЗначениеЗаполнено(Календарь)  Тогда
					ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(СтруктураПараметров);
				Иначе
					ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаБезКалендаря(СтруктураПараметров);
				КонецЕсли;
				
				// При вариантах контроля до отгрузки дата платежа не может быть больше даты отгрузки
				Если (Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения
						Или Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления
						Или Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения
						Или Этап.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки)
					И ЗначениеЗаполнено(СтрокаДатыОтгрузки.ДатаОтгрузки)
					И ДатаПлатежа > СтрокаДатыОтгрузки.ДатаОтгрузки Тогда
					ДатаПлатежа = СтрокаДатыОтгрузки.ДатаОтгрузки;
				КонецЕсли;
				
				ЭтапГрафикаОплаты               = НовыеЭтапыГрафикаОплаты.Добавить();
				ЭтапГрафикаОплаты.ВариантОплаты = Этап.ВариантОплаты;
				ЭтапГрафикаОплаты.Сдвиг         = Этап.Сдвиг;
				ЭтапГрафикаОплаты.ВариантОтсчета = СтруктураПараметров.ВариантОтсчета;
				ЭтапГрафикаОплаты.Формула       = СтруктураПараметров.Формула;
				ЭтапГрафикаОплаты.ДатаПлатежа   = ДатаПлатежа;
				ЭтапГрафикаОплаты.ДатаОтгрузки  = СтрокаДатыОтгрузки.ДатаОтгрузки;
				
				ЭтапГрафикаОплаты.СуммаПлатежа        = ?(СтрокаДатыОтгрузки = ТаблицаОтгрузок[ТаблицаОтгрузок.Количество()-1] ИЛИ СуммаЭтапаОплатыКРаспределению = 0,
															СуммаЭтапаОплатыКРаспределению - РаспределеннаяСуммаОплатыЭтапа,
															СуммаЭтапаОплатыКРаспределению * (СтрокаДатыОтгрузки.СуммаПлатежа/СуммаОплатыКРаспределению));
				РаспределеннаяСуммаОплатыЭтапа         = РаспределеннаяСуммаОплатыЭтапа + ЭтапГрафикаОплаты.СуммаПлатежа;
				РаспределеннаяСуммаОплаты              = РаспределеннаяСуммаОплаты + ЭтапГрафикаОплаты.СуммаПлатежа;
				
				Если ЕстьТара Тогда
					ЭтапГрафикаОплаты.СуммаЗалогаЗаТару   = ?(СтрокаДатыОтгрузки = ТаблицаОтгрузок[ТаблицаОтгрузок.Количество()-1] ИЛИ СуммаЭтапаЗалогаКРаспределению = 0,
															СуммаЭтапаЗалогаКРаспределению-РаспределеннаяСуммаЗалогаЭтапа,
															СуммаЭтапаЗалогаКРаспределению * (СтрокаДатыОтгрузки.СуммаЗалогаЗаТару/СуммаЗалогаКРаспределению));
					РаспределеннаяСуммаЗалогаЭтапа        = РаспределеннаяСуммаЗалогаЭтапа + ЭтапГрафикаОплаты.СуммаЗалогаЗаТару;
					РаспределеннаяСуммаЗалога             = РаспределеннаяСуммаЗалога + ЭтапГрафикаОплаты.СуммаЗалогаЗаТару;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьСуммаВзаиморасчетов Тогда
		
		ПоследнийНезалоговыйЭтап = 0;
		ПоследнийЗалоговыйЭтап = 0;
		Для Каждого Стр Из НовыеЭтапыГрафикаОплаты Цикл
			Если Стр.СуммаПлатежа <> 0 Тогда
				ПоследнийНезалоговыйЭтап = Стр;
			КонецЕсли;
			Если ЕстьТара И Стр.СуммаЗалогаЗаТару <> 0 Тогда
				ПоследнийЗалоговыйЭтап = Стр;
			КонецЕсли;
		КонецЦикла;
		
		СуммаВзаиморасчетовКРаспределению = ПараметрыЗаполнения.СуммаВзаиморасчетов;
		СуммаВзаиморасчетовПоТареКРаспределению = ПараметрыЗаполнения.СуммаВзаиморасчетовПоТаре;
		Для Каждого Стр Из НовыеЭтапыГрафикаОплаты Цикл
			
			Если Стр <> ПоследнийНезалоговыйЭтап И ПараметрыЗаполнения.СуммаОплаты <> 0 Тогда
				Стр.СуммаВзаиморасчетов = Стр.СуммаПлатежа/ПараметрыЗаполнения.СуммаОплаты * ПараметрыЗаполнения.СуммаВзаиморасчетов
			Иначе
				Стр.СуммаВзаиморасчетов = СуммаВзаиморасчетовКРаспределению;
			КонецЕсли;
			СуммаВзаиморасчетовКРаспределению = СуммаВзаиморасчетовКРаспределению - Стр.СуммаВзаиморасчетов;
			
			Если ЕстьТара Тогда
				Если Стр <> ПоследнийЗалоговыйЭтап И ПараметрыЗаполнения.СуммаЗалогаЗаТару <> 0 Тогда
					Стр.СуммаВзаиморасчетовПоТаре = Стр.СуммаЗалогаЗаТару/ПараметрыЗаполнения.СуммаЗалогаЗаТару * ПараметрыЗаполнения.СуммаВзаиморасчетовПоТаре
				Иначе
					Стр.СуммаВзаиморасчетовПоТаре = СуммаВзаиморасчетовПоТареКРаспределению;
				КонецЕсли;
				СуммаВзаиморасчетовПоТареКРаспределению = СуммаВзаиморасчетовПоТареКРаспределению - Стр.СуммаВзаиморасчетовПоТаре;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	КолонкиИзмерений = "ВариантОплаты, ДатаПлатежа, Сдвиг, ВариантОтсчета, Формула, ДатаОтгрузки";
	КолонкиРесурсов = "СуммаПлатежа,ПроцентПлатежа"
	 + ?(ЕстьТара,",СуммаЗалогаЗаТару,ПроцентЗалогаЗаТару","")
	 + ?(ЕстьСуммаВзаиморасчетов,",СуммаВзаиморасчетов","")
	 + ?(ЕстьСуммаВзаиморасчетов И ЕстьТара,",СуммаВзаиморасчетовПоТаре","");
	НовыеЭтапыГрафикаОплаты.Свернуть(КолонкиИзмерений, КолонкиРесурсов);
	
	ЭтапыОплатыКлиентСервер.СортироватьТаблицуЭтапов(НовыеЭтапыГрафикаОплаты);
	ЗаполнитьПроцентыПоСуммам(НовыеЭтапыГрафикаОплаты);
	
	Для Каждого Стр Из НовыеЭтапыГрафикаОплаты Цикл
		ЗаполнитьЗначенияСвойств(ЭтапыГрафикаОплаты.Добавить(),Стр);
	КонецЦикла;
	
	Если ПараметрыЗаполнения.ЭтоРасчетыСклиентами И ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюСхемуОплатыВПродажах")
		ИЛИ НЕ ПараметрыЗаполнения.ЭтоРасчетыСКлиентами И ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюСхемуОплатыВЗакупках") Тогда
		ПреобразоватьТаблицуЭтаповВДанныеУпрощенногоРежима(ЭтапыГрафикаОплаты, 
			ПараметрыЗаполнения.ДатаОтгрузки, 
			НЕ ПараметрыЗаполнения.НетКонтроляПредоплаты, 
			ПараметрыЗаполнения.Календарь);
	КонецЕсли;
	
КонецПроцедуры

// Параметры проверки корректности заполнения этапов.
// 
// Возвращаемое значение:
//  Структура - Параметры проверки корректности заполнения этапов:
// * Дата                             - Дата - Дата документа.
// * Валюта                           - СправочникСсылка.Валюты - Валюта оплаты.
// * ЭтоЗаказ                         - Булево,Неопределено - Это заказ.
// * НакладнаяИсточникГрафика         - Булево,Неопределено - Это накладная на основании заказа.
// * НадписьЭтапыОплаты               - Строка - Путь к реквизиту формы "НадписьЭтапыОплаты", если есть.
// * СуммаОплатыПоДокументу           - Число - сумма документа, в котором необходимо осуществить проверку
// * СуммаЗалогаПоДокументу           - Число - сумма залога по документу, в котором необходимо осуществить проверку
//
Функция ПараметрыПроверкиКорректностиЗаполненияЭтапов() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", Дата(1,1,1));
	СтруктураПараметров.Вставить("Валюта", Справочники.Валюты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ЭтоЗаказ", Неопределено);
	СтруктураПараметров.Вставить("НакладнаяИсточникГрафика", Неопределено);
	СтруктураПараметров.Вставить("НадписьЭтапыОплаты",  "");
	СтруктураПараметров.Вставить("СуммаОплатыПоДокументу", 0);
	СтруктураПараметров.Вставить("СуммаЗалогаПоДокументу", 0);
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Проверяет корректность заполнения этапов графика оплаты в документе
//
// Параметры:
// ЭтапыГрафикаОплаты               - ТаблицаЗначений - Таблица этапов оплаты для проверки.
// Отказ                            - Булево - Флаг отказа от записи документа
// СтруктураПараметров              - см. ПараметрыПроверкиКорректностиЗаполненияЭтапов
// УпрощенныйРежимДиалога           - Булево - флаг, указывающий на использование простого диалога ввода этапов оплаты.
// ПривязыватьСообщенияКГиперссылке - Булево - флаг, говорящий о том что проверка происходит на форме и сообщения надо привязывать к надписи графика этапов оплаты.
//
Процедура ПроверитьКорректностьЭтаповГрафикаОплаты(Знач ЭтапыГрафикаОплаты,
	                                               Отказ,
	                                               СтруктураПараметров,
	                                               УпрощенныйРежимДиалога = Истина,
	                                               ПривязыватьСообщенияКГиперссылке = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Дата) Тогда
		ДатаДокумента = НачалоДня(СтруктураПараметров.Дата);
	КонецЕсли;
	
	СуммаОплатыВсего = Окр(СтруктураПараметров.СуммаОплатыПоДокументу, 2);
	СуммаЗалогаВсего = Окр(СтруктураПараметров.СуммаЗалогаПоДокументу, 2);
	
	Если ПривязыватьСообщенияКГиперссылке И ЗначениеЗаполнено(СтруктураПараметров.НадписьЭтапыОплаты) Тогда
		НадписьЭтапыОплаты = СтрЗаменить(СтруктураПараметров.НадписьЭтапыОплаты,"Форма.","");
	Иначе
		НадписьЭтапыОплаты = "";
	КонецЕсли;
	
	СообщенияПользователю = Новый Соответствие;
	
	Если ЭтапыГрафикаОплаты.Количество() = 0 Тогда
		
		Если СуммаОплатыВсего <> 0 Или СуммаЗалогаВсего <> 0 Тогда
			
			Если УпрощенныйРежимДиалога Тогда
				ТекстОшибки = НСтр("ru = 'Необходимо заполнить хотя бы один из этапов оплаты'");
				ПолеОшибки  = "ПроцентПлатежаКредит";
			Иначе
				ТекстОшибки = НСтр("ru = 'Необходимо заполнить этапы графика оплаты'");
				ПолеОшибки  = "ЭтапыГрафикаОплаты";
			КонецЕсли;
			
			Если ПривязыватьСообщенияКГиперссылке Тогда
				ПолеОшибки = НадписьЭтапыОплаты;
			КонецЕсли;
			
			Отказ = Истина;
			СообщенияПользователю.Вставить(ТекстОшибки, ПолеОшибки);
			
		КонецЕсли;
		
	Иначе
		
		УчитыватьВариантОплаты = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыГрафикаОплаты[0],"ВариантОплаты");
		
		ИтогПроцентПлатежа = 0;
		ИтогПроцентЗалогаЗаТару = 0;
		ИтогСуммаПлатежа = 0;
		ИтогСуммаЗалогаЗаТару = 0;
		ИтогСуммаОтклонения = 0;
		Для ТекИндекс = 0 По ЭтапыГрафикаОплаты.Количество()-1 Цикл
			
			ДанныеЭтапа = Новый Структура();
			ДанныеЭтапа.Вставить("НомерСтроки",                  0);
			ДанныеЭтапа.Вставить("ВариантОплаты",     Неопределено);
			ДанныеЭтапа.Вставить("ДатаПлатежа",         '00010101');
			ДанныеЭтапа.Вставить("ПроцентПлатежа",               0);
			ДанныеЭтапа.Вставить("ПроцентЗалогаЗаТару",          0);
			ДанныеЭтапа.Вставить("СуммаПлатежа",                 0);
			ДанныеЭтапа.Вставить("СуммаЗалогаЗаТару",            0);
			ДанныеЭтапа.Вставить("СуммаОтклоненияМерныхТоваров", 0);
			ДанныеЭтапа.Вставить("ВариантОтсчета",    Неопределено);
			ДанныеЭтапа.Вставить("Формула",           Неопределено);
			ДанныеЭтапа.Вставить("ДатаОтгрузки",         '00010101');
			
			ЗаполнитьЗначенияСвойств(ДанныеЭтапа, ЭтапыГрафикаОплаты[ТекИндекс]);
			ИтогПроцентПлатежа = ИтогПроцентПлатежа + ДанныеЭтапа.ПроцентПлатежа;
			ИтогПроцентЗалогаЗаТару = ИтогПроцентЗалогаЗаТару + ДанныеЭтапа.ПроцентЗалогаЗаТару;
			ИтогСуммаПлатежа = ИтогСуммаПлатежа + ДанныеЭтапа.СуммаПлатежа;
			ИтогСуммаЗалогаЗаТару = ИтогСуммаЗалогаЗаТару + ДанныеЭтапа.СуммаЗалогаЗаТару;
			ИтогСуммаОтклонения = ИтогСуммаОтклонения + ДанныеЭтапа.СуммаОтклоненияМерныхТоваров;
			
			АдресОшибки = НСтр("ru = 'в строке %НомерСтроки% списка ""Этапы графика оплаты""'");
			АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", ДанныеЭтапа.НомерСтроки);
			
			// Все реквизиты этапа оплаты должны быть заполнены
			
			Если Не ЗначениеЗаполнено(ДанныеЭтапа.ВариантОплаты) И УчитыватьВариантОплаты Тогда
				
				ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Вариант оплаты""'");
				
				Если ПривязыватьСообщенияКГиперссылке Тогда
					ПолеОшибки = НадписьЭтапыОплаты;
				Иначе
					ПолеОшибки = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ЭтапыГрафикаОплаты", ДанныеЭтапа.НомерСтроки, "ВариантОплаты");
				КонецЕсли;
				
				Отказ = Истина;
				СообщенияПользователю.Вставить(ТекстОшибки + " " + АдресОшибки, ПолеОшибки);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДанныеЭтапа.ВариантОтсчета) И УчитыватьВариантОплаты Тогда
				
				Если УпрощенныйРежимДиалога Тогда
					Если ДанныеЭтапа.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.КредитСдвиг
						Или ДанныеЭтапа.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитСдвиг Тогда
						ТекстОшибки = НСтр("ru = 'Не заполнен ""Вариант отсчета"" по постоплате'");
						ПолеОшибки  = "ВариантОтсчетаНеКонтролируемый";
					Иначе
						ТекстОшибки = НСтр("ru = 'Не заполнен ""Вариант отсчета"" по предоплате'");
						ПолеОшибки  = "ВариантОтсчетаКонтролируемый";
					КонецЕсли;
				Иначе
					ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Вариант отсчета""'");
					
					Если ПривязыватьСообщенияКГиперссылке Тогда
						ПолеОшибки = НадписьЭтапыОплаты;
					Иначе
						ПолеОшибки = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ЭтапыГрафикаОплаты", ДанныеЭтапа.НомерСтроки, "ВариантОтсчета");
					КонецЕсли;
					
				КонецЕсли;
				
				Отказ = Истина;
				СообщенияПользователю.Вставить(ТекстОшибки + " " + АдресОшибки, ПолеОшибки);
				
			КонецЕсли;
			
			Если ДанныеЭтапа.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.Формула
				И Не ЗначениеЗаполнено(ДанныеЭтапа.Формула) Тогда
				
				ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Формула""'");
					
				Если ПривязыватьСообщенияКГиперссылке Тогда
					ПолеОшибки = НадписьЭтапыОплаты;
				Иначе
					ПолеОшибки = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ЭтапыГрафикаОплаты", ДанныеЭтапа.НомерСтроки, "ВариантОтсчета");
				КонецЕсли;
				
				Отказ = Истина;
				СообщенияПользователю.Вставить(ТекстОшибки, ПолеОшибки);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДанныеЭтапа.ДатаПлатежа) Тогда
				
				Если УпрощенныйРежимДиалога Тогда
					Если ДанныеЭтапа.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.КредитСдвиг
						Или ДанныеЭтапа.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитСдвиг Тогда
						ТекстОшибки = НСтр("ru = 'Не заполнена ""Дата платежа"" по постоплате'");
						ПолеОшибки  = "ДатаКредит";
					Иначе
						ТекстОшибки = НСтр("ru = 'Не заполнена ""Дата платежа"" по предоплате'");
						ПолеОшибки  = "ДатаПредоплата";
					КонецЕсли;
				Иначе
					ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Дата платежа""'");
					ПолеОшибки  = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ЭтапыГрафикаОплаты", ДанныеЭтапа.НомерСтроки, "ДатаПлатежа");
				КонецЕсли;
				
				Если ПривязыватьСообщенияКГиперссылке Тогда
					ПолеОшибки = НадписьЭтапыОплаты;
				КонецЕсли;
				
				Отказ = Истина;
				СообщенияПользователю.Вставить(ТекстОшибки, ПолеОшибки);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДанныеЭтапа.ПроцентПлатежа)
				И Не ЗначениеЗаполнено(ДанныеЭтапа.ПроцентЗалогаЗаТару)
				И СуммаЗалогаВсего + СуммаОплатыВсего > 0
				И ((ДанныеЭтапа.СуммаПлатежа + ДанныеЭтапа.СуммаЗалогаЗаТару) / (СуммаЗалогаВсего+СуммаОплатыВсего) >= 0.0001
					Или ДанныеЭтапа.СуммаПлатежа + ДанныеЭтапа.СуммаЗалогаЗаТару = 0) Тогда
				
				ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Процент платежа""'");
				
				Если ПривязыватьСообщенияКГиперссылке Тогда
					ПолеОшибки = НадписьЭтапыОплаты;
				Иначе
					ПолеОшибки = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ЭтапыГрафикаОплаты", ДанныеЭтапа.НомерСтроки, "ПроцентПлатежа");
				КонецЕсли;
				
				Отказ = Истина;
				СообщенияПользователю.Вставить(ТекстОшибки + " " + АдресОшибки, ПолеОшибки);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДанныеЭтапа.СуммаПлатежа)
				И ЗначениеЗаполнено(ДанныеЭтапа.ПроцентПлатежа)
				И СуммаОплатыВсего <> 0 Тогда
				
				ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Сумма платежа""'");
				
				Если ПривязыватьСообщенияКГиперссылке Тогда
					ПолеОшибки = НадписьЭтапыОплаты;
				Иначе
					ПолеОшибки = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ЭтапыГрафикаОплаты", ДанныеЭтапа.НомерСтроки, "СуммаПлатежа");
				КонецЕсли;
				
				Отказ = Истина;
				СообщенияПользователю.Вставить(ТекстОшибки + " " + АдресОшибки, ПолеОшибки);
				
			КонецЕсли;
				
			Если Не ЗначениеЗаполнено(ДанныеЭтапа.СуммаЗалогаЗаТару)
				И ЗначениеЗаполнено(ДанныеЭтапа.ПроцентЗалогаЗаТару) 
				И СуммаЗалогаВсего > 0 Тогда
				
				ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Сумма залога за тару""'");
				
				Если ПривязыватьСообщенияКГиперссылке Тогда
					ПолеОшибки = НадписьЭтапыОплаты;
				Иначе
					ПолеОшибки = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ЭтапыГрафикаОплаты", ДанныеЭтапа.НомерСтроки, "СуммаЗалогаЗаТару");
				КонецЕсли;
				
				Отказ = Истина;
				СообщенияПользователю.Вставить(ТекстОшибки + " " + АдресОшибки, ПолеОшибки);
				
			КонецЕсли;
			
			// Дата платежа в тч ЭтапыГрафикаОплаты должна быть не меньше даты документа
			Если ЗначениеЗаполнено(ДанныеЭтапа.ДатаПлатежа) 
				И ЗначениеЗаполнено(СтруктураПараметров.Дата) 
				И ДанныеЭтапа.ДатаПлатежа < ДатаДокумента
				И (СтруктураПараметров.ЭтоЗаказ
					Или СтруктураПараметров.НакладнаяИсточникГрафика) Тогда
				
				Если УпрощенныйРежимДиалога Тогда
					Если ДанныеЭтапа.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.КредитСдвиг
						Или ДанныеЭтапа.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитСдвиг Тогда
						ПолеОшибки = "ДатаКредит";
					Иначе
						ПолеОшибки = "ДатаПредоплата";
					КонецЕсли;
				Иначе
					ПолеОшибки = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ЭтапыГрафикаОплаты", ДанныеЭтапа.НомерСтроки, "ДатаПлатежа");
				КонецЕсли;
				
				Если ПривязыватьСообщенияКГиперссылке Тогда
					ПолеОшибки = НадписьЭтапыОплаты;
				КонецЕсли;
				
				ТекстОшибки = НСтр("ru = 'Дата платежа должна быть не меньше даты документа %ДатаДокумента%'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки,"%ДатаДокумента%", Формат(СтруктураПараметров.Дата, "ДЛФ=DD"));
				
				Отказ = Истина;
				СообщенияПользователю.Вставить(ТекстОшибки, ПолеОшибки);
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Процент платежей в в тч ЭтапыГрафикаОплаты должен равняться 100%
		
		Если ЭтапыГрафикаОплаты.Количество() > 0 Тогда
			
			Если ИтогПроцентПлатежа <> 100 И СуммаОплатыВсего - СуммаЗалогаВсего > 0 Тогда
				
				ТекстОшибки = НСтр("ru = 'Процент платежей по всем этапам ""%ПроцентПоЭтапам%%"" должен равняться ""100%""'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ПроцентПоЭтапам%", ИтогПроцентПлатежа);
				
				Если ПривязыватьСообщенияКГиперссылке Тогда
					ПолеОшибки = НадписьЭтапыОплаты;
				Иначе
					ПолеОшибки = ?(УпрощенныйРежимДиалога, "ПроцентПлатежаКредит", "ЭтапыГрафикаОплаты[0].ПроцентПлатежа");
				КонецЕсли;
				
				Отказ = Истина;
				СообщенияПользователю.Вставить(ТекстОшибки, ПолеОшибки);
				
			КонецЕсли;
				
			Если ИтогСуммаЗалогаЗаТару + ИтогСуммаОтклонения -(СуммаОплатыВсего - ИтогСуммаПлатежа) 
				<> СуммаЗалогаВсего И СуммаЗалогаВсего <> 0 Тогда
				
				ТекстОшибки = НСтр("ru = 'Процент залога за тару по всем этапам ""%ПроцентПоЭтапам%%"" должен равняться ""100%""'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ПроцентПоЭтапам%", ИтогПроцентЗалогаЗаТару);
				
				Если ПривязыватьСообщенияКГиперссылке Тогда
					ПолеОшибки = НадписьЭтапыОплаты;
				Иначе
					ПолеОшибки = ?(УпрощенныйРежимДиалога, "ПроцентЗалогаЗаТаруКредит", "ЭтапыГрафикаОплаты[0].ПроцентЗалогаЗаТару");
				КонецЕсли;
				
				Отказ = Истина;
				СообщенияПользователю.Вставить(ТекстОшибки, ПолеОшибки);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Сумма платежей в в тч ЭтапыГрафикаОплаты должна равняться сумме заказа с учетом отмененных позиций.
		
		Если ЭтапыГрафикаОплаты.Количество() > 0 Тогда
			
			Если СуммаОплатыВсего <> 0 И ИтогСуммаПлатежа + ИтогСуммаОтклонения <> СуммаОплатыВсего Тогда
				
				ТекстОшибки = НСтр("ru = 'Сумма платежей по всем этапам ""%СуммаПоЭтапам% %Валюта%"" не должна отличаться от суммы документа ""%СуммаВсего% %Валюта%""'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%СуммаПоЭтапам%", ИтогСуммаПлатежа);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%СуммаВсего%",    СуммаОплатыВсего - СуммаЗалогаВсего);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Валюта%",        СтруктураПараметров.Валюта);
				
				Если УпрощенныйРежимДиалога Тогда
					Если ЭтапыГрафикаОплаты[0].ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления Тогда
						ПолеОшибки = "СуммаПлатежаПредоплата";
					Иначе
						ПолеОшибки = "СуммаПлатежаКредит";
					КонецЕсли;
				Иначе
					ПолеОшибки = "ЭтапыГрафикаОплаты[0].СуммаПлатежа";
				КонецЕсли;
				
				Отказ = Истина;
				СообщенияПользователю.Вставить(ТекстОшибки, ПолеОшибки);
				
			КонецЕсли;
			
			Если СуммаЗалогаВсего <> 0 И ИтогСуммаЗалогаЗаТару <> СуммаЗалогаВсего Тогда
				
				ТекстОшибки = НСтр("ru = 'Сумма залога за тару по всем этапам ""%СуммаПоЭтапам% %Валюта%"" не должна отличаться от суммы залога по документу ""%СуммаВсего% %Валюта%""'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%СуммаПоЭтапам%", ИтогСуммаЗалогаЗаТару);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%СуммаВсего%",    СуммаЗалогаВсего);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Валюта%",        СтруктураПараметров.Валюта);
				
				Если УпрощенныйРежимДиалога Тогда
					Если ЭтапыГрафикаОплаты[0].ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления Тогда
						ПолеОшибки = "СуммаЗалогаЗаТаруПредоплата";
					Иначе
						ПолеОшибки = "СуммаЗалогаЗаТаруКредит";
					КонецЕсли;
				Иначе
					ПолеОшибки = "ЭтапыГрафикаОплаты[0].СуммаЗалогаЗаТару";
				КонецЕсли;
				
				Если ПривязыватьСообщенияКГиперссылке Тогда
					ПолеОшибки = НадписьЭтапыОплаты;
				КонецЕсли;
				
				Отказ = Истина;
				СообщенияПользователю.Вставить(ТекстОшибки, ПолеОшибки);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ЭлементСоответствия Из СообщенияПользователю Цикл
		
		ОбщегоНазначения.СообщитьПользователю(
			ЭлементСоответствия.Ключ,,
			ЭлементСоответствия.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

// Данные упрощенного режима.
// 
// Параметры:
//  ЭтапыОплаты - ТаблицаЗначений - Этапы оплаты:
// * ДатаОтгрузки - Дата
//  ДатаОтгрузки - Дата - Дата отгрузки
//  ЕстьПредоплата - Булево - Есть предоплата
//  Календарь - СправочникСсылка.ПроизводственныеКалендари - Календарь
// 
// Возвращаемое значение:
//  Структура - Данные упрощенного режима:
// * СуммаПлатежаКредит - Число - 
// * ПроцентПлатежаКредит - Число - 
// * СуммаЗалогаЗаТаруКредит - Число - 
// * ПроцентЗалогаЗаТаруКредит - Число - 
// * ДатаКредит - Дата - 
// * ВариантОтсчетаКредит - ПеречислениеСсылка.ВариантыОтсчетаДатыПлатежа
// * ВариантКонтроляКредит - ПеречислениеСсылка.ВариантыКонтроляОплатыКлиентом,ПеречислениеСсылка.ВариантыКонтроляОплатыПоставщику
// * СдвигКредит - Число - 
// * СуммаВзаиморасчетовКредит - Число - 
// * СуммаВзаиморасчетовПоТареКредит - Число - 
// * ДатаОтгрузкиКредит - Дата - 
// * СуммаПлатежаПредоплата - Число - 
// * ПроцентПлатежаПредоплата - Число - 
// * СуммаЗалогаЗаТаруПредоплата - Число - 
// * ПроцентЗалогаЗаТаруПредоплата - Число - 
// * ДатаПредоплата - Дата - 
// * ВариантОтсчетаПредоплата - ПеречислениеСсылка.ВариантыОтсчетаДатыПлатежа
// * ВариантКонтроляПредоплата - ПеречислениеСсылка.ВариантыКонтроляОплатыКлиентом,ПеречислениеСсылка.ВариантыКонтроляОплатыПоставщику
// * СдвигПредоплата - Число - 
// * СуммаВзаиморасчетовПредоплата - Число - 
// * СуммаВзаиморасчетовПоТареПредоплата - Число - 
// * ДатаОтгрузкиПредоплата - Дата - 
// * СуммаОтклоненияМерныхТоваров - Число - 
Функция ДанныеУпрощенногоРежима(ЭтапыОплаты, ДатаОтгрузки, ЕстьПредоплата, Календарь) Экспорт
	
	ЕстьТара = ЭтапыОплаты.Количество() > 0 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыОплаты[0],"СуммаЗалогаЗаТару");
	ЕстьСуммаВзаиморасчетов = ЭтапыОплаты.Количество() > 0
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыОплаты[0],"СуммаВзаиморасчетов");
	ЕстьДатыОтгрузки = ЭтапыОплаты.Количество() > 0 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыОплаты[0],"ДатаОтгрузки");
	ЕстьСуммаОтклоненияМерныхТоваров = ЭтапыОплаты.Количество() > 0 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыОплаты[0],"СуммаОтклоненияМерныхТоваров");
		
	Результат = Новый Структура();
	Результат.Вставить("СуммаПлатежаКредит",0);
	Результат.Вставить("ПроцентПлатежаКредит",0);
	Результат.Вставить("СуммаЗалогаЗаТаруКредит",0);
	Результат.Вставить("ПроцентЗалогаЗаТаруКредит",0);
	Результат.Вставить("ДатаКредит",Дата(1,1,1));
	Результат.Вставить("ВариантОтсчетаКредит",Перечисления.ВариантыОтсчетаДатыПлатежа.ПустаяСсылка());
	Результат.Вставить("ВариантКонтроляКредит",Перечисления.ВариантыКонтроляОплатыКлиентом.ПустаяСсылка());
	Результат.Вставить("СдвигКредит",0);
	Результат.Вставить("СуммаВзаиморасчетовКредит",0);
	Результат.Вставить("СуммаВзаиморасчетовПоТареКредит",0);
	Результат.Вставить("ДатаОтгрузкиКредит",Дата(1,1,1));
	
	Результат.Вставить("СуммаПлатежаПредоплата",0);
	Результат.Вставить("ПроцентПлатежаПредоплата",0);
	Результат.Вставить("СуммаЗалогаЗаТаруПредоплата",0);
	Результат.Вставить("ПроцентЗалогаЗаТаруПредоплата",0);
	Результат.Вставить("ДатаПредоплата",Дата(1,1,1));
	Результат.Вставить("ВариантОтсчетаПредоплата",Перечисления.ВариантыОтсчетаДатыПлатежа.ПустаяСсылка());
	Результат.Вставить("ВариантКонтроляПредоплата",Перечисления.ВариантыКонтроляОплатыКлиентом.ПустаяСсылка());
	Результат.Вставить("СдвигПредоплата",0);
	Результат.Вставить("СуммаВзаиморасчетовПредоплата",0);
	Результат.Вставить("СуммаВзаиморасчетовПоТареПредоплата",0);
	Результат.Вставить("ДатаОтгрузкиПредоплата",Дата(1,1,1));
	
	Результат.Вставить("СуммаОтклоненияМерныхТоваров",0);
	
	Если ЭтапыОплаты.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ЭтапыОплаты Цикл
		
		Если ТекСтрока.ВариантОплаты <> Перечисления.ВариантыКонтроляОплатыКлиентом.КредитСдвиг
			И ТекСтрока.ВариантОплаты <> Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки
			И ТекСтрока.ВариантОплаты <> Перечисления.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления
			И ТекСтрока.ВариантОплаты <> Перечисления.ВариантыКонтроляОплатыПоставщику.КредитСдвиг
			И ЕстьПредоплата Тогда //аванс и предоплата суммируются в общую сумму
			Результат.СуммаПлатежаПредоплата = Результат.СуммаПлатежаПредоплата + ТекСтрока.СуммаПлатежа;
			Результат.ПроцентПлатежаПредоплата = Результат.ПроцентПлатежаПредоплата + ТекСтрока.ПроцентПлатежа;
			
			Если ЕстьТара Тогда
				Результат.СуммаЗалогаЗаТаруПредоплата   = Результат.СуммаЗалогаЗаТаруПредоплата + ТекСтрока.СуммаЗалогаЗаТару;
				Результат.ПроцентЗалогаЗаТаруПредоплата = Результат.ПроцентЗалогаЗаТаруПредоплата + ТекСтрока.ПроцентЗалогаЗаТару;
			КонецЕсли;
			
			Если ЕстьСуммаВзаиморасчетов Тогда
				Результат.СуммаВзаиморасчетовПредоплата = Результат.СуммаВзаиморасчетовПредоплата + ТекСтрока.СуммаВзаиморасчетов;
				Если ЕстьТара Тогда
					Результат.СуммаВзаиморасчетовПоТареПредоплата = Результат.СуммаВзаиморасчетовПоТареПредоплата + ТекСтрока.СуммаВзаиморасчетовПоТаре;
				КонецЕсли;
			КонецЕсли;
			
			Если Результат.ДатаПредоплата <= ТекСтрока.ДатаПлатежа Тогда
				Результат.ДатаПредоплата = Макс(Результат.ДатаПредоплата, ТекСтрока.ДатаПлатежа);
				Результат.СдвигПредоплата = ТекСтрока.Сдвиг;
				Если ЕстьДатыОтгрузки Тогда
					Результат.ДатаОтгрузкиПредоплата = Макс(Результат.ДатаОтгрузкиПредоплата, ТекСтрока.ДатаОтгрузки);
				КонецЕсли;
				Если ТекСтрока.ВариантОтсчета <> Перечисления.ВариантыОтсчетаДатыПлатежа.Формула Тогда
					Результат.ВариантОтсчетаПредоплата = ТекСтрока.ВариантОтсчета;
				КонецЕсли;
				Результат.ВариантКонтроляПредоплата = ТекСтрока.ВариантОплаты;
			КонецЕсли;
		Иначе
			Результат.СуммаПлатежаКредит   = Результат.СуммаПлатежаКредит + ТекСтрока.СуммаПлатежа;
			Результат.ПроцентПлатежаКредит = Результат.ПроцентПлатежаКредит + ТекСтрока.ПроцентПлатежа;
			Если ЕстьТара Тогда
				Результат.СуммаЗалогаЗаТаруКредит   = Результат.СуммаЗалогаЗаТаруКредит + ТекСтрока.СуммаЗалогаЗаТару;
				Результат.ПроцентЗалогаЗаТаруКредит = Результат.ПроцентЗалогаЗаТаруКредит + ТекСтрока.ПроцентЗалогаЗаТару;
			КонецЕсли;
			
			Если ЕстьСуммаВзаиморасчетов Тогда
				Результат.СуммаВзаиморасчетовКредит = Результат.СуммаВзаиморасчетовКредит + ТекСтрока.СуммаВзаиморасчетов;
				Если ЕстьТара Тогда
					Результат.СуммаВзаиморасчетовПоТареКредит = Результат.СуммаВзаиморасчетовПоТареКредит + ТекСтрока.СуммаВзаиморасчетовПоТаре;
				КонецЕсли;
			КонецЕсли;
			
			Если Результат.ДатаКредит <= ТекСтрока.ДатаПлатежа Тогда
				Результат.ДатаКредит = Макс(Результат.ДатаКредит, ТекСтрока.ДатаПлатежа);
				Результат.СдвигКредит = ТекСтрока.Сдвиг;
				Если ЕстьДатыОтгрузки Тогда
					Результат.ДатаОтгрузкиКредит = Макс(Результат.ДатаОтгрузкиКредит, ТекСтрока.ДатаОтгрузки);
				КонецЕсли;
				Если ТекСтрока.ВариантОтсчета <> Перечисления.ВариантыОтсчетаДатыПлатежа.Формула Тогда
					Результат.ВариантОтсчетаКредит = ТекСтрока.ВариантОтсчета;
				КонецЕсли;
				Результат.ВариантКонтроляКредит= ТекСтрока.ВариантОплаты;
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьСуммаОтклоненияМерныхТоваров Тогда
			Результат.СуммаОтклоненияМерныхТоваров = Результат.СуммаОтклоненияМерныхТоваров + ТекСтрока.СуммаОтклоненияМерныхТоваров;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьПредоплата И НЕ ЗначениеЗаполнено(Результат.ВариантОтсчетаПредоплата) Тогда
		Результат.ВариантОтсчетаПредоплата = Перечисления.ВариантыОтсчетаДатыПлатежа.ДоДатыОтгрузки;
		
		ПараметрыРасчетаДатыПлатежа = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
		ПараметрыРасчетаДатыПлатежа.ДатаОтгрузки = ДатаОтгрузки;
		ПараметрыРасчетаДатыПлатежа.ВариантОтсчета = Результат.ВариантОтсчетаПредоплата;
		ПараметрыРасчетаДатыПлатежа.ДатаПлатежа = Результат.ДатаПредоплата;
		Если ЗначениеЗаполнено(Календарь) Тогда
			Результат.СдвигПредоплата = ЭтапыОплатыВызовСервера.СдвигПоКалендарю(ПараметрыРасчетаДатыПлатежа);
		Иначе
			Результат.СдвигПредоплата = ЭтапыОплатыВызовСервера.СдвигБезКалендаря(ПараметрыРасчетаДатыПлатежа);
		КонецЕсли;
		Если Результат.СдвигПредоплата < 0 Тогда
			Результат.СдвигПредоплата = 0;
			ПараметрыРасчетаДатыПлатежа.Сдвиг = 0;
			Если ЗначениеЗаполнено(Календарь) Тогда
				Результат.ДатаПредоплата = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(ПараметрыРасчетаДатыПлатежа);
			Иначе
				Результат.ДатаПредоплата = ЭтапыОплатыВызовСервера.ДатаПлатежаБезКалендаря(ПараметрыРасчетаДатыПлатежа);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат.ВариантОтсчетаКредит) 
		ИЛИ НЕ ЕстьПредоплата И Результат.ВариантОтсчетаКредит <> Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки Тогда
		Результат.ВариантОтсчетаКредит = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки;
		
		ПараметрыРасчетаДатыПлатежа = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
		ПараметрыРасчетаДатыПлатежа.ДатаОтгрузки = ДатаОтгрузки;
		ПараметрыРасчетаДатыПлатежа.ВариантОтсчета = Результат.ВариантОтсчетаКредит;
		ПараметрыРасчетаДатыПлатежа.ДатаПлатежа = Результат.ДатаКредит;
		Если ЗначениеЗаполнено(Календарь) Тогда
			Результат.СдвигКредит = ЭтапыОплатыВызовСервера.СдвигПоКалендарю(ПараметрыРасчетаДатыПлатежа);
		Иначе
			Результат.СдвигКредит = ЭтапыОплатыВызовСервера.СдвигБезКалендаря(ПараметрыРасчетаДатыПлатежа);
		КонецЕсли;
		Если Результат.СдвигКредит < 0 Тогда
			Результат.СдвигКредит = 0;
			ПараметрыРасчетаДатыПлатежа.Сдвиг = 0;
			Если ЗначениеЗаполнено(Календарь) Тогда
				Результат.ДатаКредит = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(ПараметрыРасчетаДатыПлатежа);
			Иначе
				Результат.ДатаКредит = ЭтапыОплатыВызовСервера.ДатаПлатежаБезКалендаря(ПараметрыРасчетаДатыПлатежа);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбщиеМетоды

// Возвращает структуру с параметрами выбора реквизитов оплаты для передачи во внешние формы.
//
// Параметры:
// 		ОбъектМетаданных - ОбъектМетаданных - объект метаданных, по которому нужно определить параметры.
//
// Возвращаемое значение:
// 		Структура:
// 			* Ключ - Строка - Имя реквизита оплаты.
// 			* Значение - ФиксированныйМассив из Структура - Параметры выбора, где:
// 				** ФормаОплаты - ФиксированныйМассив из ПараметрВыбора.
// 				** Касса - ФиксированныйМассив из ПараметрВыбора.
// 				** БанковскийСчет - ФиксированныйМассив из ПараметрВыбора.
// 				** ГрафикОплаты - ФиксированныйМассив из ПараметрВыбора.
//
Функция ПараметрыВыбораРеквизитовОплаты(ОбъектМетаданных) Экспорт
	
	РеквизитыОбъекта = ОбъектМетаданных.Реквизиты;
	ПараметрыВыбораРеквизитов = Новый Структура;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ФормаОплаты", ОбъектМетаданных) Тогда
		ПараметрыВыбораРеквизитов.Вставить("ФормаОплаты", РеквизитыОбъекта.ФормаОплаты.ПараметрыВыбора);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Касса", ОбъектМетаданных) Тогда
		ПараметрыВыбораРеквизитов.Вставить("Касса", РеквизитыОбъекта.Касса.ПараметрыВыбора);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("БанковскийСчет", ОбъектМетаданных) Тогда
		ПараметрыВыбораРеквизитов.Вставить("БанковскийСчет", РеквизитыОбъекта.БанковскийСчет.ПараметрыВыбора);
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("БанковскийСчетОрганизации", ОбъектМетаданных) Тогда
		ПараметрыВыбораРеквизитов.Вставить("БанковскийСчет", РеквизитыОбъекта.БанковскийСчетОрганизации.ПараметрыВыбора);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ГрафикОплаты", ОбъектМетаданных) Тогда
		ПараметрыВыбораРеквизитов.Вставить("ГрафикОплаты", РеквизитыОбъекта.ГрафикОплаты.ПараметрыВыбора);
	КонецЕсли;
	
	Возврат ПараметрыВыбораРеквизитов;
	
КонецФункции

//Возращает минимальную дату неоплаченного этапа графика исполнения договора.
//
// Параметры:
//
// 		ГрафикИсполненияДоговора - ДокументСсылка.ГрафикИсполненияДоговора - график договора.
// 		Дата - Дата - дата документа.
// 		ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами - определяет в каком регистре искать дату неоплаченного этапа.
//
// Возвращаемое значение:
// 		Дата - Минимальная дата неоплаченного этапа графика, если все оплачены - пустая дата.
Функция ДатаПервогоНеоплаченногоЭтапаГрафика(ГрафикИсполненияДоговора, Дата, ТипРасчетов) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") И ЗначениеЗаполнено(ГрафикИсполненияДоговора) Тогда
		
		Запрос = Новый Запрос;
		Если ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ЕСТЬNULL(МИНИМУМ(РасчетыСКлиентамиПланОплатОстатки.ДатаПлановогоПогашения), ДАТАВРЕМЯ(1,1,1)) КАК ДатаПлановогоПогашения
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентамиПланОплат.Остатки(,
			|		ДокументПлан = &ДокументПлан) КАК РасчетыСКлиентамиПланОплатОстатки";
		Иначе
			Запрос.Текст = "
			|	ВЫБРАТЬ
			|		ЕСТЬNULL(МИНИМУМ(РасчетыСПоставщикамиПланОплат.ДатаПлановогоПогашения), ДАТАВРЕМЯ(1,1,1)) КАК ДатаПлановогоПогашения
			|	ИЗ
			|		РегистрНакопления.РасчетыСПоставщикамиПланОплат.Остатки(,
			|			ДокументПлан = &ДокументПлан) КАК РасчетыСПоставщикамиПланОплат";
		КонецЕсли;
		Запрос.УстановитьПараметр("ДокументПлан", ГрафикИсполненияДоговора);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ДатаПлановогоПогашения;
		Иначе
			Возврат Дата;
		КонецЕсли;
	Иначе
		Возврат Дата;
	КонецЕсли;
	
КонецФункции

// Процедура проверяет заполнение и корректность даты платежа в документе.
//
// Параметры:
//		ДатаПлатежа - Дата - дата платежа проверяемого документа
//		ДатаДокумента - Дата - дата проверяемого документа 
//		Отказ - Булево - Признак отказа от продолжения работы.
//
Процедура ПроверитьЗаполнениеКорректностьДатыПлатежа(ДатаПлатежа, ДатаДокумента, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаПлатежа) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Поле ""Дата платежа"" не заполнено'"),
			,
			"ДатаПлатежа",
			"Объект",
			Отказ);
		
	ИначеЕсли ДатаПлатежа < НачалоДня(ДатаДокумента) Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Дата платежа должна быть не меньше даты документа %1'"),
			Формат(ДатаДокумента, "ДЛФ=DD"));
		ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			,
			"ДатаПлатежа",
			"Объект",
			Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет проценты по уже рассчитанным суммам в таблице этапов графиков оплаты.
// 
// Параметры:
// 	ЭтапыГрафикаОплаты - ТаблицаЗначений,ДанныеФормыКоллекция - этапы, в которых надо заполнить проценты.
//
Процедура ЗаполнитьПроцентыПоСуммам(ЭтапыГрафикаОплаты) Экспорт
	
	Если ВзаиморасчетыКлиентСервер.ЭтоТабличнаяЧасть(ЭтапыГрафикаОплаты) Тогда
		ЕстьТара = ЭтапыГрафикаОплаты.Колонки.Найти("СуммаЗалогаЗаТару") <> Неопределено;
	Иначе
		ЕстьТара = ЭтапыГрафикаОплаты.Выгрузить().Колонки.Найти("СуммаЗалогаЗаТару") <> Неопределено;
	КонецЕсли;
	
	СуммыПлатежей = Новый Массив;
	СуммыПлатежейПоЗалогу = Новый Массив;
	
	// Если в этапах оплаты есть и положительные и отрицательные суммы, проценты не могут быть рассчитаны в РаспределитьСуммуПропорциональноКоэффициентам
	// Рассчитываются проценты относительно суммы по модулю
	СуммаПлатежейПоМодулю = 0;
	СуммаЗалогаПоМодулю = 0;
	Для Каждого СтрокаЭтапа Из ЭтапыГрафикаОплаты Цикл 
		МодульСуммы = ?(СтрокаЭтапа.СуммаПлатежа > 0, СтрокаЭтапа.СуммаПлатежа, -СтрокаЭтапа.СуммаПлатежа);
		СуммыПлатежей.Добавить(МодульСуммы);
		СуммаПлатежейПоМодулю = СуммаПлатежейПоМодулю + МодульСуммы;
		Если ЕстьТара Тогда
			МодульСуммы = ?(СтрокаЭтапа.СуммаЗалогаЗаТару > 0, СтрокаЭтапа.СуммаЗалогаЗаТару, -СтрокаЭтапа.СуммаЗалогаЗаТару);
			СуммыПлатежейПоЗалогу.Добавить(МодульСуммы);
			СуммаЗалогаПоМодулю = СуммаЗалогаПоМодулю + МодульСуммы;
		КонецЕсли;
	КонецЦикла;
	
	ПроцентыПлатежей = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(100, СуммыПлатежей);
	ПроцентыПлатежейПоЗалогу = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(?(ЕстьТара,100,0), СуммыПлатежейПоЗалогу);
	
	Индекс = 0;
	Пока Индекс < ЭтапыГрафикаОплаты.Количество() Цикл
		
		Если ПроцентыПлатежей <> Неопределено Тогда
			ЭтапыГрафикаОплаты[Индекс].ПроцентПлатежа = ПроцентыПлатежей[Индекс];
		Иначе
			ЭтапыГрафикаОплаты[Индекс].ПроцентПлатежа = 0;
		КонецЕсли;
		Если ЕстьТара Тогда
			Если ПроцентыПлатежейПоЗалогу <> Неопределено Тогда
				ЭтапыГрафикаОплаты[Индекс].ПроцентЗалогаЗаТару = ПроцентыПлатежейПоЗалогу[Индекс];
			Иначе
				ЭтапыГрафикаОплаты[Индекс].ПроцентЗалогаЗаТару = 0;
			КонецЕсли;
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

// Процедура распределяет сумму отклонения мерных товаров по этапам графика оплаты.
Процедура РаспределитьСуммуОтклоненияПоЭтапамГрафикаОплаты(ЭтапыГрафикаОплаты, Знач СуммаОтклоненияКРаспределению) Экспорт
	
	РаспределеннаяСуммаОтклонения = 0;
	ТекущийЭтап                   = 0;
	КоличествоЭтапов              = ЭтапыГрафикаОплаты.Количество();
	СуммаОтклоненияКРаспределению = СуммаОтклоненияКРаспределению + ЭтапыГрафикаОплаты.Итог("СуммаОтклоненияМерныхТоваров");
	
	Если СуммаОтклоненияКРаспределению = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СуммаОплатыВсего              = ЭтапыГрафикаОплаты.Итог("СуммаПлатежа")+ЭтапыГрафикаОплаты.Итог("СуммаЗалогаЗаТару");
	
	Для Каждого ЭтапГрафикаОплаты Из ЭтапыГрафикаОплаты Цикл
		
		ТекущийЭтап = ТекущийЭтап + 1;
		
		КоэффициентОтОбщего    = (ЭтапГрафикаОплаты.СуммаПлатежа + ЭтапГрафикаОплаты.СуммаЗалогаЗаТару)/СуммаОплатыВсего;
		СуммаОтклоненияПоЭтапу = Окр(СуммаОтклоненияКРаспределению * КоэффициентОтОбщего, 2, РежимОкругления.Окр15как20);
		
		ЭтапГрафикаОплаты.СуммаОтклоненияМерныхТоваров  = ?(ТекущийЭтап = КоличествоЭтапов,
		                                                    СуммаОтклоненияКРаспределению - РаспределеннаяСуммаОтклонения,
		                                                    СуммаОтклоненияПоЭтапу);
		
		КоэффициентОтСтроки = ЭтапГрафикаОплаты.СуммаОтклоненияМерныхТоваров
		                      / (ЭтапГрафикаОплаты.СуммаПлатежа+ЭтапГрафикаОплаты.СуммаЗалогаЗаТару);
		
		ЧастьСуммыПлатежа   = Окр(ЭтапГрафикаОплаты.СуммаПлатежа * КоэффициентОтСтроки,2);
		ЭтапГрафикаОплаты.СуммаПлатежа      = ЭтапГрафикаОплаты.СуммаПлатежа - ЧастьСуммыПлатежа;
		
		ЭтапГрафикаОплаты.СуммаЗалогаЗаТару = ЭтапГрафикаОплаты.СуммаЗалогаЗаТару
		                                      - (ЭтапГрафикаОплаты.СуммаОтклоненияМерныхТоваров - ЧастьСуммыПлатежа);
		
		РаспределеннаяСуммаОтклонения = РаспределеннаяСуммаОтклонения + ЭтапГрафикаОплаты.СуммаОтклоненияМерныхТоваров;
		
	КонецЦикла;
	
КонецПроцедуры

// Двигает даты платежа этапов оплаты в соответствии с изменениями исходных дат
// 
// Параметры:
//  Объект - ДокументОбъект, СправочникОбъект, ФормаКлиентскогоПриложения - Обрабатываемый объект
//  СтруктураПараметров - см. ВзаиморасчетыСервер.ПараметрыМеханизма
//  МассивИспользуемыхРеквизитов- Массив из Строка - имена реквизитов
// 
// Возвращаемое значение:
//  Булево - Истина, если есть изменения в Этапах оплаты
Функция ПересчитатьДатыПлатежаЭтаповОплаты(Объект, СтруктураПараметров, МассивИспользуемыхРеквизитов) Экспорт
	
	ИзмененыЭтапыОплаты = Ложь;
	
	ЭтапыГрафика = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
	
	Если СтруктураПараметров.ЭтоЗаказ Тогда
		
		ДатыОтгрузки = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаОтгрузки);
		ДатыПоступления = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаПоступления);
		// Определяет, действительно ли в заказе несколько дат отгрузки, а не просто снят флаг ОтгружатьОднойДатой
		Если ТипЗнч(ДатыОтгрузки) = Тип("Массив") Тогда
			ТабличнаяЧасть = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧ);
			НесколькоДатОтгрузки = РазличныеДаты(ТабличнаяЧасть, СтруктураПараметров.ДатаОтгрузки).ДатыОтгрузки.Количество() > 1;
		Иначе
			НесколькоДатОтгрузки = Ложь;
		КонецЕсли;
		
		Если (МассивИспользуемыхРеквизитов.Найти("ДатаОтгрузки") <> Неопределено ИЛИ  МассивИспользуемыхРеквизитов.Найти("ДатаПоступления") <> Неопределено) 
			И МассивИспользуемыхРеквизитов.Найти("ОтгружатьОднойДатой") = Неопределено
			И НесколькоДатОтгрузки Тогда 
			СтруктураПараметров.ИзменилосьНесколькоДатОтгрузки = Истина;
		Иначе
			
			ДатаСогласования = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаСогласования);
			ДатаЗаказа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
			Если ТипЗнч(ДатыОтгрузки) = Тип("Массив") И ДатыОтгрузки.Количество() > 0 Тогда
				ДатаОтгрузки = ДатыОтгрузки[0];
			ИначеЕсли ТипЗнч(ДатыОтгрузки) = Тип("Дата") Тогда
				ДатаОтгрузки = ДатыОтгрузки;
			Иначе
				ДатаОтгрузки = Дата(1,1,1);
			КонецЕсли;
			
			Если ТипЗнч(ДатыПоступления) = Тип("Массив") И ДатыПоступления.Количество() > 0 Тогда
				ДатаПоступления = ДатыПоступления[0];
			ИначеЕсли ТипЗнч(ДатыПоступления) = Тип("Дата") Тогда
				ДатаПоступления = ДатыПоступления;
			Иначе
				ДатаПоступления = Дата(1,1,1);
			КонецЕсли;
			
			Для Каждого СтрокаЭтапа Из ЭтапыГрафика Цикл
				Если СтрокаЭтапа.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыСогласования 
						И МассивИспользуемыхРеквизитов.Найти("ДатаСогласования") <> Неопределено
					Или СтрокаЭтапа.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа 
						И МассивИспользуемыхРеквизитов.Найти("Дата") <> Неопределено 
					Или ЭтапыОплатыПовтИсп.СтрокаЭтаповЗависитОтДатыОтгрузки(СтрокаЭтапа.ВариантОтсчета, СтрокаЭтапа.Формула)
						И (МассивИспользуемыхРеквизитов.Найти("ДатаОтгрузки") <> Неопределено ИЛИ МассивИспользуемыхРеквизитов.Найти("ДатаПоступления") <> Неопределено)
					Или СтрокаЭтапа.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.Формула Тогда
					
					ПараметрыРасчетаДатыПлатежа = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
					ПараметрыРасчетаДатыПлатежа.ВариантОтсчета                 = СтрокаЭтапа.ВариантОтсчета;
					ПараметрыРасчетаДатыПлатежа.Сдвиг                          = СтрокаЭтапа.Сдвиг;
					ПараметрыРасчетаДатыПлатежа.ДатаЗаказа                     = ДатаЗаказа;
					ПараметрыРасчетаДатыПлатежа.ДатаСогласования               = ДатаСогласования;
					ПараметрыРасчетаДатыПлатежа.ДатаОтгрузки                   = ДатаОтгрузки;
					ПараметрыРасчетаДатыПлатежа.ДатаПоступления                = ДатаПоступления;
					ПараметрыРасчетаДатыПлатежа.ДатаПереходаПраваСобственности = Дата(1,1,1);
					ПараметрыРасчетаДатыПлатежа.СрокПереходаПраваСобственности = СтруктураПараметров.СрокПереходаПраваСобственности;
					ПараметрыРасчетаДатыПлатежа.Календарь                      = СтруктураПараметров.Календарь;
					ПараметрыРасчетаДатыПлатежа.Формула                        = СтрокаЭтапа.Формула;
					
					ИзмененыЭтапыОплаты = Истина;
					Если ЗначениеЗаполнено(СтруктураПараметров.Календарь)  Тогда
						СтрокаЭтапа.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(ПараметрыРасчетаДатыПлатежа);
					Иначе
						СтрокаЭтапа.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаБезКалендаря(ПараметрыРасчетаДатыПлатежа);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла; 
			
		КонецЕсли;
	ИначеЕсли СтруктураПараметров.ЭтоПродажаЗакупка Тогда
		
		ДатаОтгрузки = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
		Если ЗначениеЗаполнено(СтруктураПараметров.ДатаПереходаПраваСобственности) Тогда
			ДатаПереходаПраваСобственности = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ДатаПереходаПраваСобственности);
		Иначе
			ДатаПереходаПраваСобственности = Дата(1,1,1);
		КонецЕсли;
		
		ПересчитыватьЭтапыОтДатыПереходаПраваСобственности = 
			СтруктураПараметров.ЭтоПереходПраваСобственности2_5
				И МассивИспользуемыхРеквизитов.Найти("Дата") <> Неопределено
			Или МассивИспользуемыхРеквизитов.Найти("ДатаПереходаПраваСобственности") <> Неопределено;
		
		ПересчитыватьЭтапыОтДатОтгрузки = НЕ СтруктураПараметров.ЭтоПереходПраваСобственности2_5
			И (МассивИспользуемыхРеквизитов.Найти("Дата") <> Неопределено
				Или МассивИспользуемыхРеквизитов.Найти("ДатаОтгрузки") <> Неопределено);
			
		Для Каждого СтрокаЭтапа Из ЭтапыГрафика Цикл
			Если ПересчитыватьЭтапыОтДатыПереходаПраваСобственности
				И СтрокаЭтапа.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыПереходаПраваСобственности
			Или ПересчитыватьЭтапыОтДатОтгрузки
				И (СтрокаЭтапа.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки 
					Или СтрокаЭтапа.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ДоДатыОтгрузки
					Или СтрокаЭтапа.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыПоступления)
			Или СтрокаЭтапа.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.Формула Тогда
				ПараметрыРасчетаДатыПлатежа = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
				ПараметрыРасчетаДатыПлатежа.ВариантОтсчета                 = СтрокаЭтапа.ВариантОтсчета;
				ПараметрыРасчетаДатыПлатежа.Сдвиг                          = СтрокаЭтапа.Сдвиг;
				ПараметрыРасчетаДатыПлатежа.ДатаЗаказа                     = Дата(1,1,1);
				ПараметрыРасчетаДатыПлатежа.ДатаСогласования               = Дата(1,1,1);
				ПараметрыРасчетаДатыПлатежа.ДатаОтгрузки                   = ДатаОтгрузки;
				ПараметрыРасчетаДатыПлатежа.ДатаПоступления                = ДатаОтгрузки;
				ПараметрыРасчетаДатыПлатежа.ДатаПереходаПраваСобственности = ДатаПереходаПраваСобственности;
				ПараметрыРасчетаДатыПлатежа.СрокПереходаПраваСобственности = СтруктураПараметров.СрокПереходаПраваСобственности;
				ПараметрыРасчетаДатыПлатежа.Календарь                      = СтруктураПараметров.Календарь;
				ПараметрыРасчетаДатыПлатежа.Формула                        = СтрокаЭтапа.Формула;
				
				ИзмененыЭтапыОплаты = Истина;
				Если ЗначениеЗаполнено(СтруктураПараметров.Календарь)  Тогда
					СтрокаЭтапа.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(ПараметрыРасчетаДатыПлатежа);
				Иначе
					СтрокаЭтапа.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаБезКалендаря(ПараметрыРасчетаДатыПлатежа);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ИзмененыЭтапыОплаты Тогда
		СвернутьЭтапыГрафикаОплаты(ЭтапыГрафика);
	КонецЕсли;
	
	Возврат ИзмененыЭтапыОплаты;
	
КонецФункции

// Процедура по возможности пересчитает этапы оплаты заказа клиента после заполнения обеспечения.
// 
// Параметры:
//  Объект - ДокументОбъект.ЗаказКлиента, ДокументОбъект.ЗаказДавальца2_5 - Заказ, в котором изменились даты отгрузки
Процедура ПослеЗаполненияОбеспечения(Объект) Экспорт
	
	ИзмененыЭтапыОплаты = Ложь;
	
	ЭтапыГрафика = Объект.ЭтапыГрафикаОплаты;
	
	ДатаСогласования = Объект.ДатаСогласования;
	ДатаЗаказа = Объект.Дата;
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ДатыОтгрузки = Объект.Товары.ВыгрузитьКолонку("ДатаОтгрузки");
	Иначе
		ДатыОтгрузки = Объект.Продукция.ВыгрузитьКолонку("ДатаОтгрузки");
	КонецЕсли;
	ДатыОтгрузки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДатыОтгрузки);
	Если ДатыОтгрузки.Количество() = 1 Тогда
		ДатаОтгрузки = ДатыОтгрузки[0];
	Иначе
		// Несколько дат отгрузки - не очищаем и не двигаем текущий график оплаты
		Возврат;
	КонецЕсли;
	
	ПараметрыСоглашения = Новый Структура("Календарь, СрокПереходаПраваСобственности");
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Соглашение, "Календарь, СрокПереходаПраваСобственности");
		ЗаполнитьЗначенияСвойств(ПараметрыСоглашения, РеквизитыСоглашения);
	Иначе
		ПараметрыСоглашения.Календарь = Справочники.ПроизводственныеКалендари.ПустаяСсылка();
		ПараметрыСоглашения.СрокПереходаПраваСобственности = 0;
	КонецЕсли;
	
	Для Каждого СтрокаЭтапа Из ЭтапыГрафика Цикл
		Если ЭтапыОплатыПовтИсп.СтрокаЭтаповЗависитОтДатыОтгрузки(СтрокаЭтапа.ВариантОтсчета,СтрокаЭтапа.Формула) Тогда
			ПараметрыРасчетаДатыПлатежа = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
			ПараметрыРасчетаДатыПлатежа.ВариантОтсчета                 = СтрокаЭтапа.ВариантОтсчета;
			ПараметрыРасчетаДатыПлатежа.Формула                        = СтрокаЭтапа.Формула;
			ПараметрыРасчетаДатыПлатежа.Сдвиг                          = СтрокаЭтапа.Сдвиг;
			ПараметрыРасчетаДатыПлатежа.ДатаЗаказа                     = ДатаЗаказа;
			ПараметрыРасчетаДатыПлатежа.ДатаСогласования               = ДатаСогласования;
			ПараметрыРасчетаДатыПлатежа.ДатаОтгрузки                   = ДатаОтгрузки;
			ПараметрыРасчетаДатыПлатежа.ДатаПереходаПраваСобственности = Дата(1,1,1);
			ПараметрыРасчетаДатыПлатежа.СрокПереходаПраваСобственности = ПараметрыСоглашения.СрокПереходаПраваСобственности;
			ПараметрыРасчетаДатыПлатежа.Календарь                      = ПараметрыСоглашения.Календарь;
			ИзмененыЭтапыОплаты = Истина;
			Если ЗначениеЗаполнено(ПараметрыСоглашения.Календарь)  Тогда
				СтрокаЭтапа.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаПоКалендарю(ПараметрыРасчетаДатыПлатежа);
			Иначе
				СтрокаЭтапа.ДатаПлатежа = ЭтапыОплатыВызовСервера.ДатаПлатежаБезКалендаря(ПараметрыРасчетаДатыПлатежа);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ИзмененыЭтапыОплаты Тогда
		СвернутьЭтапыГрафикаОплаты(ЭтапыГрафика);
		Объект.ДополнительныеСвойства.Вставить("ОповеститьОЗаполненииЭтапов", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Дерево операндов для формул расчета даты платежа. Используется на форме справочников формул и при расчете этих формул.
// 
// Возвращаемое значение:
//  ДеревоЗначений - Дерево операндов для формулы:
// * Идентификатор - Строка - 
// * Представление - Строка - 
// * ТипЭлементаДерева - Строка - 
// * РазрешаетсяВыборОперанда - Булево - 
// * ВключаетсяВИдентификатор - Булево - 
// * ТипЗначения - ОписаниеТипов - 
// * РазворачиватьДоРеквизитов - Булево - 
// * Значение - Число - 
// * СодержитЗначение - Булево - 
// * ПометкаУдаления - Булево - 
Функция ДеревоОперандовДляФормулы() Экспорт
	
	ДеревоОперандов = РаботаСФормулами.ПолучитьПустоеДеревоОперандов();
	
	КорневаяСтрокаДерева = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	КорневаяСтрокаДерева.Идентификатор = "Сдвиг";
	КорневаяСтрокаДерева.Представление = НСтр("ru = 'Срок (дн)'");
	КорневаяСтрокаДерева.ТипЗначения = ОбщегоНазначения.ОписаниеТипаЧисло(3,0);
	КорневаяСтрокаДерева.РазрешаетсяВыборОперанда = Истина;
	КорневаяСтрокаДерева.ВключаетсяВИдентификатор = Истина;
	КорневаяСтрокаДерева.РазворачиватьДоРеквизитов = Ложь;
	
	КорневаяСтрокаДерева = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	КорневаяСтрокаДерева.Идентификатор = "ДатаЗаказа";
	КорневаяСтрокаДерева.Представление = НСтр("ru = 'Дата заказа/договора'");
	КорневаяСтрокаДерева.ТипЗначения = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	КорневаяСтрокаДерева.РазрешаетсяВыборОперанда = Истина;
	КорневаяСтрокаДерева.ВключаетсяВИдентификатор = Истина;
	КорневаяСтрокаДерева.РазворачиватьДоРеквизитов = Ложь;
	
	КорневаяСтрокаДерева = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	КорневаяСтрокаДерева.Идентификатор = "ДатаСогласования";
	КорневаяСтрокаДерева.Представление = НСтр("ru = 'Дата согласования'");
	КорневаяСтрокаДерева.ТипЗначения = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	КорневаяСтрокаДерева.РазрешаетсяВыборОперанда = Истина;
	КорневаяСтрокаДерева.ВключаетсяВИдентификатор = Истина;
	КорневаяСтрокаДерева.РазворачиватьДоРеквизитов = Ложь;
	
	КорневаяСтрокаДерева = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	КорневаяСтрокаДерева.Идентификатор = "ДатаОтгрузки";
	КорневаяСтрокаДерева.Представление = НСтр("ru = 'Дата отгрузки'");
	КорневаяСтрокаДерева.ТипЗначения = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	КорневаяСтрокаДерева.РазрешаетсяВыборОперанда = Истина;
	КорневаяСтрокаДерева.ВключаетсяВИдентификатор = Истина;
	КорневаяСтрокаДерева.РазворачиватьДоРеквизитов = Ложь;
	
	КорневаяСтрокаДерева = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	КорневаяСтрокаДерева.Идентификатор = "ДатаПоступления";
	КорневаяСтрокаДерева.Представление = НСтр("ru = 'Дата поступления'");
	КорневаяСтрокаДерева.ТипЗначения = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	КорневаяСтрокаДерева.РазрешаетсяВыборОперанда = Истина;
	КорневаяСтрокаДерева.ВключаетсяВИдентификатор = Истина;
	КорневаяСтрокаДерева.РазворачиватьДоРеквизитов = Ложь;
	
	КорневаяСтрокаДерева = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	КорневаяСтрокаДерева.Идентификатор = "СрокПереходаПраваСобственности";
	КорневаяСтрокаДерева.Представление = НСтр("ru = 'Срок перехода права собственности'");
	КорневаяСтрокаДерева.ТипЗначения = ОбщегоНазначения.ОписаниеТипаЧисло(3,0);
	КорневаяСтрокаДерева.РазрешаетсяВыборОперанда = Истина;
	КорневаяСтрокаДерева.ВключаетсяВИдентификатор = Истина;
	КорневаяСтрокаДерева.РазворачиватьДоРеквизитов = Ложь;
	
	КорневаяСтрокаДерева = РаботаСФормулами.НоваяСтрокаДереваОперанда(ДеревоОперандов);
	КорневаяСтрокаДерева.Идентификатор = "ДатаПереходаПраваСобственности";
	КорневаяСтрокаДерева.Представление = НСтр("ru = 'Дата перехода права собственности'");
	КорневаяСтрокаДерева.ТипЗначения = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	КорневаяСтрокаДерева.РазрешаетсяВыборОперанда = Истина;
	КорневаяСтрокаДерева.ВключаетсяВИдентификатор = Истина;
	КорневаяСтрокаДерева.РазворачиватьДоРеквизитов = Ложь;
	
	Возврат ДеревоОперандов;
	
КонецФункции

// Возвращает различные заполненные даты отгрузки из табличной части по неотмененным строкам.
// 
// Параметры:
//  ТабличнаяЧасть - ДанныеФормыКоллекция,ТаблицаЗначений - Табличная часть
//  ПутьКПолюДатаОтгрузки - Строка - Путь к дате отгрузки в документе
// 
// Возвращаемое значение:
//  Структура - Различные даты:
// * ДатыОтгрузки - Массив из Дата - Различные даты отгрузки - даты отгрузки из табличной части документа.
// * ДатыПоступления - Массив из Дата - Различные даты поступления - даты поступления из табличной части документа.
// * ДатыЗаказа - Массив из Дата - Различные даты заказов - даты заказов из табличной части документа.
// * ДатыСогласования - Массив из Дата - Различные даты согласования - даты согласования заказов из табличной части документа.
Функция РазличныеДаты(ТабличнаяЧасть, ПутьКПолюДатаОтгрузки = "") Экспорт
	
	ДатыОтгрузки = Новый Массив;
	ДатыПоступления = Новый Массив;
	ДатыЗаказа = Новый Массив;
	ДатыСогласования = Новый Массив;
	
	Если ТабличнаяЧасть.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(ПутьКПолюДатаОтгрузки) Тогда
			МассивПодстрок = СтрРазделить(ПутьКПолюДатаОтгрузки,".");
			ИмяПоляДатаОтгрузки = МассивПодстрок[МассивПодстрок.ВГраница()];
		Иначе
			ИмяПоляДатаОтгрузки = "ДатаОтгрузки";
		КонецЕсли;
		
		ЕстьОтменено = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТабличнаяЧасть[0], "Отменено");
		ЕстьДатаОтгрузки = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТабличнаяЧасть[0], "ДатаОтгрузки");
		ЕстьДатаПоступления = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТабличнаяЧасть[0], "ДатаПоступления");
		ЕстьДатаЗаказа = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТабличнаяЧасть[0], "ДатаЗаказа");
		ЕстьДатаСогласования = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТабличнаяЧасть[0], "ДатаСогласования");
		
		Для Каждого Стр Из ТабличнаяЧасть Цикл
			Если ЕстьДатаОтгрузки И ЗначениеЗаполнено(Стр[ИмяПоляДатаОтгрузки]) И (НЕ ЕстьОтменено ИЛИ НЕ Стр.Отменено) Тогда
				ДатыОтгрузки.Добавить(Стр[ИмяПоляДатаОтгрузки]);
			КонецЕсли;
			Если ЕстьДатаПоступления И ЗначениеЗаполнено(Стр.ДатаПоступления) И (НЕ ЕстьОтменено ИЛИ НЕ Стр.Отменено) Тогда
				ДатыПоступления.Добавить(Стр.ДатаПоступления);
			КонецЕсли;
			Если ЕстьДатаЗаказа И ЗначениеЗаполнено(Стр.ДатаЗаказа) Тогда
				ДатыЗаказа.Добавить(Стр.ДатаЗаказа);
			КонецЕсли;
			Если ЕстьДатаСогласования И ЗначениеЗаполнено(Стр.ДатаСогласования) Тогда
				ДатыСогласования.Добавить(Стр.ДатаСогласования);
			КонецЕсли;
		КонецЦикла;
		ДатыОтгрузки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДатыОтгрузки);
		ДатыПоступления = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДатыПоступления);
		ДатыЗаказа = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДатыЗаказа);
		ДатыСогласования = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДатыСогласования);
	КонецЕсли;
	
	Возврат Новый Структура("ДатыОтгрузки,ДатыПоступления,ДатыЗаказа,ДатыСогласования",ДатыОтгрузки,ДатыПоступления,ДатыЗаказа,ДатыСогласования);
КонецФункции

Процедура ПоместитьЭтапыОплатыВоВременноеХранилище(Форма, ИмяЭлемента) Экспорт
	
	ПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	СтруктураПараметров = ВзаиморасчетыКлиентСервер.СтруктураПараметровПоИмениЭлемента(ПараметрыМеханизма.МассивПараметров, ИмяЭлемента);
	
	ЭтапыОплаты = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
	ТаблицаЗначений = ЭтапыОплаты.Выгрузить();
	
	Если ТаблицаЗначений.Колонки.Найти("ВариантОплаты") = Неопределено Тогда
		Если СтруктураПараметров.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда
			ТаблицаЗначений.Колонки.Добавить("ВариантОплаты", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыКонтроляОплатыКлиентом"));
			ТаблицаЗначений.ЗаполнитьЗначения(Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки, "ВариантОплаты");
		Иначе
			ТаблицаЗначений.Колонки.Добавить("ВариантОплаты", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыКонтроляОплатыПоставщику"));
			ТаблицаЗначений.ЗаполнитьЗначения(Перечисления.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления, "ВариантОплаты");
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПараметров.АдресЭтапыОплаты = ПоместитьВоВременноеХранилище(ТаблицаЗначений, Новый УникальныйИдентификатор());
	
	ОбщегоНазначенияУТ.СохранитьДанныеМеханизмаВКэшФормы(Форма, "Взаиморасчеты", ПараметрыМеханизма);
	
КонецПроцедуры

Процедура ЗагрузитьЭтапыОплатыИзВременногоХранилища(Форма) Экспорт
	
	ПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	МассивПараметров = ПараметрыМеханизма.МассивПараметров;
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		Если ЗначениеЗаполнено(СтруктураПараметров.АдресЭтапыОплаты) Тогда
			
			ЭтапыОплаты = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма,СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
			НовыеЭтапыОплаты = ПолучитьИзВременногоХранилища(СтруктураПараметров.АдресЭтапыОплаты);
			СтарыеЭтапыОплаты = ЭтапыОплаты.Выгрузить();
			
			Если НовыеЭтапыОплаты <> Неопределено Тогда 
				
				ТребуетсяПерезаполнение = Истина;
				Если СтруктураПараметров.ЭтоЗаказ Тогда
					Если ВзаиморасчетыСлужебный.ТаблицыРавны(СтарыеЭтапыОплаты, НовыеЭтапыОплаты) Тогда
						ТребуетсяПерезаполнение = Ложь
					Иначе
						СтруктураПараметров.ИзменилосьНесколькоДатОтгрузки = Ложь;
					КонецЕсли;
				КонецЕсли;
				Если ТребуетсяПерезаполнение Тогда
					ЭтапыОплаты.Очистить();
					Для Каждого ТекСтрока Из НовыеЭтапыОплаты Цикл
						НоваяСтрока = ЭтапыОплаты.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
					КонецЦикла;
					УдалитьИзВременногоХранилища(СтруктураПараметров.АдресЭтапыОплаты);
					СтруктураПараметров.АдресЭтапыОплаты = ""; 
				КонецЕсли;
			КонецЕсли;
			
			ВзаиморасчетыРаботаСФормами.ОбновитьТекстГиперссылкиЭтапыОплаты(Форма, СтруктураПараметров, ПараметрыМеханизма.СистемныеНастройки);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПреобразоватьТаблицуЭтаповВДанныеУпрощенногоРежима(ЭтапыОплаты, ДатаОтгрузки, ЕстьПредоплата, Календарь)
	
	УпрощенныеДанные = ДанныеУпрощенногоРежима(ЭтапыОплаты, ДатаОтгрузки, ЕстьПредоплата, Календарь);
	
	ЕстьТара = ЭтапыОплаты.Количество() > 0 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыОплаты[0],"СуммаЗалогаЗаТару");
	ЕстьСуммаВзаиморасчетов = ЭтапыОплаты.Количество() > 0
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыОплаты[0],"СуммаВзаиморасчетов");
	ЕстьДатыОтгрузки = ЭтапыОплаты.Количество() > 0 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтапыОплаты[0],"ДатаОтгрузки");
	
	ЭтапыОплаты.Очистить();
	
	Если УпрощенныеДанные.СуммаПлатежаПредоплата + УпрощенныеДанные.СуммаЗалогаЗаТаруПредоплата <> 0 Тогда
		НовСтр = ЭтапыОплаты.Добавить();
		НовСтр.СуммаПлатежа      = УпрощенныеДанные.СуммаПлатежаПредоплата;
		НовСтр.ПроцентПлатежа    = УпрощенныеДанные.ПроцентПлатежаПредоплата;
		НовСтр.ДатаПлатежа       = УпрощенныеДанные.ДатаПредоплата;
		Если ЕстьДатыОтгрузки Тогда
			НовСтр.ДатаОтгрузки      = УпрощенныеДанные.ДатаОтгрузкиПредоплата;
		КонецЕсли;
		НовСтр.ВариантОтсчета    = УпрощенныеДанные.ВариантОтсчетаПредоплата;
		НовСтр.ВариантОплаты     = УпрощенныеДанные.ВариантКонтроляПредоплата;
		НовСтр.Сдвиг             = УпрощенныеДанные.СдвигПредоплата;
		Если ЕстьТара Тогда
			НовСтр.СуммаЗалогаЗаТару   = УпрощенныеДанные.СуммаЗалогаЗаТаруПредоплата;
			НовСтр.ПроцентЗалогаЗаТару = УпрощенныеДанные.ПроцентЗалогаЗаТаруПредоплата;
		КонецЕсли;
		Если ЕстьСуммаВзаиморасчетов Тогда
			НовСтр.СуммаВзаиморасчетов = УпрощенныеДанные.СуммаВзаиморасчетовПредоплата;
			Если ЕстьТара Тогда
				НовСтр.СуммаВзаиморасчетовПоТаре = УпрощенныеДанные.СуммаВзаиморасчетовПоТареПредоплата;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если УпрощенныеДанные.СуммаПлатежаКредит + УпрощенныеДанные.СуммаЗалогаЗаТаруКредит <> 0 Тогда
		НовСтр = ЭтапыОплаты.Добавить();
		НовСтр.СуммаПлатежа      = УпрощенныеДанные.СуммаПлатежаКредит;
		НовСтр.ПроцентПлатежа    = УпрощенныеДанные.ПроцентПлатежаКредит;
		НовСтр.ДатаПлатежа       = УпрощенныеДанные.ДатаКредит;
		Если ЕстьДатыОтгрузки Тогда
			НовСтр.ДатаОтгрузки      = УпрощенныеДанные.ДатаОтгрузкиКредит;
		КонецЕсли;
		НовСтр.ВариантОтсчета    = УпрощенныеДанные.ВариантОтсчетаКредит;
		НовСтр.ВариантОплаты     = УпрощенныеДанные.ВариантКонтроляКредит;
		НовСтр.Сдвиг             = УпрощенныеДанные.СдвигКредит;
		Если ЕстьТара Тогда
			НовСтр.СуммаЗалогаЗаТару   = УпрощенныеДанные.СуммаЗалогаЗаТаруКредит;
			НовСтр.ПроцентЗалогаЗаТару = УпрощенныеДанные.ПроцентЗалогаЗаТаруКредит;
		КонецЕсли;
		Если ЕстьСуммаВзаиморасчетов Тогда
			НовСтр.СуммаВзаиморасчетов = УпрощенныеДанные.СуммаВзаиморасчетовКредит;
			Если ЕстьТара Тогда
				НовСтр.СуммаВзаиморасчетовПоТаре = УпрощенныеДанные.СуммаВзаиморасчетовПоТареКредит;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Сворачивает совпадающие этапы графика оплаты
//
// Параметры:
//  ЭтапыГрафикаОплаты	 - 	ДанныеФормыКоллекция, ТабличнаяЧасть - таблица этапов графика оплаты
//
Процедура СвернутьЭтапыГрафикаОплаты(ЭтапыГрафикаОплаты)
	
	ТаблицаЭтапыГрафикаОплаты = ЭтапыГрафикаОплаты.Выгрузить();
	МассивКолонок = Новый Массив;
	Для Каждого Колонка Из ТаблицаЭтапыГрафикаОплаты.Колонки Цикл
		МассивКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	МассивИзмерений = Новый Массив;
	МассивИзмерений.Добавить("ВариантОплаты");
	МассивИзмерений.Добавить("ВариантОтсчета");
	МассивИзмерений.Добавить("Формула");
	МассивИзмерений.Добавить("ДатаПлатежа");
	МассивИзмерений.Добавить("Сдвиг");
	МассивИзмерений.Добавить("Заказ");
	МассивИзмерений.Добавить("ОбъектРасчетов");
	МассивИзмерений.Добавить("СверхЗаказа");
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить("СуммаПлатежа");
	МассивРесурсов.Добавить("ПроцентПлатежа");
	МассивРесурсов.Добавить("СуммаЗалогаЗаТару");
	МассивРесурсов.Добавить("ПроцентЗалогаЗаТару");
	МассивРесурсов.Добавить("СуммаОтклоненияМерныхТоваров");
	МассивРесурсов.Добавить("СуммаВзаиморасчетов");
	МассивРесурсов.Добавить("СуммаВзаиморасчетовПоТаре");
	
	МассивИзмерений = ОбщегоНазначенияУТКлиентСервер.ПересечениеМассивов(МассивИзмерений, МассивКолонок);
	МассивРесурсов = ОбщегоНазначенияУТКлиентСервер.ПересечениеМассивов(МассивРесурсов, МассивКолонок);
	КолонкиИзмерений = СтрСоединить(МассивИзмерений, ",");
	КолонкиРесурсов = СтрСоединить(МассивРесурсов, ",");
	
	ТаблицаЭтапыГрафикаОплаты.Свернуть(КолонкиИзмерений,КолонкиРесурсов);
	
	ЭтапыОплатыСервер.ЗаполнитьПроцентыПоСуммам(ТаблицаЭтапыГрафикаОплаты);
	ЭтапыОплатыКлиентСервер.СортироватьТаблицуЭтапов(ТаблицаЭтапыГрафикаОплаты);
	
	ЭтапыГрафикаОплаты.Очистить();
	Для Каждого Стр Из ТаблицаЭтапыГрафикаОплаты Цикл
		ЗаполнитьЗначенияСвойств(ЭтапыГрафикаОплаты.Добавить(),Стр);
	КонецЦикла;

КонецПроцедуры

Функция СуммаЭтапаОплаты(ЭтапОплаты, СуммаОплаты, ЭтоЗалогЗаТару = Ложь)
	
	Если ЭтапОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения
		Или ЭтапОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки
		Или ЭтапОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения
		Или ЭтапОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления Тогда
		Возврат ОбщегоНазначенияУТКлиентСервер.ОкрВниз(
			СуммаОплаты 
				* ?(ЭтоЗалогЗаТару, ЭтапОплаты.ПроцентЗалогаЗаТару, ЭтапОплаты.ПроцентПлатежа) / 100,
			2);
	Иначе
		Возврат Окр(
			СуммаОплаты 
				* ?(ЭтоЗалогЗаТару, ЭтапОплаты.ПроцентЗалогаЗаТару, ЭтапОплаты.ПроцентПлатежа) / 100, 
			2,
			РежимОкругления.Окр15как20);
	КонецЕсли;
	
КонецФункции

Процедура ОчиститьЭтапыГрафикаОплатыПриИзмененииСоставаЗаказа(Объект,СтруктураПараметров, ЭтапыГрафикаОплаты)
	
	Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
		СуммыПоЗаказам = ВзаиморасчетыСервер.ТаблицаСуммПоЗаказам(Объект.Объект, СтруктураПараметров);
	Иначе
		СуммыПоЗаказам = ВзаиморасчетыСервер.ТаблицаСуммПоЗаказам(Объект, СтруктураПараметров);
	КонецЕсли;
	ТребуетсяЗалогЗаТару      = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ТребуетсяЗалогЗаТару,,Ложь);
	КолонкиСуммирования = Новый Массив;
	КолонкиСуммирования.Добавить("СуммаПлатежа");
	Если ТребуетсяЗалогЗаТару Тогда
		КолонкиСуммирования.Добавить("СуммаЗалогаЗаТару");
	КонецЕсли;
	Если СтруктураПараметров.ДокументРасчетовСКлиентами
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
		КолонкиИзмерений = "Заказ";
	Иначе
		КолонкиИзмерений = "Заказ, СверхЗаказа";
	КонецЕсли;
	
	Для Каждого СтрокаГрафика Из ЭтапыГрафикаОплаты Цикл
		НоваяСтрока = СуммыПоЗаказам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаГрафика);
		НоваяСтрока.СуммаПлатежа        = - НоваяСтрока.СуммаПлатежа;
		Если ТребуетсяЗалогЗаТару Тогда
			НоваяСтрока.СуммаЗалогаЗаТару         = - НоваяСтрока.СуммаЗалогаЗаТару;
		КонецЕсли;
	КонецЦикла;
	
	СуммыПоЗаказам.Свернуть(КолонкиИзмерений, СтрСоединить(КолонкиСуммирования, ","));
	Для Каждого СтрокаСумм Из СуммыПоЗаказам Цикл
		Если СтрокаСумм.СуммаПлатежа <> 0
			Или ТребуетсяЗалогЗаТару
				И СтрокаСумм.СуммаЗалогаЗаТару <> 0 Тогда
			ЭтапыГрафикаОплаты.Очистить();
			Прервать;
		КонецЕсли;
		Если ЭтапыГрафикаОплаты.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ТипыЗаказов()
	Типы = Новый Массив;
	Типы.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	Типы.Добавить(Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента"));
	Типы.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	
	
	
	Возврат Типы;
КонецФункции

#КонецОбласти
