// Спасибо 1С никам что не дают одновременно галки Привелегированный и Клиент (обычное приложение)
// Придется обкостыливать установкой привилегированного режима


// #Область ФоновыеИРегалментные

Функция ПолучитьРегламентныеЗадания() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Регламентные = РегламентныеЗадания.ПолучитьРегламентныеЗадания();	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Регламентные;
	
КонецФункции

Функция РегламентныеЗаданияНайтиПоУникальномуИдентификатору(ИдентификаторРегЗадания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Регламентное = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегЗадания);	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Регламентное;
	
КонецФункции

Функция ФЗ_ПолучитьФоновыеЗадания(Отбор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Фоновые = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Фоновые;
	
КонецФункции

Функция ЗаданиеВОчереди(ИдентификаторФоновогоЗадания) Экспорт
	
	ВОчереди = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтурЛогистика_КакаяБаза() = "Файловая" Тогда 
		
		Попытка          
			текЗадание = КонтурЛогистика_ДлительныеОперацииСервер.НайтиЗаданиеПоИдентификатору(ИдентификаторФоновогоЗадания);
			Если текЗадание = Неопределено Тогда 
				Возврат Ложь;
			КонецЕсли;
			
			АктивныеЗаданияМассив = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Состояние", СостояниеФоновогоЗадания.Активно));
			
			Если АктивныеЗаданияМассив.Количество() = 0 Тогда
				ВОчереди = Ложь;
			Иначе	
				Если АктивныеЗаданияМассив.Количество() = 1 
					ИЛИ АктивныеЗаданияМассив[АктивныеЗаданияМассив.Количество() - 1].УникальныйИдентификатор  = ИдентификаторФоновогоЗадания Тогда 
					ВОчереди = Ложь;
				Иначе
					ВОчереди = Истина;
				КонецЕсли;
			КонецЕсли;
			
		Исключение
			ВОчереди = Ложь;
		КонецПопытки;
	Иначе
		ВОчереди = Ложь;
	КонецЕсли;		
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ВОчереди;
	
КонецФункции 

Функция ТакоеФоновоеЗаданиеВыполняется(ИмяМетода, Ключ) Экспорт
	
	МассивВыполняемых = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("ИмяМетода, Ключ, Состояние", ИмяМетода, Ключ, СостояниеФоновогоЗадания.Активно));
	
	Если МассивВыполняемых.Количество() > 0 Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// #КонецОбласти ФоновыеИРегалментные

// #Область Роли

Функция РольСуществует(ИмяРоли) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Метаданные.Роли.Найти(ИмяРоли) <> Неопределено; 
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат; 
	
КонецФункции

// #КонецОбласти Роли

// #Область ОбщиеНастройки

Процедура УстановитьНастройку(ИмяНастройкиПредопределенное, УстанавливаемоеЗначение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Справочники.КонтурЛогистика_Настройки.УстановитьНастройку(ИмяНастройкиПредопределенное, УстанавливаемоеЗначение);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// #КонецОбласти ОбщиеНастройки