#Область ПрограммныйИнтерфейс

// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ.
//  Свойства - См. ПроведениеДокументов.СвойстваДокумента.
//
// Возвращаемое значение:
//  См. ПроведениеДокументов.ПараметрыУчетногоМеханизма.
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	
	Параметры.ЕстьПроизводныеДвижения = Истина;
	
	// Для Регистра накопления ПроцентныеРасходыДисконтирования механизм проведения документов используется у документов
	// ВводОстатковВзаиморасчетов и Сторно
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.Сторно") Тогда
		ДокументыДляДисконтирования = РегистрыНакопления.ПроцентныеРасходыДисконтирования.ПолучитьТипыДокументовУчаствующихВДисконтировании();
		ТребуютсяДвиженияПроцентныеРасходыДисконтирования = ДокументыДляДисконтирования.Найти(ТипЗнч(Документ.СторнируемыйДокумент)) <> Неопределено;
	Иначе
		ТребуютсяДвиженияПроцентныеРасходыДисконтирования = ТипЗнч(Документ) = Тип("ДокументОбъект.ВводОстатковВзаиморасчетов");
	КонецЕсли;
	
	// Проведение
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОплат);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОтгрузок);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланПоставок);
		
		Если ТребуютсяДвиженияПроцентныеРасходыДисконтирования Тогда
			Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ПроцентныеРасходыДисконтирования);
		КонецЕсли;
		
	КонецЕсли;
	
	// Контроль
	Если Свойства.РежимЗаписи <> РежимЗаписиДокумента.Запись Тогда
		
		Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами);
		Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками);
		Если ТребуютсяДвиженияПроцентныеРасходыДисконтирования Тогда
			Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.ПроцентныеРасходыДисконтирования);
		КонецЕсли;
		
		Параметры.КонтрольныеРегистрыЗаданий.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами);
		Параметры.КонтрольныеРегистрыЗаданий.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками);
		Параметры.КонтрольныеРегистрыЗаданий.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоДокументам);
		Параметры.КонтрольныеРегистрыЗаданий.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоДокументам);
		Если ТребуютсяДвиженияПроцентныеРасходыДисконтирования Тогда
			Параметры.КонтрольныеРегистрыЗаданий.Добавить(Метаданные.РегистрыНакопления.ПроцентныеРасходыДисконтирования);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Возвращает тексты запросов для сторнирования движений при исправлении документов
// 
// Параметры:
// 	МетаданныеДокумента - ОбъектМетаданныхДокумент - Метаданные документа, который проводится.
// 
// Возвращаемое значение:
// 	Соответствие Из КлючИЗначение - Содержит тексты запросов сторнирования, где:
// 		* Ключ - Строка - Полное имя регистра.
// 		* Значение - Строка - Текст запроса.
//
Функция ТекстыЗапросовСторнирования(МетаданныеДокумента) Экспорт
	
	ДвиженияДокумента = МетаданныеДокумента.Движения;
	ТекстыЗапросов = Новый Соответствие();
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.РасчетыСКлиентами;
	ДвиженияДокумента = МетаданныеДокумента.Движения;
	
	Если ДвиженияДокумента.Содержит(МетаданныеРегистра) Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ДокументыСторно.Ссылка КАК Регистратор,
		|	ДокументыСторно.Дата   КАК Период,
		|	ДокументыСторно.Дата   КАК ДатаРегистратора,
		|	ДокументыСторно.Номер  КАК НомерРегистратора,
		|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
		|	&ПоляВыборки,
		|	ИСТИНА КАК Сторно,
		|	ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка) КАК КорОбъектРасчетов,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) КАК КорАналитикаУчетаПоПартнерам,
		|	ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка) КАК ОбъектРасчетовПриемник,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) КАК АналитикаУчетаПоПартнерамПриемник,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаПриемник,
		|	0 КАК СуммаПриемник,
		|	ЛОЖЬ КАК ПоДаннымОбъектаРасчетовИсточника,
		|	УникальныйИдентификатор(ДокументыСторно.Ссылка) КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВосстановлениеДолгаАвансаПриСторноВзаиморасчетов) КАК НастройкаХозяйственнойОперации,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВосстановлениеДолгаАвансаПриСторноВзаиморасчетов) КАК ХозяйственнаяОперация,
		|	ВЫБОР КОГДА ДанныеРегистра.Сумма <> 0
		|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаЗадолженности)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПустаяСсылка)
		|	КОНЕЦ КАК ОперацияВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК ДанныеРегистра
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		&ИмяДокумента КАК ДокументыСторно
		|	ПО
		|		ДанныеРегистра.Регистратор = ДокументыСторно.СторнируемыйДокумент
		|		И ДокументыСторно.Ссылка В (&Ссылка)
		|ГДЕ
		|	НЕ ДанныеРегистра.Сторно
		|";
		
		МассивПолейВыборки = Новый Массив;
		
		Исключения = Новый Массив;
		
		Исключения.Добавить(МетаданныеРегистра.СтандартныеРеквизиты.Активность.Имя);
		Исключения.Добавить(МетаданныеРегистра.СтандартныеРеквизиты.НомерСтроки.Имя);
		Исключения.Добавить(МетаданныеРегистра.СтандартныеРеквизиты.Регистратор.Имя);
		Исключения.Добавить(МетаданныеРегистра.СтандартныеРеквизиты.Период.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.Сторно.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.СвязанныйДокумент.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ДатаРегистратора.Имя);
		
		// Переносы между объектами расчетов не нужны в сторно записях.
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.КорОбъектРасчетов.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.КорАналитикаУчетаПоПартнерам.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ОбъектРасчетовПриемник.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.АналитикаУчетаПоПартнерамПриемник.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ВалютаПриемник.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.СуммаПриемник.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ПоДаннымОбъектаРасчетовИсточника.Имя);
		
		// Используются в распределении взаиморасчетов, исходные для движений сторно сохраняются
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ИдентификаторФинЗаписи.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.НастройкаХозяйственнойОперации.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ХозяйственнаяОперация.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ОперацияВзаиморасчетов.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.КурсЧислительВалютыВзаиморасчетов.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.КурсЗнаменательВалютыВзаиморасчетов.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.КурсЧислительВалютыУпр.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.КурсЗнаменательВалютыУпр.Имя);
		
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(МетаданныеРегистра.СтандартныеРеквизиты, 
			МассивПолейВыборки,
			Исключения);
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(МетаданныеРегистра.Измерения, 
			МассивПолейВыборки,
			Исключения);
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(МетаданныеРегистра.Ресурсы, 
			МассивПолейВыборки,
			Исключения,
			Истина);
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(МетаданныеРегистра.Реквизиты, 
			МассивПолейВыборки,
			Исключения,
			Истина);
		
		НеИнвертируемыеРеквизиты = Новый Массив;
		НеИнвертируемыеРеквизиты.Добавить(МетаданныеРегистра.Реквизиты.КурсЧислительВалютыВзаиморасчетов);
		НеИнвертируемыеРеквизиты.Добавить(МетаданныеРегистра.Реквизиты.КурсЗнаменательВалютыВзаиморасчетов);
		НеИнвертируемыеРеквизиты.Добавить(МетаданныеРегистра.Реквизиты.КурсЧислительВалютыУпр);
		НеИнвертируемыеРеквизиты.Добавить(МетаданныеРегистра.Реквизиты.КурсЗнаменательВалютыУпр);
		
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(НеИнвертируемыеРеквизиты, 
			МассивПолейВыборки,
			Новый Массив);
		
		ТекстПоляВыборки= СтрСоединить(МассивПолейВыборки,"," + Символы.ПС);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыборки", ТекстПоляВыборки);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяДокумента", МетаданныеДокумента.ПолноеИмя());
		ТекстыЗапросов.Вставить(МетаданныеРегистра.ПолноеИмя(), ТекстЗапроса);
		
	КонецЕсли;
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.РасчетыСПоставщиками;
	Если ДвиженияДокумента.Содержит(МетаданныеРегистра) Тогда
		ШаблонЗапроса = "
		|ВЫБРАТЬ
		|	ДокументыСторно.Ссылка КАК Регистратор,
		|	ДокументыСторно.Дата   КАК Период,
		|	ДокументыСторно.Дата   КАК ДатаРегистратора,
		|	ДокументыСторно.Номер  КАК НомерРегистратора,
		|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
		|	&ПоляВыборки,
		|	ДокументыСторно.СторнируемыйДокумент КАК СвязанныйДокумент,
		|	ИСТИНА КАК Сторно,
		|	ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка) КАК КорОбъектРасчетов,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) КАК КорАналитикаУчетаПоПартнерам,
		|	ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка) КАК ОбъектРасчетовПриемник,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) КАК АналитикаУчетаПоПартнерамПриемник,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаПриемник,
		|	0 КАК СуммаПриемник,
		|	ЛОЖЬ КАК ПоДаннымОбъектаРасчетовИсточника,
		|	УникальныйИдентификатор(ДокументыСторно.Ссылка) КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВосстановлениеДолгаАвансаПриСторноВзаиморасчетов) КАК НастройкаХозяйственнойОперации,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВосстановлениеДолгаАвансаПриСторноВзаиморасчетов) КАК ХозяйственнаяОперация,
		|	ВЫБОР КОГДА ДанныеРегистра.Сумма <> 0
		|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.КорректировкаЗадолженности)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.ПустаяСсылка)
		|	КОНЕЦ КАК ОперацияВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками КАК ДанныеРегистра
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		&ИмяДокумента КАК ДокументыСторно
		|	ПО
		|		ДанныеРегистра.Регистратор = ДокументыСторно.СторнируемыйДокумент
		|		И ДокументыСторно.Ссылка В (&Ссылка)
		|ГДЕ
		|	НЕ ДанныеРегистра.Сторно
		|";
		
		МассивПолейВыборки = Новый Массив;
		
		Исключения = Новый Массив;
		Исключения.Добавить(МетаданныеРегистра.СтандартныеРеквизиты.Активность.Имя);
		Исключения.Добавить(МетаданныеРегистра.СтандартныеРеквизиты.НомерСтроки.Имя);
		Исключения.Добавить(МетаданныеРегистра.СтандартныеРеквизиты.Регистратор.Имя);
		Исключения.Добавить(МетаданныеРегистра.СтандартныеРеквизиты.Период.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.Сторно.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.СвязанныйДокумент.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ДатаРегистратора.Имя);
		
		// Переносы между объектами расчетов не нужны в сторно записях.
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.КорОбъектРасчетов.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.КорАналитикаУчетаПоПартнерам.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ОбъектРасчетовПриемник.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.АналитикаУчетаПоПартнерамПриемник.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ВалютаПриемник.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.СуммаПриемник.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ПоДаннымОбъектаРасчетовИсточника.Имя);
		
		// Используются в распределении взаиморасчетов, исходные для движений сторно сохраняются
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ИдентификаторФинЗаписи.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.НастройкаХозяйственнойОперации.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ХозяйственнаяОперация.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ОперацияВзаиморасчетов.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.КурсЧислительВалютыВзаиморасчетов.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.КурсЗнаменательВалютыВзаиморасчетов.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.КурсЧислительВалютыУпр.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.КурсЗнаменательВалютыУпр.Имя);
		
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(МетаданныеРегистра.СтандартныеРеквизиты, 
			МассивПолейВыборки,
			Исключения);
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(МетаданныеРегистра.Измерения, 
			МассивПолейВыборки,
			Исключения);
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(МетаданныеРегистра.Ресурсы, 
			МассивПолейВыборки,
			Исключения,
			Истина);
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(МетаданныеРегистра.Реквизиты, 
			МассивПолейВыборки,
			Исключения,
			Истина);
		
		НеИнвертируемыеРеквизиты = Новый Массив;
		НеИнвертируемыеРеквизиты.Добавить(МетаданныеРегистра.Реквизиты.КурсЧислительВалютыВзаиморасчетов);
		НеИнвертируемыеРеквизиты.Добавить(МетаданныеРегистра.Реквизиты.КурсЗнаменательВалютыВзаиморасчетов);
		НеИнвертируемыеРеквизиты.Добавить(МетаданныеРегистра.Реквизиты.КурсЧислительВалютыУпр);
		НеИнвертируемыеРеквизиты.Добавить(МетаданныеРегистра.Реквизиты.КурсЗнаменательВалютыУпр);
		
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(НеИнвертируемыеРеквизиты, 
			МассивПолейВыборки,
			Новый Массив);
		
		ТекстПоляВыборки= СтрСоединить(МассивПолейВыборки,"," + Символы.ПС);
		ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ПоляВыборки", ТекстПоляВыборки);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяДокумента", МетаданныеДокумента.ПолноеИмя());
		ТекстыЗапросов.Вставить(МетаданныеРегистра.ПолноеИмя(), ТекстЗапроса);
	КонецЕсли;
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.ПроцентныеРасходыДисконтирования;
	Если ДвиженияДокумента.Содержит(МетаданныеРегистра) Тогда
		ШаблонЗапроса = "
		|ВЫБРАТЬ
		|	ДокументыСторно.Ссылка КАК Регистратор,
		|	ДокументыСторно.Дата   КАК Период,
		|	ДокументыСторно.Дата   КАК ДатаРегистратора,
		|	ДокументыСторно.Номер  КАК НомерРегистратора,
		|	&ПоляВыборки,
		|	ДокументыСторно.СторнируемыйДокумент КАК СвязанныйДокумент,
		|	ИСТИНА КАК Сторно
		|ИЗ
		|	РегистрНакопления.ПроцентныеРасходыДисконтирования КАК ДанныеРегистра
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		&ИмяДокумента КАК ДокументыСторно
		|	ПО
		|		ДанныеРегистра.Регистратор = ДокументыСторно.СторнируемыйДокумент
		|		И ДокументыСторно.Ссылка В (&Ссылка)
		|ГДЕ
		|	НЕ ДанныеРегистра.Сторно
		|";
		
		МассивПолейВыборки = Новый Массив;
		
		Исключения = Новый Массив;
		Исключения.Добавить(МетаданныеРегистра.СтандартныеРеквизиты.Активность.Имя);
		Исключения.Добавить(МетаданныеРегистра.СтандартныеРеквизиты.НомерСтроки.Имя);
		Исключения.Добавить(МетаданныеРегистра.СтандартныеРеквизиты.Регистратор.Имя);
		Исключения.Добавить(МетаданныеРегистра.СтандартныеРеквизиты.Период.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.Сторно.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.СтавкаДисконтирования.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ФактическаяЗадолженностьБезНДС.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ДисконтированнаяЗадолженностьБезНДС.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.РассчитанныйОстатокПроцентов.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ФактическаяЗадолженностьБезНДСРегл.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ДисконтированнаяЗадолженностьБезНДСРегл.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.РассчитанныйОстатокПроцентовРегл.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ФактическаяЗадолженностьБезНДСУпр.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.ДисконтированнаяЗадолженностьБезНДСУпр.Имя);
		Исключения.Добавить(МетаданныеРегистра.Реквизиты.РассчитанныйОстатокПроцентовУпр.Имя);
		
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(МетаданныеРегистра.СтандартныеРеквизиты, 
			МассивПолейВыборки,
			Исключения);
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(МетаданныеРегистра.Измерения, 
			МассивПолейВыборки,
			Исключения);
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(МетаданныеРегистра.Ресурсы, 
			МассивПолейВыборки,
			Исключения,
			Истина);
		ПроведениеДокументов.ДобавитьПоляВыборкиСторнирующегоЗапроса(МетаданныеРегистра.Реквизиты, 
			МассивПолейВыборки,
			Исключения,
			Истина);
			
		ТекстПоляВыборки= СтрСоединить(МассивПолейВыборки,"," + Символы.ПС);
		ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ПоляВыборки", ТекстПоляВыборки);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяДокумента", МетаданныеДокумента.ПолноеИмя());
		ТекстыЗапросов.Вставить(МетаданныеРегистра.ПолноеИмя(), ТекстЗапроса);
	КонецЕсли;
	
	Возврат ТекстыЗапросов;
	
КонецФункции

// Дополняет текст запроса механизма проверки даты запрета по таблице изменений.
// 
// Параметры:
// 	Запрос - Запрос - используется для установки параметров запроса.
// 
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение:
//		* Ключ - Строка - Имя временной таблицы изменений регистра.
//		* Значение - Строка - Текст запроса.
//	
Функция ТекстыЗапросовКонтрольДатыЗапретаПоТаблицеИзменений(Запрос) Экспорт

	СоответствиеТекстовЗапросов = Новый Соответствие();
	Возврат СоответствиеТекстовЗапросов;
	
КонецФункции

// Процедура формирования движений по подчиненным регистрам взаиморасчетов.
//
// Параметры:
//   ТаблицыДляДвижений - Структура - таблицы данных документа
//   Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//   Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НоваяАрхитектураВзаиморасчетов = Константы.НоваяАрхитектураВзаиморасчетов.Получить();
	ИмяРасчетыСКлиентами = Метаданные.РегистрыНакопления.РасчетыСКлиентами.Имя;
	ИмяРасчетыСПоставщиками = Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Имя;
	
	МассивДоговоров = Новый Массив();
	
	// Заполнение аналитики вынесено вперед
	// потому что для проверки приемников при проведении документа взаимозачета задолженности
	// между двумя организациями и одним контрагентом требуются обе таблицы расчетов
	// т.к. приемник задолженности может быть в другом регистре
	ТаблицаРасчетыСКлиентами = Неопределено;
	ТаблицыДляДвижений.Свойство("Таблица" + "РасчетыСКлиентами", ТаблицаРасчетыСКлиентами);
	Если ЗначениеЗаполнено(ТаблицаРасчетыСКлиентами) Тогда
		ПроверитьОбъектыРасчетовНабора(ТаблицаРасчетыСКлиентами,Отказ,Истина);
		ПроверитьЗаполнитьАналитикуУчетаПоПартнерам(ТаблицаРасчетыСКлиентами);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивДоговоров, ТаблицаРасчетыСКлиентами.ВыгрузитьКолонку("Договор"));
	КонецЕсли;
	Если ТаблицаРасчетыСКлиентами <> Неопределено И ТаблицаРасчетыСКлиентами.Колонки.Найти("Сторно") = Неопределено Тогда
		ТаблицаРасчетыСКлиентами.Колонки.Добавить("Сторно", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	ТаблицаРасчетыСПоставщиками = Неопределено;
	ТаблицыДляДвижений.Свойство("Таблица" + "РасчетыСПоставщиками", ТаблицаРасчетыСПоставщиками);
	Если ЗначениеЗаполнено(ТаблицаРасчетыСПоставщиками) Тогда
		ПроверитьОбъектыРасчетовНабора(ТаблицаРасчетыСПоставщиками, Отказ, Ложь);
		ПроверитьЗаполнитьАналитикуУчетаПоПартнерам(ТаблицаРасчетыСПоставщиками);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивДоговоров, ТаблицаРасчетыСПоставщиками.ВыгрузитьКолонку("Договор")); 
	КонецЕсли;
	Если ТаблицаРасчетыСПоставщиками <> Неопределено И ТаблицаРасчетыСПоставщиками.Колонки.Найти("Сторно") = Неопределено Тогда
		ТаблицаРасчетыСПоставщиками.Колонки.Добавить("Сторно", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	МассивДоговоров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивДоговоров);
	ПорядкиЗачетаОплатНакладныхДоговоров = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивДоговоров, "ПорядокЗачетаОплатНакладных");
	
	#Область РасчетыСКлиентами
	
	Если ЗначениеЗаполнено(ТаблицаРасчетыСКлиентами) Тогда
		
			ТипДокумента = ТипЗнч(Движения.РасчетыСКлиентами.Отбор.Регистратор.Значение);
			ДобавитьЗаполнитьПорядокОперации(ТаблицаРасчетыСКлиентами, ТипДокумента, ПорядкиЗачетаОплатНакладныхДоговоров);
			
			ТаблицаПриемников = Новый ТаблицаЗначений;
			ТаблицаПриемников.Колонки.Добавить("АналитикаУчетаПоПартнерамПриемник", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам"));
			ТаблицаПриемников.Колонки.Добавить("ОбъектРасчетовПриемник", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
			ТаблицаПриемников.Колонки.Добавить("ВалютаПриемник", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
			ТаблицаПриемников.Колонки.Добавить("Сторно", Новый ОписаниеТипов("Булево"));
			
			ПроверятьТипЗаказа =  ТаблицаРасчетыСКлиентами.Колонки.Найти("ПродажаПоЗаказу") <> Неопределено;
			ПроверятьСвязиИсточниковПриемников = ТаблицаРасчетыСКлиентами.Колонки.Найти("ОбъектРасчетовПриемник") <> Неопределено;
			
			Для Каждого Стр Из ТаблицаРасчетыСКлиентами Цикл
				Если ПроверятьТипЗаказа И НЕ ЗначениеЗаполнено(Стр.ПродажаПоЗаказу) И Стр.ПродажаПоЗаказу <> Неопределено Тогда
					Стр.ПродажаПоЗаказу = Неопределено;
				КонецЕсли;
				
				Если Стр.Сторно = Неопределено Тогда
					Стр.Сторно = Ложь;
				КонецЕсли;
				Если ПроверятьСвязиИсточниковПриемников Тогда
					Если НоваяАрхитектураВзаиморасчетов Тогда
						ПоДаннымОбъектаРасчетовИсточника = ?(Стр.ПоДаннымОбъектаРасчетовИсточника = Неопределено,Ложь,Стр.ПоДаннымОбъектаРасчетовИсточника);
						ВсеПоляПриемниковЗаполнены = ЗначениеЗаполнено(Стр.ОбъектРасчетовПриемник)
							+ ЗначениеЗаполнено(Стр.АналитикаУчетаПоПартнерамПриемник)
							+ ЗначениеЗаполнено(Стр.ВалютаПриемник)
							+ (ЗначениеЗаполнено(Стр.СуммаПриемник) И ЗначениеЗаполнено(Стр.Сумма));
						Если НЕ ПоДаннымОбъектаРасчетовИсточника И ВсеПоляПриемниковЗаполнены <> 4 И ВсеПоляПриемниковЗаполнены <> 0 Тогда
							ВызватьИсключение(СтрШаблон(НСтр("ru = 'Не полностью заполнена аналитика или сумма приемника в движениях по %1'"),
														ИмяРасчетыСКлиентами));
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если ПроверятьСвязиИсточниковПриемников И ЗначениеЗаполнено(Стр.ОбъектРасчетовПриемник) Тогда
					ЗаполнитьЗначенияСвойств(ТаблицаПриемников.Добавить(),Новый Структура("ОбъектРасчетовПриемник, АналитикаУчетаПоПартнерамПриемник, ВалютаПриемник, Сторно",
							Стр.ОбъектРасчетовПриемник, Стр.АналитикаУчетаПоПартнерамПриемник, Стр.ВалютаПриемник, Стр.Сторно));
				КонецЕсли;
			КонецЦикла;
			
			Если ТаблицаПриемников.Количество() > 0 Тогда
				ТаблицаПриемников.Свернуть("ОбъектРасчетовПриемник, АналитикаУчетаПоПартнерамПриемник, ВалютаПриемник, Сторно");
				ТаблицаРасчетыСКлиентами.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта,Сторно");
				СтруктураПоиска = Новый Структура("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта,ПоДаннымОбъектаРасчетовИсточника,Сторно");
				Для Каждого Стр Из ТаблицаПриемников Цикл
					СтруктураПоиска.АналитикаУчетаПоПартнерам = Стр.АналитикаУчетаПоПартнерамПриемник;
					СтруктураПоиска.ОбъектРасчетов = Стр.ОбъектРасчетовПриемник;
					СтруктураПоиска.Валюта = Стр.ВалютаПриемник;
					СтруктураПоиска.Сторно = Стр.Сторно;
					СтруктураПоиска.ПоДаннымОбъектаРасчетовИсточника = Истина;
					
					ЕстьВКлиентах = ТаблицаРасчетыСКлиентами.НайтиСтроки(СтруктураПоиска).Количество() > 0;
					ЕстьВПоставщиках = ТаблицаРасчетыСПоставщиками <> Неопределено
										И ТаблицаРасчетыСПоставщиками.НайтиСтроки(СтруктураПоиска).Количество() > 0;
					Если НЕ (ЕстьВКлиентах ИЛИ ЕстьВПоставщиках) Тогда
						Если ТаблицаРасчетыСПоставщиками <> Неопределено Тогда
							ВызватьИсключение(СтрШаблон(НСтр("ru = 'Не найдены движения приемника в движениях по %1 и %2'"),
												ИмяРасчетыСКлиентами,
												ИмяРасчетыСПоставщиками));
						Иначе
							ВызватьИсключение(СтрШаблон(НСтр("ru = 'Не найдены движения приемника в движениях по %1'"),
												ИмяРасчетыСКлиентами));
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Движения.РасчетыСКлиентами.Записывать = Истина;
			Движения.РасчетыСКлиентами.Загрузить(ТаблицаРасчетыСКлиентами);
	КонецЕсли;
	
	Если Движения.Найти("РасчетыСКлиентами") <> Неопределено
		И Движения.РасчетыСКлиентами.Записывать
		И Не ЗначениеЗаполнено(ТаблицаРасчетыСКлиентами) Тогда
		Движения.РасчетыСКлиентамиПоДокументам.Записывать = Истина;
	КонецЕсли;
	
	#КонецОбласти
	
	#Область РасчетыСКлиентамиПланОплат
	
	ИмяТаблицыРасчетыСКлиентамиПланОплат = "Таблица" + "РасчетыСКлиентамиПланОплат";
	Если ТаблицыДляДвижений.Свойство(ИмяТаблицыРасчетыСКлиентамиПланОплат) Тогда
		
		ТаблицаРасчетыСКлиентамиПланОплат = ТаблицыДляДвижений[ИмяТаблицыРасчетыСКлиентамиПланОплат];

		Если ЗначениеЗаполнено(ТаблицаРасчетыСКлиентамиПланОплат) Тогда
		
			ТипДокумента = ТипЗнч(Движения.РасчетыСКлиентамиПланОплат.Отбор.Регистратор.Значение);
			ДобавитьЗаполнитьПорядокОперации(ТаблицаРасчетыСКлиентамиПланОплат, ТипДокумента, ПорядкиЗачетаОплатНакладныхДоговоров);
			ПроверитьЗаполнитьАналитикуУчетаПоПартнерам(ТаблицаРасчетыСКлиентамиПланОплат);
			
			Движения.РасчетыСКлиентамиПланОплат.Записывать = Истина;
			Движения.РасчетыСКлиентамиПланОплат.Загрузить(ТаблицаРасчетыСКлиентамиПланОплат);
			
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область РасчетыСКлиентамиПланОтгрузок
	
	ИмяТаблицыРасчетыСКлиентамиПланОтгрузок = "Таблица" + "РасчетыСКлиентамиПланОтгрузок";
	Если ТаблицыДляДвижений.Свойство(ИмяТаблицыРасчетыСКлиентамиПланОтгрузок) Тогда
		
		ТаблицаРасчетыСКлиентамиПланОтгрузок = ТаблицыДляДвижений[ИмяТаблицыРасчетыСКлиентамиПланОтгрузок];

		Если ЗначениеЗаполнено(ТаблицаРасчетыСКлиентамиПланОтгрузок) Тогда
		
			ТипДокумента = ТипЗнч(Движения.РасчетыСКлиентамиПланОтгрузок.Отбор.Регистратор.Значение);
			ДобавитьЗаполнитьПорядокОперации(ТаблицаРасчетыСКлиентамиПланОтгрузок, ТипДокумента, ПорядкиЗачетаОплатНакладныхДоговоров);
			ПроверитьЗаполнитьАналитикуУчетаПоПартнерам(ТаблицаРасчетыСКлиентамиПланОтгрузок);
			
			Движения.РасчетыСКлиентамиПланОтгрузок.Записывать = Истина;
			Движения.РасчетыСКлиентамиПланОтгрузок.Загрузить(ТаблицаРасчетыСКлиентамиПланОтгрузок);
			
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область РасчетыСПоставщиками
	
	Если ЗначениеЗаполнено(ТаблицаРасчетыСПоставщиками) Тогда
		
			ТипДокумента = ТипЗнч(Движения.РасчетыСПоставщиками.Отбор.Регистратор.Значение);
			ДобавитьЗаполнитьПорядокОперации(ТаблицаРасчетыСПоставщиками, ТипДокумента, ПорядкиЗачетаОплатНакладныхДоговоров);
			
			ТаблицаПриемников = Новый ТаблицаЗначений;
			ТаблицаПриемников.Колонки.Добавить("АналитикаУчетаПоПартнерамПриемник", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам"));
			ТаблицаПриемников.Колонки.Добавить("ОбъектРасчетовПриемник", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
			ТаблицаПриемников.Колонки.Добавить("ВалютаПриемник", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
			ТаблицаПриемников.Колонки.Добавить("Сторно", Новый ОписаниеТипов("Булево"));
			
			ПроверятьТипЗаказа =  ТаблицаРасчетыСПоставщиками.Колонки.Найти("ЗакупкаПоЗаказу") <> Неопределено;
			ПроверятьСвязиИсточниковПриемников = ТаблицаРасчетыСПоставщиками.Колонки.Найти("ОбъектРасчетовПриемник") <> Неопределено;
			
			Для Каждого Стр Из ТаблицаРасчетыСПоставщиками Цикл
				Если ПроверятьТипЗаказа И НЕ ЗначениеЗаполнено(Стр.ЗакупкаПоЗаказу) И Стр.ЗакупкаПоЗаказу <> Неопределено Тогда
					Стр.ЗакупкаПоЗаказу = Неопределено;
				КонецЕсли;
				
				Если Стр.Сторно = Неопределено Тогда
					Стр.Сторно = Ложь;
				КонецЕсли;
				Если ПроверятьСвязиИсточниковПриемников Тогда
					Если НоваяАрхитектураВзаиморасчетов Тогда
						ПоДаннымОбъектаРасчетовИсточника = ?(Стр.ПоДаннымОбъектаРасчетовИсточника = Неопределено,Ложь,Стр.ПоДаннымОбъектаРасчетовИсточника);
						ВсеПоляПриемниковЗаполнены = ЗначениеЗаполнено(Стр.ОбъектРасчетовПриемник)
							+ ЗначениеЗаполнено(Стр.АналитикаУчетаПоПартнерамПриемник)
							+ ЗначениеЗаполнено(Стр.ВалютаПриемник)
							+ (ЗначениеЗаполнено(Стр.СуммаПриемник) И ЗначениеЗаполнено(Стр.Сумма));
						Если НЕ ПоДаннымОбъектаРасчетовИсточника И ВсеПоляПриемниковЗаполнены <> 4 И ВсеПоляПриемниковЗаполнены <> 0 Тогда
							ВызватьИсключение(СтрШаблон(НСтр("ru = 'Не полностью заполнена аналитика или сумма приемника в движениях по %1'"),
														ИмяРасчетыСПоставщиками));
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если ПроверятьСвязиИсточниковПриемников И ЗначениеЗаполнено(Стр.ОбъектРасчетовПриемник) Тогда
					ЗаполнитьЗначенияСвойств(ТаблицаПриемников.Добавить(),Новый Структура("ОбъектРасчетовПриемник, АналитикаУчетаПоПартнерамПриемник, ВалютаПриемник, Сторно",
						Стр.ОбъектРасчетовПриемник, Стр.АналитикаУчетаПоПартнерамПриемник, Стр.ВалютаПриемник, Стр.Сторно));
				КонецЕсли;
			КонецЦикла;
			
			Если ТаблицаПриемников.Количество() > 0 Тогда
				ТаблицаПриемников.Свернуть("ОбъектРасчетовПриемник, АналитикаУчетаПоПартнерамПриемник, ВалютаПриемник, Сторно");
				ТаблицаРасчетыСПоставщиками.Индексы.Добавить("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта,Сторно");
				СтруктураПоиска = Новый Структура("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта,ПоДаннымОбъектаРасчетовИсточника,Сторно");
				Для Каждого Стр Из ТаблицаПриемников Цикл
					СтруктураПоиска.АналитикаУчетаПоПартнерам = Стр.АналитикаУчетаПоПартнерамПриемник;
					СтруктураПоиска.ОбъектРасчетов = Стр.ОбъектРасчетовПриемник;
					СтруктураПоиска.Валюта = Стр.ВалютаПриемник;
					СтруктураПоиска.Сторно = Стр.Сторно;
					СтруктураПоиска.ПоДаннымОбъектаРасчетовИсточника = Истина;
					
					ЕстьВПоставщиках = ТаблицаРасчетыСПоставщиками.НайтиСтроки(СтруктураПоиска).Количество() > 0;
					ЕстьВКлиентах = ТаблицаРасчетыСКлиентами <> Неопределено
										И ТаблицаРасчетыСКлиентами.НайтиСтроки(СтруктураПоиска).Количество() > 0;
					Если НЕ (ЕстьВКлиентах ИЛИ ЕстьВПоставщиках) Тогда
						Если ТаблицаРасчетыСКлиентами <> Неопределено Тогда
							ВызватьИсключение(СтрШаблон(НСтр("ru = 'Не найдены движения приемника в движениях по %1 и %2'"),
												ИмяРасчетыСКлиентами,
												ИмяРасчетыСПоставщиками));
						Иначе
							ВызватьИсключение(СтрШаблон(НСтр("ru = 'Не найдены движения приемника в движениях по %1'"),
												ИмяРасчетыСПоставщиками));
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			Движения.РасчетыСПоставщиками.Записывать = Истина;
			Движения.РасчетыСПоставщиками.Загрузить(ТаблицаРасчетыСПоставщиками);
	КонецЕсли;
	
	Если Движения.Найти("РасчетыСПоставщиками") <> Неопределено
		И Движения.РасчетыСПоставщиками.Записывать
		И Не ЗначениеЗаполнено(ТаблицаРасчетыСПоставщиками) Тогда
		Движения.РасчетыСПоставщикамиПоДокументам.Записывать = Истина;
	КонецЕсли;
	
	#КонецОбласти
	
	#Область РасчетыСПоставщикамиПланОплат
	
	ИмяТаблицыРасчетыСПоставщикамиПланОплат = "Таблица" + "РасчетыСПоставщикамиПланОплат";
	Если ТаблицыДляДвижений.Свойство(ИмяТаблицыРасчетыСПоставщикамиПланОплат) Тогда
		
		ТаблицаРасчетыСПоставщикамиПланОплат = ТаблицыДляДвижений[ИмяТаблицыРасчетыСПоставщикамиПланОплат];

		Если ЗначениеЗаполнено(ТаблицаРасчетыСПоставщикамиПланОплат) Тогда
		
			ТипДокумента = ТипЗнч(Движения.РасчетыСПоставщикамиПланОплат.Отбор.Регистратор.Значение);
			ДобавитьЗаполнитьПорядокОперации(ТаблицаРасчетыСПоставщикамиПланОплат, ТипДокумента, ПорядкиЗачетаОплатНакладныхДоговоров);
			ПроверитьЗаполнитьАналитикуУчетаПоПартнерам(ТаблицаРасчетыСПоставщикамиПланОплат);
			
			Движения.РасчетыСПоставщикамиПланОплат.Записывать = Истина;
			Движения.РасчетыСПоставщикамиПланОплат.Загрузить(ТаблицаРасчетыСПоставщикамиПланОплат);
			
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область РасчетыСПоставщикамиПланПоставок
	
	ИмяТаблицыРасчетыСПоставщикамиПланПоставок = "Таблица" + "РасчетыСПоставщикамиПланПоставок";
	Если ТаблицыДляДвижений.Свойство(ИмяТаблицыРасчетыСПоставщикамиПланПоставок) Тогда
		
		ТаблицаРасчетыСПоставщикамиПланПоставок = ТаблицыДляДвижений[ИмяТаблицыРасчетыСПоставщикамиПланПоставок];

		Если ЗначениеЗаполнено(ТаблицаРасчетыСПоставщикамиПланПоставок) Тогда
		
			ТипДокумента = ТипЗнч(Движения.РасчетыСПоставщикамиПланПоставок.Отбор.Регистратор.Значение);
			ДобавитьЗаполнитьПорядокОперации(ТаблицаРасчетыСПоставщикамиПланПоставок, ТипДокумента, ПорядкиЗачетаОплатНакладныхДоговоров);
			ПроверитьЗаполнитьАналитикуУчетаПоПартнерам(ТаблицаРасчетыСПоставщикамиПланПоставок);
			
			Движения.РасчетыСПоставщикамиПланПоставок.Записывать = Истина;
			Движения.РасчетыСПоставщикамиПланПоставок.Загрузить(ТаблицаРасчетыСПоставщикамиПланПоставок);
			
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область РасчетыПоДисконтированию
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "ПроцентныеРасходыДисконтирования");
	#КонецОбласти
	
КонецПроцедуры

// Формирует тексты запросов для контроля изменений записанных движений регистров.
//
// Параметры:
//  Запрос - Запрос - запрос, хранящий параметры используемые в списке запросов
//  ТекстыЗапроса - СписокЗначений - список текстов запросов и их имен.
//  Документ - ДокументОбъект - записываемый документ.
//
Процедура ИнициализироватьДанныеКонтроляИзменений(Запрос, ТекстыЗапроса, Документ) Экспорт
	
	#Область РасчетыСКлиентами
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияРасчетыСКлиентамиИзменение") Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	ТаблицаЗаказы.ОбъектРасчетов КАК ОбъектРасчетов,
			|	ТаблицаЗаказы.Валюта         КАК Валюта,
			|	СУММА(ВЫБОР
			|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|				И ТаблицаЗаказы.ОбъектРасчетов.Объект = ТаблицаЗаказы.Регистратор
			|				И НЕ ТаблицаЗаказы.ИсключатьПриКонтроле ТОГДА
			|				ТаблицаЗаказы.КОплате
			|			ИНАЧЕ 0
			|		КОНЕЦ)                 КАК СуммаЗаказа,
			|	СУММА(ВЫБОР
			|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|				ТОГДА ТаблицаЗаказы.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ +
			|		ВЫБОР
			|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|				ТОГДА -ТаблицаЗаказы.Оплачивается
			|			ИНАЧЕ ТаблицаЗаказы.Оплачивается
			|		КОНЕЦ)                 КАК СуммаОплаты
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентами КАК ТаблицаЗаказы
			|ГДЕ
			|	(ТаблицаЗаказы.ОбъектРасчетов, ТаблицаЗаказы.Валюта, ТаблицаЗаказы.Активность) В
			|			(ВЫБРАТЬ
			|				Таблица.ОбъектРасчетов,
			|				Таблица.Валюта,
			|				ИСТИНА
			|			ИЗ
			|				ДвиженияРасчетыСКлиентамиИзменение КАК Таблица)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаЗаказы.Валюта,
			|	ТаблицаЗаказы.ОбъектРасчетов
			|
			|ИМЕЮЩИЕ
			|	СУММА(ВЫБОР
			|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|				И ТаблицаЗаказы.ОбъектРасчетов.Объект = ТаблицаЗаказы.Регистратор
			|				И НЕ ТаблицаЗаказы.ИсключатьПриКонтроле ТОГДА
			|				ТаблицаЗаказы.КОплате
			|			ИНАЧЕ 0
			|		КОНЕЦ) > 0
			|	И
			|	СУММА(ВЫБОР
			|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|				И ТаблицаЗаказы.ОбъектРасчетов.Объект = ТаблицаЗаказы.Регистратор
			|				И НЕ ТаблицаЗаказы.ИсключатьПриКонтроле ТОГДА
			|				ТаблицаЗаказы.КОплате
			|			ИНАЧЕ 0
			|		КОНЕЦ)
			|	>
			|	СУММА(ВЫБОР
			|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|				ТОГДА ТаблицаЗаказы.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ +
			|		ВЫБОР
			|			КОГДА ТаблицаЗаказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|				ТОГДА -ТаблицаЗаказы.Оплачивается
			|			ИНАЧЕ ТаблицаЗаказы.Оплачивается
			|		КОНЕЦ)";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиРасчетыСКлиентами");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область СуммыСрокЗадолженности
		
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга")
		Или ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока") Тогда
		
		ТекстыЗапроса.Добавить(
			"ВЫБРАТЬ
			|	ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга.АналитикаУчетаПоПартнерам.Договор КАК Договор
			|ПОМЕСТИТЬ ДанныеДоговоровИзменениеСуммыДолга
			|ИЗ
			|	ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга КАК ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Договор");
		
		ТекстыЗапроса.Добавить(
			"ВЫБРАТЬ
			|	ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока.АналитикаУчетаПоПартнерам.Договор КАК Договор
			|ПОМЕСТИТЬ ДанныеДоговоровИзменениеКонтрольСрока
			|ИЗ
			|	ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока КАК ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Договор");
		
		ТекстыЗапроса.Добавить(
			"ВЫБРАТЬ
			|	ТаблицаДвижений.Договор                             КАК Договор,
			|	ДанныеДоговора.ВалютаВзаиморасчетов                 КАК Валюта,
			|	ДанныеДоговора.ОграничиватьСуммуЗадолженности       КАК ОграничиватьСуммуЗадолженности,
			|	ДанныеДоговора.ДопустимаяСуммаЗадолженности         КАК ДопустимаяСуммаЗадолженности,
			|	ЛОЖЬ                                                КАК ЗапрещаетсяПросроченнаяЗадолженность
			|
			|ПОМЕСТИТЬ ДанныеДоговоровПредварительные
			|ИЗ
			|	ДанныеДоговоровИзменениеСуммыДолга КАК ТаблицаДвижений
			|	
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|		Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
			|	ПО
			|		ТаблицаДвижений.Договор = ДанныеДоговора.Ссылка
			|
			|ГДЕ
			|	ДанныеДоговора.ОграничиватьСуммуЗадолженности
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТаблицаДвижений.ОбъектРасчетов                      КАК Договор,
			|	ДанныеДоговора.ВалютаВзаиморасчетов                 КАК Валюта,
			|	ДанныеДоговора.ОграничиватьСуммуЗадолженности       КАК ОграничиватьСуммуЗадолженности,
			|	ДанныеДоговора.ДопустимаяСуммаЗадолженности         КАК ДопустимаяСуммаЗадолженности,
			|	ЛОЖЬ                                                КАК ЗапрещаетсяПросроченнаяЗадолженность
			|
			|ИЗ
			|	ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга КАК ТаблицаДвижений
			|	
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|		Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
			|	ПО
			|		ТаблицаДвижений.ОбъектРасчетов = ДанныеДоговора.Ссылка
			|
			|ГДЕ
			|	ДанныеДоговора.ОграничиватьСуммуЗадолженности
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТаблицаДвижений.Договор                             КАК Договор,
			|	ДанныеДоговора.ВалютаВзаиморасчетов                 КАК Валюта,
			|	ЛОЖЬ                                                КАК ОграничиватьСуммуЗадолженности,
			|	0                                                   КАК ДопустимаяСуммаЗадолженности,
			|	ДанныеДоговора.ЗапрещаетсяПросроченнаяЗадолженность КАК ЗапрещаетсяПросроченнаяЗадолженность
			|
			|ИЗ
			|	ДанныеДоговоровИзменениеКонтрольСрока КАК ТаблицаДвижений
			|	
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|		Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
			|	ПО
			|		ТаблицаДвижений.Договор = ДанныеДоговора.Ссылка
			|
			|ГДЕ
			|	ДанныеДоговора.ЗапрещаетсяПросроченнаяЗадолженность
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТаблицаДвижений.ОбъектРасчетов                      КАК Договор,
			|	ДанныеДоговора.ВалютаВзаиморасчетов                 КАК Валюта,
			|	ЛОЖЬ                                                КАК ОграничиватьСуммуЗадолженности,
			|	0                                                   КАК ДопустимаяСуммаЗадолженности,
			|	ДанныеДоговора.ЗапрещаетсяПросроченнаяЗадолженность КАК ЗапрещаетсяПросроченнаяЗадолженность
			|
			|ИЗ
			|	ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока КАК ТаблицаДвижений
			|	
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|		Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
			|	ПО
			|		ТаблицаДвижений.ОбъектРасчетов = ДанныеДоговора.Ссылка
			|
			|ГДЕ
			|	ДанныеДоговора.ЗапрещаетсяПросроченнаяЗадолженность");
		
		ТекстыЗапроса.Добавить(
			"ВЫБРАТЬ
			|	ДанныеДоговоров.Договор                                        КАК Договор,
			|	ДанныеДоговоров.Валюта                                         КАК Валюта,
			|	МАКСИМУМ(ДанныеДоговоров.ОграничиватьСуммуЗадолженности)       КАК КонтрольСуммы,
			|	МАКСИМУМ(ДанныеДоговоров.ДопустимаяСуммаЗадолженности)         КАК ДопустимаяСумма,
			|	МАКСИМУМ(ДанныеДоговоров.ЗапрещаетсяПросроченнаяЗадолженность) КАК КонтрольСрока
			|
			|ПОМЕСТИТЬ ДанныеДоговоров
			|ИЗ
			|	ДанныеДоговоровПредварительные КАК ДанныеДоговоров
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеДоговоров.Договор,
			|	ДанныеДоговоров.Валюта");
		
		ТекстыЗапроса.Добавить(
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики,
			|	ДанныеДоговоров.Договор            КАК Договор,
			|	ДанныеДоговоров.Валюта             КАК Валюта,
			|	ДанныеДоговоров.КонтрольСуммы      КАК КонтрольСуммы,
			|	ДанныеДоговоров.КонтрольСрока      КАК КонтрольСрока
			|
			|ПОМЕСТИТЬ ВтАналитикаПоПартнерам
			|ИЗ
			|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
			|	
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
			|	ПО
			|		АналитикаПоПартнерам.Договор = ДанныеДоговоров.Договор
			|");
			
			ТекстыЗапроса.Добавить("
			|ВЫБРАТЬ
			|	РасчетыСКлиентамиОстатки.ОбъектРасчетов           КАК ОбъектРасчетов,
			|	РасчетыСКлиентамиОстатки.Валюта                   КАК Валюта,
			|	РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток      КАК ОплачиваетсяОстаток
			|ПОМЕСТИТЬ ОстаткиОплачивается
			|ИЗ РегистрНакопления.РасчетыСКлиентами.Остатки(
			|		&ПериодКонтроляСрокаДолга,
			|		(АналитикаУчетаПоПартнерам, Валюта) В (ВЫБРАТЬ Т.КлючАналитики, Т.Валюта ИЗ ВтАналитикаПоПартнерам КАК Т ГДЕ Т.КонтрольСрока)
			|	) КАК РасчетыСКлиентамиОстатки
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектРасчетов,Валюта");
		
		Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга") Тогда
			
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	АналитикаПоПартнерам.Договор                              КАК Договор,
			|	РасчетыСКлиентамиОстатки.Валюта                           КАК Валюта,
			|	МИНИМУМ(ДанныеДоговоров.ДопустимаяСумма)                  КАК ДопустимаяСуммаЗадолженности,
			|	СУММА(РасчетыСКлиентамиОстатки.СуммаОстаток) +
			|		СУММА(РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток)    КАК СуммаОстаток,
			|
			|	СУММА(РасчетыСКлиентамиОстатки.СуммаОстаток) +
			|		СУММА(РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток) -
			|		МИНИМУМ(ДанныеДоговоров.ДопустимаяСумма)              КАК СуммаПревышения
			|
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентами.Остатки(
			|		,
			|		(АналитикаУчетаПоПартнерам, Валюта) В (ВЫБРАТЬ Т.КлючАналитики, Т.Валюта ИЗ ВтАналитикаПоПартнерам КАК Т ГДЕ Т.КонтрольСуммы)
			|	) КАК РасчетыСКлиентамиОстатки
			|	
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|		ВтАналитикаПоПартнерам КАК АналитикаПоПартнерам
			|	ПО
			|		РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
			|		И РасчетыСКлиентамиОстатки.Валюта = АналитикаПоПартнерам.Валюта
			|	
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|		ДанныеДоговоров КАК ДанныеДоговоров
			|	ПО
			|		АналитикаПоПартнерам.Договор = ДанныеДоговоров.Договор
			|		И АналитикаПоПартнерам.Валюта = ДанныеДоговоров.Валюта
			|
			|СГРУППИРОВАТЬ ПО
			|	АналитикаПоПартнерам.Договор,
			|	РасчетыСКлиентамиОстатки.Валюта
			|ИМЕЮЩИЕ
			|	СУММА(РасчетыСКлиентамиОстатки.СуммаОстаток)+
			|		СУММА(РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток) > МИНИМУМ(ДанныеДоговоров.ДопустимаяСумма)";
			
			ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиОграничениеСуммыЗадолженности");
			
		КонецЕсли;
		
		Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока") Тогда
			
			ТекстЗапроса =
				"ВЫБРАТЬ
				|	АналитикаПоПартнерам.Договор                              КАК Договор,
				|	РасчетыСКлиентамиОстатки.Валюта                           КАК Валюта,
				|	СУММА(ВЫБОР КОГДА РасчетыСКлиентамиОстатки.СуммаОстаток >
				|						РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток ТОГДА
				|		РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток
				|	ИНАЧЕ
				|		РасчетыСКлиентамиОстатки.СуммаОстаток
				|	КОНЕЦ) КАК ПросроченнаяЗадолженность
				|
				|ИЗ
				|	РегистрНакопления.РасчетыСКлиентами.Остатки(
				|		&ПериодКонтроляСрокаДолга,
				|		(АналитикаУчетаПоПартнерам, Валюта) В (ВЫБРАТЬ Т.КлючАналитики, Т.Валюта ИЗ ВтАналитикаПоПартнерам КАК Т ГДЕ Т.КонтрольСрока)
				|	) КАК РасчетыСКлиентамиОстатки
				|	
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				|		ВтАналитикаПоПартнерам КАК АналитикаПоПартнерам
				|	ПО
				|		РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
				|		И РасчетыСКлиентамиОстатки.Валюта = АналитикаПоПартнерам.Валюта
				|	
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				|		ДанныеДоговоров КАК ДанныеДоговоров
				|	ПО
				|		АналитикаПоПартнерам.Договор = ДанныеДоговоров.Договор
				|		И АналитикаПоПартнерам.Валюта = ДанныеДоговоров.Валюта
				|
				|ГДЕ
				|	НЕ &НоваяАрхитектураВзаиморасчетов
				|	И РасчетыСКлиентамиОстатки.СуммаОстаток > 0
				|	И (РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток) > 0
				|
				|СГРУППИРОВАТЬ ПО
				|	АналитикаПоПартнерам.Договор,
				|	РасчетыСКлиентамиОстатки.Валюта
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	АналитикаПоПартнерам.Договор                              КАК Договор,
				|	РасчетыСКлиентамиПоСрокамОстатки.Валюта                   КАК Валюта,
				|	СУММА(РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток 
				|			- ЕСТЬNULL(ОстаткиОплачивается.ОплачиваетсяОстаток,0)) КАК ПросроченнаяЗадолженность
				|
				|ИЗ
				|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
				|		&ПериодКонтроляСрокаДолга,
				|		(АналитикаУчетаПоПартнерам, Валюта) В (ВЫБРАТЬ Т.КлючАналитики, Т.Валюта ИЗ ВтАналитикаПоПартнерам КАК Т ГДЕ Т.КонтрольСрока)
				|		И ДатаПлановогоПогашения < НАЧАЛОПЕРИОДА(&ДеньКонтроляСрокаДолга,ДЕНЬ)
				|	) КАК РасчетыСКлиентамиПоСрокамОстатки
				|	
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				|		ВтАналитикаПоПартнерам КАК АналитикаПоПартнерам
				|	ПО
				|		РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики
				|		И РасчетыСКлиентамиПоСрокамОстатки.Валюта = АналитикаПоПартнерам.Валюта
				|	
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				|		ДанныеДоговоров КАК ДанныеДоговоров
				|	ПО
				|		АналитикаПоПартнерам.Договор = ДанныеДоговоров.Договор
				|		И АналитикаПоПартнерам.Валюта = ДанныеДоговоров.Валюта
				|
				|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиОплачивается КАК ОстаткиОплачивается
				|	ПО
				|		РасчетыСКлиентамиПоСрокамОстатки.ОбъектРасчетов = ОстаткиОплачивается.ОбъектРасчетов
				|		И РасчетыСКлиентамиПоСрокамОстатки.Валюта = ОстаткиОплачивается.Валюта
				|ГДЕ
				|	&НоваяАрхитектураВзаиморасчетов
				|
				|СГРУППИРОВАТЬ ПО
				|	АналитикаПоПартнерам.Договор,
				|	РасчетыСКлиентамиПоСрокамОстатки.Валюта
				|
				|ИМЕЮЩИЕ СУММА(РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток
				|			- ЕСТЬNULL(ОстаткиОплачивается.ОплачиваетсяОстаток,0)) > 0";
			
			Запрос.УстановитьПараметр("НоваяАрхитектураВзаиморасчетов", Константы.НоваяАрхитектураВзаиморасчетов.Получить());
			
			ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиКонтрольСрокаЗадолженности");
			
		КонецЕсли;
		
		ДеньКонтроляСрокаДолга = Макс(ТекущаяДатаСеанса(), Документ.Дата);
		Запрос.УстановитьПараметр("ПериодКонтроляСрокаДолга", Новый Граница(КонецДня(ДеньКонтроляСрокаДолга), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ДеньКонтроляСрокаДолга", ДеньКонтроляСрокаДолга);
		
	КонецЕсли;
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияРасчетыСКлиентамиИзменениеОплачивается") Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаОстатков.АналитикаУчетаПоПартнерам           КАК АналитикаУчетаПоПартнерам,
		|	ТаблицаОстатков.ОбъектРасчетов                      КАК ОбъектРасчетов,
		|	ТаблицаОстатков.Валюта                              КАК Валюта,
		|	ТаблицаОстатков.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	СУММА(ВЫБОР КОГДА ТаблицаОстатков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ТаблицаОстатков.Оплачивается
		|		ИНАЧЕ
		|			-ТаблицаОстатков.Оплачивается
		|		КОНЕЦ) КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК ТаблицаОстатков
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияРасчетыСКлиентамиИзменениеОплачивается КАК Таблица
		|	ПО Таблица.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		|		И Таблица.ОбъектРасчетов = ТаблицаОстатков.ОбъектРасчетов
		|		И Таблица.Валюта = ТаблицаОстатков.Валюта
		|		И Таблица.ЗаявкаНаРасходованиеДенежныхСредств = ТаблицаОстатков.ЗаявкаНаРасходованиеДенежныхСредств
		|ГДЕ
		|	ТаблицаОстатков.ЗаявкаНаРасходованиеДенежныхСредств <> ЗНАЧЕНИЕ(Документ.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОстатков.АналитикаУчетаПоПартнерам,
		|	ТаблицаОстатков.ОбъектРасчетов,
		|	ТаблицаОстатков.Валюта,
		|	ТаблицаОстатков.ЗаявкаНаРасходованиеДенежныхСредств
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР КОГДА ТаблицаОстатков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ТаблицаОстатков.Оплачивается
		|		ИНАЧЕ
		|			-ТаблицаОстатков.Оплачивается
		|		КОНЕЦ) > 0
		|";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиОплачивается");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Авансы
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "РасчетыСКлиентамиИзменения") Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	РасчетыСКлиентамиОстатки.ОбъектРасчетов        КАК ДокументАванса,
			|	РасчетыСКлиентамиОстатки.Валюта                КАК Валюта,
			|	РасчетыСКлиентамиОстатки.СуммаОстаток          КАК СуммаПревышения,
			|	СУММА(РасчетыСКлиентамиИзменения.Сумма)        КАК СуммаУменьшенияЗачета,
			|	МАКСИМУМ(РасчетыСКлиентамиИзменения.ВызыватьИсключение) КАК ВызыватьИсключение
			|	
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентами.Остатки(,
			|		(ОбъектРасчетов, Валюта) В (ВЫБРАТЬ ОбъектРасчетов, Валюта ИЗ РасчетыСКлиентамиИзменения ГДЕ Сумма <> 0)) КАК РасчетыСКлиентамиОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыСКлиентамиИзменения КАК РасчетыСКлиентамиИзменения
			|			ПО РасчетыСКлиентамиИзменения.ОбъектРасчетов = РасчетыСКлиентамиОстатки.ОбъектРасчетов
			|				И РасчетыСКлиентамиИзменения.Валюта = РасчетыСКлиентамиОстатки.Валюта
			|ГДЕ
			|	РасчетыСКлиентамиОстатки.СуммаОстаток > 0
			|	И (ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиОстатки.ОбъектРасчетов.Объект) В (ТИП(Документ.ПоступлениеБезналичныхДенежныхСредств),
			|													ТИП(Документ.ПриходныйКассовыйОрдер),
			|													ТИП(Справочник.ПодарочныеСертификаты),
			|													ТИП(Документ.ВводОстатков),
			|													ТИП(Документ.ВводОстатковВзаиморасчетов))
			|		ИЛИ ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиОстатки.ОбъектРасчетов.Объект) = ТИП(Документ.ОперацияПоПлатежнойКарте)
			|			И ВЫРАЗИТЬ(РасчетыСКлиентамиОстатки.ОбъектРасчетов.Объект КАК Документ.ОперацияПоПлатежнойКарте).ХозяйственнаяОперация
			|				= ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента))
			|СГРУППИРОВАТЬ ПО
			|	РасчетыСКлиентамиОстатки.ОбъектРасчетов,
			|	РасчетыСКлиентамиОстатки.Валюта,
			|	РасчетыСКлиентамиОстатки.СуммаОстаток
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РасчетыСКлиентамиОстатки.ОбъектРасчетов        КАК ДокументАванса,
			|	РасчетыСКлиентамиОстатки.Валюта                КАК Валюта,
			|	РасчетыСКлиентамиОстатки.СуммаОстаток          КАК СуммаПревышения,
			|	СУММА(РасчетыСКлиентамиИзменения.Сумма)        КАК СуммаУменьшенияЗачета,
			|	МАКСИМУМ(РасчетыСКлиентамиИзменения.ВызыватьИсключение) КАК ВызыватьИсключение
			|	
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентами.Остатки(,
			|		(ОбъектРасчетов, Валюта) В (ВЫБРАТЬ ОбъектРасчетов, Валюта ИЗ РасчетыСКлиентамиИзменения ГДЕ Сумма <> 0 И ОбъектРасчетов.КонтролироватьОстаткиАвансов)
			|	) КАК РасчетыСКлиентамиОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.КонтролироватьОстаткиАвансов КАК ЗначениеКонстанты
			|			ПО ЗначениеКонстанты.Значение
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыСКлиентамиИзменения КАК РасчетыСКлиентамиИзменения
			|			ПО РасчетыСКлиентамиИзменения.ОбъектРасчетов = РасчетыСКлиентамиОстатки.ОбъектРасчетов
			|				И РасчетыСКлиентамиИзменения.Валюта = РасчетыСКлиентамиОстатки.Валюта
			|ГДЕ
			|	РасчетыСКлиентамиОстатки.СуммаОстаток > 0
			|СГРУППИРОВАТЬ ПО
			|	РасчетыСКлиентамиОстатки.ОбъектРасчетов,
			|	РасчетыСКлиентамиОстатки.Валюта,
			|	РасчетыСКлиентамиОстатки.СуммаОстаток
			|";
		

		ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиКонтрольЗачтенныхАвансовПоНакладнымКлиент");
		
	КонецЕсли;
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "РасчетыСПоставщикамиИзменения") Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов           КАК ДокументАванса,
			|	РасчетыСПоставщикамиОстатки.Валюта                   КАК Валюта,
			|	-РасчетыСПоставщикамиОстатки.СуммаОстаток             КАК СуммаПревышения,
			|	СУММА(РасчетыСПоставщикамиИзменения.Сумма)               КАК СуммаУменьшенияЗачета,
			|	МАКСИМУМ(РасчетыСПоставщикамиИзменения.ВызыватьИсключение) КАК ВызыватьИсключение
			|
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщиками.Остатки(,
			|		(ОбъектРасчетов, Валюта) В (ВЫБРАТЬ ОбъектРасчетов, Валюта ИЗ РасчетыСПоставщикамиИзменения ГДЕ Сумма <> 0)) КАК РасчетыСПоставщикамиОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыСПоставщикамиИзменения КАК РасчетыСПоставщикамиИзменения
			|			ПО РасчетыСПоставщикамиИзменения.ОбъектРасчетов = РасчетыСПоставщикамиОстатки.ОбъектРасчетов
			|				И РасчетыСПоставщикамиИзменения.Валюта = РасчетыСПоставщикамиОстатки.Валюта
			|				И РасчетыСПоставщикамиИзменения.Сумма <> 0
			|ГДЕ
			|	РасчетыСПоставщикамиОстатки.СуммаОстаток < 0
			|	И ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиОстатки.ОбъектРасчетов.Объект) В (ТИП(Документ.СписаниеБезналичныхДенежныхСредств),
			|													ТИП(Документ.РасходныйКассовыйОрдер),
			|													ТИП(Документ.ВводОстатков),
			|													ТИП(Документ.ВводОстатковВзаиморасчетов))
			|СГРУППИРОВАТЬ ПО
			|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов,
			|	РасчетыСПоставщикамиОстатки.Валюта,
			|	-РасчетыСПоставщикамиОстатки.СуммаОстаток
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов           КАК ДокументАванса,
			|	РасчетыСПоставщикамиОстатки.Валюта                   КАК Валюта,
			|	-РасчетыСПоставщикамиОстатки.СуммаОстаток            КАК СуммаПревышения,
			|	СУММА(РасчетыСПоставщикамиИзменения.Сумма)           КАК СуммаУменьшенияЗачета,
			|	МАКСИМУМ(РасчетыСПоставщикамиИзменения.ВызыватьИсключение) КАК ВызыватьИсключение
			|
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщиками.Остатки(,
			|		(ОбъектРасчетов, Валюта) В (ВЫБРАТЬ ОбъектРасчетов, Валюта ИЗ РасчетыСПоставщикамиИзменения ГДЕ Сумма <> 0 И ОбъектРасчетов.КонтролироватьОстаткиАвансов)
			|	) КАК РасчетыСПоставщикамиОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.КонтролироватьОстаткиАвансов КАК ЗначениеКонстанты
			|			ПО ЗначениеКонстанты.Значение
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетыСПоставщикамиИзменения КАК РасчетыСПоставщикамиИзменения
			|			ПО РасчетыСПоставщикамиИзменения.ОбъектРасчетов = РасчетыСПоставщикамиОстатки.ОбъектРасчетов
			|				И РасчетыСПоставщикамиИзменения.Валюта = РасчетыСПоставщикамиОстатки.Валюта
			|				И РасчетыСПоставщикамиИзменения.Сумма <> 0
			|ГДЕ
			|	РасчетыСПоставщикамиОстатки.СуммаОстаток < 0
			|СГРУППИРОВАТЬ ПО
			|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов,
			|	РасчетыСПоставщикамиОстатки.Валюта,
			|	-РасчетыСПоставщикамиОстатки.СуммаОстаток
			|	
			|";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиКонтрольЗачтенныхАвансовПоНакладнымПоставщик");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ВводОстатков
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "РасчетыСКлиентамиИзмененияВводОстатков") Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСКлиентамиИзменения.ОбъектРасчетов             КАК ОбъектРасчетов
			|ИЗ
			|	РасчетыСКлиентамиИзмененияВводОстатков КАК РасчетыСКлиентамиИзменения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
			|			ПО РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам
			|				И РасчетыСКлиентамиИзменения.ОбъектРасчетов = РасчетыСКлиентами.ОбъектРасчетов
			|				И РасчетыСКлиентамиИзменения.Период < РасчетыСКлиентами.Период 
			|				И ТИПЗНАЧЕНИЯ(РасчетыСКлиентами.Регистратор) В (ТИП(Документ.ВводОстатков),ТИП(Документ.ВводОстатковВзаиморасчетов))
			|				И РасчетыСКлиентами.Сумма <> 0
			|	
			|ГДЕ
			|	НЕ ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиИзменения.Регистратор) В (ТИП(Документ.ВводОстатков),ТИП(Документ.ВводОстатковВзаиморасчетов))
			|";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиЕстьВводОстатковПослеКлиенты");
		
		ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСКлиентамиИзменения.ОбъектРасчетов             КАК ОбъектРасчетов
			|ИЗ
			|	РасчетыСКлиентамиИзмененияВводОстатков КАК РасчетыСКлиентамиИзменения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
			|			ПО РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам
			|				И РасчетыСКлиентамиИзменения.ОбъектРасчетов = РасчетыСКлиентами.ОбъектРасчетов
			|				И РасчетыСКлиентамиИзменения.Период > РасчетыСКлиентами.Период 
			|				И НЕ ТИПЗНАЧЕНИЯ(РасчетыСКлиентами.Регистратор) В (ТИП(Документ.ВводОстатков),ТИП(Документ.ВводОстатковВзаиморасчетов))
			|				И РасчетыСКлиентами.Сумма <> 0
			|	
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиИзменения.Регистратор) В (ТИП(Документ.ВводОстатков),ТИП(Документ.ВводОстатковВзаиморасчетов))
			|";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиЕстьДвиженияДоКлиенты");
		
	КонецЕсли;
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "РасчетыСПоставщикамиИзмененияВводОстатков") Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасчетыСПоставщикамиИзменения.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСПоставщикамиИзменения.ОбъектРасчетов             КАК ОбъектРасчетов
			|ИЗ
			|	РасчетыСПоставщикамиИзмененияВводОстатков КАК РасчетыСПоставщикамиИзменения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
			|			ПО РасчетыСПоставщикамиИзменения.АналитикаУчетаПоПартнерам = РасчетыСПоставщиками.АналитикаУчетаПоПартнерам
			|				И РасчетыСПоставщикамиИзменения.ОбъектРасчетов = РасчетыСПоставщиками.ОбъектРасчетов
			|				И РасчетыСПоставщикамиИзменения.Период < РасчетыСПоставщиками.Период 
			|				И ТИПЗНАЧЕНИЯ(РасчетыСПоставщиками.Регистратор) В (ТИП(Документ.ВводОстатков),ТИП(Документ.ВводОстатковВзаиморасчетов))
			|				И РасчетыСПоставщиками.Сумма <> 0
			|	
			|ГДЕ
			|	НЕ ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиИзменения.Регистратор) В (ТИП(Документ.ВводОстатков),ТИП(Документ.ВводОстатковВзаиморасчетов))
			|";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиЕстьВводОстатковПослеПоставщики");
		
		ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасчетыСПоставщикамиИзменения.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСПоставщикамиИзменения.ОбъектРасчетов             КАК ОбъектРасчетов
			|ИЗ
			|	РасчетыСПоставщикамиИзмененияВводОстатков КАК РасчетыСПоставщикамиИзменения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
			|			ПО РасчетыСПоставщикамиИзменения.АналитикаУчетаПоПартнерам = РасчетыСПоставщиками.АналитикаУчетаПоПартнерам
			|				И РасчетыСПоставщикамиИзменения.ОбъектРасчетов = РасчетыСПоставщиками.ОбъектРасчетов
			|				И РасчетыСПоставщикамиИзменения.Период > РасчетыСПоставщиками.Период 
			|				И НЕ ТИПЗНАЧЕНИЯ(РасчетыСПоставщиками.Регистратор) В (ТИП(Документ.ВводОстатков),ТИП(Документ.ВводОстатковВзаиморасчетов))
			|				И РасчетыСПоставщиками.Сумма <> 0
			|	
			|ГДЕ
			|	ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиИзменения.Регистратор) В (ТИП(Документ.ВводОстатков),ТИП(Документ.ВводОстатковВзаиморасчетов))
			|";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиЕстьДвиженияДоПоставщики");
		
	КонецЕсли;
	#КонецОбласти
	
	#Область РасчетыСПоставщикамиОплачивается
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияРасчетыСПоставщикамиИзменениеОплачивается") Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТаблицаОстатков.АналитикаУчетаПоПартнерам           КАК АналитикаУчетаПоПартнерам,
		|	ТаблицаОстатков.ОбъектРасчетов                      КАК ОбъектРасчетов,
		|	ТаблицаОстатков.Валюта                              КАК Валюта,
		|	ТаблицаОстатков.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	СУММА(ВЫБОР КОГДА ТаблицаОстатков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ТаблицаОстатков.Оплачивается
		|		ИНАЧЕ
		|			-ТаблицаОстатков.Оплачивается
		|		КОНЕЦ) КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками КАК ТаблицаОстатков
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияРасчетыСПоставщикамиИзменениеОплачивается КАК Таблица
		|	ПО Таблица.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		|		И Таблица.ОбъектРасчетов = ТаблицаОстатков.ОбъектРасчетов
		|		И Таблица.Валюта = ТаблицаОстатков.Валюта
		|		И Таблица.ЗаявкаНаРасходованиеДенежныхСредств = ТаблицаОстатков.ЗаявкаНаРасходованиеДенежныхСредств
		|ГДЕ
		|	ТаблицаОстатков.ЗаявкаНаРасходованиеДенежныхСредств <> ЗНАЧЕНИЕ(Документ.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОстатков.АналитикаУчетаПоПартнерам,
		|	ТаблицаОстатков.ОбъектРасчетов,
		|	ТаблицаОстатков.Валюта,
		|	ТаблицаОстатков.ЗаявкаНаРасходованиеДенежныхСредств
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР КОГДА ТаблицаОстатков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		|			ТаблицаОстатков.Оплачивается
		|		ИНАЧЕ
		|			-ТаблицаОстатков.Оплачивается
		|		КОНЕЦ) > 0
		|";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиОплачивается");
		
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

// Выводит сообщения пользователю при наличии ошибок контроля изменений записанных движений регистров.
//
// Параметры:
//  РезультатыКонтроля - Структура - таблицы с результатами контроля изменений
//  Документ - ДокументОбъект - записываемый документ
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура СообщитьОРезультатахКонтроляИзменений(РезультатыКонтроля, Документ, Отказ) Экспорт
	
	ДоступноОтклонениеОтУсловийОплаты = ПраваПользователяПовтИсп.ОтклонениеОтУсловийОплаты();
	
	#Область РасчетыСКлиентами
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияРасчетыСКлиентамиИзменение") Тогда
		
		ШаблонСообщения = НСтр("ru = 'Нарушены условия оплаты, необходимые для обеспечения/отгрузки по %1,
			|Требуется %2 %4 оплачено %3 %4'");
		
		Для каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиРасчетыСКлиентами Цикл
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаОшибки.ОбъектРасчетов,
				СтрокаОшибки.СуммаЗаказа, СтрокаОшибки.СуммаОплаты, СтрокаОшибки.Валюта);
			
			Если ДоступноОтклонениеОтУсловийОплаты Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ);
			Иначе
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ,,, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область СуммыСрокЗадолженности
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияРасчетыСКлиентамиИзменениеСуммыДолга") Тогда
		
		ШаблонСообщения = НСтр("ru = 'По договору %1 превышена допустимая сумма кредита на %2 %3'");
		
		Для каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиОграничениеСуммыЗадолженности Цикл
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаОшибки.Договор, СтрокаОшибки.СуммаПревышения,
				СтрокаОшибки.Валюта);
			
			Если ДоступноОтклонениеОтУсловийОплаты Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ);
			Иначе
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ,,, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияРасчетыСКлиентамиИзменениеКонтрольСрока") Тогда
		
		ШаблонСообщения = НСтр("ru = 'По договору %1 имеется просроченная задолженность на сумму %2 %3'");
		
		Для каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиКонтрольСрокаЗадолженности Цикл
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаОшибки.Договор, СтрокаОшибки.ПросроченнаяЗадолженность,
				СтрокаОшибки.Валюта);
			
			Если ДоступноОтклонениеОтУсловийОплаты Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ);
			Иначе
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ,,, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Авансы
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "РасчетыСКлиентамиИзменения") Тогда
		
		ШаблонСообщения = НСтр("ru = 'Не хватает остатка аванса на %1, текущий остаток %2 %4, требуется %3 %4'");
		
		Для каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиКонтрольЗачтенныхАвансовПоНакладнымКлиент Цикл
			
			СуммаОстаток = ?((СтрокаОшибки.СуммаПревышения - СтрокаОшибки.СуммаУменьшенияЗачета) < 0,0,СтрокаОшибки.СуммаПревышения - СтрокаОшибки.СуммаУменьшенияЗачета);
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения,
										СтрокаОшибки.ДокументАванса,
										СуммаОстаток,
										СтрокаОшибки.СуммаПревышения,
										СтрокаОшибки.Валюта);
			
			Если ДоступноОтклонениеОтУсловийОплаты  ИЛИ НЕ СтрокаОшибки.ВызыватьИсключение Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ);
			Иначе
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ,,, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "РасчетыСПоставщикамиИзменения") Тогда
		
		ШаблонСообщения = НСтр("ru = 'Не хватает остатка аванса на %1, текущий остаток %2 %4, требуется %3 %4'");
		
		Для каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиКонтрольЗачтенныхАвансовПоНакладнымПоставщик Цикл
			
			СуммаОстаток = ?((СтрокаОшибки.СуммаПревышения - СтрокаОшибки.СуммаУменьшенияЗачета) < 0, 0, СтрокаОшибки.СуммаПревышения - СтрокаОшибки.СуммаУменьшенияЗачета);
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения,
										СтрокаОшибки.ДокументАванса,
										СуммаОстаток,
										СтрокаОшибки.СуммаПревышения,
										СтрокаОшибки.Валюта);
			
			Если ДоступноОтклонениеОтУсловийОплаты  ИЛИ НЕ СтрокаОшибки.ВызыватьИсключение Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ);
			Иначе
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ,,, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Оплачивается
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияРасчетыСКлиентамиИзменениеОплачивается")
		Или ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияРасчетыСПоставщикамиИзменениеОплачивается") Тогда
		
		ШаблонСообщения = НСтр("ru = 'По объекту расчетов %1 оплачивается больше, чем утверждено в заявке, на %2 %3'");
		
		Для каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиОплачивается Цикл
			ТекстСообщения = СтрШаблон(ШаблонСообщения,
				СтрокаОшибки.ОбъектРасчетов, СтрокаОшибки.Сумма, СтрокаОшибки.Валюта);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ,,, Отказ);
		КонецЦикла;
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

// Возникает перед выполнением записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								используемый для хранения таблиц контроля изменений регистров.
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПередЗаписьюДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	Если Документ.ДополнительныеСвойства.Свойство("РежимЗаписи")
		И Документ.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КорректировкаГрафикаВзаиморасчетов.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.КорректировкаГрафикаВзаиморасчетов КАК КорректировкаГрафикаВзаиморасчетов
			|ГДЕ
			|	КорректировкаГрафикаВзаиморасчетов.ДокументОснование = &Ссылка
			|	И КорректировкаГрафикаВзаиморасчетов.Проведен";
		Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'На основании данного документа проведен документ %1, сначала нужно отменить документ корректировки.'"),
				Выборка.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Выборка.Ссылка, , , Отказ);
		КонецЦикла;
	КонецЕсли;
	
	// Для учетного механизма создаются свойства движений
	ДополнительныеСвойстваДокумента = Документ.ДополнительныеСвойства;
	Если ДополнительныеСвойстваДокумента.Свойство("ПроведениеДокументов")
		И ДополнительныеСвойстваДокумента.ПроведениеДокументов.Свойство("СвойстваДвиженийМеханизмов") Тогда
		ДополнительныеСвойстваДокумента.ПроведениеДокументов.СвойстваДвиженийМеханизмов.Вставить("Взаиморасчеты", Новый Структура);
	КонецЕсли;
	
КонецПроцедуры

// Возникает после выполнения записи регистров документа.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								используемый для хранения таблиц контроля изменений регистров.
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура ПослеЗаписиДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ) Экспорт
	
	ЕстьИзмененияРасчетовСКлиентами = МенеджерВременныхТаблиц.Таблицы.Найти("РасчетыСКлиентамиИзменения") <> Неопределено;
	ЕстьИзмененияРасчетовСПоставщиками = МенеджерВременныхТаблиц.Таблицы.Найти("РасчетыСПоставщикамиИзменения") <> Неопределено;
	
	Если Отказ
		ИЛИ НЕ ЕстьИзмененияРасчетовСКлиентами
			И НЕ ЕстьИзмененияРасчетовСПоставщиками Тогда
		Возврат;
	КонецЕсли;
	
	НоваяАрхитектураВзаиморасчетов = ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
	ДополнительныеСвойстваПроведения = Документ.ДополнительныеСвойства.ПроведениеДокументов;
	ТаблицаИзменений        = ОперативныеВзаиморасчетыСервер.ТаблицаИзмененийДляПересчета(МенеджерВременныхТаблиц);
	
	ПараметрыРаспределения = ОперативныеВзаиморасчетыСервер.ПараметрыРаспределенияРасчетов();
	ПараметрыРаспределения.ДополнитьРаспределитьПриемники = Истина;
	
	Если ЕстьИзмененияРасчетовСКлиентами Тогда
		ПроверитьПорядокОперацииОбъектовРасчетовИсточников(
			Документ.Движения.РасчетыСКлиентами.Выгрузить(),
			ДополнительныеСвойстваПроведения,
			Отказ);
	КонецЕсли;
	
	Если ЕстьИзмененияРасчетовСПоставщиками Тогда
		ПроверитьПорядокОперацииОбъектовРасчетовИсточников(
			Документ.Движения.РасчетыСПоставщиками.Выгрузить(),
			ДополнительныеСвойстваПроведения,
			Отказ);
	КонецЕсли;
		
	Если Документ.ОбменДанными.Загрузка Тогда
		ВыполнятьРаспределениеВзаиморасчетовВТранзакции = Ложь;
	ИначеЕсли ДополнительныеСвойстваПроведения.Свойство("СвойстваДвиженийМеханизмов")
		И ДополнительныеСвойстваПроведения.СвойстваДвиженийМеханизмов.Свойство("Взаиморасчеты")
		И ДополнительныеСвойстваПроведения.СвойстваДвиженийМеханизмов.Взаиморасчеты.Свойство("ВыполнятьРаспределениеВзаиморасчетовВТранзакции") Тогда
		ВыполнятьРаспределениеВзаиморасчетовВТранзакции = ДополнительныеСвойстваПроведения.СвойстваДвиженийМеханизмов.Взаиморасчеты.ВыполнятьРаспределениеВзаиморасчетовВТранзакции;
	Иначе
		ВыполнятьРаспределениеВзаиморасчетовВТранзакции = Не ОперативныеВзаиморасчетыСервер.РаспределятьВзаиморасчетыФоновымЗаданием();
	КонецЕсли;
	
	Если Константы.НачатПереходНаНовуюАрхитектуруВзаиморасчетов.Получить() Тогда
		ОперативныеВзаиморасчетыСервер.ЗарегистрироватьИзмененияКОтложенномуРаспределению(Документ.Ссылка, ТаблицаИзменений);
	КонецЕсли;
	
	Если НоваяАрхитектураВзаиморасчетов И ВыполнятьРаспределениеВзаиморасчетовВТранзакции Тогда
		
		ОперативныеВзаиморасчетыСервер.ЗаполнитьОперативныеВзаиморасчетыПоТаблице(ПараметрыРаспределения, ТаблицаИзменений);
		
	КонецЕсли;
	
	ТаблицаОбъектовОплаты = СформироватьТаблицуОбъектовОплаты(
		Документ.Ссылка,
		МенеджерВременныхТаблиц);
	
	ТаблицаОбъектовОплаты.Индексы.Добавить("ЭтоРасчетыСКлиентами");
	
	Если ЕстьИзмененияРасчетовСКлиентами Тогда
		РегистрыСведений.ГрафикПлатежей.РассчитатьГрафикПлатежейПоРасчетамСКлиентами(
			ТаблицаОбъектовОплаты.Скопировать(Новый Структура("ЭтоРасчетыСКлиентами",Истина)));
	КонецЕсли;
	
	Если ЕстьИзмененияРасчетовСПоставщиками Тогда
		РегистрыСведений.ГрафикПлатежей.РассчитатьГрафикПлатежейПоРасчетамСПоставщиками(
			ТаблицаОбъектовОплаты.Скопировать(Новый Структура("ЭтоРасчетыСКлиентами",Ложь)),,
			Документ.ДополнительныеСвойства.Свойство("ПропуститьОбновлениеГрафика"));
	КонецЕсли;
	
КонецПроцедуры

// Функция получает временные таблицы курсов валют и направлений деятельности.
// 
// Параметры:
//  ТекстЗапросаИсходнойТаблицы - Строка - Текст запроса с данными об объектах расчетов, валютах, датах курса
//  ЭтоОперацияОплаты - Булево - Значение по умолчанию Ложь, Истина для операций оплаты и возврата оплаты
// 
// Возвращаемое значение:
//  Строка - Текст запроса с созданными временными таблицами ВтКоэффициентыПересчетаВалют и ВтНаправленияДеятельности
Функция ПолучитьТаблицуКурсовВалютНаправленийДеятельности(ТекстЗапросаИсходнойТаблицы, ЭтоОперацияОплаты = Ложь) Экспорт
	
	// Платежки всегда игнорируют курс договора при проведении, так как при оплате в иностранной валюте курс из договора невозможно применить, 
	// а при оплате в валюте учета курс из договора уже применен в самой форме документа и расчет при проведении не требуется
	Если ЭтоОперацияОплаты Тогда
		КурсИзДоговора = "ЛОЖЬ";
	Иначе
		КурсИзДоговора = "ЕСТЬNULL(КурсыВалютДокумента.ОбъектРасчетов.Договор.ВариантКурсаДоговора,
			|		ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)";
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	*
		|ПОМЕСТИТЬ ВТ_ТаблицаКурсыВалютДокумента
		|ИЗ
		|	&ВложенныйЗапрос КАК ВложенныйЗапрос
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КурсыВалютДокумента.Ссылка КАК Ссылка,
		|	КурсыВалютДокумента.ОбъектРасчетов КАК ОбъектРасчетов,
		|	КурсыВалютДокумента.ОбъектРасчетов.Договор КАК Договор,
		|	КурсыВалютДокумента.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	КурсыВалютДокумента.ДатаКурса КАК ДатаКурса,
		|	КурсыВалютДокумента.ВалютаДокумента КАК ВалютаДокумента,
		|	КурсыВалютДокумента.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
		|	КурсыВалютДокумента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	&ВалютаУправленческогоУчета КАК ВалютаУправленческогоУчета,
		|	НЕ ФиксированныеКурсыВалют.Документ ЕСТЬ NULL
		|	И ВЫБОР
		|		КОГДА КурсыВалютДокумента.ОбъектРасчетов.Договор.ВариантКурсаДоговора ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ КурсыВалютДокумента.ОбъектРасчетов.Договор.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
		|	КОНЕЦ КАК ФиксированныйКурсНакладной,
		|	&КурсИзДоговора КАК КурсИзДоговора,
		|	ЕСТЬNULL(ФиксированныеКурсыВалют.ВалютаВзаиморасчетов, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК
		|		ВалютаВзаиморасчетовФиксированныйКурс,
		|	ЕСТЬNULL(ФиксированныеКурсыВалют.КурсЧислительВалютыВзаиморасчетов, 1) КАК ВалютаФиксированныйКурсЧислитель,
		|	ЕСТЬNULL(ФиксированныеКурсыВалют.КурсЗнаменательВалютыВзаиморасчетов, 1) КАК
		|		ВалютаФиксированныйКурсЗнаменатель
		|ПОМЕСТИТЬ ВТ_РасширеннаяТаблицаКурсовВалют
		|ИЗ
		|	ВТ_ТаблицаКурсыВалютДокумента КАК КурсыВалютДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВалютыИКурсыДокументов КАК ФиксированныеКурсыВалют
		|		ПО КурсыВалютДокумента.ОбъектРасчетов.Объект = ФиксированныеКурсыВалют.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КурсыВалютДокумента.ДатаКурса КАК ДатаКурса,
		|	КурсыВалютДокумента.ВалютаДокумента КАК Валюта,
		|	КурсыВалютДокумента.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
		|ПОМЕСТИТЬ ВТ_КурсыВалютСтрокиДокумента
		|ИЗ
		|	ВТ_РасширеннаяТаблицаКурсовВалют КАК КурсыВалютДокумента
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КурсыВалютДокумента.ДатаКурса КАК ДатаКурса,
		|	КурсыВалютДокумента.ВалютаВзаиморасчетов КАК Валюта,
		|	КурсыВалютДокумента.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
		|ИЗ
		|	ВТ_РасширеннаяТаблицаКурсовВалют КАК КурсыВалютДокумента
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КурсыВалютДокумента.ДатаКурса КАК ДатаКурса,
		|	КурсыВалютДокумента.ВалютаУправленческогоУчета КАК Валюта,
		|	КурсыВалютДокумента.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
		|ИЗ
		|	ВТ_РасширеннаяТаблицаКурсовВалют КАК КурсыВалютДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДляКурсов.ДатаКурса КАК ДатаКурса,
		|	ДанныеДляКурсов.Валюта КАК Валюта,
		|	ДанныеДляКурсов.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
		|	МАКСИМУМ(Курсы.Период) КАК ПериодКурса
		|ПОМЕСТИТЬ ВТ_ПериодыКурсовВалютСтрокиДокумента
		|ИЗ
		|	ВТ_КурсыВалютСтрокиДокумента КАК ДанныеДляКурсов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют КАК Курсы
		|		ПО Курсы.Период <= ДанныеДляКурсов.ДатаКурса
		|		И Курсы.Валюта = ДанныеДляКурсов.Валюта
		|		И Курсы.БазоваяВалюта = ДанныеДляКурсов.ВалютаРегламентированногоУчета
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДляКурсов.ДатаКурса,
		|	ДанныеДляКурсов.Валюта,
		|	ДанныеДляКурсов.ВалютаРегламентированногоУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////		
		|ВЫБРАТЬ
		|	ПериодыКурсов.ДатаКурса КАК ДатаКурса,
		|	ПериодыКурсов.Валюта КАК Валюта,
		|	КурсыВалютДокументов.КурсЧислитель КАК ВалютаКурсЧислитель,
		|	КурсыВалютДокументов.КурсЗнаменатель КАК ВалютаКурсЗнаменатель
		|ПОМЕСТИТЬ ВТ_ДанныеКурсовВалютДокумента
		|ИЗ
		|	ВТ_ПериодыКурсовВалютСтрокиДокумента КАК ПериодыКурсов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют КАК КурсыВалютДокументов
		|		ПО ПериодыКурсов.ПериодКурса = КурсыВалютДокументов.Период
		|		И ПериодыКурсов.Валюта = КурсыВалютДокументов.Валюта
		|		И ПериодыКурсов.ВалютаРегламентированногоУчета = КурсыВалютДокументов.БазоваяВалюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДляКурсов.ДатаКурса КАК ДатаКурса,
		|	ДанныеДляКурсов.Договор КАК Договор,
		|	МАКСИМУМ(Курсы.Период) КАК ПериодКурса
		|ПОМЕСТИТЬ ВТ_ПериодыКурсыДоговоров
		|ИЗ
		|	ВТ_РасширеннаяТаблицаКурсовВалют КАК ДанныеДляКурсов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютРасчетовПоДоговорам КАК Курсы
		|		ПО Курсы.Период <= ДанныеДляКурсов.ДатаКурса
		|		И Курсы.Договор = ДанныеДляКурсов.Договор
		|		И ДанныеДляКурсов.КурсИзДоговора
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДляКурсов.ДатаКурса,
		|	ДанныеДляКурсов.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////////////////		
		|ВЫБРАТЬ
		|	ПериодыКурсов.ДатаКурса КАК ДатаКурса,
		|	ПериодыКурсов.Договор КАК Договор,
		|	КурсыВалютДоговоры.КурсЧислитель КАК ДоговорВалютаКурсЧислитель,
		|	КурсыВалютДоговоры.КурсЗнаменатель КАК ДоговорВалютаКурсЗнаменатель
		|ПОМЕСТИТЬ ВТ_ДанныеКурсовВалютДоговоры
		|ИЗ
		|	ВТ_ПериодыКурсыДоговоров КАК ПериодыКурсов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютРасчетовПоДоговорам КАК КурсыВалютДоговоры
		|		ПО ПериодыКурсов.ПериодКурса = КурсыВалютДоговоры.Период
		|		И ПериодыКурсов.Договор = КурсыВалютДоговоры.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходнаяТаблицаКурсовВалют.Ссылка                               КАК Ссылка,
		|	ИсходнаяТаблицаКурсовВалют.ДатаКурса                            КАК ДатаКурса,
		|	ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов                 КАК ВалютаВзаиморасчетов,
		|	ИсходнаяТаблицаКурсовВалют.ВалютаРегламентированногоУчета       КАК ВалютаРегламентированногоУчета,
		|	ИсходнаяТаблицаКурсовВалют.ОбъектРасчетов                       КАК ОбъектРасчетов,
		//КоэффициентУпр
		|	ВЫРАЗИТЬ(1.000000000000000000000000001 * 
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаДокумента = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЧислитель, 1)
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютДокументов.ВалютаКурсЧислитель, 1)
		|	КОНЕЦ * 
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаУправленческогоУчета = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЗнаменатель, 1)
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютУпр.ВалютаКурсЗнаменатель, 1)
		|	КОНЕЦ / 
		|	(ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаДокумента = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЗнаменатель, 1)
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютДокументов.ВалютаКурсЗнаменатель, 1)
		|	КОНЕЦ *
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаУправленческогоУчета = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЧислитель, 1)
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютУпр.ВалютаКурсЧислитель, 1)
		|	КОНЕЦ) КАК ЧИСЛО(31, 17))                                       КАК КоэффициентУпр,
		|
		//КоэффициентРегл
		|	ВЫРАЗИТЬ(1.000000000000000000000000001 * 
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаДокумента = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЧислитель, 1)
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютДокументов.ВалютаКурсЧислитель, 1)
		|	КОНЕЦ * 
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаРегламентированногоУчета = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЗнаменатель, 1)
		|		ИНАЧЕ 1
		|	КОНЕЦ / 
		|	(ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаДокумента = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЗнаменатель, 1)
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютДокументов.ВалютаКурсЗнаменатель, 1)
		|	КОНЕЦ * 
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаРегламентированногоУчета = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЧислитель, 1)
		|		ИНАЧЕ 1
		|	КОНЕЦ) КАК ЧИСЛО(31, 17))                                       КАК КоэффициентРегл,
		|
		//КоэффициентВзаиморасчетов
		|	ВЫРАЗИТЬ(1.000000000000000000000000001 * 
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаДокумента = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЧислитель, 1)
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютДокументов.ВалютаКурсЧислитель, 1)
		|	КОНЕЦ * 
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЗнаменатель, 1)
		|		КОГДА ИсходнаяТаблицаКурсовВалют.ФиксированныйКурсНакладной
		|			ТОГДА ВЫБОР
		|				КОГДА
		|					ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетовФиксированныйКурс
		|					ТОГДА ИсходнаяТаблицаКурсовВалют.ВалютаФиксированныйКурсЗнаменатель
		|				ИНАЧЕ ЕСТЬNULL(КурсыВалютРасчеты.ВалютаКурсЗнаменатель, 1)
		|			КОНЕЦ
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютРасчеты.ВалютаКурсЗнаменатель, 1)
		|	КОНЕЦ / 
		|	(ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаДокумента = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЗнаменатель, 1)
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютДокументов.ВалютаКурсЗнаменатель, 1)
		|	КОНЕЦ * 
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЧислитель, 1)
		|		КОГДА ИсходнаяТаблицаКурсовВалют.ФиксированныйКурсНакладной
		|			ТОГДА ВЫБОР
		|				КОГДА
		|					ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетовФиксированныйКурс
		|					ТОГДА ИсходнаяТаблицаКурсовВалют.ВалютаФиксированныйКурсЧислитель
		|				ИНАЧЕ ЕСТЬNULL(КурсыВалютРасчеты.ВалютаКурсЧислитель, 1)
		|			КОНЕЦ
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютРасчеты.ВалютаКурсЧислитель, 1)
		|	КОНЕЦ) КАК ЧИСЛО(31, 17))                                       КАК КоэффициентВзаиморасчетов,
		// Исходные курсы помещаем в таблицу для записи в оперативные регистры и последующего использования в распределении взаиморасчетов
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаУправленческогоУчета = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЧислитель, 1)
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютУпр.ВалютаКурсЧислитель, 1)
		|	КОНЕЦ                                                           КАК КурсЧислительВалютыУпр,
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаУправленческогоУчета = ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЗнаменатель, 1)
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютУпр.ВалютаКурсЗнаменатель, 1)
		|	КОНЕЦ                                                           КАК КурсЗнаменательВалютыУпр,
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЧислитель, 1)
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютРасчеты.ВалютаКурсЧислитель, 1)
		|	КОНЕЦ                                                           КАК КурсЧислительВалютыВзаиморасчетов,
		|	ВЫБОР
		|		КОГДА ИсходнаяТаблицаКурсовВалют.КурсИзДоговора
		|			ТОГДА ЕСТЬNULL(КурсыВалютДоговоры.ДоговорВалютаКурсЗнаменатель, 1)
		|		ИНАЧЕ ЕСТЬNULL(КурсыВалютРасчеты.ВалютаКурсЗнаменатель, 1)
		|	КОНЕЦ                                                           КАК КурсЗнаменательВалютыВзаиморасчетов
		|
		|ПОМЕСТИТЬ ВзаиморасчетыВтКоэффициентыПересчетаВалют
		|ИЗ
		|	ВТ_РасширеннаяТаблицаКурсовВалют КАК ИсходнаяТаблицаКурсовВалют
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеКурсовВалютДоговоры КАК КурсыВалютДоговоры
		|		по ИсходнаяТаблицаКурсовВалют.ДатаКурса = КурсыВалютДоговоры.ДатаКурса
		|		И ИсходнаяТаблицаКурсовВалют.Договор = КурсыВалютДоговоры.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеКурсовВалютДокумента КАК КурсыВалютДокументов
		|		ПО ИсходнаяТаблицаКурсовВалют.ДатаКурса = КурсыВалютДокументов.ДатаКурса
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаДокумента = КурсыВалютДокументов.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеКурсовВалютДокумента КАК КурсыВалютУпр
		|		ПО ИсходнаяТаблицаКурсовВалют.ДатаКурса = КурсыВалютУпр.ДатаКурса
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаУправленческогоУчета = КурсыВалютУпр.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеКурсовВалютДокумента КАК КурсыВалютРасчеты
		|		ПО ИсходнаяТаблицаКурсовВалют.ДатаКурса = КурсыВалютРасчеты.ДатаКурса
		|		И ИсходнаяТаблицаКурсовВалют.ВалютаВзаиморасчетов = КурсыВалютРасчеты.Валюта;
		//НаправлениеДеятельности
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НаправленияДокументов.ОбъектРасчетов КАК ОбъектРасчетов,
		|	ВЫБОР 
		|		КОГДА (ЕСТЬNULL(НаправленияДокументов.ОбъектРасчетов.НаправлениеДеятельности.УчетДоходов, ЛОЖЬ) 
		|					И НаправленияДокументов.ОбъектРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
		|				ИЛИ ЕСТЬNULL(НаправленияДокументов.ОбъектРасчетов.НаправлениеДеятельности.УчетРасчетовСПоставщиками, ЛОЖЬ)
		|					И НаправленияДокументов.ОбъектРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком))
		|				И НЕ НаправленияДокументов.ОбъектРасчетов.РегистрыВзаиморасчетовНеДелятсяПоНаправлениямДеятельности
		|			ТОГДА НаправленияДокументов.ОбъектРасчетов.НаправлениеДеятельности
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|	КОНЕЦ КАК НаправлениеАналитики
		|ПОМЕСТИТЬ ВтНаправленияДеятельности
		|ИЗ
		|	ВТ_РасширеннаяТаблицаКурсовВалют КАК НаправленияДокументов
		|;
		|
		|УНИЧТОЖИТЬ ВТ_ТаблицаКурсыВалютДокумента;
		|УНИЧТОЖИТЬ ВТ_РасширеннаяТаблицаКурсовВалют;
		|УНИЧТОЖИТЬ ВТ_КурсыВалютСтрокиДокумента;
		|УНИЧТОЖИТЬ ВТ_ПериодыКурсовВалютСтрокиДокумента;
		|УНИЧТОЖИТЬ ВТ_ДанныеКурсовВалютДокумента;
		|УНИЧТОЖИТЬ ВТ_ДанныеКурсовВалютДоговоры;
		|УНИЧТОЖИТЬ ВТ_ПериодыКурсыДоговоров";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КурсИзДоговора", КурсИзДоговора);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВложенныйЗапрос", "(" + ТекстЗапросаИсходнойТаблицы + ")");
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция получает временную таблицу направлений деятельности.
// 
// Параметры:
//  ТекстЗапросаИсходнойТаблицы - Строка - Текст запроса с данными об объектах расчетов, валютах, датах курса
// 
// Возвращаемое значение:
//  Строка - Текст запроса с созданной временной таблицей ВтНаправленияДеятельности
Функция ПолучитьТаблицуНаправленийДеятельности(ТекстЗапросаИсходнойТаблицы) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	*
		|ПОМЕСТИТЬ ВТ_ТаблицаНаправлениеДеятельности
		|ИЗ
		|	&ВложенныйЗапрос КАК ВложенныйЗапрос
		|;
		|ВЫБРАТЬ 
		|	НаправленияДокументов.ОбъектРасчетов КАК ОбъектРасчетов,
		|	НаправленияДокументов.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ВЫБОР 
		|		КОГДА (ЕСТЬNULL(НаправленияДокументов.ОбъектРасчетов.НаправлениеДеятельности.УчетДоходов, ЛОЖЬ) 
		|					И НаправленияДокументов.ОбъектРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
		|				ИЛИ ЕСТЬNULL(НаправленияДокументов.ОбъектРасчетов.НаправлениеДеятельности.УчетРасчетовСПоставщиками, ЛОЖЬ)
		|					И НаправленияДокументов.ОбъектРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком))
		|				И НЕ НаправленияДокументов.ОбъектРасчетов.РегистрыВзаиморасчетовНеДелятсяПоНаправлениямДеятельности
		|			ТОГДА НаправленияДокументов.ОбъектРасчетов.НаправлениеДеятельности
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|	КОНЕЦ КАК НаправлениеАналитики
		|
		|ПОМЕСТИТЬ ВтНаправленияДеятельности
		|ИЗ
		|	ВТ_ТаблицаНаправлениеДеятельности КАК НаправленияДокументов
		|;
		|
		|УНИЧТОЖИТЬ ВТ_ТаблицаНаправлениеДеятельности
		|";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВложенныйЗапрос", "(" + ТекстЗапросаИсходнойТаблицы + ")");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстВтПереносаРасчетов(ИмяТаблицы = "") Экспорт
	
	ТекстЗапросаРасшифровка = "
	|
	|ВЫБРАТЬ
	|	УвеличениеЗадолженностиКлиента.Ссылка                                    КАК Ссылка,
	|	УвеличениеЗадолженностиКлиента.Организация                               КАК Организация,
	|	УвеличениеЗадолженностиКлиента.Партнер                                   КАК Партнер,
	|	
	|	УвеличениеЗадолженностиКлиента.ОбъектРасчетов                            КАК ОбъектРасчетовПриемник,
	|	УвеличениеЗадолженностиКлиента.ОбъектРасчетов                            КАК ОбъектРасчетовИсточник,
	|	УвеличениеЗадолженностиКлиента.ВалютаВзаиморасчетов                      КАК ВалютаВзаиморасчетов,
	|	УвеличениеЗадолженностиКлиента.СуммаВзаиморасчетов                       КАК СуммаВзаиморасчетов,
	|	УвеличениеЗадолженностиКлиента.ВалютаДокумента                           КАК ВалютаДокумента,
	|	УвеличениеЗадолженностиКлиента.Сумма                                     КАК Сумма,
	|
	|	УвеличениеЗадолженностиКлиента.ДатаКурса                                 КАК ДатаКурса,
	|	УвеличениеЗадолженностиКлиента.ДатаРегистратора                          КАК ДатаРегистратора,
	|	УвеличениеЗадолженностиКлиента.НомерРегистратора                         КАК НомерРегистратора,
	|	УвеличениеЗадолженностиКлиента.ХозяйственнаяОперация                     КАК ХозяйственнаяОперация,
	|	УвеличениеЗадолженностиКлиента.СтатьяДвиженияДенежныхСредств             КАК СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	#УвеличениеЗадолженностиКлиента КАК УвеличениеЗадолженностиКлиента
	|ГДЕ
	|	(УвеличениеЗадолженностиКлиента.ОбъектРасчетов.Организация <> УвеличениеЗадолженностиКлиента.Организация
	|		ИЛИ УвеличениеЗадолженностиКлиента.ОбъектРасчетов.Партнер <> УвеличениеЗадолженностиКлиента.Партнер)
	|	И УвеличениеЗадолженностиКлиента.СуммаВзаиморасчетов <> 0
	|";
		
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		ТекстЗапросаРасшифровка = СтрЗаменить(ТекстЗапросаРасшифровка, "УвеличениеЗадолженностиКлиента", ИмяТаблицы);
	КонецЕсли;
	
	Возврат ТекстЗапросаРасшифровка;
	
КонецФункции

Процедура ПроверитьЗаполнитьАналитикуУчетаПоПартнерам(ТаблицаДвижений) Экспорт
	
	Если ТаблицаДвижений.Колонки.Найти("Партнер") = Неопределено 
		ИЛИ ТаблицаДвижений.Колонки.Найти("Организация") = Неопределено 
		ИЛИ ТаблицаДвижений.Колонки.Найти("Контрагент") = Неопределено 
		ИЛИ ТаблицаДвижений.Колонки.Найти("Договор") = Неопределено 
		ИЛИ ТаблицаДвижений.Колонки.Найти("НаправлениеДеятельности") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоляАналитики = "Партнер, Организация, Контрагент, Договор, НаправлениеДеятельности";
	ТаблицаНайденнойАналитики = ТаблицаДвижений.Скопировать(,ПоляАналитики); // ТаблицаЗначений
	ТаблицаНайденнойАналитики.Очистить();
	ТаблицаНайденнойАналитики.Колонки.Добавить("АналитикаУчетаПоПартнерам", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам"));
	ПараметрыАналитики = Новый Структура(ПоляАналитики);
	
	Для Каждого Запись Из ТаблицаДвижений Цикл
		
		Если НЕ ЗначениеЗаполнено(Запись.АналитикаУчетаПоПартнерам) Тогда
			
			ЗаполнитьЗначенияСвойств(ПараметрыАналитики, Запись);
			Если НЕ ЗначениеЗаполнено(ПараметрыАналитики.Договор) Тогда
				Если ТипЗнч(ПараметрыАналитики.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
					ПараметрыАналитики.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
				ИначеЕсли ТипЗнч(ПараметрыАналитики.Контрагент) = Тип("СправочникСсылка.Организации") Тогда
					ПараметрыАналитики.Договор = Справочники.ДоговорыМеждуОрганизациями.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
			
			СтрокиАналитики = ТаблицаНайденнойАналитики.НайтиСтроки(ПараметрыАналитики);
			Если СтрокиАналитики.Количество() > 0 Тогда
				Запись.АналитикаУчетаПоПартнерам = СтрокиАналитики[0].АналитикаУчетаПоПартнерам;
			Иначе
				Запись.АналитикаУчетаПоПартнерам = РегистрыСведений.АналитикаУчетаПоПартнерам.ЗначениеКлючаАналитики(ПараметрыАналитики);
				НовСтр = ТаблицаНайденнойАналитики.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Запись);
			КонецЕсли;
		КонецЕсли;
		
		Если ТаблицаДвижений.Колонки.Найти("КорАналитикаУчетаПоПартнерам") <> Неопределено
			И ТаблицаДвижений.Колонки.Найти("КорОрганизация") <> Неопределено
			И НЕ ЗначениеЗаполнено(Запись.КорАналитикаУчетаПоПартнерам) 
			И ЗначениеЗаполнено(Запись.КорОрганизация)
			И ЗначениеЗаполнено(Запись.КорКонтрагент) Тогда
			ПараметрыАналитики.Партнер = Запись.КорПартнер;
			ПараметрыАналитики.Организация = Запись.КорОрганизация;
			ПараметрыАналитики.Контрагент = Запись.КорКонтрагент;
			ПараметрыАналитики.Договор = Запись.КорДоговор;
			ПараметрыАналитики.НаправлениеДеятельности = Запись.КорНаправлениеДеятельности;
			
			Если НЕ ЗначениеЗаполнено(ПараметрыАналитики.Договор) Тогда
				Если ТипЗнч(ПараметрыАналитики.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
					ПараметрыАналитики.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
				ИначеЕсли ТипЗнч(ПараметрыАналитики.Контрагент) = Тип("СправочникСсылка.Организации") Тогда
					ПараметрыАналитики.Договор = Справочники.ДоговорыМеждуОрганизациями.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
			
			СтрокиАналитики = ТаблицаНайденнойАналитики.НайтиСтроки(ПараметрыАналитики);
			Если СтрокиАналитики.Количество() > 0 Тогда
				Запись.КорАналитикаУчетаПоПартнерам = СтрокиАналитики[0].АналитикаУчетаПоПартнерам;
			Иначе
				Запись.КорАналитикаУчетаПоПартнерам = РегистрыСведений.АналитикаУчетаПоПартнерам.ЗначениеКлючаАналитики(ПараметрыАналитики);
				НовСтр = ТаблицаНайденнойАналитики.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ПараметрыАналитики);
				НовСтр.АналитикаУчетаПоПартнерам = Запись.КорАналитикаУчетаПоПартнерам;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТаблицаДвижений.Колонки.Найти("АналитикаУчетаПоПартнерамПриемник") <> Неопределено
			И ТаблицаДвижений.Колонки.Найти("ОрганизацияПриемник") <> Неопределено
			И НЕ ЗначениеЗаполнено(Запись.АналитикаУчетаПоПартнерамПриемник) 
			И ЗначениеЗаполнено(Запись.ОрганизацияПриемник)
			И ЗначениеЗаполнено(Запись.КонтрагентПриемник) Тогда
			ПараметрыАналитики.Партнер = Запись.ПартнерПриемник;
			ПараметрыАналитики.Организация = Запись.ОрганизацияПриемник;
			ПараметрыАналитики.Контрагент = Запись.КонтрагентПриемник;
			ПараметрыАналитики.Договор = Запись.ДоговорПриемник;
			ПараметрыАналитики.НаправлениеДеятельности = Запись.НаправлениеДеятельностиПриемник;
			
			Если НЕ ЗначениеЗаполнено(ПараметрыАналитики.Договор) Тогда
				Если ТипЗнч(ПараметрыАналитики.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
					ПараметрыАналитики.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
				ИначеЕсли ТипЗнч(ПараметрыАналитики.Контрагент) = Тип("СправочникСсылка.Организации") Тогда
					ПараметрыАналитики.Договор = Справочники.ДоговорыМеждуОрганизациями.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
			
			СтрокиАналитики = ТаблицаНайденнойАналитики.НайтиСтроки(ПараметрыАналитики);
			Если СтрокиАналитики.Количество() > 0 Тогда
				Запись.АналитикаУчетаПоПартнерамПриемник = СтрокиАналитики[0].АналитикаУчетаПоПартнерам;
			Иначе
				Запись.АналитикаУчетаПоПартнерамПриемник = РегистрыСведений.АналитикаУчетаПоПартнерам.ЗначениеКлючаАналитики(ПараметрыАналитики);
				НовСтр = ТаблицаНайденнойАналитики.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ПараметрыАналитики);
				НовСтр.АналитикаУчетаПоПартнерам = Запись.АналитикаУчетаПоПартнерамПриемник;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет поля:
//	ПорядокОперации - используется для поиска движений до и после изменяемого документа, для сортировки документов к зачету оплат и накладных.
//	ПорядокЗачетаПоДатеПлатежа - используется для поиска движений до и после изменяемого документа при зачете документов по дате платежа.
// Параметры:
//  ТаблицаРасчеты - ТаблицаЗначений - таблица движений по регистру расчетов с обязательными колонками:
//   * АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам,
//   * Период - Дата,
//   * ДатаРегистратора - Дата,
//   * НомерРегистратора - Строка,
//   * Вид - Число
//  ТипДокумента - Тип - Тип документа регистратора
//  ПорядкиЗачетаОплатНакладныхДоговоров - Соответствие Из КлючИЗначение -где:
// 		* Ключ - СправочникСсылка.ДоговорыКонтрагентов,СправочникСсылка.ДоговорыМеждуОрганизациями - объект расчетов, для которого получены данные.
// 		* Значение - ПеречислениеСсылка.ПорядкиЗачетаОплатНакладных
Процедура ДобавитьЗаполнитьПорядокОперации(ТаблицаРасчеты, ТипДокумента, ПорядкиЗачетаОплатНакладныхДоговоров = Неопределено) Экспорт
	
	Если ПорядкиЗачетаОплатНакладныхДоговоров = Неопределено Тогда
		МассивАналитик = ТаблицаРасчеты.ВыгрузитьКолонку("АналитикаУчетаПоПартнерам");
		МассивАналитик = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивАналитик);
		СоответствиеДоговоров = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивАналитик,"Договор");
		МассивДоговоров = ОбщегоНазначенияУТКлиентСервер.ПреобразоватьСоответствиеИлиСтруктуруВМассив(СоответствиеДоговоров, Ложь);
		МассивДоговоров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивДоговоров);
		ПорядкиЗачетаОплатНакладныхДоговоров = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивДоговоров, "ПорядокЗачетаОплатНакладных");
	КонецЕсли;
	
	ОбщийПорядокЗачетаОплатНакладных = Константы.ПорядокЗачетаОплатНакладных.Получить();
	
	Если ТаблицаРасчеты.Колонки.Найти("ПорядокОперации") = Неопределено Тогда
		ТаблицаРасчеты.Колонки.Добавить("ПорядокОперации",            Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	Если ТаблицаРасчеты.Колонки.Найти("ПорядокЗачетаПоДатеПлатежа") = Неопределено Тогда
		ТаблицаРасчеты.Колонки.Добавить("ПорядокЗачетаПоДатеПлатежа", Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	Тип = ОперативныеВзаиморасчетыСервер.НомерТипа(ТипДокумента);
	
	ЕстьДатаПлатежа = ТаблицаРасчеты.Колонки.Найти("ДатаПлатежа") <> Неопределено;
	ЕстьСумма = ТаблицаРасчеты.Колонки.Найти("Сумма") <> Неопределено;
	ЕстьВидОперацииДляСортировки = ТаблицаРасчеты.Колонки.Найти("ВидОперацииДляСортировки") <> Неопределено;
	ЕстьПорядокОперацииВПределахДокумента = ТаблицаРасчеты.Колонки.Найти("ПорядокОперацииВПределахДокумента") <> Неопределено;
	ЕстьСторно = ТаблицаРасчеты.Колонки.Найти("Сторно") <> Неопределено;
	Для Каждого Стр Из ТаблицаРасчеты Цикл
		
		ДатаПлатежа = ?(ЕстьДатаПлатежа И ЗначениеЗаполнено(Стр.ДатаПлатежа), Стр.ДатаПлатежа, Дата(3000,1,1));
		
		Если ЕстьВидОперацииДляСортировки
			И (ПорядкиЗачетаОплатНакладныхДоговоров[Стр.Договор] = Перечисления.ПорядкиЗачетаОплатНакладных.ПоДатеВидуДокумента
				ИЛИ НЕ ЗначениеЗаполнено(ПорядкиЗачетаОплатНакладныхДоговоров[Стр.Договор])
					И ОбщийПорядокЗачетаОплатНакладных = Перечисления.ПорядкиЗачетаОплатНакладных.ПоДатеВидуДокумента) Тогда
			ВидОперацииДляСортировки = Стр.ВидОперацииДляСортировки;
		Иначе
			ВидОперацииДляСортировки = "0";
		КонецЕсли;
		
		Если ЕстьПорядокОперацииВПределахДокумента Тогда
			ПорядокОперацииВПределахДокумента = Стр.ПорядокОперацииВПределахДокумента;
		Иначе
			ПорядокОперацииВПределахДокумента = "1";
		КонецЕсли;
		
		// Для сторно записей нужно сохранить вид операции.
		// Порядок операции в пределах документа всегда должен быть пустой.
		Если ЕстьСторно И Стр.Сторно = Истина И ЗначениеЗаполнено(Стр.ПорядокОперации) Тогда
			ВидОперацииДляСортировки = Сред(Стр.ПорядокОперации,9,1);
			ПорядокОперацииВПределахДокумента = "";
		КонецЕсли;
			
		// План оплаты может проводиться периодом = дате платежа
		Если (НЕ ЕстьСумма ИЛИ Стр.Сумма = 0)
			И ТипДокумента <> Тип("ДокументСсылка.ВводОстатков") И ТипДокумента <> Тип("ДокументСсылка.ВводОстатковВзаиморасчетов") Тогда
			Стр.ПорядокОперации = ОперативныеВзаиморасчетыСервер.Порядок(Стр.ДатаРегистратора, Стр.НомерРегистратора, ТипДокумента, ВидОперацииДляСортировки, Тип, ПорядокОперацииВПределахДокумента);
			Стр.ПорядокЗачетаПоДатеПлатежа = ОперативныеВзаиморасчетыСервер.Порядок(ДатаПлатежа, Стр.НомерРегистратора, ТипДокумента, ВидОперацииДляСортировки, Тип);
		// Фактические расчеты всегда по периоду.
		Иначе
			Стр.ПорядокОперации = ОперативныеВзаиморасчетыСервер.Порядок(Стр.Период, Стр.НомерРегистратора, ТипДокумента, ВидОперацииДляСортировки, Тип, ПорядокОперацииВПределахДокумента);
			Стр.ПорядокЗачетаПоДатеПлатежа = ОперативныеВзаиморасчетыСервер.Порядок(ДатаПлатежа, Стр.НомерРегистратора, ТипДокумента, ВидОперацииДляСортировки, Тип);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Если Объект расчетов приемник имеет порядок операции раньше источника
// то проведение документа будет прервано и выдано сообщение об ошибке.
Процедура ПроверитьПорядокОперацииОбъектовРасчетовИсточников(ТаблицаИзменений, ДополнительныеСвойства, Отказ)
	
	Если ДополнительныеСвойства <> Неопределено
		И ДополнительныеСвойства.Свойство("СвойстваДокумента")
		И ДополнительныеСвойства.СвойстваДокумента.Свойство("РежимЗаписи")
		И ДополнительныеСвойства.СвойстваДокумента.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ТаблицаДляПроверки = ТаблицаИзменений.Скопировать(,
			"АналитикаУчетаПоПартнерам,
			|ОбъектРасчетов,
			|Валюта,
			|ПоДаннымОбъектаРасчетовИсточника,
			|АналитикаУчетаПоПартнерамПриемник,
			|ОбъектРасчетовПриемник,
			|ВалютаПриемник,
			|Период");
		Для Каждого СтрокаТаблицы Из ТаблицаДляПроверки Цикл
			СтрокаТаблицы.Период = НачалоДня(СтрокаТаблицы.Период);
		КонецЦикла;
		ТаблицаДляПроверки.Индексы.Добавить("АналитикаУчетаПоПартнерамПриемник, ОбъектРасчетовПриемник, ВалютаПриемник");
		Отбор = Новый Структура("АналитикаУчетаПоПартнерамПриемник, ОбъектРасчетовПриемник, ВалютаПриемник");
		Для Каждого СтрокаТаблицы Из ТаблицаДляПроверки Цикл
			Если Не Отказ И СтрокаТаблицы.ПоДаннымОбъектаРасчетовИсточника Тогда
				Отбор.АналитикаУчетаПоПартнерамПриемник = СтрокаТаблицы.АналитикаУчетаПоПартнерам;
				Отбор.ОбъектРасчетовПриемник = СтрокаТаблицы.ОбъектРасчетов;
				Отбор.ВалютаПриемник = СтрокаТаблицы.Валюта;
				СтрокиИсточники = ТаблицаДляПроверки.НайтиСтроки(Отбор);
				Для Каждого СтрокаИсточник Из СтрокиИсточники Цикл
					Если СтрокаИсточник.Период > СтрокаТаблицы.Период Тогда
						ОбщегоНазначения.СообщитьПользователю(
							НСтр("ru = 'Дата движения объекта расчетов приемника не может быть меньше даты движения объекта расчетов источника.'"),,,,
							Отказ);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьОбъектыРасчетовНабора(ТаблицаДвижений, Отказ, ЭтоРасчетыСКлиентами)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРегистра = ?(ЭтоРасчетыСКлиентами,
					Метаданные.РегистрыНакопления.РасчетыСКлиентами.Представление(),
					Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Представление());
	ИмяПоляОбъектРасчетов = ?(ЭтоРасчетыСКлиентами,
					Метаданные.РегистрыНакопления.РасчетыСКлиентами.Измерения.ОбъектРасчетов.Представление(),
					Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Измерения.ОбъектРасчетов.Представление());
	// Сначала необходимо проверить заполненность поля Объект расчетов
	Для Каждого Движение Из ТаблицаДвижений Цикл
		Если Не ЗначениеЗаполнено(Движение.ОбъектРасчетов) Тогда
			Отказ = Истина;
			ВызватьИсключение(СтрШаблон(НСтр("ru = 'Запись не верна! Значение поля ""%1"" не может быть пустым! (Регистр накопления: %2; Номер строки: %3)'"),
			                            ИмяПоляОбъектРасчетов,
			                            ИмяРегистра,
			                            ТаблицаДвижений.Индекс(Движение) + 1));
		КонецЕсли;
	КонецЦикла;
	
	ОбъектыРасчетов = ТаблицаДвижений.Скопировать(,"ОбъектРасчетов");
	ОбъектыРасчетов.Свернуть("ОбъектРасчетов");
	ОбъектыРасчетов = ОбъектыРасчетов.ВыгрузитьКолонку("ОбъектРасчетов");
	
	РеквизитыОъектовРасчетов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ОбъектыРасчетов,"ПометкаУдаления,ТипРасчетов");
	Для Каждого КлючИЗначение Из РеквизитыОъектовРасчетов Цикл
		Если КлючИЗначение.Значение.ПометкаУдаления Тогда
			Отказ = Истина;
			ВызватьИсключение(СтрШаблон(НСтр("ru = 'Объект расчетов %1 не может быть выбран в документах, т.к. исходный объект больше не является объектом расчетов или помечен на удаление.'"),
													КлючИЗначение.Ключ));
		КонецЕсли;
		
		Если ЭтоРасчетыСКлиентами И КлючИЗначение.Значение.ТипРасчетов <> Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом
			ИЛИ НЕ ЭтоРасчетыСКлиентами И КлючИЗначение.Значение.ТипРасчетов <> Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком Тогда
			Отказ = Истина;
			ВызватьИсключение(СтрШаблон(НСтр("ru = 'Объект расчетов ""%1"" с типом расчетов ""%2"" не может быть записан в регистр ""%3"".'"),
													КлючИЗначение.Ключ, КлючИЗначение.Значение.ТипРасчетов, ИмяРегистра));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Формирует таблицу объектов оплаты, по которым необходимо рассчитать график платежей после записи движений расчетов.
// 
// Параметры:
//  Регистратор - ДокументСсылка - Документ, движения которого были записаны
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит таблицу изменений
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * ЭтоРасчетыСКлиентами - Булево - признак типа расчетов.
//   * ОбъектОплаты - ОпределяемыйТип.ОбъектРасчетов - ссылка на объект объекта расчетов.
//   * ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - объект расчетов, по которому нужно рассчитать график платежей.
//
Функция СформироватьТаблицуОбъектовОплаты(Регистратор, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.Текст = "";
	Если МенеджерВременныхТаблиц.Таблицы.Найти("РасчетыСКлиентамиИзменения") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК ЭтоРасчетыСКлиентами,
		|	ЕСТЬNULL(Таблица.ОбъектРасчетов.Объект, &Регистратор) КАК ОбъектОплаты,
		|	Таблица.ОбъектРасчетов КАК ОбъектРасчетов
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК Таблица
		|ГДЕ
		|	Таблица.Регистратор = &Регистратор
		|	И Таблица.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК ЭтоРасчетыСКлиентами,
		|	ЕСТЬNULL(Таблица.ОбъектРасчетов.Объект, Таблица.Документ) КАК ОбъектОплаты,
		|	Таблица.ОбъектРасчетов КАК ОбъектРасчетов
		|ИЗ
		|	РасчетыСКлиентамиИзменения КАК Таблица
		|ГДЕ
		|	Таблица.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)";
		
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("РасчетыСКлиентамиИзменения") <> Неопределено 
		И МенеджерВременныхТаблиц.Таблицы.Найти("РасчетыСПоставщикамиИзменения") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ
		|";
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("РасчетыСПоставщикамиИзменения") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ КАК ЭтоРасчетыСКлиентами,
		|	ЕСТЬNULL(Таблица.ОбъектРасчетов.Объект, &Регистратор) КАК ОбъектОплаты,
		|	Таблица.ОбъектРасчетов КАК ОбъектРасчетов
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками КАК Таблица
		|ГДЕ
		|	Таблица.Регистратор = &Регистратор
		|	И Таблица.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ КАК ЭтоРасчетыСКлиентами,
		|	ЕСТЬNULL(Таблица.ОбъектРасчетов.Объект, Таблица.Документ) КАК ОбъектОплаты,
		|	Таблица.ОбъектРасчетов КАК ОбъектРасчетов
		|ИЗ
		|	РасчетыСПоставщикамиИзменения КАК Таблица
		|ГДЕ
		|	Таблица.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
		|";
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
