Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаДФ(Данные.Ссылка.Титул1, Представление, СтандартнаяОбработка, "2");
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	МассивОбязательных.Добавить("ТранспортноеСредство");
	МассивОбязательных.Добавить("Водитель");
	МассивОбязательных.Добавить("ПутевойЛистНомер");
	МассивОбязательных.Добавить("ПутевойЛистДата");
	МассивОбязательных.Добавить("ПутевойЛистСрокДействия");
	МассивОбязательных.Добавить("УИД_ДФ");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	МассивОбязательных.Добавить("ЕстьОтказВПодписи");
	МассивОбязательных.Добавить("ПричинаОтказаВПодписи");
	МассивОбязательных.Добавить("Составитель");
	МассивОбязательных.Добавить("ОснДовОргСост");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ДополнительныеВодителиМассивСтруктур", 
		"Сведения о доп. водителях", 
		"Заполняется, если заявка принята Фрахтовщиком", "МассивСтруктур (см. ТЧ Водители)", 
		2));
		
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_ДФ");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфФщ");
	МассивКлючевых.Добавить("ВрИнфФщ");
	
	МассивКлючевых.Добавить("ИдФайлИнфФт");
	МассивКлючевых.Добавить("ДатФайлИнфФт");
	МассивКлючевых.Добавить("ВрФайлИнфФт");
	МассивКлючевых.Добавить("ЭПФт");
	
	Возврат МассивКлючевых;
	
КонецФункции

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда 
		
		// TODO понять какие сценарии проверки входящего документа
		
	ИначеЕсли Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		И Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан Тогда  
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
				
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
				
		// TODO - доделать валидатор
		//
		//ПроверитьОтметки(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		//ПроверитьИнфПол(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	ИначеЕсли ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена Тогда 
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиДругихСторон(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
	КонецЕсли;

	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
		
	Если НЕ ЗначениеЗаполнено(Объект.Титул1)  Тогда
		
		ТекстОшибки = "Титул не привязан к Титулу 1";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"Титул1", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
			
			Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
				
				ОбязательныйРевизитСиноним = СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
				
		КонецЦикла;
		
		// ОрганизацияСоставитель 
		Если ЗначениеЗаполнено(Объект.Составитель) И Объект.Составитель <> Объект.Титул1.Фрахтовщик Тогда 
			
			Если Не Объект.Составитель = Объект.Титул1.Фрахтовщик Тогда
				
				Если Не ЗначениеЗаполнено(Объект.ОснДовОргСост) Тогда
				
					ТекстОшибки = "Укажите договор-основание полномочий составителя файла обмена";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"Объект.ОснДовОргСост", КатегорияОшибка, ТекстОшибки, "Указать");
					
				Иначе 
					
					Если Не ЗначениеЗаполнено(Объект.ОснДовОргСост.Организация) Тогда
						
						ТекстОшибки = "Укажите организацию, к которой относится договор составителя договора фрахтования";
						КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
							"Объект.ОснДовОргСост.Организация", КатегорияОшибка, ТекстОшибки, "Указать");
						
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(Объект.ОснДовОргСост.Контрагент) Тогда
						
						ТекстОшибки = "Укажите контрагента, с которым у организации заключен договор составителя договора фрахтования";
						КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
							"Объект.ОснДовОргСост.Контрагент", КатегорияОшибка, ТекстОшибки, "Указать");
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Объект.ЕстьОтказВПодписи Тогда
			
			Если Не ЗначениеЗаполнено(Объект.ПричинаОтказаВПодписи) Тогда 
				
				ТекстОшибки = "Не указана причина отказа";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
					ТаблицаОшибок, "", "", "ПричинаОтказаВПодписи", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
		Иначе
			
			// СвВодит
			ПроверитьВодителей(Объект, ТаблицаОшибок);
			
			// СвТС
			ПроверитьТранспортноеСредство(Объект, ТаблицаОшибок);
			
			// Провдение документа основания
			КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьВодителей(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	
	Если ЗначениеЗаполнено(Объект.Водитель) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Водитель.ВУДатаВыдачи) Тогда			
			ТекстОшибки = "Укажите у водителя дату выдачи ВУ";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, , , 
			"Водитель", КатегорияОшибка, ТекстОшибки, "Указать");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.Водитель.ВУНомер) Тогда
			ТекстОшибки = "Укажите у водителя номер ВУ";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, , , 
			"Водитель", КатегорияОшибка, ТекстОшибки, "Указать");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.Водитель.ВУСерия) Тогда				
			ТекстОшибки = "Укажите у водителя серию ВУ";				
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, , , 
			"Водитель", КатегорияОшибка, ТекстОшибки, "Указать");				
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьРеквизитыДоверенности(Знач Объект, ТаблицаОшибок)

	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	
	Если Не ЗначениеЗаполнено(Объект.РеквДоверИдДок) 
		И Не ЗначениеЗаполнено(Объект.РеквДоверНаименование) 
		И Не ЗначениеЗаполнено(Объект.РеквДоверНомер)
		И Не ЗначениеЗаполнено(Объект.РеквДоверДата) 
		И Не ЗначениеЗаполнено(Объект.РеквДоверСоставитель) 
		И Не ЗначениеЗаполнено(Объект.РеквДоверСоставитель2) 
		И Не ЗначениеЗаполнено(Объект.РеквДоверДопСведДок) Тогда 
		
		ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей доверенности.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"РеквДоверНаименование", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.РеквДоверИдДок) 
		И (ЗначениеЗаполнено(Объект.РеквДоверНаименование)
		Или ЗначениеЗаполнено(Объект.РеквДоверНомер) 
		Или ЗначениеЗаполнено(Объект.РеквДоверДата)
		Или ЗначениеЗаполнено(Объект.РеквДоверСоставитель)
		Или ЗначениеЗаполнено(Объект.РеквДоверСоставитель2) 
		Или ЗначениеЗаполнено(Объект.РеквДоверДопСведДок)) Тогда	
			
		Если Не ЗначениеЗаполнено(Объект.РеквДоверНаименование) Тогда 
			
			ТекстОшибки = "Укажите наименование доверенности.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"РеквДоверНаименование", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.РеквДоверДата) Тогда 
			
			ТекстОшибки = "Укажите дату доверенности.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"РеквДоверДата", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.РеквДоверСоставитель) И Не ЗначениеЗаполнено(Объект.РеквДоверСоставитель2) Тогда 
			
			ТекстОшибки = "Укажите составителей доверенности.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"РеквДоверСоставитель", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
			
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверитьТранспортноеСредство(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка 		= ПредопределенноеЗначение("Перечисление.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка");
	КатегорияПредупреждение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение");
	
	ТранспортноеСредство = Объект.ТранспортноеСредство;
	
	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.РегНомер) Тогда
			
			ТекстОшибки = "Укажите рег. номер транспортного средства";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.РегНомер", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.ВидВладения) Тогда
			
			ТекстОшибки = "Укажите вид владения транспортным средством";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.ВидВладения", КатегорияОшибка, ТекстОшибки, "Указать");
			
		Иначе
			
			// TODO валидация основания владения 
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.ВместимостьКубМ) Тогда
			
			ТекстОшибки = "Не указана вместимость транспортного средства (тягач?)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ТранспортноеСредство.ВместимостьКубМ", КатегорияПредупреждение, ТекстОшибки, "Проверить");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.ТипТС) Тогда
			
			ТекстОшибки = "Укажите тип транспортного средства";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.ТипТС", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.МаркаТС) Тогда
			
			ТекстОшибки = "Укажите марку транспортного средства";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.МаркаТС", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ДФ_Титул2.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

#КонецЕсли