
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда 
		ГиперссылкаНаДокумент = КонтурЛогистика_ОбработкаДокументовКлиент.СсылкаВБраузереЛогиситка(ПараметрКоманды);
		
		Если ЗначениеЗаполнено(ГиперссылкаНаДокумент) Тогда
			КонтурЛогистика_ИнтеграцияДиадокКлиент.ПерейтиПоСсылке(ГиперссылкаНаДокумент);
		Иначе
			КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Не могу получить ссылку в web-интерфейсе, возможно документ еще не отправлен");
		КонецЕсли;
	Иначе
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Документ еще не создан, нечего показывать");
	КонецЕсли;
	
КонецПроцедуры
