
&После("ОбработкаПроведения")
Процедура АУ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.АУ_ПланФактБюджета.Записывать = Истина;
	
	Для Каждого ТекСтрокаСтатьиБюджета Из ЭтотОбъект.АУ_СтатьиБюджета Цикл
		
		Движение = Движения.АУ_ПланФактБюджета.Добавить();
		Движение.Период = НачалоМесяца(ЭтотОбъект.Дата);
		Движение.Организация = ЭтотОбъект.Организация;
		Движение.СтатьяБюджета = ТекСтрокаСтатьиБюджета.СтатьяБюджета;
		
		Если НЕ ТекСтрокаСтатьиБюджета.СтатьяБюджета.Валютная Тогда
			Движение.СуммаФакт = РаботаСКурсамиВалют.ПересчитатьВВалюту(ТекСтрокаСтатьиБюджета.Сумма,ЭтотОбъект.Валюта,Константы.ВалютаРегламентированногоУчета.Получить(),ЭтотОбъект.Дата);
		Иначе
			Движение.СуммаФакт = ТекСтрокаСтатьиБюджета.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
