#Область СлужебныеПроцедурыИФункции

Процедура ПослеПодключенияОбсуждений(Результат, ДополнительныеПараметры) Экспорт
	
	МодульОбсужденияСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбсужденияСлужебныйКлиент");
	ОбсужденияПодключены = МодульОбсужденияСлужебныйКлиент.Подключены();
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеЗавершения, ОбсужденияПодключены);
	
КонецПроцедуры

#Область СервисыМобильногоПодписания

// Подписывает данные в сервисах мобильного подписания
// 
// Параметры:
//  ОписаниеОповещения - ОписаниеОповещения - Описание оповещения при завершении.
//  Контекст - Структура - структура с ключами:
//   * Подписант - СправочникСсылка.ПодписантыСервисаМобильнойПодписи - Подписант
//   * ПараметрыВыполнения - Структура -Параметры выполнения операции подписания:
//     ** Форма - ФормаКлиентскогоПриложения - Форма.
//  ПараметрыПодписания - Структура - Структура с ключами:
//   * ТипПодписи - Строка - Тип подписи.
//   * Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций - Доверенность
//   * ПакетнаяОтправкаНаПодписание - Булево
//   * ТекущаяВерсияБСП - Строка - Текущая версия БСП
//   * ВидМобильнойПодписи - ПеречислениеСсылка.ВидыМобильныхПодписей - Вид мобильной подписи.
//
Процедура ПодписатьДанныеВСервисеМобильнойПодписи(ОписаниеОповещения, Контекст, ПараметрыПодписания) Экспорт

	Если ИнтеграцияБСПБЭДСлужебныйКлиентСервер.ВерсияБСППоддерживаетГосключ(ПараметрыПодписания.ТекущаяВерсияБСП) Тогда
		МодульСервисМобильнойПодписиСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СервисМобильнойПодписиСлужебныйКлиент");
		
		Если МодульСервисМобильнойПодписиСлужебныйКлиент <> Неопределено Тогда
			МодульСервисМобильнойПодписиСлужебныйКлиент.ПодписатьДанныеВСервисе(ОписаниеОповещения, Контекст, ПараметрыПодписания);
		КонецЕсли;
	Иначе
		МодульСервисМобильнойПодписиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СервисМобильнойПодписиКлиент");
		Если МодульСервисМобильнойПодписиКлиент <> Неопределено Тогда
			МодульСервисМобильнойПодписиКлиент.ПодписатьДанныеВСервисе(ОписаниеОповещения, Контекст, ПараметрыПодписания);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

// Открывает форму выбора сертификата.
// 
// Параметры:
//  ПараметрыФормы - Структура:
//   * Организация - ОпределяемыйТип.Организация 
//   * ФизическоеЛицо - ОпределяемыйТип.ФизическоеЛицо
//   * СертификатОснование - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования 
//   * ДобавлениеВСписок - Булево
//   * ЛичныйСписокПриДобавлении - Булево 
//
Процедура ВыборСертификатаДляПодписанияИлиРасшифровки(ПараметрыФормы) Экспорт

	МодульЭлектроннаяПодписьСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьСлужебныйКлиент");
	
	Если МодульЭлектроннаяПодписьСлужебныйКлиент <> Неопределено Тогда
		МодульЭлектроннаяПодписьСлужебныйКлиент.ВыборСертификатаДляПодписанияИлиРасшифровки(ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры

// При открытии подписанта.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Элемент - ПолеФормы
//  СтандартнаяОбработка - Булево
//
Процедура ПодписантПриОткрытии(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	Если ИнтеграцияБСПБЭДСлужебныйКлиентСервер.ВерсияБСППоддерживаетГосключ(Форма.ТекущаяВерсияБСП) Тогда

		МодульЭлектроннаяПодписьКлиентЛокализация = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиентЛокализация");
		Если МодульЭлектроннаяПодписьКлиентЛокализация <> Неопределено Тогда
			МодульЭлектроннаяПодписьКлиентЛокализация.ПодписантПриОткрытии(Форма, Элемент, СтандартнаяОбработка);
		КонецЕсли;

	Иначе

		МодульСервисМобильнойПодписиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СервисМобильнойПодписиКлиент");
		Если МодульСервисМобильнойПодписиКлиент <> Неопределено Тогда
			МодульСервисМобильнойПодписиКлиент.ПодписантПриОткрытии(ЭтотОбъект, Элемент, СтандартнаяОбработка);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти