#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	АУ_СозданиеЭлементовФормы.СоздатьГруппаКолонокТаблицыФормы(ЭтаФорма, "АУ_Печать", "Товары", 2,,,,, Элементы.ТоварыХарактеристика);
	
	Элемент = АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "ТоварыАУ_НаименованиеДляПечати", "АУ_Печать",, 1, "Объект.Товары.АУ_НаименованиеДляПечати", Новый Структура("Ширина",30));
	Элемент.КнопкаВыбора = Истина;
	Элементы.ТоварыАУ_НаименованиеДляПечати.УстановитьДействие("НачалоВыбора", "НачалоВыбораАльтернативногоНаименования");
	
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "ТоварыАУ_НаименованиеЕдиницыИзмерения", "АУ_Печать",, 1, "Объект.Товары.АУ_НаименованиеЕдиницыИзмерения", Новый Структура("Ширина",30));
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "ТоварыАУ_Шифр", "Товары",, 1, "Объект.Товары.АУ_Шифр", Новый Структура("Ширина",7),, "ТоварыНоменклатураАртикул");
	
	АУ_СозданиеЭлементовФормы.СоздатьГруппаКолонокТаблицыФормы(ЭтаФорма, "АУ_ДанныеГосПрограммы", "Товары", 2,,,, Новый Структура("Ширина",30),);
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "ТоварыАУ_НазваниеПоГосПрограмме", "АУ_ДанныеГосПрограммы",, 1, "Объект.Товары.АУ_НазваниеПоГосПрограмме", Новый Структура("Ширина",30));
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "ТоварыАУ_ДатаВводаВЭсплуатацию", "АУ_ДанныеГосПрограммы",, 1, "Объект.Товары.АУ_ДатаВводаВЭсплуатацию");
	
	Элемент=АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма,"АУ_ПричинаЗакрытия","ГруппаСтатусПриоритет","Причина закрытия",1,"Объект.АУ_ПричинаЗакрытия");
	Элементы.Переместить(Элемент,Элементы.ГруппаСтатусПриоритет,Элементы.Приоритет);
	
	НоваяКоманда = Команды.Добавить("АУ_ЗагрузитьДанные");
	НоваяКоманда.Заголовок = "Загрузить из Excel";
	НоваяКоманда.Действие = "АУ_ЗагрузитьДанные"; //указываем только имя процедуры
	
	НовыйЭлемент = Элементы.Добавить("АУ_ЗагрузитьДанные", Тип("КнопкаФормы"),Элементы.ТоварыГруппаЗаполнить);
	НовыйЭлемент.ИмяКоманды = "АУ_ЗагрузитьДанные";
	НовыйЭлемент.Вид=ВидКнопкиФормы.КнопкаКоманднойПанели;
	
	НоваяКоманда = Команды.Добавить("АУ_ПривязатьКСтрокеЗаказаПоставщика");
	НоваяКоманда.Заголовок = "Привязать к строке заказа поставщика";
	НоваяКоманда.Действие = "АУ_ПривязатьКСтрокеЗаказаПоставщика"; //указываем только имя процедуры
	
	НовыйЭлемент = Элементы.Добавить("АУ_ПривязатьКСтрокеЗаказаПоставщика", Тип("КнопкаФормы"),Элементы.ТоварыКоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "АУ_ПривязатьКСтрокеЗаказаПоставщика";
	НовыйЭлемент.Вид=ВидКнопкиФормы.КнопкаКоманднойПанели;
	
	НовыйЭлемент = Элементы.Добавить("АУ_ЗаказПоставщику", Тип("ПолеФормы"),Элементы.Товары);
	НовыйЭлемент.Заголовок = "Заказ поставщика";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.АУ_ЗаказПоставщику";
	
	НовыйЭлемент = Элементы.Добавить("АУ_КодСтроки", Тип("ПолеФормы"),Элементы.Товары);
	НовыйЭлемент.Заголовок = "ИД строки ЗП";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.АУ_КодСтроки";
	НовыйЭлемент.ТолькоПросмотр=Истина;
	
	НовыйЭлемент = Элементы.Добавить("АУ_Объект", Тип("ПолеФормы"),Элементы.Товары);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.АУ_Объект";
	
	НовыйЭлемент = Элементы.Добавить("АУ_Программа", Тип("ПолеФормы"),Элементы.ГруппаШапкаЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.АУ_Программа";
	
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма,"АУ_ОткрытьПодробнуюИнформациюОЗаказе","Открыть подробную информацию о заказе","АУ_ОткрытьПодробнуюИнформациюОЗаказе");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма,"АУ_ОткрытьПодробнуюИнформациюОЗаказе","ГруппаПодвал","","АУ_ОткрытьПодробнуюИнформациюОЗаказе",2);
	
	ГруппаПоставка = АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычнаяБезОтображения(ЭтаФорма, "АУ_ГруппаПоставка", "ГруппаПодвал", 3);
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_КоличествоДнейНаПоставку", ГруппаПоставка,, 1, "Объект.АУ_КоличествоДнейНаПоставку",, Новый Структура("ПриИзменении", "ПриИзмененииАУ_КоличествоДнейНаПоставку"));
	
	СтруктураСвойств = Новый Структура("ТолькоПросмотр", Истина);
	НовыйЭлемент = АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_КрайняяДатаПоставки", ГруппаПоставка,, 1, "Объект.АУ_КрайняяДатаПоставки", СтруктураСвойств);
	НовыйЭлемент = АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ПеренесенныйСрокИсполненияКонтракта", ГруппаПоставка,, 1, "Объект.АУ_ПеренесенныйСрокИсполненияКонтракта", СтруктураСвойств);
	
	АУ_УстановитьВидимостьДоступностьЭлементов();
	
	Если Параметры.Ключ.Пустая() Тогда
		АУ_ДоговорПриИзмененииСервер();
	КонецЕсли;
	
	АУ_ОбщиеПроцедурыИФункцииСервер.ОтключитьВидимостьНоменклатурыИзАрхиваВФормеДокумента(ЭтаФорма);
	
	Если Элементы.Найти("ТоварыГруппаЗаполнить") <> Неопределено Тогда
		
		АУ_СозданиеЭлементовФормы.СоздатьКоманду(ЭтаФорма, "АУ_ЗаполнитьХарактеристики", "Заполнить характеристики", "АУ_ЗаполнитьХарактеристики");
		АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ЗаполнитьХарактеристики", "ТоварыГруппаЗаполнить",, "АУ_ЗаполнитьХарактеристики", 1);
		АУ_СозданиеЭлементовФормы.СоздатьКнопка(ЭтаФорма, "АУ_ЗаполнитьХарактеристики1", "ТоварыКонтекстноеМеню",, "АУ_ЗаполнитьХарактеристики", 1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АУ_ПриЗаписиНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Элементы.Договор.Видимость И НЕ ЗначениеЗаполнено(ТекущийОбъект.Договор) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнен договор !",ТекущийОбъект.Ссылка,"Договора","Объект.Договор",Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементов

&НаКлиенте
Процедура АУ_СтатусПриИзмененииПосле(Элемент)
	
	АУ_УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗагрузитьДанные(Команда)
	
	ОткрытьФорму("Обработка.АУ_ЗагрузкаДанныхВДокументы.Форма.ЗагрузкаВЗаказКлиента",,ЭтаФорма,,,,Новый ОписаниеОповещения("АУ_ЗагрузкаДанныхЗавершение",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗагрузкаДанныхЗавершение(Значение,ДопПараметры) Экспорт
	
	Если ЭтоАдресВременногоХранилища(Значение) Тогда
		АУ_ЗагрузкаДанныхЗавершениеСервер(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ПривязатьКСтрокеЗаказаПоставщика(Команда)
	
	Если Элементы.Товары.ТекущаяСтрока=Неопределено ИЛИ Элементы.Товары.ВыделенныеСтроки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.АУ_ФормаВыбораСтрокиЗаказаПоставщику",,ЭтаФорма,,,,Новый ОписаниеОповещения("АУ_ПриВыбореСтрокиЗаказаПоставщика",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ОткрытьПодробнуюИнформациюОЗаказе(Команда)
	
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.АУ_ФормаПодробнойИнформацииПоЗаказу",Новый Структура("ЗаказКлиента",Объект.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ТоварыПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		ТекущиеДанные.КодСтроки = ПолучитьПоследнийКодСтроки(Объект)+1;
		ТекущиеДанные.Обособленно = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораАльтернативногоНаименования(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.АУ_ЗагрузкаДанныхВДокументы.Форма.ФормаВыбораАльтернативногоНаименованияНоменклатуры", Новый Структура("Номенклатура", Элементы.Товары.ТекущиеДанные.Номенклатура), Элемент,,,,Новый ОписаниеОповещения("ЗавершениеВыбораАльтернативногоНаименования", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораАльтернативногоНаименования(Значение, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Элементы.Товары.ТекущиеДанные.АУ_НаименованиеДляПечати = Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АУ_ЗагрузкаДанныхЗавершениеСервер(АдресХранилища)
	
	ТЗ=ПолучитьИзВременногоХранилища(АдресХранилища);
	КодСтроки=ПолучитьПоследнийКодСтроки(Объект)+1;
	Для каждого стрТЗ Из ТЗ Цикл
		
		КодСтроки=КодСтроки+1;
		НоваяСтрока=Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура=стрТЗ.Номенклатура;
		НоваяСтрока.КоличествоУпаковок=стрТЗ.Количество;
		НоваяСтрока.Количество=стрТЗ.Количество;
		НоваяСтрока.Цена=стрТЗ.Цена;
		НоваяСтрока.Сумма=стрТЗ.Сумма;
		НоваяСтрока.СтавкаНДС=стрТЗ.СтавкаНДС;
		НоваяСтрока.СуммаНДС=стрТЗ.СуммаНДС;
		НоваяСтрока.СуммаСНДС=стрТЗ.Сумма;
		НоваяСтрока.КодСтроки=КодСтроки;
		НоваяСтрока.КлючСвязи=КодСтроки;
		НоваяСтрока.Склад=Объект.Склад;
		НоваяСтрока.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.НеТребуется;
		НоваяСтрока.ИдентификаторСтроки=Новый УникальныйИдентификатор;
		
		КодСтроки=КодСтроки+1;
		
	КонецЦикла;
	
	Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ПриВыбореСтрокиЗаказаПоставщика(Значение,ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Модифицированность=Истина;
		
		Для каждого стрСтрока Из Элементы.Товары.ВыделенныеСтроки Цикл
			стрТовары=Объект.Товары.НайтиПоИдентификатору(стрСтрока);
			стрТовары.АУ_ЗаказПоставщику=Значение.Заказ;
			стрТовары.АУ_КодСтроки=Значение.ИдентификаторСтроки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&После("РазбитьСтрокуЗавершение")
Процедура АУ_РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры)
	
	Если НоваяСтрока <> Неопределено Тогда
		НоваяСтрока.КодСтроки = ПолучитьПоследнийКодСтроки(Объект)+1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&Перед("Подключаемый_ОбработатьЗаписьОбъекта")
Процедура АУ_Подключаемый_ОбработатьЗаписьОбъекта()
	АУ_ИсправитьКоды();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииАУ_КоличествоДнейНаПоставку(Элемент)
	
	Объект.АУ_КрайняяДатаПоставки = АУ_ОбщиеПроцедурыИФункцииВызовСервера.РассчитатьКрайниеДатыПоставокПоЗаказам(Объект.Договор, Объект.АУ_КоличествоДнейНаПоставку);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗаполнитьХарактеристики(Команда)
	
	ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора",, ЭтаФорма, Новый УникальныйИдентификатор,,, Новый ОписаниеОповещения("АУ_ЗаполнитьХарактеристикиЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АУ_ЗаполнитьХарактеристикиЗавершение(Значение, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Для каждого стр Из Элементы.Товары.ВыделенныеСтроки Цикл
			
			стрТовары = Объект.Товары.НайтиПоИдентификатору(стр);
			Если стрТовары.ХарактеристикиИспользуются Тогда
				стрТовары.Характеристика = Значение;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура АУ_УстановитьВидимостьДоступностьЭлементов()
	
	Элементы.АУ_ПричинаЗакрытия.Видимость= (Объект.Статус=Перечисления.СтатусыЗаказовКлиентов.Закрыт);
	
	Если Объект.Договор.АУ_ВариантУказанияСроковПоставки = Перечисления.АУ_ВариантыУказанияСроковПоставки.ВЗаказах Тогда
		Элементы.АУ_КоличествоДнейНаПоставку.Видимость = Истина;
	Иначе
		Элементы.АУ_КоличествоДнейНаПоставку.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнийКодСтроки(ЗНАЧ ТекОбъект)
	
	Результат=1;
	Для каждого стрТовары Из ТекОбъект.Товары Цикл
		Результат=Макс(стрТовары.КодСтроки,Результат);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура АУ_ИсправитьКоды()
	
	Для каждого стрТовары Из Объект.Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(стрТовары.КодСтроки) Тогда
			стрТовары.КодСтроки=ПолучитьПоследнийКодСтроки(Объект)+1;
			Продолжить;
		КонецЕсли;
			
		НайденныеСтроки=Объект.Товары.НайтиСтроки(Новый Структура("КодСтроки",стрТовары.КодСтроки));
		Если НайденныеСтроки.Количество()>1 Тогда
			Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
				Если стрНайденныеСтроки<>стрТовары Тогда
					стрТовары.КодСтроки=ПолучитьПоследнийКодСтроки(Объект)+1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
&После("ДоговорПриИзмененииСервер")
Процедура АУ_ДоговорПриИзмененииСервер()
	
	Объект.АУ_КоличествоДнейНаПоставку = Объект.Договор.АУ_КоличествоДнейНаПоставку;
	Объект.АУ_КрайняяДатаПоставки = АУ_ОбщиеПроцедурыИФункцииВызовСервера.РассчитатьКрайниеДатыПоставокПоЗаказам(Объект.Договор, Объект.АУ_КоличествоДнейНаПоставку);
	
КонецПроцедуры

#КонецОбласти




