
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УточнениеТипаЛогистика = "";
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		Форма = ПараметрыВыполненияКоманды.Источник;
		Если Форма.Элементы.Найти("ТипЛогистика") <> Неопределено Тогда
			УточнениеТипаЛогистика = Форма.ТипЛогистика;
		КонецЕсли;
	Иначе
		Форма = Неопределено;
	КонецЕсли;
	
	ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика", ПараметрКоманды, УточнениеТипаЛогистика);
									
	Если ПараметрКоманды.Количество() = 1 Тогда // через форму документа 
		
		ДокументСсылка = ПараметрКоманды[0];
		
		Если ЗначениеЗаполнено(УточнениеТипаЛогистика) Тогда		
			ТипыЛогистикаДляДокумента = Новый Массив;
			ТипыЛогистикаДляДокумента.Добавить(УточнениеТипаЛогистика);			
		Иначе
			ТипыЛогистикаДляДокумента = ТипыЛогистикаПоДокументу1ССервер(ДокументСсылка);
		КонецЕсли;
		
		// при неоднозначном определении документа мерк - спросим
		Если ТипыЛогистикаДляДокумента.Количество() = 1 Тогда
			
			ВвестиДокументЛогистикаПоДокументу1С(ТипыЛогистикаДляДокумента[0], ПараметрыВводаДокументов);
			
		Иначе
			
			СписокВыбора = новый СписокЗначений;
			СписокВыбора.ЗагрузитьЗначения(ТипыЛогистикаДляДокумента);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьИзСписка_КонтурЛогистика(СписокВыбора,
			,
			ЭтотОбъект,
			"ВвестиДокументЛогистикаПоДокументу1С",
			ПараметрыВводаДокументов,
			Форма);
			
		КонецЕсли;
		
	Иначе // без открытия форм
		
		ВвестиДокументыПакетно(Истина, ПараметрыВводаДокументов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДокументЛогистикаПоДокументу1С(ТипЛогистикаДляДокумента, ПараметрыВводаДокументов) Экспорт
	
	Если ТипЗнч(ТипЛогистикаДляДокумента) = Тип("ЭлементСпискаЗначений") Тогда 
		ТипЛогистикаДляДокумента = ТипЛогистикаДляДокумента.Значение;
	КонецЕсли;
	
	ДокументСсылка = ПараметрыВводаДокументов.МассивДокументов[0];
	ТипЛогистика = ПараметрыВводаДокументов.УточнениеТипаЛогистика;
	
	КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаПоДокументу1С(ТипЛогистикаДляДокумента, ДокументСсылка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДокументыПакетно(Подтверждено = Истина, ПараметрыВводаПакетно) Экспорт
	
	МассивДокументов = ПараметрыВводаПакетно.МассивДокументов;
	ТипЛогистика = ПараметрыВводаПакетно.УточнениеТипаЛогистика;
	
	Если Подтверждено = Истина ИЛИ Подтверждено = КодВозвратаДиалога.Да Тогда 
		
		// TODO реализовать многопоточный фоновый ввод докумнет
		Если Истина Тогда // МассивДокументов.Количество() < 10 Тогда
			
			ВвестиДокументыПакетноСервер(МассивДокументов, ТипЛогистика);
			Оповестить("КонтурЛогистика_ВвестиДокумент");
			
		//Иначе
		//	
		//	ЭлементовВПотоке = КонтурЛогистика_ОбработкаДокументовКлиент.ОпределитьКоличествоЭлеменовПотокаВводаДокументов(МассивДокументов);
		//	й = 0;
		//	МассивДокументовПотока = Новый Массив;
		//	
		//	Пока й < МассивДокументов.Количество() Цикл 
		//		
		//		МассивДокументовПотока.Добавить(МассивДокументов[й]);
		//		
		//		Если (й + 1) % ЭлементовВПотоке = 0 Тогда
		//			
		//			КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеВыполнениеСотслеживаниемВНовойФорме("КонтурЛогистика_ДлительныеОперацииСервер.ПакетныйВводДокументовПодсистемы",
		//				"ВводДокументов_" + Строка(Новый УникальныйИдентификатор),
		//				Новый Структура("МассивДокументов,СразуВОчередь,УточнениеТипаЛогистика", МассивДокументовПотока, Ложь, УточнениеТипаЛогистика),
		//				"Фоновый ввод документов Логистика",
		//				Истина,
		//				Ложь);
		//				МассивДокументовПотока = Новый Массив;
		//			
		//		КонецЕсли;
		//		
		//		й = й + 1;
		//		
		//	КонецЦикла;										
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// действия с документами
&НаСервере
Процедура ВвестиДокументыПакетноСервер(МассивДокументов, УточнениеТипаЛогистика = Неопределено)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументыПакетно(МассивДокументов, Ложь, УточнениеТипаЛогистика);

КонецПроцедуры


// вспомогательные
&НаСервере
Функция ТипыЛогистикаПоДокументу1ССервер(ДокументСсылка)

	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьТипыЛогистикаПоДокументу1С(ДокументСсылка);	

КонецФункции

&НаКлиенте
Процедура ОбработчикОповеститьОВыполненииКоманды(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт

	Оповестить("КонтурЛогистика_ВвестиДокумент");

КонецПроцедуры

