#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ЗакрытаПользователем - Неопределено,Булево
//  КонтекстОжиданияОперации - см. ОжиданиеОперацийБЭДКлиент.НовыйКонтекст
Процедура ЗакрытиеФормы(ЗакрытаПользователем, КонтекстОжиданияОперации) Экспорт

	ЗакрытаПользователем = ?(ЗакрытаПользователем = Неопределено, Ложь, ЗакрытаПользователем);
	Если ЗакрытаПользователем Тогда
		ВыполнитьОбработкуОповещения(КонтекстОжиданияОперации.ОбработчикПрерывания);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//  КонтекстОжиданияОперации - См. ОжиданиеОперацийБЭДКлиент.НовыйКонтекст
//  ДополнительныеПараметры - Неопределено
Процедура ОбновлениеПрогресса(КонтекстОжиданияОперации, ДополнительныеПараметры) Экспорт
	
	Оповестить(ОжиданиеОперацийБЭДСлужебныйКлиентСервер.ИмяСобытияОбновленияПрогресса(), КонтекстОжиданияОперации);

КонецПроцедуры

// Параметры:
//  КонтекстОжиданияОперации - См. ОжиданиеОперацийБЭДКлиент.НовыйКонтекст
//  ДополнительныеПараметры - Неопределено
Процедура ПередИнтерактивнымДействием(КонтекстОжиданияОперации, ДополнительныеПараметры) Экспорт
	
	Оповестить(ОжиданиеОперацийБЭДСлужебныйКлиентСервер.ИмяСобытияПередИнтерактивнымДействием(),
		КонтекстОжиданияОперации);

КонецПроцедуры

// Параметры:
//  КонтекстОжиданияОперации - См. ОжиданиеОперацийБЭДКлиент.НовыйКонтекст
//  ДополнительныеПараметры - Неопределено
Процедура ПослеИнтерактивногоДействия(КонтекстОжиданияОперации, ДополнительныеПараметры) Экспорт

	ОжиданиеОперацийБЭДКлиент.ОткрытьФормуОжидания(КонтекстОжиданияОперации.ФормаВладелец, КонтекстОжиданияОперации);

КонецПроцедуры

#КонецОбласти