#Область ПрограммныйИнтерфейс

#Область ПараметрыВыбора

// Устанавливает параметры выбора номенклатуры.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой нужно установить параметры выбора
//  ВидыПродукции - СправочникСсылка.ВидыПродукцииИС, Массив Из СправочникСсылка.ВидыПродукцииИС - Вид продукции.
//  ИмяПоляВвода - Строка - имя поля ввода номенклатуры.
Процедура УстановитьПараметрыВыбораНоменклатуры(Форма, ВидыПродукции = Неопределено, ИмяПоляВвода = "ТоварыНоменклатура") Экспорт
	
	ПараметрыВыбора = Новый Массив;
	
	Для Каждого ПараметрВыбора Из Форма.Элементы[ИмяПоляВвода].ПараметрыВыбора Цикл
		Если ПараметрВыбора.Имя <> "Отбор.ВидПродукцииИС"
			И ПараметрВыбора.Имя <> "Отбор.АлкогольнаяПродукцияВоВскрытойТаре"
			И ПараметрВыбора.Имя <> "Отбор.ТипНоменклатуры" Тогда
			ПараметрыВыбора.Добавить(ПараметрВыбора);
		КонецЕсли;
	КонецЦикла;
	
	ВидыПродукцииИС = Новый Массив;
	Если ТипЗнч(ВидыПродукции) = Тип("Массив") Или ТипЗнч(ВидыПродукции) = Тип("ФиксированныйМассив") Тогда
		ВидыПродукцииИС = ВидыПродукции;
	ИначеЕсли ТипЗнч(ВидыПродукции) = Тип("СправочникСсылка.ВидыПродукцииИС")
		И ЗначениеЗаполнено(ВидыПродукции) Тогда
		ВидыПродукцииИС.Добавить(ВидыПродукции);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидыПродукцииИС) Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ТипНоменклатуры", ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар")));
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидПродукцииИС", ВидыПродукцииИС));
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.АлкогольнаяПродукцияВоВскрытойТаре", Ложь));
	КонецЕсли;
	
	Форма.Элементы[ИмяПоляВвода].ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
