#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Контрагент  = Параметры.Контрагент;
	Основание  =  Параметры.Основание;
	
	Если Не ЗначениеЗаполнено(Основание) Тогда
		ВидыОперацийВСтранахЕАЭС = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
		ВидыОперацийВСтранахЕАЭС.Добавить(Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчикаВСтранахЕАЭС2_5);
		ОперацииВСтранахЕАЭС.ЗагрузитьЗначения(ВидыОперацийВСтранахЕАЭС);
		
		ПередаваемыеПараметры = Новый Структура;
		ПередаваемыеПараметры.Вставить("ТолькоПросмотр", Параметры.ТолькоПросмотр);
		ПередаваемыеПараметры.Вставить("Организация", Организация);
		
		СписокТиповДокументов(Организация, ТипОснования, ВидыОперацийВСтранахЕАЭС);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Основание) Тогда
		
		МассивДокументов = Новый Массив();
		МассивДокументов.Добавить(Основание);
		Закрыть(МассивДокументов);
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, МассивДокументов);
		Возврат;
		
	КонецЕсли;
	
	КоличествоТиповОснований = ТипОснования.Количество();
	
	Если КоличествоТиповОснований = 0 Тогда
		
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru='Отсутствуют документы, на основании которых можно заполнить отчет'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипОснования

&НаКлиенте
Процедура ТипОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
	
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru='Поле ""Контрагент"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = ПараметрыВыбора(ПередаваемыеПараметры);
	ОткрытьФормуВыбораОснования(ТипОснования, Элементы.ТипОснования.ТекущаяСтрока, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
	
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru='Поле ""Контрагент"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	Если ТипОснования.Количество() > 0 Тогда
		
		ПараметрыФормы = ПараметрыВыбора(ПередаваемыеПараметры);
		ОткрытьФормуВыбораОснования(ТипОснования, Элементы.ТипОснования.ТекущаяСтрока, ПараметрыФормы);
		
	Иначе
		
		ОписаниеОповещенияОЗакрытии = Неопределено;
		Закрыть(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	ОписаниеОповещенияОЗакрытии = Неопределено;
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуВыбораОснования(Знач ТипОснования, Знач Индекс, Знач ПередаваемыеПараметры)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ИмяФормыВыбора = "Документ." + ТипОснования[Индекс].Значение + ".ФормаВыбора";
	
	Для Каждого Параметр Из ПередаваемыеПараметры Цикл
		
		ПараметрыФормы.Вставить(Параметр.Ключ, Параметр.Значение);
		
	КонецЦикла;
	
	Отбор = ПараметрыФормы.Отбор;
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Отбор.Вставить("Контрагент", Контрагент);
	КонецЕсли;
	
	Если УстанавливатьОтборПоХозОперации(ТипОснования[Индекс].Значение) Тогда
		Отбор.Вставить("ХозяйственнаяОперация", ОперацииВСтранахЕАЭС);
	КонецЕсли;
		
	ОткрытьФорму(ИмяФормыВыбора, ПараметрыФормы, ВладелецФормы,,,,
		ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ОписаниеОповещенияОЗакрытии = Неопределено;
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокТиповДокументов(Знач Организация, СписокТиповДокументов, ОперацииВСтранахЕАЭС)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОперацииВСтранахЕАЭС", ОперацииВСтранахЕАЭС);
	
	МассивТекстовЗапросов = Новый Массив();
	ЕстьПравоЧтения = ПравоДоступа("Чтение", Метаданные.Документы.ПриобретениеТоваровУслуг); 
	Если ЕстьПравоЧтения Тогда
	
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	""ПриобретениеТоваровУслуг"" КАК ТипДокумента
			|ИЗ
			|	Документ.ПриобретениеТоваровУслуг КАК ТипыДокументов
			|ГДЕ
			|	ТипыДокументов.Организация = &Организация
			|	И ТипыДокументов.ХозяйственнаяОперация В (&ОперацииВСтранахЕАЭС)
			|	И НЕ ТипыДокументов.ПометкаУдаления
			|";
		МассивТекстовЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	
	ЕстьПравоЧтения = ПравоДоступа("Чтение", Метаданные.Документы.ЗаявкаНаВозвратТоваровОтКлиента);
	Если ЕстьПравоЧтения Тогда
	
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	""ЗаявкаНаВозвратТоваровОтКлиента""
			|ИЗ
			|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ТипыДокументов
			|ГДЕ
			|	ТипыДокументов.Организация = &Организация
			|	И НЕ ТипыДокументов.ПометкаУдаления
			|";
		МассивТекстовЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	ЕстьПравоЧтения = ПравоДоступа("Чтение", Метаданные.Документы.ЗаказПоставщику);
	Если ЕстьПравоЧтения Тогда
	
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	""ЗаказПоставщику""
			|ИЗ
			|	Документ.ЗаказПоставщику КАК ТипыДокументов
			|ГДЕ
			|	ТипыДокументов.Организация = &Организация
			|	И ТипыДокументов.ХозяйственнаяОперация В (&ОперацииВСтранахЕАЭС)
			|	И НЕ ТипыДокументов.ПометкаУдаления
			|";
		МассивТекстовЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	
	Если МассивТекстовЗапросов.Количество() > 0 Тогда
		
		Запрос.Текст = СтрСоединить(МассивТекстовЗапросов, ОбщегоНазначения.ТекстОбъединитьВсе());
	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СписокТиповДокументов.Добавить(Выборка.ТипДокумента, Документы[Выборка.ТипДокумента].ПустаяСсылка().Метаданные());
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыВыбора(ПередаваемыеПараметры)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПросмотр", ПередаваемыеПараметры.ТолькоПросмотр);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПометкаУдаления", Ложь);
	Отбор.Вставить("Проведен",        Истина);
	
	Если ЗначениеЗаполнено(ПередаваемыеПараметры.Организация) Тогда
		Отбор.Вставить("Организация", ПередаваемыеПараметры.Организация);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Функция УстанавливатьОтборПоХозОперации(ТипДокумента)
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить("ПриобретениеТоваровУслуг");
	СписокТипов.Добавить("ЗаказПоставщику");
	СписокТипов.Добавить("ЗаказПереработчику2_5");
	
	Если СписокТипов.НайтиПоЗначению(ТипДокумента) <> Неопределено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти