
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗаполнитьАвтоматически();	
	ОповеститьОбИзменении(Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииСправочников"));
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоматически()

	Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.УдалитьВсеНастройки();
	Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ЗаполнитьАвтоматическиДляТекущейКонфигурации();

КонецПроцедуры
