// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.МаршрутРейса);
	НастройкиОтчета.ФункциональныеОпции.Добавить("НеИспользоватьУправлениеДоставкой20");
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Ложь);
	ВариантыОтчетовУТПереопределяемый.ОтключитьОтчет(НастройкиОтчета);
	
КонецПроцедуры

#КонецОбласти

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//   КлючВарианта - Строка - 
//   
//	Возвращаемое значение:
//		СтрокаТаблицыЗначений - описание созданной команды.
//
Функция ДобавитьКомандуОтчета(КомандыОтчетов, Параметры, КлючВарианта = "") Экспорт
	
	КомандаОтчет = Неопределено;
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.МаршрутРейса) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.МаршрутРейса.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Маршрут рейса'");
		КомандаОтчет.МножественныйВыбор = Ложь;
		КомандаОтчет.Неконтекстный = Ложь;
		КомандаОтчет.РежимЗаписи = "Проводить";
		КомандаОтчет.ФункциональныеОпции = "НеИспользоватьУправлениеДоставкой20";
		КомандаОтчет.Важность = "Обычное";
		
	КонецЕсли;
	
	Возврат КомандаОтчет;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли