&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

&НаКлиенте
Перем ДанныеДляПоказа Экспорт;

&НаКлиенте
Процедура СкрытьПустыеПриИзменении(Элемент)	
	ЗаполнитьТаблицу();		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии()
	Заголовок = НСтр("be = 'Cleverence'; en = 'Cleverence'; es = 'Cleverence'; ka = 'Cleverence'; kk = 'Cleverence'; ro = 'Cleverence'; ru = 'Клеверенс'; tr = 'Cleverence'; uk = 'Cleverence'; uz = 'Cleverence'") 
		+ ": " + ДанныеЗаголовка;
	ЗаполнитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу()
	
	ТаблицаРеквизитов.Очистить();
	Если ТипЗнч(ДанныеДляПоказа) = Тип("Структура") Тогда
		Для Каждого РеквизитШапки Из ДанныеДляПоказа Цикл
			Если СкрытьПустые И НЕ ЗначениеЗаполнено(РеквизитШапки.Значение) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			НоваяСтрока.ИмяРеквизита = РеквизитШапки.Ключ;
			НоваяСтрока.ЗначениеРеквизита = РеквизитШапки.Значение;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаРеквизитов.Сортировать("ИмяРеквизита");
	
КонецПроцедуры

