#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОбновитьДанныеФормы();

	НастройкаКонвертации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьНастройкуКонвертации(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02);
	
	Если НастройкаКонвертации <> Неопределено Тогда 
		Элементы.ГруппаДокументОснование.Видимость = ЗначениеЗаполнено(НастройкаКонвертации.ТипДокумента1С);
	КонецЕсли;
	
	ЭлементыДляРазрешенияРедактирования = Новый Массив;
	ЭлементыДляРазрешенияРедактирования.Добавить("ГруппаЭП");
	ЭлементыДляРазрешенияРедактирования.Добавить("ГруппаДанныеФайлаТитула3");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ЭлементыДляРазрешенияРедактирования);
	
	Титул1Прицеп = Объект.Титул1.Прицеп;
	Титул1Прицеп2 = Объект.Титул1.Прицеп2;
	Титул1ТипТС   = Объект.Титул1.ТранспортноеСредство.ТипТСПоКлассификатору;
	
	Если ЗначениеЗаполнено(Объект.Титул1.ТранспортноеСредство) Тогда
		ТопливоПоУмолчанию = Объект.Титул1.ТранспортноеСредство.ТопливоПоУмолчанию;
	КонецЕсли;
		
	ЗаполнитьПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюИДоступностью();
	ПроверитьДокумент();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
	УстановитьЗаголовкиГруппамДопПолей();
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоИнтерфейс82() Тогда
		Элементы.ОстаткиТоплива.РастягиватьПоВертикали = Ложь;
		Элементы.ИнфПолОстаткиТоплива.РастягиватьПоВертикали = Ложь;
		Элементы.Заправки.РастягиватьПоВертикали = Ложь;
		Элементы.ИнфПолЗаправки.РастягиватьПоВертикали = Ложь;
		Элементы.ИнфПол.РастягиватьПоВертикали = Ложь;
		Элементы.ДополнительныеПолучателиФайла.РастягиватьПоВертикали = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
				
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_Перепроверить"
		И Параметр <> Неопределено
		И ТипЗнч(Параметр) = Тип("Массив")
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		
		Перепроверить();
		
	ИначеЕсли ИмяСобытия = "ПерезаполнитьТитул"
		И Параметр <> Неопределено
		И Параметр = Объект.Ссылка Тогда
		
		ПерезаполнитьПоДокОснованиюСервер();
		ОбновитьДанныеФормы();
		ОбновитьОтображениеДанных();
		ПроверитьДокумент();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)
	
	ОбработчикПеречитатьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуКонвертации(Команда)

	КонтурЛогистика_ОбработкаДокументовКлиент.ОткрытьНастройкуКонвертации(
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02"), Объект.ДокументОснование);

КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитов(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.РазрешитьРедактированиеРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОснование(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаДокументОснование(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяТехосмотраСейчас(Команда)
	
	Объект.ДатВрОдометр = ТекущаяДата();
	ПроверитьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПунктКолбасыНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоКолбасеКТитулу(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПодписантПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаОтказаВПодписиПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатВрПрМОПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияОдометраПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПриОчисткеДокументаОснование(ЭтаФорма, Объект.ДокументОснование);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличныхЧастей

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТопливаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТопливаПослеУдаления(Элемент)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТопливаПриАктивизацииСтроки(Элемент)
	
	ОтборСтрок = Неопределено;

	Если Не Элемент.ТекущиеДанные = Неопределено Тогда

		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОстатковТоплива", Элемент.ТекущиеДанные.ИдентификаторСтроки);

	КонецЕсли;

	Элементы.ИнфПолОстаткиТоплива.ОтборСтрок = ОтборСтрок;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолОстаткиТопливаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда

		ТекСтрокаОстатковГСМ = Элементы.ОстаткиТоплива.ТекущиеДанные;

		Элемент.ТекущиеДанные.ИдентификаторСтрокиОстатковТоплива = ТекСтрокаОстатковГСМ.ИдентификаторСтроки;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТопливаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда

		Элемент.ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолОстаткиТопливаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолОстаткиТопливаПослеУдаления(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолПослеУдаления(Элемент)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиПриАктивизацииСтроки(Элемент)
	
	ОтборСтрок = Неопределено;

	Если Не Элемент.ТекущиеДанные = Неопределено Тогда

		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиЗаправок", Элемент.ТекущиеДанные.ИдентификаторСтроки);

	КонецЕсли;

	Элементы.ИнфПолЗаправки.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда

		Элемент.ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиПослеУдаления(Элемент)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолЗаправкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда

		ТекСтрокаЗаправок = Элементы.Заправки.ТекущиеДанные;

		Элемент.ТекущиеДанные.ИдентификаторСтрокиЗаправок = ТекСтрокаЗаправок.ИдентификаторСтроки;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолЗаправкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолЗаправкиПослеУдаления(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТопливаТопливоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.ОстаткиТоплива.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьДубли = Ложь;
		
	Для Каждого ТекущийОстаток Из Объект.ОстаткиТоплива Цикл
		Если ТекущийОстаток.Топливо = ВыбранноеЗначение Тогда
			ЕстьДубли = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьДубли Тогда
		Сообщить("В таблице уже есть " + Строка(ВыбранноеЗначение));
		Возврат;
	КонецЕсли;
	
	Элементы.ОстаткиТоплива.ТекущиеДанные.Топливо = ВыбранноеЗначение;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТопливаКоличествоТопливаПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиКоличествоТопливаПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	    
	Если ЗначениеЗаполнено(ТопливоПоУмолчанию) Тогда
		
		Отказ = Истина;
		
		НоваяСтрока = Объект.Заправки.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		НоваяСтрока.Топливо = ТопливоПоУмолчанию;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПослеУдаления(Элемент)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеФормы

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ЭтоВходящий = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен");
	ЭтоЧерновик = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
	ЭтоИсправлениеОшибки = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка");
	
	Элементы.ГруппаПодписантРеквизиты.Видимость = ЗначениеЗаполнено(Объект.Фамилия);
	
	Элементы.Титул1Прицеп.Видимость = ЗначениеЗаполнено(Титул1Прицеп);
	Элементы.Титул1Прицеп2.Видимость = ЗначениеЗаполнено(Титул1Прицеп2);
		
	Элементы.ПоказанияОдометра.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.ПоказанияОдометра) И
		(Титул1ТипТС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыТранспортныхСредств.Легковой")
		Или Титул1ТипТС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыТранспортныхСредств.Автобус")
		Или Титул1ТипТС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыТранспортныхСредств.Грузовой"));
		
	Элементы.ГруппаДатаФормированияФайла.Видимость = ЗначениеЗаполнено(Объект.ДатИнфВозвр);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьДанныеФормы();
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(ЭтаФорма, Объект.ДокументОснование);
	УправлениеКолбасойТитуловВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Повторно подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Переотправить неподписанный (черновик)";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Отправить неподписанный (черновик)";
	КонецЕсли;

	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, Объект.ДокументОснование, 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус, ТребуемоеДействие);
	
	КонтурЛогистика_ОбработкаДокументовСервер.ПЛ_ФормаДокумента_УстановитьВидимостьВЗависимостиОтСтатуса(ЭтаФорма);
	
	СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");
	Если Элементы.Найти("ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы.Видимость = СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовкиГруппамДопПолей()
	
	// ГруппаИнфПоля
	Элементы.ГруппаИнфПоля.Заголовок = "Информационные поля (" + Объект.ИнфПол.Количество() +")";
	
	// ГруппаДопПолучатели
	Элементы.ГруппаДопПолучатели.Заголовок = "Доп. получатели файла (" + Объект.ДополнительныеПолучателиФайла.Количество() +")";
	
	// Остатки топлива
	Элементы.СтраницаОстаткиТоплива.Заголовок = "Остатки топлива (" + Объект.ОстаткиТоплива.Количество() +")";
	
	// Заправки
	Элементы.СтраницаЗаправки.Заголовок = "Заправки (" + Объект.Заправки.Количество() +")";
					
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеКолбасойТитуловВызовСервера()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УправлениеСтатусомПодписиИКолбасойТитулов(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()
	
	Объект.ОстаткиТоплива.Очистить();
	Объект.ИнфПолОстаткиТоплива.Очистить();
	Объект.Заправки.Очистить();
	Объект.ИнфПолЗаправки.Очистить();
	Объект.ИнфПол.Очистить();
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02, Объект.ДокументОснование);
	
	ДокОбъект.ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации);
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	ВсегдаВыводитьРезультатВалидации = ВсегдаВыводитьРезультатВалидации();
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки, ВсегдаВыводитьРезультатВалидации);
	
	УправлениеВидимостьюИДоступностью();
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	Титул1ТипТС = Объект.Титул1.ТранспортноеСредство.ТипТСПоКлассификатору;
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ПЛ_Титул4_5_02.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикРазрешенияПолномочий(Параметр1, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработчикРазрешенияПолномочий(ЭтаФорма, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчанию()
	
	Если ЗначениеЗаполнено(ТопливоПоУмолчанию) И Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		НоваяСтрока = Объект.ОстаткиТоплива.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		НоваяСтрока.Топливо = ТопливоПоУмолчанию;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВсегдаВыводитьРезультатВалидации()
	
	Возврат ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПустаяСсылка")
		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
	
КонецФункции

#КонецОбласти


