#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НаименованиеСправочникаПользователей = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"НаименованиеСправочникаПользователей", "Пользователи");
	ЕстьСправочникПользователей = КонтурЗакупки_ЛокализацияСервер.ЕстьСправочник(НаименованиеСправочникаПользователей);
	Элементы.Ответственный.Видимость = ЕстьСправочникПользователей;
	Если ЕстьСправочникПользователей Тогда
		Элементы.Ответственный.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка."
			+ НаименованиеСправочникаПользователей);
		Если Объект.Ссылка.Пустая() Тогда
			Ответственный = КонтурЗакупки_ЛокализацияВызовСервера.ПолучитьТекущегоПользователя();
		Иначе
			Ответственный = КонтурЗакупки_ЛокализацияВызовСервера.ПолучитьСсылкуНаСправочникИзПривязки(
		Объект.Ссылка, "Справочники." + НаименованиеСправочникаПользователей, "Ответственный");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОтветственныйПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ОтветственныйПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтветственныйПриИзмененииНаСервере()
	КонтурЗакупки_ЛокализацияВызовСервера.УстановитьОтветственного(Объект.Ссылка, Ответственный);
КонецПроцедуры
#КонецОбласти