
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("СписокМЧД", СписокМЧД);
	
	Для каждого МЧД Из Параметры.СписокМЧД Цикл
		
		НоваяСтрока = СписокМЧДДляВыбора.Добавить();
		НоваяСтрока.Наименование = МЧД.Представление;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Отметка", Истина);
	
	НайдСтроки = СписокМЧДДляВыбора.НайтиСтроки(Отбор);
	Если НайдСтроки.Количество() = 0 Тогда
		Сообщить("Не выбрана ни одна МЧД для загрузки");
		Возврат;
	КонецЕсли;
	
	СписокВыбранныхМЧД = Новый СписокЗначений;
	Для каждого МЧД Из СписокМЧДДляВыбора Цикл
		
		Если МЧД.Отметка Тогда
			
			ДанныеМЧД = НайтиДанныеМЧДПоНаименованиюВСписке(МЧД.Наименование);
			НоваяСтрока = СписокВыбранныхМЧД.Добавить(ДанныеМЧД);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Закрыть(СписокВыбранныхМЧД);
	
КонецПроцедуры

&НаКлиенте
Функция НайтиДанныеМЧДПоНаименованиюВСписке(Наименование)
	
	Для каждого МЧД Из СписокМЧД Цикл
		
		Если Наименование = МЧД.Представление Тогда
			Возврат МЧД.Значение;
		КонецЕсли;		
		
	КонецЦикла
	
КонецФункции