
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда 
		ЗаполнитьАвтоматически(ПараметрКоманды);
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	ОповеститьОбИзменении(Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииСправочников"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоматически(ПараметрКоманды)

	НастройкаОбъект = ПараметрКоманды.ПолучитьОбъект();
	
	РезультатЗаполениния = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ЗаполнитьТекущуюНастройкуЗначениямиПоУмолчанию(НастройкаОбъект);
	
	Если РезультатЗаполениния.Успешно = Ложь Тогда 
		Сообщить(РезультатЗаполениния.ОписаниеОшибки);
	КонецЕсли;
	НастройкаОбъект.ПравилаКонвертации.Сортировать("Картинка");
	НастройкаОбъект.Записать();
	
КонецПроцедуры
