#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СинхронизироватьСоСправочникомУчетнойСистемыНаСервере();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.КонтурЛогистика_ОписанияОпасныхГрузов"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СинхронизироватьСоСправочникомУчетнойСистемыНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СправочникМетаданные = Метаданные.НайтиПоПолномуИмени("Справочник.КлассификаторДОПОГЭПД");
	
	Если СправочникМетаданные = Неопределено Тогда
		Сообщить("В учетной системе не найден справочник ""Классификатор ДОПОГ ЭПД"".");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторДОПОГЭПД.Код КАК Код,
	|	КлассификаторДОПОГЭПД.Наименование КАК Наименование,
	|	КлассификаторДОПОГЭПД.НаименованиеИНаписание КАК НаименованиеИНаписание,
	|	КлассификаторДОПОГЭПД.Класс КАК Класс,
	|	КлассификаторДОПОГЭПД.КлассификационныйКод КАК КлассификационныйКод,
	|	КлассификаторДОПОГЭПД.ГруппаУпаковки КАК ГруппаУпаковки,
	|	КлассификаторДОПОГЭПД.ЗнакОпасности КАК ЗнакОпасности,
	|	КлассификаторДОПОГЭПД.КодОграниченияПроездаЧерезТуннели КАК КодОграниченияПроездаЧерезТуннели
	|ИЗ
	|	Справочник.КлассификаторДОПОГЭПД КАК КлассификаторДОПОГЭПД
	|ГДЕ
	|	НЕ КлассификаторДОПОГЭПД.ПометкаУдаления";
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Сообщить("Не удалось получить данные справочника ""КлассификаторДОПОГЭПД"".
			|Ошибка: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	СозданоЭлементов = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НомерООН = "UN " + КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДополнитьСтроку_(Выборка.Код, 4, "0");
		ЗначениеКласса = СтрЗаменить(Выборка.Класс, ",", ".");
		Класс = Перечисления.КонтурЛогистика_КлассыОпасностиГрузов.ЗначениеИзXDTO(ЗначениеКласса);
		
		Описание = ОписаниеОпасногоГрузаПоНомеруИКлассу(НомерООН, Класс);
		
		Если ЗначениеЗаполнено(Описание) Тогда
			Продолжить;
		КонецЕсли;
		
		// Создадим новый элемент
		НовоеОписание = Справочники.КонтурЛогистика_ОписанияОпасныхГрузов.СоздатьЭлемент();
		НовоеОписание.НомерООН = НомерООН;
		НовоеОписание.Класс = Класс;
		НовоеОписание.Наименование = Выборка.Наименование;
		НовоеОписание.НадлежащееОтгрузочноеНаименование = Выборка.НаименованиеИНаписание;
		НовоеОписание.КлассификационныйКод = Выборка.КлассификационныйКод;
		Если Выборка.ГруппаУпаковки = "-" Тогда
			НовоеОписание.ГруппаУпаковки = Перечисления.КонтурЛогистика_ГруппыУпаковки.Отсутствует;
		ИначеЕсли Выборка.ГруппаУпаковки = "I" Тогда
			НовоеОписание.ГруппаУпаковки = Перечисления.КонтурЛогистика_ГруппыУпаковки.Группа1;
		ИначеЕсли Выборка.ГруппаУпаковки = "II" Тогда
			НовоеОписание.ГруппаУпаковки = Перечисления.КонтурЛогистика_ГруппыУпаковки.Группа2;
		ИначеЕсли Выборка.ГруппаУпаковки = "III" Тогда
			НовоеОписание.ГруппаУпаковки = Перечисления.КонтурЛогистика_ГруппыУпаковки.Группа3;
		КонецЕсли;
		НовоеОписание.ЗнакОпасности = Выборка.ЗнакОпасности;
		НовоеОписание.КодОграниченияТуннели = Выборка.КодОграниченияПроездаЧерезТуннели;
		
		НовоеОписание.Записать();
		
		СозданоЭлементов = СозданоЭлементов + 1;
		
	КонецЦикла;
	
	Если СозданоЭлементов = 0 Тогда
		Сообщить("Синхронизация завершена. Новыйх элементов нет.");
	Иначе
		Сообщить("Синхронизация завершена. Создано новых элементов: " + Строка(СозданоЭлементов));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеОпасногоГрузаПоНомеруИКлассу(НомерООН, Класс)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерООН", НомерООН);
	Запрос.УстановитьПараметр("Класс", Класс);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОписанияОпасныхГрузов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОписанияОпасныхГрузов КАК КонтурЛогистика_ОписанияОпасныхГрузов
	|ГДЕ
	|	НЕ КонтурЛогистика_ОписанияОпасныхГрузов.ПометкаУдаления
	|	И КонтурЛогистика_ОписанияОпасныхГрузов.НомерООН = &НомерООН
	|	И КонтурЛогистика_ОписанияОпасныхГрузов.Класс = &Класс";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти