#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обрабатывает нажатие на гиперссылку с настройкой интеграции к платежной системе в форме договора эквайринга.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма элемента договора эквайринга.
//  Элемент - ПолеФормы - элемент формы.
//  НавигационнаяСсылкаФорматированнойСтроки - Строка - значение гиперссылки.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура НадписьНастройкаПодключенияПлатежнойСистемыОбработкаНавигационнойСсылки(
		Форма, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	Объект = Форма.Объект; // ДанныеФормыСтруктура
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "Добавить" Тогда
		
		СтандартнаяОбработка = Ложь;

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"НастроитьПодключениеКПлатежнойСистеме", ЭтотОбъект, ДополнительныеПараметры);
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОповещения, "");
		Иначе
			ТекстВопроса = Нстр("ru = 'Перед настройкой подключения к платежной системе договор будет записан, продолжить?'");
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "СписокНастроекПодключения" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", Форма.НастройкиПодключения);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Отбор);
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"НастроитьПодключениеКПлатежнойСистемеЗавершение", Форма);
		
		ОткрытьФорму(
			"РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Форма.ФормаНастройкиПодключенияСОтбором",
			ПараметрыФормы,
			Форма,,,,
			ОписаниеОповещения);
		
	КонецЕсли
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация

Процедура НастроитьПодключениеКПлатежнойСистеме(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЭлементЗаписан = Ложь;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		ЭлементЗаписан = ДополнительныеПараметры.Форма.Записать();
	Иначе
		ЭлементЗаписан = Истина;
	КонецЕсли;
	
	Если ЭлементЗаписан Тогда

		ОписаниеОповещения = Новый ОписаниеОповещения(
			"НастроитьПодключениеКПлатежнойСистемеЗавершение", ДополнительныеПараметры.Форма);
		
		Объект = ДополнительныеПараметры.Форма.Объект; // ДанныеФормыСтруктура
		
		ДопПараметрыПодключения = Новый Структура;
		ДопПараметрыПодключения.Вставить("Договор", Объект.Ссылка);
		
		ПараметрыПодключения = НастройкиПлатежныхСистемКлиент.НовыйПараметрыПодключения(
				Неопределено,
				ДопПараметрыПодключения,
				ОписаниеОповещения,
				"");
		ПараметрыПодключения.Вставить("ТорговаяТочка", Объект.Ссылка);
		
		НастройкиПлатежныхСистемКлиент.ПодключитьПлатежнуюСистему(
			НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыСБП(), ПараметрыПодключения);

	КонецЕсли;
	
КонецПроцедуры

//-- Локализация

#КонецОбласти