
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = СформироватьНастройкиНаСервере(ПараметрКоманды);
	ТабДок.Показать("Текущие значения настроек конвертации справочника");
	
КонецПроцедуры

&НаСервере
Функция СформироватьНастройкиНаСервере(МассивНастроек)
	
	ТабДок = Новый ТабличныйДокумент;
	
	ИмяКонфигурацииДляНКС = "КЛ";
	
	Макет = Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ПолучитьМакет(ИмяКонфигурацииДляНКС);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьМакета);
	
	Для Каждого СтрокаНастроек Из МассивНастроек Цикл 
			
		// заполнение настроек из ТЧ ПравилаКонвертации	
		Для Каждого Правило Из СтрокаНастроек.ПравилаКонвертации Цикл 
			ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, Правило, "ПравилаКонвертации");
		КонецЦикла;	
		
		// заполнение настроек из ТЧ ТаблицаСоответствий
		//Для Каждого Соответствие Из СтрокаНастроек.ТаблицаСоответствий Цикл 
		//	ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, Соответствие, "ТаблицаСоответствий");
		//КонецЦикла;	
		
	КонецЦикла;

	Возврат ТабДок;
	
КонецФункции

&НаСервере
Процедура ВывестиНастройкуВТабличныйДокумент(ТабДок, Макет, СтрокаНастроек, ДанныеДляЗаполнения, ТабЧасть = "")
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШаблонСтроки");
	
	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ОписаниеОсновныхРеквизитов(СтрокаНастроек));
	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеДляЗаполнения);	
	
	//ОбластьМакета.Параметры.ТабЧасть = ТабЧасть;
	
	ОбластьМакета.Параметры.РеквизитТитула 				= ПолучитьИмяЭлементаПеречисленияПоЗначению_(ОбластьМакета.Параметры.РеквизитТитула);	
	ОбластьМакета.Параметры.СпособМаппинга 				= ПолучитьИмяЭлементаПеречисленияПоЗначению_(ОбластьМакета.Параметры.СпособМаппинга);
	ОбластьМакета.Параметры.СпособКонвертацииЗначения 	= ПолучитьИмяЭлементаПеречисленияПоЗначению_(ОбластьМакета.Параметры.СпособКонвертацииЗначения);
	
	Если ЗначениеЗаполнено(ОбластьМакета.Параметры.СпособМаппинга) 
		И ДанныеДляЗаполнения.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ФиксированноеЗначение Тогда  
		Если КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоТипСсылка(ТипЗнч(ДанныеДляЗаполнения.ВыражениеВычисления)) Тогда 
			ОбластьМакета.Параметры.ВыражениеВычисления = ПреобразованноеЗначениеФиксированногоЗначения(ДанныеДляЗаполнения.ВыражениеВычисления); 
		ИначеЕсли ТипЗнч(ДанныеДляЗаполнения.ВыражениеВычисления) = Тип("Дата") Тогда 
			ОбластьМакета.Параметры.ВыражениеВычисления = Формат(ДанныеДляЗаполнения.ВыражениеВычисления, "ггггММддЧЧммсс"); 	
		КонецЕсли;
	КонецЕсли;
	
	Если ТабЧасть = "ПравилаКонвертации" 
		И Не ЗначениеЗаполнено(ДанныеДляЗаполнения.ВыражениеВычисления) 
		И ЗначениеЗаполнено(ДанныеДляЗаполнения.ВыражениеВычисленияСтрокаНеогр) Тогда 
		ОбластьМакета.Параметры.ВыражениеВычисления = ДанныеДляЗаполнения.ВыражениеВычисленияСтрокаНеогр;	
	КонецЕсли;	
			
	ТабДок.Вывести(ОбластьМакета);
	
КонецПроцедуры

&НаСервере
Функция ОписаниеНастройкиКлючевыхПутей(РеквизитТитула, ВыражениеВычисления)
	
	Структура = Новый Структура;
	
	Структура.Вставить("РеквизитТитула", 		РеквизитТитула);
	Структура.Вставить("ВыражениеВычисления", 	ВыражениеВычисления);
	
	Возврат Структура;
	
КонецФункции	

&НаСервере
Функция ОписаниеОсновныхРеквизитов(СтрокаНастроек)
	
	Структура = Новый Структура;
		
	Структура.Вставить("Конфигурация", 					КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеНастройки("ИмяКонфигурации1С"));
	Структура.Вставить("ТипСправочникаЛогистика", 		СтрокаНастроек.ТипСправочникаЛогистика);
	Структура.Вставить("ТипСправочникаИлиДокументаУС", 	СтрокаНастроек.ТипСправочникаИлиДокументаУС);
	Структура.Вставить("ТипДокументаОснования", 		СтрокаНастроек.ТипДокументаОснования);
	Структура.Вставить("РеквизитТитула", 				СтрокаНастроек.РеквизитТитула);
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяЭлементаПеречисленияПоЗначению_(Знач ПеречислениеСсылка)
	
	Если Не ЗначениеЗаполнено(ПеречислениеСсылка) Тогда 
		Возврат "";
	КонецЕсли;	
	
	ИмяМетаданных = ПеречислениеСсылка.Метаданные().Имя;
	НазваниеМенеджера = "ПеречислениеМенеджер." + ИмяМетаданных;    
	Менеджер = Новый (НазваниеМенеджера); 
	Имя = ПеречислениеСсылка.Метаданные().ЗначенияПеречисления[Менеджер.Индекс(ПеречислениеСсылка)].Имя;
	
	Возврат Имя;
	
КонецФункции 

&НаСервере
Функция ПреобразованноеЗначениеФиксированногоЗначения(ФиксЗначение)
	
	ОМ 			= ФиксЗначение.Метаданные();
	ПолноеИмяОМ = ОМ.ПолноеИмя();
	
	Если Найти(ПолноеИмяОМ, "Перечисление") > 0 Тогда
		
		Шаблон = "%1.%2";  
		
		ИмяПеречисления 			= ОМ.Имя;
		ИндексЗначенияПеречисления 	= Перечисления[ИмяПеречисления].Индекс(ФиксЗначение);
		ИмяЗначенияПеречисления 	= Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	
		Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(Шаблон,
					СтрЗаменить(ПолноеИмяОМ, "Перечисление", "Перечисления"),
					ИмяЗначенияПеречисления);
		
	ИначеЕсли Найти(ПолноеИмяОМ, "Справочник") > 0 Тогда
		
		Шаблон = "%1.НайтиПоКоду(""%2"")";
		
		Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(Шаблон,
					СтрЗаменить(ПолноеИмяОМ, "Справочник", "Справочники"),
					ФиксЗначение.Код);  
		
	Иначе
		
		ВызватьИсключение "Не могу обработать фиксированное значение: " + ФиксЗначение;
		
	КонецЕсли;	
		
КонецФункции