
#Область ПрограммныйИнтерфейс

#Область ПолучениеВнешнихКомпонент

// Обновляет состояние элементов интернет поддержки на форме.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
Процедура ОбновитьСостояниеИнтернетПоддержки(Форма) Экспорт
	
	//++ Локализация
	
	// ИнтернетПоддержкаПользователей.ПолучениеВнешнихКомпонент
	ПодсистемаСуществуетПолучениеВнешнихКомпонент = Ложь;
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПолучениеВнешнихКомпонент") Тогда
		ПодсистемаСуществуетПолучениеВнешнихКомпонент = Истина;
	КонецЕсли;
#Иначе
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПолучениеВнешнихКомпонент") Тогда
		ПодсистемаСуществуетПолучениеВнешнихКомпонент = Истина;
	КонецЕсли;
#КонецЕсли
	
	Если ПодсистемаСуществуетПолучениеВнешнихКомпонент Тогда
		Форма.Элементы.ГруппаВнешниеКомпоненты.Видимость = Истина;
		Форма.Элементы.ДекорацияОбновлениеВнешнихКомпонентНеВыполняется.Видимость =
			(Не ОбщегоНазначенияБПОСлужебныйВызовСервера.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки()
			И Форма.НаборКонстант.ВариантОбновленияВнешнихКомпонент = 1);
		Форма.Элементы.ФайлВнешнихКомпонент.Видимость = Форма.НаборКонстант.ВариантОбновленияВнешнихКомпонент = 2;
	Иначе
		Форма.Элементы.ГруппаВнешниеКомпоненты.Видимость = Ложь;
	КонецЕсли;
	// Конец ИнтернетПоддержкаПользователей.ПолучениеВнешнихКомпонент
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ФискальныеОперации

// Дополняет колллекцию доступных видов оплат для вида документа
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма документа:
//  * Объект - ДокументОбъект - Основной реквизит формы
//  ДоступныеВидыОплаты - Структура -
//
Процедура ДополнитьДоступныеВидыОплаты(Форма, ДоступныеВидыОплаты) Экспорт
	
	//++ Локализация
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ВозвратПодарочныхСертификатов")
		Или ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.РеализацияПодарочныхСертификатов") Тогда
			
		ДоступныеВидыОплаты.Вставить("СБП", Форма.ИспользоватьОплатуСБП);

	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ")
		Или ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
			
		ДополнитьДоступныеВидыОплатыВидомЭСФСС(Форма, ДоступныеВидыОплаты);
		ДоступныеВидыОплаты.Вставить("СБП", Форма.ИспользоватьОплатуСБП);
		
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте")
		И Форма.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту") Тогда
		
		ЭтоОплатаСБП = (Форма.СпособПроведенияПлатежа = ПредопределенноеЗначение("Перечисление.СпособыПроведенияПлатежей.СистемаБыстрыхПлатежей"));
		ДоступныеВидыОплаты.Вставить("СБП", ЭтоОплатаСБП);
	
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Определяет, требуется ли проверка кодов маркировки средствами ККТ.
// 
// Параметры:
//  ПараметрыОперацииФискализацииЧека - Структура - Параметры операции фискализации чека
// 
// Возвращаемое значение:
//  Булево - Истина - требуется проверка кодов маркировки средствами ККТ
Функция ТребуетсяПроверкаКодовМаркировкиСредствамиККТ(ПараметрыОперацииФискализацииЧека) Экспорт
	
	ТребуетсяПроверкаКодовМаркировкиСредствамиККТ = Ложь;
	
	//++ Локализация
	ПозицииЧека = ПараметрыОперацииФискализацииЧека.ПозицииЧека;
	
	Для Каждого ПозицияЧека Из ПозицииЧека Цикл
		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ПозицияЧека, "РезультатРаспределенияВрем")
			И ПозицияЧека.РезультатРаспределенияВрем <> Неопределено Тогда
			
			ТребуетсяПроверкаКодовМаркировкиСредствамиККТ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//-- Локализация
	
	Возврат ТребуетсяПроверкаКодовМаркировкиСредствамиККТ;
	
КонецФункции

//++ Локализация

// Возвращает сумму оплаты СБП по документу
// 
// Параметры:
//  ОплатыПлатежнойКартой - ДанныеФормыКоллекция, ТаблицаЗначений, ТабличнаяЧасть - Оплаты платежной картой:
//  * ВидОплаты - ПеречислениеСсылка.ТипыПлатежнойСистемыККТ -
//  * Сумма - Число - 
//  * СтатусОплатыСБП - ПеречислениеСсылка.ТипыСтатусовОплатыСБП - 
//  ТолькоОплатаВыполнена - Булево - Истина - Выполнена
// 
// Возвращаемое значение:
//  Число - сумма оплаты СБП по документу
//
Функция СуммаОплатыСБППоДокументу(ОплатыПлатежнойКартой, ТолькоОплатаВыполнена = Ложь) Экспорт
	
	СуммаОплатыСБП = 0;
	
	Для Каждого СтрокаТЗ Из ОплатыПлатежнойКартой Цикл
		
		Если СтрокаТЗ.ВидОплаты = ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей") Тогда
			
			Если ТолькоОплатаВыполнена 
					И (СтрокаТЗ.СтатусОплатыСБП = ПредопределенноеЗначение("Перечисление.ТипыСтатусовОплатыСБП.Выполнена") 
					ИЛИ СтрокаТЗ.СтатусОплатыСБП = ПредопределенноеЗначение("Перечисление.ТипыСтатусовОплатыСБП.ОжидаетПодтверждение")
						И ПустаяСтрока(СтрокаТЗ.СсылочныйНомер)) 
					ИЛИ Не ТолькоОплатаВыполнена Тогда
				
				СуммаОплатыСБП = СуммаОплатыСБП + СтрокаТЗ.Сумма;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СуммаОплатыСБП;
	
КонецФункции

// Возвращает массив строк оплаты СБП по документу
// 
// Параметры:
//  ОплатаПлатежнымиКартами - ДанныеФормыКоллекция, ТаблицаЗначений, ТабличнаяЧасть - Оплаты платежной картой:
//  * ВидОплаты - ПеречислениеСсылка.ТипыПлатежнойСистемыККТ -
//  * СтатусОплатыСБП - ПеречислениеСсылка.ТипыСтатусовОплатыСБП - 
//  ТолькоОплатаВыполнена - Булево - Истина - Выполнена
// 
// Возвращаемое значение:
//  Число - сумма оплаты СБП по документу
//
Функция СтрокиОплатыСБП(ОплатаПлатежнымиКартами, ТолькоОплатаВыполнена = Ложь) Экспорт
	
	ОтборОплатыСБП = Новый Структура("ВидОплаты", ПредопределенноеЗначение("Перечисление.ТипыПлатежнойСистемыККТ.СистемаБыстрыхПлатежей"));
	Если ТолькоОплатаВыполнена Тогда
		ОтборОплатыСБП.Вставить("СтатусОплатыСБП", ПредопределенноеЗначение("Перечисление.ТипыСтатусовОплатыСБП.Выполнена"));
	КонецЕсли;
	
	Возврат ОплатаПлатежнымиКартами.НайтиСтроки(ОтборОплатыСБП);
	
КонецФункции

// Возвращает структуру данных используемых для для возврата по документу оплаты СБП.
// 
// Возвращаемое значение:
//  Структура:
//   *ОснованиеПлатежа - ДокументСсылка - 
//   *Партнер - СправочникСсылка.Партнеры -
//   *Сумма - Число - 
//
Функция ДанныеДляВозвратаПоДокументуОплатыСБП() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ОснованиеПлатежа", Неопределено);
	Результат.Вставить("Партнер", Неопределено);
	Результат.Вставить("Сумма", 0);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру данных используемых для подключения к сервису НСПК.
//
// Возвращаемое значение:
//  Структура:
//	* АдресСервисаНСПК - Строка - Адрес сервиса НСПК
//	* КлючДоступаНСПК - Строка - Ключ доступа к НСПК
//	* ПараметрыПроксиНСПК - Структура:
//	   **Сервер - Строка
//	   **Порт - Строка
//	   **Пользователь - Строка
//	   **Пароль - Строка
//
Функция ПараметрыПодключенияНСПК() Экспорт
	
	ОбщиеПараметрыПодключенияНСПК = Новый Структура();
	ОбщиеПараметрыПодключенияНСПК.Вставить("АдресСервисаНСПК", "");
	ОбщиеПараметрыПодключенияНСПК.Вставить("КлючДоступаНСПК", "");
	ОбщиеПараметрыПодключенияНСПК.Вставить("ПараметрыПроксиНСПК", Новый Структура);
	ОбщиеПараметрыПодключенияНСПК.ПараметрыПроксиНСПК.Вставить("Сервер", "");
	ОбщиеПараметрыПодключенияНСПК.ПараметрыПроксиНСПК.Вставить("Порт", "");
	ОбщиеПараметрыПодключенияНСПК.ПараметрыПроксиНСПК.Вставить("Пользователь", "");
	ОбщиеПараметрыПодключенияНСПК.ПараметрыПроксиНСПК.Вставить("Пароль", "");
	
	Возврат ОбщиеПараметрыПодключенияНСПК;
КонецФункции

//-- Локализация

#КонецОбласти

#Область КэшированиеДанныхДинамическихРеквизитовФормы

// Кэширует идентификаторы строк таблиц в привязке к данным динамических реквизитов таблиц формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура СохранитьВКэшДанныеДинамическихРеквизитовТаблицФормы(Форма) Экспорт

	//++ Локализация
	Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК"
		Или (Форма.ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК" 
				И Не ЗначениеЗаполнено(Форма.Объект.ЧекККМ))Тогда

		Если РозничныеПродажиТабачнойПродукцииТолькоПоМРЦ(Форма) Тогда
			ИмяРеквизитаКэшМаркируемойПродукции	= "КэшМаркируемойПродукции";		
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаКэшМаркируемойПродукции) Тогда
				ДанныеКэшаМаркируемойПродукции = ПолучитьИзВременногоХранилища(Форма[ИмяРеквизитаКэшМаркируемойПродукции]);
				Если ТипЗнч(ДанныеКэшаМаркируемойПродукции) = Тип("Структура") Тогда
					ИмяСвойстваИдентификаторыСтрокСУстановленнойМРЦ = ИмяСвойстваИдентификаторыСтрокСУстановленнойМРЦ();
					ДанныеКэшаМаркируемойПродукции.Вставить(ИмяСвойстваИдентификаторыСтрокСУстановленнойМРЦ, Новый Массив);
					ОтборДляПоиска = Новый Структура(ИмяРеквизитаУстановленаМРЦ(), Истина);
					Для Каждого СтрокаТовары Из Форма.Объект.Товары.НайтиСтроки(ОтборДляПоиска) Цикл
						ДанныеКэшаМаркируемойПродукции[ИмяСвойстваИдентификаторыСтрокСУстановленнойМРЦ].Добавить(СтрокаТовары.ПолучитьИдентификатор());	
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
				
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Восстанавливает из кэша данные динамических реквизитов таблиц формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ВосстановитьИзКэшаДанныеДинамическихРеквизитовТаблицФормы(Форма) Экспорт

	//++ Локализация
	Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК"
		Или (Форма.ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК" 
				И Не ЗначениеЗаполнено(Форма.Объект.ЧекККМ))Тогда

		Если РозничныеПродажиТабачнойПродукцииТолькоПоМРЦ(Форма) Тогда
			ИмяРеквизитаКэшМаркируемойПродукции	= "КэшМаркируемойПродукции";		
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаКэшМаркируемойПродукции) Тогда
				ДанныеКэшаМаркируемойПродукции = ПолучитьИзВременногоХранилища(Форма[ИмяРеквизитаКэшМаркируемойПродукции]);
				ИмяСвойстваИдентификаторыСтрокСУстановленнойМРЦ = ИмяСвойстваИдентификаторыСтрокСУстановленнойМРЦ();
				Если ТипЗнч(ДанныеКэшаМаркируемойПродукции) = Тип("Структура") 
					И ДанныеКэшаМаркируемойПродукции.Свойство(ИмяСвойстваИдентификаторыСтрокСУстановленнойМРЦ) Тогда
					Для Каждого ИдентификаторСтроки Из ДанныеКэшаМаркируемойПродукции[ИмяСвойстваИдентификаторыСтрокСУстановленнойМРЦ] Цикл
						НайденнаяСтрока = Форма.Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
						Если НайденнаяСтрока <> Неопределено Тогда
							НайденнаяСтрока[ИмяРеквизитаУстановленаМРЦ()] = Истина;
						КонецЕсли;	
					КонецЦикла;
					ДанныеКэшаМаркируемойПродукции.Удалить(ИмяСвойстваИдентификаторыСтрокСУстановленнойМРЦ);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
				
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

//++ Локализация

#Область РозничнаяПродажаТабачнойПродукцииТолькоПоМРЦ

// Определение имени табличной части товаров с МРЦ по имени формы.
// Параметры:
//	ИмяФормы - Строка
// Возвращаемое значение:
//	Строка - имя табличной части на форме
Функция ТаблицаТоваровПоФормеМРЦ(Знач ИмяФормы) Экспорт
	
	Если ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
		ИмяТаблицы = "Корзина";
	ИначеЕсли ИмяФормы = "Документ.ЗаявкаНаВозвратТоваровОтКлиента.Форма.ФормаДокумента" Тогда
		ИмяТаблицы = "ЗаменяющиеТовары";
	Иначе
		ИмяТаблицы = "Товары";
	КонецЕсли;
	
	Возврат ИмяТаблицы;
	
КонецФункции

// Таблица штрихкодов по форме МРЦ.
// 
// Параметры:
//  ИмяФормы - Строка - Имя формы
// 
// Возвращаемое значение:
//  Строка - Имя таблицы штрихкодов
Функция ТаблицаШтрихкодовПоФормеМРЦ(Знач ИмяФормы) Экспорт
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ИмяТаблицы = "ШтрихкодыУпаковок";
	Иначе
		ИмяТаблицы = "АкцизныеМарки";
	КонецЕсли;
	
	Возврат ИмяТаблицы;
	
КонецФункции

// Реквизит штрихкода по таблице штрихкодов
// 
// Параметры:
//  ИмяТаблицы - Строка - Имя таблицы
// 
// Возвращаемое значение:
//  Строка - Имя реквизита штрихкода
Функция РеквизитШтрихкодаПоТаблицеШтрихкодов(Знач ИмяТаблицы) Экспорт
	
	Если ИмяТаблицы = "АкцизныеМарки" Тогда
		ИмяРеквизита = "АкцизнаяМарка";
	Иначе
		ИмяРеквизита = "ШтрихкодУпаковки";
	КонецЕсли;
	
	Возврат ИмяРеквизита;
	
КонецФункции

// Возвращает признак использования мин. розничной цены (МРЦ) для вида продукции
// Параметры:
//	ВидПродукции - СправочникСсылка.ВидыПродукцииИС
// Возвращаемое значение:
//	Булево -
Функция ЭтоВидПродукцииСМРЦ(Знач ВидПродукции) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ДоступноПолеМРЦ(ВидПродукции);
	
КонецФункции

// Описание: возвращает признак использования РМЦ
// Параметры:
//	Форма - ФормаКлиентскогоПриложения,Структура
// Возвращаемое значение:
//	Булево
Функция РозничныеПродажиТабачнойПродукцииТолькоПоМРЦ(Форма) Экспорт
	
	Результат = Ложь;
	
	ИмяКонтрольногоРеквизита = ИмяРеквизитаИспользоватьРозничныеПродажиТабачнойПродукцииТолькоПоМРЦ();
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяКонтрольногоРеквизита)
		И Форма[ИмяКонтрольногоРеквизита] = Истина Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ЛитеральныеКонстанты

// Имя программного реквизита формы.
// Возвращаемое значение:
//	Строка
Функция ИмяРеквизитаИспользоватьРозничныеПродажиТабачнойПродукцииТолькоПоМРЦ() Экспорт

	Возврат "ИспользоватьРозничныеПродажиТабачнойПродукцииТолькоПоМРЦ";

КонецФункции

// Имя программного реквизита таблицы "Товары" формы РМК.
//
// Возвращаемое значение:
//  Строка - 
//
Функция ИмяРеквизитаУстановленаМРЦ() Экспорт

	Возврат "УстановленаМРЦ";

КонецФункции

// Имя программного реквизита формы РМК.
//
// Возвращаемое значение:
//  Строка - 
//
Функция ИмяРеквизитаЕстьОшибкаВЦенеПоМРЦ() Экспорт
	
	Возврат "ЕстьОшибкаВЦенеПоМРЦ";
	
КонецФункции

// Имя свойства кэша маркируемой продукции, используется для событий форм РМК: ПередЗаписьюНаСервере, ПослеЗаписиНаСервере.
//
// Возвращаемое значение:
//  Строка - 
//
Функция ИмяСвойстваИдентификаторыСтрокСУстановленнойМРЦ() Экспорт
	Возврат "ИдентификаторыСтрокСУстановленнойМРЦ";
КонецФункции

// Перечень форм конфигурации, где встроен механизм работы с МРЦ 
// Возвращаемое значение:
//	Массив из Строка - имена форм
Функция ФормыСоВстроеннымМеханизмомМРЦ() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить("Документ.ЗаказКлиента.Форма.ФормаДокумента");
	Результат.Добавить("Документ.ЗаявкаНаВозвратТоваровОтКлиента.Форма.ФормаДокумента");
	Результат.Добавить("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента");
	Результат.Добавить("Документ.ЧекККМ.Форма.ФормаДокументаРМК");
	Результат.Добавить("Документ.ЧекККМВозврат.Форма.ФормаДокументаРМК");
	Результат.Добавить("Обработка.ПодборТоваровВДокументПродажи.Форма.Форма");
	Результат.Добавить("Справочник.БонусныеПрограммыЛояльности.Форма.ОплатаБонуснымиБаллами");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Пересчет МРЦ к потребительской упаковке
//
// Параметры:
//  ДанныеШтрихкода - см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьРезультатОбработкиШтрихкода.ДанныеШтрихкода
//
// Возвращаемое значение:
//  Число -
//
Функция МРЦПоДаннымШтрихкода(ДанныеШтрихкода) Экспорт
	Возврат ?(
		ДанныеШтрихкода.КоличествоПотребительскихУпаковок = 1,
		ДанныеШтрихкода.МРЦ,
		Окр(ДанныеШтрихкода.МРЦ / ДанныеШтрихкода.КоличествоПотребительскихУпаковок, 2));
КонецФункции

// Добавить в форму параметр контроля цены по МРЦ.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма документа
//  ПараметрыФормы - Структура - Параметры формы
Процедура ДобавитьВФормуПараметрКонтроляЦеныПоМРЦ(Форма, ПараметрыФормы) Экспорт
	
	Если РозничныеПродажиТабачнойПродукцииТолькоПоМРЦ(Форма) Тогда
		ИмяРеквизитаКонтроля = ИмяРеквизитаИспользоватьРозничныеПродажиТабачнойПродукцииТолькоПоМРЦ();
		ПараметрыФормы.Вставить(ИмяРеквизитаКонтроля, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаВозрастаПокупателя

// Имя программного реквизита формы, свопадает с именем функциональной опции, отвечающей за включение механизма проверки 
// возраста покупателя через мессенджер Макс.
// Возвращаемое значение:
//	Строка
Функция ИмяРеквизитаИспользоватьПодтверждениеВозрастаЧерезМакс() Экспорт
	Возврат "ИспользоватьПодтверждениеВозрастаЧерезМакс";
КонецФункции

// Имя команды формы для подтверждения возраста через мессенджер Макс.
// Возвращаемое значение:
//	Строка
Функция ИмяКомандыПодтверждениеВозрастаПокупателяЧерезМакс() Экспорт
	Возврат "ЛокализацияГруппаКоманд_ПодтверждениеВозрастаПокупателяЧерезМакс";
КонецФункции

// Имя кнопки формы для подтверждения возраста через мессенджер Макс.
// Возвращаемое значение:
//	Строка
Функция ИмяКнопкиПодтверждениеВозрастаПокупателяЧерезМакс() Экспорт
	Возврат "ЛокализацияГруппаКоманд_ПодтверждениеВозрастаПокупателяЧерезМакс";
КонецФункции

// Имя программного элемента формы для хранения состояния проверки возраста.
// Элемент может иметь типы: ПолеФормы(вид ПолеНадписи), ДекорацияФормы
// Если используется тип ПолеВвода, то на форме должен быть добавлен одноименный реквизит для хранения данных,
// связанный с этим элементом формы.
//
// Параметры:
//  ИмяФормы - Строка - Имя формы, на которой должен быть размещен элемент
// Возвращаемое значение:
//	Строка
// 
Функция ИмяЭлементаФормыСостояниеПроверкиВозрастаПокупателя(ИмяФормы = Неопределено) Экспорт
	ИмяЭлемента = "ДекорацияСостояниеПроверкиВозрастаПокупателя";
	Если ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокументаРМК" Тогда
		ИмяЭлемента = "ИнформационнаяПанельНаименованиеЗапрет";
	КонецЕсли;	
	Возврат ИмяЭлемента;
КонецФункции

// Имя программного реквизита формы для хранения состояния проверки возраста покупателя.
// Для каждого сервиса, используемого для подтверждения возраста можно объявить собственные коды состояний проверки.
//  
// Число - 0 проверка не требуется
//         1 проверка требуется, не включен механизм проверки
//         2 проверка требуется, включен механизм проверки через Макс
//         3 проверка прошла успешно, возраст подтвержден через Макс
//         4 проверка не пройдена, возраст не подтвержден через Макс
//         5 проверка не пройдена, произошла ошибка при подтверждении через Макс.
//
// Возвращаемое значение:
//	Строка
Функция ИмяРеквизитаСостояниеПроверкиВозрастаПокупателя() Экспорт
	Возврат "СостояниеПроверкиВозрастаПокупателя";
КонецФункции

// Имя процедуры в модуле формы, которая является обработчиком для команды проверки возраста покупателя через мессенджер Макс
// и оно же используется, как обработчик навигационной ссылки для см. ИмяЭлементаФормыСостояниеПроверкиВозрастаПокупателя .
// 
// Возвращаемое значение:
//	Строка -
Функция ИмяДействияПодтверждениеВозрастаПокупателяЧерезМакс() Экспорт
	Возврат "Подключаемый_ПодтверждениеВозрастаПокупателяЧерезМакс";
КонецФункции

// Имя процедуры в модуле формы, которая является обработчиком для команды проверки возраста покупателя.
// Возвращаемое значение:
//	Строка
Функция ИмяОбработчикаНавигационнойСсылкиЭлементаФормыСостояниеПроверкиВозрастаПокупателя() Экспорт
	Возврат "Подключаемый_ЭлементФормыСостояниеПроверкиВозрастаПокупателяОбработкаНавигационнойСсылки";
КонецФункции

// Имя программного реквизита формы для хранения признака необходимости подтверждения возраста покупателя.
// Возвращаемое значение:
//	Строка
Функция ИмяРеквизитаЕстьТоварыТребующиеПодтвержденияВозрастаПокупателя() Экспорт
	Возврат "ЕстьТоварыТребующиеПодтвержденияВозрастаПокупателя";
КонецФункции

// Ведется учет видов продукции по ветеринарным сертификатам.
// 
// Возвращаемое значение:
//  Булево - Ведется учет видов продукции по ветеринарным сертификатам
Функция ВедетсяУчетВидовПродукцииПоВетеринарнымСертификатам() Экспорт
	ИспользуетсяВетеринарныйСертификат = Ложь;
	УчитываемыеВидыПродукции = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции();
	Для Каждого ВидПродукции Из УчитываемыеВидыПродукции Цикл
		Если КонструкторИСМПКлиентСервер.ВидПродукцииИспользуетВетеринарныйСертификат(ВидПродукции) Тогда
			ИспользуетсяВетеринарныйСертификат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ИспользуетсяВетеринарныйСертификат;
КонецФункции

#КонецОбласти

//-- Локализация

// Обработать наличие требования указать разрешения на продажу товаров.
// 
// Параметры:
//  Форма - см. Документ.ЧекККМ.Форма.ФормаДокументаРМК
Процедура ОбработатьРазрешенияНаПродажуТоваров(Форма) Экспорт
	
	//++ Локализация
	ИспользуетсяВетеринарныйСертификат = ВедетсяУчетВидовПродукцииПоВетеринарнымСертификатам();
	Если Не ИспользуетсяВетеринарныйСертификат Тогда
		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма.Элементы, "ТоварыРеквизитыРазрешенияНаПродажу") Тогда
			Форма.Элементы.УказатьРазрешениеНаПродажу.Видимость = Ложь;
			Форма.Элементы.ТоварыРеквизитыРазрешенияНаПродажу.Видимость = Ложь;
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("ПродаетсяПоРазрешению", Истина);
	СтрокиТоваров = Форма.Объект.Товары.НайтиСтроки(СтруктураПоиска);
	
	Форма.Элементы.УказатьРазрешениеНаПродажу.Видимость = Истина;
	Форма.Элементы.УказатьРазрешениеНаПродажу.Доступность = (СтрокиТоваров.Количество() > 0);
	Форма.Элементы.ТоварыРеквизитыРазрешенияНаПродажу.Видимость = (СтрокиТоваров.Количество() > 0);
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация

// Дополняет колллекцию доступных видов оплат видом Электронный сертификат ФСС
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма документа:
//  * Объект - ДокументОбъект - Основной реквизит формы
//  ДоступныеВидыОплаты - Структура -
//
Процедура ДополнитьДоступныеВидыОплатыВидомЭСФСС(Форма, ДоступныеВидыОплаты)
	
	ВидОплатыДоступен = Ложь;
	Если Форма.ИспользоватьОплатуЭСФСС 
		И Форма.ЭквайринговыеТерминалы.Количество() > 0
		И ТипЗнч(Форма.ПараметрыКассыККМ) = Тип("ФиксированнаяСтруктура")
		И Форма.ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования = Ложь
		И ЗначениеЗаполнено(Форма.ПараметрыКассыККМ.ИдентификаторУстройства) Тогда
		
		Для Каждого ЭквайринговыйТерминал Из Форма.ЭквайринговыеТерминалы Цикл
			Если ЭквайринговыйТерминал.Значение.ИспользоватьБезПодключенияОборудования = Ложь 
				И ЭквайринговыйТерминал.Значение.ПодключаемоеОборудованиеККТ = Форма.ПараметрыКассыККМ.ИдентификаторУстройства Тогда
				ВидОплатыДоступен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДоступныеВидыОплаты.Вставить("ЭСФСС", ВидОплатыДоступен);
КонецПроцедуры

//-- Локализация

#КонецОбласти
