#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппировкиОтчета = Параметры.ГруппировкиОтчета.Скопировать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	УровеньВалюта = ГруппировкиОтчета.НайтиПоЗначению("Валюта");
	УровеньБанковскийСчетКасса = ГруппировкиОтчета.НайтиПоЗначению("БанковскийСчетКасса");
	
	Если ГруппировкиОтчета.Индекс(УровеньВалюта) <> 0 Тогда
		ТекстСообщения = НСтр("ru = 'Валюта должна быть первой.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
	Если ГруппировкиОтчета.Индекс(УровеньБанковскийСчетКасса) <> ГруппировкиОтчета.Количество() - 1 Тогда
		ТекстСообщения = НСтр("ru = 'Банковский счет / Касса должны быть последней.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	Закрыть(ГруппировкиОтчета);
	
КонецПроцедуры

#КонецОбласти