
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаТрН(Данные, Представление, СтандартнаяОбработка, "6");
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("ДокументЭТРН");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатПУДИнфГО");
	МассивКлючевых.Добавить("ВрПУДИнфГО");
	
	МассивКлючевых.Добавить("ИдФайлПУДИнфПрв");
	МассивКлючевых.Добавить("ДатФайлПУДИнфПрв");
	МассивКлючевых.Добавить("ВрФайлПУДИнфПрв");
	МассивКлючевых.Добавить("ЭП");
	
	МассивКлючевых.Добавить("НомИспр");
	МассивКлючевых.Добавить("ДатаИспр");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция ПроверитьДокумент(Знач Объект, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(Объект.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиПредыдущегоТитула(Объект.Ссылка, Объект.ДокументЭТРН, ТаблицаОшибок);
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		// TODO понять какие сценарии проверки входящего документа
		
	Иначе
		
		// TODO реализовать проверку документа
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(Объект.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(Объект.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(Объект,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6, ТаблицаОшибок);
		
		ПроверитьШапку(Объект, ТаблицаОшибок);
				
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			Объект, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(Объект.Ссылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ДокументЭТРН = Объект.ДокументЭТРН;
	
	Если НЕ ЗначениеЗаполнено(ДокументЭТРН)  Тогда
		
		ТекстОшибки = "Титул не привязан к Документу электронной транспортной накладной";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ДокументЭТРН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		ОбязательныеРеквизитыТРН = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МассивОбязательныхРеквизитов();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыТРН Цикл
			Если НЕ ЗначениеЗаполнено(ДокументЭТРН[ОбязательныйРевизит])  Тогда
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной транспортной накладной";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		// можно не проверять этрн - она была сформирована на этапе Т1
		// Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПроверитьКлючевыеРеквизитыЭтРН(ДокументЭТРН, ТаблицаОшибок);

	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЭП)  Тогда
		
		ТекстОшибки = "Не получена подпись перевозчика";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"ЭП", КатегорияОшибка, ТекстОшибки, "Выполнить обмен");
	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ТрН_Титул6.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
		
	Если Не Объект.ЕстьОтказВПодписи Тогда 
		
		Если ЗначениеЗаполнено(Объект.НомерСчета) Тогда
			
			Если СтрДлина(Объект.НомерСчета) < 20 Тогда
				
				ТекстОшибки = "Укажите корректную длину (" + СтрДлина(Объект.НомерСчета) + " из 20) счета банка.";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"НомерСчета", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.КорСчет) И СтрДлина(Объект.КорСчет) < 20 Тогда 
			
			ТекстОшибки = "Укажите корректную длину (" + СтрДлина(Объект.КорСчет) + " из 20) корреспондентского счета банка.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"КорСчет", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.БИК) И СтрДлина(Объект.БИК) < 9 Тогда 
			
			ТекстОшибки = "Укажите корректную длину (" + СтрДлина(Объект.БИК) + " из 9) БИКа банка.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"БИК", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		// Провдение документа основания
		КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
		
		Если ЗначениеЗаполнено(Объект.НаименованиеПлательщика) Тогда 
			
			Если Не ЗначениеЗаполнено(Объект.ИдДокОснИнПлат) 
				И Не ЗначениеЗаполнено(Объект.НаимДокОснИнПлат) 
				И Не ЗначениеЗаполнено(Объект.ДатаДокОснИнПлат) 
				И Не ЗначениеЗаполнено(Объект.СтороныСостДокОснИнПлат) 
				И Не ЗначениеЗаполнено(Объект.ДопСостДокОснИнПлат) Тогда 
			
				ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей документа основания для оплаты.";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
							"ИдДокПлат", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;	
				
			Если Не ЗначениеЗаполнено(Объект.ИдДокОснИнПлат) 
				И (ЗначениеЗаполнено(Объект.НаимДокОснИнПлат)
				Или ЗначениеЗаполнено(Объект.НомерДокОснИнПлат) 
				Или ЗначениеЗаполнено(Объект.ДатаДокОснИнПлат)
				Или ЗначениеЗаполнено(Объект.ДопСведДокОснИнПлат)
				Или ЗначениеЗаполнено(Объект.СтороныСостДокОснИнПлат) 
				Или ЗначениеЗаполнено(Объект.ДопСостДокОснИнПлат)) Тогда	
					
				Если Не ЗначениеЗаполнено(Объект.НаимДокОснИнПлат) Тогда 
					
					ТекстОшибки = "Укажите наименование Документа основания для оплаты.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
								"НаимДокПлат", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Объект.ДатаДокОснИнПлат) Тогда 
					
					ТекстОшибки = "Укажите дату Документа основания для оплаты.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
								"ДатаДокПлат", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Объект.СтороныСостДокОснИнПлат) И Не ЗначениеЗаполнено(Объект.ДопСостДокОснИнПлат) Тогда 
					
					ТекстОшибки = "Укажите стороны составители или доп.составителя Документа основания переадресовки для оплаты.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
								"СтороныСост", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Объект.ПричинаОтказаВПодписи) Тогда 
			
			ТекстОшибки = "Укажите причину отказа в подписи.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, "", "", "ПричинаОтказаВПодписи", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
	КонецЕсли;
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ТрН_Титул6.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

#КонецЕсли