
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ТрН_Титул6_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();	
		
	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ТрН_Титул6_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
		
КонецПроцедуры

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументЭТРН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлу(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументЭТРН) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти Документ ЭТРН, создание не выполнено");
		
	Иначе
		
		ДокументЭТРН = НайденныйДокументЭТРН;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		Если Найти(XDTO.ИдФайл, "DP_UVUTOCH") = 0 Тогда 
			
			ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
			
		Иначе
			
			ЗаполнитьРеквизитыТитулаИзXDTOОтказ(XDTO);
			
		КонецЕсли;	
		
		// Комментарий - нет в формате минтранса // TODO есть в Диадоке - научиться доставать из ДД 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	// Предыдущий титул может быть любым титулом в цепочке (точно может быть Т2, Т3, Т4)
	// В соотв. с логикой ГИС требуется всегдя ссылаться на Т2 (с учетом исправлений на последнюю редакцию)
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
							ДанныеЗаполнения.ТипЛогистика);
	
	ДокументЭТРН = ПредыдущийТитул.ДокументЭТРН;
	
	ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
	
	ИнфПол.Очистить();
	ОтметкиИнфПол.Очистить();
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		
		ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации);

	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул) Экспорт
		
	Титул5 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5, ДокументЭТРН);
	ФайлТитула5 = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(Титул5);
	
	ИдФайлПУДИнфПрв		= СтрЗаменить(ФайлТитула5.ИмяФайла, ".xml", "");;
	ДатФайлПУДИнфПрв 	= Титул5.ДатПУДИнфПрв;
	ВрФайлПУДИнфПрв		= Титул5.ВрПУДИнфПрв;
	
	ДвоичныеДанныеПодписи 	= ФайлТитула5.Подпись.Получить();
	ЭП 						= Base64Строка(ДвоичныеДанныеПодписи);

КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации)

	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		//Заполнить ЭтотТитул
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ДокументЭТРН.Грузоотправитель,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	ЕстьОтказВПодписи = Ложь;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ = КС.XDTO_Вычислить(XDTO, "Документ");
	
	ДатПУДИнфГО = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатПУДИнфГО"));
	ВрПУДИнфГО 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрПУДИнфГО"));
	      	
	// Основание, по которому экономический субъект является составителем файла обмена
	XDTO_ОснДовОргСост 	= КС.XDTO_Вычислить(Документ, "ОснДовОргСост");
	
	НаимДокОснДовОргСост 	= КС.XDTO_Вычислить(XDTO_ОснДовОргСост, "НаимДок");
	НомерДокОснДовОргСост 	= КС.XDTO_Вычислить(XDTO_ОснДовОргСост, "НомерДок");
	ДатаДокОснДовОргСост 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO_ОснДовОргСост, "ДатаДок"));
	ДопСведДокОснДовОргСост = КС.XDTO_Вычислить(XDTO_ОснДовОргСост, "ДопСведДок");
	ИдДокОснДовОргСост		= КС.XDTO_Вычислить(XDTO_ОснДовОргСост, "ИдДок");
	
	МассивСторон =  КС.Конвертировать_ИдРекСостТип_вМассивСторонСоставителей(КС.XDTO_Вычислить(XDTO_ОснДовОргСост, "ИдРекСост"));
	Составители = Перечисления.КонтурЛогистика_СтороныСоставители.СоставителиИзМассиваСторон(ДокументЭТРН, МассивСторон);
	
	СтороныСостДокОснДовОргСост = Составители.Составитель;
	ДопСостДокОснДовОргСост 	= Составители.ДопСоставитель;

	// Основание, по которому денежные средства будут поступать в оплату перевозки
	
	НаименованиеПлательщика = КС.XDTO_Вычислить(Документ, "НаимПлат");
	Если ЗначениеЗаполнено(НаименованиеПлательщика) Тогда 
		
		XDTO_ОснИнПлат = КС.XDTO_Вычислить(Документ, "ОснИнПлат");
		
		НаимДокОснИнПлат 	= КС.XDTO_Вычислить(XDTO_ОснИнПлат, "НаимДок");
		НомерДокОснДовОргСост 	= КС.XDTO_Вычислить(XDTO_ОснИнПлат, "НомерДок");
		ДатаДокОснДовОргСост 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO_ОснИнПлат, "ДатаДок"));
		ДопСведДокОснДовОргСост = КС.XDTO_Вычислить(XDTO_ОснИнПлат, "ДопСведДок");
		ИдДокОснДовОргСост		= КС.XDTO_Вычислить(XDTO_ОснИнПлат, "ИдДок");
		
		МассивСторон =  КС.Конвертировать_ИдРекСостТип_вМассивСторонСоставителей(КС.XDTO_Вычислить(XDTO_ОснИнПлат, "ИдРекСост"));
		Составители = Перечисления.КонтурЛогистика_СтороныСоставители.СоставителиИзМассиваСторон(ДокументЭТРН, МассивСторон);
		
		СтороныСостДокОснДовОргСост = Составители.Составитель;
		ДопСостДокОснДовОргСост 	= Составители.ДопСоставитель;
		
	КонецЕсли;	
	
	// Данные Подписанта
	XDTO_Подписант 		= КС.XDTO_Вычислить(Документ, "Подписант");
	
	Должность 	= КС.XDTO_Вычислить(XDTO_Подписант, "Должн");
	Фамилия 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Фамилия");
	Имя 		= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Имя");
	Отчество 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Отчество");
	
	СтатПодп_raw = КС.XDTO_Вычислить(XDTO_Подписант, "СтатПодп");
	СтатПодп = Перечисления.КонтурЛогистика_СтатусыПодписанта.ЗначениеИзXDTO(СтатПодп_raw);
		
	// Идентификация файла обмена первичного учетного документа о факте хозяйственной жизни (информации перевозчика)
	XDTO_ИдПУДИнфПрв = КС.XDTO_Вычислить(Документ, "ИдПУДИнфПрв");
	
	ИдФайлПУДИнфПрв = КС.XDTO_Вычислить(XDTO_ИдПУДИнфПрв, "ИдФайлПУДИнфПрв"); 
	ДатФайлПУДИнфПрв = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO_ИдПУДИнфПрв, "ДатФайлПУДИнфПрв"));
	ВрФайлПУДИнфПрв = КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(XDTO_ИдПУДИнфПрв, "ВрФайлПУДИнфПрв"));
	ЭП 				= КС.XDTO_Вычислить(XDTO_ИдПУДИнфПрв, "ЭП");
	
	// Содержание факта хозяйственной жизни 2 - сведения грузоотправителя о финансовых последствиях факта выполнения перевозки 
	XDTO_СодФХЖ2 = КС.XDTO_Вычислить(Документ, "СодФХЖ2");
	
	// Дополнительные сведения об участнике факта хозяйственной жизни
	XDTO_ДопСвГО = КС.XDTO_Вычислить(XDTO_СодФХЖ2, "ДопСвГО");
	
	ОКПО 			= КС.XDTO_Вычислить(XDTO_ДопСвГО, "ОКПО");
	КраткоеНазвание = КС.XDTO_Вычислить(XDTO_ДопСвГО, "КраткНазв");
	
	СтруктурноеПодразделение 			= КС.XDTO_Вычислить(XDTO_ДопСвГО, "СтруктПодр");
	ПорядокИспользованияФайлаОбмена 	= КС.XDTO_Вычислить(XDTO_ДопСвГО, "ИнфДляУчаст");
		
	// Банковские реквизиты
	XDTO_БанкРекв = КС.XDTO_Вычислить(XDTO_ДопСвГО, "БанкРекв");
	
	НомерСчета 			= КС.XDTO_Вычислить(XDTO_БанкРекв, "НомерСч");
	НаименованиеБанка	= КС.XDTO_Вычислить(XDTO_БанкРекв, "СвБанк.НаимБанк");
	БИК					= КС.XDTO_Вычислить(XDTO_БанкРекв, "СвБанк.БИК");
	КорСчет				= КС.XDTO_Вычислить(XDTO_БанкРекв, "СвБанк.КорСчет");
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTOОтказ(Знач XDTO)
	
	ЕстьОтказВПодписи = Истина;
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ = КС.XDTO_Вычислить(XDTO, "Документ");
	
	// Данные Подписанта
	XDTO_Подписант 		= КС.XDTO_Вычислить(Документ, "Подписант");
	
	Должность 	= КС.XDTO_Вычислить(XDTO_Подписант, "Должн");
	Фамилия 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Фамилия");
	Имя 		= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Имя");
	Отчество 	= КС.XDTO_Вычислить(XDTO_Подписант, "ФИО.Отчество");
		
	ТекстУведомления 		= КонтурЛогистика_КонструкторыXDTO.XDTO_Вычислить(XDTO, "Документ.СвУведУточ.ТекстУведУточ");	
	ПричинаОтказаВПодписи 	= ?(Не ТипЗнч(ТекстУведомления) = Тип("ОбъектXDTO"), ТекстУведомления, ""); 
	
КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ТрН_Титул6.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ДатПУДИнфГО = ТекущаяДатаСеанса();
		ВрПУДИнфГО = ТекущаяДатаСеанса();
		
		// формируем текст xml
		Если Не ЕстьОтказВПодписи Тогда 
			РезультатФормированияТекста = СформироватьТекстФайла(ДатПУДИнфГО, ВрПУДИнфГО);
		Иначе
			РезультатФормированияТекста = СформироватьТекстФайлаУведомленияОбУточнении(ДатПУДИнфГО, ВрПУДИнфГО);
		КонецЕсли;
		
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфПрвПрием и ВрИнфПрвПрием
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 6;
	Формат = "5.01";
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула);
	GUID = Строка(Новый УникальныйИдентификатор);
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаТРН(НомерТитула, 
												ДокументЭТРН.Грузоотправитель,
												ДокументЭТРН.Перевозчик,
												ДокументЭТРН.Грузополучатель,
												GUID); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументЭТРН.Грузоотправитель, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_Подписант(НомерТитула, , Формат, ПодписантСтруктура, неопределено); 
	КС.XDTO_Подписант_СформироватьСведенияМЧД(НомерТитула, XDTO_Подписант, ПодписантСтруктура, Результат);
		
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, , Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	КС.XDTO_Установить(XDTO_Файл.Документ, "НаимЭкСубСост", ДокументЭТРН.Грузоотправитель.НаименованиеОрганизацииПолное);
	
	Если ЗначениеЗаполнено(ИдДокОснДовОргСост) Или ЗначениеЗаполнено(НаимДокОснДовОргСост) Тогда
	
		Составители = КС.Массив_XDTO_СоставителиДокумента(НомерТитула, ДокументЭТРН, СтороныСостДокОснДовОргСост, ДопСостДокОснДовОргСост);
		XDTO_ОснДовОргСост = КС.XDTO_РеквДокТип(НомерТитула,
												НаимДокОснДовОргСост,
												НомерДокОснДовОргСост,
												ДатаДокОснДовОргСост,
												ИдДокОснДовОргСост,
												ДопСведДокОснДовОргСост,
												Составители);
												
		КС.XDTO_Установить(XDTO_Файл.Документ, "ОснДовОргСост", XDTO_ОснДовОргСост);
	
	КонецЕсли;
	
	КС.XDTO_УстановитьСУсловием(XDTO_Файл.Документ, "НаимПлат", НаименованиеПлательщика);
	
	Если ЗначениеЗаполнено(НаименованиеПлательщика) Тогда 
		
		Если ЗначениеЗаполнено(ИдДокОснИнПлат) Или ЗначениеЗаполнено(НаимДокОснИнПлат) Тогда
			
			Составители = КС.Массив_XDTO_СоставителиДокумента(НомерТитула, ДокументЭТРН, СтороныСостДокОснИнПлат, ДопСостДокОснИнПлат);
			XDTO_ОснИнПлат = КС.XDTO_РеквДокТип(НомерТитула,
												НаимДокОснИнПлат,
												НомерДокОснИнПлат,
												ДатаДокОснИнПлат,
												ИдДокОснИнПлат,
												ДопСведДокОснИнПлат,
												Составители);
													
			КС.XDTO_Установить(XDTO_Файл.Документ, "ОснДовОргСост", XDTO_ОснИнПлат);
			
		КонецЕсли;
	
	КонецЕсли;	
	
	XDTO_СодФХЖ2 = КС.XDTO_СодФХЖ2(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодФХЖ2", XDTO_СодФХЖ2);
	
	XDTO_ИдПУДИнфПрв = КС.XDTO_ИдПУДИнфПрв(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдПУДИнфПрв", XDTO_ИдПУДИнфПрв);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТекстФайлаУведомленияОбУточнении(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 6;
	Формат = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ФорматОбменаУведомленийОбУточнении();
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");

	XDTO_Файл = КС.XDTO_ФайлОбменаУведомлений(Ссылка, ДокументЭТРН, Формат);
	
	// подписант
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументЭТРН.Грузоотправитель, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	XDTO_Подписант 		= КС.XDTO_ПодписантУведомления( , , ПодписантСтруктура, Неопределено);
	XDTO_Файл.Документ.Подписант = XDTO_Подписант;
	Результат.Вставить("ИдентификаторМЧД",	ПодписантСтруктура.МЧД);
	
	GUID = Строка(Новый УникальныйИдентификатор);
			
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаУведомлений(ДокументЭТРН.Перевозчик, ДокументЭТРН.Грузоотправитель, GUID);
	Результат.Вставить("ИдФайл", XDTO_Файл.ИдФайл);
	
	КС.УдалитьПустыеСвойстваXDTO(XDTO_Файл);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

