#Область ПрограммныйИнтерфейс

// Закупка загружена.
// 
// Параметры:
//  ИДЗакупки - Строка -  Идентификатор закупки
// 
// Возвращаемое значение:
//  Структура -  Закупка загружена:
// * Загружен - Булево - Документ загружен
// * СсылкаНаЗагруженный - ДокументСсылка.КонтурЗакупки_Закупка - Ссылка на загруженный документ
Функция ЗакупкаЗагружена(ИДЗакупки) Экспорт

	СтруктураЗагружена = Новый Структура;
	СтруктураЗагружена.Вставить("Загружен", Ложь);
	СтруктураЗагружена.Вставить("СсылкаНаЗагруженный", Документы.КонтурЗакупки_Закупка.ПустаяСсылка());

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЗакупки_Закупка.Ссылка КАК СсылкаНаЗагруженный,
	|	ИСТИНА КАК Загружен
	|ИЗ
	|	Документ.КонтурЗакупки_Закупка КАК КонтурЗакупки_Закупка
	|ГДЕ
	|	КонтурЗакупки_Закупка.ИдентификаторЗакупки = &ИДЗакупки";
	Запрос.УстановитьПараметр("ИДЗакупки", ИДЗакупки);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураЗагружена.Загружен = Истина;
		СтруктураЗагружена.СсылкаНаЗагруженный = Выборка.СсылкаНаЗагруженный;
	КонецЕсли;

	Возврат СтруктураЗагружена;
КонецФункции

// Заполнение справочника отраслей обновленных.
Процедура ЗаполнениеСправочникаОтраслейОбновленных() Экспорт
	Справочники.КонтурЗакупки_ОтраслиОбновленные.ЗаполнениеСправочника();
КонецПроцедуры

// Заполнить организатора в закупках.
Процедура ЗаполнитьОрганизатораВЗакупках() Экспорт
	
	Закупки_ЗаполненОрганизатор = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"Закупки_ЗаполненОрганизатор", Ложь);

	Если Не Закупки_ЗаполненОрганизатор Тогда
		Документы.КонтурЗакупки_Закупка.ЗаполнитьОрганизатораИзТабличнойЧасти();

		КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("Закупки_ЗаполненОрганизатор", Истина);
	КонецЕсли;

КонецПроцедуры

// Процедура загружает документ закупки повторно.
//
// Параметры:
//  ДокументОбъект	- ДокументОбъект.КонтурЗакупки_Закупка. Объект документ закупки.
// 
Процедура ЗагрузитьДокументЗакупкиПовторно(ДокументОбъект) Экспорт
	
	ИдентификаторЗакупки = ДокументОбъект.ИдентификаторЗакупки;
	
    ЭкземплярОбработки = НовыйЭкземплярОбработкиДанныеЗакупки(ИдентификаторЗакупки);
	
	ЭкземплярОбработки.ПолучитьДанныеЗакупки(ДокументОбъект);
	
КонецПроцедуры

// Функция загружает результат закупки.
//
// Параметры:
//  Закупка				 - ДокументСсылка.КонтурЗакупки_Закупка. Ссылка на документ закупки. 
//  ИдентификаторЗакупки - Строка. Идентификатор закупки. 
// 
// Возвращаемое значение:
//	Строка. Описание результата. 
//
Функция ЗагрузитьРезультатЗакупки(Закупка, ИдентификаторЗакупки) Экспорт
		
	ОписаниеРезультата = "";	
	ЭкземплярОбработки = НовыйЭкземплярОбработкиДанныеЗакупки(ИдентификаторЗакупки);
	
	ЭкземплярОбработки.ПолучитьРезультатыЗакупки(Закупка, ОписаниеРезультата);
	
	// Ошибка 403 означает, что метод не подключен.
	Если Найти(ОписаниеРезультата, "Код статуса: 403") > 0 Тогда
		ОписаниеРезультата = НСтр("ru = 'Не подключен функционал ""Получения результатов закупки"" для текущего API-ключа.'");
	КонецЕсли;
		
	Возврат ОписаниеРезультата;
		
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйЭкземплярОбработкиДанныеЗакупки(ИдентификаторЗакупки)
	
	ЭкземплярОбработки = Обработки.КонтурЗакупки_ДанныеЗакупки.Создать();

	ЭкземплярОбработки.ИдентификаторЗакупки = ИдентификаторЗакупки;
	
	Возврат ЭкземплярОбработки;
	
КонецФункции

#КонецОбласти