
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВходныеДанные = Неопределено;
	Параметры.Свойство("СписокОснований", ВходныеДанные);
	
	Если ВходныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДанныеФормы(ВходныеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СписокОснований.Количество() = 0 Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаправки

&НаКлиенте
Процедура ЗаправкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Заправки.Получить(ВыбраннаяСтрока);
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущаяСтрока.ПутевойЛист);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеФормы(ВходныеДанные)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВходныеДанные", ВходныеДанные);
	Запрос.УстановитьПараметр("ТипДанных", РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ГСМ);
	Запрос.УстановитьПараметр("Разрез2", Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.Заправка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка КАК Титул1
	|ПОМЕСТИТЬ Титулы1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул1 КАК КонтурЛогистика_ПЛ_Титул1
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка В(&ВходныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул3.Титул1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул3 КАК КонтурЛогистика_ПЛ_Титул3
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул3.Ссылка В(&ВходныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул4.Титул1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул4 КАК КонтурЛогистика_ПЛ_Титул4
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул4.Ссылка В(&ВходныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул5.Титул1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул5 КАК КонтурЛогистика_ПЛ_Титул5
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул5.Ссылка В(&ВходныеДанные)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Титулы1.Титул1 КАК ПутевойЛист,
	|	СУММА(КонтурЛогистика_ПроизвольныеДанные.Количество) КАК Количество,
	|	КонтурЛогистика_ПроизвольныеДанные.Реквизит1 КАК ГорючеСмазочныеМатериалы,
	|	КонтурЛогистика_ПроизвольныеДанные.Разрез3 КАК ИдентификаторЗаправки
	|ИЗ
	|	Титулы1 КАК Титулы1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|		ПО Титулы1.Титул1.kl_id = КонтурЛогистика_ПроизвольныеДанные.Разрез1
	|			И (КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных)
	|			И (КонтурЛогистика_ПроизвольныеДанные.Разрез2 = &Разрез2)
	|
	|СГРУППИРОВАТЬ ПО
	|	Титулы1.Титул1,
	|	КонтурЛогистика_ПроизвольныеДанные.Разрез3,
	|	КонтурЛогистика_ПроизвольныеДанные.Реквизит1
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПутевойЛист,
	|	ГорючеСмазочныеМатериалы";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Заправки.Загрузить(Результат);
	
	СписокОснований.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("ПутевойЛист"));
	
	ИтогоТоплива = Заправки.Итог("Количество");
	
КонецПроцедуры

#КонецОбласти