Функция ПолучитьСсылкуПоИмениПредопределенного(ИмяПредопределенного, ПробоватьСоздаватьПриОтсутствии = Истина) Экспорт
	
	Если ТипЗнч(ИмяПредопределенного) <> Тип("Строка") Тогда
		Если ТипЗнч(ИмяПредопределенного) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиПартнеров")
				И НЕ КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодсистемаКакРасширение() Тогда
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Устаревший тип наименования настройки (ожидается строка): " + ИмяПредопределенного;
			Сообщение.Сообщить();
			Возврат ИмяПредопределенного;
			
		Иначе
			
			ВызватьИсключение "Неверный тип наименования настройки (ожидается строка): " + ИмяПредопределенного;					
			
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкаСсылка = НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", ИмяПредопределенного);
	
	Если НастройкаСсылка.Пустая() И ПробоватьСоздаватьПриОтсутствии = Истина Тогда // возможно её просто нет в справочнике
		
		ОбновитьПовторноИспользуемыеЗначения();
		ЗаполнитьВсеНастройкиЗначениямиПоУмолчанию(Истина); // истина - только неинициализированные
		ОбновитьПовторноИспользуемыеЗначения();

		НастройкаСсылка = НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", ИмяПредопределенного);
		
	КонецЕсли;
	
	Если НастройкаСсылка.Пустая() Тогда
		
		Если ПробоватьСоздаватьПриОтсутствии = Истина Тогда 
			ВызватьИсключение "Попытка получить значение неизвестной настройки партнера " + ИмяПредопределенного;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НастройкаСсылка;
	
КонецФункции

Функция ТаблицаНастроекПоУмолчанию() Экспорт
	
	// Инициализируем таблицу хранения
	ТаблицаНастроек = Новый ТаблицаЗначений;
	ТаблицаНастроек.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,
		Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
	ТаблицаНастроек.Колонки.Добавить("ИмяНастройки", Новый ОписаниеТипов("Строка",,
		Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	ТаблицаНастроек.Колонки.Добавить("Значение");
	ТаблицаНастроек.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("Строка",,
		Новый КвалификаторыСтроки(200, ДопустимаяДлина.Переменная)));
	ТаблицаНастроек.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка",,
		Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	ТаблицаНастроек.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.КонтурЛогистика_НастройкиПартнеров"));
	
	ДобавитьНастройкиПартнера(ТаблицаНастроек);
	
	ТаблицаНастроек.Сортировать("ТипЗначения Возр");
	
	Возврат ТаблицаНастроек;
	
КонецФункции

Процедура ДобавитьНастройкиПартнера(ТаблицаНастроек)
	
	ИмяРодителя = Неопределено; // в партнерах без иерархии
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Обязательный GLN точки доставки", "ОбязательныйGLNТочкиДоставки",
		"Булево", Ложь,
		"При отправке Титула1 ТРН будет проведена проверка, что у места доставки указан GLN");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Обязательный GTIN товара", "ОбязательныйGTINТовара",
		"Булево", Ложь,
		"При отправке Титула1 ТРН будет проведена проверка, что у всех товаров указан GTIN");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Сворачивать товары", "СворачиватьТовары",
		"Булево", Ложь,
		"При отправке Титула1 ТРН свернем товары по указанному признаку");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Условие группировки строк товаров", "УсловиеГруппировкиСтрокТоваров",
		"Строка", "",
		"Доп. условие сворачивания товаров (подробнее в настройке конвертации титула 1 ТРН)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Обязательный номер заказа (товаров)", "ОбязательныйНомерЗаказаТоваров",
		"Булево", Ложь,
		"При отправке Титула1 ТРН проверим, что указан номер заказа (например из EDI)");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Обязательный номер УПД", "ОбязательныйНомерУПД",
		"Булево", Ложь,
		"При отправке Титула1 ТРН проверим, что указан номер УПД");
	
	ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя,
		"Обязательный номер DESADV", "ОбязательныйНомерDESADV",
		"Булево", Ложь,
		"При отправке Титула1 ТРН проверим, что указан номер DESADV (уведомления об отгрузке из EDI)");
	
КонецПроцедуры

// Добавить строку настроек
//
// Параметры:
//  ТаблицаНастроек	 - ТаблицаЗначений	 - Таблица с данными
//  ИмяРодителя		 - Строка	 - Имя родителя
//  Наименование	 - Строка	 - Наименование (синоним)
//  ИмяНастройки	 - Строка	 - Имя предопределенного
//  ТипЗначения		 - Строка	 - Тип (для групп не указывается)
//  Значение		 - Строка	 - Значение по умолчанию (для групп не указывается)
//  Описание		 - Строка	 - Описание
//
Процедура ДобавитьСтрокуНастроек(ТаблицаНастроек, ИмяРодителя = Неопределено, Наименование, ИмяНастройки, ТипЗначения, Значение, Описание)
	
	НоваяСтрокаТаблицы = ТаблицаНастроек.Добавить();
	НоваяСтрокаТаблицы.Наименование = Наименование;
	НоваяСтрокаТаблицы.ИмяНастройки = ИмяНастройки;
	//НоваяСтрокаТаблицы.РодительИмяНастройки = ИмяРодителя; // в партнерах без иерархии
	НоваяСтрокаТаблицы.ТипЗначения = ТипЗначения;
	НоваяСтрокаТаблицы.Описание = Описание;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		НоваяСтрокаТаблицы.Значение = КонтурЛогистика_ОбщегоНазначенияСервер.ПреобразоватьЗначениеКТипу(Значение, НоваяСтрокаТаблицы.ТипЗначения);
	Иначе
		НоваяСтрокаТаблицы.Значение = КонтурЛогистика_ОбщегоНазначенияСервер.ПреобразоватьЗначениеКТипу(Неопределено, НоваяСтрокаТаблицы.ТипЗначения);
	КонецЕсли;
	
	Попытка
		// Важно здесь не пробовать её создать, иначе зациклимся
		НоваяСтрокаТаблицы.Ссылка = Справочники.КонтурЛогистика_НастройкиПартнеров.ПолучитьСсылкуПоИмениПредопределенного(НоваяСтрокаТаблицы.ИмяНастройки, Ложь);
	Исключение
		Сообщить("Не могу найти предопределенную настройку партнера в справочнике настроек партнера: " + НоваяСтрокаТаблицы.ИмяНастройки);
	КонецПопытки;
	
КонецПроцедуры

Функция ЗаполнитьВсеНастройкиЗначениямиПоУмолчанию(ТолькоНеинициализированные = Ложь, ОбновлятьОписание = Ложь) Экспорт
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	ТаблицаНастроекПоУмолчанию = ТаблицаНастроекПоУмолчанию();
	
	Если Не ЗначениеЗаполнено(ТаблицаНастроекПоУмолчанию) Тогда
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Настройки не найдены";
		
		Возврат Результат;
		
	КонецЕсли;
	
	Для Каждого СтрокаНастройки Из ТаблицаНастроекПоУмолчанию Цикл
		
		Если ЗначениеЗаполнено(СтрокаНастройки.Ссылка) Тогда
			
			// Если требуется, то установим значение по умолчанию
			Если Не ТолькоНеинициализированные Тогда
				УстановитьНастройкеЗначениеПоУмолчанию(СтрокаНастройки.Ссылка, ТаблицаНастроекПоУмолчанию);
			КонецЕсли;
			
			// Если требуется и описание изменилось, то обновим
			Если ОбновлятьОписание И СтрокаНастройки.Описание <> СтрокаНастройки.Ссылка.Описание Тогда
				НастройкаОбъект = СтрокаНастройки.Ссылка.ПолучитьОбъект();
				НастройкаОбъект.Описание = СтрокаНастройки.Описание;
				НастройкаОбъект.Записать();
			КонецЕсли;
			
		Иначе
			
			// Еще раз проверить что настройка не была создана (могла быть создана в другом сеансе)
			ПроверкаНастройка = НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", СтрокаНастройки.ИмяНастройки);
			Если Не ПроверкаНастройка.Пустая() Тогда
				Продолжить;
			КонецЕсли;
			
			// Создадим новую настройку
			НастройкаОбъект = Справочники.КонтурЛогистика_НастройкиПартнеров.СоздатьЭлемент();
			НастройкаОбъект.ИмяПредопределенногоДляРасширения = СтрокаНастройки.ИмяНастройки;
			НастройкаОбъект.Наименование = СтрокаНастройки.Наименование;
			НастройкаОбъект.Записать();
			
			СтрокаНастройки.Ссылка = НастройкаОбъект.Ссылка;
			
			УстановитьНастройкеЗначениеПоУмолчанию(СтрокаНастройки.Ссылка, ТаблицаНастроекПоУмолчанию);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьНастройкеЗначениеПоУмолчанию(НастройкаСсылка, ТаблицаНастроекПоУмолчанию = Неопределено) Экспорт
	
	// не возвращаем к дефолту эти настройки:
	
	// пока таких нет
	
	
	// настройки можно скинуть в дефолт
	
	Если ТаблицаНастроекПоУмолчанию = Неопределено Тогда 
		ТаблицаНастроекПоУмолчанию = ТаблицаНастроекПоУмолчанию();
	КонецЕсли;
	
	Попытка  // на 8.2 нет Имя_Предопределенных_Данных
		
		НайденноеУмолчание = ТаблицаНастроекПоУмолчанию.Найти(НастройкаСсылка, "Ссылка");
		
	Исключение
		
	    НайденноеУмолчание = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Настройка: " + НастройкаСсылка + " >>> Очень старая версия платформы, заполнение значения по умолчанию не реализовано";
		Сообщение.Сообщить();
		
	КонецПопытки;	
	
	Если ЗначениеЗаполнено(НайденноеУмолчание) Тогда 
		
		Если НастройкаСсылка.ТипЗначения <> НайденноеУмолчание.ТипЗначения 
			ИЛИ НастройкаСсылка.Описание <> НайденноеУмолчание.Описание
			ИЛИ (ЗначениеЗаполнено(НайденноеУмолчание.Значение) И НастройкаСсылка.Значение <> НайденноеУмолчание.Значение) Тогда 
			
			Попытка
				
				НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(НастройкаОбъект, НайденноеУмолчание, "ТипЗначения, Описание");
				Если ЗначениеЗаполнено(НайденноеУмолчание.Значение) ИЛИ 
					(НайденноеУмолчание.ТипЗначения = "Число" И НайденноеУмолчание.Значение = 0) Тогда 
					ЗаполнитьЗначенияСвойств(НастройкаОбъект, НайденноеУмолчание, "Значение");
				КонецЕсли;
				
				НастройкаОбъект.Записать();
				
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось записать значение по умолчанию для настройки: " + НастройкаСсылка.Наименование;
				Сообщение.УстановитьДанные(НастройкаСсылка);
				Сообщение.Сообщить();
				
			КонецПопытки;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

