

&НаКлиенте
Процедура ЗавершитьВыполнение(Команда)
	
	ЗавершитьВыполнениеСервер();
	ОтключитьОбработчикОжидания("ПроверитьСостояние");
	ИнтервалОбработчикаОжидания = 0.1;
	ПодключитьОбработчикОжидания("ПроверитьСостояние", ИнтервалОбработчикаОжидания, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьВыполнениеСервер()
	
	КонтурЛогистика_ДлительныеОперацииСервер.ОтменитьВыполнениеЗадания(ИдентификаторФоновогоЗадания);
	Элементы.ЗавершитьВыполнение.Заголовок = "отменяется...";
	Элементы.ПоясениеОЗакрытии.Видимость = Ложь;
	Элементы.Декорация2.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Прогресс = 0;
	ИдентификаторФоновогоЗадания = Параметры.ИдентификаторФоновогоЗадания;
	КлючФЗ = Параметры.КлючФоновогоЗадания;
	ЗакрытьПриУспешномВыполнении = Параметры.ЗакрытьПриУспешномВыполнении;
	Элементы.ДекорацияПояснение.Заголовок = Параметры.ПредставлениеЗадачи;
	Элементы.Прогресс.Видимость = Параметры.ОтображатьПрогресс;
	
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда 
		
		СостояниеЗадания = КонтурЛогистика_ДлительныеОперацииСервер.ЗаданиеВыполнено(ИдентификаторФоновогоЗадания, , Истина);
		Элементы.ДекорацияПояснение.Заголовок = СостояниеЗадания.Наименование;
		
	Иначе
		// можем сами запустить фоновое задание а не брать существующее
		Если ЗначениеЗаполнено(Параметры.ЗапуститьМетод) Тогда
			
			ПараметрыЗапускаемогоМетода = ПреобразоватьПараметрыЗапускаемогоМетода(Параметры.ПараметрыЗапускаемогоМетода);

			Попытка
				
				ЗапуститьФоновоеЗадание(Параметры.ЗапуститьМетод, ПараметрыЗапускаемогоМетода, Параметры.КлючФоновогоЗадания, Параметры.ПредставлениеЗадачи);
				
			Исключение
				
				ЗавершениеСОшибкой(ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПреобразоватьПараметрыЗапускаемогоМетода(ПараметрыЗапускаемогоМетода)
	
	ПреобразованныеПараметрыМетода = Новый Структура();
	
	Если ПараметрыЗапускаемогоМетода = Неопределено 
		ИЛИ ТипЗнч(ПараметрыЗапускаемогоМетода) <> Тип("Структура")
		ИЛИ ПараметрыЗапускаемогоМетода.Количество() = 0 Тогда
		Возврат ПреобразованныеПараметрыМетода;
	КонецЕсли;
	
	Для Каждого ПарамМетода ИЗ ПараметрыЗапускаемогоМетода Цикл
		Если ТипЗнч(ПарамМетода.Значение) = Тип("ДанныеФормыКоллекция") Тогда
			ПреобразованныеПараметрыМетода.Вставить(ПарамМетода.Ключ, ПарамМетода.Значение.Выгрузить());
		Иначе
			ПреобразованныеПараметрыМетода.Вставить(ПарамМетода.Ключ, ПарамМетода.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПреобразованныеПараметрыМетода;
	
КонецФункции

&НаСервере
Функция ЗапуститьФоновоеЗадание(Метод, ПараметрыМетодаСтруктура = Неопределено, КлючФЗ = Неопределено, НаименованиеФЗ = "Фоновая задача")
	
	Попытка
		
		Если (КлючФЗ = Неопределено) Тогда
			КлючФЗ = Метод;
		КонецЕсли;
		
		РезультатФоновогоЗадания = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФоновогоЗадания();
		АдресРезультатаФЗ = ПоместитьВоВременноеХранилище(РезультатФоновогоЗадания, ЭтаФорма.УникальныйИдентификатор);
		
		Если ПараметрыМетодаСтруктура = Неопределено Тогда
			ПараметрыМетодаСтруктура = Новый Структура();
		КонецЕсли;
		 
		РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьВФоне(Метод, ПараметрыМетодаСтруктура, КлючФЗ, НаименованиеФЗ, АдресРезультатаФЗ);
		ИдентификаторФоновогоЗадания = РезультатЗапуска.ИдентификаторЗадания; 
		
		Возврат Неопределено;
		
	Исключение
		
		ЗавершениеСОшибкой(ОписаниеОшибки());
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// запустить задание
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		ИнтервалОбработчикаОжидания = 0.1;
		ПодключитьОбработчикОжидания("ПроверитьСостояние", ИнтервалОбработчикаОжидания, Истина);
	Иначе
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСостояние() Экспорт
	
	Если ИнтервалОбработчикаОжидания < 1 Тогда
		ИнтервалОбработчикаОжидания = 1;
	ИначеЕсли ИнтервалОбработчикаОжидания > 15 Тогда
		ИнтервалОбработчикаОжидания = 15;
	Иначе
		ИнтервалОбработчикаОжидания = ИнтервалОбработчикаОжидания * 1.4;
	КонецЕсли;
	
	ПроверитьСостояниеСервер();

	Если Завершено Тогда
		
		Прогресс = 100;
		
	Иначе

		ПодключитьОбработчикОжидания("ПроверитьСостояние", ИнтервалОбработчикаОжидания, Истина);

	КонецЕсли;
	
	Если ЗавершеноУспешно Тогда
		
		Оповестить("ЗавершениеФоновогоЗадания", Новый Структура("ИдентификаторЗадания,КлючФЗ,Успешно", ИдентификаторФоновогоЗадания, КлючФЗ, ЗавершеноУспешно));
		
		Если ЗакрытьПриУспешномВыполнении = Истина Тогда 
			ЭтаФорма.Закрыть();
		Иначе
			Элементы.Лоадер.Видимость = Ложь;
			ЭтаФорма.Заголовок = "Завершено успешно.";
			ЭтаФорма.Элементы.Группа2.Видимость = Ложь;
			ЭтаФорма.Элементы.ЗавершитьВыполнение.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСостояниеСервер()
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФоновогоЗадания);
	Если Задание = Неопределено Тогда 
		Завершено = Истина;
		ЗавершениеСОшибкой("Фоновое задание отсутствует");
		Возврат;
	КонецЕсли;
	
	СообщенияФонового = Задание.ПолучитьСообщенияПользователю();
	ВывестиПротокол(СообщенияФонового);
	
	// Очередь / лоадер
	ВОчереди = КонтурЛогистика_Привилегированный.ЗаданиеВОчереди(ИдентификаторФоновогоЗадания);
	Элементы.ГруппаТаймер.Видимость 	= ВОчереди;
	Элементы.Лоадер.Видимость 			= НЕ ВОчереди;
	Если ВОчереди Тогда 
		Заголовок = "Фоновое задание в очереди (Контур.Логистика)";
	Иначе
		Заголовок = "Выполняется фоновое задание (Контур.Логистика)";
	КонецЕсли;
	
	// TODO заполнить прогресс
	Попытка
		Если ЗначениеЗаполнено(АдресРезультатаФЗ) Тогда
			РезультатФоновогоЗадания = ПолучитьИзВременногоХранилища(АдресРезультатаФЗ);
			Прогресс = РезультатФоновогоЗадания.Прогресс;
		Иначе
			Элементы.Прогресс.Видимость = Ложь;
		КонецЕсли;
		
	Исключение
		
		Элементы.Прогресс.Видимость = Ложь;
		
	КонецПопытки;
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		
		Завершено = Истина;
		ЗавершеноУспешно = Истина;
		Прогресс = 100;
		
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		
		Завершено = Истина;
		Элементы.ДекорацияПояснение.Заголовок = "Задание отменено";
		Элементы.Лоадер.Видимость = Ложь;
		ЭтаФорма.Заголовок = "Задание отменено.";
				
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно  Тогда
		
		Завершено = Истина;
		ЗавершениеСОшибкой(СформироватьПредставлениеИнформацииОбОшибке(Задание.ИнформацияОбОшибке));
				
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция СформироватьПредставлениеИнформацииОбОшибке(Инфо)
	
	// ПредставлениеОшибки = "" + Инфо.Описание + Символы.ПС + "( в модуле: " + Инфо.ИмяМодуля + " строка: " +  Инфо.НомерСтроки + Инфо.ИсходнаяСтрока + ")";
	ПредставлениеОшибки = Инфо.Описание;	
	Возврат ПредставлениеОшибки;
	
КонецФункции

&НаСервере
Процедура ВывестиПротокол(СообщенияФонового)

	Протокол = "";
	
	КоличествоСообщений = СообщенияФонового.Количество();
	
	Для й = 1 По КоличествоСообщений Цикл
		Сообщение = СообщенияФонового[КоличествоСообщений - й];
		Протокол = Протокол + ?(Протокол = "", "", Символы.ПС) + Сообщение.Текст;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗавершениеСОшибкой(ТекстОшибки = "Произошла непредвиденная ошибка в ходе выполнения")
	
	ЭтаФорма.Заголовок = "Завершено аварийно.";
	Элементы.Лоадер.Видимость = Ложь;
	Элементы.ДекорацияОписаниеОшибки.Заголовок = ТекстОшибки;
	Элементы.ДекорацияОписаниеОшибки.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВОчередиНажатие(Элемент)
	ОткрытьФорму("Обработка.КонтурЛогистика_ФоновыеИРегламентныеЗадания.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПриУспешномВыполненииНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗакрытьПриУспешномВыполнении = Не ЗакрытьПриУспешномВыполнении;
КонецПроцедуры
