#Если Не МобильныйАвтономныйСервер Тогда
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОсновнойМенеджер = ПользователиКлиентСервер.ТекущийПользователь();
	ДатаРегистрации = ТекущаяДатаСеанса();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Наименование") Тогда
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ДанныеЗаполнения.Свойство("Описание") Тогда
			Наименование = ДанныеЗаполнения.Описание;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ОсновнойМенеджер = ПользователиКлиентСервер.ТекущийПользователь();
	ДатаРегистрации = ТекущаяДатаСеанса();
	
	НазначениеПереработчика = Неопределено;
	
	ИндивидуальныйВидЦены   = Справочники.ВидыЦен.ПустаяСсылка();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не Клиент И Не Конкурент И Не Поставщик И Не ПрочиеОтношения И Не Предопределенный Тогда
		Текст = НСтр("ru = 'Необходимо определить хотя бы один тип бизнес-отношений'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ЭтотОбъект,
			"Клиент",
			,
			Отказ);
	КонецЕсли;
	
	Если Не Справочники.ГруппыДоступаПартнеров.ИспользуютсяГруппыДоступа() Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ГруппаДоступа");
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НаименованиеПолное");
		Если ПустаяСтрока(НаименованиеПолное) Тогда
			Если ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
				ТекстСообщения = НСтр("ru = 'Поле ""Фамилия, имя, отчество"" не заполнено'");
			Иначе
				ТекстСообщения = НСтр("ru = 'Поле ""Сокр. юр. наименование"" не заполнено'");
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект,
			"НаименованиеПолное",
			,
			Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ОбщегоНазначенияУТ.ПодготовитьДанныеДляСинхронизацииКлючей(ЭтотОбъект, ПараметрыСинхронизацииКлючей());	
	
	// Обработка смены пометки удаления.
	Если Не ЭтоНовый() И Не ЭтоГруппа Тогда
		
		ПометкаУдаленияДоЗаписи = ОбщегоНазначенияУТ.ЗначениеРеквизитаДоЗаписиИзДополнительныхСвойств("ПометкаУдаления", ДополнительныеСвойства);
		Если ПометкаУдаления <> ПометкаУдаленияДоЗаписи Тогда
			
			Если ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов") Тогда
				КонтрагентПартнера = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(Ссылка);
				Если НЕ КонтрагентПартнера.Пустая() Тогда
					КонтрагентПартнера.ПолучитьОбъект().УстановитьПометкуУдаления(ПометкаУдаления);
				КонецЕсли;
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания Тогда
		
		Пол = Перечисления.ПолФизическогоЛица.ПустаяСсылка();
		ДатаРождения = Дата(1,1,1);
		
	КонецЕсли;
	
	
	ИспользуетсяДоставка25 = ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка25();
	
	Если ИспользуетсяДоставка25 Тогда
		
		ПерваяЗапись = ДоставкаТоваров.ПервоеСозданиеТочекДоставки(ЭтотОбъект);
		ДанныеОсновныхАдресов = ДанныеОсновныхАдресовИзКонтактнойИнформации();
		
		Если ПерваяЗапись
			И ДанныеОсновныхАдресов.Количество() > 0 Тогда
			
			ОбновитьТочкиДоставки = Истина;
			
		Иначе
			
			ДанныеАдресовДоИзменения = ДанныеОсновныхАдресовДоИзменения(ПерваяЗапись);
			ОбновитьТочкиДоставки = ДоставкаТоваров.АдресаИзменены(ДанныеАдресовДоИзменения, ДанныеОсновныхАдресов);
			
		КонецЕсли;
		
		Если ОбновитьТочкиДоставки Тогда
			
			ДанныеДляСозданияТД = Новый Структура;
			ДанныеДляСозданияТД.Вставить("ОбновитьТочкиДоставки", ОбновитьТочкиДоставки);
			ДанныеДляСозданияТД.Вставить("ПерваяЗапись", ПерваяЗапись);
			ДанныеДляСозданияТД.Вставить("ДанныеОсновныхАдресов", ДанныеОсновныхАдресов);
			
			ДополнительныеСвойства.Вставить("ДанныеДляСозданияТД", ДанныеДляСозданияТД);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаписатьИерархиюПартнера(Ссылка);
	
	
	ОбщегоНазначенияУТ.СинхронизироватьКлючи(ЭтотОбъект);	
	
	ДанныеДляСозданияТД = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДополнительныеСвойства,
		"ДанныеДляСозданияТД",
		Неопределено);
	
	Если ДанныеДляСозданияТД <> Неопределено Тогда
		
		ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных();
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ТочкиДоставки");
			ЭлементБлокировки.УстановитьЗначение("Владелец", Ссылка);
			Блокировка.Заблокировать();
			
		Исключение
			
			Информация = ИнформацияОбОшибке();
			
			ШаблонСообщения = НСтр("ru = 'Не удалось записать ""%1"": данные подчиненных точек доставки редактируются'");
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения,
				Наименование);
			
			Уточнение = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(Информация, ТекстСообщения);
			ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация);
			
			ОценкаПроизводительности.ЗакончитьЗамерВремени(
				"Справочник.Партнеры.МодульОбъекта.ПриЗаписиОбновитьТочкиДоставки", ВремяНачалаЗамера,,, Истина);
			
			ВызватьИсключение(Уточнение.Текст, Уточнение.Категория,, ПредставлениеОшибки, Информация);
			
		КонецПопытки;
		
		УстановитьПривилегированныйРежим(Истина);
		
		ДанныеЗаполнения = ДоставкаТоваров.ДанныеТочекДоставкиКОбработке(
			Ссылка,
			ДанныеДляСозданияТД.ПерваяЗапись,
			ДанныеДляСозданияТД.ДанныеОсновныхАдресов);
		
		Для Каждого ДанныеТочки Из ДанныеЗаполнения Цикл
			
			ДоставкаТоваров.ОбновитьСоздатьТочкуДоставки(Ссылка, ДанныеТочки);
			
		КонецЦикла;
		
		ОценкаПроизводительности.ЗакончитьЗамерВремени(
			"Справочник.Партнеры.МодульОбъекта.ПриЗаписиОбновитьТочкиДоставки",
			ВремяНачалаЗамера);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЧтенииПредставленийНаСервере() Экспорт
	
	МультиязычностьСервер.ПриЧтенииПредставленийНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Функция ПараметрыСинхронизацииКлючей()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("Справочник.ВидыЗапасов", "ПометкаУдаления");
	Результат.Вставить("Справочник.КлючиАналитикиУчетаНоменклатуры", "ПометкаУдаления");
	Результат.Вставить("Справочник.КлючиАналитикиУчетаПартий", "ПометкаУдаления");
	Результат.Вставить("Справочник.КлючиАналитикиУчетаПоПартнерам", "ПометкаУдаления");
	Результат.Вставить("Справочник.КлючиРеестраДокументов", "ПометкаУдаления,Наименование");
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеОсновныхАдресовДоИзменения(ПерваяЗапись)
	
	Результат = ДоставкаТоваров.НовыеДанныеАдресов();
	
	Если Не ПерваяЗапись Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Адрес,
		|	КонтактнаяИнформация.Значение КАК АдресЗначение,
		|	КонтактнаяИнформация.ЗначенияПолей КАК АдресЗначенияПолей,
		|	ИСТИНА КАК Основной
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Ссылка
		|	И КонтактнаяИнформация.Вид = &Вид";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресПартнера);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			АдресПустой = ДоставкаТоваров.АдресПустой(Выборка);
			
			Если НЕ АдресПустой Тогда
				
				СтрокаАдреса = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаАдреса, Выборка);
				
				СтрокаАдреса.Идентификатор =
					ДоставкаТоваровЛокализация.ИдентификаторАдресаТочкиДоставки(СтрокаАдреса.АдресЗначение);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеОсновныхАдресовИзКонтактнойИнформации()
	
	ЗонаДоставкиДляЗаполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДополнительныеСвойства,
		"ЗонаДоставки",
		Справочники.ЗоныДоставки.ПустаяСсылка());
	
	Отбор = Новый Структура;
	Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.АдресПартнера);
	СтрокиАдреса = КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	ДанныеАдресов = ДоставкаТоваров.ДанныеАдресовПоДаннымКонтактнойИнформации(СтрокиАдреса, ЗонаДоставкиДляЗаполнения);
	
	Возврат ДанныеАдресов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
#КонецЕсли
