///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПлатежныеСистемы.БазоваяФункциональностьПлатежныхСистем".
// ОбщийМодуль.ПлатежныеСистемыКлиентПереопределяемый.
//
// Переопределяемые клиентские процедуры работы с платежными системами:
//  - открытие списка кассовых ссылок.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РаботаСКассовымиСсылками

// Определяет алгоритм, выполняющийся при открытии формы кассовых ссылок из формы настройки подключения к
//   платежным системам.
//   Вызывается только в том случае, если платежная система поддерживает работу с кассовыми ссылками.
//
// Параметры:
//  ПараметрыНастройки - Структура - содержит в себе описание настроек подключения:
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - Ссылка на
//       элемент справочника, для которого необходимо открыть форму настройки кассовых ссылок.
//    * ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система настройки.
//  ПараметрыОплаты - Соответствие Из КлючИЗначение - содержит имена и значения полей регистра сведений,
//      хранящего данные о настройках оплат.
//  ОповещениеПослеЗакрытияФормы - ОписаниеОповещения - оповещение о закрытии формы кассовых ссылок
//
Процедура ПриНастройкеКассовыхСсылок(
		ПараметрыНастройки,
		ПараметрыОплаты,
		ОповещениеПослеЗакрытияФормы) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
