Функция ЗаполнитьЗначениямиПоУмолчанию(ОбновитьОписанияИНиманования = Ложь) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	ТаблицаПредопределенных = ПолучитьТаблицуПредопределенных();
	
	Если ЗначениеЗаполнено(ТаблицаПредопределенных) Тогда 
		
		Для Каждого СтрокаПредопределенного Из ТаблицаПредопределенных Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаПредопределенного.Ссылка) ИЛИ ОбновитьОписанияИНиманования = Истина Тогда
				
				Если ЗначениеЗаполнено(СтрокаПредопределенного.Ссылка) Тогда 
					СтранаОбъект = СтрокаПредопределенного.Ссылка.ПолучитьОбъект();
				Иначе
					СтранаОбъект = Справочники.КонтурЛогистика_СтраныМира.СоздатьЭлемент();
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(СтранаОбъект, СтрокаПредопределенного, "Код, Наименование");
				Если СтранаОбъект.Код = "643" Тогда 
					СтранаОбъект.Избранная = Истина;
				КонецЕсли;
				
				СтранаОбъект.Записать();
				
				СтрокаПредопределенного.Ссылка = СтранаОбъект.Ссылка;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Результат.Успешно = Истина;
		
	Иначе 
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Предопределенные значения для заполнения стран мира не найдены.";	
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуПредопределенных() Экспорт
	
	ТаблицаПредопределенных = Новый ТаблицаЗначений;
	ТаблицаПредопределенных.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,
		Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	ТаблицаПредопределенных.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка",,
		Новый КвалификаторыСтроки(3, ДопустимаяДлина.Переменная)));
	ТаблицаПредопределенных.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.КонтурЛогистика_СтраныМира"));
	
	Макет = Справочники.КонтурЛогистика_СтраныМира.ПолучитьМакет("Классификатор");
	Область = Макет.ПолучитьОбласть("Данные");
	
	Для Сч = 1 По Область.ВысотаТаблицы Цикл
		
		НоваяСтрокаТаблицы = ТаблицаПредопределенных.Добавить();
		
		НоваяСтрокаТаблицы.Наименование				= ПолучитьТекстЯчейкиОбласти(Область, Сч, 5);
		НоваяСтрокаТаблицы.Код						= ПолучитьТекстЯчейкиОбласти(Область, Сч, 2);
		
		НайденнаяСсылка = НайтиПоКоду(НоваяСтрокаТаблицы.Код);
		
		Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда 
		
			НоваяСтрокаТаблицы.Ссылка = НайденнаяСсылка;
			
		КонецЕсли;	
		
		ТребДействиеТекстИмени = ПолучитьТекстЯчейкиОбласти(Область, Сч, 5);
		
	КонецЦикла;
	
	Возврат ТаблицаПредопределенных;
	
КонецФункции

Функция ПолучитьТекстЯчейкиОбласти(Область, Строка, Колонка)
	
	Возврат Строка(Область.ПолучитьОбласть("R" + Формат(Строка, "ЧГ=0") + "C" + Формат(Колонка, "ЧГ=0")).ТекущаяОбласть.Текст);
	
КонецФункции

Функция НастройкиЗаполнены() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_СтраныМира.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_СтраныМира КАК КонтурЛогистика_СтраныМира";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции
