#Область СлужебныйПрограммныйИнтерфейс

// Дополняет массив исключений источников оповещений.
// 
// Параметры:
//  Исключения - Массив из Строка - Источники оповещений исключения
Процедура ДополнитьИсточникиОповещенийИсключения(Исключения) Экспорт
	
КонецПроцедуры

// Дополняет массив объектами с описанием видов оповещений.
// 
// Параметры:
//  МассивОбъектов - Массив из Строка - Источники оповещений исключения
Процедура ДополнитьОбъектыСОписаниемВидовОповещений(МассивОбъектов) Экспорт
	
	//++ Локализация
	МассивОбъектов.Добавить(Метаданные.ОбщиеМодули.СервисСверкиРасчетовУТ.ПолноеИмя());
	//-- Локализация
	
КонецПроцедуры

// Формирует массив объектов с описанием видов оповещений.
// 
// Параметры:
//  ГруппыВидовОповещений - см. ОповещенияПользователейОСобытиях.ГруппыВидовОповещений
Процедура ДополнитьГруппыВидовОповещений(ГруппыВидовОповещений) Экспорт
	
	ГруппыВидовОповещений.Вставить("СервисСверка20",
		ОповещенияПользователейОСобытиях.ОписаниеГруппыВидовОповещений("abea65af-8fb9-4cdf-b32a-915f42fe6916", 
			НСтр("ru = '1С:Сверка 2.0'", ОбщегоНазначения.КодОсновногоЯзыка()), Истина));
	
КонецПроцедуры

#КонецОбласти