#Область ОбработчикиСобытийФормы

&НаСервере
Процедура АУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "Ссылка", "Список", "ТН", 1, "Список.Ссылка");
	АУ_СозданиеЭлементовФормы.СоздатьПоле(ЭтаФорма, "АУ_ОригиналПолучен", "Список", "Оригинал", 2, "Список.Ссылка.АУ_ОригиналПолучен");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
