// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ИдентификаторЭДО - Строка
Процедура Очистить(ИдентификаторЭДО) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
//  ЭлектронныеДокументы - Массив из ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ОтметитьКОбработке(ИдентификаторЭДО, ЭлектронныеДокументы) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	Для Каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ИдентификаторЭДО = ИдентификаторЭДО;
		ЗаписьНабора.ЭлектронныйДокумент = ЭлектронныйДокумент;
	КонецЦикла;
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ОтметитьВыполнениеОбработки(ИдентификаторЭДО, ЭлектронныйДокумент) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  ОписаниеОшибки - Строка
Процедура ОтметитьОшибкуОбработки(ИдентификаторЭДО, ЭлектронныйДокумент, ОписаниеОшибки) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(ЭлектронныйДокумент);
	НаборЗаписей.Прочитать();
	
	ЗаписьНабора = ?(НаборЗаписей.Количество() > 0, НаборЗаписей[0], НаборЗаписей.Добавить());
	ЗаписьНабора.ИдентификаторЭДО = ИдентификаторЭДО;
	ЗаписьНабора.ЭлектронныйДокумент = ЭлектронныйДокумент;
	ЗаписьНабора.Ошибка = Истина;
	ЗаписьНабора.ОписаниеОшибки = ОписаниеОшибки;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
