#Область СлужебныйПрограммныйИнтерфейс

// Выполняет обработку формы при чтении создании на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма элемента справочника "Договоры подключения к платежным системам".
//
Процедура ПриЧтенииСозданииНаСервере(Форма) Экспорт
	
	//++ Локализация
	Элементы = Форма.Элементы;
	Объект = Форма.Объект; // ДанныеФормыСтруктура
	
	Форма.НастройкиПодключения.ЗагрузитьЗначения(НастройкиПодключенияПоДоговору(Объект.Ссылка));
	
	Если Не ПравоДоступа("Добавление", Метаданные.Справочники.НастройкиПодключенияКСистемеБыстрыхПлатежей)
		Или Не ПравоДоступа("Чтение", Метаданные.Справочники.НастройкиПодключенияКСистемеБыстрыхПлатежей) Тогда
		Элементы.НадписьНастройкаПодключенияПлатежнойСистемы.Доступность = Ложь;
	КонецЕсли;
	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

// Устанавливает заголовок гиперссылки настройки подключения к платежной системе.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма элемента справочника "Договоры подключения к платежным системам".
//
Процедура УстановитьЗаголовокНастройкиПодключенияПлатежнойСистемы(Форма) Экспорт

	//++ Локализация
	Объект = Форма.Объект;
	Форма.НадписьНастройкаПодключенияПлатежнойСистемы = СформироватьНадписьНастройкаПодключенияПлатежнойСистемы(Объект.Ссылка);
	//-- Локализация
	
	Возврат;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация

// Возвращает список настроек подключения СБП по договору.
// 
// Параметры:
//  Договор - СправочникСсылка.ДоговорыЭквайринга - договор подключения к платежной системе.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей - список настроек.
//
Функция НастройкиПодключенияПоДоговору(Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НастройкиИнтеграции.Интеграция КАК Интеграция
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграции
	|ГДЕ
	|	НастройкиИнтеграции.Договор = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	УстановитьПривилегированныйРежим(Истина);
	Настройки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Интеграция");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Настройки;
	
КонецФункции

// Возвращает гиперссылку настройки подключения к платежной системе по договору подключения.
// 
// Параметры:
//  ОбъектСсылка - СправочникСсылка.ДоговорыЭквайринга - Договор подключения к платежной системе
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока - Гиперссылка настройки подключения к платежной системе
Функция СформироватьНадписьНастройкаПодключенияПлатежнойСистемы(ОбъектСсылка)
	
	СтрокаНастройкаПодключенияПлатежнойСистемы =
		"<a href = Добавить>+ " + НСтр("ru='Добавить настройку'") + "</a>";

	Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(НастройкиИнтеграции.Интеграция) КАК КоличествоНастроекПодключения
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграции
		|ГДЕ
		|	НастройкиИнтеграции.Договор = &Ссылка
		|;
		|
		|ВЫБРАТЬ
		|	НастройкиИнтеграции.Интеграция КАК Интеграция
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграции
		|ГДЕ
		|	НастройкиИнтеграции.Договор = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
		
		УстановитьПривилегированныйРежим(Истина);
		
		Результат = Запрос.ВыполнитьПакет();
	
		СтрокаНастройкаПодключенияПлатежнойСистемы = "";
	
		КоличествоНастроекПодключения = Результат[0].Выгрузить()[0].КоличествоНастроекПодключения;
		Если КоличествоНастроекПодключения > 1 Тогда
		
			СтрокаНастройкаПодключенияПлатежнойСистемы =
				"<a href = СписокНастроекПодключения>"
				+ НСтр("ru='Настройки подключения'") + " (" + КоличествоНастроекПодключения + ")</a>"
				+ "   " + "<a href = Добавить>+ " + НСтр("ru='Добавить настройку'") + "</a>";
			
		ИначеЕсли КоличествоНастроекПодключения = 1 Тогда
			
			ИнтеграцияСсылка = Результат[1].Выгрузить()[0].Интеграция;
			СтрокаНастройкаПодключенияПлатежнойСистемы =
				"<a href = " + ПолучитьНавигационнуюСсылку(ИнтеграцияСсылка) + ">" + Строка(ИнтеграцияСсылка) + "</a>"
				+ "   " + "<a href = Добавить>+ " + НСтр("ru='Добавить настройку'") + "</a>";
		Иначе
			СтрокаНастройкаПодключенияПлатежнойСистемы =
				"<a href = Добавить>+ " + НСтр("ru='Добавить настройку'") + "</a>";
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(СтрокаНастройкаПодключенияПлатежнойСистемы);
	
КонецФункции

//-- Локализация

#КонецОбласти