
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОбновитьДанныеФормы();
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	
	РазблокироватьДанныеФормыДляРедактирования();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// баги старой платформы при отрисовке сложных группировок:
	// в режиме интерфейса 8.2 отображаем в режиме "на отдельных закладках" шапку и тч
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоИнтерфейс82() Тогда 
		ШапкаНаОтдельнойЗакладке = Истина;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШапка;
		элементы.Группа16.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;

	УправлениеВидимостьюИДоступностью(); // в будущем завернуть на проверить документ
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" 
		И 	(Параметр = Объект.Ссылка 
				ИЛИ
			(Параметр <> Неопределено 
			И ТипЗнч(Параметр) = Тип("Массив") 
			И Параметр.Найти(Объект.Ссылка) <> Неопределено)) Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоДокОснованию(Команда)
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("Да, и СВ и Титул");
	СписокКнопок.Добавить("Да, только Титул");
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика("Действие полностью перезаполнит документ по Основанию. Вы АБСОЛЮТНО уверены?",
		СписокКнопок,
		"Подтвердите операцию",
		,
		ЭтаФорма,
		"ОбработчикСогласияПерезаполнения");
		
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработчикСогласияПерезаполнения(Ответ, ДопПараметр = Неопределено) Экспорт
	
	Если Ответ = "Да, и СВ и Титул" Тогда 
		ПерезаполнитьПоДокОснованиюСервер(Истина);
		ОбновитьДанныеФормы();
	ИначеЕсли Ответ = "Да, только Титул" Тогда
		ПерезаполнитьПоДокОснованиюСервер(Ложь);
		ОбновитьДанныеФормы();
	КонецЕсли;
	
	ОбновитьОтображениеДанных();
	ПолностьюОбновитьПредставлениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТитулаПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.ДокументСВ, Истина);
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда 
		ПерешелВЛогистическиеСтатус = Истина;
	Иначе
		ПерешелВЛогистическиеСтатус = Ложь;
	КонецЕсли;
	Элементы.ТекущийСтатус.Видимость = Не ПерешелВЛогистическиеСтатус;
	Элементы.ТекущийСтатусДокументооборота.Видимость = ПерешелВЛогистическиеСтатус;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Повторно выполнить задачу";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Переотправить неподписанный (черновик)";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Выполнить задачу";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Отправить неподписанный (черновик)";
	КонецЕсли;

	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	ЕстьДокУчСист = ЗначениеЗаполнено(Объект.ДокументОснование);
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = ЭтоВходящий И Не ЕстьДокУчСист;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
	КонецЕсли;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;
	
	Элементы.ПерезаполнитьПоДокОснованию.Видимость = НЕ ЭтоВходящий И ЕстьДокУчСист;
	Элементы.ОбщаяКомандаКонтурЛогистика_НайтиДокументУчетнойСистемы.Видимость = НЕ ЕстьДокУчСист;
	Элементы.ПользовательПодписант.Видимость = НЕ ЭтоВходящий;
	
	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, Объект.ДокументОснование, Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер(ПерезаполнятьЭТРН = Ложь)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ДокОбъект.Заполнить(Новый Структура("ДокументОснование, ТипЛогистика, ПерезаполнитьГлавныйДокументЕслиСуществует", ДокОбъект.ДокументОснование, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, ПерезаполнятьЭТРН));
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолностьюОбновитьПредставлениеДанных()

	//УстановитьТипыЗначенийРеквизитов(); // TODO
	
	ОповеститьОбИзменении(Объект.ДокументСВ);
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	
	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

// УПРАВЛЕНИЕ ВИДИМОСТЬЮ И ДОСТУПНОСТЬЮ
&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	УстановитьПоложениеСохраняемыхЭлементов();

	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	ЭтоВыгрузка = МассивТиповГдеЕстьВыгрузка().Найти(Объект.ТипТитула) <> Неопределено;
	ЭтоПогрузка = МассивТиповГдеЕстьПогрузка().Найти(Объект.ТипТитула) <> Неопределено;
	
	Элементы.ГруппаДатаПогрузки.Видимость 	= ЭтоПогрузка;
	Элементы.КонтейнерыДатВрВозврКонт.Видимость = ЭтоПогрузка;
	
	Элементы.ГруппаДатаВыгрузки.Видимость 	= ЭтоВыгрузка;
	Элементы.МестоВыгрузки.Видимость 		= ЭтоВыгрузка;
	Элементы.ГруппаОГрузе.Видимость 		= ЭтоВыгрузка;
	
КонецПроцедуры

&НаКлиенте
Функция МассивТиповГдеЕстьВыгрузка()

	текМассив = Новый Массив;
	текМассив.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул6"));
	
	Возврат текМассив;
	
КонецФункции

&НаКлиенте
Функция МассивТиповГдеЕстьПогрузка()

	
	текМассив = Новый Массив;
	текМассив.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул8"));
	
	Возврат текМассив;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПоложениеСохраняемыхЭлементов()
	
	УстановитьПоложениеШапки();

КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормыВЗависимостиОтСтатуса()
	
	СтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	Если СтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик 
		Или (СтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка И ЗначениеЗаполнено(Объект.ДокументСВ.УИД)) Тогда
		
		ТолькоПросмотр = Ложь;
		Элементы.ГруппаИсправление.Видимость = Объект.НомИспр > 0;
		Если Элементы.Найти("ВнестиИсправлениеТитула") <> Неопределено Тогда
			Элементы.ВнестиИсправлениеТитула.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		ТолькоПросмотр = Истина;
		Элементы.ГруппаИсправление.Видимость = Истина;
		Если Элементы.Найти("ВнестиИсправлениеТитула") <> Неопределено Тогда
			Элементы.ВнестиИсправлениеТитула.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура СвернутьШапку(Команда)
	
	ШапкаНаОтдельнойЗакладке = Истина;
	УстановитьПоложениеШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьШапку(Команда)
	
	ШапкаНаОтдельнойЗакладке = Ложь;
	УстановитьПоложениеШапки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеШапки()
	
	Если ШапкаНаОтдельнойЗакладке Тогда
		
		текАктивнаяЗакладка = Элементы.Страницы.ТекущаяСтраница;
		
		ПереместитьШапкуВызовСервера();
		//Элементы.Переместить(Элементы.ГруппаШапкаЛево, Элементы.СтраницаШапка);
		Элементы.СвернутьШапку.Видимость = Ложь;
		Элементы.РазвернутьШапку.Видимость = Истина;
		
		ПанельОшибокРазвернута = Элементы.ПанельОшибок.РастягиватьПоВертикали;
		Если Не ПанельОшибокРазвернута Тогда 
			ПанельОшибокСвернутьРазвернутьВызовОМ();
		КонецЕсли;
		                                             
		Элементы.Страницы.ТекущаяСтраница = текАктивнаяЗакладка;
		
	Иначе
		
		ПереместитьШапкуВызовСервера();
		//Элементы.Переместить(Элементы.ГруппаШапкаЛево, Элементы.ГруппаШапкаМестоположение);
		Элементы.СвернутьШапку.Видимость = Истина;
		Элементы.РазвернутьШапку.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПереместитьШапкуВызовСервера()
	
	Если ШапкаНаОтдельнойЗакладке Тогда
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма, Элементы.ГруппаШапкаДанные, Элементы.СтраницаШапка);
	Иначе
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма, Элементы.ГруппаШапкаДанные, Элементы.ГруппаШапкаМестоположение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)
	
	ОбработчикПеречитатьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ПолностьюОбновитьПредставлениеДанных();
	ОбновитьДанныеФормы();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
	УправлениеВидимостьюИДоступностью(); 	// доступность команд
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_СВ_ТитулГП.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции

// Обслуживание панели ошибок

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()
	
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокРежимПриИзменении(Элемент)
	КонтурЛогистика_ПанельОшибокКлиент.ПриИзмененииРежимаПанелиОшибок(Элементы.ТаблицаОшибок, ПанельОшибокРежимТекущейСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокРежимТекущейСтрокиПриИзменении(Элемент)
	КонтурЛогистика_ПанельОшибокКлиент.ПриИзмененииРежимаПанелиОшибок(Элементы.ТаблицаОшибок, ПанельОшибокРежимТекущейСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДокументСВНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Объект.ДокументСВ);
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
												"Документ.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ФормаОбъекта",
												ПараметрыФормы,
												ЭтаФорма,
												ЭтаФорма,
												"ОбработчикПерепроверить")
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()

	Представления = ПолучитьПредставлениеРеквизитовДокументаОснования(Объект.ДокументОснование, Объект);	
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл 
		
		Значение = Неопределено;
		
		Если  Представления.Свойство("ДокУчСист_" + Эл.Ключ, Значение) Тогда 
			текВыражение = "ДокУчСист_" + Эл.Ключ  + " = Значение";
			Выполнить (текВыражение);
			
			
			// определим доступность команды сопоставления
			ИмяЭлементаЛогистика = Эл.Значение; // сконвертированного
			ИмяЭлементаНадписиСопоставить = "ДокУчСист_" + Эл.Ключ + "_Сопоставить";
			
			Если ЗначениеЗаполнено(ИмяЭлементаЛогистика) И ЗначениеЗаполнено(Этаформа["ДокУчСист_" + Эл.Ключ]) Тогда // если этот элемент выведен на форму и он рассчитан из документа уч сист
				
				Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
					
					ПутьПроверкиДанных = Элементы.Найти(ИмяЭлементаЛогистика).ПутьКДанным;
					ЗначениеВРеквизите = Вычислить(ПутьПроверкиДанных);
					НужноСопоставить = Не ЗначениеЗаполнено(ЗначениеВРеквизите);
					
				Иначе
					
					НужноСопоставить = Ложь;
					
				КонецЕсли;
				
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость = НЕ НужноСопоставить;
				Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = НужноСопоставить;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРеквизитовДокументаОснования(ДокументОснование, Знач ДокументТитулОбъект)
	
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	СтруктураПредставлений = Новый Структура;
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл 
		СтруктураПредставлений.Вставить("ДокУчСист_" + Эл);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда 
		
		НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, ДокументОснование);
		
		Если НастройкаКонвертации <> Неопределено Тогда
			
			Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл 
				
				Если Эл.Ключ = "МестоПогрузки" Тогда 
					НастройкаКонвертацииРеквизита = НастройкаКонвертации.ПравилаКонвертацииТитулаРеквизиты.Найти(Эл.Ключ, "РеквизитТитула");
				Иначе
					НастройкаКонвертацииРеквизита = НастройкаКонвертации.ПравилаКонвертацииГлавногоДокумента.Найти(Эл.Ключ, "РеквизитТитула");
				КонецЕсли;
				
				РезультатВычисления = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьРеквизитОснования(
											ДокументОснование,
											НастройкаКонвертацииРеквизита,
											НастройкаКонвертации,
											ДокументТитулОбъект,
											Ложь);
				
				Если РезультатВычисления.Успешно Тогда 
					СтруктураПредставлений.Вставить("ДокУчСист_" + Эл.Ключ, 	РезультатВычисления.Значение);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		 
	КонецЕсли;
	
	Возврат СтруктураПредставлений;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()
	
	Перем МассивКонвертируемыхРеквизитов;
	
	МассивКонвертируемыхРеквизитов = Новый Соответствие;
	МассивКонвертируемыхРеквизитов.Вставить("Грузоотправитель"				, "ДокументСВГрузоотправитель");
	МассивКонвертируемыхРеквизитов.Вставить("Перевозчик"					, "ДокументСВПеревозчик");
	МассивКонвертируемыхРеквизитов.Вставить("Грузополучатель"				, "ДокументСВГрузополучатель");
	МассивКонвертируемыхРеквизитов.Вставить("МестоПогрузки"					, "ДокументСВМестоПогрузки");
	
	Возврат МассивКонвертируемыхРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДокУчСист_Реквизит_СопоставитьНажатие(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	ОбъектДокУчСистПуть = "ЭтаФорма." + СтрЗаменить(ИмяЭлемента, "_Сопоставить", "");
	ЗначениеОбъектДокУчСист = Вычислить(ОбъектДокУчСистПуть);
	
	ОткрытьФормуПодбораСущностиЛогистика(ЗначениеОбъектДокУчСист, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)
	
	ПараметрыФормыПоиска = Новый Структура;
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);
	
	Если Элемент.Имя = "ДокУчСист_Грузоотправитель_Сопоставить"
		ИЛИ Элемент.Имя = "ДокУчСист_Перевозчик_Сопоставить"
		ИЛИ Элемент.Имя = "ДокУчСист_Грузополучатель_Сопоставить"
		Тогда 
		
		ИмяСущности = "КонтурЛогистика_ОрганизацииДиадок";
		
	ИначеЕсли Элемент.Имя = "ДокУчСист_МестоПогрузки_Сопоставить"
		ИЛИ Элемент.Имя = "ДокУчСист_МестоДоставки_Сопоставить"
		Тогда
		
		ИмяСущности = "КонтурЛогистика_ПунктыМаршрута";
		
	Иначе
		
		ВызватьИсключение "не реализовано";
		
	КонецЕсли;
	
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник." + ИмяСущности + ".ФормаВыбора",
			ПараметрыФормыПоиска,
			ЭтаФорма,
			ЭтаФорма,
			"ОбработчикВыбораСопоставленияРеквизитаДокумента",
			ПараметрыОбработчика);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСопоставленияРеквизитаДокумента(ВыбранноеЗначение, ДопПараметры) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда 
		
		// Выполнить переконвертацию или присваивание
		ПовторноСконвертироватьРеквизит(ДопПараметры.ИмяЭлементаФормы);
		
		ПолностьюОбновитьПредставлениеДанных();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПовторноСконвертироватьРеквизит(ИмяЭлементаФормы)
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	ПерезаполнитьЭТРН = Ложь;
	
	ИмяРеквизита = СтрЗаменить(ИмяЭлементаФормы, "ДокУчСист_", "");
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "_Сопоставить", "");
	
	// надо понять, требуется ли переконвертировать ЭТРН или надо конвертнуть только титул	
	СоотвРеквизита = СоответствиеКонвертируемыхРеквизитовИзДокУчСист().Получить(ИмяРеквизита);
	Если СоотвРеквизита <> Неопределено Тогда 
		Если Найти(СоотвРеквизита, "ДокументСВ") Тогда 
			ПерезаполнитьЭТРН = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура("ДокументОснование, ТипЛогистика, ПерезаполнитьГлавныйДокументЕслиСуществует", Объект.ДокументОснование, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, ПерезаполнитьЭТРН);
	ДокОбъект.Заполнить(ДанныеЗаполнения);
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭТРН()
	
	ДокЭТРН = Объект.ДокументСВ;
	Если ЗначениеЗаполнено(ДокЭТРН) Тогда 
		ДокЭТРНОбъект = ДокЭТРН.ПолучитьОбъект();
		ДокЭТРНОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		И ЗначениеЗаполнено(Объект.ДокументОснование)
		И (ЗавершениеРаботы = Неопределено Или Не ЗавершениеРаботы)Тогда
		
		УдалитьЭТРН();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоПогрузкиПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДатаТСПрибПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВрТСПрибПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ФактДатаПогрПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВрФактДатаПогрПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДатаТСУбытПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВрДатаТСУбытПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура КолМестПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура МасГрузБруттоПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура МасГрузНеттоПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПаллетПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДатВрСдГрКонтПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВрСдГрКонтПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДатВрВозврКонтПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВрВозврКонтПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры
