
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		// TODO
		//ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		//ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);

	КонецЕсли;
	
	НайденныйТ3 = НайтиТ3сУчетомВозвратнойЦепочки();
	
	ПринятьЧастично = ЗначениеЗаполнено(НайденныйТ3) И НайденныйТ3.ПринятьЧастично;
	ОтказВПриемке 	= ЗначениеЗаполнено(НайденныйТ3) И НайденныйТ3.ОтказВПриемке;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ТрН_Титул4_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
		
КонецПроцедуры

Функция НайтиТ3сУчетомВозвратнойЦепочки()
	
	НайденныйТ3 = Документы.КонтурЛогистика_ТрН_Титул3.ПустаяСсылка();
	
	Если Этотобъект.ЭтоПриемВозврата Тогда
		НайденныйТ3 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ3Возвратную(ДокументЭТРН);
	Иначе
		НайденныйТ3 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ3Основную(ДокументЭТРН);
	КонецЕсли;
	
	Возврат НайденныйТ3;
	
КонецФункции

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументЭТРН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлу(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументЭТРН) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти Документ ЭТРН, создание не выполнено");
		
	Иначе
		
		ДокументЭТРН = НайденныйДокументЭТРН;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
		
		// Комментарий - нет в формате минтранса // TODO есть в Диадоке - научиться доставать из ДД 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ 		= КС.XDTO_Вычислить(XDTO, "Документ");
	СодПрвВыд 		= КС.XDTO_Вычислить(XDTO, "Документ.СодПрвВыд");
	ОтметПрв 		= КС.XDTO_Вычислить(СодПрвВыд, "ОтметПрвВыд");
	
	ДатИнфПрвВыд 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатИнфПрвВыд"));
	ВрИнфПрвВыд 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрИнфПрвВыд"));
	
	ДатФайлИнфГП 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфГП.ДатФайлИнфГП"));
	ВрФайлИнфГП 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфГП.ВрФайлИнфГП"));
	ИдФайлИнфГП 	= КС.XDTO_Вычислить(Документ, "ИдИнфГП.ИдФайлИнфГП");
	
	Если ЗначениеЗаполнено(ИдФайлИнфГП) Тогда
		НомерДатаИсправления = КонтурЛогистика_ОбработкаДокументовСервер.НомерДатаИсправленияПоИмениФайла(ИдФайлИнфГП);
		НомИспрГП = НомерДатаИсправления.НомИспр;
		ДатаИспрГП = НомерДатаИсправления.ДатаИспр;
	КонецЕсли;
	
	ЭПГП = КС.XDTO_Вычислить(Документ, "ИдИнфГП.ЭП");
	
	СтатПодп_raw = КС.XDTO_Вычислить(Документ, "Подписант.СтатПодп");
	СтатПодп = Перечисления.КонтурЛогистика_СтатусыПодписанта.ЗначениеИзXDTO(СтатПодп_raw);
	
	Должность = КС.XDTO_Вычислить(Документ, "Подписант.Должн");
	Фамилия = КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Фамилия");
	Имя = КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Имя");
	Отчество = КС.XDTO_Вычислить(Документ, "Подписант.ФИО.Отчество");
	
	ЕстьЗамечанияПеревозчика = КонтурЛогистика_ОбработкаДокументовСервер.ЕстьЗамечанияПеревозчикаXDTO(СодПрвВыд, Ложь);
	ЕстьОтметкиПеревозчика	 = КонтурЛогистика_ОбработкаДокументовСервер.ЕстьОтметкиПеревозчикаXDTO(ОтметПрв);
	
	Если ЕстьЗамечанияПеревозчика Тогда 
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьЗамечанияПеревозчикаXDTO(СодПрвВыд, ЭтотОбъект, Ложь);
	КонецЕсли;
	
	Если ЕстьОтметкиПеревозчика Тогда 
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьОтметкиПеревозчикаXDTO(ОтметПрв, ЭтотОбъект);
	КонецЕсли;
		
	КонтурЛогистика_КонструкторыXDTO.ЗаполнитьИнфПолИзXDTO(СодПрвВыд, ЭтотОбъект, "ИнфПол");
	
КонецПроцедуры

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	Если ДанныеЗаполнения.Свойство("СпецСценарий") Тогда
		СпецСценарий = ДанныеЗаполнения.СпецСценарий;
	Иначе
		СпецСценарий = Неопределено;
	КонецЕсли;
	
	НайденныйДокУчСист = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДокументУчетнойСистемыДляСледующегоТитула(ПредыдущийТитул, СпецСценарий);
	
	Если ЗначениеЗаполнено(НайденныйДокУчСист) Тогда
		ДокументОснование = НайденныйДокУчСист;
	КонецЕсли;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		ДанныеЗаполнения.ТипЛогистика,, СпецСценарий);
	
	ДокументЭТРН = ПредыдущийТитул.ДокументЭТРН;
	
	ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
	
	ОтметкиПеревозчика.Очистить();
	Акты.Очистить();
	Штрафы.Очистить();
	ИнфПол.Очистить();
	ЗамечанияИнфПол.Очистить();
	ОтметкиИнфПол.Очистить();
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		
		ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации);

	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул, Знач ВходящийФайлТитула3 = Неопределено) Экспорт
	
	Перем ДвоичныеДанныеПодписи, ФайлТитула3;
	
	Если ВходящийФайлТитула3 = Неопределено Тогда
		ФайлТитула3 = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ПредыдущийТитул);
	Иначе
		ФайлТитула3 = ВходящийФайлТитула3;
	КонецЕсли;
	
	ИдФайлИнфГП 	= СтрЗаменить(ФайлТитула3.ИмяФайла, ".xml", "");
	ДатФайлИнфГП 	= ПредыдущийТитул.ДатИнфГП;
	ВрФайлИнфГП  	= ПредыдущийТитул.ВрИнфГП;
	НомИспрГП	  	= ПредыдущийТитул.НомИспр;
	ДатаИспрГП  	= ПредыдущийТитул.ДатаИспр;
	ДвоичныеДанныеПодписи = ФайлТитула3.Подпись.Получить();
	ЭПГП 				= Base64Строка(ДвоичныеДанныеПодписи);

	ПринятьЧастично 				= ПредыдущийТитул.ПринятьЧастично;
	ОтказВПриемке 					= ПредыдущийТитул.ОтказВПриемке;
	ЭтоПриемВозврата 				= ПредыдущийТитул.ЭтоПриемВозврата;
	Грузополучатель 				= ПредыдущийТитул.Грузополучатель;
	ГрузополучательПодразделение 	= ПредыдущийТитул.ГрузополучательПодразделение;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт 
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ДокументЭТРН.Перевозчик,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации)

	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		//Заполнить ЭтотТитул
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ТрН_Титул4.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ДатИнфПрвВыд = ТекущаяДатаСеанса();
		ВрИнфПрвВыд = ТекущаяДатаСеанса();
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфПрвВыд, ВрИнфПрвВыд);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфПрвВыд и ВрИнфПрвВыд
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 4;
	Формат = "5.01";
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	ДополнительныеПолучателиФайлаОбмена = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДопПолучателейФайла(ДокументЭТРН);
	
	Если ДополнительныеПолучателиФайлаОбмена.Количество() > 0 Тогда 
		W = 1;
	Иначе
		W = 0;
	КонецЕсли;
	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайлаОбмена); 	
	
	Если ЗначениеЗаполнено(Грузополучатель) Тогда 
		текГП = Грузополучатель;
	Иначе
		текГП = ДокументЭТРН.Грузополучатель;
	КонецЕсли;
	
	Если ДокументЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку И ЗначениеЗаполнено(ДокументЭТРН.ПогрузкуОсуществляет) Тогда 
		ИстинныйГрузоотправитель = ДокументЭТРН.ПогрузкуОсуществляет;
	Иначе
		ИстинныйГрузоотправитель = ДокументЭТРН.Грузоотправитель;
	КонецЕсли;
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаТРН(НомерТитула, 
												ИстинныйГрузоотправитель,
												ДокументЭТРН.Перевозчик,
												текГП,
												GUID,
												W); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументЭТРН.Перевозчик, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_Подписант(НомерТитула, , Формат, ПодписантСтруктура);
	КС.XDTO_Подписант_СформироватьСведенияМЧД(НомерТитула, XDTO_Подписант, ПодписантСтруктура, Результат);
	
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, , Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
	
	XDTO_СодПрвВыд = КС.XDTO_СодПрвВыд(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодПрвВыд", XDTO_СодПрвВыд);
	
	XDTO_ИдИнфГП 		= КС.XDTO_ИдИнфГП(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфГП", XDTO_ИдИнфГП);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		
		НайденныйТ3 = НайтиТ3сУчетомВозвратнойЦепочки();
		
		ПринятьЧастично = ЗначениеЗаполнено(НайденныйТ3) И НайденныйТ3.ПринятьЧастично;
		ОтказВПриемке = ЗначениеЗаполнено(НайденныйТ3) И НайденныйТ3.ОтказВПриемке;
		ЭтоПриемВозврата = ЗначениеЗаполнено(НайденныйТ3) И НайденныйТ3.ЭтоПриемВозврата;
		
		Если НомИспрГП <> 0 Тогда
			// Пометим на удаление предыдущий титул
			ФалыйДляУдаления = Новый Массив;
			
			Титулы4 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитулыГлавногоПоТипу(
				Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4, ДокументЭТРН);
			Для Каждого ТекущийТитул Из Титулы4 Цикл
				ФайлТитула = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ТекущийТитул);
				
				Если ЗначениеЗаполнено(ФайлТитула) Тогда
					ФалыйДляУдаления.Добавить(ФайлТитула);
				КонецЕсли;
			КонецЦикла;
			
			КонтурЛогистика_ОбработкаДокументовСервер.УдалитьФайлыИСвязныеОбъекты(ФалыйДляУдаления);
		КонецЕсли;
		
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ТрН_Титул4_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

#КонецЕсли