///////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции:
// - для вызова методов интеграционной обработки;
// - для обработки форм документов, загружаемых из Mobile Smarts;
// - прочее.
///////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Перем ПередаваемыеПараметры Экспорт;

// Вызывает метод интеграционной обработки и возвращает флаг успешности его выполнения
//
// Параметры:
//	ИмяМетода - Строка - имя вызываемого метода		
//	СтруктураПараметров - Структура, Неопределено - содержит параметры вызываемого метода
//	Результат - Произвольный - результат выполнения вызываемого метода
//	ОписаниеОшибки - Строка - описание ошибки при выполнении вызываемого метода
//
// Возвращаемое значение:
//	Булево
&НаСервере
Функция ВызватьМетодИнтеграционнойОбработки(ИмяМетода,СтруктураПараметров=Неопределено,Результат=Неопределено,ОписаниеОшибки = "") Экспорт
	
	Попытка
		//Выполнить("Результат = пОбработка."+ИмяМетода+?(СтруктураПараметров = Неопределено,"()","(СтруктураПараметров)"));
	Исключение
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции

// Вызывает процедуру формы интеграционной обработки (замена конструкции "Выполнить" при вызове обработчика после открытия формы документа в ОО)
//
// Параметры:
//	ИмяПроцедуры - Строка - имя вызываемой процедуры
//	СтруктураПараметров - Структура, Неопределено - содержит параметры вызываемого метода
//
// Возвращаемое значение:
//	Структура - результат выполнения процедуры:
//		* ИнфоОбОшибке - ИнформацияОбОшибке - информация об ошибке
//		* ТекстОшибки - Строка - подробное представление об ошибке
//
&НаКлиенте
Функция ВыполнитьОбработчик_ПослеОткрытияФормыДокумента(ИмяПроцедуры, СтруктураПараметров) Экспорт
	
	ИнфоОбОшибке 	= Неопределено;
	ТекстОшибки 	= "";
	
	ПередаваемыеПараметры = СтруктураПараметров;
	
	Попытка
		ПодключитьОбработчикОжидания(ИмяПроцедуры, 0.1, Истина);
	Исключение
		ИнфоОбОшибке 	= ИнформацияОбОшибке();
		ТекстОшибки 	= ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
	КонецПопытки;
	
	СтруктураВыполнения = Новый Структура;
	СтруктураВыполнения.Вставить("ИнфоОбОшибке", 	ИнфоОбОшибке);
	СтруктураВыполнения.Вставить("ТекстОшибки", 	ТекстОшибки);
	
	Возврат СтруктураВыполнения;
	
КонецФункции

#Область Обработчики_ПослеОткрытияФормыДокумента

// Используется для обработки данных и настройки элементов формы документа, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_Общий_ПослеОткрытияФормыДокумента						(СтруктураПараметров) Экспорт

	Форма 				= СтруктураПараметров.ФормаДокумента;
	СсылкаНаДокумент 	= СтруктураПараметров.СсылкаНаДокумент;		
	ТипДокументаСтрокой = ПолучитьИмяТипаДокумента(СсылкаНаДокумент);		
	
	МассивИменТабличныхЧастейТовары = ПолучитьМассивИменТабличныхЧастейТовары(Форма.Объект, ТипДокументаСтрокой);															
	
	МассивНоменклатуры	= Новый Массив;			
	Для каждого ИмяТабличнойЧасти Из МассивИменТабличныхЧастейТовары Цикл		
		// т.к. в табличной части может не оказаться реквизита "Номенклатура", то ставим попытку и переходим к следующей ТЧ						
		Попытка
			Для каждого Стр Из Форма.Объект[ИмяТабличнойЧасти] Цикл											
				Если МассивНоменклатуры.Найти(Стр.Номенклатура) = Неопределено Тогда
					МассивНоменклатуры.Добавить(Стр.Номенклатура);
				КонецЕсли;	
			КонецЦикла;		
		Исключение
			Продолжить;
		КонецПопытки; 
	КонецЦикла; 
	
	СписокИменРеквизитов = Новый СписокЗначений;
	СписокИменРеквизитов.Добавить("ВидНоменклатуры.ИспользоватьХарактеристики", "ХарактеристикиИспользуются");
	СписокИменРеквизитов.Добавить("ВестиУчетПоГТД", 							"ВедетсяУчетПоГТД");
	СписокИменРеквизитов.Добавить("ТипНоменклатуры",							"ТипНоменклатуры");			
	
	СоответствиеСсылокИРеквизитовНоменклатуры = ПолучитьЗначенияРеквизитовМассиваОбъектов("Номенклатура", МассивНоменклатуры, СписокИменРеквизитов);
	
	Для каждого ИмяТабличнойЧасти Из МассивИменТабличныхЧастейТовары Цикл					
		Для каждого Стр Из Форма.Объект[ИмяТабличнойЧасти] Цикл
			Если СоответствиеСсылокИРеквизитовНоменклатуры[Стр.Номенклатура] <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Стр, СоответствиеСсылокИРеквизитовНоменклатуры[Стр.Номенклатура]);
			КонецЕсли;
		КонецЦикла;									
	КонецЦикла; 
		
	ДокументОбъект = Форма.Объект;
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(ДокументОбъект);
	
	//Не в каждом документе используются серии, по этому ставим попытку	
	Попытка
		ПараметрыУказанияСерий = УТ_11_2_ПодготовитьЗаполнитьУстановитьВидимостьСерий(ДокументОбъект, ТипДокументаСтрокой);					
			
		УТ_11_2_УстановитьВидимостьЭлементовСерий(ДокументОбъект, Форма.Элементы, ПараметрыУказанияСерий, ТипДокументаСтрокой);
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
	
	Попытка
		КопироватьДанныеФормы(ДокументОбъект, Форма.Объект);				
	Исключение
	КонецПопытки;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(ФормаОбъект, ИмяТЧ = "Товары")
	
	Если НЕ ФормаОбъект.Свойство(ИмяТЧ) Тогда Возврат; КонецЕсли;
	
	Если НЕ ФормаОбъект[ИмяТЧ].Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ГуидХарактеристикиИспользуются = Новый УникальныйИдентификатор();
	ГуидТипНоменклатуры			   = Новый УникальныйИдентификатор();
	ГуидАртикул					   = Новый УникальныйИдентификатор();
	СтруктураДляПроверки = Новый Структура("ХарактеристикиИспользуются, ТипНоменклатуры, Артикул", ГуидХарактеристикиИспользуются, ГуидТипНоменклатуры, ГуидАртикул);
			
	ЗаполнитьЗначенияСвойств(СтруктураДляПроверки, ФормаОбъект[ИмяТЧ][0]);
		
	ЕстьРеквизитХарактеристикиИспользуются 	= СтруктураДляПроверки["ХарактеристикиИспользуются"] <> ГуидХарактеристикиИспользуются;
	ЕстьРеквизитТипНоменклатуры				= СтруктураДляПроверки["ТипНоменклатуры"] 			 <> ГуидТипНоменклатуры;
	ЕстьРеквизитАртикул						= СтруктураДляПроверки["Артикул"] 					 <> ГуидАртикул;
	
	ПараметрыЗаполненияРеквизитов = Новый Структура;
	
	Если ЕстьРеквизитХарактеристикиИспользуются Тогда
		ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
											Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	КонецЕсли;											
	Если ЕстьРеквизитТипНоменклатуры Тогда										
		ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
											Новый Структура("Номенклатура", "ТипНоменклатуры"));
	КонецЕсли;										
	Если ЕстьРеквизитАртикул Тогда
		ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакАртикул",
											Новый Структура("Номенклатура", "Артикул"));
	КонецЕсли;
	
	ОбщегоНазначения.ОбщийМодуль("НоменклатураСервер").ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(ФормаОбъект[ИмяТЧ], ПараметрыЗаполненияРеквизитов);
	
КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ПоступлениеТоваровУслуг, загруженного из базы Mobile Smarts.
//
&НаКлиенте
Процедура УТ_11_2_ПоступлениеТоваровУслуг_ПослеОткрытияФормыДокумента	() Экспорт

	ИмяСобытия = "УТ_11_2_ПоступлениеТоваровУслуг_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);	
		
		Форма 		   = СтруктураПараметров.ФормаДокумента;
		ДокументОбъект = Форма.Объект;
		ЭлементыФормы  = Форма.Элементы;
		
		УТ_11_4_УстановитьДоступностьСоглашений(ДокументОбъект, ЭлементыФормы);
		УТ_11_4_УстановитьДоступностьДоговора(ДокументОбъект, ЭлементыФормы.Договор.Доступность, ЭлементыФормы.Договор.Видимость, ДокументОбъект.Договор);
		
		Попытка
			Форма.СуммаВсего = Форма.Объект.Товары.Итог("СуммаСНДС");
		Исключение
		КонецПопытки;		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ЗаказПоставщику, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте 
Процедура УТ_11_2_ЗаказПоставщику_ПослеОткрытияФормыДокумента			() Экспорт
	
	ИмяСобытия = "УТ_11_2_ЗаказПоставщику_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма = СтруктураПараметров.ФормаДокумента;
		ЭлементыФормы  = Форма.Элементы;
		ДокументОбъект = Форма.Объект;
		
		УТ_11_4_УстановитьДоступностьСоглашений(ДокументОбъект, ЭлементыФормы);
		УТ_11_4_УстановитьДоступностьДоговора(ДокументОбъект, ЭлементыФормы.Договор.Доступность, ЭлементыФормы.Договор.Видимость, ДокументОбъект.Договор);	
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры	

// Используется для обработки данных и настройки элементов формы документа ПересчетТоваров, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_ПересчетТоваров_ПослеОткрытияФормыДокумента			() Экспорт
	
	ИмяСобытия = "УТ_11_2_ПересчетТоваров_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма = СтруктураПараметров.ФормаДокумента;
		
		тчТовары = Форма.Объект.Товары;
		
		// **************************************************************************************								
		
		МассивНоменклатуры	= Новый Массив;			
		Для каждого Стр Из тчТовары Цикл
			Если МассивНоменклатуры.Найти(Стр.Номенклатура) = Неопределено Тогда
				МассивНоменклатуры.Добавить(Стр.Номенклатура);
			КонецЕсли;	
		КонецЦикла;
		
		СписокИменРеквизитов = Новый СписокЗначений;		
		СписокИменРеквизитов.Добавить("Артикул", "Артикул");
		СписокИменРеквизитов.Добавить("ТипНоменклатуры", "ТипНоменклатуры");
		
		СоответствиеСсылокИРеквизитовНоменклатуры = ПолучитьЗначенияРеквизитовМассиваОбъектов("Номенклатура", МассивНоменклатуры, СписокИменРеквизитов);				
		
		// **************************************************************************************							
		
		МассивУпаковок	= Новый Массив;			
		Для каждого Стр Из тчТовары Цикл
			Если МассивУпаковок.Найти(Стр.Упаковка) = Неопределено Тогда
				МассивУпаковок.Добавить(Стр.Упаковка);
			КонецЕсли;	
		КонецЦикла;
		
		СписокИменРеквизитов = Новый СписокЗначений;
		СписокИменРеквизитов.Добавить("ТипИзмеряемойВеличины", "ТипИзмеряемойВеличины");			
		
		СоответствиеСсылокИРеквизитовУпаковок = ПолучитьЗначенияРеквизитовМассиваОбъектов("УпаковкиЕдиницыИзмерения", МассивУпаковок, СписокИменРеквизитов);								
		
		// **************************************************************************************
		
		Для Каждого СтрТабл из тчТовары Цикл
			
			СтрТабл.Расхождение = СтрТабл.КоличествоФакт <> СтрТабл.Количество Или СтрТабл.КоличествоУпаковок <> СтрТабл.КоличествоУпаковокФакт;
			СтрТабл.КоличествоУпаковокОтклонение = СтрТабл.КоличествоУпаковокФакт - СтрТабл.КоличествоУпаковок;
			
			СтрТабл.ТипНоменклатуры = СоответствиеСсылокИРеквизитовНоменклатуры[СтрТабл.Номенклатура].ТипНоменклатуры;
			СтрТабл.Артикул 		= СоответствиеСсылокИРеквизитовНоменклатуры[СтрТабл.Номенклатура].Артикул;					
			
			Если ЗначениеЗаполнено(СтрТабл.Упаковка) Тогда
				СтрТабл.ТипИзмеряемойВеличины = СоответствиеСсылокИРеквизитовУпаковок[СтрТабл.Упаковка].ТипИзмеряемойВеличины;
			КонецЕсли; 
			
		КонецЦикла;	
		
		// Для корректного отображения колонки "Серия"
		Форма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад", Форма.Объект.Склад));
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ЗаказКлиента, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_ЗаказКлиента_ПослеОткрытияФормыДокумента				() Экспорт 
	
	ИмяСобытия = "УТ_11_2_ЗаказКлиента_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);	
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ЗаказНаСборку, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_ЗаказНаСборку_ПослеОткрытияФормыДокумента				() Экспорт
	
	ИмяСобытия = "УТ_11_2_ЗаказНаСборку_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);	
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ЧекККМ, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_ЧекККМ_ПослеОткрытияФормыДокумента					() Экспорт
	
	ИмяСобытия = "УТ_11_2_ЧекККМ_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);	
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа СписаниеНедостачТоваров, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_СписаниеНедостачТоваров_ПослеОткрытияФормыДокумента	() Экспорт
	
	ИмяСобытия = "УТ_11_2_СписаниеНедостачТоваров_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);	
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ВозвратТоваровПоставщику, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_ВозвратТоваровПоставщику_ПослеОткрытияФормыДокумента	() Экспорт
	
	ИмяСобытия = "УТ_11_2_ВозвратТоваровПоставщику_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		СуммаТоваров = ?(СтруктураПараметров.ФормаДокумента.Объект.ПредусмотренЗалогЗаТару ИЛИ Не СтруктураПараметров.ФормаДокумента.Объект.ВозвратПринятойМногооборотнойТары,
		СтруктураПараметров.ФормаДокумента.Объект.Товары.Итог("СуммаСНДС"),
		СтруктураПараметров.ФормаДокумента.Объект.Товары.Итог("СуммаСНДСБезВозвратнойТары"));
		
		Попытка
			//Выполнить("ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(СтруктураПараметров.ФормаДокумента.Объект, СуммаТоваров)");
			ОбщегоНазначенияКлиент.ОбщийМодуль("ФинансыКлиентСервер").ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(СтруктураПараметров.ФормаДокумента.Объект, СуммаТоваров);
		Исключение
			Сообщить("Не удалось пересчитать суммы в строке расшифровки платежа. Причина: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ПеремещениеТоваров, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_ПеремещениеТоваров_ПослеОткрытияФормыДокумента		() Экспорт
	
	ИмяСобытия = "УТ_11_2_ПеремещениеТоваров_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);	
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа УпаковочныйЛист, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_УпаковочныйЛист_ПослеОткрытияФормыДокумента			() Экспорт
	
	ИмяСобытия = "УТ_11_2_УпаковочныйЛист_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);	
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа АктПереоценки, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_АктПереоценки_ПослеОткрытияФормыДокумента				() Экспорт
	
	ИмяСобытия = "УТ_11_2_АктПереоценки_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		//Для каждого ВидЦен ИЗ СтруктураПараметров.ФормаДокумента.ВыбранныеЦены цикл
		//	ВидЦен.Выбрана = Истина;
		//КонецЦикла;
		
		Форма 			= СтруктураПараметров.ФормаДокумента;
		ДокументОбъект 	= Форма.Объект;
		
		//ОбщегоНазначенияКлиент.ОбщийМодуль("УстановкаЦенСервер").ПереформироватьТаблицуЦен(СтруктураПараметров.ФормаДокумента, Истина);

		КэшированныеЗначения = Неопределено;
		Для Каждого СтрокаДокумента ИЗ ДокументОбъект.Товары Цикл	
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", 	СтрокаДокумента.Характеристика);
			СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", СтрокаДокумента.Упаковка);
			
			Попытка
				ОбщегоНазначенияКлиент.ОбщийМодуль("ОбработкаТабличнойЧастиКлиент").ОбработатьСтрокуТЧ(СтрокаДокумента, СтруктураДействий, КэшированныеЗначения);
			Исключение
				ОбщегоНазначенияКлиент.ОбщийМодуль("ОбработкаТабличнойЧастиТоварыКлиент").ПриИзмененииРеквизитовВТЧКлиент(ДокументОбъект.Товары, СтрокаДокумента, СтруктураДействий, Неопределено);
			КонецПопытки;
		КонецЦикла;
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа РеализацияТоваровУслуг, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_РеализацияТоваровУслуг_ПослеОткрытияФормыДокумента	() Экспорт
	
	ИмяСобытия = "УТ_11_2_РеализацияТоваровУслуг_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма = СтруктураПараметров.ФормаДокумента;
		ЭлементыФормы  = Форма.Элементы;
		ДокументОбъект = Форма.Объект;
		
		УТ_11_2_РеализацияТоваровУслуг_УстановитьВидимостьЭлементовДоставки(ЭлементыФормы, ДокументОбъект);
		
		Попытка
			Форма.НадписьЭтапыОплаты = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭтапыОплатыКлиентСервер").НадписьЭтапыОплаты(Форма);
			Форма.СуммаВсего = Форма.Объект.Товары.Итог("СуммаСНДС");
		Исключение
		КонецПопытки;
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ПриходныйОрдерНаТовары, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_ПриходныйОрдерНаТовары_ПослеОткрытияФормыДокумента	() Экспорт
	
	ИмяСобытия = "УТ_11_2_ПриходныйОрдерНаТовары_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;
	
	Попытка	
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма 			= СтруктураПараметров.ФормаДокумента;
		ДокументОбъект 	= Форма.Объект;
		
		ИспользоватьСкладскиеПомещения 				= ПолучитьЗначениеРеквизитаОбъекта(ДокументОбъект.Склад, "ИспользоватьСкладскиеПомещения");
		ДатаНачалаИспользованияСкладскихПомещений 	= ПолучитьЗначениеРеквизитаОбъекта(ДокументОбъект.Склад, "ДатаНачалаИспользованияСкладскихПомещений");
		
		ДатаПроверки = ?(ЗначениеЗаполнено(ДокументОбъект.Дата), ДокументОбъект.Дата, ТекущаяДата());																		
		
		Форма.Элементы.Помещение.Видимость = ИспользоватьСкладскиеПомещения И (ДатаПроверки >= ДатаНачалаИспользованияСкладскихПомещений);								
		
		Форма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад, Помещение", ДокументОбъект.Склад, ДокументОбъект.Помещение));	
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;
КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа РасходныйОрдерНаТовары, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_РасходныйОрдерНаТовары_ПослеОткрытияФормыДокумента	() Экспорт
	
	ИмяСобытия = "УТ_11_2_РасходныйОрдерНаТовары_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);	
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ОтборРазмещениеТоваров, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_ОтборРазмещениеТоваров_ПослеОткрытияФормыДокумента	() Экспорт
	
	ИмяСобытия = "УТ_11_2_ОтборРазмещениеТоваров_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма = СтруктураПараметров.ФормаДокумента;
		ДокументОбъект = Форма.Объект;
		
		//Из модуля формы УТ 11.4
		НастроитьПоСтатусу(ДокументОбъект.Статус, Форма.Элементы);
		
		//Попытка
		//	КопироватьДанныеФормы(ДокументОбъект, Форма.Объект);				
		//Исключение
		//КонецПопытки;
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПоСтатусу(Статус, ЭлементыФормы)
	
	Если Статус <> ПредопределенноеЗначение("Перечисление.СтатусыОтборовРазмещенийТоваров.ВыполненоСОшибками") Тогда
		ЭлементыФормы.ТоварыОтборКоличествоУпаковокОтобрано.Видимость       = Ложь;
		ЭлементыФормы.ТоварыОтборКоличествоУпаковок.Заголовок               = НСтр("ru = 'Количество'");
		ЭлементыФормы.ТоварыРазмещениеЗаполнитьКоличествоОтобрано.Видимость = Ложь;
		
		ЭлементыФормы.ТоварыРазмещениеКоличествоУпаковокРазмещено.Видимость = Ложь;
		ЭлементыФормы.ТоварыРазмещениеКоличествоУпаковок.Заголовок = НСтр("ru = 'Количество'");
		ЭлементыФормы.ТоварыРазмещениеЗаполнитьКоличествоРазмещено.Видимость = Ложь;
	Иначе
		ЭлементыФормы.ТоварыОтборКоличествоУпаковокОтобрано.Видимость       = Истина;
		ЭлементыФормы.ТоварыОтборКоличествоУпаковок.Заголовок               = НСтр("ru = 'К отбору'");
		ЭлементыФормы.ТоварыРазмещениеЗаполнитьКоличествоОтобрано.Видимость = Истина;
		
		ЭлементыФормы.ТоварыРазмещениеКоличествоУпаковокРазмещено.Видимость = Истина;
		ЭлементыФормы.ТоварыРазмещениеКоличествоУпаковок.Заголовок = НСтр("ru = 'К размещению'");
		ЭлементыФормы.ТоварыРазмещениеЗаполнитьКоличествоРазмещено.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа АктПостановкиНаБалансЕГАИС, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_АктПостановкиНаБалансЕГАИС_ПослеОткрытияФормыДокумента() Экспорт
	
	ИмяСобытия = "УТ_11_2_АктПостановкиНаБалансЕГАИС_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма = СтруктураПараметров.ФормаДокумента;
		
		Попытка 
			тчТовары = Форма.Объект.Товары;																		
			тчАкцизныеМарки = Форма.Объект.АкцизныеМарки;
			Для каждого Стр Из тчТовары Цикл
				
				Стр.КоличествоАкцизныхМарок = тчАкцизныеМарки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Стр.ИдентификаторСтроки)).Количество();
				
				ПараметрыЗаполнения = Новый Структура;
				ПараметрыЗаполнения.Вставить("ЗаполнитьФлагАлкогольнаяПродукция", Ложь);
				ПараметрыЗаполнения.Вставить("ИмяКолонки", "АлкогольнаяПродукция");
				
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", Стр.Характеристика);
				СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", Стр.Упаковка);
				СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
				СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
				
				СтруктураДействий.Вставить("ЗаполнитьПризнакМаркируемаяАлкогольнаяПродукция", Новый Структура("Номенклатура", "МаркируемаяАлкогольнаяПродукция"));
				СтруктураДействий.Вставить("ЗаполнитьНоменклатуруЕГАИС", ПараметрыЗаполнения);
				СтруктураДействий.Вставить("ЗаполнитьИндексАкцизнойМарки");		
				
				ОбщегоНазначенияКлиент.ОбщийМодуль("ОбработкаТабличнойЧастиКлиент").ОбработатьСтрокуТЧ(Стр, СтруктураДействий, Неопределено);
				
			КонецЦикла;	
		Исключение
		КонецПопытки;
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа АктСписанияЕГАИС, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_АктСписанияЕГАИС_ПослеОткрытияФормыДокумента			() Экспорт
	
	Перем ПараметрыЗаполнения;
	
	ИмяСобытия = "УТ_11_2_АктСписанияЕГАИС_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма 			= СтруктураПараметров.ФормаДокумента;
		ДокументОбъект 	= Форма.Объект;
		
		Попытка
			ПараметрыЗаполнения = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияЕГАИСКлиентСервер").ПараметрыЗаполненияТабличнойЧасти();
			ПараметрыЗаполнения.ПересчитатьСумму               = Истина;
			ПараметрыЗаполнения.ПересчитатьКоличествоЕдиниц    = Истина;
			ПараметрыЗаполнения.МаркируемаяПродукцияВТЧ        = Истина;
			ПараметрыЗаполнения.ЗаполнитьАлкогольнуюПродукцию  = Истина;
			ПараметрыЗаполнения.ПроверитьСериюРассчитатьСтатус = Истина;
			ПараметрыЗаполнения.ЗаполнитьАртикул               = Истина;
			ПараметрыЗаполнения.ЗаполнитьКод                   = Истина;
		Исключение
			ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Попытка
			Если ПараметрыЗаполнения = Неопределено Тогда
				ПараметрыЗаполнения = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиент").СтруктураПараметрыЗаполнения();
				ПараметрыЗаполнения.МаркируемаяАлкогольнаяПродукцияВТЧ = Истина;
				ПараметрыЗаполнения.ПроверитьСериюРассчитатьСтатус     = Истина;
				ПараметрыЗаполнения.ОбработатьУпаковки                 = Ложь;		
			КонецЕсли;
		Исключение
			ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
			
		Если НЕ ПараметрыЗаполнения = Неопределено Тогда
			КэшированныеЗначения = Неопределено;
			
			Для каждого СтрокаДокумента из ДокументОбъект.Товары Цикл	
				ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиентПереопределяемый").ПриИзмененииНоменклатуры(Форма, СтрокаДокумента, КэшированныеЗначения,
					ПараметрыЗаполнения, Форма.ПараметрыУказанияСерий);
			КонецЦикла;
		КонецЕсли;
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ТТНВходящаяЕГАИС, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_ТТНВходящаяЕГАИС_ПослеОткрытияФормыДокумента			() Экспорт
	
	ИмяСобытия = "УТ_11_2_ТТНВходящаяЕГАИС_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;
	
	Попытка
		
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма = СтруктураПараметров.ФормаДокумента;
		
		Попытка 
			
			тчТовары = Форма.Объект.Товары;																						
			Для каждого Стр Из тчТовары Цикл					
				Стр.РасхождениеКоличества = Стр.Количество <> Стр.КоличествоФакт;										
			КонецЦикла;								
			
			Форма.Элементы.ТоварыКоличествоФакт.Видимость = Форма.Объект.ЕстьРасхождения;
			
		Исключение
		КонецПопытки;	
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ТТНИсходящаяЕГАИС, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_ТТНИсходящаяЕГАИС_ПослеОткрытияФормыДокумента			() Экспорт
	
	ИмяСобытия = "УТ_11_2_ТТНИсходящаяЕГАИС_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;
	
	Попытка
		
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма = СтруктураПараметров.ФормаДокумента;
		
		Попытка 
			
			тчТовары = Форма.Объект.Товары;																						
			Для каждого Стр Из тчТовары Цикл					
				Стр.РасхождениеКоличества = Стр.КоличествоУпаковок <> Стр.КоличествоФакт;										
			КонецЦикла;	
			
			Форма.Элементы.ТоварыКоличествоФакт.Видимость = Форма.Объект.ЕстьРасхождения;
			
		Исключение
		КонецПопытки;
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа МаркировкаТоваровГИСМ, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_2_МаркировкаТоваровГИСМ_ПослеОткрытияФормыДокумента			() Экспорт
	
	
	ИмяСобытия = "УТ_11_2_МаркировкаТоваровГИСМ_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;
	
	Попытка
		
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма = СтруктураПараметров.ФормаДокумента;
		
		ДанныеОбъекта = Новый Структура;
		ДанныеОбъекта.Вставить("КиЗГИСМВид", 					Форма.Объект.КиЗГИСМВид);
		ДанныеОбъекта.Вставить("КиЗГИСМРазмер", 				Форма.Объект.КиЗГИСМРазмер);
		ДанныеОбъекта.Вставить("КиЗГИСМСпособВыпускаВОборот", 	Форма.Объект.КиЗГИСМСпособВыпускаВОборот);
		ДанныеОбъекта.Вставить("КиЗГИСМСИндивидуализацией", 	Форма.Объект.КиЗГИСМСИндивидуализацией);								
		
		СписокНоменклатураКиЗ = Новый СписокЗначений;
		СписокНоменклатураКиЗ.ЗагрузитьЗначения(Форма.СписокНоменклатураКиЗ.ВыгрузитьЗначения());
		
		УТ_11_2_ЗаполнитьКИЗ(ДанныеОбъекта, СписокНоменклатураКиЗ);
		
		Форма.СписокНоменклатураКиЗ.ЗагрузитьЗначения(СписокНоменклатураКиЗ.ВыгрузитьЗначения());
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ЗаказНаЭмиссиюКМ, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_4_ЗаказНаЭмиссиюКМ_ПослеОткрытияФормы() Экспорт
	
	ИмяСобытия = "УТ_11_4_ЗаказНаЭмиссиюКМ_ПослеОткрытияФормы";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;
	
	Попытка
		
		Форма = СтруктураПараметров.ФормаДокумента;
		ДокументОбъект = Форма.Объект;
		ЭлементыФормы  = Форма.Элементы;
		
		ЗначенияПеречисления = УТ_11_4_ПолучитьЗначенияПеречисления("ВидыПродукцииИС");
		
		ЭтоНикотиносодержащаяПродукция = ЗначенияПеречисления.Найти("НикотиносодержащаяПродукция") <> Неопределено
			И ДокументОбъект.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.НикотиносодержащаяПродукция");
		
		Форма.ЭтоМаркировкаОстатков =
			ДокументОбъект.СпособВводаВОборот = ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков")
			И НЕ ЭтоНикотиносодержащаяПродукция;
		
		ЭтоТрансграничнаяТорговля = ДокументОбъект.СпособВводаВОборот = ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.ТрансграничнаяТорговля");
		
		Попытка
			ЭтоКомиссия = ДокументОбъект.СпособВводаВОборот = ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Комиссия");
		Исключение
			// Адаптация к старым релизам
			ЭтоКомиссия = Ложь;	
		КонецПопытки;
		
		ЭтоШины                 = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "Шины");
		ЭтоДухи                 = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "Духи");
		ЭтоМолочнаяПродукция    = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "МолочнаяПродукцияПодконтрольнаяВЕТИС");
		ЭтоОбувь                = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "Обувь");
		ЭтоЛегкаяПромышленность = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "ЛегкаяПромышленность")
			ИЛИ ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "ЛегкаяПромышленность2025");
		ЭтоТабак                = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "Табак");
		ЭтоАльтернативныйТабак  = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "АльтернативныйТабак");
		ЭтоТабачнаяПродукция    = ИнтеграцияИСКлиентСервер_ЭтоПродукцияМОТП(ДокументОбъект.ВидПродукции);
		ЭтоМех                  = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "ПродукцияИзНатуральногоМеха");
		ЭтоАнтисептики          = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "Антисептики")
			ИЛИ ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "ДезинфицирующиеСредства");
		ЭтоБАД                  = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "БАДы")
			ИЛИ ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "БАДы2025");
		ЭтоКреслаКоляски        = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "КреслаКоляски")
			ИЛИ ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "ТехническиеСредстваРеабилитации")
			ИЛИ ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "МедицинскиеИзделия")
			ИЛИ ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "МедицинскиеИзделия20");
		ЭтоВелосипеды           = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "Велосипеды");
		ЭтоТитановаяПродукция   = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ДокументОбъект.ВидПродукции, "ТитановаяМеталлопродукция");
		
		Попытка
			ДоставкаЭмитентомДоУказанногоМеста = ПредопределенноеЗначение("Перечисление.СпособыПолученияИзготовленныхКИЗГИСМ.ДоставкаЭмитентомДоУказанногоМеста");
		Исключение
			// Адаптация к старым релизам
			ДоставкаЭмитентомДоУказанногоМеста = Ложь;	
		КонецПопытки;
		
		ВидимостьАдреса = (ЭтоТабачнаяПродукция И Не Форма.ЭтоМаркировкаОстатков)
			Или ЭтоМех
			И ДокументОбъект.СпособПолучения = ДоставкаЭмитентомДоУказанногоМеста;
		
		Попытка	
			ЭлементыФормы.ТоварыМаксимальнаяРозничнаяЦена.Видимость             = ЭтоТабак;
			ЭлементыФормы.ПроизводственныйОбъектИдентификатор.Видимость         = (ЭтоТабачнаяПродукция И Не Форма.ЭтоМаркировкаОстатков);
			ЭлементыФормы.ИдентификаторПроизводственнойЛинии.Видимость          = (ЭтоТабачнаяПродукция И Не Форма.ЭтоМаркировкаОстатков);
			ЭлементыФормы.ОжидаемаяДатаНачалаПроизводства.Видимость             = (ЭтоТабачнаяПродукция И Не Форма.ЭтоМаркировкаОстатков);
			ЭлементыФормы.ПредставлениеАдресаПроизводственногоОбъекта.Видимость = ВидимостьАдреса;
		Исключение
			// Адаптация к старым релизам
			Если ЭлементыФормы.Найти("ГруппаМОТП") <> Неопределено Тогда
				ЭлементыФормы.ТоварыМаксимальнаяРозничнаяЦена.Видимость = ЭтоТабак;
				ЭлементыФормы.ГруппаМОТП.Видимость                      = (ЭтоТабачнаяПродукция И Не Форма.ЭтоМаркировкаОстатков);
			Иначе
				Если ЭтоТабак Тогда
					Если ЭлементыФормы.Найти("ГруппаТабачнаяПродукция") <> Неопределено Тогда
						ЭлементыФормы.ГруппаТабачнаяПродукция.Видимость         = Истина;
					КонецЕсли;
					Если ЭлементыФормы.Найти("ТоварыМаксимальнаяРозничнаяЦена") <> Неопределено Тогда
						ЭлементыФормы.ТоварыМаксимальнаяРозничнаяЦена.Видимость = Истина;
					КонецЕсли;
					Если ЭлементыФормы.Найти("ГруппаОбувнаяПродукция") <> Неопределено Тогда
						ЭлементыФормы.ГруппаОбувнаяПродукция.Видимость          = Ложь;
					КонецЕсли;
				ИначеЕсли ИнтеграцияИСКлиентСервер_ЭтоПродукцияИСМП(ДокументОбъект.ВидПродукции) Тогда
					Если ЭлементыФормы.Найти("ГруппаТабачнаяПродукция") <> Неопределено Тогда
						ЭлементыФормы.ГруппаТабачнаяПродукция.Видимость         = Ложь;
					КонецЕсли;
					Если ЭлементыФормы.Найти("ТоварыМаксимальнаяРозничнаяЦена") <> Неопределено Тогда
						ЭлементыФормы.ТоварыМаксимальнаяРозничнаяЦена.Видимость = Ложь;
					КонецЕсли;
					Если ЭлементыФормы.Найти("ГруппаОбувнаяПродукция") <> Неопределено Тогда
						ЭлементыФормы.ГруппаОбувнаяПродукция.Видимость          = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецПопытки;
		
		Попытка
			Форма.ИспользуютсяНаборы            = ИнтеграцияИСКлиентСервер_ВидПродукцииИспользуетНаборы(ДокументОбъект.ВидПродукции);
			Форма.ИспользуютсяГрупповыеУпаковки = ИнтеграцияИСКлиентСервер_ВидПродукцииИспользуетГрупповыеУпаковки(ДокументОбъект.ВидПродукции);
			Форма.ШаблоныГрупповойУпаковки      = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ШаблоныКодовПоВидуПродукции(ДокументОбъект.ВидПродукции, 4);
			Форма.ШаблоныНабора                 = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ШаблоныКодовПоВидуПродукции(ДокументОбъект.ВидПродукции, 5);
			Если Форма.ИспользуютсяНаборы И Форма.ИспользуютсяГрупповыеУпаковки Тогда
				ЭлементыФормы.ПерезаполнитьНаборыГрупповыеУпаковки.Заголовок = НСтр("ru = 'Перезаполнить наборы / групповые упаковки'");
				ЭлементыФормы.ТоварыУстановитьОтборПоНаборуГрупповойУпаковке.Заголовок =
					НСтр("ru = 'Установить отбор строк по набору / групповой упаковке'");
			ИначеЕсли Форма.ИспользуютсяНаборы Тогда
				ЭлементыФормы.ПерезаполнитьНаборыГрупповыеУпаковки.Заголовок = НСтр("ru = 'Перезаполнить наборы'");
				ЭлементыФормы.ТоварыУстановитьОтборПоНаборуГрупповойУпаковке.Заголовок =
					НСтр("ru = 'Установить отбор строк по набору'");
			ИначеЕсли Форма.ИспользуютсяГрупповыеУпаковки Тогда
				ЭлементыФормы.ПерезаполнитьНаборыГрупповыеУпаковки.Заголовок = НСтр("ru = 'Перезаполнить групповые упаковки'");
				ЭлементыФормы.ТоварыУстановитьОтборПоНаборуГрупповойУпаковке.Заголовок =
					НСтр("ru = 'Установить отбор строк по групповой упаковке'");
			КонецЕсли;
			ЭлементыФормы.ПерезаполнитьНаборыГрупповыеУпаковки.Видимость =
				Форма.ИспользуютсяНаборы Или Форма.ИспользуютсяГрупповыеУпаковки;
			ЭлементыФормы.ТоварыУстановитьОтборПоНаборуГрупповойУпаковке.Видимость =
				Форма.ИспользуютсяНаборы Или Форма.ИспользуютсяГрупповыеУпаковки;
		Исключение
			// Адаптация к старым релизам				
		КонецПопытки;
		
		Попытка
			Форма.ИспользованиеСервисПровайдераЗапрещено =
				ЭтоТабачнаяПродукция Или ЭтоКомиссия Или ЭтоМех Или ЭтоТитановаяПродукция;
			ЭлементыФормы.ГруппаСервисПровайдер.Видимость =
				Не Форма.ИспользованиеСервисПровайдераЗапрещено;
			ЭлементыФормы.СервисПровайдер.Доступность =
				Форма.ПечатьКодовМаркировки = 1;
		Исключение
			// Адаптация к старым релизам
		КонецПопытки;
		
		Попытка
			ЭлементыФормы.ТоварыПодготовитьПередатьСведенияОТоварахВКаталогGS46.Видимость         =
				ЭтоОбувь И Форма.ОтображатьКомандуТоварыПодготовитьПередатьСведенияОТоварахВКаталогGS46;
			ЭлементыФормы.ТоварыПодготовитьПередатьСведенияОТоварахВНациональныйКаталог.Видимость =
				Форма.ОтображатьКомандуТоварыПодготовитьПередатьСведенияОТоварахВНациональныйКаталог;
			ЭлементыФормы.ТоварыВключить1СНоменклатуру.Видимость                                  =
				Форма.ОтображатьКомандуВключить1СНоменклатуру;
		Исключение
			// Адаптация к старым релизам
			Если ЭлементыФормы.Найти("ТоварыПодготовитьПередатьСведенияОТоварахВКаталогGS46") <> Неопределено Тогда
				Если ЭтоОбувь Тогда
					ЭлементыФормы.ТоварыПодготовитьПередатьСведенияОТоварахВКаталогGS46.Видимость         = Форма.ОтображатьКомандуТоварыПодготовитьПередатьСведенияОТоварахВКаталогGS46;
					ЭлементыФормы.ТоварыПодготовитьПередатьСведенияОТоварахВНациональныйКаталог.Видимость = Ложь;
					ЭлементыФормы.ТоварыВключить1СНоменклатуру.Видимость                                  = Ложь;
				Иначе
					ЭлементыФормы.ТоварыПодготовитьПередатьСведенияОТоварахВКаталогGS46.Видимость         = Ложь;
					ЭлементыФормы.ТоварыПодготовитьПередатьСведенияОТоварахВНациональныйКаталог.Видимость = Форма.ОтображатьКомандуТоварыПодготовитьПередатьСведенияОТоварахВНациональныйКаталог;
					ЭлементыФормы.ТоварыВключить1СНоменклатуру.Видимость                                  = Форма.ОтображатьКомандуВключить1СНоменклатуру;
				КонецЕсли;
			Иначе
				ЭлементыФормы.ТоварыПодготовитьПередатьСведенияОТоварах.Видимость = ЭтоОбувь И Форма.ОтображатьКомандуТоварыПодготовитьПередатьСведенияОТоварах;
			КонецЕсли;
		КонецПопытки;
		
		Попытка
			ЭтоРасширеннаяМаркировкаОстатковЛегкойПромышленности = УТ_11_4_ЗаказНаЭмиссиюКодовМаркировкиСУЗ_ЭтоРасширеннаяМаркировкаОстатковЛегкойПромышленности(Форма);
		Исключение
			// Адаптация к старым релизам
			ЭтоРасширеннаяМаркировкаОстатковЛегкойПромышленности = Ложь;
		КонецПопытки;
		
		Попытка
			Если (Форма.ЭтоМаркировкаОстатков И Не ЭтоЛегкаяПромышленность)
				Или ЭтоРасширеннаяМаркировкаОстатковЛегкойПромышленности Тогда
				
				Если ЭтоРасширеннаяМаркировкаОстатковЛегкойПромышленности Тогда
					ПолноеОписание = Неопределено;
				Иначе
					ПолноеОписание = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ИспользованиеСпособаОписанияОстатков(ДокументОбъект.ВидПродукции);
				КонецЕсли;
				
				ПараметрыОписанияОстатков =
					ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ИспользованиеПараметровОписанияОстатковПоВидуПродукции(ДокументОбъект.ВидПродукции);
				
				ЭлементыФормы.БезУчетаНоменклатуры.Видимость = Не ЭтоАльтернативныйТабак И Не ЭтоДухи
					И Не ЭтоАнтисептики И Не ЭтоБАД И Не ЭтоКреслаКоляски И Не ЭтоВелосипеды;
				
				БылДоступен = ДокументОбъект.ВвезенПослеДатыОбязательнойМаркировки
					И (ЭтоДухи Или ЭтоШины Или ЭтоЛегкаяПромышленность Или ЭтоОбувь);
				СейчасДоступен = Не ЭтоТабачнаяПродукция
					И Не ЭтоАнтисептики И Не ЭтоБАД И Не ЭтоКреслаКоляски И Не ЭтоВелосипеды
					Или БылДоступен;
				ЭлементыФормы.ВвезенПослеДатыОбязательнойМаркировки.Видимость = СейчасДоступен;
				
				БылДоступен = ДокументОбъект.ПриобретенПроизведенПослеДатыОбязательнойМаркировки
					И (ЭтоДухи Или ЭтоШины Или ЭтоЛегкаяПромышленность Или ЭтоОбувь);
				СейчасДоступен = Не ЭтоТабачнаяПродукция
					И Не ЭтоАнтисептики И Не ЭтоБАД И Не ЭтоКреслаКоляски И Не ЭтоВелосипеды
					Или БылДоступен;
				ЭлементыФормы.ПриобретенПроизведенПослеДатыОбязательнойМаркировки.Видимость = СейчасДоступен;
				
				ЭлементыФормы.ЗаполнитьПараметрыОписанияОстатков.Видимость = (Не ПолноеОписание = Истина);
				
				ЭлементыФормы.ТоварыПолноеОписаниеОстатков.Видимость = (ПолноеОписание = Неопределено);
				ЭлементыФормы.ТоварыКодТНВЭД.Видимость               = (Не ПолноеОписание = Истина);
				ЭлементыФормы.ТоварыЦелевойПол.Видимость             = ПараметрыОписанияОстатков.ИспользоватьЦелевойПол;
				ЭлементыФормы.ТоварыВозрастнаяКатегория.Видимость    = ПараметрыОписанияОстатков.ИспользоватьВозрастнуюКатегорию;
				ЭлементыФормы.ТоварыМодель.Видимость                 = ПараметрыОписанияОстатков.ИспользоватьМодель;
				ЭлементыФормы.ТоварыСпособВводаВОборот.Видимость     = ПараметрыОписанияОстатков.ИспользоватьСпособВводаВОборот;
				ЭлементыФормы.ТоварыНаименование.Видимость           = ПараметрыОписанияОстатков.ИспользоватьНаименование;
				ЭлементыФормы.ТоварыТоварныйЗнак.Видимость           = (Не ПолноеОписание = Истина);
				
			Иначе
				
				ЭлементыФормы.БезУчетаНоменклатуры.Видимость                                = Ложь;
				ЭлементыФормы.ВвезенПослеДатыОбязательнойМаркировки.Видимость               = Ложь;
				ЭлементыФормы.ПриобретенПроизведенПослеДатыОбязательнойМаркировки.Видимость = Ложь;
				ЭлементыФормы.ЗаполнитьПараметрыОписанияОстатков.Видимость                  = Ложь;
				
				ЭлементыФормы.ТоварыПолноеОписаниеОстатков.Видимость = Ложь;
				ЭлементыФормы.ТоварыКодТНВЭД.Видимость               = ЭтоМех;
				ЭлементыФормы.ТоварыЦелевойПол.Видимость             = Ложь;
				ЭлементыФормы.ТоварыВозрастнаяКатегория.Видимость    = Ложь;
				ЭлементыФормы.ТоварыМодель.Видимость                 = Ложь;
				ЭлементыФормы.ТоварыСпособВводаВОборот.Видимость     = ЭтоМех;
				ЭлементыФормы.ТоварыНаименование.Видимость           = Ложь;
				ЭлементыФормы.ТоварыТоварныйЗнак.Видимость           = ЭтоТабак Или ЭтоАльтернативныйТабак;
				
			КонецЕсли;
		Исключение
			// Адаптация к старым релизам
			Попытка
				ВидПродукцииПодлежитМаркировкеОстатков = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ВидПродукцииПодлежитМаркировкеОстатков(ДокументОбъект.ВидПродукции);
			Исключение
				ВидПродукцииПодлежитМаркировкеОстатков = Ложь;
			КонецПопытки;		
		
			ЭлементыФормы.ТоварыКодТНВЭД.Видимость                            			 = Форма.ЭтоМаркировкаОстатков;
			ЭлементыФормы.ЗаполнитьПараметрыОписанияОстатков.Видимость                  = ВидПродукцииПодлежитМаркировкеОстатков И Форма.ЭтоМаркировкаОстатков;
			ЭлементыФормы.БезУчетаНоменклатуры.Видимость                                = ВидПродукцииПодлежитМаркировкеОстатков И Форма.ЭтоМаркировкаОстатков И Не ЭтоАльтернативныйТабак;
			ЭлементыФормы.ВвезенПослеДатыОбязательнойМаркировки.Видимость               = ВидПродукцииПодлежитМаркировкеОстатков И Форма.ЭтоМаркировкаОстатков И Не ЭтоТабачнаяПродукция;
			ЭлементыФормы.ПриобретенПроизведенПослеДатыОбязательнойМаркировки.Видимость = ВидПродукцииПодлежитМаркировкеОстатков И Форма.ЭтоМаркировкаОстатков И Не ЭтоТабачнаяПродукция;
			ЭлементыФормы.ТоварыПолноеОписаниеОстатков.Видимость                        = ВидПродукцииПодлежитМаркировкеОстатков И Форма.ЭтоМаркировкаОстатков И Не ЭтоТабак;
			
			Если ЭлементыФормы.Найти("ТоварыНаименование") <> Неопределено Тогда
				ЭлементыФормы.ТоварыНаименование.Видимость = Форма.ЭтоМаркировкаОстатков И ЭтоТабачнаяПродукция;
			КонецЕсли;
			
			Если Форма.ЭтоМаркировкаОстатков Тогда
				ЭлементыФормы.ТоварыЦелевойПол.Видимость          = ЭтоОбувь Или ЭтоЛегкаяПромышленность;
				ЭлементыФормы.ТоварыСпособВводаВОборот.Видимость  = ЭтоОбувь Или ЭтоЛегкаяПромышленность;
				ЭлементыФормы.ТоварыМодель.Видимость              = ЭтоШины;
				ЭлементыФормы.ТоварыВозрастнаяКатегория.Видимость = ЭтоЛегкаяПромышленность;
				ЭлементыФормы.ТоварыТоварныйЗнак.Видимость        = Не ЭтоОбувь;
			Иначе
				ЭлементыФормы.ТоварыЦелевойПол.Видимость          = Ложь;
				ЭлементыФормы.ТоварыСпособВводаВОборот.Видимость  = Ложь;
				ЭлементыФормы.ТоварыТоварныйЗнак.Видимость        = ЭтоТабачнаяПродукция;
				ЭлементыФормы.ТоварыМодель.Видимость              = Ложь;
				ЭлементыФормы.ТоварыВозрастнаяКатегория.Видимость = Ложь;
			КонецЕсли;
		КонецПопытки;
		
		ЭлементыФормы.ТоварыШаблон.СписокВыбора.Очистить();
		
		ДоступныеШаблоны = Неопределено;
		Попытка
			ДоступныеШаблоны = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ШаблоныКодовПоВидуПродукции(ДокументОбъект.ВидПродукции, 3);
		Исключение 
			// Адаптация к старым релизам
		КонецПопытки;
		
		Если ДоступныеШаблоны = Неопределено Тогда
			Попытка
				ДоступныеШаблоны = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ШаблоныКодовПоВидуПродукции(ДокументОбъект.ВидПродукции);
			Исключение
				ВключатьКомлекты = Не Форма.ЭтоМаркировкаОстатков;
				
				ДоступныеШаблоны = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ШаблоныКодовПоВидуПродукции(ДокументОбъект.ВидПродукции, ВключатьКомлекты);
			КонецПопытки;
		КонецЕсли;
		
		Для Каждого ЭлементСпискаЗначений Из ДоступныеШаблоны Цикл
			ЭлементыФормы.ТоварыШаблон.СписокВыбора.Добавить(
				ЭлементСпискаЗначений.Значение, ЭлементСпискаЗначений.Представление);
		КонецЦикла;
			
		Если ЭтоМолочнаяПродукция Тогда
			ЭлементыФормы.ТоварыШаблон.Заголовок = НСтр("ru = 'Шаблон КМ';
				|en = 'Шаблон КМ'");
		Иначе
			ЭлементыФормы.ТоварыШаблон.Заголовок = НСтр("ru = 'Вид упаковки';
				|en = 'Вид упаковки'");
		КонецЕсли;
		
		ЭтоУстаревшаяМолочнаяПродукция = Ложь;
		
		Попытка
			Если ЭтоМолочнаяПродукция Тогда
				Для Каждого СтрокаТовары Из ДокументОбъект.Товары Цикл
					Если СтрокаТовары.Шаблон = ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.СкоропортящаясяМолочнаяПродукцияВЕТИС")
						Или СтрокаТовары.Шаблон = ПредопределенноеЗначение("Перечисление.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИС") Тогда
						ЭтоУстаревшаяМолочнаяПродукция = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ЭтоУстаревшаяМолочнаяПродукция Тогда
					ЭлементыФормы.ТоварыСрокГодности.Видимость      = Истина;
					ЭлементыФормы.ТоварыСрокГодности.ТолькоПросмотр = Истина;
				Иначе
					ЭлементыФормы.ТоварыСрокГодности.Видимость = Ложь;
				КонецЕсли;
			Иначе
				ЭлементыФормы.ТоварыСрокГодности.Видимость = Ложь;
			КонецЕсли;
		Исключение
			ЭлементыФормы.ТоварыСрокГодности.Видимость = ЭтоМолочнаяПродукция;
		КонецПопытки;
		
		ЭлементыФормы.ТоварыШаблон.Видимость = (ЭлементыФормы.ТоварыШаблон.СписокВыбора.Количество() > 1 Или ЭтоУстаревшаяМолочнаяПродукция);
		
		
		ЗависимыеОтСтатусаОбработкиЗаказа = Новый Массив;
		ЗависимыеОтСтатусаОбработкиЗаказа.Добавить("ГруппаШапка");
		ЗависимыеОтСтатусаОбработкиЗаказа.Добавить("Товары");
		ЗависимыеОтСтатусаОбработкиЗаказа.Добавить("ТоварыКоманднаяПанельЕще");
		ЗависимыеОтСтатусаОбработкиЗаказа.Добавить("ТоварыГруппаПодменюЗаполнить");
		ЗависимыеОтСтатусаОбработкиЗаказа.Добавить("ТоварыГруппаТорговоеОборудование");
		ЗависимыеОтСтатусаОбработкиЗаказа.Добавить("ТоварыУказатьСерийныеНомера");
		ЗависимыеОтСтатусаОбработкиЗаказа.Добавить("ГруппаДоговор");
		ЗависимыеОтСтатусаОбработкиЗаказа.Добавить("Ответственный");
		
		ИнтеграцияИСКлиентСервер_УстановитьДоступностьЭлементовФормы(Форма, ЗависимыеОтСтатусаОбработкиЗаказа, Не Форма.РедактированиеФормыНеДоступно);
		
		ЭлементыФормы.ТоварыКоличествоЭмитировано.Видимость = Форма.ОтобразитьКоличествоЭмитировано;
		ЭлементыФормы.ОтборСтрок.Видимость                  = Форма.ОтобразитьКоличествоЭмитировано;
		ЭлементыФормы.Контрагент.Видимость                  = ЭтоТрансграничнаяТорговля;
		
		Попытка
			ИспользуетсяТипОплатыКодовМаркировки = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ИспользуетсяТипОплатыКодовМаркировки(
				ДокументОбъект.ВидПродукции, ДокументОбъект.Организация);
			ЭлементыФормы.ТипОплатыКодовМаркировки.Видимость = ИспользуетсяТипОплатыКодовМаркировки;

			Если ИспользуетсяТипОплатыКодовМаркировки
				И Не ЗначениеЗаполнено(ДокументОбъект.ТипОплатыКодовМаркировки) Тогда
				ДокументОбъект.ТипОплатыКодовМаркировки = ПредопределенноеЗначение("Перечисление.ТипыОплатыКодовМаркировкиСУЗ.ОплатаПоНанесению");
			КонецЕсли;
			ЭлементыФормы.GLNОрганизации.Видимость              = ЭтоМех;
			ЭлементыФормы.ФормаВиртуальнаяАгрегация.Видимость   = (Не ЭтоМех);
			ЭлементыФормы.ФормаПечать.Видимость                 = (Не ЭтоМех);
			ЭлементыФормы.СброситьПризнакПечати.Видимость       = (Не ЭтоМех);
			ЭлементыФормы.ТоварыУказатьСерийныеНомера.Видимость = (Не ЭтоМех);
			
			ЭлементыФормы.ТоварыСпособФормированияСерийногоНомера.Видимость = (Не ЭтоМех);
			ЭлементыФормы.ТоварыСтатусУказанияСерийногоНомера.Видимость     = (Не ЭтоМех);
			ЭлементыФормы.СпособВыпускаВОборот.Видимость                    = (Не ЭтоМех);
			
			ЭлементыФормы.ТоварыВидКИЗ.Видимость                            = ЭтоМех;
			ЭлементыФормы.ТоварыРазмерКИЗ.Видимость                         = ЭтоМех;
			ЭлементыФормы.СпособПолучения.Видимость                         = ЭтоМех;
			ЭлементыФормы.НомерДоговораСОператором.Видимость                = ЭтоМех;
			ЭлементыФормы.ДатаДоговораСОператором.Видимость                 = ЭтоМех;
			
			ЭлементыФормы.ТоварыВладелецGTINСтрокой.Видимость = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ИспользуетсяВладелецGTINВЗаказеНаЭмиссию(
				Форма.Объект.СпособВводаВОборот, Форма.Объект.ВидПродукции)	И Не ЭтоРасширеннаяМаркировкаОстатковЛегкойПромышленности;
		Исключение
			// Адаптация к старым релизам
		КонецПопытки;
		
		
		// Выгружаем на сервер список номенклатуры и находим соответствующие им значения использования характеристик
		Товары = Новый Массив;
		Для Каждого Строка Из ДокументОбъект.Товары Цикл   		
			Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			Товары.Добавить(Строка.Номенклатура);			
		КонецЦикла;		
				
		ТоварХарактеристика = УТ_11_4_ПолучитьИспользованиеХарактеристик(Товары);
		
		Для Каждого Строка Из ДокументОбъект.Товары Цикл   	
			Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			Строка.ХарактеристикиИспользуются = ТоварХарактеристика.Получить(Строка.Номенклатура);
		КонецЦикла;                                                                      
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа МаркировкаТоваровИСМП, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_4_МаркировкаТоваровИСМП_ПослеОткрытияФормы() Экспорт
	
	ИмяСобытия = "УТ_11_4_МаркировкаТоваровИСМП_ПослеОткрытияФормы";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;
	
	Попытка
		
		Форма 				= СтруктураПараметров.ФормаДокумента;
		СсылкаНаДокумент 	= СтруктураПараметров.СсылкаНаДокумент;		
		ДокументОбъект 		= Форма.Объект;
		
		Если ДокументОбъект.ОтчетПроизводственнойЛинии Тогда
			ЗаполнитьЗначенияСвойств(Форма, ДокументОбъект, "Номенклатура, Характеристика, Серия, КодТНВЭД");
		КонецЕсли;
		
		УТ_11_4_МаркировкаТоваровИСМП_ЗаполнитьДоступныеОперации(Форма);
		
		УТ_11_4_МаркировкаТоваровИСМП_НастроитьЭлементыФормы(Форма);
		
		Форма.ПараметрыУказанияСерий = ПолучитьПараметрыУказанияСерий(ДокументОбъект);
		
		Для Каждого Строка из ДокументОбъект.Товары Цикл
			ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСМПКлиентПереопределяемый").ПриИзмененииНоменклатуры(Форма, Строка, Неопределено, Форма.ПараметрыУказанияСерий);
			Строка.СтатусПроверкиГосИС = 1;
		КонецЦикла;
		
		Для Каждого Строка из ДокументОбъект.Товары Цикл
			Если Не ЗначениеЗаполнено(Строка.ВидДокументаСертификации) Тогда
				Продолжить;
			КонецЕсли;
			Строка.Сертификация = УТ_11_4_МаркировкаТоваровИСМП_ПредставлениеСертификации(
				Строка.ВидДокументаСертификации, Строка.НомерДокументаСертификации, Строка.ДатаДокументаСертификации);
		КонецЦикла;
		
		Попытка
			КопироватьДанныеФормы(ДокументОбъект, Форма.Объект);				
		Исключение
		КонецПопытки;
		Форма.Модифицированность = Ложь;
		
		Если ЗначениеЗаполнено(ДокументОбъект.Номенклатура) Тогда
			УТ_11_4_МаркировкаТоваровИСМП_УстановитьУсловноеОформлениеВНетабличноеПоле(Форма);
		КонецЕсли;
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ОтгрузкаТоваровИСМП, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_4_ОтгрузкаТоваровИСМП_ПослеОткрытияФормыДокумента () Экспорт
	
	ИмяСобытия = "УТ_11_4_ОтгрузкаТоваровИСМП_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;
	
	Попытка
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;
	

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ПриемкаТоваровИСМП, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_4_ПриемкаТоваровИСМП_ПослеОткрытияФормыДокумента () Экспорт
	
	ИмяСобытия = "УТ_11_4_ПриемкаТоваровИСМП_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;
	
	Попытка
		
		//УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма = СтруктураПараметров.ФормаДокумента;
		
		ЗависимыеОтСтатусаИСМП = Новый Массив;
		ЗависимыеОтСтатусаИСМП.Добавить("Операция");
		ЗависимыеОтСтатусаИСМП.Добавить("НомерЗаявкиНаОтгрузку");
		ЗависимыеОтСтатусаИСМП.Добавить("НомерПервичногоДокумента");
		ЗависимыеОтСтатусаИСМП.Добавить("ДатаПервичногоДокумента");
		ЗависимыеОтСтатусаИСМП.Добавить("ДатаОтгрузки");
		
		ИнтеграцияИСКлиентСервер_УстановитьДоступностьЭлементовФормы(Форма, ЗависимыеОтСтатусаИСМП, Истина);
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ВыводИзОборотаИСМП, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_4_ВыводИзОборотаИСМП_ПослеОткрытияФормыДокумента () Экспорт
	
	ИмяСобытия = "УТ_11_4_ВыводИзОборотаИСМП_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;
	
	Попытка
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа СписаниеКодовМаркировкиИСМП, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_4_СписаниеКодовМаркировкиИСМП_ПослеОткрытияФормыДокумента () Экспорт
	
	ИмяСобытия = "УТ_11_4_СписаниеКодовМаркировкиИСМП_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;
	
	Попытка
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ВозвратТоваровОтКлиента, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_4_ВозвратТоваровОтКлиента_ПослеОткрытияФормыДокумента	() Экспорт
	
	ИмяСобытия = "УТ_11_4_ВозвратТоваровОтКлиента_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма 			= СтруктураПараметров.ФормаДокумента;		
		ДокументОбъект 	= Форма.Объект;		
		
		СтруктураОбъекта = Новый Структура("Организация,Дата,Склад,Договор,НаправлениеДеятельности,Подразделение,ХозяйственнаяОперация");
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта, ДокументОбъект);		
		ЗаполнитьНалогообложениеНДСПродажиВозврата(ДокументОбъект.НалогообложениеНДС, СтруктураОбъекта);				
		
		СуммаВсего = ?(СтруктураПараметров.ФормаДокумента.Объект.ПредусмотренЗалогЗаТару Или Не СтруктураПараметров.ФормаДокумента.Объект.ВозвратПереданнойМногооборотнойТары,
			СтруктураПараметров.ФормаДокумента.Объект.Товары.Итог("СуммаСНДС"),
			СтруктураПараметров.ФормаДокумента.Объект.Товары.Итог("СуммаСНДСБезВозвратнойТары"));
		СтруктураПараметров.ФормаДокумента.СуммаНДС = ?(СтруктураПараметров.ФормаДокумента.Объект.ПредусмотренЗалогЗаТару Или Не СтруктураПараметров.ФормаДокумента.Объект.ВозвратПереданнойМногооборотнойТары,
			СтруктураПараметров.ФормаДокумента.Объект.Товары.Итог("СуммаНДС"),
			СтруктураПараметров.ФормаДокумента.Объект.Товары.Итог("СуммаНДСБезВозвратнойТары"));			
			
		Попытка
			ОбщегоНазначенияКлиент.ОбщийМодуль("ФинансыКлиентСервер").ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(СтруктураПараметров.ФормаДокумента.Объект, СуммаВсего);
		Исключение
			Сообщить("Не удалось пересчитать суммы в строке расшифровки платежа. Причина: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Попытка
			СуммаУменьшенДолг = УТ_11_4_ВозвратТоваровОтКлиента_ОбновитьРаспределеннуюСуммуРасшифровки(ДокументОбъект);
		Исключение
			СуммаУменьшенДолг = 0;
			Для Каждого СтрокаРасшифровкаПлатежа Из СтруктураПараметров.ФормаДокумента.Объект.РасшифровкаПлатежа Цикл
				Если ЗначениеЗаполнено(СтрокаРасшифровкаПлатежа.Заказ) Тогда
					СуммаУменьшенДолг = СуммаУменьшенДолг + СтрокаРасшифровкаПлатежа.Сумма;
				КонецЕсли;
			КонецЦикла;
		КонецПопытки;
		
		СтруктураПараметров.ФормаДокумента.СуммаВсего 		= СуммаВсего;
		СтруктураПараметров.ФормаДокумента.СуммаКомпенсации = СуммаВсего - СуммаУменьшенДолг;
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ПеремаркировкаТоваровИСМП, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_4_ПеремаркировкаТоваровИСМП_ПослеОткрытияФормыДокумента() Экспорт
	
	ИмяСобытия = "УТ_11_4_ПеремаркировкаТоваровИСМП_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;
	
	Попытка
		
		Форма 						= СтруктураПараметров.ФормаДокумента;
		СсылкаНаДокумент 			= СтруктураПараметров.СсылкаНаДокумент;		
		ДокументОбъект 				= Форма.Объект;		
		
		ДокСтруктура = Новый Структура("СсылкаНаДокумент,ДокументОбъект,СтатусИСМП", СсылкаНаДокумент, ДокументОбъект, Форма.СтатусИСМП);
		АдресХранилища = ПоместитьВоВременноеХранилище(ДокСтруктура);
		Форма.СтатусПредставление 	= ВернутьСтатусДокумента(АдресХранилища);		
		
		Для Каждого Строка из ДокументОбъект.Товары Цикл
			
			Если Не ЗначениеЗаполнено(Строка.ВидДокументаСертификации) Тогда
				Продолжить;
			КонецЕсли;
			
			Строка.Сертификация = УТ_11_4_МаркировкаТоваровИСМП_ПредставлениеСертификации(
				Строка.ВидДокументаСертификации, 
				Строка.НомерДокументаСертификации, 
				Строка.ДатаДокументаСертификации);
				
		КонецЦикла;
		
		Попытка
			КопироватьДанныеФормы(ДокументОбъект, Форма.Объект);				
		Исключение
			// Ничего...
		КонецПопытки;
		
		Форма.Модифицированность = Ложь;
		
	Исключение
		
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
		
	КонецПопытки;

КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ПередачаТоваровМеждуОрганизациями, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_4_ПередачаТоваровМеждуОрганизациями_ПослеОткрытияФормыДокумента	() Экспорт
	
	ИмяСобытия = "УТ_11_4_ПередачаТоваровМеждуОрганизациями_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма = СтруктураПараметров.ФормаДокумента;		
		
		// см. Документ.ПередачаТоваровМеждуОрганизациями.Форма.ФормаДокумента.РассчитатьИтоговыеПоказателиПередачиТоваровМеждуОрганизациями
		Форма.СуммаВсего = Форма.Объект.Товары.Итог("Сумма");
		
		Если Не Форма.Объект.ЦенаВключаетНДС Тогда
			Форма.СуммаВсего = Форма.СуммаВсего + Форма.Объект.Товары.Итог("СуммаНДС");
		КонецЕсли;
		
		Если Не ОбщегоНазначенияКлиент.ОбщийМодуль("УчетНДСУПКлиентСервер").ОтображатьНДСВИтогахДокументаПродажи(Форма.Объект.НалогообложениеНДС) Тогда
			Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница   = Форма.Элементы.СтраницаБезНДС;
			Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоБезНДС;
		Иначе
			Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница   = Форма.Элементы.СтраницаСНДС;
			Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоСНДС;
		КонецЕсли;
		// РассчитатьИтоговыеПоказателиПередачиТоваровМеждуОрганизациями
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Используется для обработки данных и настройки элементов формы документа ВозвратТоваровМеждуОрганизациями, загруженного из базы Mobile Smarts.
//
// Параметры:
//	СтруктураПараметров - Структура - содержит:	
//		* НастройкаБизнесПроцесса - Структура - содержит настройку бизнес-процесса, используемого при загрузке
//		* СсылкаНаДокумент - ДокументСсылка - ссылка на загружаемый документ
//		* ФормаДокумента - ФормаКлиентскогоПриложения - обрабатываемая форма
&НаКлиенте
Процедура УТ_11_4_ВозвратТоваровМеждуОрганизациями_ПослеОткрытияФормыДокумента	() Экспорт
	
	ИмяСобытия = "УТ_11_4_ВозвратТоваровМеждуОрганизациями_ПослеОткрытияФормыДокумента";
	
	СтруктураПараметров = ПередаваемыеПараметры;
	Если СтруктураПараметров = Неопределено Тогда
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", "Ошибка получения структуры параметров в обработчике " + ИмяСобытия);
		Возврат;
	КонецЕсли;

	Попытка
		
		УТ_11_2_Общий_ПослеОткрытияФормыДокумента(СтруктураПараметров);
		
		Форма = СтруктураПараметров.ФормаДокумента;		
		
		// см. Документ.ВозвратТоваровМеждуОрганизациями.Форма.ФормаДокумента.НастроитьИтогиФормы
		Если Не ОбщегоНазначенияКлиент.ОбщийМодуль("УчетНДСУПКлиентСервер").ОтображатьНДСВИтогахДокументаЗакупки(Форма.Объект.НалогообложениеНДС) Тогда
			Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница   = Форма.Элементы.СтраницаБезНДС;
			Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоБезНДС;
		Иначе
			Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница   = Форма.Элементы.СтраницаСНДС;
			Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоСНДС;
		КонецЕсли;
		// НастроитьИтогиФормы
		
		КэшированныеЗначения = Неопределено;
		
		// см. Документ.ВозвратТоваровМеждуОрганизациями.Форма.ФормаДокумента.УстановитьПредставлениеСебестоимостиВСтроке
		ПараметрыОпределенияСебестоимости = Новый Структура;
		ПараметрыОпределенияСебестоимости.Вставить("НалогообложениеНДС", 				Форма.Объект.НалогообложениеНДС);
		ПараметрыОпределенияСебестоимости.Вставить("ВалютаУправленческогоУчета", 		Форма.ВалютаУправленческогоУчета);
		ПараметрыОпределенияСебестоимости.Вставить("ВалютаРегламентированногоУчета", 	Форма.ВалютаРегламентированногоУчета);
		ПараметрыОпределенияСебестоимости.Вставить("ИспользоватьРеглУчет",  			Форма.ИспользоватьРеглУчет);
		
		Для каждого СтрокаДокумента ИЗ Форма.Объект.Товары Цикл
			СтруктураДействий = Новый Структура("ЗаполнитьСпособОпределенияСебестоимостиСтрокой", ПараметрыОпределенияСебестоимости);
			
			Попытка
				ОбщегоНазначенияКлиент.ОбщийМодуль("ОбработкаТабличнойЧастиКлиент").ОбработатьСтрокуТЧ(СтрокаДокумента, СтруктураДействий, КэшированныеЗначения);
			Исключение
				ОбщегоНазначенияКлиент.ОбщийМодуль("ОбработкаТабличнойЧастиТоварыКлиент").ПриИзмененииРеквизитовВТЧКлиент(Форма.Объект.Товары, СтрокаДокумента, СтруктураДействий, Неопределено);
			КонецПопытки;
		КонецЦикла;
		// УстановитьПредставлениеСебестоимостиВСтроке
		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка выполнения обработчика " + ИмяСобытия + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Ошибка", ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьЦенников

// Вызывает окно выбора шаблона этикетки/ценника для последующей печати
//
// Параметры:
//	ДанныеДляПечати - ДанныеФормыКоллекция - содержит данные для печати из формы просмотра документа Mobile Smarts
&НаКлиенте
Процедура ПечатьЦенников(ДанныеДляПечати) Экспорт
	
	ОповещениеВыбораШаблона = Новый ОписаниеОповещения("ПослеВыбораШаблона", ЭтаФорма, ДанныеДляПечати);
	ПоказатьВводЗначения(ОповещениеВыбораШаблона, ПредопределенноеЗначение("Справочник.ШаблоныЭтикетокИЦенников.ПустаяСсылка"), "Выберите шаблон ценника",);	
	
КонецПроцедуры

// Формирует структуру данных для печати этикеток/ценников на основании данных формы просмотра документа Mobile Smarts.
// Открывает форму обработки печати этикеток/ценников и передает в нее полученную структуру данных.
//
// Параметры:
//	ШаблонЦенника - СправочникСсылка.ШаблоныЭтикетокИЦенников - выбранный шаблон этикетки/ценника	
//	ДанныеДляПечати - ДанныеФормыКоллекция - содержит данные для печати из формы просмотра документа Mobile Smarts
&НаКлиенте
Процедура ПослеВыбораШаблона(ШаблонЦенника, ДанныеДляПечати) Экспорт
	
	Если ЗначениеЗаполнено(ШаблонЦенника) Тогда
		
		ПараметрыФормы = ДанныеДляПечати(ДанныеДляПечати, ШаблонЦенника);
		
		Попытка
			
			ФормаКОткрытию = ПолучитьФорму(ПараметрыФормы.ИмяФормыПечати,, ЭтаФорма);
			
			ОбъектФормы = ФормаКОткрытию.Объект;
			ЗаполнитьОбъектПечатиЦенников(ОбъектФормы, ДанныеДляПечати, ШаблонЦенника);
			КопироватьДанныеФормы(ОбъектФормы, ФормаКОткрытию.Объект);
			
			Если ФормаКОткрытию.Объект.Товары.Количество() <> 0 Тогда
				ФормаКОткрытию.Открыть();
			Иначе
				Сообщить("Нет данных для печати");
			КонецЕсли;
			
		Исключение
			
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			Сообщить("Не удалось открыть форму печати ценников. Причина: "
			+ ТекстОшибки);
			
		КонецПопытки;
		
	КонецЕсли;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеДляПечати(ДанныеДляПечати, Шаблон)
			
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьОрганизацию", 					Справочники["Организации"].ОрганизацияПоУмолчанию());
	СтруктураДействий.Вставить("УстановитьРежим", 						"ПечатьЦенников");
	СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе", Ложь);	
	
	СтруктураТовары = Новый Структура;
	СтруктураТовары.Вставить("СтруктураДействий", 	СтруктураДействий);
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("АдресВХранилище", 					ПоместитьВоВременноеХранилище(СтруктураТовары));
	СтруктураПараметры.Вставить("ИмяФормыПечати", 					"Обработка.ПечатьЭтикетокИЦенников.Форма");
	СтруктураПараметры.Вставить("ИмяВОбъектеФормы", 				"Товары");
	СтруктураПараметры.Вставить("ЗакрыватьПриЗакрытииВладельца", 	Истина);	

	Возврат СтруктураПараметры;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьОбъектПечатиЦенников(ОбъектФормы, ДанныеДляПечати, ШаблонЦенника)
	
	ЭтоЦенник = ?(ШаблонЦенника.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров, Истина, Ложь);
	
	ТаблицаДанных = ДанныеФормыВЗначение(ДанныеДляПечати, Тип("ТаблицаЗначений"));
	
	УчетПоХарактеристикам = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	
	КолонкиТаблицыДанных  = ТаблицаДанных.Колонки;
	
	КолонкиТаблицыДанных.Добавить("ХарактеристикиИспользуются", Новый ОписаниеТипов("Булево"));
	
	ЕстьКолонкаЦенаПечать = КолонкиТаблицыДанных.Найти("ЦенаПечать") <> Неопределено;
	ЕстьКолонкаЦена 	  = КолонкиТаблицыДанных.Найти("Цена") <> Неопределено;
	ЕстьКолонкаНовШК 	  = КолонкиТаблицыДанных.Найти("НовШК") <> Неопределено;
	ЕстьКолонкаОснШК 	  = КолонкиТаблицыДанных.Найти("ОснШК") <> Неопределено;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл 		
		
		Если Не СтрокаТаблицы.Флаг Тогда
			Продолжить;
		КонецЕсли;
		
		Цена = 0;
		Если ЕстьКолонкаЦенаПечать И ЗначениеЗаполнено(СтрокаТаблицы.ЦенаПечать) Тогда
			Цена = СтрокаТаблицы.ЦенаПечать;			
		ИначеЕсли ЕстьКолонкаЦена И ЗначениеЗаполнено(СтрокаТаблицы.Цена) Тогда			
			Цена = СтрокаТаблицы.Цена;			
		КонецЕсли;
		
		ШтрихкодТСД = СтрокаТаблицы.ШК;
		Если ЕстьКолонкаНовШК И ЗначениеЗаполнено(СтрокаТаблицы.НовШК) Тогда
			ШтрихкодТСД = СтрокаТаблицы.НовШК;			
		ИначеЕсли ЕстьКолонкаОснШК И ЗначениеЗаполнено(СтрокаТаблицы.ОснШК) Тогда			
			ШтрихкодТСД = СтрокаТаблицы.ОснШК;			
		КонецЕсли;
		
		СтрокаТаблицы.ХарактеристикиИспользуются = УчетПоХарактеристикам И ЗначениеЗаполнено(СтрокаТаблицы.Характеристика);
		
		НоваяСтрокаТовары = ОбъектФормы.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары, СтрокаТаблицы);
		НоваяСтрокаТовары.Выбран 				= Истина;
		НоваяСтрокаТовары.Характеристика 		= ?(УчетПоХарактеристикам, НоваяСтрокаТовары.Характеристика, ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
		НоваяСтрокаТовары.ШтрихКод 				= ШтрихкодТСД;
		НоваяСтрокаТовары.Цена 					= Цена;		
		Если ЭтоЦенник Тогда
		НоваяСтрокаТовары.ШаблонЦенника 		= ШаблонЦенника; 
		НоваяСтрокаТовары.КоличествоЦенников 	= СтрокаТаблицы.КоличествоФакт;
		Иначе	
		НоваяСтрокаТовары.ШаблонЭтикетки 		= ШаблонЦенника; 
		НоваяСтрокаТовары.КоличествоЭтикеток 	= СтрокаТаблицы.КоличествоФакт;
	КонецЕсли;
		
	КонецЦикла;
	
	//Для Каждого СтрокаТовары Из ОбъектФормы.Товары Цикл
	//	НоваяСтрока = 
	//КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПараметрыУказанияСерий(ДокументОбъект)
	
	Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИС").ПараметрыУказанияСерийФормыОбъекта(ДокументОбъект ,Документы[ПолучитьИмяТипаДокумента(ДокументОбъект.Ссылка)]);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИмяТипаДокумента(Документ)
	
	Если ТипЗнч(Документ) = Тип("ДанныеФормыСтруктура") Тогда
		Документ = Документ.Ссылка;
	КонецЕсли;
	
	Возврат Документ.Метаданные().Имя;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивИменТабличныхЧастейТовары(Знач ДанныеФормы, ТипЗначения)
	
	МассивИменТабличныхЧастейТовары = Новый Массив;
	
	ДокументОбъект = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект." + ТипЗначения));
	Для каждого ТабличнаяЧасть из ДокументОбъект.Метаданные().ТабличныеЧасти Цикл
		Если Найти(ВРег(СокрЛП(ТабличнаяЧасть.Имя)), ВРег(СокрЛП("Товары"))) Тогда
			МассивИменТабличныхЧастейТовары.Добавить(ТабличнаяЧасть.Имя);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат МассивИменТабличныхЧастейТовары;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначенияРеквизитовМассиваОбъектов(ИмяСправочника, МассивСсылок, СписокИменРеквизитов)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	*
	                      |ИЗ
	                      |	Справочник.ИмяСправочника КАК ИмяСправочника
	                      |ГДЕ
	                      |	Ссылка В ИЕРАРХИИ (&МассивСсылок)");
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);	
	
	СписокРеквизитов = "Ссылка";
	Для каждого ИмяРеквизита Из СписокИменРеквизитов Цикл		
		СписокРеквизитов = СписокРеквизитов + ", " + ИмяРеквизита.Значение + " КАК " + ИмяРеквизита.Представление;
	КонецЦикла; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "*", СписокРеквизитов);	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяСправочника", ИмяСправочника);	
	
	РезультатЗапроса 	= Запрос.Выполнить();
	КолонкиВыборки 		= РезультатЗапроса.Колонки;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СоответствиеСсылокИРеквизитов = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		
		СтруктураРеквизитов = Новый Структура;
		
		Для каждого Колонка Из КолонкиВыборки Цикл	
			СтруктураРеквизитов.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);		
		КонецЦикла; 
		
		СоответствиеСсылокИРеквизитов.Вставить(Выборка.Ссылка, СтруктураРеквизитов);
		
	КонецЦикла; 
	
	Возврат СоответствиеСсылокИРеквизитов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьФункциональнуюОпциюНаСервере(ИмяФункциональнойОпции)
	
	Если Метаданные.ФункциональныеОпции.Найти(ИмяФункциональнойОпции) <> Неопределено Тогда
		Возврат ПолучитьФункциональнуюОпцию(ИмяФункциональнойОпции);
	Иначе
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции

&НаСервереБезКонтекста
Функция ГлЯдро_ТаблицуЗначенийВМассивСтруктур(ТаблицаЗначений) Экспорт
	
	Если ТипЗнч(ТаблицаЗначений) = Тип("Массив") Тогда
		Возврат ТаблицаЗначений;
	КонецЕсли;
	
	Массив = Новый Массив();
	
	Если ТипЗнч(ТаблицаЗначений) <> Тип("ТаблицаЗначений") И ТипЗнч(ТаблицаЗначений) <> Тип("ДеревоЗначений") Тогда
	    Возврат Массив;
	КонецЕсли; 

	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	
	СтруктураСтрокой = СтруктураСтрокой;
	
	ОписаниеТаблицыЗначений = Новый Структура("ЭтоТаблицаЗначений, КолонкиТаблицыЗначений", Истина, СтруктураСтрокой); 
	Массив.Добавить(ОписаниеТаблицыЗначений);
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Для каждого ЭлементСтруктуры Из НоваяСтрока Цикл
		
			Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
				НоваяСтрока.Вставить(ЭлементСтруктуры.Ключ, ГлЯдро_ТаблицуЗначенийВМассивСтруктур(ЭлементСтруктуры.Значение));
			КонецЕсли; 
		
		КонецЦикла; 
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Возврат Массив;

КонецФункции

&НаКлиенте
Процедура УТ_11_2_УстановитьВидимостьЭлементовСерий(ДокументОбъект, Элементы, ПараметрыУказанияСерий, ТипДокументаСтрокой)
	
	Если ПараметрыУказанияСерий.Свойство("Шапка") И
		ПараметрыУказанияСерий.Свойство("ТЧ") Тогда
		
		Если Элементы.Найти("ТоварыСтатусУказанияСерий") <> Неопределено Тогда
			Элементы.ТоварыСтатусУказанияСерий.Видимость 	= ПараметрыУказанияСерий.ТЧ.ИспользоватьСерииНоменклатуры;
		КонецЕсли;
		
		Если Элементы.Найти("ТоварыУказатьСерии") <> Неопределено Тогда	
			Элементы.ТоварыУказатьСерии.Видимость 			= ПараметрыУказанияСерий.ТЧ.ИспользоватьСерииНоменклатуры;
		КонецЕсли;	
		
		Если Элементы.Найти("ТоварыСерия") <> Неопределено Тогда
			Элементы.ТоварыСерия.Видимость               	= ПараметрыУказанияСерий.ТЧ.ИспользоватьСерииНоменклатуры;
		КонецЕсли;	
		
		Если Элементы.Найти("УказатьСерииВШапке") <> Неопределено Тогда
			Элементы.УказатьСерииВШапке.Видимость 			= ПараметрыУказанияСерий.Шапка.ИспользоватьСерииНоменклатуры;
			УстановитьДоступностьСерииВШапке(ДокументОбъект, Элементы);
		КонецЕсли;
		
		Если Элементы.Найти("СтатусУказанияСерий") <> Неопределено Тогда	
			Элементы.СтатусУказанияСерий.Видимость 			= ПараметрыУказанияСерий.Шапка.ИспользоватьСерииНоменклатуры;
		КонецЕсли;	
		
		Если Элементы.Найти("Серия") <> Неопределено Тогда
			Элементы.Серия.Видимость 						= ПараметрыУказанияСерий.Шапка.ИспользоватьСерииНоменклатуры;
		КонецЕсли;	
		
		Если Элементы.Найти("ТоварыЗаполнитьСерииПоFEFO") <> Неопределено Тогда
			Элементы.ТоварыЗаполнитьСерииПоFEFO.Видимость 	= ПараметрыУказанияСерий.ТЧ.ИспользоватьСерииНоменклатуры;
		КонецЕсли;	
		
	Иначе
		Если Элементы.Найти("ТоварыСтатусУказанияСерий") <> Неопределено Тогда
			Элементы.ТоварыСтатусУказанияСерий.Видимость = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
		КонецЕсли;
		
		Если Элементы.Найти("ТоварыУказатьСерии") <> Неопределено Тогда	
			Элементы.ТоварыУказатьСерии.Видимость        = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
		КонецЕсли;	
		
		Если Элементы.Найти("ТоварыСерия") <> Неопределено Тогда
			Если ТипДокументаСтрокой = "ПриобретениеТоваровУслуг" Тогда
				Элементы.ТоварыСерия.Видимость               = ПараметрыУказанияСерий.УчитыватьСебестоимостьПоСериям;
			Иначе
				Элементы.ТоварыСерия.Видимость               = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция УТ_11_2_ПодготовитьЗаполнитьУстановитьВидимостьСерий(Объект, ТипДокумента)
	
	//ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(Вычислить("НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы[ТипДокумента])"));
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(ОбщегоНазначения.ОбщийМодуль("НоменклатураСервер").ПараметрыУказанияСерий(Объект, Документы[ТипДокумента]));
	
	//Выполнить("НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);");	
	Если ПараметрыУказанияСерий.Свойство("Шапка") Или
		ПараметрыУказанияСерий.Свойство("ТЧ") Тогда
		Если ПараметрыУказанияСерий.Свойство("Шапка") Тогда
			ОбщегоНазначения.ОбщийМодуль("НоменклатураСервер").ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий.Шапка);
		КонецЕсли;
		Если ПараметрыУказанияСерий.Свойство("ТЧ") Тогда
			ОбщегоНазначения.ОбщийМодуль("НоменклатураСервер").ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий.ТЧ);
		КонецЕсли;
	Иначе
		ОбщегоНазначения.ОбщийМодуль("НоменклатураСервер").ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	КонецЕсли;
	
	Возврат ПараметрыУказанияСерий;
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьСерииВШапке(Объект, Элементы)
	Если Объект.СтатусУказанияСерий = 14
		Или Объект.СтатусУказанияСерий = 13 Тогда
		Элементы.Серия.Доступность = Истина;
		Элементы.Серия.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.Серия.Доступность = Ложь;
		Элементы.Серия.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	Элементы.УказатьСерииВШапке.Доступность = Объект.СтатусУказанияСерий <> 0;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УТ_11_2_ЗаполнитьКИЗ(ДанныеОбъекта, СписокНоменклатураКиЗ)

	//Выполнить("МаркировкаТоваровГИСМПереопределяемый.ПолучитьКиЗДляЗаполнения(ДанныеОбъекта, СписокНоменклатураКиЗ);");
	ОбщегоНазначения.ОбщийМодуль("МаркировкаТоваровГИСМПереопределяемый").ПолучитьКиЗДляЗаполнения(ДанныеОбъекта, СписокНоменклатураКиЗ);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита)
	
	Попытка
		Значение = Ссылка[ИмяРеквизита]			
	Исключение
		Значение = Неопределено;
	КонецПопытки; 
	
	Возврат Значение;
	
КонецФункции

&НаСервереБезКонтекста
Функция УТ_11_4_ПолучитьЗначенияПеречисления(ИмяПеречисления)
	
	// Выгружаем значения перечислений в массив, т.к. они требуются на клиенте
	СписокЗначенийПеречисления = Новый Массив;	
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления Цикл	
		СписокЗначенийПеречисления.Добавить(ЗначениеПеречисления.Имя);
	КонецЦикла;
	
	Возврат СписокЗначенийПеречисления;
	
КонецФункции

&НаКлиенте
Функция ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, ИмяВидаПродукции)

	Возврат НЕ ЗначенияПеречисления.Найти(ИмяВидаПродукции) = Неопределено 
		И ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС." + ИмяВидаПродукции);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УТ_11_4_ЗаказНаЭмиссиюКодовМаркировкиСУЗ_ЭтоРасширеннаяМаркировкаОстатковЛегкойПромышленности(Форма)
	
	Если Форма.ЭтоМаркировкаОстатков
		И Форма.Объект.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ЛегкаяПромышленность")
		И Не Форма.Объект.Ссылка.Пустая() Тогда
		
		Если Форма.Объект.БезУчетаНоменклатуры
			Или Форма.Объект.ВвезенПослеДатыОбязательнойМаркировки
			Или Форма.Объект.ПриобретенПроизведенПослеДатыОбязательнойМаркировки Тогда
				Возврат Истина;
		КонецЕсли;
		
		Для Каждого Строка Из Форма.Объект.Товары Цикл
			Если ЗначениеЗаполнено(Строка.КодТНВЭД)
				Или ЗначениеЗаполнено(Строка.ЦелевойПол)
				Или ЗначениеЗаполнено(Строка.ВозрастнаяКатегория)
				Или ЗначениеЗаполнено(Строка.СпособВводаВОборот) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура УТ_11_4_МаркировкаТоваровИСМП_ЗаполнитьДоступныеОперации(Форма)
	
	ДокументОбъект = Форма.Объект;
	ЭлементыФормы  = Форма.Элементы;
	
	Попытка
		ДоступныОперацииНанесения = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ВидПродукцииИспользуетОтчетыОНанесенииКодовМаркировки(ДокументОбъект.ВидПродукции);
	Исключение
		// адаптация к старым релизам
		ДоступныОперацииНанесения = Ложь;	
	КонецПопытки;
	Попытка
		ДоступноПолучениеПродукцииОтФизическихЛиц = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ВидПродукцииИспользуетПолучениеПродукцииОтФизическихЛиц(ДокументОбъект.ВидПродукции);
	Исключение
		// адаптация к старым релизам
		ДоступноПолучениеПродукцииОтФизическихЛиц = Ложь;	
	КонецПопытки;
	
	ЗначенияПеречисленияВидыПродукцииИС = УТ_11_4_ПолучитьЗначенияПеречисления("ВидыПродукцииИС");
	
	Попытка
		ЭтоПродукцияПодконтрольнаяВЕТИС = ИнтеграцияИСКлиентСервер_ЭтоПродукцияПодконтрольнаяВЕТИС(ДокументОбъект.ВидПродукции);
	Исключение
		// адаптация к старым релизам
		ЭтоПродукцияПодконтрольнаяВЕТИС = ЗначенияПеречисленияВидыПродукцииИС.Найти("МолочнаяПродукцияПодконтрольнаяВЕТИС") <> Неопределено
			И ДокументОбъект.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС");
	КонецПопытки;
	
	ЭтоОбувь = ИСМП_ЭтоВидПродукции(ЗначенияПеречисленияВидыПродукцииИС, ДокументОбъект.ВидПродукции, "Обувь");
	ЭтоМех   = ИСМП_ЭтоВидПродукции(ЗначенияПеречисленияВидыПродукцииИС, ДокументОбъект.ВидПродукции, "ПродукцияИзНатуральногоМеха");
	ЭтоПиво  = ИСМП_ЭтоВидПродукции(ЗначенияПеречисленияВидыПродукцииИС, ДокументОбъект.ВидПродукции, "Пиво")
		ИЛИ ИСМП_ЭтоВидПродукции(ЗначенияПеречисленияВидыПродукцииИС, ДокументОбъект.ВидПродукции, "ПивоВПотребительскихУпаковках");
	ЭтоТитановаяПродукция = ИСМП_ЭтоВидПродукции(ЗначенияПеречисленияВидыПродукцииИС, ДокументОбъект.ВидПродукции, "ТитановаяМеталлопродукция");
	
	ЭлементыФормы.Операция.СписокВыбора.Очистить();
	ЭлементыФормы.ОперацияНанесения.СписокВыбора.Очистить();
	
	Если ЭлементыФормы.Найти("ВариантВыполненияАгрегации") <> Неопределено Тогда
		ЭлементыФормы.ВариантВыполненияАгрегации.СписокВыбора.Очистить();
	КонецЕсли;
	
	ИспользуетсяПодсистемаВЕТИС = УТ_11_4_МаркировкаТоваровИСМП_ИспользуетсяПодсистемаВетИС();
	
	Попытка	
		ОперацииНанесенияКодовМаркировки = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ОперацииНанесенияКодовМаркировки(Ложь, ЭтоМех);
	Исключение
		ОперацииНанесенияКодовМаркировки = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ОперацииНанесенияКодовМаркировки();
	КонецПопытки;
	
	Если ДоступныОперацииНанесения
		И (ИспользуетсяПодсистемаВЕТИС Или Не ЭтоПродукцияПодконтрольнаяВЕТИС) Тогда
		
		Для Каждого ОперацияНанесения Из ОперацииНанесенияКодовМаркировки Цикл
			ЭлементыФормы.Операция.СписокВыбора.Добавить(ОперацияНанесения);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ЭтоМех И Не ЭтоТитановаяПродукция Тогда
		ЭлементыФормы.Операция.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.Агрегация"));
	КонецЕсли;
		
	Если УТ_11_4_МаркировкаТоваровИСМП_ЭтоПродукцияИСМП(ДокументОбъект.ВидПродукции) Тогда
		
		Если УТ_11_4_МаркировкаТоваровИСМП_ВидыПродукцииОперацииПроизводствоВнеЕАЭС(ЗначенияПеречисленияВидыПродукцииИС).Получить(ДокументОбъект.ВидПродукции) <> Неопределено Тогда
			ЭлементыФормы.Операция.СписокВыбора.Добавить(
				ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС"));
		КонецЕсли;
		
		ЭлементыФормы.Операция.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоРФ"));
		
		Если УТ_11_4_МаркировкаТоваровИСМП_ВидыПродукцииОперацииИмпортСФТС(ЗначенияПеречисленияВидыПродукцииИС).Получить(ДокументОбъект.ВидПродукции) <> Неопределено Тогда
			ЭлементыФормы.Операция.СписокВыбора.Добавить(
				ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотИмпортСФТС"));
		ИначеЕсли ЭтоМех Тогда
			ЭлементыФормы.Операция.СписокВыбора.Добавить(
				ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотИмпортСФТСМех"));
			ЭлементыФормы.Операция.СписокВыбора.Добавить(
				ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗ"));
		КонецЕсли;
		
		Если ДоступныОперацииНанесения Тогда
			
			ЭлементыФормы.ОперацияНанесения.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ПустаяСсылка"),
				НСтр("ru = '<Выполнена независимо>'"));
			Для Каждого ОперацияНанесения Из ОперацииНанесенияКодовМаркировки Цикл
				ЭлементыФормы.ОперацияНанесения.СписокВыбора.Добавить(ОперацияНанесения);
			КонецЦикла;
		
		КонецЕсли;
		
		ИспользуетсяПереработкаНаСтороне = Истина;
		Попытка
			ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМППереопределяемый").ИспользуетсяПереработкаНаСтороне(ИспользуетсяПереработкаНаСтороне);
		Исключение
			// адаптация к старым релизам
		КонецПопытки;
		
		ЭлементыФормы.Операция.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговору"));
		
		Если ИспользуетсяПереработкаНаСтороне Тогда
			ЭлементыФормы.Операция.СписокВыбора.Добавить(
				ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика"));
		КонецЕсли;
		
		Если ДоступноПолучениеПродукцииОтФизическихЛиц Тогда
			ЭлементыФормы.Операция.СписокВыбора.Добавить(
				ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПолучениеПродукцииОтФизическихЛиц"));
		КонецЕсли;
		
		// Недоступно для отчетов производственной линии: требует цены/суммы
		Если (ИспользуетсяПодсистемаВЕТИС Или Не ЭтоПродукцияПодконтрольнаяВЕТИС) И Не ЭтоМех И Не ЭтоТитановаяПродукция Тогда
			ЭлементыФормы.Операция.СписокВыбора.Добавить(
				ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля"));
		КонецЕсли;
		
		Попытка
			ВидПродукцииПодлежитМаркировкеОстатков = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ВидПродукцииПодлежитМаркировкеОстатков(ДокументОбъект.ВидПродукции);
		Исключение
			// адаптация к старым режимам
			ВидПродукцииПодлежитМаркировкеОстатков = Ложь;	
		КонецПопытки;		
		
		Если ВидПродукцииПодлежитМаркировкеОстатков Тогда
			ЭлементыФормы.Операция.СписокВыбора.Добавить(
				ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков"));
		КонецЕсли;
		
		Если ЭлементыФормы.Найти("ВариантВыполненияАгрегации") <> Неопределено Тогда
			ЭлементыФормы.ВариантВыполненияАгрегации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыВыполненияАгрегацииИСМП.ПустаяСсылка"),
				НСтр("ru = 'После ввода в оборот'"));
			ЭлементыФормы.ВариантВыполненияАгрегации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыВыполненияАгрегацииИСМП.ПередВводомВОборот"));
			ЭлементыФормы.ВариантВыполненияАгрегации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыВыполненияАгрегацииИСМП.НеТребуется"));
		КонецЕсли;
		
	ИначеЕсли ЭтоПиво Тогда
		
		ЭлементыФормы.Операция.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотИмпортСФТС"));
		
		ЭлементыФормы.Операция.СписокВыбора.Добавить(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля"));
		
		Если ДоступныОперацииНанесения Тогда
			
			ЭлементыФормы.ОперацияНанесения.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыВыполненияАгрегацииИСМП.ПустаяСсылка"),
				НСтр("ru = '<Выполнена независимо>'"));
			Для Каждого ОперацияНанесения Из ОперацииНанесенияКодовМаркировки Цикл
				ЭлементыФормы.ОперацияНанесения.СписокВыбора.Добавить(ОперацияНанесения);
			КонецЦикла;
		
		КонецЕсли;
	
	КонецЕсли;
	
	Попытка
		Для Каждого ЭлементСписка Из ЭлементыФормы.Операция.СписокВыбора Цикл
			ЭлементСписка.Представление = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ПредставлениеВидаОперацииИСМП(ЭлементСписка.Значение);
		КонецЦикла;
	Исключение
		// адаптация к старым релизам
	КонецПопытки;
	
	ЭлементыФормы.Операция.СписокВыбора.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УТ_11_4_МаркировкаТоваровИСМП_ИспользуетсяПодсистемаВЕТИС() 

	Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСМПВЕТИС").ИспользуетсяПодсистемаВетИС();
	
КонецФункции

&НаСервере
Функция УТ_11_4_МаркировкаТоваровИСМП_ЭтоПродукцияИСМП(ВидПродукции)

	Попытка
		ЭтоПродукцияИСМП = ИнтеграцияИСПовтИсп_ЭтоПродукцияИСМП(ВидПродукции, Ложь, Истина, Ложь);
	Исключение
		// адаптация к старым релизам
		ЭтоПродукцияИСМП = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСПовтИсп").ЭтоПродукцияИСМП(ВидПродукции, Ложь, Истина);
	КонецПопытки;
	
	Возврат ЭтоПродукцияИСМП;

КонецФункции

&НаКлиенте
Функция УТ_11_4_МаркировкаТоваровИСМП_ПредставлениеСертификации(ВидСертификации, НомерСертификации, ДатаСертификации)
		
	Если ЗначениеЗаполнено(ВидСертификации)
		И ЗначениеЗаполнено(НомерСертификации)
		И ЗначениеЗаполнено(ДатаСертификации) Тогда
		
		ПредставлениеСертификата = 
			"" + ВидСертификации + " №" +
			НомерСертификации + " от " +
			Формат(ДатаСертификации, "ДФ=dd.MM.yyyy");
		
	КонецЕсли;
	
	Возврат ПредставлениеСертификата;
	
КонецФункции

&НаКлиенте
Процедура УТ_11_4_МаркировкаТоваровИСМП_НастроитьЭлементыФормы(Форма)
	
	ЭлементыФормы              = Форма.Элементы;
	Операция                   = Форма.Объект.Операция;
	ОперацияНанесения          = Форма.Объект.ОперацияНанесения;
	ОтчетПроизводственнойЛинии = Форма.Объект.ОтчетПроизводственнойЛинии;
	ВидПродукции               = Форма.Объект.ВидПродукции;
	ПередаватьВДекларациюАТК   = Форма.Объект.ВариантЗаполненияДекларации = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДекларацииИСМП.АТК");
	
	Попытка
		ПроверятьСоставУпаковокПоДаннымИСМП = Форма.Объект.ПроверятьСоставУпаковокПоДаннымИСМП;
	Исключение
		// Адаптация к старым режимам
		ПроверятьСоставУпаковокПоДаннымИСМП = Ложь;
	КонецПопытки;
	
	ОперацииМаркировки = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПСлужебныйКлиентСервер").ОперацииМаркировки(Операция);
	ЭтоПроизводствоРФ                           = ОперацииМаркировки.Свойство("ЭтоПроизводствоРФ") И ОперацииМаркировки.ЭтоПроизводствоРФ;
	ЭтоПроизводствоВнеЕАЭС                      = ОперацииМаркировки.Свойство("ЭтоПроизводствоВнеЕАЭС") И ОперацииМаркировки.ЭтоПроизводствоВнеЕАЭС;
	ЭтоПроизводствоПоДоговору                   = ОперацииМаркировки.Свойство("ЭтоПроизводствоПоДоговору") И ОперацииМаркировки.ЭтоПроизводствоПоДоговору;
	ЭтоПроизводствоПоДоговоруНаСторонеЗаказчика = ОперацииМаркировки.Свойство("ЭтоПроизводствоПоДоговоруНаСторонеЗаказчика") И ОперацииМаркировки.ЭтоПроизводствоПоДоговоруНаСторонеЗаказчика;
	ЭтоПолучениеПродукцииОтФизическихЛиц        = ОперацииМаркировки.Свойство("ЭтоПолучениеПродукцииОтФизическихЛиц") И ОперацииМаркировки.ЭтоПолучениеПродукцииОтФизическихЛиц;
	ЭтоМаркировкаОстатков                       = ОперацииМаркировки.Свойство("ЭтоМаркировкаОстатков") И ОперацииМаркировки.ЭтоМаркировкаОстатков;
	ЭтоТрансграничнаяТорговля                   = ОперацииМаркировки.Свойство("ЭтоТрансграничнаяТорговля") И ОперацииМаркировки.ЭтоТрансграничнаяТорговля;
	ЭтоАгрегация                                = ОперацииМаркировки.Свойство("ЭтоАгрегация") И ОперацииМаркировки.ЭтоАгрегация;
	ЭтоИмпортСФТС                               = ОперацииМаркировки.Свойство("ЭтоИмпортСФТС") И ОперацииМаркировки.ЭтоИмпортСФТС;
	ЭтоВводВОборот                              = ОперацииМаркировки.Свойство("ЭтоВводВОборот") И ОперацииМаркировки.ЭтоВводВОборот;
	ЭтоКонтрактноеПроизводство                  = ОперацииМаркировки.Свойство("ЭтоКонтрактноеПроизводство") И ОперацииМаркировки.ЭтоКонтрактноеПроизводство;
	ЭтоПриемкаКИЗ                               = ОперацииМаркировки.Свойство("ЭтоПриемкаКИЗ") И ОперацииМаркировки.ЭтоПриемкаКИЗ;
	
	ЗначенияПеречисления = УТ_11_4_ПолучитьЗначенияПеречисления("ВидыПродукцииИС");
	
	ЭтоТабак                     = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "Табак");
	ЭтоМолочнаяПродукцияВЕТИС    = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "МолочнаяПродукцияПодконтрольнаяВЕТИС");
	ЭтоМолочнаяПродукцияБезВЕТИС = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "МолочнаяПродукцияБезВЕТИС");
	ЭтоМолочнаяПродукция         = ЭтоМолочнаяПродукцияБезВЕТИС Или ЭтоМолочнаяПродукцияВЕТИС;
	ЭтоПродукцияМОТП             = ИнтеграцияИСКлиентСервер_ЭтоПродукцияМОТП(ВидПродукции);
	ЭтоУпакованнаяВода           = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "УпакованнаяВода");
	ЭтоПиво                      = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "Пиво")
		ИЛИ ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "ПивоВПотребительскихУпаковках");
	ЭтоБАПиво                    = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "БезалкогольноеПиво");
	ЭтоБАД                       = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "БАДы")
		ИЛИ ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "БАДы2025");
	ЭтоМех                       = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "ПродукцияИзНатуральногоМеха");
	ЭтоШины                      = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "Шины");
	ЭтоКреслаКоляски             = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "КреслаКоляски")
		ИЛИ ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "ТехническиеСредстваРеабилитации")
		ИЛИ ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "МедицинскиеИзделия")
		ИЛИ ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "МедицинскиеИзделия20");
	ЭтоМорепродукты              = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "МорепродуктыПодконтрольныеВЕТИС");
	ЭтоВетеринарныеПрепараты     = ИСМП_ЭтоВидПродукции(ЗначенияПеречисления, ВидПродукции, "ВетеринарныеПрепараты");
	
	Попытка
		ЭтоПродукцияПодконтрольнаяВЕТИС = ИнтеграцияИСКлиентСервер_ЭтоПродукцияПодконтрольнаяВЕТИС(ВидПродукции);
	Исключение
		// Адаптация к старым релизам
		ЭтоПродукцияПодконтрольнаяВЕТИС	= ЭтоМолочнаяПродукцияВЕТИС ИЛИ ЭтоМорепродукты;
	КонецПопытки;
	
	// Перенесено выше по коду для определения использования срока годности/даты производства в старых релизах
	ВозможнаОперацияНанесения = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ВидПродукцииИспользуетОтчетыОНанесенииКодовМаркировки(ВидПродукции);
	ЭтоОперацияНанесения =
		ОперацииМаркировки.ЭтоОперацияНанесения
		Или (ЭтоПродукцияПодконтрольнаяВЕТИС И Не Форма.ИспользуетсяПодсистемаВЕТИС);
	
	ПрисутствуетОперацияНанесения = ЗначениеЗаполнено(Форма.Объект.ОперацияНанесения) Или ЭтоОперацияНанесения;
	ДоступнаОперацияНанесенияПоВидуОперацииИСМП = УТ_11_4_МаркировкаТоваровИСМП_ДоступнаОперацияНанесенияПоВидуОперацииИСМП(Операция);
	
	Попытка
		ЭтоПродукцияСоСрокамиГодности = ИнтеграцияИСМПКлиентСервер_ЭтоВидПродукцииСоСрокамиГодности(ВидПродукции);
		ДляВидаПродукцииИспользуетсяДатаПроизводства = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ДляВидаПродукцииИспользуетсяДатаПроизводства(ВидПродукции);
	Исключение
		// Адаптация к старым релизам	
		ЭтоПродукцияСоСрокамиГодности = ПрисутствуетОперацияНанесения И (ЭтоМолочнаяПродукция Или ЭтоБАД Или ЭтоПиво Или ЭтоБАПиво);
		ДляВидаПродукцииИспользуетсяДатаПроизводства = ЭтоОперацияНанесения И (ЭтоБАД Или ЭтоПиво Или ЭтоБАПиво);
	КонецПопытки;
	
	ПроверятьСоставУпаковокПоДаннымИСМП = ПроверятьСоставУпаковокПоДаннымИСМП И ЭтоАгрегация И ЭтоПродукцияМОТП;
	
	Попытка
		ТребуетсяУказатьДанныеДекларации = УТ_11_4_МаркировкаТоваровИСМП_ТребуетсяУказатьДанныеДекларации(Форма);
		Если ТребуетсяУказатьДанныеДекларации Тогда
			ЭлементыФормы.РегистрационныйНомерДекларации.АвтоОтметкаНезаполненного = Истина;
			ЭлементыФормы.ДатаДекларации.АвтоОтметкаНезаполненного                 = Истина;
			ЭлементыФормы.ПринятоеРешениеПолеВвода.АвтоОтметкаНезаполненного       = Истина;
			ЭлементыФормы.КодТаможенногоОргана.АвтоОтметкаНезаполненного           = Истина;
		Иначе
			ЭлементыФормы.РегистрационныйНомерДекларации.АвтоОтметкаНезаполненного = Ложь;
			ЭлементыФормы.ДатаДекларации.АвтоОтметкаНезаполненного                 = Ложь;
			ЭлементыФормы.ПринятоеРешениеПолеВвода.АвтоОтметкаНезаполненного       = Ложь;
			ЭлементыФормы.КодТаможенногоОргана.АвтоОтметкаНезаполненного           = Ложь;
		КонецЕсли;
	Исключение
		// Адаптация к старым релизам
		ТребуетсяУказатьДанныеДекларации = Ложь;
	КонецПопытки;
	
	Если ЭтоПродукцияПодконтрольнаяВЕТИС И Не Форма.ИспользуетсяПодсистемаВЕТИС Тогда
		ОтчетПроизводственнойЛинии = Истина;
	КонецЕсли;
	
	ДоступенОтчетПроизводственнойЛинии = УТ_11_4_МаркировкаТоваровИСМП_ОпределитьДоступностьОтчетаПроизводственнойЛинии(
		ВидПродукции, ОперацииМаркировки, ОперацияНанесения, ЗначенияПеречисления);
	
	ОтчетПроизводственнойЛинии = ОтчетПроизводственнойЛинии И ДоступенОтчетПроизводственнойЛинии;
	
	УказаниеРеквизитовНанесенияНаПиво = ПрисутствуетОперацияНанесения И ЭтоПиво;
	
	Попытка
		ЭлементыФормы.ОтчетПроизводственнойЛинии.Видимость       = ДоступенОтчетПроизводственнойЛинии;
		Форма.Объект.ОтчетПроизводственнойЛинии             	 = ОтчетПроизводственнойЛинии;
		ЭлементыФормы.ОтчетПроизводственнойЛинии.ТолькоПросмотр  = Ложь;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Попытка
		ВидПродукцииИспользуетНаборы            = ИнтеграцияИСКлиентСервер_ВидПродукцииИспользуетНаборы(ВидПродукции);
		ВидПродукцииИспользуетГрупповыеУпаковки = ИнтеграцияИСКлиентСервер_ВидПродукцииИспользуетГрупповыеУпаковки(ВидПродукции);
		
		КомплектующиеМогутБытьНанесеныНезависимо = ВидПродукцииИспользуетНаборы Или ВидПродукцииИспользуетГрупповыеУпаковки И Не ЭтоТабак;
		ЭлементыФормы.ОперацияНанесенияТолькоДляНаборов.Доступность = ЗначениеЗаполнено(Форма.Объект.ОперацияНанесения);
		ЭлементыФормы.ОперацияНанесенияТолькоДляНаборов.Видимость   = КомплектующиеМогутБытьНанесеныНезависимо И Не ЭтоИмпортСФТС;
		ЭлементыФормы.ОперацияТолькоДляНаборов.Видимость            = КомплектующиеМогутБытьНанесеныНезависимо И ЭтоОперацияНанесения;
	Исключение
		// Адаптация к старым релизам
		ВидПродукцииИспользуетНаборы			 = Ложь;
		ВидПродукцииИспользуетГрупповыеУпаковки	 = Ложь;
		КомплектующиеМогутБытьНанесеныНезависимо = Ложь;
	КонецПопытки;
	
	Попытка
		ЭлементыФормы.Номенклатура.АвтоОтметкаНезаполненного = ОтчетПроизводственнойЛинии И (ЭтоИмпортСФТС Или Форма.Объект.СоздаватьШтрихкодыУпаковок);
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	ЭлементыФормы.ТоварыЗагрузитьДанныеИзТСД.Видимость     = Не ЭтоАгрегация;
	ЭлементыФормы.ТоварыЗагрузитьИзВнешнегоФайла.Видимость = Не ЭтоАгрегация;
	
	ЭлементыФормы.ДатаДекларации.Видимость                 = ЭтоПроизводствоВнеЕАЭС Или ЭтоИмпортСФТС;
	ЭлементыФормы.ДатаДекларацииЗаголовок.Видимость        = ЭтоПроизводствоВнеЕАЭС Или ЭтоИмпортСФТС;
	
	ЭлементыФормы.РегистрационныйНомерДекларации.Видимость = ЭтоПроизводствоВнеЕАЭС Или ЭтоИмпортСФТС;
	ЭлементыФормы.ВариантЗаполненияДекларации.Видимость    = ЭтоИмпортСФТС И Не ЭтоМех;
	ЭлементыФормы.ВариантФормированияАТКИСМП.Видимость     = ЭтоИмпортСФТС И Не ЭтоМех;
	ЭлементыФормы.ВариантФормированияАТКИСМП.Доступность   = ЭтоИмпортСФТС И ПередаватьВДекларациюАТК И Не ЭтоМех;
	
	ЭлементыФормы.КодТаможенногоОргана.Видимость           = ЭтоПроизводствоВнеЕАЭС Или ЭтоИмпортСФТС;
	ЭлементыФормы.КодТаможенногоОрганаЗаголовок.Видимость  = ЭтоПроизводствоВнеЕАЭС Или ЭтоИмпортСФТС;
	
	ЭлементыФормы.ПринятоеРешение.Видимость                = ЭтоПроизводствоВнеЕАЭС Или ЭтоИмпортСФТС;
	ЭлементыФормы.СтранаПроисхождения.Видимость            = ЭтоТрансграничнаяТорговля;
	ЭлементыФормы.ТоварыСтранаПроизводства.Видимость       = ЭтоМаркировкаОстатков;
	ЭлементыФормы.ТоварыТаможеннаяДекларация.Видимость     = ЭтоМаркировкаОстатков;
	ЭлементыФормы.ЗаполнитьПараметрыТовары.Видимость       = ЭтоМаркировкаОстатков;
	ЭлементыФормы.ТоварыGTIN.Видимость                     = ЭтоМаркировкаОстатков Или ЭтоАгрегация Или (ЭтоОперацияНанесения И ЭтоТабак);
	ЭлементыФормы.ДатаИмпорта.Видимость                    = ЭтоТрансграничнаяТорговля;
	ЭлементыФормы.ТоварыЦена.Видимость                     = ЭтоТрансграничнаяТорговля;
	ЭлементыФормы.ТоварыСуммаНДС.Видимость                 = ЭтоТрансграничнаяТорговля;
	ЭлементыФормы.ТоварыСумма.Видимость                    = ЭтоТрансграничнаяТорговля;
	ЭлементыФормы.ТоварыСтавкаНДС.Видимость                = ЭтоТрансграничнаяТорговля Или ЭтоИмпортСФТС;
	ЭлементыФормы.ТоварыСуммаСНДС.Видимость                = ЭтоТрансграничнаяТорговля;
	
	Попытка
		ЭлементыФормы.ТоварыСуммаАкциза.Видимость     	   = ЭтоТрансграничнаяТорговля И ЭтоПиво;
	Исключение
		// Адаптация к старым релизам
		ЭлементыФормы.ТоварыСертификация.Видимость		   = ЭтоВводВОборот;
	КонецПопытки;
		
	ЭлементыФормы.ГруппаПервичныйДокумент.Видимость        = ЭтоТрансграничнаяТорговля Или ЭтоПриемкаКИЗ
		Или УказаниеРеквизитовНанесенияНаПиво И ОтчетПроизводственнойЛинии;
		
	Попытка
		ЭлементыФормы.СодержаниеЭтиловогоСпирта.Видимость	= УказаниеРеквизитовНанесенияНаПиво И ОтчетПроизводственнойЛинии;
	Исключение
		// Адаптация к старым релизам	
	КонецПопытки;
		
	ЭлементыФормы.ТоварыКодТНВЭД.Видимость					= ЭтоВводВОборот;
	
	Попытка
		ЭлементыФормы.ТоварыСодержаниеЭтиловогоСпирта.Видимость = УказаниеРеквизитовНанесенияНаПиво И Не ОтчетПроизводственнойЛинии;
		ЭлементыФормы.ТоварыПервичныйДокумент.Видимость         = УказаниеРеквизитовНанесенияНаПиво И Не ОтчетПроизводственнойЛинии;
		ЭлементыФормы.ЗаполнитьПервичныйДокумент.Видимость      = УказаниеРеквизитовНанесенияНаПиво И Не ОтчетПроизводственнойЛинии;
		
		ОбязательноеУказаниеПервичногоДокумента = Не (УказаниеРеквизитовНанесенияНаПиво
			И Не ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ОбязательноеУказаниеПервичногоДокументаДляПиваВОтчетеОНанесении());
		ЭлементыФормы.НомерПервичногоДокумента.АвтоотметкаНезаполненного = ОбязательноеУказаниеПервичногоДокумента;
		ЭлементыФормы.ДатаПервичногоДокумента.АвтоотметкаНезаполненного  = ОбязательноеУказаниеПервичногоДокумента;
		ЭлементыФормы.ТоварыПервичныйДокумент.АвтоотметкаНезаполненного  = ОбязательноеУказаниеПервичногоДокумента;
		
		ОбязательноеУказаниеСодержанияЭтиловогоСпирта = Не (УказаниеРеквизитовНанесенияНаПиво
			И Не ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ОбязательноеУказаниеСодержанияЭтиловогоСпиртаДляПиваВОтчетеОНанесении());
		ЭлементыФормы.СодержаниеЭтиловогоСпирта.АвтоотметкаНезаполненного = ОбязательноеУказаниеСодержанияЭтиловогоСпирта;
		ЭлементыФормы.ТоварыСодержаниеЭтиловогоСпирта.АвтоотметкаНезаполненного = ОбязательноеУказаниеСодержанияЭтиловогоСпирта;
	Исключение
		// Адаптация к старым релизам	
	КонецПопытки;
	
	ЭлементыФормы.ТоварыИдентификаторПроисхожденияВЕТИС.Видимость            = Ложь;
	ЭлементыФормы.ТоварыСрокГодности.Видимость                               = Ложь;
	ЭлементыФормы.ШтрихкодыУпаковокИдентификаторПроисхожденияВЕТИС.Видимость = Ложь;
	ЭлементыФормы.ШтрихкодыУпаковокСрокГодности.Видимость                    = Ложь;
	ЭлементыФормы.ИдентификаторПроизводственногоЗаказа.Видимость             = Ложь;
	ЭлементыФормы.ИдентификаторПроизводственнойЛинии.Видимость               = Ложь;
	
	Попытка
		ЭлементыФормы.ПроверятьСоставУпаковокПоДаннымИСМП.Видимость 			= Ложь;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Попытка
		ЭлементыФормы.ТоварыВидМеха.Видимость    = ЭтоМех И ЭтоИмпортСФТС;
		ЭлементыФормы.ЗаполнитьВидМеха.Видимость = ЭтоМех И ЭтоИмпортСФТС;
		
		ДоступноЗаполнениеЛицензий = (ЭтоПроизводствоРФ Или ЭтоКонтрактноеПроизводство) И ЭтоУпакованнаяВода;
		ЭлементыФормы.ТоварыЛицензияНаПользованиеНедрами.Видимость = ДоступноЗаполнениеЛицензий;
		ЭлементыФормы.ЗаполнитьЛицензии.Видимость                  = ДоступноЗаполнениеЛицензий;
	Исключение
		// Адаптация к старым релизам		
	КонецПопытки;
	
	// Реквизиты отчета производственной линии
	Попытка
		ЭлементыФормы.ИдентификаторПроисхожденияВЕТИССтрокой.Видимость = ЭтоВводВОборот И Не Форма.ИспользуетсяПодсистемаВЕТИС;
		ЭлементыФормы.ИдентификаторПроисхожденияВЕТИС.Видимость   	   = ЭтоВводВОборот И Форма.ИспользуетсяПодсистемаВЕТИС;
		ЭлементыФормы.КодТНВЭД.Видимость                               = ЭтоВводВОборот;
		ЭлементыФормы.СрокГодности.Видимость                           = ПрисутствуетОперацияНанесения;
		ЭлементыФормы.СкоропортящаясяПродукция.Видимость               = ПрисутствуетОперацияНанесения;
	Исключение	
		// Адаптация к старым релизам
		ЭлементыФормы.ИдентификаторПроисхожденияВЕТИССтрокой.Видимость = ЭтоВводВОборот И Не Форма.ИспользуетсяПодсистемаВЕТИС;
		ЭлементыФормы.КодТНВЭД.Видимость                               = ЭтоВводВОборот;
		ЭлементыФормы.СрокГодности.Видимость                           = ПрисутствуетОперацияНанесения;
		ЭлементыФормы.СкоропортящаясяПродукция.Видимость               = ПрисутствуетОперацияНанесения;
	КонецПопытки;
	
	ЭлементыФормы.КодТНВЭД.АвтоОтметкаНезаполненного = ЭтоВводВОборот;
	
	Попытка
	    ЭлементыФормы.ТоварыЦена.АвтоОтметкаНезаполненного = ЭтоТрансграничнаяТорговля И ЭтоПиво;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Попытка
		ЭлементыФормы.ТоварыСертификация.АвтоОтметкаНезаполненного = ЭтоТрансграничнаяТорговля И ЭтоПиво;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Если ЭтоПродукцияСоСрокамиГодности И ПрисутствуетОперацияНанесения Тогда
		УТ_11_4_МаркировкаТоваровИСМП_УстановитьФорматСрокГодности(Форма);
		
		Попытка
			ЭтоВидПродукцииСоСрокамиГодностиБезОбязательногоЗаполнения = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ЭтоВидПродукцииСоСрокамиГодностиБезОбязательногоЗаполнения(ВидПродукции);
		
			ЭлементыФормы.СрокГодности.АвтоОтметкаНезаполненного = Не ЭтоВидПродукцииСоСрокамиГодностиБезОбязательногоЗаполнения;
			ЭлементыФормы.ТоварыСрокГодности.АвтоОтметкаНезаполненного = Не ЭтоВидПродукцииСоСрокамиГодностиБезОбязательногоЗаполнения;
		Исключение
			// Адаптация к старым релизам
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		УТ_11_4_МаркировкаТоваровИСМП_УстановитьФорматДатыПроизводства(Форма, ПрисутствуетОперацияНанесения);
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	ЭлементыФормы.ДатаПроизводства.Видимость = ЭтоКонтрактноеПроизводство
		Или ЭтоПроизводствоРФ
		Или ЭтоИмпортСФТС И ЭтоМолочнаяПродукция
		Или ПрисутствуетОперацияНанесения И ДляВидаПродукцииИспользуетсяДатаПроизводства;
	
	ЭлементыФормы.ДатаПроизводства.АвтоОтметкаНезаполненного =
		ДляВидаПродукцииИспользуетсяДатаПроизводства И ПрисутствуетОперацияНанесения
		Или Не (ЭтоШины Или ДляВидаПродукцииИспользуетсяДатаПроизводства)
			И (ЭтоПроизводствоРФ Или ЭтоКонтрактноеПроизводство)
			И (Не ЗначениеЗаполнено(ОперацияНанесения)
			   Или ЗначениеЗаполнено(ОперацияНанесения)
			       И УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиНанесениеНеЗавершен().Найти(Форма.СтатусИСМП) = Неопределено)
		Или ТребуетсяУказатьДанныеДекларации И ЭтоИмпортСФТС И ЭтоМолочнаяПродукция;
		
	Попытка	
		ЭлементыФормы.НомерПартии.Видимость = ЭтоКреслаКоляски И ПрисутствуетОперацияНанесения;
		ЭлементыФормы.НомерСерии.Видимость  = (ЭтоКреслаКоляски Или ЭтоВетеринарныеПрепараты) И ПрисутствуетОперацияНанесения;
		ЭлементыФормы.НомерСерии.АвтоОтметкаНезаполненного = ЭтоВетеринарныеПрепараты И ПрисутствуетОперацияНанесения;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
		
	ЭлементыФормы.Контрагент.Видимость = (ЭтоКонтрактноеПроизводство Или ЭтоТрансграничнаяТорговля);
	Если ЭтоПроизводствоПоДоговору Тогда
		ЭлементыФормы.Контрагент.Заголовок = НСтр("ru = 'Владелец'");
	ИначеЕсли ЭтоПроизводствоПоДоговоруНаСторонеЗаказчика Тогда
		ЭлементыФормы.Контрагент.Заголовок = НСтр("ru = 'Производитель'");
	ИначеЕсли ЭтоТрансграничнаяТорговля Тогда
		ЭлементыФормы.Контрагент.Заголовок = НСтр("ru = 'Экспортер'");
	КонецЕсли;
	
	Попытка
		ПередаватьВДекларациюКодыУпаковок = 
			Форма.Объект.ВариантЗаполненияДекларации = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДекларацииИСМП.КодыУпаковок");
	Исключение
		// Адаптация к старым релизам
		ПередаватьВДекларациюКодыУпаковок = Ложь;
	КонецПопытки;
	
	Попытка
		ЭлементыФормы.ВариантВыполненияАгрегации.Видимость = Не (
			ЭтоАгрегация
			Или ЭтоПродукцияМОТП
			Или ЭтоМех
			Или ЭтоИмпортСФТС И Не ПередаватьВДекларациюКодыУпаковок
			Или ОперацииМаркировки.ЭтоОперацияНанесения
			Или ЗначениеЗаполнено(ОперацияНанесения));
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Попытка
		ЭлементыФормы.ГруппаОперацияНанесения.Видимость = Ложь;
	Исключение	
		ЭлементыФормы.ОперацияНанесения.Видимость = Ложь;
	КонецПопытки;
	
	Попытка
		ДоступноУказаниеПодразделения = Форма.ПодразделенияИспользуются И ЭтоПиво
			И (ЭтоОперацияНанесения Или ЭтоИмпортСФТС Или ОперацииМаркировки.ЭтоТрансграничнаяТорговля);
	Исключение
		// Адаптация к старым релизам
		ДоступноУказаниеПодразделения = Ложь;	
	КонецПопытки;	
	
	ЭлементыФормы.ПроизводственныйОбъект.Видимость = ЭтоОперацияНанесения И Не ЭтоМех
		Или ЭтоПриемкаКИЗ
		Или ДоступноУказаниеПодразделения
		Или Не ЭтоМех
		И Не ЭтоПродукцияМОТП
		И ВозможнаОперацияНанесения
		И ДоступнаОперацияНанесенияПоВидуОперацииИСМП
		И ЗначениеЗаполнено(ОперацияНанесения);
	
	Попытка
		ЭлементыФормы.Подразделение.Видимость = Форма.ПодразделенияИспользуются И ЭтоПиво
			И (ЭтоОперацияНанесения Или ЭтоИмпортСФТС Или ОперацииМаркировки.ЭтоТрансграничнаяТорговля);
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Попытка
		ЭлементыФормы.ГруппаПроизводственнаяПлощадкаВЕТИС.Видимость = ЭтоБАД И ПрисутствуетОперацияНанесения;
		ЭлементыФормы.ИдентификаторПроизводственнойПлощадкиВЕТИС.Видимость = Не Форма.ИспользуетсяПодсистемаВЕТИС;
		ЭлементыФормы.ПроизводственнаяПлощадкаВЕТИС.Видимость = Форма.ИспользуетсяПодсистемаВЕТИС;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Попытка	
		ЭлементыФормы.GLNОрганизации.Видимость = ЭтоПриемкаКИЗ;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	ГруппаЭлементовЗаполнена = Истина;
	Попытка
		ЭлементыФормы.СтраницаТовары.Видимость                   = Не ОтчетПроизводственнойЛинии И Не ЭтоПриемкаКИЗ;
		ЭлементыФормы.СтраницаПредставлениеКИЗ.Видимость         = ЭтоПриемкаКИЗ;
		ЭлементыФормы.СтраницаОтчетПроизводственнойЛинии.Видимость = ОтчетПроизводственнойЛинии;
		
		ЭлементыФормы.ТоварыСертификация.Видимость = (ЭтоВводВОборот И Не ЭтоИмпортСФТС) Или ЭтоМаркировкаОстатков;
		
		ЭлементыФормы.Сертификация.Видимость = ОтчетПроизводственнойЛинии И ЭтоВводВОборот И Не ЭтоИмпортСФТС И Не ЭтоМех;
		
		УТ_11_4_МаркировкаТоваровИСМП_НастроитьВидимостьНомерСтрокиОтчетПроизводственнойЛинии(Форма);

		Если ЭтоУпакованнаяВода И (ЭтоПроизводствоРФ Или ЭтоКонтрактноеПроизводство) Тогда
			ИмяЗаголовкаСертификация = НСтр("ru = 'Сертификация, номер скважины'");
		Иначе
			ИмяЗаголовкаСертификация = НСтр("ru = 'Сертификация'");
		КонецЕсли;
		ЭлементыФормы.ТоварыСертификация.Заголовок = ИмяЗаголовкаСертификация;
		ЭлементыФормы.Сертификация.Заголовок = ИмяЗаголовкаСертификация;
	Исключение
		ГруппаЭлементовЗаполнена = Ложь;
	КонецПопытки;
	
	Попытка
		ИспользоватьПаспортСоответствия = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер").ИспользоватьПаспортСоответствия(Форма);
		ЭлементыФормы.ПаспортСоответствия.Видимость = ОтчетПроизводственнойЛинии И ИспользоватьПаспортСоответствия;
		ЭлементыФормы.ТоварыПаспортСоответствия.Видимость = ИспользоватьПаспортСоответствия;
		ЭлементыФормы.ТоварыПаспортСоответствия.АвтоОтметкаНезаполненного = ИспользоватьПаспортСоответствия;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Попытка
		ЭлементыФормы.ЛицензияНаПользованиеНедрами.Видимость = ОтчетПроизводственнойЛинии И ДоступноЗаполнениеЛицензий;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Если НЕ ГруппаЭлементовЗаполнена Тогда
		// Адаптация к старым релизам
		ЭлементыФормы.СтраницаТовары.Видимость              	 	= Не ОтчетПроизводственнойЛинии;
		ЭлементыФормы.ГруппаОтчетПроизводственнойЛинии.Видимость 	= ОтчетПроизводственнойЛинии;
	
		Попытка
			ЭлементыФормы.СтраницаОтчетПроизводственнойЛинии.Видимость = ОтчетПроизводственнойЛинии;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ЭлементыФормы.ГруппаДанныеОтчетаПроизводственнойЛинии.Видимость = ОтчетПроизводственнойЛинии И Не ЭтоАгрегация И Не ЭтоПолучениеПродукцииОтФизическихЛиц;
	
	Попытка
		ЭлементыФормы.ЗаполнитьКоличествоПоДаннымОтчета.Доступность = ЗначениеЗаполнено(Форма.Номенклатура);
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	ВариантЗаполненияДекларации = Неопределено;
	Попытка
		ВариантЗаполненияДекларации = Форма.Объект.ВариантЗаполненияДекларации;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Попытка
		ОтображатьИсходныеЗначенияКодов = ОтчетПроизводственнойЛинии 
			И (Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.Черновик")
			   Или УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиНанесениеНеЗавершен().Найти(Форма.СтатусИСМП) <> Неопределено
			   Или ЭтоАгрегация И УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиАгрегацияНеЗавершен().Найти(Форма.СтатусИСМП) <> Неопределено
			   Или Не ЗначениеЗаполнено(ОперацияНанесения)
			       И ((ЭтоИмпортСФТС
				  	   И ВариантЗаполненияДекларации = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДекларацииИСМП.АТК")
					       И УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиФормированиеАТКНеЗавершен().Найти(Форма.СтатусИСМП) <> Неопределено
					   Или ВариантЗаполненияДекларации = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДекларацииИСМП.КодыМаркировки")
					       И УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиВводВОборотНеЗавершен().Найти(Форма.СтатусИСМП) <> Неопределено
					   Или ВариантЗаполненияДекларации = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДекларацииИСМП.КодыУпаковок")
					       И УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиАгрегацияНеЗавершен().Найти(Форма.СтатусИСМП) <> Неопределено)
					Или (Не ЭтоАгрегация И УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиВводВОборотНеЗавершен().Найти(Форма.СтатусИСМП) <> Неопределено)));
    Исключение
		// Адаптация к старым релизам
		СтатусыКодыМаркировкиОбработаны = Новый Массив;
		СтатусыКодыМаркировкиОбработаны.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиВведеныВОборот"));
		СтатусыКодыМаркировкиОбработаны.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиВведеныВОборотИАгрегированы"));
		СтатусыКодыМаркировкиОбработаны.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиНанесены"));
		СтатусыКодыМаркировкиОбработаны.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиНанесеныИАгрегированы"));
		
		СтатусыКодыМаркировкиАгрегация = Новый Массив;
		СтатусыКодыМаркировкиАгрегация.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.АгрегацияКПередаче"));
		СтатусыКодыМаркировкиАгрегация.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.АгрегацияОбрабатывается"));
		СтатусыКодыМаркировкиАгрегация.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.АгрегацияОшибкаПередачи"));
		
		ОтображатьИсходныеЗначенияКодов = ОтчетПроизводственнойЛинии 
			И (Не ЭтоАгрегация 
				И СтатусыКодыМаркировкиОбработаны.Найти(Форма.СтатусИСМП) = Неопределено
				И СтатусыКодыМаркировкиАгрегация.Найти(Форма.СтатусИСМП) = Неопределено
				Или ЭтоАгрегация);
	КонецПопытки;
	
	Попытка
		ЭлементыФормы.ДанныеОтчетаПроизводственнойЛинииГруппаЗначениеШтрихкода.Видимость         = ОтображатьИсходныеЗначенияКодов;
		ЭлементыФормы.ДанныеОтчетаПроизводственнойЛинииГруппаЗначениеШтрихкодаУпаковки.Видимость = ОтображатьИсходныеЗначенияКодов;
		ЭлементыФормы.ДанныеОтчетаПроизводственнойЛинииФорматBase64.Видимость              		 = ОтображатьИсходныеЗначенияКодов;
		
		ЭлементыФормы.ДанныеОтчетаПроизводственнойЛинииГруппаНормализованноеЗначениеШтрихкода.Видимость         = Не ОтображатьИсходныеЗначенияКодов;
		ЭлементыФормы.ДанныеОтчетаПроизводственнойЛинииГруппаНормализованноеЗначениеШтрихкодаУпаковки.Видимость = Не ОтображатьИсходныеЗначенияКодов;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Попытка
		ЭлементыФормы.ДанныеОтчетаПроизводственнойЛинииЗначениеШтрихкода.Видимость         = ОтображатьИсходныеЗначенияКодов;
		ЭлементыФормы.ДанныеОтчетаПроизводственнойЛинииЗначениеШтрихкодаУпаковки.Видимость = ОтображатьИсходныеЗначенияКодов;
		ЭлементыФормы.ДанныеОтчетаПроизводственнойЛинииФорматBase64.Видимость              = ОтображатьИсходныеЗначенияКодов;
		
		ЭлементыФормы.ДанныеОтчетаПроизводственнойЛинииНормализованноеЗначениеШтрихкода.Видимость         = Не ОтображатьИсходныеЗначенияКодов;
		ЭлементыФормы.ДанныеОтчетаПроизводственнойЛинииНормализованноеЗначениеШтрихкодаУпаковки.Видимость = Не ОтображатьИсходныеЗначенияКодов;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Попытка
		УТ_11_4_МаркировкаТоваровИСМП_УстановитьВидимостьЭлементовСтатусИННВладельца(ЭлементыФормы, Ложь);
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Попытка
		ЭлементыФормы.ГруппаМолочнаяПродукция.Видимость = ЭтоМолочнаяПродукция;
		ЭлементыФормы.ГруппаСрокГодности.Видимость      = ЭтоПродукцияСоСрокамиГодности;
		ЭлементыФормы.ГруппаВЕТИС.Видимость             = ЭтоПродукцияПодконтрольнаяВЕТИС;
	Исключение
		// Адаптация к старым релизам
		ЭлементыФормы.ГруппаМолочнаяПродукция.Видимость = ЭтоМолочнаяПродукция;
		ЭлементыФормы.ГруппаВЕТИС.Видимость             = ЭтоМолочнаяПродукцияВЕТИС;
	КонецПопытки;
	
	Попытка
		Форма.Объект.ПроверятьСоставУпаковокПоДаннымИСМП = ПроверятьСоставУпаковокПоДаннымИСМП;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Если ЭтоПродукцияМОТП Тогда
		
		ЭлементыФормы.ИдентификаторПроизводственногоЗаказа.Видимость = Истина;
		ЭлементыФормы.ИдентификаторПроизводственнойЛинии.Видимость   = Истина;
		
		Попытка
			ЭлементыФормы.ПроверятьСоставУпаковокПоДаннымИСМП.Видимость   = ЭтоАгрегация;
			ЭлементыФормы.ПроверятьСоставУпаковокПоДаннымИСМП.Доступность = ЭтоАгрегация;
		Исключение			
			// Адаптация к старым режимам			
		КонецПопытки;
		
	ИначеЕсли ВозможнаОперацияНанесения Тогда
		
		Попытка
			ЭлементыФормы.ГруппаОперацияНанесения.Видимость = ДоступнаОперацияНанесенияПоВидуОперацииИСМП;
			
			ЭлементыФормы.ОперацияНанесения.Видимость                 = ДоступнаОперацияНанесенияПоВидуОперацииИСМП И Не ЭтоМех;
			ЭлементыФормы.ОперацияНанесенияТолькоДляНаборов.Видимость = ДоступнаОперацияНанесенияПоВидуОперацииИСМП И Не ЭтоМех
				И КомплектующиеМогутБытьНанесеныНезависимо;
			ЭлементыФормы.ТребуетсяИндивидуализация.Видимость         = ДоступнаОперацияНанесенияПоВидуОперацииИСМП И ЭтоМех;
		Исключение
			// Адаптация к старым релизам
			ЭлементыФормы.ОперацияНанесения.Видимость = ДоступнаОперацияНанесенияПоВидуОперацииИСМП;
		КонецПопытки;
		
		// ЭлементыФормы.ИдентификаторПроизводственногоЗаказа.Видимость = Истина;
		
		Попытка
			Если ЭтоПродукцияСоСрокамиГодности Тогда
				ЭлементыФормы.ТоварыСрокГодности.Видимость            = ПрисутствуетОперацияНанесения;
				ЭлементыФормы.ШтрихкодыУпаковокСрокГодности.Видимость = ПрисутствуетОперацияНанесения;
			КонецЕсли;
		Исключение			
			// Адаптация к старым режимам			
		КонецПопытки;
		
		Если ЭтоПродукцияПодконтрольнаяВЕТИС Тогда	
			ЭлементыФормы.ОтчетПроизводственнойЛинии.ТолькоПросмотр = Не Форма.ИспользуетсяПодсистемаВЕТИС;
		КонецЕсли;
		
		Если ЭтоВводВОборот И ЭтоПродукцияПодконтрольнаяВЕТИС Тогда
			
			ЭлементыФормы.ТоварыИдентификаторПроисхожденияВЕТИС.Видимость                 = Истина;
			ЭлементыФормы.ТоварыИдентификаторПроисхожденияВЕТИС.АвтоОтметкаНезаполненного = Истина;
			ЭлементыФормы.ШтрихкодыУпаковокИдентификаторПроисхожденияВЕТИС.Видимость      = Истина;
			
			Попытка
				ЗаголовокКолонкиВЕТИС = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПВЕТИСКлиентСервер").ИмяИдентификатораПроисхожденияВЕТИС();
				ЭлементыФормы.ТоварыИдентификаторПроисхожденияВЕТИС.Заголовок 			= ЗаголовокКолонкиВЕТИС;
				ЭлементыФормы.ШтрихкодыУпаковокИдентификаторПроисхожденияВЕТИС.Заголовок = ЗаголовокКолонкиВЕТИС;
				ЭлементыФормы.ИдентификаторПроисхожденияВЕТИС.Заголовок 					= ЗаголовокКолонкиВЕТИС;
				ЭлементыФормы.ИдентификаторПроисхожденияВЕТИС.АвтоотметкаНезаполненного = Не ЗначениеЗаполнено(ОперацияНанесения)
					Или ЗначениеЗаполнено(ОперацияНанесения)
						И НЕ (Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.Черновик")
						Или Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.ОтчетКПередаче")
						Или Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.ОтчетОшибкаПередачи")
						Или Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.ОтчетОбрабатывается")
						Или Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиНанесеныЧастично"));
			Исключение
				// Адаптация к старым релизам
				ТипИдентификатораПроисхождения = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПВЕТИСКлиентСервер").ТипИдентификатораПроисхожденияВДокументеМаркировкаТоваров(Форма, ЭтоПроизводствоВнеЕАЭС Или ЭтоТрансграничнаяТорговля);
				Если ЗначениеЗаполнено(ТипИдентификатораПроисхождения) Тогда
					МассивТиповИдентификаторПроисхожденияВЕТИС = Новый Массив;
					ЗаголовокКолонкиВЕТИС = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПВЕТИСКлиентСервер").ЗаголовокПоляИдентификаторПроисхожденияВЕТИСПоТипу(ТипИдентификатораПроисхождения);
					МассивТиповИдентификаторПроисхожденияВЕТИС.Добавить(ТипИдентификатораПроисхождения);
						
					ЭлементыФормы.ТоварыИдентификаторПроисхожденияВЕТИС.Заголовок = ЗаголовокКолонкиВЕТИС;
					ЭлементыФормы.ТоварыИдентификаторПроисхожденияВЕТИС.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповИдентификаторПроисхожденияВЕТИС);
					ЭлементыФормы.ШтрихкодыУпаковокИдентификаторПроисхожденияВЕТИС.Заголовок = ЗаголовокКолонкиВЕТИС;
					ЭлементыФормы.ШтрихкодыУпаковокИдентификаторПроисхожденияВЕТИС.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповИдентификаторПроисхожденияВЕТИС);
				КонецЕсли;
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе
		
		Если ЭтоМаркировкаОстатков Или ЭтоПолучениеПродукцииОтФизическихЛиц Или ЭтоАгрегация Тогда
			ЭлементыФормы.ТоварыКодТНВЭД.Видимость = Ложь;
		Иначе
			ЭлементыФормы.ТоварыКодТНВЭД.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка	
		ЭлементыФормы.ОтборСтрок.Видимость = ОтчетПроизводственнойЛинии И Не Форма.РедактированиеФормыНеДоступно;
	Исключение
		// Адаптация к старым режимам		
	КонецПопытки;
	
	ЗависимыеОтСтатусаИСМП = Новый Массив;
	ЗависимыеОтСтатусаИСМП.Добавить("ГруппаЛеваяКолонка");
	ЗависимыеОтСтатусаИСМП.Добавить("ГруппаПраваяКолонкаНередактируемыеПослеОтправки");
	ЗависимыеОтСтатусаИСМП.Добавить("ГруппаПраваяКолонкаНередактируемыеПослеОтправкиДополнительныеДанные");
	ЗависимыеОтСтатусаИСМП.Добавить("СоздаватьШтрихкодыУпаковок");
	ЗависимыеОтСтатусаИСМП.Добавить("ГруппаНастройкиСозданияШтрихкодовУпаковок");
	ЗависимыеОтСтатусаИСМП.Добавить("ГруппаКоличество");
	ЗависимыеОтСтатусаИСМП.Добавить("ЗаполнитьКоличествоПоДаннымОтчета");
	ЗависимыеОтСтатусаИСМП.Добавить("ГруппаМолочнаяПродукция");
	ЗависимыеОтСтатусаИСМП.Добавить("КодТНВЭД");
	ЗависимыеОтСтатусаИСМП.Добавить("ГруппаФормированиеАТК");

	ДоступностьЭлементовДанныеДекларации = Ложь;
	Если ЭтоИмпортСФТС Тогда
		ДоступностьЭлементовДанныеДекларации = ВариантЗаполненияДекларации = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДекларацииИСМП.КодыУпаковок")
			И Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиАгрегированы")
			Или Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыАТКСформированы")
			Или Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.Черновик");
	КонецЕсли;

	Попытка
		РежимИсправленияОшибокПослеПередачиКодов = Форма.РежимИсправленияОшибокПослеПередачиКодов;
	Исключение
		// Адаптация к старым релизам
		РежимИсправленияОшибокПослеПередачиКодов = Ложь;
	КонецПопытки;
	
	ДоступноРедактированиеСертификации = Ложь;
	Если ЗначениеЗаполнено(ОперацияНанесения) Тогда
		
		ЗависимыеОтСтатусаИСМПОтчетОНанесении = Новый Массив;
		Если ЭтоПродукцияПодконтрольнаяВЕТИС И ОтчетПроизводственнойЛинии Тогда
			ЗависимыеОтСтатусаИСМПОтчетОНанесении.Добавить("ГруппаВЕТИС");
		КонецЕсли;
		
		Если ЭтоПроизводствоВнеЕАЭС Или ЭтоИмпортСФТС Тогда
			ЗависимыеОтСтатусаИСМПОтчетОНанесении.Добавить("ГруппаПраваяКолонкаДанныеДекларации");
		КонецЕсли;
		
		Если Не (ЭтоШины Или ЭтоБАД Или ЭтоПиво Или ЭтоБАПиво Или ЭтоМорепродукты) Тогда
			ЗависимыеОтСтатусаИСМПОтчетОНанесении.Добавить("ГруппаДанныеВводаВОборот");
		КонецЕсли;
		
		ИнтеграцияИСКлиентСервер_УстановитьДоступностьЭлементовФормы(
			Форма,
			ЗависимыеОтСтатусаИСМПОтчетОНанесении,
			Не Форма.РедактированиеФормыНеДоступно И Не РежимИсправленияОшибокПослеПередачиКодов
			Или Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиНанесены")
			Или Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиНанесеныЧастично")
			Или Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.ВводВОборотОшибкаПередачи")
			Или ДоступностьЭлементовДанныеДекларации);
			
		ДоступноРедактированиеСертификации = ЭтоВводВОборот 
			И (Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиНанесены")
			Или Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиНанесеныЧастично")
			Или Форма.СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.ВводВОборотОшибкаПередачи"));
		
	ИначеЕсли ЭтоИмпортСФТС Тогда

		ЗависимыеОтСтатусаИмпортСФТС = Новый Массив;
		ЗависимыеОтСтатусаИмпортСФТС.Добавить("ГруппаПраваяКолонкаДанныеДекларации");
		ЗависимыеОтСтатусаИмпортСФТС.Добавить("ГруппаДанныеВводаВОборот");

		ИнтеграцияИСКлиентСервер_УстановитьДоступностьЭлементовФормы(
			Форма,
			ЗависимыеОтСтатусаИмпортСФТС,
			Не Форма.РедактированиеФормыНеДоступно
			   И Не РежимИсправленияОшибокПослеПередачиКодов
			Или ДоступностьЭлементовДанныеДекларации);
			
	Иначе
		ЗависимыеОтСтатусаИСМП.Добавить("ГруппаВЕТИС");
		ЗависимыеОтСтатусаИСМП.Добавить("ГруппаПраваяКолонкаДанныеДекларации");
		ЗависимыеОтСтатусаИСМП.Добавить("ГруппаДанныеВводаВОборот");
	КонецЕсли;
	
	ЗависимыеОтСтатусаИСМП.Добавить("ОткрытьПодборПодменю"); 
	ЗависимыеОтСтатусаИСМП.Добавить("ЗаполнитьПараметрыТовары");
	ЗависимыеОтСтатусаИСМП.Добавить("ЗаполнитьВидМеха");
	ЗависимыеОтСтатусаИСМП.Добавить("ТоварыЗагрузитьИзВнешнегоФайла");
	ЗависимыеОтСтатусаИСМП.Добавить("ТоварыГруппаПерезаполнитьПоОснованию");
	ЗависимыеОтСтатусаИСМП.Добавить("ГруппаТорговоеОборудование");
	
	Если Не ДоступноРедактированиеСертификации Тогда
		ЗависимыеОтСтатусаИСМП.Добавить("ТоварыЗаполнитьДокументыСертификации");
		ЗависимыеОтСтатусаИСМП.Добавить("ЗаполнитьЛицензии");
	КонецЕсли;
	
	Если УказаниеРеквизитовНанесенияНаПиво Тогда
		ЗависимыеОтСтатусаИСМП.Добавить("ЗаполнитьПервичныйДокумент");
	КонецЕсли;
	
	//ЗависимыеОтСтатусаИСМП.Добавить("ГруппаНередактируемыеПослеОтправкиКомандыТовары");
	
	ЗависимыеОтСтатусаИСМП.Добавить("ГруппаНередактируемыеПослеОтправкиКомандыДанныеОтчета");
	ЗависимыеОтСтатусаИСМП.Добавить("ГруппаТорговоеОборудованиеПредставлениеКИЗ");
	
	ИнтеграцияИСКлиентСервер_УстановитьДоступностьЭлементовФормы(Форма,
		ЗависимыеОтСтатусаИСМП, Не Форма.РедактированиеФормыНеДоступно И Не РежимИсправленияОшибокПослеПередачиКодов);
	
	ЗависимыеОтСтатусаОбработанЧастичноИСМП = Новый Массив;
	ЗависимыеОтСтатусаОбработанЧастичноИСМП.Добавить("СтраницаОтчетПроизводственнойЛинии");
	
	Попытка
		Если ДоступноРедактированиеСертификации Тогда
			Исключения = Новый Массив;
			Исключения.Добавить(ЭлементыФормы.ТоварыСертификация.Имя);
			Исключения.Добавить(ЭлементыФормы.ТоварыЛицензияНаПользованиеНедрами.Имя);
			Исключения.Добавить(ЭлементыФормы.ТоварыЗаполнитьДокументыСертификации.Имя);
			Исключения.Добавить(ЭлементыФормы.ЗаполнитьЛицензии.Имя);
			ИнтеграцияИСКлиентСервер_УстановитьДоступностьЭлементовФормы(
				Форма, Исключения, Истина);
			ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").УстановитьДоступностьЭлементовГруппыФормыРекурсивно(
				ЭлементыФормы.СтраницаТовары, Не Форма.РедактированиеФормыНеДоступно, Исключения);
			Если Не Форма.РедактированиеФормыНеДоступно Тогда 
				ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").УстановитьДоступностьЭлементовГруппыФормыРекурсивно(
					ЭлементыФормы.ГруппаТовары, Не Форма.РежимИсправленияОшибокПослеПередачиКодов, Исключения);
			КонецЕсли;
		Иначе
			ЗависимыеОтСтатусаОбработанЧастичноИСМП.Добавить("СтраницаТовары");
		КонецЕсли;
	Исключение
		// Адаптация к старым релизам
		ЗависимыеОтСтатусаОбработанЧастичноИСМП.Добавить("СтраницаТовары");
	КонецПопытки;
	
	ИнтеграцияИСКлиентСервер_УстановитьДоступностьЭлементовФормы(Форма,
		ЗависимыеОтСтатусаОбработанЧастичноИСМП, Не Форма.РедактированиеФормыНеДоступно);
		
	ЗависимыеОтДальнейшегоДействияИСМП = Новый Массив;
	ЗависимыеОтДальнейшегоДействияИСМП.Добавить("КоманднаяПанельОтчетПроизводственнойЛинии");
	ЗависимыеОтДальнейшегоДействияИСМП.Добавить("ДанныеОтчетаПроизводственнойЛинииНормализованноеЗначениеШтрихкода");
	ЗависимыеОтДальнейшегоДействияИСМП.Добавить("ДанныеОтчетаПроизводственнойЛинииНормализованноеЗначениеШтрихкодаУпаковки");
	ЗависимыеОтДальнейшегоДействияИСМП.Добавить("ДанныеОтчетаПроизводственнойЛинииТекстОшибки");
	
	Если Не ДоступноРедактированиеСертификации Тогда
		ЗависимыеОтДальнейшегоДействияИСМП.Добавить("ГруппаТовары");
	КонецЕсли;
	
	ИнтеграцияИСКлиентСервер_УстановитьДоступностьЭлементовФормы(Форма,
		ЗависимыеОтДальнейшегоДействияИСМП, Не РежимИсправленияОшибокПослеПередачиКодов);
	
	ЗависимыеОтСтатусаПроверкиИПодбора = Новый Массив;
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ОткрытьПодборПодменю");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ЗаполнитьВидМеха");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ЗаполнитьПараметрыТовары");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыЗагрузитьИзВнешнегоФайла");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыГруппаПерезаполнитьПоОснованию");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ГруппаТорговоеОборудование");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыНоменклатура");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыХарактеристика");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыСерия");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыКоличествоУпаковок");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыУпаковкаЕдиницаИзмерения");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыДобавить");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыСкопировать");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыИзменить");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыУдалить");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыКонтекстноеМенюДобавить");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыКонтекстноеМенюСкопировать");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыКонтекстноеМенюИзменить");
	ЗависимыеОтСтатусаПроверкиИПодбора.Добавить("ТоварыКонтекстноеМенюУдалить");

	ИнтеграцияИСКлиентСервер_УстановитьДоступностьЭлементовФормы(Форма,
		ЗависимыеОтСтатусаПроверкиИПодбора,
		Не (Форма.РедактированиеФормыНеДоступно Или УТ_11_4_МаркировкаТоваровИСМП_РедактированиеНедоступноПоСтатусуПроверкиИподбора(Форма))
			И Не РежимИсправленияОшибокПослеПередачиКодов);
	
	Попытка		
		Если Форма.РедактированиеФормыНеДоступно
			Или Не Форма.ПравоИзменения Тогда
			ЭлементыФормы.ВозобновитьПодборМаркируемойПродукции.Доступность = Ложь;
			ЭлементыФормы.ПредставлениеКИЗВозобновитьПодборМаркируемойПродукции.Доступность = Ложь;
		ИначеЕсли Форма.СтатусПроверкиИПодбора = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиИПодбораИС.Завершено") Тогда
			ЭлементыФормы.ВозобновитьПодборМаркируемойПродукции.Доступность = Истина;
			ЭлементыФормы.ПредставлениеКИЗВозобновитьПодборМаркируемойПродукции.Доступность = Истина;
		Иначе
			ЭлементыФормы.ВозобновитьПодборМаркируемойПродукции.Доступность = Ложь;
			ЭлементыФормы.ПредставлениеКИЗВозобновитьПодборМаркируемойПродукции.Доступность = Ложь;
		КонецЕсли;
	Исключение
		// Адаптация к старым релизам
		Если Форма.РедактированиеФормыНеДоступно
			Или Не Форма.ПравоИзменения Тогда
			ЭлементыФормы.ВозобновитьПодборМаркируемойПродукции.Доступность = Ложь;
		ИначеЕсли Форма.СтатусПроверкиИПодбора = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиИПодбораИС.Завершено") Тогда
			ЭлементыФормы.ВозобновитьПодборМаркируемойПродукции.Доступность = Истина;
		Иначе
			ЭлементыФормы.ВозобновитьПодборМаркируемойПродукции.Доступность = Ложь;
		КонецЕсли;
	КонецПопытки;
	
	Попытка
		ЭлементыФормы.ТоварыСтатусПроверкиГосИС.Видимость = Не Форма.РедактированиеФормыНеДоступно;
	Исключение
		// Адаптация к старым релизам
	КонецПопытки;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВидимостьПодключаемыхКоманд") 
		ИЛИ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "НастройкиВыполненияПодключаемыхКомандИС") Тогда
		ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыИСКлиентСервер").УправлениеВидимостьюКомандПодключенныхКОбъекту(Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УТ_11_4_МаркировкаТоваровИСМП_ТребуетсяУказатьДанныеДекларации(Форма)
	
	ВариантЗаполненияДекларации = Форма.Объект.ВариантЗаполненияДекларации;
	Операция                    = Форма.Объект.Операция;
	ОперацияНанесения           = Форма.Объект.ОперацияНанесения;
	СтатусИСМП                  = Форма.СтатусИСМП;
	
	Попытка
		ВариантВыполненияАгрегации 					  = Форма.Объект.ВариантВыполненияАгрегации;
		ВариантВыполненияАгрегации_ПередВводомВОборот = ВариантВыполненияАгрегации = ПредопределенноеЗначение("Перечисление.ВариантыВыполненияАгрегацииИСМП.ПередВводомВОборот");
		ВариантВыполненияАгрегации_НеТребуется		  = ВариантВыполненияАгрегации = ПредопределенноеЗначение("Перечисление.ВариантыВыполненияАгрегацииИСМП.НеТребуется");
	Исключение 
		// адаптация к старым релизам
		ВариантВыполненияАгрегации 					  = Неопределено;
		ВариантВыполненияАгрегации_ПередВводомВОборот = Ложь;
		ВариантВыполненияАгрегации_НеТребуется		  = Ложь;
	КонецПопытки;
	
	ЗначенияПеречисленияВидыОперацийИСМП = Метаданные.Перечисления.ВидыОперацийИСМП.ЗначенияПеречисления;
	
	Если ЗначенияПеречисленияВидыОперацийИСМП.Найти("ВводВОборотПроизводствоВнеЕАЭС") <> Неопределено Тогда
		Операция_ВводВОборотПроизводствоВнеЕАЭС = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС");
	Иначе
		// адаптация к старым релизам
		Операция_ВводВОборотПроизводствоВнеЕАЭС = Ложь;
	КонецЕсли;
	
	Если ЗначенияПеречисленияВидыОперацийИСМП.Найти("ВводВОборотПроизводствоВнеЕАЭС") <> Неопределено Тогда
		Операция_ВводВОборотПроизводствоВнеЕАЭС = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС");
	Иначе
		// адаптация к старым релизам
		Операция_ВводВОборотПроизводствоВнеЕАЭС = Ложь;
	КонецЕсли;
	
	Если ЗначенияПеречисленияВидыОперацийИСМП.Найти("ВводВОборотИмпортСФТСМех") <> Неопределено Тогда
		Операция_ВводВОборотИмпортСФТСМех = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотИмпортСФТСМех");
	Иначе
		// адаптация к старым релизам
		Операция_ВводВОборотИмпортСФТСМех = Ложь;
	КонецЕсли;
	
	Если ЗначенияПеречисленияВидыОперацийИСМП.Найти("ВводВОборотИмпортСФТС") <> Неопределено Тогда
		Операция_ВводВОборотИмпортСФТС = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотИмпортСФТС");
	Иначе
		// адаптация к старым релизам
		Операция_ВводВОборотИмпортСФТС = Ложь;
	КонецЕсли;
	
	Если Операция = Операция_ВводВОборотПроизводствоВнеЕАЭС
		И ((НЕ ВариантВыполненияАгрегации_ПередВводомВОборот
		    И (Не ЗначениеЗаполнено(ОперацияНанесения)
		       Или ЗначениеЗаполнено(ОперацияНанесения)
		           И УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиНанесениеНеЗавершен().Найти(СтатусИСМП) = Неопределено))
		    Или (ВариантВыполненияАгрегации_ПередВводомВОборот
		         И СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиАгрегированы")))
		
		Или Операция = Операция_ВводВОборотИмпортСФТСМех
		
		Или Операция = Операция_ВводВОборотИмпортСФТС
		    И ((ВариантЗаполненияДекларации = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДекларацииИСМП.АТК")
		        И СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыАТКСформированы")
		        Или ВариантЗаполненияДекларации = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДекларацииИСМП.КодыУпаковок") 
		        И (СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиАгрегированы")
		           Или ВариантВыполненияАгрегации_НеТребуется)
		        Или ВариантЗаполненияДекларации = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДекларацииИСМП.КодыМаркировки")
		        И (ЗначениеЗаполнено(ОперацияНанесения)
					И УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиНанесениеНеЗавершен().Найти(Форма.СтатусИСМП) = Неопределено
				    Или Не ЗначениеЗаполнено(ОперацияНанесения) 
				    И СтатусИСМП = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.Черновик")))) Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура УТ_11_4_МаркировкаТоваровИСМП_УстановитьФорматСрокГодности(Форма)

	ЭтоВидПродукцииСоСрокамиГодности = ИнтеграцияИСМПКлиентСервер_ЭтоВидПродукцииСоСрокамиГодности(Форма.Объект.ВидПродукции, Ложь);
		
	Если ИнтеграцияИСКлиентСервер_ЭтоМолочнаяПродукцияИСМП(Форма.Объект.ВидПродукции) Тогда
		ФорматДаты = "ДФ=dd.MM.yyyy;";

		Если Форма.Объект.СкоропортящаясяПродукция Тогда
			ФорматДаты = "ДФ='dd.MM.yyyy HH:mm';";
		Иначе
			Форма.Объект.СрокГодности = НачалоДня(Форма.Объект.СрокГодности);
		КонецЕсли;

		Форма.Элементы.СрокГодности.Формат               = ФорматДаты;
		Форма.Элементы.СрокГодности.ФорматРедактирования = ФорматДаты;
	ИначеЕсли ЭтоВидПродукцииСоСрокамиГодности Тогда
		ФорматДаты = "ДФ=dd.MM.yyyy;";
		Форма.Элементы.СрокГодности.Формат               = ФорматДаты;
		Форма.Элементы.СрокГодности.ФорматРедактирования = ФорматДаты;
	Иначе
		Форма.Объект.СрокГодности = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УТ_11_4_МаркировкаТоваровИСМП_УстановитьФорматДатыПроизводства(Форма, ПрисутствуетОперацияНанесения)
	
	Если Форма.Объект.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Пиво")
		И ПрисутствуетОперацияНанесения Тогда
		ФорматДатыПроизводства = "ДФ='dd.MM.yyyy HH:mm';";
	Иначе
		ФорматДатыПроизводства = "ДФ=dd.MM.yyyy;";
	КонецЕсли;
	
	Форма.Элементы.ДатаПроизводства.Формат               = ФорматДатыПроизводства;
	Форма.Элементы.ДатаПроизводства.ФорматРедактирования = ФорматДатыПроизводства;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УТ_11_4_МаркировкаТоваровИСМП_НастроитьВидимостьНомерСтрокиОтчетПроизводственнойЛинии(Форма)

	Элементы = Форма.Элементы;
	Элементы.ДанныеОтчетаПроизводственнойЛинииНомерСтроки.Видимость = Не Форма.ДанныеОтчетаЗагруженыВРегистр;
	Элементы.ДанныеОтчетаПроизводственнойЛинииКлючЗаписи.Видимость  = Форма.ДанныеОтчетаЗагруженыВРегистр;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиВводВОборотНеЗавершен()
	
	СтатусыКодыМаркировки = Новый Массив;
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.Черновик"));
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.ВводВОборотКПередаче"));
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.ВводВОборотОбрабатывается"));
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.ВводВОборотОшибкаПередачи"));
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиВведеныВОборотЧастично"));

	Возврат СтатусыКодыМаркировки;
	
КонецФункции

&НаСервереБезКонтекста
Функция УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиНанесениеНеЗавершен()
	
	ЗначенияПеречисления = Метаданные.Перечисления.СтатусыОбработкиМаркировкиТоваровИСМП.ЗначенияПеречисления;
	
	ИменаСтатусов = Новый Массив;
	ИменаСтатусов.Добавить("Черновик");
	ИменаСтатусов.Добавить("ОтчетКПередаче");
	ИменаСтатусов.Добавить("ОтчетОбрабатывается");
	ИменаСтатусов.Добавить("ОтчетОшибкаПередачи");
	ИменаСтатусов.Добавить("КодыМаркировкиНанесеныЧастично");
	ИменаСтатусов.Добавить("ОтчетСтатусНеопределен");
	
	СтатусыКодыМаркировки = Новый Массив;
	Для каждого ИмяСтатуса ИЗ ИменаСтатусов Цикл
		Если ЗначенияПеречисления.Найти(ИмяСтатуса) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП." + ИмяСтатуса));
	КонецЦикла;
	
	Возврат СтатусыКодыМаркировки;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиАгрегацияНеЗавершен()

	СтатусыКодыМаркировки = Новый Массив;
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.Черновик"));
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.АгрегацияКПередаче"));
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.АгрегацияОбрабатывается"));
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.АгрегацияОшибкаПередачи"));
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.КодыМаркировкиАгрегированыЧастично"));

	Возврат СтатусыКодыМаркировки;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УТ_11_4_МаркировкаТоваровИСМП_СтатусыКодыМаркировкиФормированиеАТКНеЗавершен()

	СтатусыКодыМаркировки = Новый Массив;
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.Черновик"));
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.ФормированиеАТККПередаче"));
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.ФормированиеАТКОбрабатывается"));
	СтатусыКодыМаркировки.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыОбработкиМаркировкиТоваровИСМП.ФормированиеАТКОшибкаПередачи"));

	Возврат СтатусыКодыМаркировки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УТ_11_4_МаркировкаТоваровИСМП_УстановитьВидимостьЭлементовСтатусИННВладельца(Элементы, Видимость)
	Элементы.ДанныеОтчетаПроизводственнойЛинииСтатус.Видимость          = Видимость;
	Элементы.ДанныеОтчетаПроизводственнойЛинииСтатусУпаковки.Видимость  = Видимость;
	Элементы.ДанныеОтчетаПроизводственнойЛинииСтатус1.Видимость         = Видимость;
	Элементы.ДанныеОтчетаПроизводственнойЛинииСтатусУпаковки1.Видимость = Видимость;
	Элементы.ДанныеОтчетаПроизводственнойЛинииИННВладельца.Видимость          = Видимость;
	Элементы.ДанныеОтчетаПроизводственнойЛинииИННВладельцаУпаковки.Видимость  = Видимость;
	Элементы.ДанныеОтчетаПроизводственнойЛинииИННВладельца1.Видимость         = Видимость;
	Элементы.ДанныеОтчетаПроизводственнойЛинииИННВладельцаУпаковки1.Видимость = Видимость;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УТ_11_4_МаркировкаТоваровИСМП_РедактированиеНедоступноПоСтатусуПроверкиИподбора(Форма)
	
	Если Форма.СтатусПроверкиИПодбора = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиИПодбораИС.Выполняется")
		Или Форма.СтатусПроверкиИПодбора = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиИПодбораИС.Завершено") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция УТ_11_4_МаркировкаТоваровИСМП_ДоступнаОперацияНанесенияПоВидуОперацииИСМП(Операция)
	
	ЗначенияПеречисления = Метаданные.Перечисления.ВидыОперацийИСМП.ЗначенияПеречисления;
	
	ИменаВидовОпераций = Новый Массив;
	ИменаВидовОпераций.Добавить("ВводВОборотПроизводствоРФ");
	ИменаВидовОпераций.Добавить("ВводВОборотПроизводствоВнеЕАЭС");
	ИменаВидовОпераций.Добавить("ВводВОборотТрансграничнаяТорговля");
	ИменаВидовОпераций.Добавить("ВводВОборотКонтрактноеПроизводствоЕАЭС");
	ИменаВидовОпераций.Добавить("ВводВОборотПолучениеПродукцииОтФизическихЛиц");
	ИменаВидовОпераций.Добавить("ВводВОборотПроизводствоРФПоДоговору");
	ИменаВидовОпераций.Добавить("ВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика");
	ИменаВидовОпераций.Добавить("ВводВОборотИмпортСФТС");
	ИменаВидовОпераций.Добавить("ВводВОборотИмпортСФТСМех");
	
	ДоступнаОперацияНанесенияПоВидуОперацииИСМП = Ложь;
	
	Для каждого ВидОперации ИЗ ИменаВидовОпераций Цикл
		Если ЗначенияПеречисления.Найти(ВидОперации) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
	
		Если Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП." + ВидОперации) Тогда
			ДоступнаОперацияНанесенияПоВидуОперацииИСМП = Истина;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДоступнаОперацияНанесенияПоВидуОперацииИСМП;
	
КонецФункции

&НаСервере
Функция УТ_11_4_МаркировкаТоваровИСМП_ОпределитьДоступностьОтчетаПроизводственнойЛинии(ВидПродукции, ОперацииМаркировки, ОперацияНанесения, ЗначенияПеречисления = Неопределено)
	
	Возврат РеквизитФормыВЗначение("Объект").ИСМП_ОпределитьДоступностьОтчетаПроизводственнойЛинии(ВидПродукции, ОперацииМаркировки, ОперацияНанесения);
	
КонецФункции

&НаСервереБезКонтекста
Функция УТ_11_4_МаркировкаТоваровИСМП_ВидыПродукцииОперацииИмпортСФТС(ЗначенияПеречисления)
	
	ВидыПродукцииОперацииИмпортСФТС = Новый Соответствие;
	
	ИменаВидовПродукцииОперацииИмпортСФТС = Новый Массив;
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("Духи");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("Обувь");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("ЛегкаяПромышленность");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("ЛегкаяПромышленность2025");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("Фотоаппараты");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("Шины");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("МолочнаяПродукцияБезВЕТИС");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("МолочнаяПродукцияПодконтрольнаяВЕТИС");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("УпакованнаяВода");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("Велосипеды");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("Пиво");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("ПивоВПотребительскихУпаковках");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("Антисептики");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("КреслаКоляски");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("ТехническиеСредстваРеабилитации");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("МедицинскиеИзделия");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("МедицинскиеИзделия20");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("СоковаяПродукция");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("БезалкогольныеНапитки");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("БАДы");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("ИгрыИИгрушкиДляДетей");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("ПарфюмерныеИКосметическиеСредстваИБытоваяХимия");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("МорепродуктыПодконтрольныеВЕТИС");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("РастительныеМасла");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("ДезинфицирующиеСредства");
	ИменаВидовПродукцииОперацииИмпортСФТС.Добавить("БАДы2025");
	
	Для каждого ИмяВидаПродукции ИЗ ИменаВидовПродукцииОперацииИмпортСФТС Цикл
		Если ЗначенияПеречисления.Найти(ИмяВидаПродукции) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВидыПродукцииОперацииИмпортСФТС.Вставить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС." + ИмяВидаПродукции), Истина);
	КонецЦикла;
	
	Возврат ВидыПродукцииОперацииИмпортСФТС;
	
КонецФункции

&НаСервереБезКонтекста
Функция УТ_11_4_МаркировкаТоваровИСМП_ВидыПродукцииОперацииПроизводствоВнеЕАЭС(ЗначенияПеречисления)
	
	ВидыПродукцииОперацииПроизводствоВнеЕАЭС = Новый Соответствие;
	
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС = Новый Массив;
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("Антисептики");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("БезалкогольноеПиво");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("БАДы");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("Велосипеды");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("КреслаКоляски");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ТехническиеСредстваРеабилитации");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("МедицинскиеИзделия");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("МедицинскиеИзделия20");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("МолочнаяПродукцияБезВЕТИС");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("МолочнаяПродукцияПодконтрольнаяВЕТИС");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("МорепродуктыПодконтрольныеВЕТИС");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ЛегкаяПромышленность");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ЛегкаяПромышленность2025");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("СоковаяПродукция");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("БезалкогольныеНапитки");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("КормаДляЖивотныхПодконтрольныеВЕТИС");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("КормаДляЖивотныхБезВЕТИС");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("КормаДляЖивотныхВлажныеБезВЕТИС");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ВетеринарныеПрепараты");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ИгрыИИгрушкиДляДетей");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("РадиоэлектроннаяПродукция");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("КонсервированнаяПродукцияПодконтрольнаяВЕТИС");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("КонсервированнаяПродукцияБезВЕТИС");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("РастительныеМасла");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ОптоволокноИОптоволоконнаяПродукция");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ПарфюмерныеИКосметическиеСредстваИБытоваяХимия");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ПечатнаяПродукция");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("СтроительныеМатериалы");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ОтопительныеПриборы");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("Бакалея");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("АлкогольнаяПродукцияДо9Процентов");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ТелефоныИНоутбуки");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ПиротехническиеИзделияИСредстваПожарнойБезопасности");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("КабельнаяПродукция");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("МоторныеМасла");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ПолимерныеТрубы");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("СладостиИКондитерскиеИзделия");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ПечатныеПлаты");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("ДезинфицирующиеСредства");
	ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС.Добавить("БАДы2025");
		
	Для каждого ИмяВидаПродукции ИЗ ИменаВидовПродукцииОперацииПроизводствоВнеЕАЭС Цикл
		Если ЗначенияПеречисления.Найти(ИмяВидаПродукции) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВидыПродукцииОперацииПроизводствоВнеЕАЭС.Вставить(ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС." + ИмяВидаПродукции), Истина);
	КонецЦикла;
	
	Возврат ВидыПродукцииОперацииПроизводствоВнеЕАЭС;
	
КонецФункции

// см. Документ.МаркировкаТоваровИСМП.Форма.ФормаДокумента.ИнициализироватьСтруктуруЗаполненияСлужебныхРеквизитовНоменклатуры
&НаСервереБезКонтекста
Функция УТ_11_4_МаркировкаТоваровИСМП_ИнициализироватьСтруктуруЗаполненияСлужебныхРеквизитовНоменклатуры(ЗаполнитьКодТНВЭД)
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("Номенклатура");
	СтруктураЗаполнения.Вставить("Характеристика");
	СтруктураЗаполнения.Вставить("Серия");
	СтруктураЗаполнения.Вставить("ХарактеристикиИспользуются");
	СтруктураЗаполнения.Вставить("ТипНоменклатуры");
	СтруктураЗаполнения.Вставить("СтатусУказанияСерий");
	
	Если ЗаполнитьКодТНВЭД Тогда
		СтруктураЗаполнения.Вставить("КодТНВЭД");
	КонецЕсли;
	
	Возврат СтруктураЗаполнения;
	
КонецФункции

// см. Документ.МаркировкаТоваровИСМП.Форма.ФормаДокумента.ЗаполнитьСлужебныеРеквизитыНоменклатуры
&НаСервереБезКонтекста
Функция УТ_11_4_МаркировкаТоваровИСМП_ЗаполнитьСлужебныеРеквизитыНоменклатуры(
	Форма, ТекущаяСтрока, КэшированныеЗначения = Неопределено, ПараметрыУказанияСерий = Неопределено)
	
	ОбщегоНазначения.ОбщийМодуль("СобытияФормИСПереопределяемый").ПриИзмененииНоменклатуры(
		Форма, ТекущаяСтрока, КэшированныеЗначения, ПараметрыУказанияСерий);
	
КонецФункции

&НаКлиенте
Процедура УТ_11_4_МаркировкаТоваровИСМП_УстановитьУсловноеОформлениеВНетабличноеПоле(Форма)

	ЭлементыФормы = Форма.Элементы;
	
	СтруктураЗаполнения =
		УТ_11_4_МаркировкаТоваровИСМП_ИнициализироватьСтруктуруЗаполненияСлужебныхРеквизитовНоменклатуры(Ложь);
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Форма);
	
	СтруктураФормы = Новый Структура;
	СтруктураФормы.Вставить("Объект", 	Форма.Объект);
	СтруктураФормы.Вставить("ИмяФормы", "Документ.МаркировкаТоваровИСМП.Форма.ФормаДокумента");
	
	УТ_11_4_МаркировкаТоваровИСМП_ЗаполнитьСлужебныеРеквизитыНоменклатуры(
		СтруктураФормы, СтруктураЗаполнения,, Форма.ПараметрыУказанияСерий);
	
	ЗаполнитьЗначенияСвойств(Форма, СтруктураЗаполнения);
	
	// см. СобытияФормИСПереопределяемый.УстановитьУсловноеОформлениеХарактеристикНоменклатуры
	ИмяПоляВводаХарактеристики = "Характеристика";
	
	Если НЕ Форма.ХарактеристикиИспользуются Тогда
		ЭлементыФормы[ИмяПоляВводаХарактеристики].ЦветТекста 				= ПолучитьЦветСтиля("ТекстЗапрещеннойЯчейкиЦвет");
		ЭлементыФормы[ИмяПоляВводаХарактеристики].АвтоОтметкаНезаполненного = Ложь;
		ЭлементыФормы[ИмяПоляВводаХарактеристики].ПодсказкаВвода 			= НСтр("ru = '<характеристики не используются>'");
		ЭлементыФормы[ИмяПоляВводаХарактеристики].ТолькоПросмотр 			= Истина;
	Иначе
		ЭлементыФормы[ИмяПоляВводаХарактеристики].ЦветТекста 				= ПолучитьЦветСтиля("ЦветТекстаПоля");
		ЭлементыФормы[ИмяПоляВводаХарактеристики].ПодсказкаВвода 			= "";
		ЭлементыФормы[ИмяПоляВводаХарактеристики].ТолькоПросмотр 			= Ложь;
	КонецЕсли;
	
	// см. СобытияФормИСПереопределяемый.УстановитьУсловноеОформлениеСерийНоменклатуры
	ИмяПоляВводаСерии 				   = "Серия";
	ПутьКПолюОтбораСтатусУказанияСерий = "СтатусУказанияСерий";
	ПутьКПолюОтбораТипНоменклатуры 	   = "ТипНоменклатуры";
	ПутьКПолюОтбораСерия 			   = "Серия";
	
	Если НЕ ПолучитьФункциональнуюОпциюНаСервере("ИспользоватьСерииНоменклатуры") Тогда
		ЭлементыФормы[ИмяПоляВводаСерии].Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	СписокТиповДляСерий = Новый СписокЗначений;
	СписокТиповДляСерий.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар"));
	СписокТиповДляСерий.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара"));
	
	Если Форма[ПутьКПолюОтбораСтатусУказанияСерий] = 0
		И НЕ СписокТиповДляСерий.НайтиПоЗначению(Форма[ПутьКПолюОтбораТипНоменклатуры]) = Неопределено Тогда
		ЭлементыФормы[ИмяПоляВводаСерии].ЦветТекста 				= ПолучитьЦветСтиля("ТекстЗапрещеннойЯчейкиЦвет");
		ЭлементыФормы[ИмяПоляВводаСерии].АвтоОтметкаНезаполненного 	= Ложь;
		ЭлементыФормы[ИмяПоляВводаСерии].ПодсказкаВвода 			= НСтр("ru = '<серия не указывается>'");
		ЭлементыФормы[ИмяПоляВводаСерии].ТолькоПросмотр 			= Истина;
	Иначе
		ЭлементыФормы[ИмяПоляВводаСерии].ЦветТекста 				= ПолучитьЦветСтиля("ЦветТекстаПоля");
		ЭлементыФормы[ИмяПоляВводаСерии].ПодсказкаВвода 			= "";
		ЭлементыФормы[ИмяПоляВводаСерии].ТолькоПросмотр 			= Ложь;
	КонецЕсли;
	
	// Статусы FEFO
	СписокСтатусовСерий = Новый СписокЗначений;
	СписокСтатусовСерий.Добавить(5);
	СписокСтатусовСерий.Добавить(6);
	СписокСтатусовСерий.Добавить(25);

	Если НЕ СписокСтатусовСерий.НайтиПоЗначению(Форма[ПутьКПолюОтбораСтатусУказанияСерий]) = Неопределено
		И НЕ ЗначениеЗаполнено(Форма[ПутьКПолюОтбораСерия]) Тогда
		ЭлементыФормы[ИмяПоляВводаХарактеристики].ЦветТекста 				= ПолучитьЦветСтиля("ТекстЗапрещеннойЯчейкиЦвет");
		ЭлементыФормы[ИмяПоляВводаХарактеристики].АвтоОтметкаНезаполненного = Ложь;
		ЭлементыФормы[ИмяПоляВводаХарактеристики].ПодсказкаВвода 			= НСтр("ru = '<Автозаполнение FEFO>'");
		ЭлементыФормы[ИмяПоляВводаХарактеристики].ТолькоПросмотр 			= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, УровеньСтрокой, Комментарий, РежимОтладки = "ТолькоОшибки")
	
	// Режимы отладки:
	// "Полный"
	// "ТолькоОшибки", по умолчанию и если режим не задан, то режим "ТолькоОшибки",
	// "БезОтладки", никакая интформация не пишется в ЖР
	Если РежимОтладки = "БезОтладки" Тогда
		Возврат;
	КонецЕсли;
	
	Если УровеньСтрокой = "Информация" Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	ИначеЕсли УровеньСтрокой = "Ошибка" Тогда	
		Уровень = УровеньЖурналаРегистрации.Ошибка;		
	ИначеЕсли УровеньСтрокой = "Предупреждение" Тогда
		Уровень = УровеньЖурналаРегистрации.Предупреждение;
	ИначеЕсли УровеньСтрокой = "Примечание" Тогда
		Уровень = УровеньЖурналаРегистрации.Примечание;			
	Иначе
		Уровень = УровеньЖурналаРегистрации.Информация;	
	КонецЕсли;
	
	Если РежимОтладки = "ТолькоОшибки" И Уровень = УровеньЖурналаРегистрации.Ошибка Тогда
		ЗаписьЖурналаРегистрации("КлеверенсТСД." + ИмяСобытия, Уровень, , , Комментарий);	
	ИначеЕсли РежимОтладки = "Полный" Тогда	
		ЗаписьЖурналаРегистрации("КлеверенсТСД." + ИмяСобытия, Уровень, , , Комментарий);
	Иначе
		Возврат
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Функция ВернутьСтатусДокумента(АдресХранилища) 
	
	Если ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		ДокСтруктура = ПолучитьИзВременногоХранилища(АдресХранилища);
	КонецЕсли;
	
	МенеджерОбъекта 			= ИнтеграцияИС_МенеджерОбъектаПоСсылке(ДокСтруктура.СсылкаНаДокумент);
	ДальнейшееДействие 			= МенеджерОбъекта.ДальнейшееДействиеПоУмолчанию(Новый Структура("ОбъектРасчета", ДокСтруктура.ДокументОбъект));
	ДопустимыеДействия 			= Новый Массив;
			
	Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСМП").ПредставлениеСтатуса(ДокСтруктура.СтатусИСМП, ДальнейшееДействие, ДопустимыеДействия);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьНалогообложениеНДСПродажиВозврата(НалогообложениеНДС, СтруктураОбъекта);
	
	ПараметрыЗаполнения = Документы.ВозвратТоваровОтКлиента.ПараметрыЗаполненияНалогообложенияНДСПродажи(СтруктураОбъекта);
	ОбщегоНазначения.ОбщийМодуль("УчетНДСУП").ЗаполнитьНалогообложениеНДСПродажи(НалогообложениеНДС, ПараметрыЗаполнения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УТ_11_4_ПолучитьИспользованиеХарактеристик(Товары)              

	ТоварХарактеристика = Новый Соответствие;
	Для Каждого Номенклатура Из Товары Цикл   		                                                       
		ТоварХарактеристика.Вставить(Номенклатура, Справочники.Номенклатура.ХарактеристикиИспользуются(Номенклатура));		
	КонецЦикла;	
	
	Возврат ТоварХарактеристика;
	
КонецФункции

&НаСервере
Функция УТ_11_4_ХарактеристикиИспользуются(Номенклатура)

    УчетПоХарактеристикам = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	Если НЕ УчетПоХарактеристикам Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Возврат Справочники.Номенклатура.ХарактеристикиИспользуются(Номенклатура);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации("УТ_11_4_ХарактеристикиИспользуются", "Ошибка",
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЦветСтиля(Цвет)
	
	Возврат ЦветаСтиля[Цвет];
	
КонецФункции

&НаКлиенте
Процедура УТ_11_4_УстановитьДоступностьСоглашений(ДокументОбъект, ЭлементыФормы)
	
	Если ДокументОбъект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо") Тогда
		ЭлементыФормы.Соглашение.Видимость = Ложь;
	ИначеЕсли ЗначениеЗаполнено(ДокументОбъект.Партнер) Тогда
		КоличествоСоглашенийСПоставшиком = ОбщегоНазначенияКлиент.ОбщийМодуль("ЗакупкиВызовСервера").ПолучитьКоличествоСоглашенийСПоставщиком(ДокументОбъект.Партнер);
		ЭлементыФормы.Соглашение.Видимость = ЗначениеЗаполнено(ДокументОбъект.Соглашение) ИЛИ КоличествоСоглашенийСПоставшиком > 0;
	Иначе
		ЭлементыФормы.Соглашение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УТ_11_4_УстановитьДоступностьДоговора(ДокументОбъект, ДоступностьЭлемента, ВидимостьЭлемента, Договор = Неопределено)
	
	ОбщегоНазначения.ОбщийМодуль("ЗакупкиСервер").УстановитьДоступностьДоговора(ДокументОбъект, ДоступностьЭлемента, ВидимостьЭлемента, Договор);
	
КонецПроцедуры

// см. ВзаиморасчетыСервер.ОбновитьРаспределеннуюСуммаРасшифровки
&НаСервере
Функция УТ_11_4_ВозвратТоваровОтКлиента_ОбновитьРаспределеннуюСуммуРасшифровки(ДокументОбъект)

	РаспределеннаяСуммаРасшифровки = 0;
	
	СтруктураПараметров = Документы.ВозвратТоваровОтКлиента.ПараметрыВзаиморасчеты(ДокументОбъект);
	
	Организация = ДокументОбъект[СтрЗаменить(СтруктураПараметров.Организация, "Объект.", "")];
	ТипРасчетов = СтруктураПараметров.ТипРасчетов;
		
	ОбъектРасчетов = Новый Массив;
	ОбъектРасчетов.Добавить(ОбщегоНазначения.ОбщийМодуль("ОбъектыРасчетовСервер").ПолучитьОбъектРасчетовПоСсылке(
		ДокументОбъект[СтрЗаменить(СтруктураПараметров.Ссылка, "Объект.", "")], Организация, ТипРасчетов));
	ОбъектРасчетов.Добавить(ОбщегоНазначения.ОбщийМодуль("ОбъектыРасчетовСервер").ПолучитьОбъектРасчетовПоСсылке(
		ДокументОбъект[СтрЗаменить(СтруктураПараметров.Договор, "Объект.", "")], Организация, ТипРасчетов));
	Если ЗначениеЗаполнено(СтруктураПараметров.ЗаказОснование) Тогда
		ОбъектРасчетов.Добавить(ОбщегоНазначения.ОбщийМодуль("ОбъектыРасчетовСервер").ПолучитьОбъектРасчетовПоСсылке(
			ДокументОбъект[СтрЗаменить(СтруктураПараметров.ЗаказОснование, "Объект.", "")], Организация, ТипРасчетов));
	КонецЕсли;
		
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Расшифровка.Сумма КАК Сумма,
	|	Расшифровка.ОбъектРасчетов КАК ОбъектРасчетов
	|ПОМЕСТИТЬ ВтРасшифровка 
	|ИЗ &ТЧ КАК Расшифровка
	|;
	|ВЫБРАТЬ
	|	СУММА(Расшифровка.Сумма) КАК Сумма
	|ИЗ
	|	ВтРасшифровка КАК Расшифровка
	|ГДЕ
	|	НЕ Расшифровка.ОбъектРасчетов В (&ОбъектРасчетов)
	|	И Расшифровка.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)");
	Запрос.УстановитьПараметр("ТЧ", ДокументОбъект.РасшифровкаПлатежа.Выгрузить());
	Запрос.УстановитьПараметр("ОбъектРасчетов", ОбъектРасчетов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		РаспределеннаяСуммаРасшифровки = Выборка.Сумма;
		
		Если НЕ ЗначениеЗаполнено(РаспределеннаяСуммаРасшифровки) Тогда
			РаспределеннаяСуммаРасшифровки = 0;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РаспределеннаяСуммаРасшифровки;
	
КонецФункции

&НаКлиенте
Процедура УТ_11_2_РеализацияТоваровУслуг_УстановитьВидимостьЭлементовДоставки(ЭлементыФормы, ДокОбъект)

	// см. ДоставкаТоваров.ПриИзмененииСпособаДоставки
	
    ЭтоДоставкаНаНашСклад = ОбщегоНазначенияКлиент.ОбщийМодуль("ДоставкаТоваровКлиентСервер").ЭтоРаспоряжениеНаДоставкуНаНашСклад(ДокОбъект.Ссылка);
	
	ЭтоДоговорСоглашение = ТипЗнч(ДокОбъект.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
		Или ТипЗнч(ДокОбъект.Ссылка) = Тип("СправочникСсылка.СоглашенияСПоставщиками");	
	
	Если ЭлементыФормы.Найти("СтраницыДоставки") <> Неопределено Тогда
		РаспоряжениеПоСоглашению = ЭтоДоставкаНаНашСклад И УТ_11_2_РеализацияТоваровУслуг_ЭтоРаспоряжениеПоСоглашению(ДокОбъект);
		ДоставкаОпределенаВДоговоре = ЭтоДоставкаНаНашСклад И УТ_11_2_РеализацияТоваровУслуг_ДоставкаОпределенаВДоговоре(ДокОбъект);
		
		РаспоряжениеПоДоговору = Не ЭтоДоговорСоглашение И ДоставкаОпределенаВДоговоре;
		
		ОбщегоНазначенияКлиент.ОбщийМодуль("ДоставкаТоваровКлиентСервер").УстановитьСтраницуДоставки(ЭлементыФормы,
			ДокОбъект.СпособДоставки,
			УТ_11_2_РеализацияТоваровУслуг_ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками(),
			РаспоряжениеПоСоглашению,
			РаспоряжениеПоДоговору);
	КонецЕсли;
	
	// см. ДоставкаТоваров.ОсобыеУсловияПеревозкиУстановитьДоступность
	
	Если ЭлементыФормы.Найти("ОсобыеУсловияПеревозкиОписание") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОсобыеУсловияПеревозки = ДокОбъект.ОсобыеУсловияПеревозки;
	ЭлементыФормы.ОсобыеУсловияПеревозкиОписание.Доступность = ОсобыеУсловияПеревозки;
	Если ЭлементыФормы.Найти("ОсобыеУсловияПеревозкиОписание1") <> Неопределено Тогда
		ЭлементыФормы.ОсобыеУсловияПеревозкиОписание1.Доступность = ОсобыеУсловияПеревозки;
	КонецЕсли;
	Если ЭлементыФормы.Найти("ОсобыеУсловияПеревозкиОписание2") <> Неопределено Тогда
		ЭлементыФормы.ОсобыеУсловияПеревозкиОписание2.Доступность = ОсобыеУсловияПеревозки;
	КонецЕсли;
	Если ЭлементыФормы.Найти("ОсобыеУсловияПеревозкиОписаниеДоставкаПеревозчиком") <> Неопределено Тогда
		ЭлементыФормы.ОсобыеУсловияПеревозкиОписаниеДоставкаПеревозчиком.Доступность = ОсобыеУсловияПеревозки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УТ_11_2_РеализацияТоваровУслуг_ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками()

	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками");
	
КонецФункции

// см. ДоставкаТоваров.ЭтоРаспоряжениеПоСоглашению
&НаКлиенте
Функция УТ_11_2_РеализацияТоваровУслуг_ЭтоРаспоряжениеПоСоглашению(ДокОбъект)

	ПараметрыПриемки = Неопределено;
	
	Если ОбщегоНазначенияКлиент.ОбщийМодуль("ДоставкаТоваровКлиентСервер").ЭтоРаспоряжениеНаДоставкуНаНашСклад(ДокОбъект)
			И ДокОбъект.Свойство("Соглашение")
			И ЗначениеЗаполнено(ДокОбъект.Соглашение) Тогда
		
		Если ПараметрыПриемки = Неопределено Тогда
			
			ПараметрыПриемки = УТ_11_2_РеализацияТоваровУслуг_ПолучитьПараметрыПриемки(ДокОбъект);
			
		КонецЕсли;
		
		Возврат ПараметрыПриемки.СоглашениеЯвляетсяРаспоряжением И Не ПараметрыПриемки.ЭтоДокументПоступление;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// см. ДоставкаТоваров.ДоставкаОпределенаВДоговоре
&НаСервере
Функция УТ_11_2_РеализацияТоваровУслуг_ДоставкаОпределенаВДоговоре(ДокОбъект)

	Если ДокОбъект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоДоговор = (ТипЗнч(ДокОбъект.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	
	РаспоряжениеНаДоставкуНаНашСклад = Ложь;
	
	Если ТипЗнч(ДокОбъект) = Тип("ДанныеФормыСтруктура")
		Или ТипЗнч(ДокОбъект) = Тип("Структура") Тогда
		РаспоряжениеНаДоставкуНаНашСклад = ОбщегоНазначения.ОбщийМодуль("ДоставкаТоваровКлиентСервер").ЭтоРаспоряжениеНаДоставкуНаНашСклад(ДокОбъект)
			И ДокОбъект.Свойство("Договор")
			И ЗначениеЗаполнено(ДокОбъект.Договор);
	Иначе
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(ДокОбъект.Ссылка));
		ЕстьДоговор = ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор", МетаданныеОбъекта);
		
		РаспоряжениеНаДоставкуНаНашСклад = 
			(ОбщегоНазначения.ОбщийМодуль("ДоставкаТоваровКлиентСервер").ЭтоРаспоряжениеНаДоставкуНаНашСклад(ДокОбъект)
			 И ЭтоДоговор)
			Или (ЕстьДоговор
				И ЗначениеЗаполнено(ДокОбъект.Договор));
	КонецЕсли;
	
	Если РаспоряжениеНаДоставкуНаНашСклад Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Если ЭтоДоговор Тогда
			СпособДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.Ссылка, "СпособДоставки");
		Иначе
			СпособДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.Договор, "СпособДоставки");
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
		СпособыДоставки = Новый Массив;

		Если ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками") Тогда
			СпособыДоставки.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада);
		КонецЕсли;

		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада);
		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи);
		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.НашимиСиламиСАдресаОтправителя);
		СпособыДоставки.Добавить(Перечисления.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки);
		
		ДоставкаИспользуется = СпособыДоставки.Найти(СпособДоставки) <> Неопределено;
		
		Возврат ДоставкаИспользуется;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// см. ДоставкаТоваров.ПолучитьПараметрыПриемки
&НаСервере
Функция УТ_11_2_РеализацияТоваровУслуг_ПолучитьПараметрыПриемки(ОбъектСсылка, Знач ВариантПриемкиТоваров = Неопределено, НакладнаяПоЗаказам = Ложь)

	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ОбъектСсылка)) Тогда
		Ссылка = ОбъектСсылка;
	Иначе
		Ссылка = ОбъектСсылка.Ссылка;
	КонецЕсли;
	
	Если ВариантПриемкиТоваров = Неопределено Тогда
		
		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда
			
			ВариантПриемкиТоваров = ?(ЗначениеЗаполнено(Ссылка),
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВариантПриемкиТоваров"),
				Константы.ВариантПриемкиТоваров.Получить());
			
		ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			ВариантПриемкиТоваров = ?(ЗначениеЗаполнено(Ссылка),
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВариантПриемкиТоваров"),
				Константы.ВариантПриемкиТоваров.Получить());
			
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
			И ТипЗнч(ОбъектСсылка) = Тип("ДанныеФормыСтруктура") Тогда
			
			ВариантПриемкиТоваров = ОбъектСсылка.ВариантПриемкиТоваров;
			НакладнаяПоЗаказам    = ОбъектСсылка.ПоступлениеПоЗаказам;
			
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику")
			И ТипЗнч(ОбъектСсылка) = Тип("ДанныеФормыСтруктура") Тогда
			
			ВариантПриемкиТоваров = ОбъектСсылка.ВариантПриемкиТоваров;
			НакладнаяПоЗаказам    = Ложь;
			
		Иначе
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ПриобретениеТоваровУслуг.ВариантПриемкиТоваров КАК ВариантПриемкиТоваров,
			|	ПриобретениеТоваровУслуг.Ссылка                КАК Ссылка,
			|	ПриобретениеТоваровУслуг.ПоступлениеПоЗаказам  КАК ПоступлениеПоЗаказам
			|ИЗ
			|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
			|ГДЕ
			|	ПриобретениеТоваровУслуг.Ссылка = &Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаказПоставщику.ВариантПриемкиТоваров         КАК ВариантПриемкиТоваров,
			|	ЗаказПоставщику.Ссылка                        КАК Ссылка,
			|	ЛОЖЬ                                          КАК ПоступлениеПоЗаказам
			|ИЗ
			|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
			|ГДЕ
			|	ЗаказПоставщику.Ссылка = &Ссылка");
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров.Получить();
			Иначе
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				ВариантПриемкиТоваров	= Выборка.ВариантПриемкиТоваров;
				НакладнаяПоЗаказам		= Выборка.ПоступлениеПоЗаказам;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура(
	"ДокументПоступление,
	|СоглашениеЯвляетсяРаспоряжением,
	|ДоговорЯвляетсяРаспоряжением,
	|ЭтоДоговорКонтрагента,
	|ЭтоРаспоряжение,
	|ЭтоДокументПоступление,
	|СкладСоглашения");
	
	СтруктураВозврата.СоглашениеЯвляетсяРаспоряжением = Ложь;
	СтруктураВозврата.ДоговорЯвляетсяРаспоряжением    = (Справочники.ДоговорыКонтрагентов.ДоговорИспользуетсяПриПриемке(ВариантПриемкиТоваров));
	СтруктураВозврата.ЭтоДоговорКонтрагента           = (ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	
	Договор = Неопределено;
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Договор = Ссылка;
	ИначеЕсли ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияУТКлиентСервер").ЕстьРеквизитОбъекта(Ссылка, "Договор") Тогда
		Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Договор");
	КонецЕсли;
	
	РаспоряжениеНаПриемку = Неопределено;
	
	Если Справочники.СоглашенияСПоставщиками.СоглашениеИспользуетсяПриПриемке(ВариантПриемкиТоваров) Тогда
		
		Если ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.НеРазделенаПоНакладным") Тогда
			
			СтруктураВозврата.ДокументПоступление		= Тип("СправочникСсылка.СоглашенияСПоставщиками");
			РаспоряжениеНаПриемку						= Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
			
		ИначеЕсли ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.НеРазделенаПоЗаказамИНакладным") Тогда
			
			СтруктураВозврата.ДокументПоступление		= Тип("СправочникСсылка.СоглашенияСПоставщиками");
			РаспоряжениеНаПриемку						= Тип("ДокументСсылка.ЗаказПоставщику");
			
		ИначеЕсли ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.МожетПроисходитьБезЗаказовИНакладных") Тогда 
			
			СтруктураВозврата.ДокументПоступление		= Тип("СправочникСсылка.СоглашенияСПоставщиками");
			РаспоряжениеНаПриемку						= Тип("Неопределено");
			
		КонецЕсли;
		
		СтруктураВозврата.СоглашениеЯвляетсяРаспоряжением = Истина;
		
	ИначеЕсли Справочники.ДоговорыКонтрагентов.ДоговорИспользуетсяПриПриемке(ВариантПриемкиТоваров)
		И УТ_11_2_РеализацияТоваровУслуг_ДоставкаОпределенаВДоговоре(Договор) Тогда
		
		Если ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.ПоДоговорамПослеНакладных") Тогда
			
			СтруктураВозврата.ДокументПоступление		= Тип("СправочникСсылка.ДоговорыКонтрагентов");
			РаспоряжениеНаПриемку						= Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
			
		ИначеЕсли ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.ПоДоговорамПослеЗаказовИлиНакладных") Тогда
			
			СтруктураВозврата.ДокументПоступление		= Тип("СправочникСсылка.ДоговорыКонтрагентов");
			РаспоряжениеНаПриемку						= Тип("ДокументСсылка.ЗаказПоставщику");
			
		ИначеЕсли ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.ПоДоговорамБезЗаказовИНакладных") Тогда 
			
			СтруктураВозврата.ДокументПоступление		= Тип("СправочникСсылка.ДоговорыКонтрагентов");
			РаспоряжениеНаПриемку						= Тип("Неопределено");
			
		КонецЕсли;
		
	ИначеЕсли ОбщегоНазначения.ОбщийМодуль("ЗакупкиСервер").РаспоряжениеНаПриемкуТовараНакладная(ВариантПриемкиТоваров) Тогда
		
		СтруктураВозврата.ДокументПоступление			= Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
		РаспоряжениеНаПриемку							= Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") И Не НакладнаяПоЗаказам Тогда
		
		СтруктураВозврата.ДокументПоступление			= Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
		РаспоряжениеНаПриемку							= Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") И Не НакладнаяПоЗаказам Тогда
		
		СтруктураВозврата.ДокументПоступление			= Тип("ДокументСсылка.ПриемкаТоваровНаХранение");
		РаспоряжениеНаПриемку							= Тип("ДокументСсылка.ПриемкаТоваровНаХранение");
		
	ИначеЕсли ОбщегоНазначения.ОбщийМодуль("ЗакупкиСервер").РаспоряжениеНаПриемкуТовараЗаказ(ВариантПриемкиТоваров) Тогда 
		
		СтруктураВозврата.ДокументПоступление			= Тип("ДокументСсылка.ЗаказПоставщику");
		РаспоряжениеНаПриемку							= Тип("ДокументСсылка.ЗаказПоставщику");
		
	Иначе
		
		СтруктураВозврата.ДокументПоступление			= Тип("ДокументСсылка.ЗаказПоставщику");
		РаспоряжениеНаПриемку							= Тип("ДокументСсылка.ПриобретениеТоваровУслуг");
		
	КонецЕсли;
	
	СтруктураВозврата.ЭтоРаспоряжение					= ТипЗнч(Ссылка) = РаспоряжениеНаПриемку;
	СтруктураВозврата.ЭтоДокументПоступление			= ТипЗнч(Ссылка) = СтруктураВозврата.ДокументПоступление;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область ПереименованиеМодулей_БиблиотекаИнтеграцииГосИС_1_1_30

&НаСервере
Функция ИнтеграцияИС_МенеджерОбъектаПоСсылке(Ссылка)
	
	ИмяСобытия = "ИнтеграцияИС_МенеджерОбъектаПоСсылке";
	
	Попытка
		Возврат ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияИС").МенеджерОбъектаПоСсылке(Ссылка);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Попытка
		Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИС").МенеджерОбъектаПоСсылке(Ссылка);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Предупреждение", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ИнтеграцияИСКлиентСервер_ЭтоПродукцияИСМП(ВидПродукции, ВключатьТабачнуюПродукцию = Ложь, ВключатьМолочнуюПродукцию = Истина)
	
	ИмяСобытия = "ИнтеграцияИСКлиентСервер_ЭтоПродукцияИСМП";
	
	Попытка
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияИСКлиентСервер").ЭтоПродукцияИСМП(ВидПродукции, ВключатьТабачнуюПродукцию, ВключатьМолочнуюПродукцию);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Попытка
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ЭтоПродукцияИСМП(ВидПродукции, ВключатьТабачнуюПродукцию, ВключатьМолочнуюПродукцию);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Предупреждение", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ИнтеграцияИСКлиентСервер_ЭтоПродукцияМОТП(ВидПродукции)
	
	ИмяСобытия = "ИнтеграцияИСКлиентСервер_ЭтоПродукцияМОТП";
	
	Попытка
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияИСКлиентСервер").ЭтоПродукцияМОТП(ВидПродукции);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Попытка
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ЭтоПродукцияМОТП(ВидПродукции);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Предупреждение", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ИнтеграцияИСКлиентСервер_ЭтоПродукцияМОТП_НаСервере(ВидПродукции)
	
	Возврат РеквизитФормыВЗначение("Объект").ИнтеграцияИСКлиентСервер_ЭтоПродукцияМОТП(ВидПродукции);
	
КонецФункции

&НаКлиенте
Функция ИнтеграцияИСКлиентСервер_ЭтоПродукцияПодконтрольнаяВЕТИС(ВидПродукции)
	
	ИмяСобытия = "ИнтеграцияИСКлиентСервер_ЭтоПродукцияПодконтрольнаяВЕТИС";
	
	Попытка
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияИСКлиентСервер").ЭтоПродукцияПодконтрольнаяВЕТИС(ВидПродукции);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Попытка
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ЭтоПродукцияПодконтрольнаяВЕТИС(ВидПродукции);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Предупреждение", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ИнтеграцияИСКлиентСервер_ЭтоМолочнаяПродукцияИСМП(ВидПродукции)
	
	ИмяСобытия = "ИнтеграцияИСКлиентСервер_ЭтоМолочнаяПродукцияИСМП";
	
	Попытка
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияИСКлиентСервер").ЭтоМолочнаяПродукцияИСМП(ВидПродукции);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Попытка
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ЭтоМолочнаяПродукцияИСМП(ВидПродукции);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Предупреждение", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ИнтеграцияИСКлиентСервер_ВидПродукцииИспользуетНаборы(ВидПродукции)
	
	ИмяСобытия = "ИнтеграцияИСКлиентСервер_ВидПродукцииИспользуетНаборы";
	
	Попытка
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияИСКлиентСервер").ВидПродукцииИспользуетНаборы(ВидПродукции);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Попытка
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ВидПродукцииИспользуетНаборы(ВидПродукции);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Предупреждение", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ИнтеграцияИСКлиентСервер_ВидПродукцииИспользуетГрупповыеУпаковки(ВидПродукции)
	
	ИмяСобытия = "ИнтеграцияИСКлиентСервер_ВидПродукцииИспользуетГрупповыеУпаковки";
	
	Попытка
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияИСКлиентСервер").ВидПродукцииИспользуетГрупповыеУпаковки(ВидПродукции);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Попытка
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").ВидПродукцииИспользуетГрупповыеУпаковки(ВидПродукции);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Предупреждение", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ИнтеграцияИСПовтИсп_ЭтоПродукцияИСМП(ВидПродукции, ВключаяТабачнуюПродукцию = Ложь, ВключатьМолочнуюПродукцию = Истина, ВключатьПиво = Истина)
	
	ИмяСобытия = "ИнтеграцияИСПовтИсп_ЭтоПродукцияИСМП";
	
	Попытка
		Возврат ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияИСПовтИсп").ЭтоПродукцияИСМП(ВидПродукции, ВключаяТабачнуюПродукцию, ВключатьМолочнуюПродукцию, ВключатьПиво);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Попытка
		Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСПовтИсп").ЭтоПродукцияИСМП(ВидПродукции, ВключаяТабачнуюПродукцию, ВключатьМолочнуюПродукцию, ВключатьПиво);
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Предупреждение", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ИнтеграцияИСМПКлиентСервер_ЭтоВидПродукцииСоСрокамиГодности(ВидПродукции, УчитыватьМолочнуюПродукцию = Истина)
	
	Возврат РеквизитФормыВЗначение("Объект").ИСМП_ЭтоВидПродукцииСоСрокамиГодности(ВидПродукции, УчитыватьМолочнуюПродукцию);
	
КонецФункции

#КонецОбласти

#Область ПереименованиеМодулей_Прочее

&НаКлиенте
Процедура ИнтеграцияИСКлиентСервер_УстановитьДоступностьЭлементовФормы(Форма, МассивЭлементов, Доступно) Экспорт

	ИмяСобытия = "ИнтеграцияИСКлиентСервер_УстановитьДоступностьЭлементовФормы";
	
	Попытка
		ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияИСКлиентСервер").УстановитьДоступностьЭлементовФормы(Форма, МассивЭлементов, Доступно);
		Возврат;
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Попытка
		ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").УстановитьДоступностьЭлементовФормы(Форма, МассивЭлементов, Доступно);
		Возврат;
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Попытка
		ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСКлиентСервер").УправлениеДоступностьюЭлементовФормы(Форма, МассивЭлементов, Доступно);
		Возврат;
	Исключение
		ЗаписатьСобытиеВЖурналРегистрации(ИмяСобытия, "Информация", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти