
#Область ОбработчикиСобытий

//@skip-check module-accessibility-at-client
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ")
		И Параметры.Ключ = ДляОприходованияИзлишков Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ПредопределенныйЭлемент";
		
	Иначе
		
		ИнтеграцияЕГАИСВызовСервера.ПриПолученииФормыСправочника(
			"Справки2ЕГАИС",
			ВидФормы,
			Параметры,
			ВыбраннаяФорма,
			ДополнительнаяИнформация,
			СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти