#Область ПрограммныйИнтерфейс

// Проверяет, доступно ли поле "ОСУ" для указанного вида продукции
//
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.КлючиВидовПродукцииИС,
//                               СправочникСсылка.ВидыПродукцииИС,
//                               Массив из СправочникСсылка.ВидыПродукцииИС - Виды продукции,
//                               СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа
//
// Возвращаемое значение:
//  Булево - Истина, если поле ОСУ доступно
Функция ДоступноПолеОСУ(ВидПродукцииТоварнаяГруппа) Экспорт
	
	#Если Сервер Или ВнешнееСоединение Или МобильноеПриложениеСервер Или МобильныйАвтономныйСервер Тогда
		Дата = ТекущаяДатаСеанса();
	#Иначе
		Дата = ОбщегоНазначенияКлиент.ДатаСеанса();
	#КонецЕсли
	
	ДоступноПолеОСУ = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеОСУ"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
	ДатаНачалаОформленияОСУ = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаОформленияУПДОСУ(ВидПродукцииТоварнаяГруппа);
	Если ДатаНачалаОформленияОСУ = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ДоступноПолеОСУ И ДатаНачалаОформленияОСУ <= Дата;
	
КонецФункции

// Проверяет, доступно ли уведомление об отгрузке на экспорт для указанного вида продукции и причины
//
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.КлючиВидовПродукцииИС,
//                               СправочникСсылка.ВидыПродукцииИС,
//                               Массив из СправочникСсылка.ВидыПродукцииИС - Виды продукции,
//                               СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа
//  Причина - ПеречислениеСсылка - причина вывода из оборота
//
// Возвращаемое значение:
//  Булево - Истина, если уведомление доступно
Функция ДоступноУведомлениеОбОтгрузкеНаЭкспорт(ВидПродукцииТоварнаяГруппа, Причина) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.УведомлениеОбОтгрузкеНаЭкспорт"),
		ВидПродукцииТоварнаяГруппа,
		Причина);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ЭлементыКонструктораВидовПродукции

Функция ДоступныеПричиныВыводаИзОборота(ЭтоОбъемноСортовойУчет, ВидыПродукцииПоТоварнойГруппе) Экспорт
	
	Если ЭтоОбъемноСортовойУчет Тогда
		ЭлементКонструктора = ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПричиныВыводаИзОборотаОСУ");
	Иначе
		ЭлементКонструктора = ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПричиныВыводаИзОборотаПоштучно");
	КонецЕсли;
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ЭлементКонструктора,
		ВидыПродукцииПоТоварнойГруппе);
	
КонецФункции

// Доступные виды продукции трансграничная продажа в страны ЕАЭС.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ВидыПродукцииИС - Доступные виды продукции для причины вывода 'Трансграничная продажа в страны ЕАЭС'
Функция ДоступныеВидыПродукцииТрансграничнаяПродажаВСтраныЕАЭС() Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПричинаВыводаИзОборотаТрансграничнаяПродажаВСтраныЕАЭС"));
	
КонецФункции

Функция ДоступноПолеИдентификатораГосударственногоКонтракта(ВидПродукцииТоварнаяГруппа, Причина) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеИдентификаторГосударственногоКонтракта"),
		ВидПродукцииТоварнаяГруппа,
		Причина);
	
КонецФункции

Функция ДоступноПолеОписаниеПричины(ВидПродукцииТоварнаяГруппа, Причина) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеОписаниеПричины"),
		ВидПродукцииТоварнаяГруппа,
		Причина);
	
КонецФункции

Функция ДоступноПолеВидПервичногоДокумента(ВидПродукцииТоварнаяГруппа, Причина = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеВидПервичногоДокумента"),
		ВидПродукцииТоварнаяГруппа,
		Причина);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляВидПервичногоДокумента(ВидПродукцииТоварнаяГруппа, Причина) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляВидПервичногоДокумента"),
		ВидПродукцииТоварнаяГруппа,
		Причина);
	
КонецФункции

Функция ДоступноПолеСтранаНазначения(ВидПродукцииТоварнаяГруппа, Причина) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСтранаНазначения"),
		ВидПродукцииТоварнаяГруппа,
		Причина);
	
КонецФункции

Функция ДоступноПолеЦена(ВидПродукцииТоварнаяГруппа, Причина) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеЦена"),
		ВидПродукцииТоварнаяГруппа,
		Причина);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляЦена(ВидПродукцииТоварнаяГруппа, Причина) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляЦена"),
		ВидПродукцииТоварнаяГруппа,
		Причина);
	
КонецФункции

Функция ПричиныВыводаИзОборотаСПроверкойЗаполненияПоляЦена(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляЦена"),
		ВидПродукцииТоварнаяГруппа);
	
КонецФункции

Функция ДоступноПолеАдрес(ВидПродукцииТоварнаяГруппа, Причина) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеАдрес"), ВидПродукцииТоварнаяГруппа, Причина);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляАдрес(ВидПродукцииТоварнаяГруппа, Причина) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляАдрес"),
		ВидПродукцииТоварнаяГруппа,
		Причина);
	
КонецФункции

Функция ДоступноПолеКПП(ВидПродукцииТоварнаяГруппа, Причина) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеКПП"),
		ВидПродукцииТоварнаяГруппа,
		Причина);
	
КонецФункции

Функция ДоступнаРегистрацияМОДВГИСМТ(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ДоступнаРегистрацияМОДВГИСМТ"),
		ВидПродукцииТоварнаяГруппа);
	
КонецФункции

#КонецОбласти

Функция ПараметрыУказанияМОД(Организация, ВидПродукцииТоварнаяГруппа, Причина) Экспорт
	
	ПараметрыМОД = Новый Структура;
	ПараметрыМОД.Вставить("ВозможноУказаниеМОД",        Ложь);
	ПараметрыМОД.Вставить("ОбязательноУказаниеМОД",     Ложь);
	ПараметрыМОД.Вставить("ПодконтрольныеОбъектыВетИС", Ложь);
	
	ПараметрыМОД.ВозможноУказаниеМОД = ДоступноПолеАдрес(ВидПродукцииТоварнаяГруппа, Причина);
		
	Если ИмеютсяПодконтрольныеОбъектыВетИС(Организация) Тогда
		ПараметрыМОД.ОбязательноУказаниеМОД     = Истина;
		ПараметрыМОД.ПодконтрольныеОбъектыВетИС = Истина;
	Иначе
		ПараметрыМОД.ОбязательноУказаниеМОД = ПроверятьЗаполнениеПоляАдрес(ВидПродукцииТоварнаяГруппа, Причина);
	КонецЕсли;
		
	Возврат ПараметрыМОД;
	
КонецФункции

Функция ИмеютсяПодконтрольныеОбъектыВетИС(Организация) Экспорт
	Возврат ОбщегоНазначенияИСКлиентСерверПовтИсп.ОрганизацияИмеетПодконтрольныеОбъектыВЕТИС(Организация);	
КонецФункции

#КонецОбласти