#Область ПрограммныйИнтерфейс

// Получение инвертированного значения константы РазрешитьОбособлениеТоваровСверхПотребности
// Возвращаемое значение:
//  Булево - инвертированное значение константы РазрешитьОбособлениеТоваровСверхПотребности.
Функция КонтролироватьПревышениеОбособленногоОбеспечения() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Не Константы.РазрешитьОбособлениеТоваровСверхПотребности.Получить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает таблицу зависимостей типов обеспечения от функциональных опций и вводимых документов.
//
// Возвращаемое значение:
//   ТаблицаЗначений - Описание зависимостей:
//     * ТипОбеспечения - ПеречислениеСсылка.ТипыОбеспечения - тип обеспечения (Покупка, Перемещение и т.д.).
//     * ФункциональнаяОпция - ОбъектМетаданныхФункциональнаяОпция - имя функциональной опции, управляющей доступностью типа обеспечения.
//     * ОбъектДоступа - ОбъектМетаданныхДокумент - Документ, управляемый функциональной опцией.
//     * КлючНазначенияИспользования - Строка - ключ для назначения использования обработки обеспечения потребностей.
Функция ОписаниеДоступностиТиповОбеспечения() Экспорт 
	
	ОписаниеТипаСтрока150 = ОбщегоНазначения.ОписаниеТипаСтрока(150);
	ОписаниеТипаОбъектМетаданных = Новый ОписаниеТипов("ОбъектМетаданных");
	
	ВозвращаемоеЗначение = Новый ТаблицаЗначений;
	ВозвращаемоеЗначение.Колонки.Добавить("ТипОбеспечения", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыОбеспечения"));
	ВозвращаемоеЗначение.Колонки.Добавить("ФункциональнаяОпция", ОписаниеТипаОбъектМетаданных);
	ВозвращаемоеЗначение.Колонки.Добавить("ОбъектДоступа", ОписаниеТипаОбъектМетаданных);
	ВозвращаемоеЗначение.Колонки.Добавить("КлючНазначенияИспользования", ОписаниеТипаСтрока150);
	
	КлючЗаказов = ОбеспечениеКлиентСервер.КлючНазначенияИспользованияФормированияЗаказовПоПотребностям();
	КлючЗаявок = ОбеспечениеКлиентСервер.КлючНазначенияИспользованияФормированияЗаявокПоПотребностям();
	
	НовоеОписаниеТипаОбеспечения(
		ВозвращаемоеЗначение,
		Перечисления.ТипыОбеспечения.Покупка,
		Метаданные.ФункциональныеОпции.ИспользоватьЗаявкиНаЗакупку,
		Метаданные.Документы.ЗаявкаНаЗакупку,
		КлючЗаявок);
	
	НовоеОписаниеТипаОбеспечения(
		ВозвращаемоеЗначение,
		Перечисления.ТипыОбеспечения.Покупка,
		Метаданные.ФункциональныеОпции.ИспользоватьЗаказыПоставщикам,
		Метаданные.Документы.ЗаказПоставщику,
		КлючЗаказов);
	
	НовоеОписаниеТипаОбеспечения(
		ВозвращаемоеЗначение,
		Перечисления.ТипыОбеспечения.Перемещение,
		Метаданные.ФункциональныеОпции.ИспользоватьЗаказыНаПеремещение,
		Метаданные.Документы.ЗаказНаПеремещение,
		КлючЗаказов);
	
	
	НовоеОписаниеТипаОбеспечения(
		ВозвращаемоеЗначение,
		Перечисления.ТипыОбеспечения.СборкаРазборка,
		Метаданные.ФункциональныеОпции.ИспользоватьЗаказыНаСборку,
		Метаданные.Документы.ЗаказНаСборку,
		КлючЗаказов);
	
	
	
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция НовоеОписаниеТипаОбеспечения(ОписаниеТипов, Тип, ФункциональнаяОпция, ОбъектДоступа, КлючНазначенияИспользования)

	СтрокаОписания = ОписаниеТипов.Добавить();
	СтрокаОписания.ТипОбеспечения = Тип;
	СтрокаОписания.ФункциональнаяОпция = ФункциональнаяОпция;
	СтрокаОписания.ОбъектДоступа = ОбъектДоступа;
	СтрокаОписания.КлючНазначенияИспользования = КлючНазначенияИспользования;
	
	Возврат СтрокаОписания;

КонецФункции

#КонецОбласти