
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// +++ КонтурЛогистика_НастройкиКонвертацииСправочников
	
	КонтурЛогистика_КонвертацияСервер.НастройкиКонвертацииСправочников_ПриСозданииНаСервере(
		ЭтаФорма, "КонтурЛогистика_ТранспортныеСредства", ЭтаФорма, Элементы.Группа10);
		
	// --- КонтурЛогистика_НастройкиКонвертацииСправочников
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		Элементы.ТипТС.КнопкаСпискаВыбора = Истина;
	КонецЕсли;
	
	ИспользуетсяПутевойЛист_5_02 = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист_5_02");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ГруппаАрендодательЛизингодатель.Видимость = Истина;
	
	Элементы.ПрицепПоУмолчанию.Видимость = Не Объект.ЭтоПрицеп;
	Элементы.ПрицепПоУмолчанию2.Видимость = Не Объект.ЭтоПрицеп;
	
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = (Объект.СвязанныеОбъекты.Количество() = 1);

	Элементы.ИнойТипТС.Видимость = Объект.ТипТСПоКлассификатору = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыТранспортныхСредств.Иной");
	Элементы.ИнойТипТС.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.ИнойТипТС) И Элементы.ИнойТипТС.Видимость;
	
	Элементы.ГруппаТипТСПоКлассификатору.Видимость = ИспользуетсяПутевойЛист_5_02;
		
КонецПроцедуры

&НаКлиенте
Процедура ВидВладенияПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПрицепПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("КонтурЛогистика_ОбновитьТипВладения");
	Оповестить("КонтурЛогистика_ПерепроверитьДокумент");
	
КонецПроцедуры

// +++ КонтурЛогистика_НастройкиКонвертацииСправочников

&НаКлиенте
Процедура СоздатьНастройкуКонвертации(Элемент) Экспорт
	
	КонтурЛогистика_КонвертацияКлиент.СоздатьНастройкуКонвертации(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкеКонвертацииСправочника(Элемент) Экспорт 
	
	КонтурЛогистика_КонвертацияКлиент.ПерейтиКНастройкеКонвертацииСправочника(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
  КонтурЛогистика_КонвертацияКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

// --- КонтурЛогистика_НастройкиКонвертацииСправочников

&НаКлиенте
Процедура СвязанныеОбъектыПослеУдаления(Элемент)
	
	УстановитьВидимостьЭлементов();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьВидимостьЭлементов();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлементУчетнойСистемы(Команда)
	
	Если ЭтаФорма.СписокНастроекКонвертации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ВыборЭлементаУчетнойСистемыДляЗаполнения(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения");
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ВыбратьЭлементУчетнойСистемыЗавершение(ВыбранноеЗначение, ДополнительныеПараметры);
	
	УправлениеВидимостьюЭлементовФормыПослеКонвертации();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюЭлементовФормыПослеКонвертации()
	
	УстановитьВидимостьЭлементов();
	
	УправлениеВидимостьюЭлементовФормыСервер();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюЭлементовФормыСервер()
	
	КонтурЛогистика_КонвертацияСервер.УправлениеВидимостьюЭлементовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектОткрытие(Элемент, СтандартнаяОбработка)
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьСвязанныйОбъект(ЭтаФорма, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПоказатьСписокТиповДляСвязанногоОбъекта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработкаВыбораСвязанногоОбъекта(ЭтаФорма, ВыбранноеЗначение);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед добавлением необходимо сохранить");
		Возврат;
	КонецЕсли;
			
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаВыбора";
	НаправлениеКонвертации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НаправлениеКонвертации.Входящее");
	ИмяТипаСправочника = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоСсылкеНаДокумент(Объект.Ссылка);
	
	ЗначениеОтбора = Новый Структура("НаправлениеКонвертации, ТипСправочникаЛогистика", НаправлениеКонвертации, ИмяТипаСправочника); 
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыФормы, ЭтаФорма, ЭтаФорма,
		"СоздатьНаОснованииНачалоВыбораЗавершение", Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
&НаКлиенте
Процедура СоздатьНаОснованииНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Сообщить("Не выбрана настройка конвертации справочника");
		Возврат;
	КонецЕсли;
	
	НастройкаКонвертацииСправочника = Результат;
	КонтурЛогистика_КонвертацияКлиент.КонвертироватьОбъектСправочникаЛогистикиВОбъектУС(ЭтаФорма, НастройкаКонвертацииСправочника);
	
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТСПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ТипПечатнойФормыПутыхЛистов) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТипПечатнойФормыПутыхЛистов = ТипПечатнойФормыПоТипуТранспортногоСредства(Объект.ТипТС);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипПечатнойФормыПоТипуТранспортногоСредства(ТипТранспортногоСредства)
	
	Возврат Справочники.КонтурЛогистика_ТранспортныеСредства.ТипПечатнойФормыПоТипуТранспортногоСредства(ТипТранспортногоСредства);
	
КонецФункции

&НаКлиенте
Процедура ТипТСПоКлассификаторуПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
	Если ЗначениеЗаполнено(Объект.ТипПечатнойФормыПутыхЛистов) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТипПечатнойФормыПутыхЛистов = ТипПечатнойФормыПоТипуТранспортногоСредства(Строка(Объект.ТипТСПоКлассификатору));
	
КонецПроцедуры
