#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Сотрудник", ОтборСотрудник);
	Параметры.Свойство("Организация", ОтборОрганизация);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтборы();
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтборСотрудникПриИзменении(Элемент)
	ОбновитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбновитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТелефонПриИзменении(Элемент)
	ОбновитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСотрудникОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТелефонОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьОтборы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		
		Если ВладелецФормы.ИмяФормы = "Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаЭлемента" Тогда
			Элементы.ОтборСотрудник.ТолькоПросмотр = ЗначениеЗаполнено(ОтборСотрудник);
		КонецЕсли;
		
		Если ВладелецФормы.ИмяФормы = "Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаЭлемента" Тогда
			Элементы.ОтборОрганизация.ТолькоПросмотр = ЗначениеЗаполнено(ОтборОрганизация);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборы()
	
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Сотрудник", ОтборСотрудник,
		ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборСотрудник));
		
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Организация", ОтборОрганизация,
		ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборОрганизация));
		
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Телефон", ОтборТелефон,
		ВидСравненияКомпоновкиДанных.Содержит,, ЗначениеЗаполнено(ОтборТелефон));
	
КонецПроцедуры

#КонецОбласти
