#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДанныеФормы();
	
	НастройкаКонвертации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьНастройкуКонвертации(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02);
	
	Если НастройкаКонвертации <> Неопределено Тогда
		Элементы.ГруппаДокументОснование.Видимость = ЗначениеЗаполнено(НастройкаКонвертации.ТипДокумента1С);
	КонецЕсли;
	
	ЭлементыДляРазрешенияРедактирования = Новый Массив;
	ЭлементыДляРазрешенияРедактирования.Добавить("ГруппаЭП");
	ЭлементыДляРазрешенияРедактирования.Добавить("ГруппаДанныеФайлаТитула1");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ЭлементыДляРазрешенияРедактирования);
	Титул1Прицеп = Объект.Титул1.Прицеп;
	Титул1Прицеп2 = Объект.Титул1.Прицеп2;
	Титул1ТипТС   = Объект.Титул1.ТранспортноеСредство.ТипТСПоКлассификатору;
	
	Если ЗначениеЗаполнено(Объект.Титул1.ТранспортноеСредство) Тогда
		ТопливоПоУмолчанию = Объект.Титул1.ТранспортноеСредство.ТопливоПоУмолчанию;
	КонецЕсли;
		
	ЗаполнитьПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюИДоступностью();
	ПроверитьДокумент();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
	УстановитьЗаголовкиГруппамДопПолей();
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоИнтерфейс82() Тогда
		Элементы.ОстаткиТоплива.РастягиватьПоВертикали = Ложь;
		Элементы.ИнфПолОстаткиТоплива.РастягиватьПоВертикали = Ложь;
		Элементы.ИнфПол.РастягиватьПоВертикали = Ложь;
		Элементы.ДополнительныеПолучателиФайла.РастягиватьПоВертикали = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
				
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПерепроверитьДокумент" Тогда
		
		ПроверитьДокумент();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	ИначеЕсли ИмяСобытия = "ПерезаполнитьТитул"
		И Параметр <> Неопределено
		И Параметр = Объект.Ссылка Тогда
		
		ПерезаполнитьПоДокОснованиюСервер();
		ОбновитьДанныеФормы();
		ОбновитьОтображениеДанных();
		ПроверитьДокумент();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);

КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)
	
	ОбработчикПеречитатьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОснование(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаДокументОснование(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуКонвертации(Команда)

	КонтурЛогистика_ОбработкаДокументовКлиент.ОткрытьНастройкуКонвертации(
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02"), Объект.ДокументОснование);

КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитов(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.РазрешитьРедактированиеРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуВремяТекущим(Команда)
	
	Если ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТекущегоЭлемента = ТекущийЭлемент.Имя;
	
	Если ИмяТекущегоЭлемента = "ВремяКонтроляСейчас" Тогда
		Объект.ДатВрКонтТехСост = ТекущаяДатаСервера();
	ИначеЕсли ИмяТекущегоЭлемента = "ВремяВыпускаСейчас" Тогда
		Объект.ДатВрВыпНаЛин = ТекущаяДатаСервера();
	ИначеЕсли ИмяТекущегоЭлемента = "НачРаботыГрфСейчас" Тогда
		Объект.ДтВрНачРабГрф = ТекущаяДатаСервера();
		УстановитьЗаголовкиГруппамДопПолей();
	ИначеЕсли ИмяТекущегоЭлемента = "КонРабГрфСейчас" Тогда
		Объект.ДтВрКонРабГрф = ТекущаяДатаСервера();
		УстановитьЗаголовкиГруппамДопПолей();
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательПодписантПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура МедРаботникПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура МедЛицензияПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатВрПрМОПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктКолбасыНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоКолбасеКТитулу(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПриОчисткеДокументаОснование(ЭтаФорма, Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокУчСист_Реквизит_СопоставитьНажатие(Элемент)

	ИмяЭлемента = Элемент.Имя;
	ОбъектДокУчСистПуть = "ЭтаФорма." + СтрЗаменить(ИмяЭлемента, "_Сопоставить", "");
	ЗначениеОбъектДокУчСист = Вычислить(ОбъектДокУчСистПуть);

	Если ЗначениеЗаполнено(ЗначениеОбъектДокУчСист) Тогда

		ОткрытьФормуПодбораСущностиЛогистика(ЗначениеОбъектДокУчСист, Элемент);

	Иначе
		
		// открыть документ
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Объект.ДокументОснование);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказанияОдометраПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатВрВыпНаЛинПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДтВрНачРабГрфПриИзменении(Элемент)
	
	УстановитьЗаголовкиГруппамДопПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ДтВрКонРабГрфПриИзменении(Элемент)
	
	УстановитьЗаголовкиГруппамДопПолей();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличныхЧастей

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТопливаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТопливаПослеУдаления(Элемент)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();

КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТопливаПриАктивизацииСтроки(Элемент)
	
	ОтборСтрок = Неопределено;

	Если Не Элемент.ТекущиеДанные = Неопределено Тогда

		ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОстатковТоплива", Элемент.ТекущиеДанные.ИдентификаторСтроки);

	КонецЕсли;

	Элементы.ИнфПолОстаткиТоплива.ОтборСтрок = ОтборСтрок;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолОстаткиТопливаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда

		ТекСтрокаОстатковГСМ = Элементы.ОстаткиТоплива.ТекущиеДанные;

		Элемент.ТекущиеДанные.ИдентификаторСтрокиОстатковТоплива = ТекСтрокаОстатковГСМ.ИдентификаторСтроки;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТопливаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда

		Элемент.ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолОстаткиТопливаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолОстаткиТопливаПослеУдаления(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолПослеУдаления(Элемент)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПослеУдаления(Элемент)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТопливаТопливоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.ОстаткиТоплива.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьДубли = Ложь;
		
	Для Каждого ТекущийОстаток Из Объект.ОстаткиТоплива Цикл
		Если ТекущийОстаток.Топливо = ВыбранноеЗначение Тогда
			ЕстьДубли = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьДубли Тогда
		Сообщить("В таблице уже есть " + Строка(ВыбранноеЗначение));
		Возврат;
	КонецЕсли;
	
	Элементы.ОстаткиТоплива.ТекущиеДанные.Топливо = ВыбранноеЗначение;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиТопливаКоличествоТопливаПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеФормы

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьДанныеФормы();
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(ЭтаФорма, Объект.ДокументОснование);
	УправлениеКолбасойТитуловВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Повторно подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Переотправить неподписанный (черновик)";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Отправить неподписанный (черновик)";
	КонецЕсли;

	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, Объект.ДокументОснование, 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус, ТребуемоеДействие);
	
	КонтурЛогистика_ОбработкаДокументовСервер.ПЛ_ФормаДокумента_УстановитьВидимостьВЗависимостиОтСтатуса(ЭтаФорма);
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	 		
	СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");
	Если Элементы.Найти("ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы.Видимость = СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ЭтоВходящий = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен");
	ЭтоЧерновик = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
	ЭтоИсправлениеОшибки = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка");
	
	Элементы.ГруппаПодписантРеквизиты.Видимость = ЗначениеЗаполнено(Объект.Фамилия);
	
	// причина отказа в подписи 
	Элементы.ГруппаПричинаОтказаВПодписи.Видимость = (ЭтоВходящий Или Не ЭтоЧерновик) И Объект.ЕстьОтказВПодписи;
	
	Элементы.ГруппаДатВрВыпНаЛин.Видимость 		= Не Объект.ЕстьОтказВПодписи;
	Элементы.ВремяВыпускаСейчас.Видимость 		= Не Объект.ЕстьОтказВПодписи;
	
	Если Объект.ЕстьОтказВПодписи Тогда 
		Элементы.ЕстьОтказВПодписи.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
	Если Элементы.Найти("ФормаОбщаяКомандаКонтурЛогистика_ОтказатьсяВПодписи") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтказатьсяВПодписи.Видимость = Не ТолькоПросмотр;
	КонецЕсли;
	
	Элементы.Титул1Прицеп.Видимость = ЗначениеЗаполнено(Титул1Прицеп);
	Элементы.Титул1Прицеп2.Видимость = ЗначениеЗаполнено(Титул1Прицеп2);
	
	Элементы.ПоказанияОдометра.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.ПоказанияОдометра) И
		(Титул1ТипТС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыТранспортныхСредств.Легковой")
		Или Титул1ТипТС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыТранспортныхСредств.Автобус")
		Или Титул1ТипТС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыТранспортныхСредств.Грузовой"));
		
	Элементы.ЕстьОтказВПодписи.Видимость = ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик")
		И ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке")
		И ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена")
		И ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Пропущен")
		И ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПустаяСсылка");
		
	Элементы.ГруппаДатаФормированияФайла.Видимость = ЗначениеЗаполнено(Объект.ДатИнфВыпуск);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовкиГруппамДопПолей()
	
	// ГруппаИнфПоля
	Элементы.ГруппаИнфПоля.Заголовок = "Информационные поля (" + Объект.ИнфПол.Количество() +")";
	
	// ГруппаДопПолучатели
	Элементы.ГруппаДопПолучатели.Заголовок = "Доп. получатели файла (" + Объект.ДополнительныеПолучателиФайла.Количество() +")";
	
	// Остатки топлива
	Элементы.СтраницаОстаткиТоплива.Заголовок = "Остатки топлива (" + Объект.ОстаткиТоплива.Количество() +")";
	
	// ГруппаГрафикРаботыТС
	Если ЗначениеЗаполнено(Объект.ДтВрНачРабГрф) Или ЗначениеЗаполнено(Объект.ДтВрКонРабГрф) Тогда 
		Элементы.ГруппаГрафикРаботыТС.Заголовок = "График работы ТС (указано)";
	Иначе
		Элементы.ГруппаГрафикРаботыТС.Заголовок = "График работы ТС (не указано)";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеКолбасойТитуловВызовСервера()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УправлениеСтатусомПодписиИКолбасойТитулов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	ВсегдаВыводитьРезультатВалидации = ВсегдаВыводитьРезультатВалидации();
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки, ВсегдаВыводитьРезультатВалидации);
	
	УправлениеВидимостьюИДоступностью();
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	Титул1ТипТС = Объект.Титул1.ТранспортноеСредство.ТипТСПоКлассификатору;
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ПЛ_Титул3_5_02.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)

	ПараметрыФормыПоиска = Новый Структура();
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);

	ПараметрыОбработчика = Новый Структура();
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);

	Если Элемент.Имя = "ДокУчСист_ТехРаботник_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_Сотрудники";

	Иначе

		ВызватьИсключение "не реализовано";

	КонецЕсли;

	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник." + ИмяСущности + ".ФормаВыбора",
																   ПараметрыФормыПоиска,
																   ЭтаФорма,
																   ЭтаФорма,
																   "ОбработчикВыбораСопоставленияРеквизитаДокумента",
																   ПараметрыОбработчика);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСопоставленияРеквизитаДокумента(ВыбранноеЗначение, ДопПараметры) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда 
		
		// Выполнить переконвертацию или присваивание
		ПовторноСконвертироватьРеквизит(ДопПараметры.ИмяЭлементаФормы);
		ОбработчикПеречитатьОбъект();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПовторноСконвертироватьРеквизит(ИмяЭлементаФормы)

	ДокОбъект = РеквизитФормыВЗначение("Объект");


	ИмяРеквизита = СтрЗаменить(ИмяЭлементаФормы, "ДокУчСист_", "");
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "_Сопоставить", "");
	
	ДанныеЗаполнения = Новый Структура("ПредыдущийТитул, ТипЛогистика",
									   Объект.Титул1,
									   Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02);
	ДокОбъект.Заполнить(ДанныеЗаполнения);

	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()
	
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьПредставлениеРеквизитовДокументаОснования(
													Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02,
													МассивКонвертируемыхРеквизитов,
													ЭтаФорма);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()

	Перем МассивКонвертируемыхРеквизитов;

	МассивКонвертируемыхРеквизитов = Новый Соответствие();
	МассивКонвертируемыхРеквизитов.Вставить("ТехРаботник", "ТехРаботник");
	
	Возврат МассивКонвертируемыхРеквизитов;

КонецФункции

&НаКлиенте
Процедура ОбработчикРазрешенияПолномочий(Параметр1, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработчикРазрешенияПолномочий(ЭтаФорма, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()
	
	Объект.ОстаткиТоплива.Очистить();
	Объект.ИнфПолОстаткиТоплива.Очистить();
	Объект.ИнфПол.Очистить();
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02, Объект.ДокументОснование);
	
	ДокОбъект.ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации);
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущаяДатаСервера()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоУмолчанию()
	
	Если ЗначениеЗаполнено(ТопливоПоУмолчанию) И Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		НоваяСтрока = Объект.ОстаткиТоплива.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	    НоваяСтрока.Топливо = ТопливоПоУмолчанию;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВсегдаВыводитьРезультатВалидации()
	
	Возврат ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПустаяСсылка")
		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
	
КонецФункции

#КонецОбласти
