
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВводДанных.Область(1,1,1,1).Текст="Артикул";
	ВводДанных.Область(1,2,1,2).Текст="Номенклатура";
	ВводДанных.Область(1,3,1,3).Текст="Единица измерения";
	ВводДанных.Область(1,4,1,4).Текст="Количество";
	ВводДанных.Область(1,5,1,5).Текст="Поставщик";
	
	НеИскатьАрхивные = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Закрыть(ПодготовитьДанныеДляЗагрузки());
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеДляЗагрузки()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Артикул");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Единица");
	Результат.Колонки.Добавить("Количество");
	Результат.Колонки.Добавить("Поставщик");
	
	Для н = 2 По ВводДанных.ВысотаТаблицы Цикл
		
		Артикул = СокрЛП(ВводДанных.Область(н, 1, н, 1).Текст);
		Номенклатура = СокрЛП(ВводДанных.Область(н, 2, н, 2).Текст);
		Единица = СокрЛП(ВводДанных.Область(н, 3, н, 3).Текст);
		Количество = ВводДанных.Область(н, 4, н, 4).Текст;
		Поставщик = ВводДанных.Область(н, 5, н, 5).Текст;
		
		Номенклатура = Обработки.АУ_ЗагрузкаДанныхВДокументы.ПолучитьНоменклатуру(Артикул, Номенклатура, НеИскатьПоАртикулу, НеИскатьПоНаименованию, НеИскатьАрхивные);
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Артикул = Артикул;
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.Количество = Количество;
		НоваяСтрока.Поставщик = Обработки.АУ_ЗагрузкаДанныхВДокументы.ПолучитьПартнера(Поставщик);
		
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(Результат);
	
КонецФункции

