 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Параметры = ПараметрыССервера(ПараметрКоманды); 
	
	ТекущийСтатус 	= Параметры.ТекущийСтатус;
	УИДМинтранса 	= Параметры.УИДМинтранса;
	
	Если Не ЗначениеЗаполнено(УИДМинтранса) Тогда 
		
		ВызватьИсключение "Нельзя вносить исправления. Не получен УИД Минтранса.";
		
	КонецЕсли;	
	
	Если (ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка") И ЗначениеЗаполнено(УИДМинтранса)) 
		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик")
		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке")
		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена") Тогда 	
	
		ВызватьИсключение "Нельзя вносить исправления в Титул в статусе: " + ТекущийСтатус;
		
	Иначе
		
		КонтурЛогистика_ОбработкаДокументовКлиент.ИсправитьТитул(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыССервера(ДокументТитул)
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("ТекущийСтатус", ПолучитьСтатус(ДокументТитул));
	Параметры.Вставить("УИДМинтранса", 	ДокументТитул.ДокументЭТРН.УИД);
	
	Возврат Параметры;
			
КонецФункции

&НаСервере
Функция ПолучитьСтатус(ДокументТитул)
	
	Возврат РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументТитул, Истина);
		
КонецФункции	
	
	