#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получение информации о лимитах
// 
// Параметры:
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Получить информацию о лимитах
Функция ПолучитьИнформациюОЛимитах(ОписаниеРезультата = "") Экспорт
	Результат = Истина;

	РезультатHTTPЗапроса = КонтурЗакупки_httpЗапросыКлиентСервер.http_ПолучитьИнформациюОЛимитах();
	Если РезультатHTTPЗапроса <> Неопределено Тогда
		Если Не РезультатHTTPЗапроса["data"] = Неопределено Тогда
			ДанныеСоответствие = РезультатHTTPЗапроса["data"];
			Если ТипЗнч(ДанныеСоответствие) = Тип("Массив") Тогда
				ЗаполнитьТабличнуюЧастьРезультата(ДанныеСоответствие);
			КонецЕсли;
		ИначеЕсли Не РезультатHTTPЗапроса["error"] = Неопределено И РезультатHTTPЗапроса["error"] = Истина Тогда
			Результат = Ложь;
			ОписаниеРезультата = ОписаниеРезультата + СтрШаблон(
			НСтр("ru = 'Ошибка: %1'"), РезультатHTTPЗапроса["message"]) + Символы.ПС;
		КонецЕсли;
	Иначе
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Ошибка'") + Символы.ПС;
	КонецЕсли;

	Возврат Результат;
КонецФункции
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТабличнуюЧастьРезультата(ДанныеСоответствие) Экспорт
	ИнформацияОЛимитах.Очистить();
	Для Каждого ЗаписьОЛимитах Из ДанныеСоответствие Цикл
		НовСтрока = ИнформацияОЛимитах.Добавить();
		НовСтрока.ГруппаЛимитов = ЗаписьОЛимитах["LimitGroup"];
		НовСтрока.ДоступноЗапросов = ЗаписьОЛимитах["AvailableRequests"];
		НовСтрока.ОбщийЛимит = ЗаписьОЛимитах["TotalLimit"];
		НовСтрока.ЭтоПериодический = ЗаписьОЛимитах["IsPeriodic"];
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#КонецЕсли