#Область ПрограммныйИнтерфейс

&ИзменениеИКонтроль("ЗаполнитьСведенияОМаркировке_5_02")
Процедура АУ_ЗаполнитьСведенияОМаркировке_5_02(Приемник, Источник, ДанныеШтрихкодовУпаковок)

	СтандартнаяОбработка = Истина;
	ЭлектронноеВзаимодействиеИСМППереопределяемый.ЗаполнитьСведенияОМаркировке_5_02(
		Приемник,
		Источник,
		ДанныеШтрихкодовУпаковок,
		СтандартнаяОбработка);
	
	Если СтандартнаяОбработка = Ложь Тогда
		Возврат;
	ИначеЕсли ДанныеШтрихкодовУпаковок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КодыОСУРаспределены  = ДанныеШтрихкодовУпаковок.Колонки.Найти("КоличестваПоСтрокеОбъемноСортовогоУчета")<>Неопределено;
	ЕстьСерии = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "Серия");
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипЧисло  = Новый ОписаниеТипов("Число");
	
	СведенияОМаркировке = Новый ТаблицаЗначений;
	СведенияОМаркировке.Колонки.Добавить("ИдентификаторУпаковки",  ТипСтрока);
	СведенияОМаркировке.Колонки.Добавить("Количество",             ТипЧисло);
	СведенияОМаркировке.Колонки.Добавить("Партия",                 ТипСтрока);
	СведенияОМаркировке.Колонки.Добавить("Идентификатор",          Неопределено);
	
	ПараметрыПоиска = Новый Структура;
	СтрокиУпаковок = НайтиСтрокиУпаковок(Источник, ДанныеШтрихкодовУпаковок, ПараметрыПоиска, КодыОСУРаспределены, ЕстьСерии);
	
	КонтрольныеИдентификационныеЗнаки = Новый ТаблицаЗначений;
	КонтрольныеИдентификационныеЗнаки.Колонки.Добавить("КонтрольныйЗнак", ТипСтрока);
	
	ИндивидуальныеУпаковки = Новый ТаблицаЗначений;
	ИндивидуальныеУпаковки.Колонки.Добавить("ИдентификаторУпаковки", ТипСтрока);
	
	#Вставка
	КоличествоОстаток = Приемник.Количество;
	#КонецВставки
	Для Каждого СтрокаУпаковки Из СтрокиУпаковок Цикл
		
		Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияМЕХ(СтрокаУпаковки.ВидПродукции)
			Или КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоМаркируемаяПродукцияЕГАИС(СтрокаУпаковки.ВидПродукции) Тогда
			Прервать;
		КонецЕсли;
		
		#Вставка
		Если КоличествоОстаток = 0 Тогда
			Прервать;
		КонецЕсли;
		#КонецВставки
		
		Если СтрокаУпаковки.Обработан Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаУпаковки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
			
			НоваяСтрока = СведенияОМаркировке.Добавить();
			
			НоваяСтрока.ИдентификаторУпаковки = СтрокаУпаковки.ЗначениеШтрихкода;
			СтрокаУпаковки.Обработан = Истина;
			
		ИначеЕсли СтрокаУпаковки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
			
			НоваяСтрокаИндивидуальныхУпаковок = ИндивидуальныеУпаковки.Добавить();
			НоваяСтрокаИндивидуальныхУпаковок.ИдентификаторУпаковки = СтрокаУпаковки.ЗначениеШтрихкода;
			
			СтрокаУпаковки.Обработан = Истина;
		
		ИначеЕсли КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(СтрокаУпаковки.ВидПродукции) Тогда
			
			Если КодыОСУРаспределены Тогда
				ЭлементКоличества = НайтиНазначениеКодаОСУ(СтрокаУпаковки, Источник, ЕстьСерии);
				Если ЭлементКоличества = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				СтрокаУпаковки.КоличестваПоСтрокеОбъемноСортовогоУчета.Удалить(ЭлементКоличества);
			КонецЕсли;
			
			НоваяСтрокаИндивидуальныхУпаковок = ИндивидуальныеУпаковки.Добавить();
			НоваяСтрокаИндивидуальныхУпаковок.ИдентификаторУпаковки = СтрокаУпаковки.ЗначениеШтрихкода;
			
		ИначеЕсли СтрокаУпаковки.ВидУпаковки = Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет Тогда
			
			Если КодыОСУРаспределены Тогда
				ЭлементКоличества = НайтиНазначениеКодаОСУ(СтрокаУпаковки, Источник, ЕстьСерии);
				Если ЭлементКоличества = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				СтрокаУпаковки.КоличестваПоСтрокеОбъемноСортовогоУчета.Удалить(ЭлементКоличества);
			КонецЕсли;
			
			НоваяСтрока = СведенияОМаркировке.Добавить();
			
			НоваяСтрока.Количество = СформироватьКоличествоПоОСУ(Источник, СтрокаУпаковки);
			Приемник.ГТИН = СтрокаУпаковки.ЗначениеШтрихкода;
			
			НоваяСтрока.Идентификатор = Новый Структура("ИдентификаторыУпаковок", ИндивидуальныеУпаковки);
			Прервать;
			
		Иначе
			
			НоваяСтрокаКИЗ = КонтрольныеИдентификационныеЗнаки.Добавить();
			НоваяСтрокаКИЗ.КонтрольныйЗнак = СтрокаУпаковки.ЗначениеШтрихкода;
			
			СтрокаУпаковки.Обработан = Истина;
			
			#Вставка
			КоличествоОстаток = КоличествоОстаток - 1;
			#КонецВставки
		КонецЕсли;
		
		ОтметитьОбработанныеСтрокиДляМультитоварныхУпаковок(ДанныеШтрихкодовУпаковок, ПараметрыПоиска, СтрокаУпаковки);
		
	КонецЦикла; 
	
	Если КонтрольныеИдентификационныеЗнаки.Количество() Тогда
		
		НоваяСтрока = СведенияОМаркировке.Добавить();
		НоваяСтрока.Идентификатор = Новый Структура("КонтрольныеЗнаки", КонтрольныеИдентификационныеЗнаки);
		
	КонецЕсли;
	
	Если ИндивидуальныеУпаковки.Количество() Тогда
		
		НоваяСтрока = СведенияОМаркировке.Добавить();
		НоваяСтрока.Идентификатор = Новый Структура("ИдентификаторыУпаковок", ИндивидуальныеУпаковки);
		
	КонецЕсли;
	
	Приемник.СведенияОМаркировке = СведенияОМаркировке;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
