#Область ПрограммныйИнтерфейс

Функция ТребуетсяОтправкаУведомленияОЗамечаниях(Титул) Экспорт
	
	ТипТитула = ТипЗнч(Титул);
	
	Если ТипТитула = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул2")
		Или ТипТитула = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул4") Тогда
		
		РеквизитыТитула = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
			Титул, "ЕстьОтметкиПеревозчика, ЕстьЗамечанияПеревозчика");
		
		Если РеквизитыТитула.ЕстьОтметкиПеревозчика Или РеквизитыТитула.ЕстьЗамечанияПеревозчика Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ОтправитьУведомленияОЗамечанияхВодителя(ДокументЭТРН, ЗамечанияВодителя, ЭтоПогрузка, Титул2_4 = Неопределено) Экспорт
	
	// Определяем использованность каналов отправки
	ИспользоватьОтправкуВТелеграм = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
	ИспользоватьОтправкуНаПочту = КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
	
	Если Не ИспользоватьОтправкуВТелеграм И Не ИспользоватьОтправкуНаПочту Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументЭТРН) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыЭТРН = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(ДокументЭТРН,
		"ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку, ПогрузкуОсуществляет, Грузоотправитель, Перевозчик, Грузополучатель,
		|МестоПогрузки, МестоДоставки");
	
	Если ЗамечанияВодителя = Неопределено Тогда
		ИмяРеквизита = "ТрНЗамечанияОтПеревозчика";
		ЭтоЗамечанияПеревозчика = Истина;
	Иначе
		ИмяРеквизита = "ТрНЗамечанияОтВодителя";
		ЭтоЗамечанияПеревозчика = Ложь;
	КонецЕсли;
	
	// Определяем получателей
	ОбъектыСКонтактами = Новый Массив;
	Если РеквизитыЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку И ЗначениеЗаполнено(РеквизитыЭТРН.ПогрузкуОсуществляет) Тогда	// ГО
		ОбъектыСКонтактами.Добавить(РеквизитыЭТРН.ПогрузкуОсуществляет);
	Иначе
		ОбъектыСКонтактами.Добавить(РеквизитыЭТРН.Грузоотправитель);
	КонецЕсли;
	ОбъектыСКонтактами.Добавить(РеквизитыЭТРН.Перевозчик);
	Если ЭтоПогрузка Тогда
		ОбъектыСКонтактами.Добавить(РеквизитыЭТРН.МестоПогрузки);
	Иначе
		ВсеПереадресации = Документы.КонтурЛогистика_ТрН_Титул7.ВсеПереадресации(ДокументЭТРН);
		Если ВсеПереадресации.Количество() = 0 Тогда
			ОбъектыСКонтактами.Добавить(РеквизитыЭТРН.МестоДоставки);
			ОбъектыСКонтактами.Добавить(РеквизитыЭТРН.Грузополучатель);
		Иначе
			ПоследняяПереадресация = ВсеПереадресации[ВсеПереадресации.Количество() - 1];
			ОбъектыСКонтактами.Добавить(ПоследняяПереадресация.МестоДоставки);
			ОбъектыСКонтактами.Добавить(ПоследняяПереадресация.Грузополучатель);
		КонецЕсли;
	КонецЕсли;
	
	КонтактнаяИнформация = КонтактнаяИнформация(ОбъектыСКонтактами, ИмяРеквизита);
	
	Если КонтактнаяИнформация.НомераТелефонов.Количество() = 0 И КонтактнаяИнформация.АдресаЭлектронныхПочт.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Формируем сообщения
	ДанныеДляСообщений = ДанныеПоДокументу(ДокументЭТРН);
	
	// При отправке Т2 и Т4 у нас нет данных водителя, тогда считаем что мы перевозчик и данные берем из Т2 и Т4
	Если ЭтоЗамечанияПеревозчика Тогда
		Замечания = ЗамечанияИзТитула(Титул2_4);
		ОтветственноеЛицо = "Перевозчик";
	Иначе
		Замечания = ЗамечанияВодителя;
		ОтветственноеЛицо = "Водитель";
	КонецЕсли;
	
	Если ИспользоватьОтправкуВТелеграм И КонтактнаяИнформация.НомераТелефонов.Количество() <> 0 Тогда
		// Заголовок
		ШаблонЗаголовка = "<b>%1</b>
			|ЭТрН №%2 от %3";
		ТекстЗаголовка = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонЗаголовка,
			?(ЭтоПогрузка, "П О Г Р У З К А", "Р А З Г Р У З К А"),
			СокрЛП(ДанныеДляСообщений.НомерДокумента),
			Формат(ДанныеДляСообщений.ДатаДокумента, "ДЛФ=D;"));
		
		ТекстСообщения = ТекстСообщенияСЗамечаниями(ДанныеДляСообщений, Замечания, ТекстЗаголовка, ЭтоПогрузка, ОтветственноеЛицо, Ложь);
		
		НовоеСообщение = КонтурЛогистика_РаботаСТелеграм.МанифестСообщения();
		НовоеСообщение.Тип = "text";
		НовоеСообщение.Данные = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьДвоичныеДанныеИзСтроки_КонтурЛогистика(ТекстСообщения);
		
		Сообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовоеСообщение);
		
		Для Каждого ТекущийНомерТелефона Из КонтактнаяИнформация.НомераТелефонов Цикл
			КонтурЛогистика_РаботаСТелеграм.ОтправитьСообщения(ТекущийНомерТелефона, Сообщения)
		КонецЦикла;
	КонецЕсли;
	
	Если ИспользоватьОтправкуНаПочту И КонтактнаяИнформация.АдресаЭлектронныхПочт.Количество() <> 0 Тогда
		// Заголовок
		ШаблонЗаголовка = "%1: ЭТрН №%2 от %3";
		ТекстЗаголовка = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонЗаголовка,
			?(ЭтоПогрузка, "Погрузка", "Разгрузка"),
			СокрЛП(ДанныеДляСообщений.НомерДокумента),
			Формат(ДанныеДляСообщений.ДатаДокумента, "ДЛФ=D;"));
		
		ТекстСообщения = ТекстСообщенияСЗамечаниями(ДанныеДляСообщений, Замечания, ТекстЗаголовка, ЭтоПогрузка, ОтветственноеЛицо, Истина);
		
		ШаблонПисьма = ТекстПисьмаСЗамечаниями();
		ШаблонПисьма = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонПисьма, ТекстСообщения);
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Тема = ТекстЗаголовка;
		Письмо.Тексты.Добавить(ШаблонПисьма, ТипТекстаПочтовогоСообщения.HTML);
		
		Для Каждого ТекущийАдресПочты Из КонтактнаяИнформация.АдресаЭлектронныхПочт Цикл
			Письмо.Получатели.Добавить(ТекущийАдресПочты);
		КонецЦикла;
		
		ТекстОшибки = КонтурЛогистика_РаботаСПочтовымиСообщениями.ОтправитьПисьмо(Письмо);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ЗаписьЖурналаРегистрации("КонтурЛогистика_ОтправкаУведомлений",
				УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьУведомленияОНеобходимостиПодписатьВодителем(Документ, Состояние) Экспорт
	
	ПовтИсп = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп;
	
	ОтправлятьУведомленияВодителюПоставитьПодпись = ПовтИсп.ЗначениеНастройки(
		"ОтправлятьУведомленияВодителюПоставитьПодпись");
	
	// Определяем использованность каналов отправки
	ИспользоватьОтправкуВТелеграм = ПовтИсп.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
	ИспользоватьОтправкуНаПочту = КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
	
	// особенности отправки в адрес партнера перевозчика
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная") 
		И ЗначениеЗаполнено(Документ)
		И ЗначениеЗаполнено(Документ.ПартнерПеревозчик) Тогда
			
		ИспользоватьОтправкуВТелеграм 					= ПовтИсп.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм", Документ.ПартнерПеревозчик);
		ОтправлятьУведомленияВодителюПоставитьПодпись 	= ПовтИсп.ЗначениеНастройки("ОтправлятьУведомленияВодителюПоставитьПодпись", Документ.ПартнерПеревозчик);

	КонецЕсли;
	 
	Если Не ОтправлятьУведомленияВодителюПоставитьПодпись Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИспользоватьОтправкуВТелеграм И Не ИспользоватьОтправкуНаПочту Тогда
		Возврат;
	КонецЕсли;
	
	Если Состояние = "r-wait-driver-approve"
		Или Состояние = "r-wait-driver-draftApprove" Тогда
		
		ЭтоПогрузка = Истина;
	Иначе
		ЭтоПогрузка = Ложь;
	КонецЕсли;
	
	ДанныеДляСообщений = ДанныеПоДокументу(Документ);
	
	Если ИспользоватьОтправкуВТелеграм
		И (ЗначениеЗаполнено(ДанныеДляСообщений.Телефон1) Или ЗначениеЗаполнено(ДанныеДляСообщений.Телефон2)) Тогда
		
		ТелефоныДляОтправки = Новый Массив;
		
		ТекстСообщения = ТекстСообщенияОНеобходимостиПодписатьВодителем(ДанныеДляСообщений, ЭтоПогрузка, Ложь);
		
		НовоеСообщение = КонтурЛогистика_РаботаСТелеграм.МанифестСообщения();
		НовоеСообщение.Тип = "text";
		НовоеСообщение.Данные = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьДвоичныеДанныеИзСтроки_КонтурЛогистика(ТекстСообщения);
		
		Сообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовоеСообщение);
		
		Если ЗначениеЗаполнено(ДанныеДляСообщений.Телефон1) Тогда
			РегистрыСведений.КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ДобавитьВОчередь(ДанныеДляСообщений.Телефон1, Сообщения);
			ТелефоныДляОтправки.Добавить(ДанныеДляСообщений.Телефон1);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеДляСообщений.Телефон2) Тогда
			РегистрыСведений.КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ДобавитьВОчередь(ДанныеДляСообщений.Телефон2, Сообщения);
			ТелефоныДляОтправки.Добавить(ДанныеДляСообщений.Телефон2);
		КонецЕсли;
		
		РегистрыСведений.КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ОтправитьСообщения(ТелефоныДляОтправки);
	КонецЕсли;
	
	Если ИспользоватьОтправкуНаПочту
		И (ЗначениеЗаполнено(ДанныеДляСообщений.АдресПочтыСотрудника1) Или ЗначениеЗаполнено(ДанныеДляСообщений.АдресПочтыСотрудника2)) Тогда
		
		// Заголовок
		ШаблонЗаголовка = "%1: ЭТрН №%2 от %3";
		ТекстЗаголовка = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонЗаголовка,
			?(ЭтоПогрузка, "Погрузка", "Разгрузка"),
			СокрЛП(ДанныеДляСообщений.НомерДокумента),
			Формат(ДанныеДляСообщений.ДатаДокумента, "ДЛФ=D;"));
		
		ТекстСообщения = ТекстСообщенияОНеобходимостиПодписатьВодителем(ДанныеДляСообщений, ЭтоПогрузка, Истина);
		
		ШаблонПисьма = ТекстПисьмаСЗамечаниями();
		ШаблонПисьма = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонПисьма, ТекстСообщения);
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Тема = ТекстЗаголовка;
		Письмо.Тексты.Добавить(ШаблонПисьма, ТипТекстаПочтовогоСообщения.HTML);
		
		Если ЗначениеЗаполнено(ДанныеДляСообщений.АдресПочтыСотрудника1) Тогда
			Письмо.Получатели.Добавить(ДанныеДляСообщений.АдресПочтыСотрудника1);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеДляСообщений.АдресПочтыСотрудника2) Тогда
			Письмо.Получатели.Добавить(ДанныеДляСообщений.АдресПочтыСотрудника2);
		КонецЕсли;
		
		ТекстОшибки = КонтурЛогистика_РаботаСПочтовымиСообщениями.ОтправитьПисьмо(Письмо);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ЗаписьЖурналаРегистрации("КонтурЛогистика_ОтправкаУведомлений",
				УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ОтправитьУведомленияОбОтказеИлиЧастичнойПриемкеТрН(ДокументОбъект) Экспорт
	
	// Определяем использованность каналов отправки
	ИспользоватьОтправкуВТелеграм = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
	ИспользоватьОтправкуНаПочту = КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
	
	Если Не ИспользоватьОтправкуВТелеграм И Не ИспользоватьОтправкуНаПочту Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Ложь;
	
	ЭтоТ2 = (ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КонтурЛогистика_ТрН_Титул2"));
	Если ЭтоТ2 Тогда
		ЗаголовокСообщенияТелеграм = "О Т К А З   П Р И   П О Г Р У З К Е";
		ЗаголовокСообщенияПочта = "Отказ при погрузке";
		
		ИмяРеквизитаКонтактнойИнформации = "ТрНОтказПВ";
		ЭтоПогрузка = Истина;
		ПричинаОтказа = ДокументОбъект.ПричинаОтказаВПодписи;
		СостояниеГруза = "";
	Иначе
		Если ДокументОбъект.ПринятьЧастично Тогда
			ЗаголовокСообщенияТелеграм = "Ч А С Т И Ч Н А Я   П Р И Е М К А";
			ЗаголовокСообщенияПочта = "Частичная приемка";
		Иначе
			ЗаголовокСообщенияТелеграм = "О Т К А З   П Р И   Р А З Г Р У З К Е";
			ЗаголовокСообщенияПочта = "Отказ при разгрузке";
		КонецЕсли;
		
		ИмяРеквизитаКонтактнойИнформации = "ТрНОтказГП";
		ЭтоПогрузка = Ложь;
		ПричинаОтказа = ДокументОбъект.ПричОтк;
		СостояниеГруза = ДокументОбъект.ОбщееСостояние;
	КонецЕсли;
	
	РеквизитыЭТРН = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(ДокументОбъект.ДокументЭТРН,
		"ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку, ПогрузкуОсуществляет, Грузоотправитель, Перевозчик, Грузополучатель,
		|МестоПогрузки, МестоДоставки");
	
	ОбъектыСКонтактами = Новый Массив;
	
	// Место погрузки/разгрузки
	Если ЭтоТ2 Тогда
		ОбъектыСКонтактами.Добавить(РеквизитыЭТРН.МестоПогрузки);
	Иначе
		ВсеПереадресации = Документы.КонтурЛогистика_ТрН_Титул7.ВсеПереадресации(ДокументОбъект.ДокументЭТРН);
		Если ВсеПереадресации.Количество() = 0 Тогда
			ОбъектыСКонтактами.Добавить(РеквизитыЭТРН.МестоДоставки);
		Иначе
			ПоследняяПереадресация = ВсеПереадресации[ВсеПереадресации.Количество() - 1];
			ОбъектыСКонтактами.Добавить(ПоследняяПереадресация.МестоДоставки);
		КонецЕсли;
	КонецЕсли;
	
	// Грузоотправитель
	Если РеквизитыЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку
		И ЗначениеЗаполнено(РеквизитыЭТРН.ПогрузкуОсуществляет) Тогда
		
		ОбъектыСКонтактами.Добавить(РеквизитыЭТРН.ПогрузкуОсуществляет);
	Иначе
		ОбъектыСКонтактами.Добавить(РеквизитыЭТРН.Грузоотправитель);
	КонецЕсли;
	
	КонтактнаяИнформация = КонтактнаяИнформация(ОбъектыСКонтактами, ИмяРеквизитаКонтактнойИнформации, ДокументОбъект.ДокументЭТРН);
	
	Если КонтактнаяИнформация.НомераТелефонов.Количество() = 0 И КонтактнаяИнформация.АдресаЭлектронныхПочт.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеДляСообщений = ДанныеПоДокументу(ДокументОбъект.ДокументЭТРН);
	Если ИспользоватьОтправкуВТелеграм И КонтактнаяИнформация.НомераТелефонов.Количество() <> 0 Тогда
		// Заголовок
		ШаблонЗаголовка = "<b>%1</b>
			|ЭТрН №%2 от %3";
		ТекстЗаголовка = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонЗаголовка,
			ЗаголовокСообщенияТелеграм,
			СокрЛП(ДанныеДляСообщений.НомерДокумента),
			Формат(ДанныеДляСообщений.ДатаДокумента, "ДЛФ=D;"));
		
		ТекстСообщения = ТекстСообщенияОтказа(ДанныеДляСообщений, ТекстЗаголовка, ЭтоПогрузка, ПричинаОтказа, СостояниеГруза, Ложь);
		
		НовоеСообщение = КонтурЛогистика_РаботаСТелеграм.МанифестСообщения();
		НовоеСообщение.Тип = "text";
		НовоеСообщение.Данные = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьДвоичныеДанныеИзСтроки_КонтурЛогистика(ТекстСообщения);
		
		Сообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовоеСообщение);
		
		Для Каждого ТекущийНомерТелефона Из КонтактнаяИнформация.НомераТелефонов Цикл
			КонтурЛогистика_РаботаСТелеграм.ОтправитьСообщения(ТекущийНомерТелефона, Сообщения)
		КонецЦикла;
		
		Результат = Истина;
	КонецЕсли;
	
	Если ИспользоватьОтправкуНаПочту И КонтактнаяИнформация.АдресаЭлектронныхПочт.Количество() <> 0 Тогда
		// Заголовок
		ШаблонЗаголовка = "%1: ЭТрН №%2 от %3";
		ТекстЗаголовка = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонЗаголовка,
			ЗаголовокСообщенияПочта,
			СокрЛП(ДанныеДляСообщений.НомерДокумента),
			Формат(ДанныеДляСообщений.ДатаДокумента, "ДЛФ=D;"));
		
		ТекстСообщения = ТекстСообщенияОтказа(ДанныеДляСообщений, ТекстЗаголовка, ЭтоПогрузка, ПричинаОтказа, СостояниеГруза, Истина);
		
		ШаблонПисьма = ТекстПисьмаСЗамечаниями();
		ШаблонПисьма = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонПисьма, ТекстСообщения);
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Тема = ТекстЗаголовка;
		Письмо.Тексты.Добавить(ШаблонПисьма, ТипТекстаПочтовогоСообщения.HTML);
		
		Для Каждого ТекущийАдресПочты Из КонтактнаяИнформация.АдресаЭлектронныхПочт Цикл
			Письмо.Получатели.Добавить(ТекущийАдресПочты);
		КонецЦикла;
		
		КонтурЛогистика_РаботаСПочтовымиСообщениями.ОтправитьПисьмо(Письмо);
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Данные по документу для формирования сообщений и писем.
//
// Параметры:
//  ДокументСсылка		 - ДокументСсылка	 - отправляемый титул.
// 
// Возвращаемое значение:
//  Структура -  данные для формирования письма.
//
Функция ДанныеПоДокументу(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыОтправки = Новый Структура(
		"kl_id, Титул, Документ, НомерДокумента, ДатаДокумента,
		|ДокументГрузоотправитель, ДокументПеревозчик, ДокументГрузополучатель,
		|ТранспортноеСредство, ГосНомерАвто, МаркаАвто,
		|Прицеп, ГосНомерПрицеп, Прицеп2, ГосНомерПрицеп2,
		|GLNПогрузки, МестоПогрузки, АдресОткуда,
		|GLNДоставки, МестоДоставки, АдресКуда,
		|ПогрузкаДатаВремяПрибытия, ПогрузкаДатаВремяУбытия,
		|ВыгрузкаДатаВремяПрибытия, ВыгрузкаДатаВремяУбытия,
		|Дата1, Дата2,
		|КоличествоМест, ОбщаяМасса,
		|УИДМинтранса,
		|Сотрудник1, АдресПочтыСотрудника1, Телефон1,
		|Сотрудник2, АдресПочтыСотрудника2, Телефон2");
	
	ДокументОснования = ДокументОснования(ДокументСсылка);
	Если ДокументОснования = Неопределено Тогда
		ДокументОснования = ДокументСсылка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументОснования);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.kl_id КАК kl_id,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка КАК Документ,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка КАК Титул,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Дата КАК ДатаТитула,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.НомерТрН КАК НомерДокумента,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ДатаТрН КАК ДатаДокумента,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ТранспортноеСредство КАК ТранспортноеСредство,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Прицеп КАК Прицеп,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Прицеп2 КАК Прицеп2,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МестоПогрузки КАК МестоПогрузки,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МестоДоставки КАК МестоДоставки,
	|	КонтурЛогистика_ТрН_Титул1.ДатаВремяПодачиПлановая КАК Дата1,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ДатаВремяДоставки КАК Дата2,
	|	КонтурЛогистика_ТрН_Титул1.КоличествоМест КАК КоличествоМест,
	|	КонтурЛогистика_ТрН_Титул1.МассаБруттоКг КАК ОбщаяМасса,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.УИД КАК УИДМинтранса,
	|	КонтурЛогистика_ТрН_Титул1.Водитель КАК Сотрудник1,
	|	КонтурЛогистика_ТрН_Титул1.Водитель2 КАК Сотрудник2
	|ПОМЕСТИТЬ Титулы
	|ИЗ
	|	Документ.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная КАК КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|		ПО КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка = КонтурЛогистика_ТрН_Титул1.ДокументЭТРН
	|ГДЕ
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.kl_id,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка,
	|	КонтурЛогистика_ТрН_Титул2.Ссылка,
	|	КонтурЛогистика_ТрН_Титул2.Дата,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.НомерТрН,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ДатаТрН,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ТранспортноеСредство,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Прицеп,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Прицеп2,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МестоПогрузки,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МестоДоставки,
	|	КонтурЛогистика_ТрН_Титул1.ДатаВремяПодачиПлановая,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ДатаВремяДоставки,
	|	КонтурЛогистика_ТрН_Титул1.КоличествоМест,
	|	КонтурЛогистика_ТрН_Титул1.МассаБруттоКг,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.УИД,
	|	КонтурЛогистика_ТрН_Титул1.Водитель,
	|	КонтурЛогистика_ТрН_Титул1.Водитель2
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2 КАК КонтурЛогистика_ТрН_Титул2
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная КАК КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|			ПО КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка = КонтурЛогистика_ТрН_Титул1.ДокументЭТРН
	|		ПО КонтурЛогистика_ТрН_Титул2.ДокументЭТРН = КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул2.ДокументЭТРН = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.kl_id,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка,
	|	КонтурЛогистика_ТрН_Титул7.Ссылка,
	|	КонтурЛогистика_ТрН_Титул7.Дата,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.НомерТрН,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ДатаТрН,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ТранспортноеСредство,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Прицеп,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Прицеп2,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МестоДоставки,
	|	КонтурЛогистика_ТрН_Титул7.АдрВыгруз,
	|	КонтурЛогистика_ТрН_Титул1.ДатаВремяПодачиПлановая,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ДатаВремяДоставки,
	|	КонтурЛогистика_ТрН_Титул1.КоличествоМест,
	|	КонтурЛогистика_ТрН_Титул1.МассаБруттоКг,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.УИД,
	|	КонтурЛогистика_ТрН_Титул1.Водитель,
	|	КонтурЛогистика_ТрН_Титул1.Водитель2
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул7 КАК КонтурЛогистика_ТрН_Титул7
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная КАК КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|			ПО КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка = КонтурЛогистика_ТрН_Титул1.ДокументЭТРН
	|		ПО КонтурЛогистика_ТрН_Титул7.ДокументЭТРН = КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул7.ДокументЭТРН = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.kl_id,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка,
	|	КонтурЛогистика_ТрН_Титул8.Ссылка,
	|	КонтурЛогистика_ТрН_Титул8.Дата,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.НомерТрН,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ДатаТрН,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ТранспортноеСредство,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Прицеп,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Прицеп2,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МестоПогрузки,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МестоДоставки,
	|	КонтурЛогистика_ТрН_Титул8.ДатВрЗамен,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ДатаВремяДоставки,
	|	КонтурЛогистика_ТрН_Титул1.КоличествоМест,
	|	КонтурЛогистика_ТрН_Титул1.МассаБруттоКг,
	|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.УИД,
	|	КонтурЛогистика_ТрН_Титул1.Водитель,
	|	КонтурЛогистика_ТрН_Титул1.Водитель2
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул8 КАК КонтурЛогистика_ТрН_Титул8
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная КАК КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|			ПО КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка = КонтурЛогистика_ТрН_Титул1.ДокументЭТРН
	|		ПО КонтурЛогистика_ТрН_Титул8.ДокументЭТРН = КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул8.ДокументЭТРН = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул1.kl_id,
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка,
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка,
	|	КонтурЛогистика_ПЛ_Титул1.Дата,
	|	КонтурЛогистика_ПЛ_Титул1.НомерПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.ДатаПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.ТранспортноеСредство,
	|	КонтурЛогистика_ПЛ_Титул1.Прицеп,
	|	КонтурЛогистика_ПЛ_Титул1.Прицеп2,
	|	КонтурЛогистика_ПЛ_Титул1.МестоОтправления,
	|	NULL,
	|	КонтурЛогистика_ПЛ_Титул1.СрокПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.СрокПЛИнтервал,
	|	NULL,
	|	NULL,
	|	КонтурЛогистика_ПЛ_Титул1.УИД_ПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.Водитель,
	|	КонтурЛогистика_ПЛ_Титул1.Водитель2
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул1 КАК КонтурЛогистика_ПЛ_Титул1
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул1.kl_id,
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка,
	|	КонтурЛогистика_ПЛ_Титул4.Ссылка,
	|	КонтурЛогистика_ПЛ_Титул4.Дата,
	|	КонтурЛогистика_ПЛ_Титул1.НомерПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.ДатаПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.ТранспортноеСредство,
	|	КонтурЛогистика_ПЛ_Титул1.Прицеп,
	|	КонтурЛогистика_ПЛ_Титул1.Прицеп2,
	|	КонтурЛогистика_ПЛ_Титул1.МестоОтправления,
	|	NULL,
	|	КонтурЛогистика_ПЛ_Титул1.СрокПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.СрокПЛИнтервал,
	|	NULL,
	|	NULL,
	|	КонтурЛогистика_ПЛ_Титул4.УИД_ПЛ,
	|	КонтурЛогистика_ПЛ_Титул4.Титул1.Водитель,
	|	КонтурЛогистика_ПЛ_Титул4.Титул1.Водитель2
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул4 КАК КонтурЛогистика_ПЛ_Титул4
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ПЛ_Титул1 КАК КонтурЛогистика_ПЛ_Титул1
	|		ПО КонтурЛогистика_ПЛ_Титул4.Титул1 = КонтурЛогистика_ПЛ_Титул1.Ссылка
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул4.Титул1 = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул1.kl_id,
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка,
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка,
	|	КонтурЛогистика_ПЛ_Титул1.Дата,
	|	КонтурЛогистика_ПЛ_Титул1.НомерПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.ДатаПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.ТранспортноеСредство,
	|	КонтурЛогистика_ПЛ_Титул1.Прицеп,
	|	КонтурЛогистика_ПЛ_Титул1.Прицеп2,
	|	NULL,
	|	NULL,
	|	КонтурЛогистика_ПЛ_Титул1.СрокПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.СрокПЛИнтервал,
	|	NULL,
	|	NULL,
	|	КонтурЛогистика_ПЛ_Титул1.УИД_ПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.Водитель,
	|	КонтурЛогистика_ПЛ_Титул1.Водитель2
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул1_5_02 КАК КонтурЛогистика_ПЛ_Титул1
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул1.kl_id,
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка,
	|	КонтурЛогистика_ПЛ_Титул4.Ссылка,
	|	КонтурЛогистика_ПЛ_Титул4.Дата,
	|	КонтурЛогистика_ПЛ_Титул1.НомерПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.ДатаПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.ТранспортноеСредство,
	|	КонтурЛогистика_ПЛ_Титул1.Прицеп,
	|	КонтурЛогистика_ПЛ_Титул1.Прицеп2,
	|	NULL,
	|	NULL,
	|	КонтурЛогистика_ПЛ_Титул1.СрокПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.СрокПЛИнтервал,
	|	NULL,
	|	NULL,
	|	КонтурЛогистика_ПЛ_Титул4.Титул1.УИД_ПЛ,
	|	КонтурЛогистика_ПЛ_Титул4.Титул1.Водитель,
	|	КонтурЛогистика_ПЛ_Титул4.Титул1.Водитель2
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул4 КАК КонтурЛогистика_ПЛ_Титул4
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ПЛ_Титул1 КАК КонтурЛогистика_ПЛ_Титул1
	|		ПО КонтурЛогистика_ПЛ_Титул4.Титул1 = КонтурЛогистика_ПЛ_Титул1.Ссылка
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул4.Титул1 = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Титулы.kl_id КАК kl_id,
	|	Титулы.Документ КАК Документ,
	|	Титулы.Документ.Грузоотправитель КАК ДокументГрузоотправитель,
	|	Титулы.Документ.Перевозчик КАК ДокументПеревозчик,
	|	Титулы.Документ.Грузополучатель КАК ДокументГрузополучатель,
	|	Титулы.Титул КАК Титул,
	|	Титулы.НомерДокумента КАК НомерДокумента,
	|	Титулы.ДатаДокумента КАК ДатаДокумента,
	|	Титулы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Титулы.ТранспортноеСредство.РегНомер КАК ГосНомерАвто,
	|	Титулы.ТранспортноеСредство.МаркаТС КАК МаркаАвто,
	|	Титулы.Прицеп КАК Прицеп,
	|	Титулы.Прицеп.РегНомер КАК ГосНомерПрицеп,
	|	Титулы.Прицеп2 КАК Прицеп2,
	|	Титулы.Прицеп2.РегНомер КАК ГосНомерПрицеп2,
	|	Титулы.МестоПогрузки КАК МестоПогрузки,
	|	Титулы.МестоПогрузки.GLN КАК GLNПогрузки,
	|	Титулы.МестоПогрузки.АдресГород КАК МестоПогрузкиАдресГород,
	|	Титулы.МестоПогрузки.АдресНаселПункт КАК МестоПогрузкиАдресНаселПункт,
	|	Титулы.МестоПогрузки.АдресУлица КАК МестоПогрузкиАдресУлица,
	|	Титулы.МестоПогрузки.АдресДом КАК МестоПогрузкиАдресДом,
	|	Титулы.МестоПогрузки.АдресИнфАдрес КАК МестоПогрузкиАдресИнфАдрес,
	|	Титулы.МестоПогрузки.КодГАР КАК МестоПогрузкиКодГАР,
	|	Титулы.МестоПогрузки.АдресКодРегион КАК МестоПогрузкиАдресКодРегион,
	|	Титулы.МестоПогрузки.АдресИндекс КАК МестоПогрузкиАдресИндекс,
	|	Титулы.МестоДоставки КАК МестоДоставки,
	|	Титулы.МестоДоставки.GLN КАК GLNДоставки,
	|	Титулы.МестоДоставки.АдресГород КАК МестоДоставкиАдресГород,
	|	Титулы.МестоДоставки.АдресНаселПункт КАК МестоДоставкиАдресНаселПункт,
	|	Титулы.МестоДоставки.АдресУлица КАК МестоДоставкиАдресУлица,
	|	Титулы.МестоДоставки.АдресДом КАК МестоДоставкиАдресДом,
	|	Титулы.МестоДоставки.АдресИнфАдрес КАК МестоДоставкиАдресИнфАдрес,
	|	Титулы.МестоДоставки.КодГАР КАК МестоДоставкиКодГАР,
	|	Титулы.МестоДоставки.АдресКодРегион КАК МестоДоставкиАдресКодРегион,
	|	Титулы.МестоДоставки.АдресИндекс КАК МестоДоставкиАдресИндекс,
	|	КонтурЛогистика_ТрН_Титул1.ДатаВремяПрибытия КАК ПогрузкаДатаВремяПрибытия,
	|	КонтурЛогистика_ТрН_Титул1.ДатаВремяУбытия КАК ПогрузкаДатаВремяУбытия,
	|	КонтурЛогистика_ТрН_Титул3.ФДатВрПриб КАК ВыгрузкаДатаВремяПрибытия,
	|	КонтурЛогистика_ТрН_Титул3.ФДатВрУбыт КАК ВыгрузкаДатаВремяУбытия,
	|	Титулы.Дата1 КАК Дата1,
	|	Титулы.Дата2 КАК Дата2,
	|	Титулы.КоличествоМест КАК КоличествоМест,
	|	Титулы.ОбщаяМасса КАК ОбщаяМасса,
	|	Титулы.УИДМинтранса КАК УИДМинтранса,
	|	Титулы.Сотрудник1 КАК Сотрудник1,
	|	Титулы.Сотрудник1.АдресЭлектроннойПочты КАК АдресПочтыСотрудника1,
	|	Титулы.Сотрудник1.ТелефонОсновной КАК Телефон1,
	|	Титулы.Сотрудник2 КАК Сотрудник2,
	|	Титулы.Сотрудник2.АдресЭлектроннойПочты КАК АдресПочтыСотрудника2,
	|	Титулы.Сотрудник2.ТелефонОсновной КАК Телефон2
	|ИЗ
	|	Титулы КАК Титулы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|		ПО Титулы.Документ = КонтурЛогистика_ТрН_Титул1.ДокументЭТРН
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул3 КАК КонтурЛогистика_ТрН_Титул3
	|		ПО Титулы.Документ = КонтурЛогистика_ТрН_Титул3.ДокументЭТРН
	|
	|УПОРЯДОЧИТЬ ПО
	|	Титулы.ДатаТитула УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыОтправки, Выборка);
		
		ПараметрыОтправки.АдресОткуда = Справочники.КонтурЛогистика_ПунктыМаршрута.ПредставлениеАдресаПоДанным(Выборка, "МестоПогрузки");
		ПараметрыОтправки.АдресКуда = Справочники.КонтурЛогистика_ПунктыМаршрута.ПредставлениеАдресаПоДанным(Выборка, "МестоДоставки");
		
		Если ТипЗнч(ПараметрыОтправки.Титул) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул7") Тогда
			ДополнитьПараметрыОтправкиТитул7(ПараметрыОтправки, ПараметрыОтправки.Титул);
		КонецЕсли;
		
		Если ТипЗнч(ПараметрыОтправки.Титул) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул8") Тогда
			ДополнитьПараметрыОтправкиТитул8(ПараметрыОтправки, ПараметрыОтправки.Титул);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыОтправки;
	
КонецФункции

Функция НовоеЗамечаниеВодителя() Экспорт
	
	ПустаяДата = Дата(1, 1, 1, 0, 0, 0);
	
	Замечание = Новый Структура;
	Замечание.Вставить("ЕстьЗамечания", Ложь);
	Замечание.Вставить("ЗамДатВрПриб", ПустаяДата);
	Замечание.Вставить("ЗамДатВрУбыт", ПустаяДата);
	Замечание.Вставить("ЗамДатВрПосПрием", ПустаяДата);
	Замечание.Вставить("ЗамДатВрПосВыгр", ПустаяДата);
	Замечание.Вставить("ЗамСостГруз", "");
	Замечание.Вставить("ЗамМасс", "");
	Замечание.Вставить("ЗамКолМест", "");
	Замечание.Вставить("ЗамПогрРаб", "");
	Замечание.Вставить("ЗамРабВыгр", "");
	Замечание.Вставить("ПредставлениеЗамечанийВодителя", "");		// Представление для ЭТрН
	Замечание.Вставить("ОтметкиПеревозчика", Новый Массив);		// См. НоваяОтметкаПеревозчика()
	
	Возврат Замечание;
	
КонецФункции

Функция НоваяОтметкаПеревозчика() Экспорт
	
	ОтметкаПеревозчика = Новый Структура;
	ОтметкаПеревозчика.Вставить("ДатаИВремяОтметки", Дата(1, 1, 1, 0, 0, 0));
	ОтметкаПеревозчика.Вставить("ОписаниеОбстоятельств", "");
	ОтметкаПеревозчика.Вставить("Акты", Новый Массив);					// См. НовыйАктПеревозчика()
	ОтметкаПеревозчика.Вставить("Штрафы", Новый Массив);				// См. НовыйШтрафПеревозчика()
	
	Возврат ОтметкаПеревозчика;
	
КонецФункции

Функция ТекстТранспорта(ПараметрыОтправки) Экспорт
	
	Результат = Строка(ПараметрыОтправки.ТранспортноеСредство);
	
	Если ЗначениеЗаполнено(ПараметрыОтправки.Прицеп) Тогда
		ТекстПрицепа1 = "прицеп: " + Строка(ПараметрыОтправки.Прицеп);
	Иначе
		ТекстПрицепа1 = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОтправки.Прицеп2) Тогда
		ТекстПрицепа2 = ?(ЗначениеЗаполнено(ТекстПрицепа1), ", ", "")
			+ "прицеп: " + Строка(ПараметрыОтправки.Прицеп2);
	Иначе
		ТекстПрицепа2 = "";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекстПрицепа1) И Не ЗначениеЗаполнено(ТекстПрицепа2) Тогда
		Результат = Результат + " (прицеп отсутствует)";
	Иначе
		Результат = Результат + " (" + ТекстПрицепа1 + ТекстПрицепа2 + ")";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторДокументаЛогистикиИзФайлов(ДокументСсылка) Экспорт
	
	ДокументОснования = ДокументОснования(ДокументСсылка);
	Если ДокументОснования = Неопределено Тогда
		ДокументОснования = ДокументСсылка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГлавныйДокумент", ДокументОснования);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_ФайлыОбмена.kl_id КАК kl_id
	|ИЗ
	|	Справочник.КонтурЛогистика_ФайлыОбмена КАК КонтурЛогистика_ФайлыОбмена
	|ГДЕ
	|	КонтурЛогистика_ФайлыОбмена.ГлавныйДокумент = &ГлавныйДокумент
	|	И КонтурЛогистика_ФайлыОбмена.kl_id <> """"
	|	И НЕ КонтурЛогистика_ФайлыОбмена.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтурЛогистика_ФайлыОбмена.ДатаВремяФормирования УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.kl_id;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйАктПеревозчика()
	
	АктПеревозчика = Новый Структура;
	АктПеревозчика.Вставить("АктНомер");
	АктПеревозчика.Вставить("АктДата");
	АктПеревозчика.Вставить("АктНаименование");
	АктПеревозчика.Вставить("АктИдДок");
	АктПеревозчика.Вставить("АктДопСведДок");
	АктПеревозчика.Вставить("СтороныСоставители");
	АктПеревозчика.Вставить("ДополнительныйСоставитель");
	
	Возврат АктПеревозчика;
	
КонецФункции

Функция НовыйШтрафПеревозчика()
	
	ШтрафПеревозчика = Новый Структура;
	ШтрафПеревозчика.Вставить("ФактКолЕдИзм");
	ШтрафПеревозчика.Вставить("ИтогРазмШтрРФ");
	ШтрафПеревозчика.Вставить("РасчШтр");
	
	Возврат ШтрафПеревозчика;
	
КонецФункции

Функция КонтактнаяИнформация(ОбъектыСКонтактами, ИмяРеквизита, ДокументЭТРН = Неопределено)
	
	КонтактнаяИнформация = Новый Структура;
	КонтактнаяИнформация.Вставить("НомераТелефонов", Новый Массив);
	КонтактнаяИнформация.Вставить("АдресаЭлектронныхПочт", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектыСКонтактами", ОбъектыСКонтактами);
	Запрос.УстановитьПараметр("ДокументЭТРН", ДокументЭТРН);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_ТрН_Титул1.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ТрН_Титул1.УведомлениеОтказаНаТелефон КАК УведомлениеОтказаНаТелефон,
	|	КонтурЛогистика_ТрН_Титул1.УведомлениеОтказаНаАдресЭлектроннойПочты КАК УведомлениеОтказаНаАдресЭлектроннойПочты
	|ПОМЕСТИТЬ КонтактыИзТрНТитул1
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН = &ДокументЭТРН
	|	И НЕ КонтурЛогистика_ТрН_Титул1.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	КонтурЛогистика_ТрН_Титул1.НомИспр УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПунктыМаршрутаКонтактыПолучателейУведомлений.Контакт КАК Контакт
	|ПОМЕСТИТЬ Телефоны
	|ИЗ
	|	Справочник.КонтурЛогистика_ПунктыМаршрута.КонтактыПолучателейУведомлений КАК КонтурЛогистика_ПунктыМаршрутаКонтактыПолучателейУведомлений
	|ГДЕ
	|	КонтурЛогистика_ПунктыМаршрутаКонтактыПолучателейУведомлений.Ссылка В(&ОбъектыСКонтактами)
	|	И КонтурЛогистика_ПунктыМаршрутаКонтактыПолучателейУведомлений.Тип = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыКонтактнойИнформации.Телефон)
	|	И КонтурЛогистика_ПунктыМаршрутаКонтактыПолучателейУведомлений.ТрНЗамечанияОтВодителя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадокКонтактыПолучателейУведомлений.Контакт
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок.КонтактыПолучателейУведомлений КАК КонтурЛогистика_ОрганизацииДиадокКонтактыПолучателейУведомлений
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадокКонтактыПолучателейУведомлений.Ссылка В(&ОбъектыСКонтактами)
	|	И КонтурЛогистика_ОрганизацииДиадокКонтактыПолучателейУведомлений.Тип = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыКонтактнойИнформации.Телефон)
	|	И КонтурЛогистика_ОрганизацииДиадокКонтактыПолучателейУведомлений.ТрНЗамечанияОтВодителя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактыИзТрНТитул1.УведомлениеОтказаНаТелефон
	|ИЗ
	|	КонтактыИзТрНТитул1 КАК КонтактыИзТрНТитул1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПунктыМаршрутаКонтактыПолучателейУведомлений.Контакт КАК Контакт
	|ПОМЕСТИТЬ АдресаПочт
	|ИЗ
	|	Справочник.КонтурЛогистика_ПунктыМаршрута.КонтактыПолучателейУведомлений КАК КонтурЛогистика_ПунктыМаршрутаКонтактыПолучателейУведомлений
	|ГДЕ
	|	КонтурЛогистика_ПунктыМаршрутаКонтактыПолучателейУведомлений.Ссылка В(&ОбъектыСКонтактами)
	|	И КонтурЛогистика_ПунктыМаршрутаКонтактыПолучателейУведомлений.Тип = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтурЛогистика_ПунктыМаршрутаКонтактыПолучателейУведомлений.ТрНЗамечанияОтВодителя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадокКонтактыПолучателейУведомлений.Контакт
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок.КонтактыПолучателейУведомлений КАК КонтурЛогистика_ОрганизацииДиадокКонтактыПолучателейУведомлений
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадокКонтактыПолучателейУведомлений.Ссылка В(&ОбъектыСКонтактами)
	|	И КонтурЛогистика_ОрганизацииДиадокКонтактыПолучателейУведомлений.Тип = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтурЛогистика_ОрганизацииДиадокКонтактыПолучателейУведомлений.ТрНЗамечанияОтВодителя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактыИзТрНТитул1.УведомлениеОтказаНаАдресЭлектроннойПочты
	|ИЗ
	|	КонтактыИзТрНТитул1 КАК КонтактыИзТрНТитул1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Телефоны.Контакт КАК Контакт
	|ИЗ
	|	Телефоны КАК Телефоны
	|
	|СГРУППИРОВАТЬ ПО
	|	Телефоны.Контакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АдресаПочт.Контакт КАК Контакт
	|ИЗ
	|	АдресаПочт КАК АдресаПочт
	|
	|СГРУППИРОВАТЬ ПО
	|	АдресаПочт.Контакт";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТрНЗамечанияОтВодителя", ИмяРеквизита);
	
	Результат = Запрос.ВыполнитьПакет();
	
	НомераТелефонов = Результат[3].Выгрузить().ВыгрузитьКолонку("Контакт");
	АдресаЭлектронныхПочт = Результат[4].Выгрузить().ВыгрузитьКолонку("Контакт");
	
	// Учтем возможное разделение точкой с запятой
	Для Каждого ТекущийТелефонСтрока Из НомераТелефонов Цикл
		Телефоны = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(ТекущийТелефонСтрока, ";");
		Для Каждого ТекущийТелефон Из Телефоны Цикл
			Если Не ЗначениеЗаполнено(ТекущийТелефон)
				Или КонтактнаяИнформация.НомераТелефонов.Найти(СокрЛП(ТекущийТелефон)) <> Неопределено Тогда
				
				Продолжить;
			КонецЕсли;
			
			КонтактнаяИнформация.НомераТелефонов.Добавить(СокрЛП(ТекущийТелефон));
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ТекущийАдресЭлектроннойПочтыСтрока Из АдресаЭлектронныхПочт Цикл
		АдресаЭлектроннойПочты = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(ТекущийАдресЭлектроннойПочтыСтрока, ";");
		Для Каждого ТекущийАдресЭлектроннойПочты Из АдресаЭлектроннойПочты Цикл
			Если Не ЗначениеЗаполнено(ТекущийАдресЭлектроннойПочты)
				Или КонтактнаяИнформация.АдресаЭлектронныхПочт.Найти(СокрЛП(ТекущийАдресЭлектроннойПочты)) <> Неопределено Тогда
				
				Продолжить;
			КонецЕсли;
			
			КонтактнаяИнформация.АдресаЭлектронныхПочт.Добавить(СокрЛП(ТекущийАдресЭлектроннойПочты));
		КонецЦикла;
	КонецЦикла;
	
	Возврат КонтактнаяИнформация;
	
КонецФункции

Функция ЗамечанияИзТитула(Титул2_4)
	
	Замечания = НовоеЗамечаниеВодителя();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Титул", Титул2_4);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул2.ЗамДатВрПриб КАК ЗамДатВрПриб,
	|	КонтурЛогистика_ТрН_Титул2.ЗамДатВрУбыт КАК ЗамДатВрУбыт,
	|	КонтурЛогистика_ТрН_Титул2.ЗамДатВрПосПрием КАК ЗамДатВрПосПрием,
	|	NULL КАК ЗамДатВрПосВыгр,
	|	КонтурЛогистика_ТрН_Титул2.ЗамСостГруз КАК ЗамСостГруз,
	|	КонтурЛогистика_ТрН_Титул2.ЗамМасс КАК ЗамМасс,
	|	КонтурЛогистика_ТрН_Титул2.ЗамКолМест КАК ЗамКолМест,
	|	КонтурЛогистика_ТрН_Титул2.ЗамПогрРаб КАК ЗамПогрРаб,
	|	NULL КАК ЗамРабВыгр
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2 КАК КонтурЛогистика_ТрН_Титул2
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул2.Ссылка = &Титул
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул4.ЗамДатВрПриб,
	|	КонтурЛогистика_ТрН_Титул4.ЗамДатВрУбыт,
	|	NULL,
	|	КонтурЛогистика_ТрН_Титул4.ЗамДатВрПосВыгр,
	|	КонтурЛогистика_ТрН_Титул4.ЗамСостГруз,
	|	NULL,
	|	NULL,
	|	NULL,
	|	КонтурЛогистика_ТрН_Титул4.ЗамРабВыгр
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул4 КАК КонтурЛогистика_ТрН_Титул4
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул4.Ссылка = &Титул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.ДатаИВремяОтметки КАК ДатаИВремяОтметки,
	|	КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.ОписаниеОбстоятельств КАК ОписаниеОбстоятельств
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2.ОтметкиПеревозчика КАК КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул2ОтметкиПеревозчика.Ссылка = &Титул
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул4ОтметкиПеревозчика.ИдентификаторСтроки,
	|	КонтурЛогистика_ТрН_Титул4ОтметкиПеревозчика.ДатаИВремяОтметки,
	|	КонтурЛогистика_ТрН_Титул4ОтметкиПеревозчика.ОписаниеОбстоятельств
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул4.ОтметкиПеревозчика КАК КонтурЛогистика_ТрН_Титул4ОтметкиПеревозчика
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул4ОтметкиПеревозчика.Ссылка = &Титул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул2Акты.ИдентификаторСтрокиОтметки КАК ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул2Акты.АктНомер КАК АктНомер,
	|	КонтурЛогистика_ТрН_Титул2Акты.АктДата КАК АктДата,
	|	КонтурЛогистика_ТрН_Титул2Акты.АктНаименование КАК АктНаименование,
	|	КонтурЛогистика_ТрН_Титул2Акты.АктИдДок КАК АктИдДок,
	|	КонтурЛогистика_ТрН_Титул2Акты.АктДопСведДок КАК АктДопСведДок,
	|	КонтурЛогистика_ТрН_Титул2Акты.СтороныСоставители КАК СтороныСоставители,
	|	КонтурЛогистика_ТрН_Титул2Акты.ДополнительныйСоставитель КАК ДополнительныйСоставитель
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2.Акты КАК КонтурЛогистика_ТрН_Титул2Акты
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул2Акты.Ссылка = &Титул
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул4Акты.ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул4Акты.АктНомер,
	|	КонтурЛогистика_ТрН_Титул4Акты.АктДата,
	|	КонтурЛогистика_ТрН_Титул4Акты.АктНаименование,
	|	КонтурЛогистика_ТрН_Титул4Акты.АктИдДок,
	|	КонтурЛогистика_ТрН_Титул4Акты.АктДопСведДок,
	|	КонтурЛогистика_ТрН_Титул4Акты.СтороныСоставители,
	|	КонтурЛогистика_ТрН_Титул4Акты.ДополнительныйСоставитель
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул4.Акты КАК КонтурЛогистика_ТрН_Титул4Акты
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул4Акты.Ссылка = &Титул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул2Штрафы.ИдентификаторСтрокиОтметки КАК ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул2Штрафы.ФактКолЕдИзм КАК ФактКолЕдИзм,
	|	КонтурЛогистика_ТрН_Титул2Штрафы.ИтогРазмШтрРФ КАК ИтогРазмШтрРФ,
	|	КонтурЛогистика_ТрН_Титул2Штрафы.РасчШтр КАК РасчШтр
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2.Штрафы КАК КонтурЛогистика_ТрН_Титул2Штрафы
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул2Штрафы.Ссылка = &Титул
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул4Штрафы.ИдентификаторСтрокиОтметки,
	|	КонтурЛогистика_ТрН_Титул4Штрафы.ФактКолЕдИзм,
	|	КонтурЛогистика_ТрН_Титул4Штрафы.ИтогРазмШтрРФ,
	|	КонтурЛогистика_ТрН_Титул4Штрафы.РасчШтр
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул4.Штрафы КАК КонтурЛогистика_ТрН_Титул4Штрафы
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул4Штрафы.Ссылка = &Титул";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаПоДокументам = Результат[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаПоДокументам.Следующий() Тогда
		Замечания.ЕстьЗамечания = Истина;
		ЗаполнитьЗначенияСвойств(Замечания, ВыборкаПоДокументам);
		Замечания.ПредставлениеЗамечанийВодителя = КонтурЛогистика_ПечатьСервер.ОписаниеЗамечанийПеревозчика(Замечания);
		
		// Акты и штрафы
		Акты = Результат[2].Выгрузить();
		Штрафы = Результат[3].Выгрузить();
		
		// Отметки перевозчика
		ВыборкаПоОтметкам = Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоОтметкам.Следующий() Цикл
			НоваяОтметка = НоваяОтметкаПеревозчика();
			ЗаполнитьЗначенияСвойств(НоваяОтметка, ВыборкаПоОтметкам);
			
			// Акты
			ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиОтметки", ВыборкаПоОтметкам.ИдентификаторСтроки);
			НайденныеАкты = Акты.НайтиСтроки(ПараметрыОтбора);
			Для Каждого ТекущийАкт Из НайденныеАкты Цикл
				НовыйАкт = НовыйАктПеревозчика();
				ЗаполнитьЗначенияСвойств(НовыйАкт, ТекущийАкт);
				
				НоваяОтметка.Акты.Добавить(НовыйАкт);
			КонецЦикла;
			
			// Штрафы
			НайденныеШтрафы = Штрафы.НайтиСтроки(ПараметрыОтбора);
			Для Каждого ТекущийШтраф Из НайденныеШтрафы Цикл
				НовыйШтраф = НовыйШтрафПеревозчика();
				ЗаполнитьЗначенияСвойств(НовыйШтраф, ТекущийШтраф);
				
				НоваяОтметка.Штрафы.Добавить(НовыйШтраф);
			КонецЦикла;
			
			Замечания.ОтметкиПеревозчика.Добавить(НоваяОтметка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Замечания;
	
КонецФункции

Функция ТекстСообщенияСЗамечаниями(ДанныеДляСообщений, Замечания, ТекстЗаголовка, ЭтоПогрузка, ОтветственноеЛицо, ФорматHTML)
	
	Если ФорматHTML Тогда
		ШаблонСтрокиЗамечания = "<tr><th>%1</th><td>%2</td></tr>";
		ШаблонСтрокиДопИнформации = "<p>%1</p>";
	Иначе
		ШаблонСтрокиЗамечания = "<b><u>%1:</u></b> %2";
		ШаблонСтрокиДопИнформации = "<i>%1</i>";
	КонецЕсли;
	
	Строки = Новый Массив;
	
	// Заголовок
	Если Не ФорматHTML Тогда
		Строки.Добавить(ТекстЗаголовка + Символы.ПС);
	КонецЕсли;
	
	//
	
	// Замечания водитля
	Если ФорматHTML Тогда
		Строки.Добавить("<table class=""table table-condensed"">");
		Строки.Добавить("<tbody>");
	КонецЕсли;
	
	// Строковые замечания водителя
	СтроковыеЗамечания = Новый Массив;
	Если ЗначениеЗаполнено(Замечания.ЗамСостГруз) Тогда
		СтроковыеЗамечания.Добавить("состояние груза - " + Замечания.ЗамСостГруз);
	КонецЕсли;
	Если ЗначениеЗаполнено(Замечания.ЗамМасс) Тогда
		СтроковыеЗамечания.Добавить("масса груза - " + Замечания.ЗамМасс);
	КонецЕсли;
	Если ЗначениеЗаполнено(Замечания.ЗамКолМест) Тогда
		СтроковыеЗамечания.Добавить("количество мест - " + Замечания.ЗамКолМест);
	КонецЕсли;
	Если ЭтоПогрузка И ЗначениеЗаполнено(Замечания.ЗамПогрРаб) Тогда
		СтроковыеЗамечания.Добавить("погрузочные работы - " + Замечания.ЗамПогрРаб);
	КонецЕсли;
	Если Не ЭтоПогрузка И ЗначениеЗаполнено(Замечания.ЗамРабВыгр) Тогда
		СтроковыеЗамечания.Добавить("работы по выгрузке - " + Замечания.ЗамРабВыгр);
	КонецЕсли;
	
	Если СтроковыеЗамечания.Количество() <> 0
		Или Замечания.ОтметкиПеревозчика.Количество() <> 0 Тогда
		
		// Отметки перевозчика
		Если Замечания.ОтметкиПеревозчика.Количество() <> 0 Тогда
			ПерваяСтрока = Истина;
			Для Каждого ТекущаяОтметка Из Замечания.ОтметкиПеревозчика Цикл
				ТекстОтметки = ?(ПерваяСтрока, "отметки: ", "");
				ТекстОтметки = ТекстОтметки + Строка(ТекущаяОтметка.ДатаИВремяОтметки) + " - " + ТекущаяОтметка.ОписаниеОбстоятельств;
				
				// Акты
				Если ТекущаяОтметка.Акты.Количество() <> 0 Тогда
					ПредставлениеАктов = Новый Массив;
					Для Каждого ТекущийАкт Из ТекущаяОтметка.Акты Цикл
						ПредставлениеАктов.Добавить(ПредставлениеАктаПеревозчика(ТекущийАкт));
					КонецЦикла;
					
					ТекстОтметки = ТекстОтметки
						+ " (акты: "
						+ КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(ПредставлениеАктов, "; ")
						+ ")";
				КонецЕсли;
				
				// Штрафы
				Если ТекущаяОтметка.Штрафы.Количество() <> 0 Тогда
					ПредставлениеШтрафов = Новый Массив;
					Для Каждого ТекущийШтраф Из ТекущаяОтметка.Штрафы Цикл
						ПредставлениеШтрафов.Добавить(ПредставлениеШтрафаПеревозчика(ТекущийШтраф));
					КонецЦикла;
					
					ТекстОтметки = ТекстОтметки
						+ " (штрафы: "
						+ КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(ПредставлениеШтрафов, "; ")
						+ ")";
				КонецЕсли;
				
				СтроковыеЗамечания.Добавить(ТекстОтметки);
				ПерваяСтрока = Ложь;
			КонецЦикла;
		КонецЕсли;
		
		ИмяПоля = ОтветственноеЛицо + " оставил замечания";
		ЗначениеПоля = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(СтроковыеЗамечания, ", ");
		
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиЗамечания, ИмяПоля, ЗначениеПоля));
	КонецЕсли;
	
	//
	
	// Даты и время
	// Прибытие
	Если ЗначениеЗаполнено(Замечания.ЗамДатВрПриб) Тогда
		Если ЭтоПогрузка Тогда
			ДатаПлан = ДанныеДляСообщений.ПогрузкаДатаВремяПрибытия;
		Иначе
			ДатаПлан = ДанныеДляСообщений.ВыгрузкаДатаВремяПрибытия;
		КонецЕсли;
		ДатаФакт = Замечания.ЗамДатВрПриб;
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДатыОдногоДня(ДатаПлан, ДатаФакт) Тогда
			ФорматДаты = "ДФ=HH:mm";
		Иначе
			ФорматДаты = "ДЛФ=DT";
		КонецЕсли;
		
		ИмяПоля = ОтветственноеЛицо + " не согласен с временем прибытия";
		ЗначениеПоля = "заявляет " + Формат(ДатаФакт, ФорматДаты)
			+ " вместо " + Формат(ДатаПлан, ФорматДаты);
		
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиЗамечания, ИмяПоля, ЗначениеПоля));
	КонецЕсли;
	
	// Постановка на погрузку/выгрузку
	Если ЗначениеЗаполнено(Замечания.ЗамДатВрПосПрием)
		Или ЗначениеЗаполнено(Замечания.ЗамДатВрПосВыгр) Тогда
		
		Если ЭтоПогрузка Тогда
			ДатаПлан = ДанныеДляСообщений.ПогрузкаДатаВремяПрибытия;
			ДатаФакт = Замечания.ЗамДатВрПосПрием;
			ПредставлениеСтороны = "грузоотправителя";
		Иначе
			ДатаПлан = ДанныеДляСообщений.ВыгрузкаДатаВремяПрибытия;
			ДатаФакт = Замечания.ЗамДатВрПосВыгр;
			ПредставлениеСтороны = "грузополучателя";
		КонецЕсли;
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДатыОдногоДня(ДатаПлан, ДатаФакт) Тогда
			ФорматДаты = "ДФ=HH:mm";
		Иначе
			ФорматДаты = "ДЛФ=DT";
		КонецЕсли;
		
		ИмяПоля = ОтветственноеЛицо + " указал время постановки на " + ?(ЭтоПогрузка, "погрузку", "выгрузку");
		ЗначениеПоля = "заявляет " + Формат(ДатаФакт, ФорматДаты)
			+ " (по данным " + ПредставлениеСтороны + " " + Формат(ДатаПлан, ФорматДаты) + ")";
		
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиЗамечания, ИмяПоля, ЗначениеПоля));
	КонецЕсли;
	
	// Убытие
	Если ЗначениеЗаполнено(Замечания.ЗамДатВрУбыт) Тогда
		Если ЭтоПогрузка Тогда
			ДатаПлан = ДанныеДляСообщений.ПогрузкаДатаВремяУбытия;
		Иначе
			ДатаПлан = ДанныеДляСообщений.ВыгрузкаДатаВремяУбытия;
		КонецЕсли;
		ДатаФакт = Замечания.ЗамДатВрУбыт;
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДатыОдногоДня(ДатаПлан, ДатаФакт) Тогда
			ФорматДаты = "ДФ=HH:mm";
		Иначе
			ФорматДаты = "ДЛФ=DT";
		КонецЕсли;
		
		ИмяПоля = ОтветственноеЛицо + " не согласен с временем убытия";
		ЗначениеПоля = "заявляет " + Формат(ДатаФакт, ФорматДаты)
			+ " вместо " + Формат(ДатаПлан, ФорматДаты);
		
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиЗамечания, ИмяПоля, ЗначениеПоля));
	КонецЕсли;
	
	Если ФорматHTML Тогда
		Строки.Добавить("</tbody></table>");
	КонецЕсли;
	
	//
	
	// Водитель
	Строки.Добавить(?(ФорматHTML, "<br><br>", Символы.ПС) + "Водитель");
	Строки.Добавить(Строка(ДанныеДляСообщений.Сотрудник1) + " " + СтрЗаменить(ДанныеДляСообщений.Телефон1, " ", ""));
	Если ЗначениеЗаполнено(ДанныеДляСообщений.Сотрудник2) Тогда
		Строки.Добавить(Строка(ДанныеДляСообщений.Сотрудник2) + " " + СтрЗаменить(ДанныеДляСообщений.Телефон2, " ", ""));
	КонецЕсли;
	
	//
	
	// Сведения о накладной
	ТекстЗаголовкаДокумента = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_("%1: ЭТрН №%2 от %3",
		?(ЭтоПогрузка, "Погрузка", "Разгрузка"),
		СокрЛП(ДанныеДляСообщений.НомерДокумента),
		Формат(ДанныеДляСообщений.ДатаДокумента, "ДЛФ=D;"));
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
		?(ФорматHTML, "<br><br>", Символы.ПС) + ТекстЗаголовкаДокумента));
	
	// Место погрузки
	Если ЭтоПогрузка Тогда
		
		ПредставлениеГрузоотправитель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодробноеПредставлениеОрганизацииДиадок(
			ДанныеДляСообщений.ДокументГрузоотправитель);
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Грузоотправитель: " + ПредставлениеГрузоотправитель));
		
		ПредставлениеПеревозчик = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодробноеПредставлениеОрганизацииДиадок(
			ДанныеДляСообщений.ДокументПеревозчик);
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Перевозчик: " + ПредставлениеПеревозчик));
		
		Если ЗначениеЗаполнено(ДанныеДляСообщений.GLNПогрузки) Тогда
			Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
				"GLN: " + Строка(ДанныеДляСообщений.GLNПогрузки)));
		КонецЕсли;
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Адрес: " + ДанныеДляСообщений.АдресОткуда));
	Иначе
		ПредставлениеГрузополучатель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодробноеПредставлениеОрганизацииДиадок(
			ДанныеДляСообщений.ДокументГрузополучатель);
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Грузополучатель: " + ПредставлениеГрузополучатель));
		
		ПредставлениеПеревозчик = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодробноеПредставлениеОрганизацииДиадок(
			ДанныеДляСообщений.ДокументПеревозчик);
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Перевозчик: " + ПредставлениеПеревозчик));
		
		Если ЗначениеЗаполнено(ДанныеДляСообщений.GLNДоставки) Тогда
			Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
				"GLN: " + Строка(ДанныеДляСообщений.GLNДоставки)));
		КонецЕсли;
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Адрес: " + ДанныеДляСообщений.АдресКуда));
	КонецЕсли;
	
	// Автомобиль
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
		"Автомобиль: " + ВРег(ДанныеДляСообщений.ГосНомерАвто) + ?(ЗначениеЗаполнено(ДанныеДляСообщений.МаркаАвто), " " + ДанныеДляСообщений.МаркаАвто, "")));
	
	// Прицепы
	Если ЗначениеЗаполнено(ДанныеДляСообщений.Прицеп) Тогда
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Прицеп: " + ВРег(ДанныеДляСообщений.ГосНомерПрицеп)));
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеДляСообщений.Прицеп2) Тогда
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Прицеп 2: " + ВРег(ДанныеДляСообщений.ГосНомерПрицеп2)));
	КонецЕсли;
	// Конец - Сведения о накладной
	
	ТекстСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(Строки, Символы.ПС);
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ПредставлениеАктаПеревозчика(АктПеревозчика)
	
	ЧастиАкта = Новый Массив;
	Если ЗначениеЗаполнено(АктПеревозчика.АктНомер) Тогда
		ЧастиАкта.Добавить("номер - " + Строка(АктПеревозчика.АктНомер));
	КонецЕсли;
	Если ЗначениеЗаполнено(АктПеревозчика.АктДата) Тогда
		ЧастиАкта.Добавить("дата - " + Строка(АктПеревозчика.АктДата));
	КонецЕсли;
	Если ЗначениеЗаполнено(АктПеревозчика.АктНаименование) Тогда
		ЧастиАкта.Добавить("наименование - " + Строка(АктПеревозчика.АктНаименование));
	КонецЕсли;
	Если ЗначениеЗаполнено(АктПеревозчика.АктИдДок) Тогда
		ЧастиАкта.Добавить("ид. файла - " + Строка(АктПеревозчика.АктИдДок));
	КонецЕсли;
	Если ЗначениеЗаполнено(АктПеревозчика.АктДопСведДок) Тогда
		ЧастиАкта.Добавить("доп. сведения - " + Строка(АктПеревозчика.АктДопСведДок));
	КонецЕсли;
	Если ЗначениеЗаполнено(АктПеревозчика.СтороныСоставители) Тогда
		ЧастиАкта.Добавить("состовители - " + Строка(АктПеревозчика.СтороныСоставители));
	КонецЕсли;
	Если ЗначениеЗаполнено(АктПеревозчика.ДополнительныйСоставитель) Тогда
		ЧастиАкта.Добавить("доп. составители - " + Строка(АктПеревозчика.ДополнительныйСоставитель));
	КонецЕсли;
	
	ПредставлениеАкта = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(ЧастиАкта, ", ");
	
	Возврат ПредставлениеАкта;
	
КонецФункции

Функция ПредставлениеШтрафаПеревозчика(ШтрафПеревозчика)
	
	ЧастиШтрафа = Новый Массив;
	Если ЗначениеЗаполнено(ШтрафПеревозчика.ИтогРазмШтрРФ) Тогда
		ЧастиШтрафа.Добавить("размер - " + Строка(ШтрафПеревозчика.ИтогРазмШтрРФ));
	КонецЕсли;
	Если ЗначениеЗаполнено(ШтрафПеревозчика.ФактКолЕдИзм) Тогда
		ЧастиШтрафа.Добавить("ед.изм. - " + Строка(ШтрафПеревозчика.ФактКолЕдИзм));
	КонецЕсли;
	Если ЗначениеЗаполнено(ШтрафПеревозчика.РасчШтр) Тогда
		ЧастиШтрафа.Добавить("расчет - " + Строка(ШтрафПеревозчика.РасчШтр));
	КонецЕсли;
	
	ПредставлениеШтрафа = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(ЧастиШтрафа, ", ");
	
	Возврат ПредставлениеШтрафа;
	
КонецФункции

Функция ТекстПисьмаСЗамечаниями()
	
	Возврат
	"<!DOCTYPE html PUBLIC ""-//W3C//DTD HTML 4.0 Transitional//EN"">
	|<html>
	|<head content=""text/html"" http-equiv=""Content-Type"" charset="""">
	|<meta name=""format-detection""></meta>
	|<style type=""text/css"">
	| body {margin: 0; padding: 1px;}
	| p {line-height: 1.15; margin: 0; white-space: pre-wrap;}
	| p.gray {color: gray}
	| ol,ul {margin-top: 0; margin-bottom: 0;}
	| img {border: none;}
	| .css-body {font-family: ""Lab Grotesque"",-apple-system,system-ui,BlinkMacSystemFont,""Segoe UI"",""FSegoeUI"",Roboto,rouble,""Helvetica Neue"",Ubuntu,Arial,Tahoma,sans-serif;}
	| table {background-color: transparent}
	| th {text-align: left}
	| .table {max-width: 100%;}
	| .table>thead>tr>th,.table>tbody>tr>th,.table>tfoot>tr>th,.table>thead>tr>td,.table>tbody>tr>td,.table>tfoot>tr>td {padding: 1px;line-height: 1.42857143;vertical-align: top;border-top: 1px solid #ddd}
	|</style>
	|</head>
	|<body class=""css-body"">
	|	%1
	|	<br><div class=""css-line""></div>
	|	<p class=""gray"">Письмо сформировано автоматически, отвечать на него не нужно.</p>
	|</body></html>";
	
КонецФункции

Функция ТекстСообщенияОНеобходимостиПодписатьВодителем(ДанныеДляСообщений, ЭтоПогрузка, ФорматHTML)
	
	// Текст сообщения
	Если ФорматHTML Тогда
		ШаблонСтрокиДанных = "<tr><th>%1</th><td>%2</td></tr>";
	Иначе
		ШаблонСтрокиДанных = "%1: %2";
	КонецЕсли;
	
	Строки = Новый Массив;
	
	// Ссылка для подписания
	ШаблонСтрокиСсылки = "<a href=""%1"">%2</a>";
	Если ЭтоПогрузка Тогда
		ТекстПредставлениеСсылки = "СОГЛАСОВАТЬ ПОГРУЗКУ";
	Иначе
		ТекстПредставлениеСсылки = "СОГЛАСОВАТЬ РАЗГРУЗКУ";
	КонецЕсли;
	ТекстСсылки = "https://driver.kontur.ru/transportations/" + ?(ЭтоПогрузка, "reception", "delivery")
		+ "/view_trn/" + Строка(ДанныеДляСообщений.kl_id);
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиСсылки,
		ТекстСсылки, ТекстПредставлениеСсылки));
	
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_("<b>№%1 от %2</b>",
		СокрЛП(ДанныеДляСообщений.НомерДокумента),
		Формат(ДанныеДляСообщений.ДатаДокумента, "ДЛФ=D;")) + ?(ФорматHTML, "<br><br>", Символы.ПС));
	
	//
	
	// Данные ЭТРН
	Если ФорматHTML Тогда
		Строки.Добавить("<table class=""table table-condensed"">");
		Строки.Добавить("<tbody>");
	КонецЕсли;
	
	// Откуда / куда
	Если ФорматHTML Тогда
		Если ЭтоПогрузка Тогда
			Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДанных,
				"Адрес", ДанныеДляСообщений.АдресОткуда));
		Иначе
			Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДанных,
				"Адрес", ДанныеДляСообщений.АдресКуда));
		КонецЕсли;
	Иначе
		Если ЭтоПогрузка Тогда
			Строки.Добавить(ДанныеДляСообщений.АдресОткуда);
		Иначе
			Строки.Добавить(ДанныеДляСообщений.АдресКуда);
		КонецЕсли;
	КонецЕсли;
	
	// Прибыл
	Если ЭтоПогрузка Тогда
		ДатаВремяПрибытия = ДанныеДляСообщений.ПогрузкаДатаВремяПрибытия;
	Иначе
		ДатаВремяПрибытия = ДанныеДляСообщений.ВыгрузкаДатаВремяПрибытия;
	КонецЕсли;
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДанных,
		"Прибыл", ДатаВремяПрибытия));
	
	// Госномер
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДанных,
		"Госномер", ДанныеДляСообщений.ГосНомерАвто));
	
	Если ФорматHTML Тогда
		Строки.Добавить("</tbody></table>");
	КонецЕсли;
	
	ТекстСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(Строки, Символы.ПС);
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ДокументОснования(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН КАК ДокументОснования
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул1.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул2.ДокументЭТРН КАК ДокументОснования
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул2 КАК КонтурЛогистика_ТрН_Титул2
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул2.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул7.ДокументЭТРН
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул7 КАК КонтурЛогистика_ТрН_Титул7
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул7.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул8.ДокументЭТРН
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул8 КАК КонтурЛогистика_ТрН_Титул8
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул8.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул2.Титул1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул2 КАК КонтурЛогистика_ПЛ_Титул2
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул2.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул3.Титул1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул3 КАК КонтурЛогистика_ПЛ_Титул3
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул3.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул4.Титул1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул4 КАК КонтурЛогистика_ПЛ_Титул4
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул4.Ссылка = &ДокументСсылка	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул2.Титул1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул2_5_02 КАК КонтурЛогистика_ПЛ_Титул2
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул2.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул3.Титул1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул3_5_02 КАК КонтурЛогистика_ПЛ_Титул3
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул3.Ссылка = &ДокументСсылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокументОснования;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДополнитьПараметрыОтправкиТитул7(ПараметрыОтправки, Титул)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Титул", Титул);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул3.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ТрН_Титул3.Дата КАК Дата,
	|	ЕСТЬNULL(КонтурЛогистика_ТрН_Титул3.КоличествоМестПринято, 0) КАК КоличествоМестПринято,
	|	ЕСТЬNULL(КонтурЛогистика_ТрН_Титул1.КоличествоМест, 0) КАК КоличествоМест,
	|	ЕСТЬNULL(КонтурЛогистика_ТрН_Титул3.МассаБруттоКг, 0) КАК МассаБруттоКгПринято,
	|	ЕСТЬNULL(КонтурЛогистика_ТрН_Титул1.МассаБруттоКг, 0) КАК МассаБруттоКг
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул7 КАК КонтурЛогистика_ТрН_Титул7
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул3 КАК КонтурЛогистика_ТрН_Титул3
	|		ПО КонтурЛогистика_ТрН_Титул7.ДокументЭТРН = КонтурЛогистика_ТрН_Титул3.ДокументЭТРН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
	|		ПО КонтурЛогистика_ТрН_Титул7.ДокументЭТРН = КонтурЛогистика_ТрН_Титул1.ДокументЭТРН
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул7.Ссылка = &Титул
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПараметрыОтправки.КоличествоМест = Выборка.КоличествоМест - Выборка.КоличествоМестПринято;
		ПараметрыОтправки.ОбщаяМасса = Выборка.МассаБруттоКг - Выборка.МассаБруттоКгПринято;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьПараметрыОтправкиТитул8(ПараметрыОтправки, Титул)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Титул", Титул);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул8НовыеВодители.Водитель КАК Водитель,
	|	КонтурЛогистика_ТрН_Титул8НовыеВодители.Водитель.АдресЭлектроннойПочты КАК ВодительАдресЭлектроннойПочты,
	|	КонтурЛогистика_ТрН_Титул8НовыеВодители.Водитель.ТелефонОсновной КАК ВодительТелефонОсновной
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул8.НовыеВодители КАК КонтурЛогистика_ТрН_Титул8НовыеВодители
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул8НовыеВодители.Ссылка = &Титул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул8НовыеТранспортныеСредства.ТранспортноеСредство КАК ТранспортноеСредство,
	|	КонтурЛогистика_ТрН_Титул8НовыеТранспортныеСредства.ТранспортноеСредство.РегНомер КАК ГосНомерАвто
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул8.НовыеТранспортныеСредства КАК КонтурЛогистика_ТрН_Титул8НовыеТранспортныеСредства
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул8НовыеТранспортныеСредства.Ссылка = &Титул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул8НовыеПрицепы.Прицеп КАК Прицеп
	|ИЗ
	|	Документ.КонтурЛогистика_ТрН_Титул8.НовыеПрицепы КАК КонтурЛогистика_ТрН_Титул8НовыеПрицепы
	|ГДЕ
	|	КонтурЛогистика_ТрН_Титул8НовыеПрицепы.Ссылка = &Титул";
	
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаВодители = Результат[0].Выбрать();
	ВыборкаТС = Результат[1].Выбрать();
	ВыборкаПрицеп = Результат[2].Выбрать();
	
	Счет = 0;
	Пока ВыборкаВодители.Следующий() Цикл
		Если Счет = 0 Тогда
			ПараметрыОтправки.Сотрудник1 = ВыборкаВодители.Водитель;
			ПараметрыОтправки.АдресПочтыСотрудника1 = ВыборкаВодители.ВодительАдресЭлектроннойПочты;
			ПараметрыОтправки.Телефон1 = ВыборкаВодители.ВодительТелефонОсновной;
			
			// Очищаем предыдущиего, так происходит замена
			ПараметрыОтправки.Сотрудник2 = Неопределено;
			ПараметрыОтправки.АдресПочтыСотрудника2 = "";
			ПараметрыОтправки.Телефон2 = "";
		ИначеЕсли Счет = 1 Тогда
			ПараметрыОтправки.Сотрудник2 = ВыборкаВодители.Водитель;
			ПараметрыОтправки.АдресПочтыСотрудника2 = ВыборкаВодители.ВодительАдресЭлектроннойПочты;
			ПараметрыОтправки.Телефон2 = ВыборкаВодители.ВодительТелефонОсновной;
		КонецЕсли;
		Счет = Счет + 1;
	КонецЦикла;
	
	Пока ВыборкаТС.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыОтправки, ВыборкаТС);
	КонецЦикла;
	
	Пока ВыборкаПрицеп.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыОтправки, ВыборкаПрицеп);
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстСообщенияОтказа(ДанныеДляСообщений, ТекстЗаголовка, ЭтоПогрузка, ПричинаОтказа, СостояниеГруза, ФорматHTML)
	
	Если ФорматHTML Тогда
		ШаблонСтроки = "<tr><th>%1</th><td>%2</td></tr>";
		ШаблонСтрокиДопИнформации = "<p>%1</p>";
	Иначе
		ШаблонСтроки = "<b><u>%1:</u></b> %2";
		ШаблонСтрокиДопИнформации = "<i>%1</i>";
	КонецЕсли;
	
	Строки = Новый Массив;
	
	// Заголовок
	Если Не ФорматHTML Тогда
		Строки.Добавить(ТекстЗаголовка + Символы.ПС);
	КонецЕсли;
	
	//
	
	Если ФорматHTML Тогда
		Строки.Добавить("<table class=""table table-condensed"">");
		Строки.Добавить("<tbody>");
	КонецЕсли;
	
	// Причина отказа
	Если ЗначениеЗаполнено(ПричинаОтказа) Тогда
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			ШаблонСтроки, "Причина отказа", ПричинаОтказа));
	КонецЕсли;
	
	// Состояние груза
	Если ЗначениеЗаполнено(СостояниеГруза) Тогда
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
			ШаблонСтроки, "Состояние груза", СостояниеГруза));
	КонецЕсли;
	
	Если ФорматHTML Тогда
		Строки.Добавить("</tbody></table>");
	КонецЕсли;
	
	//
	
	// Водитель
	Строки.Добавить(?(ФорматHTML, "<br><br>", Символы.ПС) + "Водитель");
	Строки.Добавить(Строка(ДанныеДляСообщений.Сотрудник1) + " " + СтрЗаменить(ДанныеДляСообщений.Телефон1, " ", ""));
	Если ЗначениеЗаполнено(ДанныеДляСообщений.Сотрудник2) Тогда
		Строки.Добавить(Строка(ДанныеДляСообщений.Сотрудник2) + " " + СтрЗаменить(ДанныеДляСообщений.Телефон2, " ", ""));
	КонецЕсли;
	
	//
	
	// Сведения о накладной
	ТекстЗаголовкаДокумента = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_("%1: ЭТрН №%2 от %3",
		?(ЭтоПогрузка, "Погрузка", "Разгрузка"),
		СокрЛП(ДанныеДляСообщений.НомерДокумента),
		Формат(ДанныеДляСообщений.ДатаДокумента, "ДЛФ=D;"));
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
		?(ФорматHTML, "<br><br>", Символы.ПС) + ТекстЗаголовкаДокумента));
	
	// Место погрузки
	Если ЭтоПогрузка Тогда
		
		ПредставлениеГрузоотправитель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодробноеПредставлениеОрганизацииДиадок(
			ДанныеДляСообщений.ДокументГрузоотправитель);
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Грузоотправитель: " + ПредставлениеГрузоотправитель));
		
		ПредставлениеПеревозчик = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодробноеПредставлениеОрганизацииДиадок(
			ДанныеДляСообщений.ДокументПеревозчик);
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Перевозчик: " + ПредставлениеПеревозчик));
		
		Если ЗначениеЗаполнено(ДанныеДляСообщений.GLNПогрузки) Тогда
			Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
				"GLN: " + Строка(ДанныеДляСообщений.GLNПогрузки)));
		КонецЕсли;
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Адрес: " + ДанныеДляСообщений.АдресОткуда));
	Иначе
		ПредставлениеГрузополучатель = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодробноеПредставлениеОрганизацииДиадок(
			ДанныеДляСообщений.ДокументГрузополучатель);
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Грузополучатель: " + ПредставлениеГрузополучатель));
		
		ПредставлениеПеревозчик = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодробноеПредставлениеОрганизацииДиадок(
			ДанныеДляСообщений.ДокументПеревозчик);
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Перевозчик: " + ПредставлениеПеревозчик));
		
		Если ЗначениеЗаполнено(ДанныеДляСообщений.GLNДоставки) Тогда
			Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
				"GLN: " + Строка(ДанныеДляСообщений.GLNДоставки)));
		КонецЕсли;
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Адрес: " + ДанныеДляСообщений.АдресКуда));
	КонецЕсли;
	
	// Автомобиль
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
		"Автомобиль: " + ВРег(ДанныеДляСообщений.ГосНомерАвто) + ?(ЗначениеЗаполнено(ДанныеДляСообщений.МаркаАвто), " " + ДанныеДляСообщений.МаркаАвто, "")));
	
	// Прицепы
	Если ЗначениеЗаполнено(ДанныеДляСообщений.Прицеп) Тогда
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Прицеп: " + ВРег(ДанныеДляСообщений.ГосНомерПрицеп)));
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеДляСообщений.Прицеп2) Тогда
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
			"Прицеп 2: " + ВРег(ДанныеДляСообщений.ГосНомерПрицеп2)));
	КонецЕсли;
	// Конец - Сведения о накладной
	
	ТекстСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(Строки, Символы.ПС);
	
	Возврат ТекстСообщения;
	
КонецФункции

#КонецОбласти