#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Списки) Экспорт
	
	УправлениеДоступомИСПереопределяемый.ПриЗаполненииОграниченияДоступа(
		Метаданные.РегистрыСведений.ОчередьСообщенийЗЕРНО, Списки);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

Процедура ПриОпределенииКомандПодключенныхКОбъекту(Команды) Экспорт
	Возврат;
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// Параметры:
//   МассивОбъектов        - Массив из Произвольный         - ссылки на объекты, которые нужно распечатать
//   ПараметрыПечати       - Структура                      - дополнительные настройки печати
//   КоллекцияПечатныхФорм - ТаблицаЗначений                - сформированные табличные документы (выходной параметр)
//   ОбъектыПечати         - СписокЗначений из Произвольный - имя области, в которой был выведен объект (выходной параметр)
//   ПараметрыВывода       - Структура                      - дополнительные параметры сформированных табличных документов (выходной параметр)
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Возврат;
	
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	ОбновлениеИнформационнойБазыГосИС.ДобавитьОбработчикОбновленияПереходаНаКонструкторНастроек(
		Обработчики,
		Метаданные.РегистрыСведений.ОчередьСообщенийЗЕРНО,
		Новый УникальныйИдентификатор("f0e4c6e4-5bbd-40a3-95f0-5eea90a00dbb"));
	
КонецПроцедуры

// Регистрирует данные для обработчика обновления перехода на конструктор настроек
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.РегистрыСведений.ОчередьСообщенийЗЕРНО;
	ОбновлениеИнформационнойБазыЗЕРНО.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюКонструктораНастроекРегистрСведений(
		ОбъектМетаданных, Параметры);
	
КонецПроцедуры

// Обработка данных перехода на конструктор настроек видов продукции
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.РегистрыСведений.ОчередьСообщенийЗЕРНО;
	ОбновлениеИнформационнойБазыЗЕРНО.ОбработатьДанныеДляПереходаНаНовуюВерсиюКонструктораНастроекРегистраСведений(
		ОбъектМетаданных, Параметры);
	
КонецПроцедуры

// Дополнительная обработка данных при переходе на конструктор настроек.
// 
// Параметры:
//  НаборЗаписей - см. РегистрНакопленияНаборЗаписей.ОчередьСообщенийЗЕРНО
//  ПроблемыСДанными - Соответствие из КлючИЗначение
//  КешКонвертаций - см. ОбновлениеИнформационнойБазыГосИС.КешКонвертацийВидаПродукции
//  ЕстьИзменения - Булево
Процедура ДополнительнаяОбработкаДанныхПриПереходеНаКонструкторНастроек(НаборЗаписей, ПроблемыСДанными, КешКонвертаций, ЕстьИзменения) Экспорт
	
	Для Каждого СтрокаНабора Из НаборЗаписей Цикл
		
		РеквизитыИсходящегоСообщения = СтрокаНабора.РеквизитыИсходящегоСообщения.Получить();
		Если РеквизитыИсходящегоСообщения = Неопределено
			Или Не ЗначениеЗаполнено(РеквизитыИсходящегоСообщения.ВидПродукции) Тогда
			Продолжить;
		КонецЕсли;
		
		РеквизитыИсходящегоСообщения.Вставить(
			"РазделУчета",
			ОбновлениеИнформационнойБазыЗЕРНО.РазделУчетаПоВидуПродукции(РеквизитыИсходящегоСообщения.ВидПродукции));
		
		Если ТипЗнч(РеквизитыИсходящегоСообщения.ПараметрыЗапроса) = Тип("Структура")
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РеквизитыИсходящегоСообщения.ПараметрыЗапроса, "ВидПродукции")
			И Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РеквизитыИсходящегоСообщения.ПараметрыЗапроса, "РазделУчета") Тогда
			РеквизитыИсходящегоСообщения.ПараметрыЗапроса.Вставить(
				"РазделУчета",
				ОбновлениеИнформационнойБазыЗЕРНО.РазделУчетаПоВидуПродукции(РеквизитыИсходящегоСообщения.ПараметрыЗапроса.ВидПродукции));
		КонецЕсли;
		
		СтрокаНабора.РеквизитыИсходящегоСообщения = Новый ХранилищеЗначения(РеквизитыИсходящегоСообщения);
		
		ЕстьИзменения = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Очередь сообщений по документу.
// Параметры:
//  Документ - ОпределяемыйТип.ДокументыЗЕРНО - ссылка на документ.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Описание:
//   * Сообщение - ОпределяемыйТип.УникальныйИдентификаторИС - идентификатор сообщения.
//   * Операция - ПеречислениеСсылка.ВидыОперацийЗЕРНО - операция.
//   * Организация - ОпределяемыйТип.Организация - организация.
//
Функция ОчередьСообщенийПоДокументу(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОчередьСообщенийИСМП.Сообщение          КАК Сообщение,
	|	ОчередьСообщенийИСМП.Операция           КАК Операция,
	|	ОчередьСообщенийИСМП.Организация        КАК Организация,
	|	ОчередьСообщенийИСМП.Подразделение      КАК Подразделение,
	|	ОчередьСообщенийИСМП.СообщениеОснование КАК СообщениеОснование
	|ИЗ
	|	РегистрСведений.ОчередьСообщенийЗЕРНО КАК ОчередьСообщенийИСМП
	|ГДЕ
	|	ОчередьСообщенийИСМП.СсылкаНаОбъект = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
