
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборРоль = "Все";
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере_ФормаСписка(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ДоступенСервисФизЛиц = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ДоступенСервисФизЛиц();
	Элементы.ФормаОткрытьГрупповоеДобавлениеСотрудниковВОрганизацию.Видимость = ДоступенСервисФизЛиц;
	Элементы.ФормаИнструкцияДобавитьСотрудникаВСервис.Видимость = ДоступенСервисФизЛиц;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборДинСписка();
	
	ОбновитьВидимостьДоступность();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборРольПриИзменении(Элемент)
	
	УстановитьОтборДинСписка();
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	
	Элементы.ГруппаВУВодителя.Видимость = (ОтборРоль = "Водители");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинСписка()

	Список.Отбор.Элементы.Очистить();
	
	Если  ОтборРоль = "Водители" 
		ИЛИ ОтборРоль = "Кладовщики" 
		ИЛИ ОтборРоль = "Механики" 
		ИЛИ ОтборРоль = "Медики" Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Истина;
		
		Если ОтборРоль = "Водители" Тогда
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РольВодитель");
		ИначеЕсли ОтборРоль = "Медики" Тогда
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РольМедик");
		ИначеЕсли ОтборРоль = "Механики" Тогда
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РольМеханик");
		Иначе
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РольКладовщик");
		КонецЕсли;
		ЭлементОтбора.ПравоеЗначение = Истина;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГрупповоеДобавлениеСотрудниковВОрганизацию(Команда)
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		"Групповое добавление сотрудников", "Добавить водителей в организацию",	"Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаСписка");
	
	ОткрытьФорму("РегистрСведений.КонтурЛогистика_СервисФизическихЛиц.Форма.ФормаГрупповоеДобавлениеСотрудниковВОрганизацию");
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструкцияДобавитьСотрудникаВСервис(Команда)
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Открытие инструкции", "Нажать на гиперссылку", 
		"РегистрСведений.КонтурЛогистика_СервисФизическихЛиц.Форма.ФормаГрупповоеДобавлениеСотрудниковВОрганизацию", 
		"Общая инструкция по добавлению сотрудников");
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		ЗапуститьПриложение("https://support.kontur.ru/logistika-1s/56876-rabota_s_sotrudnikami");
	Иначе
		ПерейтиПоНавигационнойСсылке("https://support.kontur.ru/logistika-1s/56876-rabota_s_sotrudnikami");
	КонецЕсли;
	
КонецПроцедуры
