
////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedLocalVariable-off
// Булево - Истина, если это внешняя обработка
Перем __ЭтоВнешняяОбработка;

// Служебные АПИ
Перем __СтдСтр;
// BSLLS:UnusedLocalVariable-on
// BSLLS:MissingVariablesDescription-on

#Область ПрограммныйИнтерфейс

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off

// Создает временную таблицу с предложениями для отправки.
//  Запрос должен содержать следующие временные таблицы:
//  * ВТ_ПартнерскиеОтношения - содержит колонки:
//  ** Контрагент1С - СправочникСсылка - Сущность, сопоставленная с ящиком получателя Диадока
//  * ВТ_Отправители - содержит колонки:
//  ** Организация1С - СправочникСсылка - Сущность, сопоставленная с ящиком отправителя Диадока
//  ** ВидПакета - Строка - Идентификатор вида пакета
//  * ВТ_НастройкиОрганизаций - содержит колонки:
//  ** Организация1С - СправочникСсылка - Сущность, сопоставленная с ящиком Диадока (например, "Организации")
//
// Параметры:
//  ВидПакетаID - Строка - идентификатор вида пакета
//  Запрос - Запрос - инициализированный запрос (с параметрами и менеджером временных таблиц)
// 
// Возвращаемое значение:
//  Массив - из Строка - имена добавленных временных таблиц
//
Функция СлужебныйПодготовитьДанныеДляОтправки(ВидПакетаID, Запрос) Экспорт
	
	Результат = Новый Массив;
	
	Если ЭтоВидПакетаУПД(ВидПакетаID) Тогда
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.СчетФактураВыданный) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_СчетФактура_НаРеализацию(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.ОтчетКомиссионераОПродажах) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_СчетаФактурыПоОтчетуКомиссионера_НаРеализацию(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
	ИначеЕсли ЭтоВидПакетаУКД(ВидПакетаID) Тогда
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.СчетФактураВыданный) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_СчетФактура_Корректировочный(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.ОтчетКомиссионераОПродажах) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_СчетаФактурыПоОтчетуКомиссионера_Корректировочный(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
	ИначеЕсли ЭтоВидПакетаНаАванс(ВидПакетаID) Тогда
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.СчетФактураВыданный) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_СчетФактура_НаАванс(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
		Если ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАвансКомитента") <> Неопределено Тогда
			
			Если РазрешеноЧтениеТаблицы(Метаданные.Документы.СчетФактураВыданный) Тогда
				ИмяВТ = ДобавитьТаблицуЧерновиков_СчетФактура_НаАвансКомитента(Запрос, ВидПакетаID);
				Результат.Добавить(ИмяВТ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.ОтчетКомиссионераОПродажах) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_СчетаФактурыПоОтчетуКомиссионера_НаАванс(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
	ИначеЕсли ЭтоВидПакетаИУПД(ВидПакетаID) Тогда
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.СчетФактураВыданный) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_СчетФактура_НаРеализацию(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
	ИначеЕсли ЭтоВидПакетаИУКД(ВидПакетаID) Тогда
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.СчетФактураВыданный) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_СчетФактура_Корректировочный(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
	ИначеЕсли ЭтоВидПакетаИсправительныйНаАванс(ВидПакетаID) Тогда
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.СчетФактураВыданный) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_СчетФактура_НаАванс(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
	ИначеЕсли ЭтоВидПакетаКорректировочныйНаАванс(ВидПакетаID) Тогда
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.СчетФактураВыданный) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_СчетФактура_КорректировочныйНаАванс(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
	ИначеЕсли ЭтоВидПакетаБезНДС(ВидПакетаID) Тогда
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.СчетФактураВыданный) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_ПервичныеДокументыБезНДС(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
	ИначеЕсли ЭтоВидПакетаСчетНаОплату(ВидПакетаID) Тогда
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.СчетНаОплатуПокупателю) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_СчетНаОплатуПокупателю(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
	ИначеЕсли ЭтоВидПакетаАктСверки(ВидПакетаID) Тогда
		
		Если РазрешеноЧтениеТаблицы(Метаданные.Документы.АктСверкиВзаиморасчетов) Тогда
			ИмяВТ = ДобавитьТаблицуЧерновиков_АктСверки(Запрос, ВидПакетаID);
			Результат.Добавить(ИмяВТ);
		КонецЕсли;
		
	Иначе
		
		Возврат Результат;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on

#КонецОбласти

#Область ВидыПакетов

Функция ЭтоВидПакетаУПД(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_ОсновнойПакет");
	ВидыПакетов.Добавить("ID_УПД");
	ВидыПакетов.Добавить("ID_УПД_раздельно");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаУКД(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_УКД");
	ВидыПакетов.Добавить("ID_УКД_раздельно");
	ВидыПакетов.Добавить("ID_КСФ");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаИУПД(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_ИУПД");
	ВидыПакетов.Добавить("ID_ИУПД_раздельно");
	ВидыПакетов.Добавить("ID_ИСФ");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаИУКД(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_ИУКД");
	ВидыПакетов.Добавить("ID_ИУКД_раздельно");
	ВидыПакетов.Добавить("ID_ИКСФ");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаНаАванс(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_УПД_НаАванс");
	ВидыПакетов.Добавить("ID_СФ_НаАванс");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаИсправительныйНаАванс(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_ИУПД_НаАванс");
	ВидыПакетов.Добавить("ID_ИСФ_НаАванс");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаКорректировочныйНаАванс(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_КСФ_НаАванс");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаБезНДС(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_ТОРГ12_Акт_БезНДС");
	ВидыПакетов.Добавить("ID_УПД_БезНДС");
	ВидыПакетов.Добавить("ID_ИУПД_БезНДС");
	ВидыПакетов.Добавить("ID_УКД_БезНДС");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаСчетНаОплату(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_Счет");
	ВидыПакетов.Добавить("ID_СчетФормализованный");
	ВидыПакетов.Добавить("ID_СчетФормализованныйФНС");
	ВидыПакетов.Добавить("ID_СчетОфертаФормализованныйФНС");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоВидПакетаАктСверки(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_АктСверки");
	ВидыПакетов.Добавить("ID_АктСверкиФормализованный");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправительныйВидПакета(ВидПакетаID)
	
	ВидыПакетов = Новый Массив();
	ВидыПакетов.Добавить("ID_ИУПД");
	ВидыПакетов.Добавить("ID_ИУПД_раздельно");
	ВидыПакетов.Добавить("ID_ИСФ");
	ВидыПакетов.Добавить("ID_ИУКД");
	ВидыПакетов.Добавить("ID_ИУКД_раздельно");
	ВидыПакетов.Добавить("ID_ИКСФ");
	ВидыПакетов.Добавить("ID_ИУПД_НаАванс");
	ВидыПакетов.Добавить("ID_ИСФ_НаАванс");
	ВидыПакетов.Добавить("ID_ИУПД_БезНДС");
	
	Результат = ВидыПакетов.Найти(ВидПакетаID) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКорректировкаРеализацииБезНДС(ВидПакета)

	Результат = (ВидПакета = "ID_УКД_БезНДС");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеМетоды

Функция ДобавитьТаблицуЧерновиков_СчетФактура_НаРеализацию(Запрос, ВидПакетаID)
	
	ВидСчетаФактуры = "НаРеализацию";
	ИмяВременнойТаблицы = СтрШаблон("Диадок_СчетФактураЧерновики_%1_%2", ВидСчетаФактуры, ВидПакетаID);
	
	Запрос.Текст = ТекстЗапроса_СчетФактураЧерновики(ИмяВременнойТаблицы, ВидПакетаID, ВидСчетаФактуры);
	Запрос.Выполнить();
	
	Возврат ИмяВременнойТаблицы;
	
КонецФункции

Функция ДобавитьТаблицуЧерновиков_СчетФактура_Корректировочный(Запрос, ВидПакетаID)
	
	ВидСчетаФактуры = "Корректировочный";
	ИмяВременнойТаблицы = СтрШаблон("Диадок_СчетФактураЧерновики_%1_%2", ВидСчетаФактуры, ВидПакетаID);
	
	Запрос.Текст = ТекстЗапроса_СчетФактураЧерновики(ИмяВременнойТаблицы, ВидПакетаID, ВидСчетаФактуры);
	Запрос.Выполнить();
	
	Возврат ИмяВременнойТаблицы;
	
КонецФункции

Функция ДобавитьТаблицуЧерновиков_СчетФактура_НаАванс(Запрос, ВидПакетаID)
	
	ВидСчетаФактуры = "НаАванс";
	ИмяВременнойТаблицы = СтрШаблон("Диадок_СчетФактураЧерновики_%1_%2", ВидСчетаФактуры, ВидПакетаID);
	
	Запрос.Текст = ТекстЗапроса_СчетФактураЧерновики(ИмяВременнойТаблицы, ВидПакетаID, ВидСчетаФактуры);
	Запрос.Выполнить();
	
	Возврат ИмяВременнойТаблицы;
	
КонецФункции

Функция ДобавитьТаблицуЧерновиков_СчетФактура_НаАвансКомитента(Запрос, ВидПакетаID)
	
	ВидСчетаФактуры = "НаАвансКомитента";
	ИмяВременнойТаблицы = СтрШаблон("Диадок_СчетФактураЧерновики_%1_%2", ВидСчетаФактуры, ВидПакетаID);
	
	Запрос.Текст = ТекстЗапроса_СчетФактураЧерновики(ИмяВременнойТаблицы, ВидПакетаID, ВидСчетаФактуры);
	Запрос.Выполнить();
	
	Возврат ИмяВременнойТаблицы;
	
КонецФункции

Функция ДобавитьТаблицуЧерновиков_СчетФактура_КорректировочныйНаАванс(Запрос, ВидПакетаID)
	
	ВидСчетаФактуры = "КорректировочныйНаАванс";
	ИмяВременнойТаблицы = СтрШаблон("Диадок_СчетФактураЧерновики_%1_%2", ВидСчетаФактуры, ВидПакетаID);
	
	Запрос.Текст = ТекстЗапроса_СчетФактураЧерновики(ИмяВременнойТаблицы, ВидПакетаID, ВидСчетаФактуры);
	Запрос.Выполнить();
	
	Возврат ИмяВременнойТаблицы;
	
КонецФункции

Функция ДобавитьТаблицуЧерновиков_СчетаФактурыПоОтчетуКомиссионера_НаРеализацию(Запрос, ВидПакетаID)
	
	ВидСчетаФактуры = "НаРеализацию";
	ИмяВременнойТаблицы = СтрШаблон("Диадок_СчетФактураПоОтчетуКомиссионераЧерновики_%1_%2", ВидСчетаФактуры,
		ВидПакетаID);
	
	Запрос.Текст = ТекстЗапроса_СчетФактураПоОтчетуКомиссионераЧерновики(ИмяВременнойТаблицы, ВидПакетаID,
		ВидСчетаФактуры);
	Запрос.Выполнить();
	
	Возврат ИмяВременнойТаблицы;
	
КонецФункции

Функция ДобавитьТаблицуЧерновиков_СчетаФактурыПоОтчетуКомиссионера_Корректировочный(Запрос, ВидПакетаID)
	
	ВидСчетаФактуры = "Корректировочный";
	ИмяВременнойТаблицы = СтрШаблон("Диадок_СчетФактураПоОтчетуКомиссионераЧерновики_%1_%2", ВидСчетаФактуры,
		ВидПакетаID);
	
	Запрос.Текст = ТекстЗапроса_СчетФактураПоОтчетуКомиссионераЧерновики(ИмяВременнойТаблицы, ВидПакетаID,
		ВидСчетаФактуры);
	Запрос.Выполнить();
	
	Возврат ИмяВременнойТаблицы;
	
КонецФункции

Функция ДобавитьТаблицуЧерновиков_СчетаФактурыПоОтчетуКомиссионера_НаАванс(Запрос, ВидПакетаID)
	
	ВидСчетаФактуры = "НаАванс";
	ИмяВременнойТаблицы = СтрШаблон("Диадок_СчетФактураПоОтчетуКомиссионераЧерновики_%1_%2", ВидСчетаФактуры,
		ВидПакетаID);
	
	Запрос.Текст = ТекстЗапроса_СчетФактураПоОтчетуКомиссионераЧерновики(ИмяВременнойТаблицы, ВидПакетаID,
		ВидСчетаФактуры);
	Запрос.Выполнить();
	
	Возврат ИмяВременнойТаблицы;
	
КонецФункции

Функция ДобавитьТаблицуЧерновиков_СчетНаОплатуПокупателю(Запрос, ВидПакетаID)
	
	ИмяВременнойТаблицы = СтрШаблон("Диадок_СчетНаОплатуПокупателю_%1", ВидПакетаID);
	
	Запрос.Текст = ТекстЗапроса_СчетНаОплатуПокупателюЧерновики(ИмяВременнойТаблицы, ВидПакетаID);
	Запрос.Выполнить();
	
	Возврат ИмяВременнойТаблицы;
	
КонецФункции

Функция ДобавитьТаблицуЧерновиков_АктСверки(Запрос, ВидПакетаID)
	
	ИмяВременнойТаблицы = СтрШаблон("Диадок_АктСверкиЧерновики_%1", ВидПакетаID);
	
	Запрос.Текст = ТекстЗапроса_АктСверкиЧерновики(ИмяВременнойТаблицы, ВидПакетаID);
	Запрос.Выполнить();
	
	Возврат ИмяВременнойТаблицы;
	
КонецФункции

Функция ДобавитьТаблицуЧерновиков_ПервичныеДокументыБезНДС(Запрос, ВидПакетаID)
	
	ИмяВременнойТаблицы = СтрШаблон("Диадок_ДокументыБезНДС_%1", ВидПакетаID);
	
	Запрос.Текст = ТекстЗапроса_ПервичныеДокументыБезНДСЧерновики(ИмяВременнойТаблицы, ВидПакетаID);
	Запрос.Выполнить();
	
	Возврат ИмяВременнойТаблицы;
	
КонецФункции

Функция ТекстЗапроса_СчетФактураЧерновики(ИмяВременнойТаблицы, ВидПакетаID, ВидСчетаФактуры)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Номер КАК НомерДокумента,
	|	Т.Дата КАК ДатаДокумента,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Организация КАК Организация,
	|	Т.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ПОМЕСТИТЬ ИмяВременнойТаблицы
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкиОрганизаций КАК ВТ_Настройки
	|		ПО Т.Организация = ВТ_Настройки.Организация1С
	|			И (ВТ_Настройки.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отправители КАК ВТ_Отправители
	|		ПО Т.Организация = ВТ_Отправители.Организация1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПартнерскиеОтношения КАК ВТ_Получатели
	|		ПО Т.Контрагент = ВТ_Получатели.Контрагент1С
	|ГДЕ
	|	Т.Проведен
	|	И Т.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|	И ВТ_Получатели.Контрагент1С ЕСТЬ NULL
	|	И НЕ ВТ_Отправители.Организация1С ЕСТЬ NULL
	|	И НЕ Т.Исправление
	|	И НЕ Т.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах";
	
	Если ЭтоИсправительныйВидПакета(ВидПакетаID) Тогда
		
		ВидИсправляемогоПакета = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		Если ВидПакетаID = "ID_ИСФ" Тогда
			ВидИсправляемогоПакета = "ID_ОсновнойПакет";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ВТ_Настройки.ВидПакетаID = &ВидПакетаID",
			"ВТ_Настройки.ВидПакетаID = """ + ВидИсправляемогоПакета + """"
		);
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕ Т.Исправление", "Т.Исправление");
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидПакетаID", """" + ВидПакетаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НаРеализацию", ВидСчетаФактуры);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_СчетФактураПоОтчетуКомиссионераЧерновики(ИмяВременнойТаблицы, ВидПакетаID, ВидСчетаФактуры)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Номер КАК НомерДокумента,
	|	Т.Дата КАК ДатаДокумента,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Организация КАК Организация,
	|	Т.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ПОМЕСТИТЬ ИмяВременнойТаблицы
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионера
	|		ПО Т.ДокументОснование = ОтчетКомиссионера.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НастройкиОрганизаций КАК ВТ_Настройки
	|		ПО Т.Организация = ВТ_Настройки.Организация1С
	|			И (ВТ_Настройки.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отправители КАК ВТ_Отправители
	|		ПО Т.Организация = ВТ_Отправители.Организация1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПартнерскиеОтношения КАК ВТ_Получатели
	|		ПО Т.Контрагент = ВТ_Получатели.Контрагент1С
	|ГДЕ
	|	Т.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ Т.СводныйКомиссионный
	|	И НЕ Т.ПометкаУдаления
	|	И Т.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|	И ВТ_Получатели.Контрагент1С ЕСТЬ NULL
	|	И НЕ ВТ_Отправители.Организация1С ЕСТЬ NULL
	|	И НЕ Т.Исправление
	|	И НЕ Т.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах";
	
	Если ЭтоИсправительныйВидПакета(ВидПакетаID) Тогда
		
		ВидИсправляемогоПакета = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		Если ВидПакетаID = "ID_ИСФ" Тогда
			ВидИсправляемогоПакета = "ID_ОсновнойПакет";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ВТ_Настройки.ВидПакетаID = &ВидПакетаID",
			"ВТ_Настройки.ВидПакетаID = """ + ВидИсправляемогоПакета + """"
		);
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕ Т.Исправление", "Т.Исправление");
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидПакетаID", """" + ВидПакетаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НаРеализацию", ВидСчетаФактуры);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_СчетНаОплатуПокупателюЧерновики(ИмяВременнойТаблицы, ВидПакетаID)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Номер КАК НомерДокумента,
	|	Т.Дата КАК ДатаДокумента,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Организация КАК Организация,
	|	Т.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ПОМЕСТИТЬ ИмяВременнойТаблицы
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкиОрганизаций КАК ВТ_Настройки
	|		ПО Т.Организация = ВТ_Настройки.Организация1С
	|			И (ВТ_Настройки.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отправители КАК ВТ_Отправители
	|		ПО Т.Организация = ВТ_Отправители.Организация1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПартнерскиеОтношения КАК ВТ_Получатели
	|		ПО Т.Контрагент = ВТ_Получатели.Контрагент1С
	|ГДЕ
	|	Т.Проведен
	|	И Т.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ Т.ПометкаУдаления
	|	И ВТ_Получатели.Контрагент1С ЕСТЬ NULL
	|	И НЕ ВТ_Отправители.Организация1С ЕСТЬ NULL";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидПакетаID", """" + ВидПакетаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_АктСверкиЧерновики(ИмяВременнойТаблицы, ВидПакетаID)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Номер КАК НомерДокумента,
	|	Т.Дата КАК ДатаДокумента,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Организация КАК Организация,
	|	0 КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ПОМЕСТИТЬ ИмяВременнойТаблицы
	|ИЗ
	|	Документ.АктСверкиВзаиморасчетов КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкиОрганизаций КАК ВТ_Настройки
	|		ПО Т.Организация = ВТ_Настройки.Организация1С
	|			И (ВТ_Настройки.ВидПакетаID = &ВидПакетаID)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отправители КАК ВТ_Отправители
	|		ПО Т.Организация = ВТ_Отправители.Организация1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПартнерскиеОтношения КАК ВТ_Получатели
	|		ПО Т.Контрагент = ВТ_Получатели.Контрагент1С
	|ГДЕ
	|	Т.Проведен
	|	И Т.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ Т.ПометкаУдаления
	|	И ВТ_Получатели.Контрагент1С ЕСТЬ NULL
	|	И НЕ ВТ_Отправители.Организация1С ЕСТЬ NULL
	|	&ЭтоДокументКонтрагента";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидПакетаID", """" + ВидПакетаID + """");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	
	ТекстЗапроса_ДополнитьОтборыАктовСверкиВзаиморасчетов3_0_131(ТекстЗапроса);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_ПервичныеДокументыБезНДСЧерновики(ИмяВременнойТаблицы, ВидПакетаID)
	
	ТекстЗапросаВТ =
	";
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Т.Ссылка КАК Документ,
	|	Т.Номер КАК НомерДокумента,
	|	Т.Дата КАК ДатаДокумента,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Организация КАК Организация,
	|	Т.СуммаДокумента КАК СуммаДокумента,
	|	&ВидПакетаID КАК ВидПакетаID
	|ПОМЕСТИТЬ ИмяВременнойТаблицы
	|ИЗ
	|	ВТ_ДокументыБезНДС КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкиОрганизаций КАК ВТ_Настройки
	|		ПО Т.Организация = ВТ_Настройки.Организация1С
	|			И (ВТ_Настройки.ВидПакетаID = &ВидПакетаID)
	|			И (НЕ Т.Исправление)
	|			И (НЕ Т.Корректировка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отправители КАК ВТ_Отправители
	|		ПО Т.Организация = ВТ_Отправители.Организация1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПартнерскиеОтношения КАК ВТ_Получатели
	|		ПО Т.Контрагент = ВТ_Получатели.Контрагент1С
	|ГДЕ
	|	Т.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВТ_Получатели.Контрагент1С ЕСТЬ NULL
	|	И НЕ ВТ_Отправители.Организация1С ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДокументыБезНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Документы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПодходящиеДокументы
	|;";
	
	Если ЭтоИсправительныйВидПакета(ВидПакетаID) Тогда
		ТекстЗапросаВТ = СтрЗаменить(ТекстЗапросаВТ, "И (НЕ Т.Исправление)", "И (Т.Исправление)");
	КонецЕсли;
	
	Если ЭтоКорректировкаРеализацииБезНДС(ВидПакетаID) Тогда
		ТекстЗапросаВТ = СтрЗаменить(ТекстЗапросаВТ, "И (НЕ Т.Корректировка)", "И (Т.Корректировка)");
	КонецЕсли;
	
	ВидПервичногоПакета = "= ""ID_ОсновнойПакет""";
	Если ВидПакетаID <> "ID_ТОРГ12_Акт_БезНДС" Тогда
		
		ВидПервичногоПакетаПолный = СтрЗаменить(ВидПакетаID, "ID_И", "ID_");
		ВидПервичногоПакетаПолный = СтрЗаменить(ВидПервичногоПакетаПолный, "_БезНДС", "");
		ВидПервичногоПакетаРаздельно = ВидПервичногоПакетаПолный + "_Раздельно";
		
		ВидПервичногоПакета = "В (""" + ВидПервичногоПакетаПолный + """,""" + ВидПервичногоПакетаРаздельно + """)";
		
	КонецЕсли;
	
	ТекстЗапросаВТ = СтрЗаменить(ТекстЗапросаВТ, "ВТ_Настройки.ВидПакетаID = &ВидПакетаID",
		"ВТ_Настройки.ВидПакетаID " + ВидПервичногоПакета);
	ТекстЗапросаВТ = СтрЗаменить(ТекстЗапросаВТ, "&ВидПакетаID", """" + ВидПакетаID + """");
	ТекстЗапросаВТ = СтрЗаменить(ТекстЗапросаВТ, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	
	ЧастиЗапроса = ТекстЗапроса_ВТДокументыБезНДС();
	ЧастиЗапроса.Добавить(ТекстЗапросаВТ);
	
	ТекстЗапроса = СтрСоединить(ЧастиЗапроса, Символы.ПС);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_ВТДокументыБезНДС()
	
	Результат = Новый Массив;
	
	ОсновнойЗапрос = ДокументыБезНДС_ТекстЗапроса_ВТДокументы() +
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Документ КАК Ссылка,
	|	ВТ_Документы.ЭтоИсправление КАК Исправление,
	|	ВТ_Документы.ЭтоКорректировка КАК Корректировка
	|ПОМЕСТИТЬ ВТ_ПодходящиеДокументы
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.ЭтоИсправление,
	|	ВТ_Документы.ЭтоКорректировка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_Документы.ВсегоПозиций) = СУММА(ВТ_Документы.ПозицийБезНДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПодходящиеДокументы.Ссылка КАК Ссылка,
	|	ВТ_ПодходящиеДокументы.Исправление КАК Исправление,
	|	ВТ_ПодходящиеДокументы.Корректировка КАК Корректировка,
	|	ВТ_ПодходящиеДокументы.Ссылка.Проведен КАК Проведен,
	|	ВТ_ПодходящиеДокументы.Ссылка.Номер КАК Номер,
	|	ВТ_ПодходящиеДокументы.Ссылка.Дата КАК Дата,
	|	ВТ_ПодходящиеДокументы.Ссылка.Контрагент КАК Контрагент,
	|	ВТ_ПодходящиеДокументы.Ссылка.Организация КАК Организация,
	|	ВТ_ПодходящиеДокументы.Ссылка.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ВТ_ДокументыБезНДС
	|ИЗ
	|	ВТ_ПодходящиеДокументы КАК ВТ_ПодходящиеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТ_ПодходящиеДокументы.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL";
	
	Результат.Добавить(ОсновнойЗапрос);
	
	Если РазрешеноЧтениеТаблицы(Метаданные.Документы.КорректировкаРеализации) Тогда
		Результат.Добавить(ТекстЗапроса_ОбъединитьВсе());
		Результат.Добавить(ДокументыБезСФ_ДобавитьТекстЗапроса_КРТУКомиссионера());
	КонецЕсли;
	
	Если РазрешеноЧтениеТаблицы(Метаданные.Документы.ОтчетКомитентуОПродажах) Тогда
		Результат.Добавить(ТекстЗапроса_ОбъединитьВсе());
		Результат.Добавить(ДокументыБезСФ_ДобавитьТекстЗапроса_ОтчетКомитентуОПродажах());
	КонецЕсли;
	
	Если РазрешеноЧтениеТаблицы(Метаданные.Документы.ПередачаТоваров) Тогда
		Результат.Добавить(ТекстЗапроса_ОбъединитьВсе());
		Результат.Добавить(ДокументыБезСФ_ДобавитьТекстЗапроса_ПередачаТоваров());
	КонецЕсли;
	
	Если РазрешеноЧтениеТаблицы(Метаданные.Документы.ПередачаНМА) Тогда
		Результат.Добавить(ТекстЗапроса_ОбъединитьВсе());
		Результат.Добавить(ДокументыБезСФ_ДобавитьТекстЗапроса_ПередачаНМА());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДокументыБезНДС_ТекстЗапроса_ВТДокументы()
	
	ИмяТабличнойЧастиТовары = "Товары";
	ИмяТабличнойЧастиУслуги = "Услуги";
	ИмяТабличнойЧастиАгентскиеУслуги = "АгентскиеУслуги";
	
	Запросы = Новый Массив;
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "АктОбОказанииПроизводственныхУслуг", ИмяТабличнойЧастиУслуги);
	
	Условие = ТекстыЗапросов_ДопУсловия_ВидыОперации_СчетФактураТребуется();
	ДокументыБезНДС_ДобавитьТекстЗапросаПоРеализацииТоваровУслуг(Запросы, ИмяТабличнойЧастиТовары, Условие);
	ДокументыБезНДС_ДобавитьТекстЗапросаПоРеализацииТоваровУслуг(Запросы, ИмяТабличнойЧастиУслуги);
	ДокументыБезНДС_ДобавитьТекстЗапросаПоРеализацииТоваровУслуг(Запросы, ИмяТабличнойЧастиАгентскиеУслуги);
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоРеализацииОтгруженныхТоваров(Запросы);
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "РеализацияУслугПоПереработке", ИмяТабличнойЧастиУслуги);
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, "ПередачаОС", "ОС");
	
	Условие = ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах();
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоИсправлениюРеализации(Запросы, ИмяТабличнойЧастиТовары);
	ДокументыБезНДС_ДобавитьТекстЗапросаПоИсправлениюРеализации(Запросы, ИмяТабличнойЧастиУслуги);
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоКорректировкеРеализации(Запросы, ИмяТабличнойЧастиТовары);
	ДокументыБезНДС_ДобавитьТекстЗапросаПоКорректировкеРеализации(Запросы, ИмяТабличнойЧастиУслуги);
	ДокументыБезНДС_ДобавитьТекстЗапросаПоКорректировкеРеализации(Запросы, ИмяТабличнойЧастиАгентскиеУслуги);
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоРеализацииТоваровУслугПродажаКомиссия(Запросы);
	ДокументыБезНДС_ДобавитьТекстЗапросаПоВозвратам(Запросы);
	
	Результат = СтрСоединить(Запросы, ТекстЗапроса_ОбъединитьВсе());
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоРеализацииТоваровУслуг(Запросы, ТабличнаяЧасть, Условие = "")
	
	ВидДокумента = "РеализацияТоваровУслуг";
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, ВидДокумента, ТабличнаяЧасть, Условие);
	
КонецПроцедуры

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоИсправлениюРеализации(Запросы, ТабличнаяЧасть)
	
	ВидДокумента = "КорректировкаРеализации";
	Условие = ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах();
	Исправление = "Истина";
	Корректировка = "Ложь";
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, ВидДокумента, ТабличнаяЧасть, Условие, Исправление,
		Корректировка);
	
КонецПроцедуры

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоКорректировкеРеализации(Запросы, ТабличнаяЧасть)
	
	ВидДокумента = "КорректировкаРеализации";
	Условие = ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон();
	Исправление = "Ложь";
	Корректировка = "Истина";
	
	ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(Запросы, ВидДокумента, ТабличнаяЧасть, Условие, Исправление,
		Корректировка);
	
КонецПроцедуры

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоРеализацииТоваровУслугПродажаКомиссия(Запросы)
	
	ИмяОбъектаМетаданных = "Документ.РеализацияТоваровУслуг";
	
	ТекстЗапроса = ТекстыЗапросов_ВыборкаДокументовЗаПериод(ИмяОбъектаМетаданных);
	
	ДополнительныеУсловия = ТекстыЗапросов_ДопУсловия_ВидыОперации_СчетФактураНеТребуется();
	
	ТекстЗапроса = ТекстЗапроса + " И " + ДополнительныеУсловия;
	
	ДобавитьТекстЗапросаВПакет(Запросы, ТекстЗапроса);
	
КонецПроцедуры

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоВозвратам(Запросы)
	
	ОбъектМетаданных = Метаданные.Документы.ВозвратТоваровПоставщику;
	
	Если Не РазрешеноЧтениеТаблицы(ОбъектМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстыЗапросов_ВыборкаДокументовЗаПериод(ОбъектМетаданных.ПолноеИмя());
	
	ДобавитьТекстЗапросаВПакет(Запросы, ТекстЗапроса);
	
КонецПроцедуры

Функция ДокументыБезСФ_ДобавитьТекстЗапроса_КРТУКомиссионера()
	
	Результат =
	"ВЫБРАТЬ
	|	КРТУ.Ссылка КАК Документ,
	|	ВЫБОР
	|		КОГДА КРТУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоИсправление,
	|	ВЫБОР
	|		КОГДА КРТУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоКорректировка,
	|		КРТУ.Проведен КАК Проведен,
	|	КРТУ.Номер КАК НомерДокумента,
	|	КРТУ.Дата КАК ДатаДокумента,
	|	КРТУ.Контрагент КАК Контрагент,
	|	КРТУ.Организация КАК Организация,
	|	КРТУ.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КРТУ
	|ГДЕ
	|	КРТУ.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
	|	И КРТУ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ КРТУ.ПометкаУдаления";
	
	Возврат Результат;
	
КонецФункции

Функция ДокументыБезСФ_ДобавитьТекстЗапроса_ОтчетКомитентуОПродажах()
	
	Результат = 
	"ВЫБРАТЬ
	|	ОТОП.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	ОТОП.Проведен КАК Проведен,
	|	ОТОП.Номер КАК НомерДокумента,
	|	ОТОП.Дата КАК ДатаДокумента,
	|	ОТОП.Контрагент КАК Контрагент,
	|	ОТОП.Организация КАК Организация,
	|	ОТОП.СуммаВознаграждения КАК СуммаДокумента
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОТОП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК ТоварыДокумента
	|		ПО ОТОП.Ссылка = ТоварыДокумента.Ссылка
	|ГДЕ
	|	НЕ ОТОП.ПометкаУдаления
	|	И ОТОП.СтавкаНДСВознаграждения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ОТОП.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТоварыДокумента.СуммаВознаграждения > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ОТОП.Ссылка";
	
	Возврат Результат;
	
КонецФункции

Функция ДокументыБезСФ_ДобавитьТекстЗапроса_ПередачаТоваров()
	
	Результат =
	"ВЫБРАТЬ
	|	ШапкаПередачаТоваров.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	ШапкаПередачаТоваров.Проведен КАК Проведен,
	|	ШапкаПередачаТоваров.Номер КАК НомерДокумента,
	|	ШапкаПередачаТоваров.Дата КАК ДатаДокумента,
	|	ШапкаПередачаТоваров.Контрагент КАК Контрагент,
	|	ШапкаПередачаТоваров.Организация КАК Организация,
	|	СУММА(ТоварПередачаТоваров.Сумма) КАК СуммаДокумента
	|ИЗ
	|	Документ.ПередачаТоваров.Товары КАК ТоварПередачаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваров КАК ШапкаПередачаТоваров
	|		ПО ТоварПередачаТоваров.Ссылка = ШапкаПередачаТоваров.Ссылка
	|ГДЕ
	|	НЕ ШапкаПередачаТоваров.ПометкаУдаления
	|	И ТоварПередачаТоваров.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ШапкаПередачаТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ШапкаПередачаТоваров.Ссылка,
	|	ШапкаПередачаТоваров.Проведен,
	|	ШапкаПередачаТоваров.Номер,
	|	ШапкаПередачаТоваров.Дата,
	|	ШапкаПередачаТоваров.Контрагент,
	|	ШапкаПередачаТоваров.Организация";
	
	Возврат Результат;
	
КонецФункции

Функция ДокументыБезСФ_ДобавитьТекстЗапроса_ПередачаНМА()
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Документ,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	Т.Проведен КАК Проведен,
	|	Т.Номер КАК НомерДокумента,
	|	Т.Дата КАК ДатаДокумента,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Организация КАК Организация,
	|	СУММА(Т.СуммаДокумента) КАК СуммаДокумента
	|ИЗ
	|	Документ.ПередачаНМА КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И Т.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И Т.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Ссылка,
	|	Т.Проведен,
	|	Т.Номер,
	|	Т.Дата,
	|	Т.Контрагент,
	|	Т.Организация";
	
	Возврат Результат;
	
КонецФункции

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоРеализацииОтгруженныхТоваров(Запросы)
	
	ОбъектМетаданных = Метаданные.Документы.РеализацияОтгруженныхТоваров;
	
	Если НЕ РазрешеноЧтениеТаблицы(ОбъектМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	ЛОЖЬ КАК ЭтоИсправление,
	|	ЛОЖЬ КАК ЭтоКорректировка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК ТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК Т
	|		ПО ТабличнаяЧасть.Ссылка = Т.ДокументОтгрузки
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И Т.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	ДобавитьТекстЗапросаВПакет(Запросы, ТекстЗапроса);
	
КонецПроцедуры

Процедура ДокументыБезНДС_ДобавитьТекстЗапросаПоДаннымТЧ(
	Запросы,
	ВидДокумента,
	ТабличнаяЧасть,
	Условие = "",
	Исправление = "Ложь",
	Корректировка = "Ложь")
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ВидДокумента);
	
	Если МетаданныеДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РазрешеноЧтениеТаблицы(МетаданныеДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Если МетаданныеДокумента.ТабличныеЧасти.Найти(ТабличнаяЧасть) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Документ,
	|	1 КАК ВсегоПозиций,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПозицийБезНДС,
	|	&Исправление КАК ЭтоИсправление,
	|	&Корректировка КАК ЭтоКорректировка
	|ИЗ
	|	&Таблица КАК ТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПолноеИмяДокумента КАК Т
	|		ПО ТабличнаяЧасть.Ссылка = Т.Ссылка
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И Т.Дата МЕЖДУ &НачалоПериода И &КонецПериода" + Условие;
	
	Документ = МетаданныеДокумента.ПолноеИмя();
	Таблица = Документ + "." + ТабличнаяЧасть;
	
	Результат = СтрЗаменить(Результат, "ПолноеИмяДокумента", Документ);
	Результат = СтрЗаменить(Результат, "&Таблица", Таблица);
	Результат = СтрЗаменить(Результат, "&Исправление", Исправление);
	Результат = СтрЗаменить(Результат, "&Корректировка", Корректировка);
	
	ДобавитьТекстЗапросаВПакет(Запросы, Результат);
	
КонецПроцедуры

Функция ТекстЗапрос_ОтборКорректировкиВПервичныхДокументах()
	
	Результат =
	" И Т.ВидОперации = 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапрос_ОтборКорректировкиПоСогласованиюСторон()
	
	Результат =
	" И Т.ВидОперации = 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстыЗапросов_ДопУсловия_ВидыОперации_СчетФактураНеТребуется()
	
	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ПродажаКомиссия)");
	
	Если ИспользуетсяРеализацияЧерезПередачуТоваров() Тогда 
		ВидыОпераций.Добавить("ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ПередачаТоваров)");
	КонецЕсли;
	
	ШаблонУсловия = "Т.ВидОперации В (%1)";
	
	ВидыИсправленийСтрокой = СтрСоединить(ВидыОпераций, ",");
	
	Результат = СтрШаблон(ШаблонУсловия, ВидыИсправленийСтрокой);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстыЗапросов_ДопУсловия_ВидыОперации_СчетФактураТребуется()
	
	ОсновноеУсловие = ТекстыЗапросов_ДопУсловия_ВидыОперации_СчетФактураНеТребуется();
	
	ШаблонУсловия = " И НЕ (%1)";
	
	Результат = СтрШаблон(ШаблонУсловия, ОсновноеУсловие);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстыЗапросов_ВыборкаДокументовЗаПериод(ИмяОбъектаМетаданных)
	
	Результат =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Документ,
	|	0 КАК ВсегоПозиций,
	|	0 КАК ПозицийБезНДС,
	|	Ложь КАК ЭтоИсправление,
	|	Ложь КАК ЭтоКорректировка
	|ИЗ
	|	&Таблица КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И Т.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Результат = СтрЗаменить(Результат, "&Таблица", ИмяОбъектаМетаданных);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьТекстЗапросаВПакет(Запросы, ТекстЗапроса)
	
	Если Запросы.Количество() = 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИЗ", "ПОМЕСТИТЬ ВТ_Документы ИЗ");
	КонецЕсли;
	
	Запросы.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Функция ТекстЗапроса_ОбъединитьВсе()
	
	Возврат "
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтдСтр()
	
	Если __СтдСтр = Неопределено Тогда
		
		Если __ЭтоВнешняяОбработка Тогда
			__СтдСтр = Новый("ExternalDataProcessorObject.КонтурДиадокСтдСтр");
		Иначе
			__СтдСтр = Новый("DataProcessorObject.КонтурДиадокСтдСтр");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат __СтдСтр;
	
КонецФункции

Функция ЭтоВнешняяОбработкаЛок()
	
	Если __ЭтоВнешняяОбработка = Неопределено Тогда
		
		ПараметрыПроверки = Новый Структура;
		ПараметрыПроверки.Вставить("ИспользуемоеИмяФайла");
		ЗаполнитьЗначенияСвойств(ПараметрыПроверки, ЭтотОбъект);
		
		__ЭтоВнешняяОбработка = ПараметрыПроверки.ИспользуемоеИмяФайла <> Неопределено;
		
	КонецЕсли;
	
	Возврат __ЭтоВнешняяОбработка;
	
КонецФункции 

// Возвращает описания всех библиотек конфигурации, включая
// описание самой конфигурации.
// 
// Возвращаемое значение:
//  Соответствие:
//   * Ключ - Строка - имя подсистемы, например, "СтандартныеПодсистемы".
//   * Значение - Структура - описание подсистемы:
//     ** Имя - Строка - имя подсистемы.
//     ** Версия - Строка - версия подсистемы.
//     ** ЭтоКонфигурация - Булево - Истина, если данная подсистема является основной конфигурацией.
//     ** ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах интернет-поддержки.
//
Функция ОписанияПодсистемКонфигурации()
	
	// Используем служебный интерфейс БСП, т.к. метод ОписанияПодсистем добавлен в
	// программный интерфейс модуля ОбщегоНазначения только в версии БСП 3.0.2 и выше
	ИнтерфейсБСП = ОбщийМодульПоИмениЛок("СтандартныеПодсистемыПовтИсп");
	Результат = ИнтерфейсБСП.ОписанияПодсистем().ПоИменам;
	Возврат Результат;
	
КонецФункции

Функция ОбщийМодульПоИмениЛок(ИмяМодуля)
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
		Ошибка = СтрШаблон("Общий модуль ""%1"" не найден", ИмяМодуля);
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	Возврат Вычислить(ИмяМодуля);
	
КонецФункции

Функция ВерсияБухгалтерскойПодсистемы()
	
	ИмяПодсистемы = ИмяБухгалтерскойПодсистемы();
	
	ПроверитьИмяПодсистемы(ИмяПодсистемы);
	
	Если ЗначениеЗаполнено(ИмяПодсистемы) Тогда
		ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
		ОписаниеПодсистемы = ПодсистемыКонфигурации.Получить(ИмяПодсистемы);
		Результат = ОписаниеПодсистемы.Версия;
	Иначе
		Результат = Метаданные.Версия;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИмяБухгалтерскойПодсистемы()
	
	ПодсистемыКонфигурации = ОписанияПодсистемКонфигурации();
	ДопустимыеИмена = ИменаПодсистемБП();
	
	Результат = Неопределено;
	
	Для Каждого ИмяПодсистемы Из ДопустимыеИмена Цикл
		
		Если ПодсистемыКонфигурации.Получить(ИмяПодсистемы) <> Неопределено Тогда
			Результат = ИмяПодсистемы;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ИменаПодсистемБП()
	
	Результат = Новый Массив;
	Результат.Добавить("БухгалтерияПредприятия");
	Результат.Добавить("БухгалтерияПредприятияКОРП");
	Результат.Добавить("БухгалтерияПредприятияБазовая");
	Результат.Добавить("БухгалтерияПредприятияБазовая1");
	Результат.Добавить("БухгалтерияМолокозавода");
	Результат.Добавить("АрендаИУправлениеНедвижимостью");
	Результат.Добавить("БухгалтерияСтроительнойОрганизации");
	Результат.Добавить("БухгалтерияСельскохозяйственногоПредприятия");
	Результат.Добавить("БухгалтерияСельскохозяйственногоПредприятияКОРП");
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьИмяПодсистемы(ИмяПодсистемы)
	
	Если ЗначениеЗаполнено(ИмяПодсистемы) Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонОшибки = 
	"Не удалось определить имя бухгалтерской подсистемы.
	|Имя конфигурации: %1
	|Версия конфигурации: %2
	|Наименование конфигурации: %3";
	
	Ошибка = СтрШаблон(
		ШаблонОшибки,
		Метаданные.Имя,
		Метаданные.Версия,
		Метаданные.Синоним
	);
	
	ЖурналРегистрации_ЗаписатьОшибку(Ошибка);
	
КонецПроцедуры

Процедура ЖурналРегистрации_ЗаписатьОшибку(Ошибка)
	
	Операция = "Диадок.ЧерновикиПакетовБП30";
	
	ЗаписьЖурналаРегистрации(
		Операция,
		УровеньЖурналаРегистрации.Ошибка,
		Неопределено,
		Неопределено,
		Ошибка
	);
	
КонецПроцедуры

Функция ИспользуетсяРеализацияЧерезПередачуТоваров()
	
	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	Результат = (__СтдСтр.СравнитьВерсииЛок(ВерсияБП, "3.0.116") > 0);
	
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяАктСверкиВзаиморасчетов3_0_131()
	
	ВерсияБП = ВерсияБухгалтерскойПодсистемы();
	Результат = (__СтдСтр.СравнитьВерсииЛок(ВерсияБП, "3.0.131") >= 0);
	
	Возврат Результат;
	
КонецФункции

Процедура ТекстЗапроса_ДополнитьОтборыАктовСверкиВзаиморасчетов3_0_131(ТекстЗапроса)
	
	ЭтоДокументКонтрагента = "";
	Если ИспользуетсяАктСверкиВзаиморасчетов3_0_131() Тогда
		ЭтоДокументКонтрагента = "И НЕ Т.ЭтоДокументКонтрагента";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЭтоДокументКонтрагента", ЭтоДокументКонтрагента);
	
КонецПроцедуры

Функция РазрешеноЧтениеТаблицы(ОбъектМетаданных)
	
	Результат = ПравоДоступа("Чтение", ОбъектМетаданных);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Инициализация

Процедура __Инит__()
	
	// BSLLS:UnusedLocalVariable-off
	__ЭтоВнешняяОбработка = ЭтоВнешняяОбработкаЛок();
	__СтдСтр = СтдСтр();
	// BSLLS:UnusedLocalVariable-on
	
КонецПроцедуры

#КонецОбласти

__Инит__();