#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьДубли(Ссылки) Экспорт
	РегистрыСведений.ДублиНСИКПодтверждению.ДобавитьДубли(Ссылки, Пользователи.ТекущийПользователь());
КонецПроцедуры

// Проверяет, доступна ли для объекта интерактивная пометка удаления.
//
// Параметры:
//   Ссылка - ЛюбаяСсылка - объект, для которого проверяется право.
//
// Возвращаемое значение:
//   Булево - Истина, если интерактивная пометка удаления доступна, иначе Ложь.
//
Функция ДоступнаИнтерактивнаяПометка(Ссылка) Экспорт
	Возврат ПравоДоступа("ИнтерактивнаяПометкаУдаления", Ссылка.Метаданные())
		И ПравоДоступа("Использование", Метаданные.Обработки.ПоискИУдалениеДублей);
КонецФункции

// Возвращает имя основной формы выбора для ссылочного объекта по его метаданным.
//
// Параметры:
//   Ссылка - ЛюбаяСсылка - ссылка на объект, для которого требуется получить имя формы выбора
//
// Возвращаемое значение:
//   Строка - полное имя формы выбора, включая путь метаданных
//
Функция ИмяФормыВыбора(Ссылка) Экспорт
	Возврат Ссылка.Метаданные().ПолноеИмя() + ".ФормаВыбора";
КонецФункции

// Возвращает идентификатор группы дублей для указанного объекта.
//
// Параметры:
//   Дубль - СправочникСсылка,ПланВидовХарактеристикСсылка - объект, для которого ищется группа дублей.
//
// Возвращаемое значение:
//   Строка - идентификатор группы дублей, к которой относится переданный объект.
//
Функция ГруппаДубля(Дубль) Экспорт
	
	Выборка = РегистрыСведений.ДублиНСИКПодтверждению.СуществующиеДубли(Дубль);
	Выборка.Следующий();
	
	Возврат Выборка.ГруппаДублей;
	
КонецФункции 

#КонецОбласти