
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		ПараметрыВыполненияКоманды.Источник.РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	РезультатОтправки = ОтправитьФайлыСервер(ПараметрКоманды);
	Если РезультатОтправки.Успешно = Ложь Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьООшибкиВыполненияФункции(РезультатОтправки);
	КонецЕсли;
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена"));
	
КонецПроцедуры

&НаСервере
Функция ОтправитьФайлыСервер(МассивСсылок)
	
	Возврат	КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлыВДиадок(МассивСсылок);
	
КонецФункции
