#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Закупка") Тогда 
		
		Закупка   = Параметры.Закупка;	
		Заголовок = НСтр("ru = 'Результат '") + Строка(Закупка);
		
	КонецЕсли;
	
	Если Параметры.Свойство("ИдентификаторЗакупки") Тогда 
		ИдентификаторЗакупки = Параметры.ИдентификаторЗакупки;	
	КонецЕсли;
	
	Если Параметры.Свойство("ФормироватьОтчетПриОткрытии") Тогда
		ФормироватьОтчетПриОткрытии = Параметры.ФормироватьОтчетПриОткрытии;
	КонецЕсли;
									
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьЭлементовФормы();
	
	Если ФормироватьОтчетПриОткрытии Тогда	
		СформироватьОтчет(Неопределено); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	
	Если ФормироватьОтчетПриОткрытии Тогда
		
		Если Настройки <> Неопределено Тогда
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Закупка", Закупка);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	
	Если ФормироватьОтчетПриОткрытии Тогда  
				
		Настройки.Элементы[0].Значение 		= Закупка;
		Настройки.Элементы[0].Использование = Истина; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура РезультатВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Область.Текст) Тогда
		
		Если Найти(Область.Текст, "http") > 0 Тогда
			СтандартнаяОбработка = Ложь;
			НачатьЗапускПриложения(Новый ОписаниеОповещения, Область.Значение);		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
		
	РезультатФормирования = СформироватьОтчетНаСервере();
	
	ЕстьОшибка = РезультатФормирования.error;	
	Если ЕстьОшибка Тогда
		
		Если ФормироватьОтчетПриОткрытии Тогда
			Оповещение = Новый ОписаниеОповещения("Оповещение_ОтветНаВопросЗагрузитьРезультатЗакупки", ЭтаФорма);
			ТекстВопроса = РезультатФормирования.message + Символы.ПС + НСтр("ru = 'Загрузить результат закупки?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
		КонецЕсли;
		
	Иначе  	
		Результат = РезультатФормирования.data;			
	КонецЕсли;
	
КонецПроцедуры 


&НаСервере
Функция СформироватьОтчетНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");	
	
	РезультатФормирования = ОтчетОбъект.СформироватьОтчет();
	
	Возврат РезультатФормирования;
		
КонецФункции

&НаКлиенте
Процедура Оповещение_ОтветНаВопросЗагрузитьРезультатЗакупки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьРезультатЗакупки(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРезультатЗакупки(Команда)
	
	ОчиститьСообщения();
	
	ТекстОшибки = ЗагрузитьРезультатЗакупкиНаСервере(Закупка, ИдентификаторЗакупки);						
	
	Если ПустаяСтрока(ТекстОшибки) Тогда	
		СформироватьОтчет(Неопределено);		
	Иначе
		КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьВидимостьЭлементовФормы()

	Элементы.ГруппаДополнительнаяКоманднаяПанель.Видимость 	= НЕ ФормироватьОтчетПриОткрытии;
	Элементы.ПоказатьНастройки.Видимость 				   	= НЕ ФормироватьОтчетПриОткрытии;
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = НЕ ФормироватьОтчетПриОткрытии;
	
КонецПроцедуры // НастроитьВидимостьЭлементовФормы()

&НаСервереБезКонтекста
Функция ЗагрузитьРезультатЗакупкиНаСервере(Закупка, ИдентификаторЗакупки) Экспорт
	
	ОписаниеРезультата = КонтурЗакупки_РаботаСЗакупкамиСервер.ЗагрузитьРезультатЗакупки(Закупка, ИдентификаторЗакупки);
	
	Возврат ОписаниеРезультата;
	
КонецФункции

#КонецОбласти

