#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТипДокументаЛогистика", ТипДокументаЛогистика);
	Параметры.Свойство("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	Параметры.Свойство("ИмяРеквизитаТабличнойЧасти", ИмяРеквизитаТабличнойЧасти);
	
	ЗаполнитьМассивРеквизитовПроизвольнойТЧ(ИмяТабличнойЧасти);
	
	Если Параметры.Свойство("ПравилаКонвертацииМассиваСтруктур") Тогда
		Для Каждого ТекущаяСтрокаПравил Из Параметры.ПравилаКонвертацииМассиваСтруктур Цикл
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("РеквизитТитула", ТекущаяСтрокаПравил.РеквизитТитула);
			
			НайденныеСтроки = ПравилаКонвертацииМассивовСтруктур.НайтиСтроки(ПараметрыОтбора);
			
			Для Каждого ТекущаяСтрокаНайденная Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(ТекущаяСтрокаНайденная, ТекущаяСтрокаПравил);
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	Заголовок = "Настройка конвертации табличной части: " + ИмяТабличнойЧасти;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПравилаКонвертацииМассивовСтруктурКонвертироватьПоНастройкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПравилаКонвертацииМассивовСтруктур.ТекущиеДанные;
	
	ИмяСправочника = ИмяСправочникаЛогистикаПоСпособуКонвертации(ТекущиеДанные.СпособКонвертацииЗначения);
	
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаВыбора";
	ЗначениеОтбора = Новый Структура("ТипСправочникаЛогистика", ИмяСправочника);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	ПараметрыОбработчика = Новый Структура("ИмяТабличнойЧасти", "ПравилаКонвертацииМассивовСтруктур");
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыФормы, ЭтаФорма, ЭтаФорма,
		"КонвертироватьПоНастройкеНачалоВыбораЗавершение", ПараметрыОбработчика, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьПоНастройкеНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПравилаКонвертацииМассивовСтруктур.ТекущиеДанные.КонвертироватьПоНастройке = Результат;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	ПравилаКонвертацииМассиваСтруктур = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из ПравилаКонвертацииМассивовСтруктур Цикл
		ПравилоКонвертацииТекущее = Новый Структура;
		ПравилоКонвертацииТекущее.Вставить("РеквизитТитула", ТекущаяСтрока.РеквизитТитула);
		ПравилоКонвертацииТекущее.Вставить("СпособКонвертацииЗначения", ТекущаяСтрока.СпособКонвертацииЗначения);
		ПравилоКонвертацииТекущее.Вставить("КонвертироватьПоНастройке", ТекущаяСтрока.КонвертироватьПоНастройке);
		
		ПравилаКонвертацииМассиваСтруктур.Добавить(ПравилоКонвертацииТекущее);
	КонецЦикла;
	
	Закрыть(ПравилаКонвертацииМассиваСтруктур);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьМассивРеквизитовПроизвольнойТЧ(ИмяТабличнойЧасти)
	
	ИмяДокумента = "КонтурЛогистика_" + Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ТипДокументаЛогистика);
	
	НайденнаяТабличнаяЧасть = Метаданные.Документы[ИмяДокумента].ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
	Если НайденнаяТабличнаяЧасть = Неопределено Тогда
		ВызватьИсключение "Не удалось найти табличную часть """ + ИмяТабличнойЧасти + """ у документа """ + ИмяДокумента + """";
	КонецЕсли;
	
	Для Каждого РеквизитТабличнойЧасти Из НайденнаяТабличнаяЧасть.Реквизиты Цикл
		
		НоваяСтрока = ПравилаКонвертацииМассивовСтруктур.Добавить();
		
		НоваяСтрока.РеквизитТитула = РеквизитТабличнойЧасти.Имя;
		НоваяСтрока.ТипЗначения = РеквизитТабличнойЧасти.Тип;
		НоваяСтрока.Комментарий = РеквизитТабличнойЧасти.Комментарий;
		НоваяСтрока.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять;
		
		Если РеквизитТабличнойЧасти.Тип.Типы()[0] = Тип("СправочникСсылка.КонтурЛогистика_Договоры") Тогда
			НоваяСтрока.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВДоговор;
		ИначеЕсли РеквизитТабличнойЧасти.Тип.Типы()[0] = Тип("СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок") Тогда
			НоваяСтрока.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок;
		ИначеЕсли РеквизитТабличнойЧасти.Тип.Типы()[0] = Тип("СправочникСсылка.КонтурЛогистика_ПодразделенияДиадок") Тогда
			НоваяСтрока.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПодразделениеДиадок;
		ИначеЕсли РеквизитТабличнойЧасти.Тип.Типы()[0] = Тип("СправочникСсылка.КонтурЛогистика_ПунктыМаршрута") Тогда
			НоваяСтрока.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута;
		ИначеЕсли РеквизитТабличнойЧасти.Тип.Типы()[0] = Тип("СправочникСсылка.КонтурЛогистика_Сотрудники") Тогда
			НоваяСтрока.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВСотрудника;
		ИначеЕсли РеквизитТабличнойЧасти.Тип.Типы()[0] = Тип("СправочникСсылка.КонтурЛогистика_ТранспортныеСредства") Тогда
			НоваяСтрока.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВТранспортноеСредство;
		ИначеЕсли РеквизитТабличнойЧасти.Тип.Типы()[0] = Тип("СправочникСсылка.КонтурЛогистика_Лицензии") Тогда
			НоваяСтрока.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВЛицензию;
		ИначеЕсли РеквизитТабличнойЧасти.Тип.Типы()[0] = Тип("СправочникСсылка.КонтурЛогистика_ГорючеСмазочныеМатериалы") Тогда
			НоваяСтрока.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВГорючеСмазочныйМатериал;
		Иначе
			НоваяСтрока.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.БезДопОбработки;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяСправочникаЛогистикаПоСпособуКонвертации(СпособКонвертацииЗначения)
	
	Возврат Перечисления.КонтурЛогистика_СпособыКонвертации.ИмяСправочникаЛогистикаПоСпособуКонвертации(СпособКонвертацииЗначения);
	
КонецФункции

#КонецОбласти