////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Кэш клиент
&НаКлиенте
Перем
КлиентскиеМетодыКэш,
ВызывающийМодуль;

// Кэш
&НаСервере
Перем
МенеджерКэш;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// УСТАНОВЩИКИ

// Устанавливает свойство формы для использования указанной конфигурации приложения.
//
// Параметры:
//  Значение - ФиксированнаяСтруктура - Конфигурация приложения.
//                                     См. КлиентскиеМетоды.МодельКонфигурацияПриложения.
//
&НаКлиенте
Процедура УстановитьКонфигурациюПриложения(Знач Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Значение = Новый ФиксированнаяСтруктура(Значение);
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("ФиксированнаяСтруктура") Тогда
		ВызватьИсключение "Ошибка установки конфигурации приложения: ожидалась структура или фиксированная структура";	
	КонецЕсли; 
	
	КлиентскиеМетоды().ПроверитьКонфигурациюПриложения(Значение);	
	КонфигурацияПриложения = Значение;
	
КонецПроцедуры

// Устанавливает свойство формы для использования указанной конфигурации обновлятора.
//
// Параметры:
//  Значение - ФиксированнаяСтруктура - Конфигурация обновлятора.
//                                     См. КлиентскиеМетоды.МодельКонфигурацияОбновлятора.
//
&НаКлиенте
Процедура УстановитьКонфигурациюОбновлятора(Знач Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Значение = Новый ФиксированнаяСтруктура(Значение);
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("ФиксированнаяСтруктура") Тогда
		ВызватьИсключение "Ошибка установки конфигурации обновлятора: ожидалась структура или фиксированная структура";	
	КонецЕсли;
	
	КонфигурацияОбновлятора = Значение;
	
КонецПроцедуры

// Устанавливает свойство формы для использования указанного объекта метаданных в качестве хранилища плагинов.
//
// Параметры:
//  Значение - Строка - Имя объекта метаданных, используемого как хранилище сессий.
//                     Допустимые значения: "Обработка", "Справочник", "РегистрСведений", "ОбщийМодуль".
//
&НаКлиенте
Процедура УстановитьХранилищеПлагинов(Значение = Неопределено) Экспорт
	
	ХранилищеПлагинов = Значение;	
	
КонецПроцедуры

// Устанавливает вызывающий модуль, для предоставления клиентского публичного интерфейса приложения.
//
// Параметры:
//   Значение - Произвольный - Объект метаданных.
//
&НаКлиенте
Процедура УстановитьВызывающийМодуль(Значение) Экспорт
	
	ВызывающийМодуль = Значение;
	
КонецПроцедуры

// Устанавливает свойство формы для настроек прокси
//
// Параметры:
//  Значение - Структура, ФиксированнаяСтруктура - см КоннекторHTTP.СоздатьНастройкиПрокси.
//
&НаКлиенте
Процедура УстановитьНастройкиПрокси(Значение) Экспорт

	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Значение = Новый ФиксированнаяСтруктура(Значение);	
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("ФиксированнаяСтруктура") Тогда
		ВызватьИсключение "Ошибка установки прокси: ожидалась структура или фиксированная структура";	
	КонецЕсли;
	
	НастройкиПрокси = Значение;
	
КонецПроцедуры

// МОДЕЛИ

// Модель конфигурации приложения. Используется для хранения и передачи параметров текущего приложения.
//
// Возвращаемое значение:
//   Стуктура:
//   * Имя      - Строка - Имя приложения, по которому будет производиться поиск и сохранения плагинов в базе 1С
//   * Каталог  - Строка - родитель элементов спраовчника, где хранятся плагины
//	   КаталогОтладки - Строка - Каталог, где будет происходить поиск плагинов для отладки
//
&НаКлиенте
Функция МодельКонфигурацияПриложения() Экспорт
	
	Возврат КлиентскиеМетоды().МодельКонфигурацияПриложения();
	
КонецФункции

// Модель конфигурации обновлятора. Содержит параметры подключения к сервису обновлений.
//
// Возвращаемое значение:
//	Структура:
//   * Локация 	- Строка - Локация сервиса
//   * КлючАПИ 	- Строка - X-Kontur-Apikey
//   * КлючИБ 	- Строка - X-Kontur-Secret-Key
//   * Приложение  - Строка - Имя приложения в сервисе обновлений
//
&НаКлиенте
Функция МодельКонфигурацияОбновлятора() Экспорт
	
	Возврат КлиентскиеМетоды().МодельКонфигурацияОбновлятора();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Процедура _ПослеДобавленияПлагина(Результат, ДопПараметры) Экспорт

	ОбновитьСписокПлагиновНаСервере();
	ПриАктивизацииСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура _ПослеВыбораПлагинаДляЗагрузки(Результат, ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если КлиентскиеМетоды()._Стд().Стр().СтрНайтиЛок(Результат[0], КаталогОтладки) = 0 Тогда
		ВызватьИсключение "Каталог плагина отличается от каталога отладки. 
			|Для отладки необходимо выбрать плагин из каталога отладки";
	КонецЕсли;
	
	Файл = Новый Файл(Результат[0]);
	ДвоичныеДанные = Новый ДвоичныеДанные(Результат[0]);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	ЗагрузитьИзФайлаНаСервере(АдресХранилища, ТипКонтентаФайла(Файл));
	
КонецПроцедуры

&НаКлиенте
Процедура _ПослеВыбораКаталогаДляСохраненияПлагина(Результат, ДопПараметры) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитькаталогОтладкиВНастройкиНаСервере(Результат[0]);
	УстановитьКаталогОтладкиНаСервереИзНастроек();
	СохранитьПлагинНаСервере(Результат[0]);
	
КонецПроцедуры

&НаКлиенте
Процедура _ПослеВыбораКаталогаОтладки(Результат, ДопПараметры) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитькаталогОтладкиВНастройкиНаСервере(Результат[0]);
	УстановитьКаталогОтладкиНаСервереИзНастроек();
	ЗапуститьПриложение(КаталогОтладки);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтоВнешняяОбработка = Объект_()._ЭтоВнешняяОбработка();
	Элементы.ГруппаИнформация.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСписокПлагиновНаСервере();
	ПриАктивизацииСтроки();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Добавить(Команда)
	
	ОткрытьСписокПлагиновСервис();
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаПлагинов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьПлагинНаСервере();
	ОбновитьСписокПлагиновНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСписокПлагиновНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновления(Команда)
	
	Для Каждого Элемент Из ТаблицаПлагинов Цикл
		Если Элемент.Состояние <> СостоянияПлагина().Включен Тогда
			Продолжить;
		КонецЕсли;
		ПроверитьОбновленияПлагина(Элемент.Ид, Элемент.Версия);
	КонецЦикла;
	
	ПриАктивизацииСтроки();
		
КонецПроцедуры

&НаКлиенте
Процедура Отключить(Команда)
	
	Если Элементы.ТаблицаПлагинов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтключитьПлагинНаСервере();
	
	Элементы.ТаблицаПлагинов.ТекущиеДанные.Состояние = СостоянияПлагина().Отключен;
	Элементы.ТаблицаПлагинов.ТекущиеДанные.КартинкаСостояние = 1;
	ПриАктивизацииСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура Включить(Команда)
	
	Если Элементы.ТаблицаПлагинов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВключитьПлагинНаСервере();
	
	Элементы.ТаблицаПлагинов.ТекущиеДанные.Состояние = СостоянияПлагина().Включен;
	Элементы.ТаблицаПлагинов.ТекущиеДанные.КартинкаСостояние = 0;
	ПриАктивизацииСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПлагин(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаПлагинов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПлагинНаСервере();
	ПриАктивизацииСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура Подробнее(Команда)
	
	ПерейтиПоНавигационнойСсылке(Элементы.ТаблицаПлагинов.ТекущиеДанные.АдресДокументации);
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаПлагинов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПередОткрытиемНастроекНаСервере();
	КлиентскиеМетоды().ОткрытьНастройки(ТекущиеДанные.Ид, ВызывающийМодуль);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите плагин для загрузки";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Плагины (*.epf)|*.epf|";
	Диалог.Каталог = КаталогОтладки;
	
	Оповещение = КлиентскиеМетоды()._Стд().ОбщегоНазначения().ОписаниеОповещения(
		"_ПослеВыбораПлагинаДляЗагрузки", ЭтаФорма);
	
	КлиентскиеМетоды()._Стд().Диалоги().ПоказатьДиалогВыбораФайла(Диалог, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	Если Элементы.ТаблицаПлагинов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КаталогОтладки) Тогда
		СохранитьПлагинНаСервере(КаталогОтладки);
	Иначе
		Оповещение = КлиентскиеМетоды()._Стд().ОбщегоНазначения().ОписаниеОповещения(
			"_ПослеВыбораКаталогаДляСохраненияПлагина", ЭтаФорма);
		ВыбратьКаталогОтладки(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКаталогОтладки(Команда)
	
	Если Не КаталогСуществуетНаСервере(КаталогОтладки) Тогда
		Оповещение = КлиентскиеМетоды()._Стд().ОбщегоНазначения().ОписаниеОповещения(
			"_ПослеВыбораКаталогаОтладки", ЭтаФорма);
		ВыбратьКаталогОтладки(Оповещение);
	Иначе
		ЗапуститьПриложение(КаталогОтладки);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьСлужебные(Команда)
	
	Элементы.ГруппаПодменюСлужебные.Видимость = Истина;
	УстановитьКаталогОтладкиНаСервереИзНастроек();
	
	Если ЗначениеЗаполнено(КаталогОтладки) = Ложь Тогда
		Оповещение = КлиентскиеМетоды()._Стд().ОбщегоНазначения().ОписаниеОповещения(
			"_ПослеВыбораКаталогаОтладки", ЭтаФорма);
		ВыбратьКаталогОтладки(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТаблицаПлагиновПриАктивизацииСтроки(Элемент)

	ПриАктивизацииСтроки();		
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// ЗАВИСИМОСТИ

&НаКлиенте
Функция КлиентскиеМетоды()

	Если КлиентскиеМетодыКэш = Неопределено Тогда
		Если ЭтоВнешняяОбработка Тогда
			// BSLLS:GetFormMethod-off
			КлиентскиеМетодыКэш = ПолучитьФорму("ВнешняяОбработка.КонтурДиадокМенеджерПлагинов.Форма.КлиентскиеМетоды");
			// BSLLS:GetFormMethod-on
		Иначе
			// BSLLS:GetFormMethod-off
			КлиентскиеМетодыКэш = ПолучитьФорму("Обработка.КонтурДиадокМенеджерПлагинов.Форма.КлиентскиеМетоды");
			// BSLLS:GetFormMethod-on
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат КлиентскиеМетодыКэш;
	
КонецФункции

&НаСервере
Функция Объект_()
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат Объект;
	#Иначе
		Возврат РеквизитФормыВЗначение("Объект");
	#КонецЕсли
	
КонецФункции

&НаСервере
Функция Менеджер()
	
	Если МенеджерКэш = Неопределено Тогда
		
		МенеджерКэш = Объект_();
		МенеджерКэш.УстановитьКонфигурациюПриложения(КонфигурацияПриложения);
		МенеджерКэш.УстановитьКонфигурациюОбновлятора(КонфигурацияОбновлятора);
		Если ЗначениеЗаполнено(ХранилищеПлагинов) Тогда
			МенеджерКэш.УстановитьХранилищеПлагинов(ХранилищеПлагинов);
		Иначе
			МенеджерКэш.УстановитьХранилищеПлагинов();
		КонецЕсли;
		Если НастройкиПрокси <> Неопределено Тогда
			МенеджерКэш.УстановитьНастройкиПрокси(НастройкиПрокси);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МенеджерКэш;
	
КонецФункции

// ПРОЧЕЕ

&НаКлиенте
Процедура ПриАктивизацииСтроки()

	ТекущиеДанные = Элементы.ТаблицаПлагинов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ГруппаИнформация.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаИнформация.Видимость = Истина;
	Элементы.ДекорацияЗаголовокПлагина.Заголовок = ТекущиеДанные.Представление;
	
	Элементы.Включить.Видимость = ТекущиеДанные.Состояние = СостоянияПлагина().Отключен;
	Элементы.Отключить.Видимость = ТекущиеДанные.Состояние = СостоянияПлагина().Включен;
	Элементы.ОбновитьПлагин.Видимость = ТекущиеДанные.ЕстьОбновление 
		И ТекущиеДанные.Состояние = СостоянияПлагина().Включен; 
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Описание) = Ложь Тогда
		
		Манифест = МанифестНаСервере();
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ид", ТекущиеДанные.Ид);
		
		Строки = ТаблицаПлагинов.НайтиСтроки(Отбор);
		Для Каждого СтрокаТаблицы Из Строки Цикл
			СтрокаТаблицы.Описание = Манифест.Описание;
			СтрокаТаблицы.ЕстьНастройки = Манифест.ЕстьНастройки;
			СтрокаТаблицы.АдресДокументации = Манифест.СсылкаНаСправку;
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.ИнформацияОПлагине.Заголовок = ТекущиеДанные.Описание;
	Элементы.Подробнее.Видимость = ЗначениеЗаполнено(ТекущиеДанные.АдресДокументации);
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ОписаниеОшибки) Тогда
		Элементы.ДекорацияОписаниеОшибки.Заголовок = ТекущиеДанные.ОписаниеОшибки;
	КонецЕсли;
	Элементы.ДекорацияОписаниеОшибки.Видимость = ЗначениеЗаполнено(ТекущиеДанные.ОписаниеОшибки);
	Элементы.Настройки.Видимость = ТекущиеДанные.ЕстьНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновленияПлагина(Ид, Версия)
	
	Попытка 
		РезультатПроверки = ПроверитьОбновленияНаСервере(Ид, Версия);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ЗаписатьПредупреждение(Ошибка);
		Если ЭтоОшибкаПродуктНеНайден(Ошибка) Тогда
			РезультатПроверки = РезультатПроверкиОбновленияЛожь();
		Иначе
			ВызватьИсключение Ошибка.Описание;
		КонецЕсли;
	КонецПопытки;
	
	Если РезультатПроверки.ЕстьОбновление = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ид", Ид);
	Отбор.Вставить("Версия", Версия);
	
	Строки = ТаблицаПлагинов.НайтиСтроки(Отбор);
	
	Для Каждого Элемент Из Строки Цикл
		
		Элемент.ЕстьОбновление = РезультатПроверки.ЕстьОбновление;
		Элемент.КартинкаОбновление = Не РезультатПроверки.ЕстьОбновление; 
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ЭтоОшибкаПродуктНеНайден(Ошибка)

	Возврат КлиентскиеМетоды()._Стд().Стр().СтрНайтиЛок(Ошибка.Описание, "Ошибка состояния") > 0
		И (КлиентскиеМетоды()._Стд().Стр().СтрНайтиЛок(Ошибка.Описание, "Продукт:") > 0
			Или КлиентскиеМетоды()._Стд().Стр().СтрНайтиЛок(Ошибка.Описание, "Последняя версия") > 0)
		И (КлиентскиеМетоды()._Стд().Стр().СтрНайтиЛок(Ошибка.Описание, "не найден") > 0
			Или КлиентскиеМетоды()._Стд().Стр().СтрНайтиЛок(Ошибка.Описание, "не найдена") > 0);
		
КонецФункции

&НаКлиенте
Функция РезультатПроверкиОбновленияЛожь()

	Результат = Новый Структура;
	Результат.Вставить("ЕстьОбновление");
	Результат.Вставить("Продукт");
	Результат.Вставить("Версия");
	Результат.Вставить("Ссылки");

	Результат.ЕстьОбновление = Ложь;
		
	Возврат Результат;
		
КонецФункции

&НаКлиенте
Процедура ОткрытьСписокПлагиновСервис()
	
	Оповещение = КлиентскиеМетоды()._Стд().ОбщегоНазначения().ОписаниеОповещения("_ПослеДобавленияПлагина", ЭтаФорма);
	
	Если ЭтоВнешняяОбработка Тогда
		// BSLLS:GetFormMethod-off
		Клиент = ПолучитьФорму("ВнешняяОбработка.КонтурДиадокМенеджерПлагинов.Форма.СписокПлагиновСервис");
		// BSLLS:GetFormMethod-on
	Иначе
		// BSLLS:GetFormMethod-off
		Клиент = ПолучитьФорму("Обработка.КонтурДиадокМенеджерПлагинов.Форма.СписокПлагиновСервис");
		// BSLLS:GetFormMethod-on
	КонецЕсли;
	
	Клиент.УстановитьКонфигурациюПриложения(КонфигурацияПриложения);
	Клиент.УстановитьКонфигурациюОбновлятора(КонфигурацияОбновлятора);
	Если ЗначениеЗаполнено(ХранилищеПлагинов) Тогда
		Клиент.УстановитьХранилищеПлагинов(ХранилищеПлагинов);
	КонецЕсли;
	Если НастройкиПрокси <> Неопределено Тогда
		Клиент.УстановитьНастройкиПрокси(НастройкиПрокси);
	КонецЕсли;

	Клиент.НачатьОткрытие(Оповещение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПредупреждение(Знач ИнформацияОбОшибке)
	
	ЗаписьЖурналаРегистрации(
		"Контур." + Объект_().Метаданные().Имя,
		УровеньЖурналаРегистрации.Предупреждение,
		Неопределено,
		Неопределено,
		ИнформацияОбОшибке.Описание);
		
КонецПроцедуры

&НаСервере
Функция КлючОбъектаКаталогОтладки()
	
	Возврат  КонфигурацияПриложения.Имя;
	
КонецФункции

&НаСервере
Функция КлючНастроекКаталогОтладки()
	
	Возврат "348276de-b7ae-4b7b-a93a-dc595a02d4e4";
	
КонецФункции

&НаСервере
Функция КаталогСуществуетНаСервере(Путь)

	Возврат КаталогСуществует(Путь);
	
КонецФункции

 &НаКлиентеНаСервереБезКонтекста
Функция КаталогСуществует(Путь)
	
	Файл = Новый Файл(Путь);
	Возврат Файл.Существует();
	
КонецФункции

&НаСервере
Процедура УстановитьКаталогОтладкиНаСервереИзНастроек()
	
	Если ЗначениеЗаполнено(КонфигурацияПриложения.КаталогОтладки) Тогда
		Если КаталогСуществуетНаСервере(КонфигурацияПриложения.КаталогОтладки) = Ложь Тогда
			ВызватьИсключение "Указанный каталог не валидный для отладки";
		КонецЕсли;
		КаталогОтладки = КонфигурацияПриложения.КаталогОтладки;
	Иначе
		КаталогОтладки = КаталогОтладкиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КаталогОтладкиНаСервере()

	Возврат ХранилищеОбщихНастроек.Загрузить(КлючОбъектаКаталогОтладки(), КлючНастроекКаталогОтладки());
	
КонецФункции

&НаСервере
Процедура СохранитькаталогОтладкиВНастройкиНаСервере(Значение)

	ХранилищеОбщихНастроек.Сохранить(КлючОбъектаКаталогОтладки(), КлючНастроекКаталогОтладки(), Значение);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПлагинНаСервере(ПутьДоКаталога)
	
	ОписаниеПлагина = ОписаниеПлагина();
	АдресХранилища = ДвоичныеДанныеПлагинаНаСервере(ОписаниеПлагина);
	
	Имя = ОписаниеПлагина.Ид;
	Расширение = РасширенияФайлаПоТипуКонтента(ОписаниеПлагина.ТипКонтента);
	Разделитель = Менеджер()._СтдОС().ПолучитьРазделительПутиЛок();
	
	Пути = Новый Массив;
	Пути.Добавить(ПутьДоКаталога);
	Пути.Добавить(Менеджер()._СтдСтр().СтрШаблонЛок("%1%2",  Имя, Расширение));
	
	Путь = Менеджер()._СтдОС().СоединитьПуть(Пути, Менеджер()._СтдОС().ПолучитьРазделительПутиЛок());
	ПолучитьИзВременногоХранилища(АдресХранилища).Записать(Путь);
	УдалитьИзВременногоХранилища(АдресХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКаталогОтладки(Оповещение)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог для сохранения плагина";
	Если ЗначениеЗаполнено(КаталогОтладки) Тогда
		Диалог.Каталог = КаталогОтладки;
	КонецЕсли;
	
	КлиентскиеМетоды()._Стд().Диалоги().ПоказатьДиалогВыбораФайла(Диалог, Оповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПлагиновНаСервере()
	
	Отбор = Менеджер().ХранилищеПлагинов().МодельОтборСписка();
	Отбор.Проект = КонфигурацияПриложения.Имя;
	
	Список = Менеджер().ХранилищеПлагинов().Список(Отбор); 
	ТаблицаПлагинов.Очистить();
	
	Для Каждого Элемент Из Список Цикл
		
		Строка = ТаблицаПлагинов.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Элемент);
		
		Строка.КартинкаОбновление = 1;
		Строка.КартинкаСостояние = 1;
		
		Если Строка.Состояние = СостоянияПлагина().Включен Тогда
			Строка.КартинкаСостояние = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПротестироватьПлагинНаСервере(ОписаниеПлагина)
	
	Менеджер().ПротестироватьПлагин(ОписаниеПлагина);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(Знач АдресХранилища, Знач ТипКонтента)
	
	Имя = Менеджер().ХранилищеПлагинов().ПодключитьВнешняяОбработка(АдресХранилища);
	Обработка = Новый(СтрЗаменить("ExternalDataProcessorObject.%1", "%1", Имя));
	Манифест = Обработка.МанифестПлагина();
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Контент = Менеджер().МодельКонтент();
	Контент.Имя = Манифест.Идентификатор;
	Контент.Данные = ДвоичныеДанные;
	Контент.Тип = ТипКонтента;	
	
	ОписаниеПлагина = Менеджер().МодельОписаниеПлагина();
	ОписаниеПлагина.Ид = Манифест.Идентификатор;
	ОписаниеПлагина.Представление = Манифест.Представление;
	ОписаниеПлагина.Версия = Манифест.Версия;
	ОписаниеПлагина.ТипКонтента = ТипКонтента;
	ОписаниеПлагина.Проект = КонфигурацияПриложения.Имя;
	
	Менеджер().ХранилищеПлагинов().Сохранить(ОписаниеПлагина, Контент);
	УдалитьИзВременногоХранилища(АдресХранилища);
	
	ПротестироватьПлагинНаСервере(ОписаниеПлагина);
	ОбновитьСписокПлагиновНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ДвоичныеДанныеПлагинаНаСервере(Знач ОписаниеПлагина)
	
	ХранилищеПлагина = Менеджер().ХранилищеПлагинов().Контент(ОписаниеПлагина);
	Если ХранилищеПлагина.Ссылка.Пустая() Тогда
		ВызватьИсключение "Не удалось получить объект хранилища плагина";
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ХранилищеПлагина.Хранилище.Получить(), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура УдалитьПлагинНаСервере()

	ОписаниеПлагина = ОписаниеПлагина();
	
	Менеджер().ХранилищеПлагинов().Удалить(ОписаниеПлагина);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьОбновленияНаСервере(Знач Ид, Знач Версия)
	
	ОписаниеПлагина = Менеджер().МодельОписаниеПлагина();
	ОписаниеПлагина.Ид = Ид;
	ОписаниеПлагина.Версия = Версия;
	ОписаниеПлагина.Проект = КонфигурацияПриложения.Имя;
	
	Возврат Менеджер().ПроверитьОбновления(ОписаниеПлагина);
	
КонецФункции

&НаСервере
Процедура ОтключитьПлагинНаСервере()
	
	ОписаниеПлагина = ОписаниеПлагина();
	
	Менеджер().ХранилищеПлагинов().Отключить(ОписаниеПлагина);
	
КонецПроцедуры

&НаСервере
Процедура ВключитьПлагинНаСервере()
	
	ОписаниеПлагина = ОписаниеПлагина();
	
	Менеджер().ХранилищеПлагинов().Включить(ОписаниеПлагина);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПлагинНаСервере()

	ОписаниеПлагина = ОписаниеПлагина();
	
	Менеджер().Обновить(ОписаниеПлагина);
	
	Плагин = Менеджер().ХранилищеПлагинов().Контент(ОписаниеПлагина);
	Строки = ТаблицаПлагинов.НайтиСтроки(Новый Структура("Ид", Плагин.Ид));
	Для Каждого Элемент Из Строки Цикл
		Элемент.Версия = Плагин.Версия;
		Элемент.ЕстьОбновление = Ложь;
		Элемент.КартинкаОбновление = 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция МанифестНаСервере()
	
	ОписаниеПлагина = ОписаниеПлагина();

	Возврат Менеджер().ХранилищеПлагинов().Манифест(ОписаниеПлагина);
	
КонецФункции

&НаСервере
Функция ОписаниеПлагина()
	
	ТекущиеДанные = ТаблицаПлагинов.НайтиПоИдентификатору(Элементы.ТаблицаПлагинов.ТекущаяСтрока);
	
	Результат = Менеджер().МодельОписаниеПлагина();
	Результат.Ид = ТекущиеДанные.Ид;
	Результат.Версия = ТекущиеДанные.Версия;                                                  
	Результат.Представление = ТекущиеДанные.Представление;         
	Результат.ТипКонтента = ТипКонтентаОбработка();
	Результат.Проект = КонфигурацияПриложения.Имя;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПередОткрытиемНастроекНаСервере()

	ОписаниеПлагина = ОписаниеПлагина();

	Контент = Менеджер().ХранилищеПлагинов().Контент(ОписаниеПлагина);   
	Адрес = ПоместитьВоВременноеХранилище(Контент.Хранилище.Получить());
	Имя = Менеджер().ХранилищеПлагинов().ПодключитьВнешняяОбработка(Адрес, ОписаниеПлагина.Ид);
	
	УдалитьИзВременногоХранилища(Адрес);
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Функция ТипКонтентаФайла(Файл)

	Если Файл.Расширение = ".epf" Тогда
		Результат = ТипКонтентаОбработка();
	ИначеЕсли Файл.Расширение = ".cfe" Тогда
		Результат = ТипКонтентаРасширение();
	Иначе
		ВызватьИсключение СтрЗаменить("Не ожидаемый тип плагина: %1", "%1", Файл.Расширение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РасширенияФайлаПоТипуКонтента(ТипКонтента)

	Если ТипКонтента = ТипКонтентаОбработка() Тогда
		Результат = ".epf";
	ИначеЕсли ТипКонтента = ТипКонтентаРасширение() Тогда
		Результат = ".cfe";
	Иначе
		ВызватьИсключение СтрЗаменить("Не ожидаемый тип контента: %1", "%1", ТипКонтента);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипКонтентаОбработка()
	
	Возврат "data-processor";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипКонтентаРасширение()
	
	Возврат "extension";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СостоянияПлагина()

	Результат = Новый Структура;
	Результат.Вставить("Включен", "Включен");
	Результат.Вставить("Отключен", "Отключен");
	Результат.Вставить("ТребуетсяНастройка", "Требуется настройка");
	
	Возврат Результат;
	
КонецФункции