////////////////////////////////////////////////////////////////////////////////
// Форма онбординга:
// - Параметр - ИдентификаторОнбординга - см. КонтурЛогистика_ОнбродингКлиентСервер.ТипыОнбординга()
// - Параметр - МиниТур - Массив строк из HTML страниц для отображения
// - Параметр - ИмяФормыВладельца - Строка с именем формы откуда был открыт онбродинг
// 
//	* Возникает проблема, когда форма установленная на начальной странице,
//		она не устанавливается Владельцем открываемой формы ПриОткрытии
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеСтраниц = Параметры.МиниТур;  
	КоличествоСтраниц = Параметры.МиниТур.Количество();
	
	СоздатьДинамическийИнтерфейс(КоличествоСтраниц, ДанныеСтраниц);
	
	УстановитьОформлениеЭлементов();
	
	ЗаполнитьHTMLПоля();
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ЭтаФорма.Высота = 25;
		ЭтаФорма.Ширина = 115;
	#КонецЕсли

	
КонецПроцедуры // ПриСозданииНаСервере

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(ТекущаяСтраница)
	
	НомерТекущейСтраницы = СтрЗаменить(ТекущаяСтраница.Имя, "Страница", "");
	
	УстановитьОформлениеЭлементов(НомерТекущейСтраницы);	
	
КонецПроцедуры // СтраницыПриСменеСтраницы

&НаКлиенте
Процедура ПриНажатииНаГиперссылку(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоСсылке(ДанныеСобытия.Href);
		
		Метрика_ПерейтиКВидео(ДанныеСобытия.Href);
		
	КонецЕсли;
	
КонецПроцедуры // ПриНажатииНаГиперссылку

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Назад(Команда)
	
	НомерСтраницы = Число(СтрЗаменить(Элементы.Страницы.ТекущаяСтраница.Имя, "Страница", ""));
	
	Элементы.Страницы.ТекущаяСтраница = Элементы["Страница" + (НомерСтраницы - 1)];
	СтраницыПриСменеСтраницы(Элементы.Страницы.ТекущаяСтраница);
	
КонецПроцедуры // Назад

&НаКлиенте
Процедура Далее(Команда)
	
	НомерСтраницы = Число(СтрЗаменить(Элементы.Страницы.ТекущаяСтраница.Имя, "Страница", ""));
	
	Элементы.Страницы.ТекущаяСтраница = Элементы["Страница" + (НомерСтраницы + 1)];
	СтраницыПриСменеСтраницы(Элементы.Страницы.ТекущаяСтраница);
	
	Метрика_Далее();
	
КонецПроцедуры // Далее

&НаКлиенте
Процедура ПродолжитьРаботу(Команда)
	
	Метрика_ПродолжитьРаботу();
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры // ПродолжитьРаботу

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьHTMLПоля()
	
	Для НомерСтраницы = 0 По Параметры.МиниТур.Количество() - 1 Цикл
		
		ЭтаФорма["ПолеHTMLДокумента" + (НомерСтраницы + 1)] = Параметры.МиниТур[НомерСтраницы];
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьHTMLПоля

&НаСервере
Процедура СоздатьДинамическийИнтерфейс(КоличествоСтраниц, ДанныеСтраниц)
	
	СоздатьРеквизиты(КоличествоСтраниц);
	
	ЭлементСтраницы = СоздатьГруппуСтраницы();
	ЭлементГруппаКоманд = СоздатьГруппуКоманд();
	
	СоздатьКнопкуНазад(ЭлементГруппаКоманд);
	
	Для НомерСтраницы = 1 По КоличествоСтраниц Цикл
		
		ЭлементСтраница = СоздатьСтраницу(ЭлементСтраницы, НомерСтраницы);
		
		ЭлементПолеHTML = СоздатьПолеHTMLДокументаНаСтранице(ЭлементСтраница, НомерСтраницы);
		
	КонецЦикла;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		СоздатьДекарациюДляРастягивания(ЭлементГруппаКоманд);
	#КонецЕсли
	
	СоздатьКнопкуДалее(ЭлементГруппаКоманд);
	СоздатьКнопкуПродолжитьРаботу(ЭлементГруппаКоманд);
	
КонецПроцедуры // СоздатьДинамическийИнтерфейс

&НаСервере
Функция СоздатьГруппуСтраницы()
	
	ИмяГруппы = "Страницы";
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
	СтруктураСвойств.Вставить("ТолькоПросмотр", Ложь);
	
	ЭлементСтраницы = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаСтраниц(ЭтаФорма, ИмяГруппы, ЭтаФорма,,,,СтруктураСвойств);
	
	Возврат ЭлементСтраницы;
	
КонецФункции // СоздатьГруппуСтраницы

&НаСервере
Функция СоздатьСтраницу(ЭлементСтраницы, Номер)
	
	ИмяСтраницы = "Страница" + Строка(Номер);
	ГруппаСтраницы = ЭлементСтраницы;
	ЗаголовокЭлемента = "";
	
	СтруктураСвойств = Новый Структура;
	
	ЭлементСтраница = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздСтраница(ЭтаФорма, ИмяСтраницы, ГруппаСтраницы, ЗаголовокЭлемента,,,,СтруктураСвойств);
	
	Возврат ЭлементСтраница;
	
КонецФункции // СоздатьСтраницу

&НаСервере
Функция СоздатьГруппуКоманд()
	
	ИмяГруппы = "ГруппаКоманд";
	РастягиватьГоризонтально = 2;
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	СтруктураСвойств.Вставить("РастягиватьПоГоризонтали", Истина);
	
	ЭлементГруппа = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычнаяБезОтображения(ЭтаФорма, ИмяГруппы, ЭтаФорма,,РастягиватьГоризонтально,,СтруктураСвойств); 	
	
	Возврат ЭлементГруппа;
	
КонецФункции // СоздатьГруппуКоманд

&НаСервере
Процедура СоздатьДекарациюДляРастягивания(Родитель)
	
	ИмяДекорации = "ДекорацияРастягивания";                                                                                     
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("РастягиватьПоГоризонтали", Истина);
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(ЭтаФорма, ИмяДекорации, Родитель, СтруктураСвойств);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизиты(КоличествоСтраниц)
	
	СтруктураРеквизитов = Новый Структура;
	
	ОписаниеТипаСтрока = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.ОписаниеТипаСтрока();
	
	Для НомерСтраницы = 1 По КоличествоСтраниц Цикл
		
		СтруктураРеквизитов.Вставить("ПолеHTMLДокумента" + Строка(НомерСтраницы), ОписаниеТипаСтрока); 
		
	КонецЦикла;
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьРеквизиты(ЭтаФорма, СтруктураРеквизитов);	
	
КонецПроцедуры // СоздатьРеквизиты

&НаСервере
Функция СоздатьПолеHTMLДокументаНаСтранице(ЭлементСтраница, НомерСтраницы)
	
	ИмяПоля = "ПолеHTMLДокумента" + Строка(НомерСтраницы);
	РодительПоля = ЭлементСтраница; 
	ЗаголовокЭлемента = "1";
	ШифрВидаПоля = 6; // ПолеHTMLДокумента 
	ПутьКДанным = "ПолеHTMLДокумента" + Строка(НомерСтраницы);
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	СтруктураСвойств.Вставить("ЦветРамки", Новый Цвет(255, 255, 255));
	СтруктураСвойств.Вставить("ПропускатьПриВводе", Истина);
	СтруктураСвойств.Вставить("РастягиватьПоГоризонтали", Истина);
	СтруктураСвойств.Вставить("РастягиватьПоВертикали", Истина);
	
	СтруктураСобытий = Новый Структура;
	СтруктураСобытий.Вставить("ПриНажатии", "ПриНажатииНаГиперссылку");
	
	ЭлементПолеHTML = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздПоле(ЭтаФорма, ИмяПоля, РодительПоля, ЗаголовокЭлемента, ШифрВидаПоля, ПутьКДанным, СтруктураСвойств, СтруктураСобытий);
	
	Возврат ЭлементПолеHTML;	
	
КонецФункции // СоздатьПолеHTMLДокументаНаСтранице

&НаСервере
Процедура СоздатьКнопкуНазад(ЭлементГруппаКоманд)
	
	ИмяКоманды = "Назад";
	ЗаголовокЭлемента = "Назад";
	ИмяДействия = "Назад";
	
	СтруктураСвойств = Неопределено;
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, ИмяКоманды, ЗаголовокЭлемента, ИмяДействия, СтруктураСвойств);
	
	ИмяКнопки = "Назад";
	РодительКнопки = ЭлементГруппаКоманд;
	ЗаголовокКнопки = "Назад";
	ИмяКоманды = "Назад";	
	ВидКнопки = 0;
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Ширина", 12);
	СтруктураСвойств.Вставить("РастягиватьПоГоризонтали", Ложь);
	СтруктураСвойств.Вставить("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеЭлемента.Право);
	СтруктураСвойств.Вставить("Шрифт ", Новый Шрифт(, 10, Истина));
	СтруктураСвойств.Вставить("ЦветТекста ", Новый Цвет(77, 77, 77));
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(ЭтаФорма, ИмяКнопки, РодительКнопки, ЗаголовокКнопки, ИмяКоманды, ВидКнопки, СтруктураСвойств);
	
КонецПроцедуры // СоздатьКнопкуНазад

&НаСервере
Процедура СоздатьКнопкуДалее(ЭлементГруппаКоманд)
	
	ИмяКоманды = "Далее";
	ЗаголовокЭлемента = "Далее";
	ИмяДействия = "Далее";
	
	СтруктураСвойств = Неопределено;
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, ИмяКоманды, ЗаголовокЭлемента, ИмяДействия, СтруктураСвойств);
	
	ИмяКнопки = "Далее";
	РодительКнопки = ЭлементГруппаКоманд;
	ЗаголовокКнопки = "Далее";
	ИмяКоманды = "Далее";	
	ВидКнопки = 0;
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Ширина", 12);
	СтруктураСвойств.Вставить("РастягиватьПоГоризонтали", Ложь);
	СтруктураСвойств.Вставить("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеЭлемента.Право);
	СтруктураСвойств.Вставить("Шрифт ", Новый Шрифт(, 10, Истина));
	СтруктураСвойств.Вставить("ЦветФона ", Новый Цвет(250, 233, 96));
	СтруктураСвойств.Вставить("ЦветТекста ", Новый Цвет(77, 77, 77));
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(ЭтаФорма, ИмяКнопки, РодительКнопки, ЗаголовокКнопки, ИмяКоманды, ВидКнопки, СтруктураСвойств);
	
КонецПроцедуры // СоздатьКнопкуДалее

&НаСервере
Процедура СоздатьКнопкуПродолжитьРаботу(ЭлементГруппаКоманд)
	
	ИмяКоманды = "ПродолжитьРаботу";
	ЗаголовокЭлемента = "Продолжить работу";
	ИмяДействия = "ПродолжитьРаботу";
	
	СтруктураСвойств = Неопределено;
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьКоманду(ЭтаФорма, ИмяКоманды, ЗаголовокЭлемента, ИмяДействия, СтруктураСвойств);
	
	ИмяКнопки = "ПродолжитьРаботу";
	РодительКнопки = ЭлементГруппаКоманд;
	ЗаголовокКнопки = "Продолжить работу";
	ИмяКоманды = "ПродолжитьРаботу";	
	ВидКнопки = 0;
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Ширина", 20);
	СтруктураСвойств.Вставить("РастягиватьПоГоризонтали", Ложь);
	СтруктураСвойств.Вставить("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеЭлемента.Право);
	СтруктураСвойств.Вставить("Шрифт ", Новый Шрифт(, 10, Истина));
	СтруктураСвойств.Вставить("ЦветФона ", Новый Цвет(250, 233, 96));
	СтруктураСвойств.Вставить("ЦветТекста ", Новый Цвет(77, 77, 77));
	
	КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКнопка(ЭтаФорма, ИмяКнопки, РодительКнопки, ЗаголовокКнопки, ИмяКоманды, ВидКнопки, СтруктураСвойств);
	
КонецПроцедуры // СоздатьКнопкуПродолжитьРаботу

&НаСервере
Процедура УстановитьОформлениеЭлементов(Знач НомерТекущейСтраницы = 1)
	
	НомерТекущейСтраницы = Число(НомерТекущейСтраницы);
	
	Если НомерТекущейСтраницы = 1 Тогда 
		Элементы.Назад.Видимость = Ложь;
	Иначе
		Элементы.Назад.Видимость = Истина;
	КонецЕсли;
	
	Если НомерТекущейСтраницы = Параметры.МиниТур.Количество() Тогда
		Элементы.Далее.Видимость = Ложь;
		Элементы.ПродолжитьРаботу.Видимость = Истина;
		
	Иначе
		Элементы.Далее.Видимость = Истина;
		Элементы.ПродолжитьРаботу.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьОформлениеЭлементов

&НаКлиенте
Функция ИмяФормыВладельца()
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		ИмяФормыВладельца = Параметры.ИмяФормыВладельца;
	Иначе
		ИмяФормыВладельца = ЭтаФорма.ВладелецФормы.ИмяФормы;
	КонецЕсли;
	
	Возврат ИмяФормыВладельца;
	
КонецФункции

&НаКлиенте
Процедура Метрика_ПерейтиКВидео(СсылкаНаВидео)
	
	НомерСтраницы = СтрЗаменить(Элементы.Страницы.ТекущаяСтраница.Имя, "Страница", "");
	
	ДопИнформация = Новый Структура;
	ДопИнформация.Вставить("ИдентификаторОнбординга", Параметры.ИдентификаторОнбординга);
	ДопИнформация.Вставить("Ссылка", СсылкаНаВидео);
	ДопИнформация.Вставить("НомерСтраницы", НомерСтраницы);
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Онбординг", "Перейти к видео", 
	"Обработка.КонтурЛогистика_Онбординг.Форма.Форма", ИмяФормыВладельца(), Ложь, ДопИнформация);
	
КонецПроцедуры // Метрика_ПерейтиКВидео

&НаКлиенте
Процедура Метрика_Далее()
	
	НомерСтраницы = СтрЗаменить(Элементы.Страницы.ТекущаяСтраница.Имя, "Страница", "");
	
	ДопИнформация = Новый Структура;
	ДопИнформация.Вставить("ИдентификаторОнбординга", Параметры.ИдентификаторОнбординга);
	ДопИнформация.Вставить("НомерСтраницы", НомерСтраницы);
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Онбординг", "Нажать далее", 
	"Обработка.КонтурЛогистика_Онбординг.Форма.Форма", ИмяФормыВладельца(), Ложь, ДопИнформация);
	
КонецПроцедуры // Метрика_Далее

&НаКлиенте
Процедура Метрика_ПродолжитьРаботу()
	
	НомерСтраницы = СтрЗаменить(Элементы.Страницы.ТекущаяСтраница.Имя, "Страница", "");
	
	ДопИнформация = Новый Структура;
	ДопИнформация.Вставить("ИдентификаторОнбординга", Параметры.ИдентификаторОнбординга);
	ДопИнформация.Вставить("НомерСтраницы", НомерСтраницы);
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Онбординг", "Продолжить работу", 
	"Обработка.КонтурЛогистика_Онбординг.Форма.Форма", ИмяФормыВладельца(), Ложь, ДопИнформация);
	
КонецПроцедуры // Метрика_ПродолжитьРаботу

#КонецОбласти

