#Область ПрограммныйИнтерфейс

// Номенклатура является алкогольной маркируемой продукцией.
// 
// Параметры:
//  Номенклатура - ОпределяемыйТип.Номенклатура - Номенклатура
// 
// Возвращаемое значение:
//  Булево - Номенклатура является алкогольной маркируемой продукцией
Функция НоменклатураЯвляетсяАлкогольнойМаркируемойПродукцией(Номенклатура) Экспорт
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Описание = ОбщегоНазначенияИС.ОписаниеНоменклатуры(Номенклатура);
	Возврат ОбщегоНазначенияИСПовтИсп.ЭтоМаркируемаяПродукцияЕГАИС(Описание.КлючВидовПродукции);
	
КонецФункции

#Область ОбработкаШтрихкодов

#Область ПолучениеДанныхПоШтрихкодам

Процедура ЗаписатьДанныеВыбораПоАкцизнойМарке(ДанныеШтрихкода, ДанныеВыбора) Экспорт
	
	Если ЗначениеЗаполнено(ДанныеШтрихкода.ШтрихкодУпаковки) Тогда
		
		НовыеРеквизиты = Новый Структура;
		НовыеРеквизиты.Вставить("Номенклатура",   ДанныеВыбора.Номенклатура);
		НовыеРеквизиты.Вставить("Характеристика", ДанныеВыбора.Характеристика);
		НовыеРеквизиты.Вставить("Серия",          ДанныеВыбора.Серия);
		
		Справочники.ШтрихкодыУпаковокТоваров.ИзменитьШтрихкодУпаковки(
			ДанныеШтрихкода.ШтрихкодУпаковки, НовыеРеквизиты);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШтрихкода.АлкогольнаяПродукция) Тогда
		
		СоответствиеНоменклатурыЕГАИС = РегистрыСведений.СоответствиеНоменклатурыЕГАИС.СоздатьМенеджерЗаписи();
		СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция = ДанныеШтрихкода.АлкогольнаяПродукция;
		СоответствиеНоменклатурыЕГАИС.Номенклатура         = ДанныеШтрихкода.Номенклатура;
		СоответствиеНоменклатурыЕГАИС.Характеристика       = ДанныеШтрихкода.Характеристика;
		СоответствиеНоменклатурыЕГАИС.Серия                = ДанныеШтрихкода.Серия;
		СоответствиеНоменклатурыЕГАИС.Справка2             = ДанныеШтрихкода.Справка2;
		СоответствиеНоменклатурыЕГАИС.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокументов

// Удаляет акцизные марки по идентификаторам строк.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма.
//  Данные - Массив Из Строка - Идентификаторы строк акцизных марок.
//
Процедура УдалитьАкцизныеМаркиЧека(Форма, Данные) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		Источник = Форма.Объект;
	Иначе
		Источник = Форма;
	КонецЕсли;
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		ИдентификаторыСтрок = Данные;
	Иначе
		ИдентификаторыСтрок = Новый Массив;
		ИдентификаторыСтрок.Добавить(Данные);
	КонецЕсли;
	
	Для Каждого ИдентификаторСтроки Из ИдентификаторыСтрок Цикл
		
		Отбор = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
		НайденныеСтроки = Источник.АкцизныеМарки.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			Источник.АкцизныеМарки.Удалить(Источник.АкцизныеМарки.Индекс(СтрокаТЧ));
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Удаляет акцизные марки по справкам 2.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  Данные - Массив Из СправочникСсылка.Справки2ЕГАИС - Справки 2.
//
Процедура УдалитьАкцизныеМаркиПоСправкам2(Форма, Данные) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		Источник = Форма.Объект;
	Иначе
		Источник = Форма;
	КонецЕсли;
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Справки2 = Данные;
	Иначе
		Справки2 = Новый Массив;
		Справки2.Добавить(Данные);
	КонецЕсли;
	
	Для Каждого Справка2 Из Справки2 Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Справка2", Справка2);
		НайденныеСтроки = Источник.Товары.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			АкцизныеМаркиСтрокиТЧ = Источник.АкцизныеМарки.НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаТЧ Из АкцизныеМаркиСтрокиТЧ Цикл
				Источник.АкцизныеМарки.Удалить(СтрокаТЧ);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыЗаполненияТоваровИАкцизныхМарок(Контекст, ДобавлятьКоличество = Истина, ПараметрыСканирования = Неопределено) Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ДобавлятьКоличество",            ДобавлятьКоличество);
	ПараметрыЗаполнения.Вставить("ИзмененныеСтроки",               Новый Массив);
	ПараметрыЗаполнения.Вставить("ДобавленныеСтроки",              Новый Массив);
	ПараметрыЗаполнения.Вставить("ЕстьСправка2",                   Истина);
	ПараметрыЗаполнения.Вставить("ТолькоПустаяСправка2",           Ложь);
	ПараметрыЗаполнения.Вставить("УчитыватьСерии",                 Истина);
	ПараметрыЗаполнения.Вставить("ТекущаяСтрока",                  Неопределено);
	ПараметрыЗаполнения.Вставить("ЕстьКоличествоАкцизныхМарок",    ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения"));
	ПараметрыЗаполнения.Вставить("ПараметрыУказанияСерий",         Неопределено);
	ПараметрыЗаполнения.Вставить("ИмяКолонкиАлкогольнаяПродукция", "АлкогольнаяПродукция");
	ПараметрыЗаполнения.Вставить("ИмяКолонкиКоличество",           "Количество");
	ПараметрыЗаполнения.Вставить("ИмяКолонкиКоличествоУпаковок",   "КоличествоУпаковок");
	ПараметрыЗаполнения.Вставить("МаркируемаяАлкогольнаяПродукция", Неопределено);
	ПараметрыЗаполнения.Вставить("ИмпортПроизводство",              Неопределено);
	ПараметрыЗаполнения.Вставить("ЗаполнитьКрепость",               Ложь);
	ПараметрыЗаполнения.Вставить("ИмяТабличнойЧастиТовары",         "Товары");
	
	Если ПараметрыСканирования = Неопределено Тогда
		ПараметрыЗаполнения.Вставить("ПараметрыСканирования", ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Контекст));
	Иначе
		ПараметрыЗаполнения.Вставить("ПараметрыСканирования", ПараметрыСканирования);
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Заполняет табличную часть Товары по данным дерева упаковок.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - Заполняемый документ.
//  ДеревоУпаковок - ДеревоЗначений - дерево упаковок.
//  УпаковкаВерхнегоУровня - СправочникСсылка.ШтрихкодыУпаковокТоваров - Упаковка верхнего уровня.
//
Процедура ЗаполнитьТовары(ДокументОбъект, ДеревоУпаковок, ПараметрыЗаполнения) Экспорт
	
	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		
		Если СтрокаДерева.ТипУпаковки = Перечисления.ПрочиеЗоныПересчетаАлкогольнойПродукции.БутылкиБезКоробки Тогда
			
			ЗаполнитьТовары(
				ДокументОбъект, СтрокаДерева, ПараметрыЗаполнения);
			
			Продолжить;
			
		КонецЕсли;
		
		Если СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар Тогда
			КоличествоАкцизныхМарок = 1;
		Иначе
			КоличествоАкцизныхМарок = СтрокаДерева.КоличествоАкцизныхМарок;
		КонецЕсли;
		
		Если СтрокаДерева.АлкогольнаяПродукция <> Неопределено
			И СтрокаДерева.Номенклатура <> Неопределено
			И СтрокаДерева.Характеристика <> Неопределено
			И СтрокаДерева.Справка2 <> Неопределено Тогда
			
			ЗаполнитьТоварИзСтроки(ДокументОбъект, СтрокаДерева, ПараметрыЗаполнения, КоличествоАкцизныхМарок);
			
		Иначе
			
			ЗаполнитьТовары(
				ДокументОбъект, СтрокаДерева, ПараметрыЗаполнения);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет табличные части Акцизные марки и Товары по данным дерева упаковок.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - Заполняемый документ.
//  ДеревоУпаковок - ДеревоЗначений - дерево упаковок.
//  УпаковкаВерхнегоУровня - СправочникСсылка.ШтрихкодыУпаковокТоваров - Упаковка верхнего уровня.
//
Процедура ЗаполнитьТоварыИАкцизныеМарки(ДокументОбъект, ДеревоУпаковок, ПараметрыЗаполнения, УпаковкаВерхнегоУровня = Неопределено, ЗаполнятьТолькоТовары = Ложь) Экспорт
	
	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		
		Если СтрокаДерева.ТипУпаковки = Перечисления.ПрочиеЗоныПересчетаАлкогольнойПродукции.БутылкиБезКоробки
			Или ГрупповаяОбработкаШтрихкодовИС.ЭтоАгрегатТСД(СтрокаДерева.Штрихкод) Тогда
			
			ЗаполнитьТоварыИАкцизныеМарки(
				ДокументОбъект, СтрокаДерева, ПараметрыЗаполнения,
				УпаковкаВерхнегоУровня);
			
			Продолжить;
			
		КонецЕсли;
		
		ЭтоЧастичноеВыбытие = СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар
			И ШтрихкодированиеЕГАИСКлиентСервер.ЭтоЧастичноеВыбытие(СтрокаДерева);

		Если УпаковкаВерхнегоУровня = Неопределено
			И СтрокаДерева.ТипУпаковки <> Перечисления.ТипыУпаковок.МаркированныйТовар Тогда
			УпаковкаВерхнегоУровняСтрокиДерева = СтрокаДерева.ШтрихкодУпаковки;
		Иначе
			УпаковкаВерхнегоУровняСтрокиДерева = УпаковкаВерхнегоУровня;
		КонецЕсли;
		
		Коэффициент = 1;
		Если СтрокаДерева.Коэффициент <> Неопределено И СтрокаДерева.Коэффициент > 0 Тогда
			Коэффициент = Окр(СтрокаДерева.Коэффициент, 3);
		КонецЕсли;
		
		Если СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар Тогда
			КоличествоАкцизныхМарок = 1;
			Если ЭтоЧастичноеВыбытие Тогда
				КоличествоПродукции = СтрокаДерева.ЧастичноеВыбытиеКоличество;
			Иначе
				КоличествоПродукции = Коэффициент;
			КонецЕсли;
		ИначеЕсли СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.НеЯвляетсяУпаковкой Тогда
			КоличествоПродукции = СтрокаДерева.Количество * Коэффициент;
		Иначе
			КоличествоАкцизныхМарок = СтрокаДерева.КоличествоАкцизныхМарок;
			КоличествоПродукции = КоличествоАкцизныхМарок;
		КонецЕсли;
		
		Если ПараметрыЗаполнения.ТолькоПустаяСправка2 Тогда
			Справка2 = Справочники.Справки2ЕГАИС.ПустаяСсылка();
		Иначе
			Справка2 = СтрокаДерева.Справка2;
		КонецЕсли;
		
		ФлагЗаполнятьТолькоТовары = ЗаполнятьТолькоТовары;
		Если Не ФлагЗаполнятьТолькоТовары
			И ЗначениеЗаполнено(Справка2) Тогда
			
			ФлагЗаполнятьТолькоТовары = Истина;
			
			СтрокаТЧАкцизныеМарки = ДокументОбъект.АкцизныеМарки.Добавить();
			СтрокаТЧАкцизныеМарки.АкцизнаяМарка = СтрокаДерева.ШтрихкодУпаковки;
			СтрокаТЧАкцизныеМарки.Справка2      = Справка2;
			СтрокаТЧАкцизныеМарки.Количество    = КоличествоАкцизныхМарок;
			
			Если СтрокаДерева.ШтрихкодУпаковки <> УпаковкаВерхнегоУровняСтрокиДерева Тогда
				СтрокаТЧАкцизныеМарки.ШтрихкодУпаковки = УпаковкаВерхнегоУровняСтрокиДерева;
			КонецЕсли;
			
			Если ЭтоЧастичноеВыбытие Тогда
				СтрокаТЧАкцизныеМарки.ЧастичноеВыбытиеКоличество     = СтрокаДерева.ЧастичноеВыбытиеКоличество;
				СтрокаТЧАкцизныеМарки.ЧастичноеВыбытиеВариантУчета   = СтрокаДерева.ЧастичноеВыбытиеВариантУчета;
				СтрокаТЧАкцизныеМарки.ЧастичноеВыбытиеНоменклатура   = СтрокаДерева.Номенклатура;
				СтрокаТЧАкцизныеМарки.ЧастичноеВыбытиеХарактеристика = СтрокаДерева.Характеристика;
				СтрокаТЧАкцизныеМарки.ВыбытиеБутылки                 = СтрокаДерева.ВыбытиеБутылки;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар
			Или СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.НеЯвляетсяУпаковкой Тогда
			
			СтрокаТЧТовары = ЗаполнитьТоварИзСтроки(ДокументОбъект, СтрокаДерева, ПараметрыЗаполнения, КоличествоПродукции);
			
			Если Не ФлагЗаполнятьТолькоТовары Тогда
				
				Если Не ЗначениеЗаполнено(СтрокаТЧТовары.ИдентификаторСтроки) Тогда
					СтрокаТЧТовары.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
				КонецЕсли;
				
				СтрокаТЧАкцизныеМарки = ДокументОбъект.АкцизныеМарки.Добавить();
				СтрокаТЧАкцизныеМарки.ИдентификаторСтроки = СтрокаТЧТовары.ИдентификаторСтроки;
				СтрокаТЧАкцизныеМарки.АкцизнаяМарка       = СтрокаДерева.ШтрихкодУпаковки;
				СтрокаТЧАкцизныеМарки.Количество          = КоличествоАкцизныхМарок;
				
				Если СтрокаДерева.ШтрихкодУпаковки <> УпаковкаВерхнегоУровняСтрокиДерева Тогда
					СтрокаТЧАкцизныеМарки.ШтрихкодУпаковки = УпаковкаВерхнегоУровняСтрокиДерева;
				КонецЕсли;
				
				Если ЭтоЧастичноеВыбытие Тогда
					СтрокаТЧАкцизныеМарки.ЧастичноеВыбытиеКоличество     = СтрокаДерева.ЧастичноеВыбытиеКоличество;
					СтрокаТЧАкцизныеМарки.ЧастичноеВыбытиеВариантУчета   = СтрокаДерева.ЧастичноеВыбытиеВариантУчета;
					СтрокаТЧАкцизныеМарки.ЧастичноеВыбытиеНоменклатура   = СтрокаДерева.Номенклатура;
					СтрокаТЧАкцизныеМарки.ЧастичноеВыбытиеХарактеристика = СтрокаДерева.Характеристика;
					СтрокаТЧАкцизныеМарки.ВыбытиеБутылки                 = СтрокаДерева.ВыбытиеБутылки;
				КонецЕсли;

			КонецЕсли;
			
		Иначе
			
			Если УпаковкаВерхнегоУровняСтрокиДерева = Неопределено
				И СтрокаДерева.ТипУпаковки <> Перечисления.ТипыУпаковок.МаркированныйТовар Тогда
				УпаковкаВерхнегоУровняСтрокиДерева = СтрокаДерева.ШтрихкодУпаковки;
			КонецЕсли;
			
			ЗаполнитьТоварыИАкцизныеМарки(
				ДокументОбъект, СтрокаДерева, ПараметрыЗаполнения,
				УпаковкаВерхнегоУровняСтрокиДерева, ФлагЗаполнятьТолькоТовары);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ЗавершениеПроверкиПродукции

// Отразить результаты проверки и подбора: общая механика.
// 1. Распределяет подобранную продукцию по имеющимся строкам документа
// 2. Выполняет обработчики с добавленными/измененными строками (процедура вызывающего модуля)
// 3. Загружает полученные товары и штрихкоды упаковок в документ
// 4. Перезаписывает или перепроводит документ
// 
// Параметры:
//  Менеджер - ДокументМенеджер - Менеджер обработчика добавленных и измененных строк
//  ПараметрыОкончанияПроверки - См. ПроверкаИПодборПродукцииИС.ЗафиксироватьРезультатПроверкиИПодбора
//  ЕстьСправка2 - Булево - Есть колонка "Справка2" в таблице где завершается проверка
//  ИмяТаблицы - Строка - Имя таблицы документа где завершается проверка
//  ПреобразовыватьТаблицуШтрихкодов - Булево - Преобразовывать таблицу штрихкодов в "АкцизныеМарки"
Процедура ОтразитьРезультатыПроверкиИПодбора(Менеджер, ПараметрыОкончанияПроверки,
	ЕстьСправка2 = Истина, ИмяТаблицы = "Товары", ПреобразовыватьТаблицуШтрихкодов = Истина) Экспорт
	
	ТаблицаПродукции = ПараметрыОкончанияПроверки.ТаблицаПодобраннойПровереннойПродукции;
	ТаблицаШтрихкодов  = ПараметрыОкончанияПроверки.ТаблицаШтрихкодовВерхнегоУровня;
	
	ДокументОбъект = ПараметрыОкончанияПроверки.ПроверяемыйДокумент.ПолучитьОбъект();
	
	Товары = ДокументОбъект[ИмяТаблицы].Выгрузить();
	Товары.Колонки.Добавить("КоличествоДо", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Удалить", Новый ОписаниеТипов("Булево"));
	
	ЭтоПроверкаПиваИмпортПроизводство = (ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОтчетОбИмпортеЕГАИС"))
		Или (ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОтчетОПроизводствеЕГАИС")
			И ПараметрыОкончанияПроверки.Сценарий = 0);
	
	ОписаниеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(Товары.ВыгрузитьКолонку("Номенклатура"));
	Для Каждого СтрокаТовары Из Товары Цикл
		СтрокаТовары.КоличествоДо = СтрокаТовары.Количество;
		СтрокаТовары.Количество = 0;
		СтрокаТовары.Удалить = ЭтоПроверкаПиваИмпортПроизводство
			Или ОбщегоНазначенияИСПовтИсп.ЭтоМаркируемаяПродукцияЕГАИС(
				ОписаниеНоменклатуры[СтрокаТовары.Номенклатура].КлючВидовПродукции);
	КонецЦикла;
	
	ПараметрыЗаполнения = ПараметрыЗаполненияТоваровИАкцизныхМарок(ДокументОбъект, Ложь);
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОтчетОПроизводствеЕГАИС") И ПараметрыОкончанияПроверки.Сценарий = 1 Тогда
		ПараметрыЗаполнения.ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(
			ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.КонтекстФормыСУказаниемСценария(ДокументОбъект, 1));
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаПродукции Цикл
		
		Заполнить = СтрокаТаблицы.КоличествоПодобрано;
		Если Заполнить = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура",         СтрокаТаблицы.Номенклатура);
		ПараметрыОтбора.Вставить("Характеристика",       СтрокаТаблицы.Характеристика);
		ПараметрыОтбора.Вставить("Серия",                СтрокаТаблицы.Серия);
		ПараметрыОтбора.Вставить("АлкогольнаяПродукция", СтрокаТаблицы.АлкогольнаяПродукция);
		
		Если ЕстьСправка2 Тогда
			ПараметрыОтбора.Вставить("Справка2",         СтрокаТаблицы.Справка2);
		КонецЕсли;
		
		НайденныеСтроки = Товары.НайтиСтроки(ПараметрыОтбора);
		НайденныеСтрокиСНезаполненнойСправкой2 = Новый Массив;
		Если ЕстьСправка2 И ЗначениеЗаполнено(СтрокаТаблицы.Справка2) Тогда
			ПараметрыОтбора.Справка2 = Справочники.Справки2ЕГАИС.ПустаяСсылка();
			НайденныеСтрокиСНезаполненнойСправкой2 = Товары.НайтиСтроки(ПараметрыОтбора);
		КонецЕсли;
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого СтрокаТовары Из НайденныеСтроки Цикл
				ЗаполнитьПоСтроке = Мин(Заполнить, СтрокаТовары.КоличествоДо - СтрокаТовары.Количество);
				Если ЗаполнитьПоСтроке = 0 Тогда
					Продолжить;
				КонецЕсли;
				Если ПараметрыЗаполнения.ДобавленныеСтроки.Найти(СтрокаТовары) = Неопределено
					И ПараметрыЗаполнения.ИзмененныеСтроки.Найти(СтрокаТовары) = Неопределено Тогда
					ПараметрыЗаполнения.ИзмененныеСтроки.Добавить(СтрокаТовары);
				КонецЕсли;
				СтрокаТовары.Количество = СтрокаТовары.Количество + ЗаполнитьПоСтроке;
				СтрокаТовары.Удалить = Ложь;
				Заполнить = Заполнить - ЗаполнитьПоСтроке;
			КонецЦикла;
			Если Заполнить > 0 Тогда
				СтрокаТовары = НайденныеСтроки[0];
				Если ПараметрыЗаполнения.ДобавленныеСтроки.Найти(СтрокаТовары) = Неопределено
					И ПараметрыЗаполнения.ИзмененныеСтроки.Найти(СтрокаТовары) = Неопределено Тогда
					ПараметрыЗаполнения.ИзмененныеСтроки.Добавить(СтрокаТовары);
				КонецЕсли;
				СтрокаТовары.Количество = СтрокаТовары.Количество + Заполнить;
				СтрокаТовары.Удалить = Ложь;
			КонецЕсли;
		ИначеЕсли НайденныеСтрокиСНезаполненнойСправкой2.Количество() > 0 Тогда
			Для Каждого СтрокаТовары Из НайденныеСтрокиСНезаполненнойСправкой2 Цикл
				ЗаполнитьПоСтроке = Мин(Заполнить, СтрокаТовары.КоличествоДо - СтрокаТовары.Количество);
				Если ЗаполнитьПоСтроке = 0 Тогда
					Продолжить;
				КонецЕсли;
				Если ПараметрыЗаполнения.ДобавленныеСтроки.Найти(СтрокаТовары) = Неопределено
					И ПараметрыЗаполнения.ИзмененныеСтроки.Найти(СтрокаТовары) = Неопределено Тогда
					ПараметрыЗаполнения.ИзмененныеСтроки.Добавить(СтрокаТовары);
				КонецЕсли;
				Если ЗаполнитьПоСтроке < СтрокаТовары.КоличествоДо Тогда
					СтрокаБезСправки2 = Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаБезСправки2, СтрокаТовары);
				КонецЕсли;	
				СтрокаТовары.Количество = ЗаполнитьПоСтроке;
				СтрокаТовары.Удалить = Ложь;
				СтрокаТовары.Справка2 = СтрокаТаблицы.Справка2;
				Заполнить = Заполнить - ЗаполнитьПоСтроке;
			КонецЦикла;
			Если Заполнить > 0 Тогда
				СтрокаТовары = НайденныеСтрокиСНезаполненнойСправкой2[0];
				Если ПараметрыЗаполнения.ДобавленныеСтроки.Найти(СтрокаТовары) = Неопределено
					И ПараметрыЗаполнения.ИзмененныеСтроки.Найти(СтрокаТовары) = Неопределено Тогда
					ПараметрыЗаполнения.ИзмененныеСтроки.Добавить(СтрокаТовары);
				КонецЕсли;
				СтрокаТовары.Количество = СтрокаТовары.Количество + Заполнить;
				СтрокаТовары.Удалить = Ложь;
				СтрокаТовары.Справка2 = СтрокаТаблицы.Справка2;
			КонецЕсли;
		Иначе
			СтрокаТовары = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаТаблицы);
			СтрокаТовары.Количество          = Заполнить;
			ПараметрыЗаполнения.ДобавленныеСтроки.Добавить(СтрокаТовары);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		Если СтрокаТовары.Количество = 0 И Не СтрокаТовары.Удалить Тогда
			СтрокаТовары.Количество = СтрокаТовары.КоличествоДо;
		КонецЕсли;
	КонецЦикла;
	
	Менеджер.ОбработатьСтрокиТабличнойЧасти(ДокументОбъект, ПараметрыЗаполнения);
	ДокументОбъект[ИмяТаблицы].Загрузить(Товары.Скопировать(Новый Структура("Удалить", Ложь)));
	
	Если ПреобразовыватьТаблицуШтрихкодов Тогда
		ЗаполнитьАкцизныеМаркиДокумента(ДокументОбъект, ПараметрыОкончанияПроверки.ДеревоМаркированнойПродукции);
	Иначе
		ДокументОбъект.ШтрихкодыУпаковок.Загрузить(ТаблицаШтрихкодов);
	КонецЕсли;
	
	Если ДокументОбъект.Проведен Тогда
		Если ДокументОбъект.ПроверитьЗаполнение() Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
	Иначе
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Заполняет табличную часть Товары по данным таблицы немаркируемой продукции.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - Заполняемый документ.
//  ДеревоУпаковок - ДеревоЗначений - дерево упаковок.
//  ПараметрыЗаполнения - Структура - Параметры, полученные из функции ПараметрыЗаполненияТоваровИАкцизныхМарок.
//
Процедура ЗаполнитьНеМаркируемыеТовары(ДокументОбъект, ТаблицаНеМаркируемойПродукции, ПараметрыЗаполнения) Экспорт
	
	Для Каждого СтрокаТаблицы Из ТаблицаНеМаркируемойПродукции Цикл
		
		ЗаполнитьТоварИзСтроки(ДокументОбъект, СтрокаТаблицы, ПараметрыЗаполнения, СтрокаТаблицы.Количество);
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиСтрокиТоваров(Товары, ПараметрыОтбора, Справка2, АлкогольнаяПродукция, ПараметрыЗаполнения, ТипШтрихкода = Неопределено) Экспорт
	
	ТаблицаКлючевыхРеквизитов = Новый ТаблицаЗначений;
	ТаблицаКлючевыхРеквизитов.Колонки.Добавить("ПолноеСоответствие");
	ТаблицаКлючевыхРеквизитов.Колонки.Добавить("КЗаполнению");
	ТаблицаКлючевыхРеквизитов.Колонки.Добавить("Приоритет");
	ТаблицаКлючевыхРеквизитов.Колонки.Добавить("ВключаетТекущуюСтроку");
	
	МассивСтрок = Товары.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество() > 0 Тогда
		
		Для Каждого НайденнаяСтрока Из МассивСтрок Цикл
			
			ТипШтрихкодаПодходит =
				(ТипШтрихкода = Неопределено
					Или (ТипШтрихкода <> Неопределено
						И НайденнаяСтрока.ТипШтрихкода = ТипШтрихкода Или Не ЗначениеЗаполнено(НайденнаяСтрока.ТипШтрихкода)));
			Если Не ТипШтрихкодаПодходит Тогда
				Продолжить;
			КонецЕсли;
			
				Если ТаблицаКлючевыхРеквизитов.Количество() = 0 Тогда
					НоваяСтрока = ТаблицаКлючевыхРеквизитов.Добавить();
					НоваяСтрока.ПолноеСоответствие = Новый Массив;
					НоваяСтрока.КЗаполнению        = Новый Массив;
				Иначе
					НоваяСтрока = ТаблицаКлючевыхРеквизитов[0];
				КонецЕсли;
			
			Если ПараметрыЗаполнения.ЕстьСправка2 Тогда
				Если НайденнаяСтрока[ПараметрыЗаполнения.ИмяКолонкиАлкогольнаяПродукция] = АлкогольнаяПродукция
					И НайденнаяСтрока.Справка2 = Справка2 Тогда
					НоваяСтрока.ПолноеСоответствие.Добавить(НайденнаяСтрока);
				ИначеЕсли НайденнаяСтрока[ПараметрыЗаполнения.ИмяКолонкиАлкогольнаяПродукция] = АлкогольнаяПродукция
					И Не ЗначениеЗаполнено(НайденнаяСтрока.Справка2) Тогда
					НоваяСтрока.КЗаполнению.Добавить(НайденнаяСтрока);
				ИначеЕсли Не ЗначениеЗаполнено(НайденнаяСтрока[ПараметрыЗаполнения.ИмяКолонкиАлкогольнаяПродукция])
					И Не ЗначениеЗаполнено(НайденнаяСтрока.Справка2) Тогда
					НоваяСтрока.КЗаполнению.Добавить(НайденнаяСтрока);
				КонецЕсли;
			Иначе
				Если НайденнаяСтрока[ПараметрыЗаполнения.ИмяКолонкиАлкогольнаяПродукция] = АлкогольнаяПродукция Тогда
					НоваяСтрока.ПолноеСоответствие.Добавить(НайденнаяСтрока);
				ИначеЕсли Не ЗначениеЗаполнено(НайденнаяСтрока[ПараметрыЗаполнения.ИмяКолонкиАлкогольнаяПродукция]) Тогда
					НоваяСтрока.КЗаполнению.Добавить(НайденнаяСтрока);
				КонецЕсли;
			КонецЕсли;
			
			Если ПараметрыЗаполнения.ТекущаяСтрока = НайденнаяСтрока
				И НоваяСтрока.ВключаетТекущуюСтроку = Неопределено Тогда
				НоваяСтрока.ВключаетТекущуюСтроку = Истина;
			КонецЕсли;
			
			Если НоваяСтрока.ПолноеСоответствие.Количество() > 0
				И НоваяСтрока.КЗаполнению.Количество() = 0 Тогда
				НоваяСтрока.Приоритет = 1;
			ИначеЕсли НоваяСтрока.ПолноеСоответствие.Количество() > 0
				И НоваяСтрока.КЗаполнению.Количество() > 0 Тогда
				НоваяСтрока.Приоритет = 2;
			Иначе
				НоваяСтрока.Приоритет = 3;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаКлючевыхРеквизитов.Сортировать("ВключаетТекущуюСтроку УБЫВ, Приоритет ВОЗР");
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПолноеСоответствие");
	ВозвращаемоеЗначение.Вставить("КЗаполнению");
	
	Если ТаблицаКлючевыхРеквизитов.Количество() > 0 Тогда
		Результат = ТаблицаКлючевыхРеквизитов[0];
		Если Результат.ПолноеСоответствие.Количество() > 0 Тогда
			Для Каждого ЭлементДанных Из Результат.ПолноеСоответствие Цикл
				Если ЭлементДанных = ПараметрыЗаполнения.ТекущаяСтрока Тогда
					ВозвращаемоеЗначение.ПолноеСоответствие = ЭлементДанных;
				КонецЕсли;
			КонецЦикла;
			Если ВозвращаемоеЗначение.ПолноеСоответствие = Неопределено Тогда
				ВозвращаемоеЗначение.ПолноеСоответствие = Результат.ПолноеСоответствие[0];
			КонецЕсли;
		КонецЕсли;
		Если Результат.КЗаполнению.Количество() > 0 Тогда
			ВозвращаемоеЗначение.КЗаполнению = Результат.КЗаполнению;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ОбработатьИзмененнуюСтроку(СтрокаТЧТовары, ПараметрыЗаполнения, Количество, ЭтоМаркируемаяПродукция = Истина) Экспорт
	
	ЭтоДобавленнаяСтрока = ПараметрыЗаполнения.ДобавленныеСтроки.Найти(СтрокаТЧТовары) <> Неопределено;
	ЭтоИзмененнаяСтрока  = ПараметрыЗаполнения.ИзмененныеСтроки.Найти(СтрокаТЧТовары) <> Неопределено;
	
	ИзменятьКоличествоСинхронно = (СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличествоУпаковок] = СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество]);
	ИзмененоКоличество         = Ложь;
	ИзмененоКоличествоУпаковок = Ложь;
	
	Если ПараметрыЗаполнения.ДобавлятьКоличество
		Или ЭтоДобавленнаяСтрока
		Или ЭтоИзмененнаяСтрока Тогда
		
		Если ЭтоМаркируемаяПродукция И ПараметрыЗаполнения.ЕстьКоличествоАкцизныхМарок Тогда
			СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам = СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам + Количество;
			СтрокаТЧТовары.КоличествоАкцизныхМарок = СтрокаТЧТовары.КоличествоАкцизныхМарок + 1;
			Если СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам > СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество] Тогда
				СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество] = СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам;
				ИзмененоКоличество = Истина;
				Если ИзменятьКоличествоСинхронно Тогда
					СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличествоУпаковок] = СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество];
					ИзмененоКоличествоУпаковок = Истина;
				КонецЕсли;
			КонецЕсли;
		Иначе
			СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество] = СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество] + Количество;
			ИзмененоКоличество = Истина;
			Если ИзменятьКоличествоСинхронно Тогда
				СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличествоУпаковок] = СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличествоУпаковок] + Количество;
				ИзмененоКоличествоУпаковок = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоДобавленнаяСтрока Тогда
			Если ЭтоМаркируемаяПродукция И ПараметрыЗаполнения.ЕстьКоличествоАкцизныхМарок Тогда
				Если СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам > СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество] Тогда
					Если Не ИзмененоКоличество Тогда
						СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество] = СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам;
					КонецЕсли;
					Если ИзменятьКоличествоСинхронно
						И Не ИзмененоКоличествоУпаковок Тогда
						СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличествоУпаковок] = СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если Не ИзмененоКоличествоУпаковок Тогда
					СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличествоУпаковок] = СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличествоУпаковок] + Количество;
				КонецЕсли;
				Если ИзменятьКоличествоСинхронно
					И Не ИзмененоКоличество Тогда
					СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество] = СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество] + Количество;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Если ЭтоМаркируемаяПродукция И ПараметрыЗаполнения.ЕстьКоличествоАкцизныхМарок Тогда
			СтрокаТЧТовары.КоличествоАкцизныхМарок = 1;
			СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам = Количество;
		КонецЕсли;
		СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество] = Количество;
		Если ИзменятьКоличествоСинхронно Тогда
			СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличествоУпаковок] = Количество;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭтоИзмененнаяСтрока И Не ЭтоДобавленнаяСтрока Тогда
		ПараметрыЗаполнения.ИзмененныеСтроки.Добавить(СтрокаТЧТовары);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДобавленнуюСтроку(СтрокаТЧТовары, ПараметрыЗаполнения, Количество, ЭтоМаркируемаяПродукция = Истина) Экспорт
	
	Если ПараметрыЗаполнения.ДобавлятьКоличество Тогда
		Если ЭтоМаркируемаяПродукция И ПараметрыЗаполнения.ЕстьКоличествоАкцизныхМарок Тогда
			СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам = СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам + Количество;
			СтрокаТЧТовары.КоличествоАкцизныхМарок = СтрокаТЧТовары.КоличествоАкцизныхМарок + 1;
			Если СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам > СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество] Тогда
				СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество]         = СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам;
				СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличествоУпаковок] = СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам;
			КонецЕсли;
		Иначе
			СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество]         = СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество]         + Количество;
			СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличествоУпаковок] = СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличествоУпаковок] + Количество;
		КонецЕсли;
	Иначе
		Если ЭтоМаркируемаяПродукция И ПараметрыЗаполнения.ЕстьКоличествоАкцизныхМарок Тогда
			СтрокаТЧТовары.КоличествоПродукцииПоАкцизнымМаркам = Количество;
			СтрокаТЧТовары.КоличествоАкцизныхМарок = 1;
		КонецЕсли;
		СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличество]         = Количество;
		СтрокаТЧТовары[ПараметрыЗаполнения.ИмяКолонкиКоличествоУпаковок] = Количество;
	КонецЕсли;
	
	ПараметрыЗаполнения.ДобавленныеСтроки.Добавить(СтрокаТЧТовары);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет служебные реквизиты в табличной части "Товары" в процедурах ПриСозданииНаСервере
//
// Параметры:
//  Форма				 - ФормаКлиентскогоПриложения - Форма
//  ИмяКолонкиКоличество - Строка - Имя колонки "Количество"
//  ИмяТабличнойЧасти    - Строка - Имя табличной части с продукцией
//
Процедура ЗаполнитьСлужебныеРеквизиты(Форма, ИмяКолонкиКоличество = "Количество", ИмяТабличнойЧасти = "Товары") Экспорт
	
	Источник = ИсточникОрганизацияЕГАИС(Форма).Источник;
	
	Товары = Источник[ИмяТабличнойЧасти].Выгрузить();
	
	ПараметрыЗаполнения = ПараметрыЗаполненияДанныхАкцизныхМарок(Товары);
	
	Если Не ПараметрыЗаполнения.ЕстьКолонкаСправка2 Тогда
		Товары.Колонки.Добавить("Справка2", Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"));
	КонецЕсли;
	
	ЕстьКолонкаДоступноДробноеКоличество        = Товары.Колонки.Найти("ДоступноДробноеКоличество") <> Неопределено;
	ЕстьКолонкаУпаковка                         = Товары.Колонки.Найти("Упаковка") <> Неопределено;
	ЕстьКолонкаНеупакованнаяПродукция           = Товары.Колонки.Найти("НеупакованнаяПродукция") <> Неопределено;
	ЕстьКолонкаКоличествоЕГАИС                  = Товары.Колонки.Найти("КоличествоЕГАИС") <> Неопределено;
	ЕстьКолонкаЭтоНоменклатураЧастичногоВыбытия = Товары.Колонки.Найти("ЭтоНоменклатураЧастичногоВыбытия") <> Неопределено;
	
	ДополнениеКИндексу = 0;
	Если Товары.Колонки.Найти("НомерСтроки") = Неопределено Тогда
		
		ДополнениеКИндексу = 1;
		Товары.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(6, 0));
		
		КоличествоСтрок = Товары.Количество() - 1;
		Для НомерСтроки = 0 По КоличествоСтрок Цикл
			Товары[НомерСтроки].НомерСтроки = НомерСтроки;
		КонецЦикла;
		
	КонецЕсли;
	
	АкцизныеМарки = Источник.АкцизныеМарки.Выгрузить();

	ПодготовитьАкцизныеМаркиКЗаполнению(АкцизныеМарки, ПараметрыЗаполнения);

	АлкогольнаяПродукция = СлужебныеДанныеАлкогольнойПродукции(Товары);
	Если ПараметрыЗаполнения.ЕстьКолонкаТипШтрихкода Тогда
		АлкогольнаяПродукция.Колонки.Добавить("ТипШтрихкода", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыШтрихкодов"));
	КонецЕсли;
	
	Для Каждого СтрокаПродукции Из АлкогольнаяПродукция Цикл
		
		СтрокаТЧ = Источник[ИмяТабличнойЧасти][СтрокаПродукции.НомерСтроки - 1 + ДополнениеКИндексу];
		СтрокаТЧ.МаркируемаяПродукция = СтрокаПродукции.МаркируемаяПродукция;
		
		Если ЕстьКолонкаНеупакованнаяПродукция Тогда
			СтрокаТЧ.НеупакованнаяПродукция = СтрокаПродукции.ТипПродукции = Перечисления.ТипыПродукцииЕГАИС.Неупакованная;
		КонецЕсли;
		
		Если ЕстьКолонкаДоступноДробноеКоличество Тогда
			Если ЕстьКолонкаУпаковка И ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
				Упаковка = СтрокаТЧ.Упаковка;
			Иначе
				Упаковка = СтрокаТЧ.ЕдиницаИзмерения;
			КонецЕсли;
			СтрокаТЧ.ДоступноДробноеКоличество = ДоступноДробноеКоличество(СтрокаПродукции, ПараметрыЗаполнения.ЕстьЧастичноеВыбытие, Упаковка);
		КонецЕсли;

		ЗаполнитьДанныеАкцизныхМарокВСтроке(АкцизныеМарки, СтрокаПродукции, ПараметрыЗаполнения);

		СтрокаТЧ.КоличествоАкцизныхМарок = СтрокаПродукции.КоличествоАкцизныхМарок;
		СтрокаТЧ.КоличествоПродукцииПоАкцизнымМаркам = СтрокаПродукции.КоличествоПродукцииПоАкцизнымМаркам;

		Если ПараметрыЗаполнения.ЕстьКолонкаТипШтрихкода Тогда
			СтрокаТЧ.ТипШтрихкода = СтрокаПродукции.ТипШтрихкода;
		КонецЕсли;

		Если ЕстьКолонкаКоличествоЕГАИС Тогда
			Если ЕстьКолонкаЭтоНоменклатураЧастичногоВыбытия Тогда
				СтрокаТЧ.ЭтоНоменклатураЧастичногоВыбытия = СтрокаПродукции.ЭтоНоменклатураЧастичногоВыбытия;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
				Если СтрокаТЧ.НеупакованнаяПродукция Тогда
					СтрокаТЧ.КоэффициентЕГАИС = СтрокаПродукции.ОбъемДАЛ;
				ИначеЕсли СтрокаПродукции.ЭтоНоменклатураЧастичногоВыбытия Тогда
						СтрокаТЧ.КоэффициентЕГАИС = 1;
				ИначеЕсли СтрокаПродукции.КоличествоВПотребительскойУпаковке = 0 Тогда
					СтрокаТЧ.КоэффициентЕГАИС = 1;
				Иначе
					СтрокаТЧ.КоэффициентЕГАИС = 1 / СтрокаПродукции.КоличествоВПотребительскойУпаковке;
				КонецЕсли;
			Иначе
				СтрокаТЧ.КоэффициентЕГАИС = 0;
			КонецЕсли;
			СтрокаТЧ.КоличествоЕГАИС = СтрокаТЧ.Количество * СтрокаТЧ.КоэффициентЕГАИС;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "АдресСоответствияАкцизныхМарок")
		И Форма.АдресСоответствияАкцизныхМарок = "" Тогда
		Форма.АдресСоответствияАкцизныхМарок = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры

// Устанавливает значение флага ДоступностьДробногоКоличества в переданной строке
//
// Параметры:
//  ТекущаяСтрока - ДанныеФормыСтруктура - данные строки табличной части, в которой происходит заполнение
//  ЧастичноеВыбытиеДоступно - Булево - флаг доступности частичного выбытия для объекта строки
Процедура УстановитьДоступностьДробногоКоличестваВСтроке(ТекущаяСтрока, ЧастичноеВыбытиеДоступно = Ложь) Экспорт

	Если ЗначениеЗаполнено(ТекущаяСтрока.Упаковка) Тогда
		Упаковка = ТекущаяСтрока.Упаковка;
	Иначе
		Упаковка = ТекущаяСтрока.ЕдиницаИзмерения;
	КонецЕсли;

	ОписаниеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(ТекущаяСтрока.Номенклатура).Получить(ТекущаяСтрока.Номенклатура);

	ТекущаяСтрока.ДоступноДробноеКоличество = ДоступноДробноеКоличество(ОписаниеНоменклатуры, ЧастичноеВыбытиеДоступно, Упаковка);

КонецПроцедуры

// Возвращает признак видимости информационной надписи о доступности сканирования штрихкода "Data Matrix" акцизной марки.
//
// Параметры:
//  РассчитыватьПоОстаткам - Булево - признак расчета статистики заполнения по остаткам справок 2.
//
// Возвращаемое значение:
//  Булево - признак видимости информационной надписи.
//
Функция ВидимостьИнформацииОСканированииDataMatrix(РассчитыватьПоОстаткам) Экспорт
	
	ПроцентЗаполнения = ПроцентЗаполненияДиапазоновНомеровАкцизныхМарок(РассчитыватьПоОстаткам);
	
	Возврат ПроцентЗаполнения >= 50;
	
КонецФункции

Процедура СообщитьОбОшибкеЗаполненияСправки2(ШтрихкодУпаковки) Экспорт
	
	Если ОбщегоНазначения.РежимОтладки() Тогда
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При изменении статуса акцизной марки %1 возникла ошибка:
			           |Не удалось определить справку 2 и (или) алкогольную продукцию'"),
			ШтрихкодУпаковки);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбщегоНазначенияЕГАИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьОбОшибкеЧтенияСтатуса(ШтрихкодУпаковки) Экспорт
	
	Если ОбщегоНазначения.РежимОтладки() Тогда
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При изменении статуса акцизной марки %1 возникла ошибка:
			           |Прочитанный статус не актуален'"),
			ШтрихкодУпаковки);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ОбщегоНазначенияЕГАИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СлужебныеДанныеАлкогольнойПродукции(Товары)
	
	Результат = Неопределено;
	АкцизныеМаркиЕГАИСПереопределяемый.СлужебныеДанныеАлкогольнойПродукции(Товары, Результат);
	Если Результат <> Неопределено Тогда
		Возврат  Результат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.НомерСтроки,
	|	Т.ИдентификаторСтроки,
	|	Т.АлкогольнаяПродукция,
	|	Т.Справка2,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.Серия,
	|	Т.Количество
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Т
	|;
	|" + ИнтеграцияЕГАИС.ТекстЗапросаВТКоэффициентыПересчетаВЕдиницыЕГАИС("Товары", "ВТКоэффициентыПересчетаВЕдиницыЕГАИС") + "
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Номенклатура   КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ НоменклатураЧастичногоВыбытия
	|ИЗ
	|	Товары КАК Товары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЧастичногоВыбытияПродукцииИС КАК НастройкиЧастичногоВыбытияПродукцииИС
	|	ПО Товары.Номенклатура = НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия
	|		И Товары.Характеристика = НастройкиЧастичногоВыбытияПродукцииИС.ХарактеристикаЧастичногоВыбытия
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки          КАК НомерСтроки,
	|	Товары.ИдентификаторСтроки  КАК ИдентификаторСтроки,
	|	Товары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	Товары.Справка2             КАК Справка2,
	|	Товары.Номенклатура         КАК Номенклатура,
	|	Товары.Характеристика       КАК Характеристика,
	|	Товары.Серия                КАК Серия,
	|	Товары.Количество           КАК Количество,
	|	0                           КАК КоличествоАкцизныхМарок,
	|	0                           КАК КоличествоПродукцииПоАкцизнымМаркам,
	|	ЕСТЬNULL(Товары.Справка2.Поштучная, ЛОЖЬ) КАК ПомарочныйУчет,
	|	ЕСТЬNULL(Товары.АлкогольнаяПродукция.ВидПродукции.Маркируемый, ЛОЖЬ) КАК МаркируемаяПродукция,
	|	ЕСТЬNULL(Товары.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.Неупакованная)) КАК ТипПродукции,
	|	ЕСТЬNULL(ОписаниеНоменклатурыИС.КоличествоВПотребительскойУпаковке, 1) КАК КоличествоВПотребительскойУпаковке,
	|	ЕСТЬNULL(ОписаниеНоменклатурыИС.ВариантЧастичногоВыбытия, НЕОПРЕДЕЛЕНО) КАК ВариантЧастичногоВыбытия,
	|	ЕСТЬNULL(ОписаниеНоменклатурыИС.УпаковкаЧастичногоВыбытия, НЕОПРЕДЕЛЕНО) КАК УпаковкаЧастичногоВыбытия,
	|	ЕСТЬNULL(ОписаниеНоменклатурыИС.ПотребительскаяУпаковка, НЕОПРЕДЕЛЕНО) КАК ПотребительскаяУпаковка,
	|	НЕ НоменклатураЧастичногоВыбытия.Номенклатура ЕСТЬ NULL КАК ЭтоНоменклатураЧастичногоВыбытия,
	|	ЕСТЬNULL(ЕдиницыЕГАИС.ОбъемДАЛ, 0) КАК ОбъемДАЛ
	|ИЗ
	|	Товары КАК Товары
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|	ПО Товары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураЧастичногоВыбытия КАК НоменклатураЧастичногоВыбытия
	|	ПО Товары.Номенклатура = НоменклатураЧастичногоВыбытия.Номенклатура
	|		И Товары.Характеристика = НоменклатураЧастичногоВыбытия.Характеристика
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыПересчетаВЕдиницыЕГАИС КАК ЕдиницыЕГАИС
	|	ПО ЕдиницыЕГАИС.АлкогольнаяПродукция = Товары.АлкогольнаяПродукция
	|		И Товары.Номенклатура = ЕдиницыЕГАИС.Номенклатура
	|		И Товары.Характеристика = ЕдиницыЕГАИС.Характеристика
	|		И Товары.Серия = ЕдиницыЕГАИС.Серия";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Параметры.Вставить("Товары", Товары);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции

Функция ИсточникОрганизацияЕГАИС(Форма)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		Источник = Форма.Объект;
	Иначе
		Источник = Форма;
	КонецЕсли;
	
	ОрганизацияЕГАИС = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "ОрганизацияЕГАИС") Тогда
		ОрганизацияЕГАИС = Источник.ОрганизацияЕГАИС;
	Иначе
		МассивСтроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы, ".");
		Если МассивСтроки.Количество() > 1 Тогда
			Если МассивСтроки[1] = "ТТНВходящаяЕГАИС" Тогда
				ОрганизацияЕГАИС = Источник.Грузополучатель;
			ИначеЕсли МассивСтроки[1] = "ТТНИсходящаяЕГАИС" Тогда
				ОрганизацияЕГАИС = Источник.Грузоотправитель;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Источник",         Источник);
	ВозвращаемоеЗначение.Вставить("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#Область ЗаполнениеДокументов

Функция ЗаполнитьТоварИзСтроки(ДокументОбъект, СтрокаТовара, ПараметрыЗаполнения, Количество)
	
	ЭтоМаркируемаяПродукция = (ТипЗнч(СтрокаТовара) = Тип("СтрокаДереваЗначений")
		И СтрокаТовара.МаркируемаяПродукция);
	
	Если ЭтоМаркируемаяПродукция И ПараметрыЗаполнения.ТолькоПустаяСправка2 Тогда
		Справка2 = Справочники.Справки2ЕГАИС.ПустаяСсылка();
	Иначе
		Справка2 = СтрокаТовара.Справка2;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовара, "ИдентификаторСтроки") Тогда
		ИдентификаторСтроки = СтрокаТовара.ИдентификаторСтроки;
	Иначе
		ИдентификаторСтроки = Неопределено;
	КонецЕсли;
	
	ВыполнитьПоискПоНоменклатуре = Истина;
	
	Товары = ДокументОбъект[ПараметрыЗаполнения.ИмяТабличнойЧастиТовары];
	
	Если ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
		
		НайденныеСтроки = Товары.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ВыполнитьПоискПоНоменклатуре    = Ложь;
			СтрокаТЧТовары                  = НайденныеСтроки[0];
			СтрокиТЧДляУменьшенияКоличества = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыполнитьПоискПоНоменклатуре Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура",   СтрокаТовара.Номенклатура);
		ПараметрыОтбора.Вставить("Характеристика", СтрокаТовара.Характеристика);
		
		ТипШтрихкода = Неопределено;
		Если ГруппироватьНоменклатуруПоТипуШтрихкода(ДокументОбъект)
			И ЭтоМаркируемаяПродукция
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовара, "ШтрихкодУпаковки") Тогда
			//@skip-warning
			ТипШтрихкода = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.ШтрихкодУпаковки, "ТипШтрихкода");
		КонецЕсли;
		
		Если ПараметрыЗаполнения.УчитыватьСерии Тогда
			ПараметрыОтбора.Вставить("Серия", СтрокаТовара.Серия);
		КонецЕсли;
		
		РезультатПоиска = НайтиСтрокиТоваров(
			Товары, ПараметрыОтбора,
			Справка2, СтрокаТовара.АлкогольнаяПродукция, ПараметрыЗаполнения, ТипШтрихкода);
		
		СтрокаТЧТовары                  = РезультатПоиска.ПолноеСоответствие;
		СтрокиТЧДляУменьшенияКоличества = РезультатПоиска.КЗаполнению;
		
	КонецЕсли;
	
	Если СтрокиТЧДляУменьшенияКоличества = Неопределено
		И СтрокаТЧТовары = Неопределено Тогда
		
		СтрокаТЧТовары = Товары.Добавить();
		
		СтрокаТЧТовары.Номенклатура         = СтрокаТовара.Номенклатура;
		СтрокаТЧТовары.Характеристика       = СтрокаТовара.Характеристика;
		СтрокаТЧТовары.Серия                = СтрокаТовара.Серия;
		Если ТипШтрихкода <> Неопределено Тогда
			СтрокаТЧТовары.ТипШтрихкода = ТипШтрихкода;
		КонецЕсли;

		СтрокаТЧТовары.АлкогольнаяПродукция = СтрокаТовара.АлкогольнаяПродукция;
		Если ПараметрыЗаполнения.ЕстьСправка2 Тогда
			СтрокаТЧТовары.Справка2 = Справка2;
		КонецЕсли;
		
		УстановитьИдентификаторСтроки(СтрокаТЧТовары, ИдентификаторСтроки);
		
		ОбработатьДобавленнуюСтроку(СтрокаТЧТовары, ПараметрыЗаполнения, Количество, ЭтоМаркируемаяПродукция);
		
	ИначеЕсли СтрокиТЧДляУменьшенияКоличества = Неопределено
		И СтрокаТЧТовары <> Неопределено Тогда
		
		ОбработатьИзмененнуюСтроку(СтрокаТЧТовары, ПараметрыЗаполнения, Количество, ЭтоМаркируемаяПродукция);
		
	Иначе
		
		КоличествоКРаспределению = Количество;
		
		Пока КоличествоКРаспределению > 0
			И СтрокиТЧДляУменьшенияКоличества.Количество() > 0 Цикл
			
			ОбработанныеСтроки = Новый Массив;
			
			Для Каждого СтрокаТЧДляУменьшенияКоличества Из СтрокиТЧДляУменьшенияКоличества Цикл
				
				Если СтрокаТЧДляУменьшенияКоличества.Количество <= КоличествоКРаспределению Тогда
					
					Если СтрокаТЧТовары = Неопределено Тогда
						
						СтрокаТЧТовары = СтрокаТЧДляУменьшенияКоличества;
						
						СтрокаТЧТовары.АлкогольнаяПродукция = СтрокаТовара.АлкогольнаяПродукция;
						Если ПараметрыЗаполнения.ЕстьСправка2 Тогда
							СтрокаТЧТовары.Справка2 = Справка2;
						КонецЕсли;
						
					Иначе
						
						Товары.Удалить(СтрокаТЧДляУменьшенияКоличества);
						
						Индекс = ПараметрыЗаполнения.ИзмененныеСтроки.Найти(СтрокаТЧДляУменьшенияКоличества);
						Если Индекс <> Неопределено Тогда
							ПараметрыЗаполнения.ИзмененныеСтроки.Удалить(Индекс);
						КонецЕсли;
						
					КонецЕсли;
					
					ОбработанныеСтроки.Добавить(СтрокаТЧДляУменьшенияКоличества);
					
					СписываемоеКоличество = СтрокаТЧДляУменьшенияКоличества.Количество;
					
					ОбработатьИзмененнуюСтроку(СтрокаТЧТовары, ПараметрыЗаполнения, СписываемоеКоличество, ЭтоМаркируемаяПродукция);
					
					КоличествоКРаспределению = КоличествоКРаспределению - СписываемоеКоличество;
					
				Иначе
					
					СтрокаТЧДляУменьшенияКоличества.Количество = СтрокаТЧДляУменьшенияКоличества.Количество - КоличествоКРаспределению;
					ПараметрыЗаполнения.ИзмененныеСтроки.Добавить(СтрокаТЧДляУменьшенияКоличества);
					
					Если СтрокаТЧТовары = Неопределено Тогда
						
						СтрокаТЧТовары = Товары.Вставить(Товары.Индекс(СтрокаТЧДляУменьшенияКоличества) + 1);
						ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТЧДляУменьшенияКоличества,,"Количество, КоличествоУпаковок");
						
						СтрокаТЧТовары.АлкогольнаяПродукция = СтрокаТовара.АлкогольнаяПродукция;
						Если ПараметрыЗаполнения.ЕстьСправка2 Тогда
							СтрокаТЧТовары.Справка2 = Справка2;
						КонецЕсли;
						
						УстановитьИдентификаторСтроки(СтрокаТЧТовары, ИдентификаторСтроки);
						
						ОбработатьДобавленнуюСтроку(СтрокаТЧТовары, ПараметрыЗаполнения, КоличествоКРаспределению, ЭтоМаркируемаяПродукция);
						
					Иначе
						
						ОбработатьИзмененнуюСтроку(СтрокаТЧТовары, ПараметрыЗаполнения, КоличествоКРаспределению, ЭтоМаркируемаяПродукция);
						
					КонецЕсли;
					
					КоличествоКРаспределению = 0;
					
				КонецЕсли;
				
				Если КоличествоКРаспределению <= 0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого ОбработаннаяСтрока Из ОбработанныеСтроки Цикл
				Индекс = СтрокиТЧДляУменьшенияКоличества.Найти(ОбработаннаяСтрока);
				Если Индекс <> Неопределено Тогда
					СтрокиТЧДляУменьшенияКоличества.Удалить(Индекс);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		Если КоличествоКРаспределению > 0 И СтрокаТЧТовары <> Неопределено Тогда
			ОбработатьИзмененнуюСтроку(СтрокаТЧТовары, ПараметрыЗаполнения, КоличествоКРаспределению, ЭтоМаркируемаяПродукция);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаТЧТовары;
	
КонецФункции

Процедура УстановитьИдентификаторСтроки(СтрокаТЧТовары, ИдентификаторСтроки = Неопределено)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧТовары, "ИдентификаторСтроки") Тогда
		Если ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
			СтрокаТЧТовары.ИдентификаторСтроки = ИдентификаторСтроки;
		Иначе
			СтрокаТЧТовары.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ГруппироватьНоменклатуруПоТипуШтрихкода(ДокументОбъект)
	
	Возврат ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.АктПостановкиНаБалансЕГАИС")
		И ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.АктПостановкиНаБалансЕГАИС");
	
КонецФункции

// Возвращает процент заполнения диапазонов номеров акцизных марок в справках 2.
//
Функция ПроцентЗаполненияДиапазоновНомеровАкцизныхМарок(РассчитыватьПоОстаткам)
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	
	Если РассчитыватьПоОстаткам Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.Справка2 КАК Справка2
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(, Справка2 <> ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка)) КАК ОстаткиАлкогольнойПродукцииЕГАИСОстатки
		|ГДЕ
		|	ОстаткиАлкогольнойПродукцииЕГАИСОстатки.КоличествоОстаток > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Справка2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок.Ссылка) КАК КоличествоСправок
		|ПОМЕСТИТЬ ЗаполненныеДиапазоны
		|ИЗ
		|	Справочник.Справки2ЕГАИС.ДиапазоныНомеровАкцизныхМарок КАК Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсходныеДанные КАК ИсходныеДанные
		|		ПО Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок.Ссылка = ИсходныеДанные.Справка2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИсходныеДанные.Справка2) КАК КоличествоСправок
		|ПОМЕСТИТЬ ОстаткиСправок2
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОстаткиСправок2.КоличествоСправок, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ЗаполненныеДиапазоны.КоличествоСправок, 0) / ОстаткиСправок2.КоличествоСправок * 100
		|	КОНЕЦ КАК ПроцентЗаполнения
		|ИЗ
		|	ЗаполненныеДиапазоны КАК ЗаполненныеДиапазоны,
		|	ОстаткиСправок2 КАК ОстаткиСправок2";
		
	Иначе
		
		ПереданныеСправки2 = Новый Массив;
		Период = Неопределено;
		
		Пока ПереданныеСправки2.Количество() < 500 Цикл
			
			ЗапросПоСправкам = Новый Запрос;
			
			Если Период = Неопределено Тогда
				ЗапросПоСправкам.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 500
				|	ОстаткиАлкогольнойПродукцииЕГАИС.Период КАК Период,
				|	ОстаткиАлкогольнойПродукцииЕГАИС.Справка2 КАК Справка2
				|ИЗ
				|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС КАК ОстаткиАлкогольнойПродукцииЕГАИС
				|ГДЕ
				|	ОстаткиАлкогольнойПродукцииЕГАИС.Регистратор ССЫЛКА Документ.ПередачаВРегистр2ЕГАИС
				|
				|УПОРЯДОЧИТЬ ПО
				|	Период УБЫВ";
			Иначе
				ЗапросПоСправкам.УстановитьПараметр("Период", Период);
				ЗапросПоСправкам.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 500
				|	ОстаткиАлкогольнойПродукцииЕГАИС.Период КАК Период,
				|	ОстаткиАлкогольнойПродукцииЕГАИС.Справка2 КАК Справка2
				|ИЗ
				|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС КАК ОстаткиАлкогольнойПродукцииЕГАИС
				|ГДЕ
				|	ОстаткиАлкогольнойПродукцииЕГАИС.Регистратор ССЫЛКА Документ.ПередачаВРегистр2ЕГАИС
				|	И ОстаткиАлкогольнойПродукцииЕГАИС.Период <= &Период
				|
				|УПОРЯДОЧИТЬ ПО
				|	Период УБЫВ";
			КонецЕсли;
			
			РезультатЗапроса = ЗапросПоСправкам.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				Прервать;
			КонецЕсли;
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если ПереданныеСправки2.Найти(Выборка.Справка2) = Неопределено Тогда
					ПереданныеСправки2.Добавить(Выборка.Справка2);
				КонецЕсли;
				
				Период = Выборка.Период;
			КонецЦикла;
			
			Если Выборка.Количество() < 500 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Справки2", ПереданныеСправки2);
		Запрос.УстановитьПараметр("ПереданоСправок", ПереданныеСправки2.Количество());
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок.Ссылка) КАК КоличествоСправок
		|ПОМЕСТИТЬ ЗаполненныеДиапазоны
		|ИЗ
		|	Справочник.Справки2ЕГАИС.ДиапазоныНомеровАкцизныхМарок КАК Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок
		|ГДЕ
		|	Справки2ЕГАИСДиапазоныНомеровАкцизныхМарок.Ссылка В(&Справки2)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ПереданоСправок = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЗаполненныеДиапазоны.КоличествоСправок / &ПереданоСправок * 100
		|	КОНЕЦ КАК ПроцентЗаполнения
		|ИЗ
		|	ЗаполненныеДиапазоны КАК ЗаполненныеДиапазоны";
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если ТипЗнч(Выборка.ПроцентЗаполнения) = Тип("Число") Тогда
			Результат = Выборка.ПроцентЗаполнения;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Окр(Результат, 2);
	
КонецФункции


Функция ПараметрыЗаполненияДанныхАкцизныхМарок(Товары)

	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ЕстьКолонкаСправка2",     Товары.Колонки.Найти("Справка2") <> Неопределено);
	ПараметрыЗаполнения.Вставить("ПустаяСправка2",          Справочники.Справки2ЕГАИС.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ЕстьЧастичноеВыбытие",    Ложь);
	ПараметрыЗаполнения.Вставить("ЕстьКолонкаТипШтрихкода", Товары.Колонки.Найти("ТипШтрихкода") <> Неопределено);

	Возврат ПараметрыЗаполнения;

КонецФункции

Процедура ПодготовитьАкцизныеМаркиКЗаполнению(АкцизныеМарки, ПараметрыЗаполнения)

	Если ПараметрыЗаполнения.ЕстьКолонкаСправка2 И АкцизныеМарки.Колонки.Найти("Справка2") = Неопределено Тогда
		АкцизныеМарки.Колонки.Добавить("Справка2", Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"));
	КонецЕсли;

	Если ПараметрыЗаполнения.ЕстьКолонкаТипШтрихкода И АкцизныеМарки.Колонки.Найти("ТипШтрихкода") = Неопределено Тогда
		АкцизныеМарки.Колонки.Добавить("ТипШтрихкода", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыШтрихкодов"));
	КонецЕсли;

	ЗаполнитьКолонкуКоличество = АкцизныеМарки.Колонки.Найти("Количество") = Неопределено;
	Если ЗаполнитьКолонкуКоличество Тогда
		АкцизныеМарки.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	КонецЕсли;

	ИменаКолонокДляГруппировки = "ИдентификаторСтроки";

	Если ПараметрыЗаполнения.ЕстьКолонкаСправка2 Тогда
		ИменаКолонокДляГруппировки = ИменаКолонокДляГруппировки + ",Справка2";
	КонецЕсли;

	Если ПараметрыЗаполнения.ЕстьКолонкаТипШтрихкода Тогда
		ИменаКолонокДляГруппировки = ИменаКолонокДляГруппировки + ",ТипШтрихкода";
	КонецЕсли;
	
	ПараметрыЗаполнения.ЕстьЧастичноеВыбытие = АкцизныеМарки.Колонки.Найти("ЧастичноеВыбытиеВариантУчета") <> Неопределено;
	Если ПараметрыЗаполнения.ЕстьЧастичноеВыбытие Тогда
		Если АкцизныеМарки.Колонки.Найти("Номенклатура") = Неопределено Тогда
			АкцизныеМарки.Колонки.Добавить("Номенклатура",   Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
			АкцизныеМарки.Колонки.Добавить("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
			АкцизныеМарки.Колонки.Добавить("Серия",          Метаданные.ОпределяемыеТипы.СерияНоменклатуры.Тип);
		КонецЕсли;
		ИменаКолонокДляГруппировки = ИменаКолонокДляГруппировки +
			",Номенклатура,Характеристика,Серия,
			|ЧастичноеВыбытиеВариантУчета,ЧастичноеВыбытиеНоменклатура,ЧастичноеВыбытиеХарактеристика,ЧастичноеВыбытиеКоличество";
	КонецЕсли;
	
	ТребуетсяЗаполнениеДаныхАкцизныхМарок = ПараметрыЗаполнения.ЕстьКолонкаТипШтрихкода Или ПараметрыЗаполнения.ЕстьЧастичноеВыбытие;

	Если ТребуетсяЗаполнениеДаныхАкцизныхМарок Или ЗаполнитьКолонкуКоличество Тогда
		Если ТребуетсяЗаполнениеДаныхАкцизныхМарок Тогда
			ДанныеАкцизныхМарок = ПолучитьДанныеАкцизныхМарок(АкцизныеМарки.ВыгрузитьКолонку("АкцизнаяМарка"));
		КонецЕсли;

		Для Каждого СтрокаТЧ Из АкцизныеМарки Цикл
			Если ТребуетсяЗаполнениеДаныхАкцизныхМарок
				И ЗначениеЗаполнено(СтрокаТЧ.АкцизнаяМарка) Тогда
				ДанныеАкцизнойМарки = ДанныеАкцизныхМарок[СтрокаТЧ.АкцизнаяМарка];
				Если ДанныеАкцизнойМарки <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, ДанныеАкцизнойМарки);
				КонецЕсли;
			КонецЕсли;
			Если ЗаполнитьКолонкуКоличество Тогда
				СтрокаТЧ.Количество = 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	АкцизныеМарки.Свернуть(ИменаКолонокДляГруппировки, "Количество");

	ИндексДляТаблицыАкцизныеМарки = "ИдентификаторСтроки";
	Если ПараметрыЗаполнения.ЕстьКолонкаСправка2 Тогда
		ИндексДляТаблицыАкцизныеМарки = ИндексДляТаблицыАкцизныеМарки + ",Справка2";
	КонецЕсли;
	АкцизныеМарки.Индексы.Добавить(ИндексДляТаблицыАкцизныеМарки);
	
КонецПроцедуры

Функция ПолучитьДанныеАкцизныхМарок(МассивАкцизныхМарок)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивАкцизныхМарок);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка,
	|	ШтрихкодыУпаковокТоваров.ТипШтрихкода,
	|	ШтрихкодыУпаковокТоваров.Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика,
	|	ШтрихкодыУпаковокТоваров.Серия
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.Ссылка В (&Ссылка)";
	Выборка = Запрос.Выполнить().Выбрать();

	ДанныеАкцизныхМарок = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ДанныеАкцизнойМарки = Новый Структура;
		ДанныеАкцизнойМарки.Вставить("ТипШтрихкода",   Выборка.ТипШтрихкода);
		ДанныеАкцизнойМарки.Вставить("Номенклатура",   Выборка.Номенклатура);
		ДанныеАкцизнойМарки.Вставить("Характеристика", Выборка.Характеристика);
		ДанныеАкцизнойМарки.Вставить("Серия",          Выборка.Серия);
		ДанныеАкцизныхМарок.Вставить(Выборка.Ссылка, ДанныеАкцизнойМарки);
	КонецЦикла;

	Возврат ДанныеАкцизныхМарок;

КонецФункции

Процедура ЗаполнитьДанныеАкцизныхМарокВСтроке(АкцизныеМарки, Строка, ПараметрыЗаполнения)

	Если Строка.МаркируемаяПродукция Тогда
		Если ЗначениеЗаполнено(Строка.ИдентификаторСтроки) Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ИдентификаторСтроки", Строка.ИдентификаторСтроки);
			Если ПараметрыЗаполнения.ЕстьКолонкаСправка2 Тогда
				ПараметрыОтбора.Вставить("Справка2", ПараметрыЗаполнения.ПустаяСправка2);
			КонецЕсли;
			ЗаполнитьДанныеАкцизныхМарокПоОтбору(АкцизныеМарки, Строка, ПараметрыЗаполнения, ПараметрыОтбора);
		КонецЕсли;
		Если ПараметрыЗаполнения.ЕстьКолонкаСправка2 И Строка.Справка2 <> ПараметрыЗаполнения.ПустаяСправка2 Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ИдентификаторСтроки", "");
			ПараметрыОтбора.Вставить("Справка2", Строка.Справка2);
			ЗаполнитьДанныеАкцизныхМарокПоОтбору(АкцизныеМарки, Строка, ПараметрыЗаполнения, ПараметрыОтбора);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДанныеАкцизныхМарокПоОтбору(АкцизныеМарки, Строка, ПараметрыЗаполнения, ПараметрыОтбора)

	НайденныеСтроки = АкцизныеМарки.НайтиСтроки(ПараметрыОтбора);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		КоличествоАкцизныхМарок = НайденнаяСтрока.Количество;
		КоличествоПродукцииПоАкцизнымМаркам = КоличествоАкцизныхМарок * Строка.КоличествоВПотребительскойУпаковке;
		Если ПараметрыЗаполнения.ЕстьЧастичноеВыбытие Тогда
			Если ЗначениеЗаполнено(НайденнаяСтрока.ЧастичноеВыбытиеВариантУчета) Тогда
				Если Строка.Номенклатура <> НайденнаяСтрока.ЧастичноеВыбытиеНоменклатура
					Или Строка.Характеристика <> НайденнаяСтрока.ЧастичноеВыбытиеХарактеристика Тогда
					Продолжить;
				КонецЕсли;
				КоличествоАкцизныхМарок = 1;
				КоличествоПродукцииПоАкцизнымМаркам = НайденнаяСтрока.ЧастичноеВыбытиеКоличество;
			ИначеЕсли Строка.Номенклатура <> НайденнаяСтрока.Номенклатура
				Или Строка.Характеристика <> НайденнаяСтрока.Характеристика
				Или Строка.Серия <> НайденнаяСтрока.Серия Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Строка.КоличествоАкцизныхМарок = Строка.КоличествоАкцизныхМарок + КоличествоАкцизныхМарок;
		Строка.КоличествоПродукцииПоАкцизнымМаркам = Строка.КоличествоПродукцииПоАкцизнымМаркам + Окр(КоличествоПродукцииПоАкцизнымМаркам, 3);
		Если ПараметрыЗаполнения.ЕстьКолонкаТипШтрихкода Тогда
			Строка.ТипШтрихкода = НайденнаяСтрока.ТипШтрихкода;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ДоступноДробноеКоличество(ДанныеПродукции, ЧастичноеВыбытиеДоступно, Упаковка = Неопределено)

	Возврат ДанныеПродукции.КоличествоВПотребительскойУпаковке <> Цел(ДанныеПродукции.КоличествоВПотребительскойУпаковке)
			И ДанныеПродукции.ПотребительскаяУпаковка <> Упаковка
		Или ЧастичноеВыбытиеДоступно
			И ДанныеПродукции.ВариантЧастичногоВыбытия = Перечисления.ВариантыУчетаЧастичногоВыбытияИС.ТекущаяНоменклатура
			И ДанныеПродукции.УпаковкаЧастичногоВыбытия <> Упаковка;

КонецФункции

#Область ЗавершениеПроверкиПродукцииСлужебный

// Заполняет табличную часть Акцизные марки.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - Заполняемый документ.
//  ДеревоШтрихкодов - ДеревоЗначений - таблица упаковок.
//
Процедура ЗаполнитьАкцизныеМаркиДокумента(ДокументОбъект, ДеревоШтрихкодов)
	
	ДеревоШтрихкодов.Колонки.ШтрихкодУпаковки.Имя = "АкцизнаяМарка";
	ДокументОбъект.АкцизныеМарки.Очистить();
	
	ЗаполнитьАкцизныеМаркиПоДереву(ДокументОбъект.АкцизныеМарки, ДеревоШтрихкодов.Строки, Неопределено);

КонецПроцедуры

// Заполняет табличную часть Акцизные марки.
//
// Параметры:
//  АкцизныеМарки - ТабличнаяЧасть - Заполняемая табличная часть.
//  СтрокиДерева - КоллекцияСтрокДереваЗначений - таблица упаковок.
//  УпаковкаВерхнегоУровня - СтрокаТабличнойЧасти - Уточняемая строка.
Процедура ЗаполнитьАкцизныеМаркиПоДереву(АкцизныеМарки, СтрокиДерева, УпаковкаВерхнегоУровня)
	
	Для Каждого Упаковка Из СтрокиДерева Цикл
		
		УпаковкаВерхнегоУровняСтрокиДерева = УпаковкаВерхнегоУровня;
		Если УпаковкаВерхнегоУровня = Неопределено Тогда
			НоваяСтрока = АкцизныеМарки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Упаковка);
			УпаковкаВерхнегоУровняСтрокиДерева = НоваяСтрока;
		ИначеЕсли УпаковкаВерхнегоУровня.Справка2 <> Упаковка.Справка2 Тогда
			НоваяСтрока = АкцизныеМарки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Упаковка);
			НоваяСтрока.ШтрихкодУпаковки = УпаковкаВерхнегоУровня.АкцизнаяМарка;
		КонецЕсли;
		
		ЗаполнитьАкцизныеМаркиПоДереву(АкцизныеМарки, Упаковка.Строки, УпаковкаВерхнегоУровняСтрокиДерева);
		
	КонецЦикла;

КонецПроцедуры

// Проверяет заполнение табличной части Акцизные марки.
//
// Параметры:
//  Объект - ДокументОбъект - Документ с проверкой заполнения.
//  Отказ - Булево - признак отказа проверки заполнения.
//  Настройки - Строка - настройки проверки.
Процедура ПроверитьЗаполнениеШтрихкодовУпаковок(Объект, Отказ, Настройки = "") Экспорт
	
	УчитыватьСправки2 = СтрНайти(Настройки,"БезСправки2") = 0;
	ТаблицаУпаковок = Объект.АкцизныеМарки.Выгрузить();
	Если УчитыватьСправки2 Тогда
		ТаблицаУпаковок.Очистить();
		Для Каждого СтрокаТабличнойЧасти Из Объект.АкцизныеМарки Цикл
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Справка2) Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаУпаковок.Добавить(),СтрокаТабличнойЧасти);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РезультатПроверки = ТаблицаТоварыСоответствуетСпискуУпаковокМаркируемойПродукции(Объект.Товары, ТаблицаУпаковок, Настройки);
	
	Если РезультатПроверки.ДанныеСоответствуют Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонОшибки = НСтр("ru = 'В строке %1 для номенклатурной позиции %2 должно быть указано %5 %3, а подобрано - %4'");
	ШаблонОшибкиЛишниеКоды = НСтр("ru = 'Для номенклатурной позиции %1 подобрано %3 %2, а соответствующая им строка табличной части ""Товары"" отсутствует'");
	
	Для Каждого Расхождение Из РезультатПроверки.СтрокиСРасхождением Цикл
		Если Расхождение.НомерСтроки = -1 Тогда
			ТекстОшибки = СтрШаблон(ШаблонОшибкиЛишниеКоды, Расхождение.Номенклатура, Расхождение.Указано, Расхождение.Представление);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Объект,"Товары",, Отказ);
		Иначе
			ТекстОшибки = СтрШаблон(ШаблонОшибки,
				Расхождение.НомерСтроки, Расхождение.Номенклатура, Расхождение.Необходимо, Расхождение.Указано, Расхождение.Представление);
			ПутьКТабличнойЧасти = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Расхождение.НомерСтроки, Расхождение.Поле);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Объект, ПутьКТабличнойЧасти,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет на соответствие табличной части "Товары" списку штрихкодов упаковок.
// 
// Параметры:
//  Товары - ТабличнаяЧасть - Табличная часть, где хранится список товаров маркируемой продукции.
//  ТаблицаУпаковок - Массив из СправочникСсылка.ШтрихкодыУпаковокТоваров - список связанных штрихкодов упаковок.
//  Настройки - Строка - Настройки проверки
// Возвращаемое значение:
//  Структура - Таблица товары соответствует списку упаковок маркируемой продукции:
// * ДанныеСоответствуют - Булево - 
// * СтрокиСРасхождением - Массив из СтрокаТабличнойЧасти - 
Функция ТаблицаТоварыСоответствуетСпискуУпаковокМаркируемойПродукции(Товары, ТаблицаУпаковок, Настройки)
	
	РезультатПроверки = Новый Структура("ДанныеСоответствуют, СтрокиСРасхождением", Истина, Новый Массив);
	
	ТаблицаУпаковок.Колонки.Удалить("ШтрихкодУпаковки");
	ТаблицаУпаковок.Колонки.АкцизнаяМарка.Имя = "ШтрихкодУпаковки";
	ТаблицаУпаковок.Индексы.Добавить("ШтрихкодУпаковки");
	
	ВложенныеШтрихкоды = ШтрихкодированиеИС.ВложенныеШтрихкодыИзвестныхУпаковок(ТаблицаУпаковок.ВыгрузитьКолонку("ШтрихкодУпаковки"));
	ВложенныеШтрихкоды.МаркированныеТовары.Колонки.Добавить("Справка2", Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"));
	ВложенныеШтрихкоды.ДеревоУпаковок.Колонки.Добавить("Справка2", Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"));
	Для Каждого ЭлементВложения Из ТаблицаУпаковок Цикл
		Если ЗначениеЗаполнено(ЭлементВложения.Справка2) Тогда
			СтрокаДерева = ВложенныеШтрихкоды.ДеревоУпаковок.Строки.Найти(ЭлементВложения.ШтрихкодУпаковки, "ШтрихкодУпаковки", Истина);
			СтрокаДерева.Справка2 = ЭлементВложения.Справка2;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементВложения Из ВложенныеШтрихкоды.МаркированныеТовары Цикл
		СтрокаДерева = ЭлементВложения.СтрокаДерева;
		Пока СтрокаДерева <> Неопределено Цикл
			Если ЗначениеЗаполнено(СтрокаДерева.Справка2) Тогда
				ЭлементВложения.Справка2 = СтрокаДерева.Справка2;
				Прервать;
			КонецЕсли;
			СтрокаДерева = СтрокаДерева.Родитель;
		КонецЦикла;
	КонецЦикла;
	
	ДанныеДляПроверки = Новый Соответствие;
	
	Описание = ОбщегоНазначенияИС.ОписаниеНоменклатуры(Товары.ВыгрузитьКолонку("Номенклатура"));
	
	ПартионныеКакНемаркируемые = СтрНайти(Настройки, "РазрешеноНеУказыватьПартионныеМаркиВСтроке");
	Если ПартионныеКакНемаркируемые Тогда
		ПомарочныйУчет = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Товары.ВыгрузитьКолонку("Справка2"),"Поштучная");
	КонецЕсли;

	Для Каждого СтрокаТЧ Из Товары Цикл
		
		Если Не КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоМаркируемаяПродукцияЕГАИС(Описание.Получить(СтрокаТЧ.Номенклатура).КлючВидовПродукции) Тогда
			Продолжить;
		КонецЕсли;
		
		Ключ = КлючСоответствия(СтрокаТЧ.Номенклатура);
		СоответствиеНоменклатура = ДанныеДляПроверки.Получить(Ключ);
		Если СоответствиеНоменклатура = Неопределено Тогда
			СоответствиеНоменклатура = Новый Соответствие;
			ДанныеДляПроверки.Вставить(Ключ, СоответствиеНоменклатура);
		КонецЕсли;
		
		Ключ = КлючСоответствия(СтрокаТЧ.Характеристика);
		СоответствиеХарактеристика = СоответствиеНоменклатура.Получить(Ключ);
		Если СоответствиеХарактеристика = Неопределено Тогда
			СоответствиеХарактеристика = Новый Соответствие;
			СоответствиеНоменклатура.Вставить(Ключ, СоответствиеХарактеристика);
		КонецЕсли;
		
		Ключ = КлючСоответствия(СтрокаТЧ.Серия);
		СоответствиеСерия = СоответствиеХарактеристика.Получить(Ключ);
		Если СоответствиеСерия = Неопределено Тогда
			СоответствиеСерия = Новый Соответствие;
			СоответствиеХарактеристика.Вставить(Ключ, СоответствиеСерия);
		КонецЕсли;
		
		Если СтрНайти(Настройки,"БезСправки2") Тогда
			Справка2 = Справочники.Справки2ЕГАИС.ПустаяСсылка();
		Иначе 
			Справка2 = СтрокаТЧ.Справка2;
		КонецЕсли;
		
		Ключ = КлючСоответствия(Справка2);
		ДанныеСправка2 = СоответствиеСерия.Получить(Ключ);
		Если ДанныеСправка2 = Неопределено Тогда
			ДанныеСправка2 = Новый Структура();
			ДанныеСправка2.Вставить("НомераСтрок", Новый Массив);
			ДанныеСправка2.Вставить("Количество",  0);
			ДанныеСправка2.Вставить("Факт",        0);
		КонецЕсли;
		
		ДанныеСправка2.НомераСтрок.Добавить(СтрокаТЧ.НомерСтроки);
		ДанныеСправка2.Количество = ДанныеСправка2.Количество + СтрокаТЧ.Количество;
		СоответствиеСерия.Вставить(Ключ, ДанныеСправка2);
		
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из ВложенныеШтрихкоды.МаркированныеТовары Цикл
		
		Ключ = КлючСоответствия(СтрокаТЧ.Номенклатура);
		СоответствиеНоменклатура = ДанныеДляПроверки.Получить(Ключ);
		Если СоответствиеНоменклатура = Неопределено Тогда
			СоответствиеНоменклатура = Новый Соответствие;
			ДанныеДляПроверки.Вставить(Ключ, СоответствиеНоменклатура);
		КонецЕсли;
		
		Ключ = КлючСоответствия(СтрокаТЧ.Характеристика);
		СоответствиеХарактеристика = СоответствиеНоменклатура.Получить(Ключ);
		Если СоответствиеХарактеристика = Неопределено Тогда
			СоответствиеХарактеристика = Новый Соответствие;
			СоответствиеНоменклатура.Вставить(Ключ, СоответствиеХарактеристика);
		КонецЕсли;
		
		Ключ = КлючСоответствия(СтрокаТЧ.Серия);
		СоответствиеСерия = СоответствиеХарактеристика.Получить(Ключ);
		Если СоответствиеСерия = Неопределено Тогда
			СоответствиеСерия = Новый Соответствие;
			СоответствиеХарактеристика.Вставить(Ключ, СоответствиеСерия);
		КонецЕсли;
		
		Если СтрНайти(Настройки,"БезСправки2") Тогда
			Справка2 = Справочники.Справки2ЕГАИС.ПустаяСсылка();
		Иначе 
			Справка2 = СтрокаТЧ.Справка2;
		КонецЕсли;
		
		Ключ = КлючСоответствия(Справка2);
		ДанныеСправка2 = СоответствиеСерия.Получить(Ключ);
		Если ДанныеСправка2 = Неопределено Тогда
			ДанныеСправка2 = Новый Структура();
			ДанныеСправка2.Вставить("НомераСтрок", Новый Массив);
			ДанныеСправка2.Вставить("Количество",  0);
			ДанныеСправка2.Вставить("Факт",        0);
		КонецЕсли;
		
		ДанныеСправка2.Факт = ДанныеСправка2.Факт + СтрокаТЧ.КоличествоПоДаннымИБ;
		СоответствиеСерия.Вставить(Ключ, ДанныеСправка2);
		
	КонецЦикла;
	
	ШаблонРасхождение = Новый Структура();
	ШаблонРасхождение.Вставить("НомерСтроки", -1);
	ШаблонРасхождение.Вставить("Номенклатура");
	ШаблонРасхождение.Вставить("Необходимо");
	ШаблонРасхождение.Вставить("Указано");
	ШаблонРасхождение.Вставить("Поле");
	ШаблонРасхождение.Вставить("Представление");
	Для Каждого КлючиНоменклатура Из ДанныеДляПроверки Цикл
		Для Каждого КлючиХарактеристика Из КлючиНоменклатура.Значение Цикл
			Для Каждого КлючиСерия Из КлючиХарактеристика.Значение Цикл
				Для Каждого КлючиСправка2 Из КлючиСерия.Значение Цикл
					ДанныеСправки2 = КлючиСправка2.Значение;
					Если ДанныеСправки2.Количество <> ДанныеСправки2.Факт Тогда
						Если ДанныеСправки2.Факт = 0 
							И ПартионныеКакНемаркируемые
							И ЗначениеЗаполнено(КлючиСправка2.Ключ)
							И Не ПомарочныйУчет.Получить(КлючиСправка2.Ключ)
						Тогда
							Продолжить;
						КонецЕсли;
						РезультатПроверки.ДанныеСоответствуют = Ложь;
						СтрокаСРасхождением = ОбщегоНазначения.СкопироватьРекурсивно(ШаблонРасхождение);
						СтрокаСРасхождением.Поле = "КоличествоУпаковок";
						СтрокаСРасхождением.Представление = НСтр("ru = 'количество'");
						СтрокаСРасхождением.Номенклатура = КлючиНоменклатура.Ключ;
						СтрокаСРасхождением.Необходимо = ДанныеСправки2.Количество;
						СтрокаСРасхождением.Указано = ДанныеСправки2.Факт;
						Если ДанныеСправки2.НомераСтрок.Количество() Тогда
							СтрокаСРасхождением.НомерСтроки = ДанныеСправки2.НомераСтрок[0];
						КонецЕсли;
						РезультатПроверки.СтрокиСРасхождением.Добавить(СтрокаСРасхождением);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции

Функция КлючСоответствия(КлючИлиНеопределено)
	Если КлючИлиНеопределено = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат КлючИлиНеопределено;
КонецФункции

#КонецОбласти

#КонецОбласти
