//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ИсключаемыеЗначения = Новый Массив; // Массив из ПеречислениеСсылка.СпособыДоставки25
	
	Если Параметры.Свойство("ИсключаемыеЗначения", ИсключаемыеЗначения) Тогда
		
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			"Перечисление.СпособыДоставки25.ОбработкаПолученияДанныхВыбора",
			"ИсключаемыеЗначения",
			ИсключаемыеЗначения,
			Тип("ФиксированныйМассив"));
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
	Если НЕ СтандартнаяОбработка Тогда
		
		ОбщегоНазначенияУТ.ДоступныеДляВыбораЗначенияПеречисления(
			"СпособыДоставки25",
			ДанныеВыбора,
			Параметры,
			ИсключаемыеЗначения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли