#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.УчетнаяЗаписьЦентраЭДО.ТолькоПросмотр = Истина;
	Элементы.Логин.ТолькоПросмотр = Истина;
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.Пользователь.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗначенияКлюча = Новый Структура("УчетнаяЗаписьЦентраЭДО, Пользователь",
		ТекущийОбъект.УчетнаяЗаписьЦентраЭДО, ТекущийОбъект.Пользователь);
	КлючПользователя = РегистрыСведений.ПользователиЦентраЭДО.СоздатьКлючЗаписи(ЗначенияКлюча);
	ПараметрыЗаписи.Вставить("КлючПользователя", КлючПользователя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	КлючПользователя = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "КлючПользователя");
	ДополнительныеПараметрыОповещения = Новый Структура;
	ДополнительныеПараметрыОповещения.Вставить("Пользователь", Запись.Пользователь);
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(КлючПользователя, ДополнительныеПараметрыОповещения);
	
КонецПроцедуры

#КонецОбласти
