#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПроверитьОбновлениеНаКлиенте();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.Перезапустить.Видимость = Ложь;
	ЗаполнитьСписокПодсистем();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодсистемы

&НаКлиенте
Процедура ПодсистемыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Подсистемы.ТекущиеДанные;
	
	//Если Поле = Элементы.ПодсистемыДействие Тогда
	
	//	Если ТекущиеДанные.Действие = "Изменить назначение" Тогда
	//		ОбновитьНазначениеНаКлиенте(ТекущиеДанные);
	//	ИначеЕсли  ТекущиеДанные.Действие = "Настроить модуль" Тогда
	//		ОткрытьМодульНаКлиенте(ТекущиеДанные);
	//	КонецЕсли;
	//	
	//Иначе
	Если Поле = Элементы.ПодсистемыУстановка Тогда

		Если ТекущиеДанные.Установка = "Установить" Или ТекущиеДанные.Установка = "Обновить" Тогда
			ОбновитьМодульНаКлиенте(ТекущиеДанные);
		ИначеЕсли ТекущиеДанные.Установка = "Переустановить" Тогда
			ОбновитьМодульНаКлиенте(ТекущиеДанные);
		КонецЕсли;

	ИначеЕсли Поле = Элементы.ПодсистемыТекущаяВерсияОписание Тогда

		ОткрытьФормуОписаниеОбновлений(ТекущиеДанные.НазваниеПродукта, ТекущиеДанные.Подсистема,
			ТекущиеДанные.ТекущаяВерсия);

	ИначеЕсли Поле = Элементы.ПодсистемыАктуальнаяВерсияОписание Тогда

		ОткрытьФормуОписаниеОбновлений(ТекущиеДанные.НазваниеПродукта, ТекущиеДанные.Подсистема,
			ТекущиеДанные.АктуальнаяВерсия);

	ИначеЕсли Поле = Элементы.ПодсистемыТекущаяВерсия Тогда

		СохранитьФайлОбновления(ТекущиеДанные.НазваниеПродукта, ТекущиеДанные.ТипМодуля, ТекущиеДанные.Подсистема,
			ТекущиеДанные.ТекущаяВерсия);

	ИначеЕсли Поле = Элементы.ПодсистемыАктуальнаяВерсия Тогда

		СохранитьФайлОбновления(ТекущиеДанные.НазваниеПродукта, ТекущиеДанные.ТипМодуля, ТекущиеДанные.Подсистема,
			ТекущиеДанные.АктуальнаяВерсия);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьОбновление(Команда)

	ПроверитьОбновлениеНаКлиенте();

КонецПроцедуры // ПроверитьОбновление()

&НаКлиенте
Процедура Перезапустить(Команда)

	ЗавершитьРаботуСистемы(Ложь, Истина);

КонецПроцедуры // Перезапустить()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//&НаСервере
//Процедура УстановитьУсловноеОформление()
// 
// УсловноеОформление.Элементы.Очистить();
// 
// Элемент = УсловноеОформление.Элементы.Добавить();
//
// ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
// ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыУпаковка.Имя);
//
// ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
// ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
//
// ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
// ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АдресноеХранение");
// ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
// ОтборЭлемента.ПравоеЗначение = Ложь;
//
// ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
// ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
// ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
// ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Товар;
//
// ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
// ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Статус");
// ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
// ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыПриходныхОрдеров.КПоступлению;
//
// Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
//
//КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновлениеНаКлиенте()

	Для Каждого СтрокаПодсистемы Из Подсистемы.ПолучитьЭлементы() Цикл
		ПроверитьОбновлениеПоСтрокеПодсистемы(СтрокаПодсистемы);
		Если СтрокаПодсистемы.ПолучитьЭлементы().Количество() > 0 Тогда
			Для Каждого СтрокаПодсистемы2 Из СтрокаПодсистемы.ПолучитьЭлементы() Цикл
				ПроверитьОбновлениеПоСтрокеПодсистемы(СтрокаПодсистемы2);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Для Каждого СтрокаПодсистемы Из Подсистемы.ПолучитьЭлементы() Цикл
		ИдентификаторСтроки=СтрокаПодсистемы.ПолучитьИдентификатор();
		Элементы.Подсистемы.Развернуть(ИдентификаторСтроки);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновлениеПоСтрокеПодсистемы(СтрокаПодсистемы)

	АктуальнаяВерсия = КонтурЗакупки_ОбновлениеКлиент.http_ПолучитьАктуальнуюВерсиюПродукта(
		СтрокаПодсистемы.НазваниеПродукта);
	ТекущаяВерсия = СтрокаПодсистемы.ТекущаяВерсия;

	СтрокаПодсистемы.АктуальнаяВерсия = АктуальнаяВерсия;

	Установлен = ТекущаяВерсия <> "0.0.0.0";
	ЕстьОбновление = ЭтоНоваяВерсия(ТекущаяВерсия, АктуальнаяВерсия);

	Если Установлен И ЕстьОбновление Тогда
		СтрокаПодсистемы.Результат = СтрШаблон(
		НСтр("ru = 'Есть обновление для модуля %1, версия: %2'"), СокрЛП(СтрокаПодсистемы.Подсистема), СокрЛП(
			АктуальнаяВерсия));
		СтрокаПодсистемы.Установка = "Обновить";
	ИначеЕсли Установлен И Не ЕстьОбновление Тогда
		СтрокаПодсистемы.Результат = НСтр("ru = 'Обновление не требуется'");
		СтрокаПодсистемы.Установка = "Переустановить";
	ИначеЕсли Не Установлен И ЕстьОбновление Тогда
		СтрокаПодсистемы.Результат = НСтр("ru = 'Доступно к установке'");
		СтрокаПодсистемы.Установка = "Установить";
	Иначе
		СтрокаПодсистемы.Результат = НСтр("ru = 'Модуль недоступен для установки'");
		СтрокаПодсистемы.Установка = "";
	КонецЕсли;

//	Если Установлен И СтрокаПодсистемы.ТипМодуля = "epf" Тогда
//		Если СтрокаПодсистемы.КлючРасширения = "КонтурСайнВыгрузкаПрисоединенныхФайлов"
//			Или СтрокаПодсистемы.КлючРасширения = "Kontur_Сайн_Выгрузка_Объекта" Тогда
//			СтрокаПодсистемы.Действие = "Изменить назначение";
//		Иначе
//			СтрокаПодсистемы.Действие = "Настроить модуль";
//		КонецЕсли;
//	КонецЕсли;

	Если Установлен Тогда

		ДвоичныеДанныеОписания = КонтурЗакупки_ОбновлениеКлиент.http_СкачатьОбновление(
			СтрокаПодсистемы.НазваниеПродукта, "release-notes", ТекущаяВерсия);
		Если ДвоичныеДанныеОписания <> Неопределено Тогда
			СтрокаПодсистемы.ТекущаяВерсияОписание = "новое в версии " + ТекущаяВерсия;
		КонецЕсли;

		ПодсистемаИзменена = КонтурЗакупки_ОбновлениеВызовСервера.ПодсистемаИзменена(СтрокаПодсистемы.КлючРасширения,
			СтрокаПодсистемы.НазваниеПродукта, СтрокаПодсистемы.ТипМодуля);
		Если ПодсистемаИзменена Тогда
			СтрокаПодсистемы.ИндексКартинки = 2;
		Иначе
			СтрокаПодсистемы.ИндексКартинки = 1;
		КонецЕсли;

	ИначеЕсли ЕстьОбновление Тогда

		СтрокаПодсистемы.ИндексКартинки = 3;

	КонецЕсли;

	Если ЕстьОбновление Тогда
		ДвоичныеДанныеОписания = КонтурЗакупки_ОбновлениеКлиент.http_СкачатьОбновление(
			СтрокаПодсистемы.НазваниеПродукта, "release-notes", АктуальнаяВерсия);
		Если ДвоичныеДанныеОписания <> Неопределено Тогда
			СтрокаПодсистемы.АктуальнаяВерсияОписание = "новое в версии " + АктуальнаяВерсия;
		КонецЕсли;
	ИначеЕсли АктуальнаяВерсия = ТекущаяВерсия Тогда
		СтрокаПодсистемы.АктуальнаяВерсияОписание = СтрокаПодсистемы.ТекущаяВерсияОписание;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМодульНаКлиенте(ДанныеМодуля)

	РезультатОбновления = Неопределено;

	АктуальнаяВерсия = КонтурЗакупки_ОбновлениеКлиент.http_ПолучитьАктуальнуюВерсиюПродукта(
		ДанныеМодуля.НазваниеПродукта);

	Если АктуальнаяВерсия <> "0.0.0.0" Тогда

		ДвоичныеДанные = КонтурЗакупки_ОбновлениеКлиент.http_СкачатьОбновление(ДанныеМодуля.НазваниеПродукта,
			ДанныеМодуля.ТипМодуля);

		Если ДвоичныеДанные <> Неопределено Тогда

			РезультатОбновления = ОбновитьМодульНаСервере(ДанныеМодуля.КлючРасширения, ДанныеМодуля.ТипСодержимого,
				ДвоичныеДанные);
			ДанныеМодуля.Результат = РезультатОбновления.Описание;
			ДанныеМодуля.Действие = "";
			Если РезультатОбновления.Успех Тогда
				ЗаполнитьСписокПодсистем();
				ПроверитьОбновлениеНаКлиенте();
				Если НРег(ДанныеМодуля.ТипСодержимого) = "расширение" Тогда
					Элементы.Перезапустить.Видимость = Истина;
				КонецЕсли;

				КонтурЗакупки_СлужебныеВызовСервера.СообщитьПользователю(СтрШаблон(
				НСтр("ru = 'Подсистема %1 успешно установлена!'"), ДанныеМодуля.Подсистема));

			Иначе

				КонтурЗакупки_СлужебныеВызовСервера.СообщитьПользователю(СтрШаблон(
				НСтр("ru = 'Не удалось установить подсистему %1 по причине: %2'"), ДанныеМодуля.Подсистема,
					РезультатОбновления.Описание));
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьНазначениеНаКлиенте(ДанныеМодуля)

//	ПараметрыФормы = ПодготовитьПараметрыФормыВыборОбъектовМетаданных(ДанныеМодуля.КлючРасширения,Ложь);

//	ДополнительныеПараметры  = Новый Структура;
//	ДополнительныеПараметры.Вставить("НаименованиеОбработки", ДанныеМодуля.НазваниеПродукта);
//	ДополнительныеПараметры.Вставить("КлючОбработки", ДанныеМодуля.КлючРасширения);
//	ДополнительныеПараметры.Вставить("ТипМодуля", ДанныеМодуля.ТипМодуля);
//	
//	Оповещение = Новый ОписаниеОповещения("Оповещение_ПослеВыбораОбъектаМетаданных", ЭтаФорма, ДополнительныеПараметры);
//	ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", ПараметрыФормы,,,,, Оповещение);
//	
//КонецПроцедуры // ОбновитьНазначениеНаКлиенте()

//&НаКлиенте
//Процедура ОткрытьМодульНаКлиенте(ДанныеМодуля)
//
//	СтруктураПараметров = Новый Структура("Ключ", ДанныеМодуля.СсылкаНаМодуль);
//	ОткрытьФорму("Справочник.ДополнительныеОтчетыИОбработки.Форма.ФормаЭлемента", СтруктураПараметров);
//
//КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ПослеВыбораОбъектаМетаданных(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия <> Неопределено Тогда
		ОбновитьМодульНаСервере(ДополнительныеПараметры.КлючОбработки, ДополнительныеПараметры.ТипСодержимого,
			Неопределено, РезультатЗакрытия);
	КонецЕсли;

КонецПроцедуры // Оповещение_ПослеВыбораОбъектаМетаданных()

&НаКлиенте
Процедура ОткрытьФормуОписаниеОбновлений(НазваниеПродукта, Представление, НомерВерсии)

	ПараметрыФормыОбновлений = Новый Структура;
	ПараметрыФормыОбновлений.Вставить("НазваниеПродукта", НазваниеПродукта);
	ПараметрыФормыОбновлений.Вставить("Представление", Представление);
	ПараметрыФормыОбновлений.Вставить("НомерВерсии", НомерВерсии);

	ОткрытьФорму("Обработка.КонтурЗакупки_Обновление.Форма.ФормаОписаниеОбновлений", ПараметрыФормыОбновлений);

КонецПроцедуры // ОткрытьФормуОписаниеОбновлений()

&НаКлиенте
Процедура СохранитьФайлОбновления(НазваниеПродукта, ТипМодуля, Представление, НомерВерсии)

	Если НомерВерсии = "0.0.0.0" Тогда
		Возврат;
	КонецЕсли;

	РежимСохранение = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогСохранения = Новый ДиалогВыбораФайла(РежимСохранение);
	ДиалогСохранения.Заголовок = "Выберите имя файла для сохранения";
	ДиалогСохранения.Фильтр = СтрШаблон("Файлы %1|*.%1", ТипМодуля);
	ДиалогСохранения.ПолноеИмяФайла = НазваниеПродукта + "_" + НомерВерсии + "." + ТипМодуля;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НазваниеПродукта", НазваниеПродукта);
	ДополнительныеПараметры.Вставить("ТипМодуля", ТипМодуля);
	ДополнительныеПараметры.Вставить("НомерВерсии", НомерВерсии);

	ОповещениеЗавершения = Новый ОписаниеОповещения("СохранитьФайлОбновленияЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	ДиалогСохранения.Показать(ОповещениеЗавершения);

КонецПроцедуры // ОткрытьФормуОписаниеОбновлений()

&НаКлиенте
Процедура СохранитьФайлОбновленияЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИмяФайла = ВыбранныеФайлы[0];
	ДвоичныеДанныеФайла = КонтурЗакупки_ОбновлениеКлиент.http_СкачатьОбновление(
		ДополнительныеПараметры.НазваниеПродукта, ДополнительныеПараметры.ТипМодуля,
		ДополнительныеПараметры.НомерВерсии);

	Если ДвоичныеДанныеФайла <> Неопределено Тогда
		Попытка
			ДвоичныеДанныеФайла.Записать(ИмяФайла);
		Исключение
			КонтурЗакупки_СлужебныеВызовСервера.СообщитьПользователю(
				СтрШаблон(
				НСтр("ru = 'Не удалось записать файл %1 по причине: %2'"), ИмяФайла, ОписаниеОшибки()));
		КонецПопытки;
	Иначе
		КонтурЗакупки_СлужебныеВызовСервера.СообщитьПользователю(НСтр(
			"ru = 'Не удалось скачать файл с сервера обновлений!'"));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОбновитьМодульНаСервере(КлючРасширения, ТипСодержимого, ДвоичныеДанные, ОбъектыНазначения = Неопределено)

	Если НРег(ТипСодержимого) = "расширение" Тогда
		РезультатОбновления = КонтурЗакупки_ОбновлениеВызовСервера.ОбновитьРасширение(КлючРасширения, ДвоичныеДанные);
//TODO убрано из-за локализации
//	Иначе
//		РезультатОбновления = КонтурЗакупки_ОбновлениеВызовСервера.ОбновитьОбработку(КлючРасширения, ДвоичныеДанные,
//			ОбъектыНазначения);
	КонецЕсли;

	Возврат РезультатОбновления;

КонецФункции


//&НаСервере
//Функция ПодготовитьПараметрыФормыВыборОбъектовМетаданных(КлючОбработки,ЕстьФильтр)

//	ТекущаяВерсияОбработки = КонтурЗакупки_ОбновлениеВызовСервера.ПолучитьТекущуюВерсиюОбработки(КлючОбработки);
//	Если ТекущаяВерсияОбработки.СсылкаНаОбработку = Неопределено Тогда
//		СсылкаНаВнешнююОбработку = Справочники["ДополнительныеОтчетыИОбработки"].ПустаяСсылка();
//	Иначе
//		СсылкаНаВнешнююОбработку = ТекущаяВерсияОбработки.СсылкаНаОбработку;
//	КонецЕсли;

//	ТаблицаОбъектовМетаданных = КонтурЗакупки_ЛокализацияВызовСервера.ПодключенныеОбъектыМетаданных(Перечисления["ВидыДополнительныхОтчетовИОбработок"].ПечатнаяФорма);
//	Если ТаблицаОбъектовМетаданных = Неопределено Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	Если ЕстьФильтр Тогда
//		ФильтрПоОбъектамМетаданных = Новый СписокЗначений;
//		ФильтрПоОбъектамМетаданных.ЗагрузитьЗначения(ТаблицаОбъектовМетаданных.ВыгрузитьКолонку("ПолноеИмя"));
//	Иначе
//		ФильтрПоОбъектамМетаданных = Новый СписокЗначений;
//	КонецЕсли;
//	
//	
//	ВыбранныеОбъектыМетаданных = Новый СписокЗначений;
//	Для Каждого ЭлементНазначение Из СсылкаНаВнешнююОбработку.Назначение Цикл
//		ВыбранныеОбъектыМетаданных.Добавить(ЭлементНазначение.ОбъектНазначения.ПолноеИмя);
//	КонецЦикла;
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("ФильтрПоОбъектамМетаданных", ФильтрПоОбъектамМетаданных);
//	ПараметрыФормы.Вставить("ВыбранныеОбъектыМетаданных", ВыбранныеОбъектыМетаданных);
//	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Назначение дополнительной обработки'"));
//	ПараметрыФормы.Вставить("СпособГруппировкиОбъектов", "ПоВидам");
//	
//	Возврат ПараметрыФормы;
//	
//КонецФункции // ПодготовитьПараметрыФормыВыборОбъектовМетаданных()

&НаСервере
Функция ЭтоНоваяВерсия(ТекущаяВерсия, АктуальнаяВерсия)

	Возврат КонтурЗакупки_ОбновлениеВызовСервера.ЭтоНоваяВерсия(ТекущаяВерсия, АктуальнаяВерсия);

КонецФункции

&НаСервере
Процедура ДобавитьСтрокуПодсистемы(КлючРасширения, НазваниеПродукта, Представление, ТекущаяВерсия, АктуальнаяВерсия,
	ТипМодуля, ПодсистемаРодитель, ТипСодержимого)

	РекПодсистемыСайн = РеквизитФормыВЗначение("Подсистемы");

	Если ЗначениеЗаполнено(ПодсистемаРодитель) Тогда
		ПараметрыОтбора = Новый Структура("НазваниеПродукта", ПодсистемаРодитель);
		СтрокиРодитель = РекПодсистемыСайн.Строки.НайтиСтроки(ПараметрыОтбора);
		НовСтрока = СтрокиРодитель[0].Строки.Добавить();
	Иначе
		НовСтрока = РекПодсистемыСайн.Строки.Добавить();
	КонецЕсли;

	НовСтрока.Подсистема = Представление;
	НовСтрока.КлючРасширения = КлючРасширения;
	НовСтрока.НазваниеПродукта = НазваниеПродукта;
	НовСтрока.ТекущаяВерсия = ТекущаяВерсия.Версия;
	НовСтрока.АктуальнаяВерсия = АктуальнаяВерсия;
	НовСтрока.ТипМодуля = ТипМодуля;
	НовСтрока.ПодсистемаРодитель = ПодсистемаРодитель;
	НовСтрока.ТипСодержимого = ТипСодержимого;

	Если ТекущаяВерсия.Свойство("СсылкаНаОбработку") Тогда
		НовСтрока.СсылкаНаМодуль = ТекущаяВерсия.СсылкаНаОбработку;
	КонецЕсли;

	ЗначениеВРеквизитФормы(РекПодсистемыСайн, "Подсистемы");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПодсистем()

	Подсистемы.ПолучитьЭлементы().Очистить();

	МассивПодсистем = КонтурЗакупки_ОбновлениеВызовСервера.ПолучитьМассивПодсистем();
	Для Каждого Подсистема Из МассивПодсистем Цикл
		ДобавитьСтрокуПодсистемы(Подсистема.Ключ, Подсистема.НазваниеПродукта, Подсистема.Представление,
			Подсистема.ТекущаяВерсия, Подсистема.АктуальнаяВерсия, Подсистема.ТипМодуля, Подсистема.ПодсистемаРодитель,
			Подсистема.ТипСодержимого);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти