#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОрганизацияДиадок", ОрганизацияДиадок);
	Параметры.Свойство("Сертификат", Сертификат);
	Параметры.Свойство("МЧД", МЧД);
	
	Если Параметры.Свойство("ПротоколВалидации") Тогда
		
		ЕстьОшибки = Ложь;
		
		тз = КонтурЛогистика_МашиночитаемыеДовернностиСервер.тзПротоколаВалидацииМЧД(Параметры.ПротоколВалидации);
		
		Для каждого Стр Из тз Цикл
			
			НаименованиеПроверки = КонтурЛогистика_МашиночитаемыеДовернностиСервер.НаименованиеПроверкиПоИдентиифкатору(Стр.ИдентификаторПроверки);
			
			НоваяСтрока = ПротоколВалидации.Добавить();
			НоваяСтрока.НаименованиеПроверки = ?(ЗначениеЗаполнено(НаименованиеПроверки), НаименованиеПроверки + ", " + Стр.ИдентификаторПроверки, Стр.ИдентификаторПроверки);
			НоваяСтрока.СтатусПроверки = Стр.СтатусПроверки;
			НоваяСтрока.ТекстОшибки = ?(ЗначениеЗаполнено(Стр.ТекстОшибки), Стр.ТекстОшибки + ", " + Стр.КодОшибки, Стр.КодОшибки); ;
			
			Если ЗначениеЗаполнено(Стр.КодОшибки) Или ЗначениеЗаполнено(Стр.ТекстОшибки) Тогда
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			Если Стр.СтатусПроверки = "UnknownCheckStatus" Тогда
				НоваяСтрока.ПроверкаКартинка = 2;
			ИначеЕсли Стр.СтатусПроверки = "Ok" Тогда
				НоваяСтрока.ПроверкаКартинка = 3;
			ИначеЕсли Стр.СтатусПроверки = "Warning" Тогда
				НоваяСтрока.ПроверкаКартинка = 1;
			ИначеЕсли Стр.СтатусПроверки = "Error" Тогда
				НоваяСтрока.ПроверкаКартинка = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Элементы.ПротоколВалидацииТекстОшибки.Видимость = ЕстьОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ПротоколВалидацииПриАктивизацииЯчейки(Элемент)
	Элемент.ВыделенныеСтроки.Очистить();
КонецПроцедуры

#КонецОбласти