
#Область ПрограммныйИнтерфейс

#Область СозданиеСсылки

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииОснованияЗаказа
//
Процедура ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа) Экспорт
	
	ИменаОснованийЗаказа.Добавить("Документ.ЗаказКлиента");
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд.
//
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	Для каждого ВидКоманды Из ВидыПодключаемыхКоманд Цикл
		
		Если ВидКоманды.Имя = "ОнлайнЗаказы" Тогда
			ВидКоманды.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииПараметровСозданияЗаказа
//
Процедура ПриОпределенииПараметровСозданияЗаказа(ДокументЗаказа, Результат) Экспорт
	
	Если Не ОбщегоНазначения.СсылкаСуществует(ДокументЗаказа) Тогда
		
		Результат.СообщениеОбОшибке = НСтр("ru = 'Создание онлайн-заказов доступно только для проведенных документов.'");
		Результат.СозданиеЗаказаДоступно = Ложь;
		Возврат;
		
	КонецЕсли;
	
	РеквизитыДокумента = Новый Соответствие;
	РеквизитыДокумента.Вставить("ЗаказКакСчет", "ЗаказКакСчет");
	РеквизитыДокумента.Вставить("ЭтоЗаказ", "ЭтоЗаказ");
	РеквизитыДокумента.Вставить("ЭтоПродажаЗакупка", "ЭтоПродажаЗакупка");
	РеквизитыДокумента.Вставить("ИзменяетПланОплаты", "ИзменяетПланОплаты");
	РеквизитыДокумента.Вставить("Организация", "Организация");
	РеквизитыДокумента.Вставить("БанковскийСчетОрганизации", "БанковскийСчетОрганизации");
	РеквизитыДокумента.Вставить("БанковскийСчетКонтрагента", "БанковскийСчетКонтрагента");
	РеквизитыДокумента.Вставить("Контрагент.ЮрФизЛицо", "ВидКонтрагента");
	РеквизитыДокумента.Вставить("ТСП", "Склад");
	РеквизитыДокумента.Вставить("ПорядокРасчетов", "ПорядокРасчетов");
	ДанныеЗаказа = ДенежныеСредстваСервер.ДанныеДокумента(
		ДокументЗаказа, Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом, РеквизитыДокумента, Истина);
	СуммыДокумента = ДенежныеСредстваСервер.СуммыДокумента(ДокументЗаказа, ДанныеЗаказа.ДокументОперации);
	
	Результат.СозданиеЗаказаДоступно = Истина;
	Результат.Организация = ДанныеЗаказа.Организация;
	
	Если СуммыДокумента.Итог("СуммаСНДС") <= 0
		Или (Не ДанныеЗаказа.ИзменяетПланОплаты И Не ДанныеЗаказа.ЗаказКакСчет) Тогда
	
		Результат.СозданиеЗаказаДоступно = Ложь;
		Результат.СообщениеОбОшибке = НСтр("ru = 'Оплата не требуется.'");
		Возврат;
		
	КонецЕсли;
	
	Если (ДанныеЗаказа.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам
		Или ДанныеЗаказа.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным)
		И ДанныеЗаказа.ПроцентОплат >= 100
		И ДанныеЗаказа.СуммаЗадолженности <= 0 Тогда
		
		Результат.СозданиеЗаказаДоступно = Ложь;
		ШаблонСообщенияОбОшибке = НСтр("ru = 'Остаток задолженности по документу ""%1"" равен 0. Документ полностью оплачен.'");
		Результат.СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, ДанныеЗаказа.ДокументОперации);
		Возврат;
		
	КонецЕсли;
	
	СписокОшибок = Новый Массив;
	
	Если ДанныеЗаказа.ЭтоЗаказ
		И ДанныеЗаказа.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
		СписокОшибок.Добавить(НСтр("ru = 'Недоступно выставление онлайн-заказа без этапов оплаты.'"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗаказа.БанковскийСчетОрганизации) Тогда
		СписокОшибок.Добавить(НСтр("ru = 'Необходимо заполнить банковский счет организации.'"));
	КонецЕсли;
	
	Если СписокОшибок.Количество() <> 0 Тогда
		
		Результат.СозданиеЗаказаДоступно = Ложь;
		Результат.СообщениеОбОшибке = СтрСоединить(СписокОшибок, Символы.ПС);
		Возврат;
		
	КонецЕсли;
	
	Если Результат.СозданиеЗаказаДоступно
		И Не ДанныеЗаказа.Проведен Тогда
	
		Результат.СозданиеЗаказаДоступно = Ложь;
		Результат.СообщениеОбОшибке = НСтр("ru = 'Создание онлайн-заказов доступно только для проведенных документов.'");
		Возврат;
		
	КонецЕсли;
	
	ДоступныеНастройки = ДоступныеНастройкиОплатСБП(
		ДанныеЗаказа.ВидКонтрагента, ДанныеЗаказа.Организация, ДанныеЗаказа.БанковскийСчетОрганизации, ДанныеЗаказа.Склад);
	
	Если ДоступныеНастройки.Количество() = 0 Тогда
		
		ДоступныеНастройки = ДоступныеНастройкиОплатПоРеквизитам(ДанныеЗаказа.Организация, ДанныеЗаказа.ВидКонтрагента);
		
		Если ДоступныеНастройки.Количество() = 0 Тогда
			
			Результат.СозданиеЗаказаДоступно = Ложь;
			Результат.СообщениеОбОшибке = НСтр("ru = 'Не обнаружены действующие настройки.'");
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииПредставленияОснованияЗаказа
//
Процедура ПриОпределенииПредставленияОснованияЗаказа(ДокументЗаказа, ПредставлениеОснования, ДанныеОснования) Экспорт
	
	НомерЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументЗаказа, "Номер");
	ДанныеОснования.НомерЗаказа = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерЗаказа);
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииПечатныхФормЗаказа
//
Процедура ПриОпределенииПечатныхФормЗаказа(ДокументЗаказа, ПечатныеФормы) Экспорт
	
	КомандыПечатиОбъекта = ОнлайнЗаказы.КомандыПечатиОбъектаДоступныеДляВложений(ДокументЗаказа.Метаданные());
	
	Для Каждого КомандаПечатиОбъекта Из КомандыПечатиОбъекта Цикл
		
		Если КомандаПечатиОбъекта.Отключена
			Или КомандаПечатиОбъекта.СразуНаПринтер
			Или КомандаПечатиОбъекта.СкрытаФункциональнымиОпциями
			Или ПустаяСтрока(КомандаПечатиОбъекта.МенеджерПечати)
			Или СтрНайти(КомандаПечатиОбъекта.Идентификатор, ",") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если КомандаПечатиОбъекта.Идентификатор = "ЗаказКлиента"
			Или КомандаПечатиОбъекта.Идентификатор = "СчетНаОплату" Тогда
			
			НоваяСтрока = ПечатныеФормы.Добавить();
			НоваяСтрока.Идентификатор = КомандаПечатиОбъекта.УникальныйИдентификатор;
			НоваяСтрока.Представление = КомандаПечатиОбъекта.Представление;
			НоваяСтрока.ФорматСохранения = ТипФайлаТабличногоДокумента.PDF;
			НоваяСтрока.ИмяФайлаВТранслите = Истина;
			НоваяСтрока.ПодписьИПечать = Ложь;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриАктивацииЗаказа
//
Процедура ПриАктивацииЗаказа(ДокументЗаказа, ВложенияЗаказа, ПараметрыЗаказа) Экспорт

	// СервисShare
	НастройкиПубликации = новый Структура;
	НастройкиПубликации.Вставить("ДлительностьСрокаЖизни", ПараметрыЗаказа.СрокЖизни);
	НастройкиПубликации.Вставить("СхемаПубликации", ИнтеграцияShareКлиентСервер.СхемыПубликацииДокумента().Стандартная);
	НастройкиПубликации.Вставить("ДоступноРучноеУправление", Ложь);
	НастройкиПубликации.Вставить("ИнициаторПубликации", "ОнлайнЗаказы");
	
	Результат = ИнтеграцияShare.РезультатФормированияURLСсылкиНаЭлектронныйДокумент(ДокументЗаказа, ВложенияЗаказа, НастройкиПубликации, Неопределено);
		
	Если ПустаяСтрока(Результат.URLСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаказа.СервисShare.URLДокумента = Результат.URLСсылка;
	// Конец СервисShare

КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриДеактивацииЗаказа
//
Процедура ПриДеактивацииЗаказа(ДокументЗаказа, ПараметрыЗаказа) Экспорт

	// СервисShare
	ИнтеграцияShare.ДеактивироватьURLСсылкуНаЭлектронныйДокумент (
		ПараметрыЗаказа.URLShare,
		Ложь);
	// Конец СервисShare

КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриФормированииЗаказаНаОплату.
//
Процедура ПриФормированииЗаказаНаОплату(ДокументЗаказа, ЗаказНаОплату) Экспорт
	
	РеквизитыДокумента = Новый Соответствие;
	РеквизитыДокумента.Вставить("Номер", "Номер");
	РеквизитыДокумента.Вставить("Дата", "Дата");
	РеквизитыДокумента.Вставить("Организация", "Организация");
	РеквизитыДокумента.Вставить("Контрагент", "Контрагент");
	РеквизитыДокумента.Вставить("Контрагент.ЮрФизЛицо", "ВидКонтрагента");
	РеквизитыДокумента.Вставить("ТСП", "Склад");
	РеквизитыДокумента.Вставить("БанковскийСчетОрганизации", "БанковскийСчетОрганизации");
	РеквизитыДокумента.Вставить("БанковскийСчетОрганизации.НомерСчета", "НомерСчета");
	РеквизитыДокумента.Вставить("ПутьКДаннымТЧЭтапыОплаты", "ЭтапыОплаты");
	РеквизитыДокумента.Вставить("ИдентификаторПлатежа", "ИдентификаторПлатежа");
	РеквизитыДокумента.Вставить("ДополнительнаяИнформация", "ДополнительнаяИнформация");
	РеквизитыДокумента.Вставить("ВалютаДокумента.Код", "КодВалюты");
	РеквизитыДокумента.Вставить("ВалютаДокумента.Наименование", "Валюта");
	РеквизитыДокумента.Вставить("ПорядокРасчетов", "ПорядокРасчетов");
	РеквизитыДокумента.Вставить("Договор", "Договор");
	РеквизитыДокумента.Вставить("ЭтоЗаказ", "ЭтоЗаказ");
	ДанныеЗаказа = ДенежныеСредстваСервер.ДанныеДокумента(
		ДокументЗаказа, Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом, РеквизитыДокумента);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Номенклатура.НаименованиеПолное = """"
	|			ТОГДА ТаблицаТовары.Номенклатура.Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаТовары.Номенклатура.НаименованиеПолное КАК СТРОКА(128))
	|	КОНЕЦ КАК Наименование,
	|	ТаблицаТовары.Номенклатура.Код КАК ИдентификаторТовара,
	|	ТаблицаТовары.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	|	ТаблицаТовары.КоличествоУпаковок КАК Количество,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТовары.СуммаСНДС КАК СуммаСНДС,
	|	ТаблицаТовары.СуммаРучнойСкидки + ТаблицаТовары.СуммаАвтоматическойСкидки КАК Скидка,
	|	ТаблицаТовары.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ЗаказПокупателя
	|	И НЕ ТаблицаТовары.Отменено
	|	И (ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИЛИ ТаблицаТовары.Ссылка.ТребуетсяЗалогЗаТару
	|			ИЛИ НЕ ТаблицаТовары.Ссылка.ВернутьМногооборотнуюТару)";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ДокументЗаказа);
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	
	Если ДанныеЗаказа.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		ТипКонтрагента = "ФизическоеЛицо";
		РеквизитыПокупателя = "ПолноеНаименование,Телефон";
	Иначе
		ТипКонтрагента = "ЮридическоеЛицо";
		РеквизитыПокупателя = "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефон";
	КонецЕсли;
	
	ЗаказНаОплату.ОбщиеПараметрыЗаказа.ТипКонтрагента = ТипКонтрагента;
	ПлановыеДатыОплаты = ПолучитьИзВременногоХранилища(ДанныеЗаказа.ЭтапыОплаты);
	ПлановыеДатыОплаты.Сортировать("ДатаПлатежа Убыв");
	ДатаОплаты = ПлановыеДатыОплаты[0].ДатаПлатежа;
	ЗаказНаОплату.ОбщиеПараметрыЗаказа.СрокЖизни = ДатаОплаты + 86400;
	
	ЗаказНаОплату.ВизуализацияЗаказа.Представление = СтрШаблон(
		НСтр("ru = 'Заказ № %1 от %2.'"),
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеЗаказа.Номер),
		Формат(ДанныеЗаказа.Дата, "ДЛФ=DD"));
	ЗаказНаОплату.ВизуализацияЗаказа.ДополнительнаяИнформация = ДанныеЗаказа.ДополнительнаяИнформация;
	ЗаказНаОплату.ВизуализацияЗаказа.ПоставщикЗаголовок = НСтр("ru = 'Продавец'");
	ЗаказНаОплату.ВизуализацияЗаказа.ПокупательЗаголовок = НСтр("ru = 'Покупатель'");
	
	РеквизитыПродавца = "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефон,НомерСчета,Банк,БИК,КоррСчет";
	СписокСведенийПродавца = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеЗаказа.Организация, ДанныеЗаказа.Дата, , ДанныеЗаказа.БанковскийСчетОрганизации);
	ПоставщикПредставление = ФормированиеПечатныхФорм.ОписаниеОрганизации(СписокСведенийПродавца, РеквизитыПродавца);
	ЗаказНаОплату.ВизуализацияЗаказа.ПоставщикПредставление = ПоставщикПредставление;
	
	СписокСведенийПокупателя = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеЗаказа.Контрагент, ДанныеЗаказа.Дата);
	ПокупательПредставление = ФормированиеПечатныхФорм.ОписаниеОрганизации(СписокСведенийПокупателя, РеквизитыПокупателя);
	ЗаказНаОплату.ВизуализацияЗаказа.ПокупательПредставление = ПокупательПредставление;
	
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		НоваяСтрока = ЗаказНаОплату.Товары.Добавить();
		НоваяСтрока.ИдентификаторТовара = СокрЛП(СтрокаТаблицы.ИдентификаторТовара);
		НоваяСтрока.Наименование = СокрЛП(СтрокаТаблицы.Наименование);
		НоваяСтрока.Количество = СтрокаТаблицы.Количество;
		НоваяСтрока.СуммаСоСкидкой = СтрокаТаблицы.СуммаСНДС;
		НоваяСтрока.Скидка = СтрокаТаблицы.Скидка;
		НоваяСтрока.СуммаНДС = СтрокаТаблицы.СуммаНДС;
		
	КонецЦикла;
	
	НазначениеПлатежа = ДенежныеСредстваСервер.НазначениеПлатежаДокументаОперации(ДокументЗаказа, ДанныеЗаказа, ТаблицаТоваров);
	ЗаказНаОплату.ПараметрыОплат.ПоРеквизитам.ДанныеQR = ДанныеQR(СписокСведенийПродавца, ТаблицаТоваров, НазначениеПлатежа);
	РеквизитыПолучателя = "ПолноеНаименование,ИНН,КПП,НомерСчета,Банк,БИК,КоррСчет";
	ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СписокСведенийПродавца, РеквизитыПолучателя);
	ЗаказНаОплату.ПараметрыОплат.ПоРеквизитам.Представление = ПредставлениеПолучателя + ", " + НазначениеПлатежа;
	
	Если ЗаказНаОплату.ПараметрыОплат.СБП <> Неопределено Тогда
		
		Если ЗаказНаОплату.ПараметрыОплат.СБП.b2b <> Неопределено Тогда
		
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.СуммаНДС = ЗаказНаОплату.Товары.Итог("СуммаНДС");
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.ОблагаетсяНДС = (ЗаказНаОплату.Товары.Итог("СуммаНДС") <> 0);
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.РасчетныйСчет = ДанныеЗаказа.НомерСчета;
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.ИдентификаторПлатежа = ДанныеЗаказа.ИдентификаторПлатежа;
			
			НазначениеПлатежаПоШаблону = НазначениеПлатежаПоШаблону(
				ДокументЗаказа, ДанныеЗаказа, ТаблицаТоваров, ЗаказНаОплату.ПараметрыОплат.СБП.b2b.ШаблоныНазначения);
			ЗаказНаОплату.ПараметрыОплат.СБП.b2b.НазначениеПлатежа = 
				?(НазначениеПлатежаПоШаблону = "", НазначениеПлатежа, НазначениеПлатежаПоШаблону);
			
		КонецЕсли;
	
		Если ЗаказНаОплату.ПараметрыОплат.СБП.c2b <> Неопределено Тогда
			
			НазначениеПлатежаПоШаблону = НазначениеПлатежаПоШаблону(
				ДокументЗаказа, ДанныеЗаказа, ТаблицаТоваров, ЗаказНаОплату.ПараметрыОплат.СБП.c2b.ШаблоныНазначения);
			ЗаказНаОплату.ПараметрыОплат.СБП.c2b.НазначениеПлатежа = 
				?(НазначениеПлатежаПоШаблону = "", НазначениеПлатежа, НазначениеПлатежаПоШаблону);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриЗагрузкеСтатусаЗаказа.
//
Процедура ПриЗагрузкеСтатусаЗаказа(ДокументЗаказа, СтатусЗаказа, ПараметрыОплаты, Обработан) Экспорт
	
	Если Не СтатусЗаказа = "Оплачен" Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПараметрОплаты Из ПараметрыОплаты Цикл
		
		Если ПараметрОплаты.Ключ = "СБПc2b" Тогда
			
			ПараметрОплатыСБП = ПараметрыОплаты[ПараметрОплаты.Ключ];
			ПереводыСБПc2bПереопределяемый.ПриЗагрузкеСтатусаОперации(
				ДокументЗаказа, ПараметрОплатыСБП.НастройкаПодключения, ПараметрОплатыСБП.РезультатОбработки, Обработан);
			
		ИначеЕсли ПараметрОплаты.Ключ = "СБПb2b" Тогда
			
			ПараметрОплатыСБП = ПараметрыОплаты[ПараметрОплаты.Ключ];
			СистемаБыстрыхПлатежейУТ.ПриЗагрузкеСтатусаОперацииb2b(
				ДокументЗаказа, ПараметрОплатыСБП.НастройкаПодключения, ПараметрОплатыСБП.РезультатОбработки, Обработан);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ШаблоныСообщений

// См. ОнлайнЗаказыПереопределяемый.ПриПроверкеИспользованияШаблоновСообщенийОнлайнЗаказов.
//
Процедура ПриПроверкеИспользованияШаблоновСообщенийОнлайнЗаказов(Используется) Экспорт
	
	Используется = Истина;
	
КонецПроцедуры

// См. ОнлайнЗаказыПереопределяемый.ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам.
//
Процедура ПриОпределенииПредопределенныхШаблоновСообщенийОнлайнЗаказовПоТипам(Шаблоны) Экспорт
	
	ШаблонТема = НСтр("ru = 'Онлайн-заказ: %1'");
	ШаблонТекстаПисьма = ТекстШаблонаПисьма();
	ШаблонТекстаСМС = ТекстШаблонаСМС();
	
	ОбъектДокумент = Метаданные.НайтиПоПолномуИмени("Документ.ЗаказКлиента");
	СтандартныеРеквизитыДокумента = ОбъектДокумент.СтандартныеРеквизиты; // ОписанияСтандартныхРеквизитов
		
	Номер = СтрШаблон("[%1.%2]", ОбъектДокумент.Имя, СтандартныеРеквизитыДокумента.Номер.Имя);
	Дата = СтрШаблон("[%1.%2{ДЛФ=''dd.MM.yyyy''}]", ОбъектДокумент.Имя, СтандартныеРеквизитыДокумента.Дата.Имя);
	
	СведенияДокумента = СтрШаблон(НСтр("ru = '%1 от %2'"), Номер, Дата);
	
	РеквизитыДокумента = ОбъектДокумент.Реквизиты;
	
	Если РеквизитыДокумента.Найти("СуммаДокумента") <> Неопределено Тогда
		
		СуммаДокумента = СтрШаблон("[%1.%2]", ОбъектДокумент.Имя, РеквизитыДокумента.СуммаДокумента.Имя);
		СведенияДокумента = СтрШаблон(НСтр("ru = '%1 на сумму %2 руб.'"), СведенияДокумента, СуммаДокумента)
		
	Иначе
		СуммаДокумента = "";
	КонецЕсли;
	
	Тема = СтрШаблон(ШаблонТема, СведенияДокумента);
	ТипСправочникаПартнеры = Новый ОписаниеТипов("СправочникСсылка.Партнеры");
	
	Если РеквизитыДокумента.Найти("Партнер") <> Неопределено
		И РеквизитыДокумента.Партнер.Тип = ТипСправочникаПартнеры Тогда
		Покупатель = СтрШаблон("[%1.%2]", ОбъектДокумент.Имя, НСтр("ru = 'ПартнерНаименование'"));
	Иначе
		Покупатель = "";
	КонецЕсли;
	
	ПредставлениеСсылки = СтрШаблон("[%1.%2]", ОбъектДокумент.Имя, НСтр("ru = 'ПредставлениеСсылкиОнлайнЗаказа'"));
	
	ТекстШаблонаПисьма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонТекстаПисьма,
		НСтр("ru = 'Благодарим за заказ и просим оплатить.'"),
		Покупатель,
		Номер,
		Дата,
		СтрШаблон(НСтр("ru = '%1 руб.'"), СуммаДокумента),
		ПредставлениеСсылки);
	
	ТекстШаблонаСМС = СтрШаблон(
		ШаблонТекстаСМС,
		НСтр("ru = 'Благодарим за заказ и просим оплатить.'"),
		СтрШаблон(НСтр("ru = '%1 руб.'"), СуммаДокумента),
		ПредставлениеСсылки);
	
	ШаблонПисьма = Новый Структура;
	ШаблонПисьма.Вставить("ТипШаблона", "Письмо");
	ШаблонПисьма.Вставить("ПолноеИмяТипаНазначения", "Документ.ЗаказКлиента");
	ШаблонПисьма.Вставить("Наименование", НСтр("ru = 'Онлайн-заказ (почта)'"));
	ШаблонПисьма.Вставить("Тема", Тема);
	ШаблонПисьма.Вставить("Текст", СтрЗаменить(ТекстШаблонаПисьма, Символы.ПС, ""));
	
	ШаблонСМС = Новый Структура;
	ШаблонСМС.Вставить("ТипШаблона", "SMS");
	ШаблонСМС.Вставить("ПолноеИмяТипаНазначения", "Документ.ЗаказКлиента");
	ШаблонСМС.Вставить("Наименование", НСтр("ru = 'Онлайн-заказ (смс)'"));
	ШаблонСМС.Вставить("Тема", Тема);
	ШаблонСМС.Вставить("Текст", ТекстШаблонаСМС);
	
	Шаблоны.Добавить(ШаблонПисьма);
	Шаблоны.Добавить(ШаблонСМС);
	
КонецПроцедуры

#КонецОбласти

#Область ОтправкаСообщений

// См. ОнлайнЗаказыПереопределяемый.ПриФормированииСпискаПолучателейСообщенияОнлайнЗаказов.
//
Процедура ПриФормированииСпискаПолучателейСообщенияОнлайнЗаказов(ДокументЗаказа, ВариантОтправки, Получатели) Экспорт
	
	ИменаОснованийЗаказа = Новый Массив;
	ПриОпределенииОснованияЗаказа(ИменаОснованийЗаказа);
	
	ОбъектДокумент = ДокументЗаказа.Метаданные();
	Если ИменаОснованийЗаказа.Найти(ОбъектДокумент.ПолноеИмя()) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = Новый Соответствие;
	Реквизиты.Вставить("Контрагент", "Контрагент");
	РеквизитыДокумента = ДенежныеСредстваСервер.ДанныеДокумента(ДокументЗаказа, Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом, Реквизиты);
	
	Если Не ЗначениеЗаполнено(РеквизитыДокумента.Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	ВидыКонтактнойИнформацииДляОтбора = Новый Массив;
	
	Если ВариантОтправки = "ЭлектроннаяПочта" Тогда
		ВидыКонтактнойИнформацииДляОтбора.Добавить(Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
	ИначеЕсли ВариантОтправки = "Телефон" Тогда
		ВидыКонтактнойИнформацииДляОтбора.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	КонецЕсли;
	
	КонтактнаяИнформацияКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		РеквизитыДокумента.Контрагент, , ВидыКонтактнойИнформацииДляОтбора, ТекущаяДатаСеанса());
	
	Для Каждого ЗаписьКонтактнойИнформации Из КонтактнаяИнформацияКонтрагента Цикл
		Если ЗначениеЗаполнено(ЗаписьКонтактнойИнформации.Представление) Тогда
			Получатели.Добавить(ЗаписьКонтактнойИнформации.Представление);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Возращает признак наличия активной ссылки на оплату онлайн-заказа.
// 
// Параметры:
//  ДокументЗаказа - ДокументСсылка.ЗаказКлиента - Документ, для которого выполняется проверка.
// 
// Возвращаемое значение:
//  Булево - признак наличия активной ссылки.
Функция ЕстьАктивнаяСсылкаНаОнлайнЗаказ(ДокументЗаказа) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыОнлайнЗаказов.СтатусЗаказа КАК СтатусЗаказа
		|ИЗ
		|	РегистрСведений.ИдентификаторыОнлайнЗаказов КАК ИдентификаторыОнлайнЗаказов
		|ГДЕ
		|	ИдентификаторыОнлайнЗаказов.ДокументЗаказа = &ДокументЗаказа";
	
	Запрос.УстановитьПараметр("ДокументЗаказа", ДокументЗаказа);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	ЕстьСсылка = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаВыполняется()
			Или Выборка.СтатусЗаказа = ОнлайнЗаказыКлиентСервер.СтатусЗаказаВыполняетсяОплата() Тогда
			ЕстьСсылка = Истина;
		Иначе
			ЕстьСсылка = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЕстьСсылка;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает фоновое задание на загрузку статусов операций.
// 
// Возвращаемое значение:
//  Структура - Задание на загрузку статусов операций:
// * Статус - Строка - статус фонового задания.
// * ИдентификаторЗадания - Неопределено, УникальныйИдентификатор - идентификатор задания.
// * АдресРезультата - Строка - адрес временного хранилища, в которое будет помещен результат работы процедуры.
// * АдресДополнительногоРезультата - Строка - адрес дополнительного временного хранилища.
// * ИнформацияОбОшибке - Неопределено, ИнформацияОбОшибке - информация об ошибке.
// * КраткоеПредставлениеОшибки - Строка - краткое описание ошибки.
// * ПодробноеПредставлениеОшибки - Строка - подробное описание ошибки
// * Сообщения - ФиксированныйМассив из Строка - список сообщений, сформированный во время выполнения задания.
Функция ЗаданиеНаЗагрузкуСтатусовОпераций() Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Загрузка статусов операций онлайн-заказов'");
	ПараметрыПроцедуры = Новый Структура;
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьВФоне("ОнлайнЗаказыУТ.ЗагрузкаСтатусовОпераций", ПараметрыПроцедуры, ПараметрыВыполнения);
	
	Возврат ФоновоеЗадание;

КонецФункции

// Выполняет загрузку статусов операций в регистр ИдентификаторыОнлайнЗаказов и создает документы оплаты в зависимости от вида плательщика.
//
// Параметры:
//  ПараметрыПроцедуры - Структура - параметры процедуры.
//  АдресХранилища - Строка - адрес результата.
//
Процедура ЗагрузкаСтатусовОпераций(ПараметрыПроцедуры, АдресХранилища) Экспорт

	ОбработанныеЗаказы = ОнлайнЗаказы.СтатусыЗаказов();
	СведенияОбОперациях = РегистрыСведений.ИдентификаторыОнлайнЗаказов.ДанныеЗаказов(ОбработанныеЗаказы);
	
	Результат = Новый Соответствие;
	
	Для Каждого Операция Из СведенияОбОперациях Цикл
		
		Если Операция.Значение.СтатусЗаказа = ОнлайнЗаказыСлужебный.СтатусЗаказаОплачен() Тогда
			Результат.Вставить(Операция, 1);
		КонецЕсли;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ДанныеQR(РеквизитыПолучателя, ТаблицаТовары, НазначениеПлатежа)

	РеквизитыПлатежа = НовыйРеквизитыПлатежаУФЭБС();
	
	РеквизитыПлатежа.ТекстПолучателя             = РеквизитыПолучателя.ПолноеНаименование;
	РеквизитыПлатежа.НомерСчетаПолучателя        = РеквизитыПолучателя.НомерСчета;
	РеквизитыПлатежа.НаименованиеБанкаПолучателя = РеквизитыПолучателя.Банк;
	РеквизитыПлатежа.БИКБанкаПолучателя          = РеквизитыПолучателя.БИК;
	РеквизитыПлатежа.СчетБанкаПолучателя         = РеквизитыПолучателя.КоррСчет;
	РеквизитыПлатежа.ИННПолучателя               = РеквизитыПолучателя.ИНН;
	РеквизитыПлатежа.КПППолучателя               = РеквизитыПолучателя.КПП;
	РеквизитыПлатежа.СуммаЧислом                 = ТаблицаТовары.Итог("СуммаСНДС");
	РеквизитыПлатежа.НазначениеПлатежа           = НазначениеПлатежа;
	
	Возврат УправлениеПечатьюРФ.ФорматнаяСтрокаУФЭБС(РеквизитыПлатежа);
	
КонецФункции

Функция НовыйРеквизитыПлатежаУФЭБС()
	
	Возврат Новый Структура(
		"ТекстПолучателя,
		|НомерСчетаПолучателя,
		|НаименованиеБанкаПолучателя,
		|БИКБанкаПолучателя,
		|СчетБанкаПолучателя,
		|ИндексПлатежногоДокумента,
		|ИННПолучателя,
		|КПППолучателя,
		|СуммаЧислом,
		|НазначениеПлатежа");
	
КонецФункции

Функция ТекстШаблонаПисьма()

	ТекстШаблона = 
		"<html>
		|<head>
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
		|<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
		|<meta name=""format-detection"" content=""telephone=no"" />
		|<style type=""text/css"">
		|body{margin:0;padding:8px;overflow:auto;width:100%;height:100%;}
		|p{line-height:1.15;margin:0;}
		|ol,ul{margin-top:0;margin-bottom:0;}
		|img{border:none;}
		|</style>
		|</head>
		|<body>
		|<p>%1</p>
		|<p></p>
		|<p><strong>Покупатель:</strong> %2<br>
		|<strong>Заказ:</strong> %3 от %4 <br>
		|<strong>К оплате:</strong> %5</p>
		|<p></p>
		|<p>%6</p>
		|</body>
		|</html>";
	
	Возврат ТекстШаблона;

КонецФункции

Функция ТекстШаблонаСМС()

	ТекстШаблона = НСтр(
		"ru = '%1
		|
		|Сумма заказа: %2
		|
		|Заказ можно оплатить, перейдя по ссылке %3'");
	Возврат ТекстШаблона;

КонецФункции

Функция ДоступныеНастройкиОплатПоРеквизитам(Организация, ВидКонтрагента)

	ДоступныеНастройки = Новый Массив;
	
	Если ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		ФизЛицо = Истина;
	Иначе
		ФизЛицо = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиПодключенияКОнлайнЗаказам.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиПодключенияКОнлайнЗаказам КАК НастройкиПодключенияКОнлайнЗаказам
		|ГДЕ
		|	НастройкиПодключенияКОнлайнЗаказам.Организация = &Организация
		|	И НастройкиПодключенияКОнлайнЗаказам.Используется
		|	И ВЫБОР
		|			КОГДА &ФизЛицо
		|				ТОГДА НастройкиПодключенияКОнлайнЗаказам.ПоРеквизитамОтФизЛиц
		|			ИНАЧЕ НастройкиПодключенияКОнлайнЗаказам.ПоРеквизитамОтЮрЛиц
		|		КОНЕЦ = ИСТИНА";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		ДоступныеНастройки.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ДоступныеНастройки;

КонецФункции

Функция ДоступныеНастройкиОплатСБП(ВидКонтрагента, Организация, БанковскийСчет, Склад)

	ДоступныеНастройки = Новый Массив;
	
	Если ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.СБПc2b;
		НастройкиСБП = СистемаБыстрыхПлатежейУТ.НастройкиПодключенияC2B(Организация, Склад);
	Иначе
		СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.СБПb2b;
		НастройкиСБП = СистемаБыстрыхПлатежейУТ.НастройкиПодключенияB2B(Организация, БанковскийСчет, Склад);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиОплаты.НастройкаПодключения КАК НастройкаПодключения,
		|	НастройкиОплаты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиПодключенияКОнлайнЗаказам.НастройкиОплаты КАК НастройкиОплаты
		|ГДЕ
		|	НастройкиОплаты.СпособОплаты = &СпособОплаты
		|	И НастройкиОплаты.Ссылка.Организация = &Организация
		|	И НастройкиОплаты.Ссылка.Используется";
	
	Запрос.УстановитьПараметр("СпособОплаты", СпособОплаты);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НастройкиСБП.Найти(Выборка.НастройкаПодключения) <> Неопределено
			И ДоступныеНастройки.Найти(Выборка.Ссылка) = Неопределено Тогда
			ДоступныеНастройки.Добавить(Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДоступныеНастройки;

КонецФункции

Функция НазначениеПлатежаПоШаблону(ДокументЗаказа, ДанныеЗаказа, ТаблицаТоваров, Шаблоны)

	Отбор = Новый Структура;
	Отбор.Вставить("Идентификатор", ДокументЗаказа.Метаданные().Имя);
	НайденныеСтроки = Шаблоны.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() <> 0 Тогда
		ШаблонНазначения = НайденныеСтроки[0];
	Иначе
		ШаблонНазначения = Неопределено;
	КонецЕсли;
	
	Результат = "";
	
	Если ШаблонНазначения <> Неопределено Тогда
		
		Результат = СтрЗаменить(
			ШаблонНазначения.НазначениеПлатежа, "[Номер]", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеЗаказа.Номер));
		Результат = СтрЗаменить(
			Результат, "[Дата]", Формат(ДанныеЗаказа.Дата, "ДЛФ=D"));
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти