Процедура ЗагрузитьДоговорКонтрагента(Выборка, Пакет) Экспорт
	
	ДатаНачалаДействия = ПрочитатьДатуJSON(Пакет.ДатаНачалаДействия, ФорматДатыJSON.ISO);
	Если ДатаНачалаДействия < Дата(2025, 04, 20) Тогда
		Возврат;
	КонецЕсли;
	ДатаОкончанияДействия = ПрочитатьДатуJSON(Пакет.ДатаОкончанияДействия, ФорматДатыJSON.ISO);
	
	Если Пакет.ВидДокумента = "???Контракты с гос.заказчиками" Тогда
		
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
		Наименование = СтрШаблон("Государственный контракт № %1 от %2 г.", Пакет.АУ_НомерДоговора, Формат(ДатаНачалаДействия, "ДФ=dd.MM.yyyy"));
		Подразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию("Коммерческий отдел");
		ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура("ИНН", Пакет.Контрагент.ИНН);
	Контрагент = НайтиКонтрагентаПоПараметрам(ПараметрыПоиска);
	
	ПараметрыПоиска = Новый Структура("Номер,Контрагент", Пакет.АУ_НомерДоговора, Контрагент);
	Договор = НайтиДоговорПоПараметрам(ПараметрыПоиска);
	
	Валюта = Справочники.Валюты.НайтиПоКоду(Пакет.Валюта);
	
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		
		НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		НовыйДоговор.Номер = Пакет.Номер;
		НовыйДоговор.АУ_КраткийНомер = Прав(Пакет.Номер, 4);
		НовыйДоговор.Дата = ДатаНачалаДействия;
		НовыйДоговор.Наименование = Наименование;
		НовыйДоговор.Сумма = Пакет.Сумма;
		НовыйДоговор.ВалютаВзаиморасчетов = Валюта;
		НовыйДоговор.ХозяйственнаяОперация = ХозяйственнаяОперация;
		НовыйДоговор.ТипДоговора = ТипДоговора;
		НовыйДоговор.АУ_СуммаКомиссии = Пакет.АУ_СуммаКомиссии;
		НовыйДоговор.ВариантКурсаДоговора = Перечисления.ВариантыКурсаДоговора.Переменный;
		НовыйДоговор.ВариантОформленияЗакупок = Перечисления.ВариантыОформленияЗакупок.НеРазделять;
		НовыйДоговор.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
		НовыйДоговор.ДатаНачалаДействия = ДатаНачалаДействия;
		НовыйДоговор.ДатаОкончанияДействия = ДатаОкончанияДействия;
		НовыйДоговор.ЗакупкаПодДеятельностьОпределяетсяВДокументе = Истина;
		НовыйДоговор.Контрагент = Контрагент;
		НовыйДоговор.Партнер = Контрагент.Партнер;
		//НовыйДоговор.КонтактноеЛицо = ;
		НовыйДоговор.Организация = ПланыВидовХарактеристик.АУ_Настройки.ОрганизацияАурум.Значение;
		//НовыйДоговор.Менеджер = 
		НовыйДоговор.НаименованиеДляПечати = Наименование;
		НовыйДоговор.НалогообложениеНДСОпределяетсяВДокументе = Истина;
		НовыйДоговор.ПорядокОтраженияНеотфактурованныхПоставокНУ = Перечисления.ВариантыОтраженияНеотфактурованныхПоставокНУ.ОтражатьПриПоступлении;
		НовыйДоговор.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам;
		НовыйДоговор.Согласован = Истина;
		НовыйДоговор.СпособВыставленияДокументов = Перечисления.СпособыВыставленияДокументов.Автоматически;
		НовыйДоговор.СпособДоставки = Перечисления.СпособыДоставки.ОпределяетсяВРаспоряжении;
		НовыйДоговор.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
		НовыйДоговор.СтавкаНДС = УчетНДСЛокализация.СтавкаНДСПоПеречислению(Перечисления.СтавкиНДС.НДС20);
		//НовыйДоговор.ДолжностьРуководителя = Справочники.Должности.НайтиПоНаименованию("Генеральный директор");
		//НовыйДоговор.ПолРуководителяКонтрагента = Перечисления.ПолФизическогоЛица.Мужской;
		//НовыйДоговор.Руководитель = Справочники.ФизическиеЛица.НайтиПоНаименованию("Бондарев Александр Михайлович");
		//НовыйДоговор.СпособВыставленияДокументов = Перечисления.СпособыВыставленияДокументов.Автоматически;
		//НовыйДоговор.СпособЗаполненияСтавкиНДС = Перечисления.СпособыЗаполненияСтавкиНДС.Автоматически;
		//НовыйДоговор.СрокДействия = ДатаОкончанияДействия;
		//НовыйДоговор.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		//НовыйДоговор.СуммаВключаетНДС = Истина;
		//НовыйДоговор.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиДоговорПоПараметрам(ПараметрыПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	%1";
	
	МассивУсловий = Новый Массив;
	Для каждого стрУсловие Из ПараметрыПоиска Цикл
		МассивУсловий.Добавить(СтрШаблон("%1 = &%1", стрУсловие.Ключ));
		Запрос.УстановитьПараметр(СтрШаблон("%1", стрУсловие.Ключ), стрУсловие.Значение);
	КонецЦикла;
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, СтрСоединить(МассивУсловий, " И "));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиКонтрагентаПоПараметрам(ПараметрыПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	%1";
	
	МассивУсловий = Новый Массив;
	Для каждого стрУсловие Из ПараметрыПоиска Цикл
		МассивУсловий.Добавить(СтрШаблон("%1 = &%1", стрУсловие.Ключ));
		Запрос.УстановитьПараметр(СтрШаблон("%1", стрУсловие.Ключ), стрУсловие.Значение);
	КонецЦикла;
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, СтрСоединить(МассивУсловий, " И "));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции