
#Область ПрограммныйИнтерфейс

#Область ПараметрыСканирования

// Заполняет параметры сканирования по контексту.
// 
// Параметры:
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка - источник заполнения параметров сканирования.
//  ВидПродукции - СправочникСсылка.ВидыПродукцииИС - по данному параметру будет происходить отбор заполнения.
//  ФормаВыбора - ФормаКлиентскогоПриложения - Форма выбора.
//  ПараметрыРежимаИсправленияОшибок - Структура - Параметры режима исправления ошибок.
Процедура ЗаполнитьПараметрыСканирования(ПараметрыСканирования, Контекст, ВидПродукции, ФормаВыбора, ПараметрыРежимаИсправленияОшибок = Неопределено) Экспорт

	Если ЗначениеЗаполнено(ВидПродукции) И Не КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияМОТП(ВидПродукции) Тогда
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(ВидПродукции) И Контекст = Неопределено Тогда
		ВключитьПоддержкуТабачнойПродукции(ПараметрыСканирования);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРасширенныеПараметрыСканированияПоДокументам(Контекст, ПараметрыСканирования, ФормаВыбора, ПараметрыРежимаИсправленияОшибок);
	
КонецПроцедуры

// Дополняет параметры сканирования свойствами специфичными для табачной продукции.
//
// Параметры:
// 	ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования.
// 	ВидПродукции          - СправочникСсылка.ВидыПродукцииИС - Вид продукции.
// 	АнализироватьУчитываемыеВидыПродукции - Булево - Анализировать учитываемые виды продукции.
// 	Операция              - ПеречислениеСсылка.ВидыОперацийИСМП - Вид операции.
// Возвращаемое значение:
// 	Булево - поддержка табачной продукции включена.
Функция ВключитьПоддержкуТабачнойПродукции(ПараметрыСканирования, ПараметрВидПродукции = Неопределено, АнализироватьУчитываемыеВидыПродукции = Истина, Операция = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрВидПродукции) И Не КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияМОТП(ПараметрВидПродукции) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если АнализироватьУчитываемыеВидыПродукции Тогда
		ВидыПродукцииМОТП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции(Ложь);
		Если ВидыПродукцииМОТП.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ВидыПродукцииМОТП = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииМОТП();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрВидПродукции) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыСканирования.ДопустимыеВидыПродукции, ВидыПродукцииМОТП, Истина);
	Иначе
		
		Если ТипЗнч(ПараметрВидПродукции) = Тип("СправочникСсылка.ВидыПродукцииИС") Тогда
			ВидыПродукции = Новый Массив();
			ВидыПродукции.Добавить(ПараметрВидПродукции);
		Иначе
			ВидыПродукции = ПараметрВидПродукции;
		КонецЕсли;
		
		Для Каждого ВидПродукции Из ВидыПродукции Цикл
			Если ВидыПродукцииМОТП.Найти(ВидПродукции) <> Неопределено Тогда
				ПараметрыСканирования.ДопустимыеВидыПродукции.Добавить(ВидПродукции);
			КонецЕсли;
		КонецЦикла;
		
		Если ПараметрыСканирования.ДопустимыеВидыПродукции.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ДополнитьПараметрамиСканированияИСМП(ПараметрыСканирования);
	
	ДляВидаПродукцииСуществуетМРЦ = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДоступноПолеМРЦ(ПараметрыСканирования.ДопустимыеВидыПродукции);
	
	Если ОбщегоНазначенияИСМПКлиентСервер.ЗначениеПараметраСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования)
		И ДляВидаПродукцииСуществуетМРЦ Тогда
		ПараметрыСканирования.ВариантПолученияМРЦ = "ВычислениеИЗапрос";
	Иначе
		ПараметрыСканирования.ВариантПолученияМРЦ = "Вычисление";
	КонецЕсли;
	
	ПараметрыСканирования.ИСМП = Истина;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРасширенныеПараметрыСканированияПоДокументам(Контекст, ПараметрыСканирования, ФормаВыбора, ПараметрыРежимаИсправленияОшибок)
	
	Если ОбщегоНазначенияИСКлиентСервер.ЭтоРасширеннаяВерсияГосИС("ИСМП") Тогда
		
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			//@skip-check wrong-string-literal-content
			Модуль = ОбщегоНазначения.ОбщийМодуль("ШтрихкодированиеМОТПКлиентСервер");
		#Иначе
			//@skip-check wrong-string-literal-content
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ШтрихкодированиеМОТПКлиентСервер");
		#КонецЕсли
		
		Модуль.ЗаполнитьРасширенныеПараметрыСканированияПоДокументам(Контекст, ПараметрыСканирования, ФормаВыбора, ПараметрыРежимаИсправленияОшибок);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
