// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.НадписьПерейтиВНастройки.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.Обработки.ПанельАдминистрированияБЭД)
			И МашиночитаемыеДоверенности.ЕстьПравоНастройкиОбменаСКонтрагентами();
	
	РежимСтрогойПроверкиДоверенностейОтключенЭДО = МашиночитаемыеДоверенности.РежимСтрогойПроверкиДоверенностейОтключен();
		
	Если РежимСтрогойПроверкиДоверенностейОтключенЭДО Тогда
		ПредставлениеВариантаПроверки = НСтр("ru = 'Не блокировать, оставлять на усмотрение ответственного'");
	Иначе
		ПредставлениеВариантаПроверки = НСтр("ru = 'Блокировать работу с документами, не прошедшими проверку'");
	КонецЕсли;
		
	Элементы.НадписьИнформация.Заголовок = СтрШаблон(
		НСтр("ru = 'В 1С-ЭДО доступно два варианта проверки полномочий МЧД:
			| - блокировать работу с документами, не прошедшими проверку;
			| - не блокировать, оставлять на усмотрение ответственного.
			|
			|Сейчас выбран вариант ""%1"".
			|Изменить вариант может ответственный за ЭДО или Администратор в настройках программы.
			|Выбранный вариант применяется для всех накопленных МЧД.'") + Символы.ПС, 
				ПредставлениеВариантаПроверки);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПерейтиВНастройкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, 
	СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Раздел", "НастройкиЭДО");
	
	ОткрытьФорму(
		"Обработка.ПанельАдминистрированияБЭД.Форма.ОбщиеНастройки",
		ПараметрыФормы,,Истина);
	
КонецПроцедуры

#КонецОбласти

