// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.НадписьПерейтиВНастройки.Видимость = 
		ПравоДоступа("Просмотр", Метаданные.Обработки.ПанельАдминистрированияБЭД)
		И МашиночитаемыеДоверенности.ЕстьПравоНастройкиОбменаСКонтрагентами();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПерейтиВНастройкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, 
	СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Раздел", "НастройкиЭДО");
	
	ОткрытьФорму(
		"Обработка.ПанельАдминистрированияБЭД.Форма.ОбщиеНастройки",
		ПараметрыФормы,,Истина);
	
КонецПроцедуры

#КонецОбласти

