///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// Параметры транспорта. Возвращает параметры транспорта
// 
// Возвращаемое значение:
//  Структура - см. ТранспортСообщенийОбмена.СтруктураПараметровТранспорта 
Функция ПараметрыТранспорта() Экспорт
	
	Описание = НСтр("ru = 'Для подключения необходимо указать тип сообщения и систему назначения.'");
	
	Параметры = ТранспортСообщенийОбмена.СтруктураПараметровТранспорта();
	
	Параметры.Псевдоним = НСтр("ru = 'Шина'");
	Параметры.ИдентификаторТранспорта = "ш_ESB";
	Параметры.Описание = Описание;
	Параметры.Картинка = БиблиотекаКартинок.ХранилищеНастроек;
		
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НастройкиПодключенияВXML(НастройкиПодключения) Экспорт
	
	Возврат ТранспортСообщенийОбмена.НастройкиПодключенияВXML_1_2(НастройкиПодключения);
	
КонецФункции

Функция НастройкиПодключенияИзXML(ТекстXML) Экспорт
	
	Возврат ТранспортСообщенийОбмена.НастройкиПодключенияИзXML_1_2(ТекстXML, "ш_ESB");
	
КонецФункции

Функция НастройкиТранспортаВJSON(НастройкиТранспорта) Экспорт
	
	НастройкиТранспортаJSON = Новый Структура;
		
	НастройкиТранспортаJSON.Вставить("MessageType", Строка(НастройкиТранспорта.ТипСообщенияОбмена.УникальныйИдентификатор()));
	НастройкиТранспортаJSON.Вставить("System", Строка(НастройкиТранспорта.Система.УникальныйИдентификатор()));
	НастройкиТранспортаJSON.Вставить("Scenariy", Строка(НастройкиТранспорта.СценарийОбменаДанными.УникальныйИдентификатор()));
		
	Возврат НастройкиТранспортаJSON;
	
КонецФункции

Функция НастройкиТранспортаИзJSON(НастройкиТранспортаJSON) Экспорт
	
	НастройкиТранспорта = Новый Структура;

	Попытка
		НастройкиТранспорта.Вставить("Система", Справочники.ш_Системы.ПолучитьСсылку(Новый УникальныйИдентификатор(НастройкиТранспортаJSON.System)));
	Исключение
		НастройкиТранспорта.Вставить("Система", Справочники.ш_Системы.ПустаяСсылка());
	КонецПопытки;
	
	Попытка
		НастройкиТранспорта.Вставить("ТипСообщенияОбмена", Справочники.ш_ТипыСообщений.ПолучитьСсылку(Новый УникальныйИдентификатор(НастройкиТранспортаJSON.MessageType)));
	Исключение
		НастройкиТранспорта.Вставить("ТипСообщенияОбмена", Справочники.ш_ТипыСообщений.ПустаяСсылка());
	КонецПопытки;
	
	Попытка
		НастройкиТранспорта.Вставить("СценарийОбменаДанными", Справочники.СценарииОбменовДанными.ПолучитьСсылку(Новый УникальныйИдентификатор(НастройкиТранспортаJSON.Scenariy)));
	Исключение
		НастройкиТранспорта.Вставить("СценарийОбменаДанными", Справочники.СценарииОбменовДанными.ПустаяСсылка());
	КонецПопытки;
	
	Возврат НастройкиТранспорта;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли