Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаТрН(Данные, Представление, СтандартнаяОбработка, "1");
	
	Если Данные.Ссылка.НомИспр > 0 Тогда 
		Представление = "Испр.№ " + Данные.Ссылка.НомИспр + " " + Представление;
	КонецЕсли;
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("Водитель");
	МассивОбязательных.Добавить("ДатаВремяПодачиПлановая");
	МассивОбязательных.Добавить("ДатаВремяПрибытия");
	МассивОбязательных.Добавить("ДатаВремяУбытия");
	МассивОбязательных.Добавить("ИнициаторПереадресации");
	МассивОбязательных.Добавить("МассаБруттоКг");
	МассивОбязательных.Добавить("МетодОпределенияМассы");
	МассивОбязательных.Добавить("КоличествоМест");
	МассивОбязательных.Добавить("ТелефоныПереадресующегоМассив");
	
	// Подписанта теперь проверяем отдельным методом КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта
	// т.к. требуется учесть вариативность сценария отправки черновика (не нужен подписант) и подписанного (нужен подписант и настройки подписания)
	// МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовПрототипа() Экспорт
	
	МассивОбязательных = Новый Массив();
	// если выяснятся обязательные для прототипа - укажем их здесь	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ОтгрузочноеНаименование");
	МассивОбязательных.Добавить("СостояниеГруза");
	МассивОбязательных.Добавить("МассаПлановаяБруттоКг");
	МассивОбязательных.Добавить("СпособУпаковки");
	МассивОбязательных.Добавить("ВидТары");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("УказанияВОтношенииНормПеревозки");
	МассивОбязательных.Добавить("ДополнительныеВодителиМассив");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("КонтейнерыМассив");
	МассивОбязательных.Добавить("СведенияГосСистемыМассивСтруктур");
	МассивОбязательных.Добавить("ОпасныеГрузыМассивСтруктур");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("ДокументЭТРН");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфГО");
	МассивКлючевых.Добавить("ВрИнфГО");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция МассивЭлементовНедоступныхДляИсправления() Экспорт 
	
	Массив = Новый Массив;
	
	Массив.Добавить("ГруппаДатыИМеста");
	Массив.Добавить("СостояниеТары");
	Массив.Добавить("СостояниеУпаковки");
	Массив.Добавить("СостояниеКузова");
	 
	Возврат Массив;
	
КонецФункции

// какие поля могут быть высчитаны из базовых
Функция МассивБазовыхСоответствийРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ОтгрузочноеНаименование");
	МассивОбязательных.Добавить("СостояниеГруза");
	МассивОбязательных.Добавить("КодТНВЭД");
	МассивОбязательных.Добавить("КоличествоМест");
	МассивОбязательных.Добавить("МассаПлановаяБруттоКг");
	МассивОбязательных.Добавить("ОбъемКубМ");
	МассивОбязательных.Добавить("МассаПлановаяНеттоКг");
	МассивОбязательных.Добавить("КоличествоПаллет");
	МассивОбязательных.Добавить("ДопИнформация");
	МассивОбязательных.Добавить("ОбъявленнаяЦенность");
	МассивОбязательных.Добавить("ОбъявленнаяЦенностьВалюта");
	МассивОбязательных.Добавить("СпособУпаковки");
	МассивОбязательных.Добавить("ВидТары");
	МассивОбязательных.Добавить("Плотность");
	МассивОбязательных.Добавить("УчетГрузаВГИС");
	МассивОбязательных.Добавить("ЗначениеМаркировки");
	МассивОбязательных.Добавить("ОписаниеОпасногоГруза");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ТелефоныПереадресующегоМассив",
		"Телефоны переадресующих",
		"Указываются телефоны лиц, которые уполномочены переадресовывать трансп. средство в процессе исполнения перевозки",
		"МассивСтрок или Строка",
		1));
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ДополнительныеВодителиМассивСтруктур",
		"Дополнительные водители",
		"Указываются, если а/м управляют несколько водителей",
		"МассивСтруктур(см. таблицу ДополнительныеВодители)",
		2));
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ДополнительныеПолучателиФайлаМассивСтруктур",
		"Дополнительные получатели файла",
		"Указываются дополнительные получатели файла",
		"МассивСтруктур(см. таблицу ДополнительныеПолучателиФайла)",
		2));
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"СопроводительныеДокументыМассивСтруктур",
		"Сопроводительные документы",
		"Указываются сопроводительные документы",
		"МассивСтруктур(см. таблицу СопроводительныеДокументы)",
		2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("МаркировкиМассив", "Маркировки", "Маркировка(и) товара", "МассивСтрок или Строка", 3));
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("КонтейнерыМассив", "Контейнеры", "Идент. номера контейнеров", "МассивСтрок или Строка", 2));
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("СведенияГосСистемыМассивСтруктур", "Сведения из гос. систем контроля", "сведения о товаре, перевозка которого подлежит учету в государственной информационной системе", "МассивСтруктур(НаимГосСист,УчетЕд,ИнаяИнф,ИдНомУчетЕд)", 2));
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("ОпасныеГрузыМассивСтруктур", "Опасные грузы", "Сведения об опасных грузах ДОПОГ", "МассивСтруктур(см. спр.КонтурЛогистика_ОписанияОпасныхГрузов)", 2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

// Конец Обязательные манифесты

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ТребуемоеДействие = Неопределено,
	ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	ЭтоОтправкаЧерновика = (ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ОтправитьЧерновик
		Или (ПараметрыФормированияФайлов <> Неопределено
			И ПараметрыФормированияФайлов.Свойство("ТребуетсяПодпись")
			И Не ПараметрыФормированияФайлов.ТребуетсяПодпись
			И Не ПараметрыФормированияФайлов.Свойство("ПередатьНаПодписание")
			И Не ПараметрыФормированияФайлов.Свойство("ПередатьНаСогласованиеВодителю")));
	ЭтоПередачаНаПодписание = (ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаПодписание
		Или (ПараметрыФормированияФайлов <> Неопределено
			И ПараметрыФормированияФайлов.Свойство("ТребуетсяПодпись")
			И Не ПараметрыФормированияФайлов.ТребуетсяПодпись
			И ПараметрыФормированияФайлов.Свойство("ПередатьНаПодписание")));
	ЭтоСогласованиеСВодителем = (ТребуемоеДействие = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю
		Или (ПараметрыФормированияФайлов <> Неопределено
			И ПараметрыФормированияФайлов.Свойство("ТребуетсяПодпись")
			И Не ПараметрыФормированияФайлов.ТребуетсяПодпись
			И ПараметрыФормированияФайлов.Свойство("ПередатьНаСогласованиеВодителю")));
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		КрайнийФайл = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ДокументОбъектИлиСсылка.Ссылка);
		Если КрайнийФайл <> Неопределено И Не КрайнийФайл.ПодписьВерна Тогда
			
			ВыполнитьВалидации(ДокументОбъектИлиСсылка, ТаблицаОшибок, ТекСтатусТитула, ЭтоОтправкаЧерновика, ПараметрыФормированияФайлов);
			
		КонецЕсли;
		
	ИначеЕсли (Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена
		И Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан)
		Или ЭтоПередачаНаПодписание
		Или ЭтоСогласованиеСВодителем Тогда
		
		ВыполнитьВалидации(ДокументОбъектИлиСсылка, ТаблицаОшибок, ТекСтатусТитула, ЭтоОтправкаЧерновика, ПараметрыФормированияФайлов);
		
	Иначе
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиДругихСторон(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьВалидации(Знач ДокументОбъектИлиСсылка, Знач ТаблицаОшибок, Знач ТекСтатусТитула, Знач ЭтоОтправкаЧерновика, Знач ПараметрыФормированияФайлов)
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
	
	ЭтоОтправкаПрототипа = ДокументОбъектИлиСсылка.ЭтоПрототип;
	ЭтоОбработкаВходящего = (ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки);
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, ТаблицаОшибок);
	
	ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок, ТекСтатусТитула, ЭтоОтправкаПрототипа, ЭтоОтправкаЧерновика);
	
	ПроверитьТабЧастьТовары(ДокументОбъектИлиСсылка, ТаблицаОшибок, ЭтоОтправкаПрототипа, ЭтоОтправкаЧерновика);
	
	ВалидацияПрототиповИЧерновиков = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ВалидацияПрототиповИЧерновиков");
	
	Если ВалидацияПрототиповИЧерновиков
		Или (Не ЭтоОтправкаПрототипа И Не ЭтоОбработкаВходящего И Не ЭтоОтправкаЧерновика) Тогда
		
		ПроверитьОтметки(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		ПроверитьСпецУсловияДвижения(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		ПроверитьИнфПол(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		ПроверитьСопрДок(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьДружбуКонтрагентов(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьОтправителя(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок, ТекСтатусТитула, ЭтоОтправкаПрототипа, ЭтоОтправкаЧерновика)
	
	ВалидацияПрототиповИЧерновиков = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ВалидацияПрототиповИЧерновиков");
	
	ЭтоОбработкаВходящего = ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки;
	Если Не ВалидацияПрототиповИЧерновиков И (ЭтоОтправкаПрототипа Или ЭтоОтправкаЧерновика)
		Или ЭтоОбработкаВходящего Тогда
		
		ВместоОшибокПредупреждения = Истина;
	Иначе
		ВместоОшибокПредупреждения = Ложь;
	КонецЕсли;
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ДокументЭТРН = Объект.ДокументЭТРН;
	
	Если Не ЗначениеЗаполнено(ДокументЭТРН) И Не Объект.СозданВручную Тогда
		
		ТекстОшибки = "Титул не привязан к Документу электронной транспортной накладной";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		Если ЭтоОтправкаПрототипа Или ЭтоОтправкаЧерновика Тогда
			
			Если ЗначениеЗаполнено(Объект.Составитель) Тогда
				ОрганизацияОтправляющаяВАпиКонтент = Объект.Составитель;
			ИначеЕсли ЗначениеЗаполнено(Объект.ДокументЭТРН.ПогрузкуОсуществляет)
				И Объект.ДокументЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку Тогда
				
				ОрганизацияОтправляющаяВАпиКонтент = Объект.ДокументЭТРН.ПогрузкуОсуществляет;
			ИначеЕсли ЗначениеЗаполнено(Объект.ДокументЭТРН.Грузоотправитель) Тогда
				ОрганизацияОтправляющаяВАпиКонтент = Объект.ДокументЭТРН.Грузоотправитель;
			КонецЕсли;
			
			ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(ОрганизацияОтправляющаяВАпиКонтент);
			Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
				ТекстОшибки = "У отправителя прототипа (" + ОрганизацияОтправляющаяВАпиКонтент + ") нет авторизации в сервисе Логистика";
				Если ЭтоОтправкаЧерновика Тогда
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "прототипа", "черновика");
				КонецЕсли;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
					"Составитель", КатегорияОшибка, ТекстОшибки, "Указать");
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(Объект.Составитель) И Объект.Составитель <> Объект.ДокументЭТРН.Грузоотправитель Тогда
				ОрганизацияОтправляющаяВАпиКонтент = Объект.Составитель;
			ИначеЕсли ЗначениеЗаполнено(Объект.ДокументЭТРН.ПогрузкуОсуществляет) И Объект.ДокументЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку Тогда
				ОрганизацияОтправляющаяВАпиКонтент = Объект.ДокументЭТРН.ПогрузкуОсуществляет;
			Иначе
				ОрганизацияОтправляющаяВАпиКонтент = Объект.ДокументЭТРН.Грузоотправитель;
			КонецЕсли;
			
			ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(ОрганизацияОтправляющаяВАпиКонтент);
			
			Если Не ПараметрыСервиса.АвторизацияВыполнена
				И ЗначениеЗаполнено(Объект.ДокументЭТРН.ПогрузкуОсуществляет) 
				И Объект.ДокументЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку
				И Не ЭтоОбработкаВходящего Тогда 
				// требуется проверить подразделения в сценарии ЛОП = ПРВ при отправке в Диадок
				ПроверитьСценарийЛОПравенПВ(ДокументЭТРН, КатегорияОшибка, ТаблицаОшибок)
			КонецЕсли;
			
			Если Не ПараметрыСервиса.АвторизацияВыполнена
				И ЗначениеЗаполнено(Объект.Составитель)
				И Объект.Составитель <> Объект.ДокументЭТРН.Грузоотправитель Тогда
				
				ТекстОшибки = "У отправителя прототипа (" + ОрганизацияОтправляющаяВАпиКонтент + ") нет авторизации в сервисе Логистика";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", "Составитель", КатегорияОшибка, ТекстОшибки, "Указать");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВместоОшибокПредупреждения Тогда 
			КатегорияОшибка = КатегорияПредупреждение;
		КонецЕсли;
		
		Если Не ВалидацияПрототиповИЧерновиков И (ЭтоОтправкаПрототипа Или ЭтоОтправкаЧерновика) Тогда
			
			// Все ошибки стали предупреждениями т.к. в прототипе можно всё (почти)
			ТекстОшибки = "Вы отправляете прототип документа.
				|Проверки не блокируют отправку.";
			Если ЭтоОтправкаЧерновика Тогда
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "прототип", "черновик");
			КонецЕсли;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
				"Составитель", КатегорияПредупреждение, ТекстОшибки, "Оповещение");
			
		КонецЕсли;
		
		Если Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПогрузкуОсуществляетДругаяОрганизация(ДокументЭТРН) Тогда 
			
			Если НЕ ЗначениеЗаполнено(ДокументЭТРН.ПогрузкуОсуществляет) Тогда 
				ТекстОшибки = "В ЭТрН не указана организация,которая осуществляет погрузку";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент.ПогрузкуОсуществляет", КатегорияОшибка, ТекстОшибки, "Указать");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ДокументЭТРН.ПогрузкаСотрудник) Тогда 
				ТекстОшибки = "В ЭТрН не указан кладовщик (сотрудник осущ. погрузку)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент.ПогрузкаСотрудник", КатегорияОшибка, ТекстОшибки, "Указать");
			КонецЕсли;
			
		КонецЕсли;
		
		
		ОбязательныеРеквизитыТРН = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МассивОбязательныхРеквизитов();
		ОбязательныеРеквизитыПрототипаТРН = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.МассивОбязательныхРеквизитовПрототипа();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыТРН Цикл
			
			Если ОбязательныйРевизит = "УИД" Тогда 
				Продолжить; // ТРН Т1 можно отправлять без УИДа
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ДокументЭТРН[ОбязательныйРевизит])  Тогда
				
				текКатегория = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
				
				Если ВместоОшибокПредупреждения И ОбязательныеРеквизитыПрототипаТРН.Найти(ОбязательныйРевизит) = Неопределено Тогда 
					текКатегория = КатегорияПредупреждение;
				КонецЕсли;
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной транспортной накладной";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, текКатегория, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		Если ДокументЭТРН.Перевозчик.ИНН = ДокументЭТРН.Грузоотправитель.ИНН Тогда
		
			ТекстОшибки = "Укажите другую организацию грузоотправителя или перевозчика - они совпадают (в Документе электронной транспортной накладной).";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент.ДокументЭТРН", КатегорияПредупреждение, ТекстОшибки, "Указать");
		
		КонецЕсли;
		
		Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПроверитьКлючевыеРеквизитыЭтРН(ДокументЭТРН, ТаблицаОшибок, ВместоОшибокПредупреждения);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Составитель) Тогда
		ИстинныйГрузоотправитель = Объект.Составитель;	
	ИначеЕсли ДокументЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку И ЗначениеЗаполнено(ДокументЭТРН.ПогрузкуОсуществляет) Тогда 
		ИстинныйГрузоотправитель = ДокументЭТРН.ПогрузкуОсуществляет;
	Иначе
		ИстинныйГрузоотправитель = ДокументЭТРН.Грузоотправитель;
	КонецЕсли;
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(ИстинныйГрузоотправитель);
	
	Если Не ПараметрыСервиса.АвторизацияВыполнена И ЗначениеЗаполнено(ИстинныйГрузоотправитель) Тогда 
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("БратьУИДИзПулаДляТРН") Тогда 
			
			Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
				
				Если Не ЗначениеЗаполнено(Объект.ДокументЭТРН.УИД) Тогда
					ТекстОшибки = "Не указан УИД из пула ТрН";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
						"УИД", КатегорияОшибка, ТекстОшибки, "Взять из пула");
				КонецЕсли;
				
			Иначе
				
				ОстатокУИДов = РегистрыСведений.КонтурЛогистика_УИДыГИС.ОсталосьСвободныхУИДов(ИстинныйГрузоотправитель);
				Если ОстатокУИДов = 0 Тогда
					
					ТекстОшибки = "Не осталось свободных УИД в пуле. Получите новые или отключите использование пула.";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"УИД", КатегорияОшибка, ТекстОшибки, "Получить УИДы");
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбязательныеРеквизитыПрототипаТитула = МассивОбязательныхРеквизитовПрототипа();
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			текКатегория = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
			
			Если ВместоОшибокПредупреждения И ОбязательныеРеквизитыПрототипаТитула.Найти(ОбязательныйРевизит) = Неопределено Тогда 
				текКатегория = КатегорияПредупреждение;
			КонецЕсли;
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ТрН_Титул1.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, текКатегория, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.КоличествоМест > 999999 Тогда 
		
		ТекстОшибки = "Длина в поле ""Количество мест"" превышает 6.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"КоличествоМест", КатегорияОшибка, ТекстОшибки, "Исправить");
		
	КонецЕсли;	
	
	// Итог количество мест и массы брутто кг
	ИтогоКоличествоМест = 0;
	ИтогоМассаПлановаяБруттоКг = 0;
	
	ПараметрыОтбора = Новый Структура("Учитывать", Истина);
	НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		ИтогоКоличествоМест = ИтогоКоличествоМест + ТекущаяСтрока.КоличествоМест;
		ИтогоМассаПлановаяБруттоКг = ИтогоМассаПлановаяБруттоКг + ТекущаяСтрока.МассаПлановаяБруттоКг;
	КонецЦикла;
	
	Если Объект.КоличествоМест <> ИтогоКоличествоМест Тогда
		
		Если ЗначениеЗаполнено(Объект.НомИспр)
			И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест") Тогда 
			КатОшибки = КатегорияОшибка;
		Иначе
			КатОшибки = КатегорияПредупреждение;
		КонецЕсли;	

		ТекстОшибки = "Количество Мест в шапке документа отличается от итога по табличной части грузов";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"КоличествоМест", КатОшибки, ТекстОшибки, "Проверить");
		
	КонецЕсли;
	
	Если Объект.МассаБруттоКг <> ИтогоМассаПлановаяБруттоКг Тогда
		
		Если ЗначениеЗаполнено(Объект.НомИспр)
			И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто") Тогда 
			КатОшибки = КатегорияОшибка;
		Иначе
			КатОшибки = КатегорияПредупреждение;
		КонецЕсли;
		
		ТекстОшибки = "Масса Брутто в шапке документа отличается от итога по табличной части грузов";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"МассаБруттоКг", КатОшибки, ТекстОшибки, "Проверить");
	КонецЕсли;
	
	// Водитель
	ПроверитьВодителя(Объект.Водитель, ТаблицаОшибок, КатегорияОшибка, , ДокументЭТРН);
	
	ПроверитьВодителя(Объект.Водитель2, ТаблицаОшибок, КатегорияОшибка, "2", ДокументЭТРН);
	
	// ДополнительныеВодители
	Для Каждого Строка Из Объект.ДополнительныеВодители Цикл 
		
		ПроверитьВодителя(Строка.Водитель, ТаблицаОшибок, КатегорияОшибка, Строка, ДокументЭТРН);
		
	КонецЦикла;	
	
	// ТС
	ТранспортноеСредство = ДокументЭТРН.ТранспортноеСредство;
	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		
		ГрузоподъемностьТСИПрицепов = 0;
		Если ЗначениеЗаполнено(ТранспортноеСредство.ГрузоподъемностьТонн) Тогда
			ГрузоподъемностьТСИПрицепов = ГрузоподъемностьТСИПрицепов + ТранспортноеСредство.ГрузоподъемностьТонн;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументЭТРН.Прицеп.ГрузоподъемностьТонн) Тогда
			ГрузоподъемностьТСИПрицепов = ГрузоподъемностьТСИПрицепов + ДокументЭТРН.Прицеп.ГрузоподъемностьТонн;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументЭТРН.Прицеп2.ГрузоподъемностьТонн) Тогда
			ГрузоподъемностьТСИПрицепов = ГрузоподъемностьТСИПрицепов + ДокументЭТРН.Прицеп2.ГрузоподъемностьТонн;
		КонецЕсли;
		
		Если ГрузоподъемностьТСИПрицепов > 0
			И ГрузоподъемностьТСИПрицепов*1000 < Объект.МассаБруттоКг Тогда
			
			ТекстОшибки = "Масса брутто превышает грузоподъемность транспортного средства (с учетом прицепов)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"МассаБруттоКг", КатегорияОшибка, ТекстОшибки, "Проверить");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.ВидВладения) Тогда
			
			ТекстОшибки = "Укажите вид владения транспортным средством";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументЭТРН.ТранспортноеСредство.ВидВладения", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.ГрузоподъемностьТонн) Тогда
			
			Если Не ЗначениеЗаполнено(ДокументЭТРН.Прицеп) Тогда
				ТекстОшибки = "Укажите прицеп или грузоподъемность транспортного средства";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"РедактированиеЭТРН_Прицеп", КатегорияОшибка, ТекстОшибки, "Указать");
			Иначе
				ТекстОшибки = "Не указана грузоподъемность транспортного средства (тягач?)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ДокументЭТРН.ТранспортноеСредство.ГрузоподъемностьТонн", КатегорияПредупреждение, ТекстОшибки, "Проверить");
			КонецЕсли;
		
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.ВместимостьКубМ) Тогда
			
			Если Не ЗначениеЗаполнено(ДокументЭТРН.Прицеп) Тогда
				ТекстОшибки = "Укажите прицеп или вместимость транспортного средства";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"РедактированиеЭТРН_Прицеп", КатегорияОшибка, ТекстОшибки, "Указать");
			Иначе
				ТекстОшибки = "Не указана вместимость транспортного средства (тягач?)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ДокументЭТРН.ТранспортноеСредство.ВместимостьКубМ", КатегорияПредупреждение, ТекстОшибки, "Проверить");
			КонецЕсли;
			
		Иначе
			
			Если КоличествоЗнаковВЧисле(ТранспортноеСредство.ВместимостьКубМ) > 4 Тогда
				ТекстОшибки = "Неверный формат вместимости транспортного средства. Количество цифр в числе должно быть не более 4";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ДокументЭТРН.ТранспортноеСредство.ВместимостьКубМ", КатегорияОшибка, ТекстОшибки, "Проверить");	
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.ТипТС) Тогда
			
			ТекстОшибки = "Укажите тип транспортного средства";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументЭТРН.ТранспортноеСредство.ТипТС", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.МаркаТС) Тогда
			
			ТекстОшибки = "Укажите марку транспортного средства";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументЭТРН.ТранспортноеСредство.МаркаТС", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТранспортноеСредство.РегНомер) Тогда
			
			ТекстОшибки = "Укажите гос. рег. номер транспортного средства";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументЭТРН.ТранспортноеСредство.РегНомер", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Прицепы
	ПроверитьПрицеп(ДокументЭТРН.Прицеп, ТаблицаОшибок, КатегорияОшибка, "ДокументЭТРН.Прицеп");
	ПроверитьПрицеп(ДокументЭТРН.Прицеп2, ТаблицаОшибок, КатегорияОшибка, "ДокументЭТРН.Прицеп2");
	
	// Кладовщик
	Если ЗначениеЗаполнено(ДокументЭТРН.ПогрузкаСотрудник) Тогда
		
		Если Не ЗначениеЗаполнено(ДокументЭТРН.ПогрузкаСотрудник.Должность) Тогда
			
			ТекстОшибки = "Укажите должность кладовщика";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.ПогрузкаСотрудник.Должность", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
	КонецЕсли;
			
	// сведения о погрузке
	Если ЗначениеЗаполнено(ДокументЭТРН.МестоПогрузки.Собственник) 
		И Не ДокументЭТРН.МестоПогрузки.Собственник = ДокументЭТРН.Грузоотправитель Тогда
		
		Если Не ЗначениеЗаполнено(ДокументЭТРН.МестоПогрузки.ДоступКОбъектуДоговор)
			И Не ЗначениеЗаполнено(ДокументЭТРН.МестоПогрузки.ДоступКОбъектуТекст) Тогда 
			
			ТекстОшибки = "Укажите основание доступа в пункте погрузке";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументЭТРН.МестоПогрузки.ДоступКОбъектуДоговор", КатегорияОшибка, ТекстОшибки, "Указать");
			
		ИначеЕсли ЗначениеЗаполнено(ДокументЭТРН.МестоПогрузки.ДоступКОбъектуДоговор) Тогда
			
			Если Не ЗначениеЗаполнено(ДокументЭТРН.МестоПогрузки.ДоступКОбъектуДоговор.Организация) 
				И Не ЗначениеЗаполнено(ДокументЭТРН.МестоПогрузки.ДоступКОбъектуДоговор.ОрганизацияИНН) Тогда
					
				ТекстОшибки = "Укажите организацию или ИНН, в основание доступа в пункте погрузке";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ДокументЭТРН.МестоПогрузки.ДоступКОбъектуДоговор.ОрганизацияИНН", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(ДокументЭТРН.МестоПогрузки.ДоступКОбъектуДоговор.Контрагент) 
				И Не ЗначениеЗаполнено(ДокументЭТРН.МестоПогрузки.ДоступКОбъектуДоговор.КонтрагентИНН) Тогда
				
				ТекстОшибки = "Укажите контрагента или ИНН, в основание доступа в пункте погрузке";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ДокументЭТРН.МестоПогрузки.ДоступКОбъектуДоговор.КонтрагентИНН", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
			КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьДоговор(ДокументЭТРН.МестоПогрузки.ДоступКОбъектуДоговор, ТаблицаОшибок, КатегорияОшибка, "ДокументЭТРН.МестоПогрузки.ДоступКОбъектуДоговор.ДатаДокумента");  
			
		КонецЕсли;
		
	КонецЕсли;	
	
	// Точки доставки партнера EDI
	Если ЗначениеЗаполнено(ДокументЭТРН.ПартнерГрузополучатель) 
		И ЗначениеЗаполнено(ДокументЭТРН.МестоДоставки) Тогда 
		
		// обязательность GLN точки доставки
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиПартнера(ДокументЭТРН.ПартнерГрузополучатель, "ОбязательныйGLNТочкиДоставки") = Истина
			И Не ЗначениеЗаполнено(ДокументЭТРН.МестоДоставки.GLN) Тогда 
			
			ТекстОшибки = "Для партнера " + ДокументЭТРН.ПартнерГрузополучатель + " обязательно указывать GLN точки доставки";
			
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументЭТРН.МестоДоставки.GLN", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка, ТекстОшибки, "Указать GLN");
			
		КонецЕсли;
		
		// принадлежность точки доставки к партнеру
		Если ДокументЭТРН.МестоДоставки.КодПартнераКонтур <> ДокументЭТРН.ПартнерГрузополучатель.КодПартнераКонтур Тогда
			
			ТекстОшибки = "Точка доставки не из списка предоставленного партнером " + ДокументЭТРН.ПартнерГрузополучатель;
			
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументЭТРН.МестоДоставки", КатегорияПредупреждение, ТекстОшибки, "Проверить");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Объект.ТелефоныПереадресующего.Количество() Тогда 
		
		ТекстОшибки = "Укажите телефон переадресующего в таблице ""Телефоны переадресующих лиц""";
		
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ТелефоныПереадресующего", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе
		
		Для Каждого СтрокаТел Из Объект.ТелефоныПереадресующего Цикл 
			
			Если Не ЗначениеЗаполнено(СтрокаТел.Телефон) Тогда 
				
				ТекстОшибки = "Укажите номер телефона переадресующего";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "ТелефоныПереадресующего", СтрокаТел.НомерСтроки, 
					"Телефон", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать номер телефона");
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;
				
	Если Не ЗначениеЗаполнено(Объект.НомераЗаказов) 
		И ЗначениеЗаполнено(ДокументЭТРН.ПартнерГрузополучатель) Тогда
		
		ORDERSобязателен = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиПартнера(ДокументЭТРН.ПартнерГрузополучатель, "ОбязательныйНомерЗаказаТоваров");
		
		Если ORDERSобязателен = Истина Тогда 
			ТекстОшибки = "Для партнера " + ДокументЭТРН.ПартнерГрузополучатель + " обязательно указывать номер заказа товаров (настройка партнера)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, , , 
				"ORDERS", КатегорияОшибка, ТекстОшибки, "Указать",,,"Указать номер заказа товаров");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.НомераУПД) 
		И ЗначениеЗаполнено(ДокументЭТРН.ПартнерГрузополучатель) Тогда
		
		INVOICEобязателен = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиПартнера(ДокументЭТРН.ПартнерГрузополучатель, "ОбязательныйНомерУПД");
		
		Если INVOICEобязателен = Истина Тогда 
			ТекстОшибки = "Для партнера " + ДокументЭТРН.ПартнерГрузополучатель + " обязательно указывать номер УПД/INVOIC (настройка партнера)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, , , 
				"INVOICE", КатегорияОшибка, ТекстОшибки, "Указать",,,"Указать номер УПД");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.НомераDESADV) 
		И ЗначениеЗаполнено(ДокументЭТРН.ПартнерГрузополучатель) Тогда
		
		DESADVобязателен = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиПартнера(ДокументЭТРН.ПартнерГрузополучатель, "ОбязательныйНомерDESADV");
		
		Если DESADVобязателен = Истина Тогда 
			ТекстОшибки = "Для партнера " + ДокументЭТРН.ПартнерГрузополучатель + " обязательно указывать номера DESADV (уведомления об отгрузке)(настройка партнера)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, , , 
				"DESADV", КатегорияОшибка, ТекстОшибки, "Указать",,,"Указать номер DESADV товаров");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Составитель) 
		И Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ЯвляетсяУчастникомПеревозки(Объект.Составитель, ДокументЭТРН)
		И Объект.ДополнительныеПолучателиФайла.Найти(Объект.Составитель, "ОрганизацияДиадок") <> Неопределено Тогда
		
			ТекстОшибки = "Составитель не может быть дополнительным получателем файла, так как является участником перевозки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"СтраницаДополнительныеПолучатели", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	ПроверитьЗаказЗаявкуОснование(Объект, ДокументЭТРН, ТаблицаОшибок);
	
	// валидации титула исправления
	//Если ЗначениеЗаполнено(Объект.НомИспр) Тогда 
	//	
	//	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1АвтоитогКоличествоМест")
	//		И Объект.КоличествоМест <> Объект.Товары.Итог("КоличествоМест") Тогда 
	//		
	//		ТекстОшибки = "Количество мест в табличной части отличается от количества мест в шапке.";
	//		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
	//			"КоличествоМест", КатегорияОшибка, ТекстОшибки, "Исправить");
	//		
	//	КонецЕсли;
	//	
	//	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1АвтоитогМассаБрутто")
	//		И Объект.МассаБруттоКг <> Объект.Товары.Итог("МассаПлановаяБруттоКг") Тогда 
	//		
	//		ТекстОшибки = "Масса брутто в табличной части отличается от массы брутто в шапке.";
	//		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
	//			"МассаБруттоКг", КатегорияОшибка, ТекстОшибки, "Исправить");
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;	
			
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьЗаказЗаявкуОснование(Знач Титул1Объект, Знач ДокументЭТРН, ТаблицаОшибок)
	
	Перем СтатусДокументооборотаЗЗ, СтатусыЗавершена, СтатусыОтказ, ТекстОшибки;
	
	Если ЗначениеЗаполнено(ДокументЭТРН) Тогда
		
		ЗаказЗаявкаОснование = ДокументЭТРН.ЗаказЗаявкаОснование;
		
		Если Не ЗначениеЗаполнено(ЗаказЗаявкаОснование) Тогда 
			ТекстОшибки = "Не найден связанный электронный заказ(заявка)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.ЗаказЗаявкаОснование", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение, ТекстОшибки, "Внимание");
			Возврат;
		КонецЕсли;
		
		// проверим тек статус Заказа(заявки)
		СтатусДокументооборотаЗЗ = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(ЗаказЗаявкаОснование, Истина);
		СтатусыЗавершена = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостоянияЗЗ_ЗавешенаУспешно();
		СтатусыОтказ = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостоянияЗЗ_Отказы();
		
		Если СтатусыОтказ.Найти(СтатусДокументооборотаЗЗ) <> Неопределено Тогда 
			ТекстОшибки = "По заказу (заявке) Отказ. Статус: " + СтатусДокументооборотаЗЗ;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.ЗаказЗаявкаОснование", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение, ТекстОшибки, "Проверить");
		ИначеЕсли СтатусыЗавершена.Найти(СтатусДокументооборотаЗЗ) = Неопределено Тогда 
			ТекстОшибки = "Работа по заказу (заявке) не завершена. Статус: " + СтатусДокументооборотаЗЗ;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.ЗаказЗаявкаОснование", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение, ТекстОшибки, "Проверить");
		КонецЕсли;
		
		// Проверим Реквизиты Заказ(заявки)
		Если ЗначениеЗаполнено(ДокументЭТРН.МестоПогрузки) И ЗаказЗаявкаОснование.ПунктПод <> ДокументЭТРН.МестоПогрузки  Тогда 
			ТекстОшибки = "Пункт погрузки в ТРН отличается от пункта погрузки в заказе (заявке)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.ЗаказЗаявкаОснование", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка, ТекстОшибки, "Заменить");
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументЭТРН.Перевозчик) И ЗаказЗаявкаОснование.Перевозчик <> ДокументЭТРН.Перевозчик  Тогда 
			ТекстОшибки = "Перевозчик в ТРН отличается от перевозчика в заказе (заявке)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.ЗаказЗаявкаОснование", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка, ТекстОшибки, "Заменить");
		КонецЕсли;
		Если ЗначениеЗаполнено(Титул1Объект.ДатаВремяПодачиПлановая) И НачалоЧаса(ЗаказЗаявкаОснование.ДатВрПод) <> НачалоЧаса(Титул1Объект.ДатаВремяПодачиПлановая)  Тогда 
			ТекстОшибки = "Плановая дата-время подачи в ТРН отличается от даты-времени в заказе (заявке)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.ЗаказЗаявкаОснование", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение, ТекстОшибки, "Проверить");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Титул1Объект.МассаБруттоКг)
			И Титул1Объект.МассаБруттоКг > ЗаказЗаявкаОснование.ТСГрузопод*1000 Тогда 
			ТекстОшибки = "Масса брутто превышает указанную в заказе (заявке) грузоподъемность";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.ЗаказЗаявкаОснование", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение, ТекстОшибки, "Проверить");
		КонецЕсли;
		
		Титул2ЗЗ = КонтурЛогистика_ОбработкаДокументовСервер.НайтиЗЗтитул2(ЗаказЗаявкаОснование);
		Если ЗначениеЗаполнено(Титул2ЗЗ) Тогда
			
			// ТС
			Если ЗначениеЗаполнено(Титул2ЗЗ.ТранспортноеСредство) 
				И ЗначениеЗаполнено(ДокументЭТРН.ТранспортноеСредство) 
				И Титул2ЗЗ.ТранспортноеСредство <> ДокументЭТРН.ТранспортноеСредство Тогда 
				
				ТекстОшибки = "Транспортное средство в ТРН отличается от ТС в заказе (заявке)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументЭТРН.ЗаказЗаявкаОснование", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение, ТекстОшибки, "Проверить");
				
			КонецЕсли;
			
			// Водители
			Если Титул2ЗЗ.Водители.Количество() > 0  
				И ЗначениеЗаполнено(Титул1Объект.Водитель) 
				И Титул2ЗЗ.Водители[0].СвВодит <> Титул1Объект.Водитель Тогда 
				
				ТекстОшибки = "Водитель в ТРН отличается от водителя в заказе (заявке)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументЭТРН.ЗаказЗаявкаОснование", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение, ТекстОшибки, "Проверить");
			
			КонецЕсли;
			
			Если Титул2ЗЗ.Водители.Количество() > 1  
				И ЗначениеЗаполнено(Титул1Объект.Водитель2) 
				И Титул2ЗЗ.Водители[1].СвВодит <> Титул1Объект.Водитель2 Тогда 
				
				ТекстОшибки = "Водитель 2 в ТРН отличается от водителя 2 в заказе (заявке)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументЭТРН.ЗаказЗаявкаОснование", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение, ТекстОшибки, "Проверить");
			
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьСценарийЛОПравенПВ(Знач ДокументЭТРН, Знач КатегорияОшибка, Знач ТаблицаОшибок) Экспорт
	
	Перем НастроенноеПодразделениеОтпр, НастроенноеПодразделениеПолуч, ТекстОшибки;
	
	Если ЗначениеЗаполнено(ДокументЭТРН.ПогрузкуОсуществляет)
		И ЗначениеЗаполнено(ДокументЭТРН.Перевозчик)
		И ДокументЭТРН.ПогрузкуОсуществляет = ДокументЭТРН.Перевозчик Тогда 
		
		НастроенноеПодразделениеОтпр = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(
											ДокументЭТРН.ПогрузкуОсуществляет,
											Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеОтправительПутевогоЛиста);
		Если Не ЗначениеЗаполнено(НастроенноеПодразделениеОтпр) И Не ЗначениеЗаполнено(ДокументЭТРН.ПогрузкуОсуществляетПодразделение) Тогда 
			ТекстОшибки = "У Лица осуществляющего погрузку не указано ""Подразделение-отправитель по умолчанию"" в настройках";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.ПогрузкуОсуществляет", КатегорияОшибка, ТекстОшибки, "Указать");
		КонецЕсли;
		
		НастроенноеПодразделениеПолуч = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(
											ДокументЭТРН.Перевозчик,
											Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеПолучательПутевогоЛиста);
		Если Не ЗначениеЗаполнено(НастроенноеПодразделениеПолуч) И Не ЗначениеЗаполнено(ДокументЭТРН.ПеревозчикПодразделение) Тогда 
			ТекстОшибки = "У Перевозчика не указано ""Подразделение-получатель по умолчанию"" в настройках";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.Перевозчик", КатегорияОшибка, ТекстОшибки, "Указать");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НастроенноеПодразделениеОтпр) И ЗначениеЗаполнено(НастроенноеПодразделениеПолуч) 
			И НастроенноеПодразделениеОтпр = НастроенноеПодразделениеПолуч Тогда 
			ТекстОшибки = "У Лица осуществляющего погрузку ""Подразделение-отправитель по умолчанию"" в настройках совпадает с ""Подразделением-получателем""";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЭТРН.Перевозчик", КатегорияОшибка, ТекстОшибки, "Указать");
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьВодителя(Водитель, ТаблицаОшибок, КатегорияОшибка, СтрокаДопВодитель = Неопределено, ГлавныйДокумент)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьВодителя(Водитель, ТаблицаОшибок, КатегорияОшибка, СтрокаДопВодитель, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, ГлавныйДокумент);
	
КонецПроцедуры	

Процедура ПроверитьПрицеп(Прицеп, ТаблицаОшибок, КатегорияОшибка, ИмяПоля)
	
	Если Не ЗначениеЗаполнено(Прицеп) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Прицеп.ВидВладения) Тогда
		
		ТекстОшибки = "Укажите вид владения прицепом";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ИмяПоля + ".ВидВладения", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Прицеп.ГрузоподъемностьТонн) Тогда
		
		ТекстОшибки = "Укажите грузоподъемность прицепа";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ИмяПоля + ".ГрузоподъемностьТонн", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Прицеп.ТипТС) Тогда
		
		ТекстОшибки = "Укажите тип прицепа";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ИмяПоля + ".ТипТС", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Прицеп.МаркаТС) Тогда
		
		ТекстОшибки = "Укажите марку прицепа";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ИмяПоля + ".МаркаТС", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Прицеп.РегНомер) Тогда
		
		ТекстОшибки = "Укажите гос. рег. номер прицепа";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ИмяПоля + ".РегНомер", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Прицеп.ВместимостьКубМ) Тогда
		
		ТекстОшибки = "Укажите вместимость прицепа";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ИмяПоля + ".ВместимостьКубМ", КатегорияОшибка, ТекстОшибки, "Указать");
	Иначе
		
		Если КоличествоЗнаковВЧисле(Прицеп.ВместимостьКубМ) > 4 Тогда
			ТекстОшибки = "Неверный формат вместимости транспортного средства. Количество цифр в числе должно быть не более 4";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				ИмяПоля + ".ВместимостьКубМ", КатегорияОшибка, ТекстОшибки, "Проверить");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьТабЧастьТовары(Знач Объект, ТаблицаОшибок, ЭтоОтправкаПрототипа, ЭтоОтправкаЧерновика)
	
	ВалидацияПрототиповИЧерновиков = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ВалидацияПрототиповИЧерновиков");
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	Если Не ВалидацияПрототиповИЧерновиков И (ЭтоОтправкаПрототипа Или ЭтоОтправкаЧерновика) Тогда
		КатегорияОшибка = КатегорияПредупреждение;
	Иначе
		КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КонецЕсли;
	
	ИмяТЧ = "Товары";
	
	Если Не ЗначениеЗаполнено(Объект.Товары) Тогда 
		
		ТекстОшибки = "Добавьте груз в табличную часть ""Грузы (Товары)""";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"", КатегорияОшибка, ТекстОшибки, "Добавить груз");
		
	ИначеЕсли Объект.Товары.НайтиСтроки(Новый Структура("Учитывать", Истина)).Количество() = 0 Тогда
		
		ТекстОшибки = "Нет ни одного учитываемого груза в табличной части ""Грузы (Товары)""";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"", КатегорияОшибка, ТекстОшибки, "Добавить груз");
		
	Иначе	
		
		ОбязательныйGTINТовара = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиПартнера(Объект.ДокументЭТРН.ПартнерГрузополучатель, "ОбязательныйGTINТовара") = Истина;
		
		Для Каждого СтрокаТовара Из Объект.Товары Цикл
			
			Если Не СтрокаТовара.Учитывать Тогда 
				Продолжить;
			КонецЕсли;
			
			ТекущийНомерСтроки = СтрокаТовара.НомерСтроки;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.ОтгрузочноеНаименование) Тогда
				ТекстОшибки = "Укажите Отгрузочное наименование";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать отгрузочное наименование");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.СостояниеГруза) Тогда
				ТекстОшибки = "Укажите Состояние груза";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"СостояниеГруза", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать состояние груза");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.СпособУпаковки) Тогда
				ТекстОшибки = "Укажите Способ упаковки";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"СпособУпаковки", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать способ упаковки");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.ВидТары) Тогда
				ТекстОшибки = "Укажите Вид тары";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ВидТары", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать вид тары");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.МассаПлановаяБруттоКг) Тогда
				ТекстОшибки = "Укажите Массу (брутто) груза";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"МассаПлановаяБруттоКг", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать массу брутто");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТовара.ОбъявленнаяЦенность) И Не ЗначениеЗаполнено(СтрокаТовара.ОбъявленнаяЦенностьВалюта) Тогда
				ТекстОшибки = "Укажите валюту объявленной ценности груза";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОбъявленнаяЦенностьВалюта", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать валюту");
			КонецЕсли;
			
			ГабаритыЗаполнены = ЗначениеЗаполнено(СтрокаТовара.Высота) И ЗначениеЗаполнено(СтрокаТовара.Длина) И ЗначениеЗаполнено(СтрокаТовара.Ширина);			
			Если Не ГабаритыЗаполнены И (ЗначениеЗаполнено(СтрокаТовара.Высота) Или ЗначениеЗаполнено(СтрокаТовара.Длина) Или ЗначениеЗаполнено(СтрокаТовара.Ширина)) Тогда
				
				Если Не ЗначениеЗаполнено(СтрокаТовара.Высота) Тогда
					ТекстОшибки = "Укажите высоту груза";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
					"Высота", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать высоту");
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СтрокаТовара.Длина) Тогда
					ТекстОшибки = "Укажите длину груза";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
					"Длина", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать длину");
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СтрокаТовара.Ширина) Тогда
					ТекстОшибки = "Укажите ширину груза";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
					"Ширина", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать ширину");
				КонецЕсли;
				
			КонецЕсли; 
			
			ПроверитьСвязанныеОпасныеГрузы(Объект, СтрокаТовара, ТаблицаОшибок);
			
			Если СтрокаТовара.УчетГрузаВГИС Тогда
				
				ПроверитьСведенияГИС(ИмяТЧ, КатегорияОшибка, Объект, СтрокаТовара, ТаблицаОшибок, ТекущийНомерСтроки);
				
			КонецЕсли;
			
			Если ОбязательныйGTINТовара Тогда
				// должен быть указан GTIN в маркировках
				ПроверитьНаличиеGTIN(ИмяТЧ, КатегорияОшибка, Объект, СтрокаТовара, ТаблицаОшибок, ТекущийНомерСтроки);
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьНаличиеGTIN(ИмяТЧ, Знач КатегорияОшибка, Знач Объект, Знач СтрокаТовара, Знач ТаблицаОшибок, ТекущийНомерСтроки)
	
	СвязанныеСтрокиМаркировки = Объект.Маркировки.НайтиСтроки(Новый Структура("ИдентификаторСтрокиТоваров", СтрокаТовара.ИдентификаторСтроки));
	
	Если СвязанныеСтрокиМаркировки.Количество() = 0 Тогда
		
		ТекстОшибки = "Укажите GTIN в маркировке по требованию грузополучателя (или заполните в соответствиях)";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
		"КоличествоМест", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать GTIN");
		
	Иначе
		
		Для Каждого СтрокаМаркировки Из СвязанныеСтрокиМаркировки Цикл
			
			ДопПараметры = Новый Массив;
			ДопПараметры.Добавить(ТекущийНомерСтроки);
			
			Если НЕ ЗначениеЗаполнено(СтрокаМаркировки.ЗначениеМаркировки) Тогда
				ТекстОшибки = "Укажите маркировку GTIN по требованию грузополучателя (или заполните в соответствиях)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Маркировки", СтрокаМаркировки.НомерСтроки, 
				"ЗначениеМаркировки", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать GTIN", ДопПараметры);
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьСведенияГИС(ИмяТЧ, Знач КатегорияОшибка, Знач Объект, Знач СтрокаТовара, Знач ТаблицаОшибок, ТекущийНомерСтроки)
	
	Перем СвязанныеСтрокиГИС, СтрокаГИС, ТекстОшибки;
	
	СвязанныеСтрокиГИС = Объект.СведенияГосСистем.НайтиСтроки(Новый Структура("ИдентификаторСтрокиТоваров", СтрокаТовара.ИдентификаторСтроки));
	Если СвязанныеСтрокиГИС.Количество() = 0 Тогда 
		ТекстОшибки = "Укажите сведения ГИС или снимите отметку учета в ГИС";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
		"УчетГрузаВГИС", КатегорияОшибка, ТекстОшибки, "Проверить",,,"Проверить");
	Иначе
		Для Каждого СтрокаГИС Из СвязанныеСтрокиГИС Цикл
			
			ДопПараметры = Новый Массив;
			ДопПараметры.Добавить(ТекущийНомерСтроки);
			
			Если НЕ ЗначениеЗаполнено(СтрокаГИС.НаимГосСист) Тогда
				ТекстОшибки = "Укажите наименование ГИС";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СведенияГосСистем", СтрокаГИС.НомерСтроки, 
				"НаимГосСист", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать ГИС", ДопПараметры);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаГИС.ИдНомУчетЕд) Тогда
				ТекстОшибки = "Укажите идент. номер в ГИС";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СведенияГосСистем", СтрокаГИС.НомерСтроки, 
				"ИдНомУчетЕд", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать ид. номер в ГИС", ДопПараметры);
			КонецЕсли;
			
		КонецЦикла;
		
		тзСвязанныеСтрокиГИС = Новый ТаблицаЗначений;
		тзСвязанныеСтрокиГИС.Колонки.Добавить("НаимГосСист");
		тзСвязанныеСтрокиГИС.Колонки.Добавить("УчетЕд");
		тзСвязанныеСтрокиГИС.Колонки.Добавить("ИнаяИнф");
		
		Для каждого Стр Из СвязанныеСтрокиГИС Цикл
			НоваяСтрока = тзСвязанныеСтрокиГИС.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		КонецЦикла;
		
		тзСвязанныеСтрокиГИС.Свернуть("НаимГосСист, УчетЕд, ИнаяИнф");
		Если тзСвязанныеСтрокиГИС.Количество() <> 1 Тогда			
			ТекстОшибки = "Значения колонок: ""Наим гос сист, Учет ед, ИнаяИнф"" должны совпадать во всех строках";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"УчетГрузаВГИС", КатегорияОшибка, ТекстОшибки, "Заполнить",,,"Указать одиноковые значения для колонок ""Наим гос сист, Учет ед, ИнаяИнф""");
		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьОтметки(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка 		= Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ИмяТЧ = "ОтметкиГрузоотправителя";
	
	Для Каждого Отметка Из Объект.ОтметкиГрузоотправителя Цикл 
		
		ТекущийНомерСтроки = Отметка.НомерСтроки;
		
		Если Не ЗначениеЗаполнено(Отметка.ДатаИВремяОтметки) Тогда
			
			ТекстОшибки = "Укажите Дату отметки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ДатаИВремяОтметки", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Отметка.ОписаниеОбстоятельств) Тогда
			
			ТекстОшибки = "Укажите Описание обстоятельств отметки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОписаниеОбстоятельств", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать описание обстоятельств");
			
		КонецЕсли;
		
		НайденныеШтрафы = Объект.Штрафы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", Отметка.ИдентификаторСтроки)); 
		Для Каждого Штраф Из НайденныеШтрафы Цикл 
			
			Если Не ЗначениеЗаполнено(Штраф.ИтогРазмШтрРФ) Тогда 
				
				ТекстОшибки = "Укажите Размер штрафа для Отметки №" + ТекущийНомерСтроки;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Штрафы", Штраф.НомерСтроки, 
					"ИтогРазмШтрРФ", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать размер штрафа");
				
			КонецЕсли;	
			
		КонецЦикла;
		
		НайденныеАкты = Объект.Акты.НайтиСтроки(Новый Структура("ИдентификаторСтрокиОтметки", Отметка.ИдентификаторСтроки)); 
		Для Каждого Акт Из НайденныеАкты Цикл 
						
			Если Не ЗначениеЗаполнено(Акт.АктИдДок) 
				И Не ЗначениеЗаполнено(Акт.АктНаименование) 
				И Не ЗначениеЗаполнено(Акт.АктДата) 
				И Не ЗначениеЗаполнено(Акт.СтороныСоставители) 
				И Не ЗначениеЗаполнено(Акт.ДополнительныйСоставитель) Тогда 
				
				ТекстОшибки = "Укажите Идентификатор ИЛИ Наименование, Номер, Дату и Составителей Акта для Отметки №" + ТекущийНомерСтроки;
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование акта");
								
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(Акт.АктИдДок) 
				И (ЗначениеЗаполнено(Акт.АктНаименование)
				Или ЗначениеЗаполнено(Акт.АктНомер) 
				Или ЗначениеЗаполнено(Акт.АктДата)
				Или ЗначениеЗаполнено(Акт.АктДопСведДок)
				Или ЗначениеЗаполнено(Акт.СтороныСоставители) 
				Или ЗначениеЗаполнено(Акт.ДополнительныйСоставитель)) Тогда	
					
				Если Не ЗначениеЗаполнено(Акт.АктНаименование) Тогда 
					
					ТекстОшибки = "Укажите Наименование акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать наименование акта");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Акт.АктДата) Тогда 
					
					ТекстОшибки = "Укажите Дату акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"АктДата", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату акта");
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Акт.СтороныСоставители) 
					И Не ЗначениеЗаполнено(Акт.ДополнительныйСоставитель) Тогда 
					
					ТекстОшибки = "Укажите Стороны составители или Доп.составителя акта для Отметки №" + ТекущийНомерСтроки;
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "Акты", Акт.НомерСтроки, 
							"СтороныСоставители", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать стороны составители акта");
					
				КонецЕсли;
					
			КонецЕсли;
					
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ПроверитьИнфПол(Знач Объект, ТаблицаОшибок)
	
	МассивПроверок = Новый Массив;
	МассивПроверок.Добавить("ИнфПол");
	
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьИнфПол(Объект, МассивПроверок, ТаблицаОшибок);	
	
КонецПроцедуры	

Процедура ПроверитьСопрДок(Знач Объект, ТаблицаОшибок)
	
	ИмяТЧ = "СопроводительныеДокументы";
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;

	Для	Каждого СтрокаСопрДок Из Объект.СопроводительныеДокументы Цикл 
		
		ТекущийНомерСтроки = СтрокаСопрДок.НомерСтроки;
		
		Если Не ЗначениеЗаполнено(СтрокаСопрДок.Тип) Тогда
			
			ТекстОшибки = "Укажите Тип сопроводительного документа";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"Тип", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		ИначеЕсли СтрокаСопрДок.Тип <> Перечисления.КонтурЛогистика_ТипыСопроводительныхДокументов.ДокКТрН 
			И СтрокаСопрДок.Тип <> Перечисления.КонтурЛогистика_ТипыСопроводительныхДокументов.ДокКГр 
			И СтрокаСопрДок.Тип <> Перечисления.КонтурЛогистика_ТипыСопроводительныхДокументов.ДокПерЦенн 
			И СтрокаСопрДок.Тип <> Перечисления.КонтурЛогистика_ТипыСопроводительныхДокументов.СопрВед 
			Тогда
			
			ТекстОшибки = "Неподходящий для ТРН тип сопроводительного документа";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"Тип", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Заменить");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаСопрДок.ДокументСоставитель) Тогда
			
			ТекстОшибки = "Укажите Составителя сопроводительного документа";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ДокументСоставитель", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаСопрДок.ДокументИдДок) Тогда
			
			Если Не ЗначениеЗаполнено(СтрокаСопрДок.ДокументНаименование) Тогда
				ТекстОшибки = "Укажите Наименование сопроводительного документа";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ДокументНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаСопрДок.ДокументНомер) Тогда
				ТекстОшибки = "Укажите Наименование сопроводительного документа";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ДокументНомер", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаСопрДок.ДокументДата) Тогда
				ТекстОшибки = "Укажите Наименование сопроводительного документа";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ДокументДата", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПроверитьСпецУсловияДвижения(Объект, ТаблицаОшибок)

	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	
	ИмяТЧ = "СпецУслДвиж";
	
	Для Каждого СпецУсловие Из Объект.СпецУслДвиж Цикл
		
		ТекНомерСтроки = СпецУсловие.НомерСтроки;
		
		Если Не ЗначениеЗаполнено(СпецУсловие.ИдСР) 
			И Не ЗначениеЗаполнено(СпецУсловие.НомСР) 
			И Не ЗначениеЗаполнено(СпецУсловие.ДатаСР) 
			И Не ЗначениеЗаполнено(СпецУсловие.СрокСР) Тогда 
			
			ТекстОшибки = "Укажите Идентификатор ИЛИ Номер, Дату и Срок спец. разрешения";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекНомерСтроки, 
						"НомСР", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать номер");
							
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(СпецУсловие.ИдСР) 
			И (ЗначениеЗаполнено(СпецУсловие.НомСР)
			Или ЗначениеЗаполнено(СпецУсловие.ДатаСР) 
			Или ЗначениеЗаполнено(СпецУсловие.СрокСР)) Тогда	
				
			Если Не ЗначениеЗаполнено(СпецУсловие.НомСР) Тогда 
				
				ТекстОшибки = "Укажите Номер спец. разрешения";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекНомерСтроки, 
						"НомСР", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать номер");
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СпецУсловие.ДатаСР) Тогда 
				
				ТекстОшибки = "Укажите Дату спец. разрешения";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекНомерСтроки, 
						"ДатаСР", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать дату");
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СпецУсловие.СрокСР) Тогда 
				
				ТекстОшибки = "Укажите Срок спец. разрешения";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекНомерСтроки, 
						"СрокСР", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать срок");
				
			КонецЕсли;
				
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(СпецУсловие.СведМрш_МршТекст) 
			И Не ЗначениеЗаполнено(СпецУсловие.СведМрш_МршМашЧит) Тогда 
			
			ТекстОшибки = "Укажите сведение о маршруте спец. разрешения";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекНомерСтроки, 
					"СведМрш_МршТекст", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать марщрут");
			
		КонецЕсли;	
		
	КонецЦикла;	

КонецПроцедуры

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ТрН_Титул1.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции	

Функция ПроверитьСвязанныеОпасныеГрузы(Знач Объект, Знач СтрокаТовара, ТаблицаОшибок)
	
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ТекущийНомерСтроки = СтрокаТовара.НомерСтроки;
	ИмяТЧ = "Товары"; // ошибки будем складывать к товарам

	СвязанныеСтрокиОГ = Объект.ОпасныеГрузы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиТоваров", СтрокаТовара.ИдентификаторСтроки));
	Для Каждого СтрокаОГ Из СвязанныеСтрокиОГ Цикл 
		
		Источник = СтрокаОГ;
		
		Если НЕ ЗначениеЗаполнено(Источник.НомерООН) Тогда
			ТекстОшибки = "Укажите Номер ООН опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.НадлежащееОтгрузочноеНаименование) Тогда
			ТекстОшибки = "Укажите Надлежащее отгрузочное наименование опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.Класс) Тогда
			ТекстОшибки = "Укажите Класс опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.КлассификационныйКод) Тогда
			ТекстОшибки = "Укажите Классификационный код опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.ГруппаУпаковки) Тогда
			ТекстОшибки = "Укажите Группу упаковки опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.ЗнакОпасности) Тогда
			ТекстОшибки = "Укажите Знак опасности опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.КодОграниченияТуннели) Тогда
			ТекстОшибки = "Укажите Код ограничения проезда через туннели опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если Источник.Класс = Перечисления.КонтурЛогистика_КлассыОпасностиГрузов.Класс1 Тогда
			
			Если НЕ ЗначениеЗаполнено(Источник.ОбМасНетВзрСод) Тогда
				ТекстОшибки = "Укажите Общая масса нетто взрывчатого содержимого в килограммах для каждого вещества или изделия, имеющего отдельный номер ООН (т.к. класс = 1)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Источник.ОбМасНетВзрСодВсех) Тогда
				ТекстОшибки = "Укажите Общая масса нетто взрывчатого содержимого в килограммах для всех веществ и изделий, которых касается сопроводительная ведомость (т.к. класс = 1)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция КоличествоЗнаковВЧисле(Значение)
	
	ДлинаЦелойЧасти = СтрДлина(Цел(Значение));
	ДлинаДробнойЧасти = СтрДлина(Значение - Цел(Значение)) - 2;
	
	Возврат ДлинаЦелойЧасти + ДлинаДробнойЧасти;
	
КонецФункции

#КонецЕсли
