&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ТолькоАварииКонтурЛогистика = Истина Тогда 
		Объект.ОтображатьТолькоАварии = Истина;
		Объект.ОтображатьТолькоФоновыеКонтурЛогистика = Истина;
		
	Иначе
		
		Объект.ОтображатьТолькоФоновыеКонтурЛогистика = Ложь;
		
	КонецЕсли;
	
	УправлениеВидимостьюДопИнфоРасширениеСервер();
	
	Объект.МинутНазадФоновые = Обработки.КонтурЛогистика_ФоновыеИРегламентныеЗадания.ПоказыватьФоновыеПоУмолчаниюМинутНазад();
	ОбновитьВсеНаСервере();
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные("Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами") Тогда
		Попытка
			Выполнить("Элементы.ГруппаБлокировкаРаботыСВнешнимиРесурсами.Видимость = РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована()");
		Исключение
			Элементы.ГруппаБлокировкаРаботыСВнешнимиРесурсами.Видимость = КонтурЛогистика_БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована();
		КонецПопытки;
	Иначе
		Элементы.ГруппаБлокировкаРаботыСВнешнимиРесурсами.Видимость = КонтурЛогистика_БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПрименитьОформлениеФильтраФЗ();

КонецПроцедуры

&НаСервере
Процедура ОбновитьРегламентныеНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПерезаполнитьРегламентныеЗадания();	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРегламентные(Команда)
	
	Объект.РегламентныеЗаданияПодсистемы.Очистить();
	ОбновитьРегламентныеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФоновыеНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПерезаполнитьФоновыеЗадания();	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФоновые(Команда = Неопределено)
	Объект.ФоновыеЗаданияПодсистемы.Очистить();
	ОбновитьФоновыеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсеНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПерезаполнитьРегламентныеЗадания();	
	ОбработкаОбъект.ПерезаполнитьФоновыеЗадания();	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсе(Команда)
	Объект.ФоновыеЗаданияПодсистемы.Очистить();
	Объект.РегламентныеЗаданияПодсистемы.Очистить();
	ОбновитьВсеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеЗаданияПодсистемыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		Или ЕстьРольНастройкаПодсистемы() Тогда
		
		Если Поле.Имя <> "РегламентныеЗаданияПодсистемыПользователь" Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			
			Если Поле.Имя = "РегламентныеЗаданияПодсистемыИспользование" Тогда
				
				НовоеПоложение = ВключитьВыключитьРегламентноеЗадание(Элемент.ТекущиеДанные.Идентификатор);
				Элемент.ТекущиеДанные.Использование = НовоеПоложение;
				
				ОбновитьВсеНаСервере();
				
				Если Элемент.ТекущиеДанные.Ключ = "КонтурЛогистика_АвтоматическоеПолучениеИОтправкаQRКодов" Тогда
					УстановитьЗначениеНастройки("АвтоматическоеПолучениеИОтправкаQRКодов", НовоеПоложение);			
				КонецЕсли;
				
			ИначеЕсли Поле.Имя = "РегламентныеЗаданияПодсистемыРасписание" Тогда
				
				текРасписание = ПолучитьРасписаниеЗадания(Элемент.ТекущиеДанные.Идентификатор);
				
				Диалог = Новый ДиалогРасписанияРегламентногоЗадания(текРасписание);
				ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗавершениеРедактированияРасписания", ЭтаФорма, Элемент.ТекущиеДанные.Идентификатор);
				Диалог.Показать(ОписаниеОповещенияОЗакрытии);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Доступно только с ролью ""Настройка подсистемы"" или полными правами");
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеНастройки(ИмяНастройки, Значение)	
	Справочники.КонтурЛогистика_Настройки.УстановитьНастройку(ИмяНастройки, Значение);	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьРольНастройкаПодсистемы()
	
	Возврат РольДоступна("КонтурЛогистика_НастройкаПодсистемы");
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеРедактированияРасписания(РасписаниеРезультат, ИентификаторРегЗадания) Экспорт 
	
	Если РасписаниеРезультат <> Неопределено Тогда
		
		УстановитьРасписание(ИентификаторРегЗадания, РасписаниеРезультат);
		Элементы.РегламентныеЗаданияПодсистемы.ТекущиеДанные.Расписание = Строка(РасписаниеРезультат);;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРасписание(ИдентификаторРегЗадания, Расписание)

	текРЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегЗадания); 	
	текРЗ.Расписание = Расписание;
	текРЗ.Записать();

КонецПроцедуры

&НаСервере
Функция ПолучитьРасписаниеЗадания(ИдентификаторРегЗадания)
	
	текРЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегЗадания); 	
	Возврат текРЗ.Расписание; 	
	
КонецФункции 

&НаСервере
Функция ВключитьВыключитьРегламентноеЗадание(ИдентификаторРегЗадания, НовоеПоложениеИспользования = Неопределено)
	
	текРЗ = КонтурЛогистика_Привилегированный.РегламентныеЗаданияНайтиПоУникальномуИдентификатору(ИдентификаторРегЗадания); 	
	
	Если текРЗ = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Регламентное задание с таким идентификатором уже недоступно";
		Сообщение.Сообщить();
		Возврат Ложь;
		
	Иначе
		
		Если Не КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
			И Не ЕстьРольНастройкаПодсистемы() Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Управление заданиями доступно только для администратора";
			Сообщение.Сообщить();
			Возврат текРЗ.Использование;
			
		Иначе
			
			Если НовоеПоложениеИспользования = Неопределено Тогда 
				НовоеПоложениеИспользования = не текРЗ.Использование;
			КонецЕсли;
			
			текРЗ.Использование = НовоеПоложениеИспользования;
			Если КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор() Тогда
				
				УстановитьПривилегированныйРежим(Истина);
				текРЗ.Записать();
				УстановитьПривилегированныйРежим(Ложь);
				
				Возврат текРЗ.Использование; 
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Если НовоеПоложениеИспользования Тогда 
					Сообщение.Текст = "Включить регламентное задание может только пользователь с полными правами Логистики или правами администратора учетной ситемы";
				Иначе
					Сообщение.Текст = "Выключить регламентное задание может только пользователь с полными правами Логистики или правами администратора учетной ситемы";
				КонецЕсли;
				Сообщение.Сообщить();
				
				Возврат Не НовоеПоложениеИспользования;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РегламентныеЗаданияПодсистемыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
&НаКлиенте
Процедура РегламентныеЗаданияПодсистемыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
&НаКлиенте
Процедура ФоновыеЗаданияПодсистемыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
&НаКлиенте
Процедура ФоновыеЗаданияПодсистемыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРЗ_ВФоне(Команда)
	
	Если КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		Или ЕстьРольНастройкаПодсистемы() Тогда
		
		Для каждого ИдСтрокиРЗ Из Элементы.РегламентныеЗаданияПодсистемы.ВыделенныеСтроки Цикл
			
			ТекущаяСтрока = Объект.РегламентныеЗаданияПодсистемы.НайтиПоИдентификатору(ИдСтрокиРЗ);
			Если ТекущаяСтрока <> Неопределено Тогда
				ВыполнитьРегламентноеЗаданиеНаСервере(ТекущаяСтрока.Идентификатор);
			КонецЕсли;
			
		КонецЦикла;	
		
	Иначе
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Доступно только с ролью ""Настройка подсистемы"" или полными правами");
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРЗ_ВСеансе(Команда)
	
	Если КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		Или ЕстьРольНастройкаПодсистемы() Тогда
		
		ТекущаяСтрока = Элементы.РегламентныеЗаданияПодсистемы.ТекущиеДанные;
		Если ТекущаяСтрока <> Неопределено Тогда
			ВыполнитьРегламентноеЗаданиеВручнуюНаСервере(ТекущаяСтрока.Идентификатор);
			Состояние("Завершено выполнение в этом сеансе.", , ТекущаяСтрока.Наименование);
		КонецЕсли;
		
	Иначе
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Доступно только с ролью ""Настройка подсистемы"" или полными правами");
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРегламентноеЗаданиеНаСервере(УникальныйИдентификатор)
	
	Идентификатор = Новый УникальныйИдентификатор(УникальныйИдентификатор);
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
		
		//проверка на выполнение в текущий момент
		Отбор = Новый Структура;
		Отбор.Вставить("Ключ",Строка(Задание.УникальныйИдентификатор));
		Отбор.Вставить("Состояние ",СостояниеФоновогоЗадания.Активно);		
		МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		
		ИдентификаторНовогоЗадания = Неопределено;
		
		Если МассивЗаданий.Количество() = 0 Тогда 
			НаименованиеФоновогоЗадания = "Запуск вручную: " + Задание.Метаданные.Синоним;
			ФоновоеЗадание = ФоновыеЗадания.Выполнить(Задание.Метаданные.ИмяМетода, Задание.Параметры, Строка(Задание.УникальныйИдентификатор), НаименованиеФоновогоЗадания);
			ИдентификаторНовогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;
		Иначе
			Сообщить("Задание уже запущено");
		КонецЕсли;
		
	ОбновитьРегламентныеНаСервере();
	ОбновитьФоновыеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРегламентноеЗаданиеВручнуюНаСервере(УникальныйИдентификатор)
	
	Идентификатор = Новый УникальныйИдентификатор(УникальныйИдентификатор);
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	
	ИмяМетода = Задание.Метаданные.ИмяМетода;
	Если ИмяМетода = "ДополнительныеОтчетыИОбработки.ВыполнитьОбработкуПоРегламентномуЗаданию" Тогда
		Если Задание.Параметры.Количество() > 1 Тогда
			ВнешняяОбработка = Задание.Параметры.Получить(0);
			ИдентификаторКоманды = Задание.Параметры.Получить(1);
			Выполнить("ДополнительныеОтчетыИОбработки.ВыполнитьОбработкуПоРегламентномуЗаданию(ВнешняяОбработка, ИдентификаторКоманды)");
		КонецЕсли;
		Возврат;
	КонецЕсли;
		
	// Подготовка команды для выполнения метода вместо фонового задания.
	СтрокаПараметров = "";
	Индекс = 0;
	Пока Индекс < Задание.Параметры.Количество() Цикл
		СтрокаПараметров = СтрокаПараметров + "Задание.Параметры[" + Индекс + "]";
		Если Индекс < (Задание.Параметры.Количество()-1) Тогда
			СтрокаПараметров = СтрокаПараметров + ",";
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Выполнить("" + ИмяМетода + "(" + СтрокаПараметров + ");");

КонецПроцедуры

&НаКлиенте
Процедура РегламентныеЗаданияПодсистемыПользовательПриИзменении(Элемент)
	
	ТекДанные = Элементы.РегламентныеЗаданияПодсистемы.ТекущиеДанные;
	УстановитьПользователяРегламентногоЗадания(ТекДанные.Идентификатор, СокрЛП(ТекДанные.Пользователь));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПользователяРегламентногоЗадания(ИдентификаторРегЗадания, НовыйПользователь)
	
	ВведенныйПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(НовыйПользователь);
	Если ВведенныйПользователь <> Неопределено Тогда 
		
		текРЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегЗадания); 	
		Если текРЗ = Неопределено Тогда 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Регламентное задание с таким идентификатором уже недоступно";
			Сообщение.Сообщить();
			
		Иначе
			
			текРЗ.ИмяПользователя = ВведенныйПользователь;
			текРЗ.Записать();
			
		КонецЕсли;
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Такой пользователь не найден: " + НовыйПользователь + " Пользователь в задание не установлено!";
		Сообщение.Поле = "РегламентныеЗаданияПодсистемыПользователь";
		Сообщение.Сообщить();                 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьФоновыеЗадания(Команда)
	
	Отказ = Истина;
	Попытка
		ОтменитьФоновыеЗаданияСервер();
	Исключение	
		ПоказатьИнформациюОбОшибке(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьФоновыеЗаданияСервер()
	
	ВыделенныеСтроки = Элементы.ФоновыеЗаданияПодсистемы.ВыделенныеСтроки;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		СтрокаФЗ = Объект.ФоновыеЗаданияПодсистемы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		ТекИдентификатор = Новый УникальныйИдентификатор(СтрокаФЗ.Идентификатор);
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ТекИдентификатор);
		ФоновоеЗадание.Отменить();
		
	КонецЦикла;
	
	ОбновитьФоновыеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтфильтроватьФоновыеПоВыделенномуРегламентному(Команда)
	
	ТекущаяСтрока = Элементы.РегламентныеЗаданияПодсистемы.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Элементы.ФоновыеЗаданияПодсистемы.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("РегламентноеЗадание", ТекущаяСтрока.ИмяМетаданных));
	Иначе
		Элементы.ФоновыеЗаданияПодсистемы.ОтборСтрок = Неопределено;
	КонецЕсли;
	
	Элементы.ФоновыеЗаданияПодсистемы.Обновить();
	ПрименитьОформлениеФильтраФЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтборФоновых(Команда)
	
	Элементы.ФоновыеЗаданияПодсистемы.ОтборСтрок = Неопределено;
	Элементы.ФоновыеЗаданияПодсистемы.Обновить();
	ПрименитьОформлениеФильтраФЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьОформлениеФильтраФЗ()

	КнопкаОтмены = Элементы.ФоновыеЗаданияПодсистемыОтменитьОтборФоновых;
	
	КнопкаОтмены.Видимость = Элементы.ФоновыеЗаданияПодсистемы.ОтборСтрок <> Неопределено;
	Если КнопкаОтмены.Видимость Тогда 
		
		КнопкаОтмены.Заголовок = "Отменить отбор: " + Элементы.ФоновыеЗаданияПодсистемы.ОтборСтрок.РегламентноеЗадание;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФоновыеЗаданияПодсистемыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		Если Поле.Имя = "ФоновыеЗаданияПодсистемыСообщения" Тогда
			
			Текст = ФоновыеЗаданияПодсистемыСообщенияВыборНаСервере(Элемент.ТекущиеДанные.Идентификатор);
			Если Текст <> "" Тогда 
				КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Текст);
			КонецЕсли;
			
		Иначе
			
			ОткрытьФормуФЗ();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ФоновыеЗаданияПодсистемыСообщенияВыборНаСервере(ИдентификаторФЗ)
	
	Текст = "";
	
	Фоновое = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФЗ);
	
	Если Фоновое <> Неопределено Тогда
		
		СообщенияПользователю = Фоновое.ПолучитьСообщенияПользователю();
		Для Каждого Сообщение Из СообщенияПользователю Цикл;
			Текст = Текст + Символы.ПС + Сообщение.Текст;
		КонецЦикла;
		
		Текст = СокрЛП(Текст);
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции 

&НаКлиенте
Процедура ВыключитьВсеРегламентные(Команда)
	ВключитьВыключитьВсеРЗ(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеРегламентные(Команда)
	ВключитьВыключитьВсеРЗ(Истина);	
КонецПроцедуры

&НаСервере
Процедура ВключитьВыключитьВсеРЗ(НовоеИспользование)

	Для каждого СтрокаРЗ Из Объект.РегламентныеЗаданияПодсистемы Цикл
	
	     ВключитьВыключитьРегламентноеЗадание(СтрокаРЗ.Идентификатор, НовоеИспользование);
		 
	КонецЦикла;

	ОбновитьРегламентныеНаСервере();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтображатьТолькоФоновыеКонтурЛогистикаПриИзменении(Элемент)
	ОбновитьФоновые();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоАварииПриИзменении(Элемент)
	ОбновитьФоновые();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуФЗ(Команда = Неопределено)
	
	Если Элементы.ФоновыеЗаданияПодсистемы.ТекущиеДанные <> Неопределено Тогда 
		КонтурЛогистика_ДлительныеОперацииКлиент.СледитьЗаФоновымЗаданиемВФорме(Элементы.ФоновыеЗаданияПодсистемы.ТекущиеДанные.Идентификатор);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДопИнфоРасширениеСервер()

	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодсистемаКакРасширение() Тогда
		
		Элементы.ДопИнфоРасширениеПодключитьОбработку.Видимость = Ложь;
		
		ТекстИнфо = "";
		Если НЕ КонтурЛогистика_РежимРасширенияСервер.ОбработкаЗапускаРегламентныхЗаданий_ЕстьМетаданные() Тогда
			ТекстИнфо = "Для работы регламентных заданий требуется механизм Дополнительных отчетов и обработок (из БСП)!"; 
			
		ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеОтчетыИОбработки") <> Истина Тогда
			ТекстИнфо = "Для работы регламентных заданий необходимо включить механизм дополнительных отчетов и обработок!";
			
		ИначеЕсли НЕ ЗначениеЗаполнено(КонтурЛогистика_РежимРасширенияСервер.ОбработкаЗапускаРегламентныхЗаданий_Ссылка()) Тогда
			ТекстИнфо = "Не подключена дополнительная обработка для регламентных заданий!";
			Элементы.ДопИнфоРасширениеПодключитьОбработку.Видимость = Истина;
			
		Иначе
			ТекстИнфо = "";
			
		КонецЕсли;
		
		Элементы.ДопИнфоРасширениеТекст.Заголовок = ТекстИнфо;
		Элементы.ДопИнфоРасширение.Видимость = ЗначениеЗаполнено(ТекстИнфо);
		
	Иначе
		
		Элементы.ДопИнфоРасширение.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДопИнфоРасширениеПодключитьОбработкуНажатиеНаСервере()
	
	КонтурЛогистика_РежимРасширенияСервер.ОбработкаЗапускаРегламентныхЗаданий_Подключить();
	Объект.РегламентныеЗаданияПодсистемы.Очистить();
	ОбновитьРегламентныеНаСервере();
	УправлениеВидимостьюДопИнфоРасширениеСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДопИнфоРасширениеПодключитьОбработкуНажатие(Элемент)
	
	ДопИнфоРасширениеПодключитьОбработкуНажатиеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПояснениеБлокировкаРаботыСВнешнимиРесурсамиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элементы.ГруппаБлокировкаРаботыСВнешнимиРесурсами.Видимость = Ложь;
	ПояснениеБлокировкаРаботыСВнешнимиРесурсамиОбработкаНавигационнойСсылкиНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПояснениеБлокировкаРаботыСВнешнимиРесурсамиОбработкаНавигационнойСсылкиНаСервере()
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные("Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами") Тогда
		Выполнить("РегламентныеЗаданияСервер.РазблокироватьРаботуСВнешнимиРесурсами()");
	Иначе
		Выполнить("КонтурЛогистика_БлокировкаРаботыСВнешнимиРесурсами.РазрешитьРаботуСВнешнимиРесурсами()");
	КонецЕсли;
КонецПроцедуры

