&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _КлиентскиеВызовы;

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьФорму(ФормаКлиентскиеВызовы) Экспорт
	
	_КлиентскиеВызовы = ФормаКлиентскиеВызовы;
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СсылкаНаОбъект") Тогда
		СсылкаНаОбъект = Параметры.СсылкаНаОбъект;
		ЗаполнитьДанныеФормы();
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяТекущегоЭлемента") Тогда
		
		Попытка
			ЭтаФорма.ТекущийЭлемент = Элементы[Параметры.ИмяТекущегоЭлемента];
		Исключение
		КонецПопытки;
		
	КонецЕсли;
		
	Если Параметры.Свойство("ОбязательныеРеквизиты") Тогда
		
		Попытка
			Для Каждого ОбязательныйРеквизит Из Параметры.ОбязательныеРеквизиты Цикл
				Элементы[ОбязательныйРеквизит].АвтоОтметкаНезаполненного = Истина;
			КонецЦикла;
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	Закрыть(СсылкаНаОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоСсылке(Команда)
	ОбновитьПоСсылкеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНаСервере()

	МодульОбъекта = ОбработкаОбъект();		
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма);
	МодульОбъекта.СохранитьЗначения(СсылкаНаОбъект, ЗначенияДополнительныхСвойств, "РабЛиц");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
	ИнициализацияФормы();

	МодульОбъекта = ОбработкаОбъект();
	ДанныеПогрузкаСотрудник = МодульОбъекта.ДанныеПогрузкаСотрудник(СсылкаНаОбъект);

	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеПогрузкаСотрудник, ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормы()

КонецПроцедуры

&НаСервере
Процедура ОбновитьПоСсылкеНаСервере()

	МодульОбъекта = ОбработкаОбъект();
	ДанныеПогрузкаСотрудник = МодульОбъекта.ДанныеПогрузкаСотрудник(СсылкаНаОбъект, "УчСист");
	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеПогрузкаСотрудник, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

