
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		ПараметрыВыполненияКоманды.Источник.РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	УточнениеТипаЛогистика = "";
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		Форма = ПараметрыВыполненияКоманды.Источник;
		Если Форма.Элементы.Найти("ТипЛогистика") <> Неопределено Тогда
			УточнениеТипаЛогистика = Форма.ТипЛогистика;
		КонецЕсли;
	Иначе
		Форма = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		ДокументыКПередаче = ПараметрКоманды;
	Иначе
		ДокументыКПередаче = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрКоманды);
	КонецЕсли;
	
	МассивДокументов = Новый Массив;
	Для Каждого ТекущийДокументСсылка Из ДокументыКПередаче Цикл
		
		Попытка
			ИмяФормы = ПараметрыВыполненияКоманды.Источник.ИмяФормы;
		Исключение
			ИмяФормы = "";
		КонецПопытки;
		
		Если ЗначениеЗаполнено(УточнениеТипаЛогистика) Тогда
			ТекущийТипЛогистики = УточнениеТипаЛогистика;
		ИначеЕсли ТипЗнч(ТекущийДокументСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1") Тогда
			ТекущийТипЛогистики = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1");
		Иначе
			ТекущийТипЛогистики = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3");
		КонецЕсли;
		
		ИмяСсылкиПоТипу = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьИмяСсылкиПоТипуЛогистики(ТекущийТипЛогистики);
		КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
			"Передача водителю", "Передать водителю", ИмяФормы, ИмяСсылкиПоТипу);
		
		ТекущееТребуемоеДействие = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПередатьНаСогласованиеВодителю");
		НовоеТребуемоеДействие = КонтурЛогистика_ОбработкаДокументовСервер.ТребуемоеДействиеРазрешенияРаботыСДокументамиПользователя(
			ТекущееТребуемоеДействие, ТекущийДокументСсылка);
		Если ТекущееТребуемоеДействие = НовоеТребуемоеДействие Тогда
			МассивДокументов.Добавить(ТекущийДокументСсылка);
		Иначе
			ТекстСообщения = "Нет права передачи на подписания по документу: " + Строка(ТекущийДокументСсылка);
			Сообщить(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика", МассивДокументов, УточнениеТипаЛогистика);
	
	Состояние("Готовим данные", 20, "создаем документы и файлы обмена", БиблиотекаКартинок.КонтурЛогистика_Лого16);
	МассивФайловОбмена = ИзготовитьФайлыОбмена(ПараметрыВводаДокументов);

	Состояние("Отправляем документы", 50, "требуется около 3 секунд на 1 документ", БиблиотекаКартинок.КонтурЛогистика_ЛогоСПодписью);
	ОтправитьНеподписанные(МассивФайловОбмена);
	
	Состояние("Отправка завершена", 100, "список задач обновлен", БиблиотекаКартинок.КонтурЛогистика_Окончание);
	
	ОповеститьОбИзменении(ТипЗнч(МассивДокументов[0]));
	Оповестить("КонтурЛогистика_ОбновитьЗадачи", МассивДокументов);
	
КонецПроцедуры

&НаСервере
Функция ИзготовитьФайлыОбмена(ПараметрыВводаДокументов)
	
	ПараметрыФормированияФайловРеквизиты = Новый Структура;
	ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
	ПараметрыФормированияФайловРеквизиты.Вставить("ПередатьНаСогласованиеВодителю");
	
	МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(
		ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
	
	Возврат МассивФайловОбмена;
	
КонецФункции

&НаСервере
Процедура ОтправитьНеподписанные(МассивФайловОбмена)
	
	// Отправим файлы
	Если ТипЗнч(МассивФайловОбмена) = Тип("Массив")
		И МассивФайловОбмена.Количество() > 0 Тогда
		
		РезультатОтправки = КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлыВДиадок(МассивФайловОбмена);
		Если Не РезультатОтправки.Успешно Тогда
			Сообщить("Проблемы при отправке документов: "
				+ КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатОтправки));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры