#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

&ИзменениеИКонтроль("ПриКопировании")
Процедура АУ_ПриКопировании(ОбъектКопирования)

	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыЗаказовНаСборку") Тогда
		Статус = Метаданные().Реквизиты.Статус.ЗначениеЗаполнения;
	Иначе
		Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт;
	КонецЕсли;
	
	#Удаление
	ДокументОснование       = Неопределено;
	НачалоСборкиРазборки    = Дата(1, 1, 1);
	ОкончаниеСборкиРазборки = Дата(1, 1, 1);
	ЖелаемаяДатаПоступления = Дата(1, 1, 1);
	МаксимальныйКодСтроки   = 0;
	КоличествоУпаковокОтменено = 0;
	КоличествоОтменено = 0;
	
	Для каждого СтрокаТовары Из Товары Цикл
		
		СтрокаТовары.Отменено = Ложь;
		СтрокаТовары.КодСтроки = 0;
		СтрокаТовары.Назначение = Справочники.Назначения.ПустаяСсылка();
		
	КонецЦикла;
	
	Назначение       = Неопределено;
	#КонецУдаления
	НазначениеТовары = Неопределено;
	
	Серии.Очистить();

	#Удаление
	ИнициализироватьДокумент();
	#КонецУдаления
	
	СтруктураДействий = Новый Структура();
	КонтрольКачестваКэш = КонтрольКачества.КэшДанныхМеханизма(ЭтотОбъект);
	СтруктураДействий.Вставить("ЗаполнитьПроконтролироватьКачествоДатаПодтвержденияКачества",
		КонтрольКачестваКлиентСервер.КэшПоКлючу(КонтрольКачестваКэш, "Товары"));
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий);
	СтруктураДействий.Вставить("ЗаполнитьПроконтролироватьКачествоДатаПодтвержденияКачества",
		КонтрольКачестваКлиентСервер.КэшПоКлючу(КонтрольКачестваКэш, "Шапка"));
	Шапка = Новый Структура(
		"Номенклатура,
		|ПроконтролироватьКачество,
		|ДатаПодтвержденияКачества");
	ЗаполнитьЗначенияСвойств(Шапка, ЭтотОбъект);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Шапка, СтруктураДействий, Неопределено);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Шапка);
	
	ЗаказНаСборкуЛокализация.ПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
	Автор = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

&После("ЗаполнитьДокументПоОтбору")
Процедура АУ_ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.Свойство("ТоварыТЧ") Тогда
		
		Для каждого стрТовары Из ДанныеЗаполнения.ТоварыТЧ Цикл
			
			НоваяСтрока = ЭтотОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, стрТовары);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЭтотОбъект.Организация = АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("ОрганизацияАурум");
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ХозяйственнаяОперация) 
		И НЕ ЭтотОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров
		И НЕ ЭтотОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров Тогда
		
		ЭтотОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
		ЭтотОбъект.НачалоСборкиРазборки = ТекущаяДата();
		ЭтотОбъект.ОкончаниеСборкиРазборки = ТекущаяДата();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
