#Область ПрограммныйИнтерфейс

// Адрес данных проверки маркируемой продукции чек ККМ.
// 
// Параметры:
//  Объект - ДанныеФормыКоллекция, ДокументОбъект -
//  УникальныйИдентификатор - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  Строка - Адрес данных проверки маркируемой продукции чек ККМ
Функция АдресДанныхПроверкиМаркируемойПродукцииЧекККМ(Знач Объект, УникальныйИдентификатор) Экспорт
	
	Возврат ПроверкаИПодборПродукцииИСМПУТ.АдресДанныхПроверкиМаркируемойПродукцииЧекККМ(
		Объект,
		УникальныйИдентификатор);
	
КонецФункции

// Использовать ордерную схему при поступлении.
// 
// Параметры:
//  Склад - СправочникСсылка.Склады -
//  Дата - Неопределено, Дата -
//  МожетБытьГруппа - Булево - Может быть группа
// 
// Возвращаемое значение:
//  Булево, Произвольный - Использовать ордерную схему при поступлении
Функция ИспользоватьОрдернуюСхемуПриПоступлении(Склад, Дата = Неопределено, МожетБытьГруппа = Ложь) Экспорт
	
	Возврат СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(Склад, Дата, МожетБытьГруппа);
	
КонецФункции

// Использовать ордерную схему при отгрузке.
// 
// Параметры:
//  Склад - СправочникСсылка.Склады - 
//  Дата - Неопределено, Дата - 
//  МожетБытьГруппа - Булево - Может быть группа складов
// 
// Возвращаемое значение:
//  Булево, Произвольный - Использовать ордерную схему при отгрузке
Функция ИспользоватьОрдернуюСхемуПриОтгрузке(Склад, Дата = Неопределено, МожетБытьГруппа = Ложь) Экспорт
	
	Возврат СкладыСервер.ИспользоватьОрдернуюСхемуПриОтгрузке(Склад, Дата);
	
КонецФункции

// Получить данные по фактически обработанным маркам
// 
// Параметры:
//  ПроверяемыйДокумент - ДокументСсылка - распоряжение ордеров.
// 
// Возвращаемое значение:
//  Структура - Коды маркировки по ордерам:
//   * Успешно - Булево - Истина, если операция выполнена успешно
//   * Штрихкоды - см. ЗаполнитьТаблицуШтрихКодовДляЗагрузки.Штрихкоды
//   * ТекстОшибки - Строка
Функция КодыМаркировкиПоОрдерам(ПроверяемыйДокумент) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Успешно",      Ложь);
	ВозвращаемоеЗначение.Вставить("Штрихкоды",    Новый Массив);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",  "");
	
	Штрихкоды = Новый Массив();
	ПоРасходнымОрдерам = Истина;
	ТекстЗапроса = "";

	Если ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
		Или ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение")
		Или ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПоступлениеТоваровОтКлиента")
		Или ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента")
		Или ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПоступлениеТоваровОтХранителя") Тогда
		
		ТекстЗапросаОрдераПоРаспоряжению(ТекстЗапроса, Истина);
		ПоРасходнымОрдерам = Ложь;
		
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПриемкаТоваровИСМП") Тогда 
	
		ДокументОснование = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ПроверяемыйДокумент, "ДокументОснование");
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
			Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение")
			Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровОтКлиента")
			Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента")
			Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровОтХранителя") Тогда
			
			ПроверяемыйДокумент = ДокументОснование;
			ТекстЗапросаОрдераПоРаспоряжению(ТекстЗапроса, Истина);
			ПоРасходнымОрдерам = Ложь;
			
		КонецЕсли;
			
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ОтгрузкаТоваровСХранения")
		Или ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ОтгрузкаТоваровКлиенту")
		Или ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПередачаТоваровХранителю")
		Или ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПеремещениеТоваров")
		Или ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ВнутреннееПотребление")
	Тогда
		ТекстЗапросаОрдераПоРаспоряжению(ТекстЗапроса);
	Иначе
		
		ВозвращаемоеЗначение.Успешно = Ложь;
		ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(НСтр("ru='На основании документа %1 
															|невозможно подобрать фактически обработанные марки'"),
				ПроверяемыйДокумент);
				
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		
		ВозвращаемоеЗначение.Успешно = Ложь;
		ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(НСтр("ru='На основании документа %1 
															|невозможно подобрать фактически обработанные марки'"),
				ПроверяемыйДокумент);
				
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Если ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Запрос.УстановитьПараметр("Распоряжения",
			РеализацияТоваровУслугЛокализация.ПолучитьРаспоряженияПоДокументу(ПроверяемыйДокумент));
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПередачаТоваровХранителю") Тогда
		Запрос.УстановитьПараметр("Распоряжения",
			ПередачаТоваровХранителюЛокализация.ПолучитьРаспоряженияПоДокументу(ПроверяемыйДокумент));
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ОтгрузкаТоваровСХранения") Тогда
		Запрос.УстановитьПараметр("Распоряжения",
			ОтгрузкаТоваровСХраненияЛокализация.ПолучитьРаспоряженияПоДокументу(ПроверяемыйДокумент));
	Иначе
		Запрос.УстановитьПараметр("Распоряжения", ПолучитьРаспоряженияПоДокументу(ПроверяемыйДокумент));
	КонецЕсли;
	
	ТаблицаОрдеровПоРаспоряжению = Запрос.Выполнить().Выгрузить();
	Если ТаблицаОрдеровПоРаспоряжению.Количество() = 0 Тогда
		
		ВозвращаемоеЗначение.Успешно = Ложь;
		ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(НСтр("ru='На основании документа %1 
															|не найдены фактически обработанные марки'"),
				ПроверяемыйДокумент);
				
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	// Заполнение подобранной проверенной продукции. 
	// Исключить штрихкоды упаковок, отгруженные в других документах по распоряжению
	ТаблицаОтгрузокПоРаспоряжению = Новый Массив;
	Если ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Или ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПередачаТоваровХранителю")
		Или ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ОтгрузкаТоваровСХранения")
		Или ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ОтгрузкаТоваровКлиенту")
	Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТаблицаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.ЗаказКлиента В (&Распоряжения)
		|	И ТаблицаТовары.Ссылка <> &Ссылка";
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "РеализацияТоваровУслуг", ПроверяемыйДокумент.Метаданные().Имя);
		Запрос.УстановитьПараметр("Ссылка", ПроверяемыйДокумент);
		ТаблицаОтгрузокПоРаспоряжению = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТаблицаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.ЗаказНаПеремещение В (&Распоряжения)
		|	И ТаблицаТовары.Ссылка <> &Ссылка";
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ПроверяемыйДокумент);
		ТаблицаОтгрузокПоРаспоряжению = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ВнутреннееПотребление") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТаблицаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВнутреннееПотребление.Товары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.ЗаказНаВнутреннееПотребление В (&Распоряжения)
		|	И ТаблицаТовары.Ссылка <> &Ссылка";
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ПроверяемыйДокумент);
		ТаблицаОтгрузокПоРаспоряжению = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	ЕстьОшибки = Ложь;
	
	Пропускаем = Новый Соответствие;
	Для Каждого Строка Из ТаблицаОтгрузокПоРаспоряжению Цикл
		
		ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Строка);
		ШтрихкодыУпаковокПоДокументу = ШтрихкодированиеИС.ВложенныеШтрихкодыУпаковокПоДокументу(
			Строка,,, Истина, ПараметрыСканирования);
		ОтметитьИспользованныеШтрихкоды(Пропускаем, ШтрихкодыУпаковокПоДокументу.ВложенныеШтрихкоды.ДеревоУпаковок.Строки);
	
	КонецЦикла;
	
	// Исключить штрихкоды упаковок, отгруженные в ордере по другим распоряжениям
	ТоварыИсключения = Неопределено;
	Если ПоРасходнымОрдерам Тогда
		Запрос.УстановитьПараметр("Ссылка", ТаблицаОрдеровПоРаспоряжению.ВыгрузитьКолонку("Ордер"));
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия КАК Серия
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка В(&Ссылка)
		|	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение В (&Распоряжения)";
		ТоварыИсключения = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаОрдеровПоРаспоряжению Цикл
		
		ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Строка.Ордер);
		ШтрихкодыУпаковокПоДокументу = ШтрихкодированиеИС.ВложенныеШтрихкодыУпаковокПоДокументу(
			Строка.Ордер,,, Истина, ПараметрыСканирования);
		
		Если ШтрихкодыУпаковокПоДокументу.ЕстьОшибки Тогда
			ВозвращаемоеЗначение.Успешно = Ложь;
			ВозвращаемоеЗначение.ТекстОшибки = ШтрихкодыУпаковокПоДокументу.ТекстОшибки;
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли; 
		
		ТоварыИсключенияОрдера = ?(ТоварыИсключения = Неопределено, Неопределено,
			ТоварыИсключения.Скопировать(Новый Структура("Ссылка", Строка.Ордер)));
		ЗаполнитьТаблицуШтрихКодовДляЗагрузки(
			Пропускаем, Штрихкоды, ШтрихкодыУпаковокПоДокументу.ВложенныеШтрихкоды.ДеревоУпаковок.Строки, ТоварыИсключенияОрдера);
	
	КонецЦикла;
	
	Если Штрихкоды.Количество() = 0 И ВозвращаемоеЗначение.Успешно = Истина Тогда
		ВозвращаемоеЗначение.Успешно = Ложь;
		ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(НСтр("ru='На основании документа %1 
															|не найдены фактически обработанные марки'"),
				ПроверяемыйДокумент);
		
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Если Не ЕстьОшибки Тогда
		ВозвращаемоеЗначение.Успешно   = Истина;
		ВозвращаемоеЗначение.Штрихкоды = Штрихкоды;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Склад группы с общей политикой учета серий.
// 
// Параметры:
//  ГруппаСкладов - СправочникСсылка.Склады - Группа складов
// 
// Возвращаемое значение:
//  СправочникСсылка.Склады - склад из указанной группы складов, если по складам группы нет особенностей настроек серий.
Функция СкладГруппыСОбщейПолитикойУчетаСерий(ГруппаСкладов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаСкладов", ГруппаСкладов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолитикаУчетаСерий) КАК ПолитикиУчетаСерий
	|ПОМЕСТИТЬ НастройкиСкладов
	|ИЗ
	|	Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ВидыНоменклатурыПолитикиУчетаСерий
	|ГДЕ
	|	ВидыНоменклатурыПолитикиУчетаСерий.Склад В ИЕРАРХИИ (&ГруппаСкладов)
	|	И ВидыНоменклатурыПолитикиУчетаСерий.Склад <> (&ГруппаСкладов)
	|	И ВидыНоменклатурыПолитикиУчетаСерий.Ссылка.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|СГРУППИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР КОГДА Склады.ПолитикиУчетаСерий = 1
	|		ТОГДА Склады.Ссылка ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ КАК Склад
	|ИЗ
	|	НастройкиСкладов КАК Склады
	|УПОРЯДОЧИТЬ ПО
	|	Склады.ПолитикиУчетаСерий Убыв
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Склад;
	КонецЕсли;
	Возврат Справочники.Склады.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Считаем, что упаковки добавляются по принципу "однородности" - если добавляется хоть один товар из упаковки
//
// Параметры:
// ИсключаяШтрихкоды - Соответствие из Строка
// Штрихкоды - Массив из Структура:
//	*Штрихкод - Строка
//	*Количество - Строка
//	*ШтрихкодМаркиАлкогольнойПродукции - Строка
//	*ШтрихкодУпаковки - Строка
// СтрокиШК - Массив из СтрокаТаблицыЗначений
// ТоварыИсключения - Неопределено, ТаблицаЗначений - 
Процедура ЗаполнитьТаблицуШтрихКодовДляЗагрузки(ИсключаяШтрихкоды, Штрихкоды, СтрокиШК, ТоварыИсключения)
	
	Для Каждого СтрокаШК Из СтрокиШК Цикл
		
		Если ИсключаяШтрихкоды.Получить(СтрокаШК.Штрихкод) = Истина Тогда
			Продолжить;
		ИначеЕсли ТоварыИсключения <> Неопределено Тогда
			ТоварИсключение = Ложь;
			Элемент = СтрокаШК;
			Пока Не ТоварИсключение И Элемент <> Неопределено Цикл
				КлючПоиска = Новый Структура("Номенклатура, Характеристика, Серия");
				ЗаполнитьЗначенияСвойств(КлючПоиска, Элемент);
				Если ТоварыИсключения.НайтиСтроки(КлючПоиска).Количество() > 0 Тогда
					ТоварИсключение = Истина;
				КонецЕсли;
				КлючПоиска.Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
				Если ТоварыИсключения.НайтиСтроки(КлючПоиска).Количество() > 0 Тогда
					ТоварИсключение = Истина;
				КонецЕсли;
				Если Элемент.Строки.Количество() > 0 Тогда
					Элемент = Элемент.Строки[0];
				Иначе
					Элемент = Неопределено;
				КонецЕсли;
			КонецЦикла;
			Если ТоварИсключение Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ИсключаяШтрихкоды.Вставить(СтрокаШК.Штрихкод, Истина);
		
		ПоляСтроки = Новый Структура;
		ПоляСтроки.Вставить("Штрихкод",                          СтрокаШК.Штрихкод);
		ПоляСтроки.Вставить("Количество",                        1);
		ПоляСтроки.Вставить("ШтрихкодМаркиАлкогольнойПродукции", "");
		ПоляСтроки.Вставить("ШтрихкодУпаковки",                  "");
		Штрихкоды.Добавить(ПоляСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
// Штрихкоды - Соответствие Из Строка
// СтрокиШК - Массив из СтрокаТаблицыЗначений
Процедура ОтметитьИспользованныеШтрихкоды(Штрихкоды, СтрокиШК)
	
	Для Каждого СтрокаШК Из СтрокиШК Цикл
		
		Штрихкоды.Вставить(СтрокаШК.Штрихкод, Истина);
		Если СтрокаШК.Строки.Количество() > 0 Тогда
			ОтметитьИспользованныеШтрихкоды(Штрихкоды, СтрокаШК.Строки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает текст запроса остатка к оформлению.
// 
// Параметры:
//  ТекстЗапроса - Строка - текст запроса.
//  Приход - Булево - для документа поступления
//
Процедура ТекстЗапросаОрдераПоРаспоряжению(ТекстЗапроса, Приход = Ложь)
	
	Если Приход Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	Таблица.Регистратор КАК Ордер
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Обороты(,, Регистратор, ДокументПоступления В (&Распоряжения)) КАК Таблица
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Таблица.Регистратор) = ТИП(Документ.ПриходныйОрдерНаТовары)
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Регистратор
		|ИМЕЮЩИЕ
		|	СУММА(Таблица.КОформлениюПоступленийПоОрдерамПриход) > 0";
		
	Иначе
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	Таблица.Регистратор КАК Ордер
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Обороты(,, Регистратор, ДокументОтгрузки В (&Распоряжения)) КАК Таблица
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Таблица.Регистратор) = ТИП(Документ.РасходныйОрдерНаТовары)
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Регистратор
		|ИМЕЮЩИЕ
		|	СУММА(Таблица.КОтгрузкеРасход) > 0";
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРаспоряженияПоДокументу(ПроверяемыйДокумент)
	
	Результат = Новый Массив;
	Результат.Добавить(ПроверяемыйДокумент);
	
	Текст = "";
	Если ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ЗаказПоставщику КАК Основание ИЗ Документ.ПриобретениеТоваровУслуг.Товары КАК Товары ГДЕ Ссылка = &Ссылка
		|ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗаказПоставщику ИЗ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг ГДЕ Ссылка = &Ссылка";
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		Текст = "ВЫБРАТЬ ЗаявкаНаВозвратТоваровОтКлиента ИЗ Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента ГДЕ Ссылка = &Ссылка";
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПоступлениеТоваровОтХранителя") Тогда
		Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Распоряжение КАК Основание ИЗ Документ.ПоступлениеТоваровОтХранителя.Товары КАК Товары ГДЕ Ссылка = &Ссылка";
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПоступлениеТоваровОтКлиента") Тогда
		Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Распоряжение КАК Основание ИЗ Документ.ПоступлениеТоваровОтКлиента.Товары КАК Товары ГДЕ Ссылка = &Ссылка
		|ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ Распоряжение ИЗ Документ.ПоступлениеТоваровОтКлиента КАК ПоступлениеТоваровОтКлиента ГДЕ Ссылка = &Ссылка";
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") Тогда
		Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ЗаказПоставщику КАК Основание ИЗ Документ.ПриемкаТоваровНаХранение.Товары КАК Товары ГДЕ Ссылка = &Ссылка
		|ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗаказПоставщику ИЗ Документ.ПриемкаТоваровНаХранение КАК ПриемкаТоваровНаХранение ГДЕ Ссылка = &Ссылка";
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ЗаказНаПеремещение КАК Основание ИЗ Документ.ПеремещениеТоваров.Товары КАК Товары ГДЕ Ссылка = &Ссылка
		|ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗаказНаПеремещение ИЗ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров ГДЕ Ссылка = &Ссылка";
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ОтгрузкаТоваровКлиенту") Тогда
		Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ЗаказКлиента КАК Основание ИЗ Документ.ОтгрузкаТоваровКлиенту.Товары КАК Товары ГДЕ Ссылка = &Ссылка
		|ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗаказКлиента ИЗ Документ.ОтгрузкаТоваровКлиенту КАК ОтгрузкаТоваровКлиенту ГДЕ Ссылка = &Ссылка";
	ИначеЕсли ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.ВнутреннееПотребление") Тогда
		Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ЗаказНаВнутреннееПотребление КАК Основание ИЗ Документ.ВнутреннееПотребление.Товары КАК Товары ГДЕ Ссылка = &Ссылка
		|ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗаказНаВнутреннееПотребление ИЗ Документ.ВнутреннееПотребление КАК ОтгрузкаТоваровКлиенту ГДЕ Ссылка = &Ссылка";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Текст) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ПроверяемыйДокумент);
		Запрос.Текст = Текст;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Основание) Тогда
				Результат.Добавить(Выборка.Основание);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти

