// по boxId конвертим в организацию Диадок (создем если такой нет)
Функция ПолучитьОрганиациюДДПоId(ID) Экспорт

	Если ID = "00000000-0000-0000-0000-000000000000" Или ID = ""  Тогда 
		Возврат ПустаяСсылка();
	Иначе
		
		НайденнаяОрганизация = НайтиПоРеквизиту("ID", ID);
		Если ЗначениеЗаполнено(НайденнаяОрганизация) Тогда 
			
			Возврат НайденнаяОрганизация;
			
		Иначе
			
			НоваяОрганизация = СоздатьЭлемент();
			НоваяОрганизация.ID = ID;
			НоваяОрганизация.Наименование = "Не синхронизирована";
			НоваяОрганизация.Записать();
			
			Возврат НоваяОрганизация.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ТелефонЗаполнен(ОрганизацияСсылка) Экспорт 
	
	Если ЗначениеЗаполнено(ОрганизацияСсылка.ТелефонОсновной) Тогда 
		
		Возврат Истина;
		
	Иначе
		
		СтрокаТелефона = ОрганизацияСсылка.КонтактнаяИнформация.Найти(Перечисления.КонтурЛогистика_ВидыКонтактнойИнформации.Телефон ,"ВидКонтактнойИнформации");
		
		Если СтрокаТелефона = Неопределено Тогда 
			Возврат Ложь;
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТелефона.Значение) Тогда 
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// вернет массив с телефонами переадресовки этой орги 
// (если не указаны то массив с 1 эл-ом - основным телефоном)
Функция ТелефоныПереадресующего(ОрганизацияСсылка) Экспорт
	
	Если ОрганизацияСсылка.ТелефоныПереадресующегоПоУмолчанию.Количество() > 0 Тогда 
		
		Возврат ОрганизацияСсылка.ТелефоныПереадресующегоПоУмолчанию.ВыгрузитьКолонку("Телефон");
		
	ИначеЕсли ЗначениеЗаполнено(ОрганизацияСсылка.ТелефонОсновной) Тогда 
		
		МассивТел = Новый Массив;
		МассивТел.Добавить(ОрганизацияСсылка.ТелефонОсновной);
		Возврат МассивТел;
		
	Иначе
		
		Возврат Новый Массив;
		
	КонецЕсли;

КонецФункции

// для запросов в Диадок которые не требуется выполнять от имени конкретной орги
Функция ЛюбаяНашаОрганизация() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	               |ГДЕ
	               |	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	               |	И КонтурЛогистика_ОрганизацииДиадок.Наш
	               |	И КонтурЛогистика_ОрганизацииДиадок.ID <> """"";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция ЕстьОрганизации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок";
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

Функция ВсеНашиОрганизации() Экспорт
	
	НашиОрганизации = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И КонтурЛогистика_ОрганизацииДиадок.Наш
	|	И КонтурЛогистика_ОрганизацииДиадок.ID <> """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НашиОрганизации.Добавить(Выборка.Ссылка);
		
	КонецЦикла;	
	
	Возврат НашиОрганизации;
	
КонецФункции

Функция ЕстьНашиГОВОрганизациях() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И КонтурЛогистика_ОрганизацииДиадок.Наш
	|	И КонтурЛогистика_ОрганизацииДиадок.ID <> """"
	|	И КонтурЛогистика_ОрганизацииДиадок.Грузоотправитель";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Возврат Выборка.Следующий();
			
КонецФункции

Функция ЕстьНашиГПВОрганизациях() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И КонтурЛогистика_ОрганизацииДиадок.Наш
	|	И КонтурЛогистика_ОрганизацииДиадок.ID <> """"
	|	И КонтурЛогистика_ОрганизацииДиадок.Грузополучатель";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Возврат Выборка.Следующий();
			
КонецФункции

Функция ЕстьНашиПВВОрганизациях() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И КонтурЛогистика_ОрганизацииДиадок.Наш
	|	И КонтурЛогистика_ОрганизацииДиадок.ID <> """"
	|	И КонтурЛогистика_ОрганизацииДиадок.Перевозчик";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Возврат Выборка.Следующий();
	
КонецФункции

Функция ЕстьНашаРольВОрганизациях(ИмяРоли) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И КонтурЛогистика_ОрганизацииДиадок.Наш
	|	И КонтурЛогистика_ОрганизацииДиадок.ID <> """"
	|	И КонтурЛогистика_ОрганизацииДиадок.Перевозчик";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Перевозчик", ИмяРоли);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Возврат Выборка.Следующий();
	
КонецФункции	

Функция НашиГрузоотправителиУчСист() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.СвязанныйОбъект КАК СвязанныйОбъект
	               |ИЗ
	               |	Справочник.КонтурЛогистика_ОрганизацииДиадок.СвязанныеОбъекты КАК КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты
	               |ГДЕ
	               |	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка.Наш
	               |	И КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка.Грузоотправитель";
	
	Результат = Запрос.Выполнить();
	МассивОрганизацийУчСист = Результат.Выгрузить().ВыгрузитьКолонку("СвязанныйОбъект");
	Возврат  МассивОрганизацийУчСист;
	
КонецФункции

Функция НашиПеревозчикиУчСист() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.СвязанныйОбъект КАК СвязанныйОбъект
	               |ИЗ
	               |	Справочник.КонтурЛогистика_ОрганизацииДиадок.СвязанныеОбъекты КАК КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты
	               |ГДЕ
	               |	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка.Наш
	               |	И КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка.Перевозчик";
	
	Результат = Запрос.Выполнить();
	МассивОрганизацийУчСист = Результат.Выгрузить().ВыгрузитьКолонку("СвязанныйОбъект");
	Возврат  МассивОрганизацийУчСист;
	
КонецФункции

Функция НашиОформителиПЛУчСист() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.СвязанныйОбъект КАК СвязанныйОбъект
	               |ИЗ
	               |	Справочник.КонтурЛогистика_ОрганизацииДиадок.СвязанныеОбъекты КАК КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты
	               |ГДЕ
	               |	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка.Наш
	               |	И КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка.Оформитель";
	
	Результат = Запрос.Выполнить();
	МассивОрганизацийУчСист = Результат.Выгрузить().ВыгрузитьКолонку("СвязанныйОбъект");
	Возврат  МассивОрганизацийУчСист;
	
КонецФункции

Функция НашиСНастройкойЧтениеЛентыДД(ЧитатьЛентуДиадок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок КАК ОрганизацияДиадок
	               |ИЗ
	               |	РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_НастройкиОрганизаций
	               |ГДЕ
	               |	КонтурЛогистика_НастройкиОрганизаций.Настройка = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуДиадок)
	               |	И КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки = ИСТИНА
	               |	И КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок.Наш
	               |	И НЕ КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок.ПометкаУдаления";
	
	Если Не ЧитатьЛентуДиадок Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки = ИСТИНА", 
			"КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки = Ложь");	
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОрганизацияДиадок");
	
КонецФункции

Функция ЭтоНашГО(ОрганизацияСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|ГДЕ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка = &Ссылка
		|	И КонтурЛогистика_ОрганизацииДиадок.Наш
		|	И КонтурЛогистика_ОрганизацииДиадок.Грузоотправитель
		|	И НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", ОрганизацияСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция НастроенныеОрганизацииУчСистПоРоли(ИмяРоли = "Грузополучатель") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.СвязанныйОбъект КАК СвязанныйОбъект
	               |ИЗ
	               |	Справочник.КонтурЛогистика_ОрганизацииДиадок.СвязанныеОбъекты КАК КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты
	               |ГДЕ
	               |	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка.Перевозчик";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Перевозчик", ИмяРоли);
	
	Результат = Запрос.Выполнить();
	МассивОрганизацийУчСист = Результат.Выгрузить().ВыгрузитьКолонку("СвязанныйОбъект");
	Возврат  МассивОрганизацийУчСист;
	
КонецФункции

Функция СвязанныеОбъекты(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.СвязанныйОбъект КАК СвязанныйОбъект
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок.СвязанныеОбъекты КАК КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Связанные = Результат.Выгрузить().ВыгрузитьКолонку("СвязанныйОбъект");
	Возврат  Связанные;
	
КонецФункции

Процедура АктуализироватьИзДиадока(МассивОрганизаций) Экспорт 
	
	Для Каждого ОрганизацияДД Из МассивОрганизаций Цикл 
		
		Попытка
		
			ДанныеДД = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetOrganization(ОрганизацияДД);
			ЗаполнитьОрганизациюИзДанныхДиадока(ДанныеДД, ОрганизацияДД);
						
		Исключение
			
			Сообщить("Неудача при вычитывании данных из Диадок по Организации: " + ОрганизацияДД + " - " + ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
	ОбновитьСвязанныеОбъекты(МассивОрганизаций);
	
КонецПроцедуры

Процедура ОбновитьСвязанныеОбъекты(МассивИлиОрганизацияСсылка) Экспорт 
	
	ТаблицаСоответствий = КонтурЛогистика_ОбщегоНазначенияСервер.СоответствиеОрганизацииУСОрганизациямДД(МассивИлиОрганизацияСсылка);
	
	Если Не ТаблицаСоответствий = Неопределено Тогда
		
		Если ТипЗнч(МассивИлиОрганизацияСсылка) = Тип("Массив") Тогда 
			
			Для Каждого СтрокаОрганизации Из МассивИлиОрганизацияСсылка Цикл 
				
				ОбновитьСвязныеОбъектыПоОрганизации(СтрокаОрганизации, ТаблицаСоответствий);
				
			КонецЦикла;	
			
		Иначе
			
			ОбновитьСвязныеОбъектыПоОрганизации(МассивИлиОрганизацияСсылка, ТаблицаСоответствий);
			
		КонецЕсли;	
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСвязныеОбъектыПоОрганизации(ОрганизацияСсылка, ТаблицаСоответствий) Экспорт 
	
	НужнаЗапись = Ложь;
	
	ОрганизацияОбъект = ОрганизацияСсылка.ПолучитьОбъект();
	
	НайденныеСвязи = ТаблицаСоответствий.НайтиСтроки(Новый Структура("ОрганизацияДД", ОрганизацияОбъект.Ссылка));
	
	Для Каждого Связь Из НайденныеСвязи Цикл 
		
		// а что если в организации уже что-то есть в сязных объектах? проверим от дублей
		Если ОрганизацияОбъект.СвязанныеОбъекты.Количество() 
			И Не ОрганизацияОбъект.СвязанныеОбъекты.Найти(Связь.ОрганизацияУС, "СвязанныйОбъект") = Неопределено Тогда  
			Продолжить;
		КонецЕсли;	
		
		// добавляем в организацию ДД новый связный объект
		НовыйСвязныйОбъект = ОрганизацияОбъект.СвязанныеОбъекты.Добавить();
		НовыйСвязныйОбъект.СвязанныйОбъект = Связь.ОрганизацияУС;
		
		НужнаЗапись = Истина;
		
	КонецЦикла;		
	
	Если НужнаЗапись Тогда 
		ОрганизацияОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры	

Функция ЗаполнитьОрганизациюИзДанныхДиадока(Знач ДанныеОднойОрганизации, Знач ОрганизацияКЗаполнению = Неопределено, СинхронизироватьКонтрагентовОрганизации = Ложь) Экспорт
	
	// Найти организацию если не передана
	
	Если ОрганизацияКЗаполнению = Неопределено Тогда 
		
		ОрганизацияКЗаполнению = НайтиПоРеквизиту("OrgId", ДанныеОднойОрганизации.OrgId);
		Если Не ЗначениеЗаполнено(ОрганизацияКЗаполнению) Тогда 
			ОрганизацияОбъект = Справочники.КонтурЛогистика_ОрганизацииДиадок.СоздатьЭлемент();
		Иначе
			ОрганизацияОбъект =  ОрганизацияКЗаполнению.ПолучитьОбъект();
		КонецЕсли;
		
	Иначе
		
		ОрганизацияОбъект =  ОрганизацияКЗаполнению.ПолучитьОбъект();
		
	КонецЕсли;
	
	Попытка
		// Заполнить поля
		ЗаполнитьПоляОрганизацииПоДаннымСервиса(ОрганизацияОбъект, ДанныеОднойОрганизации);
		
		ОрганизацияОбъект.Записать();
		
		// Не важно под какой организацией получаем данные
		ТочноеСовпадение = Ложь;
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
		Если ПараметрыСервиса.АвторизацияВыполнена Тогда
			ОрганизацияОбъект.СинхронизироватьИзСервисаЛогистика();
		КонецЕсли;
		
		СинхронизироватьПодразделения(ДанныеОднойОрганизации);
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьОрганизациюИзДанныхДиадока", ИнформацияОбОшибке(), ОрганизацияОбъект.Ссылка);
		
		Если Не СинхронизироватьКонтрагентовОрганизации Тогда
			ВызватьИсключение;
		Иначе
			Сообщить(ИнформацияОбОшибке.Описание);	
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат ОрганизацияОбъект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьПоляОрганизацииПоДаннымСервиса(ОрганизацияОбъект, ДанныеОднойОрганизации)
	
	Если ДанныеОднойОрганизации.Свойство("FnsParticipantId") Тогда 
		ОрганизацияОбъект.ИдентификаторУчастникаЭДО = ДанныеОднойОрганизации.FnsParticipantId;
	КонецЕсли;
	
	Если ДанныеОднойОрганизации.Свойство("Sociability") Тогда 
		ОрганизацияОбъект.Sociability = ДанныеОднойОрганизации.Sociability;
	КонецЕсли;
	
	ОрганизацияОбъект.НаименованиеОрганизацииПолное = ДанныеОднойОрганизации.FullName;
	Если ДанныеОднойОрганизации.Свойство("ShortName") Тогда 
		ОрганизацияОбъект.Наименование 				= ДанныеОднойОрганизации.ShortName;
	Иначе
		ОрганизацияОбъект.Наименование 				= ОрганизацияОбъект.НаименованиеОрганизацииПолное;
	КонецЕсли;
	
	ОрганизацияОбъект.ИНН 						= ДанныеОднойОрганизации.Inn;
	
	Если ДанныеОднойОрганизации.Свойство("Ogrn") Тогда 
		ОрганизацияОбъект.ОГРН 					= ДанныеОднойОрганизации.Ogrn;
	КонецЕсли;
	
	Если СтрДлина(ОрганизацияОбъект.ИНН) = 12 Тогда
		
		Если ЗначениеЗаполнено(ОрганизацияОбъект.ОГРН) Тогда
			ОрганизацияОбъект.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ИП;
		Иначе
			ОрганизацияОбъект.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ФизЛицо;
		КонецЕсли;
		
		ФИОМассив = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(ОрганизацияОбъект.Наименование, " ");
		ОрганизацияОбъект.Фамилия = ФИОМассив[0];
		ОрганизацияОбъект.Имя = ФИОМассив[1];
		Если ФИОМассив.Количество() > 2 Тогда 
			ОрганизацияОбъект.Отчество = ФИОМассив[2];
		КонецЕсли;
		
	ИначеЕсли ДанныеОднойОрганизации.IsForeign = Истина Тогда 
		ОрганизацияОбъект.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ИностранныйЮрЛицо;
	Иначе 
		ОрганизацияОбъект.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ЮрЛицо;
	КонецЕсли;
	
	Если ДанныеОднойОрганизации.Свойство("Kpp") Тогда 
		ОрганизацияОбъект.КПП 					= ДанныеОднойОрганизации.Kpp;
	КонецЕсли;
	
	ОрганизацияОбъект.Тестовая 					= ДанныеОднойОрганизации.IsTest;
	ОрганизацияОбъект.OrgId 					= ДанныеОднойОрганизации.OrgId;
	
	Если ДанныеОднойОрганизации.Boxes.Количество() > 0 Тогда 
		ОрганизацияОбъект.ID 					= ДанныеОднойОрганизации.Boxes[0].BoxIdGuid;
	КонецЕсли;
	
	Если ДанныеОднойОрганизации.Свойство("Address") Тогда 
		Если ДанныеОднойОрганизации.Address.Свойство("RussianAddress") И ТипЗнч(ДанныеОднойОрганизации.Address.RussianAddress) =  Тип("Структура") Тогда
			
			Для Каждого ЭлементАдреса Из ДанныеОднойОрганизации.Address.RussianAddress Цикл 
				
				Если ЭлементАдреса.Ключ = "ZipCode" 
					ИЛИ ЭлементАдреса.Ключ = "City" 
					ИЛИ ЭлементАдреса.Ключ = "Region" 
					ИЛИ ЭлементАдреса.Ключ = "Street" 
					ИЛИ ЭлементАдреса.Ключ = "Locality" 
					ИЛИ ЭлементАдреса.Ключ = "Territory" 
					ИЛИ ЭлементАдреса.Ключ = "Apartment" 
					ИЛИ ЭлементАдреса.Ключ = "Block" 
					ИЛИ ЭлементАдреса.Ключ = "Building" 
					Тогда
					
					ОрганизацияОбъект["Адрес" + ЭлементАдреса.Ключ] = ЭлементАдреса.Значение;		
					
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ДанныеОднойОрганизации.Address.Свойство("ForeignAddress") И ТипЗнч(ДанныеОднойОрганизации.Address.ForeignAddress) =  Тип("Структура") Тогда
			
			Для Каждого ЭлементАдреса Из ДанныеОднойОрганизации.Address.ForeignAddress Цикл 
				
				Если ЭлементАдреса.Ключ = "Address" 
					ИЛИ ЭлементАдреса.Ключ = "Country" 
					Тогда
					
					ОрганизацияОбъект["ИнАдрес" + ЭлементАдреса.Ключ] = ЭлементАдреса.Значение;		
					
				КонецЕсли;
				
			КонецЦикла;
			
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СинхронизироватьПодразделения(ДанныеОднойОрганизации)

	Справочники.КонтурЛогистика_ПодразделенияДиадок.СинхронизироватьПоОрганизации(ДанныеОднойОрганизации);

КонецПроцедуры

Процедура СинхронизироватьКонтрагентовОрганизации(ОрганизацияСсылка, ПараметрыФоновогоЗадания = Неопределено) Экспорт
	
	Попытка
		
		ПараметрыУстановкиМодулей = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПараметрыУстановкиМодулей();
		
		ОрганизацияОбъект = ОрганизацияСсылка.ПолучитьОбъект();
		
		ОрганизацияОбъект.Контрагенты.Очистить();
		
		ПоследнийIndexKey = Неопределено;
		ВычитаноКонтрагентовВИтерации = 0;
		КоличествоУдовлетворяетЗапросу = 10000;
		ВсегоВычитывать = 10000;
		ВсегоКонтрагентов = 0;
						
		Счетчик = 1;
		Пока ВычитаноКонтрагентовВИтерации < КоличествоУдовлетворяетЗапросу Цикл
			
			ПорцияДанныеКонтрагентовОрганизацииДД = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetCounteragents(ОрганизацияСсылка, ПоследнийIndexKey);
			ВычитаноКонтрагентовВИтерации = ПорцияДанныеКонтрагентовОрганизацииДД.Counteragents.Количество();
			КоличествоУдовлетворяетЗапросу = ПорцияДанныеКонтрагентовОрганизацииДД.TotalCount;
			
			Если Счетчик = 1 Тогда
				ВсегоКонтрагентов = ПорцияДанныеКонтрагентовОрганизацииДД.TotalCount;		
			КонецЕсли;
			
			Если ВычитаноКонтрагентовВИтерации > 0 Тогда 
				
				Если Счетчик = ВсегоВычитывать Тогда
					Прервать;	
				КонецЕсли;
				
				ПоследнийВычитанный = ПорцияДанныеКонтрагентовОрганизацииДД.Counteragents[ВычитаноКонтрагентовВИтерации - 1]; 
				ПоследнийIndexKey = ПоследнийВычитанный.IndexKey;
				
				Для Каждого Строка Из ПорцияДанныеКонтрагентовОрганизацииДД.Counteragents Цикл
					
					СтатусСвязи = Перечисления.КонтурЛогистика_СтатусыКонтрагентов[Строка.CurrentStatus];
					// неочевидна необходимость фильтровать по Статусу связи. Пропускать разорванные нами/ими связи?
					
					// ликвидированные организации загружать не будем
					Если Строка.Organization.Свойство("LiquidationDate") И ЗначениеЗаполнено(Строка.Organization.LiquidationDate) Тогда
						Счетчик = Счетчик + 1;
						Продолжить;
					КонецЕсли;
					
					// создадим организации-контрагентов
					КонтрагентСсылка = ЗаполнитьОрганизациюИзДанныхДиадока(Строка.Organization,, Истина);
					
					Если ПараметрыУстановкиМодулей.Диадок.МодульУстановлен
						И КонтрагентСсылка.СвязанныеОбъекты.Количество() = 0 Тогда
						
						// сопоставим контрагента, если найдем в других модулях
						СвязаныеОбъектыКонтрагентовИзМодулейКонтура(КонтрагентСсылка, ПараметрыУстановкиМодулей);
					КонецЕсли;
					
					// привяжем к Организации
					СтрокаКонтрагента = ОрганизацияОбъект.Контрагенты.Добавить();
					СтрокаКонтрагента.Контрагент = КонтрагентСсылка;
					СтрокаКонтрагента.Статус = СтатусСвязи;
					
					Если ПараметрыФоновогоЗадания <> Неопределено И ПараметрыФоновогоЗадания.КолвоОрганизаций = 1 Тогда 
						Текст = Формат(Счетчик, "ЧГ=0") + ". " + Строка(КонтрагентСсылка);
						КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(Текст);
						ПараметрыФоновогоЗадания.Результат.Прогресс = Окр(Счетчик / ?(ВсегоВычитывать <= ВсегоКонтрагентов, ВсегоВычитывать, ВсегоКонтрагентов) * 100);
						ПоместитьВоВременноеХранилище(ПараметрыФоновогоЗадания.Результат, ПараметрыФоновогоЗадания.АдресРезультата);													
					КонецЕсли;
										
					Если Счетчик = ВсегоВычитывать Тогда
						Прервать;	
					КонецЕсли;
					
					Счетчик = Счетчик + 1;
									
				КонецЦикла;			
				
			Иначе
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОрганизацияОбъект.Записать();
				
	Исключение
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения("Ошибки при вычитывании из Диадока Контрагентов: " + ОписаниеОшибки());	
		
	КонецПопытки;
	
КонецПроцедуры

Процедура СвязаныеОбъектыКонтрагентовИзМодулейКонтура(КонтрагентСсылка, ПараметрыУстановкиМодулей)
	
	СвязаныыеОбъектыКонтрагента = ПолучитьСвязаныыеОбъектыКонтрагентовИзМодулейКонтура(
		ПараметрыУстановкиМодулей.Диадок, КонтрагентСсылка.ID);
	
	Если СвязаныыеОбъектыКонтрагента.Количество() <> 0 Тогда
		
		КонтрагентОбъект = КонтрагентСсылка.ПолучитьОбъект();
		
		Для Каждого ТекущийСвязанныйОбъект Из СвязаныыеОбъектыКонтрагента Цикл
			НоваяСтрока = КонтрагентОбъект.СвязанныеОбъекты.Добавить();
			НоваяСтрока.СвязанныйОбъект = ТекущийСвязанныйОбъект;
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		КонтрагентОбъект.Записать();
	Исключение
		НичегоНеДелаем = Истина;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьСвязаныыеОбъектыКонтрагентовИзМодулейКонтура(НастройкиДиадок, boxID)
	
	Результат = Новый Массив;
	
	АдресЯщикаДиадок = КонтурЛогистика_API_Диадок.ИдентификаторВАдресЯщика(boxID);
	
	Если НастройкиДиадок.ИспользоватьТиповуюПодсистему1С Тогда
		
		// Получи свойство по имени настройки
		Если Не НастройкиДиадок.Свойство("СвойствоНастройкиКонтрагента") Тогда
			ИмяСвойства = "ДДКонтр_";
			Если НастройкиДиадок.ЭтоУФ Тогда
				СвойствоНастройкиКонтрагента = ПланыВидовХарактеристик["ДополнительныеРеквизитыИСведения"].НайтиПоНаименованию(
					ИмяСвойства, Истина);
			Иначе
				СвойствоНастройкиКонтрагента = ПланыВидовХарактеристик["СвойстваОбъектов"].НайтиПоНаименованию(
					ИмяСвойства, Истина);
			КонецЕсли;
			НастройкиДиадок.Вставить("СвойствоНастройкиКонтрагента", СвойствоНастройкиКонтрагента);
			
			Если СвойствоНастройкиКонтрагента = Неопределено Тогда
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
		
		// Получим контрагентов
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Свойство", НастройкиДиадок.СвойствоНастройкиКонтрагента);
		Запрос.УстановитьПараметр("Значение", АдресЯщикаДиадок);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство
		|	И ЗначенияСвойствОбъектов.Значение = &Значение";
		
		Если НастройкиДиадок.ЭтоУФ Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗначенияСвойствОбъектов", "ДополнительныеСведения");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(Выборка.Объект) Тогда
				Продолжить;
			КонецЕсли;
			
			Результат.Добавить(Выборка.Объект);
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИмяСправочника", "Контрагенты");
		Запрос.УстановитьПараметр("ID", АдресЯщикаДиадок);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Диадок_ЮрФизЛица.СвязанныйСправочник1 КАК СвязанныйСправочник1,
		|	Диадок_ЮрФизЛица.СвязанныйСправочник2 КАК СвязанныйСправочник2,
		|	Диадок_ЮрФизЛица.СвязанныйСправочник3 КАК СвязанныйСправочник3
		|ИЗ
		|	Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
		|ГДЕ
		|	Диадок_ЮрФизЛица.ИмяСправочника = &ИмяСправочника
		|	И Диадок_ЮрФизЛица.ID = &ID";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.СвязанныйСправочник1) Тогда
				Результат.Добавить(Выборка.СвязанныйСправочник1);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.СвязанныйСправочник2) Тогда
				Результат.Добавить(Выборка.СвязанныйСправочник2);
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.СвязанныйСправочник3) Тогда
				Результат.Добавить(Выборка.СвязанныйСправочник3);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТекстПодробногоОписанияОшибки(ОрганизацияСсылка, ПредставлениеТиповДокумента)
	
	ОписаниеОшибки = "";
	
	Если ЗначениеЗаполнено(ПредставлениеТиповДокумента) Тогда 
	
		СтрокаШаблона = НСтр("ru = 'Для организации ""%1"" (ИНН - %2, BoxId - %3) не настроены типы документов ""%4"". 
                              |Прошу включить эти типы в сервисе Диадок.'");
			
		ОписаниеОшибки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(СтрокаШаблона, 
							ОрганизацияСсылка.НаименованиеОрганизацииПолное, 
							ОрганизацияСсылка.КПП, 
							ОрганизацияСсылка.ID, 
							ПредставлениеТиповДокумента);
						
	КонецЕсли;
	
	Возврат ОписаниеОшибки;
	
КонецФункции	

Функция ПолучитьТекстЯчейкиОбласти(Область, Строка, Колонка)
	
	Возврат Строка(Область.ПолучитьОбласть("R" + Формат(Строка, "ЧГ=0") + "C" + Формат(Колонка, "ЧГ=0")).ТекущаяОбласть.Текст);
	
КонецФункции

Функция ПолучитьОписаниеКлючейПоиска() Экспорт
	
	// Поиск организации осуществляется по:
	// 1. ИНН + КПП
	// 2. ИНН
	// 3. ОГРН
	
	ШаблонСтрокиПоиска = " И КонтурЛогистика_Справочник.%1 = &%1";
	
	КлючиПоиска = Новый Массив;
		
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска, "ИНН,КПП", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска, "ИНН", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска, "ОГРН", ШаблонСтрокиПоиска);
	
	Возврат КлючиПоиска;
	
КонецФункции	

Функция ТекстОшибкиНеЗаполненыКлючевыеРеквизиты() Экспорт
	
	ТекстОшибки = "Ошибка при поиске Организации Диадок. Не заполнен один из ключевых реквизитов в одном из вариантов поиска: 
					|1. ИНН + КПП 
					|2. ИНН
					|3. ОГРН";
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция КонвертироватьВычисленноеЗначениеВОбъектЛогистики(ВычисленныеРеквизиты, ВычисленноеЗначение) Экспорт 
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
		
	ОписаниеСтрокиИНН = ВычисленныеРеквизиты.Найти("ИНН", "Реквизит");
	ОписаниеСтрокиКПП = ВычисленныеРеквизиты.Найти("КПП", "Реквизит");
	
	Если ОписаниеСтрокиИНН = Неопределено Тогда 
		
		Результат.ОписаниеОшибки = НСтр("ru = 'Неудача при конвертации значения: нет необходимого для создания организации реквизита ИНН.'");
		
		Возврат Результат;
		
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(ОписаниеСтрокиИНН.Ошибка) Тогда
		
		Результат.ОписаниеОшибки = ОписаниеСтрокиИНН.Ошибка;
		
		Возврат Результат;
		
	КонецЕсли;	
		
	ИНН = ОписаниеСтрокиИНН.Значение;
	КПП = Неопределено;
	
	Если Не ОписаниеСтрокиКПП = Неопределено И ЗначениеЗаполнено(ОписаниеСтрокиКПП.Значение) Тогда
		
		КПП = ОписаниеСтрокиКПП.Значение;
		
	КонецЕсли;
	
	ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ДанныеАутентификацииЛюбойОрганизации();
	ПараметрыСервиса = КонтурЛогистика_API_Диадок.ЛогистикаПараметрыСервиса_Диадок(ДанныеАутентификации.DiadocBoxId);
	ДанныеДД = ДанныеОрганизацийДиадока(ПараметрыСервиса, ИНН, КПП);
	
	Если ДанныеДД = Неопределено И КПП <> Неопределено Тогда
		// Если есть КПП и не нашли по ИНН-КПП, то попробуем найти по ИНН
		ДанныеДД = ДанныеОрганизацийДиадока(ПараметрыСервиса, ИНН);
	КонецЕсли;
	
	Если ДанныеДД = Неопределено Тогда
		
		// дадим кастомное создание Организации, если не нашли в ДД
		ОрганизацияСсылка = КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
								"Конвертация_СоздатьОрганизациюДиадокИзВычисленныхРеквизитов",
								Ложь,
								Новый Структура("ВычисленныеРеквизиты, ВычисленноеЗначение", ВычисленныеРеквизиты, ВычисленноеЗначение));
								
		Если ОрганизацияСсылка = Неопределено Тогда 
			
			НоваяОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.СоздатьЭлемент();
			НоваяОрганизация.ИНН 			= ИНН;
			НоваяОрганизация.КПП 			= КПП;
			НоваяОрганизация.ТипЛица 		= Перечисления.КонтурЛогистика_ТипыЛиц.ЮрЛицо;
			НоваяОрганизация.Наименование 	= "Неизвестная организация, ИНН - " + ИНН;
			НоваяОрганизация.Записать();
			
			// Не важно под какой организацией получаем данные
			ТочноеСовпадение = Ложь;
			ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
			Если ПараметрыСервиса.АвторизацияВыполнена Тогда
				НоваяОрганизация.СинхронизироватьИзСервисаЛогистика();
			КонецЕсли;
			
			ОрганизацияСсылка = НоваяОрганизация.Ссылка;
			
		КонецЕсли;
		
	Иначе
		
		ОрганизацияСсылка = ЗаполнитьОрганизациюИзДанныхДиадока(ДанныеДД);
		
	КонецЕсли;
	
	Если ВычисленныеРеквизиты.Количество() <> 0 Тогда
		
		// Заполним вычисленные реквизиты при конвертации
		ОрганизацияОбъект = ОрганизацияСсылка.ПолучитьОбъект();
		
		Для Каждого ВычисленныйРеквизит Из ВычисленныеРеквизиты Цикл
			Если Не ЗначениеЗаполнено(ВычисленныйРеквизит.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			// ИНН и КПП заполнили из данных Диадока
			Если ДанныеДД <> Неопределено
				И (ВычисленныйРеквизит.Реквизит = "ИНН" Или ВычисленныйРеквизит.Реквизит = "КПП") Тогда
				
				Продолжить;
			КонецЕсли;
			
			ОрганизацияОбъект[ВычисленныйРеквизит.Реквизит] = ВычисленныйРеквизит.Значение;
		КонецЦикла;
		
		КонтурЛогистика_КонвертацияСервер.ДобавитьВычисленноеЗначениеВСвязныеОбъектыЛогистики(ОрганизацияОбъект, ВычисленноеЗначение);
		
	Иначе
		
		КонтурЛогистика_КонвертацияСервер.ДобавитьВычисленноеЗначениеВСвязныеОбъектыЛогистики(ОрганизацияОбъект, ВычисленноеЗначение, Истина);
		
	КонецЕсли;
	
	Результат.Успешно = Истина;
	Результат.Вставить("Значение", ОрганизацияСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеОрганизацийДиадока(ПараметрыСервиса, Знач ИНН, Знач КПП = Неопределено)
	
	Попытка
		
		ДанныеОрганизаций = КонтурЛогистика_ИнтеграцияДиадокСерверПовтИсп.Ядро().АПИ_GetOrganizationsByInnKpp(ПараметрыСервиса, ИНН, КПП);
		
		Если ТипЗнч(ДанныеОрганизаций) <> Тип("Структура") И Не ДанныеОрганизаций.Свойство("Organizations") Тогда
			
			ДанныеДД = Неопределено;
			
		ИначеЕсли ДанныеОрганизаций.Organizations.Количество() = 1 Тогда
			
			ДанныеДД = ДанныеОрганизаций.Organizations[0];
			
		ИначеЕсли ДанныеОрганизаций.Organizations.Количество() = 0 Тогда
			
			ДанныеДД = Неопределено;
			
		Иначе
			
			ДанныеДД = Неопределено;
			
			// Приоритетно берем организацию не из роуминга
			Для Каждого ТекущаяСтрока Из ДанныеОрганизаций.Organizations Цикл
				Если ДанныеДД = Неопределено Тогда
					ДанныеДД = ТекущаяСтрока;
					Продолжить;
				КонецЕсли;
				
				Если Не ТекущаяСтрока.IsRoaming Тогда
					ДанныеДД = ТекущаяСтрока;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		
		ДанныеДД = Неопределено;
		
	КонецПопытки;
	
	Возврат ДанныеДД;
	
КонецФункции

#Область НастройкиОрганизаций

Процедура СконвертироватьНастройкиИзСтарыхВНовые() Экспорт
	
	// простые
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадокУдалитьНастройки.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ОрганизацииДиадокУдалитьНастройки.НомерСтроки КАК НомерСтроки,
	|	КонтурЛогистика_ОрганизацииДиадокУдалитьНастройки.Настройка КАК Настройка,
	|	КонтурЛогистика_ОрганизацииДиадокУдалитьНастройки.ЗначениеНастройки КАК ЗначениеНастройки
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок.УдалитьНастройки КАК КонтурЛогистика_ОрганизацииДиадокУдалитьНастройки";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Настройка <> Неопределено
			И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			
			УстановитьНастройку(Выборка.Ссылка, Выборка.Настройка, Выборка.ЗначениеНастройки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// служебные
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_ОрганизацииДиадокСлужебные.Ссылка КАК Ссылка,
	               |	КонтурЛогистика_ОрганизацииДиадокСлужебные.НомерСтроки КАК НомерСтроки,
	               |	КонтурЛогистика_ОрганизацииДиадокСлужебные.Настройка КАК Настройка,
	               |	КонтурЛогистика_ОрганизацииДиадокСлужебные.ЗначениеНастройки КАК ЗначениеНастройки
	               |ИЗ
	               |	Справочник.КонтурЛогистика_ОрганизацииДиадок.УдалитьСлужебные КАК КонтурЛогистика_ОрганизацииДиадокСлужебные";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		УстановитьСлужебнуюНастройку(Выборка.Ссылка, Выборка.Настройка, Выборка.ЗначениеНастройки)
		
	КонецЦикла;
	
	// отметим успешный перенос
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок КАК ОрганизацияДиадок
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_НастройкиОрганизаций";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл

		УстановитьСлужебнуюНастройку(Выборка.ОрганизацияДиадок, "ПереносНаНовыеНастройкиВыполнен", Истина)

	КонецЦикла;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура СконвертироватьНастройкуВВидеРеквизитаИзСтаройВНовую(Настройка) Экспорт
	
	Если Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадок Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтурЛогистика_ОрганизацииДиадок.УдалитьAfterIndexKey КАК УдалитьAfterIndexKey,
			|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
			|ГДЕ
			|	КонтурЛогистика_ОрганизацииДиадок.УдалитьAfterIndexKey <> &УдалитьAfterIndexKey";
		
		Запрос.УстановитьПараметр("УдалитьAfterIndexKey", "");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			УстановитьНастройку(ВыборкаДетальныеЗаписи.Ссылка, Настройка, ВыборкаДетальныеЗаписи.УдалитьAfterIndexKey);
		КонецЦикла;
			
	КонецЕсли;
	
	Если Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадокДата Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтурЛогистика_ОрганизацииДиадок.УдалитьДатаГраницыСинхронизации КАК УдалитьДатаГраницыСинхронизации,
			|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
			|ГДЕ
			|	КонтурЛогистика_ОрганизацииДиадок.УдалитьДатаГраницыСинхронизации <> &УдалитьДатаГраницыСинхронизации";
		
		Запрос.УстановитьПараметр("УдалитьДатаГраницыСинхронизации", Дата(1, 1, 1));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			УстановитьНастройку(ВыборкаДетальныеЗаписи.Ссылка, Настройка, ВыборкаДетальныеЗаписи.УдалитьДатаГраницыСинхронизации);
		КонецЦикла;
			
	КонецЕсли;
		
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Функция ПереносНастроекВыполнен(Настройка = Неопределено) Экспорт

	Запрос = Новый Запрос;
	
	// если есть хоть одна запись - значит настройки перенесены
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_НастройкиОрганизацийСлужебные.ЗначениеНастройки КАК ЗначениеНастройки
	               |ИЗ
	               |	РегистрСведений.КонтурЛогистика_НастройкиОрганизацийСлужебные КАК КонтурЛогистика_НастройкиОрганизацийСлужебные
	               |ГДЕ
	               |	КонтурЛогистика_НастройкиОрганизацийСлужебные.Настройка = &Настройка";
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КонтурЛогистика_НастройкиОрганизацийСлужебные", "КонтурЛогистика_НастройкиОрганизаций");
		Запрос.УстановитьПараметр("Настройка", Настройка);				
	Иначе
		Запрос.УстановитьПараметр("Настройка", "ПереносНаНовыеНастройкиВыполнен");				
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();

КонецФункции

Функция ЗначениеНастройки(ОрганизацияДиадокСсылка, НастройкаОрганизации) Экспорт 
	
	// контроль переноса существующих настроек в новые
	ПереносНаНовыеНастройкиВыполнен = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПереносНастроекОрганизацииВыполнен();
	Если ПереносНаНовыеНастройкиВыполнен <> Истина Тогда 
		СконвертироватьНастройкиИзСтарыхВНовые();
	КонецЕсли;
	Если НастройкаОрганизации = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадок
		Или НастройкаОрганизации = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадокДата Тогда
		ПереносНаНовыеНастройкиВыполнен = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПереносНастроекОрганизацииВыполнен(НастройкаОрганизации);
		Если ПереносНаНовыеНастройкиВыполнен <> Истина Тогда 
			СконвертироватьНастройкуВВидеРеквизитаИзСтаройВНовую(НастройкаОрганизации);
		КонецЕсли;	
	КонецЕсли;
	
	// получение настройки
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки КАК ЗначениеНастройки
	               |ИЗ
	               |	РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_НастройкиОрганизаций
	               |ГДЕ
	               |	КонтурЛогистика_НастройкиОрганизаций.Настройка = &Настройка
	               |	И КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок = &ОрганизацияДиадок";
	
	Запрос.УстановитьПараметр("ОрганизацияДиадок", ОрганизацияДиадокСсылка);
	Запрос.УстановитьПараметр("Настройка", НастройкаОрганизации);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ЗначениеНастройки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ЗначениеСлужебнойНастройки(ОрганизацияДиадокСсылка, НастройкаОрганизации) Экспорт 
	
	// контроль переноса существующих настроек в новые
	ПереносНаНовыеНастройкиВыполнен = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПереносНастроекОрганизацииВыполнен();
	Если ПереносНаНовыеНастройкиВыполнен <> Истина Тогда 
		СконвертироватьНастройкиИзСтарыхВНовые();
	КонецЕсли;
	
	// получение настройки
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_НастройкиОрганизацийСлужебные.ЗначениеНастройки КАК ЗначениеНастройки
	               |ИЗ
	               |	РегистрСведений.КонтурЛогистика_НастройкиОрганизацийСлужебные КАК КонтурЛогистика_НастройкиОрганизацийСлужебные
	               |ГДЕ
	               |	КонтурЛогистика_НастройкиОрганизацийСлужебные.Настройка = &Настройка
	               |	И КонтурЛогистика_НастройкиОрганизацийСлужебные.ОрганизацияДиадок = &ОрганизацияДиадок";
	
	Запрос.УстановитьПараметр("ОрганизацияДиадок", ОрганизацияДиадокСсылка);
	Запрос.УстановитьПараметр("Настройка", НастройкаОрганизации);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ЗначениеНастройки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура УстановитьНастройку(ОрганизацияДиадокСсылка, НастройкаОрганизации, УстанавливаемоеЗначение) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.КонтурЛогистика_НастройкиОрганизаций.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОрганизацияДиадок = ОрганизацияДиадокСсылка;
	МенеджерЗаписи.Настройка = НастройкаОрганизации;
	МенеджерЗаписи.ЗначениеНастройки = УстанавливаемоеЗначение;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура УстановитьСлужебнуюНастройку(ОрганизацияДиадокСсылка, НастройкаОрганизации, УстанавливаемоеЗначение) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.КонтурЛогистика_НастройкиОрганизацийСлужебные.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОрганизацияДиадок = ОрганизацияДиадокСсылка;
	МенеджерЗаписи.Настройка = НастройкаОрганизации;
	МенеджерЗаписи.ЗначениеНастройки = УстанавливаемоеЗначение;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры	

Функция ПолучитьОбщуюМинимальнуюДатуГраницыСинхронизации(Организация = Неопределено) Экспорт
	
	РежимАвторизации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РежимАвторизации");
	АвторизацияПоТокену = (РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow);
	
	ДанныеГраницы = Новый Структура;
	ДанныеГраницы.Вставить("ДатаГраницыСинхронизации", Дата(1, 1, 1, 0, 0, 0));
	ДанныеГраницы.Вставить("Организация", ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтборПоОрганизации", ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("ИспользуетсяТРН", КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяТРН"));
	Запрос.УстановитьПараметр("ИспользуетсяПутевойЛист", КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ИспользуетсяПутевойЛист());
	Запрос.УстановитьПараметр("АвторизацияПоТокену", АвторизацияПоТокену);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Организация,
	|	КонтурЛогистика_ОрганизацииДиадок.УдалитьДатаГраницыСинхронизации КАК ДатаГраницыСинхронизации,
	|	ЕСТЬNULL(КонтурЛогистика_ОрганизацииДиадокНастройкиЧитатьЛентуДиадок.ЗначениеНастройки, ЛОЖЬ) КАК ЧитатьЛентуДиадок
	|ПОМЕСТИТЬ ДанныеАПИДиадокПредв
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_ОрганизацииДиадокНастройкиЧитатьЛентуДиадок
	|		ПО КонтурЛогистика_ОрганизацииДиадок.Ссылка = КонтурЛогистика_ОрганизацииДиадокНастройкиЧитатьЛентуДиадок.ОрганизацияДиадок
	|			И (КонтурЛогистика_ОрганизацииДиадокНастройкиЧитатьЛентуДиадок.Настройка = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуДиадок))
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадок.Наш
	|	И НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И (НЕ &ОтборПоОрганизации
	|			ИЛИ &ОтборПоОрганизации
	|				И КонтурЛогистика_ОрганизацииДиадок.Ссылка = &Организация)
	|	И ЕСТЬNULL(КонтурЛогистика_ОрганизацииДиадокНастройкиЧитатьЛентуДиадок.ЗначениеНастройки, ЛОЖЬ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеАПИДиадокПредв.Организация КАК Организация,
	|	КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки КАК ДатаГраницыСинхронизации
	|ПОМЕСТИТЬ ДанныеАПИДиадок
	|ИЗ
	|	ДанныеАПИДиадокПредв КАК ДанныеАПИДиадокПредв
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_НастройкиОрганизаций
	|		ПО ДанныеАПИДиадокПредв.Организация = КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок
	|			И (КонтурЛогистика_НастройкиОрганизаций.Настройка = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадокДата))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Организация,
	|	ЕСТЬNULL(КонтурЛогистика_ОрганизацииДиадокНастройкиКлючАпи.ЗначениеНастройки, """") КАК КлючАпи,
	|	ЕСТЬNULL(КонтурЛогистика_ОрганизацииДиадокНастройкиЧитатьЛентуЛогистики.ЗначениеНастройки, ЛОЖЬ) КАК ЧитатьЛентуЛогистики,
	|	КонтурЛогистика_ОрганизацииДиадок.Грузоотправитель
	|		ИЛИ КонтурЛогистика_ОрганизацииДиадок.Перевозчик
	|		ИЛИ КонтурЛогистика_ОрганизацииДиадок.Грузополучатель КАК ЕстьРольТрН,
	|	КонтурЛогистика_ОрганизацииДиадок.Оформитель
	|		ИЛИ КонтурЛогистика_ОрганизацииДиадок.Медик
	|		ИЛИ КонтурЛогистика_ОрганизацииДиадок.ТехОсмотр
	|		ИЛИ КонтурЛогистика_ОрганизацииДиадок.Одометр КАК ЕстьРольПЛ
	|ПОМЕСТИТЬ ДанныеАПИЛогистикиПредв
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_ОрганизацииДиадокНастройкиКлючАпи
	|		ПО КонтурЛогистика_ОрганизацииДиадок.Ссылка = КонтурЛогистика_ОрганизацииДиадокНастройкиКлючАпи.ОрганизацияДиадок
	|			И (КонтурЛогистика_ОрганизацииДиадокНастройкиКлючАпи.Настройка = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_ОрганизацииДиадокНастройкиЧитатьЛентуЛогистики
	|		ПО КонтурЛогистика_ОрганизацииДиадок.Ссылка = КонтурЛогистика_ОрганизацииДиадокНастройкиЧитатьЛентуЛогистики.ОрганизацияДиадок
	|			И (КонтурЛогистика_ОрганизацииДиадокНастройкиЧитатьЛентуЛогистики.Настройка = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуЛогистики))
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадок.Наш
	|	И НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И (НЕ &ОтборПоОрганизации
	|			ИЛИ &ОтборПоОрганизации
	|				И КонтурЛогистика_ОрганизацииДиадок.Ссылка = &Организация)
	|	И (&АвторизацияПоТокену
	|			ИЛИ НЕ &АвторизацияПоТокену
	|				И ЕСТЬNULL(КонтурЛогистика_ОрганизацииДиадокНастройкиКлючАпи.ЗначениеНастройки, """") <> """")
	|	И ЕСТЬNULL(КонтурЛогистика_ОрганизацииДиадокНастройкиЧитатьЛентуЛогистики.ЗначениеНастройки, ЛОЖЬ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеАПИЛогистикиПредв.Организация КАК Организация,
	|	ДанныеАПИЛогистикиПредв.КлючАпи КАК КлючАпи,
	|	КонтурЛогистика_ОрганизацииДиадокНастройкиАктуальностьЛенты.ЗначениеНастройки КАК ДатаГраницыСинхронизации,
	|	ДанныеАПИЛогистикиПредв.ЧитатьЛентуЛогистики КАК ЧитатьЛентуЛогистики
	|ПОМЕСТИТЬ ДанныеАПИЛогистики
	|ИЗ
	|	ДанныеАПИЛогистикиПредв КАК ДанныеАПИЛогистикиПредв
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_ОрганизацииДиадокНастройкиАктуальностьЛенты
	|		ПО ДанныеАПИЛогистикиПредв.Организация = КонтурЛогистика_ОрганизацииДиадокНастройкиАктуальностьЛенты.ОрганизацияДиадок
	|			И (КонтурЛогистика_ОрганизацииДиадокНастройкиАктуальностьЛенты.Настройка = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДата))
	|ГДЕ
	|	&ИспользуетсяТРН
	|	И ДанныеАПИЛогистикиПредв.ЕстьРольТрН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеАПИЛогистикиПредв.Организация,
	|	ДанныеАПИЛогистикиПредв.КлючАпи,
	|	КонтурЛогистика_ОрганизацииДиадокНастройкиАктуальностьЛентыПЛ.ЗначениеНастройки,
	|	ДанныеАПИЛогистикиПредв.ЧитатьЛентуЛогистики
	|ИЗ
	|	ДанныеАПИЛогистикиПредв КАК ДанныеАПИЛогистикиПредв
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_ОрганизацииДиадокНастройкиАктуальностьЛентыПЛ
	|		ПО ДанныеАПИЛогистикиПредв.Организация = КонтурЛогистика_ОрганизацииДиадокНастройкиАктуальностьЛентыПЛ.ОрганизацияДиадок
	|			И (КонтурЛогистика_ОрганизацииДиадокНастройкиАктуальностьЛентыПЛ.Настройка = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДатаПЛ))
	|ГДЕ
	|	&ИспользуетсяПутевойЛист
	|	И ДанныеАПИЛогистикиПредв.ЕстьРольПЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеАПИДиадок.Организация КАК Организация,
	|	ДанныеАПИДиадок.ДатаГраницыСинхронизации КАК ДатаГраницыСинхронизации
	|ПОМЕСТИТЬ ИтогоДаты
	|ИЗ
	|	ДанныеАПИДиадок КАК ДанныеАПИДиадок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеАПИЛогистики.Организация,
	|	ДанныеАПИЛогистики.ДатаГраницыСинхронизации
	|ИЗ
	|	ДанныеАПИЛогистики КАК ДанныеАПИЛогистики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИтогоДаты.Организация КАК Организация,
	|	ИтогоДаты.ДатаГраницыСинхронизации КАК ДатаГраницыСинхронизации
	|ИЗ
	|	ИтогоДаты КАК ИтогоДаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаГраницыСинхронизации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеГраницы, Выборка);
	КонецЕсли;
	
	Возврат ДанныеГраницы;
	
КонецФункции

#Область НастройкиОрганизацийРеквизитыОрганизации

Функция СинхронизироватьНастройкиОрганизации(ОрганизацияСсылка) Экспорт
	
	Результат = Новый Структура;
	
	Попытка
		
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(ОрганизацияСсылка);
		Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
				"Не удалось получить настройку автоприглашения из сервиса Логистика. Нет авторизации в сервисе Логистика.");
			Возврат Результат;
		КонецЕсли;
		
		ОрганизацияОбъект = ОрганизацияСсылка.ПолучитьОбъект();
		
		// Заполним свойство Sociability, регулирующее прием документов от контрагентов
		Ответ = КонтурЛогистика_API_Диадок.Диадок_АПИ_GetOrganization(ОрганизацияСсылка);
		Если Ответ.Свойство("Sociability") Тогда
			ОрганизацияОбъект.Sociability = Ответ.Sociability;
			Результат.Вставить("Sociability", Ответ.Sociability);
		КонецЕсли;
		
		
		// Получим свойство автодружбы из Логистики
		МассивДанныхЛогистика = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.ПолучитьРеквизитыОрганизации(ОрганизацияСсылка);
		Если МассивДанныхЛогистика <> Неопределено И МассивДанныхЛогистика.Количество() > 0 Тогда
			
			ДанныеОрганизации = МассивДанныхЛогистика[0];
			
			Если ДанныеОрганизации.Получить("autoRelationMode") <> Неопределено Тогда
				АвтоДружба = ?(ДанныеОрганизации["autoRelationMode"] = "enabled", Истина, Ложь);
				ОрганизацияОбъект.Автодружба = АвтоДружба;
				Результат.Вставить("Автодружба", АвтоДружба);
			КонецЕсли;
			
		КонецЕсли;
		
		ОрганизацияОбъект.Записать();
		
	Исключение
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
			"Ошибки при получение настроек Контрагентов: " + ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
Конецфункции

#КонецОбласти

#КонецОбласти

Функция ПолучитьДоступныйФункционал(Организация) Экспорт
	
	ИспользуетсяТРН	= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяТРН");
		
	ДоступныйФункционал = Новый Структура;
	ДоступныйФункционал.Вставить("ТрН", ИспользуетсяТРН И ЕстьРольТрН(Организация));
	ДоступныйФункционал.Вставить("ПЛ", 	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ИспользуетсяПутевойЛист() И ЕстьРольПЛ(Организация));
	
	Возврат ДоступныйФункционал;
	
КонецФункции

Функция ЕстьРольТрН(Организация) Экспорт
	
	Возврат Организация.Грузоотправитель Или Организация.Перевозчик Или Организация.Грузополучатель;
	
КонецФункции

Функция ЕстьРольПЛ(Организация) Экспорт
	
	Возврат Организация.Оформитель Или Организация.Медик Или Организация.ТехОсмотр Или Организация.Одометр;
	
КонецФункции

Функция НайтиСоздатьПоИдентификаторуЭДО(ИдентификаторУчастникаЭДО) Экспорт
	
	НайденныйЭлемент = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиПоРеквизиту("ИдентификаторУчастникаЭДО", ИдентификаторУчастникаЭДО);
	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда 
		Возврат НайденныйЭлемент;
	Иначе
		
		НоваяОрга = СоздатьЭлемент();
		НоваяОрга.ИдентификаторУчастникаЭДО = ИдентификаторУчастникаЭДО;
		НоваяОрга.Наименование = "Организация " + ИдентификаторУчастникаЭДО;
		НоваяОрга.Записать();
		
		ВспомМассив = Новый Массив;
		ВспомМассив.Добавить(НоваяОрга.Ссылка);
		
		Попытка
		
			Справочники.КонтурЛогистика_ОрганизацииДиадок.АктуализироватьИзДиадока(ВспомМассив);
		
		Исключение
		   КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения("Не удалось синхронизировать организацию Диадок с идентификатором " + ИдентификаторУчастникаЭДО + " Требуется опознать организацию");
		КонецПопытки;
		
		Возврат НоваяОрга.Ссылка;
		
	КонецЕсли;
	
	
КонецФункции

// ищем по всем комбинациям ИНН/КПП/ОГРН
Функция НайтиОрганизациюПоКлючевымРеквизитам(ИНН = Неопределено, КПП = Неопределено, ОГРН = Неопределено, ИдентификаторУчастникаЭДО = Неопределено) Экспорт
	
	ОрганизацияДиадок = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ИНН) Или ЗначениеЗаполнено(ОГРН) Тогда
		
		Если ЗначениеЗаполнено(ИНН) И ЗначениеЗаполнено(ИдентификаторУчастникаЭДО) Тогда
			
			НайденнаяОрганизацияИдЭДО = НайтиОрганизациюПоИННИдентификаторуЭДО(ИНН, ИдентификаторУчастникаЭДО);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденнаяОрганизацияИдЭДО) Тогда
			
			ОрганизацияДиадок = НайденнаяОрганизацияИдЭДО;
			
		Иначе
			
			НайденнаяОрганизацияИНН_КПП = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
			Если ЗначениеЗаполнено(ИНН) И ЗначениеЗаполнено(КПП) Тогда
				
				НайденнаяОрганизацияИНН_КПП = НайтиОрганизациюПоИННКПП(СокрЛП(ИНН), СокрЛП(КПП));
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НайденнаяОрганизацияИНН_КПП) Тогда
				
				ОрганизацияДиадок = НайденнаяОрганизацияИНН_КПП;
				
			Иначе
				
				НайденнаяОрганизацияИНН = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
				Если ЗначениеЗаполнено(ИНН) Тогда 
					НайденнаяОрганизацияИНН = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиПоРеквизиту("ИНН", СокрЛП(ИНН));
				КонецЕсли;
				
				Если  ЗначениеЗаполнено(НайденнаяОрганизацияИНН) Тогда
					
					ОрганизацияДиадок = НайденнаяОрганизацияИНН;
					
				Иначе
					
					// последняя попытка - по ОГРН // в старом формате ПЛ 2023 может не прийти ИНН
					НайденнаяОрганизацияОГРН = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
					Если ЗначениеЗаполнено(ОГРН) И Не ЗначениеЗаполнено(ИНН) Тогда
						НайденнаяОрганизацияОГРН = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиПоРеквизиту("ОГРН", СокрЛП(ОГРН));
					КонецЕсли;
						
					Если ЗначениеЗаполнено(НайденнаяОрганизацияОГРН) Тогда
						ОрганизацияДиадок = НайденнаяОрганизацияОГРН;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОрганизацияДиадок;

КонецФункции

Функция НайтиОрганизациюПоИННКПП(ИНН, КПП)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И КонтурЛогистика_ОрганизацииДиадок.ИНН = &ИНН
	|	И КонтурЛогистика_ОрганизацииДиадок.КПП = &КПП";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
	
КонецФункции

Функция НайтиОрганизациюПоИННИдентификаторуЭДО(ИНН, ИдентификаторУчастникаЭДО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|ГДЕ
		|	КонтурЛогистика_ОрганизацииДиадок.ИНН = &ИНН
		|	И КонтурЛогистика_ОрганизацииДиадок.ИдентификаторУчастникаЭДО = &ИдентификаторУчастникаЭДО";
	
	Запрос.УстановитьПараметр("ИдентификаторУчастникаЭДО", ИдентификаторУчастникаЭДО);
	Запрос.УстановитьПараметр("ИНН", СокрЛП(ИНН));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЕсли;
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
	
КонецФункции

Функция СписокОрганизацийПоИНН(ИНН) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|ГДЕ
		|	Не КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
		|	И КонтурЛогистика_ОрганизацииДиадок.Наш
		|	И КонтурЛогистика_ОрганизацииДиадок.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
		
	тз = Запрос.Выполнить().Выгрузить();
	
	Если тз.Количество() = 0 Тогда
		
		МассивОрганизаций = Новый Массив;
		
	Иначе
			
		МассивОрганизаций = тз.ВыгрузитьКолонку("Ссылка");
		
	КонецЕсли;
	
	Возврат МассивОрганизаций;	
	
КонецФункции

Функция ЗаполнитьОрганизациюИзДанныхЛогистики(ДанныеОрганизации, ОрганизацияКЗаполнению) Экспорт
	
	ОрганизацияОбъект = ОрганизацияКЗаполнению.ПолучитьОбъект();
	
	Если ДанныеОрганизации.Получить("autoRelationMode") <> Неопределено Тогда
		ОрганизацияОбъект.Автодружба = ?(ДанныеОрганизации["autoRelationMode"] = "enabled", Истина, Ложь);
	КонецЕсли;
	
	ОрганизацияОбъект.Записать();
	
КонецФункции

&НаСервере
Процедура НайтиИЗаполнитьСвязныеОрганизацииДляОрганизацииДиадок(МассивОрганизацийДД) Экспорт

	ТаблицаСоответствий = КонтурЛогистика_ОбщегоНазначенияСервер.СоответствиеОрганизацииУСОрганизациямДД(МассивОрганизацийДД);
	
	Если Не ТаблицаСоответствий = Неопределено Тогда 
		
		Для Каждого ОрганизацияДД Из МассивОрганизацийДД Цикл 
			
			ОбновитьСвязныеОбъектыПоОрганизации(ОрганизацияДД, ТаблицаСоответствий);
			
		КонецЦикла;	
		
	КонецЕсли;

КонецПроцедуры

// Загружать документ по фильтру инфо полей
//
// Параметры:
//  Организация - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок	 - организация по которой применяется фильтр.
//  ИнфоПоля 	- Соответствие	 - данные инфо полей в соответствий, где ключ - имя поля, значение - значение инфо поля.
// 
// Возвращаемое значение:
//  Булево - признак, что требуется загрузить документ.
//
Функция ЗагружатьДокументПоФильтруИнфоПолей(Организация, ИнфоПоля) Экспорт
	
	// Если нет фильтра, то ничего не делаем
	Если Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьФильтрПоИнфоПолям(Организация) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Нет инфо полей = загружать, если уставновлен признак
	Если ИнфоПоля.Количество() = 0 И Организация.ФильтрПоИнфоПолямЗагружатьБезКлючей Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Организация.ФильтрПоИнфоПолямКодом Тогда
		
		// Попытаемся перегнать соответствия в структуру, так как в ПовтИсп можно использовать только примитивные типы
		Попытка
			ИнфоПоляСтруктура = Новый Структура;
			Для Каждого ТекущийЭлемент Из ИнфоПоля Цикл
				ИнфоПоляСтруктура.Вставить(ТекущийЭлемент.Ключ, ТекущийЭлемент.Значение);
			КонецЦикла;
		Исключение
			ИнфоПоляСтруктура = Новый Структура;
		КонецПопытки;
		
		// Вычислим условие
		Если ИнфоПоляСтруктура.Количество() = 0 Тогда
			// Так как не все значения можно перегнать в структуру, то оставляем соответствие
			Возврат ЗагружатьДокументПоФильтруВыраженияВычисления(Организация, ИнфоПоля);
		Иначе
			Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗагружатьДокументПоФильтруВыраженияВычисления(Организация, ИнфоПоляСтруктура);
		КонецЕсли;
		
	Иначе
		
		// Вычислим по таблице ФильтрПоИнфоПолям
		ОжидаемыеЗначенияИнфоПолей = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьОжидаемыеЗначенияИнфоПолей(Организация);
		
		Для Каждого ТекущееОжидаемоеИнфоПоле Из ОжидаемыеЗначенияИнфоПолей Цикл
			
			ЗначениеВходногоИнфоПоля = ИнфоПоля.Получить(ТекущееОжидаемоеИнфоПоле.Ключ);
			Если ЗначениеВходногоИнфоПоля = Неопределено Тогда
				// Не нашли во входящих. Должны сработать все условия
				Возврат Ложь;
			КонецЕсли;
			
			Если ЗначениеВходногоИнфоПоля = ТекущееОжидаемоеИнфоПоле.Значение Тогда
				Продолжить;
			Иначе
				// Не совпало. Должны сработать все условия
				Возврат Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		// Все условия по фильтру выполнены
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

// Есть фильтр по инфо полям
//
// Параметры:
//  Организация	 - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок	 - органиазция
// 
// Возвращаемое значение:
//  Булево - признак наличия фильтра
//
Функция ЕстьФильтрПоИнфоПолям(Организация) Экспорт
	
	Если Организация.ФильтрПоИнфоПолямКодом И ЗначениеЗаполнено(Организация.ФильтрПоИнфоПолямВыражениеВычисления) Тогда
		Возврат Истина;
	ИначеЕсли Не Организация.ФильтрПоИнфоПолямКодом И Организация.ФильтрПоИнфоПолям.Количество() <> 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Получить ожидаемые значения инфо полей
//
// Параметры:
//  Организация	 - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок	 - органиазция
// 
// Возвращаемое значение:
//  Соответствие - значения инфо полей, которые мы ожидаем
//
Функция ПолучитьОжидаемыеЗначенияИнфоПолей(Организация) Экспорт
	
	ПолучитьОжидаемыеЗначенияИнфоПолей = Новый Соответствие;
	
	Для Каждого ТекущаяСтрока Из Организация.ФильтрПоИнфоПолям Цикл
		
		Если ТекущаяСтрока.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение Тогда
			
			Если Найти(ТекущаяСтрока.ВыражениеВычисленияСтрокаНеогр, "РезультатВычисления") Тогда
				РезультатВычисления = Неопределено;
				Выполнить(ТекущаяСтрока.ВыражениеВычисленияСтрокаНеогр);
				ОжидаемоеЗначениеИнфоПоля = РезультатВычисления;
			Иначе
				ОжидаемоеЗначениеИнфоПоля = Вычислить(ТекущаяСтрока.ВыражениеВычисленияСтрокаНеогр);
			КонецЕсли;
			
		ИначеЕсли ТекущаяСтрока.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ЗначениеОбщейНастройки Тогда
			
			ОжидаемоеЗначениеИнфоПоля = ТекущаяСтрока.ВыражениеВычисления.Значение;
			
		ИначеЕсли ТекущаяСтрока.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ФиксированноеЗначение Тогда
			
			ОжидаемоеЗначениеИнфоПоля = ТекущаяСтрока.ВыражениеВычисления;
			
		Иначе
			// Не доступный метод, не учитываем
			Продолжить;
		КонецЕсли;
		
		ПолучитьОжидаемыеЗначенияИнфоПолей.Вставить(ТекущаяСтрока.Ключ, Строка(ОжидаемоеЗначениеИнфоПоля));
		
	КонецЦикла;
	
	Возврат ПолучитьОжидаемыеЗначенияИнфоПолей;
	
КонецФункции

// Загружать дкумент по фильтру выражения вычисления
//
// Параметры:
//  Организация	 - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок	 - органиазция
//  ИнфоПоля	 - Соответствие, Структура	 - ключ - имя инфо коля, значение - значение инфо поля
// 
// Возвращаемое значение:
//  Булево - признак загружать дкумент по фильтру
//
Функция ЗагружатьДокументПоФильтруВыраженияВычисления(Организация, ИнфоПоля) Экспорт
	
	Если Найти(Организация.ФильтрПоИнфоПолямВыражениеВычисления, "РезультатВычисления") Тогда
		РезультатВычисления = Ложь;
		Выполнить(Организация.ФильтрПоИнфоПолямВыражениеВычисления);
		Возврат РезультатВычисления;
	Иначе
		Возврат Вычислить(Организация.ФильтрПоИнфоПолямВыражениеВычисления);
	КонецЕсли;
	
КонецФункции

Функция ИННИРолиНашихОрганизаций() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.ИНН КАК ИНН,
	|	МАКСИМУМ(КонтурЛогистика_ОрганизацииДиадок.Грузоотправитель) КАК Грузоотправитель,
	|	МАКСИМУМ(КонтурЛогистика_ОрганизацииДиадок.Перевозчик) КАК Перевозчик,
	|	МАКСИМУМ(КонтурЛогистика_ОрганизацииДиадок.Грузополучатель) КАК Грузополучатель,
	|	МАКСИМУМ(КонтурЛогистика_ОрганизацииДиадок.Медик) КАК Медик,
	|	МАКСИМУМ(КонтурЛогистика_ОрганизацииДиадок.ТехОсмотр) КАК ТехОсмотр
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И КонтурЛогистика_ОрганизацииДиадок.Наш
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ОрганизацииДиадок.ИНН";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимОграниченияДоступаПоОрганизации")
		И ПараметрыСеанса.КонтурЛогистика_ОграничениеДоступаНаУровнеЗаписейВключено Тогда
		
		Параметры.Отбор.Вставить("Ссылка", ПараметрыСеанса.КонтурЛогистика_ДоступныеОрганизации);
	КонецЕсли;
	
КонецПроцедуры
