#Область СлужебныйПрограммныйИнтерфейс
// Это модуль-инициализатор. Здесь не нужно писать обработчики.
// Пишите обработчики в обработке КонтурЗакупки_ПодключаемыйМодуль 

// Возвращает инициализированный подключаемый модуль (обработку)
// обработка может быть внешняя или из метаданных конфигурации в зависимости от общей настройки "ПодключаемыйМодульТип (вариант подключения)"
// - Файл на диске
// - В составе конфигурации
// 
// Возвращаемое значение:
//  ОбработкаОбъект.КонтурЗакупки_ПодключаемыйМодуль, Неопределено, ВнешняяОбработка - 
Функция ПодключаемыйМодуль() Экспорт

	ВнешнийМодуль = Неопределено;
	ПодключаемыйМодульТип = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ПодключаемыйМодульТип",
		Перечисления.КонтурЗакупки_ТипыПМ.Отключен);

	Если ПодключаемыйМодульТип = Перечисления.КонтурЗакупки_ТипыПМ.Отключен Тогда

		Возврат Неопределено;

	КонецЕсли;

	Если ПодключаемыйМодульТип = Перечисления.КонтурЗакупки_ТипыПМ.ВСоставеКонфигурации Тогда
		Попытка
			ВнешнийМодуль = Обработки.КонтурЗакупки_ПодключаемыйМодуль.Создать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось подключить внешний модуль из конфигурации -" + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;

	Иначе

		ИмяФайла = ПолучитьПутьКФайлуПодключаемогоМодуля(ПодключаемыйМодульТип);

		Если ИмяФайла = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось подключить внешний модуль!";
			Сообщение.Сообщить();
		Иначе
			Попытка

				ОбъектОписанияЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
				ОбъектОписанияЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
				ВнешнийМодуль = ВнешниеОбработки.Создать(ИмяФайла, Ложь, ОбъектОписанияЗащиты);

			Исключение

				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось подключить внешний модуль из файла или справочника внешних обработок - "
					+ ОписаниеОшибки();
				Сообщение.Сообщить();

			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

	Возврат ВнешнийМодуль;
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// только если он хранится на диске, либо во внешних обработках
// 
// Параметры:
//  ПодключаемыйМодульТип - ПеречислениеСсылка.КонтурЗакупки_ТипыПМ - Тип подкючаемого модуля
// 
// Возвращаемое значение:
//  Неопределено, Строка - Получить путь к файлу подключаемого модуля
Функция ПолучитьПутьКФайлуПодключаемогоМодуля(ПодключаемыйМодульТип)

	ПодключаемыйМодульПуть = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ПодключаемыйМодульПуть", "");
	Если ПодключаемыйМодульТип = Перечисления.КонтурЗакупки_ТипыПМ.Отключен Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПодключаемыйМодульПуть) Тогда

		Если ПодключаемыйМодульТип = Перечисления.КонтурЗакупки_ТипыПМ.ФайлНаДиске Тогда

			Возврат ПодключаемыйМодульПуть;

		ИначеЕсли ПодключаемыйМодульТип = Перечисления.КонтурЗакупки_ТипыПМ.ВСправочнике Тогда

			Попытка

				Модуль = ПодключаемыйМодульПуть;

				Если ЗначениеЗаполнено(Модуль) Тогда
					МетаданныеСправочника = Модуль.Метаданные();
					ИмяРеквизита = "";
					ИмяТиповогоРеквизита = "";
					Если Метаданные.ОсновнойРежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
						ИмяТиповогоРеквизита= "ХранилищеОбработки";    //типовое название реквизита
					КонецЕсли;

					Если ИмяРеквизита = "" Тогда //вдруг его переименуют
						ИмяРеквизита = "";
						Для Каждого Реквизит Из МетаданныеСправочника.Реквизиты Цикл
							Если Реквизит.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
								ИмяРеквизита = Реквизит.Имя;
								//будем брать последний реквизит такого типа т.к. это более вероятно, если найдем наш - гуд
								Если ИмяТиповогоРеквизита = Реквизит.Имя Тогда
									Прервать;  //найден ожидаемый реквизит нужного типа
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;

					Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
						МодульОбъект = Модуль.ПолучитьОбъект();
						ИмяФайла = ПолучитьИмяВременногоФайла();
						ДвоичныеДанные = МодульОбъект[ИмяРеквизита].Получить();
						ДвоичныеДанные.Записать(ИмяФайла);

						Возврат ИмяФайла;
					КонецЕсли;

				КонецЕсли;

			Исключение
				СтрокаОшибки = ОписаниеОшибки();

				СтруктураДействия = КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьОписаниеДействия("PM", "Подключение ПМ",
					"ПодключениеПМ", "");
				СтруктураКлиентаДляМетрики = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьСтруктуруКлиентаДляМетрики();

				СтруктураДляОтправкиОшибки = КонтурЗакупки_МетрикиВызовСервера.ПолучитьСтруктуруОшибки(
		СтруктураДействия, СтрокаОшибки, СтруктураКлиентаДляМетрики);
				КонтурЗакупки_МетрикиВызовСервера.ОтправитьМетрику(СтруктураДляОтправкиОшибки);
//				ВызватьИсключение СтрокаОшибки;
			КонецПопытки;
		КонецЕсли;

	КонецЕсли;

	Возврат Неопределено;

КонецФункции
#КонецОбласти