
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТипДанных", ТипДанных);
	Параметры.Свойство("ОтборСтатус", ОтборСтатус);
	
	Если Не ЗначениеЗаполнено(ТипДанных) Тогда
		ТипДанных = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ГСМ;
	КонецЕсли;
	
	Набор = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";
	ТипДанныхЧитаемый = ТипДанных;
	Для Счет = 1 По СтрДлина(Набор) Цикл
		ТекущийСимвол = Сред(Набор, Счет, 1);
		ТипДанныхЧитаемый = СтрЗаменить(ТипДанныхЧитаемый, ТекущийСимвол, " " + НРег(ТекущийСимвол));
	КонецЦикла;
	Заголовок = "Произвольные данные:" + ТипДанныхЧитаемый;
	
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ТипДанных", ТипДанных, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	
	ПредставленияПолей = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ПараметрыПолейПоТипуДанных(ТипДанных);
	
	Для Каждого ТекущаяСтрока Из ПредставленияПолей Цикл
		
		НайденныйЭлемент = Элементы.Найти(ТекущаяСтрока.Ключ);
		Если НайденныйЭлемент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныйЭлемент.Заголовок = ТекущаяСтрока.Значение.Заголовок;
		
	КонецЦикла;
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "ДокументОснование", Параметры.ДокументОснование, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
	Если ОтборСтатус = "" Тогда
		ОтборСтатус = "Все";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтборы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	
	ОбновитьОтборы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПропуститьВыделенные(Команда)
	
	ПропуститьВыделенныеСервер();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьЗаписьС1С(Команда)
	
	ОбработатьСтрокуПроизвольныхДанныхРС();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьОтборы()
	
	ИспользованиеОтбораСтатус = Истина;
	ОтборСтатусЗначение = Неопределено;
	
	Если ОтборСтатус = "Все" Тогда
		ИспользованиеОтбораСтатус = Ложь;
	ИначеЕсли ОтборСтатус = "НеНачата" Тогда
		ОтборСтатусЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыСинхронизации.НеНачата");
	ИначеЕсли ОтборСтатус = "Ошибка" Тогда
		ОтборСтатусЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыСинхронизации.Ошибка");
	ИначеЕсли ОтборСтатус = "Пропустить" Тогда
		ОтборСтатусЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыСинхронизации.Пропустить");
	ИначеЕсли ОтборСтатус = "УспешноЗавершена" Тогда
		ОтборСтатусЗначение = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыСинхронизации.УспешноЗавершена");
	КонецЕсли;
	
	ГруппаИлиСтатусов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		Список.Отбор, "Статусы", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаИлиСтатусов, "СинхронизацияССервисом", ОтборСтатусЗначение, ВидСравненияКомпоновкиДанных.Равно,, ИспользованиеОтбораСтатус);
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаИлиСтатусов, "СинхронизацияСОбъектом1С", ОтборСтатусЗначение, ВидСравненияКомпоновкиДанных.Равно,, ИспользованиеОтбораСтатус);
	
КонецПроцедуры

&НаСервере
Процедура ПропуститьВыделенныеСервер()
	
	СтатусПропущен = Перечисления.КонтурЛогистика_СтатусыСинхронизации.Пропустить;
	ТекстСообщения = "Пропущен пользователем """ + Строка(ПараметрыСеанса.ТекущийПользователь) + """ в " + Строка(ТекущаяДатаСеанса());
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ОбновитьСтатусыСинхронизации(
			ВыделеннаяСтрока, СтатусПропущен, СтатусПропущен, ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуПроизвольныхДанныхРС()
	
	ТекущиеДанные = Элементы.Список.ВыделенныеСтроки[0];
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияДиадок", ТекущиеДанные.ОрганизацияДиадок);
	Запрос.УстановитьПараметр("ТипДанных", ТекущиеДанные.ТипДанных);
	Запрос.УстановитьПараметр("Разрез1", ТекущиеДанные.Разрез1);
	Запрос.УстановитьПараметр("Разрез2", ТекущиеДанные.Разрез2);
	Запрос.УстановитьПараметр("Разрез3", ТекущиеДанные.Разрез3);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПроизвольныеДанные.ОрганизацияДиадок КАК ОрганизацияДиадок,
	|	КонтурЛогистика_ПроизвольныеДанные.ТипДанных КАК ТипДанных,
	|	КонтурЛогистика_ПроизвольныеДанные.Разрез1 КАК Разрез1,
	|	КонтурЛогистика_ПроизвольныеДанные.Разрез2 КАК Разрез2,
	|	КонтурЛогистика_ПроизвольныеДанные.Разрез3 КАК Разрез3,
	|	КонтурЛогистика_ПроизвольныеДанные.Количество КАК Количество,
	|	КонтурЛогистика_ПроизвольныеДанные.Дата КАК Дата,
	|	КонтурЛогистика_ПроизвольныеДанные.Ответственный КАК Ответственный,
	|	КонтурЛогистика_ПроизвольныеДанные.Реквизит1 КАК Реквизит1
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|ГДЕ
	|	КонтурЛогистика_ПроизвольныеДанные.ОрганизацияДиадок = &ОрганизацияДиадок
	|	И КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез1 = &Разрез1
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез2 = &Разрез2
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез3 = &Разрез3";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КонтурЛогистика_КонвертацияСервер.ОбработатьСтрокуПроизвольныхДанныхРС(Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти