#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработки.ПлатежныйКалендарь.ИнициализироватьКомпоновщикНастроек(КомпоновщикОтбор, УникальныйИдентификатор,
		Параметры.НастройкиОтбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьОтбор(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("НастройкиОтбора", ПолучитьНастройкиОтбора());
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаУстановки(Команда)
	
	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьНастройкиОтбора()
	
	Возврат КомпоновщикОтбор.ПолучитьНастройки();
	
КонецФункции

#КонецОбласти