
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(СотрудникКонтроля) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.Предмет = &Предмет";
		Запрос.УстановитьПараметр("Предмет", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Выборка.Следующий() Тогда
			
			Наименование = СтрШаблон("Создан реестр платежей %1", Ссылка);
			АУ_ОбщиеПроцедурыИФункцииСервер.СоздатьЗадачуИсполнителю(СотрудникКонтроля, Наименование, Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
