&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

&НаКлиенте
Перем ДанныеДокументаMS Экспорт,
	РеквизитыСерий Экспорт,
	СписокДокументовТСД Экспорт,
	ТаблицаДляПечати Экспорт,
	ТаблицаНовыхШтрихкодов Экспорт,
	ПараметрыПорционнойВыгрузки;
	
&НаКлиенте
Перем МетаданныеДокументаMS;

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии()
	
	СтруктураМетаданных = _ЛокКонтекст.СтруктураМетаданных;
	МетаданныеДокументаMS = СтруктураМетаданных.ДокументыMS[ТипДокументаMS];
	
	ДанныеДокументаMS = _ЛокКонтекст.ЛокЯдро_ПолучитьДанныеДокументаMS(Ид, ТипДокументаMS);
	ПараметрыПорционнойВыгрузки = _ЛокКонтекст.ЛокЯдро_ПолучитьПараметрыСправочниковДляПорционнойВыгрузки();
	
	СоздатьТаблицуНовыхШтрихкодов();
	СоздатьДополнительныеКолонкиТаблицДокумента(ДанныеДокументаMS);
	
	Заполнить_ШапкуДокумента();
	ЗаполнитьТаблицыДокумента();
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Элементы.ГруппаСтраницы.Страницы.ГруппаСерийныеНомера.Видимость = ТаблицаСерийныеНомера.Количество() > 1;
		Если СтрокиФакт.Количество() > 1 Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.Страницы.ГруппаФакт;
		КонецЕсли;
	#Иначе
		Элементы.ГруппаСерийныеНомера.Видимость = ТаблицаСерийныеНомера.Количество() > 1;
		Если СтрокиФакт.Количество() > 1 Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаФакт;
		КонецЕсли;
	#КонецЕсли
	ВывестиДопТаблицы();
	
	Для Каждого СтрокаТЧ Из СтрокиФакт Цикл
		СтрокаТЧ.Флаг = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФорм

&НаКлиенте
Процедура ПанельФормыПросмотретьШапку(Кнопка)
	
	ПоказатьДанныеДокументаMS("Шапка документа Клеверенс", ДанныеДокументаMS.ШапкаДокумента)	
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПросмотретьНовыеТоварыИШтрихКодыНажатие(Элемент)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСлужебная_ЗагрузкаНовыхШтрихкодов = ПолучитьФорму("ОФ_ФормаСлужебная_ЗагрузкаНовыхШтрихкодов",ЭтаФорма);
	#Иначе
		ФормаСлужебная_ЗагрузкаНовыхШтрихкодов = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСлужебная_ЗагрузкаНовыхШтрихкодов", , ЭтаФорма, ЭтаФорма);
		ФормаСлужебная_ЗагрузкаНовыхШтрихкодов.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	#КонецЕсли
	
	ФормаСлужебная_ЗагрузкаНовыхШтрихкодов.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаСлужебная_ЗагрузкаНовыхШтрихкодов._ЛокКонтекст = _ЛокКонтекст;
	
	ОП = Новый ОписаниеОповещения("ЗагрузкаНовыхШтрихкодовЗакрытие", ЭтаФорма);
	ФормаСлужебная_ЗагрузкаНовыхШтрихкодов.ОписаниеОповещенияОЗакрытии = ОП;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСлужебная_ЗагрузкаНовыхШтрихкодов.ОткрытьМодально();
	#Иначе
		ФормаСлужебная_ЗагрузкаНовыхШтрихкодов.Открыть();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиПланВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТекДанные = ВыбраннаяСтрока;
	#Иначе
		ТекДанные = СтрокиПлан.НайтиПоИдентификатору(ВыбраннаяСтрока);
	#КонецЕсли
	ПоказатьДанныеДокументаMS("Строка-план документа Клеверенс", _ЛокКонтекст.ЛокЯдро_НайтиСтруктуруВМассивеПоЭлементу(ДанныеДокументаMS.СтрокиПлан,"КлючСвязиСтроки",ТекДанные.КлючСвязиСтроки));	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиФактВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТекДанные = ВыбраннаяСтрока;
	#Иначе
		ТекДанные = СтрокиФакт.НайтиПоИдентификатору(ВыбраннаяСтрока);
	#КонецЕсли
	ПоказатьДанныеДокументаMS("Строка-факт документа Клеверенс", _ЛокКонтекст.ЛокЯдро_НайтиСтруктуруВМассивеПоЭлементу(ДанныеДокументаMS.СтрокиФакт,"КлючСвязиСтроки",ТекДанные.КлючСвязиСтроки));	
КонецПроцедуры

&НаКлиенте
Процедура СовмещенныеСтрокиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТекДанные = ВыбраннаяСтрока;
	#Иначе
		ТекДанные = СовмещенныеСтроки.НайтиПоИдентификатору(ВыбраннаяСтрока);
	#КонецЕсли
	ПоказатьДанныеДокументаMS("Совмещенная строка документа Клеверенс", _ЛокКонтекст.ЛокЯдро_НайтиСтруктуруВМассивеПоЭлементу(ДанныеДокументаMS.СовмещенныеСтроки,"КлючСвязиСтроки",ТекДанные.КлючСвязиСтроки));	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСерийныеНомераВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТекДанные = ВыбраннаяСтрока;
	#Иначе
		ТекДанные = ТаблицаСерийныеНомера.НайтиПоИдентификатору(ВыбраннаяСтрока);
	#КонецЕсли
	ПоказатьДанныеДокументаMS("Строка-план документа Клеверенс", _ЛокКонтекст.ЛокЯдро_НайтиСтруктуруВМассивеПоЭлементу(ДанныеДокументаMS.СтрокиСерийныеНомера,"КлючСвязиСтроки",ТекДанные.КлючСвязиСтроки));
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМеханизмы

&НаКлиенте
Процедура ОбновитДанныеПослеПривязкиШК()
	
	ОбновитьДанныеПослеПривязкиШКвТаблице(СтрокиПлан);
	ОбновитьДанныеПослеПривязкиШКвТаблице(СтрокиФакт);
	ОбновитьДанныеПослеПривязкиШКвТаблице(СовмещенныеСтроки);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПослеПривязкиШКвТаблице(Таблица)
		
	Для Каждого СтрокаТаблицы Из Таблица Цикл	
		
		Если СтрокаТаблицы.ИдТовара <> "*" И Лев(ВРег(СтрокаТаблицы.ИдУпаковки), 3) <> "NEW" Тогда
			Продолжить;	
		КонецЕсли;
		
		ДанныеШК = _ЛокКонтекст.ЛокЯдро_ПолучитьДанныеШтрихКода(СтрокаТаблицы.ШК);
		
		Если Не ЗначениеЗаполнено(ДанныеШК) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ДанныеШК.Свойство("Владелец") 
			И ДанныеШК.Владелец <> Неопределено Тогда
			СтрокаТаблицы.Номенклатура = ДанныеШК.Владелец;
			СтрокаТаблицы.ИдТовара = Строка(ДанныеШК.Владелец.УникальныйИдентификатор());	
		КонецЕсли;
		
		Если ДанныеШК.Свойство("ЕдиницаИзмерения")
			И ДанныеШК.ЕдиницаИзмерения <> Неопределено Тогда
			СтрокаТаблицы.ИдУпаковки = ДанныеШК.ЕдиницаИзмерения.Наименование;	
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Заполнить_ШапкуДокумента()
	
	Если ДанныеДокументаMS = Неопределено Тогда
		ВызватьИсключение("Не удалось получить данные документа.
		|Проверьте подключение к базе Клеверенс.");
	КонецЕсли;
	
	Для Каждого РеквизитШапки Из ДанныеДокументаMS.ШапкаДокумента Цикл
		Если Элементы.Найти(РеквизитШапки.Ключ) <> Неопределено Тогда
			ЭтаФорма[РеквизитШапки.Ключ] = РеквизитШапки.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Состояние_Завершен 		= ?(ДанныеДокументаMS.ШапкаДокумента.Свойство("Завершен"), ДанныеДокументаMS.ШапкаДокумента.Завершен, Ложь);
	Состояние_ВОбработке 	= ?(ДанныеДокументаMS.ШапкаДокумента.Свойство("ВОбработке"), ДанныеДокументаMS.ШапкаДокумента.ВОбработке, Ложь);
	
	Если Состояние_Завершен Тогда
		Состояние = "Завершен";	
	ИначеЕсли Состояние_ВОбработке Тогда
		Состояние = "В работе";
	Иначе
		Состояние = "Выгружен";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицыДокумента()
	
	МетаданныеНСИ = _ЛокКонтекст.ЛокЯдро_ПолучитьМетаданныеНСИ();
	
	Если МетаданныеНСИ = Неопределено Тогда
		ВызватьИсключение("Не удалось получить метаданные конфигурации.
		|Проверьте подключение интеграционной обработки.");
	КонецЕсли;
	
	НоменклатураИменаСправочников = Новый Массив;
	НоменклатураИменаСправочников.Добавить(МетаданныеНСИ.Номенклатура.ИмяСправочника);
	Если ПараметрыПорционнойВыгрузки <> Неопределено Тогда
		ПараметрыНоменклатуры = ПараметрыПорционнойВыгрузки.Получить("Номенклатура");
		Если ПараметрыНоменклатуры <> Неопределено Тогда
			НоменклатураИменаСправочников = ПараметрыНоменклатуры.ИменаСправочников;
		КонецЕсли;
	КонецЕсли;
	
	ИмяСправочникаЕИ = МетаданныеНСИ.ЕдиницыИзмерения.ИмяСправочника;
	
	Если МетаданныеНСИ.Номенклатура.Свойство("БазоваяЕдиницаИзмерения") Тогда
		МассивЕИ = Новый Массив;
		МассивЕИ.Добавить(ИмяСправочникаЕИ);
		МассивЕИ.Добавить(МетаданныеНСИ.Номенклатура.БазоваяЕдиницаИзмерения.ИмяСправочника);
		ИмяСправочникаЕИ = МассивЕИ;
	КонецЕсли;	
	
	_ЛокКонтекст.КэшЗначенийПолученныхПоID = Новый Соответствие;
	
	////////////////////////////////////////////////////////////////////////////////
	//СтрокиПлан
	Для Каждого СтрокаДокумента Из ДанныеДокументаMS.СтрокиПлан Цикл
		Если СтрокаДокумента.Свойство("ЭтоТаблицаЗначений") Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьСтрокуТаблицыДокумента(СтрокаДокумента, МетаданныеНСИ, ИмяСправочникаЕИ, НоменклатураИменаСправочников);
		ЗаполнитьЗначенияСвойств(СтрокиПлан.Добавить(), СтрокаДокумента);
	КонецЦикла;

	////////////////////////////////////////////////////////////////////////////////
	//СтрокиФакт
	Для Каждого СтрокаДокумента Из ДанныеДокументаMS.СтрокиФакт Цикл
		Если СтрокаДокумента.Свойство("ЭтоТаблицаЗначений") Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьСтрокуТаблицыДокумента(СтрокаДокумента, МетаданныеНСИ, ИмяСправочникаЕИ, НоменклатураИменаСправочников);
		ЗаполнитьЗначенияСвойств(СтрокиФакт.Добавить(), СтрокаДокумента);

		Если СтрокаДокумента.ИдТовара = "*"
				ИЛИ Лев(ВРег(СтрокаДокумента.ИдУпаковки), 3) = "NEW" Тогда
				//СтрокаШК = ТаблицаНовыхШтрихкодов.Добавить();
			СтрокаШК = Новый Структура();
			СтрокаШК.Вставить("Штрихкод", ШтрихкодТСД(СтрокаДокумента));
			СтрокаШК.Вставить("Упаковка", СтрокаДокумента.ИдУпаковки);
			СтрокаШК.Вставить("ИмяНеизвестного", СтрокаДокумента.ИмяНеизвестного);
			СтрокаШК.Вставить("Номенклатура", СтрокаДокумента.Номенклатура);
			СтрокаШК.Вставить("Упаковка", СтрокаДокумента.Упаковка);
			СтрокаШК.Вставить("Характеристика", СтрокаДокумента.Характеристика);

			ТаблицаНовыхШтрихкодов.Добавить(СтрокаШК);

		КонецЕсли;
	КонецЦикла;

	////////////////////////////////////////////////////////////////////////////////
	//СовмещенныеСтроки
	Для Каждого СтрокаДокумента Из ДанныеДокументаMS.СовмещенныеСтроки Цикл
		Если СтрокаДокумента.Свойство("ЭтоТаблицаЗначений") Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьСтрокуТаблицыДокумента(СтрокаДокумента, МетаданныеНСИ, ИмяСправочникаЕИ, НоменклатураИменаСправочников);
		ЗаполнитьЗначенияСвойств(СовмещенныеСтроки.Добавить(), СтрокаДокумента);
	КонецЦикла;	

	_ЛокКонтекст.КэшЗначенийПолученныхПоID = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтрокуТаблицыДокумента(СтрокаДокумента, МетаданныеНСИ, ИмяСправочникаЕИ, НоменклатураИменаСправочников)
	
	СтрокаДокумента.Вставить("КлючСвязиСтроки", Строка(Новый УникальныйИдентификатор()));
	
	Если СтрокаДокумента.ИдТовара <> "*" Тогда
		Попытка
			СтрокаДокумента.Вставить("Номенклатура", _ЛокКонтекст.ЛокЯдро_ПолучитьЗначениеСправочникаПоID(НоменклатураИменаСправочников, СтрокаДокумента.ИдТовара));
		Исключение
		КонецПопытки;
	Иначе
		СтрокаДокумента.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник."
		+ МетаданныеНСИ.Номенклатура.ИмяСправочника + ".ПустаяСсылка"));
	КонецЕсли;
	
	Попытка			
		Если ЗначениеЗаполнено(СтрокаДокумента.ИдЕдиницыИзмерения) И СтрДлина(СтрокаДокумента.ИдЕдиницыИзмерения) = 36 Тогда
			пУпаковка = _ЛокКонтекст.ЛокЯдро_ПолучитьЗначениеСправочникаПоID(ИмяСправочникаЕИ, СтрокаДокумента.ИдЕдиницыИзмерения);
		ИначеЕсли ТипЗнч(СтрокаДокумента.ИдУпаковки) = Тип("Строка") И СтрДлина(СтрокаДокумента.ИдУпаковки) = 36 Тогда
			пУпаковка = _ЛокКонтекст.ЛокЯдро_ПолучитьЗначениеСправочникаПоID(ИмяСправочникаЕИ, СтрокаДокумента.ИдУпаковки);				
		Иначе
			пУпаковка = ПредопределенноеЗначение("Справочник." + МетаданныеНСИ.ЕдиницыИзмерения.ИмяСправочника + ".ПустаяСсылка");
		КонецЕсли;
	Исключение
		пУпаковка = ПредопределенноеЗначение("Справочник." + МетаданныеНСИ.ЕдиницыИзмерения.ИмяСправочника + ".ПустаяСсылка");
	КонецПопытки;
	СтрокаДокумента.Вставить("Упаковка", пУпаковка);
	
	Если МетаданныеНСИ.Свойство("Характеристики") Тогда
		Если СтрокаДокумента.Свойство("ИдХарактеристики") И ЗначениеЗаполнено(СтрокаДокумента.ИдХарактеристики) Тогда
			Попытка
				СтрокаДокумента.Вставить("Характеристика", _ЛокКонтекст.ЛокЯдро_ПолучитьЗначениеСправочникаПоID(МетаданныеНСИ.Характеристики.ИмяСправочника, СтрокаДокумента.ИдХарактеристики));
			Исключение
			КонецПопытки
		Иначе
			СтрокаДокумента.Вставить("Характеристика", ПредопределенноеЗначение("Справочник."
			+ МетаданныеНСИ.Характеристики.ИмяСправочника + ".ПустаяСсылка"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДанныеДокументаMS(ДанныеЗаголовка, ДанныеДляПоказа) 
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаПросмотра_РазделДокументаMS = ПолучитьФорму("ОФ_ФормаПросмотра_РазделДокументаMS", ЭтаФорма);
	#Иначе
		ФормаПросмотра_РазделДокументаMS = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаПросмотра_РазделДокументаMS", , ЭтаФорма, ЭтаФорма);
		ФормаПросмотра_РазделДокументаMS.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	#КонецЕсли
	
	ФормаПросмотра_РазделДокументаMS.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаПросмотра_РазделДокументаMS.ДанныеЗаголовка = ДанныеЗаголовка;
	ФормаПросмотра_РазделДокументаMS.ДанныеДляПоказа = ДанныеДляПоказа;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаПросмотра_РазделДокументаMS.ОткрытьМодально();
	#Иначе
		ФормаПросмотра_РазделДокументаMS.Открыть();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТаблицуНовыхШтрихкодов()
	
	ТаблицаНовыхШтрихкодов = Новый Массив;
	ТаблицаНовыхШтрихкодов.Добавить(Новый Структура("ЭтоТаблицаЗначений,КолонкиТаблицыЗначений",Истина,"Штрихкод,Номенклатура,Характеристика,Упаковка,Записывать,ТипШтрихкода,ИмяНеизвестного"));			
	
КонецПроцедуры	

&НаКлиенте
Процедура ПечатьЦенниковНажатие(Элемент)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница 		= Элементы.ГруппаСтраницы.Страницы.ГруппаПлан Тогда
			ДанныеДляПечати = СтрокиПлан;
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница 	= Элементы.ГруппаСтраницы.Страницы.ГруппаФакт Тогда
			ДанныеДляПечати = СтрокиФакт;
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница 	= Элементы.ГруппаСтраницы.Страницы.ГруппаСовмещенные Тогда
			ДанныеДляПечати = СовмещенныеСтроки;				
		Иначе 
			Возврат;
		КонецЕсли;	
	#Иначе
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница 		= Элементы.ГруппаПлан Тогда
			ДанныеДляПечати = СтрокиПлан;
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница 	= Элементы.ГруппаФакт Тогда
			ДанныеДляПечати = СтрокиФакт;
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница 	= Элементы.ГруппаСовмещенные Тогда
			ДанныеДляПечати = СовмещенныеСтроки;				
		Иначе 
			Возврат;
		КонецЕсли;
	#КонецЕсли
	_ЛокКонтекст.ЛокЯдро_ПечатьЦенников(ДанныеДляПечати);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеНажатие(Элемент)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница 		= Элементы.ГруппаСтраницы.Страницы.ГруппаПлан Тогда
			ТекущаяТаблица = СтрокиПлан;
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница 	= Элементы.ГруппаСтраницы.Страницы.ГруппаФакт Тогда
			ТекущаяТаблица = СтрокиФакт;
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница 	= Элементы.ГруппаСтраницы.Страницы.ГруппаСовмещенные Тогда
			ТекущаяТаблица = СовмещенныеСтроки;				
		Иначе 
			Возврат;
		КонецЕсли;	
	#Иначе
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница 		= Элементы.ГруппаПлан Тогда
			ТекущаяТаблица = СтрокиПлан;
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница 	= Элементы.ГруппаФакт Тогда
			ТекущаяТаблица = СтрокиФакт;
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница 	= Элементы.ГруппаСовмещенные Тогда
			ТекущаяТаблица = СовмещенныеСтроки;				
		Иначе 
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
	Для Каждого СтрокаТЧ Из ТекущаяТаблица Цикл
		СтрокаТЧ.Флаг = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеНажатие(Элемент)

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница 		= Элементы.ГруппаСтраницы.Страницы.ГруппаПлан Тогда
			ТекущаяТаблица = СтрокиПлан;
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница 	= Элементы.ГруппаСтраницы.Страницы.ГруппаФакт Тогда
			ТекущаяТаблица = СтрокиФакт;
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница 	= Элементы.ГруппаСтраницы.Страницы.ГруппаСовмещенные Тогда
			ТекущаяТаблица = СовмещенныеСтроки;				
		Иначе 
			Возврат;
		КонецЕсли;	
	#Иначе
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница 		= Элементы.ГруппаПлан Тогда
			ТекущаяТаблица = СтрокиПлан;
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница 	= Элементы.ГруппаФакт Тогда
			ТекущаяТаблица = СтрокиФакт;
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница 	= Элементы.ГруппаСовмещенные Тогда
			ТекущаяТаблица = СовмещенныеСтроки;				
		Иначе 
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
	Для Каждого СтрокаТЧ Из ТекущаяТаблица Цикл
		СтрокаТЧ.Флаг = Ложь;	
	КонецЦикла; 	
	
КонецПроцедуры

// Возвращает значение штрихкода из строки документа ТСД
&НаКлиентеНаСервереБезКонтекста
Функция ШтрихкодТСД(СтрокаТСД) 

	Если ТипЗнч(СтрокаТСД) <> Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;
	
	ШтрихкодТСД = ?(СтрокаТСД.Свойство("НовШК"), СтрокаТСД.НовШК, "");
	
	Если ПустаяСтрока(ШтрихкодТСД) Тогда
		ШтрихкодТСД = ?(СтрокаТСД.Свойство("ОснШК"), СтрокаТСД.ОснШК, "");
	КонецЕсли;
		
	Возврат ШтрихкодТСД;
	
КонецФункции

&НаКлиенте
Процедура ВывестиДопТаблицы()
	
	//Получение значений доп таблиц
	СтруктураАдресовТаблиц = ПолучитьДопТаблицы();
	
	//Создание реквизитов и элементов формы
	СоздатьЭлементыОтображенияДопТаблиц(СтруктураАдресовТаблиц);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДопТаблицы()
	
	СтруктураМетаданных 	= _ЛокКонтекст.СтруктураМетаданных;
	СтруктураТаблицMS		= СтруктураМетаданных.Tables;
	СтруктураДокументаMS 	= СтруктураМетаданных.ДокументыMS[ТипДокументаMS];
	
	МассивИменДопТаблиц = Новый Массив;

	//Сначала проверяем наличие в документе таблиц с такими же именами, как и в таблицах Клеверенс 
	Для Каждого ТаблицаMS Из СтруктураТаблицMS Цикл
		
		ИмяТаблицыMS = ТаблицаMS.Представление;
		Если ДанныеДокументаMS.Свойство(ИмяТаблицыMS) Тогда
			МассивИменДопТаблиц.Добавить(ИмяТаблицыMS);		
		КонецЕсли;
		
	КонецЦикла;
	
	//Затем проверяем наличие доп таблиц документа
	Для каждого ДопТаблица Из СтруктураДокументаMS.ДополнительныеТаблицы Цикл
		
		ИмяДопТаблицы = ДопТаблица.Представление;
		МассивИменДопТаблиц.Добавить(ИмяДопТаблицы);
		
	КонецЦикла;
	
	СтруктураАдресовТаблиц = Новый Структура;
	
	Для каждого ИмяДопТаблицы Из МассивИменДопТаблиц Цикл
	
		МассивСтрокДопТаблицы 	= ДанныеДокументаMS[ИмяДопТаблицы];		
		
		СтруктураВызова = Новый Структура;
		СтруктураВызова.Вставить("ТипМетода", "Функция");
		СтруктураВызова.Вставить("ИмяМетода", "МассивСтруктурВТаблицуЗначений");
		СтруктураВызова.Вставить("ПараметрыМетода", Новый Структура("МассивСтруктур", МассивСтрокДопТаблицы));
		
		//Преобразование массива структур в таблицу значений
		Попытка
			АдресТаблицыВХранилище = _ЛокКонтекст.Транзит_ВызватьГлобальныйМетодНаКлиенте(СтруктураВызова, Истина);
		Исключение
			АдресТаблицыВХранилище = "";
			Сообщение = НСтр("be = 'Не ўдалося адлюстроўваць дадзеныя дадатковай табліцы'; en = 'Failed to display additional table data'; es = 'No se pudieron mostrar los datos de la tabla adicional'; ka = 'მონაცემთა დოპ ცხრილის ჩვენება ვერ მოხდა'; kk = 'Қосымша кесте деректерін көрсету мүмкін емес'; ro = 'Nu s-a putut afișa datele tabelului suplimentar'; ru = 'Не удалось отобразить данные доп таблицы'; tr = 'Ek tablo verileri görüntülenemedi'; uk = 'Не вдалося відобразити дані додаткової таблиці'; uz = 'Қўшимча жадвал маълумотларини кўрсатиш мумкин эмас'");
			Сообщить(Сообщение); 
		КонецПопытки;

		СтруктураАдресовТаблиц.Вставить(ИмяДопТаблицы, АдресТаблицыВХранилище);
				
	КонецЦикла;
	
	Возврат СтруктураАдресовТаблиц;
	
КонецФункции

&НаСервере
Процедура СоздатьЭлементыОтображенияДопТаблиц(СтруктураАдресовТаблиц)
	
	ИмяСобытия = "СоздатьЭлементыОтображенияДопТаблиц";
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		СтруктураДопТаблиц 				= Новый Структура;
		МассивРеквизитов 				= Новый Массив;
		УстановитьТекущуюСтраницуПанели = Ложь;
		
		Для Каждого ЭлементСтруктуры Из СтруктураАдресовТаблиц Цикл

			ИмяДопТаблицы = ЭлементСтруктуры.Ключ;
			АдресДопТаблицы = ЭлементСтруктуры.Значение;
			Если Не ЭтоАдресВременногоХранилища(АдресДопТаблицы) Тогда
				Продолжить;
			КонецЕсли;
			
			ДопТаблицаЗначений = ПолучитьИзВременногоХранилища(АдресДопТаблицы);
			
			Если Не ЗначениеЗаполнено(ДопТаблицаЗначений) Тогда
				Продолжить;
			КонецЕсли;

			НоваяГруппа = ЭлементыФормы.ГруппаСтраницы.Страницы.Добавить("Группа" + ИмяДопТаблицы, ИмяДопТаблицы);
			
			ЭлементыФормы.ГруппаСтраницы.ТекущаяСтраница = НоваяГруппа;
						
			НовоеТабличноеПоле	= ЭлементыФормы.Добавить(Тип("ТабличноеПоле"), "Таблица" + ИмяДопТаблицы, Истина, ЭлементыФормы.ГруппаСтраницы);
			
			НовоеТабличноеПоле.Верх 	= 6;
			НовоеТабличноеПоле.Лево 	= 6;
			НовоеТабличноеПоле.Ширина 	= ЭлементыФормы.ГруппаСтраницы.Ширина - 1;
			НовоеТабличноеПоле.Высота 	= ЭлементыФормы.ГруппаСтраницы.Высота - 1;

			НовоеТабличноеПоле.УстановитьПривязку(
				ГраницаЭлементаУправления.Право,
				ЭлементыФормы.ГруппаСтраницы,
				ГраницаЭлементаУправления.Право);
				
			НовоеТабличноеПоле.УстановитьПривязку(
				ГраницаЭлементаУправления.Низ,
				ЭлементыФормы.ГруппаСтраницы,
				ГраницаЭлементаУправления.Низ);

			НовоеТабличноеПоле.Значение = ДопТаблицаЗначений;
			НовоеТабличноеПоле.СоздатьКолонки();
			
			УстановитьТекущуюСтраницуПанели = Истина;
			
		КонецЦикла;
		
		Если УстановитьТекущуюСтраницуПанели Тогда
			ЭлементыФормы.ГруппаСтраницы.ТекущаяСтраница = ЭлементыФормы.ГруппаСтраницы.Страницы.Получить(0);
		КонецЕсли;
		
	#Иначе
		
		СтруктураДопТаблиц = Новый Структура;
		МассивРеквизитов = Новый Массив;
		
		Для Каждого ЭлементСтруктуры Из СтруктураАдресовТаблиц Цикл
			
			ИмяДопТаблицы 	= ЭлементСтруктуры.Ключ;
			АдресДопТаблицы = ЭлементСтруктуры.Значение;
			Если Не ЭтоАдресВременногоХранилища(АдресДопТаблицы) Тогда
				Продолжить;
			КонецЕсли;
			
			ДопТаблицаЗначений = ПолучитьИзВременногоХранилища(АдресДопТаблицы);
			
			Если Не ЗначениеЗаполнено(ДопТаблицаЗначений) Тогда
				Продолжить;
			КонецЕсли;
			
			//Поместим в значение элемента структуры полученную из хранилища таблицу значений
			СтруктураДопТаблиц.Вставить(ИмяДопТаблицы, ДопТаблицаЗначений);
			
			НовыйРеквизитТаблица = Новый РеквизитФормы(ИмяДопТаблицы, Новый ОписаниеТипов("ТаблицаЗначений"));
			МассивРеквизитов.Добавить(НовыйРеквизитТаблица);
			
			//МассивРеквизитовДопТаблиц.Добавить(НовыйРеквизитТаблица);
			
			Для Каждого Колонка Из ДопТаблицаЗначений.Колонки Цикл
				
				МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяДопТаблицы, Колонка.Имя));
				
			КонецЦикла;
			
		КонецЦикла;
		
		ИзменитьРеквизиты(МассивРеквизитов);
		
		//Элементы = ЭтаФорма.Элементы;
		
		Для Каждого ЭлементСтруктуры Из СтруктураДопТаблиц Цикл
			
			ИмяДопТаблицы = ЭлементСтруктуры.Ключ;
			ДопТаблицаЗначений = ЭлементСтруктуры.Значение;
			
			ИмяГруппы 	= "Группа" + ИмяДопТаблицы;
			ИмяТаблицы 	= "Таблица" + ИмяДопТаблицы;
			
			Если Элементы.Найти(ИмяГруппы) <> Неопределено
				Или Элементы.Найти(ИмяТаблицы) <> Неопределено Тогда
				Комментарий = НСтр("be = 'Памылка адлюстравання дадзеных дадатковай табліцы %1, т.к. створаны элемент формы з аналагічным імем'; en = 'Error displaying additional table data %1, as a form element with a similar name has been created'; es = 'Error al mostrar los datos de la tabla adicional %1, ya que se creó un elemento de formulario con un nombre similar'; ka = 'დამატებითი ცხრილის %1 მონაცემების შეცდომა, რადგან ფორმის ელემენტი შექმნილია იგივე სახელით'; kk = '%1 доп тақырыптық деректерді көрсету қатесі, себебі форма элементі атауымен ұқсас елемент құрылған'; ro = 'Eroare la afișarea datelor tabelului suplimentar %1, deoarece a fost creat un element de formă cu același nume'; ru = 'Ошибка отображения данных доп таблицы %1, т.к. создан элемент формы с аналогичным именем'; tr = '%1 ek tablo verileri görüntüleme hatası, çünkü benzer isimde bir form elemanı oluşturuldu'; uk = ""Помилка відображення даних додаткової таблиці %1, оскільки створений елемент форми з аналогічним ім'ям""; uz = ""%1 qo'shimcha jadval ma'lumotlarini ko'rsatishda xatolik, chunki shu nomli shakl elementi yaratilgan""");
				Комментарий = РеквизитФормыВЗначение("Объект").ГлЯдро_СтрШаблон(Комментарий, ИмяДопТаблицы);
				Сообщить(Комментарий); 
				Продолжить;
			КонецЕсли;
			
			НоваяСтраница = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
			НоваяСтраница.Вид 		= ВидГруппыФормы.Страница;
			НоваяСтраница.Заголовок = ИмяДопТаблицы;
			
			НоваяТаблицаФормы = Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), НоваяСтраница);		
			НоваяТаблицаФормы.ПутьКДанным = ИмяДопТаблицы;
			
			Для Каждого Колонка Из ДопТаблицаЗначений.Колонки Цикл
				
				ИмяКолонки = ИмяДопТаблицы + Колонка.Имя;
				Если Элементы.Найти(ИмяКолонки) <> Неопределено Тогда
					Комментарий = НСтр("be = 'Памылка адлюстравання калонкі дадатковай табліцы %1, т.к. створаны элемент формы з аналагічным імем'; en = 'Error displaying additional table column %1, as a form element with a similar name has been created'; es = 'Error al mostrar la columna de la tabla adicional %1, ya que se creó un elemento de formulario con un nombre similar'; ka = 'დამატებითი ცხრილის %1 სვეტის შეცდომა, რადგან ფორმის ელემენტი შექმნილია იგივე სახელით'; kk = '%1 доп тақырыптық көлонкасын көрсету қатесі, себебі форма элементі атауымен ұқсас елемент құрылған'; ro = 'Eroare la afișarea coloanei tabelului suplimentar %1, deoarece a fost creat un element de formă cu același nume'; ru = 'Ошибка отображения колонки доп таблицы %1, т.к. создан элемент формы с аналогичным именем'; tr = '%1 ek tablo sütunu görüntüleme hatası, çünkü benzer isimde bir form elemanı oluşturuldu'; uk = ""Помилка відображення колонки додаткової таблиці %1, оскільки створений елемент форми з аналогічним ім'ям""; uz = ""%1 qo'shimcha jadval ustunini ko'rsatishda xatolik, chunki shu nomli shakl elementi yaratilgan""");
					Комментарий = РеквизитФормыВЗначение("Объект").ГлЯдро_СтрШаблон(Комментарий, ИмяКолонки);
					Сообщить(Комментарий); 
					Продолжить;
				КонецЕсли;

				НоваяКолонка = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), НоваяТаблицаФормы); 
				НоваяКолонка.Заголовок = Колонка.Заголовок; 
				НоваяКолонка.ПутьКДанным = ИмяДопТаблицы + "." + Колонка.Имя;
				НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
				
			КонецЦикла;
			
			ЗначениеВРеквизитФормы(ДопТаблицаЗначений, ИмяДопТаблицы);
			
		КонецЦикла;
		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаНовыхШтрихкодовЗакрытие(Результат, ДопПараметры) Экспорт
	
	ОбновитДанныеПослеПривязкиШК();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДополнительныеКолонкиТаблицДокумента(ДанныеДокументаMS)
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить(ДанныеДокументаMS.СтрокиПлан[0].КолонкиТаблицыЗначений);
	МассивКолонок.Добавить(ДанныеДокументаMS.СтрокиФакт[0].КолонкиТаблицыЗначений);
	МассивКолонок.Добавить(ДанныеДокументаMS.СовмещенныеСтроки[0].КолонкиТаблицыЗначений);
	МассивКолонок = _ЛокКонтекст.ЛокЯдро_СтрРазделить(_ЛокКонтекст.ЛокЯдро_СтрСоединить(МассивКолонок, ","), ",", Ложь);
	
	СоздатьДополнительныеКолонкиТаблицДокументаНаСервере(МассивКолонок);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДополнительныеКолонкиТаблицДокументаНаСервере(МассивКолонок)
	
	ИсключаемыеКолонки = ИсключаемыеКолонкиОтображения();
	ДобавляемыеКолонки = Новый Массив;
	
	Для каждого РеквизитИмя Из МассивКолонок Цикл
		Если ДобавляемыеКолонки.Найти(РеквизитИмя) = Неопределено
			И ИсключаемыеКолонки.Найти(РеквизитИмя) = Неопределено Тогда
			ДобавляемыеКолонки.Добавить(РеквизитИмя);
		КонецЕсли;
	КонецЦикла;
	
	СортировкаКолонок = Новый СписокЗначений;
	СортировкаКолонок.ЗагрузитьЗначения(ДобавляемыеКолонки);
	СортировкаКолонок.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	ДобавляемыеКолонки = СортировкаКолонок.ВыгрузитьЗначения();
	
	СоздатьЭлементыОтображенияДопКолонок("СтрокиПлан", ДобавляемыеКолонки);
	СоздатьЭлементыОтображенияДопКолонок("СтрокиФакт", ДобавляемыеКолонки);
	СоздатьЭлементыОтображенияДопКолонок("СовмещенныеСтроки", ДобавляемыеКолонки);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыОтображенияДопКолонок(ИмяТаблицы, ДобавляемыеКолонки)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда		
		ТаблицаФормы = ЭлементыФормы[ИмяТаблицы];
		Для Каждого ИмяКолонки Из ДобавляемыеКолонки Цикл
			НоваяКолонка = ТаблицаФормы.Колонки.Добавить(ИмяКолонки, ИмяКолонки);
			НоваяКолонка.Данные = ИмяКолонки;
			НоваяКолонка.УстановитьЭлементУправления(Тип("ПолеВвода"));
		КонецЦикла;		
	#Иначе
		МассивРеквизитов = Новый Массив;
		Для Каждого ИмяКолонки Из ДобавляемыеКолонки Цикл
			МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов, ИмяТаблицы, ИмяКолонки));
		КонецЦикла;
		ИзменитьРеквизиты(МассивРеквизитов);
		
		Для Каждого ИмяКолонки Из ДобавляемыеКолонки Цикл
			НоваяКолонка = Элементы.Добавить(ИмяТаблицы + ИмяКолонки, Тип("ПолеФормы"), Элементы[ИмяТаблицы]); 
			НоваяКолонка.Заголовок = ИмяКолонки; 
			НоваяКолонка.ПутьКДанным = ИмяТаблицы + "." + ИмяКолонки;
			НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
			НоваяКолонка.ТолькоПросмотр = Истина;
		КонецЦикла;
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ИсключаемыеКолонкиОтображения()
	
	// Внутренние идентификаторы реквизитов
	ИсключаемыеКолонки = Новый Массив;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		СтрокиПланКолонки = СтрокиПлан.Колонки;
		СтрокиФактКолонки = СтрокиФакт.Колонки;
		СовмещенныеСтрокиКолонки = СовмещенныеСтроки.Колонки;
	#Иначе
		СтрокиПланКолонки = СтрокиПлан.Выгрузить(Новый Массив).Колонки;
		СтрокиФактКолонки = СтрокиФакт.Выгрузить(Новый Массив).Колонки;
		СовмещенныеСтрокиКолонки = СовмещенныеСтроки.Выгрузить(Новый Массив).Колонки;
	#КонецЕсли
	
	Для каждого Колонка Из СтрокиПланКолонки Цикл
		Если ИсключаемыеКолонки.Найти(Колонка.Имя) = Неопределено Тогда
			ИсключаемыеКолонки.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Колонка Из СтрокиФактКолонки Цикл
		Если ИсключаемыеКолонки.Найти(Колонка.Имя) = Неопределено Тогда
			ИсключаемыеКолонки.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Колонка Из СовмещенныеСтрокиКолонки Цикл
		Если ИсключаемыеКолонки.Найти(Колонка.Имя) = Неопределено Тогда
			ИсключаемыеКолонки.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИсключаемыеКолонки;
	
КонецФункции

#КонецОбласти

#Если ТолстыйКлиентОбычноеПриложение Тогда
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	Объект = ЭтотОбъект;
#КонецЕсли