///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПлатежныеСистемы.БазоваяФункциональностьПлатежныхСистем".
// ОбщийМодуль.ПлатежныеСистемыСобытия.
//
// Серверные процедуры обработки событий подсистемы Платежные системы:
//  - обработка событий настройки подключения;
//  - обработка событий прикладных операций;
//  - обработка событий запросов к сервису.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Формирует описание подчиненных подсистем для подсистемы ПлатежныеСистемы.
//   Вызывается из метода НастройкиПлатежныхСистемПовтИсп.ОписаниеПлатежныхСервисов
//
// Параметры:
//  ОписаниеПодсистем - Соответствие Из КлючИЗначение - описание подсистем:
//    * Ключ - Строка - платежная система
//    * Значение - см. НастройкиПлатежныхСистемСлужебный.НовыйОписаниеПлатежнойСистемы.
//
Процедура ПриОписанииПлатежныхСервисов(ОписаниеПодсистем) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		МодульОзонПэйСобытия = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСобытия");
		МодульОзонПэйСобытия.ПриДобавленииОписанияПлатежныхСервисов(ОписаниеПодсистем);
	КонецЕсли;
	
КонецПроцедуры

// Преобразует способ оплаты, полученный из сервиса значения соответствующие методам
//   общего модуля ПлатежныеСистемыКлиентСервер.
// 
// Параметры:
//  ИдентификаторСистемы - Строка - идентификатор платежной системы. Доступные значения - "ОзонПэй".
//  СпособОплатыСервис - Строка - способ оплаты, полученный из сервиса.
//  СпособОплаты - Строка - результат преобразования способа оплаты.
//  
Процедура ПриОпределенииСпособаОплаты(ИдентификаторСистемы, СпособОплатыСервис, СпособОплаты) Экспорт
	
	Если Не ЗначениеЗаполнено(СпособОплатыСервис) Тогда
		Возврат;
	КонецЕсли;
	
 	Если ИдентификаторСистемы = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыОзонПэй()
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		МодульОзонПэйСобытия = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСобытия");
		МодульОзонПэйСобытия.ПриОпределенииСпособаОплаты(СпособОплатыСервис, СпособОплаты);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкиПодключения

// Определяет данные подсказки по платежной системе.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, данные подсказки которой необходимо
//    получить.
//  РезультатОперации - см. ПлатежныеСистемыСлужебный.ПодсказкиПлатежнойСистемы.
//  ОписанияПлатежныхСистем - см. ПлатежныеСистемыСервис.ОписанияПлатежныхСистем.
//
Процедура ПриОпределенииПодсказокПлатежнойСистемы(
		ПлатежнаяСистема,
		РезультатОперации,
		ОписанияПлатежныхСистем) Экспорт
	
	Если ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		МодульОзонПэйСлужебный = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСлужебный");
		РезультатПодсказки  = МодульОзонПэйСлужебный.ПодсказкиПлатежнойСистемы(ОписанияПлатежныхСистем);
		
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить подсказки платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПлатежнаяСистема));
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатПодсказки);
	
КонецПроцедуры

// Формирует строку с идентификатором платежной системы для подстановки в адресную строку запроса к сервису.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, идентификатор которой необходимо
//    получить.
//  РезультатОперации - Строка - строка подстановки.
//
Процедура ПриОпределенииБазовогоАдресаПлатежнойСистемы(ПлатежнаяСистема, РезультатОперации) Экспорт
	
	Если ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		МодульОзонПэйСервис = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСервис");
		
		РезультатОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1/%2",
			МодульОзонПэйСервис.КореньАдресаИнтеграции(),
			МодульОзонПэйСервис.ИдентификаторПлатежнойСистемы());
		
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить идентификатор платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПлатежнаяСистема));
	КонецЕсли;
	
КонецПроцедуры

// Определяет данные реквизитов настройки аутентификации в сервисе платежной системы.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, реквизиты которой необходимо получить.
//  РезультатОперации - Массив из см. ПлатежныеСистемыСлужебный.НовыйОписаниеРеквизитов
//
Процедура ПриОпределенииРеквизитовНастройкиАутентификации(ПлатежнаяСистема, РезультатОперации) Экспорт
	
	Если ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй Тогда
		МодульОзонПэйСлужебный = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСлужебный");
		РезультатОперации = МодульОзонПэйСлужебный.РеквизитыНастройкиАутентификации();
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить реквизиты настройки аутентификации платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПлатежнаяСистема));
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при проверке параметров авторизации.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - проверяемая платежная система.
//  ДанныеАутентификации - Структура - данные аутентификации в сервисах платежной системы.
//  РезультатПроверки - см. ПлатежныеСистемыСлужебный.НовыйРезультатОперации
//
Процедура ПриПроверкеПараметровАутентификации(ПлатежнаяСистема, ДанныеАутентификации, РезультатПроверки) Экспорт
	
	Если ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		МодульОзонПэйСервис = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСервис");
		РезультатОперации = МодульОзонПэйСервис.ПроверитьПараметрыПодключения(ДанныеАутентификации);
		
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось выполнить проверку данных авторизации платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПлатежнаяСистема));
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатПроверки, РезультатОперации);
	
КонецПроцедуры

#КонецОбласти

#Область ЗапросыКСервису

// Вызывается при заполнении полей запроса токена.
//
// Параметры:
//  ПараметрыАутентификации - Структура - параметры аутентификации:
//    * ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, для который выполняется получение
//        данных аутентификации.
//    * ДанныеАутентификации - Неопределено, Произвольный - данные аутентификации. Неопределено, если данные не найдены.
//  ЗаписьДанныхСообщения - ЗаписьJSON - Данные отправляемого сообщения.
// 
Процедура ПриПодготовкеЗапроса_tokens_request(ПараметрыАутентификации, ЗаписьДанныхСообщения) Экспорт
	
	Если ПараметрыАутентификации.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй Тогда
		
		МодульОзонПэйСобытия = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСобытия");
		МодульОзонПэйСобытия.ПриПодготовкеЗапроса_tokens_request(
			ПараметрыАутентификации,
			ЗаписьДанныхСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрикладныеОперации

// Создает запрос на возврат оплаты по ранее созданному заказу на оплату.
//
// Параметры:
//  ДокументВозврата - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает возврат оплаты в
//    информационной базе.
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает оплату в
//    информационной базе.
//  ПараметрыНастройкиПодключения - см. Справочники.НастройкиПодключенияКПлатежнымСистемам.ПараметрыНастройкиПодключения
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования запроса на возврат оплаты.
//  РезультатОперации - см. ПлатежныеСистемыСлужебный.ВозвратОплаты
//
Процедура ПриСозданииВозвратаОплаты(
		ДокументВозврата,
		ДокументОплаты,
		ПараметрыНастройкиПодключения,
		ДополнительныеПараметры,
		РезультатОперации) Экспорт
	
	Если ПараметрыНастройкиПодключения.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		МодульОзонПэйСлужебный = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСлужебный");
		РезультатВозвратаОплаты = МодульОзонПэйСлужебный.ВозвратОплаты(
			ДокументВозврата,
			ДокументОплаты,
			ПараметрыНастройкиПодключения.Ссылка,
			ДополнительныеПараметры);
		
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось создать запрос на возврат оплаты платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПараметрыНастройкиПодключения.ПлатежнаяСистема));
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатВозвратаОплаты);
	
КонецПроцедуры

// Определяет механизм получения статуса операции в платежной системе.
//
// Параметры:
//  ПараметрыСтатуса - см. ПлатежныеСистемыСлужебный.ПараметрыОпределенияСтатусаОперации
//  ПараметрыНастройкиПодключения - см. Справочники.НастройкиПодключенияКПлатежнымСистемам.ПараметрыНастройкиПодключения
//  ЗапросНаличияСтатуса - Булево - если Истина, будет выполнен запрос наличия статуса.
//  РезультатОперации - Структура - результат получения статуса операции.
//
Процедура ПриПолученииСтатусаОперации(
		ПараметрыСтатуса,
		ПараметрыНастройкиПодключения,
		ЗапросНаличияСтатуса,
		РезультатОперации) Экспорт
	
	Если ПараметрыНастройкиПодключения.ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		МодульОзонПэйСервис = ОбщегоНазначения.ОбщийМодуль("ОзонПэйСервис");
		РезультатСтатусаОперации = МодульОзонПэйСервис.СтатусОперации(
			ПараметрыСтатуса,
			ПараметрыНастройкиПодключения.Ссылка);
		
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить статус операции платежной системы ""%1"".
				|Обратитесь к администратору'"),
			Строка(ПараметрыНастройкиПодключения.ПлатежнаяСистема));
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатСтатусаОперации);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти