
&ИзменениеИКонтроль("ВывестиТаблицуНеобеспеченныеТовары")
Функция АУ_ВывестиТаблицуНеобеспеченныеТовары(ТаблицаОтчета, Макет, Документ, ТаблицыРезультатов, СтруктураПараметров)

	Если НЕ ТаблицыРезультатов.Свойство("ТаблицаНеобеспеченныеТовары") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НеобеспеченныеТовары = ТаблицыРезультатов.ТаблицаНеобеспеченныеТовары.Строки.Найти(Документ, "Документ");
	Если НеобеспеченныеТовары = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяОбласти = "ЗаголовокТаблицы";
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	Заголовок = НСтр("ru = 'Необеспеченные товары и услуги (%1%)'");
	СтруктураЗаголовка = Новый Структура("Заголовок", 
							СтрЗаменить(Заголовок, "%1%", НеобеспеченныеТовары.Строки.Количество()));
	Область.Параметры.Заполнить(СтруктураЗаголовка);
	ТаблицаОтчета.Вывести(Область);
	
	ТаблицаОтчета.НачатьГруппуСтрок();
	Если СтруктураПараметров.ЕстьСуммовыеПоказателиОтгрузки Тогда
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыНеОбеспечено";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыНеОбеспечено";
		ИмяОбластиТаблицСтрока = "ТаблицаНеОбеспеченоСтрока";
	Иначе
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыНеОбеспеченоБезСумм";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыНеОбеспеченоБезСумм";
		ИмяОбластиТаблицСтрока = "ТаблицаНеОбеспеченоСтрокаБезСумм";
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиШапкаТаблицы);
	Область.Параметры.ТекстТоварУслуга = СтруктураПараметров.ТекстТоварУслугаОтгрузка;
	ТаблицаОтчета.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиСтрокаТаблицы);
	ОбластьСтроки = Область.Области[ИмяОбластиТаблицСтрока]; // ОбластьЯчеекТабличногоДокумента

	ЧетнаяСтрока = Ложь;
	АльтернативныйЦветФонаПоля = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаПоля               = ЦветаСтиля.ЦветФонаПоля;
	
	Для каждого СтрокаТовар Из НеобеспеченныеТовары.Строки Цикл
		
		Область.Параметры.Заполнить(СтрокаТовар);
		ПредставлениеНоменклатурыДляПечати = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаТовар.Номенклатура,
					СтрокаТовар.Характеристика);
		Область.Параметры.Товар = ПредставлениеНоменклатурыДляПечати;
		
		#Вставка
		//++ШЛАН
		Область.Параметры.Артикул = СтрокаТовар.Номенклатура.Артикул;
		//--ШЛАН
		#КонецВставки
		
		ОбластьСтроки.ЦветФона = ?(ЧетнаяСтрока, АльтернативныйЦветФонаПоля, ЦветФонаПоля);
		
		ТаблицаОтчета.Вывести(Область);
		ЧетнаяСтрока = НЕ ЧетнаяСтрока;
		
	КонецЦикла;
	ТаблицаОтчета.ЗакончитьГруппуСтрок();
	
	Возврат Истина
	
КонецФункции

&ИзменениеИКонтроль("ВывестиТаблицуСостояниеОбеспечения")
Функция АУ_ВывестиТаблицуСостояниеОбеспечения(ТаблицаОтчета, Макет, Документ, ТаблицыРезультатов, СтруктураПараметров)

	Если НЕ ТаблицыРезультатов.Свойство("ТаблицаСостояниеОбеспечения") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КОбеспечениюТовары = ТаблицыРезультатов.ТаблицаСостояниеОбеспечения.Строки.Найти(Документ, "Документ");
	Если КОбеспечениюТовары = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяОбласти = "ЗаголовокТаблицы";
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	Заголовок = НСтр("ru = 'Обеспечение (%1%)'");
	СтруктураЗаголовка = Новый Структура("Заголовок", 
							СтрЗаменить(Заголовок, "%1%", КОбеспечениюТовары.Строки.Количество()));
	Область.Параметры.Заполнить(СтруктураЗаголовка);
	ТаблицаОтчета.Вывести(Область);
	
	ТаблицаОтчета.НачатьГруппуСтрок();
	
	Если СтруктураПараметров.ЕстьСуммовыеПоказателиОтгрузки Тогда
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыОбеспечение";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыОбеспечение";
		ИмяОбластиТаблицСтрока = "ТаблицаОбеспечениеСтрока";
	Иначе
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыОбеспечениеБезСумм";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыОбеспечениеБезСумм";
		ИмяОбластиТаблицСтрока = "ТаблицаОбеспечениеСтрокаБезСумм";
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиШапкаТаблицы);
	Область.Параметры.ТекстТоварУслуга = СтруктураПараметров.ТекстТоварУслугаОтгрузка;
	ТаблицаОтчета.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиСтрокаТаблицы);
	ОбластьСтроки = Область.Области[ИмяОбластиТаблицСтрока]; // ОбластьЯчеекТабличногоДокумента
	
	ЧетнаяСтрока = Ложь;
	АльтернативныйЦветФонаПоля = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаПоля               = ЦветаСтиля.ЦветФонаПоля;
	
	Для каждого СтрокаТовар Из КОбеспечениюТовары.Строки Цикл
		
		Область.Параметры.Заполнить(СтрокаТовар);
		ПредставлениеНоменклатурыДляПечати = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаТовар.Номенклатура,
					СтрокаТовар.Характеристика,
					,
					СтрокаТовар.Серия);
		Область.Параметры.Товар = ПредставлениеНоменклатурыДляПечати;
		
		#Вставка
		//++ШЛАН
		Область.Параметры.Артикул = СтрокаТовар.Номенклатура.Артикул;
		//--ШЛАН
		#КонецВставки
		
		ОбластьСтроки.ЦветФона = ?(ЧетнаяСтрока, АльтернативныйЦветФонаПоля, ЦветФонаПоля);
		
		ТаблицаОтчета.Вывести(Область);
		ЧетнаяСтрока = НЕ ЧетнаяСтрока;
		
	КонецЦикла;
	
	Если ЕстьПравоДоступаКНаборуДанных("ОбеспечениеДополнительно", СтруктураПараметров) Тогда
		ИмяОбласти = "СтрокаТаблицыОбеспечениеДополнительно";
		Область = Макет.ПолучитьОбласть(ИмяОбласти);
		Область.Параметры.СтруктураПараметров = Новый Структура("Заказ, Действие", 
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Ссылка"), "ОткрытьСостояниеОбеспечения");
		ТаблицаОтчета.Вывести(Область);
	КонецЕсли;
	
	ТаблицаОтчета.ЗакончитьГруппуСтрок();
	
	Возврат Истина;
	
КонецФункции

&ИзменениеИКонтроль("ВывестиТаблицуОтгрузкиПоСкладу")
Процедура АУ_ВывестиТаблицуОтгрузкиПоСкладу(ТаблицаОтчета, Макет, ТоварыПоСкладу, СтруктураПараметров)

	ИмяОбласти = "ЗаголовокТаблицы";
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	Если ЗначениеЗаполнено(ТоварыПоСкладу.Склад) Тогда 
		ЗаголовокТаблицы = НСтр("ru = 'В процессе отгрузки на складе ""%СкладОтгрузки%"" (%1%)'");
		ЗаголовокТаблицы = СтрЗаменить(ЗаголовокТаблицы, "%СкладОтгрузки%", ТоварыПоСкладу.Склад);
	Иначе
		ЗаголовокТаблицы = НСтр("ru = 'Услуги и работы в процессе оформления (%1%)'");
	КонецЕсли;
	СтруктураЗаголовка = Новый Структура("Заголовок", 
							СтрЗаменить(ЗаголовокТаблицы, "%1%", ТоварыПоСкладу.Строки.Количество()));
	Область.Параметры.Заполнить(СтруктураЗаголовка);
	ТаблицаОтчета.Вывести(Область);
	
	Если СтруктураПараметров.ЭтоНакладная Тогда
		ШапкаТаблицыОтгрузка = "ШапкаТаблицыОтгрузкаНакладная";
		СтрокаТаблицыОтгрузка = "СтрокаТаблицыОтгрузкаНакладная";
		ТаблицаОтгрузкаСтрока = "ТаблицаОтгрузкаСтрокаНакладная";
	ИначеЕсли Не (СтруктураПараметров.ЭтоЗаказ И ТоварыПоСкладу.ОрдернаяСхемаПриОтгрузке) Тогда
		ШапкаТаблицыОтгрузка = "ШапкаТаблицыОтгрузкаБезОрдера";
		СтрокаТаблицыОтгрузка = "СтрокаТаблицыОтгрузкаБезОрдера";
		ТаблицаОтгрузкаСтрока = "ТаблицаОтгрузкаСтрокаБезОрдера";
	Иначе
		ШапкаТаблицыОтгрузка = "ШапкаТаблицыОтгрузка";
		СтрокаТаблицыОтгрузка = "СтрокаТаблицыОтгрузка";
		ТаблицаОтгрузкаСтрока = "ТаблицаОтгрузкаСтрока";
	КонецЕсли;
		
	ТаблицаОтчета.НачатьГруппуСтрок();
	
	ИмяОбласти = ШапкаТаблицыОтгрузка;
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	Область.Параметры.ТекстТоварУслуга = СтруктураПараметров.ТекстТоварУслугаОтгрузка;
	ТаблицаОтчета.Вывести(Область);
	
	ИмяОбласти = СтрокаТаблицыОтгрузка;
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	ИмяОбластьСтроки = ТаблицаОтгрузкаСтрока;
	ОбластьСтроки = Область.Области[ИмяОбластьСтроки]; // ОбластьЯчеекТабличногоДокумента
	
	ЧетнаяСтрока = Ложь;
	АльтернативныйЦветФонаПоля = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаПоля               = ЦветаСтиля.ЦветФонаПоля;
	
	Для каждого СтрокаТовар Из ТоварыПоСкладу.Строки Цикл
		
		Область.Параметры.Заполнить(СтрокаТовар);
		ПредставлениеНоменклатурыДляПечати = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаТовар.Номенклатура,
					СтрокаТовар.Характеристика,
					,
					СтрокаТовар.Серия);
		Область.Параметры.Товар = ПредставлениеНоменклатурыДляПечати;
		
		#Вставка
		//++ШЛАН
		Область.Параметры.Артикул = СтрокаТовар.Номенклатура.Артикул;
		//--ШЛАН
		#КонецВставки
		
		ОбластьСтроки.ЦветФона = ?(ЧетнаяСтрока, АльтернативныйЦветФонаПоля, ЦветФонаПоля);
		
		ТаблицаОтчета.Вывести(Область);
		ЧетнаяСтрока = НЕ ЧетнаяСтрока;
		
	КонецЦикла;
	
	ТаблицаОтчета.ЗакончитьГруппуСтрок();
	
КонецПроцедуры

&ИзменениеИКонтроль("ВывестиТаблицуОтгружено")
Функция АУ_ВывестиТаблицуОтгружено(ТаблицаОтчета, Макет, Документ, ТаблицыРезультатов, СтруктураПараметров)

	Если НЕ ТаблицыРезультатов.Свойство("ТаблицаОтгружено") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОтгруженоТовары = ТаблицыРезультатов.ТаблицаОтгружено.Строки.Найти(Документ, "Документ");
	Если ОтгруженоТовары = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяОбласти = "ЗаголовокТаблицы";
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	Заголовок = НСтр("ru = 'Отгружено (%1%)'");
	СтруктураЗаголовка = Новый Структура("Заголовок", 
							СтрЗаменить(Заголовок, "%1%", ОтгруженоТовары.Строки.Количество()));
	Область.Параметры.Заполнить(СтруктураЗаголовка);
	ТаблицаОтчета.Вывести(Область);
	
	ТаблицаОтчета.НачатьГруппуСтрок();
	
	Если СтруктураПараметров.ЕстьСуммовыеПоказателиОтгрузки Тогда
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыОтгружено";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыОтгружено";
		ИмяОбластиТаблицСтрока = "ТаблицаОтгруженоСтрока";
	Иначе
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыОтгруженоБезСумм";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыОтгруженоБезСумм";
		ИмяОбластиТаблицСтрока = "ТаблицаОтгруженоСтрокаБезСумм";
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиШапкаТаблицы);
	Область.Параметры.ТекстТоварУслуга = СтруктураПараметров.ТекстТоварУслугаОтгрузка;
	ТаблицаОтчета.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиСтрокаТаблицы);
	ОбластьСтроки = Область.Области[ИмяОбластиТаблицСтрока]; // ОбластьЯчеекТабличногоДокумента
	
	ЧетнаяСтрока = Ложь;
	АльтернативныйЦветФонаПоля = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаПоля               = ЦветаСтиля.ЦветФонаПоля;
	
	Для каждого СтрокаТовар Из ОтгруженоТовары.Строки Цикл
		
		Область.Параметры.Заполнить(СтрокаТовар);
		ПредставлениеНоменклатурыДляПечати = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаТовар.Номенклатура,
					СтрокаТовар.Характеристика,
					,
					СтрокаТовар.Серия);
		Область.Параметры.Товар = ПредставлениеНоменклатурыДляПечати;
		
		Если СтруктураПараметров.ДействиеРасшифровкаКоличествоОтгружено <> Неопределено Тогда
			РасшифровкаКоличество = Новый Структура("Номенклатура,Характеристика,Серия");
			ЗаполнитьЗначенияСвойств(РасшифровкаКоличество, СтрокаТовар);
			РасшифровкаКоличество.Вставить("Документ", Документ);
			РасшифровкаКоличество.Вставить("Действие", СтруктураПараметров.ДействиеРасшифровкаКоличествоОтгружено);
			Область.Параметры.РасшифровкаКоличество = РасшифровкаКоличество;
		КонецЕсли; 
		
		#Вставка
		//++ШЛАН
		Область.Параметры.Артикул = СтрокаТовар.Номенклатура.Артикул;
		//--ШЛАН
		#КонецВставки
		
		ОбластьСтроки.ЦветФона = ?(ЧетнаяСтрока, АльтернативныйЦветФонаПоля, ЦветФонаПоля);
		
		ТаблицаОтчета.Вывести(Область);
		ЧетнаяСтрока = НЕ ЧетнаяСтрока;
		
	КонецЦикла;
	
	ТаблицаОтчета.ЗакончитьГруппуСтрок();
	
	Возврат Истина;
	
КонецФункции

&ИзменениеИКонтроль("ВывестиТаблицуОтменено")
Функция АУ_ВывестиТаблицуОтменено(ТаблицаОтчета, Макет, ОтмененоТовары, СтруктураПараметров, ИспользоватьПричиныОтмены, ЗаголовокТаблицы, Отгрузка)

	ЕстьСуммовыеПоказатели = Отгрузка И СтруктураПараметров.ЕстьСуммовыеПоказателиОтгрузки
	                             Или Не Отгрузка И СтруктураПараметров.ЕстьСуммовыеПоказателиПоступления;

	ИмяОбласти = "ЗаголовокТаблицы";
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	СтруктураЗаголовка = Новый Структура("Заголовок", 
							СтрЗаменить(ЗаголовокТаблицы, "%1%", ОтмененоТовары.Строки.Количество()));
	Область.Параметры.Заполнить(СтруктураЗаголовка);
	ТаблицаОтчета.Вывести(Область);
	
	ТаблицаОтчета.НачатьГруппуСтрок();
	
	Если ИспользоватьПричиныОтмены И ЕстьСуммовыеПоказатели Тогда
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыОтменено";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыОтменено";
		ИмяОбластиТаблицСтрока = "ТаблицаОтмененоСтрока";
	ИначеЕсли Не ИспользоватьПричиныОтмены И ЕстьСуммовыеПоказатели Тогда
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыОтмененоБезПричины";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыОтмененоБезПричины";
		ИмяОбластиТаблицСтрока = "ТаблицаОтмененоСтрокаБезПричины";
	Иначе
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыОтмененоБезПричиныБезСумм";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыОтмененоБезПричиныБезСумм";
		ИмяОбластиТаблицСтрока = "ТаблицаОтмененоСтрокаБезПричиныБезСумм";
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиШапкаТаблицы);
	Область.Параметры.ТекстТоварУслуга = ?(Отгрузка, СтруктураПараметров.ТекстТоварУслугаОтгрузка, СтруктураПараметров.ТекстТоварУслугаПоступление);
	ТаблицаОтчета.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиСтрокаТаблицы);
	ОбластьСтроки = Область.Области[ИмяОбластиТаблицСтрока]; // ОбластьЯчеекТабличногоДокумента
	
	ЧетнаяСтрока = Ложь;
	АльтернативныйЦветФонаПоля = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаПоля               = ЦветаСтиля.ЦветФонаПоля;
	
	Для каждого СтрокаТовар Из ОтмененоТовары.Строки Цикл
		
		Область.Параметры.Заполнить(СтрокаТовар);
		ПредставлениеНоменклатурыДляПечати = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаТовар.Номенклатура,
					СтрокаТовар.Характеристика);
		Область.Параметры.Товар = ПредставлениеНоменклатурыДляПечати;
		
		#Вставка
		//++ШЛАН
		Область.Параметры.Артикул = СтрокаТовар.Номенклатура.Артикул;
		//--ШЛАН
		#КонецВставки
		
		ОбластьСтроки.ЦветФона = ?(ЧетнаяСтрока, АльтернативныйЦветФонаПоля, ЦветФонаПоля);
		
		ТаблицаОтчета.Вывести(Область);
		ЧетнаяСтрока = НЕ ЧетнаяСтрока;
		
	КонецЦикла;
	
	ТаблицаОтчета.ЗакончитьГруппуСтрок();
	
	Возврат Истина;
	
КонецФункции

&ИзменениеИКонтроль("ВывестиТаблицуПоступленияПоСкладу")
Процедура АУ_ВывестиТаблицуПоступленияПоСкладу(ТаблицаОтчета, Макет, ТоварыПоСкладу, СтруктураПараметров)

	ИмяОбласти = "ЗаголовокТаблицы";
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	Если ЗначениеЗаполнено(ТоварыПоСкладу.Склад) Тогда 
		ЗаголовокТаблицы = НСтр("ru = 'В процессе поступления на склад ""%СкладОтгрузки%"" (%1%)'");
		ЗаголовокТаблицы = СтрЗаменить(ЗаголовокТаблицы, "%СкладОтгрузки%", ТоварыПоСкладу.Склад);
	Иначе
		ЗаголовокТаблицы = НСтр("ru = 'Услуги и работы в процессе оформления (%1%)'");
	КонецЕсли;
	СтруктураЗаголовка = Новый Структура("Заголовок", 
							СтрЗаменить(ЗаголовокТаблицы, "%1%", ТоварыПоСкладу.Строки.Количество()));
	Область.Параметры.Заполнить(СтруктураЗаголовка);
	ТаблицаОтчета.Вывести(Область);
	
	ИмяОбластиШапкаТаблицы = "ШапкаТаблицыПоступление";
	ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыПоступление";
	ИмяОбластиТаблицСтрока = "ТаблицаПоступлениеСтрока";
	
	Если СтруктураПараметров.ЭтоЗаказ Или СтруктураПараметров.ЭтоПоступлениеТоваров Тогда
		Если ТоварыПоСкладу.ОрдернаяСхемаПриПоступлении Или ТоварыПоСкладу.РаздельнаяЗакупка Тогда
			ИмяОбластиШапкаТаблицы = "ШапкаТаблицыПоступление";
			ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыПоступление";
			ИмяОбластиТаблицСтрока = "ТаблицаПоступлениеСтрока";
		Иначе
			ИмяОбластиШапкаТаблицы = "ШапкаТаблицыПоступлениеБезОрдера";
			ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыПоступлениеБезОрдера";
			ИмяОбластиТаблицСтрока = "ТаблицаПоступлениеСтрокаБезОрдера";
		КонецЕсли;
	ИначеЕсли СтруктураПараметров.ЭтоНакладная Тогда
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыПоступлениеНакладная";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыПоступлениеНакладная";
		ИмяОбластиТаблицСтрока = "ТаблицаПоступлениеСтрокаНакладная";
	КонецЕсли;
	
	ТаблицаОтчета.НачатьГруппуСтрок();
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиШапкаТаблицы);
	Область.Параметры.ТекстТоварУслуга = СтруктураПараметров.ТекстТоварУслугаПоступление;
	ТаблицаОтчета.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиСтрокаТаблицы);
	ОбластьСтроки = Область.Области[ИмяОбластиТаблицСтрока]; // ОбластьЯчеекТабличногоДокумента
	
	ЧетнаяСтрока = Ложь;
	АльтернативныйЦветФонаПоля = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаПоля               = ЦветаСтиля.ЦветФонаПоля;
	
	Для каждого СтрокаТовар Из ТоварыПоСкладу.Строки Цикл
		
		Область.Параметры.Заполнить(СтрокаТовар);
		ПредставлениеНоменклатурыДляПечати = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаТовар.Номенклатура,
					СтрокаТовар.Характеристика);
		Область.Параметры.Товар = ПредставлениеНоменклатурыДляПечати;
		
		#Вставка
		//++ШЛАН
		Область.Параметры.Артикул = СтрокаТовар.Номенклатура.Артикул;
		//--ШЛАН
		#КонецВставки
		
		ОбластьСтроки.ЦветФона = ?(ЧетнаяСтрока, АльтернативныйЦветФонаПоля, ЦветФонаПоля);
		
		ТаблицаОтчета.Вывести(Область);
		ЧетнаяСтрока = НЕ ЧетнаяСтрока;
		
	КонецЦикла;
	
	ТаблицаОтчета.ЗакончитьГруппуСтрок();
	
КонецПроцедуры

&ИзменениеИКонтроль("ВывестиТаблицуПоступило")
Функция АУ_ВывестиТаблицуПоступило(ТаблицаОтчета, Макет, Документ, ТаблицыРезультатов, СтруктураПараметров)

	Если НЕ ТаблицыРезультатов.Свойство("ТаблицаПоступило") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПоступилоТовары = ТаблицыРезультатов.ТаблицаПоступило.Строки.Найти(Документ, "Документ");
	Если ПоступилоТовары = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяОбласти = "ЗаголовокТаблицы";
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	Заголовок = НСтр("ru = 'Поступило (%1%)'");
	СтруктураЗаголовка = Новый Структура("Заголовок", 
							СтрЗаменить(Заголовок, "%1%", ПоступилоТовары.Строки.Количество()));
	Область.Параметры.Заполнить(СтруктураЗаголовка);
	ТаблицаОтчета.Вывести(Область);
	
	ТаблицаОтчета.НачатьГруппуСтрок();
	
	Если СтруктураПараметров.ЕстьСуммовыеПоказателиПоступления Тогда
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыПоступило";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыПоступило";
		ИмяОбластиТаблицСтрока = "ТаблицаПоступилоСтрока";
	Иначе
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыПоступилоБезСумм";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыПоступилоБезСумм";
		ИмяОбластиТаблицСтрока = "ТаблицаПоступилоСтрокаБезСумм";
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиШапкаТаблицы);
	Область.Параметры.ТекстТоварУслуга = СтруктураПараметров.ТекстТоварУслугаПоступление;
	ТаблицаОтчета.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиСтрокаТаблицы);
	ОбластьСтроки = Область.Области[ИмяОбластиТаблицСтрока]; // ОбластьЯчеекТабличногоДокумента
	
	ЧетнаяСтрока = Ложь;
	АльтернативныйЦветФонаПоля = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаПоля               = ЦветаСтиля.ЦветФонаПоля;
	
	Для каждого СтрокаТовар Из ПоступилоТовары.Строки Цикл
		
		Область.Параметры.Заполнить(СтрокаТовар);
		ПредставлениеНоменклатурыДляПечати = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаТовар.Номенклатура,
					СтрокаТовар.Характеристика);
		Область.Параметры.Товар = ПредставлениеНоменклатурыДляПечати;
		
		Если СтруктураПараметров.ДействиеРасшифровкаКоличествоПоступило <> Неопределено Тогда
			РасшифровкаКоличество = Новый Структура("Номенклатура,Характеристика,Серия");
			ЗаполнитьЗначенияСвойств(РасшифровкаКоличество, СтрокаТовар);
			РасшифровкаКоличество.Вставить("Документ", Документ);
			РасшифровкаКоличество.Вставить("Действие", СтруктураПараметров.ДействиеРасшифровкаКоличествоПоступило);
			Область.Параметры.РасшифровкаКоличество = РасшифровкаКоличество;
		КонецЕсли; 
		
		#Вставка
		//++ШЛАН
		Область.Параметры.Артикул = СтрокаТовар.Номенклатура.Артикул;
		//--ШЛАН
		#КонецВставки
		
		ОбластьСтроки.ЦветФона = ?(ЧетнаяСтрока, АльтернативныйЦветФонаПоля, ЦветФонаПоля);
		
		ТаблицаОтчета.Вывести(Область);
		ЧетнаяСтрока = НЕ ЧетнаяСтрока;
		
	КонецЦикла;
	
	ТаблицаОтчета.ЗакончитьГруппуСтрок();
	
	Возврат Истина;
	
КонецФункции

&ИзменениеИКонтроль("ВывестиТаблицуЗаказано")
Функция АУ_ВывестиТаблицуЗаказано(ТаблицаОтчета, Макет, Документ, ТаблицыРезультатов, СтруктураПараметров)

	Если НЕ ТаблицыРезультатов.Свойство("ТаблицаЗаказано") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПоступилоТовары = ТаблицыРезультатов.ТаблицаЗаказано.Строки.Найти(Документ, "Документ");
	Если ПоступилоТовары = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяОбласти = "ЗаголовокТаблицы";
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	Заголовок = НСтр("ru = 'Заказано (%1%)'");
	СтруктураЗаголовка = Новый Структура("Заголовок", 
							СтрЗаменить(Заголовок, "%1%", ПоступилоТовары.Строки.Количество()));
	Область.Параметры.Заполнить(СтруктураЗаголовка);
	ТаблицаОтчета.Вывести(Область);
	
	ТаблицаОтчета.НачатьГруппуСтрок();
	
	Если СтруктураПараметров.ЕстьСуммовыеПоказателиПоступления Тогда
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыПоступило";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыПоступило";
		ИмяОбластиТаблицСтрока = "ТаблицаПоступилоСтрока";
	Иначе
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыПоступилоБезСумм";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыПоступилоБезСумм";
		ИмяОбластиТаблицСтрока = "ТаблицаПоступилоСтрокаБезСумм";
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиШапкаТаблицы);
	Область.Параметры.ТекстТоварУслуга = СтруктураПараметров.ТекстТоварУслугаПоступление;
	ТаблицаОтчета.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиСтрокаТаблицы);
	ОбластьСтроки = Область.Области[ИмяОбластиТаблицСтрока]; // ОбластьЯчеекТабличногоДокумента
	
	ЧетнаяСтрока = Ложь;
	АльтернативныйЦветФонаПоля = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаПоля               = ЦветаСтиля.ЦветФонаПоля;
	
	Для каждого СтрокаТовар Из ПоступилоТовары.Строки Цикл
		
		Область.Параметры.Заполнить(СтрокаТовар);
		ПредставлениеНоменклатурыДляПечати = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаТовар.Номенклатура,
					СтрокаТовар.Характеристика);
		Область.Параметры.Товар = ПредставлениеНоменклатурыДляПечати;
		Если ЗначениеЗаполнено(СтрокаТовар.Упаковка) Тогда
			Область.Параметры.Количество = СтрокаТовар.КоличествоУпаковок;
		КонецЕсли;
		
		#Вставка
		//++ШЛАН
		Область.Параметры.Артикул = СтрокаТовар.Номенклатура.Артикул;
		//--ШЛАН
		#КонецВставки
		
		ОбластьСтроки.ЦветФона = ?(ЧетнаяСтрока, АльтернативныйЦветФонаПоля, ЦветФонаПоля);
		
		ТаблицаОтчета.Вывести(Область);
		ЧетнаяСтрока = НЕ ЧетнаяСтрока;
		
	КонецЦикла;
	
	ТаблицаОтчета.ЗакончитьГруппуСтрок();
	
	Возврат Истина;
	
КонецФункции

&ИзменениеИКонтроль("ВывестиТаблицуВозвратТоваровПоСкладу")
Процедура АУ_ВывестиТаблицуВозвратТоваровПоСкладу(ТаблицаОтчета, Макет, ВозвратТоваровПоСкладу, СтруктураПараметров)

	ИмяОбласти = "ЗаголовокТаблицы";
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	Если ЗначениеЗаполнено(ВозвратТоваровПоСкладу.Склад) Тогда 
		ЗаголовокТаблицы = НСтр("ru = 'В процессе возврата на склад ""%СкладОтгрузки%"" (%1%)'");
		ЗаголовокТаблицы = СтрЗаменить(ЗаголовокТаблицы, "%СкладОтгрузки%", ВозвратТоваровПоСкладу.Склад);
	КонецЕсли;
	СтруктураЗаголовка = Новый Структура("Заголовок", 
							СтрЗаменить(ЗаголовокТаблицы, "%1%", ВозвратТоваровПоСкладу.Строки.Количество()));
	Область.Параметры.Заполнить(СтруктураЗаголовка);
	ТаблицаОтчета.Вывести(Область);
	
	ТаблицаОтчета.НачатьГруппуСтрок();
	
	Если СтруктураПараметров.ЭтоНакладная Тогда
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыВозврат";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыВозврат";
		ИмяОбластиТаблицСтрока = "ТаблицаВозвратСтрока";
	ИначеЕсли Не (СтруктураПараметров.ЭтоЗаказ И ВозвратТоваровПоСкладу.ОрдернаяСхемаПриПоступлении) Тогда
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыВозвратБезОрдера";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыВозвратБезОрдера";
		ИмяОбластиТаблицСтрока = "ТаблицаВозвратСтрокаБезОрдера";
	Иначе
		ИмяОбластиШапкаТаблицы = "ШапкаТаблицыВозврат";
		ИмяОбластиСтрокаТаблицы = "СтрокаТаблицыВозврат";
		ИмяОбластиТаблицСтрока = "ТаблицаВозвратСтрока";
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиШапкаТаблицы);
	Область.Параметры.ТекстТоварУслуга = СтруктураПараметров.ТекстТоварУслугаПоступление;
	ТаблицаОтчета.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть(ИмяОбластиСтрокаТаблицы);
	ОбластьСтроки = Область.Области[ИмяОбластиТаблицСтрока]; // ОбластьЯчеекТабличногоДокумента
	
	ЧетнаяСтрока = Ложь;
	АльтернативныйЦветФонаПоля = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаПоля               = ЦветаСтиля.ЦветФонаПоля;
	
	Для каждого СтрокаТовар Из ВозвратТоваровПоСкладу.Строки Цикл
		
		Область.Параметры.Заполнить(СтрокаТовар);
		ПредставлениеНоменклатурыДляПечати = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаТовар.Номенклатура,
					СтрокаТовар.Характеристика);
		Область.Параметры.Товар = ПредставлениеНоменклатурыДляПечати;
		
		#Вставка
		//++ШЛАН
		Область.Параметры.Артикул = СтрокаТовар.Номенклатура.Артикул;
		//--ШЛАН
		#КонецВставки
		
		ОбластьСтроки.ЦветФона = ?(ЧетнаяСтрока, АльтернативныйЦветФонаПоля, ЦветФонаПоля);
		
		ТаблицаОтчета.Вывести(Область);
		ЧетнаяСтрока = НЕ ЧетнаяСтрока;
		
	КонецЦикла;
	
	ТаблицаОтчета.ЗакончитьГруппуСтрок();
	
КонецПроцедуры

&ИзменениеИКонтроль("ВывестиТаблицуВозвращеноТоваров")
Функция АУ_ВывестиТаблицуВозвращеноТоваров(ТаблицаОтчета, Макет, Документ, ТаблицыРезультатов, СтруктураПараметров)

	Если НЕ ТаблицыРезультатов.Свойство("ТаблицаВозвращеноТоваров") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВозвращеноТоваров = ТаблицыРезультатов.ТаблицаВозвращеноТоваров.Строки.Найти(Документ, "Документ");
	Если ВозвращеноТоваров = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗаголовокТаблицы = НСтр("ru = 'Возвращено товаров клиентом (%1%)'");
	
	ИмяОбласти = "ЗаголовокТаблицы";
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	СтруктураЗаголовка = Новый Структура("Заголовок", 
							СтрЗаменить(ЗаголовокТаблицы, "%1%", ВозвращеноТоваров.Строки.Количество()));
	Область.Параметры.Заполнить(СтруктураЗаголовка);
	ТаблицаОтчета.Вывести(Область);
	
	ТаблицаОтчета.НачатьГруппуСтрок();
	
	ИмяОбласти = "ШапкаТаблицыВозвращено";
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	Область.Параметры.ТекстТоварУслуга = СтруктураПараметров.ТекстТоварУслугаПоступление;
	ТаблицаОтчета.Вывести(Область);
	
	ИмяОбласти = "СтрокаТаблицыВозвращено";
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	ИмяОбластьСтроки = "ТаблицаВозвращеноСтрока";
	ОбластьСтроки = Область.Области[ИмяОбластьСтроки]; // ОбластьЯчеекТабличногоДокумента
	
	ЧетнаяСтрока = Ложь;
	АльтернативныйЦветФонаПоля = ЦветаСтиля.АльтернативныйЦветФонаПоля;
	ЦветФонаПоля               = ЦветаСтиля.ЦветФонаПоля;
	
	Для каждого СтрокаТовар Из ВозвращеноТоваров.Строки Цикл
		
		Область.Параметры.Заполнить(СтрокаТовар);
		ПредставлениеНоменклатурыДляПечати = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаТовар.Номенклатура,
					СтрокаТовар.Характеристика);
		Область.Параметры.Товар = ПредставлениеНоменклатурыДляПечати;
		
		#Вставка
		//++ШЛАН
		Область.Параметры.Артикул = СтрокаТовар.Номенклатура.Артикул;
		//--ШЛАН
		#КонецВставки
		
		ОбластьСтроки.ЦветФона = ?(ЧетнаяСтрока, АльтернативныйЦветФонаПоля, ЦветФонаПоля);
		
		ТаблицаОтчета.Вывести(Область);
		ЧетнаяСтрока = НЕ ЧетнаяСтрока;
		
	КонецЦикла;
	
	ТаблицаОтчета.ЗакончитьГруппуСтрок();
	
	Возврат Истина;
	
КонецФункции
