
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Запись данных ДОПП.
// 
// Параметры:
//  СтруктураПараметров - Структура:
//	** Организация - СправочникСсылка.Организации
//	** СсылкаДОПП - ДокументСсылка.ДокументОПредстоящейПоставке
//	** НомерДОПП - Строка(13)
//	** Комментарий - Строка
//	** Контрагент - СправочникСсылка.Контрагенты
//	** СуммаОбеспечительногоПлатежа - Число
Процедура ЗаписьДанныхДОПП(СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("НомерДОПП",   СтруктураПараметров.НомерДОПП);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументыОПредстоящейПоставке.НомерДОПП КАК НомерДОПП,
	|	ДокументыОПредстоящейПоставке.ДатаСобытия КАК ДатаСобытия
	|ИЗ
	|	РегистрСведений.ДокументыОПредстоящейПоставке КАК ДокументыОПредстоящейПоставке
	|ГДЕ
	|	ДокументыОПредстоящейПоставке.Организация = &Организация
	|	И ДокументыОПредстоящейПоставке.НомерДОПП = &НомерДОПП
	|	И ДокументыОПредстоящейПоставке.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостояниеДОПП.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	2 КАК Порядок,
	|	ДокументОПредстоящейПоставкеТовары.КБК КАК КБК,
	|	СУММА(ДокументОПредстоящейПоставкеТовары.СуммаАкциза) КАК СуммаНалога,
	|	МАКСИМУМ(ДокументОПредстоящейПоставкеТовары.КатегорияПодакцизныхТоваров) КАК КатегорияПодакцизногоТовара
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке.Товары КАК ДокументОПредстоящейПоставкеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДокументОПредстоящейПоставке КАК ДокументОПредстоящейПоставке
	|		ПО ДокументОПредстоящейПоставкеТовары.Ссылка = ДокументОПредстоящейПоставке.Ссылка
	|ГДЕ
	|	ДокументОПредстоящейПоставке.Ссылка = &Ссылка
	|	И ДокументОПредстоящейПоставкеТовары.ПодакцизныйТовар
	|	И НЕ ДокументОПредстоящейПоставкеТовары.МаркируемаяПродукция
	|	И ДокументОПредстоящейПоставке.ОсобыйПризнакЗаявителя = ""0""
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДокументОПредстоящейПоставкеТовары.КБК,
	|	ДокументОПредстоящейПоставке.ОсобыйПризнакЗаявителя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	&КБКНДС,
	|	ВЫБОР
	|		КОГДА ДокументОПредстоящейПоставке.ОсобыйПризнакЗаявителя = ""0""
	|		ТОГДА СУММА(ДокументОПредстоящейПоставкеТовары.СуммаНДС)
	|	ИНАЧЕ 0 КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ДокументОПредстоящейПоставке.Товары КАК ДокументОПредстоящейПоставкеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДокументОПредстоящейПоставке КАК ДокументОПредстоящейПоставке
	|		ПО ДокументОПредстоящейПоставкеТовары.Ссылка = ДокументОПредстоящейПоставке.Ссылка
	|ГДЕ
	|	ДокументОПредстоящейПоставке.Ссылка = &Ссылка
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДокументОПредстоящейПоставке.ОсобыйПризнакЗаявителя
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	СуммаНалога";
	
	КБКНДС     = УчетНДСОтчетыПереопределяемый.КБКНДСПриВвозеТоваров();
	КБКНулевой = УчетНДСОтчетыПереопределяемый.НулевойКБКПриВвозеТоваров();
	Запрос.УстановитьПараметр("Ссылка", СтруктураПараметров.СсылкаДОПП);
	Запрос.УстановитьПараметр("КБКНДС", КБКНДС);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ОКруглениеПоДокументу = СтруктураПараметров.СуммаОбеспечительногоПлатежа - РезультатЗапроса.Итог("СуммаНалога");
	ОкруглениеНДС = 0;
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДокументыОПредстоящейПоставке");
		ЭлементБлокировки.УстановитьЗначение("Организация", СтруктураПараметров.Организация);
		ЭлементБлокировки.УстановитьЗначение("НомерДОПП",   СтруктураПараметров.НомерДОПП);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ДокументыОПредстоящейПоставке.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(СтруктураПараметров.Организация);
		НаборЗаписей.Отбор.НомерДОПП.Установить(СтруктураПараметров.НомерДОПП);
		
		Для Каждого СтрокаНалога Из РезультатЗапроса Цикл
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтруктураПараметров);
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтрокаНалога);
			Если СтрокаНалога.Порядок = 1 Тогда
				ОкруглениеНДС = Окр(ЗаписьРегистра.СуммаНалога) - ЗаписьРегистра.СуммаНалога;
				ЗаписьРегистра.СуммаНалога = Окр(ЗаписьРегистра.СуммаНалога);
			ИначеЕсли ОКруглениеПоДокументу - ОкруглениеНДС <> 0 Тогда
				ЗаписьРегистра.СуммаНалога = ЗаписьРегистра.СуммаНалога + ОКруглениеПоДокументу - ОкруглениеНДС;
				ОКруглениеПоДокументу = ОкруглениеНДС;
			КонецЕсли;
			Если СтруктураПараметров.СуммаОбеспечительногоПлатежа = 0 Тогда
				ЗаписьРегистра.КБК = КБКНулевой;
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	Исключение
		
		КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru='Не удалось записать данные по ДОПП:
				|%1'"),
			КраткоеПредставлениеОшибки);
			
		Отказ = Истина;
		
		ВызватьИсключение ТекстОшибки;
	
	КонецПопытки;
	
КонецПроцедуры

// Получить Таблицу КБК
// 
// Параметры:
//  КодБКНДС - Строка
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить коды БК:
// * Код - Строка 
// * Название - Строка 
Функция ПолучитьКодыБК(КодБКНДС = Неопределено) Экспорт
	
	КБКРаздел2 = Новый ТаблицаЗначений;
	КБКРаздел2.Колонки.Добавить("Код",      ОбщегоНазначения.ОписаниеТипаСтрока(20));
	КБКРаздел2.Колонки.Добавить("Название", ОбщегоНазначения.ОписаниеТипаСтрока(256));
	
	
	Если ЗначениеЗаполнено(КодБКНДС) Тогда
		Строка = КБКРаздел2.Добавить();
		Строка.Код = КодБКНДС;
		Строка.Название = НСтр("ru='НДС при импорте товаров из ЕАЭС'");
	КонецЕсли;
	
	Возврат КБКРаздел2;
	
КонецФункции

// Получить КБК в разрезе категорий для подакцизных товаров.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить КБКПо категориям товаров:
// * КодПодакцизногоТовара - Строка 
// * Код - Строка 
// * Название - Строка 
Функция ПолучитьКБКПоКатегориямТоваров() Экспорт
	
	КБКПоКатегориямТоваров = Новый ТаблицаЗначений;
	КБКПоКатегориямТоваров.Колонки.Добавить("КодПодакцизногоТовара", ОбщегоНазначения.ОписаниеТипаСтрока(3));
	КБКПоКатегориямТоваров.Колонки.Добавить("Код",                   ОбщегоНазначения.ОписаниеТипаСтрока(20));
	КБКПоКатегориямТоваров.Колонки.Добавить("Название",              ОбщегоНазначения.ОписаниеТипаСтрока(256));
	
	
	Возврат КБКПоКатегориямТоваров;
	
КонецФункции

// Получает КБК по Виду налога
// 
// Параметры:
//  Результат - Структура
// 
// Возвращаемое значение:
//  Строка - КБК
Функция УточнитьКБК(Результат) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	КБКПоВидуПлатежа = УчетНДСОтчетыПереопределяемый.КБКНДСПриВвозеТоваров();
	
	
	Возврат КБКПоВидуПлатежа;
	
КонецФункции


// Отмена данных по Номеру ДОПП.
// Если данные по Номеру ДОПП уже включены в декларацию (Состояние заполнено),
// запись оставляем. Такие записи пользователь должен отредактировать вручную.
// 
// Параметры:
//	Организация - СправочникСсылка.Организации
//	НомерДОПП - Строка
//	Отказ - Булево
Процедура ОтменаДанныхПоНомеруДОПП(Организация, НомерДОПП, Отказ) Экспорт
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДокументыОПредстоящейПоставке");
		ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
		ЭлементБлокировки.УстановитьЗначение("НомерДОПП",   НомерДОПП);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ДокументыОПредстоящейПоставке.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Отбор.НомерДОПП.Установить(НомерДОПП);
		НаборЗаписей.Прочитать();
		МассивСтрокКУдалению = Новый Массив();
		Для Каждого СтрокаДанных Из НаборЗаписей Цикл
			Если Не ЗначениеЗаполнено(СтрокаДанных.Состояние) Тогда
				МассивСтрокКУдалению.Добавить(СтрокаДанных);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Строка Из МассивСтрокКУдалению Цикл
			НаборЗаписей.Удалить(Строка);
		КонецЦикла;
		НаборЗаписей.Записать();
		
	Исключение
					
		КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru='Не удалось отменить данные по Номеру ДОПП по причине:
				|%1'"),
			КраткоеПредставлениеОшибки);
			
		Отказ = Истина;
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли