
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		
		ПараметрыВыполненияКоманды.Источник.РазблокироватьДанныеФормыДляРедактирования();
		
	КонецЕсли;
	
	ПрочитатьЛентуСервер(ПараметрКоманды);
	Оповестить("КонтурЛогистика_ОбновитьЗадачи");
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЛентуСервер(ПараметрКоманды)
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(ПараметрКоманды);
	Если ПараметрыСервиса.АвторизацияВыполнена Тогда
		
		ДоступныйФункционал = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПолучитьДоступныйФункционал(ПараметрКоманды);
		
		Если ДоступныйФункционал.ТрН Тогда
			КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.ОбработатьЛентуСобытийАпиЛогистика(ПараметрКоманды, "ЭТрН");
		КонецЕсли;
		
		Если ДоступныйФункционал.ПЛ Тогда
			КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.ОбработатьЛентуСобытийАпиЛогистика(ПараметрКоманды, "ЭПЛ");
		КонецЕсли;
		
		КонтурЛогистика_ОбработкаДокументовСервер.СоздатьТитулыПоЗагруженнымФайламОбмена();
		
	Иначе
		
		Сообщить("Ни у одной из наших организаций не заполнена авторизация в Логистике");
		
	КонецЕсли;
	
КонецПроцедуры
