
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда 
		
		НаименованиеПоПолям = СокрЛП("" +
			?(ЗначениеЗаполнено(АдресГород), АдресГород + ", ", "")  +
			?(ЗначениеЗаполнено(АдресНаселПункт), АдресНаселПункт + ", ", "") +
			?(ЗначениеЗаполнено(АдресУлица), АдресУлица + ", ", "") +
			АдресДом);
			
		Если ЗначениеЗаполнено(АдресГород) ИЛИ ЗначениеЗаполнено(АдресНаселПункт) Тогда 
			
			Наименование = НаименованиеПоПолям;
			
		ИначеЕсли ЗначениеЗаполнено(АдресИнфАдрес) Тогда
			
			Наименование = АдресИнфАдрес;
			
		ИначеЕсли ЗначениеЗаполнено(КодГАР) Тогда
		
			Наименование = "Код ГАР: " + КодГАР;
			
		ИначеЕсли ЗначениеЗаполнено(АдресКодРегион) ИЛИ ЗначениеЗаполнено(АдресИндекс)  Тогда
			
			Наименование = АдресИндекс + " регион: " + АдресКодРегион + " " + НаименованиеПоПолям;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресКодРегион) И Не ЗначениеЗаполнено(ЧасовойПояс) Тогда
		ЧасовойПояс = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЧасовойПоясПоКодуРегиона(АдресКодРегион);
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ", ЭтотОбъект, Отказ);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("КонтурЛогистика_ПунктыМаршрута_ПередЗаписью_После", Истина, ПараметрыПМ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ОбъектУчетнойСистемыСсылка")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка) Тогда 
		
		ОбъектУчетнойСистемыСсылка = ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка;
		
		Наименование = Строка(ОбъектУчетнойСистемыСсылка);
		НоваяСвязь = СвязанныеОбъекты.Добавить();
		НоваяСвязь.СвязанныйОбъект = ОбъектУчетнойСистемыСсылка;
		
		Если КонтурЛогистика_КонвертацияСервер.ЭтоНетиповаяСсылкаДляСвязанногоОбъекта(Ссылка, ОбъектУчетнойСистемыСсылка) Тогда
			КонтурЛогистика_КонвертацияСервер.ЗаполнитьДанныеДляНетиповогоСправочникаВСвязанныхОбъектах(НоваяСвязь, ОбъектУчетнойСистемыСсылка)
		КонецЕсли;
		
		// TODO включить после реализации справочника конвертации справочников
		// Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ЗаполнитьСущность(ЭтотОбъект, ОбъектУчетнойСистемыСсылка, Перечисления.КонтурЛогистика_СправочникиКонтурЛогистика);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("Партнер")
		И ЗначениеЗаполнено(ДанныеЗаполнения.Партнер) Тогда 
		
		// заполняется из партнера EDI
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		КомментарийКАдресу = ДанныеЗаполнения.Партнер;
		КодПартнераКонтур = ДанныеЗаполнения.Партнер.КодПартнераКонтур;
		АдресИнфАдрес = ДанныеЗаполнения.Адрес;
		АдресИнфКодСтраны = Справочники.КонтурЛогистика_СтраныМира.НайтиПоКоду("643");
		Наименование = Наименование + "; " + ДанныеЗаполнения.Адрес + "; " + ДанныеЗаполнения.Партнер;
		
	КонецЕсли;
	
КонецПроцедуры
