#Область ПрограммныйИнтерфейс

// Получить значение настройки.
// 
// Параметры:
//  ИмяНастройки - Строка - Имя настройки
//  ЗначениеПоУмолчанию - Неопределено - Значение по умолчанию
// 
// Возвращаемое значение:
//  Строка, Число, Булево - Получить значение настройки
Функция ПолучитьЗначениеНастройки(ИмяНастройки, ЗначениеПоУмолчанию) Экспорт
	ПрефиксПродукта = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьПрефиксПродукта();
	Результат = КонтурЗакупки_ПодсистемаНастройкиВызовСервера.ПолучитьЗначениеНастройки(ПрефиксПродукта, ИмяНастройки,
		ЗначениеПоУмолчанию);

	Возврат Результат;

КонецФункции

// Установить значение настройки.
// 
// Параметры:
//  ИмяНастройки - Строка -  Имя настройки
//  ЗначениеНастройки - Строка, Число, Булево - Значение настройки
Процедура УстановитьЗначениеНастройки(ИмяНастройки, ЗначениеНастройки) Экспорт

	ПрефиксПродукта = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьПрефиксПродукта();
	КонтурЗакупки_ПодсистемаНастройкиВызовСервера.УстановитьЗначениеНастройки(ПрефиксПродукта, ИмяНастройки,
		ЗначениеНастройки);

КонецПроцедуры

#КонецОбласти