&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;		
#КонецЕсли

&НаКлиенте
Перем СписокУстройствMS;

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПинКодИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если СтрДлина(СокрЛП(Текст)) = 4 Тогда                       				
		ТекущийЭлемент = Элементы.ПринятьПинКод;		
		Элементы.УстройствоMS.Доступность = Ложь;
	Иначе
		Элементы.УстройствоMS.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьПинКод(Команда)
	
	Если ЗначениеЗаполнено(УстройствоMS) Тогда
		Закрыть(МассивУстройствMSАдрес);
	Иначе
		ЗначениеПинКода = СтрЗаменить(ПинКод, " ", "");	
		
		Если ПустаяСтрока(ЗначениеПинКода) Тогда 
			ТекстПредупреждения = НСтр("be = 'Запоўніце пін-код або выберыце прылад з спісу.'; en = 'Enter a PIN code or select a device from the list.'; es = 'Ingrese el PIN o seleccione un dispositivo de la lista.'; ka = 'შეიყვანეთ PIN-კოდი ან აირჩიეთ მოწყობილობა სიაშიდან.'; kk = 'Пин-кодты толтырыңыз немесе тізімнен құрылғыны таңдаңыз.'; ro = 'Introduceți codul PIN sau selectați dispozitivul din listă.'; ru = 'Заполните пин-код или выберите устройство из списка.'; tr = 'Pin kodunu doldurun veya listeden bir cihaz seçin.'; uk = 'Заповніть пін-код або виберіть пристрій зі списку.'; uz = ""PIN-kodni to'ldiring yoki ro'yxatdan o'tkazilgan qurilmadan tanlang.""");
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ПринятьПинКодЗавершение", ЭтаФорма), ТекстПредупреждения); 
			Возврат;
		ИначеЕсли СтрДлина(ЗначениеПинКода) < 4 Тогда
			ТекстПредупреждения = НСтр("be = 'Пін-код уведзены не поўнасцю!'; en = 'PIN code entered incompletely!'; es = '¡El PIN no ha sido ingresado completamente!'; ka = 'პინ-კოდი შეყვანილი არ არის სრული!'; kk = 'Пин-код толық енгізілмеді!'; ro = 'Codul PIN nu a fost introdus complet!'; ru = 'Пин-код введен не полностью!'; tr = 'Pin kodu tam olarak girilmedi!'; uk = 'Пін-код введений не повністю!'; uz = 'Пин-код тўлиқ киритилмади!'");
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ПринятьПинКодЗавершение", ЭтаФорма), ТекстПредупреждения); 
			Возврат;
		Иначе
			СтрЦифр = "0123456789";		
			Для Инд = 1 По СтрДлина(ЗначениеПинКода) Цикл
				ПроверяемыйСимвол = Сред(ЗначениеПинКода, Инд, 1);
				Если _ЛокКонтекст.ЛокЯдро_СтрНайти(СтрЦифр, ПроверяемыйСимвол) = 0 Тогда
					ТекстПредупреждения = НСтр("be = 'Памылка: пін-код павінен складацца толькі з лічбаў!'; en = 'Error: PIN code must consist only of digits!'; es = '¡Error: el PIN debe consistir solo en números!'; ka = 'შეცდომა: პინ-კოდი უნდა შედგებოდეს მხოლოდ ციფრებისგან!'; kk = 'Қате: пин-код тек сандардан тұруы керек!'; ro = 'Eroare: codul PIN trebuie să conțină doar cifre!'; ru = 'Ошибка: пин-код должен состоять только из цифр!'; tr = 'Hata: Pin kodu sadece rakamlardan oluşmalıdır!'; uk = 'Помилка: пін-код повинен складатися лише з цифр!'; uz = 'Жеткизувчи пин-код фақат сонлардан иборат бўлиши керак!'");
					ПоказатьПредупреждение(Новый ОписаниеОповещения("ПринятьПинКодЗавершение", ЭтаФорма), ТекстПредупреждения); 
					Возврат;					
				КонецЕсли;				
			КонецЦикла;   		
		КонецЕсли;
		
		Закрыть(ЗначениеПинКода);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстройствоMSНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(МассивУстройствMSАдрес) Тогда
		СписокУстройствMS = ПолучитьИзВременногоХранилища(МассивУстройствMSАдрес);
	КонецЕсли;
	
	пУстройстваMS = _ЛокКонтекст.СтруктураМетаданных.УстройстваMS;
	ПользователиMS =_ЛокКонтекст.ЛокЯдро_ПодготовитьДеревоУстройствНаСервере(пУстройстваMS);
		
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаСлужебная_ВыборУстройстваMS = ПолучитьФорму("ОФ_ФормаСлужебная_ВыборПользователяИлиГруппы",ЭтаФорма);
	#Иначе	
		ФормаСлужебная_ВыборУстройстваMS = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСлужебная_ВыборПользователяИлиГруппы", , ЭтаФорма, ЭтаФорма);
	#КонецЕсли	
		
	ФормаСлужебная_ВыборУстройстваMS._ЛокКонтекст 					= _ЛокКонтекст;
	ФормаСлужебная_ВыборУстройстваMS.ЗакрыватьПриЗакрытииВладельца 	= Истина;	
	ФормаСлужебная_ВыборУстройстваMS.ТекущиеПользователи 			= УстройствоMS;
	ФормаСлужебная_ВыборУстройстваMS.ПользователиMSАдрес 			= ПользователиMS;
	ФормаСлужебная_ВыборУстройстваMS.СпособНазначения 				= "Устройству";
	ФормаСлужебная_ВыборУстройстваMS.ОдиночныйРежимВыделения 		= Истина;
	ФормаСлужебная_ВыборУстройстваMS.РежимВводаПинКода 				= Истина;
	ФормаСлужебная_ВыборУстройстваMS.РежимОткрытияОкна 				= РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ФормаСлужебная_ВыборУстройстваMS.Заголовок 						= НСтр("be = 'Cleverence: Выбар прылады'; en = 'Cleverence: Selecting a device'; es = 'Cleverence: Selección de dispositivo'; ka = 'Cleverence: მოწყობილობის არჩევა'; kk = 'Cleverence: Құрылғыны таңдау'; ro = 'Cleverence: Selectarea dispozitivului'; ru = 'Клеверенс: Выбор устройства'; tr = 'Cleverence: Cihaz seçimi'; uk = 'Cleverence: Вибір пристрою'; uz = 'Cleverence: Qurilmayni tanlash'");
	
	ФормаСлужебная_ВыборУстройстваMS.Элементы["ПользователиMSГруппаПользователь"].Заголовок = НСтр("be = 'Прылада'; en = 'Device'; es = 'Dispositivo'; ka = 'მოწყობილობა'; kk = 'Құрылғы'; ro = 'Dispozitiv'; ru = 'Устройство'; tr = 'Cihaz'; uk = 'Пристрій'; uz = 'Qurilma'");
		
	ОП = Новый ОписаниеОповещения("Служебная_ВыборУстройстваMSЗакрытие", ЭтаФорма);
	ФормаСлужебная_ВыборУстройстваMS.ОписаниеОповещенияОЗакрытии = ОП;
	ФормаСлужебная_ВыборУстройстваMS.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстройствоMSПриИзменении(Элемент)
	
	Если Не ПустаяСтрока(УстройствоMS) Тогда
		Элементы.ПинКод.Доступность = Ложь;
	Иначе
		Элементы.ПинКод.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстройствоMSИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Текст) Тогда 
		УстройствоMS = "";
		Элементы.ПинКод.Доступность = Истина;
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти

#Область ОписанияОповещений

&НаКлиенте
Процедура Служебная_ВыборУстройстваMSЗакрытие(РезультатРедактирования, ДопПараметры) Экспорт
		
	Если РезультатРедактирования <> Неопределено И ТипЗнч(РезультатРедактирования) = Тип("Массив") Тогда
		
		УстройствоMS = "";
		
		Для Каждого Элемент Из РезультатРедактирования Цикл								
			УстройствоMS = УстройствоMS + Элемент.Ид + "|";		
		КонецЦикла; 			
		
		УстройствоMS = Лев(УстройствоMS, СтрДлина(УстройствоMS) - 1);							
		
		МассивУстройствMSАдрес = ПоместитьВоВременноеХранилище(РезультатРедактирования);
		
	Иначе
		
		МассивУстройствMSАдрес = ПоместитьВоВременноеХранилище(СписокУстройствMS);
		
	КонецЕсли;	
	
	Если Не ПустаяСтрока(УстройствоMS) Тогда
		ТекущийЭлемент = Элементы.ПринятьПинКод;
		Элементы.ПинКод.Доступность = Ложь;
	Иначе
		Элементы.ПинКод.Доступность = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьПинКодЗавершение(ДополнительныеПараметры) Экспорт
	
	// Ничего не делаем...
	
КонецПроцедуры

#КонецОбласти