#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Преобразовать значение из строкового представления в значение перечисления или обратно.
// 
// Параметры:
//  Значение - ПеречислениеСсылка.СпособыОбъединенияЗаписейСкладскогоЖурналаВЕТИС, Строка - 
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СпособыОбъединенияЗаписейСкладскогоЖурналаВЕТИС, Строка - Преобразовать значение
Функция ПреобразоватьЗначение(Значение) Экспорт

	Если Значение = "ATTACH" Тогда
		Возврат Присоединить;
	ИначеЕсли Значение = "MERGE" Тогда
		Возврат Объединить;
		
	ИначеЕсли Значение = Присоединить Тогда
		Возврат "ATTACH";
	ИначеЕсли Значение = Объединить Тогда
		Возврат "MERGE";
	КонецЕсли; 

КонецФункции

#КонецОбласти

#КонецЕсли