#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура АУ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	МассивКраткихКодов = Новый Массив;
	ОбщийЗаказ = Неопределено;
	Если ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) И ТипЗнч(ЭтотОбъект.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда

		ОбщийЗаказ = ЭтотОбъект.ДокументОснование;

	КонецЕсли;

	Для каждого стрТовары Из ЭтотОбъект.Товары Цикл

		ТекущийЗаказ = стрТовары.АУ_ЗаказКлиента;
		Если НЕ ЗначениеЗаполнено(ТекущийЗаказ) Тогда

			ТекущийЗаказ = ОбщийЗаказ;

		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ТекущийЗаказ) Тогда

			Продолжить;

		КонецЕсли;

		Если ЗначениеЗаполнено(ТекущийЗаказ.Договор.АУ_КраткийНомер) Тогда

			МассивКраткихКодов.Добавить(ТекущийЗаказ.Договор.АУ_КраткийНомер);

		КонецЕсли;

		Если ЗначениеЗаполнено(стрТовары.АУ_КодСтроки) Тогда

			НайденныеСтроки = ТекущийЗаказ.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", стрТовары.АУ_КодСтроки));
			Если НайденныеСтроки.Количество()>0 Тогда

				Продолжить;
			Иначе

				стрТовары.АУ_КодСтроки = "";

			КонецЕсли;

		КонецЕсли;

		Если ТекущийЗаказ.Товары.Количество() = 1 Тогда

			стрТовары.АУ_КодСтроки = ТекущийЗаказ.Товары[0].ИдентификаторСтроки;
		Иначе

			НайденныеСтроки = ТекущийЗаказ.Товары.НайтиСтроки(Новый Структура("Номенклатура", стрТовары.Номенклатура));
			Если НайденныеСтроки.Количество()>0 Тогда

				стрТовары.АУ_КодСтроки = НайденныеСтроки[0].ИдентификаторСтроки;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Если ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) И ТипЗнч(ЭтотОбъект.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда

		Если ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование.ДокументОснование) И ТипЗнч(ЭтотОбъект.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда

			МассивКраткихКодов.Добавить(ЭтотОбъект.ДокументОснование.ДокументОснование.Договор.АУ_КраткийНомер);

		КонецЕсли;

	КонецЕсли;

	МассивКраткихКодов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивКраткихКодов);
	АУ_КраткийНомер = СтрСоединить(МассивКраткихКодов, ", ");

КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура АУ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Номер,Автор");
		ЭтотОбъект.Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить());
		ЭтотОбъект.ЭтапыГрафикаОплаты.Загрузить(ДанныеЗаполнения.ЭтапыГрафикаОплаты.Выгрузить());
		ЭтотОбъект.ДатаПоступления = ДанныеЗаполнения.Дата;
		ЭтотОбъект.ДатаОтгрузки = ДанныеЗаполнения.Дата;
		ЭтотОбъект.Автор = Пользователи.АвторизованныйПользователь();

	КонецЕсли;

КонецПроцедуры

&После("ЗаполнитьДокументНаОснованииЗаказаКлиента")
Процедура АУ_ЗаполнитьДокументНаОснованииЗаказаКлиента(Знач ДанныеЗаполнения)

	ЗаказКлиента = ДанныеЗаполнения.Основание;
	Для каждого стрТовары Из ЭтотОбъект.Товары Цикл

		НайденныеСтроки = ЗаказКлиента.Товары.НайтиСтроки(Новый Структура("Номенклатура,Характеристика", стрТовары.Номенклатура, стрТовары.Характеристика));
		Если НайденныеСтроки.Количество()>0 Тогда

			стрТовары.АУ_Шифр = НайденныеСтроки[0].АУ_Шифр;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&После("ПриКопировании")
Процедура АУ_ПриКопировании(ОбъектКопирования)

	Попытка

		ДокументОснование = ОбъектКопирования.ДокументОснование;
	Исключение
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
