&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _КлиентскиеВызовы;

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьФорму(ФормаКлиентскиеВызовы) Экспорт
	
	_КлиентскиеВызовы = ФормаКлиентскиеВызовы;
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначениеРеквизита") Тогда
		ЗначениеРеквизита = Параметры.ЗначениеРеквизита;
		ЗаполнитьДанныеФормы(ЗначениеРеквизита);             
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяТекущегоЭлемента") Тогда
		
		Попытка
			ЭтаФорма.ТекущийЭлемент = Элементы[Параметры.ИмяТекущегоЭлемента];
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	ЗначениеРеквизита = ЗначениеРеквизита();
	Закрыть(ЗначениеРеквизита);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоСсылке(Команда)

	ОбновитьПоСсылкеНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоСсылкеНаСервере()

	МодульОбъекта = ОбработкаОбъект();
	ДанныеДоговора = МодульОбъекта.ДанныеДоговора(СсылкаНаОбъект, "УчСист");
	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеДоговора, ЭтаФорма);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНаСервере()

	МодульОбъекта = ОбработкаОбъект();		
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма);
	МодульОбъекта.СохранитьЗначения(СсылкаНаОбъект, ЗначенияДополнительныхСвойств, "РеквДок");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы(ЗначениеРеквизита)
	
	ИнициализацияФормы();

	МодульОбъекта = ОбработкаОбъект();	
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ДанныеДоговора = МодульОбъекта.ДесериализоватьXML(ЗначениеРеквизита);
	Иначе
		ДанныеДоговора = Новый Структура;
	КонецЕсли;

	Если ДанныеДоговора.Свойство("Ссылка") Тогда
		СсылкаНаОбъект = ДанныеДоговора.Ссылка;		
	КонецЕсли;

	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Элементы.ОбновитьПоСсылке.Видимость = Истина; 
	Иначе
		Элементы.ОбновитьПоСсылке.Видимость = Ложь; 
	КонецЕсли;
	
	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеДоговора, ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормы()

КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизита()

	МодульОбъекта = ОбработкаОбъект();
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма);
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ЗначенияДополнительныхСвойств.Вставить("Ссылка", СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат МодульОбъекта.СериализоватьXML(ЗначенияДополнительныхСвойств);
	
КонецФункции

&НаСервере
Процедура ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей()
	
	МодульОбъекта = ОбработкаОбъект();
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма);
	ДанныеДоговора = Новый Структура;
	МодульОбъекта.ЗаменитьСсылкиНаСтруктуры(ДанныеДоговора, ЗначенияДополнительныхСвойств);
	
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	ОбязательныеРеквизиты = Новый Массив;
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		ОбязательныеРеквизиты.Добавить(РеквизитФормы.Имя);	
	КонецЦикла;
	ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Ложь, ОбязательныеРеквизиты);

	ПараметрыВалидацииДоговора = Новый Структура;
	МодульОбъекта.ПараметрыВалидацииОснАрЛиз(ПараметрыВалидацииДоговора, "СвТС.ТС.ОснАрЛиз");
	ОбязательныеРеквизитыПоФормам = МодульОбъекта.РеквизитыОбязательныхПолейПоФормам(ДанныеДоговора, ДанныеДоговора, ПараметрыВалидацииДоговора.СвТС.ТС.ОснАрЛиз);
	ОбязательныеРеквизиты = ОбязательныеРеквизитыФормы("ФормаДоговора", ОбязательныеРеквизитыПоФормам);
	
	ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Истина, ОбязательныеРеквизиты);

КонецПроцедуры

&НаСервере
Процедура ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Значение, ОбязательныеРеквизиты)
		
	Для Каждого ИмяРеквизита Из ОбязательныеРеквизиты Цикл
		Попытка
			Элементы[ИмяРеквизита].АвтоОтметкаНезаполненного = Значение;
			Элементы[ИмяРеквизита].ОтметкаНезаполненного = Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОбязательныеРеквизитыФормы(ИмяФормы, ОбязательныеРеквизитыПоФормам)
	
	Результат = Новый Массив;
	
	Если ТипЗнч(ОбязательныеРеквизитыПоФормам) = Тип("Структура")
		И ОбязательныеРеквизитыПоФормам.Свойство(ИмяФормы) Тогда
		Результат = ОбязательныеРеквизитыПоФормам[ИмяФормы];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура рл_ИдРекСост_ИННПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_НаимДокПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_НомерДокПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_ДатаДокПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура рл_ДопСведДокПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

