
Функция ПолучитьДанныеДляТСДGET(Запрос)
	
	Параметры=АУ_РаботаССервисомТСДСервис.ПолучитьСтруктуруПараметровДляОбработкиЗапроса();
	Параметры.ИмяМетода="/GetData";
	Параметры.ТипМетода="GET";
	Параметры.ЗапросХТТП=Запрос;
	
	Возврат АУ_РаботаССервисомТСДСервис.ОбработатьЗапрос(Параметры);
	
КонецФункции

Функция ПринятьДанныеОтТСДPOST(Запрос)
	
	Параметры=АУ_РаботаССервисомТСДСервис.ПолучитьСтруктуруПараметровДляОбработкиЗапроса();
	Параметры.ИмяМетода="/ReceiveData";
	Параметры.ТипМетода="POST";
	Параметры.ЗапросХТТП=Запрос;
	
	Возврат АУ_РаботаССервисомТСДСервис.ОбработатьЗапрос(Параметры);
	
КонецФункции
