#Область СлужебныйПрограммныйИнтерфейс

// Преобразовывает текстовое представление статуса кода маркировки МОТП в значение перечисления.
//
// Параметры:
//  ЗначениеПоиска - Строка - значение для перекодировки
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыКодовМаркировкиСУЗ - статус кода маркировки.
//
Функция СтатусКодаМаркировки(Знач ЗначениеПоиска) Экспорт
	
	ЗначениеПоиска = ВРег(ЗначениеПоиска);
	
	Если ЗначениеПоиска = "GENERATED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиСУЗ.Сгенерирован;
	ИначеЕсли ЗначениеПоиска = "UTILISED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиСУЗ.Использован;
	ИначеЕсли ЗначениеПоиска = "DROPPED_OUT" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиСУЗ.Отбракован;
	ИначеЕсли ЗначениеПоиска = "PACKED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиСУЗ.Упакован;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус кода маркировки: %1'"),
			ЗначениеПоиска);
	
КонецФункции

// Преобразовывает текстовое представление статуса обработки отчёта СУЗ в значение перечисления.
//
// Параметры:
//  ЗначениеПоиска - Строка - значение для перекодировки
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыОбработкиСообщенийИСМП - статус обработки отчета.
//
Функция СтатусОбработкиОтчета(Знач ЗначениеПоиска) Экспорт
	
	ЗначениеПоиска = ВРег(ЗначениеПоиска);
	
	Если ЗначениеПоиска = "DRAFT" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята;
	ИначеЕсли ЗначениеПоиска = "PENDING" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
	ИначеЕсли ЗначениеПоиска = "READY_TO_SEND" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
	ИначеЕсли ЗначениеПоиска = "REJECTED" Или  ЗначениеПоиска = "CHECKED_NOT_OK" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
	ИначеЕсли ЗначениеПоиска = "SENT" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ИначеЕсли ЗначениеПоиска = "CHECK" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
	ИначеЕсли ЗначениеПоиска = "PROCESSED" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ИначеЕсли ЗначениеПоиска = "SUCCESS" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ИначеЕсли ЗначениеПоиска = "CHECKED_OK" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ИначеЕсли ЗначениеПоиска = "FAILED" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус отчета СУЗ: %1'"),
			ЗначениеПоиска);

КонецФункции

// Преобразовывает текстовое представление статуса обработки отчёта о нанесении СУЗ в значение перечисления.
//
// Параметры:
//  ЗначениеПоиска - Строка - значение для перекодировки
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыОбработкиСообщенийИСМП - статус обработки отчета.
//
Функция СтатусОбработкиОтчетаОНанесении(Знач ЗначениеПоиска) Экспорт

	ЗначениеПоиска = ВРег(ЗначениеПоиска);

	Если ЗначениеПоиска = "DRAFT" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаПринята;
	ИначеЕсли ЗначениеПоиска = "PENDING" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
	ИначеЕсли ЗначениеПоиска = "READY_TO_SEND" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
	ИначеЕсли ЗначениеПоиска = "REJECTED" Или  ЗначениеПоиска = "CHECKED_NOT_OK" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
	ИначеЕсли ЗначениеПоиска = "SENT" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ИначеЕсли ЗначениеПоиска = "CHECK" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
	ИначеЕсли ЗначениеПоиска = "PROCESSED" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ИначеЕсли ЗначениеПоиска = "CHECKED_OK" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ИначеЕсли ЗначениеПоиска = "SUCCESS" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ИначеЕсли ЗначениеПоиска = "FAILED" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
	ИначеЕсли ЗначениеПоиска = "SUCCESSPARTIALLY" Или ЗначениеПоиска = "PARTIALLY" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
	КонецЕсли;

	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус отчета о нанесении СУЗ: %1'"),
			ЗначениеПоиска);

КонецФункции

// Преобразовывает текстовое представление статуса кода маркировки МОТП в значение перечисления.
//
// Параметры:
//  ЗначениеПоиска - Строка - значение для перекодировки
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыОбработкиСообщенийИСМП - статус обработки заявки.
//
Функция СтатусОбработкиЗапросаНаПолучениеИдентификатораСоединения(Знач ЗначениеПоиска) Экспорт
	
	ЗначениеПоиска = ВРег(ЗначениеПоиска);
	
	Если ЗначениеПоиска = "SUCCESS" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ИначеЕсли ЗначениеПоиска = "REJECTED" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус запрос на получение идентификатора соединения: %1'"),
			ЗначениеПоиска);
	
КонецФункции

Функция РезультатОбработкиОтчетаСУЗ(Знач ЗначениеПоиска) Экспорт
	
	ЗначениеПоиска = ВРег(ЗначениеПоиска);
	
	Если ЗначениеПоиска = "SUCCESS" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ИначеЕсли ЗначениеПоиска = "FAILED" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.Ошибка;
	ИначеЕсли ЗначениеПоиска = "IN_PROGRESS" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается;
	ИначеЕсли ЗначениеПоиска = "PARTIALLY" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбработанаЧастично;
	ИначеЕсли ЗначениеПоиска = "ACCEPTED" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаВыполнена;
	ИначеЕсли ЗначениеПоиска = "REJECTED" Тогда
		Возврат Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОтклонена;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный результат обработки документа СУЗ: %1'"),
			ЗначениеПоиска);
	
КонецФункции

	
// Преобразовывает вид операции ИС МП в вид отчета об использовании кодов маркировки.
//
// Параметры:
//  ЗначениеПоиска - ПеречислениеСсылка.ВидыОперацийИСМП - значение для перекодировки
// 
// Возвращаемое значение:
//  Строка - Вид отчета об использовании кодов маркировки.
//
Функция ВидОтчетаОбИспользованииКодовМаркировки(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПередачеКМНаПроизводственнуюЛинию Тогда
		Возврат "USED_FOR_PRODUCTION";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПередачеКМНаПринтер Тогда
		Возврат "SENT_TO_PRINTER";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПечатиКМ Тогда
		Возврат "PRINTED";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.УдалитьОтчетОПотереРаспечатанныхКМ Тогда
		Возврат "PRINTER_LOST";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтчетОВерификацииНанесенныхКМ Тогда
		Возврат "VERIFIED";
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный вид отчета об использовании КМ СУЗ: %1'"),
			ЗначениеПоиска);
	
КонецФункции

// Преобразовывает текстовое представление статуса кода маркировки МОТП в значение перечисления.
//
// Параметры:
//  ЗначениеПоиска - Строка - значение для перекодировки
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыКодовМаркировкиСУЗ - статус кода маркировки.
//
Функция СтатусБизнесЗаказа(Знач ЗначениеПоиска) Экспорт
	
	ЗначениеПоиска = ВРег(ЗначениеПоиска);
	
	Если ЗначениеПоиска = "CREATED" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗСоздан;
	ИначеЕсли ЗначениеПоиска = "PENDING" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗПринятКОбработке;
	ИначеЕсли ЗначениеПоиска = "APPROVED" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗПодтвержденИСМП;
	ИначеЕсли ЗначениеПоиска = "READY" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗПринятКПроизводству;
	ИначеЕсли ЗначениеПоиска = "CLOSED" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗЗакрыт;
	ИначеЕсли ЗначениеПоиска = "DECLINED" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.Ошибка;
	ИначеЕсли ЗначениеПоиска = "EXPIRED" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗАннулирован;
	ИначеЕсли ЗначениеПоиска = "CANCELED" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.Аннулирован;
	ИначеЕсли ЗначениеПоиска = "UNDER_CONSIDERATION" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗНаРассмотренииЭмитента;
	ИначеЕсли ЗначениеПоиска = "SUSPENDED" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗПриостановлено;
	ИначеЕсли ЗначениеПоиска = "ACCOUNT" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗФормированиеСчета;
	ИначеЕсли ЗначениеПоиска = "WAITING_PAYMENT" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗОжиданиеОплаты;
	ИначеЕсли ЗначениеПоиска = "TRANSFERRED_PRODUCTION" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗПереданоВПроизводство;
	ИначеЕсли ЗначениеПоиска = "TRANSFERRED" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗИзготовленоИПереданоГрузоперевозчику;
	ИначеЕсли ЗначениеПоиска = "AWAITING_PICKUP" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗИзготовленоОжидаетСамовывоза;
	ИначеЕсли ЗначениеПоиска = "ACTIVE" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗОтгруженоЗаказчику;
	ИначеЕсли ЗначениеПоиска = "RETURNED" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗВозвращено;
	ИначеЕсли ЗначениеПоиска = "DESTROYED" Тогда
		Возврат Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.СУЗУничтожено;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус отчета СУЗ: %1'"),
			ЗначениеПоиска);
	
КонецФункции

// Преобразовывает текстовое представление статуса кода маркировки МОТП в значение перечисления.
//
// Параметры:
//  ЗначениеПоиска - Строка - значение для перекодировки
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыКодовМаркировкиСУЗ - статус кода маркировки.
//
Функция СтатусПулаКодовМаркировки_V1(Знач ЗначениеПоиска) Экспорт
	
	ЗначениеПоиска = ВРег(ЗначениеПоиска);
	
	Если ЗначениеПоиска = "PENDING" Тогда
		Возврат Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Обрабатывается;
	ИначеЕсли ЗначениеПоиска = "READY" Тогда
		Возврат Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Готов;
	ИначеЕсли ЗначениеПоиска = "REJECTED" Тогда
		Возврат Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Ошибка;
	ИначеЕсли ЗначениеПоиска = "CLOSED" Тогда
		Возврат Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Закрыт;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус пула кода маркировки: %1'"),
			ЗначениеПоиска);
	
КонецФункции

// Преобразовывает текстовое представление статуса кода маркировки МОТП в значение перечисления.
//
// Параметры:
//  ЗначениеПоиска - Строка - значение для перекодировки
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыКодовМаркировкиСУЗ - статус кода маркировки.
//
Функция СтатусПулаКодовМаркировки_V2(Знач ЗначениеПоиска) Экспорт
	
	ЗначениеПоиска = ВРег(ЗначениеПоиска);
	
	Если ЗначениеПоиска = "PENDING" Тогда
		Возврат Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Обрабатывается;
	ИначеЕсли ЗначениеПоиска = "ACTIVE" Тогда
		Возврат Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Готов;
	ИначеЕсли ЗначениеПоиска = "CLOSED" Тогда
		Возврат Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Закрыт;
	ИначеЕсли ЗначениеПоиска = "REJECTED" Тогда
		Возврат Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Отклонен;
	ИначеЕсли ЗначениеПоиска = "EXHAUSTED" Тогда
		Возврат Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Закрыт;
	ИначеЕсли ЗначениеПоиска = "EXPIRED" Тогда
		Возврат Перечисления.СтатусыПулаКодовМаркировкиСУЗ.Отклонен;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус пула кода маркировки: %1'"),
			ЗначениеПоиска);
	
КонецФункции

// Перекодирует способ выпуска товаров в для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.СпособыВводаВОборотСУЗ - значение для перекодировки.
//  Назначение     - Строка - СУЗ, ИСМП или ОСТАТКИ
//
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.СпособыВводаВОборотСУЗ - Результат перекодирования.
//
Функция СпособВыпускаВОборот(Знач ЗначениеПоиска, Назначение = "СУЗ") Экспорт
	
	Если ЗначениеПоиска = "PRODUCTION" Или ЗначениеПоиска = "LOCAL" Или ЗначениеПоиска = "PRODUCED_IN_RF" Тогда
		Результат = Перечисления.СпособыВводаВОборотСУЗ.Производство;
	ИначеЕсли ЗначениеПоиска = "IMPORT" Или ЗначениеПоиска = "FOREIGN" Или ЗначениеПоиска = "IMPORTED_INTO_RF" Тогда
		Результат = Перечисления.СпособыВводаВОборотСУЗ.Импорт;
	ИначеЕсли ЗначениеПоиска = "REMARK" Тогда
		Результат = Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка;
	ИначеЕсли ЗначениеПоиска = "REMAINS" Тогда
		Результат = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков;
	ИначеЕсли ЗначениеПоиска = "CROSSBORDER" Тогда
		Результат = Перечисления.СпособыВводаВОборотСУЗ.ТрансграничнаяТорговля;
	ИначеЕсли ЗначениеПоиска = "COMMISSION" Тогда
		Результат = Перечисления.СпособыВводаВОборотСУЗ.Комиссия;
	ИначеЕсли ЗначениеПоиска = "REAPPLY" Тогда
		Результат = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаВнеПроизводстваИмпорта;
		
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Производство И Назначение = "СУЗ" Тогда
		Результат = "PRODUCTION";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Производство И Назначение = "ИСМП" Тогда
		Результат = "LOCAL";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Производство И Назначение = "ОСТАТКИ" Тогда
		Результат = "PRODUCED_IN_RF";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Импорт И Назначение = "СУЗ" Тогда
		Результат = "IMPORT";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Импорт И Назначение = "ИСМП" Тогда
		Результат = "FOREIGN";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Импорт И Назначение = "ОСТАТКИ" Тогда
		Результат = "IMPORTED_INTO_RF";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка Тогда
		Результат = "REMARK";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков Тогда
		Результат = "REMAINS";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.ТрансграничнаяТорговля Тогда
		Результат = "CROSSBORDER";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Комиссия Тогда
		Результат = "COMMISSION";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаВнеПроизводстваИмпорта Тогда
		Результат = "REAPPLY";
	Иначе
		ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный способ выпуска в оборот: %1'"),
			ЗначениеПоиска);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Перекодирует вид сервис провайдера для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Неопределено - сервис-провайдер не используется, коды маркировки получаются самостоятельно,
//                   Строка, ПеречислениеСсылка.ВидыСервисПровайдеровСУЗ - значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.ВидыСервисПровайдеровСУЗ - Результат перекодирования.
//
Функция СпособИзготовленияКодовМаркировки(ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = Неопределено Тогда
		Результат = "SELF_MADE";
	Иначе
		
		Если ЗначениеПоиска = Перечисления.ВидыСервисПровайдеровСУЗ.ЦЭМ Тогда
			Результат =  "CEM";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыСервисПровайдеровСУЗ.КонтрактноеПроизводство Тогда
			Результат =  "CM";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыСервисПровайдеровСУЗ.ЛогистическийСклад Тогда
			Результат =  "CL";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыСервисПровайдеровСУЗ.КомиссионнаяПлощадка Тогда
			Результат =  "CA";
		
		ИначеЕсли ЗначениеПоиска = "CEM" Тогда
			Результат = Перечисления.ВидыСервисПровайдеровСУЗ.ЦЭМ;
		ИначеЕсли ЗначениеПоиска = "CM" Тогда
			Результат = Перечисления.ВидыСервисПровайдеровСУЗ.КонтрактноеПроизводство;
		ИначеЕсли ЗначениеПоиска = "CL" Тогда
			Результат = Перечисления.ВидыСервисПровайдеровСУЗ.ЛогистическийСклад;
		ИначеЕсли ЗначениеПоиска = "CA" Тогда
			Результат = Перечисления.ВидыСервисПровайдеровСУЗ.КомиссионнаяПлощадка;
		Иначе
			ВызватьИсключение
				СтрШаблон(
					НСтр("ru = 'Неизвестный вид сервис-провайдера: %1'"),
					ЗначениеПоиска);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Перекодирует способ формирования серийного номера кода маркировки для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.СпособыФормированияСерийногоНомераСУЗ - значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.СпособыФормированияСерийногоНомераСУЗ - Результат перекодирования.
//
Функция СпособФормированияСерийногоНомера(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = "SELF_MADE" Тогда
		Результат = Перечисления.СпособыФормированияСерийногоНомераСУЗ.Самостоятельно;
	ИначеЕсли ЗначениеПоиска = "OPERATOR" Тогда
		Результат = Перечисления.СпособыФормированияСерийногоНомераСУЗ.Автоматически;
	
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыФормированияСерийногоНомераСУЗ.Самостоятельно Тогда
		Результат =  "SELF_MADE";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыФормированияСерийногоНомераСУЗ.Автоматически Тогда
		Результат =  "OPERATOR";
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестный способ формирования серийного номера: %1'"),
				ЗначениеПоиска);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры для настройки обмена с СУЗ
//
// Возвращаемое значение:
// 	Структура - Параметры для настройки обмена с СУЗ:
// * Таймаут - Число - Таймаут
// * Порт - Число - Порт
// * Адрес - Строка - Адрес
// * Идентификатор - Строка - Адрес
// * Токен - Строка - Адрес
// * ФорматОбмена - ПеречислениеСсылка.ВерсииФорматаОбменаСУЗ - Формат обмена с СУЗ
Функция НоваяНастройкаОбменаСУЗ() Экспорт
	
	НастройкиОбмена = Новый Структура;
	НастройкиОбмена.Вставить("Сервер",                           "suz2.crpt.ru");
	НастройкиОбмена.Вставить("Порт",                             443);
	НастройкиОбмена.Вставить("Таймаут",                          60);
	НастройкиОбмена.Вставить("СтанцияУправленияЗаказами",        Справочники.СтанцииУправленияЗаказамиИСМП.ПустаяСсылка());
	НастройкиОбмена.Вставить("Идентификатор",                    "");
	НастройкиОбмена.Вставить("Токен",                            "");
	НастройкиОбмена.Вставить("ИмяПользователя",                  "");
	НастройкиОбмена.Вставить("ФорматОбмена",                     Неопределено);
	НастройкиОбмена.Вставить("ИспользоватьЗащищенноеСоединение", Ложь);
	НастройкиОбмена.Вставить("ПредставлениеСервиса",             НСтр("ru = 'СУЗ'"));
	НастройкиОбмена.Вставить("ДатаПоследнегоЗапроса",            '00010101');
	НастройкиОбмена.Вставить("ИнтервалМеждуЗапросами",           1);
	НастройкиОбмена.Вставить("ФоновоеЗадание",                   Неопределено);
	НастройкиОбмена.Вставить("ПолучатьКодовЗаИтерацию",          1000);
	НастройкиОбмена.Вставить("Организация",                      Неопределено);
	НастройкиОбмена.Вставить("ИдентификаторСоединения",          "");
	НастройкиОбмена.Вставить("ПроизводственныйОбъект",           Неопределено);
	НастройкиОбмена.Вставить("ПроизводственныйОбъектАдрес",      "");
	НастройкиОбмена.Вставить("КодФИАС",                          "");
	
	Возврат НастройкиОбмена;
	
КонецФункции

// Перекодирует целевой пол при получении новых GTIN маркировки остатков для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.ЦелевойПолИСМП - значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.ЦелевойПолИСМП - Результат перекодирования.
//
Функция ЦелевойПол(Знач ЗначениеПоиска) Экспорт
	
	Если ВРег(ЗначениеПоиска) = "MALE" Тогда
		Результат = Перечисления.ЦелевойПолИСМП.Мужская;
	ИначеЕсли ВРег(ЗначениеПоиска) = "FEMALE" Тогда
		Результат = Перечисления.ЦелевойПолИСМП.Женская;
	ИначеЕсли ВРег(ЗначениеПоиска) = "BABY" Тогда
		Результат = Перечисления.ЦелевойПолИСМП.Детская;
	ИначеЕсли ВРег(ЗначениеПоиска) = "UNISEX" Тогда
		Результат = Перечисления.ЦелевойПолИСМП.Унисекс;
		
	ИначеЕсли ЗначениеПоиска = Перечисления.ЦелевойПолИСМП.Унисекс Тогда
		Результат = "UNISEX";
	ИначеЕсли ЗначениеПоиска = Перечисления.ЦелевойПолИСМП.Детская Тогда
		Результат = "BABY";
	ИначеЕсли ЗначениеПоиска = Перечисления.ЦелевойПолИСМП.Женская Тогда
		Результат = "FEMALE";
	ИначеЕсли ЗначениеПоиска = Перечисления.ЦелевойПолИСМП.Мужская Тогда
		Результат = "MALE";
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестный целевой пол: %1'"),
				ЗначениеПоиска);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Перекодирует возрастную категорию при получении новых GTIN маркировки остатков для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.ВозрастныеКатегорииИСМП - значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.ВозрастныеКатегорииИСМП - Результат перекодирования.
//
Функция ВозрастнаяКатегория(Знач ЗначениеПоиска) Экспорт
	
	Если ВРег(ЗначениеПоиска) = "ADULT" Тогда
		Результат = Перечисления.ВозрастныеКатегорииИСМП.Взрослое;
	ИначеЕсли ВРег(ЗначениеПоиска) = "BABY" Тогда
		Результат = Перечисления.ВозрастныеКатегорииИСМП.Детское;
	ИначеЕсли ВРег(ЗначениеПоиска) = "NO_AGE" Тогда
		Результат = Перечисления.ВозрастныеКатегорииИСМП.БезВозраста;
		
	ИначеЕсли ЗначениеПоиска = Перечисления.ВозрастныеКатегорииИСМП.Взрослое Тогда
		Результат = "ADULT";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВозрастныеКатегорииИСМП.Детское Тогда
		Результат = "BABY";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВозрастныеКатегорииИСМП.БезВозраста Тогда
		Результат = "NO_AGE";
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестнав возрастная категория: %1'"),
				ЗначениеПоиска);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Перекодирует тип кода маркировки для обмена с СУЗ.
//
// Параметры:
//  ТипКодаМаркировки - ПеречислениеСсылка.ТипыКодовМаркировкиИСМП - значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка - тип кода маркировки строкой.
//
Функция ТипКодаМаркировкиСтрокой(ТипКодаМаркировки) Экспорт
	
	Если ТипКодаМаркировки = Перечисления.ТипыКодовМаркировкиИСМП.ГрупповаяУпаковка Тогда
		Результат = "GROUP";
	ИначеЕсли ТипКодаМаркировки = Перечисления.ТипыКодовМаркировкиИСМП.Набор Тогда
		Результат = "SET";
	ИначеЕсли ТипКодаМаркировки = Перечисления.ТипыКодовМаркировкиИСМП.Комплект Тогда
		Результат = "BUNDLE";
	Иначе
		Результат = "UNIT";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Перекодирует тип оплаты кодов маркировки для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.ТипыОплатыКодовМаркировкиСУЗ - значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.ТипыОплатыКодовМаркировкиСУЗ - Результат перекодирования.
//
Функция ТипОплатыКодовМаркировки(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = Перечисления.ТипыОплатыКодовМаркировкиСУЗ.ОплатаПоЭмиссии Тогда
		Результат = 1;
	ИначеЕсли ЗначениеПоиска = Перечисления.ТипыОплатыКодовМаркировкиСУЗ.ОплатаПоНанесению Тогда
		Результат = 2;
	
	ИначеЕсли ЗначениеПоиска = 1 Тогда
		Результат = Перечисления.ТипыОплатыКодовМаркировкиСУЗ.ОплатаПоЭмиссии;
	ИначеЕсли ЗначениеПоиска = 2 Тогда
		Результат = Перечисления.ТипыОплатыКодовМаркировкиСУЗ.ОплатаПоНанесению;
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестный тип оплаты кодов маркировки СУЗ: %1'"),
				ЗначениеПоиска);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Преобразует значение перечисления в код, который соответствует формату обмена с ИСМП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.СпособыПолученияИзготовленныхКИЗГИСМ - преобразуемое значение.
//
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.СпособыПолученияИзготовленныхКИЗГИСМ - Перекодированное значение.
//
Функция СпособПолученияИзготовленныхКИЗ(Знач ЗначениеПоиска) Экспорт

	Если ЗначениеПоиска = Перечисления.СпособыПолученияИзготовленныхКИЗГИСМ.СамостоятельноеПолучениеУЭмитента Тогда
		Результат = "SELF_OBTAIN";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыПолученияИзготовленныхКИЗГИСМ.ДоставкаЭмитентомДоУказанногоМеста Тогда
		Результат = "DELIVERY";
	ИначеЕсли ЗначениеПоиска = Перечисления.СпособыПолученияИзготовленныхКИЗГИСМ.ЧерезМногофункциональныйЦентр Тогда
		Результат = "MFC";

	ИначеЕсли ЗначениеПоиска = "SELF_OBTAIN" Тогда
		Результат = Перечисления.СпособыПолученияИзготовленныхКИЗГИСМ.СамостоятельноеПолучениеУЭмитента;
	ИначеЕсли ЗначениеПоиска = "DELIVERY" Тогда
		Результат = Перечисления.СпособыПолученияИзготовленныхКИЗГИСМ.ДоставкаЭмитентомДоУказанногоМеста;
	ИначеЕсли ЗначениеПоиска = "MFC" Тогда
		Результат = Перечисления.СпособыПолученияИзготовленныхКИЗГИСМ.ЧерезМногофункциональныйЦентр;
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестный способ получения изготовленных КИЗ: %1'"),
				ЗначениеПоиска);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Преобразует значение перечисления в код, который соответствует формату обмена с ИСМП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.ВидыКиЗГИСМ - преобразуемое значение.
//
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.ВидыКиЗГИСМ  - Перекодированное значение.
//
Функция ВидКИЗ(Знач ЗначениеПоиска) Экспорт

	Если ЗначениеПоиска = Перечисления.ВидыКиЗГИСМ.Вшивной Тогда
		Результат = "SEWN";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыКиЗГИСМ.Клеевой Тогда
		Результат = "GLUED";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыКиЗГИСМ.Навесной Тогда
		Результат = "HINGED";

	ИначеЕсли ЗначениеПоиска = "SEWN" Тогда
		Результат = Перечисления.ВидыКиЗГИСМ.Вшивной;
	ИначеЕсли ЗначениеПоиска = "GLUED" Тогда
		Результат = Перечисления.ВидыКиЗГИСМ.Клеевой;
	ИначеЕсли ЗначениеПоиска = "HINGED" Тогда
		Результат = Перечисления.ВидыКиЗГИСМ.Навесной;
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестный вид КИЗ: %1'"),
				ЗначениеПоиска);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Преобразует значение перечисления в код, который соответствует формату обмена с ИСМП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.РазмерыКиЗГИСМ - преобразуемое значение.
//
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.РазмерыКиЗГИСМ  - Перекодированное значение.
//
Функция РазмерКИЗ(Знач ЗначениеПоиска) Экспорт

	Если ЗначениеПоиска = Перечисления.РазмерыКиЗГИСМ.Размер25x160 Тогда
		Результат = "SMALL";
	ИначеЕсли ЗначениеПоиска = Перечисления.РазмерыКиЗГИСМ.Размер53x80 Тогда
		Результат = "BIG";

	ИначеЕсли ЗначениеПоиска = "SMALL" Тогда
		Результат = Перечисления.РазмерыКиЗГИСМ.Размер25x160;
	ИначеЕсли ЗначениеПоиска = "BIG" Тогда
		Результат = Перечисления.РазмерыКиЗГИСМ.Размер53x80;
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестный размер КИЗ: %1'"),
				ЗначениеПоиска);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция СтранаЭмиссииПоСерийномуНомеру(Знач КодСтраны) Экспорт
	
	Если КодСтраны = "1" Тогда
		Возврат Неопределено; // Республика Армения
	ИначеЕсли КодСтраны = "2" Тогда
		Возврат "112"; // Республика Беларусь
	ИначеЕсли КодСтраны = "3" Тогда
		Возврат "398"; // Республика Казахстан
	ИначеЕсли КодСтраны = "4" Тогда
		Возврат Неопределено; // Киргизская Республика
	ИначеЕсли КодСтраны = "5" Тогда
		Возврат Неопределено; // Российская Федерация
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
