
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КоличествоДокументов = ПараметрКоманды.Количество();
	ПараметрыКоманды = Новый Структура("ПараметрКоманды,ПараметрыВыполненияКоманды", ПараметрКоманды, ПараметрыВыполненияКоманды);
	
	Если КоличествоДокументов > 1  Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика("Вы собираетесь пометить на удаление " + КоличествоДокументов + " документов.
			|
			|Вы АБСОЛЮТНО уверены?",
			РежимДиалогаВопрос.ДаНетОтмена,
			"Подтвердите пометку удаления",
			,
			ЭтотОбъект,
			"КомандаПодтверждена",
			ПараметрыКоманды);
	Иначе
			
		КомандаПодтверждена(КодВозвратаДиалога.Да, ПараметрыКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтверждена(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ПометитьНаУдаление(Параметры.ПараметрКоманды);	
		ОповеститьОбИзменении(ТипЗнч(Параметры.ПараметрКоманды[0]));
		Оповестить("КонтурЛогистика_ОбновитьЗадачи", Параметры.ПараметрКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдаление(МассивУдаляемых)
	
	Для Каждого УдаляемыйДок Из МассивУдаляемых Цикл
		
		Если Не ЗначениеЗаполнено(УдаляемыйДок) Тогда 
			Продолжить;
		КонецЕсли;
		
		// Главный тоже пометим // TODO - надо сделать проверку что у главного есть еще другие титулы
		МассивУдаляемыхПоЭтомуДокументу = Новый Массив;
		МассивУдаляемыхПоЭтомуДокументу.Добавить(УдаляемыйДок);
		
		ГлавныйДокумент = КонтурЛогистика_ОбработкаДокументовСервер.ОпределитьГлавныйДокументПоТитулу(УдаляемыйДок);
		
		// если удаляем 1 титул - то удаляем и Главный
		Если ЗначениеЗаполнено(ГлавныйДокумент) И ТипЗнч(УдаляемыйДок) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1") Тогда
			МассивУдаляемыхПоЭтомуДокументу.Добавить(УдаляемыйДок.ДокументЭТРН);
		КонецЕсли;
		
		НетФайловОбмена = НЕ ЕстьАктивныеФайлыОбменаПоДокументам(МассивУдаляемыхПоЭтомуДокументу);
		
		Если НетФайловОбмена Тогда 
			
			// документы на удаление
			
			Для Каждого текУдаляемыйДок Из МассивУдаляемыхПоЭтомуДокументу Цикл
				ДокОбъект = текУдаляемыйДок.ПолучитьОбъект();
				ДокОбъект.УстановитьПометкуУдаления(Истина);
			КонецЦикла;
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(УдаляемыйДок, Перечисления.КонтурЛогистика_СтатусыТитулов.Удален);
			
		Иначе
			
			Сообщить("По документу " + УдаляемыйДок + " есть активные файлы обмена, нельзя удалить этот документ");
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЕстьАктивныеФайлыОбменаПоДокументам(МассивДокументовДляУдаления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ФайлыОбмена.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ФайлыОбмена КАК КонтурЛогистика_ФайлыОбмена
	|ГДЕ
	|	(КонтурЛогистика_ФайлыОбмена.ГлавныйДокумент В (&УдаляемыеДокументы)
	|			ИЛИ КонтурЛогистика_ФайлыОбмена.СвязанныйДокумент В (&УдаляемыеДокументы))
	|	И КонтурЛогистика_ФайлыОбмена.Состояние В(&СостоянияФайловПрепятствующиеУдалению)
	|	И НЕ КонтурЛогистика_ФайлыОбмена.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("УдаляемыеДокументы", МассивДокументовДляУдаления);
	Запрос.УстановитьПараметр("СостоянияФайловПрепятствующиеУдалению", Перечисления.КонтурЛогистика_СосотоянияФайловОбмена.СостоянияБлокирующиеУдалениеДокументов());
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции