///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПлатежныеСистемы".
// ОбщийМодуль.ПлатежныеСистемыСлужебный.
//
// Серверные процедуры обмена данными с платежной системой:
//  - инициализация параметров подключения;
//  - настройка форм подключения к платежной системе;
//  - работа с настройками оплаты;
//  - обработка прикладных операций;
//  - обработка служебных операций;
//  - обработка регламентных заданий.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ИнтеграцияСБиблиотекойСтандартныхПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
//
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ПодсказкиПлатежнойСистемы", Истина);
	Методы.Вставить("ПроверитьПараметрыПодключения", Истина);
	Методы.Вставить("ПроверитьПараметрыПодключенияНового", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбщегоНазначения

// Создает описание результат операции.
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция НовыйРезультатОперации() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("КодОшибки", "");
	Результат.Вставить("СообщениеОбОшибке", "");
	Результат.Вставить("ИнформацияОбОшибке", "");
	
	Возврат Результат;
	
КонецФункции

// Создает описание результата операции СтатусОперации.
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * СтатусОперации - Строка - текущее состояние операции в платежной системе.
//    * ПараметрыОперации - см. НовыйПараметрыОперации
//
Функция НовыйРезультатСтатусОперации() Экспорт
	
	ПараметрыОперации = НовыйПараметрыОперации();
	
	Результат = НовыйРезультатОперации();
	Результат.Вставить("СтатусОперации", "");
	Результат.Вставить("ПараметрыОперации", ПараметрыОперации);
	
	Возврат Результат;
	
КонецФункции

// Создает описание служебного результата операции СтатусОперации.
//
// Возвращаемое значение:
//  Структура - результат операции:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * СтатусОперации - Строка - текущее состояние операции в платежной системе.
//    * ПараметрыОперации - см. НовыйПараметрыОперации
//    * ОбновитьДатуЗапросаСтатуса - Булево - Истина, если необходимо обновить дату запроса статуса в базе данных.
//        Значение по умолчанию: Ложь.
//
Функция НовыйРезультатСтатусОперацииСлужебный() Экспорт
	
	Результат = НовыйРезультатСтатусОперации();
	Результат.Вставить("ОбновитьДатуЗапросаСтатуса", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Формирует декларативное описание реквизита формы.
//
// Параметры:
//  Имя - Строка - имя реквизита.
//  Синоним - Строка - синоним реквизита.
//  Тип - ОписаниеТипов - тип реквизита.
//
// Возвращаемое значение:
//  Структура:
//    * Имя - Строка - имя реквизита.
//    * Синоним - Строка - синоним реквизита.
//    * Тип - ОписаниеТипов - тип реквизита.
//    * РежимПароля - Булево - признак использования режима пароля.
//    * Подсказка - Строка - текст всплывающей подсказки.
//    * ПроверкаЗаполнения - Булево - режим проверки заполнения.
//    * СвязиПараметровВыбора - ФиксированныйМассив из СвязьПараметраВыбора - связи параметров выбора значений.
//    * ПараметрыВыбора - ФиксированныйМассив из ПараметрВыбора - параметры выбора значений.
//    * НастройкаПодключения - Булево - Истина, если реквизит хранит настройку подключения.
//
Функция НовыйОписаниеРеквизитов(Имя, Синоним, Тип) Экспорт
	
	ПустойМассив = Новый Массив();
	
	Результат = Новый Структура();
	Результат.Вставить("Имя", Имя);
	Результат.Вставить("Синоним", Синоним);
	Результат.Вставить("Тип", Тип);
	Результат.Вставить("РежимПароля", Ложь);
	Результат.Вставить("Подсказка", "");
	Результат.Вставить("ПроверкаЗаполнения", Ложь);
	Результат.Вставить("СвязиПараметровВыбора", Новый ФиксированныйМассив(ПустойМассив));
	Результат.Вставить("ПараметрыВыбора", Новый ФиксированныйМассив(ПустойМассив));
	
	Результат.Вставить(
		"НастройкаПодключения",
		Тип.СодержитТип(
			Тип("СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам")));
	
	Возврат Результат;
	
КонецФункции

// Проверяет, является ли переданное значение ссылкой на справочник с настройками подключения
//  к платежным системам.
//
// Параметры:
//  НастройкаПодключения - Произвольный - значение, которое необходимо проверить.
//
// Возвращаемое значение:
//  Булево - Истина, если переданное значение является ссылкой на справочник 
//   НастройкиПодключенияКПлатежнымСистемам.
//
Функция ЭтоНастройкаПодключения(НастройкаПодключения) Экспорт
	
	Возврат ТипЗнч(НастройкаПодключения) = Тип("СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам");
	
КонецФункции

// Возвращает идентификатор платежного сервиса по перечислению
//
// Параметры:
//  ПлатежныйСервис - ПеречислениеСсылка.ПлатежныеСервисы - значение перечисления.
//
// Возвращаемое значение:
//  Строка - Строковый идентификатор платежной системы.
//
Функция ИдентификаторПлатежногоСервиса(ПлатежныйСервис) Экспорт
	
	Если ПлатежныйСервис = ПредопределенноеЗначение("Перечисление.ПлатежныеСервисы.ОзонПэй") Тогда
		Возврат НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыОзонПэй();
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПрикладныеОперации

// См. ПлатежныеСистемы.ВозвратОплаты
//
Функция ВозвратОплаты(ДокументВозврата, ДокументОплаты, НастройкаПодключения, ДополнительныеПараметры) Экспорт
	
	ПроверитьПраваНаВыполнениеОперации();
	
	Результат = НовыйРезультатСтатусОперации();
	
	ПараметрыНастройкиПодключения = Справочники.НастройкиПодключенияКПлатежнымСистемам.ПараметрыНастройкиПодключения(
		НастройкаПодключения);
	
	РезультатПроверки = ПроверитьОбщиеПараметрыОперации(
		ДокументВозврата,
		НастройкаПодключения,
		ПараметрыНастройкиПодключения);
	Если Не ПустаяСтрока(РезультатПроверки.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(
			Результат,
			РезультатПроверки,
			"КодОшибки,СообщениеОбОшибке,ИнформацияОбОшибке");
		Возврат Результат;
	КонецЕсли;
	
	ПлатежныеСистемыСобытия.ПриСозданииВозвратаОплаты(
		ДокументВозврата,
		ДокументОплаты,
		ПараметрыНастройкиПодключения,
		ДополнительныеПараметры,
		Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СтатусОперации

// Выполняет получение статуса операции в платежной системе.
// Если терминальный статус операции был загружен ранее, то метод вернет информацию из базы данных, в противном случае
// будет выполнен запрос к сервису платежной системы.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе.
//  ВремяОжидания - Число - время ожидания терминального статуса в секундах.
//    Если параметр заполнен, то получение статуса будет выполняться в цикле с небольшими задержками между запросами.
//    Значение по умолчанию: 0 (один запрос).
//  ЗапросНаличияСтатуса - Булево - если Истина, будет выполнен запрос наличия статуса.
//
// Возвращаемое значение:
//  см. НовыйРезультатСтатусОперации
//
Функция СтатусОперации(ДокументОперации, ВремяОжидания, ЗапросНаличияСтатуса = Истина) Экспорт
	
	ПроверитьПраваНаВыполнениеОперации();
	
	Результат = НовыйРезультатСтатусОперации();
	СписокСвойствОшибки = "КодОшибки,СообщениеОбОшибке,ИнформацияОбОшибке";
	
	// Чтение сохраненных данных под документу операции
	ПараметрыСтатуса = ПараметрыОпределенияСтатусаОперации(ДокументОперации);
	Если ПараметрыСтатуса = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Данные операции платежной системы по документу %1 не найдены. Обратитесь к администратору.'"),
			Строка(ДокументОперации));
	ИначеЕсли ПустаяСтрока(ПараметрыСтатуса.ИдентификаторОплаты) Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'По документу %1 отсутствует информация о выполнении операции в платежной системе.
				|Необходимо повторно выполнить операцию.'"),
			Строка(ДокументОперации));
	КонецЕсли;
	
	// Если ранее был получен терминальный статус, то вернем его
	Если ТерминальныйСтатус(ПараметрыСтатуса.СтатусОперации) Тогда
		
		Результат.СтатусОперации = ПараметрыСтатуса.СтатусОперации;
		ЗаполнитьЗначенияСвойств(
			Результат.ПараметрыОперации,
			ПараметрыСтатуса,
			"ИдентификаторОперации,ИдентификаторОплаты,ДатаОперации,СуммаОперации");
		Результат.ПараметрыОперации.ТипОперации = ?(ПараметрыСтатуса.Оплата,
			ПлатежныеСистемыКлиентСервер.ТипОперацииОплата(),
			ПлатежныеСистемыКлиентСервер.ТипОперацииВозврат());
		
		Возврат Результат;
		
	КонецЕсли;
	
	// Подготовка параметров настройки подключения
	ПараметрыНастройкиПодключения = Справочники.НастройкиПодключенияКПлатежнымСистемам.ПараметрыНастройкиПодключения(
		ПараметрыСтатуса.НастройкаПодключения);
	
	// Проверка общих параметров подключения
	РезультатПроверки = ПроверитьОбщиеПараметрыОперации(
		ДокументОперации,
		ПараметрыСтатуса.НастройкаПодключения,
		ПараметрыНастройкиПодключения);
	Если Не ПустаяСтрока(РезультатПроверки.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(Результат, РезультатПроверки, СписокСвойствОшибки);
		Результат.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОшибка();
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыВызова  = НастройкиПлатежныхСистемСлужебный.НовыйИтеративныйВызовОперации(ВремяОжидания);
	ПоследняяПопытка = (ПараметрыСтатуса.Оплата
		И ПараметрыСтатуса.ДатаДействияСсылки <> Дата(1, 1, 1)
		И (ПараметрыСтатуса.ДатаДействияСсылки + 600) < ТекущаяУниверсальнаяДата());
	Если ПоследняяПопытка Тогда
		// При окончании срока действия платежной ссылки, выполняется проверка статуса операции и регистрация отмены
		// динамической ссылки в ИБ, если операция так и не была завершена.
		ПараметрыВызова.МаксимальноеКоличествоЗапросов = 1;
	КонецЕсли;
	
	ВыполненВызов = Ложь;
	
	Пока НастройкиПлатежныхСистемСлужебный.ВозможенВызовОперации(ПараметрыВызова) Цикл
		
		РезультатПроверки = НовыйРезультатСтатусОперацииСлужебный();
		ПлатежныеСистемыСобытия.ПриПолученииСтатусаОперации(
			ПараметрыСтатуса,
			ПараметрыНастройкиПодключения,
			ЗапросНаличияСтатуса,
			РезультатПроверки);
		
		ВыполненВызов = Истина;
		
		Если Не ПустаяСтрока(РезультатПроверки.КодОшибки) Тогда
			ЗаполнитьЗначенияСвойств(Результат, РезультатПроверки, СписокСвойствОшибки);
			Результат.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОшибка();
			Возврат Результат;
		КонецЕсли;
		
		Если РезультатПроверки.ОбновитьДатуЗапросаСтатуса Тогда
			ПараметрыСтатуса.ДатаЗапросаСтатуса = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		
		Если ТерминальныйСтатус(РезультатПроверки.СтатусОперации) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ВыполненВызов Тогда
		Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеизвестнаяОшибка();
		Результат.СообщениеОбОшибке = НСтр(
			"ru = 'Не удалось получить статус операции за отведенное время. Повторите попытку.'");
		Результат.ИнформацияОбОшибке = НСтр(
			"ru = 'Не удалось получить статус операции за отведенное время. Повторите попытку.'");
		Возврат Результат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, РезультатПроверки);
	
	Если ПоследняяПопытка
		И Результат.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется() Тогда
		
		Результат.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена();
		
	КонецЕсли;
	
	ДанныеОперации = НовыйОбновляемыеДанныеОперации();
	ДанныеОперации.СтатусОперации = Результат.СтатусОперации;
	ДанныеОперации.ИдентификаторОперации = Результат.ПараметрыОперации.ИдентификаторОперации;
	ДанныеОперации.ДатаОперации = Результат.ПараметрыОперации.ДатаОперации;
	ДанныеОперации.СуммаОперации = Результат.ПараметрыОперации.СуммаОперации;
	Если РезультатПроверки.ОбновитьДатуЗапросаСтатуса Тогда
		ДанныеОперации.ДатаЗапросаСтатуса = ПараметрыСтатуса.ДатаЗапросаСтатуса;
	КонецЕсли;
	
	РегистрыСведений.ИдентификаторыПлатежныхСистем.ЗаписатьДанныеОперации(ДокументОперации, ДанныеОперации);
	
	Возврат Результат;
	
КонецФункции

// Получает данные для определения статуса выполнения операции в платежной системе.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ отражающий операцию в информационной
//    базе.
//
// Возвращаемое значение:
//  Неопределено - данные операции не найдены.
//  Структура:
//    * Идентификатор - Строка - внутренний идентификатор операции.
//    * ИдентификаторОперации - Строка -идентификатор операции в платежной системе.
//    * ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе.
//    * Оплата - Булево - Истина, если тип операции "Оплата", Ложь - "Возврат".
//    * СтатусОперации - Строка - статус операции в платежной системе.
//    * ДатаДействияСсылки - Дата - дата действия платежной ссылки в UTC.
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к
//        сервису.
//    * ДатаЗапросаСтатуса - Дата - дата последней операции получения статуса в UTC.
//
Функция ПараметрыОпределенияСтатусаОперации(ДокументОперации) Экспорт
	
	ПараметрыСтатуса = РегистрыСведений.ИдентификаторыПлатежныхСистем.ПараметрыОпределенияСтатусаОперации(
		ДокументОперации);
	
	Если ПараметрыСтатуса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("Идентификатор", ПараметрыСтатуса.Идентификатор);
	Результат.Вставить("ИдентификаторОперации", ПараметрыСтатуса.ИдентификаторОперации);
	Результат.Вставить("ИдентификаторОплаты", ПараметрыСтатуса.ИдентификаторОплаты);
	Результат.Вставить("Оплата", ПараметрыСтатуса.Оплата);
	Результат.Вставить("СтатусОперации", ПараметрыСтатуса.СтатусОперации);
	Результат.Вставить("ДатаОперации", ПараметрыСтатуса.ДатаОперации);
	Результат.Вставить("СуммаОперации", ПараметрыСтатуса.СуммаОперации);
	Результат.Вставить("ДатаДействияСсылки", ПараметрыСтатуса.ДатаДействияСсылки);
	Результат.Вставить("НастройкаПодключения", ПараметрыСтатуса.НастройкаПодключения);
	Результат.Вставить("ДатаЗапросаСтатуса", ПараметрыСтатуса.ДатаЗапросаСтатуса);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ДанныеОперации

// Формирует данные операции по документу.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе.
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//    * ИдентификаторОперации - Строка - идентификатор операции в платежной системе.
//    * ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе.
//    * СтатусОперации - Строка - текущее состояние операции.
//    * ДатаОперации - Дата - фактическая дата операции в UTC.
//    * СуммаОперации - Число - фактическая сумма операции по документу.
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к
//        сервису.
//    * ПлатежнаяСсылка - Строка - адрес страницы по которой выполняется оплата.
//    * ДатаДействияСсылки - Дата - дата действия платежной ссылки в UTC.
//
Функция ДанныеОперации(ДокументОперации) Экспорт
	
	ДанныеОперации = РегистрыСведений.ИдентификаторыПлатежныхСистем.ДанныеОперации(ДокументОперации);
	Если ДанныеОперации = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Данные операции платежной системы по документу %1 не найдены. Обратитесь к администратору.'"),
			Строка(ДокументОперации));
	КонецЕсли;
	
	Возврат ДанныеОперации;
	
КонецФункции

// Формирует данные операций по документам. В результат попадает информация только о найденных документах.
//
// Параметры:
//  ДокументыОпераций - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы,
//    Массив Из ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ или массив документов, отражающие
//    операцию в информационной базе.
//
// Возвращаемое значение:
//  РезультатЗапроса - данные операций, содержащие следующие поля:
//    * ДокументыОпераций - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, отражающий
//        операцию в информационной базе.
//    * Идентификатор - Строка - внутренний идентификатор операции.
//    * ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе.
//    * ИдентификаторОперации - Строка - идентификатор операции в платежной системе.
//    * СтатусОперации - Строка - статус операции в платежной системе.
//    * ДатаОперации - Дата - фактическая дата операции в UTC.
//    * СуммаОперации - Число - фактическая сумма операции.
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к
//        сервису.
//    * ПлатежнаяСсылка - Строка - адрес страницы по которой выполняется оплата.
//    * ДатаДействияСсылки - Дата - дата действия платежной ссылки в UTC.
//    * СпособОплаты - Строка - способ оплаты. Доступные значения определяются методами
//        общего модуля ПлатежныеСистемыКлиентСервер.
//
Функция ДанныеОпераций(ДокументыОпераций) Экспорт
	
	Возврат РегистрыСведений.ИдентификаторыПлатежныхСистем.ДанныеОпераций(ДокументыОпераций);
	
КонецФункции

// Формирует описание обновляемых данных регистра сведений ИдентификаторыПлатежныхСистем.
// Изначально все ключи имеют тип Неопределено. Если при вызове метода см. ЗаписатьДанныеОперации ключ будет с типом
// Неопределено, то обновление данных этого ключа выполняться не будет.
//
// Возвращаемое значение:
//  Структура:
//    * ИдентификаторОплаты - Неопределено, Строка - идентификатор оплаты в платежной системе.
//    * ИдентификаторОперации - Неопределено, Строка - идентификатор операции в платежной системе.
//    * СтатусОперации - Неопределено, Строка - статус операции.
//    * ДатаОперации - Неопределено, Дата - фактическая дата операции в UTC.
//    * СуммаОперации - Неопределено, Число - фактическая сумма операции.
//    * ПлатежнаяСсылка - Неопределено, Строка - адрес страницы по которой выполняется оплата.
//    * ДатаДействияСсылки - Неопределено, Дата - дата действия платежной ссылки в UTC.
//    * ДатаЗапросаСтатуса - Неопределено, Дата - дата последней операции получения статуса.
//    * СпособОплаты - Неопределено, Строка - способ оплаты. Доступные значения определяются методами
//        общего модуля ПлатежныеСистемыКлиентСервер.
//
Функция НовыйОбновляемыеДанныеОперации() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ИдентификаторОплаты", Неопределено);
	Результат.Вставить("ИдентификаторОперации", Неопределено);
	Результат.Вставить("СтатусОперации", Неопределено);
	Результат.Вставить("ДатаОперации", Неопределено);
	Результат.Вставить("СуммаОперации", Неопределено);
	Результат.Вставить("ПлатежнаяСсылка", Неопределено);
	Результат.Вставить("ДатаДействияСсылки", Неопределено);
	Результат.Вставить("ДатаЗапросаСтатуса", Неопределено);
	Результат.Вставить("СпособОплаты", Неопределено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЖурналРегистрации

// Добавляет запись в журнал регистрации с указанием имени события подсистемы платежных систем.
//
// Параметры:
//  Сообщение - Строка - комментарий к записи журнала регистрации.
//  Ошибка - Булево - если Истина, то будет установлен уровень журнала регистрации "Ошибка".
//    Значение по умолчанию: Ложь.
//
Процедура ЗаписатьИнформациюВЖурналРегистрации(Сообщение, Ошибка = Ложь) Экспорт
	
	УровеньЖурнала = ?(
		Ошибка,
		УровеньЖурналаРегистрации.Ошибка,
		УровеньЖурналаРегистрации.Информация);	// УровеньЖурналаРегистрации
	
	ЗаписьЖурналаРегистрации(
		ПлатежныеСистемыКлиентСервер.ИмяСобытияЖурналаРегистрации(
			ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурнала,
		,
		,
		Лев(Сообщение, 5120));
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияПодсистемИнтернетПоддержкиПользователей

#Область ОбщиеНастройкиПлатежныхСистем

// Формирует дерево для формы общих настроек платежных систем
// 
// Параметры:
//  Дерево - ДеревоЗначений - дерево, которое необходимо заполнить.
//    см. НастройкиПлатежныхСистемСлужебный.НовыйДеревоНастроек.
//  ПараметрыДерева - Структура - параметры вывода дерева.
//    см. НастройкиПлатежныхСистемСлужебный.НовыйПараметрыДерева.
//  ИмяПодсистемы - Строка - Имя подсистемы, которую нужно вывести.
//
Процедура ПриФормированииДереваПоПодсистеме(
		Дерево,
		ПараметрыДерева,
		ИмяПодсистемы) Экспорт
	
	ОписаниеПодсистемы = НастройкиПлатежныхСистемПовтИсп.ОписаниеПлатежныхСервисов().Получить(ИмяПодсистемы);
	Если ОписаниеПодсистемы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.Ссылка КАК Ссылка,
	|	0 КАК Картинка,
	|	ВЫБОР
	|		КОГДА НЕ Настройки.Используется
	|			ТОГДА ""НеИспользуется""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИдентификаторУсловногоОформления,
	|	ЛОЖЬ КАК ЭтоГруппа
	|ИЗ
	|	Справочник.НастройкиПодключенияКПлатежнымСистемам КАК Настройки
	|ГДЕ
	|	НЕ Настройки.ПометкаУдаления
	|	И &Отбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Настройки.Наименование";
	
	Отбор = Новый Массив;
		
	Отбор.Добавить("Настройки.ПлатежнаяСистема = &ПлатежнаяСистема");
	Запрос.УстановитьПараметр("ПлатежнаяСистема", ОписаниеПодсистемы.ПлатежныйСервис);
	
	ОбрабатываемыеПараметры = Новый Структура;
	ОбрабатываемыеПараметры.Вставить("Отбор", Неопределено);
	
	Если ТипЗнч(ПараметрыДерева.ПараметрыПодсистемы) = Тип("Структура")
		Или ТипЗнч(ПараметрыДерева.ПараметрыПодсистемы) = Тип("ФиксированнаяСтруктура") Тогда
		ЗаполнитьЗначенияСвойств(ОбрабатываемыеПараметры, ПараметрыДерева.ПараметрыПодсистемы);
	КонецЕсли;
	
	// Произвольные отборы
	НастройкиПлатежныхСистемСлужебный.ДополнитьЗапросСтандартнымОтбором(
		Отбор,
		ОбрабатываемыеПараметры.Отбор,
		Запрос);
	
	Если Отбор.Количество() = 0 Тогда
		ТекстЗамены = "ИСТИНА";
	Иначе
		ТекстЗамены = СтрСоединить(Отбор, " И ");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст,
		"&Отбор",
		ТекстЗамены);

	НастройкиПлатежныхСистемСлужебный.ЗапросВДерево(Запрос, Дерево);
	
	ПараметрыДерева.ВыводитьПодсистему = Истина;
	
	// Условное оформление
	УсловноеОформление = НастройкиПлатежныхСистемСлужебный.НовыйНастройкиУсловногоОформления();
	
	Оформление = НастройкиПлатежныхСистемСлужебный.НовыйПараметрыОформления();
	Оформление.ИмяПараметра = "ЦветТекста";
	Оформление.ЗначениеПараметра = ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;

	Условие = НастройкиПлатежныхСистемСлужебный.НовыйУсловиеОформления();
	Условие.ЛевоеЗначение = "ИдентификаторУсловногоОформления";
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = "НеИспользуется";
	
	УсловноеОформление.Оформление.Добавить(Оформление);
	УсловноеОформление.Условия.Добавить(Условие);
	УсловноеОформление.ОформляемыеПоля.Добавить("Ссылка");
	
	ПараметрыДерева.УсловноеОформление.Добавить(УсловноеОформление);
	
КонецПроцедуры

// Определяет прикладные настройки подключения к сервису.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы
//
// Возвращаемое значение:
//  Структура - настройки подключения:
//    * ОбъектМетаданных - ОбъектМетаданныхРегистрСведений - объект метаданных регистр сведений, в котором хранятся
//        настройки выполнения оплат. Регистр определяет связь торговой точки платежной системы и аналитики ведения
//        учета в программах 1С. На основании данных регистра должен выполняется поиск настройки подключения при
//        выполнении оплат и возвратов.
//    * ИсключаемыеПоля - Массив из Строка - наименования измерений, ресурсов или реквизитов, которые необходимо скрыть
//        на форме настройки подключения.
//    * ШаблоныНазначений - см. НастройкиПлатежныхСистемСлужебный.НовыйШаблоныНазначений.
//
Функция НастройкиПодключения(Знач ПлатежнаяСистема) Экспорт
	
	ОбъектМетаданных = Неопределено;	// ОбъектМетаданныхРегистрСведений
	ИсключаемыеПоля  = Новый Массив();	// Массив из Строка
	
	Результат = Новый Структура();
	Результат.Вставить("ОбъектМетаданных" , ОбъектМетаданных);
	Результат.Вставить("ИсключаемыеПоля", ИсключаемыеПоля);
	Результат.Вставить("ШаблоныНазначений", НастройкиПлатежныхСистемСлужебный.НовыйШаблоныНазначений());
	
	ПараметрыНастройки = Новый Структура();
	ПараметрыНастройки.Вставить("ПлатежнаяСистема", ПлатежнаяСистема);
	
	ИнтеграцияПодсистемБИП.ПриОпределенииНастроекПодключенияКПлатежнойСистеме(
		ПараметрыНастройки,
		Результат);
	ПлатежныеСистемыПереопределяемый.ПриОпределенииНастроекПодключения(
		ПараметрыНастройки,
		Результат);
	
	Ошибки = Новый Массив;
	
	Если Результат.ОбъектМетаданных = Неопределено Тогда
		Ошибки.Добавить(НСтр("ru = 'Не указан объект метаданных отвечающий за настройку параметров оплаты.'"));
	КонецЕсли;
	
	НастройкиПлатежныхСистемСлужебный.ПроверитьШаблоныНазначений(
		Результат.ШаблоныНазначений,
		Ошибки);

	Если Ошибки.Количество() > 0 Тогда
		ОшибкиПроверки = СтрСоединить(Ошибки, Символы.ПС);
		ВызватьИсключение ОшибкиПроверки;
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

// Определяет доступность использования функциональности чтения настроек на основании прав доступа пользователя.
//
// Возвращаемое значение:
//  Булево - если Истина, чтение операций доступно.
//
Функция ЧтениеНастроекДоступно() Экспорт
	
	Возврат ПравоДоступа("Чтение", Метаданные.Справочники.НастройкиПодключенияКПлатежнымСистемам);
	
КонецФункции

// Возвращает идентификатор платежной системы для указанной настройки подключения к платежной системе.
// 
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка, для которой нужно
//    получить идентификатор платежной системы.
//  
// Возвращаемое значение:
//  Строка - идентификатор. Допустимые значения: "ОзонПэй". Пустая строка - не удалось определить платежную систему.
//  
Функция ИдентификаторПлатежнойСистемыПоНастройке(НастройкаПодключения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НастройкиПодключения.ПлатежнаяСистема = ЗНАЧЕНИЕ(Перечисление.ПлатежныеСервисы.ОзонПэй)
	|			ТОГДА &ОзонПэй
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИдентификаторПлатежнойСистемы
	|ИЗ
	|	Справочник.НастройкиПодключенияКПлатежнымСистемам КАК НастройкиПодключения
	|ГДЕ
	|	НастройкиПодключения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", НастройкаПодключения);
	Запрос.УстановитьПараметр(
		"ОзонПэй",
		НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыОзонПэй());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИдентификаторПлатежнойСистемы;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Возвращает тип данных СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам.
//
// Возвращаемое значение:
//  Тип - тип данных ссылка на справочник НастройкиПодключенияКПлатежнымСистемам.
//
Функция ТипНастройкаПодключения() Экспорт
	
	Возврат Тип("СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам");
	
КонецФункции

// Определяет по имени подсистему, подчиненную подсистеме ИнтернетПоддержкаПользователей.ПлатежныеСистемы.
//
// Параметры:
//  ИмяПодсистемы - Строка - имя подсистемы, которую необходимо получить.
//
//  Возвращаемое значение:
//    Неопределено - подсистема не найдена.
//    ОбъектМетаданных - найденная подсистема.
Функция ПодсистемаПоИмени(ИмяПодсистемы) Экспорт
	
	Возврат Метаданные.Подсистемы.ИнтернетПоддержкаПользователей.Подсистемы.ПлатежныеСистемы.Подсистемы.Найти(ИмяПодсистемы);
	
КонецФункции

#КонецОбласти

#Область ОнлайнЗаказы

// Выполняет заполнение параметров оплат через Платежные системы документа операции.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииИнтернетЭквайринга - документ, для которого формируются
//    параметры оплат.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к 
//    платежным системам
//  
// Возвращаемое значение:
//  Структура - параметры оплат:
//    * ШаблоныНазначения - см. НастройкиПлатежныхСистемСлужебный.НовыйШаблоныНазначений.
//    * НазначениеПлатежа - Строка - назначение платежа для оплаты через платежные системы
//
Функция ПараметрыОплаты(ДокументОперации, НастройкаПодключения) Экспорт
	
	ПараметрыОплаты = Новый Структура;
	ПараметрыОплаты.Вставить("НазначениеПлатежа", "");
	ПараметрыОплаты.Вставить("ШаблоныНазначения", Новый ТаблицаЗначений);
	
	ПараметрыОплаты.ШаблоныНазначения = РегистрыСведений.ШаблоныНазначенийПлатежей.ШаблоныНазначенийДокументаОперации(
		НастройкаПодключения,
		ДокументОперации);
	
	Возврат ПараметрыОплаты;

КонецФункции

// Определяет идентификатор способа оплаты Онлайн заказов по платежной системе.
// 
// Параметры:
//  ПлатежныйСервис - ПеречислениеСсылка.ПлатежныеСервисы - платежный сервис, для которого нужно получить идентификатор.
// 
// Возвращаемое значение:
//  Строка - идентификатор способа оплаты
// 
Функция ИдентификаторСпособаОплатыОнлайнЗаказов(ПлатежныйСервис) Экспорт
	
	Если ПлатежныйСервис = Перечисления.ПлатежныеСервисы.ОзонПэй Тогда
		Возврат НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыОзонПэй();
	Иначе
		Возврат "Прочее";
	КонецЕсли
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОперацииСТокенамиСервиса

// Получает токен сервиса для переданной настройки подключения.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к платежной
//    системе.
//  ИмяСервиса - Строка - имя сервиса в котором будет использоваться токен.
//
// Возвращаемое значение:
//  Структура - результат получения токена:
//    * Токен - Строка, Неопределено - токен сервиса. Неопределено, если токен не найден.
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ТокенСпособаОплаты(
	НастройкаПодключения,
	ИмяСервиса) Экспорт
	
	РезультатОперации = НовыйРезультатОперации();
	РезультатОперации.Вставить("Токен", Неопределено);
	
	Если Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
		РезультатОперации.СообщениеОбОшибке = НСтр("ru = 'Не заполнена настройка подключения к платежной системе.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Не заполнена настройка подключения к платежной системе.'");
		Возврат РезультатОперации;
	КонецЕсли;
	
	ИдентификаторСервиса = НастройкиПлатежныхСистемСлужебный.ИдентификаторСервисаПоИмени(ИмяСервиса);
	
	Если ИдентификаторСервиса = Неопределено Тогда
		РезультатОперации.СообщениеОбОшибке  = НСтр("ru = 'Передано неизвестное имя сервиса.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Передано неизвестное имя сервиса.'");
		Возврат РезультатОперации;
	КонецЕсли;
	
	ПараметрыНастройки = Справочники.НастройкиПодключенияКПлатежнымСистемам.ПараметрыНастройкиПодключения(
		НастройкаПодключения);
	
	Если Не ПараметрыНастройки.Используется Тогда
		Возврат РезультатОперации;
	КонецЕсли;

	ДанныеТокенаСервиса = ПолучитьСохраненныйТокен(НастройкаПодключения, ИмяСервиса);
	
	Если Не ПустаяСтрока(ДанныеТокенаСервиса.Токен) Тогда
		РезультатОперации.Токен = ДанныеТокенаСервиса.Токен;
		Возврат РезультатОперации;
	Иначе
		
		ИдентификаторТокена = Строка(Новый УникальныйИдентификатор);
		
		РезультатВызова = ПлатежныеСистемыСервис.ОперацияЗапросТокенаАутентификацииСервиса(
			НастройкаПодключения,
			ИдентификаторТокена,
			ИмяСервиса);
		
		Если Не ПустаяСтрока(РезультатВызова.КодОшибки) Тогда
			ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатВызова);
			Возврат РезультатОперации;
		КонецЕсли;
		
		ДанныеТокенаСервиса.Токен = РезультатВызова.Токен;
		ДанныеТокенаСервиса.Идентификатор = ИдентификаторТокена;
		
		СохранитьТокенСервиса(
			НастройкаПодключения,
			ИмяСервиса,
			ДанныеТокенаСервиса);
		
		РезультатОперации.Токен = РезультатВызова.Токен;
		
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

// Отзывает токены сервиса для переданной настройки подключения.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к платежной
//    системе.
//  РезультатОперации - Структура - результат получения токена:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//  ИмяСервиса - Строка - имя сервиса в котором использовались токены.
//
Процедура ОтозватьТокенСпособаОплаты(
	НастройкаПодключения,
	РезультатОперации,
	ИмяСервиса) Экспорт
	
	Если Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
		РезультатОперации.СообщениеОбОшибке = НСтр("ru = 'Не заполнена настройка подключения'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Не заполнена настройка подключения.'");
		Возврат;
	КонецЕсли;
	
	ОтозватьТокен(НастройкаПодключения,  ИмяСервиса, РезультатОперации)
	
КонецПроцедуры

// Отзывает токены сервиса для неиспользуемых сервисом настроек подключения.
//
// Параметры:
//  НастройкаПодключения - Массив Из СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам -
//  используемые сервисом настройки подключения к платежной системе.
//  ИмяСервиса - Строка - имя сервиса в котором использовались токены.
//  ИдентификаторПлатежнойСистемы - Строка - Идентификатор варианта платежной системы.
//  РезультатОперации - Структура - результат получения токена:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Процедура ПриРевизииТокенов(
	ИспользуемыеНастройки,
	ИмяСервиса,
	ИдентификаторПлатежногоСервиса,
	РезультатОперации) Экспорт
	
	НастройкиПодключения = Справочники.НастройкиПодключенияКПлатежнымСистемам.НастройкиПодключенияПоСервису(
		ПлатежныйСервисПоИдентификатору(ИдентификаторПлатежногоСервиса));
	
	Для Каждого НастройкаПодключения Из НастройкиПодключения Цикл
		
		Если ИспользуемыеНастройки.Найти(НастройкаПодключения.Ссылка) <> Неопределено
			И НастройкаПодключения.Используется Тогда
			Продолжить;
		КонецЕсли;
		
		ОтозватьТокен(
			НастройкаПодключения.Ссылка,
			ИмяСервиса,
			РезультатОперации);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщегоНазначения

// Формирует список доступных для использования платежных систем.
//
// Возвращаемое значение:
//  СписокЗначений из ПеречислениеСсылка.ПлатежныеСервисы
//
Функция ДоступныеПлатежныеСистемы() Экспорт
	
	Результат = Новый СписокЗначений();	// СписокЗначений из ПеречислениеСсылка.ПлатежныеСервисы
	
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ПлатежныеСервисы.ЗначенияПеречисления Цикл
		ПлатежнаяСистема = Перечисления.ПлатежныеСервисы[ЗначениеПеречисления.Имя];
		Если ПлатежнаяСистемаДоступна(ПлатежнаяСистема) Тогда
			Результат.Добавить(ПлатежнаяСистема, ЗначениеПеречисления.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Выполняет проверку доступности использования переданной платежной системы.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - проверяемая платежная система. Если параметр не заполнен,
//    то будет вызвано исключение.
//
// Возвращаемое значение:
//  Булево - Истина, если переданная платежная система доступна для использования.
//
Функция ПлатежнаяСистемаДоступна(ПлатежнаяСистема) Экспорт
	
	Результат = Истина;
	
	Если ПлатежнаяСистема.Пустая() Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнено значение параметра ""ПлатежнаяСистема"".'");
	ИначеЕсли ПлатежнаяСистема = Перечисления.ПлатежныеСервисы.ОзонПэй Тогда
		Результат = ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй");
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неклассифицированное значение параметра ""ПлатежнаяСистема"": %1'"),
			Строка(ПлатежнаяСистема));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет права на вызов прикладных операций платежной системы. В случае отсутствия прав, вызывается исключение.
//
Процедура ПроверитьПраваНаВыполнениеОперации() Экспорт
	
	Если Не ПлатежныеСистемы.ОперацииДоступны() Тогда
		ВызватьИсключение НСтр(
			"ru = 'Нарушение прав доступа. Пользователю запрещено выполнение операций с платежными системами.
				|Обратитесь к администратору.'");
	КонецЕсли;
	
КонецПроцедуры

// Производит валидацию общих параметров заказа.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//  ПараметрыНастройкиПодключения - см. Справочники.НастройкиПодключенияКПлатежнымСистемам.ПараметрыНастройкиПодключения
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения:
//          "" - нет ошибок.
//          см. КодОшибкиНеверныйФорматЗапроса - не передан документ операции или настройка подключения к сервису.
//          см. КодОшибкиИнтеграцияНеИспользуется - настройка подключения неактивна.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ПроверитьОбщиеПараметрыОперации(ДокументОперации, НастройкаПодключения, ПараметрыНастройкиПодключения)
	
	Результат = НовыйРезультатОперации();
	
	Если Не ЗначениеЗаполнено(ДокументОперации) Тогда
		
		Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйФорматЗапроса();
		Результат.СообщениеОбОшибке  = НСтр(
			"ru = 'Документ для выполнения операции неопределен. Обратитесь к администратору.'");
		Результат.ИнформацияОбОшибке = НСтр("ru = 'Для выполнения операции необходимо записать документ.'");
		
		ЗаписатьИнформациюВЖурналРегистрации(Результат.ИнформацияОбОшибке, Истина);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
		
		Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйФорматЗапроса();
		Результат.СообщениеОбОшибке = НСтр(
			"ru = 'Настройка подключения к платежной системе не определена. Обратитесь к администратору.'");
		Результат.ИнформацияОбОшибке = НСтр(
			"ru = 'Для выполнения операции с платежной системой необходимо выполнить настройку подключения.'");
		
		ЗаписатьИнформациюВЖурналРегистрации(Результат.ИнформацияОбОшибке, Истина);
		
	ИначеЕсли Не ПараметрыНастройкиПодключения.Используется Тогда
		
		Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиИнтеграцияНеИспользуется();
		Результат.СообщениеОбОшибке = НСтр(
			"ru = 'Настройка подключения не используется. Обратитесь к администратору.'");
		Результат.ИнформацияОбОшибке = НСтр("ru = 'Настройка подключения не используется.'");
		
		ЗаписатьИнформациюВЖурналРегистрации(Результат.ИнформацияОбОшибке, Истина);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет принадлежность статуса сервиса платежной системы к финальному состоянию.
//
// Параметры:
//  Статус - Строка - преобразованный статус сервиса платежной системы.
//
// Возвращаемое значение:
//  Булево - если Истина, то статус является окончательным.
//
Функция ТерминальныйСтатус(Статус) Экспорт
	
	Возврат Статус = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена()
		Или Статус = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена();
	
КонецФункции

// Формирует описание параметров операции с платежной системой.
//
// Возвращаемое значение:
//  Структура:
//    * ИдентификаторОперации - Строка - идентификатор операции в платежной системы.
//    * ИдентификаторОплаты - Строка -  идентификатор оплаты в платежной системе.
//    * ТипОперации - Строка - тип операции в платежной системе.
//        Возможные значения:
//          см. ПлатежныеСистемыКлиентСервер.ТипОперацииОплата - идентификатор операции оплаты.
//          см. ПлатежныеСистемыКлиентСервер.ТипОперацииВозврат - идентификатор операции возврата.
//    * ДатаОперации - Дата - фактическая дата операции в UTC.
//    * СуммаОперации - Число - фактическая сумма операции.
//
Функция НовыйПараметрыОперации()
	
	Результат = Новый Структура();
	Результат.Вставить("ИдентификаторОперации", "");
	Результат.Вставить("ИдентификаторОплаты", "");
	Результат.Вставить("ТипОперации", "");
	Результат.Вставить("ДатаОперации", '00010101');
	Результат.Вставить("СуммаОперации", 0);
	
	Возврат Результат;
	
КонецФункции

// Определяет вариант настройки на основании идентификатора.
//
// Параметры:
//  ИдентификаторПлатежногоСервиса - Строка - Идентификатор платежного сервиса.
//  Может принимать следующие значения: "ОзонПэй".
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ВариантыНастройкиСБП - вариант настройки Системы быстрых платежей.
//
Функция ПлатежныйСервисПоИдентификатору(
		ИдентификаторПлатежногоСервиса)
	
	Если ИдентификаторПлатежногоСервиса = "ОзонПэй" Тогда
		Возврат Перечисления.ПлатежныеСервисы.ОзонПэй;
	КонецЕсли;
	
	ВызватьИсключение НСтр("ru = 'Не удалось определить платежный сервис по идентификатору'");
	
КонецФункции

#КонецОбласти

#Область НастройкиПодключения

// Получает данные подсказки для платежной системе из сервиса.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * Описание - Строка, ФорматированнаяСтрока - текст описания платежной системы.
//    * Подключение - Строка, ФорматированнаяСтрока - текст подсказки для параметров подключения.
//
Функция ПодсказкиПлатежнойСистемы(ПлатежнаяСистема) Экспорт
	
	Результат = НовыйРезультатОперации();
	Результат.Вставить("Описание", "");
	Результат.Вставить("Подключение", "");
	
	ОписанияПлатежныхСистем = ПлатежныеСистемыСервис.ОписанияПлатежныхСистем();
	
	ПлатежныеСистемыСобытия.ПриОпределенииПодсказокПлатежнойСистемы(
		ПлатежнаяСистема,
		Результат,
		ОписанияПлатежныхСистем);
	
	Возврат Результат;
	
КонецФункции

// Выполняет проверку новой настройки подключения к платежной системе.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - идентификатор проверяемой платежной системы.
//  ДанныеАутентификации - Структура - данные аутентификации в сервисах платежной системы.
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ПроверитьПараметрыПодключенияНового(ПлатежнаяСистема, ДанныеАутентификации) Экспорт
	
	Результат = НовыйРезультатОперации();
	
	ПлатежныеСистемыСобытия.ПриПроверкеПараметровАутентификации(
		ПлатежнаяСистема,
		ДанныеАутентификации,
		Результат);
	
	Возврат Результат;
	
КонецФункции

// Выполняет проверку настройки подключения к платежной системе.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к платежной
//    системе.
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - идентификатор проверяемой платежной системы.
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ПроверитьПараметрыПодключения(НастройкаПодключения, ПлатежнаяСистема) Экспорт
	
	Результат = НовыйРезультатОперации();
	
	ДанныеАутентификации = ДанныеАутентификацииСлужебный(НастройкаПодключения, ПлатежнаяСистема);
	
	ПлатежныеСистемыСобытия.ПриПроверкеПараметровАутентификации(
		ПлатежнаяСистема,
		ДанныеАутентификации,
		Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НастройкиАутентификации

// Добавляет настройки аутентификации на переданную форму.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которую необходимо добавить настройки.
//  Группа - ГруппаФормы - группа для добавления настроек.
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, данные аутентификации которой необходимо
//    отобразить.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//                       - Неопределено - новая настройка подключения.
//
Процедура ДобавитьНастройкиАутентификации(Форма, Группа, ПлатежнаяСистема, НастройкаПодключения = Неопределено) Экспорт
	
	#Если ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
		ВызватьИсключение НСтр(
			"ru = 'Добавление настроек аутентификации недоступно из внешнего соединения и в обычном приложении'");
	#Иначе
		
		Если Форма.Настройки = Неопределено Тогда
			Форма.Настройки = Новый Структура();
		КонецЕсли;
		
		НастройкиАутентификации = РеквизитыНастройкиАутентификации(ПлатежнаяСистема);
		ЭтоНовый = Не ЗначениеЗаполнено(НастройкаПодключения);
		ТипПолеФормы = Тип("ПолеФормы");
		
		// Добавление реквизитов формы
		НовыеРеквизиты = Новый Массив();	// Массив из РеквизитФормы
		Для Каждого ОписаниеРеквизита Из НастройкиАутентификации Цикл
			НовыеРеквизиты.Добавить(
				Новый РеквизитФормы(
					ОписаниеРеквизита.Имя,
					ОписаниеРеквизита.Тип,
					,
					ОписаниеРеквизита.Синоним,
					Не ЭтоНовый));
		КонецЦикла;
		
		Форма.ИзменитьРеквизиты(НовыеРеквизиты);
		Форма.Настройки.Вставить("НастройкиАутентификации", НастройкиАутентификации);
		
		// Добавление элементов формы
		Для Каждого ОписаниеРеквизита Из НастройкиАутентификации Цикл
			
			НовыйЭлемент = Форма.Элементы.Добавить(ОписаниеРеквизита.Имя, ТипПолеФормы, Группа);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = ОписаниеРеквизита.Имя;
			НовыйЭлемент.РежимПароля = ОписаниеРеквизита.РежимПароля;
			НовыйЭлемент.АвтоОтметкаНезаполненного = ОписаниеРеквизита.ПроверкаЗаполнения;
			НовыйЭлемент.Подсказка = ОписаниеРеквизита.Подсказка;
			НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
			
			Если ОписаниеРеквизита.РежимПароля Тогда
				НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииСекретныхДанных");
				НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_НачалоВыбораСекретныхДанных");
			Иначе
				НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииДанныхАутентификации");
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЭтоНовый Тогда
			ЗаполнитьНастройкиАутентификации(Форма, НастройкаПодключения);
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

// Производит проверку заполнения данных аутентификации.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма проверки настроек.
//  Отказ - Булево - если Истина, то в данных аутентификации есть ошибки.
//
Процедура ПроверитьДанныеАутентификации(Форма, Отказ) Экспорт
	
	Для Каждого ОписаниеРеквизита Из Форма.Настройки.НастройкиАутентификации Цикл
		Если ОписаниеРеквизита.ПроверкаЗаполнения
			И Не ЗначениеЗаполнено(Форма[ОписаниеРеквизита.Имя]) Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Поле %1 не заполнено.'"),
					ОписаниеРеквизита.Синоним),
				,
				,
				ОписаниеРеквизита.Имя,
				Отказ);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Производит получение данных аутентификации из формы настройки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма проверки настроек.
//
// Возвращаемое значение:
//  Структура - данные аутентификации.
//
Функция НастройкиАутентификацииПоДаннымФормы(Форма) Экспорт
	
	Результат = Новый Структура();
	
	Для Каждого ОписаниеРеквизита Из Форма.Настройки.НастройкиАутентификации Цикл
		Результат.Вставить(ОписаниеРеквизита.Имя, Форма[ОписаниеРеквизита.Имя]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Заполняет реквизиты данных аутентификации на формах подключения к платежной системе по сохраненным данным.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которой необходимо заполнить настройки.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//
Процедура ЗаполнитьНастройкиАутентификации(Форма, НастройкаПодключения) Экспорт
	
	ЗначенияНастроек = ДанныеАутентификации(НастройкаПодключения);
	ЗаполнитьЗначенияСвойств(Форма, ЗначенияНастроек);
	
КонецПроцедуры

// Выполняет сохранение данных аутентификации в безопасном хранилище.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//  ПараметрыАутентификации - Структура - данные аутентификации к сервисам платежной системы.
//  ПараметрыАутентификацииИзменены - Булево - будет установлено значение Истина, если параметры аутентификации были
//    заменены новыми значениями. Ложь в противном случае.
//
Процедура СохранитьНастройкиАутентификации(
		НастройкаПодключения,
		ПараметрыАутентификации,
		ПараметрыАутентификацииИзменены = Ложь) Экспорт
	
	ПараметрыАутентификацииИзменены = Ложь;
	
	ПлатежнаяСистема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаПодключения, "ПлатежнаяСистема");
	ДанныеХранилища = ДанныеАутентификацииСлужебный(НастройкаПодключения, ПлатежнаяСистема);
	Реквизиты = РеквизитыНастройкиАутентификации(ПлатежнаяСистема);
	СтрокаСекретныхДанных = НастройкиПлатежныхСистемСлужебный.СтрокаСекретныхДанныхПоУмолчанию();
	
	Для Каждого Реквизит Из Реквизиты Цикл
		Если (Не Реквизит.РежимПароля
				И ПараметрыАутентификации[Реквизит.Имя] <> ДанныеХранилища[Реквизит.Имя])
			Или (Реквизит.РежимПароля
				И ПараметрыАутентификации[Реквизит.Имя] <> СтрокаСекретныхДанных) Тогда
			
			ДанныеХранилища[Реквизит.Имя] = ПараметрыАутентификации[Реквизит.Имя];
			ПараметрыАутентификацииИзменены = Истина;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыАутентификацииИзменены Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(НастройкаПодключения, ДанныеХранилища);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Формирует декларативное описание реквизитов аутентификации в сервисах платежной системы.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - идентификатор платежной системы, реквизиты аутентификации
//    которой необходимо получить.
//
// Возвращаемое значение:
//  Массив из см. ПлатежныеСистемыСлужебный.НовыйОписаниеРеквизитов
//
Функция РеквизитыНастройкиАутентификации(ПлатежнаяСистема)
	
	Результат = Новый Массив();	// Массив из см. ПлатежныеСистемыСлужебный.НовыйОписаниеРеквизитов
	
	ПлатежныеСистемыСобытия.ПриОпределенииРеквизитовНастройкиАутентификации(ПлатежнаяСистема, Результат);
	
	Возврат Результат;
	
КонецФункции

// Производит получение данных аутентификации из безопасного хранилища для отображения их в форме подключения.
// Секретные данные аутентификации заменяются результатом метода
// см. НастройкиПлатежныхСистемСлужебный.СтрокаСекретныхДанныхПоУмолчанию.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к платежной
//    системе.
//
// Возвращаемое значение:
//  Структура - данные аутентификации.
//
Функция ДанныеАутентификации(НастройкаПодключения)
	
	ПлатежнаяСистема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаПодключения, "ПлатежнаяСистема");
	Результат = ДанныеАутентификацииСлужебный(НастройкаПодключения, ПлатежнаяСистема);
	Реквизиты = РеквизитыНастройкиАутентификации(ПлатежнаяСистема);
	СтрокаСекретныхДанных = НастройкиПлатежныхСистемСлужебный.СтрокаСекретныхДанныхПоУмолчанию();
	
	Для Каждого Реквизит Из Реквизиты Цикл
		Если Реквизит.РежимПароля
			И ЗначениеЗаполнено(Результат[Реквизит.Имя]) Тогда
			
			Результат[Реквизит.Имя] = СтрокаСекретныхДанных;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Восстанавливает данные аутентификации из безопасного хранилища. Если в безопасном хранилище нет сохраненных данных,
// то будет возвращена пустая структура данных аутентификации.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к платежной
//    системе.
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - идентификатор платежной системы восстанавливаемых данных.
//
// Возвращаемое значение:
//  Структура - данные аутентификации в сервисах платежной системы.
//
Функция ДанныеАутентификацииСлужебный(НастройкаПодключения, ПлатежнаяСистема)
	
	Реквизиты = РеквизитыНастройкиАутентификации(ПлатежнаяСистема);
	
	Результат = Новый Структура();
	Для Каждого Реквизит Из Реквизиты Цикл
		Результат.Вставить(Реквизит.Имя, Реквизит.Тип.ПривестиЗначение());
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(НастройкаПодключения);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДанныеХранилища = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого Реквизит Из Реквизиты Цикл
		Результат[Реквизит.Имя] = Реквизит.Тип.ПривестиЗначение(ДанныеХранилища[Реквизит.Имя]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НастройкиОплаты

// Добавляет настройки оплат на переданную форму.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которую необходимо добавить настройки
//  Группа - ГруппаФормы - группа для добавления настроек.
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, настройки оплаты которой необходимо
//    отобразить.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//                       - Неопределено - новая настройка подключения.
//
Процедура ДобавитьНастройкиОплаты(Форма, Группа, ПлатежнаяСистема, НастройкаПодключения = Неопределено) Экспорт
	
	#Если ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
		ВызватьИсключение НСтр(
			"ru = 'Добавление настроек оплаты недоступно из внешнего соединения и в обычном приложении'");
	#Иначе
		
		Если Форма.Настройки = Неопределено Тогда
			Форма.Настройки = Новый Структура();
		КонецЕсли;
		
		НастройкиПодключения = НастройкиПодключения(ПлатежнаяСистема);
		Реквизиты = РеквизитыНастройкиОплаты(НастройкиПодключения);
		ДобавитьРеквизиты = Новый Массив();	// Массив из РеквизитФормы
		ТипПолеФормы = Тип("ПолеФормы");
		ЭтоНовый = Не ЗначениеЗаполнено(НастройкаПодключения);
		
		Для Каждого ОписаниеРеквизита Из Реквизиты Цикл
			Если Не ОписаниеРеквизита.НастройкаПодключения Тогда
				ДобавитьРеквизиты.Добавить(
					Новый РеквизитФормы(
						ОписаниеРеквизита.Имя,
						ОписаниеРеквизита.Тип,
						,
						ОписаниеРеквизита.Синоним,
						Не ЭтоНовый));
			КонецЕсли;
		КонецЦикла;
		
		Форма.ИзменитьРеквизиты(ДобавитьРеквизиты);
		Форма.Настройки.Вставить("НастройкиОплаты", Реквизиты);
		
		Для Каждого ОписаниеРеквизита Из Реквизиты Цикл
			
			Если ОписаниеРеквизита.НастройкаПодключения Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйЭлемент = Форма.Элементы.Добавить(ОписаниеРеквизита.Имя, ТипПолеФормы, Группа);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = ОписаниеРеквизита.Синоним;
			НовыйЭлемент.ПутьКДанным = ОписаниеРеквизита.Имя;
			НовыйЭлемент.АвтоОтметкаНезаполненного = ОписаниеРеквизита.ПроверкаЗаполнения;
			
			// АПК:280-выкл Доработка внутри области Исключение не требуется
			//@skip-check empty-except-statement
			Попытка
				НовыйЭлемент.ПараметрыВыбора = ОписаниеРеквизита.ПараметрыВыбора;
			Исключение
				// Дополнительной обработки не требуется. Исключение может возникнуть, если настройка функциональных
				// опций конфликтует с настройкой параметров выбора.
			КонецПопытки;
			
			//@skip-check empty-except-statement
			Попытка
				НовыйЭлемент.СвязиПараметровВыбора = ОписаниеРеквизита.СвязиПараметровВыбора;
			Исключение
				// Дополнительной обработки не требуется. Исключение может возникнуть, если настройка функциональных
				// опций конфликтует с настройкой связи параметров выбора.
			КонецПопытки;
			// АПК:280-вкл
			
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииНастройкиОплаты");
			
			// Значения в структуре затираются, чтобы не провоцировать ошибку сериализации значений формы.
			ПустойМассив = Новый Массив();
			ОписаниеРеквизита.СвязиПараметровВыбора = Новый ФиксированныйМассив(ПустойМассив);
			ОписаниеРеквизита.ПараметрыВыбора = Новый ФиксированныйМассив(ПустойМассив);
			
		КонецЦикла;
		
		Если Не ЭтоНовый Тогда
			ЗаполнитьНастройкиОплаты(Форма, НастройкаПодключения, ПлатежнаяСистема, НастройкиПодключения, Реквизиты);
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

// Настраивает элементы настройки приема оплат на формах подключения к платежной системе.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма настройки подключения
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, настройки которой необходимо отобразить.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - ссылка на настройку подключения.
//                       - Неопределено - новая настройка подключения.
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные параметры настройки подключения к платежной
//    системе, которые передаются в методе см. НастройкиПлатежныхСистемКлиент.ПодключитьПлатежнуюСистему
//
Процедура НастроитьЭлементыФормыПодключения(
	Форма,
	ПлатежнаяСистема,
	НастройкаПодключения = Неопределено,
	ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбщиеЭлементы = Новый Структура();
	ОбщиеЭлементы.Вставить("Наименование", Форма.Элементы.Наименование);
	
	НастройкиОплатыЭлементы = Новый Структура();
	НастройкиОплатыЗначения = Новый Структура();
	Для Каждого ЭлементНастройки Из Форма.Настройки.НастройкиОплаты Цикл
		Если Не ЭлементНастройки.НастройкаПодключения Тогда
			НастройкиОплатыЭлементы.Вставить(ЭлементНастройки.Имя, Форма.Элементы[ЭлементНастройки.Имя]);
			НастройкиОплатыЗначения.Вставить(ЭлементНастройки.Имя, Форма[ЭлементНастройки.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыНастройки = Новый Структура();
	ПараметрыНастройки.Вставить("ПлатежнаяСистема" , ПлатежнаяСистема);
	ПараметрыНастройки.Вставить("НастройкаПодключения", НастройкаПодключения);
	
	НастройкиФормы = Новый Структура;
	НастройкиФормы.Вставить("ОбщиеЭлементы" , ОбщиеЭлементы);
	НастройкиФормы.Вставить("НастройкиОплатыЭлементы", НастройкиОплатыЭлементы);
	НастройкиФормы.Вставить("НастройкиОплатыЗначения", НастройкиОплатыЗначения);
	
	ИнтеграцияПодсистемБИП.ПриНастройкеЭлементовФормыПодключенияКПлатежнойСистеме(
		ПараметрыНастройки,
		НастройкиФормы,
		ДополнительныеПараметры);
	ПлатежныеСистемыПереопределяемый.ПриНастройкеЭлементовФормыПодключения(
		ПараметрыНастройки,
		НастройкиФормы,
		ДополнительныеПараметры);
	
КонецПроцедуры

// Заполняет настройки приема платежей на формах подключения к платежной системе.
//
// Параметры:
//  Форма - см. Обработка.ПодключениеКПлатежнымСистемам.Форма.Форма
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, настройки которой необходимо
//    предзаполнить.
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные параметры настройки подключения с платежной
//    системой, которые передаются в методе см. НастройкиПлатежныхСистемКлиент.ПодключитьПлатежнуюСистему.
//
Процедура ЗаполнитьНастройкиОплатыНового(Форма, ПлатежнаяСистема, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбщиеНастройки = Новый Структура();
	ОбщиеНастройки.Вставить("Наименование", Неопределено);
	
	Если ЗначениеЗаполнено(Форма.Параметры.НастройкаДляКопирования)
		И Не Форма.ДанныеКопированияЗагружены Тогда
		ОбщиеНастройки.Наименование = Форма.Наименование;
		ЗаполнитьНастройкиОплаты(
			Форма,
			Форма.Параметры.НастройкаДляКопирования,
			ПлатежнаяСистема);
	КонецЕсли;
	
	НастройкиОплаты = Новый Структура();
	Для Каждого ЭлементНастройки Из Форма.Настройки.НастройкиОплаты Цикл
		Если Не ЭлементНастройки.НастройкаПодключения Тогда
			НастройкиОплаты.Вставить(ЭлементНастройки.Имя, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыНастройки = Новый Структура();
	ПараметрыНастройки.Вставить("ПлатежнаяСистема", ПлатежнаяСистема);
	
	НастройкиФормы = Новый Структура;
	НастройкиФормы.Вставить("ОбщиеНастройки" , ОбщиеНастройки);
	НастройкиФормы.Вставить("НастройкиОплаты", НастройкиОплаты);
	
	ИнтеграцияПодсистемБИП.ПриЗаполненииФормыНастройкиПодключенияКПлатежнойСистеме(
		ПараметрыНастройки,
		НастройкиФормы,
		ДополнительныеПараметры);
	ПлатежныеСистемыПереопределяемый.ПриЗаполненииФормыНастройкиПодключения(
		ПараметрыНастройки,
		НастройкиФормы,
		ДополнительныеПараметры);
	
	Форма.Наименование = НастройкиФормы.ОбщиеНастройки.Наименование;
	Для Каждого КлючЗначение Из НастройкиФормы.НастройкиОплаты Цикл
		Если ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
			Форма[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет реквизиты настройки приема платежей на формах подключения к платежной системе по сохраненным данным.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которой необходимо заполнить настройки.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к платежной
//    системе.
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, настройки оплаты которой необходимо
//    заполнить.
//  НастройкиПодключения - см. НастройкиПодключения
//  НастройкиОплаты - см. РеквизитыНастройкиОплаты
//
Процедура ЗаполнитьНастройкиОплаты(
	Форма,
	НастройкаПодключения,
	ПлатежнаяСистема,
	НастройкиПодключения = Неопределено,
	НастройкиОплаты = Неопределено) Экспорт
	
	Если НастройкиПодключения = Неопределено Тогда
		НастройкиПодключения = НастройкиПодключения(ПлатежнаяСистема);
	КонецЕсли;
	Если НастройкиОплаты = Неопределено Тогда
		НастройкиОплаты = РеквизитыНастройкиОплаты(НастройкиПодключения);
	КонецЕсли;
	
	ЗначенияНастроек = ЗначенияНастроекОплаты(НастройкиОплаты, НастройкиПодключения, НастройкаПодключения);
	ЗаполнитьЗначенияСвойств(Форма, ЗначенияНастроек);
	
КонецПроцедуры

// Получает настройки оплат из формы настройки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для получения настроек оплат.
//
// Возвращаемое значение:
//  Структура
//
Функция НастройкиОплатыПоДаннымФормы(Форма) Экспорт
	
	Результат = Новый Структура();
	Для Каждого ОписаниеРеквизита Из Форма.Настройки.НастройкиОплаты Цикл
		Если Не ОписаниеРеквизита.НастройкаПодключения Тогда
			Результат.Вставить(ОписаниеРеквизита.Имя, Форма[ОписаниеРеквизита.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет заполнения настройки оплаты.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, для которой необходимо выполнить проверку.
//  Отказ - Булево - если Истина, при проверке возникли ошибки.
//
Процедура ПроверитьНастройкиОплаты(Форма, Отказ) Экспорт
	
	Для Каждого ОписаниеРеквизита Из Форма.Настройки.НастройкиОплаты Цикл
		Если Не ОписаниеРеквизита.НастройкаПодключения
			И ОписаниеРеквизита.ПроверкаЗаполнения
			И Не ЗначениеЗаполнено(Форма[ОписаниеРеквизита.Имя]) Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Поле %1 не заполнено.'"),
					ОписаниеРеквизита.Синоним),
				,
				,
				ОписаниеРеквизита.Имя,
				Отказ);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Обновляет настройки оплаты для платежной системы.
//
// Параметры:
//  НастройкиОплаты - Структура - значения заполнения реквизитов настройки приема оплат.
//    Структура параметра соответствует структуре регистра, который определяется в методе
//    см. ПлатежныеСистемыПереопределяемый.ПриНастройкеЭлементовФормыПодключения, за исключением полей указанных в
//    настройках в свойстве ИсключаемыеПоля.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - ссылка на обновляемую настройку.
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - идентификатор настраиваемой платежной системы.
//
// Возвращаемое значение:
//  Структура:
//    * Отказ - Булево - признак отказа от записи.
//    * СообщениеОбОшибке - Строка - сообщение о причине отказа для пользователя.
//
Функция ЗаписатьНастройкиОплаты(НастройкиОплаты, НастройкаПодключения, ПлатежнаяСистема) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Отказ" , Ложь);
	Результат.Вставить("СообщениеОбОшибке", "");
	
	// Запись настройки оплаты
	ПараметрыНастройки = Новый Структура();
	ПараметрыНастройки.Вставить("НастройкаПодключения", НастройкаПодключения);
	ПараметрыНастройки.Вставить("ПлатежнаяСистема" , ПлатежнаяСистема);
	
	Попытка
		ИнтеграцияПодсистемБИП.ПриЗаписиНастроекПодключенияКПлатежнойСистеме(
			ПараметрыНастройки,
			НастройкиОплаты,
			Результат.Отказ,
			Результат.СообщениеОбОшибке);
		ПлатежныеСистемыПереопределяемый.ПриЗаписиНастроекПодключения(
			ПараметрыНастройки,
			НастройкиОплаты,
			Результат.Отказ,
			Результат.СообщениеОбОшибке);
	Исключение
		
		ЗаписатьИнформациюВЖурналРегистрации(
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			Истина);
		
		Результат.Отказ = Истина;
		Результат.СообщениеОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(
			ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Формирует декларативное описание настроек оплат.
//
// Параметры:
//  НастройкиПодключения - см. НастройкиПодключения
//
// Возвращаемое значение:
//  Массив из см. НовыйОписаниеРеквизитов
//
Функция РеквизитыНастройкиОплаты(НастройкиПодключения)
	
	Результат = Новый Массив();	// Массив из см. НовыйОписаниеРеквизитов
	
	КоллекцииАтрибутов = Новый Массив();	// Массив из КоллекцияОбъектовМетаданных
	КоллекцииАтрибутов.Добавить(НастройкиПодключения.ОбъектМетаданных.Измерения);
	КоллекцииАтрибутов.Добавить(НастройкиПодключения.ОбъектМетаданных.Ресурсы);
	КоллекцииАтрибутов.Добавить(НастройкиПодключения.ОбъектМетаданных.Реквизиты);
	
	Для Каждого КоллекцияАтрибутов Из КоллекцииАтрибутов Цикл
		Для Каждого Атрибут Из КоллекцияАтрибутов Цикл
			Если Не СтрНачинаетсяС(Атрибут.Имя, "Удалить")
				И НастройкиПодключения.ИсключаемыеПоля.Найти(Атрибут.Имя) = Неопределено Тогда
				
				ОписаниеРеквизита = НовыйОписаниеРеквизитов(Атрибут.Имя, Атрибут.Синоним, Атрибут.Тип);
				ЗаполнитьЗначенияСвойств(
					ОписаниеРеквизита,
					Атрибут,
					"РежимПароля,Подсказка,СвязиПараметровВыбора,ПараметрыВыбора");
				ОписаниеРеквизита.ПроверкаЗаполнения = (Атрибут.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку);
				
				Результат.Добавить(ОписаниеРеквизита);
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

// Определяет настройки оплат для торговой точки.
//
// Параметры:
//  НастройкиОплаты - см. РеквизитыНастройкиОплаты
//  НастройкиПодключения - см. НастройкиПодключения
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//
// Возвращаемое значение:
//  Структура - содержит значения настроек оплат.
//
Функция ЗначенияНастроекОплаты(НастройкиОплаты, НастройкиПодключения, НастройкаПодключения)
	
	Результат = Новый Структура();
	
	Запрос = Новый Запрос();
	СхемаЗапроса = Новый СхемаЗапроса();
	ПакетЗапроса = СхемаЗапроса.ПакетЗапросов.Добавить();
	Оператор = ПакетЗапроса.Операторы[0];
	
	Оператор.Источники.Добавить(НастройкиПодключения.ОбъектМетаданных.ПолноеИмя());
	Оператор.КоличествоПолучаемыхЗаписей = 2;
	Для Каждого НастройкаОплаты Из НастройкиОплаты Цикл
		Если НастройкаОплаты.НастройкаПодключения Тогда
			Оператор.Отбор.Добавить(НастройкаОплаты.Имя + " = &НастройкаПодключения");
			Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
		Иначе
			Оператор.ВыбираемыеПоля.Добавить(НастройкаОплаты.Имя);
			Результат.Вставить(НастройкаОплаты.Имя, НастройкаОплаты.Тип.ПривестиЗначение());
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 1 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Настройка подключения к сервисам платежной системы ""%1"" связана с более одной настройкой оплаты в регистре сведений ""%2"".'"),
			Строка(НастройкаПодключения),
			НастройкиПодключения.ОбъектМетаданных.Имя);
	ИначеЕсли Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОперацииСТокенамиСервиса

// Выполняет получение данных токена сервиса, сохраненные в безопасное хранилище
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к платежной
//    системе.
//  ИмяСервиса - Строка - имя сервиса в котором использовались токены.
//
// Возвращаемое значение:
//  Структура - см. НовыйОписаниеТокеновСервиса.
//
Функция ПолучитьСохраненныйТокен(НастройкаПодключения, ИмяСервиса)
	
	Результат = НовыйОписаниеТокеновСервиса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		НастройкаПодключения);
		
	УстановитьПривилегированныйРежим(Ложь);

	Если ДанныеХранилища = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Эталон = Новый Структура("Служебный_ДанныеТокенов", Неопределено);
	ЗаполнитьЗначенияСвойств(Эталон, ДанныеХранилища);
	
	Если ТипЗнч(Эталон.Служебный_ДанныеТокенов) <> Тип("Соответствие") Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДанныеТокена = Эталон.Служебный_ДанныеТокенов.Получить(ИмяСервиса);
	Если ТипЗнч(ДанныеТокена) <> Тип("Структура") Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, ДанныеТокена);
	
	Возврат Результат;
	
КонецФункции

// Выполняет токена сервиса в безопасное хранилище
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к платежной
//    системе.
//  ИмяСервиса - Строка - имя сервиса в котором использовались токены.
//  ДанныеТокенаСервиса - см. НовыйОписаниеТокеновСервиса.
//  
Процедура СохранитьТокенСервиса(НастройкаПодключения, ИмяСервиса, ДанныеТокенаСервиса)
	
	Эталон = НовыйОписаниеТокеновСервиса();
	Если ТипЗнч(ДанныеТокенаСервиса) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Эталон, ДанныеТокенаСервиса);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СохраненныеДанные = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		НастройкаПодключения);
		
	Если СохраненныеДанные = Неопределено Тогда
		СохраненныеДанные = Новый Структура;
	КонецЕсли;
	
	СохраненныеТокены = Новый Структура("Служебный_ДанныеТокенов", Неопределено);
	ЗаполнитьЗначенияСвойств(СохраненныеТокены, СохраненныеДанные);
	
	Если ТипЗнч(СохраненныеТокены.Служебный_ДанныеТокенов) <> Тип("Соответствие") Тогда
		СохраненныеТокены.Служебный_ДанныеТокенов = Новый Соответствие;
	КонецЕсли;
	
	СохраненныеТокены.Служебный_ДанныеТокенов.Вставить(ИмяСервиса, Эталон);
	
	СохраненныеДанные.Вставить("Служебный_ДанныеТокенов", СохраненныеТокены.Служебный_ДанныеТокенов);

	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
		НастройкаПодключения,
		СохраненныеДанные);

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Создает описание структуры с данными токенов сервисов - потребителей.
//
// Возвращаемое значение:
//  Структура - данные токенов сервисов - потребителей:
//   * Идентификатор - Строка - идентификатор токена,
//   * Токен - Строка - Значение токена.
//   
Функция НовыйОписаниеТокеновСервиса()
	
	ОписаниеТокена = Новый Структура;
	ОписаниеТокена.Вставить("Идентификатор", "");
	ОписаниеТокена.Вставить("Токен", "");
	
	Возврат ОписаниеТокена;
	
КонецФункции

// Выполняет отзыв токена сервиса для переданной настройки подключения.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей - настройка подключения к СБП.
//  ИмяСервиса - Строка - имя сервиса в котором использовались токены.
//  РезультатОперации - результат операции:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//     может быть обработан вызывающим методом;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Процедура ОтозватьТокен(НастройкаПодключения,  ИмяСервиса, РезультатОперации)
	
	ИдентификаторСервиса = НастройкиПлатежныхСистемСлужебный.ИдентификаторСервисаПоИмени(ИмяСервиса);
	
	Если ИдентификаторСервиса = Неопределено Тогда
		РезультатОперации.СообщениеОбОшибке = НСтр("ru = 'Передано неизвестное имя сервиса.'");
		РезультатОперации.ИнформацияОбОшибке = НСтр("ru = 'Передано неизвестное имя сервиса.'");
		Возврат;
	КонецЕсли;
	
	ДанныеТокенаСервиса = ПолучитьСохраненныйТокен(НастройкаПодключения, ИмяСервиса);
	
	ИдентификаторыТокенов = Новый Массив;
	
	Если ЗначениеЗаполнено(ДанныеТокенаСервиса.Идентификатор) Тогда
		ИдентификаторыТокенов.Добавить(ДанныеТокенаСервиса.Идентификатор);
		
		ДанныеТокенаСервиса.Идентификатор = "";
		ДанныеТокенаСервиса.Токен = "";
		
	КонецЕсли;

	Если ИдентификаторыТокенов.Количество() > 0 Тогда
		
		РезультатВызова = ПлатежныеСистемыСервис.ОперацияОтзывТокеновАутентификацииСервиса(
			НастройкаПодключения,
			ИдентификаторыТокенов,
			ИмяСервиса);
			
		Если Не ПустаяСтрока(РезультатВызова.КодОшибки) Тогда
			ЗаполнитьЗначенияСвойств(РезультатОперации, РезультатВызова, , "КодОшибки");
			Возврат;
		КонецЕсли;
		
		// Сохраняем токен только в случае успешного отключения
		СохранитьТокенСервиса(
			НастройкаПодключения,
			ИмяСервиса,
			ДанныеТокенаСервиса);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти