#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НаименованиеСправочникаПользователей = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"НаименованиеСправочникаПользователей", "Пользователи");
	ЕстьСправочникПользователей = КонтурЗакупки_ЛокализацияСервер.ЕстьСправочник(НаименованиеСправочникаПользователей);
	Элементы.Ответственный.Видимость = ЕстьСправочникПользователей;
	Список.Параметры.УстановитьЗначениеПараметра("НаименованиеСправочникаПользователей", "Справочники."
		+ НаименованиеСправочникаПользователей);

	Если РольДоступна(Метаданные.Роли.КонтурЗакупки_ОграниченныйПользователь) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИДОтветственного");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение = XMLСтрока(
			КонтурЗакупки_ЛокализацияВызовСервера.ПолучитьТекущегоПользователя().УникальныйИдентификатор());
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Параметры.РежимВыбора Тогда
		ОповеститьОВыборе(ВыбраннаяСтрока); 
	Иначе                    
		СтандартнаяОбработка = Ложь;
		СтрукПараметров = Новый Структура;
		СтрукПараметров.Вставить("ШаблонПоиска", Элемент.ТекущаяСтрока);
		
		ОткрытьФорму("Обработка.КонтурЗакупки_ПоискЗакупок.Форма.Форма", СтрукПараметров);     		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
		
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШаблону(Команда) 
	
	СтрукПараметров = Новый Структура;
	СтрукПараметров.Вставить("ШаблонПоиска", Элементы.Список.ТекущаяСтрока);
	
	ОткрытьФорму("Обработка.КонтурЗакупки_ПоискЗакупок.Форма.Форма", СтрукПараметров);     
	
КонецПроцедуры

#КонецОбласти