#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ТипСправочникаЛогистика") Тогда
		Возврат;
	КонецЕсли;
	
	ТипСправочникаЛогистика = Параметры.ТипСправочникаЛогистика;
	
	НастройкаКонвертации = НастройкаКонвертацииПоИмениСправочника(ТипСправочникаЛогистика);
	
	ОбновитьДанныеПоНастройкеКонвертации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьДоступность();
	
	Если ТипСправочникаЛогистика = "КонтурЛогистика_ОрганизацииДиадок" Тогда
		Элементы.ОбъектыУчетнойСистемыОбъектУчетнойСистемы.Заголовок = "Наименование";
		Элементы.ОбъектыУчетнойСистемыОсновнойРеквизитУчетнойСистемы.Видимость = Истина;
		Элементы.ОбъектыУчетнойСистемыОсновнойРеквизитУчетнойСистемы.Заголовок = "ИНН";		
	Иначе
		Элементы.ОбъектыУчетнойСистемыГруппа.ОтображатьВШапке = Ложь;
		Элементы.ОбъектыУчетнойСистемыОсновнойРеквизитУчетнойСистемы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаКонвертацииПриИзменении(Элемент)
	
	ОбновитьДанныеПоНастройкеКонвертации();
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыУчетнойСистемы

&НаКлиенте
Процедура ОбъектыУчетнойСистемыПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОбъектыУчетнойСистемы.ТекущиеДанные;
	Если Не ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ПомеченнаяГруппа = ОбъектыУчетнойСистемы.НайтиПоИдентификатору(Элементы.ОбъектыУчетнойСистемы.ТекущаяСтрока);
	ПометитьЭлементыГруппы(ПомеченнаяГруппа.ПолучитьЭлементы(), ТекущиеДанные.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьЭлементыГруппы(ЭлементыГруппы, ЗначениеПометки, Отбор = Неопределено)
	
	Для Каждого ТекущийЭлементГруппы Из ЭлементыГруппы Цикл
		
		Если ТекущийЭлементГруппы.ЭтоГруппа Тогда
			ПометитьЭлементыГруппы(ТекущийЭлементГруппы.ПолучитьЭлементы(), ЗначениеПометки, Отбор);
		КонецЕсли;
		
		Если Отбор = Неопределено Тогда
			ТекущийЭлементГруппы.Пометка = ЗначениеПометки;
		Иначе
			Если ТекущийЭлементГруппы[Отбор.ИмяРеквизита] = Отбор.Значение Тогда
				ТекущийЭлементГруппы.Пометка = ЗначениеПометки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыУчетнойСистемыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОбъектыУчетнойСистемы.ТекущиеДанные;
	
	Если Поле = Элементы.ОбъектыУчетнойСистемыОбъектУчетнойСистемы
		И ЗначениеЗаполнено(ТекущиеДанные.ОбъектУчетнойСистемы) Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекущиеДанные.ОбъектУчетнойСистемы);
		
	ИначеЕсли Поле = Элементы.ОбъектыУчетнойСистемыОбъектЛогистики
		И ЗначениеЗаполнено(ТекущиеДанные.ОбъектЛогистики) Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекущиеДанные.ОбъектЛогистики);
		
	ИначеЕсли Поле = Элементы.ОбъектыУчетнойСистемыДействие
		И ЗначениеЗаполнено(ТекущиеДанные.Действие) Тогда
		
		ОбработатьСтрокуОбъектаУчетнойСистемы(Элементы.ОбъектыУчетнойСистемы.ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПротоколНажатие(Элемент)
	
	Элементы.Протокол.Видимость = Не Элементы.Протокол.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обработать(Команда)
	
	ОбработатьОбъектыУчетнойСистемыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ПометитьЭлементыГруппы(ОбъектыУчетнойСистемы.ПолучитьЭлементы(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ПометитьЭлементыГруппы(ОбъектыУчетнойСистемы.ПолучитьЭлементы(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьДействиеСоздать(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяРеквизита", "Действие");
	Отбор.Вставить("Значение", "создать");
	
	ПометитьЭлементыГруппы(ОбъектыУчетнойСистемы.ПолучитьЭлементы(), Истина, Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьДействиеПерезаполнить(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяРеквизита", "Действие");
	Отбор.Вставить("Значение", "перезаполнить");
	
	ПометитьЭлементыГруппы(ОбъектыУчетнойСистемы.ПолучитьЭлементы(), Истина, Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПротокол(Команда)
	
	Протокол = "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	
	ЕстьНастройка = ЗначениеЗаполнено(НастройкаКонвертации);
	
	Элементы.ОбъектыУчетнойСистемы.Видимость = ЕстьНастройка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкаКонвертацииПоИмениСправочника(ТипСправочникаЛогистика)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипСправочникаЛогистика", ТипСправочникаЛогистика);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников
	|ГДЕ
	|	НЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаЛогистика = &ТипСправочникаЛогистика";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеПоНастройкеКонвертации()
	
	Если Не ЗначениеЗаполнено(НастройкаКонвертации) Тогда
		Возврат;
	КонецЕсли;
	
	ТипСправочникаЛогистика = НастройкаКонвертации.ТипСправочникаЛогистика;
	ТипСправочникаИлиДокументаУС = НастройкаКонвертации.ТипСправочникаИлиДокументаУС;
	
	ЭтоДокумент = (Метаданные.Справочники.Найти(ТипСправочникаИлиДокументаУС) = Неопределено);
	
	Если ЭтоДокумент Тогда
		Иерархический = Ложь;
	Иначе
		Иерархический = Метаданные.Справочники.Найти(ТипСправочникаИлиДокументаУС).Иерархический;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	<ТипСправочникаИлиДокументаУС>.Ссылка КАК ОбъектУчетнойСистемы,
	|	<ТипСправочникаИлиДокументаУС>.ЭтоГруппа КАК ЭтоГруппа,
	|	МАКСИМУМ(<ТипСправочникаЛогистика>.Ссылка) КАК ОбъектЛогистики,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ <ТипСправочникаЛогистика>.Ссылка) КАК КоличествоОбъектовЛогистики,
	|	ВЫБОР
	|		КОГДА <ТипСправочникаИлиДокументаУС>.ЭтоГруппа
	|			ТОГДА """"
	|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ <ТипСправочникаЛогистика>.Ссылка) = 0
	|			ТОГДА ""создать""
	|		ИНАЧЕ ""перезаполнить""
	|	КОНЕЦ КАК Действие
	|ИЗ
	|	<ТипГлавногоОбъекта>.<ТипСправочникаИлиДокументаУС> КАК <ТипСправочникаИлиДокументаУС>
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.<ТипСправочникаЛогистика>.СвязанныеОбъекты КАК <ТипСправочникаЛогистика>
	|		ПО (<ТипСправочникаЛогистика>.СвязанныйОбъект = <ТипСправочникаИлиДокументаУС>.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	<ТипСправочникаИлиДокументаУС>.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектУчетнойСистемы ИЕРАРХИЯ";
	
	// Подставим в запросе значения переменных
	Если Не Иерархический Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ТипСправочникаИлиДокументаУС>.ЭтоГруппа", "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЕРАРХИЯ", "");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ТипСправочникаЛогистика>", ТипСправочникаЛогистика);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ТипСправочникаИлиДокументаУС>", ТипСправочникаИлиДокументаУС);
	Если ЭтоДокумент Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ТипГлавногоОбъекта>", "Документ");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ТипГлавногоОбъекта>", "Справочник");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Иерархический Тогда
		ИерархическаяВыборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Иначе
		ИерархическаяВыборка = РезультатЗапроса.Выбрать();
	КонецЕсли;
	
	ДеревоОбъектыУчетнойСистемы = РеквизитФормыВЗначение("ОбъектыУчетнойСистемы");
	
	// Заполним дерево
	ДеревоОбъектыУчетнойСистемы.Строки.Очистить();
	ЗаполнитьДеревоОбъектыУчетнойСистемы(ДеревоОбъектыУчетнойСистемы.Строки, ИерархическаяВыборка);
	
	ЗначениеВРеквизитФормы(ДеревоОбъектыУчетнойСистемы, "ОбъектыУчетнойСистемы");
	
	СоответствиеТиповЗначениям = Перечисления.КонтурЛогистика_СпособыКонвертации.СоответствиеТиповЗначениям();
	СпособыКонвертации = СоответствиеТиповЗначениям.Получить(Тип("СправочникСсылка." + ТипСправочникаЛогистика));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОбъектыУчетнойСистемы(СтрокиДерева, Выборка)
	
	Пока Выборка.Следующий() Цикл 
		
		НовСтрока = СтрокиДерева.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		
		// Заполним основные реквизиты объектов учетной системы
		Если ТипСправочникаЛогистика = "КонтурЛогистика_ОрганизацииДиадок" Тогда
			Если Выборка.ОбъектУчетнойСистемы.Метаданные().Реквизиты.Найти("ИНН") <> Неопределено Тогда
				НовСтрока.ОсновнойРеквизитУчетнойСистемы = Выборка.ОбъектУчетнойСистемы.ИНН;
			КонецЕсли;
		КонецЕсли;
		
		ВыборкаПодчиненная = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Если ВыборкаПодчиненная.Количество() <> 0 Тогда 
			
			ЗаполнитьДеревоОбъектыУчетнойСистемы(НовСтрока.Строки, ВыборкаПодчиненная);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуОбъектаУчетнойСистемы(ТекущаяСтрока)
	
	ТекущиеДанные = ОбъектыУчетнойСистемы.НайтиПоИдентификатору(ТекущаяСтрока);
	
	ОбработатьЭлемент(ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОбъектыУчетнойСистемыНаСервере()
	
	ДобавитьВПротокол("=== Начало обработки ===");
	
	ОбработатьЭлементыУчетнойСистемыНаСервере(ОбъектыУчетнойСистемы.ПолучитьЭлементы());
	
	ДобавитьВПротокол("=== Окончание обработки ===");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЭлементыУчетнойСистемыНаСервере(ЭлементыОбработки)
	
	Для Каждого ТекущиеДанные Из ЭлементыОбработки Цикл
		
		Если ТекущиеДанные.ЭтоГруппа Тогда
			
			ОбработатьЭлементыУчетнойСистемыНаСервере(ТекущиеДанные.ПолучитьЭлементы());
			
		Иначе
			
			Если Не ТекущиеДанные.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			ОбработатьЭлемент(ТекущиеДанные);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЭлемент(ЭлементУчетнойСистемы)
	
	ЭтоКонвертация = Ложь;
	
	Результат = КонтурЛогистика_КонвертацияСервер.КонвертироватьЗначениеВОбъектЛогистики(ЭлементУчетнойСистемы.ОбъектУчетнойСистемы,
		НастройкаКонвертации, СпособыКонвертации, ЭтоКонвертация);
	
	Если Результат.Успешно Тогда
		
		Если Результат.Свойство("Значение") Тогда
			ЭлементУчетнойСистемы.ОбъектЛогистики = Результат.Значение;
			Если ЭлементУчетнойСистемы.КоличествоОбъектовЛогистики = 0 Тогда
				ЭлементУчетнойСистемы.КоличествоОбъектовЛогистики = 1;
				ЭлементУчетнойСистемы.Действие = "перезаполнить";
			КонецЕсли;
		КонецЕсли;
		
		ТекстСообщения = Строка(ЭлементУчетнойСистемы.ОбъектУчетнойСистемы) + " >> " + Строка(ЭлементУчетнойСистемы.ОбъектЛогистики);
		ДобавитьВПротокол(ТекстСообщения);
		
	Иначе
		
		ТекстСообщения = "Ошибка при конвертации объекта: " + Строка(ЭлементУчетнойСистемы.ОбъектУчетнойСистемы) + "
			|Текст ошибки: " + Результат.ОписаниеОшибки;
		ДобавитьВПротокол(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВПротокол(ТекстСообщения)
	
	Протокол = Строка(ТекущаяДатаСеанса()) + " " + ТекстСообщения
		+ ?(Протокол = "", "", Символы.ПС) + Протокол;
	
КонецПроцедуры

#КонецОбласти