#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Заголовок", Заголовок);
	Параметры.Свойство("ТекстВопроса", ТекстВопроса);
	
	Если Не ЗначениеЗаполнено(Заголовок) Тогда
		Заголовок = "Контур.Логистика";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДа(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Ответ", Истина);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНет(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Ответ", Ложь);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура БольшеНеСпрашивать(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("БольшеНеСпрашивать");
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти